          இரீட்டா இராகேசு யாசு சீலா ரோகன்

11 முதல் 14 வயது வரையிலான நண்பர்கள் கும்பல்.


          விக்ரம் எமதூதன்

விக்ரம் - கும்பலில் மிகவும் பிரபலமானவர், அவர்களின் மட்டைப்பந்து அணியின் தலைவர்.
எமதூதன் - எமராசாவின் தூதுவர், விக்ரமை தன்னிடம் அழைத்து வரும்படி எமராசாவால் அறிவுறுத்தப்பட்டுள்ளார்.


எமராசா
காவலாளி

எமராசா - மரணத்தின் கடவுள், ஆனால் இங்கே அவர் வேடிக்கையாகவும் குழந்தைத்தனமாகவும் காட்டப்படுகிறார், டிவி பார்ப்பதை விரும்புகிறார்.
காவலாளி - எமராசாவின் அரண்மனைக்கு வெளியே நின்று அதைக் காக்கிறான்.


எமராசா மற்றும் எமதூதன் ஆகியோருக்கான ஆடைகளை வடிவமைத்தல்

படைப்பு இருக்கும். அமைப்புகளை உருவாக்க, காகிதம், செய்தித்தாள், வெம்மெத்து மற்றும் பள்ளியில் கிடைக்கும் பிற பொருட்களைப் பயன்படுத்தவும்.
இந்த நாடகம் மூன்று அமைப்புகளுடன் நன்றாக வேலை செய்கிறது - கதாபாத்திரங்கள் முதலில் சந்திக்கும் தோட்டம், ஒரு உட்புற அறை மற்றும் எமராசாவின் வரவேற்புக்கூடம். மூன்று கதாபாத்திரங்களுக்குக் குறிப்பிட்ட உடைகள் அல்லது தலைக்கவசம் மற்றும் நகைகள் மட்டுமே தேவை. அவர்கள் மணிகள் கொண்ட கழுத்தணிகள் மற்றும் காகித அட்டையால் செய்யப்பட்ட தலைக்கவசங்களை அணியலாம்.


இசை மற்றும் நாடகம்

அடுக்கு ஒலி அல்லது கூட்டுப்பாடலை உருவாக்குங்கள். ஒரு சில பாடகர்கள் ஒரு காட்சிக்கான மனநிலையை அமைப்பதற்காக அல்லது நாடகத்தின் முக்கியமான தருணங்களில் நாடகத்தை சேர்க்க சிறகுகளில் இருந்து இசைக்கருவிகளுடன் இவற்றைப் பாடலாம்.


அனுமதி தேவையில்லை


புத்தகங்களில் பெரும்பாலான நாடகங்களின் முடிவில் நாடகத்தை அரங்கேற்ற நாடக ஆசிரியரின் அனுமதி வேண்டும் என்று ஒரு வரி இருப்பதை நீங்கள் கவனித்திருப்பீர்கள். இருப்பினும், இந்த நாடகத்தை அரங்கேற்ற, பதிப்புரிமை இல்லாததால் நீங்கள் அவ்வாறு செய்ய வேண்டியதில்லை. இதன் பொருள் நீங்கள் விரும்பியபடி நாடகத்தை அரங்கேற்றலாம். தயங்காமல் புதிய சிந்தனைகளை இணைத்துக்கொள்ளுங்கள்.



காட்சி 1

திரை திறந்ததும், தோட்ட அமைப்பில் மேடையில் சில குழந்தைகள் உள்ளனர். ஏதோ பேசிக் கொண்டிருக்கிறார்கள்.

இரீட்டா: ஏய், விக்ரம் பற்றிக் கேள்விப்பட்டாயா? அவனுக்கு மலேரியா பாதிப்பு இருப்பது தெரிகிறது. அவருக்கு இவ்வளவு நோய் இருந்ததில் ஆச்சரியமில்லை!


இராகேசு: ஆமாம், நான் அதைப் பற்றிக் கேள்விப்பட்டேன். நேற்று அவன் அம்மாவிடம் பேசினேன். அவன் இறுதியாகச் சரியான மருந்துகளுடன் சிகிச்சை அளிக்கப்படுகிறான் என்று கூறினார்.

சீலா: பாவம் தோழா, அவன் இப்போது எப்படித் தேர்வு எழுதப் போகிறான்?

யாஷ்: முட்டாள் பெண்ணே, அவன் எப்படி ஏழையாக இருக்க முடியும்? அதிர்ஷ்டவசமாக அவரால் தேர்வு எழுத முடியவில்லை. நான் அவரை எப்படி பொறாமைப்படுகிறேன்! படிப்பு இல்லை, டென்ஷன் இல்லை, கழுத்தில் மூச்சு விடவில்லை. அங்கேயே படுத்துக் கொள்ளுங்கள். (ரீட்டாவின் அருகில் சென்று) என்னைப் பார், நான் நாள் முழுவதும் படிப்பது மட்டும்தான்.


ரீட்டா: (சிரிக்கிறார்) இயற்கையாகவே நீங்கள் நாள் முழுவதும் படிக்க வேண்டும். இல்லாவிட்டால் எப்படி கடந்து செல்வீர்கள், முட்டாள்?

யாஷ்: என் காலை இழுப்பதை விட உன்னிடம் எதுவும் செய்ய வேண்டாமா? நீங்கள் மற்ற நாள் செய்ததைப் பற்றி நான் கும்பலிடம் சொல்லும் வரை காத்திருங்கள்! உனக்கு தெரியும், அவள்... (ரீட்டா அவனை நிறுத்தினாள்.)

ரீட்டா: ஷ்! ஷ்! இன்னும் ஏதாவது சொன்னால் சொல்கிறேன்...

ரோஹன்: ஐயோ! மூன்றாம் உலகப் போர் தொடங்கப் போகிறது. நீங்கள் இருவரும் ஒருபோதும் கைவிடுவதில்லை, இல்லையா?


யாஷ்: அவள் தான், அவள் அப்படி.. அப்படி.. அப்படி... எரிச்சல்! அவள் நன்றாகப் படிப்பதால் அவள் தனக்கு முடிவே இல்லை என்று நினைக்கிறாள்.

 

ரீட்டா: நான் கைவிடவில்லை! ஹா! சண்டையைத் தொடங்குவது யாஷ், நான் அல்ல.


ரோஹன்: நிறுத்து இரு! நீங்கள் குழந்தைகளை விட மோசமானவர். சீக்கிரம், நாம் சென்று விக்ரமைப் பார்க்க வேண்டும் என்பது உங்களுக்கு நினைவில்லையா?

 

(யாஷும் ரீட்டாவும் ஒருவரையொருவர் பார்த்துக் கொள்கிறார்கள். அனைவரும் மேடையின் ஒரு இறக்கையில் இருந்து புறப்படுகிறார்கள். மற்றொரு இறக்கையில் இருந்து மேடைக்குத் திரும்புகிறார்கள்).

காட்சி 2


(இது விக்ரமின் வீடு. குழந்தைகள் விக்ரம் பேசுவதைக் கேட்கிறார்கள். உள்ளே நுழையும் போதே விக்ரம் யாரிடமோ பேசிக் கொண்டிருப்பதைக் காணலாம். இந்த நபர் வித்தியாசமாக உடையணிந்து, புராணக் கதாபாத்திரம் போல் இருக்கிறார். யம்தூத், யாம்ராஜின் தூதுவர். )


யம்தூத்: (படுக்கையில் படுத்திருக்கும் விக்ரமிடம் யம்தூத் பேசுகிறான்) வா குழந்தை. நான் யம்தூத், நீ என்னுடன் வரவேண்டும்.(தனது பாக்கெட்டிலிருந்து எதையோ எடுக்கிறான்) பார், உன்னுடைய காலாவதி தேதி வந்துவிட்டது என்று இங்கே தெளிவாகச் சொல்கிறது அன்பே. எனவே நீங்கள் இப்போது உலகிற்கு விடைபெற்று என்னுடன் என் உலகத்திற்கு வர வேண்டும்.
விக்ரம்: (குழப்பமாக பார்க்கிறார்) என்னுடன் என் உலகத்திற்கு வா என்று என்ன சொல்கிறாய்? உன்னை அனுப்பியது யார் என்று எனக்குத் தெரியும்? (தாள் சுட்டிக்காட்டி) அது என்ன?


(விக்ரம் பேப்பரைப் பார்க்க முயற்சிக்கிறார், யம்தூத் அவரை படுக்கையில் இருந்து வெளியே இழுக்க முயற்சிக்கிறார், கடிகாரத்தைப் பார்க்கிறார். குழந்தைகள் இதையெல்லாம் பார்த்துக்கொண்டு என்ன நடக்கிறது என்று கண்டுபிடிக்க முயற்சிக்கிறார்கள்).
விக்ரம்: ஏய்! நீ என்ன செய்து கொண்டிருக்கிறாய்? ஏன் என்னைத் தூக்கப் பார்க்கிறாய்? கேள்...

 

யம்தூத்: நான் யம்தூத், யம்ராஜின் தூதர். மேலும், நான் உங்கள் பேச்சைக் கேட்க வேண்டியதில்லை. நான் என் முதலாளி சொல்வதை மட்டுமே கேட்கிறேன். புரிந்ததா? வா, எழுந்திரு! (அவரது காகிதத்தைப் பார்க்கிறார்) நாம் வெளியேற வேண்டும். நான் உன்னை யம்ராஜிடம் ஒப்படைத்தவுடன், எனக்கு டெல்லியில் உடனடி சந்திப்பு உள்ளது. இந்த நாட்களில் நாங்கள் யம்தூட்கள் மிகவும் பிஸியாக இருக்கிறோம்.


ஏய், (விக்ரமுக்கு மிக அருகில் சென்று) நான் உங்களுக்கு ஒன்று சொல்கிறேன். நான் ஓவர் டைம் வேலை செய்ய விரும்புகிறேன், அதற்காக எங்களுக்கு நல்ல சம்பளம் கிடைக்கும். ஆனால் போதும். நாம் இப்போது புறப்பட வேண்டும் குழந்தை, அதிக ஓவர்டைம் நல்லதல்ல. (குழந்தைகள் நடவடிக்கை எடுக்க முடிவு செய்யும் போது அவர் விக்ரமை வெளியே இழுத்து வெளியே செல்ல உள்ளார்.)

யாஷ்: (வெளியே சென்று அவனைத் தடுத்து) ஏய், நீ யார், என்ன செய்கிறாய்?

 

ஷீலா: ஆமாம் சொல்லுங்க....


ரீட்டா: (யாம்தூத்தை சுற்றி நடக்கிறார், மிகவும் உத்தியோகபூர்வ தோற்றம்) எனவே நீங்கள் உங்களை யம்தூத் என்று அழைக்கிறீர்கள். விக்ரமை எங்கு அழைத்துச் செல்கிறீர்கள் என்று நினைக்கிறீர்கள்? (யாம்தூத் விக்ரமின் கையில் உறுதியான பிடியில் இருக்கிறார்)

 

விக்ரம்: (ஆச்சரியத்துடன்) உங்கள் அனைவருக்கும் வணக்கம்!


ராகேஷ்: ஹாய்! இப்போது எப்படி உணர்கிறீர்கள் விக்ரம்?


விக்ரம்: பெட்டர், பெட்டர். ஆனால் என்னைப் பொருட்படுத்தாதே. தன்னை யம்தூத் என்று அழைக்கும் எனது பார்வையாளரை சந்திக்கவும். (யம்தூத் கண்ணை கூசும்)

அசல்

யமராஜ் என்னை அவனது இருப்பிடத்திற்கு அழைத்துச் செல்லும்படி கட்டளையிட்டுள்ளார் என்று அவர் கூறுகிறார்.


ராகேஷ்: அவர் உங்களை அழைத்துச் செல்லப் போகிறாரா? எங்கே? (எழுந்து பார்க்கிறது)

 

ஷீலா: இது ரொம்ப அதிகம்!

 

ரோஹன்: யம்தூத், யாரை உன்னுடன் அழைத்துச் செல்கிறாய்? அவரையா? (விக்ரமைக் காட்டி) நம் அனுமதி இல்லாமல்? எவ்வளவு தைரியம்!

 

யாஷ்: (யம்தூத்தின் தோளில் கை வைத்து) கேள் யம்பைய்யா. இது விக்ரம், எங்கள் சிறந்த நண்பர் மற்றும் எங்கள் கும்பலின் தலைவன்.


ஷீலா: (யாஷை ஒதுக்கித் தள்ளி) அதுவும் எங்கள் கிரிக்கெட் அணியின் கேப்டன்!
ராகேஷ்: சரி. அதனால் அவருக்கு மலேரியா உள்ளது. அதற்காக அவரைத் தூக்கிச் செல்லலாம் என்று அர்த்தமில்லை.

 

ரீட்டா: இது ஏற்றுக்கொள்ள முடியாதது! இது சுத்த தாதாகிரி!

 

ரோஹன்: இது தாதாகிரி இல்லை. இது யாம்கிரி என் அன்பே. யாம்கிரி!

 

(இப்போது யம்தூத் மிகவும் எரிச்சலடைந்து, மிகவும் குழப்பமடைந்துள்ளார். விக்ரமை யம்ராஜிடம் அழைத்துச் செல்லாவிட்டால், நரகம் அழிந்துவிடும் என்பதை நன்கு அறிந்து மீசையைத் தொடுகிறார். அந்த யோசனையே பயமுறுத்துவதாகவும், கவலையாகவும் தெரிகிறது.)


யாஷ்: யாம்பாய் ஒன்றும் செய்யவில்லை. உங்களால் விக்ரமை அழைத்துச் செல்ல முடியாது, அதுவே இறுதியானது. (விக்ரமை அவனை நோக்கி இழுக்க முயல்கிறான், யம்தூதும் அவ்வாறே செய்கிறான்.)

யம்தூத்: நான் மிகவும் குழப்பத்தில் இருக்கிறேன்.

 

ராகேஷ்: அதை பார்க்கலாம். (சிரிக்கிறார்) எப்படியிருந்தாலும், ஒன்று உறுதியாக உள்ளது. விக்ரம் எங்கும் செல்லவில்லை. தெளிவாக இருக்கிறதா?


ரோஹன்: நீ எப்படி அவனை அப்படி எடுக்க முடியும்?

 

யாஷ்: விஷயங்களைப் புரிந்து கொள்ள உங்களுக்கு கொஞ்சம் அறிவு இருக்க வேண்டும். (யாம்தூத் தனது கைகளை தலையில் வைத்து, மிகவும் கோபமாக)

 

யம்தூத்: ஹே பகவான்! (தன் தவறை உணர்ந்து) யாம்ராஜ் நான் இப்போது என்ன செய்வது? விக்ரம் என்னுடன் செல்ல வேண்டும் என்று இந்த குழந்தைகளுக்கு ஏன் புரியவில்லை.

வாருங்கள், எங்களுக்கு மிகவும் தாமதமாகிறது. (அவனை இழுக்கிறார். ரோஹன் அவர்கள் முன் ஒரு கேடயம் போல் நிற்கிறார். யம்தூத்தை பிடித்துக் கொள்கிறார்.)
யம்தூத்: (வருத்தம்) நான் இப்போது உன்னை என்ன செய்வேன்?


ரோஹன்: உனக்கு என்ன வேணும். நான் எல்லாம் உன்னுடையவன்.

 

யாஷ்: (சிரிக்கிறார்) ஆம், ராகேஷ் என்ன சொன்னார் நண்பரே?


யம்தூத்: நானா?


யாஷ்: ஆமாம் நீ.


ரோஹன்: இது 21ஆம் நூற்றாண்டு, இது இந்தியா என்று நாங்கள் சொல்லிக் கொண்டிருந்தோம்.

 

ஷீலா: மலேரியா இனி இங்கு கொடிய நோயல்ல.

ரோஹன்: அதுமட்டுமின்றி, விக்ரம் எடுத்துக்கொண்டிருக்கும் மலேரியாவை குணப்படுத்த இப்போது மருந்துகள் உள்ளன.

 

ஷீலா: இன்னும் கொஞ்ச நேரம்தான் அவன் குணமாகிறான். இதோ, அவருடைய மருந்துகளைப் பாருங்கள் (யாம்தூத்தை மருந்துகளுக்கு இழுக்கிறார். அவர் கவலைப்பட்டுள்ளார்.)

:வஇமுசிட்டை:


