Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/வெறுமை/தானியங்கி.po
Languages: ta

source: aarm
ta: கவைக்கரம்

source: accelerator
ta: முடுக்கி

source: air
ta: காற்று

source: air intake system
ta: காற்றிழுவமைப்பு

source: aircompressor
ta: காற்றமுக்கி

source: airflow
ta: காற்றுப்பாய்வு

source: all wheel drive
ta: அனைத்தியக்கூர்தி

source: alternator
ta: மாறுமின்னாக்கி

source: antifreeze
ta: உறைத்தடுப்பி

source: antilock braking system
ta: வழுக்கா நிறுத்தமைப்பு

source: assemblyline
ta: ஒன்றுகூட்டு வரிசை

source: automatic transmission
ta: தன்னியக்கப் பரப்புகை

source: automobile
ta: தானியங்கி

source: axle
ta: அச்சாணி

source: ball joint
ta: பந்துமூட்டு

source: beltdrive
ta: வாரியக்கி

source: brake
ta: நிறுத்தி

source: brakedrum
ta: தேயுருளையம்

source: brakeshoe
ta: நிறுத்துக்கட்டை

source: braking
ta: நிறுத்தி

source: break
ta: நிறுத்தி

source: breakpad
ta: தேய்ப்பஞ்சு

source: bumper
ta: அடிதாங்கி

source: bypass chamber
ta: மாற்றுவழியறை

source: caliper
ta: நழுவிடுக்கி

source: camshaft
ta: நெம்புருள் தண்டு

source: carburettor
ta: காற்றுக்கலக்கி

source: catalytic converter
ta: வினையூக்க மாசகற்றி

source: cell
ta: கலன்

source: centrifuge
ta: மையவிலக்கி

source: channel
ta: வாய்க்கால்

source: chassis
ta: அடிச்சட்டம்

source: circuit
ta: சுற்று

source: clutch
ta: உரசிணைப்பி, விடுபற்றி

source: combusion chamber
ta: எரியறை

source: compressor
ta: காற்றமுக்கி

source: connecting rod
ta: இணைப்புக் கம்பி

source: contact
ta: தொடுநிலை

source: control system
ta: கட்டுப்பாடமைப்பு

source: coolant
ta: குளிர்வி

source: cooling system
ta: குளிரலமைப்பு

source: coupe
ta: பதுங்கறை சீருந்து

source: cowl
ta: முகப்புத்தாங்கி

source: crank
ta: வளைவச்சு

source: cruise control
ta: சீர்வேகக்கருவி

source: cruising speed
ta: சீர்வேகம்

source: cylinder
ta: கலன்

source: cylinder block
ta: கலன்கூறு

source: cylinderhead
ta: கலன்தலை

source: cylinders
ta: கலன்கள்

source: damper
ta: அதிர்வுதாங்கி

source: dashboard
ta: முகப்புப்பெட்டி

source: delivery
ta: வழங்கு

source: delivery system
ta: வழங்கமைப்பு

source: diskbrake
ta: வட்டு நிறுத்தி

source: double wishbone
ta: இரட்டைக் கவைக்கவம்

source: drum
ta: உருளையம்

source: drumbrake
ta: உருளைய நிறுத்தி

source: efi computer
ta: மிஎஉ கணினி

source: electronic
ta: மின்னணு

source: engine
ta: விசைப்பொறி

source: exhaust
ta: வெளியேற்று

source: filter
ta: வடிப்பி

source: flow
ta: பாய்வு

source: flywheel
ta: உந்துசக்கரம்

source: front wheel drive
ta: முன்னியக்கூர்தி

source: fuel
ta: எரிபொருள்

source: gear
ta: பற்சக்கரம்

source: governor
ta: ஆள்கருவி

source: gyrator
ta: கொட்பி

source: hatchback
ta: பொதுவறை சீருந்து

source: hydraulic
ta: நீரியக்கம்

source: idle
ta: நிலையிக்கம்

source: idle speed
ta: நிலையியக்க வேகம்

source: idling
ta: நிலையியங்கும்

source: ignition
ta: தீமூட்டல்

source: ignition switch
ta: தீமூட்டுத் திறப்பான்

source: independent
ta: தனிப்பட்ட

source: indicator
ta: காட்டொளி

source: injection
ta: உட்செலுத்தல்

source: injection system
ta: உட்செலுத்தமைப்பு

source: injectors
ta: உட்செலுத்திகள்

source: inline
ta: நேர்வரிசை

source: intake
ta: உள்ளிழு

source: intake system
ta: உள்ளிழுவமைப்பு

source: joint
ta: மூட்டு

source: limousine
ta: உல்லாசவுந்து

source: macpherson strut
ta: மிதவையதிர்வுதாங்கு உதைசட்டம்

source: manifold
ta: பன்மடிமம்

source: manual transmission
ta: ஆளியக்கப் பரப்புகை

source: mechanical steering
ta: பொறிமுறைத் திருப்பி

source: meter
ta: அளவி

source: mixture
ta: கலவை

source: multipoint
ta: பன்முனை

source: naturally aspirated
ta: இயலிழுப்பு

source: nozzle
ta: நுனிக்குழல்

source: nozzle body
ta: நுனிக்குழலகம்

source: overflow
ta: வழிவு

source: payload
ta: தாங்குசுமை

source: pipe
ta: புழம்பு

source: pipes
ta: குழல்கள்

source: piston
ta: ஆடுதண்டு

source: pitman arm
ta: பிடிமுனைக்கை

source: power
ta: விசை

source: pressure
ta: அழுத்தம்

source: pressure valve
ta: அழுத்தவோரதர்

source: pump
ta: இறைப்பி

source: rack
ta: பற்சிலி

source: rack and pinion
ta: பற்சிலி மற்றும் அச்சாணி

source: radiator
ta: கதிர்வீசி

source: rear
ta: பின்புறம்

source: rear wheel drive
ta: பின்னியக்கூர்தி

source: recirculating ball
ta: மறுசுழல்பந்து

source: regulator
ta: சீர்மி

source: sedan
ta: சரக்கறை சீருந்து

source: sensor
ta: உணரி

source: shaft
ta: தண்டு

source: shock absorber
ta: அதிர்வேற்பி

source: spark plug
ta: தீப்பொறிச்செருகி

source: speed governor
ta: வேகக்கட்டுப்பாட்டுக்கருவி

source: spray openings
ta: தெளிப்பியின் துளைகள்

source: steering
ta: சக்கரத்திருப்பி

source: steering shaft
ta: திருப்பித்தண்டுடன்

source: strut
ta: உதைசட்டம்

source: suction
ta: உறிஞ்சு

source: supercharged
ta: மிகையூட்டு

source: supercharger
ta: மிகையூட்டி

source: suspension
ta: தொங்கல்

source: throttle
ta: நெரிப்பி

source: throttle body
ta: நெரிப்பகம்

source: throttle chamber
ta: நெரிப்பறை

source: throttle plate
ta: நெரிதகடு

source: throttle position sensor
ta: நெரிநிலையுணரி

source: tube
ta: தூம்பு

source: turbocharged
ta: சுழலூட்டு

source: turbocharger
ta: சுழலூட்டி

source: tyre
ta: உருளிப்பட்டை

source: vacuum
ta: வெற்றிடம்

source: valve
ta: ஓரதர்

source: valves
ta: ஓரதர்கள்

source: voltage
ta: மின்னழுத்தம்

source: worm
ta: புழு

source: yolk
ta: நுகம்
