import pota


பாதை = "./"
பாதை = "/Users/apt/Documents/அறிவிலி/TACETranslation/பைத்தான்படிவங்கள்/"
# pota.வரிசைபடுத்து_கோப்புகள்(பாதை + "பிறமொழி/*.po")
# pota.அகராதி_மேம்படுத்து("./நினைவு/முடிந்தது.po", "./முடிந்தது/*.po")
# pota.அகராதி_மேம்படுத்து("./நினைவு/பிறமொழி.po", "./பிறமொழி/*.po")
# pota.எடுபொருள்மொழிபெயர்(True)
# pota.சரங்கள்மொழிபெயர்()
# pota.பிறமொழி_தவிர்_கோப்புகள்(பாதை + "தானி/*.po")
# pota.வரிசைபடுத்து_கோப்புகள்(பாதை + "மொழிபெயர்ப்புகள்/மின்னியல்.po")
pota.இணைகள்மொழிபெயர்("./வெறுமை/for_translation_zotero_zoteroproperties_ta.properties")
