<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'auth', language 'ta_lk', version '4.3'.
 *
 * @package     auth
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['alternatelogin'] = 'இங்கே நீங்கள் ஒரு URL ஐ உள்ளிட்டால் அது, இத்தளத்திற்கான புகுபதிவுப் பக்கமாகப் பயன்படுத்தப்படும். <strong>\'{$a}\'</strong> ஐ action property ஆகவும், <strong>username</strong> மற்றும் <strong>password</strong> ஆகியவற்றைத் தருவதாகவும் கொண்ட படிவம் ஒன்றை இப்பக்கம் கொண்டிருக்க வேண்டும். <br />பிழையான URL ஒன்றை வழங்குதல், உங்களைத் தளத்திற்குள் செல்ல முடியாமற் செய்துவிடும். எனவே, கவனமாக இதைக் கையாளவும். <br /> பொது இருப்புப் புகுபதிகைப் பக்கத்தைப் பயன்படுத்த இதை வெறுமையாக விடவும்.';
$string['alternateloginurl'] = 'மாற்றுப் புகுபதிகை URL';
$string['auth_changepasswordhelp'] = 'கடவுச் சொல் மாற்றுவதற்கான உதவி';
$string['auth_changepasswordhelp_expl'] = '{$a} கடவுச்சொல்லைத் தொலைத்த பயனாளர்களுக்குக் "தொலைந்த கடவுச்சொல் உதவியைக்" காட்டுக. <strong>கடவுச்சொல் மாற்றும் URL</strong> உடன்/பதிலாக உள்ளக Moodle கடவுச்சொல் மாற்றல் காட்டப்படும்.';
$string['auth_changepasswordurl'] = 'கடவுச் சொல் மாற்றும் URL';
$string['auth_changepasswordurl_expl'] = '{$a} கடவுச்சொல்லைத் தொலைத்த பயனாளர்களுக்கு அனுப்புவதற்கான url ஐக் குறிப்பிடுக. <strong>நியம கடவுச்சொல் மாற்றல் பக்கத்தைப்  பயன்படுத்துக</strong> என்பதை <strong>இல்லை</strong> என அமைக்க.';
$string['auth_common_settings'] = 'பொதுவான அமைப்புகள்';
$string['auth_data_mapping'] = 'தரவு தொடர்புபடுத்தல்';
$string['auth_fieldlock'] = 'பூட்டுப் பெறுமானம்';
$string['auth_fieldlock_expl'] = '<p><b>Lock value:</b> இயலுமைப்படுத்தப் பட்டால் Moodle பயனாளர்களும் நிர்வாகிகளும் நேரடியாக இப்புலத்தை மாற்றுவது தடுக்கப்படும். நீங்கள் புற அத்தாட்சிப்படுத்தல் தொகுதியில் இந்த தரவை பராமரித்துக் கொண்டிருக்கிறீ்ர்கள் என்றால் இந்த தெரிவைப் பயன்படுத்துங்கள்.';
$string['auth_fieldlocks'] = 'பயனாளர் புலங்களைப் பூட்டு';
$string['auth_fieldlocks_help'] = '<p>நீங்கள் பயனாளர் தரவுப் புலங்களைப் பூட்ட முடியும். \'பயனாளர்கள் பதிவேற்றல்\' வசதியைப் பயன்படுத்துவதால் அல்லது பயனாளர் பதிவுகளைக் கைமுறையால்  பராமரிப்பதால், பயனாளர் தரவு நிர்வாகிகளால் நிர்வகிக்கப்படும் தளங்களில் இது பயன் மிக்கதாக இருக்கும். Moodle பயன்படுத்துகின்ற புலங்களை நீங்கள் பூட்டுவதாக இருந்தால், பயனாளர் கணக்குகளை உருவாக்கும்போது அத்தரவுகளை நீங்கள் வழங்க வேண்டும் அல்லது கணக்குகள் பயனற்றதாக இருக்கும்.
</p><p>இந்நிலையைத் தவிர்ப்பதற்கு \'வெறுமையாக இருந்தால் பூட்ட வேண்டாம்\' எனும் அமைப்பைத் தெரிவு செய்க</p>';
$string['auth_multiplehosts'] = 'ஒன்றிற்கு மேற்பட்ட ஓம்புநர்கள், முகவரிகள் குறிப்பிடப்படலாம். (உ-ம்: host1.com;host2.com;host3.com) அல்லது (உ-ம்: xxx.xxx.xxx.xxx;xxx.xxx.xxx.xxx)';
$string['auth_passwordisexpired'] = 'உங்கள் கடவுச்சொல் காலாவதியாகி விட்டது. அதை இப்போதே மாற்றப் போகிறீர்களா?';
$string['auth_passwordwillexpire'] = 'உங்கள் கடவுச்சொல் இன்னும் {$a} நாட்களில் காலாவதியாகும். அதை இப்போதே மாற்றப் போகிறீர்களா?';
$string['auth_remove_delete'] = 'உள்ளக முழுமையான நீக்கம்';
$string['auth_remove_keep'] = 'உள்ளகத்தை வைத்திரு';
$string['auth_remove_suspend'] = 'உள்ளகத்தை விலக்கு';
$string['auth_remove_user'] = 'வெளியக ஆதாரத்திலிருந்து பயனாளர் நீங்கப்படுகின்றபோது மிகப்பெரிய ஏக கால நிகழ்வின் பொழுது உள்ளக பயனாளர் கணக்கால் என்ன செய்வது என்பதை குறிப்பிடுக.இடைநிறுத்தப்பட்ட பயனாளர்கள் ext ஆதாரத்தில் மீண்டும் தோன்றவில்லை என்றால் அவர்கள் மட்டும் தன்னியல்பாக புதிப்பிக்கப்படுகிறார்கள்.';
$string['auth_remove_user_key'] = 'அகற்றப்பட்ட புறப் பயனாளர்';
$string['auth_sync_script'] = 'Cron ஒத்திசைவாக்க நிரல்';
$string['auth_updatelocal'] = 'உள்ளகத்தை இற்றைப்படுத்துக';
$string['auth_updatelocal_expl'] = '<p><b>உள்ளகத்தை இற்றைப்படுத்துக:</b>செயலாக்கப்பட்டால்,பயனாளர் உள்நுளைகின்ற அல்லது அங்கே பயனாளர் ஏக கால நிகழ்வொன்று இருக்கின்ற ஒவ்வொரு நேரமும் நிரல் இற்றைப்படுத்தப்படும்(வெளியக நிரூபணத்திலிருந்து).';
$string['auth_updateremote'] = 'வெளியகத்தை இற்றைப்படுத்துக';
$string['auth_updateremote_expl'] = '<p><b>வெளியகத்தை இற்றைப்படுத்துக:</b>செயலாக்கப்பட்டால்,பயனாளர் பதிவு இற்றைப்படுத்தப்படுகின்ற போது வெளியக நிரூபணம் இற்றைப்படுத்தப்படும்.பதிப்பிகளை அனுமதிப்பதற்கு நிரல்கள் அடைக்கப்படக்கூடாது.';
$string['auth_updateremote_ldap'] = '<p><b>குறிப்பு:</b>வெளியக LDAP தரவுகளை இற்றைப்படுத்தல்,அனைத்து பயனாளர் பதிவுகளுக்கும் தனியுரிமைகளை மாற்றுவதால் ஒரு கட்டப்பட்ட பயனாளருக்கு binddn மற்றும் bindpwஐ அமைப்பதை வேண்டுகின்றது.இது தற்போது பல் பெறுமதியாக்கப்பட்ட பண்புகளை பாதுகாத்துக்கொள்ளவில்லை, மற்றும் இற்றைப்படுத்தலிலுள்ள அதிகப்படியான பெறுமதிகளை நீக்கும்.';
$string['auth_user_create'] = 'பயனாளர் உருவாக்கத்தை இயலுமைப்படுத்து';
$string['auth_user_creation'] = 'புதிய(அநாமதேய) பயனாளர்கள் வெளியக நிரூபண ஆதாரத்திலுள்ளதாகவும் மற்றும் மின்னஞ்சல் மூலமாக உறுதிப்படுத்தப்படுகின்றதாகவும் பயனாளர் கணக்குகளை உருவாக்க முடிகிறது.இதை நீங்கள் செயலாக்கினால்,பயனாளர் உருவாக்கத்திற்காக பகுதி-விசேட தெரிவுகளை செம்மைப்படுத்துவதற்கும் ஞாபகம் வைத்துக் கொள்க.';
$string['auth_usernameexists'] = 'தெரிவு செய்யப்பட்ட பயனாளர் பெயர் ஏற்கனவே பாவனையிலுள்ளது. தயவுசெய்து, வேறொரு பெயரைத் தெரிவு செய்யவும்.';
$string['auth_usernotexist'] = 'இல்லாத பயனர் {$a} ஐ இற்றைப்படுத்த முடியாது';
$string['authenticationoptions'] = 'அத்தாட்சிப்படுத்தல் விருப்பத்தெரிவுகள்';
$string['authinstructions'] = 'இங்கே நீங்கள் உங்களுடைய பயனாளர்களுக்காக ஆலோசணைகளை அளிக்க முடிகிறது,ஆகையால் அவர்கள் பயன்படுத்தி இருக்க வேண்டும் என்கின்ற பயனாளர்பெயர் மற்றும் கடவுச்சொல்லை அவர்கள் அறிந்திருக்கிறார்கள்.நீங்கள் இங்கே பதிகின்ற உரை உள்நுழைவுப்பக்கத்தில் தோன்றும்.நீங்கள் இந்த வெற்றை விட்டால் அடுத்து ஆலோசனைகள் எதுவும் அச்சுப்பதிக்கப்படாது.';
$string['auto_add_remote_users'] = 'தொலைப் பயனாளர்களைத் தானாகச் சேர்த்தல்';
$string['changepassword'] = 'கடவுச்சொல் மாற்றும் URL';
$string['changepasswordhelp'] = 'இங்கே நீங்கள் இருப்பிடமொன்றை குறிப்பிடமுடியும்,அதில் உங்களுடைய பயனாளர்கள்,அவர்களுடைய பயனாளர்பெயர்/கடவுச்சொல் மறந்துவிட்டிருந்தால் அவைகளை மாற்றவோ அல்லது மீளப்பெறவோ முடியும்.இது உள்நுழைவுப்பக்கத்தில் மற்றும் அவர்களுடைய பயனாளர் பக்கத்தில் ஒரு பொத்தானாக பயனாளர்களுக்கு தெரியவரும்.நீங்கள் இந்த வெறுமையாக விட்டால் பொத்தான் அச்சுப்பதிக்கப்படமாட்டாது.';
$string['chooseauthmethod'] = 'அத்தாட்சிப்படுத்தல் முறை ஒன்றைத் தெரிவு செய்க';
$string['chooseauthmethod_help'] = '<p>இப்பாவனையாளருக்கான அத்தாட்சிப்படுத்தல் முறையை இப்பட்டியில் மாற்றலாம்.
</p>

<p>தளமட்டத்தில் அமைக்கப்பட்ட அத்தாட்சிப்படுத்தல் முறைகளிலும், அவை பயன்படுத்தும் அமைப்புகளிலும் இது பெரிதும் தங்கியுள்ளதென்பதைக் கருத்திற் கொள்ளவும்.
</p>

<p>இங்கே செய்யப்படும் மாற்றம் பிழையாக இருக்குமிடத்து, இப்பயனாளர் புகுபதிகை செய்வது தடுக்கப்படுவதுடன் சில சமயங்களில் அவர்களது தரவுகள் கணக்கு என்பன முற்றாக நீக்கப்படும் அபாயமும் உண்டென்பதைத் தயவு செய்து கருத்திற் கொள்க. நீங்கள் என்ன செய்கிறீர்கள் என்பதை நன்கு அறிந்து செய்யவும்.
</p>';
$string['createpasswordifneeded'] = 'தேவையென்றால் கடவுச்சொல் ஒன்றை உருவாக்கவும்';
$string['emailchangecancel'] = 'மின்னஞ்சல் மாற்றத்தை ரத்து செய்க';
$string['emailupdate'] = 'மின்னஞ்சல் முகவரி இற்றைப்படுத்தல்';
$string['emailupdatesuccess'] = '<em>{$a->fullname}</em> பயனாளரினுடைய மின்னஞ்சல் முகவரி <em>{$a->email}</em> க்கு வெற்றிகரமாக இற்றைப்படுத்தப்பட்டது.';
$string['emailupdatetitle'] = '{$a->site} இல் மின்னஞ்சல் இற்றைப்படுத்தலினுடைய ஊர்ஜிதப்படுத்தல்';
$string['errorminpassworddigits'] = 'கட்டாயமாக கடவுச்சொற்கள் குறைந்தது {$a} இலக்கத்தை(களை) கொண்டிருக்க வேண்டும்.';
$string['errorminpasswordlength'] = 'கட்டாயமாக கடவுச்சொற்கள் குறைந்தது {$a} எழுத்துக்கள் நீளத்தை கொண்டிருக்க வேண்டும்.';
$string['errorminpasswordlower'] = 'கட்டாயமாக கடவுச்சொற்கள் குறைந்தது {$a} சிற்றெழுத்து எழுத்தை(களை) கொண்டிருக்க வேண்டும்.';
$string['errorminpasswordupper'] = 'கட்டாயமாக கடவுச்சொற்கள் குறைந்தது {$a} பேரெழுத்து எழுத்தை(களை) கொண்டிருக்க வேண்டும்.';
$string['errorpasswordupdate'] = 'கடவுச்சொல் இற்றைப்படுத்தலில் வழு ஏற்பட்டுள்ளது. கடவுச்சொல் மாற்றப்படவில்லை.';
$string['forcechangepassword'] = 'கடவுச்சொல் மாற்றத்தை கட்டாயப்படுத்து';
$string['forcechangepassword_help'] = 'பயனாளர் தம் அடுத்த புகுபதிகையின் போது கடவுச்சொல் மாற்றுதலைக் கட்டாயப்படுத்து.';
$string['forcechangepasswordfirst_help'] = 'பயனர் தம் முதலாவது புகுபதிகையின் போது கடவுச்சொல் மாற்றுவதைக் கட்டாயப்படுத்து';
$string['forgottenpasswordurl'] = 'மறக்கப்பட்ட கடவுச்சொல் URL';
$string['guestloginbutton'] = 'விருந்தினர் புகுபதிகைப் பொத்தான்';
$string['incorrectpleasetryagain'] = 'தவறு. தயவு செய்து மீண்டும் முயற்சி செய். ';
$string['infilefield'] = 'கோப்பில் தேவைப்படும் புலம்';
$string['informminpassworddigits'] = 'குறைந்தது {$a} இலக்கம்(கள்)';
$string['informminpasswordlength'] = 'குறைந்தது {$a} எழுத்துக்கள்';
$string['informminpasswordlower'] = 'குறைந்தது {$a} சிற்றெழுத்து எழுத்து(கள்)';
$string['informminpasswordupper'] = 'குறைந்தது {$a} பேரெழுத்து எழுத்து(கள்)';
$string['informpasswordpolicy'] = 'கடவுச்சொல் கட்டாயமாக {$a} ஐ கொண்டிருக்க வேண்டும்';
$string['instructions'] = 'அறிவுறுத்தல்கள்';
$string['internal'] = 'உள்ளக';
$string['locked'] = 'பூட்டப்பட்டது';
$string['md5'] = 'MD5 hash';
$string['nopasswordchange'] = 'கடவுச்சொல் மாற்ற முடியாது';
$string['nopasswordchangeforced'] = 'கடவுச்சொல்லை மாற்றாமல் தொடர முடியாது, இருந்தபோதும்,';
$string['noprofileedit'] = 'விபரக்கோவையை தொகுக்க முடியவில்லை';
$string['ntlmsso_isdisabled'] = 'NTLM SSO செயலற்றதாக்கப்பட்டிருக்கிறது.';
$string['passwordhandling'] = 'கடவுச்சொற் புலக் கையாளுகை';
$string['plaintext'] = 'தனி உரை';
$string['pluginnotenabled'] = 'அத்தாட்சிப்படுத்தல் plugin \'{$a}\' இயலுமைப்படுத்தப்படவில்லை.';
$string['pluginnotinstalled'] = 'அத்தாட்சிப்படுத்தல் plugin \'{$a}\' நிறுவப்படவில்லை.';
$string['recaptcha'] = 'reCAPTCHA';
$string['selfregistration'] = 'சுய பதிகை';
$string['selfregistration_help'] = 'பயனாளர்களின் சுய- பதிவுக்கான நிரூபணமுறையைத் தெரிவுசெய்க.';
$string['sha1'] = 'SHA-1 hash';
$string['showguestlogin'] = 'புகுபதிகைப் பக்கத்திலே, நீங்கள் விருந்தினர் புகுபதிகைப் பொத்தானைக் காட்டலாம் அல்லது மறைக்கலாம்.';
$string['stdchangepassword'] = 'கடவுச்சொல் மாற்றத்திற்காக நியமப் பக்கத்தை பயன்படுத்துக';
$string['stdchangepassword_expl'] = 'வெளியக நிரூபண முறைமை Moodle இனூடு கடவுச்சொல் மாற்றங்களை அனுமதிக்கின்றது என்றால்,இங்கு ஆம் என்பதனைத் தெரிவுசெய்க.இந்த அமைப்பாக்கம் \'கடவுச்சொல் மாற்ற URL\'ஐ இற்றைப்படுத்தும்.';
$string['stdchangepassword_explldap'] = 'குறிப்பு:LDAP சேவையகம் தொலைதூரமாக இருந்தால்,நீங்கள் SSL சங்கேதப்படுத்தப்பட்ட பாதை ஒன்றினூடாக (ldaps://)LDAPஐ பயன்படுத்தவேண்டும் என்பது சிபார்சு செய்யப்படுகிறது.';
$string['unlocked'] = 'திறக்கப்பட்டது';
$string['unlockedifempty'] = 'வெறுமையாக இருந்தால் திறக்கப்படும்';
$string['update_never'] = 'எப்போதுமில்லை';
$string['update_oncreate'] = 'ஆக்கப்படுகையில்';
$string['update_onlogin'] = 'ஒவ்வொரு புகுபதிகையிலும்';
$string['update_onupdate'] = 'இற்றைப்படுத்தலில்';
