<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'forum', language 'ta_lk', version '4.3'.
 *
 * @package     forum
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['addanewdiscussion'] = 'புதிய கலந்துரையாடற் தலைப்பு ஒன்றைச் சேர்';
$string['addanewquestion'] = 'புதிய வினா ஒன்றைச் சேர்';
$string['addanewtopic'] = 'புதிய தலைப்பை சேர்';
$string['advancedsearch'] = 'உயர்தரத் தேடல்';
$string['allforums'] = 'எல்லாக் கருத்துக்களங்களும்';
$string['allowdiscussions'] = 'ஒரு {$a} இக்கருத்துக் களத்திற்கு அஞ்சலிட முடியுமா?';
$string['allowsallsubscribe'] = 'ஒவ்வொருவரும் தாம் உறுப்பினராக சேர அல்லது சேராதிருக்க இக்கருத்துக் களம் அனுமதிக்கிறது.';
$string['allowsdiscussions'] = 'ஒவ்வொருவரும் ஒரு கலந்துரையாடற் தலைப்பைத் தொடங்க, இக்கருத்துக் களம் அனுமதிக்கிறது.';
$string['allsubscribe'] = 'எல்லாக் கருத்துக் களங்களிலும் உறுப்பினராகு';
$string['allunsubscribe'] = 'எல்லாக் கருத்துக்களங்களிலிருந்தும் விலகு';
$string['alreadyfirstpost'] = 'இது ஏற்கனவே கலந்துரையாடலில் முதலாவது அஞ்சலாக இருக்கிறது';
$string['anyfile'] = 'ஏதாவதொரு கோப்பு';
$string['areaattachment'] = 'உடனிணைப்புகள்';
$string['attachment'] = 'உடனிணைப்பு';
$string['attachmentnopost'] = 'அஞ்சல் id இல்லாமல் உடனிணைப்புகளை நீங்கள் ஏற்றுமதி செய்ய முடியாது';
$string['attachments'] = 'உடனிணைப்புகள்';
$string['blockafter'] = 'அனுமதிக்கப்படவேண்டிய அஞ்சல்களின் எண்ணிக்கை';
$string['blockafter_help'] = '<p>நிர்வகிக்கப்படும் அஞ்சல்கள் கொள்கை மிக எளிதானது. குறிக்கப்பட்ட கால எல்லையினுள், குறிக்கப்பட்ட எண்ணிக்கையிலான அஞ்சல்களை ஒரு பயனாளர் அனுப்பிய பின்னர், மேலும் அஞ்சல்களை அனுப்ப அனுமதிக்கப்பட மாட்டார். அத்துடன் அவர்கள் அவ்வெண்ணிக்கையை நெருங்கும் போதும் எச்சரிக்கப்படுவர். </p>

<p>எச்சரிக்கை எல்லையை 0 ஆக்குவதால் எச்சரிக்கை அனுப்புவது தவிர்க்கப்படும். தடுத்தல் எல்லையை 0 ஆக்குவதால், தடுத்தல் தவிர்க்கப்படும். தடுத்தல் தவிர்க்கப்பட்டால், எச்சரிக்கை விடுத்தலும் தானாகத் தவிர்க்கப்படும். </p>

<p>ஆசிரியர்களின் அஞ்சல்களை இவ்வமைப்புகள் பாதிப்பதில்லை. </p>';
$string['blockperiod'] = 'அஞ்சல்கள் தடுக்கப்படவேண்டிய காலம்';
$string['blockperiod_help'] = '<p>நிர்வகிக்கப்படும் அஞ்சல்கள் கொள்கை மிக எளிதானது. குறிக்கப்பட்ட கால எல்லையினுள், குறிக்கப்பட்ட எண்ணிக்கையிலான அஞ்சல்களை ஒரு பயனாளர் அனுப்பிய பின்னர், மேலும் அஞ்சல்களை அனுப்ப அனுமதிக்கப்பட மாட்டார். அத்துடன் அவர்கள் அவ்வெண்ணிக்கையை நெருங்கும் போதும் எச்சரிக்கப்படுவர். </p>

<p>எச்சரிக்கை எல்லையை 0 ஆக்குவதால் எச்சரிக்கை அனுப்புவது தவிர்க்கப்படும். தடுத்தல் எல்லையை 0 ஆக்குவதால், தடுத்தல் தவிர்க்கப்படும். தடுத்தல் தவிர்க்கப்பட்டால், எச்சரிக்கை விடுத்தலும் தானாகத் தவிர்க்கப்படும். </p>

<p>ஆசிரியர்களின் அஞ்சல்களை இவ்வமைப்புகள் பாதிப்பதில்லை. </p>';
$string['blockperioddisabled'] = 'தடுக்க வேண்டாம்';
$string['bynameondate'] = 'by {$a->name} - {$a->date}';
$string['cannotadd'] = 'இக் கருத்துக்களத்திற்கு கலந்துரையாடலை சேர்க்க முடியவில்லை';
$string['cannotadddiscussion'] = 'இக்கருத்துக்களத்திற்கு கலந்துரையாடல்களைச் சேர்ப்பதற்கு குழு அங்கத்துவம் தேவை.';
$string['cannotadddiscussionall'] = 'அனைத்துப் பங்கேற்பாளர்களுக்கான ஒரு புதிய கலந்துரையாடல் தலைப்பைச் சேர்ப்பதற்கு உங்களுக்கு அனுமதி இல்லை. ';
$string['cannotaddsubscriber'] = 'இக் கருத்துக்களத்திற்கு {$a} id உடன் அங்கத்தினரை சேர்க்க முடியவில்லை!';
$string['cannotcreatediscussion'] = 'புதிய கலந்துரையாடலை உருவாக்க முடியவில்லை';
$string['cannotdeletepost'] = 'இந்த அஞ்சலை நீங்கள் நீக்க முடியாது!';
$string['cannoteditposts'] = 'மற்றவர்களுடைய அஞ்சல்களை நீங்கள் தொகுக்க முடியாது!';
$string['cannotfinddiscussion'] = 'கலந்துரையாடலை இக் கருத்துக்களத்தில் கண்டுபிடிக்க முடியவில்லை';
$string['cannotfindfirstpost'] = 'முதலாவது அஞ்சலை இக் கருத்துக்களத்தில் கண்டுபிடிக்க முடியவில்லை';
$string['cannotfindorcreateforum'] = 'தளத்திற்கான ஒரு பிரதான செய்திக் கருத்துக்களத்தினைக்  கண்டுபிடிக்க அல்லது உருவாக்க முடியவில்லை';
$string['cannotmovenotvisible'] = 'கருத்துக்களம் புலப்படவில்லை';
$string['cannotmovetonotexist'] = 'நீங்கள் அக் கருத்துக்களத்தினை நகர்த்த முடியாது - அப்படியொரு கருத்துக்களம் இல்லை! ';
$string['cannotmovetonotfound'] = 'இலக்குக் கருத்துக்களம் இந்தப் பாடநெறியில் இல்லை. ';
$string['cannotremovesubscriber'] = 'இக் கருத்துக்களத்திலிருந்து {$a} id உடன் அங்கத்தினரை அகற்ற முடியவில்லை!';
$string['cannotreply'] = 'நீங்கள் இந்த அஞ்சலுக்குப் பதிலிட முடியாது';
$string['cannotsplit'] = 'இக் கருத்துக்களத்திலிருந்து கலந்துரையாடல்களை பிரிக்க முடியாதிருக்கும்';
$string['cannotsubscribe'] = 'மன்னிக்கவும், அங்கத்தினராகுவதற்கு நீங்கள் கட்டாயமாக ஒரு குழு உறுப்பினராக இருக்க வேண்டும்.';
$string['cannotupdatepost'] = 'இந்த அஞ்சலை நீங்கள் இற்றைப்படுத்த முடியாது';
$string['cannotviewpostyet'] = 'நீங்கள் இதுவரை அஞ்சலிடாதபடியால், ஏனைய மாணவர்களின் வினாக்களை வாசிக்க முடியாது.';
$string['completiondiscussions'] = 'மாணவர்கள் கட்டாயமாக கலந்துரையாடல்களை உருவாக்க வேண்டும்:';
$string['completiondiscussionsgroup'] = 'கலந்துரையாடல்கள் தேவை';
$string['completiondiscussionshelp'] = 'நிறைவு செய்வதற்கு கலந்துரையாடல்கள் தேவை';
$string['completionposts'] = 'மாணவர்கள் கட்டாயமாக கலந்துரையாடல்களை அல்லது பதிலீடுகளை அஞ்சலிட வேண்டும:';
$string['completionpostsgroup'] = 'அஞ்சல்கள் தேவை';
$string['completionpostshelp'] = 'நிறைவு செய்வதற்கு கலந்துரையாடல்கள் அல்லது பதிலீடுகள் தேவை';
$string['completionreplies'] = 'மாணவர்கள் கட்டாயமாக பதிலீடுகளை அஞ்சலிட வேண்டும:';
$string['completionrepliesgroup'] = 'பதிலீடுகள் தேவை';
$string['completionreplieshelp'] = 'நிறைவு செய்வதற்கு பதிலீடுகள் தேவை';
$string['configcleanreadtime'] = '\'வாசிக்கப்பட்டவை\'  அட்டவணையிலிருந்து பழைய அஞ்சல்களை அகற்றுவதற்குரிய நேரம்.';
$string['configdigestmailtime'] = 'சுருக்கத்தொகுதி வடிவில் மின்னஞ்சல் பெற தெரிவு செய்த பயனாளர்களுக்கு அன்றாடம் இவ்வடிவில் மின்னஞ்சல் அனுப்பப்படும். எத்தனை மணிக்கு இம்மின்னஞ்சல் அனுப்பப்பட வேண்டும் என்பதை இவ்வமைப்பில் குறிப்பிட முடியும். இந்த மணித்தியாலத்துக்கு பிறகு இயங்கும் Cron அனுப்பும்.';
$string['configdisplaymode'] = 'யாரொருவர் மாற்றும் வரைக்கான, இயல்நிலையான கருத்துக்கள முறை.';
$string['configenablerssfeeds'] = 'இவ் ஆளி சகல கருத்துக்களத்திற்குமான RSS ஊட்டம்களை உயிர்ப்பிக்கும். அப்படியிருந்தும் ஊட்டம்களை ஒவ்வொரு கருத்துக்களங்களிலும் தனிப்பட மாற்ற முடியும்.';
$string['configenabletimedposts'] = 'புதிய கலந்துரையாடலை அஞ்சல்செய்யும்போது காட்சிப்படுத்தவேண்டிய காலத்தையும் அமைக்க அனுமதிக்கவேண்டுமாயின் \'ஆம்\' என்பதனைத் தெரிவுசெய்க.(இது பரீட்சார்த்தமானதொன்று)';
$string['configlongpost'] = 'எந்த தபாலிடலும் இந்த அளவிற்குமேல் வருமாயின் (HTML எழுத்துக்களை தவிர்த்து) மிகவும் நீளமானது எனக்கொள்ளப்படும். முதற் பக்கம், சமூகப்பக்கம், பாட நெறிப்பக்கம் அல்லது பயனாளர் தகவல் ஆகியன குறுக்கப்பட்டது.';
$string['configmanydiscussions'] = 'கருத்துக்களமொன்றின் பக்கமொன்றிற் காட்ட வேண்டிய கலந்துரையாடற் தலைப்புகளின் அதிகூடிய எண்ணிக்கை.';
$string['configmaxbytes'] = 'இயல்நிலையான சகல கருத்துக்களத்திற்குமான அதிவுச்சமான இப்பக்கத்தின் இணைப்புக்கள் (ஏனைய உள்ளக ஒழுங்கமைப்பு மற்றும் பாடநெறி சார்பாக)';
$string['configoldpostdays'] = 'வாசிக்கப்பட்டதாகக் கருதுவதற்கு ஒரு அஞ்சல் இத்தனை நாட்கள் பழையதாக இருக்க வேண்டும்.';
$string['configreplytouser'] = 'கருத்துக்களத்தபாலிடல் இயலாமல் விடும் வேளைகளில் பயனாளர்கள் தங்களிடையே மின்னஞ்சல் மூலம் தனிப்பட தொடர்பு கொள்ளலாம் அல்லது பதிலலிக்கலாம்.  அதனைக்கூட \'ஆம்\'  எனத்தெரிவு செய்வதன் மூலம் தங்கள் மின்னஞ்சல் மற்றவர் அறியாதபடி அந்தரங்கமாக்கலாம்.';
$string['configshortpost'] = 'இந்நீளத்திற்குக் குறைந்த எந்த அஞ்சலும்(HTML தவிர்ந்த எழுத்துருக்கள்) குறுகியவையாகக் கருதப்படும். (கீழே பார்க்க).';
$string['configtrackreadposts'] = '\'ஆம்\'  எனத்தெரிவு செய்க ஒவ்வொரு பயனாளர் பாதையையும் படிக்க / படிக்காதிருக்க.';
$string['configusermarksread'] = '\'ஆம்\' என்றால், அஞ்சல்கள் பயனரால் வாசிக்கப்பட்டவையாக அடையாளமிடப்பட வேண்டும். \'இல்லை\' என்றால்,அஞ்சல்கள் பார்க்கப்பட்டதுமே வாசிக்கப்பட்டவையாக அடையாளமிடப்படும்.';
$string['couldnotadd'] = 'இனம் தெரியாத வழு காரணமாக உங்கள் அஞ்சல் சேர்க்கப்பட முடியவில்லை.';
$string['couldnotdeletereplies'] = 'மன்னிக்கவும், மக்கள் அதற்கு ஏற்கனவே பதிலிட்டிருப்பதால் அதை அழிக்க முடியாது.';
$string['couldnotupdate'] = 'இனம் தெரியாத வழு காரணமாக உங்கள் அஞ்சலை இற்றைப்படுத்த முடியவில்லை.';
$string['delete'] = 'அழி';
$string['deleteddiscussion'] = 'கலந்துரையாடற் தலைப்பு அழிக்கப்பட்டு விட்டது.';
$string['deletedpost'] = 'அஞ்சல் அழிக்கப்பட்டு விட்டது.';
$string['deletedposts'] = 'அவ்வஞ்சல்கள் அழிக்கப்பட்டு விட்டன.';
$string['deletesure'] = 'நீங்கள் இவ்வஞ்சலை நிச்சயமாகஅழிக்க விரும்புகிறீர்களா?';
$string['deletesureplural'] = 'நீங்கள் இவ்வஞ்சலையும் அதன் பதில்களையும் ({$a} அஞ்சல்கள்)
நிச்சயமாக அழிக்க விரும்புகிறீர்களா?';
$string['digestmailheader'] = 'இது {$a->sitename} தளத்திலிருந்து உங்களின் நாளாந்த   கருத்துக்கள அஞ்சல் ஜீரணங்கள். உமது கருத்துக்கள மின்னஞ்சல் முன்னுரிமைகளை மாற்ற {$a->userprefs} க்குச் செல்க.';
$string['digestmailprefs'] = 'உங்கள் பயனர் விவரக்குறிப்பு';
$string['digestmailsubject'] = '{$a}: கருத்துக்கள சுருக்கத் தொகுப்பு';
$string['digestmailtime'] = 'சுருக்கத்தொகுப்பு மின்னஞ்சல் அனுப்ப வேண்டிய நேரம்';
$string['digestsentusers'] = 'மின்னஞ்சல் சுருக்கத் தொகுப்புகள் {$a} பயனருக்கு வெற்றிகரமாக அனுப்பப்பட்டுள்ளன.';
$string['disallowsubscribe'] = 'அங்கத்துவம் அனுமதிக்கப்படவில்லை.';
$string['disallowsubscribeteacher'] = 'அங்கத்துவம் அனுமதிக்கப்படவில்லை(ஆசிரியர் தவிர).';
$string['discussion'] = 'கலந்துரையாடல்';
$string['discussionmoved'] = 'இந்த விவாதம் இங்கே \'{$a}\'. நகர்த்தப்படுகிறது';
$string['discussionmovedpost'] = 'இக்கலந்துரையாடலானது <a href="{$a->forumhref}"> {$a->forumname} </a> கருத்துக்களத்திலுள்ள <a href="{$a->discusshref}"> இவ்விடத்திற்கு </a> மாற்றப்பட்டுள்ளது';
$string['discussionname'] = 'கலந்துரையாடலின் பெயர்';
$string['discussions'] = 'கலந்துரையாடல்கள்';
$string['discussionsstartedby'] = '{$a} ஆல் தொடங்கப்பட்ட கலந்துரையாடல்கள்';
$string['discussionsstartedbyrecent'] = '{$a} ஆல் அண்மையில் தொடங்கப்பட்ட கலந்துரையாடல்கள்';
$string['discussthistopic'] = 'இத்தலைப்பில் கலந்துரையாடவும்.';
$string['displayend'] = 'காட்சி முடிவு.';
$string['displayend_help'] = '<p>உங்கள் கருத்துக்கள அஞ்சல்கள் ஒரு தேதியிலிருந்து அல்லது, ஒரு தேதிவரை அல்லது குறிப்பிபட்ட கால எல்லைக்குள் காட்டப்பட வேண்டுமா என்பதை இது தீர்மானிக்கும்.</p>

<p>காட்சி தொடங்கும் அல்லது முடியும் தேதியை இயலுமைப்படுத்துவதற்கு, இயலாமைப்படுத்தற் தெரிவுகளைத் தெரிவு செய்யாமல் விடுக.</p>

<p>நிர்வாக அணுகல் அனுமதி கொண்ட பயனாளர்கள் இவற்றை எந்நேரமும் பார்ப்பர் என்பதைக் கவனத்திற் கொள்க.</p>';
$string['displaymode'] = 'காட்சி நிலை';
$string['displayperiod'] = 'காட்சிக் காலம்.';
$string['displaystart'] = 'காட்சித் தொடக்கம்.';
$string['displaystart_help'] = '<p>உங்கள் கருத்துக்கள அஞ்சல்கள் ஒரு தேதியிலிருந்து அல்லது, ஒரு தேதிவரை அல்லது குறிப்பிபட்ட கால எல்லைக்குள் காட்டப்பட வேண்டுமா என்பதை இது தீர்மானிக்கும்.</p>

<p>காட்சி தொடங்கும் அல்லது முடியும் தேதியை இயலுமைப்படுத்துவதற்கு, இயலாமைப்படுத்தற் தெரிவுகளைத் தெரிவு செய்யாமல் விடுக.</p>

<p>நிர்வாக அணுகல் அனுமதி கொண்ட பயனாளர்கள் இவற்றை எந்நேரமும் பார்ப்பர் என்பதைக் கவனத்திற் கொள்க.</p>';
$string['duedate'] = 'காலவரை';
$string['eachuserforum'] = 'ஒவ்வொருவரும் ஒரு கலந்துரையாடலை அஞ்சலிடுவர்.';
$string['edit'] = 'தொகு';
$string['editedby'] = '{$a->name} ஆல் தொகுக்கப்பட்டது - முதன் சமர்ப்பிப்பு {$a->date}';
$string['editing'] = 'தொகுத்தல்';
$string['emptymessage'] = 'உங்களுடைய தபாலில் ஏதோ தவறு உள்ளது. அநேகமாக நீங்கள் மாற்றம்களை சேமிக்காமல் விட்டிருக்கலாம் அல்லது மிகப்பெரிய கோப்பை இணைத்திருக்கலாம் அல்லது வெற்றிடமாக விட்டிருக்கலாம்.';
$string['erroremptymessage'] = 'அஞ்சல்ச் செய்தி வெறுமையாக இருக்க முடியாது';
$string['erroremptysubject'] = 'அஞ்சல் விடயம் வெறுமையாக இருக்க முடியாது';
$string['errorwhiledelete'] = 'பதிவுகளை நீக்கும் பொழுது ஒரு வழு ஏற்பட்டது.';
$string['everyonecanchoose'] = 'ஒவ்வொருவரும் தாம் அங்கத்தினராவதற்குத் தெரிவு செய்யலாம்.';
$string['everyonecannowchoose'] = 'இப்போது ஒவ்வொருவரும் தாம் அங்கத்தினராவதற்குத் தெரிவு செய்யலாம்.';
$string['everyoneisnowsubscribed'] = 'ஒவ்வொருவரும் இப்போது இக்கருத்துக் களத்தில் இணந்துள்ளனர்.';
$string['everyoneissubscribed'] = 'ஒவ்வொருவரும் இக்கருத்துக் களத்தில் இணந்துள்ளனர்.';
$string['existingsubscribers'] = 'தற்போதுள்ள அங்கத்தினர்';
$string['exportdiscussion'] = 'முழுக் கலந்துரையாடலையும் ஏற்றுமதி செய்';
$string['forcesubscribed'] = 'இக்கருத்துக்களம், ஒவ்வொருவரையும் அங்கத்தினராகக் கட்டாயப்படுத்துகிறது.';
$string['forum'] = 'கருத்துக்களம்';
$string['forum:addnews'] = 'செய்தியைச் சேர்';
$string['forum:createattachment'] = 'உடனிணைப்புகளைத் தயாரிக்க';
$string['forum:deleteanypost'] = 'எந்த அஞ்சலையும் அழி (எந்த வேளையும்)';
$string['forum:deleteownpost'] = 'சொந்த அஞ்சல்களை அழிக்கவும்(காலவரையறையினுள்)';
$string['forum:editanypost'] = 'எந்த அஞ்சலையும் தொகுக்கவும்';
$string['forum:exportdiscussion'] = 'முழுக் கலந்துரையாடலையும் ஏற்றுமதி செய்';
$string['forum:exportownpost'] = 'சொந்த அஞ்சலை ஏற்றுமதி செய்';
$string['forum:exportpost'] = 'அஞ்சலை ஏற்றுமதி செய்';
$string['forum:managesubscriptions'] = 'அங்கத்துவங்களை நிர்வகி';
$string['forum:movediscussions'] = 'கலந்துரையாடல்களை நகர்த்து';
$string['forum:rate'] = 'அஞ்சல்களை மதிப்பிடு';
$string['forum:replynews'] = 'செய்திக்குப் பதிலிடு';
$string['forum:replypost'] = 'அஞ்சல்களுக்குப் பதிலிடு';
$string['forum:splitdiscussions'] = 'கலந்துரையாடல்களைப் பிரி';
$string['forum:startdiscussion'] = 'புதிய கலந்துரையாடல்களைத் தொடங்கு';
$string['forum:viewanyrating'] = 'எந்த மதிப்பீடுகளையும் பார்';
$string['forum:viewdiscussion'] = 'கலந்துரையாடல்களைப் பார்';
$string['forum:viewhiddentimedposts'] = 'மறைக்கப்பட்ட, நேரங்குறிக்கப்பட்ட அஞ்சல்களைப்பார்';
$string['forum:viewqandawithoutposting'] = 'எப்போதும் வினா-விடை அஞ்சல்களைப் பார்';
$string['forum:viewrating'] = 'மதிப்பீடுகளைப் பார்';
$string['forum:viewsubscribers'] = 'அங்கத்தினரைப் பார்';
$string['forumauthorhidden'] = 'ஆக்குநர்(மறைக்கப்பட்டது)';
$string['forumblockingalmosttoomanyposts'] = 'நீங்கள் தபாலிடலிற்கான வரையறையை நெருங்கிவிட்டீர். கடைசி {$a->blockperiod} காலம் மற்றும் {$a->blockafter} எல்லைகள் அஞ்சலிடப்பட்டபின்னர் {$a->numposts} அஞ்சல்களைத் செய்துள்ளீர்கள்.';
$string['forumbodyhidden'] = 'இவ்வஞ்சலை நீங்கள் காண முடியாது; காரணம் பெரும்பாலும், நீங்கள் இங்கு இன்னும் அஞ்சலிடவில்லை என்பதாயிருக்கலாம்.';
$string['forumintro'] = 'கருத்துக்கள அறிமுகம்';
$string['forumname'] = 'கருத்துக்களப் பெயர்';
$string['forumposts'] = 'கருத்துக்கள அஞ்சல்கள்';
$string['forums'] = 'கருத்துக்களங்கள்';
$string['forumsubjecthidden'] = 'விடயம்(மறைக்கப்பட்டது)';
$string['forumtracked'] = 'படிக்கப்படாத அஞ்சல்கள் தடம்பதிக்கப்படுகின்றன';
$string['forumtrackednot'] = 'படிக்கப்படாத அஞ்சல்கள் தடம்பதிக்கப்படவில்லை';
$string['forumtype'] = 'கருத்துக்கள வகை';
$string['forumtype_help'] = '<p>நீங்கள் Moodle 1.8 இல் நான்கு வகையான கருத்துக்களங்களை உள்ளிடலாம்.</p>

<p><b>வினா-விடை கருத்துக்களம் :</b> நீங்கள் ஒரு வினாவிற்கான மாணவா்களின் விடைகளைப் பெறவிரும்பின் நீங்கள் இத்தகைய கருத்துக்களங்களைப் பாவிக்கலாம். ஒரு மாணவா் குறிப்பிட்ட வினாவுக்குப் பதிலளித்த பின்னரே, மற்றவா்கள் என்ன பதிலளித்திருக்கிறார்கள் என்பதைப் பார்க்கலாம். ஒரு விடயம் பற்றிய மாணவா்களின் சுய கருத்துக்களைப் பெற இவை மிகவும் உதவியாக இருக்கும்.</p>

<p><b>ஓா் எளிய கலந்துரையாடல் :</b> இவ்வகையான கலந்துரையாடல்கள் ஒரு தலைப்புப் பற்றி எல்லோரும் கலந்துரையாடுவதற்கு உதவும். எல்லாக்கலந்துரையாடல்களும் ஒரே பக்கத்திலேயே பதியப்படும். இதனால் இவை சுருக்கமான ஒரு தலைப்புப் பற்றிய கலந்துரையாடல்களுக்கு மிகவும் உதவும்.
ஒவ்வொருவரும் ஒரு கலந்துரையாடலை அஞ்சலிடுவா் : இதன்படி ஒரு மாணவரால் ஒரு கலந்துரையாடலையே ஆரம்பிக்கமுடியும். ஆனால் அவா்களால் ஏனைய மாணவா்கள் ஆரம்பிக்கும் கலந்துரையாடல்களில் பங்குபற்றி பதில்களை அஞ்சலிட முடியும். </p>

<p><b>பொதுப் பயன்பாட்டுக்கான கருத்துக்களங்கள் :</b> இந்தத் திறந்த கருத்துக்களங்களில் எப்பொது வேண்டுமானாலும் மாணவா்களாலும் ஆசிரியா்களாலும் பதிய கலந்துரையாடல்களைத் தொடங்கவோ அல்லது ஏனையவற்றில் பங்களிப்புச் செய்யவோ முடியும்.</p>

<p><b>கருத்துக்கள அறிமுகம் :</b> இப்பகுதியில் நீங்கள் உங்களுடைய வினாவைக் கொடுக்கலாம். அதாவது மாணவா்களிடம் நீங்கள் இக்கருத்துக்களத்தினூடாக என்ன எதிர்பார்க்கிறீா்கள் என்பதை இந்த இடத்தில் நீங்கள் கொடுக்கலாம். தரப்பட்டுள்ள கருவிகள் மூலம் நீங்கள் கொடுக்கும் வினாவை செவ்வைப் படுத்திக்கொள்ளலாம். அதாவது சொற்களின் கீழ் கோடிடல், முக்கியமானவற்றைத் தடித்த எழுத்தில் கொடுத்தல் இதுபோன்று இன்னோரன்ன விதத்தில் உங்களுடைய வினாவைச் செவ்வைப்படுத்திக்கொள்ளலாம்.
</p>';
$string['generalforum'] = 'பொதுவான பயன்பாட்டுக்கான பொதுக் கருத்துக்களம்';
$string['generalforums'] = 'பொதுக் கருத்துக்களங்கள்';
$string['inforum'] = '{$a} யில்';
$string['intronews'] = 'பொதுச் செய்திகளும் அறிவித்தல்களும்';
$string['introsocial'] = 'நீங்கள் விரும்பும் எதைப்பற்றியும் கதைக்கக் கூடிய ஒரு திறந்த கருத்துக்களம்.';
$string['introteacher'] = 'ஆசிரியருக்கு மட்டுமான குறிப்புகளுக்கும் கலந்துரையாடல்களுக்குமான ஒரு கருத்துக்களம்.';
$string['invalidaccess'] = 'இப் பக்கம் சரியான முறையில் அணுகப்பட்டிருக்கவில்லை';
$string['invalidforumid'] = 'கருத்துக்கள ID தவறானதாக இருந்தது';
$string['invalidparentpostid'] = 'தாய் அஞ்சல் ID தவறானதாக இருந்தது';
$string['invalidpostid'] = 'செல்லுபடியற்ற அஞ்சல் ID - {$a}';
$string['lastpost'] = 'இறுதி அஞ்சல்';
$string['learningforums'] = 'கற்கும் கருத்துக் களங்கள்';
$string['longpost'] = 'நீள அஞ்சல்';
$string['mailnow'] = 'இப்போது அஞ்சலிடு';
$string['manydiscussions'] = 'ஒரு பக்கத்திற்கான கலந்துரையாடல்கள்';
$string['markalldread'] = 'இக்கலந்துரையாடலிலுள்ள அஞ்சல்கள் அனைத்தையும் வாசிக்கப்பட்டவையாக அடையாளப்படுத்து.';
$string['markallread'] = 'இக்கருத்துக் களத்திலுள்ள அஞ்சல்கள் அனைத்தையும் வாசிக்கப்பட்டவையாக அடையாளப்படுத்து.';
$string['markread'] = 'வாசிக்கப்பட்டதாக அடையாளப்படுத்து';
$string['markreadbutton'] = 'வாசிக்கப்பட்டதாக <br /> அடையஅாளப்படுத்து';
$string['markunread'] = 'வாசிக்கப்படாததாக அடையாளப்படுத்து';
$string['markunreadbutton'] = 'வாசிக்கப்படாததாக <br /> அடையாளப்படுத்து';
$string['maxattachments'] = 'உடனிணைப்புகளின் அதிகூடிய எண்ணிக்கை';
$string['maxattachmentsize'] = 'உடனிணைப்பின் அதிகூடிய பருமன்';
$string['maxattachmentsize_help'] = ':
<p> மாணவா்களால் பதிவேற்றக்கூடிய கோப்புகளின் ஆகக் கூடிய பருமனை இதில் தெரிவுசெய்யலாம். இதில் தேவைக்கு அதிகமான பருமனைத் தெரிவுசெய்வது வரவேற்கத் தக்கதல்ல. </p>';
$string['maxtimehaspassed'] = 'மன்னிக்கவும், ஆனால் இவ்வஞ்சலைத் ({$a}) தொகுக்க வேண்டிய கால எல்லை முடிவடைந்து விட்டது!';
$string['message'] = 'செய்தி';
$string['missingsearchterms'] = 'இத்தகவலில் கீழுள்ள தேடல் வார்த்தைகள் HTML வடிவத்தில் மட்டுமே காணப்படும்:';
$string['modeflatnewestfirst'] = 'பதில் தளத்தோற்றம், புதியவை முதலில்.';
$string['modeflatoldestfirst'] = 'பதில் தளத்தோற்றம், பழையவை முதலில்.';
$string['modenested'] = 'பதில் தோற்றம் பின்னிய வடிவில்';
$string['modethreaded'] = 'பதில் தோற்றம் நூலோட்ட வடிவில்';
$string['modulename'] = 'கருத்துக்களம்';
$string['modulename_help'] = '<p><img alt="" src="<?php echo $CFG->wwwroot?>/mod/forum/icon.gif" />&nbsp;<b>கருத்துக்களம்</b></p>
<div class="indent">

நீங்கள் கருத்துக்களங்களை கருத்துக்களைப் பரிமாறிக்கொள்வதற்காகப் பயன்படுத்தலாம். உதாரணமாக மாணவர்களுக்கு ஒரு தலைப்பைக்கொடுத்து அதுசம்பந்தமாக நீங்கள் அவா்களைக் கலந்துரையாடச் சொல்லலாம். இன்னொரு சிறப்பான விடயம் என்னவென்றால் நீங்கள் இக்கலந்துரையாடல்களுக்கும் புள்ளிகளை வழங்குவதற்கு Moodle வழிவகை செய்கிறது.
</div>';
$string['modulenameplural'] = 'கருத்துக்களங்கள்';
$string['more'] = 'மேலும்';
$string['movedmarker'] = '(நகர்த்தப்பட்டது)';
$string['movethisdiscussionto'] = 'இக்கலந்துரையாடலை இங்கே நகர்த்து...';
$string['mustprovidediscussionorpost'] = 'நீங்கள் ஏற்றுமதி செய்வதற்கு கட்டாயமாக ஒரு கலந்துரையாடல் id அல்லது அஞ்சல் id ஐ வழங்க வேண்டும்';
$string['namenews'] = 'செய்திக் கருத்துக் களம்';
$string['namenews_help'] = '<p> ஒவ்வொரு பாடநெறிக்கும் தானாக உருவாக்கப்பட்டு முதற்பக்கத்தில் காட்டப்படும் விசேட கருத்துக் களமே செய்திக் கருத்துக் களமாகும். பொது அறிவித்தல்களைப் பொதுவாக இங்கே வெளியிடலாம். ஒரு பாடநெறியில் அதிக பட்சம் ஒரு செய்திக் கருத்துக்களமே காணப்படும்.</p>

<p>"பிந்திக் கிடைத்த செய்திகள்" கட்டத்தில் இக்கருத்துக் களத்தில் உரையாடப்படுபவை காட்டப்படும்(இது மறு பெயரிடப்பட்டாலும்.) இதன் காரணமாக, நீங்கள் "பிந்திக் கிடைத்த செய்திகள்" கட்டத்தை உருவாக்கும் போது, இக்கருத்துக்களமும் மீ-உருவாக்கப்படும்.

</p>';
$string['namesocial'] = 'சமூகக் கருத்துக் களம்';
$string['nameteacher'] = 'ஆசிரியர் கருத்துக் களம்';
$string['newforumposts'] = 'புதிய கருத்துக்கள அஞ்சல்கள்';
$string['noattachments'] = 'இவ் அஞ்சலிற்கு எந்தவொரு உடனினைப்புக்களும் இல்லை';
$string['nodiscussions'] = 'இக்கருத்துக் களத்தில் இன்னும் ஒரு கலந்துரையாடற் தலைப்பும் இல்லை.';
$string['nodiscussionsstartedby'] = 'இப்பயனாளரால் இன்னும் ஒரு கலந்துரையாடலும் தொடங்கப்படவில்லை.';
$string['noguestpost'] = 'மன்னிக்கவும், விருந்தினர் அஞ்சலிட அனுமதிக்கப்படவில்லை.';
$string['noguestsubscribe'] = 'மன்னிக்கவும், கருத்துக்கள அஞ்சல்களை, மின்னஞ்சல் மூலம் பெறுவதற்கான அங்கத்துவம் விருந்தினருக்கு வழங்கப்படவில்லை.';
$string['noguesttracking'] = 'மன்னிக்கவும், விருந்தினர்களுக்கு தடம்பதிக்க விருப்பத்தெரிவை மேற்கொள்ளமுடியாது.';
$string['nomorepostscontaining'] = '\'{$a}\' ஐக் கொண்டுள்ள மேலதிக அஞ்சல்கள் எதுவும் காணப்படவில்லை.';
$string['nonews'] = 'ஒரு செய்தியும் இதுவரை அனுப்பப் படவில்லை';
$string['nopermissiontosubscribe'] = 'கருத்துக்கள அங்கத்தினர்களைப் பார்ப்பதற்கு உங்களுக்கு அனுமதியில்லை ';
$string['nopermissiontoview'] = 'இவ் அஞ்சலைப் பார்ப்பதற்கு உங்களுக்கு அனுமதியில்லை ';
$string['nopostforum'] = 'வருந்துகிறோம். உங்களால் இந்த கருத்துக்களத்தில் பதிவு செய்ய இயலாது';
$string['noposts'] = 'அஞ்சல் எதுவும் இல்லை.';
$string['noquestions'] = 'இக்கருத்துக் களத்தில் இன்னும் ஒரு வினாக்களும் இல்லை.';
$string['nosubscribers'] = 'இக்கருத்துக் களத்தில் இதுவரை, ஒரு அங்கத்தவரும் இல்லை.';
$string['nothingnew'] = '{$a} க்குப் புதிதாக ஒன்றும் இல்லை.';
$string['notingroup'] = 'மன்னிக்கவும், இக்கருத்துக் களத்தைப் பார்ப்பதற்கு, நீங்கள் ஒரு குழுவில்  இருக்க வேண்டும்.';
$string['notinstalled'] = 'கருத்துக்களக் கூறு நிறுவப்பட்டிருக்கவில்லை ';
$string['notpartofdiscussion'] = 'இவ் அஞ்சல் கலந்துரையாடலொன்றின் பகுதியல்ல!';
$string['notrackforum'] = 'வாசிக்கப்படாத அஞ்சல்களைக் காட்டவேண்டாம்';
$string['noviewdiscussionspermission'] = 'இக்கருத்துக் களத்திலுள்ள கலந்துரையாடல்களைப் பார்ப்பதற்கு உங்களுக்கு அனுமதி கிடையாது.';
$string['nowallsubscribed'] = '{$a} இல் உள்ள எல்லாக் கருத்துக்கங்களும் அங்கத்துவம் பெறப்பட்டுள்ளன.';
$string['nowallunsubscribed'] = '{$a} இல் உள்ள எந்தவொரு கருத்துக்களங்களுக்கும் அங்கத்துவம் இல்லை.';
$string['nownotsubscribed'] = '\'{$a->forum}\' இனது பிரதிகளை மின்னஞ்சல் மூலம் {$a->name} பெறமாட்டார்.';
$string['nownottracking'] = '{$a->name} ஆல் \'{$a->forum}\' இல் தடம் பதியாது.';
$string['nowsubscribed'] = '\'{$a->forum}\' இனது பிரதிகளை மின்னஞ்சல் மூலம் {$a->name} பெறுவார்.';
$string['nowtracking'] = '\'{$a->forum}\' கருத்துக்களத்தில் {$a->name} தடம்பதிக்கப்படுகிறது.';
$string['numposts'] = '{$a} அஞ்சல்கள்';
$string['olderdiscussions'] = 'பழைய கலந்துரையாடல்கள்';
$string['oldertopics'] = 'பழைய தலைப்புகள்';
$string['parent'] = 'முன்னையதைக் காட்டு';
$string['parentofthispost'] = 'இவ்வஞ்சலின் தாய் அஞ்சல்';
$string['pluginadministration'] = 'கருத்துக்கள நிர்வாகம்';
$string['pluginname'] = 'கருத்துக்களம்';
$string['postadded'] = '<p>உங்களுடைய அஞ்சல் வெற்றிகரமாக சேர்க்கப்பட்டது.</p> <p>நீங்கள் ஏதெனும் மாற்றம் செய்ய விரும்பினால் {$a}  செய்து முடிக்கவும்.</p>';
$string['postaddedsuccess'] = 'உங்களுடைய அஞ்சல் வெற்றிகரமாக சேர்க்கப்பட்டுவிட்டது.';
$string['postincontext'] = 'இத்தபாலின் உள்ளடக்கத்தை பார்';
$string['postmailinfo'] = 'இது {$a} வலைத்தளத்தில் தபாலிடப்பட்ட தகவலின் நகல் உமது பதிலை வலைத்தளத்தினூடாக இணைக்க இத்தொடுப்பை சொடுக்குக:';
$string['postmailnow'] = 'இவ்வஞ்சலானது எல்லா கருத்துக்கள அங்கத்தினருக்கும் உடனடியாக அனுப்பப்படும்.';
$string['postrating1'] = 'தெரியுமானவற்றை அனேகமாக பிரிக்கவும்.';
$string['postrating2'] = 'பிரிக்கப்பட்டது மற்றும் இணைக்கப்பட்டது';
$string['postrating3'] = 'தெரியுமானவற்றை அனேகமாக இணைக்கவும்';
$string['posts'] = 'அஞ்சல்கள்';
$string['posttoforum'] = 'கருத்துக் களத்துக்கு அஞ்சலிடு';
$string['postupdated'] = 'உங்கள் அஞ்சல் இற்றைப்படுத்தப்பட்டுள்ளது.';
$string['potentialsubscribers'] = 'சாத்தியமான சந்தாக்காரர்கள்';
$string['processingdigest'] = 'பயனாளர் {$a} இற்கான மின்னஞ்சல் சுருக்கத் தொகுப்பு உருவாக்கப்படுகிறது.';
$string['processingpost'] = '{$a} அஞ்சலிடப்படுகிறது';
$string['prune'] = 'பிரி';
$string['prunedpost'] = 'அவ்வஞ்சலிலிருந்து புதியதொரு கலந்துரையாடல் தொடங்கப்பட்டுள்ளது.';
$string['pruneheading'] = 'கலந்துரையாடலைப் பிரித்து, இவ்வஞ்சலைப் புதியதொரு கலந்துரையாடலுக்கு நகர்த்து.';
$string['qandaforum'] = 'வினா-விடை கருத்துக் களம்';
$string['qandanotify'] = 'இது ஓர் கேள்வி பதில் வகையான கருத்துக்களம். பதில்களைப்பார்க்க வேண்டுமெனின் முதலில் உமது பதிலை அஞ்சலிடவேண்டும்';
$string['re'] = 'Re:';
$string['readtherest'] = 'இத்தலைப்பின் மிகுதியையும் வாசிக்க';
$string['replies'] = 'பதில்கள்';
$string['repliesmany'] = 'இதுவரை {$a} பதில்கள்';
$string['repliesone'] = 'இதுவரை {$a} பதில்';
$string['reply'] = 'பதில்';
$string['replyforum'] = 'கருத்துக் களத்துக்குப் பதில்';
$string['replytouser'] = 'பதிலில் மின்னஞ்சல் முகவரியை பயன்படுத்துக';
$string['resetforums'] = 'இவ்வகையான கருத்துக் களங்களிலிருந்து எல்லா அஞ்சல்களையும் அகற்று.';
$string['resetforumsall'] = 'அனைத்து அஞ்சல்களையும் அகற்று';
$string['resetsubscriptions'] = 'கருத்துக் கள அங்கத்துவங்களை அகற்று';
$string['rssarticles_help'] = '<p>RSS ஊட்டத்தில் சேர்க்கப்பட வேண்டிய கட்டுரைகளின் எண்ணிக்கை.</p>

<p>அனேக கருத்துக் களங்களுக்கு 5 இற்கும் 20 இற்குமிடைப்பட்ட எண் சரியாக இருக்கும். கருத்துக்களம் அதிகமாகப் பயன்படுத்தப்பட்டால் இதை அதிகரிக்கவும்.</p>';
$string['rsssubscriberssdiscussions'] = 'கலந்துரையாடல்களினுடைய RSS ஊட்டம்';
$string['rsssubscriberssposts'] = 'அஞ்சல்களினுடைய RSS ஊட்டம்';
$string['rsstype'] = 'இச் செயற்பாட்டிற்கான RSS ஊட்டம்';
$string['rsstype_help'] = '<p>இத்தெரிவானது, இக்கருத்துக்களத்தில் RSS ஊட்டங்களை அனுமதிக்க உதவும்.</p>

<p>நீங்கள் பின்வரும் இரண்டில் ஒரு வகை கருத்துக் களத்தைத் தெரிவு செய்யலாம்:</p>

<ul>
<li><b>உரையாடல்கள்:</b> இதைப்பயன்படுத்துகையில், உருவாக்கப்படும் ஊட்டங்களில், கருத்துக்கள முதல் அஞ்சல் உட்பட்ட, உரையாடல் சேர்க்கப்படும். </li>

<li><b>அஞ்சல்கள்:</b>இதைப்பயன்பத்துகையில், உருவாக்கப்படும் ஊட்டங்களில், கருத்துக்களத்தின் ஒவ்வொரு புதிய அஞ்சல்களும் சேர்க்கப்படும்.</li>
</ul>';
$string['search'] = 'தேடு';
$string['searchdatefrom'] = 'அஞ்சல்கள் இதைவிடப் புதியதாக இருக்க வேண்டும்.';
$string['searchdateto'] = 'அஞ்சல்கள் இதைவிடப் பழையதாக இருக்க வேண்டும்.';
$string['searchforumintro'] = 'தயவுசெய்து கீழுள்ள ஒண்று அல்லது பல பிரிவுகளில் தேடல் வார்த்தைகளை கொடுக்கவும்:';
$string['searchforums'] = 'கருத்துக் களங்களைத் தேடல்';
$string['searchfullwords'] = 'இவ்வார்த்தைகள் முழு வார்த்தைகளாகத் தோற்ற வேண்டும்.';
$string['searchnotwords'] = 'இவ்வார்த்தைகள் சேர்த்துக் கொள்ளப்படக் கூடாது';
$string['searcholderposts'] = 'பழைய அஞ்சல்களைத் தேடு';
$string['searchphrase'] = 'இந்த சொற்றொடர், அஞ்சலில் அதே போல இருக்க வேண்டும்.';
$string['searchresults'] = 'தேடல் விளைவுகள்';
$string['searchsubject'] = 'இவ்வார்த்தைகள் விடயத்தில் இருக்க வேண்டும்.';
$string['searchuser'] = 'இப்பெயர் படைப்பாளியின் பெயருடன் பொருந்த வேண்டும்.';
$string['searchuserid'] = 'ஆக்குநரின் Moodle ID';
$string['searchwhichforums'] = 'தேட வேண்டிய கருத்துக் களங்களைத் தெரிவு செய்க';
$string['searchwords'] = 'இச்சொற்கள் அஞ்சலில் எங்கு வேண்டுமானாலும் தோன்றலாம்.';
$string['seeallposts'] = 'இப் பயனாளரால் உருவாக்கப்பட்ட எல்லா அஞ்சல்களையும் பார்';
$string['shortpost'] = 'குறுகிய அஞ்சல்';
$string['showsubscribers'] = 'தற்போதைய அங்கத்தினர்களைக் காட்டு/தொகு';
$string['singleforum'] = 'ஒரு எளிய கலந்துரையாடல்';
$string['startedby'] = 'ஆரம்பிக்கப்பட்டது :';
$string['subject'] = 'விடயம்';
$string['subscribe'] = 'இக்கருத்துக் களத்தில் அங்கத்தினராகவும்';
$string['subscribeall'] = 'எல்லாரையும் இக்கருத்துக் களத்தில் அங்கத்தினராக்கவும்.';
$string['subscribed'] = 'சந்தாதாரராக்கப்பட்டது';
$string['subscribenone'] = 'இக்கருத்துக் களத்திலிருந்து எல்லாரையும் அகற்றவும்.';
$string['subscribers'] = 'அங்கத்தினர்';
$string['subscribestart'] = 'இக்கருத்துக் களத்திற்கான அஞ்சல்களின் பிரதியை எனக்கு மின்னஞ்சலில் அனுப்புக.';
$string['subscribestop'] = 'இக்கருத்துக் களத்திற்கான அஞ்சல்களின் பிரதியை எனக்கு மின்னஞ்சலில் அனுப்ப வேண்டாம்.';
$string['subscription'] = 'அங்கத்துவம்';
$string['subscription_help'] = '<p>கருத்துக்கள அங்கத்துவம் கொண்டவர்களுக்கு ஒவ்வொரு அஞ்சலிலும் பிரதி ஒன்று அனுப்பப்படும். இது அஞ்சல் அனுப்பப்பட்ட நேரத்திலிருந்து <?php echo $CFG->maxeditingtime/60 ?> நிமிடங்களின் பின்னர் அனுப்பப்படும். .</p>

<p>பயனாளர் தாம் அங்கத்துவம் வகிக்க வேண்டிய கருத்துக்களங்களைத் தீர்மானிப்பர். </p>

<p> ஆனால் ஆசிரியர் விரும்பினால், அங்கத்துவம் ஒன்றைக் கட்டாயப்படுத்தலாம். </p>

<p> இது பெரும்பாலும் செய்திக் கருத்துக்களங்களுக்கும், ஆரம்ப கருத்துக் களங்களுக்கும் பயன்படும். </p>';
$string['subscriptionauto'] = 'தன்-அங்கத்துவம்';
$string['subscriptiondisabled'] = 'அங்கத்துவம் செயலற்றதாக்கப்பட்டுள்ளது';
$string['subscriptionmode'] = 'அங்கத்துவ நிலை';
$string['subscriptionmode_help'] = '<p>ஒரு கருத்துக்களத்தில் அங்கத்துவத்தைப் பெற்றால் குறித்த கருத்துக்களத்தில் பரிமாறப்படும் கருத்துக்கள் மின்னஞ்சல் வடிவத்தில் அவா்களுக்குத் தன்னிச்சையாக அனுப்பப்படும்.</p>

<p><b>இல்லை :</b> இதனை நீங்கள் தெரிவு செய்தால் மாணவா்கள் விரும்பினால் குறிப்பிட்ட கருத்துக்களத்தில் அங்கத்தினராகிக் கொள்ளலாம்.</p>

<p><b>ஆம், ஆரம்பத்தில் :</b> இதனை நீங்கள் தெரிவு செய்தால், ஆரம்பத்தில் குறித்த பாடநெறியிலுள்ள எல்லா மாணவா்களும் குறித்த கருத்துக்களத்தின் அங்கத்தினராக்கப்படுவா். குறித்த கருத்துக்களம் உருவாக்கப்பட்டதன் பின்னா் சேரும் மாணவா்களும் இதனுடைய அங்கத்தினராக்கப்படுவா். ஆனால் எவராலும் குறித்த கருத்துக்களத்திலிருந்து விலகிக்கொள்ளமுடியும். அதாவது அங்கத்துவத்தை நீக்கிக்கொள்ளமுடியும்.  </p>

<p><b>ஆம், எப்பொழுதும் :</b> இதனைத் தெருவுசெய்தால் பாடநெறியிலுள்ள எல்லா மாணவா்களும் குறித்த கருத்துக்களத்தின் அங்கத்தினராக்கப்படுவா். குறித்த கருத்துக்களம் உருவாக்கப்பட்டதன் பின்னா் சேரும் மாணவா்களும் இதனுடைய அங்கத்தினராக்கப்படுவா். இம்மாணவா்களால் குறித்த கருத்துக்களத்திலிருந்து விலகிக்கொள்ள முடியாது. </p>

<p><b>அங்கத்துவம் அனுமதிக்கப்படவில்லை :</b> இத்தகைய கருத்துக்களங்களில் மாணவா்களால் பங்குபற்றமுடியாது. </p>

<p>நீங்கள் ஒரு கருத்துக்களத்தை இற்றைப்படுத்தும்போது கரு சம்பந்தமாக பின்வரும் விடயங்களைக் கவனத்திற் கொள்ளவேண்டும்.
நீங்கள் ‘ஆம், ஆரம்பத்தில்’ நிலையிலிருந்து ‘இல்லை’ என்ற நிலைக்கு இற்றைப்படுத்தும்போது ஏற்கனவே உள்ள அங்கத்துவங்கள் நீக்கப்படாது. எதிர்காலத்தில் சேரும் மாணவா்களை மட்டுமே இது பாதிக்கும்.
‘இல்லை’ நிலையிலிருந்து ‘ஆம், ஆரம்பத்தில்’ நிலைக்கு மாற்றும்போது ஏற்கனவே பாடநெறியில் சோ்ந்துள்ள மாணவா்கள் அங்கத்தினராக்கப்படமாட்டார்கள். ஆனால் இதன்பின்னா் சேரும் மாணவா்கள் அங்கத்தினராக்கப்படுவா்.</p>';
$string['subscriptions'] = 'அங்கத்துவங்கள்';
$string['thisforumisthrottled'] = 'இந்த கருத்துக்களத்தில் அஞ்சல்கள் செய்வது மட்டுப்படுத்தப்பட்டுள்ளது. நீங்கள் குறிப்பிட்ட நேரத்தினுள் அதனை மேற்கொள்ள முடியும். தற்போது இது {$a->blockafter} அஞ்சல்களின் பின்னர் {$a->blockperiod} தடுப்பெல்லைக் காலத்தினுள் மட்டுப்படுத்தப்படும்';
$string['timestartenderror'] = 'காட்சியின் இறுதித்தினம், ஆரம்பத்தினத்திலும் முந்தியதாக இருக்க முடியாது.';
$string['trackforum'] = 'வாசிக்கப்படாத அஞ்சல்களை தடம் பதிக்க';
$string['tracking'] = 'தடம்பதிக்க';
$string['trackingoff'] = 'இயங்கா நிலை';
$string['trackingon'] = 'இயங்கு நிலை';
$string['trackingoptional'] = 'விருப்பத் தேர்வு';
$string['trackingtype'] = 'வாசிக்கப்படாத அஞ்சல்கள் இருப்பின் குறிக்கவா?';
$string['trackingtype_help'] = '<p>இதனைப் பயன்படுத்தி பயனாளா்களால் குறித்த கருத்துக்களத்தில் ஏதாவது வாசிக்கப்படாத அஞ்சல்கள் இருக்கின்றனவா என்பதை, குறித்த கருத்துக்களத்தினுள் நுழையாது பார்வையிட்டுக்கொள்ளலாம். </p>

<p><b>On –</b> இந்த வசதியை எல்லாப் பயனாளா்களுக்கும் கொடுக்கவிரும்பினால் இதனைத் தெரிவுசெய்யலாம். இதனைத் தெரிவுசெய்தால் பயனாளா்கள் வாசிக்கப்படாதவை என்ற நிரலை இயல்பாகவே பெற்றுக்கொள்வா்.</p>

<p><b>Off –</b> இந்த வசதி அவசியப்படாவிடின் இதனைத் தெரிவுசெய்யலாம்.</p>

<p><b>Optional –</b> பயனாளா்கள் தேவைப்படின் இந்த வசதியை உட்படுத்திக் கொள்ளலாம்.</P>';
$string['unread'] = 'வாசிக்கப்படாதவை';
$string['unreadposts'] = 'வாசிக்கப்படாத அஞ்சல்கள்';
$string['unreadpostsnumber'] = '{$a} வாசிக்கப்படாத அஞ்சல்கள்';
$string['unreadpostsone'] = '1 வாசிக்கப்படாத அஞ்சல்';
$string['unsubscribe'] = 'இக்கருத்துக் களத்திலிருந்து எனது அங்கத்துவத்தை நீக்குக';
$string['unsubscribeall'] = 'அனைத்துக் கருத்துக்களங்களிலிருந்து எனது அங்கத்துவத்தை நீக்குக ';
$string['unsubscribed'] = 'அங்கத்துவம் நீக்கப்பட்டது';
$string['unsubscribeshort'] = 'அங்கத்துவத்தை நீக்குக';
$string['viewalldiscussions'] = 'எல்லாக் கலந்துரையாடல்களையும் பார்';
$string['warnafter'] = 'இத்தனை அஞ்சல்களின் பின்னர் எச்சரிக்கையை வழங்குக';
$string['warnafter_help'] = '<p>நிர்வகிக்கப்படும் அஞ்சல்கள் கொள்கை மிக எளிதானது. குறிக்கப்பட்ட கால எல்லையினுள், குறிக்கப்பட்ட எண்ணிக்கையிலான அஞ்சல்களை ஒரு பயனாளர் அனுப்பிய பின்னர், மேலும் அஞ்சல்களை அனுப்ப அனுமதிக்கப்பட மாட்டார். அத்துடன் அவர்கள் அவ்வெண்ணிக்கையை நெருங்கும் போதும் எச்சரிக்கப்படுவர். </p>

<p>எச்சரிக்கை எல்லையை 0 ஆக்குவதால் எச்சரிக்கை அனுப்புவது தவிர்க்கப்படும். தடுத்தல் எல்லையை 0 ஆக்குவதால், தடுத்தல் தவிர்க்கப்படும். தடுத்தல் தவிர்க்கப்பட்டால், எச்சரிக்கை விடுத்தலும் தானாகத் தவிர்க்கப்படும். </p>

<p>ஆசிரியர்களின் அஞ்சல்களை இவ்வமைப்புகள் பாதிப்பதில்லை. </p>';
$string['yournewquestion'] = 'உங்கள் புதியவினா';
$string['yournewtopic'] = 'உங்கள் புதிய கலந்துரையாடற் தலைப்பு';
$string['yourreply'] = 'உங்கள் பதில்';
