<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'glossary', language 'ta_lk', version '4.3'.
 *
 * @package     glossary
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['addcomment'] = 'குறிப்புரை சேர்';
$string['addentry'] = 'புதிய பதிவொன்றைச் சேர்';
$string['addingcomment'] = 'குறிப்புரை ஒன்றைச் சேர்';
$string['alias'] = 'முதன்மைச்சொல்';
$string['aliases'] = 'முதன்மைச்சொல்(சொற்கள்)';
$string['aliases_help'] = '<p>கலைச்சொல் அகராதியிலுள்ள ஒவ்வொரு பதிவும் அத்துடன் இணைக்கப்பட்டுள்ள முதன்மைச்சொற் பட்டியல் ஒன்றைக் கொண்டிருக்கும். </p>

<p><b>ஒவ்வொரு புதிய மாற்றுப் பெயரையும் புதிய வரியில் இடவும்</b> ( கால்புள்ளியால் பிரித்து இட வேண்டாம் ).</p>

<p>மாற்றுப் பெயர்களும் சொற்றொடர்களும் பதிவிற்கான மாற்றாகப் பயன்படுத்தலாம். உதாரணமாக, கலைச்சொல் அகராதியின் தன்-இணைப்பு வசதியைப் பயன்படுத்துகிறீர்களானால், எவ்விணைப்புகளை இப்பதிவிற்கு இணைக்க வேண்டும் எனறு தீர்மானிப்பதில் இது உதவும். </p>';
$string['allcategories'] = 'எல்லா வகைகளும்';
$string['allentries'] = 'எல்லாம்';
$string['allowcomments'] = 'பதிவுகளில் குறிப்புரைகளை அனுமதி';
$string['allowcomments_help'] = '<p>அருஞ்சொல் அகாராதிப் பதிவுகளில், மாணவர்களைக் குறிப்புரை சேர்க்க அனுமதி.</p>

<p>இவ்வசதியை இயலுமைப்படுத்தவோ இயலாமைப்படுத்தவோ முடியும்.</p>

<p>ஆசிரியர்கள் எப்போதும் அருஞ்சொல் அகாராதிகளுக்குக் குறிப்புரைகள் சேர்க்கலாம்.</p>';
$string['allowduplicatedentries'] = 'ஒரே பதிவுகள் அனுமதிக்கப்பட்டுள்ளன.';
$string['allowduplicatedentries_help'] = '<p>இது தெரிவு செய்யப்பட்டால், ஒன்றிற்கு மேற்பட்ட பதிவுகள் ஒரே பெயரில் பதிய அனுமதிக்கப்படும்.</p>';
$string['allowprintview'] = 'அச்சு முன்னோக்கை  அனுமதி';
$string['allowprintview_help'] = '<p>அருஞ்சொல் அகாராதியின் அச்சு நோக்கை மாணவர்கள் காண அனுமதி</p>

<p>இவ்வசதி இயலுமைப்படுத்தப்பட அல்லது இயலாமைப்படுத்தப்பட வசசி உண்டு.</p>

<p>ஆசிரியர்கள் எப்போதும் அச்சு நோக்கைப் பயன்படுத்த முடியும்.</p>';
$string['answer'] = 'விடை';
$string['approve'] = 'அனுமதி';
$string['areaattachment'] = 'உடனிணைப்புகள்';
$string['areaentry'] = 'வரையறைகள்';
$string['areyousuredelete'] = 'நீங்கள் நிச்சயமாக இப்பதிவை அழிக்க விரும்புகிறீர்களா?';
$string['areyousuredeletecomment'] = 'நீங்கள் நிச்சயமாக இக்குறிப்புரையைஅழிக்க விரும்புகிறீர்களா?';
$string['areyousureexport'] = 'நீங்கள் நிச்சயமாக இப்பதிவை ஏற்றுமதி செய்ய விரும்புகிறீர்களா?';
$string['ascending'] = '(ஏறுவரிசை)';
$string['attachment'] = 'உடனிணைப்பு';
$string['attachment_help'] = '<p>ஒவ்வொரு பதிவுக்கும் ஒரு கோப்பை உடனிணைக்கலாம். இது சேவையகத்தில் உங்கள் பதிவுடன் சேமிக்கப்படும்.</p>

<p>இக்கோப்பு எவ்வகையினதாகவும் இருக்கலாம், ஆனால் வழமையான 3 எழுத்து பின்னிணைப்பு மரபைக் கொண்டிருப்பவையாக இருந்தால் பதிவை வாசிப்பவர்களுக்கு இதனைப் பயன்படுத்த இலகுவாக இருக்கும். </p>

<p>ஒரு பதிவு மீள் தொகுக்கப்படும் போது வேறு கோப்பு சேர்க்கப்பட்டால், பழைய கோப்பு நீக்கப்படும்.</p>

<p>ஒரு பதிவு மீள் தொகுக்கப்படும் போது வேறு கோப்பு சேர்க்கப்படாவிட்டால், பழைய கோப்பு அப்படியே பேணப்படும்.</p>';
$string['author'] = 'ஆசிரியர்';
$string['authorview'] = 'ஆக்கியோன்படி உலாவு';
$string['back'] = 'Back';
$string['cantinsertcat'] = 'வகையை உள்ளிட முடியவில்லை.';
$string['cantinsertrec'] = 'பதிவை உள்ளிட முடியவில்லை.';
$string['cantinsertrel'] = 'தொடர்பு வகைப் பதிவொன்றைச் சேர்க்க முடியவில்லை.';
$string['casesensitive'] = 'இது ஒரு case sensitive ஆன பதிவு';
$string['casesensitive_help'] = '<p>இப்பதிவுகளின் தன்-இணைப்பின் போது பெரிய எழுத்து/சிறிய எழுத்து வேறுபாட்டைப் பேணுவதா இல்லையா என இவ்வமைப்பில் குறிப்பிடலாம். </p>

<p>உதாரணமாக, இது செயற்படுத்தப்பட்டிருக்கும் போது, கருத்துக்களம் ஒன்றில் உள்ள  "html" போன்ற சொல், கலைச்சொல் அகராதியிலுள்ள "HTML" என்ற சொல்லுடன் இணைக்கப்படாது.</p>';
$string['cat'] = 'வகை';
$string['categories'] = 'வகைகள்';
$string['category'] = 'வகை';
$string['categorydeleted'] = 'வகை அழிக்கப்பட்டது';
$string['categoryview'] = 'வகையின்படி உலாவு';
$string['changeto'] = '{$a} இற்கு மாற்று';
$string['cnfallowcomments'] = 'பொது இருப்பில் கலைச்சொற்களஞ்சியமானது குறிப்புரைகளை ஏற்றுக் கொள்வதா இல்லையா என வரையறுக்க.';
$string['cnfallowdupentries'] = 'பொது இருப்பில் கலைச்சொற்களஞ்சியமானது ஒன்றிற்கு மேற்பட்ட ஒரே பதிவுகளை ஏற்றுக் கொள்ளுமா இல்லையா என வரையறுக்க.';
$string['cnfapprovalstatus'] = 'மாணவர் ஒருவரால் அஞ்சலிடப்பட்ட பதிவு ஒன்றின் பொது இருப்பு அனுமதி நிலையை வரையறுக்க';
$string['cnfcasesensitive'] = 'இணைப்பு வழங்கப்பட்ட பதிவு ஒன்று, பொது இருப்பில் case sensitive ஆனதா என வரையறுக்க';
$string['cnfdefaulthook'] = 'கலைச்சொற் களஞ்சியமானது முதன் முறை நோக்கப்படும் போது காட்டப்பட வேண்டிய பொது இருப்பு தெரிவு எது என வரையறுக்க';
$string['cnfdefaultmode'] = 'கலைச்சொற் களஞ்சியமானது முதன் முறை நோக்கப்படும் போது அது காட்டப்பட வேண்டிய சட்டகம் எது என வரையறுக்க';
$string['cnffullmatch'] = 'பதிவொன்று இணைப்பு வழங்கப்படுகையில் இலக்கிலுள்ள உரையின் case உடன் பொது இருப்பில் பொருந்த வேண்டுமா என வரையறுக்க';
$string['cnflinkentry'] = 'பொது இருப்பில் ஒரு பதிவானது தானாகவே இணைக்கப்பட வேண்டுமா என வரையறுக்க.';
$string['cnflinkglossaries'] = 'பொது இருப்பில் ஒரு கலைச்சொற்களஞ்சியமானது தானாகவே இணைக்கப்பட வேண்டுமா என வரையறுக்க.';
$string['cnfrelatedview'] = 'தன்-இணைத்தல் மற்றும் பதிவு நோக்கு ஆகியவற்றின் காட்சி வடிவமைப்பைத் தெரிவு செய்க.';
$string['cnfshowgroup'] = 'குழுக்கள் வேறாக்கம் காட்டப்பட வேண்டுமா இல்லையா என வரையறுக்க.';
$string['cnfsortkey'] = 'பொது இருப்பில் வரிசைப்படுத்தும் புலத்தைத் தெரிவு செய்க.';
$string['cnfsortorder'] = 'பொது இருப்பில் வரிசைப்படுத்தும் ஒழுங்கைத் தெரிவு செய்க';
$string['cnfstudentcanpost'] = 'பொது இருப்பில் மாணவர்கள் பதிவுகளை அஞ்சலிடலாமா இல்லையா என வரையறுக்க.';
$string['comment'] = 'குறிப்புரை';
$string['commentdeleted'] = 'குறிப்புரை அழிக்கப்பட்டது';
$string['comments'] = 'குறிப்புரைகள்';
$string['commentson'] = 'Comments on';
$string['commentupdated'] = 'குறிப்புரை இற்றைப்படுத்தப்பட்டது';
$string['completionentries'] = 'மாணவர்கள் கட்டாயமாக பதிவுகளை உருவாக்க வேண்டும்:';
$string['completionentriesgroup'] = 'பதிவுகள் தேவை';
$string['concept'] = 'கொள்கை';
$string['concepts'] = 'கொள்கைகள்';
$string['configenablerssfeeds'] = 'இந்த ஆளியானது எல்லா கலைச்சொற் களஞ்சியங்களுக்குமான RSS ஊட்டங்களின் சாத்தியத்தை இயலுமைப்படுத்தும். இருந்த போதும் நீங்கள் ஒவ்வோரு கலைச்சொல் களஞ்சியத்திலும் கைமுறையால் ஊட்டங்களை இயலுமைப்படுத்த வேண்டும்.';
$string['current'] = 'தற்போது வரிசைப்படுத்தப்பட்ட {$a}';
$string['currentglossary'] = 'தற்போதைய கலைச்சொற்களஞ்சியம்';
$string['date'] = 'திகதி';
$string['dateview'] = 'தினத்தின்படி உலாவு';
$string['defaultapproval'] = 'பொது இருப்பில் அனுமதிக்கப்பட்டது';
$string['defaultapproval_help'] = '<p>மாணவர்களால் புதிதாகச் சேர்க்க்ப்படம் பதிவுகளுக்கு என்ன நடக்கவேண்டும் என இங்கே ஆசிரியர் வரையறுக்க முடியும். அவை தானாகவே எல்லோருக்கும் கிடைக்கும்படி செய்யமுடியும், அல்லது ஆசிரியர் அனுமதித்த பின் கிடைக்கும்படியும் செய்ய முடியும்.</p>';
$string['defaulthook'] = 'பொதுஇருப்பு hook';
$string['defaultmode'] = 'பொதுஇருப்பு நிலை';
$string['defaultsortkey'] = 'பொதுஇருப்பு வரிசைப்படுத்தல் விசை';
$string['defaultsortorder'] = 'பொதுஇருப்பு வரிசைப்படுத்தல் ஒழுங்கு';
$string['definition'] = 'வரையறை';
$string['definitions'] = 'வரையறைகள்';
$string['deleteentry'] = 'பதிவை அழி';
$string['deletenotenrolled'] = 'சேர்க்கப்படாத பயனாளர்களின் படி பதிவுகளை அழி';
$string['deletingcomment'] = 'குறிப்புரையை அழித்தல்';
$string['deletingnoneemptycategory'] = 'இவ்வகையை நீக்குவதால் இதிலுள்ள பதிவுகள் நீக்கப்படா. அவை வகைப்படுத்தப்படாத வகையினுள் இடப்படும்.';
$string['descending'] = '(இறங்கு வரிசை)';
$string['destination'] = 'இறக்குமதி செய்யப்பட்ட பதிவுகளினுடைய இலக்கு';
$string['destination_help'] = '<p>பதிவுகளை நீங்கள் இறக்குமதி செய்ய வேண்டிய இலக்கை வரையறுக்கலாம்:</p>
<ul>
<li><strong>தற்போதைய அருஞ்சொல் அகாராதி:</strong> இறக்குமதி செய்யப்பட்ட பதிவுகளைத் தற்போது திறந்துள்ள அருஞ்சொல் அகாராதிக்குச் சேர்க்கும்.</li>
<li><strong>அருஞ்சொல் அகாராதி:</strong> இறக்குமதி செய்யப்பட்ட கோப்பிலுள்ள தகவல்களைக் கொண்டு, புதிய அருஞ்சொல் அகாராதி ஒன்றை உருவாக்கி அதில் புதிய பதிவுகளைச் சேர்க்கும்.</li>
</ul>';
$string['displayformat'] = 'காட்சி வடிவமைப்பு';
$string['displayformat_help'] = '<p>கலையகராதியினுள் பதிவுகள் காட்டப்படும் வடிவமைப்பை இது வரையறுக்கும்.பின்வருவன பொது இருப்பு வடிவங்களாகும்:</p>
<blockquote>
<dl>
<dt><b>எளிய அகராதி</b>:</dt>
<dd>சாதாரண அகராதி போலத் தோற்றும். ஆசிரியர் விவரம் காட்டப்படாது. உடனிணைப்புகள் இணைப்புகளாகக் காட்டப்படும்.</dd>
<dt><b>தொடர்ச்சியான</b>:</dt>
<dd>பதிவுகளை ஒன்றன் பின் ஒன்றாகக் காட்டும். </dd>
<dt><b>ஆசிரியருடன் கூடிய முழுமையான</b>:</dt>
<dd>கருத்துக் களம் போன்ற, ஆசிரியர் விவரங்களுடன் கூடிய காட்சி.  உடனிணைப்புகள் இணைப்புகளாகக் காட்டப்படும்.</dd>
<dt><b>ஆசிரியரற்ற முழுமையான</b>:</dt>
<dd>கருத்துக் களம் போன்ற, ஆசிரியர் விவரங்கள் அற்ற காட்சி.  உடனிணைப்புகள் இணைப்புகளாகக் காட்டப்படும்.</dd>
<dt><b>Encyclopedia</b>:</dt>
<dd>ஆசிரியர் விவரங்களுடன் கூடிய முழுமையான காட்சி போன்றது, ஆனால் படங்களும் காட்சியில் காட்டப்படும்.</dd>
<dt><b>வினா-விடை</b>:</dt>
<dd>வினா-விடை வகையிலானது. வினா, விடை ஆகிய சொற்களை தானாகவே சேர்த்துக் கொள்ளும். </dd>
</dl>
</blockquote>

<hr />
<p>
   <b>mod/glossary/formats/README.txt</b>. இல் உள்ள அறிவுறுத்தல்களின்படி Moodle நிர்வாகிகள் புதிய வடிவமைப்புகளை உருவாக்கலாம். </p>';
$string['displayformatcontinuous'] = 'ஆசிரியர் இன்றித் தொடர்ந்து';
$string['displayformatdictionary'] = 'எளிய, அகராதி வடிவம்';
$string['displayformatencyclopedia'] = 'அறிவுக்களஞ்சியம்';
$string['displayformatentrylist'] = 'பதிவுப் பட்டியல்';
$string['displayformatfaq'] = 'FAQ';
$string['displayformatfullwithauthor'] = 'ஆசிரியருடன் முழுமையாக';
$string['displayformatfullwithoutauthor'] = 'ஆசிரியரின்றி முழுமையாக';
$string['displayformats'] = 'காட்சி வடிவமைப்புகள்';
$string['displayformatssetup'] = 'காட்சி வடிவமைப்புகளின் அமைப்பு';
$string['duplicateentry'] = 'பிரதிப் பதிவு';
$string['editalways'] = 'எப்போதும்  தொகு';
$string['editalways_help'] = '<p>இத்தெரிவானது, மாணவர்களைத் தம் பதிவுகளை எந்நேரமும் தொகுக்க அனுமதிக்கும்.
</p>

<p>பின்வருவனவற்றுள் ஒன்றை நீங்கள் தெரிவு செய்யலாம்:</p>

<ul>
<li><b>ஆம்:</b> பதிவுகள் எப்போதும் தொகுக்கலாம்.</li>

<li><b>இல்லை:</b> வரையறுக்கப்பட்ட நேர எல்லைக்குள் பதிவுகளைத் தொகுக்கலாம்.</li>
</ul>';
$string['editcategories'] = 'வகைகளைத் தொகு';
$string['editentry'] = 'பதிவைத் தொகு';
$string['editingcomment'] = 'குறிப்புரையைத் தொகுத்தல்';
$string['entbypage'] = 'ஒரு பக்கத்தில் காட்டப்படும் பதிவுகளின் எண்ணிக்கை';
$string['entries'] = 'பதிவுகள்';
$string['entrieswithoutcategory'] = 'வகைகளற்ற பதிவுகள்';
$string['entry'] = 'பதிவு';
$string['entryalreadyexist'] = 'பதிவு ஏற்கனவே உள்ளது';
$string['entryapproved'] = 'இப்பதிவு அனுமதிக்கப்பட்டது.';
$string['entrydeleted'] = 'பதிவு அழிக்கப்பட்டது.';
$string['entryexported'] = 'பதிவு வெற்றிகரமாக ஏற்றுமதி செய்யப்பட்டது.';
$string['entryishidden'] = '(இப்பதிவு தற்சமயம் மறைக்கப்பட்டுள்ளது.)';
$string['entryleveldefaultsettings'] = 'ஆரம்ப மட்டப் பொது இருப்பு அமைப்புகள்';
$string['entrysaved'] = 'இப்பதிவு சேமிக்கப்பட்டுள்ளது';
$string['entryupdated'] = 'இப்பதிவு இற்றைப்படுத்தப்பட்டுள்ளது';
$string['entryusedynalink'] = 'இப்பதிவு தானாக இணைக்கப்பட வேண்டும்.';
$string['entryusedynalink_help'] = '<p>இப்பண்புக்கூறை இயக்குவதால், குறிப்பிட்ட பதிவானது பாடநெறியில் எங்கு காணப்பட்டாலும் தானாக இணைக்கப்படும். இதில் கருத்துக்கள அஞ்சல்கள், உள்ளக மூலவளங்கள், வாராந்த சுருக்கங்கள் என்பனவும் அடங்கும். </p>

<p>குறிப்பிட்ட உரைக்கு ஒரு இணைப்பும் ஏற்படுத்தாதிருக்க நீங்கள் விரும்பினால் (உதாரணமாக கருத்துக்கள அஞ்சல் ஒன்றில்)  &lt;nolink&gt; and &lt;/nolink&gt;  சீட்டுக்களால் அவ்வுரையை மூடவும். </p>

<p>இவ்வசதியைப் பயன்படுத்த நீங்கள் கலைச்சொல் அகராதி மட்டத்தில் தன்-இணைப்பை இயலுமைப்படுத்தி இருக்க வேண்டும். </p>';
$string['errcannoteditothers'] = 'நீங்கள் ஏனையோரின் பதிவுகளைத் தொகுக்க முடியாது.';
$string['errconceptalreadyexists'] = 'இக்கருத்து ஏற்கனவே உள்ளது. இவ்வகராதியில் பிரதிகள் ஏற்றுக்கொள்ளப்பட மாட்டா.';
$string['errdeltimeexpired'] = 'நீங்கள் இதை அழிக்க முடியாது. நேரம் முடிவடைந்து விட்டது!';
$string['erredittimeexpired'] = 'இப்பதிவைத் தொகுப்பதற்கான காலவரை முடிவடைந்து விட்டது.';
$string['errorparsingxml'] = 'கோப்பைப் பரிசீலிக்கும் போது வழு ஏற்பட்டுள்ளது. தயுவு செய்து இது ஒரு செல்லுபடியான XML syntax ஆ எனச் சரிபார்க்க.';
$string['explainaddentry'] = '<br />தற்போதைய அகராதிக்கு ஒரு புதிய பதிவைச் சேர்.';
$string['explainall'] = 'எல்லாப் பதிவையும் ஒரு பக்கத்திற் காட்டுக';
$string['explainalphabet'] = 'இச்சுட்டியைப் பயன்படுத்திக் கலைச்சொற் களஞ்சியத்தில் உலாவுக';
$string['explainexport'] = 'கலைச்சொல் அகராதிப் பதிவுகளை ஏற்றுமதி செய்யவதற்குக் கீழே உள்ள பொத்தானைச் சொடுக்குக. <br />நீங்கள் விரும்பிய போது இதை இப்பாடநெறியிலோ அல்லது இன்னோர் பாடநெறியிலோ இறக்குமதி செய்யலாம். <p>உடனிணைப்புகளும் உருவாக்குனர்களும் இதில் சேர்க்கப்படுவதில்லை என்பதைக் கருத்திற் கொள்ளவும். </p>';
$string['explainimport'] = 'பதிவிறக்க வேண்டிய கோப்பைக் குறிப்பிட்டுச் செயற்பாட்டிற்கான நிபந்தனைகளை வரையறுக்க.<p>உங்கள் கோரிக்கையைச் சமர்ப்பித்து, பெறுபேறுகளைப் பரிசீலிக்க.</p>';
$string['explainspecial'] = 'ஒரு எழுத்தில் தொடங்காத பதிவுகளைக் காட்டுக.';
$string['exportedentry'] = 'ஏற்றுமதி செய்யப்பட்ட பதிவு';
$string['exportentries'] = 'பதிவுகளை ஏற்றுமதி செய்';
$string['exportentriestoxml'] = 'XML கோப்பிற்கு பதிவுகளை ஏற்றுமதி செய்';
$string['exportfile'] = 'பதிவுகளைக் கோப்புக்கு ஏற்றுமதி செய்';
$string['exportglossary'] = 'அகராதியை ஏற்றுமதி செய்';
$string['exporttomainglossary'] = 'பிரதான அகராதிக்கு ஏற்றுமதி செய்';
$string['filetoimport'] = 'இறக்குமதி செய்ய வேண்டிய கோப்பு';
$string['filetoimport_help'] = '<p>இறக்க வேண்டிய பதிவுகளைக் கொண்ட, உங்கள் கணினியிலுள்ள, XML கோப்பைத் தெரிவு செய்க.</p>';
$string['fillfields'] = 'எண்ணக்கருவும் வரைவிலக்கணமும் கட்டாயப் புலங்கள்.';
$string['filtername'] = 'கலைச்சொற்களஞ்சியத்தைத் தன்-இணைப்பு';
$string['fullmatch'] = 'முழுச் சொற்களையும் மட்டும் இணை';
$string['fullmatch_help'] = '<p>தன்-இணைப்பு இயலுமைப்படுத்தப்பட்டு இருந்தால், இதைத் தெரிவு செய்வதன் மூலம், முழு  வார்த்தைகளை மட்டும் இணைக்கலாம்.</p>

<p>உதாரணமாக, "கல்வி" எனும் பதிவிற்குரிய இணைப்பு "கல்வியகம்" என்பதற்கு உருவாக்கப்படாது.
</p>';
$string['glossary:approve'] = 'அனுமதிக்கப்படாத பதிவுகளை அனுமதி';
$string['glossary:comment'] = 'குறிப்புரைகளை உருவாக்கு';
$string['glossary:export'] = 'பதிவுகளை ஏற்றுமதி செய்';
$string['glossary:exportentry'] = 'ஒற்றைப் பதிவை ஏற்றுமதி செய்';
$string['glossary:exportownentry'] = 'உங்களுடைய ஒற்றைப் பதிவை ஏற்றுமதி செய்';
$string['glossary:import'] = 'பதிவுகள் இறக்குமதி செய்';
$string['glossary:managecategories'] = 'வகைகளை நிர்வகி';
$string['glossary:managecomments'] = 'குறிப்புரைகளை நிர்வகி';
$string['glossary:manageentries'] = 'பதிவுகளை நிர்வகி';
$string['glossary:rate'] = 'பதிவுகளை தரப்படுத்து';
$string['glossary:view'] = 'அகராதியைப் பார்';
$string['glossary:viewrating'] = 'தரப்படுத்தல்களைப் பார்';
$string['glossary:write'] = 'புதிய பதிவுகளை உருவாக்கு';
$string['glossaryleveldefaultsettings'] = 'கலைக்களஞ்சிய நிலைகளின் பொது இருப்பு';
$string['glossarytype'] = 'அகராதி வகை';
$string['glossarytype_help'] = '<p>அருஞ்சொல் அகாராதி முறையில், பாடநெறியின் உப அருஞ்சொல் அகாராதிகளிலிருந்து பிரதான அருஞ்சொல் அகாராதிக்கு ஏற்றுமதி செய்ய முடியும்.</p>

<p>இவ்வாறு செய்வதற்குப் பாடநெறியின் பிரதான அருஞ்சொல் அகாராதி எது வென்று வரையறுக்கப்பட்டிருத்தல் வேண்டும்.</p>

<p>குறிப்பு: ஒரு பாடநெறியில் ஒரேயொரு பிரதான அருஞ்சொல் அகாராதி மட்டுமே காணப்பட முடியும், அத்துடன் அதை ஆசிரியர்கள் மட்டுமே இற்றைப்படுத்த முடியும்.</p>';
$string['guestnoedit'] = 'விருந்தினர்கள் கலைச்சொற் களஞ்சியத்தை தொகுக்க அனுமதி இல்லை';
$string['importcategories'] = 'வகைகளை இறக்குமதி செய்';
$string['importedcategories'] = 'இறக்குமதி செய்யப்பட்ட வகைகள்';
$string['importedentries'] = 'இறக்குமதி செய்யப்பட்ட பதிவுகள்';
$string['importentries'] = 'பதிவுகளை இறக்குமதி செய்';
$string['importentriesfromxml'] = 'பதிவுகளை XML கோப்பிலிருந்து இறக்குமதி செய்';
$string['isglobal'] = 'இவ்வகராதி அகில அகராதியா?';
$string['isglobal_help'] = '<p>நிர்வாகிகள், ஒரு அருஞ்சொல் அகாராதியை அகில அருஞ்சொல் அகாராதியாக்கலாம்.</p>

<p>இவ்வருஞ்சொல் அகாராதிகள், எந்தப் பாடநெறியினதும் பாகமாகலாம். (முக்கியமாக முதற் பக்கத்தில்.).</p>

<p>இதிலுள்ள வித்தியாசம் என்னவென்றால், இது தளம் முழுவதிலும் தன்-இணைப்புகளை ஏற்படுத்தக் கூடியது. (தன் சொந்தப் பாடநெறியிலிருந்து மட்டுமன்றி).</p>';
$string['letter'] = 'எழுத்து';
$string['linkcategory'] = 'இவ்வகையை தானாக இணை';
$string['linkcategory_help'] = '<p>வகைகள் தன்-இணைக்கப்பட வேண்டுமா என்பதை வரையறுக்கலாம்.</p>

<p>குறிப்பு: வகைகள் தன்-இணைக்கப்படும் போது, முழுவார்த்தைப் பொருத்தமும், எழுத்து அளவும் (English upper case and lower case) கருத்திற் கொள்ளப்படும்.</p>';
$string['linking'] = 'தன்-இணைப்பு';
$string['mainglossary'] = 'பிரதான அகராதி';
$string['maxtimehaspassed'] = 'மன்னிக்கவும், ஆனால் இக்குறிப்புரையைத்({$a}) தொகுப்பதற்கான காலவரை தாண்டி விட்டது.';
$string['modulename'] = 'கலைச்சொற்களஞ்சியம்';
$string['modulenameplural'] = 'கலைச்சொற்களஞ்சியம்';
$string['newentries'] = 'புதிய அகராதிப் பதிவுகள்';
$string['newglossary'] = 'புதிய அகராதி';
$string['newglossarycreated'] = 'புதிய அகராதி உருவாக்கப்பட்டது.';
$string['newglossaryentries'] = 'புதிய அகராதிப் பதிவுகள்:';
$string['nocomment'] = 'ஒரு குறிப்புரையும் இல்லை';
$string['nocomments'] = '(இப்பதிவில் ஒரு குறிப்புரையும் இல்லை)';
$string['noconceptfound'] = 'ஒரு கதுத்தோ வரைவிலக்கணமோ காணப்படவில்லை.';
$string['noentries'] = 'இப்பிரிவில் ஒரு பதிவும் காணப்படவில்லை.';
$string['noentry'] = 'ஒரு பதிவும் காணப்படவில்லை.';
$string['nopermissiontodelcomment'] = 'நீங்கள் மற்றயவர்களுடைய குறிப்புரைகளை நீக்க முடியாது!';
$string['nopermissiontodelinglossary'] = 'நீங்கள் இவ் அகராதியில் குறிப்புரையிட முடியாது!';
$string['nopermissiontoviewresult'] = 'நீங்கள் உங்களுடைய சொந்தப் பதிவுகளுக்கான பெறுபேறுகளை மட்டும் பார்க்க முடியும்';
$string['notcategorised'] = 'வகைப்படுத்தப்படவில்லை.';
$string['numberofentries'] = 'பதிவுகளின் எண்ணிக்கை.';
$string['onebyline'] = '(வரிக்கொன்று)';
$string['pluginadministration'] = 'கலைச்சொற்களஞ்சிய நிர்வாகம்';
$string['pluginname'] = 'கலைச்சொற்களஞ்சியம்';
$string['printerfriendly'] = 'அச்சுக்கான பதிப்பு';
$string['printviewnotallowed'] = 'அச்சு நோக்கு அனுமதிக்கப்படவில்லை.';
$string['question'] = 'வினா';
$string['rejectedentries'] = 'அனுமதி மறுக்கப்பட்ட பதிவுகள்';
$string['rejectionrpt'] = 'தவிர்த்தல் அறிக்கை';
$string['resetglossaries'] = 'பதிவுகளை நீக்கு இதிலிருந்து: ';
$string['resetglossariesall'] = 'அனைத்து அகராதிகளிலிருந்து பதிவுகளை நீக்கு';
$string['rssarticles'] = 'RSS தற்போதைய கட்டுரைகளின் எண்ணிக்கை';
$string['rssarticles_help'] = '<p>RSS ஊட்டத்திலே சேர்க்க வேண்டிய கட்டுரைகளின் எண்ணிக்கைய இங்கு தெரிவு செய்து கொள்ளலாம்.</p>

<p>அனேக அருஞ்சொல் அகாராதிகளுக்கு 5 இற்கும் 20 இற்கும் இடைப்பட்ட எண் சரியாக அமையும். அருஞ்சொல் அகாராதி அடிக்கடி இற்றைப்படுத்தப்்படுமானால், எண்ணிக்கையைக் கூட்டலாம்.</p>';
$string['rsssubscriberss'] = '\'{$a}\' எண்ணக்கருக்கான RSS ஊட்டுகளைக் காட்சிப்படுத்துக';
$string['rsstype'] = 'இச் செயற்பாட்டிற்கான RSS ஊட்டம்';
$string['rsstype_help'] = '<p>இத்தெரிவானது, இவ்வருஞ்சொல் அகாராதியிலிருந்து RSS ஊட்டங்களை இயலுமைப்படுத்த அனுமதிக்கின்றது.</p>

<p>நீங்கள் இரு வகையான ஊட்டங்களுக்கிடையில் தெரிவு செய்யலாம்:</p>

<ul>
<li><b>ஆக்கியோருடன்:</b> உருவாக்கப்படும் ஊட்டங்கள், ஆக்கியோரின் பெயரையும் ஒவ்வொரு கட்டுரையுடனும் இணைக்கும்.</li>

<li><b>ஆக்கியவரின்றி:</b> உருவாக்கப்படும் ஊட்டங்கள், ஆக்கியோரின் பெயரையும் ஒவ்வொரு கட்டுரையுடனும் இணைக்காது.</li>
</ul>';
$string['searchindefinition'] = 'முழு உரையையும் தேடு';
$string['secondaryglossary'] = 'துணை அகராதி';
$string['showall'] = 'எல்லா இணைப்புகளையும் காட்டு';
$string['showall_help'] = '<p>பயனாளர் ஒருவர் கலைச்சொல் அகராதியை உலாவும் முறையை நீங்கள் தனிப்பயனாக்கலாம். உலாவுதலும் தேடுதலும் எப்போதும் இருந்தாலும், இவை தவிர மேலும் மூன்று தெரிவுகள் உள்ளன:</p>

<p><b>விசேடமானதைக் காட்டு</b>விசேட எழுத்துக்களான   @, # கொண்டு உலாவுதலை இயலுமைப்படுத்து/இயலாமைப்படுத்து</p>

<p><b>எழுத்துகளைக் காட்டு</b> அகர எழுத்துக்கள் கொண்டு   @, # கொண்டு உலாவுதலை இயலுமைப்படுத்து/இயலாமைப்படுத்து</p>

<p><b>எல்லைவற்றையும் காட்டு</b>எல்லாப் பதிவுகளையும் ஒரே தடவையில்  உலாவுதலை இயலுமைப்படுத்து/இயலாமைப்படுத்து </p>';
$string['showalphabet'] = 'அரிச்சுவட்டைக் காட்டுக';
$string['showalphabet_help'] = '<p>பயனாளர் ஒருவர் கலைச்சொல் அகராதியை உலாவும் முறையை நீங்கள் தனிப்பயனாக்கலாம். உலாவுதலும் தேடுதலும் எப்போதும் இருந்தாலும், இவை தவிர மேலும் மூன்று தெரிவுகள் உள்ளன:</p>

<p><b>விசேடமானதைக் காட்டு</b>விசேட எழுத்துக்களான   @, # கொண்டு உலாவுதலை இயலுமைப்படுத்து/இயலாமைப்படுத்து</p>

<p><b>எழுத்துகளைக் காட்டு</b> அகர எழுத்துக்கள் கொண்டு   @, # கொண்டு உலாவுதலை இயலுமைப்படுத்து/இயலாமைப்படுத்து</p>

<p><b>எல்லைவற்றையும் காட்டு</b>எல்லாப் பதிவுகளையும் ஒரே தடவையில்  உலாவுதலை இயலுமைப்படுத்து/இயலாமைப்படுத்து </p>';
$string['showspecial'] = '\'விசேட\' இணைப்பைக் காட்டவும்.';
$string['showspecial_help'] = '<p>பயனாளர் ஒருவர் கலைச்சொல் அகராதியை உலாவும் முறையை நீங்கள் தனிப்பயனாக்கலாம். உலாவுதலும் தேடுதலும் எப்போதும் இருந்தாலும், இவை தவிர மேலும் மூன்று தெரிவுகள் உள்ளன:</p>

<p><b>விசேடமானதைக் காட்டு</b>விசேட எழுத்துக்களான   @, # கொண்டு உலாவுதலை இயலுமைப்படுத்து/இயலாமைப்படுத்து</p>

<p><b>எழுத்துகளைக் காட்டு</b> அகர எழுத்துக்கள் கொண்டு   @, # கொண்டு உலாவுதலை இயலுமைப்படுத்து/இயலாமைப்படுத்து</p>

<p><b>எல்லைவற்றையும் காட்டு</b>எல்லாப் பதிவுகளையும் ஒரே தடவையில்  உலாவுதலை இயலுமைப்படுத்து/இயலாமைப்படுத்து </p>';
$string['sortby'] = 'இதன்படி ஒழுங்கு படுத்து';
$string['sortbycreation'] = 'உருவாக்கப்பட்ட தேதியின்படி';
$string['sortbylastupdate'] = 'இறுதி இற்றைப்படுத்தலின்படி';
$string['sortchronogically'] = 'காலத்தினடிப்படையில் ஒழுங்குபடுத்துக';
$string['special'] = 'விசேடம்';
$string['standardview'] = 'அரிச்சுவட்டினடிப்படையில் உலாவுக';
$string['studentcanpost'] = 'மாணவர்கள் பதிவுகளைச் சேர்க்கலாம்.';
$string['totalentries'] = 'மொத்தப் பதிவுகள்';
$string['usedynalink'] = 'அகராதிப் பதிவுகளைத் தானாக இணைக்கவும்.';
$string['usedynalink_help'] = '<p>இப்பண்புக்கூறை இயக்குவதால், கலைச்சொல் அகராதியிலுள்ள  பதிவுகள்(கொள்கைச் சொற்கள் மற்றும் சொற்றொடர்கள்) பாடநெறியில் எங்கு காணப்பட்டாலும் தானாக இணைக்கப்படும். இதில் கருத்துக்கள அஞ்சல்கள், உள்ளக மூலவளங்கள், வாராந்த சுருக்கங்கள் என்பனவும் அடங்கும். </p>

<p>கலைச்சொல் அகராதியில் தன்-இணைப்பை இயலுமைப்படுத்தினால் மட்டும் தன்-இணைப்பு வேலை செய்யாது. ஒவ்வொரு பதிவுக்கும் இது இயலுமைப்படுத்தப்பட வேண்டும். </p>

<p>குறிப்பிட்ட உரைக்கு ஒரு இணைப்பும் ஏற்படுத்தாதிருக்க நீங்கள் விரும்பினால் (உதாரணமாக கருத்துக்கள அஞ்சல் ஒன்றில்)  &lt;nolink&gt; மற்றும் &lt;/nolink&gt;  சீட்டுக்களால் அவ்வுரையை மூடவும். </p>

<p>வகைப் பெயர்களும் இணைக்கப்படுவதைக் கவனிக்கவும், </p>';
$string['waitingapproval'] = 'அனுமதிக்குக் காத்திருக்கின்றது.';
$string['warningstudentcapost'] = '(அகராதி பிரதானமானதாக இல்லாவிடில் மட்டுமே இது பொருந்தும்.)';
$string['withauthor'] = 'எண்ணக்கருக்கள் - ஆக்கியோனுடன்';
$string['withoutauthor'] = 'எண்ணக்கருக்கள் - ஆக்கியோனில்லாமல்';
$string['writtenby'] = '-';
$string['youarenottheauthor'] = 'நீங்கள் இக்குறிப்புரையின் சொந்தக்காரர் இல்லாதபடியால், இதைத் தொகுப்பதற்கு அனுமதிக்கப்படவில்லை.';
