<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'install', language 'ta_lk', version '4.3'.
 *
 * @package     install
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['admindirerror'] = 'வரையறுக்கப்பட்ட நிர்வாகக் கோப்புறை பிழையானது.';
$string['admindirname'] = 'நிர்வாகக் கோப்புறை';
$string['admindirsetting'] = 'கட்டுப்பாட்டு பலகனியை அல்லது ஏதாவதொன்றை நீங்கள் இயக்குவதற்கு மிகவும் குறைந்த இணைய வழங்கியே நிர்வாகியை விசேட URL ஆக பயண்படுத்துகிறது.  துரதிஸ்டவசமாக
    Moodle இன் நிர்வாக பக்கத்திலுள்ள நிலையான இடத்தில் கருத்து வேறுபாடு உள்ளது . உங்கள் நிறுவலின் கோப்புகளின் நிர்வாகியின் பெயரை மாற்றுவதன் மூலமும் புதிய பெயரை இங்கு இடுவதன் மூலமும் உங்களால் அதனை உறுதிப்படுத்த முடியும்.
	உதாரணமாக: <br /> <br /><b>moodleadmin</b><br /> <br />
     Moodle இல் உள்ள நிர்வாக இணைப்பை இது பொருத்தும்.';
$string['admindirsettinghead'] = 'நிர்வாகக் கோப்புறையை அமைத்தல்';
$string['admindirsettingsub'] = 'கட்டுப்பாட்டு பலகனியை அல்லது ஏதாவதொன்றை நீங்கள் இயக்குவதற்கு மிகவும் குறைந்த இணைய வழங்கியே நிர்வாகியை விசேட URL ஆக பயண்படுத்துகிறது.  துரதிஸ்டவசமாக
    Moodle இன் நிர்வாக பக்கத்திலுள்ள நிலையான இடத்தில் கருத்து வேறுபாடு உள்ளது . உங்கள் நிறுவலின் கோப்புகளின் நிர்வாகியின் பெயரை மாற்றுவதன் மூலமும் புதிய பெயரை இங்கு இடுவதன் மூலமும் உங்களால் அதனை உறுதிப்படுத்த முடியும்.
	உதாரணமாக. : <br /> <br /><b>moodleadmin</b><br /> <br />
     Moodle இல் உள்ள நிர்வாக இணைப்பை இது பொருத்தும்.';
$string['availablelangs'] = 'இருக்கும் மொழிக்கட்டுகள்';
$string['caution'] = 'எச்சரிக்கை';
$string['chooselanguage'] = 'மொழி ஒன்றைத் தெரிவு செய்க';
$string['chooselanguagehead'] = 'மொழி ஒன்றைத் தெரிவு செய்க';
$string['chooselanguagesub'] = 'தயவு செய்து நிறுவலுக்கான மொழியைத் தெரிவு செய்க. தளத்திற்கான மற்றும் பயனாளருக்கான மொழிகளைப் பின்னர் தெரிவு செய்யலாம்.';
$string['cliadminpassword'] = 'புதிய நிர்வாகப் பயனாளர் கடவுச்சொல் ';
$string['cliinstallfinished'] = 'நிறுவல் வெற்றிகரமாக நிறைவடைந்தது.';
$string['compatibilitysettings'] = 'உங்கள் PHP அமைப்புகள் சரி பார்க்கப்படுகின்றன...';
$string['compatibilitysettingshead'] = 'உங்கள் PHP அமைப்புகளைச் சரிபார்த்தல்';
$string['compatibilitysettingssub'] = 'Moodle ஒழுங்காக இயங்குவதற்கு உங்கள் சேவையகம் இந்தச் சோதனைகள் எல்லாவற்றையும் தாண்ட வேண்டும்.';
$string['configfilenotwritten'] = 'நிறுவுகைக்கான எழுத்து நீங்கள் தெரிவு செய்த அமைப்பிலுள்ள config.php கோப்பை தானாக உருவாக்கவில்லை , ஏனெனில் Moodle கோப்பு எழுதப்படக்கூடியதாக இல்லை .Moodleலின் அடிப்படைக் கோப்புடன் பின்வரும் குறி ஐ  config.php எனும் பெயருடைய கோப்பில் நீங்கள் கைமுறையாக பிரதிபண்ணலாம் .';
$string['configfilewritten'] = 'config.php வெற்றிகரமாக உருவாக்கப்பட்டுள்ளது.';
$string['configurationcomplete'] = 'தகவமைப்பு முற்றிற்று.';
$string['configurationcompletehead'] = 'தகவமைப்பு முற்று.';
$string['configurationcompletesub'] = 'உங்கள் Moodle நிறுவலின் root இல், தகவமைப்பைக் கோப்பாகச் சேமிக்க Moodle முயற்சித்துள்ளது.';
$string['database'] = 'தரவுத்தளம்.';
$string['databasehead'] = 'தரவுத்தள அமைப்புகள்';
$string['databasehost'] = 'தரவுத்தள host';
$string['databasename'] = 'தரவுத்தளப் பெயர்';
$string['databasepass'] = 'தரவுத்தள கடவுச்சொல்';
$string['databasesocket'] = 'Unix socket';
$string['databaseuser'] = 'தரவுத்தளப் பயனாளர்';
$string['dataroot'] = 'தரவுக் கோப்புறை';
$string['datarooterror'] = 'நீங்கள் குறிப்பிட்ட \'தரவுக் கோப்புறை\' காணப்படவுமில்லை, உருவாக்கப்படவும் முடியவில்லை. பாதையைச் சரி செய்யவும் அல்லது கோப்புறையைக் கைமுறையால் உருவாக்கவும்.';
$string['datarootpublicerror'] = 'நீங்கள் குறிப்பிட்ட \'தரவுக் கோப்புறை\' இணையத்தினூடாக நேரடியாக அணுகக்கூடியதாக இருக்கிறது எனவே நீங்கள் கட்டாயமாக வேறு கோப்புறையைப் பயன்படுத்த வேண்டும்.';
$string['dbconnectionerror'] = 'நீங்கள் குறிப்பிட்ட தரவுத்தளத்துடன் தொடர்பு கொள்ள முடியவில்லை. தயவுசெய்து உங்கள் தரவுத்தள அமைப்புகளைச் சரி பார்க்கவும்.';
$string['dbcreationerror'] = 'தருவுத்தள உருவாக்கல் வழு. வழங்கப்பட்ட அமைப்புளுடன், தரவுத்தளப் பெயரை உருவாக்க முடியவில்லை.';
$string['dbhost'] = 'Host சேவையகம்';
$string['dbpass'] = 'கடவுச்சொல்';
$string['dbprefix'] = 'அட்டவணை முன்னொட்டு';
$string['dbtype'] = 'தரவுத்தள வகை';
$string['directorysettings'] = '<p>தயவு செய்து இந்த Moodle இன் நிறுவலுக்கான இடத்தை உறுதி செய்க.</p>

<p><b>Web Address:</b>
Moodle அணுகப்படும் இடத்தின் முழு இணைய முகவரியைத் தருக.
*உங்கள் தளம் பல URLகள் மூலம் அணுகக்கூடியதாக இருந்தால், உங்கள் மாணவர்கள் பயன்படுத்தக்கூடிய சிறந்த ஒன்றை மட்டும் தருக.
இறுதியில் trailing slash ஒன்றையும் விட வேண்டாம்.</p>

<p><b>Moodle Directory:</b>
இந்நிறுவலுக்கான முழுக் கோப்புறைப் பாதையைத் தருக
ஆங்கில பெரிய/சிறிய எழுத்துக்களைச் சரியாக இடவும். </p>

<p><b>தரவுக் கோப்புறை:</b>
மேலேற்றும் கோப்புக்களை Moodle சேமிப்பதற்கான இடம் உங்களுக்கு தேவைப்படுகிறது. இணைய பணியக பயனாளர்களால்
 இந்த கோப்பு வாசிக்கக்கூடியதாகவும், எழுதக்கூடியதாகவும் உள்ளது
(usually \'nobody\' or \'apache\'), ஆனால் இது இணையத்தால் நேரடியாக இயக்க முடியாது.</p>';
$string['directorysettingshead'] = 'தயவுசெய்து இம்Moodle நிறுவலின் இடத்தை உறுதி செய்யவும்.';
$string['directorysettingssub'] = '<b>இணைய முகவரி:</b>
*Moodle அணுகப்படும் இடத்தின் முழு இணைய முகவரியைத் தருக.
*உங்கள் தளம் பல URLகள் மூலம் அணுகக்கூடியதாக இருந்தால், உங்கள் மாணவர்கள் பயன்படுத்தக்கூடிய சிறந்த ஒன்றை மட்டும் தருக.
இறுதியில் trailing slash ஒன்றையும் விட வேண்டாம்.
<br />
<br />
<b>Moodle கோப்பு:</b>
இந்நிறுவலுக்கான முழுக் கோப்புறைப் பாதையைத் தருக
ஆங்கில பெரிய/சிறிய எழுத்துக்களைச் சரியாக இடவும்..
<br />
<br />
<b>தரவுக் கோப்பு:</b>
மேலேற்றும் கோப்புக்களை Moodle சேமிப்பதற்கான இடம் உங்களுக்கு தேவைப்படுகிறது. இணைய பணியக பயனாளர்களால்
 இந்த கோப்பு வாசிக்கக்கூடியதாகவும், எழுதக்கூடியதாகவும் உள்ளது
(வழமையாக \'nobody\' or \'apache\'), ஆனால் இது இணையத்தால் நேரடியாக இயக்க முடியாது.';
$string['dirroot'] = 'Moodle கோப்புறை';
$string['dirrooterror'] = '\'Moodle கோப்புறை\' அமைப்பு பிழையானதாகத் தென்படுகிறது - Moodle நிறுவல் எதையும் இங்கு காண முடியவில்லை. கீழுள்ள பெறுமதி மீ-அமைக்கப்பட்டுள்ளது.';
$string['download'] = 'பதிவிறக்கு';
$string['downloadlanguagebutton'] = '&quot;{$a}&quot; மொழிக்கட்டைப் பதிவிறக்கு';
$string['downloadlanguagehead'] = 'மொழிக்கட்டைப் பதிவிறக்கு';
$string['downloadlanguagenotneeded'] = 'பொது இருப்பு மொழிக்கட்டு "{$a}" ஐப்பயன்படுத்தி நீங்கள் நிறுவலைத் தொடரலாம்.';
$string['downloadlanguagesub'] = 'இப்போது நீங்கள் விரும்பினால், ஒரு மொழியைத் தெரிவு செய்து, அதற்குரிய மொழிக்கட்டைப் பதிவிறக்கி, அம்மொழியிலேயே நிறுவலைத் தொடரலாம்.<br /><br />உங்கலால் மொழிக்கட்டைப் பதிவிறக்க முடியாவிட்டால், நிறுவல் ஆங்கிலத்தில் தொடரும். (நிறுவல் முடிந்ததும், நீங்கள் மேலதிக மொழிக்கட்டுகளைப் பதிவிறக்கிப் பயன்படுத்தலாம்.)';
$string['environmenthead'] = 'உங்கள் சூழல் சோதிக்கப்படுகிறது.';
$string['environmentsub'] = 'தொகுதியின் தேவைகளைப் பூர்த்தி செய்யும் வகையில், உங்கள் தொகுதியின் கூறுகள் உள்ளனவா என நாம் சோதிக்கின்றோம்.';
$string['fail'] = 'தோல்வி';
$string['fileuploads'] = 'கோப்புப் பதிவேற்றம்';
$string['fileuploadserror'] = 'இது இயக்கத்திலுள்ளது';
$string['fileuploadshelp'] = '<p>உங்கள் பணியகத்தில் கோப்பு மேலேற்றுகை காணப்படவில்லை.</p>

<p>Moodle ஐ இவ்வசதி இல்லாமல் நிறவலாம். ஆனால், பின்னர் உங்களால் பாடநெறிக் கோப்புகளையோ அல்லது பயனாளர் விபரக்கோவைப் படங்களையோ பதிவேற்ற முடியாது. es.</p>

<p>கோப்புப் பதிவேற்றத்தை இயலுமைப்படுத்துவதற்கு நீங்கள் (அல்லது உங்கள் தொகுதி நிர்வாகி) பிரதான php.ini கோப்பிலுள்ள
   <b>file_uploads</b> ஐ  \'1\' இற்கு மாற்ற வேண்டும்.</p>';
$string['inputdatadirectory'] = 'தரவுக் கோப்புறை:';
$string['inputwebadress'] = 'இணைய முகவரி :';
$string['inputwebdirectory'] = 'Moodle கோப்புறை:';
$string['installation'] = 'நிறுவல்';
$string['langdownloaderror'] = 'துரதிஷ்டவசமாக "{$a}" மொழி நிறுவப்படவில்லை. நிறுவல் ஆங்கிலத்தில் தொடரும்.';
$string['langdownloadok'] = '"{$a}" மொழி வெற்றிகரமாக நிறுவப்பட்டுள்ளது. நிறுவல் இம்மொழியிற் தொடரும்.';
$string['memorylimit'] = 'நினைவக வரையறை';
$string['memorylimiterror'] = 'PHP நினைவக வரையறை குறைவாக அமைக்கப்பட்டுள்ளது. நீங்கள் பின்னர் பிரச்சனைகளைச் சந்திக்க நேரிடலாம்.';
$string['memorylimithelp'] = '<p>உங்களுடைய சேவையகத்திற்கான PHP நினைவக வரையறை தற்போது {$a} ஆக அமைக்கப்படுகிறது.</p>

<p>விசேடமாக நீங்கள், செயலாக்கப்பட்ட பகுதியின் மற்றும்/அல்லது  பயனாளர்களின் ஒரு அதிகளவு தொகையை கொண்டிருந்தால் ,இது Moodle ஐ கடைசியாக நினைவக பிரச்சினைகளை கொண்டிருப்பதற்கு  தூண்டலாம்.</p>

<p>சாத்தியமென்றால் 40M போன்ற ஒரு உயர் வரையறையுடன், நீங்கள் செம்மைப்படுத்துகிறீர்கள் என்பதை நாங்கள் சிபார்சு செய்கின்றோம்.அங்கே இதைச் செய்வதற்கான பல வழிகள், நீங்கள் முயற்சிக்க முடிகின்றதாக  உள்ளன:</p>
<ol>
<li>உங்களால் முடிந்தால் <i>--செயலாக்க-நினைவக-வரையறை</i> உடன் PHPஐ மீள் தொகுக்க</li>.
இது Moodle ஐ, நினைவக வரையறையை அதுவாகவே அமைப்பதற்கு அனுமதிக்கின்றது.</li>
<li>நீங்கள் உங்களுடைய php.ini கோப்பிற்கு அணுகலை கொண்டிருந்தால், 40M போன்ற ஏதோ ஒன்றிற்கு அங்கே அமைக்கின்ற  <b>நினைவக_வரையறையை</b> மாற்ற முடிகிறது.
நீங்கள் அணுகலை கொண்டிருக்கவில்லையென்றால்,உங்களுக்காக அதைச் செய்வதற்கு உங்களுடைய நிர்வாகியை கேட்கக்கூடியதாக இருக்க வேண்டும்.</li>
<li>சில PHP சேவையகங்களில் நீங்கள் இந்த வரியைக் கொண்டிருக்கின்ற Moodle கோப்புத் தொகுதியிலுள்ள ஒரு .htaccess கோப்பை உருவாக்க முடிகிறது.

<p><blockquote>php_பெறுமதி நினைவக_வரையறை 40M</blockquote></p>

<p>எப்படியாயினும், சில சேவையகங்களில் இது வேலை செய்வதிலிருந்து <b>அனைத்து</b> PHP பக்கங்களை தடுக்கும்(நீங்கள் பக்கங்களை பார்க்கின்ற போது தவறுகளை பார்ப்பீர்கள்) ஆகையால் நீங்கள் .htaccess கோப்பை நீக்க வேண்டியிருக்கும்.</p></li>
</ol>';
$string['mysqliextensionisnotpresentinphp'] = 'PHP ஆனது சரியாக MySQLi நீட்சியுடன் செம்மைப்படுத்தப்படவில்லை. அவ்வாரிருந்தால்தான் MySQL தொடர்புகொள்ள முடியும். தயவு செய்து உமது php.ini கோப்பினை சற்று ஆராய்க அல்லது PHP மீள் தொகுக்க. PHP 4 இற்கான MySQLi நீட்சி இல்லை. ';
$string['nativemysqli'] = 'Improved MySQL (native/mysqli)';
$string['nativeoci'] = 'Oracle (native/oci)';
$string['nativeocihelp'] = 'தற்பொழுது நீங்கள் அதிகளவு Moodle தரவுகள் சேமிக்கப்பட்டவுள்ள தரவுத்தள அமைப்பை உள்ளமைக்கலாம். இந்த தரவுத்தளம் நிறுவியால் ஏற்கனவே உருவாக்கப்பட்டுள்ளதுடன் பயனாளர் பெயர், கடவுச்சொல் பயன்படுத்த உருவாக்கப்பட்டுள்ளது. அட்டவணை முன்னொட்டு கட்டாயம்.';
$string['nativepgsql'] = 'PostgreSQL (native/pgsql)';
$string['nativepgsqlhelp'] = 'தற்பொழுது நீங்கள் அதிகளவு Moodle தரவுகள் சேமிக்கப்பட்டவுள்ள தரவுத்தள அமைப்பை உள்ளமைக்கலாம். இந்த தரவுத்தளம் நிறுவியால் ஏற்கனவே உருவாக்கப்பட்டுள்ளதுடன் பயனாளர் பெயர், கடவுச்சொல் பயன்படுத்த உருவாக்கப்பட்டுள்ளது. அட்டவணை முன்னொட்டு கட்டாயம்.';
$string['nativesqlsrv'] = 'SQL*Server Microsoft (native/sqlsrv)
	';
$string['nativesqlsrvhelp'] = 'தற்பொழுது நீங்கள் அதிகளவு Moodle தரவுகள் சேமிக்கப்பட்டவுள்ள தரவுத்தள அமைப்பை உள்ளமைக்கலாம். இந்த தரவுத்தளம் நிறுவியால் ஏற்கனவே உருவாக்கப்பட்டுள்ளதுடன் பயனாளர் பெயர், கடவுச்சொல் பயன்படுத்த உருவாக்கப்பட்டுள்ளது. அட்டவணை முன்னொட்டு கட்டாயம்.';
$string['ociextensionisnotpresentinphp'] = 'PHP ஆனது சரியாக OCI8 நீட்சியுடன் செம்மைப்படுத்தப்படவில்லை அவ்வாரிருந்தால்தான் Oracle உடன் தொடர்புகொள்ள முடியும். தயவு செய்து உமது php.ini கோப்பினை சற்று ஆராய்க அல்லது PHP மீள் தொகுக்க.';
$string['pass'] = 'தேர்ச்சி';
$string['paths'] = 'பாதைகள்';
$string['pathshead'] = 'பாதைகளை ஊர்ஜிதப்படுத்து';
$string['pgsqlextensionisnotpresentinphp'] = 'PHP ஆனது சரியாக PGSQL நீட்சியுடன் செம்மைப்படுத்தப்படவில்லை. ஆகவே PostgreSQL உடன் தொடர்புகொள்ள முடியும். தயவு செய்து உமது php.ini கோப்பினை சற்று ஆராய்க அல்லது PHP மீள் தொகுக்க.';
$string['phpextension'] = '{$a} PHP நீட்சி';
$string['phpversion'] = 'PHP பதிப்பு';
$string['phpversionhelp'] = '<p>Moodle குறைந்தளவு ஒரு PHP பதிப்பின் 4.3.0 or 5.1.0 ஐ (5.0.x அறியப்பட்ட பிரச்சினைகளின் ஒரு எண்ணிக்கையைக் கொண்டிருக்கின்றது) வேண்டுகின்றது.</p>
<p>நீங்கள் தற்போதைய பதிப்பு {$a} ஐ இயக்குகின்றீர்கள்</p>
<p>நீங்கள் PHP ஐ மேம்படுத்த  அல்லது PHP இன் ஒரு புதிய பதிப்புடன் ஒரு வழங்கியிற்கு நகர்த்த வேண்டும்!<br/>

(5.0.x இன் சம்பவத்தில்,நீங்கள் 4.4.x பதிப்பிற்கு கீழ்த்தரப்படுத்த முடிகின்றது)</p>';
$string['safemode'] = 'பாதுகாப்பான நிலை';
$string['safemodeerror'] = 'பாதுகாப்பான நிலை இயக்கத்தில் Moodle பிரச்சினைக்குள்ளாகலாம்';
$string['safemodehelp'] = '<p>Moodle, ஆகக் குறைந்தளவில்லாத இது அனேகமாக புதிய கோப்புகளை உருவாக்குவதற்கு அனுமதிக்கப்படாது எனும் பாதுகாப்பு நிலையுடனான பிரச்சினைகளின் ஒரு பல் வகை தொகுதிகளைக் கொண்டிருக்கின்றது.</p>

<p>பாதுகாப்பு நிலை வழமையாக அசாதாரண பொது இணைய வழங்கிகளால் மட்டும் செயலாக்கப்பட முடிகிறது.ஆகவே நீங்கள் உங்களுடைய Moodle தளத்திற்கான ஒரு புதிய இணைய வழங்கல் நிறுவனத்தை கண்டுபிடிக்க வேண்டியிருக்கலாம்.</p>
<p>நீங்கள் விரும்பினால் நிறுவலை தொடர்வதற்கு முயற்சிக்க முடிகிறது,ஆனால் கடைசியாக ஒரு சில பிரச்சினைகளை எதிர்பாருங்கள்.';
$string['sessionautostart'] = 'தொடர் தானாக ஆரம்பிக்கப்பட்டது';
$string['sessionautostarterror'] = 'இது இயக்கமற்ற நிலையில் உள்ளது';
$string['sessionautostarthelp'] = 'Moodle இற்கு நேர இடைவெளியில் உதவி தேவைப்படுகிறது அத்துடன் அது இல்லாமலும் செயற்படாது.</p>

<p>நேர இடைவெளிகள் செயலபாட்டுநிலையில் php.ini கோப்பில் இருக்க முடியும்... நேர இடைவெளியைப்பார்க்க.</p>';
$string['welcomep10'] = '{$a->installername} ({$a->installerversion})';
$string['welcomep20'] = 'நீங்கள் வெற்றிகரமாக நிறுவி ஆரம்பித்துள்ளதன் காரணமாக நீங்கள் இப்பக்கத்தை பார்க்கிறீர்கள்
    <strong>{$a->packname} {$a->packversion}</strong> உங்கள் கணனியில் உள்ள  பொதியில் உள்ளது.வாழ்த்துக்கள்!';
$string['welcomep30'] = '<strong>{$a->installername}</strong>ன் வெளியீடு, <strong>Moodle</strong> இயங்கும் என்கின்ற ஒரு சூழலை உருவாக்குவதற்கு பயன்பாட்டு மென்பொருளை உள்ளடக்குகிறது.';
$string['welcomep40'] = 'பொதி, <strong>Moodle {$a->moodlerelease} ({$a->moodleversion})</strong> ஐயும் உள்ளடக்கியிருக்கின்றது.';
$string['welcomep50'] = 'இந்தப் பொதியிலுள்ள அனைத்துப் பயன்பாட்டு மென்பொருட்களின் பயன்பாடு அவைகளுடைய தனித்தனியான அனுமதிப்பத்திரங்களால் ஆளப்படுகின்றது.பூரணமான <strong>{$a->installername}</strong> பொதி, <a href="http://www.opensource.org/docs/definition_plain.html">திறந்த ஆணை மூலமாக</a> உள்ளது மற்றும் <a href="http://www.gnu.org/copyleft/gpl.html">GPL</a> அனுமதிப்பத்திரத்திற்குக் கீழே விநியோகிக்கப்படுகிறது.';
$string['welcomep60'] = 'பின்வருகின்ற பக்கங்கள்,உங்களுடைய கணினியிலுள்ள <strong>Moodle ஐ </strong> அமைப்பதற்கும் மற்றும் செம்மைப்படுத்துவதற்கும், சில  பின்பற்றுவதற்கு இலேசான படிகளினூடு உங்களை முன்னெடுக்கின்றது.';
$string['welcomep70'] = 'கீழே தொடர்வதற்கு >Moodle இன்</ அமைப்புடன்"அடுத்து" பொத்தானை சொடுக்குக.';
$string['wwwroot'] = 'இணைய முகவரி';
$string['wwwrooterror'] = '\'இணைய முகவரி\' செல்லுபடியானதாக இருப்பதாக தோன்றவில்லை - இந்த Moodleலின் நிறுவுகை அங்கே காணப்படவில்லை . கீழ் உள்ள பெறுமதி மீள் அமைக்கப்பட்டுள்ளது.';
