Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/மொழிபெயர்ப்புகள்/sphinx-doc_tutorial--describing-code_*.po
Languages: ta

source: Then, add this exception to the original description of the function:
ta: பின்னர், செயல்பாட்டின் அசல் விளக்கத்திற்கு இந்த விதிவிலக்கைச் சேர்க்கவும்:

source: docs/source/usage.rst
ta: டாக்ஸ்/மூல/பயன்பாடு

source: And finally, this is how the result would look:
ta: இறுதியாக, இதன் விளைவாக இப்படித்தான் இருக்கும்:

source: HTML result of documenting a Python function in Sphinx with cross-references
ta: ஸ்பிங்க்ஸில் பைதான் செயல்பாட்டை ஆவணப்படுத்துவதன் HTML முடிவு குறுக்கு குறிப்புகளுடன்

source: HTML result of documenting a Python function in Sphinx with cross-references
ta: குறுக்கு குறிப்புகளுடன் ஸ்பிங்க்ஸில் பைதான் செயல்பாட்டை ஆவணப்படுத்துவதன் விளைவாக HTML முடிவு

source: Beautiful, isn't it?
ta: அழகான, இல்லையா?

source: Including doctests in your documentation
ta: உங்கள் ஆவணத்தில் ஆவணங்கள் உட்பட

source: Since you are now describing code from a Python library, it will become useful to keep both the documentation and the code as synchronized as possible. One of the ways to do that in Sphinx is to include code snippets in the documentation, called *doctests*, that are executed when the documentation is built.
ta: பைதான் நூலகத்திலிருந்து நீங்கள் இப்போது குறியீட்டை விவரிப்பதால், ஆவணங்கள் மற்றும் குறியீடு இரண்டையும் முடிந்தவரை ஒத்திசைக்கப்படுவது பயனுள்ளதாக இருக்கும். SPHINX இல் அதைச் செய்வதற்கான வழிகளில் ஒன்று, ஆவணங்கள் கட்டமைக்கப்படும்போது செயல்படுத்தப்படும் *Doctests *எனப்படும் ஆவணங்களில் குறியீடு துணுக்குகளைச் சேர்ப்பது.

source: To demonstrate doctests and other Sphinx features covered in this tutorial, Sphinx will need to be able to import the code. To achieve that, write this at the beginning of ``conf.py``:
ta: இந்த டுடோரியலில் உள்ளடக்கப்பட்ட ஆவணங்கள் மற்றும் பிற ஸ்பிங்க்ஸ் அம்சங்களை நிரூபிக்க, ஸ்பிங்க்ஸ் குறியீட்டை இறக்குமதி செய்ய முடியும். அதை அடைய, `` conf.py`` இன் தொடக்கத்தில் இதை எழுதுங்கள்:

source: docs/source/conf.py
ta: டாக்ஸ்/மூல/conf.py

source: An alternative to changing the :py:data:`sys.path` variable is to create a ``pyproject.toml`` file and make the code installable, so it behaves like any other Python library. However, the ``sys.path`` approach is simpler.
ta: மாற்றுவதற்கான மாற்று: PY: தரவு: `sys.bath` மாறி என்பது` `pyproject.toml`` கோப்பை உருவாக்கி குறியீட்டை நிறுவக்கூடியதாக மாற்றுவதாகும், எனவே இது வேறு எந்த பைதான் நூலகத்தையும் போலவே செயல்படுகிறது. இருப்பினும், `` sys.bath`` அணுகுமுறை எளிமையானது.

source: Then, before adding doctests to your documentation, enable the :doc:`doctest </usage/extensions/doctest>` extension in ``conf.py``:
ta: பின்னர், உங்கள் ஆவணங்களில் ஆவணங்களைச் சேர்ப்பதற்கு முன்,: Doc: `Doctest </Useage/extensions/Doctest>` `conf.py`` இல் நீட்டிப்பு:

source: Next, write a doctest block as follows:
ta: அடுத்து, பின்வருமாறு ஒரு ஆவணத் தொகுதியை எழுதுங்கள்:

source: Python
ta: பைதான்

source: Doctests include the Python instructions to be run preceded by ``>>>``, the standard Python interpreter prompt, as well as the expected output of each instruction. This way, Sphinx can check whether the actual output matches the expected one.
ta: `` >>> ``, நிலையான பைதான் மொழிபெயர்ப்பாளர் வரியில், அத்துடன் ஒவ்வொரு அறிவுறுத்தலின் எதிர்பார்க்கப்படும் வெளியீடும் முன்னால் இயக்க வேண்டிய பைதான் வழிமுறைகளை ஆவணங்கள் உள்ளடக்குகின்றன. இந்த வழியில், உண்மையான வெளியீடு எதிர்பார்த்த ஒன்றோடு பொருந்துமா என்பதை ஸ்பின்க்ஸ் சரிபார்க்கலாம்.

source: To observe how a doctest failure looks like (rather than a code error as above), let's write the return value incorrectly first. Therefore, add a function ``get_random_ingredients`` like this:
ta: ஒரு ஆவண தோல்வி எப்படி இருக்கும் என்பதைக் கவனிக்க (மேலே உள்ள குறியீடு பிழையை விட), வருவாய் மதிப்பை முதலில் தவறாக எழுதுவோம். எனவே, இது போன்ற `` get_random_ingreations`` ஒரு செயல்பாட்டைச் சேர்க்கவும்:

source: You can now run ``make doctest`` to execute the doctests of your documentation. Initially this will display an error, since the actual code does not behave as specified:
ta: உங்கள் ஆவணங்களின் ஆவணங்களை செயல்படுத்த இப்போது `` டாக்ஸ்டெஸ்டை உருவாக்கலாம். ஆரம்பத்தில் இது ஒரு பிழையைக் காண்பிக்கும், ஏனெனில் உண்மையான குறியீடு குறிப்பிட்டபடி செயல்படாது:

source: Describing code in Sphinx
ta: ஸ்பிங்க்ஸில் குறியீட்டை விவரிக்கிறது

source: Documenting Python objects
ta: பைதான் பொருள்களை ஆவணப்படுத்துதல்

source: As you can see, doctest reports the expected and the actual results, for easy examination. It is now time to fix the function:
ta: நீங்கள் பார்க்க முடியும் என, டாக்ஸ்டெஸ்ட் எதிர்பார்த்த மற்றும் உண்மையான முடிவுகளை எளிதாக பரிசோதிக்க தெரிவிக்கிறது. செயல்பாட்டை சரிசெய்ய இப்போது நேரம் வந்துவிட்டது:

source: Sphinx offers several roles and directives to document Python objects, all grouped together in :doc:`the Python domain </usage/domains/python>`. For example, you can use the :rst:dir:`py:function` directive to document a Python function, as follows:
ta: பைதான் பொருள்களை ஆவணப்படுத்த ஸ்பின்க்ஸ் பல பாத்திரங்களையும் வழிமுறைகளையும் வழங்குகிறது, இவை அனைத்தும் ஒன்றாக தொகுக்கப்பட்டுள்ளன: டாக்: `பைதான் டொமைன் </பயன்பாடு/களங்கள்/பைதான்>`. எடுத்துக்காட்டாக, நீங்கள்: rst: dir: `py: செயல்பாடு` ஒரு பைதான் செயல்பாட்டை ஆவணப்படுத்த உத்தரவு பின்வருமாறு: பின்வருமாறு:

source: And finally, ``make test`` reports success!
ta: இறுதியாக, `` சோதனை `` வெற்றியைப் புகாரளிக்கவும்!

source: For big projects though, this manual approach can become a bit tedious. In the next section, you will see :doc:`how to automate the process </tutorial/automatic-doc-generation>`.
ta: பெரிய திட்டங்களுக்கு, இந்த கையேடு அணுகுமுறை சற்று சிரமமாக மாறும். அடுத்த பகுதியில், நீங்கள் காண்பீர்கள்: டாக்: `செயல்முறையை எவ்வாறு தானியக்கமாக்குவது </டுடோரியல்/தானியங்கி-டாக்-தலைமுறை>`.

source: Other languages (C, C++, others)
ta: பிற மொழிகள் (சி, சி ++, மற்றவை)

source: Documenting and cross-referencing objects
ta: பொருள்களை ஆவணப்படுத்துதல் மற்றும் குறுக்கு-குறிப்பு

source: Sphinx also supports documenting and cross-referencing objects written in other programming languages. There are four additional built-in domains: C, C++, JavaScript, and reStructuredText. Third-party extensions may define domains for more languages, such as
ta: பிற நிரலாக்க மொழிகளில் எழுதப்பட்ட பொருள்களை ஆவணப்படுத்துவதற்கும் குறுக்கு-குறிப்பு வழங்குவதையும் SPHINX ஆதரிக்கிறது. சி, சி ++, ஜாவாஸ்கிரிப்ட் மற்றும் மறுசீரமைப்பு டெக்ஸ்ட் நான்கு கூடுதல் உள்ளமைக்கப்பட்ட களங்கள் உள்ளன. மூன்றாம் தரப்பு நீட்டிப்புகள் போன்ற பல மொழிகளுக்கான களங்களை வரையறுக்கலாம்

source: `Julia <http://bastikr.github.io/sphinx-julia>`_, or
ta: `ஜூலியா <http://bastikr.github.io/sphinx- ஜூலியா>` _, அல்லது

source: For example, to document a C++ type definition, you would use the built-in :rst:dir:`cpp:type` directive, as follows:
ta: எடுத்துக்காட்டாக, ஒரு சி ++ வகை வரையறையை ஆவணப்படுத்த, நீங்கள் உள்ளமைக்கப்பட்ட: rst: dir: `cpp: type` உத்தரவைப் பயன்படுத்துவீர்கள், பின்வருமாறு:

source: Which would give the following result:
ta: இது பின்வரும் முடிவைக் கொடுக்கும்:

source: A typedef-like declaration of a type.
ta: ஒரு வகையின் தட்டச்சு போன்ற அறிவிப்பு.

source: All such directives then generate references that can be cross-referenced by using the corresponding role. For example, to reference the previous type definition, you can use the :rst:role:`cpp:type` role as follows:
ta: இதுபோன்ற அனைத்து வழிமுறைகளும் பின்னர் தொடர்புடைய பாத்திரத்தைப் பயன்படுத்துவதன் மூலம் குறுக்கு-குறிப்பிடக்கூடிய குறிப்புகளை உருவாக்குகின்றன. எடுத்துக்காட்டாக, முந்தைய வகை வரையறையைக் குறிப்பிட, நீங்கள்: rst: reware: `cpp: வகை` பாத்திரத்தை பின்வருமாறு பயன்படுத்தலாம்:

source: Which would produce a hyperlink to the previous definition: :cpp:type:`CustomList`.
ta: இது முந்தைய வரையறைக்கு ஒரு ஹைப்பர்லிங்கை உருவாக்கும் :: சிபிபி: வகை: `தனிப்பயன் பட்டியல்`.

source: In the :doc:`previous sections of the tutorial </tutorial/index>` you can read how to write narrative or prose documentation in Sphinx. In this section you will describe code objects instead.
ta: இல்: டாக்: `டுடோரியலின் முந்தைய பிரிவுகள் </டுடோரியல்/குறியீட்டு>` ஸ்பிங்க்ஸில் கதை அல்லது உரைநடை ஆவணங்களை எவ்வாறு எழுதுவது என்பதை நீங்கள் படிக்கலாம். இந்த பிரிவில் நீங்கள் அதற்கு பதிலாக குறியீடு பொருள்களை விவரிப்பீர்கள்.

source: Which will render like this:
ta: இது இதுபோன்றதாக இருக்கும்:

source: HTML result of documenting a Python function in Sphinx
ta: ஸ்பிங்க்ஸில் பைதான் செயல்பாட்டை ஆவணப்படுத்துவதன் HTML முடிவு

source: The rendered result of documenting a Python function in Sphinx
ta: ஸ்பிங்க்ஸில் பைதான் செயல்பாட்டை ஆவணப்படுத்துவதன் மூலம் வழங்கப்பட்ட முடிவு

source: Notice several things:
ta: பல விஷயங்களைக் கவனியுங்கள்:

source: Sphinx parsed the argument of the ``.. py:function`` directive and highlighted the module, the function name, and the parameters appropriately.
ta: ஸ்பின்க்ஸ் `` .. py: செயல்பாடு`` உத்தரவின் வாதத்தை பாகுபடுத்தி, தொகுதி, செயல்பாட்டு பெயர் மற்றும் அளவுருக்களை சரியான முறையில் முன்னிலைப்படுத்தியது.

source: The directive content includes a one-line description of the function, as well as an :ref:`info field list <info-field-lists>` containing the function parameter, its expected type, the return value, and the return type.
ta: வழிநடத்தும் உள்ளடக்கத்தில் செயல்பாட்டின் ஒரு வரி விளக்கமும், அத்துடன் ஒரு: குறிப்பு: `தகவல் புலம் பட்டியல் <தகவல்-புல-பட்டியல்கள்>` செயல்பாட்டு அளவுரு, அதன் எதிர்பார்க்கப்படும் வகை, வருவாய் மதிப்பு மற்றும் வருவாய் வகை ஆகியவற்றைக் கொண்டுள்ளது.

source: The ``py:`` prefix specifies the :term:`domain`. You may configure the default domain so you can omit the prefix, either globally using the :confval:`primary_domain` configuration, or use the :rst:dir:`default-domain` directive to change it from the point it is called until the end of the file. For example, if you set it to ``py`` (the default), you can write ``.. function::`` directly.
ta: `` Py: `` முன்னொட்டு குறிப்பிடுகிறது: கால: `டொமைன்`. நீங்கள் இயல்புநிலை களத்தை உள்ளமைக்கலாம், எனவே உலகளவில்: confval: `primal_domain` உள்ளமைவு ஆகியவற்றைப் பயன்படுத்தலாம், அல்லது: rst: dir:` இயல்புநிலை-டொமைன்` உத்தரவை அதைப் பயன்படுத்தவும் கோப்பின் முடிவு. எடுத்துக்காட்டாக, நீங்கள் அதை `` py`` (இயல்புநிலை) என அமைத்தால், நீங்கள் `` .. செயல்பாடு :: `` நேரடியாக எழுதலாம்.

source: Cross-referencing Python objects
ta: பைதான் பொருள்களை குறுக்கு-குறிப்பு

source: By default, most of these directives generate entities that can be cross-referenced from any part of the documentation by using :ref:`a corresponding role <python-roles>`. For the case of functions, you can use :rst:role:`py:func` for that, as follows:
ta: இயல்பாக, இந்த வழிமுறைகளில் பெரும்பாலானவை ஆவணங்களின் எந்தப் பகுதியிலிருந்தும் குறுக்கு-குறிப்பிடக்கூடிய நிறுவனங்களை உருவாக்குகின்றன: குறிப்பு: `தொடர்புடைய பங்கு <பைதான்-ரோல்ஸ்>`. செயல்பாடுகளின் விஷயத்தில், நீங்கள் பயன்படுத்தலாம்: rst: பங்கு: `py: func` அதற்காக பின்வருமாறு:

source: Sphinx supports documenting code objects in several languages, namely Python, C, C++, JavaScript, and reStructuredText. Each of them can be documented using a series of directives and roles grouped by :doc:`domain </usage/domains/index>`. For the remainder of the tutorial you will use the Python domain, but all the concepts seen in this section apply for the other domains as well.
ta: பைதான், சி, சி ++, ஜாவாஸ்கிரிப்ட் மற்றும் மறுசீரமைப்பு டெக்ஸ்ட் போன்ற பல மொழிகளில் குறியீடு பொருள்களை ஆவணப்படுத்த SPHINX ஆதரிக்கிறது. அவை ஒவ்வொன்றையும் தொடர்ச்சியான வழிமுறைகள் மற்றும் பாத்திரங்களைப் பயன்படுத்தி ஆவணப்படுத்தலாம்: டாக்: `டொமைன் </பயன்பாடு/களங்கள்/குறியீட்டு>`. டுடோரியலின் எஞ்சிய பகுதிக்கு நீங்கள் பைதான் டொமைனைப் பயன்படுத்துவீர்கள், ஆனால் இந்த பிரிவில் காணப்படும் அனைத்து கருத்துக்களும் மற்ற களங்களுக்கும் பொருந்தும்.

source: When generating code documentation, Sphinx will generate a cross-reference automatically just by using the name of the object, without you having to explicitly use a role for that. For example, you can describe the custom exception raised by the function using the :rst:dir:`py:exception` directive:
ta: குறியீடு ஆவணங்களை உருவாக்கும் போது, நீங்கள் ஒரு பாத்திரத்தை வெளிப்படையாகப் பயன்படுத்தாமல், பொருளின் பெயரைப் பயன்படுத்துவதன் மூலம் SPHINX தானாக ஒரு குறுக்கு-குறிப்பை உருவாக்கும். எடுத்துக்காட்டாக, செயல்பாட்டால் எழுப்பப்பட்ட தனிப்பயன் விதிவிலக்கை நீங்கள் விவரிக்கலாம்: rst: dir: `py: விதிவிலக்கு` உத்தரவு:
