Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/மொழிபெயர்ப்புகள்/இருப்பாதை.po
Languages: ta

source: adequate distance
ta: போதும் தொலைவு

source: adhesion
ta: ஒட்டுமை

source: airconditioned chair car
ta: குளிர்சாதன இருக்கை இருப்புப்பெட்டி

source: airconditioned sleeper car/coach
ta: குளிர்சாதன படுக்கை இருப்புப்பெட்டி

source: alignment
ta: இருப்புவழி

source: all-clear signal
ta: முழுத்தெளிவுச் சைகை

source: apron
ta: ஏற்றிடம்

source: ashpan
ta: சாம்பல்பிடி

source: balancing speed
ta: நிலைநிமிர் வேகம்

source: gradient
ta: சரிவு

source: safe stable cruising speed
ta: பாதுகாப்பான நிலைத்த சீரியங்கு வேகம்

source: banker
ta: துணையுந்துப்பொறி

source: brake
ta: நிறுத்தி

source: berth
ta: அணைகரை

source: bogie
ta: இருப்புப்பெட்டி

source: catenary
ta: சங்கிலியம்

source: chair car
ta: இருக்கை இருப்புப்பெட்டி

source: dead-end siding
ta: முட்டுப் பக்கப்பாதை

source: dead-end
ta: முட்டு

source: double line
ta: இரட்டை இருப்புப்பாதை

source: driving cab
ta: இயக்கிருப்புப்பெட்டி

source: engine (locomotive)
ta: உந்துபொறி

source: facing points
ta: விலகும் பிரிவகம்

source: gauntleted track
ta: பின்னல் இருப்புப்பாதை

source: rails
ta: இருப்புகள்

source: grate
ta: பரணி

source: headway
ta: இடைநேரம்

source: hotel power
ta: இருப்பு மின்சாரம்

source: king lever
ta: தலைப்பு நெம்புகோல்

source: level crossing
ta: இருப்புப்பாதைக் கடவை

source: locomotive
ta: உந்துபொறி

source: marshalling yard
ta: பிரிப்பு முற்றம்

source: monsoon load
ta: பருவமழைச் சுமை

source: pantograph
ta: வரைச்சட்டம்

source: phase gap
ta: கட்ட இடைவெளி

source: points
ta: பிரிவகம்

source: rack
ta: இருப்படுக்கு

source: siding
ta: பக்கப்பாதை

source: single line
ta: ஒற்றை இருப்புப்பாதை

source: sleeper (track)
ta: படுக்கட்டை

source: sleeper car/coach
ta: படுக்கை இருப்புப்பெட்டி

source: stabling shed/yard
ta: ஓய்வு முற்றம்

source: standing load
ta: நிற்புப் பயண எடை

source: trailing points
ta: சேரும் பிரிவகம்

source: vestibule
ta: இணைப்புக்கூண்டு

source: yard
ta: முற்றம்
