Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/மொழிபெயர்ப்புகள்/இயற்பியல்.po
Languages: ta

source: aberration
ta: பிறழ்ச்சி

source: abrasive
ta: தேய்பொருள்

source: absolute
ta: தனி, சார்பிலா

source: absolute zero
ta: தனித்த சுழியம்

source: absorbtive power
ta: உறிஞ்சு திறன்

source: acceleration
ta: முடுக்கம்

source: accelorometer
ta: முடுக்கமானி

source: action
ta: வினை

source: adhesion
ta: ஒட்டுப்பண்பு

source: adiabatic compression
ta: வெப்பமாறா அமுக்கம்

source: adsorption
ta: பரப்புக்கவர்ச்சி, வெளிக்கவரல்

source: altimeter
ta: உயரமானி

source: amplifier
ta: மிகைப்பி

source: analogy
ta: ஒப்புமை

source: anemometer
ta: காற்றுவேகமானி

source: angle of contact
ta: தொடு கோணம்

source: angle of deviation
ta: விரி கோணம்

source: angle of emergence
ta: விடு கோணம்

source: angle of incidence
ta: படு கோணம்

source: angle of projection
ta: எறிகோணம்

source: angular momentum
ta: வளைவுந்தம்

source: angular velocity
ta: கோணத் திசைவேகம்

source: anode
ta: நேர் மின்வாய்

source: anti-matter
ta: எதிர்மப் பொருண்மை

source: anti-particle
ta: எதிர்மத் துகள்

source: arc lamp
ta: மின்வில் விளக்கு

source: balance point
ta: சமநிலை

source: balance wheel
ta: சமச்சக்கரம்

source: ball bearing
ta: மணித்தாங்கி, மணிப்பொதிகை

source: band gap
ta: பட்டை இடைவெளி

source: banking (curved tracks)
ta: வரம்புயர்வு

source: bar magnet
ta: சட்டக் காந்தம்

source: barograph
ta: பார வரைவி

source: baroscope
ta: பாரமானி

source: baryon
ta: பளுனி அதிக பாரம் கொண்ட அடிப்படைத் துகள்கள்

source: battery
ta: மின்கலம்

source: beaker
ta: முகவை

source: beats
ta: துடிப்புகள்

source: bell jar
ta: மணி ஜாடி

source: belt
ta: வார்ச்சந்து

source: biconvex lens
ta: இருகுவி வில்லை

source: binding energy
ta: பிணைப்பாற்றல்

source: binding screw
ta: இணைப்புத் திருகாணி

source: binocular
ta: இருகண்நோக்கி

source: black body
ta: கரும்பொருள்

source: boson
ta: முழுச்சுழலி

source: capillary action
ta: தந்துகி விளைவு

source: centigrade
ta: பாகை

source: chronometer
ta: காலமானி

source: clutch
ta: விடுபற்றி

source: commutator
ta: திசைமாற்றி

source: compressive
ta: அமுக்கம்

source: coolant
ta: குளிர்வி

source: correspondence principle
ta: நிகர்மைக் கோட்பாடு

source: cosmic ray
ta: அண்டக் கதிர்

source: depression
ta: தாழ்வு

source: dichromatism
ta: இருநிறமை

source: dielectric
ta: மின்கடத்தாப் பொருள், மின்கடத்திலி

source: dielectric constant
ta: மின்கடவா எண்

source: dielectric loss
ta: மின்காப்பிழப்பு

source: dielectric resistance
ta: மின்காப்புத் தடை

source: diffraction (light)
ta: நிறப்பிரிகை

source: diffraction (wave)
ta: விளிம்பு வளைவு

source: diffusion, diffusion current
ta: விரவல், விரவலோட்டம்

source: dipole moment
ta: இருமுனைத் திருப்புமை

source: ductile
ta: நீள்மையுடைய, நீட்டுத்தன்மையுடைய

source: ductility
ta: நீள்மை, நீட்டுமை, நீட்டுதன்மை

source: dynamic pressure
ta: இயக்காற்றல்

source: earnshaw's theorem
ta: எர்ன்ஷா தேற்றம்

source: electron
ta: எதிர்மின்னி

source: electrons
ta: எதிர்மின்னிகள்

source: extrinsic semiconductor
ta: வெளியார்ந்தக் குறைக்கடத்தி

source: fermion
ta: அரைச்சுழலி

source: fluid
ta: பாய்மம்

source: flux
ta: பாயம்

source: focal length
ta: குவிநீளம், குவியத் தொலைவு

source: forward bias
ta: முன்னோக்குச் சாரிகை

source: free electron
ta: தனித்த எதிர்மின்னி, தனித்த மின்னணு

source: frequency
ta: அலைவெண், பருவெண்

source: friction
ta: உராய்வு

source: fringing
ta: வடிம்பாதல்

source: galaxy
ta: விண்மீன் மண்டலம்/விண்மீன் கூட்டம்/விண்மீன் திரள்

source: gluon
ta: ஒட்டுமின்னி/ஒட்டுனி

source: hadron
ta: வல்லியன்

source: heat flux
ta: வெப்பப் பாயம்

source: hydrostatic pressure
ta: நிலைநீர்ம அழுத்தம்

source: image
ta: பிம்பம்

source: inertia
ta: நிலைமம்

source: instrinsic semiconductor
ta: உள்ளார்ந்தக் குறைக்கடத்தி

source: integer spin
ta: முழுச்சுழல்

source: interaction
ta: உள்வினை

source: inversion
ta: நேர்மாறல்

source: ion
ta: மின்னூட்டணு

source: ion current
ta: மின்னூட்டணுவோட்டம்

source: ion sheath
ta: மின்னூட்டணுவுறை

source: ionic conductivity
ta: மின்னூட்டணுக் கடத்தம்

source: ionization
ta: மின்னூட்டணுவாக்கம்

source: kinetic energy
ta: இயக்காற்றல்

source: lami's theorem
ta: லாமி தேற்றம்

source: latent heat
ta: உள்ளுறை வெப்பம், மறைவெப்பம்

source: lattice
ta: நெய்யரி

source: lattice constant
ta: நெய்யரி மாறிலி

source: leakage current
ta: கசிவு மின்னோட்டம்

source: lepton
ta: மெதுனி

source: leptons
ta: மெதுனிகள்

source: magnetic field strengh
ta: காந்தப் புலச் செறிவு

source: magnetic flux
ta: காந்தப் பாயம்

source: magnetic flux density
ta: காந்தப் பாய அடர்வு

source: magnetic levitation (maglev)
ta: காந்தலகுமம்

source: magnetic permeability
ta: காந்த உட்புகுத்திறன்

source: magnetic susceptibility
ta: காந்த ஏற்புத் திறன்

source: magnetization
ta: காந்தமாக்கம்

source: magnetostriction
ta: காந்தச்சுருக்கம்

source: malleability
ta: தகடுமை, தகடாகும் தன்மை

source: mass
ta: திணிவு, நிறை

source: matter
ta: பொருண்மை, பருப்பொருள்

source: mechanical energy
ta: பொறிமுறையாற்றல்

source: mechanical equivalent
ta: பொறிமுறைச் சமவலு

source: mechanical model
ta: பொறிமுறை மாதிரி

source: mechanics
ta: பொறிமுறையியல்

source: medium
ta: ஊடகம்

source: melody
ta: இன்னிசை

source: meson
ta: இடையி

source: mobility
ta: நகர்கை

source: mole (gram-molecule)
ta: கிராமூலக்கூறு

source: molecular beam
ta: மூலக்கூற்றுக் கற்றை

source: molecular bond
ta: மூலக்கூற்றுப் பிணைப்பு

source: molecular weight
ta: மூலக்கூற்றடை

source: molecule
ta: மூலக்கூறு

source: momemtum
ta: உந்தம்

source: moment
ta: திருப்புமை, திருப்புத்திறன்

source: moment of inertia of a particle
ta: துகளின் நிலைமத் திருப்புத்திறன்/திருப்புமை

source: moment of inertia of a rigid body
ta: திண்பொருளின் நிலைமத் திருப்புத்திறன்/திருப்புமை

source: monochromatic (light)
ta: ஒருநிற(வொளி)

source: motion
ta: இயக்கம்

source: motive force
ta: இயக்க விசை

source: muon
ta: கனமின்னி

source: negative charge
ta: குறை மின்னூட்டம், எதிர் மின்னூட்டம்

source: negative ion
ta: குறை மின்னூட்டணு, எதிர் மின்னூட்டணு

source: neutrino
ta: நுண்நொதுமி

source: orbittal velocity
ta: சுற்றியக்கத் திசைவேகம்

source: particle
ta: துகள்கள்

source: particle accelerator
ta: துகள் முடுக்கி

source: perpendicular axis theorem
ta: செங்குத்து அச்சுத் தேற்றம்

source: perpetual motion
ta: நிரந்திர இயக்கம்

source: photon
ta: ஒளியன்

source: pickle-barrel reactor
ta: பீப்பாய் அணுவுலை

source: piezo-electricity
ta: அமுக்கமின்சாரம்

source: positive charge
ta: நிறை மின்னூட்டம்; நேர் மின்னூட்டம்

source: positive ion
ta: நிறை மின்னூட்டணு; நேர் மின்னூட்டணு

source: positron
ta: மறுதலை எதிர்மின்னி

source: potential barrier
ta: மின்னழுத்த அரண்

source: potential difference
ta: மின்னழுத்த வேறுபாடு

source: potential energy
ta: நிலை ஆற்றல்

source: projectile
ta: எறிது

source: pulley
ta: கப்பி

source: quantum
ta: துளியன்

source: quark
ta: கூற்றிலி

source: radio
ta: வானொலி

source: radio interference
ta: வானலை இடையூறு

source: radius of gyration
ta: சுழற்சி ஆரம்

source: range
ta: நெடுக்கம்

source: recoil
ta: பின்னடிப்பு

source: refridgerant
ta: குளிர்பதனூட்டி

source: relative density
ta: ஒப்படர்த்தி

source: repulsion
ta: தள்ளுகை, எதிர்த்தல்

source: reverse bias
ta: பின்னோக்குச் சாரிகை

source: rigid body
ta: திண்பொருள்

source: rotatory compressor
ta: சுழல் அழுத்தி

source: saturation
ta: தெவிட்டல்

source: scale (music)
ta: மண்டிலம்

source: scattering of light
ta: ஒளிச்சிதறல்

source: shear
ta: கொய்வு

source: shear force per cross-sectional area
ta: கொய்வு விசை அதன் குறுக்குப் பரப்பு வீதத்தில்

source: sine
ta: செவ்வளை

source: siphon
ta: வடிகுழாய்

source: solidity
ta: திண்மை

source: sonometer
ta: சுரமானி

source: specific heat
ta: தன்வெப்பம்

source: specific heat capacity
ta: தன் வெப்ப ஏற்புத்திறன்

source: spectrum
ta: நிறமாலை

source: spherometer
ta: கோளமானி

source: spiral spring
ta: சுருள் வில்

source: srain tensor
ta: இசிவு பண்பன், திரிபு பண்பன்

source: statics
ta: நிலையியல்

source: stop watch
ta: நிறுத்தல் கடிகாரம்

source: strain
ta: இசிவு, திரிபு

source: strain axis
ta: திரிபு அச்சு, இசிவு அச்சு

source: stress
ta: தகைப்பு, தகைவு

source: sumblimation
ta: பதங்கமாதல்

source: surface tension
ta: பரப்பு இழுவிசை

source: tachometer
ta: சுற்றுமானி

source: tau particle
ta: மிகுமின்னி

source: tensile
ta: இழுப்பு

source: tensile stress
ta: நீட்சித் தகைவு, இழுவிசை தகைவு

source: tension
ta: இழுவிசை, விறைப்பு

source: terminal velocity
ta: இறுதித் திசைவேகம்

source: thermostat
ta: வெப்பநிலைப்பி

source: torque
ta: விசைத்திருப்பம

source: torsion
ta: முறுக்கு

source: total internal reflection
ta: முழு அக பிரதிபலிப்பு

source: trajectory
ta: எறிபாதை

source: translucency, translucent
ta: ஒளிகசிவுமை, ஒளிகசிகிற

source: transparency, transparent
ta: ஒளிபுகுமை, ஒளிபுகும்

source: type
ta: வகை

source: ultrasound
ta: ஊடொலி

source: universe
ta: அண்டம்

source: valence band
ta: இணைதிறன் பட்டை

source: velocity
ta: திசை வேகம்

source: x-ray
ta: ஊடுக்கதிர்
