Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/மொழிபெயர்ப்புகள்/கப்பலியல்.po
Languages: ta

source: cargo
ta: சரக்கு

source: cargo ship
ta: சரக்குக் கப்பல்

source: check-in
ta: பயண ஆயத்தம்

source: container
ta: சரக்குப் பெட்டகம்

source: customs
ta: சுங்கம், ஆயம்

source: dock
ta: கப்பல் கூடம்

source: dry dock
ta: உலர்துறை

source: effective aperture
ta: செயல்திறப்பு

source: emergency position indicating radio beacon
ta: அவசர இடங்காட்டொளி

source: global marine distress safety system
ta: உலகக் கடலின்னல் காப்பமைப்பு

source: global orbitting navigation satellite system
ta: கடலோடல் செயற்கைக்கோள் அமைப்பு

source: harbour
ta: துறை

source: hull
ta: கடலுடல்

source: inmarsat
ta: கடற்சாரச் செயற்கைக்கோள்

source: jetty
ta: இறங்குதுறை

source: marine
ta: கடற்சார

source: medium wave
ta: நடுவலை

source: meteriological
ta: வானிலையியல்

source: nautical chart
ta: வழிகாணல் வரைப்படம்

source: nautical mile
ta: கடல்மைல்

source: nav-aid
ta: கடலோடல் கருவி

source: navigation
ta: கடலோடல்

source: navigation system
ta: கடலோடமைப்பு

source: navigational aid
ta: கடலோடல் கருவி

source: navigational chart
ta: கடலோடல் வரைப்படம்

source: navtex
ta: கடற்தந்தி

source: pier
ta: பாந்து

source: port
ta: துறைமுகம்

source: quay
ta: தொற்றொதுக்கம்

source: radar
ta: கதிரலைக் கும்பா

source: radio-beacon
ta: சுழலலை

source: radiotelephone
ta: வானொலிப்பேசி

source: radiotelephone telecommunication network
ta: வானொலிப்பேசி தொலைத்தொடபுப் பிணையம்

source: sea-terrain
ta: கடற்கூறு

source: ship
ta: கப்பல்

source: synthetic aperture radar
ta: தொகுத்திறப்புக் கும்பா

source: terrain
ta: பரப்புக்கூறு

source: ultrasound
ta: ஊடொலி

source: wharf
ta: உமம்

source: x-ray
ta: ஊடுக்கதிர்
