Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/மொழிபெயர்ப்புகள்/நிறம்.po
Languages: ta

source: alice blue
ta: சொட்டு நீலம்

source: amber
ta: அம்பர்

source: aqua
ta: அஃகம்

source: aquamarine
ta: வாரண வண்ணம்

source: army green
ta: அரணப் பச்சை

source: auburn
ta: குரால்

source: beige
ta: புழுங்கு நிறம் , இலவம்

source: bisque
ta: குழைக்கூழ்

source: bistre
ta: கருங்குரால்

source: bordeux
ta: தூமளம்

source: british racing green
ta: யாமளம்

source: burgundy red
ta: தேறல் சிவப்பு

source: burnt sienna
ta: தீஞ்சிவல்

source: burnt umber
ta: தீஞ்சாயம்

source: camouflage green
ta: கரக்கவர் பச்சை

source: cerulean
ta: மயில் நீலம்

source: chartreuse yellow
ta: செலிய மஞ்சள்

source: chocolate
ta: காவிக்கண்டு

source: cobalt blue
ta: நீர்க்காவி

source: cordovan
ta: பூங்கைப் பழுப்பு

source: cyan
ta: நீரம்

source: dark pink
ta: கரும் பூஞ்சை

source: deep pink
ta: ஆழ் பூஞ்சை

source: duke blue
ta: காங்கு

source: egyptian blue
ta: மிசிர நீலம்

source: electric blue
ta: மின்-நீலம்

source: emerald green
ta: மரகதப் பச்சை

source: fallow
ta: வெளிறு

source: fern green
ta: புற் பச்சை

source: forest green
ta: காட்டுப்பச்சை

source: gamboge
ta: அரக்குமஞ்சள்

source: goldenpoppy
ta: பொலிக்கொடி நிறம்

source: goldenrod
ta: கொடிப்பசலை நிறம்

source: grey asparagus
ta: நீர்த்தண்டுச் சாம்பல்

source: harlequin
ta: கூசும்பச்சை

source: hartebeast
ta: கடுவாடு

source: hunter green
ta: வேட்டைக்காரன் பச்சை

source: international klein blue
ta: பொது நீலம்

source: islamic green
ta: முகமதியப் பச்சை

source: jaguar
ta: வலியச்சிறுத்தை

source: jungle green
ta: வல்லைப்பச்சை

source: kelly green
ta: கீரைப் பச்சை, வெற்றிலைப் பச்சை

source: kinkajoo
ta: தேன்கரடி

source: lavender pink
ta: குறிஞ்சிப் பூஞ்சை

source: lime
ta: அரிச் சுளை, குருந்துச் சுளை

source: lime green
ta: அரிப் பச்சை, குருந்துப் பச்சை

source: magenta
ta: நன்னிறம்

source: monsoon load
ta: பருவமழைச் சுமை

source: moose
ta: ஏழகம்

source: moss green
ta: பாசிப் பச்சை

source: mugger (crocodile)
ta: சீங்கண்ணி முதலை, சாணாகம்

source: myrtle
ta: குழிநாவல்

source: office green
ta: அலுவப் பச்சை

source: olive
ta: இடலை

source: olive drab
ta: சாணிப்பச்சை

source: pale brown
ta: வெளிர்ப் பழுப்பு

source: peach
ta: வம்மி நிறம்

source: periwinkle blue
ta: பாண்டுநீலம்

source: pine green
ta: தாழைப் பச்சை

source: prussian blue
ta: ஓரி நிறம்

source: rust
ta: கறள், துரு

source: salmon pink
ta: வஞ்சன நிறம், துவரி

source: sapphire blue
ta: நீலக்கல் நிறம்

source: school bus yellow
ta: சுள்ளி

source: shamrock green
ta: நாகப்பச்சை

source: sienna
ta: சிவல்

source: spring green
ta: இளந்தளிர்

source: tan
ta: தேன் நிறம்

source: tea green
ta: தேயிலைப் பச்சை

source: turquoise
ta: நீலாம்பரி நிறம்

source: tuscany jasmine
ta: சிந்து

source: uakari
ta: சேமுகி

source: vole
ta: வயலெலி

source: wallaby
ta: குறும்பைமான், குறும்பைம்மா

source: wallaroo
ta: செம்பைமான், செம்பைம்மா

source: weasel
ta: மரநாய்

source: wolf
ta: ஓநாய்

source: yak
ta: கவரிமா

source: zebra
ta: வரிக்குதிரை

source: zorilla
ta: வரிப்பூனை
