Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/calibre-plugins_princepdf_*.po
Languages: ta

source: Prince PDF
ta: பிரின்ச் பி.டி.எஃப்

source: Converts to PDF using the Prince software (third-party)
ta: பிரின்ச் மென்பொருளை (மூன்றாம் தரப்பு) பயன்படுத்தி PDF ஆக மாற்றுகிறது

source: <qt>Executable for the Prince program (command-line interface)</qt>
ta: <qt> பிரின்ச் நிரலுக்கான இயங்கக்கூடியது (கட்டளை-வரி இடைமுகம்) </qt>

source: &Browse
ta: & உலாவுதல்

source: <qt>Search the Prince executable in your computer</qt>
ta: <qt> உங்கள் கணினியில் இயங்கக்கூடிய இளவரசரைத் தேடுங்கள் </qt>

source: Preferred &formats:
ta: விருப்பமான மற்றும் வடிவங்கள்:

source: <qt>Comma-separated list of preferred formats to use as source, the first that matches will be used</qt>
ta: <qt> கமாவால் பிரிக்கப்பட்ட விருப்பமான வடிவங்களின் பட்டியல் மூலமாக பயன்படுத்த, முதலில் பொருந்தக்கூடியது பயன்படுத்தப்படும் </qt>

source: &Add PDF to the book record
ta: புத்தக பதிவில் PDF ஐச் சேர்க்கவும்

source: <qt>Add the converted PDF to the selected book record</qt>
ta: <qt> தேர்ந்தெடுக்கப்பட்ட புத்தக பதிவில் மாற்றப்பட்ட PDF ஐச் சேர்க்கவும் </qt>

source: &Show CSS in the Convert dialog
ta: மாற்ற உரையாடலில் CSS ஐக் காட்டுங்கள்

source: <qt>Show by default the styles in the Convert dialog</qt>
ta: <qt> மாற்றும் உரையாடலில் உள்ள பாணிகளைக் காண்பி </qt>

source: <qt>List of custom styles defined. Select one to edit</qt>
ta: <qt> வரையறுக்கப்பட்ட தனிப்பயன் பாணிகளின் பட்டியல். திருத்த ஒன்றைத் தேர்ந்தெடுக்கவும் </qt>

source: old
ta: பழைய

source: Re&name
ta: மறு & பெயர்

source: <qt>Rename the current style to the name on the right</qt>
ta: <qt> தற்போதைய பாணியை வலதுபுறத்தில் உள்ள பெயருக்கு மறுபெயரிடுங்கள் </qt>

source: <qt>Name for the new or renamed style</qt>
ta: <qt> புதிய அல்லது மறுபெயரிடப்பட்ட பாணிக்கான பெயர் </qt>

source: A&dd
ta: கூட்டு

source: <qt>Add a new empty style with the name on the left</qt>
ta: <qt> இடதுபுறத்தில் பெயருடன் புதிய வெற்று பாணியைச் சேர்க்கவும் </qt>

source: Re&move
ta: மறு & நகர்த்தவும்

source: <qt>Remove the current style</qt>
ta: <qt> தற்போதைய பாணியை அகற்று </qt>

source: Addi&tional command-line arguments:
ta: Addi & tional கட்டளை-வரி வாதங்கள்:

source: <qt>Additional command-line arguments used in conversions with this style</qt>
ta: <qt> இந்த பாணியுடன் மாற்றங்களில் பயன்படுத்தப்படும் கூடுதல் கட்டளை-வரி வாதங்கள் </qt>

source: <qt>Custom stylesheet that will be applied, if selected, to all Prince PDF conversions</qt>
ta: <qt> தேர்ந்தெடுக்கப்பட்டால், அனைத்து இளவரசர் PDF மாற்றங்களுக்கும் பயன்படுத்தப்படும் தனிப்பயன் நடைதாள் </qt>

source: Book metadata can be used in the stylesheet. Anything between %(s1)s and %(s2)s will be processed as a calibre template. For instance, %(s3)s in the stylesheet will be replaced with the book title in the conversion.
ta: புத்தக மெட்டாடேட்டாவை ச்டைல்சீட்டில் பயன்படுத்தலாம். %(எச் 1) கள் மற்றும் %(எச் 2) கள் இடையே எதுவும் ஒரு காலிபர் வார்ப்புருவாக செயலாக்கப்படும். உதாரணமாக, ச்டைல்சீட்டில் %(எச் 3) கள் மாற்றத்தில் புத்தக தலைப்புடன் மாற்றப்படும்.

source: &Custom styles:
ta: & தனிப்பயன் பாணிகள்:

source: &Restore defaults
ta: & இயல்புநிலைகளை மீட்டெடுங்கள்

source: <qt>Restore the default settings</qt>
ta: <qt> இயல்புநிலை அமைப்புகளை மீட்டெடுக்கவும் </qt>

source: <b>Warning</b>: Deletes modified styles
ta: <b> எச்சரிக்கை </b>: மாற்றியமைக்கப்பட்ட பாணிகளை நீக்குகிறது

source: default
ta: இயல்புநிலை

source: Select Prince executable
ta: பிரின்ச் இயங்கக்கூடியதைத் தேர்ந்தெடுக்கவும்

source: Cannot add style
ta: பாணியைச் சேர்க்க முடியாது

source: A style with the name "%s" is already defined, use a different name.
ta: "%கள்" என்ற பெயருடன் ஒரு பாணி ஏற்கனவே வரையறுக்கப்பட்டுள்ளது, வேறு பெயரைப் பயன்படுத்தவும்.

source: Cannot delete the last style
ta: கடைசி பாணியை நீக்க முடியாது

source: The last style cannot be removed. You can rename it and/or remove its contents.
ta: கடைசி பாணியை அகற்ற முடியாது. நீங்கள் அதை மறுபெயரிடலாம் மற்றும்/அல்லது அதன் உள்ளடக்கங்களை அகற்றலாம்.

source: Cannot rename style
ta: பாணியை மறுபெயரிட முடியாது

source: &Prince executable:
ta: & பிரின்ச் இயங்கக்கூடியது:

source: <qt>Custom CSS stylesheet to be used for this conversion</qt>
ta: <qt> தனிப்பயன் CSS ச்டைல்சீட் இந்த மாற்றத்திற்கு பயன்படுத்தப்பட வேண்டும் </qt>

source: <qt>This stylesheet cannot be modified</qt>
ta: <qt> இந்த ச்டைல்சீட்டை மாற்ற முடியாது </qt>

source: &Book CSS
ta: & புத்தக CSS

source: <qt>Book-specific CSS stylesheet included in the ebook file</qt>
ta: <qt> புத்தக-குறிப்பிட்ட CSS ச்டைல்சீட் மின்புத்தக கோப்பில் சேர்க்கப்பட்டுள்ளது </qt>

source: <qt>Show/hide the additional styles used for the conversion</qt>
ta: <qt> மாற்றத்திற்கு பயன்படுத்தப்படும் கூடுதல் பாணிகளைக் காட்டவும்/மறைக்கவும் </qt>

source: Con&vert
ta: கான் & வெர்ட்

source: <qt>Run the conversion with Prince</qt>
ta: <qt> பிரின்ச் </qt> உடன் மாற்றத்தை இயக்கவும்

source: Parsing book...
ta: பாகுபடுத்தும் நூல் ...

source: &Hide styles
ta: & பாணிகளை மறைக்கவும்

source: &Show styles
ta: & பாணிகளைக் காட்டு

source: Replacing templates
ta: வார்ப்புருக்களை மாற்றுகிறது

source: Found: %s (%d-%d)
ta: கிடைத்தது:%s (%d-%d)

source: Replace with: %s
ta: மாற்றவும்: %கள்

source: Converting book...
ta: மாற்றும் நூல் ...

source: Command line: %s
ta: கட்டளை வரி: %கள்

source: <p>Error code: %s<p>make sure Prince (<a href="http://www.princexml.com">www.princexml.com</a>) is installed and the correct command-line-interface executable is set in the configuration of this plugin, which is usually:<ul><li>In Windows: <code><i>Prince_folder</i>\Engine\bin\prince.exe</code> <li>In Linux: <code>prince</code></ul>
ta: <p> பிழைக் குறியீடு: %கள் <p> இளவரசர் (<a href="http://www.princexml.com"> www.princexml.com </a>) நிறுவப்பட்டு சரியான கட்டளை-வரி- இந்த சொருகி உள்ளமைவில் இடைமுகம் இயங்கக்கூடியது, இது வழக்கமாக: <ul> <li> விண்டோசில்: <code> <i> பிரின்ச்_ஃபோல்டர் </i> \ என்சின் \ பின் \ பிரின்ச்.இசி </code> <li> லினக்சில்: <code> பிரின்ச் </code> </ul>

source: Process error
ta: செயல்முறை பிழை

source: Convert to PDF with Prince
ta: பிரின்சுடன் PDF ஆக மாற்றவும்

source: <b>Title:</b> %s
ta: <b> தலைப்பு: </b> %கள்

source: <b>Source format:</b> %s
ta: <b> மூல வடிவம்: </b> %கள்

source: &Custom style:
ta: & தனிப்பயன் நடை:

source: <qt>Select one style to use. Additional styles can be created in the plugin configuration</qt>
ta: <qt> பயன்படுத்த ஒரு பாணியைத் தேர்ந்தெடுக்கவும். செருகுநிரல் உள்ளமைவு </qt> இல் கூடுதல் பாணிகளை உருவாக்க முடியும்

source: A&dditional command-line arguments:
ta: A & ddisional கட்டளை-வரி வாதங்கள்:

source: <qt>Specify additional command-line arguments for the conversion</qt>
ta: <qt> மாற்றத்திற்கான கூடுதல் கட்டளை-வரி வாதங்களைக் குறிப்பிடவும் </qt>

source: <qt>This stylesheet can be modified<br/>The default can be configured</qt>
ta: <qt> இந்த ச்டைல்சீட்டை மாற்றியமைக்கலாம் <br/> இயல்புநிலையை உள்ளமைக்கலாம் </qt>

source: C&ustom CSS
ta: தனிப்பயன் சிஎச்எச்

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/>.
ta: இந்த நிரல் இலவச மென்பொருள்: நீங்கள் அதை மறுபகிர்வு செய்யலாம் மற்றும்/அல்லது மாற்றலாம் இது வெளியிடப்பட்ட குனு பொது பொது உரிமத்தின் விதிமுறைகளின் கீழ் இலவச மென்பொருள் அறக்கட்டளை, உரிமத்தின் பதிப்பு 3, அல்லது (உங்கள் விருப்பத்தில்) பின்னர் எந்த பதிப்பும். இந்த நிரல் இது பயனுள்ளதாக இருக்கும் என்ற நம்பிக்கையில் விநியோகிக்கப்படுகிறது, ஆனால் எந்த உத்தரவாதமும் இல்லாமல்; மறைமுகமான பொறுப்பு கூட இல்லாமல் ஒரு குறிப்பிட்ட நோக்கத்திற்காக வணிகத்தன்மை அல்லது உடற்பயிற்சி. பார்க்க மேலும் விவரங்களுக்கு குனு பொது பொது உரிமம். குனு பொது பொது உரிமத்தின் நகலை நீங்கள் பெற்றிருக்க வேண்டும் இந்த திட்டத்துடன். இல்லையென்றால், <http://www.gnu.org/licenses/> ஐப் பார்க்கவும்.

source: <h3 style="text-align:center">The Prince PDF Plugin (v. %(version)s)</h3> <p style="text-align:center"><i>Created by %(author)s</i></p> <hr/> <p style="margin:1em 0 0 0">This plugin will convert a book to PDF using Prince.</p> <p style="margin:0">Prince is an external program, you can download it from <a href="http://www.princexml.com/">www.princexml.com</a>.</p> <p style="margin:1em 0 0 0">Only a few formats can be converted with this plugin, mainly EPUB, AZW3 and HTMLZ. If you want to convert a book in another format, convert it first to one of these formats.</p> <p style="margin:1em 0 0 0">Before the actual conversion, you will be able to choose whether or not to add the resulting PDF to the book record. If the PDF is not added, it will be saved in disk, using the save-to-disk template.</p> <p style="margin:1em 0 0 0">The conversion will not use any other of the calibre conversion settings, but instead it will use a custom CSS file, where Prince-specific properties can be used. This file can be modified in the plugin configuration. In addition, the plugin will recognize and use any extra CSS file specified in the book itself, as a <span %(code)s>&lt;meta&gt;</span> tag with <span %(code)s>name="prince-style"</span> and <span %(code)s>content="<i>idref</i>"</span>, where <span %(code)s><i>idref</i></span> is the <span %(code)s>id</span> of the extra CSS file in the manifest.</p> <hr/> <p style="margin:1em 0 0 0"><i><img src="%(dir)s/prince_icon.png"/> Prince is copyrighted &copy; YesLogic Pty. Ltd.</i></p> <p style="margin:0"><img src="%(dir)s/small_icon.png"/> This plugin is released under %(license)s.</p>
ta: <h3 style = "உரை-சீரமை: மையம்"> பிரின்ச் PDF சொருகி (v. %(பதிப்பு) கள்) </h3> <p style = "உரை-சீரமை: மையம்"> <i> %(ஆசிரியர்) கள் உருவாக்கியது </i> </p> <hr/> <p style = "margin: 1em 0 0 0"> இந்த சொருகி ஒரு புத்தகத்தை பிரின்ச் பயன்படுத்தி PDF ஆக மாற்றும். </p> <p style = "margin: 0"> பிரின்ச் ஒரு வெளிப்புற நிரல், நீங்கள் இதை <a href="http://www.princexml.com/"> www.princexml.com </a> இலிருந்து பதிவிறக்கம் செய்யலாம் ப> <p style = "margin: 1em 0 0 0"> இந்த சொருகி மூலம் சில வடிவங்களை மட்டுமே மாற்ற முடியும், முக்கியமாக EPUB, AZW3 மற்றும் HTMLZ. நீங்கள் ஒரு புத்தகத்தை மற்றொரு வடிவத்தில் மாற்ற விரும்பினால், அதை முதலில் இந்த வடிவங்களில் ஒன்றிற்கு மாற்றவும். </P> <p style = "cragin: 1em 0 0 0"> உண்மையான மாற்றத்திற்கு முன், இதன் விளைவாக வரும் PDF ஐ புத்தக பதிவில் சேர்க்கலாமா வேண்டாமா என்பதை நீங்கள் தேர்வு செய்ய முடியும். PDF சேர்க்கப்படாவிட்டால், அது வட்டு-க்கு-வட்டு வார்ப்புருவைப் பயன்படுத்தி வட்டில் சேமிக்கப்படும். </P> <p style = "cragin: 1em 0 0 0"> மாற்றமானது காலிபர் மாற்று அமைப்புகளில் வேறு எந்த பயன்பாட்டையும் பயன்படுத்தாது, மாறாக இது தனிப்பயன் CSS கோப்பைப் பயன்படுத்தும், அங்கு இளவரசர்-குறிப்பிட்ட பண்புகளைப் பயன்படுத்தலாம். இந்த கோப்பை சொருகி உள்ளமைவில் மாற்றலாம். கூடுதலாக, சொருகி புத்தகத்தில் குறிப்பிடப்பட்டுள்ள கூடுதல் சிஎச்எச் கோப்பை ஒரு <span %(குறியீடு) s> & lt; மெட்டா & gt; </span> உடன் <span %(குறியீடு) s> பெயர் = " பிரின்ச்-பாணி "</span> மற்றும் <span %(குறியீடு) s> content =" <i> idref </i> "</span>, அங்கு <span %(குறியீடு) s> <i> idref </i > </span> என்பது மேனிஃபெச்டில் உள்ள கூடுதல் CSS கோப்பின் <span %(குறியீடு) s> id </span> ஆகும். </p> <hr/> <p style = "margin: 1em 0 0"> <i> <img src = "%(dir) s/prince_icon.png"/> இளவரசர் பதிப்புரிமை பெற்றவர் & நகல்; Yeslogic pty. Ltd. </I> </p> <p style = "cragin: 0"> <img src = " %(dir) s/small_icon.png"/> இந்த சொருகி %(உரிமம்) s இன் கீழ் வெளியிடப்படுகிறது. </p>

source: Prince log
ta: பிரின்ச் பதிவு

source: <qt>Console output from the last Prince run</qt>
ta: <qt> கடைசி பிரின்ச் ரன் </qt> இலிருந்து கன்சோல் வெளியீடு

source: <b>No books selected</b>
ta: <b> புத்தகங்கள் எதுவும் தேர்ந்தெடுக்கப்படவில்லை </b>

source: Select one single book
ta: ஒரு ஒற்றை புத்தகத்தைத் தேர்ந்தெடுக்கவும்

source: <b>Many books selected</b>
ta: <b> தேர்ந்தெடுக்கப்பட்ட பல புத்தகங்கள் </b>

source: <i>none</i>
ta: <i> எதுவுமில்லை </i>

source: Available formats: %s
ta: கிடைக்கும் வடிவங்கள்: %கள்

source: Ready
ta: ஆயத்தம்

source: No preferred format available
ta: விருப்பமான வடிவம் எதுவும் கிடைக்கவில்லை

source: About the Prince PDF Plugin
ta: பிரின்ச் பி.டி.எஃப் சொருகி பற்றி

source: Format not supported: %s
ta: வடிவம் ஆதரிக்கப்படவில்லை: %கள்

source: Cannot convert to PDF
ta: PDF க்கு மாற்ற முடியாது

source: PDF file: %s
ta: PDF கோப்பு: %s

source: Check the log.
ta: பதிவைச் சரிபார்க்கவும்.

source: The conversion failed.
ta: மாற்றம் தோல்வியடைந்தது.

source: Could not convert to PDF
ta: PDF க்கு மாற்ற முடியவில்லை

source: Error reading or writing the PDF file: %s
ta: PDF கோப்பைப் படிப்பது அல்லது எழுதுவது பிழை: %கள்

source: No supported format available
ta: உதவி வடிவம் எதுவும் கிடைக்கவில்லை

source: Unpacking book...
ta: திறக்கும் நூல் ...

source: Setting metadata...
ta: மெட்டாடேட்டாவை அமைத்தல் ...

source: Existing format
ta: தற்போதுள்ள வடிவம்

source: The selected book already contains a PDF format. Are you sure you want to replace it?
ta: தேர்ந்தெடுக்கப்பட்ட புத்தகத்தில் ஏற்கனவே ஒரு PDF வடிவம் உள்ளது. நீங்கள் அதை மாற்ற விரும்புகிறீர்களா?

source: The temporary file can be found in: %s
ta: தற்காலிக கோப்பை இங்கே காணலாம்: %கள்

source: Adding PDF...
ta: PDF ஐச் சேர்ப்பது ...

source: Choose destination directory
ta: இலக்கு கோப்பகத்தைத் தேர்வுசெய்க

source: Could not save PDF
ta: PDF ஐ சேமிக்க முடியவில்லை

source: Error writing the PDF file: %s
ta: PDF கோப்பை எழுதுவதில் பிழை: %கள்

source: File saved
ta: கோப்பு சேமிக்கப்பட்டது

source: PDF file saved in: %s
ta: PDF கோப்பு சேமிக்கப்பட்டது: %கள்

source: Convert to &PDF
ta: PDF ஆக மாற்றவும்

source: <qt>Start the conversion process</qt>
ta: <qt> மாற்று செயல்முறையைத் தொடங்கவும் </qt>

source: &View log
ta: & பதிவைக் காண்க

source: <qt>Display the log from the last Prince run</qt>
ta: <qt> கடைசி பிரின்ச் ரன் </qt> இலிருந்து பதிவைக் காண்பி

source: Con&figure
ta: கான் & படம்

source: <qt>Configure this plugin</qt>
ta: <qt> இந்த சொருகி </qt> ஐ உள்ளமைக்கவும்

source: Run the Prince PDF Plugin
ta: பிரின்ச் பி.டி.எஃப் சொருகி இயக்கவும்
