Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/calibre-plugins_ace_*.po
Languages: ta

source: Checks the accessibility of EPUB files with ACE.
ta: ace உடன் epub கோப்புகளின் அணுகலை சரிபார்க்கிறது.

source: Close Validation Docks
ta: மூடு சரிபார்ப்பு கப்பல்துறைகள்

source: When checked, ACE will attempt to close other validation docks.
ta: சரிபார்க்கும்போது, ace மற்ற சரிபார்ப்பு கப்பல்துறைகளை மூட முயற்சிக்கும்.

source: Split multiline &errors
ta: மல்டிலைன் மற்றும் பிழைகள் பிரிக்கவும்

source: When checked, ACE will split multiline error messages.
ta: சரிபார்க்கும்போது, ஏ.சி.இ மல்டிலைன் பிழை செய்திகளைப் பிரிக்கும்.

source: Update:
ta: புதுப்பிப்பு:

source: Auto &update
ta: ஆட்டோ புதுப்பிப்பு

source: When checked, the plugin will attempt to update local ACE installation.
ta: சரிபார்க்கும்போது, சொருகி உள்ளூர் ace நிறுவலைப் புதுப்பிக்க முயற்சிக்கும்.

source: &Check interval:
ta: இடைவெளியை சரிபார்க்கவும்:

source: Update check interval
ta: காசோலை இடைவெளியைப் புதுப்பிக்கவும்

source: Messages:
ta: செய்திகள்:

source: &Language:
ta: & மொழி:

source: Choose the language to show ACE and AXE messages. Some languages work for AXE, but not for ACE.
ta: ace மற்றும் ax செய்திகளைக் காட்ட மொழியைத் தேர்வுசெய்க. சில மொழிகள் கோடரியுக்கு வேலை செய்கின்றன, ஆனால் ஏச் அல்ல.

source: About
ta: பற்றி

source: This plugin is based on Doitsu's code for Sigil's ACE Plugin and EPUBCheck for calibre.
ta: இந்த சொருகி டூய்ட்சுவின் குறியீட்டை அடிப்படையாகக் கொண்டது sigil இன் ஏச் சொருகி மற்றும் காலிபருக்கான எபுப்செக்.

source: The Config Menu is based on KindleUnpack.
ta: கட்டமைப்பு பட்டியல் கின்ட்லூன்பேக்கை அடிப்படையாகக் கொண்டது.

source: Thanks to Kovid Goyal for adding the feature that made possible linked error messages.
ta: அம்சத்தைச் சேர்த்ததற்கு கோவிட் கோயாலுக்கு நன்றி இது இணைக்கப்பட்ட பிழை செய்திகளை உருவாக்கியது.

source: Select Directory to save Report to
ta: அறிக்கையைச் சேமிக்க கோப்பகத்தைத் தேர்ந்தெடுக்கவும்

source: <p>The path specified for the Report Folder does not exist.<br/>Your latest preference changes will <b>NOT</b> be saved!</p>
ta: <p> அறிக்கை கோப்புறையில் குறிப்பிடப்பட்ட பாதை இல்லை. <br/> உங்கள் அண்மைக் கால விருப்பத்தேர்வு மாற்றங்கள் <b> அல்ல </b> சேமிக்கப்படும்! </p>

source: Report Folder:
ta: கோப்புறையைப் புகாரளிக்கவும்:

source: Folder to save the report
ta: அறிக்கையைச் சேமிக்க கோப்புறை

source: Select Report Folder
ta: அறிக்கை கோப்புறையைத் தேர்ந்தெடுக்கவும்

source: Select the folder where the report will be saved.
ta: அறிக்கை சேமிக்கப்படும் கோப்புறையைத் தேர்ந்தெடுக்கவும்.

source: Options:
ta: விருப்பங்கள்:

source: Open Report after checking
ta: சரிபார்த்த பிறகு திறந்த அறிக்கையை திறக்கவும்

source: Check it to open the html report on you default browser.
ta: உங்கள் இயல்புநிலை உலாவி குறித்த html அறிக்கையைத் திறக்க இதைச் சரிபார்க்கவும்.

source: Debug Mode
ta: பிழைத்திருத்த முறை

source: When checked, ACE log will be saved to clipboard.
ta: சரிபார்க்கும்போது, ace பதிவு கிளிப்போர்டில் சேமிக்கப்படும்.

source: Running update check...
ta: புதுப்பிப்பு சோதனை இயக்குகிறது ...

source: Node.js is not installed.
ta: node.js நிறுவப்படவில்லை.

source: Install Node.js 10 or higher, then run: 'npm install @daisy/ace -g' on a cmd/terminal window.
ta: node.js 10 அல்லது அதற்கு மேற்பட்டவற்றை நிறுவவும், பின்னர் இயக்கவும்: 'npm நிறுவல் @daisy/ace -g' ஒரு cmd/முனைய சாளரத்தில்.

source: Updating ACE...
ta: புதுப்பித்தல் ஏச் ...

source: ACE was successfully updated to version %s.
ta: ace வெற்றிகரமாக பதிப்பு %s க்கு புதுப்பிக்கப்பட்டது.

source: Update failed.
ta: புதுப்பிப்பு தோல்வியடைந்தது.

source: No updates found.
ta: புதுப்பிப்புகள் எதுவும் கிடைக்கவில்லை.

source: Update check skipped: no internet.
ta: புதுப்பிப்பு காசோலை தவிர்க்கப்பட்டது: இணையம் இல்லை.

source: Configure ACE
ta: ace ஐ உள்ளமைக்கவும்

source: Run ACE
ta: ரன் ஏச்

source: Configure
ta: உள்ளமைக்கவும்

source: Configure ACE plugin
ta: ace சொருகி உள்ளமைக்கவும்

source: Before: ACE
ta: முன்: ஏச்

source: Empty Editor
ta: வெற்று ஆசிரியர்

source: You must first open a book!
ta: நீங்கள் முதலில் ஒரு புத்தகத்தைத் திறக்க வேண்டும்!

source: Unsupported file format
ta: ஆதரிக்கப்படாத கோப்பு வடிவம்

source: You can't check {} files with ACE.
ta: ace உடன் {} கோப்புகளை நீங்கள் சரிபார்க்க முடியாது.

source: Checking book...
ta: புத்தகத்தை சரிபார்க்கிறது ...

source: ACE is not installed.
ta: ace நிறுவப்படவில்லை.

source: Invalid EPUB or DRMed
ta: தவறான எபப் அல்லது டி.ஆர்

source: This file is either corrupted/invalid or DRMed
ta: இந்த கோப்பு சிதைந்த/செல்லாதது அல்லது டி.ஆர்

source: (you must use only one role)
ta: (நீங்கள் ஒரே ஒரு பாத்திரத்தை மட்டுமே பயன்படுத்த வேண்டும்)

source: Matching ARIA role:
ta: பொருந்தும் ஏரியா பங்கு:

source: ACE check is finished! Congratulations: no errors were found!
ta: ஏச் காசோலை முடிந்தது! வாழ்த்துக்கள்: பிழைகள் எதுவும் காணப்படவில்லை!

source: No browser found
ta: உலாவி எதுவும் கிடைக்கவில்லை

source: Could not find a browser to open the report. Click 'Show details' for more info.
ta: அறிக்கையைத் திறக்க உலாவியைக் கண்டுபிடிக்க முடியவில்லை. மேலும் தகவலுக்கு 'விவரங்களைக் காட்டு' என்பதைக் சொடுக்கு செய்க.

source: Error opening the report
ta: அறிக்கையைத் திறப்பதில் பிழை

source: Ace could not open the report. Click 'Show details' for more info.
ta: ஏச் அறிக்கையைத் திறக்க முடியவில்லை. மேலும் தகவலுக்கு 'விவரங்களைக் காட்டு' என்பதைக் சொடுக்கு செய்க.

source: File
ta: கோப்பு

source: Severity
ta: தீவிரம்

source: Error message
ta: பிழை செய்தி

source: Sort by Filename
ta: கோப்பு பெயர் மூலம் வரிசைப்படுத்துங்கள்

source: Sort by Severity
ta: தீவிரத்தினால் வரிசைப்படுத்துங்கள்

source: Sort by Error Message
ta: பிழை செய்தியால் வரிசைப்படுத்தவும்

source: Critical
ta: விமர்சன

source: Serious
ta: தீவிரமான

source: Moderate
ta: மிதமான

source: Minor
ta: சிறிய

source: Unhandled exception
ta: தடையற்ற விதிவிலக்கு

source: An unexpected error occurred. Click 'Show details' for more info.
ta: எதிர் பாராத பிழை ஏற்பட்டு விட்டது. மேலும் தகவலுக்கு 'விவரங்களைக் காட்டு' என்பதைக் சொடுக்கு செய்க.
