Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/data_openteacher.userDocumentation-*.po
Languages: ta

source: The screenshots are all taken in Ubuntu, but this should all work exactly the same in Windows and Mac OS X.
ta: ச்கிரீன் சாட்கள் அனைத்தும் உபுண்டுவில் எடுக்கப்பட்டுள்ளன, ஆனால் இவை அனைத்தும் சாளரங்கள் மற்றும் மேக் ஓஎச் ஃச் ஆகியவற்றில் ஒரே மாதிரியாக செயல்பட வேண்டும்.

source: Start OpenTeacher and click the 'Create words lesson' button to make a new word lesson.
ta: புதிய சொல் பாடத்தை உருவாக்க ஓபன் ஈசரைத் தொடங்கி 'சொற்களை உருவாக்கு' பொத்தானைக் சொடுக்கு செய்க.

source: Enter a title for the word list you are going to enter. Also enter the known language, which, in our case, is English, and the foreign language (the language you want to learn), which, in our case, is French.
ta: நீங்கள் நுழையப் போகும் சொல் பட்டியலுக்கு ஒரு தலைப்பை உள்ளிடவும். அறியப்பட்ட மொழியையும் உள்ளிடவும், இது எங்கள் விசயத்தில் ஆங்கிலம், மற்றும் வெளிநாட்டு மொழி (நீங்கள் கற்றுக்கொள்ள விரும்பும் மொழி), இது எங்கள் விசயத்தில் பிரெஞ்சு.

source: Using OpenTeacher 3: A Quick Start
ta: openteacher 3 ஐப் பயன்படுத்துதல்: விரைவான தொடக்க

source: Then enter all words you want to learn in the words table, you can go to the next question or answer column by pressing tab or '='. See the screenshot for an example.
ta: நீங்கள் கற்றுக்கொள்ள விரும்பும் எல்லா சொற்களையும் சொற்களின் அட்டவணையில் உள்ளிடவும், தாவலை அழுத்துவதன் மூலம் அடுத்த கேள்வி அல்லது பதில் நெடுவரிசைக்கு செல்லலாம் அல்லது '='. ஒரு எடுத்துக்காட்டுக்கு ச்கிரீன் சாட்டைப் பார்க்கவும்.

source: Click the 'Teach me!' tab on the bottom to start the test. You can now specify in what way you want OpenTeacher to question you, but the defaults will do in our case. So, we click the 'I'm ready, start the lesson!' button.
ta: 'எனக்குக் கற்றுக் கொடுங்கள்!' சோதனையைத் தொடங்க கீழே உள்ள தாவல். ஓபன்ச்சர் உங்களை கேள்வி கேட்க விரும்பும் வழியில் இப்போது நீங்கள் குறிப்பிடலாம், ஆனால் இயல்புநிலை எங்கள் விசயத்தில் செய்யும். எனவே, நாங்கள் 'நான் தயாராக இருக்கிறேன், பாடத்தைத் தொடங்குங்கள்!' பொத்தானை.

source: A word will now be asked to you in your own language, and you'll have to type the translation of it in the text field. When you have entered the translation, press Enter on your keyboard, or click 'Check!'
ta: ஒரு சொல் இப்போது உங்கள் சொந்த மொழியில் உங்களிடம் கேட்கப்படும், மேலும் அதன் மொழிபெயர்ப்பை உரை புலத்தில் தட்டச்சு செய்ய வேண்டும். நீங்கள் மொழிபெயர்ப்பில் நுழைந்ததும், உங்கள் விசைப்பலகையில் enter ஐ அழுத்தவும் அல்லது 'செக்!'

source: If you entered the right translation, the next question will be asked to you. If you did not enter the right translation, OpenTeacher will show you the correct answer, and the difference from your answer.
ta: நீங்கள் சரியான மொழிபெயர்ப்பில் நுழைந்தால், அடுத்த கேள்வி உங்களிடம் கேட்கப்படும். நீங்கள் சரியான மொழிபெயர்ப்பில் நுழையவில்லை என்றால், ஓபன்டீச்சர் சரியான பதிலையும், உங்கள் பதிலில் இருந்து வித்தியாசத்தையும் காண்பிப்பார்.

source: Once the test is completed, OpenTeacher will tell you if you did well by giving you a note.
ta: சோதனை முடிந்ததும், உங்களுக்கு ஒரு குறிப்பைக் கொடுப்பதன் மூலம் நீங்கள் சிறப்பாகச் செய்தால் ஓபன்டீச்சர் உங்களுக்குச் சொல்வார்.

source: This quick start guide shows you how to do a simple self-test using OpenTeacher. We're going to learn counting to ten in French today! For this example we are assuming that you already know English, and you want to learn French.
ta: இந்த விரைவான தொடக்க வழிகாட்டி ஓபன்டீச்சரைப் பயன்படுத்தி ஒரு எளிய தன்வய சோதனையை எவ்வாறு செய்வது என்பதைக் காட்டுகிறது. நாங்கள் இன்று பிரெஞ்சு மொழியில் பத்துக்கு எண்ணுவதைக் கற்றுக்கொள்ளப் போகிறோம்! இந்த எடுத்துக்காட்டுக்கு நீங்கள் ஏற்கனவே ஆங்கிலம் அறிந்திருக்கிறீர்கள் என்று நாங்கள் கருதுகிறோம், நீங்கள் பிரஞ்சு மொழியைக் கற்க விரும்புகிறீர்கள்.
