Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/kdiff3.po
Languages: ta

source: Visible name replacement for input file 2.
ta: உள்ளீட்டு கோப்பு 2 க்கான புலப்படும் பெயர் மாற்றீடு.

source: Visible name replacement for input file 3.
ta: உள்ளீட்டு கோப்பு 3 க்கான புலப்படும் பெயர் மாற்றீடு.

source: Alternative visible name replacement. Supply this once for every input.
ta: மாற்று புலப்படும் பெயர் மாற்றீடு. ஒவ்வொரு உள்ளீட்டிற்கும் ஒரு முறை இதை வழங்கவும்.

source: Override a config setting. Use once for every setting. E.g.: --cs "AutoAdvance=1"
ta: ஒரு கட்டமைப்பு அமைப்பை மீறவும். ஒவ்வொரு அமைப்பிற்கும் ஒரு முறை பயன்படுத்தவும். எ.கா.: - -சிஎச் "ஆட்டோட்வென்ச் = 1"

source: Show list of config settings and current values.
ta: கட்டமைப்பு அமைப்புகள் மற்றும் தற்போதைய மதிப்புகளின் பட்டியலைக் காட்டு.

source: Use a different config file.
ta: வேறு விதமான கோப்புகளின் எண்ணிக்கை:

source: file1 to open (base, if not specified via --base)
ta: கோப்பு1 யை திற(அடித்தளம் அல்லது via அடித்தளம்)

source: file2 to open
ta: கோப்பு2 திற

source: file3 to open
ta: கோப்பு 3ன்றை திற

source: See kdiff3 --help for supported options.
ta: ஆதரிக்கப்பட்ட விருப்பங்களுக்கு kdiff3 -உதவி பார்க்கவும்.

source: Unable to compare non-normal file with normal file.
ta: சாதாரண அல்லாத கோப்பை சாதாரண கோப்புடன் ஒப்பிட முடியவில்லை.

source: Mix of links and normal files.
ta: இணைப்புகள் மற்றும் கோப்புகள் கலந்து உள்ளன.

source: Link:
ta: இணைப்பு.

source: Size.
ta: அளவு.

source: Date & Size:
ta: தேதி மற்றும் அளவு.

# Status message
source: Comparing file...
ta: கோப்பினை ஒப்பிடுகிறது....

source: Choose A Everywhere
ta: எல்லா இடத்திலும் aவைத் தேர்ந்தெடு

source: Choose B Everywhere
ta: எல்லா இடத்திலும் bவைத் தேர்ந்தெடு

source: Choose C Everywhere
ta: எல்லா இடத்திலும் cவைத் தேர்ந்தெடு

source: Choose A for All Unsolved Conflicts
ta: அனைத்து தீர்வற்ற முரணிற்கு a-வை தேர்ந்தெடுக்கவும்

source: Choose B for All Unsolved Conflicts
ta: அனைத்து தீர்வற்ற முரணிற்கு b-யை தேர்ந்தெடுக்கவும்

source: Choose C for All Unsolved Conflicts
ta: அனைத்து தீர்வற்ற முரணிற்கு c-யை தேர்ந்தெடுக்கவும்

source: Choose A for All Unsolved Whitespace Conflicts
ta: அனைத்து தீர்வற்ற வெள்ளை இடம் முரணிற்கு a-வை தேர்ந்தெடுக்கவும்

source: Choose B for All Unsolved Whitespace Conflicts
ta: அனைத்து தீர்வற்ற வெள்ளை இடம் முரணிற்கு b-யை தேர்ந்தெடுக்கவும்

source: Choose C for All Unsolved Whitespace Conflicts
ta: அனைத்து தீர்வற்ற வெள்ளை இடம் முரணிற்கு c-யை தேர்ந்தெடுக்கவும்

source: Number of remaining unsolved conflicts: %1 (of which %2 are whitespace)
ta: இன்னும் தீர்க்கப்படாத குழப்பங்களின் எண்ணிகை: %1

source: The output has been modified. If you continue your changes will be lost.
ta: வெளீயிடு மாற்றப்பட்டுள்ளது. நீங்கள் தொடர்ந்தால் மாற்றங்களை இழந்து விடுவீர்கள்

source: All input files are binary equal.
ta: அனைத்து உள்ளிடு கோப்புகளும் இருநிலை சமம்

source: All input files contain the same text.
ta: அனைத்து உள்ளீட்டுக் கோப்புகளும் ஒரே உரையைக் கொண்டன.

source: Files %1 and %2 are binary equal.
ta: கோப்புகள் b மற்றும் c இருநிலை சமம் உடையன.

source: Files %1 and %2 have equal text.
ta: கோப்புகள் a மற்றும் b சம உரை உடையன.

source: Total number of conflicts: %1 Number of automatically solved conflicts: %2 Number of unsolved conflicts: %3 %4
ta: மொத்த மோதல்களின் எண்ணிக்கை: %1 தானாக தீர்க்கப்பட்ட மோதல்களின் எண்ணிக்கை: %2 தீர்க்கப்படாத மோதல்களின் எண்ணிக்கை: %3 %4

source: Conflicts
ta: குழப்பங்கள்

source: <No src line>
ta: <src வரி இல்லை>

source: <Merge Conflict (Whitespace only)>
ta: <ஒன்றுசேர் குழப்பம்>

source: <Merge Conflict>
ta: <ஒன்றுசேர் குழப்பம்>

source: Not all conflicts are solved yet. File not saved.
ta: அனைத்து குழப்பங்களும் இன்னும் தீரவில்லை. கோப்பினை சேமிக்கவில்லை

# Dialog title
source: Conflicts Left
ta: குழப்பமான இடது

source: There is a line end style conflict. Please choose the line end style manually. File not saved.
ta: ஒரு வரி இறுதி பாணி மோதல் உள்ளது. லைன் எண்ட் பாணியை கைமுறையாக தேர்வு செய்யவும். கோப்பு சேமிக்கப்படவில்லை.

source: Creating backup failed. File not saved.
ta: காப்புப்பிரதியை உருவாக்குவது தோல்வியடைந்தது. கோப்பு சேமிக்கப்படவில்லை.

source: File Save Error
ta: கோப்பின சேமிப்பு பிழை

source: Error while writing.
ta: எழுதும் பொழுது பிழை

source: Output:
ta: வெளியீடு

source: [Modified]
ta: [திருத்தப்பட்டது]

source: Encoding for saving:
ta: சேமிப்பதற்கான குறியாக்கம்:

source: Conflict
ta: குழப்பங்கள்

source: Codec from A: %1
ta: a இலிருந்து கோடெக்: %1

source: Codec from B: %1
ta: b இலிருந்து கோடெக்: %1

source: Codec from C: %1
ta: c இலிருந்து கோடெக்: %1

source: Dialog
ta: உரையாடல்

source: A (Base):
ta: a (அடிப்படை)

source: Output (Optional):
ta: வெளீயிடு (விருப்பங்கள்)

source: File...
ta: கோப்பு

source: Swap/Copy Names...
ta: இடமாற்று/நகல் பெயர்கள் ...

source: C (Optional):
ta: c (விருப்பங்கள்)

source: Folder...
ta: திறந்த கோப்புகள்

# No text styling
source: none
ta: எதுவுமில்லை

# Font sample display, %1 = family, %2 = style, %3 = size
source: Font: %1, %2, %3 Example:
ta: எழுத்துரு: %1, %2, %3 உதாரணமாக:

source: Unicode
ta: ஒருங்குறி

source: Latin1
ta: லத்தீன் 1

# Tool Tip
source: Change this if non-ASCII characters are not displayed correctly.
ta: இல்லா-ஆச்கி-எழுத்துக்கள் சரியாக வெளிகாட்டவில்லை என்றால் இதை மாற்றுக

source: Configure
ta: அமை

source: Font
ta: எழுத்துரு

source: Editor & Diff Output Font
ta: திருத்துபவரும் வித்தியாசமான வெளியீட்டு எழுத்துக்களும்

source: Application font
ta: பயன்பாட்டு எழுத்துரு

source: File view font
ta: கோப்பின சேமிப்பு பிழை

# Title for color settings page
source: Color
ta: நிறம்

source: Colors Settings
ta: இதர அமைப்புகளை உள்ளடக்கியது

source: Editor and Diff Views:
ta: ஆசிரியர் மற்றும் வேறுபட்ட காட்சிகள்:

source: Foreground color:
ta: முன்னணி நிறம்

source: Background color:
ta: பின்னணி நிறம்

source: Diff background color:
ta: வேறுபட்ட பின்னணி நிறம்

source: Color A:
ta: நிறம் a:

source: Color B:
ta: நிறம் b:

source: Color C:
ta: நிறம் c:

source: Conflict color:
ta: குழப்பமான நிறம்

source: Current range background color:
ta: பின்னணி நிறத்தின் தற்போதைய வரம்பு

source: Current range diff background color:
ta: பின்னணி நிறத்தின் வேறுபட்ட தற்போதைய வரம்பு

source: Color for manually aligned difference ranges:
ta: கைமுறையாக சீரமைக்கப்பட்ட வேறுபாடு வரம்புகளுக்கான நிறம்:

source: Folder Comparison View:
ta: அடைவு ஒப்பிடும் நிலை

source: Newest file color:
ta: புதிய கோப்பு நிறம்:

source: Changing this color will only be effective when starting the next folder comparison.
ta: அடுத்த கோப்புறை ஒப்பீட்டைத் தொடங்கும்போது மட்டுமே இந்த நிறத்தை மாற்றுவது பயனுள்ளதாக இருக்கும்.

source: Oldest file color:
ta: பழமையான கோப்பு நிறம்:

source: Middle age file color:
ta: நடுத்தர அகவை கோப்பு நிறம்:

source: Color for missing files:
ta: காணாமல் போன கோப்புகளுக்கான நிறம்:

source: Editor
ta: திருத்தியவர்

source: Editor Behavior
ta: திருத்துபவரின் செயல்பாடு

source: Tab inserts spaces
ta: தத்தல் இடைவெளியை சொருகும்

# Tool Tip
source: On: Pressing tab generates the appropriate number of spaces. Off: A tab character will be inserted.
ta: on:தத்தலை அழுத்தும் போது தேவையான இடைவெளி உருவாகிறது, off:ஒர் தத்தல் எழுத்து சொருகப்படும்

source: Tab size:
ta: tab அளவு

source: Auto indentation
ta: தானியக்க உள்ளடக்கம்

# Tool Tip
source: On: The indentation of the previous line is used for a new line.
ta: முந்தைய வரியில் பயன்படுத்தப்பட்ட நகர்ப்பு புதிய வரியிலும் பயன்படுத்தப்படுகிறது

source: Auto copy selection
ta: தானாகவே தேர்ந்தெடுக்கப்பட்ட படிவு

# Tool Tip
source: On: Any selection is immediately written to the clipboard. Off: You must explicitly copy e.g. via Ctrl-C.
ta: எந்த ஒரு தேர்வையும் உடனடியாக கிளிப் போர்டுக்கு எழுதவும். நீங்கள் வெளிப்படையாக படிவு வெற்றி

# Unix line ending
source: Unix
ta: யூனிக்ச்

# Dos/Windows line ending
source: Dos/Windows
ta: சாளரங்கள்

# Automatically detected line ending
source: Autodetect
ta: தானாகவே தேர்ந்தெடுக்கப்பட்ட படிவு

# Tool Tip
source: Sets the line endings for when an edited file is saved. DOS/Windows: CR+LF; UNIX: LF; with CR=0D, LF=0A
ta: கோட்டின் முடிவை அமைத்து தொகுப்புக்கோப்பில் சேமிdos/விண்டோச்: cr+lf;யுனிக்ச்:மற்றும் cr=0d, lf=0a

source: Diff
ta: kdiff3

source: Diff Settings
ta: வேறுபாடு & சேர்த்திடு அமைப்புகள்

source: Ignore numbers (treat as white space)
ta: c/c++ குறிப்புரைகளை வெள்ளை இடம் போல உபசரி.

# Tool Tip
source: Ignore number characters during line matching phase. (Similar to Ignore white space.) Might help to compare files with numeric data.
ta: வரி பொருத்துதலின் போது எண் எழுத்துக்களை நிராகரி.

source: Ignore C/C++ comments (treat as white space)
ta: c/c++ குறிப்புரைகளை வெள்ளை இடம் போல உபசரி.

# Tool Tip
source: Treat C/C++ comments like white space.
ta: c/c++ குறிப்புரைகளை வெள்ளை இடம் போல உபசரி.

source: Ignore case (treat as white space)
ta: c/c++ குறிப்புரைகளை வெள்ளை இடம் போல உபசரி.

# Tool Tip
source: Treat case differences like white space changes. ('a'<=>'A')
ta: வெள்ளை இட மாற்றங்கள் போன்ற வழக்கு வேறுபாடுகளை நடத்துங்கள். ('a' <=> 'a')

source: Preprocessor command:
ta: முன் செயலாக்க கட்டளை

# Tool Tip
source: User defined pre-processing. (See the docs for details.)
ta: உபயோகிப்பாளரால் அறுதியிடப்பட்ட முன்-செயலாக்கி

source: Line-matching preprocessor command:
ta: வரி-பொருத்து முன்-செயலாக்கி கட்டளை

# Tool Tip
source: This pre-processor is only used during line matching. (See the docs for details.)
ta: முன்-செயலாக்கி வரி-பொருத்துதலின் போது பயன்ப்படுத்தப்படுகிறது

source: Try hard (slower)
ta: கடினமாக முயற்சி(மெதுவாக)

# Tool Tip
source: Enables the --minimal option for the external diff. The analysis of big files will be much slower.
ta: வெளி வேற்றுமைக்கான --குறைந்த விருப்பத்தை செயல்படுத்துகிறது. பெரிய கோப்புகளின் பகுப்பாய்வு மெதுவாக இருக்கும்.

source: Align B and C for 3 input files
ta: 3 உள்ளீட்டு கோப்புகளுக்கு b மற்றும் c ஐ சீரமைக்கவும்

# Tool Tip
source: Try to align B and C when comparing or merging three input files. Not recommended for merging because merge might get more complicated. (Default is off.)
ta: மூன்று உள்ளீட்டு கோப்புகளை ஒப்பிடும்போது அல்லது ஒன்றிணைக்கும் போது b மற்றும் c ஐ சீரமைக்க முயற்சிக்கவும். ஒன்றிணைப்பதற்கு பரிந்துரைக்கப்படவில்லை, ஏனெனில் ஒன்றிணைப்பு மிகவும் சிக்கலானதாக இருக்கும். (இயல்புநிலை முடக்கப்பட்டுள்ளது.)

# Settings page
source: Merge
ta: ஒன்றாகச் சேர்.

source: Merge Settings
ta: வேறுபாடு & சேர்த்திடு அமைப்புகள்

source: Auto advance delay (ms):
ta: தானாக முன்னேறிய நேரந்தவறுகை (ms):

# Tool Tip
source: When in Auto-Advance mode the result of the current selection is shown for the specified time, before jumping to the next conflict. Range: 0-2000 ms
ta: தற்போதைய தேர்ந்தெடுப்பின் முடிவை தானாக - முன்னேறும் அமைப்பில். குறிப்பிட்ட கால இடைவெளியில், அடுத்த சிக்கலுக்கு முன் தெரிந்துகொள்ளலாம்.

source: Show info dialogs
ta: a சாளரத்தைக் காட்டு

# Tool Tip
source: Show a dialog with information about the number of conflicts.
ta: மோதல்களின் எண்ணிக்கையைப் பற்றிய தகவலுடன் ஒரு உரையாடலைக் காட்டு.

source: White space 2-file merge default:
ta: வெள்ளை இடம் 2-கோப்பு ஒன்றிணை முன்னிருப்பு:

source: Manual Choice
ta: கையேடு விருப்பம்

# Tool Tip
source: Allow the merge algorithm to automatically select an input for white-space-only changes.
ta: வெள்ளை-இடம்-மாற்றங்களுக்காக தானாக தேர்ந்தெடுக்கும் உள்ளீட்டிற்க்கு ஒன்றிணை படிமுறையை அனுமதிக்கும்.

source: White space 3-file merge default:
ta: வெள்ளை இடம் 3-கோப்பு ஒன்றிணை முன்னிருப்பு:

source: Automatic Merge Regular Expression
ta: தானியங்கி வழக்கமான வெளிப்பாட்டை ஒன்றிணைக்கவும்

source: Auto merge regular expression:
ta: தானாக ஒன்றிணைத்தல் வழக்கமான வெளிப்பாடு:

source: Run regular expression auto merge on merge start
ta: ஒன்றிணைப்பு தொடக்கத்தில் வழக்கமான வெளிப்பாடு ஆட்டோ ஒன்றிணைப்பு இயக்கவும்

# Tool Tip
source: Run the merge for auto merge regular expressions immediately when a merge starts.
ta: ஆட்டோ ஒன்றிணைக்கும் வழக்கமான வெளிப்பாடுகளுக்கான ஒன்றிணையை இயக்கவும் ஒரு இணைப்பு தொடங்கும் போது உடனடியாக.

source: Version Control History Merging
ta: பதிப்பு கட்டுப்பாட்டு வரலாறு ஒன்றிணைத்தல்

source: History start regular expression:
ta: வரலாறு வழக்கமான வெளிப்பாட்டைத் தொடங்குகிறது:

source: History entry start regular expression:
ta: வரலாற்று நுழைவு வழக்கமான வெளிப்பாட்டைத் தொடங்குகிறது:

source: History merge sorting
ta: வரலாறு வரிசையாக்கத்தை ஒன்றிணைக்கிறது

# Tool Tip
source: Sort version control history by a key.
ta: பதிப்பு கட்டுப்பாட்டு வரலாற்றை ஒரு விசையால் வரிசைப்படுத்தவும்.

source: History entry start sort key order:
ta: வரலாறு நுழைவு தொடக்கம் முக்கிய வரிசையை வரிசைப்படுத்துங்கள்:

source: Merge version control history on merge start
ta: ஒன்றிணைப்பு தொடக்கத்தில் பதிப்பு கட்டுப்பாட்டு வரலாற்றை ஒன்றிணைக்கவும்

# Tool Tip
source: Run version control history auto-merge on merge start.
ta: ஒன்றிணைப்பு தொடக்கத்தில் பதிப்பு கட்டுப்பாட்டு வரலாறு ஆட்டோ-மெர்ச் இயக்கவும்.

source: Max number of history entries:
ta: உப அடைவுகளின் எண்ணிக்கை:

# Tool Tip
source: Cut off after specified number. Use -1 for infinite number of entries.
ta: குறிப்பிட்ட எண்ணுக்குப் பிறகு துண்டிக்கவும். எண்ணற்ற உள்ளீடுகளுக்கு -1 ஐப் பயன்படுத்தவும்.

source: Test your regular expressions
ta: உங்கள் வழக்கமான வெளிப்பாடுகளை சோதிக்கவும்

source: Irrelevant merge command:
ta: பொருத்தமற்ற ஒன்றிணைப்பு கட்டளை:

# Tool Tip
source: If specified this script is run after auto-merge when no other relevant changes were detected. Called with the parameters: filename1 filename2 filename3
ta: குறிப்பிடப்பட்டால், இந்த ச்கிரிப்ட் தானாக இயந்திரத்திற்குப் பிறகு இயக்கப்படும் வேறு எந்த மாற்றங்களும் கண்டறியப்படாதபோது. அளவுருக்களுடன் அழைக்கப்படுகிறது: filename1 filename2 filename3

source: Auto save and quit on merge without conflicts
ta: ஆட்டோ சேமித்து மோதல்கள் இல்லாமல் ஒன்றிணைக்கவும்

# Tool Tip
source: If KDiff3 was started for a file-merge from the command line and all conflicts are solvable without user interaction then automatically save and quit. (Similar to command line option "--auto".)
ta: கட்டளை வரியிலிருந்து ஒரு கோப்பு-இயந்திரத்திற்காக kdiff3 தொடங்கப்பட்டால் பயனர் தொடர்பு இல்லாமல் மோதல்கள் தீர்க்கக்கூடியவை, பின்னர் தானாகவே சேமித்து வெளியேறுகின்றன. (கட்டளை வரி விருப்பத்தைப் போன்றது "--auto".)

# Tab title label
source: Folder
ta: திறந்த கோப்புகள்

source: Recursive folders
ta: திரும்ப நிகழும் அடைவுகள்

# Tool Tip
source: Whether to analyze subfolders or not.
ta: உபஅடைவுகளை பரிசோதிக்க வேண்டுமா?

source: File pattern(s):
ta: கோப்பு வடிவங்கள்:

# Tool Tip
source: Pattern(s) of files to be analyzed. Wildcards: '*' and '?' Several Patterns can be specified by using the separator: ';'
ta: பரிசோதனையிலிருந்து வெளியேற்றப்பட வேண்டிய கோப்புகளின் வடிவங்கள்.wildcards ';' உபயோகித்து பல்வேறு வடிவங்களை குறிப்பிடலாம்

source: File-anti-pattern(s):
ta: வடிவற்ற கோப்பு

# Tool Tip
source: Pattern(s) of files to be excluded from analysis. Wildcards: '*' and '?' Several Patterns can be specified by using the separator: ';'
ta: பரிசோதனையிலிருந்து வெளியேற்றப்பட வேண்டிய கோப்புகளின் வடிவங்கள்.wildcards ';' உபயோகித்து பல்வேறு வடிவங்களை குறிப்பிடலாம்

source: Folder-anti-pattern(s):
ta: வடிவற்ற கோப்பு

# Tool Tip
source: Pattern(s) of folders to be excluded from analysis. Wildcards: '*' and '?' Several Patterns can be specified by using the separator: ';'
ta: பரிசோதனையிலிருந்து வெளியேற்றப்பட வேண்டிய கோப்புகளின் வடிவங்கள்.wildcards ';' உபயோகித்து பல்வேறு வடிவங்களை குறிப்பிடலாம்

source: Use Ignore File
ta: .cvsignore உபயோகி

# Tool Tip
source: Extends the anti-pattern to anything that would be ignored by source control. Via local ignore files this can be folder-specific.
ta: extends the antipattern to anything that would be ignored by cvs. via local ".cvsignore"-files this can be directory specific.

source: Find hidden files and folders
ta: மறைந்த கோப்புகளையும் அடைவுகளையும் தேடு

# Tool Tip
source: Finds hidden files and folders.
ta: மறைந்த கோப்புகளையும் அடைவுகளையும் தேடு

source: Follow file links
ta: கோப்பு இணைப்பை பின்பற்று

# Tool Tip
source: On: Compare the file the link points to. Off: Compare the links.
ta: கோப்பினை இணைப்பு குறியோடு ஒப்பிடு. இணைப்பை ஒப்பிடு

source: Follow folder links
ta: கோப்பு இணைப்பை பின்பற்று

# Tool Tip
source: On: Compare the folder the link points to. Off: Compare the links.
ta: கோப்பினை இணைப்பு குறியோடு ஒப்பிடு. இணைப்பை ஒப்பிடு

source: Case sensitive filename comparison
ta: வழக்கு உணர்திறன் கோப்பு பெயர் ஒப்பீடு

# Tool Tip
source: The folder comparison will compare files or folders when their names match. Set this option if the case of the names must match. (Default for Windows is off, otherwise on.)
ta: கோப்புறை ஒப்பீடு கோப்புகள் அல்லது கோப்புறைகள் அவற்றின் பெயர்கள் பொருந்தும்போது ஒப்பிடும். பெயர்களின் வழக்கு பொருந்த வேண்டும் என்றால் இந்த விருப்பத்தை அமைக்கவும். (விண்டோசின் இயல்புநிலை முடக்கப்பட்டுள்ளது, இல்லையெனில்.)

source: Unfold all subfolders on load
ta: அனைத்து உபஅடைவுகளையும் பிரி

# Tool Tip
source: On: Unfold all subfolders when starting a folder diff. Off: Leave subfolders folded.
ta: ஆன்: ஒரு கோப்புறை வேறுபாட்டைத் தொடங்கும்போது அனைத்து துணை கோப்புறைகளையும் அவிழ்த்து விடுங்கள். ஆஃப்: துணை கோப்புறைகளை மடிந்து விடுங்கள்.

source: Skip folder status report
ta: கோப்புறை நிலை அறிக்கையைத் தவிர்க்கவும்

# Tool Tip
source: On: Do not show the Folder Comparison Status. Off: Show the status dialog on start.
ta: on: கோப்புறை ஒப்பீட்டு நிலையை காட்ட வேண்டாம். முடக்கு: தொடக்கத்தில் நிலை உரையாடலைக் காட்டு.

source: File Comparison Mode
ta: கோப்பு ஒப்பீட்டு முறை

# Tool Tip
source: Binary comparison of each file. (Default)
ta: ஒவ்வொரு கோப்பின் பைனரி ஒப்பீடு. (இயல்புநிலை)

# Tool Tip
source: Do a full analysis and show statistics information in extra columns. (Slower than a binary comparison, much slower for binary files.)
ta: ஒரு முழு பகுப்பாய்வு செய்து கூடுதல் நெடுவரிசைகளில் புள்ளிவிவர தகவல்களைக் காட்டுங்கள். (பைனரி ஒப்பீட்டை விட மெதுவாக, பைனரி கோப்புகளுக்கு மிகவும் மெதுவாக உள்ளது.)

source: Trust the size and modification date (unsafe)
ta: மாற்றிய தேதியை நம்பு(பாதுகாப்பில்லை)

# Tool Tip
source: Assume that files are equal if the modification date and file length are equal. Files with equal contents but different modification dates will appear as different. Useful for big folders or slow networks.
ta: மாற்றிய தேதியும் கோப்பு நீளமும் சமமாக இருந்தால் எல்லா கோப்புகளும் சமம் என எண்ணலாம். இது பெரிய அடைவுகளுக்கு அல்லது மெதுவான இணைப்புகளுக்கு உதவும்

source: Trust the size and date, but use binary comparison if date does not match (unsafe)
ta: மாற்றிய தேதியை நம்பு(பாதுகாப்பில்லை)

# Tool Tip
source: Assume that files are equal if the modification date and file length are equal. If the dates are not equal but the sizes are, use binary comparison. Useful for big folders or slow networks.
ta: மாற்றிய தேதியும் கோப்பு நீளமும் சமமாக இருந்தால் எல்லா கோப்புகளும் சமம் என எண்ணலாம். இது பெரிய அடைவுகளுக்கு அல்லது மெதுவான இணைப்புகளுக்கு உதவும்

source: Trust the size (unsafe)
ta: அளவை உறுதிபடுத்து(பாதுகாப்பில்லை)

# Tool Tip
source: Assume that files are equal if their file lengths are equal. Useful for big folders or slow networks when the date is modified during download.
ta: மாற்றிய தேதியும் கோப்பு நீளமும் சமமாக இருந்தால் எல்லா கோப்புகளும் சமம் என எண்ணலாம். இது பெரிய அடைவுகளுக்கு அல்லது மெதுவான இணைப்புகளுக்கு உதவும்.

source: Synchronize folders
ta: ஒத்தியக்கு அடைவை

# Tool Tip
source: Offers to store files in both folders so that both folders are the same afterwards. Works only when comparing two folders without specifying a destination.
ta: இரண்டு அடைவிலும் கோப்புகளை சேமிப்பதற்கு அனுமதிப்பதால், இரண்டு அடைவுகளும் பின்னர் ஒன்றாகவே இருக்கும் .இரண்டு அடைவுகளையும் சேருமிடம் குறிப்பிடாமல் ஒத்திடும் பொழுதுதான் வேலை செய்யும்.

source: White space differences considered equal
ta: வெள்ளை இடம் 3-கோப்பு ஒன்றிணை முன்னிருப்பு:

# Tool Tip
source: If files differ only by white space consider them equal. This is only active when full analysis is chosen.
ta: கோப்புகள் வெள்ளை இடத்தால் மட்டுமே வேறுபட்டால் அவற்றை சமமாகக் கருதுங்கள். முழு பகுப்பாய்வு தேர்ந்தெடுக்கப்படும்போது மட்டுமே இது செயலில் உள்ளது.

source: Copy newer instead of merging (unsafe)
ta: ஒன்றாக சேர்ப்பதற்கு பதிலாக புதியவரை பதியெடு(பாதுகாப்பில்லை)

# Tool Tip
source: Do not look inside, just take the newer file. (Use this only if you know what you are doing!) Only effective when comparing two folders.
ta: உள்ளே பார்க்காதே புதிய கோப்பினை மட்டும் எடு.(நீ செய்வது என்ன என்று தெரிந்தால் மட்டுமே இதை உபயோகப்படுத்து) இரண்டு அடைவுகளை ஒத்திடும் போது மட்டுமே விளைவுகள் ஏற்படும்

source: Backup files (.orig)
ta: பின்சேமிப்பு கோப்புகள்(.orig)

# Tool Tip
source: If a file would be saved over an old file, then the old file will be renamed with a '.orig' extension instead of being deleted.
ta: பழைய கோப்பில் ஒரு கோப்பினை சேமிக்கும் பொழுது, பழைய கோப்பில் மூல நீட்டுதலுடன் பெயர் மாறும், நீக்கபடுவதற்கு பதிலாக.

source: Regional Settings
ta: இதர அமைப்புகளை உள்ளடக்கியது

source: Use the same encoding for everything:
ta: எல்லாவற்றிற்கும் ஒரே குறியாக்கத்தைப் பயன்படுத்தவும்:

# Tool Tip
source: Enable this allows to change all encodings by changing the first only. Disable this if different individual settings are needed.
ta: இதை இயக்குவது முதல் மாற்றத்தை மாற்றுவதன் மூலம் அனைத்து குறியாக்கங்களையும் மாற்ற அனுமதிக்கிறது. வெவ்வேறு தனிப்பட்ட அமைப்புகள் தேவைப்பட்டால் இதை முடக்கு.

source: Note: Local Encoding is "%1"
ta: லொகல் குறிமுறையாக்கம் உபயோகி

source: File Encoding for A:
ta: ஒரு கோப்பு குறியாக்கம் ஒரு:

source: If enabled then encoding will be automaticly detected. If the file's encoding can not be found automaticly then the selected encoding will be used as fallback. (Unicode detection depends on the first bytes of a file.)
ta: இயக்கப்பட்டிருந்தால், குறியாக்கம் தானாகவே கண்டறியப்படும். கோப்பின் குறியாக்கத்தை தானாகவே காண முடியாவிட்டால், தேர்ந்தெடுக்கப்பட்ட குறியாக்கம் குறைவடையும். (யூனிகோட் கண்டறிதல் ஒரு கோப்பின் முதல் பைட்டுகளைப் பொறுத்தது.)

source: Auto Detect
ta: தானாகவே தேர்ந்தெடுக்கப்பட்ட படிவு

source: File Encoding for B:
ta: b க்கான கோப்பு குறியாக்கம்:

source: File Encoding for C:
ta: c க்கான கோப்பு குறியாக்கம்:

source: File Encoding for Merge Output and Saving:
ta: ஒன்றிணைக்கும் வெளியீடு மற்றும் சேமிப்புக்கான கோப்பு குறியாக்கம்:

source: Auto Select
ta: தானாகவே தேர்ந்தெடுக்கப்பட்ட படிவு

# Tool Tip
source: If enabled then the encoding from the input files is used. In ambiguous cases a dialog will ask the user to choose the encoding for saving.
ta: இயக்கப்பட்டிருந்தால், உள்ளீட்டு கோப்புகளிலிருந்து குறியாக்கம் பயன்படுத்தப்படுகிறது. தெளிவற்ற நிகழ்வுகளில், சேமிப்பதற்கான குறியாக்கத்தைத் தேர்வுசெய்ய ஒரு உரையாடல் பயனரைக் கேட்கும்.

source: File Encoding for Preprocessor Files:
ta: முன் செயலாக்க கோப்புகளுக்கான கோப்பு குறியாக்கம்:

source: Right To Left Language
ta: இடது மொழிக்கு வலமிருந்து

# Tool Tip
source: Some languages are read from right to left. This setting will change the viewer and editor accordingly.
ta: சில மொழிகள் வலமிருந்து இடமாக வாசிக்கப்படுகின்றன. இந்த அமைப்பு அதற்கேற்ப பார்வையாளர் மற்றும் ஆசிரியரை மாற்றும்.

source: Integration
ta: இயக்கம்.

source: Integration Settings
ta: இதர அமைப்புகளை உள்ளடக்கியது

source: Command line options to ignore:
ta: புறக்கணிக்க கட்டளை வரி விருப்பங்கள்:

# Tool Tip
source: List of command line options that should be ignored when KDiff3 is used by other tools. Several values can be specified if separated via ';' This will suppress the "Unknown option" error.
ta: kdiff3 மற்ற கருவிகளால் பயன்படுத்தப்படும்போது புறக்கணிக்கப்பட வேண்டிய கட்டளை வரி விருப்பங்களின் பட்டியல். ';' வழியாக பிரிக்கப்பட்டால் பல மதிப்புகளைக் குறிப்பிடலாம்; இது "அறியப்படாத விருப்பம்" பிழையை அடக்கும்.

source: Quit also via Escape key
ta: எச்கேப் கீ வழியாகவும் வெளியேறவும்

# Tool Tip
source: Fast method to exit. For those who are used to using the Escape key.
ta: வெளியேற விரைவான முறை. தப்பிக்கும் விசையைப் பயன்படுத்தப் பழகியவர்களுக்கு.

source: This resets all options. Not only those of the current topic.
ta: இது அனைத்து தேர்வுகளையும் மாற்றியமைக்கும். தற்பொழுதுள்ள தலைப்பு மட்டுமல்ல

source: PreprocessorCmd:
ta: முன் செயலாக்க கட்டளை:

source: The following option(s) you selected might change data:
ta: கீழ்கண்ட தேர்வுகளில் தரவை தேர்வுசெய்:

source: Most likely this is not wanted during a merge. Do you want to disable these settings or continue with these settings active?
ta: தேவை இல்லாத செல்கள். இவற்றை முடக்க வேண்டுமா?
