Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/kdiff3.po
Languages: ta

source: Option Unsafe for Merging
ta: காப்பு இல்லாத தேர்வுகள் செல்கள்

source: Use These Options During Merge
ta: செல்களில் தேர்வுகளை உபயோகப்படுத்து

source: Disable Unsafe Options
ta: பாதுகாப்பு இல்லாத தேர்வுகளை முடக்கு

# Status message
source: Loading A: %1
ta: a ஏற்றுதல்

# Status message
source: Loading B: %1
ta: b ஏற்றுதல்

# Status message
source: Diff: A <-> B
ta: வேறுபாடு a <-> b

# Status message
source: Linediff: A <-> B
ta: வரி வேறுபாடு : a <->b

# Status message
source: Loading C: %1
ta: a ஏற்றுதல்

# Status message
source: Diff: A <-> C
ta: வேறுபாடு a <-> c

# Status message
source: Diff: B <-> C
ta: வேறுபாடு b <-> c

# Status message
source: Linediff: B <-> C
ta: வரி வேறுபாடு b <-> c

# Status message
source: Linediff: A <-> C
ta: வரி வேறுபாடு : a <-> c

# Error message
source: Not enough memory to complete request.
ta: கோரிக்கையை முடிக்க போதுமான நினைவகம் இல்லை.

source: An internal error occurred: %1
ta: உள் பிழை ஏற்பட்டது: %1

source: Too many lines in diff. Skipping file.
ta: வேறுபாட்டில் பல கோடுகள். கோப்பைத் தவிர்க்கிறது.

source: All input files contain the same text, but are not binary equal.
ta: அனைத்து உள்ளீட்டுக் கோப்புகளும் ஒரே உரையைக் கொண்டன.

source: Files %1 and %2 have equal text, but are not binary equal.
ta: கோப்புகள் a மற்றும் b இருநிலை சமம் உடையன.

source: Some input files do not seem to be pure text files. Note that the KDiff3 merge was not meant for binary data. Continue at your own risk.
ta: some inputfiles don't seem to be pure textfiles. note that the kdiff3-merge was not meant for binary data. continue at your own risk.

source: , B
ta: , பி

source: , C
ta: , சி

source: Some input characters could not be converted to valid unicode. You might be using the wrong codec. (e.g. UTF-8 for non UTF-8 files). Do not save the result if unsure. Continue at your own risk. Affected input files are in %1.
ta: சில உள்ளீட்டு எழுத்துக்களை செல்லுபடியாகும் யூனிகோடாக மாற்ற முடியவில்லை. நீங்கள் தவறான கோடெக்கைப் பயன்படுத்தலாம். (எ.கா. யுடிஎஃப் -8 அல்லாத கோப்புகளுக்கு யுடிஎஃப் -8). உறுதியாக தெரியாவிட்டால் முடிவை சேமிக்க வேண்டாம். உங்கள் சொந்த ஆபத்தில் தொடரவும். பாதிக்கப்பட்ட உள்ளீட்டு கோப்புகள் %1 இல் உள்ளன.

source: Abort
ta: விடுதல்

source: Continue Merging
ta: தொடர்ந்து ஒன்றாக சேர்.

source: Opening files...
ta: திறந்த கோப்புகள்

source: Cutting selection...
ta: வெட்டுதலை தேர்ந்தெடு

source: Copying selection to clipboard...
ta: தேர்ந்தெடுக்கப்பட்டதை கிளிப்போர்டிற்கு நகலெடுக்க

source: Inserting clipboard contents...
ta: கிளிப்போர்டு உள்ளடக்கத்தை சொருகு

source: Ok
ta: சரி

source: Go to Line
ta: கடைசி டெல்டாவிற்குச் செல்க

source: Word wrap (Cancel disables word wrap)
ta: சொல் மடக்கு (ரத்துசெய் சொல் மடக்கை முடக்குகிறது)

source: Calculating max width for horizontal scrollbar
ta: கிடைமட்ட உருள் அறைக்கு அதிகபட்ச அகலத்தைக் கணக்கிடுகிறது

source: Save && Continue
ta: சேமி தொடரு

source: Continue Without Saving
ta: சேமிக்காமல் தொடரு

source: Search complete.
ta: தேடல் முடிவடைந்தது

source: Search Complete
ta: தேடல் முடிவடைந்தது

source: Nothing is selected in either diff input window.
ta: வேறுபட்ட உள்ளீட்டு சாளரத்தில் எதுவும் தேர்ந்தெடுக்கப்படவில்லை.

source: Error while adding manual diff range
ta: அடைவை உருவாக்கும் போது பிழை

source: &Cancel
ta: ரத்துசெய் (&c)

source: Swap %1<->%2
ta: இடமாற்று %1 <-> %2

source: Copy %1->Output
ta: %1-> வெளியீட்டை நகலெடுக்கவும்

source: Swap %1<->Output
ta: இடமாற்று %1 <-> வெளியீடு

source: Configure...
ta: அமை

source: Open Folder
ta: திறந்த கோப்புகள்

source: Select Output File
ta: வெளியீட்டு கோப்பைத் தேர்ந்தெடுக்கவும்

source: Search text:
ta: உரையைத் தேடு:

source: Case sensitive
ta: எழுத்து வகை உணரக்கூடிய

source: Search A
ta: aவைத் தேடு

source: Search B
ta: bவைத் தேடு

source: Search C
ta: cவைத் தேடு

source: Search output
ta: வெளியீட்டைத் தேடு

source: &Search
ta: தேடு

source: Regular Expression Tester
ta: வழக்கமான வெளிப்பாடு சோதனையாளர்

source: Example auto merge line:
ta: எடுத்துக்காட்டு ஆட்டோ ஒன்றிணைப்பு வரி:

# Tool Tip
source: To test auto merge, copy a line as used in your files.
ta: ஆட்டோ ஒன்றிணைப்பைச் சோதிக்க, உங்கள் கோப்புகளில் பயன்படுத்தப்பட்டபடி ஒரு வரியை நகலெடுக்கவும்.

source: Match result:
ta: போட்டி முடிவு:

source: Example history start line (with leading comment):
ta: எடுத்துக்காட்டு வரலாறு தொடக்க வரி (முன்னணி கருத்துடன்):

# Tool Tip
source: Copy a history start line as used in your files, including the leading comment.
ta: உங்கள் கோப்புகளில் பயன்படுத்தப்பட்டபடி வரலாறு தொடக்க வரியை நகலெடுக்கவும், முன்னணி கருத்து உட்பட.

source: History sort key order:
ta: வரலாறு வரிசை முக்கிய ஒழுங்கு:

source: Example history entry start line (without leading comment):
ta: எடுத்துக்காட்டு வரலாறு நுழைவு தொடக்க வரி (முன்னணி கருத்து இல்லாமல்):

# Tool Tip
source: Copy a history entry start line as used in your files, but omit the leading comment.
ta: உங்கள் கோப்புகளில் பயன்படுத்தப்பட்டபடி வரலாற்று நுழைவு தொடக்க வரியை நகலெடுக்கவும், ஆனால் முன்னணி கருத்தை தவிர்க்கவும்.

source: Sort key result:
ta: முக்கிய முடிவை வரிசைப்படுத்துங்கள்:

source: Match success.
ta: போட்டி வெற்றி.

source: Match failed.
ta: சேகரிப்பு தோல்வியடைந்தது.

source: Opening and closing parentheses do not match in regular expression.
ta: அடைப்புக்குறிப்புகள் திறப்பு மற்றும் மூடுவது வழக்கமான வெளிப்பாட்டில் பொருந்தாது.

source: Writing clipboard data to temp file failed.
ta: க்ளிப்போர்டின் எழுத்தின் தரத்தில் உள்ள டெம்ப் கோப்பு தவறு.

source: From Clipboard
ta: கிளிப் போர்டிலிருந்து.

source: %1 is not a normal file.
ta: இணைப்புகள் மற்றும் கோப்புகள் கலந்து உள்ளன.

# Error message. %1 = filepath
source: File %1 too large to process. Skipping.
ta: கோப்பு %1 செயலாக்க மிகப் பெரியது. ச்கிப்பிங்.

source: Temp file is: %1
ta: தற்காலிக கோப்பு: %1

source: Preprocessing possibly failed. Check this command: %1 The preprocessing command will be disabled now.
ta: முன்செயலிகள் தவறு. கட்டளையை சரிப்பார்: %1 முன்செயலிகள் கட்டளையை இப்பொழுதே முடக்கு,

source: The line-matching-preprocessing possibly failed. Check this command: %1 The line-matching-preprocessing command will be disabled now.
ta: முன்செயலிகள் தவறு. கட்டளையை சரிப்பார்: %1 வரிசெல்களின் கட்டளையை இப்பொழுதே முடக்கு,

# Read error message. %1 = filepath
source: Failed to read file: %1
ta: கோப்புகளை படித்தல்: %1

source: Expecting space after closing quote.
ta: மேற்கோளை மூடிய பிறகு இடத்தை எதிர்பார்க்கிறது.

source: Unmatched quote.
ta: ஒப்பிடமுடியாத மேற்கோள்.

source: Unexpected quote character within argument.
ta: வாதத்திற்குள் எதிர்பாராத மேற்கோள் எழுத்து.

source: No program specified.
ta: நிரல் குறிப்பிடப்படவில்லை.
