Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/kdiff3.po
Languages: ta

# NAME OF TRANSLATORS
source: Your names
ta: கோ. கிசோர்

# EMAIL OF TRANSLATORS
source: Your emails
ta: kde-l10n-ta@kde.org

source: Getting file status: %1
ta: இக்கோப்பின் நிலை பெறப்படுகிறது: %1

# Message for progress dialog %1 = path to file
source: Reading file: %1
ta: இக்கோப்பு படிக்கப்படுகிறது: %1

# Message for progress dialog %1 = path to file
source: Writing file: %1
ta: இக்கோப்பு எழுதப்படுகிறது: %1

source: Out of memory
ta: நினைவிடம் போதவில்லை

# Message for progress dialog %1 = path to file
source: Making folder: %1
ta: இவ்வடைவு உருவாக்கப்படுகிறது: %1

# Message for progress dialog %1 = path to file
source: Removing folder: %1
ta: இவ்வடைவு நீக்கப்படுகிறது: %1

# Message for progress dialog %1 = path to file
source: Removing file: %1
ta: இக்கோப்பு நீக்கப்படுகிறது:%1

source: Creating symbolic link: %1 -> %2
ta: குறியிணைப்பு உருவாக்கப்படுகிறது: %1 -> %2

source: Renaming file: %1 -> %2
ta: கோப்பின் பெயர் மாற்றப்படுகிறது: %1 -> %2

source: Copying file: %1 -> %2
ta: கோப்பு நகலெடுக்கப்படுகிறது: %1 -> %2

# Status message
source: Reading folder: %1
ta: அடைவு படிக்கப்படுகிறது: %1

source: Listing directory: %1
ta: இவ்வடைவிலுள்ளவை பட்டியலிடப்படுகின்றன: %1

source: Data loss error: If it is reproducible please contact the author.
ta: தரவிழப்பு சிக்கல்: இச்சிக்கலைத் தூண்டும் முறை உங்களுக்கு தெரிந்தால் நிரலாளரை தொடர்புகொள்ளவும்.

source: Severe Internal Error
ta: கடுமையான உள்ளக சிக்கல்.

source: File %1: Line %2
ta: கோப்பு %1: வரி %2

source: File %1: Line not available
ta: கோப்பு %1: வரி கிடைக்கவில்லை

source: Encoding:
ta: குறியாக்கம்

source: Line end style:
ta: வரிமுடிவுகளின் முறை:

source: A (Base)
ta: a (மூலம்)

source: Encoding: %1
ta: குறியாக்கம் %1

source: DOS
ta: டோச்

source: Unix
ta: யுனிக்ச்

source: Line end style: %1
ta: வரிமுடிவுகளின் முறை: %1

source: Unknown
ta: தெரியாதது

source: Top line
ta: முதல் வரி

source: End
ta: முடிவு

source: Open File
ta: கோப்பை திற

source: Unicode, 8 bit
ta: 8 பிட்டு யூனிகோடு

source: Unicode, 8 bit (BOM)
ta: 8 பிட்டு யூனிகோடு

source: Other
ta: வேறு

# Operation column message
source: Copy A to B
ta: a-யை b-க்கு நகலெடு

# Operation column message
source: Copy B to A
ta: b-யை a-க்கு நகலெடு

# Operation column message
source: Delete A
ta: a-யை நீக்கு

# Operation column message
source: Delete B
ta: b-யை நீக்கு

# Operation column message
source: Delete A & B
ta: a & b-யை நீக்கு

# Operation column message
source: Merge to A
ta: a-க்கு ஒன்றிணை

# Operation column message
source: Merge to B
ta: b-க்கு ஒன்றிணை

# Operation column message
source: Merge to A & B
ta: a & b-க்கு ஒன்றிணை

# Operation column message
source: Delete (if exists)
ta: நீக்கு (இருந்தால்)

# Operation column message (Directory merge)
source: Merge
ta: ஒன்றிணை

# Operation column message (File merge)
source: Merge (manual)
ta: ஒன்றிணை (கைமுறையாக)

# Operation column message
source: Error: Conflicting File Types
ta: சிக்கல்: முரண்படும் கோப்புவகைகள்

# Operation column message
source: Error: Changed and Deleted
ta: சிக்கல் மாற்றப்பட்டு நீக்கப்பட்டது

# Operation column message
source: Error: Dates are equal but files are not.
ta: சிக்கல்: தேதிகள் ஒன்றாக இருந்தாலும் கோப்புகள் வேறுபடுகின்றன.

# Status column message
source: Done
ta: முடிந்தது

# Status column message
source: Error
ta: சிக்கல்

# Status column message
source: Skipped.
ta: தவிர்க்கப்பட்டது.

# Status column message
source: Not saved.
ta: சேமிக்கப்படவில்லை.

# Status column message
source: In progress...
ta: செயல்பாட்டில் உள்ளது...

# Status column message
source: To do.
ta: செய்யவேண்டியது.

# Column title
source: Name
ta: பெயர்

# Column title
source: Operation
ta: செயல்பாடு

# Column title
source: Status
ta: நிலை

# Column title
source: Unsolved
ta: தீர்கப்படாத‍து

# Column title
source: Solved
ta: தீர்க்கப்பட்டது

# Column title
source: Nonwhite
ta: nonwite

# Column title
source: White
ta: வெள்ளை

source: You are currently doing a folder merge. Are you sure, you want to abort the merge and rescan the folder?
ta: ஓர் அடைவிலுள்ளவற்றை தற்போது ஒன்றுசேர்த்துக்கொண்டிருக்கிறீர்கள். அதைக் கைவிட்டு அவ்வடைவை மறுபடியும் ஆராய வேண்டுமா?

# Error dialog title
source: Warning
ta: எச்சரிக்கை

# Title for rescan button
source: Rescan
ta: மீள ஆராய்

# Title for continue button
source: Continue Merging
ta: தொடர்ந்து ஒன்றாக சேர்

source: Opening of folders failed:
ta: அடைவுகளைத் திறப்பது தோல்வியடைந்தது:

source: Folder A "%1" does not exist or is not a folder.
ta: அடைவு எ "%1" இல்லை அல்லது அது ஒரு அடைவு இல்லை.

source: Folder B "%1" does not exist or is not a folder.
ta: அடைவு b "%1" உபயோகத்தில் இல்லை (அ) அது ஒரு அடைவே அல்ல.

source: Folder C "%1" does not exist or is not a folder.
ta: அடைவு c "%1" உபயோகத்தில் இல்லை (அ) அது ஒரு அடைவே அல்ல.

# Error dialog title
source: Folder Opening Error
ta: அடைவு திறப்பில் சிக்கல்

source: The destination folder must not be the same as A or B when three folders are merged. Check again before continuing.
ta: மூன்று அடைவுகள் ஒன்று சேரும் பொழுது, சேரும் அடைவு a (அ) b போன்று இருக்கக் கூடாது. தொடர்வதற்கு முன் மீண்டும் சரிபார்க்கவும்.

# Error dialog title
source: Parameter Warning
ta: அளவுருக்கள் எச்சிரிகை.

source: Scanning folders...
ta: கோப்புறைகளை ச்கேன் செய்வது ...

# Status message
source: Reading Folder A
ta: கோப்புகளை படித்தல்: %1

# Status message
source: Reading Folder B
ta: கோப்புகளை படித்தல்: %1

# Status message
source: Reading Folder C
ta: கோப்புகளை படித்தல்: %1

# Warning text
source: Some subfolders were not readable in
ta: சில துணை அடைவுகளை படிக்க இயலவில்லை

# Warning text
source: Check the permissions of the subfolders.
ta: துணை அடைவுகளின் அனுமதிகளை சரிபார்க்கவும்.

# Status bar idle message.
source: Ready.
ta: தயார்.

source: Folder Comparison Status Number of subfolders: %1 Number of equal files: %2 Number of different files: %3
ta: கோப்புறை ஒப்பீட்டு நிலை துணை கோப்புறைகளின் எண்ணிக்கை: %1 சம கோப்புகளின் எண்ணிக்கை: %2 வெவ்வேறு கோப்புகளின் எண்ணிக்கை: %3

source: Number of manual merges: %1
ta: கைமுறை ஒன்று சேர்க்கையின் எண்ணிக்கை:

source: This affects all merge operations.
ta: இது அனைத்து ஒன்றுசேர் இயக்கங்களை பாதிக்கிறது.

source: Changing All Merge Operations
ta: அனைத்து ஒன்றுசேர் இயக்கங்களை மாற்றிக்கொண்டிருக்கிறது

source: Processing %1 / %2 %3
ta: செயலாக்குதல்

source: Some files could not be processed.
ta: சில கோப்புகளை செயலாக்க முடியவில்லை.

source: Aborting due to too many errors.
ta: பல பிழைகள் காரணமாக கருக்கலைப்பு.

source: This operation is currently not possible.
ta: இந்த இயக்கம் தற்போது சாத்தியமில்லை.

source: Operation Not Possible
ta: இயக்கம் சாதியமில்லை

source: An error occurred while copying.
ta: நகலெடுக்கும்போது பிழை ஏற்பட்டுள்ளது.

source: Merge Error
ta: ஒன்றுசேர் பிழை

source: Unknown merge operation. (This must never happen!)
ta: தெரியாத ஒன்றுசேர் இயக்கம்.( இது ஒருபோதும் நிகழக்கூடாது)

source: Unknown merge operation.
ta: தெரியாத ஒன்றுசேர் இயக்கம்.

source: The merge is about to begin. Choose "Do it" if you have read the instructions and know what you are doing. Choosing "Simulate it" will tell you what would happen. Be aware that this program still has beta status and there is NO WARRANTY whatsoever! Make backups of your vital data!
ta: ஒன்றுசேர்ப்பு தொடங்கப்பட உள்ளது. நீங்கள் நெறிமுறைகளைப் படித்து என்ன செய்கிறீர்கள் என்பதை அறிந்தால், "இதை செய்க" என்பதை தேர்ந்தெடுக்க. "இதை போன்று நட" என்பதை தேர்வு செய்தால் நிகழவிருப்பதை கூரும். இந்த நிரல் இன்னும் பீடா நிலையில் தான் உள்ளது என்பதை கவனத்தில் கொள்க; மேலும் இதற்கு எந்தவித உத்திரவாதமும் கிடையாது! தங்களது இன்றியமையாத தகவல்களுக்கு பின்னணி அமைக்க!

# Caption
source: Starting Merge
ta: ஒன்று சேர்ப்பைத் துவக்குதல்

# Button title to confirm merge
source: Do It
ta: உறுதியாக வெற்றி

# Button title to simulate merge
source: Simulate It
ta: முன்னோட்டம் காட்டு

source: The highlighted item has a different type in the different folders. Select what to do.
ta: பலவிதமான அடைவுகளில் பலவகையாக தனிப்படுத்தப்பட்ட விவரம் உள்ளது. எதை செய்வதென்பதை தேர்ந்தெடுக்க.

source: The modification dates of the file are equal but the files are not. Select what to do.
ta: கோப்புகளின் திருத்திய தேதிகள் ஒன்றாக உள்ளது, ஆனால் கோப்புகள் இல்லை. எதை செய்வதென்பதை தேர்ந்தெடுக்க.

source: The highlighted item was changed in one folder and deleted in the other. Select what to do.
ta: பலவிதமான அடைவுகளில் பலவகையாக தனிப்படுத்தப்பட்ட விவரம் உள்ளது. எதை செய்வதென்பதை தேர்ந்தெடுக்க.

source: This operation is currently not possible because folder merge is currently running.
ta: இந்த செயற்பாடு தற்போது சாத்தியமில்லை ஏனென்றால் அடைவு ஒற்றினை தற்போது இயங்கிக்கொண்டிருக்கின்றது

source: There was an error in the last step. Do you want to continue with the item that caused the error or do you want to skip this item?
ta: கடைசி அடியில் பிழை இருந்தது. இந்த பிழையை ஏற்படுத்திய விவரத்துடன் தொடர விரும்புகிறீர்களா அல்லது அதை தவிர்க்க விரும்புகிறீர்களா?

# Caption for message dialog
source: Continue merge after an error
ta: பிழைக்குப் பிறகு ஒன்று சேர்த்தலை தொடர்க

# Continue button title
source: Continue With Last Item
ta: கடைசி விவரத்துடன் தொடர்க

# Skip button title
source: Skip Item
ta: உருப்படியை தவிர்

source: Merge operation complete.
ta: ஒன்றுசேர் இயக்கம் முடிந்தது

source: Merge Complete
ta: ஒன்றுசேர்ப்பு முடிந்தது

source: Simulated merge complete: Check if you agree with the proposed operations.
ta: போலியான ஒன்றுசேர்ப்பு முடிந்தது: முன்மொழிந்த இயக்கங்களுடன் நீங்கள் ஒத்துப்போகிறீர்களா என்பதை சரிபார்க்கவும்.

source: An error occurred. Press OK to see detailed information.
ta: பிழை ஏற்பட்டுள்ளது. விரிவான விவரங்களுக்கு சரி என்பதை அழுத்துக.

source: Error: While deleting %1: Creating backup failed.
ta: பிழை: %1 நீக்கும்போது: பின்னணி உருவாக்கம் தோல்வியடைந்தது.

source: delete folder recursively( %1 )
ta: அடைவு சூழ்நிலை நீக்கு நீக்கு(%1)

source: delete( %1 )
ta: நீக்கு( %1 )

source: Error: delete folder operation failed while trying to read the folder.
ta: பிழை: அடைவை படிக்கும்போது நீக்க இயலவில்லை.

source: Error: rmdir( %1 ) operation failed.
ta: rmdir( %1 } பிழை: இயக்க இயலவில்லை

source: Error: delete operation failed.
ta: பிழை: நீக்கும் இயக்கம் தோல்வியடைந்தது.

source: manual merge( %1, %2, %3 -> %4)
ta: கைமுறை ஒன்றினை(%1, %2,%3 -> %4)

source: Note: After a manual merge the user should continue by pressing F7.
ta: குறிப்பு: கையேடு ஒன்றினையின் பிறகு உபயோகிப்பவர் f7 வழியாக தொடர வேண்டும்.

source: Error: copy( %1 -> %2 ) failed.Deleting existing destination failed.
ta: பிழை:நகல்( %1 -> %2 ) தோல்வி அடைந்தது. இருக்கும் சேரிடம் நீக்கம் தோல்வி அடைந்தது

source: copyLink( %1 -> %2 )
ta: நகல் இணை( %1 -> %2 )

source: Error: copyLink failed: Remote links are not yet supported.
ta: பிழை:தொடர்புப் படியெடு தோல்வியடைந்தது: தூரத் தொடர்பு இன்னும் ஆதரிக்கப்படவில்லை

source: Error: copyLink failed.
ta: பிழை: நகல் இணை தோல்வியடைந்தது.

source: copy( %1 -> %2 )
ta: நகல்( %1 -> %2 )

source: Error during rename( %1 -> %2 ): Cannot delete existing destination.
ta: மறுபெயரிடும் போது பிழை( %1 -> %2 ): தற்போதுள்ள சேருமிடத்தை நீக்க இயலாது.

source: rename( %1 -> %2 )
ta: மறுபெயர்( %1 -> %2 )

source: Error: Rename failed.
ta: பிழை: மறுபெயர் தோல்வி அடைந்தது.

source: Error during makeDir of %1. Cannot delete existing file.
ta: %1அடைவை உருவாக்கும் போது பிழை: தற்போதைய கோப்பினை நீக்க இயலாது.

source: makeDir( %1 )
ta: ( %1 )அடைவை உருவாக்கு

source: Error while creating folder.
ta: அடைவை உருவாக்கும் போது பிழை

source: Dest
ta: சேருமிடம்

# Header label
source: Folder
ta: திறந்த கோப்புகள்

# Header label
source: Type
ta: விதம்

# Header label
source: Size
ta: அளவு

# Header label
source: Attr
ta: தன்மை

# Header label
source: Last Modification
ta: கடைசி திருத்தம்

# Header label
source: Link-Destination
ta: இணை-சேருமிடம்

# Header label
source: File
ta: கோப்பு

# Header label ending
source: -Link
ta: இணைப்பு.

# Header label
source: not available
ta: கிடைக்கவில்லை

source: A (Dest):
ta: a (சேருமிடம்):

source: A:
ta: அ:

source: A (Base):
ta: a (அடித்தளம்):

source: B (Dest):
ta: b (சேருமிடம்):

source: C (Dest):
ta: c (சேருமிடம்):

source: C:
ta: சி:

source: Dest:
ta: சேருமிடம்:

source: Save Folder Merge State As...
ta: அடைவுச் சேர்க்கை

source: Start/Continue Folder Merge
ta: அடைவை சேர்க்கத் துவங்கு

source: Run Operation for Current Item
ta: நிகழ் உருப்படிக்காக செயற்பாடு இயங்கு

source: Compare Selected File
ta: தேர்ந்தெடுத்த கோப்பினை ஒப்பிடு

source: Merge Current File
ta: தற்போதைய கோப்பினை ஒன்றுசேர்

source: Merge File
ta: ஒன்றாகச் சேர்.

source: Fold All Subfolders
ta: அனைத்து உபஅடைவுகளையும் மடி

source: Unfold All Subfolders
ta: அனைத்து உபஅடைவுகளையும் பிரி

source: Rescan
ta: மறுவருடல்

source: Choose A for All Items
ta: எல்லா விவரங்களுக்கும் aவைத் தேர்ந்தெடு

source: Choose B for All Items
ta: எல்லா விவரங்களுக்கும் bவைத் தேர்ந்தெடு

source: Choose C for All Items
ta: எல்லா விவரங்களுக்கும் cவைத் தேர்ந்தெடு

source: Auto-Choose Operation for All Items
ta: எல்லா விவரங்களுக்கும் தானியக்கத்தேர்வு

source: No Operation for All Items
ta: எல்லா விவரங்களுக்கும் இயக்கமில்லை

source: Show Identical Files
ta: ஒத்த கோப்புகளைக் காட்டு

source: Identical Files
ta: ஒத்த கோப்புகள்

source: Show Different Files
ta: வேறு விதமான கோப்புகளின் எண்ணிக்கை:

source: Show Files only in A
ta: கோப்புகளை மட்டும் காண்பி

source: Files only in A
ta: கோப்புகள் a

source: Show Files only in B
ta: b இல் மட்டுமே கோப்புகளைக் காட்டு

source: Files only in B
ta: கோப்புகள் பி மட்டுமே

source: Show Files only in C
ta: சி இல் மட்டுமே கோப்புகளைக் காட்டு

source: Files only in C
ta: கோப்புகள் சி

source: Compare Explicitly Selected Files
ta: தேர்ந்தெடுத்த கோப்பினை ஒப்பிடு

source: Merge Explicitly Selected Files
ta: தேர்ந்தெடுத்த கோப்பினை ஒப்பிடு

source: Do Nothing
ta: ஒன்றும் செய்யாதே

source: Merge
ta: ஒன்றாகச் சேர்.

source: Delete (if exists)
ta: நீக்கு.

source: Copy A to B
ta: a to b படியெடு

source: Copy B to A
ta: படியெடு b to a

source: Delete A
ta: a ஐ நீக்கு

source: Delete B
ta: b ஐ நீக்கு

source: Delete A && B
ta: a & bஐ நீக்கு

source: Merge to A
ta: a ஐ ஒன்றாகச் சேர்.

source: Merge to B
ta: 'பி' ஐ ஒன்றாகச் சேர்.

source: Merge to A && B
ta: a & b ஐ ஒன்றாகச் சேர்.

source: Unable to determine full url. No parent specified.
ta: முழு url ஐ தீர்மானிக்க முடியவில்லை. எந்த பெற்றோரும் குறிப்பிடப்படவில்லை.

source: Failed to read file: %1
ta: கோப்புகளை படித்தல்: %1

source: Creating temp copy of %1 failed.
ta: வார்ப்புரு படியெடு உருவாக்குவது %1 இயலவில்லை.

source: Opening %1 failed. %2
ta: திறப்பதற்கு %1 இயலவில்லை.

source: Error reading from %1. %2
ta: %1னிலிருந்து படிக்கும் பிழை

source: While trying to make a backup, deleting an older backup failed. Filename: %1
ta: ஒரு பின்கோப்பினை உருவாக்க முயற்சிக்கும்போது, பழைய பின்கோப்பினை நீக்க முடியவில்லை. கோப்புப் பெயர்கள்:

source: While trying to make a backup, renaming failed. Filenames: %1 -> %2
ta: ஒரு பின்கோப்பினை உருவாக்க முயற்சிக்கும் போது, பெயர் மாற்றம் செய்யப்படவில்லை. கோப்புப் பெயர்கள்:

source: TextLabel
ta: டெக்ச்ட்லேபிள்

source: The quick brown fox jumps over the river but the little red hen escapes with a shiver :-)
ta: விரைவான பழுப்பு நரி ஆற்றின் மீது குதிக்கிறது ஆனால் சிறிய சிவப்பு கோழி ஒரு நடுக்கம் மூலம் தப்பிக்கிறது :-)

# Button Title
source: Change Font
ta: எழுத்துருவை மாற்றவும்

source: Current Configuration:
ta: நடப்பு உருப்படி இசைவு செயற்பாடு

source: Config Option Error:
ta: கோப்பு திறப்பில் பிழை

source: Option --auto used, but no output file specified.
ta: தேர்வு தானே உபயோகிக்கப்பட்டுள்ளது ஆனால் வெளியீட்டுக் கோப்பு குறிப்பிடப்படவில்லை

source: Directory merge
ta: அடைவுச் சேர்க்கை

source: Merge info
ta: a ஐ ஒன்றாகச் சேர்.

# Error message
source: Can't compare file with folder.
ta: கோப்பை கோப்புறையுடன் ஒப்பிட முடியாது.

# Title error message box
source: Bad comparison attempt
ta: binary comparison

source: Option --auto ignored for folder comparison.
ta: அடைவு ஒப்பீட்டுக்காக தேர்வு தானே மறுக்கப்பட்டுள்ளது

source: Saving failed.
ta: சேகரிப்பு தோல்வியடைந்தது.

source: Opening of these files failed:
ta: இந்த கோப்புகளின் திறப்பு தோல்வியடைந்தது:

source: File open error
ta: கோப்பு திறப்பு பிழை

source: Opens documents for comparison...
ta: ஒப்பிடுதலுக்கு ஆவணங்களைத் திறக்க...

source: Reload
ta: தயார்.

source: Saves the merge result. All conflicts must be solved!
ta: ஒன்றுசேர் முடிவை சேகரி. அனைத்து குழப்பங்களும் தீர வேண்டும்.

source: Saves the current document as...
ta: தற்போதைய ஆவணத்தை ....வாக சேமி

source: Print the differences
ta: வேறுபாடுகளை அச்சிடுக

source: Quits the application
ta: பயன்பாட்டை முறிக்க

source: Undo last action.
ta: தானாகவே தேர்ந்தெடுக்கப்பட்ட படிவு

source: Cuts the selected section and puts it to the clipboard
ta: தேர்வு செய்த பகுதியை எடுத்து கிளிப்போர்டில் செலுத்துகிறது

source: Copies the selected section to the clipboard
ta: தேர்வு செய்த பகுதியை கிளிப் போர்டை படி செய்கிறது.

source: Pastes the clipboard contents to current position
ta: கிளிப்போர்டின் உள்ளடக்கங்களை உரிய இடத்தில் சேர்க்கிறது

source: Select everything in current window
ta: தற்போதைய சாளரத்தில் உள்ள அனைத்தையும் தேர்ந்தெடுக்கவும்

source: Search for a string
ta: தொடர்ச்சிகளை தேடு

source: Search again for the string
ta: சரத்தை மீண்டும் தேடு

source: Enables/disables the statusbar
ta: நிலைப்பட்டியை செயல்படுத்து/நீக்கு

source: Configure KDiff3...
ta: kdiff3யை அமை

source: Go to Current Delta
ta: தற்போதைய டெல்டாவிற்குச் செல்க

source: Current Delta
ta: தற்போதைய டெல்டாவிற்குச் செல்க

source: Go to First Delta
ta: முதல் டெல்டாவிற்குச் செல்க

source: First Delta
ta: முதல் டெல்டாவிற்குச் செல்க

source: Go to Last Delta
ta: கடைசி டெல்டாவிற்குச் செல்க

source: Last Delta
ta: கடைசி டெல்டாவிற்குச் செல்க

# Tooltip explanation text
source: (Skips white space differences when "Show White Space" is disabled.)
ta: ("வெள்ளை இடத்தைக் காட்டு" முடக்கப்பட்டிருக்கும் போது வெள்ளை விண்வெளி வேறுபாடுகளைத் தவிர்க்கவும்.)

# Tooltip explanation text
source: (Does not skip white space differences even when "Show White Space" is disabled.)
ta: ("வெள்ளை இடத்தைக் காட்டு" முடக்கப்பட்டிருந்தாலும் கூட வெள்ளை விண்வெளி வேறுபாடுகளைத் தவிர்க்காது.)

source: Go to Previous Delta
ta: முந்தைய டெல்டாவிற்குச் செல்க

source: Prev Delta
ta: முந்தைய டெல்டாவிற்குச் செல்க

source: Go to Next Delta
ta: அடுத்த டெல்டாவிற்குச் செல்க

source: Next Delta
ta: அடுத்த டெல்டாவிற்குச் செல்க

source: Go to Previous Conflict
ta: முந்தைய குழப்பத்திற்குச் செல்க

source: Prev Conflict
ta: குழப்பங்கள்

source: Go to Next Conflict
ta: அடுத்த குழப்பத்திற்குச் செல்க

source: Next Conflict
ta: அடுத்த குழப்பத்திற்குச் செல்க

source: Go to Previous Unsolved Conflict
ta: முந்தைய தீர்க்காத குழப்பத்திற்குச் செல்க

source: Prev Unsolved
ta: unsolved

source: Go to Next Unsolved Conflict
ta: அடுத்த தீர்க்காத குழப்பத்திற்குச் செல்க

source: Next Unsolved
ta: unsolved

# Title for menu item
source: Go to Line
ta: கடைசி டெல்டாவிற்குச் செல்க

# Text used for toolbar button.
source: Go Line
ta: இணைப்பு.

# Tooltip Text
source: Goto specified line.
ta: கோட்டோ குறிப்பிட்ட வரி.

# Title for menu item
source: Select Line(s) From A
ta: aவிலிருந்து வரி(களை) தேர்ந்தெடு

# Text used for select A toolbar button.
source: Choose A
ta: தேர்வு a

# Title for menu item
source: Select Line(s) From B
ta: bவிலிருந்து வரி(களை) தேர்ந்தெடு

# Text used for select B when toolbar button.
source: Choose B
ta: தேர்வு b

# Title for menu item
source: Select Line(s) From C
ta: cவிலிருந்து வரி(களை) தேர்ந்தெடு

# Text used for select C toolbar button.
source: Choose C
ta: தேர்வு c

# Title for menu item
source: Automatically Go to Next Unsolved Conflict After Source Selection
ta: மூலத்தை தேர்வு செய்த பிறகு தானாகவே அடுத்த தீர்க்கப்படாத குழப்பதற்கு செல்

# Auto goto next unsolved toolbar text.
source: Auto Next
ta: தானாகவே தேர்ந்தெடுக்கப்பட்ட படிவு

source: Show Space && Tabulator Characters
ta: இடைவெளியை காட்டி மற்றும் வேறுபாட்டிற்காக பட்டியலிடுவான் எழுத்துக்கள்

# Show whitespace toolbar text.
source: White Characters
ta: வெள்ளை எழுத்துக்கள்

source: Show White Space
ta: வெள்ளை இடத்தை காட்டும்

# Show whitespace changes toolbar text.
source: White Deltas
ta: முதல் டெல்டாவிற்குச் செல்க

source: Show Line Numbers
ta: வரி எண்களை காட்டு

# Show line numbers toolbar text
source: Line Numbers
ta: வரி எண்களை காட்டு

source: Automatically Solve Simple Conflicts
ta: தானாகவே எளிய குழப்பங்களை தீர்க்க.

source: Set Deltas to Conflicts
ta: delta வை குழப்பத்திற்கு அமை

source: Run Regular Expression Auto Merge
ta: வழக்கமான வெளிப்பாடு ஆட்டோ ஒன்றிணைப்பை இயக்கவும்

source: Automatically Solve History Conflicts
ta: தானாகவே எளிய குழப்பங்களை தீர்க்க.

source: Split Diff At Selection
ta: தேர்வில் வேறுபாடு

source: Join Selected Diffs
ta: தேர்ந்தெடுத்த கோப்பினை ஒப்பிடு

source: Show Window A
ta: a சாளரத்தைக் காட்டு

source: Show Window B
ta: b சாளரத்தைக் காட்டு

source: Show Window C
ta: c சாளரத்தைக் காட்டு

source: Normal Overview
ta: சாதாரண கண்ணோட்டம்

source: A vs. B Overview
ta: ஒரு வெர்சச் பி கண்ணோட்டம்

source: A vs. C Overview
ta: ஒரு வெர்சச் சி கண்ணோட்டம்

source: B vs. C Overview
ta: பி மற்றும். சி கண்ணோட்டம்

source: Word Wrap Diff Windows
ta: சொல் மடக்கு வேறுபட்ட சாளரங்கள்

source: Add Manual Diff Alignment
ta: கையேடு வேறுபாடு சீரமைப்பு சேர்க்கவும்

source: Clear All Manual Diff Alignments
ta: அனைத்து கையேடு வேறுபாடு சீரமைப்புகளையும் அழிக்கவும்

source: Focus Next Window
ta: அடுத்த சாளரத்தை நோக்கு

source: Focus Prev Window
ta: முந்தைய சாளரத்தை நோக்கு

source: Toggle Split Orientation
ta: பிரிப்பு திசையை மாற்று

source: Folder && Text Split Screen View
ta: அடைவு மற்றும் உரையின் பிளவின் திரைப்பார்வை

source: Toggle Between Folder && Text View
ta: அடைவுக்கும் உரை பார்வைக்கும் இடையே மாற்றுக

source: Ready.
ta: தயார்.

source: The merge result has not been saved.
ta: ஒன்று சேர் முடிவு சேகரிக்கப்படவில்லை.

source: Save && Quit
ta: சேகரித்து முடி

source: Quit Without Saving
ta: சேகரிக்காமல் மூடு

source: Saving the merge result failed.
ta: ஒன்றுசேர் முடிவை சேகரித்தல் தோல்வியடைந்தது.

source: You are currently doing a folder merge. Are you sure, you want to abort?
ta: நீங்கள் தற்போது அடைவுகளை சேர்த்துக் கொண்டிருக்கிறீர்கள். நிறுத்த விரும்புகிறீர்களா?

source: Saving file...
ta: கோப்பு சேகரித்தல்...

source: Saving file with a new filename...
ta: புதிய கோப்புப்பெயருடன் கோப்பினை சேகரித்தல்...

source: Save As...
ta: சேமி ...

source: Printing not implemented.
ta: ஒன்றுசேர் இயக்கம் முடிந்தது

source: Printing...
ta: வெளியேறுதல்...

# Status message
source: Printing page %1 of %2
ta: %2 இன் %1 ஐ அச்சிடுதல்

source: (Selection)
ta: மற்றொரு எழுத்துருவை தேர்தெடு

source: Printing completed.
ta: ஒன்றுசேர் இயக்கம் முடிந்தது

source: Printing aborted.
ta: ஒன்றுசேர் இயக்கம் முடிந்தது

source: Exiting...
ta: வெளியேறுதல்...

source: Toggle the statusbar...
ta: நிலைப்பட்டியை மாற்று

source: &File
ta: கோப்பு

source: F&older
ta: எஃப் & பழையது

source: Current Item Merge Operation
ta: நடப்பு உருப்படி ஒற்றிணை செயற்பாடு

source: Current Item Sync Operation
ta: நடப்பு உருப்படி இசைவு செயற்பாடு

source: M&ovement
ta: நகர்த்துவது

source: D&iffview
ta: வித்தியாச பார்வை

source: M&erge
ta: ஒன்றாகச் சேர்.

source: &Window
ta: சாளரங்கள்

source: Main Toolbar
ta: முதன்மையான கருவிப்பட்டை

source: Ignored. (User defined.)
ta: புறக்கணிக்கப்பட்டது. (பயனர் வரையறுத்த.)

# Program version info.
source: (64 bit)
ta: (64 பிட்)

source: Tool for Comparison and Merge of Files and Folders
ta: கோப்புகள் மற்றும் கோப்புறைகளை ஒப்பிட்டு இணைப்பதற்கான கருவி

source: Merge the input.
ta: உள்ளீட்டை ஒன்று சேர்.

source: Explicit base file. For compatibility with certain tools.
ta: தெளிவான அடித்தளக் கோப்பினை சில கருவிகளுடன் பொருத்துவதற்கு

source: Output file. Implies -m. E.g.: -o newfile.txt
ta: வெளியீடு கோப்பு

source: Output file, again. (For compatibility with certain tools.)
ta: மறுபடியும் கோப்பினை வெளியீடு(சில கருவிகளுடன் பொருத்துவதற்கு)

source: No GUI if all conflicts are auto-solvable. (Needs -o file)
ta: எல்லா குழப்பங்களையும் தானாகவே நீங்குமானால் gui தேவையில்லை

source: Ignore --auto and always show GUI.
ta: புறக்கணிக்கவும் -அட்சோ மற்றும் எப்போதும் gui ஐக் காட்டுங்கள்.

source: Ignored.
ta: ignore case

source: Visible name replacement for input file 1 (base).
ta: உள்ளீட்டு கோப்பு 1 (அடிப்படை) க்கான புலப்படும் பெயர் மாற்றீடு.
