Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_config_*.po
Languages: ta

source: Previously the meaning of ``\tableofcontents`` itself was modified by Sphinx. This created an incompatibility with dedicated packages modifying it also such as "tocloft" or "etoc".
ta: முன்னர் `` \ அட்டவணைofcontents`` இன் பொருள் ச்பின்க்சால் மாற்றப்பட்டது. இது அர்ப்பணிப்பு தொகுப்புகளுடன் "டோக்லோஃப்ட்" அல்லது "etoc" போன்றவற்றையும் மாற்றியமைக்கும் பொருந்தாத தன்மையை உருவாக்கியது.

source: ``'tableofcontents'``
ta: `` 'அட்டவணை

source: Commands used to display transitions, default ``'\n\n\\bigskip\\hrule\\bigskip\n\n'``. Override if you want to display transitions differently.
ta: மாற்றங்களைக் காண்பிக்கப் பயன்படுத்தப்படும் கட்டளைகள், இயல்புநிலை `` \ n \ n \\ bigskip \\ hrule \\ bigskip \ n \ n'``. மாற்றங்களை வித்தியாசமாகக் காட்ட விரும்பினால் மேலெழுதவும்.

source: Remove unneeded ``{}`` after ``\\hrule``.
ta: தேவையற்ற `{}` `க்குப் பிறகு` `\\ hrule`` க்குப் பிறகு அகற்றவும்.

source: ``'transition'``
ta: `` 'மாற்றம்'``

source: "printindex" call, the last thing in the file, default ``'\\printindex'``. Override if you want to generate the index differently or append some content after the index. For example ``'\\footnotesize\\raggedright\\printindex'`` is advisable when the index is full of long entries.
ta: "பிரிண்டிண்டெக்ச்" அழைப்பு, கோப்பில் கடைசி விசயம், இயல்புநிலை `` '\\ printindex'```. நீங்கள் குறியீட்டை வித்தியாசமாக உருவாக்க விரும்பினால் அல்லது குறியீட்டுக்குப் பிறகு சில உள்ளடக்கங்களைச் சேர்க்க விரும்பினால் மேலெழுதவும். எடுத்துக்காட்டாக `` '\\ foutnotesize \\ raggedright \\ printindex'`` குறியீட்டு நீண்ட உள்ளீடுகளால் நிரம்பும்போது அறிவுறுத்தப்படுகிறது.

source: ``'printindex'``
ta: `'' பிரிண்டிண்டெக்ச்'```

source: Customization of ``fancyvrb`` LaTeX package. Defaults to ``'\\fvset{fontsize=\\small}'``, because default font (Courier) used in code-blocks is wider and taller than default text font (Times).
ta: `` fancevrb`` லேடெக்ச் தொகுப்பின் தனிப்பயனாக்கம். இயல்புநிலை `` '\\ fvset {fontsize = \\ small}' ``, ஏனெனில் குறியீடு-தொகுதிகளில் பயன்படுத்தப்படும் இயல்புநிலை எழுத்துரு (கூரியர்) இயல்புநிலை உரை எழுத்துருவை (நேரங்கள்) விட அகலமாகவும் உயரமாகவும் இருக்கும்.

source: For ``'xelatex'`` and ``'lualatex'``, defaults to ``'\\fvset{fontsize=auto}'``, because the default fonts are part of one unified typeface family (Latin Modern OpenType).
ta: `` 'xelatex'`` மற்றும் ``' lualatex'`` க்கு, இயல்புநிலை `` '\\ fvset {fontsize = auto}' `` `, ஏனெனில் இயல்புநிலை எழுத்துருக்கள் ஒரு ஒருங்கிணைந்த தட்டச்சு குடும்பத்தின் ஒரு பகுதியாகும் (லத்தீன் நவீன ஓப்பன்டைப்) .

source: Keys that are set by other options and therefore should not be overridden are:
ta: பிற விருப்பங்களால் அமைக்கப்பட்ட விசைகள், எனவே மீறப்படக்கூடாது:

source: ``'docclass'`` ``'classoptions'`` ``'title'`` ``'date'`` ``'release'`` ``'author'`` ``'logo'`` ``'makeindex'`` ``'shorthandoff'``
ta: ``'docclass'`` ``'classoptions'`` ``'title'`` ``'date'`` ``'release'`` ``'author'`` ``'logo'`` ` `'makeindex'``` `' 'சார்தாண்டாஃப்'````

source: A dictionary mapping ``'howto'`` and ``'manual'`` to names of real document classes that will be used as the base for the two Sphinx classes. Default is to use ``'article'`` for ``'howto'`` and ``'report'`` for ``'manual'``.
ta: ஒரு அகராதி மேப்பிங் `` 'அவ் டோ'`` மற்றும் ``' கையேடு'` உண்மையான ஆவண வகுப்புகளின் பெயர்களுக்கு இரண்டு ச்பின்க்ச் வகுப்புகளுக்கான தளமாக பயன்படுத்தப்படும். இயல்புநிலை `` 'howto'`` மற்றும் `' 'கையேடு'``` ``' `'கட்டுரை'``.

source: In Japanese docs (:confval:`language` is ``'ja'``), by default ``'jreport'`` is used for ``'howto'`` and ``'jsbook'`` for ``'manual'``.
ta: சப்பானிய டாக்சில் (: confval: `மொழி` என்பது` `ja'``), இயல்பாக` `'jreport'``` `' எப்படி. 'கையேடு'``.

source: A string of reStructuredText that will be included at the beginning of every source file that is read. This is a possible place to add substitutions that should be available in every file (another being :confval:`rst_epilog`). An example::
ta: படிக்கப்படும் ஒவ்வொரு மூல கோப்பின் தொடக்கத்திலும் சேர்க்கப்படும் மறுசீரமைப்பு டெக்ச்டின் சரம். ஒவ்வொரு கோப்பிலும் கிடைக்க வேண்டிய மாற்றீடுகளைச் சேர்க்க இது சாத்தியமான இடமாகும் (மற்றொன்று: confval: `rst_epilog`). ஒரு எடுத்துக்காட்டு ::

source: A list of file names, relative to the configuration directory, to copy to the build directory when building LaTeX output. This is useful to copy files that Sphinx doesn't copy automatically, e.g. if they are referenced in custom LaTeX added in ``latex_elements``. Image files that are referenced in source files (e.g. via ``.. image::``) are copied automatically.
ta: லேடெக்ச் வெளியீட்டை உருவாக்கும்போது கட்டமைப்பு கோப்பகத்துடன் தொடர்புடைய கோப்பு பெயர்களின் பட்டியல், கட்டமைப்பு கோப்பகத்துடன் நகலெடுக்க. சூரரிமாச்சிலை தானாகவே நகலெடுக்காத கோப்புகளை நகலெடுக்க இது பயனுள்ளதாக இருக்கும், எ.கா. தனிப்பயன் லேடெக்சில் அவை குறிப்பிடப்பட்டால் `` latex_elements``. மூல கோப்புகளில் குறிப்பிடப்பட்டுள்ள படக் கோப்புகள் (எ.கா. வழியாக `` .. படம் :: ``) தானாக நகலெடுக்கப்படுகின்றன.

source: You have to make sure yourself that the filenames don't collide with those of any automatically copied files.
ta: தானாக நகலெடுக்கப்பட்ட கோப்புகளுடன் கோப்பு பெயர்கள் மோதுவதில்லை என்பதை நீங்களே உறுதிப்படுத்திக் கொள்ள வேண்டும்.

source: This overrides the files which is provided from Sphinx such as sphinx.sty.
ta: இது sphinx.sty போன்ற சூரரிமாச்சிலை இலிருந்து வழங்கப்படும் கோப்புகளை மீறுகிறது.

source: Options for text output
ta: உரை வெளியீட்டிற்கான விருப்பங்கள்

source: These options influence text output.
ta: இந்த விருப்பங்கள் உரை வெளியீட்டை பாதிக்கின்றன.

source: Determines which end-of-line character(s) are used in text output.
ta: உரை வெளியீட்டில் எந்த இறுதி வரி எழுத்து (கள்) பயன்படுத்தப்படுகின்றன என்பதை தீர்மானிக்கிறது.

source: ``'unix'``: use Unix-style line endings (``\n``)
ta: `` '' யுனிக்ச்'``: யூனிக்ச்-பாணி வரி முடிவுகளைப் பயன்படுத்தவும் (`` \ n``)

source: ``'windows'``: use Windows-style line endings (``\r\n``)
ta: `` 'விண்டோச்'``: விண்டோச்-பாணி வரி முடிவுகளைப் பயன்படுத்தவும் (`` \ r \ n``)

source: ``'native'``: use the line ending style of the platform the documentation is built on
ta: `` 'நேட்டிவ்'``: ஆவணங்கள் கட்டமைக்கப்பட்ட தளத்தின் வரி முடிவு பாணியைப் பயன்படுத்தவும்

source: Default: ``'unix'``.
ta: இயல்புநிலை: `` 'யூனிக்ச்'```.

source: A string of 7 characters that should be used for underlining sections. The first character is used for first-level headings, the second for second-level headings and so on.
ta: பிரிவுகளை அடிக்கோடிட்டுக் காட்ட பயன்படுத்த வேண்டிய 7 எழுத்துகளின் சரம். முதல் எழுத்து முதல்-நிலை தலைப்புகளுக்கு பயன்படுத்தப்படுகிறது, இரண்டாவது நிலை தலைப்புகளுக்கு இரண்டாவது.

source: The default is ``'*=-~"+`'``.
ta: இயல்புநிலை `` '*=-~ "+`' `` `.

source: A boolean that decides whether section numbers are included in text output. Default is ``True``.
ta: உரை வெளியீட்டில் பிரிவு எண்கள் சேர்க்கப்பட்டுள்ளதா என்பதை தீர்மானிக்கும் ஒரு பூலியன். இயல்புநிலை `` உண்மை``.

source: Suffix for section numbers in text output. Default: ``". "``. Set to ``" "`` to suppress the final dot on section numbers.
ta: உரை வெளியீட்டில் பிரிவு எண்களுக்கான பின்னொட்டு. இயல்புநிலை: `` "." ``. பிரிவு எண்களில் இறுதி புள்ளியை அடக்க `` "" `` என அமைக்கவும்.

source: Options for manual page output
ta: கையேடு பக்க வெளியீட்டிற்கான விருப்பங்கள்

source: These options influence manual page output.
ta: இந்த விருப்பங்கள் கையேடு பக்க வெளியீட்டை பாதிக்கின்றன.

source: This value determines how to group the document tree into manual pages. It must be a list of tuples ``(startdocname, name, description, authors, section)``, where the items are:
ta: ஆவண மரத்தை கையேடு பக்கங்களாக எவ்வாறு தொகுத்தல் செய்வது என்பதை இந்த மதிப்பு தீர்மானிக்கிறது. இது டூப்பிள்ச் `` (ச்டார்ட் டோக் பெயர், பெயர், விளக்கம், ஆசிரியர்கள், பிரிவு) ``, உருப்படிகள் எங்கே:

source: *startdocname*: document name that is the "root" of the manual page. All documents referenced by it in TOC trees will be included in the manual file too. (If you want one master manual page, use your :confval:`master_doc` here.)
ta: *startdocname*: கையேடு பக்கத்தின் "ரூட்" என்ற ஆவண பெயர். toc மரங்களில் குறிப்பிடப்பட்ட அனைத்து ஆவணங்களும் கையேடு கோப்பிலும் சேர்க்கப்படும். (நீங்கள் ஒரு முதன்மை கையேடு பக்கத்தை விரும்பினால், உங்கள்: confval: `master_doc` இங்கே பயன்படுத்தவும்.)

source: *name*: name of the manual page. This should be a short string without spaces or special characters. It is used to determine the file name as well as the name of the manual page (in the NAME section).
ta: *பெயர்*: கையேடு பக்கத்தின் பெயர். இது இடைவெளிகள் அல்லது சிறப்பு எழுத்துக்கள் இல்லாத குறுகிய சரமாக இருக்க வேண்டும். கோப்பு பெயர் மற்றும் கையேடு பக்கத்தின் பெயரை (பெயர் பிரிவில்) தீர்மானிக்க இது பயன்படுத்தப்படுகிறது.

source: *description*: description of the manual page. This is used in the NAME section.
ta: *விளக்கம்*: கையேடு பக்கத்தின் விளக்கம். இது பெயர் பிரிவில் பயன்படுத்தப்படுகிறது.

source: *authors*: A list of strings with authors, or a single string. Can be an empty string or list if you do not want to automatically generate an AUTHORS section in the manual page.
ta: *ஆசிரியர்கள்*: ஆசிரியர்களுடன் சரங்களின் பட்டியல், அல்லது ஒரு சரம். கையேடு பக்கத்தில் ஆசிரியர்கள் பிரிவை தானாக உருவாக்க விரும்பவில்லை என்றால் வெற்று சரம் அல்லது பட்டியலாக இருக்கலாம்.

source: *section*: The manual page section. Used for the output file name as well as in the manual page header.
ta: *பிரிவு*: கையேடு பக்க பிரிவு. வெளியீட்டு கோப்பு பெயருக்கும் கையேடு பக்க தலைப்பிலும் பயன்படுத்தப்படுகிறது.

source: If true, add URL addresses after links. Default is ``False``.
ta: உண்மை என்றால், இணைப்புகளுக்குப் பிறகு முகவரி முகவரிகளைச் சேர்க்கவும். இயல்புநிலை `` பொய்``.

source: Options for Texinfo output
ta: டெக்சின்ஃபோ வெளியீட்டிற்கான விருப்பங்கள்

source: These options influence Texinfo output.
ta: இந்த விருப்பங்கள் டெக்சின்ஃபோ வெளியீட்டை பாதிக்கின்றன.

source: This value determines how to group the document tree into Texinfo source files. It must be a list of tuples ``(startdocname, targetname, title, author, dir_entry, description, category, toctree_only)``, where the items are:
ta: இந்த மதிப்பு ஆவண மரத்தை டெக்சின்ஃபோ மூல கோப்புகளாக எவ்வாறு தொகுத்தல் என்பதை தீர்மானிக்கிறது. இது டூப்சின் பட்டியலாக இருக்க வேண்டும் `` (ச்டார்ட் டோக் பெயர், இலக்கு பெயர், தலைப்பு, ஆசிரியர், டிர்_என்ட்ரி, விளக்கம், வகை, டோக்ட்ரீ_ஓஎன்எல்) ``, உருப்படிகள்:

source: *startdocname*: document name that is the "root" of the Texinfo file. All documents referenced by it in TOC trees will be included in the Texinfo file too. (If you want only one Texinfo file, use your :confval:`master_doc` here.)
ta: *startdocname*: டெக்சின்ஃபோ கோப்பின் "ரூட்" என்ற ஆவண பெயர். toc மரங்களில் குறிப்பிடப்பட்ட அனைத்து ஆவணங்களும் டெக்சின்ஃபோ கோப்பிலும் சேர்க்கப்படும். .

source: *targetname*: file name (no extension) of the Texinfo file in the output directory.
ta: *இலக்கு பெயர்*: வெளியீட்டு கோப்பகத்தில் டெக்சின்ஃபோ கோப்பின் கோப்பு பெயர் (நீட்டிப்பு இல்லை).

source: *title*: Texinfo document title. Can be empty to use the title of the *startdoc*. Inserted as Texinfo markup, so special characters like @ and {} will need to be escaped to be inserted literally.
ta: *தலைப்பு*: டெக்சின்ஃபோ ஆவண தலைப்பு. *startdoc *இன் தலைப்பைப் பயன்படுத்த காலியாக இருக்கலாம். டெக்சின்ஃபோ மார்க்அப் என செருகப்பட்டதால், @ மற்றும் {} போன்ற சிறப்பு எழுத்துக்கள் உண்மையில் செருகப்பட வேண்டும்.

source: *author*: Author for the Texinfo document. Inserted as Texinfo markup. Use ``@*`` to separate multiple authors, as in: ``'John@*Sarah'``.
ta: *ஆசிரியர்*: டெக்சின்ஃபோ ஆவணத்திற்கான ஆசிரியர். டெக்சின்ஃபோ மார்க்அப்பாக செருகப்பட்டது. பல ஆசிரியர்களைப் பிரிக்க ``@*`` பயன்படுத்தவும்: `` 'சான்@*சாரா'```.

source: *dir_entry*: The name that will appear in the top-level ``DIR`` menu file.
ta: *dir_entry*: உயர்மட்ட `` dir`` பட்டியல் கோப்பில் தோன்றும் பெயர்.

source: *description*: Descriptive text to appear in the top-level ``DIR`` menu file.
ta: *விளக்கம்*: மேல்-நிலை `` dir`` பட்டியல் கோப்பில் தோன்றும் விளக்க உரை.

source: *category*: Specifies the section which this entry will appear in the top-level ``DIR`` menu file.
ta: *வகை*: இந்த நுழைவு மேல்-நிலை `` dir`` பட்டியல் கோப்பில் தோன்றும் பகுதியைக் குறிப்பிடுகிறது.

source: *toctree_only*: Must be ``True`` or ``False``. If true, the *startdoc* document itself is not included in the output, only the documents referenced by it via TOC trees. With this option, you can put extra stuff in the master document that shows up in the HTML, but not the Texinfo output.
ta: *toctree_only*: `` உண்மை`` அல்லது `` தவறு`` ஆக இருக்க வேண்டும். உண்மை என்றால், * startdoc * ஆவணம் வெளியீட்டில் சேர்க்கப்படவில்லை, toc மரங்கள் வழியாக குறிப்பிடப்பட்ட ஆவணங்கள் மட்டுமே. இந்த விருப்பத்துடன், நீங்கள் html இல் காண்பிக்கப்படும் முதன்மை ஆவணத்தில் கூடுதல் விசயங்களை வைக்கலாம், ஆனால் டெக்சின்ஃபோ வெளியீடு அல்ல.

source: Control how to display URL addresses.
ta: முகவரி முகவரிகளை எவ்வாறு காண்பிப்பது என்பதைக் கட்டுப்படுத்தவும்.

source: ``'footnote'`` -- display URLs in footnotes (default)
ta: `` '' '`` - முகவரி களை அடிக்குறிப்புகளில் காண்பி (இயல்புநிலை)

source: The name of the default :doc:`domain </usage/restructuredtext/domains>`. Can also be ``None`` to disable a default domain. The default is ``'py'``. Those objects in other domains (whether the domain name is given explicitly, or selected by a :rst:dir:`default-domain` directive) will have the domain name explicitly prepended when named (e.g., when the default domain is C, Python functions will be named "Python function", not just "function").
ta: இயல்புநிலையின் பெயர்: டிஓசி: `டொமைன் </பயன்பாடு/மறுசீரமைப்பு டெக்ச்ட்/களங்கள்>`. இயல்புநிலை களத்தை முடக்க `` எதுவுமில்லை`. இயல்புநிலை `` 'பை'``. மற்ற களங்களில் உள்ள அந்த பொருள்கள் (டொமைன் பெயர் வெளிப்படையாக வழங்கப்பட்டதா, அல்லது ஒரு: rst: dir: `இயல்புநிலை-டொமைன்` டைரெக்டிவ்) பெயரிடும்போது டொமைன் பெயர் வெளிப்படையாக தயாரிக்கப்படும் (எ.கா., இயல்புநிலை டொமைன் சி, பைதான் ஆக இருக்கும்போது செயல்பாடுகளுக்கு "பைதான் செயல்பாடு" என்று பெயரிடப்படும், "செயல்பாடு" மட்டுமல்ல).

source: If true, do not generate a ``@detailmenu`` in the "Top" node's menu containing entries for each sub-node in the document. Default is ``False``.
ta: உண்மை என்றால், ஆவணத்தில் ஒவ்வொரு துணை முனைக்கும் உள்ளீடுகளைக் கொண்ட "மேல்" முனையின் பட்டியலில் `@@@விவரம் மெனு`` உருவாக்க வேண்டாம். இயல்புநிலை `` பொய்``.

source: A dictionary that contains Texinfo snippets that override those Sphinx usually puts into the generated ``.texi`` files.
ta: அந்த ச்பிங்க்சை மேலெழுதும் டெக்சின்ஃபோ துணுக்குகளைக் கொண்ட ஒரு அகராதி வழக்கமாக உருவாக்கப்பட்ட `.texi`` கோப்புகளில் வைக்கிறது.

source: Number of spaces to indent the first line of each paragraph, default ``2``. Specify ``0`` for no indentation.
ta: ஒவ்வொரு பத்தியின் முதல் வரியையும் உள்தள்ளுவதற்கான இடைவெளிகளின் எண்ணிக்கை, இயல்புநிலை `` 2``. உள்தள்ளல் இல்லை என்று `` 0`` ஐக் குறிப்பிடவும்.

source: ``'paragraphindent'``
ta: `` 'பத்தி

source: Number of spaces to indent the lines for examples or literal blocks, default ``4``. Specify ``0`` for no indentation.
ta: எடுத்துக்காட்டுகள் அல்லது நேரடி தொகுதிகளுக்கான கோடுகளை உள்தள்ளுவதற்கான இடைவெளிகளின் எண்ணிக்கை, இயல்புநிலை `` 4``. உள்தள்ளல் இல்லை என்று `` 0`` ஐக் குறிப்பிடவும்.

source: ``'exampleindent'``
ta: `` 'எடுத்துக்காட்டு

source: Texinfo markup inserted near the beginning of the file.
ta: கோப்பின் தொடக்கத்தில் டெக்சின்ஃபோ மார்க்அப் செருகப்பட்டது.

source: Texinfo markup inserted within the ``@copying`` block and displayed after the title. The default value consists of a simple title page identifying the project.
ta: டெக்சின்ஃபோ மார்க்அப் `` `@நகலெடுக்கும்`` தொகுதிக்குள் செருகப்பட்டு தலைப்புக்குப் பிறகு காட்டப்படும். இயல்புநிலை மதிப்பு திட்டத்தை அடையாளம் காணும் எளிய தலைப்புப் பக்கத்தைக் கொண்டுள்ளது.

source: ``'copying'``
ta: `` 'நகலெடுப்பது'``

source: ``'author'`` ``'body'`` ``'date'`` ``'direntry'`` ``'filename'`` ``'project'`` ``'release'`` ``'title'``
ta: `'' எழுத்தாளர் '` ``' '`` ``' '`` `' '' '` `' '` `' '` ``' `` '``' `` `' `'தலைப்பு'``

source: Options for QtHelp output
ta: qthelp வெளியீட்டிற்கான விருப்பங்கள்

source: These options influence qthelp output. As this builder derives from the HTML builder, the HTML options also apply where appropriate.
ta: இந்த விருப்பங்கள் qthelp வெளியீட்டை பாதிக்கின்றன. இந்த பில்டர் html பில்டரிடமிருந்து பெறப்பட்டதால், html விருப்பங்களும் பொருத்தமான இடங்களில் பொருந்தும்.

source: The basename for the qthelp file. It defaults to the :confval:`project` name.
ta: qthelp கோப்பிற்கான அடிப்படை பெயர். இது இயல்புநிலை: confval: `project` பெயர்.

source: The namespace for the qthelp file. It defaults to ``org.sphinx.<project_name>.<project_version>``.
ta: qthelp கோப்பிற்கான பெயர்வெளி. இது `` org.sphinx க்கு இயல்புநிலையாகிறது.

source: The HTML theme for the qthelp output. This defaults to ``'nonav'``.
ta: qthelp வெளியீட்டிற்கான html தீம். இது `` 'nonav'`` க்கு இயல்புநிலையாகும்.

source: Options for the linkcheck builder
ta: லிங்க்செக் பில்டருக்கான விருப்பங்கள்

source: A list of regular expressions that match URIs that should not be checked when doing a ``linkcheck`` build. Example::
ta: `` லிங்க்செக்`` உருவாக்கும்போது சரிபார்க்கப்படாத uris உடன் பொருந்தக்கூடிய வழக்கமான வெளிப்பாடுகளின் பட்டியல். உதாரணமாக::

source: The number of times the linkcheck builder will attempt to check a URL before declaring it broken. Defaults to 1 attempt.
ta: லிங்க்செக் பில்டர் எத்தனை முறை முகவரி ஐ உடைத்ததாக அறிவிப்பதற்கு முன்பு சரிபார்க்க முயற்சிக்கும். இயல்புநிலை 1 முயற்சிக்கு.

source: A timeout value, in seconds, for the linkcheck builder. The default is to use Python's global socket timeout.
ta: ஒரு காலக்கெடு மதிப்பு, நொடிகளில், லிங்க்செக் பில்டருக்கு. இயல்புநிலை பைத்தானின் உலகளாவிய சாக்கெட் காலக்கெடுவைப் பயன்படுத்துவதாகும்.

source: The number of worker threads to use when checking links. Default is 5 threads.
ta: இணைப்புகளைச் சரிபார்க்கும்போது பயன்படுத்த வேண்டிய தொழிலாளர் நூல்களின் எண்ணிக்கை. இயல்புநிலை 5 நூல்கள்.

source: If true, check the validity of ``#anchor``\ s in links. Since this requires downloading the whole document, it's considerably slower when enabled. Default is ``True``.
ta: உண்மை என்றால், இணைப்புகளில் ``#நங்கூரம்` \ s இன் செல்லுபடியை சரிபார்க்கவும். இதற்கு முழு ஆவணத்தையும் பதிவிறக்குவது தேவைப்படுவதால், இயக்கப்பட்டபோது இது கணிசமாக மெதுவாக இருக்கும். இயல்புநிலை `` உண்மை``.

source: A list of regular expressions that match URIs that should skip checking the validity of anchors in links. This allows skipping entire sites, where anchors are used to control dynamic pages, or just specific anchors within a page, where javascript is used to add anchors dynamically, or use the fragment as part of to trigger an internal REST request. Default is ``["/#!"]``.
ta: இணைப்புகளில் உள்ள நங்கூரங்களின் செல்லுபடியை சரிபார்ப்பதைத் தவிர்க்க வேண்டிய uris உடன் பொருந்தக்கூடிய வழக்கமான வெளிப்பாடுகளின் பட்டியல். இது முழு தளங்களையும் தவிர்க்க அனுமதிக்கிறது, அங்கு நங்கூரர்கள் மாறும் பக்கங்களைக் கட்டுப்படுத்தப் பயன்படுத்தப்படுகின்றன, அல்லது ஒரு பக்கத்திற்குள் குறிப்பிட்ட நங்கூரர்கள், அங்கு சாவாச்கிரிப்ட் நங்கூரங்களை மாறும் வகையில் சேர்க்கப் பயன்படுகிறது, அல்லது உள் ஓய்வு கோரிக்கையைத் தூண்டுவதற்கான ஒரு பகுதியாக துண்டைப் பயன்படுத்தவும். இயல்புநிலை `` ["/#!"] ``.

source: The name of a reST role (builtin or Sphinx extension) to use as the default role, that is, for text marked up ```like this```. This can be set to ``'py:obj'`` to make ```filter``` a cross-reference to the Python function "filter". The default is ``None``, which doesn't reassign the default role.
ta: இயல்புநிலை பாத்திரமாகப் பயன்படுத்த, ஓய்வு பாத்திரத்தின் பெயர் (பில்டின் அல்லது ச்பின்க்ச் நீட்டிப்பு), அதாவது, `` இது போன்றவற்றைப் போல குறிக்கப்பட்ட உரைக்கு. இதை `` `வடிகட்டி``` பைதான் செயல்பாடு" வடிகட்டி "க்கு குறுக்கு குறிப்பை உருவாக்க` `'py: obj'`` என அமைக்கலாம். இயல்புநிலை `` எதுவுமில்லை``, இது இயல்புநிலை பாத்திரத்தை மீண்டும் வகுக்காது.

source: Options for the XML builder
ta: எக்ச்எம்எல் பில்டருக்கான விருப்பங்கள்

source: If true, pretty-print the XML. Default is ``True``.
ta: உண்மை என்றால், எக்ச்எம்எல் அழகாக அச்சிடுங்கள். இயல்புநிலை `` உண்மை``.

source: Footnotes
ta: அடிக்குறிப்புகள்

source: A note on available globbing syntax: you can use the standard shell constructs ``*``, ``?``, ``[...]`` and ``[!...]`` with the feature that these all don't match slashes. A double star ``**`` can be used to match any sequence of characters *including* slashes.
ta: கிடைக்கக்கூடிய குளோபிங் தொடரியல் பற்றிய குறிப்பு: நீங்கள் நிலையான செல் கட்டமைப்பதைப் பயன்படுத்தலாம் ``*``, ``? இவை அனைத்தும் குறைப்புகளுடன் பொருந்தவில்லை. *ச்லாச்கள் உட்பட எழுத்துக்களின் எந்தவொரு வரிசையையும் பொருத்த இரட்டை விண்மீன் `` ** `` பயன்படுத்தப்படலாம்.

source: The configuration file is executed as Python code at build time (using :func:`execfile`, and with the current directory set to its containing directory), and therefore can execute arbitrarily complex code. Sphinx then reads simple names from the file's namespace as its configuration.
ta: கட்டமைப்பு கோப்பு பில்ட் நேரத்தில் பைதான் குறியீடாக செயல்படுத்தப்படுகிறது (பயன்படுத்துதல்: func: `execfile`, மற்றும் தற்போதைய கோப்பகத்துடன் அதன் அடக்கிக்கு அமைக்கப்பட்டுள்ளது), எனவே தன்னிச்சையாக சிக்கலான குறியீட்டை இயக்க முடியும். ச்பிங்க்ச் பின்னர் கோப்பின் பெயர்வெளியில் இருந்து எளிய பெயர்களை அதன் உள்ளமைவாகப் படிக்கிறது.

source: Options for the C++ domain
ta: சி++ களத்திற்கான விருப்பங்கள்

source: A list of prefixes that will be ignored when sorting C++ objects in the global index. For example ``['awesome_lib::']``.
ta: உலகளாவிய குறியீட்டில் சி++ பொருள்களை வரிசைப்படுத்தும்போது புறக்கணிக்கப்படும் முன்னொட்டுகளின் பட்டியல். உதாரணமாக `` ['parent_lib ::'] ``.

source: A list of strings that the parser additionally should accept as attributes. This can for example be used when attributes have been ``#define`` d for portability.
ta: பாகுபடுத்தி கூடுதலாக பண்புகளாக ஏற்றுக்கொள்ள வேண்டிய சரங்களின் பட்டியல். பண்புக்கூறுகள் பெயர்வுத்திறனுக்காக ``#வரையறுத்தல்` d ஆக இருக்கும்போது இதைப் பயன்படுத்தலாம்.

source: A list of strings that the parser additionally should accept as attributes with one argument. That is, if ``my_align_as`` is in the list, then ``my_align_as(X)`` is parsed as an attribute for all strings ``X`` that have balanced brances (``()``, ``[]``, and ``{}``). This can for example be used when attributes have been ``#define`` d for portability.
ta: பாகுபடுத்தி கூடுதலாக ஒரு வாதத்துடன் பண்புகளாக ஏற்றுக்கொள்ள வேண்டிய சரங்களின் பட்டியல். அதாவது, `` my_align_as``` பட்டியலில் இருந்தால், `` my_align_as (x) `` `` `()` () ``, `` [] ``, மற்றும் `` {} ``). பண்புக்கூறுகள் பெயர்வுத்திறனுக்காக ``#வரையறுத்தல்` d ஆக இருக்கும்போது இதைப் பயன்படுத்தலாம்.

source: Example of configuration file
ta: உள்ளமைவு கோப்பின் எடுத்துக்காட்டு

source: The default role can always be set within individual documents using the standard reST :rst:dir:`default-role` directive.
ta: இயல்புநிலை பங்கு எப்போதும் நிலையான ஓய்வு: rst: dir: `இயல்புநிலை-பங்கு` கட்டளை ஆகியவற்றைப் பயன்படுத்தி தனிப்பட்ட ஆவணங்களுக்குள் அமைக்கப்படலாம்.

source: If true, keep warnings as "system message" paragraphs in the built documents. Regardless of this setting, warnings are always written to the standard error stream when ``sphinx-build`` is run.
ta: உண்மை என்றால், எச்சரிக்கைகளை கட்டப்பட்ட ஆவணங்களில் "கணினி செய்தி" பத்திகளாக வைத்திருங்கள். இந்த அமைப்பைப் பொருட்படுத்தாமல், `` ச்பின்க்ச்-பில்ட்`` இயக்கப்படும்போது எச்சரிக்கைகள் எப்போதும் நிலையான பிழை ச்ட்ரீமுக்கு எழுதப்படும்.

source: The default is ``False``, the pre-0.5 behavior was to always keep them.
ta: இயல்புநிலை `` தவறு``, 0.5 க்கு முந்தைய நடத்தை எப்போதும் அவற்றை வைத்திருப்பதுதான்.

source: A list of warning types to suppress arbitrary warning messages.
ta: தன்னிச்சையான எச்சரிக்கை செய்திகளை அடக்க எச்சரிக்கை வகைகளின் பட்டியல்.

source: Sphinx supports following warning types:
ta: எச்சரிக்கை வகைகளைத் தொடர்ந்து சூரரிமாச்சிலை ஆதரிக்கிறது:

source: You can choose from these types.
ta: இந்த வகைகளிலிருந்து நீங்கள் தேர்வு செய்யலாம்.

source: Now, this option should be considered *experimental*.
ta: இப்போது, இந்த விருப்பத்தை *சோதனை *கருத வேண்டும்.

source: Important points to note:
ta: கவனிக்க வேண்டிய முக்கியமான புள்ளிகள்:
