Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_extdev--logging_*.po
Languages: ta

source: For example::
ta: உதாரணத்திற்கு::

source: LoggerAdapter allowing ``type`` and ``subtype`` keywords.
ta: `` type`` மற்றும் `` துணை வகை`` முக்கிய வார்த்தைகளை அனுமதிக்கும் loggeradapter.

source: Get logger wrapped by :class:`sphinx.util.logging.SphinxLoggerAdapter`.
ta: லாகர் மூடப்பட்டிருக்கும்: வகுப்பு: `sphinx.util.logging.sphinxloggeradapter`.

source: Sphinx logger always uses ``sphinx.*`` namespace to be independent from settings of root logger. It ensures logging is consistent even if a third-party extension or imported application resets logger settings.
ta: ச்பின்க்ச் லாகர் எப்போதும் `` ச்பின்க்சைப் பயன்படுத்துகிறார். மூன்றாம் தரப்பு நீட்டிப்பு அல்லது இறக்குமதி செய்யப்பட்ட பயன்பாடு லாகர் அமைப்புகளை மீட்டமைத்தாலும் கூட உள்நுழைவு சீரானது என்பதை இது உறுதி செய்கிறது.

source: Example usage::
ta: எடுத்துக்காட்டு பயன்பாடு ::

source: Context manager to postpone logging all logs temporarily.
ta: அனைத்து பதிவுகளையும் தற்காலிகமாக பதிவு செய்வதை ஒத்திவைக்க சூழல் மேலாளர்.

source: Context manager to postpone logging warnings temporarily.
ta: பதிவு எச்சரிக்கைகளை தற்காலிகமாக ஒத்திவைக்க சூழல் மேலாளர்.

source: Similar to :func:`pending_logging`.
ta: ஒத்த: func: `நிலுவையில் உள்ளது_ லோகிங்`.

source: Context manager to prepend prefix to all warning log records temporarily.
ta: அனைத்து எச்சரிக்கை பதிவு பதிவுகளுக்கும் முன்னொட்டு தயாரிக்க சூழல் மேலாளர் தற்காலிகமாக.

source: Logs a message on this logger with the specified level. Basically, the arguments are as with python's logging module.
ta: இந்த லாகரில் ஒரு செய்தியை குறிப்பிட்ட மட்டத்துடன் பதிவுசெய்கிறது. அடிப்படையில், வாதங்கள் பைத்தானின் பதிவு தொகுதி போன்றவை.

source: In addition, Sphinx logger supports following keyword arguments:
ta: கூடுதலாக, ச்பிங்க்ச் லாகர் பின்வரும் முக்கிய வாதங்களை ஆதரிக்கிறது:

source: Categories of warning logs. It is used to suppress warnings by :confval:`suppress_warnings` setting.
ta: எச்சரிக்கை பதிவுகளின் வகைகள். எச்சரிக்கைகளை அடக்குவதற்கு இது பயன்படுகிறது: confval: `அடக்கி_வார்சிங்ச்` அமைப்பு.

source: **type**, ***subtype***
ta: ** வகை **, *** துணை வகை ***

source: Where the warning happened. It is used to include the path and line number in each log. It allows docname, tuple of docname and line number and nodes::
ta: எச்சரிக்கை நடந்த இடம். ஒவ்வொரு பதிவிலும் பாதை மற்றும் வரி எண்ணை சேர்க்க இது பயன்படுகிறது. இது டாக்நேம், டூப்பிள் ஆஃப் டாக்நேம் மற்றும் வரி எண் மற்றும் முனைகளை அனுமதிக்கிறது ::

source: **location**
ta: ** இடம் **

source: The color of logs. By default, error level logs are colored as ``"darkred"``, critical level ones is not colored, and warning level ones are colored as ``"red"``.
ta: பதிவுகளின் நிறம். இயல்பாக, பிழை நிலை பதிவுகள் `` "இருண்ட" `` `, முக்கியமான நிலை வண்ணமயமானவை அல்ல, மேலும் எச்சரிக்கை நிலை` `" சிவப்பு "` `என வண்ணமயமாக்கப்படுகிறது.

source: **color**
ta: **நிறம்**

source: Logging API
ta: பதிவு பநிஇ

source: Logs a message to this logger with the specified level. Basically, the arguments are as with python's logging module.
ta: குறிப்பிட்ட மட்டத்துடன் இந்த லாகருக்கு ஒரு செய்தியை உள்நுழைகிறது. அடிப்படையில், வாதங்கள் பைத்தானின் பதிவு தொகுதி போன்றவை.

source: If true, the logger does not fold lines at the end of the log message. The default is ``False``.
ta: உண்மை என்றால், பதிவு செய்தியின் முடிவில் லாகர் கோடுகளை மடிக்காது. இயல்புநிலை `` தவறு``.

source: Where the message emitted. For more detail, see :meth:`SphinxLoggerAdapter.warning`.
ta: செய்தி உமிழப்படும் இடத்தில். மேலும் விவரங்களுக்கு, காண்க: மெத்: `ச்பின்க்ச் loggeradapter.warning`.

source: The color of logs. By default, info and verbose level logs are not colored, and debug level ones are colored as ``"darkgray"``.
ta: பதிவுகளின் நிறம். இயல்பாக, செய்தி மற்றும் வாய்மொழி நிலை பதிவுகள் வண்ணமயமானவை அல்ல, மேலும் பிழைத்திருத்த நிலை `` "டார்க் கிரே" `` என வண்ணமயமாக்கப்படுகிறது.
