Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_config_*.po
Languages: ta

source: ``hr`` -- Croatian
ta: `` hr`` - குரோசிய

source: ``id`` -- Indonesian
ta: `` ஐடி`` - இந்தோனேசிய

source: ``ko`` -- Korean
ta: `` கோ`` - கொரிய

source: ``lt`` -- Lithuanian
ta: `` lt`` - லிதுவேனியன்

source: ``lv`` -- Latvian
ta: `` lv`` - லாட்வியன்

source: ``mk`` -- Macedonian
ta: `` mk`` - மாசிடோனியன்

source: ``nb_NO`` -- Norwegian Bokmal
ta: `` nb_no`` - நோர்வே போக்மால்

source: ``ne`` -- Nepali
ta: `` ne`` - நேபாளி

source: ``pl`` -- Polish
ta: `` pl`` - போலந்து

source: ``pt_BR`` -- Brazilian Portuguese
ta: `` pt_br`` - பிரேசிலிய போர்த்துகீசியம்

source: ``pt_PT`` -- European Portuguese
ta: `` pt_pt`` - ஐரோப்பிய போர்த்துகீசியம்

source: ``si`` -- Sinhala
ta: `` si`` - சிங்களம்

source: ``sk`` -- Slovak
ta: `` எச்.கே`` - ச்லோவாக்

source: ``sl`` -- Slovenian
ta: `` sl`` - ச்லோவேனியன்

source: ``uk_UA`` -- Ukrainian
ta: `` uk_ua`` - உக்ரேனிய

source: ``vi`` -- Vietnamese
ta: `` vi`` - வியட்நாமிய

source: ``zh_CN`` -- Simplified Chinese
ta: `` zh_cn`` - எளிமைப்படுத்தப்பட்ட சீன

source: ``zh_TW`` -- Traditional Chinese
ta: `` zh_tw`` - பாரம்பரிய சீன

source: Directories in which to search for additional message catalogs (see :confval:`language`), relative to the source directory. The directories on this path are searched by the standard :mod:`gettext` module.
ta: கூடுதல் செய்தி பட்டியல்களைத் தேட வேண்டிய கோப்பகங்கள் (பார்க்க: confval: `மொழி`), மூல கோப்பகத்துடன் தொடர்புடையது. இந்த பாதையில் உள்ள கோப்பகங்கள் தரநிலையால் தேடப்படுகின்றன: mod: `gettext` தொகுதி.

source: Internal messages are fetched from a text domain of ``sphinx``; so if you add the directory :file:`./locale` to this setting, the message catalogs (compiled from ``.po`` format using :program:`msgfmt`) must be in :file:`./locale/{language}/LC_MESSAGES/sphinx.mo`. The text domain of individual documents depends on :confval:`gettext_compact`.
ta: `` ச்பின்க்ச்`` இன் உரை களத்திலிருந்து உள் செய்திகள் பெறப்படுகின்றன; எனவே நீங்கள் கோப்பகத்தை சேர்த்தால்: கோப்பு: `./லோகேல்` இந்த அமைப்பிற்கு, செய்தி பட்டியல்கள் (` `.போ`` வடிவத்திலிருந்து தொகுக்கப்பட்டுள்ளன: நிரல்:` msgfmt`) இருக்க வேண்டும்: கோப்பு: `./locale/ {மொழி}/lc_messages/sphinx.mo`. தனிப்பட்ட ஆவணங்களின் உரை களம் சார்ந்துள்ளது: confval: `gettext_compact`.

source: A list of strings that are module names of :ref:`extensions`. These can be extensions coming with Sphinx (named ``sphinx.ext.*``) or custom ones.
ta: இதன் தொகுதி பெயர்களாக இருக்கும் சரங்களின் பட்டியல்: குறிப்பு: `நீட்டிப்புகள்`. இவை ச்பிங்க்ச் (`` sphinx.ext.*``) அல்லது தனிப்பயன் என பெயரிடப்பட்ட நீட்டிப்புகளாக இருக்கலாம்.

source: The default is ``['locales']``.
ta: இயல்புநிலை `` ['இடங்கள்'] ``.

source: Use ``locales`` directory as a default value
ta: இயல்புநிலை மதிப்பாக `` இடங்கள்` கோப்பகத்தைப் பயன்படுத்தவும்

source: If true, a document's text domain is its docname if it is a top-level project file and its very base directory otherwise.
ta: உண்மை என்றால், ஒரு ஆவணத்தின் உரை டொமைன் அதன் ஆவண பெயர், அது ஒரு உயர்மட்ட திட்டக் கோப்பு மற்றும் இல்லையெனில் அதன் அடிப்படை கோப்பகமாக இருந்தால்.

source: By default, the document ``markup/code.rst`` ends up in the ``markup`` text domain. With this option set to ``False``, it is ``markup/code``.
ta: இயல்பாக, ஆவணம் `` markup/code.rst`` `` மார்க்அப்` உரை களத்தில் முடிகிறது. இந்த விருப்பம் `` false`` என அமைக்கப்பட்டவுடன், இது `` மார்க்அப்/குறியீடு``.

source: If true, Sphinx generates uuid information for version tracking in message catalogs. It is used for:
ta: உண்மை என்றால், செய்தி பட்டியலில் பதிப்பு கண்காணிப்புக்கான uuid தகவல்களை சூரரிமாச்சிலை உருவாக்குகிறது. இது பயன்படுத்தப்படுகிறது:

source: Add uid line for each msgids in .pot files.
ta: .pot கோப்புகளில் ஒவ்வொரு msgids க்கும் uid வரியைச் சேர்க்கவும்.

source: Calculate similarity between new msgids and previously saved old msgids. This calculation takes a long time.
ta: புதிய msgid களுக்கும் முன்னர் சேமிக்கப்பட்ட பழைய msgid களுக்கும் இடையிலான ஒற்றுமையைக் கணக்கிடுங்கள். இந்த கணக்கீடு நீண்ட நேரம் எடுக்கும்.

source: If you want to accelerate the calculation, you can use ``python-levenshtein`` 3rd-party package written in C by using :command:`pip install python-levenshtein`.
ta: நீங்கள் கணக்கீட்டை விரைவுபடுத்த விரும்பினால், நீங்கள் `` பைதான்-லெவன்ச்டீன்`` 3 வது தரப்பு தொகுப்பைப் பயன்படுத்தலாம்: கட்டளை: `பிப் நிறுவவும் பைதான்-லெவன்ச்டைன்`.

source: The default is ``False``.
ta: இயல்புநிலை `` தவறு``.

source: Note that you can extend :data:`sys.path` within the conf file if your extensions live in another directory -- but make sure you use absolute paths. If your extension path is relative to the :term:`configuration directory`, use :func:`os.path.abspath` like so::
ta: நீங்கள் நீட்டிக்க முடியும் என்பதை நினைவில் கொள்க: தரவு: `sys.path` உங்கள் நீட்டிப்புகள் வேறொரு கோப்பகத்தில் வாழ்ந்தால் conf கோப்பில் - ஆனால் நீங்கள் முழுமையான பாதைகளைப் பயன்படுத்துவதை உறுதிசெய்க. உங்கள் நீட்டிப்பு பாதை: கால: `உள்ளமைவு அடைவு` உடன் தொடர்புடையதாக இருந்தால், பயன்படுத்தவும்: func:` os.path.abspath` அவ்வாறு ::

source: If true, Sphinx generates location information for messages in message catalogs.
ta: உண்மை என்றால், செய்தி பட்டியலில் உள்ள செய்திகளுக்கான இருப்பிட தகவல்களை சூரரிமாச்சிலை உருவாக்குகிறது.

source: The default is ``True``.
ta: இயல்புநிலை `` உண்மை``.

source: If true, Sphinx builds mo file for each translation catalog files.
ta: உண்மை என்றால், ஒவ்வொரு மொழிபெயர்ப்பு அட்டவணை கோப்புகளுக்கும் சூரரிமாச்சிலை mo கோப்பை உருவாக்குகிறது.

source: To specify names to enable gettext extracting and translation applying for i18n additionally. You can specify below names:
ta: கூடுதலாக ப18ல் க்கு விண்ணப்பிக்கும் உரைபெறு பிரித்தெடுத்தல் மற்றும் மொழிபெயர்ப்பை இயக்க பெயர்களைக் குறிப்பிட. பெயர்களுக்குக் கீழே குறிப்பிடலாம்:

source: index terms
ta: குறியீட்டு விதிமுறைகள்

source: literal blocks: ``::`` and ``code-block``.
ta: நேரடி தொகுதிகள்: `` :: `` மற்றும் `` கோட்-பிளாக்``.

source: doctest block
ta: ஆவணத் தொகுதி

source: raw content
ta: மூல உள்ளடக்கம்

source: image/figure uri and alt
ta: படம்/படம் யூரி மற்றும் ஆல்ட்

source: For example: ``gettext_additional_targets = ['literal-block', 'image']``.
ta: எடுத்துக்காட்டாக: `` gettext_additional_targets = ['நேரடி-தடுப்பு', 'படம்'] ``.

source: The default is ``[]``.
ta: இயல்புநிலை `` [] ``.

source: The filename format for language-specific figures. The default value is ``{root}.{language}{ext}``. It will be expanded to ``dirname/filename.en.png`` from ``.. image:: dirname/filename.png``. The available format tokens are:
ta: மொழி சார்ந்த புள்ளிவிவரங்களுக்கான கோப்பு பெயர் வடிவம். இயல்புநிலை மதிப்பு `` {ரூட்}. {மொழி} {ext} ``. இது `` `` tirname/filename.en.png` க்கு விரிவாக்கப்படும். கிடைக்கக்கூடிய வடிவமைப்பு டோக்கன்கள்:

source: ``{root}`` - the filename, including any path component, without the file extension, e.g. ``dirname/filename``
ta: `` {ரூட்} `` - கோப்பு நீட்டிப்பு இல்லாமல், எந்த பாதை கூறு உட்பட கோப்பு பெயர், எ.கா. `` dirname/filename``

source: ``{path}`` - the directory path component of the filename, with a trailing slash if non-empty, e.g. ``dirname/``
ta: `` {பாதை} `` - கோப்பு பெயரின் அடைவு பாதை கூறு, காலியாக இல்லாதிருந்தால், எ.கா. `` dirname/``

source: ``{basename}`` - the filename without the directory path or file extension components, e.g. ``filename``
ta: `` {அடிப்படை பெயர்} `` - அடைவு பாதை அல்லது கோப்பு நீட்டிப்பு கூறுகள் இல்லாமல் கோப்பு பெயர், எ.கா. `` கோப்பு பெயர்``

source: ``{ext}`` - the file extension, e.g. ``.png``
ta: `{ext}` ` - கோப்பு நீட்டிப்பு, எ.கா. `.png``

source: ``{language}`` - the translation language, e.g. ``en``
ta: `` {மொழி} `` - மொழிபெயர்ப்பு மொழி, எ.கா. `` en``

source: For example, setting this to ``{path}{language}/{basename}{ext}`` will expand to ``dirname/en/filename.png`` instead.
ta: எடுத்துக்காட்டாக, இதை அமைப்பது `` {பாதை {{மொழி}/{அடிப்படை பெயர்} {ext} `` அதற்கு பதிலாக `` dirname/en/filename.png`` க்கு விரிவடையும்.

source: Added ``{path}`` and ``{basename}`` tokens.
ta: `` {பாதை} `` மற்றும் `` {அடிப்படை பெயர்} `` டோக்கன்கள் சேர்க்கப்பட்டன.

source: Options for HTML output
ta: html வெளியீட்டிற்கான விருப்பங்கள்

source: These options influence HTML as well as HTML Help output, and other builders that use Sphinx's HTMLWriter class.
ta: இந்த விருப்பங்கள் html மற்றும் html உதவி வெளியீடு மற்றும் சூரரிமாச்சிலை இன் htmlwriter வகுப்பைப் பயன்படுத்தும் பிற பில்டர்களை பாதிக்கின்றன.

source: The "theme" that the HTML output should use. See the :doc:`section about theming <theming>`. The default is ``'alabaster'``.
ta: html வெளியீடு பயன்படுத்த வேண்டிய "தீம்". காண்க: டாக்: `தீமிங் <தீமிங்> பற்றிய பிரிவு` `. இயல்புநிலை `` 'அலபாச்டர்'```.

source: A list of paths that contain custom themes, either as subdirectories or as zip files. Relative paths are taken as relative to the configuration directory.
ta: தனிப்பயன் கருப்பொருள்களைக் கொண்ட பாதைகளின் பட்டியல், துணை அடைப்புகளாக அல்லது சிப் கோப்புகளாக. உறவினர் பாதைகள் உள்ளமைவு கோப்பகத்துடன் தொடர்புடையவை.

source: The style sheet to use for HTML pages. A file of that name must exist either in Sphinx's :file:`static/` path, or in one of the custom paths given in :confval:`html_static_path`. Default is the stylesheet given by the selected theme. If you only want to add or override a few things compared to the theme's stylesheet, use CSS ``@import`` to import the theme's stylesheet.
ta: html பக்கங்களுக்கு பயன்படுத்த பாணி தாள். அந்த பெயரின் கோப்பு ச்பின்க்சில் இருக்க வேண்டும்: கோப்பு: `நிலையான/` பாதை, அல்லது கொடுக்கப்பட்ட தனிப்பயன் பாதைகளில் ஒன்றில்: confval: `html_static_path`. இயல்புநிலை என்பது தேர்ந்தெடுக்கப்பட்ட கருப்பொருளால் வழங்கப்பட்ட ச்டைல்சீட் ஆகும். கருப்பொருள் ச்டைல்சீட்டுடன் ஒப்பிடும்போது சில விசயங்களை மட்டுமே நீங்கள் சேர்க்க விரும்பினால் அல்லது மேலெழுத விரும்பினால், கருப்பொருளின் ச்டைல்சீட்டை இறக்குமதி செய்ய css ``@இறக்குமதி`` ஐப் பயன்படுத்தவும்.

source: The "title" for HTML documentation generated with Sphinx's own templates. This is appended to the ``<title>`` tag of individual pages, and used in the navigation bar as the "topmost" element. It defaults to :samp:`'{<project>} v{<revision>} documentation'`.
ta: html ஆவணங்களுக்கான "தலைப்பு" சூரரிமாச்சிலை இன் சொந்த வார்ப்புருக்கள் மூலம் உருவாக்கப்பட்டது. இது தனிப்பட்ட பக்கங்களின் `` <itat> `` குறிச்சொல்லுடன் சேர்க்கப்பட்டுள்ளது, மேலும் வழிசெலுத்தல் பட்டியில் "டாப் மோச்ட்" உறுப்பாக பயன்படுத்தப்படுகிறது. இது இயல்புநிலையாகும்: samp: `'{<திட்டம்>} v {<திருத்தம்>} ஆவணங்கள்'``.

source: A shorter "title" for the HTML docs. This is used in for links in the header and in the HTML Help docs. If not given, it defaults to the value of :confval:`html_title`.
ta: html டாக்சிற்கான குறுகிய "தலைப்பு". தலைப்பிலும் html உதவி டாக்சிலும் உள்ள இணைப்புகளுக்கு இது பயன்படுத்தப்படுகிறது. வழங்கப்படாவிட்டால், இது மதிப்புக்கு இயல்புநிலையாகிறது: confval: `html_title`.

source: That way, you can load an extension called ``extname`` from the subdirectory ``sphinxext``.
ta: அந்த வகையில், துணை அடைவு `` sphinxext`` இலிருந்து `` extname`` எனப்படும் நீட்டிப்பை ஏற்றலாம்.

source: A dictionary of values to pass into the template engine's context for all pages. Single values can also be put in this dictionary using the :option:`-A <sphinx-build -A>` command-line option of ``sphinx-build``.
ta: அனைத்து பக்கங்களுக்கும் வார்ப்புரு இயந்திரத்தின் சூழலுக்குள் செல்ல மதிப்புகளின் அகராதி. இந்த அகராதியில் ஒற்றை மதிப்புகளை வைக்கலாம்: விருப்பத்தைப் பயன்படுத்தி: `-a <sphinx- கட்டளை -a>` `sphinx- கட்டளை` இன் கட்டளை-வரி விருப்பம்.

source: If given, this must be the name of an image file (path relative to the :term:`configuration directory`) that is the logo of the docs. It is placed at the top of the sidebar; its width should therefore not exceed 200 pixels. Default: ``None``.
ta: வழங்கப்பட்டால், இது ஒரு படக் கோப்பின் பெயராக இருக்க வேண்டும் (இது தொடர்புடையது: கால: `உள்ளமைவு அடைவு`) இது டாக்சின் சின்னமாகும். இது பக்கப்பட்டியின் மேற்புறத்தில் வைக்கப்படுகிறது; எனவே அதன் அகலம் 200 பிக்சல்களை தாண்டக்கூடாது. இயல்புநிலை: `` எதுவுமில்லை``.

source: The image file will be copied to the ``_static`` directory of the output HTML, but only if the file does not already exist there.
ta: படக் கோப்பு வெளியீட்டு html இன் `` _static`` கோப்பகத்திற்கு நகலெடுக்கப்படும், ஆனால் கோப்பு ஏற்கனவே அங்கு இல்லையென்றால் மட்டுமே.

source: If given, this must be the name of an image file (path relative to the :term:`configuration directory`) that is the favicon of the docs. Modern browsers use this as the icon for tabs, windows and bookmarks. It should be a Windows-style icon file (``.ico``), which is 16x16 or 32x32 pixels large. Default: ``None``.
ta: வழங்கப்பட்டால், இது ஒரு படக் கோப்பின் பெயராக இருக்க வேண்டும் (பாதை: கால: `உள்ளமைவு அடைவு`) இது டாக்சின் ஃபேவிகான் ஆகும். நவீன உலாவிகள் இதை தாவல்கள், சாளரங்கள் மற்றும் புக்மார்க்குகளுக்கான ஐகானாக பயன்படுத்துகின்றன. இது சாளரங்கள் பாணி ஐகான் கோப்பாக (`` .ico``) இருக்க வேண்டும், இது 16x16 அல்லது 32x32 படப்புள்ளிகள் பெரியது. இயல்புநிலை: `` எதுவுமில்லை``.

source: The configuration file itself can be an extension; for that, you only need to provide a :func:`setup` function in it.
ta: உள்ளமைவு கோப்பு ஒரு நீட்டிப்பாக இருக்கலாம்; அதற்காக, நீங்கள் ஒரு: func: `setup` செயல்பாட்டை மட்டுமே வழங்க வேண்டும்.

source: A list of CSS files. The entry must be a *filename* string or a tuple containing the *filename* string and the *attributes* dictionary. The *filename* must be relative to the :confval:`html_static_path`, or a full URI with scheme like ``http://example.org/style.css``. The *attributes* is used for attributes of ``<link>`` tag. It defaults to an empty list.
ta: css கோப்புகளின் பட்டியல். நுழைவு ஒரு * கோப்பு பெயர் * சரம் அல்லது * கோப்பு பெயர் * சரம் மற்றும் * பண்புக்கூறுகள் * அகராதி ஆகியவற்றைக் கொண்ட ஒரு டப்பிள் ஆக இருக்க வேண்டும். * கோப்பு பெயர் *: confval: `html_static_path`, அல்லது` `http: // example.org/style.css`` போன்ற திட்டத்துடன் கூடிய முழு uri உடன் தொடர்புடையதாக இருக்க வேண்டும். * பண்புக்கூறுகள் * `` <இணைப்பு> `` குறிச்சொல்லின் பண்புகளுக்கு பயன்படுத்தப்படுகின்றன. இது வெற்று பட்டியலுக்கு இயல்புநிலையாகிறது.

source: A list of paths that contain custom static files (such as style sheets or script files). Relative paths are taken as relative to the configuration directory. They are copied to the output's :file:`_static` directory after the theme's static files, so a file named :file:`default.css` will overwrite the theme's :file:`default.css`.
ta: தனிப்பயன் நிலையான கோப்புகளைக் கொண்ட பாதைகளின் பட்டியல் (ச்டைல் தாள்கள் அல்லது ச்கிரிப்ட் கோப்புகள் போன்றவை). உறவினர் பாதைகள் உள்ளமைவு கோப்பகத்துடன் தொடர்புடையவை. அவை வெளியீட்டில் நகலெடுக்கப்படுகின்றன: கோப்பு: `_static` அடைவு கருப்பொருள் நிலையான கோப்புகளுக்குப் பிறகு, எனவே பெயரிடப்பட்ட கோப்பு: கோப்பு:` default.css` தீம்: கோப்பு: `default.css` ஐ மேலெழுதும்.

source: For security reason, dotfiles under ``html_static_path`` will not be copied. If you'd like to copy them intentionally, please add them each filepath to this setting::
ta: பாதுகாப்பு காரணத்திற்காக, `` html_static_path`` இன் கீழ் டாட்ஃபைல்கள் நகலெடுக்கப்படாது. நீங்கள் வேண்டுமென்றே அவற்றை நகலெடுக்க விரும்பினால், தயவுசெய்து அவற்றை ஒவ்வொரு ஃபைல்பாத்தையும் இந்த அமைப்பில் சேர்க்கவும் ::

source: Another way to do that, you can also use :confval:`html_extra_path`. It allows to copy dotfiles under the directories.
ta: அதைச் செய்வதற்கான மற்றொரு வழி, நீங்கள் பயன்படுத்தலாம்: confval: `html_extra_path`. கோப்பகங்களின் கீழ் டாட்ஃபைல்களை நகலெடுக்க இது அனுமதிக்கிறது.

source: The paths in :confval:`html_static_path` can now contain subdirectories.
ta: உள்ள பாதைகள்: confval: `html_static_path` இப்போது துணை அடைவுகளைக் கொண்டிருக்கலாம்.

source: The entries in :confval:`html_static_path` can now be single files.
ta: உள்ளீடுகள்: confval: `html_static_path` இப்போது ஒற்றை கோப்புகளாக இருக்கலாம்.

source: The file extensions of source files. Sphinx considers the files with this suffix as sources. This value can be a dictionary mapping file extensions to file types. For example::
ta: மூல கோப்புகளின் கோப்பு நீட்டிப்புகள். இந்த பின்னொட்டுடன் கோப்புகளை ஆதாரங்களாக ச்பிங்க்ச் கருதுகிறது. இந்த மதிப்பு கோப்பு வகைகளுக்கு அகராதி மேப்பிங் கோப்பு நீட்டிப்புகளாக இருக்கலாம். உதாரணத்திற்கு::

source: A list of paths that contain extra files not directly related to the documentation, such as :file:`robots.txt` or :file:`.htaccess`. Relative paths are taken as relative to the configuration directory. They are copied to the output directory. They will overwrite any existing file of the same name.
ta: ஆவணங்களுடன் நேரடியாக தொடர்புடைய கூடுதல் கோப்புகளைக் கொண்ட பாதைகளின் பட்டியல்: கோப்பு: `robots.txt` அல்லது: கோப்பு:` .htaccess`. உறவினர் பாதைகள் உள்ளமைவு கோப்பகத்துடன் தொடர்புடையவை. அவை வெளியீட்டு கோப்பகத்திற்கு நகலெடுக்கப்படுகின்றன. அதே பெயரில் இருக்கும் எந்த கோப்பையும் அவர்கள் மேலெழுதும்.

source: The dotfiles in the extra directory will be copied to the output directory. And it refers :confval:`exclude_patterns` on copying extra files and directories, and ignores if path matches to patterns.
ta: கூடுதல் கோப்பகத்தில் உள்ள டாட்ஃபைல்கள் வெளியீட்டு கோப்பகத்திற்கு நகலெடுக்கப்படும். மேலும் இது குறிக்கிறது: confval: கூடுதல் கோப்புகள் மற்றும் கோப்பகங்களை நகலெடுப்பதில் `விலக்கு_பொட்டர்ச்`, மற்றும் பாதை வடிவங்களுடன் பொருந்துமா என்பதை புறக்கணிக்கிறது.

source: If this is not None, a 'Last updated on:' timestamp is inserted at every page bottom, using the given :func:`strftime` format. The empty string is equivalent to ``'%b %d, %Y'`` (or a locale-dependent equivalent).
ta: இது எதுவுமில்லை என்றால், 'கடைசியாக புதுப்பிக்கப்பட்டது:' ஒவ்வொரு பக்கத்திலும் நேர முத்திரை செருகப்படுகிறது, கொடுக்கப்பட்டதைப் பயன்படுத்தி: func: `strftime` வடிவம். வெற்று சரம் `` ' %b %d, %y'`` (அல்லது ஒரு இருப்பிடம் சார்ந்த சமமான) க்கு சமம்.

source: If true, quotes and dashes are converted to typographically correct entities. Default: ``True``.
ta: உண்மை என்றால், மேற்கோள்கள் மற்றும் கோடுகள் அச்சுக்கலை ரீதியாக சரியான நிறுவனங்களாக மாற்றப்படுகின்றன. இயல்புநிலை: `` உண்மை``.

source: To disable smart quotes, use rather :confval:`smartquotes`.
ta: அறிவுள்ள மேற்கோள்களை முடக்க, பயன்படுத்துங்கள்: confval: `ச்மார்ட் குவோட்டுகள்`.

source: Sphinx will add "permalinks" for each heading and description environment as paragraph signs that become visible when the mouse hovers over them.
ta: ஒவ்வொரு தலைப்பு மற்றும் விளக்க சூழலுக்கும் சூரரிமாச்சிலை "பெர்மாலின்க்ச்" ஐச் சேர்க்கும், இது மவுச் அவற்றின் மேல் வட்டமிடும்போது தெரியும்.

source: This value determines the text for the permalink; it defaults to ``"¶"``. Set it to ``None`` or the empty string to disable permalinks.
ta: இந்த மதிப்பு பெர்மாலின்க் உரையை தீர்மானிக்கிறது; இது இயல்புநிலையாக `` "¶" `` `. பெர்மாலின்களை முடக்க `` எதுவுமில்லை` அல்லது வெற்று சரம் என அமைக்கவும்.

source: Previously, this was always activated.
ta: முன்னதாக, இது எப்போதும் செயல்படுத்தப்பட்டது.

source: This can now be a string to select the actual text of the link. Previously, only boolean values were accepted.
ta: இணைப்பின் உண்மையான உரையைத் தேர்ந்தெடுக்க இது இப்போது ஒரு சரமாக இருக்கலாம். முன்னதாக, பூலியன் மதிப்புகள் மட்டுமே ஏற்றுக்கொள்ளப்பட்டன.

source: Custom sidebar templates, must be a dictionary that maps document names to template names.
ta: தனிப்பயன் பக்கப்பட்டி வார்ப்புருக்கள், வார்ப்புரு பெயர்களுக்கு ஆவண பெயர்களை வரைபடமாக்கும் அகராதியாக இருக்க வேண்டும்.

source: The keys can contain glob-style patterns [1]_, in which case all matching documents will get the specified sidebars. (A warning is emitted when a more than one glob-style pattern matches for any document.)
ta: விசைகள் குளோப்-பாணி வடிவங்களைக் கொண்டிருக்கலாம் [1] _, இந்த விசயத்தில் பொருந்தக்கூடிய அனைத்து ஆவணங்களும் குறிப்பிட்ட பக்கப்பட்டிகளைப் பெறும். (எந்தவொரு ஆவணத்திற்கும் ஒன்றுக்கு மேற்பட்ட குளோப்-பாணி முறை பொருந்தும்போது ஒரு எச்சரிக்கை வெளிப்படும்.)

source: The values can be either lists or single strings.
ta: மதிப்புகள் பட்டியல்கள் அல்லது ஒற்றை சரங்களாக இருக்கலாம்.

source: If a value is a list, it specifies the complete list of sidebar templates to include. If all or some of the default sidebars are to be included, they must be put into this list as well.
ta: ஒரு மதிப்பு ஒரு பட்டியல் என்றால், அது சேர்க்க வேண்டிய பக்கப்பட்டி வார்ப்புருக்களின் முழுமையான பட்டியலைக் குறிப்பிடுகிறது. அனைத்தும் அல்லது சில இயல்புநிலை பக்கப்பட்டிகள் சேர்க்கப்பட வேண்டுமானால், அவை இந்த பட்டியலிலும் வைக்கப்பட வேண்டும்.

source: The default sidebars (for documents that don't match any pattern) are defined by theme itself. Builtin themes are using these templates by default: ``['localtoc.html', 'relations.html', 'sourcelink.html', 'searchbox.html']``.
ta: இயல்புநிலை பக்கப்பட்டிகள் (எந்த வடிவத்திற்கும் பொருந்தாத ஆவணங்களுக்கு) கருப்பொருள் மூலம் வரையறுக்கப்படுகின்றன. பில்டின் தீம்கள் இந்த வார்ப்புருக்களை இயல்பாகவே பயன்படுத்துகின்றன: `` ['லுகொல்டோக்.எச்.டி.எம்.எல்', 'உறவுகள்.

source: If a value is a single string, it specifies a custom sidebar to be added between the ``'sourcelink.html'`` and ``'searchbox.html'`` entries. This is for compatibility with Sphinx versions before 1.0.
ta: ஒரு மதிப்பு ஒற்றை சரம் என்றால், `` 'sourcelink.html'`` மற்றும் ``' searchbox.html'` உள்ளீடுகளுக்கு இடையில் சேர்க்க வேண்டிய தனிப்பயன் பக்கப்பட்டியை இது குறிப்பிடுகிறது. இது 1.0 க்கு முன் ச்பிங்க்ச் பதிப்புகளுடன் பொருந்தக்கூடிய தன்மைக்காக உள்ளது.

source: a single string value for ``html_sidebars`` will be removed in 2.0
ta: `` html_sidebars`` க்கான ஒற்றை சரம் மதிப்பு 2.0 இல் அகற்றப்படும்

source: Builtin sidebar templates that can be rendered are:
ta: வழங்கக்கூடிய பில்டின் பக்கப்பட்டி வார்ப்புருக்கள்:

source: **localtoc.html** -- a fine-grained table of contents of the current document
ta: ** localtoc.html **-தற்போதைய ஆவணத்தின் உள்ளடக்கங்களின் நேர்த்தியான அட்டவணை

source: **globaltoc.html** -- a coarse-grained table of contents for the whole documentation set, collapsed
ta: ** உலகளாவிய டாக்.எச்.டி.எம்.எல் **-முழு ஆவணத் தொகுப்பிற்கான ஒரு கரடுமுரடான உள்ளடக்க அட்டவணை, சரிந்தது

source: **relations.html** -- two links to the previous and next documents
ta: ** உறவுகள். html ** - முந்தைய மற்றும் அடுத்த ஆவணங்களுக்கு இரண்டு இணைப்புகள்

source: **searchbox.html** -- the "quick search" box
ta: ** searchbox.html ** - "விரைவான தேடல்" பெட்டி

source: This will render the custom template ``windowssidebar.html`` and the quick search box within the sidebar of the given document, and render the default sidebars for all other pages (except that the local TOC is replaced by the global TOC).
ta: இது தனிப்பயன் வார்ப்புரு `` `விண்டோச் சைட்பார்.எச்.டி.எம்.எல்`` மற்றும் கொடுக்கப்பட்ட ஆவணத்தின் பக்கப்பட்டிக்குள் விரைவான தேடல் பெட்டியையும், மற்ற எல்லா பக்கங்களுக்கும் இயல்புநிலை பக்கப்பட்டிகளை வழங்கும் (உள்ளூர் toc உலகளாவிய toc ஆல் மாற்றப்படுகிறது என்பதைத் தவிர).

source: The ability to use globbing keys and to specify multiple sidebars.
ta: குளோபிங் விசைகளைப் பயன்படுத்துவதற்கும் பல பக்கப்பட்டிகளைக் குறிப்பிடுவதற்கும் திறன்.
