Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_devguide_*.po
Languages: ta

source: The release procedures are listed on ``utils/release-checklist``.
ta: வெளியீட்டு நடைமுறைகள் `` பயன்பாடுகள்/வெளியீட்டு-செக்லிச்ட்`` இல் பட்டியலிடப்பட்டுள்ளன.

source: Locale Updates
ta: லோகேல் புதுப்பிப்புகள்

source: The parts of messages in Sphinx that go into builds are translated into several locales. The translations are kept as gettext ``.po`` files translated from the master template :file:`sphinx/locale/sphinx.pot`.
ta: ச்பிங்க்சில் உள்ள செய்திகளின் பகுதிகள் பல இடங்களாக மொழிபெயர்க்கப்பட்டுள்ளன. மொழிபெயர்ப்புகள் உரைபெறு `` .po`` கோப்புகளாக மாச்டர் வார்ப்புருவில் இருந்து மொழிபெயர்க்கப்பட்டுள்ளன: கோப்பு: `sphinx/locale/sphinx.pot`.

source: Including or providing a link to the source files involved may help us fix the issue. If possible, try to create a minimal project that produces the error and post that instead.
ta: சம்பந்தப்பட்ட மூல கோப்புகளுக்கான இணைப்பை உள்ளடக்கியது அல்லது வழங்குவது சிக்கலை சரிசெய்ய எங்களுக்கு உதவும். முடிந்தால், பிழையை உருவாக்கும் குறைந்தபட்ச திட்டத்தை உருவாக்க முயற்சிக்கவும், அதற்கு பதிலாக இடுகையிடவும்.

source: Sphinx uses `Babel <http://babel.pocoo.org/en/latest/>`_ to extract messages and maintain the catalog files. It is integrated in ``setup.py``:
ta: ச்பின்க்ச் `பாபல் <http://babel.pocoo.org/en/latest/>` _ செய்திகளைப் பிரித்தெடுக்கவும், அட்டவணை கோப்புகளை பராமரிக்கவும் பயன்படுத்துகிறது. இது `` setup.py`` இல் ஒருங்கிணைக்கப்பட்டுள்ளது:

source: Use ``python setup.py extract_messages`` to update the ``.pot`` template.
ta: `` .pot`` வார்ப்புருவைப் புதுப்பிக்க `` பைதான் அமைவு.

source: Use ``python setup.py update_catalog`` to update all existing language catalogs in ``sphinx/locale/*/LC_MESSAGES`` with the current messages in the template file.
ta: வார்ப்புரு கோப்பில் தற்போதைய செய்திகளுடன் `` sphinx/locale/*/lc_messages`` இல் இருக்கும் அனைத்து மொழி பட்டியல்களையும் புதுப்பிக்க `` பைதான் அமைவு.

source: Use ``python setup.py compile_catalog`` to compile the ``.po`` files to binary ``.mo`` files and ``.js`` files.
ta: `` .போ`` கோப்புகளை பைனரி `` .மோ`` கோப்புகள் மற்றும் `` .js`` கோப்புகளில் தொகுக்க `` பைதான் அமைவு.

source: When an updated ``.po`` file is submitted, run compile_catalog to commit both the source and the compiled catalogs.
ta: புதுப்பிக்கப்பட்ட `` .போ`` கோப்பு சமர்ப்பிக்கப்பட்டால், மூலத்தையும் தொகுக்கப்பட்ட பட்டியல்களையும் செய்ய கம்பைல்_காடலாக் இயக்கவும்.

source: When a new locale is submitted, add a new directory with the ISO 639-1 language identifier and put ``sphinx.po`` in there. Don't forget to update the possible values for :confval:`language` in ``doc/usage/configuration.rst``.
ta: ஒரு புதிய இடம் சமர்ப்பிக்கப்படும் போது, ஐஎச்ஓ 639-1 மொழி அடையாளங்காட்டியுடன் ஒரு புதிய கோப்பகத்தைச் சேர்த்து `` sphinx.po`` ஐ அங்கே வைக்கவும். இதற்கான சாத்தியமான மதிப்புகளைப் புதுப்பிக்க மறக்காதீர்கள்: `` டாக்/பயன்பாடு/உள்ளமைவு. ``` இல்` மொழி`.

source: The Sphinx core messages can also be translated on `Transifex <https://www.transifex.com/>`_. There exists a client tool named ``tx`` in the Python package "transifex_client", which can be used to pull translations in ``.po`` format from Transifex. To do this, go to ``sphinx/locale`` and then run ``tx pull -f -l LANG`` where LANG is an existing language identifier. It is good practice to run ``python setup.py update_catalog`` afterwards to make sure the ``.po`` file has the canonical Babel formatting.
ta: சூரரிமாச்சிலை கோர் செய்திகளை `டிரான்ச்ஃபெக்ச் <https://www.transifex.com/> _ _ இல் மொழிபெயர்க்கலாம். பைதான் தொகுப்பில் "டிரான்ச்ஃபெக்ச்_க்ளியண்ட்" இல் `` tx`` என்ற கிளையன்ட் கருவி உள்ளது, இது மொழிபெயர்ப்புகளை `` .போ`` வடிவத்தில் டிரான்ச்ஃபெக்சில் இருந்து இழுக்க பயன்படுத்தலாம். இதைச் செய்ய, `` sphinx/locale`` க்குச் சென்று, பின்னர் `` tx pull -f -l lang`` ஐ இயக்கவும், அங்கு லாங் ஏற்கனவே இருக்கும் மொழி அடையாளங்காட்டியாகும். `` .போ`` கோப்பில் நியமன பாபல் வடிவமைப்பைக் கொண்டிருப்பதை உறுதிசெய்ய `` பைதான் அமைவு.

source: Contributing to Sphinx
ta: ச்பின்க்சுக்கு பங்களிப்பு

source: The recommended way for new contributors to submit code to Sphinx is to fork the repository on GitHub and then submit a pull request after committing the changes. The pull request will then need to be approved by one of the core developers before it is merged into the main repository.
ta: புதிய பங்களிப்பாளர்களுக்கு சூரரிமாச்சிலை க்கு குறியீட்டை சமர்ப்பிக்க பரிந்துரைக்கப்பட்ட வழி, கிட்அப்பில் களஞ்சியத்தை முட்கரண்டி, பின்னர் மாற்றங்களைச் செய்தபின் ஒரு இழுப்பு கோரிக்கையை சமர்ப்பிப்பதாகும். இழுத்தல் கோரிக்கை முக்கிய களஞ்சியத்தில் ஒன்றிணைவதற்கு முன்பு முக்கிய டெவலப்பர்களில் ஒருவரால் அங்கீகரிக்கப்பட வேண்டும்.

source: Check for open issues or open a fresh issue to start a discussion around a feature idea or a bug.
ta: திறந்த சிக்கல்களைச் சரிபார்க்கவும் அல்லது ஒரு அம்ச சிந்தனை அல்லது பிழையைச் சுற்றி விவாதத்தைத் தொடங்க புதிய சிக்கலைத் திறக்கவும்.

source: If you feel uncomfortable or uncertain about an issue or your changes, feel free to email the *sphinx-dev* mailing list.
ta: ஒரு சிக்கல் அல்லது உங்கள் மாற்றங்களைப் பற்றி நீங்கள் சங்கடமாகவோ அல்லது நிச்சயமற்றதாகவோ உணர்ந்தால், * sphinx-dev * அஞ்சல் பட்டியலுக்கு மின்னஞ்சல் அனுப்புங்கள்.

source: Fork `the repository`_ on GitHub to start making your changes to the ``master`` branch for next MAJOR version, or ``A.x`` branch for next MINOR version (see `Branch Model`_).
ta: அடுத்த முக்கிய பதிப்பிற்கான `` மாச்டர்` கிளையில் உங்கள் மாற்றங்களைச் செய்யத் தொடங்க கிதுபில் உள்ள களஞ்சியம் `_ அல்லது அடுத்த சிறிய பதிப்பிற்கான `a.x`` கிளை (` கிளை மாதிரி`_ ஐப் பார்க்கவும்).

source: Write a test which shows that the bug was fixed or that the feature works as expected.
ta: பிழை சரி செய்யப்பட்டது அல்லது நற்பொருத்தம் எதிர்பார்த்தபடி செயல்படுகிறது என்பதைக் காட்டும் ஒரு சோதனையை எழுதுங்கள்.

source: Send a pull request and bug the maintainer until it gets merged and published. Make sure to add yourself to AUTHORS_ and the change to CHANGES_.
ta: ஒரு இழுத்தல் கோரிக்கையை அனுப்பி, பராமரிப்பாளரை ஒன்றிணைத்து வெளியிடும் வரை பிழைக்கவும். ஆசிரியர்கள்_ மற்றும் மாற்றங்களுக்கான மாற்றத்தில் உங்களைச் சேர்ப்பதை உறுதிசெய்க.

source: Getting Started
ta: தொடங்குதல்

source: This document describes the development process of Sphinx, a documentation system used by developers to document systems used by other developers to develop other systems that may also be documented using Sphinx.
ta: இந்த ஆவணம் சூரரிமாச்சிலை இன் மேம்பாட்டு செயல்முறையை விவரிக்கிறது, இது ச்பிங்க்சைப் பயன்படுத்தி ஆவணப்படுத்தப்படக்கூடிய பிற அமைப்புகளை உருவாக்க பிற உருவாக்குபவர்கள் பயன்படுத்தும் ஆவண அமைப்புகளுக்கு உருவாக்குபவர்கள் பயன்படுத்தும் ஆவணப்படுத்தல் அமைப்பு.

source: These are the basic steps needed to start developing on Sphinx.
ta: ச்பிங்க்சில் உருவாக்கத் தேவையான அடிப்படை படிகள் இவை.

source: Create an account on GitHub.
ta: கிதுபில் ஒரு கணக்கை உருவாக்கவும்.

source: Fork the main Sphinx repository (`sphinx-doc/sphinx <https://github.com/sphinx-doc/sphinx>`_) using the GitHub interface.
ta: அறிவிலிமையம் இடைமுகத்தைப் பயன்படுத்தி முதன்மையான சூரரிமாச்சிலை களஞ்சியத்தை (`sphinx-doc/sphinx <https://github.com/sphinx-doc/sphinx> _) fork.

source: Clone the forked repository to your machine. ::
ta: உங்கள் இயந்திரத்திற்கு முட்கரண்டி களஞ்சியத்தை நகலி செய்யுங்கள். ::

source: Checkout the appropriate branch.
ta: பொருத்தமான கிளையைப் பாருங்கள்.

source: Sphinx adopts Semantic Versioning 2.0.0 (refs: https://semver.org/ ).
ta: சூரரிமாச்சிலை சொற்பொருள் பதிப்பு 2.0.0 ஐ ஏற்றுக்கொள்கிறது (refs: https://semver.org/).

source: For changes that preserves backwards-compatibility of API and features, they should be included in the next MINOR release, use the ``A.x`` branch. ::
ta: பநிஇ மற்றும் அம்சங்களின் பின்னோக்கி-இணக்கத்தன்மையைப் பாதுகாக்கும் மாற்றங்களுக்கு, அவை அடுத்த சிறிய வெளியீட்டில் சேர்க்கப்பட வேண்டும், `` a.x`` கிளையைப் பயன்படுத்தவும். ::

source: Abstract
ta: சுருக்கம்
