Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_internals--authors_*.po
Languages: ta

source: Georg Brandl <georg@python.org>
ta: சார்ச் பிராண்ட்ல் <georg@python.org>

source: There are also a few modules or functions incorporated from other authors and projects:
ta: மற்ற ஆசிரியர்கள் மற்றும் திட்டங்களிலிருந்து இணைக்கப்பட்ட சில தொகுதிகள் அல்லது செயல்பாடுகளும் உள்ளன:

source: sphinx.util.jsdump uses the basestring encoding from simplejson, written by Bob Ippolito, released under the MIT license
ta: sphinx.util.jsdump mit உரிமத்தின் கீழ் வெளியிடப்பட்ட பாப் ஐபோலிட்டோ எழுதிய சிம்பிள்ச்சனிலிருந்து அடிப்படை குறியாக்கத்தைப் பயன்படுத்துகிறது

source: Jakob Lykke Andersen <@jakobandersen>
ta: சாகோப் லைக் ஆண்டர்சன் <@jakobandersen>

source: Jean-François Burnol <@jfbu>
ta: சீன்-பிரான்சுவா பர்னல் <@jfbu>

source: Rob Ruana <@RobRuana>
ta: ராப் ருவானா <@robruana>

source: Robert Lehmann <@lehmannro>
ta: ராபர்ட் லெஅ்மன் <@lehmannro>

source: Stephen Finucane <@stephenfin>
ta: ச்டீபன் ஃபினுகேன் <@stephenfin>

source: Takayuki Shimizukawa <shimizukawa@gmail.com>
ta: தாகாயுகி சிமிசுகாவா <shimizukawa@gmail.com>

source: Takeshi Komiya <@tk0miya>
ta: தாகி கோமியா <@tk0miya>

source: Timotheus Kampik <@TimKam>
ta: திமோத்தேயச் கம்பிக் <@timkam>

source: Yoshiki Shibukawa <@shibukawa>
ta: யோசிகி சிபுகாவா <@சிபுகாவா>

source: Maintainers
ta: பராமரிப்பாளர்கள்

source: Contributors
ta: பங்களிப்பாளர்கள்

source: *Listed alphabetically in forename, surname order*
ta: *ஃபோரன் பெயரில் அகர வரிசைப்படி பட்டியலிடப்பட்டுள்ளது, குடும்பப்பெயர் ஆர்டர்*

source: Adrián Chaves (Gallaecio) -- coverage builder improvements
ta: அட்ரியன் சாவேவ்ச் (கல்லேசியோ) - கவரேச் பில்டர் மேம்பாடுகள்

source: Alastair Houghton -- Apple Help builder
ta: அலெச்டர் அ ought க்டன் - ஆப்பிள் உதவி பில்டர்

source: Alexander Todorov -- inheritance_diagram tests and improvements
ta: அலெக்சாண்டர் டோடோரோவ் - பரம்பரை_டியாகிராம் சோதனைகள் மற்றும் மேம்பாடுகள்

source: Andi Albrecht -- agogo theme
ta: ஆண்டி ஆல்பிரெக்ட் - அகோகோ கருப்பொருள்

source: Antonio Valentino -- qthelp builder, docstring inheritance
ta: அன்டோனியோ வாலண்டினோ - qthelp பில்டர், ஆவணசரம் பரம்பரை

source: Antti Kaihola -- doctest extension (skipif option)
ta: ஆன்டி கைஓலா - ஆவண நீட்டிப்பு (skipif விருப்பம்)

source: Barry Warsaw -- setup command improvements
ta: பாரி வார்சா - அமைவு கட்டளை மேம்பாடுகள்

source: Ben Egan -- Napoleon improvements
ta: பென் ஏகன் - நெப்போலியன் மேம்பாடுகள்

source: Benjamin Peterson -- unittests
ta: பெஞ்சமின் பீட்டர்சன் - யுனிட்டெச்ட்ச்

source: Blaise Laflamme -- pyramid theme
ta: பிளேச் லாஃப்லாம் - பிரமிட் கருப்பொருள்

source: Bruce Mitchener -- Minor epub improvement
ta: புரூச் மிட்செனர் - சிறிய எபப் மேம்பாடு

source: Buck Evan -- dummy builder
ta: பக் இவான் - டம்மி பில்டர்

source: Charles Duffy -- original graphviz extension
ta: சார்லச் டஃபி - அசல் கிராப்விச் நீட்டிப்பு

source: Chris Lamb -- reproducibility fixes
ta: கிறிச் லாம்ப் - இனப்பெருக்கம் திருத்தங்கள்

source: Christopher Perkins -- autosummary integration
ta: கிறிச்டோபர் பெர்கின்ச் - தன்னியக்க ஒருங்கிணைப்பு

source: Dan MacKinlay -- metadata fixes
ta: டான் மெக்கின்லே - மெட்டாடேட்டா திருத்தங்கள்

source: Daniel Bültmann -- todo extension
ta: டேனியல் பெல்ட்மேன் - செய்யவேண்டிய நீட்டிப்பு

source: Daniel Neuhäuser -- JavaScript domain, Python 3 support (GSOC)
ta: டேனியல் நியூஅவுசர் - சாவாச்கிரிப்ட் டொமைன், பைதான் 3 உதவி (சி.எச்.ஓ.சி)

source: Daniel Pizetta -- inheritance diagram improvements
ta: டேனியல் பிசெட்டா - பரம்பரை வரைபடம் மேம்பாடுகள்

source: Dave Kuhlman -- original LaTeX writer
ta: டேவ் குல்மேன் - அசல் லேடெக்ச் எழுத்தாளர்

source: Doug Hellmann -- graphviz improvements
ta: டக் எல்மேன் - கிராப்விச் மேம்பாடுகள்

source: Eric N. Vander Weele -- autodoc improvements
ta: எரிக் என். வேண்டர் வீல் - ஆட்டோடோக் மேம்பாடுகள்

source: Etienne Desautels -- apidoc module
ta: எட்டியென் டெசாடெல்ச் - அப்பிடோக் தொகுதி

source: Ezio Melotti -- collapsible sidebar JavaScript
ta: எசியோ மெலோட்டி - மடக்கக்கூடிய பக்கப்பட்டி சாவாச்கிரிப்ட்

source: Filip Vavera -- napoleon todo directive
ta: பிலிப் வாவேரா - நெப்போலியன் செய்யவேண்டிய டைரெக்டிவ்

source: Glenn Matthews -- python domain signature improvements
ta: க்ளென் மேத்யூச் - பைதான் டொமைன் கையொப்ப மேம்பாடுகள்

source: Gregory Szorc -- performance improvements
ta: கிரிகோரி szorc - செயல்திறன் மேம்பாடுகள்

source: Henrique Bastos -- SVG support for graphviz extension
ta: என்ரிக் பாச்டோச் - கிராப்விச் நீட்டிப்புக்கான எச்.வி.சி உதவி

source: Hernan Grecco -- search improvements
ta: எர்னன் கிரெக்கோ - தேடல் மேம்பாடுகள்

source: Hong Xu -- svg support in imgmath extension and various bug fixes
ta: ஆங் சூ - இம்ச்மாத் நீட்டிப்பு மற்றும் பல்வேறு பிழை திருத்தங்களில் எச்.வி.சி உதவி

source: Horst Gutmann -- internationalization support
ta: ஆர்ச்ட் குட்மேன் - பன்னாட்டுமயமாக்கல் உதவி

source: Hugo van Kemenade -- support FORCE_COLOR and NO_COLOR
ta: அ்யூகோ வான் கெமெனேட் - உதவி ஃபோர்ச்_கோலர் மற்றும் நோ_கோலர்

source: Ian Lee -- quickstart improvements
ta: இயன் லீ - விரைவுச்டார்ட் மேம்பாடுகள்

source: Jacob Mason -- websupport library (GSOC project)
ta: சேக்கப் மேசன் - வலை உதவி நூலகம் (சிஎச்ஓசி திட்டம்)

source: Adam Turner <@AA-Turner>
ta: ஆடம் டர்னர் <@aa-turner>

source: Jeppe Pihl -- literalinclude improvements
ta: jeppe pihl - lisearlinclude மேம்பாடுகள்

source: Joel Wurtz -- cellspanning support in LaTeX
ta: சோயல் வூர்ட்ச் - லேடெக்சில் செல்ச்பேனிங் உதவி

source: John Waltman -- Texinfo builder
ta: சான் வால்ட்மேன் - டெக்சின்ஃபோ பில்டர்

source: Josip Dzolonga -- coverage builder
ta: சோசிப் சோலோங்கா - கவரேச் பில்டர்

source: Julien Palard -- Colspan and rowspan in text builder
ta: சூலியன் பாலார்ட் - உரை பில்டரில் கோல்ச்பான் மற்றும் ரோச்பான்

source: Kevin Dunn -- MathJax extension
ta: கெவின் டன் - மேத்சாக்ச் நீட்டிப்பு

source: KINEBUCHI Tomohiko -- typing Sphinx as well as docutils
ta: கினெபுச்சி டோமோஇகோ - ச்பிங்க்ச் மற்றும் டொக்யூட்டில்களைத் தட்டச்சு செய்கிறார்

source: Kurt McKee -- documentation updates
ta: கர்ட் மெக்கீ - ஆவணங்கள் புதுப்பிப்புகள்

source: Lars Hupfeldt Nielsen - OpenSSL FIPS mode md5 bug fix
ta: லார்ச் அப்ஃபெல்ட் நீல்சன் - ஓபன்ச்எல் எஃப்ஐபிஎச் பயன்முறை எம்.டி 5 பிழை பிழைத்திருத்தம்

source: Łukasz Langa -- partial support for autodoc
ta: łukasz langa - ஆட்டோடோக்கிற்கான பகுதி உதவி

source: Armin Ronacher <armin.ronacher@active-4.com>
ta: அர்மின் ரோனாச்சர் <அர்மின்.ஆரோணேசர் -4.com>

source: Marco Buttu -- doctest extension (pyversion option)
ta: மார்கோ புட்டு - ஆவண நீட்டிப்பு (பைசன் விருப்பம்)

source: Martin Hans -- autodoc improvements
ta: மார்ட்டின் ஆன்ச் - ஆட்டோடோக் மேம்பாடுகள்

source: Martin Larralde -- additional napoleon admonitions
ta: மார்ட்டின் லாரால்ட் - கூடுதல் நெப்போலியன் அறிவுரைகள்

source: Martin Mahner -- nature theme
ta: மார்ட்டின் மஅ்னர் - இயற்கை கருப்பொருள்

source: Matthew Fernandez -- todo extension fix
ta: மத்தேயு பெர்னாண்டச் - செய்யவேண்டிய நீட்டிப்பு பிழைத்திருத்தம்

source: Matthew Woodcraft -- text output improvements
ta: மத்தேயு வூட் கிராஃப்ட் - உரை வெளியீட்டு மேம்பாடுகள்

source: Michael Droettboom -- inheritance_diagram extension
ta: மைக்கேல் ட்ரோடெட் பூம் - பரம்பரை_டியாகிராம் நீட்டிப்பு

source: Michael Wilson -- Intersphinx HTTP basic auth support
ta: மைக்கேல் வில்சன் - இன்டெர்ச்பின்க்ச் http அடிப்படை அங்கீகார உதவி

source: Nathan Damon -- bugfix in validation of static paths in html builders
ta: நாதன் டாமன் - html பில்டர்களில் நிலையான பாதைகளை சரிபார்ப்பதில் பிழைத்திருத்தம்

source: Pauli Virtanen -- autodoc improvements, autosummary extension
ta: பவுலி விர்டானென் - ஆட்டோடோக் மேம்பாடுகள், தன்னியக்க நீட்டிப்பு

source: Daniel Neuhäuser <@DasIch>
ta: டேனியல் நியூஊசர் <@dasich>

source: Rob Ruana -- napoleon extension
ta: ராப் ருவானா - நெப்போலியன் நீட்டிப்பு

source: Robert Lehmann -- gettext builder (GSOC project)
ta: ராபர்ட் லெஅ்மன் - கெடெக்ச்ட் பில்டர் (சி.எச்.ஓ.சி திட்டம்)

source: Roland Meister -- epub builder
ta: ரோலண்ட் மீச்டர் - எபப் பில்டர்

source: Sebastian Wiesner -- image handling, distutils support
ta: செபாச்டியன் வைச்னர் - படக் கையாளுதல், தொலைதூர உதவி

source: Stefan Seefeld -- toctree improvements
ta: ச்டீபன் சீஃபெல்ட் - டோக்ட்ரீ மேம்பாடுகள்

source: Stefan van der Walt -- autosummary extension
ta: ச்டீபன் வான் டெர் வால்ட் - ஆட்டோசம்மரி நீட்டிப்பு

source: Powers -- HTML output improvements
ta: அதிகாரங்கள் - html வெளியீட்டு மேம்பாடுகள்

source: Taku Shimizu -- epub3 builder
ta: டகு சிமிசு - எபப் 3 பில்டர்

source: Thomas Lamb -- linkcheck builder
ta: தாமச் லாம்ப் - லிங்க்செக் பில்டர்

source: Thomas Waldmann -- apidoc module fixes
ta: தாமச் வால்ட்மேன் - அப்பிடோக் தொகுதி திருத்தங்கள்

source: François Freitag <@francoisfreitag>
ta: பிரான்சுவா ஃப்ரீடாக் <@francoisfreitag>

source: Tim Hoffmann -- theme improvements
ta: டிம் ஆஃப்மேன் - கருப்பொருள் மேம்பாடுகள்

source: Vince Salvino -- JavaScript search improvements
ta: வின்ச் சால்வினோ - சாவாச்கிரிப்ட் தேடல் மேம்பாடுகள்

source: Will Maier -- directory HTML builder
ta: வில் மேயர் - அடைவு html பில்டர்

source: Zac Hatfield-Dodds -- doctest reporting improvements, intersphinx performance
ta: சாக் ஆட்ஃபீல்ட்-டாட்ச்-ஆவண அறிக்கையிடல் மேம்பாடுகள், இன்டர்ச்பின்க்ச் செயல்திறன்

source: Many thanks for all contributions!
ta: அனைத்து பங்களிப்புகளுக்கும் நன்றி!

source: Included software
ta: மென்பொருள் சேர்க்கப்பட்டுள்ளது

source: Sphinx authors
ta: ச்பிங்க்ச் ஆசிரியர்கள்
