Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_config_*.po
Languages: ta

source: dict
ta: கட்டளை

source: doctest-block
ta: ஆவண-தடுப்பு

source: image
ta: படம்

source: index
ta: குறியீட்டு

source: lib
ta: லிப்

source: literal-block
ta: நேரடி-தொகுதி

source: raw
ta: மூல

source: type
ta: தட்டச்சு செய்க

source: By default, Sphinx only supports ``'restrcturedtext'`` file type. You can add a new file type using source parser extensions. Please read a document of the extension to know what file type the extension supports.
ta: இயல்பாக, சூரரிமாச்சிலை `` 'rectrctedtext'`` கோப்பு வகையை மட்டுமே ஆதரிக்கிறது. மூல பாகுபடுத்தி நீட்டிப்புகளைப் பயன்படுத்தி புதிய கோப்பு வகையைச் சேர்க்கலாம். நீட்டிப்பு எந்த கோப்பு வகை ஆதரிக்கிறது என்பதை அறிய நீட்டிப்பின் ஆவணத்தைப் படியுங்கள்.

source: Note that this value only has no effect if the chosen theme does not possess a sidebar, like the builtin **scrolls** and **haiku** themes.
ta: தேர்ந்தெடுக்கப்பட்ட கருப்பொருள் ஒரு பக்கப்பட்டியைக் கொண்டிருக்கவில்லை என்றால் மட்டுமே இந்த மதிப்பு எந்த விளைவையும் ஏற்படுத்தாது என்பதை நினைவில் கொள்க, பில்டின் ** சுருள்கள் ** மற்றும் ** ஐக்கு ** கருப்பொருள்கள் போன்றவை.

source: Additional templates that should be rendered to HTML pages, must be a dictionary that maps document names to template names.
ta: html பக்கங்களுக்கு வழங்கப்பட வேண்டிய கூடுதல் வார்ப்புருக்கள், வார்ப்புரு பெயர்களுக்கு ஆவண பெயர்களை வரைபடமாக்கும் அகராதியாக இருக்க வேண்டும்.

source: Example::
ta: உதாரணமாக::

source: This will render the template ``customdownload.html`` as the page ``download.html``.
ta: இது `` பதிவிறக்கம்.எச்.டி.எம்.எல்`` என்ற பக்கமாக `` custom download.html` வார்ப்புருவை வழங்கும்.

source: If true, generate domain-specific indices in addition to the general index. For e.g. the Python domain, this is the global module index. Default is ``True``.
ta: உண்மை என்றால், பொது குறியீட்டுக்கு கூடுதலாக டொமைன்-குறிப்பிட்ட குறியீடுகளை உருவாக்கவும். எ.கா. பைதான் டொமைன், இது உலகளாவிய தொகுதி குறியீடாகும். இயல்புநிலை `` உண்மை``.

source: This value can be a bool or a list of index names that should be generated. To find out the index name for a specific index, look at the HTML file name. For example, the Python module index has the name ``'py-modindex'``.
ta: இந்த மதிப்பு ஒரு பூல் அல்லது உருவாக்கப்பட வேண்டிய குறியீட்டு பெயர்களின் பட்டியலாக இருக்கலாம். ஒரு குறிப்பிட்ட குறியீட்டிற்கான குறியீட்டு பெயரைக் கண்டுபிடிக்க, html கோப்பு பெயரைப் பாருங்கள். எடுத்துக்காட்டாக, பைதான் தொகுதி குறியீட்டில் `` 'பை-மோடிண்டெக்ச்'` என்ற பெயர் உள்ளது.

source: If true, add an index to the HTML documents. Default is ``True``.
ta: உண்மை என்றால், html ஆவணங்களில் ஒரு குறியீட்டைச் சேர்க்கவும். இயல்புநிலை `` உண்மை``.

source: If true, the index is generated twice: once as a single page with all the entries, and once as one page per starting letter. Default is ``False``.
ta: உண்மை என்றால், குறியீடு இரண்டு முறை உருவாக்கப்படுகிறது: ஒரு முறை அனைத்து உள்ளீடுகளுடன் ஒரு பக்கமாகவும், ஒரு முறை தொடக்க கடிதத்திற்கு ஒரு பக்கமாகவும். இயல்புநிலை `` பொய்``.

source: This also allows a list of file extensions. In that case, Sphinx conciders that all they are ``'restructuredtext'``. Default is ``{'.rst': 'restructuredtext'}``.
ta: இது கோப்பு நீட்டிப்புகளின் பட்டியலையும் அனுமதிக்கிறது. அவ்வாறான நிலையில், அவை அனைத்தும் `` 'மறுசீரமைக்கப்பட்ட டெக்ச்ட்'``` என்று ச்பின்க்ச் ஒத்துப்போகிறது. இயல்புநிலை `` {'.ஆர்எச்டி': 'மறுசீரமைப்பு டெக்ச்ட்'} ``.

source: If true, the reST sources are included in the HTML build as :file:`_sources/{name}`. The default is ``True``.
ta: உண்மை என்றால், மீதமுள்ள ஆதாரங்கள் html கட்டமைப்பில் சேர்க்கப்பட்டுள்ளன: கோப்பு: `_sources/{name}`. இயல்புநிலை `` உண்மை``.

source: If this config value is set to ``False``, the JavaScript search function will only display the titles of matching documents, and no excerpt from the matching contents.
ta: இந்த உள்ளமைவு மதிப்பு `` false`` என அமைக்கப்பட்டால், சாவாச்கிரிப்ட் தேடல் செயல்பாடு பொருந்தக்கூடிய ஆவணங்களின் தலைப்புகளை மட்டுமே காண்பிக்கும், மேலும் பொருந்தக்கூடிய உள்ளடக்கங்களிலிருந்து எந்த பகுதியும் இல்லை.

source: If true (and :confval:`html_copy_source` is true as well), links to the reST sources will be added to the sidebar. The default is ``True``.
ta: உண்மை என்றால் (மற்றும்: confval: `html_copy_source` என்பதும் உண்மைதான்), மீதமுள்ள மூலங்களுக்கான இணைப்புகள் பக்கப்பட்டியில் சேர்க்கப்படும். இயல்புநிலை `` உண்மை``.

source: Suffix to be appended to source links (see :confval:`html_show_sourcelink`), unless they have this suffix already. Default is ``'.txt'``.
ta: மூல இணைப்புகளுடன் சேர்க்கப்பட வேண்டிய பின்னொட்டு (பார்க்க: confval: `html_show_sourcelink`), இந்த பின்னொட்டு ஏற்கனவே இல்லாவிட்டால். இயல்புநிலை `` '.txt'``.

source: If nonempty, an `OpenSearch <http://www.opensearch.org/Home>`_ description file will be output, and all pages will contain a ``<link>`` tag referring to it. Since OpenSearch doesn't support relative URLs for its search page location, the value of this option must be the base URL from which these documents are served (without trailing slash), e.g. ``"https://docs.python.org"``. The default is ``''``.
ta: nonempty என்றால், ஒரு `opensearch <http://www.opensearch.org/home>` _ விளக்கக் கோப்பு வெளியீடாக இருக்கும், மேலும் எல்லா பக்கங்களிலும் இதைக் குறிக்கும் `` <இணைப்பு> `` குறிச்சொல் இருக்கும். opensearch அதன் தேடல் பக்க இருப்பிடத்திற்கான தொடர்புடைய முகவரி களை ஆதரிக்கவில்லை என்பதால், இந்த விருப்பத்தின் மதிப்பு இந்த ஆவணங்கள் வழங்கப்படும் அடிப்படை முகவரி ஆக இருக்க வேண்டும் (சாய்வு இல்லாமல்), எ.கா. `` "https://docs.python.org" ``. இயல்புநிலை `` '' ``.

source: This is the file name suffix for generated HTML files. The default is ``".html"``.
ta: உருவாக்கப்பட்ட html கோப்புகளுக்கான கோப்பு பெயர் பின்னொட்டு இது. இயல்புநிலை `` ".html" ``.

source: file extensions have to start with dot (like ``.rst``).
ta: கோப்பு நீட்டிப்புகள் dot உடன் தொடங்க வேண்டும் (`` .rst`` போன்றவை).

source: Suffix for generated links to HTML files. The default is whatever :confval:`html_file_suffix` is set to; it can be set differently (e.g. to support different web server setups).
ta: html கோப்புகளுக்கான உருவாக்கப்பட்ட இணைப்புகளுக்கான பின்னொட்டு. இயல்புநிலை எதுவாக இருந்தாலும்: confval: `html_file_suffix` அமைக்கப்பட்டுள்ளது; இதை வித்தியாசமாக அமைக்கலாம் (எ.கா. வெவ்வேறு வலை சேவையக அமைப்புகளை ஆதரிக்க).

source: If true, "(C) Copyright ..." is shown in the HTML footer. Default is ``True``.
ta: உண்மை என்றால், "(இ) பதிப்புரிமை ..." html அடிக்குறிப்பில் காட்டப்பட்டுள்ளது. இயல்புநிலை `` உண்மை``.

source: The :term:`configuration directory` must contain a file named :file:`conf.py`. This file (containing Python code) is called the "build configuration file" and contains (almost) all configuration needed to customize Sphinx input and output behavior.
ta: தி: கால: `உள்ளமைவு அடைவு` பெயரிடப்பட்ட ஒரு கோப்பைக் கொண்டிருக்க வேண்டும்: கோப்பு:` conf.py`. இந்த கோப்பு (பைதான் குறியீட்டைக் கொண்டுள்ளது) "கட்டமைப்பு கோப்பை உருவாக்கு" என்று அழைக்கப்படுகிறது, மேலும் ச்பிங்க்ச் உள்ளீடு மற்றும் வெளியீட்டு நடத்தை தனிப்பயனாக்க தேவையான அனைத்து உள்ளமைவுகளையும் கொண்டுள்ளது.

source: Can now be a list of extensions.
ta: இப்போது நீட்டிப்புகளின் பட்டியலாக இருக்கலாம்.

source: If true, "Created using Sphinx" is shown in the HTML footer. Default is ``True``.
ta: உண்மை என்றால், "ச்பிங்க்சைப் பயன்படுத்தி உருவாக்கப்பட்டது" html அடிக்குறிப்பில் காட்டப்பட்டுள்ளது. இயல்புநிலை `` உண்மை``.

source: Encoding of HTML output files. Default is ``'utf-8'``. Note that this encoding name must both be a valid Python encoding name and a valid HTML ``charset`` value.
ta: html வெளியீட்டு கோப்புகளின் குறியாக்கம். இயல்புநிலை `` 'utf-8'``. இந்த குறியாக்க பெயர் இரண்டுமே செல்லுபடியாகும் பைதான் குறியாக்க பெயர் மற்றும் செல்லுபடியாகும் html `` சார்செட்`` மதிப்பாக இருக்க வேண்டும் என்பதை நினைவில் கொள்க.

source: If true, a list all whose items consist of a single paragraph and/or a sub-list all whose items etc... (recursive definition) will not use the ``<p>`` element for any of its items. This is standard docutils behavior. Default: ``True``.
ta: உண்மை என்றால், அதன் உருப்படிகள் ஒரு பத்தி மற்றும்/அல்லது ஒரு துணை பட்டியல் போன்றவற்றைக் கொண்டிருக்கும், அதன் உருப்படிகள் போன்றவை ... (சுழல்நிலை வரையறை) அதன் எந்தவொரு உருப்படிகளுக்கும் `` <p> `` உறுப்பைப் பயன்படுத்தாது. இது நிலையான ஆவண நடத்தை. இயல்புநிலை: `` உண்மை``.

source: Suffix for section numbers. Default: ``". "``. Set to ``" "`` to suppress the final dot on section numbers.
ta: பிரிவு எண்களுக்கான பின்னொட்டு. இயல்புநிலை: `` "." ``. பிரிவு எண்களில் இறுதி புள்ளியை அடக்க `` "" `` என அமைக்கவும்.

source: Support file type mapping
ta: கோப்பு வகை மேப்பிங் உதவி

source: Language to be used for generating the HTML full-text search index. This defaults to the global language selected with :confval:`language`. If there is no support for this language, ``"en"`` is used which selects the English language.
ta: html முழு உரை தேடல் குறியீட்டை உருவாக்க பயன்படுத்த வேண்டிய மொழி. இது தேர்ந்தெடுக்கப்பட்ட உலகளாவிய மொழிக்கு இயல்புநிலையாகும்: confval: `மொழி`. இந்த மொழிக்கு எந்த ஆதரவும் இல்லை என்றால், ஆங்கில மொழியைத் தேர்ந்தெடுக்கும் `` "என்" `` பயன்படுத்தப்படுகிறது.

source: Support is present for these languages:
ta: இந்த மொழிகளுக்கு உதவி உள்ளது:

source: ``da`` -- Danish
ta: `` டா`` - டேனிச்

source: ``nl`` -- Dutch
ta: `` nl`` - டச்சு

source: ``en`` -- English
ta: `` en`` - ஆங்கிலம்

source: ``fi`` -- Finnish
ta: `` fi`` - பின்னிச்

source: ``fr`` -- French
ta: `` fr`` - பிரஞ்சு

source: ``de`` -- German
ta: `` டி`` - செர்மன்

source: ``hu`` -- Hungarian
ta: `` உ`` - அங்கேரிய

source: ``it`` -- Italian
ta: `` இது`` - இத்தாலியன்

source: ``ja`` -- Japanese
ta: `` சா`` - சப்பானிய

source: ``no`` -- Norwegian
ta: `` இல்லை`` - நோர்வே

source: ``pt`` -- Portuguese
ta: `` pt`` - போர்த்துகீசியம்

source: ``ro`` -- Romanian
ta: `` ரோ`` - ருமேனிய

source: ``ru`` -- Russian
ta: `` ru`` - ரச்யன்

source: ``es`` -- Spanish
ta: `` எச்`` - ச்பானிச்

source: ``sv`` -- Swedish
ta: `` எச்.வி`` - ச்வீடிச்

source: ``tr`` -- Turkish
ta: `` tr`` - துருக்கிய

source: ``zh`` -- Chinese
ta: `` zh`` - சீன

source: Accelerating build speed
ta: உருவாக்க வேகத்தை துரிதப்படுத்துகிறது

source: Each language (except Japanese) provides its own stemming algorithm. Sphinx uses a Python implementation by default. You can use a C implementation to accelerate building the index file.
ta: ஒவ்வொரு மொழியும் (சப்பானிய தவிர) அதன் சொந்த தண்டு வழிமுறையை வழங்குகிறது. ச்பிங்க்ச் இயல்பாக ஒரு பைதான் செயலாக்கத்தைப் பயன்படுத்துகிறது. குறியீட்டு கோப்பை உருவாக்குவதை துரிதப்படுத்த நீங்கள் ஒரு சி செயலாக்கத்தைப் பயன்படுத்தலாம்.

source: `PorterStemmer <https://pypi.org/project/PorterStemmer/>`_ (``en``)
ta: `போர்ட்டர்ச்டெம்மர் <https://pypi.org/project/porterstemmer/>` _ (`` en``)

source: `PyStemmer <https://pypi.org/project/PyStemmer/>`_ (all languages)
ta: `pystemmer <https://pypi.org/project/pystemmer/>` _ (அனைத்து மொழிகளும்)

source: With support for ``en`` and ``ja``.
ta: `` en` மற்றும் `` ja`` என்பதற்கான ஆதரவுடன்.

source: Added additional languages.
ta: கூடுதல் மொழிகள் சேர்க்கப்பட்டன.

source: A dictionary with options for the search language support, empty by default. The meaning of these options depends on the language selected.
ta: தேடல் மொழி ஆதரவிற்கான விருப்பங்களைக் கொண்ட அகராதி, இயல்பாகவே காலியாக உள்ளது. இந்த விருப்பங்களின் பொருள் தேர்ந்தெடுக்கப்பட்ட மொழியைப் பொறுத்தது.

source: The English support has no options.
ta: ஆங்கில ஆதரவுக்கு விருப்பங்கள் இல்லை.

source: The Japanese support has these options:
ta: சப்பானிய ஆதரவில் இந்த விருப்பங்கள் உள்ளன:

source: The encoding of all reST source files. The recommended encoding, and the default value, is ``'utf-8-sig'``.
ta: அனைத்து ஓய்வு மூல கோப்புகளின் குறியாக்கம். பரிந்துரைக்கப்பட்ட குறியாக்கம் மற்றும் இயல்புநிலை மதிப்பு `` '' utf-8-sig'```.

source: _`type` is dotted module path string to specify Splitter implementation which should be derived from :class:`sphinx.search.ja.BaseSplitter`. If not specified or None is specified, ``'sphinx.search.ja.DefaultSplitter'`` will be used.
ta: _` டைப்` என்பது ச்ப்ளிட்டர் செயல்படுத்தலைக் குறிப்பிடுவதற்கு புள்ளியிடப்பட்ட தொகுதி பாதை சரம்: இதிலிருந்து பெறப்பட வேண்டும்: வகுப்பு: `sphinx.search.ja.basesplitter`. குறிப்பிடப்படவில்லை அல்லது எதுவும் குறிப்பிடப்படவில்லை என்றால், `` 'sphinx.search.ja.defaultsplitter'`` பயன்படுத்தப்படும்.

source: You can choose from these modules:
ta: இந்த தொகுதிகளிலிருந்து நீங்கள் தேர்வு செய்யலாம்:

source: TinySegmenter algorithm. This is default splitter.
ta: டைனிச்பெமென்டர் அல்காரிதம். இது இயல்புநிலை ச்ப்ளிட்டர்.

source: MeCab binding. To use this splitter, 'mecab' python binding or dynamic link library ('libmecab.so' for linux, 'libmecab.dll' for windows) is required.
ta: மெக்காப் பிணைப்பு. இந்த ச்ப்ளிட்டரைப் பயன்படுத்த, 'மெக்காப்' பைதான் பிணைப்பு அல்லது மாறும் இணைப்பு நூலகம் ('லினக்சுக்கு' libmecab.so ', விண்டோசிற்கான' libmecab.dll ') தேவை.

source: Janome binding. To use this splitter, `Janome <https://pypi.org/project/Janome/>`_ is required.
ta: சானோம் பிணைப்பு. இந்த ச்ப்ளிட்டரைப் பயன்படுத்த, `சானோம் <https://pypi.org/project/janome/>` _ தேவை.

source: ``'mecab'``, ``'janome'`` and ``'default'`` is deprecated. To keep compatibility, ``'mecab'``, ``'janome'`` and ``'default'`` are also acceptable.
ta: `` 'மெக்காப்'``, ``' 'சானோமோம்'` மற்றும் ``' இயல்புநிலை'`` நீக்கப்பட்டது. பொருந்தக்கூடிய தன்மையைக் கொண்டிருக்க, `` '' மெகாப்'``, `` 'சானோமோம்'` மற்றும் ``' இயல்புநிலை'` ஏற்றுக்கொள்ளத்தக்கது.

source: Other option values depend on splitter value which you choose.
ta: பிற விருப்ப மதிப்புகள் நீங்கள் தேர்ந்தெடுக்கும் ச்ப்ளிட்டர் மதிப்பைப் பொறுத்தது.

source: _`dic_enc option` is the encoding for the MeCab algorithm.
ta: _`dic_enc விருப்பம்` என்பது mecab வழிமுறைக்கான குறியாக்கமாகும்.

source: _`dict option` is the dictionary to use for the MeCab algorithm.
ta: _` டிக்ட் விருப்பம்` என்பது மெக்காப் வழிமுறைக்கு பயன்படுத்த வேண்டிய அகராதி.

source: Previously, Sphinx accepted only UTF-8 encoded sources.
ta: முன்னதாக, சூரரிமாச்சிலை utf-8 குறியிடப்பட்ட ஆதாரங்களை மட்டுமே ஏற்றுக்கொண்டது.

source: _`lib option` is the library name for finding the MeCab library via ctypes if the Python binding is not installed.
ta: பைதான் பிணைப்பு நிறுவப்படாவிட்டால் ctype கள் வழியாக மெக்காப் நூலகத்தைக் கண்டுபிடிப்பதற்கான நூலக பெயர் _` லிப் விருப்பம்.

source: For example::
ta: உதாரணத்திற்கு::

source: Options for ``'mecab'``:
ta: `` 'மெகாப்'`` க்கான விருப்பங்கள்:

source: _`user_dic option` is the user dictionary file path for Janome.
ta: _`user_dic விருப்பம்` என்பது சானோமுக்கான பயனர் அகராதி கோப்பு பாதை.

source: _`user_dic_enc option` is the encoding for the user dictionary file specified by ``user_dic`` option. Default is 'utf8'.
ta: _`user_dic_enc விருப்பம்` என்பது `` user_dic`` விருப்பத்தால் குறிப்பிடப்பட்ட பயனர் அகராதி கோப்பிற்கான குறியாக்கமாகும். இயல்புநிலை 'utf8'.

source: Options for ``'janome'``:
ta: `` 'janome'`` க்கான விருப்பங்கள்:

source: html_search_options for Japanese is re-organized and any custom splitter can be used by `type`_ settings.
ta: சப்பானியர்களுக்கான html_search_options மீண்டும் ஒழுங்கமைக்கப்படுகிறது மற்றும் எந்தவொரு தனிப்பயன் ச்ப்ளிட்டரையும் `வகை`_ அமைப்புகளால் பயன்படுத்தலாம்.

source: The Chinese support has these options:
ta: சீன ஆதரவில் இந்த விருப்பங்கள் உள்ளன:

source: ``dict`` -- the ``jieba`` dictionary path if want to use custom dictionary.
ta: தனிப்பயன் அகராதியைப் பயன்படுத்த விரும்பினால் `` டிக்ட்`` - `` சீபா` அகராதி பாதை.

source: The name of a JavaScript file (relative to the configuration directory) that implements a search results scorer. If empty, the default will be used.
ta: ஒரு தேடல் முடிவுகளை மதிப்பிடுபவரை செயல்படுத்தும் சாவாச்கிரிப்ட் கோப்பின் பெயர் (உள்ளமைவு கோப்பகத்துடன் தொடர்புடையது). காலியாக இருந்தால், இயல்புநிலை பயன்படுத்தப்படும்.

source: If true, images itself links to the original image if it doesn't have 'target' option or scale related options: 'scale', 'width', 'height'. The default is ``True``.
ta: உண்மை என்றால், படங்கள் அசல் படத்துடன் 'இலக்கு' விருப்பம் அல்லது அளவிலான தொடர்புடைய விருப்பங்கள் இல்லையென்றால் அதனுடன் இணைகின்றன: 'அளவுகோல்', 'அகலம்', 'உயரம்'. இயல்புநிலை `` உண்மை``.

source: If given, a dictionary of parser classes for different source suffices. The keys are the suffix, the values can be either a class or a string giving a fully-qualified name of a parser class. The parser class can be either ``docutils.parsers.Parser`` or :class:`sphinx.parsers.Parser`. Files with a suffix that is not in the dictionary will be parsed with the default reStructuredText parser.
ta: வழங்கப்பட்டால், வெவ்வேறு மூலங்களுக்கான பாகுபடுத்தி வகுப்புகளின் அகராதி போதுமானது. விசைகள் பின்னொட்டு, மதிப்புகள் ஒரு வகுப்பாக இருக்கலாம் அல்லது ஒரு பாகுபடுத்தி வகுப்பின் முழுமையான தகுதி வாய்ந்த பெயரைக் கொடுக்கும் சரமாக இருக்கலாம். பாகுபடுத்தி வகுப்பு `` docutils.parsers.parser` அல்லது: வகுப்பு: `sphinx.parsers.parser` ஆக இருக்கலாம். அகராதியில் இல்லாத பின்னொட்டுடன் கூடிய கோப்புகள் இயல்புநிலை மறுசீரமைப்பு செய்யப்பட்ட டெக்ச்ட் பாகுபடுத்தலுடன் பாகுபடுத்தப்படும்.

source: Output is processed with HTML5 writer. This feature needs docutils 0.13 or newer. Default is ``False``.
ta: வெளியீடு html5 எழுத்தாளருடன் செயலாக்கப்படுகிறது. இந்த அம்சத்திற்கு ஆவணங்கள் 0.13 அல்லது புதியவை தேவை. இயல்புநிலை `` பொய்``.

source: Options for HTML help output
ta: html உதவி வெளியீட்டிற்கான விருப்பங்கள்

source: Output file base name for HTML help builder. Default is ``'pydoc'``.
ta: html உதவி பில்டருக்கான வெளியீட்டு கோப்பு அடிப்படை பெயர். இயல்புநிலை `` 'பைடோக்'```.

source: Options for Apple Help output
ta: ஆப்பிள் உதவி வெளியீட்டிற்கான விருப்பங்கள்

source: These options influence the Apple Help output. This builder derives from the HTML builder, so the HTML options also apply where appropriate.
ta: இந்த விருப்பங்கள் ஆப்பிள் உதவி வெளியீட்டை பாதிக்கின்றன. இந்த பில்டர் html பில்டரிலிருந்து பெறப்படுகிறது, எனவே html விருப்பங்களும் பொருத்தமான இடங்களில் பொருந்தும்.

source: Apple Help output will only work on Mac OS X 10.6 and higher, as it requires the :program:`hiutil` and :program:`codesign` command line tools, neither of which are Open Source.
ta: ஆப்பிள் எல்ப் வெளியீடு மேக் ஓஎச் ஃச் 10.6 மற்றும் அதற்கு மேற்பட்டவற்றில் மட்டுமே வேலை செய்யும், ஏனெனில் அதற்கு தேவைப்படுகிறது: நிரல்: `இயூட்டில்` மற்றும்: நிரல்:` கோட் டின்` கட்டளை வரி கருவிகள், இவை எதுவும் திறந்த மூலமல்ல.

source: You can disable the use of these tools using :confval:`applehelp_disable_external_tools`, but the result will not be a valid help book until the indexer is run over the ``.lproj`` folders within the bundle.
ta: இந்த கருவிகளின் பயன்பாட்டை நீங்கள் முடக்கலாம்: confval: `applehelp_disable_external_tools`, ஆனால் மூட்டைக்குள் உள்ள` `.lproj`` கோப்புறைகளுக்கு மேல் குறியீட்டாளர் இயங்கும் வரை இதன் விளைவாக சரியான உதவி புத்தகமாக இருக்காது.

source: The basename for the Apple Help Book. Defaults to the :confval:`project` name.
ta: ஆப்பிள் உதவி புத்தகத்திற்கான அடிப்படை பெயர். இயல்புநிலைகள்: confval: `திட்டம்` பெயர்.

source: The bundle ID for the help book bundle.
ta: உதவி புத்தக மூட்டைக்கான மூட்டை ஐடி.

source: You *must* set this value in order to generate Apple Help.
ta: ஆப்பிள் உதவியை உருவாக்க இந்த மதிப்பை நீங்கள் * அமைக்க வேண்டும்.

source: The development region. Defaults to ``'en-us'``, which is Apple’s recommended setting.
ta: மேம்பாட்டு பகுதி. ஆப்பிளின் பரிந்துரைக்கப்பட்ட அமைப்பான `` 'en-us'`` க்கு இயல்புநிலை.

source: The bundle version (as a string). Defaults to ``'1'``.
ta: மூட்டை பதிப்பு (ஒரு சரமாக). இயல்புநிலை `` '1'`.

source: The help bundle icon file, or ``None`` for no icon. According to Apple’s documentation, this should be a 16-by-16 pixel version of the application’s icon with a transparent background, saved as a PNG file.
ta: உதவி மூட்டை ஐகான் கோப்பு, அல்லது `` எதுவுமில்லை`` ஐகானுக்கு இல்லை. ஆப்பிளின் ஆவணங்களின்படி, இது வெளிப்படையான பின்னணியுடன் பயன்பாட்டின் ஐகானின் 16-பை -16 படப்புள்ளி பதிப்பாக இருக்க வேண்டும், இது பி.என்.சி கோப்பாக சேமிக்கப்படுகிறது.

source: The product tag for use with :confval:`applehelp_kb_url`. Defaults to :samp:`'{<project>}-{<release>}'`.
ta: இதைப் பயன்படுத்துவதற்கான தயாரிப்பு குறிச்சொல்: confval: `applehelp_kb_url`. இயல்புநிலை: samp: `'{<திட்டம்>}-{<வெளியீடு>}'` `.

source: The URL for your knowledgebase server, e.g. ``https://example.com/kbsearch.py?p='product'&q='query'&l='lang'``. Help Viewer will replace the values ``'product'``, ``'query'`` and ``'lang'`` at runtime with the contents of :confval:`applehelp_kb_product`, the text entered by the user in the search box and the user’s system language respectively.
ta: உங்கள் அறிவுத் தள சேவையகத்திற்கான url, எ.கா. `` https: //example.com/kbsearch.py? p = 'தயாரிப்பு' & q = 'வினவல்' & l = 'lang'``. `` 'தயாரிப்பு', ``' வினவல்'```` மற்றும் `'' லாங்'`` ஆகியவற்றை உள்ளடக்கங்களுடன் மாற்றும் பார்வையாளர் மதிப்புகளை மாற்றுவார்: confval:` applehelp_kb_product` தேடல் பெட்டி மற்றும் பயனரின் கணினி மொழி முறையே.

source: Defaults to ``None`` for no remote search.
ta: தொலைநிலை தேடலுக்கு `` எதுவுமில்லை` `இயல்புநிலை.

source: The URL for remote content. You can place a copy of your Help Book’s ``Resources`` folder at this location and Help Viewer will attempt to use it to fetch updated content.
ta: தொலை உள்ளடக்கத்திற்கான url. இந்த இடத்தில் உங்கள் உதவி புத்தகத்தின் `` வளங்கள்` கோப்புறையின் நகலை நீங்கள் வைக்கலாம், மேலும் புதுப்பிக்கப்பட்ட உள்ளடக்கத்தைப் பெற பார்வையாளர் அதைப் பயன்படுத்த முயற்சிப்பார்.

source: e.g. if you set it to ``https://example.com/help/Foo/`` and Help Viewer wants a copy of ``index.html`` for an English speaking customer, it will look at ``https://example.com/help/Foo/en.lproj/index.html``.
ta: எ.கா. நீங்கள் அதை `` https: // example.com/help/foo/`என்று அமைத்தால், பார்வையாளர் ஒரு ஆங்கிலம் பேசும் வாடிக்கையாளருக்கு` `index.html`` இன் நகலை விரும்பினால், அது` `https:/ /example.com/help/foo/en.lproj/index.html``.

source: Defaults to ``None`` for no remote content.
ta: தொலைநிலை உள்ளடக்கத்திற்கு `` எதுவுமில்லை` `இயல்புநிலை.

source: If ``True``, tell the help indexer to index anchors in the generated HTML. This can be useful for jumping to a particular topic using the ``AHLookupAnchor`` function or the ``openHelpAnchor:inBook:`` method in your code. It also allows you to use ``help:anchor`` URLs; see the Apple documentation for more information on this topic.
ta: `` உண்மை` என்றால், உருவாக்கப்பட்ட html இல் உள்ள குறியீட்டு அறிவிப்பாளர்களிடம் உதவி குறியீட்டாளரிடம் சொல்லுங்கள். `` அஅ்லூக்குபஞ்சர்`` செயல்பாடு அல்லது `` ஓபன்எல்பஞ்சர்: இன் புக்: `` உங்கள் குறியீட்டில் முறையைப் பயன்படுத்தி ஒரு குறிப்பிட்ட தலைப்புக்குச் செல்ல இது பயனுள்ளதாக இருக்கும். இது `` உதவி: நங்கூரம்`` முகவரி களைப் பயன்படுத்தவும் உங்களை அனுமதிக்கிறது; இந்த தலைப்பைப் பற்றிய கூடுதல் தகவலுக்கு ஆப்பிள் ஆவணங்களைப் பார்க்கவும்.

source: Controls the minimum term length for the help indexer. Defaults to ``None``, which means the default will be used.
ta: உதவி குறியீட்டாளருக்கான குறைந்தபட்ச கால நீளத்தை கட்டுப்படுத்துகிறது. இயல்புநிலை `` எதுவுமில்லை``, அதாவது இயல்புநிலை பயன்படுத்தப்படும்.

source: Either a language specification (to use the built-in stopwords), or the path to a stopwords plist, or ``None`` if you do not want to use stopwords. The default stopwords plist can be found at ``/usr/share/hiutil/Stopwords.plist`` and contains, at time of writing, stopwords for the following languages:
ta: ஒரு மொழி விவரக்குறிப்பு (உள்ளமைக்கப்பட்ட நிறுத்தச் சொற்களைப் பயன்படுத்த), அல்லது ச்டாப்வேர்ட்ச் பிளிச்டுக்கான பாதை, அல்லது நீங்கள் நிறுத்தச் சொற்களைப் பயன்படுத்த விரும்பவில்லை என்றால் `` எதுவுமில்லை. இயல்புநிலை நிறுத்தச் சொற்கள் பிளைச்ட்டை ``/usr/share/hiutil/stopwords.plist`` இல் காணலாம், மேலும் எழுதும் நேரத்தில், பின்வரும் மொழிகளுக்கான நிறுத்தச் சொற்களைக் கொண்டுள்ளது:

source: Code
ta: குறியீடு

source: Language
ta: மொழி

source: English
ta: ஆங்கிலம்

source: German
ta: செர்மன்

source: de
ta: டி

source: Spanish
ta: ச்பானிச்

source: es
ta: எச்

source: French
ta: பிரஞ்சு

source: Swedish
ta: ச்வீடிச்

source: sv
ta: எச்.வி.

source: Hungarian
ta: அங்கேரியன்

source: hu
ta: உ

source: Italian
ta: இத்தாலிய

source: it
ta: அது

source: Defaults to :confval:`language`, or if that is not set, to :confval:`en`.
ta: இயல்புநிலை: confval: `மொழி`, அல்லது அது அமைக்கப்படாவிட்டால், அதற்கு: confval:` en`.
