Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_devguide_*.po
Languages: ta

source: For incompatible or other substantial changes that should wait until the next MAJOR release, use the ``master`` branch.
ta: அடுத்த பெரிய வெளியீடு வரை காத்திருக்க வேண்டிய பொருந்தாத அல்லது பிற கணிசமான மாற்றங்களுக்கு, `` மாச்டர்`` கிளையைப் பயன்படுத்தவும்.

source: For urgent release, a new PATCH branch must be branched from the newest release tag (see `Branch Model`_ for detail).
ta: அவசர வெளியீட்டிற்கு, ஒரு புதிய ஒட்டு கிளை புதிய வெளியீட்டு குறிச்சொல்லிலிருந்து கிளை இருக்க வேண்டும் (விவரங்களுக்கு `கிளை மாதிரி`_ ஐப் பார்க்கவும்).

source: Setup a virtual environment.
ta: மெய்நிகர் சூழலை அமைக்கவும்.

source: This is not necessary for unit testing, thanks to ``tox``, but it is necessary if you wish to run ``sphinx-build`` locally or run unit tests without the help of ``tox``. ::
ta: யூனிட் சோதனைக்கு இது அவசியமில்லை, `` டாக்ச்`` க்கு நன்றி, ஆனால் நீங்கள் `` ச்பின்க்ச்-பில்ட்`` ஐ உள்நாட்டில் இயக்க விரும்பினால் அல்லது `` டாக்ச்`` உதவியின்றி யூனிட் சோதனைகளை இயக்க விரும்பினால் அவசியம். ::

source: Create a new working branch. Choose any name you like. ::
ta: ஒரு புதிய வேலை கிளையை உருவாக்கவும். நீங்கள் விரும்பும் எந்த பெயரையும் தேர்வு செய்யவும். ::

source: Hack, hack, hack.
ta: ஏக், ஏக், ஏக்.

source: For tips on working with the code, see the `Coding Guide`_.
ta: குறியீட்டுடன் பணிபுரிவதற்கான உதவிக்குறிப்புகளுக்கு, `குறியீட்டு வழிகாட்டி`_ ஐப் பார்க்கவும்.

source: Test, test, test.
ta: சோதனை, சோதனை, சோதனை.

source: Testing is best done through ``tox``, which provides a number of targets and allows testing against multiple different Python environments:
ta: சோதனை `` டோக்ச்`` மூலம் சிறப்பாக செய்யப்படுகிறது, இது பல இலக்குகளை வழங்குகிறது மற்றும் பல வேறுபட்ட பைதான் சூழல்களுக்கு எதிராக சோதனைக்கு அனுமதிக்கிறது:

source: To list all possible targets::
ta: சாத்தியமான அனைத்து இலக்குகளையும் பட்டியலிட ::

source: To run unit tests for a specific Python version, such as 3.6::
ta: 3.6 :: போன்ற ஒரு குறிப்பிட்ட பைதான் பதிப்பிற்கான அலகு சோதனைகளை இயக்க

source: To run unit tests for a specific Python version and turn on deprecation warnings on so they're shown in the test output::
ta: ஒரு குறிப்பிட்ட பைதான் பதிப்பிற்கான அலகு சோதனைகளை இயக்கவும், தேய்மான எச்சரிக்கைகளை இயக்கவும், எனவே அவை சோதனை வெளியீட்டில் காட்டப்பட்டுள்ளன ::

source: To run code style and type checks::
ta: குறியீடு பாணியை இயக்கி காசோலைகளைத் தட்டச்சு செய்ய ::

source: Arguments to ``pytest`` can be passed via ``tox``, e.g. in order to run a particular test::
ta: `` pytest`` க்கான வாதங்களை `` டோக்ச்`` வழியாக அனுப்பலாம், எ.கா. ஒரு குறிப்பிட்ட சோதனையை இயக்குவதற்காக ::

source: The Sphinx source code is managed using Git and is hosted on GitHub.
ta: சூரரிமாச்சிலை மூலக் குறியீடு git ஐப் பயன்படுத்தி நிர்வகிக்கப்படுகிறது மற்றும் கிட்அப்பில் புரவலன் செய்யப்படுகிறது.

source: To build the documentation::
ta: ஆவணங்களை உருவாக்க ::

source: To build the documentation in multiple formats::
ta: பல வடிவங்களில் ஆவணங்களை உருவாக்க ::

source: To run JavaScript tests with `Karma <https://karma-runner.github.io>`_, execute the following commands (requires `Node.js <https://nodejs.org>`_)::
ta: `கர்மா <https://karma-runner.github.io> _ _ உடன் சாவாச்கிரிப்ட் சோதனைகளை இயக்க, பின்வரும் கட்டளைகளை இயக்கவும் (` node.js <https://nodejs.org> `_) ::

source: You can also test by installing dependencies in your local environment. ::
ta: உங்கள் உள்ளக சூழலில் சார்புகளை நிறுவுவதன் மூலமும் நீங்கள் சோதிக்கலாம். ::

source: git clone git://github.com/sphinx-doc/sphinx
ta: git நகலி கிட்: //github.com/sphinx-doc/sphinx

source: New unit tests should be included in the ``tests`` directory where necessary:
ta: புதிய அலகு சோதனைகள் தேவையான இடங்களில் `` சோதனைகள்` `கோப்பகத்தில் சேர்க்கப்பட வேண்டும்:

source: For bug fixes, first add a test that fails without your changes and passes after they are applied.
ta: பிழை திருத்தங்களுக்கு, முதலில் உங்கள் மாற்றங்கள் இல்லாமல் தோல்வியுற்ற ஒரு சோதனையைச் சேர்க்கவும், அவை பயன்படுத்தப்பட்ட பிறகு கடந்து செல்கின்றன.

source: Tests that need a ``sphinx-build`` run should be integrated in one of the existing test modules if possible. New tests that to ``@with_app`` and then ``build_all`` for a few assertions are not good since *the test suite should not take more than a minute to run*.
ta: `` ச்பின்க்ச்-பில்ட்`` ரன் தேவைப்படும் சோதனைகள் முடிந்தால் தற்போதுள்ள சோதனை தொகுதிகளில் ஒன்றில் ஒருங்கிணைக்கப்பட வேண்டும். புதிய சோதனைகள் ``@with_app``, பின்னர் `` பில்ட்_ஆல்`` ஒரு சில கூற்றுக்களுக்கு நல்லதல்ல, ஏனெனில் *சோதனை தொகுப்பு இயக்க ஒரு நிமிடத்திற்கு மேல் ஆகக்கூடாது *.

source: Please add a bullet point to :file:`CHANGES` if the fix or feature is not trivial (small doc updates, typo fixes). Then commit::
ta: தயவுசெய்து ஒரு புல்லட் புள்ளியைச் சேர்க்கவும்: கோப்பு: `மாற்றங்கள்` பிழைத்திருத்தம் அல்லது நற்பொருத்தம் அற்பமானதாக இல்லாவிட்டால் (சிறிய டாக் புதுப்பிப்புகள், எழுத்துப்பிழை திருத்தங்கள்). பின்னர் செய்யுங்கள் ::

source: GitHub recognizes certain phrases that can be used to automatically update the issue tracker.
ta: வெளியீடு டிராக்கரை தானாகவே புதுப்பிக்க பயன்படுத்தக்கூடிய சில சொற்றொடர்களை அறிவிலிமையம் அங்கீகரிக்கிறார்.

source: For example::
ta: உதாரணத்திற்கு::

source: would close issue #42.
ta: வெளியீடு #42 ஐ மூடிவிடும்.

source: Push changes in the branch to your forked repository on GitHub. ::
ta: கிதுபில் உங்கள் முட்கரண்டி களஞ்சியத்திற்கு கிளையில் மாற்றங்களைத் தள்ளுங்கள். ::

source: Community
ta: சமூக

source: Submit a pull request from your branch to the respective branch (``master`` or ``A.x``).
ta: உங்கள் கிளையிலிருந்து ஒரு இழுப்பு கோரிக்கையை அந்தந்த கிளைக்கு சமர்ப்பிக்கவும் (`` மாச்டர்`` அல்லது `a.x```).

source: Wait for a core developer to review your changes.
ta: உங்கள் மாற்றங்களை மதிப்பாய்வு செய்ய ஒரு முக்கிய உருவாக்குபவர் காத்திருங்கள்.

source: Translations
ta: மொழிபெயர்ப்புகள்

source: The Sphinx core messages and documentations are translated on `Transifex <https://www.transifex.com/>`_. Please join `Sphinx project on Transifex <https://www.transifex.com/sphinx-doc/>`_ and translate them.
ta: சூரரிமாச்சிலை கோர் செய்திகள் மற்றும் ஆவணங்கள் `டிரான்ச்ஃபெக்ச் <https://www.transifex.com/> _ _ இல் மொழிபெயர்க்கப்பட்டுள்ளன. டிரான்ச்ஃபெக்ச் <https://www.transifex.com/sphinx-doc/> _ _ இல் `ச்பின்க்ச் திட்டத்தில் சேர்ந்து அவற்றை மொழிபெயர்க்கவும்.

source: Core Developers
ta: கோர் உருவாக்குபவர்கள்

source: The core developers of Sphinx have write access to the main repository. They can commit changes, accept/reject pull requests, and manage items on the issue tracker.
ta: சூரரிமாச்சிலை இன் முக்கிய உருவாக்குபவர்கள் முக்கிய களஞ்சியத்திற்கு எழுதும் அணுகலைக் கொண்டுள்ளனர். அவர்கள் மாற்றங்களைச் செய்யலாம், இழுக்கும் கோரிக்கைகளை ஏற்றுக்கொள்ளலாம்/நிராகரிக்கலாம் மற்றும் வெளியீடு டிராக்கரில் உருப்படிகளை நிர்வகிக்கலாம்.

source: Mailing list for user support.
ta: பயனர் ஆதரவுக்கு அஞ்சல் பட்டியல்.

source: sphinx-users <sphinx-users@googlegroups.com>
ta: sphinx- பயனர்கள் <sphinx-users@googlegroups.com>

source: You do not need to be a core developer or have write access to be involved in the development of Sphinx. You can submit patches or create pull requests from forked repositories and have a core developer add the changes for you.
ta: நீங்கள் ஒரு முக்கிய டெவலப்பராக இருக்க வேண்டிய அவசியமில்லை அல்லது ச்பிங்கின் வளர்ச்சியில் ஈடுபடுவதற்கு எழுதும் அணுகல் இருக்க வேண்டும். நீங்கள் திட்டுகளைச் சமர்ப்பிக்கலாம் அல்லது முட்கரண்டி களஞ்சியங்களிலிருந்து இழுக்கும் கோரிக்கைகளை உருவாக்கலாம் மற்றும் ஒரு முக்கிய உருவாக்குபவர் உங்களுக்காக மாற்றங்களைச் சேர்க்கலாம்.

source: The following are some general guidelines for core developers:
ta: முக்கிய டெவலப்பர்களுக்கான சில பொதுவான வழிகாட்டுதல்கள் பின்வருமாறு:

source: Questionable or extensive changes should be submitted as a pull request instead of being committed directly to the main repository. The pull request should be reviewed by another core developer before it is merged.
ta: கேள்விக்குரிய அல்லது விரிவான மாற்றங்கள் முதன்மையான களஞ்சியத்திற்கு நேரடியாகச் செய்வதற்குப் பதிலாக இழுப்பு கோரிக்கையாக சமர்ப்பிக்கப்பட வேண்டும். இழுத்தல் கோரிக்கையை ஒன்றிணைப்பதற்கு முன்பு மற்றொரு கோர் டெவலப்பரால் மதிப்பாய்வு செய்யப்பட வேண்டும்.

source: Trivial changes can be committed directly but be sure to keep the repository in a good working state and that all tests pass before pushing your changes.
ta: அற்ப மாற்றங்கள் நேரடியாக செய்யப்படலாம், ஆனால் களஞ்சியத்தை ஒரு நல்ல வேலை நிலையில் வைத்திருக்க மறக்காதீர்கள், மேலும் உங்கள் மாற்றங்களைத் தள்ளும் முன் அனைத்து சோதனைகளும் கடந்து செல்கின்றன.

source: When committing code written by someone else, please attribute the original author in the commit message and any relevant :file:`CHANGES` entry.
ta: வேறொருவரால் எழுதப்பட்ட குறியீட்டைச் செய்யும்போது, தயவுசெய்து அசல் எழுத்தாளரை கமிட் செய்தியில் காரணம் கூறவும், தொடர்புடைய ஏதேனும்: கோப்பு: `மாற்றங்கள்` நுழைவு.

source: Coding Guide
ta: குறியீட்டு வழிகாட்டி

source: Try to use the same code style as used in the rest of the project. See the `Pocoo Styleguide`__ for more information.
ta: திட்டத்தின் மீதமுள்ள அதே குறியீடு பாணியைப் பயன்படுத்த முயற்சிக்கவும். மேலும் தகவலுக்கு `போகூ ச்டைல்கைட்`__ ஐப் பார்க்கவும்.

source: For non-trivial changes, please update the :file:`CHANGES` file. If your changes alter existing behavior, please document this.
ta: கீழான மாற்றங்களுக்கு, தயவுசெய்து புதுப்பிக்கவும்: கோப்பு: `மாற்றங்கள்` கோப்பு. உங்கள் மாற்றங்கள் ஏற்கனவே இருக்கும் நடத்தையை மாற்றினால், இதை ஆவணப்படுத்தவும்.

source: Mailing list for development related discussions.
ta: வளர்ச்சி தொடர்பான விவாதங்களுக்கான அஞ்சல் பட்டியல்.

source: New features should be documented. Include examples and use cases where appropriate. If possible, include a sample that is displayed in the generated output.
ta: புதிய நற்பொருத்தங்கள் ஆவணப்படுத்தப்பட வேண்டும். எடுத்துக்காட்டுகளைச் சேர்த்து, பொருத்தமான இடங்களில் வழக்குகளைப் பயன்படுத்துங்கள். முடிந்தால், உருவாக்கப்பட்ட வெளியீட்டில் காட்டப்படும் மாதிரியைச் சேர்க்கவும்.

source: When adding a new configuration variable, be sure to document it and update :file:`sphinx/cmd/quickstart.py` if it's important enough.
ta: புதிய உள்ளமைவு மாறியைச் சேர்க்கும்போது, அதை ஆவணப்படுத்தவும் புதுப்பிக்கவும் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்: கோப்பு: `sphinx/cmd/quickstart.py` இது போதுமானதாக இருந்தால்.

source: Add appropriate unit tests.
ta: பொருத்தமான அலகு சோதனைகளைச் சேர்க்கவும்.

source: Debugging Tips
ta: பிழைத்திருத்த உதவிக்குறிப்புகள்

source: Delete the build cache before building documents if you make changes in the code by running the command ``make clean`` or using the :option:`sphinx-build -E` option.
ta: ஆவணங்களை உருவாக்குவதற்கு முன் பில்ட் கேச் நீக்கு `` சுத்தமாக `cheal`` கட்டளையை இயக்குவதன் மூலம் குறியீட்டில் மாற்றங்களைச் செய்தால் அல்லது: விருப்பத்தைப் பயன்படுத்துங்கள்:` ச்பின்க்ச் -பில்ட் -e` விருப்பத்தைப் பயன்படுத்துங்கள்.

source: Use the :option:`sphinx-build -P` option to run ``pdb`` on exceptions.
ta: விதிவிலக்குகளில் `` pdb`` ஐ இயக்க `sphinx-tpuild -p` விருப்பத்தைப் பயன்படுத்தவும்.

source: Use ``node.pformat()`` and ``node.asdom().toxml()`` to generate a printable representation of the document structure.
ta: ஆவண கட்டமைப்பின் அச்சிடக்கூடிய பிரதிநிதித்துவத்தை உருவாக்க `` node.pformat () `` மற்றும் `node.asdom ().

source: Set the configuration variable :confval:`keep_warnings` to ``True`` so warnings will be displayed in the generated output.
ta: உள்ளமைவு மாறியை அமைக்கவும்: confval: `beak_warnings` க்கு` `உண்மை`` எனவே எச்சரிக்கைகள் உருவாக்கப்பட்ட வெளியீட்டில் காண்பிக்கப்படும்.

source: Set the configuration variable :confval:`nitpicky` to ``True`` so that Sphinx will complain about references without a known target.
ta: உள்ளமைவு மாறியை அமைக்கவும்: confval: `nitpicky`` `உண்மை`` ஆக, அறியப்பட்ட இலக்கு இல்லாமல் குறிப்புகள் குறித்து ச்பின்க்ச் குற்றச்சாட்டு அளிப்பார்.

source: Set the debugging options in the `Docutils configuration file <http://docutils.sourceforge.net/docs/user/config.html>`_.
ta: பிழைத்திருத்த விருப்பங்களை `டாக்யூடில்ச் உள்ளமைவு கோப்பில் <http://docutils.sourceforge.net/docs/user/config.html>` _ இல் அமைக்கவும்.

source: IRC channel for development questions and user support.
ta: மேம்பாட்டு கேள்விகள் மற்றும் பயனர் ஆதரவுக்கான ஐ.ஆர்.சி சேனல்.

source: JavaScript stemming algorithms in ``sphinx/search/*.py`` (except ``en.py``) are generated by this `modified snowballcode generator <https://github.com/shibukawa/snowball>`_. Generated `JSX <https://jsx.github.io/>`_ files are in `this repository <https://github.com/shibukawa/snowball-stemmer.jsx>`_. You can get the resulting JavaScript files using the following command::
ta: `` ச்பின்க்ச்/தேடல்/*இல் சாவாச்கிரிப்ட் ச்டெமிங் வழிமுறைகள். உருவாக்கப்பட்ட `jsx <https://jsx.github.io/>` _ கோப்புகள் `இந்த களஞ்சியத்தில் <https://github.com/shibukawa/snowball-stemmer.jsx>` _. இதன் விளைவாக வரும் சாவாச்கிரிப்ட் கோப்புகளை பின்வரும் கட்டளையைப் பயன்படுத்தி பெறலாம் ::

source: #sphinx-doc on irc.freenode.net
ta: irc.freenode.net இல் #sphinx-doc

source: Branch Model
ta: கிளை மாதிரி

source: Sphinx project uses following branches for developing that conforms to Semantic Versioning 2.0.0 (refs: https://semver.org/ ).
ta: சொற்பொருள் பதிப்பு 2.0.0 (refs: https://semver.org/) உடன் இணங்குவதற்கு சூரரிமாச்சிலை திட்டம் பின்வரும் கிளைகளைப் பயன்படுத்துகிறது.

source: Development for MAJOR version. All changes including incompatible behaviors and public API updates are allowed.
ta: முக்கிய பதிப்பிற்கான வளர்ச்சி. பொருந்தாத நடத்தைகள் மற்றும் பொது பநிஇ புதுப்பிப்புகள் உள்ளிட்ட அனைத்து மாற்றங்களும் அனுமதிக்கப்படுகின்றன.

source: ``master``
ta: `` மாச்டர்``

source: Where ``A.x`` is the ``MAJOR.MINOR`` release. Used to maintain current MINOR release. All changes are allowed if the change preserves backwards-compatibility of API and features.
ta: `` a.x`` என்பது `` மேசர்.மினோர்`` வெளியீடு. தற்போதைய சிறிய வெளியீட்டைப் பராமரிக்கப் பயன்படுகிறது. மாற்றம் பநிஇ மற்றும் அம்சங்களின் பின்னோக்கி-இணக்கத்தன்மை மற்றும் அம்சங்களை பாதுகாத்தால் அனைத்து மாற்றங்களும் அனுமதிக்கப்படுகின்றன.

source: Only the most recent ``MAJOR.MINOR`` branch is currently retained. When a new MAJOR version is released, the old ``MAJOR.MINOR`` branch will be deleted and replaced by an equivalent tag.
ta: மிக அண்மைக் கால `` மேசர்.மினோர்`` கிளை மட்டுமே தற்போது தக்கவைக்கப்பட்டுள்ளது. ஒரு புதிய பெரிய பதிப்பு வெளியிடப்படும் போது, பழைய `` மேசர்.மினோர்`` கிளை நீக்கப்பட்டு அதற்கு சமமான குறிச்சொல்லால் மாற்றப்படும்.

source: ``A.x`` (ex. ``2.x``)
ta: `` a.x`` (எ.கா. `` 2.x``)

source: Where ``A.B.x`` is the ``MAJOR.MINOR.PATCH`` release. Only backwards-compatible bug fixes are allowed. In Sphinx project, PATCH version is used for urgent bug fix.
ta: `` a.b.x`` என்பது `` mager.minor.patch`` வெளியீடு. பின்னோக்கி-இணக்கமான பிழை திருத்தங்கள் மட்டுமே அனுமதிக்கப்படுகின்றன. சூரரிமாச்சிலை திட்டத்தில், அவசர பிழை பிழைத்திருத்தத்திற்கு ஒட்டு பதிப்பு பயன்படுத்தப்படுகிறது.

source: ``MAJOR.MINOR.PATCH`` branch will be branched from the ``v`` prefixed release tag (ex. make 2.3.1 that branched from v2.3.0) when a urgent release is needed. When new PATCH version is released, the branch will be deleted and replaced by an equivalent tag (ex. v2.3.1).
ta: `` magen.minor.patch`` கிளை `v`` முன்னொட்டு வெளியீட்டு குறிச்சொல்லிலிருந்து (எ.கா. புதிய ஒட்டு பதிப்பு வெளியிடப்படும் போது, கிளை நீக்கப்பட்டு அதற்கு சமமான குறிச்சொல்லால் மாற்றப்படும் (எ.கா. v2.3.1).

source: Bug Reports and Feature Requests
ta: பிழை அறிக்கைகள் மற்றும் அம்ச கோரிக்கைகள்

source: ``A.B.x`` (ex. ``2.4.x``)
ta: `` a.b.x`` (எ.கா. `` 2.4.x``)

source: Deprecating a feature
ta: ஒரு அம்சத்தை நீக்குகிறது

source: There are a couple reasons that code in Sphinx might be deprecated:
ta: சூரரிமாச்சிலை இல் குறியீடு நீக்கப்படலாம் என்று இரண்டு காரணங்கள் உள்ளன:

source: If a feature has been improved or modified in a backwards-incompatible way, the old feature or behavior will be deprecated.
ta: ஒரு நற்பொருத்தம் பின்னோக்கி-இணக்கமான வழியில் மேம்படுத்தப்பட்டிருந்தால் அல்லது மாற்றியமைக்கப்பட்டிருந்தால், பழைய நற்பொருத்தம் அல்லது நடத்தை நீக்கப்படும்.

source: Sometimes Sphinx will include a backport of a Python library that's not included in a version of Python that Sphinx currently supports. When Sphinx no longer needs to support the older version of Python that doesn't include the library, the library will be deprecated in Sphinx.
ta: சில நேரங்களில் ச்பிங்க்சில் ஒரு பைதான் நூலகத்தின் பின்னணி அடங்கும், இது பைதனின் பதிப்பில் சேர்க்கப்படவில்லை, இது சூரரிமாச்சிலை தற்போது ஆதரிக்கும். நூலகத்தை சேர்க்காத பைத்தானின் பழைய பதிப்பை சூரரிமாச்சிலை இனி ஆதரிக்க வேண்டியதில்லை, நூலகம் ச்பிங்க்சில் நீக்கப்படும்.

source: As the :ref:`deprecation-policy` describes, the first release of Sphinx that deprecates a feature (``A.B``) should raise a ``RemovedInSphinxXXWarning`` (where ``XX`` is the Sphinx version where the feature will be removed) when the deprecated feature is invoked. Assuming we have good test coverage, these warnings are converted to errors when running the test suite with warnings enabled::
ta: இது: ref: `டிப்ரெக்சன்-பாலிசி` விவரிக்கிறது, ஒரு அம்சத்தை (` a.b``) மதிப்பிடும் சூரரிமாச்சிலை இன் முதல் வெளியீடு `` `` `` `` `xx`` என்பது சூரரிமாச்சிலை பதிப்பாகும் நீக்கப்படும்) நீக்கப்பட்ட நற்பொருத்தம் செயல்படுத்தப்படும் போது. எங்களுக்கு நல்ல சோதனைக் கவரேச் இருப்பதாகக் கருதி, இந்த எச்சரிக்கைகள் சோதனை தொகுப்பை இயக்கும் போது பிழைகள் என மாற்றப்படுகின்றன ::

source: If you have encountered a problem with Sphinx or have an idea for a new feature, please submit it to the `issue tracker`_ on GitHub or discuss it on the `sphinx-dev`_ mailing list.
ta: நீங்கள் ச்பிங்க்சுடன் ஒரு சிக்கலை சந்தித்திருந்தால் அல்லது புதிய அம்சத்திற்கான சிந்தனை இருந்தால், தயவுசெய்து அதை கிதுபில் உள்ள `வெளியீடு டிராக்கர்`_ க்கு சமர்ப்பிக்கவும் அல்லது` ச்பின்க்ச்-டிஇவி`_ அஞ்சல் பட்டியலில் விவாதிக்கவும்.

source: Thus, when adding a ``RemovedInSphinxXXWarning`` you need to eliminate or silence any warnings generated when running the tests.
ta: ஆகவே, `` `` `` `removedinsphinxxxwarning`` ஐச் சேர்க்கும்போது, சோதனைகளை இயக்கும் போது உருவாக்கப்பட்ட எந்த எச்சரிக்கைகளையும் அகற்றவோ அல்லது ம silence னமாக்கவோ வேண்டும்.

source: Deprecation policy
ta: மதிப்பிழப்பு கொள்கை

source: MAJOR and MINOR releases may deprecate certain features from previous releases. If a feature is deprecated in a release A.x, it will continue to work in all A.x.x versions (for all versions of x). It will continue to work in all B.x.x versions but raise deprecation warnings. Deprecated features will be removed at the C.0.0. It means the deprecated feature will work during 2 MAJOR releases at least.
ta: முக்கிய மற்றும் சிறிய வெளியீடுகள் முந்தைய வெளியீடுகளிலிருந்து சில அம்சங்களை குறைக்கக்கூடும். வெளியீட்டு a.x இல் ஒரு நற்பொருத்தம் நீக்கப்பட்டால், அது அனைத்து a.x.x பதிப்புகளிலும் (x இன் அனைத்து பதிப்புகளுக்கும்) தொடர்ந்து செயல்படும். இது அனைத்து b.x.x பதிப்புகளிலும் தொடர்ந்து செயல்படும், ஆனால் தேய்மான எச்சரிக்கைகளை எழுப்புகிறது. நீக்கப்பட்ட நற்பொருத்தங்கள் c.0.0 இல் அகற்றப்படும். இதன் பொருள் குறைந்தது 2 பெரிய வெளியீடுகளின் போது நீக்கப்பட்ட நற்பொருத்தம் செயல்படும்.

source: So, for example, if we decided to start the deprecation of a function in Sphinx 2.x:
ta: எனவே, எடுத்துக்காட்டாக, சூரரிமாச்சிலை 2.x இல் ஒரு செயல்பாட்டின் மதிப்பிழப்பைத் தொடங்க முடிவு செய்தால்:

source: Sphinx 2.x will contain a backwards-compatible replica of the function which will raise a ``RemovedInSphinx40Warning``. This is a subclass of :exc:`python:PendingDeprecationWarning`, i.e. it will not get displayed by default.
ta: சூரரிமாச்சிலை 2.x செயல்பாட்டின் பின்னோக்கி-இணக்கமான பிரதி கொண்டிருக்கும், இது `` remodedinsphinx40 wwarning`` ஐ உயர்த்தும். இது ஒரு துணைப்பிரிவாகும்: exc: `பைதான்: நிலுவையில் உள்ள டெப்ரெசேசன் வார்னிங்`, அதாவது இது இயல்பாகவே காண்பிக்கப்படாது.

source: Sphinx 3.x will still contain the backwards-compatible replica, but ``RemovedInSphinx40Warning`` will be a subclass of :exc:`python:DeprecationWarning` then, and gets displayed by default.
ta: சூரரிமாச்சிலை 3.x இன்னும் பின்னோக்கி-இணக்கமான பிரதி கொண்டிருக்கும், ஆனால் `` `` `` `` remodedinsphinx40 warning`` ஒரு துணைப்பிரிவாக இருக்கும்: exc: `பைதான்: டிபிரேசன்வேரிங்` பின்னர் இயல்பாகவே காட்டப்படும்.

source: Sphinx 4.0 will remove the feature outright.
ta: சூரரிமாச்சிலை 4.0 அம்சத்தை முழுமையாக அகற்றும்.

source: Deprecation warnings
ta: தேய்மான எச்சரிக்கைகள்

source: Sphinx will enable its ``RemovedInNextVersionWarning`` warnings by default, if :envvar:`python:PYTHONWARNINGS` is not set. Therefore you can disable them using:
ta: ச்பின்க்ச் அதன் `` `` `` removedinnextversionwharning`` எச்சரிக்கைகளை இயல்புநிலையாக இயக்கும், if: envvar: `பைதான்: பைத்தான்வார்னிங்ச்` அமைக்கப்படவில்லை. எனவே நீங்கள் அவற்றைப் பயன்படுத்தி முடக்கலாம்:

source: For bug reports, please include the output produced during the build process and also the log file Sphinx creates after it encounters an unhandled exception. The location of this file should be shown towards the end of the error message.
ta: பிழை அறிக்கைகளுக்கு, உருவாக்கும் செயல்முறையின் போது தயாரிக்கப்பட்ட வெளியீட்டைச் சேர்க்கவும், மேலும் பதிவுசெய்த விதிவிலக்கை எதிர்கொண்ட பிறகு சூரரிமாச்சிலை உருவாக்கும் பதிவு கோப்பு. இந்த கோப்பின் இருப்பிடம் பிழை செய்தியின் முடிவில் காட்டப்பட வேண்டும்.

source: ``PYTHONWARNINGS= make html`` (Linux/Mac)
ta: `` பைதன்வார்னிங்ச் = html`` (லினக்ச்/மேக்) உருவாக்குங்கள்

source: ``export PYTHONWARNINGS=`` and do ``make html`` (Linux/Mac)
ta: `` பைதன்வார்னிங்ச் = `` ஏற்றுமதி செய்து `` html` (லினக்ச்/மேக்) செய்யுங்கள்

source: ``set PYTHONWARNINGS=`` and do ``make html`` (Windows)
ta: `` பைதன்வார்னிங்ச் = `` ஐ அமைத்து, `` html` (விண்டோச்) செய்யுங்கள்

source: But you can also explicitly enable the pending ones using e.g. ``PYTHONWARNINGS=default`` (see the :ref:`Python docs on configuring warnings <python:describing-warning-filters>`) for more details.
ta: ஆனால் எ.கா. பயன்படுத்தி நிலுவையில் உள்ளவர்களை நீங்கள் வெளிப்படையாக இயக்கலாம். `` பைதன்வார்னிங்ச் = இயல்புநிலை`` (பார்க்க: குறிப்பு: `எச்சரிக்கைகளை உள்ளமைக்கும் பைதான் டாக்ச் <பைதான்:-வேட்டையாடும்-வடிகட்டிகள்>`) மேலும் விவரங்களுக்கு.

source: Unit Testing
ta: அலகு சோதனை

source: Sphinx has been tested with pytest runner. Sphinx developers write unit tests using pytest notation. Utility functions and pytest fixtures for testing are provided in ``sphinx.testing``. If you are a developer of Sphinx extensions, you can write unit tests with using pytest. At this time, ``sphinx.testing`` will help your test implementation.
ta: சூரரிமாச்சிலை பைடெச்ட் ரன்னருடன் சோதிக்கப்பட்டுள்ளது. சூரரிமாச்சிலை உருவாக்குபவர்கள் பைட்டெச்ட் குறியீட்டைப் பயன்படுத்தி அலகு சோதனைகளை எழுதுகிறார்கள். பயன்பாட்டு செயல்பாடுகள் மற்றும் சோதனைக்கான பைட்டெச்ட் சாதனங்கள் `` sphinx.testing`` இல் வழங்கப்படுகின்றன. நீங்கள் சூரரிமாச்சிலை நீட்டிப்புகளின் டெவலப்பராக இருந்தால், பைட்டெச்ட்டைப் பயன்படுத்தி அலகு சோதனைகளை எழுதலாம். இந்த நேரத்தில், `` sphinx.testing`` உங்கள் சோதனை செயல்படுத்த உதவும்.

source: How to use pytest fixtures that are provided by ``sphinx.testing``? You can require ``'sphinx.testing.fixtures'`` in your test modules or ``conftest.py`` files like this::
ta: `` sphinx.testing`` ஆல் வழங்கப்படும் பைட்டெச்ட் சாதனங்களை எவ்வாறு பயன்படுத்துவது? உங்கள் சோதனை தொகுதிகளில் `` 'sphinx.testing.fixtures'`` தேவைப்படலாம் அல்லது இது போன்ற `` confftest.py`` கோப்புகள் ::

source: Sphinx Developer's Guide
ta: சூரரிமாச்சிலை டெவலப்பரின் வழிகாட்டி

source: If you want to know more detailed usage, please refer to ``tests/conftest.py`` and other ``test_*.py`` files under ``tests`` directory.
ta: இன்னும் விரிவான பயன்பாட்டை நீங்கள் அறிய விரும்பினால், தயவுசெய்து `` சோதனைகள்/confftest.py`` மற்றும் பிற `சோதனை _*.` `சோதனைகள்` கோப்பகத்தின் கீழ் பை`` கோப்புகளைப் பார்க்கவும்.

source: Prior to Sphinx - 1.5.2, Sphinx was running the test with nose.
ta: ச்பின்க்சுக்கு முன்பு - 1.5.2, சூரரிமாச்சிலை மூக்குடன் சோதனையை இயக்கியது.

source: ``sphinx.testing`` as a experimental.
ta: `` sphinx.testing`` ஒரு சோதனையாக.

source: Sphinx also runs JavaScript tests.
ta: சூரரிமாச்சிலை சாவாச்கிரிப்ட் சோதனைகளையும் இயக்குகிறது.

source: Release procedures
ta: வெளியீட்டு நடைமுறைகள்
