Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_config_*.po
Languages: ta

source: Specifies the locale to generate help for. This is used to determine the name of the ``.lproj`` folder inside the Help Book’s ``Resources``, and is passed to the help indexer.
ta: உதவியை உருவாக்க இருப்பிடத்தைக் குறிப்பிடுகிறது. உதவி புத்தகத்தின் `` வளங்கள்`` க்குள் `` .lproj`` கோப்புறையின் பெயரைத் தீர்மானிக்க இது பயன்படுத்தப்படுகிறது, மேலும் இது உதவி குறியீட்டாளருக்கு அனுப்பப்படுகிறது.

source: Read more about how to use Markdown with Sphinx at :ref:`markdown`.
ta: சூரரிமாச்சிலை உடன் மார்க் டவுனை எவ்வாறு பயன்படுத்துவது என்பது பற்றி மேலும் வாசிக்க: ref: `markdown`.

source: Specifies the help book title. Defaults to :samp:`'{<project>} Help'`.
ta: உதவி புத்தக தலைப்பைக் குறிப்பிடுகிறது. இயல்புநிலைகள்: samp: `'{<proget>} well'`.

source: Specifies the identity to use for code signing, or ``None`` if code signing is not to be performed.
ta: குறியீடு கையொப்பத்திற்கு பயன்படுத்த அடையாளத்தைக் குறிப்பிடுகிறது, அல்லது குறியீடு கையொப்பமிடுதல் செய்யப்படாவிட்டால் `` எதுவுமில்லை``.

source: Defaults to the value of the environment variable ``CODE_SIGN_IDENTITY``, which is set by Xcode for script build phases, or ``None`` if that variable is not set.
ta: சுற்றுச்சூழல் மாறியின் மதிப்புக்கு இயல்புநிலை `` code_sign_identity``, இது ச்கிரிப்ட் உருவாக்கும் கட்டங்களுக்காக xcode ஆல் அமைக்கப்படுகிறது, அல்லது அந்த மாறி அமைக்கப்படாவிட்டால் `` எதுவுமில்லை.

source: A *list* of additional arguments to pass to :program:`codesign` when signing the help book.
ta: உதவ கூடுதல் வாதங்களின் * பட்டியல் * உதவி புத்தகத்தில் கையொப்பமிடும்போது `codesign`.

source: Defaults to a list based on the value of the environment variable ``OTHER_CODE_SIGN_FLAGS``, which is set by Xcode for script build phases, or the empty list if that variable is not set.
ta: சுற்றுச்சூழல் மாறியின் மதிப்பின் அடிப்படையில் ஒரு பட்டியலுக்கான இயல்புநிலை `` other_code_sign_flags``, இது ச்கிரிப்ட் உருவாக்க கட்டங்களுக்காக xcode ஆல் அமைக்கப்படுகிறது, அல்லது அந்த மாறி அமைக்கப்படாவிட்டால் வெற்று பட்டியல்.

source: The path to the :program:`hiutil` program. Defaults to ``'/usr/bin/hiutil'``.
ta: இதன் பாதை: நிரல்: `hiutil` நிரல். இயல்புநிலை `` '/usr/bin/hiutil'```.

source: The path to the :program:`codesign` program. Defaults to ``'/usr/bin/codesign'``.
ta: இதன் பாதை: நிரல்: `கோட் டின்` நிரல். இயல்புநிலை `` '/usr/bin/codesign'```.

source: If ``True``, the builder will not run the indexer or the code signing tool, no matter what other settings are specified.
ta: `` உண்மை` `என்றால், பில்டர் குறியீட்டாளர் அல்லது குறியீடு கையொப்பமிடும் கருவியை இயக்க மாட்டார், வேறு எந்த அமைப்புகள் குறிப்பிடப்பட்டிருந்தாலும்.

source: Now Sphinx provides an API :meth:`Sphinx.add_source_parser` to register a source parser. Please use it instead.
ta: இப்போது ச்பின்க்ச் ஒரு ஏபிஐ: மெத்: `sphinx.add_source_parser` ஒரு மூல பாகுபடுத்தி பதிவு செய்ய வழங்குகிறது. அதற்கு பதிலாக அதைப் பயன்படுத்தவும்.

source: This is mainly useful for testing, or where you want to run the Sphinx build on a non-Mac OS X platform and then complete the final steps on OS X for some reason.
ta: இது முக்கியமாக சோதனைக்கு பயனுள்ளதாக இருக்கும், அல்லது நீங்கள் ஒரு mac os அல்லாத ஃச் இயங்குதளத்தில் ச்பிங்க்ச் கட்டமைப்பை இயக்க விரும்புகிறீர்கள், பின்னர் சில காரணங்களால் os ஃச் இல் இறுதி படிகளை முடிக்க வேண்டும்.

source: Defaults to ``False``.
ta: இயல்புநிலை `` பொய்``.

source: Options for epub output
ta: epub வெளியீட்டிற்கான விருப்பங்கள்

source: These options influence the epub output. As this builder derives from the HTML builder, the HTML options also apply where appropriate. The actual values for some of the options is not really important, they just have to be entered into the `Dublin Core metadata <http://dublincore.org/>`_.
ta: இந்த விருப்பங்கள் epub வெளியீட்டை பாதிக்கின்றன. இந்த பில்டர் html பில்டரிடமிருந்து பெறப்பட்டதால், html விருப்பங்களும் பொருத்தமான இடங்களில் பொருந்தும். சில விருப்பங்களுக்கான உண்மையான மதிப்புகள் உண்மையில் முக்கியமல்ல, அவை `டப்ளின் கோர் மேனிலை தரவு <http://dublincore.org/>` _ இல் உள்ளிடப்பட வேண்டும்.

source: The basename for the epub file. It defaults to the :confval:`project` name.
ta: epub கோப்பிற்கான அடிப்படை பெயர். இது இயல்புநிலை: confval: `project` பெயர்.

source: The HTML theme for the epub output. Since the default themes are not optimized for small screen space, using the same theme for HTML and epub output is usually not wise. This defaults to ``'epub'``, a theme designed to save visual space.
ta: epub வெளியீட்டிற்கான html தீம். இயல்புநிலை கருப்பொருள்கள் சிறிய திரை இடத்திற்கு உகந்ததாக இல்லாததால், html மற்றும் epub வெளியீட்டிற்கான அதே கருப்பொருளைப் பயன்படுத்துவது பொதுவாக புத்திசாலித்தனமாக இருக்காது. இது காட்சி இடத்தை சேமிக்க வடிவமைக்கப்பட்ட கருப்பொருள் `` 'எபுபா'`` க்கு இயல்புநிலையாகிறது.

source: A dictionary of options that influence the look and feel of the selected theme. These are theme-specific. For the options understood by the builtin themes, see :ref:`this section <builtin-themes>`.
ta: தேர்ந்தெடுக்கப்பட்ட கருப்பொருளின் தோற்றத்தையும் உணர்வையும் பாதிக்கும் விருப்பங்களின் அகராதி. இவை தீம்-குறிப்பிட்டவை. பில்டின் கருப்பொருள்களால் புரிந்துகொள்ளப்பட்ட விருப்பங்களுக்கு, காண்க: குறிப்பு: `இந்த பிரிவு <பில்டின்-தீம்ச்>`.

source: The title of the document. It defaults to the :confval:`html_title` option but can be set independently for epub creation.
ta: ஆவணத்தின் தலைப்பு. இது இயல்புநிலையாக: confval: `html_title` விருப்பத்திற்கு ஆனால் எபப் உருவாக்கத்திற்கு சுயாதீனமாக அமைக்கலாம்.

source: The description of the document. The default value is ``'unknown'``.
ta: ஆவணத்தின் விளக்கம். இயல்புநிலை மதிப்பு `` 'அறியப்படாதது'``.

source: Renamed from ``epub3_description``
ta: `` epub3_description`` இலிருந்து மறுபெயரிடப்பட்டது

source: The author of the document. This is put in the Dublin Core metadata. It defaults to the :confval:`author` option.
ta: ஆவணத்தின் ஆசிரியர். இது டப்ளின் கோர் மெட்டாடேட்டாவில் வைக்கப்பட்டுள்ளது. இது இயல்புநிலை: confval: `ஆசிரியர்` விருப்பம்.

source: The name of a person, organization, etc. that played a secondary role in the creation of the content of an EPUB Publication. The default value is ``'unknown'``.
ta: ஒரு எபப் வெளியீட்டின் உள்ளடக்கத்தை உருவாக்குவதில் இரண்டாம் நிலை பங்கைக் கொண்டிருந்த ஒரு நபர், அமைப்பு போன்றவற்றின் பெயர். இயல்புநிலை மதிப்பு `` 'அறியப்படாதது'``.

source: The document name of the "master" document, that is, the document that contains the root :rst:dir:`toctree` directive. Default is ``'contents'``.
ta: "மாச்டர்" ஆவணத்தின் ஆவண பெயர், அதாவது, ரூட் கொண்ட ஆவணம்: rst: dir: `toctree` உத்தரவு. இயல்புநிலை `` 'பொருளடக்கம்'``.

source: Renamed from ``epub3_contributor``
ta: `` epub3_contributor`` இலிருந்து மறுபெயரிடப்பட்டது

source: The language of the document. This is put in the Dublin Core metadata. The default is the :confval:`language` option or ``'en'`` if unset.
ta: ஆவணத்தின் மொழி. இது டப்ளின் கோர் மெட்டாடேட்டாவில் வைக்கப்பட்டுள்ளது. இயல்புநிலை: confval: `மொழி` விருப்பம் அல்லது` `'en'`` அமைக்கப்படாவிட்டால்.

source: The publisher of the document. This is put in the Dublin Core metadata. You may use any sensible string, e.g. the project homepage. The defaults to the :confval:`author` option.
ta: ஆவணத்தின் வெளியீட்டாளர். இது டப்ளின் கோர் மெட்டாடேட்டாவில் வைக்கப்பட்டுள்ளது. நீங்கள் எந்த விவேகமான சரத்தையும் பயன்படுத்தலாம், எ.கா. திட்ட முகப்புப்பக்கம். இயல்புநிலை: confval: `ஆசிரியர்` விருப்பம்.

source: The copyright of the document. It defaults to the :confval:`copyright` option but can be set independently for epub creation.
ta: ஆவணத்தின் பதிப்புரிமை. இது இயல்புநிலை: confval: `பதிப்புரிமை` விருப்பம் ஆனால் எபப் உருவாக்கத்திற்கு சுயாதீனமாக அமைக்கலாம்.

source: An identifier for the document. This is put in the Dublin Core metadata. For published documents this is the ISBN number, but you can also use an alternative scheme, e.g. the project homepage. The default value is ``'unknown'``.
ta: ஆவணத்திற்கான அடையாளங்காட்டி. இது டப்ளின் கோர் மெட்டாடேட்டாவில் வைக்கப்பட்டுள்ளது. வெளியிடப்பட்ட ஆவணங்களுக்கு இது isbn எண், ஆனால் நீங்கள் ஒரு மாற்றுத் திட்டத்தையும் பயன்படுத்தலாம், எ.கா. திட்ட முகப்புப்பக்கம். இயல்புநிலை மதிப்பு `` 'அறியப்படாதது'``.

source: The publication scheme for the :confval:`epub_identifier`. This is put in the Dublin Core metadata. For published books the scheme is ``'ISBN'``. If you use the project homepage, ``'URL'`` seems reasonable. The default value is ``'unknown'``.
ta: வெளியீட்டுத் திட்டம்: confval: `epub_identifier`. இது டப்ளின் கோர் மெட்டாடேட்டாவில் வைக்கப்பட்டுள்ளது. வெளியிடப்பட்ட புத்தகங்களுக்கு இந்த திட்டம் `` 'isbn'``. நீங்கள் திட்ட முகப்புப்பக்கத்தைப் பயன்படுத்தினால், `` 'url'`` நியாயமானதாகத் தெரிகிறது. இயல்புநிலை மதிப்பு `` 'அறியப்படாதது'``.

source: A unique identifier for the document. This is put in the Dublin Core metadata. You may use a `XML's Name format <https://www.w3.org/TR/REC-xml/#NT-NameStartChar>`_ string. You can't use hyphen, period, numbers as a first character. The default value is ``'unknown'``.
ta: ஆவணத்திற்கான தனித்துவமான அடையாளங்காட்டி. இது டப்ளின் கோர் மெட்டாடேட்டாவில் வைக்கப்பட்டுள்ளது. நீங்கள் ஒரு `எக்ச்எம்எல் பெயர் வடிவத்தை <https://www.w3.org/tr/rec-xml/#nt-manestarthar>` _ சரம் பயன்படுத்தலாம். நீங்கள் ஐபன், காலம், எண்களை முதல் எழுத்தாக பயன்படுத்த முடியாது. இயல்புநிலை மதிப்பு `` 'அறியப்படாதது'``.

source: The cover page information. This is a tuple containing the filenames of the cover image and the html template. The rendered html cover page is inserted as the first item in the spine in :file:`content.opf`. If the template filename is empty, no html cover page is created. No cover at all is created if the tuple is empty. Examples::
ta: கவர் பக்க தகவல். இது கவர் படத்தின் கோப்பு பெயர்கள் மற்றும் html வார்ப்புருவைக் கொண்ட ஒரு டூப்பிள் ஆகும். வழங்கப்பட்ட html கவர் பக்கம் முதுகெலும்பில் முதல் உருப்படியாக செருகப்படுகிறது: கோப்பு: `content.opf`. வார்ப்புரு கோப்பு பெயர் காலியாக இருந்தால், html கவர் பக்கம் எதுவும் உருவாக்கப்படவில்லை. டூப்பிள் காலியாக இருந்தால் எந்த அட்டையும் உருவாக்கப்படாது. எடுத்துக்காட்டுகள் ::

source: A list of glob-style patterns that should be excluded when looking for source files. [1]_ They are matched against the source file names relative to the source directory, using slashes as directory separators on all platforms.
ta: மூல கோப்புகளைத் தேடும்போது விலக்கப்பட வேண்டிய குளோப்-பாணி வடிவங்களின் பட்டியல். .

source: The default value is ``()``.
ta: இயல்புநிலை மதிப்பு `` () ``.

source: A list of CSS files. The entry must be a *filename* string or a tuple containing the *filename* string and the *attributes* dictionary. For more information, see :confval:`html_css_files`.
ta: css கோப்புகளின் பட்டியல். நுழைவு ஒரு * கோப்பு பெயர் * சரம் அல்லது * கோப்பு பெயர் * சரம் மற்றும் * பண்புக்கூறுகள் * அகராதி ஆகியவற்றைக் கொண்ட ஒரு டப்பிள் ஆக இருக்க வேண்டும். மேலும் தகவலுக்கு, காண்க: confval: `html_css_files`.

source: Meta data for the guide element of :file:`content.opf`. This is a sequence of tuples containing the *type*, the *uri* and the *title* of the optional guide information. See the OPF documentation at `<http://idpf.org/epub>`_ for details. If possible, default entries for the *cover* and *toc* types are automatically inserted. However, the types can be explicitly overwritten if the default entries are not appropriate. Example::
ta: வழிகாட்டி உறுப்புக்கான மெட்டா தரவு: கோப்பு: `content.opf`. இது விருப்ப வழிகாட்டி தகவல்களின் *வகை *, *uri *மற்றும் *தலைப்பு *ஆகியவற்றைக் கொண்ட டூப்பிள்களின் வரிசை. விவரங்களுக்கு opf ஆவணத்தை `<http://idpf.org/epub> _ _ இல் காண்க. முடிந்தால், * கவர் * மற்றும் * toc * வகைகளுக்கான இயல்புநிலை உள்ளீடுகள் தானாகவே செருகப்படுகின்றன. இருப்பினும், இயல்புநிலை உள்ளீடுகள் பொருத்தமானதாக இல்லாவிட்டால் வகைகளை வெளிப்படையாக மேலெழுதலாம். உதாரணமாக::

source: Additional files that should be inserted before the text generated by Sphinx. It is a list of tuples containing the file name and the title. If the title is empty, no entry is added to :file:`toc.ncx`. Example::
ta: சூரரிமாச்சிலை ஆல் உருவாக்கப்பட்ட உரைக்கு முன் செருகப்பட வேண்டிய கூடுதல் கோப்புகள். இது கோப்பு பெயர் மற்றும் தலைப்பைக் கொண்ட டூப்பிள்களின் பட்டியல். தலைப்பு காலியாக இருந்தால், நுழைவு எதுவும் சேர்க்கப்படவில்லை: கோப்பு: `toc.ncx`. உதாரணமாக::

source: Example patterns:
ta: எடுத்துக்காட்டு வடிவங்கள்:

source: The default value is ``[]``.
ta: இயல்புநிலை மதிப்பு `` [] ``.

source: Additional files that should be inserted after the text generated by Sphinx. It is a list of tuples containing the file name and the title. This option can be used to add an appendix. If the title is empty, no entry is added to :file:`toc.ncx`. The default value is ``[]``.
ta: சூரரிமாச்சிலை ஆல் உருவாக்கப்பட்ட உரைக்குப் பிறகு செருகப்பட வேண்டிய கூடுதல் கோப்புகள். இது கோப்பு பெயர் மற்றும் தலைப்பைக் கொண்ட டூப்பிள்களின் பட்டியல். இந்த விருப்பத்தை சேர்க்க பயன்படுத்தலாம். தலைப்பு காலியாக இருந்தால், நுழைவு எதுவும் சேர்க்கப்படவில்லை: கோப்பு: `toc.ncx`. இயல்புநிலை மதிப்பு `` [] ``.

source: A list of files that are generated/copied in the build directory but should not be included in the epub file. The default value is ``[]``.
ta: உருவாக்க கோப்பகத்தில் உருவாக்கப்பட்ட/நகலெடுக்கப்பட்ட கோப்புகளின் பட்டியல் ஆனால் எபப் கோப்பில் சேர்க்கப்படக்கூடாது. இயல்புநிலை மதிப்பு `` [] ``.

source: The depth of the table of contents in the file :file:`toc.ncx`. It should be an integer greater than zero. The default value is 3. Note: A deeply nested table of contents may be difficult to navigate.
ta: கோப்பில் உள்ள உள்ளடக்க அட்டவணையின் ஆழம்: கோப்பு: `toc.ncx`. இது பூச்சியத்தை விட பெரியதாக இருக்க வேண்டும். இயல்புநிலை மதிப்பு 3. குறிப்பு: ஆழமான உள்ளமைக்கப்பட்ட உள்ளடக்க அட்டவணை செல்லவும் கடினமாக இருக்கலாம்.

source: An optional file `docutils.conf`_ can be added to the configuration directory to adjust `Docutils`_ configuration if not otherwise overriden or set by Sphinx.
ta: `docutils.conf`_ ஐ உள்ளமைவு கோப்பகத்தில் சேர்க்கலாம்` docutils`_ உள்ளமைவை சரிசெய்யவும், இல்லையெனில் ச்பிங்க்சால் அமைக்கப்படாவிட்டால் அல்லது அமைக்கப்படாவிட்டால்.

source: ``'library/xml.rst'`` -- ignores the ``library/xml.rst`` file (replaces entry in :confval:`unused_docs`)
ta: `` 'நூலகம்/xml.rst'`` - `` நூலகம்/xml.rst`` கோப்பை புறக்கணிக்கிறது (நுழைவை மாற்றுகிறது: confval: `பயன்படுத்தப்படாத_டாக்ச்`)

source: This flag determines if a toc entry is inserted again at the beginning of its nested toc listing. This allows easier navigation to the top of a chapter, but can be confusing because it mixes entries of different depth in one list. The default value is ``True``.
ta: ஒரு toc நுழைவு அதன் உள்ளமைக்கப்பட்ட toc பட்டியலின் தொடக்கத்தில் மீண்டும் செருகப்பட்டதா என்பதை இந்த கொடி தீர்மானிக்கிறது. இது ஒரு அத்தியாயத்தின் உச்சியில் எளிதாக வழிசெலுத்தலை அனுமதிக்கிறது, ஆனால் குழப்பமாக இருக்கும், ஏனெனில் இது ஒரு பட்டியலில் வெவ்வேறு ஆழத்தின் உள்ளீடுகளை கலக்கிறது. இயல்புநிலை மதிப்பு `` உண்மை``.

source: This setting control the scope of the epub table of contents. The setting can have the following values:
ta: இந்த அமைப்பு எபப் உள்ளடக்க அட்டவணையின் நோக்கத்தை கட்டுப்படுத்துகிறது. அமைப்பு பின்வரும் மதிப்புகளைக் கொண்டிருக்கலாம்:

source: ``'default'`` -- include all toc entries that are not hidden (default)
ta: `` 'இயல்புநிலை'` - மறைக்கப்படாத அனைத்து toc உள்ளீடுகளையும் சேர்க்கவும் (இயல்புநிலை)

source: ``'includehidden'`` -- include all toc entries
ta: `` 'ஐ சேர்க்கவும்'` - அனைத்து toc உள்ளீடுகளையும் சேர்க்கவும்

source: ``'library/xml'`` -- ignores the ``library/xml`` directory
ta: `` 'நூலகம்/xml'`` - `` நூலகம்/எக்ச்எம்எல்`` கோப்பகத்தை புறக்கணிக்கிறது

source: This flag determines if sphinx should try to fix image formats that are not supported by some epub readers. At the moment palette images with a small color table are upgraded. You need the Python Image Library (Pillow the successor of the PIL) installed to use this option. The default value is ``False`` because the automatic conversion may lose information.
ta: சில எபப் வாசகர்களால் ஆதரிக்கப்படாத பட வடிவங்களை சரிசெய்ய சூரரிமாச்சிலை முயற்சிக்க வேண்டுமா என்று இந்த கொடி தீர்மானிக்கிறது. இந்த நேரத்தில் ஒரு சிறிய வண்ண அட்டவணையுடன் தட்டு படங்கள் மேம்படுத்தப்படுகின்றன. இந்த விருப்பத்தைப் பயன்படுத்த நிறுவப்பட்ட பைதான் பட நூலகம் (pil இன் வாரிசு தலையணை) தேவை. இயல்புநிலை மதிப்பு `` பொய்`` ஏனெனில் தானியங்கி மாற்றம் தகவலை இழக்கக்கூடும்.

source: ``'library/xml*'`` -- ignores all files and directories starting with ``library/xml``
ta: `` 'நூலகம்/எக்ச்எம்எல்*' `` - `` நூலகம்/எக்ச்எம்எல்`` உடன் தொடங்கி அனைத்து கோப்புகளையும் கோப்பகங்களையும் புறக்கணிக்கிறது

source: This option specifies the maximum width of images. If it is set to a value greater than zero, images with a width larger than the given value are scaled accordingly. If it is zero, no scaling is performed. The default value is ``0``. You need the Python Image Library (Pillow) installed to use this option.
ta: இந்த விருப்பம் படங்களின் அதிகபட்ச அகலத்தைக் குறிப்பிடுகிறது. இது பூச்சியத்தை விட அதிகமான மதிப்பாக அமைக்கப்பட்டால், கொடுக்கப்பட்ட மதிப்பை விட பெரிய அகலம் கொண்ட படங்கள் அதற்கேற்ப அளவிடப்படுகின்றன. இது பூச்சியமாக இருந்தால், அளவிடுதல் எதுவும் செய்யப்படவில்லை. இயல்புநிலை மதிப்பு `` 0``. இந்த விருப்பத்தைப் பயன்படுத்த உங்களுக்கு பைதான் பட நூலகம் (தலையணை) நிறுவப்பட்டுள்ளது.

source: Control whether to display URL addresses. This is very useful for readers that have no other means to display the linked URL. The settings can have the following values:
ta: முகவரி முகவரிகளைக் காட்ட வேண்டுமா என்பதைக் கட்டுப்படுத்தவும். இணைக்கப்பட்ட முகவரி ஐக் காண்பிக்க வேறு வழியில்லாமல் வாசகர்களுக்கு இது மிகவும் பயனுள்ளதாக இருக்கும். அமைப்புகள் பின்வரும் மதிப்புகளைக் கொண்டிருக்கலாம்:

source: ``'inline'`` -- display URLs inline in parentheses (default)
ta: `` 'இன்லைன்'`` - அடைப்புக்குறிக்குள் urls இன்லைன் (இயல்புநிலை) காண்பி

source: ``'footnote'`` -- display URLs in footnotes
ta: `` 'அடிக்குறிப்பு'`` - முகவரி களை அடிக்குறிப்புகளில் காண்பி

source: ``'no'`` -- do not display URLs
ta: `` 'இல்லை'` - முகவரி களைக் காட்ட வேண்டாம்

source: The display of inline URLs can be customized by adding CSS rules for the class ``link-target``.
ta: `` இணைப்பு-இலக்கு`` வகுப்பிற்கான css விதிகளைச் சேர்ப்பதன் மூலம் இன்லைன் முகவரி களின் காட்சியைத் தனிப்பயனாக்கலாம்.

source: ``'**/.svn'`` -- ignores all ``.svn`` directories
ta: `` '**/. svn'`` - அனைத்து `` .svn`` கோப்பகங்களையும் புறக்கணிக்கிறது

source: If true, add an index to the epub document. It defaults to the :confval:`html_use_index` option but can be set independently for epub creation.
ta: உண்மை என்றால், epub ஆவணத்தில் ஒரு குறியீட்டைச் சேர்க்கவும். இது இயல்புநிலையாக: confval: `html_use_index` விருப்பத்திற்கு விருப்பம் ஆனால் எபப் உருவாக்கத்திற்கு சுயாதீனமாக அமைக்கலாம்.

source: It specifies writing direction. It can accept ``'horizontal'`` (default) and ``'vertical'``
ta: இது எழுதும் திசையைக் குறிப்பிடுகிறது. இது `` 'கிடைமட்டமாக' (இயல்புநிலை) மற்றும் `` 'செங்குத்து'`` ஆகியவற்றை ஏற்றுக்கொள்ளலாம்

source: ``'horizontal'``
ta: `` 'கிடைமட்டமாக'``

source: ``'vertical'``
ta: `` 'செங்குத்து'``

source: writing-mode [#]_
ta: எழுதும் முறை [#] _

source: ``horizontal-tb``
ta: `` கிடைமட்ட-காசநோய்``

source: ``vertical-rl``
ta: `` செங்குத்து-ஆர்.எல்``

source: page progression
ta: பக்க முன்னேற்றம்

source: left to right
ta: இடமிருந்து வலம்

source: right to left
ta: வலமிருந்து இடமாக

source: iBook's Scroll Theme support
ta: ஐபுக்கின் சுருள் கருப்பொருள் உதவி

source: scroll-axis is vertical.
ta: உருள்-அச்சு செங்குத்து.

source: scroll-axis is horizontal.
ta: உருள்-அச்சு கிடைமட்டமானது.

source: Options for LaTeX output
ta: லேடெக்ச் வெளியீட்டிற்கான விருப்பங்கள்

source: These options influence LaTeX output. See further :doc:`latex`.
ta: இந்த விருப்பங்கள் லேடெக்ச் வெளியீட்டை பாதிக்கின்றன. மேலும் காண்க: டாக்: `லேடெக்ச்`.

source: The LaTeX engine to build the docs. The setting can have the following values:
ta: டாக்சை உருவாக்க லேடெக்ச் இயந்திரம். அமைப்பு பின்வரும் மதிப்புகளைக் கொண்டிருக்கலாம்:

source: ``'pdflatex'`` -- PDFLaTeX (default)
ta: `` 'pdflatex'``` - pdflatex (இயல்புநிலை)

source: ``'lualatex'`` -- LuaLaTeX
ta: `` 'lualatex'``` - லுவலடெக்ச்

source: ``'platex'`` -- pLaTeX (default if :confval:`language` is ``'ja'``)
ta: `` '' 'பிளேட்டக்ச்``` - பிளேட்டக்ச் (இயல்புநிலை என்றால்: confval: `மொழி` என்பது` `' ja'``)

source: PDFLaTeX's support for Unicode characters covers those from the document language (the LaTeX ``babel`` and ``inputenc`` packages map them to glyph slots in the document font, at various encodings allowing each only 256 characters; Sphinx uses by default (except for Cyrillic languages) the ``times`` package), but stray characters from other scripts or special symbols may require adding extra LaTeX packages or macros to the LaTeX preamble.
ta: யூனிகோட் எழுத்துக்களுக்கான pdflatex இன் உதவி ஆவண மொழியிலிருந்து (லேடெக்ச் `` பாபல்`` மற்றும் `` உள்ளீட்டு``` தொகுப்புகள் ஆவண எழுத்துருவில் உள்ள கிளிஃப் ச்லாட்டுகளுக்கு வரைபடத்தை உள்ளடக்கியது, பல்வேறு குறியாக்கங்களில் ஒவ்வொன்றையும் 256 எழுத்துக்களை அனுமதிக்கிறது; சிரிலிக் மொழிகளைத் தவிர) `` டைம்ச்`` தொகுப்பு), ஆனால் பிற ச்கிரிப்ட்கள் அல்லது சிறப்பு சின்னங்களிலிருந்து தவறான எழுத்துக்கள் லேடெக்ச் முன்னுரையில் கூடுதல் லேடெக்ச் தொகுப்புகள் அல்லது மேக்ரோக்களைச் சேர்க்க வேண்டியிருக்கலாம்.

source: If your project uses such extra Unicode characters, switching the engine to XeLaTeX or LuaLaTeX often provides a quick fix. They only work with UTF-8 encoded sources and can (in fact, should) use OpenType fonts, either from the system or the TeX install tree. Recent LaTeX releases will default with these engines to the Latin Modern OpenType font, which has good coverage of Latin and Cyrillic scripts (it is provided by standard LaTeX installation), and Sphinx does not modify this default. Refer to the documentation of the LaTeX ``polyglossia`` package to see how to instruct LaTeX to use some other OpenType font if Unicode coverage proves insufficient (or use directly ``\setmainfont`` et. al. as in :ref:`this example <latex-basic>`.)
ta: உங்கள் திட்டம் அத்தகைய கூடுதல் யூனிகோட் எழுத்துக்களைப் பயன்படுத்தினால், இயந்திரத்தை xelatex அல்லது lualatex க்கு மாற்றுவது பெரும்பாலும் விரைவான தீர்வை வழங்குகிறது. அவை யுடிஎஃப் -8 குறியிடப்பட்ட மூலங்களுடன் மட்டுமே வேலை செய்கின்றன, மேலும் (உண்மையில், வேண்டும்) சிச்டம் அல்லது டெக்ச் நிறுவல் மரத்திலிருந்து ஓபன்டைப் எழுத்துருக்களைப் பயன்படுத்த முடியும். அண்மைக் கால லேடெக்ச் வெளியீடுகள் இந்த இயந்திரங்களுடன் லத்தீன் நவீன ஓபன்டைப் எழுத்துருவுக்கு இயல்புநிலையாக இருக்கும், இது லத்தீன் மற்றும் சிரிலிக் ச்கிரிப்ட்களின் நல்ல கவரேச் (இது நிலையான லேடெக்ச் நிறுவலால் வழங்கப்படுகிறது), மற்றும் ச்பிங்க்ச் இந்த இயல்புநிலையை மாற்றாது. யூனிகோட் கவரேச் போதுமானதாக இல்லை எனில் (அல்லது நேரடியாகப் பயன்படுத்தவும் `` \ setmainfont`` மற்றும் al. இந்த எடுத்துக்காட்டு <லேடெக்ச்-பாசிக்> `.)

source: This value determines how to group the document tree into LaTeX source files. It must be a list of tuples ``(startdocname, targetname, title, author, documentclass, toctree_only)``, where the items are:
ta: இந்த மதிப்பு ஆவண மரத்தை லேடெக்ச் மூல கோப்புகளாக எவ்வாறு தொகுத்தல் என்பதை தீர்மானிக்கிறது. இது டூப்சின் பட்டியலாக இருக்க வேண்டும் `` (ச்டார்ட் டாக் பெயர், இலக்கு பெயர், தலைப்பு, ஆசிரியர், ஆவண வகுப்பு, toctree_only) ``, உருப்படிகள்:

source: *startdocname*: document name that is the "root" of the LaTeX file. All documents referenced by it in TOC trees will be included in the LaTeX file too. (If you want only one LaTeX file, use your :confval:`master_doc` here.)
ta: *startdocname*: லேடெக்ச் கோப்பின் "ரூட்" என்ற ஆவண பெயர். toc மரங்களில் குறிப்பிடப்பட்ட அனைத்து ஆவணங்களும் லேடெக்ச் கோப்பிலும் சேர்க்கப்படும். .

source: *targetname*: file name of the LaTeX file in the output directory.
ta: *இலக்கு பெயர்*: வெளியீட்டு கோப்பகத்தில் லேடெக்ச் கோப்பின் கோப்பு பெயர்.
