Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_config_*.po
Languages: ta

source: *title*: LaTeX document title. Can be empty to use the title of the *startdoc*. This is inserted as LaTeX markup, so special characters like a backslash or ampersand must be represented by the proper LaTeX commands if they are to be inserted literally.
ta: *தலைப்பு*: லேடெக்ச் ஆவண தலைப்பு. *startdoc *இன் தலைப்பைப் பயன்படுத்த காலியாக இருக்கலாம். இது லேடெக்ச் மார்க்அப்பாக செருகப்படுகிறது, எனவே பின்சாய்வுக்கோடானது அல்லது ஆம்பர்சண்ட் போன்ற சிறப்பு எழுத்துக்கள் சரியான லேடெக்ச் கட்டளைகளால் குறிப்பிடப்பட வேண்டும்.

source: *author*: Author for the LaTeX document. The same LaTeX markup caveat as for *title* applies. Use ``\\and`` to separate multiple authors, as in: ``'John \\and Sarah'`` (backslashes must be Python-escaped to reach LaTeX).
ta: *ஆசிரியர்*: லேடெக்ச் ஆவணத்திற்கான ஆசிரியர். * தலைப்பு * க்கான அதே லேடெக்ச் மார்க்அப் எச்சரிக்கை பொருந்தும். பல ஆசிரியர்களைப் பிரிக்க `` \\ மற்றும்`` ஐப் பயன்படுத்தவும்: `` 'சான் \\ மற்றும் சாரா'``` (பின்சாய்வுக்கள் லேடெக்சை அடைய பைதான்-எச்கேப் செய்யப்பட வேண்டும்).

source: A list of paths that contain extra templates (or templates that overwrite builtin/theme-specific templates). Relative paths are taken as relative to the configuration directory.
ta: கூடுதல் வார்ப்புருக்களைக் கொண்ட பாதைகளின் பட்டியல் (அல்லது பில்டின்/தீம்-குறிப்பிட்ட வார்ப்புருக்களை மேலெழுதும் வார்ப்புருக்கள்). உறவினர் பாதைகள் உள்ளமைவு கோப்பகத்துடன் தொடர்புடையவை.

source: *documentclass*: Normally, one of ``'manual'`` or ``'howto'`` (provided by Sphinx and based on ``'report'``, resp. ``'article'``; Japanese documents use ``'jsbook'``, resp. ``'jreport'``.) "howto" (non-Japanese) documents will not get appendices. Also they have a simpler title page. Other document classes can be given. Independently of the document class, the "sphinx" package is always loaded in order to define Sphinx's custom LaTeX commands.
ta: . `` 'jsbook'``, resp. மேலும் அவை எளிமையான தலைப்புப் பக்கத்தைக் கொண்டுள்ளன. பிற ஆவண வகுப்புகள் வழங்கப்படலாம். ஆவண வகுப்பிலிருந்து சுயாதீனமாக, ச்பிங்கின் தனிப்பயன் லேடெக்ச் கட்டளைகளை வரையறுக்க "ச்பிங்க்ச்" தொகுப்பு எப்போதும் ஏற்றப்படுகிறது.

source: *toctree_only*: Must be ``True`` or ``False``. If true, the *startdoc* document itself is not included in the output, only the documents referenced by it via TOC trees. With this option, you can put extra stuff in the master document that shows up in the HTML, but not the LaTeX output.
ta: *toctree_only*: `` உண்மை`` அல்லது `` தவறு`` ஆக இருக்க வேண்டும். உண்மை என்றால், * startdoc * ஆவணம் வெளியீட்டில் சேர்க்கப்படவில்லை, toc மரங்கள் வழியாக குறிப்பிடப்பட்ட ஆவணங்கள் மட்டுமே. இந்த விருப்பத்தின் மூலம், html இல் காண்பிக்கப்படும் முதன்மை ஆவணத்தில் கூடுதல் பொருட்களை வைக்கலாம், ஆனால் லேடெக்ச் வெளியீடு அல்ல.

source: In the past including your own document class required you to prepend the document class name with the string "sphinx". This is not necessary anymore.
ta: கடந்த காலங்களில் உங்கள் சொந்த ஆவண வகுப்பு உட்பட, ஆவண வகுப்பு பெயரை "ச்பிங்க்ச்" என்ற சரத்துடன் தயாரிக்க வேண்டும். இது இனி தேவையில்லை.

source: The 6th item ``toctree_only``. Tuples with 5 items are still accepted.
ta: 6 வது உருப்படி `` toctree_only``. 5 உருப்படிகளைக் கொண்ட டூப்பிள்கள் இன்னும் ஏற்றுக்கொள்ளப்படுகின்றன.

source: If given, this must be the name of an image file (relative to the configuration directory) that is the logo of the docs. It is placed at the top of the title page. Default: ``None``.
ta: வழங்கப்பட்டால், இது ஒரு படக் கோப்பின் பெயராக இருக்க வேண்டும் (உள்ளமைவு கோப்பகத்துடன் தொடர்புடையது) இது டாக்சின் சின்னமாகும். இது தலைப்பு பக்கத்தின் மேலே வைக்கப்படுகிறது. இயல்புநிலை: `` எதுவுமில்லை``.

source: This value determines the topmost sectioning unit. It should be chosen from ``'part'``, ``'chapter'`` or ``'section'``. The default is ``None``; the topmost sectioning unit is switched by documentclass: ``section`` is used if documentclass will be ``howto``, otherwise ``chapter`` will be used.
ta: இந்த மதிப்பு மேல் பிரிவு அலகு தீர்மானிக்கிறது. இதை `` 'பகுதி'``, ``' அத்தியாயம்'``` அல்லது `'பிரிவு'`` ஆகியவற்றிலிருந்து தேர்வு செய்ய வேண்டும். இயல்புநிலை `` எதுவுமில்லை`; ஆவண வகுப்பு மூலம் மேல் பிரித்தல் அலகு மாற்றப்படுகிறது: `` பிரிவு`` ஆவணப்படங்கள் `` எப்படி`` ஆக இருந்தால் பயன்படுத்தப்படுகிறது, இல்லையெனில் `` அத்தியாயம்`` பயன்படுத்தப்படும்.

source: Note that if LaTeX uses ``\part`` command, then the numbering of sectioning units one level deep gets off-sync with HTML numbering, because LaTeX numbers continuously ``\chapter`` (or ``\section`` for ``howto``.)
ta: லேடெக்ச் `` \ பகுதி` கட்டளையைப் பயன்படுத்தினால், பிரித்தல் அலகுகளின் எண்ணிக்கை ஒரு நிலை ஆழம் html எண்ணுடன் ஆஃப்-ஒத்திசைவைப் பெறுகிறது, ஏனெனில் லேடெக்ச் எண்கள் தொடர்ந்து `` \ அத்தியாயம்`` (அல்லது `` \ பிரிவு`` `` `` `\ பிரிவு` `howto``.)

source: As these files are not meant to be built, they are automatically added to :confval:`exclude_patterns`.
ta: இந்த கோப்புகள் கட்டமைக்கப்படக்கூடாது என்பதால், அவை தானாகவே சேர்க்கப்படுகின்றன: confval: `விலக்கு_பேட்டர்கள்`.

source: A list of document names to append as an appendix to all manuals.
ta: அனைத்து கையேடுகளுக்கும் பிற்சேர்க்கையாக சேர்க்க ஆவண பெயர்களின் பட்டியல்.

source: This value can be a bool or a list of index names that should be generated, like for :confval:`html_domain_indices`.
ta: இந்த மதிப்பு ஒரு பூல் அல்லது உருவாக்கப்பட வேண்டிய குறியீட்டு பெயர்களின் பட்டியலாக இருக்கலாம்: confval: `html_domain_indices`.

source: If true, add page references after internal references. This is very useful for printed copies of the manual. Default is ``False``.
ta: உண்மை என்றால், உள் குறிப்புகளுக்குப் பிறகு பக்க குறிப்புகளைச் சேர்க்கவும். கையேட்டின் அச்சிடப்பட்ட நகல்களுக்கு இது மிகவும் பயனுள்ளதாக இருக்கும். இயல்புநிலை `` பொய்``.

source: Control whether to display URL addresses. This is very useful for printed copies of the manual. The setting can have the following values:
ta: முகவரி முகவரிகளைக் காட்ட வேண்டுமா என்பதைக் கட்டுப்படுத்தவும். கையேட்டின் அச்சிடப்பட்ட நகல்களுக்கு இது மிகவும் பயனுள்ளதாக இருக்கும். அமைப்பு பின்வரும் மதிப்புகளைக் கொண்டிருக்கலாம்:

source: ``'no'`` -- do not display URLs (default)
ta: `` 'இல்லை'` - முகவரி களைக் காட்ட வேண்டாம் (இயல்புநிலை)

source: ``'inline'`` -- display URLs inline in parentheses
ta: `` 'inline'`` - அடைப்புக்குறிக்குள் urls இன்லைன் காண்பி

source: This value is now a string; previously it was a boolean value, and a true value selected the ``'inline'`` display. For backwards compatibility, ``True`` is still accepted.
ta: இந்த மதிப்பு இப்போது ஒரு சரம்; முன்னதாக இது ஒரு பூலியன் மதிப்பு, மற்றும் ஒரு உண்மையான மதிப்பு `` 'இன்லைன்'`` காட்சியைத் தேர்ந்தெடுத்தது. பின்னோக்கி பொருந்தக்கூடிய தன்மைக்கு, `` உண்மை`` இன்னும் ஏற்றுக்கொள்ளப்பட்டுள்ளது.

source: The default is ``False``: it means that Sphinx's own macros are used for merged cells from grid tables. They allow general contents (literal blocks, lists, blockquotes, ...) but may have problems if the :rst:dir:`tabularcolumns` directive was used to inject LaTeX mark-up of the type ``>{..}``, ``<{..}``, ``@{..}`` as column specification.
ta: இயல்புநிலை `` தவறு``: இதன் பொருள் கட்டம் அட்டவணைகளிலிருந்து இணைக்கப்பட்ட கலங்களுக்கு ச்பின்க்சின் சொந்த மேக்ரோக்கள் பயன்படுத்தப்படுகின்றன. அவை பொதுவான உள்ளடக்கங்களை அனுமதிக்கின்றன (நேரடி தொகுதிகள், பட்டியல்கள், பிளாக்கோட்டுகள், ...) ஆனால் சிக்கல்கள் இருக்கலாம்: rst: dir: `tabularcolumns` உத்தரவு` `> {..}}` `,` `<{..}` `,` `@{..}` `நெடுவரிசை விவரக்குறிப்பாக.

source: Setting to ``True`` means to use LaTeX's standard ``\multicolumn``; this is incompatible with literal blocks in the horizontally merged cell, and also with multiple paragraphs in such cell if the table is rendered using ``tabulary``.
ta: `` உண்மை`` என்று அமைப்பது என்பது லேடெக்சின் தரத்தை `` \ மல்டிகாலம்`` பயன்படுத்த வேண்டும்; இது கிடைமட்டமாக இணைக்கப்பட்ட கலத்தில் உள்ள நேரடி தொகுதிகளுடன் பொருந்தாது, மேலும் அட்டவணை `` தபுலரி`` ஐப் பயன்படுத்தி வழங்கப்பட்டால், அத்தகைய கலத்தில் பல பத்திகளும்.

source: A dictionary that contains LaTeX snippets that override those Sphinx usually puts into the generated ``.tex`` files.
ta: அந்த ச்பிங்க்சை மேலெழுதும் லேடெக்ச் துணுக்குகளைக் கொண்ட ஒரு அகராதி வழக்கமாக உருவாக்கப்பட்ட `` .tex`` கோப்புகளில் வைக்கிறது.

source: A string with the fully-qualified name of a callable (or simply a class) that returns an instance of :class:`~sphinx.application.TemplateBridge`. This instance is then used to render HTML documents, and possibly the output of other builders (currently the changes builder). (Note that the template bridge must be made theme-aware if HTML themes are to be used.)
ta: அழைக்கக்கூடிய (அல்லது வெறுமனே ஒரு வகுப்பின்) முழு தகுதி வாய்ந்த பெயரைக் கொண்ட ஒரு சரம்: வகுப்பு: `~ sphinx.application.templatebridge`. இந்த நிகழ்வு பின்னர் html ஆவணங்களை வழங்க பயன்படுகிறது, மேலும் பிற பில்டர்களின் வெளியீடு (தற்போது மாற்றங்கள் பில்டர்). (html கருப்பொருள்கள் பயன்படுத்தப்பட வேண்டுமானால் வார்ப்புரு பாலம் தீம்-விழிப்புணர்வு செய்யப்பட வேண்டும் என்பதை நினைவில் கொள்க.)

source: Keep in mind that backslashes must be doubled in Python string literals to avoid interpretation as escape sequences.
ta: தப்பிக்கும் காட்சிகளாக விளக்கத்தைத் தவிர்ப்பதற்காக பைதான் சரம் எழுத்தாளர்களில் பின்சாய்வுக்கோடுகள் இரட்டிப்பாக வேண்டும் என்பதை நினைவில் கொள்ளுங்கள்.

source: Keys that you may want to override include:
ta: நீங்கள் மேலெழுத விரும்பும் விசைகள் பின்வருமாறு:

source: Paper size option of the document class (``'a4paper'`` or ``'letterpaper'``), default ``'letterpaper'``.
ta: ஆவண வகுப்பின் காகித அளவு விருப்பம் (`'' a4paper'`` அல்லது` '' லெட்டர்பேப்பர்'```), இயல்புநிலை `` 'லெட்டர்பேப்பர்'``.

source: ``'papersize'``
ta: `` 'காகிதங்கள்'``

source: Point size option of the document class (``'10pt'``, ``'11pt'`` or ``'12pt'``), default ``'10pt'``.
ta: ஆவண வகுப்பின் புள்ளி அளவு விருப்பம் (`` '10pt'``, ``' 11pt'`` அல்லது `` 12pt'``), இயல்புநிலை `` '10pt'``.

source: ``'pointsize'``
ta: `` 'சுட்டிக்காட்டுங்கள்'``

source: the value of the ``px`` when used in image attributes ``width`` and ``height``. The default value is ``'0.75bp'`` which achieves ``96px=1in`` (in TeX ``1in = 72bp = 72.27pt``.) To obtain for example ``100px=1in`` use ``'0.01in'`` or ``'0.7227pt'`` (the latter leads to TeX computing a more precise value, due to the smaller unit used in the specification); for ``72px=1in``, simply use ``'1bp'``; for ``90px=1in``, use ``'0.8bp'`` or ``'0.803pt'``.
ta: பட பண்புகளில் `` அகலம்`` மற்றும் `` உயரம்`` ஆகியவற்றைப் பயன்படுத்தும்போது `` px`` இன் மதிப்பு. இயல்புநிலை மதிப்பு `` '0.75bp'``` இது `` 96px = 1in`` (டெக்ச் `1in = 72bp = 72.27pt``.) எடுத்துக்காட்டாக` `100px = 1in`` பயன்பாடு` `` '. `` 72px = 1in`` க்கு, வெறுமனே `` '1bp'``; `` 90px = 1in`` க்கு, `` 0.8bp'`` அல்லது `` '0.803pt'`` ஐப் பயன்படுத்தவும்.

source: A comma separated list of ``key=value`` package options for the Sphinx LaTeX style, default empty. See :doc:`latex`.
ta: ச்பிங்க்ச் லேடெக்ச் பாணிக்கான `` key = மதிப்பு` தொகுப்பு விருப்பங்களின் கமாவைப் பிரித்த பட்டியல், இயல்புநிலை காலியாக உள்ளது. காண்க: டாக்: `லேடெக்ச்`.

source: ``'sphinxsetup'``
ta: `` 'ச்பின்க்ச்செட்அப்'```

source: A string which will be positioned early in the preamble, designed to contain ``\\PassOptionsToPackage{options}{foo}`` commands. Default empty.
ta: முன்னுரிமையின் ஆரம்பத்தில் நிலைநிறுத்தப்படும் ஒரு சரம், `` \\ passoptionstopackage {விருப்பங்கள்} {foo} `` கட்டளைகளைக் கொண்டிருக்க வடிவமைக்கப்பட்டுள்ளது. இயல்புநிலை காலியாக உள்ளது.

source: "babel" package inclusion, default ``'\\usepackage{babel}'`` (the suitable document language string is passed as class option, and ``english`` is used if no language.) For Japanese documents, the default is the empty string.
ta: "பாபல்" தொகுப்பு சேர்த்தல், இயல்புநிலை `` '\\ usepackage {babel}' `` `(பொருத்தமான ஆவண மொழி சரம் வர்க்க விருப்பமாக அனுப்பப்படுகிறது, மற்றும் மொழி இல்லாவிட்டால்` `ஆங்கிலம்`` பயன்படுத்தப்படுகிறது.) சப்பானிய ஆவணங்களுக்கு, இயல்பு வெற்று சரம்.

source: For :confval:`latex_engine` set to ``'xelatex'``, the default is ``'\\usepackage{polyglossia}\n\\setmainlanguage{<language>}'``.
ta: for: confval: `latex_engine`` `'xelatex'`` க்கு அமைக்கப்பட்டுள்ளது, இயல்புநிலை` `' \\ usepackage {பாலிக்ளோசியா} \ n \\ setmainlanguage {<nagnange>} '` `.

source: ``'babel'``
ta: `` 'பாபல்'``

source: ``'lualatex'`` uses same default setting as ``'xelatex'``
ta: `` 'lualatex'``` அதே இயல்புநிலை அமைப்பைப் பயன்படுத்துகிறது ``' xelatex'```

source: Font package inclusion, default ``'\\usepackage{times}'`` (which uses Times for text, Helvetica for sans serif and Courier for code-blocks).
ta: எழுத்துரு தொகுப்பு சேர்த்தல், இயல்புநிலை `` '\\ usepackage {முறை}' `` `(இது உரைக்கு நேரங்களைப் பயன்படுத்துகிறது, சான்ச் செரிஃப் மற்றும் கோட்-பிளாக்சிற்கான கூரியர்).

source: Courier is much wider than Times, and Sphinx emits LaTeX command ``\small`` in code-blocks to compensate. Since ``1.5`` this is not hard-coded anymore: ``\fvset{fontsize=auto}`` can be added to preamble to not change font size in code-blocks. Since ``1.8`` a separate ``'fvset'`` key is provided for this.
ta: கூரியர் நேரங்களை விட மிகவும் அகலமானது, மேலும் ஈடுசெய்ய குறியீட்டு-தொகுதிகளில் ச்பின்க்ச் லேடெக்ச் கட்டளையை `` \ சிறியது` வெளியிடுகிறது. `` 1.5`` இது இனி கடினமாக குறியிடப்படவில்லை என்பதால்: `` \ fvset {fontsize = ஆட்டோ} `` குறியீடு-தொகுதிகளில் எழுத்துரு அளவை மாற்றக்கூடாது என்பதற்கு முன்னுரையில் சேர்க்கலாம். `` 1.8`` ஒரு தனி `` 'fvset'`` key இதற்கு வழங்கப்பட்டுள்ளது.

source: Defaults to ``''`` when the :confval:`language` uses the Cyrillic script.
ta: இயல்புநிலை `` '' `` `போது: confval:` மொழி` சிரிலிக் ச்கிரிப்டைப் பயன்படுத்துகிறது.

source: Defaults to ``''`` when :confval:`latex_engine` is ``'xelatex'``.
ta: இயல்புநிலை `` '' `` `எப்போது: confval:` latex_engine` என்பது `` 'xelatex'```.

source: Defaults to ``''`` also with ``'lualatex'``.
ta: இயல்புநிலை `` '' `` மேலும் `` 'lualatex'``` உடன்.

source: ``'xelatex'`` and ``'lualatex'`` do ``\fvset{fontsize=auto}``.
ta: `` 'xelatex'`` மற்றும் ``' lualatex'``` do `` \ fvset {fontsize = auto} ``.

source: Inclusion of the "fncychap" package (which makes fancy chapter titles), default ``'\\usepackage[Bjarne]{fncychap}'`` for English documentation (this option is slightly customized by Sphinx), ``'\\usepackage[Sonny]{fncychap}'`` for internationalized docs (because the "Bjarne" style uses numbers spelled out in English). Other "fncychap" styles you can try are "Lenny", "Glenn", "Conny", "Rejne" and "Bjornstrup". You can also set this to ``''`` to disable fncychap.
ta: "fncychap" தொகுப்பைச் சேர்ப்பது (இது ஆடம்பரமான அத்தியாய தலைப்புகளை உருவாக்குகிறது), இயல்புநிலை `` '\\ usepackage [bjarne] {fncychap} `` `ஆங்கில ஆவணங்களுக்காக (இந்த விருப்பம் சூரரிமாச்சிலை ஆல் சற்று தனிப்பயனாக்கப்பட்டுள்ளது),` `' \\ usepackage . நீங்கள் முயற்சிக்கக்கூடிய பிற "fncychap" பாணிகள் "லென்னி", "க்ளென்", "கோனி", "ரெக்னே" மற்றும் "சார்ன்ச்ட்ரப்". fncychap ஐ முடக்க இதை `` '' `` என்று அமைக்கலாம்.

source: ``'preamble'``
ta: `` 'முன்னுரை'``

source: Additional preamble content, default empty. See :doc:`latex`.
ta: கூடுதல் முன்னுரை உள்ளடக்கம், இயல்புநிலை காலியாக உள்ளது. காண்க: டாக்: `லேடெக்ச்`.

source: Additional document content (right before the indices), default empty.
ta: கூடுதல் ஆவண உள்ளடக்கம் (குறியீடுகளுக்கு முன்பே), இயல்புநிலை காலியாக உள்ளது.

source: Latex figure float alignment, default 'htbp' (here, top, bottom, page). Whenever an image doesn't fit into the current page, it will be 'floated' into the next page but may be preceded by any other text. If you don't like this behavior, use 'H' which will disable floating and position figures strictly in the order they appear in the source.
ta: லேடெக்ச் படம் மிதவை சீரமைப்பு, இயல்புநிலை 'htbp' (இங்கே, மேல், கீழே, பக்கம்). ஒரு படம் தற்போதைய பக்கத்தில் பொருந்தாத போதெல்லாம், அது அடுத்த பக்கத்திற்கு 'மிதக்கும்' ஆனால் வேறு எந்த உரைக்கும் முன்னதாக இருக்கலாம். இந்த நடத்தை உங்களுக்கு பிடிக்கவில்லை என்றால், 'h' ஐப் பயன்படுத்தவும், இது மிதக்கும் மற்றும் நிலை புள்ளிவிவரங்களை அவை மூலத்தில் தோன்றும் வரிசையில் கண்டிப்பாக முடக்கும்.

source: Additional footer content (before the indices), default empty.
ta: கூடுதல் அடிக்குறிப்பு உள்ளடக்கம் (குறியீடுகளுக்கு முன்), இயல்புநிலை காலியாக உள்ளது.

source: Use ``'atendofbody'`` key instead.
ta: அதற்கு பதிலாக `` 'atendofbody'` விசையைப் பயன்படுத்தவும்.

source: ``'footer'``
ta: `` 'அடிக்குறிப்பு'``

source: Keys that don't need to be overridden unless in special cases are:
ta: சிறப்பு சந்தர்ப்பங்களில் இல்லாவிட்டால் மீறப்பட வேண்டிய தேவையில்லாத விசைகள்:

source: The default is the empty string. Example: ``'extraclassoptions': 'openany'`` will allow chapters (for documents of the ``'manual'`` type) to start on any page.
ta: இயல்புநிலை வெற்று சரம். எடுத்துக்காட்டு: `` 'எக்ச்ட்ராக்ளாசோப்சன்ச்': 'ஓபன்அனி'`` அத்தியாயங்களை (``' கையேடு'` வகை ஆவணங்களுக்கு) எந்தப் பக்கத்திலும் தொடங்க அனுமதிக்கும்.

source: Added this documentation.
ta: இந்த ஆவணத்தைச் சேர்த்தது.

source: ``'extraclassoptions'``
ta: `` 'எக்ச்ட்ராக்ளாசோப்சன்ச்'```

source: A string of reStructuredText that will be included at the end of every source file that is read. This is a possible place to add substitutions that should be available in every file (another being :confval:`rst_prolog`). An example::
ta: படிக்கப்படும் ஒவ்வொரு மூல கோப்பின் முடிவிலும் சேர்க்கப்படும் மறுசீரமைப்பு டெக்ச்டின் சரம். ஒவ்வொரு கோப்பிலும் கிடைக்க வேண்டிய மாற்றீடுகளைச் சேர்க்க இது சாத்தியமான இடம் (மற்றொரு இருப்பு: confval: `rst_prolog`). ஒரு எடுத்துக்காட்டு ::

source: LaTeX allows by default at most 6 levels for nesting list and quote-like environments, with at most 4 enumerated lists, and 4 bullet lists. Setting this key for example to ``'10'`` (as a string) will allow up to 10 nested levels (of all sorts). Leaving it to the empty string means to obey the LaTeX default.
ta: நெச்டிங் பட்டியல் மற்றும் மேற்கோள் போன்ற சூழல்களுக்கு லேடெக்ச் இயல்புநிலையாக 6 நிலைகளை அனுமதிக்கிறது, அதிகபட்சம் 4 கணக்கிடப்பட்ட பட்டியல்கள் மற்றும் 4 புல்லட் பட்டியல்களுடன். எடுத்துக்காட்டாக இந்த விசையை `` '10'`` (ஒரு சரமாக) அமைப்பது 10 உள்ளமைக்கப்பட்ட நிலைகள் (எல்லா வகையான) வரை அனுமதிக்கும். அதை வெற்று சரத்திற்கு விட்டுச் செல்வது என்பது லேடெக்ச் இயல்புநிலைக்குக் கீழ்ப்படிவது.

source: Using this key may prove incompatible with some LaTeX packages or special document classes which do their own list customization.
ta: இந்த விசையைப் பயன்படுத்துவது சில லேடெக்ச் தொகுப்புகள் அல்லது சிறப்பு ஆவண வகுப்புகளுடன் பொருந்தாது என்பதை நிரூபிக்கக்கூடும், அவை அவற்றின் சொந்த பட்டியல் தனிப்பயனாக்கலைச் செய்கின்றன.

source: The key setting is silently *ignored* if ``\usepackage{enumitem}`` is executed inside the document preamble. Use then rather the dedicated commands of this LaTeX package.
ta: `` \ usepackage {enumitem} `` ஆவண முன்னுரைக்குள் செயல்படுத்தப்பட்டால், முக்கிய அமைப்பு அமைதியாக * புறக்கணிக்கப்படுகிறது *. இந்த லேடெக்ச் தொகுப்பின் அர்ப்பணிப்பு கட்டளைகளைப் பயன்படுத்தவும்.

source: "inputenc" package inclusion, defaults to ``'\\usepackage[utf8]{inputenc}'`` when using pdflatex. Otherwise empty.
ta: "உள்ளீடு" தொகுப்பு சேர்க்கை, `` '\\ usepackage [utf8] {உள்ளீட்டு} `` pdflatex ஐப் பயன்படுத்தும் போது இயல்புநிலை. இல்லையெனில் காலியாக.

source: Previously ``'\\usepackage[utf8]{inputenc}'`` was used for all compilers.
ta: முன்னர் `` '\\ usepackage [utf8] {inputenc}' `` அனைத்து கம்பைலர்களுக்கும் பயன்படுத்தப்பட்டது.

source: "cmap" package inclusion, default ``'\\usepackage{cmap}'``.
ta: "cmap" தொகுப்பு சேர்த்தல், இயல்புநிலை `` '\\ usepackage {cmap}' ``.

source: "fontenc" package inclusion, default ``'\\usepackage[T1]{fontenc}'``.
ta: "fontenc" தொகுப்பு சேர்க்கை, இயல்புநிலை `` '\\ usepackage [t1] {fontenc}' ``.

source: Defaults to ``'\\usepackage{fontspec}'`` when :confval:`latex_engine` is ``'xelatex'``.
ta: இயல்புநிலை `` '\\ usepackage {fontspec}' `` எப்போது: confval: `latex_engine` என்பது` `xelatex'``.

source: ``'lualatex'`` also uses ``fontspec`` per default.
ta: `` 'lualatex'``` இயல்புநிலைக்கு `` fontspec`` ஐப் பயன்படுத்துகிறது.

source: "geometry" package inclusion, the default definition is:
ta: "வடிவியல்" தொகுப்பு சேர்க்கை, இயல்புநிலை வரையறை:

source: ``'\\usepackage{geometry}'``
ta: `` '\\ usepackage {வடிவியல்}' ``

source: with an additional ``[dvipdfm]`` for Japanese documents. The Sphinx LaTeX style file executes:
ta: சப்பானிய ஆவணங்களுக்கு கூடுதல் `` [dvipdfm] `` உடன். ச்பிங்க்ச் லேடெக்ச் பாணி கோப்பு செயல்படுத்துகிறது:

source: which can be customized via corresponding :ref:`'sphinxsetup' options <latexsphinxsetup>`.
ta: இது தொடர்புடைய வழியாகத் தனிப்பயனாக்கப்படலாம்: ref: `'ச்பின்க்ச்செட்அப்' விருப்பங்கள் <லேடெக்ச்ச்பின்க்ச்செட்அப்>`.

source: ``dvipdfm`` option if :confval:`latex_engine` is ``'platex'``.
ta: `` dvipdfm`` விருப்பம் if: confval: `latex_engine` என்பது` `'' பிளேட்டக்ச்```.

source: The :ref:`'sphinxsetup' keys for the margins <latexsphinxsetuphmargin>`.
ta: தி: ரெஃப்: `'ச்பின்க்ச்செட்அப்' விளிம்புகளுக்கான விசைகள் <லேடெக்ச்ச்பின்க்ச்செட்யூஃப்மார்சின்>`.

source: The location in the LaTeX file has been moved to after ``\usepackage{sphinx}`` and ``\sphinxsetup{..}``, hence also after insertion of ``'fontpkg'`` key. This is in order to handle the paper layout options in a special way for Japanese documents: the text width will be set to an integer multiple of the *zenkaku* width, and the text height to an integer multiple of the baseline. See the :ref:`hmargin <latexsphinxsetuphmargin>` documentation for more.
ta: லேடெக்ச் கோப்பில் உள்ள இருப்பிடம் `` \ usepackage {sphinx} `` மற்றும் `\ sphinxsetup {..}` `ஆகியவற்றுக்குப் பிறகு நகர்த்தப்பட்டுள்ளது. சப்பானிய ஆவணங்களுக்கான சிறப்பு வழியில் காகித தளவமைப்பு விருப்பங்களை கையாள இது உள்ளது: உரை அகலம் * சென்காகு * அகலத்தின் முழு எண்ணாக அமைக்கப்படும், மேலும் உரை உயரம் அடிப்படையின் முழு எண். பார்க்க: ref: `hmargin <latexsphinxsetuphmargin>` மேலும் ஆவணங்கள்.

source: ``'geometry'``
ta: `` 'வடிவியல்'``

source: "hyperref" package inclusion; also loads package "hypcap" and issues ``\urlstyle{same}``. This is done after :file:`sphinx.sty` file is loaded and before executing the contents of ``'preamble'`` key.
ta: "ஐப்பர்ரெஃப்" தொகுப்பு சேர்த்தல்; தொகுப்பு "ஐப்கேப்" மற்றும் சிக்கல்கள் `` \ urlstyle {அதே} ``. இது பின்னர் செய்யப்படுகிறது: கோப்பு: `sphinx.sty` கோப்பு ஏற்றப்பட்டு` `'முன்னுரை' விசையின் உள்ளடக்கங்களை செயல்படுத்துவதற்கு முன்.

source: Loading of packages "hyperref" and "hypcap" is mandatory.
ta: தொகுப்புகளை "ஐப்பர்ரெஃப்" மற்றும் "ஐப்கேப்" ஏற்றுவது கட்டாயமாகும்.

source: Previously this was done from inside :file:`sphinx.sty`.
ta: முன்னதாக இது உள்ளே இருந்து செய்யப்பட்டது: கோப்பு: `sphinx.sty`.

source: ``'hyperref'``
ta: `` 'ஐப்பர்ரெஃப்'```

source: "maketitle" call, default ``'\\maketitle'`` (but it has been redefined by the Sphinx ``manual`` and ``howto`` classes.) Override if you want to generate a differently-styled title page.
ta: "மக்ககெட்டிடில்" அழைப்பு, இயல்புநிலை `` '\\ மக்ககெட்டிடில்'```` (ஆனால் இது ச்பின்க்ச் `` கையேடு`` மற்றும் `` ஓவ்டோ`` வகுப்புகள் ஆகியவற்றால் மறுவரையறை செய்யப்பட்டுள்ளது. .

source: ``'maketitle'``
ta: `` 'மக்கெட்டிடில்'```

source: value that prefixes ``'release'`` element on title page, default ``'Release'``. As for *title* and *author* used in the tuples of :confval:`latex_documents`, it is inserted as LaTeX markup.
ta: தலைப்புப் பக்கத்தில் `` '' வெளியீடு'` உறுப்பு, இயல்புநிலை `` 'வெளியீடு'`` ஆகியவற்றை முன்னொட்டு மதிப்பு. * தலைப்பு * மற்றும் * ஆசிரியர் * ஐப் பொறுத்தவரை: confval: `latex_documents`, இது லேடெக்ச் மார்க்அப் என செருகப்படுகிறது.

source: "tableofcontents" call, default ``'\\sphinxtableofcontents'`` (it is a wrapper of unmodified ``\tableofcontents``, which may itself be customized by user loaded packages.) Override if you want to generate a different table of contents or put content between the title page and the TOC.
ta: "டேபிள்ஓஃப்கான்டெண்ட்ச்" அழைப்பு, இயல்புநிலை `` '\\ sphinxtableofcontents'``` (இது மாற்றப்படாத `\ டேபிள்ஓஃப்கான்ட்கள்``, இது பயனர் ஏற்றப்பட்ட தொகுப்புகளால் தனிப்பயனாக்கப்படலாம்.) நீங்கள் வேறுபட்ட அட்டவணையை உருவாக்க விரும்பினால், மீறல் தலைப்புப் பக்கத்திற்கும் toc க்கும் இடையில் உள்ளடக்கங்கள் அல்லது உள்ளடக்கத்தை வைக்கவும்.
