Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_extdev--parserapi_*.po
Languages: ta

source: A base class of source parsers. The additional parsers should inherit this class instead of ``docutils.parsers.Parser``. Compared with ``docutils.parsers.Parser``, this class improves accessibility to Sphinx APIs.
ta: மூல பாகுபடுத்திகளின் அடிப்படை வகுப்பு. கூடுதல் பாகுபடுத்துபவர்கள் `` docutils.parsers.parser`` என்பதற்கு பதிலாக இந்த வகுப்பைப் பெற வேண்டும். `` docutils.parsers.parser`` உடன் ஒப்பிடும்போது, இந்த வகுப்பு சூரரிமாச்சிலை api களுக்கான அணுகலை மேம்படுத்துகிறது.

source: The subclasses can access sphinx core runtime objects (app, config and env).
ta: துணைப்பிரிவுகள் சூரரிமாச்சிலை கோர் இயக்க நேர பொருள்களை (app, config மற்றும் env) அணுகலாம்.

source: Parameters
ta: அளவுருக்கள்

source: set_application will be called from Sphinx to set app and other instance variables
ta: பயன்பாடு மற்றும் பிற நிகழ்வு மாறிகள் அமைக்க சூரரிமாச்சிலை இலிருந்து set_application அழைக்கப்படும்

source: Sphinx application object
ta: சூரரிமாச்சிலை பயன்பாட்டு பொருள்

source: In Sphinx, the parser modules works as same as docutils. The parsers are registered to Sphinx by extensions using Application APIs; :meth:`.Sphinx.add_source_suffix()` and :meth:`.Sphinx.add_source_parser()`.
ta: ச்பிங்க்சில், பாகுபடுத்தி தொகுதிகள் ஆவணங்களைப் போலவே செயல்படுகின்றன. பயன்பாட்டு api களைப் பயன்படுத்தி நீட்டிப்புகள் மூலம் பாகுபடுத்திகள் சூரரிமாச்சிலை இல் பதிவு செய்யப்படுகின்றன; .

source: The *source suffix* is a mapping from file suffix to file type. For example, ``.rst`` file is mapped to ``'restructuredtext'`` type. Sphinx uses the file type to looking for parsers from registered list. On searching, Sphinx refers to the ``Parser.supported`` attribute and picks up a parser which contains the file type in the attribute.
ta: * மூல பின்னொட்டு * என்பது கோப்பு பின்னொட்டிலிருந்து கோப்பு வகைக்கு ஒரு மேப்பிங் ஆகும். எடுத்துக்காட்டாக, `` .ஆர்எச்டி`` கோப்பு `` 'மறுசீரமைக்கப்பட்ட டெக்ச்ட்'`` வகைக்கு மாற்றப்பட்டுள்ளது. பதிவுசெய்யப்பட்ட பட்டியலிலிருந்து பாகுபடுத்திகளைத் தேடுவதற்கு சூரரிமாச்சிலை கோப்பு வகையைப் பயன்படுத்துகிறது. தேடும்போது, ச்பின்க்ச் `` பாகுபடுத்தி.அப்போர்ட்`` பண்புக்கூறைக் குறிக்கிறது மற்றும் பண்புக்கூறில் கோப்பு வகையைக் கொண்ட ஒரு பாகுபடுத்தி எடுக்கிறது.

source: The users can override the source suffix mappings using :confval:`source_suffix` like following::
ta: பயனர்கள் பயன்படுத்தும் மூல பின்னொட்டு வரைபடங்களை மேலெழுதலாம்: confval: `source_suffix` பின்வருமாறு ::

source: You should indicate file types your parser supports. This will allow users to configure their settings appropriately.
ta: உங்கள் பாகுபடுத்தி ஆதரிக்கும் கோப்பு வகைகளை நீங்கள் குறிக்க வேண்டும். இது பயனர்கள் தங்கள் அமைப்புகளை சரியான முறையில் உள்ளமைக்க அனுமதிக்கும்.

source: Parser API
ta: பாகுபடுத்தி ஏபிஐ

source: `The docutils documentation describes`__ parsers as follows:
ta: `டாக்யூடில்ச் ஆவணங்கள் `__ பாகுபடுத்திகளை பின்வருமாறு விவரிக்கின்றன:

source: The Parser analyzes the input document and creates a node tree representation.
ta: பாகுபடுத்தி உள்ளீட்டு ஆவணத்தை பகுப்பாய்வு செய்து ஒரு முனை மர பிரதிநிதித்துவத்தை உருவாக்குகிறது.

source: The config object
ta: கட்டமைப்பு பொருள்

source: The environment object
ta: சுற்றுச்சூழல் பொருள்
