Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_ext--extlinks_*.po
Languages: ta

source: This extension is meant to help with the common pattern of having many external links that point to URLs on one and the same site, e.g. links to bug trackers, version control web interfaces, or simply subpages in other websites. It does so by providing aliases to base URLs, so that you only need to give the subpage name when creating a link.
ta: இந்த நீட்டிப்பு என்பது ஒரே தளத்தில் முகவரி களை சுட்டிக்காட்டும் பல வெளிப்புற இணைப்புகளைக் கொண்ட பொதுவான வடிவத்திற்கு உதவுவதாகும், எ.கா. பிழை கண்காணிப்பாளர்களுக்கான இணைப்புகள், பதிப்பு வலை இடைமுகங்களைக் கட்டுப்படுத்துதல் அல்லது பிற வலைத்தளங்களில் வெறுமனே துணைப்பிரிவுகள். அடிப்படை முகவரி களுக்கு மாற்றுப்பெயர்களை வழங்குவதன் மூலம் அது அவ்வாறு செய்கிறது, இதன்மூலம் ஒரு இணைப்பை உருவாக்கும் போது மட்டுமே நீங்கள் துணைப் பெயரை வழங்க வேண்டும்.

source: Let's assume that you want to include many links to issues at the Sphinx tracker, at :samp:`https://github.com/sphinx-doc/sphinx/issues/{num}`. Typing this URL again and again is tedious, so you can use :mod:`~sphinx.ext.extlinks` to avoid repeating yourself.
ta: ச்பின்க்ச் டிராக்கரில் சிக்கல்களுக்கான பல இணைப்புகளை நீங்கள் சேர்க்க விரும்புகிறீர்கள் என்று வைத்துக் கொள்வோம், இங்கே: samp: `https: //github.com/sphinx-doc/sphinx/issues/ {num}`. இந்த முகவரி ஐ மீண்டும் மீண்டும் தட்டச்சு செய்வது கடினமானது, எனவே நீங்கள் பயன்படுத்தலாம்: மோட்: `~ sphinx.ext.extlinks` உங்களை மீண்டும் மீண்டும் செய்வதைத் தவிர்க்க.

source: :mod:`sphinx.ext.extlinks` -- Markup to shorten external links
ta: : மோட்: `sphinx.ext.extlinks` - வெளிப்புற இணைப்புகளை குறைக்க மார்க்அப்

source: The extension adds one new config value:
ta: நீட்டிப்பு ஒரு புதிய கட்டமைப்பு மதிப்பைச் சேர்க்கிறது:

source: This config value must be a dictionary of external sites, mapping unique short alias names to a base URL and a *prefix*. For example, to create an alias for the above mentioned issues, you would add ::
ta: இந்த கட்டமைப்பு மதிப்பு வெளிப்புற தளங்களின் அகராதியாக இருக்க வேண்டும், தனித்துவமான குறுகிய மாற்றுப்பெயர் பெயர்களை ஒரு அடிப்படை முகவரி க்கு மேப்பிங் செய்வது மற்றும் *முன்னொட்டு *. எடுத்துக்காட்டாக, மேலே குறிப்பிட்டுள்ள சிக்கல்களுக்கு ஒரு மாற்றுப்பெயரை உருவாக்க, நீங்கள் சேர்ப்பீர்கள் ::

source: Now, you can use the alias name as a new role, e.g. ``:issue:`123```. This then inserts a link to https://github.com/sphinx-doc/sphinx/issues/123. As you can see, the target given in the role is substituted in the base URL in the place of ``%s``.
ta: இப்போது, நீங்கள் மாற்றுப்பெயரை ஒரு புதிய பாத்திரமாகப் பயன்படுத்தலாம், எ.கா. ``: வெளியீடு: `123```. இது https://github.com/sphinx-doc/sphinx/issues/123 க்கு ஒரு இணைப்பைச் செருகும். நீங்கள் பார்க்க முடியும் என, பாத்திரத்தில் கொடுக்கப்பட்ட இலக்கு ``%s`` இடத்தில் அடிப்படை முகவரி இல் மாற்றப்படுகிறது.

source: The link *caption* depends on the second item in the tuple, the *prefix*:
ta: இணைப்பு *தலைப்பு *டூப்பிள், *முன்னொட்டு *இல் உள்ள இரண்டாவது உருப்படியைப் பொறுத்தது:

source: If the prefix is ``None``, the link caption is the full URL.
ta: முன்னொட்டு `` எதுவுமில்லை`` என்றால், இணைப்பு தலைப்பு முழு முகவரி ஆகும்.

source: If the prefix is the empty string, the link caption is the partial URL given in the role content (``123`` in this case.)
ta: முன்னொட்டு வெற்று சரம் என்றால், இணைப்பு தலைப்பு என்பது பங்கு உள்ளடக்கத்தில் கொடுக்கப்பட்ட பகுதி முகவரி ஆகும் (இந்த விசயத்தில் `` 123``.)

source: If the prefix is a non-empty string, the link caption is the partial URL, prepended by the prefix -- in the above example, the link caption would be ``issue 123``.
ta: முன்னொட்டு ஒரு காலியாக இல்லாத சரம் என்றால், இணைப்பு தலைப்பு முன்னொட்டால் தயாரிக்கப்பட்ட பகுதி முகவரி ஆகும்-மேலே உள்ள எடுத்துக்காட்டில், இணைப்பு தலைப்பு `` வெளியீடு 123`` ஆக இருக்கும்.

source: You can also use the usual "explicit title" syntax supported by other roles that generate links, i.e. ``:issue:`this issue <123>```. In this case, the *prefix* is not relevant.
ta: இணைப்புகளை உருவாக்கும் பிற பாத்திரங்களால் ஆதரிக்கப்படும் வழக்கமான "வெளிப்படையான தலைப்பு" தொடரியல், அதாவது ``: வெளியீடு: `இந்த சிக்கல் <123>` `` ஆகியவற்றைப் பயன்படுத்தலாம். இந்த வழக்கில், * முன்னொட்டு * பொருந்தாது.

source: Since links are generated from the role in the reading stage, they appear as ordinary links to e.g. the ``linkcheck`` builder.
ta: வாசிப்பு கட்டத்தில் பங்கிலிருந்து இணைப்புகள் உருவாக்கப்படுவதால், அவை எ.கா. `` லிங்க் செக்`` பில்டர்.
