Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_config_*.po
Languages: ta

source: Added ``misc.highlighting_failure``
ta: சேர்க்கப்பட்டது `` misc.highlighting_failure``

source: Added ``epub.unknown_project_files``
ta: `` epub.unknown_project_files`` சேர்க்கப்பட்டது

source: Added ``ref.footnote``
ta: சேர்க்கப்பட்டது `` ref.footnote``

source: If set to a ``major.minor`` version string like ``'1.1'``, Sphinx will compare it with its version and refuse to build if it is too old. Default is no requirement.
ta: `` '1.1'`` போன்ற `` மேசர்.மினோர்`` பதிப்பு சரத்திற்கு அமைக்கப்பட்டால், ச்பின்க்ச் அதை அதன் பதிப்போடு ஒப்பிட்டு, அது மிகவும் பழையதாக இருந்தால் கட்ட மறுக்கும். இயல்புநிலை தேவையில்லை.

source: If not otherwise documented, values must be strings, and their default is the empty string.
ta: வேறுவிதமாக ஆவணப்படுத்தப்படாவிட்டால், மதிப்புகள் சரங்களாக இருக்க வேண்டும், அவற்றின் இயல்புநிலை வெற்று சரம்.

source: also accepts micro version string
ta: மைக்ரோ பதிப்பு சரத்தையும் ஏற்றுக்கொள்கிறது

source: This value can be a dictionary specifying version requirements for extensions in :confval:`extensions`, e.g. ``needs_extensions = {'sphinxcontrib.something': '1.5'}``. The version strings should be in the form ``major.minor``. Requirements do not have to be specified for all extensions, only for those you want to check.
ta: இந்த மதிப்பு நீட்டிப்புகளுக்கான பதிப்பு தேவைகளை குறிப்பிடும் அகராதியாக இருக்கலாம்: confval: `நீட்டிப்புகள்`, எ.கா. `` தேவைகள்_எக்ச்டென்சன்ச் = {'sphinxcontrib.something': '1.5'} ``. பதிப்பு சரங்கள் `` மேசர்.மினோர்`` வடிவத்தில் இருக்க வேண்டும். அனைத்து நீட்டிப்புகளுக்கும் தேவைகள் குறிப்பிடப்பட வேண்டியதில்லை, நீங்கள் சரிபார்க்க விரும்புவோருக்கு மட்டுமே.

source: This requires that the extension specifies its version to Sphinx (see :ref:`dev-extensions` for how to do that).
ta: நீட்டிப்பு அதன் பதிப்பை ச்பிங்க்சுக்குக் குறிப்பிட வேண்டும் (பார்க்க: குறிப்பு: `தேவ்-நீட்டிப்புகள்` அதை எப்படி செய்வது என்பதற்காக).

source: A URL to cross-reference :rst:role:`manpage` directives. If this is defined to ``https://manpages.debian.org/{path}``, the :literal:`:manpage:`man(1)`` role will like to <https://manpages.debian.org/man(1)>. The patterns available are:
ta: குறுக்கு-குறிப்புக்கு ஒரு url: rst: பங்கு: `manpage` வழிமுறைகள். இது `` https://manpages.debian.org/ {பாதை} ``, தி: லிட்டரல்: `: மேன் (1)` `பாத்திரம் <https: //manpages.debian க்கு வரையறுக்கப்பட்டால் .org/man (1)>. கிடைக்கக்கூடிய வடிவங்கள்:

source: ``page`` - the manual page (``man``)
ta: `` பக்கம்`` - கையேடு பக்கம் (`` மனிதன்``)

source: ``section`` - the manual section (``1``)
ta: `` பிரிவு`` - கையேடு பிரிவு (`` 1``)

source: ``path`` - the original manual page and section specified (``man(1)``)
ta: `` பாதை`` - அசல் கையேடு பக்கம் மற்றும் பிரிவு குறிப்பிடப்பட்ட (`` மனிதன் (1) ``)

source: This also supports manpages specified as ``man.1``.
ta: இது `` man.1`` என குறிப்பிடப்பட்ட மனிதப் பக்கங்களையும் ஆதரிக்கிறது.

source: This currently affects only HTML writers but could be expanded in the future.
ta: இது தற்போது html எழுத்தாளர்களை மட்டுமே பாதிக்கிறது, ஆனால் எதிர்காலத்தில் விரிவாக்கப்படலாம்.

source: The term "fully-qualified name" refers to a string that names an importable Python object inside a module; for example, the FQN ``"sphinx.builders.Builder"`` means the ``Builder`` class in the ``sphinx.builders`` module.
ta: "முழுமையாக தகுதி வாய்ந்த பெயர்" என்ற சொல் ஒரு தொகுதிக்குள் இறக்குமதி செய்யக்கூடிய பைதான் பொருளைக் குறிக்கும் ஒரு சரத்தை குறிக்கிறது; எடுத்துக்காட்டாக, fqn `` "sphinx.builders.builder" `` என்பது `` sphinx.builders`` தொகுதியில் `` பில்டர்`` வகுப்பைக் குறிக்கிறது.

source: If true, Sphinx will warn about *all* references where the target cannot be found. Default is ``False``. You can activate this mode temporarily using the :option:`-n <sphinx-build -n>` command-line switch.
ta: உண்மை என்றால், இலக்கு கண்டுபிடிக்க முடியாத * அனைத்து * குறிப்புகளையும் ச்பின்க்ச் எச்சரிக்கும். இயல்புநிலை `` பொய்``. இந்த பயன்முறையை நீங்கள் தற்காலிகமாக செயல்படுத்தலாம்: விருப்பம்: `-n <sphinx- கட்டளை -n>` கட்டளை-வரி சுவிட்ச்.

source: A list of ``(type, target)`` tuples (by default empty) that should be ignored when generating warnings in "nitpicky mode". Note that ``type`` should include the domain name if present. Example entries would be ``('py:func', 'int')`` or ``('envvar', 'LD_LIBRARY_PATH')``.
ta: "நைட் பிக்கி பயன்முறையில்" எச்சரிக்கைகளை உருவாக்கும் போது புறக்கணிக்கப்பட வேண்டிய `` (வகை, இலக்கு) `` டூப்பிள்ச் (இயல்பாக காலியாக) பட்டியல். `` வகை`` இருந்தால் டொமைன் பெயரை சேர்க்க வேண்டும் என்பதை நினைவில் கொள்க. எடுத்துக்காட்டு உள்ளீடுகள் `` ('py: func', 'int') `` அல்லது `` ('envvar', 'ld_library_path') ``.

source: If true, figures, tables and code-blocks are automatically numbered if they have a caption. The :rst:role:`numref` role is enabled. Obeyed so far only by HTML and LaTeX builders. Default is ``False``.
ta: உண்மை என்றால், புள்ளிவிவரங்கள், அட்டவணைகள் மற்றும் குறியீடு-தொகுதிகள் ஒரு தலைப்பு இருந்தால் தானாகவே எண்ணப்படும். தி: ஆர்எச்டி: பங்கு: `எண்ரெஃப்` பங்கு இயக்கப்பட்டது. இதுவரை html மற்றும் லேடெக்ச் பில்டர்களால் மட்டுமே கீழ்ப்படியது. இயல்புநிலை `` பொய்``.

source: The LaTeX builder always assigns numbers whether this option is enabled or not.
ta: இந்த விருப்பம் இயக்கப்பட்டதா இல்லையா என்பதை லேடெக்ச் பில்டர் எப்போதும் எண்களை ஒதுக்குகிறது.

source: A dictionary mapping ``'figure'``, ``'table'``, ``'code-block'`` and ``'section'`` to strings that are used for format of figure numbers. As a special character, `%s` will be replaced to figure number.
ta: ஒரு அகராதி மேப்பிங் `` 'படம்'``, ``' அட்டவணை'``, `` 'குறியீடு-பிளாக்'````` ``' பிரிவு படம் எண்களின் வடிவமைப்பிற்கு பயன்படுத்தப்படும் சரங்களுக்கு. ஒரு சிறப்பு கதாபாத்திரமாக, `%s` எண்ணிக்கை எண்ணுக்கு மாற்றப்படும்.

source: Default is to use ``'Fig. %s'`` for ``'figure'``, ``'Table %s'`` for ``'table'``, ``'Listing %s'`` for ``'code-block'`` and ``'Section'`` for ``'section'``.
ta: இயல்புநிலை `` 'புள்ளிவிவரங்கள்'``, ``' அட்டவணைகள்'`` `'அட்டவணை'`,` `' பட்டியல்கள்'`` '' '' '' `` மற்றும் `'' பிரிவு` `'பிரிவுக்கு```.

source: if set to ``0``, figures, tables and code-blocks are continuously numbered starting at ``1``.
ta: `` 0`` என அமைக்கப்பட்டால், புள்ளிவிவரங்கள், அட்டவணைகள் மற்றும் குறியீடு-தொகுதிகள் தொடர்ந்து `` 1`` இல் தொடங்கப்படுகின்றன.

source: Remember that document names use ``/`` as the path separator and don't contain the file name extension.
ta: ஆவண பெயர்கள் ``/`` பாதை பிரிப்பானாகப் பயன்படுத்துகின்றன என்பதையும், கோப்பு பெயர் நீட்டிப்பு இல்லை என்பதையும் நினைவில் கொள்ளுங்கள்.

source: if ``1`` (default) numbers will be ``x.1``, ``x.2``, ... with ``x`` the section number (top level sectioning; no ``x.`` if no section). This naturally applies only if section numbering has been activated via the ``:numbered:`` option of the :rst:dir:`toctree` directive.
ta: `` 1`` (இயல்புநிலை) எண்கள் `` x.1``, `` x.2``, ... `` x`` பிரிவு எண் (உயர் நிலை பிரிவு; இல்லை `` x. `` பிரிவு இல்லை என்றால்). பிரிவு எண் ``: எண்ணற்ற: `` விருப்பம்: rst: dir: `toctree` கட்டளை வழியாக செயல்படுத்தப்பட்டிருந்தால் மட்டுமே இது இயற்கையாகவே பொருந்தும்.

source: ``2`` means that numbers will be ``x.y.1``, ``x.y.2``, ... if located in a sub-section (but still ``x.1``, ``x.2``, ... if located directly under a section and ``1``, ``2``, ... if not in any top level section.)
ta: `` 2`` என்றால், எண்கள் `` x.y.1``, `` x.y.2``, ஒரு துணைப்பிரிவில் அமைந்திருந்தால் (ஆனால் இன்னும் `` x.1``, `` x.2 ``, ... ஒரு பிரிவின் கீழ் நேரடியாக அமைந்தால் `` 1``, `` 2``, ... எந்த உயர் மட்டத்திலும் இல்லாவிட்டால்.)

source: etc...
ta: போன்றவை ...

source: The LaTeX builder obeys this setting (if :confval:`numfig` is set to ``True``).
ta: லேடெக்ச் பில்டர் இந்த அமைப்பைக் கடைப்பிடிக்கிறார் (if: confval: `numfig`` `உண்மை`` என அமைக்கப்பட்டுள்ளது).

source: If true, the `Docutils Smart Quotes transform`__, originally based on `SmartyPants`__ (limited to English) and currently applying to many languages, will be used to convert quotes and dashes to typographically correct entities. Default: ``True``.
ta: உண்மை என்றால், `டாக்யூடில்ச் அறிவுள்ள மேற்கோள்கள் உருமாறும்`__, முதலில்` ச்மார்டிபாண்ட்கள்` (ஆங்கிலத்திற்கு வரையறுக்கப்பட்டவை) அடிப்படையாகக் கொண்டது மற்றும் தற்போது பல மொழிகளுக்கு விண்ணப்பிக்கும், மேற்கோள்கள் மற்றும் கோடுகளை அச்சுக்கலை ரீதியாக சரியான நிறுவனங்களாக மாற்ற பயன்படுத்தப்படும். இயல்புநிலை: `` உண்மை``.

source: It replaces deprecated :confval:`html_use_smartypants`. It applies by default to all builders except ``man`` and ``text`` (see :confval:`smartquotes_excludes`.)
ta: இது நீக்கப்பட்டதை மாற்றுகிறது: confval: `html_use_smartypants`. `` மனிதன்` மற்றும் `` உரை`` தவிர அனைத்து பில்டர்களுக்கும் இது இயல்புநிலையாக பொருந்தும் (பார்க்க: confval: `smartquotes_excludes`.)

source: Since :file:`conf.py` is read as a Python file, the usual rules apply for encodings and Unicode support: declare the encoding using an encoding cookie (a comment like ``# -*- coding: utf-8 -*-``) and use Unicode string literals when you include non-ASCII characters in configuration values.
ta: பின்னர்: கோப்பு: `conf.py` ஒரு பைதான் கோப்பாக படிக்கப்படுகிறது, வழக்கமான விதிகள் குறியாக்கங்கள் மற்றும் யூனிகோட் ஆதரவுக்கு பொருந்தும்: குறியாக்க குக்கீயைப் பயன்படுத்தி குறியாக்கத்தை அறிவிக்கவும் (` `# -* -குறியீட்டு: யுடிஎஃப் -8 -*போன்ற ஒரு கருத்து -``) மற்றும் உள்ளமைவு மதிப்புகளில் ascii அல்லாத எழுத்துக்களைச் சேர்க்கும்போது யூனிகோட் சரம் எழுத்துக்களைப் பயன்படுத்தவும்.

source: A `docutils.conf`__ file located in the configuration directory (or a global :file:`~/.docutils` file) is obeyed unconditionally if it *deactivates* smart quotes via the corresponding `Docutils option`__. But if it *activates* them, then :confval:`smartquotes` does prevail.
ta: உள்ளமைவு கோப்பகத்தில் அமைந்துள்ள ஒரு `docutils.conf`__ கோப்பு (அல்லது உலகளாவிய: கோப்பு: கோப்பு:` ~/.docutils` கோப்பு) நிபந்தனையின்றி கீழ்ப்படிகிறது * அறிவுள்ள மேற்கோள்களை தொடர்புடைய `டொக்யூட்டில்ச் விருப்பம்`__ வழியாக செயலிழக்கச் செய்தால். ஆனால் அது * அவற்றை * செயல்படுத்தினால்,: confval: `ச்மார்ட் கியூட்ச்` மேலோங்குகிறது.

source: This string, for use with Docutils ``0.14`` or later, customizes the Smart Quotes transform. See the file :file:`smartquotes.py` at the `Docutils repository`__ for details. The default ``'qDe'`` educates normal **q**\ uote characters ``"``, ``'``, em- and en-**D**\ ashes ``---``, ``--``, and **e**\ llipses ``...``.
ta: இந்த சரம், டாக்யூடில்களுடன் பயன்படுத்த `` 0.14`` அல்லது அதற்குப் பிறகு, அறிவுள்ள மேற்கோள்கள் உருமாற்றத்தைத் தனிப்பயனாக்குகிறது. கோப்பைக் காண்க: கோப்பைக் காண்க: விவரங்களுக்கு `டாக்யூடில்ச் களஞ்சியத்தில்` அறிவுள்ள க்வோட்ச்.பை`. இயல்புநிலை `` 'qde'`` இயல்பான ** q ** \ uote எழுத்துக்கள் `` `` `,` `'` `` `` ``-** டி ** \ சாம்பல் `` --- `` `` `` `` `` `` ` , `` --``, மற்றும் ** e ** \ llipses `` ... ``.

source: This is a ``dict`` whose default is::
ta: இது ஒரு `` டிக்ட்`` அதன் இயல்புநிலை ::

source: Each entry gives a sufficient condition to ignore the :confval:`smartquotes` setting and deactivate the Smart Quotes transform. Accepted keys are as above ``'builders'`` or ``'languages'``. The values are lists.
ta: ஒவ்வொரு நுழைவும் புறக்கணிக்க போதுமான நிபந்தனையை அளிக்கிறது: confval: `ச்மார்ட் கியூட்ச்` அமைப்பு மற்றும் அறிவுள்ள மேற்கோள்கள் உருமாற்றத்தை செயலிழக்கச் செய்யுங்கள். ஏற்றுக்கொள்ளப்பட்ட விசைகள் `` 'பில்டர்கள்'`` அல்லது `' 'மொழிகள்`` மேலே உள்ளன. மதிப்புகள் பட்டியல்கள்.

source: Currently, in case of invocation of :program:`make` with multiple targets, the first target name is the only one which is tested against the ``'builders'`` entry and it decides for all. Also, a ``make text`` following ``make html`` needs to be issued in the form ``make text O="-E"`` to force re-parsing of source files, as the cached ones are already transformed. On the other hand the issue does not arise with direct usage of :program:`sphinx-build` as it caches (in its default usage) the parsed source files in per builder locations.
ta: தற்போது. மேலும், ஒரு `` உரையை உருவாக்கவும் `` `செய்யுங்கள் html` மாற்றப்பட்டது. மறுபுறம், சிக்கல் நேரடி பயன்பாட்டுடன் எழவில்லை: நிரல்: `ச்பின்க்ச்-பில்ட்` அது தற்காலிகமாக (அதன் இயல்புநிலை பயன்பாட்டில்) ஒரு பில்டர் இடங்களில் பாகுபடுத்தப்பட்ட மூல கோப்புகளை தற்காலிகமாக சேமிக்கும்போது.

source: If true, Sphinx verifies server certifications. Default is ``True``.
ta: உண்மை என்றால், சூரரிமாச்சிலை சேவையக சான்றிதழ்களை சரிபார்க்கிறது. இயல்புநிலை `` உண்மை``.

source: The contents of the config namespace are pickled (so that Sphinx can find out when configuration changes), so it may not contain unpickleable values -- delete them from the namespace with ``del`` if appropriate. Modules are removed automatically, so you don't need to ``del`` your imports after use.
ta: உள்ளமைவு பெயர்வெளியின் உள்ளடக்கங்கள் ஊறுகாய்களாகின்றன (இதனால் உள்ளமைவு மாறும்போது ச்பின்க்ச் கண்டுபிடிக்க முடியும்), எனவே அதில் திறக்க முடியாத மதிப்புகள் இருக்காது - பெயர்வெளியில் இருந்து அவற்றை `` டெல்`` பொருத்தமாக இருந்தால் அவற்றை நீக்கவும். தொகுதிகள் தானாக அகற்றப்படும், எனவே நீங்கள் பயன்படுத்திய பிறகு உங்கள் இறக்குமதியை `` டெல்`` தேவையில்லை.

source: A path to a certification file of CA or a path to directory which contains the certificates. This also allows a dictionary mapping hostname to the path to certificate file. The certificates are used to verify server certifications.
ta: ca இன் சான்றிதழ் கோப்பிற்கான பாதை அல்லது சான்றிதழ்களைக் கொண்ட கோப்பகத்திற்கான பாதை. இது ஒரு அகராதி மேப்பிங் ஓச்ட்பெயரை சான்றிதழ் கோப்புக்கான பாதைக்கு அனுமதிக்கிறது. சேவையக சான்றிதழ்களை சரிபார்க்க சான்றிதழ்கள் பயன்படுத்தப்படுகின்றன.

source: Project information
ta: திட்ட செய்தி

source: The documented project's name.
ta: ஆவணப்படுத்தப்பட்ட திட்டத்தின் பெயர்.

source: The author name(s) of the document. The default value is ``'unknown'``.
ta: ஆவணத்தின் ஆசிரியர் பெயர் (கள்). இயல்புநிலை மதிப்பு `` 'அறியப்படாதது'``.

source: A copyright statement in the style ``'2008, Author Name'``.
ta: பாணியில் ஒரு பதிப்புரிமை அறிக்கை `` '2008, ஆசிரியர் பெயர்'``.

source: The major project version, used as the replacement for ``|version|``. For example, for the Python documentation, this may be something like ``2.6``.
ta: முக்கிய திட்ட பதிப்பு, `` | பதிப்பு | `` க்கு மாற்றாக பயன்படுத்தப்படுகிறது. எடுத்துக்காட்டாக, பைதான் ஆவணங்களுக்கு, இது `` 2.6`` போன்றதாக இருக்கலாம்.

source: The full project version, used as the replacement for ``|release|`` and e.g. in the HTML templates. For example, for the Python documentation, this may be something like ``2.6.0rc1``.
ta: முழு திட்ட பதிப்பு, `` | வெளியீடு | `` மற்றும் எ.கா. html வார்ப்புருக்கள். எடுத்துக்காட்டாக, பைதான் ஆவணங்களுக்கு, இது `` 2.6.0rc1`` போன்றதாக இருக்கலாம்.

source: If you don't need the separation provided between :confval:`version` and :confval:`release`, just set them both to the same value.
ta: இடையில் வழங்கப்பட்ட பிரிப்பு உங்களுக்குத் தேவையில்லை என்றால்: confval: `பதிப்பு` மற்றும்: confval:` வெளியீடு`, இரண்டையும் ஒரே மதிப்புக்கு அமைக்கவும்.

source: These values determine how to format the current date, used as the replacement for ``|today|``.
ta: இந்த மதிப்புகள் தற்போதைய தேதியை எவ்வாறு வடிவமைப்பது என்பதை தீர்மானிக்கிறது, இது `` | இன்று | `` க்கு மாற்றாக பயன்படுத்தப்படுகிறது.

source: If you set :confval:`today` to a non-empty value, it is used.
ta: நீங்கள் அமைத்தால்: confval: `இன்று` காலியாக இல்லாத மதிப்புக்கு, அது பயன்படுத்தப்படுகிறது.

source: Otherwise, the current time is formatted using :func:`time.strftime` and the format given in :confval:`today_fmt`.
ta: இல்லையெனில், தற்போதைய நேரம் பயன்படுத்தி வடிவமைக்கப்பட்டுள்ளது: func: `time.strftime` மற்றும் கொடுக்கப்பட்ட வடிவம்: confval:` today_fmt`.

source: The default is no :confval:`today` and a :confval:`today_fmt` of ``'%B %d, %Y'`` (or, if translation is enabled with :confval:`language`, an equivalent format for the selected locale).
ta: இயல்புநிலை இல்லை: confval: `இன்று` மற்றும் ஒரு: கான்ஃப்வால்:` `' %b %d, %y'`` (அல்லது, மொழிபெயர்ப்பு இயக்கப்பட்டிருந்தால்: confval:` மொழி`, சமமான வடிவம் தேர்ந்தெடுக்கப்பட்ட இடத்திற்கு).

source: The default language to highlight source code in. The default is ``'python3'``. The value should be a valid Pygments lexer name, see :ref:`code-examples` for more details.
ta: மூலக் குறியீட்டை முன்னிலைப்படுத்த இயல்புநிலை மொழி. இயல்புநிலை `` 'பைதான் 3'``. மதிப்பு செல்லுபடியாகும் பைக்மென்ட் லெக்சர் பெயராக இருக்க வேண்டும், காண்க: குறிப்பு: மேலும் விவரங்களுக்கு `கோட்-எக்சாம்பிள்ச்`.

source: The default is now ``'default'``. It is similar to ``'python3'``; it is mostly a superset of ``'python'``. but it fallbacks to ``'none'`` without warning if failed. ``'python3'`` and other languages will emit warning if failed. If you prefer Python 2 only highlighting, you can set it back to ``'python'``.
ta: இயல்புநிலை இப்போது `` 'இயல்புநிலை'``. இது `` 'பைதான் 3'`` க்கு ஒத்ததாகும்; இது பெரும்பாலும் `` 'பைதான்'`` இன் சூப்பர்செட் ஆகும். ஆனால் தோல்வியுற்றால் எச்சரிக்கையின்றி `` 'எதுவுமில்லை'` இது குறைகிறது. `` 'பைதான் 3'`` மற்றும் பிற மொழிகள் தோல்வியுற்றால் எச்சரிக்கையை வெளியிடும். நீங்கள் பைதான் 2 ஐ முன்னிலைப்படுத்த விரும்பினால், அதை மீண்டும் `` 'பைதான்'`` க்கு அமைக்கலாம்.

source: A dictionary of options that modify how the lexer specified by :confval:`highlight_language` generates highlighted source code. These are lexer-specific; for the options understood by each, see the `Pygments documentation <http://pygments.org/docs/lexers/>`_.
ta: லெக்சர் எவ்வாறு குறிப்பிடப்பட்டுள்ளது என்பதை மாற்றியமைக்கும் விருப்பங்களின் அகராதி: confval: `சிறப்பம்சமாக_எல்யூசாச்` சிறப்பம்சமாக மூலக் குறியீட்டை உருவாக்குகிறது. இவை லெக்சர்-குறிப்பிட்டவை; ஒவ்வொருவரும் புரிந்துகொள்ளும் விருப்பங்களுக்கு, `பைக்மென்ட் ஆவணங்கள் <http://pygments.org/docs/lexers/>` _ ஐப் பார்க்கவும்.

source: There is a special object named ``tags`` available in the config file. It can be used to query and change the tags (see :ref:`tags`). Use ``tags.has('tag')`` to query, ``tags.add('tag')`` and ``tags.remove('tag')`` to change. Only tags set via the ``-t`` command-line option or via ``tags.add('tag')`` can be queried using ``tags.has('tag')``. Note that the current builder tag is not available in ``conf.py``, as it is created *after* the builder is initialized.
ta: கட்டமைப்பு கோப்பில் `` குறிச்சொற்கள்` என்ற சிறப்பு பொருள் உள்ளது. குறிச்சொற்களை வினவவும் மாற்றவும் இதைப் பயன்படுத்தலாம் (பார்க்க: குறிப்பு: `குறிச்சொற்கள்`). `` குறிச்சொற்கள்) `` வினவ, `` குறிச்சொற்கள். `` -t`` கட்டளை-வரி விருப்பம் வழியாக அல்லது `` குறிச்சொற்கள். தற்போதைய பில்டர் குறிச்சொல் `` conf.py`` இல் கிடைக்கவில்லை என்பதை நினைவில் கொள்க, ஏனெனில் இது உருவாக்கப்பட்டது * பில்டர் துவக்கப்பட்ட பிறகு.

source: The style name to use for Pygments highlighting of source code. If not set, either the theme's default style or ``'sphinx'`` is selected for HTML output.
ta: மூலக் குறியீட்டை முன்னிலைப்படுத்த பைக்மென்ட்ச் பயன்படுத்த பாணி பெயர். அமைக்கப்படாவிட்டால், கருப்பொருள் இயல்புநிலை பாணி அல்லது `` 'ச்பின்எக்ச்'`` html வெளியீட்டிற்கு தேர்ந்தெடுக்கப்படுகிறது.

source: If the value is a fully-qualified name of a custom Pygments style class, this is then used as custom style.
ta: மதிப்பு தனிப்பயன் பைக்மென்ட் பாணி வகுப்பின் முழுமையான தகுதி வாய்ந்த பெயராக இருந்தால், இது தனிப்பயன் பாணியாகப் பயன்படுத்தப்படுகிறது.

source: A boolean that decides whether parentheses are appended to function and method role text (e.g. the content of ``:func:`input```) to signify that the name is callable. Default is ``True``.
ta: பெயர் அழைக்கக்கூடியது என்பதைக் குறிக்கும் வகையில், அடைப்புக்குறிக்குள் செயல்பாடு மற்றும் முறை பங்கு உரைக்கு (எ.கா.: func: `உள்ளீடு``` இன் உள்ளடக்கம்) சேர்க்கப்பட்டுள்ளதா என்பதை தீர்மானிக்கும் ஒரு பூலியன். இயல்புநிலை `` உண்மை``.

source: A boolean that decides whether module names are prepended to all :term:`object` names (for object types where a "module" of some kind is defined), e.g. for :rst:dir:`py:function` directives. Default is ``True``.
ta: அனைவருக்கும் தொகுதி பெயர்கள் தயாரிக்கப்படுகின்றனவா என்பதை தீர்மானிக்கும் ஒரு பூலியன்: சொல்: `பொருள்` பெயர்கள் (சில வகையான" தொகுதி "வரையறுக்கப்பட்ட பொருள் வகைகளுக்கு), எ.கா. க்கு: rst: dir: `py: செயல்பாடு` வழிமுறைகள். இயல்புநிலை `` உண்மை``.

source: A boolean that decides whether :rst:dir:`codeauthor` and :rst:dir:`sectionauthor` directives produce any output in the built files.
ta: : rst: dir: `codeauthor` மற்றும்: rst: dir:` பிரிவு வழக்கறிஞர்` கட்டளைகள் கட்டப்பட்ட கோப்புகளில் எந்த வெளியீட்டையும் உருவாக்குகின்றன என்பதை தீர்மானிக்கும் ஒரு பூலியன்.

source: A list of prefixes that are ignored for sorting the Python module index (e.g., if this is set to ``['foo.']``, then ``foo.bar`` is shown under ``B``, not ``F``). This can be handy if you document a project that consists of a single package. Works only for the HTML builder currently. Default is ``[]``.
ta: பைதான் தொகுதி குறியீட்டை வரிசைப்படுத்துவதற்கு புறக்கணிக்கப்பட்ட முன்னொட்டுகளின் பட்டியல் (எ.கா., இது `` ['foo.'] ``, பின்னர் `` foo.bar`` இன் கீழ் காட்டப்பட்டுள்ளது `` f``). ஒற்றை தொகுப்பைக் கொண்ட ஒரு திட்டத்தை நீங்கள் ஆவணப்படுத்தினால் இது எளிது. தற்போது html பில்டருக்கு மட்டுமே வேலை செய்கிறது. இயல்புநிலை `` [] ``.

source: Trim spaces before footnote references that are necessary for the reST parser to recognize the footnote, but do not look too nice in the output.
ta: அடிக்குறிப்புக்கு முன் இடங்களை ஒழுங்கமைக்கவும், மீதமுள்ள பாகுபடுத்தி அடிக்குறிப்பை அடையாளம் காண அவசியமானவை, ஆனால் வெளியீட்டில் மிகவும் அழகாக இல்லை.

source: If true, doctest flags (comments looking like ``# doctest: FLAG, ...``) at the ends of lines and ``<BLANKLINE>`` markers are removed for all code blocks showing interactive Python sessions (i.e. doctests). Default is ``True``. See the extension :mod:`~sphinx.ext.doctest` for more possibilities of including doctests.
ta: உண்மையாக இருந்தால், டாக்ச்டெச்ட் கொடிகள் (கருத்துகள் ``# ஆவண: கொடி, ... ``) வரிகளின் முனைகளில் மற்றும் ஊடாடும் பைதான் அமர்வுகளைக் காட்டும் அனைத்து குறியீடு தொகுதிகளுக்கும் `` <mangline> `` குறிப்பான்கள் அகற்றப்படுகின்றன (அதாவது ஆவணங்கள்) . இயல்புநிலை `` உண்மை``. நீட்டிப்பைக் காண்க: மோட்: `~ sphinx.ext.doctast` ஆவணங்களைச் சேர்ப்பதற்கான கூடுதல் சாத்தியக்கூறுகளுக்கு.

source: Now also removes ``<BLANKLINE>``.
ta: இப்போது `` <slankline> `` ஐயும் நீக்குகிறது.

source: The build configuration file
ta: உருவாக்க உள்ளமைவு கோப்பு

source: Options for internationalization
ta: சர்வதேசமயமாக்கலுக்கான விருப்பங்கள்

source: These options influence Sphinx's *Native Language Support*. See the documentation on :ref:`intl` for details.
ta: இந்த விருப்பங்கள் ச்பின்க்சின் *சொந்த மொழி ஆதரவை *பாதிக்கின்றன. விவரங்களுக்கு ஆவணங்களை காண்க: ref: `intl`.

source: The code for the language the docs are written in. Any text automatically generated by Sphinx will be in that language. Also, Sphinx will try to substitute individual paragraphs from your documents with the translation sets obtained from :confval:`locale_dirs`. Sphinx will search language-specific figures named by `figure_language_filename` and substitute them for original figures. In the LaTeX builder, a suitable language will be selected as an option for the *Babel* package. Default is ``None``, which means that no translation will be done.
ta: டாக்ச் எழுதப்பட்ட மொழிக்கான குறியீடு. ச்பிங்க்சால் தானாக உருவாக்கப்படும் எந்த உரையும் அந்த மொழியில் இருக்கும். மேலும், சூரரிமாச்சிலை உங்கள் ஆவணங்களிலிருந்து தனிப்பட்ட பத்திகளை மொழிபெயர்ப்பு தொகுப்புகளுடன் மாற்ற முயற்சிக்கும்: confval: `locale_dirs`. ச்பின்க்ச் `figure_language_filename` என பெயரிடப்பட்ட மொழி-குறிப்பிட்ட புள்ளிவிவரங்களைத் தேடி அசல் புள்ளிவிவரங்களுக்கு மாற்றும். லேடெக்ச் பில்டரில், * பாபல் * தொகுப்புக்கான விருப்பமாக பொருத்தமான மொழி தேர்ந்தெடுக்கப்படும். இயல்புநிலை `` எதுவுமில்லை``, அதாவது எந்த மொழிபெயர்ப்பும் செய்யப்படாது.

source: Support figure substitution
ta: உதவி எண்ணிக்கை மாற்றீடு

source: Currently supported languages by Sphinx are:
ta: சூரரிமாச்சிலை ஆல் தற்போது ஆதரிக்கப்படும் மொழிகள்:

source: ``bn`` -- Bengali
ta: `` பி.என்`` - பெங்காலி

source: ``ca`` -- Catalan
ta: `` ca`` - கற்றலான்

source: ``cs`` -- Czech
ta: `` cs`` - செக்

source: ``et`` -- Estonian
ta: `` et`` - எச்டோனியன்

source: ``eu`` -- Basque
ta: `` eu`` - பாச்க்

source: ``fa`` -- Iranian
ta: `` fa`` - ஈரானிய

source: ``he`` -- Hebrew
ta: `` அவர்`` - எபிரேய

source: General configuration
ta: பொது உள்ளமைவு
