Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_tutorial--deploying_*.po
Languages: ta

source: Therefore, the challenge is less how or where to serve the static HTML, but rather how to pick a workflow that automatically updates the deployed documentation every time there is a change in the source files.
ta: ஆகையால், அறைகூவல் நிலையான html ஐ எவ்வாறு அல்லது எங்கு பணி செய்வது என்பது குறைவாகவே உள்ளது, மாறாக மூலக் கோப்புகளில் மாற்றம் ஏற்படும் ஒவ்வொரு முறையும் பயன்படுத்தப்பட்ட ஆவணங்களை தானாகவே புதுப்பிக்கும் ஒரு பணிப்பாய்வுகளை எவ்வாறு தேர்ந்தெடுப்பது.

source: Click on the :guilabel:`Commit changes` button.
ta: என்பதைக் சொடுக்கு செய்க: கிலாபெல்: `கமிட் மாற்றங்கள்` பொத்தானை.

source: Make sure you don't upload the ``docs/build`` directory, as it contains the output generated by Sphinx and it will change every time you change the sources, complicating your workflow.
ta: நீங்கள் `` டாக்ச்/பில்ட்`` கோப்பகத்தை பதிவேற்றவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், ஏனெனில் இது ச்பிங்க்ச் உருவாக்கிய வெளியீட்டைக் கொண்டுள்ளது, மேலும் ஒவ்வொரு முறையும் நீங்கள் ஆதாரங்களை மாற்றும்போது, உங்கள் பணிப்பாய்வுகளை சிக்கலாக்கும்.

source: These steps do not require access to the command line or installing any additional software. To learn more, you can:
ta: இந்த படிகளுக்கு கட்டளை வரிக்கு அணுகல் தேவையில்லை அல்லது கூடுதல் மென்பொருளை நிறுவுதல் தேவையில்லை. மேலும் அறிய, உங்களால் முடியும்:

source: Follow `this interactive GitHub course`_ to learn more about how the GitHub interface works.
ta: அறிவிலிமையம் இடைமுகம் எவ்வாறு செயல்படுகிறது என்பதைப் பற்றி மேலும் அறிய `இந்த ஊடாடும் அறிவிலிமையம் பாடநெறி`_ ஐப் பின்தொடரவும்.

source: Read `this quickstart tutorial`_ to install extra software on your machine and have more flexibility. You can either use the Git command line, or the GitHub Desktop application.
ta: உங்கள் கணினியில் கூடுதல் மென்பொருளை நிறுவ `இந்த விரைவு டார்ட் டுடோரியல்`_ ஐப் படிக்கவும், மேலும் நெகிழ்வுத்தன்மையைக் கொண்டிருக்கவும். நீங்கள் அறிவிலி கட்டளை வரி அல்லது அறிவிலிமையம் டெச்க்டாப் பயன்பாட்டைப் பயன்படுத்தலாம்.

source: GitLab
ta: கிட்லாப்

source: Similarly to GitHub, the fastest way to upload your project to GitLab is using the web interface:
ta: கிதுபைப் போலவே, உங்கள் திட்டத்தை கிட்லாப்பில் பதிவேற்றுவதற்கான விரைவான வழி வலை இடைமுகத்தைப் பயன்படுத்துகிறது:

source: `Sign up for a GitLab account <https://gitlab.com/users/sign_up>`_.
ta: `ஒரு கிட்லாப் கணக்கிற்கு பதிவுபெறுக <https://gitlab.com/users/sign_up>` _.

source: `Create a new blank project <https://gitlab.com/projects/new>`_.
ta: `ஒரு புதிய வெற்று திட்டத்தை உருவாக்கவும் <https://gitlab.com/projects/new>` _.

source: Upload the project files (in your case ``README.rst``, ``lumache.py``, the makefiles under the ``docs`` directory, and everything under ``docs/source``) one by one using the :guilabel:`Upload File` button [#f1]_.
ta: திட்டக் கோப்புகளைப் பதிவேற்றவும் (உங்கள் விசயத்தில் `` readme.rst``, `` lumache.py``, `` டாக்ச்`` கோப்பகத்தின் கீழ் உள்ள மேக்ஃபைல்கள், மற்றும் `` டாக்ச்/மூல`` இன் கீழ் உள்ள அனைத்தும் ஒன்றைப் பயன்படுத்துங்கள் தி: கிலாபெல்: `கோப்பை பதிவேற்றவும்` பொத்தானை [#f1] _.

source: Again, these steps do not require additional software on your computer. To learn more, you can:
ta: மீண்டும், இந்த படிகளுக்கு உங்கள் கணினியில் கூடுதல் மென்பொருள் தேவையில்லை. மேலும் அறிய, உங்களால் முடியும்:

source: Follow `this tutorial`_ to install Git on your machine.
ta: உங்கள் கணினியில் அறிவிலி நிறுவ `இந்த டுடோரியல்`_ ஐப் பின்தொடரவும்.

source: Browse the `GitLab User documentation`_ to understand the possibilities of the platform.
ta: தளத்தின் சாத்தியக்கூறுகளைப் புரிந்துகொள்ள `கிட்லாப் பயனர் ஆவணங்கள்`_ ஐ உலாவுக.

source: The following sections describe some of the available options to deploy your online documentation, and give some background information. If you want to go directly to the practical part, you can skip to :ref:`publishing-sources`.
ta: பின்வரும் பிரிவுகள் உங்கள் நிகழ்நிலை ஆவணங்களை வரிசைப்படுத்த கிடைக்கக்கூடிய சில விருப்பங்களை விவரிக்கின்றன, மேலும் சில பின்னணி தகவல்களை வழங்குகின்றன. நீங்கள் நேரடியாக நடைமுறை பகுதிக்குச் செல்ல விரும்பினால், நீங்கள் தவிர்க்கலாம்: குறிப்பு: `வெளியீட்டு-மூலங்கள்`.

source: At the time of writing, `uploading whole directories to GitLab using only the web interface <https://gitlab.com/gitlab-org/gitlab/-/issues/228490>`_ is not yet implemented.
ta: எழுதும் நேரத்தில், `முழு கோப்பகங்களையும் கிட்லாப்பில் பதிவேற்றுவது வலை இடைமுகத்தை மட்டுமே பயன்படுத்தி <https://gitlab.com/gitlab-org/gitlab/-/issues/228490>` _ _ இன்னும் செயல்படுத்தப்படவில்லை.

source: Publishing your HTML documentation
ta: உங்கள் html ஆவணங்களை வெளியிடுகிறது

source: Read the Docs
ta: டாக்சைப் படியுங்கள்

source: `Read the Docs`_ offers integration with both GitHub and GitLab. The quickest way of getting started is to follow :doc:`the RTD tutorial <readthedocs:tutorial/index>`, which is loosely based on this one. You can publish your sources on GitHub as explained :ref:`in the previous section <publishing-sources>`, then skip directly to :ref:`readthedocs:tutorial/index:Sign up for Read the Docs`. If you choose GitLab instead, the process is similar.
ta: `டாக்சைப் படியுங்கள் `_ அறிவிலிமையம் மற்றும் கிட்லாப் இரண்டையும் ஒருங்கிணைப்பதை வழங்குகிறது. தொடங்குவதற்கான விரைவான வழி பின்தொடர்வது: டாக்: `ஆர்டிடி டுடோரியல் <ரீட் டோக்ச்: டுடோரியல்/இன்டெக்ச்>`, இது தளர்வாக இதை அடிப்படையாகக் கொண்டது. விளக்கப்பட்டுள்ளபடி உங்கள் ஆதாரங்களை கிதுபில் வெளியிடலாம்: ref: `முந்தைய பிரிவில் <வெளியீட்டு-மூலங்கள்>`, பின்னர் நேரடியாகத் தவிர்க்கவும்: குறிப்பு: `readthedocs: டுடோரியல்/குறியீட்டு: டாக்சைப் படிக்க பதிவுபெறுக. அதற்கு பதிலாக நீங்கள் கிட்லாப்பைத் தேர்வுசெய்தால், செயல்முறை ஒத்திருக்கிறது.

source: GitHub Pages
ta: அறிவிலிமையம் பக்கங்கள்

source: `GitHub Pages`_ requires you to :ref:`publish your sources <publishing-sources>` on `GitHub`_. After that, you will need an automated process that performs the ``make html`` step every time the sources change. That can be achieved using `GitHub Actions`_.
ta: `கிட்அப் பக்கங்கள்`_ உங்களுக்கு தேவைப்படுகிறது: ref:` உங்கள் ஆதாரங்களை <வெளியீட்டு-மூலங்கள்> `` github`_ இல் வெளியிடுங்கள். அதன்பிறகு, ஒவ்வொரு முறையும் ஆதாரங்கள் மாறும்போது `` html` `படி செய்யும் ஒரு தானியங்கி செயல்முறை உங்களுக்குத் தேவைப்படும். `கிதுப் செயல்கள்`_ ஐப் பயன்படுத்தி அதை அடையலாம்.

source: After you have published your sources on GitHub, create a file named ``.github/workflows/sphinx.yml`` in your repository with the following contents:
ta: கிதுபில் உங்கள் ஆதாரங்களை வெளியிட்ட பிறகு, பின்வரும் உள்ளடக்கங்களுடன் உங்கள் களஞ்சியத்தில் `` .github/பணிப்பாய்வு/sphinx.yml` என்ற கோப்பை உருவாக்கவும்:

source: .github/workflows/
ta: .github/பணிப்பாய்வு/

source: Sphinx-friendly deployment options
ta: ச்பிங்க்ச்-நட்பு வரிசைப்படுத்தல் விருப்பங்கள்

source: Appendix: Deploying a Sphinx project online
ta: பின் இணைப்பு: ஆன்லைனில் ஒரு ச்பிங்க்ச் திட்டத்தை பயன்படுத்துதல்

source: There are several possible options you have to host your Sphinx documentation. Some of them are:
ta: உங்கள் ச்பிங்க்ச் ஆவணங்களை புரவலன் செய்ய பல சாத்தியமான விருப்பங்கள் உள்ளன. அவற்றில் சில:

source: This contains a GitHub Actions workflow with a single job of four steps:
ta: இதில் நான்கு படிகள் கொண்ட ஒரு வேலையுடன் அறிவிலிமையம் செயல்கள் பணிப்பாய்வு உள்ளது:

source: Checkout the code.
ta: குறியீட்டைப் பாருங்கள்.

source: Build the HTML documentation using Sphinx.
ta: சூரரிமாச்சிலை ஐப் பயன்படுத்தி html ஆவணங்களை உருவாக்குங்கள்.

source: Attach the HTML output the artifacts to the GitHub Actions job, for easier inspection.
ta: html வெளியீட்டை அறிவிலிமையம் செயல்கள் வேலையுடன் கலைப்பொருட்களை இணைக்கவும், எளிதாக ஆய்வு செய்ய.

source: If the change happens on the default branch, take the contents of ``docs/build/html`` and push it to the ``gh-pages`` branch.
ta: இயல்புநிலை கிளையில் மாற்றம் நடந்தால், `` டாக்ச்/பில்ட்/இடிஎம்எல்`` இன் உள்ளடக்கங்களை எடுத்து `` சிஎச்-பக்கங்கள்` கிளைக்கு தள்ளுங்கள்.

source: Next, you need to specify the dependencies for the ``make html`` step to be successful. For that, create a file ``docs/requirements.txt`` and add the following contents:
ta: அடுத்து, வெற்றிகரமாக இருக்க `` html` `படி செய்யுங்கள் என்பதற்கான சார்புகளை நீங்கள் குறிப்பிட வேண்டும். அதற்காக, ஒரு கோப்பை `` டாக்ச்/தேவைகள். txt`` உருவாக்கி பின்வரும் உள்ளடக்கங்களைச் சேர்க்கவும்:

source: docs/requirements.txt
ta: டாக்ச்/தேவைகள்

source: And finally, you are ready to `enable GitHub Pages on your repository`_. For that, go to :guilabel:`Settings`, then :guilabel:`Pages` on the left sidebar, select the ``gh-pages`` branch in the "Source" dropdown menu, and click :guilabel:`Save`. After a few minutes, you should be able to see your HTML at the designated URL.
ta: இறுதியாக, உங்கள் களஞ்சியத்தில் `_ இல் அறிவிலிமையம் பக்கங்களை இயக்க நீங்கள் தயாராக உள்ளீர்கள். அதற்காக, செல்லவும்: கிலாபெல்: `அமைப்புகள்`, பின்னர்: கிலாபெல்:` பக்கங்கள்` இடது பக்கப்பட்டியில், "மூல" கீழ்தோன்றும் மெனுவில் `` சிஎச்-பேச்`` கிளையைத் தேர்ந்தெடுத்து, சொடுக்கு செய்க: கிலாபெல்: `சேமி` . சில நிமிடங்களுக்குப் பிறகு, உங்கள் html ஐ நியமிக்கப்பட்ட முகவரி இல் பார்க்க முடியும்.

source: GitLab Pages
ta: கிட்லாப் பக்கங்கள்

source: `GitLab Pages`_, on the other hand, requires you to :ref:`publish your sources <publishing-sources>` on `GitLab`_. When you are ready, you can automate the process of running ``make html`` using `GitLab CI`_.
ta: `கிட்லாப் பக்கங்கள்`_, மறுபுறம், உங்களுக்கு தேவைப்படுகிறது: ref:` உங்கள் ஆதாரங்களை <வெளியீட்டு-மூலங்கள்> `` gitlab`_ இல் வெளியிடுங்கள். நீங்கள் தயாராக இருக்கும்போது, `gitlab ci`_ ஐப் பயன்படுத்தி` `html` ஐ உருவாக்கும் செயல்முறையை தானியக்கமாக்கலாம்.

source: After you have published your sources on GitLab, create a file named ``.gitlab-ci.yml`` in your repository with these contents:
ta: கிட்லாப்பில் உங்கள் ஆதாரங்களை நீங்கள் வெளியிட்ட பிறகு, இந்த உள்ளடக்கங்களுடன் உங்கள் களஞ்சியத்தில் `` .gitlab-ci.yml`` என்ற கோப்பை உருவாக்கவும்:

source: `Read the Docs`_ is an online service specialized in hosting technical documentation written in Sphinx, as well as MkDocs. They have a number of extra features, such as versioned documentation, traffic and search analytics, custom domains, user-defined redirects, and more.
ta: `டாக்சைப் படியுங்கள் `_ என்பது ச்பிங்க்சில் எழுதப்பட்ட தொழில்நுட்ப ஆவணங்களை புரவலன் செய்வதில் நிபுணத்துவம் வாய்ந்த ஒரு நிகழ்நிலை சேவையாகும், அதே போல் எம்.கே.டி.ஓ.சி.எச். பதிப்பு செய்யப்பட்ட ஆவணங்கள், போக்குவரத்து மற்றும் தேடல் பகுப்பாய்வு, தனிப்பயன் களங்கள், பயனர் வரையறுக்கப்பட்ட வழிமாற்றுகள் மற்றும் பல போன்ற கூடுதல் நற்பொருத்தங்கள் அவற்றில் உள்ளன.

source: This contains a GitLab CI workflow with one job of several steps:
ta: இதில் பல படிகளின் ஒரு வேலையுடன் கிட்லாப் சிஐ பணிப்பாய்வு உள்ளது:

source: Install the necessary dependencies.
ta: தேவையான சார்புகளை நிறுவவும்.

source: Move the output to a known artifacts location.
ta: அறியப்பட்ட கலைப்பொருட்கள் இருப்பிடத்திற்கு வெளியீட்டை நகர்த்தவும்.

source: You will need to `validate your account`_ by entering a payment method (you will be charged a small amount that will then be reimbursed).
ta: கட்டண முறையை உள்ளிடுவதன் மூலம் நீங்கள் `உங்கள் கணக்கை சரிபார்க்க வேண்டும் `__ க்கு ஒரு சிறிய தொகை கட்டணம் வசூலிக்கப்படும், பின்னர் அது திருப்பிச் செலுத்தப்படும்).

source: **Read the Docs**
ta: ** டாக்சைப் படியுங்கள் **

source: After that, if the pipeline is successful, you should be able to see your HTML at the designated URL.
ta: அதன்பிறகு, குழாய் வெற்றிகரமாக இருந்தால், நியமிக்கப்பட்ட முகவரி இல் உங்கள் html ஐ நீங்கள் காண முடியும்.

source: `GitHub Pages`_ is a simple static web hosting tightly integrated with `GitHub`_: static HTML is served from one of the branches of a project, and usually sources are stored in another branch so that the output can be updated every time the sources change (for example using `GitHub Actions`_). It is free to use and supports custom domains.
ta: `கிட்அப் பக்கங்கள்`_ என்பது ஒரு எளிய நிலையான வலை ஓச்டிங்` கிதுப்`_ உடன் இறுக்கமாக ஒருங்கிணைக்கப்பட்டுள்ளது: நிலையான html ஒரு திட்டத்தின் கிளைகளில் ஒன்றிலிருந்து வழங்கப்படுகிறது, மேலும் பொதுவாக ஆதாரங்கள் மற்றொரு கிளையில் சேமிக்கப்படுகின்றன, இதனால் ஒவ்வொரு முறையும் வெளியீட்டை புதுப்பிக்க முடியும் ஆதாரங்கள் மாறுகின்றன (எடுத்துக்காட்டாக `கிட்அப் செயல்கள்`_ ஐப் பயன்படுத்துதல்). இது பயன்படுத்த இலவசம் மற்றும் தனிப்பயன் களங்களை ஆதரிக்கிறது.

source: **GitHub Pages**
ta: ** அறிவிலிமையம் பக்கங்கள் **

source: `GitLab Pages`_ is a similar concept to GitHub Pages, integrated with `GitLab`_ and usually automated with `GitLab CI`_ instead.
ta: `கிட்லாப் பக்கங்கள்`_ என்பது அறிவிலிமையம் பக்கங்களுக்கு ஒத்த கருத்தாகும், இது` கிட்லாப்`_ உடன் ஒருங்கிணைக்கப்பட்டு பொதுவாக அதற்கு பதிலாக `கிட்லாப் சிஐ`_ உடன் தானியங்கி செய்யப்படுகிறது.

source: **GitLab Pages**
ta: ** கிட்லாப் பக்கங்கள் **

source: When you are ready to show your documentation project to the world, there are many options available to do so. Since the HTML generated by Sphinx is static, you can decouple the process of building your HTML documentation from hosting such files in the platform of your choice. You will not need a sophisticated server running Python: virtually every web hosting service will suffice.
ta: உங்கள் ஆவணத் திட்டத்தை உலகுக்குக் காட்ட நீங்கள் தயாராக இருக்கும்போது, அவ்வாறு செய்ய பல விருப்பங்கள் உள்ளன. சூரரிமாச்சிலை ஆல் உருவாக்கப்பட்ட html நிலையானது என்பதால், அத்தகைய கோப்புகளை நீங்கள் விரும்பும் மேடையில் புரவலன் செய்வதிலிருந்து உங்கள் html ஆவணங்களை உருவாக்கும் செயல்முறையை நீங்கள் துண்டிக்கலாம். பைதான் இயங்கும் ஒரு அதிநவீன சேவையகம் உங்களுக்கு தேவையில்லை: கிட்டத்தட்ட ஒவ்வொரு வலை ஓச்டிங் சேவையும் போதுமானதாக இருக்கும்.

source: `Netlify`_ is a sophisticated hosting for static sites enhanced by client-side web technologies like JavaScript (so-called `"Jamstack"`_). They offer support for headless content management systems and serverless computing.
ta: `நெட்ட்லிஃபை`_ என்பது சாவாச்கிரிப்ட் போன்ற கிளையன்ட் பக்க வலை தொழில்நுட்பங்களால் மேம்படுத்தப்பட்ட நிலையான தளங்களுக்கான அதிநவீன ஓச்டிங் ஆகும் (` "சாம்ச்டாக்" `_). அவை எட்லெச் உள்ளடக்க மேலாண்மை அமைப்புகள் மற்றும் சர்வர்லெச் கம்ப்யூட்டிங் ஆகியவற்றிற்கான ஆதரவை வழங்குகின்றன.

source: You can always use your own web server to host Sphinx HTML documentation. It is the option that gives more flexibility, but also more complexity.
ta: சூரரிமாச்சிலை html ஆவணங்களை புரவலன் செய்ய நீங்கள் எப்போதும் உங்கள் சொந்த வலை சேவையகத்தைப் பயன்படுத்தலாம். இது அதிக நெகிழ்வுத்தன்மையை அளிக்கும் விருப்பம், ஆனால் மிகவும் சிக்கலானது.

source: **Your own server**
ta: ** உங்கள் சொந்த சேவையகம் **

source: All these options have zero cost, with the option of paying for extra features.
ta: இந்த விருப்பங்கள் அனைத்தும் சுழிய செலவைக் கொண்டுள்ளன, கூடுதல் அம்சங்களுக்கு பணம் செலுத்துவதற்கான விருப்பத்துடன்.

source: Embracing the "Docs as Code" philosophy
ta: "டாக்ச் என குறியீடு" தத்துவத்தைத் தழுவுதல்

source: The free offerings of most of the options listed above require your documentation sources to be publicly available. Moreover, these services expect you to use a `Version Control System`_, a technology that tracks the evolution of a collection of files as a series of snapshots ("commits"). The practice of writing documentation in plain text files with the same tools as the ones used for software development is commonly known as `"Docs as Code"`_.
ta: மேலே பட்டியலிடப்பட்டுள்ள பெரும்பாலான விருப்பங்களின் இலவச பிரசாதங்கள் உங்கள் ஆவணங்கள் ஆதாரங்கள் பொதுவில் கிடைக்க வேண்டும். மேலும், இந்த சேவைகள் `பதிப்பு கட்டுப்பாட்டு அமைப்பு`_, கோப்புகளின் தொகுப்பின் பரிணாமத்தை தொடர்ச்சியான ச்னாப்சாட்களாகக் கண்காணிக்கும் தொழில்நுட்பத்தைப் பயன்படுத்த வேண்டும் என்று எதிர்பார்க்கிறீர்கள். மென்பொருள் மேம்பாட்டுக்குப் பயன்படுத்தப்படும் அதே கருவிகளைக் கொண்ட எளிய உரை கோப்புகளில் ஆவணங்களை எழுதும் நடைமுறை பொதுவாக `" டாக்ச் எனக் குறியீடு "` _ என அழைக்கப்படுகிறது.

source: The most popular Version Control System nowadays is Git_, a free and open source tool that is the backbone of services like GitHub and GitLab. Since both Read the Docs and Netlify have integrations with GitHub and GitLab, and both GitHub and GitLab have an integrated Pages product, the most effective way of automatically build your documentation online is to upload your sources to either of these Git hosting services.
ta: இப்போதெல்லாம் மிகவும் பிரபலமான பதிப்பு கட்டுப்பாட்டு அமைப்பு git_, இலவச மற்றும் திறந்த மூல கருவியாகும், இது அறிவிலிமையம் மற்றும் கிட்லாப் போன்ற சேவைகளின் முதுகெலும்பாகும். இருவரும் டாக்சைப் படித்து, நெட்ட்லிஃபை அறிவிலிமையம் மற்றும் கிட்லாப் உடன் ஒருங்கிணைப்புகளைக் கொண்டிருப்பதால், அறிவிலிமையம் மற்றும் கிட்லாப் ஆகிய இரண்டும் ஒருங்கிணைந்த பக்கங்கள் தயாரிப்பைக் கொண்டுள்ளன, மேலும் உங்கள் ஆவணங்களை ஆன்லைனில் தானாகவே உருவாக்குவதற்கான மிகச் சிறந்த வழி, உங்கள் ஆதாரங்களை இந்த சிஐடி ஓச்டிங் சேவைகளில் பதிவேற்றுவதாகும்.

source: Publishing your documentation sources
ta: உங்கள் ஆவண ஆதாரங்களை வெளியிடுகிறது

source: GitHub
ta: கிதப்

source: The quickest way to upload an existing project to GitHub is to:
ta: ஏற்கனவே உள்ள திட்டத்தை கிதுபில் பதிவேற்றுவதற்கான விரைவான வழி:

source: `Sign up for a GitHub account <https://github.com/signup>`_.
ta: `ஒரு அறிவிலிமையம் கணக்கிற்கு பதிவுபெறுக <https://github.com/signup>` _.

source: `Create a new repository <https://github.com/new>`_.
ta: `ஒரு புதிய களஞ்சியத்தை உருவாக்கவும் <https://github.com/new>` _.

source: Open `the "Upload files" page`_ of your new repository.
ta: உங்கள் புதிய களஞ்சியத்தின் "கோப்புகளை பதிவேற்ற" பக்கம்`_ ஐத் திறக்கவும்.

source: Select the files on your operating system file browser (in your case ``README.rst``, ``lumache.py``, the makefiles under the ``docs`` directory, and everything under ``docs/source``) and drag them to the GitHub interface to upload them all.
ta: உங்கள் இயக்க முறைமை கோப்பு உலாவியில் உள்ள கோப்புகளைத் தேர்ந்தெடுக்கவும் (உங்கள் விசயத்தில் `` readme.rst``, `` lumache.py``, `` டாக்ச்`` கோப்பகத்தின் கீழ் உள்ள மேக்ஃபைல்கள் மற்றும் `` டாக்ச்/மூல` கீழ் உள்ள அனைத்தும் ) மற்றும் அவை அனைத்தையும் பதிவேற்ற அறிவிலிமையம் இடைமுகத்திற்கு இழுக்கவும்.
