Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/sphinx-doc_usage--extensions--extlinks_*.po
Languages: ta

source: This extension is meant to help with the common pattern of having many external links that point to URLs on one and the same site, e.g. links to bug trackers, version control web interfaces, or simply subpages in other websites. It does so by providing aliases to base URLs, so that you only need to give the subpage name when creating a link.
ta: இந்த நீட்டிப்பு என்பது ஒரே தளத்தில் URL களை சுட்டிக்காட்டும் பல வெளிப்புற இணைப்புகளைக் கொண்ட பொதுவான வடிவத்திற்கு உதவுவதாகும், எ.கா. பிழை கண்காணிப்பாளர்களுக்கான இணைப்புகள், பதிப்பு வலை இடைமுகங்களைக் கட்டுப்படுத்துதல் அல்லது பிற வலைத்தளங்களில் வெறுமனே துணைப்பிரிவுகள். அடிப்படை URL களுக்கு மாற்றுப்பெயர்களை வழங்குவதன் மூலம் அது அவ்வாறு செய்கிறது, இதன்மூலம் ஒரு இணைப்பை உருவாக்கும் போது மட்டுமே நீங்கள் துணைப் பெயரை வழங்க வேண்டும்.

source: Let's assume that you want to include many links to issues at the Sphinx tracker, at :samp:`https://github.com/sphinx-doc/sphinx/issues/{num}`. Typing this URL again and again is tedious, so you can use :mod:`~sphinx.ext.extlinks` to avoid repeating yourself.
ta: ச்பின்க்ச் டிராக்கரில் சிக்கல்களுக்கான பல இணைப்புகளை நீங்கள் சேர்க்க விரும்புகிறீர்கள் என்று வைத்துக் கொள்வோம், இங்கே: SAMP: `https: //github.com/sphinx-doc/sphinx/issues/ {num}`. இந்த URL ஐ மீண்டும் மீண்டும் தட்டச்சு செய்வது கடினமானது, எனவே நீங்கள் பயன்படுத்தலாம்: மோட்: `~ sphinx.ext.extlinks` உங்களை மீண்டும் மீண்டும் செய்வதைத் தவிர்க்க.

source: :mod:`sphinx.ext.extlinks` -- Markup to shorten external links
ta: : மோட்: `sphinx.ext.extlinks` - வெளிப்புற இணைப்புகளை குறைக்க மார்க்அப்

source: The extension adds a config value:
ta: நீட்டிப்பு ஒரு கட்டமைப்பு மதிப்பைச் சேர்க்கிறது:

source: This config value must be a dictionary of external sites, mapping unique short alias names to a *base URL* and a *caption*. For example, to create an alias for the above mentioned issues, you would add ::
ta: இந்த கட்டமைப்பு மதிப்பு வெளிப்புற தளங்களின் அகராதியாக இருக்க வேண்டும், தனித்துவமான குறுகிய மாற்றுப்பெயர் பெயர்களை ஒரு *அடிப்படை URL *மற்றும் A *தலைப்பு *க்கு மேப்பிங் செய்ய வேண்டும். எடுத்துக்காட்டாக, மேலே குறிப்பிட்டுள்ள சிக்கல்களுக்கு ஒரு மாற்றுப்பெயரை உருவாக்க, நீங்கள் சேர்ப்பீர்கள் ::

source: Now, you can use the alias name as a new role, e.g. ``:issue:`123```. This then inserts a link to https://github.com/sphinx-doc/sphinx/issues/123. As you can see, the target given in the role is substituted in the *base URL* in the place of ``%s``.
ta: இப்போது, நீங்கள் மாற்றுப்பெயரை ஒரு புதிய பாத்திரமாகப் பயன்படுத்தலாம், எ.கா. ``: வெளியீடு: `123```. இது https://github.com/sphinx-doc/sphinx/issues/123 க்கு ஒரு இணைப்பைச் செருகும். நீங்கள் பார்க்க முடியும் என, பாத்திரத்தில் கொடுக்கப்பட்ட இலக்கு ``%s`` இடத்தில் * அடிப்படை URL * இல் மாற்றப்படுகிறது.

source: The link caption depends on the second item in the tuple, the *caption*:
ta: இணைப்பு தலைப்பு டூப்பிள், *தலைப்பு *இல் உள்ள இரண்டாவது உருப்படியைப் பொறுத்தது:

source: If *caption* is ``None``, the link caption is the full URL.
ta: * தலைப்பு * `` எதுவுமில்லை`` என்றால், இணைப்பு தலைப்பு முழு URL ஆகும்.

source: If *caption* is a string, then it must contain ``%s`` exactly once. In this case the link caption is *caption* with the partial URL substituted for ``%s`` -- in the above example, the link caption would be ``issue 123``.
ta: * தலைப்பு * ஒரு சரம் என்றால், அதில் ஒரு முறை ``%s`` இருக்க வேண்டும். இந்த வழக்கில் இணைப்பு தலைப்பு * தலைப்பு * என்பது ``%s`` க்கு மாற்றாக இருக்கும் பகுதி URL உடன் - மேலே உள்ள எடுத்துக்காட்டில், இணைப்பு தலைப்பு `` வெளியீடு 123`` ஆக இருக்கும்.

source: To produce a literal ``%`` in either *base URL* or *caption*, use ``%%``::
ta: *அடிப்படை URL *அல்லது *தலைப்பில் *ஒரு நேரடி ``%`` ஐ உருவாக்க, `` %% `` ::

source: You can also use the usual "explicit title" syntax supported by other roles that generate links, i.e. ``:issue:`this issue <123>```. In this case, the *caption* is not relevant.
ta: இணைப்புகளை உருவாக்கும் பிற பாத்திரங்களால் ஆதரிக்கப்படும் வழக்கமான "வெளிப்படையான தலைப்பு" தொடரியல், அதாவது ``: வெளியீடு: `இந்த சிக்கல் <123>` `` ஆகியவற்றைப் பயன்படுத்தலாம். இந்த வழக்கில், * தலைப்பு * பொருந்தாது.

source: Support to substitute by '%s' in the caption.
ta: தலைப்பில் '%s' ஆல் மாற்றுவதற்கான ஆதரவு.

source: Since links are generated from the role in the reading stage, they appear as ordinary links to e.g. the ``linkcheck`` builder.
ta: வாசிப்பு கட்டத்தில் பங்கிலிருந்து இணைப்புகள் உருவாக்கப்படுவதால், அவை எ.கா. `` லிங்க் செக்`` பில்டர்.

source: If enabled, extlinks emits a warning if a hardcoded link is replaceable by an extlink, and suggests a replacement via warning. It defaults to ``False``.
ta: இயக்கப்பட்டால், ஆர்ட்கோட் செய்யப்பட்ட இணைப்பு ஒரு எக்ச்ட்லிங்க் மூலம் மாற்றப்பட்டால், எச்சரிக்கை வழியாக மாற்றுவதை பரிந்துரைக்கிறது. இது இயல்புநிலையாக `` FALSE``.
