Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/yeswiki-yeswiki-core-actionsbuilder-*.po
Languages: ta

# return[]->'AB_bazartableau_columnswidth_label'
source: Largeur personnalisée des colonnes
ta: பெரிய ஆளுமை டெச் கோர்ன்ச்

# return[]->'AB_bazartableau_columnswidth_hint'
source: ex. : 100px ou 20% ; vide = largeur automatique
ta: முன்னாள். : 100px ou 20%; vide = பெரிய ஆட்டோமாட்டிக்

# return[]->'AB_bazartableau_columnswidth_field_label'
source: Champ
ta: வீரர்

# return[]->'AB_bazartableau_columnswidth_width_label'
source: Largeur
ta: பெரியவர்

# return[]->'AB_bazartableau_exportallcolumns_label'
source: Exporter aussi les colonnes masquées
ta: ஏற்றுமதியாளர் ஆசி லெச் கோர்ன்ச் மாச்கச்

# return[]->'AB_bazartableau_displayimagesasthumbnails_label'
source: Afficher les images sous forme de vignette
ta: Afficher les படங்கள் sous forme de vignette
