Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/yeswiki-yeswiki-core-actionsbuilder-*.po
Languages: ta

# return[]->'AB_attach_desc_label'
source: Description
ta: விவரம்

# return[]->'AB_attach_video_label'
source: Vidéo intégrée
ta: விடோ இன்டெக்ரே

# return[]->'AB_attach_video_description'
source: Intégration d'une vidéo youtube, vimeo ou peertube.
ta: இன்டெக்ரேசன் டி யூன் விடோ யூடியூப், விமியோ ஓ பியர்டியூப்.

# return[]->'AB_attach_video_hint'
source: L'identifiant de la vidéo correspond aux chiffres ou lettres à la fin de son URL
ta: L'difiandifient de la vidéo cerse oness aux chiffres ou lettres à la இறகு de son முகவரி

# return[]->'AB_attach_video_url_hint'
source: Remplace serveur et id
ta: Remplace servur et ஐடி

# return[]->'AB_attach_video_serveur_label'
source: Serveur de la video
ta: சர்வர் டி லா வீடியோ

# return[]->'AB_attach_video_id_label'
source: Identifiant de la vidéo
ta: அடையாளம் காணும் டி லா விடோ

# return[]->'AB_attach_video_peertubeinstance_label'
source: Instance du serveur PeerTube
ta: நிகழ்வு டு சர்வர் பியர்டியூப்

# return[]->'AB_attach_video_ratio_label'
source: Ratio de la vidéo
ta: விகிதம் டி லா விடோ

# return[]->'AB_attach_video_position_label'
source: Position de la vidéo
ta: நிலை டி லா விடோ

# return[]->'AB_attach_video_largeur_max_label'
source: Largeur maximale
ta: பெரிய மாக்சிமேல்

# return[]->'AB_attach_video_hauteur_max_label'
source: Hauteur maximale
ta: ஆட்டூர் மாக்சிமேல்

# return[]->'AB_attach_pdf_label'
source: Fichier pdf intégré
ta: Fichier pdf integre

# return[]->'AB_attach_pdf_description'
source: Intégration d'un fichier pdf de ce site.
ta: இன்டெக்ரேசன் டி அன் ஃபைச்சியர் பி.டி.எஃப் டி சிஇ தளம்.

# return[]->'AB_attach_pdf_hint'
source: Pour afficher votre PDF, d'abord le charger dans une page de ce wiki et en copier le lien ici.
ta: அஃபிச்சர் வோட்ரே பி.டி.எஃப், டி.

# return[]->'AB_attach_pdf_url_label'
source: URL du fichier
ta: முகவரி DU FICHIER

# return[]->'AB_attach_pdf_ratio_label'
source: Ratio pour l'affichage
ta: விகிதம் ஊற்றவும்

# return[]->'AB_attach_pdf_ratio_option_portrait'
source: portrait
ta: உருவப்படம்

# return[]->'AB_attach_pdf_ratio_option_paysage'
source: paysage
ta: payage

# return[]->'AB_attach_pdf_position_label'
source: Position du pdf
ta: நிலை DU PDF

# return[]->'AB_attach_pdf_largeur_max_label'
source: Largeur maximale
ta: பெரிய மாக்சிமேல்

# return[]->'AB_attach_pdf_hauteur_max_label'
source: Hauteur maximale
ta: ஆட்டூர் மாக்சிமேல்

# return[]->'AB_management_label'
source: Gestion du YesWiki
ta: கெச்டியன் டு யெச்விகி

# return[]->'AB_management_editactionsacls_label'
source: Éditer les droits d'accès aux actions
ta: எடிட்டர் லெச் ட்ரோய்ட்ச் டி அக்யச் ஆக்ச் செயல்கள்

# return[]->'AB_management_edithandlersacls_label'
source: Éditer les droits d'accès aux handlers
ta: எடிட்டர் லெச் ட்ரோய்ட்ச் டி அக்ச் ஆக்ச் ஏண்ட்லர்கள்

# return[]->'AB_management_editgroups_label'
source: Éditer les groupes d'utilisateurs
ta: எடிட்டர் லெச் குழுக்கள் டி'அபிலிசேட்டர்கள்

# return[]->'AB_management_adminpages_label'
source: Gestion des pages
ta: கெச்டியன் டெச் பக்கங்கள்

# return[]->'AB_management_gererdroits_label'
source: Gérer les droits d'accés aux pages
ta: Gérer les droits d'caes aux பக்கங்கள்

# return[]->'AB_management_gererthemes_label'
source: Gérer le thème des pages
ta: செரர் லு தெம் டெச் பக்கங்கள்

# return[]->'AB_management_setwikidefaulttheme_label'
source: Définir le thème de base
ta: டெஃபினிர் லு தெம் டி பேச்

# return[]->'AB_management_userstable_label'
source: Table des utilisateurs
ta: அட்டவணை டெச் பயன்பாட்டாளர்கள்

# return[]->'AB_management_filemanager_label'
source: Gestion des fichiers
ta: கெச்டியன் டெச் பிச்சியர்ச்

# return[]->'AB_management_themeselector_label'
source: Tester les thèmes disponibles
ta: சோதனையாளர் லெச் தெம்ச்கள்

# return[]->'AB_management_despam_label'
source: Nettoyer les pages récemment vandalisées
ta: நெட்டோயர் லெச் பக்கங்கள் reécemment vandalisees

# return[]->'AB_management_despam_hint'
source: Liste les dernières versions des pages récemment créées pour pouvoir choisir celles à supprimer
ta: Liste les dernieres பதிப்புகள் டெச் பக்கங்கள் récemment créees pour pouvoir soisir cells à supprimer

# return[]->'AB_management_editconfig_label'
source: Modifier des paramètres du fichier de configuration
ta: மாற்றியமைக்கும் டெச் பரமரேட்ச் டு ஃபைச்சியர் டி உள்ளமைவு

# return[]->'AB_management_adminbackups_label'
source: Gestion des sauvegardes
ta: கெச்டியன் டெச் சாவெகார்ட்ச்

# return[]->'AB_management_commentstable_label'
source: Table des commentaires
ta: டேபிள் டெச் கருத்துரு

# return[]->'AB_management_usercomments_label'
source: Mes commentaires
ta: Mes commpressaires

# return[]->'AB_advanced_actions_label'
source: Actions avancées
ta: செயல்கள் அவான்சச்

# return[]->'AB_advanced_action_backlinks_label'
source: Afficher les pages qui ont un lien vers la page courante
ta: Afficher les பக்கங்கள் QUI ONT UN LIEN VERS LA PAGE CORANTE

# return[]->'AB_advanced_action_backlinks_page_label'
source: Page de base
ta: பக்கம் டி அடிப்படை

# return[]->'AB_advanced_action_backlinks_page_hint'
source: Vide = page courante
ta: Vide = பக்க கூரண்டே

# return[]->'AB_advanced_action_wantedpages_label'
source: Lister les pages à créer
ta: லிச்டர் லெச் பக்கங்கள் à க்ரீயர்

# return[]->'AB_advanced_action_include_label'
source: Inclure une page dans une autre
ta: Indure une page dans une autre

# return[]->'AB_advanced_action_redirect_label'
source: Rédiriger vers une autre page du Wiki
ta: Rédiriger vers ine autre page du wiki

# return[]->'AB_advanced_action_listpages_label'
source: Afficher les pages sous forme de liste
ta: Afficher les பக்கங்கள் sous forme de liste

# return[]->'AB_advanced_action_listpages_sort_label'
source: Tri
ta: ட்ரை

# return[]->'AB_advanced_action_listpages_tree_label'
source: Afficher sous forme de graph/plan
ta: Afficher sous forme de வரைபடம்/திட்டம்

# return[]->'AB_advanced_action_listpages_tree_hint'
source: tag de la page de base; tree = root_page
ta: டேக் டி லா பேச் டி பேச்; மரம் = ரூட்_பேச்

# return[]->'AB_advanced_action_listpages_levels_label'
source: Nombre de niveaux
ta: நோம்ப்ரே டி நிவோக்ச்

# return[]->'AB_advanced_action_listpages_levels_hint'
source: (entre 1 et 7, 3 par défaut)
ta: (என்ட்ரே 1 மற்றும் 7, 3 பார் டெஃபாட்)

# return[]->'AB_advanced_action_listpages_owner_label'
source: N'afficher que les fiches dont l'utilisateur est le propriétaire
ta: N'afficher que les fiches dont l'பயன்பாடு

# return[]->'AB_advanced_action_listpages_owner_hint'
source: Principalement défini pour le mode tree
ta: முதன்மை டெஃபினி லு பயன்முறை மரத்தை ஊற்றவும்

# return[]->'AB_advanced_action_listpages_user_label'
source: N'afficher que les fiches dans lesquelles l'utilisateur a participé
ta: N'afficher que les fiches dans lesquelles l'utilisateur a பங்கேற்பு

# return[]->'AB_advanced_action_listpages_user_hint'
source: Ne peut être combiné avec tree
ta: Ne peut être comminé avec மரம்

# return[]->'AB_advanced_action_listpages_exclude_label'
source: Exclure des pages et leurs descendantes
ta: டெச் பக்கங்கள் மற்றும் லியர்ச் வம்சாவளியை விலக்கு

# return[]->'AB_advanced_action_listpages_exclude_hint'
source: Séparer chaque tag par ';' ',' '
ta: செபரர் சாக் டேக் பார் ';' ',' '

# return[]->'AB_advanced_action_bazarrecordsindex_label'
source: Lister seulement les fiches bazar
ta: லிச்டர் சியுலேமென்ட் லெச் ஃபிடச் கடைவீதி

# return[]->'AB_advanced_action_listusers_label'
source: Lister les utilisateurs, utilisatrices
ta: லிச்டர் லெச் பயன்பாட்டாளர்கள், பயன்பாட்டு செயல்கள்

# return[]->'AB_advanced_action_listusers_last_label'
source: Lister uniquement les derniers comptes créés
ta: லிச்டர் தனித்துவம் லெச் டெர்னியர்ச் காம்ப்டெச் க்ரீச்

# return[]->'AB_advanced_action_listusers_last_hint'
source: Nombre de comptes à afficher
ta: நோம்ப்ரே டி காம்ப்டெச் à அஃப்சர்

# return[]->'AB_advanced_action_mychanges_label'
source: Afficher mes changements
ta: Afficher mes மாற்றங்கள்

# return[]->'AB_advanced_action_mychanges_bydate_label'
source: Trier par date
ta: ட்ரையர் சம தேதி

# return[]->'AB_advanced_action_mypages_label'
source: Afficher mes pages
ta: Afficher Mes பக்கங்கள்

# return[]->'AB_advanced_action_textsearch_label'
source: Recherche de texte
ta: ரீச்செச் டி டெக்ச்டே

# return[]->'AB_advanced_action_newtextsearch_label'
source: Recherche de texte
ta: ரீச்செச் டி டெக்ச்டே

# return[]->'AB_advanced_action_textsearch_label_label'
source: label à afficher devant la zone de saisie
ta: சிட்டை à அஃப்சர் தேவந்த் லா மண்டல டி சைசி

# return[]->'AB_advanced_action_textsearch_size_label'
source: largeur de la zone de saisie
ta: லார்ச் டி லா சோன் டி சைசி

# return[]->'AB_advanced_action_textsearch_button_label'
source: texte du bouton
ta: டெக்ச்டே டு பூட்டன்

# return[]->'AB_advanced_action_textsearch_phrase_label'
source: texte à chercher
ta: டெக்ச்டே à செச்சர்

# return[]->'AB_advanced_action_textsearch_separator_label'
source: séparateur entre les éléments trouvés
ta: séparateur entre les éléments trouves

# return[]->'AB_advanced_action_orphanedpages_label'
source: Lister les pages orphelines
ta: லிச்டர் லெச் பக்கங்கள் ஆர்ப்லைன்ச்

# return[]->'AB_advanced_action_pageindex_label'
source: Lister toutes les pages
ta: லிச்டர் டூட்ச் லெச் பக்கங்கள்

# return[]->'AB_advanced_action_pageonlyindex_label'
source: Lister toutes les pages sauf les fiches bazar
ta: லிச்டர் டூட்ச் லெச் பக்கங்கள் SAUF LES FICHES BAZAR

# return[]->'AB_advanced_action_progressbar_label'
source: Afficher une barre de progression
ta: Afficher une parre de முன்னேற்றம்

# return[]->'AB_advanced_action_progressbar_val_label'
source: Valeur
ta: Foruer

# return[]->'AB_advanced_action_progressbar_val_hint'
source: (entre 0 et 100)
ta: (என்ட்ரே 0 மற்றும் 100)

# return[]->'AB_advanced_action_tocjs_label'
source: Créer un sommaire de la page
ta: க்ரீயர் அன் சோமெய்ர் டி லா பேச்

# return[]->'AB_advanced_action_tocjs_position_label'
source: Position
ta: நிலை

# return[]->'AB_advanced_action_tocjs_position_right_option'
source: Droite
ta: டிராயிட்

# return[]->'AB_advanced_action_tocjs_position_left_option'
source: Gauche
ta: க uch ச்சே

# return[]->'AB_advanced_action_tocjs_size_label'
source: Largeur
ta: பெரியவர்

# return[]->'AB_advanced_action_trail_label'
source: Afficher des liens "Page Suivante" "Sommaire" "Page Precedente" dans une page
ta: Afficher des liens "Page suivante" "SOMMAIRE" "PAGE MEXEDENTE" டான்ச் UNE பக்கம்

# return[]->'AB_advanced_action_trail_toc_label'
source: Page sommaire
ta: பக்கம் சோமெய்ர்

# return[]->'AB_advanced_action_recentchanges_label'
source: Liste les derniers changements
ta: லெச்டே LES DERNIERS மாற்றங்கள்

# return[]->'AB_advanced_action_recentchanges_max_label'
source: Nombre maximum de changements à afficher
ta: நோம்ப்ரே அதிகபட்ச டி மாற்றங்கள் à அஃப்சர்

# return[]->'AB_advanced_action_recentchanges_period_label'
source: Date à partir de laquelle les changements sont affichés
ta: தேதி à பார்ட்டிர் டி லாக்வெல் லெச் மாற்றங்கள் சோன்ட் அஃபிசச்

# return[]->'AB_advanced_action_recentchanges_period_hint'
source: Format : 2000-01-01 00:00:00
ta: வடிவம்: 2000-01-01 00:00:00

# return[]->'AB_advanced_action_recentcomments_label'
source: Liste les derniers commentaires
ta: லிச்டே லெச் டெர்னியர்ச் கருத்துரை

# return[]->'AB_advanced_action_recentcomments_max_label'
source: Nombre maximum de commentaires à afficher
ta: நோம்ப்ரே அதிகபட்ச டி கருத்துரை à அஃப்சர்

# return[]->'AB_advanced_action_configuration_label'
source: Afficher le contenu du fichier de configuration
ta: Afficher le contenu du fichier de உள்ளமைவு

# return[]->'AB_advanced_action_login_label'
source: Connexion
ta: இணைப்பு

# return[]->'AB_advanced_action_login_signupurl_label'
source: Url d'inscription
ta: முகவரி D'கல்வெட்டு

# return[]->'AB_advanced_action_login_signupurl_hint'
source: Page du wiki ou url ou '0' pour masquer le bouton d'inscription
ta: பக்கம் டு விக்கி ஓ உர் '0' ஊற்றப்பட்ட முகமூடி லு பூட்டன் டி கல்வெட்டு

# return[]->'AB_advanced_action_login_profileurl_label'
source: Url du profil
ta: முகவரி DU PROFIL

# return[]->'AB_advanced_action_login_profileurl_hint'
source: Page du wiki ou url ou 'WikiName' pour le lien d'édition vers la page de l'utilisateur
ta: பேச் டு விக்கி ஓ உர் ஓஅ் ஓ 'விக்கினேம்' போர் லீன் டி'அடிசன் வெர்சச் லா பேச் டி எல் யூடிலிசேட்டர்

# return[]->'AB_advanced_action_login_incomingurl_label'
source: Url de retour après connexion (réussie ou non)
ta: முகவரி de reture aprers connexion (réussie ou non non)

# return[]->'AB_advanced_action_login_userpage_label'
source: Se rendre sur la page de l'utilisateur une fois connecté
ta: Se rendre சுர் la page de l'utilisateur une fois connecté

# return[]->'AB_advanced_action_login_lostpasswordurl_label'
source: Url pour les mots de passe perdus
ta: முகவரி ஊற்ற லெச் மோட்ச் டி பாச் பெர்டச்

# return[]->'AB_advanced_action_login_lostpasswordurl_hint'
source: Page du wiki ou url
ta: பக்கம் du wiki ou முகவரி

# return[]->'AB_advanced_action_login_class_label'
source: Classe CSS pour le bloc
ta: கிளாச் சிஎச்எச் லு பிளாக் ஊற்றவும்

# return[]->'AB_advanced_action_login_btnclass_label'
source: Classe CSS pour les boutons
ta: கிளாச் சிஎச்எச் லெச் பூட்டன்களை ஊற்றுகிறது

# return[]->'AB_advanced_action_login_nobtn_label'
source: Remplacer le bouton par un lien (modal uniquement)
ta: ரெம்லேசர் லு பூட்டன் பார் அன் லீன் (மாதிரி தனித்துவம்)

# return[]->'AB_advanced_action_login_template_label'
source: Template
ta: வார்ப்புரு

# return[]->'AB_advanced_action_login_template_default'
source: Standard
ta: தரநிலை

# return[]->'AB_advanced_action_login_template_modal'
source: Modal
ta: மோடல்

# return[]->'AB_advanced_action_login_template_horizontal'
source: Horizontal
ta: கிடைமட்டமாக

# return[]->'AB_advanced_action_login_template_dropdown'
source: Menu déroulant
ta: பட்டியல் டெரூலண்ட்

# return[]->'AB_advanced_action_login_loggedinurl_label'
source: Url de redirection après connexion réussie
ta: முகவரி DE REAIRECTION APRES CONNEXION Réussie

# return[]->'AB_advanced_action_login_loggedinurl_hint'
source: Page du wiki ou url (utilise 'incomingurl' si vide ou en cas d'erreur)
ta: Page du wiki ou முகவரி ('UNCOMIMENURL' si vide o ou என் cas d'erreur ஐப் பயன்படுத்தவும்)

# return[]->'AB_advanced_action_login_loggedouturl_label'
source: Url de redirection après déconnexion
ta: முகவரி DE REAIRECTION APRES Déconnexion

# return[]->'AB_advanced_action_login_loggedouturl_hint'
source: Page du wiki ou url (utilise 'incomingurl' si vide)
ta: Page du wiki ou முகவரி ('UNCOMIMENURL' si vide ஐப் பயன்படுத்துங்கள்)

# return[]->'AB_template_col_size_hint'
source: Attention, la somme des largeurs de toutes les colonnes ne devra pas excéder 12 !
ta: கவனம், லா சோம் டெச் லாங்கர்ச் டி டூட்ச் லெச் கோர்ன்ச் நேவ் டெவ்ரா பாச் எக்செரேடர் 12!

# return[]->'AB_buttons_label'
source: Boutons
ta: பூட்டன்கள்

# return[]->'AB_buttons_action_button_label'
source: Bouton
ta: பூட்டன்

# return[]->'AB_buttons_action_button_description'
source: Créer un bouton cliquable
ta: க்ரீயர் அன் பூட்டன் கிளிக்கபிள்

# return[]->'AB_buttons_action_button_text_label'
source: Texte du bouton
ta: டெக்ச்டே டு பூட்டன்

# return[]->'AB_buttons_action_button_text_default'
source: Mon bouton
ta: மோன் பூட்டன்

# return[]->'AB_buttons_action_button_link_label'
source: Lien web ou nom d'une page de ce wiki
ta: Lien விரலிடைத் தோல் ou nom d'ne page de ce wiki

# return[]->'AB_buttons_action_button_title_label'
source: Texte affiché au survol
ta: டெக்ச்டே அஃபிச் ஆ சர்வர்

# return[]->'AB_buttons_action_button_icon_label'
source: Icone
ta: ஐகோன்

# return[]->'AB_buttons_action_button_class_label'
source: Classe
ta: கிளாச்

# return[]->'AB_buttons_action_button_color_label'
source: Couleur
ta: கூலூர்

# return[]->'AB_buttons_action_button_color_default'
source: Défaut
ta: Defaut

# return[]->'AB_buttons_action_button_color_primary'
source: Primaire
ta: முதன்மை

# return[]->'AB_buttons_action_button_color_secondary1'
source: Secondaire-1
ta: செகண்டேர் -1

# return[]->'AB_buttons_action_button_color_secondary2'
source: Secondaire-2
ta: செகண்டேர் -2

# return[]->'AB_buttons_action_button_color_success'
source: Succès
ta: சக்ச்

# return[]->'AB_buttons_action_button_color_info'
source: Info
ta: தகவல்

# return[]->'AB_buttons_action_button_color_warning'
source: Attention
ta: கவனம்

# return[]->'AB_buttons_action_button_color_danger'
source: Danger
ta: இடர்

# return[]->'AB_buttons_action_button_color_link'
source: Lien
ta: உரிமை

# return[]->'AB_buttons_action_button_size_label'
source: Taille
ta: டெயில்

# return[]->'AB_buttons_action_button_size_standard'
source: Normal
ta: சாதாரண

# return[]->'AB_buttons_action_button_size_small'
source: Petit
ta: பெட்டிட்

# return[]->'AB_buttons_action_button_size_medium'
source: Moyen
ta: மோயன்

# return[]->'AB_buttons_action_button_size_big'
source: Grand
ta: மாபெரும்

# return[]->'AB_buttons_action_button_modal_label'
source: Ouvrir le contenu du lien dans une popup
ta: ஓவ்ரிர் லு கான்டெனு டு லீன் டான்ச் யூன் பாப்அப்

# return[]->'AB_buttons_action_button_modal_modalbox'
source: Lors du clic
ta: லோர்ச் டு சொடுக்கு

# return[]->'AB_buttons_action_button_modal_modalbox_hover'
source: Au survol
ta: அயு சர்வோல்

# return[]->'AB_buttons_action_button_pull_label'
source: Position
ta: நிலை

# return[]->'AB_buttons_action_button_pull_right'
source: Droite
ta: டிராயிட்

# return[]->'AB_buttons_action_button_pull_block'
source: Toute la largeur
ta: Toute la largur

# return[]->'AB_buttons_action_button_new_window_label'
source: Ouvrir dans une nouvelle fenètre
ta: Ouvrir dans une nouvelle fenétre

# return[]->'AB_buttons_action_button_hideifnoaccess_label'
source: Masquer si l'utilisateur n'a pas accès à la page liée
ta: முகமூடி si l'utilisateur n'a pas acces à la page leiee

# return[]->'AB_REACTION_GROUP_LABEL'
source: Réactions / Votes
ta: Reactions / வாக்குகள்

# return[]->'AB_REACTION_TITLE_LABEL'
source: Titre du vote
ta: டைட்ரே டு வாக்கு

# return[]->'AB_REACTION_LABEL'
source: Réactions et votes
ta: Reactions et வாக்குகள்

# return[]->'AB_REACTION_DESC'
source: Permet aux utilisateur·ices connecté·es de réagir et voter
ta: பெர்மெட் ஆக்ச் பயன்பாட்டு

# return[]->'AB_REACTION_MAXREACTION_LABEL'
source: Nombre de réactions/votes possibles
ta: நோம்ப்ரே டி ரெக்டன்ச்/வாக்குகள் சாத்தியமாகும்

# return[]->'AB_REACTION_ADD_REACTION'
source: Ajouter une réaction
ta: அசூட்டர் யு.என்.இ ரியாகேசன்

# return[]->'AB_REACTION_ICON'
source: Icône
ta: படவுரு

# return[]->'AB_USERREACTIONS_LABEL'
source: Réactions de l'utilisateur·ice connecté·e
ta: Réactions de l'utilisateur · ICE Connecté · இ

# return[]->'AB_USERREACTIONS_HINT'
source: Permet aux utilisateur·ices connecté·es de voir leurs réactions
ta: பெர்மெட் ஆக்ச் பயன்பாட்டு

# return[]->'AB_ADMINREACTIONS_LABEL'
source: Administration des réactions
ta: நிர்வாகம் டெச் ரெக்டன்ச்

# return[]->'AB_ADMINREACTIONS_HINT'
source: Permet aux administrateur·ices de gérer les réactions
ta: பெர்மெட் ஆக்ச் அட்மினிச்ட்ரேட்டர் · ஐச் டி கெரர் லெச் ரெக்டியன்ச்

# return[]->'AB_MYFAVORITES_LABEL'
source: Mes favoris
ta: Mes abous

# return[]->'AB_MYFAVORITES_TEMPLATE_LABEL'
source: Template
ta: வார்ப்புரு

# return[]->'AB_MYFAVORITES_TEMPLATE_LINKS'
source: Liens
ta: உரிமையாளர்கள்

# return[]->'AB_MYFAVORITES_TEMPLATE_LINKS_WITH_TITLES'
source: Liens avec titres
ta: லீன்ச் அவெக் டைட்ரெச்

# return[]->'AB_MYFAVORITES_TEMPLATE_TILES'
source: Vignettes
ta: விக்னெட்டுகள்

# return[]->'AB_MYFAVORITES_TEMPLATE_TABLE'
source: Tableau
ta: அட்டவணை

# return[]->'AB_syndication_main_label'
source: Syndication / Flux RSS
ta: சிண்டிகேசன் / ஃப்ளக்ச் ஆர்.எச்.எச்

# return[]->'AB_syndication_action_label'
source: Syndication
ta: சிண்டிகேசன்

# return[]->'AB_syndication_action_description'
source: Syndiquer le flux RSS d'un site tiers
ta: சிண்டிகர் லு ஃப்ளக்ச் ஆர்எச்எச் டி அன் தள அடுக்குகள்

# return[]->'AB_syndication_action_url_label'
source: Adresse du flux RSS
ta: அட்ரெச் டு ஃப்ளக்ச் ஆர்.எச்.எச்

# return[]->'AB_syndication_action_url_hint'
source: Vous pouvez ajouter plusieurs flux séparés d'une virgule
ta: Vous pouvez ajouter plusierures இளக்கி sépares d'Une விர்சூல்

# return[]->'AB_syndication_action_title_label'
source: Titre
ta: டைட்ரே

# return[]->'AB_syndication_action_source_label'
source: Titre des flux
ta: டைட்ரே டெச் ஃப்ளக்ச்

# return[]->'AB_syndication_action_source_hint'
source: Titre du flux1, titre du flux2… indique en cas de sources multiples le titre du flux
ta: டைட்ரே டு ஃப்ளக்ச் 1, டைட்ரே டு ஃப்ளக்ச் 2… இண்டிக் என் காச் டி ஆதாரங்கள் மடங்குகள் லு டைட்ரே டு ஃப்ளக்ச்

# return[]->'AB_syndication_action_nb_label'
source: Nbre d'info à afficher
ta: நோம்ப்ரே டி செய்தி à அஃப்சர்

# return[]->'AB_syndication_action_template_label'
source: Template de visualisation
ta: வார்ப்புரு டி காட்சிப்படுத்தல்

# return[]->'AB_syndication_action_template_acordion'
source: Flux sous forme d'accordéons
ta: ஃப்ளக்ச் ச ous ச் ஃபார்ம் டி'லேடியோன்கள்

# return[]->'AB_syndication_action_template_list'
source: Flux sous forme de liste
ta: ஃப்ளக்ச் ச ous ச் ஃபார்ம் டி பட்டியல்

# return[]->'AB_syndication_action_template_list_and_description'
source: Flux sous forme de liste avec description
ta: ஃப்ளக்ச் ச ous ச் ஃபார்ம் டி பட்டியல் அவெக் விளக்கம்

# return[]->'AB_syndication_action_nouvellefenetre_label'
source: Les liens s'ouvrent dans un nouvel onglet
ta: லெச் லீன்ச் s'ouvrent dans un nouvel onglet

# return[]->'AB_syndication_action_formatdate_label'
source: Affiche les dates de publication
ta: Affiche les தேதிகள் டி வெளியீடு

# return[]->'AB_syndication_action_formatdate_option_jm'
source: Jour mois
ta: அருமை மோயிச்

# return[]->'AB_syndication_action_formatdate_option_jma'
source: Jour Mois année
ta: அருமை மோயிச் அன்னே

# return[]->'AB_syndication_action_formatdate_option_jmh'
source: Jour mois heure
ta: அருமை மோயிச் இயூர்

# return[]->'AB_syndication_action_formatdate_option_jmah'
source: Jour mois année heure
ta: அருமை மோயிச் அன்னே இயூர்

# return[]->'AB_bazartableau_label'
source: Tableau
ta: அட்டவணை

# return[]->'AB_bazartableau_columnfieldsids_label'
source: Champs à afficher
ta: சாம்ப்ச் afficher

# return[]->'AB_bazartableau_columnfieldsids_hint'
source: Vide = tous
ta: வீடியோ = பொம்மைகள்

# return[]->'AB_bazartableau_columntitles_label'
source: Titres des colonnes
ta: டைட்ரெச் டெச் கோர்ன்ச்

# return[]->'AB_bazartableau_columntitles_hint'
source: Séparés par des virgules - vide = nom du champ récupéré automatiquement
ta: Sépares par des rugules - vide = nom du samp reécupéré தானியங்கி

# return[]->'AB_bazartableau_checkboxfieldsincolumns_label'
source: Séparer les réponses des cases à cocher en plusieurs colonnes
ta: செபர் லெச் ரெபோன்ச் டெச் வழக்குகள் à கோச்சர் என் பிளச்யூர்ச் பெருங்குடல்

# return[]->'AB_bazartableau_displayvaluesinsteadofkeys_label'
source: Afficher les valeurs au lieu des clés
ta: Afficher les valeurs அயு leu des clés

# return[]->'AB_bazartableau_sumfieldsids_label'
source: Champs pour lesquels calculer la somme
ta: சாம்ப்ச் லெச்குவல்ச் கால்குலர் லா சோம்

# return[]->'AB_bazartableau_displayadmincol_label'
source: Afficher les boutons d'administration
ta: Afficher les boutons d'நிர்வாகம்

# return[]->'AB_bazartableau_displayadmincol_hint'
source: Modifier/supprimer
ta: மாற்றியமைப்பாளர்/சப்ம்பிரிமர்

# return[]->'AB_bazartableau_displayadmincol_onlyadmins'
source: Seulement pour les administrateurs
ta: சியுலேமென்ட் போர் லெச் நிர்வாகிகள்

# return[]->'AB_bazartableau_displaycreationdate_label'
source: Afficher la date de création
ta: Afficher la திகதி de creation

# return[]->'AB_bazartableau_displaylastchangedate_label'
source: Afficher la date de modification
ta: Afficher la திகதி de modification

# return[]->'AB_bazartableau_defaultcolumnwidth_label'
source: Largeur minimale des colonnes
ta: லார்ச் மினிமேல் டெச் கோர்ன்ச்

# return[]->'AB_bazartableau_defaultcolumnwidth_hint'
source: ex. : 100px ou 20% ; vide = largeur automatique (vide est plus joli en cas de personnalisation par champ)
ta: முன்னாள். : 100px ou 20%; vide = பெரிய ஆட்டோமேட்டிக் (vide est plus joli என் cas de andernalization par samp)
