Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/தானி/yeswiki-yeswiki-core-actionsbuilder-*.po
Languages: ta

# return[]->'AB_LEFT'
source: Gauche
ta: க uch ச்சே

# return[]->'AB_RIGHT'
source: Droite
ta: டிராயிட்

# return[]->'AB_advanced'
source: Avancé
ta: அவான்சே

# return[]->'AB_bazar_label'
source: Afficher les données d'un formulaire
ta: Afficher les données d'Un fumlaire

# return[]->'AB_bazar_commons_colorfield_label'
source: Champ pour la couleur
ta: சாம்ப் லா கூலூர்

# return[]->'AB_bazar_commons_colormapping_color_label'
source: Couleur
ta: கூலூர்

# return[]->'AB_bazar_commons_dynamic_label'
source: Rendu dynamique
ta: ரெண்டு மாறும்

# return[]->'AB_bazar_commons_iconfield_label'
source: Champ pour l'icone
ta: சாம்பியன் போர் எல் ஐகோன்

# return[]->'AB_bazar_commons_iconfield_icon_label'
source: Icone
ta: ஐகோன்

# return[]->'AB_bazar_commons_iconfield_iconprefix_label'
source: Prefixe pour les icones
ta: முன்னொட்டு லெச் ஐகோன்களை ஊற்றவும்

# return[]->'AB_bazar_commons_iconfield_iconprefix_hint'
source: Si vous utilisez le selecteur d'icone, vous n'avez pas besoin de ce champ
ta: Si vous utitilisez le selecter d'ycone, vous n'avez pas besoin de ce samp

# return[]->'AB_bazar_commons_pagination_label'
source: Nombre de fiches par page
ta: நோம்ப்ரே டி ஃபைச் பார் பக்கம்

# return[]->'AB_bazar_commons_pagination_hint'
source: Laisser vide pour ne pas utiliser la pagination
ta: லெய்சர் வைட் ஊற்றவும் NE PAS பயன்பாட்டு லா மண்பாண்டம்

# return[]->'AB_bazar_commons_search_fields_label'
source: Champs pour la recherche
ta: சாம்ப்ச் லா ரீச்செர்ச்சை ஊற்றவும்

# return[]->'AB_bazar_commons_search_label'
source: Barre de recherche
ta: பாரே டி ரெச்செர்ச்

# return[]->'AB_bazar_commons_search_label_dynamic'
source: Recherche dynamique
ta: Recherche Dimenic

# return[]->'AB_bazar_commons_subproperty_id_label'
source: Valeur
ta: Foruer

# return[]->'AB_bazar_commons_title'
source: Affichage
ta: அஃபிசேச்

# return[]->'AB_bazar_commons2_champ_label'
source: Champ pour le tri
ta: சாம்பியன் ட்ரை போர்

# return[]->'AB_bazar_commons2_champ_hint'
source: Il est possible d'effectuer des requètes avancées, pour en savoir plus
ta: Il est சாத்தியமான d'fectuer des requedes avancees, powr என் savoir plus

# return[]->'AB_bazar_commons2_filter_index'
source: 'bf_date_debut_evenement' doit être défini.
ta: 'bf_date_debut_evenment' doit être defini.

# return[]->'AB_bazar_commons2_filter_on_date'
source: Filtrer sur les dates
ta: ஃபில்டர் சுர் லெச் தேதிகள்

# return[]->'AB_bazar_commons2_filter_on_date_future'
source: futur
ta: எதிர்காலம்

# return[]->'AB_bazar_commons2_filter_on_date_past'
source: passé
ta: பாச்

# return[]->'AB_bazar_commons2_filter_on_date_on_current_month'
source: dans le mois qui arrive
ta: டான்ச் லு மோயிச் குய் வருகிறார்

# return[]->'AB_bazar_commons2_filter_on_date_one_week_more_and_less'
source: +/- une semaine
ta: +/- une செமெய்ன்

# return[]->'AB_bazar_commons2_filter_user_as_owner'
source: N'afficher que les fiches de l'utilisateur courant
ta: N'afficher que les fiches de l'utilisateur corant

# return[]->'AB_bazar_commons2_filtercolsize_label'
source: Largeur des facettes
ta: லார்ச் டெச் ஃபேச்பெட்டுகள்

# return[]->'AB_bazar_commons2_filterposition_label'
source: Position des facettes
ta: நிலை DES FACETS

# return[]->'AB_bazar_commons2_groupsexpanded_label'
source: Affichage initial des facettes
ta: Affichage ஆரம்ப DES FACETS

# return[]->'AB_bazar_commons2_groupsexpanded_false'
source: Uniquement la première dépliée
ta: தனித்துவமான லா பிரீமியர் டெப்லீ

# return[]->'AB_bazar_commons2_groupsexpanded_true'
source: Toutes Dépliées
ta: டூட்ச் டெப்ளியச்

# return[]->'AB_bazar_commons2_ordre_label'
source: Ordre de classement
ta: ஆர்டர் டி கிளாசென்ட்

# return[]->'AB_bazar_commons2_ordre_option_asc'
source: Croissant
ta: குரோசண்ட்

# return[]->'AB_bazar_commons2_nb_label'
source: Limitation
ta: வரம்பு

# return[]->'AB_bazar_commons2_query_label'
source: Requête (avancé)
ta: Requese (avance)

# return[]->'AB_bazar_commons2_filtersresultnb_label'
source: Afficher le nombre de fiches trouvées par les filtres
ta: Afficher le nombre de fiches troues par les filtres

# return[]->'AB_bazar_commons2_resetfiltersbutton_label'
source: Bouton pour réinitialiser les filtres
ta: பூட்டன் போர் ரைனிடியாலிசர் லெச் ஃபில்ட்ரெச்

# return[]->'AB_bazar_commons2_showexportbuttons'
source: Boutons d'export (CSV, JSON…)
ta: பூட்டன்ச் டி எக்ச்போர்ட் (சி.எச்.வி, சேசன்…)

# return[]->'AB_bazar_commons2_title'
source: Filtres / Facettes
ta: பில்ட்ரெச் / ஃபேசெட்டுகள்

# return[]->'AB_bazar_commons2_showmapinlistview_label'
source: Présenter une carte associée à chaque fiche
ta: ப்ரெசென்டர் யு.என்.இ கார்டே அசோசியே à சாக் ஃபிச்

# return[]->'AB_bazar_commons2_showmapinlistview_hint'
source: Uniquement pour les fiches qui ont été géolocalisées
ta: தனித்துவத்தை ஊற்றவும் லெச் ஃபிடச் குய் ஒன்ட் எட் சியோலோகலிசீச்

# return[]->'AB_bazar_facettes_btn-label-add'
source: Ajouter Une Facette
ta: அசூட்டர் யு.என்.இ ஃபேச்

# return[]->'AB_bazar_facettes_field_label'
source: Champ
ta: வீரர்

# return[]->'AB_bazar_facettes_title_label'
source: Titre
ta: டைட்ரே

# return[]->'AB_bazar_bf_date_debut_evenement_label'
source: Champ pour la date de début
ta: சாம்பியன் போர் லா தேதி டி டெபட்

# return[]->'AB_bazar_bf_date_fin_evenement_label'
source: Champ pour la date de fin
ta: சாம்பியன் போர் லா தேதி டி ஃபின்

# return[]->'AB_bazarcarto_label'
source: Cartographie
ta: கார்டோகிராஃபி

# return[]->'AB_bazarcarto_description'
source: Les fiches seront sous forme de marqueur.
ta: லெச் ஃபிடச் செரண்ட் ச ous ச் ஃபார்ம் டி மார்குவூர்.

# return[]->'AB_bazarcarto_hint'
source: Le champ géolocalisation doit être présent dans votre formulaire
ta: லு சேம்ப் சியோலோகலைசேசன் டொயிட் être présent dans wothre fumlaire

# return[]->'AB_bazarcarto_provider_label'
source: Fond de carte
ta: ஃபாண்ட் டி கார்டே

# return[]->'AB_bazarcarto_coordinates_label'
source: Vue initiale
ta: VUE ICTIALE

# return[]->'AB_bazarcarto_cluster_label'
source: Regroupe les points par zone (clusters)
ta: மறுஉருவாக்கம் லெச் புள்ளிகள் சம மண்டலம் (கொத்துகள்)

# return[]->'AB_bazarcarto_width_label'
source: Largeur de la carte
ta: லார்ச் டி லா கார்டே

# return[]->'AB_bazarcarto_height_label'
source: Hauteur de la carte
ta: ஆட்டூர் டி லா கார்டே

# return[]->'AB_bazarcarto_entrydisplay_label'
source: Lors du clic, afficher la fiche
ta: லோர்ச் டு சொடுக்கு, அஃபிச்சர் லா ஃபிச்

# return[]->'AB_bazarcarto_entrydisplay_option_direct'
source: Dans l'onglet courant
ta: டான்ச் எல்'ன்க்லெட் கூரண்ட்

# return[]->'AB_bazarcarto_entrydisplay_option_newtab'
source: Dans un nouvel onglet
ta: டான்ச் அன் நோவெல் ஓங்க்லெட்

# return[]->'AB_bazarcarto_entrydisplay_option_sidebar'
source: Dans une barre latérale
ta: டான்ச் யு.என்.இ பாரே லடரேல்

# return[]->'AB_bazarcarto_entrydisplay_option_modal'
source: Dans une popup
ta: டான்ச் யூன் பாப்அப்

# return[]->'AB_bazarcarto_entrydisplay_option_popup'
source: Dans une petite popup (sur la carte)
ta: டான்ச் யூன் பெட்டிட் பாப்அப் (சுர் லா கார்டே)

# return[]->'AB_bazarcarto_popuptemplate_label'
source: Template pour la petite popup
ta: வார்ப்புரு ஊற்ற லா பெட்டிட் பாப்அப்

# return[]->'AB_bazarcarto_popuptemplate_entry_from_html'
source: Rendu côté serveur
ta: ரெண்டு கோட்டே சர்வர்

# return[]->'AB_bazarcarto_popuptemplate_entry_from_data'
source: Rendu local
ta: உள்ளக ரெண்டு

# return[]->'AB_bazarcarto_popuptemplate_custom'
source: Template personnalisé
ta: வார்ப்புரு ஆளுமை

# return[]->'AB_bazarliste_popupselectedfields_label'
source: Champs à conserver dans la popup
ta: சாம்ப்ச் à கன்சர்வர் டான்ச் லா பாப்அப்

# return[]->'AB_bazarliste_popupneededfields_label'
source: Champs à ajouter dans la popup
ta: சாம்ப்ச் à அசூட்டர் டான்ச் லா பாப்அப்

# return[]->'AB_bazarcarto_popupcustomtemplate_label'
source: Template personnalisé pour la petite popup
ta: வார்ப்புரு ஆளுமை லா பெட்டிட் பாப்அப் ஊற்றவும்

# return[]->'AB_bazarcarto_popupcustomtemplate_hint'
source: ex. 'custom_map_popup.twig' à placer dans 'custom/templates/bazar/entries/index-dynamic-templates/'
ta: முன்னாள். 'custom_map_popup.twig' à பிளேசர் டான்ச் 'தனிப்பயன்/வார்ப்புருக்கள்/பசார்/உள்ளீடுகள்/குறியீட்டு-டைனமிக்-டெம்பிளேட்டுகள்/'

# return[]->'AB_bazarcarto_displayfields_markhover_label'
source: Champ à afficher au survol du marker
ta: Samp à afficher அயு survol du marker

# return[]->'AB_bazarcarto_smallmarker_label'
source: Petit marqueurs
ta: பெட்டிட் மார்க்கியர்ச்

# return[]->'AB_bazarcarto_spider_label'
source: Mode spider
ta: பயன்முறை சிலந்தி

# return[]->'AB_bazarcarto_spider_hint'
source: Éclate un groupe de point lors du clic
ta: Éclate un groupe de புள்ளியம் lors du clic

# return[]->'AB_bazarcarto_barregestion_label'
source: Barre de gestion des fiches
ta: பாரே டி கெச்டியன் டெச் ஃபிடச்

# return[]->'AB_bazarcarto_navigation_label'
source: Boutons de contrôle du zoom
ta: பூட்டன்ச் டி கான்ட்ரெல் டு சூம்

# return[]->'AB_bazarcarto_zoommolette_label'
source: Pouvoir zoomer avec la molette de la souris
ta: ப ou வோர் சூமர் அவெக் லா மோலெட் டி லா சவுரிச்

# return[]->'AB_bazaragenda_label'
source: Agenda
ta: நிகழ்ச்சி நிரல்

# return[]->'AB_bazaragenda_description'
source: Les fiches seront sous forme d'événement dans un agenda.
ta: லெச் ஃபிடச் செரண்ட் ச ous ச் ஃபார்ம் டி'வெனெமென்ட் டான்ச் அன் நிகழ்ச்சி நிரல்.

# return[]->'AB_bazaragenda_nbcol_label'
source: Nombre de colonnes
ta: நோம்ப்ரே டி கோர்ன்ச்

# return[]->'AB_bazaragenda_modal_label'
source: Affichage d'une fenêtre modale lors du clic
ta: Affichage d'une fentretre modale lors du clic

# return[]->'AB_bazarcalendar'
source: Calendrier
ta: காலெண்ட்ரியர்

# return[]->'AB_bazarcalendar_description'
source: Les fiches seront sous forme d'événement dans un calendrier.
ta: Les fiches seront sous forme d'vénement dans un calendrier.

# return[]->'AB_bazarcalendar_showlist_label'
source: Afficher le bouton 'planning'
ta: Afficher le bouton 'திட்டமிடல்'

# return[]->'AB_bazarcalendar_showlist_week'
source: Semaine
ta: செமைன்

# return[]->'AB_bazarcalendar_showlist_month'
source: Mois
ta: மோயிச்

# return[]->'AB_bazarcalendar_showlist_year'
source: Année
ta: அன்னே

# return[]->'AB_bazarcalendar_initialview_label'
source: Vue initiale
ta: VUE ICTIALE

# return[]->'AB_bazarcalendar_initialview_month'
source: Mois (valeur par défaut)
ta: மோயிச் (faluer par defaut)

# return[]->'AB_bazarcalendar_initialview_week'
source: Semaine
ta: செமைன்

# return[]->'AB_bazarcalendar_initialview_day'
source: Jour
ta: சர்

# return[]->'AB_bazarcalendar_initialview_list'
source: Planning
ta: திட்டமிடல்

# return[]->'AB_bazarcarto_showicalbutton_label'
source: Montrer le bouton d'export ical
ta: மாண்ட்ரர் லு பூட்டன் டி'ச் ஏற்றுமதி ical

# return[]->'AB_bazarliste_label'
source: Liste
ta: பட்டியல்

# return[]->'AB_bazarliste_description'
source: Les fiches seront sous forme d'accordéons
ta: லெச் ஃபிடச் செரண்ட் ச ous ச் ஃபார்ம் டி'லேடியோன்கள்

# return[]->'AB_bazarliste_displayfields_title'
source: Choix des champs à inclure
ta: Coix des samps à insture

# return[]->'AB_bazarliste_displayfields_title_label'
source: Zone de titre
ta: மண்டல டி டைட்ரே

# return[]->'AB_bazarliste_displayfields_subtitle_label'
source: Zone de sous titre
ta: மண்டல டி ச ous ச் டைட்ரே

# return[]->'AB_bazarliste_displayfields_text_label'
source: Zone de texte
ta: மண்டல டி டெக்ச்டே

# return[]->'AB_bazarliste_displayfields_floating_label'
source: Zone flottante
ta: மண்டல ஃப்ளோடான்ட்

# return[]->'AB_bazarliste_displayfields_visual_label'
source: Zone visuelle
ta: மண்டல விசுவல்

# return[]->'AB_bazarcard_label'
source: Blocs (agenda, actus, trombinoscope, damier…)
ta: பிளாக்ச் (நிகழ்ச்சி நிரல், ஆக்டச், டிராம்பினோச்கோப், டாமியர்…)

# return[]->'AB_bazarcard_description'
source: Les fiches seront sous forme de cartes
ta: லெச் ஃபிடச் செரண்ட் ச ous ச் ஃபார்ம் டி கார்ட்ச்

# return[]->'AB_bazarliste_displayfields_footer_label'
source: Zone footer
ta: மண்டல அடிக்குறிப்பு

# return[]->'AB_bazarcard_style_label'
source: Type de rendu
ta: வகை டி ரெண்டூ

# return[]->'AB_bazarcard_style_vertical'
source: Vertical
ta: செங்குத்து

# return[]->'AB_bazarcard_style_square'
source: Carré
ta: கார்

# return[]->'AB_bazarcard_style_horizontal'
source: Horizontal
ta: கிடைமட்டமாக

# return[]->'AB_bazarcard_imgstyle_label'
source: Dimension image
ta: பரிமாண படம்

# return[]->'AB_bazarcard_imgstyle_contain'
source: Image entière
ta: படம் என்டியர்

# return[]->'AB_bazarcard_imgstyle_cover'
source: Couvrir la zone / Rogner
ta: COUVRIR LA மண்டலம் / ROGNER

# return[]->'AB_bazarcard_nblines_label'
source: Nombre de lignes pour le sous-titre
ta: நோம்ப்ரே டி லிக்னெச் லு ச ous ச்-டிட்ரேவை ஊற்றுகிறார்

# return[]->'AB_BAZAR_MAP_AND_TABLE_LABEL'
source: Carte et tableau
ta: கார்டே மற்றும் அட்டவணை

# return[]->'AB_BAZAR_MAP_AND_TABLE_TABLEWITH_LABEL'
source: Tableau contenant toutes les fiches
ta: அட்டவணை கான்டெனன்ட் டூட்ச் லெச் ஃபைச்

# return[]->'AB_BAZAR_MAP_AND_TABLE_TABLEWITH_ALL'
source: avec ou sans geolocalisation
ta: அவெக் ஓ சான்ச் புவிசார்மயமாக்கல்

# return[]->'AB_BAZAR_MAP_AND_TABLE_TABLEWITH_ONLY_GEOLOC'
source: seulement avec geolocalisation
ta: சியுலேமென்ட் அவெக் புவிசார்மயமாக்கல்

# return[]->'AB_BAZAR_MAP_AND_TABLE_TABLEWITH_NO_GEOLOC'
source: seulement sans geolocalisation
ta: சீலெமென்ட் சான்ச் புவிசார்மயமாக்கல்

# return[]->'AB_bazartrombi_label'
source: Trombinoscope
ta: டிராம்பினோச்கோப்

# return[]->'AB_bazartrombi_description'
source: Les fiches seront sous forme de Trombinoscope.
ta: லெச் ஃபிடச் செரண்ட் ச ous ச் ஃபார்ம் டி டிராம்பினோச்கோப்.

# return[]->'AB_bazartrombi_hint'
source: Un champ de type bf_image est nécessaire.
ta: அன் சேம்ப் டி வகை bf_image est nécessaire.

# return[]->'AB_bazarmaterialcard_label'
source: Material card
ta: பொருள் அட்டை

# return[]->'AB_bazarmaterialcard_hint'
source: Un champ de type bf_image est nécessaire
ta: அன் சேம்ப் டி வகை bf_image est nécessaire

# return[]->'AB_bazarmaterialcard_nbcol_label'
source: Nombre de colonnes
ta: நோம்ப்ரே டி கோர்ன்ச்

# return[]->'AB_bazarmaterialcard_modal_label'
source: Affichage d'une fenêtre modale lors du clic
ta: Affichage d'une fentretre modale lors du clic

# return[]->'AB_bazarmaterialcard_bf_baseline_label'
source: Champ pour le sous titre
ta: சாம்பியன் போர் லு ச ous ச் டைட்ரே

# return[]->'AB_bazarannuaire_description'
source: Affiche les fiches sous forme d'annuaire alphabétique
ta: Affiche les fiches sous forme d'annuaire abarabétique

# return[]->'AB_bazardamier_label'
source: Damier
ta: டாமியர்

# return[]->'AB_bazardamier_description'
source: Affiche les fiches sous forme de damier paramétrable
ta: Affiche les fiches sous forme de tamier paramétrable

# return[]->'AB_bazardamier_hint'
source: Un champ de type bf_debut, bf_fin, bf_lieu, bf_image, bf_lien, bf_fichier, bf_bouton sont utilisés
ta: UN SAMP DE வகை BF_DEBUT, BF_FIN, BF_LIEU, BF_IMAGE, BF_LIEN, BF_FICHIER, BF_BOUTON SONT UTILISES

# return[]->'AB_bazardamier_nbcol_label'
source: Nombre de colonnes
ta: நோம்ப்ரே டி கோர்ன்ச்

# return[]->'AB_bazardamier_couleur_label'
source: Couleur du damier
ta: கூலூர் டு டாமியர்

# return[]->'AB_bazardamier_correpondance_hint'
source: Ce template est fortement customisable
ta: CE வார்ப்புரு est FORTEMENT தனிப்பயனாக்கக்கூடியது

# return[]->'AB_bazardamier_bf_description_label'
source: Champ pour la description
ta: சாம்ப் லா விளக்கத்தை ஊற்றவும்

# return[]->'AB_bazartimeline_label'
source: Time line
ta: நேர வரி

# return[]->'AB_bazartimeline_description'
source: Affiche les fiches dans une time line.
ta: Affiche les fichiers dans une காலவரிசை.

# return[]->'AB_bazartimeline_hint'
source: Un champ de type bf_image est nécessaire.
ta: அன் சேம்ப் டி வகை bf_image est nécessaire.

# return[]->'AB_bazarcarousel_label'
source: Carousel
ta: கொணர்வி

# return[]->'AB_bazarcarousel_description'
source: Affiche les images des fiches sous forme de carousel
ta: Affiche les pices des fiches sous forme de கொணர்வி

# return[]->'AB_bazarcarousel_hint'
source: Un champ de type bf_image est nécessaire.
ta: அன் சேம்ப் டி வகை bf_image est nécessaire.

# return[]->'AB_bazarcarousel_sanstitre_label'
source: Cacher le titre de la fiche sur l'image
ta: Cacher le titre de la fiche சுர் l'படம்

# return[]->'AB_bazarcarousel_avecpage_label'
source: Afficher une page en surimpression sur le carousel
ta: Afficher une page என் surimpression சுர் le கொணர்வி

# return[]->'AB_bazarcarousel_avecpage_hint'
source: La page affichée sera nommée PageDessusSlider
ta: லா பேச் அஃபிச்சீ செரா நோம் பீடெச்லிடர்

# return[]->'AB_bazarcarousel_showlinkinsteadofurl_label'
source: Montrer le lien bf_lien au lieu de celui vers la fiche
ta: மாண்ட்ரர் லு லீன் பி.எஃப்_லியன் ஏ.யூ லியு டி செலுய் வெர்சச் லா ஃபிச்

# return[]->'AB_bazarcarousel_bf_titre_label'
source: Champ pour le texte affiché
ta: சாம்ப் லு டெக்ச்டே அஃபிச்

# return[]->'AB_bazargaleriephoto_label'
source: Galerie photo
ta: கேலரி புகைப்படம்

# return[]->'AB_bazargaleriephoto_description'
source: Affiche les images des fiches sous forme de galerie photo.
ta: Affiche les pices des fiches sous forme de calerie புகைப்படம்.

# return[]->'AB_bazargaleriephoto_hint'
source: Un champ de type bf_image est nécessaire.
ta: அன் சேம்ப் டி வகை bf_image est nécessaire.

# return[]->'AB_bazarlistegalerie_label'
source: Liste Galerie photo
ta: பட்டியல் கேலரி புகைப்படம்

# return[]->'AB_bazarlistegalerie_description'
source: Affiche les images des fiches sous forme de galerie photo.
ta: Affiche les pices des fiches sous forme de calerie புகைப்படம்.

# return[]->'AB_bazarlistegalerie_hint'
source: Un champ de type bf_image est nécessaire.
ta: அன் சேம்ப் டி வகை bf_image est nécessaire.

# return[]->'AB_bazarlistephotobox_label'
source: Photobox
ta: ஃபோட்டோபாக்ச்

# return[]->'AB_bazarlistephotobox_description'
source: Affiche les images des fiches sous forme de galerie photo.
ta: Affiche les pices des fiches sous forme de calerie புகைப்படம்.

# return[]->'AB_bazarlistephotobox_hint'
source: Un champ de type bf_image est nécessaire.
ta: அன் சேம்ப் டி வகை bf_image est nécessaire.

# return[]->'AB_bazarlisteliens_label'
source: Liste des liens
ta: பட்டியல் டெச் லீன்ச்

# return[]->'AB_bazarlisteliens_description'
source: Affiche les liens vers les fiches sous forme de liste à puces.
ta: Affiche les leens vers les fiches sous forme de liste à puces.

# return[]->'AB_bazarlisteliensdates_label'
source: Liste des liens avec dates
ta: லிச்டே டெச் லீன்ச் அவெக் தேதிகள்

# return[]->'AB_bazarlisteliensdates_description'
source: Affiche les liens vers les fiches sous forme de liste avec les dates de création.
ta: Affiche les leens vers vers les fiches sous forme de liste avec les தேதிகள் டி க்ரேசன்.

# return[]->'AB_bazarmail_description'
source: Affiche uniquement la liste des mails trouvées dans le formulaire
ta: Affiche Uniquement la liste des mails trowées dans le fumlaire

# return[]->'AB_bazarmail_hint'
source: Un champ de type bf_mail est nécessaire.
ta: UN SAMP DE வகை BF_MAIL est Nécessaire.

# return[]->'AB_bazarblog_label'
source: Blog
ta: வலைப்பதிவு

# return[]->'AB_bazarblog_description'
source: Les fiches seront sous forme de blog.
ta: லெச் ஃபிடச் செரண்ட் ச ous ச் ஃபார்ம் டி வலைப்பதிவு.

# return[]->'AB_bazarblog_hint'
source: Un champ de type bf_image est possible
ta: Un samp de வகை bf_image est சாத்தியம்

# return[]->'AB_bazarblog_show_author_label'
source: Afficher l'auteur, l'autrice
ta: Afficher l'auture, l'autrice

# return[]->'AB_bazarblog_show_date_label'
source: Afficher la date de création
ta: Afficher la திகதி de creation

# return[]->'AB_bazarblog_date_creation_fiche_label'
source: Champ pour la date de publication
ta: சாம்பியன் போர் லா தேதி டி வெளியீடு

# return[]->'AB_bazargogocarto_label'
source: Cartographie 2 - GoGocarto
ta: கார்டோகிராஃபி 2 - கோகோகார்டோ

# return[]->'AB_bazargogocarto_description'
source: Les fiches seront sous forme de marqueur.
ta: லெச் ஃபிடச் செரண்ட் ச ous ச் ஃபார்ம் டி மார்குவூர்.

# return[]->'AB_bazargogocarto_height_label'
source: Hauteur de la carte
ta: ஆட்டூர் டி லா கார்டே

# return[]->'AB_bazargogocarto_width_label'
source: Largeur de la carte
ta: லார்ச் டி லா கார்டே

# return[]->'AB_bazar_action_label'
source: Afficher un formulaire de création de fiche
ta: Afficher un fummulaire de creation de fiche

# return[]->'AB_bazar_action_description'
source: Permet d'afficher le formulaire pour créer une fiche.
ta: பெர்மெட் டி அஃபிச்சர் லு ஃபார்முலேர் போர் க்ரீயர் யு.என்.இ ஃபிச்.

# return[]->'AB_bazar_action_redirecturl_label'
source: Nom de page de ce wiki ou URL complet à afficher après création d'une fiche
ta: Nom de page de ce wiki ou முகவரி follical à afficher aprers creation d'ne fiche

# return[]->'AB_attach_commons_title'
source: Pour les images
ta: லெச் படங்களை ஊற்றவும்

# return[]->'AB_attach_link_label'
source: Lien web associé au clic
ta: லீன் வெப் அசோசியே அயு CLIC

# return[]->'AB_attach_caption_label'
source: Texte affiché au survol
ta: டெக்ச்டே அஃபிச் ஆ சர்வர்

# return[]->'AB_attach_legend_label'
source: Légende
ta: லெசெண்டே

# return[]->'AB_attach_nofullimagelink_label'
source: Permettre de cliquer sur l'image pour l'afficher en grand
ta: Permettre de cliquer சுர் l'fim

# return[]->'AB_attach_no'
source: Non
ta: அல்லாத

# return[]->'AB_attach_size_label'
source: Taille de l'image
ta: டெய்ல் டி எல் படம்

# return[]->'AB_attach_size_small'
source: Petite
ta: பெட்டிட்

# return[]->'AB_attach_size_medium'
source: Moyenne
ta: மொயென்

# return[]->'AB_attach_size_big'
source: Grosse
ta: க்ரோச்

# return[]->'AB_attach_size_original'
source: Taille d'origine
ta: டெய்ல் டி ஆரிசின்

# return[]->'AB_attach_width_label'
source: Largeur
ta: பெரியவர்

# return[]->'AB_attach_height_label'
source: Hauteur
ta: ஆட்டூர்

# return[]->'AB_attach_class_label'
source: Classe
ta: கிளாச்

# return[]->'AB_attach_class_displaylink_label'
source: Type d'ouverture du lien, le cas échant
ta: டைப் டி'ஓட்வெர்டூர் டு லீன், லு காச் échéant

# return[]->'AB_attach_class_displaylink_default'
source: dans l'onglet courant
ta: டான்ச் எல்'ன்க்லெட் கூரண்ட்

# return[]->'AB_attach_class_displaylink_new-window'
source: dans un nouvel onglet
ta: டான்ச் அன் நோவெல் ஓங்க்லெட்

# return[]->'AB_attach_class_displaylink_modalbox'
source: dans une fenêtre modale
ta: டான்ச் யு.என்.இ ஃபெனட்ரே மோடேல்

# return[]->'AB_attach_class_position_label'
source: Position
ta: நிலை

# return[]->'AB_attach_class_position_none'
source: Texte en dessous
ta: டெக்ச்டே என் டெசச்

# return[]->'AB_attach_class_position_left'
source: Gauche
ta: க uch ச்சே

# return[]->'AB_attach_class_position_center'
source: Centre
ta: மையம்

# return[]->'AB_attach_class_position_right'
source: Droite
ta: டிராயிட்

# return[]->'AB_attach_class_effect_lightshadow'
source: Effet ombre portée
ta: Efet ombre portée

# return[]->'AB_attach_class_effect_whiteborder'
source: Effet Bord blanc
ta: எஃபெட் போர்டு பிளாங்க்

# return[]->'AB_attach_class_effect_zoom'
source: Effet Agrandissement au survol
ta: Effet agarandisment அயு survol

# return[]->'AB_attach_class_izmir_label'
source: Effets izmir
ta: Izmir

# return[]->'AB_attach_class_izmir_hint'
source: Et beaucoup plus d'effets disponibles sur https://ciar4n.com/izmir
ta: Et beaucoup plus d'fets disponibiles சுர் https://ciar4n.com/izmir

# return[]->'AB_attach_class_izmir_izmir'
source: Izmir
ta: இச்மிர்

# return[]->'AB_attach_class_izmir_border'
source: Bordure
ta: எல்லை

# return[]->'AB_attach_class_izmir_zoom'
source: Zoom
ta: பெரிதாக்கு

# return[]->'AB_attach_class_izmir_revealup'
source: Texte surgissant
ta: டெக்ச்டே சர்சிசண்ட்

# return[]->'AB_attach_class_izmir_gradiant'
source: Gradiant
ta: மாடி

# return[]->'AB_attach_class_izmir_topcentertext'
source: Texte en haut
ta: டெக்ச்டே என் ஆட்

# return[]->'AB_attach_attach_title'
source: Paramètres Généraux
ta: Parametres généraux

# return[]->'AB_attach_file_label'
source: Fichier uploadé
ta: Fichier apploadé

# return[]->'AB_attach_file_hint'
source: Pour afficher le fichier d'une autre page, taper "NomDePage/NomDeFichier.ext"
ta: அஃபிச்சர் லு ஃபைச்சியர் டி யூன் ஆட்ரே பக்கத்தை ஊற்றவும், "nompepage/nomdefichier.ext"
