Repository: 247i/TACETr
Catalog: உரை/தானி/*-expenses-website-*.po
Languages: ta

source: Imprint
ta: பெயர் விவரக் குறிப்பு

# imprint_text
source: Responsible for the content of this website and for development, maintenance and distribution of <i>{app_name}</i>
ta: இந்த வலைத்தளத்தின் உள்ளடக்கம் மற்றும் <i>{app_name}</i> இன் வளர்ச்சி, பராமரிப்பு மற்றும் விநியோகம் ஆகியவற்றிற்கு பொறுப்பு.

# privacy_policy_heading
source: Privacy policy
ta: தனியுரிமைக் கொள்கை

# privacy_policy_text
source: <i>{app_name}</i> does not access any data on your device other than its own database, its own folder on the SD card. If you use the feature of plans for future and recurrent transactions, you assign the calendar, where these plans are stored.
ta: <i>{app_name}</i> உங்கள் சாதனத்தில் அதன் சொந்த தரவுத்தளம், SD கார்டில் அதன் சொந்த கோப்புறை தவிர வேறு எந்த தரவையும் அணுகாது. எதிர்கால மற்றும் மீண்டும் நிகழ்கின்ற பரிவர்த்தனைகளுக்கான திட்டங்களின் அம்சத்தை நீங்கள் பயன்படுத்தினால், இந்த திட்டங்கள் சேமிக்கப்படும் நாட்காட்டியை நீங்கள் ஒதுக்குகிறீர்கள்.

# hero_main
source: Personal finance manager for Android
ta: ஆண்ட்ராய்டிற்கான தனிப்பட்ட நிதி நிர்வாகி

# hero_sub->use
source: Easy to use
ta: பயன்படுத்த எளிதானது

# hero_sub->functionality
source: Rich functionality
ta: வளம் மிகுந்த செயல்பாடுகள்

# hero_sub->source
source: Open Source
ta: திறந்த மூலம்

# menu_title->more_information
source: More information
ta: மேலும் தகவல்

# sections->features
source: Features
ta: அம்சங்கள்

# sections->premium
source: Go Premium
ta: பிரீமியம் அம்சங்கள்

# sections->participate
source: Participate
ta: கலந்து கொள்ளுங்கள்

# sections->faq
source: FAQ
ta: அடிக்கடி கேட்கப்படும் கேள்விகள்

# sections->versionlist
source: Changelog
ta: மாற்றக்குறிப்பு

# sections->credits
source: Credits
ta: பண்புக்கூற்று

# sections->licence
source: Licence
ta: உரிமம்

# sections->sourcecode
source: Source code
ta: மூல நிரல்

# sections->links
source: Links
ta: இணைப்புகள்

# screenshots->group
source: Group your transactions per day, week, month and year
ta: ஒரு நாள், வாரம், மாதம் மற்றும் வருடத்திற்கான உங்கள் பரிவர்த்தனைகளை தொகுக்கவும்

# screenshots->summarize
source: Sum up all your accounts (Sophisticated handling of exchange rates per account and per transaction)
ta: உங்கள் எல்லா கணக்குகளை தொகுக்கவும் (கணக்கு ஒன்றுக்கு மற்றும் பரிவர்த்தனை ஒன்றுக்கான அதிநவீன மாற்று விகித கையாளுதல்)

# screenshots->budget
source: Define how much you intend to spend in yearly, monthly or weekly budgets
ta: ஆண்டு, மாதாந்திர அல்லது வாராந்திர வரவு செலவுத் திட்டங்களில் நீங்கள் எவ்வளவு செலவிட விரும்புகிறீர்கள் என்பதை வரையறுக்கவும்

# screenshots->split
source: Split one transaction to multiple categories
ta: ஒரு பரிவர்த்தனையை பல வகைகளாகப் பிரிக்கவும்

# screenshots->distribution
source: Visualize the distribution per category
ta: ஒரு வகைக்கான விநியோகத்தைக் காட்சிப்படுத்துங்கள்

# screenshots->history
source: Understand how your financial situation evolves over time
ta: காலப்போக்கில் உங்கள் நிதி நிலைமை எவ்வாறு வெளிப்படுகிறது என்பதைப் புரிந்து கொள்ளுங்கள்

# screenshots->export
source: Print to PDF and exchange via QIF and CSV.
ta: PDF க்கு அச்சிடு மற்றும் QIF அல்லது CSV வழியாக பரிமாறுதல்.

# screenshots->sync
source: Sync encrypted account data on multiple devices via private or public cloud services.
ta: தனியார் அல்லது பொது மேகக்கணினி சேவைகள் வழியாக பல சாதனங்களில் மறையாக்கப்பட்ட கணக்கு தரவை ஒத்திசைக்கவும்.

# features->manage_accounts
source: Up to five accounts with <b>transfers</b> (also between different currencies)
ta: ஐந்து கணக்குகள் வரை, <b>பரிமாற்றங்களுடன்</b> (வெவ்வேறு நாணயங்களுக்கிடையிலும்)

# features->plans
source: Unlimited number of <b>templates</b> and up to three plans for <b>recurring</b> transactions
ta: வரம்பற்ற <b>வார்ப்புருக்கள்</b> மற்றும் <b>மீண்டும் நிகழ்கின்ற</b> பரிவர்த்தனைகளுக்கான மூன்று திட்டங்கள்

# features->export
source: <b>Export</b> to QIF and CSV. <b>Import</b> from QIF
ta: QIF மற்றும் CSV க்கு <b>ஏற்றுமதி</b>. QIF இலிருந்து <b>இறக்குமதி</b>

# features->password
source: Data can be protected by <b>password</b> or device <b>lock screen</b>
ta: <b>கடவுச்சொல்</b> அல்லது சாதன <b>பூட்டு திரை</b> மூலம் தரவைப் பாதுகாக்க முடியும்

# features->light_theme
source: <b>Theme</b> (dark and light) and <b>font size</b> can be customized
ta: <b>பின்புலத்தோற்றம்</b> (இருட்டு மற்றும் வெளிச்சம்) மற்றும் <b>எழுத்துரு அளவை</b> தனி விருப்பமாக்கலாம்

# features->reconciliation
source: <b>Reconciliation</b>: Easily compare transaction status with your bank statements
ta: <b>நல்லிணக்கம்</b> : பரிவர்த்தனை நிலையை உங்கள் வங்கி அறிக்கைகளுடன் எளிதாக ஒப்பிடுங்கள்

# features->homescreen
source: Homescreen <b>widget</b> and <b>shortcuts</b> for quick data entry
ta: விரைவான தரவு உள்ளீட்டிற்கான முகப்பு திரை <b>நிரல் பலகைகள்</b> மற்றும் <b>குறுக்குவழிகள்</b>

# contrib->thank_you
source: Your contribution supports the further development of My Expenses. Thank you!
ta: உங்கள் பங்களிப்பு "எனது செலவுகள்"-இன் வளர்ச்சியை மேலும் ஆதரிக்கிறது. நன்றி!

# contrib->feature-list-title
source: Please contribute by upgrading <i>{app_name}</i> and gain unrestricted access to the following features:
ta: <i> {app_name} </i> ஐ மேம்படுத்துவதன் மூலம் தயவுசெய்து பங்களித்து பின்வரும் அம்சங்களுக்கு வரம்பற்ற அணுகலைப் பெறவும்:

# contrib->feature->accounts_unlimited
source: Unlock the ability to create more than five accounts
ta: ஐந்துக்கும் மேற்பட்ட கணக்குகளை உருவாக்கும் திறனைத் திறக்கவும்

# contrib->feature->plans_unlimited
source: Unlock the ability to create more than three plans for recurring transactions
ta: தொடர்ச்சியான பரிவர்த்தனைகளுக்கு மூன்று திட்டங்களுக்கு மேல் உருவாக்கும் திறனைத் திறக்கவும்

# contrib->feature->distribution
source: <b>Pie chart</b>: Visualize the statistical distribution of transactions per category over different periods (years, months, weeks, days)
ta: <b>பை விளக்கப்படம்</b>: வெவ்வேறு காலகட்டங்களில் (ஆண்டுகள், மாதங்கள், வாரங்கள், நாட்கள்) ஒவ்வொரு வகையின் பரிவர்த்தனைகளின் புள்ளிவிவர பகிர்வை காட்சிப்படுத்தலாம்

# contrib->feature->split_transaction
source: <b>Split transaction</b>: A single transaction can be split into multiple parts (categories and transfers)
ta: <b>பிரிவு பரிவர்த்தனை</b> : ஒரு பரிவர்த்தனையை பல பகுதிகளாக பிரிக்கலாம் (வகைகள் மற்றும் பரிமாற்றங்கள்)

# contrib->feature->print
source: <b>Print</b> the transaction list to a PDF file
ta: பரிவர்த்தனை பட்டியலை ஒரு PDF கோப்பில் <b>அச்சிடலாம்</b>

# contrib->feature->ad_free
source: <b>No ads</b>
ta: <b>விளம்பரங்கள் இல்லை</b>

# contrib->feature->csv_import
source: Sophisticated, customizable <b>CSV import</b> (spreadsheet applications)
ta: அதிநவீன, தனிப்பயனாக்கக்கூடிய <b>CSV இறக்குமதி</b> (விரிதாள் செயலிகள்)

# contrib->feature->auto_backup
source: Daily <b>automated backup</b> with optional upload to cloud storage
ta: தினசரி <b>தானியங்கி காப்புப்பிரதி</b> எடுக்கலாம். மேலும் அதை விருப்பத்தேர்வாக மேகக்கணினி சேமிப்பகத்திற்கு பதிவேற்றலாம்

# contrib->feature->cloud_sync
source: <b>Cloud synchronization</b>: Data can be synced between multiple devices
ta: <b>மேகக்கணினி ஒத்திசைவு</b> : பல சாதனங்களுக்கு இடையில் தரவை ஒத்திசைக்கலாம்

# contrib->feature->split_template
source: Unlimited number of <b>templates and plans for split transactions</b>
ta: வரம்பற்ற <b>வார்ப்புருக்கள் மற்றும் பிரிவு பரிவர்த்தனைகளுக்கான திட்டங்கள்</b>

# contrib->feature->email_support
source: <b>Email support</b> with guaranteed response within 2 business days
ta: 2 வணிக நாட்களுக்குள் உத்தரவாத பதிலுடன் <b>மின்னஞ்சல் ஆதரவு</b>

# contrib->feature->roadmap_voting
source: Voting right on <b>development roadmap</b>
ta: <b>மேம்பாட்டு திட்டத்தில்</b> வாக்களிக்கும் உரிமை

# contrib->feature->history_chart
source: <b>History chart</b> (Cash flow)
ta: <b>வரலாற்று விளக்கப்படம்</b> (பணப்புழக்கம்)

# contrib->feature->budgeting
source: <b>Budgeting</b>: Compare your spending to limits you set per category on a daily, weekly, monthly or yearly basis.
ta: <b>வரவு செலவுத் திட்டமிடல்</b> : உங்கள் செலவினங்களை தினசரி, வாராந்திர, மாதாந்திர அல்லது வருடாந்திர அடிப்படையில் ஒரு வகைக்கு நீங்கள் நிர்ணயிக்கும் வரம்புகளுடன் ஒப்பிடலாம்

# contrib->feature->scan_receipt
source: <b>Scan receipts</b>: Automatically extract amount, date and payee
ta: <b>ரசீதுகளை ஸ்கேன் செய்யுங்கள்</b> : தானாகவே தொகை, தேதி மற்றும் பணம் செலுத்துபவர்

# contrib->feature->webui
source: <b>Web User Interface</b>
ta: <b>வலை பயனர் இடைமுகம்</b>

# contrib->feature->category_tree
source: Unlimited depth of <b>category tree</b>
ta: <b> வகை மரத்தின் வரம்பற்ற ஆழம் </b>

# contrib->feature->banking
source: Download transactions from banks in Germany (<b>FinTS</b>)
ta: செர்மனியில் உள்ள வங்கிகளிடமிருந்து பரிவர்த்தனைகளைப் பதிவிறக்குங்கள் (<b> ஃபின்ட்ச் </b>)

# contrib->one-time-payment
source: One-time payment
ta: ஒரு முறை கட்டணம்

# contrib->subscription
source: Subscription
ta: சந்தா

# store->short_description
source: Easy to use personal finance manager: rich functionality and Open Source
ta: பயன்படுத்துவதற்கு எளிதான தனிப்பட்ட நிதி நிர்வாகி: வளம் மிகுந்த செயல்பாடுகள்

# store->full_description_intro
source: {app_name} keeps track of your expenses and your income, directly on your smartphone and on your tablet.
ta: {app_name} உங்கள் செலவுகள் மற்றும் வருமானத்தை உங்கள் ஸ்மார்ட்போன் மற்றும் உங்கள் டேப்லெட்டில் நேரடியாக கணக்கு வைக்கும்.

# store->full_description_contrib
source: Premium features are unlocked by purchase of one of the following licence keys:
ta: பின்வரும் உரிம விசைகளில் ஒன்றை வாங்குவதன் மூலம் மதிப்பு அம்சங்கள் திறக்கப்படுகின்றன:

# store->full_description_contrib_amazon
source: Many additional features are unlocked by purchase of one of the licence keys, e.g.:
ta: உரிம விசைகளில் ஒன்றை வாங்குவதன் மூலம் பல கூடுதல் அம்சங்கள் திறக்கப்படுகின்றன, எ.கா:

# store->highlight_1
source: Keep track of your expenses and income with multiple accounts, templates and categories
ta: பல கணக்குகள், வார்ப்புருக்கள் மற்றும் வகைகளுடன் உங்கள் செலவுகள் மற்றும் வருமானத்தைக் கண்காணிக்கவும்

# store->highlight_2
source: Share your data between multiple phones and tablets via WebDAV and Google Drive
ta: WebDAV மற்றும் கூகிள் டிரைவ் வழியாக பல தொலைபேசிகள் மற்றும் டேப்லெட்டுகளுக்கு இடையில் உங்கள் தரவைப் பகிரவும்

# store->highlight_3
source: Summarize your financial situation per day, week, month or year
ta: ஒரு நாளைக்கு, வாரத்திற்கு, மாதத்திற்கு அல்லது வருடத்திற்கான உங்கள் நிதி நிலைமையின் சுருக்கத்தை பெறலாம்

# permissions->heading
source: <i>{app_name}</i> requires the following <u>permissions</u>
ta: <i>{app_name}</i> க்கு பின்வரும் <u>அனுமதிகள்</u> தேவை

# permissions->calendar->label
source: Calendar
ta: நாட்காட்டி

# permissions->calendar->explanation
source: Plans for future and recurrent transactions are stored either in a special local calendar or in any other calendar you assign.
ta: எதிர்கால மற்றும் மீண்டும் நிகழ்கின்ற பரிவர்த்தனைகளுக்கான திட்டங்கள் ஒரு சிறப்பு உள் நாட்காட்டியில் அல்லது நீங்கள் ஒதுக்கும் வேறு நாட்காட்டியிலோ சேமிக்கப்படும்.

# permissions->internet->label
source: Internet
ta: இணையதளம்

# permissions->internet->explanation_usage_tracking
source: Anonymous usage tracking
ta: அடையாளமற்ற பயன்பாட்டு கண்காணிப்பு

# permissions->internet->explanation_crash_reporting
source: Crash reports
ta: செயலிழப்பு அறிக்கைகள்

# permissions->internet->explanation_key_validation
source: Licence key validation
ta: உரிம விசை சரிபார்ப்பு

# permissions->internet->explanation_cloud_sync
source: Cloud synchronization
ta: மேகக்கணினி ஒத்திசைவு

# permissions->accounts->label
source: Accounts
ta: கணக்குகள்

# permissions->accounts->explanation
source: Synchronization across devices via cloud services.
ta: மேகக்கணினி சேவைகள் வழியாக சாதனங்களில் ஒத்திசைவு.

source: Contrib Key
ta: பங்களிப்பு திறவுகோல்

source: Extended Key
ta: விரிவாக்கப்பட்ட திறவுகோல்

source: Professional Key
ta: நிபுணத்துவ திறவுகோல்

# all_contrib_key_features
source: All features of Contrib Key
ta: பங்களிப்பு திறவுகோலின் அனைத்து அம்சங்கள்

# all_extended_key_features
source: All features of Extended Key
ta: விரிவாக்கப்பட்ட திறவுகோலின் அனைத்து அம்சங்கள்

source: Customer support
ta: வாடிக்கையாளர் ஆதரவு

# screenshot_titles->group
source: Group by year, month or week
ta: ஆண்டு, மாதம் அல்லது வாரம் வாரியாக குழுவமைத்தல்

# screenshot_titles->summarize
source: Sum up all your accounts
ta: உங்கள் எல்லா கணக்குகளையும் தொகுத்தல்

# screenshot_titles->budget
source: Yearly, monthly and weekly budgets
ta: ஆண்டு, மாத மற்றும் வார வரவு செலவுத் திட்டங்கள்

# screenshot_titles->split
source: Split to multiple categories
ta: பல பகுப்புகளாகப் பிரித்தல்

# screenshot_titles->distribution
source: Pie chart diagram
ta: பை விளக்கப்படம்

# screenshot_titles->history
source: History of your financial situation
ta: உங்கள் நிதி நிலைமையின் வரலாறு

# screenshot_titles->export
source: Export to PDF, QIF and CSV
ta: PDF, QIF மற்றும் CSV க்கு ஏற்றுமதி செய்தல்

# screenshot_titles->sync
source: Cloud synchronization
ta: மேகக்கணினி ஒத்திசைவு
