Repository: 247i/TACETr
Catalog: உரை/தானி/*-expenses-strings-*.po
Languages: ta

# remapping_result
source: The selected transactions were remapped.
ta: தேர்ந்தெடுக்கப்பட்ட பரிவர்த்தனைகள் மறு தொடற்பு படுத்தப்பட்டன.

# clone_and_remap_result
source: The selected transactions were cloned and remapped.
ta: தேர்ந்தெடுக்கப்பட்ட பரிவர்த்தனைகள் நகல் எடுக்கப்பட்டு மறு தொடற்பு படுத்தப்பட்டன.

# remap_empty_list
source: No item was found, that can be mapped to all of the selected transactions.
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து பரிவர்த்தனைகளுக்கும் தொடற்பு படுத்ததும் வகையில் எந்த உருப்படியும் கிடைக்கவில்லை.

# button_label_clone_and_remap
source: Clone and remap
ta: நகல் எடுத்து மறு தொடற்புப்படுத்து

# pref_clone_with_current_date_summary_on
source: Cloned transactions have current date
ta: நகல் எடுக்கப்படும் பரிவர்த்தனைகள் தற்போதைய தேதியை பெற்றிருக்கும்

# pref_clone_with_current_date_summary_off
source: Cloned transactions keep original date
ta: நகல் எடுக்கப்படும் பரிவர்த்தனைகள் அசல் தேதியை தக்கவைத்துக் கொள்ளும்

# tags_create_or_select
source: Create or select tags
ta: குறிச்சொற்களை உருவாக்கவும் அல்லது தேர்ந்தெடுக்கவும்

# pref_manage_tags_summary
source: Add, edit, delete tags.
ta: குறிச்சொற்களைச் சேர்க்கவும், திருத்தவும், நீக்கவும்.

# dialog_title_warning_delete_tag
source: Delete tag?
ta: குறிச்சொல்லை நீக்கவா?

# menu_edit_tag
source: Edit tag
ta: குறிச்சொல்லைத் திருத்து

# menu_tag
source: Tag
ta: குறிச்சொல்

# dialog_multi_tag
source: All selected transactions will be tagged with %s.
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து பரிவர்த்தனைகளும் %s உடன் குறிக்கப்படும்.

# dialog_multi_tag_clear
source: All tags will be removed from the selected transactions.
ta: தேர்ந்தெடுக்கப்பட்ட பரிவர்த்தனைகளிலிருந்து அனைத்து குறிச்சொற்களும் அகற்றப்படும்.

# warning_delete_tag
source: Tag %1$s is mapped to one transaction. Should it be deleted?
ta: குறிச்சொல் %1$s ஒரு பரிவர்த்தனைக்கு மாற்றப்பட்டுள்ளது. அதை நீக்க வேண்டுமா?

# dialog_multi_tag_append
source: Add new tags to existing tags
ta: இருக்கும் குறிச்சொற்களுடன் புதிய குறிச்சொற்களைச் சேர்

# dialog_multi_tag_replace
source: Replace existing tags by new tags
ta: இருக்கும் குறிச்சொற்களை புதிய குறிச்சொற்களை கொண்டு மாற்றவும்

# new_tag_hint
source: Enter new tag
ta: புதிய குறிச்சொல்லை உள்ளிடவும்

# language_download_requested
source: Translations for language %s are requested from Play Store
ta: %s மொழிக்கான மொழிபெயர்ப்புகள் Play Store-ல் இருந்து கோரப்படுகின்றன

# pref_planner_manual_time_title
source: Time for manually applied scheduled transaction
ta: கைமுறையாக பயன்படுத்தப்படும் திட்டமிடப்பட்ட பரிவர்த்தனைக்கான நேரம்

# pref_planner_manual_time_noon
source: 12 pm (noon)
ta: 12 pm (நண்பகல்)

# pref_planner_manual_time_current
source: Time of application
ta: பயன்படுத்தப்படும் நேரம்

# title_scan_receipt_feature
source: Scan receipt
ta: ரசீது ஸ்கேன்

# feature_download_requested
source: Feature %s is requested from Play Store.
ta: %s அம்சம் பிளே ஸ்டோரிலிருந்து கோரப்பட்டுள்ளது.

# feature_downloaded
source: Feature %s has been installed.
ta: %s அம்சம் நிறுவப்பட்டுள்ளது.

# menu_scan_mode
source: Scan mode
ta: ஸ்கேன் பயன்முறை

# button_scan
source: Scan
ta: ஸ்கேன்

# pref_ocr_total_indicators_title
source: Indicators for total amount
ta: மொத்த தொகைக்கான குறிகாட்டிகள்

# pref_ocr_total_indicators_summary
source: A list of strings, which identify the total value in a receipt. Put each value on a new line. Leave empty to restore the default value.
ta: ரசீதில் மொத்த மதிப்பை அடையாளம் காண, சரங்களின் பட்டியல். ஒவ்வொரு மதிப்பையும் புதிய வரியில் வைக்கவும். இயல்புநிலை மதிப்பை மீட்டமைக்க காலியாக விடவும்.

# pref_ocr_date_formats_title
source: Date Formats
ta: தேதி வடிவங்கள்

# pref_ocr_time_formats_title
source: Time Formats
ta: நேர வடிவங்கள்

# pref_criterion_futur_title
source: Criterion for future transactions
ta: எதிர்கால பரிவர்த்தனைகளுக்கான ஒப்பளவை

# pref_criterion_future_end_of_day
source: End of day
ta: நாள் முடிவு

# pref_criterion_future_current
source: Current time
ta: தற்போதைய நேரம்

# pref_category_title_features
source: Features
ta: அம்சங்கள்

# scan_result_multiple_candidates_dialog_title
source: Multiple candidates found. Please select:
ta: பல வேட்புகள் கண்டறியப்பட்டன. தயவு செய்து தேர்வு செய்யவும்:

# scan_result_no_amount
source: No amount found
ta: தொகை எதுவும் கிடைக்கவில்லை

# scan_result_no_date
source: No date found
ta: தேதி எதுவும் கிடைக்கவில்லை

# scan_result_no_payee
source: No payee found
ta: பணம் பெறுபவர் எவரும் கிடைக்கவில்லை

# pref_feature_uninstall_title
source: Request deinstallation of features and languages
ta: அம்சங்கள் மற்றும் மொழிகளை நீக்குவதற்கு கோரு

# pref_feature_uninstall_summary
source: Play Store tries to eventually remove those modules in the background.
ta: பின்னணியில் அந்த நிரல்கூறுகளை அகற்ற Play ஸ்டோர் முயற்சிக்கிறது.

# select_package
source: Please select a licence package.
ta: உரிமத் தொகுப்பு ஒன்றைத் தேர்ந்தெடுக்கவும்.

# discover_feature_fab_long_press
source: Tap and hold the floating action button in order to directly open the form for transfers, split transactions or income.
ta: மிதக்கும் செயல் பொத்தானைத் தட்டிப் பிடிப்பதன் நிமித்தமாக, இடமாற்றங்கள், பிரிவு பரிவர்த்தனைகள் அல்லது வருமானத்திற்கான படிவத்தை நேரடியாகத் திறக்கவும்

# advance_exexcution_in_days
source: Advance execution (in days)
ta: முன்னதாக செயல்படுத்து (நாட்களில்)

# warning_balance_account_delete
source: If you proceed, all reconciled transactions of this account will be deleted from the database and you will not be able to restore them.
ta: நீங்கள் தொடர்ந்தால், இந்த கணக்கின் அனைத்து நல்லிணக்கம் செய்யப்பட்ட பரிவர்த்தனைகளும் தரவுத்தளத்திலிருந்து நீக்கப்படும், மேலும் அவற்றை நீங்கள் மீட்டெடுக்க முடியாது.

# confirmation_load_template_discard_data
source: Existing form data will be discarded.
ta: இருக்கும் படிவத் தரவு நிராகரிக்கப்படும்.

# pref_clone_with_current_date_title
source: Date of cloned transactions
ta: நகல் எடுக்கப்பட்ட பரிவர்த்தனைகளின் தேதி

# template_default_action_without_amount_hint
source: Template without amount should be saved with default action 'Edit'
ta: தொகை இல்லாத வார்ப்புருக்கள் இயல்புநிலை நடவடிக்கை 'திருத்து' உடன் சேமிக்கப்பட வேண்டும்

# plan_automatic_without_amount_hint
source: Plan without amount should not be saved with automatic plan execution
ta: தொகை இல்லாத திட்டம் தன்னியக்க திட்ட செயல்படுத்தலுடன் சேமிக்கப்படக்கூடாது

# content_description_edit_plan
source: Edit plan in calendar app
ta: நாட்காட்டி செயலியில் திட்டத்தைத் திருத்து

# menu_save_and_new_content_description
source: Save the data, leave the form open for creating a new transaction with the same data.
ta: தரவைச் சேமிக்கவும், அதே தரவுடன் புதிய பரிவர்த்தனையை உருவாக்க படிவத்தைத் திறந்து விடவும்.

# pref_ocr_engine_title
source: Engine for text recognition
ta: உரை அறிதலுக்கான இயந்திரம்

# pref_tesseract_language_title
source: Language for Tesseract
ta: Tesseract-க்கான மொழி

# tesseract_download_confirmation
source: Do you want to download text recognition data for %s ?
ta: %s க்கான உரை அறிதல் தரவைப் பதிவிறக்க விரும்புகிறீர்களா?

# download_completed
source: Download (%s) has completed.
ta: பதிவிறக்கம் (%s) முடிந்தது.

# ocr_recognition_info
source: Running text recognition with %s
ta: %s உடன் உரை அறிதலை இயக்குகிறது

# ocr_download_info
source: Text recognition capability is provided by an external application.
ta: உரை அறிதல் திறன் வெளிப்புற செயலியால் வழங்கப்படுகிறது.

# warning_unencrypted_backup
source: While your data is protected from unauthorized access on this device, backups are created without encryption, unless you configure %s.
ta: இந்தச் சாதனத்தில் அங்கீகரிக்கப்படாத அணுகலிலிருந்து உங்கள் தரவு பாதுகாக்கப்பட்டாலும், நீங்கள் %s ஐ விருப்பமைக்காவிட்டால், குறியாக்கம் இல்லாமல் காப்புப்பிரதிகள் உருவாக்கப்படுகின்றன.

# pref_group_header_show_details_summary
source: Show detail sums in group header
ta: குழு தலைப்பில் விவரமான கூட்டு தொகைகளைக் காட்டு

source: New balance
ta: புதிய இருப்பு

# title_webui
source: Web User Interface
ta: வலை பயனர் இடைமுகம்

# single_feature_info
source: Alternatively you can buy unlimited access to only this feature.
ta: மாற்றாக இந்த அம்சத்திற்கு மட்டுமே நீங்கள் வரம்பற்ற அணுகலை வாங்க முடியும்.

# recurrence_last_day_of_month
source: Last day
ta: கடைசி நாள்

# warning_link_transfer
source: The two selected transactions will be linked as transfer. Payee/Payer and category information will be dropped.
ta: தேர்ந்தெடுக்கப்பட்ட இரண்டு பரிவர்த்தனைகளும் பரிமாற்றமாக இணைக்கப்படும். பணம் பெறுபவர் / செலுத்துபவர் மற்றும் வகை விவரங்கள் கைவிடப்படும்.

# account_widget_configuration_sum
source: Type of displayed sum
ta: காட்டப்படும் கூட்டு தொகையின் வகை

# account_widget_configuration_sum_total
source: Include future transactions
ta: எதிர்கால பரிவர்த்தனைகளை உள்ளடக்கு

source: Account widget configuration
ta: கணக்கு நிரல் பலகை வடிவமைப்பு

# budget_widget_configuration
source: Select budget
ta: வரவு செலவு திட்டத்தை தேர்வு செய்யவும்

# merge_parties_select
source: Select name of merged party
ta: இணைக்கப்பட்ட தரப்பின் பெயரைத் தேர்ந்தெடுக்கவும்

source: Active Tags
ta: செயலிலுள்ள குறிச்சொற்கள்

source: Request for Invoice
ta: விலைப்பட்டியலை கோரு

# auto_fill_focus
source: Set Focus on Payee
ta: பணம் பெறுபவர் உள்ளீட்டில் கவனம் செலுத்து

# warning_plan_instance_delete
source: The transaction created for the selected date will be deleted.
ta: தேர்ந்தெடுக்கப்பட்ட தேதிக்கு உருவாக்கப்பட்ட பரிவர்த்தனை நீக்கப்படும்.

# crash_reports_user_info
source: {app_name} will send reports about application crashes automatically to its developers, which allows them to fix problems more quickly.
ta: "{app_name}" செயலியின் செயலிழப்புகளைப் பற்றிய அறிக்கையை தானாகவே உருவாக்குனருக்கு அனுப்புகிறது. இது சிக்கல்களை விரைவாக சரிசெய்ய அனுமதிக்கிறது.

# pref_category_title_crash_reports
source: Crash reports
ta: செயலிழப்பு அறிக்கைகள்

# pref_enable_acra
source: Allow automatic sending of crash reports
ta: தன்னியக்கமாக செயலிழப்பு அறிக்கைகளை அனுப்ப அனுமதி

# pref_acra_user_email
source: User email to be included in crash report
ta: செயலிழப்பு அறிக்கையில் பயனர் மின்னஞ்சல் உள்ளடக்கப்பட்டுள்ளது

# pref_acra_user_email_summary
source: Please enter your email address if you are willing to help debugging and allow us to contact you.
ta: நீங்கள் வழு நீக்க உதவ விரும்பினால் உங்கள் மின்னஞ்சல் முகவரியை உள்ளிட்டு உங்களை தொடர்பு கொள்ள எங்களை அனுமதிக்கவும்.

# backup_save_to_sync_backend
source: Save to %s
ta: %s இல் சேமி

# ui_refinement
source: Refinement of the user interface
ta: பயனர் இடைமுகத்தை மெருகேற்றுதல்

source: Bug fixes
ta: பிழை திருத்தங்கள்

source: Performance enhancement
ta: செயல்திறன் மேம்பாடு

source: Stability improvements
ta: நிலைப்புத்தன்மை மேம்பாடுகள்

source: New version
ta: புதிய பதிப்பு

# menu_new_debt
source: New debt
ta: புதிய கடன்

# debt_owes_me
source: %s owes me
ta: %s எனக்கு கடன்பட்டிருக்கிறார்

# debt_I_owe
source: I owe %s
ta: நான் %s-க்கு கடன்பட்டிருக்கிறேன்

source: Debt
ta: கடன்

source: Debts
ta: கடன்கள்

# warning_party_delete_debt
source: When deleting this party, debts defined for it will be deleted as well.
ta: இந்த தரப்பை நீக்கும்போது, அவருடன் தொடர்புடைய கடன்களும் நீக்கப்படும்.

# debt_mapped_transactions
source: Debt %1$s has %2$d mapped transaction.
ta: கடன் %1$s உடன் ஒரு பரிவர்த்தனை தொடற்பு படுத்தப்பட்டுள்ளது.

# object_sealed_debt
source: Object refers to a closed debt.
ta: பொருள் ஒரு மூடப்பட்ட கணக்கைக் குறிக்கிறது.

# debt_managment
source: Debt management
ta: கடன் மேலாண்மை

# title_activity_debt_overview
source: Debt Overview
ta: கடன் கண்ணோட்டம்

# cb_label_merge_accounts
source: Merge accounts
ta: கணக்குகளை ஒன்றிணை

# pref_mlkit_script_title
source: Script for MlKit
ta: MlKit க்கான ஸ்கிரிப்ட்

# import_categories_icons_updated
source: One category was updated with icon.
ta: ஒரு வகை சின்னத்துடன் புதுப்பிக்கப்பட்டது.

source: Setup completed
ta: அமைப்பு நிறைவடைந்தது

# menu_parent_category_selection
source: Select parent category on short tap
ta: குறுகிய தட்டில் பெற்றோர் வகையைத் தேர்ந்தெடுக்கவும்

# dialog_title_purge_backups
source: Purge old backups
ta: பழைய காப்புப்பிரதிகளை தூய்மைப்படுத்துங்கள்

# purge_backups
source: The following old backup files will be deleted:
ta: பின்வரும் பழைய காப்புப்பிரதி கோப்புகள் நீக்கப்படும்:

# purge_backup_success
source: One old backup file was purged.
ta: ஒரு பழைய காப்புப்பிரதி கோப்பு சுத்திகரிக்கப்பட்டது.

# purge_backup_failure
source: One old backup file could not be deleted.
ta: ஒரு பழைய காப்புப்பிரதி கோப்பை நீக்க முடியவில்லை.

# pref_purge_backup_keep_title
source: Maximum number of most recent backup files to keep
ta: வைத்திருக்க மிக அண்மைக் கால காப்பு கோப்புகளின் அதிகபட்ச எண்ணிக்கை

# pref_purge_backup_require_confirmation_summary
source: Show confirmation prompt before files are purged
ta: கோப்புகள் சுத்திகரிக்கப்படுவதற்கு முன்பு உறுதிப்படுத்தல் வரியில் காண்பி

# pref_debug_logging_share_summary
source: Share log files
ta: பதிவு கோப்புகளைப் பகிரவும்

# webui_warning_move_transaction
source: The transaction will be moved to account {account}.
ta: பரிவர்த்தனை கணக்கு {கணக்கு க்கு க்கு நகர்த்தப்படும்.

# pref_csv_export_split_categories_summary
source: Use separate columns for each level of category hierarchy
ta: வகை வரிசைமுறையின் ஒவ்வொரு மட்டத்திற்கும் தனி நெடுவரிசைகளைப் பயன்படுத்தவும்

# pref_csv_export_split_amount_summary
source: Use separate columns for income and expenses
ta: வருமானம் மற்றும் செலவுகளுக்கு தனி நெடுவரிசைகளைப் பயன்படுத்தவும்

# pref_csv_export_split_date_time_summary
source: Use separate columns for date and time
ta: தேதி மற்றும் நேரத்திற்கு தனி நெடுவரிசைகளைப் பயன்படுத்தவும்

source: Icons for categories
ta: வகைகளுக்கான ஐகான்கள்

# budget_only_current_period
source: Set only for %s
ta: %s க்கு மட்டுமே அமைக்கவும்

# budget_table_header_rollover
source: Rollover
ta: ரோல்ஓவர்

# rollover_edit_invalid
source: The sum of the rollover assigned to a category and the rollovers assigned to subcategories cannot exceed the remainder.
ta: ஒரு வகைக்கு ஒதுக்கப்பட்ட ரோல்ஓவரின் தொகை மற்றும் துணைப்பிரிவுகளுக்கு ஒதுக்கப்பட்ட ரோல்ஓவர்கள் மீதமுள்ளதை விட அதிகமாக இருக்காது.

# dialog_confirm_rollover_delete
source: All rollover amounts for this period will be deleted.
ta: இந்த காலத்திற்கான அனைத்து ரோல்ஓவர் தொகைகளும் நீக்கப்படும்.

# content_description_attachment
source: Attachment
ta: இணைப்பு

source: Redesign
ta: மறுவடிவமைப்பு

# select_all_list_too_large
source: The command %s is not available because the list is only partially loaded. Please use the Search functionality in order to reduce the list size.
ta: %s கட்டளை கிடைக்காது, ஏனெனில் பட்டியல் ஓரளவு மட்டுமே ஏற்றப்படுகிறது. பட்டியல் அளவைக் குறைக்க தேடல் செயல்பாட்டைப் பயன்படுத்தவும்.

# menu_reconfigure
source: Reconfigure
ta: மறுகட்டமைக்கவும்

source: Encrypt database
ta: தரவுத்தளத்தை குறியாக்கவும்

# encrypt_database_info
source: The database will be encrypted with a passphrase that cannot be extracted from this device. Consequently it will not be backed up by your device's backup service.
ta: இந்த சாதனத்திலிருந்து பிரித்தெடுக்க முடியாத ஒரு கடவுச்சொற்றால் தரவுத்தளம் குறியாக்கம் செய்யப்படும். இதன் விளைவாக இது உங்கள் சாதனத்தின் காப்பு சேவையால் ஆதரிக்கப்படாது.

source: Database is encrypted.
ta: தரவுத்தளம் குறியாக்கம் செய்யப்பட்டுள்ளது.

# notifications_permission_required_planner
source: <i>{app_name}</i> needs permission to send you notifications, when future transactions are posted.
ta: <i> {app_name} </i> எதிர்கால பரிவர்த்தனைகள் வெளியிடப்படும் போது உங்களுக்கு அறிவிப்புகளை அனுப்ப இசைவு தேவை.

# notifications_permission_required_webui
source: By granting the permission to send notifications, you can control the status of the web server.
ta: அறிவிப்புகளை அனுப்ப இசைவு வழங்குவதன் மூலம், வலை சேவையகத்தின் நிலையை நீங்கள் கட்டுப்படுத்தலாம்.

# notifications_permission_required_sync
source: By granting the permission to send notifications, you can monitor the progress of the synchronization operations.
ta: அறிவிப்புகளை அனுப்ப இசைவு வழங்குவதன் மூலம், ஒத்திசைவு நடவடிக்கைகளின் முன்னேற்றத்தை நீங்கள் கண்காணிக்க முடியும்.

# notifications_permission_required_auto_backup
source: By granting the permission to send notifications, you will be informed about auto-backups.
ta: அறிவிப்புகளை அனுப்ப இசைவு வழங்குவதன் மூலம், ஆட்டோ-பின் பற்றி உங்களுக்குத் தெரிவிக்கப்படும்.

# notifications_channel_required
source: Please enable channel %s.
ta: தயவுசெய்து சேனல் %s ஐ இயக்கவும்.

# debt_installment_pay
source: I pay an installment of %s.
ta: நான் %s தவணையை செலுத்துகிறேன்.

# debt_installment_receive
source: I receive an installment of %s.
ta: நான் %s இன் தவணையைப் பெறுகிறேன்.

# debt_lend_additional
source: I lend %s.
ta: நான் %s கடன் வழங்குகிறேன்.

# debt_borrow_additional
source: I borrow %s.
ta: நான் %s கடன் வாங்குகிறேன்.

# debt_paid_off_other
source: %s's debt is paid off.
ta: %s இன் கடன் செலுத்தப்படுகிறது.

# debt_paid_off_self
source: My debt is paid off.
ta: எனது கடன் செலுத்தப்படுகிறது.

# debt_balance_i_owe
source: I now owe %s.
ta: நான் இப்போது %s கடன்பட்டிருக்கிறேன்.

# debt_balance_they_owe
source: %1$s now owes %2$s.
ta: %1$s இப்போது %2$s கடன்பட்டுள்ளன.

# pref_backup_file_prefix_title
source: File prefix
ta: கோப்பு முன்னொட்டு

source: Optimize image file size
ta: பட கோப்பு அளவை மேம்படுத்தவும்

source: Maximum size
ta: அதிகபட்ச அளவு

# image_optimize_quality_summary
source: Quality of 0 means compress for the smallest size. 100 means compress for maximum visual quality.
ta: 0 இன் தகுதி என்பது மிகச்சிறிய அளவிற்கு சுருக்க வேண்டும். 100 என்றால் அதிகபட்ச காட்சி தரத்திற்கு சுருக்க.

source: Template shortcut
ta: வார்ப்புரு குறுக்குவழி

source: Select template
ta: வார்ப்புருவைத் தேர்ந்தெடுக்கவும்

source: Add Shortcut
ta: குறுக்குவழியைச் சேர்க்கவும்

# orphaned_transaction_info
source: A transaction is linked to the plan for this date, but no event instance exists at this date.
ta: இந்த தேதிக்கான திட்டத்துடன் ஒரு பரிவர்த்தனை இணைக்கப்பட்டுள்ளது, ஆனால் இந்த தேதியில் நிகழ்வு நிகழ்வு எதுவும் இல்லை.

# orphaned_transaction_relink
source: The transaction can be relinked with the event instance on %s.
ta: பரிவர்த்தனையை %s இல் நிகழ்வு நிகழ்வுடன் மறுபரிசீலனை செய்யலாம்.

# orphaned_transaction_align_date
source: Optionally the date stored with the transaction can also be aligned with the instance date.
ta: விருப்பமாக பரிவர்த்தனையுடன் சேமிக்கப்பட்ட தேதியும் நிகழ்வு தேதியுடன் சீரமைக்கப்படலாம்.

# button_relink_keep_date
source: Relink, but keep date
ta: மறுபரிசீலனை செய்யுங்கள், ஆனால் தேதியை வைத்திருங்கள்

# button_relink_update_date
source: Relink and update date
ta: தேதியை மறுபரிசீலனை செய்து புதுப்பிக்கவும்

source: Read from data
ta: தரவிலிருந்து படியுங்கள்

# merge_parties_strategy_delete
source: Duplicates are deleted.
ta: நகல்கள் நீக்கப்படுகின்றன.

# merge_parties_strategy_group
source: Duplicates are grouped as dependents.
ta: நகல்கள் சார்புடையவர்களாக தொகுக்கப்பட்டுள்ளன.

source: Show Duplicates
ta: நகல்களைக் காட்டு

source: Remove from group
ta: குழுவிலிருந்து அகற்று

# pref_attachment_mime_types_title
source: Allowed MIME types for attachments
ta: இணைப்புகளுக்கு MIME வகைகள் அனுமதிக்கப்பட்டன

source: Attachments
ta: இணைப்புகள்

# pref_copy_attachments_title
source: Copy attachments to application folder
ta: பயன்பாட்டு கோப்புறையில் இணைப்புகளை நகலெடுக்கவும்

# pref_copy_attachments_summary_on
source: Files are copied to application folder.
ta: பயன்பாட்டு கோப்புறையில் கோப்புகள் நகலெடுக்கப்படுகின்றன.

# pref_copy_attachments_summary_off
source: Files are not copied, only a reference is stored.
ta: கோப்புகள் நகலெடுக்கப்படவில்லை, ஒரு குறிப்பு மட்டுமே சேமிக்கப்படுகிறது.

# widget_title_budget
source: My budget
ta: எனது பட்செட்

# pref_unmapped_transaction_as_transfer_title
source: Unmapped transactions
ta: தடையற்ற பரிவர்த்தனைகள்

# pref_unmapped_transaction_as_transfer_summary_off
source: are counted as expense / income
ta: செலவு / வருமானம் என கணக்கிடப்படுகிறது

# pref_unmapped_transaction_as_transfer_summary_on
source: are counted as transfer
ta: பரிமாற்றமாக எண்ணப்படுகிறது

# menu_aggregate_neutral_categories
source: Aggregate neutral categories
ta: மொத்த நடுநிலை வகைகள்

source: One-time payment
ta: ஒரு முறை கட்டணம்

# warning_delete_default_transfer_category
source: Category %s is configured as default transfer category and should not be deleted.
ta: வகை %s இயல்புநிலை பரிமாற்ற வகையாக கட்டமைக்கப்பட்டுள்ளன, மேலும் அவை நீக்கப்படக்கூடாது.

source: Default transfer category
ta: இயல்புநிலை பரிமாற்ற வகை

source: Contact us
ta: எங்களை தொடர்புகொள்

# pref_transaction_amount_color_source_title
source: Colors for amounts
ta: தொகைகளுக்கான வண்ணங்கள்

# pref_sync_now_all_summary
source: %s syncs all accounts for the same back-end
ta: %s அனைத்து கணக்குகளையும் ஒரே பின் இறுதியில் ஒத்திசைக்கிறது

# menu_unlink_transfer
source: Unlink transfer
ta: பரிமாற்றத்தை இணைக்கவும்

# warning_unlink_transfer
source: The selected transfer will be unlinked: It will be replaced by normal transactions in both accounts.
ta: தேர்ந்தெடுக்கப்பட்ட பரிமாற்றம் இணைக்கப்படாதது: இது இரு கணக்குகளிலும் சாதாரண பரிவர்த்தனைகளால் மாற்றப்படும்.

# menu_transform_to_transfer
source: Convert into transfer
ta: பரிமாற்றமாக மாற்றவும்

# warning_transform_to_transfer
source: The selected transaction will be replaced by a transfer from %1$s to %2$s.
ta: தேர்ந்தெடுக்கப்பட்ட பரிவர்த்தனை %1$s இலிருந்து %2$s க்கு மாற்றுவதன் மூலம் மாற்றப்படும்.

# remap_date
source: On all selected transactions, date will be set to %s.
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து பரிவர்த்தனைகளிலும், தேதி %s என அமைக்கப்படும்.

# roadmap_intro
source: The 2024 Roadmap Vote is now open! Vote for the features and improvements that matter most to you.
ta: 2024 சாலை வரைபட வாக்கெடுப்பு இப்போது திறந்திருக்கும்! உங்களுக்கு மிகவும் முக்கியத்துவம் வாய்ந்த நற்பொருத்தங்கள் மற்றும் மேம்பாடுகளுக்கு வாக்களியுங்கள்.

# merge_categories_dialog_title
source: Merge Categories
ta: வகைகளை ஒன்றிணைக்கவும்

# subcategories_merged_recursively
source: If any of the merged categories have subcategories with the same label, those will be merged first, recursively.
ta: இணைக்கப்பட்ட வகைகளில் ஏதேனும் ஒரே லேபிளைக் கொண்ட துணைப்பிரிவுகளைக் கொண்டிருந்தால், அவை முதலில் மறுநிகழ்வு ஒன்றிணைக்கப்படும்.

# merge_categories_prompt
source: Select the category that you want to keep
ta: நீங்கள் வைத்திருக்க விரும்பும் வகையைத் தேர்ந்தெடுக்கவும்

# pref_csv_export_category_separator_summary
source: Separator between levels of category hierarchy
ta: வகை வரிசைக்கு இடையில் பிரிப்பான்

source: Not enough data
ta: போதுமான தரவு இல்லை

# menu_unpack
source: Unpack
ta: திறக்க

# warning_unarchive
source: The archive will be unpacked. All contained transactions will be reinserted into the list.
ta: காப்பகம் திறக்கப்படாது. உள்ள அனைத்து பரிவர்த்தனைகளும் பட்டியலில் மீண்டும் சேர்க்கப்படும்.

source: Archive
ta: காப்பகம்

# warning_delete_archive
source: All transactions contained in this archive (%d) will be deleted.
ta: இந்த காப்பகத்தில் (%d) உள்ள அனைத்து பரிவர்த்தனைகளும் நீக்கப்படும்.

# dialog_title_warning_delete_archive
source: Delete archive?
ta: காப்பகத்தை நீக்கவா?

# archive_warning
source: All transactions (%d) in the selected date range will be archived.
ta: தேர்ந்தெடுக்கப்பட்ட தேதி வரம்பில் உள்ள அனைத்து பரிவர்த்தனைகளும் (%d) காப்பகப்படுத்தப்படும்.

# warning_nested_archives
source: Nested archives are not supported.
ta: உள்ளமை காப்பகங்கள் ஆதரிக்கப்படவில்லை.

# warning_empty_archive
source: No transactions exist in the selected date range.
ta: தேர்ந்தெடுக்கப்பட்ட தேதி வரம்பில் பரிவர்த்தனைகள் எதுவும் இல்லை.

# warning_archive_inconsistent_state
source: The transactions in the selected date range have inconsistent statuses (%s).
ta: தேர்ந்தெடுக்கப்பட்ட தேதி வரம்பில் உள்ள பரிவர்த்தனைகள் சீரற்ற நிலைகள் (%s) உள்ளன.

# warning_backend_deactivated
source: Backend is not ready to be synced.
ta: பின்தளத்தில் ஒத்திசைக்க தயாராக இல்லை.

# button_activate_again
source: Activate again
ta: மீண்டும் செயல்படுத்தவும்

# credit_limit_reached
source: You have hit your credit limit.
ta: உங்கள் கடன் வரம்பை நீங்கள் தாக்கியுள்ளீர்கள்.

# saving_goal_reached
source: You have met your saving goal.
ta: உங்கள் சேமிப்பு இலக்கை நீங்கள் சந்தித்தீர்கள்.

# credit_limit_exceeded
source: You have gone over your credit limit.
ta: உங்கள் கடன் வரம்பை மீறிவிட்டீர்கள்.
