Repository: 247i/TACETr
Catalog: உரை/தானி/*-expenses-strings-*.po
Languages: ta

# saving_goal_exceeded
source: You have exceeded your saving goal.
ta: உங்கள் சேமிப்பு இலக்கை மீறிவிட்டீர்கள்.

source: Overage
ta: அதிகப்படியான

# credit_limit_available_credit
source: Available credit
ta: கிடைக்கும் கடன்

# saving_goal_short_fall
source: Shortfall
ta: பற்றாக்குறை

# content_description_original_amount
source: Define the original amount of this transaction by selecting a currency, and entering the amount. You can also define an exchange rate which will be used to calculate the effective amount.
ta: ஒரு நாணயத்தைத் தேர்ந்தெடுப்பதன் மூலமும், தொகையை உள்ளிடுவதன் மூலமும் இந்த பரிவர்த்தனையின் அசல் அளவை வரையறுக்கவும். பயனுள்ள அளவைக் கணக்கிடப் பயன்படுத்தப்படும் பரிமாற்ற வீதத்தையும் நீங்கள் வரையறுக்கலாம்.

# content_description_exchange_rate
source: Exchange rate for 1 %1$s in %2$s
ta: %2$s இல் 1 %1$s க்கு பரிமாற்ற வீதம்

# content_description_equivalent_amount
source: Define the value of this transaction in your home currency. Instead of entering the amount, you can also enter the exchange rate for calculating it.
ta: உங்கள் வீட்டு நாணயத்தில் இந்த பரிவர்த்தனையின் மதிப்பை வரையறுக்கவும். தொகையை உள்ளிடுவதற்கு பதிலாக, அதைக் கணக்கிடுவதற்கான பரிமாற்ற வீதத்தையும் உள்ளிடலாம்.

# warning_archived_transfer_cannot_be_edited
source: Transfer cannot be edited because its other side is archived.
ta: பரிமாற்றத்தை திருத்த முடியாது, ஏனெனில் அதன் மறுபக்கம் காப்பகப்படுத்தப்பட்டுள்ளது.

# warning_budget_sync_import
source: The configuration of this budget will be imported from the synchronization backend. All local changes will be lost.
ta: இந்த பட்செட்டின் உள்ளமைவு ஒத்திசைவு பின்தளத்தில் இருந்து இறக்குமதி செய்யப்படும். அனைத்து உள்ளக மாற்றங்களும் இழக்கப்படும்.

# budget_import_can_be_imported
source: The following budgets can be imported:
ta: பின்வரும் வரவு செலவுத் திட்டங்களை இறக்குமதி செய்யலாம்:

# budget_import_cannot_be_imported
source: The following budgets refer to accounts that are not synchronized:
ta: பின்வரும் வரவு செலவுத் திட்டங்கள் ஒத்திசைக்கப்படாத கணக்குகளைக் குறிக்கின்றன:

# budget_import_none_found
source: No budgets found.
ta: வரவு செலவுத் திட்டங்கள் எதுவும் கிடைக்கவில்லை.

# webui_download_no_data
source: After printing, exporting or creating backups in the app, files will be available from here for download.
ta: பயன்பாட்டில் அச்சிட்டு, ஏற்றுமதி செய்த அல்லது காப்புப்பிரதிகளை உருவாக்கிய பிறகு, கோப்புகள் பதிவிறக்கம் செய்ய இங்கிருந்து கிடைக்கும்.

# filter_dialog_empty
source: No criteria added yet. Tap the buttons above to define your query and refine your results.
ta: இதுவரை எந்த அளவுகோல்களும் சேர்க்கப்படவில்லை. உங்கள் வினவலை வரையறுக்கவும், உங்கள் முடிவுகளை செம்மைப்படுத்தவும் மேலே உள்ள பொத்தான்களைத் தட்டவும்.

# menu_show_equivalent_value
source: Equivalent value
ta: சமமான மதிப்பு

source: Initial value
ta: தொடக்க மதிப்பு

source: Current value
ta: தற்போதைய மதிப்பு

source: Total value
ta: மொத்த மதிப்பு

# enable_automatic_daily_exchange_rate_download
source: Automatic daily exchange rate download
ta: தானியங்கி நாள்தோறும் பரிமாற்ற வீத பதிவிறக்க

source: Price history
ta: விலை வரலாறு

source: Dynamic exchange rate
ta: மாறும் பரிமாற்ற வீதம்

# progress_recalculating
source: Recalculating
ta: மறுபரிசீலனை செய்தல்

# equivalent_amount_plural
source: Equivalent amounts
ta: சமமான அளவு

# menu_recalculate
source: Recalculate
ta: மறுபரிசீலனை செய்யுங்கள்

# recalculate_equivalent_amounts_warning
source: Equivalent amounts will be (re)calculated if applicable stored exchange rates are available.
ta: பொருந்தக்கூடிய சேமிக்கப்பட்ட பரிமாற்ற விகிதங்கள் கிடைத்தால் சமமான தொகைகள் (மறு) கணக்கிடப்படும்.

source: Quick search
ta: விரைவான தேடல்

source: Complex search
ta: சிக்கலான தேடல்

# account_closed
source: Account is closed
ta: கணக்கு மூடப்பட்டுள்ளது

source: Balance Sheet
ta: ஐந்தொகை, இருப்புநிலைக் குறிப்பு

# balance_sheet_section_assets
source: Assets
ta: சொத்துகள்

# balance_sheet_section_liabilities
source: Liabilities
ta: கடன்கள்

# balance_sheet_net_worth
source: Net Worth
ta: நிகர மதிப்பு

source: Mark as cleared
ta: அழிக்கப்பட்டபடி குறி

source: Mark as unreconciled
ta: சமரசமற்றதாகக் குறிக்கவும்

# pref_equivalent_amounts_automatic_update_title
source: Automatically update equivalent amounts when prices change
ta: விலைகள் மாறும்போது சமமான தொகைகளை தானாகவே புதுப்பிக்கவும்

source: Sort direction
ta: திசையை வரிசைப்படுத்துங்கள்

source: Batch download
ta: தொகுதி பதிவிறக்கம்

# warning_batch_download_quota
source: Batch download from %s incurs the risk of depleting your usage limit.
ta: %s இலிருந்து தொகுதி பதிவிறக்கம் உங்கள் பயன்பாட்டு வரம்பைக் குறைக்கும் அபாயத்தை ஏற்படுத்துகிறது.

# batch_download_result
source: %d prices were downloaded and stored in the database.
ta: %d விலைகள் பதிவிறக்கம் செய்யப்பட்டு தரவுத்தளத்தில் சேமிக்கப்பட்டன.
