Repository: 247i/TACETr
Catalog: உரை/தானி/*-expenses-strings-*.po
Languages: ta

# qif_parse_failure_found_multiple_accounts_cannot_merge
source: Cannot merge them into existing account.
ta: ஏற்கனவே உள்ள கணக்குடன் அவற்றை ஒன்றிணைக்க முடியாது.

source: Reference Number
ta: குறிப்பு எண்

# restore_db_failure
source: Database restore failed.
ta: தரவுத்தள மீட்டமைப்பு தோல்வியடைந்தது.

# restore_db_success
source: Database has been restored from backup.
ta: காப்புப்பிரதியில் இருந்து தரவுத்தளம் மீட்டமைக்கப்பட்டது.

# restore_preferences_failure
source: Preferences restore failed
ta: விருப்பத்தேர்வுகளின் மீட்டமைப்பு தோல்வியடைந்தது.

# restore_backup_file_not_found
source: No file %1$s found in archive "%2$s"
ta: "%2$s" ஆவணக்கிடங்கில் %1$s எனும் கோப்பு இல்லை

# restore_preferences_success
source: Preferences have been restored from backup.
ta: காப்புப்பிரதியில் இருந்து விருப்பத்தேர்வுகள் மீட்டமைக்கப்பட்டன.

# restore_calendar_success
source: %d plans have been restored from backup
ta: %d திட்டங்கள் காப்புப்பிரதியில் இருந்து மீட்டமைக்கப்பட்டன.

# save_transaction_and_new_success
source: Successfully saved
ta: வெற்றிகரமாக சேமிக்கப்பட்டது

# save_transaction_error
source: Could not save new transaction from template.
ta: வார்ப்புருவிலிருந்து புதிய பரிவர்த்தனையை சேமிக்க முடியவில்லை.

# save_transaction_from_template_success
source: New transaction successfully saved from template.
ta: புதிய பரிவர்த்தனை டெம்ப்ளேட் இலிருந்து வெற்றிகரமாக சேமிக்கப்பட்டது.

# save_transaction_template_deleted
source: Template has been deleted
ta: வார்ப்புரு நீக்கப்பட்டது

source: Select
ta: தேர்வு செய்க

source: Select category
ta: வகையைத் தேர்வு செய்க

# select_payee
source: Select payer/payee
ta: பணம் செலுத்துபவர்/பெறுபவரை தேர்ந்தெடுக்கவும்

# share_scheme_not_supported
source: Scheme %1$s not supported
ta: ஆதரிக்கப்படாதத் திட்டம்: %1$s

# share_sending
source: Send export file
ta: ஏற்றுமதி கோப்பை பகிர்

# split_parts_heading
source: Split parts
ta: பிரிவு பகுதிகள்

source: Split transaction
ta: பிரிவு பரிவர்த்தனை

source: Status
ta: நிலை

# status_cleared
source: cleared
ta: ஒப்புக்கொள்ளப்பட்டது

# status_reconciled
source: reconciled
ta: நல்லிணக்கம் செய்யப்பட்டது

# status_unreconciled
source: unreconciled
ta: நல்லிணக்கம் செய்யப்படாதது

# status_void
source: void
ta: வெற்று

source: Subcategory
ta: துணை வகை

# sum_expenses
source: Expenses
ta: செலவுகள்

# sum_income
source: Income
ta: வருமானம்

# sum_transfer
source: Transfers
ta: பரிமாற்றங்கள்

# tell_a_friend_message
source: Check out {app_name}, Personal Finance Manager for {platform}, from {website}
ta: {app_name}ஐ பாருங்கள், {platform}க்கு தனிப்பட்ட நிதி நிர்வாகி, {website} இல் இருந்து

# thank_you
source: Thank you for your support!
ta: உங்கள் ஆதரவுக்கு நன்றி!

source: Time
ta: நேரம்

source: Title
ta: தலைப்பு

# total_cleared
source: Cleared total
ta: ஒப்புக்கொள்ளப்பட்ட மொத்தம்

# total_reconciled
source: Reconciled total
ta: நல்லிணக்கம் செய்யப்பட்ட மொத்தம்

source: Transaction
ta: பரிவர்த்தனை

source: Transfer
ta: பரிமாற்றம்

# transfer_from_account
source: From
ta: இதிலிருந்து

# transfer_to_account
source: To
ta: இதற்கு

source: Type
ta: வகை

source: Unsplit amount
ta: பிரிக்கப்படாத தொகை

# unsplit_amount_greater_than_zero
source: There is still some amount left unsplit.
ta: இன்னும் பிரிக்கப்படாமல் கொஞ்சம் தொகை மீதம் உள்ளது

# warning_backup
source: Database and preferences will be saved to "%1$s".
ta: தரவுத்தளம் மற்றும் விருப்பத்தேர்வுகள் "%1$s" இல் சேமிக்கப்படும்.

# continue_confirmation
source: Do you want to continue?
ta: தொடர விரும்புகிறீர்களா?

# warning_delete_account
source: Account "%1$s" will be deleted with all its transactions.
ta: "%1$s" கணக்கு அதன் அனைத்து பரிமாற்றங்களுடன் நீக்கப்படும்.

# warning_delete_main_category
source: One selected category has subcategories, that will be deleted as well.
ta: தேர்ந்தெடுக்கப்பட்ட வகைகள் ஒன்றில் துணை வகைகள் உள்ளன, அவை நீக்கப்படும்.

# warning_delete_category_with_budget
source: For at least one selected category, there are budget allocations, that will be deleted as well.
ta: தேர்ந்தெடுக்கப்பட்ட ஒரு வகையிலாவது, திட்டமிடப்பட்ட ஒதுக்கீடுகள் உள்ளன, அவையும் நீக்கப்படும்.

# warning_delete_template
source: The selected template will be deleted.
ta: தேர்ந்தெடுக்கப்பட்ட வார்ப்புரு நீக்கப்படும்.

# warning_delete_transaction
source: The selected transaction will be deleted.
ta: தேர்ந்தெடுக்கப்பட்ட பரிவர்த்தனை நீக்கப்படும்.

# move_category_success
source: One category was successfully moved.
ta: ஒரு வகை வெற்றிகரமாக நகர்த்தப்பட்டது.

# move_category_failure
source: One category was not moved, because the same label already exists at the target.
ta: ஒரு வகை நகர்த்தப்படவில்லை, ஏனெனில் அதே லேபிள் ஏற்கனவே இலக்கில் உள்ளது.

# warning_delete_reconciled
source: Deleting reconciled transactions will cause your records to differ from the bank statement.
ta: நல்லிணக்கம் செய்யப்பட்ட பரிவர்த்தனைகளை நீக்குவதால் உங்கள் பதிவுகள் வங்கி அறிக்கையிலிருந்து மாறுபடும்.

# warning_balance_account
source: Please compare the cleared total with the ending balance in your bank statement. If you proceed, cleared transactions will be marked as reconciled.
ta: ஒப்புக்கொள்ளப்பட்ட மொத்தத்தை உங்கள் வங்கிக் அறிக்கையிலிருக்கும் முடிவு இருப்புடன் ஒப்பிடவும். நீங்கள் தொடர்ந்தால், ஒப்புக்கொள்ளப்பட்ட பரிவர்த்தனைகள் நல்லிணக்கம் செய்யப்பட்டது என குறிக்கப்படும்.

# warning_password_protected
source: App is password protected.
ta: செயலி கடவுச்சொல்லால் பாதுகாக்கப்படுகிறது.

# warning_widget_disabled
source: You need to enable this widget in the app settings.
ta: நீங்கள் இந்த நிரல் பலகையை செயலியின் அமைப்புகளில் இயலச்செய்ய வேண்டும்

# warning_instantiate_template_from_widget_password_protected
source: Quick instantiation of templates from this widget only works if you allow data entry from widgets without password in the app settings.
ta: நீங்கள் செயலியின் அமைப்புகளில் கடவுச்சொல் இல்லாமலே நிரல் பலகையிலிருந்து தரவு உள்ளீடுகளை அனுமதித்தால் மட்டுமே இந்த நிரல் பலகையிலிருந்து வார்ப்புருகளின் விரைவான செயலாக்கம் வேலை செய்யும்.

# warning_password_contrib
source: Setting a security question allows you to unlock the app, in case you forget your password.
ta: பாதுகாப்புக் கேள்வியை அமைத்தல், நீங்கள் கடவுச்சொல்லை மறந்துவிட்ட பட்சத்தில் செயலியை திறக்க உங்களை அனுமதிக்கும்.

# warning_reset_account
source: If you proceed, all transactions of this account are deleted from the database and cannot be restored.
ta: நீங்கள் தொடர்ந்தால், இந்த கணக்கின் எல்லா பரிவர்த்தனைகளும் தரவுத்தளத்தில் இருந்து நீக்கப்படும். மேலும் அவற்றை மீட்டமைக்க முடியாது.

# warning_reset_account_all
source: If you proceed, for all accounts%1$s, transactions will be deleted from the database and cannot be restored.
ta: நீங்கள் தொடர்ந்தால், எல்லா கணக்குகளுக்கும் %1$s, பரிவர்த்தனைகள் தரவுத்தளத்தில் இருந்து நீக்கப்படும். மேலும் அவற்றை மீட்டமைக்க முடியாது.

# warning_reset_account_matched
source: If you proceed, transactions matched by the current filter will be deleted from the database and cannot be restored.
ta: நீங்கள் தொடர்ந்தால், தற்போதைய வடிப்பான் மூலம் பொருந்தும் பரிவர்த்தனைகள் தரவுத்தளத்தில் இருந்து நீக்கப்படும். மேலும் அவற்றை மீட்டமைக்க முடியாது.

# warning_restore
source: Database and preferences will be restored from file "%1$s". The current data will be deleted.
ta: தரவுத்தளம் மற்றும் விருப்பத்தேர்வுகள் "%1$s" கோப்பில் இருந்து மீட்டமைக்கப்படும். தற்போதைய தரவு நீக்கப்படும்.

# warning_splitpartcategory_context
source: Transfers that are part of a split can only be edited in the context of the split.
ta: ஒரு பிரிவின் பகுதியாக இருக்கும் பரிமாற்றங்கள் பிரிவின் பின்னணியில் மட்டுமே திருத்தப்பட முடியும்.

# validation_error_number_out_of_range
source: Please set a number between %1$d and %2$d
ta: %1$d மற்றும் %2$d இடையே ஒரு எண்ணை அமைக்கவும்

# warning_change_fraction_digits_1
source: Amounts in the database need to be updated in order to match the new number of fraction digits.
ta: புதிய பின்ன இலக்கங்களின் எண்ணிக்கைக்கு பொருந்த தரவுத்தளத்தில் உள்ள தொகைகளை புதுப்பிக்க வேண்டும்.

# warning_change_fraction_digits_2_multiplied
source: If amounts are not updated, they will be displayed as multiplied by %d after the change.
ta: தொகைகள் புதுப்பிக்கப்படவில்லை என்றால், மாற்றத்திற்குப் பின் அவை %d மூலம் பெருக்கப்பட்டது போல் காட்டப்படும்.

# warning_change_fraction_digits_2_divided
source: If amounts are not updated, they will be displayed as divided by %d after the change.
ta: தொகைகள் புதுப்பிக்கப்படவில்லை என்றால், மாற்றத்திற்குப் பின் அவை %d மூலம் வகுக்கப்பட்டது போல் காட்டப்படும்.

# warning_change_fraction_digits_3
source: If amounts are updated, you will lose the information about their fractional part.
ta: தொகைகள் புதுப்பிக்கப்பட்டால், நீங்கள் அவைகளின் பின்ன பகுதியை பற்றிய தகவலை இழப்பீர்கள்.

# warning_change_fraction_digits_checkbox_label
source: Update amounts in database
ta: தரவுத்தளத்தில் உள்ள தொகைகளை புதுப்பி

# import_categories_success
source: %1$d categories successfully imported.
ta: %1$d வகைகள் வெற்றிகரமாக இறக்குமதி செய்யப்பட்டன.

# import_parties_success
source: %1$d parties successfully imported.
ta: %1$d தரப்புகள் வெற்றிகரமாக இறக்குமதி செய்யப்பட்டன.

# import_accounts_success
source: %1$d accounts successfully imported.
ta: %1$d கணக்குகள் வெற்றிகரமாக இறக்குமதி செய்யப்பட்டன.

# import_transactions_success
source: %1$d transactions successfully imported into account %2$s
ta: %1$d பரிவர்த்தனைகள் வெற்றிகரமாக %2$s கணக்கிற்கு இறக்குமதி செய்யப்பட்டன

# import_accounts_none
source: No accounts imported
ta: எந்த கணக்குகளும் இறக்குமதி செய்யப்படவில்லை

# import_categories_none
source: No categories imported
ta: எந்த வகைகளும் இறக்குமதி செய்யப்படவில்லை

# import_parties_none
source: No parties imported
ta: எந்த தரப்புகளும் இறக்குமதி செய்யப்படவில்லை

# import_transactions_none
source: No transactions imported into account %1$s
ta: எந்த பரிவர்த்தனைகளும் %1$s கணக்கிற்கு இறக்குமதி செய்யப்படவில்லை

# import_source_select_error
source: Please provide a file of type %1$s
ta: தயவுசெய்து %1$s வகையில் ஒரு கோப்பை வழங்கவும்

# menu_categories_setup_default
source: Setup default categories
ta: இயல்புநிலை வகைகளை அமைக்கவும்

# widget_title_accounts
source: My accounts
ta: எனது கணக்குகள்

# widget_title_templates
source: My templates
ta: எனது வார்ப்புருக்கள்

# app_dir_not_accessible
source: The currently selected folder for backups and exports (%1$s) is not accessible. Please select a different one.
ta: காப்புப்பிரதிக்கள் மற்றும் ஏற்றுமதிகளுக்காக தற்போது தேர்ந்தெடுக்கப்பட்டுள்ள கோப்புறையை (%1$s) அணுக முடியவில்லை. தயவு செய்து வேறொன்றைத் தேர்ந்தெடுக்கவும்.

# app_dir_not_compatible_with_nougat
source: The currently configured URI for backups and exports (%1$s) is not supported under Android Nougat. Please select a folder again.
ta: காப்புப்பிரதிக்கள் மற்றும் ஏற்றுமதிகளுக்காக தற்போது விருப்பமைக்கப்பட்டURI (%1$s) ஆண்ட்ராய்டு நோகட்டில் ஆதரிக்கப்படவில்லை. தயவு செய்து மீண்டும் ஒரு கோப்புறையைத் தேர்ந்தெடுக்கவும்.

# search_amount
source: Search for amount
ta: தொகையைத் தேடவும்

# search_category
source: Search for category
ta: வகையைத் தேடவும்

# search_comment
source: Search for notes
ta: குறிப்புக்களைத் தேடவும்

# search_date
source: Search for date
ta: தேதியைத் தேடவும்

# search_status
source: Search for status
ta: நிலையைத் தேடவும்

# search_payee
source: Search for payee/payer
ta: பணம் பெறுபவர்/செலுத்துபவரைத் தேடவும்

# search_method
source: Search for method
ta: முறைகளைத் தேடவும்

# search_tag
source: Search for tag
ta: குறிச்சொல்லைத் தேடுங்கள்

source: and
ta: மற்றும்

# between_and
source: between %1$s and %2$s
ta: %1$s மற்றும் %2$s இடையே

# before
source: before %s
ta: %s க்கு முன்

# after
source: after %s
ta: %s க்கு பின்

# comparison_operator_equal
source: equal to
ta: சமமாக

# comparison_operator_greater_than
source: greater than
ta: அதிகமாக

# comparison_operator_lesser_than
source: lesser than
ta: குறைவாக

# comparison_operator_between
source: between
ta: இடையே

# comparison_operator_date_before
source: before
ta: முன்

# comparison_operator_date_after
source: after
ta: பின்

# premium_failed_or_canceled
source: Purchasing failed or cancelled.
ta: வாங்குதல் தோல்வியுற்றது அல்லது ரத்துசெய்யப்பட்டது.

# hint_auto_fill
source: Should data be filled in automatically from last transaction for same payee/payer? You can always change this behaviour from the settings.
ta: அதே பணம் பெறுபவர்/செலுத்துபவர் கொண்ட முந்தய பரிவர்த்தனையிலிருந்து தரவு தானாகவே நிரப்பப்பட வேண்டுமா? இதை அமைப்புகளிலிருந்து எப்போதும் மாற்றிக்கொள்ளலாம்.

# change_fraction_digits_result
source: %1$d accounts with currency %2$s have been updated.
ta: %2$s-ஐ நாணயமாக கொண்ட %1$d கணக்குகள் புதுப்பிக்கப்பட்டன.

# import_source_file
source: File
ta: கோப்பு

# pref_manage_stale_images_title
source: Stale images
ta: நாள்பட்ட படங்கள்

# pref_manage_stale_images_summary
source: Manage pictures left over from deleted transactions
ta: நீக்கப்பட்ட பரிவர்த்தனைகளில் இருந்து மீதமுள்ள படங்களை நிர்வகிக்கவும்

# transaction_deleted
source: Transaction has been deleted
ta: பரிவர்த்தனை நீக்கப்பட்டது

# account_deleted
source: Account has been deleted
ta: கணக்கு நீக்கப்பட்டது

# budget_deleted
source: Budget has been deleted
ta: வரவு செலவுத் திட்டம் அழிக்கப்பட்டது

# dialog_export_applied_to_filter
source: Only transactions matched by the current filter will be considered.
ta: தற்போதைய வடிப்பான் மூலம் பொருந்திய பரிவர்த்தனைகள் மட்டுமே கருதப்படும்.

# export_handle_deleted_create_helper
source: Create helper transaction
ta: உதவி பரிவர்த்தனையை உருவாக்கவும்

# export_handle_deleted_update_balance
source: Update opening balance
ta: தொடக்க இருப்பை புதுப்பிக்கவும்

source: File name
ta: கோப்பு பெயர்

source: Folder name
ta: கோப்புறை பெயர்

# mark_void_instead_of_delete
source: Do not delete transaction, mark as void instead.
ta: பரிவர்த்தனைகளை நீக்க வேண்டாம், அதற்குப் பதிலாக வெற்று பரிவர்த்தனையாகக் குறிக்கவும்.

# menu_undelete_transaction
source: Undelete
ta: மீட்டெடு

# slash_forbidden_in_filename
source: / character is not allowed in filenames
ta: கோப்பு பெயரில் / வரியுரு அனுமதிக்கப்படாது

# io_error_unable_to_create_file
source: Unable to create file %1$s in folder %2$s
ta: கோப்புறை %2$s-இல் %1$s கோப்பை உருவாக்க முடியவில்லை

# export_to_format
source: Export to %s
ta: %s ஆக ஏற்றுமதி செய்

# pref_csv_import_delimiter
source: Delimiter
ta: வரம்புச் சுட்டி

# menu_parse
source: Parse
ta: பாகுபடுத்து

# csv_import_field_mapped_more_than_once
source: %s is mapped more than once.
ta: %s ஒன்றுக்கு மேலாக தொடற்பு படுத்தப்பட்டுள்ளது.

# csv_import_records_discarded
source: %d records were discarded.
ta: %d பதிவுகள் நீக்கப்பட்டது.

# csv_import_subcategory_requires_category
source: If you map subcategory, you must also map category.
ta: நீங்கள் துணை வகையைத் தொடற்பு படுத்தினால், அதன் வகையையும் தொடற்பு படுத்த வேண்டும்.

# cvs_import_set_first_line_as_header
source: Should the first line be treated as a header line?
ta: முதல் வரி ஒரு தலைப்பு வரியாக கருதப்பட வேண்டுமா?

# csv_import_no_mapping_found_for_amount
source: Please map one column either to amount, income or expense.
ta: ஒரு வரிசையை தயவுசெய்து தொகை, வருமானம் அல்லது செலவுடன் தொடற்பு படுத்தவும்.

# menu_show_transactions
source: Show transactions
ta: பரிவர்த்தனைகளைக் காட்டு

# pref_custom_decimal_format_title
source: Number format
ta: எண் வடிவம்

# pref_custom_decimal_format_summary
source: If you are not satisfied with the default format for your locale, adapt it to your needs. Leave empty to restore the default format.
ta: உங்கள் வட்டாரத்திற்கான இயல்புநிலை வடிவத்தில் உங்களுக்கு மன நிறைவு இல்லையென்றால், உங்கள் தேவைகளுக்கு ஏற்ப அவற்றை மாற்றி அமைக்கவும். இயல்புநிலை வடிவத்தை மீட்டமைக்க காலியாக விடவும்.

# pref_auto_backup_title
source: Auto-backup
ta: தன்னியக்க காப்புப்பிரதி

# pref_auto_backup_summary
source: Backup database daily at the specified time (only if data has changed).
ta: குறிப்பிட்ட காலப்பொழுதில் தினசரி தரவுத்தளத்தை காப்புப்பதிவு எடுக்கவும் (தரவு மாற்றப்பட்டால் மட்டுமே).

# pref_auto_backup_time_title
source: Auto-backup time
ta: தன்னியக்க காப்புப்பிரதி காலப்பொழுது

# calendar_permission_required
source: <i>{app_name}</i> needs permission to access your calendar, in order to create plans for future and recurring transactions.
ta: <i> {app_name} </i> -க்கு எதிர்காலத்திற்கான திட்டங்கள் மற்றும் மீண்டும் நிகழ்கின்ற பரிவர்த்தனைகள் உருவாக்க, உங்களுடைய நாட்காட்டியை அணுக அனுமதி தேவை.

# button_request_calendar_access
source: Grant access
ta: அனுமதி வழங்கு

# menu_move
source: Move
ta: நகர்த்து

# dialog_title_select_target
source: Select target
ta: இலக்கைத் தேர்ந்தெடுக்கவும்

# transform_subcategory_to_main
source: Transform to main category
ta: முக்கிய வகையாக மாற்றவும்

# preferences_week_start_day_title
source: Week starts on
ta: வாரம் தொடங்கும் நாள்

# preferences_month_start_date_title
source: Month starts on
ta: மாதம் தொடங்கும் தேதி

# pref_grouping_periods
source: Grouping periods
ta: குழுவமைப்பு காலங்கள்

source: Exchange rate
ta: மாற்று விகிதம்

# date_format_hour
source: Hour
ta: மணி நேரம்

# date_format_minute
source: Minute
ta: நிமிடம்

# pref_sort_order_last_used
source: Last used
ta: கடைசியாகப் பயன்படுத்தியது

# pref_sort_order_custom
source: Custom
ta: தனி விருப்பம்

# content_description_calculator
source: Calculator
ta: கணக்கிடு கருவி

# plan_instance_state_open
source: open
ta: திறந்துள்ளது

# plan_instance_state_cancelled
source: cancelled
ta: ரத்துசெய்யப்பட்டது

# plan_instance_state_applied
source: applied
ta: பயன்படுத்தப்பட்டது

# progress_dialog_updating_split_parts
source: Updating split parts
ta: பிரிவு பகுதிகள் புதுப்பிக்கப்படுகின்றன

# warning_cannot_move_split_transaction
source: This split transaction cannot be moved to account %1$s because there are transfer parts that refer to this account.
ta: இந்த பிரிவு பரிவர்த்தனையை %1$s கணக்கிற்கு நகர்த்த முடியாது, ஏனெனில் இதில் இந்த கணக்கை தொடர்புபடுத்தும் பரிமாற்ற பிரிவுகள் உள்ளன.

# content_description_calculator_delete_button
source: Delete last digit
ta: கடைசி இலக்கத்தை நீக்கு

# paypal_callback_info
source: Your transaction has been completed, and a receipt for your purchase has been emailed to you. You may log into your account at www.paypal.com to view details of this transaction.
ta: உங்கள் பரிவர்த்தனை முடிக்கப்பட்டது, மேலும் நீங்கள் வாங்கியதற்கான ரசீது உங்களுக்கு மின்னஞ்சல் மூலம் அனுப்பப்பட்டது. நீங்கள் www.paypal.com இல் உங்கள் கணக்கில் உள்நுழைந்து இந்த பரிவர்த்தனை விவரங்களைப் பார்வையிடலாம்.

# search_transfer
source: Search for transfer
ta: பரிமாற்றத்தைத் தேடு

# search_account
source: Search for account
ta: கணக்கைத் தேடு

# pref_sort_order_next_instance
source: Next instance
ta: அடுத்த நிகழ்வு

# crash_dialog_title
source: {app_name} has crashed
ta: {app_name} செயலிழந்தது

# crash_dialog_text
source: An unexpected error occurred forcing the application to stop. Please help us fix this by sending us error data, all you have to do is click OK.
ta: எதிர்பாராத பிழை ஏற்பட்டு செயலியின் நிறுத்தத்தை கட்டாயப்படுத்தியது. இதை சரிசெய்ய தயவு செய்து எங்களுக்கு பிழை தொடர்பான தரவுகளை அனுப்பி உதவவும், நீங்கள் செய்ய வேண்டியது எல்லாம் சரி என்பதை சொடுக்குதல் மட்டுமே.

# crash_dialog_comment_prompt
source: You might add your comments about the problem below:
ta: சிக்கலைப் பற்றிய உங்கள் கருத்துகளை நீங்கள் சேர்க்கலாம்:

source: Synchronization
ta: ஒத்திசைவு

# synchronization_none
source: No synchronization
ta: ஒத்திசைக்காதே

# hint_url
source: URL
ta: உரலி

# description_webdav_url
source: Please enter the URL to a special folder on your WebDAV server. {app_name} will store its data inside this folder, it won't touch anything outside of it.
ta: உங்கள் WebDAV சேவையகத்தில் ஒரு பிரத்யேக கோப்புறைக்கான உரலியை உள்ளிடுக. {app_name} இந்த கோப்புறையினுள் அதன் தரவைச் சேமிக்கும், அதற்கு வெளியே அது எதையுமே தொடுவதில்லை.

# description_webdav_trust_certificate
source: The website uses a certificate, which is not trusted by Android.
ta: வலைத்தளம் ஆண்ட்ராய்டின் நம்பகத்தன்மையற்ற சான்றிதழைப் பயன்படுத்துகிறது.

# label_trust_certificate
source: Trust this certificate
ta: இந்த சான்றிதழை நம்புங்கள்

# no_sync_backends
source: No synchronization backends
ta: ஒத்திசைவு பின்தளங்கள் இல்லை

# menu_create_sync_backend
source: New synchronization backend
ta: புதிய ஒத்திசைவு பின்தளம்

# validate_error_not_empty
source: Must not be empty
ta: காலியாக இருக்கக்கூடாது

# validate_error_webdav_invalid_certificate
source: The certificate could not be trusted. It seems invalid.
ta: சான்றிதழ் மேல் நம்பிக்கை வைக்க முடியவில்லை. இது தவறானதாகத் தெரிகிறது.

# validate_error_webdav_not_compliant
source: The URL does not point to a WebDAV resource.
ta: உரலி ஒரு WebDAV வளத்தை சுட்டவில்லை.

# validate_error_webdav_404
source: The URL does not exist on the server.
ta: சேவையகத்தில் உரலி இல்லை.

source: URL not valid
ta: செல்லுபடியாகாத உரலி

# menu_sync_unlink
source: Stop syncing
ta: ஒத்திசைவை நிறுத்து

# menu_sync_link
source: Start syncing
ta: ஒத்திசைவை தொடங்கு

# menu_sync_download
source: Download and sync
ta: பதிவிறக்கு மற்றும் ஒத்திசை

# pref_sync_frequency_summary
source: How often should data be synchronized (in hours).
ta: எவ்வளவு கால இடைவெளியில் (மணி நேரங்களில்) ஒத்திசைவு நிகழ வேண்டும்.

# pref_sync_frequency_summary_0
source: Set to 0 in order to deactivate automatic sync.
ta: தானியங்கி ஒத்திசைவை செயலிழக்க 0 என அமைக்கவும்.

# dialog_confirm_sync_unlink
source: If you unlink this account from %s, the synchronization status gets lost. Linking them again later, requires a full synchronization to be executed again.
ta: இந்த கணக்கை நீங்கள் %s இலிருந்து நீக்கினால், ஒத்திசைவு நிலை இழக்கப்படும். பின்னர் அவற்றை மீண்டும் இணைக்கும் போது, மீண்டும் முழு ஒத்திசைவு நிகழ்த்தப்பட வேண்டும்.

# dialog_sync_link
source: An account with uuid %s exists both in the local database and on the remote backend. When you link both, you need to decide, if, initially, you want to upload local data to the remote backend or download remote data to the local database.
ta: %s uuid கொண்ட ஒரு கணக்கு உள் தரவுத்தளம் மற்றும் தொலைநிலை பின்தளம் இரண்டிலும் உள்ளது. நீங்கள் இரண்டையும் இணைக்கும் போது, தொடக்கத்தில், உள் தரவுதளத்தில் உள்ள தரவைத் தொலைநிலை பின்தளத்திற்கு பதிவேற்ற வேண்டுமா அல்லது தொலைநிலை பின்தளத்தில் இருக்கும் தரவை உள் தரவுத்தளத்திற்கு பதிவிறக்க வேண்டுமா என்பதை நீங்கள் முடிவு செய்ய வேண்டும்.

# dialog_command_sync_link_remote
source: Download from remote
ta: தொலைநிலையில் இருந்து பதிவிறக்கு

# dialog_command_sync_link_local
source: Upload from local
ta: உள் தரவுத்தளத்திலிருந்து பதிவேற்று

# dialog_synced_to_other
source: An account with uuid %s already exists in the local database and is linked to a different remote backend.
ta: %s uuid கொண்ட ஒரு கணக்கு ஏற்கனவே உள் தரவுத்தளத்தில் உள்ளது மேலும் அது வேறு தொலை பின்தளத்துடன் இணைக்கப்பட்டுள்ளது.

# dialog_confirm_sync_remove_backend
source: Remote backend %s will be removed. This will not affect data stored locally or remotely, but synchronization status gets lost.
ta: தொலைநிலை பின்தளம் %s அகற்றப்படும். இது உள்ளே அல்லது தொலைநிலையில் சேமிக்கப்பட்ட தரவை பாதிக்காது, ஆனால் ஒத்திசைவு நிலை இழக்கப்படும்.

# dialog_confirm_sync_link_local
source: Remote data for this account will be deleted. Make sure no other devices are linked to it.
ta: இந்த கணக்கிற்கான தொலைநிலை தரவு நீக்கப்படும். வேறு எந்த கருவியும் அதனுடன் இணைக்கப்படவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# dialog_confirm_sync_link_remote
source: Local data for this account will be deleted.
ta: இந்த கணக்கிற்கான உள் தரவு நீக்கப்படும்.

# warning_trial_limit_reached
source: The trial period for testing feature %s has ended.
ta: %s அம்சத்திற்கான பரிசோதனைக் காலம் முடிந்தது.

# warning_synchronization_folder_usage
source: This folder is used for synchronizing data between installations of {app_name} on different devices. Please do not modify any of its contents manually.
ta: வெவ்வேறு கருவிகளில் {app_name} இன் நிறுவல்களுக்கு இடையேயான ஒத்திசைவுக்காக இந்த கோப்புறை பயன்படுத்தப்படுகிறது. தயவு செய்து அதன் உள்ளடக்கங்களை கைமுறையாக மாற்ற வேண்டாம்.
