Repository: 247i/TACETr
Catalog: உரை/தானி/*-expenses-strings-*.po
Languages: ta

source: Account
ta: கணக்கு

source: Account types
ta: கணக்கு வகைகள்

# account_type_asset
source: Asset account
ta: சொத்து கணக்கு

# account_type_asset_plural
source: Asset accounts
ta: சொத்து கணக்குகள்

# account_type_bank
source: Bank account
ta: வங்கி கணக்கு

# account_type_bank_plural
source: Bank accounts
ta: வங்கி கணக்குகள்

# account_type_cash
source: Cash account
ta: பணக் கணக்கு

# account_type_cash_plural
source: Cash accounts
ta: பணக் கணக்குகள்

# account_type_ccard
source: Credit card
ta: கடன் அட்டை

# account_type_ccard_plural
source: Credit cards
ta: கடன் அட்டைகள்

# account_type_liability
source: Liabilities account
ta: பொறுப்பு கணக்கு

# account_type_liability_plural
source: Liabilities accounts
ta: பொறுப்பு கணக்குகள்

# already_defined
source: %1$s already defined
ta: %1$s ஏற்கனவே வரையறுக்கப்பட்டுள்ளது

source: Amount
ta: தொகை

# app_name
source: My Expenses
ta: எனது செலவுகள்

# backup_success
source: Database and preferences successfully written to "%1$s".
ta: தரவுத்தளம் மற்றும் விருப்பத்தேர்வுகள் "%1$s" க்கு வெற்றிகரமாக எழுதப்பட்டது.

source: Category
ta: வகை

# contrib_feature_ad_free_label
source: No ads
ta: விளம்பரங்கள் இல்லை

# contrib_feature_accounts_unlimited_label
source: Unlimited number of accounts
ta: கணக்குகளுக்கு வரம்பில்லை

# contrib_feature_attach_picture_label
source: Attach image to transaction
ta: பரிவர்த்தனையுடன் படத்தை இணைக்கலாம்

# contrib_feature_distribution_label
source: Pie chart (Distribution per category)
ta: பை விளக்கப்படம் (வகை ஒன்றுக்கு பங்கீடு)

# contrib_feature_plans_unlimited_label
source: Unlimited number of plans
ta: திட்டங்களுக்கு வரம்பில்லை

# contrib_feature_print_label
source: Export transaction list to PDF
ta: பரிவர்த்தனை பட்டியலை PDF ஆக ஏற்றுமதி

# contrib_feature_csv_import_label
source: CSV import
ta: CSV இறக்குமதி

# contrib_feature_split_template_label
source: Unlimited number of split templates
ta: வரம்பற்ற பிரிவு வார்ப்புருக்கள்

# contrib_feature_pro_support_label
source: <b>Email support</b> with guaranteed response within 2 business days
ta: 2 வணிக நாட்களுக்குள் உத்தரவாத பதிலுடன் <b> மின்னஞ்சல் ஆதரவு </b>

# contrib_feature_roadmap_voting_label
source: Voting right on <b>development roadmap</b>
ta: <b>மேம்பாட்டு திட்டத்தில்</b> வாக்களிக்கும் உரிமை

# contrib_feature_history_label
source: History chart
ta: வரலாற்று விளக்கப்படம்

# contrib_feature_category_tree_label
source: Arbitrarily deep category hierarchy
ta: தன்னிச்சையாக ஆழமான வகை வரிசைமுறை

# contrib_feature_synchronization_label
source: Cloud synchronization
ta: மேகக்கணினி ஒத்திசைவு

# licence_status_free
source: Free
ta: இலவசம்

source: Contrib Key
ta: பங்களிப்பு திறவுகோல்

source: Extended Key
ta: விரிவாக்கப்பட்ட திறவுகோல்

# contrib_key_requires
source: Requires %1$s.
ta: %1$s தேவைப்படுகிறது.

source: Currency
ta: நாணயம்

source: Current balance
ta: தற்போதைய இருப்பு

source: Date
ta: தேதி

source: Date format
ta: தேதி வடிவமைப்பு

# date_format_illegal
source: Illegal date format
ta: தவறான தேதி வடிவம்

# number_format_illegal
source: Illegal number format
ta: தவறான எண் வடிவம்

source: Decimal separator
ta: பதின்மம் பிரிப்பான்

# default_account_name
source: Budget Book
ta: வரவு செலவுத் திட்ட புத்தகம்

source: Description
ta: விளக்கம்

# dialog_balance_delete
source: Delete reconciled transactions
ta: நல்லிணக்கம் செய்யப்பட்ட பரிவர்த்தனைகளை நீக்குக

# dialog_confirm_discard_changes
source: Discard changes?
ta: மாற்றங்களை கைவிடவா?

# dialog_command_disabled_balance
source: No cleared transactions to be reconciled.
ta: ஒப்புக்கொள்ளப்பட்ட பரிவர்த்தனைகள் எதுவும் நல்லிணக்கம் செய்யப்பட வேண்டியதில்லை.

# dialog_command_disabled_insert_transfer
source: Transfer transactions require a second account.
ta: பரிமாற்ற பரிவர்த்தனைக்கு இரண்டாவது கணக்கு தேவை.

# dialog_contrib_reminder_remove_limitation
source: Remove this limitation and access more features by upgrading <i>{app_name}</i>.
ta: <i>{app_name}</i> ஐ மேம்படுத்துவதன் மூலம் இந்த வரம்பை நீக்கி கூடுதல் அம்சங்களை பெறலாம்.

# dialog_contrib_text_1
source: <i>{app_name}</i> is offered open source.
ta: <i>{app_name}</i> திறந்த மூல செயலியாக வழங்கப்படுகிறது.

# dialog_contrib_text_2
source: Please contribute by upgrading <i>{app_name}</i> and gain unrestricted access to the following features:
ta: <i>{app_name}</i> ஐ மேம்படுத்துவதன் மூலம் (தயவுசெய்து) பங்களித்து பின்வரும் அம்சங்களுக்கு வரம்பற்ற அணுகலைப் பெறவும்:

# dialog_contrib_trial_info
source: Your current licence status (%1$s) allows you to try %2$s for %3$d days (until %4$s).
ta: உங்கள் தற்போதைய உரிம நிலை (%1$s), %3$d நாட்களுக்கு %2$s பரிசோதிக்க தங்களை அனுமதிக்கிறது (%4$s வரை).

# dialog_contrib_trial_info_play
source: This free trial will never convert to any type of subscription.
ta: இந்த இலவச சோதனை எந்த வகை சந்தாவாகவும் மாற்றப்படாது.

# dialog_contrib_subscription_info_play
source: This subscription takes immediate effect, is billed monthly or yearly and can be cancelled any time.
ta: இந்தச் சந்தா உடனடியாக அமலுக்கு வரும், மாதாந்திரமாக அல்லது ஆண்டுதோறும் பில் செய்யப்படும், எந்த நேரத்திலும் ரத்துசெய்து கொள்ளலாம்.

# dialog_contrib_usage_limit_accounts
source: Your current licence status (%2$s) allows you to create %1$d accounts.
ta: உங்கள் தற்போதைய உரிம நிலை (%2$s) %1$d கணக்குகளை உருவாக்க உங்களை அனுமதிக்கிறது.

# dialog_contrib_usage_limit_plans
source: Your current licence status (%2$s) allows you to create %1$d plans.
ta: உங்கள் தற்போதைய உரிம நிலை (%2$s) உங்களை %1$d திட்டங்களை உருவாக்க உங்களை அனுமதிக்கிறது.

# dialog_contrib_usage_limit_split_templates
source: Your current licence status (%1$s) allows you to create 1 split template.
ta: உங்கள் தற்போதைய உரிம நிலை (%1$s) 1 பிரிவு வார்ப்புருவை உருவாக்க உங்களை அனுமதிக்கிறது.

# dialog_contrib_usage_limit_with_dialog
source: With your current licence status (%1$s), this dialogue will be displayed on every usage.
ta: உங்களின் தற்போதைய உரிம நிலையுடன் (%1$s), இந்த உரையாடல் பெட்டி ஒவ்வொரு பயன்பாட்டிலும் காட்டப்படும்.

# dialog_export_delete
source: Delete exported transactions
ta: ஏற்றுமதி செய்யப்பட்ட பரிவர்த்தனைகளை நீக்கு

# dialog_export_not_yet_exported
source: Export only transactions not yet exported
ta: ஏற்றுமதி செய்யப்படாத பரிவர்த்தனைகளை மட்டும் ஏற்றுமதி செய்

# dialog_password_activate_protection
source: Activate password protection
ta: கடவுச்சொல் பாதுகாப்பை செயல்படுத்து

# dialog_password_change_password
source: Change password
ta: கடவுச்சொல்லை மாற்று

# dialog_password_new_password
source: New password
ta: புதிய கடவுச்சொல்

# dialog_password_new_password_confirmation
source: New password (confirmation)
ta: புதிய கடவுச்சொல் (உறுதிப்படுத்தல்)

# dialog_remind_later
source: Later
ta: பின்னர்

# dialog_remind_rate_how_many_stars
source: How many stars would you give to {app_name}?
ta: {app_name} செயலிக்கு நீங்கள் எத்தனை நட்சத்திரங்கள் கொடுப்பீற்கள்?

# dialog_remind_rate_1
source: Please take a moment to rate and review {app_name}.
ta: {app_name} மதிப்பிடவும், மதிப்பாய்வு செய்யவும் ஒரு கணம் எடுத்துக்கொள்ளவும்.

# dialog_remind_rate_2
source: Your comments allow us to continually add improvements and enhancements.
ta: உங்கள் கருத்துகள், மேம்படுத்தல்களையும் விரிவாக்கங்களையும் தொடர்ந்து சேர்க்க எங்களை அனுமதிக்கிறது.

# dialog_remind_rate_1_suggest_improvement
source: Please take a moment to send us your suggestions for improvements.
ta: முன்னேற்றங்களுக்கான உங்கள் பரிந்துரைகளை அனுப்ப தயவு செய்து ஒரு கணம் எடுத்துக்கொள்ளவும்.

# dialog_remind_rate_yes
source: Rate now
ta: இப்போது மதிப்பிடு

# dialog_security_answer
source: Answer
ta: பதில்

# dialog_security_question
source: Question
ta: கேள்வி

# dialog_title_balance_account
source: Balance %1$s
ta: இருப்பு %1$s

# dialog_title_contrib_feature
source: Premium feature
ta: மதிப்பு அம்சம்

# dialog_title_warning_delete_account
source: Delete account?
ta: கணக்கை நீக்கவா?

# dialog_title_warning_delete_category
source: Delete category?
ta: வகையை நீக்கவா?

# dialog_title_warning_delete_template
source: Delete template?
ta: வார்ப்புருவை நீக்கவா?

# dialog_title_warning_delete_transaction
source: Delete transaction?
ta: பரிவர்த்தனையை நீக்கவா?

source: Expense
ta: செலவு

# export_sdcard_failure
source: Export to file "%1$s" failed: %2$s
ta: "%1$s" கோப்புக்கு ஏற்றுமதி செய்யதல் தோல்வியுற்றது: %2$s

# export_sdcard_success
source: Data successfully exported to file "%1$s"
ta: தரவு "%1$s" கோப்பிற்கு வெற்றிகரமாக ஏற்றுமதி செய்யப்பட்டது

source: Feedback
ta: பின்னூட்டம்

# ftp_uri_malformed
source: Malformed URI %1$s
ta: வடிவக்கேடுள்ள URI %1$s

# grisbi_import_categories_loading
source: Loading categories from %1$s
ta: %1$s இலிருந்து வகைகளை ஏற்றுகிறது

# grisbi_import_parties_loading
source: Loading parties from %1$s
ta: %1$s இலிருந்து தரப்புகளை ஏற்றுகிறது

# grouping_day
source: Day
ta: தினம்

# grouping_last_week
source: Last week
ta: கடந்த வாரம்

# grouping_month
source: Month
ta: மாதம்

# grouping_none
source: Ungrouped
ta: குழுவமைக்காதே

# grouping_this_week
source: This week
ta: இந்த வாரம்

# grouping_week
source: Week
ta: வாரம்

# grouping_year
source: Year
ta: ஆண்டு

# help_button_rate
source: Rate or review
ta: மதிப்பீடு அல்லது மதிப்பாய்வு செய்யுங்கள்

# help_heading_credits
source: Credits
ta: புகழாரம்

# help_heading_whats_new
source: What's new
ta: புதியது என்ன

# import_select_transactions
source: Transactions
ta: பரிவர்த்தனைகள்

source: Income
ta: வருமானம்

source: Label
ta: விவரத்துணுக்கு

# licence_validation_failure
source: Unable to validate licence key.
ta: உரிம திறவுகோலை சரிபார்க்க முடியவில்லை.

# licence_validation_success
source: Licence key successfully validated:
ta: உரிம திறவுகோல் வெற்றிகரமாக சரிபார்க்கப்பட்டது:

# licence_validation_premium
source: Premium features have been unlocked.
ta: மதிப்பு அம்சங்கள் திறக்கப்பட்டுள்ளன.

# menu_aggregates
source: Total
ta: மொத்தம்

# menu_apply_template
source: Apply
ta: பயன்படுத்து

# menu_back
source: Back
ta: பின்

# menu_backup
source: Backup
ta: காப்புப்பிரதி

# menu_balance
source: Balance account
ta: கணக்கை நேர்செய்

# menu_cancel_plan_instance
source: Cancel
ta: ரத்து

# menu_clone_transaction
source: Clone
ta: நகல் எடு

# menu_contrib
source: Contribute
ta: பங்களி

# menu_create_account
source: New account
ta: புதிய கணக்கு

# menu_create_instance_edit
source: Apply and edit
ta: பயன்படுத்து மற்றும் திருத்து

# menu_create_instance_save
source: Apply and save
ta: பயன்படுத்து மற்றும் சேமி

# menu_create_main_cat
source: New main category
ta: புதிய முக்கிய வகை

# menu_create_method
source: New payment method
ta: புதிய கட்டண முறை

# menu_create_party
source: New party
ta: புதிய தரப்பு

# menu_create_split
source: New split
ta: புதிய பிரிவு

# menu_create_split_part_category
source: New category split part
ta: புதிய வகை பிரிவு பகுதி

# menu_create_split_part_transfer
source: New transfer split part
ta: புதிய பரிமாற்ற பிரிவு பகுதி

# menu_create_sub_cat
source: New sub category
ta: புதிய துணை வகை

# menu_create_template
source: New template
ta: புதிய வார்ப்புரு

# menu_create_template_from_transaction
source: Save as template
ta: வார்ப்புருவாக சேமி

# menu_create_template_for_transaction
source: New transaction template
ta: புதிய பரிவர்த்தனை வார்ப்புரு

# menu_create_template_for_transfer
source: New transfer template
ta: புதிய பரிமாற்ற வார்ப்புரு

# menu_create_transaction
source: New Transaction
ta: புதிய பரிவர்த்தனை

# menu_create_transfer
source: New Transfer
ta: புதிய பரிமாற்றம்

# menu_delete
source: Delete
ta: நீக்கு

# menu_distribution
source: Distribution
ta: பரிமாற்றம்

# menu_edit
source: Edit
ta: திருத்து

# menu_edit_account
source: Edit Account
ta: கணக்கைத் திருத்து

# menu_edit_cat
source: Edit category
ta: வகையைத் திருத்து

# menu_edit_method
source: Edit payment method
ta: கட்டண முறையைத் திருத்து

# menu_edit_party
source: Edit party
ta: தரப்பைத் திருத்து

# menu_edit_plan_instance
source: Edit single plan occurrence
ta: ஒற்றைத் திட்டத்தின் நிகழ்வை திருத்து

# menu_edit_split
source: Edit split
ta: பிரிவைத் திருத்து

# menu_edit_split_part_category
source: Edit category split part
ta: வகை பிரிவு பகுதியைத் திருத்து

# menu_edit_split_part_transfer
source: Edit transfer split part
ta: பரிமாற்ற பிரிவு பகுதியைத் திருத்து

# menu_edit_template
source: Edit Template
ta: வார்ப்புருவைத் திருத்து

# menu_edit_transaction
source: Edit Transaction
ta: பரிவர்த்தனையைத் திருத்து

# menu_edit_transfer
source: Edit Transfer
ta: பரிமாற்றத்தைத் திருத்து

# menu_exclude_from_totals
source: Exclude from totals
ta: மொத்தத்திலிருந்து விலக்கு

# menu_forward
source: Forward
ta: முன் செல்

# menu_grouping
source: Grouping
ta: குழுக்கள்

# menu_help
source: Help
ta: உதவி

# menu_invert_transfer
source: Invert
ta: புரட்டு

# menu_manage_plans
source: Templates and plans
ta: வார்ப்புரு மற்றும் திட்டங்கள்

# menu_import
source: Import
ta: இறக்குமதி

# menu_reset
source: Export and reset
ta: ஏற்றுமதி செய் மற்றும் நிலை கொணர்

# menu_reset_all
source: Export and reset all
ta: அனைத்தையும் ஏற்றுமதி செய் மற்றும் நிலை கொணர்

# menu_reset_plan_instance
source: Reset
ta: நிலை கொணர்

# menu_save
source: Save
ta: சேமி

# menu_save_and_new
source: Save and new
ta: சேமி மற்றும் புதியதை தொடங்கு

# menu_share
source: Tell a friend
ta: நண்பனிடம் கூறு

# button_label_close
source: Close
ta: மூடு

# menu_split_transaction
source: Transform to split
ta: பிரிவாக மாற்று

# method
source: Payment method
ta: கட்டணம் செலுத்தும் முறை

source: No app handling email available.
ta: மின்னஞ்சல் கையாளும் செயலி ஏதும் இல்லை.

# no_app_handling_ftp_available
source: No app handling ftp available. Install <i>Send With FTP</i>?
ta: FTP கையாளும் செயலி ஏதும் இல்லை. <i>Send with FTP</i> நிறுவலாமா?

# no_app_handling_mime_type_available
source: No app handling %s files available.
ta: %s கோப்புகள் கையாளும் செயலி ஏதும் இல்லை.

source: No categories.
ta: வகைகள் ஏதுமில்லை.

# no_expenses
source: No Expenses Yet!
ta: இன்னும் செலவுகள் ஏதுமில்லை!

# no_exportable_expenses
source: There are no transactions that have not yet been exported.
ta: இதுவரை ஏற்றுமதி செய்யப்படாத பரிமாற்றங்கள் எதுவும் இல்லை.

source: No filemanager installed
ta: எந்த கோப்பு மேலாளரும் நிறுவப்படவில்லை

# no_calendar_app_installed
source: No app found for editing calendar event.
ta: நாட்காட்டி நிகழ்வைத் திருத்துவதற்கு எந்த செயலியும் இல்லை.

# image_capture_not_installed
source: No app found for taking picture.
ta: படம் எடுப்பதற்கான செயலி எதுவும் கிடைக்கவில்லை.

# no_mapped_transactions
source: No transactions have been mapped to categories during this period.
ta: இந்த காலகட்டத்தில் எந்த பரிமாற்றங்களும் வகைப்படுத்தப்படவில்லை.

# no_methods
source: No payment methods.
ta: கட்டண முறைகள் ஏதும் இல்லை.

source: No parties.
ta: தரப்புகள் ஏதும் இல்லை.

source: No split parts.
ta: பிரிவு பகுதிகள் ஏதும் இல்லை.

source: No templates.
ta: வார்ப்புருக்கள் ஏதும் இல்லை.

source: No accounts.
ta: கணக்குகள் இல்லை

# not_deletable_mapped_transactions
source: The selected object is mapped to a transaction and cannot be deleted.
ta: தேர்ந்தெடுக்கப்பட்ட பொருள் பரிவர்த்தனைக்கு மாப் செய்யப்பட்டது மற்றும் நீக்கப்பட முடியாது.

# not_deletable_mapped_templates
source: The selected object is mapped to a template and cannot be deleted.
ta: தேர்ந்தெடுத்த பொருள் ஒரு டெம்ப்ளேட்டிற்கு மாற்றப்பட்டது மற்றும் நீக்க முடியாது.

source: numbered
ta: எண்ணிடப்பட்ட

source: Opening balance
ta: ஆரம்ப இருப்பு

# parse_error_file_not_found
source: Could not find file %1$s
ta: கோப்பு %1$s -ஐ கண்டுபிடிக்க முடியவில்லை

# parse_error_grisbi_version_not_supported
source: Unsupported Grisbi File Version: %1$s
ta: ஆதரிக்கப்படாத Grisbi கோப்பு பதிப்பு: %1$s

# parse_error_other_exception
source: An error occurred: %1$s
ta: ஒரு பிழை ஏற்பட்டது: %1$s

# parse_error_parse_exception
source: Could not parse file
ta: கோப்பை பாகுபடுத்த முடியவில்லை

# password_disabled_reenable
source: The password protection has been disabled. You can reenable it in the settings.
ta: கடவுச்சொல் பாதுகாப்பு முடக்கப்பட்டுள்ளது. நீங்கள் அமைப்புகளில் இதை மீண்டும் இயக்கலாம்.

# password_lost
source: Lost password
ta: கடவுச்சொல்லை இழந்தீர்களா?

# password_not_valid
source: Password invalid. Try again!
ta: கடவுச்சொல் தவறானது. மீண்டும் முயற்சி செய்க!

# password_prompt
source: Enter your password
ta: உங்கள் கடவுச்சொல்லை பதிவிடவும்

# password_security_answer_not_valid
source: Wrong answer. Try again!
ta: தவறான பதில். மீண்டும் முயற்சி செய்க!

source: Payee
ta: பணம் பெறுபவர்

source: Payer
ta: பணம் செலுத்துபவர்

# payer_or_payee
source: Payee/Payer
ta: பணம் பெறுபவர்/செலுத்துபவர்

source: Plan
ta: திட்டம்

# plan_automatic
source: automatic
ta: தன்னியக்கமாக

# plan_calendar_name
source: {app_name} planner
ta: {app_name} இழைப்புளி

# planner_notification_channel_name
source: Planner
ta: இழைப்புளி

# plan_event_deleted
source: The plan associated with this template has been deleted from the calendar.
ta: இந்த வார்ப்புருவுடன் தொடர்புடைய திட்டம் நாட்காட்டியிலிருந்து நீக்கப்பட்டது.

source: Plan execution canceled
ta: திட்ட செயல்பாடு ரத்து செய்யப்ப்பட்டது

# planner_create_calendar_failure
source: Unable to create local planner calendar
ta: உள் திட்டக் நாட்காட்டியை உருவாக்க முடியவில்லை

# planner_create_calendar_success
source: Local planner calendar successfully created
ta: உள் திட்ட நாட்காட்டி வெற்றிகரமாக உருவாக்கப்பட்டது

# pm_cheque
source: Cheque
ta: காசோலை

# pm_creditcard
source: Credit card
ta: கடன் அட்டை

# pm_deposit
source: Deposit
ta: பணம் செலுத்து

# pm_directdebit
source: Direct debit
ta: நேரடி பற்று

# pm_type_credit
source: Credit
ta: வரவு

# pm_type_debit
source: Debit
ta: செலவு

# pm_type_neutral
source: Neutral
ta: நடுநிலை

# pref_app_dir_title
source: Folder for backups and exports
ta: காப்புப்பிரதி மற்றும் ஏற்றுமதிகளுக்கான கோப்புறை

# pref_auto_fill_summary
source: Fill in data from last transaction for same payee/payer
ta: அதே பணம் பெறுபவர்/செலுத்துபவர் எனும் பட்சத்தில் கடந்த பரிவர்த்தனையிலிருந்து தரவை நிரப்பு

# pref_backup_summary
source: Create a backup of database and preferences.
ta: தரவுதளம் மற்றும் விருப்பத்தேர்வுகளின் காப்புப்பிரதி உருவாக்குதல்.

# pref_sort_order_usages
source: Count of usages
ta: பயன்பாடுகளின் எண்ணிக்கை

# pref_category_title_export
source: Export
ta: ஏற்றுமதி

# pref_category_title_import
source: Import
ta: இறக்குமதி

# pref_category_title_manage
source: Manage
ta: நிர்வகி

# pref_category_title_more_information
source: More information
ta: மேலும் தகவல்

# pref_category_title_ui
source: User interface
ta: பயனர் இடைமுகம்

# pref_contrib_purchase_title_upgrade
source: Upgrade key
ta: திறவுகோலை மேம்படுத்துதல்

# pref_custom_currency_title
source: Customize currencies
ta: நாணயங்களைத் தனி விருப்பமாக்குதல்

# pref_enter_licence_title
source: Enter key
ta: திறவுகோலை உள்ளிடவும்

# pref_export_format_title
source: Data format
ta: தரவு வடிவம்

# pref_import_from_grisbi_summary
source: Import categories and parties from Grisbi XML file
ta: Grisbi XML கோப்பிலிருந்து வகைகள் மற்றும் தரப்புகளை இறக்குமதி செய்

# pref_import_from_grisbi_title
source: Import from Grisbi
ta: Grisbi-யிலிருந்து இறக்குமதி செய்

# pref_import_summary
source: Import transactions, categories and parties from %s file
ta: %s கோப்பில் இருந்து பரிவர்த்தனைகள், வகைகள் மற்றும் தரப்புகளை இறக்குமதி செய்

# pref_import_title
source: %s import
ta: %s இறக்குமதி

# pref_news_title
source: News
ta: செய்தி

# pref_manage_accounts_title
source: Accounts
ta: கணக்குகள்

# pref_manage_categories_summary
source: Add, edit, delete categories.
ta: வகைகளை புதிதாக சேர், திருத்து, நீக்கு.

# pref_manage_categories_title
source: Categories
ta: வகைகள்

# pref_manage_methods_summary
source: Create and edit payment methods and associate them with account types.
ta: கட்டண முறைகளை உருவாக்கி மற்றும் திருத்தி அவற்றை கணக்கு வகைகளுடன் இணைக்கவும்.

# pref_manage_methods_title
source: Payment methods
ta: கட்டணம் செலுத்தும் முறைகள்

# pref_manage_parties_summary
source: Add, edit, delete parties (payers and payees).
ta: தரப்புகளை (பணம் செலுத்துபவர் மற்றும் பெறுபவர்) சேர், திருத்து, நீக்கு.

# pref_manage_parties_title
source: Parties
ta: தரப்புகள்

# pref_manage_sync_backends_title
source: Synchronization backends
ta: ஒத்திசைவு பின்தளங்கள்

# pref_manage_sync_backends_summary
source: Add backends for synchronizing accounts (%s).
ta: கணக்குகளை (%s) ஒத்திசைக்க பின்தளங்களை சேர்க்கவும்.

# pref_more_info_dialog_title
source: Licence & Credits
ta: உரிமம் & புகழாரம்

# pref_password_not_equal
source: Passwords do not match
ta: கடவுச்சொற்கள் பொருந்தவில்லை

# pref_perform_share_title
source: Share exports and backups
ta: ஏற்றுமதி மற்றும் காப்புப்பிரதிகளை பகிர்

# pref_planning_calendar_create_local
source: Create new local planning calendar
ta: புதிய உள் திட்டக் நாட்காட்டியை உருவாக்கவும்

# pref_planning_calendar_summary
source: Select the calendar where plans for future and recurring transactions are stored
ta: எதிர்காலத்திற்கான திட்டங்கள் மற்றும் மீண்டும் நிகழ்கின்ற பரிவர்த்தனைகள் சேமிக்கப்படும் நாட்காட்டியைத் தேர்ந்தெடுக்கவும்

# pref_protection_delay_seconds_summary
source: Idle seconds before app will be locked by password.
ta: கடவுச்சொல் மூலம் செயலி பூட்டப்படுவதற்கு முன் செயலற்று இருக்க வேண்டிய விநாடிகள்

# pref_protection_delay_seconds_title
source: Delay until protection
ta: பாதுகாப்பிற்கு முன் இருக்க வேண்டிய தாமதம்

# pref_protection_enable_data_entry_from_widget_title
source: Data entry from widgets and shortcuts
ta: நிரல் பலகைகள் மற்றும் குறுக்குவழிகளில் இருந்து தரவு உள்ளீடு

# pref_protection_enable_data_entry_from_widget_summary_on
source: Allowed without password.
ta: கடவுச்சொல் இல்லாமல் அனுமதி.

# pref_protection_enable_data_entry_from_widget_summary_off
source: Password is required.
ta: கடவுச்சொல் தேவை.

# pref_qif_export_file_encoding_title
source: Character encoding
ta: எழுத்து குறியேற்றம்

# pref_restore_summary
source: Select a backup for restoring database and preferences.
ta: தரவுத்தளங்கள் மற்றும் விருப்பத்தேர்வுகளை மீட்டமைப்பதற்கு காப்புப்பிரதி ஒன்றைத் தேர்ந்தெடுக்கவும்.

# pref_restore_title
source: Restore
ta: மீட்டமைப்பு

# pref_security_question_summary
source: Allows you to unlock the app, if you have forgotten your password.
ta: உங்கள் கடவுச்சொல்லை மறந்துவிட்டால், செயலியைத் திறக்க உங்களை அனுமதிக்கும்.

# pref_security_question_title
source: Security question
ta: பாதுகாப்பு கேள்வி

# pref_send_feedback_title
source: Send feedback
ta: கருத்தினை அனுப்பவும்

# pref_share_target_summary
source: Leave empty if you want to choose between appropriate apps (Email, Dropbox, Google Docs, …), or provide URL in one of the supported schemes
ta: உரிய செயலிகளின் (மின்னஞ்சல், டிராப்பாக்ஸ், கூகுள் டாக்ஸ், …) இடையே தேர்வு செய்ய விரும்பினால் காலியாக விடவும் அல்லது ஆதரிக்கப்படும் திட்டங்களில் ஒன்றின்படி உரலி வழங்கவும்

# pref_share_target_title
source: Upload URL
ta: பதிவேற்ற உரலி

# pref_shortcut_added
source: Shortcut has been added to Home Screen
ta: முகப்பு திரைக்கு குறுக்குவழி சேர்க்கப்பட்டது

# pref_shortcut_not_added
source: No Home Screen available that accepts shortcuts.
ta: குறுக்குவழிகளை ஏற்றுக்கொள்வதற்கான எந்த முகப்பு திரைகளும் கிடைக்கவில்லை.

# pref_shortcut_summary
source: Add the shortcut to Home Screen.
ta: முகப்பு திரைக்கு குறுக்குவழியைச் சேர்க்கவும்.

# pref_ui_home_screen_shortcuts
source: Home Screen Shortcuts
ta: முகப்பு திரை குறுக்குவழிகள்

# pref_ui_language_title
source: Language
ta: மொழி

# pref_ui_theme_dark
source: Dark
ta: இருட்டு

# pref_ui_theme_light
source: Light
ta: வெளிச்சம்

# pref_ui_theme_title
source: Theme
ta: பின்புலத்தோற்றம்

# pref_visit_website_summary
source: Changelog and FAQ
ta: மாற்றக் குறிப்பு மற்றும் அடிக்கடி கேட்கப்படும் கேள்விகள்

# pref_visit_website_title
source: Visit Website
ta: வலைத்தளத்தைப் பார்க்கவும்

# progress_dialog_deleting
source: Deleting objects
ta: பொருட்கள் நீக்கப்படுகிறது

# progress_dialog_printing
source: Generating %s
ta: %s உருவாக்கப்படுகிறது

# qif_parse_result
source: Parsed: %1$s accounts; %2$s categories and %3$s parties
ta: பாகுபடுத்தப்பட்டவை: %1$s கணக்குகள்; %2$s வகைகள் மற்றும் %3$s தரப்புகள்

# qif_parse_failure_found_multiple_accounts
source: Multiple accounts found in %s file.
ta: %s கோப்பில் பல கணக்குகள் கண்டுபிடிக்கப்பட்டன.
