Repository: 247i/TACETr
Catalog: உரை/தானி/*-expenses-strings-*.po
Languages: ta

# warning_synchronization_select_parent
source: The folder you have selected corresponds to one account of an existing backend. You need to select its parent folder in order to reuse this backend.
ta: நீங்கள் தேர்ந்தெடுத்திற்கும் கோப்புறை ஏற்கனவே இருக்கும் ஒரு பின்தளத்தின் ஒரு கணக்குடன் ஒத்துள்ளது. இந்த பின்தளத்தை மறுபயன்பாடு செய்ய, அதன் மூலக் கோப்புறையை நீங்கள் தேர்ந்தெடுக்க வேண்டும்.

# link_account_failure_2
source: An account with the same uuid already exists on the remote backend.
ta: தொலைநிலை பின்தளத்தில் அதே uuid கொண்ட ஒரு கணக்கு ஏற்கனவே உள்ளது.

# link_account_failure_3
source: The conflict can be resolved manually from the entry's context menu.
ta: இந்த முரண்பாட்டை உள்ளீட்டின் சூழல் பட்டியலில் இருந்து கைமுறையாக தீர்க்க முடியும்.

# progress_dialog_checking_sync_backend
source: Verifying backend
ta: பின்தளத்தை உறுதிப்படுத்துகிறது

source: Template
ta: வார்ப்புரு

# all_contrib_key_features
source: All features of Contrib Key
ta: பங்களிப்பு திறவுகோலின் அனைத்து அம்சங்கள்

# all_extended_key_features
source: All features of Extended Key
ta: விரிவாக்கப்பட்ட திறவுகோலின் அனைத்து அம்சங்கள்

source: Buy
ta: வாங்க

# pref_backup_cloud_summary
source: In addition to local storage on the device, the backup file can be copied to a remote backend.
ta: காப்புப்பிரதி கோப்பை, கருவியில் உள்ள உள்சேமிப்புக்கு கூடுதலாக ஒரு தொலை பின்தளத்திற்கு நகலெடுத்துக் கொள்ளலாம்.

# auto_backup_cloud_success
source: Backup file %1$s has been successfully stored on backend %2$s.
ta: காப்புப்பிரதி கோப்பு %1$s, %2$s எனும் பின்தளத்தில் வெற்றிகரமாக சேமிக்கப்பட்டது.

source: Number of fraction digits
ta: பின்ன இலக்கங்களின் எண்ணிக்கை

# warning_auto_backup_deactivated
source: Auto-backup has been deactivated. You can turn it on again from the settings after solving the problem (e.g. selecting a different folder for backups).
ta: தன்னியக்க காப்புப்பிரதி எடுத்தல் செயலிழக்கப்பட்டது. சிக்கலைத் தீர்த்த பிறகு (எ.கா. காப்புப்பிரதிகளுக்காக வேறு கோப்புறையைத் தேர்ந்தெடுத்தல்) நீங்கள் அதை மீண்டும் அமைப்புகளிலிருந்து செயல்படச் செய்ய முடியும்.

# pref_tracking_summary
source: Allow us to collect anonymous data about usage patterns that helps us plan improvements.
ta: மேம்படுத்தல்களைத் திட்டமிட உதவுவதற்கு, பயன்பாட்டு முறைகள் பற்றிய அடையாளமற்ற தரவை சேகரிக்க எங்களுக்கு அனுமதி அளிக்கவும்.

# pref_tracking_title
source: Usage data collection
ta: பயன்பாட்டு தரவு சேகரிப்பு

# sync_database_error
source: A database error occurred during synchronization.
ta: ஒத்திசைவின் போது தரவுத்தள பிழை ஏற்பட்டது.

# sync_io_error_cannot_connect
source: Cannot connect to synchronization backend.
ta: ஒத்திசைவு பின்தளத்துடன் இணைக்க முடியவில்லை.

# sync_error_will_try_again_later
source: Will try again later.
ta: பின்னர் மீண்டும் முயற்சி செய்யப்படும்.

# sync_io_exception_reset_account_data
source: Error while resetting remote account.
ta: தொலைநிலை கணக்கை நிலை கொணரும்போது பிழை ஏற்பட்டது.

# sync_success_reset_account_data
source: Remote data for account %s has been deleted.
ta: %s கணக்கிற்கான தொலைநிலை தரவு நீக்கப்பட்டது.

# sync_io_exception_setup_remote_account
source: Error while setting up remote account.
ta: தொலைநிலை கணக்கை அமைக்கும்போது பிழை ஏற்பட்டது.

# sync_io_exception_syncing
source: Error while syncing changes with server.
ta: சேவையகத்துடன் மாற்றங்களை ஒத்திசைக்கும்போது பிழை ஏற்பட்டது.

# sync_io_exception_unlocking
source: Error while removing lock from remote backend.
ta: தொலை பின்தளத்தில் இருந்து பூட்டை அகற்றும்போது பிழை ஏற்பட்டது.

# sync_io_exception_locking
source: Remote backend is locked or cannot be locked.
ta: தொலை பின்தளம் பூட்டப்பட்டுள்ளது அல்லது அதை பூட்ட முடியவில்லை.

# synchronization_start
source: Starting synchronization for account %s.
ta: %s கணக்கிற்கான ஒத்திசைவு தொடங்குகிறது.

# synchronization_end_success
source: %1$d remote changes were written to local database. %2$d local changes were written to remote backend.
ta: %1$d தொலைநிலை மாற்றங்கள் உள் தரவுத்தளத்தில் எழுதப்பட்டன. %2$d உள் மாற்றங்கள் தொலைநிலை பின்தளத்தில் எழுதப்பட்டன.

# synchronization_end_success_none
source: No changes to synchronize.
ta: ஒத்திசைக்க மாற்றங்களும் ஏதும் இல்லை.

# pref_webdav_timeout_title
source: WebDAV Timeout (in seconds)
ta: WebDAV காலாவதி நேரம் (நொடிகளில்)

# sync_state_restored
source: Sync state was restored for %d accounts.
ta: %d கணக்குகளுக்கான ஒத்திசைவு நிலை மீட்டமைக்கப்பட்டது.

# sync_state_could_not_be_restored
source: Sync state could not be restored for %d accounts.
ta: %d கணக்குகளுக்குக்கான ஒத்திசைவு நிலையை மீட்டமைக்க முடியவில்லை.

# onboarding_ui_title
source: {app_name} adapts to your preference
ta: {app_name} உங்கள் விருப்பத்திற்கு ஏற்ப, மாறிக் கொள்ளும்

# onboarding_data_title
source: Let's set up your first account
ta: உங்கள் முதல் கணக்கை அமைப்போம்

# onboarding_restore_from_cloud
source: Restore from cloud synchronization
ta: மேகக்கணினி ஒத்திசைவிலிருந்து மீட்டமை

# onboarding_restore_from_local
source: Restore local backup file
ta: உள் காப்புப்பிரதி கோப்பை மீட்டமை

# contributed_by
source: Contributed by %s
ta: %s-ஆல் பங்களிக்கப்பட்டது

# pref_sync_notification_summary
source: Notify about synchronization progress
ta: ஒத்திசைவின் முன்னேற்றம் பற்றி தெரிவிக்கவும்

# pref_debug_logging_summary
source: Write debugging information into system log
ta: கணினி குறிப்பில் பிழைத்திருத்த உதவும் தகவல்களை எழுதவும்

# plan_custom_recurrence_info
source: Please save the template first. The plan will then be opened in the calendar app, where you can set a custom recurrence.
ta: முதலில் வார்ப்புருவை சேமியுங்கள். நாட்காட்டி செயலியில் திட்டம் திறக்கப்படும், அங்கு நீங்கள் தனி விருப்ப மறுநிகழ்வை அமைக்கலாம்.

# menu_create_template_for_split
source: New split template
ta: புதிய பிரிவு வார்ப்புரு

# progress_validating_licence
source: Validating licence
ta: உரிமம் சரிபார்க்கப்படுகிறது

# licence_validation_error_expired
source: Licence expired
ta: உரிமம் காலாவதியானது

# licence_validation_error_device_limit_exceeded
source: Device limit exceeded. Please remove licence from another device.
ta: கருவிகளின் வரம்பு மீறப்பட்டது. தயவு செய்து மற்றொரு சாதனத்திலிருந்து உரிமத்தை அகற்றவும்.

# button_validate
source: Validate
ta: சரிபார்

source: Licence Key
ta: உரிம திறவுகோல்

# licence_removal_information
source: If you no longer need premium functionality on this device, you can remove the licence key. This frees the key for activation on one more other device. The key can be activated on up to %d devices.
ta: இந்த கருவியில் இனி மதிப்பு செயல்பாடுகள் தேவையில்லை என்றால், நீங்கள் உரிம திறவுகோலை அகற்றலாம். இது மேலும் ஒரு கருவியில் செயல்படுத்துவதற்கு திறவுகோலை விடுவிக்கிறது. திறவுகோலை %dகருவிகளில் செயல்படுத்தலாம்.

# progress_removing_licence
source: Removing licence
ta: உரிமம் அகற்றப்படுகிறது

# licence_removal_success
source: Licence key was successfully freed from this device.
ta: இந்த கருவியிலிருந்து உரிம திறவுகோல் வெற்றிகரமாக விடுவிக்கப்பட்டது.

source: Professional Key
ta: நிபுணத்துவ திறவுகோல்

# n_months
source: %d months
ta: %d மாதங்கள்

# eu_vat_info
source: For residents of the European Union prices displayed do not include VAT.
ta: ஐரோப்பிய ஒன்றியத்தில் வாழ்பவர்களுக்கு, காட்டப்படும் விலை VAT சேர்க்கப்படாதது.

# valid_until
source: Until %s
ta: %s வரை

# extend_until
source: Extend until %1$s for %2$s
ta: %2$sசெலவில் %1$s வரை நீட்டிக்கவும்

# extended_upgrade_goodie_github
source: Additional %d months are granted once to users who already own the Extended Licence
ta: விரிவாக்கப்பட்ட திறவுகோலை சொந்தமாகக் கொண்ட பயனர்களுக்கு கூடுதலாக %d மாதங்கள் வழங்கப்படுகிறது

# switch_to_yearly
source: Switch to yearly subscription
ta: வருடாந்திர சந்தாவிற்கு மாறவும்

# switch_to_monthly
source: Switch to monthly subscription
ta: மாதாந்திர சந்தாவிற்கு மாறவும்

source: Extend validity
ta: செல்லுபடியாகும் காலத்தை நீட்டு

# progress_dialog_fetching_data_from_sync_backend
source: Fetching data from remote backend. This may take some time.
ta: தொலை பின்தளத்தில் இருந்து தரவைப் பெறுகிறது. இதற்கு சிறிது நேரம் ஆகலாம்.

# donate_button_invoice
source: Invoice
ta: விலைப்பட்டியல்

# auto_fill_account_from_aggregate_only
source: Only when started from aggregate account.
ta: மொத்த கணக்கிலிருந்து தொடங்கும்போது மட்டுமே.

# sync_auth_exception
source: Authorization failed.
ta: அதிகாரமளிப்பு தோல்வியடைந்தது.

# sync_login_again
source: Please log in again.
ta: தயவு செய்து மீண்டும் புகுபதிகை செய்க.

# delete_success
source: One object was successfully deleted.
ta: ஒரு பொருள் வெற்றிகரமாக நீக்கப்பட்டது.

# feature_deprecated
source: Deprecated
ta: கைவிடப்பட்டது

# pref_protection_device_lock_screen_title
source: Device lock screen
ta: கருவியின் பூட்டு திரை

# pref_warning_only_one_protection
source: Before you can use protection by %1$s, you must switch off protection by %2$s.
ta: நீங்கள் %1$s மூலம் பாதுகாப்பைப் பயன்படுத்தும் முன், %2$s மூலம் பாதுகாப்பை நிறுத்த வேண்டும்.

# warning_device_lock_screen_not_set_up_1
source: Secure device lock screen hasn't been set up.
ta: பாதுகாப்பான கருவி பூட்டு திரை அமைக்கப்படவில்லை.

# warning_device_lock_screen_not_set_up_2
source: Go to %s to set up a lock screen.
ta: %s;-க்கு சென்று ஒரு பூட்டு திரையை அமைக்கவும்.

# menu_history_show_balance
source: Show balance
ta: இருப்பை காட்டு

# menu_history_transfers
source: Include transfers
ta: பரிமாற்றங்களை உள்ளடக்கு

# menu_history
source: History
ta: வரலாறு

# history_chart_out_label
source: Expenditure
ta: செலவு

# history_chart_in_label
source: Revenue
ta: வருமானம்

# menu_history_totals
source: Show totals
ta: மொத்தத்தைக் காட்டு

# pref_home_currency_title
source: Home currency
ta: வீட்டு நாணயம்

source: Grand total
ta: ஆக மொத்தம்

# menu_original_amount
source: Original amount
ta: அசல் தொகை

# menu_equivalent_amount
source: Equivalent amount
ta: நிகரான தொகை

# warning_split_transactions
source: The selected transactions will be grouped into one split transaction. Their date information will be lost, i.e. replaced by their average.
ta: தேர்ந்தெடுக்கப்பட்ட பரிவர்த்தனைகள் ஒரு பிரிவு பரிவர்த்தனையாக குழுவமைக்கப்படும். அவைகளின் தேதி விவரம் இழக்கப்படும், அதாவது அவைகளின் சராசரியாக மாற்றப்படும்.

# warning_ungroup_split_transactions
source: The selected split transactions will be ungrouped, i.e. their split parts will become normal transactions.
ta: தேர்ந்தெடுக்கப்பட்ட பிரிவு பரிவர்த்தனைகள் கலைக்கப்படும், அதாவது அவற்றின் பிளவுப் பகுதிகள் சாதாரண பரிவர்த்தனைகளாக மாற்றப்படும்.

# menu_ungroup_split_transaction
source: Ungroup split
ta: பிரிவை கலை

# ungroup_split_transaction_success
source: Split Transaction was successfully ungrouped.
ta: பிளவு பரிவர்த்தனை வெற்றிகரமாக கலைக்கப்பட்டது.

# split_transaction_one_success
source: Transaction successfully transformed to split.
ta: பரிவர்த்தனை வெற்றிகரமாக பிரிவாக மாற்றப்பட்டது.

# split_transaction_group_success
source: %1$d transactions were successfully grouped into one split transaction.
ta: %1$d பரிவர்த்தனைகள் ஒரு பிரிவு பரிவர்த்தனையாக வெற்றிகரமாக குழுவமைக்கப்பட்டது.

# split_transaction_not_possible
source: Only transactions that have same account, payee, and status can be grouped into one split transaction.
ta: ஒரே கணக்கு, பணம் பெறுபவர் மற்றும் நிலை கொண்ட பரிவர்த்தனைகளை மட்டுமே ஒரே பிரிவு பரிவர்த்தனையாக குழுவமைக்க முடியும்.

# pref_transaction_time_summary
source: Allow to set exact transaction time.
ta: சரியான பரிவர்த்தனை நேரத்தை அமைக்க அனுமதி.

# pref_value_date_summary
source: Allow to set value date in addition to booking date. Transaction time will be hidden. This setting is not applied to cash accounts.
ta: பதிவு தேதிக்கு கூடுதலாக மதிப்பு தேதியை அமைக்க அனுமதி. பரிவர்த்தனை நேரம் மறைக்கப்படும். இந்த அமைப்பு பண கணக்குகளில் பயன்படுத்தப்படாது.

source: Booking date
ta: பதிவு தேதி

source: Value date
ta: மதிப்பு தேதி

# licence_expires_n_days
source: Your professional key will expire in %d days.
ta: உங்கள் நிபுணத்துவ திறவுகோல் இன்னும் %d நாட்களில் காலாவதியாகிறது.

# licence_expires_tomorrow
source: Your professional key will expire tomorrow.
ta: உங்கள் நிபுணத்துவ திறவுகோல் நாளை காலாவதியாகிறது.

# licence_expires_today
source: Your professional key expires today.
ta: உங்கள் நிபுணத்துவ திறவுகோல் இன்று காலாவதியாகிறது.

# licence_expired_yesterday
source: Your professional key has expired yesterday.
ta: உங்கள் நிபுணத்துவ திறவுகோல் நேற்று காலாவதியாகிவிட்டது.

# licence_has_expired_n_days
source: Your professional key has expired %d days ago.
ta: உங்கள் நிபுணத்துவ திறவுகோல் %d நாட்களுக்கு முன்பு காலாவதியாகிவிட்டது.

# gdpr_consent_button_no
source: Pay for the ad-free version
ta: விளம்பரம் இல்லாத பதிப்பிற்கு பணம் செலுத்து

source: Sort order
ta: வரிசைப்படுத்தும் முறை

# navigation_drawer_accounts_title
source: Manage accounts
ta: கணக்குகளை நிர்வகி

# pref_sync_wifi_only_summary
source: Sync only when on Wi-Fi
ta: Wi-Fi இல் மட்டுமே ஒத்திசை

# pref_sync_changes_immediately_summary
source: Write local changes immediately to backend
ta: உள் மாற்றங்களை உடனடியாக பின்தளத்திற்கு எழுதவும்

# synchronization_postponed
source: Synchronization is postponed.
ta: ஒத்திசைவு தள்ளி வைக்கப்படுகிறது.

# pref_translation_title
source: Translation
ta: மொழிபெயர்ப்பு

# goal_or_limit
source: Goal / Limit
ta: இலக்கு / வரம்பு

source: Saving goal
ta: சேமிப்பு இலக்கு

source: Credit limit
ta: கடன் வரம்பு

source: Clear all filters
ta: அனைத்து வடிப்பான்களையும் நீக்கு

# pref_scroll_to_current_date_title
source: Scroll transaction list to current date
ta: தற்போதைய தேதிக்கு பரிவர்த்தனை பட்டியலை உருட்டவும்

# pref_scroll_to_current_date_app_launch
source: only when app launches
ta: பயன்பாடு தொடங்கும்போது மட்டுமே

# pref_scroll_to_current_date_account_open
source: every time you navigate to account
ta: ஒவ்வொரு முறையும் நீங்கள் கணக்கில் செல்லும்போது

# menu_budget
source: Budgeting
ta: வரவு செலவுத் திட்டம்

# dialog_title_edit_budget
source: Edit budget
ta: வரவு செலவுத் திட்டத்தை தொகு

# budget_table_header_budgeted
source: Budgeted
ta: திட்டமிடப்பட்டது

# budget_table_header_allocated
source: Allocated
ta: ஒதுக்கப்பட்டது

# budget_table_header_spent
source: Spent
ta: செலவிடப்பட்டது

# budget_table_header_overspent
source: Overspent
ta: அதிகப்படியான

# budget_allocated_amount
source: Allocated amount
ta: ஒதுக்கீடு செய்யப்பட்ட தொகை

# budget_exceeded_error_1_1
source: All but %s of your budget has been allocated to other categories.
ta: நீங்கள் திட்டமிட்ட தொகையில் %s போக அனைத்தும் மற்ற வகைகளுக்கு ஒதுக்கப்பட்டுள்ளது.

# budget_exceeded_error_1_2
source: All your budget has been allocated to other categories.
ta: நீங்கள் திட்டமிட்ட தொகை அனைத்தும் மற்ற வகைகளுக்கு ஒதுக்கப்பட்டுள்ளது.

# budget_exceeded_error_2
source: Increase the budgeted amount, or remove money from other categories.
ta: திட்டமிடப்பட்ட தொகையை அதிகரிக்கவும் அல்லது பிற வகைகளிலிருந்து பணத்தை நீக்கவும்.

# budget_under_allocated_error
source: %s have already been allocated to categories. Unless you remove money from them, you must at least budget that amount.
ta: %s ஏற்கனவே வகைகளுக்கு ஒதுக்கப்பட்டுள்ளது. நீங்கள் அவைகளிலிருந்து பணத்தை நீக்காத பட்சத்தில், குறைந்த பட்சம் அந்த தொகையையாவது திட்டமிட வேண்டும்.

# sub_budget_exceeded_error_1_1
source: All but %s of the amount allocated to the main category has been allocated to other sub-categories.
ta: முக்கிய வகைக்கு ஒதுக்கப்பட்டத் தொகையில் %s போக அனைத்தும் மற்ற துணை வகைகளுக்கு ஒதுக்கப்பட்டுள்ளது.

# sub_budget_exceeded_error_1_2
source: All the amount allocated to the main category has been allocated to other sub-categories.
ta: முக்கிய வகைக்கு ஒதுக்கப்பட்டத் தொகை அனைத்தும் மற்ற துணை வகைகளுக்கு ஒதுக்கப்பட்டுள்ளது.

# sub_budget_exceeded_error_2
source: Increase the amount allocated to the main category, or remove money from other sub-categories.
ta: முக்கிய வகைக்கு ஒதுக்கப்பட்டத் தொகையை அதிகரிக்கவும் அல்லது பிற துணை வகைகளிலிருந்து பணத்தை நீக்கவும்.

# sub_budget_under_allocated_error
source: %s have already been allocated to sub-categories. Unless you remove money from them, you must at least allocate that amount to the main category.
ta: %s ஏற்கனவே துணை வகைகளிளுக்கு ஒதுக்கப்பட்டுவிட்டன. நீங்கள் அவைகளிலிருந்து பணத்தை நீக்காத பட்சத்தில், குறைந்த பட்சம் அந்த தொகையையாவது முக்கிய வகைக்கு திட்டமிட வேண்டும்.

# content_description_clear_method
source: Clear method
ta: முறையை நீக்கு

# content_description_clear_category
source: Clear category
ta: வகையை நீக்கு

# content_description_remove_icon
source: Remove icon
ta: சின்னத்தை நீக்கு

# currency_code
source: Code
ta: குறியீடு

# dialog_title_new_currency
source: New currency
ta: புதிய நாணயம்

# currency_code_already_definded
source: Currency code is already defined.
ta: நாணய குறியீடு ஏற்கனவே வரையறுக்கப்பட்டுள்ளது.

# currency_still_used
source: Currency is in use, cannot be deleted.
ta: நாணயமானது பயன்பாட்டில் உள்ளது, நீக்க முடியாது.

source: Unmapped
ta: தொடற்பு படுத்தப்படாதது

# unmapped_filter_only_single
source: 'Unmapped' filter cannot be included into multiple selection
ta: 'தொடற்பு படுத்தப்படாதது' வடிப்பானை பல தேர்வுகளில் சேர்க்க முடியாது

# pref_security_export_passphrase_title
source: Passphrase for backups
ta: காப்புப்பிரதிகளுக்கான கடவுச்சொற்றொடர்

# pref_security_export_passphrase_summary
source: Backups will be encrypted with this passphrase
ta: இந்த கடவுச்சொற்றொடரை கொண்டு காப்புப்பிரதிகள் மறையாக்கம் செய்யப்படும்

# backup_is_encrypted
source: The backup file is encrypted. In order to decrypt it, you need to specify its passphrase.
ta: காப்புப்பிரதி கோப்பு மறையாக்கப்பட்டுள்ளது. அதை மறையீடு நீக்க, நீங்கள் அதன் கடவுச்சொற்றொடரை குறிப்பிட வேண்டும்.

# backup_wrong_password
source: The backup file seems encrypted with a different passphrase.
ta: காப்புப்பிரதி கோப்பு வேறு கடவுச்சொல்லைக் கொண்டு மறையாக்கப்பட்டுள்ளது போல தெரிகிறது.

# passphrase_for_synchronization
source: Enter a passphrase, if you want synchronization data on this backend to be encrypted.
ta: இந்த பின்தளத்தில் உள்ள ஒத்திசைவுத் தரவை மறையாக்க வேண்டுமெனில் கடவுச்சொற்றொடரை உள்ளிடவும்.

# sync_backend_is_encrypted
source: Remote backend is encrypted. You need to specify a passphrase.
ta: தொலை பின்தளம் மறையாக்கம் செய்யப்பட்டது. நீங்கள் கடவுச்சொற்றொடரை குறிப்பிட வேண்டும்.

# sync_backend_wrong_passphrase
source: Remote backend seems encrypted with a different passphrase.
ta: தொலை பின்தளம் வேறு கடவுச்சொற்றொடரைக் கொண்டு மறையாக்கப்பட்டுள்ளது போல தெரிகிறது.

# sync_backend_is_not_encrypted
source: Remote backend is not encrypted.
ta: தொலை பின்தளம் மறையாக்கப்படவில்லை.

# warning_backup_protected
source: The archive will be protected by your passphrase.
ta: இந்த ஆவணக்கிடங்கு உங்கள் கடவுச்சொற்றொடரால் பாதுகாக்கப்படும்.

# input_label_passphrase
source: Passphrase
ta: கடவுச்சொற்றொடர்

# button_label_no_encryption
source: Without encryption
ta: மறையாக்கம் இல்லாமல்

# joining_or
source: or
ta: அல்லது

# menu_close
source: Close
ta: மூடு

# menu_reopen
source: Reopen
ta: மீண்டும் திற

# menu_hidden_accounts
source: Hidden accounts
ta: மறைக்கப்பட்ட கணக்குகள்

# content_description_closed
source: Closed
ta: மூடப்பட்டது

# warning_synced_account_cannot_be_closed
source: An account that is linked to a synchronization backend cannot be closed
ta: ஒத்திசைவு பின்தளத்துடன் இணைக்கப்பட்ட கணக்கை மூட முடியாது

source: Translated by
ta: இவர்களால் மொழிபெயர்க்கப்பட்டது

# warning_no_account
source: At least one account must be visible and open in order to create new transactions.
ta: புதிய பரிவர்த்தனைகளை உருவாக்க குறைந்தபட்சம் ஒரு கணக்காவது மறைக்கபடாமலோ அல்லது மூடப்படாமலோ இருக்க வேண்டும்.

# content_description_dates_are_linked
source: Booking date and value date are updated together
ta: பதிவு தேதி மற்றும் மதிப்பு தேதி ஒன்றாக புதுப்பிக்கப்படுகிறது

# content_description_dates_are_not_linked
source: Booking date and value date are not updated together
ta: பதிவு தேதி மற்றும் மதிப்பு தேதி ஒன்றாக புதுப்பிக்கப்படவில்லை

source: Roadmap Vote
ta: திட்ட வாக்களிப்பு

# warning_account_for_transaction_is_closed
source: At least one of the selected transactions can not be edited:
ta: தேர்ந்தெடுக்கப்பட்ட பரிவர்த்தனைகளில் குறைந்தபட்சம் ஒன்றையாவது தொகுக்க முடியவில்லை:

# object_sealed
source: Object refers to a closed account.
ta: பொருள் ஒரு மூடப்பட்ட கணக்கைக் குறிக்கிறது.

# content_description_download_exchange_rate
source: Download exchange rate
ta: மாற்று விகிதத்தைப் பதிவிறக்குக

# exchange_rate_not_supported
source: The configured exchange rate provider does not provide the rate %1$s : %2$s. You can try to select a different one in the settings.
ta: கட்டமைக்கப்பட்ட மாற்று விகித வழங்குநர் "%1$s : %2$s" விகிதத்தை வழங்கவில்லை. நீங்கள் அமைப்புகளில் வேறு ஒன்றைத் தேர்ந்தெடுத்து முயற்சி செய்யலாம்.

# pref_category_exchange_rates
source: Exchange rates
ta: மாற்று விகிதங்கள்

# pref_exchange_rate_provider_summary
source: Select provider to download exchange rates
ta: மாற்று விகிதங்களைப் பதிவிறக்க வழங்குநரைத் தேர்ந்தெடுக்கவும்

# pref_exchange_rate_provider_title
source: Exchange Rate Provider
ta: மாற்று விகித வழங்குநர்

# pref_exchange_rates_api_key_summary
source: Please register a free account on %s and provide your App ID
ta: %s இல் இலவச கணக்கைப் பதிவுசெய்து உங்களுடைய பயன்பாட்டு ஐடியை வழங்கவும்

# pref_plan_executor_time_title
source: Planner notification time
ta: இழைப்புளி அறிவிக்கை நேரம்

# synchronization_select_folder_dialog_title
source: Select an existing folder or create a new one
ta: ஏற்கனவே உள்ள கோப்புறையைத் தேர்ந்தெடுக்கவும் அல்லது புதியதை உருவாக்கவும்

# discover_feature_expense_income_switch
source: Use this switch button to record income.
ta: வருமானத்தை பதிவு செய்ய இந்த நிலைமாற்றியை பயன்படுத்தவும்.

# menu_create_budget
source: New budget
ta: புதிய வரவு செலவுத் திட்டம்

# budget_onetime
source: One-time
ta: ஒரு முறை

# no_budgets
source: Define your first budget by tapping the + button.
ta: + பொத்தானைத் தட்டுவதன் மூலம் உங்கள் முதல் வரவு செலவுத் திட்டத்தை வரையறுக்கவும்.

# budget_date_end_after_start
source: The budget's end date must come after its start date.
ta: பட்ஜெட்டின் இறுதி தேதி அதன் தொடக்க தேதிக்கு பின் வர வேண்டும்.

# menu_budget_allocated_only
source: Show only categories with allocation
ta: ஒதுக்கீட்டைக் கொண்ட வகைகளை மட்டும் காட்டு

# budget_filter_all_categories
source: All categories
ta: அனைத்து வகைகள்

# budget_filter_all_parties
source: All parties
ta: அனைத்து தரப்புகள்

# budget_filter_all_methods
source: All methods
ta: அனைத்து முறைகள்

# budget_filter_all_states
source: All status
ta: அனைத்து நிலைகள்

# budget_filter_all_tags
source: All tags
ta: அனைத்து குறிச்சொற்களும்

# budget_filter_all_accounts
source: All accounts
ta: அனைத்து கணக்குகளும்

# dialog_title_warning_delete_budget
source: Delete budget?
ta: வரவு செலவுத் திட்டத்தை நீக்கவா?

# warning_delete_budget
source: Budget "%1$s" will be deleted.
ta: வரவு செலவுத் திட்டம் "%1$s" நீக்கப்படும்.

# menu_edit_budget
source: Edit budget
ta: வரவு செலவுத் திட்டத்தை தொகு

# onboarding_privacy_title
source: Your data stays in your hands
ta: உங்கள் தரவு உங்கள் கைகளிலேயே இருக்கும்

# onboarding_privacy_intro
source: Your financial data is not sent to any server, neither operated by us nor by any third party.
ta: உங்கள் நிதி தரவு எந்தவொரு சேவையகத்திற்கும் அனுப்பப்படவில்லை, எங்களாலோ அல்லது எந்த மூன்றாம் தரப்பினராலோ இயக்கப்படவில்லை.

# app_restart_required
source: New configuration requires app restart to take effect.
ta: புதிய விருப்பமைவுக்கு செயலியை மறுதொடக்கம் செய்ய வேண்டும்.

# menu_remap
source: Remap
ta: மறு தொடற்புப்படுத்து

# dialog_title_confirm_remap
source: Change mapping (%s) ?
ta: தொடற்பை மாற்றவா (%s)?

# remap_category
source: All selected transactions will be mapped to category %s.
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து பரிவர்த்தனைகளும் வகை - %s -க்கு தொடற்பு படுத்தப்படும்.

# remap_payee
source: All selected transactions will be mapped to payer/payee %s.
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து பரிவர்த்தனைகளும் பணம் செலுத்துபவர் / பணம் செலுத்துபவர் - %s -க்கு தொடற்பு படுத்தப்படும்.

# remap_method
source: All selected transactions will be mapped to method %s.
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து பரிவர்த்தனைகளும் முறை - %s -க்கு தொடற்பு படுத்தப்படும்.

# remap_account
source: All selected transactions will be mapped to account %s.
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து பரிவர்த்தனைகளும் கணக்கு - %s -க்கு க தொடற்பு படுத்தப்படும்.
