Repository: 247i/TACETr
Catalog: உரை/தானி/*-nonsense-notes-android-strings-*.po
Languages: ta

source: NoNonsense Notes
ta: Nonnssense குறிப்புகள்

# app_name_short
source: Notes
ta: குறிப்புகள்

# title_create
source: New note
ta: புதிய குறிப்பு

source: Time machine
ta: நேர இயந்திரம்

source: Time
ta: நேரம்

source: Done
ta: முடிந்தது

source: Saved
ta: சேமிக்கப்பட்டது

# menu_save_and_add
source: Save and add note
ta: சேமித்து குறிப்பைச் சேர்க்கவும்

# menu_delete
source: Delete
ta: நீக்கு

# menu_deletelist
source: Delete list
ta: பட்டியலை நீக்கு

# menu_sync
source: Sync
ta: ஒத்திசைவு

# menu_share
source: Share
ta: பங்கு

# menu_preferences
source: Settings
ta: அமைப்புகள்

# menu_createlist
source: Start new list
ta: புதிய பட்டியலைத் தொடங்கவும்

# menu_clearcompleted
source: Clear completed
ta: தெளிவாக முடிந்தது

# menu_setdefaultlist
source: Set as default list
ta: இயல்புநிலை பட்டியலாக அமைக்கவும்

source: New default set
ta: புதிய இயல்புநிலை தொகுப்பு

# menu_managelists
source: Edit lists
ta: பட்டியல்களைத் திருத்து

source: Add item
ta: உருப்படியைச் சேர்க்கவும்

# delete_question
source: Delete?
ta: நீக்கவா?

# delete_items_message
source: Delete these items?
ta: இந்த உருப்படிகளை நீக்கவா?

# delete_item_message
source: Delete this item?
ta: இந்த உருப்படியை நீக்கவா?

# delete_list_message
source: Delete this list?
ta: இந்த பட்டியலை நீக்கவா?

# delete_completed_tasks_question
source: Delete all completed tasks?
ta: நிறைவு செய்யப்பட்ட அனைத்து பணிகளையும் நீக்கவா?

# editor_due_date_hint
source: Due date
ta: இரண்டு தேதிகள்

# editor_title_hint
source: Title
ta: தலைப்பு

# editor_note_hint
source: Note
ta: குறிப்பு

# resolve_edit
source: Edit note
ta: குறிப்பைத் திருத்து

source: Default style
ta: இயல்புநிலை நடை

# show_items_as_tasks
source: checkable tasks
ta: சரிபார்க்கக்கூடிய பணிகள்

# show_items_as_notes
source: simple notes
ta: எளிய குறிப்புகள்

# sort_list_default
source: Default sorting order
ta: இயல்புநிலை வரிசையாக்க வரிசை

# sort_list_due
source: Due date
ta: இரண்டு தேதிகள்

# sort_list_updated
source: Latest updated
ta: அண்மைக் கால புதுப்பிக்கப்பட்டது

# sort_list_manual
source: Manual
ta: கையேடு

# search_description
source: Notes and tasks
ta: குறிப்புகள் மற்றும் பணிகள்

source: Archive
ta: காப்பகம்

# view_deletedtasks
source: @string/archive
ta: @சரம்/காப்பகம்

source: Restore
ta: மீட்டமை

source: Restore to
ta: மீட்டமை

# search_hint
source: Search
ta: தேடல்

# settings_theme
source: Current theme
ta: தற்போதைய கருப்பொருள்

# settings_theme_dialog
source: Use theme
ta: கருப்பொருள் பயன்படுத்தவும்

# settings_lang
source: Language
ta: மொழி

# settings_lang_dialog
source: @string/settings_lang
ta: @சரம்/அமைப்புகள்_லாங்

# settings_summary_theme_black
source: Black
ta: கருப்பு

# settings_summary_theme_dark
source: Dark
ta: இருண்ட

# settings_summary_theme_light
source: Light
ta: ஒளி

# settings_summary_theme_classic
source: Classic
ta: கிளாசிக்

# settings_cat_appearance
source: Appearance
ta: தோற்றம்

# preference_preview_text
source: This is how the editor text will appear
ta: ஆசிரியர் உரை இப்படித்தான் தோன்றும்

# settings_account_title
source: Select an account
ta: ஒரு கணக்கைத் தேர்ந்தெடுக்கவும்

# settings_account_summary
source: Touch to switch account
ta: கணக்கை மாற்றத் தொடவும்

# settings_cat_syncing
source: Syncing
ta: ஒத்திசைவு

# show_from_all_lists
source: All lists
ta: அனைத்து பட்டியல்களும்

source: Lists
ta: பட்டியல்கள்

source: Deleted
ta: நீக்கப்பட்டது

source: Repeat
ta: மீண்டும்

source: Once
ta: ஒருமுறை

source: Always
ta: எப்போதும்

# permission_read_label
source: read notes and lists
ta: குறிப்புகள் மற்றும் பட்டியல்களைப் படியுங்கள்

# permission_read_desc
source: Allows the app to read your notes and related lists in No Nonsense Notes
ta: உங்கள் குறிப்புகள் மற்றும் தொடர்புடைய பட்டியல்களை முட்டாள்தனமான குறிப்புகளில் படிக்க பயன்பாட்டை அனுமதிக்கிறது

# permission_write_label
source: modify notes and lists
ta: குறிப்புகள் மற்றும் பட்டியல்களை மாற்றவும்

# permission_write_desc
source: Allows the app to insert, update and delete notes and lists in No Nonsense Notes
ta: முட்டாள்தனமான குறிப்புகள் இல்லாத குறிப்புகள் மற்றும் பட்டியல்களை செருகவும், புதுப்பிக்கவும், நீக்கவும் பயன்பாட்டை அனுமதிக்கிறது

# settings_list_dialog
source: Select a list
ta: ஒரு பட்டியலைத் தேர்ந்தெடுக்கவும்

# settings_list
source: List
ta: பட்டியல்

source: Drag to time travel
ta: நேர பயணத்திற்கு இழுக்கவும்

# navigation_drawer_open
source: Open navigation drawer
ta: திறந்த வழிசெலுத்தல் அலமாரியை

# navigation_drawer_close
source: Close navigation drawer
ta: வழிசெலுத்தல் அலமாரியை மூடு

# import_data_question
source: Import data?
ta: தரவை இறக்குமதி செய்யவா?

# import_started
source: Importing data…
ta: தரவை இறக்குமதி செய்தல்…

# imported_result
source: Imported %1$d notes into %2$d lists
ta: இறக்குமதி செய்யப்பட்ட %1$d குறிப்புகள் %2$d பட்டியல்களில்

# import_error
source: Something went wrong: %s
ta: ஏதோ தவறு நடந்தது: %s

# notification_channel_name
source: Reminders for notes
ta: குறிப்புகளுக்கான நினைவூட்டல்கள்

# notification_channel_description
source: Shows the note content at the time of the chosen reminder
ta: தேர்ந்தெடுக்கப்பட்ட நினைவூட்டலின் போது குறிப்பு உள்ளடக்கத்தைக் காட்டுகிறது

# feature_is_WIP
source: This feature is a W.I.P.
ta: இந்த நற்பொருத்தம் ஒரு W.I.P.

# permission_denied
source: Can not proceed: you denied the permission
ta: தொடர முடியாது: நீங்கள் இசைவு மறுத்தீர்கள்

# no_sync_method_chosen
source: You did not choose a sync method
ta: நீங்கள் ஒரு ஒத்திசைவு முறையைத் தேர்வு செய்யவில்லை

# file_picker_not_available
source: The file picker is not available
ta: கோப்பு எடுப்பவர் கிடைக்கவில்லை

# choose_backup_folder
source: Choose a backup folder
ta: காப்பு கோப்புறையைத் தேர்வுசெய்க

source: Use exact alarms
ta: சரியான அலாரங்களைப் பயன்படுத்துங்கள்

# exact_alarms_summary
source: Uses more battery to show notification reminders in a more reliable way
ta: அறிவிப்பு நினைவூட்டல்களை மிகவும் நம்பகமான முறையில் காட்ட அதிக பேட்டரியைப் பயன்படுத்துகிறது

# disable_battery_optimizations
source: Turn off battery optimizations
ta: பேட்டரி மேம்படுத்தல்களை அணைக்கவும்

# battery_optimizations_active
source: Battery optimizations on
ta: பேட்டரி மேம்படுத்தல்கள்

# battery_optimizations_inactive
source: Battery optimizations off
ta: பேட்டரி மேம்படுத்தல்கள் முடக்கப்படுகின்றன

source: Allow exact reminders
ta: சரியான நினைவூட்டல்களை அனுமதிக்கவும்

# allow_exact_reminders_summary
source: Open a page to allow this app to send reminders more reliably. Only needed since Android 12 Snow Cone
ta: இந்த பயன்பாட்டை நினைவூட்டல்களை மிகவும் நம்பகத்தன்மையுடன் அனுப்ப அனுமதிக்க ஒரு பக்கத்தைத் திறக்கவும். ஆண்ட்ராய்டு 12 ச்னோ கூம்பு முதல் மட்டுமே தேவை

# for_older_devices
source: For older Android devices
ta: பழைய ஆண்ட்ராய்டு சாதனங்களுக்கு

# overwritten_in_newer_systems
source: Can be undone by certain notification channel settings
ta: சில அறிவிப்பு சேனல் அமைப்புகளால் செயல்தவிர்க்கலாம்

# prefs_improved_reliability
source: Preferences to improve reliability
ta: நம்பகத்தன்மையை மேம்படுத்துவதற்கான விருப்பத்தேர்வுகள்

source: Notification channel settings
ta: அறிவிப்பு சேனல் அமைப்புகள்

# open_channel_settings_description
source: Open a page to edit the notification settings for this app. These override any settings chosen elsewhere
ta: இந்த பயன்பாட்டிற்கான அறிவிப்பு அமைப்புகளைத் திருத்த ஒரு பக்கத்தைத் திறக்கவும். இவை வேறு இடங்களில் தேர்ந்தெடுக்கப்பட்ட எந்த அமைப்புகளையும் மீறுகின்றன

# libraries_used
source: Libraries
ta: நூலகங்கள்

# app_about_dev_team
source: Created by Jonas Kalderstam and maintained by Campello Manuel
ta: சோனாச் கல்டர்ச்டாம் உருவாக்கியது மற்றும் காம்பெல்லோ மானுவல் பராமரித்தார்

# app_about_git_repo
source: This app is copylefted libre software, available at https://github.com/spacecowboy/NotePad
ta: இந்த பயன்பாடு நகலெடுக்கப்பட்ட லிப்ரே மென்பொருளாகும், இது https://github.com/spacecowboy/notepad இல் கிடைக்கிறது

# app_about_license
source: Licensed GPLv3+, https://www.gnu.org/licenses
ta: உரிமம் பெற்ற GPLV3+, https://www.gnu.org/licenses

# app_about_bugreports
source: Report bugs and issues at https://github.com/spacecowboy/NotePad/issues
ta: பிழைகள் மற்றும் சிக்கல்களை https://github.com/spacecowboy/notepad/issues இல் புகாரளிக்கவும்

# app_about_translations
source: Help translate the app at https://hosted.weblate.org/engage/no-nonsense-notes/
ta: பயன்பாட்டை https://hosted.weblate.org/engage/no- nonsensens- நோட்ச்/இல் மொழிபெயர்க்க உதவுங்கள்

source: "Sponsor this project\
ta: "இந்த திட்டத்திற்கு ஒப்புரவாளர் \

# app_about_donations
source: We accept donations. To support our work, look for %1$s in %2$s
ta: நாங்கள் நன்கொடைகளை ஏற்றுக்கொள்கிறோம். எங்கள் வேலையை ஆதரிக்க, %2$s இல் %1$s ஐத் தேடுங்கள்

source: Disable Android hibernation
ta: ஆண்ட்ராய்டு Hibernation ஐ முடக்கு

# disable_android_hibernation_desc
source: It is a feature that makes the app less reliable. It may block your reminders. Open this, look for something like "suspend app activity if unused" and turn it off
ta: இது பயன்பாட்டை நம்பகமானதாக மாற்றும் அம்சமாகும். இது உங்கள் நினைவூட்டல்களைத் தடுக்கலாம். இதைத் திறந்து, "பயன்படுத்தப்படாவிட்டால் பயன்பாட்டு செயல்பாட்டை இடைநிறுத்துங்கள்" போன்ற ஒன்றைத் தேடி அதை அணைக்கவும்

# msg_hibernation_already_off
source: Android hibernation is already OFF, you do not need this
ta: ஆண்ட்ராய்டு ஐபர்னேசன் ஏற்கனவே முடக்கப்பட்டுள்ளது, உங்களுக்கு இது தேவையில்லை

# msg_enable_notifications
source: Go to settings -> notifications to enable notifications
ta: அறிவிப்புகளை இயக்க அமைப்புகள் -> அறிவிப்புகளுக்குச் செல்லவும்

source: Notifications visibility
ta: அறிவிப்புகள் தெரிவுநிலை

# notifications_enabled
source: Notifications are visible
ta: அறிவிப்புகள் தெரியும்

# notifications_blocked
source: Notifications are not visible, so you will not see the reminders. Touch here, find the permissions category, and enable notifications for this app
ta: அறிவிப்புகள் தெரியவில்லை, எனவே நீங்கள் நினைவூட்டல்களைக் காண மாட்டீர்கள். இங்கே தொடவும், இசைவு வகையைக் கண்டுபிடித்து, இந்த பயன்பாட்டிற்கான அறிவிப்புகளை இயக்கவும்

# unavailable_chose_directory
source: Unavailable. Please choose a directory first
ta: கிடைக்கவில்லை. முதலில் ஒரு கோப்பகத்தைத் தேர்வுசெய்க

source: Not selected yet
ta: இன்னும் தேர்ந்தெடுக்கப்படவில்லை

# enable_sync
source: Enable synchronization
ta: ஒத்திசைவை இயக்கவும்

# enable_sync_desc
source: Enables synchronization features and allows to choose a sync source. Backups are not affected
ta: ஒத்திசைவு அம்சங்களை செயல்படுத்துகிறது மற்றும் ஒத்திசைவு மூலத்தைத் தேர்வுசெய்ய அனுமதிக்கிறது. காப்புப்பிரதிகள் பாதிக்கப்படவில்லை

source: Changelog (online)
ta: சேஞ்ச்லாக் (ஆன்லைன்)

# canceled_note_locked
source: Cancelled: the note is locked
ta: ரத்துசெய்யப்பட்டது: குறிப்பு பூட்டப்பட்டுள்ளது

source: Order notes by:
ta: வழங்கியவர்:

# show_elements_as
source: Show items as:
ta: இவ்வாறு உருப்படிகளைக் காட்டு:

# version
source: Version: %s
ta: பதிப்பு: %s

source: Next month
ta: அடுத்த மாதம்

source: Next year
ta: அடுத்த ஆண்டு

source: Select all
ta: அனைத்தையும் தெரிவுசெய்

source: Tutorial (online)
ta: பயிற்சி (ஆன்லைன்)

# showcase_tutorial_title
source: Feeling lost?
ta: இழந்ததாக உணர்கிறீர்களா?

# showcase_tutorial_description
source: We have an online tutorial. Find it in the settings
ta: எங்களிடம் நிகழ்நிலை பயிற்சி உள்ளது. அமைப்புகளில் அதைக் கண்டறியவும்

# welcome_note_title
source: Welcome!
ta: வரவேற்கிறோம்!

# welcome_note_row_2
source: Open this to get started.
ta: தொடங்க இதைத் திறக்கவும்.

# welcome_note_row_3
source: This app has a detailed tutorial. You can find it at
ta: இந்த பயன்பாட்டில் விரிவான பயிற்சி உள்ளது. நீங்கள் அதை காணலாம்

# unsupported_readonly_file
source: Unsupported read-only file: %s
ta: ஆதரிக்கப்படாத வாசிப்பு மட்டும் கோப்பு: %s

source: Show completed notes
ta: நிறைவு செய்யப்பட்ட குறிப்புகளைக் காட்டு

# notecopied_msg
source: @string/notecopied_one
ta: @string/notecopied_other

# notedeleted_msg
source: @string/notedeleted_one
ta: @string/wedeleted_one

# mode_choose
source: @string/selected_one
ta: @சரம்/தேர்ந்தெடுக்கப்பட்ட_ஒன்

source: Move
ta: நகர்த்தவும்

source: Move to
ta: செல்லுங்கள்

# moved_x_to_list
source: Moved %1$d to %2$s
ta: %1$d க்கு %2$s நகர்த்தப்பட்டது

source: Account
ta: கணக்கு

source: Lock note
ta: பூட்டு குறிப்பு

source: Unlock note
ta: குறிப்பைத் திறக்கவும்

source: Locked
ta: பூட்டப்பட்டுள்ளது

source: Unlocked
ta: திறக்கப்பட்டது

source: Password required
ta: கடவுச்சொல் தேவை

# select_account
source: Select an account
ta: ஒரு கணக்கைத் தேர்ந்தெடுக்கவும்

source: Password
ta: கடவுச்சொல்

source: Password set
ta: கடவுச்சொல் தொகுப்பு

source: Password cleared
ta: கடவுச்சொல் அழிக்கப்பட்டது

# passwords_dont_match
source: Passwords do not match
ta: கடவுச்சொற்கள் பொருந்தவில்லை

source: Password incorrect
ta: கடவுச்சொல் தவறானது

source: Enter password
ta: கடவுச்சொல்லை உள்ளிடவும்

source: Enter new password
ta: புதிய கடவுச்சொல்லை உள்ளிடவும்

source: Confirm new password
ta: புதிய கடவுச்சொல்லை உறுதிப்படுத்தவும்

source: Apply
ta: இடு

source: Clear password
ta: கடவுச்சொல்லை அழிக்கவும்

# password_info
source: Any one note can be locked, limiting viewing and modifying it. It remains fully accessible on other devices.
ta: எந்தவொரு குறிப்பையும் பூட்டலாம், அதைப் பார்க்கவும் மாற்றியமைக்கவும் முடியும். இது மற்ற சாதனங்களில் முழுமையாக அணுகக்கூடியதாக உள்ளது.

source: About
ta: பற்றி

source: Sync failed
ta: ஒத்திசைவு தோல்வியுற்றது

# sync_login_failed
source: Could not log in to use Google Tasks
ta: Google பணிகளைப் பயன்படுத்த உள்நுழைய முடியவில்லை

source: Completed
ta: முடிந்தது

# date_header_overdue
source: Overdue
ta: தாமதமானது

# date_header_today
source: Today
ta: இன்று

# date_header_tomorrow
source: Tomorrow
ta: நாளை

# date_header_future
source: Later
ta: பின்னர்

# date_header_none
source: No date
ta: தேதி இல்லை

# date_header_completed
source: Completed
ta: முடிந்தது

source: Next 5 days
ta: அடுத்த 5 நாட்கள்

# next_n_days
source: Next %d days
ta: அடுத்த %d நாட்கள்

source: This week
ta: இந்த வாரம்

# please_select_note
source: Please select or create a note
ta: தயவுசெய்து ஒரு குறிப்பைத் தேர்ந்தெடுக்கவும் அல்லது உருவாக்கவும்

# please_create_note
source: Please create a note
ta: குறிப்பை உருவாக்கவும்

source: Hide checkbox
ta: தேர்வுப்பெட்டியை மறைக்கவும்

# hide_checkbox_summary_on
source: Checkbox hidden
ta: தேர்வுப்பெட்டி மறைக்கப்பட்டுள்ளது

# hide_checkbox_summary_off
source: Checkbox shown
ta: தேர்வுப்பெட்டி காட்டப்பட்டுள்ளது

# hide_date
source: Hide due date
ta: உரிய தேதியை மறைக்கவும்

# item_max_height
source: Max height of notes/tasks, in rows
ta: குறிப்புகள்/பணிகளின் அதிகபட்ச உயரம், வரிசைகளில்

# long_date_format
source: Long-date format, for the panel
ta: பேனலுக்கு நீண்ட கால வடிவமைப்பு

# short_date_format
source: Short-date format, for the list
ta: குறுகிய தேதி வடிவம், பட்டியலுக்கு

source: Select date
ta: தேதியைத் தேர்ந்தெடுக்கவும்

# localedefault
source: Device default
ta: சாதன இயல்புநிலை

# hide_header
source: Hide entire widget header
ta: முழு விட்செட் தலைப்பையும் மறைக்கவும்

source: Transparency
ta: வெளிப்படைத்தன்மை

source: Notes shortcut
ta: குறிப்புகள் குறுக்குவழி

# shortcut_help1
source: Makes the shortcut open a new note in the selected list with an open text editor.
ta: சார்ட்கட் திறந்த உரை எடிட்டருடன் தேர்ந்தெடுக்கப்பட்ட பட்டியலில் புதிய குறிப்பைத் திறக்கச் செய்கிறது.

source: Loading widget…
ta: விட்செட்டை ஏற்றுகிறது…

source: Default list
ta: இயல்புநிலை பட்டியல்

# please_type_before_reminder
source: Please type some text before adding a reminder
ta: நினைவூட்டலைச் சேர்ப்பதற்கு முன் சில உரையைத் தட்டச்சு செய்க

# notecopied_one
source: Copied one note
ta: ஒரு குறிப்பை நகலெடுத்தார்

# notecopied_other
source: Copied %d notes
ta: %d குறிப்புகள் நகலெடுக்கப்பட்டன

# notedeleted_one
source: Deleted one note
ta: ஒனனோட்டை நீக்கியது

# notedeleted_other
source: Deleted %d notes
ta: நீக்கப்பட்டது %d குறிப்புகள்

# notedeleted_zero
source: @string/notedeleted_other
ta: @string/nemedleted_other

# notedeleted_two
source: @string/notedeleted_other
ta: @string/nemedleted_other

# notedeleted_few
source: @string/notedeleted_other
ta: @string/nemedleted_other

# notedeleted_many
source: @string/notedeleted_other
ta: @string/nemedleted_other

# selected_one
source: Selected one note
ta: ஒரு குறிப்பைத் தேர்ந்தெடுத்தது

# selected_other
source: Selected %d notes
ta: தேர்ந்தெடுக்கப்பட்ட %d குறிப்புகள்

# selected_zero
source: @string/selected_other
ta: @சரம்/தேர்ந்தெடுக்கப்பட்ட_தர்

# selected_two
source: @string/selected_other
ta: @சரம்/தேர்ந்தெடுக்கப்பட்ட_தர்

# selected_few
source: @string/selected_other
ta: @சரம்/தேர்ந்தெடுக்கப்பட்ட_தர்

# selected_many
source: @string/selected_other
ta: @சரம்/தேர்ந்தெடுக்கப்பட்ட_தர்

source: Background sync
ta: பின்னணி ஒத்திசைவு

# background_sync_info
source: Syncs once per hour
ta: ஒரு மணி நேரத்திற்கு ஒரு முறை ஒத்திசைக்கிறது

# sync_on_change
source: Sync on changes
ta: மாற்றங்களில் ஒத்திசைக்கவும்

# sync_on_change_info
source: Schedules a sync shortly after a note has changed
ta: குறிப்பு மாறிய சிறிது நேரத்திலேயே ஒரு ஒத்திசைவை திட்டமிடுகிறது

# sync_on_start
source: Sync on app start
ta: பயன்பாட்டு தொடக்கத்தில் ஒத்திசைக்கவும்

# sync_on_start_info
source: Limits syncing to once every 5 minutes
ta: ஒவ்வொரு 5 நிமிடங்களுக்கும் ஒரு முறை ஒத்திசைக்கும் வரம்புகள்

source: Snooze
ta: உறக்கநிலை

source: Silent
ta: அமைதியாக

source: Sound
ta: ஒலி

source: Vibrate
ta: அதிர்வு

source: Reminders
ta: நினைவூட்டல்கள்

source: Standard
ta: தரநிலை

# notification_prio_high
source: High: On top, expanded
ta: உயர்: மேலே, விரிவாக்கப்பட்டது

# notification_prio_low
source: Low: Hidden, minimized
ta: குறைந்த: மறைக்கப்பட்ட, குறைக்கப்பட்ட

source: Priority
ta: முன்னுரிமை

source: Notifications
ta: அறிவிப்புகள்

source: Tasks
ta: பணிகள்

source: All tasks
ta: அனைத்து பணிகளும்

# dashclock_tasks
source: @string/tasks
ta: @சரம்/பணிகள்

# dashclock_restrict_to_tasks_in_a_specific_list
source: Restrict to tasks in
ta: பணிகளை கட்டுப்படுத்துங்கள்

# dashclock_show_overdue_tasks
source: Show overdue tasks
ta: தாமதமான பணிகளைக் காட்டு

# dashclock_overdue_tasks_show
source: Overdue tasks shown
ta: தாமதமான பணிகள் காட்டப்பட்டுள்ளன

# dashclock_overdue_tasks_hide
source: Overdue tasks hidden
ta: தாமதமான பணிகள் மறைக்கப்பட்டுள்ளன

# dashclock_title_activity_tasks_settings
source: Settings
ta: அமைப்புகள்

# dashclock_pref_header_general
source: General
ta: பொது

# dashclock_due_upper_limit_title
source: Limit to tasks due at the latest
ta: அண்மைக் கால பணிகளுக்கு வரம்பு

# dashclock_today
source: Today
ta: இன்று

# dashclock_tomorrow
source: Tomorrow
ta: நாளை

# dashclock_next7
source: Next 7 days
ta: அடுத்த 7 நாட்கள்

# dashclock_anytime
source: Anytime
ta: எப்போது வேண்டுமானாலும்

# dashclock_will_show_as_many_as_possible
source: Show as many as possible
ta: முடிந்தவரை பலவற்றைக் காட்டுங்கள்

# dashclock_show_only_the_next_task
source: Show only the next task
ta: அடுத்த பணியை மட்டும் காட்டு

# dashclock_header_shown
source: Bold list name
ta: தைரியமான பட்டியல் பெயர்

# dashclock_first_task_shown
source: Bold title of first task
ta: முதல் பணியின் தைரியமான தலைப்பு

# dashclock_display_header
source: Display list name
ta: காட்சி பட்டியல் பெயர்

source: Editor
ta: திருத்தி

source: Bold
ta: தடிமான

source: Italic
ta: சாய்வு

source: Normal
ta: சாதாரண

source: Title style
ta: தலைப்பு நடை

source: Title font
ta: தலைப்பு எழுத்துரு

source: Body font
ta: உடல் எழுத்துரு

source: Clickable links
ta: சொடுக்கு செய்யக்கூடிய இணைப்புகள்

source: Small
ta: சிறிய

source: Medium
ta: சராசரி

source: Large
ta: பெரிய

source: Text size
ta: உரை அளவு

source: Text
ta: உரை

source: Add a reminder
ta: ஒரு நினைவூட்டலைச் சேர்க்கவும்

source: Backup
ta: காப்புப்பிரதி

# backup_import
source: Import backup
ta: காப்புப்பிரதி இறக்குமதி செய்யுங்கள்

# backup_export
source: Export backup
ta: காப்புப்பிரதி ஏற்றுமதி

# backup_import_msg
source: Try to import backup from %1$s? This will clear the current database.
ta: %1$s இலிருந்து காப்புப்பிரதியை இறக்குமதி செய்ய முயற்சிக்கிறீர்களா? இது தற்போதைய தரவுத்தளத்தை அழிக்கும்.

# backup_export_msg
source: Export all notes to %1$s?
ta: அனைத்து குறிப்புகளையும் %1$s க்கு ஏற்றுமதி செய்யவா?

# backup_import_success
source: Backup imported
ta: காப்புப்பிரதி இறக்குமதி செய்யப்பட்டது

# backup_file_not_found
source: Could not find a backup file named NoNonsenseNotes_Backup.json
ta: Nononsensenotes_backup.json என்ற காப்புப் கோப்பைக் கண்டுபிடிக்க முடியவில்லை

# backup_import_failed
source: Could not read the backup file NoNonsenseNotes_Backup.json
ta: காப்புப்பிரதி கோப்பை nononsenonotes_backup.json ஐப் படிக்க முடியவில்லை

# backup_export_success
source: Backup exported
ta: காப்புப்பிரதி ஏற்றுமதி செய்யப்பட்டது

# backup_export_failed
source: Could not write to the backup file
ta: காப்பு கோப்பில் எழுத முடியவில்லை

source: SD card
ta: எச்டி அட்டை

source: SD card sync
ta: எச்டி அட்டை ஒத்திசைவு

# sd_card_summary
source: Tasks are kept the same between the app and the SD card. Deleting the files thus deletes the tasks in the app!
ta: பயன்பாட்டிற்கும் எச்டி கார்டுக்கும் இடையில் பணிகள் ஒரே மாதிரியாக வைக்கப்படுகின்றன. கோப்புகளை நீக்குவது இதனால் பயன்பாட்டில் உள்ள பணிகளை நீக்குகிறது!

# directory
source: Folder
ta: கோப்புறை

# directory_summary_msg
source: Files are saved in %s which you can access with your file manager app. Uninstalling the app will also delete these files: to keep your notes, make a backup
ta: கோப்புகள் %s இல் சேமிக்கப்படுகின்றன உங்கள் கோப்பு மேலாளர் பயன்பாட்டுடன் நீங்கள் அணுகலாம். பயன்பாட்டை நிறுவல் நீக்குவதும் இந்த கோப்புகளையும் நீக்கிவிடும்: உங்கள் குறிப்புகளை வைத்திருக்க, காப்புப்பிரதி செய்யுங்கள்

source: Cannot write to directory
ta: கோப்பகத்திற்கு எழுத முடியாது

source: Bigger titles
ta: பெரிய தலைப்புகள்

# bigger_titles_summary
source: The title is the first line
ta: தலைப்பு முதல் வரி

source: Sorting
ta: வரிசைப்படுத்துதல்

source: Undo
ta: செயல்தவிர்
