Repository: 247i/TACETr
Catalog: உரை/தானி/3d-slicer-slicerigt-*.po
Languages: ta

# qSlicerCreateModelsModule
source: Tip radius:
ta: உதவிக்குறிப்பு ஆரம்:

# qSlicerCreateModelsModule
source: Length:
ta: நீளம்:

# qSlicerCreateModelsModule
source: Radius:
ta: ஆரம்:

# qSlicerCreateModelsModule
source: Depth markers:
ta: ஆழமான குறிப்பான்கள்:

# qSlicerCreateModelsModule
source: Create needle
ta: ஊசி உருவாக்கவும்

# qSlicerCreateModelsModule
source: Coordinate system model
ta: கணினி மாதிரி ஒருங்கிணைப்பு

# qSlicerCreateModelsModule
source: Create coordinate system
ta: ஒருங்கிணைப்பு அமைப்பை உருவாக்கவும்

# qSlicerCreateModelsModule
source: Axis length:
ta: அச்சு நீளம்:

# qSlicerCreateModelsModule
source: Thickness:
ta: தடிமன்:

# qSlicerCreateModelsModule
source: Cube model
ta: கியூப் மாதிரி

# qSlicerCreateModelsModule
source: R-L length:
ta: R-l நீளம்:

# qSlicerCreateModelsModule
source: Create cube
ta: கனசதுரத்தை உருவாக்கவும்

# qSlicerCreateModelsModule
source: S-I length:
ta: எச்-ஐ நீளம்:

# qSlicerCreateModelsModule
source: A-P length:
ta: A-p நீளம்:

# qSlicerCreateModelsModule
source: Cylinder model
ta: சிலிண்டர் மாதிரி

# qSlicerCreateModelsModule
source: Create cylinder
ta: சிலிண்டர் உருவாக்கு

# qSlicerCreateModelsModule
source: Height:
ta: உயரம்:

# qSlicerCreateModelsModule
source: Sphere model
ta: கோள மாதிரி

# qSlicerCreateModelsModule
source: Create sphere
ta: கோளத்தை உருவாக்கவும்

# qSlicerCreateModelsModule
source: Radius:
ta: ஆரம்:

# qSlicerCreateModelsModule
source: Module for creating simple shapes, such as sphere, cylinder, prism, needle, and coordinate system axes.For help on how to use this module visit: <a href='http://www.slicerigt.org'>SlicerIGT website</a>.
ta: கோளம், சிலிண்டர், ப்ரிசம், ஊசி மற்றும் கணினி அச்சுகள் போன்ற எளிய வடிவங்களை உருவாக்குவதற்கான தொகுதி. /அ>.

# qSlicerCreateModelsModule
source: This work was was funded by Cancer Care Ontario and the Ontario Consortium for Adaptive Interventions in Radiation Oncology (OCAIRO)
ta: இந்த வேலைக்கு புற்றுநோய் பராமரிப்பு ஒன்ராறியோ மற்றும் ஒன்ராறியோ கூட்டமைப்பு ஆகியவை கதிர்வீச்சு புற்றுநோயியல் (ஒக்காரோ) இல் தகவமைப்பு தலையீடுகளுக்காக நிதியளித்தன.

# qSlicerFiducialRegistrationWizardModule
source: Module Template
ta: தொகுதி வார்ப்புரு

# qSlicerFiducialRegistrationWizardModule
source: Display
ta: காட்சி

# qSlicerFiducialRegistrationWizardModule
source: vtkMRMLFiducialRegistrationWizardNode
ta: VTKMRMLFIDUSIALREGISTRISTIONWIZARDNODE

# qSlicerFiducialRegistrationWizardModule
source: From fiducials
ta: நம்பகத்தன்மையிலிருந்து

# qSlicerFiducialRegistrationWizardModule
source: To fiducials
ta: நம்பகமானவர்களுக்கு

# qSlicerFiducialRegistrationWizardModule
source: Place fiducials by using position component of transforms. Parent transforms are applied.
ta: உருமாற்றங்களின் நிலை கூறுகளைப் பயன்படுத்தி நம்பகத்தன்மையை வைக்கவும். பெற்றோர் மாற்றங்கள் பயன்படுத்தப்படுகின்றன.

# qSlicerFiducialRegistrationWizardModule
source: Place fiducials using transforms
ta: உருமாற்றங்களைப் பயன்படுத்தி நம்பகத்தன்மையை வைக்கவும்

# qSlicerFiducialRegistrationWizardModule
source: Click when tracked device tip is placed at a fiducial point
ta: கண்காணிக்கப்பட்ட சாதன முனை ஒரு நம்பகமான இடத்தில் வைக்கப்படும் போது சொடுக்கு செய்க

# qSlicerFiducialRegistrationWizardModule
source: Place 'From'
ta: 'இலிருந்து' வைக்கவும்

# qSlicerFiducialRegistrationWizardModule
source: Place 'To'
ta: 'டு'

# qSlicerFiducialRegistrationWizardModule
source: Registration result (From->To) transform
ta: பதிவு முடிவு (from-> to) உருமாற்றம்

# qSlicerFiducialRegistrationWizardModule
source: Result transform type:
ta: முடிவு உருமாற்ற வகை:

# qSlicerFiducialRegistrationWizardModule
source: Rigid
ta: உறுதியானது

# qSlicerFiducialRegistrationWizardModule
source: Similarity
ta: ஒற்றுமை

# qSlicerFiducialRegistrationWizardModule
source: Warping
ta: நெளிவு

# qSlicerFiducialRegistrationWizardModule
source: Point Matching Method:
ta: புள்ளி பொருந்தும் முறை:

# qSlicerFiducialRegistrationWizardModule
source: <html><head/><body><p>Compute output transform from fiducials. Click the checkbox for automatic update.</p></body></html>
ta: <html> <head/> <body> <p> நம்பகத்தன்மையிலிருந்து வெளியீட்டு உருமாற்றத்தை கணக்கிடுங்கள். தானியங்கி புதுப்பிப்புக்கான தேர்வுப்பெட்டியைக் சொடுக்கு செய்க. </P> </body> </html>

# qSlicerFiducialRegistrationWizardModule
source: Update
ta: புதுப்பிப்பு

# qSlicerFiducialRegistrationWizardModule
source: Status:
ta: நிலை:

# qSlicerFiducialRegistrationWizardModule
source: Preview transform
ta: முன்னோட்டம் உருமாற்றம்

# qSlicerFiducialRegistrationWizardModule
source: Register images, models, or any other nodes to each other using manually placed landmark points. Rigid, affine, and warping transforms are supported. For help on how to use this module visit: <a href='https://www.slicerigt.org'>SlicerIGT website</a>.
ta: கைமுறையாக வைக்கப்பட்டுள்ள மைல்கல் புள்ளிகளைப் பயன்படுத்தி படங்கள், மாதிரிகள் அல்லது வேறு எந்த முனைகளையும் பதிவுசெய்க. கடுமையான, அஃபைன் மற்றும் வார்பிங் உருமாற்றங்கள் ஆதரிக்கப்படுகின்றன. இந்த தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கான உதவிக்கு: <a href = 'https: //www.slicerigt.org'> ச்லிசெரிக்ட் வலைத்தளம் </a>.

# qSlicerFiducialRegistrationWizardModule
source: This work was was funded by Cancer Care Ontario and the Ontario Consortium for Adaptive Interventions in Radiation Oncology (OCAIRO)
ta: இந்த வேலைக்கு புற்றுநோய் பராமரிப்பு ஒன்ராறியோ மற்றும் ஒன்ராறியோ கூட்டமைப்பு ஆகியவை கதிர்வீச்சு புற்றுநோயியல் (ஒக்காரோ) இல் தகவமைப்பு தலையீடுகளுக்காக நிதியளித்தன.

# qSlicerFiducialRegistrationWizardModuleWidget
source: Place fiducial corresponding to %1
ta: %1 உடன் தொடர்புடைய நம்பகத்தன்மையை வைக்கவும்

# qSlicerFiducialRegistrationWizardModuleWidget
source: Point indices in the "From" list match those in the "To" list.
ta: "ஃப்ரம்" பட்டியலில் உள்ள புள்ளி குறியீடுகள் "முதல்" பட்டியலில் உள்ளவர்களுடன் பொருந்துகின்றன.

# qSlicerFiducialRegistrationWizardModuleWidget
source: EXPERIMENTAL. Point pairing between the two lists will be computed automatically. This feature is intended only for rigid and similarity transforms.
ta: சோதனை. இரண்டு பட்டியல்களுக்கும் இடையில் புள்ளி இணைத்தல் தானாக கணக்கிடப்படும். இந்த நற்பொருத்தம் கடுமையான மற்றும் ஒற்றுமை மாற்றங்களுக்கு மட்டுமே நோக்கம் கொண்டது.

# qSlicerFiducialRegistrationWizardModuleWidget
source: Update options
ta: விருப்பங்களை புதுப்பிக்கவும்

# qSlicerFiducialRegistrationWizardModuleWidget
source: No Fiducial Registration Wizard module node selected.
ta: நம்பகமான பதிவு வழிகாட்டி தொகுதி முனை தேர்ந்தெடுக்கப்படவில்லை.

# qSlicerFiducialRegistrationWizardModuleWidget
source: Auto-update
ta: தானாக புதுப்பித்தல்

# qSlicerFiducialRegistrationWizardModuleWidget
source: Update
ta: புதுப்பிப்பு

# qSlicerFiducialRegistrationWizardModuleWidget
source: Status: %1
ta: நிலை: %1

# qSlicerFooBarWidget
source: Foo bar
ta: ஃபூ பார்

# qSlicerFooBarWidget
source: Foo Bar
ta: ஃபூ பார்

# qSlicerLandmarkDetectionModule
source: This is a module for detecting landmarks by pivoting a tracked stylus. If you have questions, or encounter an problem, submit an issue on the <a href="https://github.com/SlicerIGT/SlicerIGT">GitHub page</a>.
ta: கண்காணிக்கப்பட்ட ச்டைலசை முன்னிலைப்படுத்துவதன் மூலம் அடையாளங்களைக் கண்டறிவதற்கான ஒரு தொகுதி இது. உங்களிடம் கேள்விகள் இருந்தால், அல்லது சிக்கலை எதிர்கொண்டால், <a href = "https://github.com/slicerigt/slicerigt"> அறிவிலிமையம் பக்கம் </a> இல் ஒரு சிக்கலை சமர்ப்பிக்கவும்.

# qSlicerLandmarkDetectionModule
source: This module was developed through support from CANARIE's Research Software Program, Cancer Care Ontario, OpenAnatomy, and Brigham and Women's Hospital through NIH grant R01MH112748.
ta: இந்த தொகுதி கனரியின் ஆராய்ச்சி மென்பொருள் திட்டம், புற்றுநோய் பராமரிப்பு ஒன்ராறியோ, ஓபன்அனாடோமி மற்றும் ப்ரிகாம் மற்றும் மகளிர் மருத்துவமனை ஆகியவற்றின் ஆதரவின் மூலம் NIH மானியம் R01MH112748 மூலம் உருவாக்கப்பட்டது.

# qSlicerLandmarkDetectionModuleWidget
source: Form
ta: வடிவம்

# qSlicerLandmarkDetectionModuleWidget
source: Parameter node:
ta: அளவுரு முனை:

# qSlicerLandmarkDetectionModuleWidget
source: vtkMRMLLandmarkDetectionNode
ta: vtkmrmllandmarkdetectectionnode

# qSlicerLandmarkDetectionModuleWidget
source: Stylus tip transform:
ta: ச்டைலச் உதவிக்குறிப்பு உருமாற்றம்:

# qSlicerLandmarkDetectionModuleWidget
source: Output coordinate transform:
ta: வெளியீட்டு ஒருங்கிணைப்பு உருமாற்றம்:

# qSlicerLandmarkDetectionModuleWidget
source: Use markups output coordinates:
ta: மார்க்அப்களின் வெளியீட்டு ஆயத்தொகுதிகளைப் பயன்படுத்தவும்:

# qSlicerLandmarkDetectionModuleWidget
source: Output landmarks (optional):
ta: வெளியீட்டு அடையாளங்கள் (விரும்பினால்):

# qSlicerLandmarkDetectionModuleWidget
source: Parameters
ta: அளவுருக்கள்

# qSlicerLandmarkDetectionModuleWidget
source: Acquisition Rate (Hz):
ta: கையகப்படுத்தல் வீதம் (HZ):

# qSlicerLandmarkDetectionModuleWidget
source: Filter window time (s):
ta: சாளர நேரம் (களை) வடிகட்டவும்:

# qSlicerLandmarkDetectionModuleWidget
source: Detection time(s):
ta: கண்டறிதல் நேரம் (கள்):

# qSlicerLandmarkDetectionModuleWidget
source: Stylus shaft minimum displacement (mm):
ta: ச்டைலச் தண்டு குறைந்தபட்ச இடப்பெயர்ச்சி (மிமீ):

# qSlicerLandmarkDetectionModuleWidget
source: Stylus tip maximum displacement (mm):
ta: ச்டைலச் உதவிக்குறிப்பு அதிகபட்ச இடப்பெயர்ச்சி (மிமீ):

# qSlicerLandmarkDetectionModuleWidget
source: Minimum landmark distance (mm):
ta: குறைந்தபட்ச மைல்கல் தூரம் (மிமீ):

# qSlicerLandmarkDetectionModuleWidget
source: Start
ta: தொடங்கு

# qSlicerLandmarkDetectionModuleWidget
source: Stop
ta: நிறுத்து

# qSlicerPathExplorerModule
source: Path Explorer is a module designed to facilitate the creation of trajectory, and visualization of volumes along these trajectories For help on how to use this module visit: <a href='https://www.slicerigt.org'>SlicerIGT website</a>.
ta: பாதை எக்ச்ப்ளோரர் என்பது பாதையை உருவாக்குவதற்கு வடிவமைக்கப்பட்ட ஒரு தொகுதி, இந்த தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கான உதவிக்காக இந்த பாதைகளுடன் தொகுதிகளை காட்சிப்படுத்துதல்: <a href = 'https: //www.slicerigt.org'> ச்லைசரிக் வலைத்தளம் </ a>.

# qSlicerPathExplorerModule
source: It is supported by grants 5P01CA067165, 5R01CA124377, 5R01CA138586, 2R44DE019322, 7R01CA124377,5R42CA137886, 8P41EB015898
ta: இதை ஆதரிக்கிறது 5p01ca067165, 5r01ca124377, 5r01ca138586, 2r44de019322, 7r01ca124377,5r42ca137886, 8p41eb015898

# qSlicerPathExplorerModuleWidget
source: Form
ta: வடிவம்

# qSlicerPathExplorerModuleWidget
source: Paths:
ta: பாதைகள்:

# qSlicerPathExplorerModuleWidget
source: Trajectory list
ta: பாதை பட்டியல்

# qSlicerPathExplorerModuleWidget
source: Planning
ta: திட்டமிடல்

# qSlicerPathExplorerModuleWidget
source: Add path
ta: பாதையைச் சேர்க்கவும்

# qSlicerPathExplorerModuleWidget
source: Visualization
ta: காட்சிப்படுத்தல்

# qSlicerPathExplorerModuleWidget
source: Entry
ta: நுழைவு

# qSlicerPathExplorerModuleWidget
source: Target
ta: இலக்கு

# qSlicerPathExplorerReslicingWidget
source: Form
ta: படிவம்

# qSlicerPathExplorerReslicingWidget
source: Activate
ta: செயல்படுத்து

# qSlicerPathExplorerReslicingWidget
source: Distance:
ta: தூரம்:

# qSlicerPathExplorerReslicingWidget
source: mm
ta: மிமீ

# qSlicerPathExplorerReslicingWidget
source: Perpendicular
ta: செங்குத்து, செங்குத்தான

# qSlicerPathExplorerReslicingWidget
source: In Plane
ta: விமானத்தில்

# qSlicerPivotCalibrationModule
source: Form
ta: வடிவம்

# qSlicerPivotCalibrationModule
source: Input (ToolToReference):
ta: உள்ளீடு (உதவிக்குறிப்பு):

# qSlicerPivotCalibrationModule
source: Output (ToolTipToTool):
ta: வெளியீடு (கருவிப்பட்டியல்):

# qSlicerPivotCalibrationModule
source: Controls
ta: கட்டுப்பாடுகள்

# qSlicerPivotCalibrationModule
source: Manual
ta: கையேடு

# qSlicerPivotCalibrationModule
source: Startup delay (seconds):
ta: தொடக்க நேரந்தவறுகை (விநாடிகள்):

# qSlicerPivotCalibrationModule
source: Delay and duration (seconds):
ta: நேரந்தவறுகை மற்றும் காலம் (விநாடிகள்):

# qSlicerPivotCalibrationModule
source: Data collection will start and end after specified time.
ta: குறிப்பிட்ட நேரத்திற்குப் பிறகு தரவு சேகரிப்பு தொடங்கி முடிவடையும்.

# qSlicerPivotCalibrationModule
source: <html><head/><body><p>Start collecting data for pivot calibration. The calibration will be computed and orientation will be appropriately flipped on completion.</p></body></html>
ta: <html> <head/> <body> <p> பிவோட் அளவுத்திருத்தத்திற்கான தரவைச் சேகரிக்கத் தொடங்குங்கள். அளவுத்திருத்தம் கணக்கிடப்படும் மற்றும் நோக்குநிலை முடிந்ததும் சரியான முறையில் புரட்டப்படும். </P> </body> </html>

# qSlicerPivotCalibrationModule
source: Start Pivot Calibration
ta: பிவோட் அளவுத்திருத்தத்தைத் தொடங்கவும்

# qSlicerPivotCalibrationModule
source: <html><head/><body><p>Start collecting data for spin calibration. The calibration will be computed and orientation will be appropriately flipped on completion.</p></body></html>
ta: <html> <head/> <body> <p> சுழல் அளவுத்திருத்தத்திற்கான தரவைச் சேகரிக்கத் தொடங்குங்கள். அளவுத்திருத்தம் கணக்கிடப்படும் மற்றும் நோக்குநிலை முடிந்தவுடன் சரியான முறையில் புரட்டப்படும். </P> </body> </html>

# qSlicerPivotCalibrationModule
source: Start Spin Calibration
ta: சுழல் அளவுத்திருத்தத்தைத் தொடங்குங்கள்

# qSlicerPivotCalibrationModule
source: Countdown
ta: கவுண்டவுன்

# qSlicerPivotCalibrationModule
source: Auto
ta: தானி

# qSlicerPivotCalibrationModule
source: Spin auto-calibrate
ta: ஆட்டோ-கல்பிரேட் சுழலும்

# qSlicerPivotCalibrationModule
source: Reset
ta: மீட்டமை

# qSlicerPivotCalibrationModule
source: Stop when complete
ta: முடிந்ததும் நிறுத்துங்கள்

# qSlicerPivotCalibrationModule
source: Pivot auto-calibrate
ta: பிவோட் ஆட்டோ-கல்பிரேட்

# qSlicerPivotCalibrationModule
source: Stop
ta: நிறுத்து

# qSlicerPivotCalibrationModule
source: Results
ta: விடைகள்

# qSlicerPivotCalibrationModule
source: Root-mean-square error:
ta: ரூட்-சராசரி-சதுர பிழை:

# qSlicerPivotCalibrationModule
source: Settings
ta: அமைப்புகள்

# qSlicerPivotCalibrationModule
source: Force snap the tool's orientation to be along the closest coordinate axis.
ta: கருவியின் நோக்குநிலையை நெருங்கிய ஒருங்கிணைப்பு அச்சில் இருக்க கட்டாயப்படுத்துங்கள்.

# qSlicerPivotCalibrationModule
source: Snap rotation to right-angle
ta: வலது கோணத்திற்கு சுழற்சி

# qSlicerPivotCalibrationModule
source: If the tool points in the wrong direction, flip it to point in the opposite direction.
ta: கருவி தவறான திசையில் சுட்டிக்காட்டினால், அதை எதிர் திசையில் சுட்டிக்காட்ட அதை புரட்டவும்.

# qSlicerPivotCalibrationModule
source: Flip
ta: புரட்டுதல்

# qSlicerPivotCalibrationModule
source: Pivot input validation
ta: முன்னிலை உள்ளீட்டு சரிபார்ப்பு

# qSlicerPivotCalibrationModule
source: Minimum required orientation difference from previous pose during pivot calibration
ta: பிவோட் அளவுத்திருத்தத்தின் போது முந்தைய போசிலிருந்து குறைந்தபட்ச தேவையான நோக்குநிலை வேறுபாடு

# qSlicerPivotCalibrationModule
source: Minimum required position difference from previous pose during pivot calibration
ta: பிவோட் அளவுத்திருத்தத்தின் போது முந்தைய போசிலிருந்து குறைந்தபட்ச தேவையான நிலை வேறுபாடு

# qSlicerPivotCalibrationModule
source: mm
ta: மிமீ

# qSlicerPivotCalibrationModule
source: Minimum position difference:
ta: குறைந்தபட்ச நிலை வேறுபாடு:

# qSlicerPivotCalibrationModule
source: Minimum orientation difference:
ta: குறைந்தபட்ச நோக்குநிலை வேறுபாடு:

# qSlicerPivotCalibrationModule
source: Spin input validation
ta: உள்ளீட்டு சரிபார்ப்பு சுழல்

# qSlicerPivotCalibrationModule
source: Minimum required position difference from previous pose during spin calibration
ta: சுழல் அளவுத்திருத்தத்தின் போது முந்தைய போசிலிருந்து குறைந்தபட்ச தேவையான நிலை வேறுபாடு

# qSlicerPivotCalibrationModule
source: Minimum required orientation difference from previous pose during spin calibration
ta: சுழல் அளவுத்திருத்தத்தின் போது முந்தைய போசிலிருந்து குறைந்தபட்ச தேவையான நோக்குநிலை வேறுபாடு

# qSlicerPivotCalibrationModule
source: Maximum position difference:
ta: அதிகபட்ச நிலை வேறுபாடு:

# qSlicerPivotCalibrationModule
source: Pivot auto-calibration settings
ta: பிவோட் ஆட்டோ அளவுத்திருத்த அமைப்புகள்

# qSlicerPivotCalibrationModule
source: Completion
ta: நிறைவு

# qSlicerPivotCalibrationModule
source: Number of collected poses for pivot auto-calibration
ta: பிவோட் ஆட்டோ அளவுத்திருத்தத்திற்கான சேகரிக்கப்பட்ட போச்களின் எண்ணிக்கை

# qSlicerPivotCalibrationModule
source: Minimum error for pivot auto-calibration to be successful
ta: பிவோட் ஆட்டோ-அளவுத்திருத்தத்திற்கான குறைந்தபட்ச பிழை வெற்றிகரமாக இருக்க வேண்டும்

# qSlicerPivotCalibrationModule
source: Target error:
ta: இலக்கு பிழை:

# qSlicerPivotCalibrationModule
source: Target number of points:
ta: புள்ளிகளின் இலக்கு எண்ணிக்கை:

# qSlicerPivotCalibrationModule
source: Minimum orientation difference in collected poses for pivot auto-calibration to be successful
ta: பிவோட் ஆட்டோ-அளவுத்திருத்தத்திற்கான சேகரிக்கப்பட்ட போச்களில் குறைந்தபட்ச நோக்குநிலை வேறுபாடு வெற்றிகரமாக இருக்க வேண்டும்

# qSlicerPivotCalibrationModule
source: Buffer
ta: இடையக

# qSlicerPivotCalibrationModule
source: Maximum number of buckets:
ta: வாளிகளின் அதிகபட்ச எண்ணிக்கை:

# qSlicerPivotCalibrationModule
source: Bucket size:
ta: வாளி அளவு:

# qSlicerPivotCalibrationModule
source: Maximum number of buckets to create for pivot auto-calibration
ta: பிவோட் ஆட்டோ அளவுத்திருத்தத்திற்காக உருவாக்க அதிகபட்ச வாளிகளின் எண்ணிக்கை

# qSlicerPivotCalibrationModule
source: Maximum bucket error:
ta: அதிகபட்ச வாளி பிழை:

# qSlicerPivotCalibrationModule
source: Maximum error allowed within a bucket. All buckets are discarded if this threshold is exceeded
ta: ஒரு வாளிக்குள் அதிகபட்ச பிழை அனுமதிக்கப்படுகிறது. இந்த வாசல் மீறப்பட்டால் அனைத்து வாளிகளும் நிராகரிக்கப்படுகின்றன

# qSlicerPivotCalibrationModule
source: Number of poses to hold in each pivot auto-calibration bucket
ta: ஒவ்வொரு பிவோட் ஆட்டோ-அளவுத்திருத்த வாளியிலும் வைத்திருக்க வேண்டிய போச்களின் எண்ணிக்கை

# qSlicerPivotCalibrationModule
source: Spin auto-calibration settings
ta: ஆட்டோ அளவுத்திருத்த அமைப்புகளை சுழற்றவும்

# qSlicerPivotCalibrationModule
source: Minimum error for spin auto-calibration to be successful
ta: சுழல் ஆட்டோ-அளவுத்திருத்தத்திற்கான குறைந்தபட்ச பிழை வெற்றிகரமாக இருக்க வேண்டும்

# qSlicerPivotCalibrationModule
source: Number of collected poses for spin auto-calibration
ta: ச்பின் ஆட்டோ-அளவுத்திருத்தத்திற்கான சேகரிக்கப்பட்ட போச்களின் எண்ணிக்கை

# qSlicerPivotCalibrationModule
source: Minimum orientation difference in collected poses for spin auto-calibration to be successful
ta: ச்பின் ஆட்டோ-அளவுத்திருத்தத்திற்கான சேகரிக்கப்பட்ட போச்களில் குறைந்தபட்ச நோக்குநிலை வேறுபாடு வெற்றிகரமாக இருக்க வேண்டும்

# qSlicerPivotCalibrationModule
source: Maximum number of buckets to create for spin auto-calibration
ta: ச்பின் ஆட்டோ-அளவுத்திருத்தத்திற்காக உருவாக்க அதிகபட்ச வாளிகளின் எண்ணிக்கை

# qSlicerPivotCalibrationModule
source: Perform pivot calibration to determine the tool tip's position, by pivoting the tip of the tool about some fixed point. Perform spin calibration to determine the tool's orientation, by spinning the tool about its axis. The pivot and spin calibrations can be performed in any order. For help on how to use this module visit: <a href='https://www.slicerigt.org'>SlicerIGT website</a>.
ta: சில நிலையான புள்ளிகளைப் பற்றி கருவியின் நுனியை முன்னிலைப்படுத்துவதன் மூலம், கருவி நுனியின் நிலையை தீர்மானிக்க பிவோட் அளவுத்திருத்தத்தை செய்யுங்கள். கருவியின் நோக்குநிலையை தீர்மானிக்க சுழல் அளவுத்திருத்தத்தை செய்யுங்கள், அதன் அச்சைப் பற்றிய கருவியை சுழற்றுவதன் மூலம். பிவோட் மற்றும் ச்பின் அளவுத்திருத்தங்கள் எந்த வரிசையிலும் செய்யப்படலாம். இந்த தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கான உதவிக்கு: <a href = 'https: //www.slicerigt.org'> ச்லிசெரிக்ட் வலைத்தளம் </a>.

# qSlicerPivotCalibrationModule
source: This work was was funded by Cancer Care Ontario and the Ontario Consortium for Adaptive Interventions in Radiation Oncology (OCAIRO)
ta: இந்த வேலைக்கு புற்றுநோய் பராமரிப்பு ஒன்ராறியோ மற்றும் ஒன்ராறியோ கூட்டமைப்பு ஆகியவை கதிர்வீச்சு புற்றுநோயியல் (ஒக்காரோ) இல் தகவமைப்பு தலையீடுகளுக்காக நிதியளித்தன.

# qSlicerPivotCalibrationModule
source: Franklin King (Queen's University)
ta: பிராங்க்ளின் கிங் (குயின்ச் பல்கலைக்கழகம்)

# qSlicerPivotCalibrationModule
source: Tamas Ungi (Queen's University)
ta: Unin ஐப் பயன்படுத்துதல் (பல்கலைக்கழகத்தின் அன்புகள்)

# qSlicerPivotCalibrationModuleWidget
source: %1 seconds until start
ta: தொடங்கும் வரை %1 வினாடிகள்

# qSlicerPivotCalibrationModuleWidget
source: Sampling time left: %1
ta: மாதிரி நேரம் இடது: %1

# qSlicerPivotCalibrationModuleWidget
source: Sampling complete
ta: மாதிரி முடிந்தது

# qSlicerPivotCalibrationModuleWidget
source: Flipped.
ta: புரட்டப்பட்டது.

# qSlicerReslicePropertyWidget
source: GroupBox
ta: குழு பெட்டி

# qSlicerReslicePropertyWidget
source: Driver:
ta: இயக்கி:

# qSlicerReslicePropertyWidget
source: vtkMRMLMarkupsPlaneNode
ta: VTKMRMLMARKEP PLANENODE

# qSlicerReslicePropertyWidget
source: vtkMRMLMarkupsLineNode
ta: Vtkmrmlmarkuplineode

# qSlicerReslicePropertyWidget
source: Mode:
ta: பயன்முறை:

# qSlicerReslicePropertyWidget
source: Off
ta: அணை

# qSlicerReslicePropertyWidget
source: Axial
ta: அச்சு

# qSlicerReslicePropertyWidget
source: Sagittal
ta: சகிட்டல்

# qSlicerReslicePropertyWidget
source: Coronal
ta: கொரோனல்

# qSlicerReslicePropertyWidget
source: Inplane
ta: விளக்குகிறது

# qSlicerReslicePropertyWidget
source: Transverse
ta: குறுக்குவெட்டு

# qSlicerReslicePropertyWidget
source: Rotation:
ta: சுழற்சி:

# qSlicerReslicePropertyWidget
source: Flip
ta: புரட்டுதல்

# qSlicerSubjectHierarchyPathExplorerPlugin
source: Path Explorer trajectories
ta: பாதை எக்ச்ப்ளோரர் பாதைகள்

# qSlicerTransformPreviewWidget
source: Form
ta: வடிவம்

# qSlicerTransformPreviewWidget
source: Select nodes to preview transform
ta: முன்னோட்ட மாற்றத்திற்கு முனைகளைத் தேர்ந்தெடுக்கவும்

# qSlicerTransformPreviewWidget
source: Apply transform to selected nodes.
ta: தேர்ந்தெடுக்கப்பட்ட முனைகளுக்கு உருமாற்றத்தைப் பயன்படுத்துங்கள்.

# qSlicerTransformPreviewWidget
source: Apply
ta: விண்ணப்பிக்கவும்

# qSlicerTransformPreviewWidget
source: Harden transform to selected nodes.
ta: தேர்ந்தெடுக்கப்பட்ட முனைகளுக்கு ஆர்டன் உருமாற்றம்.

# qSlicerTransformPreviewWidget
source: Harden
ta: ஆர்டன்

# qSlicerTransformProcessorModule
source: Module Template
ta: தொகுதி வார்ப்புரு

# qSlicerTransformProcessorModule
source: Select what kind of operation to perform.
ta: எந்த வகையான செயல்பாட்டை செய்ய வேண்டும் என்பதைத் தேர்ந்தெடுக்கவும்.

# qSlicerTransformProcessorModule
source: Source Transform Nodes
ta: மூல உருமாற்ற முனைகள்

# qSlicerTransformProcessorModule
source: Select which transform you want to add below.
ta: நீங்கள் கீழே எந்த மாற்றத்தை சேர்க்க விரும்புகிறீர்கள் என்பதைத் தேர்ந்தெடுக்கவும்.

# qSlicerTransformProcessorModule
source: Remove the transform selected below.
ta: கீழே தேர்ந்தெடுக்கப்பட்ட உருமாற்றத்தை அகற்று.

# qSlicerTransformProcessorModule
source: Add the transform to the list below.
ta: உருமாற்றத்தை கீழே உள்ள பட்டியலில் சேர்க்கவும்.

# qSlicerTransformProcessorModule
source: The node in which to store the result.
ta: முடிவை சேமிக்க முனை.

# qSlicerTransformProcessorModule
source: The changed state of the input
ta: உள்ளீட்டின் மாற்றப்பட்ட நிலை

# qSlicerTransformProcessorModule
source: Input 'Forward' Transform Node:
ta: உள்ளீடு 'முன்னோக்கி' உருமாற்ற முனை:

# qSlicerTransformProcessorModule
source: The transform node *from* which the output is based (e.g. Source in SourceToTarget)
ta: வெளியீடு அடிப்படையாகக் கொண்ட * மாற்றும் முனை * (எ.கா. சோர்செட்டோடார்செட்டில் ஆதாரம்)

# qSlicerTransformProcessorModule
source: The forward transform; what should be inverted.
ta: முன்னோக்கி உருமாற்றம்; என்ன தலைகீழாக இருக்க வேண்டும்.

# qSlicerTransformProcessorModule
source: This stores all parameters for transform processing.
ta: உருமாற்ற செயலாக்கத்திற்கான அனைத்து அளவுருக்களையும் இது சேமிக்கிறது.

# qSlicerTransformProcessorModule
source: vtkMRMLTransformProcessorNode
ta: Vtkmrmltransform செயல்முறை சோர்னோட்

# qSlicerTransformProcessorModule
source: Filtering Options
ta: வடிகட்டுதல் விருப்பங்கள்

# qSlicerTransformProcessorModule
source: Stabilize:
ta: உறுதிப்படுத்தவும்:
