Repository: 247i/TACETr
Catalog: உரை/தானி/3d-slicer-slicerigt-*.po
Languages: ta

# qSlicerTransformProcessorModule
source: Check to enable filtering. If unchecked then the input transform is copied to the output without filtering.
ta: வடிகட்டலை இயக்க சரிபார்க்கவும். தேர்வு செய்யப்படாவிட்டால், உள்ளீட்டு உருமாற்றம் வடிகட்டாமல் வெளியீட்டிற்கு நகலெடுக்கப்படுகிறது.

# qSlicerTransformProcessorModule
source: Cut-off frequency:
ta: கட்-ஆஃப் அதிர்வெண்:

# qSlicerTransformProcessorModule
source: Smoother
ta: மென்மையானது

# qSlicerTransformProcessorModule
source: Faster
ta: வேகமாக

# qSlicerTransformProcessorModule
source: Parameter Node
ta: அளவுரு முனை

# qSlicerTransformProcessorModule
source: The transform node *to* which the output is based (e.g. Target in SourceToTarget)
ta: வெளியீடு அடிப்படையாகக் கொண்ட உருமாற்ற முனை * முதல் * வரை (எ.கா. Sourcetotarget இல் இலக்கு)

# qSlicerTransformProcessorModule
source: Input 'To' Transform Node:
ta: முனையை மாற்றும் 'உள்ளீடு:

# qSlicerTransformProcessorModule
source: Output Transform Node:
ta: வெளியீட்டு உருமாற்ற முனை:

# qSlicerTransformProcessorModule
source: Advanced Translation Options
ta: மேம்பட்ட மொழிபெயர்ப்பு விருப்பங்கள்

# qSlicerTransformProcessorModule
source: Copy X
ta: ஃச் நகல்

# qSlicerTransformProcessorModule
source: Copy Y
ta: ஒய் நகல்

# qSlicerTransformProcessorModule
source: Copy Z
ta: சட் நகல்

# qSlicerTransformProcessorModule
source: Input 'Anchor' Transform Node:
ta: உள்ளீடு 'நங்கூரம்' உருமாற்ற முனை:

# qSlicerTransformProcessorModule
source: The output will be expressed relative to this anchor
ta: இந்த நங்கூரத்துடன் தொடர்புடைய வெளியீடு வெளிப்படுத்தப்படும்

# qSlicerTransformProcessorModule
source: Input 'From' Transform Node:
ta: உள்ளீடு 'இலிருந்து' உருமாற்ற முனை:

# qSlicerTransformProcessorModule
source: The initial state for the transform
ta: உருமாற்றத்திற்கான ஆரம்ப நிலை

# qSlicerTransformProcessorModule
source: Advanced Rotation Options
ta: மேம்பட்ட சுழற்சி விருப்பங்கள்

# qSlicerTransformProcessorModule
source: Dependent Axes Mode
ta: சார்பு அச்சுகள் பயன்முறை

# qSlicerTransformProcessorModule
source: Primary Axis
ta: முதன்மை அச்சு

# qSlicerTransformProcessorModule
source: Secondary Axis
ta: இரண்டாம் நிலை அச்சு

# qSlicerTransformProcessorModule
source: Rotation Mode
ta: சுழற்சி முறை

# qSlicerTransformProcessorModule
source: Input 'Initial' Transform Node:
ta: 'ஆரம்ப' உருமாற்ற முனை உள்ளீடு:

# qSlicerTransformProcessorModule
source: Processing Mode:
ta: செயலாக்க முறை:

# qSlicerTransformProcessorModule
source: Click to manually update, click the checkbox to enable automatic updates
ta: கைமுறையாக புதுப்பிக்க சொடுக்கு செய்க, தானியங்கி புதுப்பிப்புகளை இயக்க தேர்வுப்பெட்டியைக் சொடுக்கு செய்க

# qSlicerTransformProcessorModule
source: Update
ta: புதுப்பிப்பு

# qSlicerTransformProcessorModule
source: Input 'Changed' Transform Node:
ta: உள்ளீடு 'மாற்றப்பட்டது' உருமாற்ற முனை:

# qSlicerTransformProcessorModule
source: Input Transform Node:
ta: உள்ளீட்டு உருமாற்ற முனை:

# qSlicerTransformProcessorModule
source: This module allows combining, inverting, stabilizing, termporal smoothing of transforms in real-time. For more information, visit <a href='https://github.com/SlicerIGT/SlicerIGT/#user-documentation'>SlicerIGT project website</a>.
ta: இந்த தொகுதி நிகழ்நேரத்தில் உருமாற்றங்களை ஒன்றிணைத்தல், தலைகீழ், உறுதிப்படுத்துதல், காலநிலை மென்மையாக்க அனுமதிக்கிறது. மேலும் தகவலுக்கு, <a href = 'https: //github.com/slicerigt/slicerigt/#user- ஆவணப்படுத்தல்'> ச்லிசெரிக்ட் திட்ட வலைத்தளம் </a> ஐப் பார்வையிடவும்.

# qSlicerTransformProcessorModule
source: This work was partially funded by Cancer Care Ontario and the Ontario Consortium for Adaptive Interventions in Radiation Oncology (OCAIRO), and by National Institute of Health (grants 5P01CA067165, 5R01CA124377, 5R01CA138586, 2R44DE019322, 7R01CA124377, 5R42CA137886, 8P41EB015898).
ta: இந்த வேலை ஓரளவு புற்றுநோய் பராமரிப்பு மற்றும் கதிர்வீச்சு ஆன்காலசியில் தகவமைப்பு தலையீடுகள் (OCAIRO), மற்றும் தேசிய சுகாதார நிறுவனம் (5r01ca124377, 5r01ca138586, 2r44de01137, 2r44dda0116, 41EB015898).

# qSlicerTransformProcessorModuleWidget
source: Compute the quaternion average of all Source transforms provided.
ta: வழங்கப்பட்ட அனைத்து மூல மாற்றங்களின் குவாட்டர்னியன் சராசரியைக் கணக்கிடுங்கள்.

# qSlicerTransformProcessorModuleWidget
source: Compute a copy of the rotation from the Source to the Reference.
ta: மூலத்திலிருந்து குறிப்புக்கு சுழற்சியின் நகலைக் கணக்கிடுங்கள்.

# qSlicerTransformProcessorModuleWidget
source: Compute a copy of the translation from the Source to the Reference.
ta: மூலத்திலிருந்து குறிப்புக்கு மொழிபெயர்ப்பின் நகலைக் கணக்கிடுங்கள்.

# qSlicerTransformProcessorModuleWidget
source: Compute a copy of the full transform from the Source to the Reference.
ta: மூலத்திலிருந்து குறிப்புக்கு முழு உருமாற்றத்தின் நகலைக் கணக்கிடுங்கள்.

# qSlicerTransformProcessorModuleWidget
source: Compute the inverse of transform to parent, and store it in another node.
ta: பெற்றோருக்கு மாற்றத்தின் தலைகீழ் கணக்கிட்டு, அதை மற்றொரு முனையில் சேமிக்கவும்.

# qSlicerTransformProcessorModuleWidget
source: Compute a constrained version of an Source transform, the translation and z direction are preserved but the other axes resemble the Target coordinate system.
ta: ஒரு மூல உருமாற்றத்தின் கட்டுப்படுத்தப்பட்ட பதிப்பைக் கணக்கிடுங்கள், மொழிபெயர்ப்பு மற்றும் சட் திசை பாதுகாக்கப்படுகிறது, ஆனால் மற்ற அச்சுகள் இலக்கு ஒருங்கிணைப்பு அமைப்பை ஒத்திருக்கின்றன.

# qSlicerTransformProcessorModuleWidget
source: Compute a stabilized transform by low-pass filtering.
ta: குறைந்த-பாச் வடிகட்டுதல் மூலம் உறுதிப்படுத்தப்பட்ட உருமாற்றத்தைக் கணக்கிடுங்கள்.

# qSlicerTransformProcessorModuleWidget
source: Update
ta: புதுப்பிப்பு

# qSlicerTransformProcessorModuleWidget
source: Auto-update
ta: தானாக புதுப்பித்தல்

# qSlicerUltrasoundSnapshotsModule
source: Form
ta: வடிவம்

# qSlicerUltrasoundSnapshotsModule
source: Display
ta: காட்சி

# qSlicerUltrasoundSnapshotsModule
source: Input
ta: உள்ளீடு

# qSlicerUltrasoundSnapshotsModule
source: Ultrasound image:
ta: அல்ட்ராசவுண்ட் படம்:

# qSlicerUltrasoundSnapshotsModule
source: Controls
ta: கட்டுப்பாடுகள்

# qSlicerUltrasoundSnapshotsModule
source: Add snapshot
ta: ச்னாப்சாட் சேர்க்கவும்

# qSlicerUltrasoundSnapshotsModule
source: Preserve image window and level attributes
ta: பட சாளரம் மற்றும் நிலை பண்புகளை பாதுகாக்கவும்

# qSlicerUltrasoundSnapshotsModule
source: Clear snapshots
ta: தெளிவான ச்னாப்சாட்கள்

# qSlicerUltrasoundSnapshotsModule
source: Module for taking a snapshot of a position tracked ultrasound image and display it as a model node. For help on how to use this module visit: <a href='https://www.slicerigt.org'>SlicerIGT website</a>.
ta: அல்ட்ராசவுண்ட் படத்தைக் கண்காணிக்கும் நிலையின் ச்னாப்சாட்டை எடுத்து அதை மாதிரி முனையாக காண்பிப்பதற்கான தொகுதி. இந்த தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கான உதவிக்கு: <a href = 'https: //www.slicerigt.org'> ச்லிசெரிக்ட் வலைத்தளம் </a>.

# qSlicerUltrasoundSnapshotsModule
source: This work was was funded by Cancer Care Ontario and the Ontario Consortium for Adaptive Interventions in Radiation Oncology (OCAIRO)
ta: இந்த வேலைக்கு புற்றுநோய் பராமரிப்பு ஒன்ராறியோ மற்றும் ஒன்ராறியோ கூட்டமைப்பு ஆகியவை கதிர்வீச்சு புற்றுநோயியல் (ஒக்காரோ) இல் தகவமைப்பு தலையீடுகளுக்காக நிதியளித்தன.

# qSlicerUltrasoundSnapshotsModuleWidget
source: This action will delete all snapshots.
ta: இந்த நடவடிக்கை அனைத்து ச்னாப்சாட்களையும் நீக்கிவிடும்.

# qSlicerUltrasoundSnapshotsModuleWidget
source: Continue with this action?
ta: இந்த நடவடிக்கையைத் தொடரவா?

# qSlicerVolumeReconstructionModule
source: Form
ta: வடிவம்

# qSlicerVolumeReconstructionModule
source: Volume reconstruction node:
ta: தொகுதி புனரமைப்பு முனை:

# qSlicerVolumeReconstructionModule
source: vtkMRMLVolumeReconstructionNode
ta: vtkmrmlvolulumereconstructionnode

# qSlicerVolumeReconstructionModule
source: Volume reconstruction
ta: தொகுதி புனரமைப்பு

# qSlicerVolumeReconstructionModule
source: Input sequence browser containing the images and transforms used for volume reconstruction
ta: தொகுதி புனரமைப்புக்கு பயன்படுத்தப்படும் படங்கள் மற்றும் உருமாற்றங்களைக் கொண்ட உள்ளீட்டு வரிசை உலாவி

# qSlicerVolumeReconstructionModule
source: Input sequence browser:
ta: உள்ளீட்டு வரிசை உலாவி:

# qSlicerVolumeReconstructionModule
source: Output reconstructed volume node
ta: வெளியீடு புனரமைக்கப்பட்ட தொகுதி முனை

# qSlicerVolumeReconstructionModule
source: Output volume node:
ta: வெளியீட்டு தொகுதி முனை:

# qSlicerVolumeReconstructionModule
source: Region of interest in which the volume should be reconstructed.
ta: தொகுதி புனரமைக்கப்பட வேண்டிய ஆர்வமுள்ள பகுதி.

# qSlicerVolumeReconstructionModule
source: ROI node:
ta: ஏனென்றால் அது அவ்வாறு:

# qSlicerVolumeReconstructionModule
source: vtkMRMLMarkupsROINode
ta: vtkmrmlmarkepsroinode

# qSlicerVolumeReconstructionModule
source: ROI node visibility
ta: ROI முனை தெரிவுநிலை

# qSlicerVolumeReconstructionModule
source: Output image spacing for each dimension of the reconstructed volume.
ta: புனரமைக்கப்பட்ட தொகுதியின் ஒவ்வொரு பரிமாணத்திற்கும் வெளியீட்டு பட இடைவெளி.

# qSlicerVolumeReconstructionModule
source: Output spacing:
ta: வெளியீட்டு இடைவெளி:

# qSlicerVolumeReconstructionModule
source: Output image spacing for "I" dimension of the reconstructed volume
ta: புனரமைக்கப்பட்ட தொகுதியின் "நான்" பரிமாணத்திற்கான வெளியீட்டு பட இடைவெளி

# qSlicerVolumeReconstructionModule
source: Output image spacing for "J" dimension of the reconstructed volume
ta: புனரமைக்கப்பட்ட தொகுதியின் "சே" பரிமாணத்திற்கான வெளியீட்டு பட இடைவெளி

# qSlicerVolumeReconstructionModule
source: Output image spacing for "K" dimension of the reconstructed volume
ta: புனரமைக்கப்பட்ட தொகுதியின் "கே" பரிமாணத்திற்கான வெளியீட்டு பட இடைவெளி

# qSlicerVolumeReconstructionModule
source: Interpolation mode used for performing the volume reconstruction
ta: தொகுதி புனரமைப்பு செய்ய பயன்படுத்தப்படும் இடைக்கணிப்பு பயன்முறை

# qSlicerVolumeReconstructionModule
source: Interpolation mode:
ta: இடைக்கணிப்பு முறை:

# qSlicerVolumeReconstructionModule
source: Optimization mode (turn off optimization only if it is not stable on your architecture).
ta: உகப்பாக்கம் பயன்முறை (உங்கள் கட்டமைப்பில் நிலையானதாக இல்லாவிட்டால் மட்டுமே தேர்வுமுறை அணைக்கவும்).

# qSlicerVolumeReconstructionModule
source: Optimization mode:
ta: தேர்வுமுறை முறை:

# qSlicerVolumeReconstructionModule
source: Optimization mode (turn off optimization only if it is not stable on your architecture)
ta: உகப்பாக்கம் பயன்முறை (உங்கள் கட்டமைப்பில் நிலையானதாக இல்லாவிட்டால் மட்டுமே தேர்வுமுறை அணைக்கவும்)

# qSlicerVolumeReconstructionModule
source: Method for compounding overlapping input pixels
ta: ஒன்றுடன் ஒன்று உள்ளீட்டு பிக்சல்களை ஒருங்கிணைப்பதற்கான முறை

# qSlicerVolumeReconstructionModule
source: Compounding mode:
ta: கூட்டு முறை:

# qSlicerVolumeReconstructionModule
source: Indicates if hole filling should be applied on reconstructed volume
ta: புனரமைக்கப்பட்ட அளவில் துளை நிரப்புதல் பயன்படுத்தப்பட வேண்டுமா என்பதைக் குறிக்கிறது

# qSlicerVolumeReconstructionModule
source: Fill holes:
ta: துளைகளை நிரப்பவும்:

# qSlicerVolumeReconstructionModule
source: Number of threads used for processing the data (Choose 0 for maximum speed). The reconstruction result is slightly different if more than one thread is used because due to interpolation and rounding errors is influenced by the order the pixels are processed.
ta: தரவைச் செயலாக்கப் பயன்படுத்தப்படும் நூல்களின் எண்ணிக்கை (அதிகபட்ச வேகத்திற்கு 0 ஐத் தேர்வுசெய்க). ஒன்றுக்கு மேற்பட்ட நூல்களைப் பயன்படுத்தினால் புனரமைப்பு முடிவு சற்று வித்தியாசமானது, ஏனெனில் இடைக்கணிப்பு மற்றும் ரவுண்டிங் பிழைகள் காரணமாக படப்புள்ளிகள் செயலாக்கப்படும் வரிசையால் பாதிக்கப்படுகின்றன.

# qSlicerVolumeReconstructionModule
source: Number of threads:
ta: நூல்களின் எண்ணிக்கை:

# qSlicerVolumeReconstructionModule
source: Only every N images from the input will be used in the reconstruction
ta: உள்ளீட்டிலிருந்து ஒவ்வொரு n படங்களும் மட்டுமே புனரமைப்பில் பயன்படுத்தப்படும்

# qSlicerVolumeReconstructionModule
source: Skip interval:
ta: இடைவெளியைத் தவிர்க்கவும்:

# qSlicerVolumeReconstructionModule
source: Live update interval:
ta: நேரடி புதுப்பிப்பு இடைவெளி:

# qSlicerVolumeReconstructionModule
source: s
ta: கள்

# qSlicerVolumeReconstructionModule
source: Input volume node:
ta: உள்ளீட்டு தொகுதி முனை:

# qSlicerVolumeReconstructionModule
source: vtkMRMLSequenceBrowserNode
ta: VTKMRMLLESSBROWERSERNODE

# qSlicerVolumeReconstructionModule
source: Input method:
ta: உள்ளீட்டு முறை:

# qSlicerVolumeReconstructionModule
source: Recorded sequence reconstruction
ta: பதிவுசெய்யப்பட்ட வரிசை புனரமைப்பு

# qSlicerVolumeReconstructionModule
source: Live volume reconstruction
ta: நேரடி தொகுதி புனரமைப்பு

# qSlicerVolumeReconstructionModule
source: Clipping
ta: கிளிப்பிங்

# qSlicerVolumeReconstructionModule
source: Crop rectangle origin (in pixels).
ta: பயிர் செவ்வக தோற்றம் (பிக்சல்களில்).

# qSlicerVolumeReconstructionModule
source: Clip rectangle origin:
ta: கிளிப் செவ்வக தோற்றம்:

# qSlicerVolumeReconstructionModule
source: Crop rectangle origin X component (in pixels).
ta: பயிர் செவ்வக தோற்றம் ஃச் கூறு (பிக்சல்களில்).

# qSlicerVolumeReconstructionModule
source: Crop rectangle origin Y component(in pixels).
ta: பயிர் செவ்வக தோற்றம் ஒய் கூறு (பிக்சல்களில்).

# qSlicerVolumeReconstructionModule
source: Crop rectangle size (in pixels).
ta: பயிர் செவ்வக அளவு (பிக்சல்களில்).

# qSlicerVolumeReconstructionModule
source: Clip rectangle size:
ta: கிளிப் செவ்வக அளவு:

# qSlicerVolumeReconstructionModule
source: Crop rectangle size X component (in pixels).
ta: பயிர் செவ்வக அளவு ஃச் கூறு (பிக்சல்களில்).

# qSlicerVolumeReconstructionModule
source: Crop rectangle size Y component (in pixels).
ta: பயிர் செவ்வக அளவு ஒய் கூறு (பிக்சல்களில்).

# qSlicerVolumeReconstructionModule
source: Fan angles
ta: சுவைஞர் கோணங்கள்

# qSlicerVolumeReconstructionModule
source: Only the region within the two fan angles will be reconstructed
ta: இரண்டு சுவைஞர் கோணங்களில் உள்ள பகுதி மட்டுமே புனரமைக்கப்படும்

# qSlicerVolumeReconstructionModule
source: Fan angle:
ta: சுவைஞர் கோணம்:

# qSlicerVolumeReconstructionModule
source: First fan angle used for clipping. Only the region within the two fan angles will be reconstructed
ta: கிளிப்பிங்கிற்கு பயன்படுத்தப்படும் முதல் விசிறி கோணம். இரண்டு சுவைஞர் கோணங்களில் உள்ள பகுதி மட்டுமே புனரமைக்கப்படும்

# qSlicerVolumeReconstructionModule
source: Second fan angle used for clipping. Only the region within the two fan angles will be reconstructed
ta: கிளிப்பிங்கிற்கு பயன்படுத்தப்படும் இரண்டாவது விசிறி கோணம். இரண்டு சுவைஞர் கோணங்களில் உள்ள பகுதி மட்டுமே புனரமைக்கப்படும்

# qSlicerVolumeReconstructionModule
source: Reset
ta: மீட்டமை

# qSlicerVolumeReconstructionModule
source: Apply
ta: இடு

# qSlicerVolumeReconstructionModule
source: This is a module for reconstructing image volumes from sequences. If you have questions, or encounter an problem, submit an issue on the <a href="https://github.com/SlicerIGT/SlicerIGT">GitHub page</a>.
ta: காட்சிகளிலிருந்து பட தொகுதிகளை புனரமைப்பதற்கான ஒரு தொகுதி இது. உங்களிடம் கேள்விகள் இருந்தால், அல்லது சிக்கலை எதிர்கொண்டால், <a href = "https://github.com/slicerigt/slicerigt"> அறிவிலிமையம் பக்கம் </a> இல் ஒரு சிக்கலை சமர்ப்பிக்கவும்.

# qSlicerVolumeReconstructionModule
source: This module was developed through support from CANARIE's Research Software Program, and Cancer Care Ontario.
ta: இந்த தொகுதி கனரியின் ஆராய்ச்சி மென்பொருள் நிரல் மற்றும் புற்றுநோய் பராமரிப்பு ஒன்ராறியோவின் உதவி மூலம் உருவாக்கப்பட்டது.

# qSlicerVolumeReconstructionModule
source: Sequences
ta: வரிசைகள்

# qSlicerVolumeReconstructionModuleWidget
source: Nearest neighbor
ta: அருகிலுள்ள அண்டை

# qSlicerVolumeReconstructionModuleWidget
source: Linear
ta: நேரியல்

# qSlicerVolumeReconstructionModuleWidget
source: Full optimization
ta: முழு தேர்வுமுறை

# qSlicerVolumeReconstructionModuleWidget
source: Partial optimization
ta: பகுதி தேர்வுமுறை

# qSlicerVolumeReconstructionModuleWidget
source: No optimization
ta: தேர்வுமுறை இல்லை

# qSlicerVolumeReconstructionModuleWidget
source: GPU acceleration (OpenCL)
ta: GPU முடுக்கம் (OpenCl)

# qSlicerVolumeReconstructionModuleWidget
source: Latest
ta: அண்மைக் கால

# qSlicerVolumeReconstructionModuleWidget
source: Maximum
ta: பெருமம்

# qSlicerVolumeReconstructionModuleWidget
source: Mean
ta: இடை, சராசரி

# qSlicerVolumeReconstructionModuleWidget
source: Importance mask
ta: முக்கியத்துவம் முகமூடி

# qSlicerVolumeReconstructionModuleWidget
source: Volume reconstruction
ta: தொகுதி புனரமைப்பு

# qSlicerVolumeReconstructionModuleWidget
source: Reconstructing volume...
ta: தொகுதி புனரமைப்பு ...

# qSlicerVolumeReconstructionModuleWidget
source: Start
ta: தொடங்கு

# qSlicerVolumeReconstructionModuleWidget
source: Stop
ta: நிறுத்து

# qSlicerVolumeReconstructionModuleWidget
source: Apply
ta: இடு

# qSlicerVolumeResliceDriverModule
source: Form
ta: வடிவம்

# qSlicerVolumeResliceDriverModule
source: Reslicing Driver
ta: டிரைவரைத் திசைதிருப்பவும்

# qSlicerVolumeResliceDriverModule
source: Advanced options
ta: மேம்பட்ட விருப்பங்கள்

# qSlicerVolumeResliceDriverModule
source: Show advanced options
ta: மேம்பட்ட விருப்பங்களைக் காட்டு

# qSlicerVolumeResliceDriverModule
source: This module allows to set reslicing planes by using linear transforms nodes or positions/orientations in image nodes. For help on how to use this module visit: <a href='https://www.slicerigt.org'>SlicerIGT website</a>.
ta: பட முனைகளில் நேரியல் உருமாற்றம் முனைகள் அல்லது நிலைகள்/நோக்குநிலைகளைப் பயன்படுத்துவதன் மூலம் இந்த தொகுதி மறுக்கும் விமானங்களை அமைக்க அனுமதிக்கிறது. இந்த தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கான உதவிக்கு: <a href = 'https: //www.slicerigt.org'> ச்லிசெரிக்ட் வலைத்தளம் </a>.

# qSlicerVolumeResliceDriverModule
source: This work was supported by NIH National Center for Image Guided Therapy, and National Alliance for Medical Image Computing.
ta: இந்த வேலையை பட வழிகாட்டுதல் சிகிச்சைக்கான என்ஐஎச் தேசிய நடுவண் மற்றும் மருத்துவ பட கம்ப்யூட்டிங்கிற்கான தேசிய கூட்டணி ஆதரித்தது.

# qSlicerWatchdogModule
source: Displays warning if selected transforms are not continuously updated. It is useful for detecting tracking errors, such as occluded marker or network connection error. For help on how to use this module visit: <a href='http://www.slicerigt.org/'>SlicerIGT website</a>.
ta: தேர்ந்தெடுக்கப்பட்ட உருமாற்றங்கள் தொடர்ந்து புதுப்பிக்கப்படாவிட்டால் எச்சரிக்கையைக் காட்டுகிறது. மறைமுக மார்க்கர் அல்லது பிணைய இணைப்பு பிழை போன்ற கண்காணிப்பு பிழைகளைக் கண்டறிய இது பயனுள்ளதாக இருக்கும். இந்த தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கான உதவிக்கு: <a href = 'http: //www.slicerigt.org/'> ச்லிசெரிக்ட் வலைத்தளம் </a>.

# qSlicerWatchdogModule
source: This work was was funded by Cancer Care Ontario and the Ontario Consortium for Adaptive Interventions in Radiation Oncology (OCAIRO)
ta: இந்த வேலைக்கு புற்றுநோய் பராமரிப்பு ஒன்ராறியோ மற்றும் ஒன்ராறியோ கூட்டமைப்பு ஆகியவை கதிர்வீச்சு புற்றுநோயியல் (ஒக்காரோ) இல் தகவமைப்பு தலையீடுகளுக்காக நிதியளித்தன.

# qSlicerWatchdogModuleWidget
source: Form
ta: வடிவம்

# qSlicerWatchdogModuleWidget
source: Watchdog node:
ta: வாட்ச் டாக் முனை:

# qSlicerWatchdogModuleWidget
source: Observed nodes
ta: கவனிக்கப்பட்ட முனைகள்

# qSlicerWatchdogModuleWidget
source: Add the selected node to the list of watched nodes
ta: பார்த்த முனைகளின் பட்டியலில் தேர்ந்தெடுக்கப்பட்ட முனையைச் சேர்க்கவும்

# qSlicerWatchdogModuleWidget
source: Add
ta: கூட்டு

# qSlicerWatchdogModuleWidget
source: Remove the node selected in the table from the list of watched nodes
ta: பார்த்த முனைகளின் பட்டியலிலிருந்து அட்டவணையில் தேர்ந்தெடுக்கப்பட்ட முனையை அகற்றவும்

# qSlicerWatchdogModuleWidget
source: Display
ta: காட்சி

# qSlicerWatchdogModuleWidget
source: &Visible:
ta: & தெரியும்:

# qSlicerWatchdogModuleWidget
source: View:
ta: காண்க:

# qSlicerWatchdogModuleWidget
source: Select views in which to show this node. All unchecked shows in all 3D and 2D views.
ta: இந்த முனையைக் காண்பிக்கும் காட்சிகளைத் தேர்ந்தெடுக்கவும். அனைத்து 3D மற்றும் 2D பார்வைகளிலும் தேர்வு செய்யப்படாத அனைத்து நிகழ்ச்சிகளும்.

# qSlicerWatchdogModuleWidget
source: Opacity:
ta: ஒளிபுகாநிலை:

# qSlicerWatchdogModuleWidget
source: Background color
ta: பின்னணி நிறம்

# qSlicerWatchdogModuleWidget
source: Text Color:
ta: உரை நிறம்:

# qSlicerWatchdogModuleWidget
source: Font size
ta: எழுத்துரு அளவு

# qSlicerWatchdogModuleWidget
source: pt
ta: பக்

# qSlicerWatchdogModuleWidget
source: Events
ta: நிகழ்வுகள்

# qSlicerWatchdogModuleWidget
source: <html><head/><body><p>Watch transform modified event:</p></body></html>
ta: <html> <head/> <body> <p> மாற்றியமைக்கப்பட்ட நிகழ்வைப் பாருங்கள்: </p> </body> </html>

# qSlicerWatchdogModuleWidget
source: Name
ta: பெயர்

# qSlicerWatchdogModuleWidget
source: Message
ta: செய்தி

# qSlicerWatchdogModuleWidget
source: Sound
ta: ஒலி

# qSlicerWatchdogModuleWidget
source: Status
ta: நிலை

# qSlicerWatchdogModuleWidget
source: Make list active
ta: பட்டியலை செயலில் செய்யுங்கள்

# qSlicerWatchdogModuleWidget
source: Delete highlighted row
ta: சிறப்பம்சமான வரிசையை நீக்கு

# qSlicerWatchdogModuleWidget
source: valid
ta: செல்லுபடியாகும்

# qSlicerWatchdogModuleWidget
source: invalid
ta: செல்லுபடியாகாத

# vtkMRMLFiducialRegistrationWizardNode
source: Manual
ta: கையேடு

# vtkMRMLFiducialRegistrationWizardNode
source: Automatic
ta: தானியங்கி

# vtkMRMLFiducialRegistrationWizardNode
source: Unknown
ta: தெரியவில்லை
