Repository: 247i/TACETr
Catalog: உரை/தானி/3d-slicer-slicerigt-*.po
Languages: ta

# FiducialsToModelRegistration
source: This module registers fiducial list to a model surface using iterative closest points (ICP) method. For help on how to use this module visit: <a href='https://www.slicerigt.org'>SlicerIGT website</a>.
ta: இந்த தொகுதி நம்பகமான பட்டியலை ஒரு மாதிரி மேற்பரப்பில் பதிவுசெய்கிறது. இந்த தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கான உதவிக்கு: <a href = 'https: //www.slicerigt.org'> ச்லிசெரிக்ட் வலைத்தளம் </a>.

# FiducialsToModelRegistration
source: This file was originally developed by Jean-Christophe Fillion-Robin, Kitware Inc. and Steve Pieper, Isomics, Inc. and was partially funded by NIH grant 3P41RR013218-12S1.
ta: இந்த கோப்பை முதலில் சீன்-கிறிச்டோஃப் பில்லியன்-ராபின், கிட்வேர் இன்க். மற்றும் ச்டீவ் பைபர், ஐசோமிக்ச், இன்க். மற்றும் ஓரளவு என்ஐஎச் கிராண்ட் 3P41RR013218-12S1 ஆல் நிதியளிக்கப்பட்டது.

# FiducialsToModelRegistration
source: Pick the input fiducial list for the algorithm.
ta: வழிமுறைக்கான உள்ளீட்டு நம்பகமான பட்டியலைத் தேர்ந்தெடுக்கவும்.

# FiducialsToModelRegistration
source: Input fiducials:
ta: உள்ளீட்டு நம்பகத்தன்மை:

# FiducialsToModelRegistration
source: Pick the input model for the algorithm.
ta: வழிமுறைக்கான உள்ளீட்டு மாதிரியைத் தேர்ந்தெடுக்கவும்.

# FiducialsToModelRegistration
source: Input model:
ta: உள்ளீட்டு மாதிரி:

# FiducialsToModelRegistration
source: Pick the output to the algorithm.
ta: அல்காரிதத்திற்கு வெளியீட்டைத் தேர்ந்தெடுக்கவும்.

# FiducialsToModelRegistration
source: Output transform:
ta: வெளியீட்டு உருமாற்றம்:

# FiducialsToModelRegistration
source: If checked, take screen shots for tutorials. Use Save Data to write them to disk.
ta: சரிபார்க்கப்பட்டால், பயிற்சிகளுக்கு திரை சாட்களை எடுத்துக் கொள்ளுங்கள். தரவை வட்டுக்கு எழுத சேமி பயன்படுத்தவும்.

# FiducialsToModelRegistration
source: Set scale factor for the screen shots.
ta: திரை சாட்களுக்கான அளவிலான காரணியை அமைக்கவும்.

# FiducialsToModelRegistration
source: Run the algorithm.
ta: அல்காரிதத்தை இயக்கவும்.

# FiducialsToModelRegistration
source: Output
ta: வெளியீடு

# FiducialsToModelRegistration
source: Mean distance after registration:
ta: பதிவுசெய்த பிறகு சராசரி தூரம்:

# FiducialsToModelRegistration
source: Advanced
ta: மேம்பட்ட

# FiducialsToModelRegistration
source: Transform type:
ta: மாற்றும் வகை:

# FiducialsToModelRegistration
source: Number of iterations:
ta: மறு செய்கைகளின் எண்ணிக்கை:

# Guidelet.GuideletLoadable
source: Guidelet
ta: வழிகாட்டுதல்

# Guidelet.GuideletLoadable
source: Guidelet launcher
ta: வழிகாட்டுதல் துவக்கி

# Guidelet.GuideletLoadable
source: Set the Plus Server Host and Name Port:
ta: பிளச் சர்வர் புரவலன் மற்றும் பெயர் போர்ட்டை அமைக்கவும்:

# Guidelet.GuideletLoadable
source: Select Configuration:
ta: உள்ளமைவைத் தேர்ந்தெடுக்கவும்:

# GuideletLib.Guidelet
source: Settings
ta: அமைப்புகள்

# GuideletLib.Guidelet
source: Select connector node
ta: இணைப்பான் முனையைத் தேர்ந்தெடுக்கவும்

# GuideletLib.Guidelet
source: OpenIGTLink connector:
ta: Openigtlink இணைப்பு:

# GuideletLib.Guidelet
source: Show 3D Slicer user interface
ta: 3D ச்லைசர் பயனர் இடைமுகத்தைக் காட்டு

# GuideletLib.Guidelet
source: Show Guidelet in full screen
ta: முழு திரையில் வழிகாட்டுதலைக் காட்டு

# GuideletLib.Guidelet
source: Save Guidelet scene
ta: வழிகாட்டுதல் காட்சியை சேமிக்கவும்

# GuideletLib.Guidelet
source: Save scene directory:
ta: காட்சி கோப்பகத்தை சேமிக்கவும்:

# GuideletLib.Guidelet
source: Exit
ta: வெளியேறு

# GuideletLib.UltraSound
source: Ultrasound
ta: ஊடொலி

# GuideletLib.UltraSound
source: Start Recording
ta: பதிவு செய்யத் தொடங்குங்கள்

# GuideletLib.UltraSound
source: If clicked, start recording
ta: சொடுக்கு செய்தால், பதிவு செய்யத் தொடங்குங்கள்

# GuideletLib.UltraSound
source: Freeze
ta: முடக்கம்

# GuideletLib.UltraSound
source: Brightness
ta: ஒளி

# GuideletLib.UltraSound
source: Normal
ta: சாதாரண

# GuideletLib.UltraSound
source: Bright
ta: பிரகாசமான

# GuideletLib.UltraSound
source: Brighter
ta: பிரகாசமான

# GuideletLib.UltraSound
source: Stop Recording
ta: பதிவு செய்வதை நிறுத்துங்கள்

# GuideletLib.UltraSound
source: Recording is being started...
ta: பதிவு தொடங்கப்படுகிறது ...

# GuideletLib.UltraSound
source: Start Recording
ta: பதிவு செய்யத் தொடங்குங்கள்

# GuideletLib.UltraSound
source: Recording is being stopped...
ta: பதிவு நிறுத்தப்படுகிறது ...

source: Model Registration
ta: மாதிரி பதிவு

# ModelRegistration
source: This module applies Iterative Closest Points registration between two surface models. For help on how to use this module visit: <a href='https://www.slicerigt.org'>SlicerIGT website</a>.
ta: இந்த தொகுதி இரண்டு மேற்பரப்பு மாதிரிகள் இடையே நெருக்கமான புள்ளிகள் பதிவைப் பயன்படுத்துகிறது. இந்த தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கான உதவிக்கு: <a href = 'https: //www.slicerigt.org'> ச்லிசெரிக்ட் வலைத்தளம் </a>.

# ModelRegistration
source: This work is part of SparKit project, funded by Cancer Care Ontario (CCO)'s ACRU program and Ontario Consortium for Adaptive Interventions in Radiation Oncology (OCAIRO).
ta: இந்த வேலை ச்பார்கிட் திட்டத்தின் ஒரு பகுதியாகும், இது புற்றுநோய் பராமரிப்பு ஒன்ராறியோ (சி.சி.ஓ) இன் அக்யூ திட்டம் மற்றும் கதிர்வீச்சு புற்றுநோயியல் (ஒக்கைரோ) இல் தகவமைப்பு தலையீடுகளுக்கான ஒன்ராறியோ கூட்டமைப்பு ஆகியவற்றால் நிதியளிக்கப்படுகிறது.

# ModelRegistration
source: Parameters
ta: அளவுருக்கள்

# ModelRegistration
source: Note: Parent transforms of models are not used. Models should be defined in the coordinate system that is being registered.
ta: குறிப்பு: மாதிரிகளின் பெற்றோர் மாற்றங்கள் பயன்படுத்தப்படவில்லை. பதிவு செய்யப்படும் ஒருங்கிணைப்பு அமைப்பில் மாதிரிகள் வரையறுக்கப்பட வேண்டும்.

# ModelRegistration
source: Select the model the other will be transformed to. This model required to contain a dense set of points.
ta: மற்றொன்று மாற்றப்படும் மாதிரியைத் தேர்ந்தெடுக்கவும். இந்த மாதிரியானது அடர்த்தியான புள்ளிகளைக் கொண்டிருக்க வேண்டும்.

# ModelRegistration
source: Select the model that will be transformed. This model may require a sparse set of points.
ta: மாற்றப்படும் மாதிரியைத் தேர்ந்தெடுக்கவும். இந்த மாதிரிக்கு ஒரு சிதறிய புள்ளிகள் தேவைப்படலாம்.

# ModelRegistration
source: Input moving (sparse) model:
ta: உள்ளீட்டு நகரும் (சிதறிய) மாதிரி:

# ModelRegistration
source: Pick the moving to fixed transform computed by the algorithm.
ta: வழிமுறையால் கணக்கிடப்பட்ட நிலையான உருமாற்றத்திற்கு நகர்வதைத் தேர்ந்தெடுக்கவும்.

# ModelRegistration
source: Output transform:
ta: வெளியீட்டு உருமாற்றம்:

# ModelRegistration
source: Run the algorithm.
ta: வழிமுறையை இயக்கவும்.

# ModelRegistration
source: Output
ta: வெளியீடு

# ModelRegistration
source: Mean distance after registration:
ta: பதிவுசெய்த பிறகு சராசரி தூரம்:

# ModelRegistration
source: Advanced
ta: மேம்படுத்தபட்ட

# ModelRegistration
source: Number of iterations:
ta: மறு செய்கைகளின் எண்ணிக்கை:

# ModelRegistration
source: Test is not implemented for ModelRegistration
ta: மாதிரி பதிவு செய்ய சோதனை செயல்படுத்தப்படவில்லை

# SequenceReplay
source: Time series
ta: காலத்தொடர்

# SequenceReplay
source: Add
ta: கூட்டு

# SequenceReplay
source: Recorded nodes
ta: பதிவுசெய்யப்பட்ட முனைகள்

source: Sequence Replay
ta: வரிசை மறுபதிப்பு

# SequenceReplay
source: This is an example of scripted loadable module bundled in an extension. See more information in <a href="https://github.com/organization/projectname#SequenceReplay">module documentation</a>.
ta: நீட்டிப்பில் தொகுக்கப்பட்ட ச்கிரிப்ட் செய்யப்பட்ட ஏற்றக்கூடிய தொகுதிக்கு இது ஒரு எடுத்துக்காட்டு. மேலும் தகவல்களை <a href = "https://github.com/organization/projectname#-coustencereplay"> தொகுதி ஆவணங்கள் </a> இல் காண்க.

# SequenceReplay
source: This file was originally developed by Jean-Christophe Fillion-Robin, Kitware Inc., Andras Lasso, PerkLab, and Steve Pieper, Isomics, Inc. and was partially funded by NIH grant 3P41RR013218-12S1.
ta: இந்த கோப்பை முதலில் சீன்-கிறிச்டோஃப் பில்லியன்-ராபின், கிட்வேர் இன்க்., ஆண்ட்ராச் லாசோ, பெர்க்லாப், உருவாக்கியது மற்றும் ச்டீவ் பைபர், ஐசோமிக்ச், இன்க். மற்றும் ஓரளவு என்ஐஎச் கிராண்ட் 3P41RR013218-12S1 ஆல் நிதியளிக்கப்பட்டது.

source: Texture Model
ta: அமைப்பு மாதிரி

# TextureModel
source: This module applies a texture (stored in a volume node) to a model node. It is typically used to display colored surfaces, provided by surface scanners, exported in OBJ format. The model must contain texture coordinates. Only a single texture file per model is supported. For more information, visit <a href='https://github.com/SlicerIGT/SlicerIGT/#user-documentation'>SlicerIGT project website</a>.
ta: இந்த தொகுதி ஒரு மாதிரி முனைக்கு ஒரு அமைப்பை (தொகுதி முனையில் சேமிக்கப்படுகிறது) பயன்படுத்துகிறது. இது பொதுவாக வண்ண மேற்பரப்புகளைக் காண்பிக்கப் பயன்படுகிறது, மேற்பரப்பு ச்கேனர்களால் வழங்கப்படுகிறது, OBJ வடிவத்தில் ஏற்றுமதி செய்யப்படுகிறது. மாதிரியில் அமைப்பு ஒருங்கிணைப்புகள் இருக்க வேண்டும். ஒரு மாதிரிக்கு ஒரு அமைப்பு கோப்பு மட்டுமே ஆதரிக்கப்படுகிறது. மேலும் தகவலுக்கு, <a href = 'https: //github.com/slicerigt/slicerigt/#user- ஆவணப்படுத்தல்'> ச்லிசெரிக்ட் திட்ட வலைத்தளம் </a> ஐப் பார்வையிடவும்.

# TextureModel
source: Parameters
ta: அளவுருக்கள்

# TextureModel
source: Model node containing geometry and texture coordinates.
ta: வடிவியல் மற்றும் அமைப்பு ஒருங்கிணைப்புகளைக் கொண்ட மாதிரி முனை.

# TextureModel uchar-vector
source: RGB vector
ta: ஆர்சிபி திசையன்

# TextureModel float-vector
source: RGB float vector
ta: RGB மிதவை திசையன்

# TextureModel float-components
source: RGB float components
ta: RGB மிதவை கூறுகள்

# TextureModel
source: Save color in point data. "RGB vector" is recommended for compatibility with most software. The point data may be used for thresholding or color-based processing.
ta: புள்ளி தரவுகளில் வண்ணத்தை சேமிக்கவும். பெரும்பாலான மென்பொருளுடன் பொருந்தக்கூடிய தன்மைக்கு "ஆர்சிபி வெக்டர்" பரிந்துரைக்கப்படுகிறது. புள்ளி தரவு வாசல் அல்லது வண்ண அடிப்படையிலான செயலாக்கத்திற்கு பயன்படுத்தப்படலாம்.

# TextureModel
source: Apply texture to selected model.
ta: தேர்ந்தெடுக்கப்பட்ட மாதிரிக்கு அமைப்பைப் பயன்படுத்துங்கள்.

# TextureModel
source: Finished with download and loading
ta: பதிவிறக்கம் மற்றும் ஏற்றுதல் மூலம் முடிந்தது

# TextureModel
source: Test passed!
ta: சோதனை கடந்துவிட்டது!

source: Viewpoint
ta: பார்வை

# Viewpoint
source: This module adjusts camera viewpoint of a 3D viewer. Bullseye View: position/orient the camera using a tracked tool. For help on how to use this module visit: <a href='https://www.slicerigt.org'>SlicerIGT website</a>.
ta: இந்த தொகுதி 3D பார்வையாளரின் கேமரா பார்வையை சரிசெய்கிறது. புல்செய் பார்வை: கண்காணிக்கப்பட்ட கருவியைப் பயன்படுத்தி கேமராவை நிலை/நோக்குநிலை. இந்த தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கான உதவிக்கு: <a href = 'https: //www.slicerigt.org'> ச்லிசெரிக்ட் வலைத்தளம் </a>.

# Viewpoint
source: This work is part of the Breast NaviKnife project within the Laboratory for Percutaneous Surgery, Queen's University, Kingston, Ontario. Thomas Vaughan is funded by an NSERC Postgraduate award. Gabor Fichtinger is funded as a Cancer Care Ontario (CCO) Chair.
ta: இந்த வேலை பெர்குடேனியச் அறுவை மருத்தீடு, குயின்ச் பல்கலைக்கழகம், கிங்ச்டன், ஒன்ராறியோவின் ஆய்வகத்திற்குள் மார்பக நவ்னைஃப் திட்டத்தின் ஒரு பகுதியாகும். தாமச் வாகனுக்கு என்.எச்.இ.ஆர்.சி முதுகலை பட்டம் வழங்கப்படுகிறது. கபோர் ஃபிட்சிங்கர் புற்றுநோய் பராமரிப்பு ஒன்ராறியோ (சி.சி.ஓ) நாற்காலியாக நிதியளிக்கப்படுகிறது.

# Viewpoint
source: Enable Bullseye View Mode
ta: புல்செய் பார்வை பயன்முறையை இயக்கவும்

# Viewpoint
source: Disable Bullseye View Mode
ta: புல்செய் பார்வை பயன்முறையை முடக்கு

# Viewpoint
source: Enable Auto-Center Mode
ta: ஆட்டோ-சென்டர் பயன்முறையை இயக்கவும்

# Viewpoint
source: Disable Auto-Center Mode
ta: ஆட்டோ-சென்டர் பயன்முறையை முடக்கு

# Viewpoint
source: View Selection
ta: தேர்வைக் காண்க

# Viewpoint
source: Scene Camera:
ta: காட்சி கேமரா:

# Viewpoint
source: Pick the view which should be adjusted, e.g. 'View1'
ta: சரிசெய்யப்பட வேண்டிய காட்சியைத் தேர்ந்தெடுக்கவும், எ.கா. 'View1'

# Viewpoint
source: Parameters for Bullseye View
ta: புல்செய் பார்வைக்கான அளவுருக்கள்

# Viewpoint
source: Camera positioning transform:
ta: கேமரா பொருத்துதல் உருமாற்றம்:

# Viewpoint
source: Pick the transform that the camera should follow, e.g. 'cauteryCameraToCauteryTransform'
ta: கேமரா பின்பற்ற வேண்டிய உருமாற்றத்தைத் தேர்ந்தெடுங்கள், எ.கா. 'cauterycameratocauterytransform'

# Viewpoint
source: Camera Control
ta: கேமரா கட்டுப்பாடு

# Viewpoint
source: Degrees of Freedom
ta: சுதந்திரத்தின் டிகிரி

# Viewpoint
source: The camera will always look at the target model (or if unselected will act like 5DOF)
ta: கேமரா எப்போதும் இலக்கு மாதிரியைப் பார்க்கும் (அல்லது தேர்ந்தெடுக்கப்பட்டால் 5 DOF போல செயல்படும்)

# Viewpoint
source: The camera will always be oriented with the selected 'up direction'
ta: கேமரா எப்போதும் தேர்ந்தெடுக்கப்பட்ட 'அப் திசையுடன்' நோக்குநிலை கொண்டதாக இருக்கும்

# Viewpoint
source: The camera will be virtually attached to the tool, and rotate together with it
ta: கேமரா கிட்டத்தட்ட கருவியுடன் இணைக்கப்பட்டு, அதனுடன் ஒன்றாக சுழலும்

# Viewpoint
source: Up Direction
ta: மேல் திசை

# Viewpoint
source: Anterior:
ta: முன்புறம்:

# Viewpoint
source: Posterior:
ta: பின்புறம்:

# Viewpoint
source: Right:
ta: சரி:

# Viewpoint
source: Left:
ta: இடது:

# Viewpoint
source: Superior:
ta: உயர்ந்த:

# Viewpoint
source: Inferior:
ta: தாழ்ந்த:

# Viewpoint
source: Target Model
ta: இலக்கு மாதிரி

# Viewpoint
source: Target model:
ta: இலக்கு மாதிரி:

# Viewpoint
source: This model be the center of rotation using 3DOF Viewpoint (e.g. tumour)
ta: இந்த மாதிரி 3DOF பார்வையைப் பயன்படுத்தி சுழற்சியின் மையமாக இருக்கும் (எ.கா. கட்டி)

# Viewpoint
source: Zoom
ta: பெரிதாக்கு

# Viewpoint
source: View angle (degrees):
ta: கோணத்தைக் காண்க (டிகிரி):

# Viewpoint
source: Make the current viewing target look larger/smaller.
ta: தற்போதைய பார்வை இலக்கை பெரியதாக/சிறியதாக மாற்றவும்.

# Viewpoint
source: View scale:
ta: அளவைக் காண்க:

# Viewpoint
source: Translation
ta: மொழிபெயர்ப்பு

# Viewpoint
source: Left/Right (mm):
ta: இடது/வலது (மிமீ):

# Viewpoint
source: Down/Up (mm):
ta: டவுன்/அப் (மிமீ):

# Viewpoint
source: Front/Back (mm):
ta: முன்/பின்புறம் (மிமீ):

# Viewpoint
source: Parallel Projection
ta: இணை திட்டம்

# Viewpoint
source: If checked, render with parallel projection (box-shaped view). Otherwise render with perspective projection (cone-shaped view).
ta: சரிபார்க்கப்பட்டால், இணையான திட்டத்துடன் (பெட்டி வடிவ பார்வை) வழங்கவும். இல்லையெனில் முன்னோக்கு திட்டத்துடன் வழங்கவும் (கூம்பு வடிவ பார்வை).

# Viewpoint
source: The camera will continuously update its position so that it follows the tool.
ta: கேமரா அதன் நிலையை தொடர்ந்து புதுப்பிக்கும், இதனால் அது கருவியைப் பின்பற்றுகிறது.

# Viewpoint
source: Parameters for Auto-Center
ta: ஆட்டோ மையத்திற்கான அளவுருக்கள்

# Viewpoint
source: Followed model:
ta: பின்தொடர்ந்த மாதிரி:

# Viewpoint
source: Pick the model that the camera should follow, e.g. 'tumorModel'
ta: கேமரா பின்பற்ற வேண்டிய மாதிரியைத் தேர்ந்தெடுக்கவும், i.n. 'கட்டி மாதிரி'

# Viewpoint
source: Safe Zone (Viewport X percentage):
ta: பாதுகாப்பான மண்டலம் (ViewPort ஃச் சதவீதம்):

# Viewpoint
source: Safe Zone (Viewport Y percentage):
ta: பாதுகாப்பான மண்டலம் (ViewPort ஒய் சதவீதம்):

# Viewpoint
source: Safe Zone (Viewport Z percentage):
ta: பாதுகாப்பான மண்டலம் (ViewPort சட் சதவீதம்):

# Viewpoint
source: Adjust Along Camera X
ta: கேமரா ஃச் உடன் சரிசெய்யவும்

# Viewpoint
source: If checked, adjust the camera so that it aligns with the target model along the x axis.
ta: சரிபார்க்கப்பட்டால், கேமராவை சரிசெய்யவும், இதனால் அது ஃச் அச்சுடன் இலக்கு மாதிரியுடன் ஒத்துப்போகிறது.

# Viewpoint
source: Adjust Along Camera Y
ta: கேமரா ஒய் உடன் சரிசெய்யவும்

# Viewpoint
source: If checked, adjust the camera so that it aligns with the target model along the y axis.
ta: சரிபார்க்கப்பட்டால், கேமராவை சரிசெய்யவும், இதனால் அது ஒய் அச்சுடன் இலக்கு மாதிரியுடன் ஒத்துப்போகிறது.

# Viewpoint
source: Adjust Along Camera Z
ta: கேமரா சட் உடன் சரிசெய்யவும்

# Viewpoint
source: If checked, adjust the camera so that it aligns with the target model along the z axis.
ta: சரிபார்க்கப்பட்டால், கேமராவை சரிசெய்யவும், இதனால் அது சட் அச்சுடன் இலக்கு மாதிரியுடன் ஒத்துப்போகிறது.

# Viewpoint
source: Update rate (seconds):
ta: புதுப்பிப்பு வீதம் (விநாடிகள்):

# Viewpoint
source: The rate at which the view will be checked and updated.
ta: பார்வை சரிபார்க்கப்பட்டு புதுப்பிக்கப்படும் விகிதம்.

# Viewpoint
source: Time Unsafe to Adjust (seconds):
ta: சரிசெய்ய பாதுகாப்பற்ற நேரம் (விநாடிகள்):

# Viewpoint
source: The length of time in which the model must be in the unsafe zone before the camera is adjusted.
ta: கேமரா சரிசெய்யப்படுவதற்கு முன்பு மாதிரி பாதுகாப்பற்ற மண்டலத்தில் இருக்க வேண்டிய நேரத்தின் நீளம்.

# Viewpoint
source: Time Adjust to Rest (seconds):
ta: ஓய்வு (விநாடிகள்) க்கு நேரம் சரிசெய்யவும்:

# Viewpoint
source: The length of time an adjustment takes.
ta: ஒரு சரிசெய்தல் எடுக்கும் நேரத்தின் நீளம்.

# Viewpoint
source: Time Rest to Safe (seconds):
ta: பாதுகாப்பான நேர ஓய்வு (விநாடிகள்):

# Viewpoint
source: The length of time after an adjustment that the camera remains motionless.
ta: கேமரா அசைவில்லாமல் இருக்கும் சரிசெய்தலுக்குப் பிறகு நேரத்தின் நீளம்.

# Viewpoint
source: The camera will continuously update its position so that it follows the model.
ta: கேமரா அதன் நிலையை தொடர்ந்து புதுப்பிக்கும், இதனால் அது மாதிரியைப் பின்பற்றுகிறது.

# qSlicerAbstractCoreModule
source: Guidelet
ta: வழிகாட்டுதல்

# qSlicerAbstractCoreModule
source: Surface Models
ta: மேற்பரப்பு மாதிரிகள்

# qSlicerBreachWarningModule
source: Breach warning
ta: மீறல் எச்சரிக்கை

# qSlicerBreachWarningModule
source: Parameter set:
ta: அளவுரு தொகுப்பு:

# qSlicerBreachWarningModule
source: Inputs
ta: உள்ளீடுகள்

# qSlicerBreachWarningModule
source: Model to watch:
ta: பார்க்க மாதிரி:

# qSlicerBreachWarningModule
source: Tool tip (to RAS) transform:
ta: கருவி உதவிக்குறிப்பு (RAS க்கு) உருமாற்றம்:

# qSlicerBreachWarningModule
source: Parameters
ta: அளவுருக்கள்

# qSlicerBreachWarningModule
source: Display line to closest point
ta: நெருங்கிய இடத்திற்கு வரியைக் காண்பி

# qSlicerBreachWarningModule
source: Line to closest point color
ta: நெருங்கிய புள்ளி நிறத்திற்கு வரி

# qSlicerBreachWarningModule
source: Display warning color
ta: எச்சரிக்கை நிறத்தைக் காண்பி

# qSlicerBreachWarningModule
source: Warning color
ta: எச்சரிக்கை நிறம்

# qSlicerBreachWarningModule
source: Play warning sound
ta: எச்சரிக்கை ஒலி

# qSlicerBreachWarningModule
source: Line to closest point text size:
ta: நெருங்கிய புள்ளி உரை அளவிற்கு வரி:

# qSlicerBreachWarningModule
source: Line to closest point thickness:
ta: நெருங்கிய புள்ளி தடிமன் வரை வரி:

# qSlicerBreachWarningModule
source: Breach warning distance (mm):
ta: மீறல் எச்சரிக்கை தூரம் (மிமீ):

# qSlicerBreachWarningModule
source: This module can alert the user by color change and sound signal if a tool enters a restricted area. The restricted area is defined by a surface model, the tool position is defined by a linear transform. For help on how to use this module visit: <a href='http://www.slicerigt.org/'>SlicerIGT website</a>.
ta: ஒரு கருவி தடைசெய்யப்பட்ட பகுதிக்குள் நுழைந்தால் இந்த தொகுதி வண்ண மாற்றம் மற்றும் ஒலி சமிக்ஞை மூலம் பயனரை எச்சரிக்கலாம். தடைசெய்யப்பட்ட பகுதி மேற்பரப்பு மாதிரியால் வரையறுக்கப்படுகிறது, கருவி நிலை ஒரு நேரியல் உருமாற்றத்தால் வரையறுக்கப்படுகிறது. இந்த தொகுதியை எவ்வாறு பயன்படுத்துவது என்பதற்கான உதவிக்கு: <a href = 'http: //www.slicerigt.org/'> ச்லிசெரிக்ட் வலைத்தளம் </a>.

# qSlicerBreachWarningModule
source: This work was was funded by Cancer Care Ontario and the Ontario Consortium for Adaptive Interventions in Radiation Oncology (OCAIRO)
ta: இந்த வேலைக்கு புற்றுநோய் பராமரிப்பு ஒன்ராறியோ மற்றும் ஒன்ராறியோ கூட்டமைப்பு ஆகியவை கதிர்வீச்சு புற்றுநோயியல் (ஒக்காரோ) இல் தகவமைப்பு தலையீடுகளுக்காக நிதியளித்தன.

# qSlicerCollectPointsModule
source: Module Template
ta: தொகுதி வார்ப்புரு

# qSlicerCollectPointsModule
source: Parameter Node:
ta: அளவுரு முனை:

# qSlicerCollectPointsModule
source: Sampling Node:
ta: மாதிரி முனை:

# qSlicerCollectPointsModule
source: Points will be collected according to the origin of this coordinate system.
ta: இந்த ஒருங்கிணைப்பு அமைப்பின் தோற்றத்திற்கு ஏற்ப புள்ளிகள் சேகரிக்கப்படும்.

# qSlicerCollectPointsModule
source: vtkMRMLGridTransformNode
ta: Vtkmrmlgridtransfort

# qSlicerCollectPointsModule
source: vtkMRMLCollectPointsNode
ta: vtkmrmlcollectoponsnode

# qSlicerCollectPointsModule
source: Toggle visibility of the output node
ta: வெளியீட்டு முனையின் தெரிவுநிலையை மாற்றவும்

# qSlicerCollectPointsModule
source: Delete the last point from the output node (hold click to see the option delete all)
ta: வெளியீட்டு முனையிலிருந்து கடைசி புள்ளியை நீக்கு (விருப்பத்தை நீக்குங்கள் அனைத்தையும் நீக்கு)

# qSlicerCollectPointsModule
source: Store points in either a markups or a model node
ta: புள்ளிகளை ஒரு மார்க்அப்கள் அல்லது மாதிரி முனையில் சேமிக்கவும்

# qSlicerCollectPointsModule
source: Change the color of the output node
ta: வெளியீட்டு முனையின் நிறத்தை மாற்றவும்

# qSlicerCollectPointsModule
source: Output Node:
ta: வெளியீட்டு முனை:

# qSlicerCollectPointsModule
source: Collect points either one at a time, or collect them automatically (tick the checkbox).
ta: ஒரு நேரத்தில் புள்ளிகளை சேகரிக்கவும் அல்லது அவற்றை தானாக சேகரிக்கவும் (தேர்வுப்பெட்டியைத் தேர்வுசெய்க).

# qSlicerCollectPointsModule
source: Collect
ta: சேகரிக்கவும்

# qSlicerCollectPointsModule
source: Advanced
ta: மேம்பட்ட

# qSlicerCollectPointsModule
source: Label Base:
ta: சிட்டை அடிப்படை:

# qSlicerCollectPointsModule
source: Markups will be numbered according to the current counter (incremented automatically)
ta: தற்போதைய கவுண்டருக்கு ஏற்ப மார்க்அப்கள் எண்ணப்படும் (தானாக அதிகரிக்கும்)

# qSlicerCollectPointsModule
source: Minimum Distance:
ta: குறைந்தபட்ச தூரம்:

# qSlicerCollectPointsModule
source: Next Label Number:
ta: அடுத்த சிட்டை எண்:

# qSlicerCollectPointsModule
source: Markups will have labels that begin with this text.
ta: மார்க்அப்களில் இந்த உரையுடன் தொடங்கும் லேபிள்கள் இருக்கும்.

# qSlicerCollectPointsModule
source: P
ta: ப

# qSlicerCollectPointsModule
source: Specify a minimum distance before a new point is automatically collected (Auto-Collect mode only)
ta: புதிய புள்ளி தானாக சேகரிக்கப்படுவதற்கு முன்பு குறைந்தபட்ச தூரத்தைக் குறிப்பிடவும் (ஆட்டோ-சேகரிப்பு முறை மட்டும்)

# qSlicerCollectPointsModule
source: Points will be collected relative to the anchor coordinate system.
ta: நங்கூரம் ஒருங்கிணைப்பு அமைப்புடன் ஒப்பிடும்போது புள்ளிகள் சேகரிக்கப்படும்.

# qSlicerCollectPointsModule
source: Anchor Node:
ta: நங்கூர முனை:

# qSlicerCollectPointsModule
source: Delete All Points
ta: எல்லா புள்ளிகளையும் நீக்கு

# qSlicerCollectPointsModule
source: Delete all points from the node
ta: முனையிலிருந்து அனைத்து புள்ளிகளையும் நீக்கவும்

# qSlicerCollectPointsModule
source: Record motion trajectory of a tracked tool into markups fiducial list, markups curve, or model node. For more information, visit <a href="https://github.com/SlicerIGT/SlicerIGT/#user-documentation">SlicerIGT project website</a>.
ta: கண்காணிக்கப்பட்ட கருவியின் இயக்கப் பாதையை மார்க்அப்கள் நம்பகமான பட்டியல், மார்க்அப்கள் வளைவு அல்லது மாதிரி முனையில் பதிவுசெய்க. மேலும் தகவலுக்கு, <a href = "https://github.com/slicerigt/slicerigt/#user- ஆவணப்படுத்தல்"> ச்லிசெரிக்ட் திட்ட வலைத்தளம் </a> ஐப் பார்வையிடவும்.

# qSlicerCollectPointsModule
source: This work was was funded by Cancer Care Ontario and the Ontario Consortium for Adaptive Interventions in Radiation Oncology (OCAIRO)
ta: இந்த வேலைக்கு புற்றுநோய் பராமரிப்பு ஒன்ராறியோ மற்றும் ஒன்ராறியோ கூட்டமைப்பு ஆகியவை கதிர்வீச்சு புற்றுநோயியல் (ஒக்காரோ) இல் தகவமைப்பு தலையீடுகளுக்காக நிதியளித்தன.

# qSlicerCollectPointsModuleWidget
source: Delete options
ta: விருப்பங்களை நீக்கு

# qSlicerCollectPointsModuleWidget
source: Auto-Collect
ta: தானாக சேகரிப்பு

# qSlicerCollectPointsModuleWidget
source: Collect
ta: சேகரிக்கவும்

# qSlicerCreateModelsModule
source: Form
ta: வடிவம்

# qSlicerCreateModelsModule
source: Create models
ta: மாதிரிகளை உருவாக்கவும்

# qSlicerCreateModelsModule
source: Needle model
ta: ஊசி மாதிரி

# qSlicerCreateModelsModule
source: length
ta: நீளம்
