Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# descriptions.hula
source: Two players aim to form a loop around the center of a regular hexagonal board, using their own stones and, possibly, some number of neutral stones.
ta: இரண்டு வீரர்கள் ஒரு வழக்கமான அறுகோண பலகையின் மையத்தைச் சுற்றி ஒரு சுழற்சியை உருவாக்குவதை நோக்கமாகக் கொண்டுள்ளனர், தங்கள் சொந்த கற்களைப் பயன்படுத்தி, சில நடுநிலை கற்களைப் பயன்படுத்தலாம்.

# descriptions.iqishiqi
source: Iqishiqi (pronounced EE-chee-shee-chee) is an abstract strategy game that is played on a hexagonal board composed of hexagonal cells. Players own designated edges of the board, and by clever placement of stones they push a neutral stone around the board. A player wins if he/she moves the neutral stone to one of his/her edges, or leaves his/her opponent unable to move.
ta: IQISHIQI (EE-Chee-Chee-chee என உச்சரிக்கப்படுகிறது) என்பது ஒரு சுருக்கமான மூலோபாய விளையாட்டு, இது அறுகோண கலங்களைக் கொண்ட ஒரு அறுகோண பலகையில் இயக்கப்படுகிறது. வீரர்கள் குழுவின் நியமிக்கப்பட்ட விளிம்புகளை வைத்திருக்கிறார்கள், மேலும் கற்களை புத்திசாலித்தனமாக வைப்பதன் மூலம் அவர்கள் ஒரு நடுநிலை கல்லை பலகையைச் சுற்றி தள்ளுகிறார்கள். அவர்/அவள் நடுநிலை கல்லை தனது/அவள் விளிம்புகளில் ஒன்றிற்கு நகர்த்தினால் அல்லது அவரது/அவள் எதிரியை நகர்த்த முடியாவிட்டால் ஒரு வீரர் செய் பெறுவார்.

# descriptions.irensei
source: Irensei is a mixture of Go and Gomoku. Get a seven in a row inside the middle 15x15 region of the Go board to win. To reduce the first player's advantage, the first player loses if they make an overline (even if it extends beyond the 15x15 region), but the second player may win by overline.
ta: இர்சென்சி கோ மற்றும் கோமோகு கலவையாகும். வெற்றிபெற கோ போர்டின் நடுத்தர 15x15 பிராந்தியத்திற்குள் ஒரு வரிசையில் ஏழு கிடைக்கும். முதல் வீரரின் நன்மையைக் குறைக்க, முதல் வீரர் அவர்கள் ஒரு ஓவர்லைன் செய்தால் தோற்றார் (இது 15x15 பிராந்தியத்திற்கு அப்பால் நீட்டிக்கப்பட்டாலும் கூட), ஆனால் இரண்டாவது வீரர் ஓவர்லைன் மூலம் வெல்லக்கூடும்.

# descriptions.jacynth
source: A Decktet card game where opponents vye for control of the city of Jacynth. Place cards, exert influence, and control the most area to win.
ta: ஒரு டெக்டெட் அட்டை விளையாட்டு, அங்கு எதிரிகள் சசிந்த் நகரத்தை கட்டுப்படுத்த VYE. அட்டைகளை வைக்கவும், செல்வாக்கை செலுத்தவும், வெற்றிபெற அதிக பகுதியைக் கட்டுப்படுத்தவும்.

# descriptions.kachit
source: A chess-like game played on a 4x4 board where you try to eliminate the opposing king or promote your own. Pieces can change their orientation after moving.
ta: ஒரு சதுரங்கம் போன்ற விளையாட்டு 4x4 போர்டில் விளையாடியது, அங்கு நீங்கள் எதிர்க்கும் மன்னரை அகற்ற அல்லது உங்கள் சொந்தத்தை ஊக்குவிக்க முயற்சிக்கிறீர்கள். துண்டுகள் நகர்ந்த பிறகு அவற்றின் நோக்குநிலையை மாற்றலாம்.

# descriptions.konane
source: A traditional Hawaiian game that was almost completely lost to time but for the memory of a single woman. Played on a square board, each player captures by jumping over their opponent's pieces. Last to move wins.
ta: ஒரு பாரம்பரிய அவாய் விளையாட்டு, இது ஒரு நேரத்திற்கு முற்றிலும் இழந்துவிட்டது, ஆனால் ஒரு பெண்ணின் நினைவாக. ஒரு சதுர பலகையில் விளையாடியது, ஒவ்வொரு வீரரும் தங்கள் எதிரியின் துண்டுகளுக்கு மேல் குதித்து பிடிக்கிறார்கள். கடைசியாக நகரும் வெற்றிகள்.

# descriptions.lielow
source: A wartime tale of Machiavellian usurpership. You win if your piece lands on your opponent's king. You also win if your opponent chooses to move their king off the board.
ta: மச்சியாவெல்லியன் அபகரிப்பின் போர்க்கால கதை. உங்கள் துண்டு உங்கள் எதிரியின் ராசாவின் மீது இறங்கினால் நீங்கள் வெல்வீர்கள். உங்கள் எதிர்ப்பாளர் தங்கள் ராசாவை பலகையில் இருந்து நகர்த்த தேர்வுசெய்தால் நீங்கள் வெல்வீர்கள்.

# descriptions.lifeline
source: Conquer territory and capture enemy groups by cutting them off from all their allies. A group is cut off when it has no free path (straight or otherwise) to other groups of its color. Win by leaving your opponent with no moves.
ta: பிரதேசத்தை வென்று எதிரி குழுக்களை அவர்களின் அனைத்து நட்பு நாடுகளிலிருந்தும் வெட்டுவதன் மூலம் அவற்றைக் கைப்பற்றுங்கள். ஒரு குழு அதன் நிறத்தின் மற்ற குழுக்களுக்கு இலவச பாதை (நேராக அல்லது வேறுவிதமாக) இல்லாதபோது துண்டிக்கப்படுகிறது. எந்த நகர்வுகளும் இல்லாமல் உங்கள் எதிரியை விட்டுவிட்டு வெல்லுங்கள்.

# descriptions.loa
source: A classic game where you try to gather all your pieces into a single connected group. Pieces can only move the exact number of spaces as the number of pieces that lie along the line of movement. The "Scrambled Eggs" initial layout variant is supported.
ta: ஒரு உன்னதமான விளையாட்டு, அங்கு உங்கள் துண்டுகள் அனைத்தையும் ஒற்றை இணைக்கப்பட்ட குழுவில் சேகரிக்க முயற்சிக்கிறீர்கள். இயக்கத்தின் வரிசையில் இருக்கும் துண்டுகளின் எண்ணிக்கையாக மட்டுமே துண்டுகள் சரியான இடைவெளிகளை மட்டுமே நகர்த்த முடியும். "துருவல் முட்டை" ஆரம்ப தளவமைப்பு மாறுபாடு ஆதரிக்கப்படுகிறது.

# descriptions.logger
source: A Looney pyramids game where the players vie to grow and harvest more trees than their opponents.
ta: ஒரு லூனி பிரமிடிச் விளையாட்டு, அங்கு வீரர்கள் தங்கள் எதிரிகளை விட அதிகமான மரங்களை வளர்த்துக் கொள்ளவும் அறுவடை செய்யவும் போட்டியிடுகிறார்கள்.

# descriptions.lox
source: Hex connection game with captures inspired by Tumbleweed. A cell is controlled by a player if it has more lines of sight to the player's pieces than half of the number neighbours that it has. If an opponent's piece is on your controlled cell, you may capture it by replacing it with your own piece on your turn. The player with a solid connection between their two sides at the start of their turn wins.
ta: டம்பிள்வீட் ஈர்க்கப்பட்ட பிடிப்புகளுடன் ஃச் இணைப்பு விளையாட்டு. ஒரு செல் ஒரு வீரரால் கட்டுப்படுத்தப்படுகிறது, அது வீரரின் துண்டுகளுக்கு அதிக பார்வைக் கோடுகள் இருந்தால், அது வைத்திருக்கும் எண்ணைக் காட்டிலும் பாதியை விட. உங்கள் கட்டுப்படுத்தப்பட்ட கலத்தில் ஒரு எதிரியின் துண்டு இருந்தால், அதை உங்கள் திருப்பத்தில் உங்கள் சொந்த துண்டுடன் மாற்றுவதன் மூலம் அதைப் பிடிக்கலாம். அவர்களின் திருப்பத்தின் தொடக்கத்தில் இரு பக்கங்களுக்கும் இடையில் திடமான தொடர்பைக் கொண்ட வீரர் செய் பெறுகிறார்.

# descriptions.majorities
source: A game of majorities. A majority of pieces in a line wins that line. A majority of parallel lines in a direction wins that direction. A majority of directions wins the game. The first player places one piece, and thereafter, each player places two pieces per turn.
ta: பெரும்பான்மை விளையாட்டு. ஒரு வரியில் உள்ள பெரும்பான்மையான துண்டுகள் அந்த வரியை வெல்லும். ஒரு திசையில் இணையான கோடுகளில் பெரும்பாலானவை அந்த திசையில் செய் பெறுகின்றன. பெரும்பாலான திசைகள் விளையாட்டை வென்றன. முதல் வீரர் ஒரு பகுதியை வைக்கிறார், அதன்பிறகு, ஒவ்வொரு வீரரும் ஒரு திருப்பத்திற்கு இரண்டு துண்டுகளை வைக்கிறார்கள்.

# descriptions.manalath
source: Manalath is a game on a hexagonal grid where you can place pieces of either colour. You win if at the end of your turn there's a group of five pieces of your colour, but you *lose* if there's a group of four stones of your colour. How are you going to do that?!
ta: மனலாத் என்பது ஒரு அறுகோண கட்டத்தில் ஒரு விளையாட்டு, அங்கு நீங்கள் வண்ணத் துண்டுகளை வைக்கலாம். உங்கள் திருப்பத்தின் முடிவில் உங்கள் வண்ணத்தின் ஐந்து துண்டுகள் கொண்ட குழு இருந்தால் நீங்கள் வெல்வீர்கள், ஆனால் உங்கள் வண்ணத்தின் நான்கு கற்களின் குழு இருந்தால் நீங்கள் * இழக்கிறீர்கள் *. நீங்கள் அதை எப்படி செய்யப் போகிறீர்கள்?!

# descriptions.margo
source: Margo is a stacking Go variant. Players may not pass. The game ends when one player is not able to move, and the player with the most balls on the board wins.
ta: மார்கோ ஒரு ச்டாக்கிங் கோ மாறுபாடு. வீரர்கள் கடந்து செல்லக்கூடாது. ஒரு வீரர் நகர முடியாதபோது விளையாட்டு முடிவடைகிறது, மேலும் போர்டில் அதிக பந்துகளைக் கொண்ட வீரர் செய் பெறுகிறார்.

# descriptions.mattock
source: In Mattock, you play miners digging corridors through the rock. You can't dig too closely together though, or the mine will collapse. To win, trap your opponent so they run out of space to mine.
ta: மேட்டோக்கில், நீங்கள் சுரங்கத் தொழிலாளர்கள் பாறை வழியாக தாழ்வாரங்களை தோண்டி எடுக்கிறீர்கள். நீங்கள் ஒன்றாக மிக நெருக்கமாக தோண்ட முடியாது, அல்லது என்னுடையது சரிந்துவிடும். வெல்ல, உங்கள் எதிரியை சிக்க வைக்கவும், இதனால் அவர்கள் என்னுடைய இடத்தை விட்டு வெளியேறுகிறார்கள்.

# descriptions.mchess
source: A Looney pyramid game for two players played on half of a standard chess board. It is a chess-like strategy game in which location, rather than piece color, determines which pieces you may move. Like Chess, each type of piece has its own way of moving, and you capture by moving onto an opponent's square; but unlike Chess, you can only move pieces sitting in your own quadrant, and only attack those in other quadrants, which may include your own former pieces. The game ends when someone runs out of pieces, and the winner is the player who captured the most points.
ta: இரண்டு வீரர்களுக்கான லூனி பிரமிட் விளையாட்டு ஒரு நிலையான செச் போர்டில் பாதியில் விளையாடியது. இது ஒரு சதுரங்கம் போன்ற மூலோபாய விளையாட்டாகும், இதில் துண்டு வண்ணத்தை விட இருப்பிடம், நீங்கள் எந்த துண்டுகளை நகர்த்தலாம் என்பதை தீர்மானிக்கிறது. சதுரங்கத்தைப் போலவே, ஒவ்வொரு வகை துண்டுகளும் அதன் சொந்த வழியைக் கொண்டுள்ளன, மேலும் எதிராளியின் சதுக்கத்தில் நகர்த்துவதன் மூலம் நீங்கள் கைப்பற்றுகிறீர்கள்; ஆனால் சதுரங்கத்தைப் போலல்லாமல், நீங்கள் உங்கள் சொந்த நால்வரில் உட்கார்ந்திருக்கும் துண்டுகளை மட்டுமே நகர்த்த முடியும், மேலும் உங்கள் சொந்த முன்னாள் துண்டுகளை உள்ளடக்கிய மற்ற நால்வகைகளில் உள்ளவர்களை மட்டுமே தாக்க முடியும். யாரோ ஒருவர் துண்டுகளாக ஓடும்போது விளையாட்டு முடிவடைகிறது, மேலும் வெற்றியாளர் அதிக புள்ளிகளைக் கைப்பற்றிய வீரர்.

# descriptions.meg
source: Meg is an asymmetric, push-your-luck game in which one player attempts to 'meg' their opponent by passing the ball between their legs.
ta: மெக் ஒரு சமச்சீரற்ற, புச்-உங்கள்-அதிர்ச்ட விளையாட்டு, இதில் ஒரு வீரர் தங்கள் எதிரியை 'மெக்' செய்ய முயற்சிக்கிறார்.

# descriptions.meridians
source: Meridians is a territorial game with the goal of annihilating the opponent's stones. Starting with an empty board, players alternate turns placing a stone on an empty point as in Go. Groups should be "seen" by other friendly stone through a straight path or they will be removed on your opponent's turn.
ta: மெரிடியன்ச் என்பது எதிராளியின் கற்களை நிர்மூலமாக்கும் குறிக்கோளைக் கொண்ட ஒரு பிராந்திய விளையாட்டு. ஒரு வெற்று பலகையில் தொடங்கி, வீரர்கள் மாற்று திருப்பங்களை வெற்று புள்ளியில் ஒரு கல்லை வைப்பதைப் போல திருப்புகிறார்கள். குழுக்களை மற்ற நட்பு கல்லால் நேரான பாதை வழியாக "பார்க்க வேண்டும்" அல்லது அவை உங்கள் எதிரியின் திருப்பத்தில் அகற்றப்படும்.

# descriptions.mimic
source: A game where enemy pieces mimic your moves while you race to be the first player to reach the back row.
ta: பின் வரிசையை அடைந்த முதல் வீரராக நீங்கள் போட்டியிடும்போது எதிரி துண்டுகள் உங்கள் நகர்வுகளைப் பிரதிபலிக்கும் ஒரு விளையாட்டு.

# descriptions.mirador
source: Mirador is a fast and exhilarating connection game played on a 27 x 27 square grid by placing 2 x 2 squares to represent watchtowers. It uses line-of-sight connections and equivalent goals (making it more of a race than a pure connection game).
ta: மிராடோர் என்பது 27 ஃச் 27 சதுர கட்டத்தில் விளையாடிய ஒரு வேகமான மற்றும் களிப்பூட்டும் இணைப்பு விளையாட்டு ஆகும், இது 2 ஃச் 2 சதுரங்களை வாட்ச் டவர்சைக் குறிக்கிறது. இது வரிசையின் இணைப்புகள் மற்றும் அதற்கு சமமான குறிக்கோள்களைப் பயன்படுத்துகிறது (இது ஒரு தூய இணைப்பு விளையாட்டை விட ஒரு பந்தயத்தை அதிகமாக்குகிறது).

# descriptions.mixtour
source: Two players create towers with the goal of creating a tower at least five high with your colour at the top. The twist here is two-fold: (1) you can move opponent's pieces and (2) movement range is determined by the *target* stack height and not the moving stack height.
ta: இரண்டு வீரர்கள் உங்கள் வண்ணத்துடன் குறைந்தது ஐந்து உயர்வைக் கொண்ட ஒரு கோபுரத்தை உருவாக்கும் குறிக்கோளுடன் கோபுரங்களை உருவாக்குகிறார்கள். இங்கே திருப்பம் இரண்டு மடங்கு: (1) நீங்கள் எதிரியின் துண்டுகளை நகர்த்தலாம் மற்றும் (2) இயக்க வரம்பு * இலக்கு * அடுக்கு உயரத்தால் தீர்மானிக்கப்படுகிறது, ஆனால் நகரும் அடுக்கு உயரமல்ல.

# descriptions.monkey
source: You start with a single queen, composed of a stack of checkers. When you make noncapturing moves, the queen leaves a singleton behind. Queens and singletons move and capture like chess queens. To win, capture the opposing queen or leave them with no legal moves.
ta: நீங்கள் ஒரு ராணியுடன் தொடங்குகிறீர்கள், இது செக்கர்களின் அடுக்கைக் கொண்டது. நீங்கள் விரும்பத்தகாத நகர்வுகளைச் செய்யும்போது, ராணி ஒரு சிங்கிள்டனை விட்டு வெளியேறுகிறார். குயின்ச் மற்றும் சிங்கிள்டன்கள் செச் குயின்ச் போல நகர்ந்து கைப்பற்றுகின்றன. வெல்ல, எதிரெதிர் ராணியைக் கைப்பற்ற அல்லது சட்டப்பூர்வ நகர்வுகள் இல்லாமல் அவர்களை விட்டு விடுங்கள்.

# descriptions.morphos
source: Orthogonal-only square connection game. On your turn, place a friendly stone or flip an enemy stone in one of three predetermined patterns. Win by connecting your two opposite sides of the board with a chain of stones of your color.
ta: ஆர்த்தோகனல் மட்டும் சதுர இணைப்பு விளையாட்டு. உங்கள் திருப்பத்தில், ஒரு நட்பு கல்லை வைக்கவும் அல்லது முன்னரே தீர்மானிக்கப்பட்ட மூன்று வடிவங்களில் ஒன்றில் எதிரி கல்லை புரட்டவும். உங்கள் வண்ணத்தின் கற்களின் சங்கிலியுடன் உங்கள் இரண்டு எதிர் பக்கங்களையும் இணைப்பதன் மூலம் வெற்றி.

# descriptions.murus
source: Murus Gallicus is a two-player breakthrough game in which players try to create impenetrable walls of stone as menacing formations approach, reminiscent of Julius Caesar's Gallic Wars.
ta: முச் காலிகச் என்பது இரண்டு பிளேயர் திருப்புமுனை விளையாட்டாகும், இதில் வீரர்கள் மனநிலையற்ற வடிவங்களை அணுகும்போது கல்லின் சுவர்களை உருவாக்க முயற்சிக்கின்றனர், இது சூலியச் சீசரின் காலிக் போர்களை நினைவூட்டுகிறது.

# descriptions.moonsquad
source: Your mining company has found rich ore on this small moon, but you need buyers. Connect your mine to all 3 surface settlements, and hire squads to defend your mine and attack your rival.
ta: உங்கள் சுரங்க நிறுவனம் இந்த சிறிய நிலவில் பணக்கார தாதுவைக் கண்டறிந்துள்ளது, ஆனால் உங்களுக்கு வாங்குபவர்கள் தேவை. உங்கள் சுரங்கத்தை அனைத்து 3 மேற்பரப்பு குடியேற்றங்களுடனும் இணைக்கவும், உங்கள் என்னுடையதை பாதுகாக்கவும், உங்கள் போட்டியாளரைத் தாக்கவும் குழுக்களை வாடகைக்கு அமர்த்தவும்.

# descriptions.mvolcano
source: An Icehouse puzzle game for 2 players. Stacks of pyramids are volcanos, some of which are capped. As you move caps around, you cause eruptions that may lead to you capturing pieces. This is an older version of the game. It is played on a 6x6 board, and the game ends as soon as someone captures at least one piece of each colour or all three white pieces. Scores are then calculated. Highest score wins.
ta: 2 வீரர்களுக்கு ஒரு ஐச்அவுச் புதிர் விளையாட்டு. பிரமிடுகளின் அடுக்குகள் எரிமலைகள், அவற்றில் சில மூடியவை. நீங்கள் தொப்பிகளைச் சுற்றி நகர்த்தும்போது, நீங்கள் வெடிப்புகளை ஏற்படுத்தும், அவை துண்டுகளை கைப்பற்ற வழிவகுக்கும். இது விளையாட்டின் பழைய பதிப்பாகும். இது 6x6 போர்டில் விளையாடப்படுகிறது, மேலும் ஒவ்வொரு வண்ணத்தின் குறைந்தது ஒரு பகுதியையாவது அல்லது மூன்று வெள்ளை துண்டுகளையும் யாரோ கைப்பற்றியவுடன் விளையாட்டு முடிவடைகிறது. மதிப்பெண்கள் பின்னர் கணக்கிடப்படுகின்றன. அதிக மதிப்பெண் வெற்றிகள்.

# descriptions.nakatta
source: A square connection game where two specific piece configurations are forbidden.
ta: இரண்டு குறிப்பிட்ட துண்டு உள்ளமைவுகள் தடைசெய்யப்பட்ட ஒரு சதுர இணைப்பு விளையாட்டு.

# descriptions.necklace
source: An orthogonal-only square connection game where you try to connect your sides of the board. Crosscut formations are illegal, and every free space must always have a path to an edge.
ta: பலகையின் உங்கள் பக்கங்களை இணைக்க முயற்சிக்கும் ஆர்த்தோகனல் மட்டும் சதுர இணைப்பு விளையாட்டு. குறுக்குவழி அமைப்புகள் சட்டவிரோதமானவை, மேலும் ஒவ்வொரு இலவச இடமும் எப்போதும் ஒரு விளிம்பிற்கு ஒரு பாதையைக் கொண்டிருக்க வேண்டும்.

# descriptions.nex
source: Nex (or Neutral Hex) is a variant of the Hex connection game where there are neutral pieces. On your turn, you may either (1) place a piece of your colour and a neutral colour on an empty space, or (2) swap two neutral pieces to your colour and one of your piece to the neutral colour.
ta: நெக்ச் (அல்லது நியூட்ரல் எக்ச்) என்பது நடுநிலை துண்டுகள் இருக்கும் ஃச் இணைப்பு விளையாட்டின் மாறுபாடாகும். உங்கள் திருப்பத்தில், நீங்கள் (1) உங்கள் நிறத்தின் ஒரு பகுதியையும், நடுநிலை நிறத்தையும் வெற்று இடத்தில் வைக்கலாம், அல்லது (2) இரண்டு நடுநிலை துண்டுகளை உங்கள் வண்ணத்தில் மாற்றவும், உங்கள் துண்டில் ஒன்றை நடுநிலை நிறத்திற்கு மாற்றவும்.

# descriptions.omny
source: Generalized connection game where players try to split star cells into different regions so that no single region contains a majority of star cells.
ta: பொதுவான இணைப்பு விளையாட்டு, வீரர்கள் நட்சத்திர செல்களை வெவ்வேறு பகுதிகளாகப் பிரிக்க முயற்சிக்கிறார்கள், இதனால் எந்த பிராந்தியமும் பெரும்பாலான நட்சத்திர கலங்களைக் கொண்டிருக்கவில்லை.

# descriptions.onager
source: In Onager each player tries to reach the opponent's back rank. Onager is named after a Roman siege engine that is a type of catapult, as the way the pieces move resembles how projectiles are hurled forward with this device.
ta: ஓனேசரில் ஒவ்வொரு வீரரும் எதிராளியின் பின் தரத்தை அடைய முயற்சிக்கிறார்கள். ஒனேசர் ஒரு ரோமானிய முற்றுகை இயந்திரத்தின் பெயரிடப்பட்டது, இது ஒரு வகை கவண், ஏனெனில் துண்டுகள் நகரும் விதம் இந்த சாதனத்துடன் எறிபொருள்கள் எவ்வாறு முன்னோக்கி வீசப்படுகின்றன என்பதை ஒத்திருக்கிறது.

# descriptions.onyx
source: A connection game on a modified snub-square board with a capture rule.
ta: பிடிப்பு விதியுடன் மாற்றியமைக்கப்பட்ட ச்னப்-சதுர வாரியத்தில் இணைப்பு விளையாட்டு.

# descriptions.orb
source: Generatorb is 2-player game played on a standard chess board. Players start in opposite corners and attempt to reach their opponent's generator core or occupy the majority of cells on the front line. During play, you can stack up to three checkers in a space. Stacks of different heights behave differently, leading to engaging strategic options.
ta: செனரேட்டர் பி என்பது 2-பிளேயர் விளையாட்டு என்பது ஒரு நிலையான சதுரங்கப் பலகையில் விளையாடியது. வீரர்கள் எதிர் மூலைகளில் தொடங்கி, எதிராளியின் செனரேட்டர் மையத்தை அடைய முயற்சிக்கிறார்கள் அல்லது முன் வரிசையில் உள்ள பெரும்பாலான கலங்களை ஆக்கிரமிக்கிறார்கள். விளையாட்டின் போது, நீங்கள் ஒரு இடத்தில் மூன்று செக்கர்கள் வரை அடுக்கி வைக்கலாம். வெவ்வேறு உயரங்களின் அடுக்குகள் வித்தியாசமாக செயல்படுகின்றன, இது மூலோபாய விருப்பங்களை ஈடுபடுத்த வழிவகுக்கிறது.

# descriptions.ordo
source: Ordo is a "get to your opponent's home row" game in which you must always keep your pieces connected. Pieces can move singly and also as a group in certain situations. You can also win by breaking up your opponent's group in such a way that they can't reconnect it.
ta: ஆர்டோ என்பது "உங்கள் எதிரியின் வீட்டு வரிசையைப் பெறுங்கள்" விளையாட்டாகும், அதில் நீங்கள் எப்போதும் உங்கள் துண்டுகளை இணைக்க வேண்டும். சில சூழ்நிலைகளில் துண்டுகள் தனித்தனியாகவும் ஒரு குழுவாகவும் நகரலாம். உங்கள் எதிரியின் குழுவை அவர்கள் மீண்டும் இணைக்க முடியாத வகையில் உடைப்பதன் மூலமும் நீங்கள் வெல்லலாம்.

# descriptions.oust
source: Oust is the classic "exnihilation" game where the game starts with an empty board and the goal is to eliminate all of your opponent's pieces. On your turn, you may make multiple capturing placements if available, but you must end it with a non-capturing placement. You must pass if you are not able to make any placements.
ta: OUST என்பது உன்னதமான "Exnihilation" விளையாட்டு, அங்கு விளையாட்டு வெற்று பலகையுடன் தொடங்குகிறது மற்றும் உங்கள் எதிரியின் அனைத்து துண்டுகளையும் அகற்றுவதே குறிக்கோள். உங்கள் திருப்பத்தில், நீங்கள் கிடைத்தால் பல பிடிப்பு வேலைவாய்ப்புகளைச் செய்யலாம், ஆனால் நீங்கள் அதை கைப்பற்றப்படாத வேலைவாய்ப்புடன் முடிக்க வேண்டும். நீங்கள் எந்த இடத்தையும் செய்ய முடியாவிட்டால் நீங்கள் கடந்து செல்ல வேண்டும்.

# descriptions.oware
source: A traditional West African sowing game where you try to capture the most pieces.
ta: ஒரு பாரம்பரிய மேற்கு ஆபிரிக்க விதைப்பு விளையாட்டு, அங்கு நீங்கள் அதிக துண்டுகளைப் பிடிக்க முயற்சிக்கிறீர்கள்.

# descriptions.owlman
source: An asymmetrical game where a professor and his assistants are trying to track down the mythical Owlman and his lair, while the Owlman tries to scare them all out of the forest.
ta: ஒரு பேராசிரியரும் அவரது உதவியாளர்களும் புராண ஆந்தை மற்றும் அவரது பொய்யைக் கண்டுபிடிக்க முயற்சிக்கும் ஒரு சமச்சீரற்ற விளையாட்டு, ஆந்த்ல்மேன் அவர்கள் அனைவரையும் காட்டில் இருந்து பயமுறுத்த முயற்சிக்கிறார்.

# descriptions.pacru
source: A territory-control game where directional pieces navigate a subdivided board to claim cells.
ta: ஒரு பிரதேச-கட்டுப்பாட்டு விளையாட்டு, அங்கு திசை துண்டுகள் ஒரு துணைப்பிரிவு வாரியத்திற்கு செலவை கோருகின்றன.

# descriptions.pahtum
source: Accumulate points by establishing lines of your own pieces of various lengths, but five cells each game are blocked. A capturing option is also available.
ta: பல்வேறு நீளங்களின் உங்கள் சொந்த துண்டுகளின் வரிகளை நிறுவுவதன் மூலம் புள்ளிகளைக் குவிக்கவும், ஆனால் ஒவ்வொரு ஆட்டத்திலும் ஐந்து கலங்கள் தடுக்கப்படுகின்றன. கைப்பற்றும் விருப்பமும் கிடைக்கிறது.

# descriptions.paintbucket
source: An elimination game where you flip groups of opposing pieces until only yours remain.
ta: உங்களுடையது மட்டுமே இருக்கும் வரை எதிரெதிர் துண்டுகளின் குழுக்களை புரட்டும் ஒரு நீக்குதல் விளையாட்டு.

# descriptions.penguin
source: It is a truth universally acknowledged that everybody loves seeing penguins sliding around on the ice. And soccer is the world's game, right? So take some cute families of penguins, give them an icy soccer field and a ball, and watch the slippery goodness that ensues.
ta: பெங்குவின் பனியில் சறுக்குவதைப் பார்ப்பதை எல்லோரும் விரும்புகிறார்கள் என்பதை உலகளவில் ஒப்புக் கொண்ட உண்மை இது. கால்பந்து என்பது உலகின் விளையாட்டு, இல்லையா? எனவே பெங்குவின் சில அழகான குடும்பங்களை எடுத்து, அவர்களுக்கு ஒரு பனிக்கட்டி கால்பந்து மைதானம் மற்றும் ஒரு பந்தைக் கொடுங்கள், மேலும் வழுக்கும் நன்மையைப் பாருங்கள்.

# descriptions.pente
source: In Pente, players take turns placing stones on the intersections of the board. The first player to get five in a row or capture ten stones wins.
ta: பென்டேயில், வீரர்கள் பலகையின் குறுக்குவெட்டுகளில் கற்களை வைப்பதை திருப்புகிறார்கள். ஒரு வரிசையில் ஐந்து பேரைப் பெற்ற முதல் அல்லது பத்து கற்களைப் பிடிக்கும் முதல் வீரர் செய் பெறுகிறார்.

# descriptions.phutball
source: Phutball (short for philosopher's football) is a classic two-player soccer-esque board game of shared pieces where you attempt to get the ball across your opponent's goal line.
ta: கால்பந்து (தத்துவஞானியின் கால்பந்தாட்டத்திற்கான சார்ட்ச்) என்பது ஒரு உன்னதமான இரண்டு-பிளேயர் கால்பந்து-எச்க்யூ போர்டு விளையாட்டாகும், அங்கு உங்கள் எதிரியின் கோல் வரிசையில் பந்தைப் பெற முயற்சிக்கிறீர்கள்.

# descriptions.pigs
source: This is the base-rules version of Robo Battle Pigs, a game of robot combat where you program a series of moves in an attempt to destroy all opposing pigs. This implementation supports 2–4 players, and each player programs five moves each turn.
ta: இது ரோபோ போர் பன்றிகளின் அடிப்படை-விதிகள் பதிப்பாகும், இது ரோபோ போரின் விளையாட்டு, அங்கு எதிர்க்கும் அனைத்து பன்றிகளையும் அழிக்கும் முயற்சியில் தொடர்ச்சியான நகர்வுகளை நீங்கள் திட்டமிடுகிறீர்கள். இந்த செயல்படுத்தல் 2–4 வீரர்களை ஆதரிக்கிறது, மேலும் ஒவ்வொரு வீரரும் திட்டங்கள் ஒவ்வொரு திருப்பத்தையும் நகர்த்துகின்றன.

# descriptions.pigs2
source: This is the continuous feedback version of Robo Battle Pigs, a game of robot combat where you program a series of moves in an attempt to destroy all opposing pigs. This implementation supports 2–8 players, and each player only programs one move per turn.
ta: ரோபோ பேட்டில் பிக்சின் தொடர்ச்சியான பின்னூட்ட பதிப்பு இது, ரோபோ போரின் விளையாட்டு, அங்கு எதிர்க்கும் அனைத்து பன்றிகளையும் அழிக்கும் முயற்சியில் தொடர்ச்சியான நகர்வுகளை நீங்கள் நிரல் செய்கிறீர்கள். இந்த செயல்படுத்தல் 2–8 வீரர்களை ஆதரிக்கிறது, மேலும் ஒவ்வொரு வீரரும் ஒரு திருப்பத்திற்கு ஒரு நகர்வை மட்டுமே திட்டமிடுகிறார்கள்.
