Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.pigs2.INITIAL_INSTRUCTIONS_rest
source: Enter one of any of the following characters: ^ (forward), v (backward), \ (forward left), / (forward right), < (turn left), > (turn right), F (fire laser), H (hit with snout). This will get appended to the left-hand side of your current list of orders. The right-most order will execute next.
ta: பின்வரும் ஏதேனும் எழுத்துக்களில் ஒன்றை உள்ளிடவும்: ^ (முன்னோக்கி), v (பின்தங்கிய), \ (முன்னோக்கி இடது), / (முன்னோக்கி வலது), <(இடதுபுறம் திரும்பவும்),> (வலதுபுறம் திரும்பவும்), எஃப் (ஃபயர் லேசர்), எச் (ச்னவுட்டுடன் இட்). இது உங்கள் தற்போதைய ஆர்டர்களின் பட்டியலின் இடது புறத்தில் சேர்க்கப்படும். வலது வரிசை அடுத்ததாக செயல்படும்.

# validation.pigs2.INVALID_CMD
source: The character '{{cmd}}' is not a recognized command.
ta: '{{cmd}}' எழுத்து அங்கீகரிக்கப்பட்ட கட்டளை அல்ல.

# validation.pigs2.LABEL_ORDERS
source: Player {{playerNum}}'s orders (right-most order next)
ta: பிளேயர் {{playerNum}} இன் ஆர்டர்கள் (வலதுபுறம்-மிக அடுத்து)

# validation.pigs2.TOOLONG_first
source: You may only enter three commands to start.
ta: தொடங்க நீங்கள் மூன்று கட்டளைகளை மட்டுமே உள்ளிடலாம்.

# validation.pigs2.TOOLONG_rest
source: You may only enter a single command on normal turns.
ta: நீங்கள் சாதாரண திருப்பங்களில் ஒரு கட்டளையை மட்டுமே உள்ளிடலாம்.

# validation.pikemen.BAD_FACING
source: The following move segment had an unrecognizeable facing: {{segment}}.
ta: பின்வரும் நகர்வு பிரிவில் அடையாளம் காண முடியாத முகம் உள்ளது: {{segment}}.

# validation.pikemen.INITIAL_INSTRUCTIONS
source: Select one of your pieces to move.
ta: நகர்த்த உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.pikemen.PARTIAL_FINAL
source: The move is valid. If you wish to reorient one last time, click on the cell you want to point towards, or click on the piece itself to stand upright.
ta: நடவடிக்கை செல்லுபடியாகும். கடைசியாக ஒரு முறை மாற்றியமைக்க விரும்பினால், நீங்கள் சுட்டிக்காட்ட விரும்பும் கலத்தைக் சொடுக்கு செய்க, அல்லது நிமிர்ந்து நிற்க அந்தக் பகுதியைக் சொடுக்கு செய்க.

# validation.pikemen.PARTIAL_ORIENT
source: Select the cell you want to point the piece towards.
ta: நீங்கள் பகுதியை நோக்கி சுட்டிக்காட்ட விரும்பும் கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.pikemen.PARTIAL_PREMOVE
source: Select a destination, or select the piece again to reorient.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும் அல்லது மறுசீரமைக்க மீண்டும் பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.pikemen.TOOSMALL
source: Upright pieces can only be captured by larger pieces.
ta: நேர்மையான துண்டுகளை பெரிய துண்டுகளால் மட்டுமே கைப்பற்ற முடியும்.

# validation.pikemen.UPRIGHT_MOVEMENT
source: Upright pieces cannot move.
ta: நேர்மையான துண்டுகள் நகர முடியாது.

# validation.pikemen.USELESS_ORIENTATION
source: If you reorient, you have to change to a new facing.
ta: நீங்கள் மறுசீரமைக்கப்பட்டால், நீங்கள் ஒரு புதிய முகத்திற்கு மாற வேண்டும்.

# validation.pilastri.NORMAL_MOVE
source: Choose a piece to move.
ta: நகர்த்த ஒரு துண்டைத் தேர்வுசெய்க.

# validation.pilastri.INVALID_MOVE
source: You must move a piece in a straight line to the next stack. The piece must end higher. And 1-stacks may only move onto other 1-stacks.
ta: நீங்கள் ஒரு பகுதியை ஒரு நேர் கோட்டில் அடுத்த அடுக்குக்கு நகர்த்த வேண்டும். துண்டு உயர்ந்ததாக இருக்க வேண்டும். மற்றும் 1 அடுக்குகள் மற்ற 1 அடுக்குகளுக்கு மட்டுமே செல்லக்கூடும்.

# validation.pletore.INITIAL_INSTRUCTIONS
source: Place a piece onto an empty intersection not controlled by the opponent, replace an enemy piece on an intersection you control, or 'pass' if all intersections are occupied or controlled. The game ends when both players pass in sequence.
ta: எதிராளியால் கட்டுப்படுத்தப்படாத வெற்று குறுக்குவெட்டில் ஒரு பகுதியை வைக்கவும், நீங்கள் கட்டுப்படுத்தும் ஒரு குறுக்குவெட்டில் ஒரு எதிரி பகுதியை மாற்றவும் அல்லது அனைத்து குறுக்குவெட்டுகளும் ஆக்கிரமிக்கப்பட்டால் அல்லது கட்டுப்படுத்தப்பட்டால் 'கடந்து செல்லுங்கள்'. இரு வீரர்களும் வரிசையில் கடந்து செல்லும்போது விளையாட்டு முடிகிறது.

# validation.pletore.INITIAL_INSTRUCTIONS_BUTTON
source: Place a piece onto an empty intersection not controlled by the opponent, replace an enemy piece on an intersection you control, or take the button (worth .5 points).
ta: எதிராளியால் கட்டுப்படுத்தப்படாத வெற்று குறுக்குவெட்டில் ஒரு பகுதியை வைக்கவும், நீங்கள் கட்டுப்படுத்தும் ஒரு குறுக்குவெட்டில் எதிரி பகுதியை மாற்றவும் அல்லது பொத்தானை (மதிப்பு .5 புள்ளிகள்) எடுத்துக் கொள்ளுங்கள்.

# validation.pletore.INITIAL_SETUP
source: Enter a number to set the bonus to the second player's score. Your opponent will have a chance to swap seats.
ta: இரண்டாவது வீரரின் மதிப்பெண்ணுக்கு போனசை அமைக்க ஒரு எண்ணை உள்ளிடவும். உங்கள் எதிரிக்கு இருக்கைகளை மாற்ற வாய்ப்பு கிடைக்கும்.

# validation.pletore.INSUFFICIENT_CONTROL
source: You cannot replace a piece on {{cell}}. You do not control the intersection.
ta: {{cell} on இல் ஒரு பகுதியை மாற்ற முடியாது. நீங்கள் குறுக்குவெட்டைக் கட்டுப்படுத்தவில்லை.

# validation.pletore.INVALIDBUTTON
source: The button is already taken or is not in use this game.
ta: பொத்தான் ஏற்கனவே எடுக்கப்பட்டுள்ளது அல்லது இந்த விளையாட்டில் பயன்பாட்டில் இல்லை.

# validation.pletore.INVALIDKOMI
source: The first move of the game must be an integer representing the number of points the second player starts with. You may not offer a komi greater than the number of cells on the board plus one.
ta: விளையாட்டின் முதல் நகர்வு இரண்டாவது வீரர் தொடங்கும் புள்ளிகளின் எண்ணிக்கையைக் குறிக்கும் ஒரு முழு எண்ணாக இருக்க வேண்டும். போர்டில் உள்ள கலங்களின் எண்ணிக்கையை விட அதிகமான கோமியை நீங்கள் வழங்கக்கூடாது.

# validation.pletore.INVALIDPASS
source: You cannot pass while uncontrolled intersections exist or the button still needs to be taken.
ta: கட்டுப்பாடற்ற குறுக்குவெட்டுகள் இருக்கும்போது நீங்கள் கடந்து செல்ல முடியாது அல்லது பொத்தானை இன்னும் எடுக்க வேண்டும்.

# validation.pletore.INVALIDPIE
source: You cannot accept or reject a pie offer now.
ta: பை சலுகையை நீங்கள் இப்போது ஏற்றுக்கொள்ளவோ நிராகரிக்கவோ முடியாது.

# validation.pletore.KOMI_CHOICE
source: Invoke pie to play first or accept playing as second player.
ta: முதலில் விளையாட பைவை அழைக்கவும் அல்லது இரண்டாவது வீரராக விளையாடுவதை ஏற்றுக்கொள்ளவும்.

# validation.pletore.OPPONENT_CONTROL
source: You cannot place onto the empty intersection {{cell}}. It is controlled by the opponent.
ta: வெற்று குறுக்குவெட்டு {{cell}} இல் வைக்க முடியாது. இது எதிரியால் கட்டுப்படுத்தப்படுகிறது.

# validation.pods.INITIAL_INSTRUCTIONS
source: Place a piece onto an empty space where you have more neighboring pieces, or select a piece to move around other pieces without passing through spaces controlled by the opponent.
ta: உங்களிடம் அதிகமான அண்டை துண்டுகள் இருக்கும் ஒரு வெற்று இடத்தில் ஒரு துண்டுகளை வைக்கவும், அல்லது எதிராளியால் கட்டுப்படுத்தப்படும் இடங்களைக் கடந்து செல்லாமல் மற்ற துண்டுகளைச் சுற்றிச் செல்ல ஒரு துண்டைத் தேர்ந்தெடுக்கவும்.

# validation.pods.FIRST_MOVE_INSTRUCTIONS
source: Place a piece onto any empty space on the board.
ta: பலகையில் வெற்று இடத்தில் ஒரு துண்டு வைக்கவும்.

# validation.pods.INVALID_PLACEMENT
source: You may only place a new piece onto an empty space where you have more neighboring pieces than your opponent.
ta: உங்கள் எதிரியை விட அண்டை துண்டுகள் இருக்கும் வெற்று இடத்தில் மட்டுமே நீங்கள் ஒரு புதிய பகுதியை மட்டுமே வைக்கலாம்.

# validation.pods.INVALID_MOVEMENT
source: You may only move around other pieces without passing through enemy controlled spaces. Legal landing spaces are highlighted when clicking to move.
ta: எதிரி கட்டுப்படுத்தப்பட்ட இடங்களைக் கடந்து செல்லாமல் மட்டுமே நீங்கள் மற்ற துண்டுகளைச் சுற்றி செல்லலாம். நகர்த்துவதற்கு சொடுக்கு செய்யும் போது சட்ட தரையிறங்கும் இடங்கள் முன்னிலைப்படுத்தப்படுகின்றன.

# validation.pods.INVALID_MOVER
source: You may only move your own nonisolated pieces.
ta: நீங்கள் உங்கள் சொந்தமாக்கப்படாத துண்டுகளை மட்டுமே நகர்த்த முடியும்.

# validation.pontedd.BAD_BRIDGE_BLOCKED
source: There may be no tiles under the bridge.
ta: பாலத்தின் கீழ் ஓடுகள் இருக்கக்கூடாது.

# validation.pontedd.BAD_BRIDGE_COLOUR
source: Bridges must connect two tiles of the same colour.
ta: பாலங்கள் ஒரே நிறத்தின் இரண்டு ஓடுகளை இணைக்க வேண்டும்.

# validation.pontedd.BAD_BRIDGE_CROSED
source: Bridges may not cross.
ta: பாலங்கள் கடக்காமல் இருக்கலாம்.

# validation.pontedd.BAD_BRIDGE_DISTANCE
source: Bridges must connect two tiles that are separated by a single space.
ta: பாலங்கள் ஒரு இடத்தால் பிரிக்கப்பட்ட இரண்டு ஓடுகளை இணைக்க வேண்டும்.

# validation.pontedd.BAD_BRIDGE_DOUBLE
source: Tiles cannot support more than one bridge.
ta: ஓடுகள் ஒன்றுக்கு மேற்பட்ட பாலத்தை ஆதரிக்க முடியாது.

# validation.pontedd.BAD_BRIDGE_NONE
source: There are no valid bridges possible from {{cell}}.
ta: {{cell} இருந்து இலிருந்து செல்லுபடியாகும் பாலங்கள் எதுவும் இல்லை.

# validation.pontedd.BAD_BRIDGE_OWNER
source: You may not build bridges on opposing tiles.
ta: எதிரெதிர் ஓடுகளில் நீங்கள் பாலங்களை உருவாக்கக்கூடாது.

# validation.pontedd.BAD_PASS
source: You may only pass if you are unable to place two tiles.
ta: நீங்கள் இரண்டு ஓடுகளை வைக்க முடியாவிட்டால் மட்டுமே நீங்கள் கடந்து செல்ல முடியும்.

# validation.pontedd.BLOCKED
source: The cell {{cell}} is blocked by a bridge.
ta: செல் {{cell}} ஒரு பாலத்தால் தடுக்கப்படுகிறது.

# validation.pontedd.DOUBLE_PLACEMENT
source: You must place tiles on two different cells.
ta: நீங்கள் இரண்டு வெவ்வேறு கலங்களில் ஓடுகளை வைக்க வேண்டும்.

# validation.pontedd.INITIAL_INSTRUCTIONS_play
source: Click an empty cell to place a tile of your colour, or click an existing tile to place a bridge.
ta: Click an வெறுமை கலன் பெறுநர் place a tile of your colour, or click an existing tile பெறுநர் place a bridge.

# validation.pontedd.INITIAL_INSTRUCTIONS_setup
source: Place two tiles of your colour by clicking on empty cells.
ta: வெற்று கலங்களைக் சொடுக்கு செய்வதன் மூலம் உங்கள் வண்ணத்தின் இரண்டு ஓடுகளை வைக்கவும்.

# validation.pontedd.NO_BRIDGES
source: No more bridges may be placed.
ta: இனி பாலங்கள் வைக்கப்படக்கூடாது.

# validation.pontedd.NO_TILES
source: You don't have any more tiles to place.
ta: உங்களிடம் இன்னும் ஓடுகள் இல்லை.

# validation.pontedd.PARTIAL_BRIDGE
source: Select the tile to connect the bridge to.
ta: பாலத்தை இணைக்க ஓடு என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.pontedd.PARTIAL_PLACE
source: Place a second tile.
ta: இரண்டாவது ஓடு வைக்கவும்.

# validation.pontedd.TOO_BIG
source: Islands cannot be larger than four tiles.
ta: தீவுகள் நான்கு ஓடுகளை விட பெரியதாக இருக்க முடியாது.

# validation.pontedd.TOO_CLOSE
source: Islands may not diagonally touch other islands or sandbars of that colour.
ta: தீவுகள் அந்த நிறத்தின் பிற தீவுகள் அல்லது மணல் பட்டைகளை குறுக்காக தொடக்கூடாது.

# validation.pontedd.TOO_MANY
source: You may not place more than two tiles.
ta: நீங்கள் இரண்டு ஓடுகளுக்கு மேல் வைக்கக்கூடாது.

# validation.prudh.INITIAL_INSTRUCTIONS
source: Select a stack on a cell you control.
ta: நீங்கள் கட்டுப்படுத்தும் கலத்தில் ஒரு அடுக்கைத் தேர்ந்தெடுக்கவும்.

# validation.prudh.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.prudh.RUN_MUST_CAP
source: Runs must capture at least one piece.
ta: ரன்கள் குறைந்தது ஒரு பகுதியையாவது கைப்பற்ற வேண்டும்.

# validation.prudh.TOOCLOSE
source: When running, stacks must move as far as they can.
ta: ஓடும்போது, அடுக்குகள் தங்களால் இயன்றவரை நகர வேண்டும்.

# validation.prudh.TOOFAR_run
source: Runs can't extend further than the starting stack can reach.
ta: தொடக்க அடுக்கை எட்டக்கூடியதை விட ரன்கள் மேலும் நீட்டிக்க முடியாது.

# validation.prudh.TOOFAR_slide
source: Slides must stop at the first occupied cell.
ta: ச்லைடுகள் முதல் ஆக்கிரமிக்கப்பட்ட கலத்தில் நிறுத்தப்பட வேண்டும்.

# validation.prudh.TOOSMALL_run
source: Runs must start with a stack of at least two pieces.
ta: ரன்கள் குறைந்தது இரண்டு துண்டுகளின் அடுக்குடன் தொடங்க வேண்டும்.

# validation.prudh.TOOSMALL_slide
source: Slides must start with a stack of at least one piece.
ta: ச்லைடுகள் குறைந்தது ஒரு துண்டின் அடுக்குடன் தொடங்க வேண்டும்.

# validation.prudh.WRONGDIR_run
source: Runs must move orthogonally.
ta: ரன்கள் ஆர்த்தோகனலாக நகர்த்த வேண்டும்.

# validation.prudh.WRONGDIR_slide
source: Slides must move diagonally.
ta: ச்லைடுகள் குறுக்காக நகர வேண்டும்.

# validation.pylon.ADJ_ONLY
source: Pieces may only move to orthogonally adjacent spaces.
ta: துண்டுகள் ஆர்த்தோகனலி அருகிலுள்ள இடங்களுக்கு மட்டுமே செல்லக்கூடும்.

# validation.pylon.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.pylon.BAD_STACK
source: You may not stack the pieces from {{from}} on top of {{to}}. The bottom piece of the top stack must not be larger than the top piece of the bottom stack.
ta: {{from}}}} வரை {{இலிருந்து துண்டுகளை நீங்கள் அடுக்கி வைக்கக்கூடாது. மேல் அடுக்கின் கீழ் துண்டு கீழ் அடுக்கின் மேல் பகுதியை விட பெரியதாக இருக்கக்கூடாது.

# validation.pylon.INITIAL_INSTRUCTIONS_place
source: Click a piece in your stash to place on the board.
ta: பலகையில் வைக்க உங்கள் ச்டாசில் உள்ள ஒரு பகுதியைக் சொடுக்கு செய்க.

# validation.pylon.INITIAL_INSTRUCTIONS_stack
source: Click a pyramid or stack to move it.
ta: அதை நகர்த்த ஒரு பிரமிட் அல்லது அடுக்கைக் சொடுக்கு செய்க.

# validation.pylon.INVALID_SIZE
source: The piece you selected is invalid. It must be a 1, 2, or 3.
ta: நீங்கள் தேர்ந்தெடுத்த துண்டு தவறானது. இது 1, 2, அல்லது 3 ஆக இருக்க வேண்டும்.

# validation.pylon.MUST_MOVE
source: You must move a piece.
ta: நீங்கள் ஒரு துண்டு நகர்த்த வேண்டும்.

# validation.pylon.MUST_STACK
source: Stacks may not be moved onto empty spaces, only other stacks.
ta: அடுக்குகள் வெற்று இடங்களுக்கு நகர்த்தப்படாமல் இருக்கலாம், மற்ற அடுக்குகள் மட்டுமே.

# validation.pylon.NO_PIECE
source: You don't have a size {{size}} piece to place.
ta: உங்களிடம் ஒரு அளவு {{size}} துண்டு இல்லை.

# validation.pylon.ORTH_ONLY
source: Pieces may only move orthogonally.
ta: துண்டுகள் ஆர்த்தோகனலாக மட்டுமே நகரும்.

# validation.pylon.PARTIAL_MOVEMENT
source: Click an orthogonally adjacent, occupied space to move on top of.
ta: மேலே செல்ல ஆர்த்தோகனலி அருகிலுள்ள, ஆக்கிரமிக்கப்பட்ட இடத்தைக் சொடுக்கு செய்க.

# validation.pylon.PARTIAL_PLACEMENT
source: Click an empty space on the board to place your {{size}} piece.
ta: உங்கள் {{size}} துண்டு வைக்க பலகையில் ஒரு வெற்று இடத்தைக் சொடுக்கு செய்க.

# validation.quagmire.LEGAL_MOVES
source: You can only walk/run to non-flooded, unoccupied adjacent spaces or jump over an unoccupied adjacent space to a non-flooded unoccupied space.
ta: நீங்கள் வெள்ளம் இல்லாத, பயன்படுத்தப்படாத அருகிலுள்ள இடங்களுக்கு மட்டுமே நடக்க/ஓட முடியும் அல்லது வெள்ளம் பெறாத இடத்திற்கு அருகிலுள்ள இடத்திற்கு மேல் செல்ல முடியும்.

# validation.quagmire.MAY_RUN
source: You may submit or select another destination cell to run to.
ta: இயக்க மற்றொரு இலக்கு கலத்தை நீங்கள் சமர்ப்பிக்கலாம் அல்லது தேர்ந்தெடுக்கலாம்.

# validation.quagmire.MUST_FINISH_SETUP
source: You cannot move a meeple until all meeples have been placed.
ta: எல்லா மீப்புகளும் வைக்கப்படும் வரை நீங்கள் ஒரு மீப்பிலை நகர்த்த முடியாது.

# validation.quagmire.PLACE_MEEPLE
source: Select an empty cell to place a meeple on. The second player should do this twice in a row.
ta: ஒரு மீப்பிள் வைக்க ஒரு வெற்று கலத்தைத் தேர்ந்தெடுக்கவும். இரண்டாவது வீரர் இதை ஒரு வரிசையில் இரண்டு முறை செய்ய வேண்டும்.

# validation.quagmire.SELECT_DESTINATION
source: Select a destination cell to walk or jump to.
ta: நடக்க அல்லது செல்ல ஒரு இலக்கு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.quagmire.SELECT_MEEPLE
source: Select one of your meeples to move.
ta: நகர்த்த உங்கள் மீப்ப்களில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.quax.EMPTY_FROM
source: You are indicating to place a diagonal connection, but there is no piece at {{where}}.
ta: நீங்கள் ஒரு மூலைவிட்ட இணைப்பை வைப்பதைக் குறிக்கிறது, ஆனால் {{where}} இல் எந்த துண்டு இல்லை.

# validation.quax.INITIAL_INSTRUCTIONS
source: Select a cell to place a piece, or select a piece to link with a diagonal connection.
ta: ஒரு துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும் அல்லது மூலைவிட்ட இணைப்புடன் இணைக்க ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.quax.INVALID_DIAG
source: Diagonal connection {{from}} with {{to}} is not valid.
ta: மூலைவிட்ட இணைப்பு {{}} with {{from}} உடன் செல்லுபடியாகாது.

# validation.quax.NO_DIAGS
source: The piece at {{where}} cannot make a diagonal connection with any neighbouring piece.
ta: {{}}} இல் உள்ள துண்டு எந்த அண்டை துண்டுகளுடனும் மூலைவிட்ட இணைப்பை உருவாக்க முடியாது.

# validation.quax.NORMALISE
source: The move needs to be normalised. Try {{normalised}}.
ta: நகர்வை இயல்பாக்க வேண்டும். {{normalised}} ஐ முயற்சிக்கவும்.

# validation.quax.OPPONENT_FROM
source: You cannot make a diagonal connection with an opponent's piece at {{where}}.
ta: எதிராளியின் துண்டுடன் {{where} at இல் நீங்கள் மூலைவிட்ட இணைப்பை உருவாக்க முடியாது.

# validation.quax.SELECT_TO
source: Select an adjacent piece to make a diagonal connection.
ta: மூலைவிட்ட இணைப்பை உருவாக்க அருகிலுள்ள பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.queensland.BAD_PASS
source: You can only pass in one specific circumstance. You should never see this message.
ta: நீங்கள் ஒரு குறிப்பிட்ட சூழ்நிலையில் மட்டுமே கடந்து செல்ல முடியும். இந்த செய்தியை நீங்கள் ஒருபோதும் பார்க்கக்கூடாது.

# validation.queensland.INITIAL_INSTRUCTIONS
source: Select a piece to move, or select an empty cell to place a piece.
ta: நகர்த்த ஒரு துண்டைத் தேர்ந்தெடுக்கவும் அல்லது ஒரு துண்டு வைக்க வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.queensland.MUST_PLACE
source: Placing a new piece is mandatory.
ta: புதிய துண்டு வைப்பது கட்டாயமாகும்.

# validation.queensland.NO_PIECES
source: You don't have any pieces to place.
ta: உங்களிடம் வைக்க எந்த துண்டுகளும் இல்லை.

# validation.queensland.NOW_PLACE
source: Movement is valid. Select an empty cell to place a piece on.
ta: இயக்கம் செல்லுபடியாகும். ஒரு பகுதியை வைக்க வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.queensland.PARTIAL_MOVE
source: Select the destination.
ta: இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.queensland.STRAIGHT_LINES
source: Pieces may only be moved in straight lines.
ta: துண்டுகள் நேர் கோடுகளில் மட்டுமே நகர்த்தப்படலாம்.

# validation.query.INITIAL_INSTRUCTIONS
source: Place 1 piece on an eight-way intersection, or two pieces on four-way intersections.
ta: எட்டு வழி சந்திப்பில் 1 துண்டு அல்லது நான்கு வழி குறுக்குவெட்டுகளில் இரண்டு துண்டுகளை வைக்கவும்.

# validation.query.CONTINUE
source: You have placed on a four-way intersection. Select one more four-way intersection to place your second piece.
ta: நீங்கள் நான்கு வழி சந்திப்பில் வைத்திருக்கிறீர்கள். உங்கள் இரண்டாவது பகுதியை வைக்க இன்னும் ஒரு நான்கு வழி குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும்.

# validation.query.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.query.SAMECELL
source: You have already placed at {{where}}.
ta: நீங்கள் ஏற்கனவே {{where}} இல் வைத்திருக்கிறீர்கள்.

# validation.query.NOTC4
source: The intersection at {{where}} is not a four-way intersection.
ta: {{where}} இல் உள்ள குறுக்குவெட்டு நான்கு வழி குறுக்குவெட்டு அல்ல.

# validation.query.TOOMANY1
source: You may only place one piece on eight-way intersections.
ta: நீங்கள் எட்டு வழி சந்திப்புகளில் ஒரு பகுதியை மட்டுமே வைக்கலாம்.

# validation.query.TOOMANY2
source: You may only place two pieces on four-way intersections.
ta: நீங்கள் நான்கு வழி குறுக்குவெட்டுகளில் இரண்டு துண்டுகளை மட்டுமே வைக்கலாம்.

# validation.quincunx.INITIAL_INSTRUCTIONS
source: Select a card from your hand to place on the board.
ta: பலகையில் இடத்திற்கு உங்கள் கையில் இருந்து ஒரு அட்டையைத் தேர்ந்தெடுக்கவும்.

# validation.quincunx.PARTIAL
source: Provide the destination.
ta: இலக்கை வழங்கவும்.

# validation.razzle.BAD_DIRECTION
source: You can only move the ball orthogonally or diagonally. The move from {{from}} to {{to}} is invalid.
ta: நீங்கள் பந்தை ஆர்த்தோகனலாக அல்லது குறுக்காக மட்டுமே நகர்த்த முடியும். }} இருந்து இலிருந்து {{from} பெறுநர் க்கு நகர்வது தவறானது.

# validation.razzle.INCOMPLETE_BALL_MOVE
source: You must keep moving the ball, because this position repeats an earlier position and would therefore not be valid.
ta: நீங்கள் பந்தை நகர்த்த வேண்டும், ஏனென்றால் இந்த நிலை முந்தைய நிலையை மீண்டும் செய்கிறது, எனவே செல்லுபடியாகாது.

# validation.razzle.INELIGBLE_RECEIVER
source: This piece is ineligible to receive the ball.
ta: இந்த துண்டு பந்தைப் பெற தகுதியற்றது.

# validation.razzle.INITIAL_INSTRUCTIONS
source: Make a chess knight's move with one of your pieces, or move your ball to one of your open pieces.
ta: உங்கள் துண்டுகளில் ஒன்றைக் கொண்டு சதுரங்க நைட்டியின் நகர்வை உருவாக்கவும் அல்லது உங்கள் பந்தை உங்கள் திறந்த துண்டுகளுக்கு நகர்த்தவும்.

# validation.razzle.MOVE_ONE_PIECE
source: You can only move a piece once per turn.
ta: நீங்கள் ஒரு திருப்பத்திற்கு ஒரு முறை மட்டுமே ஒரு பகுதியை நகர்த்த முடியும்.

# validation.razzle.MUST_MOVE_BALL
source: You must move the ball.
ta: நீங்கள் பந்தை நகர்த்த வேண்டும்.

# validation.razzle.NO_RECEIVER
source: There is no one at {{cell}} to receive the ball.
ta: பந்தைப் பெற {{cell} at இல் யாரும் இல்லை.

# validation.razzle.NOT_EMPTY
source: {{cell}} is not empty, you can not move your piece there.
ta: {{cell}} காலியாக இல்லை, உங்கள் பகுதியை அங்கே நகர்த்த முடியாது.

# validation.razzle.NOT_KNIGHT_MOVE
source: The move from {{from}} to {{to}} is not a knight's move.
ta: {{from}} {{{to} பெறுநர் க்கு நகர்வது ஒரு நைட்டியின் நடவடிக்கை அல்ல.

# validation.razzle.OBSTRUCTED
source: Moving the ball from {{from}} to {{to}} isn't valid as there is an obstruction at {{obstruction}}.
ta: {{} {{{to} பெறுநர் வரை பந்தை நகர்த்துவது செல்லுபடியாகும் அல்ல, ஏனெனில் {{from}} இல் ஒரு தடையாக இருப்பதால்.

# validation.razzle.OWN_RECEIVER
source: You can only move the ball to one of your own pieces.
ta: நீங்கள் பந்தை உங்கள் சொந்த துண்டுகளுக்கு மட்டுமே நகர்த்த முடியும்.

# validation.razzle.PARTIAL_BALL_MOVE
source: You can complete your ball move here, or keep moving it
ta: உங்கள் பந்து நகர்வை இங்கே முடிக்கலாம் அல்லது தொடர்ந்து நகர்த்தலாம்

# validation.razzle.PARTIAL_PIECE_MOVE
source: Provide the destination for your piece.
ta: உங்கள் துண்டுக்கான இலக்கை வழங்கவும்.

# validation.razzle.REPEAT_RECEIVER
source: You can't move the ball to the same piece twice in a row.
ta: நீங்கள் பந்தை ஒரு வரிசையில் இரண்டு முறை ஒரே துண்டுக்கு நகர்த்த முடியாது.

# validation.razzle.REPEATED_POSITION
source: This move would repeat an earlier position and is therefore invalid.
ta: இந்த நடவடிக்கை முந்தைய நிலையை மீண்டும் செய்யும், எனவே அது தவறானது.

# validation.razzle.START_BALL_MOVE
source: Provide a destination for the ball.
ta: பந்துக்கு ஒரு இலக்கை வழங்கவும்.

# validation.razzle.NO_AVAILABLE_RECEIVERS
source: You can not move the ball as there are no eligible receivers.
ta: தகுதியான பெறுநர்கள் இல்லாததால் நீங்கள் பந்தை நகர்த்த முடியாது.

# validation.realm.ALIGNED_BASE
source: You may not place a base that shares a row or column with another friendly base unless (a) you have no other options or (b) you are playing with the 'Relaxed Placement' variant.
ta: (அ) உங்களுக்கு வேறு வழிகள் இல்லாவிட்டால் அல்லது (ஆ) நீங்கள் 'தளர்வான வேலைவாய்ப்பு' மாறுபாட்டுடன் விளையாடாவிட்டால், ஒரு வரிசை அல்லது நெடுவரிசையை மற்றொரு நட்பு தளத்துடன் பகிர்ந்து கொள்ளும் ஒரு தளத்தை நீங்கள் வைக்கக்கூடாது.

# validation.realm.BAD_MULTIMOVE
source: When moving multiple pieces, you must either 'concentrate' (all pieces end in the same realm) or 'disperse' (all pieces start in the same realm).
ta: பல துண்டுகளை நகர்த்தும்போது, நீங்கள் 'செறிவு' (எல்லா துண்டுகளும் ஒரே உலகில் முடிவடையும்) அல்லது 'சிதறல்' (எல்லா துண்டுகளும் ஒரே உலகில் தொடங்குகின்றன).

# validation.realm.CHECKPOINT_CHARLEY
source: With the 'Checkpoint Charley' variant, moving pieces must stop in the first enemy-controlled realm they enter. In this case, the piece must stop in realm {{realm}}.
ta: 'சோதனைச் சாவடி சார்லி' மாறுபாட்டைக் கொண்டு, நகரும் துண்டுகள் அவர்கள் நுழையும் முதல் எதிரி கட்டுப்பாட்டு உலகில் நிறுத்தப்பட வேண்டும். இந்த வழக்கில், துண்டு {{realm} at இல் நிறுத்தப்பட வேண்டும்.
