Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# descriptions.chameleon
source: A chess-like strategy game, played on a 5x5 grid, where each piece's movement capability changes based on the color of the tile where it starts.
ta: ஒரு சதுரங்கம் போன்ற மூலோபாய விளையாட்டு, 5x5 கட்டத்தில் விளையாடியது, அங்கு ஒவ்வொரு துண்டின் இயக்கத் திறனும் அது தொடங்கும் ஓடுகளின் நிறத்தின் அடிப்படையில் மாறுகிறது.

# descriptions.chase
source: Chase is a unique move and capture game played on a cylindrical hex board with dice. Pieces move the exact number of spaces showing on the die face (its "speed"). Landing on enemy pieces captures them; landing on friendly pieces bumps them, which can cause chain reactions. The chamber in the centre of the board is a way of gaining more pieces. You must maintain a total of 25 speed throughout the game. Once you are no longer able to do that, you lose.
ta: சேச் என்பது ஒரு தனித்துவமான நகர்வு மற்றும் ஒரு உருளை ஃச் போர்டில் டைசுடன் விளையாடும் விளையாட்டாகும். துண்டுகள் டை முகத்தில் (அதன் "வேகம்") காண்பிக்கும் இடைவெளிகளின் சரியான எண்ணிக்கையை நகர்த்துகின்றன. எதிரி துண்டுகள் மீது இறங்குவது அவர்களைப் பிடிக்கிறது; நட்புரீதியான துண்டுகளில் இறங்குவது அவற்றை மோதுகிறது, இது சங்கிலி எதிர்வினைகளை ஏற்படுத்தும். பலகையின் மையத்தில் உள்ள அறை அதிக துண்டுகளைப் பெறுவதற்கான ஒரு வழியாகும். விளையாட்டு முழுவதும் மொத்தம் 25 வேகத்தை நீங்கள் பராமரிக்க வேண்டும். நீங்கள் இனி அதைச் செய்ய முடியாமல் போனவுடன், நீங்கள் இழக்கிறீர்கள்.

# descriptions.churn
source: A bloody territory-control game on a small board.
ta: ஒரு சிறிய பலகையில் ஒரு இரத்தக்களரி பிரதேச-கட்டுப்பாட்டு விளையாட்டு.

# descriptions.cifra
source: A breakthrough-style game where the board configuration changes from game to game.
ta: பலகை உள்ளமைவு விளையாட்டிலிருந்து விளையாட்டுக்கு மாறும் ஒரு திருப்புமுனை பாணி விளையாட்டு.

# descriptions.clearcut
source: Connect opposite sides of the board. Lines of pieces may cross in some circumstances, and this results in the removal of some opposing pieces.
ta: குழுவின் எதிர் பக்கங்களை இணைக்கவும். சில சூழ்நிலைகளில் துண்டுகளின் கோடுகள் கடக்கக்கூடும், மேலும் இது சில எதிரெதிர் துண்டுகளை அகற்றும்.

# descriptions.clusterfuss
source: Continually capture pieces with the aim of detaching (and thereby eliminating) groups of opposing pieces. Be the last man standing!
ta: எதிரெதிர் துண்டுகளின் குழுக்களை பிரிக்கும் (அதன் மூலம் அகற்றும்) நோக்கத்துடன் தொடர்ந்து துண்டுகளை கைப்பற்றுங்கள். நிற்கும் கடைசி மனிதராக இருங்கள்!

# descriptions.complica
source: A simple connect-4 game played on a narrow field where the columns never fill up.
ta: ஒரு எளிய இணைப்பு -4 விளையாட்டு ஒரு குறுகிய புலத்தில் விளையாடியது, அங்கு நெடுவரிசைகள் ஒருபோதும் நிரப்பாது.

# descriptions.conect
source: A connection game played on the curved surface of a cone. The goal is to create a closed loop from the player's edge to the centre, or to connect a path to the centre. The game can be played on a projection, which is isomorphic to the usual Hex rhombus with some cells overlapping or removed.
ta: ஒரு கூம்பின் வளைந்த மேற்பரப்பில் ஒரு இணைப்பு விளையாட்டு விளையாடியது. வீரரின் விளிம்பிலிருந்து மையத்திற்கு ஒரு மூடிய வளையத்தை உருவாக்குவது அல்லது மையத்திற்கு ஒரு பாதையை இணைப்பது குறிக்கோள். விளையாட்டை ஒரு திட்டத்தில் விளையாடலாம், இது வழக்கமான ஃச் ரோம்பசுக்கு ஐசோமார்பிக் ஆகும், இது சில செல்கள் ஒன்றுடன் ஒன்று அல்லது அகற்றப்பட்டது.

# descriptions.conhex
source: In ConHex, the winner is the first player to connect their assigned sides of a square board. The board is a pattern of non-regular hexagons with a few non-hexagonal polygons. Players alternate turns placing pieces of their own color on a vertex, and a player can claim a space after placing pieces on at least half the vertices of that space.
ta: கான்எக்சில், ஒரு சதுர பலகையின் ஒதுக்கப்பட்ட பக்கங்களை இணைத்த முதல் வீரர் வெற்றியாளர் ஆவார். போர்டு என்பது ஒரு சில எக்சாகன் அல்லாத பலகோணங்களைக் கொண்ட வழக்கமான அல்லாத அறுகோணங்களின் வடிவமாகும். வீரர்கள் தங்கள் சொந்த வண்ணத்தின் துண்டுகளை ஒரு வெர்டெக்சில் வைப்பதை மாற்றுகிறார்கள், மேலும் ஒரு வீரர் அந்த இடத்தின் குறைந்தது பாதி செங்குத்துகளில் துண்டுகளை வைத்த பிறகு ஒரு இடத்தை கோரலாம்.

# descriptions.connect6
source: Players take turns placing two stones of their colour to try to get a six (or more) in a row. In the default opening, the first player places one stone in the middle of the board. The game ends in a draw if no player gets a six-in-a-row or on two consecutive passes.
ta: ஒரு வரிசையில் ஆறு (அல்லது அதற்கு மேற்பட்டவை) பெற முயற்சிக்க வீரர்கள் தங்கள் வண்ணத்தின் இரண்டு கற்களை வைத்து திருப்பங்களை எடுத்துக்கொள்கிறார்கள். இயல்புநிலை திறப்பில், முதல் வீரர் ஒரு கல்லை பலகையின் நடுவில் வைக்கிறார். எந்தவொரு வீரரும் ஆறு-இன்-ரோவ் அல்லது தொடர்ச்சியாக இரண்டு பாச்களில் இருந்தால் விளையாட்டு ஒரு டிராவில் முடிவடைகிறது.

# descriptions.connecticut
source: Connecticut is a connection game where you win by connecting your edges with a chain of orthogonally or diagonally adjacent stones. On your move, you either place a single stone or a 1x3 triomino (three stones in an unbroken line). The first move must be a single stone, and the pie rule applies.
ta: கனெக்டிகட் என்பது ஒரு இணைப்பு விளையாட்டு, அங்கு உங்கள் விளிம்புகளை ஆர்த்தோகனலி அல்லது குறுக்காக அருகிலுள்ள கற்களின் சங்கிலியுடன் இணைப்பதன் மூலம் நீங்கள் வெல்லும். உங்கள் நகர்வில், நீங்கள் ஒரு கல் அல்லது 1x3 ட்ரியோமினோவை (உடைக்கப்படாத வரிசையில் மூன்று கற்கள்) வைக்கிறீர்கள். முதல் நடவடிக்கை ஒற்றை கல்லாக இருக்க வேண்டும், மற்றும் பை விதி பொருந்தும்.

# descriptions.connections
source: Draw lines between dots of your colour to connect the sides of the board, or surround your opponent's dots to win.
ta: பலகையின் பக்கங்களை இணைக்க உங்கள் வண்ணத்தின் புள்ளிகளுக்கு இடையில் கோடுகளை வரையவும், அல்லது வெற்றிபெற உங்கள் எதிரியின் புள்ளிகளைச் சுற்றவும்.

# descriptions.conspirateurs
source: A traditional French game where you try to get all your pieces to safety before your opponent can do the same.
ta: ஒரு பாரம்பரிய பிரஞ்சு விளையாட்டு, உங்கள் எதிராளியும் அவ்வாறே செய்வதற்கு முன்பு உங்கள் துண்டுகள் அனைத்தையும் பாதுகாப்பிற்குப் பெற முயற்சிக்கிறீர்கள்.

# descriptions.control
source: Control is a finite, drawless territory game of elegant simplicity. Add pieces where your opponent doesn't have more influence or remove pieces from where you have more influence. Last to move wins.
ta: கட்டுப்பாடு என்பது நேர்த்தியான எளிமையின் வரையறுக்கப்பட்ட, வரையப்படாத பிரதேச விளையாட்டு. உங்கள் எதிரிக்கு அதிக செல்வாக்கு இல்லாத இடத்தில் துண்டுகளைச் சேர்க்கவும் அல்லது அதிக செல்வாக்குள்ள இடங்களிலிருந்து துண்டுகளை அகற்றவும். கடைசியாக நகரும் வெற்றிகள்.

# descriptions.courtesan
source: Get your king to the other side of the board while safely "hiding" it among your other pieces.
ta: உங்கள் ராசாவை உங்கள் மற்ற பகுதிகளில் பாதுகாப்பாக "மறைத்து" அதே நேரத்தில் பலகையின் மறுபக்கத்திற்கு அழைத்துச் செல்லுங்கள்.

# descriptions.crossway
source: A game of connecting opposite sides of the board, but lines of pieces may not cross each other.
ta: பலகையின் எதிர் பக்கங்களை இணைக்கும் விளையாட்டு, ஆனால் துண்டுகளின் கோடுகள் ஒருவருக்கொருவர் கடக்காது.

# descriptions.cubeo
source: A boardless, perfect-information dice game where you attempt to promote your dice faster than your opponent or manoeuvre your opponent into a position where they cannot move.
ta: ஒரு போர்டு இல்லாத, சரியான-தகவல் பகடை விளையாட்டு, அங்கு உங்கள் எதிரியை விட வேகமாக உங்கள் பகடைகளை ஊக்குவிக்க முயற்சிக்கிறீர்கள் அல்லது உங்கள் எதிரியை அவர்கள் நகர்த்த முடியாத நிலைக்கு சூழ்ச்சி செய்ய முயற்சிக்கிறீர்கள்.

# descriptions.dagnacht
source: An n-in-a-row game on a checkered board. You can only place pieces on the dark squares, but you can then move pieces onto the light squares. Win by getting 5 in a row orthogonally (including 3 light squares if you are player 1) or 4 in a row on a light diagonal. Winner of the Abstract Games magazine's 2021 "Unequal Board Spaces Game Design Competition".
ta: சரிபார்க்கப்பட்ட பலகையில் ஒரு என்-இன்-ரோ விளையாட்டு. நீங்கள் இருண்ட சதுரங்களில் மட்டுமே துண்டுகளை வைக்க முடியும், ஆனால் நீங்கள் துண்டுகளை ஒளி சதுரங்களில் நகர்த்தலாம். ஒரு வரிசையில் 5 ஐப் பெறுவதன் மூலம் வெல்லுங்கள் ஆர்த்தோகனலி (நீங்கள் வீரர் 1 ஆக இருந்தால் 3 லைட் சதுரங்கள் உட்பட) அல்லது ஒரு ஒளி மூலைவிட்டத்தில் ஒரு வரிசையில் 4. சுருக்க விளையாட்டு இதழின் 2021 "சமமற்ற பலகை இடைவெளிகள் விளையாட்டு வடிவமைப்பு போட்டி" வெற்றியாளர்.

# descriptions.dameo
source: A modern draughts game with linear movement and orthogonal captures.
ta: ஒரு நவீன வரைவு விளையாட்டு நேரியல் இயக்கம் மற்றும் ஆர்த்தோகனல் பிடிப்புகள்.

# descriptions.diffusion
source: Diffusion is a modern mancala-style game where the goal is to empty out your own pits.
ta: பரவல் என்பது ஒரு நவீன மங்கலா பாணி விளையாட்டு, அங்கு உங்கள் சொந்த குழிகளை வெறுமை செய்வதே குறிக்கோள்.

# descriptions.dipole
source: An anti-race game where you inexorably lose pieces, but you try to be the last one to run out.
ta: நீங்கள் தவிர்க்கமுடியாமல் துண்டுகளை இழக்கும் ஒரு பந்தய எதிர்ப்பு விளையாட்டு, ஆனால் நீங்கள் கடைசியாக வெளியேற முயற்சிக்கிறீர்கள்.

# descriptions.dragoneyes
source: A variant of checkers with incomplete information, enchanted dragon eye spaces, and played on a hexagonal board.
ta: முழுமையற்ற செய்தி, மந்திரித்த டிராகன் கண் இடைவெளிகள் மற்றும் ஒரு அறுகோண பலகையில் விளையாடிய செக்கர்களின் மாறுபாடு.

# descriptions.emu
source: Each bird on your ranch is represented by a stack of cards. At the end of the hand, the value of a bird is determined by the sum of the number cards in the stack. The object, naturally enough, is to raise profitable birds. Highest score after a number of "years" wins.
ta: உங்கள் பண்ணையில் உள்ள ஒவ்வொரு பறவையும் அட்டைகளின் அடுக்கால் குறிக்கப்படுகிறது. கையின் முடிவில், ஒரு பறவையின் மதிப்பு அடுக்கில் உள்ள எண் அட்டைகளின் கூட்டுத்தொகையால் தீர்மானிக்கப்படுகிறது. பொருள், இயற்கையாகவே போதுமானது, இலாபகரமான பறவைகளை உயர்த்துவதாகும். பல "ஆண்டுகள்" வெற்றிகளுக்குப் பிறகு அதிக மதிப்பெண்.

# descriptions.entrapment
source: The object of Entrapment is to eliminate your opponent's roamers by surrounding them with impenetrable obstacles and thus rendering them incapable of movement. A roamer that cannot move is considered captured, and is eliminated from the board. When all a player's roamers have been 'entrapped' in this way, the game is over and his or her opponent declared the winner.
ta: உங்கள் எதிரியின் ரோமர்களை அசாத்தியமான தடைகளைச் சுற்றிச் செல்வதன் மூலம் அவற்றை அகற்றுவதோடு, அவற்றை இயக்கத்திற்கு இயலாது. நகர முடியாத ஒரு ரோமர் கைப்பற்றப்பட்டதாகக் கருதப்படுகிறது, மேலும் இது குழுவிலிருந்து நீக்கப்படுகிறது. ஒரு வீரரின் அனைத்து ரோமர்களும் இந்த வழியில் 'சிக்கிய' வரும்போது, விளையாட்டு முடிந்துவிட்டது, மேலும் அவரது எதிர்ப்பாளர் வெற்றியாளரை அறிவித்தார்.

# descriptions.entropy
source: Entropy is a 2-player game representing the struggle between Order and Chaos. The Order player tries to organize their board in such a way to score the highest amount. But the Chaos player gets to *place* the pieces and attempts to thwart Order whenever possible.
ta: என்ட்ரோபி என்பது ஆர்டர் மற்றும் குழப்பத்திற்கு இடையிலான போராட்டத்தைக் குறிக்கும் 2-பிளேயர் விளையாட்டு. ஆர்டர் பிளேயர் அதிக அளவு மதிப்பெண் பெற தங்கள் வாரியத்தை ஒழுங்கமைக்க முயற்சிக்கிறார். ஆனால் குழப்பமான வீரர் * துண்டுகளை * வைக்கவும், முடிந்தவரை ஒழுங்கைத் தடுக்க முயற்சிக்கிறார்.

# descriptions.epam
source: Epaminondas is an elegant 2-player game in which you try to overwhelm your opponent's home row. Pieces move as phalanxes a number of spaces up to their length. The rules are exceedingly simple, but the result is something deep and complex.
ta: எபமினொண்டாச் ஒரு நேர்த்தியான 2-பிளேயர் விளையாட்டாகும், அதில் நீங்கள் உங்கள் எதிரியின் வீட்டு வரிசையை மூழ்கடிக்க முயற்சிக்கிறீர்கள். துண்டுகள் அவற்றின் நீளம் வரை பல இடைவெளிகளை ஃபாலன்க்சாக நகர்த்துகின்றன. விதிகள் மிகவும் எளிமையானவை, ஆனால் இதன் விளைவாக ஆழமான மற்றும் சிக்கலான ஒன்று.

# descriptions.exxit
source: Exxit is fundamentally an area control game. Manoeuvre your pieces to create new tiles. Fight to create the largest connected island of tiles of your colour. The game board is built out as you play.
ta: எக்சிட் என்பது அடிப்படையில் ஒரு பகுதி கட்டுப்பாட்டு விளையாட்டு. புதிய ஓடுகளை உருவாக்க உங்கள் துண்டுகளை சூழ்ச்சி செய்யுங்கள். உங்கள் வண்ணத்தின் ஓடுகளின் மிகப்பெரிய இணைக்கப்பட்ட தீவை உருவாக்க போராடுங்கள். நீங்கள் விளையாடும்போது கேம் போர்டு கட்டப்பட்டுள்ளது.

# descriptions.fabrik
source: In Fabrik, players manipulate workers to determine where pieces can be placed. The goal is to get a certain number of your pieces in a row. In the default game, players can move either worker. The "Arbeiter" variant gives each player control over a specific worker.
ta: ஃபேப்ரிக், வீரர்கள் தொழிலாளர்களை கையாளலாம். உங்கள் துண்டுகளின் ஒரு குறிப்பிட்ட எண்ணிக்கையை ஒரு வரிசையில் பெறுவதே குறிக்கோள். இயல்புநிலை விளையாட்டில், வீரர்கள் தொழிலாளியை நகர்த்தலாம். "ஆர்பீட்டர்" மாறுபாடு ஒவ்வொரு வீரருக்கும் ஒரு குறிப்பிட்ட தொழிலாளி மீது கட்டுப்பாட்டை அளிக்கிறது.

# descriptions.fanorona
source: Fanorona is the national game of Madagascar, and it is believed to have been derived from the game of Alquerque. Checkers can move to adjacent empty spaces and capture opposing pieces by approach or withdrawal. As long as you can keep capturing, you may continue to move. Continue until you capture all your opponent's pieces!
ta: ஃபானோரோனா மடகாச்கரின் தேசிய விளையாட்டு, இது அல்கெர்க்கி விளையாட்டிலிருந்து பெறப்பட்டதாக நம்பப்படுகிறது. செக்கர்கள் அருகிலுள்ள வெற்று இடங்களுக்குச் செல்லலாம் மற்றும் அணுகுமுறை அல்லது திரும்பப் பெறுவதன் மூலம் எதிரெதிர் துண்டுகளைப் பிடிக்கலாம். நீங்கள் தொடர்ந்து கைப்பற்றக்கூடிய வரை, நீங்கள் தொடர்ந்து நகரலாம். உங்கள் எதிரியின் அனைத்து துண்டுகளையும் நீங்கள் கைப்பற்றும் வரை தொடரவும்!

# descriptions.fendo
source: In Fendo, players manoeuvre their pieces to build fences, eventually creating closed off areas that hopefully only they control. Once all the pieces are isolated, the player who controls the most area wins.
ta: ஃபெண்டோவில், வீரர்கள் வேலிகளை உருவாக்குவதற்காக தங்கள் துண்டுகளை சூழ்ச்சி செய்கிறார்கள், இறுதியில் மூடிய பகுதிகளை உருவாக்குகிறார்கள், அவர்கள் கட்டுப்படுத்துகிறார்கள். அனைத்து துண்டுகளும் தனிமைப்படுத்தப்பட்டவுடன், அதிக பகுதியைக் கட்டுப்படுத்தும் வீரர் செய் பெறுவார்.

# descriptions.fightopia
source: A "get to your opponent's home row" game where you have three different sizes of pieces. Each moves and captures differently.
ta: உங்களிடம் மூன்று வெவ்வேறு அளவிலான துண்டுகள் இருக்கும் "உங்கள் எதிரியின் வீட்டு வரிசையைப் பெறுங்கள்" விளையாட்டு. ஒவ்வொன்றும் வித்தியாசமாக நகரும் மற்றும் பிடிக்கிறது.

# descriptions.flume
source: Place stones to make connections. Connecting to three or four other pieces allows you to place another stone. When the board is full, the player with the most stones on the board wins.
ta: இணைப்புகளை உருவாக்க கற்களை வைக்கவும். மூன்று அல்லது நான்கு துண்டுகளுடன் இணைப்பது மற்றொரு கல்லை வைக்க உங்களை அனுமதிக்கிறது. பலகை நிரம்பும்போது, போர்டில் அதிக கற்களைக் கொண்ட வீரர் செய் பெறுவார்.

# descriptions.fnap
source: A tile laying game where players simultaneously select the tile they will play, but only one player gets to place them both. Points are scored by dominating rows and columns and by creating groups of connected (and disconnected) tiles.
ta: வீரர்கள் ஒரே நேரத்தில் அவர்கள் விளையாடும் ஓடு தேர்ந்தெடுக்கும் ஒரு ஓடு இடும் விளையாட்டு, ஆனால் ஒரு வீரர் மட்டுமே இருவரையும் வைக்க வேண்டும். வரிசைகள் மற்றும் நெடுவரிசைகளை ஆதிக்கம் செலுத்துவதன் மூலமும், இணைக்கப்பட்ட (மற்றும் துண்டிக்கப்பட்ட) ஓடுகளின் குழுக்களை உருவாக்குவதன் மூலமும் புள்ளிகள் மதிப்பெண் பெறப்படுகின்றன.

# descriptions.focus
source: A Sid Sackon classic. One may move stacks of pieces as many spaces as pieces in the stack. Once stacks become higher than 5 pieces, the bottom-most pieces are captured. The last person able to move a stack wins.
ta: ஒரு சித் சாக்கன் கிளாசிக். ஒருவர் அடுக்குகளில் துண்டுகளின் அடுக்குகளை அடுக்கில் துண்டுகளாக நகர்த்தலாம். அடுக்குகள் 5 துண்டுகளை விட அதிகமாக மாறியவுடன், கீழே-மிக அதிகமான துண்டுகள் பிடிக்கப்படுகின்றன. கடைசியாக ஒரு அடுக்கை நகர்த்த முடிந்தது.

# descriptions.four
source: A game in which four shapes in four colours are placed in a virtual grid according to four constraints. Be the last player able to place.
ta: நான்கு வண்ணங்களில் நான்கு வடிவங்கள் நான்கு தடைகளுக்கு ஏற்ப ஒரு மெய்நிகர் கட்டத்தில் வைக்கப்படும் ஒரு விளையாட்டு. வைக்கக்கூடிய கடைசி வீரராக இருங்கள்.

# descriptions.fourinarow
source: A simple game of getting four (or more) in a row with the twist: there is gravity.
ta: திருப்பத்துடன் ஒரு வரிசையில் நான்கு (அல்லது அதற்கு மேற்பட்டவை) பெறுவதற்கான எளிய விளையாட்டு: ஈர்ப்பு உள்ளது.

# descriptions.frames
source: A simple "get into the head of your opponent" game where both players simultaneously select an empty cell on a Go board. The placements define a rectangle. The player with the most stones within that rectangle gets a point. Play to a certain number of points.
ta: ஒரு எளிய "உங்கள் எதிரியின் தலையில் இறங்குங்கள்" விளையாட்டில் இரு வீரர்களும் ஒரே நேரத்தில் கோ போர்டில் ஒரு வெற்று கலத்தைத் தேர்ந்தெடுக்கின்றனர். வேலைவாய்ப்புகள் ஒரு செவ்வகத்தை வரையறுக்கின்றன. அந்த செவ்வகத்திற்குள் அதிக கற்களைக் கொண்ட வீரர் ஒரு புள்ளியைப் பெறுகிறார். ஒரு குறிப்பிட்ட எண்ணிக்கையிலான புள்ளிகளுக்கு விளையாடுங்கள்.

# descriptions.furl
source: Either furl up a row of your discs, or unfurl a stack. If you have a disc in your end row at the start of your turn, you win.
ta: உங்கள் வட்டுகளின் வரிசையை உயர்த்துங்கள், அல்லது ஒரு அடுக்கை அவிழ்த்து விடுங்கள். உங்கள் திருப்பத்தின் தொடக்கத்தில் உங்கள் இறுதி வரிசையில் ஒரு வட்டு இருந்தால், நீங்கள் வெல்வீர்கள்.

# descriptions.garden
source: Two wizards share a garden plot and try to harvest valuable reagents. Both are sharing the same pool of seeds. Planting a seed changes the plants around it. Form four in a row to harvest. Most harvests wins!
ta: இரண்டு மந்திரவாதிகள் ஒரு தோட்ட சதித்திட்டத்தைப் பகிர்ந்து கொள்கிறார்கள் மற்றும் மதிப்புமிக்க உலைகளை அறுவடை செய்ய முயற்சிக்கிறார்கள். இருவரும் ஒரே விதைகளை பகிர்ந்து கொள்கிறார்கள். ஒரு விதை நடவு செய்வது அதைச் சுற்றியுள்ள தாவரங்களை மாற்றுகிறது. அறுவடை செய்ய ஒரு வரிசையில் நான்கு படிவம். பெரும்பாலான அறுவடை வெற்றி!

# descriptions.gess
source: In Gess, the 'pieces' are 3x3 patterns stones. A player can use any 3×3 portion of the board that contains at least one of their stones and none of their opponent's stones. If a 3x3 piece moves in such a way that it overlaps one or more stones (of either player), all stones that the piece moves onto are captured. Each player must maintain one piece that is a ring of eight stones around an empty square at all times. If one player is in a position where they no longer have such a ring anywhere on the board for any reason, they lose.
ta: கெசில், 'துண்டுகள்' 3x3 வடிவ கற்கள். ஒரு வீரர் போர்டின் 3 × 3 பகுதியை தங்கள் கற்களில் ஒன்றைக் கொண்டிருக்கும் மற்றும் எதிராளியின் கற்கள் எதுவும் இல்லை. 3x3 துண்டு ஒன்று அல்லது அதற்கு மேற்பட்ட கற்களை (இரு வீரரின்) மேலெழுதும் வகையில் நகர்ந்தால், துண்டு நகரும் அனைத்து கற்களும் கைப்பற்றப்படுகின்றன. ஒவ்வொரு வீரரும் எல்லா நேரங்களிலும் வெற்று சதுரத்தைச் சுற்றி எட்டு கற்களின் வளையமாக இருக்கும் ஒரு பகுதியை பராமரிக்க வேண்டும். ஒரு வீரர் எந்தவொரு காரணத்திற்காகவும் போர்டில் எங்கும் இதுபோன்ற மோதிரம் இல்லாத நிலையில் இருந்தால், அவர்கள் இழக்கிறார்கள்.

# descriptions.gliss
source: Establish bases and deploy gliders to capture opposing gliders and control towers. Eliminate all opposing bases or establish a critical number of control towers to win.
ta: எதிரெதிர் கிளைடர்களைக் கைப்பற்றவும், கோபுரங்களைக் கட்டுப்படுத்தவும் தளங்களை நிறுவி கிளைடர்களை வரிசைப்படுத்துங்கள். அனைத்து எதிரெதிர் தளங்களையும் அகற்றவும் அல்லது வெற்றிபெற ஒரு முக்கியமான எண்ணிக்கையிலான கட்டுப்பாட்டு கோபுரங்களை நிறுவவும்.

# descriptions.gomoku
source: A classic game where you try to get exactly five stones in a row. Six in a row does not count as a win. The game ends in a draw if no player gets a five-in-a-row or on two consecutive passes.
ta: ஒரு வரிசையில் சரியாக ஐந்து கற்களைப் பெற முயற்சிக்கும் ஒரு உன்னதமான விளையாட்டு. தொடர்ச்சியாக ஆறு பேர் ஒரு வெற்றியாக கருதப்படுவதில்லை. எந்தவொரு வீரருக்கும் ஐந்து-ஒரு-வரிசையில் அல்லது தொடர்ச்சியாக இரண்டு பாச்கள் இருந்தால் விளையாட்டு ஒரு டிராவில் முடிவடைகிறது.

# descriptions.gonnect
source: Gonnect is a connection game where players try to connect any two opposite sides. All rules of Go apply except that players may not pass.
ta: கோனெக்ட் என்பது ஒரு இணைப்பு விளையாட்டு, அங்கு வீரர்கள் எந்த இரண்டு எதிர் பக்கங்களையும் இணைக்க முயற்சிக்கிறார்கள். வீரர்கள் கடந்து செல்லக்கூடாது என்பதைத் தவிர அனைத்து விதிகளும் பொருந்தும்.

# descriptions.gorogo
source: A Go variant played on a small board where the goal is to capture more pieces than your opponent, rather than to claim territory.
ta: ஒரு சிறிய போர்டில் விளையாடும் ஒரு கோ மாறுபாடு, உங்கள் எதிரியை விட அதிகமான துண்டுகளைப் பிடிப்பதே குறிக்கோள், பிரதேசத்தை கோருவதை விட.

# descriptions.gyges
source: A breakthrough game where nobody owns any pieces, and pieces rebound off of each other.
ta: யாரும் எந்த துண்டுகளையும் வைத்திருக்காத ஒரு திருப்புமுனை விளையாட்டு, மற்றும் துண்டுகள் ஒருவருக்கொருவர் மீளப்படுகின்றன.

# descriptions.gyve
source: Drawless unification game where you try to form fewer groups than your opponent. On each turn, you place two stones in sequence so that each one is adjacent to the same number of friendly groups at the moment of placement.
ta: உங்கள் எதிரியை விட குறைவான குழுக்களை உருவாக்க முயற்சிக்கும் ஒருங்கிணைப்பு விளையாட்டு. ஒவ்வொரு திருப்பத்திலும், நீங்கள் இரண்டு கற்களை வரிசையில் வைக்கிறீர்கள், இதனால் ஒவ்வொன்றும் ஒரே எண்ணிக்கையிலான நட்பு குழுக்களுக்கு அருகில் இருக்கும்.

# descriptions.havannah
source: A connection game where you vye to form either a ring, a bridge, or a fork. A ring is a chain around at least one cell. A bridge is a chain linking two corners. A fork is a chain linking three sides. Corners do not belong to either side.
ta: ஒரு மோதிரம், பாலம் அல்லது முட்கரண்டி ஆகியவற்றை உருவாக்க நீங்கள் ஒரு இணைப்பு விளையாட்டு. ஒரு மோதிரம் என்பது குறைந்தது ஒரு கலத்தைச் சுற்றியுள்ள ஒரு சங்கிலி. ஒரு பாலம் என்பது இரண்டு மூலைகளை இணைக்கும் சங்கிலி. ஒரு முட்கரண்டி என்பது மூன்று பக்கங்களை இணைக்கும் ஒரு சங்கிலி. மூலைகள் இருபுறமும் இல்லை.

# descriptions.hens
source: Hens and Chicks is a draughts-style game with two types of pieces and a unique capturing mechanic. The winner is the first to land a piece in their opponent's home row or to eliminate all the opposing hens.
ta: கோழிகள் மற்றும் குஞ்சுகள் இரண்டு வகையான துண்டுகள் மற்றும் ஒரு தனித்துவமான கைப்பற்றும் மெக்கானிக் கொண்ட ஒரு டிராட்ச் பாணி விளையாட்டு. வெற்றியாளர் முதலில் தங்கள் எதிரியின் வீட்டு வரிசையில் ஒரு பகுதியை தரையிறக்கினார் அல்லது எதிரெதிர் கோழிகளையும் அகற்றினார்.

# descriptions.hex
source: In Hex, two players attempt to connect opposite sides of a rhombus-shaped board made of hexagonal cells
ta: எக்சில், இரண்டு வீரர்கள் அறுகோண கலங்களால் ஆன ரோம்பச் வடிவ பலகையின் எதிர் பக்கங்களை இணைக்க முயற்சிக்கிறார்கள்

# descriptions.hexentafl
source: heXentafl is a hexagonal variant of Hnefatafl where the attackers try to capture the king and the defenders try to guide the king to one of the six corners.
ta: எக்சென்டாஃப் என்பது Hnefatafl இன் ஒரு அறுகோண மாறுபாடாகும், அங்கு தாக்குதல் நடத்தியவர்கள் ராசாவைக் கைப்பற்ற முயற்சிக்கிறார்கள், மேலும் பாதுகாவலர்கள் ராசாவை ஆறு மூலைகளில் ஒன்றிற்கு வழிநடத்த முயற்சிக்கிறார்கள்.

# descriptions.hexy
source: An adaptation of Y on a regular hexagon where players vye to control most of the perimeter of the board.
ta: ஒரு வழக்கமான அறுகோணத்தில் ஒய் இன் தழுவல், அங்கு வீரர்கள் பலகையின் சுற்றளவு கட்டுப்படுத்த வேண்டும்.

# descriptions.homeworlds
source: An Icehouse game for 2 to 4 players. Players are interstellar civilizations vying for dominance. Each of the four colours of pyramid gives access to different actions. Amass a fleet, explore the galaxy, and ultimately destroy your opponent.
ta: 2 முதல் 4 வீரர்களுக்கு ஒரு ஐச்அவுச் விளையாட்டு. வீரர்கள் ஆதிக்கத்திற்காக போட்டியிடும் விண்மீன் நாகரிகங்கள். பிரமிட்டின் நான்கு வண்ணங்கள் ஒவ்வொன்றும் வெவ்வேறு செயல்களுக்கு அணுகலை அளிக்கின்றன. ஒரு கடற்படையை குவித்து, விண்மீனை ஆராய்ந்து, இறுதியில் உங்கள் எதிரியை அழிக்கவும்.
