Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation._general.NOT_ORTH_OR_DIAG
source: The cells {{from}} and {{to}} are not orthogonal or diagonal to each other.
ta: {{from}} மற்றும்{{to}} க்கு வரை கலங்கள் ஒருவருக்கொருவர் ஆர்த்தோகனல் அல்லது மூலைவிட்டம் அல்ல.

# validation._general.OBSTRUCTED
source: There is an obstruction at {{obstruction}} between {{from}} and {{to}}.
ta: {{to}}மற்றும் {{from}} க்கு வரை {{obstruction}} இல் ஒரு தடை உள்ளது.

# validation._general.OCCUPIED
source: The cell {{where}} is already occupied.
ta: செல் {{where}} ஏற்கனவே ஆக்கிரமிக்கப்பட்டுள்ளது.

# validation._general.SAME_FROM_TO
source: The 'from' and 'to' cells have to be different.
ta: 'இலிருந்து' மற்றும் 'முதல்' செல்கள் வித்தியாசமாக இருக்க வேண்டும்.

# validation._general.SELECT_OWN
source: Select one of your own pieces.
ta: உங்கள் சொந்த துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation._general.SELFCAPTURE
source: You cannot capture your own pieces.
ta: உங்கள் சொந்த துண்டுகளை நீங்கள் கைப்பற்ற முடியாது.

# validation._general.UNCONTROLLED
source: You cannot move pieces you don't control.
ta: நீங்கள் கட்டுப்படுத்தாத துண்டுகளை நகர்த்த முடியாது.

# validation._general.UNKNOWN_CLICK
source: I don't know how to interpret that click.
ta: அந்த கிளிக்கில் எவ்வாறு விளக்குவது என்று எனக்குத் தெரியவில்லை.

# validation._general.VALID_MOVE
source: Looks like a valid move.
ta: சரியான நடவடிக்கை போல் தெரிகிறது.

# validation._inarow.CANNOT_PASS
source: You may not pass for the first two moves after the opening phase.
ta: தொடக்க கட்டத்திற்குப் பிறகு முதல் இரண்டு நகர்வுகளுக்கு நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation._inarow.CANNOT_SWAP
source: You may not swap colours at this time.
ta: இந்த நேரத்தில் நீங்கள் வண்ணங்களை மாற்றக்கூடாது.

# validation._inarow.CENTRE_OFFCENTRE
source: You must place your first stone in the centre of the board in the normal opening.
ta: உங்கள் முதல் கல்லை வாரியத்தின் மையத்தில் சாதாரண திறப்பில் வைக்க வேண்டும்.

# validation._inarow.DUPLICATE
source: You have already placed a piece at {{where}}.
ta: நீங்கள் ஏற்கனவே ஒரு பகுதியை {{where}} இல் வைத்திருக்கிறீர்கள்.

# validation._inarow.EXCESS
source: You have placed too many stones. You may only place 1 stone.
ta: நீங்கள் பல கற்களை வைத்துள்ளீர்கள். நீங்கள் 1 கல்லை மட்டுமே வைக்கலாம்.

# validation._inarow.INITIAL_INSTRUCTIONS
source: Select an intersection to place a stone.
ta: ஒரு கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும்.

# validation._inarow.INITIAL_INSTRUCTIONS_CENTRE1
source: Place your first stone in the centre of the board.
ta: உங்கள் முதல் கல்லை பலகையின் மையத்தில் வைக்கவும்.

# validation._inarow.INITIAL_INSTRUCTIONS_LONGPRO1
source: Place your first stone in the centre of the board.
ta: உங்கள் முதல் கல்லை பலகையின் மையத்தில் வைக்கவும்.

# validation._inarow.INITIAL_INSTRUCTIONS_LONGPRO3
source: Select an intersection to place a stone. Your move must be at least four intersections away from the centre of the board.
ta: ஒரு கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும். உங்கள் நடவடிக்கை வாரியத்தின் மையத்திலிருந்து குறைந்தது நான்கு குறுக்குவெட்டுகளாக இருக்க வேண்டும்.

# validation._inarow.INITIAL_INSTRUCTIONS_PRO1
source: Place your first stone in the centre of the board.
ta: உங்கள் முதல் கல்லை பலகையின் மையத்தில் வைக்கவும்.

# validation._inarow.INITIAL_INSTRUCTIONS_PRO3
source: Select an intersection to place a stone. Your move must be at least three intersections away from the centre of the board.
ta: ஒரு கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும். உங்கள் நடவடிக்கை வாரியத்தின் மையத்திலிருந்து குறைந்தது மூன்று சந்திப்புகளாக இருக்க வேண்டும்.

# validation._inarow.INITIAL_INSTRUCTIONS_SWAP1ST1
source: Select an intersection to place a stone. The opponent has the option to swap colours on the next turn.
ta: ஒரு கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும். அடுத்த திருப்பத்தில் வண்ணங்களை மாற்ற எதிராளிக்கு விருப்பம் உள்ளது.

# validation._inarow.INITIAL_INSTRUCTIONS_SWAP1ST2
source: You may place a stone to continue as player 2, or pass to swap colours to play as player 1.
ta: பிளேயர் 2 ஆக தொடர நீங்கள் ஒரு கல்லை வைக்கலாம், அல்லது பிளேயர் 1 ஆக விளையாட வண்ணங்களை மாற்றுவதற்கு அனுப்பலாம்.

# validation._inarow.INITIAL_INSTRUCTIONS_SWAP5
source: Select an intersection to place a stone, or pass to swap colours.
ta: ஒரு கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும் அல்லது வண்ணங்களை மாற்றவும்.

# validation._inarow.INITIAL_INSTRUCTIONS_SWAP21
source: Place three stones on the board
ta: பலகையில் மூன்று கற்களை வைக்கவும்

# validation._inarow.INITIAL_INSTRUCTIONS_SWAP22
source: You may do one of (1) place a single stone to continue as player 2, (2) pass to swap colours to play as player 1, or (3) place two more stones and allow the opponent to decide to play as player 1 or player 2.
ta: நீங்கள் (1) பிளேயர் 2 ஆக தொடர ஒரு கல்லை வைக்கலாம், (2) பிளேயர் 1 ஆக விளையாட வண்ணங்களை மாற்றுவதற்கு பாச், அல்லது (3) மேலும் இரண்டு கற்களை வைத்து, எதிரியை பிளேயர் 1 ஆக விளையாட முடிவு செய்ய அனுமதிக்கவும் அல்லது பிளேயர் 2.

# validation._inarow.INITIAL_INSTRUCTIONS_SWAP23
source: You may place a stone to continue as player 1, or pass to swap colours to play as player 2.
ta: பிளேயர் 1 ஆக தொடர நீங்கள் ஒரு கல்லை வைக்கலாம் அல்லது பிளேயர் 2 ஆக விளையாட வண்ணங்களை மாற்றுவதற்கு அனுப்பலாம்.

# validation._inarow.INVALID_PLACEMENT
source: Unable to interpret the move notation: {{move}}.
ta: நகர்வு குறியீட்டை விளக்க முடியவில்லை: {{move}}.

# validation._inarow.LONGPRO_RESTRICTION_FIRST
source: You must place your first stone in the centre of the board in the long pro opening.
ta: உங்கள் முதல் கல்லை நீண்ட சார்பு திறப்பில் பலகையின் மையத்தில் வைக்க வேண்டும்.

# validation._inarow.LONGPRO_RESTRICTION_THIRD
source: Your third stone must be at least four intersections away from the centre of the board in the long pro opening.
ta: உங்கள் மூன்றாவது கல் நீண்ட சார்பு திறப்பில் வாரியத்தின் மையத்திலிருந்து குறைந்தது நான்கு குறுக்குவெட்டுகளாக இருக்க வேண்டும்.

# validation._inarow.NO_MOVELIST
source: Move list not available during this opening move. Click on the board to place stones.
ta: இந்த தொடக்க நடவடிக்கையின் போது பட்டியல் கிடைக்கவில்லை. கற்களை வைக்க பலகையில் சொடுக்கு செய்க.

# validation._inarow.NORMALISE
source: The move needs to be normalised. Try {{normalised}}.
ta: நகர்வை இயல்பாக்க வேண்டும். {{normalised}} ஐ முயற்சிக்கவும்.

# validation._inarow.PRO_RESTRICTION_FIRST
source: You must place your first stone in the centre of the board in the pro opening.
ta: உங்கள் முதல் கல்லை வாரியத்தின் மையத்தில் சார்பு திறப்பில் வைக்க வேண்டும்.

# validation._inarow.PRO_RESTRICTION_THIRD
source: Your third stone must be at least three intersections away from the centre of the board in the pro opening.
ta: உங்கள் மூன்றாவது கல் சார்பு திறப்பில் வாரியத்தின் மையத்திலிருந்து குறைந்தது மூன்று குறுக்குவெட்டுகளாக இருக்க வேண்டும்.

# validation._inarow.SWAP2_CAPTURE
source: This placement will result in a capture.
ta: இந்த வேலைவாய்ப்பு ஒரு பிடிப்புக்கு வழிவகுக்கும்.

# validation._inarow.SWAP21_EXCESS
source: You have placed too many stones. You may only place 3 stones.
ta: நீங்கள் பல கற்களை வைத்துள்ளீர்கள். நீங்கள் 3 கற்களை மட்டுமே வைக்கலாம்.

# validation._inarow.SWAP21
source: Place 1 more stone on the board.
ta: போர்டில் மேலும் 1 கல்லை வைக்கவும்.

# validation._inarow.SWAP22_EXCESS
source: You have placed too many stones. You may only place 2 stone.
ta: நீங்கள் பல கற்களை வைத்துள்ளீர்கள். நீங்கள் 2 கல்லை மட்டுமே வைக்கலாம்.

# validation._inarow.SWAP22_PARTIAL
source: Complete the move to continue as player 2, or place another stone on the board to allow the opponent to decide to play as player 1 or player 2.
ta: பிளேயர் 2 ஆகத் தொடர நகர்வதை முடிக்கவும், அல்லது பிளேயர் 1 அல்லது பிளேயர் 2 ஆக விளையாடுவதை எதிராளியை அனுமதிக்க மற்றொரு கல்லை போர்டில் வைக்கவும்.

# validation.abande.DISCONNECTEDMOVE
source: A move from {{from}} to {{to}} would disconnect the band.
ta: {{from}} இலிருந்து {{to}} வரை இசைக்குழுவைத் துண்டிக்கும்.

# validation.abande.DISCONNECTEDPLACE
source: Placing a piece at {{where}} would disconnect the band.
ta: ஒரு பகுதியை {{where}} இசைக்குழுவைத் துண்டிக்கும்.

# validation.abande.INITIAL_INSTRUCTIONS
source: Place a piece on an empty space connected to the other pieces.
ta: மற்ற துண்டுகளுடன் இணைக்கப்பட்ட வெற்று இடத்தில் ஒரு துண்டு வைக்கவும்.

# validation.abande.INVALIDPASS
source: You cannot pass while you have pieces in hand.
ta: உங்களிடம் துண்டுகள் இருக்கும்போது நீங்கள் கடந்து செல்ல முடியாது.

# validation.abande.MOVE2CONTROLLED
source: You cannot capture your own stacks.
ta: உங்கள் சொந்த அடுக்குகளை நீங்கள் கைப்பற்ற முடியாது.

# validation.abande.MOVE2EMPTY
source: You cannot move to empty spaces.
ta: நீங்கள் வெற்று இடங்களுக்கு செல்ல முடியாது.

# validation.abande.PARTIAL
source: It's possible you're trying to move a stack. Provide the destination.
ta: நீங்கள் ஒரு அடுக்கை நகர்த்த முயற்சிக்கிறீர்கள். இலக்கை வழங்கவும்.

# validation.abande.TOOEARLY
source: You cannot move until the first player has placed two pieces.
ta: முதல் வீரர் இரண்டு துண்டுகளை வைக்கும் வரை நீங்கள் நகர முடியாது.

# validation.abande.TOOHIGH
source: Moving from {{from}} to {{to}} would result in a stack taller than three pieces high.
ta: {{from}} முதல் {{to}} வரை நகரும் மூன்று துண்டுகள் உயரத்தை விட உயரமான ஒரு அடுக்கு வழிவகுக்கும்.

# validation.abande.TRIPLESTACK
source: You cannot move triple stacks.
ta: நீங்கள் மூன்று அடுக்குகளை நகர்த்த முடியாது.

# validation.accasta.INITIAL_INSTRUCTIONS
source: Select the bottom piece of the substack you wish to move.
ta: நீங்கள் நகர்த்த விரும்பும் துணை பகுதியின் கீழ் பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.accasta.INVALID_SIZE
source: In the move '{{move}}', the step '{{step}}' contains an invalid number of pieces to move. Remember that if you're removing the entire stack, omit the number altogether.
ta: '{{move}}' நகர்வில், '{{step}}' படி நகர்த்துவதற்கு தவறான எண்ணிக்கையிலான துண்டுகள் உள்ளன. நீங்கள் முழு அடுக்கையும் அகற்றினால், எண்ணை முழுவதுமாக தவிர்க்கவும் என்பதை நினைவில் கொள்ளுங்கள்.

# validation.accasta.MORE_THAN_THREE
source: In the move '{{move}}', the step '{{step}}' would create a stack with more than 3 pieces of the same color.
ta: '{{move}}' நகர்வில், '{{step}}' படி ஒரே நிறத்தின் 3 க்கும் மேற்பட்ட துண்டுகளுடன் ஒரு அடுக்கை உருவாக்கும்.

# validation.accasta.PARTIAL_FULLSTACK
source: Looks like you want to move an entire stack. Provide the destination.
ta: நீங்கள் ஒரு முழு அடுக்கை நகர்த்த விரும்புகிறீர்கள் என்று தெரிகிறது. இலக்கை வழங்கவும்.

# validation.accasta.PARTIAL_SUBSTACK
source: Looks like you want to move the top piece from the stack. Provide the destination.
ta: நீங்கள் அடுக்கிலிருந்து மேல் பகுதியை நகர்த்த விரும்புகிறீர்கள் என்று தெரிகிறது. இலக்கை வழங்கவும்.

# validation.accasta.SOURCE_EMPTY
source: In the move '{{move}}', when you come to the step '{{step}}', you don't have any pieces left to move.
ta: '{{move}}' நகர்வில், நீங்கள் '{{step}}' படிக்கு வரும்போது, உங்களிடம் நகர்த்த எந்த துண்டுகளும் இல்லை.

# validation.accasta.TOOFAR
source: In the move '{{move}}', the step '{{step}}' tries to move further than it is allowed.
ta: '{{move}}' நகர்வில், '{{step}}' படி அனுமதிக்கப்பட்டதை விட மேலும் நகர்த்த முயற்சிக்கிறது.

# validation.accasta.TOOHIGH
source: In the move '{{move}}', the step '{{step}}' would create a stack greater than six pieces high.
ta: '{{move}}' நகர்வில், '{{step}}' படி ஆறு துண்டுகள் உயரத்திற்கு மேல் ஒரு அடுக்கை உருவாக்கும்.

# validation.accasta.USEMINUS
source: In the step {{step}}, use a minus sign when moving onto an empty cell.
ta: {{step}} படி, வெற்று கலத்திற்கு செல்லும்போது ஒரு கழித்தல் அடையாளத்தைப் பயன்படுத்தவும்.

# validation.accasta.USEPLUS
source: In the step {{step}}, use a plus sign when moving onto an existing stack.
ta: {{step}} படி, ஏற்கனவே உள்ள அடுக்குக்கு செல்லும்போது ஒரு பிளச் அடையாளத்தைப் பயன்படுத்தவும்.

# validation.acity.BAD_DOME
source: Domes may only be placed on tiles of the same colour unless all such placements break the road network.
ta: இதுபோன்ற அனைத்து வேலைவாய்ப்புகளும் சாலை நெட்வொர்க்கை உடைக்காவிட்டால், ஒரே வண்ணத்தின் ஓடுகளில் மட்டுமே குவிமாடங்கள் வைக்கப்படலாம்.

# validation.acity.BAD_TOWER
source: Towers may only be placed on tiles their own colour, on black tiles, or on tiles that already contain two legally placed structures.
ta: கோபுரங்கள் அவற்றின் சொந்த வண்ணம், கருப்பு ஓடுகளில் அல்லது ஏற்கனவே சட்டப்பூர்வமாக வைக்கப்பட்ட இரண்டு கட்டமைப்புகளைக் கொண்ட ஓடுகளில் மட்டுமே ஓடுகளில் வைக்கப்படலாம்.

# validation.acity.BROKEN_ROAD
source: Placing a piece at {{where}} would break the road network.
ta: ஒரு பகுதியை {{where}} சாலை நெட்வொர்க்கை உடைக்கும்.

# validation.acity.CLAIM_TOWERS
source: You may only claim towers.
ta: நீங்கள் கோபுரங்களை மட்டுமே கோரலாம்.

# validation.acity.DOUBLE_CLAIM
source: The tower at {{where}} has already been claimed.
ta: {{where}} இல் உள்ள கோபுரம் ஏற்கனவே உரிமை கோரப்பட்டுள்ளது.

# validation.acity.INITIAL_INSTRUCTIONS
source: Select a piece from your stash, or type 'pass' if you have no legal moves remaining.
ta: உங்கள் ச்டாசிலிருந்து ஒரு பகுதியைத் தேர்ந்தெடுக்கவும் அல்லது உங்களிடம் சட்டப்பூர்வ நகர்வுகள் எதுவும் இல்லை என்றால் 'பாச்' என தட்டச்சு செய்க.

# validation.acity.INVALID_PASS
source: You may only pass if you have no other moves available.
ta: உங்களிடம் வேறு எந்த நகர்வுகளும் கிடைக்கவில்லை என்றால் மட்டுமே நீங்கள் கடந்து செல்லலாம்.

# validation.acity.INVALID_PIECE
source: You don't have {{piece}} in your stash to place.
ta: உங்கள் இடத்திற்கு உங்கள் ச்டாசில் {{piece}} இல்லை.

# validation.acity.ISOLATED
source: Placing a piece at {{where}} would cut another piece off from the road network.
ta: {{where}} இல் ஒரு பகுதியை வைப்பது சாலை நெட்வொர்க்கிலிருந்து மற்றொரு பகுதியை துண்டிக்கும்.

# validation.acity.MARKER
source: You may not build on the lot containing the suit icon until all other legally buildable lots on that tile are occupied.
ta: அந்த ஓடு மீது சட்டப்பூர்வமாக கட்டமைக்கக்கூடிய அனைத்து இடங்களும் ஆக்கிரமிக்கப்படும் வரை நீங்கள் சூட் ஐகானைக் கொண்ட இடத்தை உருவாக்கக்கூடாது.

# validation.acity.NO_MORE_CLAIMS
source: You have already claimed three towers. You may not claim any more.
ta: நீங்கள் ஏற்கனவே மூன்று கோபுரங்களை கோரியுள்ளீர்கள். நீங்கள் இனி உரிமை கோரக்கூடாது.

# validation.acity.PARTIAL_MOVE
source: Select the lot where you want to build.
ta: நீங்கள் உருவாக்க விரும்பும் இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.acity.VALID_W_CLAIMS
source: Looks like a valid move. You may also choose to claim a tower.
ta: சரியான நடவடிக்கை போல் தெரிகிறது. நீங்கள் ஒரு கோபுரத்தை கோரவும் தேர்வு செய்யலாம்.

# validation.agere.ADJACENCY
source: You can only capture adjacent stacks.
ta: நீங்கள் அருகிலுள்ள அடுக்குகளை மட்டுமே கைப்பற்ற முடியும்.

# validation.agere.EMPTY_MOVE
source: You may not move to an empty space.
ta: நீங்கள் வெற்று இடத்திற்கு செல்லக்கூடாது.

# validation.agere.FRIENDLY_CAPTURE
source: You may not cover your own stacks.
ta: உங்கள் சொந்த அடுக்குகளை நீங்கள் மறைக்கக்கூடாது.

# validation.agere.INITIAL_INSTRUCTIONS
source: Select an empty space to place a piece, or select a piece to move.
ta: ஒரு துண்டு வைக்க வெற்று இடத்தைத் தேர்ந்தெடுக்கவும் அல்லது நகர்த்த ஒரு துண்டைத் தேர்ந்தெடுக்கவும்.

# validation.agere.PARTIAL
source: Select where you want to move the piece.
ta: நீங்கள் எங்கு நகர்த்த விரும்புகிறீர்கள் என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.agere.SAME_HEIGHT
source: Pieces may only move between stacks of the same height.
ta: துண்டுகள் ஒரே உயரத்தின் அடுக்குகளுக்கு இடையில் மட்டுமே நகரக்கூடும்.

# validation.akron.CANNOT_MOVE
source: The selected ball at {{where}} cannot be moved.
ta: {{where}} இல் தேர்ந்தெடுக்கப்பட்ட பந்து நகர்த்த முடியாது.

# validation.akron.CANNOT_PLACE
source: {{where}} is not a valid place to put a ball.
ta: {{where}} ஒரு பந்தை வைக்க சரியான இடம் அல்ல.

# validation.akron.INITIAL_INSTRUCTIONS
source: Place a ball on the board, or move an existing ball to a playable connected point.
ta: பலகையில் ஒரு பந்தை வைக்கவும், அல்லது ஏற்கனவே இருக்கும் பந்தை விளையாடக்கூடிய இணைக்கப்பட்ட இடத்திற்கு நகர்த்தவும்.

# validation.akron.INVALID_TO
source: The selected ball at {{from}} cannot move to {{to}}
ta: {{from}} இலிருந்து தேர்ந்தெடுக்கப்பட்ட பந்து {{to}} வரை செல்ல முடியாது

# validation.akron.LEVEL1
source: You may only place on the bottom level.
ta: நீங்கள் கீழ் மட்டத்தில் மட்டுமே வைக்கலாம்.

# validation.akron.MOVE_TO
source: Select a destination to move your ball.
ta: உங்கள் பந்தை நகர்த்த ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.akron.NO_TOS
source: The selected ball at {{where}} has no possible destinations.
ta: {{where}} இல் தேர்ந்தெடுக்கப்பட்ட பந்து சாத்தியமான இடங்களைக் கொண்டிருக்கவில்லை.

# validation.almatafl.BAD_DISTANCE
source: Pieces must move a number of spaces equal to the height of its stack.
ta: துண்டுகள் அதன் அடுக்கின் உயரத்திற்கு சமமான பல இடைவெளிகளை நகர்த்த வேண்டும்.

# validation.almatafl.BOUNCE_INVADER
source: To continue bouncing, the king must land on an invader.
ta: தொடர்ந்து துள்ளுவதற்கு, மன்னன் ஒரு படையெடுப்பாளரின் மீது இறங்க வேண்டும்.

# validation.almatafl.BOUNCE_KING
source: Only the king can move multiple times.
ta: ராசாவால் மட்டுமே பல முறை நகர முடியும்.

# validation.almatafl.FRIENDLY_FIRE
source: The defenders may not stack on top of their king.
ta: பாதுகாவலர்கள் தங்கள் ராசாவின் மேல் அடுக்கி வைக்கக்கூடாது.

# validation.almatafl.INITIAL_INSTRUCTIONS
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.almatafl.KING_ONLY
source: Only the king can land on the throne or on exits.
ta: மன்னன் மட்டுமே சிம்மாசனத்திலோ அல்லது வெளியேறுவதிலோ இறங்க முடியும்.

# validation.almatafl.PARTIAL
source: Select the destination.
ta: இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.almatafl.PLUS_TOO_HIGH
source: Under the Plus rules, you may not move directly to a taller stack.
ta: பிளச் விதிகளின் கீழ், நீங்கள் நேரடியாக உயரமான அடுக்குக்கு செல்லக்கூடாது.

# validation.almatafl.TOO_HIGH
source: Pieces may not be stacked more than three high.
ta: துண்டுகள் மூன்று உயரத்திற்கு மேல் அடுக்கி வைக்கப்படாமல் இருக்கலாம்.

# validation.alta.INITIAL_INSTRUCTIONS
source: Select a space to place a switch.
ta: சுவிட்சை வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.alta.SELECT_SPACE
source: Select a space to place a '{{orient}}' switch.
ta: ஒரு '{{orient}}' சுவிட்சை வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.alta.INVALID_VERTEX
source: The vertex {{vertex}} does not exist on the board.
ta: வெர்டெக்ச் {{vertex}} போர்டில் இல்லை.

# validation.alta.NO_DOTS
source: The vertex {{vertex}} does not allow any placement of your switch.
ta: வெர்டெக்ச் {{vertex}} உங்கள் சுவிட்சின் எந்த இடத்தையும் அனுமதிக்காது.

# validation.alta.SELECT_TO
source: Select a vertex to lay a switch.
ta: சுவிட்சை வைக்க ஒரு வெர்டெக்சைத் தேர்ந்தெடுக்கவும்.

# validation.alta.USE_PLACE
source: To place a switch from vertices {{from}} to {{to}}, enter '{{place}}.
ta: {{from}} முதல் {{to}} வரை செங்குத்துகளிலிருந்து ஒரு சுவிட்சை வைக்க, '{{place}} ஐ உள்ளிடவும்.

# validation.alta.INVALID_TO
source: The vertex {{from}} cannot connect to {{to}}
ta: {{from}} இலிருந்து {{to}} உடன் இணைக்க முடியாது

# validation.alta.INVALID_SPACE
source: The space {{space}} does not exist on the board.
ta: விண்வெளி {{space}} போர்டில் இல்லை.

# validation.alta.OPPONENT_SPACE
source: You may not place a switch at {{where}} because it is your opponent's area.
ta: நீங்கள் {{where}} இல் ஒரு சுவிட்சை வைக்கக்கூடாது, ஏனெனில் இது உங்கள் எதிரியின் பகுதி.

# validation.alta.ALREADY_OCCUPIED
source: You already have a switch in the '{{orient}}' orientation at {{where}}
ta: {{where}} இல் '{{orient}}' நோக்குநிலையில் நீங்கள் ஏற்கனவே ஒரு சுவிட்ச் வைத்திருக்கிறீர்கள்

# validation.alta.NO_ORIENT_SUFFIX
source: When toggling a switch, you must suffix the move with a '+'. Try '{{move}}'.
ta: ஒரு சுவிட்சை மாற்றும்போது, நீங்கள் ஒரு '+' உடன் நகர்வைக் காட்ட வேண்டும். '{{move}}' ஐ முயற்சிக்கவும்.

# validation.alta.ORIENT_SUFFIX
source: You suffixed the move with a '+' but it was not a toggle move. Try '{{move}}'.
ta: நீங்கள் ஒரு '+' உடன் நகர்வைப் பின்னொதித்தீர்கள், ஆனால் அது ஒரு மாற்று நடவடிக்கை அல்ல. '{{move}}' ஐ முயற்சிக்கவும்.

# validation.amazons.INITIAL_INSTRUCTIONS
source: Select one of your amazons to move.
ta: நகர்த்த உங்கள் அமேசான்களில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.amazons.POTENTIAL_BLOCK
source: So far so good. Provide the space you want to block.
ta: இதுவரை மிகவும் நல்லது. நீங்கள் தடுக்க விரும்பும் இடத்தை வழங்கவும்.

# validation.amazons.POTENTIAL_MOVE
source: So far so good. Provide the space you want to move to.
ta: இதுவரை மிகவும் நல்லது. நீங்கள் செல்ல விரும்பும் இடத்தை வழங்கவும்.

# validation.amazons.STRAIGHTLINE
source: You can only move and block in straight lines.
ta: நீங்கள் நேர் கோடுகளில் மட்டுமே நகர்த்தவும் தடுக்கவும் முடியும்.

# validation.amoeba.BAD_DISTANCE
source: Stacks must move the exact distance of their height.
ta: அடுக்குகள் அவற்றின் உயரத்தின் சரியான தூரத்தை நகர்த்த வேண்டும்.

# validation.amoeba.INITIAL_INSTRUCTIONS
source: Click a stack you control to move or sow it.
ta: அதை நகர்த்த அல்லது விதைக்க நீங்கள் கட்டுப்படுத்தும் அடுக்கைக் சொடுக்கு செய்க.

# validation.amoeba.PARTIAL
source: To move the stack, click directly on the target cell. To sow the stack, click the cell adjacent to the stack in the direction you wish to travel.
ta: அடுக்கை நகர்த்த, இலக்கு கலத்தில் நேரடியாக சொடுக்கு செய்க. அடுக்கை விதைக்க, நீங்கள் பயணிக்க விரும்பும் திசையில் அடுக்குக்கு அருகிலுள்ள கலத்தைக் சொடுக்கு செய்க.

# validation.anache.BARRIER
source: You may not create a barrier.
ta: நீங்கள் ஒரு தடையை உருவாக்கக்கூடாது.

# validation.anache.CORNER_NO_MOVE
source: You may not select a dragon piece in the middle of a normal move.
ta: ஒரு சாதாரண நகர்வின் நடுவில் நீங்கள் ஒரு டிராகன் துண்டைத் தேர்ந்தெடுக்கக்கூடாது.

# validation.anache.DIR_MISSING
source: You are missing the direction in your earlier group move {{move}}.
ta: உங்கள் முந்தைய குழு நகர்வில் {{move}} இல் திசையை நீங்கள் காணவில்லை.

# validation.anache.DRAGON_MUST_INCLUDE
source: You must include the dragon at {{cell}} if you wish to continue making group moves.
ta: நீங்கள் தொடர்ந்து குழு நகர்வுகளைச் செய்ய விரும்பினால் டிராகனை {{cell}} இல் சேர்க்க வேண்டும்.

# validation.anache.DRAGON_NO_CONTINUE
source: The previous group move did not result in any captures so you may not continue making group moves in your dragon turn.
ta: முந்தைய குழு நகர்வு எந்தவொரு பிடிப்புகளையும் ஏற்படுத்தவில்லை, எனவே உங்கள் டிராகன் திருப்பத்தில் குழு நகர்வுகளை நீங்கள் தொடர்ந்து செய்யக்கூடாது.

# validation.anache.DRAGON_SELECT_DESTINATION
source: Select a destination to jump the dragon.
ta: டிராகனைத் தாண்ட ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.anache.DRAGON_SELECT_MORE
source: You may select the dragon and continue to make group moves because your previous move was a capture.
ta: நீங்கள் டிராகனைத் தேர்ந்தெடுத்து தொடர்ந்து குழு நகர்வுகளைச் செய்யலாம், ஏனெனில் உங்கள் முந்தைய நடவடிக்கை ஒரு பிடிப்பு.

# validation.anache.DRAGON_SELECT_MORE_FIRST
source: You may select the dragon and continue with a group move.
ta: நீங்கள் டிராகனைத் தேர்ந்தெடுத்து குழு நகர்வைத் தொடரலாம்.

# validation.anache.DRAGON_TOO_MANY
source: If you wish to make a group move, you must select only the dragon.
ta: நீங்கள் ஒரு குழு நகர்த்த விரும்பினால், நீங்கள் டிராகனை மட்டுமே தேர்ந்தெடுக்க வேண்டும்.

# validation.anache.DUPLICATE
source: Duplicated piece selection {{where}} in group move.
ta: குழு நகர்வில் நகல் துண்டு தேர்வு {{where}}.

# validation.anache.FIRST_MOVE_NO_DOUBLE
source: On the first turn, you may only move one group.
ta: முதல் திருப்பத்தில், நீங்கள் ஒரு குழுவை மட்டுமே நகர்த்தலாம்.

# validation.anache.IMMOBILISED
source: The piece at {{where}} is frozen.
ta: {{where}} இல் உள்ள துண்டு அசையாமல் உள்ளது.

# validation.anache.INCLUDE_UNMOVED
source: You must include at least one piece that has not moved yet.
ta: இன்னும் நகராத ஒரு பகுதியையாவது நீங்கள் சேர்க்க வேண்டும்.

# validation.anache.INITIAL_INSTRUCTIONS
source: Select your pieces to move.
ta: நகர்த்த உங்கள் துண்டுகளைத் தேர்ந்தெடுக்கவும்.

# validation.anache.INVALID_DIR
source: The direction {{dir}} is not a valid direction to move the group to.
ta: {{dir}} திசை குழுவை நகர்த்த சரியான திசையல்ல.
