Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.fanorona.INVALID_CAPTURE
source: The capture you signalled ({{type}}) is not valid.
ta: நீங்கள் சமிக்ஞை செய்த பிடிப்பு ({{type}}) செல்லுபடியாகாது.

# validation.fanorona.MUST_CAPTURE
source: Each step in a piece's movement must capture.
ta: ஒரு துண்டின் இயக்கத்தின் ஒவ்வொரு அடியும் பிடிக்க வேண்டும்.

# validation.fanorona.PAIKA_STOP
source: You may not move again after making a noncapturing move.
ta: ஒரு உறவற்ற நடவடிக்கையை மேற்கொண்ட பிறகு நீங்கள் மீண்டும் நகரக்கூடாது.

# validation.fanorona.PARTIAL
source: Select an empty adjacent space.
ta: வெற்று அருகிலுள்ள இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.fanorona.REVISIT
source: When making multiple moves, the piece may never revisit the same space.
ta: பல நகர்வுகளைச் செய்யும்போது, துண்டு ஒருபோதும் ஒரே இடத்தை மறுபரிசீலனை செய்யக்கூடாது.

# validation.fanorona.SAME_DIR
source: When making multiple moves, the piece may never move in the same direction twice in a row.
ta: பல நகர்வுகளைச் செய்யும்போது, துண்டு ஒருபோதும் ஒரே திசையில் ஒரு வரிசையில் இரண்டு முறை நகராது.

# validation.fendo.DUPLICATE_FENCE
source: A fence already exists between these two cells.
ta: இந்த இரண்டு கலங்களுக்கு இடையில் ஏற்கனவே ஒரு வேலி உள்ளது.

# validation.fendo.INITIAL_INSTRUCTIONS
source: Select a piece to move or an empty space to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு துண்டு அல்லது வெற்று இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.fendo.INVALID_DESTINATION
source: You cannot reach {{to}} from {{from}}. Remember that pieces can only make one ninety-degree turn as they move.
ta: } இருந்து இலிருந்து {{to}} ஐ அடைய முடியாது. துண்டுகள் ஒரு தொண்ணூறு டிகிரி திருப்பத்தை மட்டுமே நகர்த்த முடியும் என்பதை நினைவில் கொள்ளுங்கள்.

# validation.fendo.INVALID_DIRECTION
source: The direction {{dir}} is not valid. It must 'N', 'E', 'S', or 'W'.
ta: திசை {{dir}} செல்லுபடியாகாது. அது 'n', 'e', 's' அல்லது 'w' வேண்டும்.

# validation.fendo.INVALID_FENCE
source: Placing a fence here would either create an empty closed area or create multiple open areas.
ta: இங்கே ஒரு வேலியை வைப்பது வெற்று மூடிய பகுதியை உருவாக்கும் அல்லது பல திறந்த பகுதிகளை உருவாக்கும்.

# validation.fendo.INVALID_PASS
source: You may not pass if you have moves available.
ta: உங்களிடம் நகர்வுகள் இருந்தால் நீங்கள் கடந்து செல்லக்கூடாது.

# validation.fendo.NO_EDGE_FENCES
source: You may not place fences on the edge of the board.
ta: நீங்கள் பலகையின் விளிம்பில் வேலிகளை வைக்கக்கூடாது.

# validation.fendo.ONLY_MOVE_OPEN
source: You may only move pieces in open areas.
ta: நீங்கள் திறந்த பகுதிகளில் மட்டுமே துண்டுகளை நகர்த்தலாம்.

# validation.fendo.PARTIAL_FENCE
source: Provide the direction where you wish to place a fence. If clicking, click on the adjacent cell you want to block.
ta: நீங்கள் வேலியை வைக்க விரும்பும் திசையை வழங்கவும். சொடுக்கு செய்தால், நீங்கள் தடுக்க விரும்பும் அருகிலுள்ள கலத்தைக் சொடுக்கு செய்க.

# validation.fendo.PARTIAL_MOVE
source: Provide the destination.
ta: இலக்கை வழங்கவும்.

# validation.fendo.PLACE_IN_OPEN
source: You may only place pieces in the open area.
ta: நீங்கள் திறந்த பகுதியில் மட்டுமே துண்டுகளை வைக்கலாம்.

# validation.fendo.PLACE_IN_RANGE
source: You may only place pieces that are within one regular move of an existing piece.
ta: ஏற்கனவே இருக்கும் துண்டின் வழக்கமான நகர்வுக்குள் இருக்கும் துண்டுகளை மட்டுமே நீங்கள் வைக்கலாம்.

# validation.fightopia.BAD_CAPTURE_pawn
source: Pawns can only be captured by opposing tanks if they lie along the tank's long axis and there are no obstructions.
ta: தொட்டியின் நீண்ட அச்சில் படுத்துக் கொண்டால் மட்டுமே தொட்டிகளை எதிர்ப்பதன் மூலம் மட்டுமே சிப்பாய்கள் கைப்பற்ற முடியும், மேலும் தடைகள் எதுவும் இல்லை.

# validation.fightopia.BAD_CAPTURE_tank
source: Tanks can only be captured if they are in direct contact with the enemy giant.
ta: எதிரி நிறுவனத்துடன் நேரடி தொடர்பு கொண்டால் மட்டுமே தொட்டிகளை கைப்பற்ற முடியும்.

# validation.fightopia.FRIENDLY_FIRE
source: You may not capture your own pieces.
ta: உங்கள் சொந்த துண்டுகளை நீங்கள் கைப்பற்றக்கூடாது.

# validation.fightopia.INITIAL_INSTRUCTIONS
source: Select one of your own pieces to move, or select the opposing piece to capture. If moving/pivoting a tank, it matters which end you click on.
ta: நகர்த்த உங்கள் சொந்த துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும் அல்லது கைப்பற்ற எதிரெதிர் பகுதியைத் தேர்ந்தெடுக்கவும். ஒரு தொட்டியை நகர்த்தினால்/முன்னிலைப்படுத்தினால், நீங்கள் சொடுக்கு செய்வதற்கான முதன்மை.

# validation.fightopia.INVALID_PARTIAL
source: There are no valid moves based on the cell you clicked.
ta: நீங்கள் சொடுக்கு செய்த கலத்தின் அடிப்படையில் சரியான நகர்வுகள் எதுவும் இல்லை.

# validation.fightopia.INVULNERABLE
source: Giants may not be captured.
ta: ராட்சதர்கள் கைப்பற்றப்படாமல் இருக்கலாம்.

# validation.fightopia.PARTIAL
source: Select the destination.
ta: இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.flume.CENTRE_START
source: On the first turn of the game, you may not place on the centre space.
ta: விளையாட்டின் முதல் திருப்பத்தில், நீங்கள் மைய இடத்தில் வைக்கக்கூடாது.

# validation.flume.INITIAL_INSTRUCTIONS
source: Select an empty cell.
ta: வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.flume.INVALID_CONTINUATION
source: You may only continue placing if your last placement connected with three or more other pieces.
ta: உங்கள் கடைசி வேலைவாய்ப்பு மூன்று அல்லது அதற்கு மேற்பட்ட பிற துண்டுகளுடன் இணைக்கப்பட்டிருந்தால் மட்டுமே நீங்கள் தொடர்ந்து வைக்கலாம்.

# validation.flume.KEEP_GOING
source: If you make a connection with three or more pieces, you must continue placing pieces.
ta: நீங்கள் மூன்று அல்லது அதற்கு மேற்பட்ட துண்டுகளுடன் தொடர்பு கொண்டால், நீங்கள் தொடர்ந்து துண்டுகளை வைக்க வேண்டும்.

# validation.fnap.BAD_PASS
source: You may not pass your turn.
ta: உங்கள் திருப்பத்தை நீங்கள் கடந்து செல்லக்கூடாது.

# validation.fnap.BAD_SELECTED
source: That tile was not selected in the previous phase.
ta: முந்தைய கட்டத்தில் அந்த ஓடு தேர்ந்தெடுக்கப்படவில்லை.

# validation.fnap.BAD_TILE
source: You do not have that tile in your stash ({{tile}}).
ta: உங்கள் ச்டாசில் அந்த ஓடு இல்லை ({{tile}}).

# validation.fnap.DUPLICATE_CELL
source: You can't place two tiles in the same space.
ta: ஒரே இடத்தில் இரண்டு ஓடுகளை வைக்க முடியாது.

# validation.fnap.DUPLICATE_TILE
source: You can't place the same tile twice.
ta: நீங்கள் அதே ஓடு இரண்டு முறை வைக்க முடியாது.

# validation.fnap.INITIAL_INSTRUCTIONS_passing
source: You do not have to do anything. Your opponent is making their decision and your turn will be passed.
ta: நீங்கள் எதுவும் செய்ய வேண்டியதில்லை. உங்கள் எதிர்ப்பாளர் அவர்களின் முடிவை எடுக்கிறார், உங்கள் முறை நிறைவேற்றப்படும்.

# validation.fnap.INITIAL_INSTRUCTIONS_place
source: Click on one of the selected tiles then click on an empty space on the board.
ta: தேர்ந்தெடுக்கப்பட்ட ஓடுகளில் ஒன்றைக் சொடுக்கு செய்து, பலகையில் ஒரு வெற்று இடத்தைக் சொடுக்கு செய்க.

# validation.fnap.INITIAL_INSTRUCTIONS_playOrPass
source: Either place the selected tiles or type "pass" to let your opponent place the tiles.
ta: தேர்ந்தெடுக்கப்பட்ட ஓடுகளை வைக்கவும் அல்லது உங்கள் எதிரியை ஓடுகளை வைக்க அனுமதிக்க "பாச்" என தட்டச்சு செய்க.

# validation.fnap.INITIAL_INSTRUCTIONS_select
source: Select a tile from your stash to place.
ta: உங்கள் ச்டாசிலிருந்து ஒரு ஓடு என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.fnap.LABEL_SELECTED
source: Selected tiles
ta: தேர்ந்தெடுக்கப்பட்ட ஓடுகள்

# validation.fnap.LABEL_STASH
source: Player {{playerNum}}'s stash
ta: பிளேயர் {{playerNum}} இன் ச்டாச்

# validation.fnap.MUST_PASS
source: The only move available to you is to pass.
ta: உங்களுக்கு கிடைக்கும் ஒரே நடவடிக்கை கடந்து செல்வதுதான்.

# validation.fnap.VALID_PARTIAL_cell
source: Select an empty space to place the tile.
ta: ஓடு வைக்க வெற்று இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.fnap.VALID_PARTIAL_tile
source: Select one of the two tiles to place.
ta: இடத்திற்கு இரண்டு ஓடுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.focus.CAN_PLACE
source: If you're moving, provide the destination. If you wish to place a piece you have in hand, click the cell again.
ta: நீங்கள் நகர்கிறீர்கள் என்றால், இலக்கை வழங்கவும். உங்களிடம் உள்ள ஒரு பகுதியை கையில் வைக்க விரும்பினால், மீண்டும் கலத்தைக் சொடுக்கு செய்க.

# validation.focus.INITIAL_INSTRUCTIONS
source: Click a stack you control.
ta: நீங்கள் கட்டுப்படுத்தும் அடுக்கைக் சொடுக்கு செய்க.

# validation.focus.NONE_INHAND
source: You have no pieces in hand to place.
ta: உங்களிடம் வைக்க எந்த துண்டுகளும் இல்லை.

# validation.focus.ORTHOGONAL
source: Stacks may only move orthogonally, never diagonally.
ta: அடுக்குகள் ஆர்த்தோகனலாக மட்டுமே நகர்த்தக்கூடும், ஒருபோதும் குறுக்காக.

# validation.focus.TOOFAR
source: You may not move the stack more spaces than the number of pieces in the stack.
ta: அடுக்கில் உள்ள துண்டுகளின் எண்ணிக்கையை விட நீங்கள் அடுக்கை அதிக இடங்களை நகர்த்தக்கூடாது.

# validation.focus.UNCONTROLLED
source: You can only move stacks where your piece is on top.
ta: உங்கள் துண்டு மேலே இருக்கும் இடத்தில் மட்டுமே நீங்கள் அடுக்குகளை நகர்த்த முடியும்.

# validation.four.DIFFERENT_MOVE
source: You may not play the same size or colour piece as your opponent did on their last turn.
ta: உங்கள் எதிரி அவர்களின் கடைசி திருப்பத்தில் செய்ததைப் போலவே நீங்கள் அதே அளவு அல்லது வண்ணத் துண்டுகளை இயக்கக்கூடாது.

# validation.four.INITIAL_INSTRUCTIONS
source: Select a piece from your stash to load and manipulate it.
ta: அதை ஏற்றவும் கையாளவும் உங்கள் ச்டாசிலிருந்து ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.four.LABEL_SELECTED
source: Selected piece
ta: தேர்ந்தெடுக்கப்பட்ட துண்டு

# validation.four.LABEL_STASH
source: Player {{playerNum}}'s stash
ta: பிளேயர் {{playerNum}} s ச்டாச்

# validation.four.MUST_CONNECT
source: Each piece placed after the first must orthogonally connect to at least one other piece.
ta: முதல் பிறகு வைக்கப்படும் ஒவ்வொரு பகுதியும் ஆர்த்தோகனலி முறையில் குறைந்தது ஒரு துண்டுடன் இணைக்க வேண்டும்.

# validation.four.NO_OVERLAP
source: Placing a {{piece}} at {{coord}} would overlap an existing piece.
ta: ஒரு {{piece}} {{coord} at இல் வைப்பது ஏற்கனவே இருக்கும் ஒரு பகுதியை ஒன்றுடன் ஒன்று சேர்க்கிறது.

# validation.four.NO_PIECE
source: Could not find the piece {{piece}} in your stash.
ta: உங்கள் ச்டாசில் {{piece} the துண்டு கண்டுபிடிக்க முடியவில்லை.

# validation.four.NOT_ADJACENT
source: The placed piece may not be adjacent to a piece of the same size or colour.
ta: வைக்கப்பட்ட துண்டு அதே அளவு அல்லது வண்ணத்தின் ஒரு பகுதிக்கு அருகில் இருக்காது.

# validation.four.PARTIAL
source: Click the cell on the board representing the top-left corner of the piece you wish to place.
ta: நீங்கள் வைக்க விரும்பும் துண்டின் மேல்-இடது மூலையைக் குறிக்கும் பலகையில் உள்ள கலத்தைக் சொடுக்கு செய்க.

# validation.four.TOO_BIG
source: The grid may never be larger than 9 cells wide or high (or 7 cells in the simplified game).
ta: கட்டம் ஒருபோதும் 9 செல்கள் அகலம் அல்லது அதிகமாக (அல்லது எளிமைப்படுத்தப்பட்ட விளையாட்டில் 7 செல்கள்) பெரியதாக இருக்காது.

# validation.fourinarow.EXCESS
source: You have placed too many pieces. You may only place 1 piece.
ta: நீங்கள் பல துண்டுகளை வைத்துள்ளீர்கள். நீங்கள் 1 துண்டு மட்டுமே வைக்கலாம்.

# validation.fourinarow.INITIAL_INSTRUCTIONS
source: Select a supported space to place a piece.
ta: ஒரு துண்டு வைக்க ஆதரிக்கப்பட்ட இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.fourinarow.INITIAL_INSTRUCTIONS_SWAP5
source: Select an space to place a piece, or pass to swap colours.
ta: ஒரு துண்டு வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும் அல்லது வண்ணங்களை மாற்றவும்.

# validation.fourinarow.INITIAL_INSTRUCTIONS_SWAP21
source: Place three pieces on the board.
ta: பலகையில் மூன்று துண்டுகளை வைக்கவும்.

# validation.fourinarow.INITIAL_INSTRUCTIONS_SWAP22
source: You may do one of (1) place a single piece to continue as player 2, (2) pass to swap colours to play as player 1, or (3) place two more pieces and allow the opponent to decide to play as player 1 or player 2.
ta: நீங்கள் (1) பிளேயர் 2 ஆக தொடர ஒரு பகுதியை வைக்கலாம், (2) பிளேயர் 1 ஆக விளையாட வண்ணங்களை மாற்றுவதற்கு பாச், அல்லது (3) மேலும் இரண்டு துண்டுகளை வைத்து, எதிரியை பிளேயர் 1 ஆக விளையாட முடிவு செய்ய அனுமதிக்கவும் அல்லது பிளேயர் 2.

# validation.fourinarow.INITIAL_INSTRUCTIONS_SWAP23
source: You may place a piece to continue as player 1, or pass to swap colours to play as player 2.
ta: பிளேயர் 1 ஆக தொடர நீங்கள் ஒரு பகுதியை வைக்கலாம் அல்லது பிளேயர் 2 ஆக விளையாட வண்ணங்களை மாற்றுவதற்கு அனுப்பலாம்.

# validation.fourinarow.NOT_PLACEABLE
source: You may not place at {{where}}. The piece has to be supported.
ta: நீங்கள் {{where}} இல் வைக்கக்கூடாது. துண்டு ஆதரிக்கப்பட வேண்டும்.

# validation.fourinarow.SWAP21_EXCESS
source: You have placed too many pieces. You may only place 3 pieces.
ta: நீங்கள் பல துண்டுகளை வைத்துள்ளீர்கள். நீங்கள் 3 துண்டுகளை மட்டுமே வைக்கலாம்.

# validation.fourinarow.SWAP21
source: Place 1 more piece on the board.
ta: இன்னும் 1 துண்டுகளை பலகையில் வைக்கவும்.

# validation.fourinarow.SWAP22_EXCESS
source: You have placed too many pieces. You may only place 2 piece.
ta: நீங்கள் பல துண்டுகளை வைத்துள்ளீர்கள். நீங்கள் 2 துண்டு மட்டுமே வைக்கலாம்.

# validation.fourinarow.SWAP22_PARTIAL
source: Complete the move to continue as player 2, or place another piece on the board to allow the opponent to decide to play as player 1 or player 2.
ta: பிளேயர் 2 ஆக தொடர நகர்வதை முடிக்கவும், அல்லது பிளேயர் 1 அல்லது பிளேயர் 2 ஆக விளையாடுவதை எதிராளியை அனுமதிக்க மற்றொரு பகுதியை போர்டில் வைக்கவும்.

# validation.frames.INITIAL_INSTRUCTIONS
source: Click an empty cell to add a piece to the board.
ta: பலகையில் ஒரு பகுதியைச் சேர்க்க வெற்று கலத்தைக் சொடுக்கு செய்க.

# validation.furl.CAPTURE4UNFURL
source: You signalled a capture unfurl move, but {{to}} not is occupied by the opponent. Use ">" to denote non-capture unfurl.
ta: நீங்கள் ஒரு பிடிப்பு இல்லாத நகர்வைக் குறிக்கிறது, ஆனால் {{to}} எதிராளியால் ஆக்கிரமிக்கப்படவில்லை. பிடிப்பு அல்லாத அவிழ்க்க ">" ஐப் பயன்படுத்தவும்.

# validation.furl.FURL4UNFURL
source: You signalled a furl move with "<", but the selected stack has a height of {{size}}, which is greater than 1.
ta: நீங்கள் "<" உடன் ஒரு ஃபர்ல் நகர்வைக் குறிக்கிறது, ஆனால் தேர்ந்தெடுக்கப்பட்ட அடுக்கு {{size} of உயரத்தைக் கொண்டுள்ளது, இது 1 ஐ விட அதிகமாக உள்ளது.

# validation.furl.INITIAL_INSTRUCTIONS
source: Select a piece to furl or a stack to unfurl.
ta: ஃபர்லிற்கு ஒரு துண்டு அல்லது அவிழ்க்க ஒரு அடுக்கைத் தேர்ந்தெடுக்கவும்.

# validation.furl.INVALID_FURL
source: It is not possible to furl from {{from}} to {{to}}. You may only furl towards a cell where you have two or more of your 1-piece stacks in an unbroken line.
ta: {{from}} முதல் {{to}} வரை {{வர முடியாது. உடைக்கப்படாத வரிசையில் உங்கள் 1-துண்டு அடுக்குகளில் இரண்டு அல்லது அதற்கு மேற்பட்டவற்றை வைத்திருக்கும் ஒரு கலத்தை மட்டுமே நீங்கள் செலுத்தலாம்.

# validation.furl.INVALID_UNFURL
source: It is not possible to unfurl from {{from}} to {{to}}. You may only unfurl towards an empty cell or an opponent's stack exactly {{size}} spaces away. Intermediate cells must be empty.
ta: }}} முதல் {{from}} வரை {{இலிருந்து வெளிவர முடியாது. நீங்கள் ஒரு வெற்று கலத்தை அல்லது எதிராளியின் அடுக்கை நோக்கி மட்டுமே அவிழ்க்க முடியும் {{to}} இடைவெளிகள். இடைநிலை செல்கள் காலியாக இருக்க வேண்டும்.

# validation.furl.NO_FURLS
source: There are no furl moves possible from piece at {{from}}.
ta: } இருந்து இலிருந்து துண்டிலிருந்து எந்த ஃபர்ல் நகர்வுகளும் சாத்தியமில்லை.

# validation.furl.NO_UNFURLS
source: There are no unfurl moves possible from stack at {{from}}.
ta: } இருந்து இலிருந்து {{at ச்டேக்கிலிருந்து எந்தவிதமான நகர்வுகளும் சாத்தியமில்லை.

# validation.furl.PARTIAL_FURL
source: Select destination to furl.
ta: இலக்கு ஃபர்ல் என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.furl.PARTIAL_UNFURL
source: Select destination to unfurl.
ta: அவிழ்க்க இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.furl.UNFURL4CAPTURE
source: You signalled a non-capture unfurl move, but a capture can be made at {{to}}. Use "x" to denote capture.
ta: நீங்கள் பிடிப்பு அல்லாத அவிழ்க்கும் நகர்வைக் குறிக்கிறது, ஆனால் ஒரு பிடிப்பு {{to}} இல் செய்யப்படலாம். பிடிப்பைக் குறிக்க "ஃச்" ஐப் பயன்படுத்தவும்.

# validation.furl.UNFURL4FURL
source: You signalled an unfurl move with ">", but the selected stack only has a height of 1.
ta: ">" உடன் ஒரு தெளிவற்ற நகர்வை நீங்கள் அடையாளம் காட்டினீர்கள், ஆனால் தேர்ந்தெடுக்கப்பட்ட அடுக்கு 1 உயரத்தை மட்டுமே கொண்டுள்ளது.

# validation.garden.BAD_PLACE_normal
source: You must plant seeds orthogonally adjacent to existing plants.
ta: ஏற்கனவே இருக்கும் தாவரங்களை ஒட்டிய விதைகளை ஆர்த்தோகனலி முறையில் நட வேண்டும்.

# validation.garden.BAD_PLACE_start
source: In the first four turns of the game, you may NOT plant a seed orthogonally adjacent to an existing plant.
ta: விளையாட்டின் முதல் நான்கு திருப்பங்களில், நீங்கள் ஏற்கனவே இருக்கும் ஆலைக்கு அருகில் ஒரு விதை ஆர்த்தோகனலி நடவு செய்யக்கூடாது.

# validation.garden.INITIAL_INSTRUCTIONS_normal
source: Select which seed you wish to plant.
ta: நீங்கள் நடவு செய்ய விரும்பும் விதை என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.garden.INITIAL_INSTRUCTIONS_start
source: Select which seed you wish to plant.
ta: நீங்கள் நடவு செய்ய விரும்பும் விதை என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.garden.INVALID_COLOUR
source: The only valid colours are 'w' and 'b'. You gave '{{colour}}'.
ta: செல்லுபடியாகும் வண்ணங்கள் 'W' மற்றும் 'B'. நீங்கள் '{{colour}}' கொடுத்தீர்கள்.

# validation.garden.SELECT_CELL_normal
source: Select a plot orthogonally adjacent to an existing plant (in the bottom-right-hand board).
ta: ஏற்கனவே உள்ள ஆலைக்கு அருகில் ஒரு சதித்திட்டத்தைத் தேர்ந்தெடுக்கவும் (கீழ்-வலது-கை பலகையில்).

# validation.garden.SELECT_CELL_start
source: Select a plot NOT orthogonally adjacent to an existing plant (in the bottom-right-hand board).
ta: ஏற்கனவே உள்ள ஆலைக்கு அருகில் (கீழ்-வலது-கை பலகையில்) ஆர்த்தோகனலி அல்ல ஒரு சதித்திட்டத்தைத் தேர்ந்தெடுக்கவும்.

# validation.garden.SELECT_COLOUR
source: Select the seed you wish to plant.
ta: நீங்கள் நடவு செய்ய விரும்பும் விதைகளைத் தேர்ந்தெடுக்கவும்.

# validation.garden.WRONG_BOARD
source: You may only select plots in the bottom-right board. The other three are showing what happened during the previous turn.
ta: நீங்கள் கீழ்-வலது பலகையில் மட்டுமே அடுக்குகளைத் தேர்ந்தெடுக்கலாம். முந்தைய திருப்பத்தின் போது என்ன நடந்தது என்பதைக் காட்டுகிறது.

# validation.gess.CAPTURE4MOVE
source: You signalled a capture, but the destination centred at {{to}} will not result in captures. Use "-" to denote non-capture movement.
ta: நீங்கள் ஒரு பிடிப்பை சமிக்ஞை செய்தீர்கள், ஆனால் {{to}} ஐ மையமாகக் கொண்ட இலக்கு கைப்பற்றப்படாது. பிடிப்பு அல்லாத இயக்கத்தைக் குறிக்க "-" ஐப் பயன்படுத்தவும்.

# validation.gess.FROM_CENTRE_ONLY
source: The selected 3x3 piece centred at {{cell}} contains only a centre stone, so it cannot move.
ta: தேர்ந்தெடுக்கப்பட்ட 3x3 துண்டு {{cell} the}} a ஒரு மையக் கல் மட்டுமே உள்ளது, எனவே அதை நகர்த்த முடியாது.

# validation.gess.FROM_EMPTY
source: The selected 3x3 piece centred at {{cell}} contains no stones.
ta: தேர்ந்தெடுக்கப்பட்ட 3x3 துண்டு {{cell} the}} இல் கற்கள் இல்லை.

# validation.gess.FROM_ENEMY
source: The selected 3x3 piece centred at {{cell}} contains enemy stones.
ta: தேர்ந்தெடுக்கப்பட்ட 3x3 துண்டு {{cell}}}} எதிரி கற்களைக் கொண்டுள்ளது.

# validation.gess.INITIAL_INSTRUCTIONS
source: Select the centre of a 3x3 piece to move.
ta: நகர்த்த 3x3 துண்டின் மையத்தைத் தேர்ந்தெடுக்கவும்.

# validation.gess.INVALID_MOVE
source: The selected 3x3 piece centred at {{from}} cannot move to {{to}}.
ta: } For} க்கு ஐ மையமாகக் கொண்ட தேர்ந்தெடுக்கப்பட்ட 3x3 துண்டு {{from}} வரை செல்ல முடியாது.

# validation.gess.MOVE4CAPTURE
source: You signalled a move, but the destination centred at {{to}} will result in captures. Use "x" to denote capture.
ta: நீங்கள் ஒரு நகர்வை அடையாளம் காட்டினீர்கள், ஆனால் {{to} the ஐ மையமாகக் கொண்ட இலக்கு கைப்பற்றப்படும். பிடிப்பைக் குறிக்க "ஃச்" ஐப் பயன்படுத்தவும்.

# validation.gess.POTENTIAL_MOVE
source: So far so good. Provide the space you want to move the 3x3 piece to.
ta: இதுவரை மிகவும் நல்லது. நீங்கள் 3x3 துண்டுகளை நகர்த்த விரும்பும் இடத்தை வழங்கவும்.

# validation.gess.TOO_MANY_MOVES
source: You have already selected a piece to move.
ta: நகர்த்துவதற்கு நீங்கள் ஏற்கனவே ஒரு பகுதியைத் தேர்ந்தெடுத்துள்ளீர்கள்.

# validation.gliss.BAD_BASE
source: You may not place a base at {{where}}. Bases may not be orthogonally adjacent to any friendly pieces.
ta: நீங்கள் {{where}} இல் ஒரு தளத்தை வைக்கக்கூடாது. எந்தவொரு நட்பு துண்டுகளுக்கும் தளங்கள் ஆர்த்தோகனலி அருகில் இருக்கக்கூடாது.

# validation.gliss.INITIAL_INSTRUCTIONS
source: Select an empty cell to place a base (the clicked cell will the top-left corner of the base), or select the core of a glider to move.
ta: ஒரு தளத்தை வைக்க ஒரு வெற்று கலத்தைத் தேர்ந்தெடுக்கவும் (கிளிக் செய்யப்பட்ட செல் அடித்தளத்தின் மேல்-இடது மூலையில் இருக்கும்), அல்லது நகர்த்த ஒரு கிளைடரின் மையத்தைத் தேர்ந்தெடுக்கவும்.

# validation.gliss.NO_GLIDER
source: Could not find a glider core that you control at {{where}}.
ta: {{where}} இல் நீங்கள் கட்டுப்படுத்தும் ஒரு கிளைடர் மையத்தைக் கண்டுபிடிக்க முடியவில்லை.

# validation.gliss.NO_MOVES
source: The glider at {{where}} has no legal moves.
ta: {{}} இல் உள்ள கிளைடர் சட்டப்பூர்வ நகர்வுகள் இல்லை.

# validation.gliss.PARTIAL
source: Select one of the highlighted cells to move the glider. If a bar has appeared at the edge of the board, you can click it to move the glider off the board.
ta: கிளைடரை நகர்த்துவதற்கு சிறப்பம்சமாக கலங்களில் ஒன்றைத் தேர்ந்தெடுக்கவும். பலகையின் விளிம்பில் ஒரு பட்டி தோன்றியிருந்தால், நீங்கள் அதை சொடுக்கு செய்யலாம்.

# validation.gonnect.INITIAL_INSTRUCTIONS
source: Select an intersection to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும்.

# validation.gonnect.KO
source: Ko rule: you may not immediately recapture your opponent's single stone if they just used it to capture one of yours.
ta: கோ விதி: உங்களுடைய ஒன்றைப் பிடிக்க அவர்கள் அதைப் பயன்படுத்தினால், உங்கள் எதிரியின் ஒற்றை கல்லை நீங்கள் உடனடியாக மீண்டும் கைப்பற்ற முடியாது.

# validation.gonnect.SELF_CAPTURE
source: You may not place your stones in self-capture.
ta: உங்கள் கற்களை தன்வய பிடியில் வைக்கக்கூடாது.

# validation.gorogo.INITIAL_INSTRUCTIONS_play
source: Select a cell to place a normal piece, or click on one of your henge pieces to place that instead.
ta: ஒரு சாதாரண துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும், அல்லது அதற்கு பதிலாக வைக்க உங்கள் எங்கே துண்டுகளில் ஒன்றைக் சொடுக்கு செய்க.

# validation.gorogo.INITIAL_INSTRUCTIONS_setup
source: Select a cell to place a henge piece.
ta: ஒரு எங்கே துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.gorogo.INVALID_MOVE
source: The move {{move}} is not valid. Remember that you may not place a normal piece in a position with no liberties unless it triggers a capture that creates a liberty.
ta: {{move}} நகர்வு செல்லுபடியாகாது. ஒரு சுதந்திரத்தை உருவாக்கும் ஒரு பிடிப்பைத் தூண்டாவிட்டால், நீங்கள் ஒரு சாதாரண பகுதியை விடுதலை இல்லாத நிலையில் வைக்கக்கூடாது என்பதை நினைவில் கொள்ளுங்கள்.

# validation.gorogo.NO_PIECES_neutral
source: You have no henge pieces in hand.
ta: உங்களிடம் கையில் எந்தவிதமான துண்டுகளும் இல்லை.

# validation.gorogo.NO_PIECES_normal
source: You don't have any normal pieces left.
ta: உங்களிடம் சாதாரண துண்டுகள் எதுவும் இல்லை.

# validation.gorogo.PARTIAL
source: Select the cell where you wish to place the henge piece.
ta: நீங்கள் எங்கே துண்டு வைக்க விரும்பும் கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.gyges.BAD_DISPLACE
source: You may not displace a piece to {{cell}}. The target cell must be unoccupied and may not be beyond the opponent's playable row.
ta: நீங்கள் ஒரு பகுதியை {{cell} பெறுநர் க்கு இடம்பெயரக்கூடாது. இலக்கு செல் பயன்படுத்தப்படாமல் இருக்க வேண்டும் மற்றும் எதிராளியின் விளையாடக்கூடிய வரிசைக்கு அப்பாற்பட்டதாக இருக்கக்கூடாது.

# validation.gyges.HOMEROW
source: You may only place pieces on the row closest to you.
ta: உங்களுக்கு மிக நெருக்கமான வரிசையில் மட்டுமே துண்டுகளை வைக்கலாம்.

# validation.gyges.INITIAL_INSTRUCTIONS_setup
source: Select a piece from your stash to place on the board.
ta: பலகையில் வைக்க உங்கள் ச்டாசிலிருந்து ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.
