Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.anache.INVALID_DRAGON_TO
source: The destination space {{to}} is invalid.
ta: இலக்கு இடம் {{to}} தவறானது.

# validation.anache.NORMALISE
source: The move needs to be normalised. Try {{normalised}}.
ta: நகர்வை இயல்பாக்க வேண்டும். {{normalised}} ஐ முயற்சிக்கவும்.

# validation.anache.NOT_CONNECTED
source: The selected group is not connected.
ta: தேர்ந்தெடுக்கப்பட்ட குழு இணைக்கப்படவில்லை.

# validation.anache.NOT_DRAGON_JUMPABLE
source: The dragon may not jump to the opposing quadrant in the opponent's base.
ta: டிராகன் எதிராளியின் தளத்தில் எதிரெதிர் நால்வருக்கு செல்லக்கூடாது.

# validation.anache.NOT_DRAGON_JUMPABLE_CORNER
source: The dragon cannot jump to a corner.
ta: டிராகன் ஒரு மூலையில் செல்ல முடியாது.

# validation.anache.SELECT_DIR
source: Select a direction to move the group.
ta: குழுவை நகர்த்த ஒரு திசையைத் தேர்ந்தெடுக்கவும்.

# validation.anache.SELECT_MORE_BARRIER
source: You must continue to make group moves because you have created a barrier.
ta: நீங்கள் ஒரு தடையை உருவாக்கியதால் குழு நகர்வுகளைத் தொடர்ந்து செய்ய வேண்டும்.

# validation.anache.SELECT_MORE
source: You may continue to make one more group move.
ta: நீங்கள் தொடர்ந்து ஒரு குழு நகர்வை மேற்கொள்ளலாம்.

# validation.anache.SELECT_MORE_PIECES
source: You may select one more piece to move as a group, or select a direction to move the group.
ta: நீங்கள் ஒரு குழுவாக நகர்த்த இன்னும் ஒரு பகுதியைத் தேர்ந்தெடுக்கலாம் அல்லது குழுவை நகர்த்த ஒரு திசையைத் தேர்ந்தெடுக்கலாம்.

# validation.anache.SELECT_MORE_SUPERKO
source: You must continue to make group moves because the current board state is invalid due to superko.
ta: சூப்பர் கோல் காரணமாக தற்போதைய வாரிய நிலை தவறானது என்பதால் நீங்கள் தொடர்ந்து குழு நகர்வுகளைச் செய்ய வேண்டும்.

# validation.anache.SUPERKO
source: Superko: you may not repeat a previous board state.
ta: சூப்பர் கோப்: நீங்கள் முந்தைய வாரிய நிலையை மீண்டும் செய்யக்கூடாது.

# validation.anache.TOO_MANY
source: You may only select up to {{count}} pieces to move as a group.
ta: நீங்கள் ஒரு குழுவாக நகர்த்த {{count}} துண்டுகள் வரை மட்டுமே தேர்ந்தெடுக்கலாம்.

# validation.anache.TOO_MANY_MOVES
source: You may only move two groups in a normal turn.
ta: நீங்கள் இரண்டு குழுக்களை ஒரு சாதாரண திருப்பத்தில் மட்டுமே நகர்த்தலாம்.

# validation.archimedes.FLEET_FULL
source: You may not have more than 12 pieces.
ta: உங்களிடம் 12 க்கும் மேற்பட்ட துண்டுகள் இல்லை.

# validation.archimedes.INITIAL_INSTRUCTIONS
source: Select a piece to move, or click on your home port to rebuild a destroyed ship.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும் அல்லது அழிக்கப்பட்ட கப்பலை மீண்டும் உருவாக்க உங்கள் வீட்டு துறைமுகத்தில் சொடுக்கு செய்யவும்.

# validation.archimedes.MUST_MOVE
source: Ships must move at least one space.
ta: கப்பல்கள் குறைந்தது ஒரு இடத்தை நகர்த்த வேண்டும்.

# validation.archimedes.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.archimedes.SELF_OCCUPATION
source: You may not leave your own pieces on your home port.
ta: உங்கள் சொந்த துறைமுகத்தை உங்கள் சொந்த துறைமுகத்தில் விடக்கூடாது.

# validation.armadas.BAD_PASS
source: When passing, that must be the only command you provide.
ta: கடந்து செல்லும்போது, நீங்கள் வழங்கும் ஒரே கட்டளையாக இருக்க வேண்டும்.

# validation.armadas.CHOOSE_TARGET
source: Select the ship you wish to attack.
ta: நீங்கள் தாக்க விரும்பும் கப்பலைத் தேர்ந்தெடுக்கவும்.

# validation.armadas.CMD_PARAMETERS_TOOFEW
source: Not enough parameters were passed to a {{type}} command.
ta: போதுமான அளவுருக்கள் ஒரு {{type}} கட்டளைக்கு அனுப்பப்படவில்லை.

# validation.armadas.COLLISION
source: Pieces may not collide with each other.
ta: துண்டுகள் ஒருவருக்கொருவர் மோதாது.

# validation.armadas.DOUBLE_MOVE
source: You may not issue more than one move order per ship per turn.
ta: ஒரு திருப்பத்திற்கு ஒரு கப்பலுக்கு ஒன்றுக்கு மேற்பட்ட நகரும் ஆர்டரை நீங்கள் வழங்கக்கூடாது.

# validation.armadas.DUPLICATE_NAME
source: That name is already being used.
ta: அந்த பெயர் ஏற்கனவே பயன்படுத்தப்படுகிறது.

# validation.armadas.INITIAL_INSTRUCTIONS_place
source: Select a piece from the sidebar to place it on the field. You can also type "pass" if you've already placed all the pieces you can or wish to this turn. You must place at least one ship if you can.
ta: களத்தில் வைக்க பக்கப்பட்டியில் இருந்து ஒரு பகுதியைத் தேர்ந்தெடுக்கவும். நீங்கள் ஏற்கனவே உங்களால் முடிந்த அனைத்து பகுதிகளையும் வைத்திருந்தால் அல்லது இந்த திருப்பத்திற்கு விரும்பினால் "பாச்" தட்டச்சு செய்யலாம். உங்களால் முடிந்தால் குறைந்தது ஒரு கப்பலை வைக்க வேண்டும்.

# validation.armadas.INITIAL_INSTRUCTIONS_placefree
source: Select a piece from the sidebar to place it on the field. Pass if you do not wish to place any more ships. Once both players pass, the play phase will begin.
ta: களத்தில் வைக்க பக்கப்பட்டியில் இருந்து ஒரு பகுதியைத் தேர்ந்தெடுக்கவும். நீங்கள் மேலும் கப்பல்களை வைக்க விரும்பவில்லை என்றால் கடந்து செல்லுங்கள். இரு வீரர்களும் கடந்து சென்றதும், விளையாட்டு கட்டம் தொடங்கும்.

# validation.armadas.INITIAL_INSTRUCTIONS_play
source: Select the piece you wish to move or attack with.
ta: நீங்கள் நகர்த்த விரும்பும் அல்லது தாக்க விரும்பும் பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.armadas.INVALID_NAME
source: The name must be between 1 and 25 characters long; must not contain any whitespace; must only consist of letters, numbers, hyphens, and underscores; and may not start with a hyphen or underscore.
ta: பெயர் 1 முதல் 25 எழுத்துக்கள் வரை இருக்க வேண்டும்; எந்த இடைவெளியையும் கொண்டிருக்கக்கூடாது; கடிதங்கள், எண்கள், ஐபன்கள் மற்றும் அடிக்கோடிட்டுக் காட்டப்பட வேண்டும்; மற்றும் ஒரு ஐபன் அல்லது அடிக்கோடிட்டுக் கொண்டு தொடங்கக்கூடாது.

# validation.armadas.INVALID_SIZE
source: Invalid ship size. Must be 1, 2, or 3.
ta: தவறான கப்பல் அளவு. 1, 2, அல்லது 3 ஆக இருக்க வேண்டும்.

# validation.armadas.JUST_SHIP_NAME
source: Select a point on the field to move or select an enemy ship to attack.
ta: நகர்த்துவதற்கு களத்தில் ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும் அல்லது தாக்குவதற்கு எதிரி கப்பலைத் தேர்ந்தெடுக்கவும்.

# validation.armadas.MOVE_UNRECOGNIZED
source: One of the commands you provided was not understood: {{cmd}}.
ta: நீங்கள் வழங்கிய கட்டளைகளில் ஒன்று புரிந்து கொள்ளப்படவில்லை: {{cmd}}.

# validation.armadas.NO_LOS
source: No line of sight. At least one corner of your ship must be able to see at least one corner of the other ship.
ta: பார்வை வரி இல்லை. உங்கள் கப்பலின் குறைந்தது ஒரு மூலையாவது மற்ற கப்பலின் குறைந்தது ஒரு மூலையையாவது பார்க்க முடியும்.

# validation.armadas.NO_SHIP
source: Could not find a ship with the name {{name}}.
ta: {{name}} என்ற பெயருடன் ஒரு கப்பலைக் கண்டுபிடிக்க முடியவில்லை.

# validation.armadas.OUT_OF_BOUNDS
source: One of your movements would take the ship out of bounds.
ta: உங்கள் இயக்கங்களில் ஒன்று கப்பலை எல்லைக்கு வெளியே எடுக்கும்.

# validation.armadas.OUT_OF_RANGE
source: The ship {{mine}} cannot reach {{theirs}} from this distance.
ta: {{mine}} கப்பல் இந்த தூரத்திலிருந்து {{theirs}} ஐ அடைய முடியாது.

# validation.armadas.PASS_IN_PLACE
source: In a game with standard fleets, you may not pass while you still have ships to place.
ta: நிலையான கடற்படைகளைக் கொண்ட ஒரு விளையாட்டில், நீங்கள் இன்னும் இடங்களுக்கு கப்பல்கள் இருக்கும்போது நீங்கள் கடந்து செல்லக்கூடாது.

# validation.armadas.place.OUT_OF_BOUNDS
source: This would place your ship outside of your designated starting area.
ta: இது உங்கள் கப்பலை உங்கள் நியமிக்கப்பட்ட தொடக்க பகுதிக்கு வெளியே வைக்கும்.

# validation.armadas.place.PARTIAL_FOUR_ARGS
source: Give the ship a name. It must be unique across *all* existing ships.
ta: கப்பலுக்கு ஒரு பெயரைக் கொடுங்கள். இது * தற்போதுள்ள அனைத்து * கப்பல்களிலும் தனித்துவமாக இருக்க வேண்டும்.

# validation.armadas.place.PARTIAL_NOARGS
source: Select the size of ship to place.
ta: இடத்திற்கு கப்பலின் அளவைத் தேர்ந்தெடுக்கவும்.

# validation.armadas.place.PARTIAL_ONETWO_ARGS
source: Click the field to select the x,y coordinates, or manually enter both coordinates, separated by a space.
ta: ஃச், ஒய் ஆயத்தொகுதிகளைத் தேர்ந்தெடுக்க புலத்தைக் சொடுக்கு செய்க, அல்லது ஒரு இடத்தால் பிரிக்கப்பட்ட இரு ஆயங்களையும் கைமுறையாக உள்ளிடவும்.

# validation.armadas.place.PARTIAL_THREE_ARGS
source: Click the point you want the ship to point towards.
ta: கப்பல் சுட்டிக்காட்ட விரும்பும் புள்ளியைக் சொடுக்கு செய்க.

# validation.armadas.place.TOO_MANY
source: In this scenario, you may only place {{num}} ships of each size.
ta: இந்த சூழ்நிலையில், நீங்கள் ஒவ்வொரு அளவிலும் {{num}} கப்பல்களை மட்டுமே வைக்கலாம்.

# validation.armadas.PLACE_IN_PLAY
source: You cannot place pieces once the play phase has begun.
ta: விளையாட்டு கட்டம் தொடங்கியவுடன் நீங்கள் துண்டுகளை வைக்க முடியாது.

# validation.armadas.PLAY_IN_PLACE
source: You cannot move and attack until the placement phase is concluded.
ta: வேலை வாய்ப்பு கட்டம் முடிவடையும் வரை நீங்கள் நகர்த்தவும் தாக்கவும் முடியாது.

# validation.armadas.SELF_ATK
source: You cannot fire upon your own ships.
ta: உங்கள் சொந்த கப்பல்களில் நீங்கள் சுட முடியாது.

# validation.armadas.TOO_FAR
source: Large ships can only move two spaces, medium ships three, and small ships four.
ta: பெரிய கப்பல்கள் இரண்டு இடங்களை மட்டுமே நகர்த்த முடியும், நடுத்தர கப்பல்கள் மூன்று, மற்றும் சிறிய கப்பல்கள் நான்கு.

# validation.armadas.TOO_MANY_ACTIONS
source: You may only take three actions on your turn.
ta: உங்கள் திருப்பத்தில் நீங்கள் மூன்று நடவடிக்கைகளை மட்டுமே எடுக்கலாம்.

# validation.armadas.TOO_MANY_ATKS
source: Ships may only attack once per turn for every pip of size (e.g., a medium ship can only attack twice in a turn).
ta: ஒவ்வொரு அளவிற்கும் ஒரு முறை மட்டுமே கப்பல்கள் தாக்கக்கூடும் (எ.கா., ஒரு நடுத்தர கப்பல் ஒரு திருப்பத்தில் இரண்டு முறை மட்டுமே தாக்க முடியும்).

# validation.armadas.TOO_SHARP
source: Ships cannot turn more than 75 degrees in one step.
ta: கப்பல்கள் ஒரு கட்டத்தில் 75 டிகிரிக்கு மேல் திரும்ப முடியாது.

# validation.armadas.VALID_PARTIAL_MOVE
source: Click the point you want the ship to point towards.
ta: கப்பல் சுட்டிக்காட்ட விரும்பும் புள்ளியைக் சொடுக்கு செய்க.

# validation.asli.BAD_INCURSION
source: You may not make back-to-back minimal incursions.
ta: நீங்கள் குறைந்தபட்ச ஊடுருவல்களைத் திரும்பப் பெறக்கூடாது.

# validation.asli.BAD_KOMI
source: The first move of the game must be an integer representing the number of pieces to place in the starting prison. A positive number puts pieces belonging to the first player. A negative number, those of the second player. You may not place more pieces in the prison than number of cells on the board plus one.
ta: விளையாட்டின் முதல் நகர்வு தொடக்க சிறையில் வைக்க வேண்டிய துண்டுகளின் எண்ணிக்கையைக் குறிக்கும் ஒரு முழு எண்ணாக இருக்க வேண்டும். ஒரு நேர்மறையான எண் முதல் வீரருக்கு சொந்தமான துண்டுகளை வைக்கிறது. எதிர்மறை எண், இரண்டாவது வீரரின் எண்ணிக்கை. போர்டில் உள்ள கலங்களின் எண்ணிக்கையை விட சிறையில் அதிகமான துண்டுகளை நீங்கள் வைக்கக்கூடாது.

# validation.asli.BAD_PASS
source: You must remove an enemy piece from the prison to pass.
ta: சிறையில் இருந்து ஒரு எதிரி பகுதியை நீங்கள் அகற்ற வேண்டும்.

# validation.asli.BAD_PIE
source: You may not accept pie at this point in the game.
ta: விளையாட்டின் இந்த கட்டத்தில் நீங்கள் பை ஏற்கக்கூடாது.

# validation.asli.INITIAL_INSTRUCTIONS_komi
source: Enter the number of first-player pieces you wish to place in the starting prison. The second player will then decide which seat to take.
ta: தொடக்க சிறையில் நீங்கள் வைக்க விரும்பும் முதல் வீரர் துண்டுகளின் எண்ணிக்கையை உள்ளிடவும். இரண்டாவது வீரர் எந்த இருக்கை எடுக்க வேண்டும் என்பதை தீர்மானிப்பார்.

# validation.asli.INITIAL_INSTRUCTIONS_pie
source: Either click the 'Play second' button to stay where you are and continue playing second, or click 'Swap player seats' to change seats.
ta: நீங்கள் இருக்கும் இடத்தில் தங்குவதற்கு 'இரண்டாவது' பொத்தானைக் சொடுக்கு செய்து, இரண்டாவது விளையாடுவதைத் தொடரவும் அல்லது இருக்கைகளை மாற்ற 'பிளேயர் இருக்கைகள்' என்பதைக் சொடுக்கு செய்யவும்.

# validation.asli.INITIAL_INSTRUCTIONS_pie2
source: Either pass to accept the komi offer and continue playing second, or place a piece to take over as first player.
ta: கோமி சலுகையை ஏற்றுக்கொள்ளவும், தொடர்ந்து இரண்டாவது விளையாடுவதோ அல்லது முதல் வீரராக எடுத்துக் கொள்ள ஒரு பகுதியை வைக்கவும்.

# validation.asli.INITIAL_INSTRUCTIONS_play
source: Place a piece on a valid empty space or pass to take an enemy piece out of the prison instead (if one is available).
ta: செல்லுபடியாகும் வெற்று இடத்தில் ஒரு பகுதியை வைக்கவும் அல்லது அதற்கு பதிலாக சிறையிலிருந்து ஒரு எதிரி துண்டுகளை எடுக்கவும் (ஒன்று கிடைத்தால்).

# validation.asli.MUST_PIE
source: At this point of the game, placing pieces is not allowed.
ta: விளையாட்டின் இந்த கட்டத்தில், துண்டுகளை வைப்பது அனுமதிக்கப்படாது.

# validation.asli.NEGATIVE_KOMI
source: Are you sure? Negative komi offers should only be needed in specific handicapping situations.
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா? எதிர்மறை கோமி சலுகைகள் குறிப்பிட்ட ஊனமுற்ற சூழ்நிலைகளில் மட்டுமே தேவைப்பட வேண்டும்.

# validation.asli.SUICIDE
source: You may not place a piece such that you have dead friendly groups at the end of your turn.
ta: உங்கள் முறையின் முடிவில் இறந்த நட்பு குழுக்கள் இருக்கும் ஒரு பகுதியை நீங்கள் வைக்கக்கூடாது.

# validation.asli.WOVEN_INCURSION
source: In the 'Woven' variant, incursions are not legal.
ta: 'நெய்த' மாறுபாட்டில், ஊடுருவல்கள் சட்டபூர்வமானவை அல்ல.

# validation.assembly.BAD_MOVE
source: The only valid move is a number between 1 and 3.
ta: ஒரே செல்லுபடியாகும் நடவடிக்கை 1 முதல் 3 வரை ஒரு எண்.

# validation.assembly.INITIAL_INSTRUCTIONS
source: Select a number between 1 and 3.
ta: 1 மற்றும் 3 க்கு இடையில் ஒரு எண்ணைத் தேர்ந்தெடுக்கவும்.

# validation.assembly.LABEL_BAG
source: Pieces in bag
ta: பையில் துண்டுகள்

# validation.ataxx.HOLE
source: The cell at {{where}} is blocked.
ta: {{where}} தடுக்கப்பட்டுள்ளது.

# validation.ataxx.INITIAL_INSTRUCTIONS
source: Select a piece to split or jump.
ta: பிரிக்க அல்லது குதிக்க ஒரு துண்டைத் தேர்ந்தெடுக்கவும்.

# validation.ataxx.INITIAL_INSTRUCTIONS_PASS
source: You have no moves so you must pass.
ta: உங்களுக்கு எந்த நகர்வுகளும் இல்லை, எனவே நீங்கள் கடந்து செல்ல வேண்டும்.

# validation.ataxx.INVALID_TO
source: The piece at {{from}} cannot split or jump to {{to}}.
ta: {{from}} இல் உள்ள துண்டு பிரிக்க முடியாது அல்லது {{to}} வரை செல்ல முடியாது.

# validation.ataxx.MUST_PASS
source: The only move available to you is to pass.
ta: உங்களுக்கு கிடைக்கும் ஒரே நடவடிக்கை கடந்து செல்வதுதான்.

# validation.ataxx.ILLEGAL_PASS
source: You may only pass if you have no legal moves.
ta: உங்களிடம் சட்டப்பூர்வ நகர்வுகள் இல்லையென்றால் மட்டுமே நீங்கள் கடந்து செல்ல முடியும்.

# validation.ataxx.NO_TOS
source: The selected piece at {{from}} has no possible destinations to split or jump to.
ta: {{from}} இல் தேர்ந்தெடுக்கப்பட்ட துண்டு பிரிக்க அல்லது குதிக்க சாத்தியமான இடங்கள் இல்லை.

# validation.ataxx.SELECT_TO
source: Select a destination to split or jump to.
ta: பிரிக்க அல்லது செல்ல ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.ataxx.SPLIT4JUMP
source: You have indicated a split when it's supposed to be a jump. Try {{move}}.
ta: ஒரு சம்ப் ஆக இருக்கும் போது நீங்கள் ஒரு பிளவு சுட்டிக்காட்டியுள்ளீர்கள். {{move}} முயற்சிக்கவும்.

# validation.ataxx.JUMP4SPLIT
source: You have indicated a jump when it's supposed to be a split. Try {{move}}.
ta: இது ஒரு பிளவு இருக்க வேண்டும் என்று கருதும்போது நீங்கள் சுட்டிக்காட்டியுள்ளீர்கள். {{move}} முயற்சிக்கவும்.

# validation.atoll.INITIAL_INSTRUCTIONS
source: Select a cell to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.attangle.EMPTYCAPTURE
source: One of the cells involved with the capture doesn't have any pieces in it.
ta: பிடிப்புடன் தொடர்புடைய கலங்களில் ஒன்று அதில் எந்த துண்டுகளும் இல்லை.

# validation.attangle.INITIAL_INSTRUCTIONS
source: Place a piece on an empty cell (that doesn't have a dot on it) or select an existing piece to start a capture.
ta: ஒரு வெற்று கலத்தில் ஒரு துண்டு வைக்கவும் (அதில் ஒரு புள்ளி இல்லை) அல்லது பிடிப்பைத் தொடங்க ஏற்கனவே இருக்கும் துண்டைத் தேர்ந்தெடுக்கவும்.

# validation.attangle.MOVE2EMPTY
source: You cannot capture empty cells.
ta: நீங்கள் வெற்று செல்களைப் பிடிக்க முடியாது.

# validation.attangle.ONVOID
source: You cannot place pieces on voids (the spaces marked with a black dot).
ta: நீங்கள் வெற்றிடங்களில் துண்டுகளை வைக்க முடியாது (கருப்பு புள்ளியுடன் குறிக்கப்பட்ட இடங்கள்).

# validation.attangle.POTENTIAL_ONE
source: This could potentially be a capture. Provide the location of the second stack.
ta: இது ஒரு பிடிப்பாக இருக்கலாம். இரண்டாவது அடுக்கின் இருப்பிடத்தை வழங்கவும்.

# validation.attangle.POTENTIAL_TWO
source: This could potentially be a capture. Provide the target location.
ta: இது ஒரு பிடிப்பாக இருக்கலாம். இலக்கு இருப்பிடத்தை வழங்கவும்.

# validation.attangle.SAMESOURCE
source: The two attacking stacks must be different.
ta: தாக்குதல் இரண்டு அடுக்குகளும் வித்தியாசமாக இருக்க வேண்டும்.

# validation.attangle.TOOHIGH
source: The combined stack after the capture will be too high.
ta: பிடிக்கப்பட்ட பிறகு ஒருங்கிணைந்த அடுக்கு மிக அதிகமாக இருக்கும்.

# validation.attangle.TRIPLESTACK
source: Triple stacks cannot participate in captures.
ta: பிடிப்புகளில் மூன்று அடுக்குகள் பங்கேற்க முடியாது.

# validation.ayu.INITIAL_INSTRUCTIONS
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.ayu.INVALID_TO
source: The piece at {{from}} cannot move to {{to}}.
ta: {{from}} இல் உள்ள துண்டு {{to}} க்கு செல்ல முடியாது.

# validation.ayu.NO_MOVES
source: The piece at {{where}} cannot move.
ta: {{where}}} நகர்த்த முடியாது.

# validation.azacru.BAD_ORIENTATION
source: The only valid orientation notations are ">", "<", and ".".
ta: செல்லுபடியாகும் நோக்குநிலை குறிப்புகள் ">", "<", மற்றும் "."

# validation.azacru.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.azacru.ENEMY_TILE
source: You can't land on opposing tiles.
ta: எதிரெதிர் ஓடுகளில் நீங்கள் இறங்க முடியாது.

# validation.azacru.INITIAL_INSTRUCTIONS
source: Select a chevron to move.
ta: நகர்த்த ஒரு செவ்ரானைத் தேர்ந்தெடுக்கவும்.

# validation.azacru.NEED_DESTINATION
source: Select the destination (valid targets are highlighted).
ta: இலக்கைத் தேர்ந்தெடுக்கவும் (செல்லுபடியாகும் இலக்குகள் சிறப்பிக்கப்பட்டுள்ளன).

# validation.azacru.NO_CAPTURES
source: You may not move onto a cell with another chevron.
ta: நீங்கள் மற்றொரு செவ்ரானுடன் ஒரு கலத்திற்கு செல்லக்கூடாது.

# validation.azacru.REORIENT
source: Click a neighbouring cell or edge zone to select the direction you want to face.
ta: நீங்கள் எதிர்கொள்ள விரும்பும் திசையைத் தேர்ந்தெடுக்க அண்டை செல் அல்லது விளிம்பு மண்டலத்தைக் சொடுக்கு செய்க.

# validation.bao.BAD_TAX
source: You may only "tax" the nyumba if it is the only occupied space on your front row.
ta: உங்கள் முன் வரிசையில் ஆக்கிரமிக்கப்பட்ட ஒரே இடமாக இருந்தால், நியும்பாவை மட்டுமே நீங்கள் "வரி" செய்யலாம்.

# validation.bao.BLOCKED
source: You may not begin a kutakata turn with a pit that is blocked (is in kutakatia).
ta: தடுக்கப்பட்ட குழியுடன் குட்டகாட்டா திருப்பத்தை நீங்கள் தொடங்கக்கூடாது (குட்டகாட்டியாவில் உள்ளது).

# validation.bao.CHOOSE_DIR_mtaji
source: Select the adjacent pit in the direction you wish to sow.
ta: நீங்கள் விதைக்க விரும்பும் திசையில் அருகிலுள்ள குழியைத் தேர்ந்தெடுக்கவும்.

# validation.bao.CHOOSE_DIR_namua
source: Select the adjacent pit in the direction you wish to sow or, if you're capturing, in the direction of the kichwa you want to start from.
ta: நீங்கள் விதைக்க விரும்பும் திசையில் அருகிலுள்ள குழியைத் தேர்ந்தெடுக்கவும் அல்லது நீங்கள் கைப்பற்றினால், நீங்கள் தொடங்க விரும்பும் கிச்ச்வாவின் திசையில்.

# validation.bao.EMPTY
source: You cannot interact with empty pits.
ta: வெற்று குழிகளுடன் நீங்கள் தொடர்பு கொள்ள முடியாது.

# validation.bao.INITIAL_INSTRUCTIONS_mtaji|kutakata
source: Select one of your pits that contains two or more stones to begin sowing. No capture is possible.
ta: விதைக்கத் தொடங்க இரண்டு அல்லது அதற்கு மேற்பட்ட கற்களைக் கொண்ட உங்கள் குழிகளில் ஒன்றைத் தேர்ந்தெடுக்கவும். பிடிப்பு சாத்தியமில்லை.

# validation.bao.INITIAL_INSTRUCTIONS_mtaji|mtaji
source: Select one of your pits that contains two or more stones to begin sowing. A capture is available.
ta: விதைக்கத் தொடங்க இரண்டு அல்லது அதற்கு மேற்பட்ட கற்களைக் கொண்ட உங்கள் குழிகளில் ஒன்றைத் தேர்ந்தெடுக்கவும். ஒரு பிடிப்பு கிடைக்கிறது.

# validation.bao.INITIAL_INSTRUCTIONS_namua|kutakata
source: Select one of your inner pits that contains stones. You will add one of your in-hand stones to it and then begin sowing. No capture is available.
ta: கற்களைக் கொண்ட உங்கள் உள் குழிகளில் ஒன்றைத் தேர்ந்தெடுக்கவும். உங்கள் கையில் கற்களில் ஒன்றைச் சேர்த்து, பின்னர் விதைக்கத் தொடங்குவீர்கள். பிடிப்பு எதுவும் கிடைக்கவில்லை.

# validation.bao.INITIAL_INSTRUCTIONS_namua|mtaji
source: Select one of your inner pits that contains stones. You will add one of your in-hand stones to it and then capture the opposing stones. A capture is available.
ta: கற்களைக் கொண்ட உங்கள் உள் குழிகளில் ஒன்றைத் தேர்ந்தெடுக்கவும். உங்கள் கையில் கற்களில் ஒன்றைச் சேர்த்து, பின்னர் எதிரெதிர் கற்களைப் பிடிப்பீர்கள். ஒரு பிடிப்பு கிடைக்கிறது.

# validation.bao.NEVER_SINGLE
source: In the mtaji phase, you may never start your move from a pit with only one stone.
ta: MTAJI கட்டத்தில், ஒரே ஒரு கல்லைக் கொண்ட குழியிலிருந்து உங்கள் நகர்வை நீங்கள் ஒருபோதும் தொடங்கக்கூடாது.

# validation.bao.NO_BACK_ROW_mtaji
source: In the mtaji phase, you may only start from the back row if it results in a capture or no kutakata is possible from the front row.
ta: MTAJI கட்டத்தில், நீங்கள் ஒரு பிடிப்புக்கு வழிவகுத்தால் மட்டுமே நீங்கள் பின் வரிசையில் இருந்து தொடங்கலாம் அல்லது முன் வரிசையில் இருந்து குட்டகாட்டா சாத்தியமில்லை.

# validation.bao.NO_BACK_ROW_namua
source: In the kunamua phase, you may not start from your back row.
ta: குனாமுவா கட்டத்தில், நீங்கள் உங்கள் பின் வரிசையில் இருந்து தொடங்கக்கூடாது.

# validation.bao.PLAY_HOUSE
source: Your sowing has ended in your nyumba. You can stop or "go on safari" (this will turn your nyumba into a standard pit). To continue sowing, click your nyumba or type a "+" sign in the move entry box.
ta: உங்கள் விதைப்பு உங்கள் நியும்பாவில் முடிந்தது. நீங்கள் நிறுத்தலாம் அல்லது "சஃபாரி செல்லுங்கள்" (இது உங்கள் நியும்பாவை ஒரு நிலையான குழியாக மாற்றும்). தொடர்ந்து விதைக்க, உங்கள் நியும்பா அல்லது நகரும் நுழைவு பெட்டியில் "+" அடையாளத்தை தட்டச்சு செய்க.

# validation.bao.TWO_PLUS
source: You may only begin a kunamua-phase kutakata turn in a pit with one stone if you have a working house or all you have in the front row are pits with single stones.
ta: உங்களிடம் ஒரு வேலை வீடு இருந்தால் அல்லது முன் வரிசையில் உங்களிடம் உள்ள அனைத்தும் ஒற்றை கற்களைக் கொண்ட குழிகள் இருந்தால் மட்டுமே நீங்கள் ஒரு குனமுவா-கட்ட குட்டகதா திருப்பத்தைத் தொடங்கலாம்.

# validation.basalt.BAD_MOVE
source: Stacks may not move further than their height, and they may not pass over stacks controlled by your opponent.
ta: அடுக்குகள் அவற்றின் உயரத்தை விட அதிகமாக நகராது, மேலும் அவை உங்கள் எதிரியால் கட்டுப்படுத்தப்படும் அடுக்குகளை கடந்து செல்லக்கூடாது.

# validation.basalt.BAD_PASS
source: You may not pass as long as you have valid moves available.
ta: நீங்கள் சரியான நகர்வுகள் கிடைக்கும் வரை நீங்கள் கடந்து செல்லக்கூடாது.

# validation.basalt.INITIAL_INSTRUCTIONS_play
source: Select a stack you control to move.
ta: நகர்த்த நீங்கள் கட்டுப்படுத்தும் அடுக்கைத் தேர்ந்தெடுக்கவும்.

# validation.basalt.INITIAL_INSTRUCTIONS_offer
source: Click a piece to the left of the board and then a cell on the board to build your initial pie offer. You may place two to four pieces, at least one of each colour, no more than two of any one colour, in any configuration of singles and stacks you wish.
ta: உங்கள் ஆரம்ப பை சலுகையை உருவாக்க பலகையின் இடதுபுறத்தில் ஒரு பகுதியையும், பின்னர் பலகையில் ஒரு கலத்தையும் சொடுக்கு செய்க. நீங்கள் இரண்டு முதல் நான்கு துண்டுகளை வைக்கலாம், ஒவ்வொரு வண்ணத்திலும் குறைந்தபட்சம் ஒன்று, எந்த ஒரு வண்ணத்திலும் இரண்டிற்கு மேல் இல்லை, நீங்கள் விரும்பும் ஒற்றையர் மற்றும் அடுக்குகளின் எந்த உள்ளமைவிலும்.
