Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.realm.DOUBLE_POWER
source: In the initial power placement phase, you may not place multiple powers in the same realm.
ta: ஆரம்ப ஆற்றல் வேலை வாய்ப்பு கட்டத்தில், நீங்கள் ஒரே உலகில் பல சக்திகளை வைக்கக்கூடாது.

# validation.realm.EMPTY_REARRANGE
source: There are no pieces in realm {{realm}} that you can rearrange.
ta: நீங்கள் மறுசீரமைக்கக்கூடிய {{realm} erm இல் எந்த துண்டுகளும் இல்லை.

# validation.realm.ENFORCER_180
source: Enforcers may not make 180-degree turns.
ta: செயல்படுத்துபவர்கள் 180 டிகிரி திருப்பங்களைச் செய்யக்கூடாது.

# validation.realm.INHAND
source: You have pieces left to place on the board.
ta: போர்டில் வைக்க உங்களிடம் துண்டுகள் உள்ளன.

# validation.realm.INHAND_LABEL
source: Rearranging {{realm}}
ta: மறுசீரமைத்தல் {{realm}}}

# validation.realm.INITIAL_INSTRUCTIONS_bases
source: Place a base by clicking anywhere in an uncontrolled realm.
ta: கட்டுப்பாடற்ற உலகில் எங்கும் சொடுக்கு செய்வதன் மூலம் ஒரு தளத்தை வைக்கவும்.

# validation.realm.INITIAL_INSTRUCTIONS_play
source: Click a piece to move, or click a base to rearrange pieces in that realm.
ta: நகர்த்த ஒரு பகுதியைக் சொடுக்கு செய்க, அல்லது அந்த உலகில் உள்ள துண்டுகளை மறுசீரமைக்க ஒரு தளத்தைக் சொடுக்கு செய்க.

# validation.realm.INITIAL_INSTRUCTIONS_powers
source: Place a power by clicking an empty cell in a realm you control.
ta: நீங்கள் கட்டுப்படுத்தும் ஒரு சாம்ராச்யத்தில் ஒரு வெற்று கலத்தைக் சொடுக்கு செய்வதன் மூலம் ஒரு சக்தியை வைக்கவும்.

# validation.realm.INVALID_REARRANGE
source: You may not rearrange and move pieces in the same turn.
ta: ஒரே திருப்பத்தில் நீங்கள் மறுசீரமைத்து துண்டுகளை நகர்த்தக்கூடாது.

# validation.realm.MISSING_SPECIALS
source: Special actions were triggered and must be specified in parentheses after the move.
ta: சிறப்பு நடவடிக்கைகள் தூண்டப்பட்டன, மேலும் நகர்வுக்குப் பிறகு அடைப்புக்குறிக்குள் குறிப்பிடப்பட வேண்டும்.

# validation.realm.MUST_LEAVE_REALM
source: Pieces may not move within the same realm except by rearrangement.
ta: மறுசீரமைப்பதன் மூலம் தவிர துண்டுகள் ஒரே பகுதிக்குள் நகராது.

# validation.realm.NO_SPECIALS
source: No special events were triggered, but your move includes some.
ta: சிறப்பு நிகழ்வுகள் எதுவும் தூண்டப்படவில்லை, ஆனால் உங்கள் நகர்வில் சில அடங்கும்.

# validation.realm.NOT_CENTRE
source: {{where}} is not a valid centre space.
ta: {{where}} செல்லுபடியாகும் மைய இடம் அல்ல.

# validation.realm.NOT_IN_HAND
source: The piece {{piece}} does not appear to be in your hand.
ta: {{piece}} துண்டு உங்கள் கையில் இருப்பதாகத் தெரியவில்லை.

# validation.realm.ONLY_BORDERS
source: Only bases may be placed on centre spaces.
ta: மைய இடைவெளிகளில் தளங்கள் மட்டுமே வைக்கப்படலாம்.

# validation.realm.ONLY_ENFORCERS
source: Only enforcers may be immobilized.
ta: செயல்படுத்துபவர்கள் மட்டுமே அசையாமல் இருக்கலாம்.

# validation.realm.ORIENT_ENFORCER
source: Click an orthogonally adjacent cell to orient the enforcer to face that direction.
ta: அந்த திசையை எதிர்கொள்ள செயல்படுத்துபவரை நோக்குநிலைக்கு ஒரு ஆர்த்தோகனலி அருகிலுள்ள கலத்தைக் சொடுக்கு செய்க.

# validation.realm.PIECE_MISMATCH
source: The piece in cell {{where}} does not match the type you say you're moving.
ta: கலத்தில் உள்ள துண்டு {{where}} நீங்கள் நகரும் வகையுடன் பொருந்தவில்லை.

# validation.realm.PLACE_IN_REALM
source: Click on an empty space in realm {{realm}} to place the piece.
ta: துண்டு வைக்க வெற்று இடத்தைக் சொடுக்கு செய்க {{realm}}.

# validation.realm.SPECIAL_CAP_BASE
source: You must specify that you are capturing the base in this realm.
ta: இந்த உலகில் உள்ள தளத்தை நீங்கள் கைப்பற்றுகிறீர்கள் என்பதை நீங்கள் குறிப்பிட வேண்டும்.

# validation.realm.SPECIAL_CREATE_BASE
source: You must specify that you are creating a base in this realm.
ta: இந்த உலகில் நீங்கள் ஒரு தளத்தை உருவாக்குகிறீர்கள் என்பதை நீங்கள் குறிப்பிட வேண்டும்.

# validation.realm.SPECIAL_CREATE_ENFORCER
source: You must specify the location and orientation of the enforcer you are creating.
ta: நீங்கள் உருவாக்கும் செயல்படுத்துபவரின் இருப்பிடம் மற்றும் நோக்குநிலையை நீங்கள் குறிப்பிட வேண்டும்.

# validation.realm.SPECIAL_IMMOB_ENFORCER
source: You must specify the location of the enemy enforcer you are immobilizing.
ta: நீங்கள் அசையாத எதிரி செயல்படுத்துபவரின் இருப்பிடத்தை நீங்கள் குறிப்பிட வேண்டும்.

# validation.realm.SPECIAL_IMMOB_SELF
source: You must specify that the enforcer you just moved will be immobilized.
ta: நீங்கள் இப்போது நகர்த்தியவர் அசையாமல் இருப்பார் என்பதை நீங்கள் குறிப்பிட வேண்டும்.

# validation.realm.UNCONTROLLED
source: You do not control realm {{realm}}.
ta: நீங்கள் {{realm} from} below ஐ கட்டுப்படுத்தவில்லை.

# validation.realm.WRONG_REALM_capBase
source: You may only capture the base in the realm you just moved to ({{realm}}).
ta: நீங்கள் இப்போது ({{realm}}) நகர்த்தப்பட்ட சாம்ராச்யத்தில் மட்டுமே தளத்தை கைப்பற்றலாம்.

# validation.realm.WRONG_REALM_createBase
source: You may only create a base in the realm you just moved to ({{realm}}).
ta: நீங்கள் இப்போது ({{realm}}) நகர்த்தப்பட்ட சாம்ராச்யத்தில் ஒரு தளத்தை மட்டுமே உருவாக்க முடியும்.

# validation.realm.WRONG_REALM_createEnforcer
source: You may only create an enforcer in the realm you just moved to ({{realm}}).
ta: நீங்கள் ({{realm}}) நகர்ந்த உலகில் மட்டுமே ஒரு செயல்படுத்துபவரை உருவாக்க முடியும்.

# validation.realm.WRONG_REALM_rearrange
source: You may only place pieces in the realm being rearranged ({{realm}}).
ta: நீங்கள் மறுசீரமைக்கப்படுவதை சாம்ராச்யத்தில் மட்டுமே வைக்கலாம் ({{realm}}).

# validation.renju.INITIAL_INSTRUCTIONS_RIF1
source: Select a renju opening. The first stone must be placed in the centre of the board, the second in the centre 3x3 square, and the third in the centre 5x5 square. Symmetries are disallowed.
ta: ஒரு ரென்சு திறப்பைத் தேர்ந்தெடுக்கவும். முதல் கல் பலகையின் மையத்திலும், இரண்டாவது 3x3 சதுரத்திலும், மூன்றாவது மையத்தில் 5x5 சதுரத்திலும் வைக்கப்பட வேண்டும். சமச்சீர் அனுமதிக்கப்படவில்லை.

# validation.renju.INITIAL_INSTRUCTIONS_RIF2
source: Select an intersection to place the second stone, or pass to swap colours.
ta: இரண்டாவது கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும் அல்லது வண்ணங்களை மாற்றவும்.

# validation.renju.INITIAL_INSTRUCTIONS_RIF2_PASSED
source: Select an intersection to place the second stone.
ta: இரண்டாவது கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும்.

# validation.renju.INITIAL_INSTRUCTIONS_RIF3
source: Select two intersections to place the fifth stone.
ta: ஐந்தாவது கல்லை வைக்க இரண்டு குறுக்குவெட்டுகளைத் தேர்ந்தெடுக்கவும்.

# validation.renju.INITIAL_INSTRUCTIONS_RIF4
source: Choose one of the 2 tentative fifths, then place the sixth stone.
ta: 2 தற்காலிக ஐந்தில் ஒன்றைத் தேர்ந்தெடுத்து, பின்னர் ஆறாவது கல்லை வைக்கவும்.

# validation.renju.INITIAL_INSTRUCTIONS_SOOSYRV1
source: Select a renju opening. The first stone must be placed in the centre of the board, the second in the centre 3x3 square, and the third in the centre 5x5 square. Symmetries are disallowed.
ta: ஒரு ரென்சு திறப்பைத் தேர்ந்தெடுக்கவும். முதல் கல் பலகையின் மையத்திலும், இரண்டாவது 3x3 சதுரத்திலும், மூன்றாவது மையத்தில் 5x5 சதுரத்திலும் வைக்கப்பட வேண்டும். சமச்சீர் அனுமதிக்கப்படவில்லை.

# validation.renju.INITIAL_INSTRUCTIONS_SOOSYRV2
source: Place the fourth stone, and then declare the number of tentative fifths. You may pass to swap colours.
ta: நான்காவது கல்லை வைக்கவும், பின்னர் தற்காலிக ஐந்தாவது எண்ணிக்கையை அறிவிக்கவும். வண்ணங்களை மாற்ற நீங்கள் செல்லலாம்.

# validation.renju.INITIAL_INSTRUCTIONS_SOOSYRV2_PASSED
source: Place the fourth stone, and then declare the number of tentative fifths.
ta: நான்காவது கல்லை வைக்கவும், பின்னர் தற்காலிக ஐந்தாவது எண்ணிக்கையை அறிவிக்கவும்.

# validation.renju.INITIAL_INSTRUCTIONS_SOOSYRV3
source: Place {{count}} tentative fifths. You may pass to swap colours.
ta: இடம் {{count}} தற்காலிக ஐந்தில். வண்ணங்களை மாற்ற நீங்கள் செல்லலாம்.

# validation.renju.INITIAL_INSTRUCTIONS_SOOSYRV3_PASSED
source: Place {{count}} tentative fifths.
ta: இடம் {{count}} தற்காலிக ஐந்தில்.

# validation.renju.INITIAL_INSTRUCTIONS_SOOSYRV4
source: Choose the one tentative fifths, then place the sixth stone.
ta: ஒரு தற்காலிக ஐந்தில் ஒரு பகுதியைத் தேர்ந்தெடுத்து, பின்னர் ஆறாவது கல்லை வைக்கவும்.

# validation.renju.INITIAL_INSTRUCTIONS_TARAGUCHI1
source: Place the first stone in the centre of the board.
ta: முதல் கல்லை வாரியத்தின் மையத்தில் வைக்கவும்.

# validation.renju.INITIAL_INSTRUCTIONS_TARAGUCHI2
source: Place the second stone in the centre 3x3 square, or pass to swap colours. Symmetries are disallowed.
ta: இரண்டாவது கல்லை மையத்தில் 3x3 சதுரத்தில் வைக்கவும், அல்லது வண்ணங்களை மாற்றவும். சமச்சீர் அனுமதிக்கப்படவில்லை.

# validation.renju.INITIAL_INSTRUCTIONS_TARAGUCHI2_PASSED
source: Place the second stone in the centre 3x3 square. Symmetries are disallowed.
ta: இரண்டாவது கல்லை மையத்தில் 3x3 சதுரத்தில் வைக்கவும். சமச்சீர் அனுமதிக்கப்படவில்லை.

# validation.renju.INITIAL_INSTRUCTIONS_TARAGUCHI3
source: Place the third stone in the centre 5x5 square, or pass to swap colours. Symmetries are disallowed.
ta: மூன்றாவது கல்லை 5x5 சதுர மையத்தில் வைக்கவும் அல்லது வண்ணங்களை மாற்றவும். சமச்சீர் அனுமதிக்கப்படவில்லை.

# validation.renju.INITIAL_INSTRUCTIONS_TARAGUCHI3_PASSED
source: Place the third stone in the centre 5x5 square. Symmetries are disallowed.
ta: மூன்றாவது கல்லை 5x5 சதுர மையத்தில் வைக்கவும். சமச்சீர் அனுமதிக்கப்படவில்லை.

# validation.renju.INITIAL_INSTRUCTIONS_TARAGUCHI4
source: Place the fourth stone in the centre 7x7 square, or pass to swap colours.
ta: நான்காவது கல்லை 7x7 சதுர மையத்தில் வைக்கவும் அல்லது வண்ணங்களை மாற்றவும்.

# validation.renju.INITIAL_INSTRUCTIONS_TARAGUCHI4_PASSED
source: Place the fourth stone in the centre 7x7 square.
ta: 7x7 சதுர மையத்தில் நான்காவது கல்லை வைக்கவும்.

# validation.renju.INITIAL_INSTRUCTIONS_TARAGUCHI5
source: You may do one of (1) place the fifth stone in the centre 9x9 square, (2) pass to swap colours, or (3) place 10 tentative fifths anywhere on the board.
ta: நீங்கள் (1) ஐந்தாவது கல்லை 9x9 சதுரத்தில் மையத்தில் வைக்கலாம், (2) வண்ணங்களை இடமாற்றம் செய்ய கடந்து செல்லலாம், அல்லது (3) 10 தற்காலிக ஐந்தில் எங்கும் போர்டில் வைக்கலாம்.

# validation.renju.INITIAL_INSTRUCTIONS_TARAGUCHI5_PASSED
source: Place the fifth stone in the centre 9x9 square.
ta: ஐந்தாவது கல்லை 9x9 சதுர மையத்தில் வைக்கவும்.

# validation.renju.INITIAL_INSTRUCTIONS_TARAGUCHI6
source: Select an intersection to place a stone, or pass to swap colours.
ta: ஒரு கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும் அல்லது வண்ணங்களை மாற்றவும்.

# validation.renju.INITIAL_INSTRUCTIONS_TARAGUCHI6_CHOOSE
source: Choose one of the 10 tentative fifths, then place the sixth stone.
ta: 10 தற்காலிக ஐந்தில் ஒன்றைத் தேர்ந்தெடுத்து, பின்னர் ஆறாவது கல்லை வைக்கவும்.

# validation.renju.INITIAL_INSTRUCTIONS_YAMAGUCHI1
source: Select a renju opening, then declare the number of tentative fifths. The first stone must be placed in the centre of the board, the second in the centre 3x3 square, and the third in the centre 5x5 square. Symmetries are disallowed.
ta: ஒரு ரென்சு திறப்பைத் தேர்ந்தெடுத்து, பின்னர் தற்காலிக ஐந்தாவது எண்ணிக்கையை அறிவிக்கவும். முதல் கல் பலகையின் மையத்திலும், இரண்டாவது 3x3 சதுரத்திலும், மூன்றாவது மையத்தில் 5x5 சதுரத்திலும் வைக்கப்பட வேண்டும். சமச்சீர் அனுமதிக்கப்படவில்லை.

# validation.renju.INITIAL_INSTRUCTIONS_YAMAGUCHI2
source: Select an intersection to place the fourth stone, or pass to swap colours.
ta: நான்காவது கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும் அல்லது வண்ணங்களை மாற்றவும்.

# validation.renju.INITIAL_INSTRUCTIONS_YAMAGUCHI2_PASSED
source: Select an intersection to place the fourth stone.
ta: நான்காவது கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும்.

# validation.renju.INITIAL_INSTRUCTIONS_YAMAGUCHI3
source: Place 1 tentative fifth.
ta: 1 தற்காலிக ஐந்தாவது இடம்.

# validation.renju.INITIAL_INSTRUCTIONS_YAMAGUCHI4
source: Choose the one tentative fifth, then place the sixth stone.
ta: ஒரு தற்காலிக ஐந்தாவது ஒன்றைத் தேர்வுசெய்து, பின்னர் ஆறாவது கல்லை வைக்கவும்.

# validation.renju.RENJU_OPENING_EXCESS
source: You may only place 3 stones.
ta: நீங்கள் 3 கற்களை மட்டுமே வைக்கலாம்.

# validation.renju.RENJU_OPENING1_INCORRECT
source: The first stone has to be at the centre of the board.
ta: முதல் கல் குழுவின் மையத்தில் இருக்க வேண்டும்.

# validation.renju.RENJU_OPENING2
source: Place the second stone at the centre 3x3 square. Choose one of the two highlighted intersections.
ta: இரண்டாவது கல்லை மையத்தில் 3x3 சதுரத்தில் வைக்கவும். சிறப்பிக்கப்பட்ட இரண்டு குறுக்குவெட்டுகளில் ஒன்றைத் தேர்வுசெய்க.

# validation.renju.RENJU_OPENING2_INCORRECT
source: The second stone has to be at the centre 3x3 square. In this this implementation, symmetries are disallowed. Choose one of the two highlighted intersections.
ta: இரண்டாவது கல் 3x3 சதுர மையத்தில் இருக்க வேண்டும். இந்த செயலாக்கத்தில், சமச்சீர் அனுமதிக்கப்படவில்லை. சிறப்பிக்கப்பட்ட இரண்டு குறுக்குவெட்டுகளில் ஒன்றைத் தேர்வுசெய்க.

# validation.renju.RENJU_OPENING3
source: Place the third stone at the centre 5x5 square. Choose one of the 13 highlighted intersections.
ta: மூன்றாவது கல்லை 5x5 சதுர மையத்தில் வைக்கவும். சிறப்பிக்கப்பட்ட 13 குறுக்குவெட்டுகளில் ஒன்றைத் தேர்வுசெய்க.

# validation.renju.RENJU_OPENING3_INCORRECT
source: The third stone has to be at the centre 5x5 square. In this this implementation, symmetries are disallowed. Choose one of the 13 highlighted intersections.
ta: மூன்றாவது கல் 5x5 சதுர மையத்தில் இருக்க வேண்டும். இந்த செயலாக்கத்தில், சமச்சீர் அனுமதிக்கப்படவில்லை. சிறப்பிக்கப்பட்ட 13 குறுக்குவெட்டுகளில் ஒன்றைத் தேர்வுசெய்க.

# validation.renju.RIF3_EXCESS
source: You may place only 2 tentative fifths.
ta: நீங்கள் 2 தற்காலிக ஐந்தில் மட்டுமே வைக்கலாம்.

# validation.renju.RIF4_CHOOSE
source: You have to choose one of the two tentative fifths
ta: இரண்டு தற்காலிக ஐந்தில் ஒன்றை நீங்கள் தேர்வு செய்ய வேண்டும்

# validation.renju.RIF4_EXCESS
source: You have too many items in your move.
ta: உங்கள் நகர்வில் அதிகமான உருப்படிகள் உள்ளன.

# validation.renju.RIF32
source: Place 1 more tentative fifth.
ta: மேலும் 1 தற்காலிக ஐந்தாவது இடம்.

# validation.renju.RIF42
source: Select an intersection to place the sixth stone.
ta: ஆறாவது கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும்.

# validation.renju.SOOSYRV2_STONES_BEFORE_TENTATIVE
source: You need to place your stone before declaring the number of tentative fifths.
ta: தற்காலிக ஐந்தாவது எண்ணிக்கையை அறிவிப்பதற்கு முன்பு உங்கள் கல்லை வைக்க வேண்டும்.

# validation.renju.SOOSYRV2_TENTATIVE
source: Declare the number of tentative fifths.
ta: தற்காலிக ஐந்தில் எண்ணிக்கையை அறிவிக்கவும்.

# validation.renju.SOOSYRV2_TENTATIVE_COUNT_EXCEED
source: The number of tentative fifths must be at most 8.
ta: தற்காலிக ஐந்தாவது எண்ணிக்கை அதிகபட்சமாக இருக்க வேண்டும்.

# validation.renju.SOOSYRV3_EXCESS
source: You may only place 1 tentative fifth.
ta: நீங்கள் 1 தற்காலிக ஐந்தாவது மட்டுமே வைக்கலாம்.

# validation.renju.SOOSYRV3_MORE
source: Place 1 more tentative fifth.
ta: மேலும் 1 தற்காலிக ஐந்தாவது இடத்தைப் பெறுங்கள்.

# validation.renju.SOOSYRV4_CHOOSE
source: You have to choose the one tentative fifth.
ta: நீங்கள் ஒரு தற்காலிக ஐந்தாவது தேர்வு செய்ய வேண்டும்.

# validation.renju.SOOSYRV4_EXCESS
source: You have too many items in your move.
ta: உங்கள் நகர்வில் அதிகமான உருப்படிகள் உள்ளன.

# validation.renju.SOOSYRV42
source: Select an intersection to place the sixth stone.
ta: ஆறாவது கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும்.

# validation.renju.SYMMETRY
source: The tentative fifths must not be placed in symmetrical positions.
ta: தற்காலிக ஐந்தில் சமச்சீர் நிலைகளில் வைக்கப்படக்கூடாது.

# validation.renju.TARAGUCHI_RESTRICTION1
source: The first stone has to be at the centre of the board.
ta: முதல் கல் குழுவின் மையத்தில் இருக்க வேண்டும்.

# validation.renju.TARAGUCHI_RESTRICTION2
source: The second stone has to be at the centre 3x3 square. Symmetries are disallowed. Choose one of the 2 highlighted intersections.
ta: இரண்டாவது கல் 3x3 சதுர மையத்தில் இருக்க வேண்டும். சமச்சீர் அனுமதிக்கப்படவில்லை. சிறப்பிக்கப்பட்ட 2 குறுக்குவெட்டுகளில் ஒன்றைத் தேர்வுசெய்க.

# validation.renju.TARAGUCHI_RESTRICTION3
source: The third stone has to be at the centre 5x5 square. Symmetries are disallowed. Choose one of the 13 highlighted intersections.
ta: மூன்றாவது கல் 5x5 சதுர மையத்தில் இருக்க வேண்டும். சமச்சீர் அனுமதிக்கப்படவில்லை. சிறப்பிக்கப்பட்ட 13 குறுக்குவெட்டுகளில் ஒன்றைத் தேர்வுசெய்க.

# validation.renju.TARAGUCHI_RESTRICTION4
source: The fourth stone has to be at the centre 7x7 square.
ta: நான்காவது கல் 7x7 சதுர மையத்தில் இருக்க வேண்டும்.

# validation.renju.TARAGUCHI_RESTRICTION5
source: The fifth stone has to be at the centre 9x9 square.
ta: ஐந்தாவது கல் 9x9 சதுர மையத்தில் இருக்க வேண்டும்.

# validation.renju.TARAGUCHI_RESTRICTION5_EXCESS
source: You may place only 10 tentative fifths.
ta: நீங்கள் 10 தற்காலிக ஐந்தில் மட்டுமே வைக்கலாம்.

# validation.renju.TARAGUCHI_RESTRICTION5_INSIDE
source: Submit the move, or continue placing 9 more tentative fifths.
ta: நகர்வைச் சமர்ப்பிக்கவும், அல்லது மேலும் 9 தற்காலிக ஐந்தில் வைக்கவும்.

# validation.renju.TARAGUCHI_RESTRICTION5_MORE
source: Place one more tentative fifth.
ta: இன்னும் ஒரு தற்காலிக ஐந்தாவது வைக்கவும்.

# validation.renju.TARAGUCHI6_CHOOSE
source: You have to choose one of the 10 tentative fifths.
ta: 10 தற்காலிக ஐந்தில் ஒன்றை நீங்கள் தேர்வு செய்ய வேண்டும்.

# validation.renju.TARAGUCHI6_EXCESS
source: You have too many items in your move.
ta: உங்கள் நகர்வில் அதிகமான உருப்படிகள் உள்ளன.

# validation.renju.TARAGUCHI62
source: Select an intersection to place the sixth stone.
ta: ஆறாவது கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும்.

# validation.renju.YAMAGUCHI1_EXCESS
source: You may only place 3 stones.
ta: நீங்கள் 3 கற்களை மட்டுமே வைக்கலாம்.

# validation.renju.YAMAGUCHI1_STONES_BEFORE_TENTATIVE
source: You need to place the 3 stones before declaring the number of tentative fifths.
ta: தற்காலிக ஐந்தாவது எண்ணிக்கையை அறிவிப்பதற்கு முன்பு நீங்கள் 3 கற்களை வைக்க வேண்டும்.

# validation.renju.YAMAGUCHI1_TENTATIVE
source: Declare the number of tentative fifths.
ta: தற்காலிக ஐந்தில் எண்ணிக்கையை அறிவிக்கவும்.

# validation.renju.YAMAGUCHI1_TENTATIVE_COUNT_EXCEED
source: The number of tentative fifths must be at most 12.
ta: தற்காலிக ஐந்தாவது எண்ணிக்கை அதிகபட்சமாக இருக்க வேண்டும்.

# validation.renju.YAMAGUCHI3_EXCESS
source: You may only place 1 tentative fifth.
ta: நீங்கள் 1 தற்காலிக ஐந்தாவது மட்டுமே வைக்கலாம்.

# validation.renju.YAMAGUCHI3_MORE
source: Place one more tentative fifth.
ta: இன்னும் ஒரு தற்காலிக ஐந்தாவது வைக்கவும்.

# validation.renju.YAMAGUCHI4_CHOOSE
source: You have to choose the one tentative fifth.
ta: நீங்கள் ஒரு தற்காலிக ஐந்தாவது தேர்வு செய்ய வேண்டும்.

# validation.renju.YAMAGUCHI4_EXCESS
source: You have too many items in your move.
ta: உங்கள் நகர்வில் அதிகமான உருப்படிகள் உள்ளன.

# validation.renju.YAMAGUCHI42
source: Select an intersection to place the sixth stone.
ta: ஆறாவது கல்லை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும்.

# validation.resolve.INITIAL_INSTRUCTIONS
source: Select an intersection to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும்.

# validation.resolve.INITIAL_INSTRUCTIONS_SWAP
source: Select a piece in a crosscut to swap.
ta: இடமாற்றம் செய்ய ஒரு குறுக்குவழியில் ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.resolve.CHOOSE_OWN
source: You must choose one of your own pieces in a crosscut to swap.
ta: இடமாற்றம் செய்ய உங்கள் சொந்த துண்டுகளில் ஒன்றை குறுக்குவழியில் தேர்வு செய்ய வேண்டும்.

# validation.resolve.CANNOT_SWAP
source: The piece at {{where}} is not in a crosscut.
ta: {{where}} at இல் உள்ள துண்டு ஒரு குறுக்குவழியில் இல்லை.

# validation.resolve.SWAP
source: Select a piece in the crosscut to swap.
ta: இடமாற்றம் செய்ய குறுக்குவழியில் ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.resolve.INVALID_SWAP
source: The piece at {{from}} cannot swap to {{to}}.
ta: } For} க்கு இல் உள்ள துண்டு {{from}} வரை இடமாற்றம் செய்ய முடியாது.

# validation.reversi.CENTRE_CELL
source: In the hexagon variant, the centre cell cannot be placed on.
ta: அறுகோண மாறுபாட்டில், மைய கலத்தை வைக்க முடியாது.

# validation.reversi.CORNER_CELL
source: In the octagon variant, the corner cells cannot be placed on.
ta: எண்கோண மாறுபாட்டில், மூலையில் செல்களை வைக்க முடியாது.

# validation.reversi.ILLEGAL_PASS
source: You may only pass if you have no legal moves.
ta: உங்களிடம் சட்டப்பூர்வ நகர்வுகள் இல்லையென்றால் மட்டுமே நீங்கள் கடந்து செல்ல முடியும்.

# validation.reversi.INITIAL_INSTRUCTIONS
source: Select a cell to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.reversi.INVALID_MOVE
source: You may only place a piece where it will flip at least one of your opponent's pieces.
ta: உங்கள் எதிரியின் துண்டுகளில் ஒன்றையாவது புரட்டும் ஒரு பகுதியை மட்டுமே நீங்கள் வைக்கலாம்.

# validation.rootbound.BAD_SECOND_MOVE
source: You must start by making a second group as soon as possible.
ta: இரண்டாவது குழுவை விரைவில் உருவாக்குவதன் மூலம் நீங்கள் தொடங்க வேண்டும்.

# validation.rootbound.CLAIMED_CELL
source: You may not place a piece into a claimed territory.
ta: நீங்கள் ஒரு பகுதியை ஒரு உரிமை கோரப்பட்ட பிரதேசத்தில் வைக்கக்கூடாது.

# validation.rootbound.FIRST_MOVE_INSTRUCTIONS
source: Place a piece anywhere on the board.
ta: பலகையில் எங்கும் ஒரு துண்டு வைக்கவும்.

# validation.rootbound.INITIAL_INSTRUCTIONS
source: Place one or two pieces on an unclaimed empty space. Your pieces may not form a small triangle nor can you grow a group in a straight line from an existing piece.
ta: உரிமை கோரப்படாத வெற்று இடத்தில் ஒன்று அல்லது இரண்டு துண்டுகளை வைக்கவும். உங்கள் துண்டுகள் ஒரு சிறிய முக்கோணத்தை உருவாக்காது அல்லது ஏற்கனவே இருக்கும் துண்டிலிருந்து ஒரு குழுவை ஒரு குழுவை வளர்க்க முடியாது.

# validation.rootbound.RAPID_GROWTH
source: You cannot grow a group in a straight line from an existing piece in a single turn.
ta: ஒரே திருப்பத்தில் ஏற்கனவே இருக்கும் துண்டிலிருந்து ஒரு குழுவை ஒரு நேர் கோட்டில் வளர்க்க முடியாது.

# validation.rootbound.SECOND_MOVE_INSTRUCTIONS
source: Place one or two pieces on empty spaces. You must make a second group as soon as possible.
ta: ஒன்று அல்லது இரண்டு துண்டுகளை வெற்று இடைவெளிகளில் வைக்கவும். நீங்கள் விரைவில் இரண்டாவது குழுவை உருவாக்க வேண்டும்.

# validation.rootbound.TOO_FEW_GROUPS
source: You cannot end a turn with only one group unless it claims territory.
ta: ஒரே ஒரு குழு பிரதேசத்திற்கு உரிமை கோராவிட்டால் நீங்கள் ஒரு திருப்பத்தை முடிக்க முடியாது.

# validation.rootbound.TOO_MANY_NEIGHBORS
source: Your pieces cannot form a small triangle.
ta: உங்கள் துண்டுகள் ஒரு சிறிய முக்கோணத்தை உருவாக்க முடியாது.

# validation.saltire.EMPTY_FROM
source: You are indicating to swap but there is no piece at {{where}}.
ta: நீங்கள் இடமாற்றம் செய்வதைக் குறிக்கிறீர்கள், ஆனால் {{where}} இல் எந்த துண்டு இல்லை.

# validation.saltire.INITIAL_INSTRUCTIONS
source: Select a point to place a piece, or select a piece to swap.
ta: ஒரு துண்டு வைக்க ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும் அல்லது இடமாற்றம் செய்ய ஒரு துண்டைத் தேர்ந்தெடுக்கவும்.

# validation.saltire.INVALID_SWAP
source: Swapping {{from}} with {{to}} is not valid.
ta: }} இலிருந்து {{from} with வரை {{இடமாற்றம் செய்யப்படுவது செல்லுபடியாகாது.

# validation.saltire.NO_SWAPPABLE
source: The piece at {{where}} cannot make a swap with any adjacent piece to reduce the number of crosscuts or supercuts.
ta: {{{where}}}} குறுக்குவழிகள் அல்லது சூப்பர் குறுகல்களின் எண்ணிக்கையைக் குறைக்க அருகிலுள்ள துண்டுடன் இடமாற்றம் செய்ய முடியாது.

# validation.saltire.NORMALISE
source: The move needs to be normalised. Try {{normalised}}.
ta: நகர்வை இயல்பாக்க வேண்டும். {{normalised}} ஐ முயற்சிக்கவும்.

# validation.saltire.SELECT_TO
source: Select an adjacent piece to swap with.
ta: உடன் இடமாற்றம் செய்ய அருகிலுள்ள பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.scaffold.INCOMPLETE
source: You need to place stones to connect the groups.
ta: குழுக்களை இணைக்க நீங்கள் கற்களை வைக்க வேண்டும்.

# validation.scaffold.INITIAL_INSTRUCTIONS
source: Select a point to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும்.
