Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.connecticut.INITIAL_INSTRUCTIONS_FIRST
source: Select a vertex to place a piece. You may not place a triomino on the first move.
ta: ஒரு துண்டு வைக்க ஒரு வெர்டெக்சைத் தேர்ந்தெடுக்கவும். முதல் நகர்வில் நீங்கள் ஒரு ட்ரியோமினோவை வைக்கக்கூடாது.

# validation.connecticut.INVALID_TO
source: You may not place a triomino at {{from}}-{{to}}.
ta: }}-{{from} இருந்து வரை {{என்ற எண்ணில் நீங்கள் ஒரு ட்ரியோமினோவை வைக்கக்கூடாது.

# validation.connecticut.NORMALISE
source: The move needs to be normalised. Try {{normalised}}.
ta: நகர்வை இயல்பாக்க வேண்டும். {{normalised}} ஐ முயற்சிக்கவும்.

# validation.connecticut.PARTIAL
source: You may select another vertex to complete a 1x3 triomino, or complete the move to finish your turn with the single piece.
ta: 1x3 ட்ரியோமினோவை முடிக்க நீங்கள் மற்றொரு வெர்டெக்சைத் தேர்ந்தெடுக்கலாம் அல்லது ஒற்றை துண்டுடன் உங்கள் திருப்பத்தை முடிக்க நகர்வை முடிக்கலாம்.

# validation.connections.INITIAL_INSTRUCTIONS
source: Select a space between your dots to draw a line.
ta: ஒரு வரியை வரைய உங்கள் புள்ளிகளுக்கு இடையில் ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.connections.INVALID_LINE
source: The line {{move}} is not valid.
ta: {{move}} வரி செல்லுபடியாகாது.

# validation.connections.OCCUPIED
source: The space at {{where}} is already occupied.
ta: {{where} at இல் உள்ள இடம் ஏற்கனவே ஆக்கிரமிக்கப்பட்டுள்ளது.

# validation.connections.WRONG_ORIENT_H
source: The line at {{cell}} should be horizontal (suffixed with 'h').
ta: {{cell} at இல் உள்ள வரி கிடைமட்டமாக இருக்க வேண்டும் ('H' உடன் பின்னொட்டு).

# validation.connections.WRONG_ORIENT_V
source: The line at {{cell}} should be vertical (suffixed with 'v').
ta: {{cell} at இல் உள்ள வரி செங்குத்தாக இருக்க வேண்டும் ('V' உடன் பின்னொட்டு).

# validation.conspirateurs.BAD_MOVE
source: You may not move from {{from}} to {{to}}.
ta: நீங்கள் {{from}} வரை {{to}} வரை செல்லக்கூடாது.

# validation.conspirateurs.BAD_PASS
source: You may not pass as long as you have valid moves available.
ta: நீங்கள் சரியான நகர்வுகள் கிடைக்கும் வரை நீங்கள் கடந்து செல்லக்கூடாது.

# validation.conspirateurs.BAD_PLACE
source: In the setup phase, pieces must be placed on unoccupied spaces in the drop zone (the marked area in the centre of the board).
ta: அமைவு கட்டத்தில், துளி மண்டலத்தில் (பலகையின் மையத்தில் குறிக்கப்பட்ட பகுதி) பயன்படுத்தப்படாத இடங்களில் துண்டுகள் வைக்கப்பட வேண்டும்.

# validation.conspirateurs.INITIAL_INSTRUCTIONS_drop
source: Select an empty space in the drop zone to place one of your pieces.
ta: உங்கள் துண்டுகளில் ஒன்றை வைக்க துளி மண்டலத்தில் வெற்று இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.conspirateurs.INITIAL_INSTRUCTIONS_move
source: Select one of your pieces not already in a sanctuary to start to move.
ta: நகர்த்தத் தொடங்க ஏற்கனவே ஒரு சரணாலயத்தில் இல்லாத உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.conspirateurs.SAFE
source: You may not move pieces that have reached sanctuaries.
ta: சரணாலயங்களை அடைந்த துண்டுகளை நீங்கள் நகர்த்தக்கூடாது.

# validation.control.FIRST_TURN_INSTRUCTIONS
source: Place a piece on a space on the perimeter of the board.
ta: பலகையின் சுற்றளவில் ஒரு இடத்தில் ஒரு துண்டு வைக்கவும்.

# validation.control.INITIAL_INSTRUCTIONS
source: Place a piece on a space the opponent does not control, or remove an opponent's piece on a space you control.
ta: எதிராளி கட்டுப்படுத்தாத ஒரு இடத்தில் ஒரு பகுதியை வைக்கவும், அல்லது நீங்கள் கட்டுப்படுத்தும் இடத்தில் எதிராளியின் பகுதியை அகற்றவும்.

# validation.control.INSUFFICIENT_CONTROL
source: You do not control {{cell}}.
ta: {{cell}} ஐ நீங்கள் கட்டுப்படுத்தவில்லை.

# validation.control.OPPONENT_CONTROL
source: Your opponent controls {{cell}}.
ta: உங்கள் எதிர்ப்பாளர் {{cell}} ஐ கட்டுப்படுத்துகிறார்.

# validation.courtesan.DISTANCE_ONE
source: Pieces may only move one space at a time.
ta: துண்டுகள் ஒரு நேரத்தில் ஒரு இடத்தை மட்டுமே நகர்த்தக்கூடும்.

# validation.courtesan.INITIAL_INSTRUCTIONS
source: Select one of your pieces to move.
ta: நகர்த்த உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.courtesan.INVALID_DIR
source: Noncapturing moves and exchanges may only happen in the forward direction.
ta: சமாதானமற்ற நகர்வுகள் மற்றும் பரிமாற்றங்கள் முன்னோக்கி திசையில் மட்டுமே நிகழக்கூடும்.

# validation.courtesan.INVALID_EXCHANGE
source: Only kings may exchange, and they must transfer to a courtesan.
ta: மன்னர்கள் மட்டுமே பரிமாறிக்கொள்ளலாம், அவர்கள் ஒரு வேசிக்கு மாற்ற வேண்டும்.

# validation.crossway.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.crossway.INITIAL_INSTRUCTIONS
source: Select a point to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும்.

# validation.crossway.NO_CROSSINGS
source: Lines may not cross.
ta: கோடுகள் கடக்காமல் இருக்கலாம்.

# validation.cubeo.BAD_MERGE
source: You may only merge when you have at least three dice in the formation, and you may not remove a pinned die or a die that cannot be slid out of the formation.
ta: நீங்கள் உருவாக்கத்தில் குறைந்தது மூன்று பகடிகளைக் கொண்டிருக்கும்போது மட்டுமே நீங்கள் ஒன்றிணைக்க முடியும், மேலும் நீங்கள் ஒரு பின் -இறப்பு அல்லது இறப்பை அகற்றக்கூடாது.

# validation.cubeo.BAD_MOVE_standard
source: When moving, the die must move its full distance (though it may backtrack at any point), end in a space that keeps the formation connected, and may not end where it started.
ta: நகரும் போது, டை அதன் முழு தூரத்தை நகர்த்த வேண்டும் (அது எந்த நேரத்திலும் பின்வாங்கக்கூடும் என்றாலும்), உருவாக்கத்தை இணைக்கும் ஒரு இடத்தில் முடிவடையும், அது தொடங்கிய இடத்தை முடிக்கக்கூடாது.

# validation.cubeo.BAD_MOVE_strict
source: When moving, the die must move its full distance (though it may backtrack at any point), end in a space that keeps the formation connected, and it must change the formation (meaning you can't move such that you simply create a rotation or reflection of the starting formation).
ta: நகரும் போது, இறப்பு அதன் முழு தூரத்தை நகர்த்த வேண்டும் (அது எந்த நேரத்திலும் பின்வாங்கக்கூடும் என்றாலும்), உருவாக்கத்தை இணைக்கும் ஒரு இடத்தில் முடிவடையும், மேலும் அது உருவாக்கத்தை மாற்ற வேண்டும் (அதாவது நீங்கள் நகர்த்த முடியாது, நீங்கள் ஒரு சுழற்சியை உருவாக்குவது அல்லது தொடக்க உருவாக்கத்தின் பிரதிபலிப்பை உருவாக்குகிறீர்கள்).

# validation.cubeo.BAD_PLACE
source: You may only place new dice such that they share an edge with at least one of your own dice and do not share *any* edges with opposing dice. The die must also be able to be slid into the formation from the outside.
ta: நீங்கள் புதிய பகடைகளை மட்டுமே வைக்கலாம், அவர்கள் உங்கள் சொந்த பகடைகளில் குறைந்தபட்சம் ஒரு விளிம்பைப் பகிர்ந்து கொள்கிறார்கள், மேலும் எதிரெதிர் பகடைகளுடன் * எந்த * விளிம்புகளையும் பகிர்ந்து கொள்ள வேண்டாம். இறப்பு வெளியில் இருந்து உருவாவதற்கு நழுவ முடியும்.

# validation.cubeo.INITIAL_INSTRUCTIONS
source: Click an empty cell to place a new die, or one of your own dice to start a move or merge.
ta: புதிய இறப்பை வைக்க வெற்று கலத்தைக் சொடுக்கு செய்க, அல்லது உங்கள் சொந்த பகடை ஒன்றில் ஒன்று அல்லது ஒன்றிணைக்க.

# validation.cubeo.MAX_DICE
source: You may only have {{dice}} dice on the board.
ta: நீங்கள் பலகையில் {{dice}} பகடை மட்டுமே வைத்திருக்கலாம்.

# validation.cubeo.PINNED
source: Pinned dice can't act.
ta: பின் செய்யப்பட்ட பகடை செயல்பட முடியாது.

# validation.dagnacht.INITIAL_INSTRUCTIONS
source: Place a piece on a dark square or move a piece one square orthogonally.
ta: ஒரு இருண்ட சதுரத்தில் ஒரு துண்டு வைக்கவும் அல்லது ஒரு சதுரத்தை ஆர்த்தோகனலாக நகர்த்தவும்.

# validation.dagnacht.MOVE_EMPTY
source: There is no piece at {{where}} to move.
ta: {{where}} நகர்த்த எந்த துண்டு இல்லை.

# validation.dagnacht.MOVE_OCCUPIED
source: You can only move a piece to an empty square. There is already a piece at {{where}}.
ta: நீங்கள் ஒரு பகுதியை வெற்று சதுரத்திற்கு மட்டுமே நகர்த்த முடியும். ஏற்கனவே {{where}} இல் ஒரு துண்டு உள்ளது.

# validation.dagnacht.NOT_BLACK
source: You can only place pieces on dark squares.
ta: நீங்கள் இருண்ட சதுரங்களில் மட்டுமே துண்டுகளை வைக்க முடியும்.

# validation.dagnacht.NOT_ORTH_ADJ
source: You can only move pieces one square orthogonally.
ta: நீங்கள் ஒரு சதுர ஆர்த்தோகனலாக மட்டுமே துண்டுகளை நகர்த்த முடியும்.

# validation.dagnacht.OCCUPIED
source: You must place a piece on an empty square. There is already a piece at {{where}}.
ta: நீங்கள் வெற்று சதுரத்தில் ஒரு துண்டு வைக்க வேண்டும். ஏற்கனவே {{where}} இல் ஒரு துண்டு உள்ளது.

# validation.dagnacht.PARTIAL_MOVE
source: Looks like you would like to move the piece at {{cell}}. Provide the destination.
ta: நீங்கள் துண்டுகளை {{cell} at இல் நகர்த்த விரும்புகிறீர்கள் என்று தெரிகிறது. இலக்கை வழங்கவும்.

# validation.dagnacht.TOO_MANY
source: You can only move one piece one space
ta: நீங்கள் ஒரு துண்டு ஒரு இடத்தை மட்டுமே நகர்த்த முடியும்

# validation.dameo.INITIAL_INSTRUCTIONS
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.dameo.INVALID_MOVE
source: Remember that capturing is compulsory, as is capturing the maximum number of pieces. Movement can only happen in a forward direction, and captures can only happen orthogonally.
ta: கைப்பற்றுவது கட்டாயமானது என்பதை நினைவில் கொள்ளுங்கள், அதிகபட்ச எண்ணிக்கையிலான துண்டுகளைப் பிடிப்பது போல. இயக்கம் முன்னோக்கி திசையில் மட்டுமே நிகழும், மேலும் பிடிப்புகள் ஆர்த்தோகனலாக மட்டுமே நிகழும்.

# validation.dameo.VALID_PARTIAL
source: Looks good so far. Select the next empty cell to move to.
ta: இதுவரை நன்றாக இருக்கிறது. செல்ல அடுத்த வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.diffusion.INITIAL_INSTRUCTIONS
source: Select any pit to sow.
ta: விதைக்க எந்த குழியையும் தேர்ந்தெடுக்கவும்.

# validation.dipole.FORWARD
source: Noncapturing movement must be in a forward direction.
ta: கைப்பற்றாத தருணங்கள் முன்னோக்கி திசையில் இருக்க வேண்டும்.

# validation.dipole.INITIAL_INSTRUCTIONS
source: Select one of your own stacks.
ta: உங்கள் சொந்த அடுக்குகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.dipole.INVALID_PASS
source: You may not pass if you have other valid moves.
ta: உங்களிடம் வேறு செல்லுபடியாகும் நகர்வுகள் இருந்தால் நீங்கள் கடந்து செல்லக்கூடாது.

# validation.dipole.MERGE4CAPTURE
source: You signalled a merge, but the destination is occupied by enemy pieces.
ta: நீங்கள் ஒரு ஒன்றிணைப்பைக் குறிக்கிறது, ஆனால் இலக்கு எதிரி துண்டுகளால் ஆக்கிரமிக்கப்பட்டுள்ளது.

# validation.dipole.MERGE4MOVE
source: You signalled a merge, but the destination is empty.
ta: நீங்கள் ஒரு ஒன்றிணைப்பைக் குறிக்கிறது, ஆனால் இலக்கு காலியாக உள்ளது.

# validation.dipole.MOVE4MERGE
source: You signalled a move, but the destination already contains some of your own pieces.
ta: நீங்கள் ஒரு நகர்வை அடையாளம் காட்டினீர்கள், ஆனால் இலக்கு ஏற்கனவே உங்கள் சொந்த துண்டுகள் சிலவற்றைக் கொண்டுள்ளது.

# validation.dipole.NOTDARKSQUARE
source: You can only play on the dark squares.
ta: நீங்கள் இருண்ட சதுரங்களில் மட்டுமே விளையாட முடியும்.

# validation.dipole.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.dipole.STACK_SIZE
source: You may only capture stacks of equal or smaller size.
ta: நீங்கள் சமமான அல்லது சிறிய அளவிலான அடுக்குகளை மட்டுமே கைப்பற்றலாம்.

# validation.dipole.TOOFAR
source: You can only move as far as your stack is high.
ta: உங்கள் அடுக்கு அதிகமாக இருக்கும் வரை மட்டுமே நீங்கள் நகர முடியும்.

# validation.dipole.TOOFAR_edge
source: The stack at {{from}} can't reach the edge from there.
ta: } இருந்து க்கு {{at இல் உள்ள அடுக்கு அங்கிருந்து விளிம்பை அடைய முடியாது.

# validation.dragoneyes.INITIAL_INSTRUCTIONS_CAPTURE
source: Click a piece/space with a dot to begin or continue a capture chain.
ta: தொடங்குவதற்கு ஒரு புள்ளியுடன் ஒரு துண்டு/இடத்தைக் சொடுக்கு செய்க அல்லது பிடிப்பு சங்கிலியைத் தொடரவும்.

# validation.dragoneyes.INITIAL_INSTRUCTIONS_ONE
source: Click a gray piece to flip and reveal the owner.
ta: புரட்டவும், உரிமையாளரை வெளிப்படுத்தவும் ஒரு சாம்பல் துண்டைக் சொடுக்கு செய்க.

# validation.dragoneyes.INITIAL_INSTRUCTIONS_TWO
source: Select one of your pieces to move. Then click a space with a dot to choose where to move.
ta: நகர்த்த உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும். எங்கு நகர்த்த வேண்டும் என்பதைத் தேர்வுசெய்ய புள்ளியுடன் ஒரு இடத்தைக் சொடுக்கு செய்க.

# validation.emu.INITIAL_INSTRUCTIONS
source: Select a card from your hand to place on the board.
ta: பலகையில் இடத்திற்கு உங்கள் கையில் இருந்து ஒரு அட்டையைத் தேர்ந்தெடுக்கவும்.

# validation.emu.SELECT_DEST
source: Select the plus sign to add the card to an existing bird or to hatch a new one, or click the discard pile to discard the card.
ta: ஏற்கனவே உள்ள பறவையில் கார்டைச் சேர்க்க அல்லது புதியதை அடைக்க பிளச் அடையாளத்தைத் தேர்ந்தெடுக்கவும் அல்லது அட்டையை நிராகரிக்க நிராகரிக்கப்பட்ட குவியலைக் சொடுக்கு செய்யவும்.

# validation.emu.SELECT_SRC
source: Click the draw deck to draw a face-down card, or click the face-up card in the discard pile to draw it instead.
ta: ஃபேச்-டவுன் கார்டை வரைய டிரா டெக்கைக் சொடுக்கு செய்க, அல்லது அதற்கு பதிலாக வரைய நிராகரிக்கப்பட்ட குவியலில் உள்ள முகம்-அப் கார்டைக் சொடுக்கு செய்க.

# validation.entrapment.BARRIER_EXISTS
source: There is already a barrier at {{where}}.
ta: {{where}} இல் ஏற்கனவே ஒரு தடை உள்ளது.

# validation.entrapment.CHOOSE_SPARE
source: There are more than one roamers in forced positions at {{where}}. Select which one to retain.
ta: {{where}} இல் கட்டாய நிலைகளில் ஒன்றுக்கு மேற்பட்ட ரோமர்கள் உள்ளனர். எதைத் தக்க வைத்துக் கொள்ள வேண்டும் என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.entrapment.ENDED
source: The game has already ended because one player has run out of roamers.
ta: ஒரு வீரர் ரோமர்களால் முடிந்துவிட்டதால் விளையாட்டு ஏற்கனவே முடிந்துவிட்டது.

# validation.entrapment.FORCED_FREE
source: You have to relieve the roamer at {{where}} if you are making a movement action.
ta: நீங்கள் ஒரு இயக்க செயலைச் செய்கிறீர்கள் என்றால் {}} இல் நீங்கள் ரோமரை விடுவிக்க வேண்டும்.

# validation.entrapment.INITIAL_INSTRUCTIONS
source: Select a roamer to move.
ta: நகர்த்த ஒரு ரோமரைத் தேர்ந்தெடுக்கவும்.

# validation.entrapment.INITIAL_INSTRUCTIONS_FIRST
source: Select a roamer to move or select an edge to place a barrier.
ta: நகர்த்த ஒரு ரோமரைத் தேர்ந்தெடுக்கவும் அல்லது ஒரு தடையை வைக்க ஒரு விளிம்பைத் தேர்ந்தெடுக்கவும்.

# validation.entrapment.INITIAL_INSTRUCTIONS_FORCED
source: The roamer at {{where}} is in a forced position. Your first action must be to relieve it.
ta: {{இல் உள்ள ரோமர் ஒரு கட்டாய நிலையில் உள்ளது. உங்கள் முதல் நடவடிக்கை அதை அகற்ற வேண்டும்.

# validation.entrapment.INITIAL_INSTRUCTIONS_SETUP
source: Select a space to place a roamer
ta: ரோமரை வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்

# validation.entrapment.INVALID_BARRIER
source: The edge at {{where}} is not a valid edge.
ta: {{}} இல் உள்ள விளிம்பு செல்லுபடியாகும் விளிம்பு அல்ல.

# validation.entrapment.INVALID_SPARE
source: You must choose one of the roamers at {{where}} to retain.
ta: தக்கவைக்க நீங்கள் {{}} இல் ரோமர்களில் ஒருவரைத் தேர்வு செய்ய வேண்டும்.

# validation.entrapment.INVALID_TO
source: You may not move the roamer from {{from}} to {{to}}.
ta: நீங்கள் {{from}} முதல் {{to}} வரை ரோமரை நகர்த்தக்கூடாது.

# validation.entrapment.MISSING_DASH
source: To indicate movement, use a '-' followed by where you wish to move to.
ta: இயக்கத்தைக் குறிக்க, நீங்கள் செல்ல விரும்பும் இடத்தைத் தொடர்ந்து ஒரு '-' ஐப் பயன்படுத்தவும்.

# validation.entrapment.MOVE_FIRST
source: You must move a roamer first.
ta: நீங்கள் முதலில் ஒரு ரோமரை நகர்த்த வேண்டும்.

# validation.entrapment.NO_SPARE
source: You do not need to select any roamer to retain.
ta: தக்கவைக்க நீங்கள் எந்த ரோமரையும் தேர்ந்தெடுக்க தேவையில்லை.

# validation.entrapment.NONEXISTENT_BARRIER
source: There is no barrier at {{where}} to move.
ta: {{where}} நகர்த்த எந்த தடையும் இல்லை.

# validation.entrapment.SECOND_ACTION
source: Select a roamer to move or select an edge to place a barrier.
ta: நகர்த்த ஒரு ரோமரைத் தேர்ந்தெடுக்கவும் அல்லது ஒரு தடையை வைக்க ஒரு விளிம்பைத் தேர்ந்தெடுக்கவும்.

# validation.entrapment.SECOND_ACTION_MOVE_WALL
source: Select a roamer to move or select a barrier to move to another edge.
ta: நகர்த்த ஒரு ரோமரைத் தேர்ந்தெடுக்கவும் அல்லது மற்றொரு விளிம்பிற்கு செல்ல ஒரு தடையைத் தேர்ந்தெடுக்கவும்.

# validation.entrapment.SELECT_TO_BARRIER
source: Select an edge to move the barrier to.
ta: தடையை நகர்த்த ஒரு விளிம்பைத் தேர்ந்தெடுக்கவும்.

# validation.entrapment.SELECT_TO_PIECE
source: Select a space to move the roamer to.
ta: ரோமரை நகர்த்த ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.entrapment.STILL_HAVE_BARRIERS
source: You are indicating a barrier movement with '-', but you still have barriers in your stash.
ta: '-' உடன் ஒரு தடை இயக்கத்தை நீங்கள் குறிக்கிறீர்கள், ஆனால் உங்கள் ச்டாசில் இன்னும் தடைகள் உள்ளன.

# validation.entrapment.TOO_MANY_ACTIONS
source: You may only perform two actions per turn.
ta: நீங்கள் ஒரு திருப்பத்திற்கு இரண்டு செயல்களை மட்டுமே செய்ய முடியும்.

# validation.entrapment.TOO_MANY_ACTIONS_FIRST
source: You may only perform one action on the first move after the setup phase.
ta: அமைவு கட்டத்திற்குப் பிறகு முதல் நகர்வில் மட்டுமே நீங்கள் ஒரு செயலைச் செய்ய முடியும்.

# validation.entrapment.UNCONTROLLED_BARRIER
source: You may only move barriers that you control.
ta: நீங்கள் கட்டுப்படுத்தும் தடைகளை மட்டுமே நீங்கள் நகர்த்த முடியும்.

# validation.entropy.INITIAL_INSTRUCTIONS_chaos
source: Select an empty cell on your opponent's board to place the next piece.
ta: அடுத்த பகுதியை வைக்க உங்கள் எதிரியின் குழுவில் ஒரு வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.entropy.INITIAL_INSTRUCTIONS_order
source: Select a piece on your board to move, or pass.
ta: நகர்த்த அல்லது கடந்து செல்ல உங்கள் போர்டில் ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.entropy.INVALID_MOVEMENT
source: You cannot move pieces in the CHAOS phase.
ta: குழப்பமான கட்டத்தில் நீங்கள் துண்டுகளை நகர்த்த முடியாது.

# validation.entropy.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.entropy.STRAIGHT_LINES
source: Pieces may only be moved in straight horizontal or vertical lines.
ta: துண்டுகள் நேராக கிடைமட்ட அல்லது செங்குத்து கோடுகளில் மட்டுமே நகர்த்தப்படலாம்.

# validation.epam.INITIAL_INSTRUCTIONS_move
source: Select the tail of the phalanx you wish to move.
ta: நீங்கள் நகர்த்த விரும்பும் ஃபாலங்கின் வால் என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.epam.INITIAL_INSTRUCTIONS_stones
source: Place a stone in an empty space in the middle six rows.
ta: நடுத்தர ஆறு வரிசைகளில் வெற்று இடத்தில் ஒரு கல்லை வைக்கவும்.

# validation.epam.INSUFFICIENT_FORCES
source: When capturing, your phalanx must have more pieces than the captured phalanx.
ta: கைப்பற்றும்போது, உங்கள் ஃபாலங்க்சைப் பிடிக்கப்பட்ட ஃபாலங்க்சை விட அதிகமான துண்டுகள் இருக்க வேண்டும்.

# validation.epam.NOPLACEMENT
source: You may only place pieces in the 'Stumbling Blocks' variant, when there are fewer than three stones already placed.
ta: ஏற்கனவே வைக்கப்பட்டுள்ள மூன்று கற்களுக்கு குறைவாக இருக்கும்போது, 'தடுமாற்றங்கள்' மாறுபாட்டில் மட்டுமே நீங்கள் துண்டுகளை வைக்கலாம்.

# validation.epam.PARTIAL
source: Select where you want the *head* of the phalanx to end its movement.
ta: ஃபாலன்க்சின் * தலை * அதன் இயக்கத்தை முடிவுக்கு கொண்டுவர விரும்பும் இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.epam.STONES
source: Stones can only be placed in the middle six rows.
ta: கற்களை நடுத்தர ஆறு வரிசைகளில் மட்டுமே வைக்க முடியும்.

# validation.epam.STRAIGHTLINE
source: You can only move in straight lines.
ta: நீங்கள் நேர் கோடுகளில் மட்டுமே செல்ல முடியும்.

# validation.epam.TOOFAR
source: The phalanx {{tail}}-{{head}} cannot move {{distance}} spaces.
ta: ஃபாலன்க்ச் {{tail}}-{{head}} {{distance}} இடைவெளிகளை நகர்த்த முடியாது.

# validation.exxit.INITIAL_INSTRUCTIONS_build
source: Click on any unoccupied tile to place a checker, or click on a valid perimeter space to start enlarging the world.
ta: ஒரு செக்கரை வைக்க எந்த காலியாக இல்லாத ஓடு என்பதைக் சொடுக்கு செய்க, அல்லது உலகத்தை விரிவுபடுத்தத் தொடங்க சரியான சுற்றளவு இடத்தைக் சொடுக்கு செய்க.

# validation.exxit.INITIAL_INSTRUCTIONS_destroy
source: A destruction move is available and must be taken. Click on one of your stacks to start.
ta: ஒரு அழிவு நடவடிக்கை கிடைக்கிறது மற்றும் எடுக்கப்பட வேண்டும். தொடங்க உங்கள் அடுக்குகளில் ஒன்றைக் சொடுக்கு செய்க.

# validation.exxit.INITIAL_INSTRUCTIONS_setup
source: Select a perimeter space to place one of your tiles.
ta: உங்கள் ஓடுகளில் ஒன்றை வைக்க ஒரு சுற்றளவு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.exxit.INVALID_MOVE
source: Click a stack you control to start a destruction dance. Otherwise, click an empty tile to place a checker or click a qualifying perimeter space to enlarge the world.
ta: அழிவு நடனத்தைத் தொடங்க நீங்கள் கட்டுப்படுத்தும் அடுக்கைக் சொடுக்கு செய்க. இல்லையெனில், ஒரு செக்கரை வைக்க வெற்று ஓடு என்பதைக் சொடுக்கு செய்க அல்லது உலகத்தை பெரிதாக்க ஒரு தகுதிவாய்ந்த சுற்றளவு இடத்தைக் சொடுக்கு செய்க.

# validation.exxit.VALID_PARTIAL_dod
source: Select the cell where you will end your move. You have multiple options.
ta: உங்கள் நகர்வை நீங்கள் முடிக்கும் கலத்தைத் தேர்ந்தெடுக்கவும். உங்களிடம் பல விருப்பங்கள் உள்ளன.

# validation.exxit.VALID_PARTIAL_enlargement
source: Multiple continuations are possible from this tile. Please select the next tile to claim.
ta: இந்த ஓடுகளிலிருந்து பல தொடர்ச்சிகள் சாத்தியமாகும். உரிமை கோர அடுத்த ஓடு என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.fabrik.INITIAL_INSTRUCTIONS_first
source: Select a cell in sight to place a piece, or you can pass if your opponent just placed the second worker.
ta: ஒரு துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும், அல்லது உங்கள் எதிர்ப்பாளர் இரண்டாவது தொழிலாளியை வைத்திருந்தால் நீங்கள் கடந்து செல்லலாம்.

# validation.fabrik.INITIAL_INSTRUCTIONS_fresh
source: Place a worker in an empty cell.
ta: ஒரு தொழிலாளியை வெற்று கலத்தில் வைக்கவும்.

# validation.fabrik.INITIAL_INSTRUCTIONS_inprogress
source: Select a worker to move, or select an empty cell in sight to place a piece.
ta: நகர்த்த ஒரு தொழிலாளியைத் தேர்ந்தெடுக்கவும் அல்லது ஒரு துண்டு வைக்க ஒரு வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.fabrik.INVALID_PASS
source: You may only pass the turn immediately after the second worker has been placed.
ta: இரண்டாவது தொழிலாளி வைக்கப்பட்ட உடனேயே நீங்கள் திருப்பத்தை கடக்க முடியும்.

# validation.fabrik.INVALID_PLACEMENT
source: The cell {{where}} is not visible to both workers.
ta: செல் {{where}} இரு தொழிலாளர்களுக்கும் தெரியவில்லை.

# validation.fabrik.MUST_PASS_PLAY
source: The first turn after the second worker has been placed must be a pass or placement.
ta: இரண்டாவது தொழிலாளி வைக்கப்பட்ட பிறகு முதல் திருப்பம் ஒரு பாச் அல்லது வேலைவாய்ப்பாக இருக்க வேண்டும்.

# validation.fabrik.NOPLACEMENTS
source: You cannot move the workers such that you have no valid placements available.
ta: உங்களிடம் சரியான வேலைவாய்ப்புகள் இல்லாத தொழிலாளர்களை நீங்கள் நகர்த்த முடியாது.

# validation.fabrik.PARTIAL_MOVE
source: Provide the destination.
ta: இலக்கை வழங்கவும்.

# validation.fabrik.PARTIAL_PLACE
source: Choose a cell to place a piece in.
ta: ஒரு பகுதியை வைக்க ஒரு கலத்தைத் தேர்வுசெய்க.

# validation.fanorona.ADJACENT
source: Pieces may only move to adjacent empty spaces.
ta: துண்டுகள் அருகிலுள்ள வெற்று இடங்களுக்கு மட்டுமே செல்லக்கூடும்.

# validation.fanorona.BAD_PAIKA
source: You have capture moves available. You may not make a noncapturing move.
ta: உங்களிடம் பிடிப்பு நகர்வுகள் உள்ளன. நீங்கள் ஒரு உறவற்ற நடவடிக்கையை மேற்கொள்ளக்கூடாது.

# validation.fanorona.DISAMBIGUATE
source: You may not make further moves until you have selected a capture type for the previous move.
ta: முந்தைய நகர்வுக்கான பிடிப்பு வகையைத் தேர்ந்தெடுக்கும் வரை நீங்கள் மேலும் நகர்வுகளைச் செய்யக்கூடாது.

# validation.fanorona.EXPLICIT_CAPTURE
source: Each capture type must be explicitly stated. If you are clicking, then click the first enemy piece to capture. If typing, enter a '+' for approach and '-' for withdrawal.
ta: ஒவ்வொரு பிடிப்பு வகையும் வெளிப்படையாகக் கூறப்பட வேண்டும். நீங்கள் சொடுக்கு செய்தால், கைப்பற்ற முதல் எதிரி பகுதியைக் சொடுக்கு செய்க. தட்டச்சு செய்தால், திரும்பப் பெறுவதற்கு அணுகுமுறைக்கு ஒரு '+' மற்றும் '-' உள்ளிடவும்.

# validation.fanorona.INITIAL_INSTRUCTIONS
source: Click a piece to move.
ta: நகர்த்த ஒரு பகுதியைக் சொடுக்கு செய்க.
