Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.tintas.INITIAL_INSTRUCTIONS_needpawn
source: Select where to place the pawn.
ta: சிப்பாயை எங்கு வைக்க வேண்டும் என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.tintas.OCCUPIED_MOVE
source: The pawn must move to an occupied space.
ta: சிப்பாய் ஆக்கிரமிக்கப்பட்ட இடத்திற்கு செல்ல வேண்டும்.

# validation.tintas.SAME_COLOUR
source: When capturing multiple pieces, they must all be the same colour.
ta: பல துண்டுகளை கைப்பற்றும்போது, அவை அனைத்தும் ஒரே நிறமாக இருக்க வேண்டும்.

# validation.tintas.STRAIGHT_LINE
source: There is no straightline connection between {{from}} and {{to}}.
ta: }}} மற்றும் {{from} க்கு க்கு {for க்கு இடையே நேரான இணைப்பு எதுவும் இல்லை.

# validation.toguz.INITIAL_INSTRUCTIONS
source: Select the pit you wish to sow. It must be on your side of the board and cannot be a tuz (square-shaped pit).
ta: நீங்கள் விதைக்க விரும்பும் குழியைத் தேர்ந்தெடுக்கவும். இது உங்கள் பலகையின் பக்கத்தில் இருக்க வேண்டும், மேலும் இது ஒரு TUZ (சதுர வடிவ குழி) ஆக இருக்க முடியாது.

# validation.toguz.NO_TUZ
source: You may not sow the seeds in your tuz.
ta: உங்கள் டூசில் விதைகளை விதைக்கக்கூடாது.

# validation.trax.INITIAL_INSTRUCTIONS
source: Select a tile, then select a space to place it.
ta: ஒரு ஓடு என்பதைத் தேர்ந்தெடுத்து, அதை வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.trax.INITIAL_INSTRUCTIONS_FIRST
source: Select the first tile.
ta: முதல் ஓடு தேர்ந்தெடுக்கவும்.

# validation.trax.INVALID_NOTATION
source: The move notation '{{move}}' is invalid.
ta: நகரும் குறியீடு '{{move}}' தவறானது.

# validation.trax.FIRST_PIECE_POSITION
source: The first move must be either '@0+' or '@0/'.
ta: முதல் நகர்வு '@0+' அல்லது '@0/' ஆக இருக்க வேண்டும்.

# validation.trax.SELECT_CELL
source: Select a cell to place the tile.
ta: ஓடு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.trax.NO_NEIGHBOURS
source: The selected cell at {{where}} has no neighbours.
ta: {{where}} இல் தேர்ந்தெடுக்கப்பட்ட கலத்திற்கு அண்டை நாடுகள் இல்லை.

# validation.trax.CANNOT_PLACE_PIECE
source: The {{piece}} cannot be placed at {{where}}.
ta: {{piece}} {{where}} இல் வைக்க முடியாது.

# validation.trax.INVALID_FOLLOWUP
source: Placement of a {{piece}} at {{where}} results in an invalid followup.
ta: {{{{{}} இல் ஒரு {{piece} of இன் இடம் தவறான பின்தொடர்தலில் விளைகிறது.

# validation.trax.NO_EXPAND_X
source: You may not expand the board beyond a width of {{size}}.
ta: {{size} of அகலத்திற்கு அப்பால் நீங்கள் பலகையை விரிவுபடுத்தக்கூடாது.

# validation.trax.NO_EXPAND_Y
source: You may not expand the board beyond a height of {{size}}.
ta: {{size} of உயரத்திற்கு அப்பால் நீங்கள் பலகையை விரிவாக்கக்கூடாது.

# validation.trike.INITIAL_INSTRUCTIONS
source: Select the cell to place the neutral piece on.
ta: நடுநிலை துண்டுகளை வைக்க கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.tritium.INITIAL_INSTRUCTIONS
source: Select a tile or your own flag.
ta: ஒரு ஓடு அல்லது உங்கள் சொந்த கொடியைத் தேர்ந்தெடுக்கவும்.

# validation.tritium.INITIAL_INSTRUCTIONS2
source: Select a destination space.
ta: இலக்கு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.tritium.NON_EMPTY
source: Cell {{cell}} is not empty.
ta: செல் {{cell}} காலியாக இல்லை.

# validation.tritium.EMPTY
source: Cell {{cell}} is empty, flags must be placed on top of existing regions.
ta: செல் {{cell}} காலியாக உள்ளது, இருக்கும் பகுதிகளின் மேல் கொடிகள் வைக்கப்பட வேண்டும்.

# validation.tritium.NON_FREE_REGION
source: The region at {{cell}} is not free.
ta: {{cell} at இல் உள்ள பகுதி இலவசமல்ல.

# validation.tritium.NO_PREPARED_FLAG
source: You do not have a prepared flag.
ta: உங்களிடம் தயாரிக்கப்பட்ட கொடி இல்லை.

# validation.tumbleweed.INITIAL_INSTRUCTIONS
source: Place a piece on the board.
ta: பலகையில் ஒரு துண்டு வைக்கவும்.

# validation.tumbleweed.INITIAL_INSTRUCTIONS_PASS
source: Either invoke the pie rule to play as first player or pass to play as second. If pie was already invoked, your only option is to pass.
ta: முதல் வீரராக விளையாட பை விதியை அழைக்கவும் அல்லது இரண்டாவது இடமாக விளையாடவும். பை ஏற்கனவே பயன்படுத்தப்பட்டிருந்தால், உங்கள் ஒரே வழி கடந்து செல்ல வேண்டும்.

# validation.tumbleweed.INITIAL_INSTRUCTIONS_SETUP
source: Setup phase: place a piece of your colour, then place a piece of your opponent's colour.
ta: அமைவு கட்டம்: உங்கள் வண்ணத்தின் ஒரு பகுதியை வைக்கவும், பின்னர் உங்கள் எதிரியின் நிறத்தின் ஒரு பகுதியை வைக்கவும்.

# validation.tumbleweed.INITIAL_INSTRUCTIONS_SETUP_FREENEUTRAL
source: Setup phase: place a neutral stack-2 piece, then place a piece of your colour, and then place a piece of your opponent's colour.
ta: அமைவு கட்டம்: ஒரு நடுநிலை அடுக்கு -2 துண்டு வைக்கவும், பின்னர் உங்கள் வண்ணத்தின் ஒரு பகுதியை வைக்கவும், பின்னர் உங்கள் எதிரியின் நிறத்தின் ஒரு பகுதியை வைக்கவும்.

# validation.tumbleweed.PASS_1ST
source: You may not pass on the first ply.
ta: நீங்கள் முதல் பிளை கடந்து செல்லக்கூடாது.

# validation.tumbleweed.PASS_2ND
source: Either invoke the pie rule to play as first player or pass to play as second. If pie was already invoked, your only option is to pass.
ta: முதல் வீரராக விளையாட பை விதியை அழைக்கவும் அல்லது இரண்டாவது இடமாக விளையாடவும். பை ஏற்கனவே பயன்படுத்தப்பட்டிருந்தால், உங்கள் ஒரே வழி கடந்து செல்ல வேண்டும்.

# validation.tumbleweed.PASS_3RD
source: You may not pass on the third ply.
ta: நீங்கள் மூன்றாவது ஆட்டத்தில் கடந்து செல்லக்கூடாது.

# validation.tumbleweed.INSUFFICIENT_LOS
source: There is insufficient line of sight to place a piece on {{cell}}.
ta: {{cell}} இல் ஒரு பகுதியை வைக்க போதுமான பார்வை இல்லை.

# validation.tumbleweed.DUPLICATE
source: You have already placed a piece at {{where}}.
ta: நீங்கள் ஏற்கனவே ஒரு பகுதியை {{where}} இல் வைத்திருக்கிறீர்கள்.

# validation.tumbleweed.FREENEUTRAL1
source: Select a cell to place a piece of your colour.
ta: உங்கள் வண்ணத்தின் ஒரு பகுதியை வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.tumbleweed.FREENEUTRAL2
source: Select a cell to place a piece of your opponent's colour.
ta: உங்கள் எதிரியின் நிறத்தின் ஒரு பகுதியை வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.tumbleweed.ONE_MORE
source: Place a piece of your opponent's colour.
ta: உங்கள் எதிரியின் நிறத்தின் ஒரு பகுதியை வைக்கவும்.

# validation.tumbleweed.SAME_CELL
source: In the setup phase, place two pieces on different cells.
ta: அமைவு கட்டத்தில், வெவ்வேறு கலங்களில் இரண்டு துண்டுகளை வைக்கவும்.

# validation.tumbleweed.TOO_MANY
source: You may only place one piece per turn after the setup phase.
ta: அமைவு கட்டத்திற்குப் பிறகு நீங்கள் ஒரு திருப்பத்தை மட்டுமே வைக்கலாம்.

# validation.tumbleweed.TOO_MANY_OPENING
source: You may only place two pieces in the setup phase.
ta: நீங்கள் அமைவு கட்டத்தில் இரண்டு துண்டுகளை மட்டுமே வைக்கலாம்.

# validation.tumbleweed.TOO_MANY_OPENING_FREENEUTRAL
source: You may only place three pieces in the setup phase.
ta: நீங்கள் அமைவு கட்டத்தில் மூன்று துண்டுகளை மட்டுமே வைக்கலாம்.

# validation.tumbleweed.NO_REPLACE
source: In this variant, you may not place at a cell where your opponent just placed.
ta: இந்த மாறுபாட்டில், உங்கள் எதிரி வைத்திருக்கும் ஒரு கலத்தில் நீங்கள் வைக்கக்கூடாது.

# validation.tumbleweed.REINFORCE_NOTATION
source: Reinforcement moves must be suffixed with '+'. Try '{{move}}'
ta: வலுவூட்டல் நகர்வுகள் '+' உடன் பின்னொட்டு இருக்க வேண்டும். '{{move}}' முயற்சிக்கவும்

# validation.tumbleweed.CAPTURE_NOTATION
source: Capture moves must be suffixed with 'x'. Try '{{move}}'
ta: பிடிப்பு நகர்வுகள் 'ஃச்' உடன் பின்னொட்டு இருக்க வேண்டும். '{{move}}' முயற்சிக்கவும்

# validation.tumbleweed.NO_MOVELIST
source: Move list not available during placement phase for the freestyle variant. Click on the board to place the pieces.
ta: ஃப்ரீச்டைல் மாறுபாட்டிற்கான வேலைவாய்ப்பு கட்டத்தின் போது பட்டியல் கிடைக்கவில்லை. துண்டுகளை வைக்க பலகையில் சொடுக்கு செய்க.

# validation.twixt.CORNER
source: You may not place a peg at the corner of the board.
ta: நீங்கள் பலகையின் மூலையில் ஒரு பெக் வைக்கக்கூடாது.

# validation.twixt.CROSSING
source: The link at {{link}} is making an illegal cross.
ta: {{link} at இல் உள்ள இணைப்பு சட்டவிரோத சிலுவையை உருவாக்குகிறது.

# validation.twixt.INITIAL_INSTRUCTIONS
source: Select a space to place a peg. You may rearrange your links before you place your peg.
ta: ஒரு பெக் வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும். உங்கள் PEG ஐ வைப்பதற்கு முன்பு உங்கள் இணைப்புகளை மறுசீரமைக்கலாம்.

# validation.twixt.INITIAL_INSTRUCTIONS_PP
source: Select a space to place a peg
ta: ஒரு பெக் வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்

# validation.twixt.INVALID_LINK
source: The link at from {{from}} to {{to}} is invalid.
ta: {{{}} வரை {{from}} வரை உள்ள இணைப்பு தவறானது.

# validation.twixt.INVALID_MOVE_SEGMENT
source: The move {{move}} is invalid.
ta: {{move}} நகர்வு தவறானது.

# validation.twixt.INVALID_PARTIAL
source: The partial move {{move}} is invalid.
ta: பகுதி நடவடிக்கை {{move}} தவறானது.

# validation.twixt.LINK_ABSENT
source: There is no link between {{link}} to remove.
ta: அகற்ற {{link} tien க்கு எந்த தொடர்பும் இல்லை.

# validation.twixt.LINK_ON_WRONG_PLAYER
source: You may only place a link on a peg of your own colour.
ta: உங்கள் சொந்த நிறத்தின் ஒரு இணைப்பை மட்டுமே நீங்கள் வைக்கலாம்.

# validation.twixt.LINK_PRESENT
source: There is already a link between at {{link}}.
ta: ஏற்கனவே {{link} க்கு க்கு இடையில் ஒரு இணைப்பு உள்ளது.

# validation.twixt.NO_PEG
source: When placing a link at {{link}}, there is no peg at {{peg}}.
ta: {{link} at இல் ஒரு இணைப்பை வைக்கும்போது, {{peg} at இல் PEG இல்லை.

# validation.twixt.NORMALISED
source: The move needs to be normalised. Try {{normalised}}.
ta: நகர்வை இயல்பாக்க வேண்டும். {{normalised}} ஐ முயற்சிக்கவும்.

# validation.twixt.OCCUPIED
source: The space {{move}} is already occupied by a peg.
ta: இடம் {{move}} ஏற்கனவே ஒரு PEG ஆல் ஆக்கிரமிக்கப்பட்டுள்ளது.

# validation.twixt.OPPONENTS_AREA
source: You may not place a peg in your opponent's area.
ta: உங்கள் எதிரியின் பகுதியில் நீங்கள் ஒரு பெக் வைக்கக்கூடாது.

# validation.twixt.PARTIAL_EMPTY
source: Trying to begin a partial move at an empty space {{move}}.
ta: வெற்று இடத்தில் ஒரு பகுதி நகர்வைத் தொடங்க முயற்சிக்கிறது {{move}}.

# validation.twixt.PARTIAL_LINK
source: Select another peg to add or remove a link to.
ta: ஒரு இணைப்பைச் சேர்க்க அல்லது அகற்ற மற்றொரு PEG ஐத் தேர்ந்தெடுக்கவும்.

# validation.twixt.PARTIAL_OPPONENT
source: You may not rearrange your opponent's links.
ta: உங்கள் எதிரியின் இணைப்புகளை நீங்கள் மறுசீரமைக்கக்கூடாது.

# validation.twixt.TOO_MANY_PEGS
source: You may only place one peg per turn.
ta: நீங்கள் ஒரு திருப்பத்திற்கு ஒரு பெக் மட்டுமே வைக்கலாம்.

# validation.unlur.BAD_PASS
source: The contract phase is over. You may no longer pass.
ta: ஒப்பந்த கட்டம் முடிந்துவிட்டது. நீங்கள் இனி கடந்து செல்லக்கூடாது.

# validation.unlur.CONTRACT_EDGE
source: You may not place a piece on the edges of the board in the contract phase.
ta: ஒப்பந்த கட்டத்தில் வாரியத்தின் விளிம்புகளில் நீங்கள் ஒரு பகுதியை வைக்கக்கூடாது.

# validation.unlur.INITIAL_INSTRUCTIONS
source: Select a cell to place a piece, or pass to play as the Y player.
ta: ஒரு துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும், அல்லது ஒய் பிளேயராக விளையாடவும்.

# validation.unlur.INITIAL_INSTRUCTIONS_PASSED
source: Select a cell to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.upperhand.CANNOT_PLACE
source: You may not place at {{move}}.
ta: நீங்கள் {{move}} இல் வைக்கக்கூடாது.

# validation.upperhand.INITIAL_INSTRUCTIONS
source: Select a space to place a ball.
ta: ஒரு பந்தை வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.urbino.INITIAL_INSTRUCTIONS_first
source: Select a cell in sight to place a piece, or you may pass if your opponent just placed the second architect.
ta: ஒரு துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும், அல்லது உங்கள் எதிர்ப்பாளர் இரண்டாவது கட்டிடக் கலைஞரை வைத்திருந்தால் நீங்கள் கடந்து செல்லலாம்.

# validation.urbino.INITIAL_INSTRUCTIONS_fresh
source: Place an architect in an empty cell.
ta: வெற்று கலத்தில் ஒரு கட்டிடக் கலைஞரை வைக்கவும்.

# validation.urbino.INITIAL_INSTRUCTIONS_inprogress
source: Select an architect to move or select the size of a piece to place.
ta: நகர்த்த ஒரு கட்டிடக் கலைஞரைத் தேர்ந்தெடுக்கவும் அல்லது இடத்திற்கு ஒரு துண்டின் அளவைத் தேர்ந்தெடுக்கவும்.

# validation.urbino.INVALID_PASS
source: You may only pass if you have no other moves available.
ta: உங்களிடம் வேறு எந்த நகர்வுகளும் கிடைக்கவில்லை என்றால் மட்டுமே நீங்கள் கடந்து செல்லலாம்.

# validation.urbino.INVALID_PLACE_CELL
source: The cell {{where}} is not visible to both architects.
ta: செல் {{where}} இரு கட்டடக் கலைஞர்களுக்கும் தெரியவில்லை.

# validation.urbino.INVALID_PLACE_PIECE.house
source: You may not place a house here because it would create multiple blocks of one colour.
ta: நீங்கள் இங்கே ஒரு வீட்டை வைக்கக்கூடாது, ஏனெனில் இது ஒரு வண்ணத்தின் பல தொகுதிகளை உருவாக்கும்.

# validation.urbino.INVALID_PLACE_PIECE.palace
source: You may not place a palace here either because there is a palace adjacent or it would create multiple blocks of one colour.
ta: அருகிலுள்ள ஒரு அரண்மனை இருப்பதால் அல்லது ஒரு வண்ணத்தின் பல தொகுதிகளை உருவாக்கும் என்பதால் நீங்கள் இங்கே ஒரு அரண்மனையை வைக்கக்கூடாது.

# validation.urbino.INVALID_PLACE_PIECE.tower
source: You may not place a tower here either because there is a tower adjacent or it would create multiple blocks of one colour.
ta: அருகிலுள்ள ஒரு கோபுரம் இருப்பதால் அல்லது ஒரு வண்ணத்தின் பல தொகுதிகளை உருவாக்கும் என்பதால் நீங்கள் இங்கே ஒரு கோபுரத்தை வைக்கக்கூடாது.

# validation.urbino.MUST_PASS_PLAY
source: The first turn after the second worker has been placed must be a pass or placement.
ta: இரண்டாவது தொழிலாளி வைக்கப்பட்ட பிறகு முதல் திருப்பம் ஒரு பாச் அல்லது வேலைவாய்ப்பாக இருக்க வேண்டும்.

# validation.urbino.NOPLACEMENTS
source: You cannot move the workers such that you have no valid placements available.
ta: உங்களிடம் சரியான வேலைவாய்ப்புகள் இல்லாத தொழிலாளர்களை நீங்கள் நகர்த்த முடியாது.

# validation.urbino.PARTIAL_MOVE
source: Provide the destination.
ta: இலக்கை வழங்கவும்.

# validation.urbino.PARTIAL_PLACE
source: Choose a cell to place a piece in.
ta: ஒரு பகுதியை வைக்க ஒரு கலத்தைத் தேர்வுசெய்க.

# validation.urbino.PARTIAL_PLACE_SIZE
source: Select the size of a piece to place.
ta: இடத்திற்கு ஒரு துண்டின் அளவைத் தேர்ந்தெடுக்கவும்.

# validation.valley.BAD_VARIANT
source: You can only move towers in the Moon Labyrinth variant.
ta: நீங்கள் சந்திரன் லாபிரிந்த் மாறுபாட்டில் மட்டுமே கோபுரங்களை நகர்த்த முடியும்.

# validation.valley.INITIAL_INSTRUCTIONS
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.valley.KING_ONLY
source: Only the king may end its turn on the centre space.
ta: மன்னன் மட்டுமே மைய இடத்தின் திருப்பத்தை முடிக்கக்கூடும்.

# validation.valley.NO_STOPPING
source: Pieces must move in their chosen direction until stopped by the edge of the board or another piece.
ta: பலகையின் விளிம்பில் அல்லது மற்றொரு துண்டு நிறுத்தப்படும் வரை துண்டுகள் அவை தேர்ந்தெடுத்த திசையில் செல்ல வேண்டும்.

# validation.valley.NO_TOKENS
source: You may only move towers when you have moon tokens.
ta: நீங்கள் சந்திரன் டோக்கன்கள் இருக்கும்போது மட்டுமே கோபுரங்களை நகர்த்தலாம்.

# validation.valley.PARTIAL
source: Select the destination.
ta: இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.valley.PAWN_FIRST
source: The first move of the game cannot be made with the king.
ta: விளையாட்டின் முதல் நகர்வை ராசாவுடன் செய்ய முடியாது.

# validation.valley.TOWER_NO_TAKEBACKS
source: You may not just immediately undo an opponent's tower move.
ta: நீங்கள் உடனடியாக எதிராளியின் கோபுர நகர்வை செயல்தவிர்க்கக்கூடாது.

# validation.valley.TOWER_ORTH
source: Towers may only move orthogonally.
ta: கோபுரங்கள் ஆர்த்தோகனலாக மட்டுமே நகர்த்தக்கூடும்.

# validation.valley.TOWER_SINGLE_STEP
source: Towers may only move one space.
ta: கோபுரங்கள் ஒரு இடத்தை மட்டுமே நகர்த்தக்கூடும்.

# validation.veletas.ALREADY_SHOT
source: You have already shot at {{where}}.
ta: நீங்கள் ஏற்கனவே {{where}} இல் படமாக்கியுள்ளீர்கள்.

# validation.veletas.DUPLICATE
source: You have already placed a shooter at {{where}}.
ta: நீங்கள் ஏற்கனவே ஒரு துப்பாக்கி சுடும் வீரரை {{where} at இல் வைத்திருக்கிறீர்கள்.

# validation.veletas.INITIAL_INSTRUCTIONS
source: Select a shooter to move or select a cell to place your piece.
ta: நகர்த்த ஒரு துப்பாக்கி சுடும் நபரைத் தேர்ந்தெடுக்கவும் அல்லது உங்கள் பகுதியை வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.veletas.INITIAL_INSTRUCTIONS_PLACE
source: Place {{count}} more shooter an empty space on the board, then place a piece of your colour on the board.
ta: {{count}} மேலும் துப்பாக்கி சுடும் ஒரு வெற்று இடத்தை பலகையில் வைக்கவும், பின்னர் உங்கள் வண்ணத்தின் ஒரு பகுதியை பலகையில் வைக்கவும்.

# validation.veletas.INVALID_PLACEMENT
source: Unable to interpret the move notation: {{move}}.
ta: நகர்வு குறியீட்டை விளக்க முடியவில்லை: {{move}}.

# validation.veletas.MOVE_NON_SHOOTER
source: You may only move free shooters.
ta: நீங்கள் இலவச துப்பாக்கி சுடும் வீரர்களை மட்டுமே நகர்த்தலாம்.

# validation.veletas.NO_MOVELIST
source: Move list not available during placement phase. Click on the board to place the shooters.
ta: வேலைவாய்ப்பு கட்டத்தில் கிடைக்காத பட்டியல் பட்டியல். துப்பாக்கி சுடும் வீரர்களை வைக்க போர்டில் சொடுக்கு செய்க.

# validation.veletas.PLACE_PIECE
source: Place a piece of your colour on the board.
ta: உங்கள் வண்ணத்தின் ஒரு பகுதியை பலகையில் வைக்கவும்.

# validation.veletas.PLACE_SHOOTER
source: Place {{count}} more shooter on the board, then place a piece of your colour on the board.
ta: {{count} the போர்டில் மேலும் துப்பாக்கி சுடும் வீரரை வைக்கவும், பின்னர் உங்கள் வண்ணத்தின் ஒரு பகுதியை பலகையில் வைக்கவும்.

# validation.veletas.POTENTIAL_BLOCK
source: So far so good. Provide the space you want to place your piece at.
ta: இதுவரை மிகவும் நல்லது. உங்கள் பகுதியை வைக்க விரும்பும் இடத்தை வழங்கவும்.

# validation.veletas.POTENTIAL_MOVE
source: So far so good. Provide the space you want to move the shooter to.
ta: இதுவரை மிகவும் நல்லது. நீங்கள் துப்பாக்கி சுடும் நபரை நகர்த்த விரும்பும் இடத்தை வழங்கவும்.

# validation.veletas.SHOOTER_PERIMETER
source: Shooters may not be placed on the perimeter of the board.
ta: துப்பாக்கி சுடும் வீரர்கள் பலகையின் சுற்றளவில் வைக்கப்படக்கூடாது.

# validation.veletas.SORTED
source: The move list needs to be sorted. Try {{normalised}}.
ta: நகர்வு பட்டியலை வரிசைப்படுத்த வேண்டும். {{normalised}} ஐ முயற்சிக்கவும்.

# validation.veletas.STATIONARY_LOS
source: There is no line of sight to place at {{where}}.
ta: {{where}} இல் வைக்க எந்த பார்வையும் இல்லை.

# validation.veletas.STRAIGHTLINE
source: You can only move and place in straight lines.
ta: நீங்கள் நகர்ந்து நேர் கோடுகளில் மட்டுமே வைக்க முடியும்.

# validation.veletas.TOO_MANY_SHOOTERS
source: You may only place {{count}} shooter.
ta: நீங்கள் {{count}} துப்பாக்கி சுடும் வீரரை மட்டுமே வைக்கலாம்.

# validation.verge.FROZEN_NEIGHBOUR
source: You cannot place next one of your frozen groups.
ta: உங்கள் உறைந்த குழுக்களில் ஒன்றை நீங்கள் வைக்க முடியாது.

# validation.verge.INITIAL_INSTRUCTIONS
source: Select an empty cell that is not adjacent to one of your frozen groups.
ta: உங்கள் உறைந்த குழுக்களில் ஒன்றிற்கு அருகில் இல்லாத வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.volcano.BAD_FROM
source: {{from}} doesn't look like a position on the board, or a piece in your stash.
ta: } {from}}}} போர்டில் ஒரு நிலை அல்லது உங்கள் ச்டாசில் உள்ள ஒரு துண்டு போல் தெரியவில்லை.

# validation.volcano.INITIAL_INSTRUCTIONS
source: Select a cap to move or a piece from your captured pile to place on the board.
ta: நகர்த்த ஒரு தொப்பி அல்லது நீங்கள் கைப்பற்றப்பட்ட குவியலிலிருந்து ஒரு துண்டு என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.volcano.MOVES_AFTER_ERUPTION
source: You may not continue moving after causing an eruption.
ta: வெடிப்பை ஏற்படுத்திய பின் நீங்கள் தொடர்ந்து நகரக்கூடாது.

# validation.volcano.MOVES_CAPS_ONLY
source: You may only move caps.
ta: நீங்கள் தொப்பிகளை மட்டுமே நகர்த்தலாம்.

# validation.volcano.MOVES_DOUBLE_CAP
source: Nothing may be placed on top of a cap.
ta: எதுவும் ஒரு தொப்பியின் மேல் வைக்கப்படக்கூடாது.

# validation.volcano.MOVES_MUST_ERUPT
source: You must continue moving until you cause an eruption.
ta: நீங்கள் வெடிப்பை ஏற்படுத்தும் வரை தொடர்ந்து நகர வேண்டும்.

# validation.volcano.MOVES_NOPIECE
source: You don't have a {{piece}} piece in your stash to place.
ta: உங்கள் இடத்திற்கு உங்கள் ச்டாசில் {{piece}} துண்டு இல்லை.

# validation.volcano.MOVES_ONE_POWERPLAY
source: You may only make one power play per turn.
ta: நீங்கள் ஒரு திருப்பத்திற்கு ஒரு ஆற்றல் நாடகத்தை மட்டுமே செய்யலாம்.

# validation.volcano.MOVES_ONE_SPACE
source: Caps may only be moved one space at a time.
ta: தொப்பிகள் ஒரு நேரத்தில் ஒரு இடத்தை மட்டுமே நகர்த்தலாம்.

# validation.volcano.PARTIAL_ERUPTION
source: Keep moving caps until you cause an eruption.
ta: நீங்கள் வெடிப்பை ஏற்படுத்தும் வரை தொப்பிகளை நகர்த்திக் கொள்ளுங்கள்.

# validation.volcano.PARTIAL_MOVE
source: Select the destination.
ta: இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.volo.BEARING
source: The range {{range}} does not result in a valid bearing.
ta: {{range}} வரம்பு சரியான தாங்கியை ஏற்படுத்தாது.

# validation.volo.CHOOSE_REGION
source: You have created new regions containing your opponent's birds. Select one of the {{count}} regions to retain.
ta: உங்கள் எதிரியின் பறவைகள் அடங்கிய புதிய பகுதிகளை நீங்கள் உருவாக்கியுள்ளீர்கள். தக்கவைக்க {{count}} பகுதிகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.volo.CONTROLLED_REGION
source: You may not place a bird at {{where}} because it would be in a region controlled by your opponent.
ta: நீங்கள் ஒரு பறவையை {{where}} இல் வைக்கக்கூடாது, ஏனெனில் இது உங்கள் எதிரியால் கட்டுப்படுத்தப்படும் ஒரு பிராந்தியத்தில் இருக்கும்.

# validation.volo.END_OR_MOVE_DIRECTION
source: Select another bird to create a flock, or select a destination to move the single bird to.
ta: ஒரு மந்தையை உருவாக்க மற்றொரு பறவையைத் தேர்ந்தெடுக்கவும் அல்லது ஒற்றை பறவையை நகர்த்த ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.volo.INITIAL_INSTRUCTIONS
source: Select an intersection to add a bird, or select a flock of birds to move.
ta: ஒரு பறவையைச் சேர்க்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும் அல்லது நகர்த்த பறவைகளின் மந்தையைத் தேர்ந்தெடுக்கவும்.

# validation.volo.INITIAL_INSTRUCTIONS_PASS
source: Select an intersection to add a bird, or select a flock of birds to move, or pass.
ta: ஒரு பறவையைச் சேர்க்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும், அல்லது நகர்த்துவதற்கு பறவைகளின் மந்தையைத் தேர்ந்தெடுக்கவும் அல்லது கடந்து செல்லவும்.

# validation.volo.INITIAL_INSTRUCTIONS_PASS_ONLY
source: You have run out of moves. You may only pass.
ta: நீங்கள் நகர்வுகளை விட்டு வெளியேறிவிட்டீர்கள். நீங்கள் மட்டுமே கடந்து செல்லலாம்.

# validation.volo.INVALID_DIRDIST
source: The direction and distance {{dirDist}} is invalid.
ta: திசை மற்றும் தூரம் {{dirDist}} தவறானது.

# validation.volo.INVALID_PASS
source: You may only pass if your only placement is in regions of your own or if you have run out of moves.
ta: உங்கள் ஒரே வேலைவாய்ப்பு உங்கள் சொந்த பிராந்தியங்களில் இருந்தால் அல்லது நீங்கள் நகர்வுகளை விட்டு வெளியேறினால் மட்டுமே நீங்கள் கடந்து செல்லலாம்.

# validation.volo.INVALID_REGION
source: The region {{choice}} is not valid. Select one of the regions ({{choices}}) to retain.
ta: பகுதி {{choice}} செல்லுபடியாகாது. தக்கவைக்க பிராந்தியங்களில் ஒன்றைத் தேர்ந்தெடுக்கவும் ({{choices}}).

# validation.volo.INVALID_REGION_NORMALISE
source: The region that contains {{choice}} is represented by {{represent}}. Try '{{normalised}}'
ta: {{normalised} is ஐக் கொண்ட பகுதி {{represent} by ஆல் குறிப்பிடப்படுகிறது. '{{choice}}' ஐ முயற்சிக்கவும்

# validation.volo.MOVE_DIRECTION
source: Select a destination to move the flock to.
ta: மந்தையை நகர்த்த ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.volo.NO_REGIONS_TO_SELECT
source: You have indicated a region selection, but there are no regions to select from.
ta: நீங்கள் ஒரு பிராந்திய தேர்வைக் சுட்டிக்காட்டியுள்ளீர்கள், ஆனால் தேர்ந்தெடுக்க பகுதிகள் எதுவும் இல்லை.

# validation.volo.NORMALISE
source: The move needs to be normalised. Try '{{normalised}}'.
ta: நகர்வை இயல்பாக்க வேண்டும். '{{normalised}}' ஐ முயற்சிக்கவும்.
