Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.volo.PLACE_FRIENDLY_NEIGHBOUR
source: You may not place a bird at {{where}} because it would be adjacent to a friendly bird.
ta: நீங்கள் ஒரு பறவையை {{where}} இல் வைக்கக்கூடாது, ஏனெனில் அது ஒரு நட்பு பறவைக்கு அருகில் இருக்கும்.

# validation.volo.SAME_START_END
source: The start and end points are the same.
ta: தொடக்க மற்றும் இறுதி புள்ளிகள் ஒன்றே.

# validation.volo.SINGLE_LINE
source: The {{range}} is not a straight unbroken line of your birds.
ta: {{range} your உங்கள் பறவைகளின் நேராக இணைக்கப்படாத வரி அல்ல.

# validation.witch.2P_PRIVILEGE
source: Only the second player may choose the pieces they wish to play.
ta: இரண்டாவது வீரர் மட்டுமே அவர்கள் விளையாட விரும்பும் துண்டுகளை தேர்வு செய்யலாம்.

# validation.witch.AFFILIATE
source: Choose which piece you wish to play by clicking any sun or moon piece.
ta: எந்தவொரு சூரியன் அல்லது சந்திரன் துண்டுகளையும் சொடுக்கு செய்வதன் மூலம் நீங்கள் எந்த துண்டு விளையாட விரும்புகிறீர்கள் என்பதைத் தேர்வுசெய்க.

# validation.witch.ALREADY_AFFLIATED
source: Pieces have already been chosen.
ta: துண்டுகள் ஏற்கனவே தேர்ந்தெடுக்கப்பட்டுள்ளன.

# validation.witch.BOTH_EMPTY
source: When selecting a line of pieces, both the start and end cells must be empty.
ta: துண்டுகளின் வரியைத் தேர்ந்தெடுக்கும்போது, தொடக்க மற்றும் இறுதி செல்கள் இரண்டும் காலியாக இருக்க வேண்டும்.

# validation.witch.EMPTY_CAPTURE
source: Captures must include at least one piece.
ta: பிடிப்புகளில் குறைந்தது ஒரு துண்டு இருக்க வேண்டும்.

# validation.witch.INCOMPLETE_AFFILIATION
source: To choose your affiliation, the move must start with '(S)' or '(M)'.
ta: உங்கள் இணைப்பைத் தேர்வுசெய்ய, நடவடிக்கை '(கள்)' அல்லது '(மீ)' உடன் தொடங்க வேண்டும்.

# validation.witch.INITIAL_INSTRUCTIONS
source: Click a piece to remove or an empty space to start removing a line of pieces.
ta: துண்டுகளின் வரியை அகற்றத் தொடங்க ஒரு துண்டு அல்லது வெற்று இடத்தைக் சொடுக்கு செய்க.

# validation.witch.NO_CROWNS
source: You may not pick up crowns directly.
ta: நீங்கள் நேரடியாக கிரீடங்களை எடுக்கக்கூடாது.

# validation.witch.NO_ENEMY
source: You may not pick up your opponent's pieces.
ta: உங்கள் எதிரியின் துண்டுகளை நீங்கள் எடுக்கக்கூடாது.

# validation.witch.ORTHOGONAL
source: Lines of pieces must be horizontal or vertical, never diagonal.
ta: துண்டுகளின் கோடுகள் கிடைமட்டமாக அல்லது செங்குத்தாக இருக்க வேண்டும், ஒருபோதும் மூலைவிட்டமாக இருக்காது.

# validation.witch.PARTIAL
source: Select another empty space to remove the pieces in between.
ta: இடையில் உள்ள துண்டுகளை அகற்ற மற்றொரு வெற்று இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.witch.UNBROKEN
source: Lines of pieces must be unbroken by empty cells.
ta: துண்டுகளின் கோடுகள் வெற்று கலங்களால் உடைக்கப்படாமல் இருக்க வேண்டும்.

# validation.wyke.CELL_CLAIMED
source: The cell {{cell}} has already been claimed and cannot be interacted with further.
ta: {{cell}} ஏற்கனவே உரிமை கோரப்பட்டுள்ளது, மேலும் தொடர்பு கொள்ள முடியாது.

# validation.wyke.DUPLICATE_CELLS
source: You can't select the same cell multiple times.
ta: நீங்கள் ஒரே கலத்தை பல முறை தேர்ந்தெடுக்க முடியாது.

# validation.wyke.INITIAL_INSTRUCTIONS
source: Select an available move from the button bar.
ta: பொத்தான் பட்டியில் இருந்து கிடைக்கக்கூடிய நகர்வைத் தேர்ந்தெடுக்கவும்.

# validation.wyke.INVALID_FORMAT
source: Your move is in an invalid format: "{{move}}". It should start with the move type followed by a list of cells in parentheses (e.g., "3-1 (a1,b2)").
ta: உங்கள் நகர்வு தவறான வடிவத்தில் உள்ளது: "{{move}}". இது நகரும் வகையுடன் தொடங்கப்பட வேண்டும், அதைத் தொடர்ந்து அடைப்புக்குறிக்குள் உள்ள கலங்களின் பட்டியலைக் கொண்டுள்ளது (எ.கா., "3-1 (A1, B2)").

# validation.wyke.INVALID_MOVETYPE
source: The move "{{move}}" is not one of the five allowed movement types.
ta: "{{move}}" நகர்வு அனுமதிக்கப்பட்ட ஐந்து இயக்க வகைகளில் ஒன்றல்ல.

# validation.wyke.MOVETYPE_UNAVAILABLE
source: That move type is unavailable. Only select moves that are not stricken through.
ta: அந்த நகரும் வகை கிடைக்கவில்லை. பாதிக்கப்படாத நகர்வுகளை மட்டுமே தேர்ந்தெடுக்கவும்.

# validation.wyke.PARTIAL
source: Continue selecting cells until the move is complete.
ta: நகர்வு முடியும் வரை கலங்களைத் தேர்ந்தெடுப்பதைத் தொடரவும்.

# validation.wyke.TOO_FEW_PIECES
source: There are too few pieces at {{where}} to remove {{num}} of them.
ta: அவற்றில் {{where}} ஐ அகற்ற {{}} இல் மிகக் குறைவான துண்டுகள் உள்ளன.

# validation.wyke.TOO_MANY_CELLS
source: You have selected more cells than the move type allows.
ta: நகர்வு வகை அனுமதிப்பதை விட அதிகமான கலங்களைத் தேர்ந்தெடுத்துள்ளீர்கள்.

# validation.wyke.TOO_MANY_PIECES
source: There are too many pieces at {{where}} to add {{num}} more.
ta: {{where}}}}}} இல் {}} இல் பல துண்டுகள் உள்ளன.

# validation.yavalath.BAD_PASS
source: You may only pass if you have been eliminated.
ta: நீங்கள் அகற்றப்பட்டால் மட்டுமே நீங்கள் கடந்து செல்லலாம்.

# validation.yavalath.INITIAL_INSTRUCTIONS
source: Click an empty cell to place a piece.
ta: ஒரு துண்டு வைக்க வெற்று கலத்தைக் சொடுக்கு செய்க.

# validation.yavalath.MUST_BLOCK
source: In a three-player game, you must block a next-opponent win if possible.
ta: மூன்று வீரர்களின் விளையாட்டில், முடிந்தால் அடுத்த எதிர்ப்பாளர் வெற்றியைத் தடுக்க வேண்டும்.

# validation.yonmoque.INITIAL_INSTRUCTIONS
source: Select an empty cell to place a piece or an existing piece to start a move.
ta: ஒரு நகர்வைத் தொடங்க ஒரு துண்டு அல்லது ஏற்கனவே உள்ள துண்டு வைக்க வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.yonmoque.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.zola.DISTANCE_CAPTURES
source: Capture moves must not increase your distance from the centre.
ta: பிடிப்பு நகர்வுகள் மையத்திலிருந்து உங்கள் தூரத்தை அதிகரிக்கக்கூடாது.

# validation.zola.DISTANCE_NONCAPTURES
source: Non-capture moves must increase your distance from the centre.
ta: பிடிப்பு அல்லாத நகர்வுகள் மையத்திலிருந்து உங்கள் தூரத்தை அதிகரிக்க வேண்டும்.

# validation.zola.INITIAL_INSTRUCTIONS
source: Select one of your own pieces.
ta: உங்கள் சொந்த துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.zola.MUST_MOVE
source: If you have a move available you can not pass your turn.
ta: உங்களிடம் ஒரு நகர்வு இருந்தால், உங்கள் திருப்பத்தை நீங்கள் கடக்க முடியாது.

# validation.zola.NONCAPTURES_KINGS
source: Non-capturing moves can only move one space at a time.
ta: கைப்பற்றப்படாத நகர்வுகள் ஒரு நேரத்தில் ஒரு இடத்தை மட்டுமே நகர்த்த முடியும்.

# validation.zola.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# INITIAL_UNDO
source: You can't undo the initial starting position of the game.
ta: விளையாட்டின் ஆரம்ப தொடக்க நிலையை நீங்கள் செயல்தவிர்க்க முடியாது.

# MOVES_GAMEOVER
source: You cannot make moves in concluded games
ta: முடிவடைந்த விளையாட்டுகளில் நீங்கள் நகர்வுகளைச் செய்ய முடியாது

# MOVES_INVALID
source: The move '{{move}}' is invalid. Please check the rules and try again.
ta: '{{move}}' நகர்வு தவறானது. தயவுசெய்து விதிகளை சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# MOVES_SIMULTANEOUS_PARTIAL
source: In simultaneous games, both players' moves must be submitted at the same time.
ta: ஒரே நேரத்தில், இரு வீரர்களின் நகர்வுகளும் ஒரே நேரத்தில் சமர்ப்பிக்கப்பட வேண்டும்.
