Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.calculus.VALID_PARTIAL
source: Select a destination. If the selected position would lead to a collision, the system will attempt to snap the piece to a logical valid position.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும். தேர்ந்தெடுக்கப்பட்ட நிலை மோதலுக்கு வழிவகுக்கும் என்றால், கணினி ஒரு தர்க்கரீதியான செல்லுபடியாகும் நிலைக்கு எடுக்க முயற்சிக்கும்.

# validation.camelot.INITIAL_INSTRUCTIONS
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.camelot.INITIAL_INSTRUCTIONS_JUMP
source: You have mandatory jump moves. Select a piece to jump or perform a knight's charge.
ta: உங்களிடம் கட்டாய சம்ப் நகர்வுகள் உள்ளன. குதிக்க ஒரு துண்டைத் தேர்ந்தெடுக்கவும் அல்லது ஒரு நைட்டின் கட்டணத்தை செய்யவும்.

# validation.camelot.INITIAL_INSTRUCTIONS_OWN_CASTLE
source: You have a piece in your own castle. You must move it out of the castle.
ta: உங்கள் சொந்த கோட்டையில் ஒரு துண்டு உள்ளது. நீங்கள் அதை கோட்டையிலிருந்து வெளியே நகர்த்த வேண்டும்.

# validation.camelot.INITIAL_INSTRUCTIONS_TREE
source: Select three highlighted cells to place trees on.
ta: மரங்களை வைக்க மூன்று சிறப்பம்சமாக உள்ள கலங்களைத் தேர்ந்தெடுக்கவும்.

# validation.camelot.TREE_LIMIT
source: You may only place 3 trees.
ta: நீங்கள் 3 மரங்களை மட்டுமே வைக்கலாம்.

# validation.camelot.NOT_TREE_PLACEABLE
source: You may not place a tree at {{where}}.
ta: நீங்கள் ஒரு மரத்தை {{where}} இல் வைக்கக்கூடாது.

# validation.camelot.DUPLICATE_TREE
source: You have already placed a tree at {{where}}.
ta: நீங்கள் ஏற்கனவே ஒரு மரத்தை {{where}} இல் வைத்திருக்கிறீர்கள்.

# validation.camelot.TREE_CONTINUE
source: Select 1 more highlighted cell to place a tree on.
ta: ஒரு மரத்தை வைக்க இன்னும் 1 சிறப்பம்சமாக கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.camelot.NORMALISED
source: The move needs to be normalised. Try {{normalised}}.
ta: நகர்வை இயல்பாக்க வேண்டும். {{normalised}} ஐ முயற்சிக்கவும்.

# validation.camelot.CANNOT_CLAIM_DRAW
source: You may only claim a draw if the same position is repeated for at least the third time by the same player on each move or there have been no captures or movement into the opponent's castle square for the last 50 moves.
ta: ஒவ்வொரு நகர்விலும் ஒரே வீரரால் அதே நிலை குறைந்தபட்சம் மூன்றாவது முறையாக மறுநிகழ்வு செய்யப்பட்டால் அல்லது கடந்த 50 நகர்வுகளுக்கு எதிராளியின் கோட்டை சதுக்கத்தில் எந்தப் பிடிப்புகளும் அல்லது இயக்கமும் இல்லை என்றால் மட்டுமே நீங்கள் ஒரு சமநிலையை கோரலாம்.

# validation.camelot.IN_OWN_CASTLE
source: You must move the piece at {{where}} out of your own castle.
ta: நீங்கள் உங்கள் சொந்த கோட்டையிலிருந்து {{where}}} இல் நகர்த்த வேண்டும்.

# validation.camelot.MUST_JUMP
source: You must select one of your pieces to jump or perform a knight's charge.
ta: ஒரு நைட்டின் கட்டணத்தை குதிக்க அல்லது செய்ய உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்க வேண்டும்.

# validation.camelot.MUST_EVENTUALLY_JUMP
source: The sequence of moves must eventually lead to a knight's charge.
ta: நகர்வுகளின் வரிசை இறுதியில் ஒரு நைட்டியின் கட்டணத்திற்கு வழிவகுக்கும்.

# validation.camelot.MUST_CONTINUE_CANTER
source: You must continue to canter to eventually perform a knight's charge.
ta: இறுதியில் ஒரு நைட்டின் கட்டணத்தை செய்ய நீங்கள் தொடர்ந்து கேன்டரைக் கொண்டிருக்க வேண்டும்.

# validation.camelot.CASTLE_LIMIT
source: You may only make a castle move twice in a game.
ta: நீங்கள் ஒரு விளையாட்டில் இரண்டு முறை ஒரு கோட்டை நகர்வை மட்டுமே செய்ய முடியும்.

# validation.camelot.IN_CASTLE
source: You have a piece in your own castle at {{where}}. You must move it out of the castle.
ta: {{where}} இல் உங்கள் சொந்த கோட்டையில் ஒரு துண்டு உள்ளது. நீங்கள் அதை கோட்டையிலிருந்து வெளியே நகர்த்த வேண்டும்.

# validation.camelot.MUST_JUMP_SELECTED
source: Your selected piece at {{where}} must make capture.
ta: உங்கள் தேர்ந்தெடுக்கப்பட்ட துண்டு {{where}} பிடிக்கவும்.

# validation.camelot.JUMP_NOTATION
source: The move from {{from}} to {{to}} is a jump move. Use the notation 'x' to indicate a jump.
ta: {{from}} {{{to} பெறுநர் க்கு நகர்வது ஒரு சம்ப் நடவடிக்கை. ஒரு தாவலைக் குறிக்க 'ஃச்' என்ற குறியீட்டைப் பயன்படுத்தவும்.

# validation.camelot.PLAIN_NOTATION
source: The move from {{from}} to {{to}} is a plain move. Use the notation '-' to indicate a plain move.
ta: }} இருந்து இலிருந்து {{from} பெறுநர் க்கு {{நகர்வது ஒரு தெளிவான நடவடிக்கை. வெற்று நகர்வைக் குறிக்க '-' என்ற குறியீட்டைப் பயன்படுத்தவும்.

# validation.camelot.CANTER_NOTATION
source: The move from {{from}} to {{to}} is a canter move. Use the notation '^' to indicate a canter.
ta: {{from}} {{{to}} வரை நகர்வது ஒரு கேன்டர் நகர்வு. ஒரு கேண்டரைக் குறிக்க '^' என்ற குறியீட்டைப் பயன்படுத்தவும்.

# validation.camelot.INVALID_TO
source: The piece at {{from}} cannot move to {{to}}.
ta: } From} க்கு இல் உள்ள துண்டு {{from} பெறுநர் க்கு செல்ல முடியாது.

# validation.camelot.NEED_TO_JUMP
source: You have to continue making a capture.
ta: நீங்கள் தொடர்ந்து கைப்பற்ற வேண்டும்.

# validation.camelot.CAN_CANTER
source: You may continue making a canter move or end the turn here.
ta: நீங்கள் தொடர்ந்து ஒரு கேன்டர் நகர்வை மேற்கொள்ளலாம் அல்லது இங்கே திருப்பத்தை முடிக்கலாம்.

# validation.cannon.BAD_RETREAT
source: Pieces can only retreat if they are adjacent to at least one enemy piece.
ta: குறைந்தது ஒரு எதிரி துண்டுக்கு அருகில் இருந்தால் மட்டுமே துண்டுகள் பின்வாங்க முடியும்.

# validation.cannon.FIXED_TOWNS
source: Towns cannot be moved.
ta: நகரங்களை நகர்த்த முடியாது.

# validation.cannon.FORWARD_ONLY
source: Pieces can only move forward, unless capturing laterally or retreating.
ta: பக்கவாட்டாக கைப்பற்றப்படாவிட்டால் அல்லது பின்வாங்காவிட்டால் மட்டுமே துண்டுகள் முன்னேற முடியும்.

# validation.cannon.HOMECELL
source: You can only place your town on your home row, and not on the corners.
ta: உங்கள் ஊரை உங்கள் வீட்டு வரிசையில் மட்டுமே வைக்க முடியும், மூலைகளில் அல்ல.

# validation.cannon.INITIAL_INSTRUCTIONS_placed
source: Select one of your soldiers to move or an enemy piece to capture by cannon fire.
ta: பீரங்கி நெருப்பால் கைப்பற்ற உங்கள் வீரர்களில் ஒருவரை அல்லது எதிரி துண்டு என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.cannon.INITIAL_INSTRUCTIONS_towns
source: Select a cell along the back row to place your town.
ta: உங்கள் ஊரை வைக்க பின் வரிசையில் ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.cannon.LATERAL_MOVEMENT
source: Pieces can only move laterally when capturing.
ta: கைப்பற்றும்போது மட்டுமே துண்டுகள் பக்கவாட்டாக நகர முடியும்.

# validation.cannon.NOCANNON_CAPTURE
source: This piece is not in range of any of your cannons.
ta: இந்த துண்டு உங்கள் பீரங்கிகளின் வரம்பில் இல்லை.

# validation.cannon.NOCANNON_MOVE
source: There is no cannon along which to move that piece that way.
ta: அந்த வழியில் நகர்த்த எந்த நியதி இல்லை.

# validation.cannon.PARTIAL
source: Provide a destination.
ta: ஒரு இலக்கை வழங்கவும்.

# validation.cannon.RETREAT_DISTANCE
source: You must retreat two full spaces.
ta: நீங்கள் இரண்டு முழு இடங்களையும் பின்வாங்க வேண்டும்.

# validation.cannon.RETREAT_EMPTY
source: You must retreat to an empty cell.
ta: நீங்கள் ஒரு வெற்று கலத்திற்கு பின்வாங்க வேண்டும்.

# validation.cannon.TOOFAR
source: You can only move one space at a time, unless retreating.
ta: பின்வாங்காவிட்டால், நீங்கள் ஒரு நேரத்தில் ஒரு இடத்தை மட்டுமே நகர்த்த முடியும்.

# validation.cannon.UNCONTROLLED
source: You can't control enemy pieces. If you're trying to capture it by cannon, click it again.
ta: நீங்கள் எதிரி துண்டுகளை கட்டுப்படுத்த முடியாது. நீங்கள் அதை பீரங்கியால் பிடிக்க முயற்சிக்கிறீர்கள் என்றால், அதை மீண்டும் சொடுக்கு செய்க.

# validation.catapult.BAD_CAPTURE
source: A capturing move must land on or pass over at least one enemy piece, may not pass over friendly pieces, and may not go further than its range.
ta: கைப்பற்றும் நடவடிக்கை குறைந்தது ஒரு எதிரி துண்டையாவது தரையிறக்க வேண்டும் அல்லது கடந்து செல்ல வேண்டும், நட்பு துண்டுகளை கடந்து செல்லக்கூடாது, மேலும் அதன் வரம்பை விட அதிகமாக செல்லக்கூடாது.

# validation.catapult.BAD_MOVE
source: A non-capturing move must be in the direction of the enemy corner, must not land on or pass over any other pieces, and may not go further than its range.
ta: ஒரு பிடிப்பு அல்லாத நடவடிக்கை எதிரி மூலையின் திசையில் இருக்க வேண்டும், வேறு எந்த பகுதிகளையும் தரையிறக்கவோ அல்லது கடந்து செல்லவோ கூடாது, அதன் வரம்பை விட அதிகமாக செல்லக்கூடாது.

# validation.catapult.BAD_PASS
source: You may not pass as long as you have valid moves available.
ta: நீங்கள் சரியான நகர்வுகள் கிடைக்கும் வரை நீங்கள் கடந்து செல்லக்கூடாது.

# validation.catapult.INITIAL_INSTRUCTIONS
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.catapult.NO_DAGGER
source: You may not make multiple moves unless you have the dagger.
ta: உங்களிடம் குத்து இல்லாவிட்டால் நீங்கள் பல நகர்வுகளைச் செய்யக்கூடாது.

# validation.catapult.PARTIAL_DAGGER
source: Looks like a valid move. Because you have the dagger, you may make a second move now and pass the dagger to your opponent, or you may click the "Complete move" button to pass the turn and retain the dagger for later.
ta: சரியான நடவடிக்கை போல் தெரிகிறது. உங்களிடம் குத்துச்சண்டை இருப்பதால், நீங்கள் இப்போது இரண்டாவது நகர்வை மேற்கொண்டு, உங்கள் எதிரிக்கு டாகரை அனுப்பலாம், அல்லது திருப்பத்தை கடக்க "முழுமையான நகர்வு" பொத்தானைக் சொடுக்கு செய்து, பின்னர் டாகரை தக்க வைத்துக் கொள்ளலாம்.

# validation.catchup.DUPLICATE
source: You have already placed a piece at {{where}}.
ta: நீங்கள் ஏற்கனவே ஒரு பகுதியை {{where}} இல் வைத்திருக்கிறீர்கள்.

# validation.catchup.INITIAL_INSTRUCTIONS
source: Place {{count}} piece on the board.
ta: பலகையில் {{count}} துண்டு வைக்கவும்.

# validation.catchup.MAKE_MORE_MOVES
source: Place {{count}} more piece or complete your turn.
ta: வைக்கவும் {{count}} மேலும் துண்டு அல்லது உங்கள் திருப்பத்தை முடிக்கவும்.

# validation.catchup.TOO_MANY_MOVES
source: You may only place {{count}} piece on the board.
ta: நீங்கள் {{count}} துண்டு மட்டுமே பலகையில் வைக்கலாம்.

# validation.ccorridor.DEAD_ZONE
source: Placing a tile at {{where}} is guaranteed not to score.
ta: ஒரு ஓடு {{where}} மதிப்பெண் பெறக்கூடாது என்று பொறுப்பு அளிக்கப்படுகிறது.

# validation.ccorridor.ILLEGAL_PLACEMENT
source: Placing a tile at {{where}} blocks the corridor.
ta: ஒரு ஓடு {{where}}} தாழ்வாரத்தைத் தடுக்கிறது.

# validation.ccorridor.INITIAL_INSTRUCTIONS
source: Select a space to place a tile.
ta: ஒரு ஓடு வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.ceph.DUPLICATECAP
source: You can't capture the same piece more than once.
ta: ஒரே பகுதியை நீங்கள் ஒன்றுக்கு மேற்பட்ட முறை கைப்பற்ற முடியாது.

# validation.ceph.INITIAL_INSTRUCTIONS
source: Select an empty cell.
ta: வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.ceph.NOTADJACENT
source: You can only capture pieces orthogonally adjacent to your placed piece.
ta: உங்கள் வைக்கப்பட்ட துண்டுக்கு அருகிலுள்ள துண்டுகளை மட்டுமே நீங்கள் கைப்பற்ற முடியும்.

# validation.ceph.PARTIAL_ONECAP
source: Select at least one more adjacent piece to capture.
ta: கைப்பற்ற குறைந்தது ஒரு அருகிலுள்ள பகுதியையாவது தேர்ந்தெடுக்கவும்.

# validation.ceph.PARTIAL_PRECAP
source: Select a piece to capture.
ta: கைப்பற்ற ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.ceph.TOOHIGH_six
source: The pieces you capture cannot total more than six.
ta: நீங்கள் கைப்பற்றும் துண்டுகள் மொத்தம் ஆறுக்கு மேல் முடியாது.

# validation.ceph.TOOHIGH_twelve
source: The pieces you capture cannot total more than twelve.
ta: நீங்கள் கைப்பற்றும் துண்டுகள் மொத்தம் பன்னிரண்டுக்கும் மேலாக முடியாது.

# validation.chameleon.INITIAL_INSTRUCTIONS
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.chameleon.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.chase.BALANCE_LOWEST
source: When balancing you must select one of the pieces with the lowest speed. The piece at {{where}} is not one of those.
ta: சமநிலைப்படுத்தும் போது நீங்கள் குறைந்த வேகத்துடன் கூடிய துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்க வேண்டும். {{}}} இல் உள்ள துண்டு அவற்றில் ஒன்றல்ல.

# validation.chase.CHAMBER_BUMP
source: You may not bump pieces into the chamber.
ta: நீங்கள் அறைக்குள் துண்டுகளை பம்ப் செய்யக்கூடாது.

# validation.chase.DISTANT_EXCHANGE
source: The cells {{left}} and {{right}} are not adjacent to each other.
ta: {{left}}} மற்றும் {{right}} ஒருவருக்கொருவர் அருகில் இல்லை.

# validation.chase.INITIAL_INSTRUCTIONS_balanced
source: Select a piece to move. To start an exchange select the piece from which you want to remove speed, twice.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும். ஒரு பரிமாற்றத்தைத் தொடங்க நீங்கள் வேகத்தை அகற்ற விரும்பும் பகுதியைத் தேர்ந்தெடுக்கவும், இரண்டு முறை.

# validation.chase.INITIAL_INSTRUCTIONS_imbalanced
source: You are imbalanced by {{delta}} speed. Select one of your pieces with the lowest speed to correct.
ta: நீங்கள் {{delta}} வேகத்தால் சமநிலையற்றவர்கள். சரிசெய்ய குறைந்த வேகத்துடன் உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.chase.INVALID_SPEED
source: The speed {{speed}} is not valid for {{cell}}. It must be between 1 and 6.
ta: {{cell} க்கு க்கு விரைவு {{speed}} செல்லுபடியாகாது. இது 1 முதல் 6 வரை இருக்க வேண்டும்.

# validation.chase.MULTIPLE_PATHS
source: There is more than one way to get to {{to}} from {{from}}. Please edit the move box to add a compass direction or choose the exact move from the drop-down menu.
ta: } இருந்து இலிருந்து {{to}} க்குச் செல்ல ஒன்றுக்கு மேற்பட்ட வழிகள் உள்ளன. திசைகாட்டி திசையைச் சேர்க்க நகர்வு பெட்டியைத் திருத்தவும் அல்லது கீழ்தோன்றும் மெனுவிலிருந்து சரியான நகர்வைத் தேர்வுசெய்க.

# validation.chase.MUST_BALANCE
source: You are imbalanced. Your move must begin with a '{'.
ta: நீங்கள் சமநிலையற்றவர்கள். உங்கள் நடவடிக்கை ஒரு '{' உடன் தொடங்க வேண்டும்.

# validation.chase.NO_BALANCE
source: You are not imbalanced, your move can not begin with a '{'.
ta: நீங்கள் சமநிலையற்றவர்கள் அல்ல, உங்கள் நடவடிக்கை ஒரு '{' உடன் தொடங்க முடியாது.

# validation.chase.NO_BALANCE_LEFT
source: You don't have any balance left to distribute to {{where}}.
ta: {{where}} க்கு விநியோகிக்க உங்களுக்கு எந்த சமநிலையும் இல்லை.

# validation.chase.NOCHANGE_EXCHANGE
source: Exchanges must result in a change in the board state.
ta: பரிமாற்றங்கள் வாரிய மாநிலத்தில் மாற்றத்தை ஏற்படுத்த வேண்டும்.

# validation.chase.NOPATH
source: There is no path from {{from}} to {{to}}.
ta: }} From} {{from}} வரை {{எந்த பாதையும் இல்லை.

# validation.chase.PARTIAL_BALANCE
source: You are still imbalanced by {{delta}} speed. Select another of your pieces with the lowest speed to correct.
ta: நீங்கள் இன்னும் {{delta}} வேகத்தால் சமநிலையற்றவர்கள். சரிசெய்ய குறைந்த வேகத்துடன் உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.chase.PARTIAL_BALANCE_PARENTHESIS
source: Looks like a valid balance move, close the parenthesis to continue.
ta: செல்லுபடியாகும் சமநிலை நகர்வு போல் தெரிகிறது, தொடர அடைப்புக்குறிக்குள் மூடவும்.

# validation.chase.PARTIAL_EXCHANGE
source: Select another adjacent piece to make the exchange. Or click again to remove more speed.
ta: பரிமாற்றத்தை உருவாக்க மற்றொரு அருகிலுள்ள பகுதியைத் தேர்ந்தெடுக்கவும். அல்லது அதிக வேகத்தை அகற்ற மீண்டும் சொடுக்கு செய்க.

# validation.chase.PARTIAL_MOVE
source: Select a destination, or select the same piece again to begin an exchange.
ta: பரிமாற்றத்தைத் தொடங்க ஒரு இலக்கைத் தேர்ந்தெடுக்கவும் அல்லது அதே பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.chase.UNEQUAL_EXCHANGE
source: Exchanges must result in the same combined speed. The original combined speed was {{original}}. Your requested move would change that to {{proposed}}.
ta: பரிமாற்றங்கள் ஒரே ஒருங்கிணைந்த வேகத்தை ஏற்படுத்த வேண்டும். அசல் ஒருங்கிணைந்த விரைவு {{original}}. நீங்கள் கோரப்பட்ட நடவடிக்கை அதை {{proposed} பெறுநர் ஆக மாற்றும்.

# validation.churn.BAD_PLACE
source: If an isolated placement is available, you must make it. If that is not possible, you must form the smallest group possible.
ta: தனிமைப்படுத்தப்பட்ட வேலைவாய்ப்பு கிடைத்தால், நீங்கள் அதை செய்ய வேண்டும். அது சாத்தியமில்லை என்றால், நீங்கள் சாத்தியமான மிகச்சிறிய குழுவை உருவாக்க வேண்டும்.

# validation.churn.INITIAL_INSTRUCTIONS
source: Select an empty cell to place a piece.
ta: ஒரு துண்டு வைக்க வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.cifra.INITIAL_INSTRUCTIONS_choose
source: Use the buttons to select your play colour and board side. Your opponent will then make the first move. "Light" refers to cells that are the background colour. "Bottom" refers to row 1.
ta: உங்கள் விளையாட்டு வண்ணம் மற்றும் போர்டு பக்கத்தைத் தேர்ந்தெடுக்க பொத்தான்களைப் பயன்படுத்தவும். உங்கள் எதிர்ப்பாளர் முதல் நகர்வை மேற்கொள்வார். "ஒளி" என்பது பின்னணி நிறமாக இருக்கும் கலங்களைக் குறிக்கிறது. "கீழே" என்பது வரிசை 1 ஐ குறிக்கிறது.

# validation.cifra.INITIAL_INSTRUCTIONS_play
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.cifra.INITIAL_INSTRUCTIONS_setup
source: Select a piece from your stash to place on the board. In "King" mode, the 5 (or 9) will become the actual king.
ta: பலகையில் வைக்க உங்கள் ச்டாசிலிருந்து ஒரு பகுதியைத் தேர்ந்தெடுக்கவும். "கிங்" பயன்முறையில், 5 (அல்லது 9) உண்மையான ராசாவாக மாறும்.

# validation.cifra.INVALID_MOVE
source: The move {{move}} does not appear to be valid. Remember that you may not move or capture pieces that have made it to the far row.
ta: {{move}} நகர்வு செல்லுபடியாகாது. தூர வரிசையில் உருவாக்கிய துண்டுகளை நீங்கள் நகர்த்தவோ அல்லது கைப்பற்றவோ கூடாது என்பதை நினைவில் கொள்ளுங்கள்.

# validation.cifra.NO_DUPES_cell
source: You may only place one piece per cell.
ta: நீங்கள் ஒரு கலத்திற்கு ஒரு துண்டு மட்டுமே வைக்கலாம்.

# validation.cifra.NO_DUPES_pc
source: You may only place one of each piece type on the board.
ta: ஒவ்வொரு துண்டு வகையிலும் ஒன்றை மட்டுமே பலகையில் வைக்கலாம்.

# validation.cifra.ONLY_HOME
source: You may only place pieces on your home row.
ta: உங்கள் வீட்டு வரிசையில் மட்டுமே துண்டுகளை வைக்கலாம்.

# validation.cifra.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.cifra.PARTIAL_PLACE
source: Select the cell on your home row to place your {{piece}} piece.
ta: உங்கள் {{piece}} துண்டு வைக்க உங்கள் வீட்டு வரிசையில் உள்ள கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.cifra.PARTIAL_SETUP
source: Place your last piece.
ta: உங்கள் கடைசி பகுதியை வைக்கவும்.

# validation.clearcut.BAD_CROSSING
source: Lines may only cross if the group created by the piece placed is larger than at least one opposing group in the crosscut.
ta: வைக்கப்பட்டுள்ள துண்டு மூலம் உருவாக்கப்பட்ட குழு குறுக்குவழியில் குறைந்தது ஒரு எதிரெதிர் குழுவை விட பெரியதாக இருந்தால் மட்டுமே கோடுகள் கடக்கக்கூடும்.

# validation.clearcut.BAD_CROSSING_CLEARCUT
source: Lines may only cross if the group created by the piece placed is larger than each individual opposing group in the crosscut.
ta: வைக்கப்பட்டுள்ள துண்டு மூலம் உருவாக்கப்பட்ட குழு குறுக்குவழியில் உள்ள ஒவ்வொரு எதிரெதிர் குழுவையும் விட பெரியதாக இருந்தால் மட்டுமே கோடுகள் கடக்கக்கூடும்.

# validation.clearcut.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.clearcut.INITIAL_INSTRUCTIONS
source: Select a point to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும்.

# validation.clusterfuss.ADJ_ONLY
source: Pieces may only move to orthogonally adjacent spaces.
ta: துண்டுகள் ஆர்த்தோகனலி அருகிலுள்ள இடங்களுக்கு மட்டுமே செல்லக்கூடும்.

# validation.clusterfuss.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.clusterfuss.INITIAL_INSTRUCTIONS
source: Select one of your pieces with which to capture.
ta: கைப்பற்ற உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.clusterfuss.MUST_CAPTURE
source: Every move must capture, but there is no piece at {{where}} to capture.
ta: ஒவ்வொரு அசைவும் கைப்பற்றப்பட வேண்டும், ஆனால் {{where} at இல் பிடிக்க எந்த துண்டு இல்லை.

# validation.clusterfuss.PARTIAL
source: Select an orthogonally adjacent piece to capture (yours or your opponent's).
ta: (உங்களுடையது அல்லது உங்கள் எதிரியின்) ஒரு ஆர்த்தோகனலி அருகிலுள்ள பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.clusterfuss.SINGLE_GROUP
source: After your capture, there must be only one orthogonally connected group that contains your own checkers.
ta: உங்கள் கைப்பற்றப்பட்ட பிறகு, உங்கள் சொந்த செக்கர்களைக் கொண்ட ஒரே ஒரு ஆர்த்தோகனிகல் இணைக்கப்பட்ட குழு மட்டுமே இருக்க வேண்டும்.

# validation.complica.INITIAL_INSTRUCTIONS
source: Select the column into which to drop your stone.
ta: உங்கள் கல்லைக் கைவிட வேண்டிய நெடுவரிசையைத் தேர்ந்தெடுக்கவும்.

# validation.conect.INITIAL_INSTRUCTIONS
source: Select a cell to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.conect.NO_CENTRE
source: On a narrow cone, the cell {{cell}} does not exist.
ta: ஒரு குறுகிய கூம்பில், செல் {{cell}} இல்லை.

# validation.conect.WRONG_CELL
source: The cell {{cell}} is equivalent to {{other}}. We use the latter, which is the one on the southern edge.
ta: செல் {{cell}} {{other} க்கு க்கு சமம். நாங்கள் பிந்தையதைப் பயன்படுத்துகிறோம், இது தெற்கு விளிம்பில் உள்ளது.

# validation.conhex.INITIAL_INSTRUCTIONS
source: Select a vertex to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு வெர்டெக்சைத் தேர்ந்தெடுக்கவும்.

# validation.conhex.INVALID_VERTEX
source: The vertex {{vertex}} does not exist on the board.
ta: வெர்டெக்ச் {{vertex}} போர்டில் இல்லை.

# validation.conhex.OCCUPIED
source: The vertex {{where}} is already occupied.
ta: வெர்டெக்ச் {{where}} ஏற்கனவே ஆக்கிரமிக்கப்பட்டுள்ளது.

# validation.connect6.COLLINEAR_FIRST
source: Your first stone must be collinear with a stone placed on the last turn.
ta: உங்கள் முதல் கல் கடைசி திருப்பத்தில் வைக்கப்பட்ட ஒரு கல்லுடன் கோலைனியர் இருக்க வேண்டும்.

# validation.connect6.COLLINEAR_SECOND
source: Your second stone must be collinear with your first stone.
ta: உங்கள் இரண்டாவது கல் உங்கள் முதல் கல்லுடன் கோலைனியர் இருக்க வேண்டும்.

# validation.connect6.EXCESS
source: You have placed too many stones. You may only place 2 stones.
ta: நீங்கள் பல கற்களை வைத்துள்ளீர்கள். நீங்கள் 2 கற்களை மட்டுமே வைக்கலாம்.

# validation.connect6.EXCESS_FIRST
source: You have placed too many stones. You may only place 1 stone in the normal opening as the first player.
ta: நீங்கள் பல கற்களை வைத்துள்ளீர்கள். முதல் வீரராக சாதாரண திறப்பில் 1 கல்லை மட்டுமே வைக்கலாம்.

# validation.connect6.INITIAL_INSTRUCTIONS
source: Select 2 intersections to place your stones.
ta: உங்கள் கற்களை வைக்க 2 குறுக்குவெட்டுகளைத் தேர்ந்தெடுக்கவும்.

# validation.connect6.INITIAL_INSTRUCTIONS_SWAP3RD2
source: Place 2 stones in the centre 5x5 square.
ta: மையத்தில் 5 ஃச் 5 சதுரத்தில் 2 கற்களை வைக்கவும்.

# validation.connect6.INITIAL_INSTRUCTIONS_SWAP3RD4
source: Select 2 intersections to place your stones, or pass to swap colours.
ta: உங்கள் கற்களை வைக்க 2 குறுக்குவெட்டுகளைத் தேர்ந்தெடுக்கவும் அல்லது வண்ணங்களை மாற்றவும்.

# validation.connect6.NO_MOVELIST
source: Move list not available for this game. Click on the board to place stones.
ta: இந்த விளையாட்டுக்கு பட்டியல் கிடைக்கவில்லை. கற்களை வைக்க பலகையில் சொடுக்கு செய்க.

# validation.connect6.NONCOLLINEAR_SECOND
source: Your second stone cannot be collinear with your first stone.
ta: உங்கள் இரண்டாவது கல் உங்கள் முதல் கல்லுடன் கோலினியர் ஆக முடியாது.

# validation.connect6.ONE_MORE
source: Place 1 more stone on the board.
ta: போர்டில் மேலும் 1 கல்லை வைக்கவும்.

# validation.connect6.SWAP3RD2_INVALID
source: You may only place your stones in the centre 5x5 area for the second move in the swap-3rd opening.
ta: இடமாற்று -3 வது திறப்பில் இரண்டாவது நகர்வுக்காக உங்கள் கற்களை மைய 5x5 பகுதியில் மட்டுமே வைக்கலாம்.

# validation.connect6.SWAP3RD2_ONE_MORE
source: Place 1 more stone in the centre 5x5 square.
ta: 5x5 சதுர மையத்தில் மேலும் 1 கல்லை வைக்கவும்.

# validation.connecticut.FIRST_TRIOMINO
source: You may not place a triomino on the first move.
ta: முதல் நகர்வில் நீங்கள் ஒரு ட்ரியோமினோவை வைக்கக்கூடாது.

# validation.connecticut.INITIAL_INSTRUCTIONS
source: Select a vertex to place a piece, or to mark the start of the 1x3 triomino piece.
ta: ஒரு துண்டு வைக்க ஒரு வெர்டெக்சைத் தேர்ந்தெடுக்கவும் அல்லது 1x3 ட்ரியோமினோ துண்டின் தொடக்கத்தைக் குறிக்க.
