Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# variants.tablero.5-10.description
source: By adding 4 to the value of each centre space, the ratio of highest space to lowest is compressed from 6:1 to 2:1. This incentivizes more active competition for lower spaces.
ta: ஒவ்வொரு மைய இடத்தின் மதிப்பிலும் 4 ஐ சேர்ப்பதன் மூலம், அதிக இடத்தின் விகிதத்தின் விகிதம் 6: 1 முதல் 2: 1 வரை சுருக்கப்படுகிறது. இது குறைந்த இடைவெளிகளுக்கு மிகவும் சுறுசுறுப்பான போட்டியை ஊக்குவிக்கிறது.

# variants.tablero.abba.name
source: Balanced start
ta: சமநிலையான தொடக்க

# variants.tablero.abba.description
source: On the first move of the game, the player only rolls one die.
ta: விளையாட்டின் முதல் நகர்வில், வீரர் ஒரு இறப்பை மட்டுமே உருட்டுகிறார்.

# variants.tafl.#variant.description
source: Linnaean Sámi Tablut with historical rules based on a recent reconstruction from Linnaeus' diary. It is an edge escape variant with an armed king that is strong on the throne and on the four squares adjacent to the throne, but weak everywhere else.
ta: லின்னேயசின் நாட்குறிப்பின் அண்மைக் கால புனரமைப்பின் அடிப்படையில் வரலாற்று விதிகளுடன் லின்னேயன் கடவுள் தப்லட். இது ஒரு ஆயுத ராசாவுடன் ஒரு விளிம்பு தப்பிக்கும் மாறுபாடாகும், இது சிம்மாசனத்திலும், சிம்மாசனத்தை ஒட்டியுள்ள நான்கு சதுரங்களிலும் வலுவாக உள்ளது, ஆனால் மற்ற எல்லா இடங்களிலும் பலவீனமாக உள்ளது.

# variants.tafl.#variant.name
source: linnaean-9x9-tcross-w
ta: லின்னேயன் -9 ஃச் 9-டிகிராச்-டபிள்யூ

# variants.tafl.berserk-11x11-tdiamondberserk.description
source: Berserk variant of the Fetlar rules with knights and commanders. Multi-step captures are permitted, and the king may escape to the corner immediately after a capture.
ta: மாவீரர்கள் மற்றும் தளபதிகளுடன் ஃபெட்லர் விதிகளின் பெர்செர்க் மாறுபாடு. மல்டி-ச்டெப் பிடிப்புகள் அனுமதிக்கப்படுகின்றன, மேலும் கிங் ஒரு பிடிக்கப்பட்ட உடனேயே மூலையில் தப்பிக்கலாம்.

# variants.tafl.berserk-11x11-tdiamondberserk.name
source: berserk-11x11-tdiamondberserk
ta: பெர்செர்க்-11x11-டிவைரம்பெர்செர்க்

# variants.tafl.copenhagen-11x11-tdiamond.description
source: Popular Hnefatafl variant based on the Fetlar rules with strong armed king and corner escape rules. Has shield wall captures and exit forts.
ta: வலுவான ஆயுதக் கிங் மற்றும் கார்னர் எச்கேப் விதிகளுடன் ஃபெட்லர் விதிகளின் அடிப்படையில் பிரபலமான Hnefatafl மாறுபாடு. சீல்ட் சுவர் பிடிப்புகள் மற்றும் வெளியேறும் கோட்டைகளைக் கொண்டுள்ளது.

# variants.tafl.copenhagen-11x11-tdiamond.name
source: copenhagen-11x11-tdiamond
ta: கோபன்ஏகன் -11x11-டையமண்ட்

# variants.tafl.linnaean-11x11-belldiamond-w.description
source: Bell-diamond setup with historical rules based on a recent reconstruction from Linnaeus' diary. It is an edge escape variant with an armed king that is strong on the throne and on the four squares adjacent to the throne, but weak everywhere else.
ta: லின்னேயசின் நாட்குறிப்பின் அண்மைக் கால புனரமைப்பின் அடிப்படையில் வரலாற்று விதிகளுடன் பெல்-டயமண்ட் அமைப்பு. இது ஒரு ஆயுத ராசாவுடன் ஒரு விளிம்பு தப்பிக்கும் மாறுபாடாகும், இது சிம்மாசனத்திலும், அரியணையை ஒட்டியுள்ள நான்கு சதுரங்களிலும் வலுவாக உள்ளது, ஆனால் மற்ற எல்லா இடங்களிலும் பலவீனமாக உள்ளது.

# variants.tafl.linnaean-11x11-belldiamond-w.name
source: linnaean-11x11-belldiamond-w
ta: லின்னியன் -11 ஃச் 11-பெல்டியமண்ட்-டபிள்யூ

# variants.tafl.linnaean-11x11-lewiscross-w.description
source: Lewis-cross setup with historical rules based on a recent reconstruction from Linnaeus' diary. It is an edge escape variant with an armed king that is strong on the throne and on the four squares adjacent to the throne, but weak everywhere else.
ta: லின்னேயசின் நாட்குறிப்பின் அண்மைக் கால புனரமைப்பின் அடிப்படையில் வரலாற்று விதிகளுடன் லூயிச்-குறுக்கு அமைப்பு. இது ஒரு ஆயுத ராசாவுடன் ஒரு விளிம்பு தப்பிக்கும் மாறுபாடாகும், இது சிம்மாசனத்திலும், அரியணையை ஒட்டியுள்ள நான்கு சதுரங்களிலும் வலுவாக உள்ளது, ஆனால் மற்ற எல்லா இடங்களிலும் பலவீனமாக உள்ளது.

# variants.tafl.linnaean-11x11-lewiscross-w.name
source: linnaean-11x11-lewiscross-w
ta: லின்னேயன் -11 ஃச் 11-லூயிச்கிராச்-டபிள்யூ

# variants.tafl.magpie-7x7-cross.description
source: A Hnefatafl variant from the book The Leprechaun Companion by Nigel Suckling. It has a strong armed King that only moves one space. The king can be captured on the edges.
ta: நைகல் சக்லிங் எழுதிய தி லெப்ரெச்சான் கம்பானியன் புத்தகத்திலிருந்து ஒரு hnefatafl மாறுபாடு. இது ஒரு வலுவான ஆயுத ராசாவைக் கொண்டுள்ளது, அது ஒரு இடத்தை மட்டுமே நகர்த்துகிறது. ராசாவை விளிம்புகளில் கைப்பற்ற முடியும்.

# variants.tafl.magpie-7x7-cross.name
source: magpie-7x7-cross
ta: மாக்பி -7 ஃச் 7-கிராச்

# variants.tafl.seabattle-9x9-starsquare-w.description
source: Strong unarmed king and edge escape on a 9x9 board.
ta: 9x9 போர்டில் வலுவான நிராயுதபாணியான மன்னன் மற்றும் எட்ச் எச்கேப்.

# variants.tafl.seabattle-11x11-tcross-w.description
source: Strong unarmed king and edge escape on a 11x11 board.
ta: 11x11 போர்டில் வலுவான நிராயுதபாணியான மன்னன் மற்றும் எட்ச் எச்கேப்.

# variants.tafl.seabattle-11x11-tcross-w.name
source: seabattle-11x11-tcross-w
ta: SeaBattle-11x11-tcrorse-w

# variants.tafl.total-11x11-tdiamond.description
source: A combination of Fetlar, Copenhagen and Berserk rules. It is a strong armed king with corner escape rules, with shield wall captures, exit forts, and encirclement win. Berserk capture is enabled and the king can make a berserk escape. Repetitions result in a draw.
ta: ஃபெட்லர், கோபன்ஏகன் மற்றும் பெர்செர்க் விதிகளின் கலவையாகும். சீல்ட் வால் பிடிப்புகள், வெளியேறும் கோட்டைகள் மற்றும் சுற்றறிக்கை செய் ஆகியவற்றைக் கொண்ட மூலையில் தப்பிக்கும் விதிகளுடன் இது ஒரு வலுவான ஆயுத ராசாவாகும். பெர்செர்க் பிடிப்பு இயக்கப்பட்டது மற்றும் மன்னன் ஒரு மோசமான தப்பிக்க முடியும். மறுநிகழ்வுகள் ஒரு சமநிலையை ஏற்படுத்துகிறது.

# variants.tafl.total-11x11-tdiamond.name
source: total-11x11-tdiamond
ta: மொத்தம் -11x11-tdiamond

# variants.tafl.tyr-11x11-tyr.description
source: Berserk rules with weak armed king and edge escape on a 11x11 board. This is the default simple Tyr setup without special pieces.
ta: பலவீனமான ஆயுதக் கிங் மற்றும் எட்ச் 11x11 போர்டில் தப்பிக்கும் பெர்செர்க் விதிகள். சிறப்பு துண்டுகள் இல்லாமல் இயல்புநிலை எளிய டைர் அமைப்பு இது.

# variants.tafl.tyr-11x11-tyr.name
source: tyr-11x11-tyr
ta: டைர் -11x11 டைர்

# variants.tafl.tyr-15x15-tyr.description
source: Berserk rules with weak armed king and edge escape on a 15x15 board. This is the default simple Tyr setup without special pieces.
ta: பலவீனமான ஆயுதக் கிங் மற்றும் எட்ச் 15x15 போர்டில் தப்பிக்கும் பெர்செர்க் விதிகள். சிறப்பு துண்டுகள் இல்லாமல் இயல்புநிலை எளிய டைர் அமைப்பு இது.

# variants.tafl.tyr-15x15-tyr.name
source: tyr-15x15-tyr
ta: டைர் -15x15 காளைகள்

# variants.taiji.#board.name
source: Default board: 9x9
ta: இயல்புநிலை பலகை: 9x9

# variants.taiji.#groups.name
source: Scoring: Largest two groups
ta: மதிப்பெண்: மிகப்பெரிய இரண்டு குழுக்கள்

# variants.taiji.#scoring.name
source: Simple sum
ta: எளிய தொகை

# variants.taiji.7x7.name
source: Smaller board: 7x7
ta: சிறிய பலகை: 7x7

# variants.taiji.11x11.name
source: Larger board: 11x11
ta: பெரிய பலகை: 11x11

# variants.taiji.onegroup.name
source: Scoring: Single largest group
ta: மதிப்பெண்: ஒற்றை பெரிய குழு

# variants.taiji.products.description
source: Multiplies together the sizes of your n largest groups.
ta: உங்கள் மற்றும் பெரிய குழுக்களின் அளவை ஒன்றிணைக்கவும்.

# variants.taiji.products.name
source: Product
ta: தயாரிப்பு

# variants.taiji.squares.description
source: Adds together the square of each of your n largest groups.
ta: உங்கள் ஒவ்வொரு பெரிய குழுக்களின் சதுரத்தை ஒன்றாகச் சேர்க்கிறது.

# variants.taiji.squares.name
source: Sum of Squares
ta: சதுரங்களின் தொகை

# variants.taiji.threegroups.name
source: Scoring: Largest three groups
ta: மதிப்பெண்: மிகப்பெரிய மூன்று குழுக்கள்

# variants.taiji.tonga.name
source: Tonga (Diagonal Placement)
ta: டோங்கா (மூலைவிட்ட வேலைவாய்ப்பு)

# variants.take.#rules.description
source: Play on a size-5 board where plant growth destroys dirt.
ta: தாவர வளர்ச்சி அழுக்கை அழிக்கும் அளவு -5 பலகையில் விளையாடுங்கள்.

# variants.take.high-churn.description
source: Play on a size-4 board where plant growth does not destroy dirt.
ta: தாவர வளர்ச்சி அழுக்கை அழிக்காத அளவு -4 பலகையில் விளையாடுங்கள்.

# variants.take.high-churn.name
source: High Churn
ta: உயர் சர்ன்

# variants.take.quick-churn.description
source: Play on a size-3 board where plant growth does not destroy dirt.
ta: தாவர வளர்ச்சி அழுக்கை அழிக்காத அளவு -3 பலகையில் விளையாடுங்கள்.

# variants.take.quick-churn.name
source: Small, High Churn
ta: சிறிய, உயர் சர்ன்

# variants.terrace.#board.name
source: 6x6 board
ta: 6x6 போர்டு

# variants.terrace.#setup.description
source: Players start with fewer pieces.
ta: வீரர்கள் குறைவான துண்டுகளுடன் தொடங்குகிறார்கள்.

# variants.terrace.#setup.name
source: Short game
ta: குறுகிய விளையாட்டு

# variants.terrace.#capture.description
source: The only capture possibility is diagonally down.
ta: ஒரே பிடிப்பு நிகழக்கூடிய குறுக்காக கீழே உள்ளது.

# variants.terrace.#capture.name
source: Default capture rules
ta: இயல்புநிலை பிடிப்பு விதிகள்

# variants.terrace.board-8.name
source: 8x8 board
ta: 8x8 போர்டு

# variants.terrace.long.name
source: Long game
ta: நீண்ட விளையாட்டு

# variants.terrace.long.description
source: Each player starts with more pieces.
ta: ஒவ்வொரு வீரரும் அதிக துண்டுகளுடன் தொடங்குகிறார்கள்.

# variants.terrace.assassination.name
source: Assassination
ta: படுகொலை

# variants.terrace.assassination.description
source: This variant expands the capturing options, leading to a more aggressive game.
ta: இந்த மாறுபாடு கைப்பற்றும் விருப்பங்களை விரிவுபடுத்துகிறது, இது மிகவும் ஆக்ரோசமான விளையாட்டுக்கு வழிவகுக்கிறது.

# variants.trax.loop.name
source: Loop Trax
ta: லூப் ட்ராக்ச்

# variants.trax.loop.description
source: The game must be won by a closed loop. Lines do not count in Loop Trax.
ta: ஆட்டத்தை மூடிய வளையத்தால் வெல்ல வேண்டும். லூப் ட்ராக்சில் கோடுகள் கணக்கிடாது.

# variants.trax.size-8.name
source: Size-8 board.
ta: அளவு -8 போர்டு.

# variants.trax.size-8.description
source: The board is limited to 8x8. If all the tiles that can be played without a win being achieved have been played, the player who plays the last tile loses.
ta: போர்டு 8x8 ஆக வரையறுக்கப்பட்டுள்ளது. செய் பெறாமல் விளையாடக்கூடிய அனைத்து ஓடுகளும் விளையாடியிருந்தால், கடைசி ஓடு விளையாடும் வீரர் இழக்கிறார்.

# variants.trike.#board.name
source: Triangle (11 wide)
ta: முக்கோணம் (11 அகலம்)

# variants.trike.#board.description
source: Casual board.
ta: சாதாரண வாரியம்.

# variants.trike.standard-7.description
source: Learning board.
ta: கற்றல் வாரியம்.

# variants.trike.standard-7.name
source: Triangle (7 wide)
ta: முக்கோணம் (7 அகலம்)

# variants.trike.standard-13.description
source: Competitive board.
ta: போட்டி வாரியம்.

# variants.trike.standard-13.name
source: Triangle (13 wide)
ta: முக்கோணம் (13 அகலம்)

# variants.trike.standard-15.description
source: Large board.
ta: பெரிய பலகை.

# variants.trike.standard-15.name
source: Triangle (15 wide)
ta: முக்கோணம் (15 அகலம்)

# variants.tritium.#board.name
source: Small board (size 5)
ta: சிறிய பலகை (அளவு 5)

# variants.tritium.#form.description
source: Play continues until all regions are claimed.
ta: அனைத்து பிராந்தியங்களும் உரிமை கோரப்படும் வரை விளையாட்டு தொடர்கிறது.

# variants.tritium.#form.name
source: Long form
ta: நீண்ட வடிவம்

# variants.tritium.short-form.description
source: Play with only three flags each.
ta: தலா மூன்று கொடிகளுடன் மட்டுமே விளையாடுங்கள்.

# variants.tritium.short-form.name
source: Short form.
ta: குறுகிய வடிவம்.

# variants.tritium.hex-6.name
source: Medium board (size 6)
ta: நடுத்தர பலகை (அளவு 6)

# variants.tritium.hex-7.name
source: Large board (size 7)
ta: பெரிய பலகை (அளவு 7)

# variants.tumbleweed.#board.name
source: Competitive board (8 cells)
ta: போட்டி வாரியம் (8 செல்கள்)

# variants.tumbleweed.size-6.name
source: Smaller board (6 cells)
ta: சிறிய பலகை (6 செல்கள்)

# variants.tumbleweed.size-10.name
source: Larger board (10 cells)
ta: பெரிய பலகை (10 செல்கள்)

# variants.tumbleweed.capture-delay.description
source: You may not place at where your opponent just placed.
ta: உங்கள் எதிர்ப்பாளர் இப்போது வைத்திருக்கும் இடத்தில் நீங்கள் வைக்கக்கூடாது.

# variants.tumbleweed.capture-delay.name
source: Capture delay
ta: நேரந்தவறுகை பிடிப்பு

# variants.tumbleweed.free-neutral.description
source: On the first turn, place a 2-stack neutral piece, and a 1-stack piece of each player's colour.
ta: முதல் திருப்பத்தில், 2-அடுக்கு நடுநிலை துண்டு மற்றும் ஒவ்வொரு வீரரின் நிறத்தின் 1-அடுக்கு துண்டையும் வைக்கவும்.

# variants.tumbleweed.free-neutral.name
source: Free neutral
ta: இலவச நடுநிலை

# variants.twixt.#board.name
source: Default board (24x24)
ta: இயல்புநிலை பலகை (24x24)

# variants.twixt.#ruleset.description
source: Links cannot cross. You may rearrange your links before you place your peg.
ta: இணைப்புகள் கடக்க முடியாது. உங்கள் PEG ஐ வைப்பதற்கு முன்பு உங்கள் இணைப்புகளை மறுசீரமைக்கலாம்.

# variants.twixt.pp.description
source: Players' own links are allowed to cross each other. There are no link rearrangements.
ta: வீரர்களின் சொந்த இணைப்புகள் ஒருவருக்கொருவர் கடக்க அனுமதிக்கப்படுகின்றன. இணைப்பு மறுசீரமைப்புகள் எதுவும் இல்லை.

# variants.twixt.pp.name
source: Paper and pencil
ta: காகிதம் மற்றும் பென்சில்

# variants.twixt.size-30.name
source: Larger board (30x30)
ta: பெரிய பலகை (30x30)

# variants.unlur.#board.name
source: Size-8 board
ta: அளவு -8 போர்டு

# variants.unlur.size-6.name
source: Size-6 board
ta: அளவு -6 போர்டு

# variants.unlur.size-10.name
source: Size-10 board
ta: அளவு -10 போர்டு

# variants.upperhand.#board.name
source: 5x5 board
ta: 5x5 போர்டு

# variants.upperhand.size-7.name
source: 7x7 board
ta: 7x7 போர்டு

# variants.upperhand.size-9.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.urbino.monuments.description
source: Monuments are combinations of specific pieces in a row. Each district will score the most valuable monument present for each colour. Most valuable monument becomes the first tie breaker in districts, but not when breaking end-of-game ties.
ta: நினைவுச்சின்னங்கள் ஒரு வரிசையில் குறிப்பிட்ட துண்டுகளின் சேர்க்கைகள். ஒவ்வொரு மாவட்டமும் ஒவ்வொரு வண்ணத்திற்கும் மிகவும் மதிப்புமிக்க நினைவுச்சின்னத்தை மதிப்பெண் பெறும். மிகவும் மதிப்புமிக்க நினைவுச்சின்னம் மாவட்டங்களில் முதல் டை பிரேக்கராக மாறுகிறது, ஆனால் விளையாட்டின் இறுதி உறவுகளை உடைக்கும்போது அல்ல.

# variants.urbino.monuments.name
source: Monuments
ta: நினைவுச்சின்னங்கள்

# variants.valley.king-swap.description
source: Kings start on the opposing side of the board.
ta: கிங்ச் போர்டின் எதிரெதிர் பக்கத்தில் தொடங்குகிறது.

# variants.valley.king-swap.name
source: Retrieve the King
ta: ராசாவை மீட்டெடுக்கவும்

# variants.valley.labyrinth.description
source: Board size increases to 7x7 and four towers further complicate the field.
ta: போர்டு அளவு 7x7 ஆக அதிகரிக்கிறது மற்றும் நான்கு கோபுரங்கள் புலத்தை மேலும் சிக்கலாக்குகின்றன.

# variants.valley.labyrinth.name
source: Labyrinth
ta: லாபிரிந்த்

# variants.valley.moon.description
source: Also 7x7 board with four towers, but the towers start in slightly different places, and players are able to move the towers.
ta: நான்கு கோபுரங்களுடன் 7x7 போர்டும், ஆனால் கோபுரங்கள் சற்று வித்தியாசமான இடங்களில் தொடங்குகின்றன, மேலும் வீரர்கள் கோபுரங்களை நகர்த்த முடிகிறது.

# variants.valley.moon.name
source: Moon Labyrinth
ta: சந்திரன் தளம்

# variants.veletas.#board.name
source: 10x10 board
ta: 10x10 போர்டு

# variants.veletas.#board.description
source: Default board with 7 neutral pieces.
ta: 7 நடுநிலை துண்டுகளுடன் இயல்புநிலை பலகை.

# variants.veletas.#setup.description
source: The first player places shooters and a stone of their colour, then the second player chooses if they want to invoke the pie rule. After that the second player places more shooters and a stone, and the game begins.
ta: முதல் வீரர் துப்பாக்கி சுடும் வீரர்களையும் அவற்றின் நிறத்தின் ஒரு கல்லையும் வைக்கிறார், பின்னர் இரண்டாவது வீரர் பை விதியை அழைக்க விரும்பினால் தேர்வு செய்கிறார். அதன் பிறகு இரண்டாவது வீரர் அதிக துப்பாக்கி சுடும் வீரர்களையும் ஒரு கல்லையும் வைக்கிறார், மேலும் விளையாட்டு தொடங்குகிறது.

# variants.veletas.#setup.name
source: Freestyle setup
ta: ஃப்ரீச்டைல் அமைப்பு

# variants.veletas.random.description
source: The starting board has shooters in randomised position. The first player makes a normal move and the second player decides if they want to invoke the pie rule.
ta: தொடக்க வாரியத்தில் சீரற்ற நிலையில் துப்பாக்கி சுடும் வீரர்கள் உள்ளனர். முதல் வீரர் ஒரு சாதாரண நகர்வை மேற்கொள்கிறார், இரண்டாவது வீரர் அவர்கள் பை விதியை அழைக்க விரும்பினால் தீர்மானிப்பார்.

# variants.veletas.random.name
source: Randomised setup
ta: சீரற்றவாறு அமைப்பு

# variants.veletas.size-7.description
source: Smaller board with 3 neutral pieces.
ta: 3 நடுநிலை துண்டுகள் கொண்ட சிறிய பலகை.

# variants.veletas.size-7.name
source: 7x7 board
ta: 7x7 போர்டு

# variants.veletas.size-9.description
source: Medium board with 5 neutral pieces.
ta: 5 நடுநிலை துண்டுகள் கொண்ட நடுத்தர பலகை.

# variants.veletas.size-9.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.verge.#board.name
source: Size-5 board (61 cells)
ta: அளவு -5 போர்டு (61 செல்கள்)

# variants.verge.size-7.name
source: Size-7 board (127 cells)
ta: அளவு -7 போர்டு (127 செல்கள்)

# variants.volo.#board.name
source: Size-7 board
ta: அளவு -7 போர்டு

# variants.volo.size-6.name
source: Size-6 board
ta: அளவு -6 போர்டு

# variants.volo.size-8.name
source: Size-8 board
ta: அளவு -8 போர்டு

# variants.wyke.6x6.name
source: Larger board: 6x6
ta: பெரிய பலகை: 6x6

# variants.zola.#board.name
source: Default board: 6x6
ta: இயல்புநிலை பலகை: 6x6

# variants.zola.8x8.name
source: Larger board: 8x8
ta: பெரிய பலகை: 8x8

# displays.akron.orb-3d.description
source: Use plain 3D orb textures.
ta: எளிய 3D உருண்டை அமைப்புகளைப் பயன்படுத்தவும்.

# displays.akron.orb-3d.name
source: 3D orbs
ta: 3 டி ஆர்ப்ச்

# displays.alta.hide-panel.description
source: Don't show panel to select orientation.
ta: நோக்குநிலையைத் தேர்ந்தெடுக்க பேனலைக் காட்ட வேண்டாம்.

# displays.alta.hide-panel.name
source: Hide panel
ta: குழு மறைக்க

# displays.anache.hide-frozen.description
source: Don't highlight frozen pieces.
ta: உறைந்த துண்டுகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.anache.hide-frozen.name
source: Hide frozen
ta: உறைந்ததை மறைக்கவும்

# displays.archimedes.hide-threatened.description
source: Don't highlight pieces that are threatened to be removed next turn.
ta: அடுத்த முறை அகற்றப்படும் என்று அச்சுறுத்தப்பட்ட துண்டுகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.archimedes.hide-threatened.name
source: Hide threatened
ta: அச்சுறுத்தலை மறைக்க

# displays.atoll.show-labels.description
source: Show labels for each cell.
ta: ஒவ்வொரு கலத்திற்கும் லேபிள்களைக் காட்டு.

# displays.atoll.show-labels.name
source: Show cell labels
ta: செல் லேபிள்களைக் காட்டு

# displays.bao.pips.description
source: Display the stones as pips instead of as numerals.
ta: கற்களை எண்களுக்கு பதிலாக பிப்சாகக் காண்பிக்கவும்.

# displays.bao.pips.name
source: Pips
ta: பிப்ச்

# displays.bide.isometric.description
source: Quasi-3D, isometric view
ta: அரை -3 டி, ஐசோமெட்ரிக் பார்வை

# displays.bide.isometric.name
source: Isometric
ta: ஐசோமெட்ரிக்

# displays.blockade.differentiated-walls.description
source: Display walls placed by each player in different colours.
ta: ஒவ்வொரு வீரரும் வெவ்வேறு வண்ணங்களில் வைக்கப்பட்டுள்ள சுவர்களைக் காண்பி.

# displays.blockade.differentiated-walls.name
source: Differentated walls
ta: வேறுபட்ட சுவர்கள்

# displays.blooms.hide-threatened.description
source: Don't show threatened stones.
ta: அச்சுறுத்தப்பட்ட கற்களைக் காட்ட வேண்டாம்.

# displays.blooms.hide-threatened.name
source: Hide threatened
ta: அச்சுறுத்தலை மறைக்க

# displays.bug.hide-moves.description
source: Don't show possible moves.
ta: சாத்தியமான நகர்வுகளைக் காட்ட வேண்டாம்.

# displays.bug.hide-moves.name
source: Hide moves
ta: நகர்வுகளை மறைக்கவும்

# displays.cannon.hide-threatened.description
source: Don't highlight pieces that are threatened by cannon fire.
ta: பீரங்கி நெருப்பால் அச்சுறுத்தப்படும் துண்டுகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.cannon.hide-threatened.name
source: Hide threatened by cannon
ta: பீரங்கியால் அச்சுறுத்தப்படுவதை மறைக்கவும்

# displays.ccorridor.hide-markers.description
source: Don't show visual markers for the location of the corridor and scored tiles.
ta: தாழ்வாரத்தின் இருப்பிடத்திற்கான காட்சி குறிப்பான்களைக் காட்ட வேண்டாம் மற்றும் ஓடுகள் அடித்தன.

# displays.ccorridor.hide-markers.name
source: Hide markers
ta: குறிப்பான்களை மறைக்கவும்

# displays.conect.display-hex.description
source: Display game on the rhombus board.
ta: ரோம்பச் போர்டில் விளையாட்டைக் காண்பி.

# displays.conect.display-hex.name
source: Display on rhombus
ta: ரோம்பசில் காண்பி

# displays.connecticut.hide-triominoes.description
source: Don't show the triominoes.
ta: ட்ரியோமினோக்களைக் காட்ட வேண்டாம்.

# displays.connecticut.hide-triominoes.name
source: Hide triominoes
ta: ட்ரியோமினோக்களை மறைக்கவும்

# displays.control.hide-control.name
source: Hide control
ta: கட்டுப்பாட்டை மறைக்கவும்

# displays.control.hide-control.description
source: Don't show indicators for controlled spaces.
ta: கட்டுப்படுத்தப்பட்ட இடங்களுக்கான குறிகாட்டிகளைக் காட்ட வேண்டாம்.

# displays.control.vertex-style.name
source: Vertex style
ta: வெர்டெக்ச் பாணி

# displays.control.vertex-style.description
source: Display the board using vertexes instead of hexes.
ta: எக்சுக்கு பதிலாக வெர்டெக்சைப் பயன்படுத்தி பலகையைக் காண்பி.

# displays.fourinarow.hide-moves.description
source: Don't show possible moves.
ta: சாத்தியமான நகர்வுகளைக் காட்ட வேண்டாம்.

# displays.fourinarow.hide-moves.name
source: Hide moves
ta: நகர்வுகளை மறைக்கவும்

# displays.gess.hide-piece-highlight.description
source: Don't highlight the 9x9 pieces.
ta: 9x9 துண்டுகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.gess.hide-piece-highlight.name
source: Hide 9x9 piece highlight
ta: 9x9 துண்டு சிறப்பம்சத்தை மறைக்கவும்

# displays.gyve.vertex-style.name
source: Vertex style
ta: வெர்டெக்ச் பாணி

# displays.gyve.vertex-style.description
source: Display the board using vertices instead of hexes.
ta: எக்சுக்கு பதிலாக செங்குத்துகளைப் பயன்படுத்தி பலகையைக் காண்பி.

# displays.irensei.hide-restrictions.description
source: Don't show intersections where the first player cannot place their stones.
ta: முதல் வீரர் தங்கள் கற்களை வைக்க முடியாத குறுக்குவெட்டுகளைக் காட்ட வேண்டாம்.

# displays.irensei.hide-restrictions.name
source: Hide restriction indicators
ta: கட்டுப்பாட்டு குறிகாட்டிகளை மறைக்கவும்

# displays.lox.hide-focus-threatened.description
source: Don't put additional highlight on pieces that are threatened to be captured.
ta: கைப்பற்றப்படும் என்று அச்சுறுத்தப்பட்ட துண்டுகளுக்கு கூடுதல் சிறப்பம்சத்தை வைக்க வேண்டாம்.

# displays.lox.hide-focus-threatened.name
source: Hide focus on threatened
ta: அச்சுறுத்தலில் கவனம் செலுத்துங்கள்

# displays.lox.dot-focus-threatened.description
source: Use dots as an additional highlight on pieces that are threatened to be captured.
ta: கைப்பற்றப்படும் என்று அச்சுறுத்தப்படும் துண்டுகளில் கூடுதல் சிறப்பம்சமாக புள்ளிகளைப் பயன்படுத்தவும்.

# displays.lox.dot-focus-threatened.name
source: Dots on threatened
ta: அச்சுறுத்தப்பட்ட புள்ளிகள்

# displays.lox.hide-controlled.description
source: Don't highlight controlled cells or threatened pieces for each player.
ta: ஒவ்வொரு வீரருக்கும் கட்டுப்படுத்தப்பட்ட செல்கள் அல்லது அச்சுறுத்தப்பட்ட துண்டுகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.lox.hide-controlled.name
source: Hide all controlled indicators
ta: கட்டுப்படுத்தப்பட்ட அனைத்து குறிகாட்டிகளையும் மறைக்கவும்

# displays.margo.orb-3d.description
source: Use plain 3D orb textures.
ta: எளிய 3D உருண்டை அமைப்புகளைப் பயன்படுத்தவும்.

# displays.margo.orb-3d.name
source: 3D orbs
ta: 3 டி ஆர்ப்ச்

# displays.mattock.hide-blocked.description
source: Don't highlight cells that cannot be mined.
ta: வெட்ட முடியாத கலங்களை முன்னிலைப்படுத்த வேண்டாம்.

# displays.mattock.hide-blocked.name
source: Hide blocked
ta: தடுக்கப்பட்டது

# displays.meridians.hide-threatened.description
source: Don't show threatened stones.
ta: அச்சுறுத்தப்பட்ட கற்களைக் காட்ட வேண்டாம்.
