Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# variants.accasta.pari.description
source: Instead of having individual piece types, pieces move depending on how many friendly pieces are in the stack. The top piece of a stack with three of your pieces will move like a chariot, two pieces like a horse, and one piece like a shield.
ta: தனிப்பட்ட துண்டு வகைகளைக் கொண்டிருப்பதற்குப் பதிலாக, அடுக்கில் எத்தனை நட்பு துண்டுகள் உள்ளன என்பதைப் பொறுத்து துண்டுகள் நகரும். உங்கள் மூன்று துண்டுகள் கொண்ட ஒரு அடுக்கின் மேல் துண்டு ஒரு தேர் போல நகரும், குதிரை போன்ற இரண்டு துண்டுகள், கவசம் போன்ற ஒரு துண்டு.

# variants.accasta.pari.name
source: Accasta Pari
ta: ஒரு சோடியை அட்டவணை

# variants.agere.#board.name
source: Triangle board (8 wide)
ta: முக்கோண வாரியம் (8 அகலம்)

# variants.agere.cobweb-small.description
source: A variant played on a round board where you try to connect two opposite sides.
ta: இரண்டு எதிர் பக்கங்களை இணைக்க முயற்சிக்கும் ஒரு சுற்று பலகையில் ஒரு மாறுபாடு விளையாடியது.

# variants.agere.cobweb-small.name
source: Cobweb (3 rings)
ta: கோப்வெப் (3 மோதிரங்கள்)

# variants.agere.limping.name
source: Limping 5-6 (75 spaces)
ta: 5-6 (75 இடைவெளிகள்)

# variants.agere.moon.description
source: A hexhex5 board with a subdivided centre cell and tweaked edges to form a moon-type surface.
ta: ஒரு துணைப்பிரிவு மைய கலத்துடன் ஒரு எக்ச்எக்ச் 5 போர்டு மற்றும் சந்திரன் வகை மேற்பரப்பை உருவாக்க விளிம்புகளை மாற்றியமைத்தது.

# variants.agere.moon.name
source: Moon (63 spaces)
ta: சந்திரன் (63 இடங்கள்)

# variants.agere.slanted-8.name
source: Slanted hex (8x8)
ta: சாய்ந்த ஃச் (8x8)

# variants.agere.slanted-10.name
source: Slanted hex (10x10)
ta: சாய்ந்த ஃச் (10x10)

# variants.agere.standard-11.description
source: A larger version of the standard board.
ta: நிலையான பலகையின் பெரிய பதிப்பு.

# variants.agere.standard-11.name
source: Triangle (11 wide)
ta: முக்கோணம் (11 அகலம்)

# variants.agere.standard-14.description
source: A larger version of the standard board.
ta: நிலையான பலகையின் பெரிய பதிப்பு.

# variants.agere.standard-14.name
source: Triangle (14 wide)
ta: முக்கோணம் (14 அகலம்)

# variants.akron.#board.name
source: size-9 board
ta: அளவு -9 போர்டு

# variants.akron.size-7.name
source: size-7 board (smaller)
ta: அளவு -7 போர்டு (சிறியது)

# variants.akron.size-11.name
source: size-11 board (larger)
ta: அளவு -11 போர்டு (பெரியது)

# variants.almatafl.advanced.description
source: Makes it harder for the defenders by allowing invaders to stack on top of a king on an exit space. Defender wins if they *start* their turn with the king on an escape spot.
ta: வெளியேறும் இடத்தில் ஒரு ராசாவின் மேல் படையெடுப்பாளர்களை அடுக்கி வைக்க அனுமதிப்பதன் மூலம் பாதுகாவலர்களுக்கு கடினமாக்குகிறது. தப்பிக்கும் இடத்தில் ராசாவுடன் அவர்கள் திரும்பியால் டிஃபென்டர் செய் பெறுவார்.

# variants.almatafl.advanced.name
source: Advanced
ta: மேம்பட்ட

# variants.almatafl.plus.description
source: Restricts stacking by not allowing pieces to move onto taller stacks directly.
ta: துண்டுகள் நேரடியாக உயரமான அடுக்குகளுக்கு செல்ல அனுமதிக்காததன் மூலம் அடுக்கி வைப்பதை கட்டுப்படுத்துகிறது.

# variants.almatafl.plus.name
source: Plus
ta: பிளச்

# variants.alta.#board.name
source: Size-9 board
ta: அளவு -9 போர்டு

# variants.alta.size-13.name
source: Size-13 board
ta: அளவு -13 போர்டு

# variants.amazons.#setup.description
source: Queens of each colour are on opposite halves of the board.
ta: ஒவ்வொரு வண்ணத்தின் ராணிகளும் பலகையின் எதிர் பகுதிகளில் உள்ளன.

# variants.amazons.cross.description
source: Queens of the same colour are situated across from each other.
ta: அதே நிறத்தின் ராணிகள் ஒருவருக்கொருவர் முழுவதும் அமைந்துள்ளன.

# variants.amazons.cross.name
source: Cross
ta: குறுக்கு

# variants.amazons.scrambled.description
source: Queens alternate colour around the board.
ta: ராணிகள் பலகையைச் சுற்றி மாற்று நிறம்.

# variants.amazons.scrambled.name
source: Scrambled
ta: துருவல்

# variants.anache.#board.name
source: Size-12 board
ta: அளவு -12 போர்டு

# variants.anache.#board.description
source: 12x12 board with 4 rows of 10 pieces per player.
ta: ஒரு வீரருக்கு 10 துண்டுகள் 4 வரிசைகள் கொண்ட 12x12 போர்டு.

# variants.anache.size-10.description
source: 10x10 board with 3 rows of 8 pieces per player.
ta: ஒரு வீரருக்கு 8 துண்டுகள் 3 வரிசைகள் கொண்ட 10x10 போர்டு.

# variants.anache.size-10.name
source: Size-10 board
ta: அளவு -10 போர்டு

# variants.anache.size-15.description
source: 15x15 board with 5 rows of 13 pieces per player.
ta: ஒரு வீரருக்கு 13 துண்டுகள் 5 வரிசைகள் கொண்ட 15x15 போர்டு.

# variants.anache.size-15.name
source: Size-15 board
ta: அளவு -15 போர்டு

# variants.archimedes.8x10.description
source: An elongated board that breaks up the power of a central diagonal
ta: நடு மூலைவிட்டத்தின் சக்தியை உடைக்கும் ஒரு நீளமான பலகை

# variants.archimedes.8x10.name
source: 8x10 board
ta: 8x10 போர்டு

# variants.armadas.#obstacles.name
source: One obstacle
ta: ஒரு தடையாக

# variants.armadas.freeform.description
source: Lets the players determine their own fleet compositions. Requires good communication before starting.
ta: வீரர்கள் தங்கள் சொந்த கடற்படை கலவைகளை தீர்மானிக்க அனுமதிக்கிறது. தொடங்குவதற்கு முன் நல்ல தொடர்பு தேவை.

# variants.armadas.freeform.name
source: Freeform
ta: ஃப்ரீஃபார்ம்

# variants.armadas.noislands.description
source: No starting islands
ta: தொடக்க தீவுகள் இல்லை

# variants.armadas.noislands.name
source: No obstacles
ta: தடைகள் இல்லை

# variants.armadas.twoislands.name
source: Two islands
ta: இரண்டு தீவுகள்

# variants.asli.#board.name
source: 13x13 board
ta: 13x13 போர்டு

# variants.asli.#komi.name
source: Komi swap
ta: கோமா இடமாற்று

# variants.asli.#komi.description
source: At the start of the game, the first player sets komi and the second player chooses sides.
ta: விளையாட்டின் தொடக்கத்தில், முதல் வீரர் கோமியை அமைக்கிறார், இரண்டாவது வீரர் பக்கங்களைத் தேர்வு செய்கிறார்.

# variants.asli.#rules.description
source: Incursions are legal.
ta: ஊடுருவல்கள் சட்டபூர்வமானவை.

# variants.asli.board-9.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.asli.board-11.name
source: 11x11 board
ta: 11x11 போர்டு

# variants.asli.board-15.name
source: 15x15 board
ta: 15x15 போர்டு

# variants.asli.board-17.name
source: 17x17 board
ta: 17x17 போர்டு

# variants.asli.board-19.name
source: 19x19 board
ta: 19x19 வாரியம்

# variants.asli.board-27.name
source: 27x27 board
ta: 27x27 போர்டு

# variants.asli.setkomi.name
source: 7 komi
ta: 7 வருகிறது

# variants.asli.setkomi.description
source: Komi is preset to 7.
ta: கோமி 7 க்கு முன்னமைக்கப்பட்டார்.

# variants.asli.woven.name
source: Woven
ta: நெய்த

# variants.asli.woven.description
source: Incursions are not legal.
ta: ஊடுருவல்கள் சட்டபூர்வமானவை அல்ல.

# variants.assembly.defective.name
source: Defective product
ta: குறைபாடுள்ள தயாரிப்பு

# variants.assembly.defective.description
source: A single defective product is added to the bag that causes the owner to lose points.
ta: ஒரு குறைபாடுள்ள தயாரிப்பு பையில் சேர்க்கப்படுகிறது, இது உரிமையாளர் புள்ளிகளை இழக்கச் செய்கிறது.

# variants.ataxx.#board.name
source: Size-7 square board
ta: அளவு -7 சதுர பலகை

# variants.ataxx.hex-5.name
source: Size-5 hexagon board
ta: அளவு -5 அறுகோண பலகை

# variants.ataxx.square-5.name
source: Size-5 square board
ta: அளவு -5 சதுர பலகை

# variants.ataxx.square-7-cross.name
source: Size-7 square board with cross block
ta: குறுக்கு தொகுதி கொண்ட அளவு -7 சதுர பலகை

# variants.ataxx.straight-jumps-only.description
source: Pieces can only jump in a straight line (no knight jumps).
ta: துண்டுகள் ஒரு நேர் கோட்டில் மட்டுமே குதிக்க முடியும் (நைட் தாவல்கள் இல்லை).

# variants.ataxx.straight-jumps-only.name
source: Straight jumps only
ta: நேராக தாவல்கள் மட்டுமே

# variants.atoll.#board.name
source: size-11 board
ta: அளவு -11 போர்டு

# variants.atoll.size-15.name
source: size-15 board
ta: அளவு -15 போர்டு

# variants.atoll.size-19.name
source: size-19 board
ta: அளவு -19 போர்டு

# variants.attangle.grand.description
source: Played on a larger board, with more voids, and the goal now is to create five triple stacks.
ta: ஒரு பெரிய போர்டில் விளையாடியது, அதிக வெற்றிடங்களுடன், இப்போது குறிக்கோள் ஐந்து மூன்று அடுக்குகளை உருவாக்குவதாகும்.

# variants.attangle.grand.name
source: Grand Attangle
ta: கிராண்ட் அடாங்

# variants.ayu.#board.name
source: 13x13 board
ta: 13x13 போர்டு

# variants.ayu.size-9.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.ayu.size-11.name
source: 11x11 board
ta: 11x11 போர்டு

# variants.ayu.size-15.name
source: 15x15 board
ta: 15x15 போர்டு

# variants.ayu.size-17.name
source: 17x17 board
ta: 17x17 போர்டு

# variants.bao.kujifunza.description
source: The "beginner" version with no "kunamua" setup phase. The game starts with two stones in each pit.
ta: "குனாமுவா" அமைவு கட்டம் இல்லாத "தொடக்க" பதிப்பு. ஒவ்வொரு குழியிலும் இரண்டு கற்களுடன் விளையாட்டு தொடங்குகிறது.

# variants.bao.kujifunza.name
source: Bao la kujifunza
ta: கற்றல் மதிப்பெண்

# variants.bao.malawi.description
source: The house starts with 8 stones instead of 6.
ta: வீடு 6 க்கு பதிலாக 8 கற்களுடன் தொடங்குகிறது.

# variants.bao.malawi.name
source: Malawi
ta: மலாவி

# variants.basalt.pie.name
source: Custom pie offer
ta: தனிப்பயன் பை சலுகை

# variants.basalt.pie.description
source: First player places 2–4 pieces and then second player chooses what side to play.
ta: முதல் பிளேயர் 2-4 துண்டுகளை வைக்கிறது, பின்னர் இரண்டாவது வீரர் எந்த பக்கத்தில் விளையாட வேண்டும் என்பதை தேர்வு செய்கிறார்.

# variants.biscuit.excuse.name
source: The Excuse
ta: சாக்கு

# variants.biscuit.excuse.description
source: The excuse can be played next to any card but never scores any points. It is not included in any straights
ta: எந்தவொரு அட்டைக்கும் அடுத்ததாக சாக்கு விளையாடலாம், ஆனால் ஒருபோதும் எந்த புள்ளிகளையும் மதிப்பெண் பெறாது. இது எந்த நேரத்திலும் சேர்க்கப்படவில்லை

# variants.biscuit.#extended.name
source: No pawns or courts
ta: சிப்பாய்கள் அல்லது நீதிமன்றங்கள் இல்லை

# variants.biscuit.pawns-only.name
source: Pawns only
ta: சிப்பாய்கள் மட்டுமே

# variants.biscuit.pawns-only.description
source: Pawns count as either 1 or 10 when making elevensies and lie between 9s and Crowns in straights. Pawns in opposing hands are worth 3 points to the player who goes out.
ta: பான்ச் எலிவயனாக்கங்களை உருவாக்கும் போது 1 அல்லது 10 என எண்ணி, 9 கள் மற்றும் கிரீடங்களுக்கு இடையில் பொய் சொல்லும். எதிரெதிர் கைகளில் உள்ள சிப்பாய்கள் வெளியே செல்லும் வீரருக்கு 3 புள்ளிகள் மதிப்புடையவை.

# variants.biscuit.pawns+courts.name
source: Pawns and Courts
ta: சிப்பாய்கள் மற்றும் நீதிமன்றங்கள்

# variants.biscuit.pawns+courts.description
source: Pawns and Courts can only make elevensies with each other. In straights, the order is 9, Pawn, Court, Crown. Both Pawns and Courts are worth 3 points to the player who goes out.
ta: சிப்பாய்கள் மற்றும் நீதிமன்றங்கள் ஒருவருக்கொருவர் உயர்த்திகளை மட்டுமே செய்ய முடியும். நேராக, கட்டளை 9, சிப்பாய், அறமன்றம், கிரீடம். சிப்பாய்கள் மற்றும் நீதிமன்றங்கள் இரண்டும் வெளியே செல்லும் வீரருக்கு 3 புள்ளிகள் மதிப்புடையவை.

# variants.biscuit.#eog.name
source: Goal score: 60 points
ta: கோல் ச்கோர்: 60 புள்ளிகள்

# variants.biscuit.#eog.description
source: The game ends after the round in which someone reaches the goal score. Highest score wins.
ta: யாரோ கோல் மதிப்பெண்ணை அடையும் சுற்றுக்குப் பிறகு விளையாட்டு முடிகிறது. அதிக மதிப்பெண் வெற்றிகள்.

# variants.biscuit.goal-40.name
source: Goal score: 40 points
ta: கோல் ச்கோர்: 40 புள்ளிகள்

# variants.biscuit.goal-40.description
source: The game ends after the round in which someone reaches the goal score. Highest score wins.
ta: யாரோ கோல் மதிப்பெண்ணை அடையும் சுற்றுக்குப் பிறகு விளையாட்டு முடிகிறது. அதிக மதிப்பெண் வெற்றிகள்.

# variants.biscuit.goal-80.name
source: Goal score: 80 points
ta: கோல் ச்கோர்: 80 புள்ளிகள்

# variants.biscuit.goal-80.description
source: The game ends after the round in which someone reaches the goal score. Highest score wins.
ta: யாரோ கோல் மதிப்பெண்ணை அடையும் சுற்றுக்குப் பிறகு விளையாட்டு முடிகிறது. அதிக மதிப்பெண் வெற்றிகள்.

# variants.biscuit.goal-120.name
source: Goal score: 120 points
ta: கோல் ச்கோர்: 120 புள்ளிகள்

# variants.biscuit.goal-120.description
source: The game ends after the round in which someone reaches the goal score. Highest score wins.
ta: யாரோ கோல் மதிப்பெண்ணை அடையும் சுற்றுக்குப் பிறகு விளையாட்டு முடிகிறது. அதிக மதிப்பெண் வெற்றிகள்.

# variants.blastradius.#board.name
source: Hexagonal board (base-6)
ta: அறுகோணப் பலகை

# variants.blastradius.board-5.name
source: Hexagonal board (base-5)
ta: அறுகோணப் பலகை

# variants.blastradius.board-7.name
source: Hexagonal board (base-7)
ta: அறுகோணப் பலகை

# variants.blockade.#goal.name
source: 13x13 board
ta: 13x13 போர்டு

# variants.blockade.#step-count.description
source: Pieces move two spaces orthogonally or one space diagonally, unless they are adjacent to a goal space, in which case they may move one space orthogonally to the goal. Any opponent piece on the goal will be captured on the winning move.
ta: துண்டுகள் இரண்டு இடைவெளிகளை ஆர்த்தோகனலி அல்லது ஒரு இடத்தை குறுக்காக நகர்த்துகின்றன, அவை ஒரு இலக்கு இடத்திற்கு அருகில் இல்லாவிட்டால், அவை ஒரு இடத்தை ஆர்த்தோகனலாக இலக்கை நோக்கி நகர்த்தக்கூடும். இலக்கை நோக்கி எந்த எதிர்ப்பாளரும் வெற்றிகரமான நடவடிக்கையில் கைப்பற்றப்படுவார்கள்.

# variants.blockade.#step-count.name
source: Double-step
ta: இரட்டை-படி

# variants.blockade.#wall-placement.description
source: You must place a wall after moving your piece if you have any in your stash.
ta: உங்கள் ச்டாசில் ஏதேனும் இருந்தால் உங்கள் துண்டுகளை நகர்த்திய பிறகு நீங்கள் ஒரு சுவரை வைக்க வேண்டும்.

# variants.blockade.#wall-placement.name
source: Mandatory wall
ta: கட்டாய சுவர்

# variants.blockade.back-rank.description
source: You win by moving one of your pieces to the opponent's back rank. Every piece must be able to reach at least one goal square.
ta: உங்கள் துண்டுகளில் ஒன்றை எதிரியின் பின் தரவரிசைக்கு நகர்த்துவதன் மூலம் நீங்கள் வெல்வீர்கள். ஒவ்வொரு துண்டுகளும் குறைந்தது ஒரு கோல் சதுரத்தை அடைய முடியும்.

# variants.blockade.back-rank.name
source: Opponent's back-rank goal
ta: எதிரியின் பின்-தரவரிசை இலக்கு

# variants.blockade.exclusive-wall.description
source: On your turn, you may either move a piece or place a wall, but not both.
ta: உங்கள் திருப்பத்தில், நீங்கள் ஒரு துண்டு நகர்த்தலாம் அல்லது ஒரு சுவரை வைக்கலாம், ஆனால் இரண்டுமே இல்லை.

# variants.blockade.exclusive-wall.name
source: Exclusive wall
ta: பிரத்யேக சுவர்

# variants.blockade.optional-wall.description
source: After making a move with one of your pieces, the placement of the wall is optional.
ta: உங்கள் துண்டுகளில் ஒன்றைக் கொண்டு நகர்ந்த பிறகு, சுவரின் இடம் விருப்பமானது.

# variants.blockade.optional-wall.name
source: Optional wall
ta: விருப்ப சுவர்

# variants.blockade.single-step.description
source: Pieces move one step orthogonally. If there is an opponent's piece in the way, they may jump over it unless it is the on the goal space, in which case it would just land on the goal, capturing the opponent's piece. In the unlikely event where another opponent's piece is behind the piece to be jumped, that piece is captured.
ta: துண்டுகள் ஒரு படி ஆர்த்தோகனலாக நகரும். வழியில் ஒரு எதிராளியின் துண்டு இருந்தால், அது கோல் இடமாக இல்லாவிட்டால் அவை அதற்கு மேல் குதிக்கக்கூடும், இந்த விசயத்தில் அது இலக்கை நோக்கி இறங்கி, எதிரியின் பகுதியைக் கைப்பற்றும். மற்றொரு எதிராளியின் துண்டு குதிக்க வேண்டிய சாத்தியமான நிகழ்வில், அந்த துண்டு கைப்பற்றப்படுகிறது.

# variants.blockade.single-step.name
source: Single-step
ta: ஒற்றை-படி

# variants.blooms.#board.name
source: Default board (base 6)
ta: இயல்புநிலை பலகை (அடிப்படை 6)

# variants.blooms.size-4.name
source: Smallest board (base 4)
ta: மிகச்சிறிய பலகை (அடிப்படை 4)

# variants.blooms.size-5.name
source: Smaller board (base 5)
ta: சிறிய பலகை (அடிப்படை 5)

# variants.blooms.size-8.name
source: Larger board (base 8)
ta: பெரிய பலகை (அடிப்படை 8)

# variants.blooms.size-10.name
source: Largest board (base 10)
ta: மிகப்பெரிய பலகை (அடிப்படை 10)

# variants.boom.#setup.name
source: 4 pieces each
ta: ஒவ்வொன்றும் 4 துண்டுகள்

# variants.boom.pieces-6.name
source: 6 pieces each
ta: ஒவ்வொன்றும் 6 துண்டுகள்

# variants.boom.pieces-8.name
source: 8 pieces each
ta: ஒவ்வொன்றும் 8 துண்டுகள்

# variants.bounce.#board.name
source: 8x8 board
ta: 8x8 போர்டு

# variants.bounce.10.name
source: 10x10 board
ta: 10x10 போர்டு

# variants.boxes.#board.name
source: 5x5 board
ta: 5x5 போர்டு

# variants.boxes.size-4x4.name
source: 4x4 board
ta: 4x4 போர்டு

# variants.boxes.size-5x7.name
source: 5x7 board
ta: 5x7 போர்டு

# variants.boxes.size-7x7.name
source: 7x7 board
ta: 7x7 போர்டு

# variants.breakthrough.bombardment.description
source: Instead of regular capture moves, you can detonate a piece, which destroys it and any pieces immediately surrounding it.
ta: வழக்கமான பிடிப்பு நகர்வுகளுக்குப் பதிலாக, நீங்கள் ஒரு பகுதியை வெடிக்கச் செய்யலாம், அதை அழிக்கிறது மற்றும் உடனடியாக அதைச் சுற்றியுள்ள எந்த துண்டுகளும்.

# variants.breakthrough.bombardment.name
source: Bombardment
ta: குண்டுவெடிப்பு

# variants.bug.#board.name
source: Size-4 board
ta: அளவு -4 போர்டு

# variants.bug.size-3.name
source: Size-3 board
ta: அளவு -3 போர்டு

# variants.bug.size-5.name
source: Size-5 board
ta: அளவு -5 போர்டு

# variants.buku.#board.name
source: Size-8 board
ta: அளவு -8 போர்டு

# variants.buku.size-6.name
source: Size-6 board
ta: அளவு -6 போர்டு

# variants.buku.size-10.name
source: Size-10 board
ta: அளவு -10 போர்டு

# variants.byte.10x10.name
source: Larger board: 10x10
ta: பெரிய பலகை: 10x10

# variants.c1.two-move.name
source: C2
ta: சி 2

# variants.c1.two-move.description
source: On your turn, you may begin with an optional tile move, followed by a required pyramid or cone move.
ta: உங்கள் திருப்பத்தில், நீங்கள் ஒரு விருப்ப ஓடு நகர்வுடன் தொடங்கலாம், அதைத் தொடர்ந்து தேவையான பிரமிடு அல்லது கூம்பு நகர்வு.

# variants.calculus.#board.description
source: Roughly 12 pieces across
ta: குறுக்கே சுமார் 12 துண்டுகள்

# variants.calculus.width-10.description
source: Roughly 10 pieces across
ta: குறுக்கே சுமார் 10 துண்டுகள்

# variants.calculus.width-10.name
source: Smaller board
ta: சிறிய பலகை

# variants.calculus.width-15.description
source: Roughly 15 pieces across
ta: சுமார் 15 துண்டுகள் குறுக்கே

# variants.calculus.width-15.name
source: Larger board
ta: பெரிய பலகை

# variants.camelot.camette.description
source: Mini variant with 23 squares.
ta: 23 சதுரங்களுடன் மினி மாறுபாடு.

# variants.camelot.camette.name
source: Camette
ta: கேமட்

# variants.camelot.cam.description
source: Smaller variant with 67 squares.
ta: 67 சதுரங்களுடன் சிறிய மாறுபாடு.

# variants.camelot.cam.name
source: Cam
ta: கேம்

# variants.camelot.chivalry.description
source: Larger variant with 176 squares.
ta: 176 சதுரங்களுடன் பெரிய மாறுபாடு.

# variants.camelot.chivalry.name
source: Chivalry
ta: சிவாலரி

# variants.camelot.river.description
source: Camelot with a river dividing the board.
ta: பலகையை பிரிக்கும் நதியுடன் கேம்லாட்.

# variants.camelot.river.name
source: River Camelot
ta: நதி கேம்லாட்

# variants.camelot.anti.description
source: The player wins if they run out of moves or if the opponent moves a single piece into the player's castle.
ta: அவர்கள் நகர்வுகளை விட்டு வெளியேறினால் அல்லது எதிர்ப்பாளர் ஒரு பகுதியை வீரரின் கோட்டையில் நகர்த்தினால் வீரர் செய் பெறுவார்.

# variants.camelot.anti.name
source: Anti-Camelot
ta: கேம்லாட் எதிர்ப்பு

# variants.catapult.#board.name
source: Default board (8x8)
ta: இயல்புநிலை பலகை (8x8)

# variants.catapult.#goal.description
source: Annihilate your opponent.
ta: உங்கள் எதிரியை நிர்மூலமாக்குங்கள்.

# variants.catapult.dagger.description
source: The second player starts with the dagger. The player with the dagger may make two consecutive moves and pass the dagger to their opponent.
ta: இரண்டாவது வீரர் குத்துச்சண்டையுடன் தொடங்குகிறார். குத்துச்சண்டையுடன் கூடிய வீரர் தொடர்ச்சியாக இரண்டு நகர்வுகளைச் செய்து, குண்டியை தங்கள் எதிரிக்கு அனுப்பலாம்.

# variants.catapult.dagger.name
source: Dagger
ta: டாகர்

# variants.catapult.royal.description
source: One piece is designated as royal. The goal is to kill the opposing royal.
ta: ஒரு துண்டு ராயல் என நியமிக்கப்பட்டுள்ளது. எதிரெதிர் ராயலைக் கொல்வதே குறிக்கோள்.

# variants.catapult.royal.name
source: Royal Catapult
ta: ராயல் கவண்

# variants.catapult.size-9.name
source: Larger board (9x9)
ta: பெரிய பலகை (9x9)

# variants.catchup.#board.name
source: Default board (base 5)
ta: இயல்புநிலை பலகை (அடிப்படை 5)

# variants.catchup.size-6.name
source: Larger board (base 6)
ta: பெரிய பலகை (அடிப்படை 6)

# variants.ccorridor.#board.name
source: Size-6 board
ta: அளவு -6 போர்டு

# variants.ccorridor.size-8.name
source: Size-8 board
ta: அளவு -8 போர்டு

# variants.ceph.#board.name
source: Board: Square
ta: பலகை: நாற்கை

# variants.ceph.snub.description
source: A hybrid orthogonal/hexagonal board shape with unique connection characteristics.
ta: தனித்துவமான இணைப்பு பண்புகளுடன் ஒரு கலப்பின ஆர்த்தோகனல்/அறுகோண பலகை வடிவம்.

# variants.ceph.snub.name
source: Board: Snub Square
ta: போர்டு: ச்னப் சதுக்கம்

# variants.ceph.#dice.name
source: 6-sided dice
ta: 6 பக்க பகடை

# variants.ceph.dodeca.name
source: 12-sided dice
ta: 12 பக்க பகடை

# variants.ceph.#size.name
source: 5x5 board
ta: 5x5 போர்டு

# variants.ceph.size-3.name
source: 3x3 board
ta: 3x3 போர்டு

# variants.churn.#board.name
source: Hexhex 3 (19 spaces)
ta: எக்செக்ச் 3 (19 இடங்கள்)

# variants.churn.limping-34.name
source: Alternating 3-4 (27 spaces)
ta: மாற்று 3-4 (27 இடங்கள்)

# variants.churn.limping-335.name
source: Alternating 3-3-5 (29 spaces)
ta: மாற்று 3-3-5 (29 இடைவெளிகள்)

# variants.churn.hex4.name
source: Hexhex 4 (37 spaces)
ta: எக்செக்ச் 4 (37 இடைவெளிகள்)

# variants.churn.limping-446.name
source: Alternating 4-4-6 (51 spaces)
ta: மாற்று 4-4-6 (51 இடைவெளிகள்)

# variants.churn.hex5.name
source: Hexhex 5 (61 spaces)
ta: எக்செக்ச் 5 (61 இடைவெளிகள்)

# variants.cifra.#board.name
source: 5x5 board
ta: 5x5 போர்டு

# variants.cifra.size-9.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.cifra.#mode.name
source: Dash
ta: கோடு

# variants.cifra.#mode.description
source: Move more of your pieces to the opponent's home row than your opponent does to yours
ta: உங்கள் எதிரி உங்களுடையதை விட உங்கள் துண்டுகளை எதிராளியின் வீட்டு வரிசையில் நகர்த்தவும்

# variants.cifra.king.name
source: King
ta: மன்னன்

# variants.cifra.king.description
source: Capture the opposing king or get yours to the opposing home row
ta: எதிரெதிர் ராசாவைப் பிடிக்கவும் அல்லது உங்களுடையதை எதிர்க்கும் வீட்டு வரிசையில் அழைத்துச் செல்லுங்கள்

# variants.cifra.sum.name
source: Sum
ta: தொகை

# variants.cifra.sum.description
source: Get the highest total value of pieces to the opponent's home row than your opponent can to yours
ta: உங்கள் எதிரியை விட எதிராளியின் வீட்டு வரிசையில் மிக உயர்ந்த மொத்த மதிப்புகளை எதிராளியின் வீட்டு வரிசையில் பெறுங்கள்

# variants.clearcut.#board.name
source: 19x19 board
ta: 19x19 வாரியம்

# variants.clearcut.#ruleset.description
source: Captures can only be made if the crosscut group is larger than at least one opposing group in a crosscut.
ta: குறுக்குவழியில் குறைந்தது ஒரு எதிரெதிர் குழுவை விட கிராச்கட் குழு பெரியதாக இருந்தால் மட்டுமே கைப்பற்றங்கள் செய்ய முடியும்.

# variants.clearcut.#ruleset.name
source: Halfcut ruleset
ta: அரைவாசி விதிகள்

# variants.clearcut.clearcut.description
source: Captures can only be made if the crosscut group is larger than both opposing groups in a crosscut. Full rulesheet: <https://www.marksteeregames.com/Clearcut_rules.pdf>
ta: குறுக்குவழியில் இரு எதிரெதிர் குழுக்களையும் விட குறுக்குவழி குழு பெரியதாக இருந்தால் மட்டுமே கைப்பற்றங்கள் செய்ய முடியும். முழு ஆட்சி: <https://www.marksteeregames.com/clearcut_rules.pdf>

# variants.clearcut.clearcut.name
source: Clearcut ruleset
ta: தெளிவான விதிமுறை

# variants.clearcut.size-15.name
source: 15x15 board
ta: 15x15 போர்டு

# variants.clusterfuss.#board.name
source: Default board (8x8)
ta: இயல்புநிலை பலகை (8x8)

# variants.clusterfuss.10.name
source: Larger board (10x10)
ta: பெரிய பலகை (10x10)

# variants.conect.#board.name
source: Size-11 board
ta: அளவு -11 போர்டு

# variants.conect.#cone.name
source: Wide cone
ta: பரந்த கூம்பு
