Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.scaffold.INVALID_MOVES
source: This sequence of moves {{moves}} is invalid.
ta: நகர்வுகளின் இந்த வரிசை {{moves}} தவறானது.

# validation.shifty.INITIAL_INSTRUCTIONS
source: Select an intersection to place a piece next to one of your own pieces, or select a piece to move.
ta: உங்கள் சொந்த துண்டுகளுக்கு அடுத்ததாக ஒரு பகுதியை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும் அல்லது நகர்த்த ஒரு துண்டைத் தேர்ந்தெடுக்கவும்.

# validation.shifty.INITIAL_INSTRUCTIONS_OPENING
source: Select an intersection to place your first piece.
ta: உங்கள் முதல் பகுதியை வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும்.

# validation.shifty.INITIAL_INSTRUCTIONS_PASS
source: You have no moves so you must pass.
ta: உங்களுக்கு எந்த நகர்வுகளும் இல்லை, எனவே நீங்கள் கடந்து செல்ல வேண்டும்.

# validation.shifty.INVALID_PASS
source: You may not pass if you have any legal moves available.
ta: உங்களிடம் ஏதேனும் சட்ட நகர்வுகள் இருந்தால் நீங்கள் கடந்து செல்லக்கூடாது.

# validation.shifty.CANNOT_PLACE
source: You may not place at {{where}}. Placement must be orthogonally adjacent to one of your own pieces.
ta: நீங்கள் {{where}} இல் வைக்கக்கூடாது. வேலைவாய்ப்பு உங்கள் சொந்த துண்டுகளில் ஒன்றிற்கு அருகில் இருக்க வேண்டும்.

# validation.shifty.CROSSCUT
source: You may not place at {{where}} because it creates a crosscut.
ta: நீங்கள் ஒரு குறுக்குவழியை உருவாக்குவதால் {{where}} இல் வைக்கக்கூடாது.

# validation.shifty.CROSSCUT_MOVE
source: You may not move to {{where}} because it creates a crosscut.
ta: நீங்கள் {{where}} க்கு செல்லக்கூடாது, ஏனெனில் அது ஒரு குறுக்குவழியை உருவாக்குகிறது.

# validation.shifty.MOVE_NOT_ADJACENT
source: You may not move the piece at {{from}} because it is not orthogonally adjacent to a friently piece.
ta: } இருந்து இலிருந்து {{என்ற பகுதியை நீங்கள் நகர்த்தக்கூடாது, ஏனெனில் இது ஒரு வினோதமான துண்டுக்கு அருகில் இல்லை.

# validation.shifty.NEXT_TO_FRIENDLY
source: You may not move to {{where}} because it is orthogonally adjacent to a friendly piece.
ta: நீங்கள் {{where}} க்கு செல்லக்கூடாது, ஏனெனில் இது ஒரு நட்புரீதியான துண்டுக்கு அருகில் உள்ளது.

# validation.shifty.INVALID_DESTINATION
source: The piece at {{from}} cannot move to {{to}} because it has no line of sight.
ta: } From} க்கு இல் உள்ள துண்டு {{from} பெறுநர் க்கு செல்ல முடியாது, ஏனெனில் அதற்கு பார்வை இல்லை.

# validation.siegeofj.INITIAL_INSTRUCTIONS
source: Select a card from your hand to place on the board.
ta: பலகையில் இடத்திற்கு உங்கள் கையில் இருந்து ஒரு அட்டையைத் தேர்ந்தெடுக்கவும்.

# validation.siegeofj.INVALID_MOVE
source: That move is invalid. Remember that every placed card must be fully supported (cards can't "hang off the edge" of a single card).
ta: அந்த நடவடிக்கை தவறானது. வைக்கப்பட்ட ஒவ்வொரு அட்டையும் முழுமையாக ஆதரிக்கப்பட வேண்டும் என்பதை நினைவில் கொள்ளுங்கள் (கார்டுகள் ஒரு அட்டையின் "விளிம்பில் இருந்து தொங்க முடியாது").

# validation.siegeofj.PARTIAL
source: Click the card on the board you want this card attached to.
ta: இந்த அட்டை இணைக்கப்பட விரும்பும் பலகையில் உள்ள அட்டையைக் சொடுக்கு செய்க.

# validation.siegeofj.LABEL_STASH
source: Player {{playerNum}}'s hand
ta: பிளேயர் {{playerNum}} இன் கை

# validation.siegeofj.VALID_BUT
source: That placement is valid. It's also possible to span two cards. Click "Complete Move" to keep the single parent, or click the adjacent card to span them both.
ta: அந்த வேலைவாய்ப்பு செல்லுபடியாகும். இரண்டு அட்டைகளையும் பரப்பவும் முடியும். ஒற்றை பெற்றோரை வைத்திருக்க "முழுமையான நகர்வு" என்பதைக் சொடுக்கு செய்க, அல்லது இரண்டையும் பரப்ப அருகிலுள்ள அட்டையைக் சொடுக்கு செய்க.

# validation.slither.CANNOT_MOVE
source: Advanced Slither: the piece at {{where}} cannot move because it is not part of a contiguous orthogonal group consisting of pieces of both colors.
ta: மேம்பட்ட ச்லிதர்: {{{where}} நகர்த்த முடியாது, ஏனெனில் இது இரு வண்ணங்களின் துண்டுகளையும் கொண்ட ஒரு தொடர்ச்சியான ஆர்த்தோகனல் குழுவின் ஒரு பகுதியாக இல்லை.

# validation.slither.DIAGONAL
source: You may not place at {{where}} because it is diagonally adjacent to a piece of your colour without being orthogonally connected.
ta: நீங்கள் {{where}} இல் வைக்கக்கூடாது, ஏனெனில் இது ஆர்த்தோகனலாக இணைக்கப்படாமல் உங்கள் நிறத்தின் ஒரு பகுதிக்கு குறுக்காக அருகில் உள்ளது.

# validation.slither.INITIAL_INSTRUCTIONS
source: Select a point to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும்.

# validation.slither.INVALID_PASS
source: You may only pass if you have no other moves available.
ta: உங்களிடம் வேறு எந்த நகர்வுகளும் கிடைக்கவில்லை என்றால் மட்டுமே நீங்கள் கடந்து செல்லலாம்.

# validation.slither.NEED_PLACEMENT
source: You must place a piece.
ta: நீங்கள் ஒரு துண்டு வைக்க வேண்டும்.

# validation.slither.NEED_PLACEMENT_DIAGONAL
source: You must place a piece at one of the dotted intersections.
ta: புள்ளியிடப்பட்ட குறுக்குவெட்டுகளில் ஒன்றில் நீங்கள் ஒரு பகுதியை வைக்க வேண்டும்.

# validation.slither.NO_VALID_FOLLOWUP
source: Movement to {{to}} will not result in a valid follow-up move.
ta: {{to} க்கு க்கான இயக்கம் சரியான பின்தொடர்தல் நகர்வுக்கு வழிவகுக்காது.

# validation.slither.NOT_ADJACENT
source: {{to}} is not orthogonally or diagonally adjacent to the piece at {{from}}.
ta: {{to}}} இருந்து இலிருந்து {{என்ற துண்டுக்கு ஆர்த்தோகனலி அல்லது குறுக்காக அருகில் இல்லை.

# validation.slither.PLACEMENT_MADE
source: You have already made a move at {{where}}.
ta: நீங்கள் ஏற்கனவே {{where} at இல் ஒரு நகர்வை மேற்கொண்டுள்ளீர்கள்.

# validation.slyde.FIXED_PIECE_FROM
source: The selected piece at {{from}} is fixed and cannot be moved.
ta: } இருந்து இலிருந்து {{இல் தேர்ந்தெடுக்கப்பட்ட துண்டு சரி செய்யப்பட்டது மற்றும் நகர்த்த முடியாது.

# validation.slyde.FIXED_PIECE_TO
source: The selected piece at {{to}} is fixed and cannot be swapped with.
ta: {{to} at இல் தேர்ந்தெடுக்கப்பட்ட துண்டு சரி செய்யப்பட்டது மற்றும் மாற்ற முடியாது.

# validation.slyde.INITIAL_INSTRUCTIONS
source: Select a mobile piece to swap.
ta: இடமாற்றம் செய்ய மொபைல் துண்டைத் தேர்ந்தெடுக்கவும்.

# validation.slyde.INITIAL_INSTRUCTIONS_SYMMETRIC
source: Current board state is symmetric. Select a mobile piece to swap, or select a piece to change its state.
ta: தற்போதைய பலகை நிலை சமச்சீர். இடமாற்றம் செய்ய ஒரு மொபைல் துண்டைத் தேர்ந்தெடுக்கவும் அல்லது அதன் நிலையை மாற்ற ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.slyde.NO_CHANGE_FIRST_MOVE
source: You may not change the state of a piece on the first move.
ta: முதல் நகர்வில் ஒரு பகுதியின் நிலையை நீங்கள் மாற்றக்கூடாது.

# validation.slyde.NO_MOVES_FROM
source: The selected piece at {{from}} has no available moves.
ta: } இருந்து க்கு க்கு இல் தேர்ந்தெடுக்கப்பட்ட துண்டு கிடைக்கக்கூடிய நகர்வுகள் இல்லை.

# validation.slyde.NON_SYMMETRIC
source: The board state is not symmetric. You may not change the state of a piece.
ta: வாரிய நிலை சமச்சீர் அல்ல. நீங்கள் ஒரு துண்டின் நிலையை மாற்றக்கூடாது.

# validation.slyde.NOT_ADJACENT
source: The selected piece at {{to}} is not adjacent to the piece at {{from}}.
ta: {{to} at இல் தேர்ந்தெடுக்கப்பட்ட துண்டு} இருந்து இலிருந்து {{என்ற துண்டுக்கு அருகில் இல்லை.

# validation.slyde.ONLY_CHANGE
source: The selected piece at {{from}} cannot be moved.
ta: } இருந்து {for இல் தேர்ந்தெடுக்கப்பட்ட பகுதியை நகர்த்த முடியாது.

# validation.slyde.SAME_PLAYER
source: You may not swap a piece with another piece of the same colour.
ta: அதே நிறத்தின் மற்றொரு பகுதியுடன் நீங்கள் ஒரு பகுதியை மாற்றக்கூடாது.

# validation.slyde.SELECT_CHANGE
source: Select the piece again to change its state.
ta: அதன் நிலையை மாற்ற மீண்டும் பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.slyde.SELECT_DESTINATION
source: Select a destination to move the piece to.
ta: துண்டுகளை நகர்த்த ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.slyde.SELECT_DESTINATION_OR_CHANGE
source: Select a destination to move the piece to, or select the piece again to change its state.
ta: துண்டுகளை நகர்த்த ஒரு இலக்கைத் தேர்ந்தெடுக்கவும் அல்லது அதன் நிலையை மாற்ற மீண்டும் பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.spire.CANNOT_PLACE
source: {{where}} is not a valid place to put a ball.
ta: {{where}} ஒரு பந்தை வைக்க சரியான இடம் அல்ல.

# validation.spire.INITIAL_INSTRUCTIONS
source: Select a space to a ball of your colour, or a neutral ball before placing ball of your colour.
ta: உங்கள் வண்ணத்தின் பந்தை வைப்பதற்கு முன் உங்கள் வண்ணத்தின் பந்துக்கு ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.spire.PLACE_PLAYER
source: Complete your turn to have a ball of your colour at {{where}}, or select another space to place a ball of your colour.
ta: உங்கள் வண்ணத்தின் பந்தை {{where}} இல் வைத்திருக்க உங்கள் திருப்பத்தை முடிக்கவும், அல்லது உங்கள் வண்ணத்தின் பந்தை வைக்க மற்றொரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.spire.PLACE_PLAYER_MANDATORY
source: Select another space to place a ball of your colour.
ta: உங்கள் வண்ணத்தின் பந்தை வைக்க மற்றொரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.spire.SAME_CELL
source: You have already placed at {{cell}}.
ta: நீங்கள் ஏற்கனவே {{cell} at இல் வைத்திருக்கிறீர்கள்.

# validation.spire.TOO_MANY_MOVES
source: You may only place up to two balls on your turn.
ta: உங்கள் திருப்பத்தில் இரண்டு பந்துகள் வரை மட்டுமே வைக்கலாம்.

# validation.spire.VIOLATES_BOTH
source: Placement at {{where}} is illegal for both the neutral ball and the ball of your colour.
ta: {{{where} at இல் வேலைவாய்ப்பு நடுநிலை பந்து மற்றும் உங்கள் வண்ணத்தின் பந்து ஆகிய இரண்டிற்கும் சட்டவிரோதமானது.

# validation.spire.VIOLATES_NEUTRAL_L
source: You may not place a neutral ball at {{where}} because it creates 3 neutral balls in a 2x2 area.
ta: 2x2 பகுதியில் 3 நடுநிலை பந்துகளை உருவாக்குவதால் {}} இல் நீங்கள் ஒரு நடுநிலை பந்தை வைக்கக்கூடாது.

# validation.spire.VIOLATES_NEUTRAL_PLATFORM
source: You may not place a neutral ball at {{where}} because platform has two neutral balls.
ta: நீங்கள் ஒரு நடுநிலை பந்தை {{where}} இல் வைக்கக்கூடாது, ஏனெனில் இயங்குதளத்தில் இரண்டு நடுநிலை பந்துகள் உள்ளன.

# validation.spire.VIOLATES_PLAYER_L
source: You may not place a ball of your colour at {{where}} because it creates 3 balls of your colour in a 2x2 area.
ta: உங்கள் வண்ணத்தின் ஒரு பந்தை {{where}} இல் வைக்கக்கூடாது, ஏனெனில் இது உங்கள் வண்ணத்தின் 3 பந்துகளை 2x2 பகுதியில் உருவாக்குகிறது.

# validation.spire.VIOLATES_PLAYER_PLATFORM
source: You may not place a ball of your colour at {{where}} because platform has two balls of your colour.
ta: உங்கள் வண்ணத்தின் ஒரு பந்தை {{where}} இல் வைக்கக்கூடாது, ஏனெனில் மேடையில் உங்கள் வண்ணத்தின் இரண்டு பந்துகள் உள்ளன.

# validation.spline.CANNOT_MOVE
source: The selected ball at {{where}} cannot be moved.
ta: {{where}} இல் தேர்ந்தெடுக்கப்பட்ட பந்து நகர்த்த முடியாது.

# validation.spline.CANNOT_PLACE
source: {{where}} is not a valid place to put a ball.
ta: {{where}} ஒரு பந்தை வைக்க சரியான இடம் அல்ல.

# validation.spline.INITIAL_INSTRUCTIONS
source: Select a space to place a ball, or select a ball to move.
ta: ஒரு பந்தை வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும் அல்லது நகர்த்த ஒரு பந்தைத் தேர்ந்தெடுக்கவும்.

# validation.spline.INVALID_TO
source: The selected ball at {{from}} cannot move to {{to}}
ta: } இருந்து இலிருந்து {{இல் தேர்ந்தெடுக்கப்பட்ட பந்து {{from}} வரை செல்ல முடியாது

# validation.spline.MOVE_TO
source: Select a destination to move your ball.
ta: உங்கள் பந்தை நகர்த்த ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.spline.NO_TOS
source: The selected ball at {{where}} has no possible destinations.
ta: {{}} இல் தேர்ந்தெடுக்கப்பட்ட பந்து சாத்தியமான இடங்களைக் கொண்டிருக்கவில்லை.

# validation.sploof.CANNOT_PLACE
source: {{where}} is not a valid place to put a ball.
ta: {{where}} ஒரு பந்தை வைக்க சரியான இடம் அல்ல.

# validation.sploof.INITIAL_INSTRUCTIONS
source: Select a space to place a ball of your colour, or select a neutral ball to take.
ta: உங்கள் வண்ணத்தின் பந்தை வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும் அல்லது எடுக்க நடுநிலை பந்தைத் தேர்ந்தெடுக்கவும்.

# validation.sploof.NO_BALLS_HAND
source: You have no balls in your hand, so you cannot place a ball of your colour.
ta: உங்கள் கையில் பந்துகள் இல்லை, எனவே உங்கள் வண்ணத்தின் பந்தை வைக்க முடியாது.

# validation.sploof.NO_BALLS_STASH
source: You have no balls in your stash, so you cannot take a neutral ball.
ta: உங்கள் ச்டாசில் உங்களிடம் பந்துகள் இல்லை, எனவே நீங்கள் நடுநிலை பந்தை எடுக்க முடியாது.

# validation.sploof.NOT_NEUTRAL
source: You have indicated that you want to take a neutral ball, but the ball at {{where}} is not neutral.
ta: நீங்கள் ஒரு நடுநிலை பந்தை எடுக்க விரும்புகிறீர்கள் என்று சுட்டிக்காட்டியுள்ளீர்கள், ஆனால் {{where} at இல் உள்ள பந்து நடுநிலையானது அல்ல.

# validation.sploof.PINNED
source: The neutral ball at {{where}} is pinned.
ta: {{where} at இல் உள்ள நடுநிலை பந்து பொருத்தப்பட்டுள்ளது.

# validation.sploof.UNOCCUPIED
source: You have indicated that you want to take a neutral ball, but there is no neutral ball at {{where}}.
ta: நீங்கள் ஒரு நடுநிலை பந்தை எடுக்க விரும்புகிறீர்கள் என்று சுட்டிக்காட்டியுள்ளீர்கள், ஆனால் {{where}} இல் நடுநிலை பந்து இல்லை.

# validation.sponnect.CANNOT_PLACE
source: You may not place at {{move}}.
ta: நீங்கள் {{move}} இல் வைக்கக்கூடாது.

# validation.sponnect.CONSECUTIVE_PASS
source: You may not pass if your opponent just passed.
ta: உங்கள் எதிர்ப்பாளர் கடந்து சென்றால் நீங்கள் கடந்து செல்லக்கூடாது.

# validation.sponnect.FIRST_PASS
source: You may not pass on the first turn.
ta: முதல் திருப்பத்தில் நீங்கள் கடந்து செல்லக்கூடாது.

# validation.sponnect.INITIAL_INSTRUCTIONS
source: Select a space to place a ball.
ta: ஒரு பந்தை வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.sponnect.INITIAL_INSTRUCTIONS_PASS
source: Select a space to place a ball, or pass your turn.
ta: ஒரு பந்தை வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும், அல்லது உங்கள் திருப்பத்தை கடந்து செல்லுங்கள்.

# validation.spook.CANNOT_PLACE
source: You may not place at {{where}}.
ta: நீங்கள் {{where}} இல் வைக்கக்கூடாது.

# validation.spook.CHAIN_WRONG_PLAYER
source: You may only make chain captures of balls of the same colour.
ta: ஒரே வண்ணத்தின் பந்துகளை மட்டுமே நீங்கள் சங்கிலி பிடிப்பதை செய்ய முடியும்.

# validation.spook.CONTINUE
source: You may have Spooky continue to capture more balls of the same colour, or end your turn.
ta: அதே நிறத்தின் அதிகமான பந்துகளை நீங்கள் தொடர்ந்து கைப்பற்றலாம் அல்லது உங்கள் திருப்பத்தை முடிக்கலாம்.

# validation.spook.INITIAL_INSTRUCTIONS_CAPTURE
source: Select an adjacent ball to capture.
ta: கைப்பற்ற அருகிலுள்ள பந்தைத் தேர்ந்தெடுக்கவும்.

# validation.spook.INITIAL_INSTRUCTIONS_ISOLATED
source: Spooky is isolated. Select a new space to move Spooky.
ta: ச்பூக்கி தனிமைப்படுத்தப்பட்டுள்ளது. ச்பூக்கியை நகர்த்த புதிய இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.spook.INITIAL_INSTRUCTIONS_PARITY_PASS
source: Player 1 starts the getaway phase. You must pass.
ta: பிளேயர் 1 வெளியேறும் கட்டத்தைத் தொடங்குகிறது. நீங்கள் கடந்து செல்ல வேண்டும்.

# validation.spook.INITIAL_INSTRUCTIONS_PASS
source: There are no adjacent free balls and unpinned opponent balls. You must pass.
ta: அருகிலுள்ள இலவச பந்துகள் மற்றும் இணைக்கப்படாத எதிரி பந்துகள் எதுவும் இல்லை. நீங்கள் கடந்து செல்ல வேண்டும்.

# validation.spook.INITIAL_INSTRUCTIONS_PLACEMENT
source: Select a space to place a ball.
ta: ஒரு பந்தை வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.spook.INITIAL_INSTRUCTIONS_REMOVE
source: There are no adjacent free balls. Select an unpinned opponent ball to be removed.
ta: அருகிலுள்ள இலவச பந்துகள் இல்லை. அகற்றப்படாத எதிரி பந்தைத் தேர்ந்தெடுக்கவும்.

# validation.spook.INVALID_PASS
source: You may only pass if you have no other moves available.
ta: உங்களிடம் வேறு எந்த நகர்வுகளும் கிடைக்கவில்லை என்றால் மட்டுமே நீங்கள் கடந்து செல்லலாம்.

# validation.spook.NO_ADJACENT
source: The space at {{where}} is also not adjacent to any balls.
ta: {{where} at இல் உள்ள இடமும் எந்த பந்துகளுக்கும் அருகில் இல்லை.

# validation.spook.NO_BALL
source: There is no ball at {{where}}
ta: {{where}} இல் பந்து இல்லை

# validation.spook.NOT_ADJACENT
source: The ball at {{where}} is not orthogonally adjacent to Spooky.
ta: {{}} இல் உள்ள பந்து ச்பூக்கிக்கு அருகிலுள்ள ஆர்த்தோகனலி அல்ல.

# validation.spook.NOT_CAPTURABLE
source: The ball at {{where}} is not capturable.
ta: {{where} at இல் உள்ள பந்து பிடிக்கப்படவில்லை.

# validation.spook.NOT_FREE
source: The ball at {{where}} is not free to be captured.
ta: {{where} at இல் உள்ள பந்து கைப்பற்றப்படுவதற்கு இலவசம் அல்ல.

# validation.spook.PINNED
source: The ball at {{where}} is pinned.
ta: {{where} at இல் உள்ள பந்து பொருத்தப்படுகிறது.

# validation.spook.REMOVE_WRONG_PLAYER
source: You must remove your opponent's ball; not your own.
ta: உங்கள் எதிரியின் பந்தை நீங்கள் அகற்ற வேண்டும்; உங்கள் சொந்தம் அல்ல.

# validation.spook.SINGLE_MOVE_DROP
source: When performing drop captures, you may only capture one ball.
ta: துளி கைப்பற்றும்போது, நீங்கள் ஒரு பந்தை மட்டுமே கைப்பற்றலாம்.

# validation.spook.SINGLE_MOVE_MOVE
source: You may not select more than one location to move Spooky.
ta: ச்பூக்கியை நகர்த்துவதற்கு நீங்கள் ஒன்றுக்கு மேற்பட்ட இடங்களைத் தேர்ந்தெடுக்கக்கூடாது.

# validation.spook.SINGLE_MOVE_PLACE
source: You may only place one ball.
ta: நீங்கள் ஒரு பந்தை மட்டுமே வைக்கலாம்.

# validation.spook.SINGLE_MOVE_REMOVE
source: You may only remove one ball.
ta: நீங்கள் ஒரு பந்தை மட்டுமே அகற்றலாம்.

# validation.spook.WRONG_PREFIX_CAPTURE
source: Captures should be prefixed with 'c'.
ta: பிடிப்புகள் 'சி' உடன் முன்னொட்டு இருக்க வேண்டும்.

# validation.spook.WRONG_PREFIX_MOVE
source: Movements should be prefixed with 'm'.
ta: இயக்கங்கள் 'எம்' உடன் முன்னொட்டு இருக்க வேண்டும்.

# validation.spook.WRONG_PREFIX_PLACE
source: Placements should not include a prefix.
ta: வேலைவாய்ப்புகளில் ஒரு முன்னொட்டு இருக்கக்கூடாது.

# validation.spook.WRONG_PREFIX_REMOVE
source: Removals should be prefixed with 'r'.
ta: நீக்குதல்கள் 'ஆர்' உடன் முன்னொட்டு இருக்க வேண்டும்.

# validation.spree.ALREADY_WON
source: You have already won the game, so you don't have to pick a colour to hand to your opponent.
ta: நீங்கள் ஏற்கனவே விளையாட்டை வென்றுள்ளீர்கள், எனவே உங்கள் எதிரிக்கு ஒப்படைக்க ஒரு வண்ணத்தை எடுக்க வேண்டியதில்லை.

# validation.spree.CANNOT_PLACE
source: {{where}} is not a valid place to put a ball.
ta: {{where}} ஒரு பந்தை வைக்க சரியான இடம் அல்ல.

# validation.spree.CHOOSE_NEXT
source: Choose a colour to hand to your opponent.
ta: உங்கள் எதிரிக்கு ஒப்படைக்க ஒரு வண்ணத்தைத் தேர்வுசெய்க.

# validation.spree.FIRST_MOVE_CHOICE
source: The first move must be the ball to hand to your opponent (1, 2, or 3).
ta: முதல் நகர்வு உங்கள் எதிரிக்கு (1, 2, அல்லது 3) ஒப்படைக்கும் பந்து இருக்க வேண்டும்.

# validation.spree.INITIAL_INSTRUCTIONS
source: Select a space to place the ball of colour {{choice}}, then choose a colour to hand to your opponent.
ta: வண்ண பந்தை வைக்க ஒரு இடத்தைத் தேர்ந்தெடுங்கள் {{choice}}, பின்னர் உங்கள் எதிரிக்கு ஒப்படைக்க ஒரு வண்ணத்தைத் தேர்வுசெய்க.

# validation.spree.INITIAL_INSTRUCTIONS_FIRST
source: Choose a colour to hand to your opponent.
ta: உங்கள் எதிரிக்கு ஒப்படைக்க ஒரு வண்ணத்தைத் தேர்வுசெய்க.

# validation.spree.INVALID_CHOICE
source: Colour choice {{choice}} is not valid. Choose 1, 2, or 3.
ta: வண்ண தேர்வு {{choice}} செல்லுபடியாகாது. 1, 2, அல்லது 3 ஐத் தேர்வுசெய்க.

# validation.spree.PLACE_FIRST
source: You must place the ball before choosing a colour to hand to your opponent.
ta: உங்கள் எதிரிக்கு ஒப்படைக்க ஒரு வண்ணத்தைத் தேர்ந்தெடுப்பதற்கு முன்பு நீங்கள் பந்தை வைக்க வேண்டும்.

# validation.spree.SAME_CHOICE
source: You cannot hand your opponent the colour {{choice}} because the same colour cannot be chosen twice in a row.
ta: உங்கள் எதிரியை நீங்கள் ஒப்படைக்க முடியாது {{choice}} ஏனெனில் அதே நிறத்தை ஒரு வரிசையில் இரண்டு முறை தேர்ந்தெடுக்க முடியாது.

# validation.squaredance.INITIAL_INSTRUCTIONS
source: Select the pivot stone. This is the stone that won't move.
ta: பிவோட் கல்லைத் தேர்ந்தெடுக்கவும். இது நகராத கல்.

# validation.squaredance.PARTIAL_DESTINATION
source: Select the point where the end stone will end up. You may not cover friendly pieces, and any covered enemy pieces will be captured.
ta: இறுதிக் கல் முடிவடையும் புள்ளியைத் தேர்ந்தெடுக்கவும். நீங்கள் நட்பு துண்டுகளை மறைக்கக்கூடாது, மேலும் மூடப்பட்ட எதிரி துண்டுகள் கைப்பற்றப்படும்.

# validation.squaredance.PARTIAL_ENDSTONE
source: Select the end stone. This is the stone that will move the furthest.
ta: இறுதிக் கல்லைத் தேர்ந்தெடுக்கவும். இந்த கல், இது மிக அதிகமாக நகரும்.

# validation.stibro.FIRST_PLACEMENT
source: The first placement cannot be on the edge.
ta: முதல் வேலைவாய்ப்பு விளிம்பில் இருக்க முடியாது.

# validation.stibro.FREE_GROUPS_AFTER
source: You must always have at least one free group: a group that does not touch the edge, and has two spaces between itself and an opponent group that does not touch the edge.
ta: நீங்கள் எப்போதுமே குறைந்தது ஒரு இலவச குழுவைக் கொண்டிருக்க வேண்டும்: விளிம்பைத் தொடாத ஒரு குழு, தனக்கும் தனக்கும் இடையில் இரண்டு இடைவெளிகளையும், விளிம்பைத் தொடாத ஒரு எதிரி குழு.

# validation.stigmergy.INITIAL_INSTRUCTIONS
source: Place a piece onto an empty space not controlled by the opponent, replace an enemy piece on a space you control, or 'pass' if all spaces are occupied or controlled. The game ends when both players pass in sequence.
ta: எதிராளியால் கட்டுப்படுத்தப்படாத வெற்று இடத்தில் ஒரு பகுதியை வைக்கவும், நீங்கள் கட்டுப்படுத்தும் இடத்தில் எதிரி துண்டுகளை மாற்றவும், அல்லது எல்லா இடங்களும் ஆக்கிரமிக்கப்பட்டால் அல்லது கட்டுப்படுத்தப்பட்டால் 'கடந்து செல்லுங்கள்'. இரு வீரர்களும் வரிசையில் கடந்து செல்லும்போது விளையாட்டு முடிகிறது.

# validation.stigmergy.INITIAL_INSTRUCTIONS_BUTTON
source: Place a piece onto an empty space not controlled by the opponent, replace an enemy piece on a space you control, or "Take button" (worth .5 points).
ta: எதிராளியால் கட்டுப்படுத்தப்படாத வெற்று இடத்தில் ஒரு பகுதியை வைக்கவும், நீங்கள் கட்டுப்படுத்தும் இடத்தில் எதிரி துண்டுகளை மாற்றவும் அல்லது "பொத்தானை எடுத்துக் கொள்ளுங்கள்" (மதிப்பு .5 புள்ளிகள்).

# validation.stigmergy.INITIAL_SETUP
source: Enter a number to set the bonus to the second mover's score. Your opponent will choose to move first or second.
ta: இரண்டாவது மூவரின் மதிப்பெண்ணுக்கு போனசை அமைக்க ஒரு எண்ணை உள்ளிடவும். உங்கள் எதிர்ப்பாளர் முதல் அல்லது இரண்டாவது இடத்தை நகர்த்துவார்.

# validation.stigmergy.INSUFFICIENT_LOS
source: You cannot replace a piece on {{cell}}. You do not control the space.
ta: {{cell} on இல் ஒரு பகுதியை மாற்ற முடியாது. நீங்கள் இடத்தை கட்டுப்படுத்தவில்லை.

# validation.stigmergy.INVALIDBUTTON
source: The button is already taken or is not in use this game.
ta: பொத்தான் ஏற்கனவே எடுக்கப்பட்டுள்ளது அல்லது இந்த விளையாட்டில் பயன்பாட்டில் இல்லை.

# validation.stigmergy.INVALIDKOMI
source: You must choose a number of points for the second mover to start with. You may not offer a komi greater than the number of cells on the board plus one.
ta: இரண்டாவது மூவர் தொடங்குவதற்கு நீங்கள் பல புள்ளிகளைத் தேர்வு செய்ய வேண்டும். போர்டில் உள்ள கலங்களின் எண்ணிக்கையை விட அதிகமான கோமியை நீங்கள் வழங்கக்கூடாது.

# validation.stigmergy.INVALIDPASS
source: You cannot pass while uncontrolled spaces exist or if the button is still available for taking.
ta: கட்டுப்பாடற்ற இடங்கள் இருக்கும்போது அல்லது எடுக்க வேண்டிய பொத்தான் இன்னும் கிடைத்தால் நீங்கள் கடந்து செல்ல முடியாது.

# validation.stigmergy.INVALIDPLAYSECOND
source: You cannot choose to play second from this board state.
ta: இந்த வாரிய மாநிலத்திலிருந்து இரண்டாவது விளையாட நீங்கள் தேர்வு செய்ய முடியாது.

# validation.stigmergy.KOMI_CHOICE
source: You may either make the first move on the board and let your opponent keep the bonus points or you may choose "Play second" and take the bonus points for yourself.
ta: நீங்கள் போர்டில் முதல் நகர்வை மேற்கொண்டு, உங்கள் எதிரி போனச் புள்ளிகளை வைத்திருக்கட்டும் அல்லது நீங்கள் "இரண்டாவது விளையாடுங்கள்" என்பதைத் தேர்ந்தெடுத்து போனச் புள்ளிகளை நீங்களே எடுத்துக் கொள்ளலாம்.

# validation.stigmergy.OPPONENT_CONTROL
source: You cannot place onto the empty space {{cell}}. It is controlled by the opponent.
ta: நீங்கள் வெற்று இடத்திற்கு {{cell}} இல் வைக்க முடியாது. இது எதிரியால் கட்டுப்படுத்தப்படுகிறது.

# validation.storisende.BAD_DISTANCE
source: Stacks must move a distance exactly equal to their height.
ta: அடுக்குகள் அவற்றின் உயரத்திற்கு சமமான தூரத்தை நகர்த்த வேண்டும்.
