Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# displays.meridians.hide-threatened.name
source: Hide threatened
ta: அச்சுறுத்தலை மறைக்க

# displays.mvolcano.expanding.description
source: Two dimensional board, with stacks expanding when hovered over.
ta: இரு பரிமாண பலகை, மேலே செல்லும்போது அடுக்குகள் விரிவடைகின்றன.

# displays.mvolcano.expanding.name
source: Expanding
ta: விரிவாக்குதல்

# displays.onyx.hide-threatened.description
source: Don't show threatened pieces.
ta: அச்சுறுத்தப்பட்ட துண்டுகளைக் காட்ட வேண்டாம்.

# displays.onyx.hide-threatened.name
source: Hide threatened
ta: அச்சுறுத்தலை மறைக்க

# displays.oust.hide-moves.description
source: Don't show possible moves.
ta: சாத்தியமான நகர்வுகளைக் காட்ட வேண்டாம்.

# displays.oust.hide-moves.name
source: Hide moves
ta: நகர்வுகளை மறைக்கவும்

# displays.pente.hide-threatened.description
source: Don't highlight pieces that are threatened to be captured.
ta: கைப்பற்றப்படும் என்று அச்சுறுத்தப்பட்ட துண்டுகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.pente.hide-threatened.name
source: Hide threatened pieces
ta: அச்சுறுத்தப்பட்ட துண்டுகளை மறைக்கவும்

# displays.pletore.hide-both.description
source: Don't highlight empty controlled intersections nor possible replacements.
ta: வெற்று கட்டுப்படுத்தப்பட்ட குறுக்குவெட்டுகள் அல்லது சாத்தியமான மாற்றீடுகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.pletore.hide-both.name
source: Hide Both
ta: இரண்டையும் மறைக்கவும்

# displays.pletore.hide-influence.description
source: Don't highlight empty controlled intersections.
ta: வெற்று கட்டுப்படுத்தப்பட்ட குறுக்குவெட்டுகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.pletore.hide-influence.name
source: Hide influence
ta: செல்வாக்கை மறைக்க

# displays.pletore.hide-threatened.description
source: Don't highlight possible replacements.
ta: சாத்தியமான மாற்றீடுகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.pletore.hide-threatened.name
source: Hide threatened
ta: அச்சுறுத்தலை மறைக்க

# displays.pods.hide-influence.description
source: Don't highlight parts of the board that cannot be accessed by the other player.
ta: மற்ற வீரரால் அணுக முடியாத பலகையின் பகுதிகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.pods.hide-influence.name
source: Hide influence
ta: செல்வாக்கை மறைக்க

# displays.pontedd.vertex-board.name
source: Play on intersections instead of squares
ta: சதுரங்களுக்கு பதிலாக குறுக்குவெட்டுகளில் விளையாடுங்கள்

# displays.queensland.hide-scored.description
source: Don't highlight scored cells.
ta: மதிப்பெண் செல்களை முன்னிலைப்படுத்த வேண்டாம்.

# displays.queensland.hide-scored.name
source: Hide scored
ta: மதிப்பெண் மறைக்க

# displays.renju.hide-restrictions.description
source: Don't show intersections where the first player cannot place their stones.
ta: முதல் வீரர் தங்கள் கற்களை வைக்க முடியாத குறுக்குவெட்டுகளைக் காட்ட வேண்டாம்.

# displays.renju.hide-restrictions.name
source: Hide restriction indicators
ta: கட்டுப்பாட்டு குறிகாட்டிகளை மறைக்கவும்

# displays.reversi.hide-moves.description
source: Don't show possible moves.
ta: சாத்தியமான நகர்வுகளைக் காட்ட வேண்டாம்.

# displays.reversi.hide-moves.name
source: Hide moves
ta: நகர்வுகளை மறைக்கவும்

# displays.rootbound.hide-highlights.description
source: Don't highlight the Claimed Regions.
ta: கோரப்பட்ட பகுதிகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.rootbound.hide-highlights.name
source: Hide highlights
ta: சிறப்பம்சங்களை மறைக்கவும்

# displays.spire.orb-3d.description
source: Use plain 3D orb textures.
ta: எளிய 3D உருண்டை அமைப்புகளைப் பயன்படுத்தவும்.

# displays.spire.orb-3d.name
source: 3D orbs
ta: 3 டி ஆர்ப்ச்

# displays.spline.orb-3d.description
source: Use plain 3D orb textures.
ta: எளிய 3D உருண்டை அமைப்புகளைப் பயன்படுத்தவும்.

# displays.spline.orb-3d.name
source: 3D orbs
ta: 3 டி ஆர்ப்ச்

# displays.sploof.orb-3d.description
source: Use plain 3D orb textures.
ta: எளிய 3D உருண்டை அமைப்புகளைப் பயன்படுத்தவும்.

# displays.sploof.orb-3d.name
source: 3D orbs
ta: 3 டி ஆர்ப்ச்

# displays.sponnect.orb-3d.description
source: Use plain 3D orb textures.
ta: எளிய 3D உருண்டை அமைப்புகளைப் பயன்படுத்தவும்.

# displays.sponnect.orb-3d.name
source: 3D orbs
ta: 3 டி ஆர்ப்ச்

# displays.spook.orb-3d.description
source: Use plain 3D orb textures.
ta: எளிய 3D உருண்டை அமைப்புகளைப் பயன்படுத்தவும்.

# displays.spook.orb-3d.name
source: 3D orbs
ta: 3 டி ஆர்ப்ச்

# displays.spree.orb-3d.description
source: Use plain 3D orb textures.
ta: எளிய 3D உருண்டை அமைப்புகளைப் பயன்படுத்தவும்.

# displays.spree.orb-3d.name
source: 3D orbs
ta: 3 டி ஆர்ப்ச்

# displays.stigmergy.hide-both.description
source: Don't highlight empty controlled spaces nor possible replacements.
ta: வெற்று கட்டுப்படுத்தப்பட்ட இடங்கள் அல்லது சாத்தியமான மாற்றீடுகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.stigmergy.hide-both.name
source: Hide Both
ta: இரண்டையும் மறைக்கவும்

# displays.stigmergy.hide-influence.description
source: Don't highlight empty controlled spaces.
ta: வெற்று கட்டுப்படுத்தப்பட்ட இடங்களை முன்னிலைப்படுத்த வேண்டாம்.

# displays.stigmergy.hide-influence.name
source: Hide influence
ta: செல்வாக்கை மறைக்க

# displays.stigmergy.hide-threatened.description
source: Don't highlight possible replacements.
ta: சாத்தியமான மாற்றீடுகளை முன்னிலைப்படுத்த வேண்டாம்.

# displays.stigmergy.hide-threatened.name
source: Hide threatened
ta: அச்சுறுத்தலை மறைக்க

# displays.stigmergy.vertex-style.description
source: Display the board using vertexes instead of hexes.
ta: எக்சுக்கு பதிலாக வெர்டெக்சைப் பயன்படுத்தி பலகையைக் காண்பி.

# displays.stigmergy.vertex-style.name
source: Vertex style
ta: வெர்டெக்ச் பாணி

# displays.strands.always-show-numbers.description
source: Show numbers above the pieces.
ta: துண்டுகளுக்கு மேலே எண்களைக் காட்டு.

# displays.strands.always-show-numbers.name
source: Always show numbers
ta: எப்போதும் எண்களைக் காட்டு

# displays.terrace.flat.description
source: A flat view that uses shading to indicate height.
ta: உயரத்தைக் குறிக்க நிழலைப் பயன்படுத்தும் ஒரு தட்டையான பார்வை.

# displays.terrace.flat.name
source: Flat view
ta: தட்டையான பார்வை

# displays.trax.show-origin.description
source: Mark the position of the first piece.
ta: முதல் பகுதியின் நிலையை குறிக்கவும்.

# displays.trax.show-origin.name
source: Show origin
ta: தோற்றத்தைக் காட்டு

# displays.trike.hide-moves.description
source: Don't show possible moves.
ta: சாத்தியமான நகர்வுகளைக் காட்ட வேண்டாம்.

# displays.trike.hide-moves.name
source: Hide moves
ta: நகர்வுகளை மறைக்கவும்

# displays.tumbleweed.hide-both.description
source: Don't show line of sight or non-suicidal captures.
ta: பார்வைக் கோடு அல்லது சூசிசிடல் அல்லாத பிடிப்புகளைக் காட்ட வேண்டாம்.

# displays.tumbleweed.hide-both.name
source: Hide Both
ta: இரண்டையும் மறைக்கவும்

# displays.tumbleweed.hide-influence.description
source: Don't show line of sight.
ta: பார்வைக் கோட்டைக் காட்ட வேண்டாம்.

# displays.tumbleweed.hide-influence.name
source: Hide influence
ta: செல்வாக்கை மறைக்க

# displays.tumbleweed.hide-threatened.description
source: Don't show non-suicidal captures.
ta: சூறாவளி அல்லாத பிடிப்புகளைக் காட்ட வேண்டாம்.

# displays.tumbleweed.hide-threatened.name
source: Hide threatened
ta: அச்சுறுத்தலை மறைக்க

# displays.twixt.hide-diagonals.description
source: Don't show diagonal lines.
ta: மூலைவிட்ட கோடுகளைக் காட்ட வேண்டாம்.

# displays.twixt.hide-diagonals.name
source: Hide diagonals
ta: மூலைவிட்டங்களை மறைக்கவும்

# displays.upperhand.orb-3d.description
source: Use plain 3D orb textures.
ta: எளிய 3D உருண்டை அமைப்புகளைப் பயன்படுத்தவும்.

# displays.upperhand.orb-3d.name
source: 3D orbs
ta: 3 டி ஆர்ப்ச்

# displays.volcano.expanding.description
source: Two dimensional board, with stacks expanding when hovered over.
ta: இரு பரிமாண பலகை, மேலே செல்லும்போது அடுக்குகள் விரிவடைகின்றன.

# displays.volcano.expanding.name
source: Expanding
ta: விரிவாக்குதல்

# displays.zola.isometric-20.description
source: Pronounced elevation: A quasi-3d view of the field where the spaces get higher as you move away from the centre.
ta: உச்சரிக்கப்படும் உயரம்: நீங்கள் மையத்திலிருந்து விலகிச் செல்லும்போது இடைவெளிகள் அதிகமாக இருக்கும் புலத்தின் அரை -3 டி பார்வை.

# displays.zola.isometric-20.name
source: Isometric: Pronounced Elevation
ta: ஐசோமெட்ரிக்: உச்சரிக்கப்படும் உயரம்

# displays.zola.isometric-5.description
source: Subtle elevation: A quasi-3d view of the field where the spaces get higher as you move away from the centre.
ta: நுட்பமான உயரம்: நீங்கள் மையத்திலிருந்து விலகிச் செல்லும்போது இடைவெளிகள் அதிகமாக இருக்கும் புலத்தின் அரை -3 டி பார்வை.

# displays.zola.isometric-5.name
source: Isometric: Subtle Elevation
ta: ஐசோமெட்ரிக்: நுட்பமான உயரம்

# homeworlds.CMD_ATK_OWNER
source: In games with more than two players, you have to always specify the owner of the ship you are attacking.
ta: இரண்டு வீரர்களைக் கொண்ட விளையாட்டுகளில், நீங்கள் தாக்கும் கப்பலின் உரிமையாளரை எப்போதும் குறிப்பிட வேண்டும்.

# homeworlds.CMD_ATK_SELF
source: You may not attack yourself.
ta: நீங்களே தாக்கக்கூடாது.

# homeworlds.CMD_ATK_SIZE
source: You don't have a ship large enough to attack the ship {{target}}.
ta: கப்பலைத் தாக்கும் அளவுக்கு பெரிய கப்பல் உங்களிடம் இல்லை {{target}}.

# homeworlds.CMD_BUILD_TEMPLATE
source: You do not have a model from which to build a new ship.
ta: புதிய கப்பலை உருவாக்க உங்களிடம் ஒரு மாதிரி இல்லை.

# homeworlds.CMD_CATA_ACTIONS
source: You may not trigger a catastrophe while you still have actions to use.
ta: நீங்கள் பயன்படுத்த வேண்டிய நடவடிக்கைகள் இருக்கும்போது நீங்கள் ஒரு பேரழிவைத் தூண்டக்கூடாது.

# homeworlds.CMD_CATA_INVALID
source: There is no overpopulation of {{colour}} in the {{system}} system.
ta: {{colour}} அமைப்பில் {{system}} இன் அதிக மக்கள் தொகை இல்லை.

# homeworlds.CMD_DISC_DOUBLE
source: A system by the name {{name}} has already been charted.
ta: {{name}} என்ற பெயரில் ஒரு அமைப்பு ஏற்கனவே பட்டியலிடப்பட்டுள்ளது.

# homeworlds.CMD_HOME_COLOURS
source: You're requesting a home world with fewer than three technologies available. This is almost never wise. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.
ta: மூன்று தொழில்நுட்பங்களைக் கொண்ட ஒரு வீட்டு உலகத்தை நீங்கள் கோருகிறீர்கள். இது கிட்டத்தட்ட ஒருபோதும் அறிவாளி அல்ல. நீங்கள் இதைச் செய்ய விரும்புகிறீர்கள் என்பது உறுதி என்றால், கட்டளையை மீண்டும் சமர்ப்பித்து, அதன் முடிவில் ஒரு நட்சத்திரத்தை (*) வைக்கவும்.

# homeworlds.CMD_HOME_DOUBLE
source: You already have a home world.
ta: உங்களிடம் ஏற்கனவே ஒரு வீட்டு உலகம் உள்ளது.

# homeworlds.CMD_HOME_RHO_DIRECT
source: Your homeworld is directly connected to your right-hand opponent (none of your homeworld stars are the same size as theirs). This creates what's called a "microverse," and it is not recommended for new players. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.
ta: உங்கள் ஓம்வொர்ல்ட் உங்கள் வலது கை எதிரியுடன் நேரடியாக இணைக்கப்பட்டுள்ளது (உங்கள் ஓம்வொர்ல்ட் நட்சத்திரங்கள் எதுவும் அவற்றின் அதே அளவு அல்ல). இது "மைக்ரோவர்ச்" என்று அழைக்கப்படுவதை உருவாக்குகிறது, மேலும் இது புதிய வீரர்களுக்கு பரிந்துரைக்கப்படவில்லை. நீங்கள் இதைச் செய்ய விரும்புகிறீர்கள் என்பது உறுதி என்றால், கட்டளையை மீண்டும் சமர்ப்பித்து, அதன் முடிவில் ஒரு நட்சத்திரத்தை (*) வைக்கவும்.

# homeworlds.CMD_HOME_RHO_SMALL
source: You are choosing to put yourself only two jumps away from your right-hand opponent (what's called a "small" universe), but it's possible for you to create a "large" universe (putting your right-hand opponent at the maximum three jumps away) if you choose one of your opponent's star sizes and the size their homeworld does *not* include. For new players, starting with a large universe is recommended. If you're sure you want a small universe, resubmit the command and put an asterisk (*) at the end of it.
ta: உங்கள் வலது கை எதிர்ப்பாளரிடமிருந்து ("சிறிய" பிரபஞ்சம் என்று அழைக்கப்படுவது) இரண்டு தாவல்களை மட்டுமே நீங்களே வைக்க நீங்கள் தேர்வு செய்கிறீர்கள், ஆனால் நீங்கள் ஒரு "பெரிய" பிரபஞ்சத்தை உருவாக்க முடியும் (உங்கள் வலது கை எதிரியை அதிகபட்ச மூன்று தாவல்களில் வைப்பது சாத்தியமாகும் விலகி) உங்கள் எதிரியின் நட்சத்திர அளவுகளில் ஒன்றை நீங்கள் தேர்வுசெய்தால், அவற்றின் வீட்டு உலக அளவில் * இல்லை * அடங்கும். புதிய வீரர்களுக்கு, ஒரு பெரிய பிரபஞ்சத்துடன் தொடங்கி பரிந்துரைக்கப்படுகிறது. நீங்கள் ஒரு சிறிய பிரபஞ்சத்தை விரும்புகிறீர்கள் என்பது உறுதி என்றால், கட்டளையை மீண்டும் சமர்ப்பித்து, அதன் முடிவில் ஒரு நட்சத்திரத்தை (*) வைக்கவும்.

# homeworlds.CMD_HOME_SINGLE
source: You're requesting a home world with only one star. This puts you at a strong disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.
ta: ஒரே ஒரு நட்சத்திரத்துடன் வீட்டு உலகத்தை நீங்கள் கோருகிறீர்கள். இது உங்களை ஒரு வலுவான பாதகத்தை ஏற்படுத்துகிறது. நீங்கள் இதைச் செய்ய விரும்புகிறீர்கள் என்பது உறுதி என்றால், கட்டளையை மீண்டும் சமர்ப்பித்து, அதன் முடிவில் ஒரு நட்சத்திரத்தை (*) வைக்கவும்.

# homeworlds.CMD_HOME_SMALLSHIP
source: You are requesting a home world without a large ship. This puts you at a disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.
ta: பெரிய கப்பல் இல்லாமல் ஒரு வீட்டு உலகத்தை நீங்கள் கோருகிறீர்கள். இது உங்களை ஒரு பாதகமாக வைக்கிறது. நீங்கள் இதைச் செய்ய விரும்புகிறீர்கள் என்பது உறுதி என்றால், கட்டளையை மீண்டும் சமர்ப்பித்து, அதன் முடிவில் ஒரு நட்சத்திரத்தை (*) வைக்கவும்.

# homeworlds.CMD_HOME_TECHS
source: You're requesting a home world that does not contain Green or Blue technologies. This is almost never wise. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.
ta: பச்சை அல்லது நீல தொழில்நுட்பங்கள் இல்லாத வீட்டு உலகத்தை நீங்கள் கோருகிறீர்கள். இது கிட்டத்தட்ட ஒருபோதும் அறிவாளி அல்ல. நீங்கள் இதைச் செய்ய விரும்புகிறீர்கள் என்பது உறுதி என்றால், கட்டளையை மீண்டும் சமர்ப்பித்து, அதன் முடிவில் ஒரு நட்சத்திரத்தை (*) வைக்கவும்.

# homeworlds.CMD_MOVE_CONNECTION
source: The systems {{from}} and {{to}} are not connected. You can only travel between systems that do not share any of the same-sized stars.
ta: {{from}} மற்றும் {{to}} க்கு அமைப்புகள் இணைக்கப்படவில்லை. ஒரே அளவிலான எந்த நட்சத்திரங்களையும் பகிர்ந்து கொள்ளாத அமைப்புகளுக்கு இடையில் மட்டுமே நீங்கள் பயணிக்க முடியும்.

# homeworlds.CMD_NOACTIONS
source: You have no actions remaining.
ta: உங்களிடம் எந்த நடவடிக்கையும் இல்லை.

# homeworlds.CMD_NOACTIONS_B
source: You have no more trade actions remaining.
ta: உங்களிடம் இன்னும் வர்த்தக நடவடிக்கைகள் இல்லை.

# homeworlds.CMD_NOACTIONS_G
source: You have no construction actions remaining.
ta: உங்களிடம் கட்டுமான நடவடிக்கைகள் எதுவும் இல்லை.

# homeworlds.CMD_NOACTIONS_R
source: You do not have any attack actions remaining.
ta: உங்களிடம் எந்த தாக்குதல் நடவடிக்கைகளும் இல்லை.

# homeworlds.CMD_NOACTIONS_Y
source: You have no movement actions remaining.
ta: உங்களிடம் எந்த இயக்க நடவடிக்கைகளும் இல்லை.

# homeworlds.CMD_NOSYSTEM
source: Could not find a system with the name {{system}}.
ta: {{system}} என்ற பெயருடன் ஒரு அமைப்பைக் கண்டுபிடிக்க முடியவில்லை.

# homeworlds.CMD_NOTECH_B
source: You do not have access to refurbishers (BLUE) in this system.
ta: இந்த அமைப்பில் புதுப்பிப்பாளர்களுக்கான (நீலம்) அணுகல் உங்களிடம் இல்லை.

# homeworlds.CMD_NOTECH_G
source: You do not have access to shipyards (GREEN) in this system.
ta: இந்த அமைப்பில் கப்பல் கட்டடங்களுக்கு (பச்சை) அணுகல் இல்லை.

# homeworlds.CMD_NOTECH_R
source: You do not have access to weapons technology (RED) in this system.
ta: இந்த அமைப்பில் உங்களிடம் ஆயுத தொழில்நுட்பத்திற்கான அணுகல் இல்லை.

# homeworlds.CMD_NOTECH_Y
source: You do not have access to propulsion technology (YELLOW) in this system.
ta: இந்த அமைப்பில் உந்துவிசை தொழில்நுட்பத்திற்கான (மஞ்சள்) அணுகல் உங்களிடம் இல்லை.

# homeworlds.CMD_PARAMETERS
source: The wrong number of parameters were provided.
ta: அளவுருக்களின் தவறான எண்ணிக்கை வழங்கப்பட்டது.

# homeworlds.CMD_PASS_FREE
source: You may not pass your free action.
ta: உங்கள் இலவச செயலை நீங்கள் தேர்ச்சி பெறக்கூடாது.

# homeworlds.CMD_PASS_TOOMANY
source: You tried to pass more actions than you have remaining.
ta: நீங்கள் மீதமுள்ளதை விட அதிகமான செயல்களை அனுப்ப முயற்சித்தீர்கள்.

# homeworlds.CMD_STARSHIP_NAME
source: The following ship/star designation could not be understood: {{arg}}.
ta: பின்வரும் கப்பல்/நட்சத்திர பதவியை புரிந்து கொள்ள முடியவில்லை: {{arg}}.

# homeworlds.CMD_TRADE_DOUBLE
source: You can't trade a ship for one of the same colour.
ta: அதே நிறத்திற்கு ஒரு கப்பலை நீங்கள் வணிகம் செய்ய முடியாது.

# homeworlds.CMD_TRADE_NOSIZE
source: There is no size {{size}} piece in the colour {{colour}}.
ta: {{size}}} வண்ணத்தில் {{colour}} துண்டு இல்லை.

# homeworlds.MOVE_MOREACTIONS
source: You still have actions to spend.
ta: நீங்கள் இன்னும் செலவழிக்க நடவடிக்கைகள் உள்ளன.

# homeworlds.MOVE_SELFELIMINATE
source: You may not eliminate yourself.
ta: உங்களை நீங்களே அகற்றக்கூடாது.

# homeworlds.MOVE_UNRECOGNIZED
source: Unrecognized command: {{cmd}}.
ta: அங்கீகரிக்கப்படாத கட்டளை: {{cmd}}.

# homeworlds.STASH_EMPTY
source: The stash has no more {{colour}} pieces left.
ta: ச்டாசுக்கு இனி {{colour}} துண்டுகள் இல்லை.

# homeworlds.SYSTEM_BADNAME
source: The system name you requested ({{name}}) is invalid. Names may be no longer than 25 characters, must start with a letter or a number, and may only contain numbers, letters, hyphens, and underscores. No spaces are allowed.
ta: நீங்கள் கோரிய கணினி பெயர் ({{name}}) தவறானது. பெயர்கள் 25 எழுத்துகளுக்கு மேல் இருக்கக்கூடாது, ஒரு கடிதம் அல்லது எண்ணுடன் தொடங்க வேண்டும், மேலும் எண்கள், கடிதங்கள், ஐபன்கள் மற்றும் அடிக்கோடிட்டுக் காட்டும் மட்டுமே இருக்கலாம். எந்த இடங்களும் அனுமதிக்கப்படவில்லை.

# homeworlds.SYSTEM_FULL
source: The {{system}} system is full. Home systems can only accommodate 16 ships. Periphery systems can accommodate 24.
ta: {{system}} அமைப்பு நிரம்பியுள்ளது. வீட்டு அமைப்புகள் 16 கப்பல்களுக்கு மட்டுமே இடமளிக்க முடியும். சுற்றளவு அமைப்புகள் 24 இடங்களுக்கு இடமளிக்க முடியும்.

# homeworlds.SYSTEM_NOSHIP
source: Could not find the ship {{ship} in the {{system}} system.
ta: {{system}} அமைப்பில் {{ship}} கப்பலைக் கண்டுபிடிக்க முடியவில்லை.

# status.amazons.ISOLATEDQUEENS
source: The queens are now isolated
ta: ராணிகள் இப்போது தனிமைப்படுத்தப்பட்டுள்ளன

# status.amazons.TERRITORY
source: Territory
ta: பிரதேசம்

# status.asli.TERRITORY
source: Territory & Prisoners
ta: பிரதேசம் & கைதிகள்

# status.bao.BALANCE
source: Material balance
ta: பொருள் சமநிலை

# status.blam.NUMPIECES
source: {{count}} piece
ta: {{count}} துண்டு

# status.bug.PLACEABLE_COUNT
source: Placeable count
ta: வைக்கக்கூடிய எண்ணிக்கை

# status.buku.SCORES_ONBOARD
source: Scores / On board
ta: மதிப்பெண்கள் / போர்டில்

# status.camelot.CASTLE_MOVE_COUNTS
source: Castle move count
ta: கோட்டை நகரும் எண்ணிக்கை

# status.CARDSINHAND
source: Cards in hand
ta: கையில் அட்டைகள்

# status.catapult.DAGGER
source: Dagger
ta: டாகர்

# status.chase.BALANCE
source: Imbalance
ta: ஏற்றத்தாழ்வு

# status.chase.IMBALANCE
source: Current player is imbalanced by {{delta}} speed.
ta: தற்போதைய பிளேயர் {{delta}} வேகத்தால் சமநிலையற்றது.

# status.conspirateurs.IN_DANGER
source: Spies in danger
ta: ஆபத்தில் உளவாளிகள்

# status.conspirateurs.TO_PLACE
source: Pieces to place
ta: இடங்களுக்கு துண்டுகள்

# status.control.CONTROLLED_SPACES
source: Controlled empty spaces
ta: கட்டுப்படுத்தப்பட்ட வெற்று இடங்கள்

# status.CLAIMS_REMAINING
source: Claims Remaining
ta: மீதமுள்ள உரிமைகோரல்கள்

# status.DAMAGE
source: Damage taken
ta: சேதம் எடுக்கப்பட்டது

# status.DISTANCES
source: Distances
ta: தூரம்

# status.entrapment.BARRIERS_REMAINING
source: Barriers remaining
ta: மீதமுள்ள தடைகள்

# status.entropy.CHAOS
source: Chaos
ta: குழப்பம்

# status.entropy.ORDER
source: Order
ta: ஒழுங்கு

# status.fnap
source: FNAP token
ta: Fnap கிள்ளாக்கு

# status.focus
source: Controlled
ta: கட்டுப்படுத்தப்பட்டது

# status.GROUPCOUNT
source: Group count
ta: குழு எண்ணிக்கை

# status.GROUPSIZES
source: Group sizes
ta: குழு அளவுகள்

# status.jacynth
source: Influence tokens
ta: செல்வாக்கு டோக்கன்கள்

# status.majorities
source: Scores (─, ⟋, ⟍)
ta: மதிப்பெண்கள் (─, ⟋, ⟍)

# status.meg.OFFENSE
source: Offensive player
ta: தாக்குதல் வீரர்

# status.meg.COUNTDOWN
source: Plies remaining
ta: மீதமுள்ள பிளீச்

# status.pacru.TARGET
source: Tiles to win
ta: வெல்ல ஓடுகள்

# status.pacru.TILES
source: Tiles on board
ta: போர்டில் ஓடுகள்

# status.PHASE
source: Phase
ta: கட்டம்

# status.PIECESINHAND
source: Pieces in hand
ta: கையில் துண்டுகள்

# status.PIECESINHANDSTASH
source: Pieces in hand / stash
ta: கையில் / ச்டாசில் துண்டுகள்

# status.PIECESONBOARD
source: Pieces on board
ta: போர்டில் துண்டுகள்

# status.PIECESREMAINING
source: Pieces remaining
ta: மீதமுள்ள துண்டுகள்

# status.pontedd.TILES
source: Tiles in hand
ta: கையில் ஓடுகள்

# status.pontedd.BRIDGES
source: Bridges available
ta: பாலங்கள் கிடைக்கின்றன

# status.queensland.GAME1
source: Game 1
ta: விளையாட்டு 1

# status.queensland.GAME2
source: Game 2
ta: விளையாட்டு 2

# status.ROUND
source: Round
ta: சுற்று

# status.SCORES
source: Scores
ta: மதிப்பெண்கள்

# status.tumbleweed
source: Score (pieces + influence)
ta: மதிப்பெண் (துண்டுகள் + செல்வாக்கு)

# status.ESTIMATEDSCORES
source: Estimated scores
ta: மதிப்பிடப்பட்ட மதிப்பெண்கள்

# status.TOPLACE
source: Piece to place
ta: இடத்திற்கு துண்டு

# status.valley
source: Moon Tokens
ta: சந்திரன் டோக்கன்கள்

# status.YEAR
source: Year
ta: ஆண்டு

# validation._general.CAPTURE4MOVE
source: You signalled a capture, but there's no piece at {{where}}.
ta: நீங்கள் ஒரு பிடிப்பை சமிக்ஞை செய்தீர்கள், ஆனால் {{where}} இல் எந்த துண்டு இல்லை.

# validation._general.DEFAULT_HANDLER
source: This is the default handler and should never be called directly. Please inform the administrator.
ta: இது இயல்புநிலை கையாளுபவர் மற்றும் ஒருபோதும் நேரடியாக அழைக்கப்படக்கூடாது. நிர்வாகிக்கு தெரிவிக்கவும்.

# validation._general.FAILSAFE
source: The move '{{move}}' passed validation but does not appear to be legal. Please inform the administrator.
ta: '{{move}}' நகர்வு சரிபார்ப்பைக் கடந்து சென்றது, ஆனால் சட்டபூர்வமானது என்று தெரியவில்லை. நிர்வாகிக்கு தெரிவிக்கவும்.

# validation._general.GENERIC
source: A generic error occurred while processing your click: Error message: {{emessage}} Stack: {{estack}} Move: {{move}}, Row: {{row}}, Col: {{col}}, Index: {{index}}
ta: உங்கள் சொடுக்கு செயலாக்கும்போது பொதுவான பிழை ஏற்பட்டது: பிழை செய்தி: {{emessage}} அடுக்கு: {{estack}}} நகர்த்து: {{move}}, வரிசை: {{row}}, col: {{col}}, குறியீட்டு: {{index}}

# validation._general.INCOMPLETE_MOVE
source: This move looks incomplete.
ta: இந்த நடவடிக்கை முழுமையடையாது.

# validation._general.INVALID_MOVE
source: '{{move}}' doesn't look like a valid move.
ta: '{{move}}' சரியான நடவடிக்கை போல் தெரியவில்லை.

# validation._general.INVALID_NUMBER
source: {{num}} could not be processed as a number.
ta: {{num}} ஒரு எண்ணாகச் செயலாக்க முடியவில்லை.

# validation._general.INVALIDCELL
source: Could not find the cell '{{cell}}' on the board.
ta: போர்டில் '{{cell}}' என்ற கலத்தைக் கண்டுபிடிக்க முடியவில்லை.

# validation._general.MOVE4CAPTURE
source: You signalled a regular move, but {{where}} is occupied.
ta: நீங்கள் ஒரு வழக்கமான நகர்வை சமிக்ஞை செய்தீர்கள், ஆனால் {{where}} ஆக்கிரமிக்கப்பட்டுள்ளது.

# validation._general.NEED_DESTINATION
source: Provide the destination.
ta: இலக்கை வழங்கவும்.

# validation._general.NO_MOVES
source: The piece at {{where}} does not have any legal moves.
ta: {{where}} இல் உள்ள துண்டு சட்டப்பூர்வ நகர்வுகள் இல்லை.

# validation._general.NOLOS
source: There is no line of sight between {{from}} and {{to}}.
ta: {{from}} மற்றும் {{to}} க்கு இடையில் எந்தவிதமான பார்வையும் இல்லை.

# validation._general.NONEXISTENT
source: Trying to interact with a piece or stack that doesn't exist at {{where}}.
ta: {{where}} இல் இல்லாத ஒரு துண்டு அல்லது அடுக்குடன் தொடர்பு கொள்ள முயற்சிக்கிறது.

# validation._general.NOPIECES
source: You have no pieces to place.
ta: உங்களிடம் வைக்க துண்டுகள் இல்லை.

# validation._general.NOT_ORTH
source: The cells {{from}} and {{to}} are not orthogonal to each other.
ta: {{from}} மற்றும் {{to}}} க்கு ஆகியவை ஒருவருக்கொருவர் செங்குத்து அல்ல.
