Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.basalt.INITIAL_INSTRUCTIONS_response
source: You must now choose which colour to play. You must either click the "Swap player seats" button to play as first player, or pass to continue as second player.
ta: எந்த நிறத்தை இயக்க வேண்டும் என்பதை இப்போது நீங்கள் தேர்வு செய்ய வேண்டும். முதல் பிளேயராக விளையாட "பிளேயர் இருக்கைகள்" பொத்தானைக் சொடுக்கு செய்ய வேண்டும், அல்லது இரண்டாவது வீரராக தொடரலாம்.

# validation.basalt.PARTIAL
source: Select a destination
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்

# validation.basalt.PIE_BAD_CELL
source: The cell {{cell}} does not appear to be valid.
ta: செல் {{cell}} செல்லுபடியாகாது.

# validation.basalt.PIE_BOTH_PCS
source: You must place at least one piece of each colour.
ta: ஒவ்வொரு நிறத்திலும் குறைந்தது ஒரு பகுதியையாவது வைக்க வேண்டும்.

# validation.basalt.PIE_PARTIAL
source: You may place up to four pieces, or click the "Complete move" button to stop here.
ta: நீங்கள் நான்கு துண்டுகள் வரை வைக்கலாம், அல்லது இங்கே நிறுத்த "முழுமையான நகர்வு" பொத்தானைக் சொடுக்கு செய்க.

# validation.basalt.PIE_PARTIAL_PLACE
source: Click a cell to place the P{{pc}} piece.
ta: P {{pc}} துண்டு வைக்க ஒரு கலத்தைக் சொடுக்கு செய்க.

# validation.basalt.PIE_PC_FIRST
source: You must first select a piece from the side of the board before selecting a cell.
ta: நீங்கள் முதலில் ஒரு கலத்தைத் தேர்ந்தெடுப்பதற்கு முன் பலகையின் பக்கத்திலிருந்து ஒரு பகுதியைத் தேர்ந்தெடுக்க வேண்டும்.

# validation.basalt.PIE_TWO_EACH
source: You may not place more than two pieces of any one colour.
ta: எந்தவொரு வண்ணத்தின் இரண்டு துண்டுகளுக்கு மேல் நீங்கள் வைக்கக்கூடாது.

# validation.basalt.PIE_TWO_FOUR
source: You may not place more than four pieces when offering pie.
ta: பை வழங்கும்போது நீங்கள் நான்கு துண்டுகளுக்கு மேல் வைக்கக்கூடாது.

# validation.bide.EMPTY_HAND
source: You have no more pieces to place.
ta: உங்களிடம் வைக்க இன்னும் துண்டுகள் இல்லை.

# validation.bide.INITIAL_INSTRUCTIONS
source: Select an empty space to place a piece, or pass if you wish to save this piece for later.
ta: ஒரு பகுதியை வைக்க வெற்று இடத்தைத் தேர்ந்தெடுக்கவும் அல்லது இந்த பகுதியை பின்னர் சேமிக்க விரும்பினால் கடந்து செல்லுங்கள்.

# validation.bide.MAY_RELEASE
source: Place more pieces if you wish to trigger a release.
ta: நீங்கள் ஒரு வெளியீட்டைத் தூண்ட விரும்பினால் மேலும் துண்டுகளை வைக்கவும்.

# validation.bide.MUST_RELEASE
source: A release has been triggered. You must place all your pieces.
ta: ஒரு வெளியீடு தூண்டப்பட்டுள்ளது. உங்கள் எல்லா துண்டுகளையும் வைக்க வேண்டும்.

# validation.biscuit.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.biscuit.INITIAL_INSTRUCTIONS
source: Select a card from your hand to place on the board.
ta: பலகையில் இடத்திற்கு உங்கள் கையில் இருந்து ஒரு அட்டையைத் தேர்ந்தெடுக்கவும்.

# validation.biscuit.INVALID_MOVE
source: That move is invalid. You may only place cards next to cards with at least one matching suit.
ta: அந்த நடவடிக்கை தவறானது. குறைந்தபட்சம் ஒரு பொருந்தக்கூடிய சூட்டைக் கொண்ட அட்டைகளுக்கு அடுத்ததாக அட்டைகளை மட்டுமே வைக்கலாம்.

# validation.biscuit.PARTIAL
source: Select the cell where you want to place the card.
ta: நீங்கள் அட்டையை வைக்க விரும்பும் கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.blam.BADSYNTAX
source: Invalid syntax: {{move}}. It should be the number 1, 2, or 3 followed by an empty cell (e.g., 1e4, or 3b2).
ta: தவறான தொடரியல்: {{move}}. இது எண் 1, 2, அல்லது 3 ஆக இருக்க வேண்டும், அதைத் தொடர்ந்து வெற்று செல் (எ.கா., 1e4, அல்லது 3B2).

# validation.blam.INITIAL_INSTRUCTIONS
source: Enter the size of the piece to place. You can click on your stash.
ta: இடத்தின் அளவை உள்ளிடவும். உங்கள் ச்டாசைக் சொடுக்கு செய்யலாம்.

# validation.blam.MOVES_NOPASS
source: You cannot pass while you have pieces to place.
ta: நீங்கள் வைக்க துண்டுகள் இருக்கும்போது நீங்கள் கடந்து செல்ல முடியாது.

# validation.blam.NOPIECE
source: You do not have a piece of size {{size}} to place.
ta: உங்களிடம் ஒரு அளவு {{size}} வைக்கவில்லை.

# validation.blam.PARTIAL
source: Provide the destination.
ta: இலக்கை வழங்கவும்.

# validation.blam.SIZEFIRST
source: First provide the size of the piece to place. You can click on your stash.
ta: முதலில் இடத்தின் அளவை வழங்கவும். உங்கள் ச்டாசைக் சொடுக்கு செய்யலாம்.

# validation.blastradius.INITIAL_INSTRUCTIONS
source: Click a cell to add a piece to the board.
ta: பலகையில் ஒரு பகுதியைச் சேர்க்க ஒரு கலத்தைக் சொடுக்கு செய்க.

# validation.blastradius.INVALID
source: You may not place pieces within radiation exclusion zones, and you must always create the smallest stack legally possible.
ta: கதிர்வீச்சு விலக்கு மண்டலங்களுக்குள் நீங்கள் துண்டுகளை வைக்கக்கூடாது, மேலும் நீங்கள் எப்போதும் சட்டப்பூர்வமாக சாத்தியமான மிகச்சிறிய அடுக்கை உருவாக்க வேண்டும்.

# validation.blockade.BLOCKS_GOAL
source: Cannot place wall at {{wall}} because it blocks the goal(s) for one of the pieces on the board.
ta: சுவரை {{wall}} இல் வைக்க முடியாது, ஏனெனில் இது பலகையில் உள்ள ஒரு துண்டுக்கான இலக்கை (களை) தடுக்கிறது.

# validation.blockade.EXCLUSIVE
source: You may only move a piece or place a wall, not both.
ta: நீங்கள் ஒரு பகுதியை மட்டுமே நகர்த்தலாம் அல்லது ஒரு சுவரை வைக்கலாம், இரண்டுமே அல்ல.

# validation.blockade.INITIAL_INSTRUCTIONS
source: Select a piece to move, then place a wall if you have any.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும், உங்களிடம் ஏதேனும் இருந்தால் ஒரு சுவரை வைக்கவும்.

# validation.blockade.INITIAL_INSTRUCTIONS_EXCLUSIVE
source: Select a piece to move or place a wall if you have any.
ta: உங்களிடம் ஏதேனும் இருந்தால் சுவரை நகர்த்த அல்லது வைக்க ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.blockade.INITIAL_INSTRUCTIONS_OPTIONAL
source: Select a piece to move, then optionally place a wall if you have any.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும், உங்களிடம் ஏதேனும் இருந்தால் விருப்பமாக ஒரு சுவரை வைக்கவும்.

# validation.blockade.INSUFFICIENT_HWALL
source: You have run out of horizontal walls.
ta: நீங்கள் கிடைமட்ட சுவர்கள் வெளியேறிவிட்டீர்கள்.

# validation.blockade.INSUFFICIENT_VWALL
source: You have run out of vertical walls.
ta: நீங்கள் செங்குத்து சுவர்கள் வெளியேறிவிட்டீர்கள்.

# validation.blockade.INVALID_CELL
source: The space {{cell}} is not valid.
ta: இடம் {{cell}} செல்லுபடியாகாது.

# validation.blockade.INVALID_TO
source: You may not move the piece from {{from}} to {{to}}.
ta: நீங்கள் {{from}} முதல் {{to}}வரை நகர்த்தக் கூடாது.

# validation.blockade.INVALID_WALL
source: The wall {{wall}} is not valid.
ta: சுவர் {{wall}} செல்லுபடியாகாது.

# validation.blockade.MISSING_DASH
source: The partial move '{{move}}' is missing a dash.
ta: பகுதி நடவடிக்கை '{{move}}' ஒரு கோடு இல்லை.

# validation.blockade.NO_COMPLETEABLE_WALL
source: Partial wall at {{wall}} is not valid because there is no completeable wall.
ta: {{wall} at இல் உள்ள பகுதி சுவர் செல்லுபடியாகாது, ஏனெனில் முழுமையான சுவர் இல்லை.

# validation.blockade.NO_VALID_MOVES
source: The piece at {{where}} has no valid moves to make.
ta: {{}} இல் உள்ள துண்டு செய்ய சரியான நகர்வுகள் இல்லை.

# validation.blockade.NO_WALL
source: You must place a wall
ta: நீங்கள் ஒரு சுவரை வைக்க வேண்டும்

# validation.blockade.NO_WALL_OPTIONAL
source: Place a wall if you wish, otherwise you may complete the move.
ta: நீங்கள் விரும்பினால் ஒரு சுவரை வைக்கவும், இல்லையெனில் நீங்கள் நகர்வை முடிக்கலாம்.

# validation.blockade.OCCUPIED_WALL
source: Unable to place a wall at {{wall}} because that space is already occupied.
ta: {{wall} at இல் ஒரு சுவரை வைக்க முடியவில்லை, ஏனெனில் அந்த இடம் ஏற்கனவே ஆக்கிரமிக்கப்பட்டுள்ளது.

# validation.blockade.SELECT_SECOND_WALL
source: There are two possible ways to complete the wall from {{wall}}. Select the side you wish to complete.
ta: {{wall} இருந்து இலிருந்து சுவரை முடிக்க இரண்டு வழிகள் உள்ளன. நீங்கள் முடிக்க விரும்பும் பக்கத்தைத் தேர்ந்தெடுக்கவும்.

# validation.blockade.SELECT_TO
source: Select a destination to move to.
ta: செல்ல ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.blooms.DESTINATION
source: Select a cell to place the piece.
ta: துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.blooms.INITIAL_INSTRUCTIONS
source: Place 1 or 2 pieces on the board. If you place 2 pieces, they must be of different colours.
ta: போர்டில் 1 அல்லது 2 துண்டுகளை வைக்கவும். நீங்கள் 2 துண்டுகளை வைத்தால், அவை வெவ்வேறு வண்ணங்களாக இருக்க வேண்டும்.

# validation.blooms.INITIAL_INSTRUCTIONS_FIRST
source: Place 1 piece of either colour on the board.
ta: போர்டில் 1 வண்ணத்தின் 1 துண்டு வைக்கவும்.

# validation.blooms.INVALID_PIECE
source: The only valid piece types are '1' and '2'. You gave '{{ piece }}'.
ta: செல்லுபடியாகும் துண்டு வகைகள் '1' மற்றும் '2'. நீங்கள் '{{ piece }}' கொடுத்தீர்கள்.

# validation.blooms.INVALIDTILE
source: The first character of the move notation has to be '1' or '2' for the tile type.
ta: நகரும் குறியீட்டின் முதல் எழுத்து ஓடு வகைக்கு '1' அல்லது '2' ஆக இருக்க வேண்டும்.

# validation.blooms.PLACE_NEXT
source: Click on the recently placed piece to switch colours, or click on another space to place a tile of the other colour.
ta: வண்ணங்களை மாற்ற அண்மைக் காலத்தில் வைக்கப்பட்டுள்ள பகுதியைக் சொடுக்கு செய்க, அல்லது மற்ற வண்ணத்தின் ஓடு வைக்க மற்றொரு இடத்தைக் சொடுக்கு செய்க.

# validation.blooms.SAME_CELL
source: Select two different cells to place the tiles.
ta: ஓடுகளை வைக்க இரண்டு வெவ்வேறு கலங்களைத் தேர்ந்தெடுக்கவும்.

# validation.blooms.SAME_TILE
source: You cannot place two tiles of the same type in the same move.
ta: ஒரே வகையின் இரண்டு ஓடுகளை ஒரே நகர்வில் வைக்க முடியாது.

# validation.blooms.TOO_MANY_MOVES
source: You may only place two pieces on the board per turn.
ta: நீங்கள் ஒரு திருப்பத்திற்கு இரண்டு துண்டுகளை மட்டுமே பலகையில் வைக்கலாம்.

# validation.blooms.TOO_MANY_MOVES_FIRST
source: You may only place one piece on the board on the first turn.
ta: முதல் திருப்பத்தில் நீங்கள் ஒரு பகுதியை மட்டுமே பலகையில் வைக்கலாம்.

# validation.bloqueo.INITIAL_INSTRUCTIONS_play
source: Select a pawn to move.
ta: நகர்த்த ஒரு சிப்பாயைத் தேர்ந்தெடுக்கவும்.

# validation.bloqueo.INITIAL_INSTRUCTIONS_setup
source: Select an empty space to place a pawn.
ta: ஒரு சிப்பாயை வைக்க வெற்று இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.bloqueo.PARTIAL_dest
source: Select the destination.
ta: இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.bloqueo.PARTIAL_place
source: Select a cell to place one of your pieces.
ta: உங்கள் துண்டுகளில் ஒன்றை வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.boom.INITIAL_INSTRUCTIONS
source: Select a stack to move or attack with.
ta: நகர்த்த அல்லது தாக்க ஒரு அடுக்கைத் தேர்ந்தெடுக்கவும்.

# validation.boom.OUT_OF_RANGE
source: Stacks can only move/attack a distance equal to the stack's height.
ta: அடுக்குகளின் உயரத்திற்கு சமமான தூரத்தை மட்டுமே அடுக்குகள் நகர்த்த/தாக்க முடியும்.

# validation.boom.PARTIAL
source: Select an empty space to move to, the opposing buffer to bear off, or an opponent's stack to attack.
ta: செல்ல ஒரு வெற்று இடத்தைத் தேர்ந்தெடுக்கவும், தாங்க எதிர்க்கும் இடையகம் அல்லது தாக்குவதற்கு எதிராளியின் அடுக்கு.

# validation.boom.TOOFAR
source: You cannot bear off from here.
ta: நீங்கள் இங்கிருந்து தாங்க முடியாது.

# validation.bounce.INITIAL_INSTRUCTIONS
source: Click a piece to move (or remove, if necessary).
ta: நகர்த்த ஒரு பகுதியைக் சொடுக்கு செய்க (அல்லது தேவைப்பட்டால் அகற்று).

# validation.bounce.LARGER_GROUP
source: Pieces must move from a smaller group to a larger group.
ta: துண்டுகள் ஒரு சிறிய குழுவிலிருந்து ஒரு பெரிய குழுவிற்கு செல்ல வேண்டும்.

# validation.bounce.MUST_MOVE
source: You may not remove checkers unless you have no other legal move.
ta: உங்களுக்கு வேறு சட்ட நடவடிக்கை இல்லாவிட்டால் நீங்கள் செக்கர்களை அகற்றக்கூடாது.

# validation.bounce.PARTIAL
source: Select an empty space to move, or click the checker again to remove it.
ta: நகர்த்துவதற்கு வெற்று இடத்தைத் தேர்ந்தெடுக்கவும் அல்லது அதை அகற்ற செக்கரை மீண்டும் சொடுக்கு செய்யவும்.

# validation.boxes.INITIAL_INSTRUCTIONS
source: Select an edge to draw a line.
ta: ஒரு வரியை வரைய ஒரு விளிம்பைத் தேர்ந்தெடுக்கவும்.

# validation.boxes.INVALID_WALL
source: The wall {{wall}} is not valid.
ta: சுவர் {{wall}} செல்லுபடியாகாது.

# validation.boxes.DUPLICATE
source: You have drawn a wall at {{where}}.
ta: நீங்கள் {{where}} இல் ஒரு சுவரை வரைந்துள்ளீர்கள்.

# validation.boxes.OCCUPIED
source: There is already a wall at {{where}}.
ta: {{where}} இல் ஏற்கனவே ஒரு சுவர் உள்ளது.

# validation.boxes.CONTINUE
source: You have completed a box. Select another edge to draw a line.
ta: நீங்கள் ஒரு பெட்டியை முடித்துவிட்டீர்கள். ஒரு வரியை வரைய மற்றொரு விளிம்பைத் தேர்ந்தெடுக்கவும்.

# validation.boxes.INVALID_CONTINUE
source: You cannot draw more lines.
ta: நீங்கள் அதிக வரிகளை வரைய முடியாது.

# validation.breakthrough.BADVARIANT
source: Bombardment moves are only allowed when that variant is active.
ta: அந்த மாறுபாடு செயலில் இருக்கும்போது மட்டுமே குண்டுவெடிப்பு நகர்வுகள் அனுமதிக்கப்படுகின்றன.

# validation.breakthrough.DIAGONAL_CAPTURES
source: Captures may only be made in a forward-diagonal direction.
ta: கைப்பற்றல்கள் முன்னோக்கி-மூலைவிட்ட திசையில் மட்டுமே செய்யப்படலாம்.

# validation.breakthrough.INITIAL_INSTRUCTIONS
source: Select one of your pawns.
ta: உங்கள் சிப்பாய்களில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.breakthrough.NOCAPTURES
source: Captures are not allowed in the 'Bombardment' variant.
ta: 'குண்டுவெடிப்பு' மாறுபாட்டில் பிடிப்புகள் அனுமதிக்கப்படவில்லை.

# validation.breakthrough.ONLY_FORWARD
source: Pieces may only move forward.
ta: துண்டுகள் மட்டுமே முன்னேறக்கூடும்.

# validation.breakthrough.PARTIAL
source: Provide the destination.
ta: இலக்கை வழங்கவும்.

# validation.breakthrough.TOOFAR
source: Pieces can only move one space at a time.
ta: துண்டுகள் ஒரு நேரத்தில் ஒரு இடத்தை மட்டுமே நகர்த்த முடியும்.

# validation.bug.BAD_GROW
source: Placement at {{where}} does not result in a valid bonus grow.
ta: {{}} இல் வேலைவாய்ப்பு சரியான போனச் வளராது.

# validation.bug.GROW
source: You have bugs that must eat and perform bonus grow. Select a space adjacent to a bug that eats to perform a bonus grow.
ta: உங்களிடம் பிழைகள் உள்ளன, அவை சாப்பிட வேண்டும் மற்றும் போனச் வளர வேண்டும். போனச் வளர்ந்து செய்ய சாப்பிடும் பிழைக்கு அருகிலுள்ள இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.bug.INITIAL_INSTRUCTIONS
source: Select a cell to introduce a new bug, or grow an existing bug.
ta: புதிய பிழையை அறிமுகப்படுத்த ஒரு கலத்தைத் தேர்ந்தெடுக்கவும் அல்லது ஏற்கனவே உள்ள பிழையை வளர்க்கவும்.

# validation.bug.MERGE
source: Placement at {{where}} will result in a merging of {{count}} bugs.
ta: {{}} இல் வேலை வாய்ப்பு {{where}} பிழைகள் ஒன்றிணைக்கும்.

# validation.bug.TOO_BIG
source: You may not grow a bug to a size greater than {{size}}, the size of the current largest bug.
ta: தற்போதைய மிகப்பெரிய பிழையின் அளவு {{size} fiss ஐ விட அதிகமான அளவிற்கு நீங்கள் ஒரு பிழையை வளர்க்கக்கூடாது.

# validation.buku.INITIAL_INSTRUCTIONS_ROW
source: Select a row to collect.
ta: சேகரிக்க ஒரு வரிசையைத் தேர்ந்தெடுக்கவும்.

# validation.buku.INITIAL_INSTRUCTIONS_COL
source: Select a column to collect.
ta: சேகரிக்க ஒரு நெடுவரிசையைத் தேர்ந்தெடுக்கவும்.

# validation.buku.INVALID_COLLECT
source: The collection notation '{{move}}' is invalid. It should start with the row or column followed by the number of pieces collected in brackets.
ta: சேகரிப்பு குறியீடு '{{move}}' தவறானது. இது வரிசை அல்லது நெடுவரிசையுடன் தொடங்கப்பட வேண்டும், அதைத் தொடர்ந்து அடைப்புக்குறிக்குள் சேகரிக்கப்பட்ட துண்டுகளின் எண்ணிக்கை.

# validation.buku.INVALID_COLLECT_ROW
source: The row '{{row}}' is invalid
ta: '{{row}}' வரிசை தவறானது

# validation.buku.WRONG_COLLECT_COUNT_ROW_FIRST
source: The number of pieces collected in the row '{{row}}' is incorrect. It should be {{count}}, which is the number of pieces in the row plus one for the first move.
ta: '{{row}}' வரிசையில் சேகரிக்கப்பட்ட துண்டுகளின் எண்ணிக்கை தவறானது. இது {{count} அச் ஆக இருக்க வேண்டும், இது முதல் நகர்வுக்கு வரிசையில் உள்ள துண்டுகளின் எண்ணிக்கை மற்றும் ஒன்றாகும்.

# validation.buku.WRONG_COLLECT_COUNT_ROW
source: The number of pieces collected in the row '{{row}}' is incorrect. It should be {{count}}.
ta: '{{row}}' வரிசையில் சேகரிக்கப்பட்ட துண்டுகளின் எண்ணிக்கை தவறானது. அது {{count} be ஆக இருக்க வேண்டும்.

# validation.buku.INVALID_COLLECT_COL
source: The column '{{col}}' is invalid
ta: '{{col}}' நெடுவரிசை தவறானது

# validation.buku.WRONG_COLLECT_COUNT_COL
source: The number of pieces collected in the column '{{col}}' is incorrect. It should be {{count}}.
ta: '{{col}}' நெடுவரிசையில் சேகரிக்கப்பட்ட துண்டுகளின் எண்ணிக்கை தவறானது. அது {{count} be ஆக இருக்க வேண்டும்.

# validation.buku.TOO_MANY_SOWS
source: You may only sow 1 piece.
ta: நீங்கள் 1 துண்டு மட்டுமே விதைக்கலாம்.

# validation.buku.DUPLICATE_SOW
source: You have already sown a piece at {{where}}.
ta: நீங்கள் ஏற்கனவே {{where}} இல் ஒரு பகுதியை விதைத்துள்ளீர்கள்.

# validation.buku.NOT_NEIGHBOURS
source: The cells {{curr}} and {{prev}} are not neighbours.
ta: {{curr}}} மற்றும் {{prev}} செல்கள் அண்டை நாடுகள் அல்ல.

# validation.buku.INVALID_MOVE
source: The move {{move}} is invalid.
ta: {{move}} நகர்வு தவறானது.

# validation.buku.START_SOWING
source: You have collected 1 piece. Selected a cell to start sowing.
ta: நீங்கள் 1 துண்டு சேகரித்திருக்கிறீர்கள். விதைக்கத் தொடங்க ஒரு கலத்தைத் தேர்ந்தெடுத்தது.

# validation.buku.GO_BACK
source: You still have 1 piece to sow. Click on a piece on the sowing path to revert to that point and try again.
ta: விதைக்க இன்னும் 1 துண்டு உள்ளது. அந்த இடத்திற்கு மாற்ற விதிக்கும் பாதையில் உள்ள ஒரு பகுதியைக் சொடுக்கு செய்து மீண்டும் முயற்சிக்கவும்.

# validation.buku.CONTINUE
source: You have 1 more piece to sow.
ta: விதைக்க இன்னும் 1 துண்டு உள்ளது.

# validation.buku.NORMALISE
source: The move needs to be normalised. Try '{{normalised}}'.
ta: நகர்வை இயல்பாக்க வேண்டும். '{{normalised}}' ஐ முயற்சிக்கவும்.

# validation.byte.ADJ_ONLY
source: Stacks may only move to adjacent cells.
ta: அடுக்குகள் அருகிலுள்ள கலங்களுக்கு மட்டுமே செல்லக்கூடும்.

# validation.byte.DIAG_ONLY
source: Stacks may only move diagonally.
ta: அடுக்குகள் குறுக்காக மட்டுமே நகரக்கூடும்.

# validation.byte.INITIAL_INSTRUCTIONS
source: Select a stack to move. If merging stacks, select the bottom checker you wish to move.
ta: நகர்த்த ஒரு அடுக்கைத் தேர்ந்தெடுக்கவும். அடுக்குகளை ஒன்றிணைத்தால், நீங்கள் நகர்த்த விரும்பும் கீழே உள்ள செக்கரைத் தேர்ந்தெடுக்கவும்.

# validation.byte.INVALID_INDEX
source: There is no checker at position {{index}} in the stack at {{where}}.
ta: {{index}} இல் உள்ள அடுக்கில் {{where}} என்ற நிலையில் சரிபார்ப்பு இல்லை.

# validation.byte.INVALID_MERGE
source: When merging stacks, the destination space must be occupied
ta: அடுக்குகளை ஒன்றிணைக்கும் போது, இலக்கு இடத்தை ஆக்கிரமிக்க வேண்டும்

# validation.byte.INVALID_MVMT
source: When moving whole stacks, the destination space must be empty.
ta: முழு அடுக்குகளையும் நகர்த்தும்போது, இலக்கு இடம் காலியாக இருக்க வேண்டும்.

# validation.byte.INVALID_PASS
source: You may not pass if you have any legal moves available, even if those moves would benefit your opponent.
ta: உங்களிடம் ஏதேனும் சட்ட நகர்வுகள் இருந்தால் நீங்கள் கடந்து செல்லக்கூடாது, அந்த நகர்வுகள் உங்கள் எதிரிக்கு பயனளிக்கும்.

# validation.byte.MUST_APPROACH
source: When moving a stack to an empty space, you must move closer to the closest stacks.
ta: வெற்று இடத்திற்கு ஒரு அடுக்கை நகர்த்தும்போது, நீங்கள் மிக நெருக்கமான அடுக்குகளுக்கு அருகில் செல்ல வேண்டும்.

# validation.byte.MUST_CLIMB
source: When merging, the bottom checker must end up at a higher position than where it started.
ta: ஒன்றிணைக்கும் போது, கீழே செக்கர் தொடங்கிய இடத்தை விட உயர்ந்த நிலையில் முடிவடையும்.

# validation.byte.TOO_HIGH
source: Moving {{count}} checker from {{from}} to {{to}} would result in a stack that is too high.
ta: {{count}}} {{{{{from} பெறுநர் க்கு {}} செக்கரை நகர்த்துவது மிக அதிகமாக இருக்கும் ஒரு அடுக்கை ஏற்படுத்தும்.

# validation.byte.UNOWNED_INDEX
source: You don't control the checker at position {{index}} in the stack at {{where}}.
ta: {{where} at இல் உள்ள அடுக்கில் {{index}} என்ற நிலையில் செக்கரை நீங்கள் கட்டுப்படுத்தவில்லை.

# validation.c1.INITIAL_INSTRUCTIONS
source: Select a piece or a tile to move.
ta: நகர்த்த ஒரு துண்டு அல்லது ஒரு ஓடு என்பதைத் தேர்ந்தெடுக்கவும்.

# validation.c1.INITIAL_INSTRUCTIONS_TWO_MOVE
source: Select a tile, then a piece to move; or select a piece to move directly.
ta: ஒரு ஓடு என்பதைத் தேர்ந்தெடுக்கவும், பின்னர் நகர்த்த ஒரு துண்டு; அல்லது நேரடியாக நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.c1.INITIAL_INSTRUCTIONS_TWO_MOVE_NO_TILE
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.c1.NOT_SLIDABLE
source: The tile at {{where}} is not slidable.
ta: {{where} at இல் உள்ள ஓடு மந்தமானதல்ல.

# validation.c1.MISSING_PREFIX
source: The prefix '{{prefix}}' is missing. Try '{{move}}'.
ta: '{{prefix}}' முன்னொட்டு இல்லை. '{{move}}' ஐ முயற்சிக்கவும்.

# validation.c1.WRONG_PREFIX
source: The correct prefix should be '{{prefix}}'. Try '{{move}}'.
ta: சரியான முன்னொட்டு '{{prefix}}' ஆக இருக்க வேண்டும். '{{move}}' ஐ முயற்சிக்கவும்.

# validation.c1.INVALID_TO
source: The {{what}} at {{from}} cannot move to {{to}}.
ta: } க்கு {{}}}}}} for}}} {{what} பெறுநர் க்கு செல்ல முடியாது.

# validation.c1.USE_ELIMINATE_NOTATION
source: Use an 'x' to indicate tile elimination. Try '{{move}}'.
ta: ஓடு நீக்குவதைக் குறிக்க 'ஃச்' ஐப் பயன்படுத்தவும். '{{move}}' ஐ முயற்சிக்கவும்.

# validation.c1.USE_MOVE_NOTATION
source: You used a 'x' but there was no tile elimination. Try '{{move}}'.
ta: நீங்கள் ஒரு 'ஃச்' ஐப் பயன்படுத்தினீர்கள், ஆனால் ஓடு நீக்குதல் இல்லை. '{{move}}' ஐ முயற்சிக்கவும்.

# validation.c1.MOVE_TILE_FIRST
source: If you make two moves, the first move must be a tile move.
ta: நீங்கள் இரண்டு நகர்வுகளைச் செய்தால், முதல் நடவடிக்கை ஒரு ஓடு நகர்வாக இருக்க வேண்டும்.

# validation.c1.MOVE_PIECE_SECOND
source: If you make two moves, the second move must be a piece move.
ta: நீங்கள் இரண்டு நகர்வுகளைச் செய்தால், இரண்டாவது நகர்வு ஒரு துண்டு நகர்வாக இருக்க வேண்டும்.

# validation.c1.NEED_SECOND_MOVE
source: Select a pyramid or cone to move.
ta: நகர்த்த ஒரு பிரமிடு அல்லது கூம்பைத் தேர்ந்தெடுக்கவும்.

# validation.calculus.BAD_MOVE
source: You may not move pieces that form perimeters around legal areas.
ta: சட்டப்பூர்வ பகுதிகளைச் சுற்றி சுற்றளவு உருவாக்கும் துண்டுகளை நீங்கள் நகர்த்தக்கூடாது.

# validation.calculus.BAD_PERIMETER
source: That placement would create an illegal area with an equal number of stones on the perimeter.
ta: அந்த வேலைவாய்ப்பு சுற்றளவில் சம எண்ணிக்கையிலான கற்களைக் கொண்ட ஒரு சட்டவிரோத பகுதியை உருவாக்கும்.

# validation.calculus.COLLIDES
source: The new position would collide with a piece at {{with}}.
ta: புதிய நிலை} with உடன் ஒரு துண்டுடன் மோதும்.

# validation.calculus.INITIAL_INSTRUCTIONS
source: Select an existing piece to move it, or click on the open space to slide a new piece to that position. If the selected position would lead to a collision, the system will attempt to snap the piece to a logical valid position.
ta: அதை நகர்த்த ஏற்கனவே இருக்கும் பகுதியைத் தேர்ந்தெடுக்கவும் அல்லது அந்த நிலைக்கு ஒரு புதிய பகுதியை சறுக்குவதற்கு திறந்தவெளியைக் சொடுக்கு செய்யவும். தேர்ந்தெடுக்கப்பட்ட நிலை மோதலுக்கு வழிவகுக்கும் என்றால், கணினி ஒரு தர்க்கரீதியான செல்லுபடியாகும் நிலைக்கு எடுக்க முயற்சிக்கும்.

# validation.calculus.INVALID_POINT
source: Could not find a valid placement point near where you clicked. Please try again.
ta: நீங்கள் சொடுக்கு செய்த இடத்திற்கு அருகில் செல்லுபடியாகும் வேலைவாய்ப்பு புள்ளியைக் கண்டுபிடிக்க முடியவில்லை. மீண்டும் முயற்சிக்கவும்.

# validation.calculus.NO_PATH
source: No path wide enough to accommodate a piece appears to exist between {{from}} and {{to}}.
ta: }}} மற்றும் {{from} க்கு க்கு இடையில் ஒரு துண்டுக்கு இடமளிக்க போதுமான பாதை இல்லை.

# validation.calculus.NOT_CONTAINED
source: Pieces may not hang over the edge of the board.
ta: துண்டுகள் பலகையின் விளிம்பில் தொங்கக்கூடாது.
