Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.margo.KO
source: Ko rule: you may not immediately recapture your opponent's single ball if they just used it to capture one of yours.
ta: கோ விதி: உங்களுடைய ஒன்றைப் பிடிக்க அவர்கள் அதைப் பயன்படுத்தினால், உங்கள் எதிரியின் ஒற்றை பந்தை நீங்கள் உடனடியாக மீண்டும் கைப்பற்றக்கூடாது.

# validation.margo.SELF_CAPTURE
source: You may not place your balls in self-capture.
ta: உங்கள் பந்துகளை தன்வய பிடியில் வைக்கக்கூடாது.

# validation.margo.SUPERKO
source: Superko rule: you may not recreate a previous board position with the same player to play.
ta: சூப்பர்கோ விதி: விளையாடுவதற்கு அதே வீரருடன் முந்தைய போர்டு நிலையை நீங்கள் மீண்டும் உருவாக்கக்கூடாது.

# validation.mattock.INITIAL_INSTRUCTIONS
source: Select a space to mine, then optionally move a miner.
ta: என்னுடைய ஒரு இடத்தைத் தேர்ந்தெடுத்து, விருப்பமாக ஒரு சுரங்கத் தொழிலாளரை நகர்த்தவும்.

# validation.mattock.INITIAL_INSTRUCTIONS_PASS
source: You must pass as player 1 so that player 2 can begin.
ta: நீங்கள் பிளேயர் 1 ஆக கடக்க வேண்டும், இதனால் பிளேயர் 2 தொடங்கலாம்.

# validation.mattock.INITIAL_INSTRUCTIONS_PLACEMENT
source: Select a space to place a miner.
ta: ஒரு சுரங்கத் தொழிலாளியை வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.mattock.INVALID_FROM
source: You do not have a miner at {{from}} to move.
ta: {} From} க்கு இல் ஒரு சுரங்கத் தொழிலாளி உங்களிடம் இல்லை.

# validation.mattock.INVALID_MINE
source: Mining at {{mine}} will result in a tile touching more than 3 other tiles.
ta: {{mine} at இல் சுரங்கமானது 3 மற்ற ஓடுகளுக்கு மேல் ஒரு ஓடு தொடும்.

# validation.mattock.INVALID_PLACE
source: You may not place a miner that is adjacent to another miner on the board.
ta: போர்டில் மற்றொரு சுரங்கத் தொழிலாளியை ஒட்டிய ஒரு சுரங்கத் தொழிலாளியை நீங்கள் வைக்கக்கூடாது.

# validation.mattock.INVALID_TO
source: You may not move the miner from {{from}} to {{to}}.
ta: நீங்கள் சுரங்கத் தொழிலாளரை {{from}} முதல் {{to}} வரை நகர்த்தக்கூடாது.

# validation.mattock.MINED
source: {{mine}} has already been mined.
ta: {{mine}} ஏற்கனவே வெட்டப்பட்டது.

# validation.mattock.MOVE_INSTRUCTIONS
source: Select a space to move the miner to.
ta: சுரங்கத் தொழிலாளியை நகர்த்த ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.mattock.MULTIPLE_PLACEMENT
source: You may only place one miner.
ta: நீங்கள் ஒரு சுரங்கத் தொழிலாளரை மட்டுமே வைக்கலாம்.

# validation.mattock.MUST_PASS
source: You must pass as player 1 so that player 2 can begin.
ta: நீங்கள் பிளேயர் 1 ஆக கடக்க வேண்டும், இதனால் பிளேயர் 2 தொடங்கலாம்.

# validation.mattock.NO_MOVES
source: You miner at {{from}} has no valid spaces to move to.
ta: {{from} க்கு இல் நீங்கள் சுரங்கத்திற்கு செல்ல சரியான இடங்கள் இல்லை.

# validation.mattock.TO_INSTRUCTIONS
source: Select a space to move the miner to.
ta: சுரங்கத் தொழிலாளியை நகர்த்த ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.mattock.UNREACHABLE_MINE
source: {{mine}} is not reachable by any of your miners.
ta: {{mine} your உங்கள் சுரங்கத் தொழிலாளர்கள் எவராலும் அணுக முடியாது.

# validation.mchess.BAD_CALL
source: You may not "call the clock" before seven moves have passed without capture or when the countdown is already active.
ta: ஏழு நகர்வுகள் பிடிக்கப்படாமல் அல்லது கவுண்டவுன் ஏற்கனவே செயலில் இருக்கும்போது நீங்கள் "கடிகாரத்தை அழைக்க" இருக்கக்கூடாது.

# validation.mchess.INITIAL_INSTRUCTIONS
source: Select a piece on your side of the board to move.
ta: நகர்த்த பலகையின் உங்கள் பக்கத்தில் ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.mchess.INVALID_MOVE
source: You're either trying to move too far or jump another piece.
ta: நீங்கள் வெகுதூரம் செல்ல முயற்சிக்கிறீர்கள் அல்லது மற்றொரு பகுதியை குதிக்க முயற்சிக்கிறீர்கள்.

# validation.mchess.INVALID_PROMOTION
source: Invalid field promotion. You can only promote to piece sizes you don't already control.
ta: தவறான புலம் பதவி உயர்வு. நீங்கள் ஏற்கனவே கட்டுப்படுத்தாத துண்டு அளவுகளுக்கு மட்டுமே விளம்பரப்படுத்த முடியும்.

# validation.mchess.NO_MIRROR_MOVE
source: You can't just undo you opponent's move.
ta: எதிரியின் நகர்வை நீங்கள் செயல்தவிர்க்க முடியாது.

# validation.mchess.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.mchess.VALID_MOVE_counter
source: Looks like a valid move.
ta: சரியான நடவடிக்கை போல் தெரிகிறது.

# validation.mchess.VALID_MOVE_nocounter
source: Looks like a valid move. You may add an asterisk (*) to the end of the move to "call the clock" if you believe the game is deadlocked.
ta: சரியான நடவடிக்கை போல் தெரிகிறது. விளையாட்டு முட்டுக்கட்டை போடப்பட்டதாக நீங்கள் நம்பினால், "கடிகாரத்தை அழைக்க" நகர்வின் முடிவில் நீங்கள் ஒரு நட்சத்திரத்தை (*) சேர்க்கலாம்.

# validation.meg.INITIAL_INSTRUCTIONS_defense
source: Place a blocker in any empty space.
ta: எந்த வெற்று இடத்திலும் ஒரு தடுப்பாளரை வைக்கவும்.

# validation.meg.INITIAL_INSTRUCTIONS_offense
source: Place a receiver in any empty space or select the ball to make a shot.
ta: எந்த வெற்று இடத்திலும் ஒரு ரிசீவரை வைக்கவும் அல்லது காட்சி செய்ய பந்தைத் தேர்ந்தெடுக்கவும்.

# validation.meg.INITIAL_INSTRUCTIONS_setup
source: Place a receiver in any empty space or select an existing piece to "take the ball" and play as offense.
ta: எந்தவொரு வெற்று இடத்திலும் ஒரு ரிசீவரை வைக்கவும் அல்லது "பந்தை எடுக்க" ஏற்கனவே இருக்கும் துண்டைத் தேர்ந்தெடுக்கவும், குற்றமாக விளையாடவும்.

# validation.meg.PARTIAL
source: Continue selecting receivers or click "Complete move" to stop the shot here.
ta: பெறுநர்களைத் தேர்ந்தெடுப்பதைத் தொடரவும் அல்லது இங்கே சாட்டை நிறுத்த "முழுமையான நகர்வு" என்பதைக் சொடுக்கு செய்க.

# validation.meg.SHOT_START
source: Select a receiver.
ta: பெறுநரைத் தேர்ந்தெடுக்கவும்.

# validation.meridians.INITIAL_INSTRUCTIONS
source: Place a piece on the board.
ta: பலகையில் ஒரு துண்டு வைக்கவும்.

# validation.meridians.INITIAL_INSTRUCTIONS_PASS
source: Either invoke the pie rule to play as first player or pass to play as second. If pie was already invoked, your only option is to pass.
ta: முதல் வீரராக விளையாட பை விதியை அழைக்கவும் அல்லது இரண்டாவது இடமாக விளையாடவும். பை ஏற்கனவே பயன்படுத்தப்பட்டிருந்தால், உங்கள் ஒரே வழி கடந்து செல்ல வேண்டும்.

# validation.meridians.INITIAL_INSTRUCTIONS_SETUP
source: Setup phase: place a piece of each colour on the board.
ta: அமைவு கட்டம்: ஒவ்வொரு வண்ணத்தின் ஒரு பகுதியையும் பலகையில் வைக்கவும்.

# validation.meridians.NOLOS
source: There is no line of sight to {{where}} from any of your pieces.
ta: உங்கள் எந்தவொரு துண்டுகளிலிருந்தும் {{where} பெறுநர் க்கு எந்த பார்வையும் இல்லை.

# validation.meridians.ONE_MORE
source: Place a piece of the other colour.
ta: மற்ற வண்ணத்தின் ஒரு பகுதியை வைக்கவும்.

# validation.meridians.SAME_CELL
source: In the setup phase, place two pieces on different cells.
ta: அமைவு கட்டத்தில், வெவ்வேறு கலங்களில் இரண்டு துண்டுகளை வைக்கவும்.

# validation.meridians.SECOND_PLAYER_PASS
source: Either invoke the pie rule to play as first player or pass to play as second. If pie was already invoked, your only option is to pass.
ta: முதல் வீரராக விளையாட பை விதியை அழைக்கவும் அல்லது இரண்டாவது இடமாக விளையாடவும். பை ஏற்கனவே பயன்படுத்தப்பட்டிருந்தால், உங்கள் ஒரே வழி கடந்து செல்ல வேண்டும்.

# validation.meridians.SECOND_STONE_NEIGHBOUR
source: The second stone placed must have a path to the first stone (cannot be adjacent).
ta: வைக்கப்பட்டுள்ள இரண்டாவது கல் முதல் கல்லுக்கு ஒரு பாதையைக் கொண்டிருக்க வேண்டும் (அருகில் இருக்க முடியாது).

# validation.meridians.TOO_MANY_MOVES
source: You may only make one move per turn, or two at in the setup phase as first player.
ta: முதல் வீரராக அமைவு கட்டத்தில் நீங்கள் ஒரு திருப்பத்திற்கு ஒரு நகர்வை மட்டுமே செய்யலாம்.

# validation.mimic.FROZEN_PIECE
source: This piece is frozen because there are two or more orthogonally visible opponent pieces.
ta: இந்த துண்டு உறைந்திருக்கும், ஏனெனில் இரண்டு அல்லது அதற்கு மேற்பட்ட ஆர்த்தோகோனிகல் காணக்கூடிய எதிரி துண்டுகள் உள்ளன.

# validation.mimic.INITIAL_INSTRUCTIONS
source: Select one of your pieces to move.
ta: நகர்த்த உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.mimic.MOVE_TO_EMPTY
source: Select an adjacent empty space to move to.
ta: செல்ல அருகிலுள்ள வெற்று இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.mimic.NO_LEGAL_MOVES
source: This piece has no legal moves.
ta: இந்த துண்டுக்கு சட்டப்பூர்வ நகர்வுகள் இல்லை.

# validation.mimic.NO_REVERSES
source: You may not make a move which undoes the previous turn.
ta: முந்தைய திருப்பத்தை செயல்தவிர்க்கும் ஒரு நகர்வை நீங்கள் செய்யக்கூடாது.

# validation.mirador.ALREADY_DECLARED
source: Someone has already declared. You can not declare now.
ta: யாரோ ஏற்கனவே அறிவித்துள்ளனர். நீங்கள் இப்போது அறிவிக்க முடியாது.

# validation.mirador.BAD_PLACEMENT
source: You can not play at {{where}}. It would be adjacent or overlapping with another mirador. The only adjacency allowed is diagonal to one of your own miradors.
ta: நீங்கள் {{where}} இல் விளையாட முடியாது. இது மற்றொரு மிராடருடன் அருகில் அல்லது ஒன்றுடன் ஒன்று இருக்கும். உங்கள் சொந்த மீரடர்களில் ஒருவருக்கு மூலைவிட்டம் மட்டுமே அனுமதிக்கப்படுகிறது.

# validation.mirador.INITIAL_INSTRUCTIONS
source: Place a mirador, or, if you think your connection is unassailable, declare
ta: ஒரு மிராடரை வைக்கவும், அல்லது, உங்கள் இணைப்பு அறிய முடியாதது என்று நீங்கள் நினைத்தால், அறிவிக்கவும்

# validation.mirador.INITIAL_INSTRUCTIONS_CHALLENGE
source: Place as many miradors as you would like.
ta: நீங்கள் விரும்பும் அளவுக்கு மிராடர்களை வைக்கவும்.

# validation.mirador.NO_EDGE_PLAY
source: You can not play on the very edge of the board.
ta: நீங்கள் பலகையின் விளிம்பில் விளையாட முடியாது.

# validation.mirador.SINGLE_PLACEMENT
source: You can only place one mirador.
ta: நீங்கள் ஒரு மிராடரை மட்டுமே வைக்க முடியும்.

# validation.mirador.VALID_PARTIAL_MOVE
source: Keep placing miradors until you have broken all the opponent's connections.
ta: எதிரியின் அனைத்து இணைப்புகளையும் நீங்கள் உடைக்கும் வரை மிராடோர்சை வைத்திருங்கள்.

# validation.mixtour.INITIAL_INSTRUCTIONS
source: Click an empty space to enter a new piece, or click the bottom tile of a stack or substack to move it.
ta: புதிய பகுதியை உள்ளிட வெற்று இடத்தைக் சொடுக்கு செய்க, அல்லது அதை நகர்த்த ஒரு அடுக்கு அல்லது சஃப்ரேக்கின் கீழ் ஓடு என்பதைக் சொடுக்கு செய்க.

# validation.mixtour.INVALID_DISTANCE
source: Stacks must move the exact distance of the height of the *target* stack.
ta: அடுக்குகள் * இலக்கு * அடுக்கின் உயரத்தின் சரியான தூரத்தை நகர்த்த வேண்டும்.

# validation.mixtour.INVALID_PASS
source: You may not pass as long as other valid moves are available.
ta: மற்ற செல்லுபடியாகும் நகர்வுகள் கிடைக்கும் வரை நீங்கள் கடந்து செல்லக்கூடாது.

# validation.mixtour.INVALID_TILE_NUM
source: If you specify a tile number, it must be no greater than the height of the stack. The top tile of a stack is tile number '1'.
ta: நீங்கள் ஒரு ஓடு எண்ணைக் குறிப்பிட்டால், அது அடுக்கின் உயரத்தை விட அதிகமாக இருக்கக்கூடாது. ஒரு அடுக்கின் மேல் ஓடு ஓடு எண் '1' ஆகும்.

# validation.mixtour.MOVE_MUST_STACK
source: Moving stacks must end their movement on top of another stack.
ta: நகரும் அடுக்குகள் அவற்றின் இயக்கத்தை மற்றொரு அடுக்கின் மேல் முடிக்க வேண்டும்.

# validation.mixtour.PARTIAL_FULLSTACK
source: Looks like you want to move an entire stack. Provide the destination.
ta: நீங்கள் ஒரு முழு அடுக்கை நகர்த்த விரும்புகிறீர்கள் என்று தெரிகிறது. இலக்கை வழங்கவும்.

# validation.mixtour.PARTIAL_SUBSTACK
source: Looks like you want to move the top piece from the stack. Provide the destination.
ta: நீங்கள் அடுக்கிலிருந்து மேல் பகுதியை நகர்த்த விரும்புகிறீர்கள் என்று தெரிகிறது. இலக்கை வழங்கவும்.

# validation.monkey.INITIAL_INSTRUCTIONS
source: Select one of your pieces.
ta: உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.monkey.MOVE_CLOSER
source: When singletons make noncapturing moves, they must move closer to the enemy queen (straight-line distance).
ta: சிங்கிள்டன் கைப்பற்றப்படாத நகர்வுகளைச் செய்யும்போது, அவை எதிரி ராணிக்கு (நேர்-வரி தூரம்) நெருக்கமாக செல்ல வேண்டும்.

# validation.monkey.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.monkey.QUEEN_DEPLETED
source: Your queen can no longer make noncapturing moves.
ta: உங்கள் அரசி இனி வகுப்பற்ற நகர்வுகளைச் செய்ய முடியாது.

# validation.moonsquad.BAD_CAPTURE
source: You may only capture adjacent opposing pieces and squads.
ta: நீங்கள் அருகிலுள்ள எதிரெதிர் துண்டுகள் மற்றும் அணிகளை மட்டுமே கைப்பற்றலாம்.

# validation.moonsquad.BAD_MOVE_double
source: You already have a squad at {{to}}.
ta: உங்களிடம் ஏற்கனவே {{to} at இல் ஒரு அணி உள்ளது.

# validation.moonsquad.BAD_MOVE_group
source: You can't move from {{from}} to {{to}}. The squad must stay within the same connected group.
ta: நீங்கள் {{from}} முதல் {{to}} வரை செல்ல முடியாது. அணி ஒரே இணைக்கப்பட்ட குழுவிற்குள் இருக்க வேண்டும்.

# validation.moonsquad.BAD_MOVE_stationary
source: You can't move from a space to the same space.
ta: நீங்கள் ஒரு இடத்திலிருந்து அதே இடத்திற்கு செல்ல முடியாது.

# validation.moonsquad.BAD_PLACEMENT
source: You can't place a piece at {{where}}. It must contain an ore cube.
ta: நீங்கள் {{where}} இல் ஒரு பகுதியை வைக்க முடியாது. அதில் ஒரு தாது கனசதுரத்தைக் கொண்டிருக்க வேண்டும்.

# validation.moonsquad.INITIAL_INSTRUCTIONS_hexoffer
source: On the first move of the game, place a single piece and then the opponent will choose sides. Click an empty space to place the piece.
ta: விளையாட்டின் முதல் நகர்வில், ஒரு பகுதியை வைக்கவும், பின்னர் எதிர்ப்பாளர் பக்கங்களைத் தேர்ந்தெடுப்பார். துண்டு வைக்க வெற்று இடத்தைக் சொடுக்கு செய்க.

# validation.moonsquad.INITIAL_INSTRUCTIONS_offer
source: On the first move of the game, place two red pieces and one blue piece. Click an empty space to place the first red piece.
ta: விளையாட்டின் முதல் நகர்வில், இரண்டு சிவப்பு துண்டுகள் மற்றும் ஒரு நீல நிற துண்டு வைக்கவும். முதல் சிவப்பு துண்டு வைக்க வெற்று இடத்தைக் சொடுக்கு செய்க.

# validation.moonsquad.INITIAL_INSTRUCTIONS_pie
source: On the second move of the game, either click the "Swap player seats" button to play as red, or make a normal move as blue. If your opponent already switched seats, then your only choice is to make a normal move.
ta: விளையாட்டின் இரண்டாவது நகர்வில், சிவப்பு நிறமாக விளையாட "இடமாற்று பிளேயர் இருக்கைகள்" பொத்தானைக் சொடுக்கு செய்க அல்லது நீல நிறமாக ஒரு சாதாரண நகர்வை மேற்கொள்ளுங்கள். உங்கள் எதிர்ப்பாளர் ஏற்கனவே இருக்கைகளை மாற்றினால், உங்கள் ஒரே தேர்வு ஒரு சாதாரண நகர்வை மேற்கொள்வதுதான்.

# validation.moonsquad.INITIAL_INSTRUCTIONS_normal
source: Click an ore cube to place one of your pieces. Click one of your squads to start a capture. Or click a cube in your supply to move your squads.
ta: உங்கள் துண்டுகளில் ஒன்றை வைக்க ஒரு தாது கனசதுரத்தைக் சொடுக்கு செய்க. பிடிப்பைத் தொடங்க உங்கள் அணிகளில் ஒன்றைக் சொடுக்கு செய்க. அல்லது உங்கள் அணிகளை நகர்த்த உங்கள் விநியோகத்தில் ஒரு கனசதுரத்தைக் சொடுக்கு செய்க.

# validation.moonsquad.INVALID_ORE
source: The code {{ore}} is not a valid ore type.
ta: {{ore}} குறியீடு செல்லுபடியாகும் தாது வகை அல்ல.

# validation.moonsquad.MISSING_ORE
source: Could not find any {{ore}} ore in your supply.
ta: உங்கள் விநியோகத்தில் எந்த {{ore}} தாதையும் கண்டுபிடிக்க முடியவில்லை.

# validation.moonsquad.MISSING_SQUAD
source: Could not find a squad at {{where}}.
ta: {{where} at இல் ஒரு அணியைக் கண்டுபிடிக்க முடியவில்லை.

# validation.moonsquad.NO_CAPTURES
source: That squad has no valid captures available.
ta: அந்த அணியில் சரியான பிடிப்புகள் எதுவும் கிடைக்கவில்லை.

# validation.moonsquad.NO_MOVES
source: That squad has no valid places to move.
ta: அந்த அணியில் செல்ல சரியான இடங்கள் இல்லை.

# validation.moonsquad.PARTIAL_CAPTURE
source: Select the opposing piece to capture.
ta: கைப்பற்ற எதிரெதிர் துண்டைத் தேர்ந்தெடுக்கவும்.

# validation.moonsquad.PARTIAL_MOVE_first
source: Select a squad to move. You must move at least one squad.
ta: நகர்த்த ஒரு அணியைத் தேர்ந்தெடுக்கவும். நீங்கள் குறைந்தது ஒரு அணியையாவது நகர்த்த வேண்டும்.

# validation.moonsquad.PARTIAL_MOVE_second
source: Select a destination. The squad must stay in the same connected group.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும். அணி ஒரே இணைக்கப்பட்ட குழுவில் இருக்க வேண்டும்.

# validation.moonsquad.PARTIAL_PLACE1
source: On the first move of the game, place two red pieces and one blue piece. Click an empty space to place the second red piece.
ta: விளையாட்டின் முதல் நகர்வில், இரண்டு சிவப்பு துண்டுகள் மற்றும் ஒரு நீல நிற துண்டு வைக்கவும். இரண்டாவது சிவப்பு துண்டு வைக்க வெற்று இடத்தைக் சொடுக்கு செய்க.

# validation.moonsquad.PARTIAL_PLACE2
source: On the first move of the game, place two red pieces and one blue piece. Click an empty space to place the blue piece.
ta: விளையாட்டின் முதல் நகர்வில், இரண்டு சிவப்பு துண்டுகள் மற்றும் ஒரு நீல நிற துண்டு வைக்கவும். நீல நிறத்தை வைக்க வெற்று இடத்தைக் சொடுக்கு செய்க.

# validation.morphos.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.morphos.CAP_OR_PLACE
source: In double placement, you may either place two stones or capture a single stone. You can't do both.
ta: இரட்டை வேலைவாய்ப்பில், நீங்கள் இரண்டு கற்களை வைக்கலாம் அல்லது ஒரு கல்லைக் கைப்பற்றலாம். நீங்கள் இரண்டையும் செய்ய முடியாது.

# validation.morphos.INITIAL_INSTRUCTIONS_normal
source: Select an empty cell to place a piece, or select a weak enemy stone to capture it.
ta: ஒரு துண்டு வைக்க ஒரு வெற்று கலத்தைத் தேர்ந்தெடுக்கவும் அல்லது அதைப் பிடிக்க பலவீனமான எதிரி கல்லைத் தேர்ந்தெடுக்கவும்.

# validation.morphos.INITIAL_INSTRUCTIONS_replace
source: One of your pieces was captured. First select an empty space to replace the captured piece, then you will be able to make a normal move.
ta: உங்கள் துண்டுகளில் ஒன்று கைப்பற்றப்பட்டது. முதலில் கைப்பற்றப்பட்ட பகுதியை மாற்ற ஒரு வெற்று இடத்தைத் தேர்ந்தெடுக்கவும், பின்னர் நீங்கள் ஒரு சாதாரண நகர்வை மேற்கொள்ள முடியும்.

# validation.morphos.MUST_REPLACE
source: You must start your move by replacing the captured stone on an empty space.
ta: கைப்பற்றப்பட்ட கல்லை வெற்று இடத்தில் மாற்றுவதன் மூலம் உங்கள் நகர்வைத் தொடங்க வேண்டும்.

# validation.morphos.NOT_ORTHOGONAL
source: When placing two stones, the second must be orthogonally adjacent to the first.
ta: இரண்டு கற்களை வைக்கும்போது, இரண்டாவது முதல் ஆர்த்தோகனலாக இருக்க வேண்டும்.

# validation.morphos.NOT_WEAK
source: The stone at {{cell}} is not weak.
ta: {{cell} at இல் உள்ள கல் பலவீனமாக இல்லை.

# validation.morphos.ONE_CAP
source: You may only capture one stone per turn.
ta: நீங்கள் ஒரு திருப்பத்திற்கு ஒரு கல்லை மட்டுமே கைப்பற்றலாம்.

# validation.morphos.PARTIAL_DOUBLE_orig
source: You may place a second stone.
ta: நீங்கள் இரண்டாவது கல் வைக்கலாம்.

# validation.morphos.PARTIAL_DOUBLE_new
source: You must place a second stone orthogonally adjacent to the first one, if possible.
ta: முடிந்தால், நீங்கள் முதல் கல்லை ஆர்த்தோகனலி முறையில் வைக்க வேண்டும்.

# validation.morphos.TOO_MANY
source: You've tried to make too many moves at once.
ta: நீங்கள் ஒரே நேரத்தில் பல நகர்வுகளைச் செய்ய முயற்சித்தீர்கள்.

# validation.murus.BAD_CAP
source: Adjacent pieces may only be captured by towers, and only walls and catapults can be captured in this way.
ta: அருகிலுள்ள துண்டுகள் கோபுரங்களால் மட்டுமே கைப்பற்றப்படலாம், மேலும் சுவர்கள் மற்றும் கவண் மட்டுமே இந்த வழியில் கைப்பற்றப்படலாம்.

# validation.murus.BAD_CATA_DIR
source: Catapults may only fire laterally or towards the opposing home row.
ta: கவண் பக்கவாட்டில் அல்லது எதிரெதிர் வீட்டு வரிசையை நோக்கி மட்டுமே சுடக்கூடும்.

# validation.murus.BAD_CATA_DIST
source: Catapults must fire into a space exactly two or three spaces away.
ta: கேடபால்ட்ச் சரியாக இரண்டு அல்லது மூன்று இடங்கள் தொலைவில் ஒரு இடத்தில் சுட வேண்டும்.

# validation.murus.BAD_CATA_MOVE
source: Catapults must fire into an empty space or an enemy-controlled space.
ta: கவண் ஒரு வெற்று இடத்திற்கு அல்லது எதிரி கட்டுப்பாட்டு இடத்திற்குள் சுட வேண்டும்.

# validation.murus.BAD_DBL_CAP
source: Only towers may double capture, and they may only double capture adjacent catapults.
ta: கோபுரங்கள் மட்டுமே இரட்டிப்பாக்கக்கூடும், மேலும் அவை அருகிலுள்ள கவண் மட்டுமே இரட்டிப்பாக்கக்கூடும்.

# validation.murus.BAD_TOWER_CAP
source: Towers may only capture adjacent pieces.
ta: கோபுரங்கள் அருகிலுள்ள துண்டுகளை மட்டுமே கைப்பற்றக்கூடும்.

# validation.murus.DIFF_REDIST
source: You must redistribute the tower to two different cells.
ta: நீங்கள் கோபுரத்தை இரண்டு வெவ்வேறு கலங்களுக்கு மறுபகிர்வு செய்ய வேண்டும்.

# validation.murus.INELIGIBLE
source: For a tower to move, each space must either be empty or be occupied by a friendly stack that can receive another piece.
ta: ஒரு கோபுரம் செல்ல, ஒவ்வொரு இடமும் காலியாக இருக்க வேண்டும் அல்லது மற்றொரு பகுதியைப் பெறக்கூடிய நட்பு அடுக்கால் ஆக்கிரமிக்கப்பட வேண்டும்.

# validation.murus.INITIAL_INSTRUCTIONS
source: Select one of your own pieces to move.
ta: நகர்த்த உங்கள் சொந்த துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.murus.INITIAL_INSTRUCTIONS_redist
source: Select one of your own towers to redistribute.
ta: மறுபகிர்வு செய்ய உங்கள் சொந்த கோபுரங்களில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.murus.NOROOM
source: Movement requires at least two eligible spaces in a row.
ta: இயக்கத்திற்கு ஒரு வரிசையில் குறைந்தது இரண்டு தகுதியான இடங்கள் தேவை.

# validation.murus.PARTIAL
source: Select the space to move to or capture.
ta: செல்ல அல்லது கைப்பற்ற இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.murus.PARTIAL_REDIST
source: Select an empty space on your second row.
ta: உங்கள் இரண்டாவது வரிசையில் வெற்று இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.murus.REDIST_ROW
source: You may only redistribute onto your second row.
ta: உங்கள் இரண்டாவது வரிசையில் மட்டுமே நீங்கள் மறுபகிர்வு செய்ய முடியும்.

# validation.murus.SACRIFICE_POSSIBLE
source: The move is valid, but if you wish to fully sacrifice the tower, click the target again.
ta: நடவடிக்கை செல்லுபடியாகும், ஆனால் நீங்கள் கோபுரத்தை முழுமையாக கொடை செய்ய விரும்பினால், இலக்கை மீண்டும் சொடுக்கு செய்க.

# validation.murus.STRAIGHTLINE
source: Pieces may only move in straight lines.
ta: துண்டுகள் நேர் கோடுகளில் மட்டுமே நகரக்கூடும்.

# validation.murus.TOOFAR
source: Towers may only move two spaces.
ta: கோபுரங்கள் இரண்டு இடங்களை மட்டுமே நகர்த்தக்கூடும்.

# validation.murus.WALLS_IMMOBILE
source: Walls may not move or capture.
ta: சுவர்கள் நகரவோ கைப்பற்றவோ கூடாது.

# validation.mvolcano.INITIAL_INSTRUCTIONS
source: Select a cap to move.
ta: நகர்த்த ஒரு தொப்பியைத் தேர்ந்தெடுக்கவும்.

# validation.nakatta.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.nakatta.BAD_PLACE
source: You may not create hard corners or naked attachments (see the rules for details).
ta: நீங்கள் கடினமான மூலைகள் அல்லது நிர்வாண இணைப்புகளை உருவாக்கக்கூடாது (விவரங்களுக்கான விதிகளைப் பார்க்கவும்).

# validation.nakatta.INITIAL_INSTRUCTIONS
source: Select a point to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும்.

# validation.necklace.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.necklace.BLOCKS_PATH
source: Placement at {{where}} blocks the only path of some free spaces to the edge.
ta: {{}}}}}} சில இலவச இடங்களின் ஒரே பாதையை விளிம்பிற்கு தடுக்கிறது.

# validation.necklace.INITIAL_INSTRUCTIONS
source: Select a point to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும்.

# validation.necklace.NO_CROSSINGS
source: Placement at {{where}} will create a crosscut.
ta: {{where} at இல் வேலை வாய்ப்பு ஒரு குறுக்குவழியை உருவாக்கும்.

# validation.nex.EDGE_CASE_ONE_EMPTY_NEUTRAL
source: There is only one empty cell so you may not make a placement. You should make swap moves instead.
ta: ஒரே ஒரு வெற்று செல் மட்டுமே உள்ளது, எனவே நீங்கள் ஒரு வேலைவாய்ப்பு செய்யக்கூடாது. அதற்கு பதிலாக இடமாற்று நகர்வுகளை நீங்கள் செய்ய வேண்டும்.
