Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# variants.conect.narrow.name
source: Narrow cone
ta: குறுகிய கூம்பு

# variants.conect.size-13.name
source: Size-13 board
ta: அளவு -13 போர்டு

# variants.conect.size-15.name
source: Size-15 board
ta: அளவு -15 போர்டு

# variants.conhex.#board.name
source: Default board: 11x11
ta: இயல்புநிலை பலகை: 11x11

# variants.conhex.size-15.name
source: Larger board: 15x15
ta: பெரிய பலகை: 15x15

# variants.connect6.#board.name
source: Default 19x19 board
ta: இயல்புநிலை 19x19 போர்டு

# variants.connect6.#opening.description
source: The first stone has to be at the centre.
ta: முதல் கல் மையத்தில் இருக்க வேண்டும்.

# variants.connect6.#opening.name
source: Centre opening
ta: மைய திறப்பு

# variants.connect6.#ruleset.description
source: Free placement of both stones.
ta: இரண்டு கற்களின் இலவச இடம்.

# variants.connect6.#ruleset.name
source: Default ruleset
ta: இயல்புநிலை விதிகள்

# variants.connect6.#tiebreaker.name
source: No tiebreak
ta: டைபிரேக் இல்லை

# variants.connect6.collinear6.description
source: The first stone placed has to be collinear with a stone placed in the last turn, and the second stone has to be collinear with the first stone.
ta: வைக்கப்பட்ட முதல் கல் கடைசி திருப்பத்தில் வைக்கப்பட்ட ஒரு கல்லுடன் கோலைனியர் இருக்க வேண்டும், இரண்டாவது கல் முதல் கல்லுடன் கோலைனியர் இருக்க வேண்டும்.

# variants.connect6.collinear6.name
source: Collinear Connect6
ta: Colinear Connect6

# variants.connect6.noncollinear5.description
source: The two stones placed must not be collinear with each other. The win condition is to get at least a five-in-a-row.
ta: வைக்கப்பட்டுள்ள இரண்டு கற்களும் ஒருவருக்கொருவர் கோலினியர் ஆக இருக்கக்கூடாது. செய் நிலை குறைந்தது ஐந்து-ஒரு வரிசையைப் பெறுவதாகும்.

# variants.connect6.noncollinear5.name
source: Non-Collinear Connect5
ta: அல்லாத கோலினியர் இணைப்பு 5

# variants.connect6.pass.description
source: After the opening phase, a player may pass instead of make a move to win the tiebreaker. If the board is filled without a winner, the player who passed wins. If no player passed, then the second player wins.
ta: தொடக்க கட்டத்திற்குப் பிறகு, ஒரு வீரர் டைபிரேக்கரை வெல்ல ஒரு நடவடிக்கைக்குப் பதிலாகக் கடந்து செல்லலாம். ஒரு வெற்றியாளர் இல்லாமல் போர்டு நிரப்பப்பட்டால், தேர்ச்சி பெற்ற வீரர் செய் பெறுகிறார். எந்த வீரரும் கடந்து செல்லவில்லை என்றால், பிறகு இரண்டாவது வீரர் வெற்றி பெறுவார்.

# variants.connect6.pass.name
source: Pass tiebreak
ta: பாச் டைபிரேக்

# variants.connect6.swap-3rd.description
source: The first player places one stone of their colour in the centre, then the second places two stones of their colour in the centre 5x5, and finally the first player places two stones of their colour anywhere on the board. The second player has the option to swap colours.
ta: முதல் வீரர் அவர்களின் நிறத்தின் ஒரு கல்லை மையத்தில் வைக்கிறார், பின்னர் இரண்டாவது அவர்களின் நிறத்தின் இரண்டு கற்களை 5x5 மையத்தில் வைக்கிறது, இறுதியாக முதல் வீரர் அவற்றின் வண்ணத்தின் இரண்டு கற்களை எங்கும் பலகையில் வைக்கிறார். இரண்டாவது பிளேயருக்கு வண்ணங்களை மாற்ற விருப்பம் உள்ளது.

# variants.connect6.swap-3rd.name
source: Swap-3rd opening
ta: இடமாற்று -3 வது திறப்பு

# variants.connect6.toroidal-15.name
source: Toroidal 15x15 board
ta: டொராய்டல் 15x15 போர்டு

# variants.connecticut.#board.name
source: Default 19x19 board
ta: இயல்புநிலை 19x19 போர்டு

# variants.connecticut.size-15.name
source: 15x15 board
ta: 15x15 போர்டு

# variants.connections.#board.name
source: Size-9 board
ta: அளவு -9 போர்டு

# variants.connections.size-5.name
source: Size-5 board
ta: அளவு -5 போர்டு

# variants.conspirateurs.#movement.description
source: Pieces may pass through sanctuary spaces as they jump.
ta: சரணாலய இடங்கள் குதிக்கும் போது துண்டுகள் கடந்து செல்லக்கூடும்.

# variants.conspirateurs.#setup.description
source: Players first drop all their pieces.
ta: வீரர்கள் முதலில் தங்கள் அனைத்து பகுதிகளையும் கைவிடுகிறார்கள்.

# variants.conspirateurs.quick.name
source: Quick start
ta: விரைவான தொடக்க

# variants.conspirateurs.quick.description
source: Randomly places the initial pieces.
ta: தோராயமாக ஆரம்ப துண்டுகளை வைக்கிறது.

# variants.conspirateurs.strict.name
source: Strict movement
ta: கடுமையான இயக்கம்

# variants.conspirateurs.strict.description
source: A piece must end its movement the moment it enters a sanctuary space.
ta: ஒரு சரணாலய இடத்திற்குள் நுழையும் தருணத்தில் ஒரு துண்டு அதன் இயக்கத்தை முடிக்க வேண்டும்.

# variants.control.#board.name
source: Size 7 board
ta: அளவு 7 போர்டு

# variants.control.#board.description
source: Ideal for experienced players
ta: பட்டறிவு வாய்ந்த வீரர்களுக்கு ஏற்றது

# variants.control.size-5.name
source: Small board (Size 5)
ta: சிறிய பலகை (அளவு 5)

# variants.control.size-5.description
source: Ideal for learning the rules
ta: விதிகளைக் கற்றுக்கொள்வதற்கு ஏற்றது

# variants.control.size-9.name
source: Large board (Size 9)
ta: பெரிய பலகை (அளவு 9)

# variants.courtesan.#board.name
source: Default 8x8 board
ta: இயல்புநிலை 8x8 போர்டு

# variants.courtesan.size-6.name
source: Shorter game (6x6 board)
ta: குறுகிய விளையாட்டு (6x6 போர்டு)

# variants.crossway.#board.name
source: Default board (19x19)
ta: இயல்புநிலை பலகை (19x19)

# variants.crossway.size-25.name
source: Board (25x25)
ta: பலகை (25x25)

# variants.cubeo.#moves.name
source: Default movement rules
ta: இயல்புநிலை இயக்கம் விதிகள்

# variants.cubeo.#moves.description
source: A valid move is any one where the moving piece ends in a different position than where it started.
ta: செல்லுபடியாகும் நடவடிக்கை என்பது நகரும் துண்டு தொடங்கிய இடத்தை விட வேறு நிலையில் முடிவடையும்.

# variants.cubeo.strict.name
source: Stricter movement constraints
ta: கடுமையான இயக்கம் கட்டுப்பாடுகள்

# variants.cubeo.strict.description
source: A valid move must materially change the formation, meaning the final formation can't just be a rotation/reflection of the starting formation.
ta: செல்லுபடியாகும் நடவடிக்கை உருவாக்கத்தை பொருள் ரீதியாக மாற்ற வேண்டும், அதாவது இறுதி உருவாக்கம் தொடக்க உருவாக்கத்தின் சுழற்சி/பிரதிபலிப்பாக இருக்க முடியாது.

# variants.cubeo.#dice.name
source: Default die size (d6)
ta: இயல்புநிலை டை அளவு (டி 6)

# variants.cubeo.#dice.description
source: Each player has six d6, and the merge goal is 7.
ta: ஒவ்வொரு வீரருக்கும் ஆறு டி 6 உள்ளது, மற்றும் ஒன்றிணைப்பு இலக்கு 7 ஆகும்.

# variants.cubeo.d8.name
source: d8
ta: டி 8

# variants.cubeo.d8.description
source: Each player has eight 8-sided, yet cubical, dice, and the merge goal is 9.
ta: ஒவ்வொரு வீரருக்கும் எட்டு 8 பக்கங்கள், இன்னும் க்யூபிகல், பகடை, மற்றும் ஒன்றிணைப்பு இலக்கு 9 ஆகும்.

# variants.cubeo.d10.name
source: d10
ta: டி 10

# variants.cubeo.d10.description
source: Each player has ten 10-sided, yet cubical, dice, and the merge goal is 11.
ta: ஒவ்வொரு வீரருக்கும் பத்து 10 பக்கங்கள் உள்ளன, இன்னும் க்யூபிகல், பகடை, மற்றும் ஒன்றிணைப்பு இலக்கு 11 ஆகும்.

# variants.cubeo.d12.name
source: d12
ta: டி 12

# variants.cubeo.d12.description
source: Each player has twelve 12-sided, yet cubical, dice, and the merge goal is 13.
ta: ஒவ்வொரு வீரருக்கும் பன்னிரண்டு 12 பக்கங்கள் உள்ளன, இன்னும் க்யூபிகல், பகடை, மற்றும் ஒன்றிணைப்பு இலக்கு 13 ஆகும்.

# variants.dagnacht.#board.name
source: Default 15x15 board
ta: இயல்புநிலை 15x15 போர்டு

# variants.dagnacht.11x11.name
source: 11x11 board
ta: 11x11 போர்டு

# variants.dagnacht.13x13.name
source: 13x13 board
ta: 13x13 போர்டு

# variants.dagnacht.17x17.name
source: 17x17 board
ta: 17x17 போர்டு

# variants.dagnacht.19x19.name
source: 19x19 board
ta: 19x19 வாரியம்

# variants.dameo.#board.name
source: Default 8x8 board
ta: இயல்புநிலை 8x8 போர்டு

# variants.dameo.anti.description
source: The first player to run out of moves wins.
ta: நகர்வுகளை விட்டு வெளியேறும் முதல் வீரர் செய் பெறுகிறார்.

# variants.dameo.anti.name
source: Anti-Dameo
ta: ஆன்டி-டேமியோ

# variants.dameo.size-10.name
source: 10x10 board (experimental)
ta: 10x10 போர்டு (சோதனை)

# variants.diffusion.topBottom.description
source: Players own the rows closest to them (as in most mancala games)rather than the left half of the board.
ta: வாரியத்தின் இடது பாதியைக் காட்டிலும் வீரர்கள் தங்களுக்கு மிக நெருக்கமான வரிசைகளை (பெரும்பாலான மங்கலா விளையாட்டுகளைப் போல) வைத்திருக்கிறார்கள்.

# variants.diffusion.topBottom.name
source: Above/Below
ta: மேலே/கீழே

# variants.dipole.international.name
source: Larger board: 10x10
ta: பெரிய பலகை: 10x10

# variants.dragoneyes.#rules.description
source: Draws are triggered automatically.
ta: டிராக்கள் தானாகவே தூண்டப்படுகின்றன.

# variants.dragoneyes.claimdraw.description
source: You must choose to claim a draw on your turn.
ta: உங்கள் திருப்பத்தில் ஒரு சமநிலையை கோர நீங்கள் தேர்வு செய்ய வேண்டும்.

# variants.dragoneyes.claimdraw.name
source: Claim Draws
ta: உரிமைகோரல் டிராக்கள்

# variants.emu.#length.name
source: 4 years
ta: 4 ஆண்டுகள்

# variants.emu.years-2.name
source: 2 years
ta: 2 ஆண்டுகள்

# variants.emu.years-6.name
source: 6 years
ta: 6 ஆண்டுகள்

# variants.emu.#deck.name
source: Excuse + Pawns (default)
ta: தவிர்க்கவும் + சிப்பாய்கள் (இயல்புநிலை)

# variants.emu.courts.name
source: Excuse + Courts
ta: சாக்கு + நீதிமன்றங்கள்

# variants.emu.courts.description
source: Same as the default but with Courts instead of Pawns. Same game feel but with different suit combinations.
ta: இயல்புநிலையைப் போலவே ஆனால் சிப்பாய்களுக்கு பதிலாக நீதிமன்றங்களுடன். ஒரே விளையாட்டு உணர்கிறது ஆனால் வெவ்வேறு சூட் சேர்க்கைகளுடன்.

# variants.emu.both.name
source: Full extended
ta: முழு நீட்டிக்கப்பட்ட

# variants.emu.both.description
source: Includes the Excuse, the Pawns, *and* the Courts. Results in a much more forgiving, higher-scoring game.
ta: சாக்கு, சிப்பாய்கள், * மற்றும் * நீதிமன்றங்கள் அடங்கும். மிகவும் மன்னிக்கும், அதிக மதிப்பெண் பெறும் விளையாட்டில் விளைகிறது.

# variants.emu.none.name
source: Basic deck only
ta: அடிப்படை தளம் மட்டுமே

# variants.emu.none.description
source: No extended deck cards. Results in a much less forgiving, lower-scoring game.
ta: நீட்டிக்கப்பட்ட டெக் கார்டுகள் இல்லை. மிகவும் குறைவான மன்னிக்கும், குறைந்த மதிப்பெண் விளையாட்டில் விளைகிறது.

# variants.entrapment.#board.name
source: Default board (6x7)
ta: இயல்புநிலை பலகை (6x7)

# variants.entrapment.size-7x7.name
source: Board (7x7)
ta: பலகை (7x7)

# variants.epam.stones.description
source: In this variant, the players place three impassable stones in the middle of the board.
ta: இந்த மாறுபாட்டில், வீரர்கள் வாரியத்தின் நடுவில் மூன்று அசைக்க முடியாத கற்களை வைக்கின்றனர்.

# variants.epam.stones.name
source: Stumbling Blocks
ta: தடுமாறும்

# variants.exxit.#length.name
source: Default game length (39 tiles)
ta: இயல்புநிலை விளையாட்டு நீளம் (39 ஓடுகள்)

# variants.exxit.#setup.description
source: Starts with a "cross" of two tiles of each colour.
ta: ஒவ்வொரு வண்ணத்தின் இரண்டு ஓடுகளின் "குறுக்கு" மூலம் தொடங்குகிறது.

# variants.exxit.19tiles.description
source: Ideal for learning the rules
ta: விதிகளைக் கற்றுக்கொள்வதற்கு ஏற்றது

# variants.exxit.19tiles.name
source: Blitz game (19 tiles)
ta: பிளிட்ச் விளையாட்டு (19 ஓடுகள்)

# variants.exxit.29tiles.description
source: If you just want a shorter game
ta: நீங்கள் ஒரு குறுகிய விளையாட்டை விரும்பினால்

# variants.exxit.29tiles.name
source: Shorter game (29 tiles)
ta: குறுகிய விளையாட்டு (29 ஓடுகள்)

# variants.exxit.exNihilo.description
source: Starts with an empty field, and the first three turns are placing tiles
ta: வெற்று புலத்துடன் தொடங்குகிறது, முதல் மூன்று திருப்பங்கள் ஓடுகளை வைக்கின்றன

# variants.exxit.exNihilo.name
source: Ex Nihilo
ta: ஒன்றுமில்லாமல்

# variants.fabrik.arbeiter.description
source: Each player controls one worker and cannot move the other. The victory condition is commensurately reduced to three pieces in a row instead of four.
ta: ஒவ்வொரு வீரரும் ஒரு தொழிலாளியைக் கட்டுப்படுத்துகிறார்கள், மற்றொன்றை நகர்த்த முடியாது. செய் நிலை நான்குக்கு பதிலாக ஒரு வரிசையில் மூன்று துண்டுகளாகக் குறைக்கப்படுகிறது.

# variants.fabrik.arbeiter.name
source: Arbeiter
ta: தொழிலாளி

# variants.flume.7x7.name
source: Smaller board: 7x7
ta: சிறிய பலகை: 7x7

# variants.flume.11x11.name
source: Larger board: 11x11
ta: பெரிய பலகை: 11x11

# variants.four.simplified.description
source: You only play with three pieces of each colour, and the grid is constrained to 7x7 instead of 9x9.
ta: நீங்கள் ஒவ்வொரு வண்ணத்தின் மூன்று துண்டுகளுடன் மட்டுமே விளையாடுகிறீர்கள், மேலும் கட்டம் 9x9 க்கு பதிலாக 7x7 ஆக கட்டுப்படுத்தப்படுகிறது.

# variants.four.simplified.name
source: Learning game
ta: கற்றல் விளையாட்டு

# variants.fourinarow.#board.name
source: Default 8x8 board
ta: இயல்புநிலை 8x8 போர்டு

# variants.fourinarow.#clear.name
source: No clear
ta: தெளிவாக இல்லை

# variants.fourinarow.#placement.description
source: Pieces must always be placed such that they're supported by at least one piece from below.
ta: துண்டுகள் எப்போதுமே வைக்கப்பட வேண்டும், அவை கீழே இருந்து குறைந்தது ஒரு துண்டு மூலம் ஆதரிக்கப்படுகின்றன.

# variants.fourinarow.#placement.name
source: Gravity downwards
ta: ஈர்ப்பு கீழ்நோக்கி

# variants.fourinarow.clear.description
source: If a row at the edge is entirely filled with pieces, it is cleared, and all pieces shift in that direction. A four-in-a-row takes priority over a shift. When used with the 4-directional variants, the board will shift in any directions where there are full rows. Note that this can result in board configurations that are not normally feasible, but it is a predictable behaviour.
ta: விளிம்பில் ஒரு வரிசை முற்றிலும் துண்டுகளால் நிரப்பப்பட்டிருந்தால், அது அழிக்கப்படுகிறது, மேலும் அனைத்து துண்டுகளும் அந்த திசையில் மாறுகின்றன. நான்கு-இன்-ரோ-ஒரு மாற்றத்தை விட முன்னுரிமை பெறுகிறது. 4-திசை மாறுபாடுகளுடன் பயன்படுத்தும்போது, முழு வரிசைகள் இருக்கும் எந்த திசைகளிலும் வாரியம் மாறும். இது பொதுவாக சாத்தியமில்லாத பலகை உள்ளமைவுகளுக்கு வழிவகுக்கும் என்பதை நினைவில் கொள்க, ஆனால் இது ஒரு கணிக்கக்கூடிய நடத்தை.

# variants.fourinarow.clear.name
source: Clear
ta: தெளிவான

# variants.fourinarow.edge-drop-4.description
source: Pieces "drop" from the edges: you may place on a free space right before the first filled space from any edge. Edges cannot be blocked, so the pieces are actually dropped from the first free space from the edge.
ta: விளிம்புகளிலிருந்து "துளி" துண்டுகள்: எந்த விளிம்பிலிருந்தும் முதல் நிரப்பப்பட்ட இடத்திற்கு முன்பே நீங்கள் ஒரு இலவச இடத்தில் வைக்கலாம். விளிம்புகளைத் தடுக்க முடியாது, எனவே துண்டுகள் உண்மையில் விளிம்பிலிருந்து முதல் இலவச இடத்திலிருந்து கைவிடப்படுகின்றன.

# variants.fourinarow.edge-drop-4.name
source: Edge-drop-4
ta: எட்ச்-டிராப் -4

# variants.fourinarow.edge-grow-4.description
source: Pieces "grow" from the edges: you may place on any first free space from any edge.
ta: விளிம்புகளிலிருந்து "வளர" துண்டுகள்: எந்த விளிம்பிலிருந்தும் முதல் இலவச இடத்திலும் நீங்கள் வைக்கலாம்.

# variants.fourinarow.edge-grow-4.name
source: Edge-grow-4
ta: எட்ச்-க்ரோ -4

# variants.fourinarow.interior-gravity-4.description
source: Pieces appear from any free space on the board, then slide to the free space right before the first filled space in the direction of the closest edge. On the diagonal where it is equidistant to two edges, the piece will slide to the closest corner.
ta: பலகையில் உள்ள எந்த இலவச இடத்திலிருந்தும் துண்டுகள் தோன்றும், பின்னர் முதல் நிரப்பப்பட்ட இடத்திற்கு முன்பே இலவச இடத்திற்கு சறுக்கி விடுங்கள். இரண்டு விளிம்புகளுக்கு சமமானதாக இருக்கும் மூலைவிட்டத்தில், துண்டு மிக நெருக்கமான மூலையில் சறுக்கப்படும்.

# variants.fourinarow.interior-gravity-4.name
source: Interior-gravity-4
ta: உள்துறை-ஈர்ப்பு -4

# variants.fourinarow.standard-10.name
source: 10x10 board
ta: 10x10 போர்டு

# variants.fourinarow.swap-2.description
source: The first player places three pieces. The next player may do one of (1) place a single pieces to continue as player 2, (2) swap colours to play as player 1, or (3) place two more pieces and allow the opponent to decide to play as player 1 or player 2.
ta: முதல் வீரர் மூன்று துண்டுகளை வைக்கிறார். அடுத்த வீரர் (1) பிளேயர் 2 ஆக தொடர ஒரு துண்டுகளை வைக்கலாம், (2) பிளேயர் 1 ஆக விளையாட வண்ணங்களை மாற்றவும், அல்லது (3) மேலும் இரண்டு துண்டுகளை வைக்கவும், எதிரியை பிளேயர் 1 அல்லது பிளேயர் 2 ஆக விளையாட முடிவு செய்ய அனுமதிக்கலாம்.

# variants.fourinarow.swap-2.name
source: Swap-2 opening
ta: இடமாற்று -2 திறப்பு

# variants.fourinarow.swap-5.description
source: For the first five pieces on the board, after placement, the next player has the option to swap colours.
ta: போர்டில் முதல் ஐந்து துண்டுகளுக்கு, வேலைவாய்ப்புக்குப் பிறகு, அடுத்த வீரருக்கு வண்ணங்களை மாற்ற விருப்பம் உள்ளது.

# variants.fourinarow.swap-5.name
source: Swap-5 opening
ta: இடமாற்று -5 திறப்பு

# variants.gliss.#board.name
source: 16x16 board
ta: 16x16 போர்டு

# variants.gliss.size-12.name
source: 12x12 board
ta: 12x12 போர்டு

# variants.gliss.size-19.name
source: 19x19 board
ta: 19x19 வாரியம்

# variants.gomoku.#board.name
source: Default 15x15 board
ta: இயல்புநிலை 15x15 போர்டு

# variants.gomoku.#opening.description
source: The first player has to place their first stone in the centre of the board, and their second stone at least three intersections away from the centre.
ta: முதல் வீரர் தங்கள் முதல் கல்லை பலகையின் மையத்தில் வைக்க வேண்டும், மேலும் அவர்களின் இரண்டாவது கல் மையத்திலிருந்து குறைந்தது மூன்று குறுக்குவெட்டுகள் தொலைவில் வைக்க வேண்டும்.

# variants.gomoku.#opening.name
source: Pro opening
ta: சார்பு திறப்பு

# variants.gomoku.#tiebreaker.name
source: No tiebreak
ta: டைபிரேக் இல்லை

# variants.gomoku.long-pro.description
source: The first player has to place their first stone in the centre of the board, and their second stone at least four intersections away from the centre.
ta: முதல் வீரர் தங்கள் முதல் கல்லை பலகையின் மையத்தில் வைக்க வேண்டும், மேலும் அவர்களின் இரண்டாவது கல் மையத்திலிருந்து குறைந்தது நான்கு குறுக்குவெட்டுகள் தொலைவில் வைக்க வேண்டும்.

# variants.gomoku.long-pro.name
source: Long pro opening
ta: நீண்ட சார்பு திறப்பு

# variants.gomoku.pass.description
source: After the opening phase, a player may pass instead of make a move to win the tiebreaker. If the board is filled without a winner, the player who passed wins. If no player passed, second player wins.
ta: தொடக்க கட்டத்திற்குப் பிறகு, ஒரு வீரர் டைபிரேக்கரை வெல்ல ஒரு நடவடிக்கைக்குப் பதிலாகக் கடந்து செல்லலாம். ஒரு வெற்றியாளர் இல்லாமல் போர்டு நிரப்பப்பட்டால், தேர்ச்சி பெற்ற வீரர் செய் பெறுகிறார். எந்த வீரரும் கடந்து செல்லவில்லை என்றால், இரண்டாவது வீரர் வெற்றி பெறுவார்.

# variants.gomoku.pass.name
source: Pass tiebreak
ta: பாச் டைபிரேக்

# variants.gomoku.standard-19.name
source: Standard 19x19 board
ta: நிலையான 19x19 வாரியம்

# variants.gomoku.swap-1st.description
source: The first player places a stone anywhere on the board. The next player has the option to swap colours.
ta: முதல் வீரர் போர்டில் எங்கும் ஒரு கல்லை வைக்கிறார். அடுத்த பிளேயருக்கு வண்ணங்களை மாற்ற விருப்பம் உள்ளது.

# variants.gomoku.swap-1st.name
source: Swap-1st opening
ta: இடமாற்று -1 வது திறப்பு

# variants.gomoku.swap-2.description
source: The first player places three stones. The next player may do one of (1) place a single stone to continue as player 2, (2) swap colours to play as player 1, or (3) place two more stones and allow the opponent to decide to play as player 1 or player 2.
ta: முதல் வீரர் மூன்று கற்களை வைக்கிறார். அடுத்த வீரர் (1) பிளேயர் 2 ஆக தொடர ஒரு கல்லை வைக்கலாம், (2) பிளேயர் 1 ஆக விளையாட வண்ணங்களை மாற்றவும், அல்லது (3) மேலும் இரண்டு கற்களை வைத்து, எதிரியை பிளேயர் 1 அல்லது பிளேயர் 2 ஆக விளையாட முடிவு செய்ய அனுமதிக்கலாம்.

# variants.gomoku.swap-2.name
source: Swap-2 opening
ta: இடமாற்று -2 திறப்பு

# variants.gomoku.swap-5.description
source: For the first five stones on the board, after placement, the next player has the option to swap colours.
ta: போர்டில் முதல் ஐந்து கற்களுக்கு, வேலைவாய்ப்புக்குப் பிறகு, அடுத்த வீரருக்கு வண்ணங்களை மாற்ற விருப்பம் உள்ளது.

# variants.gomoku.swap-5.name
source: Swap-5 opening
ta: இடமாற்று -5 திறப்பு

# variants.gonnect.#board.name
source: Default 13x13 board
ta: இயல்புநிலை 13x13 போர்டு

# variants.gonnect.size-9.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.gonnect.size-19.name
source: 19x19 board
ta: 19x19 வாரியம்

# variants.gyve.#board.name
source: Hexhex 8 board (169 spaces)
ta: எக்ச்எக்ச் 8 போர்டு (169 இடங்கள்)

# variants.gyve.size-6.name
source: Hexhex 6 (91 spaces)
ta: எக்செக்ச் 6 (91 இடங்கள்)

# variants.gyve.size-7.name
source: Hexhex 7 (127 spaces)
ta: எக்செக்ச் 7 (127 இடைவெளிகள்)

# variants.gyve.size-10.name
source: Hexhex 10 (271 spaces)
ta: எக்செக்ச் 10 (271 இடைவெளிகள்)

# variants.gyve.size-12.name
source: Hexhex 12 (397 spaces)
ta: ஃச் ஃச் 12397 இடைவெளிகள்)

# variants.havannah.#board.name
source: Size-8 board
ta: அளவு -8 போர்டு

# variants.havannah.size-4.name
source: Size-4 board
ta: அளவு-4 பலகை

# variants.havannah.size-6.name
source: Size-6 board
ta: அளவு-6 பலகை

# variants.havannah.size-10.name
source: Size-10 board
ta: அளவு-10 பலகை

# variants.hens.size-10.name
source: 10x10 board (experimental)
ta: 10x10 போர்டு (சோதனை)

# variants.hex.#board.name
source: Size-13 board
ta: அளவு -13 போர்டு

# variants.hex.size-11.name
source: Size-11 board
ta: அளவு-11 பலகை

# variants.hex.size-14.name
source: Size-14 board
ta: அளவு -14 போர்டு

# variants.hex.size-15.name
source: Size-15 board
ta: அளவு-15 பலகை

# variants.hex.size-19.name
source: Size-19 board
ta: அளவு-19 பலகை

# variants.hexentafl.#board.name
source: Size-4 board
ta: அளவு -4 போர்டு

# variants.hexentafl.#board.description
source: Smaller board where the king may only move one step at a time.
ta: மன்னன் ஒரு நேரத்தில் ஒரு படி மட்டுமே செல்லக்கூடிய சிறிய பலகை.

# variants.hexentafl.size-5.description
source: Larger board where the king may move like any other piece.
ta: மன்னன் வேறு எந்த பகுதியையும் போல நகரக்கூடிய பெரிய பலகை.

# variants.hexentafl.size-5.name
source: Size-5 board
ta: அளவு -5 போர்டு

# variants.hexy.#board.name
source: Hexhex 7 (127 spaces)
ta: எக்செக்ச் 7 (127 இடைவெளிகள்)

# variants.hexy.11.name
source: Hexhex 11 (331 total cells)
ta: எக்செக்ச் 11 (331 மொத்த செல்கள்)

# variants.hexy.08.name
source: Hexhex 8 (169 total cells)
ta: எக்ச்எக்ச் 8 (மொத்தம் 169 செல்கள்)

# variants.hexy.09.name
source: Hexhex 9 (217 total cells)
ta: எக்செக்ச் 9 (217 மொத்த செல்கள்)

# variants.hula.#board.name
source: Size 6 board
ta: அளவு 6 போர்டு

# variants.hula.size-5.name
source: Size 5 board
ta: அளவு 5 போர்டு

# variants.hula.size-7.name
source: Size 7 board
ta: அளவு 7 போர்டு

# variants.irensei.#board.name
source: 19x19 board
ta: 19x19 வாரியம்

# variants.irensei.#tiebreaker.name
source: No tiebreak
ta: டைபிரேக் இல்லை

# variants.irensei.pass.description
source: After the opening phase, a player may pass instead of make a move to win the tiebreaker. If the board is filled without a winner, the player who passed wins. If no player passed, then the second player wins.
ta: தொடக்க கட்டத்திற்குப் பிறகு, ஒரு வீரர் டைபிரேக்கரை வெல்ல ஒரு நடவடிக்கைக்குப் பதிலாகக் கடந்து செல்லலாம். ஒரு வெற்றியாளர் இல்லாமல் போர்டு நிரப்பப்பட்டால், தேர்ச்சி பெற்ற வீரர் செய் பெறுகிறார். எந்த வீரரும் கடந்து செல்லவில்லை என்றால், இரண்டாவது வீரர் வெற்றி பெறுவார்.

# variants.irensei.pass.name
source: Pass tiebreak
ta: பாச் டைபிரேக்

# variants.irensei.swap-2.description
source: The first player places three stones. The next player may do one of (1) place a single stone to continue as player 2, (2) swap colours to play as player 1, or (3) place two more stones and allow the opponent to decide to play as player 1 or player 2.
ta: முதல் வீரர் மூன்று கற்களை வைக்கிறார். அடுத்த வீரர் (1) பிளேயர் 2 ஆக தொடர ஒரு கல்லை வைக்கலாம், (2) பிளேயர் 1 ஆக விளையாட வண்ணங்களை மாற்றவும், அல்லது (3) மேலும் இரண்டு கற்களை வைத்து, எதிரியை பிளேயர் 1 அல்லது பிளேயர் 2 ஆக விளையாட முடிவு செய்ய அனுமதிக்கலாம்.

# variants.irensei.swap-2.name
source: Swap-2 opening
ta: இடமாற்று -2 திறப்பு

# variants.irensei.swap-5.description
source: For the first five stones on the board, after placement, the next player has the option to swap colours.
ta: போர்டில் முதல் ஐந்து கற்களுக்கு, வேலைவாய்ப்புக்குப் பிறகு, அடுத்த வீரருக்கு வண்ணங்களை மாற்ற விருப்பம் உள்ளது.

# variants.irensei.swap-5.name
source: Swap-5 opening
ta: இடமாற்று -5 திறப்பு
