Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# variants.irensei.toroidal-15.name
source: Toroidal 15x15 board
ta: டொராய்டல் 15x15 போர்டு

# variants.jacynth.#deck.description
source: The basic 36-card deck (aces through crowns)
ta: அடிப்படை 36-கார்டு டெக் (கிரீடங்கள் மூலம் ஏசச்)

# variants.jacynth.#setup.name
source: The Razeway
ta: ரேச்வே

# variants.jacynth.#setup.description
source: The board starts with six cards in a diagonal line.
ta: பலகை ஆறு அட்டைகளுடன் மூலைவிட்ட வரிசையில் தொடங்குகிறது.

# variants.jacynth.extended.name
source: Extended deck
ta: நீட்டிக்கப்பட்ட டெக்

# variants.jacynth.extended.description
source: Deck includes the Excuse, the pawns, and the courts (influence tokens may not be placed on any of these cards).
ta: டெக்கில் சாக்கு, சிப்பாய்கள் மற்றும் நீதிமன்றங்கள் உள்ளன (இந்த அட்டைகளில் எதுவுமே செல்வாக்கு டோக்கன்கள் வைக்கப்படாமல் போகலாம்).

# variants.jacynth.towers.name
source: Towers
ta: கோபுரங்கள்

# variants.jacynth.towers.description
source: The board starts with four cards just inside of each corner.
ta: ஒவ்வொரு மூலையிலும் நான்கு அட்டைகளுடன் போர்டு தொடங்குகிறது.

# variants.jacynth.oldcity.name
source: The Old City
ta: பழைய நகரம்

# variants.jacynth.oldcity.description
source: The board starts with six cards in a circular pattern.
ta: போர்டு ஆறு அட்டைகளுடன் வட்ட வடிவத்தில் தொடங்குகிறது.

# variants.konane.#board.name
source: Size 6 board
ta: அளவு 6 போர்டு

# variants.konane.size-8.name
source: Size 8 board
ta: அளவு 8 போர்டு

# variants.lielow.#board.name
source: Size-8 board
ta: அளவு -8 போர்டு

# variants.lielow.size-9.name
source: Size-9 board
ta: அளவு -9 போர்டு

# variants.lifeline.#board.name
source: Size 8 board
ta: அளவு 8 போர்டு

# variants.lifeline.size-6.name
source: Size 6 board
ta: அளவு 6 போர்டு

# variants.lifeline.size-7.name
source: Size 7 board
ta: அளவு 7 போர்டு

# variants.lifeline.size-10.name
source: Size 10 board
ta: அளவு 10 போர்டு

# variants.lifeline.size-12.name
source: Size 12 board
ta: அளவு 12 போர்டு

# variants.loa.#board.description
source: 9x9 "black hole" variant. Moving a piece onto the central hole removes the piece from the game.
ta: 9x9 "கருந்துளை" மாறுபாடு. நடு துளை மீது ஒரு துண்டு நகர்த்துவது விளையாட்டிலிருந்து துண்டுகளை நீக்குகிறது.

# variants.loa.#board.name
source: Larger board (9x9)
ta: பெரிய பலகை (9x9)

# variants.loa.classic.name
source: Classic 8x8 board
ta: கிளாசிக் 8x8 போர்டு

# variants.loa.scrambled.description
source: Pieces are interspersed with each other instead of starting together on opposite sides of the board.
ta: பலகையின் எதிர் பக்கங்களில் ஒன்றாகத் தொடங்குவதற்குப் பதிலாக துண்டுகள் ஒருவருக்கொருவர் குறுக்கிடப்படுகின்றன.

# variants.loa.scrambled.name
source: Scrambled Eggs
ta: துருவல் முட்டைகள்

# variants.lox.#board.name
source: Size 11 board
ta: அளவு 11 போர்டு

# variants.lox.size-13.name
source: Size-13 board.
ta: அளவு -13 போர்டு.

# variants.lox.size-15.name
source: Size-15 board.
ta: அளவு -15 போர்டு.

# variants.majorities.#board.name
source: Size-5 board
ta: அளவு -5 போர்டு

# variants.majorities.size-3.name
source: Size-3 board
ta: அளவு -3 போர்டு

# variants.majorities.size-7.name
source: Size-7 board
ta: அளவு -7 போர்டு

# variants.majorities.no-blocked.name
source: No blocked cells
ta: தடுக்கப்பட்ட செல்கள் இல்லை

# variants.majorities.no-blocked.description
source: No-unplayable-cells variant proposed by Luis Bolaños Mures. The first person to occupy half or more in a line claims the line.
ta: லூயிச் போலனோச் மியூரேச் முன்மொழியப்படாத-செல்கள்-செல்கள் மாறுபாடு. ஒரு வரியில் பாதி அல்லது அதற்கு மேற்பட்டவற்றை ஆக்கிரமித்த முதல் நபர் வரியைக் கோருகிறார்.

# variants.majorities.capture.name
source: Capture
ta: பிடிப்பு

# variants.majorities.capture.description
source: Capture variant proposed by Luis Bolaños Mures. After each placement, all pieces in claimed lines are removed. In the original proposal, Luis suggests this variant be used with the no-blocked-cells variant.
ta: லூயிச் போலானோச் மியூரேச் முன்மொழியப்பட்ட மாறுபாடு. ஒவ்வொரு வேலைவாய்ப்புக்கும் பிறகு, கோரப்பட்ட வரிகளில் உள்ள அனைத்து பகுதிகளும் அகற்றப்படுகின்றன. அசல் திட்டத்தில், இந்த மாறுபாடு இல்லாத-செல்கள் மாறுபாட்டுடன் பயன்படுத்தப்பட வேண்டும் என்று லூயிச் அறிவுறுத்துகிறார்.

# variants.margo.#board.name
source: Size-7 board
ta: அளவு -7 போர்டு

# variants.margo.size-4.name
source: Size-4 board (Spargo)
ta: அளவு -4 போர்டு (ச்பார்கோ)

# variants.margo.size-6.name
source: Size-6 board (small)
ta: அளவு -6 பலகை (சிறியது)

# variants.margo.size-9.name
source: Size-9 board (large)
ta: அளவு -9 பலகை (பெரியது)

# variants.mattock.#board.name
source: Default base-7 board
ta: இயல்புநிலை அடிப்படை -7 போர்டு

# variants.mattock.freestyle.description
source: Players take turn placing their miners on the board. When all miners are placed, player 2 starts.
ta: வீரர்கள் தங்கள் சுரங்கத் தொழிலாளர்களை பலகையில் வைப்பதை எடுத்துக்கொள்கிறார்கள். அனைத்து சுரங்கத் தொழிலாளர்களும் வைக்கப்படும்போது, பிளேயர் 2 தொடங்குகிறது.

# variants.mattock.freestyle.name
source: Freestyle placement
ta: ஃப்ரீச்டைல் வேலை வாய்ப்பு

# variants.mattock.random.description
source: The starting board is randomized.
ta: தொடக்க பலகை சீரற்றது.

# variants.mattock.random.name
source: Randomized board
ta: சீரற்ற பலகை

# variants.mattock.size-5.description
source: Ideal for tactics practice.
ta: தந்திரோபாய பயிற்சிக்கு ஏற்றது.

# variants.mattock.size-5.name
source: Smaller board (base-5)
ta: சிறிய பலகை (அடிப்படை -5)

# variants.mchess.ofkk.description
source: Pawns move like Chess kings, and drones move like Chess knights.
ta: சதுரங்க கிங்ச் போல சிப்பாய்கள் நகரும், மற்றும் ட்ரோன்கள் சதுரங்க மாவீரர்களைப் போல நகரும்.

# variants.mchess.ofkk.name
source: Of Knights and Kings
ta: மாவீரர்கள் மற்றும் மன்னர்கள்

# variants.meridians.#board.name
source: Default board (base 7)
ta: இயல்புநிலை பலகை (அடிப்படை 7)

# variants.meridians.size-6.name
source: Smaller board (base 6)
ta: சிறிய பலகை (அடிப்படை 6)

# variants.meridians.size-8.name
source: Larger board (base 8)
ta: பெரிய பலகை (அடிப்படை 8)

# variants.mixtour.five.description
source: The winner is the first to score three points.
ta: வெற்றியாளர் முதலில் மூன்று புள்ளிகளைப் பெற்றார்.

# variants.mixtour.five.name
source: Best of Five
ta: ஐந்து சிறந்த

# variants.mixtour.three.description
source: The winner is the first to score two points.
ta: வெற்றியாளர் முதலில் இரண்டு புள்ளிகளைப் பெற்றார்.

# variants.mixtour.three.name
source: Best of Three
ta: மூன்று சிறந்த

# variants.moonsquad.#board.name
source: Moon board
ta: மூன் போர்டு

# variants.moonsquad.#board.description
source: A hexhex5 board with a subdivided centre cell and tweaked edges to form a moon-type surface.
ta: ஒரு துணைப்பிரிவு மைய கலத்துடன் ஒரு எக்ச்எக்ச் 5 போர்டு மற்றும் சந்திரன் வகை மேற்பரப்பை உருவாக்க விளிம்புகளை மாற்றியமைத்தது.

# variants.moonsquad.hex5.name
source: Hexhex 5 (61 spaces)
ta: எக்செக்ச் 5 (61 இடைவெளிகள்)

# variants.moonsquad.hex5.description
source: In this version, the pie offer is a single piece.
ta: இந்த பதிப்பில், பை சலுகை ஒரு துண்டு.

# variants.moonsquad.limping.name
source: Limping 5-6 (75 spaces)
ta: 5-6 (75 இடைவெளிகள்)

# variants.moonsquad.limping.description
source: Two colours will have an extra cube.
ta: இரண்டு வண்ணங்கள் கூடுதல் கனசதுரத்தைக் கொண்டிருக்கும்.

# variants.morphos.#board.name
source: 13x13 board
ta: 13x13 போர்டு

# variants.morphos.size-9.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.morphos.size-11.name
source: 11x11 board
ta: 11x11 போர்டு

# variants.morphos.size-15.name
source: 15x15 board
ta: 15x15 போர்டு

# variants.morphos.size-17.name
source: 17x17 board
ta: 17x17 போர்டு

# variants.morphos.#rules.name
source: Default rules
ta: இயல்புநிலை விதிகள்

# variants.morphos.simplified.name
source: Minimorph
ta: மினிமார்ப்

# variants.morphos.simplified.description
source: Faster game with simplified capture formations. Deadlocks are not possible.
ta: எளிமைப்படுத்தப்பட்ட பிடிப்பு வடிவங்களுடன் வேகமான விளையாட்டு. முட்டுக்கட்டைகள் சாத்தியமில்லை.

# variants.morphos.double.name
source: Duomorph
ta: டூமார்ப்

# variants.morphos.double.description
source: On each turn, place two new stones (orthogonally adjacent to each other) or capture one. Minimorph formations apply.
ta: ஒவ்வொரு திருப்பத்திலும், இரண்டு புதிய கற்களை (ஒருவருக்கொருவர் அருகிலுள்ள ஆர்த்தோகனலி) வைக்கவும் அல்லது ஒன்றைக் கைப்பற்றவும். மினிமார்ப் வடிவங்கள் பொருந்தும்.

# variants.morphos.replace.name
source: Remorph
ta: ரீல்ஃப்

# variants.morphos.replace.description
source: Captured stones must be placed back on the board by their owner. Minimorph formations apply.
ta: கைப்பற்றப்பட்ட கற்கள் அவற்றின் உரிமையாளரால் மீண்டும் போர்டில் வைக்கப்பட வேண்டும். மினிமார்ப் வடிவங்கள் பொருந்தும்.

# variants.murus.basic.description
source: Only walls and towers can be built (maximum stack size is 2).
ta: சுவர்கள் மற்றும் கோபுரங்களை மட்டுமே கட்ட முடியும் (அதிகபட்ச அடுக்கு அளவு 2).

# variants.murus.basic.name
source: Basic MG
ta: அடிப்படை மிகி

# variants.murus.escape.description
source: The winning condition is to stalemate your opponent. Breaking through is not sufficient.
ta: வென்ற நிலை உங்கள் எதிரியை முட்டுக்கட்டை போடுவதாகும். உடைப்பது போதாது.

# variants.murus.escape.name
source: Escape
ta: தப்பிக்கும்

# variants.murus.static.description
source: No initial redistribution of a starting tower.
ta: தொடக்க கோபுரத்தின் ஆரம்ப மறுபகிர்வு இல்லை.

# variants.murus.static.name
source: Static Start
ta: நிலையான தொடக்க

# variants.nakatta.#board.name
source: 22x22 board
ta: 22x22 போர்டு

# variants.nakatta.size-19.name
source: 19x19 board
ta: 19x19 வாரியம்

# variants.nakatta.size-25.name
source: 25x25 board
ta: 25x25 போர்டு

# variants.nakatta.size-29.name
source: 29x29 board
ta: 29x29 போர்டு

# variants.nex.#board.name
source: 11x11 board
ta: 11x11 போர்டு

# variants.nex.size-9.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.omny.#board.name
source: Hexhex 8 board (169 spaces)
ta: எக்ச்எக்ச் 8 போர்டு (169 இடங்கள்)

# variants.omny.#stars.name
source: Sunder
ta: சுந்தர்

# variants.omny.#stars.description
source: Every cell is a star point
ta: ஒவ்வொரு கலமும் ஒரு நட்சத்திர புள்ளி

# variants.omny.size-4.name
source: Hexhex 4 (37 spaces)
ta: எக்செக்ச் 4 (37 இடைவெளிகள்)

# variants.omny.size-5.name
source: Hexhex 5 (61 spaces)
ta: எக்செக்ச் 5 (61 இடைவெளிகள்)

# variants.omny.size-6.name
source: Hexhex 6 (91 spaces)
ta: எக்செக்ச் 6 (91 இடங்கள்)

# variants.omny.size-7.name
source: Hexhex 7 (127 spaces)
ta: எக்செக்ச் 7 (127 இடைவெளிகள்)

# variants.omny.size-9.name
source: Hexhex 9 (217 spaces)
ta: எக்செக்ச் 9 (217 இடைவெளிகள்)

# variants.omny.size-10.name
source: Hexhex 10 (271 spaces)
ta: எக்செக்ச் 10 (271 இடைவெளிகள்)

# variants.omny.constellation.name
source: Constellation
ta: விண்மீன்

# variants.omny.constellation.description
source: Stars in the corners and the centre
ta: மூலைகளிலும் மையத்திலும் நட்சத்திரங்கள்

# variants.omny.gyre.description
source: Stars around the perimeter and in the centre (proposed by Mark Steere)
ta: சுற்றளவு மற்றும் மையத்தில் நட்சத்திரங்கள் (மார்க் ச்டீயரால் முன்மொழியப்பட்டது)

# variants.omny.yex.name
source: Yex
ta: யெக்ச்

# variants.omny.yex.description
source: Stars in alternating corners
ta: மாற்று மூலைகளில் நட்சத்திரங்கள்

# variants.omny.random-3.name
source: Random placement: 3 stars
ta: சீரற்ற வேலை வாய்ப்பு: 3 நட்சத்திரங்கள்

# variants.omny.random-5.name
source: Random placement: 5 stars
ta: சீரற்ற வேலை வாய்ப்பு: 5 நட்சத்திரங்கள்

# variants.omny.random-7.name
source: Random placement: 7 stars
ta: சீரற்ற வேலை வாய்ப்பு: 7 நட்சத்திரங்கள்

# variants.omny.random-9.name
source: Random placement: 9 stars
ta: சீரற்ற வேலை வாய்ப்பு: 9 நட்சத்திரங்கள்

# variants.omny.free.name
source: Free placement
ta: இலவச வேலை வாய்ப்பு

# variants.omny.free.description
source: Intended for players who communicate expectations before the game. Each player will be able to place as many stars as they wish.
ta: விளையாட்டுக்கு முன் எதிர்பார்ப்புகளைத் தொடர்பு கொள்ளும் வீரர்களுக்கு நோக்கம் கொண்டது. ஒவ்வொரு வீரரும் விரும்பும் அளவுக்கு நட்சத்திரங்களை வைக்க முடியும்.

# variants.omny.captures.name
source: Enable Adere-style captures
ta: Adere- பாணி பிடிப்புகளை இயக்கவும்

# variants.omny.captures.description
source: Pieces can move onto an opposing stack of the same height. Increases game length. Consider using smaller boards.
ta: துண்டுகள் அதே உயரத்தின் எதிரெதிர் அடுக்கில் செல்லலாம். விளையாட்டு நீளத்தை அதிகரிக்கிறது. சிறிய பலகைகளைப் பயன்படுத்துவதைக் கவனியுங்கள்.

# variants.onyx.#board.name
source: Size-12 board
ta: அளவு -12 போர்டு

# variants.onyx.#setup.name
source: Open setup
ta: திறந்த அமைப்பு

# variants.onyx.size-16.name
source: Size-16 board
ta: அளவு -16 போர்டு

# variants.onyx.size-20.name
source: Size-20 board
ta: அளவு -20 போர்டு

# variants.onyx.head-start.name
source: Head start
ta: தலை தொடக்க

# variants.onyx.head-start.description
source: Both players start with two pieces on each opponent's edge.
ta: இரு வீரர்களும் ஒவ்வொரு எதிரியின் விளிம்பிலும் இரண்டு துண்டுகளுடன் தொடங்குகிறார்கள்.

# variants.orb.noglobes.description
source: Neither player starts with any globes.
ta: எந்த வீரரும் எந்த குளோப்களுடனும் தொடங்குவதில்லை.

# variants.orb.noglobes.name
source: No Starting Globes
ta: தொடக்க குளோப்கள் இல்லை

# variants.oust.#board.name
source: size-7 hex
ta: அளவு -7 ஃச்

# variants.oust.hex-6.name
source: size-6 hex
ta: அளவு -6 ஃச்

# variants.oust.hex-8.name
source: size-8 hex
ta: அளவு -8 ஃச்

# variants.oust.square-11.name
source: size-11 square
ta: அளவு -11 நாற்கை

# variants.pahtum.quick.name
source: Quick setup
ta: விரைவான அமைப்பு

# variants.pahtum.quick.description
source: Blocked cells are determined randomly.
ta: தடுக்கப்பட்ட செல்கள் தோராயமாக தீர்மானிக்கப்படுகின்றன.

# variants.pahtum.captures.name
source: Custodial captures
ta: காவல்துறை பிடிப்புகள்

# variants.pahtum.captures.description
source: Sandwiching an enemy stone between two of yours converts it to your colour.
ta: உங்களில் இருவருக்கும் இடையில் ஒரு எதிரி கல்லை மணல் அள்ளுவது அதை உங்கள் நிறமாக மாற்றுகிறது.

# variants.paintbucket.#board.name
source: 12x12 board
ta: 12x12 போர்டு

# variants.paintbucket.size-16.name
source: 16x16 board
ta: 16x16 போர்டு

# variants.pente.#board.name
source: Default 15x15 board
ta: இயல்புநிலை 15x15 போர்டு

# variants.pente.#capture.description
source: You may only capture exactly 2 stones in each line.
ta: ஒவ்வொரு வரியிலும் சரியாக 2 கற்களை மட்டுமே நீங்கள் கைப்பற்றலாம்.

# variants.pente.#capture.name
source: Default capture rules
ta: இயல்புநிலை பிடிப்பு விதிகள்

# variants.pente.#opening.description
source: The first player has to place their first stone in the centre of the board, and their second stone at least three intersections away from the centre.
ta: முதல் வீரர் தங்கள் முதல் கல்லை பலகையின் மையத்தில் வைக்க வேண்டும், மேலும் அவர்களின் இரண்டாவது கல் மையத்திலிருந்து குறைந்தது மூன்று குறுக்குவெட்டுகள் தொலைவில் வைக்க வேண்டும்.

# variants.pente.#opening.name
source: Pro opening
ta: சார்பு திறப்பு

# variants.pente.#overline.description
source: You can win by forming a line of five or more stones
ta: ஐந்து அல்லது அதற்கு மேற்பட்ட கற்களின் வரியை உருவாக்குவதன் மூலம் நீங்கள் வெல்லலாம்

# variants.pente.#overline.name
source: Overline allowed
ta: ஓவர்லைன் அனுமதிக்கப்படுகிறது

# variants.pente.#overtime-capture.description
source: The game ends immediately when a player makes a winning alignment.
ta: ஒரு வீரர் ஒரு வெற்றிகரமான சீரமைப்பு செய்யும்போது விளையாட்டு உடனடியாக முடிகிறது.

# variants.pente.#overtime-capture.name
source: No overtime capture
ta: கூடுதல் நேர பிடிப்பு இல்லை

# variants.pente.#self-capture.description
source: Players may place a stone in a formation where it is surrounded by opponent's pieces such that it would ordinarily result in a capture without consequences.
ta: வீரர்கள் ஒரு கல்லை ஒரு உருவாக்கத்தில் வைக்கலாம், அங்கு அது எதிரியின் துண்டுகளால் சூழப்பட்டுள்ளது, இது பொதுவாக விளைவுகள் இல்லாமல் பிடிக்கும்.

# variants.pente.#self-capture.name
source: Self-capture ignored
ta: தன்வய பிடிப்பு புறக்கணிக்கப்பட்டது

# variants.pente.capture-2-3.description
source: You may capture 2 or 3 stones in a line.
ta: நீங்கள் ஒரு வரியில் 2 அல்லது 3 கற்களைப் பிடிக்கலாம்.

# variants.pente.capture-2-3.name
source: Capture 2-3 (Keryo Pente)
ta: 2-3 (கெரியோ பென்டே) பிடிக்கவும்

# variants.pente.long-pro.description
source: The first player has to place their first stone in the centre of the board, and their second stone at least four intersections away from the centre.
ta: முதல் வீரர் தங்கள் முதல் கல்லை பலகையின் மையத்தில் வைக்க வேண்டும், மேலும் அவர்களின் இரண்டாவது கல் மையத்திலிருந்து குறைந்தது நான்கு குறுக்குவெட்டுகள் தொலைவில் வைக்க வேண்டும்.

# variants.pente.long-pro.name
source: Long pro opening
ta: நீண்ட சார்பு திறப்பு

# variants.pente.overline-forbidden.description
source: Any move that would create a line of six or more stones is illegal.
ta: ஆறு அல்லது அதற்கு மேற்பட்ட கற்களின் வரியை உருவாக்கும் எந்த நடவடிக்கையும் சட்டவிரோதமானது.

# variants.pente.overline-forbidden.name
source: Overline forbidden
ta: தடைசெய்யப்பட்ட ஓவர்லைன்

# variants.pente.overline-ignored.description
source: Overline moves are legal, but they do not count as a win. It's possible to capture a stone such that your opponent wins. Draws are possible if both players simultaneously meet the win condition.
ta: ஓவர்லைன் நகர்வுகள் சட்டபூர்வமானவை, ஆனால் அவை ஒரு வெற்றியாக கருதப்படுவதில்லை. உங்கள் எதிரி வெல்லும் ஒரு கல்லைப் பிடிக்க முடியும். இரு வீரர்களும் ஒரே நேரத்தில் செய் நிலையை நிறைவு செய்தால் டிராக்கள் சாத்தியமாகும்.

# variants.pente.overline-ignored.name
source: Overline ignored
ta: ஓவர்லைன் புறக்கணிக்கப்பட்டது

# variants.pente.overtime-capture.description
source: When a player makes a winning alignment, the opponent has one move to try to break that alignment.
ta: ஒரு வீரர் ஒரு வெற்றிகரமான சீரமைப்பு செய்யும்போது, அந்த சீரமைப்பை உடைக்க முயற்சிக்க எதிரிக்கு ஒரு நடவடிக்கை உள்ளது.

# variants.pente.overtime-capture.name
source: Overtime capture (Boat Pente)
ta: மேலதிக நேரம் பிடிப்பு (படகு பென்ட்)

# variants.pente.self-capture.description
source: When players place a stone in a formation where it is surrounded by opponent's pieces such that it would ordinarily result in a capture, those stones are removed as though the opponent captured them. All captures are determined before any removal is made. This means that if we initially had XO_XXO, and the O player places at the empty space, it results in X____O, and each player gains two points.
ta: வீரர்கள் ஒரு கல்லை ஒரு உருவாக்கத்தில் வைக்கும்போது, அது பொதுவாக பிடிப்புக்கு வழிவகுக்கும் என்று எதிரியின் துண்டுகளால் சூழப்பட்டிருக்கும் போது, எதிரி அவற்றைக் கைப்பற்றியதைப் போல அந்த கற்கள் அகற்றப்படுகின்றன. எந்தவொரு அகற்றுதலும் செய்யப்படுவதற்கு முன்பு அனைத்து பிடிப்புகளும் தீர்மானிக்கப்படுகின்றன. இதன் பொருள் என்னவென்றால், ஆரம்பத்தில் XO_XXO வைத்திருந்தால், மற்றும் O பிளேயர் வெற்று இடத்தில் வைக்கப்பட்டால், அது X____O இல் விளைகிறது, மேலும் ஒவ்வொரு வீரரும் இரண்டு புள்ளிகளைப் பெறுகிறார்கள்.

# variants.pente.self-capture.name
source: Self-capture allowed (Poof Pente)
ta: தன்வய பிடிப்பு அனுமதிக்கப்பட்ட (BOOF பென்டே)

# variants.pente.self-capture-forbidden.description
source: Players may not place their stones in a formation where it is surrounded by opponent's pieces such that it would ordinarily result in a capture.
ta: வீரர்கள் தங்கள் கற்களை ஒரு உருவாக்கத்தில் வைக்கக்கூடாது, அது எதிராளியின் துண்டுகளால் சூழப்பட்டுள்ளது, இது பொதுவாக பிடிப்புக்கு வழிவகுக்கும்.

# variants.pente.self-capture-forbidden.name
source: Self-capture forbidden
ta: தன்வய பிடிப்பு தடைசெய்யப்பட்டுள்ளது

# variants.pente.standard-19.name
source: Standard 19x19 board
ta: நிலையான 19x19 வாரியம்

# variants.pente.swap-1st.description
source: The first player places a stone anywhere on the board. The next player has the option to swap colours.
ta: முதல் வீரர் போர்டில் எங்கும் ஒரு கல்லை வைக்கிறார். அடுத்த பிளேயருக்கு வண்ணங்களை மாற்ற விருப்பம் உள்ளது.

# variants.pente.swap-1st.name
source: Swap-1st opening
ta: இடமாற்று -1 வது திறப்பு

# variants.pente.swap-2.description
source: The first player places three stones. The next player may do one of (1) place a single stone to continue as player 2, (2) swap colours to play as player 1, or (3) place two more stones and allow the opponent to decide to play as player 1 or player 2.
ta: முதல் வீரர் மூன்று கற்களை வைக்கிறார். அடுத்த வீரர் (1) பிளேயர் 2 ஆக தொடர ஒரு கல்லை வைக்கலாம், (2) பிளேயர் 1 ஆக விளையாட வண்ணங்களை மாற்றவும், அல்லது (3) மேலும் இரண்டு கற்களை வைக்கவும், எதிரியை பிளேயர் 1 அல்லது பிளேயர் 2 ஆக விளையாட முடிவு செய்ய அனுமதிக்கலாம்.

# variants.pente.swap-2.name
source: Swap-2 opening
ta: இடமாற்று -2 திறப்பு

# variants.pente.swap-5.description
source: For the first five stones on the board, after placement, the next player has the option to swap colours.
ta: போர்டில் முதல் ஐந்து கற்களுக்கு, வேலைவாய்ப்புக்குப் பிறகு, அடுத்த வீரருக்கு வண்ணங்களை மாற்ற விருப்பம் உள்ளது.

# variants.pente.swap-5.name
source: Swap-5 opening
ta: இடமாற்று -5 திறப்பு

# variants.pikemen.15pts.description
source: The game doesn't end until you have 15 points worth of enemy soldiers.
ta: உங்களிடம் 15 புள்ளிகள் மதிப்புள்ள எதிரி வீரர்கள் இருக்கும் வரை விளையாட்டு முடிவடையாது.

# variants.pikemen.15pts.name
source: Longer Game: 15 points
ta: நீண்ட விளையாட்டு: 15 புள்ளிகள்

# variants.pilastri.#board.name
source: Size 6 board
ta: அளவு 6 போர்டு

# variants.pilastri.size-8.name
source: Size 8 board
ta: அளவு 8 போர்டு

# variants.pilastri.#rules.name
source: Default rules
ta: இயல்புநிலை விதிகள்

# variants.pilastri.#rules.description
source: A piece must move higher and pieces that start with nothing beneath them can only end with a single piece beneath them.
ta: ஒரு துண்டு உயரமாக நகர வேண்டும், அவற்றின் கீழே எதுவும் இல்லாமல் தொடங்கும் துண்டுகள் அவற்றின் அடியில் ஒரு துண்டுடன் மட்டுமே முடிவடையும்.

# variants.pilastri.jumpers.name
source: High jumpers
ta: உயர் சம்பர்கள்

# variants.pilastri.jumpers.description
source: A piece must move higher, but pieces that start with nothing beneath them are allowed to land on any other stack.
ta: ஒரு துண்டு உயரமாக நகர வேண்டும், ஆனால் அவற்றின் கீழே எதுவும் இல்லாமல் தொடங்கும் துண்டுகள் வேறு எந்த அடுக்கிலும் தரையிறங்க அனுமதிக்கப்படுகின்றன.

# variants.pletore.#board.name
source: Default board (13x13)
ta: இயல்புநிலை பலகை (13x13)

# variants.pletore.#komi.description
source: The first player will enter a number into the move input box on their first turn to define the second player bonus for the game. The second player will be given the option to switch seats afterwards.
ta: முதல் வீரர் விளையாட்டிற்கான இரண்டாவது பிளேயர் போனசை வரையறுக்க முதல் திருப்பத்தில் நகரும் உள்ளீட்டு பெட்டியில் ஒரு எண்ணை உள்ளிடுவார். இரண்டாவது வீரருக்கு பின்னர் இருக்கைகளை மாற்ற விருப்பம் வழங்கப்படும்.

# variants.pletore.#komi.name
source: Komi offer
ta: பாதிக்கப்பட்டவர் வாருங்கள்

# variants.pletore.nokomi.description
source: The game will be played without a second player bonus. Good for beginners.
ta: இரண்டாவது வீரர் போனச் இல்லாமல் விளையாட்டு விளையாடப்படும். ஆரம்பநிலைக்கு நல்லது.

# variants.pletore.nokomi.name
source: No komi offer
ta: கோமி சலுகை இல்லை

# variants.pletore.size-11.name
source: Smaller board (11x11)
ta: சிறிய பலகை (11x11)

# variants.pletore.size-15.name
source: Larger board (15x15)
ta: பெரிய பலகை (15x15)

# variants.pletore.size-17.name
source: Largest board (17x17)
ta: மிகப்பெரிய பலகை (17x17)

# variants.pontedd.#board.name
source: 10x10 board
ta: 10x10 போர்டு

# variants.pontedd.size-12.name
source: 12x12 board
ta: 12x12 போர்டு

# variants.pylon.#setup.description
source: The board starts empty, and the first half of the game is the players placing their pyramids.
ta: போர்டு காலியாகத் தொடங்குகிறது, மேலும் விளையாட்டின் முதல் பாதி வீரர்கள் தங்கள் பிரமிடுகளை வைப்பது.

# variants.pylon.quickStart.name
source: Quick start
ta: விரைவான தொடக்க
