Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# notes.garden
source: To make it very clear what happened on a previous turn, each move is displayed over four separate boards. The first board shows the game after the piece was first placed. The second board shows the state after adjacent pieces were flipped. The third board shows any harvests. The fourth board is the final game state and is where you make your moves. In our implementation, black is always the "tome" or tie-breaker colour. The last player to harvest black will have a `0.1` after their score.
ta: முந்தைய திருப்பத்தில் என்ன நடந்தது என்பதை மிகத் தெளிவுபடுத்த, ஒவ்வொரு அசைவும் நான்கு தனித்தனி பலகைகளில் காட்டப்படும். துண்டு முதலில் வைக்கப்பட்ட பிறகு முதல் பலகை விளையாட்டைக் காட்டுகிறது. அருகிலுள்ள துண்டுகள் புரட்டப்பட்ட பின்னர் இரண்டாவது வாரியம் மாநிலத்தை காட்டுகிறது. மூன்றாவது வாரியம் எந்த அறுவடைகளையும் காட்டுகிறது. நான்காவது வாரியம் இறுதி விளையாட்டு நிலை மற்றும் உங்கள் நகர்வுகளை நீங்கள் செய்யும் இடமாகும். எங்கள் செயல்பாட்டில், கருப்பு எப்போதும் "டோம்" அல்லது டை-பிரேக்கர் வண்ணமாகும். பிளாக் அறுவடை செய்த கடைசி வீரர் அவர்களின் மதிப்பெண்ணுக்குப் பிறகு `0.1` வைத்திருப்பார்.

# notes.gyges
source: The goal squares are adjacent to all the cells in the back row. The renderer cannot currently handle "floating" cells.
ta: இலக்கு சதுரங்கள் பின் வரிசையில் உள்ள அனைத்து கலங்களுக்கும் அருகில் உள்ளன. ரெண்டரரால் தற்போது "மிதக்கும்" கலங்களைக் கையாள முடியாது.

# notes.homeworlds
source: The win condition is what's called "Sinister Homeworlds." You only win by defeating the opponent to your left. If someone else does that, the game continues, but your left-hand opponent now shifts clockwise. For example, in a four-player game, if I'm South, then I win if I eliminate West. But if the North player ends up eliminating West, the game continues, but now my left-hand opponent is North.
ta: செய் நிலை "மோசமான ஓம்வொர்ல்ட்ச்" என்று அழைக்கப்படுகிறது. உங்கள் இடதுபுறத்தில் எதிரியை தோற்கடித்து மட்டுமே நீங்கள் வெல்வீர்கள். வேறு யாராவது அவ்வாறு செய்தால், விளையாட்டு தொடர்கிறது, ஆனால் உங்கள் இடது கை எதிர்ப்பாளர் இப்போது கடிகார திசையில் மாறுகிறார். உதாரணமாக, நான்கு பிளேயர் விளையாட்டில், நான் தெற்கே இருந்தால், நான் வெச்டை அகற்றினால் வெல்வேன். ஆனால் வடக்கு வீரர் மேற்கு நாடுகளை நீக்கிவிட்டால், விளையாட்டு தொடர்கிறது, ஆனால் இப்போது எனது இடது கை எதிர்ப்பாளர் வடக்கே இருக்கிறார்.

# notes.jacynth
source: More information on the Decktet system can be found on the [official Decktet website](https://www.decktet.com). Cards in players' hands are hidden from observers and opponents.
ta: டெக்டெட் அமைப்பு பற்றிய கூடுதல் தகவல்களை [அதிகாரப்பூர்வ டெக்டெட் வலைத்தளம்] (https://www.decktet.com) இல் காணலாம். வீரர்களின் கைகளில் உள்ள அட்டைகள் பார்வையாளர்கள் மற்றும் எதிரிகளிடமிருந்து மறைக்கப்பட்டுள்ளன.

# notes.konane
source: Several competing opening protocols exist, but the most common ruleset is described in the BGG reference and is what is implemented here.
ta: பல போட்டியிடும் திறப்பு நெறிமுறைகள் உள்ளன, ஆனால் மிகவும் பொதுவான விதிமுறைகள் பி.சி.சி குறிப்பில் விவரிக்கப்பட்டுள்ளன, மேலும் இது இங்கே செயல்படுத்தப்படுகிறது.

# notes.loa
source: In the centre of the 9x9 board is a "black hole.". Landing on the black hole means the piece is removed from the game. Simultaneous connections are scored as a draw.
ta: 9x9 பலகையின் மையத்தில் ஒரு "கருந்துளை" உள்ளது. கருந்துளையில் தரையிறங்குவது என்பது துண்டு விளையாட்டிலிருந்து அகற்றப்படுகிறது. ஒரே நேரத்தில் இணைப்புகள் ஒரு டிராவாக அடித்துள்ளன.

# notes.mchess
source: If there have been seven consecutive turns without a capture, someone can "call the clock" by adding an asterisk (*) to the end of their move. This can only be done by selecting the move from the drop-down list. After another seven turns with no capture, the game will end and be scored.
ta: பிடிப்பு இல்லாமல் தொடர்ச்சியாக ஏழு திருப்பங்கள் இருந்திருந்தால், யாரோ ஒருவர் தங்கள் நகர்வின் முடிவில் ஒரு நட்சத்திரத்தை (*) சேர்ப்பதன் மூலம் "கடிகாரத்தை அழைக்கலாம்". கீழ்தோன்றும் பட்டியலிலிருந்து நகர்வைத் தேர்ந்தெடுப்பதன் மூலம் மட்டுமே இதைச் செய்ய முடியும். பிடிப்பு இல்லாமல் மற்றொரு ஏழு திருப்பங்களுக்குப் பிறகு, விளையாட்டு முடிவடைந்து அடித்தது.

# notes.murus
source: The default ruleset is "Advanced Murus Gallicus" (with catapults). By default, your first move is to redistribute one of your starting towers as walls on your second row. Additionally, the standard pie rule is also available. There are three variants you can mix and match: * "Basic" reverts the game to the "no catapult" state. * "Static" disables the initial tower redistribution. * "Escape" eliminates the breakthrough win condition.
ta: இயல்புநிலை விதிகள் "மேம்பட்ட முச் காலிகச்" (கவண் உடன்). இயல்பாக, உங்கள் முதல் நகர்வு உங்கள் தொடக்க கோபுரங்களில் ஒன்றை உங்கள் இரண்டாவது வரிசையில் சுவர்களாக மறுபகிர்வு செய்வதாகும். கூடுதலாக, நிலையான பை விதியும் கிடைக்கிறது. நீங்கள் கலந்து பொருத்தக்கூடிய மூன்று வகைகள் உள்ளன: * "அடிப்படை" விளையாட்டை "கவண் இல்லை" நிலைக்கு மாற்றுகிறது. * "நிலையான" ஆரம்ப கோபுர மறுவிநியோகத்தை முடக்குகிறது. * "எச்கேப்" திருப்புமுனை செய் நிலையை நீக்குகிறது.

# notes.oware
source: This implementation follows the common tournament rule that grand slam moves are allowed, but no pieces are captured. Depicting state changes in sowing games is challenging. The initial chosen pit is marked, as is any capture. Small numbers appear to show the change in the number of stones in each pit. If you believe you have encountered a bug, please let us know in Discord.
ta: கிராண்ட்ச்லாம் நகர்வுகள் அனுமதிக்கப்படுகின்றன என்ற பொதுவான போட்டி விதியை இந்த செயல்படுத்தல் பின்பற்றுகிறது, ஆனால் எந்த துண்டுகளும் பிடிக்கப்படவில்லை. விதைப்பதில் மாநில மாற்றங்களை சித்தரிப்பது சவாலானது. எந்தவொரு பிடிப்பையும் போலவே ஆரம்ப தேர்ந்தெடுக்கப்பட்ட குழி குறிக்கப்பட்டுள்ளது. ஒவ்வொரு குழியிலும் கற்களின் எண்ணிக்கையில் மாற்றத்தை சிறிய எண்கள் காட்டுகின்றன. நீங்கள் ஒரு பிழையை சந்தித்ததாக நீங்கள் நம்பினால், தயவுசெய்து எங்களுக்குத் தெரியப்படுத்துங்கள்.

# notes.pacru
source: This implementation adheres to the 2011 rule change that requires at least one opponent to have at least nine tiles on the board before meetings will trigger.
ta: இந்த செயல்படுத்தல் 2011 விதி மாற்றத்தை கடைபிடிக்கிறது, இது கூட்டங்கள் தூண்டுவதற்கு முன்பு குறைந்தது ஒரு எதிரிக்கு குறைந்தபட்சம் ஒன்பது ஓடுகள் குழுவில் இருக்க வேண்டும்.

# notes.pigs
source: Unlike the old Super Duper Games implementation, this one implements the core rule set. Each player enters all five moves, and they are resolved at once. Movement is resolved before damage is applied.
ta: பழைய சூப்பர் டூப்பர் கேம்ச் செயல்படுத்தலைப் போலன்றி, இது முக்கிய விதி தொகுப்பை செயல்படுத்துகிறது. ஒவ்வொரு வீரரும் ஐந்து நகர்வுகளிலும் நுழைகிறார்கள், அவை ஒரே நேரத்தில் தீர்க்கப்படுகின்றன. சேதம் பயன்படுத்தப்படுவதற்கு முன்பு இயக்கம் தீர்க்கப்படுகிறது.

# notes.pigs2
source: This is the same as the old Super Duper Games. The game starts by you programming three moves, but only one move is resolved and added each turn. Movement is resolved before damage is applied. Unlike most other AP games, if players resign or timeout, the game does not immediately end. Instead, they're eliminated and their robot becomes inactive, but the other players can play on.
ta: இது பழைய சூப்பர் டூப்பர் விளையாட்டுகளுக்கு சமம். மூன்று நகர்வுகளை நீங்கள் நிரலாக்குவதன் மூலம் விளையாட்டு தொடங்குகிறது, ஆனால் ஒரே ஒரு நகர்வு மட்டுமே தீர்க்கப்பட்டு ஒவ்வொரு திருப்பத்தையும் சேர்த்தது. சேதம் பயன்படுத்தப்படுவதற்கு முன்பு இயக்கம் தீர்க்கப்படுகிறது. மற்ற AP விளையாட்டுகளைப் போலல்லாமல், வீரர்கள் ராசினாமா அல்லது நேரம் முடிந்தது என்றால், விளையாட்டு உடனடியாக முடிவடையாது. அதற்கு பதிலாக, அவர்கள் அகற்றப்பட்டு அவர்களின் ரோபோ செயலற்றதாக மாறும், ஆனால் மற்ற வீரர்கள் விளையாடலாம்.

# notes.pletore
source: An intersection is controlled by a player if they 'pinch' it while the opponent does not. You 'pinch' an intersection if you have pieces that can see that intersection from two different axes. Your score is the sum of the number of stones of your color on the board and the number of empty points you control, plus a komi bonus and a button bonus. The button is used when the komi value plus the number of intersections on the board is even, and any player may take a turn off and claim the button if it has yet to be claimed. The game ends when both players pass in succession, but claiming the button does not count toward this. Players cannot pass until the entire board is occupied or controlled.
ta: எதிரி இல்லாதபோது ஒரு வீரர் அதை 'கிள்ளி' செய்தால் ஒரு குறுக்குவெட்டு கட்டுப்படுத்தப்படுகிறது. இரண்டு வெவ்வேறு அச்சுகளிலிருந்து அந்த குறுக்குவெட்டைக் காணக்கூடிய துண்டுகள் உங்களிடம் இருந்தால் நீங்கள் ஒரு குறுக்குவெட்டை 'கிள்ளுங்கள்'. உங்கள் மதிப்பெண் பலகையில் உங்கள் வண்ணத்தின் கற்களின் எண்ணிக்கை மற்றும் நீங்கள் கட்டுப்படுத்தும் வெற்று புள்ளிகளின் எண்ணிக்கை, மேலும் கோமி போனச் மற்றும் ஒரு பொத்தான் போனச் ஆகும். கோமி மதிப்பு மற்றும் பலகையில் உள்ள குறுக்குவெட்டுகளின் எண்ணிக்கை சமமாக இருக்கும்போது பொத்தானைப் பயன்படுத்துகிறது, மேலும் எந்தவொரு வீரரும் இன்னும் கோரப்படாவிட்டால் பொத்தானைக் கோரலாம். இரு வீரர்களும் அடுத்தடுத்து கடந்து செல்லும்போது விளையாட்டு முடிவடைகிறது, ஆனால் பொத்தானைக் கோருவது இதை நோக்கி கணக்கிடாது. முழு பலகையும் ஆக்கிரமிக்கும் அல்லது கட்டுப்படுத்தும் வரை வீரர்கள் கடந்து செல்ல முடியாது.

# notes.queensland
source: After the first game completes, the board resets and you play a second game but with blue playing first. Highest combined score wins.
ta: முதல் ஆட்டம் முடிந்ததும், போர்டு மீட்டமைக்கிறது, நீங்கள் இரண்டாவது ஆட்டத்தை விளையாடுகிறீர்கள், ஆனால் ப்ளூ முதலில் விளையாடுகிறீர்கள். அதிக ஒருங்கிணைந்த மதிப்பெண் வெற்றிகள்.

# notes.quincunx
source: A game consists of as many rounds as there are players. Highest accumulated score wins. Basic scoring: For each orthogonally adjacent card, add the ranks together. * 2-9 w/ matching Ace: gain, otherwise lose * 10: no effect * 11: draw a card * 12-19: gain sum - 10 * 20: draw a card Pairs: For each orthogonally adjacent card that is the same rank, gain 5 points. (**Exception:** If that pair is also part of a set, it does *not* also score as a pair.) Sets: If the placed card creates a line (including diagonal) of three *or more* cards of the same rank, gain 30 pts for each line. Straights: If the placed card creates or extends sequence of three or more cards in rank order along a line (including diagonal), gain 20 points for each line. Power play: If you played an Ace or Crown orthogonally adjacent to the matching Ace or Crown, score the number of points equal to the sum of the ranks of all the *other* cards in the tableau that share that suit. More information on the Decktet system can be found on the [official Decktet website](https://www.decktet.com). Cards in players' hands are hidden from observers and opponents.
ta: ஒரு விளையாட்டு வீரர்கள் இருப்பதால் பல சுற்றுகள் உள்ளன. அதிக திரட்டப்பட்ட மதிப்பெண் வெற்றிகள். அடிப்படை மதிப்பெண்: ஒவ்வொரு ஆர்த்தோகனலி அருகிலுள்ள அட்டைக்கும், அணிகளை ஒன்றாகச் சேர்க்கவும். * 2-9 w/ பொருந்தும் ACE: ஆதாயம், இல்லையெனில் இழக்க * 10: எந்த விளைவும் இல்லை * 11: ஒரு அட்டையை வரையவும் * 12-19: லாபம் - 10 * 20: ஒரு அட்டையை வரையவும் சோடிகள்: ஒரே தரவரிசையில் உள்ள ஒவ்வொரு ஆர்த்தோகனலி அருகிலுள்ள அட்டைக்கும், 5 புள்ளிகளைப் பெறுங்கள். . செட்: வைக்கப்பட்ட அட்டை ஒரே தரவரிசையின் மூன்று * அல்லது அதற்கு மேற்பட்ட * அட்டைகளின் ஒரு வரியை (மூலைவிட்டம் உட்பட) உருவாக்கினால், ஒவ்வொரு வரிக்கும் 30 புள்ளிகளைப் பெறுங்கள். ச்ட்ரெய்ட்ச்: வைக்கப்பட்ட அட்டை மூன்று அல்லது அதற்கு மேற்பட்ட அட்டைகளின் வரிசையை ஒரு வரியுடன் (மூலைவிட்ட உட்பட) உருவாக்கினால் அல்லது நீட்டித்தால், ஒவ்வொரு வரிக்கும் 20 புள்ளிகளைப் பெறுங்கள். பவர் பிளே: நீங்கள் பொருந்தக்கூடிய ஏச் அல்லது கிரீடத்திற்கு அருகில் ஒரு ஏச் அல்லது கிரீடம் ஆர்த்தோகனலி விளையாடியிருந்தால், அந்த பொருத்தத்தைப் பகிர்ந்து கொள்ளும் அட்டவணையில் உள்ள அனைத்து * பிற * அட்டைகளின் தொகையின் தொகைக்கு சமமான புள்ளிகளின் எண்ணிக்கையை மதிப்பெண் செய்யுங்கள். டெக்டெட் அமைப்பு பற்றிய கூடுதல் தகவல்களை [அதிகாரப்பூர்வ டெக்டெட் வலைத்தளம்] (https://www.decktet.com) இல் காணலாம். வீரர்களின் கைகளில் உள்ள அட்டைகள் பார்வையாளர்கள் மற்றும் எதிரிகளிடமிருந்து மறைக்கப்பட்டுள்ளன.

# notes.razzle
source: The implementation here is the so called tournament rules.
ta: இங்கே செயல்படுத்தப்படுவது போட்டி விதிகள் என்று அழைக்கப்படுகிறது.

# notes.rootbound
source: The estimated score shows the scores that the board would resolve to if the game were to end in the current board state. Consequently, the first player who forms a partition will briefly appear to have a maximum score. This will correct itself over the course of the game. The implementation currently only provides beginner protection for the first move of the game. Be careful not to merge down to one Dead Group.
ta: தற்போதைய வாரிய மாநிலத்தில் விளையாட்டு முடிவடைந்தால் வாரியம் தீர்க்கும் மதிப்பெண்களை மதிப்பிடப்பட்ட மதிப்பெண் காட்டுகிறது. இதன் விளைவாக, ஒரு பகிர்வை உருவாக்கும் முதல் வீரருக்கு சுருக்கமாக அதிகபட்ச மதிப்பெண் இருப்பதாகத் தோன்றும். இது விளையாட்டின் போது தன்னை சரிசெய்யும். செயல்படுத்தல் தற்போது விளையாட்டின் முதல் நகர்வுக்கு தொடக்க பாதுகாப்பை மட்டுமே வழங்குகிறது. ஒரு இறந்த குழுவில் ஒன்றிணைக்காமல் கவனமாக இருங்கள்.

# notes.siegeofj
source: More information on the Decktet system can be found on the [official Decktet website](https://www.decktet.com). Cards in players' hands are hidden from observers, and they are hidden from opponents until the deck is empty, at which point the players have perfect information, so the hands are revealed.
ta: டெக்டெட் அமைப்பு பற்றிய கூடுதல் தகவல்களை [அதிகாரப்பூர்வ டெக்டெட் வலைத்தளம்] (https://www.decktet.com) இல் காணலாம். வீரர்களின் கைகளில் உள்ள அட்டைகள் பார்வையாளர்களிடமிருந்து மறைக்கப்பட்டுள்ளன, மேலும் அவை டெக் காலியாக இருக்கும் வரை எதிரிகளிடமிருந்து மறைக்கப்பட்டுள்ளன, அந்த நேரத்தில் வீரர்களுக்கு சரியான தகவல்கள் உள்ளன, எனவே கைகள் வெளிப்படுகின்றன.

# notes.spire
source: In this implementation, if you select only one space, it assumes that you placed the ball of your colour, and if you select two spaces, the first space is for the neutral ball and the second space is for the ball of your colour. If the first click is on a space where only one of the neutral ball or the ball of your colour is valid, it will automatically commit that ball.
ta: இந்த செயல்பாட்டில், நீங்கள் ஒரு இடத்தை மட்டுமே தேர்ந்தெடுத்தால், உங்கள் வண்ணத்தின் பந்தை நீங்கள் வைத்தீர்கள் என்று கருதுகிறது, மேலும் நீங்கள் இரண்டு இடங்களைத் தேர்ந்தெடுத்தால், முதல் இடம் நடுநிலை பந்துக்கானது, இரண்டாவது இடம் உங்கள் வண்ணத்தின் பந்துக்கானது. முதல் சொடுக்கு நடுநிலை பந்தில் ஒன்று அல்லது உங்கள் வண்ணத்தின் பந்து மட்டுமே செல்லுபடியாகும் இடத்தில் இருந்தால், அது தானாகவே அந்த பந்தை செய்யும்.

# notes.spook
source: When using the randomised board setup, the only fairness heuristics that we currently have are that (1) the number of balls in solid 5-ball pyramids of the same colour are equal for both players and (2), the second-highest layer must contain balls of both colours. Feel free to contact us on Discord if you think of other ways to make the game fairer.
ta: சீரற்ற பலகை அமைப்பைப் பயன்படுத்தும் போது, தற்போது நம்மிடம் உள்ள ஒரே நியாயமான இயூரிச்டிக்ச் என்னவென்றால் (1) ஒரே நிறத்தின் திட 5-பால் பிரமிடுகளில் உள்ள பந்துகளின் எண்ணிக்கை இரு வீரர்களுக்கும் சமம் மற்றும் (2), இரண்டாவது மிக உயர்ந்த அடுக்கு வேண்டும் இரண்டு வண்ணங்களின் பந்துகளையும் கொண்டிருக்கும். விளையாட்டை அழகாக மாற்றுவதற்கான பிற வழிகளைப் பற்றி நீங்கள் நினைத்தால், முரண்பாட்டில் எங்களை தொடர்பு கொள்ள தயங்க.

# notes.spree
source: We use 1, 2, 3 to denote the three colours. The neutral colour for the wild ball is colour 3. 1 and 2 are red and blue respectively by default, and 3 is green by default.
ta: மூன்று வண்ணங்களைக் குறிக்க 1, 2, 3 ஐப் பயன்படுத்துகிறோம். காட்டு பந்துக்கான நடுநிலை நிறம் வண்ணம்.

# notes.stigmergy
source: You control a space if more than half of the lines of sight to it end at a piece of your color. Your score is the sum of the number of pieces of your color on the board and the number of empty spaces you control, plus a komi bonus and a button bonus. The button is used when the komi value plus the number of spaces on the board is even, and any player may take a turn off and claim the button if it has yet to be claimed. The game ends when both players pass in succession, but claiming the button does not count toward this. Players cannot pass until the entire board is occupied or controlled.
ta: பார்வைக்கு பாதிக்கும் மேற்பட்டவை உங்கள் நிறத்தின் ஒரு பகுதியில் முடிந்தால் நீங்கள் ஒரு இடத்தை கட்டுப்படுத்துகிறீர்கள். உங்கள் மதிப்பெண் பலகையில் உங்கள் வண்ணத்தின் துண்டுகளின் எண்ணிக்கை மற்றும் நீங்கள் கட்டுப்படுத்தும் வெற்று இடங்களின் எண்ணிக்கை, மேலும் கோமி போனச் மற்றும் ஒரு பொத்தான் போனச் ஆகும். கோமி மதிப்பு மற்றும் பலகையில் உள்ள இடைவெளிகளின் எண்ணிக்கை சமமாக இருக்கும்போது பொத்தானைப் பயன்படுத்துகிறது, மேலும் எந்தவொரு வீரரும் இன்னும் கோரப்படாவிட்டால் பொத்தானைக் கோரலாம். இரு வீரர்களும் அடுத்தடுத்து கடந்து செல்லும்போது விளையாட்டு முடிவடைகிறது, ஆனால் பொத்தானைக் கோருவது இதை நோக்கி கணக்கிடாது. முழு பலகையும் ஆக்கிரமிக்கும் அல்லது கட்டுப்படுத்தும் வரை வீரர்கள் கடந்து செல்ல முடியாது.

# notes.tablero
source: When it's your turn, you will see the dice you have to work with, but once your move is complete, the dice will reroll. Exploration is not helpful because the dice roll is not finalized until after the move is submitted. As you scroll back through the game history, the dice you see are the dice for the *next* turn. The dice used to make the move you're seeing are displayed below the board. While most moves can be unambiguously made by simple clicks, sometimes a button is more helpful. The Place, Take, and Bump buttons to the left of the board are there if you need them.
ta: இது உங்கள் முறை போது, நீங்கள் வேலை செய்ய வேண்டிய பகடைகளை நீங்கள் காண்பீர்கள், ஆனால் உங்கள் நகர்வு முடிந்ததும், பகடை மீண்டும் தீர்க்கப்படும். ஆய்வு உதவாது, ஏனெனில் நகர்வு சமர்ப்பிக்கப்படும் வரை டைச் ரோல் இறுதி செய்யப்படவில்லை. விளையாட்டு வரலாற்றை நீங்கள் மீண்டும் உருட்டும்போது, நீங்கள் பார்க்கும் பகடை * அடுத்த * திருப்பத்திற்கான பகடை. நீங்கள் பார்க்கும் நகர்வைச் செய்ய பயன்படுத்தப்படும் பகடை பலகைக்கு கீழே காட்டப்படும். பெரும்பாலான நகர்வுகள் எளிய கிளிக்குகளால் சந்தேகத்திற்கு இடமின்றி செய்யப்படலாம் என்றாலும், சில நேரங்களில் ஒரு பொத்தான் மிகவும் உதவியாக இருக்கும். உங்களுக்கு தேவைப்பட்டால், பலகையின் இடதுபுறத்தில் உள்ள இடம், எடுத்து, பம்ப் பொத்தான்கள் உள்ளன.

# notes.tafl
source: The variant names are in the format {ruleset}-{board size}-{initial layout}-{optional: starting player}. For example, 'linnaean-9x9-tcross-w' is the linnaean rules on a 9x9 board with T-cross setup, and the starting player is the defenders. If starting player is not mentioned, then attackers start.
ta: மாறுபாடு பெயர்கள் {ruleset}-{board size}-{initial layout}-{optional: starting player} வடிவத்தில் உள்ளன. எடுத்துக்காட்டாக, 'லின்னேயன் -9x9-tcrors-w' என்பது டி-கிராச் அமைப்பைக் கொண்ட 9x9 போர்டில் உள்ள லின்னேயன் விதிகள், மற்றும் தொடக்க வீரர் பாதுகாவலர்கள். தொடக்க வீரர் குறிப்பிடப்படவில்லை என்றால், தாக்குதல் நடத்தியவர்கள் தொடங்குகிறார்கள்.

# notes.taiji
source: Moves are done with two clicks. The first tile you place is always the light one, and then the dark one.
ta: நகர்வுகள் இரண்டு கிளிக்குகளுடன் செய்யப்படுகின்றன. நீங்கள் வைக்கும் முதல் ஓடு எப்போதும் ஒளி, பின்னர் இருண்டது.

# notes.tbt
source: When it's your turn, you will see the die you have to work with, but once your move is complete, the die will reroll. Exploration is not helpful because the die roll is not finalized until after the move is submitted. As you scroll back through the game history, the die you see is for the *next* turn. The die used to make the move you're seeing is displayed below the board.
ta: இது உங்கள் முறை போது, நீங்கள் வேலை செய்ய வேண்டிய இறப்பைக் காண்பீர்கள், ஆனால் உங்கள் நகர்வு முடிந்ததும், இறப்பு மீண்டும் தீர்க்கப்படும். ஆய்வு உதவாது, ஏனெனில் நடவடிக்கை சமர்ப்பிக்கப்படும் வரை டை ரோல் இறுதி செய்யப்படவில்லை. விளையாட்டு வரலாற்றை நீங்கள் மீண்டும் உருட்டும்போது, நீங்கள் பார்க்கும் இறப்பு * அடுத்த * திருப்பத்திற்காக. நீங்கள் பார்க்கும் நகர்வைச் செய்யப் பயன்படும் இறப்பு பலகைக்கு கீழே காட்டப்படும்.

# notes.terrace
source: The Assassination variant is described in [this BGG thread](https://boardgamegeek.com/thread/551125/variant-for-more-aggressive-less-drawish-play), summarized below: - Up straight, you must be larger or a smallest-size piece can assassinate a largest-size piece. - Same level (orthogonally adjacent only), you must be at least the same size. - Down diagonal, you may be one rank smaller.
ta: படுகொலை மாறுபாடு [இந்த BGG நூல்] (https://boardgamegeek.com/thread/551125/variant-for-more-aguressive-dess-drawish-play) இல் விவரிக்கப்பட்டுள்ளது, இது கீழே சுருக்கப்பட்டுள்ளது: -நேராக, நீங்கள் பெரியதாக இருக்க வேண்டும் அல்லது மிகச்சிறிய அளவிலான துண்டு மிகப்பெரிய அளவிலான பகுதியை படுகொலை செய்யலாம். - அதே நிலை (ஆர்த்தோகனலி அருகில் மட்டும்), நீங்கள் குறைந்தபட்சம் ஒரே அளவாக இருக்க வேண்டும். - மூலைவிட்டத்தில், நீங்கள் ஒரு தரவரிசை சிறியவராக இருக்கலாம்.

# notes.toguz
source: Depicting state changes in sowing games is challenging. The initial chosen pit is marked, as is any capture. Small numbers appear to show the change in the number of stones in each pit. If you believe you have encountered a bug, please let us know in Discord.
ta: விதைப்பதில் மாநில மாற்றங்களை சித்தரிப்பது சவாலானது. எந்தவொரு பிடிப்பையும் போலவே ஆரம்ப தேர்ந்தெடுக்கப்பட்ட குழி குறிக்கப்பட்டுள்ளது. ஒவ்வொரு குழியிலும் கற்களின் எண்ணிக்கையில் மாற்றத்தைக் காட்ட சிறிய எண்கள் தோன்றும். நீங்கள் ஒரு பிழையை சந்தித்ததாக நீங்கள் நம்பினால், தயவுசெய்து எங்களுக்குத் தெரியப்படுத்துங்கள்.

# notes.tumbleweed
source: A space is claimed by a player if they have a piece on it, or if they have the majority of the line of sights to it. The score is the number of territory own by each player. The game ends when both players pass in succession. If there is no change in score for 20 plies, the game also ends.
ta: ஒரு வீரர் அவர்களிடம் ஒரு துண்டு வைத்திருந்தால், அல்லது அதற்கான காட்சிகளின் பெரும்பகுதியைக் கொண்டிருந்தால் ஒரு இடம் கோரப்படுகிறது. மதிப்பெண் என்பது ஒவ்வொரு வீரருக்கும் சொந்தமான பிரதேசத்தின் எண்ணிக்கை. இரு வீரர்களும் அடுத்தடுத்து கடந்து செல்லும்போது விளையாட்டு முடிகிறது. 20 பிளேசுக்கு மதிப்பெண்ணில் எந்த மாற்றமும் இல்லை என்றால், விளையாட்டும் முடிகிறது.

# notes.twixt
source: The notation is based on Hansel notation at <http://www.ibiblio.org/twixtpuzzles/>. Some modifications are that link removal specifically specifies the link direction, and commas separate the moves. To add/remove links, click on the pegs between them. You can also remove a link by clicking on the line itself.
ta: குறியீடு <http://www.ibiblio.org/twixtpuzzles/> இல் ஏன்சல் குறியீட்டை அடிப்படையாகக் கொண்டது. சில மாற்றங்கள் என்னவென்றால், இணைப்பு அகற்றுதல் குறிப்பாக இணைப்பு திசையை குறிப்பிடுகிறது, மேலும் காற்புள்ளிகள் நகர்வுகளை பிரிக்கின்றன. இணைப்புகளைச் சேர்க்க/அகற்ற, அவற்றுக்கிடையேயான ஆப்புகளைக் சொடுக்கு செய்க. வரியில் சொடுக்கு செய்வதன் மூலம் ஒரு இணைப்பை அகற்றலாம்.

# notes.witch
source: The first player does not start as owning any pieces and may remove any piece (other than a crown) on their first turn. The second player chooses their colour on their first turn, after which, removing your opponent's pieces is no longer possible.
ta: முதல் வீரர் எந்த துண்டுகளையும் சொந்தமாக வைத்திருப்பதாகத் தொடங்குவதில்லை, மேலும் முதல் திருப்பத்தில் எந்த பகுதியையும் (கிரீடம் தவிர) அகற்றலாம். இரண்டாவது வீரர் அவர்களின் முதல் திருப்பத்தில் அவர்களின் நிறத்தைத் தேர்வு செய்கிறார், அதன் பிறகு, உங்கள் எதிரியின் துண்டுகளை அகற்றுவது இனி சாத்தியமில்லை.

# variants.abande.hex.description
source: A 37-space hexagonal board.
ta: 37-விண்வெளி அறுகோண பலகை.

# variants.abande.hex.name
source: Board: Hexagonal
ta: பலகை: அறுகோண

# variants.abande.snub.description
source: A hybrid orthogonal/hexagonal board shape with unique connection characteristics.
ta: தனித்துவமான இணைப்பு பண்புகளுடன் ஒரு கலப்பின ஆர்த்தோகனல்/அறுகோண பலகை வடிவம்.

# variants.abande.snub.name
source: Board: Snub Square
ta: போர்டு: ச்னப் சதுக்கம்
