Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# descriptions.tintas
source: Players race to either collect all seven of one colour or to collect four of four different colours.
ta: வீரர்கள் ஒரு வண்ணத்தில் ஏழு சேகரிக்க அல்லது நான்கு வெவ்வேறு வண்ணங்களில் நான்கு சேகரிக்க ஓட்டுகிறார்கள்.

# descriptions.terrace
source: A royal capture/escape game played on a three-dimensional board with pieces of various sizes.
ta: ஒரு அரச பிடிப்பு/தப்பிக்கும் விளையாட்டு முப்பரிமாண பலகையில் பல்வேறு அளவிலான துண்டுகளுடன் விளையாடியது.

# descriptions.toguz
source: A traditional mancala-style sowing game from central Asia where you attempt to capture the majority of the pieces.
ta: நடு ஆசியாவிலிருந்து ஒரு பாரம்பரிய மான்காலா பாணி விதைப்பு விளையாட்டு, அங்கு நீங்கள் பெரும்பான்மையான துண்டுகளைப் பிடிக்க முயற்சிக்கிறீர்கள்.

# descriptions.trax
source: A game of loops and lines. Place tiles adjacent to those already in play such that the colours of the tracks match. The objective is to get a loop or line of your colour while attempting to stop your opponent in their colour. What gives Trax its strategic depth is the forced play rule which allows (or even requires) multiple tiles to be played in a turn.
ta: சுழல்கள் மற்றும் கோடுகளின் விளையாட்டு. தடங்களின் வண்ணங்கள் பொருந்தக்கூடிய வகையில் ஏற்கனவே விளையாடுபவர்களுக்கு அருகிலுள்ள ஓடுகளை வைக்கவும். உங்கள் எதிரியை அவர்களின் நிறத்தில் தடுக்க முயற்சிக்கும்போது உங்கள் வண்ணத்தின் வளையத்தைப் அல்லது வரியைப் பெறுவதே இதன் நோக்கம். ட்ராக்சுக்கு அதன் மூலோபாய ஆழத்தை வழங்குவது கட்டாய விளையாட்டு விதி, இது பல ஓடுகளை ஒரு திருப்பத்தில் இயக்க அனுமதிக்கிறது (அல்லது தேவை).

# descriptions.trike
source: Trike is a game on a triangular board. Players take turn moving a neutral pawn around the board (passing is not allowed). When a player moves the pawn, they place a checker of their own color, onto the destination point. When the pawn is trapped, the game is over. At the end of the game, each player gets a point for each checker of their own color adjacent to, or underneath, the pawn. The person with the highest score wins.
ta: ட்ரைக் என்பது ஒரு முக்கோண பலகையில் ஒரு விளையாட்டு. போர்டைச் சுற்றி ஒரு நடுநிலை சிப்பாயை நகர்த்தும் வீரர்கள் (கடந்து செல்வது அனுமதிக்கப்படவில்லை). ஒரு வீரர் சிப்பாயை நகர்த்தும்போது, அவர்கள் தங்கள் சொந்த வண்ணத்தின் செக்கரை இலக்கு புள்ளியில் வைக்கின்றனர். சிப்பாய் சிக்கும்போது, விளையாட்டு முடிந்துவிட்டது. விளையாட்டின் முடிவில், ஒவ்வொரு வீரரும் தங்கள் சொந்த வண்ணத்தின் ஒவ்வொரு செக்கருக்கும் ஒரு புள்ளியைப் பெறுகிறார்கள். அதிக மதிப்பெண் கொண்ட நபர் செய் பெறுகிறார்.

# descriptions.tritium
source: Two players take turns creating and growing regions and claiming them. Once the board is full, the player who controls most tiles wins.
ta: இரண்டு வீரர்கள் பிராந்தியங்களை உருவாக்கி வளர்ப்பது மற்றும் உரிமை கோருகிறார்கள். பலகை நிரம்பியதும், பெரும்பாலான ஓடுகளைக் கட்டுப்படுத்தும் வீரர் செய் பெறுவார்.

# descriptions.tumbleweed
source: Tumbleweed is a game of line of sight. Towers are built, and cells are controlled by the player with the most towers that can see that cell. Compete to control the majority of the hexagonal board.
ta: டம்பிள்வீட் என்பது பார்வைக் கோட்டின் விளையாட்டு. கோபுரங்கள் கட்டப்பட்டுள்ளன, மேலும் செல்கள் அந்த கலத்தைக் காணக்கூடிய மிக கோபுரங்களுடன் பிளேயரால் கட்டுப்படுத்தப்படுகின்றன. அறுகோண வாரியத்தின் பெரும்பகுதியைக் கட்டுப்படுத்த போட்டியிடுங்கள்.

# descriptions.twixt
source: Twixt is a connection game where players alternate turns placing pegs and links on a pegboard in an attempt to link their opposite sides.
ta: ட்விக்ச்ட் என்பது ஒரு இணைப்பு விளையாட்டு, அங்கு வீரர்கள் தங்கள் எதிர் பக்கங்களை இணைக்கும் முயற்சியில் ஒரு பெக்போர்டில் ஆப்புகளையும் இணைப்புகளையும் வைப்பார்கள்.

# descriptions.unlur
source: An asymmetric connection game where one player tries to form a Y and the other tries to connect opposite sides. Achieving the opponent's goal without achieving your own is a loss. The game starts with a contract phase where both players place the colour of the Y player until someone passes, and then the opponent becomes the Line player.
ta: ஒரு வீரர் ஒரு ஒய் ஐ உருவாக்க முயற்சிக்கும் ஒரு சமச்சீரற்ற இணைப்பு விளையாட்டு, மற்றொன்று எதிர் பக்கங்களை இணைக்க முயற்சிக்கிறது. உங்கள் சொந்தத்தை அடையாமல் எதிரியின் இலக்கை அடைவது ஒரு இழப்பு. யாரோ ஒருவர் கடந்து செல்லும் வரை இரு வீரர்களும் ஒய் பிளேயரின் நிறத்தை வைப்பார்கள், பின்னர் எதிர்ப்பாளர் வரி வீரராக மாறுகிறார்.

# descriptions.upperhand
source: A shedding game where you try to be the first to place all your pieces. If a platform is created and at least three of the pieces are of a player's colour, an additional piece of that colour is automatically placed on top of it, causing chain reactions. The pie rule applies.
ta: உங்கள் எல்லா பகுதிகளையும் முதலில் வைக்க முயற்சிக்கும் ஒரு உதிர்தல் விளையாட்டு. ஒரு தளம் உருவாக்கப்பட்டு, குறைந்தது மூன்று துண்டுகள் ஒரு வீரரின் நிறமாக இருந்தால், அந்த வண்ணத்தின் கூடுதல் துண்டு தானாகவே அதன் மேல் வைக்கப்படும், இதனால் சங்கிலி எதிர்வினைகள் ஏற்படுகின்றன. பை விதி பொருந்தும்.

# descriptions.urbino
source: In Urbino, one manipulates architects (like in the game Fabrik) to build districts of different building types according to a handful of placement rules. When no more moves are possible, districts are scored, and the highest score wins. Also includes the "Monuments" variant.
ta: அர்பினோவில், ஒரு சில வேலைவாய்ப்பு விதிகளின்படி வெவ்வேறு கட்டிட வகைகளின் மாவட்டங்களை உருவாக்க ஒரு கட்டடக் கலைஞர்களை (விளையாட்டு ஃபேப்ரிக் போன்றது) கையாளுகிறது. அதிக நகர்வுகள் சாத்தியமில்லை, மாவட்டங்கள் அடித்தன, அதிக மதிப்பெண் செய் பெறுகின்றன. "நினைவுச்சின்னங்கள்" மாறுபாடும் அடங்கும்.

# descriptions.valley
source: Get your king to the center space, but your pieces must always move as far as they can. Teamwork is essential.
ta: உங்கள் ராசாவை மைய இடத்திற்கு அழைத்துச் செல்லுங்கள், ஆனால் உங்கள் துண்டுகள் எப்போதும் தங்களால் முடிந்தவரை நகர வேண்டும். குழுப்பணி தேவை.

# descriptions.veletas
source: Drawless territory game where players control a number of neutral shooters and shoot stones of their own colour from them. In order to win, a player must claim a majority of neutral pieces by having them surrounded by larger groups of their own pieces than their opponent's.
ta: வீரர்கள் பல நடுநிலை துப்பாக்கி சுடும் வீரர்களைக் கட்டுப்படுத்துகிறார்கள் மற்றும் அவர்களிடமிருந்து தங்கள் சொந்த வண்ணத்தின் கற்களை சுடும். வெற்றிபெற, ஒரு வீரர் பெரும்பான்மையான நடுநிலை துண்டுகளை தங்கள் எதிரியை விட தங்கள் சொந்த துண்டுகளின் பெரிய குழுக்களால் சூழப்பட்டிருப்பதன் மூலம் கோர வேண்டும்.

# descriptions.verge
source: Verge is a game where players attempt to create groups that partition the board, freezing those groups and removing enemy groups. The first player to have no legal placement wins.
ta: வெர்ச் என்பது வீரர்கள் குழுவைப் பிரிக்கும் குழுக்களை உருவாக்க முயற்சிக்கும் ஒரு விளையாட்டு, அந்தக் குழுக்களை முடக்கி, எதிரி குழுக்களை அகற்றும். சட்டபூர்வமான வேலைவாய்ப்பு இல்லாத முதல் வீரர் செய் பெறுகிறார்.

# descriptions.volcano
source: An Icehouse puzzle game for 2 players. Stacks of pyramids are volcanos, some of which are capped. As you move caps around, you cause eruptions that may lead to you capturing pieces. The winner is the first to capture a certain number of trios.
ta: 2 வீரர்களுக்கு ஒரு ஐச்அவுச் புதிர் விளையாட்டு. பிரமிடுகளின் அடுக்குகள் எரிமலைகள், அவற்றில் சில மூடியவை. நீங்கள் தொப்பிகளைச் சுற்றி நகர்த்தும்போது, நீங்கள் வெடிப்புகளை ஏற்படுத்தும், அவை துண்டுகளை கைப்பற்ற வழிவகுக்கும். ஒரு குறிப்பிட்ட எண்ணிக்கையிலான மூவரும் முதன்முதலில் கைப்பற்றியவர் வெற்றியாளர்.

# descriptions.volo
source: Volo was inspired by the beauty of birds flying in flocks. Each player in turn places a piece or moves one or more pieces (here called 'birds') on the board and attempts to connect them all in one contiguous 'flock.' If a player ends up with one contiguous flock (of any size), he wins.
ta: மந்தைகளில் பறக்கும் பறவைகளின் அழகால் வோலோ ஈர்க்கப்பட்டது. ஒவ்வொரு வீரரும் ஒரு பகுதியை வைக்கிறார்கள் அல்லது ஒன்று அல்லது அதற்கு மேற்பட்ட துண்டுகளை (இங்கே 'பறவைகள்' என்று அழைக்கப்படுகிறார்கள்) போர்டில் நகர்த்துகிறார்கள், மேலும் அவை அனைத்தையும் ஒரே மாதிரியான 'மந்தையில்' இணைக்க முயற்சிக்கிறார்கள். ஒரு வீரர் ஒரு தொடர்ச்சியான மந்தையுடன் (எந்த அளவிலும்) முடிவடைந்தால், அவர் செய் பெறுவார்.

# descriptions.witch
source: Four types of pieces are arrayed randomly on a grid. Each player takes turns removing pieces until one reaches a score of 50.
ta: நான்கு வகையான துண்டுகள் ஒரு கட்டத்தில் தோராயமாக வரிசைப்படுத்தப்படுகின்றன. ஒவ்வொரு வீரரும் 50 மதிப்பெண்களை அடையும் வரை துண்டுகளை அகற்றும் திருப்பங்களை எடுக்கிறார்கள்.

# descriptions.wyke
source: A two-player game where one plays the builder and the other the destroyer. Claim cells by either completing or completely destroying lots. Win a certain number of lots or lots in a particular pattern to win.
ta: இரண்டு வீரர்களின் விளையாட்டு, அங்கு ஒருவர் பில்டர் மற்றும் மற்றவர் அழிப்பவர் விளையாடுகிறார். இடங்களை நிறைவு செய்வதன் மூலம் அல்லது முழுமையாக அழிப்பதன் மூலம் கலங்களை கோரவும். வெற்றிபெற ஒரு குறிப்பிட்ட வடிவத்தில் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான நிறைய அல்லது இடங்களை வெல்லுங்கள்.

# descriptions.yavalath
source: Form a line of four or more pieces of your colour *without* forming a line of three pieces first.
ta: முதலில் மூன்று துண்டுகளின் வரியை உருவாக்காமல் உங்கள் வண்ணத்தின் நான்கு அல்லது அதற்கு மேற்பட்ட துண்டுகளின் ஒரு வரியை உருவாக்கவும்.

# descriptions.yonmoque
source: Try to form four in a row in a game where not all spaces are equal and opposing pieces can be converted.
ta: எல்லா இடங்களும் சமமாக இல்லாத மற்றும் எதிரெதிர் துண்டுகளை மாற்றக்கூடிய ஒரு விளையாட்டில் ஒரு வரிசையில் நான்கு ஒன்றை உருவாக்க முயற்சிக்கவும்.

# descriptions.zola
source: A game where your movement is constrained by your distance from the centre of the board. Capturing moves must not increase that distance. Non-capturing moves must increase that distance. First person to capture all opposing pieces wins.
ta: பலகையின் மையத்திலிருந்து உங்கள் தூரத்தால் உங்கள் இயக்கம் கட்டுப்படுத்தப்படும் ஒரு விளையாட்டு. நகர்வுகளைப் பிடிப்பது அந்த தூரத்தை அதிகரிக்கக்கூடாது. கைப்பற்றப்படாத நகர்வுகள் அந்த தூரத்தை அதிகரிக்க வேண்டும். அனைத்து எதிரெதிர் துண்டுகளையும் கைப்பற்றும் முதல் நபர் செய் பெறுகிறார்.

# notes.alta
source: There are two ways to place switches on the graphical interface: (1) Select the switch’s orientation in the panel, then click on the desired space on the board to place it, or (2) click on two vertices. The vertices are notated with an asterisk, followed by the algebraic notation of the space where the vertex is at the bottom-left corner. To toggle a switch, simply click on the space.
ta: வரைகலை இடைமுகத்தில் சுவிட்சுகளை வைக்க இரண்டு வழிகள் உள்ளன: (1) பேனலில் சுவிட்சின் நோக்குநிலையைத் தேர்ந்தெடுத்து, அதை வைக்க பலகையில் விரும்பிய இடத்தைக் சொடுக்கு செய்க, அல்லது (2) இரண்டு செங்குத்துகளைக் சொடுக்கு செய்க. செங்குத்துகள் ஒரு நட்சத்திரத்துடன் குறிப்பிடப்படுகின்றன, அதன்பிறகு வெர்டெக்ச் கீழ்-இடது மூலையில் இருக்கும் இடத்தின் இயற்கணித குறியீடு. ஒரு சுவிட்சை மாற்ற, இடத்தைக் சொடுக்கு செய்க.

# notes.anache
source: This implementation follows David Ploog's rulesheet. Three notable changes are that (1) barriers are forbidden, (2) instead of a 16x16, we have a 15x15 variant, where pieces promote to knights on the centreline, and the dragon may not jump to the 7x7 space from the other corner, and (3) against the corners, pieces are captured via crushing capture instead of custodian capture, so there needs to be at least two opponent pieces in a line before a capture is made against the corners. Note: the stalemate check is expensive. If you cannot make a legal move, you should resign manually.
ta: இந்த செயல்படுத்தல் டேவிட் ப்ளூக்கின் ஆட்சியைப் பின்பற்றுகிறது. மூன்று குறிப்பிடத்தக்க மாற்றங்கள் என்னவென்றால், (1) தடைகள் தடைசெய்யப்பட்டுள்ளன, (2) 16x16 க்கு பதிலாக, எங்களிடம் 15x15 மாறுபாடு உள்ளது, அங்கு துண்டுகள் சென்ட்ர்லைனில் மாவீரர்களை ஊக்குவிக்கின்றன, மேலும் டிராகன் மற்ற மூலையில் இருந்து 7x7 இடத்திற்கு செல்லக்கூடாது, (3) மூலைகளுக்கு எதிராக, இரண்டு துண்டுகள் இருப்பதற்கு பதிலாக, கச்ட்டியன்களுக்கு பதிலாக, ஒரு கச்ட்டியன்களுக்குப் பதிலாக, ஒரு கச்ட்டியன்களே மூலைகளுக்கு எதிராக செய்யப்பட்டது. குறிப்பு: முட்டுக்கட்டை சோதனை விலை உயர்ந்தது. நீங்கள் சட்டப்பூர்வ நடவடிக்கை எடுக்க முடியாவிட்டால், நீங்கள் கைமுறையாக ராசினாமா செய்ய வேண்டும்.

# notes.armadas
source: There are known issues with this game on iOS devices. This game offers two scenarios: * The default is each player having two trios of pieces. In the placement phase, each player must place 1 to 3 ships until all ships are placed. * The "Freeform" variant allows you to place whatever ships you want (maximum of three at a time) until both players "pass." This lets you create unbalanced or otherwise asymmetrical fleets. Games default to having one island in the centre of the field. Both a "no islands" and a "two islands" variant are available. You cannot move or fire through islands. To successfully hit a ship, at least one corner of your ship's triangle must have a clear view of at least one corner of the target ship. Remember that it is possible to get your ship in a position against an island or the edge of the board such that you can no longer move that ship! Be careful!
ta: ஐஇமு சாதனங்களில் இந்த விளையாட்டில் அறியப்பட்ட சிக்கல்கள் உள்ளன. இந்த விளையாட்டு இரண்டு காட்சிகளை வழங்குகிறது: * இயல்புநிலை ஒவ்வொரு வீரருக்கும் இரண்டு மூவரும் துண்டுகள் உள்ளன. வேலை வாய்ப்பு கட்டத்தில், ஒவ்வொரு வீரரும் அனைத்து கப்பல்களும் வைக்கப்படும் வரை 1 முதல் 3 கப்பல்களை வைக்க வேண்டும். * இரு வீரர்களும் "கடந்து செல்லும் வரை" நீங்கள் விரும்பும் கப்பல்களை (ஒரு நேரத்தில் அதிகபட்சம் மூன்று) வைக்க "ஃப்ரீஃபார்ம்" மாறுபாடு உங்களை அனுமதிக்கிறது. இது சமநிலையற்ற அல்லது சமச்சீரற்ற கடற்படைகளை உருவாக்க உங்களை அனுமதிக்கிறது. களத்தின் மையத்தில் ஒரு தீவை வைத்திருப்பதற்கு விளையாட்டுகள் இயல்புநிலை. "தீவுகள் இல்லை" மற்றும் "இரண்டு தீவுகள்" மாறுபாடு இரண்டும் கிடைக்கின்றன. நீங்கள் தீவுகள் வழியாக நகர்த்தவோ அல்லது சுடவோ முடியாது. ஒரு கப்பலை வெற்றிகரமாக அடிக்க, உங்கள் கப்பலின் முக்கோணத்தின் குறைந்தது ஒரு மூலையாவது இலக்கு கப்பலின் குறைந்தது ஒரு மூலையாவது தெளிவான பார்வையைக் கொண்டிருக்க வேண்டும். உங்கள் கப்பலை ஒரு தீவுக்கு எதிராக அல்லது பலகையின் விளிம்பில் பெற முடியும் என்பதை நினைவில் கொள்ளுங்கள், அதாவது நீங்கள் இனி அந்தக் கப்பலை நகர்த்த முடியாது! கவனமாக இருங்கள்!

# notes.ataxx
source: On three-fold repetition, the game ends and the scores are calculated.
ta: மூன்று மடங்கு மறுபடியும் மறுபடியும், விளையாட்டு முடிவடைகிறது மற்றும் மதிப்பெண்கள் கணக்கிடப்படுகின்றன.

# notes.bao
source: Moves in Bao can be very complex, involving multiple laps around the board and changing directions. The annotations are, therefore, sparse. The initial cell and direction are highlighted, and captured cells are also marked. But detailed annotation of movement is not possible. If you believe you have encountered a bug, please let us know in Discord.
ta: BAO இல் உள்ள நகர்வுகள் மிகவும் சிக்கலானதாக இருக்கும், இதில் பலகையைச் சுற்றி பல மடியில் மற்றும் திசைகளை மாற்றும். எனவே, சிறுகுறிப்புகள் குறைவாகவே உள்ளன. ஆரம்ப செல் மற்றும் திசை முன்னிலைப்படுத்தப்படுகிறது, மேலும் கைப்பற்றப்பட்ட கலங்களும் குறிக்கப்பட்டுள்ளன. ஆனால் இயக்கத்தின் விரிவான சிறுகுறிப்பு சாத்தியமில்லை. நீங்கள் ஒரு பிழையை சந்தித்ததாக நீங்கள் நம்பினால், தயவுசெய்து எங்களுக்குத் தெரியப்படுத்துங்கள்.

# notes.biscuit
source: Game ends when, at the end of a round, someone has reached or surpassed the target score. Highest score wins. Draws are possible. When calculating biscuits, a single card cannot be counted more than once. For example, if the root card is a 6, and the end of the main line is also a 6 (a cross card), and you play a 6 above that cross card, you score the "hot cross biscuit" (top and bottom of the cross line match) but you don't *also* get a regular "biscuit" for matching the end of the main line (they're both the same card). Furthermore, cross lines don't get counted at all unless there are at least two cards in the line. So playing a new cross card (in our example, a 6) does not automatically score you a "biscuit" (playing a card on the main line that matches a cross line). More information on the Decktet system can be found on the [official Decktet website](https://www.decktet.com). Cards in players' hands are hidden from observers and opponents.
ta: ஒரு சுற்றின் முடிவில், யாரோ இலக்கு மதிப்பெண்ணை அடைந்துவிட்டார்கள் அல்லது விஞ்சும்போது விளையாட்டு முடிகிறது. அதிக மதிப்பெண் வெற்றிகள். டிராக்கள் நிகழக்கூடிய. பிச்கட்டுகளை கணக்கிடும்போது, ஒரு அட்டையை ஒன்றுக்கு மேற்பட்ட முறை கணக்கிட முடியாது. எடுத்துக்காட்டாக, ரூட் அட்டை 6 ஆக இருந்தால், முதன்மையான வரியின் முடிவும் 6 (ஒரு குறுக்கு அட்டை) ஆக இருந்தால், அந்த குறுக்கு அட்டைக்கு மேலே 6 விளையாடுகிறீர்கள் என்றால், நீங்கள் "ஆட் கிராச் பிச்கட்" (குறுக்கு கோடு பொருத்தத்தின் மேல் மற்றும் கீழ்) மதிப்பெண் பெறுகிறீர்கள், ஆனால் நீங்கள் முக்கிய வரியின் முடிவை பொருத்துவதற்கு ஒரு வழக்கமான "பிச்கட்" ஐப் பெறவில்லை (அவை இரண்டும் ஒரே மாதிரியானவை). மேலும், வரிசையில் குறைந்தது இரண்டு அட்டைகள் இல்லாவிட்டால் குறுக்கு கோடுகள் கணக்கிடப்படாது. எனவே ஒரு புதிய கிராச் கார்டை விளையாடுவது (எங்கள் எடுத்துக்காட்டில், ஒரு 6) தானாகவே ஒரு "பிச்கட்" (ஒரு குறுக்கு கோட்டுடன் பொருந்தக்கூடிய முதன்மையான வரியில் ஒரு அட்டையை விளையாடுவது) தானாகவே மதிப்பெண் பெறாது. டெக்டெட் அமைப்பு பற்றிய கூடுதல் தகவல்களை [அதிகாரப்பூர்வ டெக்டெட் வலைத்தளம்] (https://www.decktet.com) இல் காணலாம். வீரர்களின் கைகளில் உள்ள அட்டைகள் பார்வையாளர்கள் மற்றும் எதிரிகளிடமிருந்து மறைக்கப்பட்டுள்ளன.

# notes.blooms
source: The threshold value is X(n) = 5n, where n is the base of the hexhex board (e.g., the default board is base 6, so the threshold is 30).
ta: வாசல் மதிப்பு ஃச் (n) = 5n ஆகும், இங்கு n என்பது எக்ச்எக்ச் போர்டின் அடிப்படை (எ.கா., இயல்புநிலை பலகை அடிப்படை 6, எனவே வாசல் 30).

# notes.bug
source: In this implementation, after the initial placement, if the player has bugs that must eat, the edible bugs will be highlighted. Eating and bonus grow will be performed simultaneously, so performing a bonus grow on a bug by selecting a legal space next to it will cause all highlighted edible bugs adjacent to it to disappear. It is possible to bonus grow onto a space that an edible bug is on. Note that this implies that when selecting a bug to perform the eating action, ALL edible bugs of the same shape next to it will be removed, and this might differ from some other implementations where there a separate edible bug selection phase, which may allow some edible bugs to be left behind for another bug to eat.
ta: இந்த செயலாக்கத்தில், ஆரம்ப வேலைவாய்ப்புக்குப் பிறகு, வீரருக்கு சாப்பிட வேண்டிய பிழைகள் இருந்தால், உண்ணக்கூடிய பிழைகள் முன்னிலைப்படுத்தப்படும். சாப்பிடுவது மற்றும் போனச் வளரும் ஒரே நேரத்தில் செய்யப்படும், எனவே ஒரு போனச் வளர்ந்து ஒரு பிழையில் வளரும், அதற்கு அடுத்ததாக ஒரு சட்ட இடத்தைத் தேர்ந்தெடுப்பதன் மூலம் அது அருகிலுள்ள அனைத்து சிறப்பம்சமான உண்ணக்கூடிய பிழைகள் மறைந்துவிடும். ஒரு உண்ணக்கூடிய பிழை இயங்கும் ஒரு இடத்தில் போனச் வளர முடியும். உணவு செயலைச் செய்ய ஒரு பிழையைத் தேர்ந்தெடுக்கும்போது, அதற்கு அடுத்ததாக அதே வடிவத்தின் அனைத்து உண்ணக்கூடிய பிழைகள் அகற்றப்படும் என்பதை இது குறிக்கிறது, மேலும் இது வேறு சில செயலாக்கங்களிலிருந்து வேறுபடலாம், அங்கு ஒரு தனி உண்ணக்கூடிய பிழைத் தேர்வு கட்டம் உள்ளது, இது சில உண்ணக்கூடிய பிழைகள் மற்றொரு பிழையை சாப்பிட அனுமதிக்கக்கூடும்.

# notes.calculus
source: Click on an existing piece to move it, or click on a free point to place a new piece. There must be a sufficiently wide path from some edge of the board to the placement point. If your placed piece would overlap existing pieces, the system will try to "snap" the placed piece so it is touching all overlapped pieces. Dashed lines show pieces that are touching. Solid lines show perimeters around legal areas. Pieces connected by solid lines may not be moved.
ta: அதை நகர்த்த ஏற்கனவே இருக்கும் பகுதியைக் சொடுக்கு செய்க, அல்லது புதிய பகுதியை வைக்க இலவச புள்ளியைக் சொடுக்கு செய்க. பலகையின் சில விளிம்பிலிருந்து வேலைவாய்ப்பு புள்ளி வரை போதுமான பரந்த பாதை இருக்க வேண்டும். உங்கள் வைக்கப்பட்ட துண்டு ஏற்கனவே இருக்கும் துண்டுகளை ஒன்றுடன் ஒன்று சேர்த்தால், கணினி வைக்கப்பட்ட துண்டுகளை "நொறுக்க" முயற்சிக்கும், எனவே அது ஒன்றுடன் ஒன்று துண்டுகளைத் தொடும். கோடு கோடுகள் தொடும் துண்டுகளைக் காட்டுகின்றன. திடமான கோடுகள் சட்டப் பகுதிகளைச் சுற்றி சுற்றளவு காட்டுகின்றன. திடமான கோடுகளால் இணைக்கப்பட்ட துண்டுகள் நகர்த்தப்படாமல் போகலாம்.

# notes.chase
source: Currently, most exchange moves will need to be hand edited. We're working on fixing this.
ta: தற்போது, பெரும்பாலான பரிமாற்ற நகர்வுகள் கை திருத்தப்பட வேண்டும். இதை சரிசெய்ய நாங்கள் பணியாற்றுகிறோம்.

# notes.conspirateurs
source: In the base game, pieces may move through sanctuaries as part of a multistep jump. They're not frozen until they end their move in a sanctuary. In the strict variant, pieces are frozen as soon as they enter a sanctuary. In four-player games, players 1 and 2 are partnered, as are players 3 and 4.
ta: அடிப்படை விளையாட்டில், மல்டிச்டெப் தாவலின் ஒரு பகுதியாக துண்டுகள் சரணாலயங்கள் வழியாக நகரக்கூடும். அவர்கள் ஒரு சரணாலயத்தில் தங்கள் நகர்வை முடிக்கும் வரை அவர்கள் உறைந்திருக்க மாட்டார்கள். கடுமையான மாறுபாட்டில், சரணாலயத்திற்குள் நுழைந்தவுடன் துண்டுகள் உறைந்திருக்கும். நான்கு வீரர் விளையாட்டுகளில், வீரர்கள் 3 மற்றும் 4 வீரர்கள், 1 மற்றும் 2 வீரர்கள் கூட்டாளர்களாக உள்ளனர்.

# notes.emu
source: More information on the Decktet system can be found on the [official Decktet website](https://www.decktet.com). Cards in players' hands are hidden from observers, and they are hidden from opponents until the deck is empty, at which point the players have perfect information, so the hands are revealed. Cards drawn from the discard pile are also always visible to opponents.
ta: டெக்டெட் அமைப்பு பற்றிய கூடுதல் தகவல்களை [அதிகாரப்பூர்வ டெக்டெட் வலைத்தளம்] (https://www.decktet.com) இல் காணலாம். வீரர்களின் கைகளில் உள்ள அட்டைகள் பார்வையாளர்களிடமிருந்து மறைக்கப்பட்டுள்ளன, மேலும் அவை டெக் காலியாக இருக்கும் வரை எதிரிகளிடமிருந்து மறைக்கப்பட்டுள்ளன, அந்த நேரத்தில் வீரர்களுக்கு சரியான தகவல்கள் உள்ளன, எனவே கைகள் வெளிப்படுகின்றன. நிராகரிக்கப்பட்ட குவியலில் இருந்து வரையப்பட்ட அட்டைகளும் எப்போதும் எதிரிகளுக்கு தெரியும்.

# notes.entropy
source: In this implementation, the players play two games simultaneously but with a single shared stream of randomized pieces. Each player places a piece on their *opponent's* Order board and then makes a move on their *own* Order board; players thus act as both Order and Chaos at the same time. The player with the greatest score wins! Since both players had the exact same placement choices, this provides the cleanest measure of relative skill.
ta: இந்த செயலாக்கத்தில், வீரர்கள் ஒரே நேரத்தில் இரண்டு விளையாட்டுகளை விளையாடுகிறார்கள், ஆனால் சீரற்ற துண்டுகளின் ஒற்றை பகிரப்பட்ட ச்ட்ரீமுடன். ஒவ்வொரு வீரரும் தங்கள் * எதிராளியின் * ஆர்டர் போர்டில் ஒரு பகுதியை வைக்கிறார்கள், பின்னர் அவற்றின் * சொந்த * ஆர்டர் போர்டில் ஒரு நகர்வை மேற்கொள்கின்றனர்; வீரர்கள் ஒரே நேரத்தில் ஒழுங்காகவும் குழப்பமாகவும் செயல்படுகிறார்கள். மிகப் பெரிய மதிப்பெண் கொண்ட வீரர் செய் பெறுகிறார்! இரு வீரர்களுக்கும் சரியான வேலை வாய்ப்பு தேர்வுகள் இருந்ததால், இது உறவினர் திறனின் தூய்மையான அளவை வழங்குகிறது.

# notes.exxit
source: Translations of the rules tend to omit certain nuances. This implementation conforms with the original French edition of the rules. Because the board is built out as you play in irregular shapes, the hexes are labelled numerically instead of algebraically. This ensures that the labels don't change as the map grows.
ta: விதிகளின் மொழிபெயர்ப்புகள் சில நுணுக்கங்களைத் தவிர்க்க முனைகின்றன. இந்த செயல்படுத்தல் விதிகளின் அசல் பிரெஞ்சு பதிப்போடு ஒத்துப்போகிறது. நீங்கள் ஒழுங்கற்ற வடிவங்களில் விளையாடும்போது பலகை கட்டப்பட்டிருப்பதால், இயற்கணிதத்திற்கு பதிலாக எக்ச்கள் எண்ணிக்கையில் பெயரிடப்படுகின்றன. வரைபடம் வளரும்போது லேபிள்கள் மாறாது என்பதை இது உறுதி செய்கிறது.
