Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.storisende.BAD_PLACEMENT
source: Pieces may only be placed on valid hexes not already occupied by your opponent.
ta: உங்கள் எதிரியால் ஏற்கனவே ஆக்கிரமிக்கப்படாத செல்லுபடியாகும் எக்ச்களில் மட்டுமே துண்டுகள் வைக்கப்படலாம்.

# validation.storisende.INITIAL_INSTRUCTIONS_first
source: Click cell to place a piece. Click the same cell multiple times to create a stack. You must place 2–5 total pieces, then your opponent will choose sides.
ta: ஒரு துண்டு வைக்க கலத்தைக் சொடுக்கு செய்க. ஒரு அடுக்கை உருவாக்க அதே கலத்தை பல முறை சொடுக்கு செய்க. நீங்கள் 2–5 மொத்த துண்டுகளை வைக்க வேண்டும், பின்னர் உங்கள் எதிர்ப்பாளர் பக்கங்களைத் தேர்ந்தெடுப்பார்.

# validation.storisende.INITIAL_INSTRUCTIONS_second
source: You may either switch seats or choose to play second by placing the same number of pieces. If your opponent already switched seats, then you may only place pieces. Click a cell to place a piece. Click the same cell multiple times to create a stack.
ta: நீங்கள் இருக்கைகளை மாற்றலாம் அல்லது அதே எண்ணிக்கையிலான துண்டுகளை வைப்பதன் மூலம் இரண்டாவது விளையாட தேர்வு செய்யலாம். உங்கள் எதிர்ப்பாளர் ஏற்கனவே இருக்கைகளை மாற்றினால், நீங்கள் துண்டுகளை மட்டுமே வைக்கலாம். ஒரு துண்டு வைக்க ஒரு கலத்தைக் சொடுக்கு செய்க. ஒரு அடுக்கை உருவாக்க அதே கலத்தை பல முறை சொடுக்கு செய்க.

# validation.storisende.INITIAL_INSTRUCTIONS_rest
source: Click a stack to move. The number of pieces that move depend on the distance you travel.
ta: நகர்த்த ஒரு அடுக்கைக் சொடுக்கு செய்க. நகரும் துண்டுகளின் எண்ணிக்கை நீங்கள் பயணிக்கும் தூரத்தைப் பொறுத்தது.

# validation.storisende.INVALID_SUBSTACK
source: The substack notation is incorrect. You're trying to move more pieces than are available. If trying to move the entire stack, don't specify the stack height.
ta: மின்மறுப்பு குறியீடு தவறானது. கிடைக்கக்கூடியதை விட அதிகமான துண்டுகளை நகர்த்த முயற்சிக்கிறீர்கள். முழு அடுக்கையும் நகர்த்த முயற்சித்தால், அடுக்கு உயரத்தைக் குறிப்பிட வேண்டாம்.

# validation.storisende.PARTIAL_PLACE_FIRST
source: You may place one more piece.
ta: நீங்கள் இன்னும் ஒரு துண்டு வைக்கலாம்.

# validation.storisende.PARTIAL_PLACE_FIRST_MORE
source: You must place at least one more piece
ta: நீங்கள் இன்னும் ஒரு பகுதியையாவது வைக்க வேண்டும்

# validation.storisende.PARTIAL_PLACE_SECOND
source: You must place one more piece.
ta: நீங்கள் இன்னும் ஒரு துண்டு வைக்க வேண்டும்.

# validation.storisende.STRAIGHT_ONLY
source: Pieces may only move in straight lines.
ta: துண்டுகள் நேர் கோடுகளில் மட்டுமே நகரக்கூடும்.

# validation.storisende.TOO_MANY
source: You placed too many pieces. Please reset the move and try again.
ta: நீங்கள் பல துண்டுகளை வைத்தீர்கள். தயவுசெய்து நகர்வை மீட்டமைத்து மீண்டும் முயற்சிக்கவும்.

# validation.storisende.WALL_CLIMB
source: Pieces may not move from the ground onto a wall tile.
ta: துண்டுகள் தரையில் இருந்து ஒரு சுவர் ஓடு மீது நகரக்கூடாது.

# validation.storisende.WALL_JUMP
source: Pieces may only jump over a wall tile if that tile contains at least one of your own pieces.
ta: அந்த ஓடு உங்கள் சொந்த துண்டுகளில் ஒன்றைக் கொண்டிருந்தால் மட்டுமே துண்டுகள் ஒரு சுவர் ஓடு மீது குதிக்கக்கூடும்.

# validation.stormc.INITIAL_INSTRUCTIONS
source: Select one of your pieces to move.
ta: நகர்த்த உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.stormc.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.strands.DIFFERENT_NUMS
source: You have to select spaces with the same number.
ta: அதே எண்ணுடன் நீங்கள் இடங்களைத் தேர்ந்தெடுக்க வேண்டும்.

# validation.strands.DUPLICATE
source: You have already placed a piece at {{where}}.
ta: நீங்கள் ஏற்கனவே ஒரு பகுதியை {{where}} இல் வைத்திருக்கிறீர்கள்.

# validation.strands.INITIAL_INSTRUCTIONS
source: Select the spaces to place your pieces.
ta: உங்கள் துண்டுகளை வைக்க இடங்களைத் தேர்ந்தெடுக்கவும்.

# validation.strands.INITIAL_INSTRUCTIONS_FIRST
source: Select a space numbered 2 for the first move.
ta: முதல் நகர்வுக்கு 2 எண்ணுள்ள இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.strands.INITIAL_SINGLE
source: You may only place one piece on a space numbered 2 for the first move.
ta: முதல் நகர்வுக்கு 2 எண்ணுள்ள இடத்தில் ஒரு பகுதியை மட்டுமே வைக்கலாம்.

# validation.strands.INITIAL_TWO
source: You must place a piece on a space numbered 2 for the first move.
ta: முதல் நகர்வுக்கு 2 எண்ணுள்ள இடத்தில் நீங்கள் ஒரு பகுதியை வைக்க வேண்டும்.

# validation.strands.INVALID_PLACEMENT
source: Unable to interpret the move notation: {{move}}.
ta: நகர்வு குறியீட்டை விளக்க முடியவில்லை: {{move}}.

# validation.strands.NORMALISE
source: The move needs to be normalised. Try {{normalised}}.
ta: நகர்வை இயல்பாக்க வேண்டும். {{normalised}} ஐ முயற்சிக்கவும்.

# validation.strands.PLACE_MORE
source: Place 1 more piece on a space numbered {{num}}.
ta: {{num}} எண்ணற்ற இடத்தில் 1 பகுதியை வைக்கவும்.

# validation.strands.TOO_MANY
source: You may only place 1 piece.
ta: நீங்கள் 1 துண்டு மட்டுமே வைக்கலாம்.

# validation.streetcar.ADJ_TO_BLDG
source: You may not remove a housing limit next to a building.
ta: ஒரு கட்டிடத்திற்கு அடுத்த வீட்டு வரம்பை நீங்கள் அகற்றக்கூடாது.

# validation.streetcar.ALREADY_CLAIMED
source: The edge '{{edge}}' is already claimed.
ta: எட்ச் '{{edge}}' ஏற்கனவே உரிமை கோரப்பட்டுள்ளது.

# validation.streetcar.FIRST_HOUSE
source: You may not remove a housing limit on the first turn.
ta: முதல் திருப்பத்தில் நீங்கள் வீட்டு வரம்பை அகற்றக்கூடாது.

# validation.streetcar.INITIAL_INSTRUCTIONS_initial
source: Click one or two hex edges to start your streetcar empire.
ta: உங்கள் ச்ட்ரீட்கார் சாம்ராச்யத்தைத் தொடங்க ஒன்று அல்லது இரண்டு ஃச் விளிம்புகளைக் சொடுக்கு செய்க.

# validation.streetcar.INITIAL_INSTRUCTIONS_normal
source: In any order, click a hex to remove a housing limit, and click one or two hex edges to expand your streetcar empire.
ta: எந்தவொரு வரிசையிலும், வீட்டு வரம்பை அகற்ற ஒரு ஃச் என்பதைக் சொடுக்கு செய்து, உங்கள் ச்ட்ரீட்கார் சாம்ராச்யத்தை விரிவுபடுத்த ஒன்று அல்லது இரண்டு ஃச் விளிம்புகளைக் சொடுக்கு செய்க.

# validation.streetcar.INVALID_EDGE
source: The edge provided does not appear to be valid: {{edge}}.
ta: வழங்கப்பட்ட விளிம்பு செல்லுபடியாகும் என்று தோன்றாது: {{edge}}.

# validation.streetcar.MAY_NOT_TOUCH
source: Opposing lines may not touch.
ta: எதிரெதிர் கோடுகள் தொடாமல் போகலாம்.

# validation.streetcar.MUST_TOUCH
source: When claiming two edges, they must touch.
ta: இரண்டு விளிம்புகளைக் கோரும்போது, அவை தொட வேண்டும்.

# validation.streetcar.NO_REMOVE_BLDGS
source: You may not remove buildings from the board.
ta: நீங்கள் போர்டில் இருந்து கட்டிடங்களை அகற்றக்கூடாது.

# validation.streetcar.ONLY_TWO
source: You may only claim two edges per turn.
ta: நீங்கள் ஒரு திருப்பத்திற்கு இரண்டு விளிம்புகளை மட்டுமே கோரலாம்.

# validation.streetcar.TAKEN_LABEL
source: Player {{playerNum}}'s housing limits
ta: பிளேயர் {{playerNum}} இன் வீட்டு வரம்புகள்

# validation.streetcar.TWO_LINES
source: You must place a second line if extending your first line is legal.
ta: உங்கள் முதல் வரியை நீட்டிப்பது சட்டபூர்வமானது என்றால் நீங்கள் இரண்டாவது வரியை வைக்க வேண்டும்.

# validation.streetcar.VALID_PARTIAL_haveedge
source: So far so good. Select a housing limit to remove.
ta: இதுவரை மிகவும் நல்லது. அகற்ற வீட்டு வரம்பைத் தேர்ந்தெடுக்கவும்.

# validation.streetcar.VALID_PARTIAL_havehouse
source: So far so good. Select at least one edge.
ta: இதுவரை மிகவும் நல்லது. குறைந்தது ஒரு விளிம்பைத் தேர்ந்தெடுக்கவும்.

# validation.strings.INITIAL_INSTRUCTIONS
source: Select a string to pull.
ta: இழுக்க ஒரு சரத்தைத் தேர்ந்தெடுக்கவும்.

# validation.strings.NOSTRING
source: There is no string numbered {{string}}.
ta: சரம் எண்ணற்ற {{string}} இல்லை.

# validation.subdivision.BAD_ONE
source: Smalls must be placed near a small or large of a different colour.
ta: ச்மால்ச் ஒரு சிறிய அல்லது பெரிய வண்ணத்தின் அருகே வைக்கப்பட வேண்டும்.

# validation.subdivision.BAD_PARK
source: You may not place any more parks. If you're trying to place a piece, first click the piece in your stash.
ta: நீங்கள் இனி பூங்காக்கள் வைக்கக்கூடாது. நீங்கள் ஒரு பகுதியை வைக்க முயற்சிக்கிறீர்கள் என்றால், முதலில் உங்கள் ச்டாசில் உள்ள பகுதியைக் சொடுக்கு செய்க.

# validation.subdivision.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.subdivision.BAD_THREE
source: Larges may not be placed near another large of your colour.
ta: உங்கள் வண்ணத்தின் மற்றொரு பெரிய அருகே பெரியதாக வைக்கப்படாமல் போகலாம்.

# validation.subdivision.INITIAL_INSTRUCTIONS_parks
source: Click an empty cell to place a park.
ta: ஒரு பூங்காவை வைக்க வெற்று கலத்தைக் சொடுக்கு செய்க.

# validation.subdivision.INITIAL_INSTRUCTIONS_place
source: Click a piece in your stash to place on the board.
ta: பலகையில் வைக்க உங்கள் ச்டாசில் உள்ள ஒரு பகுதியைக் சொடுக்கு செய்க.

# validation.subdivision.INVALID_SIZE
source: The piece you selected is invalid. It must be a 1, 2, or 3.
ta: நீங்கள் தேர்ந்தெடுத்த துண்டு தவறானது. இது 1, 2, அல்லது 3 ஆக இருக்க வேண்டும்.

# validation.subdivision.LABEL_STASH
source: Player {{playerNum}}'s stash
ta: பிளேயர் {{playerNum}} இன் ச்டாச்

# validation.subdivision.MALFORMED
source: Your move could not be interpreted. If this persists, please let an administrator know.
ta: உங்கள் நகர்வை விளக்க முடியவில்லை. இது தொடர்ந்தால், தயவுசெய்து ஒரு நிர்வாகிக்கு தெரியப்படுத்துங்கள்.

# validation.subdivision.NEED_PARKS
source: You may not place a piece until all parks are placed. Click an empty cell to place a park.
ta: அனைத்து பூங்காக்களும் வைக்கப்படும் வரை நீங்கள் ஒரு துண்டு வைக்கக்கூடாது. ஒரு பூங்காவை வைக்க வெற்று கலத்தைக் சொடுக்கு செய்க.

# validation.subdivision.NO_PIECE
source: You don't have a size {{size}} piece to place.
ta: உங்களிடம் ஒரு அளவு {{size}} துண்டு இல்லை.

# validation.subdivision.PARTIAL_PLACEMENT
source: Click an empty space on the board to place your {{size}} piece.
ta: உங்கள் {{size}} துண்டு வைக்க பலகையில் ஒரு வெற்று இடத்தைக் சொடுக்கு செய்க.

# validation.surmount.BAD_CAP
source: You may not capture the stone at {{cell}}. The captured stone must be adjacent to the capturing group and must be part of a group that is the same size as the capturing group.
ta: நீங்கள் {{cell} at இல் கல்லைப் பிடிக்கக்கூடாது. கைப்பற்றப்பட்ட கல் கைப்பற்றும் குழுவிற்கு அருகில் இருக்க வேண்டும் மற்றும் கைப்பற்றும் குழுவின் அதே அளவிலான ஒரு குழுவின் ஒரு பகுதியாக இருக்க வேண்டும்.

# validation.surmount.BAD_CONTINUE
source: You may not place a stone at {{cell}}. Continuations may not make contact with any groups other than those initially contacted, and they may not grow the group any larger than the largest enemy group initially contacted.
ta: நீங்கள் {{cell}} இல் ஒரு கல்லை வைக்கக்கூடாது. ஆரம்பத்தில் தொடர்பு கொண்டவர்களைத் தவிர வேறு எந்த குழுக்களுடனும் தொடர்ச்சிகள் தொடர்பு கொள்ளாமல் போகலாம், மேலும் அவை ஆரம்பத்தில் தொடர்பு கொண்ட மிகப்பெரிய எதிரி குழுவை விட பெரியதாக குழுவை வளர்க்கக்கூடாது.

# validation.surmount.BAD_INIT_CAP
source: You may not capture the stone at {{cell}}. The captured stone must be adjacent to one of your groups that are larger than the target group.
ta: நீங்கள் {{cell} at இல் கல்லைப் பிடிக்கக்கூடாது. கைப்பற்றப்பட்ட கல் இலக்கு குழுவை விட பெரியதாக இருக்கும் உங்கள் குழுக்களில் ஒன்றிற்கு அருகில் இருக்க வேண்டும்.

# validation.surmount.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.surmount.CANT_CONTINUE
source: You may not place more stones unless the first stone ({{start}}) touches at least one friendly stone and at least one enemy group that is the same size or larger then the friendly group.
ta: முதல் கல் ({{start}}) குறைந்தது ஒரு நட்பு கல்லையும், குறைந்தது ஒரு எதிரி குழுவையும் ஒரே அளவு அல்லது பெரியதாக இருக்கும், பின்னர் நட்பு குழுவைத் தொடாவிட்டால் நீங்கள் அதிக கற்களை வைக்கக்கூடாது.

# validation.surmount.DEAD_END
source: There are no valid continuations available but you are not yet large enough to capture. Reset and try a different approach.
ta: சரியான தொடர்ச்சிகள் எதுவும் கிடைக்கவில்லை, ஆனால் நீங்கள் இன்னும் பெரியதாக இல்லை. மீட்டமைத்து வேறு அணுகுமுறையை முயற்சிக்கவும்.

# validation.surmount.INITIAL_INSTRUCTIONS
source: Select an empty cell to place a piece, or select a capturable stone to capture it and destroy the group.
ta: ஒரு துண்டு வைக்க ஒரு வெற்று கலத்தைத் தேர்ந்தெடுக்கவும் அல்லது அதைப் பிடிக்கவும், குழுவை அழிக்கவும் கைப்பற்றக்கூடிய கல்லைத் தேர்ந்தெடுக்கவும்.

# validation.surmount.PARTIAL_BOTH
source: Either continue placing stones or select one of the highlighted enemy cells to capture it and destroy that group.
ta: கற்களை வைப்பதைத் தொடரவும் அல்லது சிறப்பம்சமாக எதிரி உயிரணுக்களில் ஒன்றைத் தேர்ந்தெடுக்கவும், அதைப் பிடிக்கவும், அந்தக் குழுவை அழிக்கவும்.

# validation.surmount.PARTIAL_CAP
source: Select one of the highlighted enemy cells to capture it and destroy that group.
ta: சிறப்பிக்கப்பட்ட எதிரி உயிரணுக்களில் ஒன்றைத் தேர்ந்தெடுத்து அதைப் பிடிக்கவும், அந்தக் குழுவை அழிக்கவும்.

# validation.surmount.PARTIAL_CONTINUE
source: Continue placing stones until the group is the same size of one of the contacted enemy groups.
ta: தொடர்பு கொண்ட எதிரி குழுக்களில் ஒன்றின் ஒரே அளவு குழு இருக்கும் வரை கற்களை வைப்பதைத் தொடரவும்.

# validation.susan.EMPTY_FROM
source: You have indicated a sliding move, but there is no piece at {{where}}.
ta: நீங்கள் ஒரு நெகிழ் நகர்வை சுட்டிக்காட்டியுள்ளீர்கள், ஆனால் {{where}} இல் எந்த துண்டு இல்லை.

# validation.susan.INITIAL_INSTRUCTIONS
source: Select a space to place a piece, or select one of your pieces to slide to an adjacent space.
ta: ஒரு துண்டு வைக்க ஒரு இடத்தைத் தேர்ந்தெடுக்கவும், அல்லது அருகிலுள்ள இடத்திற்கு சறுக்க உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.susan.NOT_ADJACENT
source: The selected cell {{to}} is not adjacent to {{from}}
ta: தேர்ந்தெடுக்கப்பட்ட செல் {{to}}} இருந்து இலிருந்து {for க்கு அருகில் இல்லை

# validation.susan.SELECT_TO
source: Select a space to slide your piece.
ta: உங்கள் துண்டு சரிய ஒரு இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.susan.WRONG_PLAYER
source: You may only slide your own pieces.
ta: நீங்கள் உங்கள் சொந்த துண்டுகளை மட்டுமே சறுக்கலாம்.

# validation.symple.BAD_PLACEMENT
source: You cannot create a new group by placing at {{where}}.
ta: {{where}} இல் வைப்பதன் மூலம் புதிய குழுவை உருவாக்க முடியாது.

# validation.symple.CAN_BALANCE
source: You are permitted to create a new group if you wish.
ta: நீங்கள் விரும்பினால் புதிய குழுவை உருவாக்க உங்களுக்கு இசைவு உண்டு.

# validation.symple.CANT_BALANCE
source: You may not grow and create a new group in the same turn.
ta: அதே திருப்பத்தில் நீங்கள் ஒரு புதிய குழுவை வளர்த்துக் கொள்ளக்கூடாது.

# validation.symple.DOUBLE_GROW
source: You may not cause a group to be grown more than once in a turn.
ta: ஒரு குழு ஒரு முறை ஒன்றுக்கு மேற்பட்ட முறை வளர்க்கப்படக்கூடாது.

# validation.symple.DUPLICATES
source: Your move contains duplicate cells.
ta: உங்கள் நகர்வில் நகல் செல்கள் உள்ளன.

# validation.symple.INITIAL_INSTRUCTIONS
source: Click a cell to add a piece to the board.
ta: பலகையில் ஒரு பகுதியைச் சேர்க்க ஒரு கலத்தைக் சொடுக்கு செய்க.

# validation.symple.NOT_LIBERTY
source: The cell {{where}} is either not a liberty of one of your groups, or the group has already been grown during this turn.
ta: செல் {{where}} என்பது உங்கள் குழுக்களில் ஒன்றின் விடுதலை அல்ல, அல்லது இந்த திருப்பத்தின் போது குழு ஏற்கனவே வளர்க்கப்பட்டுள்ளது.

# validation.symple.PARTIAL
source: So far so good. Keep placing pieces until you have expanded all groups you legally can.
ta: இதுவரை மிகவும் நல்லது. உங்களால் முடிந்த அனைத்து குழுக்களையும் விரிவுபடுத்தும் வரை துண்டுகளை வைக்கவும்.

# validation.symple.TOO_LONG
source: You may not add more stones if your first move is to create a new group.
ta: உங்கள் முதல் நகர்வு ஒரு புதிய குழுவை உருவாக்கினால் நீங்கள் அதிக கற்களைச் சேர்க்கக்கூடாது.

# validation.tablero.BACKTRACKING
source: When moving a stack, you may not revisit any previous space, including the starting space.
ta: ஒரு அடுக்கை நகர்த்தும்போது, தொடக்க இடம் உட்பட எந்த முந்தைய இடத்தையும் நீங்கள் மறுபரிசீலனை செய்யக்கூடாது.

# validation.tablero.BAD_BUMP
source: You may not bump if you have legal moves available, including taking a piece into your hand if you rolled doubles.
ta: நீங்கள் இரட்டையர் உருட்டினால் உங்கள் கையில் ஒரு பகுதியை எடுத்துக்கொள்வது உட்பட, சட்டப்பூர்வ நகர்வுகள் கிடைத்தால் நீங்கள் மோதிக் கொள்ளக்கூடாது.

# validation.tablero.BAD_TAKE
source: You may only take a piece off the board if you rolled doubles.
ta: நீங்கள் இரட்டையர் உருட்டினால் மட்டுமே பலகையில் இருந்து ஒரு பகுதியை எடுக்கலாம்.

# validation.tablero.INITIAL_INSTRUCTIONS
source: Select an empty space to place a piece or select a stack you control to begin movement. Click the "Bump" or "Take" buttons to take one of those actions.
ta: ஒரு துண்டு வைக்க வெற்று இடத்தைத் தேர்ந்தெடுக்கவும் அல்லது இயக்கத்தைத் தொடங்க நீங்கள் கட்டுப்படுத்தும் அடுக்கைத் தேர்ந்தெடுக்கவும். அந்த செயல்களில் ஒன்றை எடுக்க "பம்ப்" அல்லது "டேக்" பொத்தான்களைக் சொடுக்கு செய்க.

# validation.tablero.INVALID_MOVE
source: The move does not appear to be legal. Remember that you can only use each die once.
ta: இந்த நடவடிக்கை சட்டப்பூர்வமாகத் தெரியவில்லை. ஒவ்வொரு இறப்பையும் ஒரு முறை மட்டுமே பயன்படுத்த முடியும் என்பதை நினைவில் கொள்ளுங்கள்.

# validation.tablero.LABEL_PREVIOUS
source: Previous roll
ta: முந்தைய ரோல்

# validation.tablero.NO_MATCHING_DIE
source: You didn't roll a {{die}}.
ta: நீங்கள் a {{die}} ஐ உருட்டவில்லை.

# validation.tablero.NOT_HOME
source: You may only place pieces or move stacks on your home row.
ta: நீங்கள் உங்கள் வீட்டு வரிசையில் துண்டுகளை மட்டுமே வைக்கலாம் அல்லது அடுக்குகளை நகர்த்தலாம்.

# validation.tablero.PARTIAL_MOVE
source: Keep moving until you have dropped all the pieces from the stack. You have {{count}} checker left to drop.
ta: நீங்கள் அனைத்து துண்டுகளையும் அடுக்கிலிருந்து கைவிடும் வரை தொடர்ந்து செல்லுங்கள். உங்களிடம் {{count}} செக்கர் கைவிட உள்ளது.

# validation.tablero.PARTIAL_PLACE
source: Choose the cell where you wish to place the checker.
ta: நீங்கள் செக்கரை வைக்க விரும்பும் கலத்தைத் தேர்வுசெய்க.

# validation.tablero.PARTIAL_TAKE
source: Click the stack you control from which you wish to remove a checker.
ta: நீங்கள் ஒரு செக்கரை அகற்ற விரும்பும் கட்டுப்பாட்டைக் சொடுக்கு செய்க.

# validation.tablero.VALID_PARTIAL
source: First move complete. Now make a second.
ta: முதல் நகர்வு முடிந்தது. இப்போது ஒரு நொடி செய்யுங்கள்.

# validation.tafl.BERSERK
source: Berserk move to {{to}} is invalid.
ta: பெர்செர்க் {{to} பெறுநர் க்கு நகர்வது தவறானது.

# validation.tafl.BERSERK_CONTINUE
source: You may continue with a berserk move.
ta: நீங்கள் ஒரு மோசமான நகர்வுடன் தொடரலாம்.

# validation.tafl.CONTIGUOUS
source: In berserk moves, the subsequent 'from' cells must be the previous 'to' cells.
ta: பெர்செர்க் நகர்வுகளில், அடுத்தடுத்த 'கலங்களிலிருந்து' கலங்களிலிருந்து முந்தைய 'முதல்' கலங்கள் இருக்க வேண்டும்.

# validation.tafl.INITIAL_INSTRUCTIONS
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.tafl.INVALID_DESTINATION
source: The piece at {{from}} cannot move to {{to}}.
ta: } From} க்கு இல் உள்ள துண்டு {{from} பெறுநர் க்கு செல்ல முடியாது.

# validation.tafl.NO_MOVES
source: The piece at {{from}} does not have any valid cells to move to.
ta: } இருந்து இலிருந்து {{at இல் உள்ள துண்டு செல்ல வேண்டிய செல்லுபடியாகும் செல்கள் இல்லை.

# validation.tafl.NORMALISE
source: The move needs to be normalised. Try {{normalised}}.
ta: நகர்வை இயல்பாக்க வேண்டும். {{normalised}} ஐ முயற்சிக்கவும்.

# validation.tafl.PREFIX
source: The cell {{cell}} has to be prefixed with the piece symbol: {{prefixed}}
ta: செல் {{cell}} துண்டு சின்னத்துடன் முன்னொட்டு இருக்க வேண்டும்: {{prefixed}}}

# validation.taiji.ADJACENT
source: Pieces must be placed adjacent to each other. Diagonal placement is only permitted in the "Tonga" variant.
ta: துண்டுகள் ஒருவருக்கொருவர் அருகில் வைக்கப்பட வேண்டும். மூலைவிட்ட வேலைவாய்ப்பு "டோங்கா" மாறுபாட்டில் மட்டுமே அனுமதிக்கப்படுகிறது.

# validation.taiji.INITIAL_INSTRUCTIONS
source: Place a light piece in an empty space.
ta: வெற்று இடத்தில் ஒரு ஒளி துண்டு வைக்கவும்.

# validation.taiji.NO_NEIGHBOUR
source: That space has no valid empty neighbour.
ta: அந்த இடத்திற்கு சரியான வெற்று அண்டை இல்லை.

# validation.taiji.PARTIAL
source: Place the dark piece in an adjacent empty space.
ta: இருண்ட துண்டுகளை அருகிலுள்ள வெற்று இடத்தில் வைக்கவும்.

# validation.take.INITIAL_INSTRUCTIONS
source: Plant a new seed in dirt, or grow a plant by placing adjacent to exactly one ally piece (dirt or no dirt).
ta: ஒரு புதிய விதை அழுக்கில் நடவு செய்யுங்கள் அல்லது சரியாக ஒரு நட்பு துண்டுக்கு அருகில் (அழுக்கு அல்லது அழுக்கு இல்லை) ஒரு செடியை வளர்க்கவும்.

# validation.tbt.BAD_PASS
source: You must move a stack if it's possible to do so.
ta: அவ்வாறு செய்ய முடிந்தால் நீங்கள் ஒரு அடுக்கை நகர்த்த வேண்டும்.

# validation.tbt.INITIAL_INSTRUCTIONS
source: Select a stack to move.
ta: நகர்த்த ஒரு அடுக்கைத் தேர்ந்தெடுக்கவும்.

# validation.tbt.LABEL_PREVIOUS
source: Previous roll
ta: முந்தைய ரோல்

# validation.tbt.NO_REVERSE
source: You may not simply reverse your opponent's last move.
ta: உங்கள் எதிரியின் கடைசி நடவடிக்கையை நீங்கள் மாற்றியமைக்கக்கூடாது.

# validation.tbt.NOT_ORTH
source: The cells {{from}} and {{to}} are not orthogonal to each other.
ta: }}} மற்றும் {{from} க்கு ஆகியவை ஒருவருக்கொருவர் ஆர்த்தோகனல் அல்ல.

# validation.tbt.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.tbt.TOO_SHORT
source: The stack at {{where}} is too short (it needs at least {{roll}} pieces).
ta: {{roll} at இல் உள்ள அடுக்கு மிகக் குறைவு (அதற்கு குறைந்தபட்சம் {{where}} துண்டுகள் தேவை).

# validation.terrace.BAD_CAPTURE_ranked
source: All captures must be adjacent. When capturing straight up, you must be larger (except that a smallest-size may assassinate a largest-size piece). When capturing same level, you must be at least the same size. When capturing diagonally down, you may be one rank smaller.
ta: அனைத்து பிடிப்புகளும் அருகிலேயே இருக்க வேண்டும். நேராக மேலே கைப்பற்றும்போது, நீங்கள் பெரிதாக இருக்க வேண்டும் (ஒரு மிகச்சிறிய அளவு மிகப்பெரிய அளவிலான பகுதியை படுகொலை செய்யலாம் என்பதைத் தவிர). ஒரே அளவைக் கைப்பற்றும்போது, நீங்கள் குறைந்தபட்சம் ஒரே அளவாக இருக்க வேண்டும். குறுக்காக கீழே பிடிக்கும் போது, நீங்கள் ஒரு தரவரிசை சிறியவராக இருக்கலாம்.

# validation.terrace.BAD_CAPTURE_standard
source: You may only capture a piece your size or smaller, diagonally down.
ta: உங்கள் அளவு அல்லது சிறியதாக, குறுக்காக கீழே ஒரு பகுதியை மட்டுமே நீங்கள் கைப்பற்றலாம்.

# validation.terrace.INITIAL_INSTRUCTIONS
source: Select one of your pieces to move.
ta: நகர்த்த உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.terrace.MOVE_DOWN
source: You may only move straight down and only one level at a time.
ta: நீங்கள் நேராக கீழே செல்லலாம், ஒரு நேரத்தில் ஒரு நிலை மட்டுமே.

# validation.terrace.MOVE_SAME_LEVEL
source: You may not jump over enemy pieces when moving on the same level.
ta: அதே மட்டத்தில் நகரும் போது நீங்கள் எதிரி துண்டுகள் மீது குதிக்கக்கூடாது.

# validation.terrace.MOVE_UP
source: You may only move one level at a time to an adjacent cell.
ta: நீங்கள் ஒரு நேரத்தில் ஒரு நிலையை மட்டுமே அருகிலுள்ள கலத்திற்கு நகர்த்தலாம்.

# validation.terrace.NO_MOVES
source: The piece at {{cell}} does not have any valid moves.
ta: {{cell} at இல் உள்ள துண்டு சரியான நகர்வுகள் இல்லை.

# validation.tessella.INITIAL_INSTRUCTIONS
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.tessella.PARTIAL_cancap
source: Select a destination. This piece can capture.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும். இந்த துண்டு பிடிக்க முடியும்.

# validation.tessella.PARTIAL_move
source: Select a destination. This piece may only move.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும். இந்த துண்டு மட்டுமே நகரக்கூடும்.

# validation.tintas.CAPTURED_LABEL
source: Player {{playerNum}}'s captured pieces
ta: பிளேயர் {{playerNum}} இன் கைப்பற்றப்பட்ட துண்டுகள்

# validation.tintas.INITIAL_INSTRUCTIONS_movepawn
source: Select the cell where you want the pawn to move.
ta: சிப்பாய் நகர விரும்பும் கலத்தைத் தேர்ந்தெடுக்கவும்.
