Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.gyges.INITIAL_INSTRUCTIONS_play
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.gyges.INVALID_PATH
source: There is no valid path for the move {{move}}. Remember that you may only cross a cell edge one time per move, regardless of direction.
ta: நகர்வுக்கு சரியான பாதை இல்லை {{move}}. திசையைப் பொருட்படுத்தாமல், ஒரு நகர்வுக்கு ஒரு முறை மட்டுமே நீங்கள் ஒரு செல் விளிம்பைக் கடக்க முடியும் என்பதை நினைவில் கொள்ளுங்கள்.

# validation.gyges.NO_DUPES
source: You may not place multiple pieces on the same space.
ta: நீங்கள் ஒரே இடத்தில் பல துண்டுகளை வைக்கக்கூடாது.

# validation.gyges.NO_MOVES
source: The piece at {{cell}} has no valid moves. Remember that you may only play pieces from the row closest to you.
ta: {{cell} at இல் உள்ள துண்டு சரியான நகர்வுகள் இல்லை. உங்களுக்கு மிக நெருக்கமான வரிசையில் இருந்து மட்டுமே நீங்கள் துண்டுகளை இயக்க முடியும் என்பதை நினைவில் கொள்ளுங்கள்.

# validation.gyges.NOT_INHAND
source: You don't have a size {{size}} piece to place.
ta: உங்களிடம் ஒரு அளவு {{size}} துண்டு இல்லை.

# validation.gyges.PARTIAL_displace
source: Select one of the highlighted empty cells to displace the current piece.
ta: தற்போதைய பகுதியை இடம்பெயர சிறப்பிக்கப்பட்ட வெற்று கலங்களில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.gyges.PARTIAL_move
source: Select the next destination, or click this same cell again to displace the piece.
ta: அடுத்த இலக்கைத் தேர்ந்தெடுக்கவும் அல்லது பகுதியை இடம்பெயர மீண்டும் இதே கலத்தைக் சொடுக்கு செய்யவும்.

# validation.gyges.PARTIAL_setup
source: Select an empty cell on your home row to place the piece.
ta: துண்டு வைக்க உங்கள் வீட்டு வரிசையில் ஒரு வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.gyges.PARTIAL_setup2
source: Select another piece from your stash to place on the board.
ta: பலகையில் வைக்க உங்கள் ச்டாசிலிருந்து மற்றொரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.gyve.BAD_FIRST
source: You may not place a second stone on the first turn of the game.
ta: விளையாட்டின் முதல் திருப்பத்தில் நீங்கள் இரண்டாவது கல்லை வைக்கக்கூடாது.

# validation.gyve.BAD_N
source: Each stone you place must connect to the same number of friendly groups ({{n1}} <> {{n2}}).
ta: நீங்கள் வைக்கும் ஒவ்வொரு கல்லும் ஒரே எண்ணிக்கையிலான நட்பு குழுக்களுடன் ({{n1}} <> {{n2}}) இணைக்க வேண்டும்.

# validation.gyve.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.gyve.INITIAL_INSTRUCTIONS
source: Select an empty cell to place a stone.
ta: ஒரு கல்லை வைக்க வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.gyve.NO_DUPES
source: You must place stones on different cells.
ta: நீங்கள் வெவ்வேறு கலங்களில் கற்களை வைக்க வேண்டும்.

# validation.gyve.PARTIAL
source: Select an empty cell to place a second stone. It must be adjacent to the same number of groups as the first stone.
ta: இரண்டாவது கல்லை வைக்க வெற்று கலத்தைத் தேர்ந்தெடுக்கவும். இது முதல் கல்லின் அதே எண்ணிக்கையிலான குழுக்களுக்கு அருகில் இருக்க வேண்டும்.

# validation.havannah.INITIAL_INSTRUCTIONS
source: Select a point to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும்.

# validation.hens.INITIAL_INSTRUCTIONS
source: Select one of your own pieces to move.
ta: நகர்த்த உங்கள் சொந்த துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.hens.ONLY_DIAG
source: Chicks may only move diagonally.
ta: குஞ்சுகள் குறுக்காக மட்டுமே நகரக்கூடும்.

# validation.hens.ONLY_FORWARD
source: Pieces may only move forward.
ta: துண்டுகள் மட்டுமே முன்னேறக்கூடும்.

# validation.hens.ONLY_HENS
source: Only hens can make multiple jumps.
ta: கோழிகள் மட்டுமே பல தாவல்களைச் செய்ய முடியும்.

# validation.hens.ONLY_TWO
source: Hens may only move up to two spaces.
ta: கோழிகள் இரண்டு இடைவெளிகள் வரை மட்டுமே நகரக்கூடும்.

# validation.hens.STRAIGHT_LINES
source: Pieces may only be moved in straight lines.
ta: துண்டுகள் நேர் கோடுகளில் மட்டுமே நகர்த்தப்படலாம்.

# validation.hens.VALID_PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.hex.INITIAL_INSTRUCTIONS
source: Select a point to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும்.

# validation.hexentafl.INITIAL_INSTRUCTIONS
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.hexentafl.INVALID_TO
source: The piece at {{from}} cannot move to {{to}}.
ta: } From} க்கு இல் உள்ள துண்டு {{from} பெறுநர் க்கு செல்ல முடியாது.

# validation.hexentafl.KING_PREFIX
source: Movement of the king should be prefixed with 'K'
ta: ராசாவின் இயக்கம் 'கே' உடன் முன்னொட்டு இருக்க வேண்டும்

# validation.hexy.INITIAL_INSTRUCTIONS
source: Select an empty cell. If you select a perimeter cell, the mirror piece will be placed automatically.
ta: வெற்று கலத்தைத் தேர்ந்தெடுக்கவும். நீங்கள் ஒரு சுற்றளவு கலத்தைத் தேர்ந்தெடுத்தால், கண்ணாடி துண்டு தானாக வைக்கப்படும்.

# validation.homeworlds.attack.PARTIAL_NOARGS
source: Select a ship to attack.
ta: தாக்க ஒரு கப்பலைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.attack.PARTIAL_ONEARG
source: Select the system where the ship is found.
ta: கப்பல் காணப்படும் கணினியைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.build.PARTIAL_NOARGS
source: Select the ship you wish to duplicate, or select a ship colour from the global stash (size is irrelevant).
ta: நீங்கள் நகல் எடுக்க விரும்பும் கப்பலைத் தேர்ந்தெடுக்கவும் அல்லது உலகளாவிய ச்டாசிலிருந்து ஒரு கப்பல் வண்ணத்தைத் தேர்ந்தெடுக்கவும் (அளவு பொருத்தமற்றது).

# validation.homeworlds.build.PARTIAL_ONEARG
source: Select the system in which to place the new ship.
ta: புதிய கப்பலை வைக்க கணினியைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.catastrophe.PARTIAL_NOARGS
source: Select a star or ship of the overpopulated colour in the affected system.
ta: பாதிக்கப்பட்ட அமைப்பில் அதிக மக்கள் தொகை கொண்ட வண்ணத்தின் விண்மீன் அல்லது கப்பலைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.discover.PARTIAL_NOARGS
source: Select a ship to move.
ta: நகர்த்த ஒரு கப்பலைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.discover.PARTIAL_ONEARG
source: Select the system where the ship is found.
ta: கப்பல் காணப்படும் கணினியைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.discover.PARTIAL_THREEARGS
source: Give the new system a name.
ta: புதிய அமைப்புக்கு ஒரு பெயரைக் கொடுங்கள்.

# validation.homeworlds.discover.PARTIAL_TWOARGS
source: Select a star from the global stash.
ta: உலகளாவிய ச்டாசிலிருந்து ஒரு நட்சத்திரத்தைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.homeworld.PARTIAL_NOARGS
source: Select your first star from the global stash.
ta: உலகளாவிய ச்டாசிலிருந்து உங்கள் முதல் நட்சத்திரத்தைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.homeworld.PARTIAL_ONEARG
source: Select a second star from the global stash.
ta: உலகளாவிய ச்டாசிலிருந்து இரண்டாவது நட்சத்திரத்தைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.homeworld.PARTIAL_TWOARGS
source: Select a colony ship from the global stash.
ta: உலகளாவிய ச்டாசிலிருந்து ஒரு காலனி கப்பலைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.INITIAL_INSTRUCTIONS_fresh
source: You need to establish a homeworld. Choose a piece from the global stash to be your first star.
ta: நீங்கள் ஒரு வீட்டு உலகத்தை நிறுவ வேண்டும். உங்கள் முதல் நட்சத்திரமாக இருக்க உலகளாவிய ச்டாசிலிருந்து ஒரு பகுதியைத் தேர்வுசெய்க.

# validation.homeworlds.INITIAL_INSTRUCTIONS_inprogress
source: Click the ship you want to move, build, or trade, or select an enemy ship to attack. Click the 'Sacrifice' button to sacrifice a ship.
ta: நீங்கள் நகர்த்த, கட்ட அல்லது வணிகம் செய்ய விரும்பும் கப்பலைக் சொடுக்கு செய்க அல்லது தாக்க ஒரு எதிரி கப்பலைத் தேர்ந்தெடுக்கவும். ஒரு கப்பலை கொடை செய்ய 'கொடை' பொத்தானைக் சொடுக்கு செய்க.

# validation.homeworlds.move.PARTIAL_NOARGS
source: Select a ship to move.
ta: நகர்த்த ஒரு கப்பலைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.move.PARTIAL_ONEARG
source: Select the system in which the ship is found.
ta: கப்பல் காணப்படும் கணினியைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.move.PARTIAL_TWOARGS
source: Select the system you want to move to, or select a piece from the global stash to discover a new system.
ta: நீங்கள் செல்ல விரும்பும் கணினியைத் தேர்ந்தெடுக்கவும் அல்லது புதிய அமைப்பைக் கண்டறிய உலகளாவிய ச்டாசிலிருந்து ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.NEW_FRIENDLY_PARTIAL
source: To move, click the destination system or the void between systems. To build, click the same ship again. To trade, click a piece of the new colour in the stash.
ta: நகர்த்த, இலக்கு அமைப்பு அல்லது அமைப்புகளுக்கு இடையிலான வெற்றிடத்தைக் சொடுக்கு செய்க. உருவாக்க, அதே கப்பலை மீண்டும் சொடுக்கு செய்க. வணிகம் செய்ய, புதிய வண்ணத்தின் ஒரு பகுதியை ச்டாசில் சொடுக்கு செய்க.

# validation.homeworlds.NEW_MOVE_PARTIAL
source: Choose a piece from the global stash to become the new star.
ta: புதிய நட்சத்திரமாக மாற உலகளாவிய ச்டாசிலிருந்து ஒரு பகுதியைத் தேர்வுசெய்க.

# validation.homeworlds.sacrifice.PARTIAL_NOARGS
source: Select the ship to sacrifice.
ta: கொடை செய்ய கப்பலைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.sacrifice.PARTIAL_ONEARG
source: Select the system where the ship is found.
ta: கப்பல் காணப்படும் கணினியைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.trade.PARTIAL_NOARGS
source: Select a ship to convert.
ta: மாற்ற ஒரு கப்பலைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.trade.PARTIAL_ONEARG
source: Select the ship you want to convert.
ta: நீங்கள் மாற்ற விரும்பும் கப்பலைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.trade.PARTIAL_TWOARGS
source: Select the new colour.
ta: புதிய வண்ணத்தைத் தேர்ந்தெடுக்கவும்.

# validation.homeworlds.VALID_W_ACTIONS
source: Looks like a valid move, but you still have actions to spend.
ta: சரியான நடவடிக்கை போல் தெரிகிறது, ஆனால் உங்களிடம் இன்னும் செலவழிக்க நடவடிக்கைகள் உள்ளன.

# validation.iqishiqi.BLOCKED
source: The neutral stone cannot move {{spaces}} spaces away from the group of shared stones formed by placement at {{place}}.
ta: நடுநிலை கல்லால் {{spaces}}}}}}}}}}}} at இல் இடமளிக்கப்பட்ட பகிரப்பட்ட கற்களின் குழுவிலிருந்து விலகிச் செல்ல முடியாது.

# validation.iqishiqi.INITIAL_INSTRUCTIONS
source: Drop a shared stone to push the neutral stone.
ta: நடுநிலை கல்லைத் தள்ள பகிரப்பட்ட கல்லை விடுங்கள்.

# validation.iqishiqi.INVALID_DESTINATION
source: Placement at {{place}} cannot move the neutral stone from {{from}} to {{to}}.
ta: {{to} at இல் வேலைவாய்ப்பு நடுநிலை கல்லை {{from} {{place}} வரை நகர்த்த முடியாது.

# validation.iqishiqi.NEED_DESTINATION
source: Provide the destination for the neutral stone.
ta: நடுநிலை கல்லுக்கான இலக்கை வழங்கவும்.

# validation.iqishiqi.NOLOS
source: The group of shared stones formed by placement at {{place}} cannot see the neutral stone at {{from}}.
ta: {{place} at இல் வேலைவாய்ப்பால் உருவாக்கப்பட்ட பகிரப்பட்ட கற்களின் குழு} இருந்து இலிருந்து {{இல் நடுநிலை கல்லைக் காண முடியாது.

# validation.irensei.KO
source: Ko rule: you may not immediately recapture your opponent's single stone if they just used it to capture one of yours.
ta: கோ விதி: உங்களுடைய ஒன்றைப் பிடிக்க அவர்கள் அதைப் பயன்படுத்தினால், உங்கள் எதிரியின் ஒற்றை கல்லை நீங்கள் உடனடியாக மீண்டும் கைப்பற்ற முடியாது.

# validation.irensei.SELF_CAPTURE
source: You may not place your stones in self-capture unless it is a winning move.
ta: உங்கள் கற்களை ஒரு வெற்றிகரமான நடவடிக்கையாக இல்லாவிட்டால் நீங்கள் தன்வய பிடியில் வைக்கக்கூடாது.

# validation.jacynth.ALREADY_CLAIMED
source: The card at {{cell}} has already been claimed.
ta: {{cell} at இல் உள்ள அட்டை ஏற்கனவே உரிமை கோரப்பட்டுள்ளது.

# validation.jacynth.ALREADY_OWNED
source: The card at {{cell}} is part of a district owned by an opponent.
ta: {{cell} at இல் உள்ள அட்டை ஒரு எதிராளிக்கு சொந்தமான மாவட்டத்தின் ஒரு பகுதியாகும்.

# validation.jacynth.BAD_INFLUENCE
source: You may not exert influence on the card at {{cell}}. The Excuse, pawns, and courts may not be directly influenced.
ta: கார்டில் {{cell} at இல் நீங்கள் செல்வாக்கை செலுத்தக்கூடாது. சாக்கு, சிப்பாய்கள் மற்றும் நீதிமன்றங்கள் நேரடியாக பாதிக்கப்படக்கூடாது.

# validation.jacynth.INITIAL_INSTRUCTIONS
source: Click a card in your hand to place on the board.
ta: பலகையில் வைக்க உங்கள் கையில் ஒரு அட்டையைக் சொடுக்கு செய்க.

# validation.jacynth.LABEL_REMAINING
source: Cards in deck
ta: டெக்கில் அட்டைகள்

# validation.jacynth.LABEL_STASH
source: Player {{playerNum}}'s hand
ta: பிளேயர் {{playerNum}} இன் கை

# validation.jacynth.NO_CARD
source: The card "{{card}}" does not appear to be in your hand.
ta: "{{card}}" அட்டை உங்கள் கையில் இருப்பதாகத் தெரியவில்லை.

# validation.jacynth.NO_INFLUENCE
source: You don't have any influence left.
ta: உங்களுக்கு எந்த செல்வாக்கும் இல்லை.

# validation.jacynth.NOT_ADJ
source: New cards must be placed adjacent to at least one existing card.
ta: புதிய அட்டைகள் குறைந்தது ஒரு அட்டைக்கு அருகில் வைக்கப்பட வேண்டும்.

# validation.jacynth.PARTIAL_PLACEMENT
source: Click an empty space on the board to place your card.
ta: உங்கள் அட்டையை வைக்க போர்டில் வெற்று இடத்தைக் சொடுக்கு செய்க.

# validation.kachit.INITIAL_INSTRUCTIONS_inhand
source: Select a piece to move or an empty space on your side of the board to place a knight.
ta: ஒரு நைட்டை வைக்க போர்டின் உங்கள் பக்கத்தில் நகர்த்த ஒரு துண்டு அல்லது வெற்று இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.kachit.INITIAL_INSTRUCTIONS_placed
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.kachit.PARTIAL_destination
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.kachit.PARTIAL_orientation
source: Select a neighbouring cell to orient the piece.
ta: துண்டுகளை நோக்குநிலைக்கு அண்டை கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.konane.FIRST_MOVE
source: Remove one of your pieces from the center 2x2 or from a corner.
ta: உங்கள் துண்டுகளில் ஒன்றை 2x2 மையத்திலிருந்து அல்லது ஒரு மூலையிலிருந்து அகற்றவும்.

# validation.konane.SECOND_MOVE
source: Remove one of your pieces adjacent to the piece your opponent removed.
ta: உங்கள் எதிரி அகற்றப்பட்ட துண்டுக்கு அருகிலுள்ள உங்கள் துண்டுகளில் ஒன்றை அகற்றவும்.

# validation.konane.NORMAL_MOVE
source: Choose a piece to jump one or more of your opponent's pieces in a straight line.
ta: உங்கள் எதிரியின் துண்டுகளில் ஒன்று அல்லது அதற்கு மேற்பட்டவற்றை ஒரு நேர் கோட்டில் குதிக்க ஒரு துண்டைத் தேர்வுசெய்க.

# validation.konane.INVALID_MOVE
source: You must move a piece that can jump over an opponent's piece.
ta: எதிராளியின் துண்டு மீது குதிக்கக்கூடிய ஒரு பகுதியை நீங்கள் நகர்த்த வேண்டும்.

# validation.lielow.INCORRECT_DISTANCE
source: Pieces must move a number of spaces equal to the height of its stack orthogonally or diagonally.
ta: துண்டுகள் அதன் அடுக்கின் ஆர்த்தோகனலி அல்லது குறுக்காக அதன் உயரத்திற்கு சமமான பல இடைவெளிகளை நகர்த்த வேண்டும்.

# validation.lielow.INITIAL_INSTRUCTIONS
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.lielow.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.lielow.TOOFAR
source: You cannot bear off from here.
ta: நீங்கள் இங்கிருந்து தாங்க முடியாது.

# validation.lifeline.INITIAL_INSTRUCTIONS
source: Select a cell to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.lifeline.SECOND_PIECE
source: Place a second piece for your first turn.
ta: உங்கள் முதல் திருப்பத்திற்கு இரண்டாவது துண்டு வைக்கவும்.

# validation.lifeline.ADJACENT
source: Your second piece cannot be adjacent to your first (immediate loss).
ta: உங்கள் இரண்டாவது துண்டு உங்கள் முதல் (உடனடி இழப்பு) அருகில் இருக்க முடியாது.

# validation.lifeline.TOO_MANY_PIECES
source: Too many pieces.
ta: பல துண்டுகள்.

# validation.lifeline.INCURSION
source: The cell at {{cell}} has no path to a friendly group.
ta: {{cell} at இல் உள்ள கலத்திற்கு நட்பு குழுவிற்கு பாதை இல்லை.

# validation.loa.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.loa.INITIAL_INSTRUCTIONS
source: Select one of your pieces to move.
ta: நகர்த்த உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.loa.NOT_IN_RANGE
source: You cannot reach {{to}} from {{from}}.
ta: } இருந்து இலிருந்து {{to}} ஐ அடைய முடியாது.

# validation.loa.PARTIAL
source: Select your destination.
ta: உங்கள் இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.logger.ACT
source: Click an empty space adjacent to your logger to plant, click a mature tree adjacent to your logger to cut it down, or click one of your protestors to place it.
ta: நடவு செய்ய உங்கள் லாகருக்கு அருகிலுள்ள வெற்று இடத்தைக் சொடுக்கு செய்க, அதை வெட்ட உங்கள் லாகருக்கு அருகிலுள்ள முதிர்ந்த மரத்தைக் சொடுக்கு செய்க, அல்லது அதை வைக்க உங்கள் எதிர்ப்பாளர்களில் ஒருவரைக் சொடுக்கு செய்க.

# validation.logger.DUPE_SPAWN
source: You can't spawn a sapling from {{tree}} to {{plot}}. You have already assigned that tree or plot earlier in your move.
ta: நீங்கள் {{tree}}} foun {{plot}} வரை ஒரு மரக்கன்றுகளை உருவாக்க முடியாது. உங்கள் நகர்வுக்கு முன்னர் அந்த மரத்தை அல்லது சதித்திட்டத்தை நீங்கள் ஏற்கனவே ஒதுக்கியுள்ளீர்கள்.

# validation.logger.DUPE_TREE
source: You can't protest the tree at {{tree}}. You already protested it earlier in your move.
ta: நீங்கள் மரத்தை {{tree} at இல் எதிர்ப்பு தெரிவிக்க முடியாது. உங்கள் நகர்வில் நீங்கள் ஏற்கனவே அதை எதிர்த்தீர்கள்.

# validation.logger.INITIAL_INSTRUCTIONS_place
source: Click a corner to place your logger.
ta: உங்கள் லாகரை வைக்க ஒரு மூலையைக் சொடுக்கு செய்க.

# validation.logger.INITIAL_INSTRUCTIONS_move
source: Click your logger to stay in place, or click a reachable cell within two spaces to move.
ta: இடத்தில் இருக்க உங்கள் லாகர் என்பதைக் சொடுக்கு செய்க, அல்லது நகர்த்த இரண்டு இடைவெளிகளுக்குள் அடையக்கூடிய கலத்தைக் சொடுக்கு செய்க.

# validation.logger.INVALID_CHOP
source: You may not chop down the tree at {{cell}}. The tree must be mature, unprotested, and adjacent to your logger.
ta: நீங்கள் மரத்தை {{cell} at இல் வெட்டக்கூடாது. மரம் முதிர்ச்சியடைந்ததாகவும், போன் செய்யப்படாததாகவும், உங்கள் லாகருக்கு அருகிலும் இருக்க வேண்டும்.

# validation.logger.INVALID_PLANT
source: You may not plant a tree at {{cell}}. The cell must be adjacent to your logger and empty.
ta: நீங்கள் ஒரு மரத்தை {{cell}} இல் நடக்கூடாது. செல் உங்கள் லாகருக்கு அருகில் இருக்க வேண்டும் மற்றும் காலியாக இருக்க வேண்டும்.

# validation.logger.INVALID_PROTEST
source: You may not protest the tree at {{tree}}. You may only protest currently unprotested mature trees.
ta: நீங்கள் மரத்தை {{tree} at இல் எதிர்ப்பு தெரிவிக்கக்கூடாது. நீங்கள் தற்போது பொதி இல்லாத முதிர்ந்த மரங்களை மட்டுமே எதிர்ப்பு தெரிவிக்க முடியும்.

# validation.logger.INVALID_SPAWN_plot
source: The plot you're trying to spawn into ({{plot}}) is not a valid spawning place for the tree at {{tree}}.
ta: நீங்கள் ({{plot}}) உருவாக முயற்சிக்கும் சூழ்ச்சி {{tree} at இல் உள்ள மரத்திற்கு சரியான முட்டையிடும் இடம் அல்ல.

# validation.logger.INVALID_SPAWN_tree
source: The tree you're trying to spawn ({{tree}}) is not going to grow this turn.
ta: நீங்கள் உருவாக்க முயற்சிக்கும் மரம் ({{tree}}) இந்த திருப்பத்தை வளர்க்கப் போவதில்லை.

# validation.logger.INVALID_TO
source: Loggers must either stay in place or move up to two spaces away. Remember they may only move orthogonally and may not enter occupied spaces.
ta: லாகர்கள் இடத்தில் இருக்க வேண்டும் அல்லது இரண்டு இடங்களுக்கு மேலே செல்ல வேண்டும். அவை ஆர்த்தோகனலாக மட்டுமே நகர்த்தக்கூடும் என்பதை நினைவில் கொள்ளுங்கள் மற்றும் ஆக்கிரமிக்கப்பட்ட இடங்களுக்குள் நுழையக்கூடாது.

# validation.logger.PARTIAL_PROTEST
source: Select an unprotested mature tree to place your protestor.
ta: உங்கள் எதிர்ப்பாளரை வைக்க பாதுகாப்பற்ற முதிர்ந்த மரத்தைத் தேர்ந்தெடுக்கவும்.

# validation.logger.PARTIAL_SPAWN_complete
source: Select one of the highlighted trees.
ta: சிறப்பிக்கப்பட்ட மரங்களில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.logger.PARTIAL_SPAWN_incomplete
source: Select an empty space adjacent to the tree at {{tree}}.
ta: {{மரத்தில் மரத்திற்கு அருகிலுள்ள வெற்று இடத்தைத் தேர்ந்தெடுக்கவும்.

# validation.logger.PLACE_CORNER
source: Loggers must be placed in one of the corners.
ta: லாகர்கள் ஒரு மூலையில் வைக்கப்பட வேண்டும்.

# validation.logger.PROTESTOR_LABEL
source: Player {{playerNum}}'s protestors
ta: பிளேயர் {{playerNum}} இன் எதிர்ப்பாளர்கள்

# validation.logger.TOO_MANY_PROTESTS
source: You are attempting to protest more trees than you have protestors.
ta: உங்களிடம் எதிர்ப்பாளர்களைக் காட்டிலும் அதிகமான மரங்களை எதிர்க்க முயற்சிக்கிறீர்கள்.

# validation.logger.TOO_MANY_SPAWNS
source: Your move assigns more spawns than appear to actually happen this turn ({{decisions}} > {{spawns}}).
ta: இந்த திருப்பத்தை ({{decisions}}> {{spawns}}) உண்மையில் நடப்பதை விட உங்கள் நடவடிக்கை அதிக ச்பான்களை ஒதுக்குகிறது.

# validation.lox.INITIAL_INSTRUCTIONS
source: Select a cell to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.lox.PLACE4CAPTURE
source: To make a capture, the cell must be suffixed with 'x'. Try '{{cell}}x'.
ta: ஒரு பிடிப்பு செய்ய, கலத்தை 'ஃச்' உடன் பின்னொட்டு செய்ய வேண்டும். '{{cell}} x' ஐ முயற்சிக்கவும்.

# validation.lox.INSUFFICIENT_LOS
source: {{count}} directions with line of sight is required to capture the cell on {{cell}}.
ta: {{cell} on இல் கலத்தைப் பிடிக்க பார்வைக் கோட்டுடன் {{count}} திசைகள் தேவை.

# validation.lox.CAPTURE4PLACE
source: You suffixed the cell with 'x' to indicate capture, but this is not a capture move. Try '{{cell}}'.
ta: பிடிப்பைக் குறிக்க நீங்கள் கலத்தை 'ஃச்' உடன் பின்னொதிக்கூட்டினீர்கள், ஆனால் இது ஒரு பிடிப்பு நடவடிக்கை அல்ல. '{{cell}}' ஐ முயற்சிக்கவும்.

# validation.lox.OPPONENT_CONTROLLED
source: The cell at {{where}} is controlled by your opponent.
ta: {{இல் உள்ள செல் உங்கள் எதிரியால் கட்டுப்படுத்தப்படுகிறது.

# validation.majorities.INITIAL_INSTRUCTIONS
source: Select two cells to place your pieces.
ta: உங்கள் துண்டுகளை வைக்க இரண்டு கலங்களைத் தேர்ந்தெடுக்கவும்.

# validation.majorities.INITIAL_INSTRUCTIONS_FIRST
source: Select a cell to place the first piece.
ta: முதல் பகுதியை வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.majorities.TOO_MANY_MOVES
source: You may only place two pieces.
ta: நீங்கள் இரண்டு துண்டுகளை மட்டுமே வைக்கலாம்.

# validation.majorities.TOO_MANY_MOVES_FIRST
source: You may only place one piece on the first move.
ta: முதல் நகர்வில் நீங்கள் ஒரு பகுதியை மட்டுமே வைக்கலாம்.

# validation.majorities.DUPLICATE
source: You have already placed a piece at {{where}}.
ta: நீங்கள் ஏற்கனவே ஒரு பகுதியை {{where}} இல் வைத்திருக்கிறீர்கள்.

# validation.majorities.HOLE
source: The cell at {{where}} is blocked.
ta: {{where}} தடுக்கப்பட்டுள்ளது.

# validation.majorities.ANOTHER
source: Select one more cell to place your piece.
ta: உங்கள் பகுதியை வைக்க இன்னும் ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.majorities.NORMALISE
source: The move needs to be normalised. Try '{{normalised}}'.
ta: நகர்வை இயல்பாக்க வேண்டும். '{{normalised}}' ஐ முயற்சிக்கவும்.

# validation.manalath.BAD_PASS
source: You may not pass if legal moves are available.
ta: சட்ட நகர்வுகள் கிடைத்தால் நீங்கள் தேர்ச்சி பெறக்கூடாது.

# validation.manalath.DESTINATION
source: Now select a destination.
ta: இப்போது ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.manalath.INITIAL_INSTRUCTIONS
source: Select a color to place. You can type 'w' or 'b', or click on the desired color on the upper left.
ta: இடத்திற்கு ஒரு வண்ணத்தைத் தேர்ந்தெடுக்கவும். நீங்கள் 'W' அல்லது 'B' என தட்டச்சு செய்யலாம், அல்லது மேல் இடதுபுறத்தில் விரும்பிய வண்ணத்தைக் சொடுக்கு செய்க.

# validation.manalath.INVALID_COLOUR
source: The only valid colours are 'w' and 'b'. You gave '{{colour}}'.
ta: செல்லுபடியாகும் வண்ணங்கள் 'W' மற்றும் 'B'. நீங்கள் '{{colour}}' கொடுத்தீர்கள்.

# validation.manalath.OVERSIZED_GROUP
source: This would create a group of more than five pieces.
ta: இது ஐந்து துண்டுகளுக்கு மேல் ஒரு குழுவை உருவாக்கும்.

# validation.margo.CANNOT_PLACE
source: {{where}} is not a valid place to put a ball.
ta: {{where}} ஒரு பந்தை வைக்க சரியான இடம் அல்ல.

# validation.margo.INITIAL_INSTRUCTIONS
source: Select a location to place a ball.
ta: ஒரு பந்தை வைக்க இடத்தைத் தேர்ந்தெடுக்கவும்.
