Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# descriptions.abande
source: Abande is the second game in Dieter Stein's stacking trilogy. Place or move pieces and stacks to generate the highest score you can whilst always keeping the board connected. The square, snubsquare, and hex boards are available.
ta: டயட்டர் ச்டீனின் ச்டாக்கிங் முத்தொகுப்பில் இரண்டாவது ஆட்டம். பலகையை எப்போதும் இணைக்க வைத்திருக்கும் அதே வேளையில் நீங்கள் அதிக மதிப்பெண்ணை உருவாக்க துண்டுகள் மற்றும் அடுக்குகளை வைக்கவும் அல்லது நகர்த்தவும். நாற்கை, ச்னப்ச்குவேர் மற்றும் ஃச் போர்டுகள் கிடைக்கின்றன.

# descriptions.accasta
source: Accasta is the first of Dieter Stein's stacking trilogy. The goal is to get three of your own stacks into the enemy's castle area. There are three different types of pieces in the base version. In the "Pari" variant, movement is determined by how many friendly pieces are in the stack.
ta: டைட்டர் ச்டீனின் ச்டாக்கிங் முத்தொகுப்பில் அக்ச்டா முதல். உங்கள் சொந்த மூன்று அடுக்குகளை எதிரிகளின் கோட்டை பகுதிக்குள் பெறுவதே குறிக்கோள். அடிப்படை பதிப்பில் மூன்று வெவ்வேறு வகையான துண்டுகள் உள்ளன. "பரி" மாறுபாட்டில், அடுக்கில் எத்தனை நட்பு துண்டுகள் உள்ளன என்பதன் மூலம் இயக்கம் தீர்மானிக்கப்படுகிறது.

# descriptions.acity
source: Alien City is a combination Piecepack/Icehouse game about building a city on a newly colonized world. Four guilds compete for customers, and the player has to predict which bets are going to pay off. Each turn, the player places either a tower or dome and may optionally claim a tower they think is going to score big when the game ends. Play continues until no more construction is possible. Scores are based on the relative positions of buildings to claimed towers.
ta: ஏலியன் சிட்டி என்பது புதிதாக காலனித்துவமயமாக்கப்பட்ட உலகில் ஒரு நகரத்தை உருவாக்குவது பற்றிய ஒரு கலவையான பீச் பேக்/ஐச்அவுச் விளையாட்டு ஆகும். வாடிக்கையாளர்களுக்காக நான்கு கில்ட்ச் போட்டியிடுகின்றனர், மேலும் எந்த சவால்கள் செலுத்தப் போகின்றன என்பதை வீரர் கணிக்க வேண்டும். ஒவ்வொரு திருப்பமும், வீரர் ஒரு கோபுரம் அல்லது குவிமாடத்தை வைக்கிறார், மேலும் விளையாட்டு முடிவடையும் போது அவர்கள் பெரிய மதிப்பெண் பெறப்போகிறார்கள் என்று அவர்கள் நினைக்கும் கோபுரத்தை விருப்பமாகக் கோரலாம். இனி கட்டுமானம் சாத்தியமில்லை வரை விளையாட்டு தொடர்கிறது. கோரப்பட்ட கோபுரங்களுக்கு கட்டிடங்களின் ஒப்பீட்டு நிலைகளை அடிப்படையாகக் கொண்டது மதிப்பெண்கள்.

# descriptions.agere
source: A connection game where you can also stack pieces. Played either on a triangle board where you try to connect all three sides, or a circular "cobweb" board where you connect opposite sides.
ta: ஒரு இணைப்பு விளையாட்டு, அங்கு நீங்கள் துண்டுகளை அடுக்கி வைக்கலாம். நீங்கள் மூன்று பக்கங்களையும் இணைக்க முயற்சிக்கும் ஒரு முக்கோண பலகையில் அல்லது நீங்கள் எதிர் பக்கங்களை இணைக்கும் வட்டமான "கோப்வெப்" பலகை.

# descriptions.akron
source: Akron is an extension of standard connection games to three dimensions. On their turn, players may introduce new balls of their colour on the lowest layer of the board, or move a ball that is not pinned (having balls resting on it in two or more directions) to a space that is connected to the same group both before and after movement. When balls move, balls resting on it will drop, changing the connections on the board.
ta: அக்ரான் என்பது மூன்று பரிமாணங்களுக்கு நிலையான இணைப்பு விளையாட்டுகளின் நீட்டிப்பு ஆகும். அவர்களின் திருப்பத்தில், வீரர்கள் தங்கள் வண்ணத்தின் புதிய பந்துகளை போர்டின் மிகக் குறைந்த அடுக்கில் அறிமுகப்படுத்தலாம், அல்லது பின் செய்யப்படாத ஒரு பந்தை (பந்துகளை இரண்டு அல்லது அதற்கு மேற்பட்ட திசைகளில் வைத்திருத்தல்) ஒரே குழுவுடன் இணைக்கப்பட்ட ஒரு இடத்திற்கு நகர்த்தலாம் இயக்கத்திற்கு முன்னும் பின்னும். பந்துகள் நகரும்போது, அதில் ஓய்வெடுக்கும் பந்துகள் குறையும், பலகையில் உள்ள இணைப்புகளை மாற்றும்.

# descriptions.almatafl
source: AlmaTafl is an asymmetrical game where one side plays the defenders trying to get the king to safety, while the other side tries to capture the king or render him defenseless.
ta: அல்மாட்டாஃப் ஒரு சமச்சீரற்ற விளையாட்டு, அங்கு ஒரு பக்கம் ராசாவை பாதுகாப்பிற்கு கொண்டு வர முயற்சிக்கும் பாதுகாவலர்களை விளையாடுகிறது, அதே நேரத்தில் மறுபக்கம் ராசாவைப் பிடிக்க அல்லது அவரை பாதுகாப்பற்றதாக மாற்ற முயற்சிக்கிறது.

# descriptions.alta
source: Alta is a connection game played with switches on a diamond-shaped board. Connect your two sides with a path of switches of either player. On your turn, place a new switch or toggle one of your switches to change the orientation.
ta: ஆல்டா என்பது வைர வடிவ பலகையில் சுவிட்சுகளுடன் விளையாடும் இணைப்பு விளையாட்டு. உங்கள் இரு பக்கங்களையும் பிளேயரின் சுவிட்சுகளின் பாதையுடன் இணைக்கவும். உங்கள் திருப்பத்தில், புதிய சுவிட்சை வைக்கவும் அல்லது நோக்குநிலையை மாற்ற உங்கள் சுவிட்சுகளில் ஒன்றை மாற்றவும்.

# descriptions.amazons
source: A two-player game played on a 10x10 board. Each player has four queens (the eponymous amazons). Each turn, you move one of the queens and then shoot an arrow from your final square. The arrow causes that square to become blocked for the rest of the game. Queens and arrows cannot cross blocked squares or squares occupied by other queens. The winner is the last person who is able to move.
ta: இரண்டு பிளேயர் விளையாட்டு 10x10 போர்டில் விளையாடியது. ஒவ்வொரு வீரருக்கும் நான்கு ராணிகள் உள்ளன (பெயரிடப்பட்ட அமேசான்கள்). ஒவ்வொரு திருப்பமும், நீங்கள் ராணிகளில் ஒன்றை நகர்த்தி, பின்னர் உங்கள் இறுதி சதுரத்திலிருந்து ஒரு அம்புக்குறியை சுடவும். அம்பு அந்த நாற்கை விளையாட்டின் மீதமுள்ளவற்றுக்கு தடுக்கப்படுவதற்கு காரணமாகிறது. ராணிகள் மற்றும் அம்புகள் மற்ற ராணிகளால் ஆக்கிரமிக்கப்பட்டுள்ள தடுக்கப்பட்ட சதுரங்கள் அல்லது சதுரங்களைக் கடக்க முடியாது. வெற்றியாளர் நகர்த்தக்கூடிய கடைசி நபர்.

# descriptions.amoeba
source: Manipulate stacks of pieces to entrap your opponent's kernel or leave them with no legal moves.
ta: உங்கள் எதிரியின் கர்னலை நுழைக்க துண்டுகளின் அடுக்குகளை கையாளுங்கள் அல்லது சட்டப்பூர்வ நகர்வுகள் இல்லாமல் அவற்றை விடுங்கள்.

# descriptions.anache
source: In Anache, the goal is to occupy the opponent's corner squares by coordinating your pieces.
ta: அனாச்சில், உங்கள் துண்டுகளை ஒருங்கிணைப்பதன் மூலம் எதிரியின் மூலையில் சதுரங்களை ஆக்கிரமிப்பதே குறிக்கோள்.

# descriptions.archimedes
source: A game based on the legend of Archimedes teaching the Syracuse soldiers how to focus the sun's rays with their shields to set ships on fire. The goal is to begin your turn with a piece in your enemy's port. At the end of each turn, any enemy ships in sight of three of your pieces are destroyed by fire. Destroyed ships can eventually be rebuilt.
ta: சைராகச் படையினருக்கு கற்பிக்கும் ஆர்க்கிமிடசின் புராணத்தை அடிப்படையாகக் கொண்ட ஒரு விளையாட்டு, சூரியனின் கதிர்களை தங்கள் கேடயங்களுடன் எவ்வாறு கவனம் செலுத்துவது. உங்கள் எதிரியின் துறைமுகத்தில் ஒரு துண்டுடன் உங்கள் திருப்பத்தைத் தொடங்குவதே குறிக்கோள். ஒவ்வொரு திருப்பத்தின் முடிவிலும், உங்கள் மூன்று துண்டுகளைப் பார்க்கும் எந்த எதிரியும் நெருப்பால் அழிக்கப்படுகிறார்கள். அழிக்கப்பட்ட கப்பல்கள் இறுதியில் மீண்டும் கட்டப்படலாம்.

# descriptions.armadas
source: A miniatures-style game played with Looney pyramids where you captain a fleet of ships on the open seas, trying to sink all who stand against you.
ta: லூனி பிரமிடுகளுடன் ஒரு மினியேச்சர்-பாணி விளையாட்டு விளையாடியது, அங்கு நீங்கள் திறந்த கடல்களில் ஒரு கடற்படைகளைத் தேடுகிறீர்கள், உங்களுக்கு எதிராக நிற்கும் அனைவரையும் மூழ்கடிக்க முயற்சிக்கிறீர்கள்.

# descriptions.asli
source: Conquer territory and capture enemy groups by cutting them off from all their allies. A group is cut off when it has no free path (straight or otherwise) to other groups of its color. Captured groups are sent to an off-board prison where they give additional moves to their captor. Win by leaving your opponent with no moves.
ta: பிரதேசத்தை வென்று எதிரி குழுக்களை அவர்களின் அனைத்து நட்பு நாடுகளிலிருந்தும் வெட்டுவதன் மூலம் அவற்றைக் கைப்பற்றுங்கள். ஒரு குழு அதன் நிறத்தின் மற்ற குழுக்களுக்கு இலவச பாதை (நேராக அல்லது வேறுவிதமாக) இல்லாதபோது துண்டிக்கப்படுகிறது. கைப்பற்றப்பட்ட குழுக்கள் ஆஃப்-போர்டு சிறைக்கு அனுப்பப்படுகின்றன, அங்கு அவர்கள் தங்கள் சிறைப்பிடிக்கப்பட்டவருக்கு கூடுதல் நகர்வுகளை வழங்குகிறார்கள். எந்த நகர்வுகளும் இல்லாமல் உங்கள் எதிரியை விட்டுவிட்டு வெல்லுங்கள்.

# descriptions.assembly
source: A simultaneous selection game where you try to trigger scoring when high-value products are on your sections of the assembly line. Highest score at the end of the game wins.
ta: பேரவை வரிசையின் உங்கள் பிரிவுகளில் அதிக மதிப்புள்ள தயாரிப்புகள் இருக்கும்போது மதிப்பெண்களைத் தூண்ட முயற்சிக்கும் ஒரே நேரத்தில் தேர்வு விளையாட்டு. விளையாட்டின் முடிவில் அதிக மதிப்பெண் செய் பெறுகிறது.

# descriptions.ataxx
source: Control the majority of spaces by spreading, jumping and infecting.
ta: பரவல், குதித்தல் மற்றும் தொற்று ஆகியவற்றின் மூலம் பெரும்பாலான இடைவெளிகளைக் கட்டுப்படுத்தவும்.

# descriptions.atoll
source: Atoll is a generalisation of Hex where you have to connect two islands of your colour on opposite sides of the board with a contiguous chain of stones of your colour. The islands themselves can be part of the chain. So, for example, you could form one bridge between your north and west islands and a second bridge between your west and south islands to win.
ta: அட்டோல் என்பது எக்சின் பொதுமைப்படுத்தல் ஆகும், அங்கு உங்கள் வண்ணத்தின் இரண்டு தீவுகளை போர்டின் எதிர் பக்கங்களில் உங்கள் வண்ணத்தின் கற்களின் தொடர்ச்சியான சங்கிலியுடன் இணைக்க வேண்டும். தீவுகளே சங்கிலியின் ஒரு பகுதியாக இருக்கலாம். எனவே, எடுத்துக்காட்டாக, உங்கள் வடக்கு மற்றும் மேற்கு தீவுகளுக்கு இடையில் ஒரு பாலத்தையும், உங்கள் மேற்கு மற்றும் தென் தீவுகளுக்கு இடையில் இரண்டாவது பாலத்தையும் வெல்ல முடியும்.

# descriptions.attangle
source: Attangle is the final entry in Dieter Stein's stacking trilogy. Place and move pieces to build stacks. First person to build three triple stacks wins. The "Grand Attangle" variant is also implemented.
ta: டயட்டர் ச்டீனின் ச்டாக்கிங் முத்தொகுப்பில் இறுதி நுழைவு உள்ளது. அடுக்குகளை உருவாக்கத் துண்டுகளை வைக்கவும். மூம்மூன்று அடுக்குகளை உருவாக்கும் முதல் நபர் வெற்றிகளைப் பெற்றார். "கிராண்ட் அட்டாங்கல்" மாறுபாடும் செயல்படுத்தப்படுகிறது.

# descriptions.ayu
source: Unification game where snaky groups of pieces crawl toward their friends and eventually coalesce. If you cannot make a move on your turn, you win. This occurs when you have only one group or there is no free path between any of your groups.
ta: ச்னாக்கி குழுக்கள் தங்கள் நண்பர்களை நோக்கி ஊர்ந்து இறுதியில் ஒன்றிணைக்கும் ஒருங்கிணைப்பு விளையாட்டு. உங்கள் திருப்பத்தில் நீங்கள் நகர்த்த முடியாவிட்டால், நீங்கள் வெல்வீர்கள். உங்களிடம் ஒரே ஒரு குழு மட்டுமே இருக்கும்போது அல்லது உங்கள் குழுக்களுக்கு இடையில் இலவச பாதை இல்லாதபோது இது நிகழ்கிறது.

# descriptions.azacru
source: A territory-control game where directional pieces navigate a subdivided board to claim cells.
ta: ஒரு பிரதேச-கட்டுப்பாட்டு விளையாட்டு, அங்கு திசை துண்டுகள் ஒரு துணைப்பிரிவு வாரியத்திற்கு செலவை கோருகின்றன.

# descriptions.bao
source: A traditional mancala-style sowing game from East Africa where you attempt to eliminate all pieces from the opposing front row or leave them with no legal moves.
ta: கிழக்கு ஆபிரிக்காவிலிருந்து ஒரு பாரம்பரிய மான்காலா பாணி விதைப்பு விளையாட்டு, அங்கு நீங்கள் அனைத்து பகுதிகளையும் எதிரெதிர் முன் வரிசையில் இருந்து அகற்ற முயற்சிக்கிறீர்கள் அல்லது சட்டப்பூர்வ நகர்வுகள் இல்லாமல் அவற்றை விட்டுவிடுகிறீர்கள்.

# descriptions.basalt
source: A triangular connection game played on the side of a volcano, where lava and basalt vye to connect the three sides first.
ta: ஒரு எரிமலையின் பக்கத்தில் ஒரு முக்கோண இணைப்பு விளையாட்டு விளையாடியது, அங்கு லாவா மற்றும் பாசால்ட் வைச் மூன்று பக்கங்களையும் முதலில் இணைக்க.

# descriptions.bide
source: Up to six players take turns placing pieces on the board, pushing adjacent pieces outward. One can also pass to build up a number of pieces that can be placed at once later. Pieces closer to the centre are more valuable. Highest-scoring group wins!
ta: ஆறு வீரர்கள் வரை பலகையில் துண்டுகளை வைத்து, அருகிலுள்ள துண்டுகளை வெளிப்புறமாக தள்ளுகிறார்கள். ஒரு முறை பின்னர் வைக்கக்கூடிய பல துண்டுகளை உருவாக்க ஒருவர் கடந்து செல்லலாம். மையத்திற்கு நெருக்கமான துண்டுகள் மிகவும் மதிப்புமிக்கவை. அதிக மதிப்பெண் பெற்ற குழு வெற்றிகள்!

# descriptions.biscuit
source: A domino-style Decktet game where you play cards to immediately score points and try to be the first to play all the cards in your hand. A game is played over multiple rounds to a specified target.
ta: ஒரு டோமினோ-பாணி டெக்டெட் விளையாட்டு, அங்கு நீங்கள் உடனடியாக புள்ளிகளைப் பெற அட்டைகளை விளையாடுகிறீர்கள், மேலும் உங்கள் கையில் உள்ள அனைத்து அட்டைகளையும் முதலில் விளையாட முயற்சிக்கிறீர்கள். ஒரு குறிப்பிட்ட இலக்குக்கு பல சுற்றுகளில் ஒரு விளையாட்டு விளையாடப்படுகிறது.

# descriptions.blam
source: An Icehouse game for 2–4 players played on a standard chess board. Pieces placed push adjacent pieces away. Push pieces off the board to capture them. Whoever has captured the highest pip total of pieces at the end of the game wins.
ta: 2-4 வீரர்களுக்கான ஐச்அவுச் விளையாட்டு ஒரு நிலையான சதுரங்கப் பலகையில் விளையாடியது. துண்டுகள் தள்ளப்பட்ட புச் அருகிலுள்ள துண்டுகள். அவற்றைப் பிடிக்க பலகையில் இருந்து துண்டுகளைத் தள்ளுங்கள். விளையாட்டின் முடிவில் மிக உயர்ந்த பிஐபி மொத்த துண்டுகளை யார் கைப்பற்றினாலும் செய் பெறுகிறார்கள்.

# descriptions.blastradius
source: An abstract war game where pieces irradiate the spaces around them. Eliminate all opposing pieces.
ta: ஒரு சுருக்கமான போர் விளையாட்டு, அங்கு துண்டுகள் அவற்றைச் சுற்றியுள்ள இடங்களை கதிர்வீச்சு செய்கின்றன. அனைத்து எதிரெதிர் துண்டுகளையும் அகற்றவும்.

# descriptions.blockade
source: Blockade (also known as Cul-de-sac) is a 'beat the barrier' game where you get one of your pawns to a starting space of your opponent. Players place 2-wide walls to block each other.
ta: முற்றுகை (குல்-டி-சாக் என்றும் அழைக்கப்படுகிறது) என்பது ஒரு 'பீட் தி பேரியர்' விளையாட்டாகும், அங்கு உங்கள் சிப்பாய்களில் ஒன்றை உங்கள் எதிரியின் தொடக்க இடத்திற்கு பெறுவீர்கள். வீரர்கள் ஒருவருக்கொருவர் தடுக்க 2 அகலமான சுவர்களை வைக்கின்றனர்.

# descriptions.blooms
source: Each player owns 2 colours of stones. Players take turns placing one or two stones each turn (if you place two, they must be different colours), then capture all fenced enemy blooms. The first player to capture a certain number of stones wins.
ta: ஒவ்வொரு வீரருக்கும் 2 வண்ண கற்கள் உள்ளன. ஒவ்வொரு திருப்பத்தையும் வீரர்கள் ஒன்று அல்லது இரண்டு கற்களை வைக்கும் திருப்பங்களை எடுத்துக்கொள்கிறார்கள் (நீங்கள் இரண்டை வைத்தால், அவை வெவ்வேறு வண்ணங்களாக இருக்க வேண்டும்), பின்னர் அனைத்து வேலி கொண்ட எதிரி பூக்களையும் பிடிக்கவும். ஒரு குறிப்பிட்ட எண்ணிக்கையிலான கற்களைப் பிடிக்கும் முதல் வீரர் செய் பெறுகிறார்.

# descriptions.bloqueo
source: Manipulate pawns to create towers of player pieces. Score points based on connected groups of controlled towers. Highest score wins.
ta: பிளேயர் துண்டுகளின் கோபுரங்களை உருவாக்க சிப்பாய்களைக் கையாளவும். கட்டுப்படுத்தப்பட்ட கோபுரங்களின் இணைக்கப்பட்ட குழுக்களின் அடிப்படையில் மதிப்பெண் புள்ளிகள். அதிக மதிப்பெண் வெற்றிகள்.

# descriptions.boom
source: A minimalist abstract that combines simple move and capture mechanics with a scoring mechanic. Score by bearing your stacks off the opposing side of the board, but you'll want to reduce your opponent's scoring opportunities at the same time.
ta: ஒரு மதிப்பெண் மெக்கானிக்குடன் எளிய நகர்வு மற்றும் பிடிப்பு இயக்கவியலை ஒருங்கிணைக்கும் ஒரு குறைந்தபட்ச சுருக்கம். போர்டின் எதிரெதிர் பக்கத்திலிருந்து உங்கள் அடுக்குகளை தாங்குவதன் மூலம் மதிப்பெண், ஆனால் உங்கள் எதிரியின் மதிப்பெண் வாய்ப்புகளை ஒரே நேரத்தில் குறைக்க விரும்புவீர்கள்.

# descriptions.bounce
source: Manoeuvre your disconnected checkers into a single, orthogonally connected whole.
ta: உங்கள் துண்டிக்கப்பட்ட செக்கர்களை ஒற்றை, ஆர்த்தோகனலாக இணைக்கப்பட்ட முழுவதுமாக சூழ்ச்சி செய்யுங்கள்.

# descriptions.boxes
source: A territorial game where you try to complete boxes by drawing lines to connect the dots. If a box is claimed, you may make another move.
ta: புள்ளிகளை இணைக்க கோடுகளை வரைவதன் மூலம் பெட்டிகளை முடிக்க முயற்சிக்கும் ஒரு பிராந்திய விளையாட்டு. ஒரு பெட்டி உரிமை கோரப்பட்டால், நீங்கள் மற்றொரு நகர்வை மேற்கொள்ளலாம்.

# descriptions.breakthrough
source: One of the simplest "get to your opponent's home row" games around. Pieces move and capture like chess pawns. First to the other home row wins. Also includes a "Bombardment" variant where instead of regular capture moves, one can detonate a piece, which destroys it and all pieces around it.
ta: எளிமையான "உங்கள் எதிரியின் வீட்டு வரிசையைப் பெறுங்கள்" விளையாட்டுகளில் ஒன்று. துண்டுகள் செச் பான்ச் போல நகர்ந்து கைப்பற்றுகின்றன. முதலில் மற்ற வீட்டு வரிசை வெற்றி. ஒரு "குண்டுவெடிப்பு" மாறுபாடும் அடங்கும், அங்கு வழக்கமான பிடிப்பு நகர்வுகளுக்கு பதிலாக, ஒருவர் ஒரு பகுதியை வெடிக்கச் செய்யலாம், அது அதை அழிக்கிறது மற்றும் அதைச் சுற்றியுள்ள அனைத்து துண்டுகளும்.

# descriptions.bug
source: Fill the ecosystem with your bugs so much that you can no longer expand. On your turn, place a piece to start a new bug or grow an existing bug. Then, if any of your bugs are adjacent to enemy bugs of the same shape, they must eat them, and perform a bonus growth (if bonus growth is not possible, no eating occurs). This can result in chain reactions. If there are multiple choices of bugs that can eat, you may determine which bugs do it and in which order.
ta: உங்கள் பிழைகள் மூலம் சுற்றுச்சூழல் அமைப்பை நிரப்பவும், நீங்கள் இனி விரிவாக்க முடியாது. உங்கள் திருப்பத்தில், புதிய பிழையைத் தொடங்க ஒரு பகுதியை வைக்கவும் அல்லது ஏற்கனவே உள்ள பிழையை வளர்க்கவும். பின்னர், உங்கள் பிழைகள் ஏதேனும் ஒரே வடிவத்தின் எதிரி பிழைகளுக்கு அருகில் இருந்தால், அவை அவற்றை சாப்பிட வேண்டும், மேலும் போனச் வளர்ச்சியைச் செய்ய வேண்டும் (போனச் வளர்ச்சி சாத்தியமில்லை என்றால், உணவு எதுவும் ஏற்படாது). இது சங்கிலி எதிர்வினைகளை ஏற்படுத்தும். சாப்பிடக்கூடிய பிழைகள் பல தேர்வுகள் இருந்தால், எந்த பிழைகள் அதைச் செய்கின்றன, எந்த வரிசையில் நீங்கள் தீர்மானிக்கலாம்.

# descriptions.buku
source: Buku is a two-dimensional sowing game on a checkerboard where the colour corresponds to the pits of each player. The first player selects a row to collect, then pieces are sown from any square towards any orthogonal direction but never passing the same square twice. The second player does the same, but collects from columns. After sowing, any square with 3 or 4 pieces on their colour are captured. The game ends when one player gets more than half the total number of possible points, or all pieces are singletons (each player claims one point for every piece in their pit), or when the board position is repeated (other player claims the rest of the pieces). The first player gets an additonal piece on the first sow.
ta: புக்கு என்பது ஒரு செக்கர்போர்டில் இரு பரிமாண விதைப்பு விளையாட்டாகும், அங்கு வண்ணம் ஒவ்வொரு வீரரின் குழிகளுக்கும் ஒத்திருக்கிறது. முதல் வீரர் சேகரிக்க ஒரு வரிசையைத் தேர்ந்தெடுக்கிறார், பின்னர் துண்டுகள் எந்த சதுரத்திலிருந்து எந்த ஆர்த்தோகனல் திசையையும் நோக்கி விதைக்கப்படுகின்றன, ஆனால் ஒரே சதுரத்தை இரண்டு முறை கடந்து செல்லாது. இரண்டாவது பிளேயர் அவ்வாறே செய்கிறது, ஆனால் நெடுவரிசைகளிலிருந்து சேகரிக்கிறது. விதைத்த பிறகு, அவற்றின் நிறத்தில் 3 அல்லது 4 துண்டுகள் கொண்ட எந்த சதுரமும் கைப்பற்றப்படுகிறது. ஒரு வீரர் மொத்த புள்ளிகளின் மொத்த எண்ணிக்கையில் பாதிக்கும் மேலாக பெறும்போது விளையாட்டு முடிவடைகிறது, அல்லது அனைத்து துண்டுகளும் சிங்கிள்டன்கள் (ஒவ்வொரு வீரரும் தங்கள் குழியில் உள்ள ஒவ்வொரு துண்டுக்கும் ஒரு புள்ளியைக் கோருகிறார்கள்), அல்லது போர்டு நிலை மறுநிகழ்வு வரும்போது (மற்ற வீரர்கள் மீதமுள்ள துண்டுகளை கோருகிறார்கள்). முதல் வீரர் முதல் விதையில் ஒரு சேர்க்கை துண்டு பெறுகிறார்.

# descriptions.byte
source: Manoeuvre and merge stacks of checkers while attempting to be the one on top when the stack reaches a certain height.
ta: அடுக்கு ஒரு குறிப்பிட்ட உயரத்தை அடையும் போது மேலே இருக்க முயற்சிக்கும்போது, செக்கர்களின் அடுக்குகளை சூழ்ச்சி மற்றும் ஒன்றிணைக்கவும்.

# descriptions.c1
source: In C1 (or cone), each player commands 1 cone, 4 pyramids, and 10 sliding tiles with unique movements. Players manoeuvre their pieces to eliminate opponent tiles and ultimately surround the enemy cone on all four orthogonal sides using pieces or the voids left by vanished tiles.
ta: சி 1 (அல்லது கூம்பு) இல், ஒவ்வொரு வீரரும் 1 கூம்பு, 4 பிரமிடுகள் மற்றும் 10 நெகிழ் ஓடுகளை தனித்துவமான இயக்கங்களுடன் கட்டளையிடுகிறார்கள். எதிரிகளின் ஓடுகளை அகற்றுவதற்காக வீரர்கள் தங்கள் துண்டுகளை சூழ்ச்சி செய்கிறார்கள், இறுதியில் நான்கு ஆர்த்தோகனல் பக்கங்களிலும் எதிரி கூம்பைச் சுற்றியுள்ளனர்.

# descriptions.calculus
source: A free-form game where pieces of arbitrary size and shape are freely placed on a surface of any dimensions or shape, trying to connect opposite sides. The implementation here uses a round board and round pieces.
ta: தன்னிச்சையான அளவு மற்றும் வடிவத்தின் துண்டுகள் எந்தவொரு பரிமாணங்கள் அல்லது வடிவத்தின் மேற்பரப்பில் சுதந்திரமாக வைக்கப்பட்டு, எதிர் பக்கங்களை இணைக்க முயற்சிக்கும் ஒரு இலவச வடிவ விளையாட்டு. இங்கே செயல்படுத்தல் ஒரு சுற்று பலகை மற்றும் வட்ட துண்டுகளைப் பயன்படுத்துகிறது.

# descriptions.camelot
source: A classic game where you try to move two pieces into your opponent's castle or eliminate all of your opponent's pieces.
ta: உங்கள் எதிரியின் கோட்டையில் இரண்டு துண்டுகளை நகர்த்த முயற்சிக்கும் ஒரு உன்னதமான விளையாட்டு அல்லது உங்கள் எதிரியின் அனைத்து துண்டுகள் அனைத்தையும் அகற்றவும்.

# descriptions.cannon
source: A two-player game played on a 10x10 board. Soldiers can move independently, but three soldiers in a row form a "cannon" and can move along their length or kill soldiers two or three spaces away. The first player to capture the opposing town wins.
ta: இரண்டு பிளேயர் விளையாட்டு 10x10 போர்டில் விளையாடியது. படையினர் சுயாதீனமாக செல்ல முடியும், ஆனால் ஒரு வரிசையில் மூன்று வீரர்கள் ஒரு "பீரங்கியை" உருவாக்குகிறார்கள், மேலும் அவற்றின் நீளத்துடன் செல்லலாம் அல்லது இரண்டு அல்லது மூன்று இடைவெளிகளில் படையினரைக் கொல்லலாம். எதிரெதிர் நகரத்தை கைப்பற்றிய முதல் வீரர் செய் பெறுகிறார்.

# descriptions.catapult
source: Hurl your stones across the board to annihilate your opponent.
ta: உங்கள் எதிரியை நிர்மூலமாக்க உங்கள் கற்களை பலகை முழுவதும் வீசவும்.

# descriptions.catchup
source: Catchup is a simple abstract game with a devilish dynamic. The goal is to have the largest group of stones on the board when the board is full of stones, but as you get closer to winning, your opponent gets more powerful. Whereas most stone-placement games are about position, Catchup is about timing, position, and the interplay between them.
ta: கேட்ச்அப் ஒரு பிசாசு மாறும் கொண்ட ஒரு எளிய சுருக்க விளையாட்டு. பலகையில் கற்களால் நிரம்பியிருக்கும் போது பலகையில் மிகப் பெரிய கற்களைக் கொண்டிருப்பதே குறிக்கோள், ஆனால் நீங்கள் வெற்றிபெற நெருங்கி வரும்போது, உங்கள் எதிரி அதிக சக்திவாய்ந்ததாகிறது. பெரும்பாலான கல்-வேலைவாய்ப்பு விளையாட்டுகள் நிலையைப் பற்றியது என்றாலும், கேட்ச்அப் என்பது நேரம், நிலை மற்றும் அவற்றுக்கிடையேயான இடைவெளி பற்றியது.

# descriptions.ccorridor
source: In Cairo Corridor players alternate turns placing their pentagonal pieces, on a board with a Cairo pentagonal tiling. Eventually there will be only one 'path' of empty spaces which connects the 4 sides. Players score points based on how many tiles are adjacent to that path. In the event of a tie, the player that placed the last tile before the game ends loses.
ta: கெய்ரோ தாழ்வார வீரர்களில், கெய்ரோ பென்டகோனல் டைலிங் கொண்ட ஒரு போர்டில், தங்கள் பென்டகோனல் துண்டுகளை வைப்பதை மாற்று திருப்பங்கள். இறுதியில் 4 பக்கங்களை இணைக்கும் வெற்று இடங்களின் ஒரே ஒரு 'பாதை' மட்டுமே இருக்கும். அந்த பாதையை ஒட்டிய எத்தனை ஓடுகள் உள்ளன என்பதை அடிப்படையாகக் கொண்டு வீரர்கள் புள்ளிகளைப் பெறுகிறார்கள். ஒரு டை ஏற்பட்டால், விளையாட்டு முடிவடைவதற்கு முன்பு கடைசி ஓடு வைத்த வீரர் தோற்றார்.

# descriptions.ceph
source: A two-player game of area control by capture using dice. The goal is to fill a board with as many of your dice as possible. This is complicated by a capturing mechanic that keeps the board in constant flux. The game ends when the board has been completely filled. Draws are not possible.
ta: டைசைப் பயன்படுத்தி பிடிப்பதன் மூலம் பகுதி கட்டுப்பாட்டின் இரண்டு வீரர் விளையாட்டு. உங்கள் பகடைகளில் ஒரு பலகையை முடிந்தவரை நிரப்புவதே குறிக்கோள். கைப்பற்றும் மெக்கானிக்கால் இது சிக்கலானது, இது பலகையை நிலையான பாய்வில் வைத்திருக்கிறது. பலகை முழுமையாக நிரப்பப்பட்டதும் விளையாட்டு முடிகிறது. டிராக்கள் சாத்தியமில்லை.
