Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# variants.pylon.quickStart.description
source: A learning mode that randomly places the pyramids for you, so players start directly at the stacking half of the game.
ta: உங்களுக்காக பிரமிடுகளை தோராயமாக வைக்கும் ஒரு கற்றல் பயன்முறை, எனவே வீரர்கள் விளையாட்டின் அடுக்கி வைக்கும் பாதியில் நேரடியாகத் தொடங்குகிறார்கள்.

# variants.quagmire.#board.name
source: Default board (37 cells)
ta: இயல்புநிலை பலகை (37 செல்கள்)

# variants.quagmire.#setup.description
source: The starting position will be an empty board.
ta: தொடக்க நிலை ஒரு வெற்று வாரியமாக இருக்கும்.

# variants.quagmire.large.name
source: Larger board (61 cells)
ta: பெரிய பலகை (61 செல்கள்)

# variants.quagmire.random.description
source: The starting position will have some pre-flooded spaces.
ta: தொடக்க நிலை சில முன் வெள்ளம் கொண்ட இடங்களைக் கொண்டிருக்கும்.

# variants.quagmire.random.name
source: Random setup
ta: சீரற்ற அமைப்பு

# variants.quax.#board.name
source: 11x11 board
ta: 11x11 போர்டு

# variants.quax.size-15.name
source: 15x15 board
ta: 15x15 போர்டு

# variants.query.#board.name
source: 13x13 board
ta: 13x13 போர்டு

# variants.query.size-9.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.quincunx.excuse.name
source: The Excuse
ta: சாக்கு

# variants.quincunx.excuse.description
source: Adds The Excuse to the deck. This card accrues no basic scoring when played or when played next to, plays no role in straights, and it exacts no penalty if still in your hand at the end of the round.
ta: டெக்கிற்கு சாக்கு சேர்க்கிறது. இந்த அட்டை விளையாடும்போது அல்லது அடுத்ததாக விளையாடும்போது எந்த அடிப்படை மதிப்பெண்ணையும் பெறவில்லை, ச்ட்ரெய்ட்சில் எந்தப் பங்கையும் வகிக்காது, மேலும் சுற்றின் முடிவில் உங்கள் கையில் இருந்தால் அது தண்டம் விதிக்காது.

# variants.quincunx.flush.name
source: Flush bonuses
ta: போனச் ஃப்ளச்

# variants.quincunx.flush.description
source: When present, if the card you played creates or extends a continuous line (including diagonal) of four or more cards that share the same suit, or that forms a 2x2 square of cards that share a suit, score 10 points for each line and square.
ta: இருக்கும்போது, நீங்கள் விளையாடிய அட்டை ஒரே சூட்டைப் பகிர்ந்து கொள்ளும் நான்கு அல்லது அதற்கு மேற்பட்ட அட்டைகளின் தொடர்ச்சியான கோட்டை (மூலைவிட்ட உட்பட) உருவாக்கினால் அல்லது நீட்டினால், அல்லது அது ஒரு சூட்டைப் பகிர்ந்து கொள்ளும் 2x2 சதுர அட்டைகளை உருவாக்குகிறது, ஒவ்வொரு வரியுக்கும் சதுரத்திற்கும் 10 புள்ளிகளைப் பெறுகிறது.

# variants.realm.capturedBases.description
source: The number of captured bases becomes a second tie breaker.
ta: கைப்பற்றப்பட்ட தளங்களின் எண்ணிக்கை இரண்டாவது டை பிரேக்கராக மாறும்.

# variants.realm.capturedBases.name
source: Tie break: Captured bases
ta: டை பிரேக்: கைப்பற்றப்பட்ட தளங்கள்

# variants.realm.checkpoint.description
source: Moving pieces must stop in the first enemy controlled realm they enter.
ta: நகரும் துண்டுகள் அவர்கள் நுழையும் முதல் எதிரி கட்டுப்பாட்டு உலகில் நிறுத்தப்பட வேண்டும்.

# variants.realm.checkpoint.name
source: Checkpoint Charley
ta: சோதனைச் சாவடி சார்லி

# variants.realm.control.description
source: When rearranging a realm, you may also rearrange your opponent's pieces.
ta: ஒரு சாம்ராச்யத்தை மறுசீரமைக்கும்போது, உங்கள் எதிரியின் துண்டுகளையும் மறுசீரமைக்கலாம்.

# variants.realm.control.name
source: Control freak
ta: கட்டுப்பாட்டு குறும்பு

# variants.realm.lastFirst.description
source: After initial base and power placement, the second player moves first.
ta: ஆரம்ப அடிப்படை மற்றும் ஆற்றல் வேலைவாய்ப்புக்குப் பிறகு, இரண்டாவது வீரர் முதலில் நகர்கிறார்.

# variants.realm.lastFirst.name
source: And the last shall be first
ta: கடைசியாக முதலில் இருக்கும்

# variants.realm.lessBase.name
source: Fewer bases
ta: குறைவான தளங்கள்

# variants.realm.lessEnforcer.name
source: Fewer enforcers
ta: குறைவான செயல்படுத்துபவர்கள்

# variants.realm.moreBase.name
source: More bases
ta: மேலும் தளங்கள்

# variants.realm.moreEnforcer.name
source: More enforcers
ta: மேலும் செயல்படுத்துபவர்கள்

# variants.realm.morePower.name
source: More powers
ta: அதிக அதிகாரங்கள்

# variants.realm.relaxed.description
source: There are no restrictions on initial base placement.
ta: ஆரம்ப அடிப்படை வேலைவாய்ப்பில் எந்த கட்டுப்பாடுகளும் இல்லை.

# variants.realm.relaxed.name
source: Relaxed placement
ta: தளர்வான வேலை வாய்ப்பு

# variants.realm.replacement.description
source: Captured bases are immediately replaced by one of your own. Leads to a much faster game.
ta: கைப்பற்றப்பட்ட தளங்கள் உடனடியாக உங்கள் சொந்த ஒன்றால் மாற்றப்படுகின்றன. மிக வேகமான விளையாட்டுக்கு வழிவகுக்கிறது.

# variants.realm.replacement.name
source: Capture by replacement
ta: மாற்றாக பிடிக்கவும்

# variants.realm.TEST.description
source: Do not select.
ta: தேர்ந்தெடுக்க வேண்டாம்.

# variants.realm.TEST.name
source: TESTING
ta: சோதனை

# variants.renju.#opening.description
source: The first player has to place their first stone in the centre of the board. There are no other opening placement restrictions.
ta: முதல் வீரர் தங்கள் முதல் கல்லை வாரியத்தின் மையத்தில் வைக்க வேண்டும். வேறு எந்த தொடக்க வேலைவாய்ப்பு கட்டுப்பாடுகளும் இல்லை.

# variants.renju.#opening.name
source: Centre opening
ta: மைய திறப்பு

# variants.renju.#tiebreaker.name
source: No tiebreak
ta: டைபிரேக் இல்லை

# variants.renju.pass.description
source: After the opening phase, a player may pass instead of make a move to win the tiebreaker. If the board is filled without a winner, the player who passed wins. If no player passed, second player wins.
ta: தொடக்க கட்டத்திற்குப் பிறகு, ஒரு வீரர் டைபிரேக்கரை வெல்ல ஒரு நடவடிக்கைக்குப் பதிலாகக் கடந்து செல்லலாம். ஒரு வெற்றியாளர் இல்லாமல் போர்டு நிரப்பப்பட்டால், தேர்ச்சி பெற்ற வீரர் வெற்றி பெறுகிறார். எந்த வீரரும் கடந்து செல்லவில்லை என்றால், இரண்டாவது வீரர் வெற்றி பெறுவார்.

# variants.renju.pass.name
source: Pass tiebreak
ta: பாச் டைபிரேக்

# variants.renju.rif.description
source: Classic Renju International Federation rules. Select a canonical opening and the other player may swap. Two tentative fifths are given. <https://www.renju.net/rule/1/>
ta: கிளாசிக் ரென்சு பன்னாட்டு கூட்டமைப்பு விதிகள். ஒரு நியமன திறப்பைத் தேர்ந்தெடுத்து மற்ற வீரர் இடமாற்றம் செய்யலாம். இரண்டு தற்காலிக ஐந்தில் ஒரு பங்கு வழங்கப்படுகிறது. <https://www.renju.net/rule/1/>

# variants.renju.rif.name
source: Classic RIF opening
ta: கிளாசிக் ரிஃப் திறப்பு

# variants.renju.soosyrv-8.description
source: Official tournament rule since 2015. Starts like RIF, but upon placing the fourth stone, up to 8 tentative fifths can be declared, and the other player may swap. <https://www.renju.net/rule/24/>
ta: 2015 முதல் உத்தியோகபூர்வ போட்டி விதி. RIF போல தொடங்குகிறது, ஆனால் நான்காவது கல்லை வைத்தவுடன், 8 தற்காலிக ஐந்தில் ஒரு பங்கு வரை அறிவிக்க முடியும், மற்ற வீரர் இடமாற்றம் செய்யலாம். <https://www.renju.net/rule/24/>

# variants.renju.soosyrv-8.name
source: Soosõrv-8 opening
ta: Soosõrv-8 திறப்பு

# variants.renju.swap-2.description
source: Free opening. The first player places three stones. The next player may do one of (1) place a single stone to continue as player 2, (2) swap colours to play as player 1, or (3) place two more stones and allow the opponent to decide to play as player 1 or player 2.
ta: இலவச திறப்பு. முதல் வீரர் மூன்று கற்களை வைக்கிறார். அடுத்த வீரர் (1) பிளேயர் 2 ஆக தொடர ஒரு கல்லை வைக்கலாம், (2) பிளேயர் 1 ஆக விளையாட வண்ணங்களை மாற்றவும், அல்லது (3) மேலும் இரண்டு கற்களை வைக்கவும், எதிரியை பிளேயர் 1 அல்லது பிளேயர் 2 ஆக விளையாட முடிவு செய்ய அனுமதிக்கலாம்.

# variants.renju.swap-2.name
source: Swap-2 opening
ta: இடமாற்று -2 திறப்பு

# variants.renju.swap-5.description
source: Free opening. For the first five stones on the board, after placement, the next player has the option to swap colours.
ta: இலவச திறப்பு. போர்டில் முதல் ஐந்து கற்களுக்கு, வேலைவாய்ப்புக்குப் பிறகு, அடுத்த வீரருக்கு வண்ணங்களை மாற்ற விருப்பம் உள்ளது.

# variants.renju.swap-5.name
source: Swap-5 opening
ta: இடமாற்று -5 திறப்பு

# variants.renju.taraguchi-10.description
source: Beginner-friendly rule that is popular in correspondence games. Each player places one stone during the opening and the other player may swap. 10-tentative-fifths rule is implemented in case a player tries to make an exploitive opening (beginners may ignore this). <https://www.renju.net/rule/25/>
ta: கடித விளையாட்டுகளில் பிரபலமான தொடக்க-நட்பு விதி. ஒவ்வொரு வீரரும் திறப்பின் போது ஒரு கல்லை வைக்கிறார்கள், மற்ற வீரர் இடமாற்றம் செய்யலாம். ஒரு வீரர் சுரண்டல் திறப்பைச் செய்ய முயற்சித்தால் 10-மெயரிக்கும் ஐந்தாம் விதி செயல்படுத்தப்படுகிறது (ஆரம்பநிலைகள் இதை புறக்கணிக்கலாம்). <https://www.renju.net/rule/25/>

# variants.renju.taraguchi-10.name
source: Taraguchi-10 opening
ta: தாராகுச்சி -10 திறப்பு

# variants.renju.yamaguchi.description
source: Official tournament rule from 2009 to 2015. Simple modification to the RIF opening where instead of a fixed number of tentative fifths (two), on the first move, the player declares the number of tentative fifths. <https://www.renju.net/rule/5/>
ta: 2009 முதல் 2015 வரை உத்தியோகபூர்வ போட்டி விதி. RIF திறப்புக்கு எளிய மாற்றம், அங்கு ஒரு குறிப்பிட்ட எண்ணிக்கையிலான தற்காலிக ஐந்தில் (இரண்டு) பதிலாக, முதல் நகர்வின் போது, வீரர் தற்காலிக ஐந்தில் எண்ணிக்கையை அறிவிக்கிறார். <https://www.renju.net/rule/5/>

# variants.renju.yamaguchi.name
source: Yamaguchi opening
ta: யமகுச்சி திறப்பு

# variants.resolve.#board.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.resolve.size-13.name
source: 13x13 board
ta: 13x13 போர்டு

# variants.reversi.#board.name
source: Default 8x8 board
ta: இயல்புநிலை 8x8 போர்டு

# variants.reversi.anti.description
source: The player who has the fewest pieces at the end of the game wins.
ta: விளையாட்டின் முடிவில் மிகக் குறைந்த துண்டுகளை வைத்திருக்கும் வீரர் செய் பெறுகிறார்.

# variants.reversi.anti.name
source: Anti-Reversi
ta: திரும்பிய எதிர்ப்பு

# variants.reversi.hexagon-5.description
source: Hexagonal base-5 board with setup popularised by ItsYourTurn.com.
ta: Itsyourturn.com ஆல் பிரபலப்படுத்தப்பட்ட அமைப்புடன் அறுகோண பேச் -5 போர்டு.

# variants.reversi.hexagon-5.name
source: Hexagonal board (base-5)
ta: அறுகோணப் பலகை (அடி-5)

# variants.reversi.hexagon-6.description
source: Hexagonal base-6 board with setup popularised by ItsYourTurn.com.
ta: Itsyourturn.com ஆல் பிரபலப்படுத்தப்பட்ட அமைப்புடன் அறுகோண பேச் -6 போர்டு.

# variants.reversi.hexagon-6.name
source: Hexagonal board (base-6)
ta: அறுகோணப் பலகை (அடி-6)

# variants.reversi.octagon-8.description
source: Standard 8x8 board with the corners blocked.
ta: மூலைகள் தடுக்கப்பட்ட நிலையான 8x8 போர்டு.

# variants.reversi.octagon-8.name
source: Octagonal board (8x8)
ta: எண்கோண வாரியம் (8x8)

# variants.reversi.octagon-10.description
source: Standard 10x10 board with the corners blocked.
ta: மூலைகள் தடுக்கப்பட்ட நிலையான 10x10 போர்டு.

# variants.reversi.octagon-10.name
source: Octagonal board (10x10)
ta: எண்கோண வாரியம் (10x10)

# variants.reversi.standard-6.name
source: Smaller board (6x6)
ta: சிறிய பலகை (6x6)

# variants.reversi.standard-10.name
source: Grand board (10x10)
ta: கிராண்ட் போர்டு (10x10)

# variants.saltire.#board.name
source: 13x13 board
ta: 13x13 போர்டு

# variants.saltire.#ruleset.description
source: A swap must decrease either the number of crosscuts or the number of supercuts on the board, and it must not increase the number of crosscuts.
ta: ஒரு இடமாற்று குறுக்குவழிகளின் எண்ணிக்கை அல்லது பலகையில் உள்ள சூப்பர் சரிக்களின் எண்ணிக்கையை குறைக்க வேண்டும், மேலும் இது குறுக்குவழிகளின் எண்ணிக்கையை அதிகரிக்கக்கூடாது.

# variants.saltire.#ruleset.name
source: Default rules
ta: இயல்புநிலை விதிகள்

# variants.saltire.basic.description
source: A swap must decrease the number of crosscuts. Draws are possible.
ta: ஒரு இடமாற்று குறுக்குவழிகளின் எண்ணிக்கையை குறைக்க வேண்டும். டிராக்கள் சாத்தியம்.

# variants.saltire.basic.name
source: Basic rules
ta: அடிப்படை விதிகள்

# variants.saltire.size-9.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.saltire.size-11.name
source: 11x11 board
ta: 11x11 போர்டு

# variants.saltire.size-15.name
source: 15x15 board
ta: 15x15 போர்டு

# variants.saltire.size-17.name
source: 17x17 board
ta: 17x17 போர்டு

# variants.scaffold.#board.name
source: Default 19x19 board
ta: இயல்புநிலை 19x19 போர்டு

# variants.scaffold.size-25.name
source: Larger 25x25 board
ta: பெரிய 25x25 போர்டு

# variants.shifty.#board.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.shifty.size-13.name
source: 13x13 board
ta: 13x13 போர்டு

# variants.siegeofj.#rules.name
source: Default rules
ta: இயல்புநிலை விதிகள்

# variants.siegeofj.#rules.description
source: Each player starts with five cards and draws one after each turn. Hands are hidden until the deck is empty.
ta: ஒவ்வொரு வீரரும் ஐந்து அட்டைகளுடன் தொடங்கி ஒவ்வொரு திருப்பத்திற்கும் பிறகு ஒன்றை ஈர்க்கிறார்கள். டெக் காலியாக இருக்கும் வரை கைகள் மறைக்கப்படுகின்றன.

# variants.siegeofj.open.name
source: Open hands
ta: கைகளைத் திறக்கவும்

# variants.siegeofj.open.description
source: Each player starts with five cards and draws one after each turn. Hands are always visible.
ta: ஒவ்வொரு வீரரும் ஐந்து அட்டைகளுடன் தொடங்கி ஒவ்வொரு திருப்பத்திற்கும் பிறகு ஒன்றை ஈர்க்கிறார்கள். கைகள் எப்போதும் தெரியும்.

# variants.siegeofj.full.name
source: Full deal
ta: முழு ஒப்பந்தம்

# variants.siegeofj.full.description
source: Deals all 24 cards to the players at the beginning of the game. All hands are visible.
ta: விளையாட்டின் தொடக்கத்தில் அனைத்து 24 அட்டைகளையும் வீரர்களிடம் கையாள்கிறது. எல்லா கைகளும் தெரியும்.

# variants.slither.#board.name
source: 9x9 board
ta: 9x9 போர்டு

# variants.slither.#movement.name
source: Default movement rules
ta: இயல்புநிலை இயக்கம் விதிகள்

# variants.slither.11x11.name
source: 11x11 board
ta: 11x11 போர்டு

# variants.slither.13x13.name
source: 13x13 board
ta: 13x13 போர்டு

# variants.slither.classic.name
source: Classic movement rules
ta: கிளாசிக் இயக்கம் விதிகள்

# variants.slyde.#board.name
source: 12x12 board
ta: 12x12 போர்டு

# variants.slyde.size-8.name
source: 8x8 board
ta: 8x8 போர்டு

# variants.slyde.size-10.name
source: 10x10 board
ta: 10x10 போர்டு

# variants.slyde.size-16.name
source: 16x16 board
ta: 16x16 போர்டு

# variants.spire.#board.name
source: 4x4 board
ta: 4x4 போர்டு

# variants.spire.size-5.name
source: 5x5 board
ta: 5x5 பலகை

# variants.spline.#board.name
source: 4x4 board
ta: 4x4 போர்டு

# variants.spline.plus.description
source: On your turn, you may place a ball or move an unpinned ball. In the case of several lines being created as a result of balls dropping, the largest line prevails.
ta: உங்கள் திருப்பத்தில், நீங்கள் ஒரு பந்தை வைக்கலாம் அல்லது இணைக்கப்படாத பந்தை நகர்த்தலாம். பந்துகள் வீழ்ச்சியடைந்ததன் விளைவாக பல கோடுகள் உருவாக்கப்பட்டால், மிகப்பெரிய வரி நிலவுகிறது.

# variants.spline.plus.name
source: Spline+
ta: ச்ப்லைன்+

# variants.spline.size-5.name
source: 5x5 board
ta: 5x5 போர்டு

# variants.sploof.#board.description
source: Default board that starts with a ring of neutral balls on the edges.
ta: விளிம்புகளில் நடுநிலை பந்துகளின் வளையத்துடன் தொடங்கும் இயல்புநிலை பலகை.

# variants.sploof.#board.name
source: 4x4 board
ta: 4x4 போர்டு

# variants.sploof.size-5.description
source: A larger 5x5 board that starts with the bottom layer filled with neutral balls.
ta: நடுநிலை பந்துகளால் நிரப்பப்பட்ட கீழ் அடுக்குடன் தொடங்கும் பெரிய 5x5 போர்டு.

# variants.sploof.size-5.name
source: 5x5 board
ta: 5x5 போர்டு

# variants.sponnect.#board.name
source: 4x4 board
ta: 4x4 போர்டு

# variants.sponnect.size-5.name
source: 5x5 board
ta: 5x5 போர்டு

# variants.spook.#board.name
source: 4x4 board
ta: 4x4 போர்டு

# variants.spook.#setup.description
source: Players take turn placing balls until the pyramid is filled at the start of the game.
ta: விளையாட்டின் தொடக்கத்தில் பிரமிடு நிரப்பப்படும் வரை வீரர்கள் பந்துகளை வைக்கும்.

# variants.spook.#setup.name
source: Manual setup
ta: கையேடு அமைப்பு

# variants.spook.random.description
source: The pyramid is randomly filled so the game begins in the getaway phase.
ta: பிரமிட் தோராயமாக நிரப்பப்படுகிறது, எனவே விளையாட்டு வெளியேறும் கட்டத்தில் தொடங்குகிறது.

# variants.spook.random.name
source: Random setup
ta: சீரற்ற அமைப்பு

# variants.spook.size-5.name
source: 5x5 board
ta: 5x5 போர்டு

# variants.spree.#board.name
source: 4x4 board
ta: 4x4 போர்டு

# variants.spree.size-5.name
source: 5x5 board
ta: 5x5 போர்டு

# variants.stibro.size-5.name
source: Size 5 board
ta: அளவு 5 போர்டு

# variants.stibro.size-6.name
source: Size 6 board
ta: அளவு 6 போர்டு

# variants.stibro.#board.name
source: Size 7 board
ta: அளவு 7 போர்டு

# variants.stibro.size-8.name
source: Size 8 board
ta: அளவு 8 போர்டு

# variants.stigmergy.#board.name
source: Default board (base 8)
ta: இயல்புநிலை பலகை (அடிப்படை 8)

# variants.stigmergy.#komi.description
source: One player will enter a number to choose the second mover bonus for the game. The other player will be given the option to move first or second.
ta: விளையாட்டுக்கான இரண்டாவது மூவர் போனசைத் தேர்வுசெய்ய ஒரு வீரர் ஒரு எண்ணை உள்ளிடுவார். மற்ற வீரருக்கு முதல் அல்லது இரண்டாவது நகர்த்துவதற்கான விருப்பம் வழங்கப்படும்.

# variants.stigmergy.#komi.name
source: Komi offer
ta: பாதிக்கப்பட்டவர் வாருங்கள்

# variants.stigmergy.#rules.description
source: You control a space by controlling more than half of its lines of sight.
ta: ஒரு இடத்தை அதன் பார்வைக் கோடுகளில் பாதிக்கும் மேலாக கட்டுப்படுத்துவதன் மூலம் நீங்கள் கட்டுப்படுத்துகிறீர்கள்.

# variants.stigmergy.nokomi.description
source: The game will be played without a second mover bonus. Good for beginners.
ta: இரண்டாவது மூவர் போனச் இல்லாமல் விளையாட்டு விளையாடப்படும். ஆரம்பநிலைக்கு நல்லது.

# variants.stigmergy.nokomi.name
source: No komi offer
ta: கோமி சலுகை இல்லை

# variants.stigmergy.size-7.name
source: Smaller board (base 7)
ta: சிறிய பலகை (அடிப்படை 7)

# variants.stigmergy.size-9.name
source: Larger board (base 9)
ta: பெரிய பலகை (அடிப்படை 9)

# variants.stigmergy.size-10.name
source: Largest board (base 10)
ta: மிகப்பெரிய பலகை (அடிப்படை 10)

# variants.stigmergy.tumpletore.description
source: You control a space by controlling more of its lines of sight than your opponent.
ta: உங்கள் எதிரியை விட அதன் பார்வையை அதிகம் கட்டுப்படுத்துவதன் மூலம் ஒரு இடத்தை நீங்கள் கட்டுப்படுத்துகிறீர்கள்.

# variants.stigmergy.tumpletore.name
source: Tumpletore
ta: பைல்டோர்

# variants.storisende.#board.name
source: Hexhex 5 (61 spaces)
ta: எக்செக்ச் 5 (61 இடைவெளிகள்)

# variants.storisende.board-hex4.name
source: Hexhex 4 (37 spaces; learning)
ta: எக்செக்ச் 4 (37 இடங்கள்; கற்றல்)

# variants.storisende.board-hex6.name
source: Hexhex 6 (91 spaces)
ta: எக்செக்ச் 6 (91 இடங்கள்)

# variants.storisende.board-hex7.name
source: Hexhex 7 (127 spaces)
ta: எக்செக்ச் 7 (127 இடைவெளிகள்)

# variants.storisende.board-modular-13.name
source: Modular, 13 modules (91 spaces)
ta: மட்டு, 13 தொகுதிகள் (91 இடைவெளிகள்)

# variants.storisende.board-modular-13.description
source: Modular boards are composed of a certain number of 7-cell modules (hexhex 2s) distributed randomly but ensuring that each module touches another at two points.
ta: மட்டு பலகைகள் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான 7-செல் தொகுதிகள் (எக்ச்எக்ச் 2 எச்) தோராயமாக விநியோகிக்கப்படுகின்றன, ஆனால் ஒவ்வொரு தொகுதியும் இரண்டு புள்ளிகளில் மற்றொன்றைத் தொடுவதை உறுதி செய்கிறது.

# variants.storisende.board-modular-18.name
source: Modular, 18 modules (126 spaces)
ta: மட்டு, 18 தொகுதிகள் (126 இடைவெளிகள்)

# variants.storisende.board-modular-18.description
source: Modular boards are composed of a certain number of 7-cell modules (hexhex 2s) distributed randomly but ensuring that each module touches another at two points.
ta: மட்டு பலகைகள் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான 7-செல் தொகுதிகள் (எக்ச்எக்ச் 2 எச்) தோராயமாக விநியோகிக்கப்படுகின்றன, ஆனால் ஒவ்வொரு தொகுதியும் இரண்டு புள்ளிகளில் மற்றொன்றைத் தொடுவதை உறுதி செய்கிறது.

# variants.strands.#board.name
source: Size-7 board random setup
ta: அளவு -7 போர்டு சீரற்ற அமைப்பு

# variants.strands.size-5-fixed.name
source: Size-5 board fixed setup
ta: அளவு -5 போர்டு நிலையான அமைப்பு

# variants.strands.size-6-fixed.name
source: Size-6 board fixed setup
ta: அளவு -6 போர்டு நிலையான அமைப்பு

# variants.strands.size-6-fixed-lownumbers.name
source: Size-6 board fixed setup with low numbers
ta: அளவு -6 போர்டு குறைந்த எண்களுடன் நிலையான அமைப்பு

# variants.strands.size-6-random.name
source: Size-6 board random setup
ta: அளவு -6 போர்டு சீரற்ற அமைப்பு

# variants.strands.size-7-fixed.name
source: Size-7 board fixed setup
ta: அளவு -7 போர்டு நிலையான அமைப்பு

# variants.streetcar.#penalty.name
source: Default penalty (-10)
ta: இயல்புநிலை தண்டம் (-10)

# variants.streetcar.5point.description
source: The lower penalty makes it easier to steal enemy territory with a new line, leading to a more aggressive game.
ta: குறைந்த தண்டம் ஒரு புதிய வரியுடன் எதிரி பிரதேசத்தை திருடுவதை எளிதாக்குகிறது, இது மிகவும் ஆக்ரோசமான விளையாட்டுக்கு வழிவகுக்கிறது.

# variants.streetcar.5point.name
source: Lower penalty (-5)
ta: குறைந்த தண்டம் (-5)

# variants.streetcar.15point.description
source: The higher penalty makes invading enemy territory more expensive, leading to a euro-style game that focuses on building.
ta: அதிக தண்டனை ஆக்கிரமிப்பதை எதிரி பிரதேசத்தை மிகவும் விலை உயர்ந்ததாக ஆக்குகிறது, இது யூரோ பாணி விளையாட்டுக்கு வழிவகுக்கிறது, இது கட்டிடத்தில் கவனம் செலுத்துகிறது.

# variants.streetcar.15point.name
source: Higher penalty (-15)
ta: அதிக தண்டம் (-15)

# variants.subdivision.#parks.name
source: Default park placement
ta: இயல்புநிலை பூங்கா வேலை வாய்ப்பு

# variants.subdivision.#parks.description
source: Corners and, in two-player games, two centre cells
ta: மூலைகள் மற்றும், இரண்டு பிளேயர் விளையாட்டுகளில், இரண்டு மைய செல்கள்

# variants.subdivision.#scoring.description
source: Parks offer no bonuses
ta: பூங்காக்கள் எந்த போனசையும் வழங்கவில்லை

# variants.subdivision.manualParks.name
source: Manual park placement
ta: கையேடு பூங்கா வேலை வாய்ப்பு

# variants.subdivision.manualParks.description
source: Players take turns placing parks at the beginning of the game (ignored for three-player games)
ta: விளையாட்டின் தொடக்கத்தில் பூங்காக்களை வைப்பதை வீரர்கள் எடுத்துக்கொள்கிறார்கள் (மூன்று பிளேயர் விளையாட்டுகளுக்கு புறக்கணிக்கப்பட்டது)

# variants.subdivision.randomParks.name
source: Random park placement
ta: சீரற்ற பூங்கா வேலை வாய்ப்பு

# variants.subdivision.parkControl.name
source: Park control
ta: பூங்கா கட்டுப்பாடு

# variants.subdivision.parkControl.description
source: Controlling all the open spaces around a park grants bonus points
ta: ஒரு பூங்காவைச் சுற்றியுள்ள அனைத்து திறந்தவெளிகளையும் கட்டுப்படுத்துவது போனச் புள்ளிகளை வழங்குகிறது

# variants.surmount.#board.name
source: Hexhex 5 (61 spaces)
ta: எக்செக்ச் 5 (61 இடைவெளிகள்)

# variants.surmount.hex-4.name
source: Hexhex 4 (37 spaces)
ta: எக்செக்ச் 4 (37 இடைவெளிகள்)

# variants.surmount.hex-6.name
source: Hexhex 6 (91 spaces)
ta: எக்செக்ச் 6 (91 இடங்கள்)

# variants.surmount.hex-7.name
source: Hexhex 7 (127 spaces)
ta: எக்செக்ச் 7 (127 இடைவெளிகள்)

# variants.symple.#penalty.description
source: A lower penalty creates a more aggressive game, and a higher penalty, a more conservative one.
ta: குறைந்த தண்டம் மிகவும் ஆக்ரோசமான விளையாட்டை உருவாக்குகிறது, மேலும் அதிக தண்டம், மிகவும் பழமைவாதமானது.

# variants.symple.#penalty.name
source: Default penalty (-8)
ta: இயல்புநிலை தண்டம் (-8)

# variants.symple.p-4.name
source: Lower penalty (-4)
ta: குறைந்த தண்டம் (-4)

# variants.symple.p-6.name
source: Lower penalty (-6)
ta: குறைந்த தண்டம் (-6)

# variants.symple.p-10.name
source: Higher penalty (-10)
ta: அதிக தண்டம் (-10)

# variants.symple.p-12.name
source: Higher penalty (-12)
ta: அதிக தண்டம் (-12)

# variants.tablero.#scoring.description
source: One point per pip
ta: PIC க்கு ஒரு புள்ளி

# variants.tablero.5-10.name
source: Compressed range (5–10)
ta: சுருக்கப்பட்ட வரம்பு (5-10)
