Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# descriptions.pikemen
source: A Looney pyramid game where the pyramids represents soldiers with long pikes. Pieces charge in the direction they're facing and can then change their orientation. Capture a certain number of enemy soldiers to win. While the game is technically playable by three and four players, this implementation only supports two players.
ta: ஒரு லூனி பிரமிட் விளையாட்டு, அங்கு பிரமிடுகள் நீண்ட பைக்குகளுடன் கூடிய வீரர்களைக் குறிக்கின்றன. துண்டுகள் அவர்கள் எதிர்கொள்ளும் திசையில் கட்டணம் வசூலிக்கின்றன, பின்னர் அவற்றின் நோக்குநிலையை மாற்றலாம். வெற்றிபெற ஒரு குறிப்பிட்ட எண்ணிக்கையிலான எதிரி வீரர்களைப் பிடிக்கவும். விளையாட்டு தொழில்நுட்ப ரீதியாக மூன்று மற்றும் நான்கு வீரர்களால் இயக்கக்கூடியதாக இருக்கும்போது, இந்த செயல்படுத்தல் இரண்டு வீரர்களை மட்டுமே ஆதரிக்கிறது.

# descriptions.pilastri
source: Outlast your opponent in this game of blocking and moving, as pieces are forced to climb higher and higher until they run out of moves.
ta: தடுக்கும் மற்றும் நகரும் இந்த விளையாட்டில் உங்கள் எதிரியை விஞ்சியது, ஏனெனில் துண்டுகள் நகர்வுகள் வெளியேறும் வரை உயரமாகவும் உயரமாகவும் ஏற வேண்டிய கட்டாயத்தில் உள்ளன.

# descriptions.pletore
source: Territorial line-of-sight game. Intersections are controlled and pieces on them are flipped based on the number and direction of pieces that can see them. The winner is the player who occupies more of the board at the end.
ta: பிராந்திய வரி-பார்வை விளையாட்டு. குறுக்குவெட்டுகள் கட்டுப்படுத்தப்படுகின்றன, அவற்றைக் காணக்கூடிய துண்டுகளின் எண்ணிக்கை மற்றும் திசையின் அடிப்படையில் அவற்றில் துண்டுகள் புரட்டப்படுகின்றன. வெற்றியாளர் இறுதியில் பலகையை ஆக்கிரமித்துள்ள வீரர்.

# descriptions.pods
source: Natal Seas - Pods is a territorial game where the players take on the metaphorical role of competing whales vying for space to protect their young. Played on a hexagonal board, it uses an innovative mechanism of placements and movements.
ta: நடால் கடல்கள் - பாட்ச் என்பது ஒரு பிராந்திய விளையாட்டு, அங்கு வீரர்கள் தங்கள் இளைஞர்களைப் பாதுகாக்க இடத்திற்காக போட்டியிடும் போட்டியிடும் திமிங்கலங்களின் உருவகப் பாத்திரத்தை ஏற்றுக்கொள்கிறார்கள். ஒரு அறுகோண பலகையில் விளையாடிய இது வேலைவாய்ப்புகள் மற்றும் இயக்கங்களின் புதுமையான பொறிமுறையைப் பயன்படுத்துகிறது.

# descriptions.pontedd
source: Players build islands and attempt to connect as many of them as possible by bridge. Most points wins.
ta: வீரர்கள் தீவுகளை உருவாக்கி, அவற்றில் பலவற்றை முடிந்தவரை பிரிட்ச் மூலம் இணைக்க முயற்சிக்கிறார்கள். பெரும்பாலான புள்ளிகள் செய் பெறுகின்றன.

# descriptions.prudh
source: Prudh ("prew") is a game of shared pieces where one player owns the light squares and the other owns the dark. Manipulate stacks of pieces to earn points. Highest score at the end of the game wins.
ta: ப்ரூத் ("ப்ரெவ்") என்பது பகிரப்பட்ட துண்டுகளின் விளையாட்டு, அங்கு ஒரு வீரர் ஒளி சதுரங்களை வைத்திருக்கிறார், மற்றவர் இருட்டைக் கொண்டுள்ளார். புள்ளிகளைப் பெற துண்டுகளின் அடுக்குகளை கையாளவும். விளையாட்டின் முடிவில் அதிக மதிப்பெண் செய் பெறுகிறது.

# descriptions.pylon
source: The game is played in two phases: a placement phase, in which all the pyramids are placed onto the board, followed by a stacking phase, in which pyramids are collected into stacks. Control the majority of the pyramids to win.
ta: விளையாட்டு இரண்டு கட்டங்களாக விளையாடப்படுகிறது: ஒரு வேலை வாய்ப்பு கட்டம், இதில் அனைத்து பிரமிடுகளும் பலகையில் வைக்கப்படுகின்றன, அதைத் தொடர்ந்து ஒரு அடுக்கு கட்டம், இதில் பிரமிடுகள் அடுக்குகளில் சேகரிக்கப்படுகின்றன. வெற்றிபெற பெரும்பான்மையான பிரமிடுகளை கட்டுப்படுத்தவும்.

# descriptions.quagmire
source: A race to stay afloat as the land gives away underfoot. Walk, run, and jump around the board to hamper the other team, but make sure to leave enough room for your own!
ta: நிலம் காலடியில் கொடுப்பதால் மிதக்க ஒரு இனம். மற்ற அணிக்கு இடையூறு விளைவிப்பதற்காக நடந்து, ஓடு, பலகையைச் சுற்றி குதிக்கவும், ஆனால் உங்கள் சொந்த இடத்தை விட்டு வெளியேறுவதை உறுதிசெய்க!

# descriptions.quax
source: Quax is a connection game on a square board with a special move: instead of placing a stone, you may connect diagonally adjacent stones.
ta: குவாக்ச் என்பது ஒரு சதுர பலகையில் ஒரு சிறப்பு நகர்வுடன் ஒரு இணைப்பு விளையாட்டு: ஒரு கல்லை வைப்பதற்கு பதிலாக, நீங்கள் குறுக்காக அருகிலுள்ள கற்களை இணைக்கலாம்.

# descriptions.queensland
source: Create long open corridors between your pieces to score points. Easy, right?
ta: புள்ளிகளைப் பெற உங்கள் துண்டுகளுக்கு இடையில் நீண்ட திறந்த தாழ்வாரங்களை உருவாக்கவும். எளிதானது, இல்லையா?

# descriptions.query
source: A connection game on an Alquerque board. Place a piece on an eight-way intersection, or two pieces on four-way intersections.
ta: அல்கெர்கி போர்டில் ஒரு இணைப்பு விளையாட்டு. எட்டு வழி சந்திப்பில் ஒரு துண்டு அல்லது நான்கு வழி குறுக்குவெட்டுகளில் இரண்டு துண்டுகளை வைக்கவும்.

# descriptions.quincunx
source: A Decktet tableau-building game where the grid gets built as you go. Each play scores points (sometimes negative points). A game consists of as many rounds as there are players. Highest accumulated score wins.
ta: நீங்கள் செல்லும்போது கட்டம் கட்டப்படும் ஒரு டெக்டெட் அட்டவணையை உருவாக்கும் விளையாட்டு. ஒவ்வொரு நாடகமும் புள்ளிகளைப் பெறுகிறது (சில நேரங்களில் எதிர்மறை புள்ளிகள்). ஒரு விளையாட்டு வீரர்கள் இருப்பதால் பல சுற்றுகள் உள்ளன. அதிக திரட்டப்பட்ட மதிப்பெண் வெற்றிகள்.

# descriptions.razzle
source: Razzle Dazzle, also called Knight Moves, is a fast-paced game, designed to recreate as much of the experience of Ultimate Frisbee as possible while keeping the rules and gameplay simple and elegant. Two players try to move their ball to the opposite side of the board, using their 5 pieces as passing instruments. A player may either pass the ball or move a piece like a knight in a game of Chess.
ta: நைட் மூவ்ச் என்றும் அழைக்கப்படும் ராச்ல் திகைப்பூட்டும் ஒரு வேகமான விளையாட்டு, இது விதிகள் மற்றும் விளையாட்டை எளிமையாகவும் நேர்த்தியாகவும் வைத்திருக்கும் போது இறுதி ஃபிரிச்பீயின் அனுபவத்தை மீண்டும் உருவாக்க வடிவமைக்கப்பட்டுள்ளது. இரண்டு வீரர்கள் தங்கள் பந்தை போர்டின் எதிர் பக்கத்திற்கு நகர்த்த முயற்சிக்கிறார்கள், தங்கள் 5 துண்டுகளை கடந்து செல்லும் கருவிகளாகப் பயன்படுத்துகிறார்கள். ஒரு வீரர் பந்தைக் கடந்து செல்லலாம் அல்லது சதுரங்க விளையாட்டில் ஒரு நைட் போன்ற ஒரு பகுதியை நகர்த்தலாம்.

# descriptions.realm
source: Realm is played on a unique 12x12 board with only two types of mobile pieces. The goal is to capture more territory than your opponent by blocking and immobilizing their pieces. A few simple rules let you generate more pieces, which leads to ever-evolving tactics.
ta: இரண்டு வகையான மொபைல் துண்டுகள் மட்டுமே கொண்ட தனித்துவமான 12x12 போர்டில் ரியால்ம் இயக்கப்படுகிறது. உங்கள் எதிரியை விட அதிகமான நிலப்பரப்பை அவற்றின் துண்டுகளைத் தடுப்பதன் மூலமும் அசையாமலும் கைப்பற்றுவதே குறிக்கோள். சில எளிய விதிகள் அதிக துண்டுகளை உருவாக்க உங்களை அனுமதிக்கின்றன, இது எப்போதும் வளர்ந்து வரும் தந்திரங்களுக்கு வழிவகுக்கிறது.

# descriptions.renju
source: An asymmetric five-in-a-row game where the first player is not allowed to create double open threes, double fours, or overlines. Competitive openings like Taraguchi-10 and Soosõrv-8 are implemented here.
ta: ஒரு சமச்சீரற்ற ஃபைவ்-இன்-ஒரு-வரிசை விளையாட்டு, அங்கு முதல் வீரர் இரட்டை திறந்த மூன்றாம், இரட்டை பவுண்டரிகள் அல்லது மேலதிகமாக உருவாக்க அனுமதிக்கப்படவில்லை. தாராகுச்சி -10 மற்றும் சூச்ஆர்வ் -8 போன்ற போட்டி திறப்புகள் இங்கே செயல்படுத்தப்படுகின்றன.

# descriptions.resolve
source: A square grid connection game. If a crosscut is formed, swap the placed piece until it is no longer part of a crosscut. If the board is full and there is no winner, choose one of your stones in a crosscut and resolve.
ta: ஒரு சதுர கட்டம் இணைப்பு விளையாட்டு. ஒரு குறுக்குவழி உருவாக்கப்பட்டால், அது ஒரு குறுக்குவழியின் பகுதியாக இல்லாத வரை வைக்கப்பட்ட பகுதியை மாற்றவும். பலகை நிரம்பியிருந்தால், வெற்றியாளர் இல்லை என்றால், உங்கள் கற்களில் ஒன்றைத் தேர்ந்தெடுத்து தீர்க்கவும்.

# descriptions.reversi
source: Reversi is a classic game where you try to capture your opponent's pieces by sandwiching them between your own.
ta: தலைகீழ் ஒரு உன்னதமான விளையாட்டு, அங்கு உங்கள் எதிரியின் துண்டுகளை உங்கள் சொந்தத்திற்கு இடையில் மணல் அள்ளுவதன் மூலம் அவற்றைப் பிடிக்க முயற்சிக்கிறீர்கள்.

# descriptions.rootbound
source: In Root Bound, two groups of ‘plants’ spread in lifelike ways and vie for control of territory as space for new growth rapidly dwindles.
ta: வேர் எல்லையில், ‘தாவரங்களின்’ இரண்டு குழுக்கள் வாழ்நாள் வழிகளில் பரவுகின்றன, மேலும் புதிய வளர்ச்சிக்கான இடமாக நிலப்பரப்பைக் கட்டுப்படுத்துவதற்காக போட்டியிடுகின்றன.

# descriptions.saltire
source: Connect your two opposite sides of the board by placing stones and swapping pairs of orthogonally or diagonally adjacent stones. A swap must decrease either the number of crosscuts or the number of supercuts on the board, and it must not increase the number of crosscuts.
ta: பலகையின் உங்கள் இரண்டு எதிர் பக்கங்களையும் கற்களை வைப்பதன் மூலமும், ஆர்த்தோகனலி அல்லது குறுக்காக அருகிலுள்ள கற்களை மாற்றுவதன் மூலமும் இணைக்கவும். ஒரு இடமாற்று குறுக்குவழிகளின் எண்ணிக்கை அல்லது பலகையில் உள்ள சூப்பர் சரிக்களின் எண்ணிக்கையை குறைக்க வேண்டும், மேலும் இது குறுக்குவழிகளின் எண்ணிக்கையை அதிகரிக்கக்கூடாது.

# descriptions.scaffold
source: Scaffold is a drawless connection game played on the intersections of a square grid using stones (as in Go). Black is trying to connect N-S edges of the board, White E-W with an orthogonally connected group. On your turn, place a stone of your color on an empty point. Then, if possible, place a stone of your color on an empty point that is orthogonally adjacent to two groups of your color, and keep making such placements until no more are possible.
ta: சாரக்கட்டு என்பது கற்களைப் பயன்படுத்தி ஒரு சதுர கட்டத்தின் குறுக்குவெட்டுகளில் விளையாடும் ஒரு இழிவான இணைப்பு விளையாட்டு. பிளாக் பலகையின் N-S விளிம்புகளை, வெள்ளை E-W ஐ ஆர்த்தோகனலாக இணைக்கப்பட்ட குழுவுடன் இணைக்க முயற்சிக்கிறது. உங்கள் திருப்பத்தில், உங்கள் நிறத்தின் ஒரு கல்லை வெற்று புள்ளியில் வைக்கவும். பின்னர், முடிந்தால், உங்கள் நிறத்தின் இரண்டு குழுக்களுக்கு ஆர்த்தோகனலாக அருகிலுள்ள வெற்று புள்ளியில் உங்கள் நிறத்தின் ஒரு கல்லை வைக்கவும், மேலும் சாத்தியமில்லாத வரை இதுபோன்ற இடங்களை செய்யுங்கள்.

# descriptions.shifty
source: A connection game where you either place a piece orthogonally adjacent to a friendly piece, or move one of your pieces orthogonally adjacent to a friendly piece, by a chess queen's move, to a location not orthogonally adjacent to any other friendly pieces. Crosscuts are illegal. The player that forms an orthogonal or diagonal path connecting their two sides wins.
ta: ஒரு இணைப்பு விளையாட்டு, நீங்கள் ஒரு நட்புரீதியான துண்டுக்கு அருகிலுள்ள ஒரு பகுதியை ஆர்த்தோகனலி முறையில் வைத்திருக்கிறீர்கள், அல்லது உங்கள் துண்டுகளில் ஒன்றை ஆர்த்தோகனலி முறையில் ஒரு நட்புரீதியான துண்டுக்கு அருகில், ஒரு சதுரங்க ராணியின் நகர்வு மூலம், வேறு எந்த நட்புரீதியான துண்டுகளுக்கும் அருகிலுள்ள இடத்திற்கு நகர்த்தவும். குறுக்குவழிகள் சட்டவிரோதமானவை. தங்கள் இரு பக்கங்களையும் இணைக்கும் ஆர்த்தோகனல் அல்லது மூலைவிட்ட பாதையை உருவாக்கும் வீரர் செய் பெறுவார்.

# descriptions.siegeofj
source: Place cards, representing armies, to exert pressure on segments of the wall around the city of Jacynth. Exert the most pressure on the most segments to win.
ta: சசிந்த் நகரைச் சுற்றியுள்ள சுவரின் பிரிவுகளுக்கு அழுத்தம் கொடுக்க, படைகளை பிரதிநிதித்துவப்படுத்தும் அட்டைகளை வைக்கவும். வெற்றிபெற அதிக பிரிவுகளில் அதிக அழுத்தத்தை செலுத்துங்கள்.

# descriptions.slither
source: Square-board connection game with updated rules from 2018. Optionally move a piece and then place a piece, such that no two pieces of a colour are diagonally adjacent to each other unless they are orthogonally connected by a like-coloured stone. In Advanced Slither, a piece may only move if it is part of a contiguous orthogonal group consisting of pieces of both colours.
ta: 2018 முதல் புதுப்பிக்கப்பட்ட விதிகளுடன் சதுர-பலகை இணைப்பு விளையாட்டு. விருப்பமாக ஒரு பகுதியை நகர்த்தி, பின்னர் ஒரு பகுதியை வைக்கவும், அதாவது ஒரு வண்ணத்தின் இரண்டு துண்டுகளும் ஒருவருக்கொருவர் அகழ்வாராய்ச்சியுடன் இருக்காது, அவை ஒத்த வண்ணக் கல்லால் ஆர்த்தோகனலாக இணைக்கப்படாவிட்டால். மேம்பட்ட ச்லிதரில், ஒரு துண்டு இரு வண்ணங்களின் துண்டுகளையும் கொண்ட ஒரு தொடர்ச்சியான ஆர்த்தோகனல் குழுவின் ஒரு பகுதியாக இருந்தால் மட்டுமே நகரும்.

# descriptions.slyde
source: In Slyde, the goal is to form the largest orthogonal group of your colour. Pieces can be fixed or mobile. The game starts in a checkerboard position and all pieces start mobile. On your turn, you may swap a mobile piece with an adjacent mobile piece of your opponent, and your piece becomes fixed. The game ends when one player runs out of moves. If the board is in a mirror-symmetric position after the first turn, you may change the state of a piece instead of performing the standard swap.
ta: ச்லைட், உங்கள் வண்ணத்தின் மிகப்பெரிய ஆர்த்தோகனல் குழுவை உருவாக்குவதே குறிக்கோள். துண்டுகள் சரி செய்யப்படலாம் அல்லது மொபைல். விளையாட்டு செக்கர்போர்டு நிலையில் தொடங்குகிறது மற்றும் அனைத்து துண்டுகளும் மொபைல் தொடங்குகின்றன. உங்கள் திருப்பத்தில், உங்கள் எதிரியின் அருகிலுள்ள மொபைல் துண்டுடன் ஒரு மொபைல் துண்டுகளை மாற்றலாம், மேலும் உங்கள் துண்டு சரி செய்யப்படுகிறது. ஒரு வீரர் நகர்வுகளை விட்டு வெளியேறும்போது விளையாட்டு முடிகிறது. முதல் திருப்பத்திற்குப் பிறகு போர்டு ஒரு கண்ணாடி-சமச்சீர் நிலையில் இருந்தால், நிலையான இடமாற்றம் செய்வதற்கு பதிலாக ஒரு துண்டின் நிலையை மாற்றலாம்.

# descriptions.spire
source: On your turn, either place a ball of your colour, or place a neutral ball and then place a ball of your colour. No 2x2 area square of balls may include more than 2 like-coloured balls, and a ball of a colour cannot be placed on a platform containing two balls of that colour. The first player to run out of moves loses.
ta: உங்கள் திருப்பத்தில், உங்கள் வண்ணத்தின் பந்தை வைக்கவும், அல்லது நடுநிலை பந்தை வைக்கவும், பின்னர் உங்கள் வண்ணத்தின் பந்தை வைக்கவும். 2x2 ஏரியா சதுக்கத்தில் 2 க்கும் மேற்பட்ட வண்ண பந்துகள் இருக்கலாம், மேலும் அந்த வண்ணத்தின் இரண்டு பந்துகளைக் கொண்ட ஒரு மேடையில் ஒரு வண்ணத்தின் பந்தை வைக்க முடியாது. நகர்வுகளை விட்டு வெளியேறும் முதல் வீரர் தோற்றார்.

# descriptions.spline
source: Make a full line of your colour in any layer to win.
ta: வெல்ல எந்த அடுக்கிலும் உங்கள் வண்ணத்தின் முழு வரியை உருவாக்கவும்.

# descriptions.sploof
source: Create a string of four touching balls at any level visible as a straight line from directly above the board. Players start with two balls in their hand, but can take two balls from their stash every time a neutral ball is removed. Players also lose when they have no moves on their turn.
ta: போர்டுக்கு மேலே இருந்து நேரடியாக ஒரு நேர் கோட்டாகத் தெரியும் எந்த மட்டத்திலும் நான்கு தொடும் பந்துகளின் சரத்தை உருவாக்கவும். வீரர்கள் கையில் இரண்டு பந்துகளுடன் தொடங்குகிறார்கள், ஆனால் ஒவ்வொரு முறையும் ஒரு நடுநிலை பந்து அகற்றப்படும் போது இரண்டு பந்துகளை அவற்றின் ச்டாசிலிருந்து எடுக்கலாம். வீரர்களும் தங்கள் முறை எந்த நகர்வுகளும் இல்லாதபோது இழக்கிறார்கள்.

# descriptions.sponnect
source: A simple Shibumi connection game where every internal space that can be buried in a fully-filled board is pre-filled with neutral pieces. You may pass on your turn as long as your opponent didn't pass immediately before.
ta: ஒரு எளிய சிபூமி இணைப்பு விளையாட்டு, அங்கு முழுமையாக நிரப்பப்பட்ட பலகையில் புதைக்கக்கூடிய ஒவ்வொரு உள் இடமும் நடுநிலை துண்டுகளால் முன்கூட்டியே நிரப்பப்படுகிறது. உங்கள் எதிரி உடனடியாக கடந்து செல்லாத வரை நீங்கள் உங்கள் திருப்பத்தை கடந்து செல்லலாம்.

# descriptions.spook
source: Guide Spooky the ghost around the pyramid and try to be the first player to have all balls of your colour removed. The game takes place in two phases: the setup phase where the pyramid is built, and the getaway phase, where Spooky starts at the top of the pyramid and starts eliminating balls.
ta: பிரமிட்டைச் சுற்றியுள்ள பேயை பயமுறுத்துவதற்கு வழிகாட்டவும், உங்கள் வண்ணத்தின் அனைத்து பந்துகளையும் அகற்றும் முதல் வீரராக இருக்க முயற்சிக்கவும். விளையாட்டு இரண்டு கட்டங்களாக நடைபெறுகிறது: பிரமிட் கட்டப்பட்ட அமைவு கட்டம், மற்றும் வெளியேறும் கட்டம், அங்கு ச்பூக்கி பிரமிட்டின் உச்சியில் தொடங்கி பந்துகளை நீக்கத் தொடங்குகிறது.

# descriptions.spree
source: An impartial n-in-a-row game where players take turns handing a ball to their opponent to place. The goal is to try to make a full line of one of two colours (red and blue by default). There is a third wild neutral colour (green by default) that can play the role of either colour.
ta: ஒரு பக்கச்சார்பற்ற N-i-row விளையாட்டு, அங்கு வீரர்கள் எடுக்கும் ஒரு பந்தை தங்கள் எதிராளிக்கு ஒப்படைக்க வேண்டும். இரண்டு வண்ணங்களில் ஒன்றின் முழு வரியை உருவாக்க முயற்சிப்பதே குறிக்கோள் (இயல்புநிலையாக சிவப்பு மற்றும் நீலம்). மூன்றாவது காட்டு நடுநிலை நிறம் (இயல்பாகவே பச்சை) உள்ளது, இது வண்ணத்தின் பாத்திரத்தை வகிக்க முடியும்.

# descriptions.squaredance
source: A game where you move groups of pieces by rotation, trying to force your opponent into a position where they cannot move.
ta: சுழற்சி மூலம் நீங்கள் துண்டுகளின் குழுக்களை நகர்த்தும் ஒரு விளையாட்டு, உங்கள் எதிரியை அவர்கள் நகர்த்த முடியாத நிலைக்கு கட்டாயப்படுத்த முயற்சிக்கிறது.

# descriptions.stibro
source: Win by forming a loop anywhere on the board, while adhering to the placement restriction that ensures loop-forming is always possible.
ta: போர்டில் எங்கும் ஒரு வளையத்தை உருவாக்குவதன் மூலம் செய் பெறுங்கள், அதே நேரத்தில் லூப்-உருவாக்கம் எப்போதும் சாத்தியமாக இருப்பதை உறுதி செய்யும் வேலைவாய்ப்பு கட்டுப்பாட்டைக் கடைப்பிடிப்பது.

# descriptions.stigmergy
source: Territorial line-of-sight game. Cells are controlled and pieces on them are flipped based on how many pieces of a color can see them. The winner is the player who occupies more of the board at the end.
ta: பிராந்திய வரி-பார்வை விளையாட்டு. செல்கள் கட்டுப்படுத்தப்படுகின்றன, அவற்றில் துண்டுகள் ஒரு வண்ணத்தின் எத்தனை துண்டுகளை பார்க்க முடியும் என்பதன் அடிப்படையில் புரட்டப்படுகின்றன. வெற்றியாளர் இறுதியில் பலகையை ஆக்கிரமித்துள்ள வீரர்.

# descriptions.storisende
source: A unique territory control game where the movement of pieces create territories and walls, eventually creating enclosed nations. Control the most territory to win.
ta: துண்டுகளின் இயக்கம் பிரதேசங்களையும் சுவர்களையும் உருவாக்கும் ஒரு தனித்துவமான பிரதேச கட்டுப்பாட்டு விளையாட்டு, இறுதியில் மூடப்பட்ட நாடுகளை உருவாக்குகிறது. வெற்றிபெற மிகவும் பிரதேசத்தை கட்டுப்படுத்தவும்.

# descriptions.stormc
source: An annihilation game with asymmetrical piece movement.
ta: சமச்சீரற்ற துண்டு இயக்கத்துடன் நிர்மூலமாக்கல் விளையாட்டு.

# descriptions.strands
source: In Strands, players take turns placing the number of pieces of their colour on the board corresponding to the number on the spaces. The goal is to form the largest contiguous group of stones. If the largest groups are tied, compare the second-largest groups, and so on. The first player starts the game by placing one piece on a space labelled with a 2.
ta: இழைகளில், வீரர்கள் தங்கள் வண்ணத்தின் துண்டுகளின் எண்ணிக்கையை இடைவெளிகளில் உள்ள எண்ணுடன் தொடர்புடைய பலகையில் வைப்பதை எடுத்துக்கொள்கிறார்கள். மிகப்பெரிய தொடர்ச்சியான கற்களை உருவாக்குவதே குறிக்கோள். மிகப்பெரிய குழுக்கள் கட்டப்பட்டிருந்தால், இரண்டாவது பெரிய குழுக்களை ஒப்பிடுங்கள், மற்றும் பல. முதல் வீரர் 2 உடன் பெயரிடப்பட்ட இடத்தில் ஒரு பகுதியை வைப்பதன் மூலம் விளையாட்டைத் தொடங்குகிறார்.

# descriptions.streetcar
source: It's against the law to build housing or transit in this wealthy neighborhood. Remove single-family housing limits to let citizens build, making the neighborhood more affordable and diverse. Then connect new buildings with streetcar lines of your own color to score points.
ta: இந்த பணக்கார சுற்றுப்புறத்தில் வீட்டுவசதி அல்லது போக்குவரத்து கட்டுவது சட்டத்திற்கு எதிரானது. குடிமக்கள் கட்ட அனுமதிக்க ஒற்றை குடும்ப வீட்டு வரம்புகளை அகற்றி, அண்டை நாடுகளை மிகவும் மலிவு மற்றும் மாறுபட்டதாக மாற்றுகிறது. புதிய கட்டிடங்களை உங்கள் சொந்த வண்ணத்தின் ச்ட்ரீட்கார் வரிகளுடன் இணைக்கவும்.

# descriptions.strings
source: Players simultaneously choose a string to pull, moving, splitting, and joining stacks of coins. The winner is the first one able to get five coins on their home spaces. Are you pulling strings? Or is your opponent pulling yours?
ta: வீரர்கள் ஒரே நேரத்தில் நாணயங்களின் அடுக்குகளை இழுக்க, நகர்த்த, பிரித்தல் மற்றும் சேர ஒரு சரத்தை தேர்வு செய்கிறார்கள். வெற்றியாளர் தங்கள் வீட்டு இடங்களில் ஐந்து நாணயங்களைப் பெறக்கூடிய முதல் நபர். நீங்கள் சரங்களை இழுக்கிறீர்களா? அல்லது உங்கள் எதிர்ப்பாளர் உங்களுடையதை இழுக்கிறாரா?

# descriptions.subdivision
source: You are a real estate developer competing with others to develop a new subdivision. Where you build is somewhat restricted, and what gets built next to you affects your value. Bring down your competitors' values while maximizing your own.
ta: புதிய உட்பிரிவை உருவாக்க நீங்கள் மற்றவர்களுடன் போட்டியிடும் ரியல் எச்டேட் உருவாக்குபவர். நீங்கள் கட்டும் இடம் ஓரளவு கட்டுப்படுத்தப்பட்டுள்ளது, மேலும் உங்களுக்கு அடுத்ததாக கட்டப்படுவது உங்கள் மதிப்பை பாதிக்கிறது. உங்கள் சொந்தத்தை அதிகரிக்கும்போது உங்கள் போட்டியாளர்களின் மதிப்புகளை குறைக்கவும்.

# descriptions.surmount
source: An exnihilation game in which larger groups destroy smaller ones.
ta: பெரிய குழுக்கள் சிறியவற்றை அழிக்கும் ஒரு exnihilation விளையாட்டு.

# descriptions.susan
source: In Susan, the goal is to surround any opponent's piece with other pieces. On your turn, you may place a piece or slide a piece to an adjacent empty space. If both players have a stone surrounded simultaneously, the player that just took their turn loses. The game ends in a tie if both players performed three slides each consecutively.
ta: சூசனில், எந்தவொரு எதிரியின் பகுதியையும் மற்ற துண்டுகளுடன் சூழ்ந்து கொள்வதே குறிக்கோள். உங்கள் திருப்பத்தில், நீங்கள் ஒரு துண்டு வைக்கலாம் அல்லது ஒரு பகுதியை அருகிலுள்ள வெற்று இடத்திற்கு ச்லைடு செய்யலாம். இரு வீரர்களும் ஒரே நேரத்தில் ஒரு கல் வைத்திருந்தால், தங்கள் திருப்பத்தை எடுத்த வீரர் தோற்றார். இரு வீரர்களும் ஒவ்வொன்றும் தொடர்ச்சியாக மூன்று ச்லைடுகளைச் செய்தால் விளையாட்டு ஒரு டைவில் முடிகிறது.

# descriptions.symple
source: A territory game where you get a point for every stone placed, and a penalty for each individual group of connected pieces. Find the right balance to maximize your score.
ta: ஒவ்வொரு கல்லுக்கும் ஒரு புள்ளியைப் பெறும் ஒரு பிரதேச விளையாட்டு, மற்றும் இணைக்கப்பட்ட ஒவ்வொரு குழுவிற்கும் தண்டம். உங்கள் மதிப்பெண்ணை அதிகரிக்க சரியான சமநிலையைக் கண்டறியவும்.

# descriptions.tablero
source: A quick-playing dice game where players compete to control high-value spaces on the board.
ta: பலகையில் அதிக மதிப்புள்ள இடங்களைக் கட்டுப்படுத்த வீரர்கள் போட்டியிடும் விரைவான விளையாடும் டைச் விளையாட்டு.

# descriptions.tafl
source: A collection of games from the Viking era. The defenders goal is to escape to the edge of the board, while the attackers try to capture the defender's king.
ta: வைக்கிங் சகாப்தத்திலிருந்து விளையாட்டுகளின் தொகுப்பு. வாரியத்தின் விளிம்பில் தப்பிப்பதே பாதுகாவலர்களின் குறிக்கோள், அதே நேரத்தில் தாக்குதல் நடத்தியவர்கள் பாதுகாவலரின் ராசாவைப் பிடிக்க முயற்சிக்கிறார்கள்.

# descriptions.taiji
source: Two players take turns placing one piece of each colour next to each other. The winner is the one who forms the largest orthogonal groups of their own colour.
ta: இரண்டு வீரர்கள் ஒவ்வொரு வண்ணத்தின் ஒரு பகுதியையும் ஒருவருக்கொருவர் அடுத்ததாக வைப்பார்கள். வெற்றியாளர் தங்கள் சொந்த நிறத்தின் மிகப்பெரிய ஆர்த்தோகனல் குழுக்களை உருவாக்குகிறார்.

# descriptions.take
source: Grow root-like formations of stones from seeds. Plants die when they run out of room to grow. The winner is the last player with a plant alive on the board.
ta: விதைகளிலிருந்து கற்களின் வேர் போன்ற வடிவங்களை வளர்க்கவும். தாவரங்கள் வளர அறைக்கு வெளியே ஓடும்போது இறக்கின்றன. போர்டில் உயிருடன் ஒரு ஆலை கொண்ட கடைசி வீரர் வெற்றியாளர்.

# descriptions.tbt
source: A simple dice game where you attempt to form stacks of equal height on your home row.
ta: உங்கள் வீட்டு வரிசையில் சம உயரத்தின் அடுக்குகளை உருவாக்க முயற்சிக்கும் ஒரு எளிய டைச் விளையாட்டு.

# descriptions.tessella
source: Pieces capture in pairs using a "shooting" mechanic. Be the first to capture four of your opponent's pieces.
ta: துண்டுகள் "சூட்டிங்" மெக்கானிக்கைப் பயன்படுத்தி சோடிகளாக பிடிக்கப்படுகின்றன. உங்கள் எதிரியின் நான்கு துண்டுகளை முதலில் கைப்பற்றியவர்.
