Repository: 247i/TACETr
Catalog: உரை/தானி/abstract-play-gameslib-*.po
Languages: ta

# validation.nex.INITIAL_INSTRUCTIONS
source: Either place your piece on an empty cell followed by a neutral piece on another empty cell, or choose two neutral pieces to swap to your colour and one of your piece to swap to the neutral colour.
ta: உங்கள் துண்டுகளை வெற்று கலத்தில் வைக்கவும், அதைத் தொடர்ந்து மற்றொரு வெற்று கலத்தில் நடுநிலை துண்டு வைக்கவும், அல்லது உங்கள் நிறத்திற்கு இடமாற்றம் செய்ய இரண்டு நடுநிலை துண்டுகளையும், நடுநிலை நிறத்தை மாற்ற உங்கள் துண்டு ஒன்றையும் தேர்வு செய்யவும்.

# validation.nex.NORMALISE
source: The move needs to be normalised. Try {{normalised}}.
ta: நகர்வை இயல்பாக்க வேண்டும். {{normalised}} ஐ முயற்சிக்கவும்.

# validation.nex.PARTIAL_PLACE
source: Select an empty cell to place a neutral piece.
ta: நடுநிலை துண்டு வைக்க வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.nex.PARTIAL_SWAP_ONE_EACH
source: Select one more neutral piece to swap to your colour, and one of your pieces to swap to the neutral colour.
ta: உங்கள் வண்ணத்தை மாற்ற இன்னும் ஒரு நடுநிலை துண்டுகளையும், நடுநிலை நிறத்தை மாற்ற உங்கள் துண்டுகளில் ஒன்றையும் தேர்ந்தெடுக்கவும்.

# validation.nex.PARTIAL_SWAP_ONE_NEUTRAL
source: Select one more neutral piece to swap to your colour.
ta: உங்கள் வண்ணத்தை மாற்ற இன்னும் ஒரு நடுநிலை துண்டுகளைத் தேர்ந்தெடுக்கவும்.

# validation.nex.PARTIAL_SWAP_ONE_PLAYER
source: Select one of your pieces to swap to the neutral colour.
ta: நடுநிலை நிறத்திற்கு இடமாற்றம் செய்ய உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.nex.PARTIAL_SWAP_TWO_NEUTRAL
source: Select two neutral pieces to swap to your colour.
ta: உங்கள் வண்ணத்தை மாற்ற இரண்டு நடுநிலை துண்டுகளைத் தேர்ந்தெடுக்கவும்.

# validation.nex.PLACE_DUPLICATE
source: You may not place the neutral piece on the same cell as your own piece.
ta: உங்கள் சொந்த துண்டின் அதே கலத்தில் நடுநிலை துண்டுகளை நீங்கள் வைக்கக்கூடாது.

# validation.nex.PLACE_TOO_MANY
source: You may only place one of your pieces followed by one neutral piece.
ta: உங்கள் துண்டுகளில் ஒன்றை மட்டுமே நீங்கள் ஒரு நடுநிலை துண்டு வைக்கலாம்.

# validation.nex.SWAP_DUPLICATE
source: You selected the same neutral piece to swap twice.
ta: இரண்டு முறை இடமாற்றம் செய்ய அதே நடுநிலை துண்டுகளைத் தேர்ந்தெடுத்தீர்கள்.

# validation.nex.SWAP_EDGE_CASE_NOT_NEUTRAL
source: There is only one neutral piece and no more empty cells. You may not swap a piece of your colour to a neutral piece. Just swap the neutral piece to your colour.
ta: ஒரே ஒரு நடுநிலை துண்டு மற்றும் வெற்று செல்கள் இல்லை. உங்கள் வண்ணத்தின் ஒரு பகுதியை நடுநிலை துண்டுக்கு மாற்றக்கூடாது. நடுநிலை துண்டுகளை உங்கள் நிறத்திற்கு மாற்றவும்.

# validation.nex.SWAP_EDGE_CASE_TOO_MANY
source: There is only one neutral piece and no more empty cells. You may swap that neutral piece alone to your colour.
ta: ஒரே ஒரு நடுநிலை துண்டு மற்றும் வெற்று செல்கள் இல்லை. அந்த நடுநிலை துண்டுகளை உங்கள் நிறத்திற்கு மட்டும் மாற்றலாம்.

# validation.nex.SWAP_INSUFFICIENT_NEUTRAL
source: There are not enough neutral stones on the board, so you may not make swap moves. You should make placement moves instead.
ta: பலகையில் போதுமான நடுநிலை கற்கள் இல்லை, எனவே நீங்கள் இடமாற்று நகர்வுகளைச் செய்யக்கூடாது. அதற்கு பதிலாக நீங்கள் வேலைவாய்ப்பு நகர்வுகளைச் செய்ய வேண்டும்.

# validation.nex.SWAP_TOO_MANY_NEUTRAL
source: You may only swap two neutral pieces to your colour.
ta: உங்கள் நிறத்திற்கு இரண்டு நடுநிலை துண்டுகளை மட்டுமே மாற்றலாம்.

# validation.nex.SWAP_TOO_MANY_PLAYER
source: You may only swap one of your pieces to the neutral colour.
ta: உங்கள் துண்டுகளில் ஒன்றை நடுநிலை நிறத்திற்கு மட்டுமே மாற்றலாம்.

# validation.nex.SWAP_UNCONTROLLED
source: You many not swap your opponent's pieces.
ta: நீங்கள் பலர் உங்கள் எதிரியின் துண்டுகளை மாற்றவில்லை.

# validation.omny.ADJACENCY
source: Pieces may only move to adjacent cells.
ta: துண்டுகள் அருகிலுள்ள கலங்களுக்கு மட்டுமே செல்லக்கூடும்.

# validation.omny.BAD_MOVE
source: You may only move pieces if captures are active.
ta: பிடிப்புகள் செயலில் இருந்தால் மட்டுமே நீங்கள் துண்டுகளை நகர்த்தலாம்.

# validation.omny.EMPTY_MOVE
source: Pieces may only move onto occupied cells.
ta: துண்டுகள் ஆக்கிரமிக்கப்பட்ட கலங்களுக்கு மட்டுமே செல்லக்கூடும்.

# validation.omny.FRIENDLY_CAPTURE
source: You may not cover your own stacks.
ta: உங்கள் சொந்த அடுக்குகளை நீங்கள் மறைக்கக்கூடாது.

# validation.omny.INITIAL_INSTRUCTIONS
source: Select an empty cell to place a piece of your colour.
ta: உங்கள் வண்ணத்தின் ஒரு பகுதியை வைக்க வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.omny.NO_DUPES
source: Your move may not include duplicate cells.
ta: உங்கள் நகர்வில் நகல் செல்கள் இருக்காது.

# validation.omny.PARTIAL_MOVE
source: Select the destination.
ta: இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.omny.PARTIAL_SETUP_p1
source: Select a cell to place a star point (you must place at least one), or select a star point you placed to remove it. Click "Complete move" when you're done.
ta: ஒரு நட்சத்திர புள்ளியை வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும் (நீங்கள் குறைந்தது ஒன்றை வைக்க வேண்டும்), அல்லது அதை அகற்ற நீங்கள் வைத்திருக்கும் ஒரு நட்சத்திர புள்ளியைத் தேர்ந்தெடுக்கவும். நீங்கள் முடிந்ததும் "முழுமையான நகர்வு" என்பதைக் சொடுக்கு செய்க.

# validation.omny.PARTIAL_SETUP_p2
source: Select a cell to place a star point, or select a star point you placed to remove it. You don't have to place any stars, but you typically want to. Click "Complete move" when you're done.
ta: ஒரு நட்சத்திர புள்ளியை வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும் அல்லது அதை அகற்ற நீங்கள் வைத்திருக்கும் நட்சத்திர புள்ளியைத் தேர்ந்தெடுக்கவும். நீங்கள் எந்த நட்சத்திரங்களையும் வைக்க வேண்டியதில்லை, ஆனால் நீங்கள் பொதுவாக விரும்புகிறீர்கள். நீங்கள் முடிந்ததும் "முழுமையான நகர்வு" என்பதைக் சொடுக்கு செய்க.

# validation.omny.SAME_HEIGHT
source: Pieces may only move between stacks of the same height.
ta: துண்டுகள் ஒரே உயரத்தின் அடுக்குகளுக்கு இடையில் மட்டுமே நகரக்கூடும்.

# validation.onager.CENTRE_PLACEMENT
source: The lake cannot be placed at the centre cell, {{where}}.
ta: ஏரியை மைய கலத்தில் வைக்க முடியாது, {{where}}.

# validation.onager.INITIAL_INSTRUCTIONS
source: Select one of your pieces to walk or jump.
ta: நடக்க அல்லது குதிக்க உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.onager.INITIAL_INSTRUCTIONS_PLACE
source: Select an empty cell to place a lake.
ta: ஒரு ஏரியை வைக்க வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.onager.INVALID_MOVES
source: This sequence of moves {{moves}} is invalid.
ta: நகர்வுகளின் இந்த வரிசை {{moves}} தவறானது.

# validation.onager.OPTIONAL_CONTINUE
source: You have landed on your opponent's piece. If you wish to continue your move, select another destination to jump to, otherwise submit the move.
ta: நீங்கள் உங்கள் எதிரியின் துண்டில் இறங்கியுள்ளீர்கள். உங்கள் நகர்வைத் தொடர விரும்பினால், செல்ல மற்றொரு இலக்கைத் தேர்ந்தெடுக்கவும், இல்லையெனில் நகர்வை சமர்ப்பிக்கவும்.

# validation.onager.SELECT_TO
source: Select a destination to walk to or jump to.
ta: நடக்க அல்லது செல்ல ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.onyx.INITIAL_INSTRUCTIONS
source: Select an intersection to place a piece
ta: ஒரு துண்டு வைக்க ஒரு குறுக்குவெட்டைத் தேர்ந்தெடுக்கவும்

# validation.onyx.BLOCKED_CENTRE
source: You may not place at centre {{where}} because there are pieces in its corners.
ta: நீங்கள் மையத்தில் வைக்கக்கூடாது {{where}} ஏனெனில் அதன் மூலைகளில் துண்டுகள் உள்ளன.

# validation.onyx.NO_CAPTURE
source: You have indicated capture, but there is no captures in this move. Try '{{move}}'.
ta: நீங்கள் பிடிப்பைக் சுட்டிக்காட்டியுள்ளீர்கள், ஆனால் இந்த நடவடிக்கையில் எந்தப் பிடிப்புகளும் இல்லை. '{{move}}' ஐ முயற்சிக்கவும்.

# validation.onyx.SINGLE_CAPTURE
source: This move captures one pair, it has to be suffixed with 'x'. Try '{{move}}'.
ta: இந்த நடவடிக்கை ஒரு சோடியைப் பிடிக்கிறது, அதை 'ஃச்' உடன் பின்னொட்டு செய்ய வேண்டும். '{{move}}' ஐ முயற்சிக்கவும்.

# validation.onyx.DOUBLE_CAPTURE
source: This move captures two pairs, it has to be suffixed with 'xx'. Try '{{move}}'.
ta: இந்த நடவடிக்கை இரண்டு சோடிகளைப் பிடிக்கிறது, இது 'xx' உடன் பின்னொட்டு செய்யப்பட வேண்டும். '{{move}}' ஐ முயற்சிக்கவும்.

# validation.orb.INITIAL_INSTRUCTIONS
source: Select one of your own pieces to move.
ta: நகர்த்த உங்கள் சொந்த துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.orb.SEED_PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.orb.SEED_PARTIAL_SPHERE
source: Select a destination, or select the same cell again to split the spheroid.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும் அல்லது ச்பீராய்டைப் பிரிக்க அதே கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.orb.SPHERES_SPLIT
source: You can only split spheroids. Select a different cell.
ta: நீங்கள் ச்பீராய்டுகளை மட்டுமே பிரிக்க முடியும். வேறு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.ordo.DISCONNECTED
source: That move would leave your pieces disconnected.
ta: அந்த நடவடிக்கை உங்கள் துண்டுகளை துண்டிக்க வைக்கும்.

# validation.ordo.DISORGANIZED
source: Moves must be "organized," meaning that the destination cell must be orthogonal to the first cell in the ordo.
ta: நகர்வுகள் "ஒழுங்கமைக்கப்பட வேண்டும்", அதாவது இலக்கு செல் ஆர்டோவில் உள்ள முதல் கலத்திற்கு ஆர்த்தோகனலாக இருக்க வேண்டும்.

# validation.ordo.INITIAL_INSTRUCTIONS
source: Select one of your pieces to move or start an ordo.
ta: ஒரு ஆர்டோவை நகர்த்த அல்லது தொடங்க உங்கள் துண்டுகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.ordo.INVALID_ORDO
source: The ordo '{{ordo}}' is not valid. Ordos are groups of pieces connected in a straight, orthogonal line.
ta: ஆர்டோ '{{ordo}}' செல்லுபடியாகாது. ஆர்டோச் என்பது நேரான, ஆர்த்தோகனல் வரிசையில் இணைக்கப்பட்ட துண்டுகளின் குழுக்கள்.

# validation.ordo.INVALID_ORDO_MOVE
source: The ordo '{{ordo}}' cannot move to {{destination}}. This is usually because of an obstruction.
ta: ஆர்டோ '{{ordo}}' {{destination} க்கு க்கு செல்ல முடியாது. இது வழக்கமாக ஒரு தடையாக இருப்பதால்.

# validation.ordo.NO_ORDO_CAPTURE
source: An ordo move cannot be a capture.
ta: ஒரு ஆர்டோ நடவடிக்கை ஒரு பிடிப்பாக இருக்க முடியாது.

# validation.ordo.PARTIAL
source: Select a destination or select a second piece to form an ordo.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும் அல்லது ஒரு ஆர்டோவை உருவாக்க இரண்டாவது பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.ordo.WRONG_DIRECTION
source: You may only move forward or side-to-side unless your pieces are disconnected.
ta: உங்கள் துண்டுகள் துண்டிக்கப்படாவிட்டால் மட்டுமே நீங்கள் முன்னோக்கி அல்லது பக்கவாட்டில் செல்லலாம்.

# validation.oust.ALREADY_WON
source: There are no more enemy pieces to capture. You have already won.
ta: கைப்பற்ற இனி எதிரி துண்டுகள் இல்லை. நீங்கள் ஏற்கனவே வென்றுள்ளீர்கள்.

# validation.oust.ILLEGAL_PASS
source: You may only pass if you have no legal moves.
ta: உங்களிடம் சட்டப்பூர்வ நகர்வுகள் இல்லையென்றால் மட்டுமே நீங்கள் கடந்து செல்ல முடியும்.

# validation.oust.ILLEGAL_PLACEMENT
source: Placement at {{where}} is not legal.
ta: {{where}} சட்டப்பூர்வமாக இல்லை.

# validation.oust.INITIAL_INSTRUCTIONS
source: Select a cell to place a piece.
ta: ஒரு துண்டு வைக்க ஒரு கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.oust.INVALID_MOVE_STRING
source: Unable to interpret the move notation: {{move}}.
ta: நகர்வு குறியீட்டை விளக்க முடியவில்லை: {{move}}.

# validation.oust.MORE
source: You have just made a capture placement. You must continue making placements.
ta: நீங்கள் ஒரு பிடிப்பு வேலைவாய்ப்பு செய்துள்ளீர்கள். நீங்கள் தொடர்ந்து வேலைவாய்ப்புகளைச் செய்ய வேண்டும்.

# validation.oust.PLACEMENT_AFTER_NONCAPTURE
source: You may not make any more placements after a non-capture placement.
ta: பிடியில் இல்லாத இடத்திற்குப் பிறகு நீங்கள் மேலும் வேலைவாய்ப்புகளைச் செய்யக்கூடாது.

# validation.oware.INITIAL_INSTRUCTIONS
source: Select one of your pits containing stones to sow them.
ta: அவற்றை விதைக்க கற்களைக் கொண்ட உங்கள் குழிகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.oware.NO_PIECES
source: When your opponent starts with no pieces, your move must give them pieces.
ta: உங்கள் எதிர்ப்பாளர் எந்த துண்டுகளும் இல்லாமல் தொடங்கும் போது, உங்கள் நடவடிக்கை அவர்களுக்கு துண்டுகளை கொடுக்க வேண்டும்.

# validation.owlman.INITIAL_INSTRUCTIONS
source: Select a piece to move.
ta: நகர்த்த ஒரு பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.owlman.PARTIAL
source: Select a destination.
ta: ஒரு இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.pacru.BAD_CAPTURE
source: The move {{move}} does not appear to be valid. Remember that captures require that at least two chevrons are attacking the same piece.
ta: {{move}} நகர்வு செல்லுபடியாகாது. பிடிப்புகளுக்கு குறைந்தது இரண்டு செவ்ரான்கள் ஒரே பகுதியைத் தாக்க வேண்டும் என்பதை நினைவில் கொள்ளுங்கள்.

# validation.pacru.BAD_CONNECTION
source: You requested a connection change even though one was not made.
ta: ஒன்று செய்யப்படாவிட்டாலும் இணைப்பு மாற்றத்தை நீங்கள் கோரியுள்ளீர்கள்.

# validation.pacru.ENEMY_TILE
source: You can't land on opposing tiles except by pincer.
ta: பின்சர் தவிர நீங்கள் எதிரெதிர் ஓடுகளில் இறங்க முடியாது.

# validation.pacru.INITIAL_INSTRUCTIONS
source: Select a chevron to move.
ta: நகர்த்த ஒரு செவ்ரானைத் தேர்ந்தெடுக்கவும்.

# validation.pacru.NEED_DESTINATION
source: Select the destination (valid targets are highlighted) or select the same piece again to begin reorientation.
ta: இலக்கைத் தேர்ந்தெடுக்கவும் (செல்லுபடியாகும் இலக்குகள் முன்னிலைப்படுத்தப்படுகின்றன) அல்லது மறுசீரமைப்பைத் தொடங்க மீண்டும் அதே பகுதியைத் தேர்ந்தெடுக்கவும்.

# validation.pacru.NOT_ENOUGH_any
source: You do not have enough unoccupied tiles on the board to reorient any pieces.
ta: எந்தவொரு துண்டுகளையும் மாற்றியமைக்க உங்களிடம் போதுமான காலியாக ஓடுகள் இல்லை.

# validation.pacru.NOT_ENOUGH_45
source: You do not have enough unoccupied tiles on the board to rotate 45 degrees.
ta: 45 டிகிரியைச் சுழற்ற போர்டில் போதுமான அளவு ஓடுகள் இல்லை.

# validation.pacru.NOT_ENOUGH_90
source: You do not have enough unoccupied tiles on the board to rotate 90 degrees.
ta: 90 டிகிரியைச் சுழற்ற போர்டில் போதுமான அளவு ஓடுகள் இல்லை.

# validation.pacru.ONLY_NEUTRAL
source: During a borderland change, you may only convert unoccupied neutral cells.
ta: எல்லைப்புற மாற்றத்தின் போது, நீங்கள் காலியாக இல்லாத நடுநிலை செல்களை மட்டுமே மாற்றலாம்.

# validation.pacru.ONLY_OPPOSING
source: During a borderland transformation or meeting, you may only convert unoccupied opposing cells.
ta: ஒரு எல்லைப்புற மாற்றம் அல்லது சந்திப்பின் போது, நீங்கள் காலியாக இல்லாத எதிரெதிர் கலங்களை மட்டுமே மாற்றலாம்.

# validation.pacru.ONLY_UNOCCUPIED
source: You may never claim/convert a space with a chevron, except when claiming the neutral tile you're moving onto in a borderland change.
ta: எல்லைப்புற மாற்றத்தில் நீங்கள் நகரும் நடுநிலை ஓடு உரிமை கோரும்போது தவிர, நீங்கள் ஒருபோதும் ஒரு செவ்ரானுடன் ஒரு இடத்தை கோர முடியாது/மாற்ற முடியாது.

# validation.pacru.OVER_ORIENT
source: You may not reorient more than 90 degrees in a single turn.
ta: ஒரே திருப்பத்தில் நீங்கள் 90 டிகிரிக்கு மேல் மாற்றக்கூடாது.

# validation.pacru.RELINQUISH_EMPTY
source: The tile at {{where}} has a chevron. Occupied tiles cannot be relinquished.
ta: {{where} at இல் உள்ள ஓடு ஒரு செவ்ரான் உள்ளது. ஆக்கிரமிக்கப்பட்ட ஓடுகளை கைவிட முடியாது.

# validation.pacru.RELINQUISH_OWN
source: The tile at {{where}} does not belong to you and cannot be relinquished.
ta: {{where}}} உங்களுக்கு சொந்தமல்ல, கைவிட முடியாது.

# validation.pacru.REORIENT
source: Click a neighbouring cell or edge zone to select the direction you want to face.
ta: நீங்கள் எதிர்கொள்ள விரும்பும் திசையைத் தேர்ந்தெடுக்க அண்டை செல் அல்லது விளிம்பு மண்டலத்தைக் சொடுக்கு செய்க.

# validation.pacru.SELECT_CELL_blChange
source: Borderland change: Select a neutral cell to convert to your colour.
ta: பார்டர்லேண்ட் மாற்றம்: உங்கள் நிறத்திற்கு மாற்ற ஒரு நடுநிலை கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.pacru.SELECT_CELL_blTransform
source: Borderland transformation: Select an opposing cell to convert to your colour.
ta: பார்டர்லேண்ட் மாற்றம்: உங்கள் நிறத்திற்கு மாற்ற ஒரு எதிரெதிர் கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.pacru.SELECT_CELL_both
source: You changed borderlands *and* made a connection. Select one of the highlighted cells to convert it to your colour, or select your starting cell to trigger the connection change. You can't do both.
ta: நீங்கள் பார்டர்லேண்ட்சை * மாற்றி * ஒரு இணைப்பை உருவாக்கினீர்கள். சிறப்பம்சமாக கலங்களில் ஒன்றைத் தேர்ந்தெடுக்கவும், அதை உங்கள் வண்ணமாக மாற்ற அல்லது இணைப்பு மாற்றத்தைத் தூண்டுவதற்கு உங்கள் தொடக்க கலத்தைத் தேர்ந்தெடுக்கவும். நீங்கள் இரண்டையும் செய்ய முடியாது.

# validation.pacru.SELECT_CELL_meeting
source: A meeting has occurred! Select any cell to convert to your colour.
ta: ஒரு கூட்டம் ஏற்பட்டது! உங்கள் வண்ணத்திற்கு மாற்ற எந்த கலத்தையும் தேர்ந்தெடுக்கவும்.

# validation.pacru.SELECT_CELL_orientation
source: Reorientation: Select one more highlighted cell to relinquish.
ta: மறுசீரமைப்பு: கைவிட இன்னும் சிறப்பம்சமாக ஒரு சிறப்பம்சத்தைத் தேர்ந்தெடுக்கவும்.

# validation.pacru.TOO_MANY_CELLS
source: You have selected more cells than allowed by the triggered side effects.
ta: தூண்டப்பட்ட பக்க விளைவுகளால் அனுமதிக்கப்பட்டதை விட அதிகமான கலங்களைத் தேர்ந்தெடுத்துள்ளீர்கள்.

# validation.pacru.WITHIN_BL
source: Claimed/converted cells as a result of a borderland change must be within the destination borderland.
ta: எல்லைப்புற மாற்றத்தின் விளைவாக கோரப்பட்ட/மாற்றப்பட்ட செல்கள் இலக்கு எல்லைக்குள் இருக்க வேண்டும்.

# validation.pahtum.INITIAL_INSTRUCTIONS_offer
source: Place all five blocks and a single stone. Your opponent will then choose which colour to play.
ta: ஐந்து தொகுதிகளையும் ஒரு கல்லையும் வைக்கவும். உங்கள் எதிர்ப்பாளர் எந்த வண்ணத்தை இயக்க வேண்டும் என்பதைத் தேர்ந்தெடுப்பார்.

# validation.pahtum.INITIAL_INSTRUCTIONS_response
source: Click "Swap player seats" to play as first player or place a stone to remain as second player.
ta: முதல் வீரராக விளையாட "பிளேயர் இருக்கைகள் இடமாற்று" என்பதைக் சொடுக்கு செய்க அல்லது இரண்டாவது வீரராக இருக்க ஒரு கல்லை வைக்கவும்.

# validation.pahtum.INITIAL_INSTRUCTIONS_rest
source: Select an empty cell to place a stone.
ta: ஒரு கல்லை வைக்க வெற்று கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.pahtum.PARTIAL_setup
source: Continue selecting empty cells to block until you have selected five. Then place a single stone.
ta: நீங்கள் ஐந்தைத் தேர்ந்தெடுக்கும் வரை தடுக்க வெற்று கலங்களைத் தேர்ந்தெடுப்பதைத் தொடரவும். பின்னர் ஒரு கல்லை வைக்கவும்.

# validation.pahtum.PARTIAL_rest
source: Select one of the highlighted cells to capture it.
ta: சிறப்பிக்கப்பட்ட கலங்களில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.paintbucket.INITIAL_INSTRUCTIONS
source: Select any enemy cell to convert that group.
ta: அந்த குழுவை மாற்ற எந்த எதிரி கலத்தையும் தேர்ந்தெடுக்கவும்.

# validation.penguin.INITIAL_INSTRUCTIONS
source: Select one of your penguins on the board or in your hand.
ta: பலகையில் அல்லது உங்கள் கையில் உங்கள் பெங்குவின் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# validation.penguin.PARTIAL_DIRECTION_kick
source: Select a neigbouring cell to kick the ball in that direction.
ta: அந்த திசையில் பந்தை உதைக்க ஒரு நெய்க்போரிங் கலத்தைத் தேர்ந்தெடுக்கவும்.

# validation.penguin.PARTIAL_DIRECTION_penguin
source: Select a neigbouring cell to travel in that direction or, if you're laying down, click the cell again to stand up.
ta: அந்த திசையில் பயணிக்க அண்டை கலங்களைத் தேர்ந்தெடுக்கவும் அல்லது, நீங்கள் படுத்துக் கொண்டால், எழுந்து நிற்க மீண்டும் கலத்தைக் சொடுக்கு செய்க.

# validation.penguin.PARTIAL_ORIENTATION
source: Select a neighbouring cell to reorient your penguin, or click your penguin to stay in the direction you're already facing.
ta: உங்கள் பென்குயினை மாற்றியமைக்க அண்டை கலத்தைத் தேர்ந்தெடுக்கவும், அல்லது நீங்கள் ஏற்கனவே எதிர்கொள்ளும் திசையில் இருக்க உங்கள் பென்குயினைக் சொடுக்கு செய்க.

# validation.pente.OVERLINE_FORBIDDEN
source: In this variant, you may not make a placement that creates an overline.
ta: இந்த மாறுபாட்டில், நீங்கள் ஒரு மேலோட்டத்தை உருவாக்கும் ஒரு வேலைவாய்ப்பை உருவாக்கக்கூடாது.

# validation.pente.SELF_CAPTURE_FORBIDDEN
source: In this variant, you may not make a placement that results in a self-capture.
ta: இந்த மாறுபாட்டில், நீங்கள் ஒரு தன்வய பிடியில் விளைவிக்கும் ஒரு வேலைவாய்ப்பை உருவாக்கக்கூடாது.

# validation.pente.SWAP2_CAPTURE
source: This placement will result in a capture.
ta: இந்த வேலைவாய்ப்பு ஒரு பிடிப்புக்கு வழிவகுக்கும்.

# validation.phutball.BAD_DIRECTION
source: You can only jump orthogonally or diagonally. The jump from {{from}} to {{to}} is invalid.
ta: நீங்கள் ஆர்த்தோகனலி அல்லது குறுக்காக மட்டுமே குதிக்க முடியும். }} From} {{from}} வரை {{but fultion தவறானது.

# validation.phutball.CAN_JUMP
source: Select the destination of your jump.
ta: உங்கள் தாவலின் இலக்கைத் தேர்ந்தெடுக்கவும்.

# validation.phutball.CAN_JUMP_MORE
source: Looks good so far. Either complete your move or keep jumping
ta: இதுவரை நன்றாக இருக்கிறது. உங்கள் நகர்வை முடிக்கவும் அல்லது குதிக்கவும்

# validation.phutball.CANT_JUMP
source: You selected the ball, but there are no jumps available
ta: நீங்கள் பந்தைத் தேர்ந்தெடுத்தீர்கள், ஆனால் தாவல்கள் எதுவும் கிடைக்கவில்லை

# validation.phutball.INITIAL_INSTRUCTIONS
source: Place a player at an empty vertex or jump the ball over adjacent players.
ta: ஒரு வீரரை வெற்று வெர்டெக்சில் வைக்கவும் அல்லது அருகிலுள்ள வீரர்கள் மீது பந்தை குதிக்கவும்.

# validation.phutball.MUST_JUMP_PLAYER
source: You can only jump over players, not empty vertices. There is no player at {{cell}}
ta: நீங்கள் வீரர்கள் மீது மட்டுமே குதிக்க முடியும், வெற்று செங்குத்துகள் அல்ல. {{cell} at இல் எந்த வீரரும் இல்லை

# validation.phutball.NO_BALL_HERE
source: Jumping must start at the ball. There is no ball at {{cell}}.
ta: குதிப்பது பந்தில் தொடங்க வேண்டும். {{cell} at இல் பந்து இல்லை.

# validation.phutball.NO_MOVE
source: You must jump over at least one player.
ta: நீங்கள் குறைந்தது ஒரு வீரராவது மேலே செல்ல வேண்டும்.

# validation.phutball.NOT_EMPTY_JUMP
source: A jump must end in an empty vertex. {{to}} is not empty.
ta: ஒரு சம்ப் ஒரு வெற்று வெர்டெக்சில் முடிவடைய வேண்டும். {{to}} காலியாக இல்லை.

# validation.pigs.INITIAL_INSTRUCTIONS
source: Enter 'R' to spend your whole turn repairing, or type five of the following characters: ^ (forward), v (backward), \ (forward left), / (forward right), < (turn left), > (turn right), F (fire laser), H (hit with snout), X (when damaged)
ta: உங்கள் முழு திருப்பத்தை சரிசெய்ய 'ஆர்' ஐ உள்ளிடவும், அல்லது பின்வரும் எழுத்துக்களில் ஐந்தை தட்டச்சு செய்க: ^ (முன்னோக்கி), வி (பின்தங்கிய), \ (முன்னோக்கி இடது), / (முன்னோக்கி வலது), <(இடதுபுறம் திரும்பவும்),> (திரும்பவும் வலது), எஃப் (ஃபயர் லேசர்), எச் (முனகலுடன் அடிக்கவும்), ஃச் (சேதமடையும் போது)

# validation.pigs.INVALID_CMD
source: The character '{{cmd}}' is not a recognized command.
ta: '{{cmd}}' எழுத்து அங்கீகரிக்கப்பட்ட கட்டளை அல்ல.

# validation.pigs.REPAIR_SINGLE
source: The repair command takes your entire turn and is entered with a single 'R' character.
ta: பழுதுபார்க்கும் கட்டளை உங்கள் முழு திருப்பத்தையும் எடுத்து ஒற்றை 'ஆர்' எழுத்துடன் உள்ளிடப்படுகிறது.

# validation.pigs.TOOLONG
source: You may only enter five commands.
ta: நீங்கள் ஐந்து கட்டளைகளை மட்டுமே உள்ளிடலாம்.

# validation.pigs.UNDAMAGED
source: You can't repair until you've taken damage.
ta: நீங்கள் சேதம் எடுக்கும் வரை சரிசெய்ய முடியாது.

# validation.pigs.X_TOOFEW
source: You must enter an 'X' for every point of damage taken.
ta: எடுக்கப்பட்ட ஒவ்வொரு புள்ளிக்கும் நீங்கள் ஒரு 'ஃச்' உள்ளிட வேண்டும்.

# validation.pigs.X_TOOMANY
source: You entered too many 'X' commands. You only need to enter one for every point of damage taken.
ta: நீங்கள் பல 'ஃச்' கட்டளைகளை உள்ளிட்டுள்ளீர்கள். எடுக்கப்பட்ட ஒவ்வொரு புள்ளிக்கும் நீங்கள் ஒன்றை மட்டுமே உள்ளிட வேண்டும்.

# validation.pigs2.INITIAL_INSTRUCTIONS_first
source: Enter three of the following characters: ^ (forward), v (backward), \ (forward left), / (forward right), < (turn left), > (turn right), F (fire laser), H (hit with snout). Orders will execute in the order you provide, from left to right.
ta: பின்வரும் மூன்று எழுத்துக்களை உள்ளிடவும்: ^ (முன்னோக்கி), v (பின்தங்கிய), \ (முன்னோக்கி இடது), / (முன்னோக்கி வலது), <(இடதுபுறம் திரும்பவும்),> (வலதுபுறம் திரும்பவும்), எஃப் (ஃபயர் லேசர்), எச் (ச்னவுட்டுடன் இட்). இடமிருந்து வலமாக நீங்கள் வழங்கும் வரிசையில் ஆர்டர்கள் செயல்படுத்தப்படும்.
