Repository: 247i/TACETr
Catalog: உரை/தானி/adaptive-lighting-adaptive-lighting-*.po
Languages: ta

# title
source: Adaptive Lighting
ta: தகவமைப்பு விளக்குகள்

# config.step.user.title
source: Choose a name for the Adaptive Lighting instance
ta: தகவமைப்பு விளக்கு உதாரணத்திற்கு ஒரு பெயரைத் தேர்வுசெய்க

# config.step.user.description
source: Every instance can contain multiple lights!
ta: ஒவ்வொரு நிகழ்விலும் பல விளக்குகள் இருக்கலாம்!

# config.step.user.data.name
source: Name
ta: பெயர்

# config.abort.already_configured
source: This device is already configured
ta: இந்த சாதனம் ஏற்கனவே கட்டமைக்கப்பட்டுள்ளது

# options.step.init.title
source: Adaptive Lighting options
ta: தகவமைப்பு விளக்கு விருப்பங்கள்

# options.step.init.description
source: Configure an Adaptive Lighting component. Option names align with the YAML settings. If you've defined this entry in YAML, no options will appear here. For interactive graphs that demonstrate parameter effects, visit [this web app](https://basnijholt.github.io/adaptive-lighting). For further details, see the [official documentation](https://github.com/basnijholt/adaptive-lighting#readme).
ta: தகவமைப்பு விளக்கு கூறுகளை உள்ளமைக்கவும். விருப்பப் பெயர்கள் YAML அமைப்புகளுடன் சீரமைக்கப்படுகின்றன. இந்த உள்ளீட்டை நீங்கள் YAML இல் வரையறுத்திருந்தால், இங்கே எந்த விருப்பங்களும் தோன்றாது. அளவுரு விளைவுகளை நிரூபிக்கும் ஊடாடும் வரைபடங்களுக்கு, [இந்த வலை பயன்பாடு] (https://basnijholt.github.io/adaptive-lighting) ஐப் பார்வையிடவும். மேலும் விவரங்களுக்கு, [அதிகாரப்பூர்வ ஆவணங்கள்] (https://github.com/basnijholt/adaptive-lighting#readme) ஐப் பார்க்கவும்.

# options.step.init.data.lights
source: lights: List of light entity_ids to be controlled (may be empty). 🌟
ta: விளக்குகள்: கட்டுப்படுத்தப்பட வேண்டிய ஒளி நிறுவனம்_டுகளின் பட்டியல் (காலியாக இருக்கலாம்). .

# options.step.init.data.interval
source: interval
ta: இடைவேளை

# options.step.init.data.transition
source: transition
ta: மாற்றம்

# options.step.init.data.initial_transition
source: initial_transition
ta: தொடக்க_மயமாக்கல்

# options.step.init.data.min_brightness
source: min_brightness: Minimum brightness percentage. 💡
ta: min_brightness: குறைந்தபட்ச ஒளி விழுக்காடு. .

# options.step.init.data.max_brightness
source: max_brightness: Maximum brightness percentage. 💡
ta: அதிகபட்ச பிரகாசம்: அதிகபட்ச ஒளி விழுக்காடு. .

# options.step.init.data.min_color_temp
source: min_color_temp: Warmest color temperature in Kelvin. 🔥
ta: min_color_temp: கெல்வினில் வெப்பமான வண்ண வெப்பநிலை. .

# options.step.init.data.max_color_temp
source: max_color_temp: Coldest color temperature in Kelvin. ❄️
ta: MAX_COLOR_TEMP: கெல்வினில் குளிரான வண்ண வெப்பநிலை. .

# options.step.init.data.prefer_rgb_color
source: prefer_rgb_color: Whether to prefer RGB color adjustment over light color temperature when possible. 🌈
ta: bey_rgb_color: முடிந்தவரை ஒளி வண்ண வெப்பநிலையை விட RGB வண்ண சரிசெய்தலை விரும்பலாமா. .

# options.step.init.data.sleep_brightness
source: sleep_brightness
ta: ச்லீப்_பிரைட்னச்

# options.step.init.data.transition_until_sleep
source: transition_until_sleep: When enabled, Adaptive Lighting will treat sleep settings as the minimum, transitioning to these values after sunset. 🌙
ta: Transition_until_sleep: இயக்கப்பட்டால், தகவமைப்பு விளக்குகள் தூக்க அமைப்புகளை குறைந்தபட்சமாகக் கருதும், சூரிய அச்தமனத்திற்குப் பிறகு இந்த மதிப்புகளுக்கு மாறும். .

# options.step.init.data.sunrise_time
source: sunrise_time
ta: சன்ரைச்_ நேரம்

# options.step.init.data.sunrise_offset
source: sunrise_offset
ta: சன்ரைச்_ஆஃப்செட்

# options.step.init.data.sunset_time
source: sunset_time
ta: சூரிய அச்தமனம்_ நேரம்

# options.step.init.data.sunset_offset
source: sunset_offset
ta: சன்செட்_ஆஃப்செட்

# options.step.init.data.brightness_mode
source: brightness_mode
ta: பிரகாசம்_மோட்

# options.step.init.data.brightness_mode_time_dark
source: brightness_mode_time_dark
ta: பிரகாசம்_மோட்_ நேரம்_டார்க்

# options.step.init.data.brightness_mode_time_light
source: brightness_mode_time_light
ta: பிரகாசம்_மோட்_ டைம்_ லைட்

# options.step.init.data.take_over_control
source: take_over_control: Disable Adaptive Lighting if another source calls `light.turn_on` while lights are on and being adapted. Note that this calls `homeassistant.update_entity` every `interval`! 🔒
ta: Take_over_control: விளக்குகள் இயக்கத்தில் இருக்கும்போது மற்றொரு சான்று `லைட்.டர்ன்_ஓஎன்` என்று அழைத்தால் தகவமைப்பு விளக்குகளை முடக்கு. இது `ஓமாசிச்டன்ட்.பிடேட்_என்டிட்டி` ஒவ்வொரு` இடைவெளியையும் 'என்று அழைக்கிறது என்பதை நினைவில் கொள்க! .

# options.step.init.data.detect_non_ha_changes
source: detect_non_ha_changes: Detects and halts adaptations for non-`light.turn_on` state changes. Needs `take_over_control` enabled. 🕵️ Caution: ⚠️ Some lights might falsely indicate an 'on' state, which could result in lights turning on unexpectedly. Disable this feature if you encounter such issues.
ta: கண்டறிதல்_நான்_ஆ_சேஞ்ச்ச்: `விளக்கு அல்லாத. டர்ன்_ஓஎன்` மாநில மாற்றங்களுக்கான தழுவல்களைக் கண்டறிந்து நிறுத்துகிறது. `Take_over_control` இயக்கப்பட்டது. 🕵œ ​​எச்சரிக்கை: ⚠œ சில விளக்குகள் ஒரு 'ஆன்' நிலையை பொய்யாகக் குறிக்கக்கூடும், இதனால் விளக்குகள் எதிர்பாராத விதமாக இயக்கப்படலாம். இதுபோன்ற சிக்கல்களை நீங்கள் சந்தித்தால் இந்த அம்சத்தை முடக்கு.

# options.step.init.data.only_once
source: only_once: Adapt lights only when they are turned on (`true`) or keep adapting them (`false`). 🔄
ta: மட்டும்_இன்: விளக்குகள் இயக்கப்படும்போது மட்டுமே (`உண்மை`) மாற்றியமைக்கும்போது அல்லது அவற்றைத் தழுவிக்கொள்ளுங்கள் (` தவறு`). .

# options.step.init.data.adapt_only_on_bare_turn_on
source: adapt_only_on_bare_turn_on: When turning lights on initially. If set to `true`, AL adapts only if `light.turn_on` is invoked without specifying color or brightness. ❌🌈 This e.g., prevents adaptation when activating a scene. If `false`, AL adapts regardless of the presence of color or brightness in the initial `service_data`. Needs `take_over_control` enabled. 🕵️
ta: Sadve_only_on_bare_turn_on: ஆரம்பத்தில் விளக்குகளை இயக்கும்போது. `உண்மை` என அமைக்கப்பட்டால், வண்ணம் அல்லது பிரகாசத்தைக் குறிப்பிடாமல்` லைட்.டர்ன்_ஓஎன்` செயல்படுத்தப்பட்டால் மட்டுமே அல் மாற்றியமைக்கிறது. ❌🌈 இது எ.கா., ஒரு காட்சியை செயல்படுத்தும்போது தழுவலைத் தடுக்கிறது. `தவறு` என்றால், ஆரம்ப` சேவை_டா` இல் நிறம் அல்லது ஒளி இருப்பதைப் பொருட்படுத்தாமல் AL மாற்றியமைக்கிறது. `Take_over_control` இயக்கப்பட்டது. .

# options.step.init.data.separate_turn_on_commands
source: separate_turn_on_commands: Use separate `light.turn_on` calls for color and brightness, needed for some light types. 🔀
ta: தனித்தனி_டர்ன்_ஆன்_காமண்ட்ச்: சில ஒளி வகைகளுக்கு தேவைப்படும் வண்ணம் மற்றும் பிரகாசத்திற்கான தனித்தனி `லைட்.டர்ன்_ஓஎன்` அழைப்புகளைப் பயன்படுத்தவும். .

# options.step.init.data.adapt_delay
source: adapt_delay
ta: அடாபம்_டெலே

# options.step.init.data.skip_redundant_commands
source: skip_redundant_commands: Skip sending adaptation commands whose target state already equals the light's known state. Minimizes network traffic and improves the adaptation responsivity in some situations. 📉Disable if physical light states get out of sync with HA's recorded state.
ta: Skip_redundant_commands: தழுவல் கட்டளைகளை அனுப்புவதைத் தவிர்க்கவும், அதன் இலக்கு நிலை ஏற்கனவே ஒளியின் அறியப்பட்ட நிலைக்கு சமம். பிணையம் போக்குவரத்தை குறைக்கிறது மற்றும் சில சூழ்நிலைகளில் தழுவல் மறுமொழியை மேம்படுத்துகிறது. ஆ இன் பதிவு செய்யப்பட்ட நிலையுடன் இயற்பியல் ஒளி நிலைகள் ஒத்திசைவிலிருந்து வெளியேறினால் அது காணக்கூடியது.

# options.step.init.data.intercept
source: intercept: Intercept and adapt `light.turn_on` calls to enabling instantaneous color and brightness adaptation. 🏎️ Disable for lights that do not support `light.turn_on` with color and brightness.
ta: இடைமறிப்பு: உடனடி வண்ணம் மற்றும் பிரகாசமான தழுவலை செயல்படுத்த `ஒளி. Color வண்ணம் மற்றும் பிரகாசத்துடன் `ஒளி.

# options.step.init.data.multi_light_intercept
source: multi_light_intercept: Intercept and adapt `light.turn_on` calls that target multiple lights. ➗⚠️ This might result in splitting up a single `light.turn_on` call into multiple calls, e.g., when lights are in different switches. Requires `intercept` to be enabled.
ta: Mulli_light_intect: பல விளக்குகளை குறிவைக்கும் `light.turn_on` அழைப்புகளை இடைமறிக்கவும் மாற்றவும். ➗⚠œ இது ஒரு `லைட்.டர்ன்_ஒன்` அழைப்பை பல அழைப்புகளாக பிரிக்கக்கூடும், எ.கா., விளக்குகள் வெவ்வேறு சுவிட்சுகளில் இருக்கும்போது. இயக்கப்பட வேண்டும் `இடைமறிப்பு` தேவை.

# options.step.init.data.include_config_in_attributes
source: include_config_in_attributes: Show all options as attributes on the switch in Home Assistant when set to `true`. 📝
ta: அடங்கும்_கான்ஃபிக்_இன்_அட்ரிபியூட்: `உண்மை` என அமைக்கப்பட்டிருக்கும் போது வீட்டு உதவியாளரின் சுவிட்சில் உள்ள பண்புகளாக அனைத்து விருப்பங்களையும் காட்டுங்கள். .

# options.step.init.data_description.interval
source: Frequency to adapt the lights, in seconds. 🔄
ta: விளக்குகளை மாற்றியமைக்க அதிர்வெண், நொடிகளில். .

# options.step.init.data_description.transition
source: Duration of transition when lights change, in seconds. 🕑
ta: விளக்குகள் மாறும்போது, ​​நொடிகளில் மாற்றத்தின் காலம். .

# options.step.init.data_description.initial_transition
source: Duration of the first transition when lights turn from `off` to `on` in seconds. ⏲️
ta: விளக்குகள் `ஆஃப்` முதல்` ஆன் `வரை நொடிகளில் மாறும் போது முதல் மாற்றத்தின் காலம். .

# options.step.init.data_description.sleep_brightness
source: Brightness percentage of lights in sleep mode. 😴
ta: தூக்க பயன்முறையில் விளக்குகளின் ஒளி விழுக்காடு. .

# options.step.init.data_description.sleep_rgb_or_color_temp
source: Use either `"rgb_color"` or `"color_temp"` in sleep mode. 🌙
ta: தூக்க பயன்முறையில் `" rgb_color "` அல்லது `" Color_Temp "key ஐப் பயன்படுத்தவும். .

# options.step.init.data_description.sleep_color_temp
source: Color temperature in sleep mode (used when `sleep_rgb_or_color_temp` is `color_temp`) in Kelvin. 😴
ta: ச்லீப் பயன்முறையில் வண்ண வெப்பநிலை (கெல்வினில் `SLEEP_RGB_OR_COLOR_TEMP` என்பது` color_temp` ஆக இருக்கும்போது பயன்படுத்தப்படுகிறது). .

# options.step.init.data_description.sleep_rgb_color
source: RGB color in sleep mode (used when `sleep_rgb_or_color_temp` is "rgb_color"). 🌈
ta: தூக்க பயன்முறையில் RGB வண்ணம் (`SLEEP_RGB_OR_COLOR_TEMP`" RGB_COLOR "ஆக இருக்கும்போது பயன்படுத்தப்படுகிறது). .

# options.step.init.data_description.sleep_transition
source: Duration of transition when "sleep mode" is toggled in seconds. 😴
ta: "தூக்க பயன்முறை" நொடிகளில் மாற்றப்படும்போது மாற்றத்தின் காலம். .

# options.step.init.data_description.sunrise_time
source: Set a fixed time (HH:MM:SS) for sunrise. 🌅
ta: சூரிய உதயத்திற்கு ஒரு நிலையான நேரத்தை (HH: MM: SS) அமைக்கவும். .

# options.step.init.data_description.min_sunrise_time
source: Set the earliest virtual sunrise time (HH:MM:SS), allowing for later sunrises. 🌅
ta: ஆரம்பகால மெய்நிகர் சூரிய உதய நேரத்தை (HH: MM: SS) அமைக்கவும், பின்னர் சூரிய உதயங்களை அனுமதிக்கிறது. .

# options.step.init.data_description.max_sunrise_time
source: Set the latest virtual sunrise time (HH:MM:SS), allowing for earlier sunrises. 🌅
ta: ஆரம்பகால சூரிய உதயத்தை அனுமதிக்கும் அண்மைக் கால மெய்நிகர் சூரிய தோன்றுகை நேரத்தை (HH: MM: SS) அமைக்கவும். .

# options.step.init.data_description.sunrise_offset
source: Adjust sunrise time with a positive or negative offset in seconds. ⏰
ta: விநாடிகளில் நேர்மறை அல்லது எதிர்மறை ஆஃப்செட் மூலம் சூரிய தோன்றுகை நேரத்தை சரிசெய்யவும். .

# options.step.init.data_description.sunset_time
source: Set a fixed time (HH:MM:SS) for sunset. 🌇
ta: சூரிய அச்தமனத்திற்கு ஒரு நிலையான நேரத்தை (HH: MM: SS) அமைக்கவும். .

# options.step.init.data_description.min_sunset_time
source: Set the earliest virtual sunset time (HH:MM:SS), allowing for later sunsets. 🌇
ta: ஆரம்பகால மெய்நிகர் சூரிய மறைவு நேரத்தை (HH: MM: SS) அமைக்கவும், பின்னர் சூரிய அச்தமனங்களை அனுமதிக்கிறது. .

# options.step.init.data_description.max_sunset_time
source: Set the latest virtual sunset time (HH:MM:SS), allowing for earlier sunsets. 🌇
ta: முந்தைய சூரிய அச்தமனங்களை அனுமதிக்கும் அண்மைக் கால மெய்நிகர் சன்செட் நேரத்தை (HH: MM: SS) அமைக்கவும். .

# options.step.init.data_description.sunset_offset
source: Adjust sunset time with a positive or negative offset in seconds. ⏰
ta: விநாடிகளில் நேர்மறை அல்லது எதிர்மறை ஆஃப்செட் மூலம் சூரிய மறைவு நேரத்தை சரிசெய்யவும். .

# options.step.init.data_description.brightness_mode
source: Brightness mode to use. Possible values are `default`, `linear`, and `tanh` (uses `brightness_mode_time_dark` and `brightness_mode_time_light`). 📈
ta: பயன்படுத்த பிரகாசமான முறை. சாத்தியமான மதிப்புகள் `இயல்புநிலை`,` லீனியர்`, மற்றும் `டான்` (` பிரகாசம்_மோட்_ நேரம்_டார்க்` மற்றும் `பிரகாசம்_மோட்_மட்_லிட்` ஆகியவற்றைப் பயன்படுத்துகின்றன). .

# options.step.init.data_description.autoreset_control_seconds
source: Automatically reset the manual control after a number of seconds. Set to 0 to disable. ⏲️
ta: பல விநாடிகளுக்குப் பிறகு தானாகவே கையேடு கட்டுப்பாட்டை மீட்டமைக்கவும். முடக்க 0 என அமைக்கவும். .

# options.step.init.data_description.send_split_delay
source: Delay (ms) between `separate_turn_on_commands` for lights that don't support simultaneous brightness and color setting. ⏲️
ta: ஒரே நேரத்தில் ஒளி மற்றும் வண்ண அமைப்பை ஆதரிக்காத விளக்குகளுக்கு `தனி_டர்ன்_ஆன்_காமண்ட்ச்` இடையே நேரந்தவறுகை (எம்.எச்). .

# options.step.init.data_description.adapt_delay
source: Wait time (seconds) between light turn on and Adaptive Lighting applying changes. Might help to avoid flickering. ⏲️
ta: லைட் டர்ன் மற்றும் தகவமைப்பு விளக்குகள் இடையே காத்திருப்பு நேரம் (விநாடிகள்) மாற்றங்களைப் பயன்படுத்துகிறது. ஒளிரும் தவிர்க்க உதவலாம். .

# options.error.option_error
source: Invalid option
ta: தவறான விருப்பம்

# options.error.entity_missing
source: One or more selected light entities are missing from Home Assistant
ta: ஒன்று அல்லது அதற்கு மேற்பட்ட தேர்ந்தெடுக்கப்பட்ட ஒளி நிறுவனங்கள் வீட்டு உதவியாளரிடமிருந்து காணவில்லை

# services.apply.name
source: apply
ta: இடு

# services.apply.description
source: Applies the current Adaptive Lighting settings to lights.
ta: தற்போதைய தகவமைப்பு லைட்டிங் அமைப்புகளை விளக்குகளுக்கு பயன்படுத்துகிறது.

# services.apply.fields.entity_id.description
source: The `entity_id` of the switch with the settings to apply. 📝
ta: விண்ணப்பிக்க அமைப்புகளுடன் சுவிட்சின் `ENTITY_ID`. .

# services.apply.fields.entity_id.name
source: entity_id
ta: நிறுவனம்_ஐடி

# services.apply.fields.lights.description
source: A light (or list of lights) to apply the settings to. 💡
ta: அமைப்புகளைப் பயன்படுத்த ஒரு ஒளி (அல்லது விளக்குகளின் பட்டியல்). .

# services.apply.fields.lights.name
source: lights
ta: விளக்குகள்

# services.apply.fields.transition.description
source: Duration of transition when lights change, in seconds. 🕑
ta: விளக்குகள் மாறும்போது, ​​நொடிகளில் மாற்றத்தின் காலம். .

# services.apply.fields.transition.name
source: transition
ta: மாற்றம்

# services.apply.fields.adapt_brightness.description
source: Whether to adapt the brightness of the light. 🌞
ta: ஒளியின் பிரகாசத்தை மாற்றியமைக்க வேண்டுமா. .

# services.apply.fields.adapt_brightness.name
source: adapt_brightness
ta: அடாப்ட்_பிரைட்னச்

# services.apply.fields.adapt_color.description
source: Whether to adapt the color on supporting lights. 🌈
ta: துணை விளக்குகளில் வண்ணத்தை மாற்றியமைக்க வேண்டுமா. .

# services.apply.fields.adapt_color.name
source: adapt_color
ta: அடாபம்_கோலர்

# services.apply.fields.prefer_rgb_color.description
source: Whether to prefer RGB color adjustment over light color temperature when possible. 🌈
ta: முடிந்தவரை ஒளி வண்ண வெப்பநிலையை விட RGB வண்ண சரிசெய்தலை விரும்பலாமா. .

# services.apply.fields.prefer_rgb_color.name
source: prefer_rgb_color
ta: bey_rgb_color

# services.apply.fields.turn_on_lights.description
source: Whether to turn on lights that are currently off. 🔆
ta: தற்போது முடக்கப்பட்ட விளக்குகளை இயக்க வேண்டுமா. .

# services.apply.fields.turn_on_lights.name
source: turn_on_lights
ta: டர்ன்_ஓஎன்_ விளக்குகள்

# services.set_manual_control.description
source: Mark whether a light is 'manually controlled'.
ta: ஒரு ஒளி 'கைமுறையாக கட்டுப்படுத்தப்பட்டதா' என்பதைக் குறிக்கவும்.

# services.set_manual_control.fields.entity_id.description
source: The `entity_id` of the switch in which to (un)mark the light as being `manually controlled`. 📝
ta: சுவிட்சின் `நிறுவனம்_ஐடி`, இதில் (அன்) ஒளியை` கைமுறையாக கட்டுப்படுத்தப்படுகிறது 'என்று குறிக்கவும். .

# services.set_manual_control.fields.entity_id.name
source: entity_id
ta: நிறுவனம்_ஐடி

# services.set_manual_control.fields.lights.description
source: entity_id(s) of lights, if not specified, all lights in the switch are selected. 💡
ta: விளக்குகளின் entity_id (கள்), குறிப்பிடப்படாவிட்டால், சுவிட்சில் உள்ள அனைத்து விளக்குகளும் தேர்ந்தெடுக்கப்படுகின்றன. .

# services.set_manual_control.fields.lights.name
source: lights
ta: விளக்குகள்

# services.set_manual_control.fields.manual_control.description
source: Whether to add ("true") or remove ("false") the light from the "manual_control" list. 🔒
ta: "கையேடு_ கன்ட்ரோல்" பட்டியலிலிருந்து ஒளியை சேர்க்க வேண்டுமா அல்லது அகற்ற வேண்டுமா அல்லது அகற்ற வேண்டுமா அல்லது அகற்ற வேண்டுமா? .

# services.set_manual_control.fields.manual_control.name
source: manual_control
ta: கையேடு_ கன்ட்ரோல்

# services.change_switch_settings.description
source: Change any settings you'd like in the switch. All options here are the same as in the config flow.
ta: சுவிட்சில் நீங்கள் விரும்பும் எந்த அமைப்புகளையும் மாற்றவும். இங்குள்ள அனைத்து விருப்பங்களும் கட்டமைப்பு ஓட்டத்தில் உள்ளதைப் போலவே இருக்கும்.

# services.change_switch_settings.fields.entity_id.description
source: Entity ID of the switch. 📝
ta: சுவிட்சின் நிறுவன ஐடி. .

# services.change_switch_settings.fields.entity_id.name
source: entity_id
ta: நிறுவனம்_ஐடி

# services.change_switch_settings.fields.use_defaults.description
source: Sets the default values not specified in this service call. Options: "current" (default, retains current values), "factory" (resets to documented defaults), or "configuration" (reverts to switch config defaults). ⚙️
ta: இந்த பணி அழைப்பில் குறிப்பிடப்படாத இயல்புநிலை மதிப்புகளை அமைக்கிறது. விருப்பங்கள்: "நடப்பு" (இயல்புநிலை, தற்போதைய மதிப்புகளைத் தக்க வைத்துக் கொள்கிறது), "தொழிற்சாலை" (ஆவணப்படுத்தப்பட்ட இயல்புநிலைகளுக்கு மீட்டமைக்கிறது) அல்லது "உள்ளமைவு" (கட்டமைப்பு இயல்புநிலைகளை மாற்றுவதற்கு மாற்றுகிறது). .

# services.change_switch_settings.fields.include_config_in_attributes.description
source: Show all options as attributes on the switch in Home Assistant when set to `true`. 📝
ta: `உண்மை` என அமைக்கப்பட்டிருக்கும் போது வீட்டு உதவியாளரின் சுவிட்சில் உள்ள அனைத்து விருப்பங்களையும் பண்புகளாகக் காட்டுங்கள். .

# services.change_switch_settings.fields.include_config_in_attributes.name
source: include_config_in_attributes
ta: அடங்கும்_கான்ஃபிக்_இன்_அட்ரிபியூட்ச்

# services.change_switch_settings.fields.turn_on_lights.description
source: Whether to turn on lights that are currently off. 🔆
ta: தற்போது முடக்கப்பட்ட விளக்குகளை இயக்க வேண்டுமா. .

# services.change_switch_settings.fields.turn_on_lights.name
source: turn_on_lights
ta: டர்ன்_ஓஎன்_ விளக்குகள்

# services.change_switch_settings.fields.initial_transition.description
source: Duration of the first transition when lights turn from `off` to `on` in seconds. ⏲️
ta: விளக்குகள் `ஆஃப்` முதல்` ஆன் `வரை நொடிகளில் மாறும் போது முதல் மாற்றத்தின் காலம். .

# services.change_switch_settings.fields.initial_transition.name
source: initial_transition
ta: தொடக்க_மயமாக்கல்

# services.change_switch_settings.fields.sleep_transition.description
source: Duration of transition when "sleep mode" is toggled in seconds. 😴
ta: "தூக்க பயன்முறை" நொடிகளில் மாற்றப்படும்போது மாற்றத்தின் காலம். .

# services.change_switch_settings.fields.max_brightness.description
source: Maximum brightness percentage. 💡
ta: அதிகபட்ச ஒளி விழுக்காடு. .

# services.change_switch_settings.fields.max_brightness.name
source: max_brightness
ta: MAX_ பிரைட்னச்

# services.change_switch_settings.fields.max_color_temp.description
source: Coldest color temperature in Kelvin. ❄️
ta: கெல்வினில் குளிரான வண்ண வெப்பநிலை. .

# services.change_switch_settings.fields.min_brightness.description
source: Minimum brightness percentage. 💡
ta: குறைந்தபட்ச ஒளி விழுக்காடு. .

# services.change_switch_settings.fields.min_color_temp.description
source: Warmest color temperature in Kelvin. 🔥
ta: கெல்வினில் வெப்பமான வண்ண வெப்பநிலை. .

# services.change_switch_settings.fields.only_once.description
source: Adapt lights only when they are turned on (`true`) or keep adapting them (`false`). 🔄
ta: விளக்குகள் இயக்கப்படும்போது மட்டுமே (`உண்மை`) மாற்றியமைக்கும்போது அல்லது அவற்றைத் தழுவிக்கொள்ளுங்கள் (` பொய்`). .

# services.change_switch_settings.fields.only_once.name
source: only_once
ta: மட்டும்_இன்

# services.change_switch_settings.fields.prefer_rgb_color.description
source: Whether to prefer RGB color adjustment over light color temperature when possible. 🌈
ta: முடிந்தவரை ஒளி வண்ண வெப்பநிலையை விட RGB வண்ண சரிசெய்தலை விரும்பலாமா. .

# services.change_switch_settings.fields.prefer_rgb_color.name
source: prefer_rgb_color
ta: bey_rgb_color

# services.change_switch_settings.fields.separate_turn_on_commands.description
source: Use separate `light.turn_on` calls for color and brightness, needed for some light types. 🔀
ta: சில ஒளி வகைகளுக்கு தேவைப்படும் வண்ணம் மற்றும் பிரகாசத்திற்கான தனித்தனி `லைட்.டர்ன்_ஓஎன்` அழைப்புகளைப் பயன்படுத்தவும். .

# services.change_switch_settings.fields.separate_turn_on_commands.name
source: separate_turn_on_commands
ta: தனித்தனி_டர்ன்_ஆன்_காமண்ட்ச்

# services.change_switch_settings.fields.send_split_delay.description
source: Delay (ms) between `separate_turn_on_commands` for lights that don't support simultaneous brightness and color setting. ⏲️
ta: ஒரே நேரத்தில் ஒளி மற்றும் வண்ண அமைப்பை ஆதரிக்காத விளக்குகளுக்கு `தனி_டர்ன்_ஆன்_காமண்ட்ச்` இடையே நேரந்தவறுகை (எம்.எச்). .

# services.change_switch_settings.fields.sleep_brightness.description
source: Brightness percentage of lights in sleep mode. 😴
ta: தூக்க பயன்முறையில் விளக்குகளின் ஒளி விழுக்காடு. .

# services.change_switch_settings.fields.sleep_brightness.name
source: sleep_brightness
ta: ச்லீப்_பிரைட்னச்

# services.change_switch_settings.fields.sleep_rgb_or_color_temp.description
source: Use either `"rgb_color"` or `"color_temp"` in sleep mode. 🌙
ta: தூக்க பயன்முறையில் `" rgb_color "` அல்லது `" Color_Temp "key ஐப் பயன்படுத்தவும். .

# services.change_switch_settings.fields.sleep_rgb_color.description
source: RGB color in sleep mode (used when `sleep_rgb_or_color_temp` is "rgb_color"). 🌈
ta: தூக்க பயன்முறையில் RGB வண்ணம் (`SLEEP_RGB_OR_COLOR_TEMP`" RGB_COLOR "ஆக இருக்கும்போது பயன்படுத்தப்படுகிறது). .

# services.change_switch_settings.fields.sleep_color_temp.description
source: Color temperature in sleep mode (used when `sleep_rgb_or_color_temp` is `color_temp`) in Kelvin. 😴
ta: ச்லீப் பயன்முறையில் வண்ண வெப்பநிலை (கெல்வினில் `SLEEP_RGB_OR_COLOR_TEMP` என்பது` color_temp` ஆக இருக்கும்போது பயன்படுத்தப்படுகிறது). .

# services.change_switch_settings.fields.sunrise_offset.description
source: Adjust sunrise time with a positive or negative offset in seconds. ⏰
ta: விநாடிகளில் நேர்மறை அல்லது எதிர்மறை ஆஃப்செட் மூலம் சூரிய தோன்றுகை நேரத்தை சரிசெய்யவும். .

# services.change_switch_settings.fields.sunrise_offset.name
source: sunrise_offset
ta: சன்ரைச்_ஆஃப்செட்

# services.change_switch_settings.fields.sunrise_time.description
source: Set a fixed time (HH:MM:SS) for sunrise. 🌅
ta: சூரிய உதயத்திற்கு ஒரு நிலையான நேரத்தை (HH: MM: SS) அமைக்கவும். .

# services.change_switch_settings.fields.sunrise_time.name
source: sunrise_time
ta: சன்ரைச்_ நேரம்

# services.change_switch_settings.fields.sunset_offset.description
source: Adjust sunset time with a positive or negative offset in seconds. ⏰
ta: வினாடிகளில் நேர்மறை அல்லது எதிர்மறை ஆஃப்செட் மூலம் சூரிய மறைவு நேரத்தை சரிசெய்யவும். .

# services.change_switch_settings.fields.sunset_offset.name
source: sunset_offset
ta: சன்செட்_ஆஃப்செட்

# services.change_switch_settings.fields.sunset_time.description
source: Set a fixed time (HH:MM:SS) for sunset. 🌇
ta: சூரிய அச்தமனத்திற்கு ஒரு நிலையான நேரத்தை (HH: MM: SS) அமைக்கவும். .
