Repository: 247i/TACETr
Catalog: உரை/தானி/adaptive-lighting-adaptive-lighting-*.po
Languages: ta

# services.change_switch_settings.fields.sunset_time.name
source: sunset_time
ta: சூரிய அச்தமனம்_ நேரம்

# services.change_switch_settings.fields.max_sunrise_time.description
source: Set the latest virtual sunrise time (HH:MM:SS), allowing for earlier sunrises. 🌅
ta: ஆரம்பகால சூரிய உதயத்தை அனுமதிக்கும் அண்மைக் கால மெய்நிகர் சூரிய தோன்றுகை நேரத்தை (HH: MM: SS) அமைக்கவும். .

# services.change_switch_settings.fields.min_sunset_time.description
source: Set the earliest virtual sunset time (HH:MM:SS), allowing for later sunsets. 🌇
ta: ஆரம்பகால மெய்நிகர் சூரிய மறைவு நேரத்தை (HH: MM: SS) அமைக்கவும், பின்னர் சூரிய அச்தமனங்களை அனுமதிக்கிறது. .

# services.change_switch_settings.fields.take_over_control.description
source: Disable Adaptive Lighting if another source calls `light.turn_on` while lights are on and being adapted. Note that this calls `homeassistant.update_entity` every `interval`! 🔒
ta: விளக்குகள் இயக்கத்தில் இருக்கும்போது மற்றொரு சான்று `லைட்.டர்ன்_ஒன்` என்று அழைத்தால் தகவமைப்பு விளக்குகளை முடக்கு. இது `ஓமாசிச்டன்ட்.பிடேட்_என்டிட்டி` ஒவ்வொரு` இடைவெளியையும் 'என்று அழைக்கிறது என்பதை நினைவில் கொள்க! .

# services.change_switch_settings.fields.detect_non_ha_changes.description
source: Detects and halts adaptations for non-`light.turn_on` state changes. Needs `take_over_control` enabled. 🕵️ Caution: ⚠️ Some lights might falsely indicate an 'on' state, which could result in lights turning on unexpectedly. Disable this feature if you encounter such issues.
ta: `விளக்கு அல்லாத. டர்ன்_ஓஎன்` மாநில மாற்றங்களுக்கான தழுவல்களைக் கண்டறிந்து நிறுத்துகிறது. `Take_over_control` இயக்கப்பட்டது. 🕵œ ​​எச்சரிக்கை: ⚠œ சில விளக்குகள் ஒரு 'ஆன்' நிலையை பொய்யாகக் குறிக்கக்கூடும், இதனால் விளக்குகள் எதிர்பாராத விதமாக இயக்கப்படலாம். இதுபோன்ற சிக்கல்களை நீங்கள் சந்தித்தால் இந்த அம்சத்தை முடக்கு.

# services.change_switch_settings.fields.transition.description
source: Duration of transition when lights change, in seconds. 🕑
ta: விளக்குகள் மாறும்போது, ​​நொடிகளில் மாற்றத்தின் காலம். .

# services.change_switch_settings.fields.transition.name
source: transition
ta: மாற்றம்

# services.change_switch_settings.fields.adapt_delay.description
source: Wait time (seconds) between light turn on and Adaptive Lighting applying changes. Might help to avoid flickering. ⏲️
ta: லைட் டர்ன் மற்றும் தகவமைப்பு விளக்குகள் இடையே காத்திருப்பு நேரம் (விநாடிகள்) மாற்றங்களைப் பயன்படுத்துகிறது. ஒளிரும் தவிர்க்க உதவலாம். .

# services.change_switch_settings.fields.adapt_delay.name
source: adapt_delay
ta: அடாபம்_டெலே

# services.change_switch_settings.fields.autoreset_control_seconds.description
source: Automatically reset the manual control after a number of seconds. Set to 0 to disable. ⏲️
ta: பல விநாடிகளுக்குப் பிறகு தானாகவே கையேடு கட்டுப்பாட்டை மீட்டமைக்கவும். முடக்க 0 என அமைக்கவும். .
