Repository: 247i/TACETr
Catalog: உரை/தானி/aidoku-strings-*.po
Languages: ta

source: Refresh Metadata
ta: மெட்டாடேட்டாவை புதுப்பிக்கவும்

source: Background Refresh
ta: பின்னணி புதுப்பிப்பு

# BACKGROUND_REFRESH_TEXT
source: When starting a library refresh manually, allow the refresh to complete even if the app is backgrounded.
ta: லைப்ரரியை கைமுறையாகப் புதுப்பிக்கத் தொடங்கும் போது, ​​ஆப்ச் பின்னணியில் இருந்தாலும் புதுப்பிப்பை முடிக்க அனுமதிக்கவும்.

source: Delete Download After Reading
ta: படித்த பிறகு பதிவிறக்கத்தை நீக்கு

source: Never
ta: ஒருபோதும்

source: Every 6 hours
ta: ஒவ்வொரு 6 மணிநேரமும்

source: Every 12 hours
ta: ஒவ்வொரு 12 மணி நேரமும்

source: Daily
ta: நாள்தோறும்

source: Every 2 days
ta: ஒவ்வொரு 2 நாட்களுக்கும்

source: Weekly
ta: வாராந்திர

source: With unread chapters
ta: படிக்காத அத்தியாயங்களுடன்

source: With completed status
ta: நிறைவு செய்யப்பட்ட நிலையுடன்

source: That haven't been read
ta: அது படிக்கப்படவில்லை

source: No Results for “%@”
ta: “%@” க்கான முடிவுகள் இல்லை

# NO_RESULTS_TEXT
source: Check the spelling or try a new search.
ta: எழுத்துப்பிழையைச் சரிபார்க்கவும் அல்லது புதிய தேடலை முயற்சிக்கவும்.

source: Learn more…
ta: மேலும் அறிக…

source: Insights
ta: நுண்ணறிவு

source: Streaks
ta: கோடுகள்

source: Stats
ta: புள்ளிவிவரங்கள்

source: Current Streak
ta: தற்போதைய ச்ட்ரீக்

source: No Current Streak
ta: கரண்ட் ச்ட்ரீக் இல்லை

# NO_CURRENT_STREAK_TEXT
source: Read every day to build a streak.
ta: ஒரு ச்ட்ரீக்கை உருவாக்க ஒவ்வொரு நாளும் படிக்கவும்.

source: Longest Streak
ta: நீளமான ச்ட்ரீக்

source: Days
ta: நாட்கள்

# CHAPTER_PLURAL
source: Chapters
ta: பாடங்கள்

# CHAPTER_SINGULAR
source: Chapter
ta: பாடங்கள்

# PAGE_PLURAL
source: Pages
ta: பக்கங்கள்

# PAGE_SINGULAR
source: Page
ta: பக்கம்

# SERIES_PLURAL
source: Series
ta: தொடர்

# SERIES_SINGULAR
source: Series
ta: தொடர்

# HOUR_PLURAL
source: Hours
ta: மணிநேரம்

# HOUR_SINGULAR
source: Hour
ta: மணி

source: All-time
ta: எல்லா நேரமும்

source: This Month
ta: இந்த மாதம்

source: This Year
ta: இந்த ஆண்டு

source: Source Lists
ta: மூல பட்டியல்கள்

source: Source List Added
ta: மூல பட்டியல் சேர்க்கப்பட்டது

# SOURCE_LIST_ADDED_TEXT
source: You can now browse external sources in the Browse tab.
ta: நீங்கள் இப்போது உலாவு தாவலில் வெளிப்புற ஆதாரங்களை உலாவலாம்.

source: Source List URL
ta: மூல பட்டியல் முகவரி

# SOURCE_LIST_ADD
source: Add Source List
ta: மூல பட்டியலைச் சேர்

# SOURCE_LIST_ADD_TEXT
source: Enter the source list URL
ta: மூல பட்டியல் முகவரி ஐ உள்ளிடவும்

# SOURCE_LIST_ADD_FAIL
source: Failed to Add Source List
ta: மூல பட்டியலைச் சேர்க்கத் தவறிவிட்டது

# SOURCE_LIST_ADD_FAIL_TEXT
source: The provided source list URL is invalid or has already been added.
ta: வழங்கப்பட்ட மூல பட்டியல் முகவரி தவறானது அல்லது ஏற்கனவே சேர்க்கப்பட்டுள்ளது.

source: Unavailable Source Lists
ta: கிடைக்காத மூலப் பட்டியல்கள்

# UNAVAILABLE_SOURCE_LISTS_TEXT
source: An error occured while fetching the above source lists.
ta: மேலே உள்ள மூலப் பட்டியல்களைப் பெறும்போது பிழை ஏற்பட்டது.

source: Copy URL
ta: முகவரி ஐ நகலெடுக்கவும்

source: Upscaling
ta: அப்ச்கேலிங்

source: Upscale Images
ta: உயர்தர படங்கள்

source: Upscaling Models
ta: உயர்தர மாதிரிகள்

# UPSCALE_MAX_IMAGE_HEIGHT
source: Maximum Image Height
ta: அதிகபட்ச பட உயரம்

# UPSCALE_MAX_IMAGE_HEIGHT_TEXT
source: Images larger than the maxmimum image height won't be upscaled.
ta: அதிகபட்ச பட உயரத்தை விட பெரிய படங்கள் உயர்த்தப்படாது.

source: Enabled Model
ta: இயக்கப்பட்ட மாதிரி

source: Available Models
ta: கிடைக்கும் மாதிரிகள்

source: No Available Models
ta: கிடைக்கக்கூடிய மாதிரிகள் இல்லை

# NO_AVAILABLE_MODELS_TEXT
source: Failed to fetch available models. Check your network connection and ensure your app is running the latest version.
ta: கிடைக்கக்கூடிய மாடல்களைப் பெறுவதில் தோல்வி. உங்கள் பிணையம் இணைப்பைச் சரிபார்த்து, உங்கள் ஆப்ச் அண்மைக் கால பதிப்பில் இயங்குவதை உறுதிசெய்யவும்.

source: Model Info
ta: மாதிரி செய்தி

source: Lock History Tab
ta: பூட்டு வரலாற்று தாவல்

source: Downsample Images
ta: படங்களை குறைத்து மதிப்பிடுங்கள்

source: Crop Borders
ta: பயிர் எல்லைகள்

source: Disable Quick Actions
ta: விரைவான செயல்களை முடக்கு

source: Live Text
ta: நேரடி உரை

# READER_BG_COLOR
source: Background Color
ta: பின்னணி நிறம்

# READER_BG_COLOR_SYSTEM
source: System
ta: மண்டலம்

# READER_BG_COLOR_AUTO
source: Automatic
ta: தானியங்கி

# READER_BG_COLOR_WHITE
source: White
ta: வெள்ளை

# READER_BG_COLOR_BLACK
source: Black
ta: கருப்பு

source: Tap Zones
ta: மண்டலங்களைத் தட்டவும்

# ZONE_LEFT_RIGHT
source: Left and Right
ta: இடது மற்றும் வலது

# ZONE_L_SHAPED
source: L-shaped
ta: எல் வடிவமானது

# ZONE_KINDLE
source: Kindle
ta: கின்டில்

# ZONE_EDGE
source: Edge
ta: விளிம்பு

source: Disabled
ta: முடக்கப்பட்டது

source: Invert Tap Zones
ta: குழாய் மண்டலங்களை மாற்றவும்

source: Animate Page Transitions
ta: பக்க மாற்றங்களை அனிமேட் செய்யவும்

source: Backups
ta: காப்புப்பிரதிகள்

source: Backup Name
ta: காப்புப்பிரதி பெயர்

source: Rename Backup
ta: காப்புப்பிரதி என மறுபெயரிடுங்கள்

# RENAME_BACKUP_TEXT
source: Enter a new name for your backup
ta: உங்கள் காப்புப்பிரதிக்கு புதிய பெயரை உள்ளிடவும்

source: Corrupted Backup
ta: சிதைந்த காப்புப்பிரதி

# CORRUPTED_BACKUP_TEXT
source: This backup seems to have misconfigured data. Renaming is not possible.
ta: இந்த காப்புப்பிரதி தவறாக கட்டமைக்கப்பட்ட தரவைக் கொண்டிருப்பதாகத் தெரிகிறது. மறுபெயரிடுவது சாத்தியமில்லை.

# BACKUP_INFO
source: Long press on a backup to export it, or swipe to the left to delete.
ta: அதை ஏற்றுமதி செய்ய ஒரு காப்புப்பிரதியில் நீண்ட நேரம் அழுத்தவும், அல்லது நீக்க இடதுபுறமாக ச்வைப் செய்யவும்.

source: Missing Sources
ta: ஆதாரங்கள் இல்லை

# MISSING_SOURCES_TEXT
source: The restored backup may contain data from the following sources, which are not currently installed:
ta: மீட்டெடுக்கப்பட்ட காப்புப்பிரதியில் பின்வரும் மூலங்களிலிருந்து தரவுகள் இருக்கலாம், அவை தற்போது நிறுவப்படவில்லை:

# RESTORE_BACKUP
source: Restore to this backup?
ta: இந்த காப்புப்பிரதியை மீட்டெடுக்கவா?

# RESTORE_BACKUP_TEXT
source: All current data will be removed and replaced by the data from this backup.
ta: தற்போதைய அனைத்து தரவும் அகற்றப்பட்டு இந்த காப்புப்பிரதியிலிருந்து தரவுகளால் மாற்றப்படும்.

# BACKUP_IMPORT_SUCCESS
source: Backup Imported
ta: காப்புப்பிரதி இறக்குமதி செய்யப்பட்டது

# BACKUP_IMPORT_SUCCESS_TEXT
source: To restore to this backup, find it in the backups page in settings.
ta: இந்த காப்புப்பிரதியை மீட்டெடுக்க, அதை அமைப்புகளில் காப்புப்பிரதிகள் பக்கத்தில் காணலாம்.

# IMPORT_FAIL
source: Import Failed
ta: இறக்குமதி தோல்வியடைந்தது

# BACKUP_IMPORT_FAIL_TEXT
source: Failed to save backup. Please ensure that your backup is in the proper format.
ta: காப்புப்பிரதியைச் சேமிப்பதில் தோல்வி. உங்கள் காப்புப்பிரதி சரியான வடிவத்தில் இருப்பதை உறுதிப்படுத்தவும்.

# SOURCE_IMPORT_FAIL_TEXT
source: Failed to import source. Please ensure that your aix file is valid.
ta: மூலத்தை இறக்குமதி செய்ய முடியவில்லை. உங்கள் aix கோப்பு சரியானது என்பதை உறுதிப்படுத்தவும்.

# FILE_IMPORT_FAIL_TEXT
source: Failed to import file. Please ensure it is a valid CBZ or ZIP archive that contains images.
ta: கோப்பை இறக்குமதி செய்ய முடியவில்லை. படங்களைக் கொண்ட சரியான CBZ அல்லது ZIP காப்பகம் என்பதை உறுதிப்படுத்தவும்.

source: Backup %@
ta: காப்புப்பிரதி %@

source: Export
ta: ஏற்றுமதி

source: Restore
ta: மீட்டெடு

source: Create Backup
ta: காப்புப்பிரதியை உருவாக்கவும்

source: Library Entries
ta: நூலகப் பதிவுகள்

source: Sensitive Settings
ta: உணர்திறன் அமைப்புகள்

source: Name
ta: பெயர்

source: Date
ta: திகதி

# BACKUP_INFO_TITLE
source: Backup Info
ta: காப்பு செய்தி

source: Automatic Backups
ta: தானியங்கி காப்புப்பிரதிகள்

source: Backup Interval
ta: காப்பு இடைவெளி

source: Auto
ta: தானி

# LAST_BACKED_UP_%@
source: Last automatically backed up: %@
ta: கடைசியாக தானாக காப்புப் பிரதி எடுக்கப்பட்டது: %@

source: Reading Sessions
ta: வாசிப்பு அமர்வுகள்

source: Logs
ta: பதிவுகள்

source: Logging
ta: பதிவு

source: Log Server
ta: பதிவு சேவையகம்

source: Export Logs
ta: ஏற்றுமதி பதிவுகள்

source: Display Logs
ta: பதிவுகள் காட்சி

source: Advanced
ta: மேம்பட்ட

# RESET_TEXT
source: This action is irreversible. All data, settings, and caches will be cleared and reset.
ta: இந்த நடவடிக்கை மாற்ற முடியாதது. அனைத்து தரவு, அமைப்புகள் மற்றும் தற்காலிக சேமிப்புகள் அழிக்கப்பட்டு மீட்டமைக்கப்படும்.

source: Clear Network Cache
ta: பிணையம் கேச் அழி

# CLEAR_NETWORK_CACHE_TEXT
source: This action is irreversible. Cached network requests and images will be cleared.
ta: இந்த நடவடிக்கை மாற்ற முடியாதது. தற்காலிக சேமிப்பு பிணையம் கோரிக்கைகள் மற்றும் படங்கள் அழிக்கப்படும்.

source: Clear Read History
ta: தெளிவான வாசிப்பு வரலாறு

# CLEAR_READ_HISTORY_TEXT
source: This action is irreversible. All read history will be removed.
ta: இந்த நடவடிக்கை மாற்ற முடியாதது. அனைத்து வாசிப்பு வரலாறும் அகற்றப்படும்.

# CLEAR_EXCLUDING_LIBRARY
source: Clear Read History Excluding Library
ta: நூலகத்தைத் தவிர்த்து தெளிவான வாசிப்பு வரலாறு

# CLEAR_EXCLUDING_LIBRARY_TEXT
source: This action is irreversible. All read history excluding the library will be removed.
ta: இந்த நடவடிக்கை மாற்ற முடியாதது. நூலகத்தைத் தவிர்த்து அனைத்து வாசிப்பு வரலாற்றும் அகற்றப்படும்.

source: Reset Settings
ta: அமைப்புகளை மீட்டமை

# RESET_SETTINGS_TEXT
source: This action is irreversible. All app and source settings will be reset.
ta: இந்த நடவடிக்கை மாற்ற முடியாதது. அனைத்து பயன்பாடு மற்றும் மூல அமைப்புகள் மீட்டமைக்கப்படும்.

source: Clear Source Cache
ta: ஆதார தற்காலிக சேமிப்பை அழிக்கவும்

# CLEAR_SOURCE_CACHE_TEXT
source: Cached network data for the source url(s) will be cleared. This may result in temporarily increased loading times.
ta: மூல url(கள்)க்கான தற்காலிகச் சேமிப்பு பிணையம் தரவு அழிக்கப்படும். இது தற்காலிகமாக ஏற்றுதல் நேரங்களை அதிகரிக்கலாம்.

# PAGE_X_OF_X
source: Page %i of %i
ta: பக்கம் %i இன் %i

# LIBRARY_LOCKED
source: Library is locked.
ta: நூலகம் பூட்டப்பட்டுள்ளது.

# CATEGORY_LOCKED
source: Category is locked.
ta: வகை பூட்டப்பட்டுள்ளது.

source: View Library
ta: நூலகத்தைக் காண்க

source: Category Empty
ta: வகை காலியாக உள்ளது

# AUTH_TO_OPEN
source: Authenticate to open.
ta: திறக்க ஏற்பு.

source: Locked Categories
ta: பூட்டப்பட்ட பிரிவுகள்

# AUTH_FOR_LIBRARY
source: Authenticate to view library.
ta: நூலகத்தைக் காண ஏற்பு.

source: Lock Library
ta: பூட்டு நூலகம்

source: Set as Wide Page
ta: பரந்த பக்கமாக அமைக்கவும்

source: Automatic
ta: தானியங்கி

source: Set as Normal Page
ta: சாதாரண பக்கமாக அமைக்கவும்

source: Pages to Preload
ta: முன் ஏற்றுவதற்கான பக்கங்கள்

source: Single Page
ta: ஒற்றை பக்கம்

source: Paged
ta: பேச்

source: Page Layout
ta: பக்க தளவமைப்பு

source: Double Page
ta: இரட்டை பக்கம்

# ISOLATE_FIRST_PAGE
source: Always Isolate First Page
ta: முதல் பக்கத்தை எப்போதும் தனிமைப்படுத்தவும்

source: Split Wide Images
ta: பரந்த படங்களைப் பிரிக்கவும்

source: Reverse Split Order
ta: தலைகீழ் பிளவு வரிசை

source: Multi-Language
ta: பல மொழி

source: Tracking
ta: கண்காணிப்பு

source: Trackers
ta: கண்காணிகள்

source: Status
ta: நிலை

source: Volumes
ta: தொகுதிகள்

source: Start Tracking
ta: கண்காணிக்கத் தொடங்கு

source: Score
ta: கெலிப்பெண்

# TRACK_READING
source: Reading
ta: படித்தல்

# TRACK_PLANNING
source: Planning
ta: திட்டமிடல்

# TRACK_COMPLETED
source: Completed
ta: முடிந்தது

# TRACK_PAUSED
source: Paused
ta: இடைநிறுத்தப்பட்டது

# TRACK_DROPPED
source: Dropped
ta: கைவிடப்பட்டது

# TRACK_REREADING
source: Rereading
ta: மீண்டும் படிக்க

source: Started
ta: தொடங்கியது

source: Finished
ta: முடிந்தது

source: Stop Tracking
ta: கண்காணிப்பதை நிறுத்துங்கள்

source: Title Display Mode
ta: தலைப்பு காட்சி முறை

source: Not Published
ta: வெளியிடப்படவில்லை

source: Manga
ta: மங்கா

source: Manhwa
ta: மன்அ்வா

source: Manhua
ta: மன்உவா

source: Light Novel
ta: ஒளி நாவல்

source: One-shot
ta: ஒரு காட்சி

source: OEL
ta: எண்ணெய்

source: Comic
ta: நகைச்சுவை

source: Book
ta: நூல்

source: Track
ta: மின்தடம்

# STATUS_COLON_%@
source: Status: %@
ta: நிலை: %@

# TYPE_COLON_%@
source: Type: %@
ta: வகை: %@

source: View On Website
ta: இணையதளத்தில் காண்க

source: Clear Tracked Manga
ta: தெளிவான கண்காணிக்கப்பட்ட மங்கா

# CLEAR_TRACKED_MANGA_TEXT
source: This action is irreversible. Tracking for all trackers added to manga will be removed.
ta: இந்த நடவடிக்கை மாற்ற முடியாதது. மங்காவுக்கு சேர்க்கப்பட்ட அனைத்து கண்காணிப்புகளுக்கும் கண்காணிப்பு அகற்றப்படும்.

source: Search Options
ta: தேடல் விருப்பங்கள்

source: Show NSFW Results
ta: NSFW முடிவுகளைக் காட்டு

source: Update After Reading
ta: படித்த பிறகு புதுப்பிக்கவும்

# UPDATE_AFTER_READING_INFO
source: After reading a chapter, update the tracker to match the currently read chapter and/or volume.
ta: ஒரு அத்தியாயத்தைப் படித்த பிறகு, தற்போது படிக்கப்பட்ட அத்தியாயம் மற்றும்/அல்லது ஒலியளவுக்கு பொருந்துமாறு டிராக்கரைப் புதுப்பிக்கவும்.

# AUTO_SYNC_HISTORY
source: Automatically Sync History
ta: வரலாற்றை தானாக ஒத்திசைக்கவும்

# AUTO_SYNC_HISTORY_INFO
source: When a newer chapter and/or volume is detected on the tracker, update the local history to match.
ta: டிராக்கரில் புதிய அத்தியாயம் மற்றும்/அல்லது ஒலியளவு கண்டறியப்பட்டால், உள்ளக வரலாற்றைப் பொருத்திப் புதுப்பிக்கவும்.

source: Cache size: %@
ta: கேச் அளவு: %@

source: Support via Ko-Fi
ta: கோ-ஃபை வழியாக உதவி

source: Unread Chapters
ta: படிக்காத அத்தியாயங்கள்

source: Set as Single Page
ta: ஒற்றைப் பக்கமாக அமைக்கவும்

source: Reload
ta: ஏற்றவும்

source: Reload Failed
ta: மீண்டும் ஏற்ற முடியவில்லை

# RELOAD_FAILED_TEXT
source: Failed to reload the image. Please try again.
ta: படத்தை மீண்டும் ஏற்ற முடியவில்லை. மீண்டும் முயற்சிக்கவும்.

source: %i of %i
ta: %i இன் %i

source: %i pages left
ta: %நான் பக்கங்கள் எஞ்சியிருக்கிறேன்

# ONE_PAGE_LEFT
source: 1 page left
ta: 1 பக்கம் மீதமுள்ளது

# FAILED_CHAPTER_LOAD
source: Failed to Load Chapter
ta: அத்தியாயத்தை ஏற்றுவதில் தோல்வி

source: Last Updated
ta: கடைசியாக புதுப்பிக்கப்பட்டது

source: Total Chapters
ta: மொத்த அத்தியாயங்கள்

# FAILED_CHAPTER_LOAD_INFO
source: You might be offline or the source may be having issues.
ta: நீங்கள் ஆஃப்லைனில் இருக்கலாம் அல்லது மூலத்தில் சிக்கல்கள் இருக்கலாம்.

source: Webtoon
ta: வெப்டூன்

source: Remove from Category
ta: வகையிலிருந்து அகற்று

source: Pinned
ta: பின்

source: %i Chapters
ta: %நான் அத்தியாயங்கள்

source: 1 Chapter
ta: 1 அத்தியாயம்

source: Upcoming
ta: வரவிருக்கும்

source: Select
ta: தேர்ந்தெடு

source: Add
ta: கூட்டு

source: Add to Category
ta: வகையைச் சேர்க்கவும்

source: Add to Categories
ta: வகைகளில் சேர்க்கவும்

# RENAME_CATEGORY_INFO
source: Enter a new name for this category.
ta: இந்த வகைக்கு புதிய பெயரை உள்ளிடவும்.

# RENAME_CATEGORY_FAIL
source: Failed to Rename Category
ta: வகையை மறுபெயரிடுவதில் தோல்வி

source: Skip Duplicate Chapters
ta: நகல் அத்தியாயங்களைத் தவிர்க்கவும்

# MARK_DUPLICATE_CHAPTERS
source: Mark Duplicate Chapters as Read
ta: படித்தபடி நகல் அத்தியாயங்களைக் குறிக்கவும்

source: Rename Category
ta: வகை மறுபெயரிடுதல்

# RENAME_CATEGORY_FAIL_INFO
source: Category names must be unique.
ta: வகை பெயர்கள் தனித்துவமாக இருக்க வேண்டும்.

source: Category Name
ta: வகை பெயர்

source: Migrate Sources
ta: ஆதாரங்கள்

source: Start Matching
ta: பொருத்தத் தொடங்குங்கள்

source: Sync Local History
ta: உள்ளக வரலாற்றை ஒத்திசைக்கவும்

source: Migrate
ta: இடம்பெயர்வு

source: Migration
ta: குடிபெயர்வு

source: Options
ta: விருப்பங்கள்

source: Titles
ta: தலைப்புகள்

source: Destination
ta: இலக்கு

source: Selected
ta: தேர்ந்தெடுக்கப்பட்டது

source: Available
ta: கிடைக்கிறது

source: Not Found
ta: கண்டுபிடிக்கப்படவில்லை

source: Most Chapters (slower)
ta: பெரும்பாலான அத்தியாயங்கள் (மெதுவாக)

source: First Alternative
ta: முதல் மாற்று

source: Migrate %i items?
ta: %i உருப்படிகளை இடம்பெயர?

# MIGRATE_ONE_ITEM?
source: Migrate 1 item?
ta: 1 உருப்படியை இடம்பெயர?

source: Source Breaking Change
ta: மூலத்தை உடைக்கும் மாற்றம்

# SOURCE_BREAKING_CHANGE_TEXT
source: This source had a breaking change and requires migration to keep your library and history.
ta: இந்த சான்று ஒரு பெரிய மாற்றத்தைக் கொண்டுள்ளது மற்றும் உங்கள் நூலகத்தையும் வரலாற்றையும் வைத்திருக்க இடம்பெயர்வு தேவைப்படுகிறது.

source: Upload Date
ta: பதிவேற்ற தேதி

source: All Chapters Read
ta: எல்லா அத்தியாயங்களும் படித்தன

source: All Chapters Locked
ta: அனைத்து அத்தியாயங்களும் பூட்டப்பட்டுள்ளன

source: Default Reading Mode
ta: இயல்புநிலை வாசிப்பு முறை

source: Pillarbox
ta: தூண் பெட்டி

source: Pillarbox Amount
ta: தூண் பெட்டி தொகை

source: Pillarbox Orientation
ta: தூண் பெட்டி நோக்குநிலை

# PILLARBOX_ORIENTATION_INFO
source: Pillarbox Orientation determines which orientations pillarboxing should be enabled for.
ta: எந்த நோக்குநிலைகளுக்கு தூண்களுக்கோலை இயக்க வேண்டும் என்பதை தூண் பெட்டி நோக்குநிலை தீர்மானிக்கிறது.

source: Both
ta: இரண்டும்

# %@_TRACKER_LOGIN_NEEDED
source: %@ Login Needed
ta: %@ உள்நுழைவு தேவை

# %@_TRACKER_LOGIN_NEEDED_TEXT
source: Your %@ token has expired, so the associated tracker will stop working until you re-login in settings.
ta: உங்கள் %@ கிள்ளாக்கு காலாவதியானது, எனவே நீங்கள் அமைப்புகளில் மீண்டும் உள்நுழையும் வரை தொடர்புடைய டிராக்கர் வேலை செய்வதை நிறுத்தும்.

# BACKUP_ERROR
source: Backup Restore Error
ta: காப்புப்பிரதி மீட்டமை பிழை

# BACKUP_ERROR_TEXT
source: An error was encountering while restoring: %@. The backup may be invalid.
ta: மீட்டெடுக்கும் போது பிழை ஏற்பட்டது: %@. காப்புப்பிரதி தவறானது.

# READER_ORIENTATION
source: Orientation
ta: நோக்குநிலை

source: Follow Device
ta: சாதனத்தைப் பின்தொடரவும்

# FOCUS_ITEM_LEFT
source: Focus item to the left
ta: உருப்படியை இடதுபுறமாக மையப்படுத்தவும்

# FOCUS_ITEM_RIGHT
source: Focus item to the right
ta: உருப்படியை வலதுபுறமாக மையப்படுத்தவும்

source: Focus item above
ta: மேலே உள்ள பொருளை மையப்படுத்தவும்

source: Focus item below
ta: கீழே உள்ள பொருளை மையப்படுத்தவும்

# FOCUS_ITEM_NEXT
source: Focus next item
ta: அடுத்த உருப்படியில் கவனம் செலுத்துங்கள்

# FOCUS_ITEM_PREV
source: Focus previous item
ta: முந்தைய உருப்படியை மையப்படுத்தவும்

# OPEN_FOCUS_ITEM
source: Open focused item
ta: கவனம் செலுத்திய உருப்படியைத் திறக்கவும்

source: Reset focus
ta: கவனத்தை மீட்டமைக்கவும்

source: Turn page left
ta: பக்கத்தை இடதுபுறம் திருப்பவும்

source: Turn page right
ta: பக்கத்தை வலது பக்கம் திருப்பவும்

source: Chapter forward
ta: அத்தியாயம் முன்னோக்கி

source: Chapter backward
ta: அத்தியாயம் பின்னோக்கி

source: Open chapter list
ta: அத்தியாயங்களின் பட்டியலைத் திறக்கவும்

# TOGGLE_BARS
source: Toggle bar visibility
ta: பார் தெரிவுநிலையை நிலைமாற்று

source: Close reader
ta: நெருக்கமான வாசகர்
