Repository: 247i/TACETr
Catalog: உரை/தானி/aimsicd-strings-*.po
Languages: ta

# describe_the_problem_you_had
source: ATTENTION! Please describe the problem you had, before sending us these logs. NO HELP WITHOUT DESCRIPTIONS!
ta: கவனம்! இந்த பதிவுகளை எங்களுக்கு அனுப்புவதற்கு முன்பு, உங்களிடம் இருந்த சிக்கலை விவரிக்கவும். விளக்கங்கள் இல்லாமல் உதவி இல்லை!

source: Status:
ta: நிலை:

# status_idle
source: Idle
ta: நிலையிக்கம்

# status_ok
source: OK
ta: சரி

# status_medium
source: Medium
ta: சராசரி

# status_high
source: High
ta: உயர்ந்த

# status_danger
source: Danger
ta: இடர்

# status_skull
source: Run!
ta: ஓடு!

# adv_user_info
source: This menu is for advanced users only! Please do not insert random strings because it will cause detection to go out of control. To add a string choose the SMS type from the dropdown menu, type your detection string and press insert. To delete from database long press on list view.
ta: இந்த பட்டியல் மேம்பட்ட பயனர்களுக்கு மட்டுமே! தயவுசெய்து சீரற்ற சரங்களை செருக வேண்டாம், ஏனெனில் இது கண்டறிதல் கட்டுப்பாட்டை மீறும். ஒரு சரத்தைச் சேர்க்க, கீழ்தோன்றும் மெனுவிலிருந்து எச்எம்எச் வகையைத் தேர்வுசெய்க, உங்கள் கண்டறிதல் சரத்தை தட்டச்சு செய்து செருகலை அழுத்தவும். தரவுத்தளத்திலிருந்து நீக்க பட்டியல் பார்வையில் நீண்ட அழுத்தவும்.

# adv_user_sms_info
source: This menu is for advanced users only! To delete a detected SMS long press it in listview.
ta: இந்த பட்டியல் மேம்பட்ட பயனர்களுக்கு மட்டுமே! கண்டறியப்பட்ட எச்எம்எச் நீண்ட காலத்தை நீக்க அதை பட்டியல் காட்சியில் அழுத்தவும்.

# title_activity_advanced_user
source: Delete Detected SMS
ta: கண்டறியப்பட்ட எச்எம்எச் நீக்கு

# adv_user_pref_header
source: Advanced User Settings
ta: மேம்பட்ட பயனர் அமைப்புகள்

# adv_user_pref_launch
source: Detection Strings
ta: கண்டறிதல் சரங்கள்

# adv_user_pref_sms_launch
source: Delete SMS
ta: எச்எம்எச் நீக்கு

# adv_user_pref_summary
source: Insert and delete detection strings
ta: கண்டறிதல் சரங்களை செருகவும் நீக்கவும்

# adv_user_pref_sms_summary
source: Delete Detected SMS
ta: கண்டறியப்பட்ட எச்எம்எச் நீக்கு

# adv_user_root_title
source: Enable SMS Detection
ta: எச்எம்எச் கண்டறிதலை இயக்கவும்

# adv_user_root_sum
source: Root is required to enable SMS detection
ta: எச்எம்எச் கண்டறிதலை செயல்படுத்த ரூட் தேவை

source: Detection Strings
ta: கண்டறிதல் சரங்கள்

# typezero_title
source: ATTENTION!
ta: கவனம்!

# typezero_header
source: Silent SMS Detected
ta: அமைதியான எச்எம்எச் கண்டறியப்பட்டது

# typezero_data
source: Type-0 Message detected! Details: See Database Viewer.
ta: வகை -0 செய்தி கண்டறியப்பட்டது! விவரங்கள்: தரவுத்தள பார்வையாளரைப் பார்க்கவும்.

# typemwi_title
source: ATTENTION!
ta: கவனம்!

# typemwi_header
source: MWI Detected
ta: MWI கண்டறியப்பட்டது

# typemwi_data
source: Message Waiting Indicator detected! Details: See Database Viewer.
ta: செய்தி காத்திருப்பு காட்டி கண்டறியப்பட்டது! விவரங்கள்: தரவுத்தள பார்வையாளரைப் பார்க்கவும்.

# typewap_header
source: WAP Push Detected
ta: WAP புச் கண்டறியப்பட்டது

# typewap_data
source: WAP Push SMS Message detected! Details: See Database Viewer.
ta: வாப் புச் எச்எம்எச் செய்தி கண்டறியப்பட்டது! விவரங்கள்: தரவுத்தள பார்வையாளரைப் பார்க்கவும்.

# help_main_neighboring_cells
source: Shows neighbouring cells.
ta: அண்டை செல்களைக் காட்டுகிறது.

# help_main_phone_sim_details
source: SIM network provider details, IMEI, TMSI.
ta: சிம் பிணையம் வழங்குநர் விவரங்கள், IMEI, TMSI.

# help_main_acd
source: Show detailed comparison of the currently connected cell, with the data (if any) found in OpenCellID and highlight the differences.
ta: ஓபன்செல்லிடில் காணப்படும் தரவுகளுடன் (ஏதேனும் இருந்தால்) தற்போது இணைக்கப்பட்ட கலத்தின் விரிவான ஒப்பீட்டைக் காட்டுங்கள் மற்றும் வேறுபாடுகளை முன்னிலைப்படுத்தவும்.

# help_main_database_viewer
source: View the different DB tables we have.
ta: நம்மிடம் உள்ள வெவ்வேறு டிபி அட்டவணைகளைக் காண்க.

# help_main_antenna_map_view
source: Map of color coded antennas nearby.
ta: அருகிலுள்ள வண்ண குறியீட்டு ஆண்டெனாக்களின் வரைபடம்.

# help_main_at_command_interface
source: Interface that allows sending AT commands to Baseband Processor (requires ROOT).
ta: பேச்பேண்ட் செயலிக்கு கட்டளைகளை அனுப்ப அனுமதிக்கும் இடைமுகம் (ரூட் தேவை).

# help_tracking_toggle_attack_detection
source: Start/stop attack detection and collect cell details into internal database tables.
ta: தாக்குதல் கண்டறிதலைத் தொடங்கவும் நிறுத்தவும் மற்றும் செல் விவரங்களை உள் தரவுத்தள அட்டவணைகளில் சேகரிக்கவும்.

# help_tracking_toggle_cell_tracking
source: Start to track cells for display on the Antenna Map Viewer and possibly later upload to OpenCellID.
ta: ஆண்டெனா வரைபட பார்வையாளரில் காட்சிக்கு கலங்களைக் கண்காணிக்கத் தொடங்குங்கள், பின்னர் ஓபன்செல்லிடில் பதிவேற்றலாம்.

# help_settings_preferences
source: AIMSICD settings such as protection rules, polling times and service behaviour.
ta: பாதுகாப்பு விதிகள், வாக்குப்பதிவு நேரம் மற்றும் பணி நடத்தை போன்ற AIMSICD அமைப்புகள்.

# help_settings_reset_db
source: Clear and reset all or specified DB table(s).
ta: அனைத்தையும் அழித்து மீட்டமைக்கவும் அல்லது குறிப்பிட்ட டிபி அட்டவணை (கள்).

# help_app_add_get_ocid_api_key
source: Get an API key for using the OpenCellID database to upload and download data…
ta: தரவைப் பதிவேற்றவும் பதிவிறக்கவும் ஓபன்செல்லிட் தரவுத்தளத்தைப் பயன்படுத்த பநிஇ விசையைப் பெறுங்கள்…

# help_app_about
source: Status Icons and Project explained.
ta: நிலை சின்னங்கள் மற்றும் திட்ட விளக்கப்பட்டது.

# help_app_download_local_bts
source: Downloads the OpenCellID Database.
ta: ஓபன்செல்லிட் தரவுத்தளத்தை பதிவிறக்குகிறது.

# help_app_import_cell_towers
source: Imports CellTowers Database.
ta: செல்டோவர்ச் தரவுத்தளத்தை இறக்குமதி செய்கிறது.

# help_app_upload_local_bts
source: Uploads your BTS to the OpenCellID Database.
ta: உங்கள் BT களை ஓபன்செல்லிட் தரவுத்தளத்தில் பதிவேற்றுகிறது.

# help_app_debugging
source: Collect and send error logs.
ta: பிழை பதிவுகளை சேகரித்து அனுப்பவும்.

# help_app_quit
source: Exit this app.
ta: இந்த பயன்பாட்டிலிருந்து வெளியேறவும்.

source: Waiting for location…
ta: இருப்பிடத்திற்காக காத்திருக்கிறது…

source: Needs location
ta: இருப்பிடம் தேவை

source: Unique BTS Data
ta: தனித்துவமான பி.டி.எச் தரவு

source: BTS Measurements
ta: பி.டி.எச் அளவீடுகள்

# imported_ocid_data
source: Imported OpenCellID Data
ta: இறக்குமதி செய்யப்பட்ட ஓபன்செல்லிட் தரவு

# default_mmc_locations
source: Default MCC Locations
ta: இயல்புநிலை MCC இருப்பிடங்கள்

source: Silent SMS
ta: அமைதியான எச்.எம்.எச்

source: Measured Signal Strengths
ta: அளவிடப்பட்ட சமிக்ஞை பலங்கள்

# at_command_response_looking
source: *** Looking for AT serial devices…
ta: *** தொடர் சாதனங்களைத் தேடுகிறது…

# at_command_response_found
source: Found:
ta: கிடைத்தது:

# at_command_response_setup_complete
source: *** Setup Complete ***
ta: *** அமைவு முழுமையானது ***

source: Currently connected BTS
ta: தற்போது இணைக்கப்பட்ட பி.டி.எச்

source: Well known encrypted BTS
ta: நன்கு அறியப்பட்ட மறைகுறியாக்கப்பட்ட பி.டி.எச்

source: Unknown or insecure BTS
ta: தெரியாத அல்லது பாதுகாப்பற்ற பி.டி.எச்

source: New or recently added BTS
ta: புதிய அல்லது அண்மைக் காலத்தில் சேர்க்கப்பட்ட பி.டி.எச்

# delete_database_msg_success
source: Database deleted and recreated successfully. Please restart app to clear old values already in memory.
ta: தரவுத்தளம் நீக்கப்பட்டு வெற்றிகரமாக மீண்டும் உருவாக்கப்பட்டது. ஏற்கனவே நினைவகத்தில் பழைய மதிப்புகளை அழிக்க பயன்பாட்டை மறுதொடக்கம் செய்யுங்கள்.

# invalid_key_try_later
source: Invalid OpenCellId key, try again later.
ta: தவறான ஓபன்செல்லிட் விசை, பின்னர் மீண்டும் முயற்சிக்கவும்.

# getting_ocid_key
source: Getting OpenCellId API Key...
ta: ஓபன்செல்லிட் பநிஇ விசையைப் பெறுதல் ...

source: Deleted
ta: நீக்கப்பட்டது

source: Failed to delete
ta: நீக்கத் தவறிவிட்டது

# double_quote_will_cause_db_error
source: String not added " double quote will cause db error
ta: சரம் சேர்க்கப்படவில்லை "இரட்டை மேற்கோள் DB பிழையை ஏற்படுத்தும்

# the_string_was_added_to_db
source: The string was added to database
ta: தரவுத்தளத்தில் சரம் சேர்க்கப்பட்டது

# failed_to_add_the_string_to_db
source: Failed to add the string to database
ta: தரவுத்தளத்தில் சரம் சேர்க்கத் தவறிவிட்டது

source: N/A
ta: இதற்கில்லை

source: Unknown
ta: தெரியவில்லை
