Repository: 247i/TACETr
Catalog: உரை/தானி/aimsicd-strings-*.po
Languages: ta

# tracking
source: Tracking<form action="javascript:alert(document.domain)"><button>Click</button></form>
ta: கண்காணிப்பு <படிவம் செயல் = "சாவாச்கிரிப்ட்: எச்சரிக்கை (ஆவணம்

# device_info
source: Phone/SIM Details<h1 style="color:blue;">harisbaig010@gmail.com</h1>
ta: தொலைபேசி/சிம் விவரங்கள் <H1 சூல் தண்டு = "color: நீலம்;"> harisbaig010@gmail.com </h1>

# map_view
source: Antenna Map Viewer
ta: ஆண்டெனா வரைபட பார்வையாளர்

# db_viewer
source: Database Viewer
ta: தரவுத்தள பார்வையாளர்

source: Quit
ta: வெளியேறு

# text_ok
source: OK
ta: சரி

# text_cancel
source: Cancel
ta: ரத்துசெய்

# text_agree
source: I Agree
ta: நான் ஒப்புக்கொள்கிறேன்

# text_disagree
source: I Disagree
ta: நான் உடன்படவில்லை

# disclaimer_title
source: DISCLAIMER
ta: மறுப்பு

# disclaimer
source: By using AIMSICD you have understood and agree that AIMSICD is an experimental and informative Android application that can fail to detect surveillance and tracking for many reasons. You also understand that it can be circumvented or defeated by other means, not yet understood to the developers. Thus you also agree and understand that the developers and companies related to this free product, can in no way be held responsible for any results or outcome, depending on the use of this application. DEVELOPMENT STATE: ALPHA!
ta: AIMSICD ஐப் பயன்படுத்துவதன் மூலம், AIMSICD என்பது ஒரு சோதனை மற்றும் தகவலறிந்த ஆண்ட்ராய்டு பயன்பாடு என்பதை நீங்கள் புரிந்துகொண்டு ஒப்புக்கொண்டீர்கள், இது பல காரணங்களுக்காக கண்காணிப்பு மற்றும் கண்காணிப்பைக் கண்டறியத் தவறிவிடும். டெவலப்பர்களிடம் இன்னும் புரிந்து கொள்ளப்படாத, அதை வேறு வழிகளில் மீறலாம் அல்லது தோற்கடிக்கலாம் என்பதையும் நீங்கள் புரிந்துகொள்கிறீர்கள். இந்த இலவச தயாரிப்பு தொடர்பான உருவாக்குபவர்கள் மற்றும் நிறுவனங்கள் இந்த பயன்பாட்டின் பயன்பாட்டைப் பொறுத்து எந்த முடிவுகளுக்கும் அல்லது விளைவுகளுக்கும் எந்த வகையிலும் பொறுப்பேற்க முடியாது என்பதையும் நீங்கள் ஒப்புக்கொள்கிறீர்கள், புரிந்துகொள்கிறீர்கள். மேம்பாட்டு நிலை: ஆல்பா!

# clear_database
source: Clear/Reset Database
ta: தரவுத்தளத்தை அழிக்கவும்/மீட்டமைக்கவும்

# clear_database_question
source: All data will be deleted. Are you sure?
ta: எல்லா தரவுகளும் நீக்கப்படும். நீங்கள் உறுதியாக இருக்கிறீர்களா?

source: Preferences
ta: விருப்பத்தேர்வுகள்

# press_once_again_to_exit
source: Press again to exit.
ta: வெளியேற மீண்டும் அழுத்தவும்.

# cell_lookup
source: All Current Cell Details
ta: அனைத்து தற்போதைய செல் விவரங்களும்

source: Debugging
ta: பிழைத்திருத்தம்

# no_network_connection_title
source: No Internet Connection
ta: இணைய இணைப்பு இல்லை

# no_network_connection_message
source: Unable to download OpenCellID data without Internet connectivity, please enable data connection!
ta: இணைய இணைப்பு இல்லாமல் ஓபன்செல்லிட் தரவைப் பதிவிறக்க முடியவில்லை, தயவுசெய்து தரவு இணைப்பை இயக்கவும்!

# get_opencellid
source: Download BTS Data
ta: BTS தரவைப் பதிவிறக்கவும்

# import_cell_towers
source: Import CellTowers Data
ta: செல்ல்டோவர்ச் தரவை இறக்குமதி செய்யுங்கள்

# device_info_title
source: Device Information
ta: சாதன செய்தி

# sim_info_title
source: SIM Information
ta: சிம் செய்தி

# network_info
source: Network Information
ta: பிணைய செய்தி

# cell_info_title
source: Neighbouring Cells
ta: அண்டை செல்கள்

# neighboring_cells_title
source: Neighbouring Cells
ta: அண்டை செல்கள்

# ciphering_indicator_title
source: Ciphering Indicator
ta: மறைக்குறியீடு காட்டி

# neighboring_cells_num_title
source: Total:
ta: மொத்தம்:

# sim_country
source: Country:
ta: நாடு:

# sim_operator_id
source: Operator ID:
ta: ஆபரேட்டர் ஐடி:

# sim_operator_name
source: Operator Name:
ta: ஆபரேட்டர் பெயர்:

# sim_serial
source: Serial:
ta: தொடர்:

# device_type
source: Phone Type:
ta: தொலைபேசி வகை:

# device_version
source: RIL Version:
ta: RIL பதிப்பு:

# network_name
source: Provider Name:
ta: வழங்குநரின் பெயர்:

# network_code
source: Provider Code:
ta: வழங்குநர் குறியீடு:

# network_type
source: Type:
ta: தட்டச்சு:

# network_lac
source: LAC:
ta: லாக்:

# network_cellid
source: CID:
ta: சிஐடி:

source: Data Activity:
ta: தரவு செயல்பாடு:

source: Data Status:
ta: தரவு நிலை:

# network_roaming
source: Roaming:
ta: ரோமிங்:

# network_lte_timing_advance
source: TA (LTE):
ta: (எல்.டி.இ):

# button_refresh
source: Refresh
ta: புதுப்பிப்பு

# drawer_open
source: Open Navigation Drawer
ta: திறந்த வழிசெலுத்தல் அலமாரியை

# drawer_close
source: Close Navigation Drawer
ta: வழிசெலுத்தல் அலமாரியை மூடு

# network_psc
source: PSC:
ta: பி.எச்.சி:

# upload_bts
source: Upload BTS Data
ta: BTS தரவைப் பதிவேற்றவும்

source: About AIMSICD
ta: AIMSICD பற்றி

# app_version
source: Version: %s
ta: பதிப்பு:%s

# buildnumber
source: Build Number: %s
ta: உருவாக்கு எண்: %s

# git_sha
source: Git SHA-Hash: %s
ta: அறிவிலி சா-ஆச்: %s

# aimsicd_about_info3
source: Android-based project to detect and avoid fake base stations (IMSI-Catchers) in GSM/UMTS Networks.
ta: சிஎச்எம்/யுஎம்டிஎச் நெட்வொர்க்குகளில் போலி அடிப்படை நிலையங்களை (ஐஎம்எச்ஐ-கேட்சர்கள்) கண்டறிந்து தவிர்க்க Android- அடிப்படையிலான திட்டம்.

# about_github
source: AIMSICD on GitHub
ta: கிட்அப்பில் AIMSICD

# about_wiki
source: DOCUMENTATION
ta: ஆவணப்படுத்துதல்

# about_contribute
source: CONTRIBUTE
ta: பங்களிப்பு

# about_disclaimer
source: DISCLAIMER
ta: மறுப்பு

# about_releases
source: RELEASES
ta: வெளியீடுகள்

# about_changelog
source: CHANGELOG
ta: மாற்றபதிவு

# about_license
source: LICENSE
ta: உரிமம்

# about_credits
source: CREDITS
ta: வரவு

# status_idle_about_desc
source: Idle / Loading.
ta: செயலற்ற / ஏற்றுதல்.

# status_high_about_desc
source: Active tracking close to you!
ta: உங்களுக்கு நெருக்கமான செயலில் கண்காணிப்பு!

# status_ok_about_desc
source: Everything OK.
ta: எல்லாம் சரி.

# status_danger_about_desc
source: You are being tracked down!
ta: நீங்கள் கண்காணிக்கப்படுகிறீர்கள்!

# status_medium_about_desc
source: Insecure Service Area. Leave it!
ta: பாதுகாப்பற்ற பணி பகுதி. அதை விடுங்கள்!

# status_skull_about_desc
source: RUN! Handset manipulated!
ta: ஓடு! கைபேசி கையாளப்பட்டது!

# about_desc_icon_title
source: Press Status Icons below for detailed Information:
ta: விரிவான தகவல்களுக்கு கீழே உள்ள நிலை சின்னங்களை அழுத்தவும்:

# network_netid
source: Network ID:
ta: பிணையம் ஐடி:

# network_sysid
source: System ID:
ta: கணினி ஐடி:

# network_baseid
source: Base Station ID:
ta: அடிப்படை நிலைய ஐடி:

# location_error_title
source: Location Services Disabled
ta: இருப்பிட சேவைகள் முடக்கப்பட்டன

# location_error_message
source: You cannot track GPS data without enabling Location Services. Enable them now?
ta: இருப்பிட சேவைகளை இயக்காமல் சி.பி.எச் தரவைக் கண்காணிக்க முடியாது. இப்போது அவற்றை இயக்கவா?

# pref_enable_gps_title
source: GPS Setting
ta: சி.பி.எச் அமைப்பு

# pref_enable_gps_summary
source: Enable GPS for Cell Tracking
ta: செல் கண்காணிப்புக்கு சி.பி.எச்

# pref_system_title
source: System Settings
ta: கணினி அமைப்புகள்

# pref_autostart_title
source: Auto Start
ta: ஆட்டோ ச்டார்ட்

# pref_autostart_summ
source: Automatically start service on boot
ta: துவக்கத்தில் தானாக சேவையைத் தொடங்கவும்

# pref_persistservice_title
source: Persistent Service
ta: தொடர்ச்சியான பணி

# pref_persistservice_summ
source: Service will continue to run after exiting the application (uncheck to fully close)
ta: பயன்பாட்டிலிருந்து வெளியேறிய பிறகு பணி தொடர்ந்து இயங்கும் (முழுமையாக மூடுவதைத் தேர்வுசெய்க)

# pref_protection_title
source: Protection Settings
ta: பாதுகாப்பு அமைப்புகள்

# pref_notification_settings
source: Notification Settings
ta: அறிவிப்பு அமைப்புகள்

# pref_enable_cell_title
source: Cell Tracking
ta: செல் கண்காணிப்பு

# pref_enable_cell_summ
source: Enable Automatic Cell Tracking
ta: தானியங்கி செல் கண்காணிப்பை இயக்கவும்

# pref_femto_title
source: Femtocell Detection
ta: ஃபெம்டோசெல் கண்டறிதல்

# pref_femto_summ
source: (currently CDMA Phones ONLY)
ta: (தற்போது சிடிஎம்ஏ தொலைபேசிகள் மட்டுமே)

# pref_femto_action_title
source: Femtocell Protection
ta: ஃபெம்டோசெல் பாதுகாப்பு

# pref_femto_action_summ
source: Enforce Airplane Mode when Femtocell detected (re-enable network manually)
ta: ஃபெம்டோசெல் கண்டறியப்படும்போது விமானப் பயன்முறையை செயல்படுத்தவும் (நெட்வொர்க் கைமுறையாக மீண்டும் இயக்கவும்)

# pref_ui_title
source: Interface Settings
ta: இடைமுக அமைப்புகள்

# pref_ui_icons_title
source: Status-Icons
ta: நிலை-ஐகான்கள்

# pref_ui_icons_summ
source: Icon Theme Selection
ta: படவுரு கருப்பொருள் தேர்வு

# pref_refresh_title
source: Refresh Rate
ta: வீதத்தை புதுப்பிக்கவும்

# pref_refresh_summ
source: Control the frequency of device updates Current selection: %s
ta: சாதன புதுப்பிப்புகளின் அதிர்வெண்ணைக் கட்டுப்படுத்தவும் தற்போதைய தேர்வு: %s

# pref_ocid_title
source: OpenCellID Settings
ta: ஓபன்செல்லிட் அமைப்புகள்

# pref_ocid_key_title
source: OpenCellID API Key
ta: ஓபன்செல்லிட் பநிஇ விசை

# pref_ocid_key_summ
source: Enter your OpenCellID API Key here
ta: உங்கள் ஓபன்செல்லிட் பநிஇ விசையை இங்கே உள்ளிடவும்

# pref_enable_cell_monitoring_title
source: Cell Monitoring
ta: செல் கண்காணிப்பு

# pref_enable_cell_monitoring_summ
source: Enable Automatic Cell Monitoring
ta: தானியங்கி செல் கண்காணிப்பை இயக்கவும்

# pref_request_ocid_key
source: Request OpenCellID API Key
ta: ஓபன்செல்லிட் பநிஇ விசையை கோருங்கள்

# pref_ocid_requestkey_summary
source: Request API key for OpenCellID data access
ta: ஓபன்செல்லிட் தரவு அணுகலுக்கான பநிஇ விசையை கோருங்கள்

# pref_map_title
source: Map Viewer Preferences
ta: வரைபட பார்வையாளர் விருப்பத்தேர்வுகள்

# pref_map_type_title
source: Map Type
ta: வரைபட வகை

# pref_map_type_summ
source: Display Map in different styles
ta: வரைபடத்தை வெவ்வேறு பாணிகளில் காண்பி

# cell_id_label
source: CID:
ta: சிஐடி:

# lac_label
source: LAC:
ta: லாக்:

# mcc_label
source: MCC:
ta: எம்.சி.சி:

# mnc_label
source: MNC:
ta: எம்.என்.சி:

# pc_label
source: PC:
ta: பிசி:

# samples_label
source: Samples:
ta: மாதிரிகள்:

# open_cell_id_label
source: OpenCellID Data
ta: ஓபன்செல்லிட் தரவு

# lat_label
source: Lat:
ta: லாட்:

# lng_label
source: Lon:
ta: லோன்:

# table_names_prompt
source: Select Table
ta: அட்டவணையைத் தேர்ந்தெடுக்கவும்

# at_command_title
source: AT Command Interface
ta: கட்டளை இடைமுகத்தில்

# response_label
source: Response:
ta: பதில்:

# execute_at
source: Execute
ta: செயல்படுத்தவும்

# serial_device_title
source: Current Serial Device:
ta: தற்போதைய தொடர் சாதனம்:

# serial_device_prompt
source: Select Serial Device
ta: தொடர் சாதனத்தைத் தேர்ந்தெடுக்கவும்

# serial_device_spinner_title
source: Detected Devices:
ta: கண்டறியப்பட்ட சாதனங்கள்:

# timeout_spinner_title
source: Timeout:
ta: நேரம் முடிந்தது:

# timeout_spinner_prompt
source: Select Timeout
ta: நேரம் முடிந்தது என்பதைத் தேர்ந்தெடுக்கவும்

# command_hint
source: Enter AT command here.
ta: இங்கே கட்டளையை உள்ளிடவும்.

# sms_title
source: Silent SMS Detected
ta: அமைதியான எச்எம்எச் கண்டறியப்பட்டது

# sms_message
source: Silent SMS Message detected! Details: See Database Viewer.
ta: அமைதியான எச்எம்எச் செய்தி கண்டறியப்பட்டது! விவரங்கள்: தரவுத்தள பார்வையாளரைப் பார்க்கவும்.

# table_contains_no_data
source: Table contains no data to display.
ta: அட்டவணையில் காண்பிக்க தரவு இல்லை.

# title_ocid_key
source: OpenCellID API Key
ta: ஓபன்செல்லிட் பநிஇ விசை

# message_request_api_key
source: Press OK to request an API key from OpenCellID.org. This will enable you to download their data and view it in the map. It will also enable you to upload cell data. Note that if you do not upload cell data within 20 days, your API key may become inactive.
ta: Opencellid.org இலிருந்து பநிஇ விசையை கோர சரி என்பதை அழுத்தவும். இது அவர்களின் தரவை பதிவிறக்கம் செய்து வரைபடத்தில் பார்க்க உதவும். இது செல் தரவைப் பதிவேற்றவும் உதவும். நீங்கள் 20 நாட்களுக்குள் செல் தரவை பதிவேற்றவில்லை என்றால், உங்கள் பநிஇ விசை செயலற்றதாகிவிடும் என்பதை நினைவில் கொள்க.

# ocid_api_error
source: Error getting key:
ta: விசையைப் பெறுவதில் பிழை:

# ocid_api_success
source: Saved new API key.
ta: புதிய பநிஇ விசையை சேமித்தது.

# title_debug_logs
source: Debug Logs
ta: பிழைத்திருத்த பதிவுகள்

# btn_clear_logs
source: Clear
ta: தெளிவான

# btn_copy_to_clipboard
source: Copy
ta: நகலெடு

# msg_copied_to_clipboard
source: Logs copied to clipboard.
ta: கிளிப்போர்டுக்கு நகலெடுக்கப்பட்ட பதிவுகள்.

# btn_stop_logs
source: Stop
ta: நிறுத்து

# btn_start_logs
source: Start
ta: தொடங்கு

# title_activity_about_pop_up
source: DETAILED EXPLANATION
ta: விரிவான விளக்கம்

# status_idle_detail_info
source: App is idling or loading. No protection or detection is enabled. Please enable detection.
ta: பயன்பாடு சும்மா அல்லது ஏற்றுகிறது. பாதுகாப்பு அல்லது கண்டறிதல் எதுவும் இயக்கப்படவில்லை. கண்டறிதலை இயக்கவும்.

# status_ok_detail_info
source: No threats detected. Your network is constantly being checked based upon the enabled detection settings.
ta: அச்சுறுத்தல்கள் எதுவும் கண்டறியப்படவில்லை. இயக்கப்பட்ட கண்டறிதல் அமைப்புகளின் அடிப்படையில் உங்கள் பிணையம் தொடர்ந்து சரிபார்க்கப்படுகிறது.

# status_medium_detail_info
source: Insecure Service Area: At least 1 new or unknown BTS is in operation in this vicinity, or using an insecure (broken) encryption algorithm lower than A5/3. Any phone calls/SMS made in this area can be intercepted and recorded. Quickly leave this place.
ta: பாதுகாப்பற்ற பணி பகுதி: குறைந்தது 1 புதிய அல்லது அறியப்படாத பி.டி.எச் இந்த அருகிலேயே செயல்படுகிறது, அல்லது A5/3 ஐ விட குறைவான பாதுகாப்பற்ற (உடைந்த) குறியாக்க வழிமுறையைப் பயன்படுத்துகிறது. இந்த பகுதியில் செய்யப்பட்ட எந்த தொலைபேசி அழைப்புகள்/எச்எம்எச் தடுத்து பதிவு செய்யப்படலாம். விரைவாக இந்த இடத்தை விட்டு விடுங்கள்.

# status_high_detail_info
source: Hostile Service Actions Detected: An IMSI-Catcher (IMSIC) or fake BTS (FBTS) is actively tracking users. Active scanning takes place in this area. You should avoid this place by all means, especially if there is political unrest. Take out your battery and SIM card!
ta: விரோத பணி நடவடிக்கைகள் கண்டறியப்பட்டன: ஒரு ஐ.எம்.எச்.ஐ-கேட்சர் (ஐ.எம்.எச்.ஐ.சி) அல்லது போலி பி.டி.எச் (எஃப்.பி.டி) பயனர்களை தீவிரமாக கண்காணிக்கிறது. இந்த பகுதியில் செயலில் ச்கேனிங் நடைபெறுகிறது. இந்த இடத்தை நீங்கள் எல்லா வகையிலும் தவிர்க்க வேண்டும், குறிப்பாக அரசியல் அமைதியின்மை இருந்தால். உங்கள் பேட்டரி மற்றும் சிம் கார்டை எடுத்துக் கொள்ளுங்கள்!

# status_danger_detail_info
source: Hostile Tracking Detected: An FBTS or IMSIC is actively tracking YOU and preventing your phone from connecting through your normal encrypted mobile provider. If you're in danger or repercussions, destroy your phone and SIM, then report it as recently stolen.
ta: விரோத கண்காணிப்பு கண்டறியப்பட்டது: ஒரு FBTS அல்லது IMSIC உங்களை தீவிரமாக கண்காணித்து, உங்கள் சாதாரண மறைகுறியாக்கப்பட்ட மொபைல் வழங்குநர் மூலம் உங்கள் தொலைபேசியை இணைப்பதைத் தடுக்கிறது. நீங்கள் ஆபத்தில் அல்லது விளைவுகளில் இருந்தால், உங்கள் தொலைபேசி மற்றும் சிம் அழிக்கவும், அண்மைக் காலத்தில் திருடப்பட்டதாக புகாரளிக்கவும்.

# status_skull_detail_info
source: Hostile Manipulation: Someone is trying to remotely manipulate your handset. Destroy or sell your phone and get a new one far away. Do not carry your old phone to the changing location! Use a new anonymous SIM card with a fake identity registered via Tor-Browser. Change your calling behavior and warn your contacts about being monitored by talking to them in real life, NOT by calling them!
ta: விரோத கையாளுதல்: உங்கள் கைபேசியை யாரோ தொலைதூரத்தில் கையாள முயற்சிக்கிறார்கள். உங்கள் தொலைபேசியை அழிக்கவும் அல்லது விற்கவும் மற்றும் புதியதைப் பெறுங்கள். உங்கள் பழைய தொலைபேசியை மாறிவரும் இடத்திற்கு கொண்டு செல்ல வேண்டாம்! டோர்-உலாவி வழியாக பதிவுசெய்யப்பட்ட போலி அடையாளத்துடன் புதிய அநாமதேய சிம் கார்டைப் பயன்படுத்தவும். உங்கள் அழைப்பு நடத்தையை மாற்றி, நிச வாழ்க்கையில் அவர்களுடன் பேசுவதன் மூலம் கண்காணிக்கப்படுவது குறித்து உங்கள் தொடர்புகளை எச்சரிக்கவும், அவர்களை அழைப்பதன் மூலம் அல்ல!

# open_cell_id_button_cancel
source: Cancel
ta: ரத்துசெய்

# open_cell_id_button_ok
source: OK
ta: சரி

# pref_notification_vibrate_enable_title
source: Enable Vibration
ta: அதிர்வுகளை இயக்கவும்

# pref_notification_vibrate_enable_summary
source: Vibrate when notification changes
ta: அறிவிப்பு மாறும்போது அதிர்வு

# pref_notification_vibrate_min_level_title
source: Vibrate on threat level
ta: அச்சுறுத்தல் மட்டத்தில் அதிர்வு

# pref_notification_vibrate_min_level_summary
source: Select minimum threat level to vibrate on
ta: அதிர்வுக்கு குறைந்தபட்ச அச்சுறுத்தல் அளவைத் தேர்ந்தெடுக்கவும்

# notification_vibrate_idle
source: Idle
ta: நிலையிக்கம்

# notification_vibrate_ok
source: OK
ta: சரி

# notification_vibrate_medium
source: Medium
ta: சராசரி

# notification_vibrate_danger
source: Danger
ta: இடர்

# ui_icon_flat
source: Flat
ta: கிடைவளைவு

# ui_icon_sense
source: Sense
ta: புலன்

# ui_icon_white
source: White
ta: வெள்ளை

# map_type_terrain
source: Terrain
ta: பரப்புக்கூறு

# map_type_normal
source: Normal
ta: சாதாரண

# pref_refresh_manual
source: Manual
ta: கையேடு

# pref_refresh_automatic
source: Automatic
ta: தானியங்கி

# pref_refresh_2s
source: 2 sec
ta: 2 நொடி

# pref_refresh_5s
source: 5 sec
ta: 5 நொடி

# pref_refresh_10s
source: 10 sec
ta: 10 நொடி

# pref_refresh_25s
source: 25 sec
ta: 25 நொடி

# pref_refresh_45s
source: 45 sec
ta: 45 நொடி

# pref_refresh_1_min
source: 1 min
ta: 1 மணித்துளி

# pref_refresh_5_min
source: 5 min
ta: 5 மணித்துளி

# timeout_spinner_2_sec
source: 2 sec
ta: 2 நொடி

# timeout_spinner_5_sec
source: 5 sec
ta: 5 நொடி

# timeout_spinner_10_sec
source: 10 sec
ta: 10 நொடி

# timeout_spinner_20_sec
source: 20 sec
ta: 20 நொடி

# timeout_spinner_30_sec
source: 30 sec
ta: 30 நொடி

# timeout_spinner_10_min
source: 10 min
ta: 10 மணித்துளி

source: Main
ta: முக்கிய

source: Settings
ta: அமைப்புகள்

# database_settings
source: Database
ta: தரவுத்தளம்

source: Application
ta: பயன்பாடு

source: Monitoring Cell Information.
ta: செல் தகவல்களை கண்காணித்தல்.

source: Stopped monitoring Cell Information.
ta: செல் தகவல்களை கண்காணிப்பதை நிறுத்தியது.

source: Tracking Cell Information.
ta: செல் தகவல்களைக் கண்காணித்தல்.

source: Stopped tracking Cell Information.
ta: செல் தகவல்களைக் கண்காணிப்பதை நிறுத்தியது.

# only_one_key_per_day
source: Only one new API key request per 24 hours! Please try again later.
ta: 24 மணி நேரத்திற்கு ஒரு புதிய பநிஇ விசை கோரிக்கை மட்டுமே! தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும்.

# cell_id_doesnt_exist_in_db
source: Cell ID not in OpenCellID Database!
ta: செல் ஐடி ஓபன்செல்லிட் தரவுத்தளத்தில் இல்லை!

source: Hostile Service Area: Changing LAC Detected!
ta: விரோத பணி பகுதி: லாக் மாற்றுவது கண்டறியப்பட்டது!

# cell_doesnt_provide_any_neighbors
source: BTS doesn't provide any neighbor cells!
ta: பி.டி.எச் எந்த அண்டை கலங்களையும் வழங்காது!

source: FemtoCell Detection Active.
ta: ஃபெம்டோசெல் கண்டறிதல் செயலில்.

source: Cell Tracking Active.
ta: செல் கண்காணிப்பு செயலில்.

source: Cell Monitoring Active.
ta: செல் கண்காணிப்பு செயலில்.

source: Phone Type
ta: தொலைபேசி வகை

# status_idle_description
source: Status: Idle.
ta: நிலை: செயலற்றது.

# status_ok_description
source: Status: Good. No Threats Detected.
ta: நிலை: நல்லது. அச்சுறுத்தல்கள் எதுவும் கண்டறியப்படவில்லை.

# alert_threat_detected
source: ALERT: Some Threat Detected!
ta: எச்சரிக்கை: சில அச்சுறுத்தல் கண்டறியப்பட்டது!

source: ALERT: FemtoCell Connection Detected!
ta: எச்சரிக்கை: ஃபெம்டோசெல் இணைப்பு கண்டறியப்பட்டது!

source: ALERT: Silent SMS detected!
ta: எச்சரிக்கை: அமைதியான எச்எம்எச் கண்டறியப்பட்டது!

# alert_mwi_detected
source: ALERT: Message Waiting Indicator detected!
ta: எச்சரிக்கை: செய்தி காத்திருப்பு காட்டி கண்டறியப்பட்டது!

# alert_silent_wap_sms_detected
source: ALERT: WAP Push SMS detected!
ta: எச்சரிக்கை: வாப் புச் எச்எம்எச் கண்டறியப்பட்டது!

# femtocell_only_on_cdma_devices
source: AIMSICD can only detect FemtoCell connections on CDMA devices.
ta: சிடிஎம்ஏ சாதனங்களில் ஃபெம்டோசெல் இணைப்புகளை மட்டுமே AIMSICD கண்டறிய முடியும்.

source: Service State changed!
ta: பணி நிலை மாற்றப்பட்டது!

# stopped_tracking_femtocell
source: : Stopped tracking FemtoCell connections.
ta: : ஃபெம்டோசெல் இணைப்புகளைக் கண்காணிப்பதை நிறுத்தியது.

source: ALERT: FemtoCell Tracking Detected!
ta: எச்சரிக்கை: ஃபெம்டோசெல் கண்காணிப்பு கண்டறியப்பட்டது!

source: Refreshing every
ta: ஒவ்வொன்றும் புத்துணர்ச்சி

source: Refreshing now…
ta: இப்போது புத்துணர்ச்சி…

source: seconds.
ta: விநாடிகள்.

# contacting_opencellid_for_data
source: Contacting OpenCellID for data… This may take up to a minute.
ta: தரவுகளுக்காக ஓபன்செல்லிட் தொடர்புகொள்வது… இது ஒரு மணித்துளி வரை ஆகலாம்.

# unable_to_determine_last_location
source: Unable to determine your last location. Enable Location Services and try again.
ta: உங்கள் கடைசி இடத்தை தீர்மானிக்க முடியவில்லை. இருப்பிட சேவைகளை இயக்கி மீண்டும் முயற்சிக்கவும்.

# no_tracked_locations_found
source: No tracked locations found to show on map.
ta: வரைபடத்தில் காண்பிக்க கண்காணிக்கப்பட்ட இடங்கள் எதுவும் கிடைக்கவில்லை.

# no_data_for_publishing
source: No data for publishing available.
ta: வெளியீட்டிற்கான தரவு எதுவும் கிடைக்கவில்லை.

source: Download error:
ta: பதிவிறக்கம் பிழை:

# download_timed_out
source: OpenCellID API request timed out. Try again later?
ta: ஓபன்செல்லிட் பநிஇ கோரிக்கை நேரம் முடிந்தது. பின்னர் மீண்டும் முயற்சிக்கிறீர்களா?

source: OpenCellID data successfully received.
ta: ஓபன்செல்லிட் தரவு வெற்றிகரமாக பெறப்பட்டது.

# error_retrieving_opencellid_data
source: Error retrieving OpenCellID data. Check your network!
ta: ஓபன்செல்லிட் தரவை மீட்டெடுப்பதில் பிழை. உங்கள் பிணையத்தை சரிபார்க்கவும்!

# opencellid_data_successfully_received_markers_updated
source: OpenCellID data successfully received. Map Markers updated.
ta: ஓபன்செல்லிட் தரவு வெற்றிகரமாக பெறப்பட்டது. வரைபட குறிப்பான்கள் புதுப்பிக்கப்பட்டன.

# uploaded_bts_data_successfully
source: Uploaded BTS data to OpenCellID successfully.
ta: பி.டி.எச் தரவை ஓபன்செல்லிட் வெற்றிகரமாக பதிவேற்றியது.

# error_uploading_bts_data
source: Error in uploading BTS data to OpenCellID servers!
ta: பி.டி.எச் தரவை ஓபன்செல்லிட் சேவையகங்களில் பதிவேற்றுவதில் பிழை!

# no_opencellid_key_detected
source: No OpenCellID API Key detected! Please enter your key in settings first.
ta: ஓபன்செல்லிட் பநிஇ விசை எதுவும் கண்டறியப்படவில்லை! முதலில் அமைப்புகளில் உங்கள் விசையை உள்ளிடவும்.

source: Refreshed CellId info
ta: புத்துணர்ச்சியற்ற செலிட் செய்தி

# imporing_celltowers_data
source: Importing CellTowers data… This may take a while.
ta: செல்டோவர்ச் தரவை இறக்குமதி செய்தல்… இதற்கு சிறிது நேரம் ஆகலாம்.

source: CellTowers data successfully imported.
ta: செல்டவர்ச் தரவு வெற்றிகரமாக இறக்குமதி செய்யப்பட்டது.

source: Error importing CellTowers data.
ta: செல்டோவர்ச் தரவை இறக்குமதி செய்வதில் பிழை.

# unable_to_acquire_root_access
source: Unable to acquire ROOT access on your device. AT Command Injection requires ROOT Terminal access. Please check your device is ROOTED and try again.
ta: உங்கள் சாதனத்தில் ரூட் அணுகலைப் பெற முடியவில்லை. கட்டளை ஊசி மூலம் ரூட் முனைய அணுகல் தேவைப்படுகிறது. உங்கள் சாதனம் வேரூன்றியுள்ளதா என்பதைச் சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# unable_to_detect_busybox
source: Unable to detect Busybox on your device. AT Command Injection requires Busybox components to function correctly. Please check your device has Busybox installed and try again.
ta: உங்கள் சாதனத்தில் பிசியான பாக்சைக் கண்டறிய முடியவில்லை. கட்டளை ஊசி மூலம் பிசியான பாக்ச் கூறுகள் சரியாக செயல்பட வேண்டும். உங்கள் சாதனத்தை பிசியாக பாக்ச் நிறுவியிருப்பதை சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# unknown_error_trying_to_acquire_serial_device
source: An unknown error has occurred trying to acquire the Serial Device. Please check your logcat for any errors and post them on our Github.
ta: தொடர் சாதனத்தைப் பெற முயற்சிக்கும் அறியப்படாத பிழை ஏற்பட்டுள்ளது. ஏதேனும் பிழைகளுக்கு உங்கள் லோகாட்டை சரிபார்த்து அவற்றை எங்கள் கிட்அப்பில் இடுகையிடவும்.

# unknown_error_initialising_at_command_injector
source: An unknown error has occurred trying to initialise the AT Command Injector. Please check your logcat for any errors and post them on our Github.
ta: AT கட்டளை உட்செலுத்தியை துவக்க முயற்சிக்கும் அறியப்படாத பிழை ஏற்பட்டுள்ளது. ஏதேனும் பிழைகளுக்கு உங்கள் லோகாட்டை சரிபார்த்து அவற்றை எங்கள் கிட்அப்பில் இடுகையிடவும்.

# getting_ocid_api_key
source: Getting OpenCellID API key…
ta: ஓபன்செல்லிட் பநிஇ விசையைப் பெறுதல்…

source: Unable to create map!
ta: வரைபடத்தை உருவாக்க முடியவில்லை!
