Repository: 247i/TACETr
Catalog: உரை/தானி/andors-trail-user-interface-*.po
Languages: ta

# questlog_queststatus
source: Status: %1$s
ta: நிலை: %1 $ s

# questlog_queststatus_inprogress
source: In progress
ta: முன்னேற்றத்தில் உள்ளது

# questlog_queststatus_completed
source: Completed
ta: முடிந்தது

# preferences_display_category
source: Display
ta: காட்சி

# preferences_display_fullscreen_title
source: Fullscreen
ta: முழு திரை

# preferences_display_fullscreen
source: Displays the game in fullscreen mode. (Requires restart)
ta: முழு அளவிலான பயன்முறையில் விளையாட்டைக் காட்டுகிறது. (மறுதொடக்கம் தேவை)

# preferences_dialog_category
source: Dialog confirmation
ta: உரையாடல் உறுதிப்படுத்தல்

# preferences_dialog_confirmrest_title
source: Confirm rest
ta: ஓய்வு உறுதிப்படுத்தவும்

# preferences_dialog_confirmrest
source: Gives a question about whether you want to rest when entering a bed. Otherwise, you will always automatically rest.
ta: ஒரு படுக்கைக்குள் நுழையும்போது நீங்கள் ஓய்வெடுக்க விரும்புகிறீர்களா என்பது பற்றி ஒரு கேள்வி அளிக்கிறது. இல்லையெனில், நீங்கள் எப்போதும் தானாகவே ஓய்வெடுப்பீர்கள்.

# preferences_dialog_confirmattack_title
source: Confirm attack
ta: தாக்குதலை உறுதிப்படுத்தவும்

# preferences_dialog_confirmattack
source: Enables the 'Do you want to attack..?' dialog box when attacking a monster.
ta: 'நீங்கள் தாக்க விரும்புகிறீர்களா ..?' ஒரு அரக்கனைத் தாக்கும் போது உரையாடல் பெட்டி.

# preferences_dialog_monsterloot_title
source: Display monster loot
ta: அரக்கன் கொள்ளை காட்சி

# preferences_dialog_monsterloot
source: Choose how you want to show the results of a fight to be shown (gold, experience, items).
ta: காட்டப்பட வேண்டிய சண்டையின் முடிவுகளை நீங்கள் எவ்வாறு காட்ட விரும்புகிறீர்கள் என்பதைத் தேர்வுசெய்க (தங்கம், பட்டறிவு, பொருட்கள்).

# preferences_combat_category
source: Combat
ta: போர்

# preferences_combat_speed_title
source: Combat speed
ta: போர் விரைவு

# preferences_combat_speed
source: Determines how fast monsters attack.
ta: அரக்கர்கள் எவ்வளவு விரைவாக தாக்குகிறார்கள் என்பதை தீர்மானிக்கிறது.

# preferences_display_loot_dialog
source: Always show loot dialog box
ta: எப்போதும் கொள்ளை உரையாடல் பெட்டியைக் காட்டு

# preferences_display_loot_dialog_on_items
source: Show loot dialog box when finding items
ta: உருப்படிகளைக் கண்டறியும்போது கொள்ளை உரையாடல் பெட்டியைக் காட்டு

# preferences_display_loot_dialog_on_items_or_toast
source: Dialog for items, notif. otherwise
ta: உருப்படிகளுக்கான உரையாடல், அறிவிப்பு. இல்லையெனில்

# preferences_display_loot_toast
source: Show short notification
ta: குறுகிய அறிவிப்பைக் காட்டு

# preferences_display_loot_toast_on_items
source: Show notification only when finding items
ta: உருப்படிகளைக் கண்டறியும்போது மட்டுமே அறிவிப்பைக் காட்டுங்கள்

# preferences_display_loot_never
source: Do not display
ta: காட்ட வேண்டாம்

# preferences_attackspeed_instant
source: Instant (no animations)
ta: உடனடி (அனிமேசன்கள் இல்லை)

# preferences_attackspeed_fast
source: Fast
ta: வேகமாக

# preferences_attackspeed_normal
source: Normal
ta: சாதாரண

# preferences_attackspeed_slow
source: Slow
ta: மெதுவாக

# preferences_movement_category
source: Movement
ta: இயக்கம்

# preferences_movementmethod_title
source: Movement method
ta: இயக்க முறை

# preferences_movementmethod
source: Type of movement method and handling of obstacles.
ta: இயக்க முறை வகை மற்றும் தடைகளை கையாளுதல்.

# preferences_movementmethods_straight
source: Straight (original)
ta: நேராக (அசல்)

# preferences_movementmethods_avoid
source: Avoiding obstacles
ta: தடைகளைத் தவிர்ப்பது

# actorinfo_currentconditions
source: Active conditions
ta: செயலில் நிலைமைகள்

# actorcondition_info_removes_all
source: Removes all %1$s
ta: அனைத்து %1 $ s ஐ நீக்குகிறது

# actorcondition_info_immunity
source: Immune to %1$s
ta: %1 $ s க்கு நோய் எதிர்ப்பு ஆற்றல்

# iteminfo_effect_chance_of
source: %1$s chance of %2$s
ta: %1 $ s வாய்ப்பு %2 $ s

# iteminfo_effect_duration
source: (%1$d rounds)
ta: (%1 $ டி சுற்றுகள்)

# iteminfo_effect_works_on_source
source: On source
ta: மூலத்தில்

# iteminfo_effect_works_on_target
source: On target
ta: இலக்கில்

# iteminfo_effect_works_on_attacker
source: On attacker
ta: தாக்குபவர் மீது

# iteminfo_effect_works_when_hitting_target
source: When hitting target
ta: இலக்கைத் தாக்கும் போது

# iteminfo_effect_works_when_killing_target
source: On every kill
ta: ஒவ்வொரு கொலையிலும்

# iteminfo_effect_works_when_used
source: When used
ta: பயன்படுத்தும்போது

# iteminfo_effect_works_when_equipped
source: When equipped
ta: பொருத்தப்பட்டிருக்கும் போது

# iteminfo_effect_works_when_hit_by_attacker
source: When hit by attacker
ta: தாக்குபவரால் தாக்கப்பட்டால்

# iteminfo_effect_works_when_killed_by_attacker
source: When killed by attacker
ta: தாக்குபவரால் கொல்லப்பட்டபோது

# iteminfo_effect_decrease_current_hp
source: Drains %1$s HP
ta: வடிகால் %1 $ s எச்பி

# iteminfo_effect_increase_current_hp
source: Restores %1$s HP
ta: %1 $ s எச்பி மீட்டமைக்கிறது

# iteminfo_effect_decrease_current_ap
source: Drains %1$s AP
ta: வடிகால் %1 $ s ap

# iteminfo_effect_increase_current_ap
source: Restores %1$s AP
ta: %1 $ S AP ஐ மீட்டெடுக்கிறது

# iteminfo_effect_increase_max_hp
source: Raises max HP +%1$d
ta: அதிகபட்ச எச்பி +%1 $ டி ஐ உயர்த்துகிறது

# iteminfo_effect_decrease_max_hp
source: Lowers max HP by %1$d
ta: மேக்ச் எச்பியை %1 $ டி ஐ குறைக்கிறது

# iteminfo_effect_increase_max_ap
source: Raises max AP +%1$d
ta: அதிகபட்ச AP +%1 $ டி ஐ உயர்த்துகிறது

# iteminfo_effect_decrease_max_ap
source: Lowers max AP by %1$d
ta: அதிகபட்ச AP ஐ %1 $ டி ஐ குறைக்கிறது

# iteminfo_effect_increase_movecost
source: Move cost penalty +%1$d AP
ta: செலவு தண்டம் +%1 $ டி ap

# iteminfo_effect_decrease_movecost
source: Lowers move cost %1$d AP
ta: குறைந்த செலவு செலவு %1 $ டி ap

# preferences_display_scaling_factor_title
source: Scaling factor
ta: அளவிடுதல் காரணி

# preferences_display_scaling_factor
source: Makes the game view display everything larger or smaller.
ta: விளையாட்டு காட்சி எல்லாவற்றையும் பெரியதாகவோ அல்லது சிறியதாகவோ காட்டுகிறது.

# preferences_display_scaling_factor_50_percent
source: Half size
ta: அரை அளவு

# preferences_display_scaling_factor_75_percent
source: 0.75x size
ta: 0.75x அளவு

# preferences_display_scaling_factor_normal
source: Normal size
ta: சாதாரண அளவு

# preferences_display_scaling_factor_50_percent_larger
source: 1.5x size
ta: 1.5x அளவு

# preferences_display_scaling_factor_double
source: Double size
ta: இரட்டை அளவு

# preferences_language_default
source: System language
ta: கணினி மொழி

# preferences_language
source: Language
ta: மொழி

# preferences_language_description
source: Select the language. English is used if the system language is not available or content has not been translated. (Requires restart)
ta: மொழியைத் தேர்ந்தெடுக்கவும். கணினி மொழி கிடைக்கவில்லை அல்லது உள்ளடக்கம் மொழிபெயர்க்கப்படாவிட்டால் ஆங்கிலம் பயன்படுத்தப்படுகிறது. (மறுதொடக்கம் தேவை)

# inventory_assign
source: Assign quick slot
ta: விரைவான ச்லாட்டை ஒதுக்கவும்

# inventory_selectitem
source: Select item to assign
ta: ஒதுக்க உருப்படியைத் தேர்ந்தெடுக்கவும்

# inventory_assign_slot1
source: Slot 1
ta: ச்லாட் 1

# inventory_assign_slot2
source: Slot 2
ta: ச்லாட் 2

# inventory_assign_slot3
source: Slot 3
ta: ச்லாட் 3

# inventory_unassign
source: Un-assign quick slot
ta: விரைவான ச்லாட்டை ஒதுக்குதல்

# preferences_movement_dpad_position_title
source: Virtual d-pad
ta: மெய்நிகர் டி-பேட்

# preferences_movement_dpad_position
source: Enables a virtual on-screen directional pad to guide movement.
ta: இயக்கத்தை வழிநடத்த ஒரு மெய்நிகர் ஆன்-ச்கிரீன் திசை திண்டு செயல்படுத்துகிறது.

# preferences_movement_dpad_minimizeable_title
source: Minimizable d-pad
ta: குறைக்கப்பட்ட டி-பேட்

# preferences_movement_dpad_minimizeable
source: If the virtual d-pad is enabled, this setting allows the d-pad to be minimized by pressing its center.
ta: மெய்நிகர் டி-பேட் இயக்கப்பட்டிருந்தால், இந்த அமைப்பு டி-பேட் அதன் மையத்தை அழுத்துவதன் மூலம் குறைக்க அனுமதிக்கிறது.

# preferences_movement_dpad_positions_disabled
source: Disabled
ta: முடக்கப்பட்டது

# preferences_movement_dpad_positions_lower_right
source: Lower right corner
ta: கீழ் வலது மூலையில்

# preferences_movement_dpad_positions_lower_left
source: Lower left corner
ta: கீழ் இடது மூலையில்

# preferences_movement_dpad_positions_center_bottom
source: Center bottom
ta: நடுவண் கீழே

# preferences_movement_dpad_positions_center_left
source: Center left
ta: நடுவண் இடது

# preferences_movement_dpad_positions_center_right
source: Center right
ta: நடுவண் சரியானது

# preferences_movement_dpad_positions_upper_left
source: Upper left corner
ta: மேல் இடது மூலையில்

# preferences_movement_dpad_positions_upper_right
source: Upper right corner
ta: மேல் வலது மூலையில்

# preferences_movement_dpad_positions_center_top
source: Center top
ta: மைய மேல்

# actorconditioninfo_constant_effect
source: Constant effect
ta: நிலையான விளைவு

# actorconditioninfo_effect_every_round
source: Every round
ta: ஒவ்வொரு சுற்றும்

# actorconditioninfo_effect_every_full_round
source: Every full round
ta: ஒவ்வொரு முழு சுற்று

# bulkselection_totalcost_buy
source: Total cost: %1$d gold
ta: மொத்த செலவு: %1 $ டி தங்கம்

# bulkselection_totalcost_sell
source: Total cost: %1$d gold
ta: மொத்த செலவு: %1 $ டி தங்கம்

# bulkselection_select_all
source: All
ta: அனைத்தும்

# bulkselection_sell_confirmation_title
source: Are you sure?
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா?

# bulkselection_sell_confirmation
source: Are you sure you want to sell %1$s? This item is %2$s and you might not be able to recover it.
ta: நீங்கள் நிச்சயமாக %1 $ s விற்க விரும்புகிறீர்களா? இந்த உருப்படி %2 $ s ஆகும், மேலும் நீங்கள் அதை மீட்டெடுக்க முடியாது.

# skill_title_weapon_chance
source: Weapon Accuracy
ta: ஆயுத துல்லியம்

# skill_title_weapon_dmg
source: Hard Hit
ta: ஆர்ட் இட்

# skill_title_barter
source: Merchant
ta: வணிகர்

# skill_title_dodge
source: Dodge
ta: டாட்ச்

# skill_title_barkskin
source: Bark Skin
ta: பட்டை தோல்

# skill_title_more_criticals
source: More Criticals
ta: மிகவும் முக்கியமான

# skill_title_better_criticals
source: Better Criticals
ta: சிறந்த விமர்சனங்கள்

# skill_title_speed
source: Combat Speed
ta: போர் விரைவு

# skill_title_coinfinder
source: Treasure Hunter
ta: புதையல் வேட்டைக்காரன்

# skill_title_more_exp
source: Quick Learner
ta: விரைவான கற்பவர்

# skill_title_cleave
source: Cleave
ta: பிளவு

# skill_title_eater
source: Corpse Eater
ta: சடல உண்பவர்

# skill_title_fortitude
source: Increased Fortitude
ta: அதிகரித்த வலிமை

# skill_title_evasion
source: Evasion
ta: ஏய்ப்பு

# skill_title_regeneration
source: Regeneration
ta: மீளுருவாக்கம்

# skill_title_lower_exploss
source: Failure Mastery
ta: தோல்வி தேர்ச்சி

# skill_title_magicfinder
source: Magic Finder
ta: மேசிக் கண்டுபிடிப்பாளர்

# skill_title_resistance_mental
source: Strong Mind
ta: வலுவான மனம்

# skill_title_resistance_physical_capacity
source: Enduring Body
ta: நீடித்த உடல்

# skill_title_resistance_blood_disorder
source: Pure Blood
ta: தூய இரத்தம்

# skill_shortdescription_weapon_chance
source: Increased attack chance
ta: அதிகரித்த தாக்குதல் வாய்ப்பு

# skill_shortdescription_weapon_dmg
source: Increased attack damage
ta: அதிகரித்த தாக்குதல் சேதம்

# skill_shortdescription_barter
source: Better shop prices
ta: சிறந்த கடை விலைகள்

# skill_shortdescription_dodge
source: Increased block chance
ta: அதிகரித்த தொகுதி வாய்ப்பு

# skill_shortdescription_barkskin
source: Damage resistance
ta: சேத எதிர்ப்பு

# skill_shortdescription_more_criticals
source: Increased critical skill
ta: விமர்சன திறன் அதிகரித்தது

# skill_shortdescription_better_criticals
source: Increased critical damage
ta: சிக்கலான சேதம் அதிகரித்தது

# skill_shortdescription_speed
source: Increased maximum action points
ta: அதிகரித்த அதிகபட்ச செயல் புள்ளிகள்

# skill_shortdescription_coinfinder
source: Higher chance of finding gold
ta: தங்கத்தைக் கண்டுபிடிப்பதற்கான அதிக வாய்ப்பு

# skill_shortdescription_more_exp
source: More experience from monster kills
ta: மான்ச்டர் கொலைகளிலிருந்து கூடுதல் பட்டறிவு

# skill_shortdescription_cleave
source: Recover action points on every kill
ta: ஒவ்வொரு கொலையிலும் செயல் புள்ளிகளை மீட்டெடுக்கவும்

# skill_shortdescription_eater
source: Recover health points on every kill
ta: ஒவ்வொரு கொலையிலும் சுகாதார புள்ளிகளை மீட்டெடுக்கவும்

# skill_shortdescription_fortitude
source: Gain health on each level up
ta: ஒவ்வொரு மட்டத்திலும் ஆரோக்கியத்தைப் பெறுங்கள்

# skill_shortdescription_evasion
source: Increased chance of fleeing
ta: தப்பி ஓடுவதற்கான வாய்ப்பு அதிகரித்தது

# skill_shortdescription_regeneration
source: Gain health every round
ta: ஒவ்வொரு சுற்றிலும் ஆரோக்கியத்தைப் பெறுங்கள்

# skill_shortdescription_lower_exploss
source: Decrease amount of lost experience when dying
ta: இறக்கும் போது இழந்த அனுபவத்தின் அளவைக் குறைக்கவும்

# skill_shortdescription_magicfinder
source: Increased chance of finding magic items
ta: மந்திர உருப்படிகளைக் கண்டுபிடிப்பதற்கான வாய்ப்பு அதிகரித்தது

# skill_shortdescription_resistance_mental
source: Resistance against mental conditions
ta: மன நிலைமைகளுக்கு எதிரான எதிர்ப்பு

# skill_shortdescription_resistance_physical_capacity
source: Resistance against physical capacity conditions
ta: உடல் திறன் நிலைமைகளுக்கு எதிரான எதிர்ப்பு

# skill_shortdescription_resistance_blood_disorder
source: Resistance against blood disorders
ta: இரத்தக் கோளாறுகளுக்கு எதிரான எதிர்ப்பு

# skill_longdescription_weapon_chance
source: Increases attack chance by %1$d percentage points for each skill level.
ta: தாக்குதல் வாய்ப்பை ஒவ்வொரு திறன் நிலைக்கும் %1 $ டி சதவீத புள்ளிகள் அதிகரிக்கிறது.

# skill_longdescription_weapon_dmg
source: Increases max damage by %1$d for each skill level.
ta: ஒவ்வொரு திறன் நிலைக்கும் அதிகபட்ச சேதத்தை %1 $ டி அதிகரிக்கிறது.

# skill_longdescription_barter
source: For every skill level, decreases the buying and selling gold penalty by %1$d percentage points.
ta: ஒவ்வொரு திறன் நிலைக்கும், தங்க அபராதத்தை 1 $ டி சதவீத புள்ளிகளால் வாங்குவதையும் விற்பனை செய்வதையும் குறைக்கிறது.

# skill_longdescription_dodge
source: Increases block chance by %1$d percentage points for each skill level.
ta: ஒவ்வொரு திறன் நிலைக்கும் %1 $ டி சதவீத புள்ளிகள் மூலம் தொகுதி வாய்ப்பை அதிகரிக்கிறது.

# skill_longdescription_barkskin
source: Increases damage resistance by %1$d for each skill level.
ta: ஒவ்வொரு திறன் நிலைக்கும் சேத எதிர்ப்பை %1 $ டி மூலம் அதிகரிக்கிறது.

# skill_longdescription_more_criticals
source: Increases any existing critical skill given by equipment by %1$d %% for each skill level.
ta: ஒவ்வொரு திறன் நிலைக்கும் உபகரணங்கள் வழங்கும் எந்தவொரு முக்கியமான திறமையையும் %1 $ டி %% மூலம் அதிகரிக்கிறது.

# skill_longdescription_better_criticals
source: Increases any existing critical multiplier given by equipment by %1$d %% for each skill level.
ta: ஒவ்வொரு திறன் நிலைக்கும் கருவிகளால் வழங்கப்பட்ட எந்தவொரு முக்கியமான பெருக்கியையும் %1 $ டி %% மூலம் அதிகரிக்கிறது.

# skill_longdescription_speed
source: Increases maximum action points (AP) by %1$d for each skill level.
ta: ஒவ்வொரு திறன் நிலைக்கும் அதிகபட்ச செயல் புள்ளிகளை (AP) %1 $ டி அதிகரிக்கிறது.

# skill_longdescription_coinfinder
source: Increases chance of finding gold in monster drops by %1$d %%, and increases amount of gold in drops by %2$d %% for each skill level (up to the maximum amount that the monster drops).
ta: அசுரனில் தங்கத்தைக் கண்டுபிடிப்பதற்கான வாய்ப்பை %1 $ டி %% குறைக்கிறது, மேலும் ஒவ்வொரு திறன் நிலைக்கும் (அசுரன் குறைக்கும் அதிகபட்ச தொகை வரை) தங்கத்தின் அளவை %2 $ டி %% அதிகரிக்கிறது.

# skill_longdescription_more_exp
source: Increases amount of exp given by defeating monsters by %1$d %% for each skill level.
ta: ஒவ்வொரு திறன் நிலைக்கும் அரக்கர்களை தோற்கடிப்பதன் மூலம் %1 $ டி %% மூலம் கொடுக்கப்பட்ட எக்ச்பின் அளவை அதிகரிக்கிறது.

# skill_longdescription_cleave
source: Gives +%1$d action points (AP) on every kill per skill level.
ta: ஒரு திறன் நிலைக்கு ஒவ்வொரு கொலையிலும் +%1 $ டி செயல் புள்ளிகள் (AP) ஐ வழங்குகிறது.

# skill_longdescription_eater
source: Gives +%1$d health points (HP) on every kill per skill level.
ta: ஒரு திறன் நிலைக்கு ஒவ்வொரு கொலையிலும் +%1 $ டி சுகாதார புள்ளிகள் (எச்பி) தருகிறது.

# skill_longdescription_fortitude
source: On every subsequent level-up, maximum health points (HP) will be raised by %1$d per skill level. This is not applied retroactively, only subsequent level-ups will be affected.
ta: ஒவ்வொரு அடுத்தடுத்த மட்டத்திலும், அதிகபட்ச சுகாதார புள்ளிகள் (எச்பி) ஒரு திறன் நிலைக்கு %1 $ டி உயர்த்தப்படும். இது முன்கூட்டியே பயன்படுத்தப்படவில்லை, அடுத்தடுத்த நிலை-அப்கள் மட்டுமே பாதிக்கப்படும்.

# skill_longdescription_evasion
source: For every skill level, reduces both the chance of failed flee attempts by %1$d %% and the chance that an adjacent monster will attack by %2$d %%.
ta: ஒவ்வொரு திறன் நிலைக்கும், தோல்வியுற்ற தப்பி ஓடுவதற்கான வாய்ப்பு %1 $ டி %% மற்றும் அருகிலுள்ள அரக்கன் %2 $ டி %% தாக்கும் வாய்ப்பு இரண்டையும் குறைக்கிறது.

# skill_longdescription_regeneration
source: Gain +%1$d health points (HP) on every round per skill level when no monsters are directly adjacent.
ta: எந்த அரக்கர்களும் நேரடியாக அருகில் இல்லாதபோது ஒவ்வொரு சுற்றிலும் ஒவ்வொரு சுற்றிலும் +%1 $ டி சுகாதார புள்ளிகள் (எச்பி) கிடைக்கும்.

# skill_longdescription_lower_exploss
source: For every skill level, reduces the amount of lost experience caused by death by %1$d %% (percentage of existing exp loss value, not percentage points). %2$d levels will remove all experience loss caused by death.
ta: ஒவ்வொரு திறன் நிலைக்கும், மரணத்தால் ஏற்படும் இழந்த அனுபவத்தின் அளவை %1 $ டி %% (தற்போதுள்ள எக்ச்ப் இழப்பு மதிப்பின் விழுக்காடு, சதவீத புள்ளிகள் அல்ல) குறைக்கிறது. %2 $ டி அளவுகள் மரணத்தால் ஏற்படும் அனைத்து அனுபவ இழப்புகளையும் அகற்றும்.

# skill_longdescription_magicfinder
source: Increases the chance of finding non-ordinary items by %1$d %% for every skill level.
ta: ஒவ்வொரு திறன் நிலைக்கும் சாதாரணமற்ற பொருட்களைக் கண்டுபிடிப்பதற்கான வாய்ப்பை %1 $ டி %% மூலம் அதிகரிக்கிறது.

# skill_longdescription_resistance_mental
source: Lowers the chance of being afflicted with mental conditions by %1$d %% for every skill level, up to a maximum of %2$d %%. This includes conditions caused by monster attacks such as Dazed or Weapon Feebleness.
ta: ஒவ்வொரு திறன் நிலைக்கும் மன நிலைமைகளால் பாதிக்கப்படுவதற்கான வாய்ப்பை %1 $ டி %% குறைக்கிறது, அதிகபட்சம் %2 $ டி %% வரை. அரக்கன் தாக்குதல்களால் ஏற்படும் நிலைமைகள் இதில் அடங்கும்.

# skill_longdescription_resistance_physical_capacity
source: Lowers the chance of being afflicted with conditions affecting your physical capacity by %1$d %% for every skill level, up to a maximum of %2$d %%. This includes conditions caused by monster attacks such as Fatigue.
ta: உங்கள் உடல் திறனை பாதிக்கும் நிலைமைகளால் பாதிக்கப்படுவதற்கான வாய்ப்பை ஒவ்வொரு திறன் நிலைக்கும் %1 $ டி %%, அதிகபட்சம் 2 $ டி %% வரை குறைக்கிறது. சோர்வு போன்ற அரக்கன் தாக்குதல்களால் ஏற்படும் நிலைமைகள் இதில் அடங்கும்.

# skill_longdescription_resistance_blood_disorder
source: Lowers the chance of being afflicted with disorders of the blood by %1$d %% for every skill level, up to a maximum of %2$d %%. This includes conditions caused by monster attacks such as Poison or bleeding wounds.
ta: இரத்தத்தின் கோளாறுகளால் பாதிக்கப்படுவதற்கான வாய்ப்பை ஒவ்வொரு திறன் நிலைக்கும் %1 $ டி %% குறைக்கிறது, அதிகபட்சம் %2 $ டி %% வரை. நஞ்சு அல்லது இரத்தப்போக்கு காயங்கள் போன்ற அரக்கன் தாக்குதல்களால் ஏற்படும் நிலைமைகள் இதில் அடங்கும்.

# skillinfo_action_levelup
source: Level up
ta: நிலை

# skill_current_level
source: Current level: %1$d
ta: தற்போதைய நிலை: %1 $ டி

# skill_current_level_with_maximum
source: Current level: %1$d / %2$d
ta: தற்போதைய நிலை: %1 $ டி / %2 $ டி

# skill_prerequisite_other_skill
source: To level up this skill, you need at least level %1$d of the %2$s skill.
ta: இந்த திறமையை சமன் செய்ய, %2 $ s திறனில் குறைந்தபட்சம் %1 $ டி தேவை.

# skill_prerequisite_level
source: To level up this skill, you need at least experience level %1$d.
ta: இந்த திறமையை சமன் செய்ய, உங்களுக்கு குறைந்தபட்சம் அனுபவ நிலை %1 $ டி தேவை.

# skill_prerequisite_stat
source: To level up this skill, you need at least %1$d %2$s (base stats).
ta: இந்த திறமையை சமன் செய்ய, உங்களுக்கு குறைந்தது %1 $ டி %2 $ s (அடிப்படை புள்ளிவிவரங்கள்) தேவை.

# skill_number_of_increases_one
source: You may select one skill to improve. Skill points are kept until used.
ta: மேம்படுத்த ஒரு திறனை நீங்கள் தேர்ந்தெடுக்கலாம். திறன் புள்ளிகள் பயன்படுத்தப்படும் வரை வைக்கப்படுகின்றன.

# skill_number_of_increases_several
source: You may select %1$d skills to improve.
ta: மேம்படுத்த %1 $ டி திறன்களை நீங்கள் தேர்ந்தெடுக்கலாம்.

# levelup_adds_new_skillpoint
source: This level also gives you a new skill point to spend!
ta: இந்த நிலை உங்களுக்கு செலவழிக்க ஒரு புதிய திறன் புள்ளியையும் வழங்குகிறது!

# loadsave_save_to_new_slot
source: Create new Savegame slot
ta: புதிய சேவ் கேம் ச்லாட்டை உருவாக்கவும்

# loadsave_save_overwrite_confirmation_title
source: Overwrite Savegame?
ta: சேமிப்பகத்தை மேலெழுதவா?

# loadsave_save_overwrite_confirmation
source: This Savegame contains a different player name (%1$s) than your current player name (%2$s). Are you sure you want to overwrite this savegame?
ta: இந்த சேவ் கேமில் உங்கள் தற்போதைய பிளேயர் பெயரை விட (%2 $ s) வேறுபட்ட பிளேயர் பெயர் (%1 $ s) உள்ளது. இந்த சேவ் கேமை மேலெழுத விரும்புகிறீர்களா?

# loadsave_export
source: Export Savegames
ta: சேமிப்பகங்களை ஏற்றுமதி செய்யுங்கள்

# loadsave_export_info
source: Please select the directory to export all files to.
ta: எல்லா கோப்புகளையும் ஏற்றுமதி செய்ய கோப்பகத்தைத் தேர்ந்தெடுக்கவும்.

# loadsave_exporting_savegames
source: Exporting Savegames
ta: சேமிப்பகங்களை ஏற்றுமதி செய்கிறது

# loadsave_exporting_worldmap
source: Exporting Worldmap
ta: வேர்ல்ட்மேப்பை ஏற்றுமதி செய்கிறது

# loadsave_export_successfull
source: Export successful
ta: ஏற்றுமதி வெற்றிகரமாக

# loadsave_export_unsuccessfull
source: Export unsuccessful
ta: ஏற்றுமதி தோல்வியுற்றது

# loadsave_export_overwrite_confirmation_title
source: Overwrite Existing Files?
ta: இருக்கும் கோப்புகளை மேலெழுதவா?

# loadsave_export_overwrite_confirmation
source: The target Folder contains existing files with the same name of some Files that should be exported. Are you sure you want to overwrite those files?
ta: இலக்கு கோப்புறையில் ஏற்றுமதி செய்யப்பட வேண்டிய சில கோப்புகளின் அதே பெயருடன் இருக்கும் கோப்புகள் உள்ளன. அந்த கோப்புகளை மேலெழுத விரும்புகிறீர்களா?

# loadsave_export_error_unknown
source: An unknown error occurred while exporting.
ta: ஏற்றுமதி செய்யும் போது அறியப்படாத பிழை ஏற்பட்டது.

# loadsave_import_save
source: Import Savegames
ta: சேமிப்பகங்களை இறக்குமதி செய்க

# loadsave_import_save_info
source: Please select all Savegames you want to import.
ta: நீங்கள் இறக்குமதி செய்ய விரும்பும் அனைத்து சேமிப்பு கேம்களையும் தேர்ந்தெடுக்கவும்.

# loadsave_importing_savegames
source: Importing Savegames
ta: சேமிப்பகங்களை இறக்குமதி செய்கிறது

# loadsave_import_save_successfull
source: Import successful
ta: இறக்குமதி வெற்றிகரமாக

# loadsave_import_save_unsuccessfull
source: Import unsuccessful
ta: தோல்வியுற்ற இறக்குமதி

# loadsave_import_save_error_unknown
source: - obsolete -
ta: - வழக்கற்றுப் போன -

# loadsave_import_error_unknown
source: An unknown error occurred while importing.
ta: இறக்குமதி செய்யும் போது அறியப்படாத பிழை ஏற்பட்டது.

# loadsave_import_overwrite_confirmation_title
source: Overwrite Existing Slot?
ta: இருக்கும் ச்லாட்டை மேலெழுதவா?

# loadsave_import_file_exists_question
source: There is already a savegame in the target slot. Do you want to keep the existing save, overwrite it with the imported save or import the save to a slot? %1$s %2$s
ta: இலக்கு ச்லாட்டில் ஏற்கனவே ஒரு சேவ் கேம் உள்ளது. ஏற்கனவே உள்ள சேமிப்பை வைத்திருக்க விரும்புகிறீர்களா, இறக்குமதி செய்யப்பட்ட சேமிப்பால் அதை மேலெழுத விரும்புகிறீர்களா அல்லது சேமிப்பதை ஒரு ச்லாட்டுக்கு இறக்குமதி செய்ய விரும்புகிறீர்களா? %1 $ s %2 $ கள்

# loadsave_import_option_keep_existing
source: Keep existing save
ta: ஏற்கனவே சேமிக்கவும்

# loadsave_import_option_keep_imported
source: Keep imported save
ta: இறக்குமதி செய்த சேமிப்பு

# loadsave_import_option_add_as_new
source: Add as new Save
ta: புதிய சேமிப்பாக சேர்க்கவும்
