Repository: 247i/TACETr
Catalog: உரை/தானி/andors-trail-user-interface-*.po
Languages: ta

# app_name
source: Andor's Trail
ta: ஆண்டரின் பாதை

# app_description
source: Quest-driven fantasy RPG
ta: குவெச்ட்-உந்துதல் பேண்டசி ஆர்பிசி

source: Exit to menu
ta: மெனுவுக்கு வெளியேறவும்

# menu_settings
source: Preferences
ta: விருப்பத்தேர்வுகள்

# menu_save
source: Save
ta: சேமி

# menu_save_gamesaved
source: Game was saved to slot %1$d
ta: விளையாட்டு %1 $ டி க்கு சேமிக்கப்பட்டது

# menu_save_failed
source: Failed to save game! Is the SD card mounted and writable?
ta: Failed பெறுநர் சேமி game! எச்டி அட்டை ஏற்றப்பட்டு எழுதக்கூடியதா?

# loadsave_title_save
source: Save game
ta: விளையாட்டைச் சேமிக்கவும்

# loadsave_title_load
source: Load saved game
ta: சேமித்த விளையாட்டை ஏற்றவும்

# loadsave_selectslot
source: Select slot
ta: ச்லாட் தேர்ந்தெடுக்கவும்

# savegame_currenthero_displayinfo
source: level %1$d, %2$d exp, %3$d gold
ta: நிலை %1 $ d, %2 $ டி எக்ச்ப், %3 $ டி தங்கம்

# dialog_loading_message
source: Loading resources…
ta: வளங்களை ஏற்றுகிறது…

# dialog_loading_failed_title
source: Load Failed
ta: சுமை தோல்வியடைந்தது

# dialog_loading_failed_message
source: Andor's Trail was unable to load the savegame file. :( The file may be damaged or incomplete.
ta: ஆண்டரின் பாதையில் சேவ் கேம் கோப்பை ஏற்ற முடியவில்லை. :( கோப்பு சேதமடையலாம் அல்லது முழுமையடையாது.

# dialog_loading_failed_incorrectversion
source: Andor's Trail was unable to load the savegame file. This savegame file is created with a newer version than what is currently running.
ta: ஆண்டரின் பாதையில் சேவ் கேம் கோப்பை ஏற்ற முடியவில்லை. இந்த சேவ் கேம் கோப்பு தற்போது இயங்குவதை விட புதிய பதிப்போடு உருவாக்கப்பட்டது.

# dialog_loading_failed_cheat
source: Andor's Trail was unable to load the savegame file. This savegame file has already been continued.
ta: ஆண்டரின் பாதையில் சேவ் கேம் கோப்பை ஏற்ற முடியவில்லை. இந்த சேவ் கேம் கோப்பு ஏற்கனவே தொடர்ந்தது.

# dialog_recenter
source: Recenter
ta: மிக அண்மைக் கால

# dialog_close
source: Close
ta: மூடு

# dialog_more
source: More
ta: மேலும்

# dialog_game_over_title
source: Game over
ta: விளையாட்டு ஓவர்

# dialog_game_over_text
source: You take your last breath and die.
ta: உங்கள் கடைசி மூச்சை எடுத்து இறந்து விடுங்கள்.

# dialog_monsterencounter_title
source: Encounter
ta: சந்திப்பு

# dialog_monsterencounter_message
source: Do you want to attack? Difficulty: %1$s
ta: நீங்கள் தாக்க விரும்புகிறீர்களா? சிரமம்: %1 $ s

# dialog_monsterencounter_info
source: Info
ta: தகவல்

# dialog_monsterencounter_conditions
source: Conditions
ta: நிபந்தனைகள்

# status_hp
source: HP:
ta: எச்பி:

# status_exp
source: XP:
ta: எக்ச்பி:

# heroinfo_char
source: Overview
ta: கண்ணோட்டம்

# heroinfo_inv
source: Items
ta: உருப்படிகள்

# heroinfo_skill
source: Skills
ta: திறன்கள்

# heroinfo_skill_categories
source: Category
ta: வகை

# heroinfo_skill_sort
source: Sort
ta: வரிசைப்படுத்து

# heroinfo_levelup
source: Level up
ta: நிலை

# heroinfo_level
source: Level
ta: நிலை

# heroinfo_mode
source: Mode
ta: பயன்முறை

# heroinfo_totalexperience
source: Total experience
ta: மொத்த பட்டறிவு

# heroinfo_wornequipment
source: Worn equipment
ta: அணிந்த உபகரணங்கள்

# heroinfo_inventory
source: Inventory
ta: சரக்கு

# heroinfo_inventory_categories
source: Category
ta: வகை

# heroinfo_inventory_sort
source: Sort By
ta: வரிசைப்படுத்தவும்

# heroinfo_gold
source: Gold: %1$d
ta: தங்கம்: %1 $ டி

# heroinfo_healthpoints
source: Health points (HP):
ta: சுகாதார புள்ளிகள் (எச்பி):

# heroinfo_experiencepoints
source: Experience points (XP):
ta: அனுபவ புள்ளிகள் (எக்ச்பி):

# heroinfo_actionpoints
source: Action points (AP):
ta: செயல் புள்ளிகள் (AP):

# heroinfo_quests
source: Quests
ta: தேடல்கள்

# heroinfo_unlimited_lives_and_saves
source: Standard (Unlimited lives and saves)
ta: தரநிலை (வரம்பற்ற வாழ்க்கை மற்றும் சேமிப்புகள்)

# heroinfo_unlimited_lives
source: Unlimited lives, 1 save
ta: வரம்பற்ற வாழ்க்கை, 1 சேமிக்கவும்

# heroinfo_limited_lives
source: Limited lives (%1$d/%2$d left)
ta: வரையறுக்கப்பட்ட வாழ்க்கை (%1 $ d/%2 $ டி மீதமுள்ள)

# heroinfo_one_life
source: Permadeath (1 life)
ta: பெர்மாடீத் (1 வாழ்க்கை)

# combat_attack
source: Attack (%1$d AP)
ta: தாக்குதல் (%1 $ டி AP)

# combat_move
source: Move (%1$d AP)
ta: நகர்த்து (%1 $ டி AP)

# combat_use
source: Use item
ta: உருப்படியைப் பயன்படுத்தவும்

# combat_endturn
source: End turn
ta: இறுதி திருப்பம்

# combat_flee
source: Flee
ta: தப்பி ஓடு

# combat_begin_flee
source: You can now flee combat by clicking in the direction you want to move.
ta: நீங்கள் நகர்த்த விரும்பும் திசையில் சொடுக்கு செய்வதன் மூலம் இப்போது போராட்டத்தை விட்டு வெளியேறலாம்.

# combat_flee_failed
source: You failed to flee!
ta: நீங்கள் தப்பி ஓடத் தவறிவிட்டீர்கள்!

# combat_status_ap
source: AP: %1$d
ta: AP: %1 $ டி

# combat_monsterhealth
source: HP:
ta: எச்பி:

# combat_monsteraction
source: %1$s is attacking.
ta: %1 $ s தாக்குகிறது.

# combat_result_monstermiss
source: %1$s misses!
ta: %1 $ கள் மிச்!

# combat_result_monsterhit
source: %1$s hits you for %2$d hp!
ta: %1 $ கள் %2 $ டி எச்பிக்கு உங்களைத் தாக்கும்!

# combat_result_monsterhitcritical
source: %1$s gets a critical hit for %2$d hp!
ta: %1 $ S %2 $ டி எச்பிக்கு ஒரு முக்கியமான வெற்றியைப் பெறுகிறது!

# combat_result_heromiss
source: Your attack misses.
ta: உங்கள் தாக்குதல் தவறவிடுகிறது.

# combat_result_herohit
source: You hit %1$s for %2$d hp!
ta: %2 $ டி எச்பிக்கு %1 $ s ஐ நீங்கள் அடித்தீர்கள்!

# combat_result_herohitcritical
source: You get a critical hit on %1$s for %2$d hp!
ta: %2 $ டி எச்பிக்கு %1 $ s இல் நீங்கள் ஒரு முக்கியமான வெற்றியைப் பெறுவீர்கள்!

# combat_result_herokillsmonster
source: %1$s dies!
ta: %1 $ கள் இறந்துவிடுகின்றன!

# combat_not_enough_ap
source: Not enough AP left this round.
ta: போதுமானதாக இல்லை ஏபி இந்த சுற்றை விட்டு வெளியேறியது.

# combat_hero_dies
source: You fall unconscious, but fortunately wake up alive, dazed and fatigued. You lost %1$d experience.
ta: நீங்கள் மயக்கமடைகிறீர்கள், ஆனால் அதிர்ச்டவசமாக உயிருடன் எழுந்திருக்கிறார், திகைத்து, சோர்வு. நீங்கள் %1 $ டி அனுபவத்தை இழந்துவிட்டீர்கள்.

# combat_miss_animation_message
source: MISS
ta: மிச்

# combat_taunt_monster
source: You taunt %1$s!
ta: நீங்கள் %1 $ s ஐ கேலி செய்கிறீர்கள்!

# combat_condition_player_apply
source: You are affected by %1$s.
ta: நீங்கள் %1 $ s ஆல் பாதிக்கப்படுகிறீர்கள்.

# combat_condition_player_clear
source: You are cleared of %1$s.
ta: நீங்கள் %1 $ s க்கு அகற்றப்படுகிறீர்கள்.

# combat_condition_player_immune
source: You are now immunized against %1$s.
ta: நீங்கள் இப்போது %1 $ s க்கு எதிராக நோய்த்தடுப்பு செய்யப்படுகிறீர்கள்.

# combat_condition_monster_apply
source: %1$s is affected by %2$s.
ta: %1 $ s %2 $ s ஆல் பாதிக்கப்படுகிறது.

# combat_condition_monster_clear
source: %1$s is cleared of %2$s.
ta: %1 $ s %2 $ s க்கு அழிக்கப்படுகிறது.

# combat_condition_monster_immune
source: %1$s is now immunized against %2$s.
ta: %1 $ s இப்போது %2 $ s க்கு எதிராக நோய்த்தடுப்பு செய்யப்படுகிறது.

# combat_log_item_single
source: You found an item:
ta: நீங்கள் ஒரு உருப்படியைக் கண்டீர்கள்:

# combat_log_item_plural
source: You found %1$d items:
ta: நீங்கள் %1 $ டி உருப்படிகளைக் கண்டீர்கள்:

# inventory_info
source: Info
ta: தகவல்

# inventory_equip
source: Equip
ta: உபகரணங்கள்

# inventory_unequip
source: Unequip
ta: WAKIP

# inventory_use
source: Use
ta: பயன்படுத்தவும்

# inventory_drop
source: Drop
ta: துளி

# inventory_item_used
source: You used %1$s.
ta: நீங்கள் %1 $ s ஐப் பயன்படுத்தினீர்கள்.

# inventory_item_dropped
source: %1$s was dropped.
ta: %1 $ s கைவிடப்பட்டது.

# inventory_item_equipped
source: You equipped %1$s.
ta: நீங்கள் %1 $ s பொருத்தப்பட்டிருக்கிறீர்கள்.

# dialog_loot_pickall
source: Pick up all
ta: அனைத்தையும் எடுத்துக் கொள்ளுங்கள்

# dialog_loot_foundgold
source: You found %1$d gold.
ta: நீங்கள் %1 $ டி தங்கத்தைக் கண்டீர்கள்.

# dialog_loot_pickedupitem
source: You picked up an item.
ta: நீங்கள் ஒரு பொருளை எடுத்தீர்கள்.

# dialog_loot_pickedupitems
source: You picked up %1$d items.
ta: நீங்கள் %1 $ டி உருப்படிகளை எடுத்தீர்கள்.

# dialog_groundloot_title
source: Items
ta: உருப்படிகள்

# dialog_groundloot_message
source: You found some items.
ta: நீங்கள் சில பொருட்களைக் கண்டீர்கள்.

# dialog_monsterloot_title
source: Victory
ta: செய்

# dialog_monsterloot_message
source: You survived the encounter.
ta: நீங்கள் சந்திப்பிலிருந்து தப்பினீர்கள்.

# dialog_monsterloot_gainedexp
source: You gained %1$d experience.
ta: நீங்கள் %1 $ டி அனுபவத்தைப் பெற்றீர்கள்.

# monster_difficulty_veryeasy
source: Very easy
ta: மிகவும் எளிதானது

# monster_difficulty_easy
source: Easy
ta: எளிதானது

# monster_difficulty_normal
source: Normal
ta: சாதாரண

# monster_difficulty_hard
source: Hard
ta: கடினமானது

# monster_difficulty_veryhard
source: Very hard
ta: மிகவும் கடினமானது

# monster_difficulty_impossible
source: Impossible
ta: சாத்தியமற்றது

# actorinfo_class
source: Class:
ta: வகுப்பு:

# actorinfo_difficulty
source: Difficulty:
ta: சிரமம்:

# actorinfo_health
source: Health:
ta: உடல்நலம்:

# actorinfo_attack
source: Attack:
ta: தாக்குதல்:

# actorinfo_defense
source: Defense:
ta: பாதுகாப்பு:

# actorinfo_movecost
source: Move cost (AP):
ta: நகர்த்து செலவை (AP):

# actorinfo_basetraits
source: Base combat statistics (without equipment and skills)
ta: அடிப்படை போர் புள்ளிவிவரங்கள் (உபகரணங்கள் மற்றும் திறன்கள் இல்லாமல்)

# actorinfo_currenttraits
source: Combat statistics (current)
ta: போர் புள்ளிவிவரங்கள் (நடப்பு)

# traitsinfo_attack_cost
source: Attack cost (AP):
ta: தாக்குதல் செலவு (AP):

# traitsinfo_attack_chance
source: Attack chance:
ta: தாக்குதல் வாய்ப்பு:

# traitsinfo_attack_damage
source: Attack damage:
ta: தாக்குதல் சேதம்:

# traitsinfo_criticalhit_skill
source: Critical hit skill:
ta: விமர்சன செய் திறன்:

# traitsinfo_criticalhit_multiplier
source: Critical multiplier:
ta: சிக்கலான பெருக்கி:

# traitsinfo_defense_chance
source: Block chance:
ta: தொகுதி வாய்ப்பு:

# traitsinfo_defense_damageresist
source: Damage resistance:
ta: சேத எதிர்ப்பு:

# iteminfo_category
source: Category:
ta: வகை:

# iteminfo_action_use
source: Use
ta: பயன்படுத்தவும்

# iteminfo_action_equip
source: Equip
ta: உபகரணங்கள்

# iteminfo_action_unequip
source: Unequip
ta: WAKIP

# iteminfo_action_use_ap
source: Use (%1$d AP)
ta: பயன்படுத்தவும் (%1 $ டி AP)

# iteminfo_action_equip_ap
source: Equip (%1$d AP)
ta: உபகரணங்கள் (%1 $ டி AP)

# iteminfo_action_unequip_ap
source: Unequip (%1$d AP)
ta: Unecip (%1 $ டி ap)

# startscreen_continue
source: Continue current game
ta: தற்போதைய விளையாட்டைத் தொடரவும்

# startscreen_newgame
source: New game
ta: புதிய விளையாட்டு

# startscreen_newgame_start
source: Start game
ta: விளையாட்டைத் தொடங்கவும்

# startscreen_newgame_confirm
source: You will lose your current game and your current character, are you sure you want to start a new game?
ta: உங்கள் தற்போதைய விளையாட்டையும் உங்கள் தற்போதைய தன்மையையும் இழப்பீர்கள், நீங்கள் ஒரு புதிய விளையாட்டைத் தொடங்க விரும்புகிறீர்களா?

# startscreen_about
source: About/help
ta: பற்றி/உதவி

# startscreen_selectherosprite
source: Choose your hero
ta: உங்கள் ஈரோவைத் தேர்வுசெய்க

# startscreen_enterheroname
source: Enter hero name
ta: ஈரோ பெயரை உள்ளிடவும்

# startscreen_load
source: Load
ta: சுமை

# startscreen_game_mode
source: Mode
ta: பயன்முறை

# startscreen_migration_title
source: Data Migration
ta: தரவு இடம்பெயர்வு

# startscreen_migration_text
source: Migrating savegame data.
ta: SaveGame தரவை இடம்பெயர்கிறது.

# startscreen_migration_failure
source: Failed to migrate savegame data.
ta: சேவ் கேம் தரவை இடம்பெயரத் தவறிவிட்டது.

# startscreen_load_game
source: Load game
ta: விளையாட்டு சுமை

# startscreen_load_game_confirm
source: The current game is unsaved and you will lose your character.
ta: தற்போதைய விளையாட்டு சேமிக்கப்படவில்லை, நீங்கள் உங்கள் தன்மையை இழப்பீர்கள்.

# startscreen_error_loading_game
source: Error loading game
ta: விளையாட்டு ஏற்றுதல் விளையாட்டு

# startscreen_error_loading_empty_slot
source: Can't load from an empty slot.
ta: வெற்று ச்லாட்டிலிருந்து ஏற்ற முடியாது.

# startscreen_attention_slot_gets_delete_on_load
source: Attention
ta: கவனம்

# startscreen_attention_message_slot_gets_delete_on_load
source: Loading this game deletes its save slot. You will have to save again before switching to another game.
ta: இந்த விளையாட்டை ஏற்றுவது அதன் சேமி ச்லாட்டை நீக்குகிறது. வேறொரு விளையாட்டுக்கு மாறுவதற்கு முன்பு நீங்கள் மீண்டும் சேமிக்க வேண்டும்.

# startscreen_mode_unlimited_saves_and_lives
source: Standard (Unlimited lives and saves)
ta: தரநிலை (வரம்பற்ற வாழ்க்கை மற்றும் சேமிப்புகள்)

# startscreen_mode_unlimited_lives
source: Medium (Unlimited lives, 1 save)
ta: நடுத்தர (வரம்பற்ற வாழ்க்கை, 1 சேமி)

# startscreen_mode_50_lives
source: Hard (50 lives, 1 save)
ta: கடினமானது (50 லைவ்ச், 1 சேமி)

# startscreen_mode_10_lives
source: Very hard (10 lives, 1 save)
ta: மிகவும் கடினமானது (10 லைவ்ச், 1 சேமி)

# startscreen_mode_3_lives
source: Extreme (3 lives, 1 save)
ta: தீவிர (3 லைவ்ச், 1 சேமி)

# startscreen_mode_1_life
source: Permadeath (1 life, 1 save)
ta: பெர்மடீத் (1 வாழ்க்கை, 1 சேமி)

# conversation_rewardexp
source: [You gained %1$d experience]
ta: [நீங்கள் %1 $ டி அனுபவத்தைப் பெற்றீர்கள்]

# conversation_rewardgold
source: [You gained %1$d gold]
ta: [நீங்கள் %1 $ டி தங்கத்தைப் பெற்றீர்கள்]

# conversation_lostgold
source: [You lost %1$d gold]
ta: [நீங்கள் %1 $ டி தங்கத்தை இழந்துவிட்டீர்கள்]

# conversation_rewarditem
source: [You gained an item]
ta: [நீங்கள் ஒரு பொருளைப் பெற்றீர்கள்]

# conversation_rewarditems
source: [You gained %1$d items]
ta: [நீங்கள் %1 $ டி உருப்படிகளைப் பெற்றீர்கள்]

# conversation_next
source: Next
ta: அடுத்தது

# conversation_leave
source: Leave
ta: விடுப்பு

# shop_buy
source: Buy
ta: வாங்க

# shop_sell
source: Sell
ta: விற்கவும்

# shop_infoitem
source: Info
ta: தகவல்

# shop_buyitem
source: Buy (%1$d gold)
ta: வாங்க (%1 $ டி தங்கம்)

# shop_sellitem
source: Sell (%1$d gold)
ta: விற்க (%1 $ டி தங்கம்)

# shop_yourgold
source: Your gold: %1$d
ta: உங்கள் தங்கம்: %1 $ டி

# shop_item_bought
source: %1$s bought.
ta: %1 $ கள் வாங்கப்பட்டன.

# shop_item_sold
source: %1$s sold.
ta: %1 $ கள் விற்கப்பட்டன.

# shop_item_sort
source: Sort
ta: வரிசைப்படுத்து

# levelup_title
source: Level up
ta: நிலை

# levelup_description
source: Welcome to level %1$d!
ta: நிலை %1 $ டி க்கு வருக!

# levelup_buttontext
source: Level up
ta: நிலை

# levelup_add_health
source: Increase health (+%1$d HP)
ta: ஆரோக்கியத்தை அதிகரிக்கவும் (+%1 $ டி எச்பி)

# levelup_add_health_description
source: Adds %1$d to your maximum health.
ta: உங்கள் அதிகபட்ச ஆரோக்கியத்திற்கு %1 $ டி சேர்க்கிறது.

# levelup_add_attackchance
source: Increase attack chance (+%1$d)
ta: தாக்குதல் வாய்ப்பை அதிகரிக்கவும் (+%1 $ d)

# levelup_add_attackchance_description
source: Adds %1$d to your base attack chance.
ta: உங்கள் அடிப்படை தாக்குதல் வாய்ப்பில் %1 $ டி சேர்க்கிறது.

# levelup_add_attackdamage
source: Increase attack damage (+%1$d)
ta: தாக்குதல் சேதத்தை அதிகரிக்கவும் (+%1 $ d)

# levelup_add_attackdamage_description
source: Adds %1$d to your base attack damage.
ta: உங்கள் அடிப்படை தாக்குதல் சேதத்திற்கு %1 $ டி சேர்க்கிறது.

# levelup_add_blockchance
source: Increase block chance (+%1$d)
ta: தொகுதி வாய்ப்பை அதிகரிக்கவும் (+%1 $ d)

# levelup_add_blockchance_description
source: Adds %1$d to your base block chance.
ta: உங்கள் அடிப்படை தொகுதி வாய்ப்பில் %1 $ டி சேர்க்கிறது.

# dialog_rest_title
source: Rest
ta: ஓய்வு

# dialog_rest_confirm_message
source: Do you want to rest here?
ta: நீங்கள் இங்கே ஓய்வெடுக்க விரும்புகிறீர்களா?

# dialog_rest_message
source: You have rested and regained your full health.
ta: உங்கள் முழு ஆரோக்கியத்தையும் நீங்கள் ஓய்வெடுத்து மீட்டெடுத்துள்ளீர்கள்.

# about_button1
source: Help
ta: உதவி

# about_button2
source: Authors
ta: ஆசிரியர்கள்

# about_button3
source: License
ta: உரிமம்

# about_contents1
source: Welcome to Andor's Trail, an open-source roguelike RPG on Android.<br /> <br /> <a href=http://andorstrail.com/>Game forums on andorstrail.com for questions and gameplay discussions.</a><br /> <br /> <a href=https://andorstrail.gitbook.io/docs>Game wiki for info about the Andor's Trail world, among other things.</a><br /> <br /> <a href=https://github.com/AndorsTrailRelease/andors-trail/>Project source code on github.com for developers.</a><br /> <br /> Please visit the forums to discuss the game with other players.<br />
ta: ஆண்டோர்ச் டிரெயிலுக்கு வருக, ஆண்ட்ராய்டில் ஒரு திறந்த-மூல ரோகுவேல் போன்ற ஆர்.பி.சி. > <br /> <br /> <a href = https: //andorstrail.gitbook.io/docs> ஆண்டரின் டிரெயில் உலகத்தைப் பற்றிய தகவல்களுக்கு விளையாட்டு விக்கி. </a> <br /> <br / > <a href = https: //github.com/andorstrailrelease/andors-trail/> டெவலப்பர்களுக்கான கிதுப்.காமில் திட்ட மூலக் குறியீடு. மற்ற வீரர்களுடன். <br />

# about_contents3
source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.<br /> <br /> This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.<br /> <br /> You should have received a copy of the GNU General Public License along with this program; if not, see <a href=http://www.gnu.org/licenses>http://www.gnu.org/licenses</a><br /> <br /> For source code and feature requests, please visit the project page at <a href=https://github.com/AndorsTrailRelease/andors-trail/>https://github.com/AndorsTrailRelease/andors-trail/</a><br />
ta: இந்த நிரல் இலவச மென்பொருள்; இலவச மென்பொருள் அறக்கட்டளையால் வெளியிடப்பட்ட குனு பொது பொது உரிமத்தின் விதிமுறைகளின் கீழ் நீங்கள் அதை மறுபகிர்வு செய்யலாம் மற்றும்/அல்லது மாற்றலாம்; உரிமத்தின் பதிப்பு 2, அல்லது (உங்கள் விருப்பத்தில்) பின்னர் எந்த பதிப்பும். ஒரு குறிப்பிட்ட நோக்கத்திற்காக வணிகத்தன்மை அல்லது உடற்தகுதி ஆகியவற்றின் மறைமுக பொறுப்பு கூட இல்லாமல். மேலும் விவரங்களுக்கு குனு பொது பொது உரிமத்தைப் பார்க்கவும். <Br /> <br /> இந்த திட்டத்துடன் குனு பொது பொது உரிமத்தின் நகலை நீங்கள் பெற்றிருக்க வேண்டும்; இல்லையென்றால், <a href = http: //www.gnu.org/licenses> http://www.gnu.org/licenses </a> <br/> <br/> மூல குறியீடு மற்றும் அம்ச கோரிக்கைகளுக்கு பார்க்கவும் திட்ட பக்கத்தை <a href = https: //github.com/andorstrailrelease/andors-trail/> https://github.com/andorstrailrelease/andors-trail/ </a> <br/> இல் பார்வையிடவும்

# about_interface
source: <![CDATA[ <div><b>Game Settings</b> can be found by pressing your device\'s Menu Button.</div> <p>________________</p> <h1>Interface Icons</h1> <div><b>The Chest</b><img alt="chest" src="chest.png" /></div> <p>Quickslots [Long press the pouches inside to assign items for instant use]</p> <div><b>The Hero</b><img alt="hero" src="char_hero.png" /></div> <p>Menu [Overview, Quests, Skills &amp; Inventory *]</p> <p>* (While in inventory, "press" an item for information &amp; "long press" for more options)</p> <div><b>The Enemy</b><img alt="monster" src="monster.png" /></div> <p>Information [Appears during Combat]</p> <p>________________</p> <h1>Combat</h1> <p>Actions taken during battle cost AP...</p> <div><b>Attacking</b> - [3AP] *</div> <img alt="attacking" src="doubleattackexample.png" /> <p>* (Equipping Gear &amp; Using Items may alter AP &amp; usage cost)</p> <div><b>Using Items</b> - [5AP]</div> <div><b>Fleeing</b> - [6AP]</div> <p>________________</p> <h1>Advanced Combat</h1> <div>During Combat, long press a tile adjacent to the Hero...</div> <div><b>To Flee</b></div> <p>(chosen tile is highlighted - Attack Button changes to Move)</p> <img alt="flee" src="flee_example.png" /> <p>[flee mode activated - Long press enemy to re-enter combat]</p> <div><b>To Change Targets</b></div> <p>(the red target highlight shifts between enemies)</p> <p>[the target has been changed]</p> ]]>
ta: <! [சி.டி.ஏ.டி.ஏ [ <div> <b> விளையாட்டு அமைப்புகள் </b> உங்கள் சாதனத்தின் பட்டியல் பொத்தானை அழுத்துவதன் மூலம் காணலாம். </div> <p> ________________ </p> <H1> இடைமுக சின்னங்கள் </H1> <div> <b> மார்பு </b> <img மாற்று = "மார்பு" src = "Chet.png"/> </div> <p> குவிகச்லாட்டுகள் [உடனடி பயன்பாட்டிற்கான உருப்படிகளை ஒதுக்க உள்ளே பைகளை நீண்ட நேரம் அழுத்தவும்] </p> <viv> <b> ஈரோ </b> <img மாற்று = "ஈரோ" src = "char_hero.png"/> </iv> <p> பட்டியல் [கண்ணோட்டம், தேடல்கள், திறன்கள் & ஆம்ப்; சரக்கு *] </p> <p>* (சரக்குகளில் இருக்கும்போது, ​​தகவலுக்கு ஒரு பொருளை "அழுத்தவும்" & ஆம்ப்; மேலும் விருப்பங்களுக்கு "நீண்ட பத்திரிகை") </p> <div> <b> எதிரி </b> <img மாற்று = "மான்ச்டர்" src = "monster.png"/> </viv> <p> செய்தி [போரின் போது தோன்றும்] </p> <p> ________________ </p> <H1> போர் </H1> <p> போரின் போது எடுக்கப்பட்ட நடவடிக்கைகள் AP ... </p> <div> <b> தாக்குதல் </b> - [3ap] *</div> <img மாற்று = "தாக்குதல்" src = "doubleattackexample.png" /> <p>* (சித்தப்படுத்துதல் கியர் & ஆம்ப்; உருப்படிகளைப் பயன்படுத்துவது ap & amp; பயன்பாட்டு செலவு) </p> <div> <b> உருப்படிகளைப் பயன்படுத்துதல் </b> - [5ap] </viv> <viv> <b> தப்பி ஓட்டம் </b> - [6ap] </viv> <p> ________________ </p> <H1> மேம்பட்ட போர் </H1> <div> போரின் போது, ​​ஈரோவுக்கு அருகில் ஒரு ஓடு நீண்ட அழுத்தவும் ... </div> <viv> <b> தப்பி ஓட </b> </viv> <p> (தேர்ந்தெடுக்கப்பட்ட ஓடு சிறப்பிக்கப்பட்டுள்ளது - தாக்குதல் பொத்தானை நகர்த்துவதற்கு மாற்றங்கள்) </p> <img மாற்று = "flee" src = "flee_example.png" /> <p> [தப்பி ஓடு பயன்முறை செயல்படுத்தப்பட்டது - மீண்டும் போரில் நுழைய எதிரியை நீண்ட அழுத்தவும்] </p> <div> <b> இலக்குகளை மாற்ற </b> </div> <p> (சிவப்பு இலக்கு எதிரிகளுக்கு இடையில் மாற்றங்களை முன்னிலைப்படுத்துகிறது) </p> <p> [இலக்கு மாற்றப்பட்டுள்ளது] </p> ]]>

# dialog_newversion_title
source: Welcome
ta: வரவேற்கிறோம்

# dialog_newversion_message
source: Thank you for downloading Andor's Trail! Please note that this version of Andor's Trail is a WORK IN PROGRESS, which means that all maps are not yet complete. Please visit the project forums to discuss the game with other players or to help make the game even better (see about). Thanks for all the feedback!
ta: ஆண்டரின் தடத்தை பதிவிறக்கியதற்கு நன்றி! ஆண்டரின் தடத்தின் இந்த பதிப்பு முன்னேற்றத்தில் உள்ளது என்பதை நினைவில் கொள்க, அதாவது எல்லா வரைபடங்களும் இன்னும் முழுமையடையவில்லை. மற்ற வீரர்களுடன் விளையாட்டைப் பற்றி விவாதிக்க அல்லது விளையாட்டை இன்னும் சிறப்பாகச் செய்ய உதவ திட்ட மன்றங்களைப் பார்வையிடவும் (பார்க்கவும்). அனைத்து பின்னூட்டங்களுக்கும் நன்றி!

# dialog_newversion_permission_information
source: In order to save and load your games (and only for this purpose) Andor's Trail will ask you for permission to access your storage.
ta: உங்கள் கேம்களைச் சேமிக்கவும் ஏற்றவும் (இந்த நோக்கத்திற்காக மட்டுமே) ஆண்டரின் பாதை உங்கள் சேமிப்பிடத்தை அணுக இசைவு கேட்கும்.

# dialog_permission_information_title
source: Loading and saving games
ta: விளையாட்டுகளை ஏற்றுதல் மற்றும் சேமித்தல்

# dialog_permission_information
source: Andor's Trail writes saved games to user accessible storage on your device. This allows you to easily back up your saved games or transfer them to a new device. Please visit our forums for more information. Andor's Trail does not use access to your device for any other purpose and does not access the internet. Andor's Trail is open source; the sources can be found on github.
ta: உங்கள் சாதனத்தில் பயனர் அணுகக்கூடிய சேமிப்பகத்திற்கு சேமித்த விளையாட்டுகளை ஆண்டோர் டிரெயில் எழுதுகிறது. இது உங்கள் சேமித்த கேம்களை எளிதாக காப்புப் பிரதி எடுக்க அல்லது அவற்றை புதிய சாதனத்திற்கு மாற்ற அனுமதிக்கிறது. மேலும் தகவலுக்கு எங்கள் மன்றங்களைப் பார்வையிடவும். ஆண்டரின் பாதை உங்கள் சாதனத்திற்கான அணுகலை வேறு எந்த நோக்கத்திற்காகவும் பயன்படுத்தாது, மேலும் இணையத்தை அணுகாது. ஆண்டரின் பாதை திறந்த மூலமாகும்; ஆதாரங்களை கிட்அப்பில் காணலாம்.

# questlog_includecompleted_prompt
source: Select quests to show
ta: காண்பிக்க தேடல்களைத் தேர்ந்தெடுக்கவும்

# questlog_includecompleted_hidecompleted
source: Active quests
ta: செயலில் தேடல்கள்

# questlog_includecompleted_includecompleted
source: All quests
ta: அனைத்து தேடல்களும்

# questlog_includecompleted_onlycompleted
source: Completed quests
ta: நிறைவு செய்யப்பட்ட தேடல்கள்
