Repository: 247i/TACETr
Catalog: உரை/தானி/andors-trail-user-interface-*.po
Languages: ta

# skill_longdescription_armor_prof_heavy
source: For every skill level, increases the block chance of every piece of heavy armor being worn by %1$d %% of their original block chances. Pieces of heavy armor have their movement penalties reduced by %2$d %% per skill level, their attack speed penalties reduced by %3$d %% per skill level, and their item use cost penalties reduced by %4$d %% per skill level. Heavy armors include metal armors, chain mail and plate mail.
ta: ஒவ்வொரு திறன் நிலைக்கும், கனரக கவசத்தின் ஒவ்வொரு பகுதியும் அவற்றின் அசல் தொகுதி வாய்ப்புகளில் 1 $ டி %% அணியப்படுவதற்கான தடுப்பு வாய்ப்பை அதிகரிக்கிறது. கனரக கவசத்தின் துண்டுகள் அவற்றின் இயக்க அபராதங்களை ஒரு திறன் நிலைக்கு %2$d %% குறைக்கின்றன, அவற்றின் தாக்குதல் வேக அபராதங்கள் திறன் நிலைக்கு %3$d %% குறைக்கப்பட்டுள்ளன, மேலும் அவர்களின் உருப்படி பயன்பாட்டு செலவு அபராதங்கள் %4 $ டி %% குறைக்கப்படுகின்றன ஒரு திறன் நிலைக்கு. கனமான கவசங்களில் உலோக கவசங்கள், சங்கிலி அஞ்சல் மற்றும் தட்டு அஞ்சல் ஆகியவை அடங்கும்.

# skill_longdescription_fightstyle_dualwield
source: Gives benefits when fighting with two weapons at the same time, one in the main hand and one in the off-hand. Without this skill, only %1$d %% of a weapon's qualities may be used when equipped in the off-hand. This includes attack chance, critical skill, damage potential and block chance. Without this skill, attack cost (AP cost) of making an attack is the sum of the attack cost of the main weapon and that of the weapon used in the off-hand. The lower of both damage modifiers will be used. With one level of this skill, %2$d %% of the off-hand's weapon's qualities may be used, and the attack cost is the highest attack cost of both weapons plus %3$d %% of the lowest attack cost of both weapons. The average of both damage modifiers will be used. With two levels of this skill, %4$d %% of the off-hand's weapon's qualities may be used, and the attack cost equals the highest of the attack costs of the two equipped weapons. The highest damage modifier will be used.
ta: ஒரே நேரத்தில் இரண்டு ஆயுதங்களுடன் சண்டையிடும்போது நன்மைகளைத் தருகிறது, ஒன்று முதன்மையான கையில் மற்றும் ஒன்று ஆஃப்-கையில். இந்த திறன் இல்லாமல், ஒரு ஆயுதத்தின் குணங்களின் %1$d %% மட்டுமே ஆஃப்-கையில் பொருத்தப்படும்போது பயன்படுத்தப்படலாம். இதில் தாக்குதல் வாய்ப்பு, முக்கியமான திறன், சேதம் திறன் மற்றும் தடுப்பு வாய்ப்பு ஆகியவை அடங்கும். இந்த திறன் இல்லாமல், தாக்குதல் செய்வதற்கான தாக்குதல் செலவு (AP செலவு) என்பது முதன்மையான ஆயுதத்தின் தாக்குதல் செலவு மற்றும் ஆஃப்-கையில் பயன்படுத்தப்படும் ஆயுதத்தின் தொகை ஆகும். இரண்டு சேதம் மாற்றியமைப்பாளர்களின் கீழ் பயன்படுத்தப்படும். இந்த திறமையின் ஒரு மட்டத்துடன், ஆஃப்-ஏண்டின் ஆயுதத்தின் குணங்களின் %2$d %% பயன்படுத்தப்படலாம், மேலும் தாக்குதல் செலவு இரு ஆயுதங்களின் மிக உயர்ந்த தாக்குதல் செலவு மற்றும் இருவரின் மிகக் குறைந்த தாக்குதல் செலவில் %3$d %% ஆயுதங்கள். இரண்டு சேத மாற்றிகளின் சராசரி பயன்படுத்தப்படும். இந்த திறமையின் இரண்டு நிலைகளுடன், ஆஃப்-கை ஆயுதத்தின் குணங்களின் %4 $ டி %% பயன்படுத்தப்படலாம், மேலும் தாக்குதல் செலவு இரண்டு பொருத்தப்பட்ட ஆயுதங்களின் தாக்குதல் செலவுகளில் மிக உயர்ந்ததாக இருக்கும். மிக உயர்ந்த சேத மாற்றி பயன்படுத்தப்படும்.

# skill_longdescription_fightstyle_2hand
source: Gives benefits when using weapons that require both hands to wield, such as two-handed swords, greataxes or giant hammers. Every skill level increases damage potential of two-handed weapons with %1$d %% of the original damage potential.
ta: இரண்டு கை வாள்கள், கிரேடாக்ச் அல்லது மாபெரும் சுத்தியல் போன்ற இரு கைகளையும் பயன்படுத்த வேண்டிய ஆயுதங்களைப் பயன்படுத்தும் போது நன்மைகளைத் தருகிறது. ஒவ்வொரு திறன் மட்டமும் அசல் சேத ஆற்றலின் %1$d %% உடன் இரண்டு கை ஆயுதங்களின் சேத திறனை அதிகரிக்கிறது.

# skill_longdescription_fightstyle_weapon_shield
source: Gives benefits when fighting with a weapon in the main hand and having a shield or parrying weapon equipped in the off-hand. Every skill level increases the attack chance of weapons in the main hand with %1$d %% of their original attack chances, and the block chance of shields or parrying weapons by %2$d %% of their original block chances.
ta: முதன்மையான கையில் ஒரு ஆயுதத்துடன் சண்டையிடும்போது மற்றும் ஒரு கவசம் அல்லது ஆஃப் கையில் கருவி வைத்திருக்கும் போது நன்மைகளைத் தருகிறது. ஒவ்வொரு திறன் மட்டமும் அவர்களின் அசல் தாக்குதல் வாய்ப்புகளின் %1$d %% உடன் முதன்மையான கையில் ஆயுதங்களின் தாக்குதல் வாய்ப்பை அதிகரிக்கிறது, மேலும் கவசங்கள் அல்லது ஆயுதங்களை அவர்களின் அசல் தொகுதி வாய்ப்புகளில் %2$d %% மூலம் விரட்டுவதற்கான தடுப்பு வாய்ப்பு.

# skill_longdescription_fightstyle_unarmed_unarmored
source: While fighting without having any piece of armor equipped and without using a weapon or shield, gain %1$d attack chance, %2$d block chance, %3$d damage resistance and increase the maximum damage by %4$d per skill level. The skill also gives a critical multiplier of 1 plus 0.%5$d per level. Items made of cloth are not considered as being armor.
ta: எந்தவொரு கவசமும் இல்லாமல் போராடும் போது, ​​ஆயுதம் அல்லது கேடயத்தைப் பயன்படுத்தாமல், %1$d தாக்குதல் வாய்ப்பு, %2$d தொகுதி வாய்ப்பு, %3$d சேத எதிர்ப்பு மற்றும் அதிகபட்ச சேதத்தை ஒரு திறமைக்கு %4 $ டி அதிகரிக்கும் நிலை. திறமை ஒரு நிலைக்கு 1 மற்றும் 0.%5 $ டி என்ற முக்கியமான பெருக்கத்தையும் வழங்குகிறது. துணியால் செய்யப்பட்ட பொருட்கள் கவசமாக கருதப்படுவதில்லை.

# skill_longdescription_specialization_dualwield
source: Increases the attack chance of both wielded weapons by an additional %1$d %% of their original attack chances, in addition to the benefits given by the weapon style skill. The block chances of both wielded weapons are also increased by %2$d %% of their original block chances.
ta: கருவி பாணி திறமை வழங்கும் நன்மைகளுக்கு மேலதிகமாக, இரு ஆயுதங்களின் தாக்குதல் வாய்ப்பை அவர்களின் அசல் தாக்குதல் வாய்ப்புகளில் கூடுதல் %1$d %% மூலம் அதிகரிக்கிறது. இரண்டு ஆயுதங்களின் தொகுதி வாய்ப்புகளும் அவற்றின் அசல் தொகுதி வாய்ப்புகளின் %2$d %% ஆல் அதிகரிக்கப்படுகின்றன.

# skill_longdescription_specialization_2hand
source: Increases damage potential of two-handed weapons by an additional %1$d %% of the original damage potential, in addition to the benefits given by the weapon style skill. The attack chances of two-handed weapons are also increased by %2$d %% of their original attack chances.
ta: ஆயுத பாணி திறனால் வழங்கப்படும் நன்மைகளுக்கு மேலதிகமாக, அசல் சேத ஆற்றலின் கூடுதல் %1$d %% மூலம் இரண்டு கை ஆயுதங்களின் சேத திறனை அதிகரிக்கிறது. இரண்டு கை ஆயுதங்களின் தாக்குதல் வாய்ப்புகளும் அவற்றின் அசல் தாக்குதல் வாய்ப்புகளில் %2$d %% அதிகரிக்கப்படுகின்றன.

# skill_longdescription_specialization_weapon_shield
source: Increases both attack chances and damage potential of weapons in the main hand. The attack chance is increased by %1$d %% of the original attack chance, and the damage potential is increased by %2$d %% of the original damage potential.
ta: தாக்குதல் வாய்ப்புகள் மற்றும் முதன்மையான கையில் ஆயுதங்களின் சேத ஆற்றல் இரண்டையும் அதிகரிக்கிறது. தாக்குதல் வாய்ப்பு அசல் தாக்குதல் வாய்ப்பின் %1$d %% அதிகரிக்கப்படுகிறது, மேலும் சேத ஆற்றல் அசல் சேத ஆற்றலின் %2$d %% அதிகரிக்கப்படுகிறது.

# skill_longdescription_weapon_prof_pole
source: For each skill level, increases attack chance when using pole weapons by %1$d %% of the item's base attack chance, increases block chance by %2$d %% of the item's base block chance, and increases critical skill by %3$d %% of the item's base critical skill.
ta: ஒவ்வொரு திறன் நிலைக்கும், துருவ ஆயுதங்களைப் பயன்படுத்தும் போது தாக்குதல் வாய்ப்பை அதிகரிக்கிறது, உருப்படியின் அடிப்படை தாக்குதல் வாய்ப்பின் %1$d %%, பிளாக் வாய்ப்பை %2$d %% அதிகரிக்கிறது, மேலும் முக்கியமான திறனை %3 ஆல் அதிகரிக்கிறது உருப்படியின் அடிப்படை முக்கியமான திறனின் $ டி %%.

# preferences_quickslots_placement
source: Quickslot position
ta: குவிகச்லாட் நிலை

# preferences_quickslots_placement_summary
source: Where to place the quickslots
ta: குவிக்ச்லாட்களை எங்கே வைக்க வேண்டும்

# preferences_quickslots_placements_horizontal_center_bottom
source: Center bottom
ta: நடுவண் கீழே

# preferences_quickslots_placements_vertical_center_left
source: Middle left
ta: நடுத்தர இடது

# preferences_quickslots_placements_vertical_center_right
source: Middle right
ta: நடுத்தர வலது

# preferences_quickslots_placements_vertical_bottom_left
source: Bottom left, along left border
ta: கீழே இடது, இடது எல்லையுடன்

# preferences_quickslots_placements_horizontal_bottom_left
source: Bottom left, along bottom border
ta: கீழே இடது, கீழ் எல்லையில்

# preferences_quickslots_placements_horizontal_bottom_right
source: Bottom right, along bottom border
ta: கீழ் வலது, கீழ் எல்லையில்

# preferences_quickslots_placements_vertical_bottom_right
source: Bottom right, along right border
ta: கீழ் வலது, வலது எல்லையுடன்

# preferences_ui_show_quickslots_when_toolbox_is_visible_title
source: Show quickslots when toolbox is opened
ta: கருவிப்பெட்டி திறக்கப்படும் போது குவிகச்லாட்டுகளைக் காட்டு

# preferences_ui_show_quickslots_when_toolbox_is_visible
source: Makes the quickslot buttons be displayed as soon as the toolbox is opened
ta: கருவிப்பெட்டி திறந்தவுடன் குவிகச்லாட் பொத்தான்கள் காண்பிக்கப்படும்

# startscreen_incompatible_savegames
source: This is a development version of Andor's Trail. Savegames produced by this version are incompatible with the release version.
ta: இது ஆண்டரின் தடத்தின் மேம்பாட்டு பதிப்பாகும். இந்த பதிப்பால் தயாரிக்கப்பட்ட சேவ் கேம்ச் வெளியீட்டு பதிப்போடு பொருந்தாது.

# startscreen_non_release_version
source: This is a prerelease version of Andor's Trail. Savegames produced by this version might not be compatible with the release version.
ta: இது ஆண்டரின் தடத்தின் முன்னுரை பதிப்பாகும். இந்த பதிப்பால் தயாரிக்கப்பட்ட சேவ் கேம்ச் வெளியீட்டு பதிப்போடு பொருந்தாது.

# heroinfo_gamestats
source: Game statistics
ta: விளையாட்டு புள்ளிவிவரங்கள்

# heroinfo_gamestats_quests
source: Completed quests
ta: நிறைவு செய்யப்பட்ட தேடல்கள்

# heroinfo_gamestats_deaths
source: Times fallen unconscious
ta: நேரம் மயக்கமடைந்தது

# heroinfo_gamestats_spent_gold
source: Gold spent in shops
ta: கடைகளில் தங்கம் கழித்தது

# heroinfo_gamestats_bonemeals
source: Bonemeal potions used
ta: பயன்படுத்தப்படும் போன்மீல் போசன்கள்

# heroinfo_gamestats_num_used_items
source: Items used
ta: பயன்படுத்தப்படும் உருப்படிகள்

# heroinfo_gamestats_visited_maps
source: Places visited
ta: பார்வையிட்ட இடங்கள்

# heroinfo_gamestats_fav_item
source: Most commonly used item
ta: பொதுவாக பயன்படுத்தப்படும் உருப்படி

# heroinfo_gamestats_num_killed_monsters
source: Monsters killed
ta: அரக்கர்கள் கொல்லப்பட்டனர்

# heroinfo_gamestats_top_boss
source: Most powerful monster killed
ta: மிகவும் சக்திவாய்ந்த அரக்கன் கொல்லப்பட்டான்

# heroinfo_gamestats_fav_monsters
source: Most commonly killed monsters
ta: பொதுவாக அரக்கர்கள் கொல்லப்பட்டனர்

# preferences_ui_use_localized_resources_title
source: Use localized resources
ta: உள்ளூர்மயமாக்கப்பட்ட வளங்களைப் பயன்படுத்துங்கள்

# preferences_ui_use_localized_resources
source: Use translation of interface and content, where available. (requires restart)
ta: இடைமுகம் மற்றும் உள்ளடக்கத்தின் மொழிபெயர்ப்பைப் பயன்படுத்தவும். (மறுதொடக்கம் தேவை)

# change_locale_requires_restart
source: Changing locale requires restart. Andor's Trail has been closed.
ta: இருப்பிடத்தை மாற்ற மறுதொடக்கம் தேவை. ஆண்டரின் பாதை மூடப்பட்டுள்ளது.

# inventory_category_all
source: All
ta: அனைத்தும்

# inventory_category_favorites
source: Favorites
ta: பிடித்தவை

# inventory_category_weapons
source: Weapon
ta: கருவி

# inventory_category_armor
source: Armor
ta: கவசம்

# inventory_category_jewelry
source: Jewelry
ta: நகைகள்

# inventory_category_potion
source: Potion
ta: போசன்

# inventory_category_food
source: Food
ta: உணவு

# inventory_category_quest
source: Quest Item
ta: தேடல் உருப்படி

# inventory_category_usable
source: Usable
ta: பயன்படுத்தக்கூடியது

# inventory_category_other
source: Other
ta: மற்றொன்று

# inventory_sort_custom
source: Unsorted
ta: வரிசைப்படுத்தப்படாதது

# inventory_sort_name
source: Name
ta: பெயர்

# inventory_sort_price
source: Price
ta: விலை

# inventory_sort_quantity
source: Quantity
ta: அளவு

# inventory_sort_rarity
source: Rarity
ta: அரிதானது

# inventory_sort_type
source: Type
ta: வகை

# shoplist_sort_custom
source: Unsorted
ta: வரிசைப்படுத்தப்படாதது

# shoplist_sort_name
source: Name
ta: பெயர்

# shoplist_sort_price
source: Price
ta: விலை

# shoplist_sort_quantity
source: Quantity
ta: அளவு

# shoplist_sort_rarity
source: Rarity
ta: அரிதானது

# shoplist_sort_type
source: Type
ta: வகை

# skill_category_all
source: All
ta: அனைத்தும்

# skill_category_offense
source: Offense
ta: குற்றம்

# skill_category_defense
source: Defense
ta: பாதுகாப்பு

# skill_category_criticals
source: Criticals
ta: விமர்சகர்கள்

# skill_category_immunity
source: Immunity
ta: நோய் எதிர்ப்பு ஆற்றல்

# skill_category_utility
source: Utility
ta: பயன்பாடு

# skill_category_speciality
source: Speciality
ta: சிறப்பு

# skill_category_proficiency
source: Proficiency
ta: தேர்ச்சி

# skill_sort_unsorted
source: Unsorted
ta: வரிசைப்படுத்தப்படாதது

# skill_sort_name
source: Name
ta: பெயர்

# skill_sort_points
source: Points
ta: பிரிவகம்

# skill_sort_unlocked
source: Unlocked
ta: திறக்கப்பட்டது

# preferences_display_theme_title
source: Theme
ta: கருப்பொருள்

# preferences_display_theme
source: Choose the UI theme. (requires restart)
ta: இடைமுகம் கருப்பொருள் தேர்வு செய்யவும். (மறுதொடக்கம் தேவை)

# preferences_display_theme_blue
source: Cobalt
ta: மென்வெள்ளி

# preferences_display_theme_green
source: Malachite
ta: மலாக்கிட்

# preferences_display_theme_charcoal
source: Obsidian
ta: அப்சிடியன்

# change_theme_requires_restart
source: Changing UI theme requires restart. Andor's Trail has been closed.
ta: இடைமுகம் கருப்பொருள் மாற்ற மறுதொடக்கம் தேவை. ஆண்டரின் பாதை மூடப்பட்டுள்ளது.

# storage_permissions_mandatory
source: Access to storage is mandatory for Andor's Trail to handle saved games and worldmap. Closing Andor's Trail.
ta: சேமித்த விளையாட்டுகள் மற்றும் வேர்ல்ட்மேப்பைக் கையாள ஆண்டரின் பாதைக்கு சேமிப்பகத்திற்கான அணுகல் கட்டாயமாகும். ஆண்டரின் தடத்தை மூடுவது.

# skill_title_spore_immunity
source: Spore poison immunity
ta: வித்து விச நோய் எதிர்ப்பு ஆற்றல்

# skill_shortdescription_spore_immunity
source: Full immunity to spore poison
ta: வித்து விசத்திற்கு முழு நோய் எதிர்ப்பு ஆற்றல்

# skill_longdescription_spore_immunity
source: Permanently prevents monster attacks from inflicting the Spore poisoning status effect.
ta: வித்து நஞ்சு நிலை விளைவை ஏற்படுத்துவதை அரக்கன் தாக்குதல்கள் நிரந்தரமாகத் தடுக்கிறது.

# preferences_movement_dpad_transparency_title
source: D-pad transparency
ta: டி-பேட் வெளிப்படைத்தன்மை

# preferences_movement_dpad_transparency
source: If the virtual d-pad is enabled, this setting determines how transparent it should be.
ta: மெய்நிகர் டி-பேட் இயக்கப்பட்டிருந்தால், இந்த அமைப்பு அது எவ்வளவு வெளிப்படையாக இருக்க வேண்டும் என்பதை தீர்மானிக்கிறது.

# monsterinfo_killcount
source: Previous kills
ta: முந்தைய பலி
