Repository: 247i/TACETr
Catalog: உரை/தானி/andors-trail-user-interface-*.po
Languages: ta

# loadsave_import_existing_description
source: Existing save: Slot: %1$s: %2$s
ta: இருக்கும் சேமிப்பு: ச்லாட்: %1 $ s: %2 $ கள்

# loadsave_import_imported_description
source: Imported save: Slot: %1$s: %2$s
ta: இறக்குமதி செய்யப்பட்ட சேமிப்பு: ச்லாட்: %1 $ s: %2 $ கள்

# loadsave_import_worldmap
source: Import worldmap
ta: உலகப் வரைபடத்தை இறக்குமதி செய்யுங்கள்

# loadsave_import_worldmap_info
source: Please select the Worldmap zip file.
ta: வேர்ல்ட்மேப் சிப் கோப்பைத் தேர்ந்தெடுக்கவும்.

# loadsave_importing_worldmap
source: Importing worldmap
ta: வேர்ல்ட்மேப்பை இறக்குமதி செய்கிறது

# loadsave_import_worldmap_successfull
source: Import of Worldmap successful
ta: வேர்ல்ட்மேப் இறக்குமதி வெற்றிகரமாக

# loadsave_import_worldmap_unsuccessfull
source: Import of Worldmap unsuccessful
ta: வேர்ல்ட்மேப்பின் இறக்குமதி தோல்வியுற்றது

# loadsave_import_worldmap_wrong_file
source: Are you sure you selected a worldmap? Please select the zip file called 'worldmap.zip' that was exported into your export location.
ta: நீங்கள் ஒரு உலக வரைபடத்தைத் தேர்ந்தெடுத்தீர்களா? உங்கள் ஏற்றுமதி இடத்தில் ஏற்றுமதி செய்யப்பட்ட 'உலக MAP.ZIP' எனப்படும் சிப் கோப்பைத் தேர்ந்தெடுக்கவும்.

# loadsave_import_worldmap_wrong_directory
source: - obsolete -
ta: - வழக்கற்றுப் போன -

# iteminfo_displaytypes_ordinary
source: Ordinary
ta: சாதாரண

# iteminfo_displaytypes_quest
source: Quest item
ta: தேடல் உருப்படி

# iteminfo_displaytypes_legendary
source: Legendary
ta: புகழ்பெற்ற

# iteminfo_displaytypes_extraordinary
source: Extraordinary
ta: சிறப்பான

# iteminfo_displaytypes_rare
source: Rare
ta: அரிய

# actorconditioninfo_category
source: Condition category: %1$s
ta: நிபந்தனை வகை: %1 $ s

# actorcondition_categories_spiritual
source: Spiritual
ta: ஆன்மீக

# actorcondition_categories_mental
source: Mental
ta: மன

# actorcondition_categories_physical
source: Physical Capacity
ta: உடல் திறன்

# actorcondition_categories_blood
source: Blood Disorder
ta: இரத்தக் கோளாறு

# traitsinfo_base_max_hp
source: Max HP:
ta: அதிகபட்ச எச்பி:

# traitsinfo_base_max_ap
source: Max AP:
ta: அதிகபட்ச AP:

# menu_save_saving_not_allowed_in_combat
source: Cannot save the game while in combat.
ta: போரில் இருக்கும்போது விளையாட்டைச் சேமிக்க முடியாது.

# menu_save_switch_character_title
source: Switch character
ta: எழுத்துக்குறி சுவிட்ச்

# menu_save_switch_character
source: Saving allows you to switch to another character and later continue the current game. Do you want to save and exit the current game?
ta: சேமிப்பு மற்றொரு கதாபாத்திரத்திற்கு மாறவும் பின்னர் தற்போதைய விளையாட்டைத் தொடரவும் உங்களை அனுமதிக்கிறது. தற்போதைய விளையாட்டை சேமித்து வெளியேற விரும்புகிறீர்களா?

# preferences_optimized_drawing_title
source: Optimized drawing
ta: உகந்த வரைதல்

# preferences_optimized_drawing
source: Disable this if you see graphical artifacts. Enabling this option will make the game only redraw changed parts of the screen every frame.
ta: நீங்கள் வரைகலை கலைப்பொருட்களைக் கண்டால் இதை முடக்கு. இந்த விருப்பத்தை இயக்குவது விளையாட்டை ஒவ்வொரு சட்டகத்தையும் திரையின் மாற்றியமைக்கும் பகுதிகளை மட்டுமே மாற்றும்.

# preferences_high_quality_filters_title
source: High quality filters
ta: உயர் தரமான வடிப்பான்கள்

# preferences_high_quality_filters
source: Disable this if you experience performance issues on filtered maps (dark caves for example). Enabling this option will make the game use advanced color filters, instead of solid color overlays.
ta: வடிகட்டப்பட்ட வரைபடங்களில் செயல்திறன் சிக்கல்களை நீங்கள் அனுபவித்தால் இதை முடக்கு (எடுத்துக்காட்டாக இருண்ட குகைகள்). இந்த விருப்பத்தை இயக்குவது திட வண்ண மேலடுக்குகளுக்கு பதிலாக, விளையாட்டு மேம்பட்ட வண்ண வடிப்பான்களைப் பயன்படுத்தும்.

# skill_title_shadow_bless
source: Dark blessing of the Shadow
ta: நிழலின் இருண்ட வாழ்த்து

# skill_shortdescription_shadow_bless
source: Resistance against all types of conditions
ta: அனைத்து வகையான நிலைமைகளுக்கு எதிரான எதிர்ப்பு

# skill_longdescription_shadow_bless
source: Lowers the chance of being afflicted with all types of conditions by %1$d %%. This includes all types of conditions caused by monster attacks such as Poison, Dazed or Fatigue.
ta: அனைத்து வகையான நிலைமைகளாலும் பாதிக்கப்படுவதற்கான வாய்ப்பை %1 $ டி %% குறைக்கிறது. நஞ்சு, திகைத்துப்போன அல்லது சோர்வு போன்ற அரக்கன் தாக்குதல்களால் ஏற்படும் அனைத்து வகையான நிலைமைகளும் இதில் அடங்கும்.

# inventory_movetop
source: Move to top
ta: மேலே செல்லுங்கள்

# inventory_movebottom
source: Move to bottom
ta: கீழே செல்லுங்கள்

# actorinfo_immune_criticals
source: Immune to critical hits
ta: விமர்சன வெற்றிகளுக்கு நோய் எதிர்ப்பு ஆற்றல்

# traitsinfo_criticalhit_effectivechance
source: Effective critical chance:
ta: பயனுள்ள சிக்கலான வாய்ப்பு:

# skill_title_crit1
source: Internal bleeding
ta: உள் இரத்தப்போக்கு

# skill_shortdescription_crit1
source: Chance of internal bleeding
ta: உள் இரத்தப்போக்கு வாய்ப்பு

# skill_longdescription_crit1
source: For every critical hit made, there is a %1$d %% chance that the hit will cause internal bleeding on the target, effectively causing the 'Internal bleeding' condition on the target. Internal bleeding severely lowers offensive combat abilities, making the target less able to land successful attacks.
ta: செய்யப்பட்ட ஒவ்வொரு முக்கியமான வெற்றிக்கும், ஒரு %1 $ டி %% வாய்ப்பு உள்ளது, இது இலக்கை நோக்கி உள் இரத்தப்போக்கை ஏற்படுத்தும், இது இலக்கில் 'உள் இரத்தப்போக்கு' நிலையை திறம்பட ஏற்படுத்தும். உள் இரத்தப்போக்கு தாக்குதல் போர் திறன்களை கடுமையாகக் குறைக்கிறது, இதனால் இலக்கு வெற்றிகரமான தாக்குதல்களை தரையிறக்க முடியும்.

# skill_title_crit2
source: Fracture
ta: எலும்பு முறிவு

# skill_shortdescription_crit2
source: Chance of bone fracture
ta: எலும்பு முறிவு வாய்ப்பு

# skill_longdescription_crit2
source: For every critical hit made, there is a %1$d %% chance that the hit will fracture some of the target's bones, effectively causing the 'Fracture' condition on the target. This will severely lower the target's defensive combat abilities, making it less able to defend itself in subsequent attacks.
ta: செய்யப்பட்ட ஒவ்வொரு முக்கியமான வெற்றிக்கும், ஒரு %1 $ டி %% வாய்ப்பு உள்ளது, இது இலக்கின் சில எலும்புகளை முறித்துக் கொள்ளும், இது இலக்கில் 'எலும்பு முறிவு' நிலையை திறம்பட ஏற்படுத்தும். இது இலக்கின் தற்காப்பு போர் திறன்களைக் கடுமையாகக் குறைக்கும், இதனால் அடுத்தடுத்த தாக்குதல்களில் தன்னைப் பாதுகாத்துக் கொள்ளக் கூடியதாக இருக்கும்.

# skill_title_rejuvenation
source: Rejuvenation
ta: புத்துணர்ச்சி

# skill_shortdescription_rejuvenation
source: Chance of effect removal
ta: விளைவு அகற்ற வாய்ப்பு

# skill_longdescription_rejuvenation
source: Every round (6 seconds), there is a %1$d %% chance that one of the active negative actor conditions will be lowered by one magnitude. This applies to all temporary effect types that affect the body; mental conditions such as Dazed, physical capacity conditions such as Fatigue and also blood disorders such as poison.
ta: ஒவ்வொரு சுற்றிலும் (6 வினாடிகள்), செயலில் உள்ள எதிர்மறை நடிகர் நிலைமைகளில் ஒன்று ஒரு அளவால் குறைக்கப்படுவதற்கான %1 $ டி %% வாய்ப்பு உள்ளது. உடலை பாதிக்கும் அனைத்து தற்காலிக விளைவு வகைகளுக்கும் இது பொருந்தும்; திகைப்பூட்டும், சோர்வு போன்ற உடல் திறன் நிலைமைகள் மற்றும் நஞ்சு போன்ற இரத்தக் கோளாறுகள் போன்ற மன நிலைமைகள்.

# skill_title_taunt
source: Taunt
ta: கேலி

# skill_shortdescription_taunt
source: Attacker loses AP on miss
ta: தாக்குபவர் மிச் மீது AP ஐ இழக்கிறார்

# skill_longdescription_taunt
source: When an attacker makes an attack that misses, there is a %1$d %% chance that the attacker loses %2$d action points (AP). This applies to all types of melee attacks against you.
ta: தாக்குபவர் தாக்கும் தாக்குதலைச் செய்யும்போது, ​​தாக்குபவர் %2 $ டி அதிரடி புள்ளிகளை (AP) இழக்க ஒரு %1 $ டி %% வாய்ப்பு உள்ளது. உங்களுக்கு எதிரான அனைத்து வகையான கைகலப்பு தாக்குதல்களுக்கும் இது பொருந்தும்.

# skill_title_concussion
source: Concussion
ta: மூளையதிர்ச்சி

# skill_shortdescription_concussion
source: Chance of concussion
ta: மூளையதிர்ச்சி வாய்ப்பு

# skill_longdescription_concussion
source: When making an attack on a target whose block chance (BC) is at least %1$d lower than your attack chance (AC), there is a %2$d %% chance that the hit will cause a concussion on the target. A concussion will severely lower the target's offensive combat abilities, making the target less able to land successful attacks.
ta: உங்கள் தாக்குதல் வாய்ப்பை (ஏசி) விட குறைந்தது %1 $ டி குறைவாக இருக்கும் ஒரு இலக்கு மீது தாக்குதலைச் செய்யும்போது, ​​இந்த செய் இலக்கில் ஒரு மூளையதிர்ச்சியை ஏற்படுத்தும் என்று %2 $ டி %% வாய்ப்பு உள்ளது. ஒரு மூளையதிர்ச்சி இலக்கின் தாக்குதல் போர் திறன்களைக் கடுமையாகக் குறைக்கும், இதனால் இலக்கு வெற்றிகரமான தாக்குதல்களைத் தரும்.

# about_button4
source: About
ta: பற்றி

# preferences_ui_category
source: Interface
ta: இடைமுகம்

# preferences_ui_enable_animations_title
source: Enable animations
ta: அனிமேசன்களை இயக்கவும்

# preferences_ui_enable_animations
source: Show animations for various interface elements, such as the combat bar.
ta: காம்பாட் பார் போன்ற பல்வேறு இடைமுக கூறுகளுக்கான அனிமேசன்களைக் காட்டு.

# menu_button_worldmap
source: Map
ta: வரைபடம்

# menu_button_worldmap_failed
source: Map cannot be displayed.
ta: வரைபடத்தைக் காட்ட முடியாது.

# display_worldmap_not_available
source: The map cannot be displayed from this location.
ta: இந்த இடத்திலிருந்து வரைபடத்தைக் காட்ட முடியாது.

# display_worldmap_title
source: Map
ta: வரைபடம்

# inventory_equip_offhand
source: Equip (offhand)
ta: உபகரணங்கள் (ஆஃப்ஏண்ட்)

# iteminfo_effect_weapon_attack_cost
source: Attack cost: %1$d AP
ta: தாக்குதல் செலவு: %1 $ டி AP

# iteminfo_effect_increase_attack_cost
source: Increases attack cost by %1$d AP
ta: தாக்குதல் செலவை %1 $ டி AP அதிகரிக்கிறது

# iteminfo_effect_decrease_attack_cost
source: Lowers attack cost by %1$d AP
ta: தாக்குதல் செலவை %1 $ டி AP குறைக்கிறது

# iteminfo_effect_weapon_attack_chance
source: Attack chance: %1$d
ta: தாக்குதல் வாய்ப்பு: %1 $ டி

# iteminfo_effect_increase_attack_chance
source: Increases attack chance by %1$d
ta: தாக்குதல் வாய்ப்பை %1 $ டி ஆல் அதிகரிக்கிறது

# iteminfo_effect_decrease_attack_chance
source: Lowers attack chance by %1$d
ta: தாக்குதல் வாய்ப்பை %1 $ டி ஐ குறைக்கிறது

# iteminfo_effect_weapon_attack_damage
source: Attack damage: %1$d
ta: தாக்குதல் சேதம்: %1 $ டி

# iteminfo_effect_weapon_attack_damage_minmax
source: Attack damage: %1$d-%2$d
ta: தாக்குதல் சேதம்: %1 $ d- %2 $ டி

# iteminfo_effect_increase_attack_damage
source: Increases attack damage by %1$d
ta: தாக்குதல் சேதத்தை %1 $ டி மூலம் அதிகரிக்கிறது

# iteminfo_effect_set_damage_modifier
source: Damage modifier: %1$d%%
ta: சேத மாற்றி:%1 $ டி %%

# iteminfo_effect_increase_attack_damage_minmax
source: Increases attack damage by %1$d-%2$d
ta: தாக்குதல் சேதத்தை %1 $ d- %2 $ டி மூலம் அதிகரிக்கிறது

# iteminfo_effect_decrease_attack_damage
source: Lowers attack damage by %1$d
ta: தாக்குதல் சேதத்தை %1 $ டி மூலம் குறைக்கிறது

# iteminfo_effect_decrease_attack_damage_minmax
source: Lowers attack damage by %1$d-%2$d
ta: தாக்குதல் சேதத்தை %1 $ d- %2 $ டி குறைக்கிறது

# iteminfo_effect_increase_critical_skill
source: Increases critical skill by %1$d
ta: முக்கியமான திறனை %1 $ டி மூலம் அதிகரிக்கிறது

# iteminfo_effect_decrease_critical_skill
source: Lowers critical skill by %1$d
ta: விமர்சன திறன்களை %1 $ டி மூலம் குறைக்கவும்

# iteminfo_effect_critical_multiplier
source: Enables critical hits with a multiplier of x%1$.1f
ta: X%1 $ .1f இன் பெருக்கத்துடன் விமர்சன வெற்றிகளை இயக்குகிறது

# iteminfo_effect_increase_block_chance
source: Increases block chance by %1$d
ta: தொகுதி வாய்ப்பை %1 $ டி மூலம் அதிகரிக்கிறது

# iteminfo_effect_decrease_block_chance
source: Lowers block chance by %1$d
ta: தடுப்பு வாய்ப்பை %1 $ டி ஐ குறைக்கிறது

# iteminfo_effect_increase_damage_resistance
source: Raises damage resistance by %1$d
ta: சேத எதிர்ப்பை %1 $ டி ஆல் உயர்த்துகிறது

# iteminfo_effect_decrease_damage_resistance
source: Lowers damage resistance by %1$d
ta: சேத எதிர்ப்பை %1 $ டி மூலம் குறைக்கிறது

# iteminfo_effect_increase_use_cost
source: Increases AP cost of using items in combat by %1$d AP
ta: போரில் உள்ள பொருட்களைப் பயன்படுத்துவதற்கான AP செலவை %1 $ டி AP ஆல் அதிகரிக்கிறது

# iteminfo_effect_decrease_use_cost
source: Lowers AP cost of using items in combat by %1$d AP
ta: போரில் உள்ள பொருட்களைப் பயன்படுத்துவதற்கான AP செலவைக் குறைக்கிறது %1 $ டி ap

# iteminfo_effect_increase_reequip_cost
source: Increases AP cost of equipping items in combat by %1$d AP
ta: போரில் பொருட்களை சித்தப்படுத்துவதற்கான AP செலவை %1 $ டி AP ஆல் அதிகரிக்கிறது

# iteminfo_effect_decrease_reequip_cost
source: Lowers AP cost of equipping items in combat by %1$d AP
ta: போரில் பொருட்களை சித்தப்படுத்துவதற்கான AP செலவைக் குறைக்கிறது %1 $ டி ap

# loadsave_save_overwrite_confirmation_all
source: Are you sure you want to overwrite this savegame?
ta: இந்த சேவ் கேமை மேலெழுத விரும்புகிறீர்களா?

# loadsave_save_overwrite_confirmation_slot
source: (slot %1$d)
ta: (ச்லாட் %1 $ d)

# loadsave_empty_slot
source: %1$d.<empty>
ta: %1 $ d. <வெற்று>

# preferences_display_overwrite_savegame_entries_always_confirm
source: Always show confirmation dialog box
ta: உறுதிப்படுத்தல் உரையாடல் பெட்டியை எப்போதும் காட்டு

# preferences_display_overwrite_savegame_entries_confirm_overwrite
source: Only show when overwriting a different playername
ta: வேறுபட்ட விளையாட்டுத் பெயரை மேலெழுதும்போது மட்டுமே காண்பி

# preferences_display_overwrite_savegame_entries_never_confirm
source: Never display confirmation dialog box
ta: உறுதிப்படுத்தல் உரையாடல் பெட்டியை ஒருபோதும் காட்ட வேண்டாம்

# preferences_dialog_overwrite_savegame_title
source: Confirm overwriting savegames
ta: சேமிப்பகங்களை மேலெழுதும் உறுதிப்படுத்தவும்

# preferences_dialog_overwrite_savegame
source: Gives a question about whether you want to overwrite when saving to a savegame slot that already contains a savegame.
ta: ஏற்கனவே ஒரு சேவ் கேம் கொண்ட ஒரு சேவ் கேம் ச்லாட்டுக்கு சேமிக்கும்போது நீங்கள் மேலெழுத விரும்புகிறீர்களா என்பது பற்றி ஒரு கேள்வியைத் தருகிறது.

# heroinfo_reequip_cost
source: Re-equip cost (AP):
ta: Repip Cost (AP):

# heroinfo_useitem_cost
source: Use item cost (AP):
ta: உருப்படி செலவைப் பயன்படுத்தவும் (AP):

# combat_result_monstermoved
source: %1$s moves.
ta: %1 $ s நகர்வுகள்.

# combat_log_title
source: Combat log
ta: போர் பதிவு

# combat_log_noentries
source: No entries yet.
ta: இன்னும் உள்ளீடுகள் இல்லை.

# conversation_reward_quest_finished
source: [Quest completed: "%1$s"]
ta: [குவெச்ட் முடிந்தது: "%1 $ s"]

# conversation_reward_quest_updated
source: [Quest updated: "%1$s"]
ta: [குவெச்ட் புதுப்பிக்கப்பட்டது: "%1 $ s"]

# skill_title_weapon_prof_dagger
source: Dagger proficiency
ta: டாகர் தேர்ச்சி

# skill_title_weapon_prof_1hsword
source: One-handed sword proficiency
ta: ஒரு கை வாள் தேர்ச்சி

# skill_title_weapon_prof_2hsword
source: Two-handed sword proficiency
ta: இரண்டு கை வாள் தேர்ச்சி

# skill_title_weapon_prof_axe
source: Axe proficiency
ta: கோடாரி புலமை

# skill_title_weapon_prof_blunt
source: Blunt weapon proficiency
ta: அப்பட்டமான ஆயுத தேர்ச்சி

# skill_title_weapon_prof_unarmed
source: Unarmed fighting
ta: நிராயுதபாணியான சண்டை

# skill_title_armor_prof_shield
source: Shield proficiency
ta: கவச தேர்ச்சி

# skill_title_armor_prof_unarmored
source: Unarmored fighting
ta: தீங்கு விளைவிக்காத சண்டை

# skill_title_armor_prof_light
source: Light armor proficiency
ta: ஒளி கவச தேர்ச்சி

# skill_title_armor_prof_heavy
source: Heavy armor proficiency
ta: கனமான கவச தேர்ச்சி

# skill_title_fightstyle_dualwield
source: Fighting style: Dual wield
ta: சண்டை நடை: இரட்டை வீக்கம்

# skill_title_fightstyle_2hand
source: Fighting style: Two-handed weapon
ta: சண்டை நடை: இரண்டு கை கருவி

# skill_title_fightstyle_weapon_shield
source: Fighting style: Weapon and shield
ta: சண்டை நடை: கருவி மற்றும் கேடயம்

# skill_title_fightstyle_unarmed_unarmored
source: Fighting style: Way of the monk
ta: சண்டை நடை: துறவியின் வழி

# skill_title_specialization_dualwield
source: Specialization: Dual wield
ta: நிபுணத்துவம்: இரட்டை வீக்கம்

# skill_title_specialization_2hand
source: Specialization: Two-handed weapon
ta: சிறப்பு: இரண்டு கை கருவி

# skill_title_specialization_weapon_shield
source: Specialization: Weapon and shield
ta: சிறப்பு: கருவி மற்றும் கேடயம்

# skill_title_weapon_prof_pole
source: Pole weapon proficiency
ta: துருவ ஆயுத தேர்ச்சி

# skill_shortdescription_weapon_prof_dagger
source: Better at fighting with daggers
ta: குண்டிகளுடன் சண்டையிடுவதில் சிறந்தது

# skill_shortdescription_weapon_prof_1hsword
source: Better at fighting with one-handed swords
ta: ஒரு கை வாள்களுடன் சண்டையிடுவதில் சிறந்தது

# skill_shortdescription_weapon_prof_2hsword
source: Better at fighting with two-handed swords
ta: இரண்டு கை வாள்களுடன் சண்டையிடுவதில் சிறந்தது

# skill_shortdescription_weapon_prof_axe
source: Better at fighting with axes
ta: அச்சுகளுடன் சண்டையிடுவதில் சிறந்தது

# skill_shortdescription_weapon_prof_blunt
source: Better at fighting with blunt weapons
ta: அப்பட்டமான ஆயுதங்களுடன் சண்டையிடுவது சிறந்தது

# skill_shortdescription_weapon_prof_unarmed
source: Better at fighting without weapons
ta: ஆயுதங்கள் இல்லாமல் சண்டையிடுவது சிறந்தது

# skill_shortdescription_armor_prof_shield
source: Make better use of shields and parrying weapons
ta: கேடயங்கள் மற்றும் பாரிங் ஆயுதங்களை சிறப்பாகப் பயன்படுத்துங்கள்

# skill_shortdescription_armor_prof_unarmored
source: Better at fighting without armor
ta: கவசம் இல்லாமல் சண்டையிடுவதில் சிறந்தது

# skill_shortdescription_armor_prof_light
source: Make better use of light armor
ta: ஒளி கவசத்தை சிறப்பாகப் பயன்படுத்துங்கள்

# skill_shortdescription_armor_prof_heavy
source: Make better use of heavy armor
ta: கனமான கவசத்தை சிறப்பாகப் பயன்படுத்துங்கள்

# skill_shortdescription_fightstyle_dualwield
source: Wield two weapons at the same time
ta: ஒரே நேரத்தில் இரண்டு ஆயுதங்களைப் பயன்படுத்துங்கள்

# skill_shortdescription_fightstyle_2hand
source: Make better use of weapons that require both hands
ta: இரு கைகளும் தேவைப்படும் ஆயுதங்களை சிறப்பாகப் பயன்படுத்துங்கள்

# skill_shortdescription_fightstyle_weapon_shield
source: Better at fighting with weapon and shield
ta: கருவி மற்றும் கேடயத்துடன் சண்டையிடுவதில் சிறந்தது

# skill_shortdescription_fightstyle_unarmed_unarmored
source: Better at fighting unarmed/unarmored
ta: நிராயுதபாணியாக/ஆயுதமரியாதவர்களை எதிர்த்துப் போராடுவதில் சிறந்தது

# skill_shortdescription_specialization_dualwield
source: Expert at dual wielding
ta: இரட்டை பயணத்தில் வல்லுநர்

# skill_shortdescription_specialization_2hand
source: Expert at two-handed weapons
ta: இரண்டு கை ஆயுதங்களில் வல்லுநர்

# skill_shortdescription_specialization_weapon_shield
source: Expert at fighting with weapon and shield
ta: கருவி மற்றும் கேடயத்துடன் சண்டையிடுவதில் வல்லுநர்

# skill_shortdescription_weapon_prof_pole
source: Better at fighting with pole weapons
ta: துருவ ஆயுதங்களுடன் சண்டையிடுவது சிறந்தது

# skill_longdescription_weapon_prof_dagger
source: For each skill level, increases attack chance when using daggers and shortswords by %1$d %% of the item's base attack chance, increases block chance by %2$d %% of the item's base block chance, and increases critical skill by %3$d %% of the item's base critical skill.
ta: ஒவ்வொரு திறன் நிலைக்கும், டாக்கர்ச் மற்றும் சார்ட்ச்வேர்டுகளைப் பயன்படுத்தும் போது தாக்குதல் வாய்ப்பை அதிகரிக்கிறது, உருப்படியின் அடிப்படை தாக்குதல் வாய்ப்பின் %1 $ டி %%, பிளாக் வாய்ப்பை %2 $ டி %% அதிகரிக்கிறது, மேலும் உருப்படியின் அடிப்படை தொகுதி வாய்ப்பின் வாய்ப்பை அதிகரிக்கிறது, மேலும் முக்கியமான திறனை %அதிகரிக்கிறது உருப்படியின் அடிப்படை முக்கியமான திறனின் 3 $ டி %%.

# skill_longdescription_weapon_prof_1hsword
source: For each skill level, increases attack chance of rapiers, longswords and broadswords by %1$d %% of the item's base attack chance, increases block chance by %2$d %% of the item's base block chance, and increases critical skill by %3$d %% of the item's base critical skill.
ta: ஒவ்வொரு திறன் நிலைக்கும், ரேபியர்கள், லாங்ச்வார்ட்ச் மற்றும் பிராட்ச்வேர்டுகளின் தாக்குதல் வாய்ப்பை உருப்படியின் அடிப்படை தாக்குதல் வாய்ப்பின் %1 $ டி %% மூலம் அதிகரிக்கிறது, மேலும் தொகுதியின் அடிப்படை தொகுதி வாய்ப்பின் %2 $ டி %% மூலம் தொகுதி வாய்ப்பை அதிகரிக்கிறது, மேலும் முக்கியமான திறனை அதிகரிக்கிறது உருப்படியின் அடிப்படை முக்கியமான திறனின் %3 $ டி %%.

# skill_longdescription_weapon_prof_2hsword
source: For each skill level, increases attack chance of two-handed swords by %1$d %% of the item's base attack chance, increases block chance by %2$d %% of the item's base block chance, and increases critical skill by %3$d %% of the item's base critical skill.
ta: ஒவ்வொரு திறன் நிலைக்கும், இரண்டு கை வாள்களின் தாக்குதல் வாய்ப்பை உருப்படியின் அடிப்படை தாக்குதல் வாய்ப்பின் %1 $ டி %% அதிகரிக்கிறது, தொகுதி வாய்ப்பை %2 $ டி %% அதிகரிக்கிறது, மேலும் உருப்படியின் அடிப்படை தொகுதி வாய்ப்பின் வாய்ப்பை அதிகரிக்கிறது, மேலும் முக்கியமான திறனை %அதிகரிக்கிறது உருப்படியின் அடிப்படை முக்கியமான திறனின் 3 $ டி %%.

# skill_longdescription_weapon_prof_axe
source: For each skill level, increases attack chance of axes and greataxes by %1$d %% of the item's base attack chance, increases block chance by %2$d %% of the item's base block chance, and increases critical skill by %3$d %% of the item's base critical skill.
ta: ஒவ்வொரு திறன் நிலைக்கும், உருப்படியின் அடிப்படை தாக்குதல் வாய்ப்பின் %1 $ டி %% மூலம் அச்சுகள் மற்றும் கிரேடாக்சின் தாக்குதல் வாய்ப்பை அதிகரிக்கிறது, தொகுதி வாய்ப்பை %2 $ டி %% அதிகரிக்கிறது, மேலும் முக்கியமான திறனை %3 ஆல் அதிகரிக்கிறது உருப்படியின் அடிப்படை முக்கியமான திறனின் $ டி %%.

# skill_longdescription_weapon_prof_blunt
source: For each skill level, increases attack chance of blunt weapons by %1$d %% of the item's base attack chance, increases block chance by %2$d %% of the item's base block chance, and increases critical skill by %3$d %% of the item's base critical skill. This includes clubs, quarterstaves, maces, scepters, whips, war hammers and giant hammers.
ta: ஒவ்வொரு திறன் மட்டத்திற்கும், அப்பட்டமான ஆயுதங்களின் தாக்குதல் வாய்ப்பை உருப்படியின் அடிப்படை தாக்குதல் வாய்ப்பின் %1 $ டி %% அதிகரிக்கிறது, மேலும் பிளாக் வாய்ப்பை %2 $ டி %% அதிகரிக்கிறது, மேலும் உருப்படியின் அடிப்படை தொகுதி வாய்ப்பின் வாய்ப்பு உருப்படியின் அடிப்படை முக்கியமான திறனின் டி %%. இதில் கிளப்புகள், கால்ச்டேவ்ச், மேச், செங்கோல், சவுக்கை, வார் ஏமர்ச் மற்றும் மாபெரும் சுத்தியல் ஆகியவை அடங்கும்.

# skill_longdescription_weapon_prof_unarmed
source: When fighting without a weapon and shield, gain %1$d attack chance, %2$d damage potential and %3$d block chance per skill level.
ta: கருவி மற்றும் கேடயம் இல்லாமல் சண்டையிடும் போது, ​​%1 $ டி தாக்குதல் வாய்ப்பு, %2 $ டி சேத ஆற்றல் மற்றும் திறன் நிலைக்கு %3 $ டி தடுப்பு வாய்ப்பு.

# skill_longdescription_armor_prof_shield
source: Increase damage resistance by %1$d per skill level while having a shield or parrying weapon equipped.
ta: ஒரு கவசம் அல்லது பாரிங் கருவி பொருத்தப்பட்டிருக்கும் போது சேத எதிர்ப்பை திறன் நிலைக்கு %1 $ டி மூலம் அதிகரிக்கவும்.

# skill_longdescription_armor_prof_unarmored
source: While fighting without having any piece of armor equipped, gain %1$d block chance per skill level. Items made of cloth are not considered as being armor.
ta: எந்தவொரு கவசமும் பொருத்தப்படாமல் சண்டையிடும் போது, ​​திறன் நிலைக்கு %1 $ டி தடுப்பு வாய்ப்பைப் பெறுங்கள். துணியால் செய்யப்பட்ட பொருட்கள் கவசமாக கருதப்படுவதில்லை.

# skill_longdescription_armor_prof_light
source: For every skill level, increases the block chance of every piece of light armor being worn by %1$d %% of their original block chances. Light armors include leather, light metal and hide armors.
ta: ஒவ்வொரு திறன் நிலைக்கும், ஒவ்வொரு ஒளி கவசத்தின் ஒவ்வொரு அசல் தொகுதி வாய்ப்புகளிலும் %1 $ டி %% அணியப்படுவதற்கான தடுப்பு வாய்ப்பை அதிகரிக்கிறது. ஒளி கவசங்களில் தோல், லைட் மெட்டல் மற்றும் மறை கவசங்கள் ஆகியவை அடங்கும்.
