Repository: 247i/TACETr
Catalog: உரை/தானி/appsemble-appsemble-*.po
Languages: ta

# studio.acLMip
source: Loading variables…
ta: மாறிகள் ஏற்றும்…

# studio.aleGqT
source: Descending
ta: இறங்கு

# studio.aruNNm
source: Null
ta: சுழியம்

# studio.axkCem
source: If this is specified, Sentry monitoring and error tracking will be applied to your app.
ta: இது குறிப்பிடப்பட்டால், உங்கள் பயன்பாட்டில் சென்ட்ரி கண்காணிப்பு மற்றும் பிழை கண்காணிப்பு பயன்படுத்தப்படும்.

# studio.b1tk6d
source: Clone App
ta: நகலி பயன்பாடு

# studio.bC8rRP
source: Domain name
ta: டொமைன் பெயர்

# studio.bDz3Hi
source: It’s you!
ta: இது நீங்கள்!

# studio.bEmJ9Y
source: Deletion Warning
ta: நீக்குதல் எச்சரிக்கை

# studio.bIaXeA
source: Something went wrong when trying to delete the logo.
ta: லோகோவை நீக்க முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.bK7FfL
source: Something went wrong when creating the new resources.
ta: புதிய வளங்களை உருவாக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.bLt0wd
source: You have no active login methods. Please set a password or add a social login.
ta: உங்களிடம் செயலில் உள்நுழைவு முறைகள் இல்லை. கடவுச்சொல்லை அமைக்கவும் அல்லது சமூக உள்நுழைவைச் சேர்க்கவும்.

# studio.bbCsiD
source: {resourceName} Details
ta: {resourceName} விவரங்கள்

# studio.bmwyz0
source: A time string representing when a resource should expire.
ta: ஒரு சான்று காலாவதியாகும்போது குறிக்கும் நேர சரம்.

# studio.brhaBY
source: Successfully uploaded asset {id}
ta: வெற்றிகரமாக பதிவேற்றப்பட்ட சொத்து {id}

# studio.bssHGo
source: Something went wrong when trying to fetch this snapshot. Its ID may be incorrect.
ta: இந்த ச்னாப்சாட்டைப் பெற முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது. அதன் ஐடி தவறாக இருக்கலாம்.

# studio.bthoYl
source: The permission to update app settings.
ta: பயன்பாட்டு அமைப்புகளைப் புதுப்பிக்க இசைவு.

# studio.bvprIx
source: Loading OAuth2 secrets…
ta: OAuth2 ரகசியங்களை ஏற்றுகிறது…

# studio.c+dPYA
source: This can take up to 24 hours, but it’s usually faster. If it takes longer, please contact support.
ta: இது 24 மணிநேரம் வரை ஆகலாம், ஆனால் இது பொதுவாக வேகமாக இருக்கும். அதிக நேரம் எடுத்தால், தயவுசெய்து ஆதரவைத் தொடர்பு கொள்ளவும்.

# studio.c/KktL
source: Resources
ta: வளங்கள்

# studio.c/TTro
source: App members
ta: பயன்பாட்டு உறுப்பினர்கள்

# studio.c2l+EP
source: Annotations
ta: சிறுகுறிப்புகள்

# studio.c35gM5
source: Roles
ta: பாத்திரங்கள்

# studio.c6JUlO
source: Whether SSL should be used for the custom SMTP server. Leave checked if you’re not sure.
ta: தனிப்பயன் SMTP சேவையகத்திற்கு SSL பயன்படுத்தப்பட வேண்டுமா. உங்களுக்குத் தெரியாவிட்டால் சரிபார்க்கவும்.

# studio.c99XhT
source: The organization you are trying to join could not be found. The organization might have been removed, if not, try again later.
ta: நீங்கள் சேர முயற்சிக்கும் அமைப்பைக் கண்டுபிடிக்க முடியவில்லை. அமைப்பு அகற்றப்பட்டிருக்கலாம், இல்லையென்றால், பின்னர் மீண்டும் முயற்சிக்கவும்.

# studio.cB7Zdd
source: Tenant URL
ta: குத்தகைதாரர் முகவரி

# studio.cDnAuK
source: Reseed
ta: ஒத்திருக்கிறது

# studio.cGDbtk
source: The permission to query app groups.
ta: பயன்பாட்டுக் குழுக்களை வினவ இசைவு.

# studio.cHKsa/
source: "{roleName}" is being used as the app's default role.
ta: "{roleName}" பயன்பாட்டின் இயல்புநிலை பாத்திரமாக பயன்படுத்தப்படுகிறது.

# studio.cMpxYy
source: An app with this name already exists in this organization.
ta: இந்த பெயரைக் கொண்ட ஒரு பயன்பாடு ஏற்கனவே இந்த நிறுவனத்தில் உள்ளது.

# studio.cOA7+s
source: Successfully deleted service secret {name}
ta: பணி மறைபொருள் {name} வெற்றிகரமாக நீக்கப்பட்டது

# studio.cODiHI
source: There was a problem logging in. Please try again.
ta: உள்நுழைவதில் சிக்கல் இருந்தது. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.

# studio.cPi5ZN
source: Save service secret
ta: பணி ரகசியத்தை சேமிக்கவும்

# studio.cPwv2c
source: Privacy policy
ta: தனியுரிமைக் கொள்கை

# studio.cQyKR1
source: Endpoints
ta: முனைப்புள்ளிகள்

# studio.cZZAAo
source: Loading your connected apps…
ta: உங்கள் இணைக்கப்பட்ட பயன்பாடுகளை ஏற்றுகிறது…

# studio.cahQG0
source: Full area
ta: முழு பகுதி

# studio.cg0zJf
source: This is where the user will be redirected when they press the login button
ta: உள்நுழைவு பொத்தானை அழுத்தும்போது பயனர் திருப்பி விடப்படுவார்

# studio.cil1uU
source: Successfully created resource {id}.
ta: வெற்றிகரமாக உருவாக்கப்பட்ட வள {id}.

# studio.cvsZgz
source: The permission to update app assets.
ta: பயன்பாட்டு சொத்துக்களைப் புதுப்பிக்க இசைவு.

# studio.d1MeYT
source: The invite has been deleted successfully
ta: அழைப்பு வெற்றிகரமாக நீக்கப்பட்டுள்ளது

# studio.d1OBbT
source: Report Bug
ta: பிழையைப் புகாரளிக்கவும்

# studio.d1uESJ
source: Assets
ta: சொத்துக்கள்

# studio.d5JTn+
source: Create new App
ta: புதிய பயன்பாட்டை உருவாக்கவும்

# studio.dKK3KZ
source: Client certificate authentication
ta: கிளையன்ட் சான்றிதழ் ஏற்பு

# studio.dOQCL8
source: Display name
ta: காட்சி பெயர்

# studio.dOtaub
source: Example code
ta: எடுத்துக்காட்டு குறியீடு

# studio.dXTCjA
source: Not verified
ta: சரிபார்க்கப்படவில்லை

# studio.dXuEkZ
source: Check to enable SCIM for this app
ta: இந்த பயன்பாட்டிற்கான SCIM ஐ இயக்க சரிபார்க்கவும்

# studio.dZwhpv
source: Are you sure you want to delete this training? This action cannot be reverted.
ta: இந்த பயிற்சியை நீக்க விரும்புகிறீர்களா? இந்த செயலை மாற்ற முடியாது.

# studio.dc9z3X
source: Organization Members
ta: அமைப்பு உறுப்பினர்கள்

# studio.deEeEI
source: Register
ta: பதிவு செய்யுங்கள்

# studio.djJp6c
source: History
ta: வரலாறு

# studio.djM9ag
source: Service Secret
ta: பணி மறைபொருள்

# studio.dkCG8O
source: There are currently no apps available.
ta: தற்போது பயன்பாடுகள் எதுவும் கிடைக்கவில்லை.

# studio.dklF9S
source: Failed to copy client credentials to clipboard
ta: கிளிப்போர்டுக்கு கிளையன்ட் சான்றுகளை நகலெடுப்பதில் தோல்வி

# studio.dn2v/w
source: The client id used to authenticate for the OAuth client credentials flow
ta: கிளையன்ட் ஐடி OAUTH கிளையன்ட் நற்சான்றிதழ்கள் ஓட்டத்தை அங்கீகரிக்கப் பயன்படுகிறது

# studio.du1laW
source: Never
ta: ஒருபோதும்

# studio.dujvfw
source: Grants access to everyone, even users who aren’t logged in.
ta: அனைவருக்கும் அணுகலை வழங்குகிறது, உள்நுழையாத பயனர்கள் கூட.

# studio.e/r+2g
source: Are you sure you want to delete this app collection? This action cannot be reverted.
ta: இந்த பயன்பாட்டு சேகரிப்பை நீக்க விரும்புகிறீர்களா? இந்த செயலை மாற்ற முடியாது.

# studio.e/yUi3
source: View live
ta: நேரலையில் காண்க

# studio.e1Z7f/
source: Tile Layers
ta: ஓடு அடுக்குகள்

# studio.e1uw1Q
source: The permission to query group invites.
ta: வினவல் குழு அழைக்கிறது.

# studio.eEYl8l
source: No more roles available
ta: இனி பாத்திரங்கள் கிடைக்கவில்லை

# studio.eFNjHH
source: The SAML response was signed using the wrong certificate.
ta: தவறான சான்றிதழைப் பயன்படுத்தி SAML பதில் கையொப்பமிடப்பட்டது.

# studio.eQ8Hq+
source: Container Logs
ta: கொள்கலன் பதிவுகள்

# studio.eRjPi+
source: Something went wrong trying to edit the block
ta: தொகுதியைத் திருத்த முயற்சிக்கும் ஏதோ தவறு ஏற்பட்டது

# studio.eTyQpc
source: Create a new {resourceName} resource
ta: புதிய {resourceName} வளத்தை உருவாக்கவும்

# studio.eVrDft
source: No value
ta: மதிப்பு இல்லை

# studio.eXDZGQ
source: Maintainer
ta: பராமரிப்பாளர்

# studio.eky97D
source: Successfully deleted resource {id}.
ta: வெற்றிகரமாக நீக்கப்பட்ட வள {id}.

# studio.fA8/KP
source: Login endpoint
ta: உள்நுழைவு முனைப்புள்ளி

# studio.fBg+7V
source: Navigation
ta: வானோடல்

# studio.fCCf9N
source: Resource Name
ta: வள பெயர்

# studio.fPH9wE
source: Are you sure you want to update the `{resourceName}` resource? Updating resources may resoult in data loss and can not be recovered.
ta: `{resourceName}` வளத்தை புதுப்பிக்க விரும்புகிறீர்களா? வளங்களை புதுப்பிப்பது தரவு இழப்பை ஏற்படுத்தக்கூடும், மேலும் அவை மீட்க முடியாது.

# studio.fQLSXx
source: The permission to read app settings.
ta: பயன்பாட்டு அமைப்புகளைப் படிக்க இசைவு.

# studio.fTTNTo
source: Preview format:
ta: முன்னோட்டம் வடிவம்:

# studio.fTbrdc
source: Include screenshots in the export file.
ta: ஏற்றுமதி கோப்பில் திரை சாட்களைச் சேர்க்கவும்.

# studio.fTmMeg
source: Something went wrong when trying to fetch this organization’s apps.
ta: இந்த அமைப்பின் பயன்பாடுகளைப் பெற முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.fWH1j6
source: Something went wrong when fetching the app’s snapshots.
ta: பயன்பாட்டின் ச்னாப்சாட்களைப் பெறும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.fWKwFM
source: Editor
ta: திருத்தி

# studio.fbMdX+
source: Your email was successfully verified! Have fun exploring Appsemble. Redirecting in 3 seconds.
ta: உங்கள் மின்னஞ்சல் வெற்றிகரமாக சரிபார்க்கப்பட்டது! ஆப்செம்பிள் ஆராய்வது வேடிக்கையாக இருங்கள். 3 வினாடிகளில் திருப்பிவிடுகிறது.

# studio.fbd33j
source: The permission to get the app resource history
ta: பயன்பாட்டு வள வரலாற்றைப் பெற இசைவு

# studio.fjPJRz
source: Ephemeral
ta: இடைக்கால

# studio.fm5hCE
source: Competences
ta: திறன்கள்

# studio.fnihsY
source: Leave
ta: விடுப்பு

# studio.foSyCj
source: logo
ta: சின்னம்

# studio.fqTGpE
source: Sentry DSN
ta: சென்ட்ரி டி.எச்.என்

# studio.fs5Fko
source: Competence
ta: திறன்

# studio.fwTvvS
source: The public certificate for client certificate authentication in PEM format
ta: PEM வடிவத்தில் கிளையன்ட் சான்றிதழ் அங்கீகாரத்திற்கான பொது சான்றிதழ்

# studio.g7HwgE
source: The permission to create app translations.
ta: பயன்பாட்டு மொழிபெயர்ப்புகளை உருவாக்க இசைவு.

# studio.g807h/
source: Would you like to create an account using this {provider} account?
ta: இந்த {provider} கணக்கைப் பயன்படுத்தி ஒரு கணக்கை உருவாக்க விரும்புகிறீர்களா?

# studio.gHMvwI
source: Resource: {resourceName}
ta: ஆதாரம்: {resourceName}

# studio.gL86bv
source: Group name
ta: குழு பெயர்

# studio.gM6Voq
source: If specified, this SAML attribute is used to determine the user’s object ID. Required if there is a SCIM connection present.
ta: குறிப்பிடப்பட்டால், பயனரின் பொருள் ஐடியை தீர்மானிக்க இந்த SAML பண்புக்கூறு பயன்படுத்தப்படுகிறது. SCIM இணைப்பு இருந்தால் தேவை.

# studio.gR2hpT
source: This email address has already been registered.
ta: இந்த மின்னஞ்சல் முகவரி ஏற்கனவே பதிவு செய்யப்பட்டுள்ளது.

# studio.gR8dZ5
source: Because of the security policy of the app, you currently are not allowed to log into {app}. Please contact the author of the app if you wish to be invited.
ta: பயன்பாட்டின் பாதுகாப்புக் கொள்கையின் காரணமாக, தற்போது {பயன்பாடு in இல் உள்நுழைய அனுமதிக்கப்படவில்லை. நீங்கள் அழைக்க விரும்பினால் பயன்பாட்டின் ஆசிரியரைத் தொடர்பு கொள்ளவும்.

# studio.gRiKLf
source: Apps
ta: பயன்பாடுகள்

# studio.gUZ9Rb
source: The permission to delete organization invites.
ta: அமைப்பை நீக்க இசைவு அழைக்கிறது.

# studio.gV4n5L
source: Something went wrong when trying to fetch this organization’s blocks.
ta: இந்த அமைப்பின் தொகுதிகள் பெற முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.gV6QCp
source: Successfully deleted the selected resources.
ta: தேர்ந்தெடுக்கப்பட்ட வளங்களை வெற்றிகரமாக நீக்கியது.

# studio.gXcR1Y
source: Grants access specifically to users who aren’t logged in.
ta: உள்நுழையாத பயனர்களுக்கு குறிப்பாக அணுகலை வழங்குகிறது.

# studio.gZD+CR
source: Add a new Field
ta: புதிய புலத்தைச் சேர்க்கவும்

# studio.gbP/8K
source: Copied token to clipboard
ta: கிளிப்போர்டுக்கு கிள்ளாக்கை நகலெடுத்தது

# studio.goBx7K
source: Regenerating the SCIM token will invalidate the old token.
ta: ச்கிம் கிள்ளாக்கை மீண்டும் உருவாக்குவது பழைய கிள்ளாக்கை செல்லாது.

# studio.gwT1uG
source: Delete an existing {resourceName} resource
ta: ஏற்கனவே உள்ள {resourceName} வளத்தை நீக்கு

# studio.gyrIEl
source: File
ta: கோப்பு

# studio.gzNgBA
source: Something went wrong when loading this resource.
ta: இந்த வளத்தை ஏற்றும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.h+tTHx
source: Deleting variable
ta: மாறி நீக்குதல்

# studio.h5YteA
source: Request a password reset for your Appsemble user
ta: உங்கள் AppSemble பயனருக்கான கடவுச்சொல் மீட்டமைப்பைக் கோருங்கள்

# studio.hB8k+Z
source: Something went wrong when updating this resource.
ta: இந்த வளத்தை புதுப்பிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.hGQqkW
source: Schedule
ta: அட்டவணை

# studio.hJQLBM
source: Something went wrong when trying to update the settings
ta: அமைப்புகளை புதுப்பிக்க முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது

# studio.hMzcSq
source: Messages
ta: செய்திகள்

# studio.hQVJMS
source: Default policy
ta: இயல்புநிலை கொள்கை

# studio.hW9ZYr
source: The header for header based authentication
ta: தலைப்பு அடிப்படையிலான அங்கீகாரத்திற்கான தலைப்பு

# studio.hX5PAb
source: No results found
ta: முடிவுகள் எதுவும் கிடைக்கவில்லை

# studio.ha50XH
source: Assets are being loaded…
ta: சொத்துக்கள் ஏற்றப்படுகின்றன…

# studio.hj7ydT
source: The name displayed for emails sent for this app. For example: John Doe '<'test@example.com'>', or just ‘test@example.com’
ta: இந்த பயன்பாட்டிற்கு அனுப்பப்பட்ட மின்னஞ்சல்களுக்கு பெயர் காட்டப்படுகிறது. எடுத்துக்காட்டாக: சான் டோ '<' test@example.com '>', அல்லது ‘test@example.com’

# studio.hnit3L
source: No snapshots available.
ta: ச்னாப்சாட்கள் எதுவும் கிடைக்கவில்லை.

# studio.htvX+Z
source: Deny
ta: மறுக்கவும்

# studio.huHOtm
source: The permission to update the role of app members.
ta: பயன்பாட்டு உறுப்பினர்களின் பங்கைப் புதுப்பிக்க இசைவு.

# studio.hzmswI
source: Groups
ta: குழுக்கள்

# studio.i/TW7n
source: This app has no resources.
ta: இந்த பயன்பாட்டில் ஆதாரங்கள் இல்லை.

# studio.iCOmfv
source: Something went wrong when trying to update the settings.
ta: அமைப்புகளை புதுப்பிக்க முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.iGnSuL
source: Why and how we use your data
ta: உங்கள் தரவை ஏன், எப்படி பயன்படுத்துகிறோம்

# studio.iGqBkt
source: Role name is missing.
ta: பங்கு பெயர் இல்லை.

# studio.iJMNSQ
source: Fields
ta: புலங்கள்

# studio.iKi9+h
source: App collections
ta: பயன்பாட்டு சேகரிப்புகள்

# studio.iNbH4x
source: There was a problem loading the your connected apps.
ta: நீங்கள் இணைக்கப்பட்ட பயன்பாடுகளை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.idcebo
source: Default page
ta: இயல்புநிலை பக்கம்

# studio.il/JE4
source: Are you sure you want to delete the `{resourceName}` resource? Deleted resources can not be recovered.
ta: `{resourceName}` வளத்தை நீக்க விரும்புகிறீர்களா? நீக்கப்பட்ட வளங்களை மீட்டெடுக்க முடியாது.

# studio.ipgyGT
source: Copy any resources that are allowed to be cloned.
ta: நகலி செய்ய அனுமதிக்கப்பட்ட எந்த வளங்களையும் நகலெடுக்கவும்.

# studio.isGKnz
source: Documentation
ta: ஆவணப்படுத்துதல்

# studio.itPgxd
source: Profile
ta: சுயவிவரம்

# studio.iu9iYI
source: The default roles that are allowed to perform all actions.
ta: எல்லா செயல்களையும் செய்ய அனுமதிக்கப்பட்ட இயல்புநிலை பாத்திரங்கள்.

# studio.izGBOh
source: Failed to copy service provider entity ID to clipboard
ta: பணி வழங்குநர் நிறுவன ஐடியை கிளிப்போர்டுக்கு நகலெடுப்பதில் தோல்வி

# studio.j161zh
source: Download {filename}
ta: பதிவிறக்கம் {filename}

# studio.jG4bcj
source: Confirm account deletion
ta: கணக்கு நீக்குதலை உறுதிப்படுத்தவும்

# studio.jI+73R
source: Already have an account? <link>Login</link> and link to an existing account instead.
ta: ஏற்கனவே ஒரு கணக்கு இருக்கிறதா? <இணைப்பு> உள்நுழைவு </இணைப்பு> அதற்கு பதிலாக ஏற்கனவே உள்ள கணக்குடன் இணைக்கவும்.

# studio.jRZz4r
source: This app currently has no members.
ta: இந்த பயன்பாட்டில் தற்போது உறுப்பினர்கள் இல்லை.

# studio.jSQuj+
source: External Resource
ta: வெளிப்புற வள

# studio.jSeYNv
source: It’s you
ta: இது நீங்கள்

# studio.jTs1N2
source: No groups have been created yet.
ta: இதுவரை எந்த குழுக்களும் உருவாக்கப்படவில்லை.

# studio.jUnXQ0
source: Something went wrong when trying to respond to this invitation.
ta: இந்த அழைப்பிற்கு பதிலளிக்க முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.jiN18R
source: The linked email address is already assigned to an existing Appsemble account. Please login and try again.
ta: இணைக்கப்பட்ட மின்னஞ்சல் முகவரி ஏற்கனவே ஏற்கனவே உள்ள AppSemble கணக்கிற்கு ஒதுக்கப்பட்டுள்ளது. தயவுசெய்து உள்நுழைந்து மீண்டும் முயற்சிக்கவும்.

# studio.jqm8s7
source: Something went wrong when trying to load the apps.
ta: பயன்பாடுகளை ஏற்ற முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.ju3jtF
source: A Boolean is a variable that can have one of two possible values, true or false
ta: ஒரு பூலியன் என்பது உண்மை அல்லது தவறான இரண்டு சாத்தியமான மதிப்புகளில் ஒன்றைக் கொண்டிருக்கலாம்

# studio.jvo0vs
source: Save
ta: சேமி

# studio.jx3A4P
source: Server-side
ta: சேவையக பக்க

# studio.jylA9m
source: Are you sure you want to lock this app?
ta: இந்த பயன்பாட்டை பூட்ட விரும்புகிறீர்களா?

# studio.k/NtR0
source: The URL where the user will be redirected to confirm their login
ta: உள்நுழைவை உறுதிப்படுத்த பயனர் திருப்பி விடப்படும் முகவரி

# studio.k81S1y
source: Logo
ta: சின்னம்

# studio.kFjy+A
source: Something went wrong trying to fetch the list of organizations
ta: நிறுவனங்களின் பட்டியலைப் பெற முயற்சிக்கும் ஏதோ தவறு ஏற்பட்டது

# studio.kGGU2D
source: Id
ta: ஐடி

# studio.kK/m4i
source: Inherits from
ta: இருந்து மரபு

# studio.kL7Utu
source: You haven’t logged in to this app yet.
ta: இந்த பயன்பாட்டில் நீங்கள் இன்னும் உள்நுழைந்திருக்கவில்லை.

# studio.kM6XaM
source: Export to CSV
ta: காபிம க்கு ஏற்றுமதி

# studio.kS1xTp
source: Delete {amount} {amount, plural, one {asset} other {assets}}
ta: {amount} {தொகை, பன்மை, ஒன்று {asset} பிற {assets}}}

# studio.kVS9rT
source: Include example resources
ta: எடுத்துக்காட்டு வளங்களைச் சேர்க்கவும்

# studio.kfTLvf
source: The permission to delete organizations.
ta: அமைப்புகளை நீக்க இசைவு.

# studio.kg2p7g
source: Resource warning
ta: வள எச்சரிக்கை

# studio.kiTtTY
source: Hide columns ({count}/{total})
ta: நெடுவரிசைகளை மறைக்கவும் ({count}/{total})

# studio.kk4TVW
source: Icon
ta: படவுரு

# studio.kukswA
source: Create, update, and delete app resources
ta: பயன்பாட்டு ஆதாரங்களை உருவாக்கவும், புதுப்பிக்கவும், நீக்கவும்

# studio.kvrEcW
source: This group could not be found.
ta: இந்த குழுவைக் கண்டுபிடிக்க முடியவில்லை.

# studio.kznIRT
source: You don’t have sufficient permissions to invite members.
ta: உறுப்பினர்களை அழைக்க உங்களுக்கு போதுமான இசைவு இல்லை.

# studio.l1ukuE
source: A display name is required
ta: காட்சி பெயர் தேவை

# studio.l2htNZ
source: There was a problem loading this group.
ta: இந்த குழுவை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.l3RRaO
source: Link account
ta: இணைப்பு கணக்கு

# studio.l3dsTi
source: Resource as JSON
ta: சாதொபொகு ஆக வள

# studio.lCKQlO
source: The permission to delete apps in an organization.
ta: ஒரு நிறுவனத்தில் பயன்பாடுகளை நீக்க இசைவு.

# studio.lCX8ty
source: There was a problem loading this group’s members.
ta: இந்த குழுவின் உறுப்பினர்களை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.lJK0aS
source: Margin
ta: விளிம்பு

# studio.lKv8ex
source: Default
ta: இயல்புநிலை

# studio.lQxlek
source: The time zone used for formatting time in emails
ta: மின்னஞ்சல்களில் நேரத்தை வடிவமைக்க பயன்படுத்தப்படும் நேர மண்டலம்

# studio.lcRcIO
source: User info remapper
ta: பயனர் செய்தி ரீமாப்பர்

# studio.lctTpH
source: Service provider certificate copied to clipboard
ta: பணி வழங்குநர் சான்றிதழ் கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டது

# studio.li2TA0
source: Enter fullscreen
ta: முழுத்திரை உள்ளிடவும்

# studio.llfjrj
source: This snapshot couldn’t be found. Is its ID correct?
ta: இந்த ச்னாப்சாட்டை கண்டுபிடிக்க முடியவில்லை. அதன் ஐடி சரியானதா?

# studio.lw7Bus
source: Failed to copy attribute consume service endpoint to clipboard
ta: பண்புக்கூறு நுகர்வு பணி இறுதிப் புள்ளியை கிளிப்போர்டுக்கு நகலெடுப்பதில் தோல்வி

# studio.lwffFf
source: Save variable
ta: மாறி சேமிக்கவும்

# studio.m0jOVR
source: Something went wrong when trying to fetch the email settings
ta: மின்னஞ்சல் அமைப்புகளைப் பெற முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது

# studio.m48Hbs
source: "{roleName}" is being used in in Groups Create.
ta: குழுக்கள் உருவாக்கத்தில் "{roleName}" பயன்படுத்தப்படுகிறது.

# studio.m90aUC
source: Successfully sent notification!
ta: வெற்றிகரமாக அறிவிப்பு அனுப்பப்பட்டது!

# studio.mBPNep
source: Hide this app collection from the public list
ta: இந்த பயன்பாட்டு சேகரிப்பை பொது பட்டியலிலிருந்து மறைக்கவும்

# studio.mCrhgT
source: Apply to all objects
ta: எல்லா பொருட்களுக்கும் பொருந்தும்

# studio.mK9mKF
source: Enable self registration
ta: தன்வய பதிவை இயக்கவும்

# studio.mLmrec
source: Loading apps…
ta: பயன்பாடுகளை ஏற்றுகிறது…

# studio.mXGY9/
source: Display Appsemble login method
ta: AppSemble உள்நுழைவு முறையைக் காண்பி

# studio.mcUhhf
source: Reference
ta: குறிப்பு

# studio.me/6nr
source: The permission to create organization invites.
ta: அமைப்பை உருவாக்குவதற்கான இசைவு அழைக்கிறது.

# studio.meTsdt
source: Loading service secrets …
ta: பணி ரகசியங்களை ஏற்றுகிறது…

# studio.mewjmo
source: There was a problem loading the app collections of this organization.
ta: இந்த அமைப்பின் பயன்பாட்டு சேகரிப்புகளை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.mlMiPK
source: Whether app service secrets can be applied without a security definition.
ta: பாதுகாப்பு வரையறை இல்லாமல் வானிலை பயன்பாட்டு பணி ரகசியங்கள் பயன்படுத்தப்படலாம்.

# studio.mmQuQM
source: Header image
ta: தலைப்பு படம்

# studio.mpNJuB
source: Share App
ta: பயன்பாட்டைப் பகிரவும்

# studio.mt3K/p
source: Something went wrong when deleting this resource.
ta: இந்த வளத்தை நீக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.n+I19K
source: Are you sure you want to reseed this demo app? This will delete all ephemeral resources and assets and will create new ones from the seed.
ta: இந்த டெமோ பயன்பாட்டை நீங்கள் மாற்றியமைக்க விரும்புகிறீர்களா? இது அனைத்து இடைக்கால வளங்களையும் சொத்துகளையும் நீக்கும் மற்றும் விதைகளிலிருந்து புதியவற்றை உருவாக்கும்.

# studio.n3abN1
source: Add an email address
ta: மின்னஞ்சல் முகவரியைச் சேர்க்கவும்

# studio.n5Sqbb
source: Are you sure you want to delete this secret? This action cannot be reverted.
ta: இந்த ரகசியத்தை நீக்க விரும்புகிறீர்களா? இந்த செயலை மாற்ற முடியாது.

# studio.n7yYXG
source: Service
ta: பணி

# studio.n9fGMG
source: Rate this app
ta: இந்த பயன்பாட்டை மதிப்பிடுங்கள்

# studio.nAE0fd
source: Include assets in the export file.
ta: ஏற்றுமதி கோப்பில் சொத்துக்களைச் சேர்க்கவும்.

# studio.nAh4nV
source: Create Sub-Page
ta: துணை பக்கத்தை உருவாக்கவும்

# studio.nDRMt4
source: Radius
ta: ஆரம்

# studio.nL/Owh
source: Send notification
ta: அறிவிப்பை அனுப்பவும்

# studio.nS1qCT
source: The permission to delete app screenshots.
ta: ஆப் திரை சாட்களை நீக்க இசைவு.

# studio.nVS/70
source: Add new variable
ta: புதிய மாறியைச் சேர்க்கவும்

# studio.nW0iZ+
source: Successfully removed email address.
ta: மின்னஞ்சல் முகவரியை வெற்றிகரமாக அகற்றியது.

# studio.nbL8T0
source: The permission to patch the properties of app members.
ta: பயன்பாட்டு உறுப்பினர்களின் பண்புகளை இணைக்க இசைவு.

# studio.neh6MB
source: Apps are defined by their app definition. An app definition is a YAML file which describes what the app does and what it looks like.
ta: பயன்பாடுகள் அவற்றின் பயன்பாட்டு வரையறையால் வரையறுக்கப்படுகின்றன. பயன்பாட்டு வரையறை என்பது ஒரு YAML கோப்பு, இது பயன்பாடு என்ன செய்கிறது மற்றும் அது எப்படி இருக்கும் என்பதை விவரிக்கிறது.

# studio.nhkxb9
source: {average} out of 5
ta: 5 சராசரி} 5 இல்

# studio.nso3Mj
source: Scope
ta: நோக்கம்

# studio.nw/pN6
source: Snapshot {name}
ta: ச்னாப்சாட் {name}

# studio.ny2yoG
source: Include resources in the export file.
ta: ஏற்றுமதி கோப்பில் வளங்களைச் சேர்க்கவும்.

# studio.nz3jzj
source: Enroll
ta: பதிவு

# studio.o+nqjA
source: The permission to change the roles of organization members.
ta: நிறுவன உறுப்பினர்களின் பாத்திரங்களை மாற்ற இசைவு.

# studio.o0NC6H
source: Email port
ta: மின்னஞ்சல் துறைமுகம்

# studio.o1JSKz
source: Something went wrong when creating this app.
ta: இந்த பயன்பாட்டை உருவாக்கும் போது ஏதோ தவறு ஏற்பட்டது.

# studio.o2wQir
source: Attribute consume service endpoint
ta: பண்புக்கூறு நுகர்வு பணி இறுதிப் புள்ளி

# studio.oBKJPq
source: The icon that will be shown to the user.
ta: பயனருக்கு காண்பிக்கப்படும் படவுரு.

# studio.oBSs4o
source: Your SSL certificate is being generated. This may take up to 24 hours, but it’s usually faster.
ta: உங்கள் SSL சான்றிதழ் உருவாக்கப்படுகிறது. இது 24 மணிநேரம் வரை ஆகலாம், ஆனால் இது பொதுவாக வேகமாக இருக்கும்.

# studio.oGBluO
source: The subject is missing from the SAML response.
ta: SAML பதிலில் இருந்து பொருள் இல்லை.

# studio.oM0YKU
source: User info URL
ta: பயனர் செய்தி முகவரி

# studio.oUWADl
source: No
ta: இல்லை
