Repository: 247i/TACETr
Catalog: உரை/தானி/appsemble-appsemble-*.po
Languages: ta

# studio.A5IQEY
source: An error occured while deleting the block.
ta: தொகுதியை நீக்கும்போது பிழை ஏற்பட்டது.

# studio.AE1+0n
source: This app has the following resources:
ta: இந்த பயன்பாட்டில் பின்வரும் ஆதாரங்கள் உள்ளன:

# studio.AELJdn
source: App account deleted successfully
ta: பயன்பாட்டு கணக்கு வெற்றிகரமாக நீக்கப்பட்டது

# studio.ASwJRg
source: Client Secret
ta: வாங்கி மறைபொருள்

# studio.ATemBX
source: Maximum length
ta: அதிகபட்ச நீளம்

# studio.AXmu+f
source: The certificate will be generated once this secret is saved
ta: இந்த மறைபொருள் சேமிக்கப்பட்டவுடன் சான்றிதழ் உருவாக்கப்படும்

# studio.AZ6j18
source: unsaved changes
ta: சேமிக்கப்படாத மாற்றங்கள்

# studio.AZSxPR
source: Packages
ta: தொகுப்பு

# studio.AdAi3x
source: Emails
ta: மின்னஞ்சல்கள்

# studio.Amt/8b
source: Minimum
ta: சிறுமம்

# studio.Aopgs7
source: There was a problem loading the members of this app.
ta: இந்த பயன்பாட்டின் உறுப்பினர்களை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.AsB1PR
source: Organization {name}
ta: அமைப்பு {name}

# studio.AyGauy
source: Login
ta: புகுபதிவு

# studio.B02Lh+
source: There are no organizations available.
ta: எந்த நிறுவனங்களும் கிடைக்கவில்லை.

# studio.B18Y2h
source: No invite has been found. It may have been used or revoked. You can return to Appsemble <link>here</link>.
ta: எந்த அழைப்பும் கிடைக்கவில்லை. இது பயன்படுத்தப்பட்டிருக்கலாம் அல்லது ரத்து செய்யப்பட்டிருக்கலாம். நீங்கள் AppSemble <இணைப்பு> இங்கே </link> க்கு திரும்பலாம்.

# studio.B7p2EC
source: Client secret
ta: வாங்கி மறைபொருள்

# studio.BCzmdv
source: Maximum
ta: பெருமம்

# studio.BG373v
source: The permission to update app secrets.
ta: பயன்பாட்டு ரகசியங்களைப் புதுப்பிக்க இசைவு.

# studio.BG8eFL
source: SSL private key
ta: SSL தனியார் விசை

# studio.BPiNPW
source: The permission to create app resources.
ta: பயன்பாட்டு ஆதாரங்களை உருவாக்க இசைவு.

# studio.BQptVD
source: Identity provider entity ID
ta: அடையாள வழங்குநர் நிறுவன ஐடி

# studio.BSgbsk
source: Uploaded messages successfully
ta: பதிவேற்றிய செய்திகளை வெற்றிகரமாக பதிவேற்றியது

# studio.BTfI2K
source: There was a problem loading your registered email addresses.
ta: உங்கள் பதிவுசெய்யப்பட்ட மின்னஞ்சல் முகவரிகளை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.BUG3UD
source: Swap the items above and below
ta: மேலே மற்றும் கீழே உள்ள பொருட்களை மாற்றவும்

# studio.BWpepv
source: Publish blocks and block versions
ta: தொகுதிகள் மற்றும் தொகுதி பதிப்புகளை வெளியிடுங்கள்

# studio.BWpuKl
source: Update
ta: புதுப்பிப்பு

# studio.BY8dgI
source: Successfully added email address
ta: மின்னஞ்சல் முகவரியை வெற்றிகரமாகச் சேர்த்தது

# studio.BdFDsh
source: JSON error: The input value is not valid JSON.
ta: சாதொபொகு பிழை: உள்ளீட்டு மதிப்பு செல்லுபடியாகும் சாதொபொகு அல்ல.

# studio.Bep/gA
source: Private key
ta: தனிப்பட்ட விசை

# studio.BpuMwR
source: Delete group
ta: குழுவை நீக்கு

# studio.ByoZDD
source: Breadcrumbs
ta: பிரட்தூள்களில் நனைக்கப்பட்டு

# studio.BzTzOo
source: The permission to view the list of members in an organization.
ta: ஒரு நிறுவனத்தில் உறுப்பினர்களின் பட்டியலைக் காண இசைவு.

# studio.C4dVmi
source: Expert
ta: வல்லுநர்

# studio.C4p5Qq
source: Creating resource
ta: வளத்தை உருவாக்குதல்

# studio.C81/uG
source: Logout
ta: வெளியேற்றம்

# studio.C8qIYS
source: You currently haven’t registered any OAuth2 clients. If you don’t know what this is, you should probably leave this empty.
ta: நீங்கள் தற்போது எந்த OAuth2 வாடிக்கையாளர்களையும் பதிவு செய்யவில்லை. இது என்னவென்று உங்களுக்குத் தெரியாவிட்டால், இதை நீங்கள் காலியாக விட வேண்டும்.

# studio.CdKOL0
source: Create new resource
ta: புதிய வளத்தை உருவாக்கவும்

# studio.Cet1wL
source: Something went wrong when trying to delete the translations for this language.
ta: இந்த மொழிக்கான மொழிபெயர்ப்புகளை நீக்க முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.CiHeL3
source: Are you sure you want to delete this service secret? This action cannot be reverted.
ta: இந்த பணி ரகசியத்தை நீக்க விரும்புகிறீர்களா? இந்த செயலை மாற்ற முடியாது.

# studio.CqWqJp
source: Something went wrong when deleting the selected resources.
ta: தேர்ந்தெடுக்கப்பட்ட வளங்களை நீக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.CtZMCP
source: Secret
ta: மறைபொருள்

# studio.CthkzB
source: The URL pattern(s) used to match against the request action URL.
ta: கோரிக்கை நடவடிக்கை முகவரி உடன் பொருந்த பயன்படுத்த முகவரி முறை (கள்).

# studio.CwuT4e
source: This action is supported on the server as well, including during cronjobs
ta: இந்த நடவடிக்கை சேவையகத்திலும் ஆதரிக்கப்படுகிறது, இது க்ரோன்சோப்ச் உட்பட

# studio.CxfKLC
source: Pages
ta: பக்கங்கள்

# studio.CzHuqk
source: Icon preview
ta: படவுரு முன்னோட்டம்

# studio.D0La/m
source: Organization ID
ta: அமைப்பு ஐடி

# studio.D3idYv
source: Settings
ta: அமைப்புகள்

# studio.D4iR4a
source: The permission to delete trainings.
ta: பயிற்சிகளை நீக்க இசைவு.

# studio.D7b7Dd
source: This app currently has no assets.
ta: இந்த பயன்பாட்டில் தற்போது சொத்துக்கள் இல்லை.

# studio.DAlJcD
source: The path used to access the app.
ta: பயன்பாட்டை அணுக பயன்படுத்தப்படும் பாதை.

# studio.DCjIUV
source: There are no apps that match your search parameters.
ta: உங்கள் தேடல் அளவுருக்களுடன் பொருந்தக்கூடிய பயன்பாடுகள் எதுவும் இல்லை.

# studio.DNWu9v
source: No blocks match your search
ta: உங்கள் தேடலுடன் எந்த தொகுதிகளும் பொருந்தவில்லை

# studio.DPrbP2
source: Edit organization
ta: அமைப்பைத் திருத்து

# studio.DRXLjG
source: Failed to copy the service provider certificate to clipboard
ta: பணி வழங்குநர் சான்றிதழை கிளிப்போர்டுக்கு நகலெடுப்பதில் தோல்வி

# studio.DZWIKx
source: The permission to query app members.
ta: பயன்பாட்டு உறுப்பினர்களை வினவுவதற்கு இசைவு.

# studio.DncOA1
source: Variable
ta: மாறக்கூடிய

# studio.DnrT2u
source: Example Code
ta: எடுத்துக்காட்டு குறியீடு

# studio.Dqt5oO
source: There are no ratings available yet. You can be the first to rate!
ta: இதுவரை மதிப்பீடுகள் எதுவும் கிடைக்கவில்லை. நீங்கள் முதலில் மதிப்பிடலாம்!

# studio.Dxf87T
source: There was a problem loading the SAML secrets.
ta: SAML ரகசியங்களை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.E/jnV9
source: Something went wrong trying to fetch this organization.
ta: இந்த அமைப்பை பெற முயற்சிக்கும் ஏதோ தவறு நடந்தது.

# studio.E7OHdE
source: The organization does not match up with the invite token.
ta: நிறுவனம் அழைப்பிதழ் டோக்கனுடன் பொருந்தவில்லை.

# studio.EHWpHU
source: The secret SCIM token
ta: ரகசிய ச்கிம் கிள்ளாக்கு

# studio.EJ9cID
source: Apply to this object
ta: இந்த பொருளுக்கு பொருந்தும்

# studio.ETRyBL
source: Rating
ta: செயல்வரம்பு

# studio.EVa8ST
source: Maximum Length
ta: அதிகபட்ச நீளம்

# studio.EWw/tK
source: Apply
ta: இடு

# studio.EX+XpL
source: Resend verification email
ta: சரிபார்ப்பு மின்னஞ்சல் மீண்டும் அனுப்பவும்

# studio.EcglP9
source: Key
ta: விசை

# studio.Ed2ywJ
source: Read less
ta: குறைவாகப் படியுங்கள்

# studio.EeE8+D
source: Expert name
ta: வல்லுநர் பெயர்

# studio.EiEAKD
source: Dutch
ta: டச்சு

# studio.Ejhdi4
source: Feedback
ta: கருத்து

# studio.ElMX/X
source: Are you sure you want to remove this invite?
ta: இந்த அழைப்பை அகற்ற விரும்புகிறீர்களா?

# studio.EmsQM7
source: No logs found
ta: பதிவுகள் எதுவும் கிடைக்கவில்லை

# studio.ErKUoz
source: The name of the app
ta: பயன்பாட்டின் பெயர்

# studio.ErwI1g
source: The permission to delete group invites.
ta: குழுவை நீக்க இசைவு அழைக்கிறது.

# studio.EwRIOm
source: User
ta: பயனர்

# studio.F+aPGZ
source: The invite has been resent successfully
ta: அழைப்பு வெற்றிகரமாக மனக்குறை அடைந்துள்ளது

# studio.F9iKim
source: Delete block versions
ta: தொகுதி பதிப்புகளை நீக்கு

# studio.FAnTZ3
source: Are you sure you want to remove this member from the group?
ta: இந்த உறுப்பினரை குழுவிலிருந்து அகற்ற விரும்புகிறீர்களா?

# studio.FBt1Ti
source: Please verify your email address ({email}) to complete your Appsemble registration.
ta: உங்கள் பயன்பாட்டு பதிவை முடிக்க உங்கள் மின்னஞ்சல் முகவரியை ({email}) சரிபார்க்கவும்.

# studio.FDU4xh
source: Are you sure you want to unlock this app?
ta: இந்த பயன்பாட்டை நீங்கள் திறக்க விரும்புகிறீர்களா?

# studio.FICfif
source: The role {name} has been deleted.
ta: {பெயர் beard பாத்திரம் நீக்கப்பட்டது.

# studio.FJJ/BR
source: Email password
ta: மின்னஞ்சல் கடவுச்சொல்

# studio.FL26DE
source: There was a problem loading the service secrets.
ta: பணி ரகசியங்களை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.FMhPQ6
source: Certificate
ta: சான்றிதழ்

# studio.FNNM8q
source: The permission to create apps in an organization.
ta: ஒரு நிறுவனத்தில் பயன்பாடுகளை உருவாக்க இசைவு.

# studio.FQM8ei
source: Are you sure you want to delete this screenshot? This action cannot be undone.
ta: இந்த ச்கிரீன்சாட்டை நீக்க விரும்புகிறீர்களா? இந்த செயலை செயல்தவிர்க்க முடியாது.

# studio.FTFqXw
source: No file chosen
ta: கோப்பு எதுவும் தேர்வு செய்யப்படவில்லை

# studio.FUKP1D
source: The permission to remove group members.
ta: குழு உறுப்பினர்களை அகற்ற இசைவு.

# studio.FayXzX
source: Pin app to top of collection
ta: சேகரிப்பின் மேல் பயன்பாட்டை முள்

# studio.Fb3/VH
source: The FontAwesome icon that will be displayed on the login button
ta: உள்நுழைவு பொத்தானில் காண்பிக்கப்படும் எழுத்துரு படவுரு

# studio.Fd+cQF
source: The following blocks are using the role "{roleName}":
ta: பின்வரும் தொகுதிகள் "{roleName}" என்ற பாத்திரத்தைப் பயன்படுத்துகின்றன:

# studio.FfObOV
source: A string is any sequence of characters (letters, numerals, symbols, punctuation marks, etc.)
ta: ஒரு சரம் என்பது எழுத்துக்களின் எந்த வரிசையும் (எழுத்துக்கள், எண்கள், சின்னங்கள், நிறுத்தற்குறிகள் போன்றவை)

# studio.FflmjG
source: Loading groups…
ta: குழுக்களை ஏற்றுகிறது…

# studio.FhSRwt
source: Show app definition
ta: பயன்பாட்டு வரையறையைக் காட்டு

# studio.Ft/dkd
source: Loading app messages
ta: பயன்பாட்டு செய்திகளை ஏற்றுகிறது

# studio.Fu7y9h
source: Your app collection is secured using SSL
ta: உங்கள் பயன்பாட்டு சேகரிப்பு SSL ஐப் பயன்படுத்தி பாதுகாக்கப்படுகிறது

# studio.Fuqmt1
source: Create new group
ta: புதிய குழுவை உருவாக்கவும்

# studio.G/yZLu
source: Remove
ta: அகற்று

# studio.G3pGoD
source: Login to Appsemble
ta: AppSemble இல் உள்நுழைக

# studio.G5EJ8b
source: Select logo
ta: லோகோவைத் தேர்ந்தெடுக்கவும்

# studio.G5YSJR
source: Send feedback
ta: கருத்துக்களை அனுப்பவும்

# studio.G6hIMy
source: Public profile
ta: பொது சுயவிவரம்

# studio.G8yYBi
source: Edit Training Block
ta: பயிற்சி தொகுதியைத் திருத்து

# studio.GCKu2P
source: Please enter your Organization Id <bold>{organizationId}</bold> to continue.
ta: தொடர உங்கள் நிறுவன ஐடி <told> {organizationId} </bold> ஐ உள்ளிடவும்.

# studio.GJO0Ao
source: The permission to create app readmes.
ta: பயன்பாட்டு ரீட்ம்களை உருவாக்க இசைவு.

# studio.GJT9SF
source: Export as CSV
ta: காபிம ஆக ஏற்றுமதி

# studio.GMES1s
source: A secret which identifies the app to the login provider
ta: உள்நுழைவு வழங்குநருக்கு பயன்பாட்டை அடையாளம் காணும் ஒரு மறைபொருள்

# studio.GNH+fr
source: Changing a role name will change all of its references in the app.
ta: ஒரு பங்கு பெயரை மாற்றுவது பயன்பாட்டில் உள்ள அனைத்து குறிப்புகளையும் மாற்றும்.

# studio.GNZzUE
source: The query parameter for query parameter authentication
ta: வினவல் அளவுரு அங்கீகாரத்திற்கான வினவல் அளவுரு

# studio.GT6XtR
source: There was a problem cloning the app. Please try again.
ta: பயன்பாட்டை நகலி செய்வதில் சிக்கல் இருந்தது. மீண்டும் முயற்சிக்கவும்.

# studio.GYTZhK
source: Are you sure you want to delete this resource? Deleted resources can not be recovered.
ta: இந்த வளத்தை நீக்க விரும்புகிறீர்களா? நீக்கப்பட்ட வளங்களை மீட்டெடுக்க முடியாது.

# studio.GZdAif
source: If the app is locked, it is prevented from being updated without unlocking it first.
ta: பயன்பாடு பூட்டப்பட்டிருந்தால், முதலில் அதைத் திறக்காமல் புதுப்பிக்கப்படுவதைத் தடுக்கிறது.

# studio.GbCZS7
source: The URL to retrieve the token form
ta: கிள்ளாக்கு படிவத்தை மீட்டெடுப்பதற்கான முகவரி

# studio.GbN1XV
source: Copy any variables the app has.
ta: பயன்பாட்டில் உள்ள எந்த மாறிகளையும் நகலெடுக்கவும்.

# studio.GmeoMq
source: The secret for header based authentication
ta: தலைப்பு அடிப்படையிலான அங்கீகாரத்திற்கான மறைபொருள்

# studio.GqOPgR
source: Delete variable
ta: மாறி நீக்கு

# studio.GufXy5
source: Value
ta: மதிப்பு

# studio.GyGfwz
source: Copy any secrets the app has. Make sure to set their values after cloning
ta: பயன்பாட்டின் எந்த ரகசியங்களையும் நகலெடுக்கவும். குளோனிங்கிற்குப் பிறகு அவற்றின் மதிப்புகளை அமைப்பதை உறுதிசெய்க

# studio.H6ovMB
source: Something went wrong trying to create training
ta: பயிற்சியை உருவாக்க முயற்சிக்கும் ஏதோ தவறு நடந்தது

# studio.HAlOn1
source: Name
ta: பெயர்

# studio.HAw94v
source: This resource is not managed by Appsemble. You can find this resource at {link}
ta: இந்த சான்று AppSemble ஆல் நிர்வகிக்கப்படவில்லை. இந்த வளத்தை {link} இல் காணலாம்

# studio.HFGX12
source: Failed to copy redirect URL to clipboard
ta: கிளிப்போர்டுக்கு முகவரி ஐ நகலெடுப்பதில் தோல்வி

# studio.HFw+a8
source: Add member
ta: உறுப்பினரைச் சேர்க்கவும்

# studio.HFwnMq
source: Something went wrong loading this resource
ta: இந்த வளத்தை ஏற்றுவதில் ஏதோ தவறு ஏற்பட்டது

# studio.HPBE7M
source: Back to apps
ta: பயன்பாடுகளுக்குத் திரும்பு

# studio.HalL+U
source: Unlisted
ta: பட்டியலிடப்படாதது

# studio.HcRiD4
source: Successfully updated app definition
ta: பயன்பாட்டு வரையறை வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# studio.HezXr1
source: The permission to query app assets.
ta: பயன்பாட்டு சொத்துக்களை வினவ இசைவு.

# studio.HiwFxD
source: Delete invite
ta: அழைப்பை நீக்கு

# studio.Hm155y
source: Something went wrong trying to update the app definition
ta: பயன்பாட்டு வரையறையைப் புதுப்பிக்க முயற்சிக்கும் ஏதோ தவறு ஏற்பட்டது

# studio.HxIuLA
source: Add screenshot
ta: திரை காட்சி சேர்க்கவும்

# studio.HzbcJI
source: Disconnect {name} account
ta: {name} கணக்கைத் துண்டிக்கவும்

# studio.I447TL
source: The app you are looking for could not be found.
ta: நீங்கள் தேடும் பயன்பாட்டைக் கண்டுபிடிக்க முடியவில்லை.

# studio.IGL0y6
source: There are currently no organizations available.
ta: தற்போது நிறுவனங்கள் எதுவும் கிடைக்கவில்லை.

# studio.II58L6
source: The private key used to sign the SSL certificate in PEM format
ta: PEM வடிவத்தில் SSL சான்றிதழில் கையெழுத்திடப் பயன்படுத்தப்படும் தனிப்பட்ட விசை

# studio.IJ+Fig
source: Successfully deleted app {name}
ta: வெற்றிகரமாக நீக்கப்பட்ட பயன்பாடு {name}

# studio.IKMcY6
source: Profile Picture
ta: சுயவிவர படம்

# studio.ILfqTN
source: "{roleName}" is being inherited by the following roles:
ta: "{roleName}" பின்வரும் பாத்திரங்களால் மரபுரிமையாக உள்ளது:

# studio.IRIF+a
source: This must be a valid service secret
ta: இது சரியான பணி ரகசியமாக இருக்க வேண்டும்

# studio.IcUakl
source: Time zone
ta: நேர மண்டலம்

# studio.Ie7wfA
source: If a name is set, the asset may be referenced by this name in addition to its ID.
ta: ஒரு பெயர் அமைக்கப்பட்டால், சொத்து அதன் ஐடியுடன் கூடுதலாக இந்த பெயரால் குறிப்பிடப்படலாம்.

# studio.IkH3lh
source: Delete Page
ta: பக்கத்தை நீக்கு

# studio.IkprVS
source: An error has occurred.
ta: பிழை ஏற்பட்டது.

# studio.InWqys
source: Optional
ta: விரும்பினால்

# studio.IqshcZ
source: Are you sure you want to delete this block? This action cannot be reverted.
ta: இந்தத் தொகுதியை நீக்க விரும்புகிறீர்களா? இந்த செயலை மாற்ற முடியாது.

# studio.IsDF9d
source: Copied tenant URL to clipboard
ta: கிளிப்போர்டுக்கு குத்தகைதாரர் முகவரி ஐ நகலெடுத்தார்

# studio.It/Dy0
source: Yes, I want to be kept up to date with Appsemble news.
ta: ஆம், ஆப்செம்பிள் நியூச் மூலம் நான் புதுப்பித்த நிலையில் இருக்க விரும்புகிறேன்.

# studio.J+5t/+
source: Something went wrong when trying to upload messages for this language.
ta: இந்த மொழிக்கான செய்திகளைப் பதிவேற்ற முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.J0xFmK
source: Appsemble logo
ta: பயன்பாட்டு லோகோ

# studio.JAkIqb
source: Visibility
ta: விழிமை

# studio.JBnV+S
source: The permission to update app collections.
ta: பயன்பாட்டு சேகரிப்புகளைப் புதுப்பிக்க இசைவு.

# studio.JCIgkj
source: Username
ta: பயனர்பெயர்

# studio.JD2pwH
source: Organizations
ta: நிறுவனங்கள்

# studio.JMlZGy
source: Public apps are available in the app store. Unlisted apps aren’t listed publicly, but they are accessible using a direct link. Private apps are only visible to organization members.
ta: பொது பயன்பாடுகள் ஆப் ச்டோரில் கிடைக்கின்றன. பட்டியலிடப்படாத பயன்பாடுகள் பகிரங்கமாக பட்டியலிடப்படவில்லை, ஆனால் அவை நேரடி இணைப்பைப் பயன்படுத்தி அணுகக்கூடியவை. தனியார் பயன்பாடுகள் நிறுவன உறுப்பினர்களுக்கு மட்டுமே தெரியும்.

# studio.JPqZ7P
source: Reference documentation for Appsemble app definitions
ta: AppSemble பயன்பாட்டு வரையறைகளுக்கான குறிப்பு ஆவணங்கள்

# studio.JV/lzM
source: Create and manage app groups
ta: பயன்பாட்டு குழுக்களை உருவாக்கி நிர்வகிக்கவும்

# studio.JaWVgv
source: SAML
ta: சாம்ல்

# studio.Jh0bQl
source: Are you sure you want to remove {member} from this app?
ta: இந்த பயன்பாட்டிலிருந்து {member} ஐ அகற்ற விரும்புகிறீர்களா?

# studio.JkLHGw
source: Website
ta: வலைத்தளம்

# studio.JoEUap
source: Error fetching the Training data
ta: பயிற்சி தரவைப் பெறுவதில் பிழை

# studio.Jrk0SZ
source: The permission to delete app invites.
ta: பயன்பாட்டை நீக்க இசைவு அழைக்கிறது.

# studio.Jrs+iV
source: In order to clone apps you must be logged in. Click <loginLink>here</loginLink> to log in using an existing account or <registerLink>here</registerLink> to register a new account.
ta: பயன்பாடுகளை நகலி செய்ய நீங்கள் உள்நுழைந்திருக்க வேண்டும். ஏற்கனவே உள்ள கணக்கைப் பயன்படுத்தி உள்நுழைய </loginlink> இங்கே அல்லது </registerlink> இங்கே </registerlink> புதிய கணக்கைப் பதிவு செய்ய சொடுக்கு செய்க.

# studio.JsZpzQ
source: demo
ta: டெமோ

# studio.JvxqIq
source: The resource definitions in this app definition contain different data from the original. This may cause unexpected results when using older data.
ta: இந்த பயன்பாட்டு வரையறையில் உள்ள வள வரையறைகள் அசலில் இருந்து வெவ்வேறு தரவுகளைக் கொண்டுள்ளன. பழைய தரவைப் பயன்படுத்தும் போது இது எதிர்பாராத முடிவுகளை ஏற்படுத்தக்கூடும்.

# studio.Jx1BPg
source: The username used for authentication for the custom SMTP server.
ta: தனிப்பயன் SMTP சேவையகத்திற்கான அங்கீகாரத்திற்கு பயன்படுத்தப்படும் பயனர்பெயர்.

# studio.K/9MYq
source: This scope is not currently known. You may want to revoke this client.
ta: இந்த நோக்கம் தற்போது அறியப்படவில்லை. இந்த வாடிக்கையாளரை நீங்கள் ரத்து செய்ய விரும்பலாம்.

# studio.K1y1Mm
source: Create new app collection
ta: புதிய பயன்பாட்டு சேகரிப்பை உருவாக்கவும்

# studio.K3r6DQ
source: Delete
ta: நீக்கு

# studio.K56Dim
source: Organization
ta: அமைப்பு

# studio.KB7HTt
source: Something went wrong trying to update your profile.
ta: உங்கள் சுயவிவரத்தைப் புதுப்பிக்க முயற்சிக்கும் ஏதோ தவறு ஏற்பட்டது.

# studio.KFRoYn
source: OAuth client credentials
ta: OAuth கிளையன்ட் நற்சான்றிதழ்கள்

# studio.KGZ3lm
source: The public picture to use for your profile.
ta: உங்கள் சுயவிவரத்திற்கு பயன்படுத்த பொது படம்.

# studio.KK7HV5
source: Default role
ta: இயல்புநிலை பங்கு

# studio.KN7zKn
source: Error
ta: பிழை

# studio.KNWBbl
source: There was a problem loading the history for this resource
ta: இந்த வளத்திற்கான வரலாற்றை ஏற்றுவதில் சிக்கல் இருந்தது

# studio.KPt+Jz
source: Something went wrong when trying to change the locked status of the app.
ta: பயன்பாட்டின் பூட்டப்பட்ட நிலையை மாற்ற முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.KQc7BF
source: Missing redirect URI parameter
ta: திருப்பி விடல் யூரி அளவுருவைக் காணவில்லை

# studio.KQyGdZ
source: Are you sure you want to remove this email address?
ta: இந்த மின்னஞ்சல் முகவரியை அகற்ற விரும்புகிறீர்களா?

# studio.KQzcqr
source: Manager
ta: மேலாளர்

# studio.KWdahu
source: Number can contain a fractional part (2.56, 1.24, 7E-10) and also integers
ta: எண்ணில் ஒரு பகுதியளவு பகுதி (2.56, 1.24, 7e-10) மற்றும் முழு எண்களைக் கொண்டிருக்கலாம்

# studio.KWe3xX
source: <bold>Enable at your own risk</bold>Whether app service secrets can be applied without a security definition. Learn more in the <link>documentation</link>
ta: <Tald> உங்கள் சொந்த ஆபத்தில் இயக்கவும் </BOLD> பாதுகாப்பு வரையறை இல்லாமல் பயன்பாட்டு பணி ரகசியங்களை பயன்படுத்த முடியுமா என்பதை. <nignive> ஆவணம் </இணைப்பு> இல் மேலும் அறிக

# studio.KWwyi1
source: No file selected
ta: எந்த கோப்பும் தேர்ந்தெடுக்கப்படவில்லை

# studio.KdrC46
source: Link your account to the resources created on your behalf.
ta: உங்கள் சார்பாக உருவாக்கப்பட்ட ஆதாரங்களுடன் உங்கள் கணக்கை இணைக்கவும்.

# studio.Kn7A8C
source: View App
ta: பயன்பாட்டைக் காண்க

# studio.KssJcX
source: An email address is required
ta: மின்னஞ்சல் முகவரி தேவை

# studio.KtTNmO
source: Name attribute
ta: பெயர் பண்புக்கூறு

# studio.Kv7C79
source: OAuth2 client credentials
ta: OAuth2 கிளையன்ட் நற்சான்றிதழ்கள்

# studio.KxUbuJ
source: This app is currently locked. No changes can be made without first unlocking the app in the settings.
ta: இந்த பயன்பாடு தற்போது பூட்டப்பட்டுள்ளது. அமைப்புகளில் பயன்பாட்டைத் திறக்காமல் எந்த மாற்றங்களையும் செய்ய முடியாது.

# studio.L0fXYF
source: Unsecured service secrets are enabled, this grants access to anyone to use your service authentication through Appsemble. Learn more in the <link>documentation</link>
ta: பாதுகாப்பற்ற பணி ரகசியங்கள் இயக்கப்பட்டுள்ளன, இது உங்கள் பணி அங்கீகாரத்தை AppSemble மூலம் பயன்படுத்த யாருக்கும் அணுகலை வழங்குகிறது. <nignive> ஆவணம் </இணைப்பு> இல் மேலும் அறிக

# studio.L7kwlX
source: The app doesn’t provide a description for this role
ta: பயன்பாடு இந்த பாத்திரத்திற்கான விளக்கத்தை வழங்காது

# studio.L8rCdY
source: Failed to copy token
ta: கிள்ளாக்கை நகலெடுப்பதில் தோல்வி

# studio.LACMuV
source: Redirect URL copied to clipboard
ta: கிளிப்போர்டுக்கு நகலெடுக்கப்பட்ட முகவரி ஐ திருப்பி விடுங்கள்

# studio.LElVj7
source: Resent verification mail
ta: மனக்குறை சரிபார்ப்பு அஞ்சல்

# studio.LNqVbp
source: Successfully deleted organization.
ta: வெற்றிகரமாக நீக்கப்பட்ட அமைப்பு.

# studio.LP673Z
source: Long description
ta: நீண்ட விளக்கம்

# studio.LQiBIn
source: The SCIM tenant URL
ta: ச்கிம் குத்தகைதாரர் முகவரி

# studio.LRoQwS
source: Successfully copied link to the clipboard
ta: கிளிப்போர்டுக்கான இணைப்பை வெற்றிகரமாக நகலெடுத்தது

# studio.LUfFLk
source: Are you sure you wish to delete the translations for this language? These can not be restored.
ta: இந்த மொழிக்கான மொழிபெயர்ப்புகளை நீக்க விரும்புகிறீர்களா? இவற்றை மீட்டெடுக்க முடியாது.

# studio.LXxsbk
source: Anonymous
ta: அநாமதேய

# studio.Lb1P34
source: This group currently has no members.
ta: இந்த குழுவில் தற்போது உறுப்பினர்கள் இல்லை.

# studio.LbII3k
source: The permission to query app snapshots.
ta: பயன்பாட்டு ச்னாப்சாட்களை வினவுவதற்கு இசைவு.

# studio.Ld4hwc
source: The permission to query app translations.
ta: பயன்பாட்டு மொழிபெயர்ப்புகளை வினவ இசைவு.

# studio.Lj/i+T
source: Create new role
ta: புதிய பாத்திரத்தை உருவாக்கவும்

# studio.Lo8rJD
source: The certificate used to verify the service provider.
ta: பணி வழங்குநரை சரிபார்க்க பயன்படுத்தப்படும் சான்றிதழ்.

# studio.LutOY0
source: Delete training
ta: பயிற்சியை நீக்கு

# studio.Lv0zJu
source: Details
ta: விவரங்கள்

# studio.Lw/3Ki
source: There was a problem deleting your app account. Please try again.
ta: உங்கள் பயன்பாட்டுக் கணக்கை நீக்குவதில் சிக்கல் இருந்தது. மீண்டும் முயற்சிக்கவும்.

# studio.Lxkny3
source: Loading members…
ta: உறுப்பினர்களை ஏற்றுகிறது…

# studio.LyjWxx
source: Successfully added language
ta: வெற்றிகரமாக மொழி சேர்க்கப்பட்டது

# studio.M1v/6S
source: Stop editing
ta: திருத்துதல் நிறுத்துங்கள்

# studio.M2yTxd
source: An integer is a number which is not a fraction; a whole number (..., -2, -1, 0, 1, 2, 3, ...)
ta: ஒரு முழு எண் என்பது ஒரு பகுதியும் இல்லாத எண்; ஒரு முழு எண் (..., -2, -1, 0, 1, 2, 3, ...)

# studio.MFG1+P
source: Field properties
ta: புலம் பண்புகள்

# studio.MHyPpu
source: Export as JSON
ta: சாதொபொகு ஆக ஏற்றுமதி

# studio.MKvv3M
source: There was a problem saving your SSL credentials
ta: உங்கள் எச்எச்எல் நற்சான்றிதழ்களைச் சேமிப்பதில் சிக்கல் இருந்தது

# studio.MNwj2I
source: Create new organization
ta: புதிய அமைப்பை உருவாக்கவும்

# studio.MQ17NC
source: The permission to create app variables.
ta: பயன்பாட்டு மாறிகள் உருவாக்க இசைவு.

# studio.MQcAql
source: Changelog
ta: மாற்றபதிவு

# studio.MTVIlV
source: Loading organization…
ta: ஏற்றுதல் அமைப்பு…
