Repository: 247i/TACETr
Catalog: உரை/தானி/appsemble-appsemble-*.po
Languages: ta

# studio.oYcgWT
source: Copy the resource JSON to clipboard
ta: கிளிப்போர்டுக்கு சாதொபொகு ஐ நகலெடுக்கவும்

# studio.oZ5TXL
source: Link to documentation
ta: ஆவணங்களுக்கான இணைப்பு

# studio.ohf9WS
source: Invalid client id {clientId}.
ta: தவறான கிளையன்ட் ஐடி {clientId}.

# studio.om8L5e
source: Hide properties
ta: பண்புகளை மறைக்க

# studio.otg9XH
source: This field can be used to describe the app in more detail than the app’s description. Supports Markdown syntax.
ta: பயன்பாட்டின் விளக்கத்தை விட பயன்பாட்டை விரிவாக விவரிக்க இந்த புலம் பயன்படுத்தப்படலாம். மார்க் பேரூர் தொடரியல் ஆதரிக்கிறது.

# studio.owyfG1
source: Default Theme
ta: இயல்புநிலை கருப்பொருள்

# studio.oxZwJN
source: The date on which the client credentials expire
ta: வாடிக்கையாளர் நற்சான்றிதழ்கள் காலாவதியாகும் தேதி

# studio.p05LGD
source: An organization with the given ID already exists
ta: கொடுக்கப்பட்ட ஐடியுடன் ஒரு அமைப்பு ஏற்கனவே உள்ளது

# studio.p4N05H
source: Upload
ta: பதிவேற்றும்

# studio.p7eeK6
source: Something went wrong when trying to restore this snapshot.
ta: இந்த ச்னாப்சாட்டை மீட்டெடுக்க முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.pCY3jo
source: The value of the variable
ta: மாறியின் மதிப்பு

# studio.pDN/hZ
source: Are you sure you want to cancel creating this resource? This will discard all inputs!
ta: இந்த வளத்தை உருவாக்குவதை ரத்து செய்ய விரும்புகிறீர்களா? இது அனைத்து உள்ளீடுகளையும் நிராகரிக்கும்!

# studio.pLERft
source: Deleting translations for {language}
ta: {மொழி க்கு க்கான மொழிபெயர்ப்புகளை நீக்குதல்

# studio.pW4lxD
source: Pattern
ta: முறை

# studio.pc+67A
source: A <link>remapper</link> that is applied on the user info object
ta: பயனர் செய்தி பொருளில் பயன்படுத்தப்படும் ஒரு <இணைப்பு> ரீமேப்பர் </இணைப்பு>

# studio.phTfBA
source: Create new account
ta: புதிய கணக்கை உருவாக்கவும்

# studio.pmzm1P
source: Default value
ta: இயல்புநிலை மதிப்பு

# studio.pn2dEs
source: Redirect URL
ta: முகவரி ஐ திருப்பி விடுங்கள்

# studio.pr6SmF
source: Import from file
ta: கோப்பிலிருந்து இறக்குமதி

# studio.psLpik
source: Instruction Video
ta: அறிவுறுத்தல் வீடியோ

# studio.puSpQ5
source: The permission to create trainings.
ta: பயிற்சிகளை உருவாக்க இசைவு.

# studio.pvtgR2
source: Decline
ta: வீழ்ச்சி

# studio.pwempj
source: There was a problem loading the members of this organization.
ta: இந்த அமைப்பின் உறுப்பினர்களை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.pwlQEY
source: Display Name
ta: காட்சி பெயர்

# studio.pysIuq
source: Client credentials
ta: கிளையன்ட் நற்சான்றிதழ்கள்

# studio.q+mDGX
source: You have exceeded the daily email quota for the app "{app}".
ta: "{app}" பயன்பாட்டிற்கான நாள்தோறும் மின்னஞ்சல் ஒதுக்கீட்டை நீங்கள் மீறிவிட்டீர்கள்.

# studio.qClp9t
source: There was a problem copying the code sample
ta: குறியீடு மாதிரியை நகலெடுப்பதில் சிக்கல் இருந்தது

# studio.qDwvZ4
source: Unknown error
ta: தெரியாத பிழை

# studio.qFTxb3
source: Scale
ta: அளவு

# studio.qGxjxU
source: Identity provider certificate
ta: அடையாள வழங்குநர் சான்றிதழ்

# studio.qJje/s
source: Invited
ta: அழைக்கப்பட்டார்

# studio.qP/WLS
source: "{roleName}" is being used in in Groups Invite.
ta: குழுக்கள் அழைப்பில் "{roleName}" பயன்படுத்தப்படுகிறது.

# studio.qcsBrp
source: Register New Account
ta: புதிய கணக்கை பதிவு செய்யுங்கள்

# studio.qjYNH9
source: You have an unsaved resource
ta: உங்களிடம் சேமிக்கப்படாத சான்று உள்ளது

# studio.ql9rKu
source: Error loading app messages
ta: பயன்பாட்டு செய்திகளை ஏற்றுவதில் பிழை

# studio.qlcuNQ
source: ID
ta: ஐடி

# studio.qm1D4w
source: There was a problem
ta: ஒரு சிக்கல் இருந்தது

# studio.qmqkl9
source: Successfully changed role of {name} to {role}.
ta: {name} இன் {பாத்திரத்தின் பங்கை வெற்றிகரமாக மாற்றியது.

# studio.qqW9Os
source: Browse the apps that are built using Appsemble
ta: AppSemble ஐப் பயன்படுத்தி கட்டப்பட்ட பயன்பாடுகளை உலாவுக

# studio.qxLJfs
source: Get a single {resourceName} resource
ta: ஒற்றை {resourceName} வளத்தைப் பெறுங்கள்

# studio.qyDtDE
source: SSL credentials saved successfully
ta: எச்எச்எல் நற்சான்றிதழ்கள் வெற்றிகரமாக சேமிக்கப்பட்டன

# studio.qzFcWI
source: Primary Color
ta: முதன்மை நிறம்

# studio.r0mqR5
source: A short description to render in the overview
ta: கண்ணோட்டத்தில் வழங்க ஒரு குறுகிய விளக்கம்

# studio.rGmxAI
source: Difficulty
ta: தொல்லை

# studio.rV6IqG
source: Are you sure you want to delete this app account?
ta: இந்த பயன்பாட்டுக் கணக்கை நீக்க விரும்புகிறீர்களா?

# studio.rWPtv+
source: Query parameter
ta: வினவல் அளவுரு

# studio.rbrahO
source: Close
ta: மூடு

# studio.rgudrj
source: Browse the different organizations who are using Appsemble
ta: AppSemble ஐப் பயன்படுத்தும் வெவ்வேறு நிறுவனங்களை உலாவுக

# studio.rjAlQ4
source: The permission to query app resources.
ta: பயன்பாட்டு ஆதாரங்களை வினவ இசைவு.

# studio.rzCvRt
source: Family
ta: குடும்பம்

# studio.s09DoT
source: Logs from container
ta: கொள்கலனில் இருந்து பதிவுகள்

# studio.s2tS1D
source: No Training Data found
ta: பயிற்சி தரவு எதுவும் கிடைக்கவில்லை

# studio.s3IOQQ
source: Edit {name}
ta: திருத்து {name}

# studio.s3s2y0
source: This will override all the messages for {language}
ta: இது {மொழி க்கு க்கான அனைத்து செய்திகளையும் மேலெழுதும்

# studio.s9CLUo
source: Loading snapshots…
ta: ச்னாப்சாட்களை ஏற்றுகிறது…

# studio.s9TOJ9
source: The following resource queries are using the role "{roleName}":
ta: பின்வரும் வள வினவல்கள் "{roleName}" என்ற பாத்திரத்தைப் பயன்படுத்துகின்றன:

# studio.sBzEh+
source: This page lists all apps which have been connected to your account using a login method.
ta: உள்நுழைவு முறையைப் பயன்படுத்தி உங்கள் கணக்கில் இணைக்கப்பட்டுள்ள அனைத்து பயன்பாடுகளையும் இந்த பக்கம் பட்டியலிடுகிறது.

# studio.sE+ZXx
source: Additional properties
ta: கூடுதல் பண்புகள்

# studio.sEJCEI
source: SCIM token
ta: ச்கிம் கிள்ளாக்கு

# studio.sGaEsd
source: Border
ta: எல்லை

# studio.sIP2Kq
source: Would you like to add a new language?
ta: புதிய மொழியைச் சேர்க்க விரும்புகிறீர்களா?

# studio.sJwguN
source: Success Color
ta: செய் நிறம்

# studio.sMvj26
source: The permission to delete blocks for an organization.
ta: ஒரு நிறுவனத்திற்கான தொகுதிகளை நீக்க இசைவு.

# studio.sNygZC
source: There was a problem loading the app collection. Please try again.
ta: பயன்பாட்டு சேகரிப்பை ஏற்றுவதில் சிக்கல் இருந்தது. மீண்டும் முயற்சிக்கவும்.

# studio.sS88v+
source: Core style
ta: கோர் பாணி

# studio.sZBZsJ
source: Searching for: {cleanedNeedle}
ta: தேடுகிறது: {cleanedNeedle}

# studio.sa1orx
source: There was a problem creating the organization.
ta: அமைப்பை உருவாக்குவதில் சிக்கல் இருந்தது.

# studio.sfFhiy
source: Maximum value
ta: அதிகபட்ச மதிப்பு

# studio.sjzLbX
source: Accept
ta: ஏற்றுக்கொள்

# studio.slZvEA
source: This needs to be a valid Google Analytics ID
ta: இது செல்லுபடியாகும் கூகிள் அனலிட்டிக்ச் ஐடியாக இருக்க வேண்டும்

# studio.snEcFS
source: Read app resources
ta: பயன்பாட்டு ஆதாரங்களைப் படியுங்கள்

# studio.snSsXF
source: No OAuth2 secrets have been configured yet.
ta: OAUTH2 ரகசியங்கள் எதுவும் இன்னும் கட்டமைக்கப்படவில்லை.

# studio.sotU5O
source: This URL serves metadata for Appsemble as service provider
ta: இந்த முகவரி பணி வழங்குநராக AppSemble க்கான மெட்டாடேட்டாவை வழங்குகிறது

# studio.ssWhHg
source: The SSL certificate is missing. If this persists, try updating this field an changing it back.
ta: எச்எச்எல் சான்றிதழ் இல்லை. இது தொடர்ந்தால், இந்த புலத்தை மீண்டும் மாற்ற முயற்சிக்கவும்.

# studio.sy+pv5
source: Email
ta: மின்னஞ்சல்

# studio.syEQFE
source: Publish
ta: வெளியிடுங்கள்

# studio.szQT/W
source: Selected language
ta: தேர்ந்தெடுக்கப்பட்ட மொழி

# studio.t1Iyem
source: App definition
ta: பயன்பாட்டு வரையறை

# studio.t2Wr8I
source: Primary
ta: முதன்மை

# studio.t4HlYe
source: Loading group…
ta: குழு ஏற்றுகிறது…

# studio.t4NVlC
source: Deleting secret
ta: ரகசியத்தை நீக்குதல்

# studio.tVSG3w
source: Email verified attribute
ta: சரிபார்க்கப்பட்ட பண்புக்கூறு மின்னஞ்சல்

# studio.tWkQ2J
source: Author
ta: நூலாசிரியர்

# studio.tcaeP9
source: All Apps
ta: அனைத்து பயன்பாடுகளும்

# studio.teY0dK
source: Shared style
ta: பகிரப்பட்ட நடை

# studio.tg9/Lr
source: Expert description
ta: வல்லுநர் விளக்கம்

# studio.tkC3xo
source: App store
ta: ஆப் கடை

# studio.tnRDuU
source: Revoke
ta: ரத்து செய்யுங்கள்

# studio.tr0YPg
source: Variables
ta: மாறிகள்

# studio.u+okAv
source: Something went wrong when sending the verification mail.
ta: சரிபார்ப்பு அஞ்சலை அனுப்பும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.u4L4yd
source: You have unsaved changes
ta: நீங்கள் சேமிக்கப்படாத மாற்றங்கள் உள்ளன

# studio.u7djqV
source: Ascending
ta: ஏறுதல்

# studio.uAPm+d
source: Client id
ta: வாங்கி ஐடி

# studio.uKgreU
source: The name by which the variable will be accessible
ta: மாறி அணுகக்கூடிய பெயர்

# studio.uMhpKe
source: Color
ta: நிறம்

# studio.uRCjuc
source: An app collection with this name already exists in this organization.
ta: இந்த பெயரைக் கொண்ட பயன்பாட்டு சேகரிப்பு ஏற்கனவே இந்த நிறுவனத்தில் உள்ளது.

# studio.ub1kHa
source: Add to collection
ta: சேகரிப்பில் சேர்க்கவும்

# studio.ueImzj
source: Successfully deleted secret {name}
ta: வெற்றிகரமாக நீக்கப்பட்டது மறைபொருள் {name}

# studio.ueJswO
source: There was a problem loading the app details.
ta: பயன்பாட்டு விவரங்களை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.uhu5aG
source: Public
ta: பொது

# studio.uiL7XC
source: Authorization URL
ta: அங்கீகார முகவரி

# studio.ulrsBf
source: Certificate authority
ta: சான்றிதழ் ஆணையம்

# studio.utJghl
source: The following resources are using the role "{roleName}":
ta: பின்வரும் வளங்கள் "{roleName}" என்ற பாத்திரத்தைப் பயன்படுத்துகின்றன:

# studio.utbyMo
source: Please select a file
ta: ஒரு கோப்பைத் தேர்ந்தெடுக்கவும்

# studio.utlWEf
source: The permission to create group invites.
ta: குழு அழைப்புகளை உருவாக்க இசைவு.

# studio.uwcEjh
source: An optional name to give extra clarity what the secret is used for.
ta: மறைபொருள் எதைப் பயன்படுத்துகிறது என்பதை கூடுதல் தெளிவுபடுத்த ஒரு விருப்ப பெயர்.

# studio.uzN4CO
source: The permission to view private apps of an organization.
ta: ஒரு நிறுவனத்தின் தனிப்பட்ட பயன்பாடுகளைக் காண இசைவு.

# studio.v5qzmw
source: URL pattern(s)
ta: முகவரி முறை (கள்)

# studio.v9WALR
source: The username for HTTP basic authentication
ta: HTTP அடிப்படை அங்கீகாரத்திற்கான பயனர்பெயர்

# studio.v9WChN
source: Add new secret
ta: புதிய ரகசியத்தைச் சேர்க்கவும்

# studio.vLwklu
source: There was a problem loading your SSL credentials
ta: உங்கள் எச்எச்எல் நற்சான்றிதழ்களை ஏற்றுவதில் சிக்கல் இருந்தது

# studio.vMfCdf
source: The open source low-code app building platform
ta: திறந்த மூல குறைந்த குறியீடு பயன்பாட்டு கட்டிட தளம்

# studio.vNnC9v
source: Appsemble server logs
ta: AppSemble சேவையக பதிவுகள்

# studio.vSv0O7
source: OAuth2 client credentials allow applications to perform actions on your behalf.
ta: OAUTH2 கிளையன்ட் நற்சான்றிதழ்கள் உங்கள் சார்பாக செயல்களைச் செய்ய பயன்பாடுகளை அனுமதிக்கின்றன.

# studio.vUOBIG
source: AppContentsExplorer
ta: பயன்பாட்டு உள்ளடக்க எக்ச்ப்ளோரர்

# studio.vaNOFj
source: Delete app from collection
ta: சேகரிப்பிலிருந்து பயன்பாட்டை நீக்கு

# studio.vdaySH
source: Whitespace
ta: வைட்ச்பேச்

# studio.vdkVyV
source: A page must have at least one block
ta: ஒரு பக்கத்தில் குறைந்தது ஒரு தொகுதி இருக்க வேண்டும்

# studio.veYfyC
source: Are you sure you want to delete this group? This action cannot be undone.
ta: இந்த குழுவை நீக்க விரும்புகிறீர்களா? இந்த செயலை செயல்தவிர்க்க முடியாது.

# studio.vhBxKa
source: You can use {markdownLink} to format your description. To upload images, use a service like {imageHostingLink}.
ta: உங்கள் விளக்கத்தை வடிவமைக்க {markdownLink} ஐப் பயன்படுத்தலாம். படங்களை பதிவேற்ற, {imageHostingLink} போன்ற சேவையைப் பயன்படுத்தவும்.

# studio.viXE32
source: Private
ta: தனிப்பட்ட

# studio.vmaAvz
source: Set as primary
ta: முதன்மை என அமைக்கவும்

# studio.vonwx2
source: The domain name on which this app collection is available. For more information on how to set this up, please refer to the <link>documentation</link>.
ta: இந்த பயன்பாட்டு சேகரிப்பு கிடைக்கக்கூடிய டொமைன் பெயர். இதை எவ்வாறு அமைப்பது என்பது பற்றிய கூடுதல் தகவலுக்கு, <இணைப்பு> ஆவணங்கள் </இணைப்பு> ஐப் பார்க்கவும்.

# studio.vqCIsd
source: The permission to create app secrets.
ta: பயன்பாட்டு ரகசியங்களை உருவாக்க இசைவு.

# studio.vr3jcJ
source: Are you sure you want to delete this app from this collection? This will not delete the app itself.
ta: இந்தத் தொகுப்பிலிருந்து இந்த பயன்பாட்டை நீக்க விரும்புகிறீர்களா? இது பயன்பாட்டை நீக்காது.

# studio.vx0nkZ
source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

# studio.w3ATo0
source: Currently there are no {type} resources available.
ta: தற்போது {type} வளங்கள் கிடைக்கவில்லை.

# studio.w6wF5r
source: If this is specified, Google analytics will be applied to your app. For more information, please refer to the <link>documentation</link>.
ta: இது குறிப்பிடப்பட்டால், உங்கள் பயன்பாட்டில் Google Analytics பயன்படுத்தப்படும். மேலும் தகவலுக்கு, <இணைப்பு> ஆவணங்கள் </இணைப்பு> ஐப் பார்க்கவும்.

# studio.w7NAmV
source: Create role
ta: பாத்திரத்தை உருவாக்குங்கள்

# studio.w9ZBOn
source: Regenerate SCIM token
ta: ச்கிம் கிள்ளாக்கை மீளுருவாக்கம் செய்யுங்கள்

# studio.wEQDC6
source: Edit
ta: தொகு

# studio.wL7VAE
source: Actions
ta: செயல்கள்

# studio.wM/ueE
source: The app definition for {appName}
ta: {Appname க்கு க்கான பயன்பாட்டு வரையறை

# studio.wRZVkH
source: The custom certificate authority. Can be a chain of certificates in PEM format
ta: தனிப்பயன் சான்றிதழ் ஆணையம். PEM வடிவத்தில் சான்றிதழ்களின் சங்கிலியாக இருக்கலாம்

# studio.wSZR47
source: Submit
ta: சமர்ப்பிக்கவும்

# studio.wTuNvs
source: Please enter the correct Organisation Id.
ta: சரியான அமைப்பு ஐடியை உள்ளிடவும்.

# studio.wVyEN/
source: Reference documentation for Appsemble action definitions
ta: AppSemble செயல் வரையறைகளுக்கான குறிப்பு ஆவணங்கள்

# studio.wmyg6t
source: Resource
ta: வள

# studio.wshv5u
source: There was a problem loading your client credentials.
ta: உங்கள் வாடிக்கையாளர் நற்சான்றிதழ்களை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.wvoA3H
source: Picture
ta: படம்

# studio.wxKWWa
source: Expert photo
ta: வல்லுநர் புகைப்படம்

# studio.wyxJrL
source: Delete account
ta: கணக்கை நீக்கு

# studio.wzYUkW
source: Copy this into the callback URI field of the provider
ta: இதை வழங்குநரின் கால்பேக் யூரி புலத்தில் நகலெடுக்கவும்

# studio.wzfH0V
source: If checked, other people may view the app definition of this app.
ta: சரிபார்க்கப்பட்டால், மற்றவர்கள் இந்த பயன்பாட்டின் பயன்பாட்டு வரையறையைக் காணலாம்.

# studio.xCZxVs
source: An SSL certificate is being generated to secure your users.
ta: உங்கள் பயனர்களைப் பாதுகாக்க ஒரு SSL சான்றிதழ் உருவாக்கப்படுகிறது.

# studio.xHhWgf
source: You need at least 3 characters to start searching
ta: தேடத் தொடங்க உங்களுக்கு குறைந்தது 3 எழுத்துக்கள் தேவை

# studio.xJNj62
source: Any of the following:
ta: பின்வருவனவற்றில் ஏதேனும்:

# studio.xTZrx0
source: Successfully deleted messages
ta: வெற்றிகரமாக நீக்கப்பட்ட செய்திகள்

# studio.xbYTxC
source: Deleting an organization cannot be undone. Organizations with blocks or app collections cannot be removed.
ta: ஒரு அமைப்பை நீக்குவது செயல்தவிர்க்க முடியாது. தொகுதிகள் அல்லது பயன்பாட்டு சேகரிப்புகளைக் கொண்ட நிறுவனங்களை அகற்ற முடியாது.

# studio.xfR9j2
source: BlockManager
ta: பிளாக்மேனேசர்

# studio.xg78+f
source: The name ID is missing from the SAML response.
ta: SAML பதிலில் இருந்து பெயர் ஐடி இல்லை.

# studio.xhQMeQ
source: Expires
ta: காலாவதியாகிறது

# studio.xkWE9y
source: This organization has {apps} published app(s). The app(s) will be deleted with the organization. Are you sure you want to delete this organization?
ta: இந்த அமைப்பில் {apps} வெளியிடப்பட்ட பயன்பாடு (கள்) உள்ளன. பயன்பாடு (கள்) நிறுவனத்துடன் நீக்கப்படும். இந்த அமைப்பை நீக்க விரும்புகிறீர்களா?

# studio.xkq49p
source: There was a problem loading the OAuth2 secrets.
ta: OAuth2 ரகசியங்களை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.xl27nc
source: Reset Password
ta: கடவுச்சொல்லை மீட்டமைக்கவும்

# studio.xmcVZ0
source: Search
ta: தேடல்

# studio.xoo3WL
source: There was a problem saving the SCIM settings
ta: SCIM அமைப்புகளைச் சேமிப்பதில் சிக்கல் இருந்தது

# studio.xr3EHZ
source: Secure
ta: பாதுகாப்பானது

# studio.xrk6zg
source: Updated
ta: புதுப்பிக்கப்பட்டது

# studio.xtNpbt
source: Role already exists.
ta: பங்கு ஏற்கனவே உள்ளது.

# studio.xwEc8K
source: API
ta: பநிஇ

# studio.xyO6pD
source: Successfully deleted logo
ta: லோகோவை வெற்றிகரமாக நீக்கியது

# studio.xzWgp6
source: The display name of the organization
ta: அமைப்பின் காட்சி பெயர்

# studio.y+mqVR
source: The fully resolved SSL certificate in PEM format
ta: PEM வடிவத்தில் முழுமையாக தீர்க்கப்பட்ட SSL சான்றிதழ்

# studio.y/bmsG
source: Allow
ta: இசைவு

# studio.y1Z3or
source: Language
ta: மொழி

# studio.y9Afg8
source: Successfully copied the resource to clipboard.
ta: கிளிப்போர்டுக்கு வளத்தை வெற்றிகரமாக நகலெடுத்தது.

# studio.y9L/B3
source: This needs to be a valid email address
ta: இது சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்

# studio.yA2xBS
source: Leaving organization
ta: அமைப்பை விட்டு

# studio.yAQvyu
source: Something went wrong when copying the resource to the clipboard.
ta: வளத்தை கிளிப்போர்டில் நகலெடுக்கும் போது ஏதோ தவறு ஏற்பட்டது.

# studio.yAtJ0m
source: Theme Color
ta: கருப்பொருள் நிறம்

# studio.yCmZc8
source: You successfully rated this app!
ta: இந்த பயன்பாட்டை வெற்றிகரமாக மதிப்பிட்டீர்கள்!

# studio.yL26VP
source: Import From File
ta: கோப்பிலிருந்து இறக்குமதி

# studio.yMyg2P
source: The permission to query app invites.
ta: வினவல் பயன்பாடு அழைக்கிறது.

# studio.yQqaoM
source: Resend invite
ta: அழைப்பிதழ் மீண்டும்

# studio.yUlBzE
source: Editing group
ta: திருத்துதல் குழு

# studio.yinfhe
source: Loading Training data...
ta: பயிற்சி தரவை ஏற்றுகிறது ...

# studio.yjZtkP
source: There was a problem loading the apps. Please try reloading the page.
ta: பயன்பாடுகளை ஏற்றுவதில் சிக்கல் இருந்தது. பக்கத்தை மீண்டும் ஏற்ற முயற்சிக்கவும்.

# studio.ypYcOj
source: This URL serves metadata for the identify provider
ta: இந்த முகவரி அடையாளம் காணும் வழங்குநருக்கு மெட்டாடேட்டாவை வழங்குகிறது

# studio.yrylfs
source: There was an error while fetching the blocks.
ta: தொகுதிகள் பெறும்போது பிழை ஏற்பட்டது.

# studio.yyC1Ex
source: Let us know how we can improve Appsemble
ta: AppSemble ஐ எவ்வாறு மேம்படுத்தலாம் என்பதை எங்களுக்குத் தெரியப்படுத்துங்கள்

# studio.z2YelC
source: System fields are fields that are automaticaly created with every new resource in Appsemble.
ta: கணினி புலங்கள் என்பது AppSemble இல் உள்ள ஒவ்வொரு புதிய வளத்துடனும் தானாக உருவாக்கப்படும் புலங்கள்.

# studio.zAA8S4
source: You need a role first to set to default!
ta: இயல்புநிலைக்கு அமைக்க உங்களுக்கு முதலில் ஒரு பங்கு தேவை!

# studio.zCFjlf
source: Something went wrong when trying to load the list of members.
ta: உறுப்பினர்களின் பட்டியலை ஏற்ற முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.zF7Cth
source: Guest
ta: விருந்தினர்

# studio.zHImVw
source: Failed to save.
ta: சேமிக்கத் தவறிவிட்டது.

# studio.zHUl3w
source: The permission to delete app resources.
ta: பயன்பாட்டு ஆதாரங்களை நீக்க இசைவு.

# studio.zINlao
source: Owner
ta: உரிமையாளர்

# studio.zQLEfz
source: Format
ta: வடிவம்

# studio.zR3D4p
source: The permission to update app resources.
ta: பயன்பாட்டு ஆதாரங்களை புதுப்பிக்க இசைவு.

# studio.zT+3Nm
source: A flow page must have at least two sub-pages
ta: ஒரு ஓட்டப் பக்கத்தில் குறைந்தது இரண்டு துணை பக்கங்கள் இருக்க வேண்டும்

# studio.zVajF8
source: Header based authentication
ta: தலைப்பு அடிப்படையிலான ஏற்பு

# studio.zX/a3U
source: Delete {amount} {amount, plural, one {resource} other {resources}}
ta: {amount} {தொகை, பன்மை, ஒன்று {resource} பிற {resources}}

# studio.zZgIyO
source: The display name which is exposed to the app
ta: பயன்பாட்டிற்கு வெளிப்படும் காட்சி பெயர்

# studio.zcQwQW
source: The permission to update trainings.
ta: பயிற்சிகளைப் புதுப்பிக்க இசைவு.

# studio.zeLyJL
source: The permission to query organization invites.
ta: வினவல் அமைப்பு அழைக்கிறது.

# studio.zhvLV9
source: Link Color
ta: இணைப்பு நிறம்

# studio.zji8KM
source: Allow {app} to perform the following actions on your behalf?
ta: உங்கள் சார்பாக பின்வரும் செயல்களைச் செய்ய {பயன்பாட்டை அனுமதிக்கவா?

# studio.zo9Szm
source: Deleting an app collection cannot be undone.
ta: பயன்பாட்டு சேகரிப்பை நீக்குவது செயல்தவிர்க்க முடியாது.

# studio.zoSzG+
source: Switch to GUI Editor
ta: GUI எடிட்டருக்கு மாறவும்

# studio.zwurmB
source: Cookie
ta: குக்கீ
