Repository: 247i/TACETr
Catalog: உரை/தானி/appsemble-appsemble-*.po
Languages: ta

# app./55J3j
source: Subscribed successfully!
ta: வெற்றிகரமாக குழுசேர்ந்தது!

# app.08ZQZZ
source: Notifications have been blocked. Please update your notification permissions and try again.
ta: அறிவிப்புகள் தடுக்கப்பட்டுள்ளன. உங்கள் அறிவிப்பு அனுமதிகளைப் புதுப்பித்து மீண்டும் முயற்சிக்கவும்.

# app.0Mbf4A
source: Change Group
ta: குழு மாற்றவும்

# app.0aO9Nm
source: Your invite could not be found.
ta: உங்கள் அழைப்பைக் கண்டுபிடிக்க முடியவில்லை.

# app.3zjiGZ
source: Successfully updated profile.
ta: சுயவிவரம் வெற்றிகரமாக புதுப்பிக்கப்பட்டது.

# app.47FYwb
source: Cancel
ta: ரத்துசெய்

# app.5JcXdV
source: Create Account
ta: கணக்கை உருவாக்கவும்

# app.5sg7KC
source: Password
ta: கடவுச்சொல்

# app.7L86Z5
source: Member
ta: உறுப்பினர்

# app.7Lfwtm
source: An unexpected error occurred while logging in
ta: உள்நுழையும்போது எதிர்பாராத பிழை ஏற்பட்டது

# app.7tSUe8
source: Back to login
ta: உள்நுழைவுக்குத் திரும்பு

# app.858KSI
source: Successfully unsubscribed from notifications.
ta: அறிவிப்புகளிலிருந்து வெற்றிகரமாக குழுவிலகப்பட்டது.

# app.AyGauy
source: Login
ta: புகுபதிவு

# app.Azs7Bx
source: Access was denied
ta: அணுகல் மறுக்கப்பட்டது

# app.C81/uG
source: Logout
ta: வெளியேற்றம்

# app.CSfqxX
source: Successfully declined joining {appName}
ta: {AppName whill இல் சேர வெற்றிகரமாக மறுத்துவிட்டது

# app.D3idYv
source: Settings
ta: அமைப்புகள்

# app.Ejhdi4
source: Feedback
ta: கருத்து

# app.EuI3Ag
source: Successfully joined {groupName}
ta: வெற்றிகரமாக {groupName}

# app.G1UGLZ
source: There was a problem submitting this form.
ta: இந்த படிவத்தை சமர்ப்பிப்பதில் சிக்கல் இருந்தது.

# app.G6hIMy
source: Public profile
ta: பொது சுயவிவரம்

# app.GJOhb3
source: View in app store
ta: ஆப் ச்டோரில் காண்க

# app.Gw440T
source: Return to login page
ta: உள்நுழைவு பக்கத்திற்குத் திரும்பு

# app.HpoDwk
source: Group
ta: குழு

# app.HvTaVW
source: Clean State
ta: தூய்மையான நிலை

# app.IKMcY6
source: Profile Picture
ta: சுயவிவர படம்

# app.IzjIPk
source: Join group
ta: குழுவில் சேரவும்

# app.J+dIsA
source: Subscriptions
ta: சந்தாக்கள்

# app.JsZpzQ
source: demo
ta: டெமோ

# app.KB7HTt
source: Something went wrong trying to update your profile.
ta: உங்கள் சுயவிவரத்தைப் புதுப்பிக்க முயற்சிக்கும் ஏதோ தவறு ஏற்பட்டது.

# app.KGZ3lm
source: The public picture to use for your profile.
ta: உங்கள் சுயவிவரத்திற்கு பயன்படுத்த பொது படம்.

# app.KQzcqr
source: Manager
ta: மேலாளர்

# app.KTZPFD
source: Successfully declined joining {groupName}
ta: {குழு பெயர் ining இல் சேர வெற்றிகரமாக மறுத்துவிட்டது

# app.KciU4I
source: No Group
ta: குழு இல்லை

# app.MIgL6y
source: Edit password
ta: கடவுச்சொல்லைத் திருத்தவும்

# app.MafjU7
source: Request failed. Token may be invalid.
ta: கோரிக்கை தோல்வியடைந்தது. கிள்ளாக்கு செல்லாது.

# app.MdYlyH
source: Share on {name}
ta: {பெயரில் பகிரவும்

# app.NAidKb
source: Notifications
ta: அறிவிப்புகள்

# app.NTlUtE
source: Successfully joined {appName}
ta: வெற்றிகரமாக {appName}

# app.NrCboF
source: Not subscribed
ta: குழுசேரவில்லை

# app.OJpqEr
source: An unexpected error has occurred.
ta: எதிர்பாராத பிழை ஏற்பட்டது.

# app.OKhRC6
source: Share
ta: பங்கு

# app.Pgb3Xj
source: Subscribed
ta: சந்தா

# app.RXkfY1
source: Change Role
ta: பங்கு மாற்றவும்

# app.SDua+Y
source: Return to app
ta: பயன்பாட்டிற்கு திரும்பவும்

# app.SLVblb
source: There was a problem loading your invite.
ta: உங்கள் அழைப்பை ஏற்றுவதில் சிக்கல் இருந்தது.

# app.T6jAnc
source: Change Selected Group “{selectedGroupName}”
ta: தேர்ந்தெடுக்கப்பட்ட குழுவை மாற்றவும் “{selectedGroupName}”

# app.TvQAtW
source: Your email was successfully verified!
ta: உங்கள் மின்னஞ்சல் வெற்றிகரமாக சரிபார்க்கப்பட்டது!

# app.UHsAfL
source: Select Group
ta: குழுவைத் தேர்ந்தெடுக்கவும்

# app.V9YOMv
source: Select a group role
ta: குழு பாத்திரத்தைத் தேர்ந்தெடுக்கவும்

# app.VL5z0t
source: This is the name that displays for other users.
ta: இது மற்ற பயனர்களைக் காண்பிக்கும் பெயர்.

# app.VVEa+s
source: Login with {name}
ta: {பெயர் with உடன் உள்நுழைக

# app.W9mcKw
source: Select a file
ta: ஒரு கோப்பைத் தேர்ந்தெடுக்கவும்

# app.WEukQ/
source: The email address {email} is already associated with an account. If you wish to connect the existing account with the new login method, please log in using one of the already associated methods.
ta: மின்னஞ்சல் முகவரி {email} ஏற்கனவே ஒரு கணக்குடன் தொடர்புடையது. புதிய உள்நுழைவு முறையுடன் இருக்கும் கணக்கை நீங்கள் இணைக்க விரும்பினால், தயவுசெய்து ஏற்கனவே தொடர்புடைய முறைகளில் ஒன்றைப் பயன்படுத்தி உள்நுழைக.

# app.WanAoP
source: Subscribing to an app allows for the app creators to connect with their users by sending push notifications.
ta: பயன்பாட்டிற்கு குழுசேர்வது பயன்பாட்டு படைப்பாளர்களை புச் அறிவிப்புகளை அனுப்புவதன் மூலம் தங்கள் பயனர்களுடன் இணைக்க அனுமதிக்கிறது.

# app.Wd+wHl
source: Save Profile
ta: சுயவிவரத்தை சேமிக்கவும்

# app.Yqebpa
source: Would you like to join the group {groupName}?
ta: குழுவில் சேர விரும்புகிறீர்களா? குழு பெயர்}?

# app.Yy/yDL
source: Reset password
ta: கடவுச்சொல்லை மீட்டமைக்கவும்

# app.aIRWQB
source: Back to home
ta: வீட்டிற்கு திரும்பவும்

# app.cctOA4
source: Unsubscribe
ta: குழுவிலகவும்

# app.dFRGND
source: Get notified when “{resource}” is updated
ta: “{resource}” புதுப்பிக்கப்படும் போது அறிவிக்கப்படும்

# app.deEeEI
source: Register
ta: பதிவு செய்யுங்கள்

# app.eOr7hk
source: Would you like to join {appName}?
ta: {AppName your இல் சேர விரும்புகிறீர்களா?

# app.g/aJYU
source: Get notified when “{resource}” is deleted
ta: “{resource}” நீக்கப்படும் போது அறிவிக்கப்படும்

# app.g9Ii4M
source: Leave group
ta: குழு விடுப்பு

# app.gczcC5
source: Subscribe
ta: குழுசேர்

# app.hRHARm
source: App Snapshot ID: {id}
ta: பயன்பாட்டு ச்னாப்சாட் ஐடி: {id}

# app.itPgxd
source: Profile
ta: சுயவிவரம்

# app.jdtAcl
source: Account verification
ta: கணக்கு சரிபார்ப்பு

# app.ji+1KV
source: Select a role to create an account with
ta: ஒரு கணக்கை உருவாக்க ஒரு பாத்திரத்தைத் தேர்ந்தெடுக்கவும்

# app.m5PfC2
source: An app member with this email already exists.
ta: இந்த மின்னஞ்சலுடன் ஒரு பயன்பாட்டு உறுப்பினர் ஏற்கனவே இருக்கிறார்.

# app.n9hgKp
source: A group member with this email already exists.
ta: இந்த மின்னஞ்சலுடன் ஒரு குழு உறுப்பினர் ஏற்கனவே இருக்கிறார்.

# app.nuWwea
source: Login failed
ta: உள்நுழைவு தோல்வியடைந்தது

# app.ox304v
source: An error occurred
ta: பிழை ஏற்பட்டது

# app.pSXHvd
source: Get notified when “{resource}” is created
ta: “{resource}” உருவாக்கப்படும்போது அறிவிக்கப்படும்

# app.pvtgR2
source: Decline
ta: வீழ்ச்சி

# app.pwlQEY
source: Display Name
ta: காட்சி பெயர்

# app.pyibG9
source: {resource} subscriptions
ta: {resource} சந்தாக்கள்

# app.sjzLbX
source: Accept
ta: ஏற்றுக்கொள்

# app.skx0qY
source: Unable to subscribe. Either no permission has been granted or your device does not support notifications.
ta: குழுசேர முடியவில்லை. எந்த அனுமதியும் வழங்கப்படவில்லை அல்லது உங்கள் சாதனம் அறிவிப்புகளை ஆதரிக்கவில்லை.

# app.swOBKP
source: Share via email
ta: மின்னஞ்சல் வழியாக பகிரவும்

# app.swaMky
source: Preferred language for this app
ta: இந்த பயன்பாட்டிற்கு விருப்பமான மொழி

# app.ugztWG
source: You must set a password for your app member account.
ta: உங்கள் பயன்பாட்டு உறுப்பினர் கணக்கிற்கான கடவுச்சொல்லை அமைக்க வேண்டும்.

# app.upN42Q
source: Select an app member to login as
ta: உள்நுழைய ஒரு பயன்பாட்டு உறுப்பினரைத் தேர்ந்தெடுக்கவும்

# app.vE3l+u
source: Something went wrong when trying to subscribe.
ta: குழுசேர முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# app.wvoA3H
source: Picture
ta: படம்

# app.y/1N+5
source: Due to misconfigured permissions, you’re not able to view the app. If you think this is a mistake, please leave a message in the <link>Appsemble store page</link>.
ta: தவறாக கட்டமைக்கப்பட்ட அனுமதிகள் காரணமாக, நீங்கள் பயன்பாட்டைக் காண முடியாது. இது ஒரு தவறு என்று நீங்கள் நினைத்தால், தயவுசெய்து ஒரு செய்தியை <nivem> Appsemble Store பக்கம் </link> இல் விடுங்கள்.

# app.z3UjXR
source: Debug
ta: பிழைத்திருத்தம்

# app.z5szTh
source: Due to misconfigured permissions, you’re not able to log into the app. If you think this is a mistake, please leave a message in the <link>Appsemble store page</link>.
ta: தவறாக கட்டமைக்கப்பட்ட அனுமதிகள் காரணமாக, நீங்கள் பயன்பாட்டில் உள்நுழைய முடியாது. இது ஒரு தவறு என்று நீங்கள் நினைத்தால், தயவுசெய்து ஒரு செய்தியை <nivem> Appsemble Store பக்கம் </link> இல் விடுங்கள்.

# react-components.+MEKje
source: Your name will be used to personalize communication
ta: தகவல்தொடர்புகளைத் தனிப்பயனாக்க உங்கள் பெயர் பயன்படுத்தப்படும்

# react-components./sLjsI
source: Repeated character patterns like "abcabcabc" are easy to guess.
ta: "ABCABCABC" போன்ற மீண்டும் மீண்டும் எழுத்து வடிவங்கள் யூகிக்க எளிதானது.

# react-components.0HiGEo
source: Single words are easy to guess.
ta: ஒற்றை சொற்களை யூகிக்க எளிதானது.

# react-components.1MEbtg
source: This is a heavily used password.
ta: இது பெரிதும் பயன்படுத்தப்படும் கடவுச்சொல்.

# react-components.1gZSU3
source: Password successfully reset!
ta: கடவுச்சொல் வெற்றிகரமாக மீட்டமைக்கவும்!

# react-components.2825oe
source: Your feedback will be shared with the Appsemble group using Sentry
ta: உங்கள் கருத்து சென்ட்ரியைப் பயன்படுத்தி ஆப்செம்பிள் குழுவுடன் பகிரப்படும்

# react-components.2AETs6
source: Avoid predictable letter substitutions like '@' for 'a'.
ta: 'A' க்கு '@' போன்ற கணிக்கக்கூடிய கடித மாற்றுகளைத் தவிர்க்கவும்.

# react-components.3VCFQV
source: Register a new account
ta: புதிய கணக்கை பதிவு செய்யுங்கள்

# react-components.47FYwb
source: Cancel
ta: ரத்துசெய்

# react-components.48Lr88
source: Recent years are easy to guess.
ta: அண்மைக் கால ஆண்டுகள் யூகிக்க எளிதானது.

# react-components.5J2l4D
source: The password must be at least 8 characters
ta: கடவுச்சொல் குறைந்தது 8 எழுத்துகளாக இருக்க வேண்டும்

# react-components.5sg7KC
source: Password
ta: கடவுச்சொல்

# react-components.9+Ddtu
source: Next
ta: அடுத்தது

# react-components.9KNb6d
source: Common character sequences like "abc" are easy to guess.
ta: "ஏபிசி" போன்ற பொதுவான எழுத்து காட்சிகள் யூகிக்க எளிதானது.

# react-components.9WRlF4
source: Send
ta: அனுப்பு

# react-components.9i2X0U
source: There was a problem submitting your feedback
ta: உங்கள் கருத்தை சமர்ப்பிப்பதில் சிக்கல் இருந்தது

# react-components.AN5uJi
source: Avoid reversed spellings of common words.
ta: பொதுவான சொற்களின் தலைகீழ் எழுத்துப்பிழைகளைத் தவிர்க்கவும்.

# react-components.AyGauy
source: Login
ta: புகுபதிவு

# react-components.E/9R0H
source: Capitalize some, but not all letters.
ta: சிலவற்றைப் பயன்படுத்திக் கொள்ளுங்கள், ஆனால் எல்லா கடிதங்களும் இல்லை.

# react-components.HAlOn1
source: Name
ta: பெயர்

# react-components.HraclQ
source: Dates are easy to guess.
ta: தேதிகள் யூகிக்க எளிதானது.

# react-components.InWqys
source: Optional
ta: விரும்பினால்

# react-components.It/Dy0
source: Yes, I want to be kept up to date with Appsemble news.
ta: ஆம், ஆப்செம்பிள் நியூச் மூலம் நான் புதுப்பித்த நிலையில் இருக்க விரும்புகிறேன்.

# react-components.IyhoMC
source: Straight rows of keys on your keyboard are easy to guess.
ta: உங்கள் விசைப்பலகையில் உள்ள விசைகளின் நேரான வரிசைகள் யூகிக்க எளிதானது.

# react-components.JHTwdB
source: Show password
ta: கடவுச்சொல்லைக் காட்டு

# react-components.JJNc3c
source: Previous
ta: முந்தைய

# react-components.K3fWTv
source: Hide password
ta: கடவுச்சொல்லை மறைக்கவும்

# react-components.K56Dim
source: Organization
ta: அமைப்பு

# react-components.KN7zKn
source: Error
ta: பிழை

# react-components.KssJcX
source: An email address is required
ta: மின்னஞ்சல் முகவரி தேவை

# react-components.MafjU7
source: Request failed. Token may be invalid.
ta: கோரிக்கை தோல்வியடைந்தது. கிள்ளாக்கு செல்லாது.

# react-components.OJpqEr
source: An unexpected error has occurred.
ta: எதிர்பாராத பிழை ஏற்பட்டது.

# react-components.OOCcE/
source: Please help us by describing what went wrong
ta: என்ன தவறு நடந்தது என்பதை விவரிப்பதன் மூலம் எங்களுக்கு உதவுங்கள்

# react-components.Q1x2I6
source: This must be a valid JSON value.
ta: இது செல்லுபடியாகும் சாதொபொகு மதிப்பாக இருக்க வேண்டும்.

# react-components.RHvmwP
source: Common names and surnames are easy to guess.
ta: பொதுவான பெயர்கள் மற்றும் குடும்பப்பெயர்கள் யூகிக்க எளிதானது.

# react-components.Stbi1f
source: A password is required
ta: கடவுச்சொல் தேவை

# react-components.VCZBMt
source: Rows per page
ta: ஒரு பக்கத்திற்கு வரிசைகள்

# react-components.XWEM9C
source: Add more words that are less common.
ta: குறைவான பொதுவான சொற்களைச் சேர்க்கவும்.

# react-components.YAWiUx
source: Use longer keyboard patterns and change typing direction multiple times.
ta: நீண்ட விசைப்பலகை வடிவங்களைப் பயன்படுத்தவும் மற்றும் தட்டச்சு திசையை பல முறை மாற்றவும்.

# react-components.Ysf4bT
source: Capitalize more than the first letter.
ta: முதல் கடிதத்தை விட அதிகமாக பயன்படுத்தவும்.

# react-components.avzfbD
source: This is used to personalize communication
ta: தகவல்தொடர்புகளைத் தனிப்பயனாக்க இது பயன்படுத்தப்படுகிறது

# react-components.bdcMGy
source: Open menu
ta: திறந்த பட்டியல்

# react-components.cyR7Kh
source: Back
ta: பின்

# react-components.cyRU1N
source: Forgot your password?
ta: உங்கள் கடவுச்சொல்லை மறந்துவிட்டீர்களா?

# react-components.d/B425
source: Repeated characters like "aaa" are easy to guess.
ta: "AAA" போன்ற தொடர்ச்சியான எழுத்துக்கள் யூகிக்க எளிதானது.

# react-components.dOQCL8
source: Display name
ta: காட்சி பெயர்

# react-components.deEeEI
source: Register
ta: பதிவு செய்யுங்கள்

# react-components.dg8ZEb
source: Close menu
ta: பட்டியல் மூடு

# react-components.e+9IqT
source: Avoid repeated words and characters.
ta: மீண்டும் மீண்டும் சொற்களையும் கதாபாத்திரங்களையும் தவிர்க்கவும்.

# react-components.fA/+sb
source: Short keyboard patterns are easy to guess.
ta: குறுகிய விசைப்பலகை வடிவங்களை யூகிக்க எளிதானது.

# react-components.fPVPxV
source: Register failed
ta: பதிவு தோல்வியுற்றது

# react-components.gR2hpT
source: This email address has already been registered.
ta: இந்த மின்னஞ்சல் முகவரி ஏற்கனவே பதிவு செய்யப்பட்டுள்ளது.

# react-components.iMGl03
source: Request failed
ta: கோரிக்கை தோல்வியடைந்தது

# react-components.irMoe1
source: Dismiss message
ta: செய்தியை நிராகரிக்கவும்

# react-components.jOsznl
source: You can create strong passwords without using symbols, numbers, or uppercase letters.
ta: சின்னங்கள், எண்கள் அல்லது பெரிய எழுத்துக்களைப் பயன்படுத்தாமல் வலுவான கடவுச்சொற்களை உருவாக்கலாம்.

# react-components.jayEMB
source: This is a frequently used password.
ta: இது அடிக்கடி பயன்படுத்தப்படும் கடவுச்சொல்.

# react-components.jg+sdD
source: There should not be any personal data.
ta: தனிப்பட்ட தரவு இருக்கக்கூடாது.

# react-components.jm/spn
source: Reset
ta: மீட்டமை

# react-components.jv0FOj
source: This must be a valid email address
ta: இது சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்

# react-components.jvo0vs
source: Save
ta: சேமி

# react-components.kq/CXH
source: This is a commonly used password.
ta: இது பொதுவாகப் பயன்படுத்தப்படும் கடவுச்சொல்.

# react-components.lXIQ7a
source: Submit error report
ta: பிழை அறிக்கையை சமர்ப்பிக்கவும்

# react-components.llujbI
source: Your feedback has been submitted successfully. Thank you!
ta: உங்கள் கருத்து வெற்றிகரமாக சமர்ப்பிக்கப்பட்டுள்ளது. நன்றி!

# react-components.nuWwea
source: Login failed
ta: உள்நுழைவு தோல்வியடைந்தது

# react-components.q+8ot1
source: We may use your email address to contact you about this issue
ta: இந்த சிக்கலைப் பற்றி உங்களைத் தொடர்பு கொள்ள உங்கள் மின்னஞ்சல் முகவரியைப் பயன்படுத்தலாம்

# react-components.s3FXF9
source: Request accepted! If an account matches that email address, you should receive an email with instructions on how to reset your password shortly.
ta: கோரிக்கை ஏற்றுக்கொள்ளப்பட்டது! ஒரு கணக்கு அந்த மின்னஞ்சல் முகவரியுடன் பொருந்தினால், விரைவில் உங்கள் கடவுச்சொல்லை எவ்வாறு மீட்டமைப்பது என்பதற்கான வழிமுறைகளைக் கொண்ட மின்னஞ்சலைப் பெற வேண்டும்.

# react-components.sgyUiJ
source: If you use this password elsewhere, you should change it.
ta: இந்த கடவுச்சொல்லை வேறு இடத்திற்கு பயன்படுத்தினால், அதை மாற்ற வேண்டும்.

# react-components.sy+pv5
source: Email
ta: மின்னஞ்சல்

# react-components.tyBIMW
source: Use multiple words, but avoid common phrases.
ta: பல சொற்களைப் பயன்படுத்துங்கள், ஆனால் பொதுவான சொற்றொடர்களைத் தவிர்க்கவும்.

# react-components.tzptOa
source: Avoid years that are associated with you.
ta: உங்களுடன் தொடர்புடைய பல ஆண்டுகளைத் தவிர்க்கவும்.

# react-components.v5Y6yd
source: This is similar to a commonly used password.
ta: இது பொதுவாகப் பயன்படுத்தப்படும் கடவுச்சொல்லைப் போன்றது.

# react-components.w3n6PD
source: Single names or surnames are easy to guess.
ta: ஒற்றை பெயர்கள் அல்லது குடும்பப்பெயர்கள் யூகிக்க எளிதானது.

# react-components.wCgTu5
source: Comments
ta: கருத்துகள்

# react-components.y2IH2u
source: This should be a valid email address
ta: இது சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்

# react-components.zQvVDJ
source: All
ta: அனைத்தும்

# server.emails.appEmailQuotaLimitHit.body
source: {name, select, null {Hello,} other {Hello {name},}} Your app {appName} has hit its email quota limit. Kind regards, _The Appsemble Group_
ta: {பெயர், தேர்ந்தெடுக்கவும், சுழிய {அலோ,} பிற {அலோ {name},}} உங்கள் பயன்பாடு {appName} அதன் மின்னஞ்சல் ஒதுக்கீட்டு வரம்பைத் தாக்கியுள்ளது. அன்புடன், _ APPSEMBLE GROUP_

# server.emails.appEmailQuotaLimitHit.subject
source: Email quota hit
ta: மின்னஞ்சல் ஒதுக்கீடு செய்

# server.emails.appInvite.body
source: {name, select, null {Hello,} other {Hello {name},}} You have been invited to join the app {appName}. Joining an app allows you to perform certain operations within the app. You can accept or decline this invitation by following <link>this link</link>. Kind regards, {appName, select, null {The Appsemble Team} other {{appName}}}
ta: {பெயர், தேர்ந்தெடுக்கவும், சுழிய {அலோ,} பிற {அலோ {name},}} பயன்பாட்டின் {appName inh இல் சேர நீங்கள் அழைக்கப்பட்டுள்ளீர்கள். பயன்பாட்டில் சேருவது பயன்பாட்டில் சில செயல்பாடுகளைச் செய்ய உங்களை அனுமதிக்கிறது. <இணைப்பு> இந்த இணைப்பு </இணைப்பு> ஐப் பின்பற்றுவதன் மூலம் இந்த அழைப்பை நீங்கள் ஏற்கலாம் அல்லது நிராகரிக்கலாம். அன்புடன், {appname, select, null {appName} பிற {{appName}}}}

# server.emails.appInvite.subject
source: Invited to app
ta: பயன்பாட்டிற்கு அழைக்கப்பட்டது

# server.emails.appMemberEmailChange.body
source: {name, select, null {Hello,} other {Hello {name},}} You have changed your email address for {appName}. Before you can use your account, we need to verify your email address. Please click <link>here</link> to verify your email address. Kind regards , _{appName}_
ta: {பெயர், தேர்ந்தெடுக்கவும், சுழிய {அலோ,} பிற {அலோ {name},}} உங்கள் மின்னஞ்சல் முகவரியை {appname க்கு க்காக மாற்றியுள்ளீர்கள். உங்கள் கணக்கைப் பயன்படுத்துவதற்கு முன், உங்கள் மின்னஞ்சல் முகவரியை நாங்கள் சரிபார்க்க வேண்டும். உங்கள் மின்னஞ்சல் முகவரியை சரிபார்க்க <இணைப்பு> இங்கே </இணைப்பு> என்பதைக் சொடுக்கு செய்க. அன்புடன் , _ {appName} _

# server.emails.appMemberEmailChange.subject
source: Email changed
ta: மின்னஞ்சல் மாற்றப்பட்டது

# server.emails.emailAdded.body
source: {name, select, null {Hello,} other {Hello {name},}} You have registered a new email address to your account. In order to make full use of this email, we need to verify your email address. Please click <link>this link</link> to verify your email address **Didn’t request this email?**. No worries! Your address may have been entered by mistake. If you ignore or delete this email, nothing will be done with this email address. Kind regards, _{appName, select, null {The Appsemble Group} other {{appName}}}_
ta: {பெயர், தேர்ந்தெடுக்கவும், சுழிய {அலோ,} பிற {அலோ {name},}} உங்கள் கணக்கில் புதிய மின்னஞ்சல் முகவரியை பதிவு செய்துள்ளீர்கள். இந்த மின்னஞ்சலை முழுமையாகப் பயன்படுத்த, உங்கள் மின்னஞ்சல் முகவரியை நாங்கள் சரிபார்க்க வேண்டும். உங்கள் மின்னஞ்சல் முகவரியை சரிபார்க்க <இணைப்பு> இந்த இணைப்பு </இணைப்பு> என்பதைக் சொடுக்கு செய்க ** இந்த மின்னஞ்சலைக் கோரவில்லையா? **. கவலைகள் இல்லை! உங்கள் முகவரி தவறுதலாக உள்ளிடப்பட்டிருக்கலாம். இந்த மின்னஞ்சலை நீங்கள் புறக்கணித்தால் அல்லது நீக்கினால், இந்த மின்னஞ்சல் முகவரியுடன் எதுவும் செய்யப்படாது. அன்புடன், _ {appname, தேர்ந்தெடுக்கவும், பூச்யமாகவும் {The Appsemble Group} பிற {{appName}}} _ _

# server.emails.emailAdded.subject
source: Email added to account
ta: கணக்கில் மின்னஞ்சல் சேர்க்கப்பட்டது

# server.emails.groupInvite.body
source: {name, select, null {Hello,} other {Hello {name},}} You have been invited to join the group **{groupName}** for the app **{appName}**. You can accept this invitation by following <link>this link</link>. Kind regards, _The {appName} Group_
ta: {பெயர், தேர்ந்தெடுக்கவும், சுழிய {அலோ,} பிற {அலோ {name},}} பயன்பாட்டிற்காக ** {groupName} ** குழுவில் சேர நீங்கள் அழைக்கப்பட்டுள்ளீர்கள் ** {appName} **. இந்த அழைப்பை <இணைப்பு> இந்த இணைப்பு </இணைப்பு> ஐப் பின்பற்றுவதன் மூலம் நீங்கள் ஏற்றுக்கொள்ளலாம். அன்புடன், _ The {appName} குழு_

# server.emails.groupInvite.subject
source: Invited to group
ta: குழுவிற்கு அழைக்கப்பட்டது

# server.emails.organizationInvite.body
source: {name, select, null {Hello,} other {Hello {name},}} You have been invited to join the organization **{organization}**. Joining an organization allows you to view private applications as well as create and edit apps belonging to an organization. You can accept or decline this invitation by following <link>this link</link>. Kind regards, _The Appsemble Group_
ta: {பெயர், தேர்ந்தெடுக்கவும், சுழிய {அலோ,} பிற {அலோ {name},}} அமைப்பில் சேர நீங்கள் அழைக்கப்பட்டுள்ளீர்கள் ** {organization} **. ஒரு நிறுவனத்தில் சேருவது தனியார் பயன்பாடுகளைக் காணவும், ஒரு நிறுவனத்திற்கு சொந்தமான பயன்பாடுகளை உருவாக்கவும் திருத்தவும் உங்களை அனுமதிக்கிறது. <இணைப்பு> இந்த இணைப்பு </இணைப்பு> ஐப் பின்பற்றுவதன் மூலம் இந்த அழைப்பை நீங்கள் ஏற்கலாம் அல்லது நிராகரிக்கலாம். அன்புடன், _ APPSEMBLE GROUP_

# server.emails.organizationInvite.subject
source: Invited to organization
ta: அமைப்புக்கு அழைக்கப்பட்டது

# server.emails.resend.body
source: {name, select, null {Hello,} other {Hello {name},}} Someone has requested to resend the verification key for your account. Before you can use your account, we need to verify your email address. Please click <link>this link</link> to verify your email address. **Didn’t request this email?** No worries! Your address may have been entered by mistake. If you ignore or delete this email, nothing will happen to your account. Kind regards, _{appName, select, null {The Appsemble Group} other {{appName}}}_
ta: {பெயர், தேர்ந்தெடுக்கவும், சுழிய {அலோ,} பிற {அலோ {name},}} உங்கள் கணக்கிற்கான சரிபார்ப்பு விசையை மறுபரிசீலனை செய்ய யாராவது கோரியுள்ளனர். உங்கள் கணக்கைப் பயன்படுத்துவதற்கு முன், உங்கள் மின்னஞ்சல் முகவரியை நாங்கள் சரிபார்க்க வேண்டும். உங்கள் மின்னஞ்சல் முகவரியை சரிபார்க்க <இணைப்பு> இந்த இணைப்பு </இணைப்பு> என்பதைக் சொடுக்கு செய்க. ** இந்த மின்னஞ்சலைக் கோரவில்லையா? ** கவலைகள் இல்லை! உங்கள் முகவரி தவறுதலாக உள்ளிடப்பட்டிருக்கலாம். இந்த மின்னஞ்சலை நீங்கள் புறக்கணித்தால் அல்லது நீக்கினால், உங்கள் கணக்கிற்கு எதுவும் நடக்காது. அன்புடன், _ {appname, தேர்ந்தெடுக்கவும், பூச்யமாகவும் {The Appsemble Group} பிற {{appName}}} _ _

# server.emails.resend.subject
source: Confirm account registration
ta: கணக்கு பதிவை உறுதிப்படுத்தவும்

# server.emails.reset.body
source: {name, select, null {Hello,} other {Hello {name},}} A password reset has been requested for your account. Please click <link>here</link> to reset your password. **Didn’t request this email?** Your email address may have been entered by mistake. This email can be ignored safely. Kind regards, _{appName, select, null {The Appsemble Team} other {{appName}}}_
ta: {பெயர், தேர்ந்தெடுக்கவும், சுழிய {அலோ,} பிற {அலோ {name},}} உங்கள் கணக்கிற்கு கடவுச்சொல் மீட்டமைப்பு கோரப்பட்டுள்ளது. உங்கள் கடவுச்சொல்லை மீட்டமைக்க <இணைப்பு> இங்கே </இணைப்பு> என்பதைக் சொடுக்கு செய்க. ** இந்த மின்னஞ்சலைக் கோரவில்லையா? ** உங்கள் மின்னஞ்சல் முகவரி தவறுதலாக உள்ளிடப்பட்டிருக்கலாம். இந்த மின்னஞ்சலை பாதுகாப்பாக புறக்கணிக்க முடியும். அன்புடன், .

# server.emails.reset.subject
source: Password reset
ta: கடவுச்சொல் மீட்டமைப்பு
