Repository: 247i/TACETr
Catalog: உரை/தானி/appsemble-appsemble-*.po
Languages: ta

# server.emails.welcome.body
source: {name, select, null {Hello,} other {Hello {name},}} Thank you for registering your account. Before you can use your account, we need to verify your email address. Please click <link>here</link> to verify your email address. Kind regards, _{appName, select, null {The Appsemble Team} other {{appName}}}_
ta: {பெயர், தேர்ந்தெடுக்கவும், சுழிய {அலோ,} பிற {அலோ {name},}} உங்கள் கணக்கை பதிவு செய்ததற்கு நன்றி. உங்கள் கணக்கைப் பயன்படுத்துவதற்கு முன், உங்கள் மின்னஞ்சல் முகவரியை நாங்கள் சரிபார்க்க வேண்டும். உங்கள் மின்னஞ்சல் முகவரியை சரிபார்க்க <இணைப்பு> இங்கே </இணைப்பு> என்பதைக் சொடுக்கு செய்க. அன்புடன், .

# server.emails.welcome.subject
source: Welcome to {appName, select, null {Appsemble} other {{appName}}}
ta: {Appname க்கு வருக, தேர்ந்தெடுக்கவும், NULL {Appsemble} பிற {{appName}}}

# studio.+7+1T0
source: The permission to send manual push notifications for an app.
ta: பயன்பாட்டிற்கான கையேடு புச் அறிவிப்புகளை அனுப்ப இசைவு.

# studio.+7HI4W
source: There as a problem uploading the asset. Please try again.
ta: சொத்தை பதிவேற்றுவதில் சிக்கல். மீண்டும் முயற்சிக்கவும்.

# studio.+Fvztk
source: The permission to get app resources.
ta: பயன்பாட்டு ஆதாரங்களைப் பெற இசைவு.

# studio.+JYDRp
source: Something went wrong when trying to add this language.
ta: இந்த மொழியைச் சேர்க்க முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.+RhnH+
source: Empty
ta: காலி

# studio.+SyiD1
source: Would you like to join this organization?
ta: இந்த அமைப்பில் சேர விரும்புகிறீர்களா?

# studio.+U6ozc
source: Type
ta: வகை

# studio.+WXioK
source: There was a problem inviting these new members.
ta: இந்த புதிய உறுப்பினர்களை அழைப்பதில் சிக்கல் இருந்தது.

# studio.+a+2ug
source: Members
ta: உறுப்பினர்கள்

# studio.+a6mcJ
source: Inherit Role
ta: பங்கு

# studio.+bZ7DX
source: You haven’t logged in to any Appsemble apps yet.
ta: நீங்கள் இதுவரை எந்த AppSemble பயன்பாடுகளிலும் உள்நுழைந்திருக்கவில்லை.

# studio.+fLsei
source: Role created.
ta: பங்கு உருவாக்கப்பட்டது.

# studio.+fopx3
source: Get all {resourceName} resources
ta: அனைத்து {resourceName} வளங்களையும் பெறுங்கள்

# studio.+fuzcC
source: Are you sure you want to delete these client credentials?
ta: இந்த கிளையன்ட் சான்றுகளை நீக்க விரும்புகிறீர்களா?

# studio.+im1ZA
source: Blocks
ta: தொகுதிகள்

# studio.+kMIBF
source: Icon for {appName}
ta: {AppName க்கு க்கான படவுரு

# studio.+nKwXg
source: This resource could not be found in the app definition. Please confirm if this resource exists.
ta: இந்த வளத்தை பயன்பாட்டு வரையறையில் காண முடியவில்லை. இந்த சான்று இருக்கிறதா என்பதை உறுதிப்படுத்தவும்.

# studio.+nW2YO
source: Select Related Resource
ta: தொடர்புடைய வளத்தைத் தேர்ந்தெடுக்கவும்

# studio.+s1Ayf
source: The name that will be displayed on the login button
ta: உள்நுழைவு பொத்தானில் காட்டப்படும் பெயர்

# studio.+xONLL
source: The permission to query app variables.
ta: பயன்பாட்டு மாறிகள் வினவ இசைவு.

# studio.+xR2VI
source: Tabular data can be copied into the input field to add multiple people at once
ta: ஒரே நேரத்தில் பல நபர்களைச் சேர்க்க அட்டவணை தரவை உள்ளீட்டு புலத்தில் நகலெடுக்கலாம்

# studio.+xp9k4
source: The permission to create app assets.
ta: பயன்பாட்டு சொத்துக்களை உருவாக்க இசைவு.

# studio./+axU7
source: Training
ta: பயிற்சி

# studio./32Rj2
source: Bring your own SSL certificate to secure your app. Find out more from the <link>documentation</link>.
ta: உங்கள் பயன்பாட்டைப் பாதுகாக்க உங்கள் சொந்த SSL சான்றிதழை கொண்டு வாருங்கள். <nignive> ஆவணங்கள் </இணைப்பு> இலிருந்து மேலும் அறியவும்.

# studio./5gKvH
source: Are you sure you want to remove this item? This cannot be reverted.
ta: இந்த உருப்படியை அகற்ற விரும்புகிறீர்களா? இதை மாற்ற முடியாது.

# studio./8v8/t
source: Delete Organization
ta: அமைப்பை நீக்கு

# studio./9RhC2
source: A short description about the organization
ta: அமைப்பு பற்றிய ஒரு குறுகிய விளக்கம்

# studio./BTTpN
source: The permission to remove organization members.
ta: நிறுவன உறுப்பினர்களை அகற்ற இசைவு.

# studio./DVi5z
source: Unknown user
ta: தெரியாத பயனர்

# studio./DgTIj
source: An ID which identifies the app to the login provider
ta: உள்நுழைவு வழங்குநருக்கு பயன்பாட்டை அடையாளம் காணும் ஐடி

# studio./EEiL0
source: Something went wrong when fetching this app’s assets.
ta: இந்த பயன்பாட்டின் சொத்துக்களைப் பெறும்போது ஏதோ தவறு ஏற்பட்டது.

# studio./EEoOd
source: The private key for client certificate authentication in PEM format
ta: PEM வடிவத்தில் கிளையன்ட் சான்றிதழ் அங்கீகாரத்திற்கான தனிப்பட்ட விசை

# studio./EMSX/
source: The email address which is exposed to the app
ta: பயன்பாட்டிற்கு வெளிப்படும் மின்னஞ்சல் முகவரி

# studio./GQ0qj
source: Successfully restored this snapshot.
ta: இந்த ச்னாப்சாட்டை வெற்றிகரமாக மீட்டெடுத்தது.

# studio./JkKQQ
source: Maskable icon preview
ta: முகமூடி செய்யக்கூடிய படவுரு முன்னோட்டம்

# studio./OEORY
source: Relationship
ta: உறவு

# studio./T03S3
source: Are you sure you want to delete {amount} {amount, plural, one {asset} other {assets}}? This action cannot be reverted.
ta: {தொகை {{தொகை, பன்மை, ஒன்று {amount} பிற {asset}} ஐ நீக்க விரும்புகிறீர்களா? இந்த செயலை மாற்ற முடியாது.

# studio./TwSx+
source: Service provider certificate
ta: பணி வழங்குநர் சான்றிதழ்

# studio./liVQE
source: In order to create an app you must be in an organization and have the permission to create new apps. You can create one below or have someone invite you to an existing organization.
ta: ஒரு பயன்பாட்டை உருவாக்க நீங்கள் ஒரு நிறுவனத்தில் இருக்க வேண்டும் மற்றும் புதிய பயன்பாடுகளை உருவாக்க இசைவு பெற வேண்டும். நீங்கள் கீழே ஒன்றை உருவாக்கலாம் அல்லது ஏற்கனவே இருக்கும் நிறுவனத்திற்கு யாராவது உங்களை அழைக்கலாம்.

# studio./uHCud
source: The permission to update organizations.
ta: நிறுவனங்களைப் புதுப்பிக்க இசைவு.

# studio.0/cdhu
source: Export apps as zip files.
ta: பயன்பாடுகளை சிப் கோப்புகளாக ஏற்றுமதி செய்யுங்கள்.

# studio.03J9iZ
source: Create and manage organizations
ta: நிறுவனங்களை உருவாக்கி நிர்வகிக்கவும்

# studio.0Atfb1
source: Want to create a new app based on {name}? This app can be cloned by pressing the clone button.
ta: {பெயர் of அடிப்படையில் புதிய பயன்பாட்டை உருவாக்க விரும்புகிறீர்களா? நகலி பொத்தானை அழுத்துவதன் மூலம் இந்த பயன்பாட்டை நகலி செய்யலாம்.

# studio.0D+2Vq
source: Are you sure you want to delete {amount, plural, one {this resource} other {these resources}}? Deleted resources can not be recovered.
ta: {தொகை, பன்மை, ஒன்று {this resource} மற்ற {these resources}} ஐ நீக்க விரும்புகிறீர்களா? நீக்கப்பட்ட வளங்களை மீட்டெடுக்க முடியாது.

# studio.0ImIeM
source: SSL certificate
ta: எச்எச்எல் சான்றிதழ்

# studio.0Lp17s
source: The permission to create training blocks.
ta: பயிற்சி தொகுதிகளை உருவாக்க இசைவு.

# studio.0MC1vJ
source: Successfully updated settings
ta: வெற்றிகரமாக புதுப்பிக்கப்பட்ட அமைப்புகள்

# studio.0agQte
source: The secret for query parameter authentication
ta: வினவல் அளவுரு அங்கீகாரத்திற்கான மறைபொருள்

# studio.0cEOKu
source: Advanced options
ta: மேம்பட்ட விருப்பங்கள்

# studio.0gbG2D
source: There was a problem generating an SSL certificate for this domain
ta: இந்த களத்திற்கு SSL சான்றிதழை உருவாக்குவதில் சிக்கல் இருந்தது

# studio.0hZcSE
source: Count {resourceName} resources
ta: எண்ண {resourceName} வளங்கள்

# studio.0sw2UL
source: Minimum length
ta: குறைந்தபட்ச நீளம்

# studio.0vTK7Q
source: Loading organizations…
ta: நிறுவனங்களை ஏற்றுகிறது…

# studio.183Swc
source: No SAML secrets have been configured yet.
ta: SAML ரகசியங்கள் இதுவரை கட்டமைக்கப்படவில்லை.

# studio.18cyzo
source: The preferred language to use for the Appsemble Studio.
ta: AppSemble ச்டுடியோவுக்கு பயன்படுத்த விருப்பமான மொழி.

# studio.19HUGI
source: My organizations
ta: எனது அமைப்புகள்

# studio.1IRjYb
source: Disconnected {name} successfully
ta: துண்டிக்கப்பட்ட {name} வெற்றிகரமாக

# studio.1P2stX
source: The domain name on which this app is available. For more information on how to set this up, please refer to the <link>documentation</link>.
ta: இந்த பயன்பாடு கிடைக்கக்கூடிய டொமைன் பெயர். இதை எவ்வாறு அமைப்பது என்பது பற்றிய கூடுதல் தகவலுக்கு, <இணைப்பு> ஆவணங்கள் </இணைப்பு> ஐப் பார்க்கவும்.

# studio.1ZgrhW
source: Role
ta: பங்கு

# studio.1d0Fca
source: The permission to create app groups.
ta: பயன்பாட்டுக் குழுக்களை உருவாக்க இசைவு.

# studio.1fFBqQ
source: Dangerous actions
ta: ஆபத்தான செயல்கள்

# studio.1hhuuF
source: App preview
ta: பயன்பாட்டு முன்னோட்டம்

# studio.1iEPTM
source: General
ta: பொது

# studio.1utknZ
source: You are already part of the organization. If you wish to accept this invitation, please log into a different account.
ta: நீங்கள் ஏற்கனவே அமைப்பின் ஒரு பகுதியாக இருக்கிறீர்கள். இந்த அழைப்பை நீங்கள் ஏற்க விரும்பினால், தயவுசெய்து வேறு கணக்கில் உள்நுழைக.

# studio.1vGmTm
source: The method of authenticating request actions
ta: கோரிக்கை செயல்களை அங்கீகரிக்கும் முறை

# studio.2/2yg+
source: Add
ta: கூட்டு

# studio.22sXgw
source: Support for external resources, history and views will be added in the future.
ta: வெளிப்புற வளங்கள், வரலாறு மற்றும் பார்வைகளுக்கான உதவி எதிர்காலத்தில் சேர்க்கப்படும்.

# studio.25oM9Q
source: Sort
ta: வரிசைப்படுத்து

# studio.25qIuX
source: Lock app
ta: பூட்டு பயன்பாடு

# studio.25w127
source: Email name
ta: மின்னஞ்சல் பெயர்

# studio.2Cqy9n
source: Upload new asset
ta: புதிய சொத்தை பதிவேற்றவும்

# studio.2IBHyh
source: Service provider entity ID
ta: பணி வழங்குநர் நிறுவன ஐடி

# studio.2Ppkru
source: Something went wrong when fetching this block.
ta: இந்த தொகுதியைப் பெறும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.2T4AGb
source: Deleting organization
ta: அமைப்பை நீக்குதல்

# studio.2TrzH5
source: The permission to update app groups.
ta: பயன்பாட்டுக் குழுக்களைப் புதுப்பிக்க இசைவு.

# studio.2Ud8Mu
source: Successfully deleted Training Block
ta: பயிற்சி தொகுதி வெற்றிகரமாக நீக்கப்பட்டது

# studio.2Vfoqz
source: Restore snapshot
ta: ச்னாப்சாட்டை மீட்டெடுங்கள்

# studio.2VvdnV
source: Unpin app from top of collection
ta: சேகரிப்பின் மேலிருந்து பயன்பாட்டை அவிழ்த்து விடுங்கள்

# studio.2icOAh
source: Splash Color
ta: ச்பிளாச் நிறம்

# studio.2lwxpZ
source: Create app assets
ta: பயன்பாட்டு சொத்துக்களை உருவாக்கவும்

# studio.2oB417
source: Something went wrong when trying to change this user’s role.
ta: இந்த பயனரின் பங்கை மாற்ற முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.2p9IA9
source: This organization currently has no apps.
ta: இந்த அமைப்புக்கு தற்போது பயன்பாடுகள் இல்லை.

# studio.2r064T
source: Deleting app
ta: பயன்பாட்டை நீக்குதல்

# studio.2rUVsU
source: App
ta: பயன்பாடு

# studio.2rkKvL
source: Successfully imported {selectedLanguage} translations
ta: வெற்றிகரமாக இறக்குமதி செய்யப்பட்ட {selectedLanguage} மொழிபெயர்ப்புகள்

# studio.2vIp92
source: Edit photo
ta: புகைப்படத்தைத் திருத்து

# studio.32vEnD
source: The permission to create app invites.
ta: பயன்பாட்டு அழைப்புகளை உருவாக்க இசைவு.

# studio.35INhb
source: The port for the custom SMTP server. By default this is 587 for secure SMTP and 25 for standard SMTP.
ta: தனிப்பயன் SMTP சேவையகத்திற்கான துறைமுகம். இயல்பாக இது பாதுகாப்பான SMTP க்கு 587 மற்றும் நிலையான SMTP க்கு 25 ஆகும்.

# studio.38YuKp
source: Enable unsecured service secrets
ta: பாதுகாப்பற்ற பணி ரகசியங்களை இயக்கவும்

# studio.39Zi6V
source: Something went wrong when submitting this notification.
ta: இந்த அறிவிப்பை சமர்ப்பிக்கும் போது ஏதோ தவறு ஏற்பட்டது.

# studio.3CTAH+
source: Deleting {amount} {amount, plural, one {asset} other {assets}}
ta: {தொகை {{தொகை, பன்மை, ஒன்று {amount} பிற {asset}} நீக்குகிறது

# studio.3I6uVw
source: Delete app
ta: பயன்பாட்டை நீக்கு

# studio.3JxaKs
source: Template
ta: வார்ப்புரு

# studio.3OrdgP
source: Exit fullscreen
ta: முழுத்திரை வெளியேறவும்

# studio.3XLqnb
source: This will be the name of your newly created resource
ta: இது புதிதாக உருவாக்கப்பட்ட வளத்தின் பெயராக இருக்கும்

# studio.3dXAUe
source: Successfully locked the app.
ta: பயன்பாட்டை வெற்றிகரமாக பூட்டியது.

# studio.3fhxaY
source: App messages
ta: பயன்பாட்டு செய்திகள்

# studio.3gEo0L
source: Add new item
ta: புதிய உருப்படியைச் சேர்க்கவும்

# studio.3jkGv6
source: YAML error: {error}
ta: Yaml பிழை: {error}

# studio.3p36Vm
source: Enable SCIM
ta: SCIM ஐ இயக்கவும்

# studio.3rsipf
source: Saved app.
ta: சேமித்த பயன்பாடு.

# studio.3wiKqI
source: Create Training Block
ta: பயிற்சித் தொகுதியை உருவாக்கவும்

# studio.3yY1p8
source: Delete role
ta: பாத்திரத்தை நீக்கு

# studio.3zjiGZ
source: Successfully updated profile.
ta: சுயவிவரம் வெற்றிகரமாக புதுப்பிக்கப்பட்டது.

# studio.4+5QaM
source: No value selected
ta: எந்த மதிப்பும் தேர்ந்தெடுக்கப்படவில்லை

# studio.4/VzZl
source: Never share these client credentials with anyone.
ta: இந்த கிளையன்ட் நற்சான்றிதழ்களை ஒருபோதும் யாருடனும் பகிர வேண்டாம்.

# studio.40zOQn
source: Connect {name} account
ta: {name} கணக்கை இணைக்கவும்

# studio.450Fty
source: None
ta: எதுவுமில்லை

# studio.47FYwb
source: Cancel
ta: ரத்துசெய்

# studio.47OZ7Y
source: Force Delete
ta: கட்டாய நீக்குதல்

# studio.4DJroh
source: If specified, this SAML attribute is used to determine if the user’s email address is verified
ta: குறிப்பிடப்பட்டால், பயனரின் மின்னஞ்சல் முகவரி சரிபார்க்கப்பட்டதா என்பதை தீர்மானிக்க இந்த SAML பண்புக்கூறு பயன்படுத்தப்படுகிறது

# studio.4G2zTe
source: If specified, this SAML attribute is used to determine the user’s display name
ta: குறிப்பிடப்பட்டால், பயனரின் காட்சி பெயரை தீர்மானிக்க இந்த SAML பண்புக்கூறு பயன்படுத்தப்படுகிறது

# studio.4H3a38
source: Email attribute
ta: மின்னஞ்சல் பண்புக்கூறு

# studio.4I6271
source: Export all Messages
ta: எல்லா செய்திகளையும் ஏற்றுமதி செய்யுங்கள்

# studio.4IKGKj
source: Page Name
ta: பக்கத்தின் பெயர்

# studio.4KGcV+
source: App collection not found
ta: பயன்பாட்டு சேகரிப்பு கிடைக்கவில்லை

# studio.4M0fNr
source: In order to create a new organization you must first verify your email address. Refresh the page once you have verified your email.
ta: ஒரு புதிய அமைப்பை உருவாக்க நீங்கள் முதலில் உங்கள் மின்னஞ்சல் முகவரியை சரிபார்க்க வேண்டும். உங்கள் மின்னஞ்சலை சரிபார்த்தவுடன் பக்கத்தைப் புதுப்பிக்கவும்.

# studio.4Mn6/Y
source: Loading app account…
ta: பயன்பாட்டு கணக்கை ஏற்றுகிறது…

# studio.4NDcCC
source: The permission to update app translations.
ta: பயன்பாட்டு மொழிபெயர்ப்புகளைப் புதுப்பிக்க இசைவு.

# studio.4OleBK
source: GUI Editor
ta: GUI ஆசிரியர்

# studio.4R9ol2
source: Removing item
ta: உருப்படியை நீக்குதல்

# studio.4ceZmS
source: Page name already exists
ta: பக்க பெயர் ஏற்கனவே உள்ளது

# studio.4l+0pK
source: Quotas
ta: ஒதுக்கீடு

# studio.4owxuc
source: The permission to delete app groups.
ta: பயன்பாட்டுக் குழுக்களை நீக்க இசைவு.

# studio.4qv+fW
source: Import from JSON file
ta: சாதொபொகு கோப்பிலிருந்து இறக்குமதி

# studio.4seAx1
source: Loading email settings…
ta: மின்னஞ்சல் அமைப்புகளை ஏற்றுகிறது…

# studio.4x5dbg
source: In order to access any of the endpoints of the <apiLink>API</apiLink> for this resource, unless the resource is marked as {public}, you must make sure each request is provided with an access token as described <securityLink>here</securityLink>.
ta: இந்த வளத்திற்காக <Pilink> பநிஇ </pilink> இன் எந்தவொரு இறுதிப் புள்ளிகளையும் அணுக, வளம் {பொது fors எனக் குறிக்கப்படாவிட்டால், ஒவ்வொரு கோரிக்கையும் இங்கே விவரிக்கப்பட்டுள்ளபடி அணுகல் டோக்கனுடன் வழங்கப்படுவதை உறுதிசெய்க வேண்டும். </securityLink>.

# studio.4xEqDf
source: Clonable
ta: குளோனபிள்

# studio.4xkhgP
source: Creating new organization
ta: புதிய அமைப்பை உருவாக்குதல்

# studio.4y3rEL
source: Snapshots
ta: ச்னாப்சாட்கள்

# studio.4yUiUe
source: Show YAML
ta: யம்லைக் காட்டு

# studio.52FEmm
source: No variables have been configured yet.
ta: இதுவரை எந்த மாறிகள் கட்டமைக்கப்படவில்லை.

# studio.55roIj
source: The scope that is needed to identify the user.
ta: பயனரை அடையாளம் காண தேவையான நோக்கம்.

# studio.5Go48n
source: A YAML error has occurred
ta: ஒரு YAML பிழை ஏற்பட்டது

# studio.5Hs6+j
source: Delete screenshot
ta: ச்கிரீன்சாட்டை நீக்கு

# studio.5IOAHQ
source: Deleting app collection
ta: பயன்பாட்டு சேகரிப்பை நீக்குகிறது

# studio.5IP7AP
source: Width
ta: அகலம்

# studio.5JnqzW
source: App lock
ta: பயன்பாட்டு பூட்டு

# studio.5KYXRU
source: There was a problem loading the variables.
ta: மாறிகள் ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.5KyK3O
source: Custom SSL certificates can only be applied if your app has a custom domain
ta: உங்கள் பயன்பாட்டில் தனிப்பயன் டொமைன் இருந்தால் மட்டுமே தனிப்பயன் எச்எச்எல் சான்றிதழ்கள் பயன்படுத்தப்படும்

# studio.5PF1nV
source: You have unsaved changes. Do you wish to continue?
ta: நீங்கள் சேமிக்கப்படாத மாற்றங்கள் உள்ளன. நீங்கள் தொடர விரும்புகிறீர்களா?

# studio.5lOKUP
source: Something went wrong when creating a new resource.
ta: புதிய வளத்தை உருவாக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.5mGXnp
source: The permission to update apps in an organization.
ta: ஒரு நிறுவனத்தில் பயன்பாடுகளைப் புதுப்பிக்க இசைவு.

# studio.5q3qC0
source: Download
ta: பதிவிறக்கம்

# studio.5qOtTw
source: This will be generated once this secret is saved
ta: இந்த மறைபொருள் சேமிக்கப்பட்டவுடன் இது உருவாக்கப்படும்

# studio.5rQbww
source: Loading editor…
ta: ஏற்றுதல் எடிட்டர்…

# studio.5sg7KC
source: Password
ta: கடவுச்சொல்

# studio.5zgvJw
source: Add new members
ta: புதிய உறுப்பினர்களைச் சேர்க்கவும்

# studio.62nsdy
source: Retry
ta: மீண்டும் முயற்சிக்கவும்

# studio.6Ev9Ll
source: The permission to delete app translations.
ta: பயன்பாட்டு மொழிபெயர்ப்புகளை நீக்க இசைவு.

# studio.6PgVSe
source: Regenerate
ta: மீளுருவாக்கம்

# studio.6SbtCI
source: The following resource views are using the role "{roleName}":
ta: பின்வரும் வளக் காட்சிகள் "{roleName}" என்ற பாத்திரத்தைப் பயன்படுத்துகின்றன:

# studio.6Ttiou
source: Grants access if the user is in the same group as the user who created the resource and has the manager role within the group.
ta: அணுகலை வழங்குகிறது, பயனர் வளத்தை உருவாக்கிய பயனரின் அதே குழுவில் இருந்தால் மற்றும் குழுவிற்குள் மேலாளர் பங்கைக் கொண்டிருந்தால்.

# studio.6Y13Gl
source: Block store
ta: தொகுதி கடை

# studio.6fpLnn
source: Option
ta: சூதம்

# studio.6jyoQa
source: Authorize {app}
ta: {பயன்பாட்டை அங்கீகரிக்கவும்

# studio.6k7cdT
source: Maximum amount of items
ta: உருப்படிகளின் அதிகபட்ச அளவு

# studio.6rt94z
source: Joining {organization}
ta: சேருதல் {organization}

# studio.6spWOs
source: The permission to delete app secrets.
ta: பயன்பாட்டு ரகசியங்களை நீக்க இசைவு.

# studio.6w7eKk
source: Attribute consume service endpoint copied to clipboard
ta: பண்புக்கூறு நுகர்வு பணி இறுதிப்புள்ளி கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டது

# studio.6yXGtW
source: Successfully joined {organization}. You can start making apps in the <makeApps>studio</makeApps> or view your organization in the <viewOrganization>organization settings</viewOrganization>.
ta: வெற்றிகரமாக இணைந்தது {organization}. நீங்கள் <bakeapps> ச்டுடியோ </Makeapps> இல் பயன்பாடுகளை உருவாக்கத் தொடங்கலாம் அல்லது உங்கள் நிறுவனத்தை <பார்வை அமைப்பு> அமைப்பு அமைப்புகள் </revent அமைப்பு> இல் காணலாம்.

# studio.71o4N1
source: Successfully updated resource {id}.
ta: வெற்றிகரமாக புதுப்பிக்கப்பட்ட வள {id}.

# studio.76J8Yx
source: The permission to delete app readmes.
ta: பயன்பாட்டு வாசிப்புகளை நீக்க இசைவு.

# studio.77W3Mq
source: Deleting service secret
ta: பணி ரகசியத்தை நீக்குதல்

# studio.79IWia
source: Header
ta: தலைப்பி

# studio.7BmoTf
source: Copy this into the service provider entity ID field of the identity provider settings
ta: அடையாள வழங்குநர் அமைப்புகளின் பணி வழங்குநர் நிறுவன ஐடி புலத்தில் இதை நகலெடுக்கவும்

# studio.7BnPwg
source: Something went wrong when creating this app collection.
ta: இந்த பயன்பாட்டு சேகரிப்பை உருவாக்கும் போது ஏதோ தவறு ஏற்பட்டது.

# studio.7EMBrV
source: Delete member
ta: உறுப்பினரை நீக்கு

# studio.7FAwwk
source: Shortcuts
ta: குறுக்குவழிகள்

# studio.7L86Z5
source: Member
ta: உறுப்பினர்

# studio.7LHMo9
source: Padding
ta: திணிப்பு

# studio.7LZ4pL
source: Close Diagram
ta: வரைபடத்தை மூடு

# studio.7MMlMV
source: Object ID attribute
ta: பொருள் ஐடி பண்புக்கூறு

# studio.7Znis6
source: Switch to Code Editor
ta: குறியீடு எடிட்டருக்கு மாறவும்

# studio.7fEZ5g
source: Deleting training block
ta: பயிற்சி தொகுதியை நீக்குதல்

# studio.7i+1XP
source: My Apps
ta: எனது பயன்பாடுகள்

# studio.7mL9QE
source: Style
ta: சூல் தண்டு

# studio.7n6SLi
source: Copy any assets that are allowed to be cloned.
ta: நகலி செய்ய அனுமதிக்கப்பட்ட எந்த சொத்துகளையும் நகலெடுக்கவும்.

# studio.82Hk0t
source: There was a problem loading the SCIM settings
ta: SCIM அமைப்புகளை ஏற்றுவதில் சிக்கல் இருந்தது

# studio.86RD6b
source: Choose file…
ta: கோப்பைத் தேர்வுசெய்க…

# studio.8OHgiT
source: There was a problem loading your connected accounts. Please try again.
ta: உங்கள் இணைக்கப்பட்ட கணக்குகளை ஏற்றுவதில் சிக்கல் இருந்தது. மீண்டும் முயற்சிக்கவும்.

# studio.8b9Mkg
source: Grants access if the user is the same as the one who created the resource.
ta: பயனர் வளத்தை உருவாக்கியவருக்கு சமமாக இருந்தால் அணுகலை வழங்குகிறது.

# studio.8bBf+m
source: Minimum value
ta: குறைந்தபட்ச மதிப்பு

# studio.8bhBiJ
source: Copied the code to clipboard successfully
ta: குறியீட்டை கிளிப்போர்டுக்கு வெற்றிகரமாக நகலெடுத்தார்

# studio.8eYILH
source: HTTP basic authentication
ta: HTTP அடிப்படை ஏற்பு

# studio.8fqSeD
source: Are you sure you want to delete this app’s logo?
ta: இந்த பயன்பாட்டின் லோகோவை நீக்க விரும்புகிறீர்களா?

# studio.8ipOLI
source: Remove item {name}
ta: உருப்படியை அகற்று {name}

# studio.8yAEFD
source: Are you sure you want to delete this variable? This action cannot be reverted.
ta: இந்த மாறியை நீக்க விரும்புகிறீர்களா? இந்த செயலை மாற்ற முடியாது.

# studio.8ymeyF
source: Edit role name:
ta: பங்கு பெயரைத் திருத்து:

# studio.906mKa
source: Successfully updated settings.
ta: வெற்றிகரமாக புதுப்பிக்கப்பட்ட அமைப்புகள்.

# studio.91p+PL
source: Are you sure you want to leave this organization?
ta: இந்த அமைப்பை விட்டு வெளியேற விரும்புகிறீர்களா?

# studio.95stPq
source: Completed
ta: முடிந்தது

# studio.97zyiz
source: Open preview
ta: முன்னோட்டம் திறந்த

# studio.9FMy4U
source: Reseed App
ta: பயன்பாட்டு பயன்பாடு

# studio.9G7vKh
source: Unlock app
ta: பயன்பாட்டைத் திறக்கவும்

# studio.9IVLHM
source: Successfully set {email} as your primary email address.
ta: உங்கள் முதன்மை மின்னஞ்சல் முகவரியாக {email} ஐ வெற்றிகரமாக அமைக்கவும்.

# studio.9JhU30
source: Push notifications are currently not enabled in this app. To enable sending out push notifications, please enable this in the <link>app definition</link> by specifying the “{navigation}” property.
ta: இந்த பயன்பாட்டில் புச் அறிவிப்புகள் தற்போது இயக்கப்படவில்லை. புச் அறிவிப்புகளை அனுப்புவதற்கு, “{navigation}” சொத்தை குறிப்பிடுவதன் மூலம் <இணைப்பு> பயன்பாட்டு வரையறை </இணைப்பு> இல் இதை இயக்கவும்.

# studio.9Jktf3
source: This must be a valid domain name without a protocol
ta: இது நெறிமுறை இல்லாமல் செல்லுபடியாகும் டொமைன் பெயராக இருக்க வேண்டும்

# studio.9PjpLU
source: Learn more in the <link>documentation</link>
ta: <nignive> ஆவணம் </இணைப்பு> இல் மேலும் அறிக

# studio.9QvKLE
source: Something went wrong trying to create training block
ta: பயிற்சித் தொகுதியை உருவாக்க முயற்சிக்கும் ஏதோ தவறு நடந்தது

# studio.9TomUe
source: The permission to delete app collections.
ta: பயன்பாட்டு சேகரிப்புகளை நீக்க இசைவு.

# studio.9VC1l4
source: Delete apps.
ta: பயன்பாடுகளை நீக்கு.

# studio.9XUYQt
source: Import
ta: இறக்குமதி

# studio.9Z805R
source: The permission to delete app variables.
ta: பயன்பாட்டு மாறிகள் நீக்க இசைவு.

# studio.9a+SKt
source: Screenshot
ta: திரைக்காட்சி

# studio.9a9+ww
source: Title
ta: தலைப்பு

# studio.9hSnRE
source: Hide properties from the table. Hidden properties will also be hidden when exporting the properties as CSV.
ta: அட்டவணையில் இருந்து பண்புகளை மறைக்கவும். பண்புகளை காபிம ஆக ஏற்றுமதி செய்யும் போது மறைக்கப்பட்ட பண்புகளும் மறைக்கப்படும்.

# studio.9laEii
source: {member} was successfully removed from the organization
ta: {உறுப்பினர் the நிறுவனத்திலிருந்து வெற்றிகரமாக அகற்றப்பட்டது

# studio.9oTFxb
source: Download the resource JSON
ta: சாதொபொகு வளத்தைப் பதிவிறக்கவும்

# studio.9rXRSk
source: The website of your organization.
ta: உங்கள் நிறுவனத்தின் வலைத்தளம்.

# studio.9sJPOX
source: Select a resource type to add
ta: சேர்க்க ஒரு வள வகையைத் தேர்ந்தெடுக்கவும்

# studio.9uCErh
source: Delete secret
ta: ரகசியத்தை நீக்கு

# studio.A3jj9z
source: Font
ta: எழுத்துரு
