Repository: 247i/TACETr
Catalog: உரை/தானி/appsemble-appsemble-*.po
Languages: ta

# studio.MU09Un
source: Browse collections of open-source apps
ta: திறந்த மூல பயன்பாடுகளின் தொகுப்புகளை உலாவுக

# studio.MVeTei
source: Remove Field
ta: புலத்தை அகற்று

# studio.MWTx65
source: Default Page
ta: இயல்புநிலை பக்கம்

# studio.MZEcF5
source: Difficulty Level
ta: தொல்லை நிலை

# studio.Ma2eea
source: Remove email address
ta: மின்னஞ்சல் முகவரியை அகற்று

# studio.Ma39yN
source: Empty string
ta: வெற்று சரம்

# studio.MafjU7
source: Request failed. Token may be invalid.
ta: கோரிக்கை தோல்வியடைந்தது. கிள்ளாக்கு செல்லாது.

# studio.MePfdF
source: Something went wrong trying to delete this organization
ta: இந்த அமைப்பை நீக்க முயற்சிக்கும் ஏதோ தவறு ஏற்பட்டது

# studio.Mf7tW7
source: The hostname for the custom SMTP server. For example: smtp.gmail.com
ta: தனிப்பயன் SMTP சேவையகத்திற்கான ஓச்ட்பெயர். எடுத்துக்காட்டாக: smtp.gmail.com

# studio.MkELgR
source: The environment that should be passed to Sentry when using a custom Sentry DSN.
ta: தனிப்பயன் சென்ட்ரி டி.எச்.என் பயன்படுத்தும் போது சென்ட்ரிக்கு அனுப்பப்பட வேண்டிய சூழல்.

# studio.MnBkWQ
source: Something went wrong when adding app to collection
ta: சேகரிப்பில் பயன்பாட்டைச் சேர்க்கும்போது ஏதோ தவறு ஏற்பட்டது

# studio.MoWiAL
source: Email host
ta: மின்னஞ்சல் புரவலன்

# studio.N/9y2I
source: Something went wrong when trying to update the email settings
ta: மின்னஞ்சல் அமைப்புகளை புதுப்பிக்க முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது

# studio.N07voO
source: Grants access if the user is in the same group as the user who created the resource.
ta: வளத்தை உருவாக்கிய பயனரின் அதே குழுவில் பயனர் இருந்தால் அணுகலை வழங்குகிறது.

# studio.N2IrpM
source: Confirm
ta: உறுதிப்படுத்தவும்

# studio.N3aA7X
source: Successfully deleted variable {name}
ta: வெற்றிகரமாக நீக்கப்பட்ட மாறி {name}

# studio.N8FhP4
source: The relay state received is invalid.
ta: பெறப்பட்ட ரிலே நிலை தவறானது.

# studio.N8eSxg
source: Are you sure you want to delete this organization? This action cannot be reverted.
ta: இந்த அமைப்பை நீக்க விரும்புகிறீர்களா? இந்த செயலை மாற்ற முடியாது.

# studio.NAidKb
source: Notifications
ta: அறிவிப்புகள்

# studio.NBoEQT
source: Failed to copy tenant URL
ta: குத்தகைதாரர் முகவரி ஐ நகலெடுப்பதில் தோல்வி

# studio.NDV5Mq
source: Options
ta: விருப்பங்கள்

# studio.NIoeCv
source: Register a new Appsemble account
ta: புதிய ஆப்செம்பிள் கணக்கை பதிவு செய்யுங்கள்

# studio.NKioch
source: The password for HTTP basic authentication
ta: HTTP அடிப்படை அங்கீகாரத்திற்கான கடவுச்சொல்

# studio.NLpUeI
source: Edit properties
ta: பண்புகளைத் திருத்து

# studio.NSOI8P
source: Create and modify apps
ta: பயன்பாடுகளை உருவாக்கி மாற்றவும்

# studio.NWBNwU
source: Are you sure you want to delete this app? This action cannot be reverted.
ta: இந்த பயன்பாட்டை நீக்க விரும்புகிறீர்களா? இந்த செயலை மாற்ற முடியாது.

# studio.NaZgJh
source: Something went wrong when fetching all blocks.
ta: எல்லா தொகுதிகளையும் பெறும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.NbKWvJ
source: Display Appsemble OAuth2 login method
ta: AppSemble OAuth2 உள்நுழைவு முறையைக் காண்பி

# studio.NdO+zh
source: Organization name
ta: அமைப்பு பெயர்

# studio.NeXetG
source: Add Permission
ta: இசைவு சேர்க்கவும்

# studio.NkmnB5
source: Action Reference
ta: செயல் குறிப்பு

# studio.Nlu/2H
source: Contributing
ta: பங்களிப்பு

# studio.Nxyyqc
source: The name displayed for emails sent for this app. The email address won’t change.
ta: இந்த பயன்பாட்டிற்கு அனுப்பப்பட்ட மின்னஞ்சல்களுக்கு பெயர் காட்டப்படுகிறது. மின்னஞ்சல் முகவரி மாறாது.

# studio.O+/dCY
source: The URL from which Appsemble should fetch user information.<n></n>Make sure to check with your OAuth2 provider what the correct <info>userinfo</info> endpoint is to use.
ta: AppSemble பயனர் தகவல்களைப் பெற வேண்டிய முகவரி. <n> </n> உங்கள் OAuth2 வழங்குநருடன் சரியான <nofo> UserInfo </infos> இறுதிப் புள்ளி பயன்படுத்த வேண்டியதைச் சரிபார்க்கவும்.

# studio.O+J2Zf
source: SAML Secret
ta: சாம் மறைபொருள்

# studio.O/xXEL
source: The permission to update organization invites.
ta: அமைப்பை புதுப்பிக்க இசைவு அழைக்கிறது.

# studio.OCiHj6
source: Add members
ta: உறுப்பினர்களைச் சேர்க்கவும்

# studio.OEa9Hi
source: The secret for cookie authentication
ta: குக்கீ அங்கீகாரத்திற்கான மறைபொருள்

# studio.OJpqEr
source: An unexpected error has occurred.
ta: எதிர்பாராத பிழை ஏற்பட்டது.

# studio.ONK4Gi
source: Successfully updated email settings
ta: மின்னஞ்சல் அமைப்புகளை வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# studio.ONdhzp
source: Email settings
ta: மின்னஞ்சல் அமைப்புகள்

# studio.OO/TkO
source: Your app is secured using SSL
ta: உங்கள் பயன்பாடு SSL ஐப் பயன்படுத்தி பாதுகாக்கப்படுகிறது

# studio.ORGv1Q
source: Created
ta: உருவாக்கப்பட்டது

# studio.OT+m9M
source: There is an error in
ta: இல் பிழை உள்ளது

# studio.OTVgeC
source: Creating a new group
ta: புதிய குழுவை உருவாக்குதல்

# studio.OWRK6s
source: Info Color
ta: செய்தி நிறம்

# studio.Ot0Rto
source: Block messages
ta: செய்திகளைத் தடுக்கவும்

# studio.Oz66hT
source: Update properties
ta: பண்புகளைப் புதுப்பிக்கவும்

# studio.Ozo2xR
source: There was a problem sending the invite. Please retry later.
ta: அழைப்பை அனுப்புவதில் சிக்கல் இருந்தது. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.

# studio.P1WzdG
source: Create app collection
ta: பயன்பாட்டு சேகரிப்பை உருவாக்கவும்

# studio.P8rKGb
source: Loading SCIM settings…
ta: SCIM அமைப்புகளை ஏற்றுகிறது…

# studio.PBKPH/
source: Mark As Completed
ta: முடிக்கப்பட்டபடி குறி

# studio.PEMz2L
source: The permission to update app variables.
ta: பயன்பாட்டு மாறிகள் புதுப்பிக்க இசைவு.

# studio.PJhe0H
source: Token URL
ta: கிள்ளாக்கு முகவரி

# studio.PJivSX
source: Lesson
ta: பாடம்

# studio.PKzT+n
source: Add a new item to {name}
ta: புதிய உருப்படியை {பெயர் க்கு இல் சேர்க்கவும்

# studio.PPSPn3
source: You do not have permission to view this app.
ta: இந்த பயன்பாட்டைக் காண உங்களுக்கு இசைவு இல்லை.

# studio.PT/5c/
source: No blocks can be displayed for your organisation
ta: உங்கள் நிறுவனத்திற்கு எந்த தொகுதிகளும் காட்ட முடியாது

# studio.PYHQOg
source: Deleting email address
ta: மின்னஞ்சல் முகவரியை நீக்குதல்

# studio.Pe0ogR
source: Theme
ta: கருப்பொருள்

# studio.PfPxNJ
source: Block Icon
ta: தொகுதி படவுரு

# studio.Ph66vC
source: Deleting group
ta: குழுவை நீக்குதல்

# studio.PiZbK/
source: File type
ta: கோப்பு வகை

# studio.Po74DG
source: This is probably due to a configuration error in the SAML identity provider.
ta: இது SAML அடையாள வழங்குநரில் உள்ளமைவு பிழை காரணமாக இருக்கலாம்.

# studio.PsLpk/
source: Tell us what you think of this app!
ta: இந்த பயன்பாட்டைப் பற்றி நீங்கள் என்ன நினைக்கிறீர்கள் என்று எங்களிடம் கூறுங்கள்!

# studio.PtjXAL
source: The cookie for cookie authentication
ta: குக்கீ அங்கீகாரத்திற்கான குக்கீ

# studio.Py189G
source: Security
ta: பாதுகாப்பு

# studio.Q8Qw5B
source: Description
ta: விவரம்

# studio.QCmXtC
source: Role: {role}
ta: பங்கு: {role}

# studio.QHAXqK
source: Are you sure you want to cancel updating the `{resourceName}` resource? This will discard all unsaved changes!
ta: `{resourceName}` வளத்தைப் புதுப்பிப்பதை ரத்து செய்ய விரும்புகிறீர்களா? இது சேமிக்கப்படாத அனைத்து மாற்றங்களையும் நிராகரிக்கும்!

# studio.QLD5P4
source: The logo that represents this organization
ta: இந்த அமைப்பைக் குறிக்கும் லோகோ

# studio.QMUvie
source: Related Resource
ta: தொடர்புடைய சான்று

# studio.QQDup8
source: Loading {type} resources
ta: ஏற்றுதல் {type} வளங்கள்

# studio.QQLKiQ
source: There was a problem loading app ratings.
ta: பயன்பாட்டு மதிப்பீடுகளை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.QQcj9y
source: The permission to delete app assets.
ta: பயன்பாட்டு சொத்துக்களை நீக்க இசைவு.

# studio.QXAhtx
source: Container logs
ta: கொள்கலன் பதிவுகள்

# studio.Qkauj5
source: Would you like to link this {provider} account to your Appsemble account?
ta: இந்த {provider} கணக்கை உங்கள் பயன்பாட்டு கணக்கில் இணைக்க விரும்புகிறீர்களா?

# studio.Qp1beM
source: Path
ta: பாதை

# studio.QprlXT
source: Go through the appsemble training to start building awesome apps.
ta: அற்புதமான பயன்பாடுகளை உருவாக்கத் தொடங்க AppSemble பயிற்சி வழியாகச் செல்லுங்கள்.

# studio.Qt+S+L
source: Editing {resource} {id}
ta: திருத்துதல் {resource} {id}

# studio.R+J5ox
source: Review
ta: சீராய்வு

# studio.R/13HH
source: Preferred language
ta: விருப்பமான மொழி

# studio.R1RMax
source: - Experimental
ta: - சோதனை

# studio.R7tRYh
source: Edit app collection
ta: பயன்பாட்டு சேகரிப்பைத் திருத்தவும்

# studio.RBzBwp
source: {member} was successfully removed from the app
ta: {உறுப்பினர் பயன்பாடு பயன்பாட்டிலிருந்து வெற்றிகரமாக அகற்றப்பட்டது

# studio.RCOsOL
source: The permission to create app screenshots.
ta: ஆப் திரை சாட்களை உருவாக்க இசைவு.

# studio.RCees0
source: The URL where Appsemble should request tokens to log in the user
ta: பயன்பாட்டில் உள்நுழைய டோக்கன்களைக் கோர வேண்டிய முகவரி

# studio.RGofbg
source: If specified, this SAML attribute is used to determine the user’s email address
ta: குறிப்பிடப்பட்டால், பயனரின் மின்னஞ்சல் முகவரியை தீர்மானிக்க இந்த SAML பண்புக்கூறு பயன்படுத்தப்படுகிறது

# studio.RGtQNE
source: References to this role:
ta: இந்த பாத்திரத்திற்கான குறிப்புகள்:

# studio.RJTU10
source: Are you sure you want to remove {member} from this organization?
ta: இந்த அமைப்பிலிருந்து {member} ஐ அகற்ற விரும்புகிறீர்களா?

# studio.RN522K
source: Successfully imported resources {ids}
ta: வெற்றிகரமாக இறக்குமதி செய்யப்பட்ட வளங்கள் {ids}

# studio.RNKP0a
source: View members
ta: உறுப்பினர்களைக் காண்க

# studio.RODeNG
source: The scope to retrieve the token for
ta: கிள்ளாக்கை மீட்டெடுப்பதற்கான நோக்கம்

# studio.RPmD9J
source: The state parameter is invalid. Please try again.
ta: மாநில அளவுரு தவறானது. மீண்டும் முயற்சிக்கவும்.

# studio.RQ4EKT
source: Layout
ta: மனையமைவு

# studio.RQEFoh
source: OAuth2 Secret
ta: Oauth2 மறைபொருள்

# studio.RW6qwB
source: Service provider entity ID copied to clipboard
ta: பணி வழங்குநர் நிறுவன ஐடி கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டது

# studio.Rba9By
source: The password used for authentication for the custom SMTP server. This will be encrypted upon submitting.
ta: தனிப்பயன் SMTP சேவையகத்திற்கான அங்கீகாரத்திற்கு பயன்படுத்தப்படும் கடவுச்சொல். சமர்ப்பிக்கும் போது இது குறியாக்கம் செய்யப்படும்.

# studio.RcZRz+
source: The permission to query app secrets.
ta: பயன்பாட்டு ரகசியங்களை வினவுவதற்கு இசைவு.

# studio.RglIKq
source: Something went wrong trying to delete this app
ta: இந்த பயன்பாட்டை நீக்க முயற்சிக்கும் ஏதோ தவறு ஏற்பட்டது

# studio.RoE66d
source: Single sign on accounts
ta: கணக்குகளில் ஒற்றை அடையாளம்

# studio.S++WdB
source: Read more
ta: மேலும் வாசிக்க

# studio.S3AgyI
source: Creating new {resource}
ta: புதிய {வளத்தை உருவாக்குதல்

# studio.S3s35A
source: Add new language
ta: புதிய மொழியைச் சேர்க்கவும்

# studio.S6Gu8x
source: In order to clone an app you must be in an organization and have the permission to create new apps. You can create one below or have someone invite you to an existing organization.
ta: ஒரு பயன்பாட்டை நகலி செய்ய நீங்கள் ஒரு நிறுவனத்தில் இருக்க வேண்டும் மற்றும் புதிய பயன்பாடுகளை உருவாக்க இசைவு பெற வேண்டும். நீங்கள் கீழே ஒன்றை உருவாக்கலாம் அல்லது ஏற்கனவே இருக்கும் நிறுவனத்திற்கு யாராவது உங்களை அழைக்கலாம்.

# studio.S8vF1o
source: Loading blocks…
ta: தொகுதிகள் ஏற்றுகிறது…

# studio.SCiO7S
source: The certificate that may be used to validate login requests
ta: உள்நுழைவு கோரிக்கைகளை சரிபார்க்க பயன்படுத்தக்கூடிய சான்றிதழ்

# studio.SDua+Y
source: Return to app
ta: பயன்பாட்டிற்கு திரும்பவும்

# studio.SFuk1v
source: Permissions
ta: அனுமதிகள்

# studio.SHiPSp
source: This must be a valid URL
ta: இது செல்லுபடியாகும் முகவரி ஆக இருக்க வேண்டும்

# studio.SIETYz
source: Loading resource history…
ta: வள வரலாற்றை ஏற்றுகிறது…

# studio.SLy0Ae
source: Include readme files in the export file.
ta: ஏற்றுமதி கோப்பில் README கோப்புகளைச் சேர்க்கவும்.

# studio.SOgfRo
source: Undo last change (ctrl+z)
ta: கடைசி மாற்றத்தை செயல்தவிர்க்கவும் (Ctrl+z)

# studio.SVwJTM
source: Export
ta: ஏற்றுமதி

# studio.Seanpx
source: Required
ta: தேவை

# studio.Sg2bxJ
source: All organizations
ta: அனைத்து அமைப்புகளும்

# studio.Smajh0
source: Show Relationship Diagram
ta: உறவு வரைபடத்தைக் காட்டு

# studio.StY0h2
source: Core messages
ta: முக்கிய செய்திகள்

# studio.T0E3nw
source: Seed
ta: விதை

# studio.T0V0Ht
source: Appsemble Login
ta: AppSemble உள்நுழைவு

# studio.T2uuVK
source: Email username
ta: மின்னஞ்சல் பயனர்பெயர்

# studio.T7Ry38
source: Message
ta: செய்தி

# studio.TAMTr1
source: No service secrets have been configured yet.
ta: பணி ரகசியங்கள் இதுவரை கட்டமைக்கப்படவில்லை.

# studio.TBPF+A
source: Loading SAML secrets…
ta: SAML ரகசியங்களை ஏற்றுகிறது…

# studio.TBqbdv
source: Deleting logo
ta: லோகோவை நீக்குகிறது

# studio.TDaF6J
source: Dismiss
ta: தள்ளுபடி

# studio.TGTcH5
source: Danger Color
ta: இடர் நிறம்

# studio.TJCXJF
source: An invalid attribute consume service endpoint was used.
ta: தவறான பண்புக்கூறு நுகர்வு பணி இறுதிப் புள்ளி பயன்படுத்தப்பட்டது.

# studio.TJo5E6
source: Preview
ta: முன்னோட்டம்

# studio.TL9d+v
source: Add a new item at position {index}
ta: {index} என்ற நிலையில் ஒரு புதிய உருப்படியைச் சேர்க்கவும்

# studio.TMEJt9
source: Create New Training
ta: புதிய பயிற்சியை உருவாக்கவும்

# studio.TML/L4
source: Field Name
ta: புலம் பெயர்

# studio.TMfUIc
source: Group Members
ta: குழு உறுப்பினர்கள்

# studio.TPv/Zv
source: Demo
ta: டெமோ

# studio.TUggpX
source: Social login
ta: சமூக உள்நுழைவு

# studio.TdTXXf
source: Learn more
ta: மேலும் அறிக

# studio.TdzZP4
source: Screenshot of {app}
ta: {பயன்பாட்டின் திரை காட்சி

# studio.TgSTnd
source: A short description of what the app can do.
ta: பயன்பாடு என்ன செய்ய முடியும் என்பதற்கான குறுகிய விளக்கம்.

# studio.U0KaoJ
source: Add new role
ta: புதிய பாத்திரத்தைச் சேர்க்கவும்

# studio.U1cf2h
source: Something went wrong when reading the file.
ta: கோப்பைப் படிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.U5+MBC
source: Client ID
ta: வாங்கி ஐடி

# studio.U5QCQI
source: Certificate uploaded
ta: சான்றிதழ் பதிவேற்றப்பட்டது

# studio.UBNfTT
source: The permission to create app collections.
ta: பயன்பாட்டு சேகரிப்புகளை உருவாக்க இசைவு.

# studio.UC1YWm
source: Save secret
ta: ரகசியத்தை சேமிக்கவும்

# studio.UCMXFT
source: Inherit from
ta: இருந்து பெறுதல்

# studio.UFb+xr
source: Select container
ta: கொள்கலன் தேர்ந்தெடுக்கவும்

# studio.UHheiE
source: The email address users can use to contact this organization.
ta: மின்னஞ்சல் முகவரி பயனர்கள் இந்த நிறுவனத்தைத் தொடர்பு கொள்ள பயன்படுத்தலாம்.

# studio.UMtIow
source: Redo last undo (ctrl+y)
ta: சிவப்பு கடைசி செயல்தவிர் (ctrl+y)

# studio.USqX/R
source: Role already exists
ta: பங்கு ஏற்கனவே உள்ளது

# studio.UUoguq
source: Warning Color
ta: எச்சரிக்கை நிறம்

# studio.UZEPLR
source: An unknown error has occurred
ta: அறியப்படாத பிழை ஏற்பட்டது

# studio.UaS6dK
source: Filename
ta: கோப்புப்பெயர்

# studio.Ug+ut0
source: Minimum amount of items
ta: பொருட்களின் குறைந்தபட்ச அளவு

# studio.UgiEIP
source: Deleting a training cannot be undone.
ta: ஒரு பயிற்சியை நீக்குவது செயல்தவிர்க்க முடியாது.

# studio.UhFN32
source: Remapper
ta: மறுபிரவேசம்

# studio.UriWmZ
source: Delete service secret
ta: பணி ரகசியத்தை நீக்கு

# studio.Uv9sdj
source: You don’t have sufficient permissions to create app collections.
ta: பயன்பாட்டு சேகரிப்புகளை உருவாக்க உங்களுக்கு போதுமான அனுமதிகள் இல்லை.

# studio.V/Rfef
source: Are you sure you want to restore this snapshot?
ta: இந்த ச்னாப்சாட்டை மீட்டெடுக்க விரும்புகிறீர்களா?

# studio.V0yq88
source: Settings {name}
ta: அமைப்புகள் {name}

# studio.V2zuAg
source: Deleting an app cannot be undone.
ta: பயன்பாட்டை நீக்குவது செயல்தவிர்க்க முடியாது.

# studio.V4945s
source: There was a problem loading the app. Please try again.
ta: பயன்பாட்டை ஏற்றுவதில் சிக்கல் இருந்தது. மீண்டும் முயற்சிக்கவும்.

# studio.V6/PgG
source: Read app groups
ta: பயன்பாட்டுக் குழுக்களைப் படியுங்கள்

# studio.VHBpyP
source: There was a problem loading the groups.
ta: குழுக்களை ஏற்றுவதில் சிக்கல் இருந்தது.

# studio.VHOLD3
source: Updating resource
ta: வளத்தைப் புதுப்பித்தல்

# studio.VJC3aY
source: Exactly one of the following:
ta: பின்வருவனவற்றில் ஒன்று:

# studio.VL5z0t
source: This is the name that displays for other users.
ta: இது மற்ற பயனர்களைக் காண்பிக்கும் பெயர்.

# studio.VN/45p
source: Successfully declined the invitation. You can go back to Appsemble <makeApps>here</makeApps>.
ta: அழைப்பை வெற்றிகரமாக மறுத்துவிட்டார். நீங்கள் மீண்டும் AppSemble <bakeapps> இங்கே செல்லலாம் </Makeapps>.

# studio.VRUpmK
source: A unique identifier for the organization.
ta: நிறுவனத்திற்கான தனித்துவமான அடையாளங்காட்டி.

# studio.VRt6/G
source: The client secret used to authenticate for the OAuth client credentials flow
ta: OAuth கிளையன்ட் நற்சான்றிதழ் ஓட்டத்தை அங்கீகரிக்க கிளையன்ட் மறைபொருள்

# studio.VVEa+s
source: Login with {name}
ta: {பெயர் with உடன் உள்நுழைக

# studio.VWyf7F
source: The permission to delete app members.
ta: பயன்பாட்டு உறுப்பினர்களை நீக்க இசைவு.

# studio.VYTzq3
source: The permission to update group member roles.
ta: குழு உறுப்பினர் பாத்திரங்களை புதுப்பிக்க இசைவு.

# studio.VlRFUO
source: Loading snapshot…
ta: ச்னாப்சாட்டை ஏற்றுகிறது…

# studio.Vs3jMi
source: Authentication method
ta: அங்கீகார முறை

# studio.Vthwhv
source: Please log into an existing account or create one to respond to this invitation.
ta: தயவுசெய்து ஏற்கனவே உள்ள கணக்கில் உள்நுழைக அல்லது இந்த அழைப்பிற்கு பதிலளிக்க ஒன்றை உருவாக்கவும்.

# studio.VzzYJk
source: Create
ta: உருவாக்கு

# studio.W17A03
source: Restoring snapshot
ta: ச்னாப்சாட்டை மீட்டமைத்தல்

# studio.W1r0Vu
source: Store page
ta: பக்கத்தை சேமிக்கவும்

# studio.W5ovPo
source: The following pages are using the role "{roleName}":
ta: பின்வரும் பக்கங்கள் "{roleName}" என்ற பாத்திரத்தைப் பயன்படுத்துகின்றன:

# studio.W8lzbA
source: Removing member
ta: உறுப்பினர் நீக்குதல்

# studio.W9mcKw
source: Select a file
ta: ஒரு கோப்பைத் தேர்ந்தெடுக்கவும்

# studio.WGj64n
source: Minimum Length
ta: குறைந்தபட்ச நீளம்

# studio.WGxbEB
source: Rounded square (iPhone)
ta: வட்டமான நாற்கை (ஐபோன்)

# studio.WKtGHy
source: Secrets
ta: ரகசியங்கள்

# studio.WX/z1r
source: Successfully deleted {amount, plural, one {asset} other {assets}} {assets}
ta: வெற்றிகரமாக நீக்கப்பட்டது {தொகை, பன்மை, ஒன்று {asset} மற்ற {assets}} {assets}

# studio.Wd+wHl
source: Save Profile
ta: சுயவிவரத்தை சேமிக்கவும்

# studio.Wg9eSl
source: Copied client credentials to clipboard
ta: கிளிப்போர்டுக்கு கிளையன்ட் நற்சான்றிதழ்களை நகலெடுத்தது

# studio.WhIybZ
source: SSL
ta: எச்.எச்.எல்

# studio.WkrNSk
source: English
ta: ஆங்கிலம்

# studio.Wq60Lf
source: Page name cannot be empty
ta: பக்க பெயர் காலியாக இருக்க முடியாது

# studio.WxTxT/
source: This organization currently has no blocks.
ta: இந்த அமைப்புக்கு தற்போது எந்த தொகுதிகளும் இல்லை.

# studio.X0ha1a
source: Save changes
ta: மாற்றங்களைச் சேமிக்கவும்

# studio.X8zYDn
source: This invite is invalid. This may be caused by the invitation being retracted.
ta: இந்த அழைப்பு தவறானது. அழைப்பிதழ் பின்வாங்கப்படுவதால் இது ஏற்படலாம்.

# studio.XAnhya
source: Default language
ta: இயல்புநிலை மொழி

# studio.XAw0Lo
source: Update an existing {resourceName} resource
ta: ஏற்கனவே உள்ள {resourceName} வளத்தைப் புதுப்பிக்கவும்

# studio.XD8sl2
source: Sentry environment
ta: அனுப்பப்பட்ட சூழல்

# studio.XGRBwY
source: Create Page
ta: பக்கத்தை உருவாக்கவும்

# studio.XREHho
source: Resource Warning
ta: வள எச்சரிக்கை

# studio.XTIljc
source: App is already in collection
ta: பயன்பாடு ஏற்கனவே சேகரிப்பில் உள்ளது

# studio.XVpEX+
source: Cookie authentication
ta: குக்கீ ஏற்பு

# studio.XYovs/
source: Ratings
ta: மதிப்பீடுகள்

# studio.XZyOLa
source: Are you sure you want to delete this role and all of its references in the app?
ta: இந்த பாத்திரத்தையும் அதன் அனைத்து குறிப்புகளையும் பயன்பாட்டில் நீக்க விரும்புகிறீர்களா?

# studio.XcSHdk
source: Loading resource…
ta: வளத்தை ஏற்றுகிறது…

# studio.XdKIcE
source: Save Page
ta: பக்கத்தை சேமிக்கவும்

# studio.XkOni/
source: Custom messages
ta: தனிப்பயன் செய்திகள்

# studio.XpziH6
source: The current status of the SSL certificate is unknown
ta: SSL சான்றிதழின் தற்போதைய நிலை தெரியவில்லை

# studio.Xr50rl
source: Successfully deleted app collection {name}
ta: பயன்பாட்டு சேகரிப்பு {name} வெற்றிகரமாக நீக்கப்பட்டது

# studio.Xw/F4c
source: Apply filter options to your resources, these options will also be applied when exporting the CSV.
ta: உங்கள் ஆதாரங்களுக்கு வடிகட்டி விருப்பங்களைப் பயன்படுத்துங்கள், காபிம ஐ ஏற்றுமதி செய்யும் போது இந்த விருப்பங்களும் பயன்படுத்தப்படும்.

# studio.Y5XkIv
source: There was a problem disconnecting {name}
ta: {name} துண்டிக்கப்படுவதில் சிக்கல் இருந்தது

# studio.Y8DgqT
source: Read your public profile (primary email and display name).
ta: உங்கள் பொது சுயவிவரத்தைப் படியுங்கள் (முதன்மை மின்னஞ்சல் மற்றும் காட்சி பெயர்).

# studio.YAqTbk
source: The ratings are being loaded
ta: மதிப்பீடுகள் ஏற்றப்படுகின்றன

# studio.YB73Dp
source: The permission to query group members.
ta: குழு உறுப்பினர்களை வினவுவதற்கு இசைவு.

# studio.YENw2V
source: Link to Video
ta: வீடியோவுக்கான இணைப்பு

# studio.YNK4ka
source: "{roleName}" is being used in the app's roles.
ta: பயன்பாட்டின் பாத்திரங்களில் "{roleName}" பயன்படுத்தப்படுகிறது.

# studio.YS/siD
source: Css Preview
ta: சிஎச்எச் முன்னோட்டம்

# studio.YY4aOu
source: Circle (Google Pixel)
ta: வட்டம் (கூகிள் பிக்சல்)

# studio.YkBh9a
source: Something went wrong when trying to add this email address.
ta: இந்த மின்னஞ்சல் முகவரியைச் சேர்க்க முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# studio.YlqNBR
source: App Reference
ta: பயன்பாட்டு குறிப்பு

# studio.YmRDCH
source: Minimal safe area
ta: குறைந்தபட்ச பாதுகாப்பான பகுதி

# studio.YqrhDL
source: The status code in the SAML response is invalid.
ta: SAML பதிலில் உள்ள நிலைக் குறியீடு தவறானது.

# studio.Yy/yDL
source: Reset password
ta: கடவுச்சொல்லை மீட்டமைக்கவும்

# studio.Z/1udv
source: Edit group
ta: குழு திருத்து

# studio.Z/h2/C
source: Browse all blocks that are available within Appsemble
ta: AppSemble க்குள் கிடைக்கும் அனைத்து தொகுதிகளையும் உலாவுக

# studio.Z7LWEB
source: Successfully unlocked the app.
ta: பயன்பாட்டை வெற்றிகரமாகத் திறந்தது.

# studio.Z8971h
source: Verified
ta: சரிபார்க்கப்பட்டது

# studio.Z8Fm9O
source: The permission to publish blocks for an organization.
ta: ஒரு நிறுவனத்திற்கான தொகுதிகளை வெளியிட இசைவு.

# studio.ZMqEzX
source: Delete app collection
ta: பயன்பாட்டு சேகரிப்பை நீக்கு

# studio.ZO00zQ
source: Additional properties are allowed
ta: கூடுதல் பண்புகள் அனுமதிக்கப்படுகின்றன

# studio.ZRF/CV
source: The permission to patch app resources.
ta: பயன்பாட்டு ஆதாரங்களை இணைப்பதற்கான இசைவு.

# studio.ZW/7f6
source: This asset can not be previewed.
ta: இந்த சொத்தை முன்னோட்டமிட முடியாது.

# studio.Zhw6Jx
source: Clipboard
ta: இடைநிலைப் பலகை

# studio.ZvdROO
source: Remove member
ta: உறுப்பினரை அகற்று

# studio.ZwFww6
source: Google Analytics ID
ta: கூகிள் அனலிட்டிக்ச் ஐடி

# studio.Zyp2ZN
source: Deleting training
ta: பயிற்சியை நீக்குதல்

# studio.a/LsOZ
source: Something went wrong trying to delete this training
ta: இந்த பயிற்சியை நீக்க முயற்சிக்கும் ஏதோ தவறு ஏற்பட்டது

# studio.a/flL4
source: Successfully deleted training {name}
ta: வெற்றிகரமாக நீக்கப்பட்ட பயிற்சி {name}

# studio.a0k4/v
source: Connected apps
ta: இணைக்கப்பட்ட பயன்பாடுகள்

# studio.a5msuh
source: Yes
ta: ஆம்

# studio.a8h0qp
source: You do not have permission to view this app collection.
ta: இந்த பயன்பாட்டு சேகரிப்பைக் காண உங்களுக்கு இசைவு இல்லை.

# studio.a8m+6u
source: This will override messages for all languages found in the file.
ta: இது கோப்பில் காணப்படும் அனைத்து மொழிகளுக்கும் செய்திகளை மீறும்.

# studio.aCdAsI
source: Copy to clipboard
ta: கிளிப்போர்டுக்கு நகலெடுக்கவும்

# studio.aFyu8N
source: Translations
ta: மொழிபெயர்ப்புகள்

# studio.aH4De2
source: Source
ta: மூலம்

# studio.aHd3bT
source: Delete client credentials
ta: கிளையன்ட் நற்சான்றிதழ்களை நீக்கு

# studio.aI80kg
source: Properties
ta: பண்புகள்

# studio.aWgR+h
source: Difficulty level
ta: தொல்லை நிலை

# studio.aajgdZ
source: Something went wrong trying to delete this app collection
ta: இந்த பயன்பாட்டு சேகரிப்பை நீக்க முயற்சிக்கும் ஏதோ தவறு ஏற்பட்டது

# studio.aalup0
source: Loading SSL secrets…
ta: SSL ரகசியங்களை ஏற்றுகிறது…
