Repository: 247i/TACETr
Catalog: உரை/தானி/audile-strings-*.po
Languages: ta

# about_pref_subtitle_license
source: Audile is licensed under GNU GPLv3 or later
ta: ஆடியில் குனு சி.பி.எல்.வி 3 அல்லது அதற்குப் பிறகு உரிமம் பெற்றது

# about_pref_title_third_licenses
source: Third-party licences
ta: மூன்றாம் தரப்பு உரிமங்கள்

# about_pref_subtitle_third_licenses
source: Licenses of the third-party libraries Audile uses
ta: மூன்றாம் தரப்பு நூலகங்களின் உரிமங்கள் ஆடில் பயன்படுத்தும் உரிமங்கள்

# notification_button_disable_service
source: Stop service
ta: சேவையை நிறுத்துங்கள்

# notification_button_show_lyrics
source: Show lyrics
ta: பாடல் காட்டு

# notification_channel_name_control
source: Control notifications
ta: அறிவிப்புகளைக் கட்டுப்படுத்துங்கள்

# notification_channel_desc_control
source: Allows to control recognition process via notifications
ta: அறிவிப்புகள் வழியாக அங்கீகார செயல்முறையை கட்டுப்படுத்த அனுமதிக்கிறது

# notification_channel_name_result
source: Recognition results
ta: அங்கீகார முடிவுகள்

# notification_channel_desc_result
source: Allows to receive recognition results via notifications
ta: அறிவிப்புகள் மூலம் அங்கீகார முடிவுகளைப் பெற அனுமதிக்கிறது

# notification_channel_name_scheduled_result
source: Scheduled recognition results
ta: திட்டமிடப்பட்ட அங்கீகார முடிவுகள்

# notification_channel_desc_scheduled_result
source: Allows to receive scheduled recognition results via notifications
ta: அறிவிப்புகள் மூலம் திட்டமிடப்பட்ட அங்கீகார முடிவுகளைப் பெற அனுமதிக்கிறது

# crash_dialog_title
source: Audile has crashed
ta: ஆடில் செயலிழந்தது

# crash_dialog_message
source: An unexpected error has occurred, causing the app to stop. Would you like to email the bug report to help fix the issue?
ta: எதிர்பாராத பிழை ஏற்பட்டது, இதனால் பயன்பாடு நிறுத்தப்படுகிறது. சிக்கலை சரிசெய்ய உதவும் பிழை அறிக்கையை மின்னஞ்சல் செய்ய விரும்புகிறீர்களா?

# crash_dialog_comment_prompt
source: You can add extra information here:
ta: கூடுதல் தகவல்களை இங்கே சேர்க்கலாம்:

# crash_dialog_button_send
source: Send
ta: அனுப்பு

# crash_dialog_button_cancel
source: Cancel
ta: ரத்துசெய்

source: Amazon Music
ta: அமேசான் இசை

source: Anghami
ta: டியூன்

source: Apple Music
ta: ஆப்பிள் இசை

source: Audiomack
ta: ஆடியோமேக்

source: Audius
ta: ஆடியச்

source: Boomplay
ta: ப்யூனம்ப்ளே

source: Deezer
ta: டீசர்

source: MusicBrainz
ta: மியூசிக் பிரேன்ச்

source: Napster
ta: நாப்ச்டர்

source: Pandora
ta: பண்டோரா

source: SoundCloud
ta: சவுண்ட்க்ளூட்

source: Tidal
ta: வற்றுப்பெருக்கு

source: Yandex Music
ta: யாண்டெக்ச் இசை

source: YouTube Music
ta: யூடியூப் இசை

source: AudD
ta: வழிகாட்டி

source: ACRCloud
ta: அக் முகில்

source: Odesli
ta: உடை

source: Wikipedia
ta: விக்கிபீடியா

source: API token
ta: பநிஇ கிள்ளாக்கு

source: Host
ta: விருந்தோம்பி

source: Access key
ta: அணுகல் விசை

source: Access secret
ta: அணுகல் மறைபொருள்
