Repository: 247i/TACETr
Catalog: உரை/தானி/audile-strings-*.po
Languages: ta

# app_name
source: Audile
ta: ஆடியுக்கு

# main_screen_tap_to_recognize
source: Tap to recognize
ta: அடையாளம் காண தட்டவும்

# main_screen_listening
source: Listening
ta: கேட்பது

# main_screen_listening_extra_time
source: Trying one more time
ta: இன்னும் ஒரு முறை முயற்சிக்கிறது

# widget_tap_to_recognize
source: Tap to recognize
ta: அடையாளம் காண தட்டவும்

# widget_tap_to_try_again
source: Tap to try again
ta: மீண்டும் முயற்சிக்க தட்டவும்

# widget_listening
source: Listening
ta: கேட்பது

# widget_listening_subtitle
source: Please wait
ta: தயவுசெய்து காத்திருங்கள்

# widget_listening_subtitle_extra_time
source: Trying one more time
ta: இன்னும் ஒரு முறை முயற்சிக்கிறது

# recognition_widget_description
source: Recognize the song in one tap
ta: பாடலை ஒரே தட்டில் அடையாளம் காணவும்

# notification_tap_to_recognize
source: Tap to recognize
ta: அடையாளம் காண தட்டவும்

# notification_tap_to_recognize_subtitle
source: Identify music while any app open
ta: எந்த பயன்பாடும் திறக்கும்போது இசையை அடையாளம் காணவும்

# notification_listening
source: Listening
ta: கேட்பது

# notification_listening_subtitle
source: Please wait
ta: தயவுசெய்து காத்திருங்கள்

# notification_listening_subtitle_extra_time
source: Trying one more time
ta: இன்னும் ஒரு முறை முயற்சிக்கிறது

# quick_tile_recognize
source: Recognize song
ta: பாடலை அங்கீகரிக்கவும்

# quick_tile_cancel_recognition
source: Cancel recognition
ta: அங்கீகாரத்தை ரத்துசெய்

# action_recognize
source: Recognize
ta: அங்கீகரிக்கவும்

# action_cancel_recognition
source: Cancel recognition
ta: அங்கீகாரத்தை ரத்துசெய்

# app_shortcut_recognize_short
source: Recognize
ta: அங்கீகரிக்கவும்

# app_shortcut_recognize_long
source: Recognize in background
ta: பின்னணியில் அங்கீகரிக்கவும்

# app_shortcut_open_and_recognize_short
source: Open & Recognize
ta: திறந்து அங்கீகரிக்கவும்

# app_shortcut_open_and_recognize_long
source: Open app and recognize
ta: பயன்பாட்டைத் திறந்து அங்கீகரிக்கவும்

# nav_back
source: Back
ta: பின்

# nav_forward
source: Forward
ta: முன்னோக்கி

source: Loading
ta: ஏற்றுகிறது

source: Apply
ta: இடு

source: Applied
ta: பயன்படுத்தப்பட்டது

source: Cancel
ta: ரத்துசெய்

source: Reset
ta: மீட்டமை

source: Close
ta: மூடு

source: Not now
ta: இப்போது இல்லை

source: Save
ta: சேமி

source: Delete
ta: நீக்கு

source: Hide
ta: மறை

source: Show
ta: காட்டு

source: Edit
ta: தொகு

# clear_text_field
source: Clear
ta: தெளிவான

# text_field_must_not_be_empty
source: Must not be empty
ta: காலியாக இருக்கக்கூடாது

source: Copy
ta: நகலெடு

source: Copied
ta: நகலெடுக்கப்பட்டது

source: Share
ta: பங்கு

# web_browser_not_found_toast
source: Web browser not found
ta: வலை உலாவி கிடைக்கவில்லை

# cannot_share_toast
source: Can't find any application to share
ta: பகிர எந்த விண்ணப்பத்தையும் கண்டுபிடிக்க முடியவில்லை

source: Help
ta: உதவி

source: Show more
ta: மேலும் காட்டு

source: Show less
ta: குறைவாகக் காட்டு

source: Permissions
ta: அனுமதிகள்

source: Request permission
ta: இசைவு கோருங்கள்

# permission_rationale_record_audio
source: To perform music recognition, the app needs access to your microphone.
ta: இசை அங்கீகாரத்தைச் செய்ய, பயன்பாட்டிற்கு உங்கள் மைக்ரோஃபோனுக்கு அணுகல் தேவை.

# permission_rationale_post_notifications
source: To control recognition and get result even when the app is minimized, it requires permission to send notifications.
ta: அங்கீகாரத்தைக் கட்டுப்படுத்தவும், பயன்பாட்டைக் குறைக்கும்போது கூட முடிவைப் பெறவும், அறிவிப்புகளை அனுப்ப இசைவு தேவைப்படுகிறது.

# permissions_denied_message
source: Previous permissions requests have been denied. You can change your decision through the settings.
ta: முந்தைய அனுமதிகள் கோரிக்கைகள் மறுக்கப்பட்டுள்ளன. அமைப்புகள் மூலம் உங்கள் முடிவை மாற்றலாம்.

# permissions_denied_open_settings
source: Open settings
ta: திறந்த அமைப்புகள்

source: Permission granted
ta: இசைவு வழங்கப்பட்டது

# onboarding_welcome
source: Welcome
ta: வரவேற்கிறோம்

# onboarding_welcome_message
source: Audile is a music recognition application, that can help you quickly and accurately recognize a music track playing nearby you.
ta: ஆடியில் ஒரு இசை அங்கீகார பயன்பாடு, இது உங்களுக்கு அருகிலுள்ள ஒரு இசை பாதையை விரைவாகவும் துல்லியமாகவும் அங்கீகரிக்க உதவும்.

# onboarding_permission_message
source: The app requires permission to record audio in order to work properly. By granting this permission, you agree that your recorded data will be used by <![CDATA[<a href="%1$s">remote service</a>]]> for music recognition. The app does not use this data for any other purpose.
ta: சரியாக வேலை செய்ய ஆடியோவைப் பதிவு செய்ய பயன்பாட்டிற்கு இசைவு தேவை. இந்த அனுமதியை வழங்குவதன் மூலம், உங்கள் பதிவுசெய்யப்பட்ட தரவு <! [Cdata [<a href = "%1$s"> தொலை பணி </a>]]> இசை அங்கீகாரத்திற்காக பயன்படுத்தப்படும் என்பதை ஒப்புக்கொள்கிறீர்கள். பயன்பாடு இந்தத் தரவை வேறு எந்த நோக்கத்திற்காகவும் பயன்படுத்தாது.

# onboarding_token_message
source: The app uses AudD music recognition service, which is not free and requires a special API token. Sign up <![CDATA[<a href="%1$s">here</a>]]> to get your 14-day trial token, if you don't have one yet.
ta: இந்த பயன்பாடு ADAD இசை அங்கீகார சேவையைப் பயன்படுத்துகிறது, இது இலவசம் அல்ல, சிறப்பு பநிஇ கிள்ளாக்கு தேவைப்படுகிறது. உங்கள் 14 நாள் சோதனை கிள்ளாக்கைப் பெற, உங்களிடம் இன்னும் இல்லையென்றால், உங்கள் 14 நாள் சோதனை கிள்ளாக்கைப் பெற <!

# onboarding_token_skip_message
source: Skipping this step will limit your daily recognitions, but you can always specify your personal token later in preferences.
ta: இந்த நடவடிக்கையைத் தவிர்ப்பது உங்கள் அன்றாட அங்கீகாரங்களை மட்டுப்படுத்தும், ஆனால் உங்கள் தனிப்பட்ட கிள்ளாக்கை பின்னர் விருப்பங்களில் குறிப்பிடலாம்.

# onboarding_token_validating
source: Validating
ta: சரிபார்ப்பு

# onboarding_final_title
source: We are ready to go
ta: நாங்கள் செல்ல தயாராக இருக்கிறோம்

# onboarding_final_message
source: Setup completed successfully
ta: அமைவு வெற்றிகரமாக முடிந்தது

# onboarding_final_get_started
source: Get started
ta: தொடங்கவும்

source: Recognition
ta: ஏற்பு

# popup_offline_mode
source: Offline mode
ta: இணைப்பில்லாத பயன்முறை

# button_retry_recognition
source: Retry
ta: மீண்டும் முயற்சிக்கவும்

# result_title_no_matches
source: No matches found
ta: போட்டிகள் எதுவும் கிடைக்கவில்லை

# result_message_no_matches
source: Sorry, the app couldn't recognize this song
ta: மன்னிக்கவும், இந்த பாடலை பயன்பாட்டால் அடையாளம் காண முடியவில்லை

# result_title_bad_connection
source: Bad internet connection
ta: மோசமான இணைய இணைப்பு

# result_message_bad_connection
source: Please, check your network status
ta: தயவுசெய்து, உங்கள் பிணைய நிலையை சரிபார்க்கவும்

# result_title_recognition_saved
source: Recognition saved
ta: ஏற்பு சேமிக்கப்பட்டது

# result_message_recognition_saved
source: The audio sample was saved, you can launch recognition whenever you want manually
ta: ஆடியோ மாதிரி சேமிக்கப்பட்டது, நீங்கள் கைமுறையாக விரும்பும் போதெல்லாம் அங்கீகாரத்தைத் தொடங்கலாம்

# result_title_recognition_scheduled
source: Recognition scheduled
ta: ஏற்பு திட்டமிடப்பட்டுள்ளது

# result_message_recognition_scheduled
source: The audio sample was saved, when you get back online, the app will try to identify this song
ta: ஆடியோ மாதிரி சேமிக்கப்பட்டது, நீங்கள் ஆன்லைனில் திரும்பி வரும்போது, ​​பயன்பாடு இந்த பாடலை அடையாளம் காண முயற்சிக்கும்

# result_title_recording_error
source: Recording error
ta: பதிவு செய்யும் பிழை

# result_message_recording_error
source: An error occurred during audio recording
ta: ஆடியோ பதிவின் போது பிழை ஏற்பட்டது

# result_title_bad_network_response
source: Bad network response
ta: மோசமான பிணைய பதில்

# result_message_bad_network_response
source: An error occurred during internet request
ta: இணைய கோரிக்கையின் போது பிழை ஏற்பட்டது

# result_title_auth_error
source: Authentication error
ta: அங்கீகார பிழை

# result_message_auth_error
source: Please, check your credentials for the selected recognition service and try again
ta: Please, சரிபார் your credentials க்கு the தேர்ந்தெடுக்கப்பட்டது recognition பணி and try again

# result_title_service_usage_limited
source: Service usage limited
ta: பணி usage limited

# result_message_service_usage_limited
source: Your service usage has reached its limit. Please, check your plan or try again later
ta: உங்கள் பணி பயன்பாடு அதன் வரம்பை எட்டியுள்ளது. தயவுசெய்து, உங்கள் திட்டத்தை சரிபார்க்கவும் அல்லது பின்னர் மீண்டும் முயற்சிக்கவும்

# result_title_internal_error
source: Internal error
ta: உள் பிழை

# result_message_internal_error
source: An internal error occurred
ta: உள் பிழை ஏற்பட்டது

# result_title_unknown_error
source: Unknown error
ta: தெரியாத பிழை

source: Library
ta: நூலகம்

# empty_library_title
source: No recognized songs
ta: அங்கீகரிக்கப்பட்ட பாடல்கள் இல்லை

# empty_library_subtitle
source: Your recently recognized and favorite songs will be shown here
ta: உங்கள் அண்மைக் காலத்தில் அங்கீகரிக்கப்பட்ட மற்றும் பிடித்த பாடல்கள் இங்கே காண்பிக்கப்படும்

# library_menu_mark_all_tracks_as_viewed
source: Mark all as viewed
ta: அனைத்தையும் பார்க்கும்படி குறிக்கவும்

# unviewed_track_label
source: NEW
ta: புதிய

# format_amount_of_new_tracks
source: New tracks: %s
ta: புதிய தடங்கள்: %s

source: Filters
ta: வடிப்பான்கள்

# filter_favorites
source: Favorites
ta: பிடித்தவை

# filter_all
source: All
ta: அனைத்தும்

# filter_only_favorites
source: Only favorites
ta: பிடித்தவை மட்டுமே

# filter_exclude_favorites
source: Exclude favorites
ta: பிடித்தவைகளை விலக்கவும்

# filter_sort_by
source: Sort by
ta: வரிசைப்படுத்தவும்

# filter_recognition_date
source: Recognition date
ta: அங்கீகார தேதி

# filter_title
source: Title
ta: தலைப்பு

# filter_artist
source: Artist
ta: கலைஞர்

# filter_release_date
source: Release date
ta: வெளியீட்டு தேதி

# filter_order_By
source: Order by
ta: வழங்கியவர்

# filter_ascending
source: Ascending
ta: ஏறுதல்

# filter_descending
source: Descending
ta: இறங்கு

# library_search
source: Search track
ta: தேடல் பாதையில்

# library_search_hint
source: Search track…
ta: தேடல் பாதையில்…

# no_tracks_match_filter
source: No tracks matching selected filters
ta: தேர்ந்தெடுக்கப்பட்ட வடிப்பான்களுடன் பொருந்தக்கூடிய தடங்கள் இல்லை

# no_tracks_match_search
source: No tracks matching search criteria
ta: தேடல் அளவுகோல்களுடன் பொருந்தக்கூடிய தடங்கள் இல்லை

# delete_tracks_title
source: Delete tracks
ta: தடங்களை நீக்கு

# delete_tracks_message
source: Are you sure you want to delete selected tracks? This action cannot be undone.
ta: தேர்ந்தெடுக்கப்பட்ட தடங்களை நீக்க விரும்புகிறீர்களா? இந்த செயலை செயல்தவிர்க்க முடியாது.

source: Recognition queue
ta: அங்கீகார வரிசை

source: Queue
ta: வரிசை

# empty_recognition_queue_title
source: No queued recognitions
ta: வரிசைப்படுத்தப்பட்ட அங்கீகாரங்கள் இல்லை

# empty_recognition_queue_subtitle
source: In offline or on failure, a recognition can be queued according to the chosen fallback policy
ta: ஆஃப்லைனில் அல்லது தோல்வியில், தேர்ந்தெடுக்கப்பட்ட குறைவடைக் கொள்கையின்படி ஒரு அங்கீகாரத்தை வரிசைப்படுத்தலாம்

source: Untitled recognition
ta: பெயரிடப்படாத ஏற்பு

# format_scheduled_recognition_of
source: Scheduled recognition of %s
ta: %s இன் திட்டமிடப்பட்ட ஏற்பு

# format_recognition_created
source: Created: %s
ta: உருவாக்கப்பட்டது: %s

# format_recognition_status
source: Status: %s
ta: நிலை: %s

# recognition_status_idle
source: Idle
ta: நிலையிக்கம்

# recognition_status_enqueued
source: Enqueued
ta: Enqueuted

# recognition_status_running
source: Running
ta: இயங்கும்

# recognition_status_track_found
source: Track found
ta: ட்ராக் காணப்பட்டது

# recognition_action_enqueue
source: Enqueue recognition
ta: Enqueue ஏற்பு

# recognition_action_force_launch
source: Force launch
ta: படை ஏவுதல்

# recognition_action_show_track
source: Show track
ta: டிராக் காட்டு

# recognition_action_rename
source: Rename
ta: மறுபெயரிடுங்கள்

source: Select all
ta: அனைத்தையும் தெரிவுசெய்

source: Disable multi selection mode
ta: பல தேர்வு பயன்முறையை முடக்கு

source: Cancel selected
ta: தேர்ந்தெடுக்கப்பட்டதை ரத்துசெய்

source: Delete selected
ta: தேர்ந்தெடுக்கப்பட்டதை நீக்கு

# recording_start_player
source: Play
ta: விளையாடுங்கள்

# recording_stop_player
source: Stop
ta: நிறுத்து

# delete_recognitions_title
source: Delete recognitions
ta: அங்கீகாரங்களை நீக்கு

# delete_recognitions_message
source: Are you sure you want to cancel and delete selected scheduled recognitions? This action cannot be undone.
ta: தேர்ந்தெடுக்கப்பட்ட திட்டமிடப்பட்ட அங்கீகாரங்களை ரத்து செய்து நீக்க விரும்புகிறீர்களா? இந்த செயலை செயல்தவிர்க்க முடியாது.

# mark_track_as_favorite
source: Mark as favorite
ta: பிடித்தவராக குறி

# unmark_track_as_favorite
source: Unmark as favorite
ta: பிடித்தவையாக மதிப்பிடப்படுகிறது

source: Show track
ta: டிராக் காட்டு

source: Show lyrics
ta: பாடல் காட்டு

source: Web search
ta: வலை தேடல்

source: Web
ta: விரலிடைத் தோல்

source: Search
ta: தேடல்

source: Search for
ta: தேடுங்கள்

source: Search in
ta: தேடுங்கள்

# format_open_website_or_app
source: Open %s
ta: திறந்த %s

source: Track info
ta: கண்காணிப்பு செய்தி

# track_info_title_duration
source: Track duration:
ta: கண்காணிப்பு காலம்:

# track_info_title_recognized_at
source: Recognized at:
ta: அங்கீகரிக்கப்பட்டுள்ளது:

# track_info_title_recognized_by
source: Recognized by:
ta: வழங்கியவர்:

# track_info_title_date_of_last_recognition
source: Date of last recognition:
ta: கடைசி அங்கீகார தேதி:

source: Artwork
ta: ஒளிமறைப்பு

# artwork_share_menu_link
source: Link
ta: இணைப்பு

# artwork_share_menu_image
source: Image
ta: படம்

# track_metadata
source: Metadata
ta: மேனிலை தரவு

source: Track
ta: மின்தடம்

source: Title
ta: தலைப்பு

source: Artist
ta: கலைஞர்

source: Album
ta: ஆல்பம்

source: Year
ta: ஆண்டு

source: Lyrics
ta: பாடல்

# share_music_services_links
source: Music service links
ta: இசை பணி இணைப்புகள்

# track_not_found_title
source: The track was not found
ta: பாடல் கண்டுபிடிக்கப்படவில்லை

# track_not_found_message
source: Something went wrong, the track may have been removed or modified incorrectly
ta: ஏதோ தவறு நடந்தது, பாடல் அகற்றப்பட்டிருக்கலாம் அல்லது தவறாக மாற்றியிருக்கலாம்

# lyrics_start_autoscroll
source: Start autoscroll
ta: ஆட்டோச்க்ரோல் தொடங்கவும்

# lyrics_stop_autoscroll
source: Stop autoscroll
ta: ஆட்டோச்க்ரோலை நிறுத்துங்கள்

source: Text style
ta: உரை நடை

source: Font size
ta: எழுத்துரு அளவு

# font_size_small
source: Small
ta: சிறிய

# font_size_normal
source: Normal
ta: சாதாரண

# font_size_large
source: Large
ta: பெரிய

# font_size_huge
source: Huge
ta: பெரிய

source: Align to start
ta: தொடங்குவதற்கு சீரமைக்கவும்

source: Bold text
ta: தைரியமான உரை

source: High-contrast text
ta: உயர்-மாறுபட்ட உரை

source: Preferences
ta: விருப்பத்தேர்வுகள்

# pref_group_recognition
source: Recognition
ta: ஏற்பு

# pref_title_recognize_on_startup
source: Recognize on startup
ta: தொடக்கத்தில் அங்கீகரிக்கவும்

# pref_title_audio_source
source: Audio source
ta: ஆடியோ மூல

# pref_subtitle_audio_source
source: Set audio recording configuration
ta: ஆடியோ பதிவு உள்ளமைவை அமைக்கவும்

# audio_source_dialog_title
source: Audio source
ta: ஆடியோ மூல

# audio_source_dialog_default_mode_title
source: Default
ta: இயல்புநிலை

# audio_source_dialog_default_mode_message
source: Select the default audio source to be used unless specified otherwise:
ta: வேறுவிதமாகக் குறிப்பிடப்படாவிட்டால் பயன்படுத்த வேண்டிய இயல்புநிலை ஆடியோ மூலத்தைத் தேர்ந்தெடுக்கவும்:

# audio_source_dialog_button_long_press_mode_title
source: Button long press
ta: பொத்தான் நீண்ட அழுத்தவும்

# audio_source_dialog_button_long_press_mode_message
source: Select the audio source to be used when the main screen button is long-pressed:
ta: முதன்மையான திரை பொத்தானை நீண்ட அழுத்தும்போது பயன்படுத்த வேண்டிய ஆடியோ மூலத்தைத் தேர்ந்தெடுக்கவும்:

# audio_capture_mode_microphone
source: Microphone
ta: ஒலிவாங்கி

# audio_capture_mode_device
source: Device audio
ta: சாதன ஆடியோ

# audio_capture_mode_auto
source: Automatic
ta: தானியங்கி

# pref_title_fallback_policy
source: Recognition fallback policy
ta: ஏற்பு குறைவடையும் கொள்கை

# pref_subtitle_fallback_policy
source: Set fallback actions after unsuccessful recognitions
ta: தோல்வியுற்ற அங்கீகாரங்களுக்குப் பிறகு குறைவடையும் செயல்களை அமைக்கவும்

# fallback_policy_dialog_title
source: Fallback policy
ta: குறைவடையும் கொள்கை

# fallback_policy_dialog_message
source: Set the default fallback action for each type of unsuccessful result:
ta: ஒவ்வொரு வகை தோல்வியுற்ற முடிவுக்கும் இயல்புநிலை குறைவடையும் செயலை அமைக்கவும்:

# fallback_action_save_recording_and_retry
source: Save the recording and launch retry
ta: பதிவைச் சேமித்து, மீண்டும் முயற்சிக்கவும்

# fallback_action_save_recording
source: Save the recording
ta: பதிவைச் சேமிக்கவும்

# fallback_action_ignore
source: Ignore
ta: புறக்கணிக்கவும்

# fallback_trigger_bad_connection
source: Bad internet connection
ta: மோசமான இணைய இணைப்பு

# fallback_trigger_no_matches_found
source: No matches found
ta: போட்டிகள் எதுவும் கிடைக்கவில்லை

# fallback_trigger_other_failures
source: Other failures
ta: பிற தோல்விகள்

# pref_title_recognition_provider
source: Recognition provider
ta: அங்கீகார வழங்குநர்

# recognition_provider_dialog_title
source: Provider
ta: வழங்குநர்

# recognition_provider_dialog_message
source: Select the recognition provider:
ta: அங்கீகார வழங்குநரைத் தேர்ந்தெடுக்கவும்:

# recognition_provider_dialog_format_auth
source: %s authentication:
ta: %s அங்கீகாரம்:

# audd_help_dialog_message
source: AudD is a paid service that offers the option of a free trial period for 14 days. To use this service, you need to create an account and get your private API token. <![CDATA[<a href="%1$s">Sign up</a>]]> if you don't have one yet.
ta: AUDD என்பது கட்டண சேவையாகும், இது 14 நாட்களுக்கு இலவச சோதனைக் காலத்தின் விருப்பத்தை வழங்குகிறது. இந்த சேவையைப் பயன்படுத்த, நீங்கள் ஒரு கணக்கை உருவாக்கி உங்கள் தனிப்பட்ட பநிஇ கிள்ளாக்கைப் பெற வேண்டும். <!

# audd_help_dialog_message_empty_token
source: You can try using the service for testing purposes without providing the token, but please note that this will limit your daily recognitions.
ta: கிள்ளாக்கை வழங்காமல் சோதனை நோக்கங்களுக்காக சேவையைப் பயன்படுத்த முயற்சி செய்யலாம், ஆனால் இது உங்கள் அன்றாட அங்கீகாரங்களை மட்டுப்படுத்தும் என்பதை நினைவில் கொள்க.

# acr_cloud_help_dialog_message
source: ACRCloud is a paid service that offers the option of a free trial period and limited usage for development purposes. To use this service, you need to create an account and register a project. If you encounter any difficulties, please refer to <![CDATA[<a href="%1$s">this guide</a>]]>.
ta: ACRCloud என்பது கட்டண சேவையாகும், இது இலவச சோதனைக் காலத்தின் விருப்பத்தையும் மேம்பாட்டு நோக்கங்களுக்காக வரையறுக்கப்பட்ட பயன்பாட்டையும் வழங்குகிறது. இந்த சேவையைப் பயன்படுத்த, நீங்கள் ஒரு கணக்கை உருவாக்கி ஒரு திட்டத்தை பதிவு செய்ய வேண்டும். நீங்கள் ஏதேனும் சிரமங்களை எதிர்கொண்டால், தயவுசெய்து <! [Cdata [<a href = "%1$s"> இந்த வழிகாட்டி </a>]]> ஐப் பார்க்கவும்.

# acr_cloud_help_dialog_steps_title
source: Please pay attention to these steps:
ta: இந்த படிகளில் கவனம் செலுத்துங்கள்:

# acr_cloud_help_dialog_step1
source: Select the geographical region closest to you to minimize internet latency
ta: இணைய தாமதத்தைக் குறைக்க உங்களுக்கு மிக நெருக்கமான புவியியல் பகுதியைத் தேர்ந்தெடுக்கவும்

# acr_cloud_help_dialog_step2
source: Set the audio source as "Recorded audio"
ta: ஆடியோ மூலத்தை "பதிவுசெய்யப்பட்ட ஆடியோ" ஆக அமைக்கவும்

# acr_cloud_help_dialog_step3
source: Set the audio engine of your choice. The option "Audio fingerprinting" is the most accurate for general use
ta: உங்களுக்கு விருப்பமான ஆடியோ இயந்திரத்தை அமைக்கவும். "ஆடியோ கைரேகை" என்ற விருப்பம் பொதுவான பயன்பாட்டிற்கு மிகவும் துல்லியமானது

# acr_cloud_help_dialog_step4
source: Check all the boxes for 3rd party ID integration
ta: 3 வது தரப்பு ஐடி ஒருங்கிணைப்புக்கான அனைத்து பெட்டிகளையும் சரிபார்க்கவும்

# pref_group_notifications
source: Notifications
ta: அறிவிப்புகள்

# pref_title_notification_service
source: Notification service
ta: அறிவிப்பு பணி

# pref_subtitle_notification_service
source: Control recognition from notifications
ta: அறிவிப்புகளிலிருந்து அங்கீகாரத்தைக் கட்டுப்படுத்துங்கள்

# pref_group_appearance
source: Appearance
ta: தோற்றம்

# pref_title_use_grid_layout
source: Use grid layout
ta: கட்டம் தளவமைப்பைப் பயன்படுத்தவும்

# pref_title_show_recognition_date
source: Show recognition date
ta: அங்கீகார தேதியைக் காட்டு

# pref_title_show_creation_date
source: Show creation date
ta: உருவாக்கும் தேதியைக் காட்டு

# pref_title_theme
source: Theme
ta: கருப்பொருள்

# theme_dialog_message
source: Select the theme mode:
ta: கருப்பொருள் பயன்முறையைத் தேர்ந்தெடுக்கவும்:

# theme_mode
source: Mode
ta: பயன்முறை

# theme_mode_follow_system
source: Follow system
ta: அமைப்பைப் பின்தொடரவும்

# theme_mode_light
source: Light
ta: ஒளி

# theme_mode_dark
source: Dark
ta: இருண்ட

# theme_use_dynamic_colors
source: Use dynamic colors
ta: மாறும் வண்ணங்களைப் பயன்படுத்துங்கள்

# theme_use_artwork_colors
source: Use artwork colors
ta: கலைப்படைப்பு வண்ணங்களைப் பயன்படுத்துங்கள்

# theme_use_pure_black
source: Use pure black
ta: தூய கருப்பு பயன்படுத்தவும்

# pref_title_music_services_links
source: Music service links
ta: இசை பணி இணைப்புகள்

# pref_subtitle_format_more_services
source: %1$s, and %2$d more
ta: %1$s, மற்றும் %2$d

# pref_subtitle_no_selected_services
source: None
ta: எதுவுமில்லை

# music_services_links_dialog
source: Choose the music services for which you would like to see web links (if available):
ta: வலை இணைப்புகளைக் காண விரும்பும் இசை சேவைகளைத் தேர்வுசெய்க (கிடைத்தால்):

# pref_group_misc
source: Misc
ta: இதர

# pref_title_vibration_feedback
source: Vibration feedback
ta: அதிர்வு கருத்து

# vibration_feedback_dialog_title
source: Vibration
ta: அதிர்வு

# vibration_feedback_dialog_message
source: Configure vibration feedback for certain in-app actions:
ta: பயன்பாட்டில் உள்ள சில செயல்களுக்கு அதிர்வு பின்னூட்டத்தை உள்ளமைக்கவும்:

# vibration_feedback_dialog_vibrate_on_tap
source: Vibrate on tap
ta: குழாய் மீது அதிர்வு

# vibration_feedback_dialog_vibrate_on_result
source: Vibrate on result
ta: முடிவில் அதிர்வு

# pref_title_experimental_features
source: Experimental features
ta: சோதனை நற்பொருத்தங்கள்

# pref_subtitle_experimental_features
source: Work-in-progress
ta: வேலை முன்னேற்றம்

# pref_title_backup_and_restore
source: Backup & Restore
ta: காப்புப்பிரதி மற்றும் மீட்டமை

# pref_subtitle_backup_and_restore
source: Backup your database and preferences
ta: உங்கள் தரவுத்தளம் மற்றும் விருப்பங்களை காப்புப் பிரதி எடுக்கவும்

# pref_title_backup
source: Backup
ta: காப்புப்பிரதி

# pref_subtitle_backup
source: Export app data and preferences
ta: பயன்பாட்டு தரவு மற்றும் விருப்பங்களை ஏற்றுமதி செய்யுங்கள்

# backup_dialog_title
source: Backup
ta: காப்புப்பிரதி

# backup_dialog_button_backup
source: Backup
ta: காப்புப்பிரதி

# pref_title_restore
source: Restore
ta: மீட்டமை

# pref_subtitle_restore
source: Restore app data and preferences from backup
ta: பயன்பாட்டு தரவு மற்றும் விருப்பங்களை காப்புப்பிரதியிலிருந்து மீட்டமைக்கவும்

# restore_dialog_title
source: Restore
ta: மீட்டமை

# restore_dialog_button_restore
source: Restore
ta: மீட்டமை

# pref_title_about_app
source: About
ta: பற்றி

# about_pref_group_powered_by
source: Powered by
ta: மூலம் இயக்கப்படுகிறது

# about_purpose_recognition_service
source: Provides song identification and primary metadata
ta: பாடல் அடையாளம் மற்றும் முதன்மை மெட்டாடேட்டாவை வழங்குகிறது

# about_purpose_track_links_service
source: Provides additional platform-specific track links
ta: கூடுதல் இயங்குதள-குறிப்பிட்ட தட இணைப்புகளை வழங்குகிறது

# about_pref_title_github_repo
source: GitHub repository
ta: அறிவிலிமையம் களஞ்சியம்

# about_pref_subtitle_github_repo
source: Source code, issues and other information
ta: மூலக் குறியீடு, சிக்கல்கள் மற்றும் பிற தகவல்கள்

# about_pref_title_privacy_policy
source: Privacy policy
ta: தனியுரிமைக் கொள்கை

# about_pref_subtitle_privacy_policy
source: Learn more how the app handles your data
ta: பயன்பாடு உங்கள் தரவை எவ்வாறு கையாளுகிறது என்பதை மேலும் அறிக

# about_pref_title_license
source: License
ta: உரிமம்

# about_pref_title_licenses
source: Licenses
ta: உரிமங்கள்
