Repository: 247i/TACETr
Catalog: உரை/தானி/aurora-store-aurorastore-translations-*.po
Languages: ta

# app_name
source: Aurora Store
ta: அரோரா கடை

# about_wiki_title
source: Wiki
ta: விக்கி

# about_wiki_summary
source: Find answers to frequently asked questions (F.A.Q.), troubleshooting steps and more
ta: அடிக்கடி கேட்கப்படும் கேள்விகள் (F.A.Q.), சரிசெய்தல் படிகள் மற்றும் பலவற்றிற்கான பதில்களைக் கண்டறியவும்

# about_bhim
source: BHIM - UPI
ta: பீம் - யுபிஐ

# about_bhim_summary
source: Donate via UPI
ta: யுபிஐ வழியாக கொடையளி

# about_bitcoin_bch
source: Bitcoin Cash
ta: பிட்காயின் ரொக்கம்

# about_bitcoin_bch_summary
source: Donate via Bitcoin Cash (BCH)
ta: பிட்காயின் பணம் (பி.சி.எச்) வழியாக நன்கொடை

# about_bitcoin_btc
source: Bitcoin
ta: பிட்காயின்

# about_bitcoin_btc_summary
source: Donate via Bitcoin (BTC)
ta: பிட்காயின் (பி.டி.சி) வழியாக நன்கொடை

# about_bitcoin_eth
source: Ethereum
ta: ஈத்யூரம்

# about_bitcoin_eth_summary
source: Donate via Ethereum (ETH)
ta: Ethereum (ETH) வழியாக நன்கொடை அளிக்கவும்

# about_fdroid
source: F-Droid
ta: எஃப்-டிரயோடு

# about_fdroid_summary
source: Get the Aurora Store via F-Droid.
ta: அரோரா ஸ்டோரை எஃப்-டிரயோடு வழியாகப் பெறுங்கள்.

# about_gitlab
source: GitLab
ta: கிட்லாப்

# about_gitlab_summary
source: Get the Aurora Store source code from Aurora OSS on GitLab.
ta: கிட்லாப்பில் அரோரா ஓஎஸ்எஸ்ஸிலிருந்து அரோரா ஸ்டோர் மூலக் குறியீட்டைப் பெறுங்கள்.

# about_libera
source: Liberapay
ta: லிபராபே

# about_libera_summary
source: Become a patron on Liberapay
ta: லிபரபேயில் ஒரு புரவலர் ஆக

# about_paypal
source: PayPal
ta: பேபால்

# about_paypal_summary
source: Donate via PayPal
ta: பேபால் வழியாக நன்கொடை

# about_telegram
source: Telegram
ta: தந்தி

# about_telegram_summary
source: Join the Aurora Support group for discussions or suggestions.
ta: விவாதங்கள் அல்லது பரிந்துரைகளுக்கு அரோரா ஆதரவு குழுவில் சேரவும்.

# about_xda
source: XDA Forums
ta: எக்ச்.டி.ஏ மன்றங்கள்

# about_xda_summary
source: See the Aurora Store XDA thread for discussions or suggestions.
ta: விவாதங்கள் அல்லது பரிந்துரைகளுக்கு அரோரா ஸ்டோர் எக்ஸ்.டி.ஏ நூலைப் பார்க்கவும்.

# account_anonymous
source: Anonymous
ta: பெயர் அறியப்படாத

# account_google
source: Google
ta: கூகிள்

# account_login_using
source: Log in using
ta: பயன்படுத்தி உள்நுழையவும்

# account_logout
source: Log out from Aurora
ta: அரோராவிலிருந்து வெளியேறவும்

# action_back
source: Back
ta: பின்செல்க

# action_blacklist
source: Blacklist
ta: தடுப்புப்பட்டியல்

# action_blacklist_add
source: Add to blacklist
ta: தடுப்புப்பட்டியலில் சேர்

# action_cancel
source: Cancel
ta: ரத்துசெய்

# action_clear
source: Clear
ta: நீக்கு

# action_close
source: Close
ta: மூடுக

# action_copy
source: Copy
ta: நகல்

# action_copy_link
source: Copy link
ta: இணைப்பை நகலெடு

# action_disable
source: Disable
ta: முடக்கு

# action_export
source: Export
ta: ஏற்றுமதி

# action_import
source: Import
ta: இறக்குமதி

# action_favourite
source: Favourite
ta: பிடித்த

# action_filter
source: Filters
ta: வடிகட்டிகள்

# action_filter_all
source: All
ta: அனைத்தும்

# action_filter_apply
source: Apply
ta: செயல்படுத்து

# action_filter_apps_with_ads
source: Apps with ads
ta: விளம்பரங்களுடன் பயன்பாடுகள்

# action_filter_downloads
source: Downloads
ta: தரவிறக்கங்கள்

# action_filter_gsf_dependent_apps
source: GSF dependent
ta: ஜி.எஸ்.எஃப் சார்ந்தது

# action_filter_misc
source: Misc
ta: மற்றவை

# action_filter_paid_apps
source: Paid
ta: கட்டணம்

# action_filter_rating
source: Ratings
ta: மதிப்பீடுகள்

# action_finish
source: Finish
ta: முடிந்தது

# action_get_local_apk
source: Save app bundle
ta: பயன்பாட்டு மூட்டைச் சேமி

# action_grant
source: Grant
ta: வழங்கு

# action_granted
source: Granted
ta: வழங்கப்பட்டது

# action_ignore
source: Ignore
ta: புறக்கணி

# action_install
source: Install
ta: நிறுவு

# action_installations
source: Installations
ta: நிறுவல்கள்

# action_installing
source: Installing
ta: நிறுவுகிறது

# action_join
source: Join
ta: சேர்

# action_later
source: Later
ta: பின்னர்

# action_leave
source: Leave
ta: வெளியேறுகள்

# action_logout
source: Log out
ta: வெளியேறு

# action_next
source: Next
ta: அடுத்த

# action_ok
source: Okay
ta: சரி

# action_open
source: Open
ta: திற

# action_pending
source: Pending
ta: நிலுவையில் உள்ளது

# action_post
source: Post
ta: இடுகையிடு

# action_remove_all
source: Remove all
ta: அனைத்தையும் அகற்று

# action_request_analysis
source: Request new analysis
ta: புதிய பகுப்பாய்வைக் கோருங்கள்

# action_restart
source: Restart
ta: மறுதுவக்கு

# action_resume
source: Resume
ta: மீண்டுந்தொடர்

# action_search
source: Search
ta: தேடு

# action_select_all
source: Select all
ta: அனைத்தையும் தேர்ந்தெடு

# action_share
source: Share
ta: பகிர்

# action_uninstall
source: Uninstall
ta: நிறுவல் நீக்கு

# action_uninstall_success
source: Successfully uninstalled
ta: வெற்றிகரமாக நிறுவல் நீக்கப்பட்டது

# action_home_screen
source: Add to home screen
ta: முகப்புத் திரையில் சேர்

# action_info
source: App info
ta: பயன்பாட்டுத் தகவல்

# action_update
source: Update
ta: புதுப்பி

# action_update_all
source: Update all
ta: எல்லாம் புதுப்பி

# action_whitelist
source: Whitelist
ta: வெண்பட்டியல்

# details_beta
source: Beta program
ta: பீட்டா திட்டம்

# details_beta_subscribed
source: You're a beta tester
ta: நீங்கள் பீட்டா சோதனையாளர்

# details_beta_available
source: Join beta program?
ta: பீட்டா திட்டத்தில் சேரவா?

# details_beta_description
source: You will see new features and bugs before the public does. Give your feedback to developers to help them improve.
ta: புதிய அம்சங்களையும் பிழைகளையும் பொது மக்கள் பார்ப்பதற்கு முன் நீங்கள் பார்ப்பீர்கள். டெவலப்பர்கள் மேம்படுத்த உதவ உங்கள் கருத்தை அவர்களுக்கு வழங்கவும்.

# details_beta_delay
source: Enrollment may take some time, you can check status later.
ta: பதிவுசெய்ய சிறிது நேரம் ஆகலாம், பின்னர் நிலையைச் சரிபார்க்கலாம்.

# details_changelog
source: Changelog
ta: மாற்றப்பதிவு

# details_changelog_unavailable
source: Changelog not provided
ta: மாற்றப்பதிவு வழங்கப்படவில்லை

# details_contains_ads
source: Contains ads
ta: விளம்பரங்களைக் கொண்டுள்ளது

# details_dependencies
source: Dependencies
ta: சார்புநிலைகள்

# details_description
source: Description
ta: விரித்துரைத்தல்

# details_dev_address
source: Address
ta: முகவரி

# details_dev_details
source: Developer contact
ta: உருவாக்குநரின் தொடர்பு

# details_dev_email
source: Email
ta: மின்னஞ்சல்

# details_dev_profile
source: Developer profile
ta: உருவாக்குநர் சுயவிவரம்

# details_dev_website
source: Website
ta: வலைத் தளம்

# details_free
source: Free
ta: இலவசம்

# details_gsf_dependent
source: Requires GSF
ta: GSF தேவை

# details_more_about_app
source: More about app
ta: பயன்பாட்டைப் பற்றி மேலும்

# details_no_ads
source: No ads
ta: விளம்பரங்கள் இல்லை

# details_no_app_match
source: No app match found
ta: பயன்பாட்டு பொருத்தம் எதுவும் இல்லை

# details_no_favourites
source: No favourite apps found
ta: பிடித்த பயன்பாடுகள் எதுவும் கிடைக்கவில்லை

# details_no_dependencies
source: No dependencies
ta: சார்புகளில்லை

# details_no_permission
source: No permissions
ta: அனுமதிகள் இல்லை

# details_no_updates
source: No updates available
ta: புதுப்பிப்புகள் எதுவும் இல்லை

# details_paid
source: Paid
ta: செலுத்தப்பட்டது

# details_permission
source: Permission
ta: அனுமதி

# details_data_safety_title
source: Data safety
ta: தரவு பாதுகாப்பு

# details_data_safety_subtitle
source: Data privacy and security practices declared by developer
ta: டெவலப்பரால் அறிவிக்கப்பட்ட தரவு தனியுரிமை மற்றும் பாதுகாப்பு நடைமுறைகள்

# details_privacy
source: Privacy
ta: தனியுரிமை

# details_ratings
source: Rating and reviews
ta: மதிப்பீடு மற்றும் மதிப்புரைகள்

# details_ratings_title_hint
source: Review title
ta: மதிப்பாய்வு தலைப்பு

# details_think_this_app
source: What do you think about this app?
ta: இந்த பயன்பாட்டைப் பற்றி நீங்கள் என்ன நினைக்கிறீர்கள்?

# download_cancel_all
source: Cancel all
ta: அனைத்தையும் ரத்து செய்

# download_canceled
source: Cancelled
ta: ரத்து செய்யப்பட்டது

# download_clear_finished
source: Clear finished
ta: தெளிவாக முடிந்தது

source: Download completed
ta: பதிவிறக்கம் முடிந்தது

# download_eta_calculating
source: Calculating
ta: கணக்கிடுகிறது

# download_eta_hrs
source: %1$dh %2$dm %3$ds left
ta: %1$dh %2$dm %3$ds மீதமுள்ளது

# download_eta_min
source: %1$dm %2$ds left
ta: %1$dm %2$ds மீதமுள்ளது

# download_eta_sec
source: %1$ds left
ta: %1$ds இடது

source: Download failed
ta: பதிவிறக்கம் தோல்வியடைந்தது

# download_force_clear_all
source: Force clear all
ta: அனைத்தையும் அழிக்கவும்

# download_metadata
source: Getting metadata
ta: மேனிலைத்தரவைப் பெறுகிறது

# download_none
source: No downloads
ta: பதிவிறக்கங்கள் இல்லை

# download_pause_all
source: Pause all
ta: அனைத்தையும் இடைநிறுத்து

# download_paused
source: Paused • <xliff:g id="completed_downloads">%1$d</xliff:g> / <xliff:g id="all_downloads">%2$d</xliff:g>
ta: இடைநிறுத்தப்பட்டது • <xliff:g id="completed_downloads">%1$d</xliff:g> / <xliff:g id="all_downloads">%2$d</xliff:g>

# download_progress
source: Downloading • <xliff:g id="completed_downloads">%1$d</xliff:g> / <xliff:g id="all_downloads">%2$d</xliff:g> • <xliff:g id="speed">%3$s</xliff:g>
ta: பதிவிறக்கம் • <xliff:g id="completed_downloads">%1$d</xliff:g> / <xliff:g id="all_downloads">%2$d</xliff:g> • <xliff:g id="speed">%3$s</xliff:g>

# download_queued
source: Queued
ta: வரிசையில் நிற்கிறது

# download_resume_all
source: Resume all
ta: அனைத்தையும் மீண்டும் தொடரவும்

# download_speed_estimating
source: Estimating
ta: மதிப்பிடுகிறது

# exodus_no_tracker
source: Contains no known trackers
ta: அறியப்பட்ட டிராக்கர்கள் எதுவும் இல்லை

# exodus_powered
source: Powered by Exodus Privacy
ta: யாத்திராகமம் தனியுரிமையால் இயக்கப்படுகிறது

# exodus_progress
source: Checking for trackers…
ta: டிராக்கர்களை சரிபார்க்கிறது…

# exodus_substring
source: known trackers(s) found in
ta: அறியப்பட்ட டிராக்கர்கள் (கள்) காணப்படுகின்றன

# exodus_view_report
source: View report
ta: அறிக்கையைப் பார்

# filter_review_all
source: All
ta: எல்லாம்

# filter_latest
source: Latest
ta: அண்மைக் கால

# filter_review_critical
source: Critical
ta: இக்கட்டானது

# filter_review_five
source: Five
ta: ஐந்து

# filter_review_four
source: Four
ta: நான்கு

# filter_review_one
source: One
ta: ஒன்று

# filter_review_positive
source: Positive
ta: நேர்மறை

# filter_review_three
source: Three
ta: மூன்று

# filter_review_two
source: Two
ta: இரண்டு

# installer_am_unavailable
source: Install App Manager or change the installer.
ta: செயலி நிர்வகியை நிறுவு அ நிறுவியை மாற்று.

# installer_root_unavailable
source: No root access. Grant it or change the installer.
ta: ரூட் அணுகல் இல்லை. அதை வழங்கவும் அல்லது நிறுவியை மாற்றவும்.

# installer_shizuku_unavailable
source: Shizuku is not installed or set up properly.
ta: சிசுகு நிறுவப்படவில்லை அல்லது சரியாக அமைக்கப்படவில்லை.

# installer_service_available
source: Aurora Services is available and ready to install.
ta: அரோரா சேவைகள் கிடைக்கின்றன மற்றும் நிறுவத் தயாராக உள்ளன.

# installer_service_unavailable
source: Install Aurora Services 1.0.9 or above, or change the installer.
ta: அரோரா சேவைகளை 1.0.9 அல்லது அதற்கு மேல் நிறுவவும் அல்லது நிறுவியை மாற்று.

# installer_service_misconfigured
source: Set up Aurora Services and grant all permissions first.
ta: அரோரா சேவைகளை அமைத்து, முதலில் அனைத்து அனுமதிகளையும் வழங்கவும்.

# installer_status_failure
source: Installer failed
ta: நிறுவல் தோல்வியடைந்தது

# installer_status_failure_blocked
source: Installation was blocked
ta: நிறுவல் தடுக்கப்பட்டது

# installer_status_failure_session
source: Could not create session
ta: அமர்வை படைக்க முடியவில்லை

# installer_status_failure_conflict
source: Conflicting package exists
ta: முரண்பட்ட தொகுப்பு உள்ளது

# installer_status_failure_incompatible
source: Incompatible app
ta: பொருந்தாத பயன்பாடு

# installer_status_failure_invalid
source: Invalid or corrupted APK
ta: செல்லாத அல்லது சிதைந்த APK

# installer_status_failure_storage
source: Insufficient memory space
ta: போதிய நினைவக இடம் இல்லை

# installer_status_success
source: Successfully installed
ta: வெற்றிகரமாக நிறுவப்பட்டது

# installer_status_user_action
source: Waiting for user confirmation
ta: பயனர் உறுதிப்படுத்தலுக்காகக் காத்திருக்கிறது

# menu_disclaimer
source: Disclaimer
ta: பொறுப்புத்துறப்பு

# menu_license
source: License
ta: உரிமம்

# menu_terms
source: Terms of service
ta: சேவை விதிமுறைகள்

# device_miui_title
source: MIUI detected!
ta: MIUI கண்டறியப்பட்டது!

# device_miui_subtitle
source: Session installer can not install apps due to MIUI Optimizations.
ta: MIUI மேம்படுத்தல்கள் காரணமாக அமர்வு நிறுவி பயன்பாடுகளை நிறுவ முடியாது.

# device_miui_description
source: Please, disable MIUI optimizations to allow installations, otherwise you can choose Root or Services installer.
ta: நிறுவல்களை அனுமதிக்க, MIUI மேம்படுத்தல்களை முடக்கவும், இல்லையெனில் நீங்கள் ரூட் அல்லது சேவைகள் நிறுவியை தேர்வு செய்யலாம்.

# device_miui_extra
source: Optionally you can choose Native installer, but then you can not install bundled (split) APKs, so choice is yours.
ta: விருப்பமாக நீங்கள் நேட்டிவ் இன்ஸ்டாலரைத் தேர்வு செய்யலாம், ஆனால் நீங்கள் தொகுக்கப்பட்ட (பிளவு) APKகளை நிறுவ முடியாது, எனவே தேர்வு உங்களுடையது.

# dialog_title_self_update
source: New update available
ta: புதிய புதுப்பிப்பு கிடைக்கிறது

# dialog_desc_native_split
source: You can not install bundled(split) apps via Native Installer. Change your installer to Session, Services or Root.
ta: நேட்டிவ் இன்ஸ்டாலர் மூலம் தொகுக்கப்பட்ட (பிளவு) பயன்பாடுகளை நிறுவ முடியாது. உங்கள் நிறுவியை அமர்வு, சேவைகள் அல்லது ரூட்டிற்கு மாற்றவும்.

# notification_channel_account
source: Account-related notification
ta: கணக்கு தொடர்பான அறிவிப்பு

# notification_channel_export
source: App export notification
ta: பயன்பாட்டு ஏற்றுமதி அறிவிப்பு

# notification_channel_install
source: Install notification
ta: அறிவிப்பை நிறுவவும்

# notification_channel_downloads
source: Downloads notification
ta: பதிவிறக்க அறிவிப்பு

# onboarding_permission_select
source: Aurora Store requires following permissions
ta: அரோரா ஸ்டோருக்கு பின்வரும் அனுமதிகள் தேவை

# onboarding_title_installer
source: Installer
ta: நிறுவி

# onboarding_title_permissions
source: Permissions
ta: அனுமதிகள்

# onboarding_title_welcome
source: Welcome
ta: வருக

# onboarding_welcome_select
source: How you doing?
ta: எப்படி உள்ளீர்கள்?

# onboarding_permission_esa
source: External storage access
ta: வெளிப்புற சேமிப்பிட அணுகல்

# onboarding_permission_esa_desc
source: To save APK expansion files (OBBs) for large apps & games.
ta: பெரிய பயன்பாடுகள் மற்றும் கேம்களுக்கான APK விரிவாக்க கோப்புகளை (OBBS) சேமிக்க.

# onboarding_permission_esm
source: External storage manager
ta: வெளிப்புற சேமிப்பக மேலாளர்

# onboarding_permission_installer
source: Installer permission
ta: நிறுவி அனுமதி

# onboarding_permission_installer_desc
source: Allow installing apps from Aurora Store
ta: அரோரா ஸ்டோரிலிருந்து செயலிகள் நிறுவ அனுமதி

# onboarding_permission_installer_legacy_desc
source: Allow installation of apps from unknown sources
ta: அறியப்படாத மூலங்களிலிருந்து பயன்பாடுகளை நிறுவ அனுமதிக்கவும்

# onboarding_permission_notifications
source: Notifications
ta: அறிவிப்புகள்

# onboarding_permission_notifications_desc
source: Send notifications regarding installations status
ta: நிறுவல்கள் நிலை குறித்து அறிவிப்புகளை அனுப்பவும்

# onboarding_permission_doze
source: Background downloads
ta: பின்னணி பதிவிறக்கங்கள்

# onboarding_permission_doze_desc
source: Allow Aurora Store to download and update apps in background
ta: பயன்பாடுகளை பின்னணியில் பதிவிறக்கம் செய்து புதுப்பிக்க அரோரா கடையை அனுமதிக்கவும்

# pref_common_extra
source: Extras
ta: கூடுதல்

# pref_filter_fdroid_summary
source: Don't check updates for apps downloaded or installed from F-Droid
ta: எஃப்-டிராய்டிலிருந்து பதிவிறக்கம் செய்யப்பட்ட அல்லது நிறுவப்பட்ட பயன்பாடுகளுக்கான புதுப்பிப்புகளை சரிபார்க்க வேண்டாம்

# pref_filter_fdroid_title
source: Filter F-Droid apps
ta: F-Droid செயலிகளை வடிகட்டு

# pref_install_delete_summary
source: Downloaded APKs will be deleted immediately after installation
ta: பதிவிறக்கம் செய்யப்பட்ட APK கள் நிறுவிய உடனேயே நீக்கப்படும்

# pref_install_delete_title
source: Delete APK post-install
ta: APK நிறுவலுக்குப் பின் அழி

# pref_install_mode_am
source: AM installer
ta: நான் நிறுவி

# pref_install_mode_shizuku
source: Shizuku installer
ta: சிசுகு உறுப்பினர்கள் கோ

# pref_install_mode_native
source: Native installer (Deprecated)
ta: சொந்த நிறுவி (நீக்கப்பட்டது)

# pref_install_mode_root
source: Root installer
ta: ரூட் நிறுவி

# pref_install_mode_services
source: Aurora Services (Deprecated)
ta: அரோரா சேவைகள் (நீக்கப்பட்டது)

# pref_install_mode_session
source: Session installer
ta: அமர்வு நிறுவி

# pref_install_mode_summary
source: Select mode of APK installation
ta: APK நிறுவலின் பயன்முறையைத் தேர்ந்தெடு

# pref_install_mode_title
source: Installation method
ta: நிறுவல் பயன்முறை

# pref_vending_version_title
source: Google Play version
ta: கூகிள் இயக்கு பதிப்பு

# pref_vending_version_device
source: Default (from device config)
ta: இயல்புநிலை (சாதன கட்டமைப்பிலிருந்து)

# pref_network_title
source: Networking
ta: பிணையமாக்கம்

# pref_network_proxy_url
source: Proxy URL
ta: பதிலாள் முகவரி

# pref_network_proxy_url_message
source: Enter a valid proxy URL to pass all data through the proxy.
ta: எல்லா தரவையும் பதிலாள் மூலம் அனுப்ப செல்லுபடியாகும் பதிலாள் முகவரி ஐ உள்ளிடவும்.

# pref_ui_title
source: Customization
ta: தனிப்பயனாக்கம்

# pref_ui_no_for_you
source: For you pages
ta: உங்களுக்கான பக்கங்கள்

# pref_ui_no_for_you_desc
source: Display For you pages on home screen
ta: முகப்புத் திரையில் உங்களுக்கான பக்கங்களைக் காட்டு

# pref_ui_similar_apps
source: Similar and related apps
ta: ஒத்த மற்றும் தொடர்புடைய பயன்பாடுகள்

# pref_ui_similar_apps_desc
source: Display similar and related clusters on app details page
ta: செயலி விவரங்கள் பக்கத்தில் ஒத்த மற்றும் தொடர்புடைய கொத்துகளைக் காண்பி

# pref_updates_incompatible
source: Incompatible updates
ta: பொருந்தாத புதுப்பிப்புகள்

# pref_updates_incompatible_desc
source: Show updates for incompatible or disabled apps that may fail to install
ta: நிறுவத் தவறிய பொருந்தாத அல்லது முடக்கப்பட்ட பயன்பாடுகளுக்கான புதுப்பிப்புகளைக் காட்டு

# pref_aurora_only
source: Aurora Store apps only
ta: அரோரா கடை பயன்பாடுகள் மட்டுமே

# pref_aurora_only_desc
source: Only check updates for apps installed by Aurora Store
ta: அரோரா கடை நிறுவிய பயன்பாடுகளுக்கான புதுப்பிப்புகளை மட்டுமே சரிபார்க்கவும்

# purchase_failed
source: Download failed
ta: பதிவிறக்கம் தோல்வியடைந்தது

# purchase_invalid
source: App not purchased
ta: பயன்பாடு வாங்கப்படவில்லை

# purchase_unsupported
source: App not supported
ta: பயன்பாடு ஆதரிக்கப்படவில்லை

# purchase_not_found
source: App not found
ta: பயன்பாடு கிடைக்கவில்லை

# purchase_no_file
source: Could not get files
ta: கோப்புகளைப் பெற முடியவில்லை

# purchase_session_expired
source: Session expired, re-login to obtain new session.
ta: அமர்வு காலாவதியானது, புதிய அமர்வைப் பெற மீண்டும் உள்நுழைக.

# session_enjoy
source: Log in and enjoy.
ta: உள்நுழைந்து மகிழுங்கள்.

# session_good
source: Woah! All good.
ta: ஓ! எல்லாம் நல்லது.

# session_init
source: Getting things ready…
ta: விசயங்களை ஆயத்தம் செய்வது…

# session_login
source: Please log in to your Google Play account
ta: உங்கள் Google Play கணக்கில் உள்நுழைக

# session_login_failed_google
source: Could not log in via Google
ta: கூகிள் வழியாக உள்நுழைய முடியவில்லை

# session_scrapped
source: Last session scrapped
ta: கடைசி அமர்வு அகற்றப்பட்டது

# session_verifying
source: Verifying session
ta: அமர்வு சரிபார்க்கிறது

# session_verifying_google
source: Verifying Google session
ta: கூகிள் அமர்வைச் சரிபார்க்கிறது

# spoof_apply
source: Make sure you re-login to apply the spoof
ta: ஸ்பூப்பைப் பயன்படுத்த நீங்கள் மீண்டும் உள்நுழைந்திருப்பதை உறுதிசெய்யவும்

# insecure_anonymous_apply
source: Make sure you re-login and restart app to apply changes.
ta: மாற்றங்களைப் பயன்படுத்த, நீங்கள் மீண்டும் உள்நுழைந்து பயன்பாட்டை மறுதொடக்கம் செய்வதை உறுதிசெய்து கொள்ளவும்.

# tab_categories
source: Categories
ta: வகைகள்

# tab_editor_choice
source: Editor's choice
ta: தொகுப்பானின் விருப்பம்

# tab_for_you
source: For you
ta: உனக்காக

# tab_top_charts
source: Top charts
ta: உச்ச விளக்கப்படங்கள்

# tab_top_free
source: Top free
ta: உச்ச இலவசம்

# tab_top_grossing
source: Top grossing
ta: உச்ச பெருந்திரள்

# tab_top_paid
source: Top paid
ta: உச்ச கட்டண

# tab_trending
source: Trending
ta: நடப்பு

# title_about
source: About
ta: பற்றி

# title_account_manager
source: Accounts
ta: கணக்குகள்

# title_apps
source: Apps
ta: பயன்பாடுகள்

# title_app_settings
source: App settings
ta: பயன்பாட்டு அமைப்புகள்

# title_apps_games
source: My apps & games
ta: எனது பயன்பாடுகள் & விளையாட்டுகள்

# title_apps_library
source: Apps in library
ta: நூலகத்தில் உள்ள பயன்பாடுகள்

# title_blacklist_manager
source: Blacklist manager
ta: கரும்பட்டியல் நிர்வாகி

# title_favourites_manager
source: Favourite apps
ta: பிடித்த பயன்பாடுகள்

# title_device
source: Device
ta: சாதனம்

# title_download_manager
source: Downloads
ta: பதிவிறக்கங்கள்

# title_download_playstore
source: Play Store
ta: ப்ளே ஸ்டோர்

# title_games
source: Games
ta: விளையாட்டுகள்

# title_installation
source: Installation
ta: நிறுவல்

# title_installed
source: Installed
ta: நிறவப்பட்டவை

# title_installer
source: App installer
ta: செயலி நிறுவி

# title_language
source: Language
ta: மொழி

# title_library
source: Library
ta: நூலகம்

# title_no_network
source: No network
ta: பிணையம் இல்லை

# title_purchase_history
source: Purchase history
ta: கொள்முதல் வரலாறு

# title_settings
source: Settings
ta: அமைப்புகள்

# title_spoof_manager
source: Spoof manager
ta: ஏமாற்ற நிர்வாகி

# title_search_suggestion
source: Search suggestion
ta: ஆலோசனையைத் தேடுங்கள்

# title_search_results
source: Search results
ta: தேடல் முடிவுகள்

# title_updates
source: Updates
ta: புதுப்பிப்புகள்

# title_advanced
source: Advanced
ta: மேம்பட்ட

# title_manual_download
source: Manual download
ta: கைமுறையாக பதிவிறக்கம்

# toast_anonymous_restriction
source: Not available on anonymous accounts
ta: அநாமதேய கணக்குகளில் கிடைக்காது

# toast_apk_blacklisted
source: Blacklisted
ta: கரும்பட்டியலிடப்பட்டது

# toast_apk_whitelisted
source: Whitelisted
ta: வெண்பட்டியலிடப்பட்டது

# toast_app_unavailable
source: App not available for your device
ta: உங்கள் சாதனத்திற்கு பயன்பாடு கிடைக்கவில்லை

# toast_clipboard_copied
source: Copied to clipboard
ta: நகலகத்திற்கு நகலெடுக்கப்பட்டது

# toast_developer_setting_failed
source: Turn on developer settings from the device settings to open them.
ta: அவற்றைத் திறக்க, சாதன அமைப்புகளில் இருந்து டெவலப்பர் அமைப்புகளை இயக்கவும்.

# toast_permission_granted
source: Permission granted
ta: அனுமதி வழங்கப்பட்டது

# toast_permission_installer_required
source: You need to grant installer permission first
ta: நீங்கள் முதலில் நிறுவி இசைவு வழங்க வேண்டும்

# toast_spoof_applied
source: Device spoof applied.
ta: சாதன ஸ்பூஃப் பயன்படுத்தப்பட்டது.

# toast_purchase_blocked
source: App purchases not available on anonymous accounts.
ta: பெயரிலி கணக்குகளில் பயன்பாடுகள் வாங்குதல்கள் கிடைக்காது.

# toast_manual_unavailable
source: The version code you are requesting is unavailable.
ta: நீங்கள் கோரும் பதிப்புக் குறியீடு கிடைக்கவில்லை.

# toast_manual_available
source: Congrats, requested version code is available, downloading now.
ta: வாழ்த்துகள், கோரப்பட்ட பதிப்புக் குறியீடு உள்ளது, இப்போது பதிவிறக்குகிறது.

# toast_page_unavailable
source: Browse page unavailable
ta: உலாவல் பக்கம் கிடைக்கவில்லை

# toast_rated_success
source: Rated, it may take a while to show
ta: மதிப்பிடப்பட்டது, காட்ட சிறிது நேரம் ஆகலாம்

# toast_rated_failed
source: Could not submit rating
ta: மதிப்பீட்டைச் சமர்ப்பிக்க முடியவில்லை

# toast_aas_token_failed
source: Could not generate AAS Token
ta: AAS கிள்ளாக்குகளைப் உருவாக்க முடியவில்லை

# toast_export_success
source: Device config exported
ta: சாதன கட்டமைப்பு ஏற்றுமதியானது

# toast_export_failed
source: Could not export device config
ta: சாதன கட்டமைப்பை ஏற்றுமதி செய்ய முடியவில்லை
