Repository: 247i/TACETr
Catalog: உரை/தானி/aurora-store-aurorastore-translations-*.po
Languages: ta

# toast_import_success
source: Device config imported
ta: சாதன கட்டமைப்பு இறக்குமதி செய்யப்பட்டது

# toast_import_failed
source: Could not import device config
ta: சாதன கட்டமைப்பை இறக்குமதி செய்ய முடியவில்லை

# toast_proxy_invalid
source: Invalid proxy URL, check format!
ta: தவறான பதிலாள் முகவரி, வடிவத்தை சரிபார்க்கவும்!

# toast_proxy_success
source: Proxy set successfully
ta: பதிலாள் வெற்றிகரமாக அமைக்கப்படுகிறது

# toast_proxy_failed
source: Failed to set proxy
ta: ப்ராக்சியை அமைப்பதில் தோல்வி

# app_updater_service_notif_title
source: Background app download
ta: பின்னணி பயன்பாடு பதிவிறக்கம்

# app_updater_service_notif_text
source: Enables background app download
ta: பின்னணி பயன்பாடு பதிவிறக்கத்தை இயக்குகிறது

source: update available
ta: புதுப்பிப்பு கிடைக்கிறது

source: updates available
ta: புதுப்பிப்புகள் கிடைக்கின்றன

# error
source: An error occurred!
ta: பிழை ஏற்பட்டது!

source: Menu
ta: பட்டியல்

source: Expand
ta: விரிவாக்கு

# spoof_property
source: <xliff:g id="manufacturer">%1$s</xliff:g> • API <xliff:g id="api">%2$s</xliff:g>
ta: <xliff: g ஐடி = "உற்பத்தியாளர்">%1$s </xliff: g> • பநிஇ <xliff: g ஐடி = "api">%2$s </xliff: g>

# item_required
source: Required
ta: தேவை

# item_optional
source: Optional
ta: விரும்பினால்

# permissions_denied
source: Required permissions were denied. Please grant them in order to continue the action
ta: தேவையான அனுமதிகள் மறுக்கப்பட்டன. நடவடிக்கையைத் தொடர தயவுசெய்து அவற்றை வழங்கவும்

# search_hint
source: Search for apps & games
ta: பயன்பாடுகள் மற்றும் விளையாட்டுகளைத் தேடு

source: Requesting new session
ta: புதிய அமர்வைக் கோருகிறது

# server_maintenance
source: Server down for maintenance
ta: பராமரிப்புக்காக சேவையகம் கீழே

# downloading_dep
source: Downloading additional files for <xliff:g id="app">%1$s</xliff:g>
ta: <Xliff: g ஐடி = "app">%1$s </xliff: g> க்கான கூடுதல் கோப்புகளைப் பதிவிறக்குகிறது

# notification_channel_updates
source: Update notifications
ta: அறிவிப்புகளைப் புதுப்பி

# notification_updates_available
source: <xliff:g id="apps_count">%1$d</xliff:g> updates available
ta: <xliff: g ஐடி = "apps_count">%1$d </xliff: g> புதுப்பிப்புகள் கிடைக்கின்றன

# notification_updates_available_1
source: <xliff:g id="apps_count">%1$d</xliff:g> update available
ta: <xliff: g ஐடி = "apps_count">%1$d </xliff: g> புதுப்பிப்பு கிடைக்கிறது

# notification_updates_available_desc_1
source: A new version of <xliff:g id="app_one_name">%1$s</xliff:g> is available
ta: <Xliff: g ஐடி = "app_one_name">%1$s </xliff: g> இன் புதிய பதிப்பு கிடைக்கிறது

# notification_updates_available_desc_2
source: <xliff:g id="app_one_name">%1$s</xliff:g> and <xliff:g id="app_two_name">%2$s</xliff:g>
ta: <xliff: g ஐடி = "app_one_name">%1$s </xliff: g> மற்றும் <xliff: g ஐடி = "app_two_name">%2$s </xliff: g>

# notification_updates_available_desc_3
source: <xliff:g id="app_one_name">%1$s</xliff:g>, <xliff:g id="app_two_name">%2$s</xliff:g> and <xliff:g id="app_three_name">%3$s</xliff:g>
ta: <xliff:g id="app_one_name">%1$s</xliff:g>, <xliff:g id="app_two_name">%2$s</xliff:g> மற்றும் <xliff:g id="app_three_name">%3$s</xliff:g>

# notification_updates_available_desc_4
source: <xliff:g id="app_one_name">%1$s</xliff:g>, <xliff:g id="app_two_name">%2$s</xliff:g>, <xliff:g id="app_three_name">%3$s</xliff:g> and <xliff:g id="apps_count">%4$d</xliff:g> more
ta: <xliff:g id="app_one_name">%1$s</xliff:g>, <xliff:g id="app_two_name">%2$s</xliff:g>, <xliff:g id="app_three_name">%3$s</xliff:g> and <xliff:g id="apps_count">%4$d</xliff:g> மேலும்

# pref_updates_auto
source: Automatic updates
ta: தானியங்கு புதுப்பிப்புகள்

# pref_updates_auto_desc
source: Configure automatic updates behaviour
ta: தானி புதுப்பிப்புகளின் நடத்தை உள்ளமை

# pref_updates_auto_off
source: Do not auto-update apps
ta: பயன்பாடுகளை தானாக புதுப்பிக்க வேண்டாம்

# pref_updates_auto_notify
source: Check & notify for available updates
ta: கிடைக்கக்கூடிய புதுப்பிப்புகளுக்கு சரிபார்த்து அறிவிக்கவும்

# pref_updates_auto_install
source: Check & install available updates automatically
ta: கிடைக்கக்கூடிய புதுப்பிப்புகளை சரிபார்த்து நிறுவவும்

# pref_updates_check_frequency
source: Automatic updates frequency
ta: தானியங்கி புதுப்பிப்புகள் அதிர்வெண்

# pref_updates_check_frequency_desc
source: Configure time interval for automatic updates, in hour.
ta: தானி மற்றும் தன்வய புதுப்பிப்புகளுக்கான இடைவெளிகளை மணிநேரத்தில் உள்ளமை.

# failed_to_fetch_report
source: Failed to fetch privacy report
ta: தனியுரிமை அறிக்கையைப் பெறுவதில் தோல்வி

# access_denied_using_vpn
source: Access denied! Are you using VPN or Tor?
ta: அணுகல் மறுக்கப்பட்டது! நீங்கள் VPN அல்லது TOR ஐப் பயன்படுத்துகிறீர்களா?

# bad_request
source: Internal error! Please retry after sometime
ta: உள் பிழை! சிறிது நேரம் கழித்து மீண்டும் முயற்சிக்கவும்

# login_rate_limited
source: Oops, You are rate limited
ta: அச்சச்சோ, நீங்கள் விகிதம் வரையறுக்கப்பட்டவர்

source: Server unreachable
ta: சேவையகம் அணுக முடியாதது

# failed_to_generate_session
source: Could not generate session
ta: அமர்வை உருவாக்க முடியவில்லை

source: Verifying new session
ta: புதிய அமர்வை சரிபார்க்கிறது

# failed_generating_session
source: Failed to generate session, error code: <xliff:g id="status_code">%1$d</xliff:g>
ta: அமர்வை உருவாக்குவதில் தோல்வி, பிழைக் குறியீடு: <xliff: g ஐடி = "status_code">%1$d </xliff: g>

# check_connectivity
source: Check internet connectivity
ta: இணைய இணைப்பை சரிபார்க்கவும்

source: App language
ta: பயன்பாட்டு மொழி

# pref_ui_layout
source: Layout
ta: தளவமைப்பு

# pref_ui_layout_tab
source: Select default tab
ta: இயல்புநிலை தாவலைத் தேர்ந்தெடுக்கவும்

# app_links_title
source: App links
ta: பயன்பாட்டு இணைப்புகள்

# app_links_desc
source: Allow Aurora Store to open supported links
ta: உதவி இணைப்புகளைத் திறக்க அரோரா கடையை அனுமதிக்கவும்

# google_play_store_desc
source: Google Play, also known as the Google Play Store and formerly Android Market.
ta: கூகிள் பிளே கடை மற்றும் முன்னர் ஆண்ட்ராய்டு சந்தை என்றும் அழைக்கப்படுகிறது.

# android_market_desc
source: Android Market was an online store offering software applications designed for Android devices, retired in 2017.
ta: ஆண்ட்ராய்டு சந்தை என்பது ஆண்ட்ராய்டு சாதனங்களுக்காக வடிவமைக்கப்பட்ட மென்பொருள் பயன்பாடுகளை வழங்கும் நிகழ்நிலை கடை ஆகும், இது 2017 இல் ஓய்வு பெற்றது.

# failed_apk_export
source: Failed to export APKs
ta: APKS ஐ ஏற்றுமதி செய்யத் தவறிவிட்டது

source: No apps available
ta: பயன்பாடுகள் எதுவும் கிடைக்கவில்லை

# session_installer_subtitle
source: Session based installer for bundled/split APKs
ta: தொகுக்கப்பட்ட/பிளவு APKS க்கான அமர்வு அடிப்படையிலான நிறுவி

# session_installer_desc
source: Recommended, in-built and supports all Android versions
ta: பரிந்துரைக்கப்படுகிறது, உள்ளமைக்கப்பட்ட மற்றும் அனைத்து ஆண்ட்ராய்டு பதிப்புகளையும் ஆதரிக்கிறது

# root_installer_subtitle
source: Shell based installer using root permissions
ta: ரூட் அனுமதிகளைப் பயன்படுத்தி செல் அடிப்படையிலான நிறுவி

# root_installer_desc
source: Requires root/superuser privileges, supports all Android versions.
ta: ரூட்/சூப்பர் யூசர் சலுகைகள் தேவை, அனைத்து ஆண்ட்ராய்டு பதிப்புகளையும் ஆதரிக்கிறது.

# native_installer_subtitle
source: Intent based installer, available on all devices
ta: நோக்கம் அடிப்படையிலான நிறுவி, எல்லா சாதனங்களிலும் கிடைக்கிறது

# native_installer_desc
source: Best suited for devices running below Android 4.4
ta: ஆண்ட்ராய்டு 4.4 க்கு கீழே இயங்கும் சாதனங்களுக்கு மிகவும் பொருத்தமானது

# services_installer_subtitle
source: Installer for background installations
ta: பின்னணி நிறுவல்களுக்கான நிறுவி

# services_installer_desc
source: Requires Aurora Services to be installed as a privileged-system app
ta: அரோரா சேவைகள் ஒரு சலுகை பெற்ற-அமைப்பு பயன்பாடாக நிறுவப்பட வேண்டும்

# am_installer_subtitle
source: Full-featured open source package manager
ta: முழு அம்சமான திறந்த மூல தொகுப்பு மேலாளர்

# am_installer_desc
source: Requires App Manager, need adb/root mode to install when miui optimization is on
ta: பயன்பாட்டு மேலாளர் தேவை, MIUI தேர்வுமுறை இயக்கத்தில் இருக்கும்போது நிறுவ ADB/ROOT பயன்முறை தேவை

# shizuku_installer_subtitle
source: Using system APIs directly with adb/root privileges
ta: கணினி பநிஇ களை நேரடியாக ADB/ROOT சலுகைகளுடன் பயன்படுத்துதல்

# shizuku_installer_desc
source: Requires Shizuku or Sui, needs to be setup and permission granted
ta: சிசுகு அல்லது சூய் தேவை, அமைவு மற்றும் இசைவு வழங்கப்பட வேண்டும்

# manual_download_hint
source: Enter version code you wish to download
ta: நீங்கள் பதிவிறக்க விரும்பும் பதிப்பு குறியீட்டை உள்ளிடவும்

# faqs_title
source: FAQs
ta: கேள்விகள்

# faqs_subtitle
source: Have questions? Find out the answers
ta: கேள்விகள் உள்ளதா? பதில்களைக் கண்டறியவும்

# source_code_title
source: Source code
ta: மூலக் குறியீடு

# source_code_subtitle
source: Find out what's inside
ta: உள்ளே என்ன இருக்கிறது என்பதைக் கண்டறியவும்

# license_subtitle
source: The GNU General Public License v3.0
ta: குனு பொது பொது உரிமம் v3.0

# privacy_policy_title
source: Privacy policy
ta: தனியுரிமைக் கொள்கை

# privacy_policy_subtitle
source: Learn how Aurora Store uses your data
ta: அரோரா கடை உங்கள் தரவை எவ்வாறு பயன்படுத்துகிறது என்பதை அறிக

# disclaimer_subtitle
source: Accountability and responsibility
ta: பொறுப்புக்கூறல் மற்றும் பொறுப்பு

# made_with_love
source: Made with <xliff:g id="heart_emoji">%1$s</xliff:g> in India
ta: <Xliff உடன் தயாரிக்கப்பட்டது: g ஐடி = "heart_emoji">%1$s </xliff: g> இந்தியாவில்

# version
source: v<xliff:g id="version_name">%1$s</xliff:g> (<xliff:g id="version_code">%2$d</xliff:g>)
ta: v <xliff: g அடையாளம் = "version_name">%1$s </xliff: g> (<xliff: g அடையாளம் = "version_code">%2$d </xliff: g>)

# about_aurora_store_title
source: About Aurora Store
ta: அரோரா கடை பற்றி

# about_aurora_store_subtitle
source: Learn more about Aurora Store
ta: அரோரா கடை பற்றி மேலும் அறிக

# about_aurora_store_summary
source: Aurora Store enables you to search and download apps from the official Google Play Store. You can check app descriptions, screenshots, updates, other users' comments, and download the APK directly from Google Play to your device. To use Aurora Store, you need to have a Google Play account, and log in to your Google Play account when you first open and configure Aurora Store. Unlike a traditional app store, Aurora Store does not own, license or distribute any apps. All the apps, app descriptions, screenshots and other content in Aurora Store are directly accessed, downloaded and/or displayed from Google Play. Aurora Store works exactly like a door or a browser, allowing you to log in to your Google Play account and find the apps from Google Play. Please note that Aurora Store does not have any approval, sponsorship or authorization from Google, Google Play, any apps downloaded through Aurora Store or any app developers; neither does Aurora Store have any affiliation, cooperation or connection with them.
ta: அதிகாரப்பூர்வ கூகிள் பிளே ச்டோரிலிருந்து பயன்பாடுகளைத் தேடவும் பதிவிறக்கவும் அரோரா கடை உங்களுக்கு உதவுகிறது. பயன்பாட்டு விளக்கங்கள், திரை சாட்கள், புதுப்பிப்புகள், பிற பயனர்களின் கருத்துகளை நீங்கள் சரிபார்க்கலாம் மற்றும் Google Play இலிருந்து உங்கள் சாதனத்திற்கு நேரடியாக APK ஐ பதிவிறக்கம் செய்யலாம். அரோரா ச்டோரைப் பயன்படுத்த, நீங்கள் ஒரு Google Play கணக்கை வைத்திருக்க வேண்டும், மேலும் நீங்கள் முதலில் அரோரா கடையைத் திறந்து உள்ளமைக்கும்போது உங்கள் Google Play கணக்கில் உள்நுழைக. பாரம்பரிய ஆப் ச்டோரைப் போலன்றி, அரோரா கடை எந்த பயன்பாடுகளையும் சொந்தமாகவோ, உரிமம் பெறவோ அல்லது விநியோகிக்கவோ இல்லை. அரோரா கடையில் உள்ள அனைத்து பயன்பாடுகள், பயன்பாட்டு விளக்கங்கள், திரை சாட்கள் மற்றும் பிற உள்ளடக்கங்கள் நேரடியாக அணுகப்படுகின்றன, பதிவிறக்கம் செய்யப்படுகின்றன மற்றும்/அல்லது கூகிள் பிளேயில் இருந்து காட்டப்படுகின்றன. அரோரா கடை ஒரு கதவு அல்லது உலாவி போன்றது, உங்கள் Google Play கணக்கில் உள்நுழைந்து Google Play இலிருந்து பயன்பாடுகளைக் கண்டறிய உங்களை அனுமதிக்கிறது. அரோரா ச்டோருக்கு கூகிள், கூகிள் பிளே, அரோரா கடை அல்லது எந்த பயன்பாட்டு உருவாக்குபவர்கள் மூலம் பதிவிறக்கம் செய்யப்பட்ட எந்த பயன்பாடுகளும் ஒப்புதல், ச்பான்சர்சிப் அல்லது ஏற்பு இல்லை என்பதை நினைவில் கொள்க; அரோரா கடைக்கு அவர்களுடன் எந்த தொடர்பும், ஒத்துழைப்பும் அல்லது தொடர்பும் இல்லை.

# title_more
source: More
ta: மேலும்

# manage_account
source: Manage your account
ta: உங்கள் கணக்கை நிர்வகிக்கவும்

# account_anonymous_email
source: anonymous@gmail.com
ta: Anomaly@gmail.com

# pref_clear_device_owner_title
source: Clear device owner
ta: சாதன உரிமையாளரை அழிக்கவும்

# pref_clear_device_owner_summary
source: Removes Aurora Store as the device owner app
ta: சாதன உரிமையாளர் பயன்பாடாக அரோரா கடையை நீக்குகிறது

# pref_clear_device_owner_desc
source: This will revoke session installer's permission to silently install app. Proceed with clearing device ownership?
ta: பயன்பாட்டை அமைதியாக நிறுவ அமர்வு நிறுவியின் அனுமதியை இது ரத்து செய்யும். சாதன உரிமையை அழிக்க வேண்டுமா?

# pref_dispenser_title
source: Manage dispensers
ta: விநியோகிப்பாளர்களை நிர்வகிக்கவும்

# pref_dispenser_summary
source: View and manage token dispensers for anonymous logins
ta: அநாமதேய உள்நுழைவுகளுக்கு கிள்ளாக்கு விநியோகிப்பாளர்களைக் காணவும் நிர்வகிக்கவும்

source: No dispensers available
ta: விநியோகிப்பாளர்கள் எதுவும் கிடைக்கவில்லை

# add_dispenser_title
source: Add dispenser
ta: டிச்பென்சரைச் சேர்க்கவும்

# add_dispenser_summary
source: Add a token dispenser to Aurora Store. Token dispensers provide account credentials to Aurora Store for logging in anonymously.
ta: அரோரா கடையில் ஒரு கிள்ளாக்கு டிச்பென்சரைச் சேர்க்கவும். கிள்ளாக்கு டிச்பென்சர்கள் அநாமதேயமாக உள்நுழைவதற்காக அரோரா கடைக்கு கணக்கு நற்சான்றிதழ்களை வழங்குகிறார்கள்.

# add_dispenser_error
source: Invalid URL
ta: தவறான முகவரி

# add_dispenser_hint
source: Dispenser URL
ta: டிச்பென்சர் முகவரி

# remove_dispenser_title
source: Remove dispenser
ta: டிச்பென்சரை அகற்று

# remove_dispenser_summary
source: Do you wish to remove the dispenser "<xliff:g id="url">%1$s</xliff:g>"?
ta: டிச்பென்சரை அகற்ற விரும்புகிறீர்களா "<xliff: g ஐடி =" முகவரி ">%1$s </xliff: g>"?

source: Add
ta: கூட்டு

source: Remove
ta: அகற்று

# toast_fav_import_failed
source: Failed to import favourites!
ta: பிடித்தவைகளை இறக்குமதி செய்யத் தவறிவிட்டது!

# toast_fav_export_failed
source: Failed to export favourites!
ta: பிடித்தவைகளை ஏற்றுமதி செய்வதில் தோல்வி!

# toast_fav_import_success
source: Favourites imported!
ta: பிடித்தவை இறக்குமதி!

# toast_fav_export_success
source: Favourites exported!
ta: பிடித்தவை ஏற்றுமதி!

# toast_black_import_failed
source: Failed to import blacklist!
ta: தடுப்புப்பட்டியலை இறக்குமதி செய்வதில் தோல்வி!

# toast_black_export_failed
source: Failed to export blacklist!
ta: தடுப்புப்பட்டியலை ஏற்றுமதி செய்வதில் தோல்வி!

# toast_black_import_success
source: Blacklist imported!
ta: பிளாக்லிச்ட் இறக்குமதி செய்யப்பட்டது!

# toast_black_export_success
source: Blacklist exported!
ta: பிளாக்லிச்ட் ஏற்றுமதி!

# export_app_title
source: File exporter
ta: கோப்பு ஏற்றுமதியாளர்

# export_app_summary
source: Hold on, exporting your file
ta: உங்கள் கோப்பை ஏற்றுமதி செய்யுங்கள்

# export_app_summary_success
source: Successfully exported app bundle
ta: பயன்பாட்டு மூட்டை வெற்றிகரமாக ஏற்றுமதி செய்தது

# export_app_summary_fail
source: Failed to exported app bundle
ta: பயன்பாட்டு மூட்டை ஏற்றுமதி செய்வதில் தோல்வி

# action_logout_confirmation_title
source: Log out?
ta: வெளியேறு?

# action_logout_confirmation_message
source: Are you sure you want to log out?
ta: நீங்கள் நிச்சயமாக வெளியேற விரும்புகிறீர்களா?

# check_updates
source: Check for updates
ta: புதுப்பிப்புகளை சரிபார்க்கவும்

# checking_updates
source: Checking for updates
ta: புதுப்பிப்புகளைச் சரிபார்க்கிறது

# force_restart_title
source: Restart Aurora Store
ta: அரோரா கடையை மறுதொடக்கம் செய்யுங்கள்

# force_restart_summary
source: Aurora Store needs to be restarted to apply the newly changed settings
ta: புதிதாக மாற்றப்பட்ட அமைப்புகளைப் பயன்படுத்த அரோரா கடையை மறுதொடக்கம் செய்ய வேண்டும்

# status_downloading
source: Downloading
ta: பதிவிறக்குகிறது

# status_failed
source: Failed
ta: தோல்வியுற்றது

# status_cancelled
source: Cancelled
ta: ரத்து செய்யப்பட்டது

# status_completed
source: Completed
ta: முடிந்தது

# status_queued
source: Queued
ta: வரிசையில்

# status_unavailable
source: Unavailable
ta: கிடைக்கவில்லை

# status_verifying
source: Verifying
ta: சரிபார்க்கும்

# authentication_required_title
source: Authentication required
ta: ஏற்பு தேவை

# authentication_required_unarchive
source: Please log in to your Google Play account to unarchive the app!
ta: பயன்பாட்டைக் குறைக்க உங்கள் Google Play கணக்கில் உள்நுழைக!

# default_spoof
source: Default
ta: இயல்புநிலை

# available_spoof
source: Available
ta: கிடைக்கிறது

# action_unarchive
source: Unarchive
ta: அன்கான்

# unable_to_open
source: Unable to open app
ta: பயன்பாட்டைத் திறக்க முடியவில்லை

# version_update
source: <xliff:g id="installed_version_name">%1$s</xliff:g> (<xliff:g id="installed_version_code">%2$d</xliff:g>) ➔ <xliff:g id="update_version_name">%3$s</xliff:g> (<xliff:g id="update_version_code">%4$d</xliff:g>)
ta: <xliff: g அடையாளம் = "install_version_name">%1$s </xliff: g> (<xliff: g அடையாளம் = "நிறுவப்பட்ட_ பவர்சன்_கோட்">%2$d </xliff: g>) ➔ <xliff: g அடையாளம் = "Update_version_name" அடையாளம் = "Update_version_code">%4 $ டி </xliff: g>)

# plexus_powered
source: Powered by Plexus
ta: பிளெக்சசால் இயக்கப்படுகிறது

# plexus_progress
source: Checking compatibility…
ta: பொருந்தக்கூடிய தன்மையைச் சரிபார்க்கிறது…

# details_compatibility_title
source: Compatibility
ta: பொருந்தக்கூடிய தன்மை

# details_compatibility_gms_required_title
source: Requires Google Play Services
ta: Google Play சேவைகள் தேவை

# details_compatibility_gms_required_subtitle
source: You may need to install Google’s proprietary library or a FOSS reimplementation such as microG.
ta: நீங்கள் Google இன் தனியுரிம நூலகம் அல்லது மைக்ரோக் போன்ற FOSS மறுசீரமைப்பை நிறுவ வேண்டியிருக்கலாம்.

# details_compatibility_gms_not_required_title
source: Works without Google Play Services
ta: கூகிள் பிளே சேவைகள் இல்லாமல் வேலை செய்கிறது

# details_compatibility_gms_not_required_subtitle
source: This app works without Google’s proprietary library. However, it may still require other third-party libraries to work properly.
ta: இந்த பயன்பாடு கூகிளின் தனியுரிம நூலகம் இல்லாமல் செயல்படுகிறது. இருப்பினும், மற்ற மூன்றாம் தரப்பு நூலகங்கள் சரியாக வேலை செய்ய வேண்டும்.

# details_compatibility_microg
source: With microG Project
ta: மைக்ரோக் திட்டத்துடன்

# details_compatibility_no_gms
source: Without Google Play Services
ta: கூகிள் பிளே சேவைகள் இல்லாமல்

# details_compatibility_status_compatible
source: Compatible: Works without any issues
ta: இணக்கமானது: எந்த சிக்கலும் இல்லாமல் செயல்படுகிறது

# details_compatibility_status_limited
source: Limited: Works with limited features
ta: லிமிடெட்: வரையறுக்கப்பட்ட அம்சங்களுடன் செயல்படுகிறது

# details_compatibility_status_unsupported
source: Unsupported: Not functional
ta: ஆதரிக்கப்படாதது: செயல்படவில்லை

# details_compatibility_status_unknown
source: Unknown: Not checked yet
ta: தெரியவில்லை: இன்னும் சரிபார்க்கப்படவில்லை

# installed_apps_size
source: <xliff:g id="installed_apps_size">%1$d</xliff:g> apps installed
ta: <xliff: g அடையாளம் = "install_apps_size">%1$d </xliff: g> பயன்பாடுகள் நிறுவப்பட்டுள்ளன

# pref_network_microg_login_title
source: Use microG to sign-in to accounts
ta: கணக்குகளில் உள்நுழைய மைக்ரோகைப் பயன்படுத்தவும்

# pref_network_microg_login_desc
source: Authenticate using microG when signing into Google accounts for a simpler sign-in flow.
ta: எளிமையான உள்நுழைவு ஓட்டத்திற்கு Google கணக்குகளில் கையொப்பமிடும்போது மைக்ரோகைப் பயன்படுத்தி அங்கீகரிக்கவும்.

source: Set
ta: கணம்

source: Disable
ta: முடக்கு

# toast_proxy_disabled
source: Proxy disabled successfully
ta: பதிலாள் வெற்றிகரமாக முடக்கப்பட்டது

# pref_network_proxy_desc
source: View and manage proxy configuration
ta: பதிலாள் உள்ளமைவைக் காணவும் நிர்வகிக்கவும்

# pref_network_proxy_url_hint
source: protocol://user:password@host:port
ta: நெறிமுறை: // பயனர்: கடவுச்சொல்@ஓச்ட்: துறைமுகம்

# pref_updates_restrictions_title
source: Automatic updates restrictions
ta: தானியங்கி புதுப்பிப்புகள் கட்டுப்பாடுகள்

# pref_updates_restrictions_desc
source: Configure device restrictions for automated updates.
ta: தானியங்கு புதுப்பிப்புகளுக்கான சாதன கட்டுப்பாடுகளை உள்ளமைக்கவும்.

# pref_updates_restrictions_metered
source: Only on unmetered networks
ta: அளவிடப்படாத நெட்வொர்க்குகளில் மட்டுமே

# pref_updates_restrictions_idle
source: When device is idle
ta: சாதனம் சும்மா இருக்கும்போது

# pref_updates_restrictions_battery
source: When battery is not low
ta: பேட்டரி குறைவாக இல்லாதபோது

# verification_failed
source: Failed to verify downloaded files
ta: பதிவிறக்கம் செய்யப்பட்ட கோப்புகளை சரிபார்க்கத் தவறிவிட்டது
