Repository: 247i/TACETr
Catalog: உரை/தானி/avnc-metadata-*.po
Languages: ta

# short_description.txt:1
source: Fast & Secure VNC client for Android
ta: ஆண்ட்ராய்டு க்கான வேகமான மற்றும் பாதுகாப்பான வி.என்.சி வாங்கி

# full_description.txt:1
source: AVNC is an open source VNC client for Android. It allows you to remotely control any device running a VNC server. Features: - Material Design (with Dark theme) - Configurable gestures - Tight encoding - Virtual Keys - Picture-in-Picture mode - View-only mode - Zeroconf Server Discovery - TLS support (AnonTLS, VeNCrypt) - SSH tunnel (VNC over SSH) - Import/Export servers - VNC Repeater support - Clipboard Sync with server
ta: AVNC என்பது ஆண்ட்ராய்டு க்கான திறந்த மூல VNC கிளையன்ட் ஆகும். வி.என்.சி சேவையகத்தை இயக்கும் எந்த சாதனத்தையும் தொலைதூரத்தில் கட்டுப்படுத்த இது உங்களை அனுமதிக்கிறது. அம்சங்கள்: - பொருள் வடிவமைப்பு (இருண்ட கருப்பொருளுடன்) - உள்ளமைக்கக்கூடிய சைகைகள் - இறுக்கமான குறியாக்கம் - மெய்நிகர் விசைகள் -படம்-பட முறை - பார்வை மட்டும் பயன்முறை - சீரோகான்ஃப் சேவையக கண்டுபிடிப்பு - டி.எல்.எச் உதவி (அனோன்ட்எல்எச், வென்ரிப்ட்) - பாஓடு சுரங்கப்பாதை (SSH க்கு மேல் VNC) - இறக்குமதி/ஏற்றுமதி சேவையகங்கள் - வி.என்.சி ரிப்பீட்டர் உதவி - சேவையகத்துடன் கிளிப்போர்டு ஒத்திசைவு

# changelogs/10.txt:1
source: * Added client-side cursor rendering for improved responsiveness * Viewer will now follow the pointer when Direct Mode is disabled * Intercept Back key triggered by mouse/touchpad (by Tuan Pham) * New preference for swipe sensitivity * New language: Turkish (by Fabriel & Oğuz Ersen) Polish (by WaldiS) Chinese (Simplified) (by wang) * Note: 'Hide remote pointer' option has moved to Settings
ta: * மேம்பட்ட மறுமொழிக்கு கிளையன்ட் பக்க கர்சர் வழங்குதல் சேர்க்கப்பட்டது * நேரடி பயன்முறை முடக்கப்படும் போது பார்வையாளர் இப்போது சுட்டிக்காட்டி பின்பற்றுவார் * மவுச்/டச்பேட் (துவான் பாம் மூலம்) தூண்டப்பட்ட இடைமறிப்பு பின் விசை) * ச்வைப் உணர்திறனுக்கான புதிய விருப்பம் * புதிய மொழி: துருக்கிய (ஃபேப்ரியல் & ஓசுச் எர்சன் எழுதியது) போலிச் (வால்டிச் எழுதியது) சீன (எளிமைப்படுத்தப்பட்ட) (வாங் எழுதியது) * குறிப்பு: 'ரிமோட் பாயிண்டரை மறை' விருப்பம் அமைப்புகளுக்கு நகர்ந்தது

# changelogs/11.txt:1
source: Fix click position of Mouse Back actions
ta: சுட்டி பின் செயல்களின் சொடுக்கு நிலையை சரிசெய்யவும்

# changelogs/12.txt:1
source: * New preference for natural scrolling * New preference for screen orientation * Pointer is now centered on screen when Direct Touch is off * New language: German (by Pure Incompetence)
ta: * இயற்கை ச்க்ரோலிங்கிற்கான புதிய விருப்பம் * திரை நோக்குநிலைக்கு புதிய விருப்பம் * நேரடித் தொடுதல் முடக்கப்படும் போது சுட்டிக்காட்டி இப்போது திரையில் மையமாக உள்ளது * புதிய மொழி: செர்மன் (தூய திறமையின்மையால்)

# changelogs/13.txt:1
source: * Fixed black screen issue on some Tegra GPUs * Excluded viewer's toolbar area from system back gesture * New language: Russian
ta: * சில டெக்ரா சி.பீ.யுகளில் நிலையான கருப்பு திரை சிக்கல் * கணினி பின் சைகையிலிருந்து பார்வையாளரின் கருவிப்பட்டி பகுதியை விலக்கியது * புதிய மொழி: ரச்ய

# changelogs/14.txt:1
source: * Small improvement in connection startup speed * Fixed a crash on first ever connection when toolbar was aligned to end * Fixed a crash when entering picture-in-picture for servers with large aspect ratio
ta: * இணைப்பு தொடக்க வேகத்தில் சிறிய முன்னேற்றம் * கருவிப்பட்டி முடிவுக்கு சீரமைக்கப்பட்டபோது முதல் இணைப்பில் விபத்து சரி செய்யப்பட்டது * பெரிய விகித விகிதத்துடன் கூடிய சேவையகங்களுக்கான படம்-இன்-படத்தில் நுழையும்போது விபத்து சரி செய்யப்பட்டது

# changelogs/15.txt:1
source: * Per-orientation zoom * Configurable default zoom * Per-server gesture styles * Lock saved servers * Image quality controls * Repeatable virtual keys * Improved two-finger-swipe vs pinch detection * New language: Korean, by Hoseok Seo
ta: * நோ-நோக்குநிலை பெரிதாக்கு * உள்ளமைக்கக்கூடிய இயல்புநிலை பெரிதாக்கு * சேவையக சைகை பாணிகள் * பூட்டு சேமித்த சேவையகங்கள் * பட தர கட்டுப்பாடுகள் * மீண்டும் மீண்டும் செய்யக்கூடிய மெய்நிகர் விசைகள் * மேம்படுத்தப்பட்ட இரண்டு விரல்-ச்வைப் vs பிஞ்ச் கண்டறிதல் * புதிய மொழி: கொரிய, ஓசோக் எச்சிஓ எழுதியது

# changelogs/16.txt:1
source: * Improve support for multi-homed SSH hosts * Fixed incorrect gesture detection on some devices * Fixed possible crash during 2-finger swipe
ta: * மல்டி-ஓம் எச்.எச்.எச் ஓச்ட்களுக்கான ஆதரவை மேம்படுத்தவும் * சில சாதனங்களில் நிலையான தவறான சைகை கண்டறிதல் * 2 விரல் ச்வைப்பின் போது நிலையான விபத்து

# changelogs/17.txt:1
source: * Show navigation-bar with keyboard on Android 11 * Fix server export
ta: * ஆண்ட்ராய்டு 11 இல் விசைப்பலகை மூலம் வழிசெலுத்தல்-பட்டியைக் காட்டு * சேவையக ஏற்றுமதியை சரிசெய்யவும்

# changelogs/18.txt:1
source: * Fixed unexpected Left-click generated on long press * Fixed screen remaining ON while disconnected on some devices
ta: * நீண்ட பத்திரிகையில் உருவாக்கப்பட்ட எதிர்பாராத இடது சொடுக்கு நிலையான * சில சாதனங்களில் துண்டிக்கப்படும்போது நிலையான திரை மீதமுள்ளது

# changelogs/19.txt:1
source: * Fixed a possible crash while swiping on 'Disconnected' screen
ta: * 'துண்டிக்கப்பட்ட' திரையில் ச்வைப் செய்யும் போது விபத்து சரி செய்யப்பட்டது

# changelogs/2.txt:1
source: * Harden SSH Tunnel * Fix port-forwarder leak * Update app metadata
ta: * பாஓடு சுரங்கப்பாதை * போர்ட்-ஃபார்வர்டர் கசிவை சரிசெய்யவும் * பயன்பாட்டு மெட்டாடேட்டாவைப் புதுப்பிக்கவும்

# changelogs/20.txt:1
source: * New 'Double tap and swipe' gesture * AVNC can now automatically try to reconnect after an error * Screen orientation can now be changed for individual servers * Added support for 'ConnectionName' parameter in 'vnc://' URIs. * Fixed clipboard sharing in multi-window mode * Changed 'Super' virtual key to a toggle
ta: * புதிய 'இரட்டை தட்டு மற்றும் ச்வைப்' சைகை * ஏ.வி.என்.சி இப்போது தானாகவே ஒரு பிழையின் பின்னர் மீண்டும் இணைக்க முயற்சி செய்யலாம் * தனிப்பட்ட சேவையகங்களுக்கு இப்போது திரை நோக்குநிலை மாற்றப்படலாம் * 'VNC: //' URIS இல் 'ConnectionName' அளவுருவுக்கு உதவி சேர்க்கப்பட்டது. * மல்டி-விண்டோ பயன்முறையில் நிலையான கிளிப்போர்டு பகிர்வு * ஒரு மாற்றத்திற்கு 'சூப்பர்' மெய்நிகர் விசையை மாற்றியது

# changelogs/21.txt:1
source: * New 'Double tap and swipe' gesture * AVNC can now automatically try to reconnect after an error * Screen orientation can now be changed for individual servers * Added support for 'ConnectionName' parameter in 'vnc://' URIs. * Fixed clipboard sharing in multi-window mode * Changed 'Super' virtual key to a toggle
ta: * புதிய 'இரட்டை தட்டு மற்றும் ச்வைப்' சைகை * ஏ.வி.என்.சி இப்போது தானாகவே ஒரு பிழையின் பின்னர் மீண்டும் இணைக்க முயற்சி செய்யலாம் * தனிப்பட்ட சேவையகங்களுக்கு இப்போது திரை நோக்குநிலை மாற்றப்படலாம் * 'VNC: //' URIS இல் 'ConnectionName' அளவுருவுக்கு உதவி சேர்க்கப்பட்டது. * மல்டி-விண்டோ பயன்முறையில் நிலையான கிளிப்போர்டு பகிர்வு * ஒரு மாற்றத்திற்கு 'சூப்பர்' மெய்நிகர் விசையை மாற்றியது

# changelogs/22.txt:1
source: * Stop the frame from moving off screen at 100% zoom * New language: Chinese (Traditional) by babaric dev
ta: * 100% சூமில் திரையில் இருந்து நகர்த்துவதை சட்டத்தை நிறுத்துங்கள் * புதிய மொழி: பாபரிக் தேவ் எழுதிய சீன (பாரம்பரிய)

# changelogs/23.txt:1
source: * Added support for Unicode clipboard sharing (requires server support) * Added support for raw key events (requires server support) * Allowed 'Remote drag' action for One-finger swipe gesture * You can now dynamically change gesture style when connected to a server (enabled by "Settings => Viewer => Show gesture style toggle") * Fixed invisible virtual keys when fullscreen was disabled * Fixed possible crash when delayed-click was enabled
ta: * யூனிகோட் கிளிப்போர்டு பகிர்வுக்கான உதவி சேர்க்கப்பட்டது (சேவையக உதவி தேவை) * மூல முக்கிய நிகழ்வுகளுக்கான உதவி சேர்க்கப்பட்டது (சேவையக உதவி தேவை) * ஒரு விரல் ச்வைப் சைகைக்கு 'ரிமோட் டிராக்' நடவடிக்கை அனுமதிக்கப்பட்டுள்ளது * சேவையகத்துடன் இணைக்கப்படும்போது நீங்கள் இப்போது சைகை பாணியை மாறும் வகையில் மாற்றலாம் ("அமைப்புகள் => பார்வையாளர் => சைகை பாணியைக் காண்பி மாற்று" மூலம் இயக்கப்பட்டது) * முழுத்திரை முடக்கப்பட்டபோது நிலையான கண்ணுக்கு தெரியாத மெய்நிகர் விசைகள் * தாமதமான சொடுக்கு இயக்கப்பட்டபோது நிலையான விபத்து

# changelogs/24.txt:1
source: * Reset Zoom button will now change zoom to saved default (You can Long-press on the Reset button to set 100% zoom) * Fixed copy/paste with some TigerVNC servers * Fixed random black screens when connecting to TigerVNC * Fixed possible crash when importing invalid private key * New language: Portuguese (by ssantos)
ta: * சூம் பொத்தானை மீட்டமை இப்போது சூம் சேமித்த இயல்புநிலையாக மாற்றும் (100% பெரிதாக்கத்தை அமைக்க மீட்டமை பொத்தானை நீங்கள் நீண்ட அழுத்தலாம்) * சில TIGERVNC சேவையகங்களுடன் நிலையான நகல்/ஒட்டுதல் * TIGERVNC உடன் இணைக்கும்போது நிலையான சீரற்ற கருப்பு திரைகள் * தவறான தனியார் விசையை இறக்குமதி செய்யும் போது நிலையான விபத்து * புதிய மொழி: போர்த்துகீசியம் (SSANTOS எழுதியது)

# changelogs/25.txt:1
source: * Added a server option to automatically resize remote session to local window * Make SSH passwords optional when creating profile * Fixed Option key on macOS * Fixed crash caused by invalid VNC URIs
ta: * தொலைநிலை அமர்வை தானாகவே உள்ளக சாளரத்திற்கு மறுஅளவாக்குவதற்கு சேவையக விருப்பத்தைச் சேர்த்தது * சுயவிவரத்தை உருவாக்கும்போது பாஓடு கடவுச்சொற்களை விருப்பமாக ஆக்குங்கள் * MACOS இல் நிலையான விருப்ப விசை * தவறான VNC யூரி களால் ஏற்படும் நிலையான விபத்து

# changelogs/26.txt:1
source: * Added gesture action to drag with middle button * Fixed entries for 'Long press and swipe' setting
ta: * நடுத்தர பொத்தானைக் கொண்டு இழுக்க சைகை நடவடிக்கை சேர்க்கப்பட்டது * 'லாங் பிரச் அண்ட் ச்வைப்' அமைப்பிற்கான நிலையான உள்ளீடுகள்

# changelogs/27.txt:1
source: * Added a toggle to lock/unlock zoom * Added an option to control screen wakelock * You can now search through saved servers via the top address-bar * New monochrome icon by Biswapriyo Nath * Improved splash theme and app startup time. * Fixed users not able to type C-Cedilla * Fixed toolbar not closing in certain cases
ta: * பெரிதாக்க/திறக்க ஒரு மாற்று சேர்க்கை சேர்த்தது * திரை வக்லாக் கட்டுப்படுத்த ஒரு விருப்பத்தைச் சேர்த்தது * நீங்கள் இப்போது சேமித்த சேவையகங்கள் மூலம் மேல் முகவரி-பட்டி வழியாக தேடலாம் * பிச்வாப்ரியோ நாத் எழுதிய புதிய மோனோக்ரோம் படவுரு * மேம்படுத்தப்பட்ட ச்பிளாச் கருப்பொருள் மற்றும் பயன்பாட்டு தொடக்க நேரம். * நிலையான பயனர்கள் சி-சிடில்லாவை தட்டச்சு செய்ய முடியவில்லை * நிலையான கருவிப்பட்டி சில சந்தர்ப்பங்களில் மூடப்படவில்லை

# changelogs/28.txt:1
source: * Added a toggle to lock/unlock zoom * Added an option to control screen wakelock * You can now search through saved servers via the top address-bar * New monochrome icon by Biswapriyo Nath * Improved splash theme and app startup time. * Fixed users not able to type C-Cedilla * Fixed toolbar not closing in certain cases
ta: * பெரிதாக்க/திறக்க ஒரு மாற்று சேர்க்கை சேர்த்தது * திரை வக்லாக் கட்டுப்படுத்த ஒரு விருப்பத்தைச் சேர்த்தது * நீங்கள் இப்போது சேமித்த சேவையகங்கள் மூலம் மேல் முகவரி-பட்டி வழியாக தேடலாம் * பிச்வாப்ரியோ நாத் எழுதிய புதிய மோனோக்ரோம் படவுரு * மேம்படுத்தப்பட்ட ச்பிளாச் கருப்பொருள் மற்றும் பயன்பாட்டு தொடக்க நேரம். * நிலையான பயனர்கள் சி-சிடில்லாவை தட்டச்சு செய்ய முடியவில்லை * நிலையான கருவிப்பட்டி சில சந்தர்ப்பங்களில் மூடப்படவில்லை

# changelogs/29.txt:1
source: * Added option to control toolbar opening with swipe-in gesture * Restored Repeater support * Cache unlocked SSH keys in memory * Fixed occasional flickering in viewer * Reconnect automatically if disconnected in background * Improved clipboard sync handling, fixing few ANRs * Improved reliability of server discovery
ta: * ச்வைப்-இன் சைகையுடன் கருவிப்பட்டி திறப்பைக் கட்டுப்படுத்த விருப்பம் சேர்க்கப்பட்டது * மீட்டெடுக்கப்பட்ட ரிப்பீட்டர் உதவி * நினைவகத்தில் கேச் திறக்கப்படாத பாஓடு விசைகள் * பார்வையாளரில் அவ்வப்போது ஒளிரும் * பின்னணியில் துண்டிக்கப்பட்டால் தானாகவே மீண்டும் இணைக்கவும் * மேம்படுத்தப்பட்ட கிளிப்போர்டு ஒத்திசைவு கையாளுதல், சில ANR களை சரிசெய்கிறது * சேவையக கண்டுபிடிப்பின் மேம்பட்ட நம்பகத்தன்மை

# changelogs/3.txt:1
source: * Improve app startup time * Added a preference to sort Servers
ta: * பயன்பாட்டு தொடக்க நேரத்தை மேம்படுத்தவும் * சேவையகங்களை வரிசைப்படுத்த ஒரு விருப்பத்தை சேர்த்தது

# changelogs/30.txt:1
source: * Snap zoom to 100% * Fix possible crash when using SSH tunnel
ta: * 100% வரை பெரிதாக்கவும் * பாஓடு சுரங்கப்பாதையைப் பயன்படுத்தும் போது சாத்தியமான செயலிழப்பை சரிசெய்யவும்

# changelogs/31.txt:1
source: * Added option to auto-connect to a server on app start * Added Viewer help for new users * Fixed a possible crash in Login dialog
ta: * பயன்பாட்டு தொடக்கத்தில் ஒரு சேவையகத்துடன் தானாக இணைக்க விருப்பம் சேர்க்கப்பட்டது * புதிய பயனர்களுக்கு பார்வையாளர் உதவி சேர்க்கப்பட்டது * உள்நுழைவு உரையாடலில் விபத்து சரி செய்யப்பட்டது

# changelogs/32.txt:1
source: * Many improvements to virtual keys - Two-row layout, similar to Termux - Dedicated button to toggle Android keyboard - Save virtual keys visibility across sessions - A textbox (accessed by left swipe) to allow full-fledged Android editing experience - Long-press to 'lock' meta keys like Alt/Ctrl * Wake-on-LAN support * Made it easier to perform two-finger tap
ta: * மெய்நிகர் விசைகளில் பல மேம்பாடுகள் - இரண்டு-வரிசை தளவமைப்பு, டெர்மக்சைப் போன்றது - ஆண்ட்ராய்டு விசைப்பலகையை மாற்ற அர்ப்பணிக்கப்பட்ட பொத்தான் - அமர்வுகள் முழுவதும் மெய்நிகர் விசைகள் தெரிவுநிலையைச் சேமிக்கவும் - முழு நீள ஆண்ட்ராய்டு திருத்துதல் அனுபவத்தை அனுமதிக்க ஒரு உரைப்பெட்டி (இடது ச்வைப்பால் அணுகப்பட்டது) - ஆல்ட்/சி.டி.ஆர்.எல் போன்ற 'லாக்' மேவு விசைகளை நீண்ட அழுத்தவும் * வேக்-ஆன்-லான் உதவி * இரண்டு விரல் குழாய் செய்வதை எளிதாக்கியது

# changelogs/33.txt:1
source: * Improved error reporting * Fixed HTML content not being copied to server * Fixed a memory leak
ta: * மேம்பட்ட பிழை அறிக்கை * நிலையான உஉகுமொ உள்ளடக்கம் சேவையகத்திற்கு நகலெடுக்கப்படவில்லை * நினைவக கசிவு சரி செய்யப்பட்டது

# changelogs/34.txt:1
source: * Added an experimental option to pause updates in background * Improved keyboard navigation for Login dialog * Fixed couple of possible crashes
ta: * பின்னணியில் புதுப்பிப்புகளை இடைநிறுத்த ஒரு சோதனை விருப்பத்தைச் சேர்த்தது * உள்நுழைவு உரையாடலுக்கான மேம்பட்ட விசைப்பலகை வழிசெலுத்தல் * சாத்தியமான செயலிழப்புகள் நிலையான இணை

# changelogs/35.txt:1
source: * All virtual keys will now be shown on the same page * Disabled long-press detection when not used
ta: * அனைத்து மெய்நிகர் விசைகளும் இப்போது ஒரே பக்கத்தில் காண்பிக்கப்படும் * பயன்படுத்தப்படாதபோது நீண்ட அழுத்த கண்டறிதல் முடக்கப்பட்டுள்ளது

# changelogs/36.txt:1
source: * Added ability to customize Virtual Key layout Go to `Settings => Input => Virtual keys => Customize keys` to make changes * Move pointer to frame edge when tapped outside of frame * Made sure Toolbar is not obstructed by display cutout * Stopped the frame from moving up/down when touchpad gesture style is active
ta: * மெய்நிகர் விசை தளவமைப்பைத் தனிப்பயனாக்கும் திறன் சேர்க்கப்பட்டது மாற்றங்களைச் செய்ய `அமைப்புகள் => உள்ளீடு => மெய்நிகர் விசைகள் => விசைகளை தனிப்பயனாக்கு * சட்டகத்திற்கு வெளியே தட்டும்போது பிரேம் விளிம்பிற்கு சுட்டிக்காட்டி நகர்த்தவும் * காட்சி கட்அவுட்டால் கருவிப்பட்டி தடுக்கப்படவில்லை என்பதை உறுதிப்படுத்தவும் * டச்பேட் சைகை பாணி செயலில் இருக்கும்போது சட்டகத்தை மேலே/கீழ் நகர்த்துவதை நிறுத்தியது

# changelogs/37.txt:1
source: * Added ability to customize Virtual Key layout Go to `Settings => Input => Virtual keys => Customize keys` to make changes * Move pointer to frame edge when tapped outside of frame * Made sure Toolbar is not obstructed by display cutout * Stopped the frame from moving up/down when touchpad gesture style is active * Fixed a crash in "Customize keys" setting
ta: * மெய்நிகர் விசை தளவமைப்பைத் தனிப்பயனாக்கும் திறன் சேர்க்கப்பட்டது மாற்றங்களைச் செய்ய `அமைப்புகள் => உள்ளீடு => மெய்நிகர் விசைகள் => விசைகளை தனிப்பயனாக்கு * சட்டகத்திற்கு வெளியே தட்டும்போது பிரேம் விளிம்பிற்கு சுட்டிக்காட்டி நகர்த்தவும் * காட்சி கட்அவுட்டால் கருவிப்பட்டி தடுக்கப்படவில்லை என்பதை உறுதிப்படுத்தவும் * டச்பேட் சைகை பாணி செயலில் இருக்கும்போது சட்டகத்தை மேலே/கீழ் நகர்த்துவதை நிறுத்தியது * "விசைகளைத் தனிப்பயனாக்கு" அமைப்பில் விபத்து சரி செய்யப்பட்டது

# changelogs/38.txt:1
source: * New Arabic localization by Ahmed * Fixed possible crash when coercing tap to frame edge * Added option to force masOS security type
ta: * அகமது எழுதிய புதிய அரபு உள்ளூராக்கல் * பிரேம் விளிம்பிற்கு தட்டும்போது நிலையான விபத்து * மசோச் பாதுகாப்பு வகையை கட்டாயப்படுத்த விருப்பம் சேர்க்கப்பட்டது

# changelogs/39.txt:1
source: * Fixed 'Application not responding' error happening in some cases
ta: * நிலையான 'விண்ணப்பம் பதிலளிக்கவில்லை' பிழை சில சந்தர்ப்பங்களில் நிகழ்கிறது

# changelogs/4.txt:1
source: * Added Samsung touchpad support (by Tuan Pham) * Added stylus/pen support * Added 2-finger Tap gesture
ta: * சாம்சங் டச்பேட் உதவி சேர்க்கப்பட்டது (துவான் பாம் எழுதியது) * ச்டைலச்/பேனா உதவி சேர்க்கப்பட்டது * 2 விரல் தட்டு சைகை சேர்க்கப்பட்டது

# changelogs/5.txt:1
source: * Allow key mappings to SUPER/Window key (by Tuan Pham) * Ensure virtual meta-keys are always released (by thechosenreader) * Added diacritics (accent) support
ta: * விசை மேப்பிங்சை சூப்பர்/சாளர விசைக்கு அனுமதிக்கவும் (துவான் பாம் எழுதியது) * மெய்நிகர் மெட்டா-விசைகள் எப்போதும் வெளியிடப்படுவதை உறுதிசெய்க (தெகோசென் ரீடர் மூலம்) * சேர்க்கப்பட்ட டயாக்ரிடிக்ச் (உச்சரிப்பு) உதவி

# changelogs/6.txt:1
source: * Improved keyboard shortcuts support * Improved diacritic (accent) support * Added full immersive mode (experimental)
ta: * மேம்படுத்தப்பட்ட விசைப்பலகை குறுக்குவழிகள் உதவி * மேம்படுத்தப்பட்ட டையக்ரிடிக் (உச்சரிப்பு) உதவி * முழு அதிவேக பயன்முறையைச் சேர்க்கப்பட்டது (சோதனை)

# changelogs/7.txt:1
source: * Added Portuguese (BR) translation (by inkhorn) * Added a preference to hide local Android cursor (by Henry H) * Fixed Stylus hover handling on some devices (by Henry H)
ta: * சேர்க்கப்பட்டது போர்த்துகீசியம் (பிஆர்) மொழிபெயர்ப்பு (இன்க்ஆர்ன் மூலம்) * உள்ளக ஆண்ட்ராய்டு கர்சரை மறைக்க ஒரு விருப்பத்தை சேர்த்தது (என்றி எச் எழுதியது) * சில சாதனங்களில் நிலையான ச்டைலச் ஓவர் கையாளுதல் (என்றி எச் எழுதியது)

# changelogs/8.txt:1
source: * Added trackpad/touchpad mode * Captured Window key & Alt+Tab on Samsung DeX * Optimized zoom for portrait-mode remote screens * Fixed sensitivity of Drag gesture * Translations: Portuguese-BR (by João Paulo), Norwegian Bokmål (by Allan Nordhøy), Persian (by Eshagh Shahedany), French (by J. Lavoie)
ta: * டிராக்பேட்/டச்பேட் பயன்முறை சேர்க்கப்பட்டது * சாம்சங் டெக்சில் கைப்பற்றப்பட்ட சாளர விசை & ஆல்ட்+தாவல் * உருவப்படம்-பயன்முறை ரிமோட் திரைகளுக்கு உகந்த சூம் * இழுவை சைகையின் நிலையான உணர்திறன் * மொழிபெயர்ப்புகள்: போர்த்துகீசிய-பி.ஆர் (சோனோ பாலோ எழுதியது), நோர்வே போக்மால் (ஆலன் நோர்தேயால்), பாரசீக (ஈசாக் சாஎடனி எழுதியது), பிரஞ்சு (சே. லாவோய்)

# changelogs/9.txt:1
source: * Improved login auto-completion * Improved server discovery * New language: Serbian (by Саша Петровић) Ukrainian (by Andrij Mizyk) * Updated language: Norwegian Bokmål (by Allan Nordhøy) Persian (by Eshagh Shahedany) French (by J. Lavoie, Nathan)
ta: * மேம்படுத்தப்பட்ட உள்நுழைவு தானாக நிறைவு * மேம்படுத்தப்பட்ட சேவையக கண்டுபிடிப்பு * புதிய மொழி: செர்பியன் (саша петровић) உக்ரேனிய (ஆண்ட்ரிச் மிசிக் எழுதியது) * புதுப்பிக்கப்பட்ட மொழி: நோர்வே போக்மால் (ஆலன் நோர்தே எழுதியது) பாரசீக (ஈசாக் சாஎடனி எழுதியது) பிரஞ்சு (சே. லாவோய், நாதன் எழுதியது)
