Repository: 247i/TACETr
Catalog: உரை/தானி/babydots-app-metadata-*.po
Languages: ta

# title.txt:1
source: Baby Dots
ta: குழந்தை புள்ளிகள்

# short_description.txt:1
source: Soothe and calm young babies
ta: இளம் குழந்தைகளை ஆற்றவும் அமைதியாகவும்

# full_description.txt:1
source: Based on experience with our young daughter, showing sharp contrasting dots along with calming music soothes her. It can take her from a distressed state to happy and content almost immediately. We started showing baby dots from 10 weeks old, and it still worked well at 8 months old. As they grow older, use the child lock so that those little fingers can safely touch the dots as they move around to make them change. Works at home and on the go. Although it may not work for every baby, we hope it helps yours.
ta: எங்கள் இளம் மகளுடனான அனுபவத்தின் அடிப்படையில், அமைதியான இசையுடன் கூர்மையான மாறுபட்ட புள்ளிகளைக் காண்பிப்பதைக் காண்பிக்கும். இது அவளை ஒரு துன்பகரமான நிலையிலிருந்து மகிழ்ச்சியாகவும், உள்ளடக்கத்திற்கு உடனடியாகவும் அழைத்துச் செல்லலாம். நாங்கள் 10 வார வயதிலிருந்தே குழந்தை புள்ளிகளைக் காட்டத் தொடங்கினோம், அது இன்னும் 8 மாத வயதில் நன்றாக வேலை செய்தது. அவர்கள் வயதாகும்போது, ​​குழந்தை பூட்டைப் பயன்படுத்துங்கள், இதனால் அந்த சிறிய விரல்கள் புள்ளிகளை மாற்றும்போது அவை மாறும்போது அவை பாதுகாப்பாகத் தொடும். வீட்டிலும் பயணத்திலும் வேலை செய்கிறது. ஒவ்வொரு குழந்தைக்கும் இது வேலை செய்யாது என்றாலும், அது உங்களுக்கு உதவும் என்று நம்புகிறோம்.

# changelogs/10000.txt:1
source: First release of Baby Dots: * Watch dancing dots with your baby. * Choose from different sizes, colours, and speed. Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: குழந்தை புள்ளிகளின் முதல் வெளியீடு: * உங்கள் குழந்தையுடன் நடனம் புள்ளிகளைப் பாருங்கள். * வெவ்வேறு அளவுகள், வண்ணங்கள் மற்றும் வேகத்திலிருந்து தேர்வு செய்யவும். தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10100.txt:1
source: Add classical music (defaults to muted), improve UI for customization. Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: பாரம்பரிய இசையைச் சேர்க்கவும் (முடக்கப்பட்ட இயல்புநிலைகள்), தனிப்பயனாக்கத்திற்கு இடைமுகம் ஐ மேம்படுத்தவும். தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10200.txt:1
source: Translations: * Finnish (thanks Edanas) * French (thanks Edanas) * German (thanks Edanas) * Italian (thanks Edanas) * Norwegian Bokmål (thanks kingu) * Santali (thanks Prasanta-Hembram) * Turkish (thanks ersen) Improvements: * Two new themes (dark + neon) * Remember selected preferences * Wake lock (don't turn screen off) * Randomise speed of each dot Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: மொழிபெயர்ப்பு: * பின்னிச் (நன்றி எடானாச்) * பிரஞ்சு (நன்றி எடானாச்) * செர்மன் (நன்றி எடானாச்) * இத்தாலியன் (நன்றி எடானாச்) * நோர்வே போக்மால் (நன்றி கிங்கு) * சந்தலி (நன்றி பிரசாந்தா-எம்பிராம்) * துருக்கிய (நன்றி எர்சன்) மேம்பாடுகள்: * இரண்டு புதிய கருப்பொருள்கள் (இருண்ட + நியான்) * தேர்ந்தெடுக்கப்பட்ட விருப்பங்களை நினைவில் கொள்க * வேக் லாக் (திரையை அணைக்க வேண்டாம்) * ஒவ்வொரு புள்ளியின் சீரற்ற வேகம் தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10300.txt:1
source: Added sleep timer: * When the timer reaches zero, the screen will dim, the music will pause, and the screen will turn off soon after. Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: தூக்க நேரங்குறிகருவி சேர்க்கப்பட்டது: * நேரங்குறிகருவி பூச்சியத்தை அடையும் போது, ​​திரை மங்கலாகிவிடும், இசை இடைநிறுத்தப்படும், விரைவில் திரை அணைக்கப்படும். தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10400.txt:1
source: Add optional screen locking, preventing accidental touches from excited babies. Translations: * Added Dutch (thanks vistaus) Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: உற்சாகமான குழந்தைகளிடமிருந்து தற்செயலான தொடுதல்களைத் தடுக்கும் விருப்பத் திரை பூட்டுதல் சேர்க்கவும். மொழிபெயர்ப்பு: * சேர்க்கப்பட்டது டச்சு (நன்றி விச்டாச்) தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10401.txt:1
source: Add optional screen locking, preventing accidental touches from excited babies. Improved display of messages when tapping unlock button many times fast. Translations: * Added Dutch (thanks vistaus) * Updated translations Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: உற்சாகமான குழந்தைகளிடமிருந்து தற்செயலான தொடுதல்களைத் தடுக்கும் விருப்பத் திரை பூட்டுதல் சேர்க்கவும். திறத்தல் பொத்தானை பல முறை வேகமாகத் தட்டும்போது செய்திகளின் மேம்படுத்தப்பட்ட காட்சி. மொழிபெயர்ப்பு: * சேர்க்கப்பட்டது டச்சு (நன்றி விச்டாச்) * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10402.txt:1
source: Properly feedback about how many touches required to unlock. Translations: * Added Polish (thanks WaldiS) * Updated translations Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: திறக்க எத்தனை தொடுதல்கள் தேவை என்பது பற்றி ஒழுங்காக கருத்து. மொழிபெயர்ப்பு: * போலிச் சேர்க்கப்பட்டது (நன்றி வால்டிச்) * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10403.txt:1
source: Translations: * Added Croation (thanks milotype) * Added Russian (thanks Kudesu) * Updated translations Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: மொழிபெயர்ப்பு: * சேர்க்கப்பட்டது (நன்றி மிலோடைப்) * ரச்யனைச் சேர்த்தது (நன்றி குடேசு) * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10404.txt:1
source: Translations: * Added Czech * Added Spanish (thanks sguinetti) * Added Ukranian (thanks IhorHordiichuk) * Updated translations (many thanks to all the community of translators) Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: மொழிபெயர்ப்பு: * செக் சேர்க்கப்பட்டது * ச்பானிச் சேர்க்கப்பட்டது (நன்றி sguinetti) * உக்ரேனியன் சேர்க்கப்பட்டது (நன்றி ihorhordiichuk) * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் (மொழிபெயர்ப்பாளர்களின் அனைத்து சமூகங்களுக்கும் நன்றி) தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10500.txt:1
source: Make dots more fun to interact with for tiny fingers. Touching dots now makes them bigger. Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: சிறிய விரல்களுடன் தொடர்பு கொள்ள புள்ளிகளை மிகவும் வேடிக்கையாக செய்யுங்கள். இப்போது புள்ளிகளைத் தொடுவது அவற்றை பெரிதாக்குகிறது. தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10501.txt:1
source: Bugfix: Prevent babies from unlocking BabyDots when rotating the device (thanks to yamatt for reporting). Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: பிழைத்திருத்தம்: சாதனத்தை சுழற்றும்போது குழந்தைகளை பேபிடாட்களைத் திறப்பதைத் தடுக்கவும் (புகாரளித்த யமட்டுக்கு நன்றி). தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10502.txt:1
source: Translations: - Added Lithuanian translation (thanks @g) - Updated translations Bugfixes: - Allow the about screen to be scrolled when the device screen is too small or the font is large (thanks @yuhuitech for first reporting and then fixing) Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: மொழிபெயர்ப்பு: - லிதுவேனியன் மொழிபெயர்ப்பு சேர்க்கப்பட்டது (நன்றி @g) - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் பிழைத்திருத்தங்கள்: - சாதனத் திரை மிகச் சிறியதாக இருக்கும்போது அல்லது எழுத்துரு பெரியதாக இருக்கும்போது திரையை உருட்ட அனுமதிக்கவும் (நன்றி @yuhuitech முதலில் புகாரளித்து பின்னர் சரிசெய்ததற்கு) தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10600.txt:1
source: Improved dot-touching experience: - Smoothly zoom dots in when touching or letting go. - Ensure dots remained touched when they move from under small fingers. Translations: - Added Portuguese and Portuguese (Brazil) (Thanks to larcansal). - Updated translations. Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: மேம்படுத்தப்பட்ட புள்ளி-தொடு அனுபவம்: - தொடும்போது அல்லது விடும்போது புள்ளிகளை சீராக பெரிதாக்கவும். - சிறிய விரல்களின் கீழ் இருந்து செல்லும்போது புள்ளிகள் தொட்டிருப்பதை உறுதிசெய்க. மொழிபெயர்ப்பு: - போர்த்துகீசியம் மற்றும் போர்த்துகீசியம் (பிரேசில்) சேர்க்கப்பட்டது (லார்கன்சலுக்கு நன்றி). - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள். தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10700.txt:1
source: Additional rainbow colour scheme. The existing one had colours like cyan and magenta. Now that our child is starting to learn colours, we wanted more 'normal' colours such as orange, blue, purple, yellow. The existing scheme is maintained, this adds a new scheme. Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: கூடுதல் வானவில் வண்ணத் திட்டம். தற்போதுள்ள ஒன்றில் சியான் மற்றும் மெசந்தா போன்ற வண்ணங்கள் இருந்தன. இப்போது எங்கள் குழந்தை வண்ணங்களைக் கற்கத் தொடங்கியுள்ளதால், ஆரஞ்சு, நீலம், ஊதா, மஞ்சள் போன்ற 'சாதாரண' வண்ணங்களை நாங்கள் விரும்பினோம். தற்போதுள்ள திட்டம் பராமரிக்கப்படுகிறது, இது ஒரு புதிய திட்டத்தை சேர்க்கிறது. தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10701.txt:1
source: Bugfix: Avoid memory issue when drawing dots on newer devices, preventing potential crashes or flickering of dots (thanks to @lateski for both investigating and fixing). Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: பிழைத்திருத்தம்: புதிய சாதனங்களில் புள்ளிகளை வரையும்போது நினைவக சிக்கலைத் தவிர்க்கவும், சாத்தியமான செயலிழப்புகளைத் தடுக்கும் அல்லது புள்ளிகளின் ஒளிரும் (விசாரணை மற்றும் சரிசெய்தல் ஆகிய இரண்டிற்கும் @லேட்ச்கிக்கு நன்றி). தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10800.txt:1
source: New shapes: Circles, squares, and triangles! (thanks to @bananer) Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: புதிய வடிவங்கள்: வட்டங்கள், சதுரங்கள் மற்றும் முக்கோணங்கள்! (@bananer க்கு நன்றி) தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10801.txt:1
source: Improvements: * More accurate touch sensing for new shapes. * Updated translations. Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: மேம்பாடுகள்: * புதிய வடிவங்களுக்கான மிகவும் துல்லியமான தொடு உணர்திறன். * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள். தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10900.txt:1
source: Additional songs: * J. Pachelbel - Canon in D Major * Erik Satie - Gymnopedie No 1 * Vivaldi - The Four Seasons - Spring, Movement 1 (existing) Choose your babies favourite from the settings menu. Please recommend any other songs, provide any feedback, or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: கூடுதல் பாடல்கள்: * சே. பச்செல்பெல் - டி மேசரில் நியதி * எரிக் சூழ்ச்சி - சிம்னோபீடி எண் 1 * விவால்டி - நான்கு பருவங்கள் - வேனில், இயக்கம் 1 (இருக்கும்) அமைப்புகள் மெனுவிலிருந்து உங்கள் குழந்தைகளுக்கு பிடித்ததைத் தேர்வுசெய்க. தயவுசெய்து வேறு எந்த பாடல்களையும் பரிந்துரைக்கவும், எந்தவொரு கருத்தையும் வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10901.txt:1
source: Bug fix: * Don't stop music when rotating device. Known issue: * Sleep timer still resets when rotating - to be fixed in next version. Translations: * Added Catalan (thanks @maite.guix) * Updated multiple other translations (thanks to the community of translators) Please provide any feedback, or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: பிழை பிழைத்திருத்தம்: * சாதனத்தை சுழற்றும்போது இசையை நிறுத்த வேண்டாம். அறியப்பட்ட பிரச்சினை: * சுழலும் போது ச்லீப் நேரங்குறிகருவி இன்னும் மீட்டமைக்கப்படுகிறது - அடுத்த பதிப்பில் சரி செய்யப்பட வேண்டும். மொழிபெயர்ப்பு: * காடலான் சேர்க்கப்பட்டது (நன்றி @maite.guix) * புதுப்பிக்கப்பட்ட பல மொழிபெயர்ப்புகள் (மொழிபெயர்ப்பாளர்களின் சமூகத்திற்கு நன்றி) தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10902.txt:1
source: Bug fix: * Don't stop music when rotating device. * Fix icon colour Known issue: * Sleep timer still resets when rotating - to be fixed in next version. Translations: * Added Catalan (thanks @maite.guix) * Updated multiple other translations (thanks to the community of translators) Please provide feedback or report issues at https://github.com/babydots/babydots/issues.
ta: பிழை பிழைத்திருத்தம்: * சாதனத்தை சுழற்றும்போது இசையை நிறுத்த வேண்டாம். * படவுரு நிறத்தை சரிசெய்யவும் அறியப்பட்ட பிரச்சினை: * சுழலும் போது ச்லீப் நேரங்குறிகருவி இன்னும் மீட்டமைக்கப்படுகிறது - அடுத்த பதிப்பில் சரி செய்யப்பட வேண்டும். மொழிபெயர்ப்பு: * காடலான் சேர்க்கப்பட்டது (நன்றி @maite.guix) * புதுப்பிக்கப்பட்ட பல மொழிபெயர்ப்புகள் (மொழிபெயர்ப்பாளர்களின் சமூகத்திற்கு நன்றி) தயவுசெய்து கருத்துக்களை வழங்கவும் அல்லது சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10903.txt:1
source: Fix: * Correct attribution of Johann Pachelbel for Canon in D (thanks @Quoor8ee). Please provide feedback or report issues at https://github.com/babydots/babydots/issues.
ta: சரி: * டி இல் கேனனுக்கான சோஆன் பச்செல்பலின் சரியான பண்புக்கூறு (நன்றி @quoor8ee). தயவுசெய்து கருத்துக்களை வழங்கவும் அல்லது சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10904.txt:1
source: Updates: * Updated multiple translations (thanks to the community of translators) Please provide feedback or report issues at https://github.com/babydots/babydots/issues.
ta: புதுப்பிப்புகள்: * புதுப்பிக்கப்பட்ட பல மொழிபெயர்ப்புகள் (மொழிபெயர்ப்பாளர்களின் சமூகத்திற்கு நன்றி) தயவுசெய்து கருத்துக்களை வழங்கவும் அல்லது சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10905.txt:1
source: Bump target SDK to latest version.
ta: பம்ப் இலக்கு SDK ஐ அண்மைக் கால பதிப்பிற்கு.

# changelogs/10906.txt:1
source: Translations: * Minor rewording and update of various translations. * Updated screenshots in metadata for multiple translations. Please provide feedback or report issues at https://github.com/babydots/babydots/issues.
ta: மொழிபெயர்ப்பு: * பல்வேறு மொழிபெயர்ப்புகளின் சிறிய மறுபயன்பாடு மற்றும் புதுப்பிப்பு. * பல மொழிபெயர்ப்புகளுக்கு மெட்டாடேட்டாவில் திரை சாட்கள் புதுப்பிக்கப்பட்டன. தயவுசெய்து கருத்துக்களை வழங்கவும் அல்லது சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10907.txt:1
source: Improvements: * Updated translations. Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: மேம்பாடுகள்: * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள். தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.

# changelogs/10908.txt:1
source: Translations: * Added Chinese (Simplified) (thanks @clonewith) * Updated translations. Misc: * Target latest Android version. Please provide any feedback or report any issues on the issue tracker at https://github.com/babydots/babydots/issues.
ta: மொழிபெயர்ப்பு: * சேர்க்கப்பட்ட சீனச் சேர்க்கப்பட்டது (எளிமைப்படுத்தப்பட்ட) (நன்றி @clonewith) * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள். தவறான: * அண்மைக் கால ஆண்ட்ராய்டு பதிப்பை இலக்கு. தயவுசெய்து ஏதேனும் கருத்துக்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/babydots/babydots/issues.
