Repository: 247i/TACETr
Catalog: உரை/தானி/bitbanana-app-strings-*.po
Languages: ta

# error_tor_exchange_rate
source: Exchange rate could not be fetched. The service you are using seems to block request coming from the Tor network. Try switching the exchange rate provider in the advanced settings.
ta: பரிமாற்ற வீதத்தை பெற முடியவில்லை. நீங்கள் பயன்படுத்தும் பணி TOR நெட்வொர்க்கிலிருந்து வரும் கோரிக்கையைத் தடுப்பதாகத் தெரிகிறது. மேம்பட்ட அமைப்புகளில் பரிமாற்ற வீத வழங்குநரை மாற்ற முயற்சிக்கவும்.

# error_static_identifier_response_unknown
source: The response from %1$s could not be read.
ta: %1$s இன் பதிலைப் படிக்க முடியவில்லை.

# error_lnd_connection_failed
source: Connection to LND failed, please try again.
ta: எல்.என்.டி இணைப்பு தோல்வியடைந்தது, தயவுசெய்து மீண்டும் முயற்சிக்கவும்.

# error_invalid_fee_preset_value
source: The value has to be bigger than 0.
ta: மதிப்பு 0 ஐ விட பெரியதாக இருக்க வேண்டும்.

# error_invalid_ln_address_format
source: Invalid format for Lightning Address. A Lightning Address looks like an email address. username@domain
ta: மின்னல் முகவரிக்கு தவறான வடிவம். மின்னல் முகவரி மின்னஞ்சல் முகவரி போல் தெரிகிறது. பயனர்பெயர்@டொமைன்

# error_invalid_bolt12_offer_format
source: Invalid payment code.
ta: தவறான கட்டணக் குறியீடு.

# error_routing_policy_only_partially_updated
source: Routing Policies updated but for %1$d of your channels the new rules could not be applied.
ta: ரூட்டிங் கொள்கைகள் புதுப்பிக்கப்பட்டன, ஆனால் உங்கள் சேனல்களில் %1$d க்கு புதிய விதிகளைப் பயன்படுத்த முடியவில்லை.

# error_routing_policy_fee_rate_too_high
source: Fee rate to high. A maximum of %1$.2f%% is allowed.
ta: கட்டண விகிதம் உயர். அதிகபட்சம்%1 $ .2f %% அனுமதிக்கப்படுகிறது.

# error_no_permission_to_read_file
source: Access Denied: Unable to read the file. We recommend moving it to a different location, such as the "Downloads" folder, and accessing it from there.
ta: அணுகல் மறுக்கப்பட்டது: கோப்பைப் படிக்க முடியவில்லை. "பதிவிறக்கங்கள்" கோப்புறை போன்ற வேறு இடத்திற்கு நகர்த்தவும், அங்கிருந்து அணுகவும் பரிந்துரைக்கிறோம்.

# error_block_explorer_setup_invalid
source: Block Explorer setup invalid.
ta: பிளாக் எக்ச்ப்ளோரர் அமைப்பு தவறானது.

# error_funds_not_confirmed_yet
source: You have sufficient on-chain funds, but their confirmation is still pending. Please wait for your on-chain funds to confirm. You can track the status of your funds through the UTXO view or transaction history.
ta: உங்களிடம் போதுமான சங்கிலி நிதிகள் உள்ளன, ஆனால் அவற்றின் உறுதிப்படுத்தல் இன்னும் நிலுவையில் உள்ளது. உங்கள் ஆன்-சங்கிலி நிதிகள் உறுதிப்படுத்த காத்திருங்கள். UTXO பார்வை அல்லது பரிவர்த்தனை வரலாறு மூலம் உங்கள் நிதிகளின் நிலையை நீங்கள் கண்காணிக்க முடியும்.

# error_insufficient_on_chain_funds
source: Insufficient on-chain funds. Maximum available:
ta: சங்கிலி நிதிகள் போதுமானதாக இல்லை. அதிகபட்சம் கிடைக்கிறது:

# error_insufficient_lightning_sending_liquidity
source: Insufficient lightning liquidity for sending. Open additional channels to increase it. Current maximum:
ta: அனுப்புவதற்கு போதுமான மின்னல் பணப்புழக்கம். அதை அதிகரிக்க கூடுதல் சேனல்களைத் திறக்கவும். தற்போதைய அதிகபட்சம்:

# error_tor_might_cause_problem
source: Tor could cause this issue. Please try to deactivate tor in the settings.
ta: டோர் இந்த சிக்கலை ஏற்படுத்தக்கூடும். அமைப்புகளில் TOR ஐ செயலிழக்க முயற்சிக்கவும்.

# error_grpc_setup_failed
source: Failed to initiate gRPC connection.
ta: GRPC இணைப்பைத் தொடங்குவதில் தோல்வி.

# error_tor_bootstrapping_failed
source: Tor bootstrapping failed.
ta: டோர் பூட்ச்ட்ராப்பிங் தோல்வியடைந்தது.

# error_unknown_backend
source: Unknown backend type.
ta: தெரியாத பின்தளத்தில் வகை.

# error_input_field_empty
source: The %1$s input field must not be empty.
ta: %1$s உள்ளீட்டு புலம் காலியாக இருக்கக்கூடாது.

# error_input_invalid_data
source: The %1$s input field contains invalid data.
ta: %1$s உள்ளீட்டு புலத்தில் தவறான தரவு உள்ளது.

# error_input_macaroon_hex
source: The macaroon must be provided in hex format.
ta: மக்காரூன் ஃச் வடிவத்தில் வழங்கப்பட வேண்டும்.

# error_duplication
source: Duplication failed.
ta: நகல் தோல்வியடைந்தது.

# error_unsupported_network
source: The Bitcoin network you are connected to is not supported.
ta: நீங்கள் இணைக்கப்பட்டுள்ள பிட்காயின் பிணையம் ஆதரிக்கப்படவில்லை.

# error_feature_not_supported_by_backend
source: While using %1$s, BitBanana does not support the following feature: %2$s
ta: %1$s ஐப் பயன்படுத்தும் போது, ​​பிட்பனானா பின்வரும் அம்சத்தை ஆதரிக்கவில்லை: %2$s

# error_reading_qrCode_in_image
source: Unable to scan or detect QR code in the image.
ta: படத்தில் QR குறியீட்டை ச்கேன் செய்யவோ கண்டறியவோ முடியவில்லை.

# error_exchange_rate_requires_tor_toast
source: Failed to fetch exchange rates. Your chosen provider requires tor.
ta: பரிமாற்ற விகிதங்களைப் பெறுவதில் தோல்வி. நீங்கள் தேர்ந்தெடுத்த வழங்குநருக்கு டோர் தேவை.

# error_fee_estimation_requires_tor_toast
source: Failed to fetch fee estimates. Your chosen provider requires tor.
ta: கட்டண மதிப்பீடுகளைப் பெறுவதில் தோல்வி. நீங்கள் தேர்ந்தெடுத்த வழங்குநருக்கு டோர் தேவை.

# error_insufficient_funds
source: This payment exceeds your available balance.
ta: இந்த கட்டணம் உங்கள் கிடைக்கக்கூடிய நிலுவைத் தொகையை மீறுகிறது.

# error_provided_data_invalid
source: The provided data is invalid.
ta: வழங்கப்பட்ட தரவு தவறானது.

# error_invalid_watchtower_connection_data
source: Please ensure the data is in the following format: - pubkey@host:port
ta: தரவு பின்வரும் வடிவத்தில் இருப்பதை உறுதிப்படுத்தவும்: - பப்கே@ஓச்ட்: துறைமுகம்

# error_invalid_peer_connection_data
source: Please ensure the data is in one of the following formats: - pubkey - pubkey@host - pubkey@host:port
ta: தரவு பின்வரும் வடிவங்களில் ஒன்றில் இருப்பதை உறுதிப்படுத்தவும்: - பப்கே - பப்கே@ஓச்ட் - பப்கே@ஓச்ட்: துறைமுகம்

# error_offer_already_exists
source: An identical payment code already exists.
ta: ஒரே மாதிரியான கட்டணக் குறியீடு ஏற்கனவே உள்ளது.

# error_invalid_contact_data
source: Invalid format. Please use one of the following: - Lightning Address - pubkey - pubkey@host - pubkey@host:port - Payment Code
ta: தவறான வடிவம். பின்வருவனவற்றில் ஒன்றைப் பயன்படுத்தவும்: - மின்னல் முகவரி - பப்கே - பப்கே@ஓச்ட் - பப்கே@ஓச்ட்: துறைமுகம் - கட்டணக் குறியீடு

# blocks
source: %d Block
ta: %d தொகுதி

# duration_second
source: %d Second
ta: %d இரண்டாவது

# duration_minute
source: %d Minute
ta: %d மணித்துளி

# duration_hour
source: %d Hour
ta: %d மணி

# duration_day
source: %d Day
ta: %d நாள்

# duration_week
source: %d Week
ta: %d வாரம்

# duration_month
source: %d Month
ta: %d மாதம்

# duration_year
source: %d Year
ta: %d ஆண்டு

# duration_second_short
source: sec
ta: நொடி

# duration_minute_short
source: min
ta: மணித்துளி

# fee_tier_slow_title
source: Slow
ta: மெதுவாக

# fee_tier_medium_title
source: Medium
ta: சராசரி

# fee_tier_fast_title
source: Fast
ta: வேகமாக

# fee_tier_slow_description
source: Slow Transaction
ta: மெதுவான பரிவர்த்தனை

# fee_tier_medium_description
source: Medium Transaction
ta: நடுத்தர பரிவர்த்தனை

# fee_tier_fast_description
source: Fast Transaction
ta: விரைவான பரிவர்த்தனை

# fee_estimated_duration
source: Estimated Delivery: %1$s
ta: மதிப்பிடப்பட்ட விநியோகம்: %1$s

# fee_not_available
source: n/A
ta: இதற்கில்லை

# fee_limit_title
source: Fee Limit Alert
ta: கட்டண வரம்பு எச்சரிக்கை

# fee_limit_threshold
source: Fee limit for payments above %1$d sats: %2$s
ta: %1$d SATS க்கு மேல் கொடுப்பனவுகளுக்கான கட்டண வரம்பு: %2$s

# fee_limit_exceeded
source: The fee for this payment (%1$.1f%%) exceeds the limit specified in the settings (%2$.1f%%). Do you really want to pay this invoice?
ta: இந்த கட்டணத்திற்கான கட்டணம் (%1 $ .1f %%) அமைப்புகளில் குறிப்பிடப்பட்டுள்ள வரம்பை மீறுகிறது (%2 $ .1f %%). இந்த விலைப்பட்டியல் செலுத்த விரும்புகிறீர்களா?

# fee_limit_exceeded_payment
source: The fee for this payment (%1$d sats) will be higher than the payment amount (%2$d sats). Do you really want to pay this invoice?
ta: இந்த கட்டணத்திற்கான கட்டணம் (%1$d SATS) கட்டணத் தொகையை விட (%2$d SATS) அதிகமாக இருக்கும். இந்த விலைப்பட்டியல் செலுத்த விரும்புகிறீர்களா?

source: Unlock Wallet
ta: பணப்பையை திறக்கவும்

# biometricPrompt_title
source: Biometric Authentication
ta: பயோமெட்ரிக் ஏற்பு

# biometricNotSetup
source: In order to use this feature, you have to setup biometric authentication in your Android system settings.
ta: இந்த அம்சத்தைப் பயன்படுத்த, உங்கள் ஆண்ட்ராய்டு கணினி அமைப்புகளில் பயோமெட்ரிக் அங்கீகாரத்தை அமைக்க வேண்டும்.

source: Invoice Detail
ta: விலைப்பட்டியல் விவரம்

source: Transaction Detail
ta: பரிவர்த்தனை விவரம்

# app_reset_message
source: The app has been reset as the last update included some structural changes. Unfortunately you will have to go through the setup process again.
ta: கடைசி புதுப்பிப்பில் சில கட்டமைப்பு மாற்றங்கள் இருந்ததால் பயன்பாடு மீட்டமைக்கப்பட்டுள்ளது. துரதிர்ச்டவசமாக நீங்கள் மீண்டும் அமைவு செயல்முறைக்கு செல்ல வேண்டியிருக்கும்.

# nfc_type_not_supported
source: Unsupported NFC type
ta: ஆதரிக்கப்படாத NFC வகை

# help_dialog_scanPaymentRequest
source: QR-Codes containing the following are valid: - Bitcoin Address - Bitcoin Payment Request - Lightning Payment Request
ta: பின்வருவனவற்றைக் கொண்ட QR-குறியீடுகள் செல்லுபடியாகும்: - பிட்காயின் முகவரி - பிட்காயின் கட்டண கோரிக்கை - மின்னல் கட்டண கோரிக்கை

# help_dialog_scanNodePublicKey
source: QR-Codes containing the following are valid: - pubkey - pubkey@host - pubkey@host:port - LNURL-Channel
ta: பின்வருவனவற்றைக் கொண்ட QR-குறியீடுகள் செல்லுபடியாகும்: - பப்கே - பப்கே@ஓச்ட் - பப்கே@ஓச்ட்: துறைமுகம் - lnurl-channel

# help_dialog_scanContact
source: QR-Codes containing the following are valid: - Lightning Address - pubkey - pubkey@host - pubkey@host:port - Payment Code
ta: பின்வருவனவற்றைக் கொண்ட QR-குறியீடுகள் செல்லுபடியாகும்: - மின்னல் முகவரி - பப்கே - பப்கே@ஓச்ட் - பப்கே@ஓச்ட்: துறைமுகம் - கட்டணக் குறியீடு

# help_dialog_scanConnectionInfo
source: QR-Codes containing the following are valid: - Lndconnect string (lndconnect://...) - BtcPay Server connection (config=...) - Full content of your BTCPay Server config file
ta: பின்வருவனவற்றைக் கொண்ட QR-குறியீடுகள் செல்லுபடியாகும்: - lndconnect சரம் (lndconnect: // ...) - BTCPAY சேவையக இணைப்பு (config = ...) - உங்கள் BTCPAY சேவையக கட்டமைப்பு கோப்பின் முழு உள்ளடக்கம்

# help_dialog_LightningVsOnChain
source: Lightning: + instant + low fees - not always possible Perfect for small transactions. Use whenever possible. On-Chain: + always possible - slower - higher fees Good for big transactions. Use this when Lightning is not possible.
ta: மின்னல்: + உடனடி + குறைந்த கட்டணம் - எப்போதும் சாத்தியமில்லை சிறிய பரிவர்த்தனைகளுக்கு ஏற்றது. முடிந்தவரை பயன்படுத்தவும். ஆன்-சங்கிலி: + எப்போதும் சாத்தியம் - மெதுவாக - அதிக கட்டணம் பெரிய பரிவர்த்தனைகளுக்கு நல்லது. மின்னல் சாத்தியமில்லாதபோது இதைப் பயன்படுத்தவும்.

# help_dialog_scanGeneric
source: Anything is allowed here. Just scan a QR-Code and BitBanana will automatically determine which action to take depending on the data.
ta: இங்கே எதுவும் அனுமதிக்கப்படுகிறது. ஒரு QR-குறியீட்டை ச்கேன் செய்து, பிட்பனானா தானாகவே தரவைப் பொறுத்து எந்த நடவடிக்கை எடுக்க வேண்டும் என்பதை தீர்மானிக்கும்.

# help_dialog_private_channels
source: Private channels are not more secure, they are just not visible to the network. Only use private channels if you open a channel to a node that does not route payments or when you do not route payments yourself. To route payments your node should have a very high uptime. If you run your node on a mobile device or a device that is often offline, you should not route payments and stick to private channels.
ta: தனியார் சேனல்கள் மிகவும் பாதுகாப்பானவை அல்ல, அவை பிணையத்திற்கு மட்டும் தெரியவில்லை. பணம் செலுத்தாத ஒரு முனைக்கு நீங்கள் ஒரு சேனலைத் திறந்தால் அல்லது கொடுப்பனவுகளை நீங்கள் வழிநடத்தாதபோது மட்டுமே தனியார் சேனல்களைப் பயன்படுத்துங்கள். உங்கள் முனை மிக உயர்ந்த நேரத்தைக் கொண்டிருக்க வேண்டும். மொபைல் சாதனம் அல்லது பெரும்பாலும் ஆஃப்லைனில் இருக்கும் சாதனத்தில் உங்கள் முனையை இயக்கினால், நீங்கள் கொடுப்பனவுகளை வழிநடத்தக்கூடாது மற்றும் தனியார் சேனல்களில் ஒட்டிக்கொள்ளக்கூடாது.

# help_dialog_identity
source: This is your node on the lightning network. When you tap on your avatar image you will reveal a QR-Code. Others can scan that code and add you to their contacts, open channels with you or send money to you. This avatar is unique. It was automatically generated based on your public key and cannot be changed.
ta: இது மின்னல் நெட்வொர்க்கில் உங்கள் முனை. உங்கள் அவதார் படத்தைத் தட்டும்போது நீங்கள் ஒரு QR-குறியீட்டை வெளிப்படுத்துவீர்கள். மற்றவர்கள் அந்தக் குறியீட்டை ச்கேன் செய்து அவர்களின் தொடர்புகளில் உங்களைச் சேர்க்கலாம், உங்களுடன் சேனல்களைத் திறக்கலாம் அல்லது உங்களுக்கு பணம் அனுப்பலாம். இந்த அவதாரம் தனித்துவமானது. இது உங்கள் பொது விசையின் அடிப்படையில் தானாக உருவாக்கப்பட்டது, அதை மாற்ற முடியாது.

# help_dialog_utxos
source: This list of UTXOs represents all your On-Chain funds. In similar fashion to coins, unspent transaction outputs (UTXOs) can only be spent as a whole. As UTXOs can have any value you will simply receive change in form of another UTXO when sending transactions.
ta: UTXOS இன் இந்த பட்டியல் உங்கள் அனைத்து சங்கிலி நிதிகளையும் குறிக்கிறது. நாணயங்களைப் போலவே, செலவிடப்படாத பரிவர்த்தனை வெளியீடுகள் (UTXOS) ஒட்டுமொத்தமாக மட்டுமே செலவிட முடியும். UTXOS க்கு எந்த மதிப்பும் இருக்க முடியும் என்பதால், பரிவர்த்தனைகளை அனுப்பும்போது மற்றொரு UTXO வடிவத்தில் மாற்றத்தைப் பெறுவீர்கள்.

# help_dialog_sign_verify
source: By signing a message with your node, you can proof that you are the owner of this node. As the signature contains the nodes public key, others can verify such a signed message. This feature can be used in different scenarios like proofing identity or for example to login with your node on some services.
ta: உங்கள் முனையுடன் ஒரு செய்தியில் கையெழுத்திடுவதன் மூலம், நீங்கள் இந்த முனையின் உரிமையாளர் என்பதற்கு நீங்கள் நிரூபிக்கலாம். கையொப்பத்தில் கணுக்கள் பொது விசையைக் கொண்டிருப்பதால், மற்றவர்கள் அத்தகைய கையொப்பமிடப்பட்ட செய்தியை சரிபார்க்க முடியும். இந்த அம்சத்தை சரிபார்ப்பு அடையாளம் போன்ற வெவ்வேறு காட்சிகளில் பயன்படுத்தலாம் அல்லது எடுத்துக்காட்டாக சில சேவைகளில் உங்கள் முனையுடன் உள்நுழையலாம்.

# help_dialog_forwarding
source: This view shows all the payments that you forwarded for other participants of the lightning network. Moreover you can see the funds you earned for providing that service. In the lightning network channels are used for payments. When two participants want to send funds to each other but they do not have a channel open between them, they will have to find other participants in the network that have. Example: Alice wants to send funds to Carol, but does not have a channel with Carol. A direct payment is therefore impossible. But if Alice has a channel to Bob and Bob has a channel to Carol there is a solution. Bob can forward the payment to Carol. Payments often use multiple forwardings (hops) to finally reach their destination.
ta: மின்னல் நெட்வொர்க்கின் மற்ற பங்கேற்பாளர்களுக்காக நீங்கள் அனுப்பிய அனைத்து கொடுப்பனவுகளையும் இந்த பார்வை காட்டுகிறது. மேலும் அந்த சேவையை வழங்குவதற்காக நீங்கள் சம்பாதித்த நிதியைக் காணலாம். மின்னல் பிணையம் சேனல்கள் கொடுப்பனவுகளுக்கு பயன்படுத்தப்படுகின்றன. இரண்டு பங்கேற்பாளர்கள் ஒருவருக்கொருவர் பொருள் அனுப்ப விரும்பினால், ஆனால் அவர்களுக்கு இடையே ஒரு சேனல் திறக்கப்படவில்லை, அவர்கள் நெட்வொர்க்கில் மற்ற பங்கேற்பாளர்களைக் கண்டுபிடிக்க வேண்டும். எடுத்துக்காட்டு: ஆலிச் கரோலுக்கு பொருள் அனுப்ப விரும்புகிறார், ஆனால் கரோலுடன் சேனல் இல்லை. எனவே நேரடி கட்டணம் சாத்தியமற்றது. ஆனால் ஆலிசுக்கு ஒரு சேனல் இருந்தால், பாப் கரோலுக்கு ஒரு சேனலைக் கொண்டிருந்தால் ஒரு தீர்வு உள்ளது. பாப் கட்டணத்தை கரோலுக்கு அனுப்பலாம். கொடுப்பனவுகள் பெரும்பாலும் அவற்றின் இலக்கை அடைய பல முன்னோக்குகளை (ஆப்ச்) பயன்படுத்துகின்றன.

# help_dialog_channels
source: The list of lightning channels represents your lightning funds. Lightning channels are necessary to participate in the lightning network that allows instant and cheap bitcoin payments. To "convert" on-chain funds to lightning funds you have to open a channel. To "convert" lightning funds back to on-chain funds, you have to close an existing channel. Both operation, opening and closing channels, are achieved by an on-chain transaction that costs fees. Therefore, try to keep channels open for as long as possible! An easy way to get started with opening channels is to use lightningnetwork.plus.
ta: மின்னல் சேனல்களின் பட்டியல் உங்கள் மின்னல் நிதியைக் குறிக்கிறது. உடனடி மற்றும் மலிவான பிட்காயின் கொடுப்பனவுகளை அனுமதிக்கும் மின்னல் வலையமைப்பில் பங்கேற்க மின்னல் சேனல்கள் அவசியம். ஆன்-சங்கிலி நிதியை மின்னல் நிதிகளுக்கு "மாற்ற" நீங்கள் ஒரு சேனலைத் திறக்க வேண்டும். மின்னல் நிதிகளை மீண்டும் சங்கிலி நிதிகளுக்கு "மாற்ற", நீங்கள் ஏற்கனவே இருக்கும் சேனலை மூட வேண்டும். செயல்பாடு, திறப்பு மற்றும் மூடல் சேனல்கள் இரண்டும் கட்டணம் செலவாகும் ஒரு சங்கிலி பரிவர்த்தனையால் அடையப்படுகின்றன. எனவே, சேனல்களை முடிந்தவரை திறந்து வைக்க முயற்சிக்கவும்! சேனல்களைத் திறப்பதன் மூலம் தொடங்குவதற்கான ஒரு சுலபமான வழி, மின்னல்நெட்நொர்க்கைப் பயன்படுத்துவதாகும்.

# help_dialog_connect_node_help
source: Unfortunately these QR-Codes are so big that some devices are not able to scan them. If this is the case for you will have to fall back to copy/paste. If you need further help, please refer to our setup documentation.
ta: துரதிர்ச்டவசமாக இந்த QR-குறியீடுகள் மிகப் பெரியவை, சில சாதனங்கள் அவற்றை ச்கேன் செய்ய முடியாது. இதுபோன்றால் நீங்கள் நகலெடுக்க/ஒட்டுவதற்கு மீண்டும் விழ வேண்டும். உங்களுக்கு மேலும் உதவி தேவைப்பட்டால், தயவுசெய்து எங்கள் அமைவு ஆவணங்களைப் பார்க்கவும்.

# help_dialog_payer_data_settings
source: Some payees support or even require you to send them additional information about yourself. For convenience, you can set default values here, so you do not have to enter this information every time. This data is only stored locally on the phone. Please note that even with defaults set you will still be able to modify the data when doing a payment. You will also still be able to choose which data is sent at all. You are responsible for deciding whether to use real or fake data. As rule of thumb, we advise only sending real data if it is necessary for some reason. (E.g. when you will receive a code by mail, etc.)
ta: சில பணம் செலுத்துபவர்களை ஆதரிக்கிறார்கள் அல்லது உங்களைப் பற்றிய கூடுதல் தகவல்களை அவர்களுக்கு அனுப்ப வேண்டும். வசதிக்காக, நீங்கள் இயல்புநிலை மதிப்புகளை இங்கே அமைக்கலாம், எனவே ஒவ்வொரு முறையும் இந்த தகவலை உள்ளிட வேண்டியதில்லை. இந்த தரவு தொலைபேசியில் மட்டுமே உள்நாட்டில் சேமிக்கப்படுகிறது. இயல்புநிலை தொகுப்போடு கூட, கட்டணம் செலுத்தும்போது தரவை மாற்ற முடியும் என்பதை நினைவில் கொள்க. எந்த தரவு அனுப்பப்படுகிறது என்பதை நீங்கள் இன்னும் தேர்வு செய்ய முடியும். உண்மையான அல்லது போலி தரவைப் பயன்படுத்தலாமா என்பதை தீர்மானிக்க நீங்கள் பொறுப்பு. கட்டைவிரல் விதியாக, உண்மையான தரவை சில காரணங்களால் அவசியமாக இருந்தால் மட்டுமே அனுப்ப அறிவுறுத்துகிறோம். (எ.கா. நீங்கள் அஞ்சல் மூலம் ஒரு குறியீட்டைப் பெறும்போது)

# help_dialog_payer_data_payment
source: This payee supports or even requires you to send him additional information about yourself. You are responsible for deciding whether to use real or fake data. As rule of thumb, we advise only sending real data if it is necessary for some reason. (E.g. when you will receive a code by mail, etc.) If a checkmark cannot be unchecked then this data is marked as mandatory by the payee. If you don't want to send that data you'll have to cancel the payment.
ta: இந்த பணம் செலுத்துபவர் உங்களைப் பற்றிய கூடுதல் தகவல்களை அவருக்கு அனுப்ப வேண்டும் அல்லது தேவைப்படுகிறது. உண்மையான அல்லது போலி தரவைப் பயன்படுத்தலாமா என்பதை தீர்மானிக்க நீங்கள் பொறுப்பு. கட்டைவிரல் விதியாக, உண்மையான தரவை சில காரணங்களால் அவசியமாக இருந்தால் மட்டுமே அனுப்ப அறிவுறுத்துகிறோம். (எ.கா. நீங்கள் அஞ்சல் மூலம் ஒரு குறியீட்டைப் பெறும்போது) ஒரு செக்மார்க்கை தேர்வு செய்ய முடியாவிட்டால், இந்தத் தரவு பணம் செலுத்துபவரால் கட்டாயமாக குறிக்கப்பட்டுள்ளது. அந்த தரவை நீங்கள் அனுப்ப விரும்பவில்லை என்றால், நீங்கள் கட்டணத்தை ரத்து செய்ய வேண்டும்.

# help_dialog_base_fee
source: Regardless of the transaction's value, you'll receive a set base fee for every transaction you forward through the channel. Your total received fee is the sum of this base fee and the fee rate.
ta: பரிவர்த்தனையின் மதிப்பைப் பொருட்படுத்தாமல், சேனல் மூலம் நீங்கள் அனுப்பும் ஒவ்வொரு பரிவர்த்தனைக்கும் ஒரு தொகுப்பு அடிப்படைக் கட்டணத்தைப் பெறுவீர்கள். நீங்கள் பெறப்பட்ட மொத்த கட்டணம் இந்த அடிப்படை கட்டணத்தின் தொகை மற்றும் கட்டண வீதமாகும்.

# help_dialog_fee_rate
source: The fee rate is a fee that scales with the value of the transaction you forward through the channel. Your total received fee is the sum of this fee rate and the base fee.
ta: கட்டண விகிதம் என்பது சேனல் மூலம் நீங்கள் அனுப்பும் பரிவர்த்தனையின் மதிப்பைக் கொண்ட கட்டணமாகும். நீங்கள் பெறப்பட்ட மொத்த கட்டணம் இந்த கட்டண வீதத்தின் தொகை மற்றும் அடிப்படை கட்டணம்.

# help_dialog_inbound_fee
source: Forwarding a payment involves two channels: an inbound channel for receiving a specific amount and an outbound channel for sending the same amount to another peer. Inbound channel fees allow node operators to more efficiently signal where liquidity scarcities occur. By adjusting this value, you can influence the likelihood of a channel being selected as an inbound channel in routing. The specified value represents the fee you will charge or the discount you will offer when the channel is chosen as the inbound channel. Technically, a fee can only be set for the outbound channel; thus, for a selected channel pair (inbound & outbound) the inbound fee effectively adjusts the outbound fee by a simple addition. Therefore, a negative number results in a discount on outbound fee, while a positive number will increase it. For security, the total routing fee cannot be negative, ensuring that funds are not lost through routing. Base fee and fee rate work the same way as they do for outbound fees.
ta: கட்டணத்தை அனுப்புவது இரண்டு சேனல்களை உள்ளடக்கியது: ஒரு குறிப்பிட்ட தொகையைப் பெறுவதற்கான உள்வரும் சேனல் மற்றும் அதே தொகையை மற்றொரு சகாக்களுக்கு அனுப்புவதற்கான வெளிச்செல்லும் சேனல். உள்வரும் சேனல் கட்டணங்கள், பணப்புழக்க பற்றாக்குறைகள் எங்கு நிகழ்கின்றன என்பதை மிகவும் திறமையாக சமிக்ஞை செய்ய முனை ஆபரேட்டர்கள் அனுமதிக்கின்றன. இந்த மதிப்பை சரிசெய்வதன் மூலம், ஒரு சேனல் ரூட்டிங் செய்வதில் உள்வரும் சேனலாக தேர்ந்தெடுக்கப்படுவதற்கான வாய்ப்பை நீங்கள் பாதிக்கலாம். குறிப்பிட்ட மதிப்பு நீங்கள் வசூலிக்கும் கட்டணம் அல்லது சேனல் உள்வரும் சேனலாக தேர்ந்தெடுக்கப்படும்போது நீங்கள் வழங்கும் தள்ளுபடியைக் குறிக்கிறது. தொழில்நுட்ப ரீதியாக, வெளிச்செல்லும் சேனலுக்கு மட்டுமே கட்டணம் அமைக்க முடியும்; எனவே, தேர்ந்தெடுக்கப்பட்ட சேனல் சோடிக்கு (உள்வரும் மற்றும் வெளிச்செல்லும்) உள்வரும் கட்டணம் வெளிச்செல்லும் கட்டணத்தை ஒரு எளிய சேர்த்தல் மூலம் திறம்பட சரிசெய்கிறது. எனவே, எதிர்மறை எண் வெளிச்செல்லும் கட்டணத்தில் தள்ளுபடியை விளைவிக்கிறது, அதே நேரத்தில் நேர்மறையான எண் அதை அதிகரிக்கும். பாதுகாப்பைப் பொறுத்தவரை, மொத்த ரூட்டிங் கட்டணம் எதிர்மறையாக இருக்க முடியாது, இது ரூட்டிங் மூலம் பொருள் இழக்கப்படுவதை உறுதிசெய்கிறது. அடிப்படை கட்டணம் மற்றும் கட்டண விகிதம் வெளிச்செல்லும் கட்டணங்களைப் போலவே செயல்படுகின்றன.

# help_dialog_minHTLC
source: The smallest value you are willing to forward on this channel in a single transaction. Keep this field empty if you don't want to change the current set value.
ta: இந்த சேனலில் ஒரு பரிவர்த்தனையில் நீங்கள் அனுப்ப தயாராக இருக்கும் மிகச்சிறிய மதிப்பு. தற்போதைய தொகுப்பு மதிப்பை மாற்ற விரும்பவில்லை என்றால் இந்த புலத்தை காலியாக வைத்திருங்கள்.

# help_dialog_maxHTLC
source: The maximum value you are willing to forward on this channel in a single transaction. Keep this field empty if you don't want to change the current set value.
ta: இந்த சேனலில் ஒரு பரிவர்த்தனையில் நீங்கள் அனுப்ப தயாராக இருக்கும் அதிகபட்ச மதிப்பு. தற்போதைய தொகுப்பு மதிப்பை மாற்ற விரும்பவில்லை என்றால் இந்த புலத்தை காலியாக வைத்திருங்கள்.
