Repository: 247i/TACETr
Catalog: உரை/தானி/bitbanana-app-strings-*.po
Languages: ta

source: OK
ta: சரி

source: Cancel
ta: ரத்துசெய்

source: Lightning
ta: மின்னல்

source: On-Chain
ta: ஆன்-சங்கிலி

source: Share
ta: பங்கு

source: Copy
ta: நகலெடு

source: Paste
ta: ஒட்டு

source: Details
ta: விவரங்கள்

source: Amount
ta: தொகை

source: Memo
ta: மெமோ

# shareDialogTitle
source: Choose App
ta: பயன்பாட்டைத் தேர்வுசெய்க

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Copied to clipboard
ta: கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டது

source: Receive
ta: பெறுங்கள்

source: optional
ta: விரும்பினால்

source: Next
ta: அடுத்தது

source: Coming soon...
ta: விரைவில் வரும் ...

source: Need help?
ta: உதவி தேவையா?

source: offline
ta: இணையமில்லாமல்

source: Sent
ta: அனுப்பப்பட்டது

source: Received
ta: பெறப்பட்டது

source: Today
ta: இன்று

source: Yesterday
ta: நேற்று

source: Fee
ta: கட்டணம்

# confirmExit
source: Do you really want to quit BitBanana?
ta: நீங்கள் உண்மையில் பிட்பனானாவை விட்டு வெளியேற விரும்புகிறீர்களா?

source: or
ta: அல்லது

# max_amount
source: Maximum Amount:
ta: அதிகபட்ச தொகை:

# min_amount
source: Minimum Amount:
ta: குறைந்தபட்ச தொகை:

source: Retry
ta: மீண்டும் முயற்சிக்கவும்

source: Loading
ta: ஏற்றுகிறது

source: Pay
ta: செலுத்துங்கள்

source: Date
ta: திகதி

source: Expiry
ta: காலாவதி

source: Expired
ta: காலாவதியான

source: remaining
ta: மீதமுள்ள

source: Address
ta: முகவரி

source: Transaction ID
ta: பரிவர்த்தனை ஐடி

source: Channel
ta: வாய்க்கால்

source: Event
ta: நிகழ்வு

source: Preimage
ta: முன்கூட்டியே

source: Channel Event
ta: சேனல் நிகழ்வு

source: Scan QR-Code
ta: QR-குறியீட்டு ச்கேன்

source: Node
ta: கணு

# amount_invalid
source: The amount is invalid.
ta: தொகை தவறானது.

source: Success
ta: செய்

source: Suggested Peers
ta: பரிந்துரைக்கப்பட்ட சகாக்கள்

source: None
ta: எதுவுமில்லை

source: Install
ta: நிறுவவும்

# continue_string
source: Continue
ta: தொடரவும்

source: Withdraw
ta: திரும்பப் பெறுங்கள்

source: Unknown
ta: தெரியவில்லை

source: Scan
ta: ச்கேன்

source: Manually
ta: கைமுறையாக

source: Settings
ta: அமைப்புகள்

source: Support
ta: உதவி

source: Contribute
ta: பங்களிப்பு

source: Privacy
ta: தனியுரிமை

source: Payee
ta: பணம் செலுத்துபவர்

source: Open
ta: திற

source: Search
ta: தேடல்

source: Confirmations
ta: உறுதிப்படுத்தல்கள்

# maximum_abbreviation
source: max
ta: அதிகபட்சம்

source: Send
ta: அனுப்பு

source: Not connected
ta: இணைக்கப்படவில்லை

source: Save
ta: சேமி

source: Documentation
ta: ஆவணப்படுத்துதல்

source: Pubkey
ta: பப்கேச்

source: Description
ta: விவரம்

source: Percent
ta: விழுக்காடு

source: You
ta: நீங்கள்

source: Peer
ta: ஒப்பி

source: Off
ta: அணை

source: Available
ta: கிடைக்கிறது

source: Note
ta: குறிப்பு

source: Disconnect
ta: துண்டிக்கவும்

source: Reliability
ta: நம்பகத்தன்மை

source: Network
ta: பிணையம்

source: Type
ta: வகை

source: Duplicate
ta: நகல்

source: Username
ta: பயனர்பெயர்

source: Password
ta: கடவுச்சொல்

source: Backend
ta: பின்தளத்தில்

source: Remove
ta: அகற்று

source: Deactivate
ta: செயலிழக்கச் செய்யுங்கள்

source: Reactivate
ta: மீண்டும் செயல்படுத்தவும்

source: Active
ta: செயலில்

source: Inactive
ta: செயலற்றது

source: Terminated
ta: நிறுத்தப்பட்டது

source: Exhausted
ta: தீர்ந்துவிட்டது

source: ID
ta: ஐடி

source: State
ta: மாநிலம்

source: Label
ta: சிட்டை

source: Used
ta: பயன்படுத்தப்பட்டது

source: Unused
ta: பயன்படுத்தப்படாதது

source: Enable
ta: இயக்கு

source: Disable
ta: முடக்கு

source: Currency
ta: நாணயம்

source: Currencies
ta: நாணயங்கள்

# activity_receive
source: Receive
ta: பெறுங்கள்

# activity_send
source: Pay
ta: செலுத்துங்கள்

# activity_connectRemoteNode
source: Connect to remote node
ta: தொலை முனையுடன் இணைக்கவும்

# activity_manage_channels
source: Channels
ta: சேனல்கள்

# activity_manage_channels_closed
source: Closed Channels
ta: மூடிய சேனல்கள்

# activity_manage_nodes
source: Manage Nodes
ta: முனைகளை நிர்வகிக்கவும்

# activity_advanced_settings
source: Advanced Settings
ta: மேம்பட்ட அமைப்புகள்

# activity_node_details
source: Node Details
ta: முனை விவரங்கள்

# activity_identity
source: Node
ta: கணு

# activity_manage_contacts
source: Manage Contacts
ta: தொடர்புகளை நிர்வகிக்கவும்

# activity_manage_contacts_send_mode
source: Send to…
ta: அனுப்பு…

# activity_manage_contacts_open_channel_mode
source: Open channel with…
ta: உடன் திறந்த சேனல்…

# activity_contact_details
source: Contact Details
ta: தொடர்பு விவரங்கள்

# activity_manual_setup
source: Connection Data
ta: இணைப்பு தரவு

# activity_backup
source: Backup
ta: காப்புப்பிரதி

# activity_utxos
source: Coins (UTXOs)
ta: நாணயங்கள் (UTXOS)

# activity_forwarding
source: Routing
ta: ரூட்டிங்

# activity_routing_policy
source: Routing Policy
ta: ரூட்டிங் கொள்கை

# activity_peers
source: Peers
ta: சகாக்கள்

# activity_watchtowers
source: Watchtowers
ta: வாட்ச் டவர்ச்

# activity_watchtower
source: Watchtower
ta: வாட்ச் டவர்

# activity_bolt12_offers
source: Payment Codes
ta: கட்டணக் குறியீடுகள்

# activity_bolt12_create_offer
source: Create Payment Code
ta: கட்டணக் குறியீட்டை உருவாக்கவும்

# navigation_node
source: Node
ta: கணு

# navigation_history
source: History
ta: வரலாறு

# navigation_settings
source: Settings
ta: அமைப்புகள்

# pin_create
source: Create PIN
ta: முள் உருவாக்கவும்

# pin_confirm
source: Confirm PIN
ta: முள் உறுதிப்படுத்தவும்

# pin_enter
source: Enter PIN
ta: முள் உள்ளிடவும்

# pin_enter_old
source: Enter old PIN
ta: பழைய முள் உள்ளிடவும்

# pin_enter_new
source: Enter new PIN
ta: புதிய முள் உள்ளிடவும்

# pin_confirm_new
source: Confirm new PIN
ta: புதிய முள் உறுதிப்படுத்தவும்

# pin_entered_wrong
source: Wrong PIN
ta: தவறான முள்

# pin_entered_wrong_wait
source: Wait %1$s seconds.
ta: %1$s வினாடிகள் காத்திருங்கள்.

source: PIN changed!
ta: முள் மாற்றப்பட்டது!

# requested_payment
source: Requested
ta: கோரப்பட்டது

# request_expired
source: Expired
ta: காலாவதியான

source: Internal
ta: உள்

# opened_channel
source: Channel opened
ta: சேனல் திறக்கப்பட்டது

# closed_channel
source: Channel closed
ta: சேனல் மூடப்பட்டது

# force_closed_channel
source: Channel force closed
ta: சேனல் படை மூடப்பட்டது

source: Filter transactions
ta: பரிவர்த்தனைகளை வடிகட்டவும்

source: Normal Payments
ta: சாதாரண கொடுப்பனவுகள்

source: Expired Requests
ta: காலாவதியான கோரிக்கைகள்

source: No transactions
ta: பரிவர்த்தனைகள் இல்லை

# channel_capacity
source: Capacity
ta: திறன்

# channel_local_balance
source: Your Balance
ta: உங்கள் இருப்பு

# channel_remote_balance
source: Remote Balance
ta: தொலைநிலை சமநிலை

# channel_no_alias
source: Unnamed
ta: பெயரில்லாதது

# channel_remote_public_key
source: Remote Public Key
ta: தொலைதூர பொது விசை

# channel_funding_transaction
source: Funding Transaction
ta: பரிவர்த்தனை பொருள்

# channel_state_open
source: open
ta: திற

# channel_state_offline
source: offline
ta: இணையமில்லாமல்

# channel_state_pending_open
source: pending open
ta: திறந்த நிலுவையில்

# channel_state_pending_closing
source: pending close
ta: நெருக்கமாக நிலுவையில் உள்ளது

# channel_state_pending_force_closing
source: pending force close
ta: படை நெருக்கமாக நிலுவையில் உள்ளது

# channel_state_waiting_close
source: waiting close
ta: நெருக்கமாக காத்திருக்கிறது

source: No channels
ta: சேனல்கள் இல்லை

# channel_closing_transaction
source: Closing Transaction
ta: பரிவர்த்தனை நிறைவு

# channel_close
source: Close Channel
ta: சேனலை மூடு

# channel_close_success
source: Channel closing successfully initiated
ta: சேனல் நிறைவு வெற்றிகரமாக தொடங்கப்பட்டது

# channel_close_force
source: Force Close Channel
ta: மூடு சேனலை கட்டாயப்படுத்துங்கள்

source: Channel close error
ta: சேனல் நெருக்கமான பிழை

# channel_close_confirmation
source: Do you really want to close the channel with: %s
ta: சேனலை மூட விரும்புகிறீர்களா: %s

# channel_close_force_confirmation
source: Do you really want to force close the channel with: %1$s Your funds will be locked up for %2$s.
ta: சேனலை மூட கட்டாயப்படுத்த விரும்புகிறீர்களா: %1$s உங்கள் பொருள் %2$s க்கு பூட்டப்படும்.

# channel_close_time
source: Time until closure
ta: மூடப்படும் வரை நேரம்

# channel_open
source: Open Channel
ta: திறந்த சேனல்

# channel_open_success
source: Channel opening successfully initiated
ta: சேனல் திறப்பு வெற்றிகரமாக தொடங்கப்பட்டது

source: Channel open error
ta: சேனல் திறந்த பிழை

source: Private channel
ta: தனியார் சேனல்

# channel_visibility_private
source: private
ta: தனிப்பட்ட

# channel_visibility_public
source: public
ta: பொது

# channel_visibility
source: Visibility
ta: விழிமை

# channel_close_type
source: Close type
ta: மூடு வகை

# channel_close_type_coop
source: Cooperative
ta: கூட்டுறவு

# channel_close_type_force_close
source: Force Close
ta: மூடு

# channel_close_type_breach
source: Breach
ta: மீறல்

# setup_connect_heading
source: How do you want to use BitBanana?
ta: பிட்பனானாவை எவ்வாறு பயன்படுத்த விரும்புகிறீர்கள்?

# setup_connect_local_description
source: Create a wallet on this phone.
ta: இந்த தொலைபேசியில் ஒரு பணப்பையை உருவாக்கவும்.

# setup_connect_local_button
source: Create Wallet
ta: பணப்பையை உருவாக்கவும்

# setup_connect_remote_description
source: Remote control your own node.
ta: தொலைநிலை உங்கள் சொந்த முனையை கட்டுப்படுத்தவும்.

# setup_connect_remote_button
source: Connect to Remote Node
ta: தொலை முனையுடன் இணைக்கவும்

# demo_setupNodeBtn
source: Connect Node
ta: முனை இணைக்கவும்

# demo_setupNodeFirst
source: You first have to connect to a node.
ta: நீங்கள் முதலில் ஒரு முனையுடன் இணைக்க வேண்டும்.

# demo_setupNodeFirstAvatar
source: You first have to connect to a node, before you can see your node information and your avatar.
ta: உங்கள் முனை செய்தி மற்றும் உங்கள் அவதாரத்தைக் காண்பதற்கு முன்பு, நீங்கள் முதலில் ஒரு முனையுடன் இணைக்க வேண்டும்.

source: Send lightning payment
ta: மின்னல் கட்டணத்தை அனுப்புங்கள்

source: Send on-chain payment
ta: ஆன்-சங்கிலி கட்டணத்தை அனுப்பவும்

# send_sendPayment
source: Send payment
ta: கட்டணம் அனுப்புங்கள்

# send_success
source: Payment successful
ta: கட்டணம் செய்

# send_fail
source: Payment failed
ta: கட்டணம் தோல்வியுற்றது

# send_SendOnChainInstead
source: Send On-Chain
ta: ஆன்-சங்கிலியை அனுப்பு

# receive_generateRequest
source: Generate Request
ta: கோரிக்கையை உருவாக்குங்கள்

# receive_generateRequest_failed
source: Request generation failed.
ta: கோரிக்கை தலைமுறை தோல்வியடைந்தது.

# receive_lightning_request
source: Lightning Request
ta: மின்னல் கோரிக்கை

# receive_on_chain_request
source: On-Chain Request
ta: சங்கிலி கோரிக்கை

# receive_noActiveChannels
source: To receive Bitcoin over the lightning network, you first have to open channels.
ta: மின்னல் நெட்வொர்க்கில் பிட்காயினைப் பெற, நீங்கள் முதலில் சேனல்களைத் திறக்க வேண்டும்.

# receive_noIncomeBalance
source: To receive Bitcoin over the lightning network, at least one of your channels needs some balance on your counterpartys side. To achieve that, you have to spend something on lightning network first. In the manage channels area you can always see how much you are able to send or receive over the lightning network right now.
ta: மின்னல் நெட்வொர்க்கில் பிட்காயினைப் பெற, உங்கள் சேனல்களில் குறைந்தபட்சம் உங்கள் எதிர் பக்கத்தில் சில சமநிலை தேவை. அதை அடைய, நீங்கள் முதலில் மின்னல் நெட்வொர்க்கில் ஏதாவது செலவிட வேண்டும். நிர்வகி சேனல்கள் பகுதியில் நீங்கள் இப்போது மின்னல் நெட்வொர்க்கை எவ்வளவு அனுப்ப முடியும் அல்லது பெற முடியும் என்பதை நீங்கள் எப்போதும் பார்க்கலாம்.

# receive_requestFullfilled
source: Invoice paid
ta: விலைப்பட்டியல் பணம்

# guardian_doNotShowAgain
source: Don't show again.
ta: மீண்டும் காட்ட வேண்டாம்.

# guardian_Title
source: Attention
ta: கவனம்

# guardian_reset
source: All security warnings are enabled again.
ta: அனைத்து பாதுகாப்பு எச்சரிக்கைகளும் மீண்டும் இயக்கப்பட்டுள்ளன.

# guardian_copyToClipboard_onChain
source: If you copy this data to your clipboard, other apps (also malicious ones) are able to access and modify it. To be sure nothing has changed while pasting, compare the beginning to: %1$s
ta: இந்தத் தரவை உங்கள் கிளிப்போர்டில் நகலெடுத்தால், பிற பயன்பாடுகளும் (தீங்கிழைக்கும்) அதை அணுகவும் மாற்றவும் முடியும். ஒட்டும்போது எதுவும் மாறவில்லை என்பதை உறுதிப்படுத்த, தொடக்கத்தை ஒப்பிடுக: %1$s

# guardian_copyToClipboard_lightning
source: If you copy this data to your clipboard, other apps (also malicious ones) are able to access and modify it. To be sure nothing has changed while pasting, compare the end to: %1$s
ta: இந்தத் தரவை உங்கள் கிளிப்போர்டில் நகலெடுத்தால், பிற பயன்பாடுகளும் (தீங்கிழைக்கும்) அதை அணுகவும் மாற்றவும் முடியும். ஒட்டும்போது எதுவும் மாறவில்லை என்பதை உறுதிப்படுத்த, முடிவை ஒப்பிடுக: %1$s

# guardian_pasteFromClipboard
source: Always double check the last 3 to 5 digits when pasting from clipboard. A malicious App might have changed the address in the background without you noticing it.
ta: கிளிப்போர்டில் இருந்து ஒட்டும்போது கடைசி 3 முதல் 5 இலக்கங்களை எப்போதும் இருமுறை சரிபார்க்கவும். தீங்கிழைக்கும் பயன்பாடு நீங்கள் கவனிக்காமல் பின்னணியில் உள்ள முகவரியை மாற்றியிருக்கலாம்.

# guardian_disableScrambledPin
source: If not scrambled it is easy to guess your PIN just by watching your finger movements.
ta: துருவல் இல்லாவிட்டால், உங்கள் விரல் அசைவுகளைப் பார்ப்பதன் மூலம் உங்கள் முள் யூகிப்பது எளிது.

# guardian_disableScreenProtection
source: If you allow screen recording, malicious software might be able to record a video or take screenshots while you are using BitBanana. We recommend to deactivate this only while you want to record a video or take a screenshot.
ta: திரை பதிவை நீங்கள் அனுமதித்தால், தீங்கிழைக்கும் மென்பொருள் நீங்கள் பிட்பனானாவைப் பயன்படுத்தும் போது ஒரு வீடியோவைப் பதிவு செய்ய அல்லது திரை சாட்களை எடுக்க முடியும். நீங்கள் ஒரு வீடியோவைப் பதிவு செய்ய விரும்பும் போது அல்லது திரை காட்சி எடுக்க விரும்பும் போது மட்டுமே இதை செயலிழக்க பரிந்துரைக்கிறோம்.

# guardian_highOnChainFee
source: You are about to pay %1$s%% in network fees. Possible solutions: - try a lightning payment instead - select lower fee, wait longer - try again later - transact a bigger amount Do you want to continue anyway?
ta: பிணையம் கட்டணத்தில்%1$s %% செலுத்த உள்ளீர்கள். சாத்தியமான தீர்வுகள்: - அதற்கு பதிலாக மின்னல் கட்டணத்தை முயற்சிக்கவும் - குறைந்த கட்டணத்தைத் தேர்ந்தெடுக்கவும், அதிக நேரம் காத்திருங்கள் - பின்னர் மீண்டும் முயற்சிக்கவும் - ஒரு பெரிய தொகையை பரிவர்த்தனை செய்யுங்கள் எப்படியும் தொடர விரும்புகிறீர்களா?

# guardian_oldExchangeRate
source: You requested an amount as fiat value, but your exchange rate data is old (retrieved %1$s hours ago). Make sure you have an internet connection or consider requesting directly in Bitcoin. Do you want to continue anyway?
ta: நீங்கள் ஒரு தொகையை ஃபியட் மதிப்பாகக் கோரினீர்கள், ஆனால் உங்கள் பரிமாற்ற வீத தரவு பழையது (மீட்டெடுக்கப்பட்டது %1$s மணி நேரத்திற்கு முன்பு). உங்களிடம் இணைய இணைப்பு இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் அல்லது பிட்காயினில் நேரடியாகக் கோருவதைக் கருத்தில் கொள்ளுங்கள். எப்படியும் தொடர விரும்புகிறீர்களா?

# guardian_remoteConnect
source: Are you sure you want to connect to %1$s Please check the hostname carefully.
ta: நீங்கள் நிச்சயமாக இணைக்க விரும்புகிறீர்களா? %1$s ஓச்ட்பெயரை கவனமாக சரிபார்க்கவும்.

# guardian_externalLink
source: You are about to open a link with sensitive data in your browser. While BitBanana anonymizes all your traffic with the Tor network, your browser does not. If you want to keep this data private use a Tor browser to open the link.
ta: உங்கள் உலாவியில் முக்கியமான தரவுகளுடன் இணைப்பைத் திறக்க உள்ளீர்கள். பிட்பனானா டோர் நெட்வொர்க்குடன் உங்கள் எல்லா போக்குவரத்தையும் அநாமதேயமாக வைத்திருக்கும்போது, ​​உங்கள் உலாவி இல்லை. இந்தத் தரவை தனிப்பட்டதாக வைத்திருக்க விரும்பினால், இணைப்பைத் திறக்க TOR உலாவியைப் பயன்படுத்தவும்.

# guardian_oldNodeSoftwareVersion
source: It's time for an update! The node you're connected to is operating on an outdated version of %1$s. Versions preceding %2$s are no longer supported by BitBanana.
ta: புதுப்பிப்புக்கான நேரம் இது! நீங்கள் இணைக்கப்பட்ட முனை %1$s காலாவதியான பதிப்பில் இயங்குகிறது. %2$s க்கு முந்தைய பதிப்புகள் இனி பிட்பனானாவால் ஆதரிக்கப்படுவதில்லை.

# guardian_zero_amount_invoice
source: This invoice does not specify an amount. Though very unlikely, invoices without a specific amount can be exploited and the recipient will receive less than expected in that case. If possible use an invoice with a specific amount.
ta: இந்த விலைப்பட்டியல் ஒரு தொகையை குறிப்பிடவில்லை. மிகவும் சாத்தியமில்லை என்றாலும், ஒரு குறிப்பிட்ட தொகை இல்லாத விலைப்பட்டியல் சுரண்டப்படலாம், மேலும் பெறுநர் அந்த விசயத்தில் எதிர்பார்த்ததை விட குறைவாகவே பெறுவார். முடிந்தால் ஒரு குறிப்பிட்ட தொகையுடன் விலைப்பட்டியல் பயன்படுத்தவும்.

# guardian_certificate_verification
source: If certificate verification is disabled, you are vulnerable to a man-in-the-middle attack. Only do this if you know what you are doing. It is advised to get the certificate setup correct instead. This means the certificate from your node has to have the hostname included that you are using in this connection setting. Add the hostname to tlsextradomain in the lnd.conf before recreating the certificate.
ta: சான்றிதழ் சரிபார்ப்பு முடக்கப்பட்டிருந்தால், நீங்கள் ஒரு மனித-நடுத்தர தாக்குதலுக்கு ஆளாக நேரிடும். நீங்கள் என்ன செய்கிறீர்கள் என்று உங்களுக்குத் தெரிந்தால் மட்டுமே இதைச் செய்யுங்கள். அதற்கு பதிலாக சான்றிதழ் அமைப்பை சரியாகப் பெற அறிவுறுத்தப்படுகிறது. இதன் பொருள் உங்கள் முனையிலிருந்து சான்றிதழ் இந்த இணைப்பு அமைப்பில் நீங்கள் பயன்படுத்தும் ஓச்ட்பெயர் சேர்க்கப்பட வேண்டும். சான்றிதழை மீண்டும் உருவாக்கும் முன் lnd.conf இல் tlsextradomain இல் ஓச்ட்பெயரைச் சேர்க்கவும்.

# guardian_backup_overrides_existing_data
source: Some data already exists! Restoring a backup will delete all following data before restoring: - Node Connection Data - Contacts Continue?
ta: சில தரவு ஏற்கனவே உள்ளது! காப்புப்பிரதியை மீட்டெடுப்பது மீட்டமைப்பதற்கு முன் பின்வரும் எல்லா தரவையும் நீக்கிவிடும்: - முனை இணைப்பு தரவு - தொடர்புகள் தொடரவா?

# guardian_invoices_without_specified_amount
source: Invoices lacking a specific amount pose a security risk. Though highly unlikely, intermediaries along the route may exploit such invoices, causing the recipient to receive less than expected without detection. No such risk exists in payments over a direct channel.
ta: ஒரு குறிப்பிட்ட அளவு இல்லாத விலைப்பட்டியல் பாதுகாப்பு அபாயத்தை ஏற்படுத்துகிறது. மிகவும் சாத்தியமில்லை என்றாலும், பாதையில் உள்ள இடைத்தரகர்கள் அத்தகைய விலைப்பட்டியலைப் பயன்படுத்திக் கொள்ளலாம், இதனால் பெறுநர் கண்டறிதல் இல்லாமல் எதிர்பார்த்ததை விட குறைவாகவே பெறுவார். நேரடி சேனலின் மூலம் பணம் செலுத்துவதில் அத்தகைய இடர் எதுவும் இல்லை.

# guardian_custodial_lndhub
source: This is a LndHub account. Unless you are the host of the LndHub service, this arrangement is custodial. The entity managing the service has control over your money and can view your transaction history. Only deposit what you're willing to trust with them.
ta: இது ஒரு lndhub கணக்கு. நீங்கள் lndhub சேவையின் தொகுப்பாளராக இல்லாவிட்டால், இந்த ஏற்பாடு காவல்துறை. சேவையை நிர்வகிக்கும் நிறுவனம் உங்கள் பணத்தின் மீது கட்டுப்பாட்டைக் கொண்டுள்ளது மற்றும் உங்கள் பரிவர்த்தனை வரலாற்றைக் காணலாம். அவர்களுடன் நீங்கள் நம்பத் தயாராக இருப்பதை மட்டுமே டெபாசிட் செய்யுங்கள்.

# guardian_low_onchain_fee
source: The current fee estimation suggests that this transaction with a fee rate of %1$d sat/vB may never be confirmed. Consider increasing the fee to avoid your transaction getting stuck for a long time. Do you want to proceed anyway?
ta: தற்போதைய கட்டண மதிப்பீடு %1$d SAT/VB இன் கட்டண விகிதத்துடன் இந்த பரிவர்த்தனை ஒருபோதும் உறுதிப்படுத்தப்படாது என்று கூறுகிறது. உங்கள் பரிவர்த்தனை நீண்ட காலமாக சிக்கித் தவிப்பதைத் தவிர்க்க கட்டணத்தை அதிகரிப்பதைக் கவனியுங்கள். நீங்கள் எப்படியும் தொடர விரும்புகிறீர்களா?

# guardian_remove_watchtower
source: By removing the watchtower, all current sessions associated with the tower will be terminated. Some sessions are not yet exhausted. Remaining backups will get lost and won't be refunded, even if you paid for the service.
ta: காவற்கோபுரத்தை அகற்றுவதன் மூலம், கோபுரத்துடன் தொடர்புடைய அனைத்து தற்போதைய அமர்வுகளும் நிறுத்தப்படும். சில அமர்வுகள் இன்னும் தீர்ந்துவிடவில்லை. மீதமுள்ள காப்புப்பிரதிகள் தொலைந்து போகும், நீங்கள் சேவைக்கு பணம் செலுத்தினாலும் திருப்பித் தரப்பட மாட்டீர்கள்.

# guardian_custodial_lnd_accounts
source: You only have access to an account on the LND node. Unless you are the node operator, this arrangement is custodial. The person managing the node has control over your money and can view your transaction history. Only deposit what you're willing to trust with that person.
ta: எல்.என்.டி முனையில் ஒரு கணக்கை மட்டுமே அணுகலாம். நீங்கள் முனை ஆபரேட்டராக இல்லாவிட்டால், இந்த ஏற்பாடு காவலில் உள்ளது. முனையை நிர்வகிக்கும் நபருக்கு உங்கள் பணத்தின் மீது கட்டுப்பாடு உள்ளது மற்றும் உங்கள் பரிவர்த்தனை வரலாற்றைக் காணலாம். அந்த நபருடன் நீங்கள் நம்பத் தயாராக இருப்பதை மட்டுமே டெபாசிட் செய்யுங்கள்.

# settings_custom
source: Custom …
ta: வழக்கம்…

# settings_category_general
source: General
ta: பொது

# settings_category_security
source: Security
ta: பாதுகாப்பு

# settings_category_help
source: Help
ta: உதவி

# settings_category_advanced
source: Advanced
ta: மேம்பட்ட

# settings_btcUnit
source: Bitcoin Unit
ta: பிட்காயின் அலகு

# settings_currency
source: Second Unit
ta: இரண்டாவது அலகு

# settings_language
source: Language
ta: மொழி

# settings_tor
source: Tor
ta: டோர்

# settings_tor_summary
source: Anonymize all web traffic using the Tor network. This only affects things like fetching exchange rates or interacting with LNURL services. Whether or not Tor is used to connect to a node can be set for each node individually in its connection settings.
ta: TOR நெட்வொர்க்கைப் பயன்படுத்தி அனைத்து வலை போக்குவரத்தையும் அநாமதேயப்படுத்தவும். இது பரிமாற்ற விகிதங்களைப் பெறுவது அல்லது LNURL சேவைகளுடன் தொடர்புகொள்வது போன்றவற்றை மட்டுமே பாதிக்கிறது. ஒரு முனையுடன் இணைக்க டோர் பயன்படுத்தப்படுகிறாரா இல்லையா என்பது ஒவ்வொரு முனைக்கும் தனித்தனியாக அதன் இணைப்பு அமைப்புகளில் அமைக்கப்படலாம்.

# settings_scan_clipboard
source: Check clipboard
ta: கிளிப்போர்டை சரிபார்க்கவும்

# settings_scan_clipboard_summary
source: Automatically check clipboard for data BitBanana can handle.
ta: பிட்பனானா கையாளக்கூடிய தரவுகளுக்கான கிளிப்போர்டை தானாகவே சரிபார்க்கவும்.

# settings_hapticPin
source: Haptic PIN Feedback
ta: ஆப்டிக் முள் கருத்து

# settings_systemLanguage
source: System Language
ta: கணினி மொழி

# settings_payer_data
source: Payment identification
ta: கட்டண அடையாளம்

# settings_manageChannels
source: Manage Lightning Channels
ta: மின்னல் சேனல்களை நிர்வகிக்கவும்

# settings_scramblePin
source: Scramble PIN Screen
ta: துருவல் முள் திரை

# settings_preventScreenRecording
source: Prevent Screen Recording
ta: திரை பதிவைத் தடுக்கவும்

# settings_hideTotalBalance_explanation
source: The total balance is hidden now. Tap the BitBanana logo on the home screen to reveal it.
ta: மொத்த இருப்பு இப்போது மறைக்கப்பட்டுள்ளது. அதை வெளிப்படுத்த முகப்புத் திரையில் பிட்பனானா லோகோவைத் தட்டவும்.

# settings_hideAllBalances_explanation
source: All balances are blurred now, and the total balance is hidden behind the BitBanana logo. Simply tap any blurred field or the BitBanana logo to temporarily reveal your balance.
ta: எல்லா நிலுவைகளும் இப்போது மங்கலாக உள்ளன, மேலும் மொத்த இருப்பு பிட்பனானா லோகோவின் பின்னால் மறைக்கப்பட்டுள்ளது. உங்கள் சமநிலையை தற்காலிகமாக வெளிப்படுத்த மங்கலான புலம் அல்லது பிட்பனானா லோகோவைத் தட்டவும்.

# settings_resetSecurityWarnings
source: Reset Security Warnings
ta: பாதுகாப்பு எச்சரிக்கைகளை மீட்டமைக்கவும்

# settings_help
source: Need Help?
ta: உதவி தேவையா?

# settings_reportIssue
source: Report an Issue
ta: ஒரு சிக்கலைப் புகாரளிக்கவும்

# settings_about
source: About BitBanana
ta: பிட்பனானா பற்றி

# settings_advanced_settings
source: Advanced Settings
ta: மேம்பட்ட அமைப்புகள்

# settings_restartRequired
source: BitBanana will be restarted to make this change. Do you want to continue?
ta: இந்த மாற்றத்தை செய்ய பிட்பனானா மறுதொடக்கம் செய்யப்படும். நீங்கள் தொடர விரும்புகிறீர்களா?

# settings_enableBiometrics
source: Enable biometric authentication
ta: பயோமெட்ரிக் அங்கீகாரத்தை இயக்கவும்

# settings_hideBalance
source: Hide balance
ta: சமநிலையை மறைக்கவும்

# settings_hideBalanceType_total
source: Only total balance
ta: மொத்த இருப்பு மட்டுமே
