Repository: 247i/TACETr
Catalog: உரை/தானி/bitbanana-app-strings-*.po
Languages: ta

# help_dialog_settings_features
source: BitBanana's commitment to also serving experts means offering a rich set of features. However, we recognize that not everyone may require all of these functionalities. With our customizable settings, you have the flexibility to hide any features that are not relevant to your needs, ensuring a tailored experience.
ta: நிபுணர்களுக்கு பணி செய்வதற்கான பிட்பனானாவின் அர்ப்பணிப்பு என்பது ஒரு சிறந்த அம்சங்களை வழங்குவதாகும். இருப்பினும், அனைவருக்கும் இந்த செயல்பாடுகள் அனைத்தும் தேவையில்லை என்பதை நாங்கள் அறிவோம். எங்கள் தனிப்பயனாக்கக்கூடிய அமைப்புகளுடன், உங்கள் தேவைகளுக்கு பொருந்தாத எந்த அம்சங்களையும் மறைக்க உங்களுக்கு நெகிழ்வுத்தன்மை உள்ளது, இது ஒரு அனுபவத்தை உறுதி செய்கிறது.

# help_dialog_stealth_mode
source: Utilize stealth mode to defend your phone against quick physical searches, creating the illusion that BitBanana isn't present on your device. This is achieved by replacing your app's icon and name and launching a decoy app. However, note that the app's icon and name won't be changed in the app list in your system settings. It is not a perfect solution, but it helps to make the presence of your Bitcoin software less obvious.
ta: விரைவான உடல் தேடல்களுக்கு எதிராக உங்கள் தொலைபேசியைப் பாதுகாக்க திருட்டுத்தனமான பயன்முறையைப் பயன்படுத்துங்கள், உங்கள் சாதனத்தில் பிட்பனானா இல்லை என்ற மாயையை உருவாக்குகிறது. உங்கள் பயன்பாட்டின் படவுரு மற்றும் பெயரை மாற்றுவதன் மூலமும், சிதைவு பயன்பாட்டைத் தொடங்குவதன் மூலமும் இது அடையப்படுகிறது. இருப்பினும், உங்கள் கணினி அமைப்புகளில் பயன்பாட்டு பட்டியலில் பயன்பாட்டின் படவுரு மற்றும் பெயர் மாற்றப்படாது என்பதை நினைவில் கொள்க. இது சரியான தீர்வு அல்ல, ஆனால் இது உங்கள் பிட்காயின் மென்பொருளின் இருப்பை குறைவாகவே செய்ய உதவுகிறது.

# help_dialog_peers
source: This list displays all the peers currently connected to your node. Peers are essentially other nodes operating within the network. They collaborate by exchanging information, ensuring each node has a clear view of the network's status. As an example, when your node wants to change something, such as updating a channel policy, it notifies all the peers it's connected to. These peers, in turn, relay the information to their own connected peers, creating a ripple effect that ensures the entire network is informed. Your node establishes connections with peers automatically, typically prioritizing those peers with whom you have active channels. Nevertheless, you maintain the flexibility to manually establish or break connections and access more details about your peers through this interface.
ta: இந்த பட்டியல் உங்கள் முனையுடன் தற்போது இணைக்கப்பட்டுள்ள அனைத்து சகாக்களையும் காட்டுகிறது. சகாக்கள் அடிப்படையில் பிணையத்திற்குள் செயல்படும் பிற முனைகள். தகவல்களைப் பரிமாறிக்கொள்வதன் மூலம் அவை ஒத்துழைக்கின்றன, ஒவ்வொரு முனைக்கும் நெட்வொர்க்கின் நிலையைப் பற்றிய தெளிவான பார்வை இருப்பதை உறுதிசெய்கிறது. உதாரணமாக, உங்கள் முனை சேனல் கொள்கையை புதுப்பிப்பது போன்ற ஒன்றை மாற்ற விரும்பும்போது, ​​அது இணைக்கப்பட்டுள்ள அனைத்து சகாக்களுக்கும் அறிவிக்கிறது. இந்த சகாக்கள், தகவல்களை தங்கள் சொந்த இணைக்கப்பட்ட சகாக்களுக்கு அனுப்பி, ஒரு சிற்றலை விளைவை உருவாக்குகிறார்கள், இது முழு நெட்வொர்க்கும் தெரிவிக்கப்படுவதை உறுதி செய்கிறது. உங்கள் முனை தானாகவே சகாக்களுடன் தொடர்புகளை நிறுவுகிறது, பொதுவாக நீங்கள் செயலில் சேனல்கள் வைத்திருக்கும் சகாக்களுக்கு முன்னுரிமை அளிக்கிறது. ஆயினும்கூட, இணைப்புகளை கைமுறையாக நிறுவ அல்லது உடைக்க நெகிழ்வுத்தன்மையை நீங்கள் பராமரிக்கிறீர்கள் மற்றும் இந்த இடைமுகத்தின் மூலம் உங்கள் சகாக்களைப் பற்றிய கூடுதல் விவரங்களை அணுகலாம்.

# help_dialog_scanPeer
source: QR-Codes containing the following are valid: - pubkey - pubkey@host - pubkey@host:port
ta: பின்வருவனவற்றைக் கொண்ட QR-குறியீடுகள் செல்லுபடியாகும்: - பப்கே - பப்கே@ஓச்ட் - பப்கே@ஓச்ட்: துறைமுகம்

# help_dialog_lnurl_auth
source: Your node serves as a private authentication method for accessing a service. The procedure is based on message-signing and does not share any information about your node. If your node stops operating, you will lose the ability to log in to the associated account.
ta: ஒரு சேவையை அணுகுவதற்கான தனிப்பட்ட அங்கீகார முறையாக உங்கள் முனை செயல்படுகிறது. செயல்முறை செய்தி கையொப்பமிடுவதை அடிப்படையாகக் கொண்டது மற்றும் உங்கள் முனை பற்றிய எந்த தகவலையும் பகிர்ந்து கொள்ளாது. உங்கள் முனை செயல்படுவதை நிறுத்தினால், தொடர்புடைய கணக்கில் உள்நுழையும் திறனை இழப்பீர்கள்.

# help_dialog_vpn_automation
source: This setting makes using a VPN more convenient by automating it. You can still connect using a VPN even if you do not choose anything here, but then you have to start and stop the VPN manually whenever you want to connect.
ta: இந்த அமைப்பு ஒரு VPN ஐப் பயன்படுத்துவதன் மூலம் அதை தானியக்கமாக்குவதன் மூலம் மிகவும் வசதியாக இருக்கும். நீங்கள் இங்கே எதையும் தேர்வு செய்யாவிட்டாலும் கூட நீங்கள் ஒரு VPN ஐப் பயன்படுத்தி இணைக்கலாம், ஆனால் நீங்கள் இணைக்க விரும்பும் போதெல்லாம் VPN ஐ கைமுறையாகத் தொடங்கி நிறுத்த வேண்டும்.

# help_dialog_node_nickname
source: The name is only used to organize your nodes in BitBanana. It has no other effect.
ta: பிட்பனானாவில் உங்கள் முனைகளை ஒழுங்கமைக்க மட்டுமே பெயர் பயன்படுத்தப்படுகிறது. இது வேறு எந்த விளைவையும் கொண்டிருக்கவில்லை.

# help_dialog_watchtowers
source: For a watchtower to function, some data must be exchanged with it. This results in some information being disclosed to the watchtower's maintainer. The following non encrypted data will be disclosed: - Frequency of channel updates Channel balances stay confidential unless your partner cheats and the watchtower detects it. In this scenario, you'll reveal the balances to ensure the protection of your funds. Keep in mind that a watchtower service cannot take your funds. Their only action during a breach is to initiate a punishment transaction, with the funds going directly to you.
ta: ஒரு காவற்கோபுரம் செயல்பட, சில தரவு அதனுடன் பரிமாறிக்கொள்ளப்பட வேண்டும். இதன் விளைவாக சில தகவல்கள் காவற்கோபுரத்தின் பராமரிப்பாளருக்கு வெளிப்படுத்தப்படுகின்றன. பின்வரும் மறைகுறியாக்கப்படாத தரவு வெளிப்படுத்தப்படும்: - சேனல் புதுப்பிப்புகளின் அதிர்வெண் உங்கள் பங்குதாரர் ஏமாற்றி, காவற்கோபுரம் அதைக் கண்டறியாவிட்டால் சேனல் நிலுவைகள் ரகசியமாக இருக்கும். இந்த சூழ்நிலையில், உங்கள் நிதிகளின் பாதுகாப்பை உறுதி செய்வதற்கான நிலுவைகளை நீங்கள் வெளிப்படுத்துவீர்கள். ஒரு காவற்கோபுர பணி உங்கள் நிதியை எடுக்க முடியாது என்பதை நினைவில் கொள்ளுங்கள். மீறலின் போது அவர்களின் ஒரே நடவடிக்கை ஒரு தண்டனை பரிவர்த்தனையைத் தொடங்குவதாகும், பொருள் உங்களுக்கு நேரடியாகச் செல்கிறது.

# help_dialog_own_watchtower
source: This is your watchtower on the lightning network. When you tap on the avatar image you will reveal a QR-Code. This code can be scanned by others to add your watchtower to their list, allowing it to oversee their channels. Be careful, this consumes resources, so avoid sharing this connection data publicly on the internet. This avatar is unique. It was automatically generated based on your public key and cannot be changed.
ta: இது மின்னல் நெட்வொர்க்கில் உங்கள் காவற்கோபுரம். அவதார் படத்தைத் தட்டும்போது நீங்கள் ஒரு QR-குறியீட்டை வெளிப்படுத்துவீர்கள். இந்த குறியீட்டை மற்றவர்களால் உங்கள் காவற்கோபுரத்தை அவற்றின் பட்டியலில் சேர்க்கலாம், இது அவர்களின் சேனல்களை மேற்பார்வையிட அனுமதிக்கிறது. கவனமாக இருங்கள், இது வளங்களை பயன்படுத்துகிறது, எனவே இந்த இணைப்பு தரவை இணையத்தில் பகிரங்கமாக பகிர்வதைத் தவிர்க்கவும். இந்த அவதாரம் தனித்துவமானது. இது உங்கள் பொது விசையின் அடிப்படையில் தானாக உருவாக்கப்பட்டது, அதை மாற்ற முடியாது.

# help_dialog_scan_watchtower
source: QR-Codes containing the following are valid: - pubkey@host:port
ta: பின்வருவனவற்றைக் கொண்ட QR-குறியீடுகள் செல்லுபடியாகும்: - பப்கே@ஓச்ட்: துறைமுகம்

# help_dialog_bolt12_label
source: This label is only meant to organize your payment codes and will not be visible to anyone using the payment code.
ta: இந்த சிட்டை உங்கள் கட்டணக் குறியீடுகளை ஒழுங்கமைப்பதற்காக மட்டுமே மற்றும் கட்டணக் குறியீட்டைப் பயன்படுத்தும் எவருக்கும் தெரியாது.

# help_dialog_bolt12_description
source: Anyone using the payment code will see this description.
ta: கட்டணக் குறியீட்டைப் பயன்படுத்தும் எவரும் இந்த விளக்கத்தைக் காண்பார்கள்.

# help_dialog_offers
source: Payment codes can be used multiple times. Anyone with the code can make a payment to you without requiring your immediate involvement. However, your node must be online for the payment to go through. Additionally, payment codes offer advanced features like recurring payments and enhanced privacy for the receiver.
ta: கட்டணக் குறியீடுகளை பல முறை பயன்படுத்தலாம். உங்கள் உடனடி ஈடுபாடு தேவையில்லாமல் குறியீடு உள்ள எவரும் உங்களுக்கு பணம் செலுத்தலாம். இருப்பினும், பணம் செலுத்துவதற்கு உங்கள் முனை ஆன்லைனில் இருக்க வேண்டும். கூடுதலாக, கட்டணக் குறியீடுகள் தொடர்ச்சியான கொடுப்பனவுகள் மற்றும் பெறுநருக்கு மேம்பட்ட தனியுரிமை போன்ற மேம்பட்ட அம்சங்களை வழங்குகின்றன.

# help_dialog_settings_currencies
source: Tapping any amount field allows you to change between the currencies you've set up here. If you only select Bitcoin units, the app will stop contacting exchange rate providers.
ta: எந்தவொரு தொகை புலத்தைத் தட்டினால், நீங்கள் இங்கே அமைத்த நாணயங்களுக்கு இடையில் மாற்ற உங்களை அனுமதிக்கிறது. நீங்கள் பிட்காயின் அலகுகளை மட்டுமே தேர்ந்தெடுத்தால், பயன்பாடு பரிமாற்ற வீத வழங்குநர்களைத் தொடர்புகொள்வதை நிறுத்திவிடும்.

source: Node Name
ta: முனை பெயர்

# name_duplicate
source: Name of duplicate
ta: நகலின் பெயர்

source: Name
ta: பெயர்

source: Delete
ta: நீக்கு

source: Rename
ta: மறுபெயரிடுங்கள்

source: Change data
ta: தரவை மாற்றவும்

# open_node
source: Select this node
ta: இந்த முனையைத் தேர்ந்தெடுக்கவும்

source: Connection data
ta: இணைப்பு தரவு

source: Host
ta: விருந்தோம்பி

source: Port
ta: துறைமுகம்

source: Macaroon
ta: மாகரூன்

source: Certificate
ta: சான்றிதழ்

# server_certificate
source: Host Certificate
ta: புரவலன் சான்றிதழ்

source: Client Certificate
ta: வாடிக்கையாளர் சான்றிதழ்

source: Client Key
ta: வாங்கி விசை

# confirm_node_deletion
source: Do you really want to delete this node connection?
ta: இந்த முனை இணைப்பை நீக்க விரும்புகிறீர்களா?

source: No nodes
ta: முனைகள் இல்லை

# spinner_manage_nodes
source: Manage…
ta: நிர்வகி…

source: Use Tor
ta: டோர் பயன்படுத்தவும்

# verify_certificate
source: Certificate Verification
ta: சான்றிதழ் சரிபார்ப்பு

# lnurl_withdraw_success
source: Withdraw successful
ta: திரும்பப் பெறுங்கள் செய்

# lnurl_withdraw_fail
source: Withdraw failed
ta: திரும்பப் பெறுங்கள் தோல்வியுற்றது

# lnurl_decoding_no_lnurl_data
source: The data does not contain a valid LNURL.
ta: தரவுகளில் செல்லுபடியாகும் LNURL இல்லை.

# lnurl_withdraw_insufficient_channel_balance
source: The withdraw amount is bigger than what you can receive over lightning with your current open channels.
ta: உங்கள் தற்போதைய திறந்த சேனல்களுடன் மின்னல் மீது நீங்கள் பெறக்கூடியதை விட திரும்பப் பெறும் தொகை பெரியது.

# lnurl_unsupported_type
source: Unsupported LNURL type
ta: ஆதரிக்கப்படாத lnurl வகை

# lnurl_service_not_responding
source: %s is not responding
ta: %s பதிலளிக்கவில்லை

# lnurl_service
source: Service
ta: பணி

# lnurl_service_provided_invalid_data
source: The Service you are interacting with provided invalid data.
ta: வழங்கப்பட்ட தவறான தரவுகளுடன் நீங்கள் தொடர்பு கொள்ளும் பணி.

# lnurl_channel_opening_question
source: Do you really want to open a channel with:
ta: அதனுடன் ஒரு சேனலைத் திறக்க விரும்புகிறீர்களா:

# lnurl_channel_pending_hint
source: The channel is opening. This may take a while. You can check the channels state in your channels overview.
ta: சேனல் திறக்கப்படுகிறது. இதற்கு சிறிது நேரம் ஆகலாம். உங்கள் சேனல்கள் கண்ணோட்டத்தில் சேனல்கள் நிலையை நீங்கள் சரிபார்க்கலாம்.

# lnurl_pay_insufficient_channel_balance
source: The amount to pay is bigger than what you can send over lightning with your current open channels.
ta: உங்கள் தற்போதைய திறந்த சேனல்களுடன் மின்னல் அனுப்பக்கூடியதை விட பணம் செலுத்த வேண்டிய தொகை பெரியது.

# lnurl_pay_received_invalid_payment_request
source: %1$s sent an invalid payment request.
ta: %1$s தவறான கட்டண கோரிக்கையை அனுப்பியது.

# lnurl_pay_success_secret_decrypt_error
source: Your payment was successful, but the secret that you received could not be decrypted.
ta: உங்கள் கட்டணம் வெற்றிகரமாக இருந்தது, ஆனால் நீங்கள் பெற்ற ரகசியத்தை மறைகுறியாக்க முடியாது.

# lnurl_pay_save_url
source: IMPORTANT: The URL has been copied to your clipboard. Please save it if you need it later. This dialog won't be shown again.
ta: முக்கியமானது: முகவரி உங்கள் கிளிப்போர்டில் நகலெடுக்கப்பட்டுள்ளது. உங்களுக்கு பின்னர் தேவைப்பட்டால் சேமிக்கவும். இந்த உரையாடல் மீண்டும் காட்டப்படாது.

# lnurl_pay_save_secret
source: IMPORTANT: The code has been copied to your clipboard. Please save it if you need it later. This dialog won't be shown again.
ta: முக்கியமானது: குறியீடு உங்கள் கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டுள்ளது. உங்களுக்கு பின்னர் தேவைப்பட்டால் சேமிக்கவும். இந்த உரையாடல் மீண்டும் காட்டப்படாது.

# lnurl_pay_comment_for_payee
source: Comment for payee
ta: பணம் செலுத்துபவருக்கு கருத்து

# lnurl_invalid_response
source: The Service answered with an invalid response.
ta: பணி தவறான பதிலுடன் பதிலளித்தது.

# lnurl_payer_data_name
source: Name
ta: பெயர்

# lnurl_payer_data_identifier
source: Lightning Address
ta: மின்னல் முகவரி

# lnurl_payer_data_identifier_explanation
source: A lightning address is like an email address, but for Bitcoin!
ta: மின்னல் முகவரி ஒரு மின்னஞ்சல் முகவரி போன்றது, ஆனால் பிட்காயினுக்கு!

# lnurl_payer_data_email
source: Email
ta: மின்னஞ்சல்

# lnurl_payer_data_not_supported
source: This payment requires an authentication type that is not yet supported by BitBanana.
ta: இந்த கட்டணத்திற்கு பிட்பனானாவால் இன்னும் ஆதரிக்கப்படாத அங்கீகார வகை தேவைப்படுகிறது.

# lnurl_payer_data_description
source: Information for payee
ta: பணம் செலுத்துபவருக்கான செய்தி

# lnurl_payer_data_choose
source: Choose which data to send:
ta: எந்த தரவை அனுப்ப வேண்டும் என்பதைத் தேர்வுசெய்க:

# string_analyzer_unrecognized_data
source: Unrecognized data.
ta: அங்கீகரிக்கப்படாத தரவு.

# rest_port
source: REST is not supported. Do you want to try connecting via gRPC?
ta: ஓய்வு ஆதரிக்கப்படவில்லை. GRPC வழியாக இணைக்க முயற்சிக்க விரும்புகிறீர்களா?

# drawer_menu_nodes
source: Nodes
ta: முனைகள்

# drawer_menu_channels
source: Channels
ta: சேனல்கள்

# drawer_menu_contacts
source: Contacts
ta: தொடர்புகள்

# drawer_menu_backup
source: Backup
ta: காப்புப்பிரதி

# drawer_menu_buy
source: Buy Bitcoin
ta: பிட்காயின் வாங்கவும்

# drawer_menu_coin_control
source: Coins (UTXOs)
ta: நாணயங்கள் (UTXOS)

# drawer_menu_routing
source: Routing
ta: ரூட்டிங்

# drawer_menu_category_current_node
source: Current Node
ta: தற்போதைய முனை

# drawer_menu_category_app
source: App
ta: பயன்பாடு

# support_contribute_description
source: Help improving BitBanana.
ta: பிட்பனானாவை மேம்படுத்த உதவுங்கள்.

# support_issue_description
source: Found a bug? Let us know!
ta: ஒரு பிழை கிடைத்ததா? எங்களுக்குத் தெரியப்படுத்துங்கள்!

# support_privacy_description
source: We care about your privacy.
ta: உங்கள் தனியுரிமையைப் பற்றி நாங்கள் கவலைப்படுகிறோம்.

# support_help_description
source: Visit our documentation.
ta: எங்கள் ஆவணங்களைப் பார்வையிடவும்.

# support_donate
source: Donate
ta: நன்கொடை

# support_donate_description
source: Support the developers.
ta: டெவலப்பர்களை ஆதரிக்கவும்.

# identity_switch_tor
source: Tor
ta: டோர்

# identity_switch_public
source: Public
ta: பொது

# identity_tap_on_avatar
source: Tap on your avatar to reveal your node information!
ta: உங்கள் முனை தகவலை வெளிப்படுத்த உங்கள் அவதாரத்தைத் தட்டவும்!

# regtest_blockexplorer_unavailable
source: Block explorers are not available in REGTEST mode.
ta: பிளாக் எக்ச்ப்ளோரர்கள் ரெச்டெச்ட் பயன்முறையில் கிடைக்கவில்லை.

# clipboard_error_heading
source: Clipboard data found, but it is invalid:
ta: கிளிப்போர்டு தரவு காணப்பட்டது, ஆனால் அது தவறானது:

# clipboard_scan_payment
source: Your clipboard contains payment information. Do you want to initiate a payment?
ta: உங்கள் கிளிப்போர்டில் கட்டணத் செய்தி உள்ளது. கட்டணத்தைத் தொடங்க விரும்புகிறீர்களா?

# clipboard_scan_lnurl
source: Your clipboard contains LNURL data. Do you want to use it?
ta: உங்கள் கிளிப்போர்டில் LNURL தரவு உள்ளது. நீங்கள் அதைப் பயன்படுத்த விரும்புகிறீர்களா?

# clipboard_scan_node_pubkey
source: Your clipboard contains a node public key. Do you want to open a channel?
ta: உங்கள் கிளிப்போர்டில் ஒரு முனை பொது விசை உள்ளது. நீங்கள் ஒரு சேனலைத் திறக்க விரும்புகிறீர்களா?

# clipboard_scan_connect
source: Your clipboard contains connection data. Do you want to add a new node?
ta: உங்கள் கிளிப்போர்டில் இணைப்பு தரவு உள்ளது. புதிய முனையைச் சேர்க்க விரும்புகிறீர்களா?

source: Third-party licenses
ta: மூன்றாம் தரப்பு உரிமங்கள்

source: Licenses
ta: உரிமங்கள்

source: Choose action
ta: செயலைத் தேர்வுசெய்க

source: Add contact
ta: தொடர்பைச் சேர்க்கவும்

source: Send money
ta: பணம் அனுப்புங்கள்

source: Contact Name
ta: தொடர்பு பெயர்

# contact_already_exists
source: This contact already exists!
ta: இந்த தொடர்பு ஏற்கனவே உள்ளது!

source: No contacts
ta: தொடர்புகள் இல்லை

source: Contact Type
ta: தொடர்பு வகை

source: Data
ta: தகவல்கள்

# contact_type_ln_node
source: Lightning Node
ta: மின்னல் முனை

# ln_address
source: Lightning Address
ta: மின்னல் முகவரி

# manual_send_input_hint
source: Address or payment data
ta: முகவரி அல்லது கட்டண தரவு

# advanced_channel_details_explanation_capacity
source: The total amount of funds held in this channel. Due to some constraints (like commit fee or local channel reserve) not all of the funds are spendable.
ta: இந்த சேனலில் வைத்திருக்கும் மொத்த நிதிகளின் அளவு. சில தடைகள் காரணமாக (கமிட் கட்டணம் அல்லது உள்ளக சேனல் ரிசர்வ் போன்றவை) அனைத்து நிதிகளும் செலவிடப்படவில்லை.

# advanced_channel_details_activity
source: Activity
ta: செய்கைப்பாடு

# advanced_channel_details_explanation_activity
source: The total percentage of sent and received funds divided by the total capacity of the channel. A channel with an activity over 100 means that more funds traveled through the channel than it can hold. This metric is designed to show how effective a given channel is.
ta: அனுப்பப்பட்ட மற்றும் பெறப்பட்ட நிதிகளின் மொத்த விழுக்காடு சேனலின் மொத்த திறனால் வகுக்கப்படுகிறது. 100 க்கு மேல் ஒரு செயல்பாட்டைக் கொண்ட ஒரு சேனல், சேனலை வைத்திருப்பதை விட அதிகமான பொருள் பயணித்தது. கொடுக்கப்பட்ட சேனல் எவ்வளவு பயனுள்ளதாக இருக்கும் என்பதைக் காட்ட இந்த மெட்ரிக் வடிவமைக்கப்பட்டுள்ளது.

# advanced_channel_details_lifetime
source: Age
ta: அகவை

# advanced_channel_details_lifetime_closed
source: Lifetime
ta: வாழ்நாள்

# advanced_channel_details_explanation_lifetime
source: This shows how long this channel already exists.
ta: இந்த சேனல் ஏற்கனவே எவ்வளவு காலம் உள்ளது என்பதை இது காட்டுகிறது.

# advanced_channel_details_explanation_lifetime_closed
source: This shows the duration for which this channel has been active.
ta: இந்த சேனல் செயலில் இருந்த காலத்தை இது காட்டுகிறது.

# advanced_channel_details_explanation_visibility
source: A channel can be public or private. Private channels are not more secure, they are just not visible to the network.
ta: ஒரு சேனல் பொது அல்லது தனிப்பட்டதாக இருக்கலாம். தனியார் சேனல்கள் மிகவும் பாதுகாப்பானவை அல்ல, அவை பிணையத்திற்கு மட்டும் தெரியவில்லை.

# advanced_channel_details_initiator
source: Initiator
ta: துவக்கி

# advanced_channel_details_initiator_you
source: You
ta: நீங்கள்

# advanced_channel_details_initiator_peer
source: Peer
ta: ஒப்பி

# advanced_channel_details_explanation_initiator
source: Who opened the channel?
ta: சேனலைத் திறந்தவர் யார்?

# advanced_channel_details_close_initiator
source: Close Initiator
ta: மூடு துவக்கி

# advanced_channel_details_explanation_close_initiator
source: Who closed the channel?
ta: சேனலை மூடியவர் யார்?

# advanced_channel_details_explanation_close_type
source: Channels can be closed in different ways. The optimal way is a cooperative close. If one party decides to close the channel without the cooperation of the other party, a so called "force close" happens. A force close will normally result in higher fees and the close initiator will have to wait quite some time until he can access his funds. If one party attempts to cheat and gets caught, we have a breach close.
ta: சேனல்களை வெவ்வேறு வழிகளில் மூடலாம். உகந்த வழி ஒரு கூட்டுறவு நெருக்கம். ஒரு கட்சி மற்ற கட்சியின் ஒத்துழைப்பு இல்லாமல் சேனலை மூட முடிவு செய்தால், "படை மூடு" என்று அழைக்கப்படுவது நிகழ்கிறது. ஒரு படை மூடு பொதுவாக அதிக கட்டணத்தை விளைவிக்கும் மற்றும் நெருக்கமான துவக்கி தனது நிதியை அணுகும் வரை சிறிது நேரம் காத்திருக்க வேண்டியிருக்கும். ஒரு கட்சி ஏமாற்ற முயற்சித்து பிடிபட்டால், எங்களுக்கு ஒரு மீறல் நெருக்கமாக உள்ளது.

# advanced_channel_details_commit_fee
source: Commit Fee
ta: கட்டணம் செலுத்துங்கள்

# advanced_channel_details_explanation_commit_fee
source: The amount to be paid in fees when closing the channel. This can change over time as the fees are subject to the transaction fees of the bitcoin base layer.
ta: சேனலை மூடும்போது கட்டணத்தில் செலுத்த வேண்டிய தொகை. கட்டணங்கள் பிட்காயின் அடிப்படை அடுக்கின் பரிவர்த்தனை கட்டணத்திற்கு உட்பட்டவை என்பதால் இது காலப்போக்கில் மாறக்கூடும்.

# advanced_channel_details_time_lock
source: Time Lock
ta: நேர பூட்டு

# advanced_channel_details_explanation_time_lock
source: In the event of an uncooperative close (force close) of this channel, the time lock is the number of blocks you will have to wait before you can access your funds again.
ta: இந்த சேனலின் ஒத்துழைக்காத நெருக்கமான (படை மூடு) ஏற்பட்டால், உங்கள் நிதியை மீண்டும் அணுகுவதற்கு முன்பு நீங்கள் காத்திருக்க வேண்டிய தொகுதிகளின் எண்ணிக்கை டைம் லாக் ஆகும்.

# advanced_channel_details_routing_fee
source: Routing Fee
ta: ரூட்டிங் கட்டணம்

# advanced_channel_details_inbound_routing_fee
source: Inbound Routing Fee
ta: உள்வரும் ரூட்டிங் கட்டணம்

# advanced_channel_details_explanation_local_routing_fee
source: The fees you will receive when you forward a transaction through this channel. The total fee you will receive is the sum of the base fee and the fee rate. The base fee is what you get for each forwarding, no matter what the amount of the transaction is. The amount received through the fee rate depends on the amount of the transaction.
ta: இந்த சேனல் மூலம் ஒரு பரிவர்த்தனையை அனுப்பும்போது நீங்கள் பெறும் கட்டணம். நீங்கள் பெறும் மொத்த கட்டணம் அடிப்படை கட்டணத்தின் தொகை மற்றும் கட்டண வீதமாகும். பரிவர்த்தனையின் அளவு என்னவாக இருந்தாலும், ஒவ்வொரு பகிர்தலுக்கும் நீங்கள் பெறுவது அடிப்படை கட்டணம். கட்டண விகிதத்தின் மூலம் பெறப்பட்ட தொகை பரிவர்த்தனையின் அளவைப் பொறுத்தது.

# advanced_channel_details_explanation_remote_routing_fee
source: The fees the other node will receive when it forwards a transaction through this channel. This only applies to forwarding transactions. You will not have to pay anything if you use this channel for your transactions.
ta: இந்த சேனல் மூலம் ஒரு பரிவர்த்தனையை அனுப்பும்போது மற்ற முனை பெறும் கட்டணம். இது பரிவர்த்தனைகளை பகிர்வதற்கு மட்டுமே பொருந்தும். உங்கள் பரிவர்த்தனைகளுக்கு இந்த சேனலைப் பயன்படுத்தினால் நீங்கள் எதையும் செலுத்த வேண்டியதில்லை.
