Repository: 247i/TACETr
Catalog: உரை/தானி/bitbanana-app-strings-*.po
Languages: ta

# advanced_channel_details_explanation_inbound_routing_fee
source: Forwarding a payment involves two channels: an inbound channel for receiving a specific amount and an outbound channel for sending the same amount to another peer. This is the fee that will be charged when the channel is selected as inbound channel. Technically, a fee can only be set for the outbound channel; thus, for a selected channel pair (inbound & outbound) the inbound fee effectively adjusts the outbound fee by a simple addition. Therefore, a negative number results in a discount on outbound fee, while a positive number will increase it. For security, the total routing fee cannot be negative, ensuring that funds are not lost through routing. Base fee and fee rate work the same way as they do for outbound fees.
ta: கட்டணத்தை அனுப்புவது இரண்டு சேனல்களை உள்ளடக்கியது: ஒரு குறிப்பிட்ட தொகையைப் பெறுவதற்கான உள்வரும் சேனல் மற்றும் அதே தொகையை மற்றொரு சகாக்களுக்கு அனுப்புவதற்கான வெளிச்செல்லும் சேனல். சேனலை உள்வரும் சேனலாக தேர்ந்தெடுக்கும்போது கட்டணம் வசூலிக்கப்படும் கட்டணம் இது. தொழில்நுட்ப ரீதியாக, வெளிச்செல்லும் சேனலுக்கு மட்டுமே கட்டணம் அமைக்க முடியும்; எனவே, தேர்ந்தெடுக்கப்பட்ட சேனல் சோடிக்கு (உள்வரும் மற்றும் வெளிச்செல்லும்) உள்வரும் கட்டணம் வெளிச்செல்லும் கட்டணத்தை ஒரு எளிய சேர்த்தல் மூலம் திறம்பட சரிசெய்கிறது. எனவே, எதிர்மறை எண் வெளிச்செல்லும் கட்டணத்தில் தள்ளுபடியை விளைவிக்கிறது, அதே நேரத்தில் நேர்மறையான எண் அதை அதிகரிக்கும். பாதுகாப்பைப் பொறுத்தவரை, மொத்த ரூட்டிங் கட்டணம் எதிர்மறையாக இருக்க முடியாது, இது ரூட்டிங் மூலம் பொருள் இழக்கப்படுவதை உறுதிசெய்கிறது. அடிப்படை கட்டணம் மற்றும் கட்டண விகிதம் வெளிச்செல்லும் கட்டணங்களைப் போலவே செயல்படுகின்றன.

# advanced_channel_details_local_channel_reserve
source: Local Channel Reserve
ta: உள்ளக சேனல் ரிசர்வ்

# advanced_channel_details_explanation_local_channel_reserve
source: The minimum amount this node is required to reserve in this channels balance. You will not be able to spend this amount. This makes sure you will always have something to lose if you try to cheat your channel partner.
ta: இந்த சேனல்கள் சமநிலையில் முன்பதிவு செய்ய இந்த முனை தேவைப்படும் குறைந்தபட்ச தொகை. இந்த தொகையை நீங்கள் செலவிட முடியாது. உங்கள் சேனல் கூட்டாளரை ஏமாற்ற முயற்சித்தால் நீங்கள் எப்போதும் இழக்க நேரிடும் என்பதை இது உறுதி செய்கிறது.

# advanced_channel_details_remote_channel_reserve
source: Remote Channel Reserve
ta: தொலைநிலை சேனல் இருப்பு

# advanced_channel_details_explanation_remote_channel_reserve
source: The minimum amount the other node is required to reserve in this channels balance. This makes sure the other node will always have something to lose it tries to cheat you.
ta: இந்த சேனல்கள் இருப்புக்கு முன்பதிவு செய்ய மற்ற முனை தேவைப்படும் குறைந்தபட்ச தொகை. இது மற்ற முனை எப்போதும் உங்களை ஏமாற்ற முயற்சிக்கும் ஏதேனும் ஒன்றைக் கொண்டிருக்கும் என்பதை உறுதிசெய்கிறது.

# advanced_channel_details_explanation_local_minHTLC
source: The smallest value you are willing to forward on this channel in a single transaction.
ta: இந்த சேனலில் ஒரு பரிவர்த்தனையில் நீங்கள் அனுப்ப தயாராக இருக்கும் மிகச்சிறிய மதிப்பு.

# advanced_channel_details_explanation_local_maxHTLC
source: The maximum value you are willing to forward on this channel in a single transaction.
ta: இந்த சேனலில் ஒரு பரிவர்த்தனையில் நீங்கள் அனுப்ப தயாராக இருக்கும் அதிகபட்ச மதிப்பு.

# advanced_channel_details_explanation_remote_minHTLC
source: The smallest value your peer is willing to forward on this channel in a single transaction.
ta: ஒரு பரிவர்த்தனையில் இந்த சேனலில் அனுப்ப உங்கள் உடனுழைப்பவர் தயாராக உள்ள மிகச்சிறிய மதிப்பு.

# advanced_channel_details_explanation_remote_maxHTLC
source: The maximum value your peer is willing to forward on this channel in a single transaction.
ta: ஒற்றை பரிவர்த்தனையில் இந்த சேனலில் அனுப்ப உங்கள் உடனுழைப்பவர் அதிகபட்ச மதிப்பு.

# backup_data_create_description
source: The main purpose of this backup is phone migration. It does neither contain the seed to recover your on-chain funds, nor the channel backup to recover your lightning funds. The backups to recover your funds have to be made outside of BitBanana. This backup only contains the following data: - Node configs - Contacts - App Settings
ta: இந்த காப்புப்பிரதியின் முக்கிய நோக்கம் தொலைபேசி இடம்பெயர்வு. உங்கள் ஆன்-சங்கிலி நிதியை மீட்டெடுப்பதற்கான விதை அல்லது உங்கள் மின்னல் நிதியை மீட்டெடுப்பதற்கான சேனல் காப்புப்பிரதி இதில் இல்லை. உங்கள் நிதியை மீட்டெடுப்பதற்கான காப்புப்பிரதிகள் பிட்பனானாவுக்கு வெளியே செய்யப்பட வேண்டும். இந்த காப்புப்பிரதியில் பின்வரும் தரவு மட்டுமே உள்ளது: - முனை உள்ளமைவுகள் - தொடர்புகள் - பயன்பாட்டு அமைப்புகள்

# backup_data_confirm_description
source: I have already backed up my seed and my channels and understand, that this backup does NOT help to recover my funds. I understand that this backup still contains all necessary information to access my funds if the node is currently online. I therefore will use a secure password in the next step.
ta: எனது விதை மற்றும் எனது சேனல்களை நான் ஏற்கனவே காப்புப் பிரதி எடுத்துள்ளேன், இந்த காப்புப்பிரதி எனது நிதியை மீட்டெடுக்க உதவாது என்பதை புரிந்து கொண்டேன். முனை தற்போது ஆன்லைனில் இருந்தால் எனது நிதியை அணுக தேவையான அனைத்து தகவல்களும் இந்த காப்புப்பிரதியைக் கொண்டுள்ளன என்பதை நான் புரிந்துகொள்கிறேன். எனவே அடுத்த கட்டத்தில் பாதுகாப்பான கடவுச்சொல்லைப் பயன்படுத்துவேன்.

# backup_data_confirm_headline
source: Please Confirm
ta: உறுதி செய்யவும்

# backup_data_confirm
source: I confirm
ta: நான் உறுதிப்படுத்துகிறேன்

# backup_data_restore_description
source: Restore your connected nodes, contacts and app settings. If your nodes are no longer online, this restore process will not help you regaining access to your funds.
ta: உங்கள் இணைக்கப்பட்ட முனைகள், தொடர்புகள் மற்றும் பயன்பாட்டு அமைப்புகளை மீட்டெடுக்கவும். உங்கள் முனைகள் இனி ஆன்லைனில் இல்லை என்றால், இந்த மீட்டெடுப்பு செயல்முறை உங்கள் நிதிகளுக்கான அணுகலை மீண்டும் பெற உதவாது.

# backup_data_create_headline
source: Backup
ta: காப்புப்பிரதி

# backup_data_restore_headline
source: Restore
ta: மீட்டமை

# backup_data_password_enter
source: Enter your password
ta: உங்கள் கடவுச்சொல்லை உள்ளிடவும்

# backup_data_password_confirm
source: Confirm your password
ta: உங்கள் கடவுச்சொல்லை உறுதிப்படுத்தவும்

# backup_data_password_empty
source: The password must have at least 8 characters.
ta: கடவுச்சொல்லில் குறைந்தது 8 எழுத்துக்கள் இருக்க வேண்டும்.

# backup_data_password_mismatch
source: The passwords are not identical.
ta: கடவுச்சொற்கள் ஒரே மாதிரியானவை அல்ல.

# backup_data_creation_process
source: Creating backup
ta: காப்புப்பிரதியை உருவாக்குதல்

# backup_data_restore_process
source: Restoring backup
ta: காப்புப்பிரதியை மீட்டமைத்தல்

# backup_data_create_success
source: Backup created
ta: காப்புப்பிரதி உருவாக்கப்பட்டது

# backup_data_restore_success
source: Backup restored
ta: காப்புப்பிரதி மீட்டெடுக்கப்பட்டது

# backup_data_create_failed
source: Backup failed
ta: காப்புப்பிரதி தோல்வியடைந்தது

# backup_data_restore_failed_title
source: Restoring failed
ta: மீட்டமைப்பது தோல்வியடைந்தது

# backup_data_restore_failed_description
source: Most likely you entered an invalid password.
ta: பெரும்பாலும் நீங்கள் தவறான கடவுச்சொல்லை உள்ளிட்டுள்ளீர்கள்.

# backup_data_open_backupfile_error
source: Unable to open the selected file.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பைத் திறக்க முடியவில்லை.

# backup_data_no_data
source: No data to backup.
ta: காப்புப்பிரதிக்கு தரவு இல்லை.

# backup_data_version_too_old
source: The backup was made with a newer version. Please update the app before importing the backup.
ta: காப்புப்பிரதி புதிய பதிப்பைக் கொண்டு செய்யப்பட்டது. காப்புப்பிரதியை இறக்குமதி செய்வதற்கு முன் பயன்பாட்டைப் புதுப்பிக்கவும்.

# backup_data_backupVersion_too_old
source: This version was made with a very old version of BitBanana. Unfortunately it is no longer supported.
ta: இந்த பதிப்பு பிட்பனானாவின் மிகவும் பழைய பதிப்பில் செய்யப்பட்டது. துரதிர்ச்டவசமாக அது இனி ஆதரிக்கப்படாது.

# backup_data_invalid_file_chosen
source: This is not a valid backup file. Please chose a file that was created with this app.
ta: இது செல்லுபடியாகும் காப்பு கோப்பு அல்ல. இந்த பயன்பாட்டுடன் உருவாக்கப்பட்ட கோப்பைத் தேர்வுசெய்க.

# dialog_open_url
source: The data links to a webpage. Do you want to open the following webpage? %1$s
ta: தரவு ஒரு வலைப்பக்கத்துடன் இணைக்கிறது. பின்வரும் வலைப்பக்கத்தைத் திறக்க விரும்புகிறீர்களா? %1$s

# utxo_no_utxos
source: No UTXOs
ta: UTXOS இல்லை

# forwarding_no_forwarding_events
source: No forwarding events in the selected period
ta: தேர்ந்தெடுக்கப்பட்ட காலகட்டத்தில் பகிர்தல் நிகழ்வுகள் இல்லை

# forwarding_earned_description
source: Earned in the selected period
ta: தேர்ந்தெடுக்கப்பட்ட காலகட்டத்தில் சம்பாதிக்கப்பட்டது

# forwarding_volume_description
source: Routed in the selected period
ta: தேர்ந்தெடுக்கப்பட்ட காலகட்டத்தில் திசைதிருப்பப்பட்டது

# forwarding_avg_earned_description
source: Earned on average per event
ta: ஒரு நிகழ்வுக்கு சராசரியாக சம்பாதிக்கப்பட்டது

# forwarding_avg_volume_description
source: Routed on average per event
ta: ஒரு நிகழ்வுக்கு சராசரியாக திசைதிருப்பப்பட்டது

# forwarding_avg_events_per_day
source: Events per day on average
ta: சராசரியாக ஒரு நாளைக்கு நிகழ்வுகள்

# forwarding_closed_channel
source: Closed channel
ta: மூடிய சேனல்

source: Sign/Verify
ta: கையொப்பமிட/சரிபார்க்கவும்

source: Sign
ta: அடையாளம்

source: Verify
ta: சரிபார்க்கவும்

source: Message to sign
ta: கையெழுத்திட செய்தி

source: Message to verify
ta: சரிபார்க்க செய்தி

source: Sign message
ta: செய்தி கையொப்பம்

source: Generated signature:
ta: உருவாக்கப்பட்ட கையொப்பம்:

source: Signature to verify
ta: சரிபார்க்க கையொப்பம்

source: Verify message
ta: செய்தியை சரிபார்க்கவும்

# signature_valid
source: Signature is valid!
ta: கையொப்பம் செல்லுபடியாகும்!

# signature_invalid
source: Signature is invalid!
ta: கையொப்பம் தவறானது!

# signature_pubkey
source: Pubkey:
ta: பியூக்ச்:

# channel_summary_total_outbound
source: Total outbound
ta: மொத்த வெளிச்செல்லும்

# channel_summary_total_inbound
source: Total inbound
ta: மொத்த உள்வரும்

# channel_summary_total_unavailable
source: Total offline
ta: மொத்த இணைப்பில்லாத

# fee_base
source: Base Fee
ta: தள கட்டணம்

source: Fee Rate
ta: கட்டண விகிதம்

# inbound_fee_base
source: Inbound Base Fee
ta: உள்வரும் அடிப்படை கட்டணம்

source: Inbound Fee Rate
ta: உள்வரும் கட்டண விகிதம்

source: Timelock Delta
ta: டைம்லாக் டெல்டா

# htlc_max
source: Max HTLC
ta: அதிகபட்சம் HTLC

# submit_routing_policy
source: Update Routing Policy
ta: ரூட்டிங் கொள்கையைப் புதுப்பிக்கவும்

# routing_policy_applies_for_all_channels
source: Attention! If submitted, these settings will be applied to all of your channels!
ta: கவனம்! சமர்ப்பித்தால், இந்த அமைப்புகள் உங்கள் எல்லா சேனல்களுக்கும் பயன்படுத்தப்படும்!

# routing_policy_update_success
source: Routing policy successfully updated.
ta: ரூட்டிங் கொள்கை வெற்றிகரமாக புதுப்பிக்கப்பட்டது.

# channel_commitment_type
source: Commitment Type
ta: அர்ப்பணிப்பு வகை

# explanation_channel_commitment_type
source: Each party has a commitment transaction that only they can broadcast to the blockchain to claim their share of bitcoins. Different types of commitment transactions result in channels having different properties.
ta: ஒவ்வொரு கட்சிக்கும் ஒரு அர்ப்பணிப்பு பரிவர்த்தனை உள்ளது, அது பிட்காயின்களின் பங்கைக் கோர பிளாக்செயினுக்கு மட்டுமே ஒளிபரப்ப முடியும். வெவ்வேறு வகையான அர்ப்பணிப்பு பரிவர்த்தனைகள் சேனல்கள் வெவ்வேறு பண்புகளைக் கொண்டுள்ளன.

# explanation_timelock_delta
source: In a payment route, each intermediate step defines a specific time window (in blocks) within which it must successfully process the transaction. Otherwise, it will be considered failed due to expiration. In case of payment failures or uncooperative behavior, this time window is crucial because it allows participants at that step to take necessary actions, such as cooperatively reversing the transaction (unwinding the HTLC) or uncooperatively settling it on the blockchain. A higher value in this context enhances the channel's resilience against temporary node failures. However, it could potentially reduce the attractiveness of the channel for routing because, in the worst-case scenario, payments might experience prolonged delays. Additionally, in rare cases of stuck payments, the funds of the channel participants allocated to that forwarding event will be locked up for the duration of this time window. 144 blocks is about one day.
ta: கட்டண பாதையில், ஒவ்வொரு இடைநிலை படி ஒரு குறிப்பிட்ட நேர சாளரத்தை (தொகுதிகளில்) வரையறுக்கிறது, அதில் அது பரிவர்த்தனையை வெற்றிகரமாக செயலாக்க வேண்டும். இல்லையெனில், காலாவதி காரணமாக அது தோல்வியுற்றதாக கருதப்படும். கட்டண தோல்விகள் அல்லது ஒத்துழைக்காத நடத்தை ஏற்பட்டால், இந்த நேர சாளரம் முக்கியமானது, ஏனெனில் அந்த நடவடிக்கையில் பங்கேற்பாளர்கள் பரிவர்த்தனையை (எச்.டி.எல்.சியை பிரிப்பது) ஒத்துழைப்புடன் மாற்றியமைப்பது அல்லது பிளாக்செயினில் ஒத்துழைக்காமல் தீர்வு காண்பது போன்ற தேவையான நடவடிக்கைகளை எடுக்க அனுமதிக்கிறது. இந்த சூழலில் அதிக மதிப்பு தற்காலிக முனை தோல்விகளுக்கு எதிராக சேனலின் பின்னடைவை மேம்படுத்துகிறது. இருப்பினும், இது ரூட்டிங் செய்வதற்கான சேனலின் கவர்ச்சியைக் குறைக்கக்கூடும், ஏனெனில், மோசமான சூழ்நிலையில், கொடுப்பனவுகள் நீண்டகால தாமதங்களை அனுபவிக்கக்கூடும். கூடுதலாக, சிக்கிய கொடுப்பனவுகளின் அரிதான சந்தர்ப்பங்களில், அந்த பகிர்வு நிகழ்வுக்கு ஒதுக்கப்பட்ட சேனல் பங்கேற்பாளர்களின் பொருள் இந்த நேர சாளரத்தின் காலத்திற்கு பூட்டப்படும். 144 தொகுதிகள் ஒரு நாள்.

# stealth_mode_description_calc
source: BitBanana now looks like a calculator!
ta: பிட்பனானா இப்போது ஒரு கால்குலேட்டர் போல் தெரிகிறது!

# stealth_mode_enable
source: Enable stealth mode:
ta: திருட்டுத்தனமான பயன்முறையை இயக்கு:

# stealth_mode_enable_instruction
source: Close the app
ta: பயன்பாட்டை மூடு

# stealth_mode_disable
source: Disable stealth mode:
ta: திருட்டுத்தனமான பயன்முறையை முடக்கு:

# stealth_mode_disable_instruction_calc
source: Perform a calculation that results in 21
ta: 21 இல் விளைகிறது

# peers_no_peers
source: No peers
ta: சகாக்கள் இல்லை

# peers_add
source: Add peer
ta: சகாக்களைச் சேர்க்கவும்

# peer_ping
source: Ping
ta: பிங்

# peer_ping_explanation
source: The time it takes for the peer to respond.
ta: சகாக்கள் பதிலளிக்க எடுக்கும் நேரம்.

# peer_flap_count
source: Flap count
ta: மடல் எண்ணிக்கை

# peer_flap_count_explanation
source: Total occurrences of this peer going offline or coming online, documented across restarts. The count reduces gradually if the peer has not recently flapped, allowing forgiveness for historically high flap counts.
ta: இந்த சகாக்களின் மொத்த நிகழ்வுகள் ஆஃப்லைனில் செல்வது அல்லது ஆன்லைனில் வருவது, மறுதொடக்கங்களில் ஆவணப்படுத்தப்பட்டுள்ளது. வரலாற்று ரீதியாக அதிக மடல் எண்ணிக்கையில் மன்னிப்பை அனுமதிக்கும் பியர் அண்மைக் காலத்தில் மிதக்கவில்லை என்றால் எண்ணிக்கை படிப்படியாகக் குறைகிறது.

# peer_last_flap
source: Last flap
ta: கடைசி மடல்

# peer_last_flap_explanation
source: Elapsed time since the peer's most recent offline event.
ta: பியரின் மிக அண்மைக் கால இணைப்பில்லாத நிகழ்விலிருந்து கடந்த நேரம்.

# peer_last_errors
source: Last errors
ta: கடைசி பிழைகள்

# peer_mutual_channels
source: Mutual channels
ta: பரச்பர சேனல்கள்

# peer_mutual_channels_explanation
source: The count of channels you have open with this peer.
ta: இந்த சகாவுடன் நீங்கள் திறந்திருக்கும் சேனல்களின் எண்ணிக்கை.

# peer_total_channels
source: Total Channels
ta: மொத்த சேனல்கள்

# peer_total_channels_explanation
source: The total count of public channels maintained by this peer.
ta: இந்த சகாவால் பராமரிக்கப்படும் பொது சேனல்களின் மொத்த எண்ணிக்கை.

# peer_total_capacity
source: Total Capacity
ta: மொத்த திறன்

# peer_total_capacity_explanation
source: Total node capacity, derived from the sum of channel capacities.
ta: மொத்த முனை திறன், சேனல் திறன்களின் தொகையிலிருந்து பெறப்பட்டது.

# peer_features
source: Features
ta: நற்பொருத்தங்கள்

# balance_details_on_chain_confirmed
source: On-Chain confirmed:
ta: ஆன்-சங்கிலி உறுதிப்படுத்தப்பட்டது:

# balance_details_on_chain_unconfirmed
source: On-Chain pending:
ta: ஆன்-சங்கிலி நிலுவையில் உள்ளது:

# balance_details_lightning
source: Open channels:
ta: திறந்த சேனல்கள்:

# balance_details_lightning_pending
source: Pending channels:
ta: நிலுவையில் உள்ள சேனல்கள்:

source: Register
ta: பதிவு செய்யுங்கள்

# login_verb
source: Log in
ta: புகுபதிகை

# auth_link_account
source: Link with account
ta: கணக்குடன் இணைக்கவும்

source: Authenticate
ta: அங்கீகரிக்கவும்

# lnurl_auth_register_info
source: Do you want to use your node to register an account at that service?
ta: அந்த சேவையில் ஒரு கணக்கை பதிவு செய்ய உங்கள் முனையைப் பயன்படுத்த விரும்புகிறீர்களா?

# lnurl_auth_login_info
source: Do you want to use your node to log in to that service?
ta: அந்த சேவையில் உள்நுழைய உங்கள் முனையைப் பயன்படுத்த விரும்புகிறீர்களா?

# lnurl_auth_link_info
source: Do you want to link your existing account with your node?
ta: உங்கள் இருக்கும் கணக்கை உங்கள் முனையுடன் இணைக்க விரும்புகிறீர்களா?

# lnurl_auth_auth_info
source: Do you want to use your node to authenticate with that service?
ta: அந்த சேவையுடன் அங்கீகரிக்க உங்கள் முனையைப் பயன்படுத்த விரும்புகிறீர்களா?

# lnurl_auth_success
source: Authentication was successful!
ta: ஏற்பு வெற்றிகரமாக இருந்தது!

# lnurl_auth_fail
source: Authentication failed
ta: ஏற்பு தோல்வியுற்றது

source: VPN Automation
ta: VPN ஆட்டோமேசன்

# vpn_no_vpn
source: No VPN
ta: VPN இல்லை

# vpn_start_on_open
source: Start on open
ta: திறந்த நிலையில் தொடங்கவும்

# vpn_stop_on_close
source: Stop on close
ta: நெருக்கமாக நிறுத்துங்கள்

# vpn_tunnel_name
source: Tunnel
ta: சுரங்கப்பாதை

# vpn_install_vpn_app_hint
source: To use this VPN you first have to install the %1$s app.
ta: இந்த VPN ஐப் பயன்படுத்த நீங்கள் முதலில் %1$s பயன்பாட்டை நிறுவ வேண்டும்.

# vpn_wireguard_additional_info
source: To allow for automation of WireGuard you need to open up the WireGuard app, navigate to its settings, and then allow control for external apps.
ta: வயர் கார்டின் ஆட்டோமேசனை அனுமதிக்க நீங்கள் வயர் கார்ட் பயன்பாட்டைத் திறக்க வேண்டும், அதன் அமைப்புகளுக்கு செல்ல வேண்டும், பின்னர் வெளிப்புற பயன்பாடுகளுக்கான கட்டுப்பாட்டை அனுமதிக்க வேண்டும்.

# vpn_unable_to_start
source: Oops! Looks like the VPN cannot be started automatically.
ta: அச்சச்சோ! VPN ஐ தானாகவே தொடங்க முடியாது என்று தெரிகிறது.

# vpn_unable_to_start_not_installed
source: You have to install the %1$s app to use VPN specified in your connection settings.
ta: உங்கள் இணைப்பு அமைப்புகளில் குறிப்பிடப்பட்டுள்ள VPN ஐப் பயன்படுத்த %1$s பயன்பாட்டை நிறுவ வேண்டும்.

# vpn_unable_to_start_no_permission
source: You have to grant BitBanana permission to control %1$s.
ta: %1$s ஐ கட்டுப்படுத்த நீங்கள் பிட்பனானா இசைவு வழங்க வேண்டும்.

# vpn_unable_to_start_unknown
source: Ensure that the %1$s app is running in the background. If it does, make sure all android battery optimizations are deactivated for %1$s and then restart the %1$s app. Use the button below to go to the settings. If that doesn't help either, open the %1$s app and start the VPN manually to resolve the issue.
ta: %1$s பயன்பாடு பின்னணியில் இயங்குகிறது என்பதை உறுதிப்படுத்தவும். அவ்வாறு செய்தால், அனைத்து ஆண்ட்ராய்டு பேட்டரி மேம்படுத்தல்களும் %1$s க்கு செயலிழக்கப்படுவதை உறுதிசெய்து, பின்னர் %1$s பயன்பாட்டை மறுதொடக்கம் செய்யுங்கள். அமைப்புகளுக்குச் செல்ல கீழே உள்ள பொத்தானைப் பயன்படுத்தவும். அது உதவவில்லை என்றால், %1$s பயன்பாட்டைத் திறந்து, சிக்கலைத் தீர்க்க VPN ஐ கைமுறையாகத் தொடங்கவும்.

# vpn_change_battery_settings
source: Change battery settings
ta: பேட்டரி அமைப்புகளை மாற்றவும்

# connection_state_disconnecting
source: Clear last connection…
ta: கடைசி இணைப்பை அழிக்கவும்…

# connection_state_starting_vpn
source: Starting VPN…
ta: VPN ஐத் தொடங்குகிறது…

# connection_state_starting_tor
source: Starting Tor…
ta: தொடங்கி டோர்…

# connection_state_connecting
source: Connecting…
ta: இணைத்தல்…

# wallet_load_sate_testing_connection
source: Testing connection…
ta: சோதனை இணைப்பு…

# wallet_load_state_reconnect_after_unlock
source: Reconnecting…
ta: மீண்டும் இணைத்தல்…

# wallet_load_state_fetching_data
source: Fetching data…
ta: தரவைப் பெறுதல்…

# unsaved_changes
source: There are unsaved changes.
ta: சேமிக்கப்படாத மாற்றங்கள் உள்ளன.

source: Discard
ta: நிராகரிக்கவும்

# duplication_successful
source: Duplication was successful.
ta: நகல் வெற்றிகரமாக இருந்தது.

# on_chain_fallback_insufficient_funds
source: Insufficient lightning funds. Falling back to on-chain payment.
ta: போதுமான மின்னல் நிதிகள். ஆன்-சங்கிலி கட்டணத்திற்குத் திரும்புதல்.

# on_chain_fallback_expired
source: Lightning request expired. Falling back to on-chain payment.
ta: மின்னல் கோரிக்கை காலாவதியானது. ஆன்-சங்கிலி கட்டணத்திற்குத் திரும்புதல்.

# on_chain_fallback_invalid_data
source: Invalid lightning request. Falling back to on-chain payment.
ta: தவறான மின்னல் கோரிக்கை. ஆன்-சங்கிலி கட்டணத்திற்குத் திரும்புதல்.

# peers_no_watchtowers
source: No watchtowers
ta: காவற்கோபுரங்கள் இல்லை

# watchtower_add
source: Add watchtower
ta: காவற்கோபுரத்தைச் சேர்க்கவும்

# watchtower_show
source: Show watchtower
ta: காவற்கோபுரத்தைக் காட்டு

# own_watchtower_short_description
source: Your node is a watchtower that can watch and protect other nodes.
ta: உங்கள் முனை மற்ற முனைகளைப் பார்த்து பாதுகாக்கக்கூடிய ஒரு காவற்கோபுரமாகும்.

# own_watchtower_tap_hint
source: Tap on the avatar to reveal your watchtower information!
ta: உங்கள் காவற்கோபுரமான தகவல்களை வெளிப்படுத்த அவதாரத்தைத் தட்டவும்!

# lnd_watchtower_client_inactive
source: The watchtower client is currently inactive. Please ensure lnd is started with the --wtclient.active flag.
ta: காவற்கோபுரிமை கிளையன்ட் தற்போது செயலற்ற நிலையில் உள்ளது. எல்.என்.டி ---WTClient.active கொடி மூலம் தொடங்கப்படுவதை உறுதிசெய்க.

# watchtower_sessions
source: Sessions
ta: அமர்வுகள்

# watchtower_session_details
source: Session Details
ta: அமர்வு விவரங்கள்

# watchtower_session_backups
source: Backups
ta: காப்புப்பிரதிகள்

# watchtower_session_pending_backups
source: Pending Backups
ta: காப்புப்பிரதிகள் நிலுவையில் உள்ளன

# watchtower_session_max_backups
source: Max Backups
ta: அதிகபட்ச காப்புப்பிரதிகள்

# watchtower_session_sweep_fee
source: Sweep Fee
ta: கட்டணம்

# bolt12_offer
source: Payment Code
ta: கட்டணக் குறியீடு

# offer_no_bolt12_offers
source: No payment codes
ta: கட்டணக் குறியீடுகள் இல்லை

# offer_single_use
source: Single use
ta: ஒற்றை பயன்பாடு

# offer_multi_use
source: Multi use
ta: பல பயன்பாடு

source: Offer ID
ta: ஐடி சலுகை

source: Bolt 12
ta: போல்ட் 12

# bolt12_payer_note
source: Payer note
ta: பணம் செலுத்துபவர் குறிப்பு
