Repository: 247i/TACETr
Catalog: உரை/தானி/bitbanana-app-strings-*.po
Languages: ta

# settings_hideBalanceType_all
source: All balances
ta: அனைத்து நிலுவைகளும்

# settings_currency_none
source: None
ta: எதுவுமில்லை

# settings_changePin
source: Change/Remove PIN
ta: முள் ஐ மாற்றவும்/அகற்றவும்

# settings_addPin
source: Protect with PIN
ta: முள் மூலம் பாதுகாக்கவும்

# settings_removePin
source: Remove PIN
ta: முள் அகற்று

# settings_features
source: Features
ta: நற்பொருத்தங்கள்

# settings_features_summary
source: Personalize the app to your needs by toggling features on or off.
ta: அம்சங்களை ஆன் அல்லது ஆஃப் மாற்றுவதன் மூலம் உங்கள் தேவைகளுக்கு பயன்பாட்டை தனிப்பயனாக்குங்கள்.

# settings_blockExplorer
source: Block Explorer
ta: தொகுதி எக்ச்ப்ளோரர்

# settings_customBlockExplorer_host_description
source: Please provide the host address for your custom explorer. When you host the block explorer yourself, your privacy is fully maintained.
ta: உங்கள் தனிப்பயன் எக்ச்ப்ளோரருக்கான புரவலன் முகவரியை வழங்கவும். பிளாக் எக்ச்ப்ளோரரை நீங்களே புரவலன் செய்யும்போது, ​​உங்கள் தனியுரிமை முழுமையாக பராமரிக்கப்படுகிறது.

# settings_customBlockExplorer_address_suffix
source: Address Suffix
ta: முகவரி பின்னொட்டு

# settings_customBlockExplorer_address_suffix_description
source: When querying an address in the explorer, the link to be invoked will be as follows: Host + Address Suffix + Address.
ta: எக்ச்ப்ளோரரில் ஒரு முகவரியை வினவும்போது, ​​செயல்படுத்தப்பட வேண்டிய இணைப்பு பின்வருமாறு: புரவலன் + முகவரி பின்னொட்டு + முகவரி.

# settings_customBlockExplorer_transaction_suffix
source: Transaction Suffix
ta: பரிவர்த்தனை பின்னொட்டு

# settings_customBlockExplorer_transaction_suffix_description
source: When querying a transaction in the explorer, the link to be invoked will be as follows: Host + Transaction Suffix + TransactionID.
ta: எக்ச்ப்ளோரரில் ஒரு பரிவர்த்தனையை வினவும்போது, ​​செயல்படுத்தப்பட வேண்டிய இணைப்பு பின்வருமாறு இருக்கும்: புரவலன் + பரிவர்த்தனை பின்னொட்டு + பரிவர்த்தனை.

# settings_blockExplorer_tor_toast
source: Tor Browser for Android is required.
ta: ஆண்ட்ராய்டு க்கான TOR உலாவி தேவை.

# settings_custom_block_explorer
source: Custom Block Explorer
ta: தனிப்பயன் தொகுதி எக்ச்ப்ளோரர்

# settings_addressType
source: Bitcoin Address Type
ta: பிட்காயின் முகவரி வகை

# settings_showHelpButtons
source: Show info buttons
ta: செய்தி பொத்தான்களைக் காட்டு

# settings_featureHelpButtons_summary
source: The handy ? buttons across the app help new users with detailed explanations.
ta: எளிது? பயன்பாடு முழுவதும் உள்ள பொத்தான்கள் புதிய பயனர்களுக்கு விரிவான விளக்கங்களுடன் உதவுகின்றன.

# settings_featureRoutingSummary
source: Routing Summary
ta: ரூட்டிங் சுருக்கம்

# settings_featureRoutingSummary_summary
source: Provides access to all routing events along with a routing summary.
ta: ரூட்டிங் சுருக்கத்துடன் அனைத்து ரூட்டிங் நிகழ்வுகளுக்கும் அணுகலை வழங்குகிறது.

# settings_featureContacts_summary
source: Make sending money a breeze with a neatly organized contact list.
ta: நேர்த்தியாக ஒழுங்கமைக்கப்பட்ட தொடர்பு பட்டியலுடன் பணத்தை அனுப்புவது.

# settings_featureCoinControl
source: Coin Control
ta: நாணயம் கட்டுப்பாடு

# settings_featureCoinControl_summary
source: Advanced management of on-chain funds. Provides a list of all UTXOs and allows to select specific ones when sending funds. Coin selection is automated if disabled.
ta: ஆன்-சங்கிலி நிதிகளின் மேம்பட்ட மேலாண்மை. அனைத்து UTXO களின் பட்டியலையும் வழங்குகிறது மற்றும் பொருள் அனுப்பும்போது குறிப்பிட்டவற்றைத் தேர்ந்தெடுக்க அனுமதிக்கிறது. முடக்கப்பட்டால் நாணயம் தேர்வு தானியங்கி செய்யப்படுகிறது.

# settings_featurePeers
source: Peer Management
ta: தம மேலாண்மை

# settings_featurePeers_summary
source: While peer management is automated, this feature still offers manual control for viewing and managing your connected peers.
ta: பியர் மேனேச்மென்ட் தானியங்கி முறையில் இருக்கும்போது, ​​உங்கள் இணைக்கப்பட்ட சகாக்களைப் பார்ப்பதற்கும் நிர்வகிப்பதற்கும் இந்த நற்பொருத்தம் இன்னும் கையேடு கட்டுப்பாட்டை வழங்குகிறது.

# settings_featureWatchtowers
source: Watchtower Management
ta: காவற்கோபுர மேலாண்மை

# settings_featureWatchtowers_summary
source: If your node remains offline for a longer duration, watchtowers will protect your funds from any fraudulent activity.
ta: உங்கள் முனை நீண்ட காலத்திற்கு ஆஃப்லைனில் இருந்தால், காவற்கோபுரங்கள் உங்கள் நிதியை எந்தவொரு மோசடி செயலிலிருந்தும் பாதுகாக்கும்.

# settings_featureSignVerify_summary
source: Allows to sign and verify messages with your node.
ta: உங்கள் முனையுடன் செய்திகளில் கையொப்பமிட்டு சரிபார்க்க அனுமதிக்கிறது.

# settings_exchangeRateProvider
source: Exchange Rate Provider
ta: பரிமாற்ற வீத வழங்குநர்

# settings_custom_exchange_rate_provider
source: Custom Exchange Rate Provider
ta: தனிப்பயன் பரிமாற்ற வீத வழங்குநர்

# settings_requires_tor_toast
source: This requires Tor. Enable it in settings.
ta: இதற்கு டோர் தேவை. அமைப்புகளில் அதை இயக்கவும்.

# settings_custom_exchange_rate_provider_host_description
source: Please provide the host address for your exchange rate provider. When you host the exchange rate provider yourself, your privacy is fully maintained.
ta: உங்கள் பரிமாற்ற வீத வழங்குநருக்கான புரவலன் முகவரியை வழங்கவும். பரிமாற்ற வீத வழங்குநரை நீங்களே புரவலன் செய்யும்போது, ​​உங்கள் தனியுரிமை முழுமையாக பராமரிக்கப்படுகிறது.

# settings_feeEstimationProvider
source: Fee Estimation
ta: கட்டணம் மதிப்பீடு

# settings_node_fee_estimates
source: Internal
ta: உள்

# settings_custom_fee_estimation_provider_host_description
source: Please provide the host address for your fee estimation provider. When you host the fee estimation provider yourself, your privacy is fully maintained.
ta: உங்கள் கட்டண மதிப்பீட்டு வழங்குநருக்கான புரவலன் முகவரியை வழங்கவும். கட்டண மதிப்பீட்டு வழங்குநரை நீங்களே புரவலன் செய்யும் போது, ​​உங்கள் தனியுரிமை முழுமையாக பராமரிக்கப்படுகிறது.

# settings_custom_fee_estimation_provider
source: Custom Fee Estimation
ta: தனிப்பயன் கட்டண மதிப்பீடு

# settings_receiveAddressDisplayValues_0
source: Compatibility SegWit (P2PSH)
ta: பொருந்தக்கூடிய செக்விட் (பி 2 பி.எச்.எச்)

# settings_receiveAddressDisplayValues_1
source: Native SegWit (Bech32)
ta: சொந்த செக்விட் (பெக் 32)

# settings_receiveAddressDisplayValues_2
source: Taproot (Bech32m)
ta: டாப்ரூட் (பெக் 32 எம்)

# settings_avatarStyle
source: Avatar Style
ta: அவதார் பாணி

# settings_avatarStyleDisplayValues_0
source: Mixed
ta: கலப்பு

# settings_avatarStyleDisplayValues_1
source: Robots
ta: ரோபோக்கள்

# settings_avatarStyleDisplayValues_2
source: Aliens
ta: வேற்றுகிரகவாசிகள்

# settings_avatarStyleDisplayValues_3
source: Humans
ta: மனிதர்கள்

# settings_avatarStyleDisplayValues_4
source: Animals
ta: விலங்குகள்

# settings_lnRequestExpiryTitle
source: Lightning Request Expiry
ta: மின்னல் கோரிக்கை காலாவதி

# settings_lnFeeLimitTitle
source: Lightning Payment Fee Limit
ta: மின்னல் கட்டண கட்டண வரம்பு

# settings_no_fee_limit
source: No limit
ta: வரம்பு இல்லை

# settings_unspecifiedAmountInvoices
source: Allow invoices without specific amount
ta: குறிப்பிட்ட அளவு இல்லாமல் விலைப்பட்டியல்களை அனுமதிக்கவும்

# settings_lnPrivateChannelHints
source: Include route hints for private channels in invoices
ta: விலைப்பட்டியலில் தனியார் சேனல்களுக்கான பாதை குறிப்புகளைச் சேர்க்கவும்

# settings_onChainFeePresets
source: On-chain fee presets
ta: சங்கிலி கட்டணம் முன்னமைவுகள்

# settings_fastFee
source: Fast Transaction
ta: விரைவான பரிவர்த்தனை

# settings_mediumFee
source: Medium Transaction
ta: நடுத்தர பரிவர்த்தனை

# settings_slowFee
source: Slow Transaction
ta: மெதுவான பரிவர்த்தனை

# settings_stealth_mode
source: Stealth Mode
ta: திருட்டுத்தனமான பயன்முறை

# settings_stealth_mode_summary
source: Enable stealth mode to protect against physical searches of your device
ta: உங்கள் சாதனத்தின் உடல் தேடல்களிலிருந்து பாதுகாக்க திருட்டுத்தனமான பயன்முறையை இயக்கவும்

# settings_on_off
source: On / Off
ta: ஆன் / ஆஃப்

source: Error
ta: பிழை

# error_blockExplorer_title
source: Block Explorer
ta: தொகுதி எக்ச்ப்ளோரர்

# error_blockExplorer_message
source: Your currently selected block explorer (%1$s) does not support %2$s. Please go to settings and choose another block explorer to continue.
ta: உங்கள் தற்போது தேர்ந்தெடுக்கப்பட்ட தொகுதி எக்ச்ப்ளோரர் ( %1$s) %2$s ஐ ஆதரிக்காது. தயவுசெய்து அமைப்புகளுக்குச் சென்று தொடர மற்றொரு தொகுதி எக்ச்ப்ளோரரைத் தேர்வுசெய்க.

# error_zeroAmountPaymentRequest
source: This is a zero amount payment request. BitBanana does not support zero amount payment requests due to security concerns associated with them.
ta: இது சுழிய தொகை கட்டண கோரிக்கை. அவற்றுடன் தொடர்புடைய பாதுகாப்பு கவலைகள் காரணமாக பிட்பனானா சுழிய தொகை கட்டண கோரிக்கைகளை ஆதரிக்கவில்லை.

# error_paymentRequestExpired
source: This payment request expired.
ta: இந்த கட்டண கோரிக்கை காலாவதியானது.

# error_bolt12_expired
source: This payment code expired.
ta: இந்த கட்டணக் குறியீடு காலாவதியானது.

# error_useTestnetRequest
source: You are connected to TESTNET. Please use TESTNET addresses or payment requests.
ta: நீங்கள் டெச்ட்நெட்டுடன் இணைக்கப்பட்டுள்ளீர்கள். டெச்ட்நெட் முகவரிகள் அல்லது கட்டண கோரிக்கைகளைப் பயன்படுத்தவும்.

# error_useMainnetRequest
source: You are connected to MAINNET. Please use MAINNET addresses or payment requests.
ta: நீங்கள் மெயின்நெட்டுடன் இணைக்கப்பட்டுள்ளீர்கள். மெயின்நெட் முகவரிகள் அல்லது கட்டண கோரிக்கைகளைப் பயன்படுத்தவும்.

# error_useRegtestRequest
source: You are connected to REGTEST network. Please use REGTEST addresses or payment requests.
ta: நீங்கள் ரெச்டெச்ட் நெட்வொர்க்குடன் இணைக்கப்பட்டுள்ளீர்கள். ரெச்டெச்ட் முகவரிகள் அல்லது கட்டண கோரிக்கைகளைப் பயன்படுத்தவும்.

# error_cameraPermissionRequired
source: To scan QR-Codes you have to allow BitBanana to use the camera.
ta: QR- குறியீடுகளை ச்கேன் செய்ய நீங்கள் பிட்பனானாவை கேமராவைப் பயன்படுத்த அனுமதிக்க வேண்டும்.

# error_emptyClipboardPayment
source: Your clipboard does not contain any payment data.
ta: உங்கள் கிளிப்போர்டில் எந்த கட்டண தரவும் இல்லை.

# error_emptyClipboardConnect
source: Your clipboard does not contain any connection data.
ta: உங்கள் கிளிப்போர்டில் எந்த இணைப்புத் தரவும் இல்லை.

# error_qr_code_result_null
source: Unable to read QR-Code, please try again.
ta: QR-குறியீட்டைப் படிக்க முடியவில்லை, தயவுசெய்து மீண்டும் முயற்சிக்கவும்.

# error_connection_unsupported_format
source: Unsupported connection format. Please use one of the following formats: - Lndconnect string (lndconnect://…) - Core Lightning grpc (cln-grpc://…) - LndHub (lndhub://…) - BtcPay Server connection (config=…) - Full content of your BTCPay Server config file
ta: ஆதரிக்கப்படாத இணைப்பு வடிவம். பின்வரும் வடிவங்களில் ஒன்றைப் பயன்படுத்தவும்: - lndconnect சரம் (lndconnect: //…) - கோர் மின்னல் சி.ஆர்.பி.சி (சி.எல்.என்-சி.ஆர்.பி.சி: //…) - lndhub (lndhub: //…) - btcpay சேவையக இணைப்பு (config =…) - உங்கள் BTCPAY சேவையக கட்டமைப்பு கோப்பின் முழு உள்ளடக்கம்

# error_unableToFetchBTCPayConfig
source: Could not fetch configuration from BTCPay Server.
ta: BTCPAY சேவையகத்திலிருந்து உள்ளமைவைப் பெற முடியவில்லை.

# error_connection_invalidLndConnectString
source: Invalid lndconnect string. Please make sure you used the following format: lndconnect://[ip]:[port]?cert=[…]&macaroon=[…]
ta: தவறான lndConnect சரம். பின்வரும் வடிவமைப்பை நீங்கள் பயன்படுத்தினீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்: lndconnect: // [ip]: [போர்ட்]? cert = […] & macaroon = […]

# error_connection_invalidLndHubConnectString
source: Invalid LndHub connection data. Please make sure you used the following format: lndhub://[user]:[password]@[host]
ta: தவறான lndhub இணைப்பு தரவு. பின்வரும் வடிவமைப்பை நீங்கள் பயன்படுத்தினீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்: lndhub: // [பயனர்]: [கடவுச்சொல்]@[ஓச்ட்]

# error_connection_invalid_certificate
source: The certificate is invalid.
ta: சான்றிதழ் தவறானது.

# error_connection_no_macaroon
source: Your connection information does not contain a macaroon. This is mandatory.
ta: உங்கள் இணைப்பு தகவலில் மெக்கரூன் இல்லை. இது கட்டாயமாகும்.

# error_connection_invalid_macaroon
source: The macaroon is invalid.
ta: மக்காரூன் தவறானது.

# error_connection_invalid_host_or_port
source: The provided host or port is invalid.
ta: வழங்கப்பட்ட புரவலன் அல்லது துறைமுகம் தவறானது.

# error_connection_invalid_macaroon2
source: Access denied! The macaroon is invalid.
ta: அணுகல் மறுக்கப்பட்டது! மக்காரூன் தவறானது.

# error_connection_server_unreachable
source: Timeout. The server is not responding. - Please make sure you have a good internet connection - Please make sure the server is running and still has the following IP: %1$s
ta: நேரம் முடிந்தது. சேவையகம் பதிலளிக்கவில்லை. - தயவுசெய்து உங்களுக்கு நல்ல இணைய இணைப்பு இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் - சேவையகம் இயங்குகிறது என்பதை உறுதிப்படுத்தவும், இன்னும் பின்வரும் ஐபி உள்ளது: %1$s

# error_connection_host_verification_failed_lnd
source: Hostname verification failed. The hostname of your connection does not match the hostname provided in the host certificate. You either have to disable certificate verification in the nodes connection settings or you have to recreate your certificate. Make sure the hostname is added to the lnd.conf as tlsextradomain before recreating it.
ta: ஓச்ட்பெயர் சரிபார்ப்பு தோல்வியடைந்தது. உங்கள் இணைப்பின் ஓச்ட்பெயர் புரவலன் சான்றிதழில் வழங்கப்பட்ட ஓச்ட்பெயருடன் பொருந்தவில்லை. முனைகள் இணைப்பு அமைப்புகளில் நீங்கள் சான்றிதழ் சரிபார்ப்பை முடக்க வேண்டும் அல்லது உங்கள் சான்றிதழை மீண்டும் உருவாக்க வேண்டும். ஓச்ட்பெயர் lnd.conf இல் tlsextradomain ஆக சேர்க்கப்படுவதை உறுதிசெய்து கொள்ளுங்கள்.

# error_connection_host_verification_failed
source: Hostname verification failed. The hostname of your connection does not match the hostname provided in the host certificate.
ta: ஓச்ட்பெயர் சரிபார்ப்பு தோல்வியடைந்தது. உங்கள் இணைப்பின் ஓச்ட்பெயர் புரவலன் சான்றிதழில் வழங்கப்பட்ட ஓச்ட்பெயருடன் பொருந்தவில்லை.

# error_connection_host_unresolvable
source: Host (%1$s) cannot be resolved. Please update your node connection settings if your node is now reachable under a different address or hostname.
ta: புரவலன் (%1$s) ஐ தீர்க்க முடியாது. உங்கள் முனை இப்போது வேறு முகவரி அல்லது ஓச்ட்பெயரின் கீழ் அடைய முடியும் என்றால் தயவுசெய்து உங்கள் முனை இணைப்பு அமைப்புகளைப் புதுப்பிக்கவும்.

# error_connection_lnd_unavailable
source: Connection failed. The host can be accessed, but the node service isn't responding. Please verify that the node is operational, that the port number (%1$s) is correct, and that port forwarding is set up.
ta: இணைப்பு தோல்வியடைந்தது. ஓச்டை அணுகலாம், ஆனால் முனை பணி பதிலளிக்கவில்லை. முனை செயல்படுகிறது என்பதை சரிபார்க்கவும், துறைமுகம் எண் (%1$s) சரியானது, மற்றும் அந்த துறைமுகம் பகிர்தல் அமைக்கப்பட்டுள்ளது.

# error_connection_network_unreachable
source: Unable to reach the host. Please make sure you have internet connection.
ta: ஓச்டை அடைய முடியவில்லை. உங்களுக்கு இணைய இணைப்பு இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# error_connection_unknown
source: Connection failed.
ta: இணைப்பு தோல்வியடைந்தது.

# error_connection_no_internet
source: No internet connection!
ta: இணைய இணைப்பு இல்லை!

# error_connection_tor_unreachable
source: Tor connection failed. Please turn on Tor in the nodes connection settings.
ta: டோர் இணைப்பு தோல்வியடைந்தது. முனைகள் இணைப்பு அமைப்புகளில் TOR ஐ இயக்கவும்.

# error_connection_tor_bootstrapping
source: Tor was unable to bootstrap. BitBanana natively supports Tor. If you use Orbot, please remove BitBanana from Orbot's Tor activated list or shutdown Orbot completely.
ta: டோர் தொடக்கவார் செய்ய முடியவில்லை. பிட்பனானா டோரை ஆதரிக்கிறது. நீங்கள் ஆர்போட்டைப் பயன்படுத்தினால், தயவுசெய்து ஆர்போட்டின் டோர் செயல்படுத்தப்பட்ட பட்டியலிலிருந்து பிட்பனானாவை அகற்றவும் அல்லது பணிநிறுத்தம் ஆர்போட்டை முழுவதுமாக அகற்றவும்.

# error_connection_wallet_locked
source: Please unlock the wallet.
ta: பணப்பையைத் திறக்கவும்.

# error_connection_btcpay_invalid_json
source: JSON syntax of the BTCPay server configuration is invalid.
ta: BTCPAY சேவையக உள்ளமைவின் சாதொபொகு தொடரியல் தவறானது.

# error_connection_btcpay_invalid_config
source: The BTCPay server configuration does not contain a BTC GRPC configuration.
ta: BTCPAY சேவையக உள்ளமைவில் BTC GRPC உள்ளமைவு இல்லை.

# error_connection_internal_server
source: The node is reachable but returns an internal error. This error might be caused by using a wrong port.
ta: முனை அடையக்கூடியது, ஆனால் உள் பிழையை வழங்குகிறது. தவறான துறைமுகத்தைப் பயன்படுத்துவதன் மூலம் இந்த பிழை ஏற்படலாம்.

# error_connection_internal_server_clearnet
source: The node is reachable but returns an internal error. This error might be caused by using a wrong port. As you are trying to connect to a node on clearnet, disabling Tor in the nodes connection settings might solve your problem.
ta: முனை அடையக்கூடியது, ஆனால் உள் பிழையை வழங்குகிறது. தவறான துறைமுகத்தைப் பயன்படுத்துவதன் மூலம் இந்த பிழை ஏற்படலாம். கிளியர்நெட்டில் ஒரு முனையுடன் இணைக்க நீங்கள் முயற்சிக்கும்போது, ​​முனைகளில் டோர் முடக்குவது உங்கள் சிக்கலை தீர்க்கக்கூடும்.

# error_connection_no_c_lightning_rest_support
source: Connecting BitBanana to Core Lightning via C-Lightning-Rest is not supported. Please check if your node shares cln-grpc connection details and use those for connection instead.
ta: சி-லைட்ங்-ரெச்ட் வழியாக பிட்பனானாவை மைய மின்னலுடன் இணைப்பது ஆதரிக்கப்படவில்லை. உங்கள் முனை CLN-GRPC இணைப்பு விவரங்களைப் பகிர்ந்து கொள்கிறதா என்பதைச் சரிபார்க்கவும், அதற்கு பதிலாக இணைப்பைப் பயன்படுத்தவும்.

# error_connection_clngrpc_invalidConnectString
source: Invalid cln-grpc connect string. Please make sure you used the following format: cln-grpc://[ip]:[port]?clientKey=[…]&clientCert=[…]&caCert=[…]
ta: தவறான CLN-GRPC இணைப்பு சரம். பின்வரும் வடிவமைப்பை நீங்கள் பயன்படுத்தினீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்: cln-grpc: // [ip]: [போர்ட்]? கிளையண்ட்ச்கி = […] & வாங்கி கோர்ட் = […] & cacert = […]

# error_connection_clngrpc_invalidCertificateOrKey
source: A provided certificate or key is invalid.
ta: வழங்கப்பட்ட சான்றிதழ் அல்லது விசை தவறானது.

# error_connection_clngrpc_missingClientCert
source: The mandatory client certificate is missing.
ta: கட்டாய கிளையன்ட் சான்றிதழ் இல்லை.

# error_connection_clngrpc_missingClientKey
source: The mandatory client key is missing.
ta: கட்டாய கிளையன்ட் விசை இல்லை.

# error_connection_clngrpc_parameterDecodingFailed
source: The provided connection string for cln-grpc is invalid as the parameters are not encoded in base64url format.
ta: CLN-GRPC க்கான வழங்கப்பட்ட இணைப்பு சரம் தவறானது, ஏனெனில் அளவுருக்கள் BASE64URL வடிவத்தில் குறியாக்கம் செய்யப்படவில்லை.

# error_connection_rest_authentication
source: Failed to authenticate with the Rest API.
ta: REST பநிஇ உடன் அங்கீகரிக்கத் தவறிவிட்டது.

# error_wrong_password
source: Wrong password
ta: தவறான கடவுச்சொல்

# error_invalid_data_to_create_channel
source: Invalid format. Please use one of the following: - pubkey - pubkey@host - pubkey@host:port - LNURL-Channel
ta: தவறான வடிவம். பின்வருவனவற்றில் ஒன்றைப் பயன்படுத்தவும்: - பப்கே - பப்கே@ஓச்ட் - பப்கே@ஓச்ட்: துறைமுகம் - lnurl-channel

# error_lightning_uri_invalid
source: Invalid format. Please use one of the following: - pubkey - pubkey@host - pubkey@host:port
ta: தவறான வடிவம். பின்வருவனவற்றில் ஒன்றைப் பயன்படுத்தவும்: - பப்கே - பப்கே@ஓச்ட் - பப்கே@ஓச்ட்: துறைமுகம்

# error_channel_open_node_setup
source: You first have to connect to a node before opening a channel.
ta: சேனலைத் திறப்பதற்கு முன் நீங்கள் முதலில் ஒரு முனையுடன் இணைக்க வேண்டும்.

# error_connect_peer
source: Could not establish connection to peer node.
ta: பியர் முனைக்கு இணைப்பை நிறுவ முடியவில்லை.

# error_connect_peer_refused
source: Connection has been refused by peer.
ta: இணைப்பை பியர் மறுத்துவிட்டார்.

# error_connect_peer_self
source: Cannot make connection to self.
ta: சுயத்துடன் தொடர்பு கொள்ள முடியாது.

# error_connect_peer_no_host
source: Cannot connect to node without IP-address or host.
ta: ஐபி முகவரி அல்லது புரவலன் இல்லாமல் முனையுடன் இணைக்க முடியாது.

# error_connect_peer_timeout
source: Could not connect to peer within deadline.
ta: காலக்கெடுவிற்குள் சகாக்களுடன் இணைக்க முடியவில்லை.

# error_channel_open_pending_max
source: Number of pending channels exceed maximum.
ta: நிலுவையில் உள்ள சேனல்களின் எண்ணிக்கை அதிகபட்சத்தை விட அதிகமாக உள்ளது.

# error_channel_open_timeout
source: Channel could not be opened within deadline.
ta: காலக்கெடுவிற்குள் சேனலைத் திறக்க முடியவில்லை.

# error_channel_open
source: Could not open channel with connected node: %s
ta: இணைக்கப்பட்ட முனையுடன் சேனலைத் திறக்க முடியவில்லை: %s

# error_get_peers
source: Could not fetch peers list.
ta: சகாக்களின் பட்டியலைப் பெற முடியவில்லை.

# error_get_peers_timeout
source: Peers could not be fetched within deadline.
ta: காலக்கெடுவிற்குள் சகாக்களைப் பெற முடியவில்லை.

# error_channel_close_offline
source: Peer is offline. Only force close allowed.
ta: பியர் ஆஃப்லைனில் உள்ளது. அனுமதிக்கப்பட்ட படை மட்டுமே.

# error_channel_close_timeout
source: Channel could not be closed within deadline.
ta: காலக்கெடுவிற்குள் சேனலை மூட முடியவில்லை.

# error_channel_close
source: Could not close channel: %s
ta: சேனலை மூட முடியவில்லை: %s

# error_pin_deactivation_attempt
source: It looks like someone tried to deactivate your PIN. The App will close now. You can reinstall the app and use the recovery process to regain access to your funds.
ta: உங்கள் முள் செயலிழக்க யாரோ முயற்சித்ததாகத் தெரிகிறது. பயன்பாடு இப்போது மூடப்படும். உங்கள் நிதிகளுக்கான அணுகலை மீண்டும் பெற நீங்கள் பயன்பாட்டை மீண்டும் நிறுவலாம் மற்றும் மீட்பு செயல்முறையைப் பயன்படுத்தலாம்.

# error_empty_node_name
source: An empty name is not allowed.
ta: வெற்று பெயர் அனுமதிக்கப்படவில்லை.

# error_invalid_bitcoin_request
source: Invalid bitcoin request.
ta: தவறான பிட்காயின் கோரிக்கை.

# error_payment_invalid_details
source: The payment details did not match the details specified by the invoice you are trying to pay.
ta: கட்டண விவரங்கள் நீங்கள் செலுத்த முயற்சிக்கும் விலைப்பட்டியல் மூலம் குறிப்பிடப்பட்ட விவரங்களுடன் பொருந்தவில்லை.

# error_payment_timeout
source: Timeout. No route could be found.
ta: நேரம் முடிந்தது. எந்த வழியையும் காண முடியவில்லை.

# error_payment_no_route
source: No route was found that respects your fee limit of %1$.1f%%. Increasing your fee limit in the settings or opening new channels might solve the problem.
ta: உங்கள் கட்டண வரம்பை%1 $ .1f %% மதிக்கும் எந்த வழியும் கண்டறியப்படவில்லை. அமைப்புகளில் உங்கள் கட்டண வரம்பை அதிகரிப்பது அல்லது புதிய சேனல்களைத் திறப்பது சிக்கலைத் தீர்க்கலாம்.

# error_payment_no_route_small_amount
source: No route was found. You are trying to send an amount that is so small, that many channels might not route it. Please check your the routing settings for your own channels and adapt the MinHTLC value if necessary.
ta: எந்த வழியும் கிடைக்கவில்லை. நீங்கள் ஒரு சிறிய தொகையை அனுப்ப முயற்சிக்கிறீர்கள், பல சேனல்கள் அதை வழிநடத்தக்கூடாது. உங்கள் சொந்த சேனல்களுக்கான ரூட்டிங் அமைப்புகளைச் சரிபார்த்து, தேவைப்பட்டால் MinHTLC மதிப்பை மாற்றியமைக்கவும்.

# error_payment_insufficient_balance
source: The amount to pay is bigger than what you can send over lightning with your current open channels.
ta: உங்கள் தற்போதைய திறந்த சேனல்களுடன் மின்னல் அனுப்பக்கூடியதை விட பணம் செலுத்த வேண்டிய தொகை பெரியது.

# error_payment_keysend_not_enabled_on_remote
source: Please make sure the recipient has enabled the keysend feature.
ta: பெறுநர் கீசெண்ட் அம்சத்தை இயக்கியுள்ளார் என்பதை உறுதிப்படுத்தவும்.

# error_only_payment_data_allowed
source: Only payment data is allowed here.
ta: கட்டண தரவு மட்டுமே இங்கே அனுமதிக்கப்படுகிறது.

# error_node_not_yet_ready
source: Your node is not fully synced yet. Please try again later.
ta: உங்கள் முனை இன்னும் முழுமையாக ஒத்திசைக்கப்படவில்லை. தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும்.

# error_tor_blocked_lnurl
source: %1$s seems to block request coming from the Tor network. You might try switching Tor off in the settings or contact the service and request them to update their cloudflare rules.
ta: %1$s TOR நெட்வொர்க்கிலிருந்து வரும் கோரிக்கையைத் தடுப்பதாகத் தெரிகிறது. நீங்கள் அமைப்புகளில் டோர் அணைக்க முயற்சி செய்யலாம் அல்லது சேவையைத் தொடர்பு கொண்டு அவற்றின் கிளவுட்ஃப்ளேர் விதிகளைப் புதுப்பிக்குமாறு கோரலாம்.
