Repository: 247i/TACETr
Catalog: உரை/தானி/calyxos-seedvault-*.po
Languages: ta

# backup_app_check_error_no_snapshots
source: We could not find any backup. Please run a successful backup first and then try checking again.
ta: எங்களால் எந்த காப்புப்பிரதியும் கண்டுபிடிக்க முடியவில்லை. முதலில் வெற்றிகரமான காப்புப்பிரதியை இயக்கவும், பின்னர் மீண்டும் சரிபார்க்க முயற்சிக்கவும்.

# backup_app_check_error_only_broken_snapshots
source: We found %1$d backup snapshots. However, all of them were corrupted. Please run a successful backup and then try checking again.
ta: %1$d காப்பு ச்னாப்சாட்களைக் கண்டோம். இருப்பினும், அவை அனைத்தும் சிதைந்தன. தயவுசெய்து ஒரு வெற்றிகரமான காப்புப்பிரதியை இயக்கவும், பின்னர் மீண்டும் சரிபார்க்க முயற்சிக்கவும்.

# backup_app_check_error_has_snapshots
source: We found %1$d backup snapshots, some of them are corrupt or have errors. Below are the backups that could be restored.
ta: நாங்கள் %1$d காப்பு ச்னாப்சாட்களைக் கண்டறிந்தோம், அவற்றில் சில ஊழல் நிறைந்தவை அல்லது பிழைகள் உள்ளன. மீட்டெடுக்கக்கூடிய காப்புப்பிரதிகள் கீழே உள்ளன.

# backup_app_check_error_no_result
source: We lost the detailed results. Did a long time pass since running the check? Try running again.
ta: விரிவான முடிவுகளை இழந்தோம். காசோலையை இயக்கியதிலிருந்து நீண்ட நேரம் கடந்துவிட்டதா? மீண்டும் இயங்க முயற்சிக்கவும்.

# backup_section_system
source: System data
ta: கணினி தரவு

# backup_sms
source: SMS text messages
ta: எச்எம்எச் உரை செய்திகள்

# backup_settings
source: Device settings
ta: சாதன அமைப்புகள்

# backup_call_log
source: Call history
ta: அழைப்பு வரலாறு

# backup_contacts
source: Local contacts
ta: உள்ளூர் தொடர்புகள்

# backup_system_apps
source: System apps
ta: கணினி பயன்பாடுகள்

# backup_section_user
source: Apps
ta: பயன்பாடுகள்

# backup_app_stopped_button
source: Launch
ta: ஏவுதல்

# backup_app_stopped_no_intent
source: Cannot launch app
ta: பயன்பாட்டைத் தொடங்க முடியாது

# backup_app_not_yet_backed_up
source: Waiting to back up…
ta: காப்புப் பிரதி எடுக்க காத்திருக்கிறது …

# restore_app_not_yet_backed_up
source: Was not yet backed up
ta: இன்னும் காப்புப் பிரதி எடுக்கப்படவில்லை

# backup_app_in_progress
source: Backing up
ta: காப்புப்பிரதி

# backup_app_success
source: Backed up
ta: காப்புப் பிரதி எடுக்கப்பட்டது

# backup_app_warning
source: Backup warning
ta: காப்புப்பிரதி எச்சரிக்கை

# backup_app_was_stopped
source: Not backed up as it wasn't used recently
ta: சமீபத்தில் பயன்படுத்தப்படாததால் காப்புப் பிரதி எடுக்கப்படவில்லை

# restore_app_was_stopped
source: Was not backed up as it hadn't been used recently
ta: சமீபத்தில் பயன்படுத்தப்படாததால் காப்புப் பிரதி எடுக்கப்படவில்லை

# backup_app_no_data
source: App reported no data for backup
ta: காப்புப்பிரதிக்கு தரவு இல்லை என்று பயன்பாடு தெரிவித்தது

# restore_app_not_allowed
source: App didn't allow backup
ta: காப்புப்பிரதியை ஆப்ஸ் அனுமதிக்கவில்லை

# backup_app_quota_exceeded
source: Backup quota exceeded
ta: காப்புபிரதி ஒதுக்கீடு முடிவுற்றது

# restore_app_quota_exceeded
source: Backup quota was exceeded
ta: காப்புபிரதி ஒதுக்கீடு முன்பே முடிவுற்றது

# restore_app_not_installed
source: App not installed
ta: பயன்பாடு நிறுவப்படவில்லை

# restore_title
source: Restore from backup
ta: காப்புப்பிரதியிலிருந்து மீட்டெடுக்கவும்

# restore_choose_restore_set
source: Choose a backup to restore
ta: மீட்டமைக்க ஒரு காப்புப்பிரதியைத் தேர்வு செய்யவும்

# restore_restore_set_apps
source: Has user data for <xliff:g example="42" id="apps">%1$d</xliff:g> apps (<xliff:g example="1 GB" id="size">%2$s</xliff:g>)
ta: <Xliff: g எடுத்துக்காட்டு = "42" அடையாளம் = "பயன்பாடுகள்">%1$d </xliff: g> பயன்பாடுகள் (<xliff: g எடுத்துக்காட்டு = "1 சிபி" அடையாளம் = "அளவு">%2$s </xliff: g>)

# restore_restore_set_apps_no_size
source: Has user data for <xliff:g example="42" id="apps">%1$d</xliff:g> apps
ta: <Xliff: g எடுத்துக்காட்டு = "42" அடையாளம் = "apps">%1$d </xliff: g> பயன்பாடுகள்

# restore_restore_set_apks
source: Contains <xliff:g example="42" id="apps">%1$d</xliff:g> apps (<xliff:g example="1 GB" id="size">%2$s</xliff:g>)
ta: <Xliff: g எடுத்துக்காட்டு = "42" அடையாளம் = "பயன்பாடுகள்">%1$d </xliff: g> பயன்பாடுகள் (<xliff: g எடுத்துக்காட்டு = "1 சிபி" அடையாளம் = "அளவு">%2$s </xliff: g>)

# restore_restore_set_apks_no_size
source: Contains <xliff:g example="42" id="apps">%1$d</xliff:g> apps
ta: <Xliff: g எடுத்துக்காட்டு = "42" அடையாளம் = "பயன்பாடுகள்">%1$d </xliff: g> பயன்பாடுகள் உள்ளன

# restore_restore_set_can_not_get_restored
source: This backup has some errors. You may be able to restore it partly.
ta: இந்த காப்புப்பிரதியில் சில பிழைகள் உள்ளன. நீங்கள் அதை ஓரளவு மீட்டெடுக்க முடியும்.

# restore_skip
source: Don't restore
ta: மீட்டெடுக்க வேண்டாம்

# restore_skip_apps
source: Skip restoring apps
ta: மீட்டெடுக்கும் பயன்பாடுகளைத் தவிர்க்கவும்

# restore_invalid_location_title
source: No backups found
ta: காப்பு இல்லை

# restore_invalid_location_message
source: We could not find any backups at this location. Please choose another location that contains a %s folder.
ta: இந்த இடத்தில் எந்த காப்புப்பிரதிகளையும் எங்களால் கண்டுபிடிக்க முடியவில்லை. %s கோப்புறையைக் கொண்ட மற்றொரு இடத்தைத் தேர்வு செய்யவும்.

# restore_set_error
source: An error occurred while loading the backups:
ta: காப்புப்பிரதிகளை ஏற்றும்போது பிழை ஏற்பட்டது:

# restore_set_empty_result
source: No suitable backups found at given location. This is most likely due to a wrong recovery code or a storage error.
ta: கொடுக்கப்பட்ட இடத்தில் பொருத்தமான காப்புப்பிரதிகள் இல்லை. இது பெரும்பாலும் தவறான மீட்பு குறியீடு அல்லது சேமிப்பக பிழை காரணமாக இருக்கலாம்.

# restore_set_bad_decrypt
source: Could not decrypt backups. The current recovery code is most likely not the one that was used to make the backup.
ta: காப்புப்பிரதிகளை மறைகுறியாக்க முடியவில்லை. தற்போதைய மீட்புக் குறியீடு பெரும்பாலும் காப்புப்பிரதியை உருவாக்க பயன்படுத்தப்பட்ட ஒன்றல்ல.

# restore_set_button_try_again
source: Try again
ta: மீண்டும் முயற்சிக்கவும்

# restore_set_button_restart
source: Start from beginning
ta: ஆரம்பத்தில் இருந்து தொடங்குங்கள்

# restore_select_packages
source: Select apps to restore
ta: மீட்டமைக்க பயன்பாடுகளைத் தேர்ந்தெடுக்கவும்

# restore_select_packages_all
source: All of the following apps
ta: பின்வரும் பயன்பாடுகள் அனைத்தும்

# restore_recycle_backup_title
source: Reuse this backup?
ta: இந்த காப்புப்பிரதியை மீண்டும் பயன்படுத்தவா?

# restore_recycle_backup_text
source: You can reuse the backup '%s' you just restored on this device. This will make new backups faster and use less data. However, your old device will lose access to this backup. If you would like to keep the access for your old device, you can create a new backup instead. This will use more data than reusing the existing backup.
ta: இந்த சாதனத்தில் நீங்கள் மீட்டெடுத்த '%s' காப்புப்பிரதியை மீண்டும் பயன்படுத்தலாம். இது புதிய காப்புப்பிரதிகளை விரைவாக உருவாக்கும் மற்றும் குறைந்த தரவைப் பயன்படுத்தும். இருப்பினும், உங்கள் பழைய சாதனம் இந்த காப்புப்பிரதிக்கான அணுகலை இழக்கும். உங்கள் பழைய சாதனத்திற்கான அணுகலை நீங்கள் வைத்திருக்க விரும்பினால், அதற்கு பதிலாக புதிய காப்புப்பிரதியை உருவாக்கலாம். தற்போதுள்ள காப்புப்பிரதியை மீண்டும் பயன்படுத்துவதை விட இது அதிக தரவைப் பயன்படுத்தும்.

# restore_recycle_backup_button_no
source: Create new backup
ta: புதிய காப்புப்பிரதியை உருவாக்கவும்

# restore_recycle_backup_button_yes
source: Reuse backup
ta: காப்புப்பிரதியை மீண்டும் பயன்படுத்தவும்

# restore_installing_packages
source: Re-installing apps
ta: பயன்பாடுகளை மீண்டும் நிறுவுதல்

# restore_app_status_installing
source: Re-installing
ta: மீண்டும் நிறுவுதல்

# restore_app_status_installed
source: Re-installed
ta: மீண்டும் நிறுவப்பட்டது

# restore_app_status_install_error
source: Could not install
ta: நிறுவ முடியவில்லை

# restore_app_status_restored
source: Data restored
ta: தரவு மீட்டெடுக்கப்பட்டது

# restore_app_status_failed
source: Restore failed
ta: மீட்டமை தோல்வியடைந்தது

# restore_app_status_warning
source: Restore warning
ta: எச்சரிக்கையை மீட்டமை

# restore_installing_error_title
source: Some apps not installed
ta: சில பயன்பாடுகள் நிறுவப்படவில்லை

# restore_installing_error_message
source: Data can only be restored if an app is installed. Tap failed apps to try to install them manually before proceeding.
ta: பயன்பாடு நிறுவப்பட்டிருந்தால் மட்டுமே தரவை மீட்டெடுக்க முடியும். தொடர்வதற்கு முன் அவற்றை கைமுறையாக நிறுவ முயற்சிக்க தோல்வியுற்ற பயன்பாடுகளைத் தட்டவும்.

# restore_installing_tap_to_install
source: Tap to install
ta: நிறுவ தட்டவும்

# error_no_store
source: Error: No app store installed
ta: பிழை: ஆப் கடை எதுவும் நிறுவப்படவில்லை

# restore_next
source: Next
ta: அடுத்தது

# restore_restoring
source: Restoring backup
ta: காப்புப்பிரதியை மீட்டமைத்தல்

# restore_restoring_error_title
source: Unable to restore some apps
ta: சில பயன்பாடுகளை மீட்டெடுக்க முடியவில்லை

# restore_restoring_error_message
source: You can re-install these apps manually and Automatic restore will attempt to restore their data (when enabled).
ta: நீங்கள் இந்த பயன்பாடுகளை கைமுறையாக மீண்டும் நிறுவலாம் மற்றும் தானியங்கி மீட்பு அவற்றின் தரவை மீட்டெடுக்க முயற்சிக்கும் (இயக்கப்பட்ட போது).

# restore_magic_package
source: System package manager
ta: கணினி தொகுப்பு மேலாளர்

# restore_finished_success
source: Restore complete
ta: மீட்பு முடிந்தது

# restore_finished_error
source: An error occurred while restoring the backup.
ta: காப்புப்பிரதியை மீட்டெடுக்கும் போது பிழை ஏற்பட்டது.

# restore_finished_button
source: Finish
ta: முடிக்கவும்

# restore_storage_skip
source: Skip restoring files
ta: மீட்டெடுக்கும் கோப்புகளைத் தவிர்க்கவும்

# restore_storage_choose_snapshot
source: Choose a file backup to restore (beta)
ta: மீட்டமைக்க (பீட்டா) கோப்பு காப்புப்பிரதியைத் தேர்வுசெய்க

# restore_storage_selection_description
source: Selected files will be restored. Tap folders to see files in them.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்புகள் மீட்டமைக்கப்படும். கோப்புறைகளை அவற்றில் உள்ள கோப்புகளைக் காண தட்டவும்.

# restore_storage_in_progress_title
source: Files are being restored…
ta: கோப்புகள் மீட்டெடுக்கப்படுகின்றன…

# restore_storage_in_progress_info
source: Your files are being restored in the background. You can start using your phone while this is running. Some apps (e.g. Signal or WhatsApp) might require files to be fully restored to import a backup. Try to avoid starting those apps before file restore is complete.
ta: உங்கள் கோப்புகள் பின்னணியில் மீட்டெடுக்கப்படுகின்றன. இது இயங்கும்போது உங்கள் தொலைபேசியைப் பயன்படுத்தத் தொடங்கலாம். சில பயன்பாடுகளுக்கு (எ.கா. சிக்னல் அல்லது வாட்ச்அப்) காப்புப்பிரதியை இறக்குமதி செய்ய கோப்புகளை முழுமையாக மீட்டெடுக்க வேண்டும். கோப்பு மீட்டெடுப்பு நிறைவடைவதற்கு முன்பு அந்த பயன்பாடுகளைத் தொடங்குவதைத் தவிர்க்க முயற்சிக்கவும்.

# restore_storage_got_it
source: Got it
ta: கிடைத்தது

# storage_internal_warning_title
source: Warning
ta: எச்சரிக்கை

# storage_internal_warning_message
source: You have chosen internal storage for your backup. This will not be available when your phone is lost or broken.
ta: உங்கள் காப்பெடுப்புக்காக உள் சேமிப்பகத்தைத் தேர்ந்தெடுத்துள்ளீர்கள். உங்கள் தொலைபேசி தொலைந்து போகும்போது அல்லது உடைந்தால் தகவல்களை மீட்டெடுக்க முடியாது.

# storage_internal_warning_choose_other
source: Choose other
ta: மற்றதை தேர்வு செய்யவும்

# storage_internal_warning_use_anyway
source: Use anyway
ta: எப்படியாவது பயன்படுத்தவும்

# about_title
source: About
ta: பற்றி

# about_summary
source: A backup application using Android's internal backup API. It is Free Software, released under Apache 2 license. Like all software, Seedvault may contain bugs or vulnerabilities.
ta: ஆண்ட்ராய்டு இன் உள் காப்புப்பிரதி பநிஇ ஐப் பயன்படுத்தி காப்புப்பிரதி பயன்பாடு. இது இலவச மென்பொருள், அப்பாச்சி 2 உரிமத்தின் கீழ் வெளியிடப்பட்டது. எல்லா மென்பொருளையும் போலவே, விதைப்பகுதியும் பிழைகள் அல்லது பாதிப்புகள் இருக்கலாம்.

# about_version
source: Version: %s
ta: பதிப்பு: %s

# about_contributor_headline
source: Contributors
ta: பங்களிப்பாளர்கள்

# about_contributor_content
source: Please see GitHub for a <a href="https://github.com/seedvault-app/seedvault/graphs/contributors">list of contributors</a>.
ta: தயவுசெய்து ஒரு <a href="https://github.com/seedvault-app/seedvault/graphs/contributors"> பங்களிப்பாளர்களின் பட்டியல் </a>.

# about_contributing_organizations_title
source: Contributing Organizations
ta: பங்களிப்பு நிறுவனங்கள்

# about_contributing_organizations_content
source: <a href="https://www.calyxinstitute.org">Calyx Institute</a> for use in <a href="https://calyxos.org">CalyxOS</a> <a href="https://nlnet.nl/project/Seedvault/">NGI0 PET Fund by NLnet</a> <a href="https://nlnet.nl/project/SeedVault-Integrity/">NGI0 Entrust Fund by NLnet</a>
ta: <a href="https://www.calyxinstitute.org"> கலிக்ச் இன்ச்டிடியூட் </a> <a href="https://calyxos.org"> கலிக்சோச் </a> இல் பயன்படுத்த <a href="https://nlnet.nl/project/seedvault/"> ngi0 PET FUND by nlnet </a>
