Repository: 247i/TACETr
Catalog: உரை/தானி/calyxos-seedvault-*.po
Languages: ta

# app_name
source: Seedvault
ta: சீட்வால்ட்

source: Backup
ta: காப்பு

# data_management_label
source: Seedvault Backup
ta: விதை பெட்டக காப்பு

# current_destination_string
source: Backup status and settings
ta: காப்பு நிலை மற்றும் அமைப்புகள்

# first_start_text
source: Do you want to restore your device from an existing backup or start a new backup?
ta: ஏற்கனவே உள்ள காப்புப்பிரதியிலிருந்து உங்கள் சாதனத்தை மீட்டெடுக்க விரும்புகிறீர்களா அல்லது புதிய காப்புப்பிரதியைத் தொடங்க விரும்புகிறீர்களா?

# restore_backup_button
source: Restore backup
ta: காப்புப்பிரதியை மீட்டெடு

# setup_button
source: Start new
ta: புதியதைத் தொடங்குங்கள்

# settings_category_apps
source: App backup
ta: பயன்பாட்டு காப்புப்பிரதி

# settings_backup
source: Backup my apps
ta: எனது பயன்பாடுகளை காப்புப் பிரதி எடுக்கவும்

# settings_backup_location
source: Backup location
ta: காப்பு இடம்

# settings_backup_location_none
source: None
ta: எதுவுமில்லை

# settings_backup_location_internal
source: Internal storage
ta: உள் நினைவகம்

# settings_backup_last_backup_never
source: Never
ta: ஒருபோதும்

# settings_backup_dialog_title
source: Really turn off app backups?
ta: பயன்பாட்டு காப்புப்பிரதிகளை உண்மையில் அணைக்கவா?

# settings_backup_dialog_message
source: When you turn backups on again, the backup process may take longer than usual, and it will use additional storage space.
ta: நீங்கள் மீண்டும் காப்புப்பிரதிகளை இயக்கும்போது, காப்பு செயல்முறை வழக்கத்தை விட அதிக நேரம் ஆகலாம், மேலும் இது கூடுதல் சேமிப்பக இடத்தைப் பயன்படுத்தும்.

# settings_backup_dialog_disable
source: Turn off anyway
ta: எப்படியும் அணைக்கவும்

# settings_info
source: All backups are encrypted on your phone. To restore from backup you will need your 12-word recovery code.
ta: அனைத்து காப்புப்பிரதிகளும் உங்கள் தொலைபேசியில் குறியாக்கம் செய்யப்பட்டுள்ளன. காப்புப்பிரதியிலிருந்து மீட்டமைக்க உங்களுக்கு உங்கள் 12-வார்த்தை மீட்பு குறியீடு தேவைப்படும்.

# settings_auto_restore_title
source: Automatic restore
ta: தானியங்கி மீட்பு

# settings_auto_restore_summary
source: When reinstalling an app, restore backed up settings and data.
ta: ஒரு செயலியை மீண்டும் நிறுவும் போது, காப்புப் பிரதி எடுத்த அமைப்புகள் மற்றும் தரவை மீட்டெடுக்கவும்.

# settings_auto_restore_summary_usb
source: Note: Your %1$s needs to be plugged in for this to work.
ta: குறிப்பு: இது வேலை செய்ய உங்கள் %1$s செருகப்பட வேண்டும்.

# settings_category_app_data_backup
source: App data backup
ta: செயலி தரவு காப்பு

# settings_backup_apk_title
source: APK backups
ta: செயலி காப்புகள்

# settings_backup_apk_summary
source: Backs up the apps themselves. Otherwise, only app data will get backed up.
ta: செயலிகள் தாங்களே காப்புப் பிரதி எடுக்கும். இல்லையெனில், செயலித் தரவு மட்டுமே காப்புப் பிரதி எடுக்கப்படும்.

# settings_backup_apk_dialog_title
source: Really disable APK backups?
ta: பயன்பாட்டு காப்புப்பிரதிகளை உண்மையில் முடக்கவா?

# settings_backup_apk_dialog_message
source: After disabling APK backups, app data will still be backed up. However, it will not get restored automatically. You will need to install all your apps manually while having "Automatic Restore" switched on.
ta: APK காப்புப்பிரதிகளை முடக்கிய பின், பயன்பாட்டு தரவு இன்னும் காப்புப் பிரதி எடுக்கப்படும். இருப்பினும், அது தானாக மீட்டெடுக்கப்படாது. "தானியங்கி மீட்டெடுப்பு" இயக்கப்பட்டிருக்கும் போது உங்கள் எல்லா பயன்பாடுகளையும் கைமுறையாக நிறுவ வேண்டும்.

# settings_backup_apk_dialog_cancel
source: Cancel
ta: ரத்து

# settings_backup_apk_dialog_disable
source: Disable APK backups
ta: APK காப்புப்பிரதிகளை முடக்கு

# settings_backup_status_title
source: Backup status
ta: காப்பு நிலை

# settings_backup_status_summary
source: Last backup: %1$s
ta: கடைசி காப்பு: %1$s

# settings_backup_status_next_backup
source: Next backup: %1$s
ta: அடுத்த காப்புப்பிரதி: %1$s

# settings_backup_status_next_backup_estimate
source: Next backup (estimate): %1$s
ta: அடுத்த காப்புப்பிரதி (மதிப்பீடு): %1$s

# settings_backup_status_next_backup_past
source: once conditions are fulfilled
ta: நிபந்தனைகள் நிறைவு செய்யப்பட்டவுடன்

# settings_backup_status_next_backup_usb
source: Backups will happen automatically when you plug in your USB drive
ta: உங்கள் யூ.எச்.பி டிரைவை செருகும்போது காப்புப்பிரதிகள் தானாகவே நடக்கும்

# settings_backup_scheduling_title
source: Backup scheduling
ta: காப்பு திட்டமிடல்

# settings_backup_app_check_title
source: Check integrity
ta: ஒருமைப்பாட்டை சரிபார்க்கவும்

# settings_backup_app_check_summary
source: Ensure that backup is working for restore
ta: மீட்டெடுப்பதற்கு காப்புப்பிரதி செயல்படுகிறது என்பதை உறுதிப்படுத்தவும்

# settings_backup_exclude_apps
source: Exclude apps
ta: செயலிகளை விலக்கு

# settings_backup_now
source: Backup now
ta: இப்பொழுது காப்பெடு

# settings_category_storage
source: File backup (beta)
ta: கோப்பு காப்புப்பிரதி (பீட்டா)

# settings_backup_storage_title
source: Backup my files
ta: எனது கோப்புகளை காப்புப் பிரதி எடுக்கவும்

# settings_backup_files_title
source: Included files and folders
ta: கோப்புகள் மற்றும் கோப்புறைகள் சேர்க்கப்பட்டுள்ளன

# settings_backup_files_summary
source: None
ta: எதுவுமில்லை

# settings_backup_file_check_title
source: Check backup integrity
ta: காப்பு ஒருமைப்பாட்டை சரிபார்க்கவும்

# settings_backup_file_check_summary
source: Make sure my backup is working for restoring files
ta: கோப்புகளை மீட்டெடுப்பதற்காக எனது காப்புப்பிரதி செயல்படுகிறது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்

# settings_backup_recovery_code
source: Recovery code
ta: மீட்பு குறியீடு

# settings_backup_recovery_code_summary
source: Verify existing code or generate a new one
ta: ஏற்கனவே உள்ள குறியீட்டைச் சரிபார்க்கவும் அல்லது புதிய குறியீட்டை உருவாக்கவும்

# settings_backup_storage_dialog_title
source: Beta feature
ta: பீட்டா நற்பொருத்தம்

# settings_backup_storage_dialog_message
source: Backing up files is beta and might not work. Do not rely on it for important data.
ta: கோப்புகளை காப்புப் பிரதி எடுப்பது பீட்டா மற்றும் வேலை செய்யாது. முக்கியமான தரவுகளுக்கு அதை நம்ப வேண்டாம்.

# settings_backup_storage_dialog_ok
source: Enable anyway
ta: எப்படியும் இயக்கு

# settings_backup_storage_battery_optimization
source: Warning: No automatic backups, because battery optimization is active.
ta: எச்சரிக்கை: தானியங்கி காப்புப்பிரதிகள் இல்லை, ஏனெனில் பேட்டரி தேர்வுமுறை செயலில் உள்ளது.

# settings_backup_new_code_dialog_title
source: New recovery code required
ta: புதிய மீட்பு குறியீடு தேவை

# settings_backup_new_code_dialog_message
source: To continue using app backups, you need to generate a new recovery code. We are sorry for the inconvenience.
ta: பயன்பாட்டு காப்புப்பிரதிகளைத் தொடர்ந்து பயன்படுத்த, நீங்கள் புதிய மீட்புக் குறியீட்டை உருவாக்க வேண்டும். சிரமத்திற்கு வருந்துகிறோம்.

# settings_backup_new_code_code_dialog_ok
source: New code
ta: புதிய குறியீடு

# settings_backup_metered_title
source: Backup stopped
ta: காப்புப்பிரதி நிறுத்தப்பட்டது

# settings_backup_metered_text
source: The backup won't proceed because your device is using mobile data. You can enable backups on mobile data under "Backup scheduling".
ta: உங்கள் சாதனம் மொபைல் தரவைப் பயன்படுத்துவதால் காப்புப்பிரதி தொடராது. "காப்பு திட்டமிடல்" இன் கீழ் மொபைல் தரவுகளில் காப்புப்பிரதிகளை இயக்கலாம்.

# settings_scheduling_frequency_title
source: Backup frequency
ta: காப்பு அதிர்வெண்

# settings_scheduling_frequency_12_hours
source: Every 12 hours
ta: ஒவ்வொரு 12 மணி நேரமும்

# settings_scheduling_frequency_daily
source: Daily
ta: நாள்தோறும்

# settings_scheduling_frequency_3_days
source: Every 3 days
ta: ஒவ்வொரு 3 நாட்களுக்கும்

# settings_scheduling_frequency_weekly
source: Weekly
ta: வாராந்திர

# settings_scheduling_category_conditions_title
source: Conditions
ta: நிபந்தனைகள்

# settings_scheduling_metered_title
source: Back up when using mobile data
ta: மொபைல் தரவைப் பயன்படுத்தும் போது காப்புப் பிரதி எடுக்கவும்

# settings_scheduling_charging_title
source: Back up only when charging
ta: கட்டணம் வசூலிக்கும்போது மட்டுமே காப்புப் பிரதி எடுக்கவும்

# settings_app_check_title
source: Verify app backup integrity
ta: பயன்பாட்டு காப்புப்பிரதி ஒருமைப்பாட்டை சரிபார்க்கவும்

# settings_app_check_text
source: Each backup process will automatically check the backup integrity. However, to save time, actual app data will not be downloaded and verified.
ta: ஒவ்வொரு காப்பு செயல்முறையும் தானாகவே காப்பு ஒருமைப்பாட்டை சரிபார்க்கும். இருப்பினும், நேரத்தை மிச்சப்படுத்த, உண்மையான பயன்பாட்டு தரவு பதிவிறக்கம் செய்யப்பட்டு சரிபார்க்கப்படாது.

# settings_app_check_text2
source: Here you can run a one-time check to verify your app backup. Select how much of the app data should be downloaded for the check. The more you select, the longer it will take, yet the more reliable the check will be. This will run in the background and show a notification once the check is done.
ta: உங்கள் பயன்பாட்டு காப்புப்பிரதியை சரிபார்க்க இங்கே நீங்கள் ஒரு முறை காசோலையை இயக்கலாம். காசோலைக்கு எவ்வளவு பயன்பாட்டு தரவு பதிவிறக்கம் செய்யப்பட வேண்டும் என்பதைத் தேர்ந்தெடுக்கவும். நீங்கள் எவ்வளவு அதிகமாகத் தேர்ந்தெடுக்கிறீர்களோ, அவ்வளவு நேரம் எடுக்கும், ஆனால் காசோலை மிகவும் நம்பகமானதாக இருக்கும். இது பின்னணியில் இயங்கும் மற்றும் காசோலை முடிந்ததும் அறிவிப்பைக் காண்பிக்கும்.

# settings_app_check_warning
source: Warning: Downloading large amounts of data can take a long time.
ta: எச்சரிக்கை: பெரிய அளவிலான தரவைப் பதிவிறக்குவதற்கு நீண்ட நேரம் ஆகலாம்.

# settings_app_check_button
source: Check backup
ta: காப்புப்பிரதியை சரிபார்க்கவும்

# settings_file_check_title
source: Verify file backup integrity
ta: கோப்பு காப்புப்பிரதி ஒருமைப்பாட்டை சரிபார்க்கவும்

# settings_file_check_text
source: Here you can run a one-time check to verify your file backup.
ta: உங்கள் கோப்பு காப்புப்பிரதியை சரிபார்க்க இங்கே நீங்கள் ஒரு முறை காசோலையை இயக்கலாம்.

# settings_file_check_text2
source: Select how much of file data should be downloaded for the check. The more you select, the longer it will take, yet the more reliable the check will be. The check will run in the background and send you a notification once it is done.
ta: காசோலைக்கு எவ்வளவு கோப்பு தரவு பதிவிறக்கம் செய்யப்பட வேண்டும் என்பதைத் தேர்ந்தெடுக்கவும். நீங்கள் எவ்வளவு அதிகமாகத் தேர்ந்தெடுக்கிறீர்களோ, அவ்வளவு நேரம் எடுக்கும், ஆனால் காசோலை மிகவும் நம்பகமானதாக இருக்கும். காசோலை பின்னணியில் இயங்கும், அது முடிந்ததும் அறிவிப்பை உங்களுக்கு அனுப்பும்.

# settings_expert_title
source: Expert settings
ta: வல்லுநர் அமைப்புகள்

# settings_expert_logcat_title
source: Save app log
ta: பயன்பாட்டு பதிவைச் சேமிக்கவும்

# settings_expert_logcat_summary
source: Developers can diagnose bugs with these logs. Warning: The log file might contain personally identifiable information. Review before and delete after sharing!
ta: உருவாக்குபவர்கள் இந்த பதிவுகள் மூலம் பிழைகள் கண்டறிய முடியும். எச்சரிக்கை: பதிவு கோப்பில் தனிப்பட்ட முறையில் அடையாளம் காணக்கூடிய தகவல்கள் இருக்கலாம். முன்பு மதிப்பாய்வு செய்து பகிரப்பட்ட பிறகு நீக்கு!

# settings_expert_logcat_error
source: Error: Could not save app log
ta: பிழை: பயன்பாட்டு பதிவைச் சேமிக்க முடியவில்லை

# storage_fragment_backup_title
source: Choose where to store backups
ta: காப்புப்பிரதிகளை எங்கே சேமிப்பது என்பதைத் தேர்வு செய்

# storage_fragment_restore_title
source: Where to find your backups?
ta: உங்கள் காப்புப்பிரதிகளை எங்கே கண்டுபிடிப்பது?

# storage_user_selected_location_title
source: User-chosen location
ta: பயனர் தேர்ந்தெடுக்கப்பட்ட இடம்

# storage_fake_drive_title
source: USB flash drive
ta: யூ.எச்.பி ஃப்ளாச் இயக்கி

# storage_fake_drive_summary
source: Needs to be plugged in
ta: செருகப்பட வேண்டும்

# storage_available_bytes
source: <xliff:g example="1 GB" id="size">%1$s</xliff:g> free
ta: <xliff:g example="1 GB" id="size">%1$s</xliff:g> மீதமுள்ளது

# storage_not_recommended
source: <xliff:g example="Skynet">%1$s</xliff:g> (Not recommended)
ta: <xliff: g எடுத்துக்காட்டு = "ச்கைனெட்">%1$s </xliff: g> (பரிந்துரைக்கப்படவில்லை)

# storage_round_sync_summary_prefix
source: RoundSync Remote:
ta: RoundSync ரிமோட்:

# storage_fake_nextcloud_title
source: Nextcloud
ta: அடுத்த முகில்

# storage_fake_nextcloud_summary
source: Tap to install
ta: நிறுவ தட்டவும்

# storage_fake_nextcloud_summary_installed
source: Tap to set up account
ta: கணக்கை அமைக்க தட்டவும்

# storage_fake_nextcloud_summary_unavailable
source: Account not available. Set one up (or disable passcode).
ta: கணக்கு கிடைக்கவில்லை. ஒன்றை அமைக்கவும் (அல்லது கடவுக்குறியீட்டை முடக்கவும்).

# storage_fake_nextcloud_summary_unavailable_market
source: Not installed
ta: நிறுவப்படவில்லை

# storage_fake_davx5_title
source: DAVx⁵
ta: டேவ்எக்ச்

# storage_fake_davx5_summary_installed
source: Tap to set up a WebDAV mount
ta: வெப்டாவ் ஏற்றத்தை அமைக்க தட்டவும்

# storage_fake_davx5_summary_unavailable
source: WebDAV mount not available. Set one up.
ta: WebDav மவுண்ட் கிடைக்கவில்லை. ஒன்றை அமைக்கவும்.

# storage_check_fragment_backup_title
source: Initializing backup location…
ta: காப்பு இருப்பிடத்தைத் தொடங்குகிறது …

# storage_check_fragment_patience
source: This may take some time…
ta: இதற்கு சிறிது நேரம் ஆகலாம்…

# storage_check_fragment_restore_title
source: Looking for backups…
ta: காப்புப்பிரதிகளைத் தேடுகிறது …

# storage_check_fragment_backup_error
source: An error occurred while accessing the backup location.
ta: காப்பு இருப்பிடத்தை அணுகும்போது பிழை ஏற்பட்டது.

# storage_check_fragment_permission_error
source: Unable to get the permission to write to the backup location.
ta: காப்பு இடத்திற்கு எழுத அனுமதி பெற முடியவில்லை.

# storage_check_fragment_error_button
source: Back
ta: பின்செல்

# storage_webdav_option_title
source: WebDAV Cloud (beta)
ta: WebDav முகில் (பீட்டா)

# storage_webdav_option_summary
source: Integrated direct WebDAV access
ta: ஒருங்கிணைந்த நேரடி WebDAV அணுகல்

# storage_webdav_config_url
source: WebDAV URL
ta: WebDav முகவரி

# storage_webdav_config_url_helper
source: Be sure to enter the full URL here. E.g. for Nextcloud, it has the form https://yourserver.com/remote.php/webdav
ta: முழு முகவரி ஐ இங்கே உள்ளிட மறக்காதீர்கள். எ.கா. நெக்ச்ட் கிளவுட்டுக்கு, இது https://yourserver.com/remote.php/webdav வடிவத்தைக் கொண்டுள்ளது

# storage_webdav_config_user
source: User name
ta: பயனர் பெயர்

# storage_webdav_config_pass
source: Password
ta: கடவுச்சொல்

# storage_webdav_config_button
source: Use WebDAV cloud
ta: WebDav மேகத்தைப் பயன்படுத்தவும்

# storage_webdav_config_malformed_url
source: Invalid WebDAV URL
ta: தவறான WebDAV முகவரி

# recovery_code_title
source: Recovery code
ta: மீட்பு குறியீடு

# recovery_code_12_word_intro
source: You need your 12-word recovery code to restore backed up data.
ta: காப்புப் பிரதி எடுக்கப்பட்ட தரவை மீட்டெடுக்க உங்களுக்கு உங்கள் 12-வார்த்தை மீட்பு குறியீடு தேவை.

# recovery_code_write_it_down
source: Write it down on paper now!
ta: இப்போது அதை காகிதத்தில் எழுதுங்கள்!

# recovery_code_confirm_button
source: Confirm code
ta: குறியீட்டை உறுதிப்படுத்தவும்

# recovery_code_confirm_intro
source: Enter your 12-word recovery code to ensure that it will work when you need it.
ta: உங்களுக்கு தேவையான போது அது வேலை செய்யும் என்பதை உறுதிப்படுத்த உங்கள் 12-வார்த்தை மீட்பு குறியீட்டை உள்ளிடவும்.

# recovery_code_input_intro
source: Enter your 12-word recovery code that you wrote down when setting up backups.
ta: காப்புப்பிரதிகளை அமைக்கும்போது நீங்கள் எழுதிய உங்கள் 12-வார்த்தை மீட்பு குறியீட்டை உள்ளிடவும்.

# recovery_code_done_button
source: Verify
ta: சரிபார்

# recovery_code_input_hint_1
source: Word 1
ta: வார்த்தை 1

# recovery_code_input_hint_2
source: Word 2
ta: வார்த்தை 2

# recovery_code_input_hint_3
source: Word 3
ta: வார்த்தை 3

# recovery_code_input_hint_4
source: Word 4
ta: வார்த்தை 4

# recovery_code_input_hint_5
source: Word 5
ta: வார்த்தை 5

# recovery_code_input_hint_6
source: Word 6
ta: வார்த்தை 6

# recovery_code_input_hint_7
source: Word 7
ta: வார்த்தை 7

# recovery_code_input_hint_8
source: Word 8
ta: வார்த்தை 8

# recovery_code_input_hint_9
source: Word 9
ta: வார்த்தை 9

# recovery_code_input_hint_10
source: Word 10
ta: வார்த்தை 10

# recovery_code_input_hint_11
source: Word 11
ta: வார்த்தை 11

# recovery_code_input_hint_12
source: Word 12
ta: வார்த்தை 12

# recovery_code_error_empty_word
source: You forgot to enter this word.
ta: இந்த வார்த்தையை உள்ளிட மறந்துவிட்டீர்கள்.

# recovery_code_error_invalid_word
source: Wrong word.
ta: தவறான சொல்.

# recovery_code_error_checksum_word
source: Your code is invalid. Please check all words as well as their position and try again!
ta: உங்கள் குறியீடு தவறானது. தயவுசெய்து எல்லா சொற்களையும் அவற்றின் நிலையையும் சரிபார்த்து மீண்டும் முயற்சிக்கவும்!

# recovery_code_verification_ok_title
source: Recovery code verified
ta: மீட்பு குறியீடு சரிபார்க்கப்பட்டது

# recovery_code_verification_ok_message
source: Your code is correct and will work for restoring your backup.
ta: உங்கள் குறியீடு சரியானது மற்றும் உங்கள் காப்புப்பிரதியை மீட்டமைக்க வேலை செய்யும்.

# recovery_code_verification_error_title
source: Incorrect recovery code
ta: தவறான மீட்பு குறியீடு

# recovery_code_verification_error_message
source: You have entered an invalid recovery code. Please try again! If you have lost your code, tap on 'Generate new code' below.
ta: நீங்கள் ஒரு தவறான மீட்பு குறியீட்டை உள்ளிட்டுள்ளீர்கள். தயவு செய்து மீண்டும் முயற்சிக்கவும்! உங்கள் குறியீட்டை இழந்திருந்தால், கீழே உள்ள 'புதிய குறியீட்டை உருவாக்கு' என்பதைத் தட்டவும்.

# recovery_code_verification_try_again
source: Try again
ta: மீண்டும் முயற்சி செய்

# recovery_code_verification_generate_new
source: Generate new code
ta: புதிய குறியீட்டை உருவாக்கவும்

# recovery_code_verification_new_dialog_title
source: Wait one second…
ta: ஒரு நொடி காத்திருங்கள் …

# recovery_code_verification_new_dialog_message
source: Generating a new code will make your existing backups inaccessible. We'll try to delete them if possible. This app will close when done. Are you sure you want to do this?
ta: புதிய குறியீட்டை உருவாக்குவது உங்கள் இருக்கும் காப்புப்பிரதிகளை அணுக முடியாததாக ஆக்கும். முடிந்தால் அவற்றை நீக்க முயற்சிப்போம். நீங்கள் இதை நிச்சயமாக செய்ய விரும்புகிறீர்களா?

# recovery_code_recreated
source: New recovery code has been created successfully. Exiting…
ta: புதிய மீட்பு குறியீடு வெற்றிகரமாக உருவாக்கப்பட்டுள்ளது. வெளியேறுதல்…

# recovery_code_auth_title
source: Re-enter your screen lock
ta: உங்கள் திரை பூட்டை மீண்டும் உள்ளிடவும்

# recovery_code_auth_description
source: Enter your device credentials to continue
ta: தொடர உங்கள் சாதன நற்சான்றிதழ்களை உள்ளிடவும்

# notification_channel_title
source: Backup notification
ta: காப்புப்பிரதி அறிவிப்பு

# notification_success_channel_title
source: Success notification
ta: செய் அறிவிப்பு

# notification_title
source: Backup running
ta: காப்புப்பிரதி இயங்குகிறது

# notification_init_text
source: Preparing existing backup data for reuse…
ta: மறுபயன்பாட்டிற்கு ஏற்கனவே உள்ள காப்புப்பிரதி தரவைத் தயாரித்தல்…

# notification_finalizing_text
source: Finalizing backup…
ta: காப்புப்பிரதியை இறுதி செய்தல்…

# notification_apk_text
source: Backing up APK of %s
ta: %s இன் APK ஐ ஆதரிக்கிறது

# notification_apk_not_backed_up
source: Saving list of apps we can not back up.
ta: பயன்பாடுகளின் பட்டியலை சேமித்தல் நாம் காப்புப் பிரதி எடுக்க முடியாது.

# notification_backup_already_running
source: Backup already in progress
ta: காப்புப்பிரதி ஏற்கனவே செயல்பாட்டில் உள்ளது

# notification_backup_disabled
source: Backup not enabled
ta: காப்புப்பிரதி இயக்கப்படவில்லை

# notification_success_title
source: Backup finished
ta: காப்புப்பிரதி முடிந்தது

# notification_success_text
source: %1$d of %2$d apps backed up (%3$s). Tap to learn more.
ta: %1$d / %2$d பயன்பாடுகள் காப்புப் பிரதி எடுக்கப்பட்டது (%3$s). மேலும் அறிய தட்டவும்.

# notification_failed_title
source: Backup failed
ta: காப்புப் பிரதி எடுக்க முடியவில்லை

# notification_failed_text
source: An error occurred while running the backup.
ta: காப்புப்பிரதியை இயக்கும் போது பிழை ஏற்பட்டது.

# notification_failed_metered_text
source: The backup has been aborted. Are you using mobile data? Connect to Wi-Fi to continue.
ta: காப்புப்பிரதி கைவிடப்பட்டுள்ளது. நீங்கள் மொபைல் தரவைப் பயன்படுத்துகிறீர்களா? தொடர வைஃபை இணைக்கவும்.

# notification_error_channel_title
source: Error notification
ta: பிழை அறிவிப்பு

# notification_error_title
source: Backup error
ta: காப்புப் பிழை

# notification_error_text
source: A device backup failed to run.
ta: சாதன காப்புப்பிரதியை இயக்க முடியவில்லை.

# notification_error_action
source: Fix
ta: சரிசெய்

# notification_space_error_title
source: Insufficient backup space
ta: போதுமான காப்புப்பிரதி இடம்

# notification_space_error_text
source: Your backup location is running out of space. Free up space, so backups can run.
ta: உங்கள் காப்புப்பிரதி இருப்பிடம் இடமில்லாமல் இயங்குகிறது. இடத்தை இலவசமாக, எனவே காப்புப்பிரதிகள் இயக்க முடியும்.

# notification_restore_channel_title
source: Restore notification
ta: அறிவிப்பை மீட்டெடுங்கள்

# notification_restore_title
source: Restore running
ta: ஓட்டத்தை மீட்டமைக்கவும்

# notification_restore_error_channel_title
source: Auto restore flash drive error
ta: ஆட்டோ மீட்டமை ஃபிளாச் இயக்கி பிழை

# notification_restore_error_title
source: Could not restore data for %1$s
ta: %1$s க்கான தரவை மீட்டெடுக்க முடியவில்லை

# notification_restore_error_text
source: Plug in your %1$s before installing the app to restore its data from backup.
ta: உங்கள் தரவை காப்புப்பிரதியிலிருந்து மீட்டமைக்க பயன்பாட்டை நிறுவும் முன் உங்கள் %1$s ஐ செருகவும்.

# notification_restore_error_action
source: Uninstall app
ta: பயன்பாட்டை நிறுவல் நீக்கவும்

# notification_error_no_main_key_title
source: Backups disabled
ta: காப்புப்பிரதிகள் முடக்கப்பட்டன

# notification_error_no_main_key_text
source: Generate a new recovery code to complete upgrade and continue to use backups.
ta: மேம்படுத்தலை முடிக்க புதிய மீட்புக் குறியீட்டை உருவாக்கி, காப்புப்பிரதிகளைத் தொடர்ந்து பயன்படுத்தவும்.

# notification_pruning_channel_title
source: Removing old backups notification
ta: பழைய காப்புப்பிரதி அறிவிப்பை நீக்குதல்

# notification_pruning_title
source: Removing old backups…
ta: பழைய காப்புப்பிரதிகளை நீக்குதல்…

# notification_pruning_blobs_title
source: Removing old backup data…
ta: பழைய காப்பு தரவை நீக்குதல்…

# notification_checking_channel_title
source: App backup integrity check
ta: பயன்பாட்டு காப்புப்பிரதி ஒருமைப்பாடு சோதனை

# notification_checking_title
source: Checking app backups…
ta: பயன்பாட்டு காப்புப்பிரதிகளைச் சரிபார்க்கிறது…

# notification_checking_finished_title
source: App backup integrity verified
ta: பயன்பாட்டு காப்புப்பிரதி ஒருமைப்பாடு சரிபார்க்கப்பட்டது

# notification_checking_finished_text
source: Successfully checked %1$s at an average speed of %2$s.
ta: %2$s வேகத்தில் %1$s ஐ வெற்றிகரமாக சரிபார்க்கவும்.

# notification_checking_error_title
source: Backup errors found
ta: காப்பு பிழைகள் காணப்படுகின்றன

# notification_checking_error_text
source: Tap for details. We checked %1$s at an average speed of %2$s.
ta: விவரங்களுக்கு தட்டவும். %1$s சராசரியாக %2$s வேகத்தில் சோதித்தோம்.

# notification_checking_action
source: Details
ta: விவரங்கள்

# notification_usb_monitor_title
source: Waiting for USB drive…
ta: யூ.எச்.பி டிரைவிற்காக காத்திருக்கிறது…

# notification_usb_monitor_text
source: Once your USB drive becomes available, we will start a backup.
ta: உங்கள் யூ.எச்.பி இயக்கி கிடைத்ததும், நாங்கள் காப்புப்பிரதியைத் தொடங்குவோம்.

# backup_app_check_success_intro
source: %1$d snapshots were found and %2$d%% of their data (%3$s) successfully verified:
ta: %1$d ச்னாப்சாட்கள் காணப்பட்டன மற்றும் அவற்றின் தரவின்%2$d %% (%3$s) வெற்றிகரமாக சரிபார்க்கப்பட்டது:

# backup_app_check_success_disclaimer
source: Note: we cannot verify whether individual apps include all of their user data in the backup.
ta: குறிப்பு: தனிப்பட்ட பயன்பாடுகள் அவற்றின் பயனர் தரவு அனைத்தும் காப்புப்பிரதியில் உள்ளதா என்பதை நாங்கள் சரிபார்க்க முடியாது.

# backup_app_check_error_title
source: @string/notification_checking_error_title
ta: @சரம்/அறிவிப்பு_செக்கிங்_நெர்ர்_டிடில்
