Repository: 247i/TACETr
Catalog: உரை/தானி/censorship-*-browser-troubleshooting-*.po
Languages: ta

source: Troubleshooting
ta: சரிசெய்தல்

source: This section will give you some hints about what to do when different, known problems arise with Ceno and Ouinet. Please bear in mind that these are experimental projects, and that their operation is subject to a multitude of factors beyond our control, like the particular configuration and status of network infrastructure, as well as which content other users have retrieved and the characteristics of their connections.
ta: செனோ மற்றும் ஓவினெட் ஆகியவற்றுடன் வேறுபட்ட, அறியப்பட்ட சிக்கல்கள் எழும்போது என்ன செய்வது என்பது பற்றிய சில குறிப்புகளை இந்த பிரிவு உங்களுக்கு வழங்கும். இவை சோதனைத் திட்டங்கள் என்பதையும், அவற்றின் செயல்பாடு எங்கள் கட்டுப்பாட்டிற்கு அப்பாற்பட்ட பல காரணிகளுக்கு உட்பட்டது என்பதையும், பிணையம் உள்கட்டமைப்பின் குறிப்பிட்ட உள்ளமைவு மற்றும் நிலை, அத்துடன் பிற பயனர்கள் எந்த உள்ளடக்கத்தை மீட்டெடுத்துள்ளனர் மற்றும் அவற்றின் இணைப்புகளின் பண்புகள் போன்றவை என்பதை நினைவில் கொள்ளுங்கள் .

source: If problems still persist, please report them to [cenoers@equalitie.org](mailto:cenoers@equalitie.org). We will try to help you with them.
ta: சிக்கல்கள் இன்னும் தொடர்ந்தால், தயவுசெய்து அவற்றை [cenoers@equalitie.org] (mailto: cenoers@equalitie.org) க்கு புகாரளிக்கவும். நாங்கள் அவர்களுக்கு உதவ முயற்சிப்போம்.

source: There is no Ceno entry in the app menu
ta: பயன்பாட்டு பட்டியலில் செனோ நுழைவு இல்லை

source: The Ceno Extension may still be loading. Please be patient.
ta: CENO நீட்டிப்பு இன்னும் ஏற்றப்படலாம். தயவுசெய்து பொறுமையாக இருங்கள்.

source: All widgets are grayed-out in the *Ceno Settings* page
ta: அனைத்து விட்செட்டுகளும் * செனோ அமைப்புகள் * பக்கத்தில் சாம்பல் நிறத்தில் உள்ளன

source: The Ceno Extension has loaded, but it has not yet been able to retrieve status from Ouinet. Since it may take a moment for Ouinet to be ready, please be patient.
ta: CENO நீட்டிப்பு ஏற்றப்பட்டுள்ளது, ஆனால் அது இன்னும் ஓவினெட்டிலிருந்து நிலையை மீட்டெடுக்க முடியவில்லை. ஓயினெட் தயாராக இருக்க ஒரு கணம் ஆகலாம் என்பதால், தயவுசெய்து பொறுமையாக இருங்கள்.

source: If the Settings page stays like that after more than two minutes, Ouinet may have encountered some issue while starting.
ta: அமைப்புகள் பக்கம் இரண்டு நிமிடங்களுக்கும் மேலாக அப்படியே இருந்தால், ஓவினெட் தொடங்கும் போது சில சிக்கல்களை சந்தித்திருக்கலாம்.

source: Try to visit some page, if possible one which is usually available. If you get an error like "Failed to retrieve the resource (after attempting all configured mechanisms)", Ceno may be experiencing some issues with general connectivity (like being unable to join the BitTorrent network). If you are on a mobile connection, try again with Wi-Fi.
ta: முடிந்தால் சில பக்கங்களைப் பார்வையிட முயற்சிக்கவும். "வளத்தை மீட்டெடுப்பதில் தோல்வியுற்றது (அனைத்து கட்டமைக்கப்பட்ட வழிமுறைகளையும் முயற்சித்த பிறகு)" போன்ற பிழையைப் பெற்றால், CENO பொது இணைப்பில் சில சிக்கல்களை அனுபவிக்கக்கூடும் (பிட்டோரண்ட் நெட்வொர்க்கில் சேர முடியாமல் இருப்பது போன்றவை). நீங்கள் மொபைல் இணைப்பில் இருந்தால், வைஃபை உடன் மீண்டும் முயற்சிக்கவும்.

source: If you get an error like "The proxy server is refusing connections" when visiting the page, try to stop other applications which may be offering some service to the device, then restart Ceno.
ta: பக்கத்தைப் பார்வையிடும்போது "பதிலாள் சேவையகம் இணைப்புகளை மறுக்கிறது" போன்ற பிழையைப் பெற்றால், சாதனத்திற்கு சில சேவைகளை வழங்கக்கூடிய பிற பயன்பாடுகளை நிறுத்த முயற்சிக்கவும், பின்னர் செனோவை மறுதொடக்கம் செய்யுங்கள்.

source: **Technical note:** This may happen if another application is already listening on TCP ports `127.0.0.1:8077` or `127.0.0.1:8078`.
ta: ** தொழில்நுட்ப குறிப்பு: ** TCP துறைமுகங்களில் மற்றொரு பயன்பாடு ஏற்கனவே கேட்டுக்கொண்டிருந்தால் இது நிகழலாம் `127.0.0.1: 8077` அல்லது` 127.0.0.1: 8078`.

source: The *Ouinet client state* under *Ceno Settings* is not `started`
ta: * செனோ அமைப்புகளின் கீழ் * ouinet கிளையன்ட் நிலை * `தொடங்கப்படவில்லை`

source: The Ouinet client run by Ceno is finding problems starting on your device.
ta: CENO ஆல் நடத்தப்படும் OUineint Client உங்கள் சாதனத்தில் தொடங்கும் சிக்கல்களைக் கண்டறிந்துள்ளது.

source: When you launch Ceno, the state may read `starting` for a few seconds; this is normal. However, if the state remains `starting` for too long, it may be a signal of serious connectivity issues that preclude the application from reaching the BitTorrent network. Please check your network connection and try restarting Ceno. If you have a working connection but the state remains `starting`, please contact us (especially if the state was `started` in some previous run).
ta: நீங்கள் செனோவைத் தொடங்கும்போது, ​​சில நொடிகள் `தொடங்கும் 'மாநிலம் படிக்கலாம்; இது சாதாரணமானது. எவ்வாறாயினும், அரசு நீண்ட காலமாக `தொடங்கினால் 'இருந்தால், இது பிட்டோரண்ட் நெட்வொர்க்கை அடைவதைத் தடுக்கும் தீவிர இணைப்பு சிக்கல்களின் சமிக்ஞையாக இருக்கலாம். உங்கள் பிணைய இணைப்பை சரிபார்த்து, செனோவை மறுதொடக்கம் செய்ய முயற்சிக்கவும். உங்களுக்கு வேலை இணைப்பு இருந்தால், ஆனால் மாநிலம் `தொடங்குகிறது 'என்றால், தயவுசெய்து எங்களை தொடர்பு கொள்ளவும் (குறிப்பாக மாநிலம் முந்தைய சில ஓட்டங்களில்` தொடங்கப்பட்டால்).

source: One possible reason for not being able to get into BitTorrent (more so when you run Ceno for the first time), is that the default bootstrap servers used by the Ouinet client are blocked or unreachable. In that case you may want to try providing Ceno with extra BitTorrent bootstrap servers in the [Settings page](settings.md). You can ask us if you do not know of any such server. After setting the extra bootstraps, please restart the application. If the problem persists, contact us.
ta: பிட்டோரெண்டில் இறங்க முடியாமல் இருப்பதற்கு ஒரு சாத்தியமான காரணம் (மேலும் நீங்கள் முதல் முறையாக செனோவை இயக்கும்போது), ஓவினெட் கிளையன்ட் பயன்படுத்தும் இயல்புநிலை தொடக்கவார் சேவையகங்கள் தடுக்கப்படுகின்றன அல்லது அடைய முடியாதவை. அவ்வாறான நிலையில், [அமைப்புகள் பக்கம்] (Settings.md) இல் கூடுதல் பிட்டோரண்ட் தொடக்கவார் சேவையகங்களுடன் செனோவுக்கு வழங்க முயற்சிக்க விரும்பலாம். அத்தகைய சேவையகம் உங்களுக்குத் தெரியாவிட்டால் நீங்கள் எங்களிடம் கேட்கலாம். கூடுதல் பூட்ச்ட்ராப்களை அமைத்த பிறகு, தயவுசெய்து விண்ணப்பத்தை மறுதொடக்கம் செய்யுங்கள். சிக்கல் தொடர்ந்தால், எங்களை தொடர்பு கொள்ளவும்.

source: If you ever see some other state, there may be some internal error in the Ouinet client. Please report the issue to us.
ta: நீங்கள் எப்போதாவது வேறு சில நிலைகளைக் கண்டால், ஓயினெட் கிளையண்டில் சில உள் பிழைகள் இருக்கலாம். தயவுசெய்து எங்களுக்கு பிரச்சினையைப் புகாரளிக்கவும்.

source: Accessing some content shows "Failed to retrieve the resource"
ta: சில உள்ளடக்க நிகழ்ச்சிகளை அணுகுவது "வளத்தை மீட்டெடுப்பதில் தோல்வி"

source: This means that Ceno tried all available mechanisms to access the content, but none of them succeeded.
ta: இதன் பொருள் உள்ளடக்கத்தை அணுக செனோ கிடைக்கக்கூடிய அனைத்து வழிமுறைகளையும் முயற்சித்தது, ஆனால் அவை எதுவும் வெற்றிபெறவில்லை.

source: You should make sure that the following requirements are fulfilled for Ceno to work:
ta: செனோ வேலை செய்ய பின்வரும் தேவைகள் நிறைவு செய்யப்படுகின்றன என்பதை உறுதிப்படுத்த வேண்டும்:

source: You are running a recent version of Ceno Browser. Obsolete versions may not be able to communicate with newer injectors or other clients. Check the [installation instructions](install.md) to know where to get new versions.
ta: நீங்கள் செனோ உலாவியின் அண்மைக் கால பதிப்பை இயக்குகிறீர்கள். வழக்கற்றுப் போன பதிப்புகள் புதிய உட்செலுத்திகள் அல்லது பிற வாடிக்கையாளர்களுடன் தொடர்பு கொள்ள முடியாமல் போகலாம். புதிய பதிப்புகளை எங்கு பெறுவது என்பதை அறிய [நிறுவல் வழிமுறைகள்] (Install.md) ஐ சரிபார்க்கவும்.

source: All access mechanisms in the [Settings page](settings.md) are enabled. Otherwise Ceno will not be able to circumvent some connectivity issues when accessing content.
ta: [அமைப்புகள் பக்கம்] (settings.md) இல் உள்ள அனைத்து அணுகல் வழிமுறைகளும் இயக்கப்பட்டுள்ளன. இல்லையெனில் உள்ளடக்கத்தை அணுகும்போது சில இணைப்பு சிக்கல்களை CENO தவிர்க்க முடியாது.

source: Your device has a working connection to the network, i.e. your normal Web browser is able to open some Web sites. Ceno and Ouinet cannot work when all network connectivity is shut down (although users may still find a common Wi-Fi access point to do device-to-device sharing).
ta: உங்கள் சாதனத்தில் பிணையத்துடன் பணி இணைப்பு உள்ளது, அதாவது உங்கள் சாதாரண வலை உலாவி சில வலைத்தளங்களைத் திறக்க முடியும். அனைத்து பிணைய இணைப்புகளும் மூடப்படும்போது செனோ மற்றும் ஓவினெட் செயல்பட முடியாது (பயனர்கள் சாதனத்திலிருந்து சாதனப் பகிர்வு செய்ய பொதுவான வைஃபை அணுகல் புள்ளியைக் காணலாம் என்றாலும்).

source: If that is the case, it is worth explaining what may be happening for all access mechanisms to fail, to give you an idea of your chances for getting content using Ceno.
ta: அப்படியானால், அனைத்து அணுகல் வழிமுறைகளும் தோல்வியடையும் என்ன நடக்கிறது என்பதை விளக்குவது மதிப்பு, CENO ஐப் பயன்படுத்தி உள்ளடக்கத்தைப் பெறுவதற்கான உங்கள் வாய்ப்புகளைப் பற்றிய ஒரு யோசனையை உங்களுக்குத் தெரிவிக்க வேண்டும்.

source: Origin access
ta: மூல அணுகல்

source: Your Ceno Browser cannot directly reach the content's origin server. Either the server is having some difficulties itself (e.g. it is down or under some attack), or someone is interfering with your connection to it.
ta: உங்கள் செனோ உலாவி உள்ளடக்கத்தின் தோற்றம் சேவையகத்தை நேரடியாக அடைய முடியாது. சேவையகத்திற்கு சில சிரமங்கள் உள்ளன (எ.கா. இது குறைந்துவிட்டது அல்லது சில தாக்குதலுக்கு உள்ளாகியுள்ளது), அல்லது யாராவது அதற்கான உங்கள் தொடர்பில் தலையிடுகிறார்கள்.

source: This is the main use case for Ceno and the other mechanisms should compensate for it.
ta: இது CENO க்கான முக்கிய பயன்பாட்டு வழக்கு, மற்ற வழிமுறைகள் அதற்கு ஈடுசெய்ய வேண்டும்.

source: Proxy/Injector access
ta: ப்ராக்சி/இன்செக்டர் அணுகல்

source: Someone is interfering with your connection to Internet addresses in the injector swarm. Since this is expected to happen eventually as Ceno (and Ouinet) gain traction, Ceno resorts to reaching injectors via other clients acting as bridges.
ta: இன்செக்டர் திரளில் இணைய முகவரிகளுடனான உங்கள் இணைப்பில் யாரோ தலையிடுகிறார்கள். செனோ (மற்றும் ஓவினெட்) இழுவைப் பெறுவதால் இது இறுதியில் நடக்கும் என்று எதிர்பார்க்கப்படுவதால், செனோ பாலங்களாக செயல்படும் பிற வாடிக்கையாளர்கள் வழியாக உட்செலுத்திகளை அடைய முயற்சிக்கிறார்.

source: There are different reasons for Ceno being unable to reach such clients:
ta: அத்தகைய வாடிக்கையாளர்களை அடைய செனோவால் வேறுபட்ட காரணங்கள் உள்ளன:

source: No other client is reachable by you. If only a few Ouinet clients are online, it is entirely possible that none of them are in a network that can be reached from the outside. This should become less likely as Ceno and Ouinet get popular and more clients with diverse connectivity come online.
ta: வேறு எந்த வாடிக்கையாளரும் உங்களை அடைய முடியாது. ஒரு சில ஓயினெட் வாடிக்கையாளர்கள் மட்டுமே ஆன்லைனில் இருந்தால், அவை எதுவும் வெளியில் இருந்து அடையக்கூடிய நெட்வொர்க்கில் இல்லை என்பது முற்றிலும் சாத்தியம். செனோ மற்றும் ஓவினெட் பிரபலமடைவதால் இது குறைவாக இருக்க வேண்டும், மேலும் மாறுபட்ட இணைப்புகளைக் கொண்ட அதிகமான வாடிக்கையாளர்கள் ஆன்லைனில் வர வேண்டும்.

source: The extreme case here is that connections between Ouinet clients are detected as such by a censor and blocked. This is quite unlikely (since it may entail blocking all BitTorrent traffic) and currently beyond what Ouinet supports, but we plan to make it more resistant against these attacks.
ta: இங்கே தீவிர வழக்கு என்னவென்றால், ஓயினெட் வாடிக்கையாளர்களுக்கிடையேயான தொடர்புகள் ஒரு தணிக்கை மூலம் கண்டறியப்பட்டு தடுக்கப்படுகின்றன. இது மிகவும் சாத்தியமில்லை (இது அனைத்து பிட்டோரண்ட் போக்குவரத்தையும் தடுப்பதை ஏற்படுத்தக்கூடும் என்பதால்) மற்றும் தற்போது ஓயினெட் ஆதரிப்பதைத் தாண்டி, ஆனால் இந்த தாக்குதல்களுக்கு எதிராக அதை மேலும் எதிர்ப்புத் தெரிவிக்க நாங்கள் திட்டமிட்டுள்ளோம்.

source: No other client can reach an injector. Since it is unlikely that all injectors are simultaneously down, that may mean that you can only reach Ouinet clients which are themselves affected by similar network interference as yours.
ta: வேறு எந்த வாடிக்கையாளரும் ஒரு இன்செக்டரை அடைய முடியாது. அனைத்து ஊசி மருந்துகளும் ஒரே நேரத்தில் கீழே இருப்பது சாத்தியமில்லை என்பதால், உங்களுடையது போன்ற பிணையம் குறுக்கீட்டால் பாதிக்கப்பட்டுள்ள ஓவினெட் வாடிக்கையாளர்களை மட்டுமே நீங்கள் அடைய முடியும் என்று பொருள்.

source: This can happen when all traffic leaving or entering the country you are in is interrupted. Ceno would resort in this case to getting and using the content from the distributed cache, even if it is stale.
ta: நீங்கள் இருக்கும் நாட்டிலிருந்து வெளியேறும்போது அல்லது நுழையும் அனைத்து போக்குவரத்தும் தடைபடும் போது இது நிகழலாம். இந்த விசயத்தில் செனோ இந்த விசயத்தில் விநியோகிக்கப்பட்ட தற்காலிக சேமிப்பிலிருந்து உள்ளடக்கத்தைப் பெறுவதற்கும் பயன்படுத்துவதற்கும், அது பழையதாக இருந்தாலும் அதை நாடுகிறது.

source: Again, as Ceno and Ouinet become more popular, the chances increase that there are at least a few clients that do have some kind of access to international sites. Even if access is precarious, a single Ouinet client able to inject some content into the country could suffice to enable it to spread (over the distributed cache) without further need to access the outside world.
ta: மீண்டும், செனோவும் ஓவினெட்டும் மிகவும் பிரபலமடைவதால், பன்னாட்டு தளங்களுக்கு ஒருவித அணுகலைக் கொண்ட குறைந்தது ஒரு சில வாடிக்கையாளர்கள் இருப்பதற்கான வாய்ப்புகள் அதிகரிக்கின்றன. அணுகல் ஆபத்தானது என்றாலும், வெளி உலகத்தை மேலும் அணுக வேண்டிய அவசியமின்றி (விநியோகிக்கப்பட்ட தற்காலிக சேமிப்பிற்கு மேல்) பரவுவதற்கு சில உள்ளடக்கங்களை நாட்டிற்குள் செலுத்தக்கூடிய ஒற்றை ஓநெட் வாங்கி போதுமானது.

source: Finally, we do run some Ouinet clients with good connectivity in (hopefully) censorship-free countries to try to avoid those two situations, but please note that clients with such stable Internet addresses could get blocked as well.
ta: இறுதியாக, அந்த இரண்டு சூழ்நிலைகளையும் தவிர்க்க முயற்சிக்க (வட்டம்) தணிக்கை இல்லாத நாடுகளில் நல்ல இணைப்புடன் சில ஓயினெட் வாடிக்கையாளர்களை நாங்கள் இயக்குகிறோம், ஆனால் இதுபோன்ற நிலையான இணைய முகவரிகளைக் கொண்ட வாடிக்கையாளர்களும் தடுக்கப்படலாம் என்பதை நினைவில் கொள்க.

source: Distributed cache
ta: விநியோகிக்கப்பட்ட தற்காலிக சேமிப்பு

source: Keep in mind that an absolute requirement to be able to retrieve any content from the distributed cache is that it has already been injected by some other Ceno or Ouinet user. This means that popular content is more likely to eventually get injected and replicated in a natural manner, while more obscure content is less so, unless someone takes care of using Ceno or some other Ouinet client to inject and keep seeding it (which may further expose them to some [risks](../concepts/risks.md)).
ta: விநியோகிக்கப்பட்ட தற்காலிக சேமிப்பிலிருந்து எந்தவொரு உள்ளடக்கத்தையும் மீட்டெடுக்க ஒரு முழுமையான தேவை என்பதை நினைவில் கொள்ளுங்கள், இது ஏற்கனவே வேறு சில செனோ அல்லது ஓவினெட் பயனரால் செலுத்தப்பட்டுள்ளது. இதன் பொருள், பிரபலமான உள்ளடக்கம் இறுதியில் ஊசி போடவும், இயற்கையான முறையில் பிரதிபலிக்கவும் அதிக வாய்ப்புள்ளது, அதே நேரத்தில் மிகவும் தெளிவற்ற உள்ளடக்கம் குறைவாகவே உள்ளது, யாராவது செனோ அல்லது வேறு சில ஓவினெட் கிளையண்டைப் பயன்படுத்துவதை கவனித்துக்கொள்ளாமல், அதை விதைக்கவும் (இது மேலும் அம்பலப்படுத்தக்கூடும் அவை சில [அபாயங்கள்] (../ கருத்துக்கள்/அபாயங்கள். எம்.டி)).

source: Please note that some content which is not considered safe for sharing will never be injected, no matter how many people retrieve it using public browsing. This includes content marked as private by the origin server, content that requires authentication, and some traffic exchanged by certain dynamic Web applications.
ta: பகிரங்கத்திற்கு பாதுகாப்பாக கருதப்படாத சில உள்ளடக்கம் ஒருபோதும் செலுத்தப்படாது என்பதை நினைவில் கொள்க, பொது உலாவலைப் பயன்படுத்தி எத்தனை பேர் அதை மீட்டெடுத்தாலும். ஆரிசின் சேவையகத்தால் தனிப்பட்டதாக குறிக்கப்பட்ட உள்ளடக்கம், ஏற்பு தேவைப்படும் உள்ளடக்கம் மற்றும் சில மாறும் வலை பயன்பாடுகளால் பரிமாறிக்கொள்ளப்பட்ட சில போக்குவரத்து ஆகியவை இதில் அடங்கும்.

source: Also note that the clients holding copies of injected content need to be reachable by you. The same observations described in the previous point for reaching bridge clients do apply here.
ta: ஊசி போடப்பட்ட உள்ளடக்கத்தின் நகல்களை வைத்திருக்கும் வாடிக்கையாளர்கள் நீங்கள் அடைய வேண்டும் என்பதையும் நினைவில் கொள்க. பாலம் வாடிக்கையாளர்களை அடைவதற்கான முந்தைய புள்ளியில் விவரிக்கப்பட்ட அதே அவதானிப்புகள் இங்கே பொருந்தும்.

source: A note on HTTP-only sites
ta: HTTP- மட்டும் தளங்கள் குறித்த குறிப்பு

source: Ceno automatically switches to the more secure HTTPS protocol to access sites which would otherwise be accessed using plain, insecure HTTP. This is done by the embedded [HTTPS by default][HTTPS by default] extension when you enter a bare domain name like `example.com` or an HTTP URL like `http://example.com/…` in the location bar, or when you follow a link with such a URL in a page.
ta: CENO தானாகவே தளங்களை அணுக மிகவும் பாதுகாப்பான HTTPS நெறிமுறைக்கு மாறுகிறது, இல்லையெனில் வெற்று, பாதுகாப்பற்ற HTTP ஐப் பயன்படுத்தி அணுகப்படும். இது உட்பொதிக்கப்பட்ட [இயல்புநிலையாக] [இயல்புநிலையாக] [HTTPS] நீட்டிப்பால் செய்யப்படுகிறது, நீங்கள் `எடுத்துக்காட்டு.காம்` போன்ற வெற்று டொமைன் பெயரை உள்ளிடும்போது அல்லது இருப்பிட பட்டியில்` http: // example.com/… `போன்ற HTTP முகவரி , அல்லது ஒரு பக்கத்தில் அத்தகைய முகவரி உடன் இணைப்பைப் பின்பற்றும்போது.

source: The automatic switching to HTTPS is done to prevent someone from intercepting an HTTP connection and directing it to an illegitimate server, resulting in bogus content (like a block message). This kind of hijacking is trivial to detect with HTTPS, so Ceno can work around it instead of being tricked into loading the bogus content.
ta: HTTP களுக்கு தானாக மாறுவது யாராவது ஒரு HTTP இணைப்பை இடைமறிப்பதைத் தடுக்கவும், அதை சட்டவிரோத சேவையகத்திற்கு இயக்குவதைத் தடுக்கவும் செய்யப்படுகிறது, இதன் விளைவாக போலி உள்ளடக்கம் (ஒரு தொகுதி செய்தி போன்றவை). இந்த வகையான கடத்தல் HTTP களுடன் கண்டறிய அற்பமானது, எனவே போலி உள்ளடக்கத்தை ஏற்றுவதற்கு ஏமாற்றப்படுவதற்குப் பதிலாக செனோ அதைச் சுற்றி வேலை செய்யலாம்.

source: Although very unusual, some sites do not support HTTPS, and no access mechanism will work for them. If you are completely sure that this is the case for a site which just failed to load in Ceno, you can edit its URL in the location bar, change `https://` to `http://`, and try again.
ta: மிகவும் அசாதாரணமானது என்றாலும், சில தளங்கள் HTTP களை ஆதரிக்கவில்லை, மேலும் அவர்களுக்கு எந்த அணுகல் பொறிமுறையும் வேலை செய்யாது. செனோவில் ஏற்றத் தவறிய ஒரு தளத்திற்கான நிலை இதுதான் என்று நீங்கள் உறுதியாக நம்பினால், அதன் முகவரி ஐ இருப்பிடப் பட்டியில் திருத்தலாம், `https: //` `http: //` என மாற்றலாம், மீண்டும் முயற்சிக்கவும்.

source: If you want to always access a particular site over plain HTTP, you can add a permanent exception like this:
ta: வெற்று HTTP க்கு மேல் ஒரு குறிப்பிட்ட தளத்தை எப்போதும் அணுக விரும்பினால், இது போன்ற நிரந்தர விதிவிலக்கைச் சேர்க்கலாம்:

source: In the app's main menu, choose *HTTPS by default*. You will see that extension's settings page.
ta: பயன்பாட்டின் முதன்மையான பட்டியலில், இயல்புநிலையாக *https ஐத் தேர்வுசெய்க *. அந்த நீட்டிப்பின் அமைப்புகள் பக்கத்தைக் காண்பீர்கள்.

source: Enter the domain name of the site in the text box, as shown below. See there how you may enter several sites by separating them with spaces or newlines. Please note that entering `example.com` will also include all sites under that domain, like `www.example.com` or `x.y.example.com`.
ta: கீழே காட்டப்பட்டுள்ளபடி, உரை பெட்டியில் தளத்தின் டொமைன் பெயரை உள்ளிடவும். பல தளங்களை இடைவெளிகள் அல்லது புதிய வரிகளுடன் பிரிப்பதன் மூலம் அவற்றை எவ்வாறு நுழையலாம் என்பதைப் பாருங்கள். `Example.com` உள்ளிடுவது அந்த டொமைனின் கீழ்` www.example.com` அல்லது `x.y.example.com` போன்ற அனைத்து தளங்களையும் உள்ளடக்கும் என்பதை நினைவில் கொள்க.

source: When done, go back or close the tab.
ta: முடிந்ததும், திரும்பிச் செல்லுங்கள் அல்லது தாவலை மூடு.

source: ![Figure: Adding exceptions for HTTP-only sites](images/httpsbd-exceptions.png)
ta: ! [படம்: HTTP- மட்டும் தளங்களுக்கான விதிவிலக்குகளைச் சேர்ப்பது] (படங்கள்/httpsbd-expections.png)

source: **Note:** In the unfortunate case that a site is only accessible via HTTP, and it is also being hijacked by a censor, you will need to go to the [Settings page](settings.md), disable Origin access, and try again. Please note that this setting affects all sites, and it is not remembered by Ceno for subsequent runs. We encourage you to contact the site administrators and tell them to enable HTTPS support.
ta: ** குறிப்பு. மீண்டும் முயற்சிக்கவும். இந்த அமைப்பு எல்லா தளங்களையும் பாதிக்கிறது என்பதை நினைவில் கொள்க, மேலும் இது அடுத்தடுத்த ரன்களுக்கு செனோவால் நினைவில் இல்லை. தள நிர்வாகிகளைத் தொடர்பு கொள்ளவும், HTTPS ஆதரவை இயக்கச் சொல்லவும் நாங்கள் உங்களை ஊக்குவிக்கிறோம்.

source: A page shows bogus content (like a block message)
ta: ஒரு பக்கம் போலி உள்ளடக்கத்தைக் காட்டுகிறது (ஒரு தொகுதி செய்தி போன்றது)

source: This may happen when you used an old version of Ceno to visit a blocked site in the past, and someone intercepted the connection and directed it to an illegitimate server. Ceno then remembered that redirection, and now it automatically opens the latter site when trying to visit the former.
ta: கடந்த காலங்களில் தடுக்கப்பட்ட தளத்தைப் பார்வையிட நீங்கள் செனோவின் பழைய பதிப்பைப் பயன்படுத்தும்போது இது நிகழலாம், மேலும் யாரோ இணைப்பைத் தடுத்து சட்டவிரோத சேவையகத்திற்கு அனுப்பினர். செனோ அந்த திருப்பிவிடலை நினைவில் வைத்திருந்தார், இப்போது முந்தையதைப் பார்வையிட முயற்சிக்கும்போது அது தானாகவே பிந்தைய தளத்தைத் திறக்கும்.

source: One way to fix this issue is to clear Ceno's normal browsing cache by choosing *Settings* in the app's main menu, then *Clear private data*, and disabling all boxes but *Cache* before tapping on *Clear data*.
ta: இந்த சிக்கலை சரிசெய்வதற்கான ஒரு வழி, பயன்பாட்டின் முதன்மையான பட்டியலில் *அமைப்புகளை *தேர்ந்தெடுப்பதன் மூலம் செனோவின் இயல்பான உலாவல் தற்காலிக சேமிப்பை அழிப்பது, பின்னர் *தனியார் தரவை அழிக்கவும், மற்றும் அனைத்து பெட்டிகளையும் முடக்குவது ஆனால் *தெளிவான தரவைத் தட்டுவதற்கு முன் *கேச் *.

source: Please note that Ceno version 1.3.0 and newer avoid that hijacking of newly visited sites by always using HTTPS, as explained in the previous section.
ta: முந்தைய பிரிவில் விளக்கப்பட்டுள்ளபடி, எப்போதும் HTTPS ஐப் பயன்படுத்துவதன் மூலம் புதிதாக பார்வையிடப்பட்ட தளங்களை கடத்திச் செல்வதை செனோ பதிப்பு 1.3.0 மற்றும் புதியது தவிர்க்கவும் என்பதை நினைவில் கொள்க.

source: Others cannot retrieve content seeded by my device
ta: மற்றவர்கள் எனது சாதனத்தால் விதைக்கப்பட்ட உள்ளடக்கத்தை மீட்டெடுக்க முடியாது

source: First, make sure that your device is still seeding the content by going to the [*Ceno Settings* page](settings.md), only leaving the *Shared by other Ceno users* source box checked, then accessing that content again: it should load (at least partially), and tapping the Ceno address bar icon should only show non-zero values under *Shared by other Ceno users* or *Shared by you*.
ta: முதலில், [* CENO அமைப்புகள்* பக்கம்] (Settings.md) க்குச் செல்வதன் மூலம் உங்கள் சாதனம் இன்னும் உள்ளடக்கத்தை விதைக்கிறது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், மற்ற செனோ பயனர்களால் பகிரப்பட்ட* மட்டுமே விட்டுவிட்டு, மூல பெட்டி சரிபார்க்கவும், பின்னர் அந்த உள்ளடக்கத்தை மீண்டும் அணுகவும்: ஏற்ற வேண்டும் (குறைந்தது ஓரளவு), மற்றும் செனோ முகவரி பார் ஐகானைத் தட்டுவது மற்ற செனோ பயனர்களால் பகிரப்பட்ட *அல்லது *நீங்கள் பகிரப்பட்ட *கீழ் பூச்சியமற்ற மதிப்புகளைக் காட்ட வேண்டும்.
