Repository: 247i/TACETr
Catalog: உரை/தானி/chibe-strings-*.po
Languages: ta

# app_name
source: Chibe
ta: வேண்டும்

# chibe_settings_label
source: Chibe
ta: வேண்டும்

# intro_slide_1_title
source: Welcome to Chibe!
ta: சிபேவுக்கு வருக!

# intro_slide_1_text
source: In the past, many homes had a chiming or cuckoo's clock that would ring every hour. But with the current technology you don't need to bother everyone with a loud noise, Chibe can just vibrate your phone for you!
ta: கடந்த காலத்தில், பல வீடுகளில் ஒரு சிமிங் அல்லது கொக்கு கடிகாரம் இருந்தது, அது ஒவ்வொரு மணி நேரமும் ஒலிக்கும். ஆனால் தற்போதைய தொழில்நுட்பத்துடன் நீங்கள் அனைவரையும் உரத்த ஒலி கொண்டு தொந்தரவு செய்யத் தேவையில்லை, சிப் உங்களுக்காக உங்கள் தொலைபேசியை அதிர்வுறும்!

# intro_slide_2_title
source: Keep track of time
ta: நேரத்தைக் கண்காணிக்கவும்

# intro_slide_2_text
source: Effortlessly keep track of the time during any activity with Chibe. A small vibration at set times will subtly remind you of the time. You will be able to use your time more efficiently and will be able divide your time more consciously.
ta: சிபேவுடன் எந்தவொரு செயலிலும் சிரமமின்றி நேரத்தை கண்காணிக்கவும். நிர்ணயிக்கப்பட்ட நேரங்களில் ஒரு சிறிய அதிர்வு நேரத்தை நுட்பமாக நினைவூட்டுகிறது. உங்கள் நேரத்தை மிகவும் திறமையாகப் பயன்படுத்த முடியும், மேலும் உங்கள் நேரத்தை இன்னும் உணர்வுபூர்வமாக பிரிக்க முடியும்.

# intro_slide_3_title
source: Sleeps when you sleep
ta: நீங்கள் தூங்கும்போது தூங்குகிறது

# intro_slide_3_text
source: Chibe won't bother you when you're sleeping. Just adjust the sleep times and rest without being disturbed!
ta: நீங்கள் தூங்கும்போது சிபே உங்களைத் தொந்தரவு செய்ய மாட்டார். தூக்க நேரங்களை சரிசெய்து, தொந்தரவு செய்யாமல் ஓய்வெடுங்கள்!

# intro_slide_4_title
source: Custom vibration patterns
ta: தனிப்பயன் அதிர்வு வடிவங்கள்

# intro_slide_4_text
source: Chibe lets you choose from different vibration patterns. Choose the one that fits you, so you don't confuse Chibe with regular notifications.
ta: வெவ்வேறு அதிர்வு வடிவங்களிலிருந்து தேர்வு செய்ய சிப் உங்களை அனுமதிக்கிறது. உங்களுக்கு பொருந்தக்கூடிய ஒன்றைத் தேர்வுசெய்க, எனவே நீங்கள் வழக்கமான அறிவிப்புகளுடன் சிப்பை குழப்ப வேண்டாம்.

# intro_slide_5_title
source: Get started!
ta: தொடங்கவும்!

# intro_slide_5_text
source: Press the switch in the top right corner to enable Chibe and get started!
ta: சிப்பேவை இயக்க மற்றும் தொடங்குவதற்கு மேல் வலது மூலையில் சுவிட்சை அழுத்தவும்!

# pref_category_timing
source: Timing
ta: நேரவிவரம்

# vibration_interval_preference_title
source: Vibration interval
ta: அதிர்வு இடைவெளி

# sleep_start_preference_title
source: Start sleep at
ta: தூக்கத்தைத் தொடங்குங்கள்

# sleep_end_preference_title
source: End sleep at
ta: தூக்கத்தை முடிக்கவும்

# vibrate_during_dnd_preference_title
source: Vibrate during Do Not Disturb
ta: போது அதிர்வு தொந்தரவு செய்யாது

# vibrate_during_dnd_preference_summary
source: Lets Chibe vibrate even if your phone's Do Not Disturb mode is enabled.
ta: உங்கள் தொலைபேசியின் தொந்தரவு பயன்முறை இயக்கப்பட்டிருந்தாலும் சிப் அதிர்வுறும்.

# vibrate_during_calls_preference_title
source: Vibrate during calls
ta: அழைப்புகளின் போது அதிர்வு

# vibrate_during_calls_preference_summary
source: Lets Chibe vibrate while making a call
ta: அழைப்பைச் செய்யும்போது சிபே அதிர்வுறும்

# pref_category_vibration
source: Vibration patterns
ta: அதிர்வு வடிவங்கள்

# test_normal_vibration_preference_title
source: Test base vibration pattern
ta: அடிப்படை அதிர்வு முறை சோதனை

# test_normal_vibration_preference_summary
source: Lets your device vibrate in the base vibration pattern now
ta: உங்கள் சாதனம் இப்போது அடிப்படை அதிர்வு வடிவத்தில் அதிர்வுறும்

# test_hour_vibration_preference_title
source: Test hour vibration pattern
ta: சோதனை மணிநேர அதிர்வு முறை

# test_hour_vibration_preference_summary
source: Lets your device vibrate in the hour vibration pattern now
ta: உங்கள் சாதனம் இப்போது மணிநேர அதிர்வு வடிவத்தில் அதிர்வுறும்

# base_vibration_pattern_preference_title
source: Base vibration pattern
ta: அடிப்படை அதிர்வு முறை

# hour_repeat_preference_title
source: Repeat a special vibration for the hours
ta: மணிநேரங்களுக்கு ஒரு சிறப்பு அதிர்வுகளை மீண்டும் செய்யவும்

# hour_repeat_preference_summary
source: Vibrate in the hour vibration pattern multiple times, to show what time it is. For example at 14:00, Chibe will vibrate in the base pattern and then vibrate twice in the hour pattern.
ta: மணிநேர அதிர்வு வடிவத்தில் பல முறை அதிர்வுறும், இது எந்த நேரம் என்பதைக் காட்ட. எடுத்துக்காட்டாக, 14:00 மணிக்கு, சிப் அடிப்படை வடிவத்தில் அதிர்வுறும், பின்னர் மணிநேர வடிவத்தில் இரண்டு முறை அதிர்வுறும்.

# hour_vibration_pattern_preference_title
source: Hour vibration pattern
ta: மணிநேர அதிர்வு முறை

# pref_category_other
source: Other
ta: மற்றொன்று

# dark_theme_preference_title
source: Dark theme
ta: இருண்ட கருப்பொருள்

# project_page_preference_title
source: Visit the project page
ta: திட்டப் பக்கத்தைப் பார்வையிடவும்

# project_page_preference_summary
source: Find more info, leave feedback and contribute
ta: மேலும் தகவலைக் கண்டுபிடித்து, கருத்துக்களை விட்டுவிட்டு பங்களிக்கவும்

# email_me_preference_title
source: Email me at marienraat@riseup.net
ta: Marienraat@riseup.net இல் எனக்கு மின்னஞ்சல் அனுப்புங்கள்

# email_me_preference_summary
source: Give you suggestions or let me know what you think
ta: உங்களுக்கு பரிந்துரைகளை கொடுங்கள் அல்லது நீங்கள் என்ன நினைக்கிறீர்கள் என்பதை எனக்குத் தெரியப்படுத்துங்கள்

# contact_email_adress
source: mailto:marienraat@riseup.net
ta: மெயில்டோ: marienraat@riseup.net

# set_dialog
source: Set
ta: கணம்

# cancel_dialog
source: Cancel
ta: ரத்துசெய்

# ok_dialog
source: OK
ta: சரி

# custom_pattern_dialog
source: Custom pattern
ta: தனிப்பயன் முறை

# short_vibration
source: Short
ta: குறுக்கு

# long_vibration
source: Long
ta: நீண்ட

# delete_vibration
source: ⌫ DEL
ta: . டெல்.

# custom_pattern_hint
source: Use the buttons to create a pattern
ta: ஒரு வடிவத்தை உருவாக்க பொத்தான்களைப் பயன்படுத்தவும்

# vibration_time_entries_0
source: every minute
ta: ஒவ்வொரு நிமிடமும்

# vibration_time_entries_1
source: every 5 minutes
ta: ஒவ்வொரு 5 நிமிடங்களுக்கும்

# vibration_time_entries_2
source: every 10 minutes
ta: ஒவ்வொரு 10 நிமிடங்களுக்கும்

# vibration_time_entries_3
source: every 15 minutes
ta: ஒவ்வொரு 15 நிமிடங்களுக்கும்

# vibration_time_entries_4
source: every 20 minutes
ta: ஒவ்வொரு 20 நிமிடங்களுக்கும்

# vibration_time_entries_5
source: every half hour
ta: ஒவ்வொரு அரை மணி நேரமும்

# vibration_time_entries_6
source: every hour
ta: ஒவ்வொரு மணி நேரமும்

# vibration_time_entries_7
source: every two hours
ta: ஒவ்வொரு இரண்டு மணி நேரமும்

# chibe_pattern_entries_custom
source: Custom
ta: தனிப்பயன்

# chibe_pattern_entries_0
source: Pattern: .. _ ..
ta: முறை: .. _ ..

# chibe_pattern_entries_1
source: Pattern: _ .. _
ta: முறை: _ .. _

# chibe_pattern_entries_2
source: Pattern: _ _
ta: முறை: _ _

# chibe_pattern_entries_3
source: Pattern: _
ta: முறை: _

# chibe_pattern_entries_4
source: Pattern: ..
ta: முறை: ..

# chibe_pattern_entries_5
source: Pattern: . _ ...
ta: முறை :. _ ...

# chibe_pattern_entries_6
source: Pattern: . _ . _ .
ta: முறை :. _. _.
