Repository: 247i/TACETr
Catalog: உரை/தானி/cityzen-strings-*.po
Languages: ta

# nav_categories
source: Categories
ta: பிரிவுகள்

# nav_map
source: Map
ta: வரைப்படம்

# nav_favorites
source: Favorites
ta: பிரியமானவை

# nav_about
source: About
ta: விவரங்கள்

# oauth_communication_error
source: Unable to reach the authorization server
ta: வழங்கியை தொடர்புகொள்ள இயலவில்லை

source: Loading
ta: காத்திருக்கவும்

source: Retry
ta: மீண்டும் முயற்சி செய்

# oauth_failed_permissions
source: Authorization failed: all listed permissions need to be granted
ta: ஏற்பு தோல்வியுற்றது: பட்டியலிடப்பட்ட அனைத்து அனுமதிகளும் வழங்கப்பட வேண்டும்

# offline
source: You are offline
ta: நீங்கள் இணையத்தொடர்பில் இல்லை

# confirmation_authorize_now
source: You need to login with your OSM user account to apply changes to OpenStreetMap. Authorize now?
ta: உங்கள் மாற்றங்களை பதிவு செய்ய, நீங்கள் உங்கள் OSM கணக்கினுள் நுழைய வேண்டும். சம்மதமா?

source: Later
ta: பின்னர்

source: Filter
ta: வடிகட்டு

source: Only currently opened
ta: தற்ப்போது திறக்கப்பட்டவை

# write_storage_request
source: CityZen needs to have write permissions to provide map services
ta: வரைப்பட சேவைகளை வழங்க, CityZen-க்கு மாற்றம் செய்ய அனுமதி தேவை

# write_storage_request_toast
source: CityZen must have written permissions to provide map services
ta: வரைபட சேவைகளை வழங்க சிட்டிசென் எழுத்துப்பூர்வ அனுமதிகளைக் கொண்டிருக்க வேண்டும்

# location_request
source: CityZen needs to have location to provide map services
ta: வரைப்பட சேவைகளை வழங்க, CityZen-க்கு உங்கள் இருப்பிட அனுமதி தேவை

# location_request_toast
source: CityZen must have location to provide map services
ta: வரைப்பட சேவைகளை வழங்க, CityZen-க்கு உங்கள் இருப்பிட அனுமதி கண்டிப்பாக தேவை

# allow_permission
source: Allow
ta: அனுமதி

# deny_permission
source: Deny
ta: மறு

# no_pois_near_user_location
source: No services found near your location
ta: உங்கள் இருப்பிடத்திற்கு அருகில் எந்த சேவைகளும் காணப்படவில்லை

# enable_gps_to_continue
source: Can't find your location. Enable GPS to continue
ta: உங்கள் இருப்பிடத்தை அறிய இயலவில்லை உங்கள் GPS-ஐ செயல்படுத்துங்கள்

# calculating_device_location
source: We are figuring out your location. Please wait.
ta: உங்கள் இருப்பிடத்தை அறிய முயற்ச்சிக்கிறோம். காத்திருங்கள்.

# add_new_poi_toast
source: Click on the map to add Points of Interest
ta: சேர்க்க வரைபடத்தை அழுத்துங்கள் POI

source: Add
ta: சேர்

source: Cancel
ta: நீக்கு

source: Wifi
ta: இணையம்

source: Email
ta: மின்னஞ்சல்

source: Website
ta: இணையதளம்

source: Phone
ta: தொலைப்பேசி

source: Name
ta: பெயர்

source: Address
ta: முகவரி

source: Opening hours
ta: செயல்படும் நேரம்

# monday
source: Mon
ta: திங்கள்

# tuesday
source: Tue
ta: செவ்வாய்

# wednesday
source: Wed
ta: புதன்

# thursday
source: Thu
ta: விழாயன்

# friday
source: Fri
ta: வெள்ளி

# saturday
source: Sat
ta: சனி

# sunday
source: Sun
ta: ஞாயிறு

# all_week_days
source: All
ta: எல்லா நாளும்

source: Enable
ta: செயல்படுத்து

# directions_to_here
source: directions by car
ta: car மூலம் செல்ல

source: Create POI
ta: POI உருவாக்கவும்

source: Opening
ta: திறக்க

source: Closing
ta: மூட

source: Done
ta: முடிந்தது

# no_internet_to_update_poi
source: No internet access. Connect to internet to continue
ta: இணைய தொடர்பு இல்லை. இணையத்தில் சேரவும்

# session_expired_toast
source: Your session expired. Please log in to continue
ta: உங்கள் நேரம் முடிவடைந்தது. மேலும் தொடர உள்நுழையவும்

source: Internet access
ta: இணைய சேவை

source: Edit
ta: தொகு

source: Street
ta: தெரு

source: City
ta: நகரம்

source: Add closing hours
ta: மூடும் நேரம்

source: Add opening hours
ta: திறக்கும் நேரம்

# not_valid_website
source: Not a valid website
ta: சரியான இணையதளம் இல்லை

# not_valid_email
source: Not a valid email
ta: சரியான மின்னஞ்சல் இல்லை

source: An error occurred
ta: தவறு நடந்தது

source: updated successfully
ta: மாற்றங்கள் நிறைவேறியது

# editing_is_not_possible
source: Editing is not possible for
ta: இதனை தொகுக்க முடியாது

# poi_type
source: Point of interest type
ta: POI வகை

source: Select amenity type
ta: வாய்ப்பு வகையை தேர்ந்தெடுக

source: Select amenity type to continue
ta: தொடர்வதற்க்கு வாய்ப்பு வகையை தேர்ந்தெடுக

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Wired
ta: கேபில் மூலம்

# wlan
source: Wi-Fi
ta: இணையம்

# created_succesfully
source: created successfully
ta: வெற்றிகரமாக உருவாக்கப்பட்டது

source: Sort by name
ta: பெயரின்படி வரிசைப்படுத்து

# add_a_new_marker_on_the_map
source: Add a marker on the map
ta: வரைபடத்தில் குறிப்பை சேர்

# about_us
source: About the project
ta: திட்டப்பணியைப் பற்றி

# about_text
source: CityZen is an open source Android app that helps you navigate and explore the city easily. With CityZen you find points of interest (POIs) such as ATMs, gas stations, drugstores, mobile phone stores and other interesting services near you. The app shows these POIs based on your location of your smartphone, but it does so by respecting your privacy since we don’t keep your navigation data. The app is open source licensed because we want the project to be empowered by the community for the community. We initiated this project as a way of empowering tools and platforms such as OpenStreetMap that respect our freedoms. If you are an OpenStreetMap contributor you can easily add information to the POIs by editing them inside CityZen.
ta: CityZen ஒரு திறந்த மூல ஆன்டிராய்டு செயலி. இது நம் நகரத்தை எளிதாக அறிவதற்கு உதவுகிறது. CityZen மூலம் நீங்கள் ATM, எரிவாயு நிலையம், மரிந்து கடைகள் போன்றவற்றை அறியலாம். இது உங்கள் இருப்பிடத்தைக் கொண்டு இவை அனைத்தையும் காண்பிக்கும். குழுவாய் செயல்படுவதை வலுப்படுத்துவதற்க்காக நாம் இதனை திறந்த மூல மென்பொருளில் வெளிவிடுகிறோம். இது பயனரின் சுதந்திரத்தைப் பாதுகாக்கும் OpenStreetMap போன்ற கருவிகளைக் கொண்டு உருவாக்கப்பட்டது.

source: License
ta: உரிமம்

source: Privacy policy
ta: தனியுரிமைக் கொள்கை

source: Contact
ta: தொடர்பு

# alert_message
source: CityZen needs your location to provide map services. Do you want to enable location?
ta: CityZen வரைபட சேவைகளை வழங்க உங்கள் இருப்பிடம் அறிய வேண்டும். நீங்கள் தயாரா?

# osm_routing_unavailable
source: OSM routing isn't available at this time. Try again later
ta: OSM வழியிடல் தற்ப்போது இல்லை. சிறிது நேரம் கழித்து முயற்ச்சியுங்கள்

source: House number
ta: வீட்டு எண்

source: Postcode
ta: தபால் எண்

source: Get involved
ta: பங்கு பெற

source: Credits
ta: நன்றி

# open_source_culture
source: CityZen app was initiated in Albania with a lot of ♥ for free and open source culture.
ta: CityZen செயலி ♥-லுடன் ஆல்பேனியாவில் துவங்கப்பட்டது, திறந்த மூல கலாச்சாரத்துடன்.

source: Cafes
ta: தேநீர் விடுதி

# Bars_Clubs
source: Bars
ta: மதுக்கடை

source: Restaurants
ta: உணவகங்கள்

# Bakeries
source: Bakeries & Pastries
ta: பேக்கரி மற்றும் பால் சார்ந்த பொருட்கள்

source: Post offices
ta: தபால் நிலையங்கள்

source: Fast food
ta: துரித உணவு

source: Tourism
ta: சுற்றுலா

# Hotels_Hostels
source: Hotels
ta: விடுதிகள்

source: Transportation
ta: போக்குவரத்து

source: Gas stations
ta: எரிவாயு நிலையங்கள்

# Pharmacy_Healthcare
source: Health services
ta: சிகிச்சை நிலையங்கள்

# Banks_ATMs_Exchange
source: Financial services
ta: நிதி சேவைகள்

# MobilePhoneStore
source: Mobile stores
ta: கைபேசி விற்பனை நிலையம்

# Markets_Kiosks
source: Markets
ta: சந்தை

# Shopping_Malls
source: Shopping
ta: கடைகள்

source: Parking
ta: நிறுத்தங்கள்

# RentBicycle
source: Bike rental
ta: வண்டி வாடகை

# RentCar_CareSharing
source: Car rental
ta: கார் வாடகை

source: Buildings
ta: கட்டிடங்கள்

source: Education
ta: கல்வி

source: Location
ta: இருப்பிடம்

source: Logged in as:
ta: உள்நுழைந்த பயனர்:

source: Log in to OSM
ta: OSM-ல் நுழை

source: Log out
ta: வெளியேறு

source: No results
ta: முடிவுகள் இல்லை

# search_again
source: Please try another search term
ta: வேறொரு வார்த்தயை தேடவும்

source: search icon
ta: தேடல் படம்

source: No favorites
ta: பிடித்தவைகள் இல்லை

# mark_locations_as_favorites
source: Locations marked as favorites will show up here
ta: விருப்பமுள்ள இருப்பிடங்கள் இங்கே காண்பிக்கப்படும்

source: favorites icon
ta: பிடித்தவைகள் படம்

# no_info_available
source: No information available
ta: எந்த தகவலும் கிடைக்கவில்லை

source: Open
ta: திறந்து

source: Closed
ta: மூடி

source: Search
ta: தேடு

source: My location
ta: என் இருப்பிடம்

source: Clear map
ta: வரைபடம் துடை

# search_hint
source: Search…
ta: தேடு…

# address_label
source: Address:
ta: முகவரி:

# server_error
source: Error communicating with server
ta: வழங்கியிடம் தொடர்பு கொள்வதில் பிரச்சனை

# server_response_error
source: Error reading server response
ta: வழங்கியின் பதிலை அறிவதில் சிரமம்

# poi_details_close
source: Close POI
ta: POI மூடு

# poi_details_mark_as_favorite
source: Mark POI as favorite
ta: POI-ஐ விருப்பமானதாக்கு

# poi_details_edit
source: Edit POI
ta: POI-ஐ தொகு

# poi_details_share
source: Share POI as geo-link
ta: POI-ஐ geo-link ஆக பகிரவும்
