Repository: 247i/TACETr
Catalog: உரை/தானி/clifm-clifm-*.po
Languages: ta

source: Blocks: %ld
ta: தொகுதிகள்: %எல்.டி.

source: IO Block: %d
ta: Io தொகுதி: %d

source: IO Block: %ld
ta: Io தொகுதி: %ld

source: Inode: %zu
ta: ஐனோட்: %கூட

source: Press any key to continue...
ta: தொடர எந்த விசையையும் அழுத்தவும் ...

source: %s CliFM %sThe anti-eye-candy/KISS file manager %s
ta: %s கிளிஃப் %கண் எதிர்ப்பு-மிட்டாய்/முத்தம் கோப்பு மேலாளர் %s

source: %s: No selected files
ta: %s: தேர்ந்தெடுக்கப்பட்ட கோப்புகள் இல்லை

source: %sEnter '%c' to quit.
ta: வெளியேற%சென்டர் '%சி' வெளியேற.

source: %sEnter 'q' to quit.
ta: வெளியேற %சென்டர் 'கியூ' வெளியேற.

source: %sNOTE%s: Zstandard does not support compression of multiple files into one single compressed file. Files will be compressed rather into multiple compressed files using original file names
ta: %ச்னோட்%s: பல கோப்புகளின் சுருக்கத்தை ஒரு ஒற்றை சுருக்க கோப்பாக zstandard ஆதரிக்காது. அசல் கோப்பு பெயர்களைப் பயன்படுத்தி பல சுருக்கப்பட்ட கோப்புகளாக கோப்புகள் சுருக்கப்படும்

source: *The slash followed by a number (/xx) after directories or symbolic links to directories indicates the amount of files contained by the corresponding directory, excluding self (.) and parent (..) directories.
ta: *கோப்பகங்களுக்குப் பிறகு அல்லது கோப்பகங்களுக்கான குறியீட்டு இணைப்புகளுக்குப் பிறகு ஒரு எண் (/xx) ஐத் தொடர்ந்து குறைத்தல், தன்வய (.) மற்றும் பெற்றோர் (..) கோப்பகங்களைத் தவிர்த்து, தொடர்புடைய கோப்பகத்தால் உள்ள கோப்புகளின் அளவைக் குறிக்கிறது.

source: BUILT-IN COMMANDS: The following is just a list of available commands and possible parameters. For a complete description of each of these commands run 'cmd' (or press F2) or consult the manpage (F1). You can also try the 'ih' action to run the interactive help plugin (it depends on FZF). Just enter 'ih', that's it.
ta: உள்ளமைக்கப்பட்ட கட்டளைகள்: பின்வருவது கிடைக்கக்கூடிய கட்டளைகள் மற்றும் சாத்தியமான அளவுருக்களின் பட்டியல் மட்டுமே. இந்த ஒவ்வொரு கட்டளைகளின் முழுமையான விளக்கத்திற்கு 'சிஎம்டி' (அல்லது எஃப் 2 ஐ அழுத்தவும்) இயக்கவும் அல்லது மன்பேசை (எஃப் 1) அணுகவும். ஊடாடும் உதவி சொருகி இயக்க 'IH' செயலையும் நீங்கள் முயற்சி செய்யலாம் (இது FZF ஐப் பொறுத்தது). 'Ih' ஐ உள்ளிடவும், அவ்வளவுதான்.

source: The value in parentheses is the code that is to be used to modify the color of the corresponding file type in the color scheme file (in the "FiletypeColors" line), using the same ANSI style color format used by dircolors. By default, %s uses only 8 colors, but you can use 256 and RGB colors as well.
ta: அடைப்புக்குறிக்குள் உள்ள மதிப்பு என்பது வண்ணத் திட்டக் கோப்பில் ("பைல்டிபேர்கோலர்கள்" வரியில்) தொடர்புடைய கோப்பு வகையின் நிறத்தை மாற்றுவதற்குப் பயன்படுத்தப்பட வேண்டிய குறியீடாகும், இது கிளார்களால் பயன்படுத்தப்படும் அதே ANSI பாணி வண்ண வடிவமைப்பைப் பயன்படுத்துகிறது. இயல்பாக, %s 8 வண்ணங்களை மட்டுமே பயன்படுத்துகிறது, ஆனால் நீங்கள் 256 மற்றும் RGB வண்ணங்களையும் பயன்படுத்தலாம்.

source: USAGE: %s %s -a, --no-hidden do not show hidden files (default) -A, --show-hidden show hidden files -b, --bookmarks-file=FILE specify an alternative bookmarks file -c, --config-file=FILE specify an alternative configuration file -e, --no-eln do not print ELN (entry list number) at the left of each file name -f, --no-folders-first do not list folders first -F, --folders-first list folders first (default) -g, --pager enable the pager -G, --no-pager disable the pager (default) -h, --help show this help and exit -i, --no-case-sensitive no case-sensitive files listing (default) -I, --case-sensitive case-sensitive files listing -k, --keybindings-file=FILE specify an alternative keybindings file -l, --no-long-view disable long view mode (default) -L, --long-view enable long view mode -m, --dihist-map enable the directory history map -o, --no-list-on-the-fly 'cd' works as the shell 'cd' command -O, --list-on-the-fly 'cd' lists files on the fly (default) -p, --path=PATH (Deprecated: use positional parameters instead) use PATH as %s starting path -P, --profile=PROFILE use (or create) PROFILE as profile -s, --splash enable the splash screen -S, --stealth-mode leave no trace on the host system. Nothing is read from any file nor any file is created: all settings are set to the default value. However, most settings can be controlled via command line options -u, --no-unicode disable unicode -U, --unicode enable unicode to correctly list file names containing accents, tildes, umlauts, non-latin letters, etc. This option is enabled by default -v, --version show version details and exit -w, --workspace=NUM start in workspace NUM -x, --ext-cmds allow the use of external commands -y, --light-mode enable the light mode -z, --sort=METHOD sort files by METHOD, where METHOD could be: 0 = none, 1 = name, 2 = size, 3 = atime, 4 = btime, 5 = ctime, 6 = mtime, 7 = version, 8 = extension, 9 = inode, 10 = owner, 11 = group
ta: பயன்பாடு: %s %s -a,-இல்லை மறைக்கப்பட்ட மறைக்கப்பட்ட கோப்புகளைக் காட்ட வேண்டாம் (இயல்புநிலை) -A,-சோ-மறைக்கப்பட்ட கோப்புகளைக் காட்டு -B, --bookmarks-file = கோப்பு மாற்று புக்மார்க்ச் கோப்பைக் குறிப்பிடவும் -c,--config-file = கோப்பு மாற்று உள்ளமைவு கோப்பைக் குறிப்பிடவும் -e, --no-eln ELN (நுழைவு பட்டியல் எண்) ஐ அச்சிட வேண்டாம் ஒவ்வொரு கோப்பு பெயரின் இடதுபுறம் -f,-இல்லை கோப்புறைகள்-முதல் கோப்புறைகளை முதலில் பட்டியலிடவில்லை -F,-கோப்புறைகள்-முதல் பட்டியல் கோப்புறைகள் முதலில் (இயல்புநிலை) -g, -பேசர் பேசரை இயக்கவும் -G,-no-pager பேசரை முடக்கவும் (இயல்புநிலை) -h, -உதவி இந்த உதவியைக் காட்டி வெளியேறவும் -i,-no-case- உணர்திறன் வழக்கு-உணர்திறன் கோப்புகள் பட்டியல் (இயல்புநிலை) -I,--வழக்கு-உணர்திறன் வழக்கு-உணர்திறன் கோப்புகள் பட்டியல் -k, --keybindings-file = கோப்பு மாற்று விசைப்பலகைகள் கோப்பைக் குறிப்பிடவும் -எல்,-இல்லை-நீண்ட பார்வை நீண்ட பார்வை பயன்முறையை முடக்கு (இயல்புநிலை) -எல்,-நீண்ட பார்வை நீண்ட பார்வை பயன்முறையை இயக்கவும் -M,--டிஇச்ட்-வரைபடம் அடைவு வரலாற்று வரைபடத்தை இயக்கவும் -o,-no-list-on-the-fly 'cd' செல் 'குறுவட்டு' கட்டளையாக செயல்படுகிறது -O,--லிச்ட்-ஆன்-ஃப்ளை 'சிடி' பறக்கும்போது கோப்புகளை பட்டியலிடுகிறது (இயல்புநிலை) -p, - -path = பாதை (நீக்கப்பட்டது: அதற்கு பதிலாக நிலை அளவுருக்களைப் பயன்படுத்துங்கள்) பாதையை %s தொடக்க பாதையாக பயன்படுத்தவும் -P, --profile = சுயவிவரத்தைப் பயன்படுத்தவும் (அல்லது உருவாக்கு) சுயவிவரமாக -S, -ச்பிளாச் ச்பிளாச் திரையை இயக்கவும் -S, --stealth- முறை புரவலன் அமைப்பில் எந்த தடயத்தையும் விடாது. எந்த கோப்பிலிருந்தும் அல்லது எந்த கோப்பிலிருந்தும் எதுவும் படிக்கப்படவில்லை உருவாக்கப்பட்டது: அனைத்து அமைப்புகளும் அமைக்கப்பட்டுள்ளன இயல்புநிலை மதிப்பு. இருப்பினும், பெரும்பாலான அமைப்புகள் முடியும் கட்டளை வரி விருப்பங்கள் வழியாக கட்டுப்படுத்தப்படும் -u,-no-unicode ஒருங்குறி ஐ முடக்கு -U, --unicode கோப்பு பெயர்களை சரியாக பட்டியலிட யூனிகோடை இயக்கவும் உச்சரிப்புகள், டில்ட்ச், உம்லாட்ச், லத்தீன் அல்லாத கடிதங்கள் போன்றவை. இந்த விருப்பம் இயல்பாக இயக்கப்பட்டது -V, -பதிப்பு விவரங்களைக் காட்டு மற்றும் வெளியேறுதல் -w, - -workspace = எண் பணியிட எண் -x, --ext-cmds வெளிப்புற கட்டளைகளைப் பயன்படுத்த அனுமதிக்கின்றன -y,--ஒளி-முறை ஒளி பயன்முறையை இயக்கவும் -Z, ---sort = முறை முறை மூலம் கோப்புகளை வரிசைப்படுத்தவும், எங்கே முறை இருக்கலாம்: 0 = எதுவுமில்லை, 1 = பெயர், 2 = அளவு, 3 = ATIME, 4 = BTIME, 5 = CTIME, 6 = எம் நேரம், 7 = பதிப்பு, 8 = நீட்டிப்பு, 9 = ஐனோட், 10 = உரிமையாளர், 11 = குழு

source: %sfile name%s: Block special file (bd)
ta: %sfile பெயர்%s: தொகுதி சிறப்பு கோப்பு (BD)

source: %sfile name%s: Broken symbolic link (or)
ta: %sfile பெயர்%s: உடைந்த குறியீட்டு இணைப்பு (அல்லது)

source: %sfile name%s: Character special file (cd)
ta: %sfile பெயர்%s: எழுத்து சிறப்பு கோப்பு (குறுவட்டு)

source: %sfile name%s: Directory with no read permission (nd)
ta: %sfile பெயர்%s: வாசிப்பு இசைவு இல்லாத அடைவு (ND)

source: %sfile name%s: Directory* (di)
ta: %sfile பெயர்%s: அடைவு* (di)

source: %sfile name%s: EMPTY directory (ed)
ta: %sfile பெயர்%s: வெற்று அடைவு (ED)

source: %sfile name%s: EMPTY directory with no read permission (ne)
ta: %sfile name%s: வாசிப்பு இசைவு இல்லாத வெற்று அடைவு (NE)

source: %sfile name%s: Empty (zero-lenght) file (ef)
ta: %கோப்பு பெயர்%என்பது: வெற்று (பூச்சிய நீள) கோப்பு (EF)

source: %sfile name%s: Empty executable file (ee)
ta: %sfile பெயர்%s: வெற்று இயங்கக்கூடிய கோப்பு (EE)

source: %sfile name%s: Executable file (ex)
ta: %sfile பெயர்%s: இயங்கக்கூடிய கோப்பு (எ.கா)

source: %sfile name%s: File with capabilities (ca)
ta: %sfile பெயர்%s: திறன்களுடன் கோப்பு (CA)

source: %sfile name%s: File with no read permission (nf)
ta: %sfile பெயர்%s: வாசிப்பு இசைவு இல்லாத கோப்பு (NF)

source: %sfile name%s: Multi-hardlink (mh)
ta: %sfile பெயர்%s: மல்டி-ஆர்ட்லிங்க் (MH)

source: %sfile name%s: Other-writable and NOT sticky directory* (ow)
ta: %sfile name%s: பிற-எழுதக்கூடிய மற்றும் ஒட்டும் அடைவு அல்ல* (OW)

source: %sfile name%s: Pipe or FIFO special file (pi)
ta: %sfile பெயர்%s: குழாய் அல்லது ஃபிஃபோ சிறப்பு கோப்பு (PI)

source: %sfile name%s: Regular file (fi)
ta: %sfile பெயர்%s: வழக்கமான கோப்பு (FI)

source: %sfile name%s: SGID file (sg)
ta: %sfile பெயர்%s: sgid கோப்பு (sg)

source: %sfile name%s: SUID file (su)
ta: %sfile name%s: suid கோப்பு (su)

source: %sfile name%s: Socket file (so)
ta: %sfile பெயர்%s: சாக்கெட் கோப்பு (SO)

source: %sfile name%s: Sticky and NOT other-writable directory* (st)
ta: %sfile name%s: ஒட்டும் மற்றும் பிற எழுதக்கூடிய அடைவு அல்ல* (st)

source: %sfile name%s: Sticky and other-writable directory* (tw)
ta: %sfile name%s: ஒட்டும் மற்றும் பிற-எழுதக்கூடிய அடைவு* (TW)

source: %sfile name%s: Symbolic link* (ln)
ta: %sfile பெயர்%s: குறியீட்டு இணைப்பு* (ln)

source: %sfile name%s: Unaccessible (non-stat'able) file (uf)
ta: %sfile name%s: அணுக முடியாத (-நிலையற்ற) கோப்பு (UF)

source: %sfile name%s: Unknown file type (no)
ta: %sfile பெயர்%s: அறியப்படாத கோப்பு வகை (இல்லை)

source: #%s profile #Write here the commands you want to be executed at startup #Ex: #echo -e "%s, the anti-eye-candy/KISS file manager"
ta: #%s சுயவிவரம் #தொடக்கத்தில் நீங்கள் செயல்படுத்த விரும்பும் கட்டளைகளை இங்கே எழுதுங்கள் #Ex: #eco -e "%s, கண் எதிர்ப்பு-மிட்டாய்/முத்த கோப்பு மேலாளர்"

source: %c%s: There are no selected files%c
ta: %c%s: தேர்ந்தெடுக்கப்பட்ட கோப்புகள் இல்லை%c

source: %s %s (%s), by %s
ta: %s %s ( %s), %s ஆல்

source: %s %s (%s), by %s Contact: %s Website: %s License: %s
ta: %s %s ( %s), %s ஆல் தொடர்பு: %s வலைத்தளம்: %s உரிமம்: %s

source: %s created a new MIME list file (%s) It is recommended to edit this file (entering 'mm edit' or pressing F6) to add the programs you use and remove those you don't. This will make the process of opening files faster and smoother The default MIME list file, covering the most common file type associations, can be found in %s.
ta: %s ஒரு புதிய MIME பட்டியல் கோப்பை (%s) உருவாக்கியது, நீங்கள் பயன்படுத்தும் நிரல்களைச் சேர்த்து, நீங்கள் செய்யாதவற்றை அகற்ற இந்த கோப்பை ('MM திருத்து' உள்ளிட அல்லது F6 ஐ அழுத்துவது) திருத்த பரிந்துரைக்கப்படுகிறது. இது கோப்புகளை விரைவாகவும் மென்மையாகவும் திறக்கும் செயல்முறையை உருவாக்கும் இயல்புநிலை MIME பட்டியல் கோப்பு, மிகவும் பொதுவான கோப்பு வகை சங்கங்களை உள்ளடக்கியது, %s இல் காணலாம்.

source: %s%s Enter '%c' to edit your bookmarks or '%c' to quit.
ta: %s%s உங்கள் புக்மார்க்குகளைத் திருத்த '%சி' அல்லது வெளியேற '%சி' உள்ளிடவும்.

source: %s%s%s -> %s (broken link)
ta: %s%s%s ->%s (உடைந்த இணைப்பு)

source: %s%s%s currently pointing to
ta: %s%s%s தற்போது சுட்டிக்காட்டுகிறது

source: %s%s%s currently pointing to nowhere (broken link)
ta: %s%s%s தற்போது எங்கும் சுட்டிக்காட்டுகிறது (உடைந்த இணைப்பு)

source: %s%s%s successfully relinked to
ta: %s%s%s வெற்றிகரமாக மறுபரிசீலனை செய்யப்பட்டது

source: %s%s%s: Succesfully mounted on %s
ta: %s%s%s:%s இல் வெற்றிகரமாக ஏற்றப்பட்டது

source: %s%s: %sRunning as root. Be careful
ta: %s %s: %srunning root. கவனமாக இருங்கள்

source: %s%sSelection Box%s
ta: %a%தேர்வு பெட்டி%s

source: %s->%s Sorted by:
ta: %s->%s வரிசைப்படுத்தப்பட்டது:

source: %s->%s Switched to profile '%s'
ta: %s->%s '%s' சுயவிவரத்திற்கு மாறியது

source: %s: !%d: event not found
ta: %s:!%d: நிகழ்வு கிடைக்கவில்லை

source: %s: !%s: Event not found
ta: %s:!%s: நிகழ்வு கிடைக்கவில்லை

source: %s: %d: ELN-filename conflict. Bypass internal expansions to fix this issue: ';CMD FILENAME'
ta: %s: %d: ELN-FILENAME மோதல். இந்த சிக்கலை சரிசெய்ய உள் விரிவாக்கங்களைத் தவிர்த்து விடுங்கள்: '; சிஎம்டி கோப்பு பெயர்'

source: %s: %d: Invalid number
ta: %s: %d: தவறான எண்

source: %s: %d: Invalid workspace number
ta: %s: %d: தவறான பணியிட எண்

source: %s: %d: No such order number
ta: %s: %d: அத்தகைய ஆர்டர் எண் இல்லை

source: %s: %s (%s): Cannot open file. Try 'APPLICATION FILENAME'.
ta: %s: %s ( %s): கோப்பைத் திறக்க முடியாது. 'விண்ணப்ப கோப்பு பெயர்' முயற்சிக்கவும்.

source: %s: %s failed to allocate %zu bytes
ta: %s: %s %ZU பைட்டுகளை ஒதுக்க தவறிவிட்டன

source: %s: %s: %s Falling back to default
ta: %s: %s: %s இயல்புநிலையாக மீண்டும் விழுகிறது

source: %s: %s: %s Falling back to the default bookmarks file
ta: %s: %s: %s இயல்புநிலை புக்மார்க்குகள் கோப்பில் திரும்பிச் செல்கிறது

source: %s: %s: %s Falling back to the default keybindings file
ta: %s: %s: %s இயல்புநிலை கீபிண்டிங்ச் கோப்பில் மீண்டும் விழுகிறது

source: %s: %s: Cannot create mountpoint
ta: %s: %s: மவுண்ட்பாயிண்ட் உருவாக்க முடியாது

source: %s: %s: Cannot create profile: Home directory not found
ta: %s: %s: சுயவிவரத்தை உருவாக்க முடியாது: வீட்டு அடைவு காணப்படவில்லை

source: %s: %s: Cannot create symlink: %s
ta: %s: %s: சிம்லிங்கை உருவாக்க முடியாது: %s

source: %s: %s: Error creating profile
ta: %s: %s: சுயவிவரத்தை உருவாக்கும் பிழை

source: %s: %s: Error dequoting file
ta: %s: %s: பிழை டிகோட்டிங் கோப்பு

source: %s: %s: Error dequoting file name
ta: %s: %s: பிழையானது கோப்பு பெயரை

source: %s: %s: Error dequoting filename
ta: %s: %s: பிழை டிகோட்டிங் கோப்பு பெயர்

source: %s: %s: Error getting parent directory
ta: %s: %s: பெற்றோர் கோப்பகத்தைப் பெறுவதில் பிழை

source: %s: %s: Error getting variable name
ta: %s: %s: மாறி பெயரைப் பெறுவது பிழை

source: %s: %s: Error opening file
ta: %s: %s: பிழையை திறப்பது

source: %s: %s: Error quoting file name
ta: %s: %s: கோப்பு பெயரை மேற்கோள் காட்டுவதில் பிழை

source: %s: %s: Error removing profile
ta: %s: %s: சுயவிவரத்தை அகற்றுவதில் பிழை

source: %s: %s: Invalid bookmark
ta: %s: %s: தவறான புக்மார்க்கு

source: %s: %s: Is a directory
ta: %s: %s: ஒரு அடைவு

source: %s: %s: Mounpoint not empty
ta: %s: %s: மவுன்பாயிண்ட் காலியாக இல்லை

source: %s: %s: Mountpoint not empty
ta: %s: %s: மவுண்ட் பாயிண்ட் காலியாக இல்லை

source: %s: %s: No alias found
ta: %s: %s: மாற்றுப்பெயர் இல்லை

source: %s: %s: No associated application found
ta: %s: %s: தொடர்புடைய பயன்பாடு எதுவும் கிடைக்கவில்லை

source: %s: %s: No such color scheme. Falling back to the default one
ta: %s: %s: அத்தகைய வண்ணத் திட்டம் இல்லை. இயல்புநிலை ஒன்றுக்கு மீண்டும் விழுகிறது

source: %s: %s: No such profile
ta: %s: %s: அத்தகைய சுயவிவரம் இல்லை

source: %s: %s: No such profile To add a new profile enter 'pf add PROFILE'
ta: %s: %s: அத்தகைய சுயவிவரம் இல்லை புதிய சுயவிவரத்தைச் சேர்க்க 'pf சேர் சுயவிவரம்' உள்ளிடவும்

source: %s: %s: Not a directory
ta: %s: %s: ஒரு அடைவு அல்ல

source: %s: %s: Not a symbolic link
ta: %s: %s: ஒரு குறியீட்டு இணைப்பு அல்ல

source: %s: %s: Profile already exists
ta: %s: %s: சுயவிவரம் ஏற்கனவே உள்ளது

source: %s: %s: System shell not found. Please edit the configuration file to specify a working shell.
ta: %s: %s: கணினி செல் காணப்படவில்லை. வேலை செய்யும் செல்லைக் குறிப்பிட உள்ளமைவு கோப்பைத் திருத்தவும்.

source: %s: %zu aliases were successfully imported
ta: %s: %ZU மாற்றுப்பெயர்கள் வெற்றிகரமாக இறக்குமதி செய்யப்பட்டன

source: %s: %zu: Invalid workspace. Falling back to workspace %zu
ta: %s: %ZU: தவறான பணியிடங்கள். பணியிடத்திற்கு மீண்டும் விழுதல் %ZU

source: %s: '%c': Invalid option
ta: %s: '%சி': தவறான விருப்பம்

source: %s: '%c': Syntax error
ta: %s: '%சி': தொடரியல் பிழை

source: %s: '%c': Unrecognized file type
ta: %s: '%சி': அங்கீகரிக்கப்படாத கோப்பு வகை

source: %s: '%s' is the current profile
ta: %s: '%s' என்பது தற்போதைய சுயவிவரம்

source: %s: '%s': %s. Using the current working directory as starting path
ta: %s: ' %s': %s. தற்போதைய வேலை கோப்பகத்தை தொடக்க பாதையாகப் பயன்படுத்துதல்

source: %s: '%s': Directory not writable. Bookmarks, commands logs, and commands history are disabled. Program messages won't be persistent. Using default options
ta: %s: '%s': அடைவு எழுத முடியாது. புக்மார்க்குகள், கட்டளைகள் பதிவுகள் மற்றும் கட்டளைகள் வரலாறு முடக்கப்பட்டுள்ளன. நிரல் செய்திகள் தொடர்ந்து இருக்காது. இயல்புநிலை விருப்பங்களைப் பயன்படுத்துதல்

source: %s: '%s': Directory not writable. Trash function disabled
ta: %s: '%s': அடைவு எழுத முடியாது. குப்பை செயல்பாடு முடக்கப்பட்டுள்ளது

source: %s: '%s': Error creating temporary directory
ta: %s: '%s': தற்காலிக கோப்பகத்தை உருவாக்கும் பிழை

source: %s: '%s': Invalid regular expression
ta: %s: '%s': தவறான வழக்கமான வெளிப்பாடு

source: %s: '%s': Profile succesfully created
ta: %s: '%s': சுயவிவரம் வெற்றிகரமாக உருவாக்கப்பட்டது

source: %s: '%s': Profile successfully removed
ta: %s: '%s': சுயவிவரம் வெற்றிகரமாக அகற்றப்பட்டது

source: %s: '%s': Syntax error
ta: %s: '%s': தொடரியல் பிழை

source: %s: '%s': Using a temporary directory for the Selection Box. Selected files won't be persistent accros reboots
ta: %s: '%s': தேர்வு பெட்டிக்கு தற்காலிக கோப்பகத்தைப் பயன்படுத்துதல். தேர்ந்தெடுக்கப்பட்ட கோப்புகள் தொடர்ச்சியான அக்ரோச் மறுதொடக்கங்களாக இருக்காது

source: %s: 'file' command not found. Specify an application when opening files. Ex: 'o 12 nano' or just 'nano 12'
ta: %s: 'கோப்பு' கட்டளை கிடைக்கவில்லை. கோப்புகளைத் திறக்கும்போது பயன்பாட்டைக் குறிப்பிடவும். எ.கா: 'ஓ 12 நானோ' அல்லது வெறும் 'நானோ 12'

source: %s: 1 alias was successfully imported
ta: %s: 1 மாற்றுப்பெயர் வெற்றிகரமாக இறக்குமதி செய்யப்பட்டது

source: %s: Access to configuration files is not allowed in stealth mode
ta: %s: உள்ளமைவு கோப்புகளுக்கான அணுகல் திருட்டுத்தனமான பயன்முறையில் அனுமதிக்கப்படவில்லை

source: %s: Alias already exists
ta: %s: மாற்றுப்பெயர் ஏற்கனவே உள்ளது

source: %s: Alias conflicts with internal command
ta: %s: உள் கட்டளையுடன் மாற்றுப்பெயர்கள் முரண்படுகின்றன

source: %s: Cannot access the configuration file
ta: %s: உள்ளமைவு கோப்பை அணுக முடியாது

source: %s: Cannot access the home directory. Trash, bookmarks, commands logs, and commands history are disabled. Program messages and selected files won't be persistent. Using default options
ta: %s: வீட்டு கோப்பகத்தை அணுக முடியாது. குப்பை, புக்மார்க்குகள், கட்டளைகள் பதிவுகள் மற்றும் கட்டளைகள் வரலாறு முடக்கப்பட்டுள்ளன. நிரல் செய்திகள் மற்றும் தேர்ந்தெடுக்கப்பட்ட கோப்புகள் தொடர்ந்து இருக்காது. இயல்புநிலை விருப்பங்களைப் பயன்படுத்துதல்

source: %s: Cannot open the bookmarks file
ta: %s: புக்மார்க்குகள் கோப்பைத் திறக்க முடியாது

source: %s: Could not save directory history: %s
ta: %s: அடைவு வரலாற்றைக் காப்பாற்ற முடியவில்லை: %s

source: %s: Currently running without colors
ta: %s: தற்போது வண்ணங்கள் இல்லாமல் இயங்குகிறது

source: %s: Default terminal not set. Use the configuration file to set one
ta: %s: இயல்புநிலை முனையம் அமைக்கப்படவில்லை. ஒன்றை அமைக்க உள்ளமைவு கோப்பைப் பயன்படுத்தவும்

source: %s: Directory is immutable
ta: %s: அடைவு மாறாதது

source: %s: Directory jumper function disabled
ta: %s: அடைவு சம்பர் செயல்பாடு முடக்கப்பட்டுள்ளது

source: %s: Error creating the profile file
ta: %s: சுயவிவரக் கோப்பை உருவாக்கும் பிழை

source: %s: Error decoding prompt line. Using an emergency prompt
ta: %s: பிழை டிகோடிங் உடனடி வரி. அவசர வரியைப் பயன்படுத்துதல்

source: %s: Error expanding path
ta: %s: பிழை விரிவடையும் பாதையை

source: %s: Error getting hostname
ta: %s: ஓச்ட்பெயரைப் பெறுவதில் பிழை

source: %s: Error getting mime-type
ta: %s: MIME- வகை பெறுவதில் பிழை

source: %s: Error getting variable name
ta: %s: மாறுபட்ட பெயரைப் பெறுவதில் பிழை

source: %s: Error getting variable value
ta: %s: மாறி மதிப்பைப் பெறுவதில் பிழை

source: %s: Error lauching new instance
ta: %s: புதிய நிகழ்வைத் தொடங்குவதில் பிழை

source: %s: Error opening the history file
ta: %s: வரலாற்றுக் கோப்பைத் திறப்பதில் பிழை

source: %s: Error parsing aliased command
ta: %s: பிழையான பாகுபடுத்தப்பட்ட கட்டளையை பாகுபடுத்துதல்

source: %s: Error parsing history command
ta: %s: வரலாற்று கட்டளையை பாகுபடுத்துதல்

source: %s: Error registering environment colors
ta: %s: சுற்றுச்சூழல் வண்ணங்களை பதிவு செய்வதில் பிழை

source: %s: Error retrieving last visited directory
ta: %s: கடைசியாக பார்வையிட்ட கோப்பகத்தை மீட்டெடுப்பதில் பிழை

source: %s: Error retrieving pinned directory
ta: %s: பின் கோப்பகத்தை மீட்டெடுப்பதில் பிழை

source: %s: Error saving last visited directory
ta: %s: பிழை சேமிப்பு கடைசியாக பார்வையிட்ட கோப்பகத்தை சேமித்தல்

source: %s: Error storing pinned directory
ta: %s: பிழை சேமித்தல் பின் செய்யப்பட்ட கோப்பகத்தை

source: %s: Error writing selected files to the selections file
ta: %s: தேர்ந்தெடுக்கப்பட்ட கோப்புகளை தேர்வுகள் கோப்பில் எழுதுவது பிழை

source: %s: External commands %s
ta: %s: வெளிப்புற கட்டளைகள் %s

source: %s: External commands are not allowed. Run 'ext on' to enable them.
ta: %s: வெளிப்புற கட்டளைகள் அனுமதிக்கப்படவில்லை. அவற்றை இயக்க 'எக்ச்ட் ஆன்' இயக்கவும்.

source: %s: External commands disabled
ta: %s: வெளிப்புற கட்டளைகள் முடக்கப்பட்டன

source: %s: External commands enabled
ta: %s: வெளிப்புற கட்டளைகள் இயக்கப்பட்டன

source: %s: FTP is not yet supported on FreeBSD
ta: %s: FTP இன்னும் FreeBSD இல் ஆதரிக்கப்படவில்லை

source: %s: Fatal error! Failed retrieving current working directory
ta: %s: அபாயகரமான பிழை! தற்போதைய பணி கோப்பகத்தை மீட்டெடுப்பதில் தோல்வி

source: %s: File is immutable
ta: %s: கோப்பு மாறாதது

source: %s: Folders first %s
ta: %s: கோப்புறைகள் முதல் %s

source: %s: Function only available for graphical environments
ta: %s: வரைகலை சூழல்களுக்கு மட்டுமே செயல்பாடு கிடைக்கிறது

source: %s: Hidden files %s
ta: %s: மறைக்கப்பட்ட கோப்புகள் %s

source: %s: History function disabled
ta: %s: வரலாற்று செயல்பாடு முடக்கப்பட்டுள்ளது

source: %s: Loaded alternative bookmarks file
ta: %s: ஏற்றப்பட்ட மாற்று புக்மார்க்குகள் கோப்பு

source: %s: Loaded alternative configuration file
ta: %s: ஏற்றப்பட்ட மாற்று உள்ளமைவு கோப்பு

source: %s: Loaded alternative keybindings file
ta: %s: ஏற்றப்பட்ட மாற்று கீபிண்டிங்ச் கோப்பு

source: %s: Log function disabled
ta: %s: பதிவு செயல்பாடு முடக்கப்பட்டுள்ளது

source: %s: Missing '%c'
ta: %s: '%சி' காணவில்லை

source: %s: No alias imported
ta: %s: எந்த மாற்றுப்பெயரும் இறக்குமதி செய்யப்படவில்லை

source: %s: No color schemes found
ta: %s: வண்ணத் திட்டங்கள் எதுவும் கிடைக்கவில்லை

source: %s: No matches found
ta: %s: போட்டிகள் எதுவும் கிடைக்கவில்லை

source: %s: No option specified for '%s' Trying '%s -e %s -p %s'
ta: %s: '%s' க்கு எந்த விருப்பமும் குறிப்பிடப்படவில்லை ' %s -e %s -p %s' முயற்சிக்கிறது

source: %s: No pinned file
ta: %s: பின் செய்யப்பட்ட கோப்பு இல்லை

source: %s: No such color scheme
ta: %s: அத்தகைய வண்ணத் திட்டம் இல்லை

source: %s: No such file or directory
ta: %s: அத்தகைய கோப்பு அல்லது அடைவு இல்லை

source: %s: Pager %s
ta: %s: பேசர் %s

source: %s: Pager disabled
ta: %s: பேசர் முடக்கப்பட்டது

source: %s: Pager enabled
ta: %s: பேசர் இயக்கப்பட்டது

source: %s: Permission denied
ta: %s: இசைவு மறுக்கப்பட்டது

source: %s: Restart the program for changes to take effect
ta: %s: மாற்றங்கள் நடைமுறைக்கு வர திட்டத்தை மறுதொடக்கம் செய்யுங்கள்

source: %s: Restart your %s for changes to ~/.Xresources to take effect. Otherwise, %s keybindings might not work as expected.
ta: %s: நடைமுறைக்கு வர ~/.xresources க்கு மாற்றங்களுக்கு உங்கள் %s ஐ மறுதொடக்கம் செய்யுங்கள். இல்லையெனில், %s விசைப்பலகைகள் எதிர்பார்த்தபடி செயல்படாது.

source: %s: Running in stealth mode: trash, persistent selection and directory history, just as bookmarks, logs and configuration files, are disabled.
ta: %s: திருட்டுத்தனமான பயன்முறையில் இயங்குகிறது: குப்பை, தொடர்ச்சியான தேர்வு மற்றும் அடைவு வரலாறு, புக்மார்க்குகள், பதிவுகள் மற்றும் உள்ளமைவு கோப்புகள் போன்றவை முடக்கப்பட்டுள்ளன.

source: %s: SFTP is not yet supported on FreeBSD
ta: %s: SFTP இன்னும் FreeBSD இல் ஆதரிக்கப்படவில்லை

source: %s: SMB is not yet supported on FreeBSD
ta: %s: SMB இன்னும் FreeBSD இல் ஆதரிக்கப்படவில்லை

source: %s: Succesfully pinned '%s'
ta: %s: வெற்றிகரமாக '%s'
