Repository: 247i/TACETr
Catalog: உரை/தானி/clifm-clifm-*.po
Languages: ta

source: %s: The color schemes function is disabled in stealth mode TIP: To change the current color scheme use the following environment variables: CLIFM_FILE_COLORS, CLIFM_IFACE_COLORS, and CLIFM_EXT_COLORS
ta: %s: வண்ணத் திட்டங்களின் செயல்பாடு திருட்டுத்தனமான பயன்முறையில் முடக்கப்பட்டுள்ளது உதவிக்குறிப்பு: தற்போதைய வண்ணத் திட்டத்தை மாற்ற பின்வரும் சூழல் மாறிகள் பயன்படுத்தவும்: CLIFM_FILE_COLORS, CLIFM_IFACE_COLORS மற்றும் CLIFM_EXT_COLORS

source: %s: There are no messages
ta: %IS: செய்திகள் எதுவும் இல்லை

source: %s: To gracefully quit enter 'quit'
ta: %s: 'வெளியேறு'

source: %s: Toggled executable bit on %zu file(s)
ta: %s: %ZU கோப்பில் (கள்) இயக்கக்கூடிய பிட் மாற்றப்பட்ட பிட்

source: %s: Trash function disabled
ta: %s: குப்பை செயல்பாடு முடக்கப்பட்டுள்ளது

source: %s: Unicode %s
ta: %s: யூனிகோட் %s

source: %s: Unicode disabled
ta: %s: யூனிகோட் முடக்கப்பட்டது

source: %s: Unicode enabled
ta: %s: யூனிகோட் இயக்கப்பட்டது

source: %s: Unsupported operating system
ta: %s: ஆதரிக்கப்படாத இயக்க முறைமை

source: %s: Usage: mf [NUM]
ta: %s: பயன்பாடு: எம்.எஃப் [எண்]

source: %s: auto-open is disabled
ta: %s: ஆட்டோ-திறந்த முடக்கப்பட்டுள்ளது

source: %s: auto-open is enabled
ta: %s: ஆட்டோ-திறந்த இயக்கப்பட்டது

source: %s: autocd is disabled
ta: %s: ஆட்டோஎச்.டி முடக்கப்பட்டுள்ளது

source: %s: autocd is enabled
ta: %s: ஆட்டோஆக்.டி இயக்கப்பட்டது

source: %s: cd: Home directory not found
ta: %s: குறுவட்டு: வீட்டு அடைவு காணப்படவில்லை

source: %s: current color scheme: %s
ta: %s: தற்போதைய வண்ணத் திட்டம்: %s

source: %s: file: Command not found
ta: %s: கோப்பு: கட்டளை கிடைக்கவில்லை

source: %s: file: Command not found. Specify an application to open the file Usage: open ELN/FILENAME [APPLICATION]
ta: %s: கோப்பு: கட்டளை கிடைக்கவில்லை. கோப்பைத் திறக்க ஒரு பயன்பாட்டைக் குறிப்பிடவும் பயன்பாடு: திறந்த ELN/FILENAME [விண்ணப்பம்]

source: %s: file: Command not found. Try 'edit APPLICATION'
ta: %s: கோப்பு: கட்டளை கிடைக்கவில்லை. 'பயன்பாட்டைத் திருத்து' முயற்சிக்கவும்

source: %s: fopen: '%s': %s. Using default values.
ta: %s: fopen: ' %s': %s. இயல்புநிலை மதிப்புகளைப் பயன்படுத்துதல்.

source: %s: invalid option -- '%c' Usage: %s %s Try '%s --help' for more information.
ta: %s: தவறான விருப்பம் - '%சி' பயன்பாடு: %s %s மேலும் தகவலுக்கு '%s - -help' முயற்சிக்கவும்.

source: %s: mkdir: %s: Error creating configuration directory
ta: %s: எம்.கே.டி.ஐ.ஆர்: %s: உள்ளமைவு கோப்பகத்தை உருவாக்கும் பிழை

source: %s: mkdir: '%s': Error creating configuration directory. Bookmarks, commands logs, and command history are disabled. Program messages won't be persistent. Using default options
ta: %s: எம்.கே.டி.ஐ.ஆர்: '%s': உள்ளமைவு கோப்பகத்தை உருவாக்கும் பிழை. புக்மார்க்குகள், கட்டளைகள் பதிவுகள் மற்றும் கட்டளை வரலாறு முடக்கப்பட்டுள்ளன. நிரல் செய்திகள் தொடர்ந்து இருக்காது. இயல்புநிலை விருப்பங்களைப் பயன்படுத்துதல்

source: %s: mkdir: '%s': Error creating trash directory. Trash function disabled
ta: %s: எம்.கே.டி.ஐ.ஆர்: '%s': குப்பை கோப்பகத்தை உருவாக்கும் பிழை. குப்பை செயல்பாடு முடக்கப்பட்டுள்ளது

source: %s: mkdir: Error creating colors directory. Using the default color scheme
ta: %s: எம்.கே.டி.ஐ.ஆர்: வண்ணங்களை உருவாக்கும் பிழை. இயல்புநிலை வண்ணத் திட்டத்தைப் பயன்படுத்துதல்

source: %s: mkdir: Error creating plugins directory. The actions function is disabled
ta: %s: எம்.கே.டி.ஐ.ஆர்: செருகுநிரல்கள் கோப்பகத்தை உருவாக்கும் பிழை. செயல்கள் செயல்பாடு முடக்கப்பட்டுள்ளது

source: %s: option requires an argument Try '%s --help' for more information.
ta: %s: விருப்பத்திற்கு ஒரு உரையாடல் தேவை மேலும் தகவலுக்கு '%s - -help' முயற்சிக்கவும்.

source: %s: option requires an argument -- '%c' Try '%s --help' for more information.
ta: %s: விருப்பத்திற்கு ஒரு உரையாடல் தேவை - '%சி' மேலும் தகவலுக்கு '%s - -help' முயற்சிக்கவும்.

source: %s: sel: %s: Already selected
ta: %s: SEL: %s: ஏற்கனவே தேர்ந்தெடுக்கப்பட்டவை

source: %s: sel: %s: Invalid regular expression
ta: %s: SEL: %s: தவறான வழக்கமான வெளிப்பாடு

source: %s: shell: unknown
ta: %s: செல்: தெரியவில்லை

source: %s: trash: %d: Invalid ELN
ta: %s: குப்பை: %d: தவறான எல்.என்

source: %s: trash: %s (%s): Unsupported file type
ta: %s: குப்பை: %s ( %s): ஆதரிக்கப்படாத கோப்பு வகை

source: %s: trash: %s/%s: Failed removing trash file Try removing it manually
ta: %s: குப்பை: %s/ %s: குப்பைக் கோப்பை அகற்றுவதில் தோல்வி அதை கைமுறையாக அகற்ற முயற்சிக்கவும்

source: %s: trash: %s: Error getting file name
ta: %s: குப்பை: %s: கோப்பு பெயரைப் பெறுவது பிழை

source: %s: trash: %s: Error removing trashed file
ta: %s: குப்பை: %s: குப்பைத் தொட்டியை அகற்றும் பிழை

source: %s: trash: %s: Failed copying file to Trash
ta: %s: குப்பை: %s: கோப்பை குப்பைக்கு நகலெடுப்பதில் தோல்வி

source: %s: trash: %s: Failed encoding path
ta: %s: குப்பை: %s: தோல்வியுற்ற குறியாக்க பாதை

source: %s: trash: %s: Failed removing file
ta: %s: குப்பை: %s: கோப்பை அகற்றுவதில் தோல்வி

source: %s: trash: %s: Invalid ELN
ta: %s: குப்பை: %s: தவறான ELN

source: %s: trash: Error trashing %s
ta: %s: குப்பை: பிழை %s

source: %s: trash: Failed removing temporary files from Trash. Try removing them manually
ta: %s: குப்பை: குப்பையிலிருந்து தற்காலிக கோப்புகளை அகற்றுவதில் தோல்வி. அவற்றை கைமுறையாக அகற்ற முயற்சிக்கவும்

source: %s: undel: %d: Invalid ELN
ta: %s: undel: %d: தவறான ELN

source: %s: undel: %s: Failed decoding path
ta: %s: undel: %s: தோல்வியுற்ற டிகோடிங் பாதை

source: %s: undel: %s: Failed removing info file
ta: %s: undel: %s: செய்தி கோப்பை அகற்றுவதில் தோல்வி

source: %s: undel: %s: Failed restoring trashed file
ta: %s: undel: %s: தோல்வியுற்றது குப்பைத் தொட்டியை மீட்டெடுப்பது

source: %s: undel: %s: No such file or directory
ta: %s: undel: %s: அத்தகைய கோப்பு அல்லது அடைவு இல்லை

source: %s: undel: %s: Permission denied
ta: %s: undel: %s: இசைவு மறுக்கப்பட்டது

source: %s: undel: Info file for '%s' not found. Try restoring the file manually
ta: %s: undel: '%s' க்கான செய்தி கோப்பு கிடைக்கவில்லை. கோப்பை கைமுறையாக மீட்டமைக்க முயற்சிக்கவும்

source: %s: unknown option character '\%x'
ta: %s: அறியப்படாத விருப்பத்தேர்வு எழுத்து '\%x'

source: %sBookmarks Manager%s
ta: %sbookmarks மேலாளர்%s

source: %sCliFM, the anti-eye-candy, KISS file manager%s Enter '?' or press F[1-3] for instructions.
ta: %sCLIFM, கண் எதிர்ப்பு மிட்டாய், முத்த கோப்பு மேலாளர்%s உள்ளிடவும் '?' அல்லது அறிவுறுத்தல்களுக்கு F [1-3] ஐ அழுத்தவும்.

source: %sExtension colors%s
ta: %செக்ச்டென்சன் வண்ணங்கள்%s

source: %sFile type colors%s
ta: %sfile வகை வண்ணங்கள்%s

source: %sMountpoints%s
ta: %ச்ம ount ண்ட்பாயிண்ட்ச்%s

source: %sNOTE%s: Using Zstandard
ta: %ச்னோட்%s: ZStandard ஐப் பயன்படுத்துதல்

source: %sSelection Box%s
ta: %தேர்வு பெட்டி%s

source: %sTrashed files%s
ta: %ச்ட்ராச்ட் கோப்புகள்%s

source: %s[e]%sxtract %s[E]%sxtract-to-dir %s[l]%sist %s[m]%sount %s[r]%sepack %s[q]%suit
ta: %s [e]%sxtract%s [e]%sxtract-to-dir%s [l]%sist%s [m]%sount%s [r]%sepack%s [q]%வழக்கு

source: %s[e]%sxtract %s[E]%sxtract-to-dir %s[l]%sist %s[t]%stest %s[m]%sount %s[q]%suit
ta: %s [e]%sxtract%s [e]%sxtract-to-dir%s [l]%sist%s [t]%stest%s [m]%sount%s [q]%வழக்கு

source: %s[e]%sxtract %s[t]%sest %s[i]%snfo %s[q]%suit
ta: %s [e]%sxtract%s [t]%sest%s [i]%snfo%s [q]%வழக்கு

source: %zu files are now in the Selection Box
ta: %ZU கோப்புகள் இப்போது தேர்வு பெட்டியில் உள்ளன

source: %zu selected %s:
ta: %ZU தேர்ந்தெடுக்கப்பட்ட %s:

source: '%s': Invalid regular expression
ta: '%s': தவறான வழக்கமான வெளிப்பாடு

source: ?, h: help Down arrow, Enter, Space: Advance one line Page Down: Advance one page q: Stop pagging
ta: ?, எச்: உதவி கீழ் அம்பு, உள்ளிடவும், இடம்: ஒரு வரியை முன்கூட்டியே பக்கம் கீழே: ஒரு பக்கத்தை முன்னேற்றுங்கள் கே: பேக்கிங்கை நிறுத்துங்கள்

source: Access: %s
ta: அணுகல்: %s

source: All bookmarks succesfully removed
ta: அனைத்து புக்மார்க்குகளும் வெற்றிகரமாக அகற்றப்பட்டன

source: Associated application: %s (%s)
ta: தொடர்புடைய பயன்பாடு: %s ( %s)

source: Associated application: None
ta: தொடர்புடைய பயன்பாடு: எதுவுமில்லை

source: Birth: %s
ta: பிறப்பு: %s

source: Block special file
ta: சிறப்பு கோப்பைத் தடுக்கும்

source: Bookmark line example: [sc]name:path
ta: புக்மார்க்கு வரி எடுத்துக்காட்டு: [எச்சி] பெயர்: பாதை

source: Bookmark(s) to be deleted (ex: 1 2-6, or *):
ta: புக்மார்க்கு (கள்) நீக்கப்பட வேண்டும் (எ.கா: 1 2-6, அல்லது *):

source: Bookmarks function disabled
ta: புக்மார்க்ச் செயல்பாடு முடக்கப்பட்டுள்ளது

source: Bookmarks: %d: No such ELN
ta: புக்மார்க்குகள்: %d: அத்தகைய எல்ன் இல்லை

source: Bookmarks: %s: %s
ta: புக்மார்க்குகள்: %s: %s

source: Bookmarks: %s: Invalid bookmark
ta: புக்மார்க்குகள்: %s: தவறான புக்மார்க்கு

source: Bookmarks: %s: No such bookmark
ta: புக்மார்க்குகள்: %s: அத்தகைய புக்மார்க்கு இல்லை

source: Bookmarks: There are no bookmarks Enter 'bm edit' or press F11 to edit the bookmarks file. You can also enter 'bm add PATH' to add a new bookmark
ta: புக்மார்க்குகள்: புக்மார்க்குகள் இல்லை 'பிஎம் திருத்து' உள்ளிடவும் அல்லது புக்மார்க்ச் கோப்பைத் திருத்த எஃப் 11 ஐ அழுத்தவும். புதிய புக்மார்க்கைச் சேர்க்க நீங்கள் 'பிஎம் சேர் பாதையை' உள்ளிடலாம்

source: Change: %s
ta: மாற்றம்: %s

source: Character special file
ta: எழுத்து சிறப்பு கோப்பு

source: Choose a bookmark:
ta: ஒரு புக்மார்க்கைத் தேர்வுசெய்க:

source: Choose a mountpoint ('q' to quit):
ta: ஒரு மவுண்ட் பாயிண்டைத் தேர்வுசெய்க (வெளியேற 'q'):

source: Continue? [y/N]
ta: தொடரவா? [y/n]

source: Current filter: %c%s
ta: தற்போதைய வடிகட்டி: %c %s

source: DEFAULT KEYBOARD SHORTCUTS: M-c: Clear the current command line buffer M-f: Toggle list-folders-first on/off C-r: Refresh the screen M-l: Toggle long view mode on/off M-m: List mountpoints M-t: Clear messages M-h: Show directory history M-i, M-.: Toggle hidden files on/off M-s: Open the Selection Box M-a: Select all files in the current working directory M-d: Deselect all selected files M-r: Change to the root directory M-e, Home: Change to the home directory M-u, S-Up: Change to the parent directory M-j, S-Left: Change to previous visited directory M-k, S-Right: Change to next visited directory M-o: Lock terminal M-p: Change to pinned directory M-1: Switch to workspace 1 M-2: Switch to workspace 2 M-3: Switch to workspace 3 M-4: Switch to workspace 4 C-M-j: Change to first visited directory C-M-k: Change to last visited directory C-M-o: Switch to previous profile C-M-p: Switch to next profile C-M-a: Archive selected files C-M-e: Export selected files C-M-r: Rename selected files C-M-d: Remove selected files C-M-t: Trash selected files C-M-u: Restore trashed files C-M-b: Bookmark last selected file or directory C-M-g: Open/change-into last selected file/directory C-M-n: Move selected files into the current working directory C-M-v: Copy selected files into the current working directory M-y: Toggle light mode on/off M-z: Switch to previous sorting method M-x: Switch to next sorting method C-x: Launch a new instance F1: Manual page F2: Commands help F3: Keybindings help F6: Open the MIME list file F7: Open the jump database file F8: Open the current color scheme file F9: Open the keybindings file F10: Open the configuration file F11: Open the bookmarks file F12: Quit NOTE: C stands for Ctrl, S for Shift, and M for Meta (Alt key in most keyboards)
ta: இயல்புநிலை விசைப்பலகை குறுக்குவழிகள்: எம்-சி: தற்போதைய கட்டளை வரி இடையகத்தை அழிக்கவும் எம்-எஃப்: பட்டியல்-கோப்புறைகளை மாற்றவும்-முதல்/ஆஃப் சி-ஆர்: திரையைப் புதுப்பிக்கவும் எம்-எல்: நீண்ட பார்வை பயன்முறையை ஆன்/ஆஃப் மாற்றவும் எம்-எம்: பட்டியல் மவுண்ட்பாயிண்ட்ச் எம்-டி: தெளிவான செய்திகளை அழிக்கவும் எம்-எச்: அடைவு வரலாற்றைக் காட்டு M-I, M-.: மறைக்கப்பட்ட கோப்புகளை/முடக்கவும் எம்-எச்: தேர்வு பெட்டியைத் திறக்கவும் எம்-ஏ: தற்போதைய பணி கோப்பகத்தில் உள்ள எல்லா கோப்புகளையும் தேர்ந்தெடுக்கவும் எம்-டி: தேர்ந்தெடுக்கப்பட்ட அனைத்து கோப்புகளையும் தேர்வுநீக்கு எம்-ஆர்: ரூட் கோப்பகத்திற்கு மாற்றம் எம்-இ, வீடு: வீட்டு கோப்பகத்திற்கு மாற்றம் எம்-யு, எச்-அப்: பெற்றோர் கோப்பகத்திற்கு மாற்றம் எம்-சே, எச்-இடது: முந்தைய பார்வையிட்ட கோப்பகத்திற்கு மாற்றம் எம்-கே, எச்-ரைட்: அடுத்த பார்வையிட்ட கோப்பகத்திற்கு மாற்றம் M-O: பூட்டு முனையம் எம்-பி: பின் செய்யப்பட்ட கோப்பகத்திற்கு மாற்றம் எம் -1: பணியிடத்திற்கு மாறவும் 1 எம் -2: பணியிடத்திற்கு மாறவும் 2 எம் -3: பணியிடத்திற்கு மாறவும் 3 எம் -4: பணியிடத்திற்கு மாறவும் 4 சி-எம்-சே: முதலில் பார்வையிட்ட கோப்பகத்திற்கு மாற்றம் சி-எம்-கே: கடைசியாக பார்வையிட்ட கோப்பகத்திற்கு மாற்றம் சி-எம்-ஓ: முந்தைய சுயவிவரத்திற்கு மாறவும் C-M-P: அடுத்த சுயவிவரத்திற்கு மாறவும் சி-எம்-ஏ: காப்பக தேர்ந்தெடுக்கப்பட்ட கோப்புகள் C-M-E: தேர்ந்தெடுக்கப்பட்ட கோப்புகளை ஏற்றுமதி செய்யுங்கள் சி-எம்-ஆர்: தேர்ந்தெடுக்கப்பட்ட கோப்புகளை மறுபெயரிடுங்கள் சி-எம்-டி: தேர்ந்தெடுக்கப்பட்ட கோப்புகளை அகற்று சி-எம்-டி: குப்பை தேர்ந்தெடுக்கப்பட்ட கோப்புகள் சி-எம்-யு: குப்பைத் தொட்டிகளை மீட்டமை சி-எம்-பி: புக்மார்க்கு கடைசியாக தேர்ந்தெடுக்கப்பட்ட கோப்பு அல்லது அடைவு சி-எம்-சி: திறந்த/மாற்றம்-இல் கடைசியாக தேர்ந்தெடுக்கப்பட்ட கோப்பு/அடைவு C-M-N: தேர்ந்தெடுக்கப்பட்ட கோப்புகளை தற்போதைய பணி கோப்பகத்தில் நகர்த்தவும் சி-எம்-வி: தேர்ந்தெடுக்கப்பட்ட கோப்புகளை தற்போதைய பணி கோப்பகத்தில் நகலெடுக்கவும் M-Y: ஒளி பயன்முறையை ஆன்/ஆஃப் மாற்றவும் M-Z: முந்தைய வரிசையாக்க முறைக்கு மாறவும் எம்-எக்ச்: அடுத்த வரிசையாக்க முறைக்கு மாறவும் சி-எக்ச்: ஒரு புதிய நிகழ்வைத் தொடங்கவும் எஃப் 1: கையேடு பக்கம் எஃப் 2: கட்டளைகள் உதவி எஃப் 3: விசைப்பலகைகள் உதவி F6: MIME பட்டியல் கோப்பைத் திறக்கவும் எஃப் 7: சம்ப் தரவுத்தள கோப்பைத் திறக்கவும் எஃப் 8: தற்போதைய வண்ணத் திட்ட கோப்பைத் திறக்கவும் F9: கீபிண்டிங்ச் கோப்பைத் திறக்கவும் F10: உள்ளமைவு கோப்பைத் திறக்கவும் எஃப் 11: புக்மார்க்குகள் கோப்பைத் திறக்கவும் F12: வெளியேறு குறிப்பு: சி என்பது சி.டி.ஆர்.எல், எச் சிப்ட் மற்றும் எம் மெட்டாவுக்கு எம் (பெரும்பாலான விசைப்பலகைகளில் ஆல்ட் கீ)

source: Device: %zu
ta: சாதனம்: %கூட

source: Directory
ta: அடைவு

source: ELN/FILE/DIR (auto-open and autocd functions) /PATTERN [DIR] [-filetype] [-x] (quick search) ;[CMD], :[CMD] (run CMD via the system shell) ac, ad ELN/FILE ... (archiving functions) acd, autocd [on, off, status] actions [edit] alias [import FILE] ao, auto-open [on, off, status] b, back [h, hist] [clear] [!ELN] bl ELN/FILE ... (batch links) bm, bookmarks [a, add PATH] [d, del] [edit] [SHORTCUT or NAME] br, bulk ELN/FILE ... c, l [e, edit], m, md, r (copy, link, move, makedir, and remove) cc, colors cd [ELN/DIR] cl, columns [on, off] cmd, commands cs, colorscheme [edit] [COLORSCHEME] ds, desel [*, a, all] edit [APPLICATION] exp, export [ELN/FILE ...] ext [on, off, status] f, forth [h, hist] [clear] [!ELN] fc, filescounter [on, off, status] ff, folders-first [on, off, status] fs ft, filter [unset] [REGEX] hf, hidden [on, off, status] history [clear] [-n] icons [on, off] j, jc, jp, jl [STRING ...] jo [NUM], je (directory jumper function) kb, keybinds [edit] [reset] lm [on, off] (lightmode) log [clear] mf NUM (List up to NUM files) mm, mime [info ELN/FILE] [edit] (resource opener) mp, mountpoints msg, messages [clear] n, new FILE DIR/ ...n net [smb, ftp, sftp]://ADDRESS [OPTIONS] o, open [ELN/FILE] [APPLICATION] opener [default] [APPLICATION] p, pr, pp, prop [ELN/FILE ... n] path, cwd pf, prof, profile [ls, list] [set, add, del PROFILE] pg, pager [on, off, status] pin [FILE/DIR] q, quit, exit Q rf, refresh rl, reload s, sel ELN/FILE... [[!]PATTERN] [-FILETYPE] [:PATH] sb, selbox shell [SHELL] splash st, sort [METHOD] [rev] t, tr, trash [ELN/FILE ... n] [ls, list] [clear] [del, rm] te [FILE(s)] tips u, undel, untrash [*, a, all] uc, unicode [on, off, status] unpin v, vv, paste sel [DESTINY] ver, version ws [NUM, +, -] (workspaces) x, X [ELN/DIR] (new instance)
ta: ELN/FILE/DIR (ஆட்டோ-திறந்த மற்றும் ஆட்டோஆக்டி செயல்பாடுகள்) /முறை [dir] [-filetype] [-x] (விரைவான தேடல்) ; [சிஎம்டி],: [சிஎம்டி] (சிச்டம் செல் வழியாக சிஎம்டியை இயக்கவும்) ஏசி, அட் எல்என்/கோப்பு ... (காப்பக செயல்பாடுகள்) ACD, AutoCD [ON, OFF, Status] செயல்கள் [திருத்து] மாற்றுப்பெயர் [இறக்குமதி கோப்பு] AO, தானாகத் திறந்த [ஆன், ஆஃப், நிலை] பி, பின் [எச், இச்ட்] [தெளிவான] [! எல்.என்] bl eln/file ... (தொகுதி இணைப்புகள்) பி.எம். br, மொத்த ELN/FILE ... சி, எல் [இ, திருத்து], எம், எம்.டி, ஆர் (நகல், இணைப்பு, நகர்வு, மாகெடிர் மற்றும் அகற்று) சி.சி, வண்ணங்கள் குறுவட்டு [ELN/dir] cl, நெடுவரிசைகள் [ஆன், ஆஃப்] சி.எம்.டி, கட்டளைகள் சி.எச். ds, desel [*, a, all] திருத்து [பயன்பாடு] exp, ஏற்றுமதி [ELN/FILE ...] ext [ஆன், ஆஃப், நிலை] f, forth [h, hist] [தெளிவான] [! eln] FC, FileScounter [ON, OFF, STATUS] ff, கோப்புறைகள்-முதல் [ஆன், ஆஃப், நிலை] fs ft, வடிகட்டி [unset] [regex] HF, மறைக்கப்பட்ட [ஆன், ஆஃப், நிலை] வரலாறு [தெளிவான] [-n] சின்னங்கள் [ஆன், ஆஃப்] சே, சே.சி, சே.பி., சே.எல் [சரம் ...] சோ [எண்], சே.இ (டைரக்டரி சம்பர் செயல்பாடு) கேபி, கீபிண்ட்ச் [திருத்து] [மீட்டமை] எல்.எம் [ஆன், ஆஃப்] (லைட்மோட்) பதிவு [தெளிவான] MF NUM (எண் கோப்புகளை பட்டியலிடுங்கள்) எம்.எம். எம்.பி., மவுண்ட் பாயிண்ட்ச் எம்.எச்.சி, செய்திகள் [தெளிவான] n, புதிய கோப்பு dir/ ... n நிகர [SMB, FTP, SFTP]: // முகவரி [விருப்பங்கள்] o, திறக்க [ELN/FILE] [பயன்பாடு] தொடக்க வீரர் [இயல்புநிலை] [பயன்பாடு] பி, பி.ஆர், பிபி, ப்ராப் [எல்ன்/கோப்பு ... என்] பாதை, சி.டபிள்யூ.டி பி.எஃப், பேராசிரியர், சுயவிவரம் [எல்.எச்., பட்டியல்] [அமை, சேர், டெல் சுயவிவரம்] பி.சி., பேசர் [ஆன், ஆஃப், நிலை] முள் [கோப்பு/டிர்] கே, வெளியேறு, வெளியேறுதல் கே RF, புதுப்பிக்கவும் ஆர்.எல்., மறுஏற்றம் எச், செல் எல்என்/கோப்பு ... [[!] முறை] [-பிலெட்டைப்] [: பாதை] எச்.பி., செல்பாக்ச் செல் [செல்] ச்பிளாச் st, வரிசைப்படுத்து [முறை] [rev] t, tr, குப்பை [ELN/FILE ... N] [LS, LIST] [தெளிவான] [DEL, RM] te [கோப்பு (கள்)] உதவிக்குறிப்புகள் u, undel, Unstrash [*, a, all] யு.சி, யூனிகோட் [ஆன், ஆஃப், நிலை] unpin வி, வி.வி, பேச்ட் செல் [விதி] ver, பதிப்பு ws [எண், +, -] (பணியிடங்கள்) ஃச், ஃச் [eln/dir] (புதிய நிகழ்வு)

source: Empty
ta: காலி

source: End filename with a slash to create a directory
ta: ஒரு கோப்பகத்தை உருவாக்க ஒரு குறைப்புடன் கோப்பு பெயர்

source: Enter 'q' to quit
ta: வெளியேற 'q' ஐ உள்ளிடவும்

source: Enter links suffix ('n' for none):
ta: இணைப்புகள் பின்னொட்டை உள்ளிடவும் ('n' எதுவுமில்லை):

source: Error getting command!
ta: கட்டளையைப் பெறுவதில் பிழை!

source: Error opening temporary file
ta: தற்காலிக கோப்பைத் திறப்பதில் பிழை

source: Excerpt from 'What is Free Software?', by Richard Stallman. Source: https://www.gnu.org/philosophy/free-sw.html "'Free software' means software that respects users' freedom and community. Roughly, it means that the users have the freedom to run, copy, distribute, study, change and improve the software. Thus, 'free software' is a matter of liberty, not price. To understand the concept, you should think of 'free' as in 'free speech', not as in 'free beer'. We sometimes call it 'libre software', borrowing the French or Spanish word for 'free' as in freedom, to show we do not mean the software is gratis. We campaign for these freedoms because everyone deserves them. With these freedoms, the users (both individually and collectively) control the program and what it does for them. When users don't control the program, we call it a 'nonfree' or proprietary program. The nonfree program controls the users, and the developer controls the program; this makes the program an instrument of unjust power. A program is free software if the program's users have the four essential freedoms: - The freedom to run the program as you wish, for any purpose (freedom 0). - The freedom to study how the program works, and change it so it does your computing as you wish (freedom 1). Access to the source code is a precondition for this. - The freedom to redistribute copies so you can help your neighbor (freedom 2). - The freedom to distribute copies of your modified versions to others (freedom 3). By doing this you can give the whole community a chance to benefit from your changes. Access to the source code is a precondition for this. A program is free software if it gives users adequately all of these freedoms. Otherwise, it is nonfree. While we can distinguish various nonfree distribution schemes in terms of how far they fall short of being free, we consider them all equally unethical (...)"
ta: ரிச்சர்ட் ச்டால்மேன் எழுதிய 'இலவச மென்பொருள் என்றால் என்ன?' ஆதாரம்: https://www.gnu.org/philosophy/free-sw.html "'இலவச மென்பொருள்' என்பது பயனர்களின் சுதந்திரத்தையும் சமூகத்தையும் மதிக்கும் மென்பொருளாகும். தோராயமாக, பயனர்களுக்கு மென்பொருளை இயக்க, நகலெடுக்க, விநியோகிக்க, படிப்பது மற்றும் மேம்படுத்த விடுதலை உள்ளது என்று பொருள். இதனால், 'இலவச மென்பொருள்' என்பது ஒரு சேதி லிபர்ட்டி, விலை அல்ல, 'இலவச பேச்சு' போல 'இலவச பீர்' போல அல்ல, பிரெஞ்சு அல்லது ச்பானிச் வார்த்தையை 'இலவசமாக' இலவசமாக அழைக்க வேண்டும். 'சுதந்திரத்தைப் போலவே, மென்பொருள் இலவசம் என்று நாங்கள் அர்த்தப்படுத்தவில்லை. இந்த சுதந்திரங்களுக்காக நாங்கள் பிரச்சாரம் செய்கிறோம், ஏனென்றால் எல்லோரும் அவர்களுக்கு தகுதியானவர்கள். இந்த சுதந்திரங்களுடன், பயனர்கள் (தனித்தனியாகவும் கூட்டாகவும்) நிரலை கட்டுப்படுத்துகிறார்கள், அது அவர்களுக்கு என்ன செய்கிறது. பயனர்கள் நிரலைக் கட்டுப்படுத்தாதபோது, ​​அதை 'இலவசம்' அல்லது தனியுரிம திட்டம் என்று அழைக்கிறோம். அல்லாத நிரல் பயனர்களைக் கட்டுப்படுத்துகிறது, மேலும் உருவாக்குபவர் நிரலைக் கட்டுப்படுத்துகிறார்; இது நிரலை அநியாய சக்தியின் கருவியாக மாற்றுகிறது. நிரல் பயனர்களுக்கு நான்கு அத்தியாவசிய சுதந்திரங்கள் இருந்தால் ஒரு நிரல் இலவச மென்பொருள்: - எந்தவொரு நோக்கத்திற்காகவும் நீங்கள் விரும்பியபடி திட்டத்தை இயக்குவதற்கான விடுதலை (சுதந்திரம் 0). - நிரல் எவ்வாறு செயல்படுகிறது என்பதைப் படிப்பதற்கான விடுதலை, அதை மாற்றுகிறது, எனவே நீங்கள் விரும்பியபடி உங்கள் கம்ப்யூட்டிங் செய்கிறது (சுதந்திரம் 1). மூலக் குறியீட்டிற்கான அணுகல் இதற்கு ஒரு முன் நிபந்தனையாகும். - நகல்களை மறுபகிர்வு செய்வதற்கான விடுதலை, எனவே நீங்கள் உங்கள் அண்டை நாடுகளுக்கு உதவ முடியும் (சுதந்திரம் 2). - உங்கள் மாற்றியமைக்கப்பட்ட பதிப்புகளின் நகல்களை மற்றவர்களுக்கு விநியோகிக்கும் விடுதலை (சுதந்திரம் 3). இதைச் செய்வதன் மூலம், உங்கள் மாற்றங்களிலிருந்து பயனடைய முழு சமூகத்திற்கும் ஒரு வாய்ப்பை வழங்கலாம். மூலக் குறியீட்டிற்கான அணுகல் இதற்கு ஒரு முன் நிபந்தனையாகும். இந்த சுதந்திரங்கள் அனைத்தையும் பயனர்களுக்கு போதுமானதாக வழங்கினால் ஒரு நிரல் இலவச மென்பொருள். இல்லையெனில், அது இலவசம் அல்ல. பல்வேறு அல்லாத விநியோகத் திட்டங்களை அவை இலவசமாகக் குறைவது எவ்வளவு என்பதை வேறுபடுத்திப் பார்க்க முடியும் என்றாலும், அவை அனைத்தும் சமமான நெறிமுறையற்றவை (...) "என்று நாங்கள் கருதுகிறோம்"

source: Extension: %s
ta: நீட்டிப்பு: %s

source: Extraction path:
ta: பிரித்தெடுத்தல் பாதை:

source: FIFO/pipe
ta: ஃபிஃபோ/குழாய்

source: Fifo
ta: ஃபிஃபோ

source: File succesfully bookmarked
ta: கோப்பு வெற்றிகரமாக புக்மார்க்கு செய்யப்பட்டது

source: File(s) to be deselected (ex: 1 2-6, or *):
ta: கோப்பு (கள்) தேர்வு செய்யப்பட வேண்டும் (எ.கா: 1 2-6, அல்லது *):

source: File(s) to be removed (ex: 1 2-6, or *):
ta: அகற்றப்பட வேண்டிய கோப்பு (கள்) (எ.கா: 1 2-6, அல்லது *):

source: File(s) to be undeleted (ex: 1 2-6, or *):
ta: கோப்பு (கள்) நீக்கப்பட வேண்டும் (எ.கா: 1 2-6, அல்லது *):

source: Filename ('q' to quit):
ta: கோப்பு பெயர் (வெளியேற 'q'):

source: Filescounter is disabled
ta: FileScounter முடக்கப்பட்டுள்ளது

source: Filescounter is enabled
ta: FileScounter இயக்கப்பட்டது

source: Filter unset
ta: வடிகட்டப்படாதது

source: Glob: No matches found. Trying regex...
ta: குளோப்: போட்டிகள் எதுவும் கிடைக்கவில்லை. ரீசெக்ச் முயற்சிக்கிறது ...

source: Light mode is off
ta: ஒளி பயன்முறை முடக்கப்பட்டுள்ளது

source: Light mode is on
ta: ஒளி பயன்முறை இயக்கத்தில் உள்ளது

source: Logs %s
ta: பதிவுகள் %s

source: Logs already disabled
ta: பதிவுகள் ஏற்கனவே முடக்கப்பட்டுள்ளன

source: Logs already enabled
ta: பதிவுகள் ஏற்கனவே இயக்கப்பட்டுள்ளன

source: Logs succesfully disabled
ta: பதிவுகள் வெற்றிகரமாக முடக்கப்பட்டன

source: Logs successfully enabled
ta: பதிவுகள் வெற்றிகரமாக இயக்கப்பட்டன

source: MIME type: %s
ta: மைம் வகை: %s

source: Matches found: %d
ta: போட்டிகள் காணப்படுகின்றன: %d

source: Matches found: %zu
ta: போட்டிகள் காணப்படுகின்றன: %கூட

source: Max files set to %d
ta: அதிகபட்ச கோப்புகள் %d என அமைக்கப்பட்டன

source: Max files unset
ta: அதிகபட்ச கோப்புகள் அமைக்கப்படவில்லை

source: Max files: %d
ta: அதிகபட்ச கோப்புகள்: %d

source: Modify: %s
ta: மாற்றியமைத்தல்: %s
