Repository: 247i/TACETr
Catalog: உரை/தானி/clifm-clifm-*.po
Languages: ta

source: NOTE 2: An asterisk next rank values means that the corresponding directory is bookmarked, pinned, or currently used in some workspace
ta: குறிப்பு 2: ஒரு நட்சத்திர அடுத்த தரவரிசை மதிப்புகள் என்பது தொடர்புடைய அடைவு புக்மார்க்கு செய்யப்பட்டது, பின் செய்யப்படுகிறது அல்லது தற்போது சில பணியிடத்தில் பயன்படுத்தப்படுகிறது என்பதாகும்

source: NOTE: First time access is displayed in days, while last time access is displayed in hours
ta: குறிப்பு: முதல் முறையாக அணுகல் நாட்களில் காட்டப்படும், அதே நேரத்தில் கடைசி நேர அணுகல் மணிநேரங்களில் காட்டப்படும்

source: New configuration file written to '%s'
ta: புதிய உள்ளமைவு கோப்பு '%s' க்கு எழுதப்பட்டது

source: New filter successfully set
ta: புதிய வடிகட்டி வெற்றிகரமாக அமைக்கவும்

source: New format (Ex: .tar.xz):
ta: புதிய வடிவம் (எ.கா: .tar.xz):

source: New path ('q' to quit):
ta: புதிய பாதை (வெளியேற 'q'):

source: No configuration file found
ta: உள்ளமைவு கோப்பு எதுவும் கிடைக்கவில்லை

source: No filter set
ta: வடிகட்டி தொகுப்பு இல்லை

source: No matches found
ta: போட்டிகள் எதுவும் கிடைக்கவில்லை

source: No pinned file
ta: பின் கோப்பு இல்லை

source: Old configuration file stored as '%s'
ta: பழைய உள்ளமைவு கோப்பு '%s' என சேமிக்கப்படுகிறது

source: Operation:
ta: செயல்பாடு:

source: Order Visits First Last Rank Directory
ta: ஆர்டர் வருகை முதல் கடைசி தரவரிசை அடைவு

source: Regular file
ta: வழக்கமான கோப்பு

source: Relink as a broken symbolic link? [y/n]
ta: உடைந்த குறியீட்டு இணைப்பாக மறுபரிசீலனை செய்யவா? [y/n]

source: Run the 'colors' or 'cc' command to see the list of currently used color codes.
ta: தற்போது பயன்படுத்தப்பட்ட வண்ணக் குறியீடுகளின் பட்டியலைக் காண 'வண்ணங்கள்' அல்லது 'சிசி' கட்டளையை இயக்கவும்.

source: Size: %s
ta: அளவு: %s

source: Socket
ta: மாட்டி

source: Sorting method:
ta: வரிசையாக்க முறை:

source: Succesfully unpinned %s
ta: வெற்றிகரமாக இணைக்கப்படாத %s

source: Successfully removed '%s'
ta: '%s' வெற்றிகரமாக அகற்றப்பட்டது

source: Successfully set '%s' as %s default shell
ta: ' %s' ஐ %s இயல்புநிலை செல்லாக வெற்றிகரமாக அமைக்கவும்

source: Symbolic link
ta: குறியீட்டு இணைப்பு

source: The configuration and profile files allow you to customize colors, define some prompt commands and aliases, and more. For a full description consult the manpage.
ta: உள்ளமைவு மற்றும் சுயவிவரக் கோப்புகள் வண்ணங்களைத் தனிப்பயனாக்கவும், சில உடனடி கட்டளைகள் மற்றும் மாற்றுப்பெயர்களை வரையறுக்கவும், மேலும் பலவற்றை வரையறுக்கவும் உங்களை அனுமதிக்கின்றன. ஒரு முழு விளக்கத்திற்கு மன்பேசை அணுகவும்.

source: Total size:
ta: மொத்த அளவு:

source: Total size: %s
ta: மொத்த அளவு: %s

source: Try 'mm, mime edit APPLICATION'
ta: 'மிமீ, மைம் திருத்து பயன்பாடு' முயற்சிக்கவும்

source: Usage: !!: Execute the last command. !n: Execute the command number 'n' in the history list. !-n: Execute the last-n command in the history list.
ta: பயன்பாடு: !!: கடைசி கட்டளையை இயக்கவும். ! N: வரலாற்று பட்டியலில் 'n' கட்டளை எண்ணை இயக்கவும். ! -N: வரலாற்று பட்டியலில் கடைசி-என் கட்டளையை இயக்கவும்.

source: Usage: ac, ad ELN/FILE ...
ta: பயன்பாடு: ஏசி, அட் எல்என்/கோப்பு ...

source: Usage: acd, autocd [on, off, status]
ta: பயன்பாடு: ACD, AutoCD [ON, OFF, STATUS]

source: Usage: acd, autocd [on, off, status]
ta: பயன்பாடு: ACD, AutoCD [ON, OFF, STATUS]

source: Usage: alias [import FILE]
ta: பயன்பாடு: மாற்றுப்பெயர் [இறக்குமதி கோப்பு]

source: Usage: alias import FILE
ta: பயன்பாடு: மாற்றுப்பெயர் இறக்குமதி கோப்பு

source: Usage: ao, auto-open [on, off, status]
ta: பயன்பாடு: AO, தானாகத் திறந்த [ஆன், ஆஃப், நிலை]

source: Usage: ao, auto-open [on, off, status]
ta: பயன்பாடு: AO, தானாகத் திறந்த [ஆன், ஆஃப், நிலை]

source: Usage: back, b [h, hist] [clear] [!ELN]
ta: பயன்பாடு: பின், பி [எச், இச்ட்] [தெளிவான] [! எல்.என்]

source: Usage: bl [FILE(s)]
ta: பயன்பாடு: bl [கோப்பு (கள்)]

source: Usage: bm, bookmarks [a, add FILE] [d, del] [edit]
ta: பயன்பாடு: பி.எம்., புக்மார்க்குகள் [அ, கோப்பைச் சேர்] [டி, டெல்] [திருத்து]

source: Usage: bookmarks, bm [a, add PATH]
ta: பயன்பாடு: புக்மார்க்குகள், பி.எம் [ஏ, சேர் பாதை]

source: Usage: br, bulk ELN/FILE ...
ta: பயன்பாடு: Br, மொத்த ELN/FILE ...

source: Usage: br, bulk ELN/FILE ...
ta: பயன்பாடு: Br, மொத்த ELN/FILE ...

source: Usage: cd [ELN/DIR]
ta: பயன்பாடு: குறுவட்டு [ELN/dir]

source: Usage: cl, columns [on, off]
ta: பயன்பாடு: சி.எல், நெடுவரிசைகள் [ஆன், ஆஃப்]

source: Usage: cl, columns [on, off]
ta: பயன்பாடு: சி.எல், நெடுவரிசைகள் [ஆன், ஆஃப்]

source: Usage: cs, colorschemes [edit] [COLORSCHEME]
ta: பயன்பாடு: சி.எச்., கலர்செம்கள் [திருத்து] [CORSOLCHEME]

source: Usage: desel, ds [*, a, all]
ta: பயன்பாடு: டெசெல், டி.எச் [*, ஏ, அனைத்தும்]

source: Usage: exp, export [FILE(s)]
ta: பயன்பாடு: எக்ச்ப், ஏற்றுமதி [கோப்பு (கள்)]

source: Usage: ext [on, off, status]
ta: பயன்பாடு: ext [ஆன், ஆஃப், நிலை]

source: Usage: ext [on, off, status]
ta: பயன்பாடு: ext [ஆன், ஆஃப், நிலை]

source: Usage: fc, filescounter [on, off, status]
ta: பயன்பாடு: FC, FileScounter [ஆன், ஆஃப், நிலை]

source: Usage: fc, filescounter [on, off, status]
ta: பயன்பாடு: FC, FileScounter [ஆன், ஆஃப், நிலை]

source: Usage: ff, folders-first [on, off, status]
ta: பயன்பாடு: FF, கோப்புறைகள்-முதல் [ஆன், ஆஃப், நிலை]

source: Usage: ff, folders-first [on, off, status]
ta: பயன்பாடு: FF, கோப்புறைகள்-முதல் [ஆன், ஆஃப், நிலை]

source: Usage: forth, f [h, hist] [clear] [!ELN]
ta: பயன்பாடு: forth, f [h, hist] [தெளிவான] [! Eln]

source: Usage: ft, filter [unset] [REGEX]
ta: பயன்பாடு: அடி, வடிகட்டி [அமைக்கப்படாத] [ரீசெக்ச்]

source: Usage: hidden, hf [on, off, status]
ta: பயன்பாடு: மறைக்கப்பட்ட, எச்.எஃப் [ஆன், ஆஃப், நிலை]

source: Usage: hidden, hf [on, off, status]
ta: பயன்பாடு: மறைக்கப்பட்ட, எச்.எஃப் [ஆன், ஆஃப், நிலை]

source: Usage: history [clear] [-n]
ta: பயன்பாடு: வரலாறு [தெளிவான] [-n]

source: Usage: icons [on, off]
ta: பயன்பாடு: ஐகான்கள் [ஆன், ஆஃப்]

source: Usage: icons [on, off]
ta: பயன்பாடு: ஐகான்கள் [ஆன், ஆஃப்]

source: Usage: j, jc, jp, jl [STRING ...], jo [NUM], je
ta: பயன்பாடு: சே, சே.சி, சே.பி., சே.எல் [சரம் ...], சோ [எண்], சே.இ.

source: Usage: j, jc, jp, jl [STRING ...], jo [NUM], je
ta: பயன்பாடு: சே, சே.சி, சே.பி., சே.எல் [சரம் ...], சோ [எண்], சே.இ.

source: Usage: kb, keybinds [edit] [reset]
ta: பயன்பாடு: கேபி, கீபிண்ட்ச் [திருத்து] [மீட்டமை]

source: Usage: kb, keybinds [edit] [reset]
ta: பயன்பாடு: கேபி, கீபிண்ட்ச் [திருத்து] [மீட்டமை]

source: Usage: le SYMLINK
ta: பயன்பாடு: லு சிம்லிங்க்

source: Usage: lm [on, off]
ta: பயன்பாடு: எல்.எம் [ஆன், ஆஃப்]

source: Usage: lm [on, off]
ta: பயன்பாடு: எல்.எம் [ஆன், ஆஃப்]

source: Usage: ln edit SYMLINK
ta: பயன்பாடு: ln திருத்து சிம்லிங்க்

source: Usage: log [clear]
ta: பயன்பாடு: பதிவு [தெளிவாக]

source: Usage: messages, msg [clear]
ta: பயன்பாடு: செய்திகள், எம்.எச்.சி [தெளிவான]

source: Usage: mf [NUM]
ta: பயன்பாடு: எம்.எஃப் [எண்]

source: Usage: mm, mime [info ELN/FILENAME] [edit]
ta: பயன்பாடு: எம்.எம், மைம் [தகவல் எல்ன்/கோப்பு பெயர்] [திருத்து]

source: Usage: mm, mime info FILENAME
ta: பயன்பாடு: எம்.எம், மைம் செய்தி கோப்பு பெயர்

source: Usage: mp, mountpoints
ta: பயன்பாடு: எம்.பி., மவுண்ட் பாயிண்ட்ச்

source: Usage: n, new [FILE DIR/ ...n]
ta: பயன்பாடு: n, புதிய [கோப்பு dir/ ... n]

source: Usage: net [sftp, smb, ftp]://ADDRESS [OPTIONS]
ta: பயன்பாடு: நிகர [SFTP, SMB, FTP]: // முகவரி [விருப்பங்கள்]

source: Usage: net [sftp, smb, ftp]://ADDRESS [OPTIONS]
ta: பயன்பாடு: நிகர [SFTP, SMB, FTP]: // முகவரி [விருப்பங்கள்]

source: Usage: o, open ELN/FILE [APPLICATION]
ta: பயன்பாடு: o, திறந்த ELN/FILE [பயன்பாடு]

source: Usage: opener APPLICATION
ta: பயன்பாடு: தொடக்க பயன்பாடு

source: Usage: p, pr, pp, prop [ELN/FILE ... n]
ta: பயன்பாடு: பி, பிஆர், பிபி, ப்ராப் [எல்என்/கோப்பு ... என்]

source: Usage: p, pr, pp, prop [ELN/FILE ... n]
ta: பயன்பாடு: பி, பிஆர், பிபி, ப்ராப் [எல்என்/கோப்பு ... என்]

source: Usage: pager, pg [on, off, status]
ta: பயன்பாடு: பேசர், பி.சி [ஆன், ஆஃப், நிலை]

source: Usage: pf, prof, profile [ls, list] [set, add, del PROFILE]
ta: பயன்பாடு: of, prof, சுயவிவரம் [ls, list] [சுயவிவரத்தை அமைக்கவும், சேர்க்கவும், நீக்கவும்]

source: Usage: pf, prof, profile [set, add, del PROFILE]
ta: பயன்பாடு: of, prof, சுயவிவரம் [சுயவிவரத்தை அமைக்கவும், சேர்க்கவும், நீக்கவும்]

source: Usage: pg, pager [on, off, status]
ta: பயன்பாடு: பி.சி., பேசர் [ஆன், ஆஃப், நிலை]

source: Usage: pg, pager [on, off, status]
ta: பயன்பாடு: பி.சி., பேசர் [ஆன், ஆஃப், நிலை]

source: Usage: s, sel ELN/FILE... [[!]PATTERN] [-FILETYPE] [:PATH]
ta: பயன்பாடு: எச், செல் எல்என்/கோப்பு ... [[!] முறை] [-பிலெட்டைப்] [: பாதை]

source: Usage: shell [SHELL]
ta: பயன்பாடு: செல் [செல்]

source: Usage: st [METHOD] [rev] METHOD: 0 = none, 1 = name, 2 = size, 3 = atime, 4 = btime, 5 = ctime, 6 = mtime, 7 = version, 8 = extension, 9 = inode, 10 = owner, 11 = group
ta: பயன்பாடு: செயின்ட் [முறை] [Ret] முறை: 0 = எதுவுமில்லை, 1 = பெயர், 2 = அளவு, 3 = atime, 4 = btime, 5 = ctime, 6 = mtime, 7 = பதிப்பு, 8 = நீட்டிப்பு, 9 = inode, 10 = உரிமையாளர், 11 = குழு

source: Usage: st [METHOD] [rev] METHOD: 0 = none, 1 = name, 2 = size, 3 = atime, 4 = btime, 5 = ctime, 6 = mtime, 7 = version, 8 = extension, 9 = inode, 10 = owner, 11 = group Both numbers and names are allowed
ta: பயன்பாடு: செயின்ட் [முறை] [Ret] முறை: 0 = எதுவுமில்லை, 1 = பெயர், 2 = அளவு, 3 = atime, 4 = btime, 5 = ctime, 6 = mtime, 7 = பதிப்பு, 8 = நீட்டிப்பு, 9 = inode, 10 = உரிமையாளர், 11 = குழு எண்கள் மற்றும் பெயர்கள் இரண்டும் அனுமதிக்கப்படுகின்றன

source: Usage: t, tr, trash [ELN/FILE ... n] [ls, list] [clear] [del, rm]
ta: பயன்பாடு: டி, டிஆர், குப்பை [எல்என்/கோப்பு ... என்] [எல்எச், பட்டியல்] [தெளிவான] [டெல், ஆர்எம்]

source: Usage: te FILE(s)
ta: பயன்பாடு: te கோப்பு (கள்)

source: Usage: u, undel, untrash [*, a, all]
ta: பயன்பாடு: u, undel, Unstash [*, a, all]

source: Usage: unicode, uc [on, off, status]
ta: பயன்பாடு: யூனிகோட், யு.சி [ஆன், ஆஃப், நிலை]

source: Usage: unicode, uc [on, off, status]
ta: பயன்பாடு: யூனிகோட், யு.சி [ஆன், ஆஃப், நிலை]

source: Usage: ws [NUM, +, -]
ta: பயன்பாடு: WS [எண், +, -]

source: Usage: x, X [DIR]
ta: பயன்பாடு: ஃச், ஃச் [dir]

source: Use extension to specify archive/compression type. Defaults to .tar.gz
ta: காப்பகம்/சுருக்க வகையைக் குறிப்பிட நீட்டிப்பைப் பயன்படுத்தவும். .Tar.gz க்கு இயல்புநிலை

source: X session
ta: ஃச் அமர்வு

source: actions: No actions defined. Use the 'actions edit' command to add some
ta: செயல்கள்: எந்த செயலும் வரையறுக்கப்படவில்லை. சிலவற்றைச் சேர்க்க 'செயல்கள் திருத்து' கட்டளையைப் பயன்படுத்தவும்

source: archiver: %s: Error dequoting file name
ta: காப்பகம்: %s: பிழை டிகோட்டிங் கோப்பு பெயரை

source: archiver: %s: Error escaping string
ta: காப்பகம்: %s: தப்பிக்கும் சரம்

source: archiver: %s: Not an archive/compressed file
ta: காப்பகம்: %s: ஒரு காப்பகம்/சுருக்கப்பட்ட கோப்பு அல்ல

source: block device
ta: தொகுதி சாதனம்

source: bookmarks: %s: No such bookmark
ta: புக்மார்க்குகள்: %s: அத்தகைய புக்மார்க்கு இல்லை

source: bookmarks: %s: Path already bookmarked
ta: புக்மார்க்குகள்: %s: பாதை ஏற்கனவே புக்மார்க்கு செய்யப்பட்டது

source: bookmarks: %s: This name is already in use
ta: புக்மார்க்குகள்: %s: இந்த பெயர் ஏற்கனவே பயன்பாட்டில் உள்ளது

source: bookmarks: %s: This shortcut is already in use
ta: புக்மார்க்குகள்: %s: இந்த குறுக்குவழி ஏற்கனவே பயன்பாட்டில் உள்ளது

source: bookmarks: All bookmarks were deleted However, a backup copy was created (%s)
ta: புக்மார்க்குகள்: அனைத்து புக்மார்க்குகளும் நீக்கப்பட்டன இருப்பினும், காப்புப்பிரதி நகல் உருவாக்கப்பட்டது (%s)

source: bookmarks: Error creating backup file. No bookmark was deleted
ta: புக்மார்க்குகள்: காப்புப்பிரதி கோப்பை உருவாக்குவது பிழை. எந்த புக்மார்க்கும் நீக்கப்படவில்லை

source: bookmarks: Error creating temporary file
ta: புக்மார்க்குகள்: தற்காலிக கோப்பை உருவாக்குவது பிழை

source: bookmarks: Error generating the bookmark line
ta: புக்மார்க்குகள்: புக்மார்க்கு வரியை உருவாக்குவதில் பிழை

source: bookmarks: Error opening the bookmarks file
ta: புக்மார்க்குகள்: புக்மார்க்ச் கோப்பைத் திறப்பதில் பிழை

source: bookmarks: Error parsing input
ta: புக்மார்க்குகள்: உள்ளீடு பாகுபடுத்தும் பிழை

source: bookmarks: There are no bookmarks
ta: புக்மார்க்குகள்: புக்மார்க்குகள் இல்லை

source: btime %s
ta: பி டைம் %s

source: btime (not available: using 'ctime') %s
ta: BIME (கிடைக்கவில்லை: 'CTime' ஐப் பயன்படுத்துதல்) %s

source: bulk: %s: Error dequoting file name
ta: மொத்தம்: %s: பிழை டிகோட்டிங் கோப்பு பெயரை

source: bulk: Line mismatch in rename file
ta: மொத்தம்: மறுபெயரிடு கோப்பில் வரி பொருந்தாதது

source: bulk: Nothing to do
ta: மொத்தம்: எதுவும் செய்ய எதுவும் இல்லை

source: character device
ta: எழுத்து சாதனம்

source: desel: '%s': Invalid ELN
ta: தேசெல்: '%s': தவறான எல்.என்

source: desel: '%s': Invalid element
ta: தேசெல்: '%s': தவறான உறுப்பு

source: desel: There are no selected files
ta: தேசெல்: தேர்ந்தெடுக்கப்பட்ட கோப்புகள் எதுவும் இல்லை

source: disabled
ta: முடக்கப்பட்டது

source: enabled
ta: இயக்கப்பட்டது

source: extension %s
ta: நீட்டிப்பு %s

source: file
ta: கோப்பு

source: files
ta: கோப்புகள்

source: group %s
ta: குழு %s

source: group (not available: using 'name') %s
ta: குழு (கிடைக்கவில்லை: 'பெயரை' பயன்படுத்துதல்) %s

source: history: %d: No such ELN
ta: வரலாறு: %d: அத்தகைய எல்.என் இல்லை

source: history: Usage: b/f [hist] [clear] [!ELN]
ta: வரலாறு: பயன்பாடு: பி/எஃப் [இச்ட்] [தெளிவான] [! எல்.என்]

source: mp: There are no available mountpoints
ta: எம்.பி: கிடைக்கக்கூடிய மவுண்ட்பாயிண்ட்ச் இல்லை

source: name %s
ta: பெயர் %s

source: none
ta: எதுவுமில்லை

source: none %s
ta: எதுவுமில்லை

source: opener: Opener set to '%s'
ta: தொடக்க வீரர்: தொடக்க வீரர் '%s' என அமைக்கப்பட்டார்

source: owner %s
ta: உரிமையாளர் %s

source: owner (not available: using 'name') %s
ta: உரிமையாளர் (கிடைக்கவில்லை: 'பெயரை' பயன்படுத்துதல்) %s

source: pinned file: %s
ta: பின் செய்யப்பட்ட கோப்பு: %s

source: size %s
ta: அளவு %s

source: socket
ta: மாட்டி

source: terminal
ta: முனையத்தில்

source: trash: %s: %s
ta: குப்பை: %s: %s

source: trash: %s: Cannot trash a block device
ta: குப்பை: %s: ஒரு தொகுதி சாதனத்தை குப்பைக்கு வைக்க முடியாது

source: trash: %s: Cannot trash a character device
ta: குப்பை: %s: ஒரு எழுத்து சாதனத்தை குப்பைக்கு வைக்க முடியாது

source: trash: Cannot trash '%s'
ta: குப்பை: '%s' குப்பை

source: trash: There are no trashed files
ta: குப்பை: குப்பைத் தொட்டிகள் எதுவும் இல்லை

source: trash: Use 'trash del' to remove trashed files
ta: குப்பை: குப்பைத்தொட்டிய கோப்புகளை அகற்ற 'குப்பை டெல்' ஐப் பயன்படுத்தவும்

source: undel: %s: Invalid ELN
ta: undel: %s: தவறான ELN

source: unknown
ta: தெரியவில்லை

source: unknown file type
ta: தெரியாத கோப்பு வகை

source: version %s
ta: பதிப்பு %s

source: version (not available: using 'name') %s
ta: பதிப்பு (கிடைக்கவில்லை: 'பெயரை' பயன்படுத்துதல்) %s
