Repository: 247i/TACETr
Catalog: உரை/தானி/clock-metadata-*.po
Languages: ta

# changelogs/2018.txt:1
source: **Fixes** - Fix status bar display in screensaver (when device is in dark mode and AMOLED mode is selected in settings) - Fix widgets refreshing after setting change; - Fix automatic date change for digital widgets (now, the date will be updated every day at midnight) **Improvements** - Add ability to show or not second hand for analog widgets (for Android 12+ only) - Show shadow when dragging timers - Add Russian language to app language setting - Improve and clean code - Update translations
ta: **திருத்தங்கள்** - ச்கிரீன்சேவரில் நிலைப்பட்டி காட்சியை சரிசெய்யவும் (சாதனம் இருண்ட பயன்முறையில் இருக்கும்போது மற்றும் அமைப்புகளில் AMOLED பயன்முறை தேர்ந்தெடுக்கப்பட்டால்) - அமைப்பை மாற்றிய பின் புதுப்பித்த விட்செட்களை சரிசெய்யவும்; - டிசிட்டல் விட்செட்டுகளுக்கான தானியங்கி தேதி மாற்றத்தை சரிசெய்யவும் (இப்போது, தேதி ஒவ்வொரு நாளும் நள்ளிரவில் புதுப்பிக்கப்படும்) **மேம்பாடுகள்** - அனலாக் விட்செட்டுகளுக்கு (Android 12+ க்கு மட்டும்) இரண்டாவது கையைக் காண்பிக்கும் திறனைச் சேர்க்கவும் - டைமர்களை இழுக்கும்போது நிழலைக் காட்டு - பயன்பாட்டு மொழி அமைப்பில் ரச்ய மொழியைச் சேர்க்கவும் - குறியீட்டை மேம்படுத்தி தூய்மை செய்யவும் - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும்

# changelogs/2019.txt:1
source: **Fixes** - Fix hours and minutes displayed in the alarm time picker - Fix a possible error when deleting a timer **Improvements** - Ability to choose which tab to display when opening the app - Improve the time displayed on the "Add 1 minute" button - Set a range for the custom number of minutes to add to the timer to avoid app crashing - Readjust the color of the Material analog widget dial - Improve window animations - Clean and improve code - Update translations
ta: **திருத்தங்கள்** - அலாரம் டைம் பிக்கரில் காட்டப்படும் மணிநேரங்களையும் நிமிடங்களையும் சரிசெய்யவும் - டைமரை நீக்கும் போது ஏற்படக்கூடிய பிழையை சரிசெய்யவும் **மேம்பாடுகள்** - பயன்பாட்டைத் திறக்கும்போது எந்த தாவலைக் காண்பிக்க வேண்டும் என்பதைத் தேர்ந்தெடுக்கும் திறன் - "1 மணித்துளி சேர்" பொத்தானில் காட்டப்படும் நேரத்தை மேம்படுத்தவும் - ஆப்ச் செயலிழப்பதைத் தவிர்க்க, டைமரில் சேர்க்க வேண்டிய தனிப்பயன் நிமிடங்களுக்கு வரம்பை அமைக்கவும் - மெட்டீரியல் அனலாக் விட்செட் டயலின் நிறத்தை மறுசீரமைக்கவும் - சாளர அனிமேசன்களை மேம்படுத்தவும் - குறியீட்டை தூய்மை செய்து மேம்படுத்தவும் - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும்

# changelogs/2020.txt:1
source: **Fixes** - Fix creating timer, starting or pausing stopwatch from app shortcut **Improvements** - Alarms, timers, cities and system ringtones can be backed up and restored - Ability to display/hide date in digital widgets - Add the "Blue" theme - Add UTC time to the city list - Add Turkish & Korean languages to app language setting - Update translations To see all the improvements, visit: https://github.com/BlackyHawky/Clock/releases/tag/2.17 DELETE YOUR OLD BACKUP AND CREATE A NEW ONE AFTER UPDATING
ta: **திருத்தங்கள்** - ஆப் சார்ட்கட்டில் இருந்து டைமரை உருவாக்குதல், ச்டாப்வாட்சை தொடங்குதல் அல்லது இடைநிறுத்துதல் ஆகியவற்றைச் சரிசெய்யவும் **மேம்பாடுகள்** - அலாரங்கள், டைமர்கள், நகரங்கள் மற்றும் கணினி ரிங்டோன்கள் காப்புப் பிரதி எடுக்கப்பட்டு மீட்டமைக்கப்படலாம் - டிசிட்டல் விட்செட்களில் தேதியைக் காண்பிக்கும்/மறைக்கும் திறன் - "ப்ளூ" கருப்பொருள் சேர்க்கவும் - UTC நேரத்தை நகர பட்டியலில் சேர்க்கவும் - பயன்பாட்டு மொழி அமைப்பில் துருக்கிய மற்றும் கொரிய மொழிகளைச் சேர்க்கவும் - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும் அனைத்து மேம்பாடுகளையும் பார்க்க, செல்க: https://github.com/BlackyHawky/Clock/releases/tag/2.17 உங்கள் பழைய காப்புப்பிரதியை நீக்கி, புதுப்பித்த பிறகு புதிய ஒன்றை உருவாக்கவும்

# changelogs/2021.txt:1
source: **Fixes** - Fix Seekbar bug for the "Shake intensity" setting **Improvements** - Improve SeekBar behavior for Android versions lower than Android 8 - Display stopwatch time like in the Google app - Update to SDK 35 - Update translations - Improve and clean code To see all the improvements, visit: https://github.com/BlackyHawky/Clock/releases/tag/2.18 REMINDER: AFTER v2.17, DELETE YOUR OLD BACKUP AND CREATE A NEW ONE
ta: **திருத்தங்கள்** - "சேக் இன்டென்சிட்டி" அமைப்பிற்கான சீக்பார் பிழையை சரிசெய்யவும் **மேம்பாடுகள்** - ஆண்ட்ராய்டு 8ஐ விட குறைவான ஆண்ட்ராய்டு பதிப்புகளுக்கான SeekBar நடத்தையை மேம்படுத்தவும் - கூகுள் ஆப்சைப் போலவே ச்டாப்வாட்ச் நேரத்தைக் காட்டவும் - SDK 35 க்கு புதுப்பிக்கவும் - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும் - குறியீட்டை மேம்படுத்தி தூய்மை செய்யவும் அனைத்து மேம்பாடுகளையும் பார்க்க, செல்க: https://github.com/BlackyHawky/Clock/releases/tag/2.18 நினைவூட்டல்: v2.17க்குப் பிறகு, உங்கள் பழைய காப்புப்பிரதியை நீக்கி, புதிய ஒன்றை உருவாக்கவும்

# changelogs/2022.txt:1
source: **Fixes** - Fix toolbar title color - Fix date and next alarm display - Fix alarms ringtone after a restore … and more **Improvements** - Enable edge-to-edge for Android 10+ - Ability to export logs - Slide to dismiss/snooze alarm like Google app - Ability to adjust the shake intensity of expired timers - Update translations - Improve and clean code … and more All fixes and improvements are listed here: https://github.com/BlackyHawky/Clock/releases/tag/2.19
ta: **திருத்தங்கள்** - கருவிப்பட்டியின் தலைப்பு நிறத்தை சரிசெய்யவும் - தேதி மற்றும் அடுத்த அலாரம் காட்சியை சரிசெய்யவும் - மீட்டெடுத்த பிறகு அலாரங்கள் ரிங்டோனை சரிசெய்யவும் … மேலும் **மேம்பாடுகள்** - ஆண்ட்ராய்டு 10+க்கு எட்ச்-டு-எட்ச் இயக்கவும் - பதிவுகளை ஏற்றுமதி செய்யும் திறன் - Google ஆப்ச் போன்ற அலாரத்தை நிராகரிக்க/ச்னூச் செய்ய ச்லைடு செய்யவும் - காலாவதியான டைமர்களின் குலுக்கல் தீவிரத்தை சரிசெய்யும் திறன் - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும் - குறியீட்டை மேம்படுத்தி தூய்மை செய்யவும் … மேலும் அனைத்து திருத்தங்களும் மேம்பாடுகளும் இங்கே பட்டியலிடப்பட்டுள்ளன: https://github.com/BlackyHawky/Clock/releases/tag/2.19

# changelogs/2023.txt:1
source: **Fixes** - Fix top padding for devices with notch - Fix alarm and timer vibrations for some devices **Improvements** - Set alarms to a specific date - Ability to play ringtones randomly - Ability to select folder to add ringtones - Hide alarm label if not specified - Remove the `DISABLE_KEYGUARD` permission - Disable swipe to delete alarms if system animations are disabled - Update translations - Improve and clean code All changes here: https://github.com/BlackyHawky/Clock/releases/tag/2.20
ta: **திருத்தங்கள்** - நாட்ச் கொண்ட சாதனங்களுக்கான மேல் திணிப்பை சரிசெய்யவும் - சில சாதனங்களுக்கு அலாரம் மற்றும் நேரங்குறிகருவி அதிர்வுகளை சரிசெய்யவும் **மேம்பாடுகள்** - ஒரு குறிப்பிட்ட தேதியில் அலாரங்களை அமைக்கவும் - சீரற்ற முறையில் ரிங்டோன்களை இயக்கும் திறன் - ரிங்டோன்களைச் சேர்க்க கோப்புறையைத் தேர்ந்தெடுக்கும் திறன் - குறிப்பிடப்படவில்லை என்றால் அலாரம் லேபிளை மறை - `DISABLE_KEYGUARD` அனுமதியை அகற்றவும் - கணினி அனிமேசன்கள் முடக்கப்பட்டிருந்தால் அலாரங்களை நீக்க ச்வைப் செய்வதை முடக்கவும் - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும் - குறியீட்டை மேம்படுத்தி தூய்மை செய்யவும் எல்லா மாற்றங்களும் இங்கே: https://github.com/BlackyHawky/Clock/releases/tag/2.20

# changelogs/2024.txt:1
source: **Fix** - Fix a bug introduced in version 2.20 regarding stopwatch buttons **Note** Other features of version 2.20 are retained and can be viewed in the link below: - Fix top padding for devices with notch - Fix alarm and timer vibrations for some devices - Set alarms to a specific date - Ability to play ringtones randomly - Ability to select folder to add ringtones - Remove the `DISABLE_KEYGUARD` permission ... and more https://github.com/BlackyHawky/Clock/releases/tag/2.20
ta: **சரி** - ச்டாப்வாட்ச் பொத்தான்கள் தொடர்பாக பதிப்பு 2.20 இல் அறிமுகப்படுத்தப்பட்ட பிழையை சரிசெய்யவும் **குறிப்பு** பதிப்பு 2.20 இன் பிற நற்பொருத்தங்கள் தக்கவைக்கப்பட்டுள்ளன மேலும் கீழே உள்ள இணைப்பில் பார்க்கலாம்: - நாட்ச் கொண்ட சாதனங்களுக்கான மேல் திணிப்பை சரிசெய்யவும் - சில சாதனங்களுக்கு அலாரம் மற்றும் நேரங்குறிகருவி அதிர்வுகளை சரிசெய்யவும் - ஒரு குறிப்பிட்ட தேதியில் அலாரங்களை அமைக்கவும் - சீரற்ற முறையில் ரிங்டோன்களை இயக்கும் திறன் - ரிங்டோன்களைச் சேர்க்க கோப்புறையைத் தேர்ந்தெடுக்கும் திறன் - `DISABLE_KEYGUARD` அனுமதியை அகற்றவும் ... மேலும் https://github.com/BlackyHawky/Clock/releases/tag/2.20

# changelogs/2025.txt:1
source: **Fix** - Fix custom time picker 'OK' button when typing values with keyboard **Improvements** - Ability to set the seconds for the '+ 1:00' button on timers - Improve app performance when a timer is running - Don't resize the dialog for small screens - Set random ringtones for system and custom ringtones separately - Make alarms repeatable if missed - Improve ringtone playback - Update translations All changes here: https://github.com/BlackyHawky/Clock/releases/tag/2.22
ta: **சரி** - விசைப்பலகை மூலம் மதிப்புகளைத் தட்டச்சு செய்யும் போது தனிப்பயன் நேரத்தைத் தேர்ந்தெடுக்கும் 'சரி' பொத்தானை சரிசெய்யவும் **மேம்பாடுகள்** - டைமர்களில் '+ 1:00' பொத்தானுக்கு வினாடிகளை அமைக்கும் திறன் - நேரங்குறிகருவி இயங்கும் போது பயன்பாட்டின் செயல்திறனை மேம்படுத்தவும் - சிறிய திரைகளுக்கான உரையாடலின் அளவை மாற்ற வேண்டாம் - கணினி மற்றும் தனிப்பயன் ரிங்டோன்களுக்கான சீரற்ற ரிங்டோன்களை தனித்தனியாக அமைக்கவும் - தவறவிட்டால் அலாரங்களை மறுநிகழ்வு செய்யக்கூடியதாக மாற்றவும் - ரிங்டோன் பிளேபேக்கை மேம்படுத்தவும் - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும் எல்லா மாற்றங்களும் இங்கே: https://github.com/BlackyHawky/Clock/releases/tag/2.22

# changelogs/2026.txt:1
source: **Fixes** - Fix alarm display for devices with Android version lower than 12 - Fix alarms created in the past and not enabled - Fix alarm date picker selecting wrong day - Reset the default ringtone in alarm settings if it has been deleted Lots of improvements detailed here: https://github.com/BlackyHawky/Clock/releases/tag/2.23 Note: Due to the reset of "Snooze length" and "Gradually increase volume" settings, please make a new backup after updating the app and delete the old one
ta: **திருத்தங்கள்** - 12 க்கும் குறைவான ஆண்ட்ராய்டு பதிப்பு கொண்ட சாதனங்களுக்கான அலாரம் காட்சியை சரிசெய்யவும் - கடந்த காலத்தில் உருவாக்கப்பட்ட மற்றும் இயக்கப்படாத அலாரங்களை சரிசெய்யவும் - தவறான நாளைத் தேர்ந்தெடுக்கும் அலாரம் தேதி பிக்கரை சரிசெய்யவும் - அலாரம் அமைப்புகளில் இயல்புநிலை ரிங்டோன் நீக்கப்பட்டிருந்தால் அதை மீட்டமைக்கவும் நிறைய மேம்பாடுகள் இங்கே விவரிக்கப்பட்டுள்ளன: https://github.com/BlackyHawky/Clock/releases/tag/2.23 குறிப்பு: "ச்னூச் நீளம்" மற்றும் "படிப்படியாக ஒலியளவை அதிகரிக்க" அமைப்புகளை மீட்டமைப்பதன் காரணமாக, பயன்பாட்டைப் புதுப்பித்த பிறகு புதிய காப்புப்பிரதியை உருவாக்கி, பழையதை நீக்கவும்

# changelogs/2027.txt:1
source: Lots of improvements in this version; everything is detailed here: https://github.com/BlackyHawky/Clock/releases/tag/2.24 **Note: Due to code changes, some alarm settings have been reset:** - `Silence after` * On the "Customize alarm display" page: - `Display time with seconds` - `Second hand color` **Please make a new backup after updating the app and delete the old one**
ta: இந்த பதிப்பில் நிறைய மேம்பாடுகள்; எல்லாம் இங்கே விரிவாக உள்ளது: https://github.com/BlackyHawky/Clock/releases/tag/2.24 **குறிப்பு: குறியீடு மாற்றங்கள் காரணமாக, சில அலாரம் அமைப்புகள் மீட்டமைக்கப்பட்டுள்ளன:** - `பின் அமைதி` * "அலாரம் காட்சியைத் தனிப்பயனாக்கு" பக்கத்தில்: - `விநாடிகளுடன் காட்சி நேரம்` - `செகண்ட் ஏண்ட் கலர்` ** பயன்பாட்டைப் புதுப்பித்த பிறகு புதிய காப்புப்பிரதியை உருவாக்கவும், பழையதை நீக்கவும்**

# changelogs/2028.txt:1
source: Many fixes and improvements detailed here: https://github.com/BlackyHawky/Clock/releases/tag/2.25 **Note: Due to code changes, two timer settings have been reset:** - `Silence after` - `Default time to add to timer` **Please make a new backup after updating the app and delete the old one**
ta: பல திருத்தங்கள் மற்றும் மேம்பாடுகள் இங்கே விவரிக்கப்பட்டுள்ளன: https://github.com/BlackyHawky/Clock/releases/tag/2.25 **குறிப்பு: குறியீடு மாற்றங்கள் காரணமாக, இரண்டு நேரங்குறிகருவி அமைப்புகள் மீட்டமைக்கப்பட்டுள்ளன:** - `பின் அமைதி` - `டைமரில் சேர்க்க இயல்புநிலை நேரம்` ** பயன்பாட்டைப் புதுப்பித்த பிறகு புதிய காப்புப்பிரதியை உருவாக்கவும், பழையதை நீக்கவும்**

# changelogs/2029.txt:1
source: Many fixes and improvements detailed here: https://github.com/BlackyHawky/Clock/releases/tag/2.26 **Note: - Due to a change in the code for the "Silence after" setting, it is recommended to redefine the value of this setting, make a new backup, and delete the old one.
ta: பல திருத்தங்கள் மற்றும் மேம்பாடுகள் இங்கே விவரிக்கப்பட்டுள்ளன: https://github.com/BlackyHawky/Clock/releases/tag/2.26 **குறிப்பு: - "பின் அமைதி" அமைப்பிற்கான குறியீட்டில் ஏற்பட்ட மாற்றம் காரணமாக, இந்த அமைப்பின் மதிப்பை மறுவரையறை செய்யவும், புதிய காப்புப்பிரதியை உருவாக்கவும், பழையதை நீக்கவும் பரிந்துரைக்கப்படுகிறது.
