Repository: 247i/TACETr
Catalog: உரை/தானி/clock-metadata-*.po
Languages: ta

# title.txt:1
source: Clock
ta: கடிகை

# short_description.txt:1
source: Alarm, clock, timer and stopwatch mode
ta: அலாரம், கடிகாரம், நேரங்குறிகருவி மற்றும் ச்டாப்வாட்ச் பயன்முறை

# full_description.txt:1
source: Clock is a privacy-conscious open-source clock, based on AOSP. Does not use internet permission, and thus is 100% offline. Features: <ul> <li>Set the alarms to a specific date;</li> <li>Flip and shake action to dismiss/postpone alarm;</li> <li>Turn off/postpone the alarm with the power button or volume buttons;</li> <li>For some Snapdragon devices only, the alarm is triggered when they are switched off</li> <ul> <li>Unfortunately, this feature may not work on some devices despite the presence of the <i>"com.qualcomm.qti.poweroffalarm"</i> system app.</li> </ul> <li>Swipe to delete an alarm;</li> <li>Duplicate alarms;</li> <li>Customizable alarm title;</li> <li>Customizable ringtone;</li> <li>Ability to play ringtones randomly;</li> <li>Light, dark or system theme;</li> <li>AMOLED mode for dark theme;</li> <li>Customizable interface;</li> <li>Digital or analog clock style;</li> <li>Display home time when traveling;</li> <li>Display the time in many cities around the world;</li> <li>Timer and stopwatch included;</li> <li>Possibility of sharing your stopwatch with your contacts;</li> <li>Customizable screensaver;</li> <li>Modern widgets;</li> <li>Customizable widgets;</li> <li>Support for tiles in quick settings (for Android 7+);</li> <li>Backup and restore application data (except custom ringtones);</li> <li>Material design;</li> <li>Dynamic colors for Android 12+;</li> </ul>
ta: கடிகாரம் என்பது AOSP அடிப்படையிலான தனியுரிமை உணர்வுள்ள திறந்த மூல கடிகாரமாகும். இணைய அனுமதியைப் பயன்படுத்தாது, இதனால் 100% ஆஃப்லைனில் உள்ளது. அம்சங்கள்: <ul> <li>அலாரம்களை குறிப்பிட்ட தேதிக்கு அமைக்கவும்;</li> <li>அலாரத்தை நிராகரிக்க/ஒத்திவைக்க நடவடிக்கையை புரட்டி அசைக்கவும்;</li> <li>பவர் பட்டன் அல்லது வால்யூம் பட்டன்கள் மூலம் அலாரத்தை அணைக்கவும்/ ஒத்திவைக்கவும்;</li> <li>சில ச்னாப்டிராகன் சாதனங்களுக்கு மட்டும், அவை அணைக்கப்படும் போது அலாரம் தூண்டப்படும்</li> <ul> <li>துரதிர்ச்டவசமாக, <i>"com.qualcomm.qti.poweroffalarm"</i> சிச்டம் ஆப்ச் இருந்தாலும் சில சாதனங்களில் இந்த நற்பொருத்தம் வேலை செய்யாமல் போகலாம்.</li> </ul> <li>அலாரத்தை நீக்க ச்வைப் செய்யவும்;</li> <li>நகல் அலாரங்கள்;</li> <li>தனிப்பயனாக்கக்கூடிய அலாரம் தலைப்பு;</li> <li>தனிப்பயனாக்கக்கூடிய ரிங்டோன்;</li> <li> ரிங்டோன்களை சீரற்ற முறையில் இயக்கும் திறன்;</li> <li>ஒளி, இருண்ட அல்லது கணினி தீம்;</li> <li>அடர்ந்த தீமுக்கான AMOLED பயன்முறை;</li> <li>தனிப்பயனாக்கக்கூடிய இடைமுகம்;</li> <li>டிசிட்டல் அல்லது அனலாக் கடிகார நடை;</li> <li>பயணத்தின் போது வீட்டு நேரத்தைக் காட்டு;</li> <li>உலகின் பல நகரங்களில் நேரத்தைக் காட்டவும்;</li> <li>டைமர் மற்றும் ச்டாப்வாட்ச் சேர்க்கப்பட்டுள்ளது;</li> <li>உங்கள் ச்டாப்வாட்சை உங்கள் தொடர்புகளுடன் பகிர்வதற்கான சாத்தியம்;</li> <li>தனிப்பயனாக்கக்கூடிய ச்கிரீன்சேவர்;</li> <li>நவீன விட்செட்டுகள்;</li> <li>தனிப்பயனாக்கக்கூடிய விட்செட்டுகள்;</li> <li>விரைவு அமைப்புகளில் டைல்களுக்கான உதவி (Android 7+க்கு);</li> <li>பயன்பாட்டுத் தரவை காப்புப் பிரதி எடுத்து மீட்டமைத்தல் (தனிப்பயன் ரிங்டோன்கள் தவிர);</li> <li>பொருள் வடிவமைப்பு;</li> <li>Android 12+ க்கான மாறும் வண்ணங்கள்;</li> </ul>

# changelogs/2001.txt:1
source: **Fixes:** * Fix alarm triggering for Android 14; * Fix stopwatch and timer notifications; * Fix force close for bedtime when no alarm is set or when the device is rotated; * Fix some malfunctions for the Bedtime mode; * Fix screensaver launch for Android 13+; * Fix display and update of digital widget for Android 12+; * Fix setting alarm volume in settings; * Fix background color of bottom navigation bar (tablets are the most affected); **Improvements:** * Implement material design (switches, time picker, rounded icons, card background,...); * Add dynamic colors; * Add AMOLED mode for dark theme; * Add new permission management; * Add monochrome icon; * Add collapsing toolbar; * Add Material You analog and digital widgets; * Add "Bedtime" mode (by @Nilsu11); * Replace icons with more rounded ones; * When the application is launched for the first time, a presentation of the main features as well as the possibility of managing permissions is included; * Add verification that essential permissions are granted at app launch to ensure the app is working properly; * Allow debug version to be installed along with release version; * Set default ringtone for alarms in settings; * Add screensaver display options; * Activate screensaver with a long press on the clock; * Reduce screensaver animation to 30 seconds; * Menus are displayed by icons; * Modernize the appearance of settings; * Add "About" section in settings; * Animate the bedtime icon; * Displays keyboard automatically when editing an alarm; * Add a delete icon and the text "Delete" when swiping to delete an alarm; * Add a button to duplicate an alarm (except for the bedtime alarm, which is useless); * The vibrator is not activated when an alarm is created and on alarms initially created; * Increase vibrator duration when activating an alarm; * Allow display of analog clock in the alarm trigger view; * Update Fragment related code to use AndroidX; * Update license headers; * Delete unnecessary files and code;
ta: **திருத்தங்கள்:** * ஆண்ட்ராய்டு 14க்கான அலாரம் தூண்டுதலை சரிசெய்யவும்; * ச்டாப்வாட்ச் மற்றும் நேரங்குறிகருவி அறிவிப்புகளை சரிசெய்யவும்; * அலாரம் அமைக்கப்படாதபோது அல்லது சாதனத்தை சுழற்றும்போது உறங்கும் நேரத்துக்கு மூடு விசையை சரிசெய்யவும்; * பெட் டைம் பயன்முறையில் சில செயலிழப்புகளைச் சரிசெய்யவும்; * ஆண்ட்ராய்டு 13+க்கான ச்கிரீன்சேவர் வெளியீட்டை சரிசெய்யவும்; * ஆண்ட்ராய்டு 12+ க்கான டிசிட்டல் விட்செட்டின் காட்சி மற்றும் புதுப்பிப்பை சரிசெய்யவும்; * அமைப்புகளில் அலாரத்தின் அளவை அமைக்கவும்; * கீழ் வழிசெலுத்தல் பட்டியின் பின்னணி நிறத்தை சரிசெய்யவும் (மாத்திரைகள் மிகவும் பாதிக்கப்படுகின்றன); **மேம்பாடுகள்:** * மெட்டீரியல் டிசைனைச் செயல்படுத்தவும் (சுவிட்சுகள், டைம் பிக்கர், வட்டமான ஐகான்கள், அட்டை பின்னணி,...); * மாறும் வண்ணங்களைச் சேர்க்கவும்; * இருண்ட கருப்பொருளுக்கு AMOLED பயன்முறையைச் சேர்க்கவும்; * புதிய இசைவு நிர்வாகத்தைச் சேர்க்கவும்; * ஒரே வண்ணமுடைய ஐகானைச் சேர்க்கவும்; * சரியும் கருவிப்பட்டியைச் சேர்க்கவும்; * மெட்டீரியல் யூ அனலாக் மற்றும் டிசிட்டல் விட்செட்களைச் சேர்க்கவும்; * "Bedtime" பயன்முறையைச் சேர்க்கவும் (@Nilsu11 மூலம்); * ஐகான்களை மேலும் வட்டமானவற்றுடன் மாற்றவும்; * பயன்பாடு முதல் முறையாக தொடங்கப்படும் போது, ​​முக்கிய அம்சங்களின் விளக்கக்காட்சி மற்றும் அனுமதிகளை நிர்வகிப்பதற்கான சாத்தியக்கூறு சேர்க்கப்பட்டுள்ளது; * ஆப்ச் சரியாகச் செயல்படுகிறதா என்பதை உறுதிசெய்ய, ஆப்ச் வெளியீட்டின் போது அத்தியாவசிய அனுமதிகள் வழங்கப்பட்டுள்ளன என்பதைச் சரிபார்க்கவும்; * பிழைத்திருத்தப் பதிப்பை வெளியீட்டுப் பதிப்போடு நிறுவ அனுமதிக்கவும்; * அமைப்புகளில் அலாரங்களுக்கான இயல்புநிலை ரிங்டோனை அமைக்கவும்; * ச்கிரீன்சேவர் காட்சி விருப்பங்களைச் சேர்க்கவும்; * கடிகாரத்தை நீண்ட நேரம் அழுத்துவதன் மூலம் ச்கிரீன்சேவரை இயக்கவும்; * ச்கிரீன்சேவர் அனிமேசனை 30 வினாடிகளாகக் குறைக்கவும்; * மெனுக்கள் ஐகான்களால் காட்டப்படும்; * அமைப்புகளின் தோற்றத்தை நவீனப்படுத்துதல்; * அமைப்புகளில் "அறிமுகம்" பகுதியைச் சேர்க்கவும்; * உறக்கநேர ஐகானை அனிமேட் செய்யுங்கள்; * அலாரத்தைத் திருத்தும்போது தானாகவே விசைப்பலகையைக் காட்டுகிறது; * அலாரத்தை நீக்க ச்வைப் செய்யும் போது நீக்கு ஐகானையும் "நீக்கு" என்ற உரையையும் சேர்க்கவும்; * அலாரத்தை நகலெடுக்க ஒரு பொத்தானைச் சேர்க்கவும் (உறக்க நேர அலாரத்தைத் தவிர, இது பயனற்றது); * ஒரு அலாரம் உருவாக்கப்பட்ட போது மற்றும் அலாரங்கள் ஆரம்பத்தில் உருவாக்கப்பட்ட போது அதிர்வு செயல்படுத்தப்படுகிறது; * அலாரத்தை இயக்கும்போது அதிர்வு காலத்தை அதிகரிக்கவும்; * அலாரம் தூண்டுதல் பார்வையில் அனலாக் கடிகாரத்தைக் காட்ட அனுமதி; * AndroidX ஐப் பயன்படுத்த, துண்டு தொடர்பான குறியீட்டைப் புதுப்பிக்கவும்; * உரிமத் தலைப்புகளைப் புதுப்பிக்கவும்; * தேவையற்ற கோப்புகள் மற்றும் குறியீட்டை நீக்கவும்;

# changelogs/2002.txt:1
source: **Fix:** * Fix display of shortcuts when long-pressing the app icon; **Improvement:** * Remove unnecessary permissions; Main changes can be found here: https://github.com/BlackyHawky/Clock/releases/tag/2.0
ta: **சரி:** * ஆப்ச் ஐகானை நீண்ட நேரம் அழுத்தும் போது சார்ட்கட்களின் காட்சியை சரிசெய்யவும்; **மேம்பாடு:** * தேவையற்ற அனுமதிகளை அகற்று; முக்கிய மாற்றங்களை இங்கே காணலாம்: https://github.com/BlackyHawky/Clock/releases/tag/2.0

# changelogs/2003.txt:1
source: **Fix** - Fix the size of the marker in the stopwatch circle; **Improvements** - Add the ability to change the accent color; - Add the ability to hide/display card backgrounds (does not apply to settings); - Add the ability to hide/display background borders (does not apply to settings); - Add the ability to enable/disable vibrations to some UI elements (only devices equipped with a vibrator are affected); - Vibrations are added to the settings switches (only devices equipped with a vibrator are affected); - Remove essential permissions check when opening the app: now, if essential permissions are not granted, a message appears at the top of the settings; - Screenshots updated (mainly for F-Droid) as discussed here: https://github.com/BlackyHawky/Clock/discussions/23#discussioncomment-9346357
ta: **சரி** - ச்டாப்வாட்ச் வட்டத்தில் மார்க்கரின் அளவை சரிசெய்யவும்; **மேம்பாடுகள்** - உச்சரிப்பு நிறத்தை மாற்றும் திறனைச் சேர்க்கவும்; - அட்டை பின்னணியை மறைக்கும்/காட்சிப்படுத்தும் திறனைச் சேர்க்கவும் (அமைப்புகளுக்குப் பொருந்தாது); - பின்னணி எல்லைகளை மறைத்தல்/காண்பிக்கும் திறனைச் சேர்க்கவும் (அமைப்புகளுக்குப் பொருந்தாது); - சில இடைமுகம் உறுப்புகளுக்கு அதிர்வுகளை இயக்கும்/முடக்கும் திறனைச் சேர்க்கவும் (அதிர்வு கருவியுடன் கூடிய சாதனங்கள் மட்டுமே பாதிக்கப்படுகின்றன); - அமைப்புகள் சுவிட்சுகளில் அதிர்வுகள் சேர்க்கப்படுகின்றன (அதிர்வு கொண்ட சாதனங்கள் மட்டுமே பாதிக்கப்படுகின்றன); - பயன்பாட்டைத் திறக்கும்போது அத்தியாவசிய அனுமதிகளை அகற்று - இங்கே விவாதிக்கப்பட்டபடி (முக்கியமாக F-Droidக்கு) ச்கிரீன்சாட்கள் புதுப்பிக்கப்பட்டன: https://github.com/BlackyHawky/Clock/discussions/23#discussioncomment-9346357

# changelogs/2004.txt:1
source: **Fix** - Fix the color of the timer minutes for the French language; - Fix "Shake to snooze" action for Android 14+; **Improvements** - Update Readme to clarify the use of Weblate for translations; - Upcoming alarm days always displayed, even if the alarm is deactivated; - Timer display is reduced when stopped (only phones in portrait mode are affected); - Play/pause the timer by clicking on the remaining time; - Some translations updated; - Screenshots updated (mainly for F-Droid) as discussed here: https://github.com/BlackyHawky/Clock/discussions/23#discussioncomment-9346357
ta: **சரி** - பிரஞ்சு மொழிக்கான நேரங்குறிகருவி நிமிடங்களின் நிறத்தை சரிசெய்யவும்; - ஆண்ட்ராய்டு 14+ க்கான "உறக்கநிலைக்கு குலுக்கல்" செயலை சரிசெய்யவும்; **மேம்பாடுகள்** - மொழிபெயர்ப்புகளுக்கு வெப்லேட்டின் பயன்பாட்டைத் தெளிவுபடுத்த Readme ஐப் புதுப்பிக்கவும்; - அலாரம் செயலிழந்திருந்தாலும், வரவிருக்கும் அலாரம் நாட்கள் எப்போதும் காட்டப்படும்; - நிறுத்தப்படும் போது நேரங்குறிகருவி காட்சி குறைக்கப்படுகிறது (உருவப்பட பயன்முறையில் உள்ள தொலைபேசிகள் மட்டுமே பாதிக்கப்படும்); - மீதமுள்ள நேரத்தைக் சொடுக்கு செய்வதன் மூலம் டைமரை இயக்கவும் / இடைநிறுத்தவும்; - சில மொழிபெயர்ப்புகள் புதுப்பிக்கப்பட்டன; - இங்கே விவாதிக்கப்பட்டபடி (முக்கியமாக F-Droidக்கு) ச்கிரீன்சாட்கள் புதுப்பிக்கப்பட்டன: https://github.com/BlackyHawky/Clock/discussions/23#discussioncomment-9346357

# changelogs/2005.txt:1
source: **Fix** - Fix digital widgets update for Android13+; **Improvements** - Digital widgets are customizable: • The color of all elements can be changed; • Font size can be changed for the main clock (only possible if no city is displayed); • Configure digital widgets on long press for Android 9+; - Some translations updated;
ta: **சரி** - Android13+ க்கான டிசிட்டல் விட்செட் புதுப்பிப்பை சரிசெய்யவும்; **மேம்பாடுகள்** - டிசிட்டல் விட்செட்டுகள் தனிப்பயனாக்கக்கூடியவை: • அனைத்து உறுப்புகளின் நிறத்தையும் மாற்றலாம்; • முக்கிய கடிகாரத்திற்கான எழுத்துரு அளவை மாற்றலாம் (எந்த நகரமும் காட்டப்படாவிட்டால் மட்டுமே சாத்தியம்); • ஆண்ட்ராய்டு 9+ க்கான நீண்ட அழுத்தத்தில் டிசிட்டல் விட்செட்களை உள்ளமைக்கவும்; - சில மொழிபெயர்ப்புகள் புதுப்பிக்கப்பட்டன;

# changelogs/2006.txt:1
source: **Fixes** - Fix the display of digital widgets for some versions of Android; - For phones in landscape mode only, the timer text title can be re-entered; **Improvements** - Improve app opening; - Dismiss or snooze alarms by swiping or tapping; - Add color picker to screensaver and digital widgets settings; - To see all the improvements, visit: https://github.com/BlackyHawky/Clock/releases/tag/2.5 **Note:** Due to a change in settings, you will need to redefine the "Dark theme mode" setting.
ta: **திருத்தங்கள்** - ஆண்ட்ராய்டின் சில பதிப்புகளுக்கான டிசிட்டல் விட்செட்களின் காட்சியை சரிசெய்யவும்; - லேண்ட்ச்கேப் பயன்முறையில் உள்ள தொலைபேசிகளுக்கு மட்டும், நேரங்குறிகருவி உரைத் தலைப்பை மீண்டும் உள்ளிடலாம்; **மேம்பாடுகள்** - பயன்பாட்டின் திறப்பை மேம்படுத்தவும்; - ச்வைப் அல்லது தட்டுவதன் மூலம் அலாரங்களை நிராகரிக்கவும் அல்லது உறக்கநிலையில் வைக்கவும்; - ச்கிரீன்சேவர் மற்றும் டிசிட்டல் விட்செட் அமைப்புகளில் வண்ணத் தேர்வியைச் சேர்க்கவும்; - அனைத்து மேம்பாடுகளையும் பார்க்க, செல்க: https://github.com/BlackyHawky/Clock/releases/tag/2.5 **குறிப்பு:** அமைப்புகளில் ஏற்பட்ட மாற்றத்தின் காரணமாக, நீங்கள் "டார்க் கருப்பொருள் பயன்முறை" அமைப்பை மறுவரையறை செய்ய வேண்டும்.

# changelogs/2007.txt:1
source: **Fixes** - Fix "Gradually increase volume" summary for timer **Improvements** - Remove unnecessary permissions; - Improve alarm and timer; - To see all the improvements, visit: https://github.com/BlackyHawky/Clock/releases/tag/2.6 **Note:** Due to a change in database, you'll need to reinstall the app.
ta: **திருத்தங்கள்** - டைமருக்கான "படிப்படியாக ஒலியளவை அதிகரிக்கவும்" சுருக்கத்தை சரிசெய்யவும் **மேம்பாடுகள்** - தேவையற்ற அனுமதிகளை அகற்று; - அலாரம் மற்றும் டைமரை மேம்படுத்தவும்; - அனைத்து மேம்பாடுகளையும் பார்க்க, செல்க: https://github.com/BlackyHawky/Clock/releases/tag/2.6 **குறிப்பு:** தரவுத்தளத்தில் ஏற்பட்ட மாற்றத்தின் காரணமாக, நீங்கள் பயன்பாட்டை மீண்டும் நிறுவ வேண்டும்.

# changelogs/2008.txt:1
source: **Improvements** - Choose the default style for the time picker; - Add a fade transition when browsing settings; - Customize alarm animation display; - Add a "Nothing" action to the volume buttons; - Update translations; - To see all the improvements, visit: https://github.com/BlackyHawky/Clock/releases/tag/2.7
ta: **மேம்பாடுகள்** - நேரத்தைத் தேர்ந்தெடுப்பதற்கான இயல்புநிலை பாணியைத் தேர்வுசெய்க; - அமைப்புகளை உலாவும்போது மங்கலான மாற்றத்தைச் சேர்க்கவும்; - அலாரம் அனிமேசன் காட்சியைத் தனிப்பயனாக்குங்கள்; - தொகுதி பொத்தான்களில் "ஒன்றுமில்லை" செயலைச் சேர்க்கவும்; - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும்; - அனைத்து மேம்பாடுகளையும் பார்க்க, செல்க: https://github.com/BlackyHawky/Clock/releases/tag/2.7

# changelogs/2009.txt:1
source: **Fixes** - Fix timer that continues to run if set to less than 5 seconds - Fix the colors of Material You widgets that didn't follow the device's day/night theme - Fix Clock settings that didn't apply correctly on some devices **Improvements** - Add 2 new widgets - Fade transitions are disabled by default - To see all the improvements, visit: https://github.com/BlackyHawky/Clock/releases/tag/2.8 **Note:** Due to internal changes to widgets, you may need to reload them
ta: **திருத்தங்கள்** - 5 வினாடிகளுக்கு குறைவாக அமைக்கப்பட்டால் தொடர்ந்து இயங்கும் டைமரை சரிசெய்யவும் - சாதனத்தின் பகல்/இரவு கருப்பொருளைப் பின்பற்றாத மெட்டீரியல் யூ விட்செட்களின் வண்ணங்களைச் சரிசெய்யவும் - சில சாதனங்களில் சரியாகப் பொருந்தாத கடிகார அமைப்புகளைச் சரிசெய்யவும் **மேம்பாடுகள்** - 2 புதிய விட்செட்களைச் சேர்க்கவும் - ஃபேட் மாற்றங்கள் இயல்பாகவே முடக்கப்படும் - அனைத்து மேம்பாடுகளையும் பார்க்க, செல்க: https://github.com/BlackyHawky/Clock/releases/tag/2.8 **குறிப்பு:** விட்செட்களில் உள்ள உள் மாற்றங்கள் காரணமாக, நீங்கள் அவற்றை மீண்டும் ஏற்ற வேண்டியிருக்கும்

# changelogs/2010.txt:1
source: **Fixes** - Fix tab indicator color - Fix the color of the seconds hand in the Clock tab - Fix display bug when launching screensaver from device settings **Improvements** - Add backup and restore settings - Sort timers and new settings added - Separate accent colors for day and night modes - Update night accent color - Update translations To see all the improvements, visit: https://github.com/BlackyHawky/Clock/releases/tag/2.9 Note: you need to reset the "Notification reminder" setting
ta: **திருத்தங்கள்** - தாவல் காட்டி நிறத்தை சரிசெய்யவும் - கடிகார தாவலில் விநாடிகளின் நிறத்தை சரிசெய்யவும் - சாதன அமைப்புகளிலிருந்து ச்கிரீன்சேவரைத் தொடங்கும் போது காட்சிப் பிழையை சரிசெய்யவும் **மேம்பாடுகள்** - காப்புப்பிரதியைச் சேர்த்து அமைப்புகளை மீட்டமைக்கவும் - டைமர்களை வரிசைப்படுத்தவும், புதிய அமைப்புகள் சேர்க்கப்பட்டன - பகல் மற்றும் இரவு முறைகளுக்கு தனி உச்சரிப்பு வண்ணங்கள் - இரவு உச்சரிப்பு நிறத்தைப் புதுப்பிக்கவும் - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும் அனைத்து மேம்பாடுகளையும் பார்க்க, செல்க: https://github.com/BlackyHawky/Clock/releases/tag/2.9 குறிப்பு: நீங்கள் "அறிவிப்பு நினைவூட்டல்" அமைப்பை மீட்டமைக்க வேண்டும்

# changelogs/2011.txt:1
source: **Fixes** - Fix dragging when phone is in landscape mode - Fix the color of the seconds hand in the Clock tab **Improvements** - Set alarms for a specific date - Choose date picker style - Add the "Black", "Purple" and "Yellow" themes - Reset expired timer with volume and power buttons - Add actions to volume buttons for stopwatch - Optimize and update vector icons - Update translations - Improve code To see all the improvements, visit: https://github.com/BlackyHawky/Clock/releases/tag/2.10
ta: **திருத்தங்கள்** - தொலைபேசி லேண்ட்ச்கேப் பயன்முறையில் இருக்கும்போது இழுப்பதை சரிசெய்யவும் - கடிகார தாவலில் விநாடிகளின் நிறத்தை சரிசெய்யவும் **மேம்பாடுகள்** - ஒரு குறிப்பிட்ட தேதிக்கு அலாரங்களை அமைக்கவும் - தேதி பிக்கர் பாணியைத் தேர்வு செய்யவும் - "கருப்பு", "ஊதா" மற்றும் "மஞ்சள்" கருப்பொருள்களைச் சேர்க்கவும் - ஒலியளவு மற்றும் ஆற்றல் பொத்தான்கள் மூலம் காலாவதியான டைமரை மீட்டமைக்கவும் - ச்டாப்வாட்சிற்கான வால்யூம் பொத்தான்களில் செயல்களைச் சேர்க்கவும் - திசையன் ஐகான்களை மேம்படுத்தவும் புதுப்பிக்கவும் - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும் - குறியீட்டை மேம்படுத்தவும் அனைத்து மேம்பாடுகளையும் பார்க்க, செல்க: https://github.com/BlackyHawky/Clock/releases/tag/2.10

# changelogs/2012.txt:1
source: Due to a major bug caused by the "Set an alarm for a specific date" feature, this has been removed while waiting to find the solution. The other features of version 2.10 are retained and can be consulted here: https://github.com/BlackyHawky/Clock/releases/tag/2.10
ta: "குறிப்பிட்ட தேதிக்கு அலாரத்தை அமைக்கவும்" அம்சத்தால் ஏற்பட்ட பெரிய பிழை காரணமாக, தீர்வு காண காத்திருக்கும் போது இது அகற்றப்பட்டது. பதிப்பு 2.10 இன் மற்ற நற்பொருத்தங்கள் தக்கவைக்கப்பட்டுள்ளன, மேலும் இங்கே அறிவுரை பெறலாம்: https://github.com/BlackyHawky/Clock/releases/tag/2.10

# changelogs/2013.txt:1
source: **Fixes** - Fix ringing preview stop in alarm settings **Improvements** - Add the ability to display a warning before deleting a timer - Replace `X` icon to bin icon for timers - Display the ringtone title when the alarm is triggered - Add IzzyOnDroid badge in Readme - Support for Reproducible Builds - Update translations - Improve code To see all the improvements, visit: https://github.com/BlackyHawky/Clock/releases/tag/2.11
ta: **திருத்தங்கள்** - அலார அமைப்புகளில் ஒலிக்கும் முன்னோட்ட நிறுத்தத்தை சரிசெய்யவும் **மேம்பாடுகள்** - டைமரை நீக்கும் முன் எச்சரிக்கையைக் காண்பிக்கும் திறனைச் சேர்க்கவும் - டைமர்களுக்கான 'X' ஐகானை பின் ஐகானாக மாற்றவும் - அலாரம் தூண்டப்படும்போது ரிங்டோன் தலைப்பைக் காண்பிக்கவும் - Readme இல் IzzyOnDroid பேட்சைச் சேர்க்கவும் - மீண்டும் உருவாக்கக்கூடிய கட்டிடங்களுக்கான உதவி - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும் - குறியீட்டை மேம்படுத்தவும் அனைத்து மேம்பாடுகளையும் பார்க்க, செல்க: https://github.com/BlackyHawky/Clock/releases/tag/2.11

# changelogs/2014.txt:1
source: **Fixes** - Fix display of upcoming alarms from other apps - Fix triggered alarm not showing when device is locked for MIUI devices **Improvements** - Remove Bedtime mode - Tile support in Quick Settings panel - Ability to turn on back flash when alarm is triggered - Ability to adjust the shake intensity - Ability to change application language - Improve landscape mode usability for phones Many other changes are listed on the github page: https://github.com/BlackyHawky/Clock/releases/tag/2.12
ta: **திருத்தங்கள்** - பிற பயன்பாடுகளிலிருந்து வரவிருக்கும் அலாரங்களின் காட்சியை சரிசெய்யவும் - MIUI சாதனங்களுக்கு சாதனம் பூட்டப்பட்டிருக்கும் போது, தூண்டப்பட்ட அலாரத்தைக் காட்டாமல் இருப்பதை சரிசெய்யவும் **மேம்பாடுகள்** - உறக்க நேர பயன்முறையை அகற்று - விரைவு அமைப்புகள் பேனலில் டைல் உதவி - அலாரம் தூண்டப்படும்போது மீண்டும் ஃபிளாச் இயக்கும் திறன் - குலுக்கல் தீவிரத்தை சரிசெய்யும் திறன் - பயன்பாட்டு மொழியை மாற்றும் திறன் - தொலைபேசிகளுக்கான லேண்ட்ச்கேப் பயன்முறையை மேம்படுத்தவும் கிதுப் பக்கத்தில் பல மாற்றங்கள் பட்டியலிடப்பட்டுள்ளன: https://github.com/BlackyHawky/Clock/releases/tag/2.12

# changelogs/2015.txt:1
source: **Fix** - Fix crash when selecting spinner in Clock or Screensaver settings **Improvement** - Update translations The other features of version 2.12 are retained and can be consulted here: https://github.com/BlackyHawky/Clock/releases/tag/2.12
ta: **சரி** - கடிகாரம் அல்லது ச்கிரீன்சேவர் அமைப்புகளில் ச்பின்னரைத் தேர்ந்தெடுக்கும்போது செயலிழப்பை சரிசெய்யவும் **மேம்பாடு** - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும் பதிப்பு 2.12 இன் மற்ற நற்பொருத்தங்கள் தக்கவைக்கப்பட்டுள்ளன, மேலும் இங்கே அறிவுரை பெறலாம்: https://github.com/BlackyHawky/Clock/releases/tag/2.12

# changelogs/2016.txt:1
source: **Fixes** - Fix crash when the "Display ringtone title" setting is disabled - Fix default seconds hand color setting for alarms **Improvements** - Add Material analog clock to clock styles - Improve hour hand rotation - Make screensaver available for third-party apps - Clean code - Update translations To see all the improvements, visit: https://github.com/BlackyHawky/Clock/releases/tag/2.13
ta: **திருத்தங்கள்** - "காட்சி ரிங்டோன் தலைப்பு" அமைப்பு முடக்கப்பட்டிருக்கும் போது செயலிழப்பை சரிசெய்யவும் - அலாரங்களுக்கான இயல்புநிலை வினாடிகள் கை வண்ண அமைப்பை சரிசெய்யவும் **மேம்பாடுகள்** - கடிகார பாணியில் பொருள் அனலாக் கடிகாரத்தைச் சேர்க்கவும் - மணி நேர சுழற்சியை மேம்படுத்தவும் - மூன்றாம் தரப்பு பயன்பாடுகளுக்கு ச்கிரீன்சேவரைக் கிடைக்கச் செய்யுங்கள் - தூய்மையான குறியீடு - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும் அனைத்து மேம்பாடுகளையும் பார்க்க, செல்க: https://github.com/BlackyHawky/Clock/releases/tag/2.13

# changelogs/2017.txt:1
source: This update fixes a major bug in version 2.13 where the ringtone would not stop **Fixes** - Fix ringtone stop - Fix update of next alarm display/hide in the clock tab for Android 14+ - Fix update of next alarm display/hide in digital widgets **Improvements** - Remove unnecessary camera permission - Animations in the settings respect device accessibility settings - Standardize the size of analog clocks - Add Dutch language to app language setting - Update translations
ta: இந்த புதுப்பிப்பு பதிப்பு 2.13 இல் ரிங்டோன் நிறுத்தப்படாத ஒரு பெரிய பிழையை சரிசெய்கிறது **திருத்தங்கள்** - ரிங்டோன் நிறுத்தத்தை சரிசெய்யவும் - ஆண்ட்ராய்டு 14+ க்கான கடிகாரத் தாவலில் அடுத்த அலாரம் காட்சி/மறைவின் புதுப்பிப்பை சரிசெய்யவும் - டிசிட்டல் விட்செட்களில் அடுத்த அலாரம் காட்சி/மறை புதுப்பிப்பை சரிசெய்யவும் **மேம்பாடுகள்** - தேவையற்ற கேமரா அனுமதியை அகற்று - அமைப்புகளில் உள்ள அனிமேசன்கள் சாதன அணுகல் அமைப்புகளை மதிக்கின்றன - அனலாக் கடிகாரங்களின் அளவைத் தரப்படுத்தவும் - பயன்பாட்டு மொழி அமைப்பில் டச்சு மொழியைச் சேர்க்கவும் - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும்
