Repository: 247i/TACETr
Catalog: உரை/தானி/comaps-android-typestrings-*.po
Languages: ta

# type.man_made.tower.communication
source: Communications Tower
ta: செய்தி தொடர்பு கோபுரம்

# type.man_made.mast.communication
source: Communications Mast
ta: கம்யூனிகேசன்ச் மாச்ட்

# type.man_made.petroleum_well
source: Oil or Gas Well
ta: எண்ணெய் அல்லது எரிவாயு கிணறு

# type.man_made.flare
source: Gas Flare
ta: காற்று வெடிப்பு

# type.man_made.crane
source: Crane
ta: கொக்கு

# type.man_made.wastewater_plant
source: Wastewater Treatment Plant
ta: கழிவு நீர் சுத்திகரிப்பு நிலையம்

# type.man_made.water_tap
source: Water Tap
ta: தண்ணீர் குழாய்

# type.man_made.water_tap.drinking_water_no
source: Water Tap
ta: தண்ணீர் குழாய்

# type.man_made.water_tower
source: Water Tower
ta: நீர் கோபுரம்

# type.man_made.water_well
source: Water Well
ta: தண்ணீர் கிணறு

# type.man_made.water_well.drinking_water_no
source: Water Well
ta: தண்ணீர் கிணறு

# type.man_made.windmill
source: Windmill
ta: காற்றாலை

# type.man_made.works
source: Industrial Works
ta: தொழில்துறை பணிகள்

# type.military
source: Military
ta: தரைப்படை

# type.military.bunker
source: Bunker
ta: பதுங்கு குழி

# type.mountain_pass
source: Mountain Pass
ta: மவுண்டன் பாச்

# type.natural
source: Nature
ta: இயற்கை

# type.natural.bare_rock
source: Bare Rock
ta: வெற்றுப் பாறை

# type.natural.shingle
source: Shingle
ta: சிங்கிள்

# type.natural.scree
source: Scree
ta: திரை

# type.natural.bay
source: Bay
ta: விரிகுடா

# type.natural.beach
source: Beach
ta: கடற்கரை

# type.natural.beach.sand
source: Sandy Beach
ta: மணல் கடற்கரை

# type.natural.beach.gravel
source: Gravel Beach
ta: சரளை கடற்கரை

# type.natural.cape
source: Cape
ta: கேப்

# type.natural.cave_entrance
source: Cave Entrance
ta: குகை நுழைவாயில்

# type.natural.cliff
source: Cliff
ta: பாறை

# type.natural.earth_bank
source: Earth Bank
ta: பூமி வங்கி

# type.man_made.embankment
source: Embankment
ta: அணைக்கட்டு

# type.natural.coastline
source: Coastline
ta: கடற்கரை

# type.natural.desert
source: Desert
ta: பாலைவனம்

# type.natural.sand
source: Sand
ta: மணல்

# type.natural.geyser
source: Geyser
ta: கீசர்

# type.natural.glacier
source: Glacier
ta: பனிப்பாறை

# type.natural.grassland
source: Grassland
ta: புல்வெளி

# type.natural.heath
source: Heath
ta: ஈத்

# type.natural.hot_spring
source: Hot Spring
ta: வெந்நீர் ஊற்று

# type.natural.water.lake
source: Lake
ta: ஏரி

# type.natural.water.lock
source: Lock Chamber
ta: பூட்டு அறை

# type.natural.water.pond
source: Pond
ta: குளம்

# type.natural.water.reservoir
source: Reservoir
ta: நீர்த்தேக்கம்

# type.natural.water.basin
source: Basin
ta: பேசின்

# type.natural.water.river
source: River
ta: நதி

# type.natural.land
source: Land
ta: நிலம்

# type.natural.meadow
source: Meadow
ta: புல்வெளி

# type.natural.orchard
source: Orchard
ta: பழத்தோட்டம்

# type.natural.peak
source: Peak
ta: உச்சம்

# type.natural.saddle
source: Mountain Saddle
ta: மலை சேணம்

# type.natural.rock
source: Rock
ta: பாறை

# type.natural.scrub
source: Scrub
ta: ச்க்ரப்

# type.natural.spring
source: Natural Spring
ta: இயற்கை வேனில்

# type.natural.spring.drinking_water_no
source: Natural Spring
ta: இயற்கை வேனில்

# type.natural.strait
source: Strait
ta: சலசந்தி

# type.natural.tree
source: Tree
ta: மரம்

# type.natural.tree_row
source: Tree Row
ta: மர வரிசை

# type.natural.vineyard
source: Vineyard
ta: திராட்சைத் தோட்டம்

# type.natural.volcano
source: Volcano
ta: எரிமலை

# type.natural.water
source: Water
ta: தண்ணீர்

# type.natural.wetland
source: Wetland
ta: ஈரநிலம்

# type.natural.wetland.bog
source: Bog
ta: சதுப்பு நிலம்

# type.natural.wetland.marsh
source: Marsh
ta: சேற்றுத்தரை

# type.natural.wetland.saltmarsh
source: Salt Marsh
ta: உப்பு மார்ச்

# type.natural.wetland.saltmarsh.tidal
source: Tidal Salt Marsh
ta: டைடல் சால்ட் மார்ச்

# type.natural.wetland.fen
source: Fen
ta: ஃபென்

# type.natural.wetland.reedbed
source: Reed Bed
ta: நாணல் படுக்கை

# type.natural.wetland.swamp
source: Swamp
ta: சதுப்பு நிலம்

# type.natural.wetland.mangrove
source: Mangrove
ta: சதுப்புநிலம்

# type.natural.wetland.tidalflat
source: Tidal Flat
ta: டைடல் பிளாட்

# type.noexit
source: Dead End
ta: டெட் எண்ட்

# type.office
source: Office
ta: அலுவலகம்

# type.office.company
source: Company Office
ta: நிறுவனத்தின் அலுவலகம்

# type.office.estate_agent
source: Estate Agent
ta: எச்டேட் ஏசென்ட்

# type.office.government
source: Government Office
ta: அரசு அலுவலகம்

# type.office.insurance
source: Insurance Office
ta: காப்பீட்டு அலுவலகம்

# type.office.lawyer
source: Lawyer
ta: வழக்கறிஞர்

# type.office.ngo
source: Non-Governmental Organization
ta: அரசு சாரா அமைப்பு

# type.office.telecommunication
source: Telecom Company
ta: டெலிகாம் நிறுவனம்

# type.organic.only
source: Organic
ta: ஆர்கானிக்

# type.organic.yes
source: Organic
ta: ஆர்கானிக்

# type.place.city
source: City
ta: நகரம்

# type.place.city.capital
source: Capital
ta: மூலதனம்

# type.place.city.capital.10
source: City
ta: நகரம்

# type.place.city.capital.11
source: City
ta: நகரம்

# type.place.city.capital.2
source: Capital
ta: மூலதனம்

# type.place.city.capital.3
source: City
ta: நகரம்

# type.place.city.capital.4
source: City
ta: நகரம்

# type.place.city.capital.5
source: City
ta: நகரம்

# type.place.city.capital.6
source: City
ta: நகரம்

# type.place.city.capital.7
source: City
ta: நகரம்

# type.place.city.capital.8
source: City
ta: நகரம்

# type.place.city.capital.9
source: City
ta: நகரம்

# type.place.continent
source: Continent
ta: கண்டம்

# type.place.country
source: Country
ta: நாடு

# type.place.county
source: County
ta: மாவட்டம்

# type.place.farm
source: Farm
ta: பண்ணை

# type.place.hamlet
source: Hamlet
ta: ஏம்லெட்

# type.place.island
source: Island
ta: தீவு

# type.place.islet
source: Islet
ta: தீவு

# type.place.isolated_dwelling
source: Isolated Dwelling
ta: தனிமைப்படுத்தப்பட்ட குடியிருப்பு

# type.place.locality
source: Locality
ta: உள்ளக

# type.place.quarter
source: Quarter
ta: காலாண்டு

# type.place.neighbourhood
source: Neighbourhood
ta: அக்கம்

# type.place.ocean
source: Ocean
ta: பெருங்கடல்

# type.place.region
source: Region
ta: பிராந்தியம்

# type.place.sea
source: Sea
ta: கடல்

# type.place.square
source: Square
ta: நாற்கை

# type.place.state
source: State
ta: மாநிலம்

# type.place.state.USA
source: State
ta: மாநிலம்

# type.place.suburb
source: Suburb
ta: புறநகர்

# type.place.town
source: Town
ta: நகரம்

# type.place.village
source: Village
ta: சிற்றூர்

# type.power
source: Power
ta: விசை

# type.power.generator
source: Power Generator
ta: பவர் செனரேட்டர்

# type.power.generator.solar
source: Solar Generator
ta: சோலார் செனரேட்டர்

# type.power.generator.wind
source: Wind Generator
ta: காற்று செனரேட்டர்

# type.power.generator.gas
source: Gas Turbine Power Plant
ta: எரிவாயு விசையாழி மின் நிலையம்

# type.power.generator.hydro
source: Hydroelectric Power Plant
ta: நீர் மின் விளைவாக்கம் நிலையம்

# type.power.line
source: Power Line
ta: பவர் லைன்

# type.power.line.underground
source: Underground Power Line
ta: நிலத்தடி மின் பாதை

# type.power.minor_line
source: Minor Power Line
ta: மைனர் பவர் லைன்

# type.power.plant
source: Power Plant
ta: மின் விளைவாக்கம் நிலையம்

# type.power.plant.coal
source: Coal Power Plant
ta: நிலக்கரி மின் நிலையம்

# type.power.plant.gas
source: Gas Turbine Power Plant
ta: வளிமம் சுழலி விசை Plant

# type.power.plant.hydro
source: Hydroelectric Power Plant
ta: நீர் மின் விளைவாக்கம் நிலையம்

# type.power.plant.solar
source: Solar Power Plant
ta: சூரிய மின் நிலையம்

# type.power.plant.wind
source: Wind Power Plant
ta: காற்றாலை மின் நிலையம்

# type.power.substation
source: Substation
ta: துணை மின் நிலையம்

# type.power.tower
source: Power Tower
ta: பவர் டவர்

# type.power.pole
source: Power Pole
ta: மின் கம்பம்

# type.man_made.utility_pole
source: Utility Pole
ta: பயன்பாட்டு முனை

# type.public_transport
source: Public Transport
ta: பொது போக்குவரத்து

# type.public_transport.platform
source: Platform
ta: மேடை

# type.railway
source: Railway
ta: ரயில்வே

# type.railway.abandoned
source: Abandoned Railway
ta: கைவிடப்பட்ட ரயில்வே

# type.railway.abandoned.bridge
source: Abandoned Railway Bridge
ta: கைவிடப்பட்ட ரயில்வே பாலம்

# type.railway.abandoned.tunnel
source: Abandoned Railway Tunnel
ta: கைவிடப்பட்ட ரயில்வே சுரங்கப்பாதை

# type.railway.construction
source: Railway Construction
ta: ரயில்வே கட்டுமானம்

# type.railway.crossing
source: Railway Crossing
ta: ரயில்வே கிராசிங்

# type.railway.disused
source: Disused Railway
ta: பயன்படுத்தப்படாத ரயில்வே

# type.railway.funicular
source: Funicular
ta: ஃபுனிகுலர்

# type.railway.funicular.bridge
source: Funicular Bridge
ta: ஃபுனிகுலர் பாலம்

# type.railway.funicular.tunnel
source: Funicular Tunnel
ta: புனிகுலர் சுரங்கப்பாதை

# type.railway.halt
source: Rail Halt
ta: ரயில் நிறுத்தம்

# type.railway.level_crossing
source: Level Crossing
ta: இருப்புப்பாதைக் கடவை

# type.railway.light_rail
source: Light Rail
ta: இலகு ரயில்

# type.railway.light_rail.bridge
source: Light Rail Bridge
ta: இலகு ரயில் பாலம்

# type.railway.light_rail.tunnel
source: Light Rail Tunnel
ta: இலகு ரயில் சுரங்கப்பாதை

# type.railway.monorail
source: Monorail
ta: மோனோரயில்

# type.railway.monorail.bridge
source: Monorail Bridge
ta: மோனோரயில் பாலம்

# type.railway.monorail.tunnel
source: Monorail Tunnel
ta: மோனோரயில் சுரங்கப்பாதை

# type.railway.narrow_gauge
source: Narrow Gauge Rail
ta: நாரோ கேச் ரயில்

# type.railway.narrow_gauge.bridge
source: Narrow Gauge Rail Bridge
ta: நெரோ கேச் ரயில் பாலம்

# type.railway.narrow_gauge.tunnel
source: Narrow Gauge Rail Tunnel
ta: நாரோ கேச் ரயில் சுரங்கப்பாதை

# type.railway.platform
source: Railway Platform
ta: ரயில்வே பிளாட்ஃபார்ம்

# type.railway.preserved
source: Preserved Rail
ta: பாதுகாக்கப்பட்ட ரயில்

# type.railway.preserved.bridge
source: Preserved Rail Bridge
ta: பாதுகாக்கப்பட்ட ரயில் பாலம்

# type.railway.preserved.tunnel
source: Preserved Rail Tunnel
ta: பாதுகாக்கப்பட்ட ரயில் சுரங்கப்பாதை

# type.railway.rail
source: Railway
ta: ரயில்வே

# type.railway.rail.highspeed
source: High-Speed Railway
ta: அதிவேக இரயில்வே

# type.railway.rail.tourism
source: Touristic Railway
ta: சுற்றுலா ரயில்வே

# type.railway.rail.main
source: Railway
ta: ரயில்வே

# type.railway.rail.branch
source: Railway Branch
ta: ரயில்வே கிளை

# type.railway.rail.utility
source: Utility Railway
ta: பயன்பாட்டு இரயில்வே

# type.railway.rail.spur
source: Railway Spur
ta: ரயில்வே ச்பர்

# type.railway.rail.service
source: Service Rail Track
ta: பணி ரயில் பாதை

# type.railway.rail.bridge
source: Railway Bridge
ta: ரயில்வே பாலம்

# type.railway.rail.highspeed.bridge
source: Railway Bridge
ta: ரயில்வே பாலம்

# type.railway.rail.tourism.bridge
source: Railway Bridge
ta: ரயில்வே பாலம்

# type.railway.rail.main.bridge
source: Railway Bridge
ta: ரயில்வே பாலம்

# type.railway.rail.branch.bridge
source: Railway Bridge
ta: ரயில்வே பாலம்

# type.railway.rail.utility.bridge
source: Railway Bridge
ta: ரயில்வே பாலம்

# type.railway.rail.spur.bridge
source: Railway Bridge
ta: ரயில்வே பாலம்

# type.railway.rail.service.bridge
source: Railway Bridge
ta: ரயில்வே பாலம்

# type.railway.rail.tunnel
source: Railway Tunnel
ta: ரயில்வே சுரங்கப்பாதை

# type.railway.rail.highspeed.tunnel
source: Railway Tunnel
ta: ரயில்வே சுரங்கப்பாதை

# type.railway.rail.tourism.tunnel
source: Railway Tunnel
ta: ரயில்வே சுரங்கப்பாதை

# type.railway.rail.main.tunnel
source: Railway Tunnel
ta: ரயில்வே சுரங்கப்பாதை

# type.railway.rail.branch.tunnel
source: Railway Tunnel
ta: ரயில்வே சுரங்கப்பாதை

# type.railway.rail.utility.tunnel
source: Railway Tunnel
ta: ரயில்வே சுரங்கப்பாதை

# type.railway.rail.spur.tunnel
source: Railway Tunnel
ta: ரயில்வே சுரங்கப்பாதை

# type.railway.rail.service.tunnel
source: Railway Tunnel
ta: ரயில்வே சுரங்கப்பாதை

# type.railway.station
source: Train Station
ta: ரயில் நிலையம்

# type.railway.station.funicular
source: Funicular
ta: ஃபுனிகுலர்

# type.railway.station.light_rail
source: Light Rail Station
ta: இலகு ரயில் நிலையம்

# type.railway.station.light_rail.berlin
source: S-Bahn Station
ta: எச்-பான் நிலையம்

# type.railway.station.light_rail.london
source: DLR Station
ta: DLR நிலையம்

# type.railway.station.light_rail.porto
source: Porto Metro
ta: போர்டோ மெட்ரோ

# type.railway.station.monorail
source: Monorail Station
ta: மோனோரயில் நிலையம்

# type.railway.station.subway
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.adana
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.algiers
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.almaty
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.amsterdam
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.ankara
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.athens
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.baku
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.bangkok
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.barcelona
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.beijing
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.bengalore
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.berlin
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.bilbao
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.brasilia
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.brescia
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.brussels
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.bucharest
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.budapest
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.buenos_aires
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.bursa
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.cairo
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.caracas
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.catania
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.changchun
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.chengdu
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.chicago
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.chongqing
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.dalian
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.delhi
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.dnepro
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.dubai
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.ekb
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.fukuoka
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.glasgow
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.guangzhou
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.hamburg
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.helsinki
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.hiroshima
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.hongkong
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.isfahan
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.istanbul
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.izmir
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.kazan
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.kharkiv
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.kiev
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.kobe
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.kolkata
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.kunming
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.kyoto
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.la
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.lausanne
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.lille
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.lima
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.lisboa
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.london
source: Underground Station
ta: நிலத்தடி நிலையம்

# type.railway.station.subway.lyon
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.madrid
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.malaga
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.manila
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.maracaibo
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.mashhad
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.mecca
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.medellin
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.mexico
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.milan
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.minsk
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.montreal
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.moscow
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.munchen
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.nagoya
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.newyork
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.nnov
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.novosibirsk
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.osaka
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.oslo
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.palma
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.panama
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.paris
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.philadelphia
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.pyongyang
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.qingdao
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.rennes
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.rio
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.roma
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.rotterdam
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.samara
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.santiago
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.santo_domingo
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.saopaulo
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.sapporo
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.sendai
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.sf
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.shanghai
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.shenzhen
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.shiraz
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.singapore
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.sofia
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.spb
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.stockholm
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.tabriz
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.taipei
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.taoyuan
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.tashkent
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.tbilisi
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.tehran
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.tianjin
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.tokyo
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.valencia
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.vienna
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.warszawa
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.washington
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.wuhan
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.yerevan
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.station.subway.yokohama
source: Subway Station
ta: சுரங்கப்பாதை நிலையம்

# type.railway.subway
source: Subway Line
ta: சுரங்கப்பாதை பாதை

# type.railway.subway.bridge
source: Subway Line Bridge
ta: சுரங்கப்பாதை லைன் பாலம்

# type.railway.subway.tunnel
source: Subway Line Tunnel
ta: சுரங்கப்பாதை வரி சுரங்கப்பாதை

# type.railway.subway_entrance
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.adana
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.algiers
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.almaty
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.amsterdam
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.ankara
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.athens
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.baku
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.bangkok
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.barcelona
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.beijing
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.bengalore
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.berlin
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.bilbao
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.brasilia
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.brescia
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.brussels
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு
