Repository: 247i/TACETr
Catalog: உரை/தானி/comaps-android-typestrings-*.po
Languages: ta

# type.railway.subway_entrance.bucharest
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.budapest
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.buenos_aires
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.bursa
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.cairo
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.caracas
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.catania
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.changchun
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.chengdu
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.chicago
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.chongqing
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.dalian
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.delhi
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.dnepro
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.dubai
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.ekb
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.fukuoka
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.glasgow
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.guangzhou
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.hamburg
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.helsinki
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.hiroshima
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.hongkong
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.isfahan
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.istanbul
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.izmir
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.kazan
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.kharkiv
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.kiev
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.kobe
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.kolkata
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.kunming
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.kyoto
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.la
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.lausanne
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.lille
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.lima
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.lisboa
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.london
source: Metro Station Entrance
ta: மெட்ரோ நிலைய நுழைவாயில்

# type.railway.subway_entrance.lyon
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.madrid
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.malaga
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.manila
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.maracaibo
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.mashhad
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.mecca
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.medellin
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.mexico
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.milan
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.minsk
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.montreal
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.moscow
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.munchen
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.nagoya
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.newyork
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.nnov
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.novosibirsk
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.osaka
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.oslo
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.palma
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.panama
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.paris
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.philadelphia
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.pyongyang
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.rennes
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.rio
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.roma
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.rotterdam
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.samara
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.santiago
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.santo_domingo
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.saopaulo
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.sapporo
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.sendai
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.sf
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.shanghai
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.shenzhen
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.shiraz
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.singapore
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.sofia
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.spb
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.stockholm
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.tabriz
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.taipei
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.taoyuan
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.tashkent
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.tbilisi
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.tehran
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.tianjin
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.tokyo
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.valencia
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.vienna
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.warszawa
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.washington
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.wuhan
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.yerevan
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.subway_entrance.yokohama
source: Subway Entrance
ta: சுரங்கப்பாதை நுழைவு

# type.railway.tram
source: Tram Line
ta: டிராம் லைன்

# type.railway.tram.bridge
source: Tram Line Bridge
ta: டிராம் லைன் பாலம்

# type.railway.tram.tunnel
source: Tram Line Tunnel
ta: டிராம் வரி சுரங்கப்பாதை

# type.railway.tram_stop
source: Tram Stop
ta: டிராம் நிறுத்தம்

# type.route
source: Route
ta: பாதை

# type.route.ferry
source: Ferry
ta: படகு

# type.shop
source: Shop
ta: கடை

# type.shop.alcohol
source: Liquor Shop
ta: மதுபானக் கடை

# type.shop.bakery
source: Bakery
ta: பேக்கரி

# type.shop.bathroom_furnishing
source: Bathroom Furnishings
ta: குளியலறை தளபாடங்கள்

# type.shop.beauty
source: Beauty Shop
ta: அழகு கடை

# type.shop.beauty.nails
source: Nail Salon
ta: ஆணி நிலையம்

# type.shop.beverages
source: Beverages
ta: பானங்கள்

# type.shop.bicycle
source: Bicycle Shop
ta: சைக்கிள் கடை

# type.shop.bookmaker
source: Bookmaker
ta: புத்தகத் தயாரிப்பாளர்

# type.shop.books
source: Bookstore
ta: புத்தகக் கடை

# type.shop.butcher
source: Butcher
ta: கசாப்புக் கடைக்காரர்

# type.shop.cannabis
source: Cannabis Shop
ta: கஞ்சா கடை

# type.shop.car
source: Car Dealership
ta: கார் டீலர்சிப்

# type.shop.car_parts
source: Car Parts Shop
ta: கார் பாகங்கள் கடை

# type.shop.car_repair
source: Car Repair Workshop
ta: கார் பழுதுபார்க்கும் பட்டறை

# type.shop.car_repair.tyres
source: Tyre Repair
ta: டயர் பழுது

# type.shop.caravan
source: RV Dealership
ta: RV டீலர்சிப்

# type.shop.carpet
source: Carpet Shop
ta: கார்பெட் கடை

# type.shop.chemist
source: Chemist
ta: வேதியியலாளர்

# type.shop.chocolate
source: Chocolate Shop
ta: சாக்லேட் கடை

# type.shop.clothes
source: Clothes Shop
ta: துணிக்கடை

# type.shop.coffee
source: Coffee Retailer
ta: காபி சில்லறை விற்பனையாளர்

# type.shop.computer
source: Computer Store
ta: கணினி கடை

# type.shop.confectionery
source: Candy Shop
ta: மிட்டாய் கடை

# type.shop.convenience
source: Convenience Store
ta: கன்வீனியன்ச் கடை

# type.shop.copyshop
source: Copyshop
ta: நகல் கடை

# type.shop.cosmetics
source: Cosmetics Shop
ta: அழகுசாதனப் பொருட்கள் கடை

# type.shop.curtain
source: Curtain Shop
ta: திரைச்சீலை கடை

# type.shop.deli
source: Delicatessen
ta: டெலிகேட்டெசென்

# type.shop.department_store
source: Department Store
ta: பல்பொருள் அங்காடி

# type.shop.doityourself
source: Home Improvement Store
ta: வீட்டு மேம்பாட்டு அங்காடி

# type.shop.dry_cleaning
source: Dry Cleaner
ta: உலர் துப்புரவாளர்

# type.shop.electronics
source: Electronics Shop
ta: எலக்ட்ரானிக்ச் கடை

# type.shop.erotic
source: Erotic Shop
ta: சிற்றின்ப கடை

# type.shop.fabric
source: Fabric Shop
ta: துணிக்கடை

# type.shop.farm
source: Farm Food Shop
ta: பண்ணை உணவு கடை

# type.shop.fashion_accessories
source: Fashion Accessories
ta: ஃபேசன் பாகங்கள்

# type.shop.florist
source: Florist
ta: பூக்கடை

# type.shop.funeral_directors
source: Funeral Directors
ta: இறுதிச் சடங்கு இயக்குநர்கள்

# type.shop.furniture
source: Furniture Store
ta: மரச்சாமான்கள் கடை

# type.shop.garden_centre
source: Garden Center
ta: தோட்ட நடுவண்

# type.shop.gas
source: Gas Store
ta: எரிவாயு கடை

# type.shop.gift
source: Gift Shop
ta: பரிசு கடை

# type.shop.greengrocer
source: Greengrocer
ta: கீரை வணிகர்

# type.shop.grocery
source: Grocery Store
ta: மளிகை கடை

# type.shop.hairdresser
source: Hairdresser
ta: சிகையலங்கார வல்லுநர்

# type.shop.hardware
source: Hardware Store
ta: வன்பொருள் கடை

# type.shop.health_food
source: Health Food Shop
ta: ஆரோக்கிய உணவு கடை

# type.shop.hearing_aids
source: Hearing Aid Store
ta: கேட்டல் எய்ட் கடை

# type.shop.herbalist
source: Herbalist
ta: மூலிகை மருத்துவர்

# type.shop.hifi
source: HiFi Audio Shop
ta: HiFi ஆடியோ கடை

# type.shop.houseware
source: Housewares Store
ta: வீட்டுப் பொருட்கள் கடை

# type.shop.jewelry
source: Jewelry Store
ta: நகைக் கடை

# type.shop.kiosk
source: Kiosk
ta: கியோச்க்

# type.shop.kitchen
source: Kitchen Store
ta: சமையலறை கடை

# type.shop.laundry
source: Laundry
ta: சலவை

# type.shop.mall
source: Mall
ta: வணிக வளாகம்

# type.shop.beauty.day_spa
source: Day Spa
ta: டே ச்பா

# type.shop.massage
source: Massage Salon
ta: மசாச் நிலையம்

# type.shop.mobile_phone
source: Mobile Phone Store
ta: மொபைல் போன் கடை

# type.shop.money_lender
source: Money Lender
ta: பணம் கடன் கொடுப்பவர்

# type.shop.motorcycle
source: Motorcycle Shop
ta: மின்னோடி சைக்கிள் கடை

# type.shop.motorcycle_repair
source: Motorcycle Repair
ta: மின்னோடி சைக்கிள் பழுது

# type.shop.music
source: Record Store
ta: பதிவு அங்காடி

# type.shop.musical_instrument
source: Musical Instrument Shop
ta: இசைக்கருவி கடை

# type.shop.newsagent
source: Newspaper Stand
ta: செய்தித்தாள் நிலைப்பாடு

# type.shop.optician
source: Optician
ta: ஒளியியல் வல்லுநர்

# type.shop.outdoor
source: Outdoor Equipment Shop
ta: வெளிப்புற உபகரணங்கள் கடை

# type.shop.outpost
source: Pickup Point
ta: பிக்கப் பாயிண்ட்

# type.shop.pasta
source: Pasta Shop
ta: பாச்தா கடை

# type.shop.pastry
source: Pastry Shop
ta: பேச்ட்ரி கடை

# type.shop.pawnbroker
source: Pawnbroker
ta: அடகு வணிகர்

# type.shop.pet
source: Pet Store
ta: செல்லப்பிராணி கடை

# type.shop.pet_grooming
source: Pet Grooming
ta: செல்லப்பிராணி சீர்ப்படுத்தும்

# type.shop.photo
source: Photo Shop
ta: போட்டோசாப்

# type.shop.rental
source: Rental Shop
ta: வாடகை கடை

# type.shop.rental.bicycle
source: Bicycle Rental Shop
ta: சைக்கிள் வாடகை கடை

# type.shop.seafood
source: Fishmonger
ta: மீன் வணிகர்

# type.shop.second_hand
source: Second Hand Shop
ta: இரண்டாவது கை கடை

# type.shop.shoes
source: Shoe Shop
ta: காலணி கடை

# type.shop.sports
source: Sports Shop
ta: விளையாட்டு கடை

# type.shop.stationery
source: Stationery Shop
ta: ச்டேசனரி கடை

# type.shop.supermarket
source: Supermarket
ta: பல்பொருள் அங்காடி

# type.shop.tattoo
source: Tattoo Parlour
ta: டாட்டூ பார்லர்

# type.shop.tea
source: Tea Shop
ta: தேநீர் கடை

# type.shop.telecommunication
source: Telecommunication Shop
ta: தொலைத்தொடர்பு கடை

# type.shop.ticket
source: Ticket Shop
ta: டிக்கெட் கடை

# type.shop.toys
source: Toy Store
ta: பொம்மை கடை

# type.shop.travel_agency
source: Travel Agency
ta: பயண நிறுவனம்

# type.shop.tyres
source: Tyre Shop
ta: டயர் கடை

# type.shop.variety_store
source: Variety Store
ta: வெரைட்டி கடை

# type.shop.video
source: Video Shop
ta: வீடியோ கடை

# type.shop.video_games
source: Video Game Shop
ta: வீடியோ கேம் கடை

# type.shop.wine
source: Wine Shop
ta: ஒயின் சாப்

# type.shop.agrarian
source: Agricultural Shop
ta: விவசாயக் கடை

# type.shop.antiques
source: Antiques Shop
ta: பழங்கால பொருட்கள் கடை

# type.shop.appliance
source: Appliance Shop
ta: உபகரணங்கள் கடை

# type.shop.art
source: Artwork Shop
ta: கலைப்படைப்பு கடை

# type.shop.baby_goods
source: Baby Goods Shop
ta: குழந்தை பொருட்கள் கடை

# type.shop.bag
source: Bag Shop
ta: பை கடை

# type.shop.bed
source: Bed Shop
ta: படுக்கைக்கடை

# type.shop.boutique
source: Boutique
ta: பூட்டிக்

# type.shop.charity
source: Charity Shop
ta: தொண்டு கடை

# type.shop.cheese
source: Cheese Shop
ta: சீச் கடை

# type.shop.craft
source: Craft Supplies Store
ta: கைவினை பொருட்கள் கடை

# type.shop.dairy
source: Dairy Shop
ta: பால் கடை

# type.shop.electrical
source: Electrical Supplies Store
ta: மின்சார பொருட்கள் கடை

# type.shop.fishing
source: Fishing Store
ta: மீன்பிடி கடை

# type.shop.interior_decoration
source: Interior Decorations Store
ta: உள்துறை அலங்காரங்கள் கடை

# type.shop.lottery
source: Lottery Tickets
ta: லாட்டரி சீட்டுகள்

# type.shop.medical_supply
source: Medical Supplies Store
ta: மருத்துவப் பொருட்கள் கடை

# type.shop.nutrition_supplements
source: Nutrition Supplement Store
ta: ஊட்டச்சத்து சப்ளிமெண்ட் கடை

# type.shop.paint
source: Paint Shop
ta: பெயிண்ட் கடை

# type.shop.perfumery
source: Perfume Shop
ta: வாசனை திரவிய கடை

# type.shop.sewing
source: Sewing Supplies Shop
ta: தையல் பொருட்கள் கடை

# type.shop.storage_rental
source: Storage Rental
ta: சேமிப்பக வாடகை

# type.shop.tobacco
source: Smoke Shop
ta: புகை கடை

# type.shop.trade
source: Trade Supplies
ta: வர்த்தக பொருட்கள்

# type.shop.watches
source: Watch Store
ta: வாட்ச் கடை

# type.shop.wholesale
source: Wholesale Store
ta: மொத்த விற்பனை கடை

# type.shop.lighting
source: Lighting Shop
ta: விளக்கு கடை

# type.disusedbusiness
source: Vacant Business
ta: வெறுமை வணிகம்

# type.sport
source: Sport
ta: விளையாட்டு

# type.sport.multi
source: Various Sports
ta: பல்வேறு விளையாட்டு

# type.sport.9pin
source: Bowling
ta: பந்துவீச்சு

# type.sport.10pin
source: Bowling
ta: பந்துவீச்சு

# type.sport.american_football
source: American Football
ta: அமெரிக்க கால்பந்து

# type.sport.archery
source: Archery
ta: வில்வித்தை

# type.sport.athletics
source: Athletics
ta: தடகள

# type.sport.australian_football
source: Australian Football
ta: ஆச்திரேலிய கால்பந்து

# type.sport.badminton
source: Badminton
ta: பூப்பந்து

# type.sport.baseball
source: Baseball
ta: பேச்பால்

# type.sport.basketball
source: Basketball
ta: கூடைப்பந்து

# type.sport.beachvolleyball
source: Beach Volleyball
ta: கடற்கரை கைப்பந்து

# type.sport.bowls
source: Bowls
ta: கிண்ணங்கள்

# type.sport.chess
source: Chess
ta: சதுரங்கம்

# type.sport.climbing
source: Climbing
ta: ஏறுதல்

# type.sport.cricket
source: Cricket
ta: கிரிக்கெட்

# type.sport.curling
source: Curling
ta: கர்லிங்

# type.sport.diving
source: High Diving
ta: உயர் டைவிங்

# type.sport.equestrian
source: Equestrian Sports
ta: குதிரையேற்ற விளையாட்டு

# type.sport.field_hockey
source: Field Hockey
ta: ஃபீல்டு ஆக்கி

# type.sport.futsal
source: Futsal
ta: ஃபுட்சல்

# type.sport.golf
source: Golf
ta: கோல்ஃப்

# type.sport.gymnastics
source: Gymnastics
ta: சிம்னாச்டிக்ச்

# type.sport.handball
source: Handball
ta: கைப்பந்து

# type.sport.ice_hockey
source: Ice Hockey
ta: ஐச் ஆக்கி

# type.sport.padel
source: Padel
ta: விழுந்தது

# type.sport.pelota
source: Basque Pelota
ta: பாச்க் பந்து

# type.sport.scuba_diving
source: Scuba Diving
ta: ச்கூபா டைவிங்

# type.sport.shooting
source: Shooting
ta: படப்பிடிப்பு

# type.sport.skateboard
source: Skateboarding
ta: ச்கேட்போர்டிங்

# type.sport.skiing
source: Skiing
ta: பனிச்சறுக்கு

# type.sport.soccer
source: Soccer
ta: கால்பந்து

# type.sport.swimming
source: Swimming
ta: நீச்சல்

# type.sport.table_tennis
source: Table Tennis
ta: டேபிள் டென்னிச்

# type.sport.tennis
source: Tennis Court
ta: டென்னிச் கோர்ட்

# type.sport.volleyball
source: Volleyball
ta: கைப்பந்து

# type.sport.yoga
source: Yoga
ta: யோகா

# type.tourism
source: Tourism
ta: சுற்றுலா

# type.tourism.aquarium
source: Aquarium
ta: மீன்வளம்

# type.tourism.alpine_hut
source: Mountain Lodge
ta: மவுண்டன் லாட்ச்

# type.tourism.apartment
source: Holiday Apartment
ta: விடுமுறை அபார்ட்மெண்ட்

# type.tourism.artwork
source: Artwork
ta: ஒளிமறைப்பு

# type.tourism.artwork.architecture
source: Architectural Artwork
ta: கட்டிடக்கலை கலைப்படைப்பு

# type.tourism.artwork.painting
source: Painting
ta: ஓவியம்

# type.tourism.artwork.sculpture
source: Sculpture
ta: சிற்பம்

# type.tourism.artwork.statue
source: Statue
ta: சிலை

# type.tourism.attraction
source: Attraction
ta: ஈர்ப்பு

# type.attraction.amusement_ride
source: Amusement Ride
ta: பொழுதுபோக்கு சவாரி

# type.attraction.animal
source: Animal Enclosure
ta: விலங்கு அடைப்பு

# type.attraction.bumper_car
source: Bumper Car
ta: பம்பர் கார்

# type.attraction.big_wheel
source: Big Wheel
ta: பெரிய சக்கரம்

# type.attraction.carousel
source: Carousel
ta: கொணர்வி

# type.attraction.historic
source: Historic attraction
ta: வரலாற்று ஈர்ப்பு

# type.attraction.maze
source: Maze
ta: பிரமை

# type.attraction.roller_coaster
source: Roller Coaster
ta: ரோலர் கோச்டர்

# type.attraction.water_slide
source: Water Slide
ta: நீர் ச்லைடு

# type.tourism.attraction.specified
source: Attraction
ta: ஈர்ப்பு

# type.tourism.camp_site
source: Campground
ta: முகாம்

# type.tourism.caravan_site
source: RV Park
ta: RV பூங்கா

# type.tourism.chalet
source: Holiday Cottage
ta: விடுமுறை குடிசை

# type.tourism.gallery
source: Art Gallery
ta: கலைக்கூடம்

# type.tourism.guest_house
source: Guest House
ta: விருந்தினர் மாளிகை

# type.tourism.hostel
source: Hostel
ta: விடுதி

# type.tourism.hotel
source: Hotel
ta: ஓட்டல்

# type.tourism.information
source: Tourist Information
ta: சுற்றுலா செய்தி

# type.tourism.information.board
source: Information Board
ta: செய்தி பலகை

# type.tourism.information.guidepost
source: Guidepost
ta: வழிகாட்டி

# type.tourism.information.map
source: Tourist Map
ta: சுற்றுலா வரைபடம்

# type.tourism.information.office
source: Tourist Office
ta: சுற்றுலா அலுவலகம்

# type.tourism.information.visitor_centre
source: Visitor Centre
ta: பார்வையாளர் நடுவண்

# type.amenity.ranger_station
source: Ranger Station
ta: ரேஞ்சர் நிலையம்

# type.tourism.motel
source: Motel
ta: மோட்டல்

# type.tourism.museum
source: Museum
ta: அருங்காட்சியகம்

# type.tourism.picnic_site
source: Picnic Site
ta: சுற்றுலா தளம்

# type.leisure.resort
source: Resort
ta: ரிசார்ட்

# type.tourism.theme_park
source: Theme Park
ta: கருப்பொருள் பார்க்

# type.tourism.viewpoint
source: Viewpoint
ta: கண்ணோட்டம்

# type.tourism.wilderness_hut
source: Wilderness Hut
ta: வனப்பகுதி குடிசை

# type.tourism.zoo
source: Zoo
ta: உயிரியல் பூங்கா

# type.tourism.zoo.petting
source: Petting Zoo
ta: செல்லப்பிராணி பூங்கா

# type.traffic_calming
source: Traffic Calming
ta: போக்குவரத்தை அமைதிப்படுத்துதல்

# type.traffic_calming.bump
source: Traffic Bump
ta: போக்குவரத்து நெரிசல்

# type.traffic_calming.hump
source: Traffic Hump
ta: ட்ராஃபிக் அம்ப்

# type.waterway
source: Waterway
ta: நீர்வழி

# type.waterway.canal
source: Canal
ta: கால்வாய்

# type.waterway.canal.tunnel
source: Canal Tunnel
ta: கால்வாய் சுரங்கப்பாதை

# type.waterway.fish_pass
source: Fish Pass
ta: மீன் பாச்

# type.waterway.dam
source: Dam
ta: அணை

# type.barrier.ditch
source: Ditch
ta: பள்ளம்

# type.natural.water.ditch
source: Drainage Ditch
ta: வடிகால் பள்ளம்

# type.waterway.ditch.tunnel
source: Culvert
ta: கால்வாய்

# type.waterway.dock
source: Waterway Dock
ta: நீர்வழி கப்பல்துறை

# type.waterway.drain
source: Drain
ta: வாய்க்கால்

# type.natural.water.drain
source: Drain
ta: வாய்க்கால்

# type.waterway.drain.tunnel
source: Culvert
ta: கால்வாய்

# type.waterway.lock_gate
source: Lock Gate
ta: பூட்டு கேட்

# type.waterway.river
source: River
ta: நதி

# type.waterway.river.tunnel
source: River
ta: நதி

# type.waterway.stream
source: Stream
ta: ச்ட்ரீம்

# type.waterway.stream.ephemeral
source: Ephemeral Stream
ta: எபிமரல் ச்ட்ரீம்

# type.waterway.stream.intermittent
source: Intermittent Stream
ta: இடைப்பட்ட நீரோடை

# type.waterway.stream.tunnel
source: Stream
ta: ச்ட்ரீம்

# type.waterway.waterfall
source: Waterfall
ta: அருவி

# type.waterway.weir
source: Weir
ta: வீர்

# type.wheelchair
source: Wheelchair
ta: சக்கர நாற்காலி

# type.wheelchair.limited
source: Limited Wheelchair Access
ta: வரையறுக்கப்பட்ட சக்கர நாற்காலி அணுகல்

# type.wheelchair.no
source: No Wheelchair Access
ta: இல்லை Wheelchair Access

# type.wheelchair.yes
source: Full Wheelchair Access
ta: முழு சக்கர நாற்காலி அணுகல்

# type.aerialway.j.bar
source: J-bar Lift
ta: சே-பார் லிஃப்ட்

# type.aerialway.magic_carpet
source: Magic Carpet
ta: மேசிக் கார்பெட்

# type.aerialway.platter
source: Platter Lift
ta: தட்டு லிஃப்ட்

# type.aerialway.rope_tow
source: Rope Tow
ta: கயிறு இழுத்தல்

# type.aerialway.t.bar
source: T-bar Lift
ta: டி-பார் லிஃப்ட்

# type.piste_type.downhill
source: Downhill Ski Run
ta: டவுன்இல் ச்கை ரன்

# type.piste_type.downhill.area
source: Downhill Ski Run
ta: டவுன்இல் ச்கை ரன்
