Repository: 247i/TACETr
Catalog: உரை/தானி/comaps-android-typestrings-*.po
Languages: ta

# type.addr_interpolation
source: Address/Block
ta: முகவரி/சாலைத் தொகுதி

# type.addr_interpolation.even
source: Address/Block
ta: முகவரி/சாலைத் தொகுதி

# type.addr_interpolation.odd
source: Address/Block
ta: முகவரி/சாலைத் தொகுதி

# type.aerialway
source: Aerialway
ta: கம்பிப் போக்குவரத்து

# type.aerialway.cable_car
source: Cable Car
ta: கேபிள் கார்

# type.aerialway.chair_lift
source: Chair Lift
ta: நாற்காலி லிஃப்ட்

# type.aerialway.drag_lift
source: Drag Lift
ta: லிஃப்டை இழுக்கவும்

# type.aerialway.gondola
source: Gondola
ta: கோண்டோலா

# type.aerialway.mixed_lift
source: Mixed Lift
ta: கலப்பு லிஃப்ட்

# type.aerialway.station
source: Aerialway Station
ta: வான்வழி நிலையம்

# type.aeroway
source: Airspace Infrastructure
ta: வான்வெளி உள்கட்டமைப்பு

# type.aeroway.aerodrome
source: Airport
ta: விமான நிலையம்

# type.aeroway.aerodrome.international
source: International Airport
ta: பன்னாட்டு விமான நிலையம்

# type.aeroway.apron
source: Apron
ta: ஏற்றிடம்

# type.aeroway.gate
source: Gate
ta: கேட்

# type.aeroway.helipad
source: Helipad
ta: எலிபேட்

# type.aeroway.runway
source: Runway
ta: ஓடுபாதை

# type.aeroway.taxiway
source: Taxiway
ta: நடையோடுபாதை

# type.aeroway.terminal
source: Terminal
ta: முனையத்தில்

# type.amenity
source: Amenity
ta: வசதி

# type.amenity.arts_centre
source: Arts Center
ta: கலை நடுவண்

# type.amenity.atm
source: ATM
ta: ஏடிஎம்

# type.amenity.bank
source: Bank
ta: வைப்பகம்

# type.amenity.bar
source: Bar
ta: மதுக்கூடம்

# type.amenity.bbq
source: Barbecue Grill
ta: பார்பிக்யூ கிரில்

# type.amenity.bench
source: Bench
ta: பென்ச்

# type.amenity.bench.backless
source: Backless Bench
ta: முதுகெலும்பில்லாத பெஞ்ச்

# type.amenity.bicycle_parking
source: Bicycle Parking
ta: சைக்கிள் நிறுத்தம்

# type.amenity.bicycle_parking.covered
source: Covered Bicycle Parking
ta: மூடப்பட்ட சைக்கிள் பார்க்கிங்

# type.amenity.boat_rental
source: Boat Rental
ta: படகு வாடகை

# type.amenity.bicycle_rental
source: Bicycle Rental
ta: சைக்கிள் வாடகை

# type.amenity.bicycle_repair_station
source: Bicycle Repair Station
ta: சைக்கிள் பழுதுபார்க்கும் நிலையம்

# type.amenity.biergarten
source: Biergarten
ta: பீர் தோட்டம்

# type.amenity.brothel
source: Brothel
ta: விபச்சார விடுதி

# type.amenity.love_hotel
source: Love Hotel
ta: காதல் ஓட்டல்

# type.amenity.bureau_de_change
source: Currency Exchange
ta: பணமாற்றம், நாணயமாற்றம்

# type.amenity.bus_station
source: Bus Station
ta: பேருந்து நிலையம்

# type.amenity.cafe
source: Cafe
ta: கஃபே

# type.amenity.car_rental
source: Car Rental
ta: கார் வாடகை

# type.amenity.motorcycle_rental
source: Motorcycle Rental
ta: மின்னோடி சைக்கிள் வாடகை

# type.amenity.car_sharing
source: Car Sharing
ta: கார் பகிர்வு

# type.amenity.car_wash
source: Car Wash
ta: கார் கழுவும்

# type.man_made.telescope
source: Telescope
ta: தொலைநோக்கி

# type.man_made.telescope.optical
source: Telescope (Optical)
ta: தொலைநோக்கி (ஆப்டிகல்)

# type.man_made.telescope.radio
source: Telescope (Radio)
ta: தொலைநோக்கி (வானொலி)

# type.man_made.telescope.gamma
source: Telescope (Gamma)
ta: தொலைநோக்கி (காமா)

# type.man_made.observatory
source: Observatory
ta: கண்காணிப்பகம்

# type.amenity.casino
source: Casino
ta: கேசினோ

# type.amenity.gambling
source: Gambling
ta: சூதாட்டம்

# type.leisure.adult_gaming_centre
source: Adult Gaming Centre
ta: அகவை வந்தோர் கேமிங் நடுவண்

# type.leisure.amusement_arcade
source: Arcade
ta: ஆர்கேட்

# type.amenity.charging_station
source: Charging Station
ta: சார்சிங் ச்டேசன்

# type.amenity.charging_station.bicycle
source: Bicycle Charging Station
ta: சைக்கிள் சார்சிங் நிலையம்

# type.amenity.charging_station.motorcar
source: Car Charging Station
ta: கார் சார்சிங் நிலையம்

# type.amenity.charging_station.motorcar.small
source: Car Charging Point
ta: கார் சார்சிங் பாயிண்ட்

# type.amenity.childcare
source: Nursery
ta: நாற்றங்கால்

# type.amenity.cinema
source: Cinema
ta: சினிமா

# type.amenity.studio
source: Media Studio
ta: மீடியா ச்டுடியோ

# type.leisure.bowling_alley
source: Bowling Alley
ta: பந்துவீச்சு சந்து

# type.amenity.clinic
source: Clinic
ta: கிளினிக்

# type.amenity.college
source: College
ta: கல்லூரி

# type.amenity.community_centre
source: Community Centre
ta: சமூக நடுவண்

# type.amenity.compressed_air
source: Compressed Air
ta: அழுத்தப்பட்ட காற்று

# type.amenity.conference_centre
source: Conference Center
ta: மாநாட்டு நடுவண்

# type.amenity.courthouse
source: Courthouse
ta: நீதிமன்ற வளாகம்

# type.amenity.dentist
source: Dentist
ta: பல் மருத்துவர்

# type.amenity.doctors
source: Doctor
ta: டாக்டர்

# type.amenity.drinking_water
source: Drinking Water
ta: குடிநீர்

# type.drinking_water.yes
source: Drinking Water
ta: குடிநீர்

# type.amenity.driving_school
source: Driving School
ta: ஓட்டுநர் பள்ளி

# type.amenity.exhibition_centre
source: Exhibition Center
ta: கண்காட்சி நடுவண்

# type.amenity.money_transfer
source: Money Transfer
ta: பணமாற்றல்

# type.amenity.music_school
source: Music School
ta: இசை பள்ளிக்கூடம்

# type.amenity.sailing_school
source: Sailing School
ta: படகோட்டம் பள்ளி

# type.amenity.flight_school
source: Flight School
ta: விமானப் பள்ளி

# type.amenity.prep_school
source: Tutorial School
ta: பயிற்சி பள்ளி

# type.amenity.language_school
source: Language School
ta: மொழி பள்ளிக்கூடம்

# type.office.diplomatic
source: Embassy
ta: தூதரகம்

# type.office.security
source: Security Guards Office
ta: பாதுகாப்பு காவலர்கள் அலுவலகம்

# type.building.guardhouse
source: Security Booth
ta: பாதுகாப்பு சாவடி

# type.power.portal
source: Power Portal
ta: பவர் போர்டல்

# type.amenity.fast_food
source: Fast Food
ta: துரித உணவு

# type.amenity.ferry_terminal
source: Ferry
ta: படகு

# type.amenity.fire_station
source: Fire Station
ta: தீயணைப்பு நிலையம்

# type.amenity.food_court
source: Food Court
ta: உணவு அறமன்றம்

# type.amenity.fountain
source: Fountain
ta: நீரூற்று

# type.amenity.fuel
source: Gas Station
ta: எரிவாயு நிலையம்

# type.amenity.grave_yard
source: Graveyard
ta: கல்லறை

# type.amenity.grave_yard.christian
source: Christian Graveyard
ta: கிறிச்டியன் கல்லறை

# type.amenity.hospital
source: Hospital
ta: மருத்துவமனை

# type.amenity.hunting_stand
source: Hunting Stand
ta: வேட்டை ச்டாண்ட்

# type.amenity.ice_cream
source: Ice Cream
ta: ஐச்கிரீம்

# type.amenity.internet_cafe
source: Internet Cafe
ta: இன்டர்நெட் கஃபே

# type.amenity.kindergarten
source: Kindergarten
ta: மழலையர் பள்ளி

# type.amenity.library
source: Library
ta: நூலகம்

# type.amenity.loading_dock
source: Loading Dock
ta: ஏற்றுதல் கப்பல்துறை

# type.amenity.lounger
source: Lounger
ta: லவுஞ்சர்

# type.amenity.luggage_locker
source: Luggage Locker
ta: லக்கேச் லாக்கர்

# type.amenity.mobile_money_agent
source: Mobile Money Agent
ta: மொபைல் பண முகவர்

# type.amenity.marketplace
source: Marketplace
ta: சந்தை

# type.amenity.motorcycle_parking
source: Motorcycle Parking
ta: மின்னோடி சைக்கிள் பார்க்கிங்

# type.amenity.nightclub
source: Nightclub
ta: இரவு விடுதி

# type.amenity.nursing_home
source: Nursing Home
ta: முதியோர் இல்லம்

# type.amenity.parking
source: Parking
ta: பார்க்கிங்

# type.amenity.parking.fee
source: Parking
ta: பார்க்கிங்

# type.amenity.parking.multi.storey
source: Multi Storey Parking
ta: பல மாடி பார்க்கிங்

# type.amenity.parking.multi.storey.fee
source: Multi Storey Parking
ta: பல மாடி பார்க்கிங்

# type.amenity.parking.no.access
source: Private Parking
ta: தனியார் பார்க்கிங்

# type.amenity.parking.permissive
source: Private Parking
ta: தனியார் பார்க்கிங்

# type.amenity.parking.private
source: Private Parking
ta: தனியார் பார்க்கிங்

# type.amenity.parking.park_and_ride
source: Park And Ride Parking
ta: பூங்கா மற்றும் சவாரி பார்க்கிங்

# type.amenity.parking.underground
source: Underground Parking
ta: நிலத்தடி பார்க்கிங்

# type.amenity.parking.underground.fee
source: Underground Parking
ta: நிலத்தடி பார்க்கிங்

# type.amenity.parking.underground.private
source: Private Underground Parking
ta: தனியார் நிலத்தடி பார்க்கிங்

# type.amenity.parking.street_side
source: Street-Side Parking
ta: தெரு ஓர பார்க்கிங்

# type.amenity.parking.street_side.fee
source: Street-Side Parking
ta: தெரு ஓர பார்க்கிங்

# type.amenity.parking.street_side.private
source: Private Street-Side Parking
ta: தனியார் தெரு பக்க பார்க்கிங்

# type.amenity.parking.lane
source: Lane Parking
ta: லேன் பார்க்கிங்

# type.amenity.parking.lane.fee
source: Lane Parking
ta: லேன் பார்க்கிங்

# type.amenity.parking.lane.private
source: Private Lane Parking
ta: தனியார் லேன் பார்க்கிங்

# type.amenity.parking_entrance
source: Parking Entrance
ta: பார்க்கிங் நுழைவாயில்

# type.amenity.parking_entrance.private
source: Private Parking Entrance
ta: தனியார் பார்க்கிங் நுழைவாயில்

# type.amenity.parking_entrance.permissive
source: Parking Entrance
ta: பார்க்கிங் நுழைவாயில்

# type.amenity.parking_space
source: Parking Space
ta: பார்க்கிங் இடம்

# type.amenity.parking_space.permissive
source: Parking Space
ta: பார்க்கிங் இடம்

# type.amenity.parking_space.private
source: Parking Space
ta: பார்க்கிங் இடம்

# type.amenity.parking_space.underground
source: Parking Space
ta: பார்க்கிங் இடம்

# type.amenity.parking_space.disabled
source: Disabled Parking Space
ta: முடக்கப்பட்ட பார்க்கிங் இடம்

# type.amenity.car_pooling
source: Car Pooling
ta: கார் பூலிங்

# type.amenity.payment_centre
source: Payment Centre
ta: கட்டண நடுவண்

# type.amenity.payment_terminal
source: Payment Terminal
ta: கட்டண முனையம்

# type.amenity.pharmacy
source: Pharmacy
ta: மருந்தகம்

# type.amenity.place_of_worship
source: Place of Worship
ta: வழிபாட்டு இடம்

# type.amenity.place_of_worship.buddhist
source: Buddhist Temple
ta: புத்த கோவில்

# type.amenity.place_of_worship.christian
source: Church
ta: தேவாலயம்

# type.amenity.place_of_worship.christian.mormon
source: Church of Jesus Christ of Latter Day Saints
ta: பிந்தைய நாள் புனிதர்களின் இயேசு கிறிச்துவின் தேவாலயம்

# type.amenity.place_of_worship.christian.jehovahs_witness
source: Jehovah's Witnesses Kingdom Hall
ta: யெகோவாவின் சாட்சிகள் மாநிலங்கள் மன்றம்

# type.amenity.place_of_worship.hindu
source: Hindu Temple
ta: இந்து கோவில்

# type.amenity.place_of_worship.jewish
source: Synagogue
ta: செப ஆலயம்

# type.amenity.place_of_worship.muslim
source: Mosque
ta: மசூதி

# type.amenity.place_of_worship.shinto
source: Shinto Shrine
ta: சின்டோ ஆலயம்

# type.amenity.place_of_worship.taoist
source: Taoist Temple
ta: தாவோயிச்ட் கோயில்

# type.amenity.police
source: Police
ta: காவல்

# type.amenity.post_box
source: Mailbox
ta: அஞ்சல் பெட்டி

# type.amenity.post_office
source: Post Office
ta: தபால் அலுவலகம்

# type.post_office.post_partner
source: Post Partner
ta: போச்ட் பார்ட்னர்

# type.amenity.prison
source: Prison
ta: சிறை

# type.amenity.pub
source: Pub
ta: பப்

# type.amenity.public_bookcase
source: Book Exchange
ta: புத்தக பரிமாற்றம்

# type.amenity.recycling.centre
source: Recycling Center
ta: மறுசுழற்சி நடுவண்

# type.amenity.recycling
source: Recycling Container
ta: மறுசுழற்சி கொள்கலன்

# type.amenity.recycling.container
source: Recycling Container
ta: மறுசுழற்சி கொள்கலன்

# type.recycling.batteries
source: Batteries
ta: பேட்டரிகள்

# type.recycling.clothes
source: Clothes
ta: ஆடைகள்

# type.recycling.glass_bottles
source: Glass Bottles
ta: கண்ணாடி பாட்டில்கள்

# type.recycling.paper
source: Paper
ta: காகிதம்

# type.recycling.plastic
source: Plastic
ta: நெகிழி

# type.recycling.plastic_bottles
source: Plastic Bottles
ta: பிளாச்டிக் பாட்டில்கள்

# type.recycling.scrap_metal
source: Scrap Metal
ta: ச்கிராப் மெட்டல்

# type.recycling.small_appliances
source: Electronic Waste
ta: மின்னணு கழிவுகள்

# type.recycling.cardboard
source: Cardboard
ta: அட்டை

# type.recycling.cans
source: Cans
ta: கேன்கள்

# type.recycling.shoes
source: Shoes
ta: காலணிகள்

# type.recycling.green_waste
source: Green/Organic Waste
ta: பச்சை/ஆர்கானிக் கழிவுகள்

# type.recycling.cartons
source: Cartons
ta: அட்டைப்பெட்டிகள்

# type.amenity.restaurant
source: Restaurant
ta: உணவகம்

# type.amenity.sanitary_dump_station
source: Holding Tank Dump Station
ta: ஓல்டிங் டேங்க் டம்ப் ச்டேசன்

# type.amenity.school
source: School
ta: பள்ளி

# type.amenity.shelter
source: Shelter
ta: தங்குமிடம்

# type.amenity.shelter.public_transport
source: Shelter
ta: தங்குமிடம்

# type.amenity.shelter.basic_hut
source: Bivouac Hut
ta: Bivouac குடிசை

# type.amenity.shelter.lean_to
source: Lean-to Shelter
ta: தங்குமிடம்

# type.amenity.public_bath
source: Public Bath
ta: பொது குளியல்

# type.amenity.shower
source: Shower
ta: மழை

# type.amenity.stripclub
source: Stripclub
ta: உரி கிளப்

# type.amenity.taxi
source: Taxi Stand
ta: டாக்சி ச்டாண்ட்

# type.amenity.telephone
source: Phone
ta: தொலைபேசி

# type.amenity.theatre
source: Theatre
ta: தியேட்டர்

# type.amenity.toilets
source: Toilet
ta: கழிப்பறை

# type.toilets.yes
source: Toilet
ta: கழிப்பறை

# type.amenity.townhall
source: Town Hall
ta: பேரூர் ஆல்

# type.amenity.university
source: University
ta: பல்கலைக்கழகம்

# type.amenity.vending_machine
source: Vending Machine
ta: விற்பனை இயந்திரம்

# type.amenity.vending_machine.cigarettes
source: Cigarette Dispenser
ta: சிகரெட் டிச்பென்சர்

# type.amenity.vending_machine.coffee
source: Coffee Dispenser
ta: காபி டிச்பென்சர்

# type.amenity.vending_machine.condoms
source: Condoms Dispenser
ta: ஆணுறை வழங்கல்

# type.amenity.vending_machine.drinks
source: Drinks Dispenser
ta: டிரிங்க்ச் டிச்பென்சர்

# type.amenity.vending_machine.food
source: Food Dispenser
ta: உணவு வழங்குபவர்

# type.amenity.vending_machine.newspapers
source: Newspaper Dispenser
ta: செய்தித்தாள் விநியோகிப்பான்

# type.amenity.vending_machine.parking_tickets
source: Parking Meter
ta: பார்க்கிங் மீட்டர்

# type.amenity.vending_machine.public_transport_tickets
source: Ticket Machine
ta: டிக்கெட் இயந்திரம்

# type.amenity.vending_machine.sweets
source: Sweets Dispenser
ta: இனிப்புகள் விநியோகிப்பான்

# type.amenity.vending_machine.excrement_bags
source: Excrement Bags Dispenser
ta: மலம் கழிக்கும் பைகள் வழங்கும் கருவி

# type.amenity.parcel_locker
source: Parcel Locker
ta: பார்சல் லாக்கர்

# type.amenity.vehicle_inspection
source: Vehicle Inspection
ta: வாகன சோதனை

# type.amenity.vending_machine.fuel
source: Fuel Pump
ta: எரிபொருள் பம்ப்

# type.amenity.veterinary
source: Veterinary Doctor
ta: கால்நடை மருத்துவர்

# type.amenity.animal_shelter
source: Animal Shelter
ta: விலங்கு தங்குமிடம்

# type.amenity.waste_basket
source: Trash Bin
ta: குப்பைத் தொட்டி

# type.amenity.waste_disposal
source: Dumpster
ta: குப்பைத்தொட்டி

# type.amenity.waste_transfer_station
source: Waste Transfer Station
ta: கழிவு பரிமாற்ற நிலையம்

# type.amenity.water_point
source: Water Tank Refill Point
ta: தண்ணீர் தொட்டி ரீஃபில் பாயிண்ட்

# type.amenity.water_point.drinking_water_no
source: Water Tank Refill Point
ta: தண்ணீர் தொட்டி ரீஃபில் பாயிண்ட்

# type.barrier
source: Barrier
ta: தடை

# type.barrier.yes
source: Barrier
ta: தடை

# type.barrier.block
source: Block
ta: தடு

# type.barrier.bollard
source: Bollard
ta: பொல்லார்ட்

# type.barrier.border_control
source: Border Control
ta: எல்லைக் கட்டுப்பாடு

# type.barrier.chain
source: Chain
ta: சங்கிலி

# type.barrier.city_wall
source: City Wall
ta: நகர சுவர்

# type.barrier.cycle_barrier
source: Cycle Barrier
ta: சுழற்சி தடை

# type.waterway.ditch
source: Drainage Ditch
ta: வடிகால் பள்ளம்

# type.natural.water.moat
source: Moat
ta: அகழி

# type.natural.water.wastewater
source: Wastewater
ta: கழிவு நீர்

# type.barrier.entrance
source: Entrance
ta: நுழைவாயில்

# type.barrier.fence
source: Fence
ta: வேலி

# type.barrier.guard_rail
source: Guard Rail
ta: காவலர் ரயில்

# type.barrier.gate
source: Gate
ta: வாயில்

# type.barrier.hedge
source: Hedge
ta: எட்ச்

# type.barrier.kissing_gate
source: Kissing Gate
ta: முத்தம் கேட்

# type.barrier.lift_gate
source: Lift Gate
ta: லிஃப்ட் கேட்

# type.barrier.retaining_wall
source: Retaining Wall
ta: தக்கவைக்கும் சுவர்

# type.barrier.stile
source: Stile
ta: பாணி

# type.barrier.turnstile
source: Turnstile
ta: டர்ன்ச்டைல்

# type.barrier.wicket_gate
source: Wicket Gate
ta: விக்கெட் கேட்

# type.barrier.swing_gate
source: Swing Gate
ta: ச்விங் கேட்

# type.barrier.toll_booth
source: Toll Booth
ta: சுங்கச்சாவடி

# type.barrier.wall
source: Wall
ta: சுவர்

# type.boundary
source: Boundary
ta: எல்லை

# type.boundary.administrative
source: Administrative Boundary
ta: நிர்வாக எல்லை

# type.boundary.administrative.2
source: National Border
ta: தேசிய எல்லை

# type.boundary.administrative.3
source: Regional Boundary
ta: பிராந்திய எல்லை

# type.boundary.administrative.4
source: Regional Boundary
ta: பிராந்திய எல்லை

# type.boundary.national_park
source: National Park
ta: தேசிய பூங்கா

# type.boundary.aboriginal_lands
source: Indigenous Lands
ta: பூர்வீக நிலங்கள்

# type.boundary.protected_area
source: Protected Area
ta: பாதுகாக்கப்பட்ட பகுதி

# type.boundary.protected_area.1
source: Protected Area
ta: பாதுகாக்கப்பட்ட பகுதி

# type.boundary.protected_area.2
source: Protected Area
ta: பாதுகாக்கப்பட்ட பகுதி

# type.boundary.protected_area.3
source: Protected Area
ta: பாதுகாக்கப்பட்ட பகுதி

# type.boundary.protected_area.4
source: Protected Area
ta: பாதுகாக்கப்பட்ட பகுதி

# type.boundary.protected_area.5
source: Protected Area
ta: பாதுகாக்கப்பட்ட பகுதி

# type.boundary.protected_area.6
source: Protected Area
ta: பாதுகாக்கப்பட்ட பகுதி

# type.building
source: Building
ta: கட்டிடம்

# type.building.address
source: Address
ta: முகவரி

# type.building.has_parts
source: Building
ta: கட்டிடம்

# type.building_part
source: Building
ta: கட்டிடம்

# type.building.garage
source: Garage
ta: கேரேச்

# type.building.train_station
source: Station Building
ta: நிலைய கட்டிடம்

# type.building.warehouse
source: Warehouse
ta: கிடங்கு

# type.cemetery.grave
source: Grave
ta: கல்லறை

# type.craft
source: Craft
ta: கைவினை

# type.craft.beekeeper
source: Beekeeper
ta: தேனீ வளர்ப்பவர்

# type.craft.blacksmith
source: Blacksmith
ta: கொல்லன்

# type.craft.brewery
source: Craft Brewery
ta: கைவினை மதுபானம்

# type.craft.caterer
source: Caterer
ta: உணவு வழங்குபவர்

# type.craft.carpenter
source: Carpenter
ta: தச்சர்

# type.craft.confectionery
source: Confectioner
ta: மிட்டாய் வணிகர்

# type.craft.electrician
source: Electrician
ta: எலக்ட்ரீசியன்

# type.craft.electronics_repair
source: Electronics Repair
ta: எலக்ட்ரானிக்ச் பழுது

# type.craft.gardener
source: Gardener
ta: தோட்டக்காரர்

# type.craft.grinding_mill
source: Grinding Mill
ta: அரைக்கும் மில்

# type.craft.handicraft
source: Handicraft
ta: கைவினை

# type.craft.key_cutter
source: Key Cutting
ta: கீ கட்டிங்

# type.craft.locksmith
source: Locksmith
ta: பூட்டு தொழிலாளி

# type.craft.metal_construction
source: Metal Worker
ta: உலோகத் தொழிலாளி

# type.craft.painter
source: House Painter
ta: அவுச் பெயிண்டர்

# type.craft.photographer
source: Photographer
ta: புகைப்படக்காரர்

# type.shop.camera
source: Camera Shop
ta: கேமரா கடை

# type.craft.plumber
source: Plumber
ta: பிளம்பர்

# type.craft.sawmill
source: Sawmill
ta: அறுக்கும் ஆலை

# type.craft.shoemaker
source: Shoe Repair
ta: காலணி பழுது

# type.craft.winery
source: Winery
ta: ஒயின் ஆலை

# type.craft.tailor
source: Tailor
ta: தையல்காரர்

# type.cuisine.african
source: African
ta: ஆப்பிரிக்க

# type.cuisine.american
source: American
ta: அமேரிகன்

# type.cuisine.arab
source: Arab
ta: அரபு

# type.cuisine.argentinian
source: Argentinian
ta: அர்சென்டினா

# type.cuisine.asian
source: Asian
ta: ஆசிய

# type.cuisine.austrian
source: Austrian
ta: ஆச்திரிய

# type.cuisine.bagel
source: Bagel
ta: பேகல்

# type.cuisine.balkan
source: Balkan
ta: பால்கன்

# type.cuisine.barbecue
source: Barbecue
ta: பார்பிக்யூ

# type.cuisine.bavarian
source: Bavarian
ta: பவாரியன்

# type.cuisine.beef_bowl
source: Beef Bowl
ta: மாட்டிறைச்சி கிண்ணம்

# type.cuisine.brazilian
source: Brazilian
ta: பிரேசிலியன்

# type.cuisine.breakfast
source: Breakfast
ta: காலை உணவு

# type.cuisine.bubble_tea
source: Bubble Tea
ta: குமிழி தேநீர்

# type.cuisine.burger
source: Burger
ta: பர்கர்

# type.cuisine.buschenschank
source: Buschenschank
ta: புச்சென்சாங்க்

# type.cuisine.cake
source: Cake
ta: கேக்

# type.cuisine.caribbean
source: Caribbean
ta: கரீபியன்

# type.cuisine.chicken
source: Chicken
ta: கோழி

# type.cuisine.chinese
source: Chinese
ta: சீன

# type.cuisine.coffee_shop
source: Coffee
ta: காபி

# type.cuisine.crepe
source: Crepe
ta: க்ரீப்

# type.cuisine.croatian
source: Croatian
ta: குரோசியன்

# type.cuisine.curry
source: Curry
ta: கறி

# type.cuisine.deli
source: Deli
ta: டெலி

# type.cuisine.diner
source: Diner
ta: உணவருந்துபவர்

# type.cuisine.donut
source: Donut
ta: டோனட்

# type.cuisine.ethiopian
source: Ethiopian
ta: எத்தியோப்பியன்

# type.cuisine.filipino
source: Filipino
ta: ஃபிலிபினோ

# type.cuisine.fine_dining
source: Fine Dining
ta: ஃபைன் டைனிங்

# type.cuisine.fish
source: Fish
ta: மீன்

# type.cuisine.fish_and_chips
source: Fish and Chips
ta: மீன் மற்றும் சிப்ச்

# type.cuisine.french
source: French
ta: பிரஞ்சு

# type.cuisine.friture
source: Friture
ta: பொரியல்

# type.cuisine.georgian
source: Georgian
ta: சார்சியன்

# type.cuisine.german
source: German
ta: செர்மன்

# type.cuisine.greek
source: Greek
ta: கிரேக்கம்

# type.cuisine.grill
source: Grill
ta: கிரில்

# type.cuisine.heuriger
source: Heuriger
ta: இயூரிகர்

# type.cuisine.hotdog
source: Hotdog
ta: ஆட்டாக்

# type.cuisine.hungarian
source: Hungarian
ta: அங்கேரியன்

# type.cuisine.ice_cream
source: Ice Cream
ta: ஐச்கிரீம்

# type.cuisine.indian
source: Indian
ta: இந்தியன்

# type.cuisine.indonesian
source: Indonesian
ta: இந்தோனேசிய

# type.cuisine.international
source: International
ta: சர்வதேசம்

# type.cuisine.irish
source: Irish
ta: ஐரிச்

# type.cuisine.italian
source: Italian
ta: இத்தாலிய

# type.cuisine.italian_pizza
source: Italian, Pizza
ta: இத்தாலியன், பிச்சா

# type.cuisine.japanese
source: Japanese
ta: சப்பானியர்கள்

# type.cuisine.kebab
source: Kebab
ta: கபாப்

# type.cuisine.korean
source: Korean
ta: கொரிய

# type.cuisine.lao
source: Lao
ta: லாவோ

# type.cuisine.lebanese
source: Lebanese
ta: லெபனான்

# type.cuisine.local
source: Local
ta: உள்ளக

# type.cuisine.malagasy
source: Malagasy
ta: மலகாசி

# type.cuisine.malaysian
source: Malaysian
ta: மலேசியன்

# type.cuisine.mediterranean
source: Mediterranean
ta: நடு தரைக்கடல்

# type.cuisine.mexican
source: Mexican
ta: மெக்சிகன்

# type.cuisine.moroccan
source: Moroccan
ta: மொராக்கோ

# type.cuisine.noodles
source: Noodles
ta: நூடுல்ச்

# type.cuisine.oriental
source: East Asian
ta: கிழக்கு ஆசிய

# type.cuisine.pancake
source: Pancake
ta: அப்பத்தை

# type.cuisine.pasta
source: Pasta
ta: பாச்தா

# type.cuisine.persian
source: Persian
ta: பெர்சியன்

# type.cuisine.peruvian
source: Peruvian
ta: பெருவியன்

# type.cuisine.pizza
source: Pizza
ta: பீச்சா

# type.cuisine.polish
source: Polish
ta: போலீச்

# type.cuisine.portuguese
source: Portuguese
ta: போர்த்துகீசியம்

# type.cuisine.ramen
source: Ramen
ta: ராமன்

# type.cuisine.regional
source: Regional
ta: பிராந்தியமானது

# type.cuisine.russian
source: Russian
ta: ரச்ய

# type.cuisine.sandwich
source: Sandwich
ta: சாண்ட்விச்

# type.cuisine.sausage
source: Sausage
ta: தொத்திறைச்சி

# type.cuisine.savory_pancakes
source: Savory Pancakes
ta: சுவையான அப்பங்கள்

# type.cuisine.seafood
source: Seafood
ta: கடல் உணவு

# type.cuisine.soba
source: Soba
ta: சோபா

# type.cuisine.spanish
source: Spanish
ta: ச்பானிச்

# type.cuisine.steak_house
source: Steak House
ta: ச்டீக் அவுச்

# type.cuisine.sushi
source: Sushi
ta: சுசி

# type.cuisine.tapas
source: Tapas
ta: தபச்

# type.cuisine.tea
source: Tea
ta: தேநீர்

# type.cuisine.thai
source: Thai
ta: தாய்

# type.cuisine.turkish
source: Turkish
ta: துருக்கிய

# type.cuisine.vegan
source: Vegan
ta: மரக்கறி

# type.cuisine.vegetarian
source: Vegetarian
ta: மரக்கறி

# type.cuisine.vietnamese
source: Vietnamese
ta: வியட்நாமிய

# type.emergency
source: Emergency
ta: அவசரநிலை

# type.emergency.access_point
source: Emergency Rescue Point
ta: அவசரகால மீட்புப் புள்ளி

# type.emergency.assembly_point
source: Emergency Assembly Point
ta: அவசர பேரவை புள்ளி
