Repository: 247i/TACETr
Catalog: உரை/தானி/comaps-android-typestrings-*.po
Languages: ta

# type.emergency.life_ring
source: Lifebuoy
ta: லைஃப்போய்

# type.emergency.defibrillator
source: Defibrillator
ta: டிஃபிபிரிலேட்டர்

# type.emergency.fire_hydrant
source: Fire Hydrant
ta: தீ நீரேற்றம்

# type.emergency.phone
source: Emergency Phone
ta: அவசர தொலைபேசி

# type.emergency.lifeguard
source: Lifeguard
ta: உயிர்காப்பாளர்

# type.beacon.cardinal.east
source: Cardinal Beacon
ta: கார்டினல் பெக்கான்

# type.beacon.cardinal.north
source: Cardinal Beacon
ta: கார்டினல் பெக்கான்

# type.beacon.cardinal.south
source: Cardinal Beacon
ta: கார்டினல் பெக்கான்

# type.beacon.cardinal.west
source: Cardinal Beacon
ta: கார்டினல் பெக்கான்

# type.beacon.isolated_danger
source: Isolated Danger Beacon
ta: தனிமைப்படுத்தப்பட்ட ஆபத்தான கலங்கரை விளக்கம்

# type.beacon.lateral.port
source: Lateral Beacon
ta: பக்கவாட்டு கலங்கரை விளக்கம்

# type.beacon.lateral.starboard
source: Lateral Beacon
ta: பக்கவாட்டு கலங்கரை விளக்கம்

# type.beacon.safe_water
source: Safe Water Beacon
ta: பாதுகாப்பான நீர் கலங்கரை விளக்கம்

# type.beacon.special_purpose
source: Special Purpose Beacon
ta: சிறப்பு நோக்கத்திற்கான கலங்கரை விளக்கம்

# type.buoy.cardinal.east
source: Cardinal Buoy
ta: கார்டினல் பாய்

# type.buoy.cardinal.north
source: Cardinal Buoy
ta: கார்டினல் பாய்

# type.buoy.cardinal.south
source: Cardinal Buoy
ta: கார்டினல் பாய்

# type.buoy.cardinal.west
source: Cardinal Buoy
ta: கார்டினல் பாய்

# type.buoy.isolated_danger
source: Isolated Danger Buoy
ta: தனிமைப்படுத்தப்பட்ட இடர் மிதவை

# type.buoy.lateral.port
source: Lateral Buoy
ta: பக்கவாட்டு மிதவை

# type.buoy.lateral.starboard
source: Lateral Buoy
ta: பக்கவாட்டு மிதவை

# type.buoy.safe_water
source: Safe Water Buoy
ta: பாதுகாப்பான நீர் மிதவை

# type.buoy.special_purpose
source: Special Purpose Buoy
ta: சிறப்பு நோக்க மிதவை

# type.spherical_buoy.cardinal.east
source: Spherical Cardinal Buoy
ta: கோள கார்டினல் மிதவை

# type.spherical_buoy.cardinal.north
source: Spherical Cardinal Buoy
ta: கோள கார்டினல் மிதவை

# type.spherical_buoy.cardinal.south
source: Spherical Cardinal Buoy
ta: கோள கார்டினல் மிதவை

# type.spherical_buoy.cardinal.west
source: Spherical Cardinal Buoy
ta: கோள கார்டினல் மிதவை

# type.spherical_buoy.isolated_danger
source: Spherical Isolated Danger Buoy
ta: கோள தனிமைப்படுத்தப்பட்ட இடர் மிதவை

# type.spherical_buoy.lateral.port
source: Spherical Lateral Buoy
ta: கோள பக்கவாட்டு மிதவை

# type.spherical_buoy.lateral.starboard
source: Spherical Lateral Buoy
ta: கோள பக்கவாட்டு மிதவை

# type.spherical_buoy.safe_water
source: Spherical Safe Water Buoy
ta: கோள பாதுகாப்பான நீர் மிதவை

# type.spherical_buoy.special_purpose
source: Spherical Special Purpose Buoy
ta: கோள சிறப்பு நோக்க மிதவை

# type.lateral.port
source: Port
ta: துறைமுகம்

# type.lateral.starboard
source: Starboard
ta: ச்டார்போர்டு

# type.cardinal.east
source: East
ta: கிழக்கு

# type.cardinal.north
source: North
ta: வடக்கு

# type.cardinal.south
source: South
ta: தெற்கு

# type.cardinal.west
source: West
ta: மேற்கு

# type.emergency.mountain_rescue
source: Mountain Rescue Station
ta: மலை மீட்பு நிலையம்

# type.entrance
source: Entrance
ta: நுழைவாயில்

# type.entrance.main
source: Main Entrance
ta: முதன்மையான நுழைவாயில்

# type.entrance.house
source: House Entrance
ta: வீட்டு நுழைவாயில்

# type.entrance.garage
source: Garage Entrance
ta: கேரேச் நுழைவாயில்

# type.entrance.service
source: Service Entrance
ta: பணி நுழைவு

# type.entrance.entry
source: Entry (Only)
ta: நுழைவு (மட்டும்)

# type.entrance.exit
source: Exit (Only)
ta: வெளியேறு (மட்டும்)

# type.entrance.emergency
source: Emergency Exit
ta: அவசர வெளியேற்றம்

# type.fee.no
source: Free
ta: இலவசம்

# type.healthcare.laboratory
source: Medical Laboratory
ta: மருத்துவ ஆய்வகம்

# type.healthcare.physiotherapist
source: Physiotherapist
ta: பிசியோதெரபிச்ட்

# type.healthcare.alternative
source: Alternative Medicine
ta: மாற்று மருத்துவம்

# type.healthcare.audiologist
source: Audiologist
ta: ஆடியோலசிச்ட்

# type.healthcare.blood_donation
source: Blood Donation Center
ta: இரத்த தான நடுவண்

# type.healthcare.optometrist
source: Optometrist
ta: ஆப்டோமெட்ரிச்ட்

# type.healthcare.podiatrist
source: Podiatrist
ta: பாத மருத்துவர்

# type.healthcare.psychotherapist
source: Psychotherapist
ta: மனநல மருத்துவர்

# type.healthcare.sample_collection
source: Sample Collection Centre
ta: மாதிரி சேகரிப்பு நடுவண்

# type.healthcare.speech_therapist
source: Logopedics
ta: லோகோபெடிக்ச்

# type.highway
source: Highway
ta: நெடுஞ்சாலை

# type.highway.bridleway
source: Bridle Path
ta: பிரிடில் பாதை

# type.highway.bridleway.bridge
source: Bridge
ta: பாலம்

# type.highway.bridleway.permissive
source: Bridle Path
ta: பிரிடில் பாதை

# type.highway.bridleway.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.busway
source: Dedicated Bus Road
ta: பிரத்யேக பேருந்து சாலை

# type.highway.busway.bridge
source: Bridge
ta: பாலம்

# type.highway.busway.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.bus_stop
source: Bus Stop
ta: பேருந்து நிறுத்தம்

# type.highway.construction
source: Road Under Construction
ta: சாலை கட்டுமானத்தில் உள்ளது

# type.highway.cycleway
source: Cycle Path
ta: சைக்கிள் பாதை

# type.highway.cycleway.bridge
source: Bridge
ta: பாலம்

# type.highway.cycleway.permissive
source: Cycle Path
ta: சைக்கிள் பாதை

# type.highway.cycleway.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.elevator
source: Elevator
ta: உயர்த்தி

# type.highway.footway
source: Foot Path
ta: நடைபாதை

# type.highway.footway.sidewalk
source: Sidewalk
ta: நடைபாதை

# type.highway.footway.crossing
source: Pedestrian Crossing
ta: பாதசாரி குறுக்குவழி

# type.highway.footway.area
source: Pedestrian Area
ta: பாதசாரி பகுதி

# type.highway.footway.bridge
source: Pedestrian Bridge
ta: பாதசாரி பாலம்

# type.highway.footway.tunnel
source: Pedestrian Tunnel
ta: பாதசாரி சுரங்கப்பாதை

# type.highway.ford
source: Ford
ta: ஃபோர்டு

# type.highway.living_street
source: Living Street
ta: வாழும் தெரு

# type.highway.living_street.bridge
source: Bridge
ta: பாலம்

# type.highway.living_street.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.motorway
source: Motorway
ta: மின்னோடி பாதை

# type.highway.motorway.bridge
source: Motorway Bridge
ta: மின்னோடி பாதை பாலம்

# type.highway.motorway.tunnel
source: Motorway Tunnel
ta: மின்னோடி பாதை சுரங்கப்பாதை

# type.highway.motorway_junction
source: Road Exit
ta: சாலை வெளியேறு

# type.highway.motorway_link
source: Motorway Ramp
ta: மின்னோடி பாதை வளைவு

# type.highway.motorway_link.bridge
source: Bridge
ta: பாலம்

# type.highway.motorway_link.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.path
source: Path
ta: பாதை

# type.highway.path.difficult
source: Difficult or Indistinct Trail
ta: கடினமான அல்லது தெளிவற்ற பாதை

# type.highway.path.expert
source: Expert or Indiscernible Trail
ta: வல்லுநர் அல்லது கண்ணுக்கு தெரியாத பாதை

# type.highway.path.bicycle
source: Cycle & Foot Path
ta: சைக்கிள் & கால் பாதை

# type.highway.footway.bicycle
source: Cycle & Foot Path
ta: சைக்கிள் & கால் பாதை

# type.highway.path.bridge
source: Bridge
ta: பாலம்

# type.highway.path.horse
source: Bridle Path
ta: பிரிடில் பாதை

# type.highway.path.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.pedestrian
source: Pedestrian Street
ta: பாதசாரி தெரு

# type.highway.pedestrian.area
source: Pedestrian Area
ta: பாதசாரி பகுதி

# type.highway.pedestrian.bridge
source: Pedestrian Bridge
ta: பாதசாரி பாலம்

# type.highway.pedestrian.square
source: Square
ta: நாற்கை

# type.highway.pedestrian.tunnel
source: Pedestrian Tunnel
ta: பாதசாரி சுரங்கப்பாதை

# type.highway.primary
source: Primary Road
ta: முதன்மை சாலை

# type.highway.primary.bridge
source: Bridge
ta: பாலம்

# type.highway.primary.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.primary_link
source: Primary Road Ramp
ta: முதன்மை சாலை வளைவு

# type.highway.primary_link.bridge
source: Bridge
ta: பாலம்

# type.highway.primary_link.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.raceway
source: Racetrack
ta: பந்தயப் பாதை

# type.highway.residential
source: Residential Street
ta: குடியிருப்பு தெரு

# type.highway.residential.area
source: Residential Street
ta: குடியிருப்பு தெரு

# type.highway.residential.bridge
source: Bridge
ta: பாலம்

# type.highway.residential.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.rest_area
source: Rest Area
ta: ஓய்வு பகுதி

# type.highway.road
source: Road
ta: சாலை

# type.highway.road.bridge
source: Bridge
ta: பாலம்

# type.man_made.bridge
source: Bridge
ta: பாலம்

# type.highway.road.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.secondary
source: Secondary Road
ta: இரண்டாம் நிலை சாலை

# type.highway.secondary.bridge
source: Bridge
ta: பாலம்

# type.highway.secondary.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.secondary_link
source: Secondary Road Ramp
ta: இரண்டாம் நிலை சாலை வளைவு

# type.highway.secondary_link.bridge
source: Bridge
ta: பாலம்

# type.highway.secondary_link.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.service
source: Service Road
ta: சர்வீச் ரோடு

# type.highway.service.area
source: Service Road
ta: சர்வீச் ரோடு

# type.highway.service.bridge
source: Bridge
ta: பாலம்

# type.highway.service.driveway
source: Driveway
ta: ஓட்டுப்பாதை

# type.highway.service.parking_aisle
source: Parking Aisle
ta: பார்க்கிங் இடைகழி

# type.highway.service.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.services
source: Service Area
ta: பணி பகுதி

# type.highway.speed_camera
source: Speed Camera
ta: வேக கேமரா

# type.highway.steps
source: Stairs
ta: படிக்கட்டுகள்

# type.highway.ladder
source: Ladder
ta: ஏணி

# type.highway.steps.bridge
source: Bridge
ta: பாலம்

# type.highway.steps.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.tertiary
source: Tertiary Road
ta: மூன்றாம் நிலை சாலை

# type.highway.tertiary.bridge
source: Bridge
ta: பாலம்

# type.highway.tertiary.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.tertiary_link
source: Tertiary Road Ramp
ta: மூன்றாம் நிலை சாலை வளைவு

# type.highway.tertiary_link.bridge
source: Bridge
ta: பாலம்

# type.highway.tertiary_link.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.track
source: Track
ta: மின்தடம்

# type.highway.track.area
source: Track
ta: மின்தடம்

# type.highway.track.bridge
source: Bridge
ta: பாலம்

# type.highway.track.grade1
source: Track
ta: மின்தடம்

# type.highway.track.no.access
source: Track
ta: மின்தடம்

# type.highway.track.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.traffic_signals
source: Traffic Lights
ta: போக்குவரத்து விளக்குகள்

# type.highway.trunk
source: Trunk Road
ta: டிரங்க் சாலை

# type.highway.trunk.bridge
source: Bridge
ta: பாலம்

# type.highway.trunk.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.trunk_link
source: Trunk Road Ramp
ta: டிரங்க் ரோடு வளைவு

# type.highway.trunk_link.bridge
source: Bridge
ta: பாலம்

# type.highway.trunk_link.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.highway.unclassified
source: Minor Road
ta: சிறு சாலை

# type.highway.unclassified.area
source: Minor Road
ta: சிறு சாலை

# type.highway.unclassified.bridge
source: Bridge
ta: பாலம்

# type.highway.unclassified.tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# type.area_highway.cycleway
source: Cycle Path
ta: சைக்கிள் பாதை

# type.area_highway.footway
source: Foot Path
ta: நடைபாதை

# type.area_highway.living_street
source: Living Street
ta: வாழும் தெரு

# type.area_highway.motorway
source: Motorway
ta: மின்னோடி பாதை

# type.area_highway.path
source: Path
ta: பாதை

# type.area_highway.pedestrian
source: Pedestrian Street
ta: பாதசாரி தெரு

# type.area_highway.primary
source: Primary Road
ta: முதன்மை சாலை

# type.area_highway.residential
source: Residential Street
ta: குடியிருப்பு தெரு

# type.area_highway.secondary
source: Secondary Road
ta: இரண்டாம் நிலை சாலை

# type.area_highway.service
source: Service Road
ta: சர்வீச் ரோடு

# type.area_highway.tertiary
source: Tertiary Road
ta: மூன்றாம் நிலை சாலை

# type.area_highway.steps
source: Stairs
ta: படிக்கட்டுகள்

# type.area_highway.track
source: Track
ta: மின்தடம்

# type.area_highway.trunk
source: Trunk Road
ta: டிரங்க் சாலை

# type.area_highway.unclassified
source: Minor Road
ta: சிறு சாலை

# type.historic
source: Historic Object
ta: வரலாற்றுப் பொருள்

# type.historic.aircraft
source: Historic Aircraft
ta: வரலாற்று வானூர்தி

# type.historic.anchor
source: Historic Anchor
ta: வரலாற்று தொகுப்பாளர்

# type.historic.archaeological_site
source: Archaeological Site
ta: தொல்லியல் தளம்

# type.historic.battlefield
source: Historic Battlefield
ta: வரலாற்றுப் போர்க்களம்

# type.historic.boundary_stone
source: Boundary Stone
ta: எல்லைக் கல்

# type.historic.cannon
source: Cannon
ta: பீரங்கி

# type.historic.castle
source: Castle
ta: கோட்டை

# type.historic.castle.castrum
source: Roman Fort
ta: ரோமன் கோட்டை

# type.historic.castle.defensive
source: Stronghold Castle
ta: வலுவான கோட்டை

# type.historic.castle.fortified_church
source: Fortified Church
ta: வலுவூட்டப்பட்ட தேவாலயம்

# type.historic.castle.fortress
source: Fortress
ta: கோட்டை

# type.historic.castle.hillfort
source: Hillfort
ta: இல்ஃபோர்ட்

# type.historic.castle.kremlin
source: Kremlin
ta: கிரெம்ளின்

# type.historic.castle.manor
source: Manor House
ta: மேனர் அவுச்

# type.historic.castle.palace
source: Palace
ta: அரண்மனை

# type.historic.castle.shiro
source: Japanese Castle
ta: சப்பானிய கோட்டை

# type.historic.castle.stately
source: Stately Castle
ta: கம்பீரமான கோட்டை

# type.historic.city_gate
source: City Gate
ta: நகர வாயில்

# type.historic.citywalls
source: City Wall
ta: நகர சுவர்

# type.historic.fort
source: Fort
ta: கோட்டை

# type.historic.gallows
source: Gallows
ta: தூக்கு மேடை

# type.historic.locomotive
source: Historic Locomotive
ta: வரலாற்று சிறப்புமிக்க லோகோமோட்டிவ்

# type.historic.memorial
source: Memorial
ta: நினைவுச்சின்னம்

# type.historic.memorial.cross
source: Memorial Cross
ta: மெமோரியல் கிராச்

# type.historic.memorial.plaque
source: Commemorative Plaque
ta: நினைவு தகடு

# type.historic.memorial.sculpture
source: Sculpture
ta: சிற்பம்

# type.historic.memorial.statue
source: Statue
ta: சிலை

# type.historic.memorial.stolperstein
source: Stolperstein
ta: தடுமாற்றம்

# type.historic.stone
source: Historic Stone
ta: வரலாற்று கல்

# type.historic.memorial.war_memorial
source: War Memorial
ta: போர் நினைவுச்சின்னம்

# type.historic.mine
source: Historic Mine
ta: வரலாற்று சுரங்கம்

# type.historic.monument
source: Monument
ta: நினைவுச்சின்னம்

# type.historic.pillory
source: Pillory
ta: பில்லரி

# type.historic.ruins
source: Historic Ruins
ta: வரலாற்று இடிபாடுகள்

# type.historic.ship
source: Ship
ta: கப்பல்

# type.historic.tank
source: Historic Tank
ta: வரலாற்று தொட்டி

# type.historic.tomb
source: Tomb
ta: கல்லறை

# type.man_made.cross
source: Cross
ta: குறுக்கு

# type.historic.wayside_cross
source: Wayside Cross
ta: வேசைட் கிராச்

# type.historic.wayside_shrine
source: Wayside Shrine
ta: வழியோர திண்ணை

# type.historic.wreck
source: Shipwreck
ta: கப்பல் விபத்து

# type.internet_access
source: Internet
ta: இணையம்

# type.internet_access.wlan
source: Internet
ta: இணையம்

# type.junction
source: Junction
ta: சந்தி

# type.junction.circular
source: Roundabout
ta: ரவுண்டானா

# type.junction.roundabout
source: Roundabout
ta: ரவுண்டானா

# type.landuse
source: Landuse
ta: நிலப்பரப்பு

# type.landuse.allotments
source: Allotments
ta: ஒதுக்கீடுகள்

# type.landuse.basin
source: Basin
ta: பேசின்

# type.landuse.brownfield
source: Brownfield
ta: பிரவுன்ஃபீல்ட்

# type.landuse.cemetery
source: Cemetery
ta: இடுகாடு

# type.landuse.cemetery.christian
source: Christian Cemetery
ta: கிறிச்தவ கல்லறை

# type.landuse.religious
source: Religious Land
ta: மத நிலம்

# type.landuse.commercial
source: Commercial Area
ta: வணிகப் பகுதி

# type.landuse.construction
source: Construction Area
ta: கட்டுமான பகுதி

# type.landuse.education
source: Educational Facility
ta: கல்வி வசதி

# type.landuse.farmland
source: Farmland
ta: விவசாய நிலம்

# type.landuse.farmyard
source: Farmyard
ta: பண்ணை தோட்டம்

# type.landuse.flowerbed
source: Flowerbed
ta: பூச்செடி

# type.landuse.forest
source: Forest
ta: காடு

# type.landuse.forest.coniferous
source: Coniferous Forest
ta: ஊசியிலையுள்ள காடு

# type.landuse.forest.deciduous
source: Deciduous Forest
ta: இலையுதிர் காடு

# type.landuse.forest.mixed
source: Mixed-Leaf Forest
ta: கலப்பு-இலை காடு

# type.landuse.garages
source: Garages
ta: கேரேச்கள்

# type.landuse.grass
source: Grass
ta: புல்

# type.landuse.greenfield
source: Greenfield
ta: கிரீன்ஃபீல்ட்

# type.landuse.greenhouse_horticulture
source: Greenhouse
ta: பசுமை இல்லம்

# type.landuse.industrial
source: Industrial Area
ta: தொழில்துறை பகுதி

# type.landuse.landfill
source: Landfill
ta: நிலப்பரப்பு

# type.landuse.meadow
source: Meadow
ta: புல்வெளி

# type.landuse.military
source: Military Area
ta: இராணுவப் பகுதி

# type.landuse.orchard
source: Orchard
ta: பழத்தோட்டம்

# type.landuse.quarry
source: Quarry
ta: குவாரி

# type.landuse.railway
source: Railway Premises
ta: ரயில்வே வளாகம்

# type.landuse.recreation_ground
source: Recreation Ground
ta: பொழுதுபோக்கு மைதானம்

# type.landuse.reservoir
source: Reservoir
ta: நீர்த்தேக்கம்

# type.landuse.residential
source: Residential Area
ta: குடியிருப்பு பகுதி

# type.landuse.retail
source: Retail Area
ta: சில்லறை விற்பனை பகுதி

# type.landuse.salt_pond
source: Salt Pond
ta: உப்பு குளம்

# type.landuse.village_green
source: Land
ta: நிலம்

# type.landuse.vineyard
source: Vineyard
ta: திராட்சைத் தோட்டம்

# type.landuse.plant_nursery
source: Plant Nursery
ta: தாவர நாற்றங்கால்

# type.leisure
source: Leisure
ta: ஓய்வு

# type.leisure.bandstand
source: Bandstand
ta: பேண்ட்ச்டாண்ட்

# type.leisure.common
source: Public Land
ta: பொது நிலம்

# type.leisure.dog_park
source: Dog Park
ta: நாய் பூங்கா

# type.leisure.escape_game
source: Escape Room
ta: எச்கேப் ரூம்

# type.leisure.fitness_centre
source: Fitness Centre
ta: உடற்பயிற்சி நடுவண்

# type.leisure.fitness_station
source: Fitness Station
ta: உடற்பயிற்சி நிலையம்

# type.leisure.dance
source: Dance Hall
ta: நடன அரங்கம்

# type.leisure.garden
source: Garden
ta: தோட்டம்

# type.leisure.garden.residential
source: Residential Garden
ta: குடியிருப்பு தோட்டம்

# type.leisure.golf_course
source: Golf Course
ta: கோல்ஃப் மைதானம்

# type.leisure.miniature_golf
source: Minigolf
ta: மினி கோல்ஃப்

# type.leisure.hackerspace
source: Hackerspace
ta: ஏக்கர்ச்பேச்

# type.leisure.ice_rink
source: Ice Rink
ta: பனி வளையம்

# type.leisure.indoor_play
source: Indoor Play Centre
ta: உட்புற விளையாட்டு நடுவண்

# type.leisure.marina
source: Marina
ta: மெரினா

# type.leisure.nature_reserve
source: Nature Reserve
ta: இயற்கை ரிசர்வ்

# type.leisure.outdoor_seating
source: Outdoor Seating
ta: வெளிப்புற இருக்கை

# type.leisure.firepit
source: Firepit
ta: தீக்குழி

# type.leisure.park
source: Park
ta: பூங்கா

# type.leisure.park.no.access
source: Private Park
ta: தனியார் பூங்கா

# type.leisure.park.permissive
source: Park
ta: பூங்கா

# type.leisure.park.private
source: Private Park
ta: தனியார் பூங்கா

# type.leisure.picnic_table
source: Picnic Table
ta: சுற்றுலா அட்டவணை

# type.leisure.pitch
source: Sport Pitch
ta: விளையாட்டு ஆடுகளம்

# type.leisure.playground
source: Playground
ta: விளையாட்டு மைதானம்

# type.leisure.recreation_ground
source: Recreation Ground
ta: பொழுதுபோக்கு மைதானம்

# type.leisure.sauna
source: Sauna
ta: சௌனா

# type.leisure.slipway
source: Slipway
ta: ச்லிப்வே

# type.leisure.sports_centre
source: Sports Center
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.multi
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.american_football
source: Sports Centre
ta: Sports நடுவண்

# type.leisure.sports_centre.sport.archery
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.athletics
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.australian_football
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.badminton
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.baseball
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.basketball
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.beachvolleyball
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.bowls
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.climbing
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.cricket
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.curling
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.equestrian
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.field_hockey
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.futsal
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.golf
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.gymnastics
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.handball
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.ice_hockey
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.padel
source: Sports Centre
ta: Sports நடுவண்

# type.leisure.sports_centre.sport.pelota
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.scuba_diving
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.shooting
source: Sports Centre
ta: Sports நடுவண்

# type.leisure.sports_centre.sport.skateboard
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.skiing
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.soccer
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.swimming
source: Swimming Centre
ta: நீச்சல் நடுவண்

# type.leisure.sports_centre.sport.table_tennis
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.tennis
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.volleyball
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.sports_centre.sport.yoga
source: Sports Centre
ta: விளையாட்டு நடுவண்

# type.leisure.fitness_centre.sport.yoga
source: Yoga Studio
ta: யோகா ச்டுடியோ

# type.leisure.stadium
source: Stadium
ta: அரங்கம்

# type.leisure.swimming_pool
source: Swimming Pool
ta: நீச்சல் குளம்

# type.leisure.swimming_pool.private
source: Swimming Pool
ta: நீச்சல் குளம்

# type.leisure.track
source: Track
ta: மின்தடம்

# type.leisure.track.area
source: Track
ta: மின்தடம்

# type.leisure.water_park
source: Water Park
ta: நீர் பூங்கா

# type.leisure.beach_resort
source: Beach Resort
ta: கடற்கரை ரிசார்ட்

# type.man_made
source: Man Made
ta: மனிதனால் உருவாக்கப்பட்டவை

# type.man_made.breakwater
source: Breakwater
ta: பிரேக் வாட்டர்

# type.man_made.cairn
source: Cairn
ta: கெய்ர்ன்

# type.man_made.chimney
source: Chimney
ta: புகைபோக்கி

# type.man_made.cutline
source: Cutline
ta: கட்லைன்

# type.man_made.survey_point
source: Survey Point
ta: சர்வே பாயிண்ட்

# type.man_made.flagpole
source: Flagpole
ta: கொடிமரம்

# type.man_made.lighthouse
source: Lighthouse
ta: கலங்கரை விளக்கம்

# type.man_made.mast
source: Mast
ta: மாச்ட்

# type.man_made.pier
source: Pier
ta: பாந்து

# type.man_made.pipeline
source: Pipeline
ta: பைப்லைன்

# type.man_made.pipeline.overground
source: Overground Pipeline
ta: நிலத்தடி குழாய்

# type.man_made.silo
source: Silo
ta: சிலோ

# type.man_made.storage_tank
source: Storage Tank
ta: சேமிப்பு தொட்டி

# type.man_made.surveillance
source: Surveillance Camera
ta: கண்காணிப்பு கேமரா

# type.man_made.tower
source: Tower
ta: கோபுரம்

# type.man_made.communications_tower
source: Communications Tower
ta: செய்தி தொடர்பு கோபுரம்
