Repository: 247i/TACETr
Catalog: உரை/தானி/comaps-android-typestrings-*.po
Languages: ta

# type.piste_type.downhill.advanced
source: Advanced Downhill Ski Run
ta: மேம்பட்ட டவுன்இல் ச்கை ரன்

# type.piste_type.downhill.advanced.area
source: Advanced Downhill Ski Run
ta: மேம்பட்ட டவுன்இல் ச்கை ரன்

# type.piste_type.downhill.easy
source: Easy Downhill Ski Run
ta: எளிதாக டவுன்இல் ச்கை ரன்

# type.piste_type.downhill.easy.area
source: Easy Downhill Ski Run
ta: எளிதாக டவுன்இல் ச்கை ரன்

# type.piste_type.downhill.expert
source: Expert Downhill Ski Run
ta: வல்லுநர் டவுன்இல் ச்கை ரன்

# type.piste_type.downhill.expert.area
source: Expert Downhill Ski Run
ta: வல்லுநர் டவுன்இல் ச்கை ரன்

# type.piste_type.downhill.freeride
source: Freeride Downhill Ski Run
ta: ஃப்ரீரைடு டவுன்இல் ச்கை ரன்

# type.piste_type.downhill.intermediate
source: Intermediate Downhill Ski Run
ta: இடைநிலை டவுன்இல் ச்கை ரன்

# type.piste_type.downhill.intermediate.area
source: Intermediate Downhill Ski Run
ta: இடைநிலை டவுன்இல் ச்கை ரன்

# type.piste_type.downhill.novice
source: Novice Downhill Ski Run
ta: புதிய டவுன்இல் ச்கை ரன்

# type.piste_type.downhill.novice.area
source: Novice Downhill Ski Run
ta: புதிய டவுன்இல் ச்கை ரன்

# type.piste_type.nordic
source: Nordic Ski Trail
ta: நோர்டிக் ச்கை டிரெயில்

# type.piste_type.sled
source: Sledding Piste
ta: ச்லெடிங் பிச்டே

# type.piste_type.sled.area
source: Sledding Piste
ta: ச்லெடிங் பிச்டே

# type.piste_type.snow_park
source: Snow Park
ta: ச்னோ பார்க்

# type.piste_type.hike
source: Snow Hiking Trail
ta: ச்னோ ஐக்கிங் பாதை

# type.piste_type.connection
source: Piste Connection
ta: ட்ராக் இணைப்பு

# type.piste_type.skitour
source: Skitour Trail
ta: ச்கை சுற்றுலா பாதை

# type.amenity.events_venue
source: Events Venue
ta: நிகழ்வுகள் இடம்

# type.shop.auction
source: Auction
ta: ஏலம்

# type.shop.collector
source: Collectables
ta: சேகரிக்கக்கூடியவை

# type.self_service.yes
source: Self-service available
ta: தன்வய பணி கிடைக்கும்

# type.self_service.only
source: Self-service only
ta: தன்வய பணி மட்டுமே

# type.self_service.partially
source: Partial self-service
ta: பகுதி தன்வய பணி

# type.self_service.no
source: No self-service
ta: தன்வய பணி இல்லை

# type.amenity.social_facility
source: Social Facility
ta: சமூக வசதி

# type.social_facility.soup_kitchen
source: Soup Kitchen
ta: சூப் கிச்சன்

# type.social_facility.food_bank
source: Food Bank
ta: உணவு வங்கி

# type.amenity.food_sharing
source: Food Sharing
ta: உணவுப் பகிர்வு

# type.amenity.give_box
source: Give Box
ta: பெட்டியைக் கொடுங்கள்

# type.emergency.emergency_ward_entrance
source: Emergency Ward Entrance
ta: அவசர வார்டு நுழைவு

# type.amenity.dojo
source: Dojo
ta: டோசோ

# type.leisure.sports_hall
source: Sports hall
ta: விளையாட்டு அரங்கம்

# type.xmas.tree
source: Christmas Tree
ta: கிறிச்துமச் மரம்
