Repository: 247i/TACETr
Catalog: உரை/தானி/cutefishos-settings-daemon-*.po
Languages: ta

# Battery
source: %1h
ta: %1 ம

# Battery
source: %1m
ta: %1 மீ

# Battery
source: %1 until fully charged
ta: முழுமையாக சார்ச் செய்யப்படும் வரை %1

# Battery
source: %1 remaining
ta: %1 மீதமுள்ள

# Battery
source: Fully charged.
ta: முழுமையாக சார்ச் செய்யப்பட்டது.

# Battery
source: now
ta: இப்போது

# Battery
source: %1 ago
ta: %1 முன்பு

# UPowerDevice %1 is battery technology
source: %1 Battery
ta: %1 பேட்டரி

# UPowerDevice battery technology
source: Lithium-ion
ta: லித்தியம் அயன்

# UPowerDevice battery technology
source: Lithium Polymer
ta: லித்தியம் பாலிமர்

# UPowerDevice battery technology
source: Lithium Iron Phosphate
ta: லித்தியம் இரும்பு பாச்பேட்

# UPowerDevice battery technology
source: Lead Acid
ta: ஈய புளிக்காரம்

# UPowerDevice battery technology
source: Nickel Cadmium
ta: நிக்கல் காட்மியம்

# UPowerDevice battery technology
source: Nickel Metal Hydride
ta: நிக்கல் மெட்டல் ஐட்ரைடு

# UPowerDevice battery technology
source: Unknown
ta: தெரியவில்லை
