Repository: 247i/TACETr
Catalog: உரை/தானி/debian-member-portfolio-service-translations-*.po
Languages: ta

source: JSON
ta: சேசன்

source: HTML
ta: உஉகுமொ

source: Overview
ta: கண்ணோட்டம்

source: Debian Member's Package Overview
ta: டெபியன் உறுப்பினரின் தொகுப்பு கண்ணோட்டம்

source: Debian Member's Package Overview ... showing all email addresses
ta: டெபியன் உறுப்பினரின் தொகுப்பு கண்ணோட்டம் ... அனைத்து மின்னஞ்சல் முகவரிகளையும் காட்டுகிறது

source: Bugs
ta: பிழைகள்

source: bugs received (note: co-maintainers not listed, see <a href="https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=430986">#430986</a>)
ta: பிழைகள் பெறப்பட்டன .

source: bugs reported
ta: பிழைகள் தெரிவிக்கப்பட்டன

source: user tags
ta: பயனர் குறிச்சொற்கள்

source: correspondent for bugs
ta: பிழைகள் நிருபர்

source: one year open bug history graph
ta: ஒரு வருடம் திறந்த பிழை வரலாறு வரைபடம்

source: Build
ta: உருவாக்கு

source: buildd.d.o
ta: Build.D.O

source: igloo
ta: இக்லூ

source: Quality Assurance
ta: தர பொறுப்பு

source: maintainer dashboard
ta: பராமரிப்பாளர் டாச்போர்டு

source: lintian reports
ta: லிண்டியன் அறிக்கைகள்

source: full lintian reports (i.e. including "info"-level messages)
ta: முழு லிண்டியன் அறிக்கைகள் (அதாவது "தகவல்"-நிலை செய்திகள் உட்பட)

source: Debian Janitor
ta: டெபியன் காவலாளி

source: Mailing Lists
ta: அஞ்சல் பட்டியல்கள்

source: Files
ta: கோப்புகள்

source: people.d.o
ta: PEORE.D.O

source: oldpeople
ta: வயதானவர்கள்

source: Membership
ta: உறுப்பினர்

source: NM
ta: என்.எம்

source: DB information via finger
ta: விரல் வழியாக டிபி செய்தி

source: DB information via HTTP
ta: HTTP வழியாக DB செய்தி

source: Salsa
ta: சல்சா

source: Wiki
ta: விக்கி

source: Forum
ta: மன்றம்

source: Miscellaneous
ta: மற்றவை

source: debtags
ta: கடன்களை

source: Planet Debian (name)
ta: பிளானட் டெபியன் (பெயர்)

source: Planet Debian (username)
ta: பிளானட் டெபியன் (பயனர்பெயர்)

source: links
ta: இணைப்புகள்

source: Debian website
ta: டெபியன் வலைத்தளம்

source: Debian search
ta: டெபியன் தேடல்

source: OpenPGP public key via finger
ta: OpenPGP பொது விசை விரல் வழியாக

source: OpenPGP public key via HTTP
ta: HTTP வழியாக OpenPGP பொது விசை

source: NM, AM participation
ta: என்.எம், நான் பங்கேற்பு

source: Contribution information
ta: பங்களிப்பு செய்தி

source: Repology information
ta: மறுபயன்பாடு செய்தி

source: Information reachable via ssh (for Debian Members)
ta: பாஓடு வழியாக அடையக்கூடிய செய்தி (டெபியன் உறுப்பினர்களுக்கு)

source: owned debian.net domains
ta: சொந்தமான டெபியன்.நெட் களங்கள்

source: <a href="https://wiki.debian.org/qa.debian.org/MIATeam">MIA</a> database information
ta: <a href = "https://wiki.debian.org/qa.debian.org/miateam"> mia </a> தரவுத்தள செய்தி

source: Group membership information
ta: குழு உறுப்பினர் செய்தி

source: Email address
ta: மின்னஞ்சல் முகவரி

source: Name
ta: பெயர்

source: OpenPGP fingerprint
ta: OpenPGP கைரேகை

source: Debian user name
ta: டெபியன் பயனர் பெயர்

source: Non Debian email address
ta: டெபியன் அல்லாத மின்னஞ்சல் முகவரி

source: Salsa user name
ta: சல்சா பயனர் பெயர்

source: Missing input: %s
ta: உள்ளீடு இல்லை: %s

source: Debian Member Portfolio Service
ta: டெபியன் உறுப்பினர் போர்ட்ஃபோலியோ பணி

source: Debian Logo
ta: டெபியன் லோகோ

source: This service has been inspired by Stefano Zacchiroli's <a href="https://wiki.debian.org/DDPortfolio">DDPortfolio page in the Debian Wiki</a>. You can create a set of customized links leading to a Debian Member's or package maintainer's information regarding Debian.
ta: இந்த பணி ச்டெபனோ சக்கிரோலியின் <a href = "https://wiki.debian.org/ddportfolio"> டெபியன் விக்கியில் உள்ள ddportfolio பக்கத்தால் ஈர்க்கப்பட்டுள்ளது </a>. டெபியன் உறுப்பினரின் அல்லது டெபியன் தொடர்பான தொகுப்பு பராமரிப்பாளரின் தகவல்களுக்கு வழிவகுக்கும் தனிப்பயனாக்கப்பட்ட இணைப்புகளின் தொகுப்பை நீங்கள் உருவாக்கலாம்.

source: AGPL - Free Software
ta: ஏசிபிஎல் - இலவச மென்பொருள்

source: The service is available under the terms of the <a href="https://www.gnu.org/licenses/agpl.html">GNU Affero General Public License</a> as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. You can <a href="%(browseurl)s" title="Gitweb repository browser URL">browse the source code</a> or clone it from <a href="%(cloneurl)s" title="git clone URL">%(cloneurl)s</a> using <a href="https://git-scm.com/">git</a>. If you want to translate this service to your language you can contribute at <a href="%(weblateurl)s" title="Debian Member Portfolio Service at Weblate">Weblate</a>.
ta: இந்த பணி <a href = "https://www.gnu.org/licenses/agpl.html"> குனு அஃபெரோ பொது பொது உரிமம் </a> இன் விதிமுறைகளின் கீழ் கிடைக்கிறது, இலவச மென்பொருள் அறக்கட்டளை வெளியிட்டது, ஒன்று பதிப்பு உரிமத்தின் 3, அல்லது (உங்கள் விருப்பத்தில்) பின்னர் எந்த பதிப்பும். நீங்கள் <a href = "%(browseurl)s" தலைப்பு = "கிட்வெப் களஞ்சிய உலாவி URL"> மூலக் குறியீட்டை உலாவலாம் </a> அல்லது <a href = "%(cloneurl)s" தலைப்பு = "அறிவிலி நகலி முகவரி ">%(cloneurl)s </a> <a href =" https://git-scm.com/ "> git </a> ஐப் பயன்படுத்துதல். இந்த சேவையை உங்கள் மொழியில் மொழிபெயர்க்க விரும்பினால், நீங்கள் <a href = "%(weblateurl)s" தலைப்பு = "வலைபெயர்ப்பு இல் டெபியன் உறுப்பினர் போர்ட்ஃபோலியோ சேவை"> வலைபெயர்ப்பு </a> இல் பங்களிக்க முடியும்.

source: Copyright © 2009-2022 Jan Dittberner
ta: பதிப்புரிமை © 2009-2022 சான் டிட்பெர்னர்

source: Enter your personal information
ta: உங்கள் தனிப்பட்ட தகவல்களை உள்ளிடவும்

source: Debian Member Portfolio
ta: டெபியன் உறுப்பினர் போர்ட்ஃபோலியோ

source: Email address:
ta: மின்னஞ்சல் முகவரி:

source: Show all form fields
ta: அனைத்து படிவ புலங்களையும் காட்டு

source: Name:
ta: பெயர்:

source: OpenPGP fingerprint:
ta: OpenPGP கைரேகை:

source: Debian user name:
ta: டெபியன் பயனர் பெயர்:

source: Non Debian email address:
ta: டெபியன் அல்லாத மின்னஞ்சல் முகவரி:

source: Salsa user name:
ta: சல்சா பயனர் பெயர்:

source: Wiki user name:
ta: விக்கி பயனர் பெயர்:

source: Forum user id:
ta: மன்ற பயனர் ஐடி:

source: Output format:
ta: வெளியீட்டு வடிவம்:

source: Build Debian Member Portfolio URLs
ta: டெபியன் உறுப்பினர் போர்ட்ஃபோலியோ முகவரி களை உருவாக்குங்கள்

source: Your personal links
ta: உங்கள் தனிப்பட்ட இணைப்புகள்

source: Debian Member Porfolio
ta: டெபியன் உறுப்பினர் போர்ட்ஃபோலியோ

source: Usage
ta: பயன்பாடு

source: URL
ta: முகவரி

source: Error during URL creation:
ta: முகவரி உருவாக்கத்தின் போது பிழை:

source: Restart
ta: மறுதொடக்கம்
