Repository: 247i/TACETr
Catalog: உரை/தானி/deepines-store-deepines-store-*.po
Languages: ta

# AboutDialog
source: About
ta: பற்றி

# AboutDialog
source: Version {version}
ta: பதிப்பு {version}

# AboutDialog
source: The App Store of Deepin en Español
ta: ச்பானிச் மொழியில் டீப்பினின் ஆப் கடை

# LoadingScreen
source: Starting...
ta: தொடங்குகிறது ...

# LoadingScreen
source: Fetching files...
ta: கோப்புகளைப் பெறுதல் ...

# LoadingScreen
source: Initializing components...
ta: கூறுகளைத் தொடங்குதல் ...

# LoadingScreen
source: Finalizing setup...
ta: அமைப்பை இறுதி செய்தல் ...

# LoadingScreen
source: Loading...
ta: ஏற்றுகிறது ...

# Ui_DialogInstall
source: Installing {item}
ta: {item} நிறுவுகிறது

# Ui_DialogInstall
source: Close
ta: மூடு

# Ui_DialogInstall
source: Retry
ta: மீண்டும் முயற்சிக்கவும்

# Ui_DialogInstall
source: The installation system is locked by another installation or upgrade process, wait until it finishes and click Retry. If you use Synaptic, make sure it is closed.
ta: நிறுவல் அமைப்பு பூட்டப்பட்டுள்ளது மற்றொரு நிறுவல் அல்லது மேம்படுத்தல் செயல்முறை, அது முடிவடையும் வரை காத்திருந்து மீண்டும் முயற்சிக்கவும். நீங்கள் சினாப்டிக் பயன்படுத்தினால், அது மூடப்பட்டிருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# Ui_DialogInstall
source: Install
ta: நிறுவவும்

# Ui_DialogInstall
source: All processes have been completed.
ta: அனைத்து செயல்முறைகளும் முடிக்கப்பட்டுள்ளன.

# Ui_DialogInstall
source: Installation process - Deepines Store
ta: நிறுவல் செயல்முறை - டீபைன்ச் கடை

# Ui_DialogInstall
source: The database is being updated.
ta: தரவுத்தளம் புதுப்பிக்கப்படுகிறது.

# Ui_DialogInstall
source: The installation of {item} is finished.
ta: {உருப்படி of இன் நிறுவல் முடிந்தது.

# Ui_DialogInstall
source: The network connection has failed and the installation has not been completed. Check that your computer is connected to the Internet and click Retry. If the problem persists, send a report to t.me/deepinenespanol.
ta: பிணைய இணைப்பு தோல்வியடைந்துள்ளது மற்றும் நிறுவல் முடிக்கப்படவில்லை. உங்கள் கணினி இணையத்துடன் இணைக்கப்பட்டுள்ளதா என்பதைச் சரிபார்த்து மீண்டும் முயற்சிக்கவும் என்பதைக் சொடுக்கு செய்யவும். சிக்கல் தொடர்ந்தால், ஒரு அறிக்கையை t.me/deepinenespanol க்கு அனுப்பவும்.

# Ui_DialogInstall
source: {app_count} app has been selected for installation:
ta: நிறுவலுக்கு {app_count} பயன்பாடு தேர்ந்தெடுக்கப்பட்டுள்ளது:

# Ui_DialogInstall
source: {app_count} apps have been selected for installation:
ta: நிறுவலுக்கு {app_count} பயன்பாடுகள் தேர்ந்தெடுக்கப்பட்டுள்ளன:

# Ui_DialogInstall
source: An error has occurred, please try again. If the problem persists, contact the administrator.
ta: பிழை ஏற்பட்டது, தயவுசெய்து மீண்டும் முயற்சிக்கவும். சிக்கல் தொடர்ந்தால், நிர்வாகியை தொடர்பு கொள்ளவும்.

# Ui_DialogInstall
source: One or more apps could not be installed because they depend on other packages that cannot be installed. You can look for help in our forum at deepinenespanol.org/comunidad or in our Telegram group t.me/deepinenespanol.
ta: ஒன்று அல்லது அதற்கு மேற்பட்ட பயன்பாடுகளை நிறுவ முடியவில்லை அவை நிறுவ முடியாத பிற தொகுப்புகளை சார்ந்துள்ளது. Deatinenespanol.org/comunidad இல் எங்கள் மன்றத்தில் நீங்கள் உதவியைக் காணலாம் அல்லது எங்கள் தந்தி குழுவில் t.me/deepinenespanol.

# Ui_DialogInstall
source: App to uninstall: {item}
ta: நிறுவல் நீக்க பயன்பாடு: {item}

# Ui_DialogInstall
source: Uninstall
ta: நிறுவல் நீக்க

# Ui_DialogInstall
source: Warning: do not close the window, interrupting the process may damage your system.
ta: எச்சரிக்கை: சாளரத்தை மூட வேண்டாம், செயல்முறையை குறுக்கிடுவது உங்கள் கணினியை சேதப்படுத்தும்.

# Ui_DialogInstall
source: Uninstalling {item}
ta: {item} நிறுவல் நீக்குதல்

# Ui_DialogInstall
source: The uninstallation of {item} is finished.
ta: {உருப்படி of இன் நிறுவல் நீக்குதல் முடிந்தது.

# Ui_Frame
source: Select
ta: தேர்ந்தெடு

# Ui_MainWindow
source: Home
ta: வீடு

# Ui_MainWindow
source: Games
ta: விளையாட்டுகள்

# Ui_MainWindow
source: Other
ta: மற்றொன்று

# Ui_MainWindow
source: About Version: {version}
ta: பற்றி பதிப்பு: {version}

# Ui_MainWindow
source: Development
ta: வளர்ச்சி

# Ui_MainWindow
source: Search
ta: தேடல்

# Ui_MainWindow
source: Internet
ta: இணையம்

# Ui_MainWindow
source: System
ta: மண்டலம்

# Ui_MainWindow
source: Graphics
ta: கிராபிக்ச்

# Ui_MainWindow
source: About us
ta: எங்களைப் பற்றி

# Ui_MainWindow
source: Multimedia
ta: பன்னூடகம்

# Ui_MainWindow
source: Deepines
ta: டீப்ன்கள்

# Ui_MainWindow
source: Office automation
ta: அலுவலக ஆட்டோமேசன்

# Ui_MainWindow
source: Deepines Store
ta: டீபைன்ச் கடை

# Ui_MainWindow
source: Installed
ta: நிறுவப்பட்டது

# Ui_MainWindow
source: Selected
ta: தேர்ந்தெடுக்கப்பட்டது

# Ui_MainWindow
source: Select the apps to install
ta: நிறுவ பயன்பாடுகளைத் தேர்ந்தெடுக்கவும்

# Ui_MainWindow
source: Minimize
ta: குறைக்கவும்

# Ui_MainWindow
source: Zoom
ta: பெரிதாக்கு

# Ui_MainWindow
source: Close
ta: மூடு

# Ui_MainWindow
source: Apps .deb
ta: பயன்பாடுகள் .deb

# Ui_MainWindow
source: Deepines repository is not installed on your system,<br>Deepines Store needs this repository to work.<br>In the following link you will find the instructions to install it:<br><br>{repoURL}
ta: உங்கள் கணினியில் டீபைன்ச் களஞ்சியம் நிறுவப்படவில்லை, <br> டீப்ன்ச் கடை வேலை செய்ய இந்த களஞ்சியம் தேவை. <br> பின்வரும் இணைப்பில் அதை நிறுவுவதற்கான வழிமுறைகளைக் காண்பீர்கள்: <br> <br> {{repoURL}

# Ui_MainWindow
source: Review apps
ta: பயன்பாடுகளை மதிப்பாய்வு செய்யவும்

# Ui_MainWindow
source: Installed apps
ta: நிறுவப்பட்ட பயன்பாடுகள்

# Ui_MainWindow
source: Apps Flatpak
ta: பயன்பாடுகள் பிளாட்பாக்

# Ui_MainWindow
source: Select
ta: தேர்ந்தெடு

# Ui_MainWindow
source: Uninstall
ta: நிறுவல் நீக்க

# Ui_MainWindow
source: Uninstalled
ta: நிறுவல் நீக்கப்பட்டது

# Ui_MainWindow
source: {app_count} app selected, click here to review it
ta: தேர்ந்தெடுக்கப்பட்ட {app_count} பயன்பாடு, அதை மதிப்பாய்வு செய்ய இங்கே சொடுக்கு செய்க

# Ui_MainWindow
source: {app_count} apps selected, click here to review them
ta: {app_count} பயன்பாடுகள் தேர்ந்தெடுக்கப்பட்டவை, அவற்றை மதிப்பாய்வு செய்ய இங்கே சொடுக்கு செய்க

# Ui_MainWindow
source: Unable to establish connection with the server, <br>please check your internet connection.<br>If the problem persists, please contact us via Telegram <br>at {atTlURL}.<br><br>Visit Deepin en Español for more information: {siteURL}
ta: சேவையகத்துடன் இணைப்பை நிறுவ முடியவில்லை, <br> தயவுசெய்து உங்கள் இணைய இணைப்பைச் சரிபார்க்கவும். <br> சிக்கல் தொடர்ந்தால், தயவுசெய்து எங்களை டெலிகிராம் வழியாக தொடர்பு கொள்ளவும் <br> {atTlURL}. <br> <br> மேலும் மேலும் தகவல்: {siteURL}

# Ui_MainWindow
source: Start process
ta: தொடக்க செயல்முறை

# Ui_MainWindow
source: Installing...
ta: நிறுவுதல் ...

# Ui_MainWindow
source: Installation failed!
ta: நிறுவல் தோல்வியடைந்தது!

# Ui_MainWindow
source: Ready to install
ta: நிறுவ தயாராக உள்ளது

# Ui_MainWindow
source: Starting installation...
ta: நிறுவலைத் தொடங்குகிறது ...
