Repository: 247i/TACETr
Catalog: உரை/தானி/dhizuku-app-*.po
Languages: ta

# app_name
source: Dhizuku
ta: டிட்

source: Copy
ta: நகலெடு

source: Cancel
ta: ரத்துசெய்

source: Retry
ta: மீண்டும் முயற்சிக்கவும்

# home_status_owner_granted
source: You are Owner!!!
ta: நீங்கள் உரிமையாளர் !!!

# home_status_owner_denied
source: Waiting for activation
ta: செயல்படுத்தலுக்காக காத்திருக்கிறது

# home_app_management_title
source: Application Management
ta: பயன்பாட்டு மேலாண்மை

# home_app_management_dsp
source: Apps that has requested or declared Dhizuku will show here.
ta: திசுகு கோரிய அல்லது அறிவித்த பயன்பாடுகள் இங்கே காண்பிக்கப்படும்.

# home_dhizuku_title
source: Activation by Dhizuku
ta: திசுகுவால் செயல்படுத்தல்

# home_dhizuku_dsp
source: If you have other Dhizuku implementations installed, you can switch between them at will. Please <a href=%1$s>read the help</a>.
ta: உங்களிடம் பிற திசுகு செயலாக்கங்கள் நிறுவப்பட்டிருந்தால், நீங்கள் அவர்களுக்கு இடையே விருப்பப்படி மாறலாம். தயவுசெய்து <a href =%1$s> உதவியைப் படியுங்கள் </a>.

# home_shizuku_title
source: Activation by Shizuku
ta: சிசுகு எழுதிய ஒரு அசி வி.ஏ.வின் வெப்பநிலை

# home_shizuku_dsp
source: With Shizuku, you have the ability to run ADB commands without the need for a computer. Please <a href=%1$s>read the help</a>.
ta: சிசுகுவுடன், கணினியின் தேவை இல்லாமல் ADB கட்டளைகளை இயக்கும் திறன் உங்களுக்கு உள்ளது. தயவுசெய்து <a href =%1$s> உதவியைப் படியுங்கள் </a>.

# home_adb_title
source: Activation by ADB
ta: ADB ஆல் செயல்படுத்தல்

# home_adb_dsp
source: Through the ADB (Android Debug Bridge) connection, you can execute some privileged commands. Please <a href=%1$s>read the help</a>.
ta: ADB (Android பிழைத்திருத்த பாலம்) இணைப்பு மூலம், நீங்கள் சில சலுகை பெற்ற கட்டளைகளை இயக்கலாம். தயவுசெய்து <a href =%1$s> உதவியைப் படியுங்கள் </a>.

# home_adb_btn_view_command
source: View command
ta: கட்டளையைக் காண்க

# home_shutdown_title
source: Shutdown
ta: பணிநிறுத்தம்

# home_shutdown_dsp
source: The system will not be able to shut down Dhizuku unless Dhizuku does so voluntarily.
ta: திசுகு தானாக முன்வந்து அவ்வாறு செய்யாவிட்டால் இந்த அமைப்பு திசுகுவை மூட முடியாது.

# home_deactivate_title
source: Deactivate
ta: செயலிழக்கச் செய்யுங்கள்

# home_deactivate_dsp
source: Are you sure you want to deactivate?
ta: நீங்கள் நிச்சயமாக செயலிழக்க விரும்புகிறீர்களா?

# confirm
source: OK
ta: சரி

source: Finish
ta: முடிக்க

source: Donate
ta: நன்கொடை

source: Alipay
ta: அலிபே

source: Wechat
ta: வெச்சாட்

source: Binance
ta: பைன்ச்

# request_permission_text
source: <![CDATA[Agree to the Dhizuku permission request of <b>%1$s</b>\?]]>
ta: <! [சி.டி.ஏ.டி.ஏ [<b>%1$s </b> \?]] இன் திசுகு இசைவு கோரிக்கையை ஒப்புக்கொள்கிறேன்]>

# agree
source: Grant
ta: மானியம்

# refuse
source: Deny
ta: மறுக்கவும்

# service_channel_name
source: Background service
ta: பின்னணி பணி

# service_running
source: Dhizuku is running
ta: திசுகு இயங்குகிறது
