Repository: 247i/TACETr
Catalog: உரை/தானி/e2openplugin-openwebif-e2openplugin-openwebif-*.po
Languages: ta

source: Site and sources
ta: தளம் மற்றும் ஆதாரங்கள்

source: Skins
ta: தோல்கள்

source: SleepTimer error
ta: ச்லீப் டெமர் பிழை

source: Sleeptimer has been disabled
ta: ச்லீப் டெமர் முடக்கப்பட்டுள்ளது

source: Sleeptimer is disabled
ta: ச்லீப் டெமர் முடக்கப்பட்டுள்ளது

source: Sleeptimer is enabled
ta: ச்லீப் டெமர் இயக்கப்பட்டது

source: Sleeptimer set to %d minutes
ta: ச்லீப் டெமர் %d நிமிடங்களுக்கு அமைக்கப்பட்டுள்ளது

source: Small remote layout
ta: சிறிய தொலைநிலை தளவமைப்பு

source: Software
ta: மென்பொருள்

source: Sorry this page is not yet implemented
ta: மன்னிக்கவும் இந்த பக்கம் இன்னும் செயல்படுத்தப்படவில்லை

source: Sort
ta: வரிசைப்படுத்து

source: Spinner
ta: ச்பின்னர்

source: Standby
ta: காத்திருப்பு

source: Start
ta: தொடங்கு

source: Start Instant Record
ta: உடனடி பதிவைத் தொடங்கவும்

source: Start time is after end time
ta: தொடக்க நேரம் இறுதி நேரத்திற்குப் பிறகு

source: Start typing...
ta: தட்டச்சு செய்யத் தொடங்குங்கள் ...

source: State
ta: மாநிலம்

source: Storage
ta: சேமிப்பு

source: Stream
ta: ச்ட்ரீம்

source: Stream Clients
ta: ச்ட்ரீம் கிளையண்டுகள்

source: Su
ta: அவை

source: Subdirectories
ta: துணை அடைவுகள்

source: Subnet mask
ta: சப்நெட் மாச்க்

source: Subservices
ta: உட்பிரிவுகள்

source: Sun
ta: சூரியன்

source: Sunday
ta: ஞாயிற்றுக்கிழமை

source: System OE
ta: கணினி oe

source: TB
ta: காசநோய்

source: TSID
ta: Tumd

source: TV
ta: டிவி

source: TV Guide
ta: டிவி வழிகாட்டி

source: TV Multi EPG
ta: டிவி மல்டி ஈபிசி

source: Tags
ta: குறிச்சொற்கள்

source: Teletext
ta: டெலிடெக்ச்ட்

source: Teletext PID
ta: டெலிடெக்ச்ட் பிஐடி

source: Television
ta: தொலைக்காட்சி

source: Template Engine
ta: வார்ப்புரு இயந்திரம்

source: Terminal
ta: முனையத்தில்

source: Terrestrial
ta: நிலப்பரப்பு

source: Text
ta: உரை

source: Th
ta: வது

source: The parameter '%s' can't be empty
ta: '%s' அளவுரு காலியாக இருக்க முடியாது

source: The parameter 'command' must be a number
ta: 'கட்டளை' அளவுரு ஒரு எண்ணாக இருக்க வேண்டும்

source: The timer '%s' has been %s successfully
ta: நேரங்குறிகருவி ' %s' %s வெற்றிகரமாக உள்ளது

source: The timer '%s' has been deleted successfully
ta: நேரங்குறிகருவி '%s' வெற்றிகரமாக நீக்கப்பட்டுள்ளது

source: The timer '%s' now recorded! Not disabled!
ta: நேரங்குறிகருவி '%s' இப்போது பதிவு செய்யப்பட்டுள்ளது! முடக்கப்படவில்லை!

source: Theme
ta: கருப்பொருள்

source: Theme mode
ta: கருப்பொருள் பயன்முறை

source: This service can not be added.
ta: இந்த சேவையைச் சேர்க்க முடியாது.

source: Thursday
ta: வியாழக்கிழமை

source: Time
ta: நேரம்

source: Timeline
ta: காலவரிசை

source: Timeout
ta: நேரம் முடிந்தது

source: Timer
ta: நேரங்குறிகருவி

source: Timer '%s' added
ta: நேரங்குறிகருவி '%s' சேர்க்கப்பட்டது

source: Timer '%s' already exists!
ta: நேரங்குறிகருவி '%s' ஏற்கனவே உள்ளது!

source: Timer '%s' changed
ta: நேரங்குறிகருவி '%s' மாற்றப்பட்டது

source: Timer '%s' not enabled while Conflict
ta: நேரங்குறிகருவி '%s' மோதல் போது இயக்கப்படவில்லை

source: Timer '%s' not saved while Conflict
ta: நேரங்குறிகருவி '%s' மோதலில் சேமிக்கப்படவில்லை

source: Timer Added
ta: நேரங்குறிகருவி சேர்க்கப்பட்டது

source: Timer Conflict
ta: நேரங்குறிகருவி மோதல்

source: Timer added
ta: நேரங்குறிகருவி சேர்க்கப்பட்டது

source: Timer conflict detected! Not recording!
ta: நேரங்குறிகருவி மோதல் கண்டறியப்பட்டது! பதிவு செய்யவில்லை!

source: Timer type
ta: நேரங்குறிகருவி வகை

source: TimerList has been saved
ta: நேரங்குறிகருவி பட்டியல் சேமிக்கப்பட்டுள்ளது

source: Timerlist
ta: நேரங்குறிகருவி பட்டியல்

source: Timers
ta: டைமர்கள்

source: Title
ta: தலைப்பு

source: To date
ta: இன்றுவரை

source: Today
ta: இன்று

source: Toggle Standby
ta: காத்திருப்பு மாற்று

source: Transcode
ta: டிரான்ச்கோட்

source: Translation to Spanish
ta: ச்பானிச் மொழியில் மொழிபெயர்ப்பு

source: Try guessing
ta: யூகிக்க முயற்சிக்கவும்

source: Tu
ta: செ

source: Tue
ta: செவ்வாய்

source: Tuesday
ta: செவ்வாய்க்கிழமை

source: Tuner Number
ta: ட்யூனர் எண்

source: Tuner Signal
ta: ட்யூனர் சிக்னல்

source: Tuner Type
ta: ட்யூனர் வகை

source: Tuners
ta: சுருதிக்கூட்டிகள

source: Type
ta: வகை

source: Unknown Volume command %s
ta: அறியப்படாத தொகுதி கட்டளை %s

source: Unknown command: '%s'
ta: தெரியாத கட்டளை: '%s'

source: Upcoming Events
ta: வரவிருக்கும் நிகழ்வுகள்

source: Update
ta: புதுப்பிப்பு

source: Update Package
ta: புதுப்பிப்பு தொகுப்பு

source: Update from feed
ta: ஊட்டத்திலிருந்து புதுப்பிக்கவும்

source: Upgrade all packages
ta: அனைத்து தொகுப்புகளையும் மேம்படுத்தவும்

source: Upload File Error
ta: கோப்பு பிழையைப் பதிவேற்றவும்

source: Upload package
ta: தொகுப்பைப் பதிவேற்றவும்

source: Uploaded Files
ta: பதிவேற்றிய கோப்புகள்

source: Use Channelname for screenshots
ta: திரை சாட்களுக்கு சேனல் பெயர் பயன்படுத்தவும்

source: Use a custom location
ta: தனிப்பயன் இருப்பிடத்தைப் பயன்படுத்தவும்

source: Use as PiP if possible
ta: முடிந்தால் PIP ஆக பயன்படுத்தவும்

source: Use classic interface
ta: கிளாசிக் இடைமுகத்தைப் பயன்படுத்தவும்

source: Use custom box name
ta: தனிப்பயன் பெட்டி பெயரைப் பயன்படுத்தவும்

source: Use modern design
ta: நவீன வடிவமைப்பைப் பயன்படுத்துங்கள்

source: Use modern interface
ta: நவீன இடைமுகத்தைப் பயன்படுத்தவும்

source: VPS
ta: வி.பி.எச்

source: VPS plugin not found
ta: வி.பி.எச் சொருகி கிடைக்கவில்லை

source: Version
ta: பதிப்பு

source: Video
ta: ஒளிதோற்றம்

source: Video Height
ta: வீடியோ உயரம்

source: Video PID (VPID)
ta: வீடியோ பிஐடி (VPID)

source: Video Width
ta: வீடியோ அகலம்

source: Visibly
ta: பார்வைக்கு

source: Volume
ta: தொகுதி

source: Volume Control
ta: தொகுதி கட்டுப்பாடு

source: Waiting for answer ...
ta: பதிலுக்காக காத்திருக்கிறது ...

source: Wake Up
ta: எழுந்திரு

source: Wakeup
ta: விழித்தெழு

source: Warning
ta: எச்சரிக்கை

source: We
ta: நாங்கள்

source: Web TV
ta: வலை டிவி

source: Wed
ta: அறிவன்

source: Wednesday
ta: புதன்கிழமை

source: Weekly (Monday)
ta: வாராந்திர (திங்கள்)

source: Weekly (Sunday)
ta: வாராந்திர (ஞாயிறு)

source: Widescreen
ta: அகலத்திரை

source: Wizard
ta: வழிகாட்டி

source: Would you like to save your changes?
ta: உங்கள் மாற்றங்களைச் சேமிக்க விரும்புகிறீர்களா?

source: Wrong parameter format 'set=%s'. Use set=set15
ta: தவறான அளவுரு வடிவம் 'SET =%s'. கணம் = Set15 ஐப் பயன்படுத்தவும்

source: Yes
ta: ஆம்

source: Yes/No
ta: ஆம்/இல்லை

source: Yesterday
ta: நேற்று

source: Zap
ta: சாப்

source: Zap & Record
ta: சாப் & பதிவு

source: Zap before streaming
ta: ச்ட்ரீமிங்கிற்கு முன் சாப்

source: Zap to
ta: Zap பெறுநர்

source: Zapped to
ta: பெறுநர்

source: any time
ta: எந்த நேரத்திலும்

source: auto
ta: தானி

source: case-insensitive
ta: வழக்கு-உணர்வற்ற

source: case-sensitive
ta: வழக்கு உணர்திறன்

source: descramble and record ecm
ta: டெச்கிராம்பிள் மற்றும் பதிவு ஈ.சி.எம்

source: description contains
ta: விளக்கம் உள்ளது

source: description match
ta: விளக்கம் போட்டி

source: disabled
ta: முடக்கப்பட்டது

source: do nothing
ta: எதுவும் செய்ய வேண்டாம்

source: don't descramble, record ecm
ta: டெச்கிராம்பிள் செய்ய வேண்டாம், ECM ஐ பதிவு செய்யுங்கள்

source: error! Loading Page
ta: பிழை! பக்கத்தை ஏற்றுகிறது

source: exact title match
ta: சரியான தலைப்பு போட்டி

source: favourite desc match
ta: பிடித்த DESC போட்டி

source: finished
ta: முடிந்தது

source: go to deep standby
ta: ஆழமான காத்திருப்புக்குச் செல்லுங்கள்

source: go to standby
ta: காத்திருப்புக்குச் செல்லுங்கள்

source: hour
ta: மணி

source: kB
ta: கே.பி.

source: loading
ta: ஏற்றுகிறது

source: manual/disabled
ta: கையேடு/முடக்கப்பட்டது

source: mins
ta: நிமிடங்கள்

source: minute
ta: நிமிடங்கள்

source: no description available
ta: எந்த விளக்கமும் கிடைக்கவில்லை

source: none/IPv4-only network
ta: எதுவுமில்லை/ஐபிவி 4-மட்டும் பிணையம்

source: normal
ta: சாதாரண

source: on day
ta: நாள்

source: on weekday
ta: வார நாளில்

source: one two three four unknown command
ta: ஒரு இரண்டு மூன்று நான்கு அறியப்படாத கட்டளை

source: partial title match
ta: பகுதி தலைப்பு போட்டி

source: record
ta: பதிவு

source: regex match (experimental)
ta: ரீசெக்ச் போட்டி (சோதனை)

source: running
ta: இயங்கும்

source: seconds
ta: நொடிகள்

source: select bouquets
ta: பூங்கொத்துகளைத் தேர்ந்தெடுக்கவும்

source: select channels
ta: சேனல்களைத் தேர்ந்தெடுக்கவும்

source: select tags
ta: குறிச்சொற்களைத் தேர்ந்தெடுக்கவும்

source: short description contains
ta: குறுகிய விளக்கத்தில் உள்ளது

source: short description match
ta: குறுகிய விளக்கம் போட்டி

source: standard
ta: தரநிலை

source: static
ta: நிலையான

source: this service is protected by a parental control pin
ta: இந்த பணி பெற்றோரின் கட்டுப்பாட்டு முள் மூலம் பாதுகாக்கப்படுகிறது

source: title contains
ta: தலைப்பு உள்ளது

source: title ends with
ta: தலைப்பு முடிவடைகிறது

source: title or description match
ta: தலைப்பு அல்லது விளக்கம் போட்டி

source: title or short description match
ta: தலைப்பு அல்லது குறுகிய விளக்கம் போட்டி

source: title starts with
ta: தலைப்பு தொடங்குகிறது

source: transcoded
ta: டிரான்ச்கோடட்

source: type %s is not a number
ta: வகை %s என்பது ஒரு எண் அல்ல

source: unknown
ta: தெரியவில்லை

source: using
ta: பயன்படுத்துகிறது

source: via
ta: வழிமம்

source: waiting
ta: காத்திருக்கிறது

source: weekday
ta: வார நாள்

source: weekend
ta: வார இறுதி

source: wrong filetype
ta: தவறான பைல்டைப்

source: zap
ta: சாப்

source: Add service name to stream information
ta: தகவல்களை ச்ட்ரீம் செய்ய பணி பெயரைச் சேர்க்கவும்

source: Allow IPK Upload
ta: ஐபிகே பதிவேற்ற அனுமதிக்கவும்

source: Debug - Display Tracebacks in browser
ta: பிழைத்திருத்தம் - உலாவியில் டிரேச்பேக்குகளைக் காண்பி

source: Disable remote access for user root
ta: பயனர் ரூட்டிற்கான தொலைநிலை அணுகலை முடக்கு

source: Enable Authentication for streaming
ta: ச்ட்ரீமிங்கிற்கான அங்கீகாரத்தை இயக்கவும்

source: Enable HTTP Authentication
ta: HTTP அங்கீகாரத்தை இயக்கவும்

source: Enable HTTPS
ta: HTTPS ஐ இயக்கவும்

source: Enable HTTPS Authentication
ta: HTTPS அங்கீகாரத்தை இயக்கவும்

source: Enable Parental Control
ta: பெற்றோரின் கட்டுப்பாட்டை இயக்கவும்

source: Enable access from VPNs
ta: VPN களில் இருந்து அணுகலை இயக்கவும்

source: HTTP port
ta: HTTP துறைமுகம்

source: HTTPS port
ta: HTTPS துறைமுகம்

source: OpenWebInterface Enabled
ta: OpenWebinterface இயக்கப்பட்டது

source: OpenWebif Configuration
ta: OpenWebif உள்ளமைவு

source: Playback IPTV Streams in browser
ta: உலாவியில் பிளேபேக் ஐபிடிவி ச்ட்ரீம்கள்

source: Require client cert for HTTPS
ta: HTTPS க்கு கிளையன்ட் சான்றிதழ் தேவை

source: Streaming port
ta: ச்ட்ரீமிங் துறைமுகம்

source: Use custom Color
ta: தனிப்பயன் நிறத்தைப் பயன்படுத்தவும்

source: Without auth only local access is allowed!
ta: ஏற்பு இல்லாமல் உள்ளக அணுகல் மட்டுமே அனுமதிக்கப்படுகிறது!
