Repository: 247i/TACETr
Catalog: உரை/தானி/e2openplugin-openwebif-e2openplugin-openwebif-*.po
Languages: ta

source: %02d.%02d.
ta: %02 டி.%02 டி.

source: %02d.%02d.%d
ta: %02 டி.%02 டி.%d

source: %02d:%02d
ta: %02 டி:%02 டி

source: %s %02d.%02d.
ta: %s %02d.

source: %s %s is locked.
ta: %s %s பூட்டப்பட்டுள்ளது.

source: %s Style
ta: %s பாணி

source: %s free / %s total
ta: %s இலவச / %s மொத்தம்

source: (Press 'shift' and click to 'hold')
ta: ('சிப்ட்' ஐ அழுத்தி 'ஓல்ட்' என்பதைக் சொடுக்கு செய்க)

source: (in minutes)
ta: (நிமிடங்களில்)

source: <Current movie list location>
ta: <தற்போதைய திரைப்பட பட்டியல் இடம்>

source: <Default movie location>
ta: <இயல்புநிலை திரைப்பட இருப்பிடம்>

source: <Last timer location>
ta: <கடைசி நேரங்குறிகருவி இடம்>

source: A filename is required
ta: ஒரு கோப்பு பெயர் தேவை

source: A value is required
ta: ஒரு மதிப்பு தேவை

source: About
ta: பற்றி

source: Add
ta: கூட்டு

source: Add AutoTimer to tags
ta: குறிச்சொற்களில் ஆட்டோடிமரைச் சேர்க்கவும்

source: Add AutoTimer name to tags
ta: குறிச்சொற்களில் ஆட்டோடிமர் பெயரைச் சேர்க்கவும்

source: Add Bouquet
ta: பூச்செண்டு சேர்க்கவும்

source: Add IPTV/URL
ta: ஐபிடிவி/url ஐச் சேர்க்கவும்

source: Add Marker
ta: மார்க்கரைச் சேர்க்கவும்

source: Add Spacer
ta: ச்பேசரைச் சேர்க்கவும்

source: Add a timer
ta: ஒரு டைமரைச் சேர்க்கவும்

source: Add a zap timer
ta: ஒரு சாப் டைமரைச் சேர்க்கவும்

source: Add an AutoTimer
ta: ஆட்டோடிமரைச் சேர்க்கவும்

source: Add channel(s) as alternate
ta: சேனல் (களை) மாற்றாக சேர்க்கவும்

source: Add filters
ta: வடிப்பான்களைச் சேர்க்கவும்

source: Add selection to bouquet
ta: பூச்செட்டில் தேர்வைச் சேர்க்கவும்

source: Add similar on conflict
ta: மோதலில் ஒத்ததைச் சேர்க்கவும்

source: Add tags to recordings
ta: பதிவுகளில் குறிச்சொற்களைச் சேர்க்கவும்

source: Added %s to alternative service %s.
ta: மாற்று சேவைக்கு %s சேர்க்கப்பட்டது %s.

source: After
ta: பிறகு

source: After event
ta: நிகழ்வுக்குப் பிறகு

source: All
ta: அனைத்தும்

source: All Channels
ta: அனைத்து சேனல்களும்

source: All Files of this Software are open source software; you can redistribute it and/or modify it under the terms of the GNU General Public License version 3 as published by the Free Software Foundation.
ta: இந்த மென்பொருளின் அனைத்து கோப்புகளும் திறந்த மூல மென்பொருள்; இலவச மென்பொருள் அறக்கட்டளை வெளியிட்டுள்ளபடி குனு பொது பொது உரிமம் பதிப்பு 3 இன் விதிமுறைகளின் கீழ் நீங்கள் அதை மறுபகிர்வு செய்யலாம் மற்றும்/அல்லது மாற்றலாம்.

source: All alternative services deleted.
ta: அனைத்து மாற்று சேவைகளும் நீக்கப்பட்டன.

source: Allow duplicates
ta: நகல்களை அனுமதிக்கவும்

source: Alternative %s created failed.
ta: மாற்று %s உருவாக்கப்பட்டவை.

source: Always
ta: எப்போதும்

source: Answer is NO!
ta: பதில் இல்லை!

source: Answer is YES!
ta: பதில் ஆம்!

source: Any
ta: ஏதேனும்

source: Any day
ta: எந்த நாள்

source: Any service/recording
ta: எந்த சேவை/பதிவு

source: April
ta: ப-சித்திரை

source: Are you sure you want to copy this recording?
ta: இந்த பதிவை நகலெடுக்க விரும்புகிறீர்களா?

source: Are you sure you want to delete the selected bouquet?
ta: தேர்ந்தெடுக்கப்பட்ட பூச்செண்டை நீக்க விரும்புகிறீர்களா?

source: Are you sure you want to delete the selected item(s)?
ta: தேர்ந்தெடுக்கப்பட்ட உருப்படி (களை) நீக்க விரும்புகிறீர்களா?

source: Are you sure you want to delete this AutoTimer?
ta: இந்த ஆட்டோடிமரை நீக்க விரும்புகிறீர்களா?

source: Are you sure you want to delete this recording?
ta: இந்த பதிவை நீக்க விரும்புகிறீர்களா?

source: Are you sure you want to delete this timer?
ta: இந்த டைமரை நீக்க விரும்புகிறீர்களா?

source: Are you sure you want to move this recording?
ta: இந்த பதிவை நகர்த்த விரும்புகிறீர்களா?

source: Are you sure you want to rename this recording?
ta: இந்த பதிவை மறுபெயரிட விரும்புகிறீர்களா?

source: Are you sure you want to restore from file?
ta: கோப்பிலிருந்து மீட்டெடுக்க விரும்புகிறீர்களா?

source: Are you sure you want to start recording instantly?
ta: நீங்கள் உடனடியாக பதிவு செய்யத் தொடங்க விரும்புகிறீர்களா?

source: Ask, default No
ta: கேளுங்கள், இயல்புநிலை எண்

source: Ask, default Yes
ta: கேளுங்கள், இயல்புநிலை ஆம்

source: Audio Encoding
ta: ஆடியோ குறியாக்கம்

source: Audio PID (APID)
ta: ஆடியோ பிஐடி (ஏபிஐடி)

source: Audio Track
ta: ஆடியோ டிராக்

source: August
ta: ஆ-ஆவணி

source: Authors
ta: ஆசிரியர்கள்

source: Auto
ta: தானி

source: AutoPoll
ta: தன்னியக்க

source: AutoTimer Edit
ta: ஆட்டோ நேரங்குறிகருவி திருத்து

source: AutoTimer Settings
ta: ஆட்டோடிமர் அமைப்புகள்

source: AutoTimers
ta: ஆட்டோடிமர்கள்

source: Autotimer Preview
ta: ஆட்டோடிமர் முன்னோட்டம்

source: BER
ta: பெர்

source: Back
ta: பின்

source: Background only
ta: பின்னணி மட்டுமே

source: Before
ta: முன்

source: Begin
ta: தொடங்கு

source: Begin of "After event" timespan
ta: "நிகழ்வுக்குப் பிறகு" டைம்ச்பான் தொடங்குகிறது

source: Beginning of timespan
ta: டைம்ச்பானின் துவக்கம்

source: Bit Error Rate (BER)
ta: பிட் பிழை விகிதம் (பெர்)

source: Bookmark
ta: புத்தககுறி

source: Bookmarks
ta: புக்மார்க்குகள்

source: Bouquet %s already exists.
ta: பூச்செண்டு %s ஏற்கனவே உள்ளன.

source: Bouquet %s can not be moved.
ta: பூச்செண்டு %களை நகர்த்த முடியாது.

source: Bouquet %s created.
ta: பூச்செண்டு %s உருவாக்கப்பட்டன.

source: Bouquet %s deleted.
ta: பூச்செண்டு %s நீக்கப்பட்டன.

source: Bouquet %s is locked.
ta: பூச்செண்டு %s பூட்டப்பட்டுள்ளன.

source: Bouquet %s is unlocked.
ta: பூச்செண்டு %s திறக்கப்படுகின்றன.

source: Bouquet %s moved.
ta: பூச்செண்டு %s நகர்ந்தன.

source: Bouquet %s removed failed, sevicerefence or mutable list is not valid.
ta: பூச்செண்டு %s நீக்கப்பட்டவை, செவிசெரெஃபென்ச் அல்லது மாற்றக்கூடிய பட்டியல் செல்லுபடியாகாது.

source: Bouquet %s removed failed.
ta: பூச்செண்டு %s அகற்றப்பட்டன.

source: Bouquet Editor
ta: பூச்செண்டு எடிட்டர்

source: Bouquet name
ta: பூச்செண்டு பெயர்

source: Bouquet renamed successfully.
ta: பூச்செண்டு வெற்றிகரமாக மறுபெயரிடப்பட்டது.

source: Bouquet-settings were restored successfully
ta: பூச்செண்டு-அமைப்புகள் வெற்றிகரமாக மீட்டெடுக்கப்பட்டன

source: BouquetEditor
ta: பூச்செடி எடிட்டர்

source: Bouquetlist is not editable!
ta: பூச்செண்டு பட்டியல் திருத்தக்கூடியது அல்ல!

source: Bouquets
ta: பூங்கொத்துகள்

source: Box
ta: பெட்டி

source: Box Control
ta: பெட்டி கட்டுப்பாடு

source: Box Info
ta: பெட்டி செய்தி

source: Box uptime
ta: பெட்டி நேரம்

source: Brand
ta: சூட்டுக்குறி

source: Build
ta: உருவாக்கு

source: Cable
ta: வடம்

source: Calendar Week
ta: காலண்டர் வாரம்

source: Cancel
ta: ரத்துசெய்

source: Cancelled
ta: ரத்து செய்யப்பட்டது

source: Capacity
ta: திறன்

source: Capture screenshot
ta: திரை சாட்டைப் பிடிக்கவும்

source: Channel
ta: வாய்க்கால்

source: Channels
ta: சேனல்கள்

source: Chipset
ta: சில்லுத்தொகுதி

source: Cleanup Timers
ta: தூய்மைப்படுத்தும் டைமர்கள்

source: Close
ta: மூடு

source: Common Settings
ta: பொதுவான அமைப்புகள்

source: Config
ta: கட்டமைப்பு

source: Conflicting Timer(s) detected! %s
ta: முரண்பட்ட நேரங்குறிகருவி (கள்) கண்டறியப்பட்டது! %s

source: Contributors
ta: பங்களிப்பாளர்கள்

source: Control
ta: கட்டுப்பாடு

source: Copy Recording
ta: நகல் பதிவு

source: Could not add timer '%s'!
ta: டைமரை '%s' சேர்க்க முடியவில்லை!

source: Could not find timer '%s' with given start and end time!
ta: கொடுக்கப்பட்ட தொடக்க மற்றும் இறுதி நேரத்துடன் டைமரை '%s' கண்டுபிடிக்க முடியவில்லை!

source: Create bouquet from selection
ta: தேர்விலிருந்து பூச்செண்டை உருவாக்கவும்

source: Current
ta: மின்னோட்ட்ம், ஓட்டம்

source: Current Event
ta: தற்போதைய நிகழ்வு

source: Currently recording
ta: தற்போது பதிவு செய்கிறது

source: Custom box name
ta: தனிப்பயன் பெட்டி பெயர்

source: Custom offset
ta: தனிப்பயன் ஆஃப்செட்

source: DHCP
ta: டி.எச்.சி.பி.

source: Date
ta: திகதி

source: Date (newest)
ta: தேதி (புதியது)

source: Date (oldest)
ta: தேதி (பழமையானது)

source: December
ta: கா-மார்கழி

source: Deep Standby
ta: ஆழமான காத்திருப்பு

source: Default
ta: இயல்புநிலை

source: Delay Standby
ta: தாமதமாக காத்திருப்பு

source: Delete
ta: நீக்கு

source: Delete Bookmark
ta: புத்தகக்குறியை நீக்கு

source: Delete Bouquet
ta: பூச்செண்டை நீக்கு

source: Delete Recording
ta: பதிவை நீக்கு

source: Delete Timer
ta: டைமரை நீக்கு

source: Deleted
ta: நீக்கப்பட்டது

source: Description
ta: விவரம்

source: Device
ta: சாதனம்

source: Disable
ta: முடக்கு

source: Disable Timer
ta: டைமரை முடக்கு

source: Disabled on conflict
ta: மோதலில் முடக்கப்பட்டது

source: Display Mode
ta: காட்சி முறை

source: Display duration (s)
ta: காட்சி காலம் (கள்)

source: Distro
ta: டிச்ட்ரோ

source: Dolby
ta: டால்பி

source: Done
ta: முடிந்தது

source: Download
ta: பதிவிறக்கம்

source: Download playlist for
ta: பிளேலிச்ட்டைப் பதிவிறக்கவும்

source: Drivers
ta: ஓட்டுநர்கள்

source: Duration
ta: காலம்

source: E
ta: இ

source: EPG
ta: எப்சி

source: EPG encoding
ta: ஈபிசி குறியாக்கம்

source: ERROR: Cannot set SleepTimer while device is in Standby-Mode
ta: பிழை: சாதனம் காத்திருப்பு-பயன்முறையில் இருக்கும்போது ச்லீப் டைமரை அமைக்க முடியாது

source: Edit
ta: தொகு

source: Edit Recording
ta: பதிவைத் திருத்து

source: Edit Timer
ta: நேரத்தைத் திருத்து

source: Editor
ta: திருத்தி

source: Enable
ta: இயக்கு

source: Enable Messages
ta: செய்திகளை இயக்கவும்

source: Enable Timer
ta: டைமரை இயக்கவும்

source: Enable filtering
ta: வடிகட்டலை இயக்கவும்

source: Enable/Disable Screenshot on key press
ta: முக்கிய பத்திரிகைகளில் திரை சாட்டை இயக்கவும்/முடக்கவும்

source: Enabled
ta: இயக்கப்பட்டது

source: Encrypted
ta: குறியாக்கப்பட்டது

source: End
ta: முடிவு

source: End of "After event" timespan
ta: "நிகழ்வுக்குப் பிறகு" டைம்ச்பான் முடிவு

source: End of timespan
ta: நேரச்பானின் முடிவு

source: Enter a name for the new bouquet
ta: புதிய பூச்செண்டுக்கு ஒரு பெயரை உள்ளிடவும்

source: Enter a name for the new marker
ta: புதிய மார்க்கருக்கு ஒரு பெயரை உள்ளிடவும்

source: Enter a name for this AutoTimer
ta: இந்த ஆட்டோடிமருக்கு ஒரு பெயரை உள்ளிடவும்

source: Enter path
ta: பாதையை உள்ளிடவும்

source: Enter text
ta: உரையை உள்ளிடவும்

source: Enter the text to find in the EPG
ta: EPG இல் கண்டுபிடிக்க உரையை உள்ளிடவும்

source: Error
ta: பிழை

source: Error parsing vps.xml
ta: Vps.xml ஐ பாகுபடுத்துவதில் பிழை

source: Error upload File
ta: பிழை பதிவேற்றும் கோப்பு

source: Error while preparing backup file.
ta: காப்புப்பிரதி கோப்பைத் தயாரிக்கும் போது பிழை.

source: Error writing File
ta: கோப்பு எழுதுதல் கோப்பு

source: Error, %s does not exists, restore is not possible...
ta: பிழை, %s இல்லை, மீட்டமைப்பது சாத்தியமில்லை ...

source: Error, %s was not created with WebBouquetEditor...
ta: பிழை, வெப் ப ouquetediter உடன் %s உருவாக்கப்படவில்லை ...

source: Error, extract files from backup '%s'
ta: பிழை, '%s' காப்புப்பிரதியிலிருந்து கோப்புகளைப் பிரித்தெடுக்கவும்

source: Error: Bouquet %s could not deleted, OSError.
ta: பிழை: பூச்செண்டு %s நீக்க முடியவில்லை, ஒச்ரர்.

source: Event not found
ta: நிகழ்வு கிடைக்கவில்லை

source: EventId not found
ta: EventID கண்டுபிடிக்கப்படவில்லை

source: Every
ta: ஒவ்வொன்றும்

source: Exclude when
ta: எப்போது விலக்கு

source: Execute "After event" during timespan
ta: டைம்ச்பானின் போது "நிகழ்வுக்குப் பிறகு" செயல்படுத்தவும்

source: Export
ta: ஏற்றுமதி

source: Extras
ta: கூடுதல்

source: Fake Recording
ta: போலி பதிவு

source: Fastscan
ta: ஃபாச்ட்ச்கான்

source: February
ta: தை-மாசி

source: Find similar events
ta: இதே போன்ற நிகழ்வுகளைக் கண்டறியவும்

source: Firmware version
ta: ஃபார்ம்வேர் பதிப்பு

source: Folders
ta: கோப்புறைகள்

source: Force
ta: ஆற்றல்

source: Free
ta: இலவசம்

source: Free Memory
ta: இலவச நினைவகம்

source: Free space
ta: வெற்று இடம்

source: Fri
ta: வெள்ளி

source: Friday
ta: வெள்ளிக்கிழமை

source: From date
ta: தேதியிலிருந்து

source: Front processor version
ta: முன் செயலி பதிப்பு

source: Full remote
ta: முழு தொலைநிலை

source: GB
ta: சிபி

source: GUI version
ta: GUI பதிப்பு

source: Gateway
ta: நுழைவாயில்

source: Get mutable list for new created alternative failed!
ta: புதிய உருவாக்கப்பட்ட மாற்று தோல்வியுற்றதற்கு மாற்றக்கூடிய பட்டியலைப் பெறுங்கள்!

source: Get mutable list for new created bouquet failed!
ta: புதிய உருவாக்கப்பட்ட பூச்செண்டுக்கு மாற்றக்கூடிய பட்டியலைப் பெறுங்கள்!

source: HH:MM
ta: HH: மிமீ

source: Hard disk model
ta: ஆர்ட் டிச்க் மாதிரி

source: Hardware
ta: வன்பொருள்

source: Hide full remote
ta: முழு தொலைதூரத்தை மறைக்கவும்

source: High Resolution
ta: உயர் தெளிவுத்திறன்

source: Hold to drag
ta: இழுக்க பிடிக்கவும்

source: Hour
ta: மணி

source: IPTV / URL name
ta: IPTV / முகவரி பெயர்

source: IPv4 address
ta: ஐபிவி 4 முகவரி

source: IPv4-only Python/Twisted
ta: Ipv4-மட்டும் பைதான்/முறுக்கப்பட்ட

source: IPv4-only kernel
ta: IPv4-மட்டும் கர்னல்

source: IPv6 address(es)
ta: IPv6 முகவரி (ES)

source: Import
ta: இறக்குமதி

source: Include description
ta: விளக்கத்தை சேர்க்கவும்

source: Include extended description
ta: நீட்டிக்கப்பட்ட விளக்கத்தை சேர்க்கவும்

source: Include short description
ta: குறுகிய விளக்கத்தை சேர்க்கவும்

source: Include when
ta: எப்போது சேர்க்கவும்

source: Infinite Instant recording started
ta: எல்லையற்ற உடனடி பதிவு தொடங்கியது

source: Info
ta: தகவல்

source: Information
ta: தகவல்

source: Inherit AutoTimer
ta: ஆட்டோடிமரை வாரிசு

source: Install Package
ta: தொகுப்பை நிறுவவும்

source: Installed
ta: நிறுவப்பட்டது

source: Instant Record
ta: உடனடி பதிவு

source: Instant record for current Event started
ta: தற்போதைய நிகழ்வுக்கான உடனடி பதிவு தொடங்கியது

source: Internal error!
ta: உள் பிழை!

source: Internal flash memory
ta: உள் ஃபிளாச் நினைவகம்

source: Interval (in %s)
ta: இடைவெளி ( %s இல்)

source: Interval (min.)
ta: இடைவெளி (நிமிடம்.)

source: Interval (sec.)
ta: இடைவெளி (நொடி.)

source: January
ta: மா-தை

source: Javascript Libraries
ta: சாவாச்கிரிப்ட் நூலகங்கள்

source: July
ta: ஆ-ஆடி

source: June
ta: வை-ஆனி

source: Just play
ta: விளையாடுங்கள்

source: Kernel
ta: கர்னல்

source: LCD
ta: எல்.சி.டி.

source: LCD4Linux Setup
ta: LCD4Linux அமைப்பு

source: Label series
ta: சிட்டை தொடர்

source: License
ta: உரிமம்

source: Link speed
ta: இணைப்பு விரைவு

source: List of Timers has been cleaned
ta: டைமர்களின் பட்டியல் தூய்மை செய்யப்பட்டுள்ளது

source: Loading...
ta: ஏற்றுகிறது ...

source: Location
ta: இடம்

source: Locked
ta: பூட்டப்பட்டுள்ளது

source: MAC address
ta: மேக் முகவரி

source: MB
ta: எம்பி

source: Main
ta: முக்கிய

source: Main memory
ta: முதன்மையான நினைவகம்

source: March
ta: மா-பங்குனி

source: Margin
ta: விளிம்பு

source: Marker added.
ta: மார்க்கர் சேர்க்கப்பட்டது.

source: Marker name
ta: மார்க்கர் பெயர்

source: Match text
ta: உரை பொருந்தவும்

source: Max Days
ta: அதிகபட்ச நாட்கள்

source: May
ta: சி-வைகாசி

source: Message sent successfully!
ta: செய்தி வெற்றிகரமாக அனுப்பப்பட்டது!

source: Method
ta: முறை

source: Minimal EPG list
ta: குறைந்தபட்ச ஈபிசி பட்டியல்

source: Minimal movie list
ta: குறைந்தபட்ச திரைப்பட பட்டியல்

source: Minimal timer list
ta: குறைந்தபட்ச நேரங்குறிகருவி பட்டியல்

source: Minute
ta: நிமிடங்கள்

source: Missing mandatory parameter '%s'
ta: கட்டாய அளவுருவைக் காணவில்லை '%s'

source: Missing request parameter: sRef
ta: கோரிக்கை அளவுரு: SREF

source: Mo
ta: மோ

source: Model
ta: மாதிரியுரு

source: Mon
ta: தி

source: Monday
ta: திங்கள்

source: Monthly
ta: மாதாந்திர

source: More
ta: மேலும்

source: More details
ta: மேலும் விவரங்கள்

source: Mount point
ta: மவுண்ட் புள்ளி

source: Move Recording
ta: பதிவை நகர்த்தவும்

source: Movie database for EPG
ta: EPG க்கான திரைப்பட தரவுத்தளம்

source: Movielist
ta: மூவிச்ட்

source: Movies
ta: திரைப்படங்கள்

source: Multi-Bouquet is not enabled!
ta: மல்டி-பூங்கொத்துகள் இயக்கப்படவில்லை!

source: MultiEPG
ta: மல்டிபிக்

source: Mute/Unmute
ta: முடக்கு/அசைவு

source: Name
ta: பெயர்

source: Name (a-z)
ta: பெயர் (A-Z)

source: Name (z-a)
ta: பெயர் (Z-A)

source: Namespace
ta: பெயர்வெளி

source: Network Interface
ta: பிணைய இடைமுகம்

source: Network Shares
ta: பிணையம் பங்குகள்

source: Never
ta: ஒருபோதும்

source: New
ta: புதிய

source: New Bookmark:
ta: புதிய புக்மார்க்கு:

source: New Name
ta: புதிய பெயர்

source: Next Event
ta: அடுத்த நிகழ்வு

source: No
ta: இல்லை

source: No EPG data available.
ta: ஈபிசி தரவு எதுவும் கிடைக்கவில்லை.

source: No Parent Control Setup Pin given!
ta: பெற்றோர் கட்டுப்பாட்டு அமைவு முள் எதுவும் கொடுக்கப்படவில்லை!

source: No answer in time
ta: சரியான நேரத்தில் பதில் இல்லை

source: No bouquet given!
ta: பூச்செண்டு எதுவும் கொடுக்கப்படவில்லை!

source: No bouquet name given!
ta: பூச்செண்டு பெயர் எதுவும் கொடுக்கப்படவில்லை!

source: No current service given!
ta: தற்போதைய பணி எதுவும் கொடுக்கப்படவில்லை!

source: No event found! Not recording!
ta: எந்த நிகழ்வும் கிடைக்கவில்லை! பதிவு செய்யவில்லை!

source: No marker-name given!
ta: மார்க்கர் பெயர் கொடுக்கப்படவில்லை!

source: No matches were found in the EPG
ta: ஈபிசியில் போட்டிகள் எதுவும் காணப்படவில்லை

source: No matching Timer found
ta: பொருந்தக்கூடிய நேரங்குறிகருவி எதுவும் கிடைக்கவில்லை

source: No network connection
ta: பிணைய இணைப்பு இல்லை

source: No new servicename given!
ta: புதிய சேவைப் பெயர் எதுவும் கொடுக்கப்படவில்லை!

source: No position given!
ta: எந்த நிலையும் கொடுக்கப்படவில்லை!

source: No provider given!
ta: எந்த வழங்குநரும் கொடுக்கப்படவில்லை!

source: No service given!
ta: எந்த சேவையும் கொடுக்கப்படவில்லை!

source: No, cancel
ta: இல்லை, ரத்துசெய்

source: None
ta: எதுவுமில்லை

source: Nothing
ta: எதுவும் இல்லை

source: Nothing playing.
ta: எதுவும் விளையாடுவதில்லை.

source: Notify if Conflict
ta: மோதல் இருந்தால் அறிவிக்கவும்

source: Notify if Similar
ta: ஒத்திருந்தால் அறிவிக்கவும்

source: November
ta: ஐ-கார்த்திகை

source: Now
ta: இப்போது

source: Now/Next Columns
ta: இப்போது/அடுத்த நெடுவரிசைகள்

source: Number of recordings remaining
ta: மீதமுள்ள பதிவுகளின் எண்ணிக்கை

source: ONID
ta: தவிர

source: October
ta: பு-ஐப்பசி

source: Offset after recording (mins)
ta: பதிவுசெய்த பிறகு ஆஃப்செட் (பொருள்)

source: Offset before recording (mins)
ta: பதிவு செய்வதற்கு முன் ஆஃப்செட் (நிமிடங்கள்)

source: On
ta: ஆன்

source: On any service
ta: எந்தவொரு சேவையிலும்

source: On same service
ta: அதே சேவையில்

source: Only match between dates
ta: தேதிகளுக்கு இடையில் மட்டுமே பொருந்தும்

source: Only match during timespan
ta: டைம்ச்பானின் போது மட்டுமே பொருந்துகிறது

source: Oops, no results matched your search
ta: அச்சச்சோ, எந்த முடிவுகளும் உங்கள் தேடலுடன் பொருந்தவில்லை

source: Oops...
ta: அச்சச்சோ ...

source: Open Source Web Interface for Linux set-top box
ta: லினக்ச் செட்-டாப் பெட்டிக்கான மூல வலை இடைமுகத்தைத் திறக்கவும்

source: Open in new window
ta: புதிய சாளரத்தில் திறக்கவும்

source: OpenWebif Browser Settings
ta: OpenWebif உலாவி அமைப்புகள்

source: OpenWebif Settings
ta: OpenWebif அமைப்புகள்

source: Orbital Position
ta: சுற்றுப்பாதை நிலை

source: Override found with alternative service
ta: மாற்று சேவையுடன் மேலெழுதல் காணப்படுகிறது

source: PCR PID
ta: பி.சி.ஆர் பிஐடி

source: PMT PID
ta: பிஎம்டி பிஐடி

source: Packages
ta: தொகுப்பு

source: Parent Control Setup Pin is wrong!
ta: பெற்றோர் கட்டுப்பாட்டு அமைவு முள் தவறு!

source: Parent Control is not activated.
ta: பெற்றோர் கட்டுப்பாடு செயல்படுத்தப்படவில்லை.

source: Parse AutoTimer
ta: Parese self -mider

source: PiP
ta: பிப்

source: Picture in Picture
ta: படத்தில் படம்

source: Picture in Picture (hidden)
ta: படத்தில் படம் (மறைக்கப்பட்டுள்ளது)

source: Plain
ta: வெற்று

source: Playback
ta: பின்னணி

source: Playlist
ta: பிளேலிச்ட்

source: Playlist format
ta: பிளேலிச்ட் வடிவம்

source: Power Control
ta: ஆற்றல் கட்டுப்பாடு

source: PowerTimer feature not available
ta: பவர்டிமர் நற்பொருத்தம் கிடைக்கவில்லை

source: Preview
ta: முன்னோட்டம்

source: Primetimes
ta: பிரைம் டைம்ச்

source: Process
ta: செயல்முறை

source: Provider
ta: வழங்குநர்

source: Providers
ta: வழங்குநர்கள்

source: REC
ta: ரெக்

source: Radio
ta: வானொலி

source: Reboot Box
ta: பெட்டியை மறுதொடக்கம் செய்யுங்கள்

source: Receiver
ta: பெறுவி

source: Record a maximum of # times
ta: அதிகபட்சம் # முறை பதிவு செய்யுங்கள்

source: Recording
ta: பதிவு

source: Recording Type
ta: பதிவு வகை

source: Refresh
ta: புதுப்பிப்பு

source: Refresh Timer
ta: டைமரை புதுப்பிக்கவும்

source: Refresh automatically every
ta: ஒவ்வொன்றும் தானாகவே புதுப்பிக்கவும்

source: Refresh now
ta: இப்போது புதுப்பிக்கவும்

source: Reload
ta: ஏற்றவும்

source: Remote
ta: தொலைநிலை

source: Remove Package
ta: தொகுப்பை அகற்று

source: Remove filter
ta: வடிகட்டியை அகற்று

source: Rename
ta: மறுபெயரிடுங்கள்

source: Rename Bouquet
ta: பூச்செண்டு மறுபெயரிடுங்கள்

source: Rename Recording
ta: பதிவை மறுபெயரிடுங்கள்

source: Repeated
ta: மீண்டும் மீண்டும்

source: Require description to be unique
ta: விளக்கம் தனித்துவமாக இருக்க வேண்டும்

source: Reset
ta: மீட்டமை

source: Reset count
ta: எண்ணிக்கையை மீட்டமை

source: Restart GUI
ta: GUI ஐ மறுதொடக்கம் செய்யுங்கள்

source: Restrict to bouquets
ta: பூங்கொத்துகளுக்கு கட்டுப்படுத்துங்கள்

source: Restrict to channels
ta: சேனல்களுக்கு கட்டுப்படுத்துங்கள்

source: Root
ta: மூலம்

source: SLAAC
ta: ச்லாக்

source: SNR
ta: எச்.என்.ஆர்

source: SRef
ta: சச்ட்

source: Sa
ta: ச

source: Safe mode
ta: பாதுகாப்பான பயன்முறை

source: Sat
ta: காரி

source: Satellites
ta: செயற்கைக்கோள்கள்

source: Satfinder
ta: சாட்ஃபைண்டர்

source: Saturday
ta: காரிக்கிழமை

source: Save
ta: சேமி

source: Screenshot
ta: திரைக்காட்சி

source: Search
ta: தேடல்

source: Search CSFD
ta: CSFD ஐத் தேடுங்கள்

source: Search EPG
ta: EPG ஐத் தேடுங்கள்

source: Search IMDb
ta: IMDB ஐத் தேடுங்கள்

source: Search KinoPoisk
ta: கினோபோயிச்கைத் தேடுங்கள்

source: Search TV Guide UK
ta: தேடல் தொலைக்காட்சி வழிகாட்டி யுகே

source: Search by name, sd / hd / uhd, or provider
ta: பெயர், எச்டி / எச்டி / யுஎச்.டி அல்லது வழங்குநர் மூலம் தேடுங்கள்

source: Search strictness
ta: கண்டிப்பைத் தேடுங்கள்

source: Search type
ta: தேடல் வகை

source: Select Directory
ta: கோப்பகத்தைத் தேர்ந்தெடு

source: Select IPK file for upload
ta: பதிவேற்ற ஐபிகே கோப்பைத் தேர்ந்தெடுக்கவும்

source: Select...
ta: தேர்ந்தெடுக்கவும் ...

source: Send
ta: அனுப்பு

source: Send Message
ta: செய்தி அனுப்பவும்

source: Send a Message
ta: ஒரு செய்தியை அனுப்பவும்

source: September
ta: ஆ-புரட்டாசி

source: Service
ta: பணி

source: Service %s added.
ta: பணி %s சேர்க்கப்பட்டது.

source: Service %s already exists in bouquet %s.
ta: பணி ஏற்கனவே பூங்கொத்துகளில் உள்ளது.

source: Service %s can not be removed.
ta: பணி %களை அகற்ற முடியாது.

source: Service %s is locked.
ta: பணி %s பூட்டப்பட்டுள்ளன.

source: Service %s is unlocked.
ta: பணி %s திறக்கப்படுகின்றன.

source: Service %s moved.
ta: பணி %s நகர்ந்தன.

source: Service %s removed from bouquet %s.
ta: பணி %s பூச்செண்டு %s இலிருந்து அகற்றப்பட்டன.

source: Service %s removed.
ta: பணி %s அகற்றப்பட்டன.

source: Service ID (SID)
ta: பணி ஐடி (எச்ஐடி)

source: Service can not be moved.
ta: சேவையை நகர்த்த முடியாது.

source: Service can not be renamed.
ta: சேவையை மறுபெயரிட முடியாது.

source: Service is not an alternative.
ta: பணி ஒரு மாற்று அல்ல.

source: Service renamed successfully.
ta: பணி வெற்றிகரமாக மறுபெயரிடப்பட்டது.

source: Services
ta: சேவைகள்

source: Serving stream
ta: பணி ச்ட்ரீம்

source: Set maximum duration
ta: அதிகபட்ச கால அளவை அமைக்கவும்

source: Settings
ta: அமைப்புகள்

source: Show EPG History
ta: ஈபிசி வரலாற்றைக் காட்டு

source: Show EPG for
ta: EPG ஐக் காட்டு

source: Show Full OpenWebif
ta: முழு ஓபன்வெபிஃப் காட்டு

source: Show IPTV channels in selection (eg. Autotimer)
ta: தேர்வில் ஐபிடிவி சேனல்களைக் காட்டு (எ.கா. ஆட்டோடிமர்)

source: Show all packages
ta: அனைத்து தொகுப்புகளையும் காட்டு

source: Show box name in header
ta: தலைப்பில் பெட்டி பெயரைக் காட்டு

source: Show details
ta: விவரங்களைக் காட்டு

source: Show full remote
ta: முழு தொலைதூரத்தைக் காட்டு

source: Show in Extensions menu
ta: நீட்டிப்பு பட்டியலில் காண்பி

source: Show picon background
ta: பிகான் பின்னணியைக் காட்டு

source: Show picons
ta: பிக்கன்களைக் காட்டு

source: Show picons in channel list
ta: சேனல் பட்டியலில் பிகன்களைக் காட்டு

source: Show service type in channel list
ta: சேனல் பட்டியலில் பணி வகையைக் காட்டு

source: Shutdown
ta: பணிநிறுத்தம்

source: Shutdown after refresh.
ta: புதுப்பித்த பிறகு பணிநிறுத்தம்.

source: Signal Power (AGC)
ta: சமிக்ஞை ஆற்றல் (AGC)

source: Signal Quality (SNR DB)
ta: சமிக்ஞை தகுதி (எச்.என்.ஆர் டி.பி.)

source: Signal Quality (SNR)
ta: சமிக்ஞை தகுதி (எச்.என்.ஆர்)

source: Simulate
ta: உருவகப்படுத்துங்கள்
