Repository: 247i/TACETr
Catalog: உரை/தானி/easyrepost-android-*.po
Languages: ta

# action_settings
source: Settings
ta: அமைப்புகள்

# action_open_instagram
source: Instagram
ta: இன்ச்டாகிராம்

# action_help
source: help
ta: உதவி

# error_private_posts_no_support
source: This appears to be a private post which is currently not supported
ta: இது தற்போது ஆதரிக்கப்படாத ஒரு தனியார் இடுகையாகத் தோன்றுகிறது

# view_details
source: Repost now…
ta: இப்போது மறுபதிவு…

# heads_up_share
source: Share…
ta: பகிர்ந்து கொள்ளுங்கள்…

# title_activity_settings
source: Settings
ta: அமைப்புகள்

# app_intro
source: Intro
ta: அறிமுகம்

source: Post Thumbnail
ta: சிறுபடத்தை இடுங்கள்

# post_share_button
source: SHARE
ta: பங்கு

# post_repost_button
source: REPOST
ta: மறுபரிசீலனை

# pref_section_general
source: General
ta: பொது

# pref_section_info
source: App Info
ta: பயன்பாட்டு செய்தி

# pref_title_caption
source: Custom Caption
ta: தனிப்பயன் தலைப்பு

# pref_default_caption
source: #Repost %username% with @instarepost2016%nl%・・・%nl%%caption%
ta: @Instarepost2016%nl%・・・%nl %% தலைப்பு%உடன் #ரீபோச்ட்%பயனர்பெயர்%

# pref_title_persistent_clipboard
source: Persistent Clipboard Listener
ta: தொடர்ச்சியான கிளிப்போர்டு கேட்பவர்

# pref_description_persistent_clipboard
source: If disabled this app will stop listening for Instagram URLs once closed. This will conserve battery, however you will need to start this app every time you want to repost or download from Instagram.
ta: முடக்கப்பட்டால், இந்த பயன்பாடு இன்ச்டாகிராம் முகவரி களைக் கேட்பதை நிறுத்திவிடும். இது பேட்டரியைப் பாதுகாக்கும், இருப்பினும் நீங்கள் இன்ச்டாகிராமில் இருந்து மறுபிரசுரம் செய்ய அல்லது பதிவிறக்கம் செய்ய விரும்பும் ஒவ்வொரு முறையும் இந்த பயன்பாட்டைத் தொடங்க வேண்டும்.

# pref_title_multiple_repost_intent
source: Multiple Notifications
ta: பல அறிவிப்புகள்

# pref_description_multiple_repost_intent
source: If enabled a new notification will be triggered for each repost/download
ta: இயக்கப்பட்டால் ஒவ்வொரு மறுபதிவு/பதிவிறக்கத்திற்கும் புதிய அறிவிப்பு தூண்டப்படும்

# intro_slide1_title
source: Welcome
ta: வரவேற்கிறோம்

# intro_slide1_description
source: Thank you for downloading Easy Repost. In order for Easy Repost to download photos and videos it must be running in the background. Make sure you start Easy Repost before you try to save photos or videos in Instagram.
ta: எளிதான மறுபதிப்பு பதிவிறக்கியதற்கு நன்றி. புகைப்படங்கள் மற்றும் வீடியோக்களை எளிதாக மறுபரிசீலனை செய்ய இது பின்னணியில் இயங்க வேண்டும். இன்ச்டாகிராமில் புகைப்படங்கள் அல்லது வீடியோக்களைச் சேமிக்க முயற்சிக்கும் முன் எளிதான மறுபிரவேசத்தைத் தொடங்குவதை உறுதிசெய்க.

# intro_slide2_title
source: Open Instagram
ta: இன்ச்டாகிராம் திறந்த

# intro_slide2_description
source: In Instagram find a photo or video you want to download. Click on the three dots in the top right of the post.
ta: இன்ச்டாகிராமில் நீங்கள் பதிவிறக்க விரும்பும் புகைப்படம் அல்லது வீடியோவைக் கண்டறியவும். இடுகையின் மேல் வலதுபுறத்தில் உள்ள மூன்று புள்ளிகளைக் சொடுக்கு செய்க.

# intro_slide3_title
source: Share to…
ta: பகிர்ந்து கொள்ளுங்கள்…

# intro_slide3_description
source: Click Share to… and select this App.
ta: பகிர்வு என்பதைக் சொடுக்கு செய்து… இந்த பயன்பாட்டைத் தேர்ந்தெடுக்கவும்.

# intro_slide4_title
source: Repost
ta: மறுபரிசீலனை

# intro_slide4_description
source: You will now receive a notification on which you can click to Repost. Optionally you can also repost from within the Easy Repost App. All media is also downloaded to your device in the instarepost folder.
ta: நீங்கள் இப்போது ஒரு அறிவிப்பைப் பெறுவீர்கள், அதில் நீங்கள் மறுபதிவு செய்ய சொடுக்கு செய்யலாம். விருப்பமாக நீங்கள் எளிதான மறுபதிப்பு பயன்பாட்டிலிருந்து மீண்டும் இடமாற்றம் செய்யலாம். அனைத்து ஊடகங்களும் இன்ச்டார்போச்ட் கோப்புறையில் உங்கள் சாதனத்திற்கு பதிவிறக்கம் செய்யப்பட்டுள்ளன.

# intro_slide5_title
source: Paste Caption
ta: தலைப்பு தலைப்பு

# intro_slide5_description
source: Once you have adjusted the Photo or Video you can also add back the Caption. Press and Hold on the caption field, then tap on Paste.
ta: நீங்கள் புகைப்படம் அல்லது வீடியோவை சரிசெய்தவுடன், தலைப்பையும் மீண்டும் சேர்க்கலாம். தலைப்பு புலத்தை அழுத்திப் பிடித்துக் கொள்ளுங்கள், பின்னர் பேச்டைத் தட்டவும்.

# intro_slide6_title
source: Custom Caption
ta: தனிப்பயன் தலைப்பு

# intro_slide6_description
source: To customize the caption click on settings
ta: தலைப்பைத் தனிப்பயனாக்க அமைப்புகளைக் சொடுக்கு செய்க

# intro_slide7_title
source: Custom Caption
ta: தனிப்பயன் தலைப்பு

# intro_slide7_description
source: Select caption
ta: தலைப்பைத் தேர்ந்தெடுக்கவும்

# intro_slide8_title
source: Custom Caption
ta: தனிப்பயன் தலைப்பு

# intro_slide8_description
source: Use %username% to get the original username, %nl% for a new line (line break) and %caption% to get the original caption.
ta: அசல் பயனர்பெயரைப் பெற % பயனர்பெயர் %, புதிய வரிக்கு % என்.எல் % மற்றும் அசல் தலைப்பைப் பெற % தலைப்பு % பயன்படுத்தவும்.

# help_card_title
source: Welcome
ta: வரவேற்கிறோம்

# help_card_info
source: Click {fa-instagram} above and find a photo or video you want to download in Instagram. In Instagram click {fa-ellipsis-v} on the top right of the photo/video you want to download/repost and select 'Share to.'. Then select Easy Repost from the list. For help click on the {fa-question} above.
ta: மேலே உள்ள {fa-instagram} என்பதைக் சொடுக்கு செய்து, இன்ச்டாகிராமில் நீங்கள் பதிவிறக்க விரும்பும் புகைப்படம் அல்லது வீடியோவைக் கண்டுபிடி. Instagram இல், நீங்கள் பதிவிறக்கம்/மறுபதிவு செய்ய விரும்பும் புகைப்படம்/வீடியோவின் மேல் வலதுபுறத்தில் {fa-elipsis-v} சொடுக்கு செய்து 'பகிர்' என்பதைத் தேர்ந்தெடுக்கவும். பட்டியலிலிருந்து எளிதான மறுபதிப்பு இடுகையைத் தேர்ந்தெடுக்கவும். உதவிக்கு மேலே உள்ள {fa-question} இல் சொடுக்கு செய்க.

source: Build version
ta: பதிப்பை உருவாக்குங்கள்

# toast_please_install_instagram
source: Please install Instagram
ta: Instagram ஐ நிறுவவும்

# toast_launching_instagram
source: Launching Instagram
ta: இன்ச்டாகிராம் தொடங்குகிறது

# toast_not_a_valid_instagram_uri
source: Not a valid Instagram URL:
ta: செல்லுபடியாகும் இன்ச்டாகிராம் முகவரி அல்ல:

# dialog_are_you_sure_you_want_to_delete
source: Are you sure you want to delete this item?
ta: இந்த உருப்படியை நீக்க விரும்புகிறீர்களா?

# dialog_are_you_sure_you_want_to_delete_all
source: Are you sure you want to clear the database?
ta: தரவுத்தளத்தை அழிக்க விரும்புகிறீர்களா?

# dialog_yes
source: Yes
ta: ஆம்

# dialog_no
source: No
ta: இல்லை

# rate_card_state1_question
source: Enjoying Easy Repost?
ta: எளிதான மறுபதிவு அனுபவிக்கிறீர்களா?

# rate_card_state2_question
source: How about a rating on the Play Store, then?
ta: பிளே ச்டோரில் ஒரு மதிப்பீடு எப்படி?

# rate_card_state3_question
source: Would you mind giving us some feedback?
ta: எங்களுக்கு சில கருத்துக்களைத் தருவீர்களா?

# rate_card_btn_not_really
source: Not really
ta: உண்மையில் இல்லை

# rate_card_btn_yes
source: Yes!
ta: ஆம்!

# rate_card_btn_ok_sure
source: Ok, sure
ta: சரி, நிச்சயமாக

# rate_card_btn_no_thanks
source: No, thanks
ta: இல்லை, நன்றி

# feedback_subject
source: Feedback
ta: கருத்து

# feedback_chooser
source: Send Feedback:
ta: கருத்துக்களை அனுப்பவும்:

source: Send to
ta: அனுப்பவும்

# channel_name
source: Easy Repost
ta: எளிதான மறுபதிவு

# channel_description
source: Easy Reposter notifications
ta: எளிதான பதிவு அறிவிப்புகள்

# clear_all_data
source: Clear Database
ta: தரவுத்தளத்தை அழிக்கவும்

# clear_all_data_desc
source: This will delete all data easy repost has captured. Photos and videos on device will not be deleted. They will only be remove from this app.
ta: இது ஈசி ரெபோச்ட் கைப்பற்றிய எல்லா தரவையும் நீக்கிவிடும். சாதனத்தில் உள்ள புகைப்படங்கள் மற்றும் வீடியோக்கள் நீக்கப்படாது. அவை இந்த பயன்பாட்டிலிருந்து மட்டுமே அகற்றப்படும்.

# file_exists
source: This image already exists on this device. Please remove it to download it again.
ta: இந்த படம் ஏற்கனவே இந்த சாதனத்தில் உள்ளது. அதை மீண்டும் பதிவிறக்க அதை அகற்றவும்.

# action_open_folder
source: Folder
ta: கோப்புறை

# retry_button
source: Retry
ta: மீண்டும் முயற்சிக்கவும்

source: Download Failed
ta: பதிவிறக்கம் தோல்வியடைந்தது

source: Download Pending
ta: பதிவிறக்கம் நிலுவையில் உள்ளது

# pref_title_jump_back_to_instagram
source: Jump back to Instagram
ta: இன்ச்டாகிராமிற்கு திரும்பிச் செல்லுங்கள்

# pref_description_jump_back_to_instagram
source: Jump back to instragrm after receiving URL
ta: முகவரி ஐப் பெற்ற பிறகு மீண்டும் இன்ச்டாகிராமில் செல்லவும்
