Repository: 247i/TACETr
Catalog: உரை/தானி/eat-poop-you-cat-android-the-android-game-*.po
Languages: ta

# app_name
source: Eat Poop You Cat
ta: பூப் நீங்கள் பூனை சாப்பிடுங்கள்

# status_searching
source: Searching
ta: தேடுகிறது

# status_connected
source: Connected
ta: இணைக்கப்பட்டுள்ளது

# new_game
source: Start New Game
ta: புதிய விளையாட்டைத் தொடங்கவும்

# welcome_message
source: Welcome to %1$s!
ta: %1$s க்கு வருக!

source: Show
ta: காட்டு

source: Send
ta: அனுப்பு

# send_description
source: send your work
ta: உங்கள் வேலையை அனுப்புங்கள்

source: Undo
ta: செயல்தவிர்

source: Nickname
ta: புனைப்பெயர்

source: Enter a sentence
ta: ஒரு வாக்கியத்தை உள்ளிடவும்

source: Draw this sentence!
ta: இந்த வாக்கியத்தை வரையவும்!

# no_letters_or_numbers
source: DO NOT use letters or numbers.
ta: கடிதங்கள் அல்லது எண்களைப் பயன்படுத்த வேண்டாம்.

source: clear
ta: தெளிவான

# erase_description
source: Erase stuff
ta: பொருட்களை அழிக்கவும்

source: Erase
ta: அழிக்கவும்

# draw_description
source: Draw
ta: டிரா

source: Draw
ta: டிரா

# undo_description
source: Undo what you just did
ta: நீங்கள் இப்போது செய்ததை செயல்தவிர்க்கவும்

# redo_description
source: Undo the undo
ta: செயல்தவிர்க்கவும்

source: Redo
ta: மீண்டும்செய்

# preferences_header
source: Preferences
ta: விருப்பத்தேர்வுகள்

# background_header
source: Background activity
ta: பின்னணி செயல்பாடு

# background_title
source: Allow app to communicate in the background
ta: பயன்பாட்டை பின்னணியில் தொடர்பு கொள்ள அனுமதிக்கவும்

# background_summary_off
source: You will not be able to send or receive games unless the app is open
ta: பயன்பாடு திறந்திருக்காவிட்டால் நீங்கள் கேம்களை அனுப்பவோ பெறவோ முடியாது

# background_summary_on
source: You will be able to send or receive games even if the app is closed
ta: பயன்பாடு மூடப்பட்டிருந்தாலும் நீங்கள் விளையாட்டுகளை அனுப்ப அல்லது பெற முடியும்

# write_a_sentence_to_describe_this_drawing
source: Describe this drawing
ta: இந்த வரைபடத்தை விவரிக்கவும்

# dialog_start_game
source: Start Game
ta: விளையாட்டைத் தொடங்கவும்

source: Start
ta: தொடங்கு

source: Cancel
ta: ரத்துசெய்

# submit
source: End My Turn!
ta: என் திருப்பத்தை முடிக்கவும்!

# dialog_accept_turn
source: Accept turn from %1$s!
ta: %1$s இலிருந்து திருப்பத்தை ஏற்றுக்கொள்ளுங்கள்!

# created_by
source: Created By: %1$s
ta: உருவாக்கப்பட்டது: %1$s

source: Write a funny sentence
ta: ஒரு வேடிக்கையான வாக்கியத்தை எழுதுங்கள்

# no_really_write_a_funny_sentence
source: For reals write a funny sentence!!
ta: ரியல்ச் ஒரு வேடிக்கையான வாக்கியத்தை எழுதுங்கள் !!

# dialog_one_entry_allowed
source: Only one entry per game is allowed
ta: ஒரு விளையாட்டுக்கு ஒரு நுழைவு மட்டுமே அனுமதிக்கப்படுகிறது

source: Oof
ta: ஓ

source: Save
ta: சேமி

# find_game
source: find a game
ta: ஒரு விளையாட்டைக் கண்டுபிடி

# starting_sentence
source: Starting Sentence: %1$s
ta: தொடக்க வாக்கியம்: %1$s

# turn_completed_time
source: Turn complete time %1$d:%2$d
ta: முழுமையான நேரம் %1$d: %2$d

# time_left_to_complete
source: Time left to complete %1$d:%2$d
ta: %1$d ஐ முடிக்க நேரம்: %2$d

# turn_passed
source: Turn passed: %1$s
ta: கடந்து சென்றது: %1$s

source: Dashboard
ta: முகப்புப்பெட்டி

# default_nickname
source: No Name
ta: பெயர் இல்லை

# title_activity_eat_poop_you_cat_app
source: EatPoopYouCatApp
ta: Eatpoopyuucatapp

# write_sentence_error
source: Write a more better sentence!
ta: இன்னும் சிறந்த வாக்கியத்தை எழுதுங்கள்!

# drawing_error
source: make a more better drawing.
ta: இன்னும் சிறந்த வரைபடத்தை உருவாக்குங்கள்.

# turns
source: Turns: %1$d
ta: திருப்பங்கள்: %1$d

source: End Game For All
ta: அனைவருக்கும் விளையாட்டு

# app_description
source: A game of telephone where you take turns writing sentences and making drawings. The game is over when each person has one turn.*
ta: நீங்கள் எடுக்கும் தொலைபேசி விளையாட்டு வாக்கியங்கள் மற்றும் வரைபடங்களை உருவாக்கும். ஒவ்வொரு நபருக்கும் ஒரு முறை இருக்கும்போது விளையாட்டு முடிந்துவிட்டது.*

# app_warning
source: * Family and friends are not included!
ta: * குடும்பத்தினரும் நண்பர்களும் சேர்க்கப்படவில்லை!

# no_previous_games_found
source: No previous games found! Go play!
ta: முந்தைய விளையாட்டுகள் எதுவும் கிடைக்கவில்லை! விளையாடுங்கள்!

# pass_to_the_next
source: Pass this device to the next player!
ta: இந்த சாதனத்தை அடுத்த பிளேயருக்கு அனுப்பவும்!

source: scroll to top
ta: மேலே உருட்டவும்

# are_you_sure
source: This will %1$s. Do you still want to continue?
ta: இது %1$s. நீங்கள் இன்னும் தொடர விரும்புகிறீர்களா?

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Delete Game
ta: விளையாட்டை நீக்கு

# test_cat_sentence
source: A cat winks at you with the grace of a very sleepy toddler
ta: மிகவும் தூக்கமுள்ள குறுநடை போடும் குழந்தையின் கிருபையுடன் ஒரு பூனை உங்களைப் பார்த்தது

source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

# sentence_turn_title
source: Write Something!
ta: ஏதாவது எழுதுங்கள்!

# draw_turn_title
source: Draw this sentence!
ta: இந்த வாக்கியத்தை வரையவும்!

# about
source: About this app
ta: இந்த பயன்பாடு பற்றி

# translations_welcome
source: Translation contributions welcome
ta: மொழிபெயர்ப்பு பங்களிப்புகள் வரவேற்கப்படுகின்றன

source: Issues
ta: சிக்கல்கள்

source: Share this game
ta: இந்த விளையாட்டைப் பகிரவும்

# is_avalible_on_f_droid_and_google_play
source: %1$s is avalible on F-Droid and Google Play
ta: %1$s F-DROID மற்றும் Google Play இல் கிடைக்கிறது

# continue_previous_game
source: Continue an old game
ta: பழைய விளையாட்டைத் தொடரவும்

source: Loading
ta: ஏற்றுகிறது

# debugging_on_label
source: Debugging on: %1$s
ta: பிழைத்திருத்தம்: %1$s

# version_label
source: Version: %1$s
ta: பதிப்பு: %1$s

# git_hash_label
source: Git Hash: %1$s
ta: அறிவிலி ஆச்: %1$s

source: Backup Games
ta: காப்பு விளையாட்டுகள்

source: Import games
ta: விளையாட்டுகளை இறக்குமதி செய்யுங்கள்

source: A cat winks at you with the grace of a very sleepy toddler
ta: மிகவும் தூக்கமுள்ள குறுநடை போடும் குழந்தையின் கிருபையுடன் ஒரு பூனை உங்களைப் பார்த்தது

# no_games_to_save
source: You has no games to save bruh
ta: ப்ரூவை காப்பாற்ற உங்களுக்கு எந்த விளையாட்டுகளும் இல்லை

source: saving…
ta: சேமிப்பு…

# saved_to
source: saved to: %1$s
ta: சேமிக்கப்பட்டது: %1$s

# share_failed
source: share done goofed, oof
ta: பகிர்வு முட்டாள்தனமாக முடிந்தது, ஓ

source: open
ta: திற

source: Application Icon
ta: பயன்பாட்டு படவுரு

# not_nickname
source: Not %1$s
ta: %1$s அல்ல

source: James
ta: சேம்ச்

source: That's me
ta: அது நான்

source: Use Nicknames
ta: புனைப்பெயர்களைப் பயன்படுத்துங்கள்

source: What's this?
ta: இது என்ன?

# use_nicknames_more_info
source: Using Nicknames will prompt each player to leave a nickname, allowing players to keep track of who has had a turn and to match players to drawings and sentences at the end of the game. This way you might be able to figureout who drew that clearly a cat not a dog image.
ta: புனைப்பெயர்களைப் பயன்படுத்துவது ஒவ்வொரு வீரரையும் ஒரு புனைப்பெயரை விட்டு வெளியேறத் தூண்டும், யார் ஒரு திருப்பத்தை வைத்திருக்கிறார்கள் என்பதைக் கண்காணிக்கவும், விளையாட்டின் முடிவில் வீரர்களை வரைபடங்கள் மற்றும் வாக்கியங்களுடன் பொருத்தவும் வீரர்களை அனுமதிக்கும். இந்த வழியில் ஒரு பூனை ஒரு நாய் உருவம் அல்ல என்பதை தெளிவாக வரைந்தவர்களை நீங்கள் கண்டுபிடிக்க முடியும்.

# imported
source: Import
ta: இறக்குமதி

# ack
source: Werd
ta: ஆனது

source: User made drawing
ta: பயனர் தயாரிக்கப்பட்ட வரைதல்

# sentence_is_blank
source: this is blank… Maybe try pressing more buttons?
ta: இது காலியாக உள்ளது… மேலும் பொத்தான்களை அழுத்த முயற்சிக்கிறீர்களா?

# new_player_prompt
source: New player; Who dis?
ta: புதிய வீரர்; யார் டிச்?

# nickname_prompt
source: What do they call you around here?
ta: அவர்கள் உங்களை இங்கே என்ன அழைக்கிறார்கள்?

source: Previous nicknames:
ta: முந்தைய புனைப்பெயர்கள்:

# no_nickname_chosen_warning
source: Fine, I'll pick one for you
ta: நல்லது, நான் உங்களுக்காக ஒன்றைத் தேர்ந்தெடுப்பேன்

# enter_nickname_prompt
source: Enter your name or nickname
ta: உங்கள் பெயர் அல்லது புனைப்பெயரை உள்ளிடவும்

# playerid
source: PlayerId: %1$s
ta: பிளேயர்ஐடி: %1$s

# imported_games
source: Imported %d Game
ta: இறக்குமதி செய்யப்பட்ட %d விளையாட்டு

# imported_entries
source: Imported %d Entry
ta: இறக்குமதி செய்யப்பட்ட %d நுழைவு

# previous_games
source: Previous Game
ta: முந்தைய விளையாட்டு

# minimum_words
source: minimum %d word.
ta: குறைந்தபட்ச %d சொல்.
