Repository: 247i/TACETr
Catalog: உரை/தானி/empado-ui-*.po
Languages: ta

source: Emotions
ta: உணர்ச்சிகள்

source: Needs
ta: தேவைகள்

source: Context
ta: சூழல்

source: Untitled situation
ta: பெயரிடப்படாத நிலைமை

source: Close situation overview
ta: நிலைமை கண்ணோட்டத்தை மூடு

# relevantObservation
source: Relevant objective observation
ta: தொடர்புடைய புறநிலை அவதானிப்பு

# relevantObservationDesc
source: What might have triggered the emotions
ta: உணர்ச்சிகளைத் தூண்டியிருக்கலாம்

# relevantObservationLongerDesc
source: Describe the situation(s) that might have triggered the relevant emotions. Use objective descriptions not colored by judgment to make them easier to empathize with.
ta: தொடர்புடைய உணர்ச்சிகளைத் தூண்டியிருக்கக்கூடிய நிலைமை (களை) விவரிக்கவும். தீர்ப்பால் வண்ணமயமாக்கப்படாத புறநிலை விளக்கங்களைப் பயன்படுத்தவும்.

source: Potential strategies
ta: சாத்தியமான உத்திகள்

# potentialStrategiesDesc
source: How to meet the needs in this situation
ta: இந்த சூழ்நிலையில் தேவைகளை எவ்வாறு நிறைவு செய்வது

source: Strategies used
ta: பயன்படுத்தப்படும் உத்திகள்

# strategiesUsedDesc
source: How the needs in this situation were met
ta: இந்த சூழ்நிலையில் தேவைகள் எவ்வாறு நிறைவு செய்யப்பட்டன

source: Additional notes
ta: கூடுதல் குறிப்புகள்

# additionalNotesDesc
source: Anything else you'd like to add
ta: நீங்கள் சேர்க்க விரும்பும் வேறு எதையும்

# additionalNotesLongerDesc
source: Anything else you’d like to note down?
ta: வேறு ஏதாவது நீங்கள் கவனிக்க விரும்புகிறீர்களா?

# contextInfoOptional
source: All context info is optional
ta: அனைத்து சூழல் தகவல்களும் விருப்பமானவை

# noEmotionsHint
source: Drag the emotion to choose its intensity
ta: உணர்ச்சியை அதன் தீவிரத்தை தேர்வு செய்ய இழுக்கவும்

# sheetUsageHint
source: Swipe up to review and save your entry
ta: உங்கள் நுழைவை மதிப்பாய்வு செய்து சேமிக்க ச்வைப் செய்யவும்

source: Drag here to cancel
ta: ரத்து செய்ய இங்கே இழுக்கவும்

# emotionHandleDesc
source: {emotionCategory} - drag to choose the intensity
ta: {emotionCategory} - தீவிரத்தை தேர்வு செய்ய இழுக்கவும்

source: Cancel
ta: ரத்துசெய்

source: Journal
ta: செய்தித் தாள்

source: Strategies
ta: உத்திகள்

source: History
ta: வரலாறு

source: Settings
ta: அமைப்புகள்

source: Theme
ta: கருப்பொருள்

source: Language
ta: மொழி

source: Source code
ta: மூலக் குறியீடு

source: People involved
ta: சம்பந்தப்பட்டவர்கள்

# whoWasInvolved
source: Who was involved in this situation?
ta: இந்த சூழ்நிலையில் யார் ஈடுபட்டனர்?

source: Remove
ta: அகற்று

source: Add person to situation
ta: நிலைமைக்கு நபரைச் சேர்க்கவும்

source: New person
ta: புதிய நபர்

source: Name
ta: பெயர்

# mustSpecifyName
source: You must specify a name
ta: நீங்கள் ஒரு பெயரைக் குறிப்பிட வேண்டும்

source: Pronoun
ta: அவர்கள் பரிந்துரைக்கிறார்கள்

source: Add new person
ta: புதிய நபரைச் சேர்க்கவும்

source: Done
ta: முடிந்தது

source: Discard
ta: நிராகரிக்கவும்

source: Discard changes
ta: மாற்றங்களை நிராகரிக்கவும்

source: Set situation title
ta: நிலைமை தலைப்பை அமைக்கவும்

source: Title
ta: தலைப்பு

source: Set title
ta: தலைப்பை அமைக்கவும்

source: Save and clear
ta: சேமித்து அழிக்கவும்

source: Save situation and clear
ta: சூழ்நிலையைச் சேமித்து தெளிவுபடுத்துங்கள்

source: Could not open {url}.
ta: {url} திறக்க முடியவில்லை.

# languageEN
source: English
ta: ஆங்கிலம்

# languageCS
source: Czech
ta: செக்

# languageSystem
source: System
ta: மண்டலம்

# themeSystem
source: System
ta: மண்டலம்

# themeLight
source: Light
ta: ஒளி

# themeDark
source: Dark
ta: இருண்ட

source: System colors
ta: கணினி வண்ணங்கள்

source: Donate
ta: நன்கொடை

source: Archive
ta: காப்பகம்

source: Unarchive
ta: அன்கான்

# historyEmptyTitle
source: No history yet
ta: இன்னும் வரலாறு இல்லை

# historyEmptyDesc
source: Write a journal entry to see it appear here.
ta: இது இங்கே தோன்றுவதைக் காண ஒரு செய்தித் தாள் நுழைவு எழுதுங்கள்.

# strategyEmptyTitle
source: No strategies yet
ta: இன்னும் உத்திகள் இல்லை

# strategyEmptyDesc
source: Write a journal entry with some strategies to see them appear here.
ta: அவை இங்கே தோன்றுவதைக் காண சில உத்திகளுடன் ஒரு செய்தித் தாள் நுழைவு எழுதுங்கள்.

source: Add journal entry
ta: செய்தித் தாள் நுழைவு சேர்க்கவும்

source: Archived
ta: காப்பகப்படுத்தப்பட்டது

source: About Empado
ta: எம்பாடோ பற்றி

# licensedAGPLv3
source: Licensed under the AGPLv3, with extra permissions and limitations.
ta: கூடுதல் அனுமதிகள் மற்றும் வரம்புகளுடன், AGPLV3 இன் கீழ் உரிமம் பெற்றது.

# errorTitle
source: You found a bug in the code
ta: குறியீட்டில் ஒரு பிழையைக் கண்டீர்கள்

# errorDescription
source: The content here could not be loaded. Try closing and opening Empado and see if the problem persists. If it does, please {bugLinkSegment}.
ta: இங்கே உள்ளடக்கத்தை ஏற்ற முடியவில்லை. எம்பாடோவை மூடவும் திறக்கவும் முயற்சிக்கவும், சிக்கல் நீடிக்கிறதா என்று பாருங்கள். அவ்வாறு செய்தால், தயவுசெய்து {bugLinkSegment}.

# errorDescriptionBugLinkSegment
source: submit a bug report via Gitlab
ta: அறிவிலிஆய்வு வழியாக பிழை அறிக்கையை சமர்ப்பிக்கவும்

source: Unmet needs
ta: தேவையற்ற தேவைகள்

source: Met needs
ta: தேவைகள் நிறைவு

# describedOwnPerspective
source: {pronoun, select, he{{name} described his own perspective (emotions, needs, etc.) here.} she{{name} described her own perspective (emotions, needs, etc.) here.} other{{name} described their own perspective (emotions, needs, etc.) here.}}
ta: {pronoun, select, he{{name} இங்கே தனது சொந்த முன்னோக்கை (உணர்ச்சிகள், தேவைகள் போன்றவை) இங்கே விவரித்தான்.} she{{name} இங்கே தனது சொந்த முன்னோக்கை (உணர்ச்சிகள், தேவைகள் போன்றவை) இங்கே விவரித்தாள்.} other{{name} இங்கே தனது சொந்த முன்னோக்கை (உணர்ச்சிகள், தேவைகள் போன்றவை) இங்கே விவரித்தார்.}}

source: What's going on for you?
ta: உங்களுக்கு என்ன நடக்கிறது?

# whatsGoingOnForThem
source: {pronoun, select, he{What's going on for {name}?} she{What's going on for {name}?} other{What's going on for {name}?}}
ta: {உச்சரிப்பு, தேர்ந்தெடுக்கவும், அவர் {பெயருக்கு என்ன நடக்கிறது {name}?} அவள் {{name}?

source: You
ta: நீங்கள்

source: He
ta: அவர்

source: She
ta: சீ

# singularThey
source: They
ta: அவர்கள்

# perspectiveStatementI
source: I'm feeling {emotions}, because {ownNeedStatement} {needs}.
ta: நான் {emotions} உணர்கிறேன், ஏனென்றால் {ownNeedStatement} {needs}.

# perspectiveStatementOwnThey
source: {pronoun, select, he{{name} is feeling {emotions}, because {ownNeedStatement} {needs}.} she{{name} is feeling {emotions}, because {ownNeedStatement} {needs}.} other{{name} is feeling {emotions}, because {ownNeedStatement} {needs}.}}
ta: {உச்சரிப்பு, தேர்ந்தெடுக்கவும், அவர் {{name} உணர்கிறார் {emotions}, ஏனென்றால் {ownNeedStatement} {needs}. {name} உணர்கிறது, ஏனெனில் {emotions} {ownNeedStatement}.}}

# perspectiveStatementAssumedThey
source: {pronoun, select, he{I think {name} might be feeling {emotions}, because {assumedNeedStatement} {needs}.} she{I think {name} might be feeling {emotions}, because {assumedNeedStatement} {needs}.} other{I think {name} might be feeling {emotions}, because {assumedNeedStatement} {needs}.}}
ta: {உச்சரிப்பு, தேர்ந்தெடுக்கவும், அவர் {name} உணரலாம் {emotions}, ஏனென்றால் {assumedNeedStatement} {needs}. } பிற {நான் நினைக்கிறேன் {name} உணரலாம் {emotions}, ஏனெனில் {assumedNeedStatement} {needs}.}}

# meetingNeedsForYou
source: You're meeting your needs for:
ta: உங்கள் தேவைகளை நீங்கள் நிறைவு செய்கிறீர்கள்:

# meetingNeedsForThey
source: {pronoun, select, he{{name} is meeting his needs for:} she{{name} is meeting her needs for:} other{{name} is meeting their needs for:}}
ta: {உச்சரிப்பு, தேர்ந்தெடுக்கவும், அவர் {{name} அவருடைய தேவைகளை நிறைவு செய்கிறார்:} அவள் {{name} அவளுடைய தேவைகளை நிறைவு செய்கிறாள்:} பிற {{name} அவற்றின் தேவைகளை நிறைவு செய்கிறது:}}

# whatAreSomeWaysYou
source: What are some ways that you could meet your needs for {needs}?
ta: {தேவைகளுக்கான உங்கள் தேவைகளைப் நிறைவு செய்ய சில வழிகள் யாவை?

# whatAreSomeWaysYouEmpty
source: What are some ways that you could meet your needs here?
ta: உங்கள் தேவைகளை இங்கே நிறைவு செய்ய சில வழிகள் யாவை?

# whatAreSomeWaysThey
source: {pronoun, select, he{What are some ways {name} could meet his needs for {needs}?} she{What are some ways {name} could meet her needs for {needs}?} other{What are some ways {name} could meet their needs for {needs}?}}
ta: {உச்சரிப்பு, தேர்ந்தெடுக்கவும், அவர் {சில வழிகள் {name} {தேவைகளுக்கான தேவைகளை நிறைவு செய்ய முடியுமா? பெயர் {needs}?}} க்கான அவர்களின் தேவைகளைப் நிறைவு செய்ய முடியும்

# whatAreSomeWaysTheyEmpty
source: {pronoun, select, he{What are some ways {name} could meet his needs here?} she{What are some ways {name} could meet her needs here?} other{What are some ways {name} could meet their needs here?}}
ta: {உச்சரிப்பு, தேர்ந்தெடுக்கவும், அவர் {சில வழிகள் {name} இங்கே அவரது தேவைகளை நிறைவு செய்ய முடியுமா?} அவள் {சில வழிகள் என்ன {name} அவளுடைய தேவைகளை இங்கே நிறைவு செய்ய முடியுமா? இங்கே?}}

# whatAreSomeWaysYouMeeting
source: How are you meeting your needs for {needs}?
ta: {தேவைகளுக்கான உங்கள் தேவைகளை எவ்வாறு நிறைவு செய்கிறீர்கள்?

# whatAreSomeWaysYouMeetingEmpty
source: How are you meeting your needs here?
ta: உங்கள் தேவைகளை இங்கே எவ்வாறு நிறைவு செய்கிறீர்கள்?

# whatAreSomeWaysTheyMeeting
source: {pronoun, select, he{How is {name} meeting his needs for {needs}?} she{How is {name} meeting her needs for {needs}?} other{How is {name} meeting their needs for {needs}?}}
ta: {உச்சரிப்பு, தேர்ந்தெடுக்கவும், அவர் {பெயர் {தேவைகள் {தேவைகள் {name}?}}

# whatAreSomeWaysTheyMeetingEmpty
source: {pronoun, select, he{How is {name} could meet his needs here?} she{How is {name} meeting her needs here?} other{How is {name} meeting their needs here?}}
ta: {உச்சரிப்பு, தேர்ந்தெடுக்கவும், அவர் {பெயர் {அவரது தேவைகளை இங்கே நிறைவு செய்ய முடியும்?} அவள் {{name} அவளுடைய தேவைகளை இங்கே எவ்வாறு நிறைவு செய்கிறாள்?

# meetOthersNeedsToo
source: Ideally in a way that allows others to meet their needs too:
ta: வெறுமனே மற்றவர்கள் தங்கள் தேவைகளையும் நிறைவு செய்ய அனுமதிக்கும் வகையில்:

source: Write one strategy per line.
ta: ஒரு வரிக்கு ஒரு மூலோபாயத்தை எழுதுங்கள்.

# situationSaved
source: Situation saved successfully
ta: நிலைமை வெற்றிகரமாக காப்பாற்றப்பட்டது

# strategyNotUsedYet
source: This strategy has not been used in any situation yet.
ta: இந்த மூலோபாயம் இதுவரை எந்த சூழ்நிலையிலும் பயன்படுத்தப்படவில்லை.

# needStatementNeedingI
source: I'm needing
ta: எனக்கு தேவை

# needStatementMeetingNeedsForMe
source: I'm meeting my needs for
ta: எனது தேவைகளை நான் நிறைவு செய்கிறேன்

# needStatementNeedingOwnThey
source: {pronoun, select, he{he is needing} she{she is needing} other{they are needing}}
ta: {உச்சரிப்பு, தேர்ந்தெடுக்கவும், அவனுக்கு {he is needing} அவள் {she is needing} பிற {they are needing}} தேவை

# needStatementMeetingOwnNeedsForThem
source: {pronoun, select, he{he is meeting his needs for} she{she is meeting her needs for} other{they are meeting their needs for}}
ta: {உச்சரிப்பு, தேர்ந்தெடு, அவர் {he is meeting his needs for} அவள் {she is meeting her needs for} பிற {they are meeting their needs for}} க்கான தேவைகளை நிறைவு செய்கிறார்கள்

# needStatementNeedingAssumedThey
source: {pronoun, select, he{he might be needing} she{she might be needing} other{they might be needing}}
ta: {உச்சரிப்பு, தேர்ந்தெடு, அவர் {he might be needing} அவள் {she might be needing} மற்ற {they might be needing}}

# needStatementMeetingAssumedNeedsForThem
source: {pronoun, select, he{he might be meeting his needs for} she{she might be meeting her needs for} other{they might be meeting their needs for}}
ta: {உச்சரிப்பு, தேர்ந்தெடுங்கள், அவர் {he might be meeting his needs for} அவள் {she might be meeting her needs for} மற்ற {they might be meeting their needs for} க்கு க்காக நிறைவு செய்யலாம்

# perspectiveStatementEmotionPlaceholder
source: certain emotions
ta: சில உணர்ச்சிகள்

# perspectiveStatementNeedPlaceholder
source: certain things
ta: சில விசயங்கள்

# emotionCategoryExcited
source: Interest / excitement
ta: வட்டி / ஊக்கம்

# emotionCategoryContent
source: Enjoyment / joy
ta: இன்பம் / மகிழ்ச்சி

# emotionCategoryDisgusted
source: Contempt / disgust
ta: அவமதிப்பு / வெறுப்பு

# emotionCategorySurprised
source: Surprise / startle
ta: வியப்பு / திடுக்கிடும்

# emotionCategoryAshamed
source: Guilt / shame
ta: குற்றம் / அவமானம்

# emotionCategorySad
source: Distress / anguish
ta: துன்பம் / வருத்தம்

# emotionCategoryAngry
source: Anger / rage
ta: சினம் / சினம்

# emotionCategoryScared
source: Fear / terror
ta: அச்சம் / பயங்கரவாதம்

# emotionBored
source: bored
ta: சலித்துவிட்டது

# emotionApathetic
source: apathetic
ta: அக்கறையற்ற

# emotionRepulsed
source: repulsed
ta: விரட்டியது

# emotionBitter
source: bitter
ta: கசப்பு

# emotionDisgusted
source: disgusted
ta: வெறுப்படைந்தது

# emotionContemptuous
source: contemptuous
ta: இழிவான

# emotionLoathful
source: loathful
ta: வெறுக்கத்தக்க

# emotionUnfocused
source: unfocused
ta: கவனம் செலுத்தப்படாதது

# emotionDistracted
source: distracted
ta: திசைதிருப்பப்பட்டது

# emotionSurprised
source: surprised
ta: வியப்பு

# emotionAmazed
source: amazed
ta: வியப்பு

# emotionAghast
source: aghast
ta: சாதனங்கள்

# emotionShocked
source: shocked
ta: அதிர்ச்சி

# emotionAwestruck
source: awestruck
ta: விழிப்புணர்வு

# emotionVulnerable
source: vulnerable
ta: பாதிக்கப்படக்கூடிய

# emotionFlustered
source: flustered
ta: சுறுசுறுப்பானது

# emotionEmbarassed
source: embarassed
ta: சங்கடமாக

# emotionInferior
source: inferior
ta: தாழ்ந்த

# emotionRegretful
source: regretful
ta: வருத்தம்

# emotionGuiltyAshamed
source: guilty / ashamed
ta: குற்றவாளி / வெட்கப்பட்ட

# emotionDeeplyGuiltyHumiliated
source: deeply guilty / humiliated
ta: ஆழ்ந்த குற்றவாளி / அவமானம்

# emotionPensive
source: pensive
ta: தீவிரம்

# emotionDown
source: down
ta: கீழே

# emotionSad
source: sad
ta: சோகம்

# emotionMournful
source: mournful
ta: துக்ககரமான

# emotionSorrowful
source: sorrowful
ta: துன்பம்

# emotionMiserable
source: miserable
ta: பரிதாபகரமான

# emotionAnguished
source: anguished
ta: வேதனையானது

# emotionPeeved
source: peeved
ta: பீவ்

# emotionIrritated
source: irritated
ta: எரிச்சல்

# emotionUpset
source: upset
ta: வருத்தமாக

# emotionAngry
source: angry
ta: சினம்

# emotionFurious
source: furious
ta: கோபமடைந்தது

# emotionLivid
source: livid
ta: எலிவ்

# emotionEnraged
source: enraged
ta: சினம்

# emotionJittery
source: jittery
ta: தொத்திறைச்சி

# emotionConcerned
source: concerned
ta: சம்பந்தப்பட்டவர்

# emotionNervous
source: nervous
ta: பதட்டமான

# emotionWorried
source: worried
ta: கவலை

# emotionScared
source: scared
ta: அச்சம்

# emotionTerrified
source: terrified
ta: பயமுறுத்தியது

# emotionPanicked
source: panicked
ta: பீதியடைந்தது

# emotionLively
source: lively
ta: உயிரோட்டமான

# emotionInterested
source: interested
ta: ஆர்வம்

# emotionFocused
source: focused
ta: கவனம் செலுத்தியது

# emotionInspired
source: inspired
ta: ஊக்கமளித்தது

# emotionEnthusiastic
source: enthusiastic
ta: ஊக்கம்

# emotionExcited
source: excited
ta: உற்சாகமாக

# emotionExhilirated
source: exhilirated
ta: மகிழ்ச்சியடைந்தது

# emotionRelaxed
source: relaxed
ta: நிதானமாக

# emotionCalm
source: calm
ta: அமைதியானது

# emotionPleasant
source: pleasant
ta: இனிமையானது

# emotionContent
source: content
ta: உள்ளடக்கம்

# emotionJoyful
source: joyful
ta: மகிழ்ச்சி

# emotionHappy
source: happy
ta: மகிழ்ச்சி

# emotionBlissful
source: blissful
ta: ஆனந்தமான

# needAir
source: air
ta: காற்று

# needExercise
source: movement / exercise
ta: இயக்கம் / உடற்பயிற்சி

# needFood
source: food
ta: உணவு

# needHealth
source: physical health
ta: உடல் உடல்நலம்

# needHome
source: shelter
ta: தங்குமிடம்

# needPhysicalSafety
source: physical safety
ta: உடல் பாதுகாப்பு

# needRest
source: rest / sleep
ta: ஓய்வு / தூக்கம்

# needSex
source: sex
ta: செக்ச்

# needTouch
source: touch
ta: தொடு

# needWater
source: water
ta: நீர்

# needInnerPeace
source: inner peace
ta: உள் அமைதி

# needSafety
source: safety
ta: பாதுகாப்பு

# needSecurity
source: security
ta: பாதுகாப்பு

# needCertainty
source: certainty
ta: உறுதியானது

# needStability
source: stability
ta: நிலைப்புத்தன்மை

# needSupport
source: support
ta: உதவி

# needChoice
source: freedom of choice
ta: தேர்வு விடுதலை

# needFreedom
source: freedom
ta: விடுதலை

# needSpace
source: space
ta: இடைவெளி

# needSpontaneity
source: spontaneity
ta: தன்னிச்சையான தன்மை

# needIndependence
source: independence
ta: விடுதலை

# needAcceptance
source: acceptance
ta: ஏற்றுக்கொள்ளல்

# needAffection
source: affection
ta: பாசம்

# needBelonging
source: belonging
ta: சொந்தமானது

# needCollaboration
source: collaboration
ta: ஒத்துழைப்பு

# needCommunication
source: communication
ta: தொடர்பு

# needCommunity
source: community
ta: சமூகம்

# needCloseness
source: closeness
ta: நெருக்கம்

# needCompany
source: company
ta: நிறுவனம்

# needPartnership
source: partnership
ta: கூட்டாண்மை

# needCompassion
source: compassion
ta: இரக்கம்

# needConsideration
source: consideration
ta: கருத்தில்

# needEmpathy
source: empathy
ta: பச்சாத்தாபம்

# needInclusion
source: inclusion
ta: சேர்த்தல்

# needIntimacy
source: intimacy
ta: நெருக்கம்

# needLove
source: love
ta: காதல்

# needReciprocity
source: reciprocity
ta: பரச்பர

# needCare
source: care
ta: கவனிப்பு

# needWarmth
source: warmth
ta: வெப்பம்

# needRecognition
source: recognition
ta: ஏற்பு

# needCompetence
source: competence
ta: திறன்

# needRespect
source: respect
ta: மரியாதை

# needKnown
source: to be known
ta: அறியப்பட வேண்டும்

# needAttention
source: attention
ta: கவனம்

# needUnderstood
source: to be understood
ta: புரிந்து கொள்ள வேண்டும்

# needTrust
source: trust
ta: நம்பிக்கை

# needFairness
source: fairness
ta: நேர்மை

# needBeauty
source: beauty
ta: அழகு

# needConsistency
source: consistency
ta: நிலைத்தன்மை

# needEquality
source: equality
ta: ஒரு நிகர்

# needHarmony
source: harmony
ta: நல்லிணக்கம்

# needOrder
source: order
ta: ஒழுங்கு

# needQuiet
source: quiet
ta: அமைதியாக

# needAuthenticity
source: authenticity
ta: நம்பகத்தன்மை

# needHonesty
source: honesty
ta: நேர்மை

# needAwareness
source: awareness
ta: விழிப்புணர்வு

# needClarity
source: clarity
ta: தெளிவு

# needDiscovery
source: discovery
ta: கண்டுபிடிப்பு

# needIntegrity
source: integrity
ta: ஒருமைப்பாடு

# needLearning
source: learning
ta: கற்றல்

# needPresence
source: presence
ta: இருப்பு

# needUnderstand
source: to understand
ta: புரிந்து கொள்ள

# needKnow
source: to know
ta: தெரிந்து கொள்ள

# needCelebration
source: celebration
ta: கொண்டாட்டம்

# needPrivacy
source: privacy
ta: தனியுரிமை

# needChallenge
source: challenge
ta: அறைகூவல்

# needCreativity
source: creativity
ta: படைப்பாற்றல்

# needEase
source: ease
ta: எளிதானது

# needGrowth
source: growth
ta: வளர்ச்சி

# needHope
source: hope
ta: நம்பிக்கை

# needInspiration
source: inspiration
ta: ஊக்கம்

# needJoy
source: joy
ta: மகிழ்ச்சி

# needHumor
source: humor
ta: நகைச்சுவை

# needMourning
source: mourning
ta: துன்பம்

# needSelfExpression
source: self-expression
ta: தன்வய வெளிப்பாடு

# needPlayfulness
source: playfulness
ta: விளையாட்டுத்திறன்

# needStimulation
source: stimulation
ta: தூண்டுதல்

# needContribution
source: contribution
ta: பங்களிப்பு

# needEfficiency
source: efficiency
ta: திறன்

# needEffectiveness
source: effectiveness
ta: செயல்திறன்

# needParticipation
source: participation
ta: பங்கேற்பு

# needPurpose
source: purpose
ta: நோக்கம்

# needMattering
source: to matter
ta: விசயத்திற்கு

# needCategoryPhysiology
source: Physiological needs
ta: உடலியல் தேவைகள்

# needCategorySecurity
source: Security
ta: பாதுகாப்பு

# needCategoryLoveBelonging
source: Love and belonging
ta: காதல் மற்றும் சொந்தமானது

# needCategoryEsteem
source: Esteem
ta: மரியாதை

# needCategoryCognitive
source: Cognitive needs
ta: அறிவாற்றல் தேவைகள்

# needCategoryBeautyEnvironment
source: Environment and beauty
ta: சூழல் மற்றும் அழகு

# needCategoryActualization
source: Self-actualization
ta: சுயமயமாக்கல்

# needCategoryTranscendence
source: Purpose and transcendence
ta: நோக்கம் மற்றும் மீறல்
