Repository: 247i/TACETr
Catalog: உரை/தானி/escapepod-android-app-*.po
Languages: ta

# app_name
source: Escapepod
ta: எச்கேப் பேட்

# app_version_name
source: n Höchsten Höhen\
ta: மிக உயர்ந்த உயரத்தில் \

# fragment_collection_title
source: All Podcasts
ta: அனைத்து பாட்காச்ட்களும்

# fragment_podcast_title
source: Podcast
ta: போட்காச்ட்

# fragment_settings_title
source: Settings
ta: அமைப்புகள்

# dialog_add_podcast_button
source: Add
ta: கூட்டு

# dialog_add_podcast_howto
source: Please enter a podcast feed address. Look for the RSS symbol on the homepage of the respective podcast.
ta: போட்காச்ட் ஊட்ட முகவரியை உள்ளிடவும். அந்தந்த போட்காச்டின் முகப்புப்பக்கத்தில் ஆர்எச்எச் சின்னத்தை பாருங்கள்.

# dialog_add_podcast_input_hint
source: Enter podcast feed link
ta: போட்காச்ட் ஊட்ட இணைப்பை உள்ளிடவும்

# dialog_add_podcast_title
source: Add New Podcast
ta: புதிய போட்காச்டைச் சேர்க்கவும்

# dialog_all_episodes_list_title
source: All episodes | streaming only
ta: அனைத்து அத்தியாயங்களும் | ச்ட்ரீமிங் மட்டும்

# dialog_episode_shownotes_feed
source: Feed
ta: தீவனம்

# dialog_episode_shownotes_title
source: Show Notes
ta: குறிப்புகளைக் காட்டு

# dialog_episode_shownotes_website
source: Website
ta: வலைத்தளம்

# dialog_error_message_default
source: An error occurred
ta: பிழை ஏற்பட்டது

# dialog_error_message_no_network
source: Connect to the Internet.
ta: இணையத்துடன் இணைக்கவும்.

# dialog_error_message_podcast_duplicate
source: This podcast is already part of your collection.
ta: இந்த போட்காச்ட் ஏற்கனவே உங்கள் சேகரிப்பின் ஒரு பகுதியாகும்.

# dialog_error_message_podcast_invalid_feed
source: This address is not an RSS feed.
ta: இந்த முகவரி RSS ஊட்டம் அல்ல.

# dialog_error_title_default
source: Error
ta: பிழை

# dialog_error_title_no_network
source: Offline
ta: இணையமில்லாமல்

# dialog_error_title_podcast_duplicate
source: Duplicate Podcast
ta: நகல் போட்காச்ட்

# dialog_error_title_podcast_invalid_feed
source: Invalid Podcast Feed
ta: தவறான போட்காச்ட் ஊட்டம்

# dialog_find_podcast_button_add
source: Add
ta: கூட்டு

# dialog_find_podcast_hint
source: Name or feed address
ta: பெயர் அல்லது ஊட்ட முகவரி

# dialog_find_podcast_no_results
source: No results found.
ta: முடிவுகள் எதுவும் கிடைக்கவில்லை.

# dialog_find_podcast_title
source: Find Podcast
ta: போட்காச்டைக் கண்டுபிடி

# dialog_generic_button_cancel
source: Cancel
ta: ரத்துசெய்

# dialog_generic_button_close
source: Close
ta: மூடு

# dialog_generic_button_okay
source: OK
ta: சரி

# dialog_generic_details_button
source: Show details
ta: விவரங்களைக் காட்டு

# dialog_generic_details_default
source: No details available
ta: விவரங்கள் எதுவும் கிடைக்கவில்லை

# dialog_opml_import_button_okay
source: Import
ta: இறக்குமதி

# dialog_opml_import_details_button
source: Show details
ta: விவரங்களைக் காட்டு

# dialog_opml_import_details_default
source: No details available
ta: விவரங்கள் எதுவும் கிடைக்கவில்லை

# dialog_opml_import_message_error
source: Could not import OPML file. No podcasts found.
ta: OPML கோப்பை இறக்குமதி செய்ய முடியவில்லை. பாட்காச்ட்கள் எதுவும் கிடைக்கவில்லை.

# dialog_opml_import_message
source: Add new podcasts? Duplicates will be removed before importing. Number of podcasts found:
ta: புதிய பாட்காச்ட்களைச் சேர்க்கவா? இறக்குமதி செய்வதற்கு முன் நகல்கள் அகற்றப்படும். காணப்படும் பாட்காச்ட்களின் எண்ணிக்கை:

# dialog_opml_import_title
source: OPML Import
ta: OPML இறக்குமதி

# dialog_podcast_description_feed
source: Feed
ta: தீவனம்

# dialog_podcast_description_title
source: Description
ta: விவரம்

# dialog_podcast_description_website
source: Website
ta: வலைத்தளம்

# dialog_yes_no_message_add_up_next
source: Start listening to this episode right away?
ta: இப்போதே இந்த அத்தியாயத்தைக் கேட்கத் தொடங்கவா?

# dialog_yes_no_message_default
source: Do you really want to do this?
ta: இதை நீங்கள் உண்மையில் செய்ய விரும்புகிறீர்களா?

# dialog_yes_no_message_delete_downloads
source: Delete downloaded episodes? You can download them again at any time.
ta: பதிவிறக்கம் செய்யப்பட்ட அத்தியாயங்களை நீக்கவா? எந்த நேரத்திலும் அவற்றை மீண்டும் பதிவிறக்கம் செய்யலாம்.

# dialog_yes_no_message_delete_episode
source: Delete this episode?
ta: இந்த அத்தியாயத்தை நீக்கவா?

# dialog_yes_no_message_download_all_episodes
source: Do you want download all episodes?
ta: எல்லா அத்தியாயங்களையும் பதிவிறக்க வேண்டுமா?

# dialog_yes_no_message_mark_episode_played
source: Mark this episode as played?
ta: இந்த அத்தியாயத்தை விளையாடியபடி குறிக்கவும்?

# dialog_yes_no_message_non_wifi_download
source: Your device is not connected to Wi-Fi. Download episode anyway?
ta: உங்கள் சாதனம் வைஃபை உடன் இணைக்கப்படவில்லை. எப்படியும் அத்தியாயத்தைப் பதிவிறக்கவா?

# dialog_yes_no_message_remove_podcast
source: Remove this podcast?
ta: இந்த போட்காச்டை அகற்றவா?

# dialog_yes_no_message_update_covers
source: Download latest version of all podcast covers?
ta: அனைத்து போட்காச்ட் அட்டைகளின் அண்மைக் கால பதிப்பைப் பதிவிறக்கவா?

# dialog_yes_no_message_update_episodes
source: Look for new episodes?
ta: புதிய அத்தியாயங்களைத் தேடவா?

# dialog_yes_no_message_vpn_download
source: Your device is connected via VPN. Download episode anyway?
ta: உங்கள் சாதனம் VPN வழியாக இணைக்கப்பட்டுள்ளது. எப்படியும் அத்தியாயத்தைப் பதிவிறக்கவா?

# dialog_yes_no_negative_button_add_up_next
source: Add to 'Up Next'
ta: 'அடுத்து' சேர்க்கவும்

# dialog_yes_no_negative_button_cancel
source: Cancel
ta: ரத்துசெய்

# dialog_yes_no_negative_button_default
source: No
ta: இல்லை

# dialog_yes_no_positive_button_add_up_next
source: Start Now
ta: இப்போது தொடங்கவும்

# dialog_yes_no_positive_button_default
source: Yes
ta: ஆம்

# dialog_yes_no_positive_button_delete_downloads
source: Delete All
ta: அனைத்தையும் நீக்கு

# dialog_yes_no_positive_button_delete_episode
source: Delete
ta: நீக்கு

# dialog_yes_no_positive_button_mark_episode_played
source: Mark as Played
ta: விளையாடியபடி குறி

# dialog_yes_no_positive_button_non_wifi_download
source: Download anyway
ta: எப்படியும் பதிவிறக்கவும்

# dialog_yes_no_positive_button_remove_podcast
source: Remove
ta: அகற்று

# dialog_yes_no_positive_button_update_collection
source: Update
ta: புதுப்பிப்பு

# dialog_yes_no_positive_button_update_covers
source: Update
ta: புதுப்பிப்பு

# dialog_yes_no_positive_button_vpn_download
source: Download anyway
ta: எப்படியும் பதிவிறக்கவும்

# dialog_yes_no_title_default
source: Decide
ta: முடிவு

# player_up_next_headline
source: Up Next:
ta: அடுத்து:

# toast_message_adding_podcast
source: Adding podcast…
ta: போட்காச்டைச் சேர்ப்பது…

# toast_message_adding_podcasts
source: Adding podcasts…
ta: பாட்காச்ட்களைச் சேர்ப்பது…

# toast_message_collection_update_not_necessary
source: Podcast collection is up-to-date.
ta: போட்காச்ட் சேகரிப்பு புதுப்பித்த நிலையில் உள்ளது.

# toast_message_copied_to_clipboard
source: Copied to clipboard.
ta: கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டது.

# toast_message_deleting_downloads
source: Deleting downloaded episodes…
ta: பதிவிறக்கம் செய்யப்பட்ட அத்தியாயங்களை நீக்குகிறது…

# toast_message_downloading_episode
source: Downloading episode…
ta: எபிசோட் பதிவிறக்குகிறது…

# toast_message_downloading_all_episodes
source: Downloading all episodes…
ta: எல்லா அத்தியாயங்களையும் பதிவிறக்குகிறது…

# toast_message_entering_streaming_view
source: Secret Streaming View
ta: ரகசிய ச்ட்ரீமிங் பார்வை

# toast_message_error_download_error
source: Download error
ta: பிழையைப் பதிவிறக்கவும்

# toast_message_error_feed_not_supported
source: Unsupported feed (application/Atom+XML).
ta: ஆதரிக்கப்படாத ஊட்டம் (பயன்பாடு/அணு+எக்ச்எம்எல்).

# toast_message_error_file_type_unknown
source: Unable to process download. File type:
ta: பதிவிறக்கத்தை செயலாக்க முடியவில்லை. கோப்பு வகை:

# toast_message_error_missing_storage_permission
source: Grant ead Storage permission to open this file.
ta: இந்த கோப்பைத் திறக்க EAD சேமிப்பக இசைவு வழங்கவும்.

# toast_message_error_no_internet_connection
source: Unable to start playback. The device has no network connection.
ta: பிளேபேக்கைத் தொடங்க முடியவில்லை. சாதனத்திற்கு பிணைய இணைப்பு இல்லை.

# toast_message_error_no_podcast_found
source: Unable to start playback. Please add a podcast first.
ta: பிளேபேக்கைத் தொடங்க முடியவில்லை. முதலில் போட்காச்டைச் சேர்க்கவும்.

# toast_message_error_no_podcast_matches_search
source: Unable to find a podcast that matches your search.
ta: உங்கள் தேடலுடன் பொருந்தக்கூடிய போட்காச்டைக் கண்டுபிடிக்க முடியவில்லை.

# toast_message_error_refreshing_cover
source: Could not refresh cover. The feed does not contain a cover reference.
ta: கவர் புதுப்பிக்க முடியவில்லை. ஊட்டத்தில் கவர் குறிப்பு இல்லை.

# toast_message_error_validation_no_valid_episodes
source: RSS validation: Feed does not contain any valid episodes.
ta: ஆர்எச்எச் சரிபார்ப்பு: ஊட்டத்தில் செல்லுபடியாகும் அத்தியாயங்கள் எதுவும் இல்லை.

# toast_message_error_validation_missing_cover
source: RSS validation: Feed does not contain a cover reference.
ta: ஆர்எச்எச் சரிபார்ப்பு: ஊட்டத்தில் ஒரு கவர் குறிப்பு இல்லை.

# toast_message_debug_logging_to_file_started
source: Debug: Start writing to a local log file.
ta: பிழைத்திருத்தம்: உள்ளக பதிவு கோப்பில் எழுதத் தொடங்குங்கள்.

# toast_message_debug_logging_to_file_stopped
source: Debug: Stop writing to a local log file.
ta: பிழைத்திருத்தம்: உள்ளக பதிவு கோப்பில் எழுதுவதை நிறுத்துங்கள்.

# toast_message_install_file_helper
source: Please install a file manager or a podcast player first.
ta: முதலில் ஒரு கோப்பு மேலாளர் அல்லது போட்காச்ட் பிளேயரை நிறுவவும்.

# toast_message_playback_speed_reset
source: Playback speed reset.
ta: பின்னணி வேக மீட்டமைப்பு.

# toast_message_refreshing_cover
source: Refreshing podcast cover.
ta: புத்துணர்ச்சியூட்டும் போட்காச்ட் கவர்.

# toast_message_save_opml
source: Saving podcast collection as OPML.
ta: போட்காச்ட் சேகரிப்பை OPML ஆக சேமித்தல்.

# toast_message_skipping_disabled
source: Playback is not running. Skipping is turned off.
ta: பிளேபேக் இயங்கவில்லை. ச்கிப்பிங் அணைக்கப்படுகிறது.

# toast_message_sleep_timer_unable_to_start
source: Please start listening to an episode first.
ta: முதலில் ஒரு அத்தியாயத்தைக் கேட்கத் தொடங்குங்கள்.

# toast_message_theme_day
source: Switching to 'Day mode' (long press detected)
ta: 'நாள் பயன்முறைக்கு' மாறுதல் (நீண்ட செய்தித் தாள் கண்டறியப்பட்டது)

# toast_message_theme_follow_system
source: Switching to 'Follow System Setting mode' (long press detected)
ta: 'கணினி அமைவு பயன்முறையைப் பின்பற்றுங்கள்' (நீண்ட அழுத்தத்தைக் கண்டறியவும்)

# toast_message_theme_night
source: Switching to 'Night mode' (long press detected)
ta: 'நைட் பயன்முறைக்கு' மாறுதல் (நீண்ட செய்தித் தாள் கண்டறியப்பட்டது)

# toast_message_up_next_added_episode
source: Added episode to 'Up Next' queue.
ta: 'அப் நெக்ச்ட்' வரிசையில் எபிசோட் சேர்த்தது.

# toast_message_up_next_removed_episode
source: Removed episode from 'Up Next' queue.
ta: 'அப் நெக்ச்ட்' வரிசையில் இருந்து எபிசோட் அகற்றப்பட்டது.

# toast_message_up_next_start_playback
source: Starting next episode…
ta: அடுத்த அத்தியாயத்தைத் தொடங்குகிறது…

# toast_message_updating_collection
source: Updating podcast collection.
ta: போட்காச்ட் சேகரிப்பைப் புதுப்பித்தல்.

# toast_message_total_number_of_episodes
source: Total number of episodes stored in database:
ta: தரவுத்தளத்தில் சேமிக்கப்பட்டுள்ள அத்தியாயங்களின் மொத்த எண்ணிக்கை:

# podcast_list_button_add_podcast
source: Add podcast
ta: போட்காச்ட் சேர்க்கவும்

# podcast_list_button_settings
source: Settings
ta: அமைப்புகள்

# podcast_list_button_toggle_hide_older_episodes
source: Hide older episodes
ta: பழைய அத்தியாயங்களை மறைக்கவும்

# podcast_list_button_toggle_show_older_episodes
source: Older episodes
ta: பழைய அத்தியாயங்கள்

# podcast_list_button_all_episodes
source: All episodes
ta: அனைத்து அத்தியாயங்களும்

# episode_list_filter_all
source: All Episodes
ta: அனைத்து அத்தியாயங்களும்

# episode_list_filter_downloaded
source: Downloaded Episodes
ta: பதிவிறக்கம் செய்யப்பட்ட அத்தியாயங்கள்

# notification_now_playing_channel_description
source: Playback controls, episode name and cover.
ta: பிளேபேக் கட்டுப்பாடுகள், எபிசோட் பெயர் மற்றும் கவர்.

# notification_now_playing_channel_name
source: Playback Controls
ta: பிளேபேக் கட்டுப்பாடுகள்

# notification_dismiss
source: Dismiss notification
ta: அறிவிப்பை நிராகரிக்கவும்

# notification_pause
source: Pause
ta: இடைநிறுத்தம்

# notification_play
source: Play
ta: விளையாடுங்கள்

# notification_playing
source: Playing…
ta: விளையாடுவது…

# notification_skip_back
source: Skip back
ta: திரும்புக

# notification_skip_forward
source: Skip forward
ta: முன்னோக்கி செல்லுங்கள்

# pref_about_title
source: About
ta: பற்றி

# pref_advanced_title
source: Advanced
ta: மேம்பட்ட

# pref_app_version_summary
source: Version
ta: பதிப்பு

# pref_app_version_title
source: App Version
ta: பயன்பாட்டு பதிப்பு

# pref_background_refresh_summary_enabled
source: Looking for podcast episodes in background…
ta: பின்னணியில் போட்காச்ட் அத்தியாயங்களைத் தேடுகிறது…

# pref_background_refresh_summary_disabled
source: Not looking for podcast episodes in background.
ta: பின்னணியில் போட்காச்ட் அத்தியாயங்களைத் தேடவில்லை.

# pref_background_refresh_title
source: Background Refresh
ta: பின்னணி புதுப்பிப்பு

# pref_delete_all_summary
source: Delete downloaded episodes to free up space on your device. You can download them again at any time.
ta: உங்கள் சாதனத்தில் இடத்தை விடுவிக்க பதிவிறக்கம் செய்யப்பட்ட அத்தியாயங்களை நீக்கு. எந்த நேரத்திலும் அவற்றை மீண்டும் பதிவிறக்கம் செய்யலாம்.

# pref_delete_all_storage_space_available
source: Available
ta: கிடைக்கிறது

# pref_delete_all_storage_space_used
source: Used
ta: பயன்படுத்தப்பட்டது

# pref_delete_all_title
source: Delete Downloads
ta: பதிவிறக்கங்களை நீக்கு

# pref_episode_download_over_mobile_summary_enabled
source: Downloading podcast episodes over Wi-Fi and mobile network. Data charges may apply.
ta: வைஃபை மற்றும் மொபைல் நெட்வொர்க்கில் போட்காச்ட் அத்தியாயங்களைப் பதிவிறக்குகிறது. தரவு கட்டணங்கள் பொருந்தக்கூடும்.

# pref_episode_download_over_mobile_summary_disabled
source: Downloading podcast episodes over Wi-Fi only.
ta: வைஃபை மீது மட்டுமே போட்காச்ட் அத்தியாயங்களைப் பதிவிறக்குகிறது.

# pref_episode_download_over_mobile_title
source: Download Over Mobile Network
ta: மொபைல் நெட்வொர்க்கில் பதிவிறக்கவும்

# pref_general_title
source: General
ta: பொது

# pref_maintenance_title
source: Maintenance
ta: பராமரிப்பு

# pref_opml_export_summary
source: Save your podcasts feeds to an OPML file that can be imported into other players.
ta: உங்கள் பாட்காச்ட்கள் ஊட்டங்களை மற்ற வீரர்களுக்கு இறக்குமதி செய்யக்கூடிய OPML கோப்பில் சேமிக்கவும்.

# pref_opml_export_title
source: Export OPML
ta: OPML ஏற்றுமதி

# pref_opml_import_summary
source: Select an OPML file from device storage.
ta: சாதன சேமிப்பகத்திலிருந்து OPML கோப்பைத் தேர்ந்தெடுக்கவும்.

# pref_opml_import_title
source: Import OPML
ta: OPML ஐ இறக்குமதி செய்க

# pref_report_issue_summary
source: Report bugs and suggest improvements on Codeberg.
ta: பிழைகளைப் புகாரளித்து, கோட்பெர்க்கில் மேம்பாடுகளை பரிந்துரைக்கவும்.

# pref_report_issue_title
source: Report Issue
ta: சிக்கல் அறிக்கை

# pref_search_provider_selection_summary
source: Currently using:
ta: தற்போது பயன்படுத்துகிறது:

# pref_search_provider_selection_title
source: Search Provider
ta: தேடல் வழங்குநர்

# pref_tap_anywhere_playback_summary_disabled
source: Tap on the play button to start listening to an episode.
ta: ஒரு அத்தியாயத்தைக் கேட்கத் தொடங்க ப்ளே பொத்தானைத் தட்டவும்.

# pref_tap_anywhere_playback_summary_enabled
source: Tap anywhere on the card of an episode to start listening to it.
ta: அதைக் கேட்கத் தொடங்க ஒரு அத்தியாயத்தின் அட்டையில் எங்கும் தட்டவும்.

# pref_tap_anywhere_playback_title
source: Tap On Episode
ta: அத்தியாயத்தில் தட்டவும்

# pref_theme_selection_mode_dark
source: Dark mode
ta: இருண்ட முறை

# pref_theme_selection_mode_device_default
source: Same as device
ta: சாதனம் அதே

# pref_theme_selection_mode_light
source: Light mode
ta: ஒளி பயன்முறை

# pref_theme_selection_summary
source: Current theme:
ta: தற்போதைய தீம்:

# pref_theme_selection_title
source: App Theme
ta: பயன்பாட்டு கருப்பொருள்

# pref_update_covers_summary
source: Download the latest version of all podcast covers in your collection.
ta: உங்கள் சேகரிப்பில் உள்ள அனைத்து போட்காச்ட் அட்டைகளின் அண்மைக் கால பதிப்பையும் பதிவிறக்கவும்.

# pref_update_covers_title
source: Update Covers
ta: கவர்கள் புதுப்பித்தல்

# descr_app_icon
source: App icon depicting an escape capsule in space
ta: விண்வெளியில் தப்பிக்கும் காப்ச்யூலை சித்தரிக்கும் பயன்பாட்டு படவுரு

# descr_back_icon
source: Navigate back
ta: மீண்டும் செல்லவும்

# descr_card_add_new_button
source: Add new podcast feed
ta: புதிய போட்காச்ட் ஊட்டத்தைச் சேர்க்கவும்

# descr_card_delete_episode_button
source: Remove downloaded episode
ta: பதிவிறக்கம் செய்யப்பட்ட அத்தியாயத்தை அகற்று

# descr_card_playback_indicator
source: Playback progress
ta: பின்னணி முன்னேற்றம்

# descr_card_podcast_cover
source: Podcast cover image
ta: போட்காச்ட் கவர் படம்

# descr_card_small_download_button
source: Download
ta: பதிவிறக்கம்

# descr_card_small_playback_button
source: Play/pause
ta: விளையாடு/இடைநிறுத்தம்

# descr_episode_list_filter_button
source: Filter symbol
ta: வடிகட்டி அடையாளம்

# descr_expanded_episode_length
source: Episode length
ta: அத்தியாயம் நீளம்

# descr_expanded_player_debug_log_toggle_button
source: Debug log file toggle
ta: பிழைத்திருத்த பதிவு கோப்பு மாற்று

# descr_expanded_player_forward_button
source: Forward 30 seconds
ta: முன்னோக்கி 30 வினாடிகள்

# descr_expanded_player_next_chapter_button
source: Next chapter
ta: அடுத்த அத்தியாயம்

# descr_expanded_player_playback_button
source: Play/pause
ta: விளையாடு/இடைநிறுத்தம்

# descr_expanded_player_playback_speed_button
source: Increase playback speed
ta: பிளேபேக் வேகத்தை அதிகரிக்கவும்

# descr_expanded_player_podcast_cover
source: Large podcast cover image
ta: பெரிய போட்காச்ட் கவர் படம்

# descr_expanded_player_previous_chapter_button
source: Previous chapter
ta: முந்தைய அத்தியாயம்

# descr_expanded_player_replay_button
source: Replay last 10 seconds
ta: மீண்டும் 10 வினாடிகள்

# descr_expanded_player_seekbar
source: Episode playback time
ta: எபிசோட் பிளேபேக் நேரம்

# descr_expanded_player_shownotes_symbol
source: Show-notes symbol
ta: காட்சி-குறிப்புகள் அடையாளம்

# descr_expanded_player_sleep_timer_cancel_button
source: Cancel sleep timer
ta: ச்லீப் டைமரை ரத்துசெய்

# descr_expanded_player_sleep_timer_remaining_time
source: Time remaining on sleep timer
ta: தூக்க டைமரில் மீதமுள்ள நேரம்

# descr_expanded_player_sleep_timer_start_button
source: Start sleep timer
ta: தூக்க டைமரைத் தொடங்குங்கள்

# descr_expanded_player_time_played
source: Time played
ta: விளையாடிய நேரம்

# descr_expanded_player_time_remaining
source: Time remaining
ta: மீதமுள்ள நேரம்

# descr_expanded_player_up_next_clear_button
source: Clear 'Up Next' queue
ta: 'அப் அடுத்து' வரிசையை அழிக்கவும்

# descr_player_playback_button
source: Play/pause
ta: விளையாடு/இடைநிறுத்தம்

# descr_player_podcast_cover
source: Small podcast cover image
ta: சிறிய போட்காச்ட் கவர் படம்

# onboarding_app_description
source: Podcast App
ta: போட்காச்ட் பயன்பாடு

# onboarding_app_get_started
source: Get Started
ta: தொடங்கவும்

# onboarding_app_hypercritical_quote_1
source: Nothing is so perfect
ta: எதுவும் சரியாக இல்லை

# onboarding_app_hypercritical_quote_2
source: that it can't be complained about.
ta: அதைப் பற்றி குற்றச்சாட்டு செய்ய முடியாது.

# sample_text_episode_shownotes
source: How a never-disclosed Windows vulnerability was quickly reverse-engineered from the patches to fix it and turned into more than 12 potent and damaging Internet worms in three days. What does this mean for the future of Internet security?
ta: ஒருபோதும் வெளிப்படுத்தப்படாத சன்னல்கள் பாதிப்பு அதை சரிசெய்ய திட்டுகளிலிருந்து எவ்வாறு விரைவாக மாற்றியமைக்கப்பட்டது மற்றும் மூன்று நாட்களில் 12 க்கும் மேற்பட்ட சக்திவாய்ந்த மற்றும் சேதப்படுத்தும் இணைய புழுக்களாக மாறியது. இணைய பாதுகாப்பின் எதிர்காலத்திற்கு இது என்ன அர்த்தம்?

# sample_text_episode_0_chapter
source: The first Internet worms of 2005
ta: 2005 ஆம் ஆண்டின் முதல் இணைய புழுக்கள்

# sample_text_episode_0_date
source: 19 Aug 2005
ta: 19 ஆகச்ட் 2005

# sample_text_episode_0_title
source: As the Worm Turns
ta: புழு திரும்பும்போது

# sample_text_playback_speed
source: 1.0 x
ta: 1.0 ஃச்

# sample_text_podcast_name
source: Security Now
ta: இப்போது பாதுகாப்பு

# sample_text_podcast_description
source: Security Now could be the most important show you watch all week. Security guru Steve Gibson, the man who coined the term spyware and created the first anti-spyware program, joins Leo Laporte every week to guide us through the minefield of ransomware, viruses, cyber espionage, hacking, etc.
ta: பாதுகாப்பு இப்போது நீங்கள் வாரம் முழுவதும் பார்க்கும் மிக முக்கியமான நிகழ்ச்சியாக இருக்கலாம். பாதுகாப்பு குரு ச்டீவ் கிப்சன், ச்பைவேர் என்ற வார்த்தையை உருவாக்கி, ச்பைவேர் எதிர்ப்பு திட்டத்தை உருவாக்கியவர், ஒவ்வொரு வாரமும் லியோ லாபோர்ட்டுடன் இணைகிறார், ransomware, வைரச்கள், சைபர் உளவு, ஏக்கிங் போன்றவற்றின் கண்ணிவெடி மூலம் எங்களுக்கு வழிகாட்டுகிறார்.

# sample_text_up_next_name
source: Spieleveteranen - Jetzt labern die auch noch!
ta: விளையாட்டு வீரர்கள் - இப்போது அவர்களும் எரிகிறார்கள்!
