Repository: 247i/TACETr
Catalog: உரை/தானி/etar-calendar-metadata-*.po
Languages: ta

# title.txt:1
source: Etar - OpenSource Calendar
ta: Ater - opensource காலண்டர்

# short_description.txt:1
source: Etar is a material designed open source calendar, for everyone!
ta: எட்டார் என்பது அனைவருக்கும் திறந்த மூல காலெண்டர் வடிவமைக்கப்பட்ட பொருள்!

# full_description.txt:1
source: Features: - Month view. - Week, day and agenda view. - Uses Android calendar storage to show all synchronized calendars. - Material Design. - Dark and light theme. - Support offline calendar. - Agenda widget. - Support sharing calendars via ICS and the ability to import/export from SD card. - Multilingual UI. Bugs and feedback: https://github.com/Etar-Group/Etar-Calendar/issues Source code: https://github.com/Etar-Group/Etar-Calendar
ta: அம்சங்கள்: - மாத பார்வை. - வாரம், நாள் மற்றும் நிகழ்ச்சி நிரல் பார்வை. - ஒத்திசைக்கப்பட்ட அனைத்து காலெண்டர்களையும் காட்ட ஆண்ட்ராய்டு காலண்டர் சேமிப்பிடத்தைப் பயன்படுத்துகிறது. - பொருள் வடிவமைப்பு. - இருண்ட மற்றும் ஒளி தீம். - இணைப்பில்லாத காலெண்டரை ஆதரிக்கவும். - நிகழ்ச்சி நிரல் விட்செட். - ஐ.சி.எச் வழியாக காலெண்டர்களைப் பகிர்வது மற்றும் எச்டி கார்டிலிருந்து இறக்குமதி/ஏற்றுமதி செய்யும் திறன் ஆகியவற்றை ஆதரிக்கவும். - பன்மொழி UI. பிழைகள் மற்றும் பின்னூட்டங்கள்: https://github.com/etar-group/etar-calendar/issues மூலக் குறியீடு: https://github.com/etar-group/etar-calendar

# changelogs/10.txt:1
source: - Add dark theme.
ta: - இருண்ட கருப்பொருள் சேர்க்கவும்.

# changelogs/11.txt:1
source: - Add an option to choose days per Week. - Add an option for the default view to show on startup. - Bug fixes.
ta: - வாரத்திற்கு நாட்களைத் தேர்வுசெய்ய ஒரு விருப்பத்தைச் சேர்க்கவும். - தொடக்கத்தில் காண்பிக்க இயல்புநிலை பார்வைக்கு ஒரு விருப்பத்தைச் சேர்க்கவும். - பிழை திருத்தங்கள்.

# changelogs/13.txt:1
source: - Support sharing calendars via ics and the ability to import/export from sdcard. - Remove unused permissions. - Fix sound setting on Android 6. - Lots of Bug fixes.
ta: - ஐ.சி.எச் வழியாக காலெண்டர்களைப் பகிர்வது மற்றும் எச்.டி.கார்டில் இருந்து இறக்குமதி/ஏற்றுமதி செய்யும் திறன் ஆகியவற்றை ஆதரிக்கவும். - பயன்படுத்தப்படாத அனுமதிகளை அகற்றவும். - ஆண்ட்ராய்டு 6 இல் ஒலி அமைப்பை சரிசெய்யவும். - நிறைய பிழை திருத்தங்கள்.

# changelogs/14.txt:1
source: - Request permissions at runtime on Android 6 upwards. - Fix crash at startup. - Allow user to squeeze display so that whole day is visible. - Set seconds to zero when creating a new event. - Minor Layout fixes. - Lots of bug fixes.
ta: - ஆண்ட்ராய்டு 6 இல் இயக்க நேரத்தில் அனுமதிகளைக் கோருங்கள். - தொடக்கத்தில் செயலிழப்பை சரிசெய்யவும். - காட்சியைக் கசக்க பயனரை அனுமதிக்கவும், இதனால் நாள் முழுவதும் தெரியும். - ஒரு புதிய நிகழ்வை உருவாக்கும் போது வினாடிகளை பூச்சியமாக அமைக்கவும். - சிறிய தளவமைப்பு திருத்தங்கள். - நிறைய பிழை திருத்தங்கள்.

# changelogs/15.txt:1
source: - Request permissions at runtime on Android 6 upwards. - Support display lunar/festival when Language is Chinese. - Update translations. - Minor Layout fixes. - Lots of bug fixes.
ta: - ஆண்ட்ராய்டு 6 இல் இயக்க நேரத்தில் அனுமதிகளைக் கோருங்கள். - மொழி சீனமாக இருக்கும்போது காட்சி சந்திர/திருவிழா ஆதரவு. - மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும். - சிறிய தளவமைப்பு திருத்தங்கள். - நிறைய பிழை திருத்தங்கள்.

# changelogs/16.txt:1
source: - Dropped the widget, use Calendar Widget for now: https://f-droid.org/de/packages/com.plusonelabs.calendar/. - Support for custom color events. - Better support for ics files. - Add grey theme. - Support visibility confidential. - Support new Android notification channels. - Lots of bug fixes.
ta: . - தனிப்பயன் வண்ண நிகழ்வுகளுக்கான ஆதரவு. - ஐ.சி.எச் கோப்புகளுக்கு சிறந்த ஆதரவு. - சாம்பல் கருப்பொருள் சேர்க்கவும். - தெரிவுநிலை ரகசியத்தை ஆதரிக்கவும். - புதிய ஆண்ட்ராய்டு அறிவிப்பு சேனல்களை ஆதரிக்கவும். - நிறைய பிழை திருத்தங்கள்.

# changelogs/17.txt:1
source: - Improved month view. - Permission to read contacts is optional again. - Fancier text boxes during event creation. - Minor bug fixes.
ta: - மேம்பட்ட மாத பார்வை. - தொடர்புகளைப் படிக்க இசைவு மீண்டும் விருப்பமானது. - நிகழ்வு உருவாக்கத்தின் போது ஆர்வமுள்ள உரை பெட்டிகள். - சிறிய பிழை திருத்தங்கள்.

# changelogs/18.txt:1
source: - Bugs in month view fixed. - Fixed dark theme on tablets. - New translations.
ta: - மாதக் காட்சியில் பிழைகள் சரி செய்யப்பட்டன. - டேப்லெட்டுகளில் நிலையான இருண்ட தீம். - புதிய மொழிபெயர்ப்புகள்.

# changelogs/19.txt:1
source: - Notification bugfix. - New translations.
ta: - அறிவிப்பு பிழைத்திருத்தம். - புதிய மொழிபெயர்ப்புகள்.

# changelogs/20.txt:1
source: - Extra Notifications required for internal alert sync. Please mute. - No longer required permissions removed. - Colored notification icon. - Bugfixes. - New translations.
ta: - உள் எச்சரிக்கை ஒத்திசைவுக்கு கூடுதல் அறிவிப்புகள் தேவை. தயவுசெய்து முடக்கு. - இனி தேவையில்லை அனுமதிகள் அகற்றப்படவில்லை. - வண்ண அறிவிப்பு ஐகான். - பிழைத்திருத்தங்கள். - புதிய மொழிபெயர்ப்புகள்.

# changelogs/21.txt:1
source: - Bugfixes. - New translations.
ta: - பிழைத்திருத்தங்கள். - புதிய மொழிபெயர்ப்புகள்.

# changelogs/22.txt:1
source: - Add offline calender. - Add shortcut for new event. - New preferences design. - New datetime picker. - Switch license to GPLv3. - Bugfixes. - New translations.
ta: - இணைப்பில்லாத காலெண்டரைச் சேர்க்கவும். - புதிய நிகழ்வுக்கு குறுக்குவழியைச் சேர்க்கவும். - புதிய விருப்பத்தேர்வுகள் வடிவமைப்பு. - புதிய தேதிநேர தேர்வாளர். - GPLV3 க்கு உரிமத்தை மாற்றவும். - பிழைத்திருத்தங்கள். - புதிய மொழிபெயர்ப்புகள்.

# changelogs/23.txt:1
source: - Bugfix for options display. - New translations.
ta: - விருப்பங்கள் காட்சிக்கு பிழைத்திருத்தம். - புதிய மொழிபெயர்ப்புகள்.

# changelogs/24.txt:1
source: - Reduce font size of event names in week view - Activate recent search suggestions - Fix export to SD card - Strike through title of canceled events - Make use of system theme setting on android 10 - New translations - Bugfixes
ta: - வாரக் காட்சியில் நிகழ்வு பெயர்களின் எழுத்துரு அளவைக் குறைக்கவும் - அண்மைக் கால தேடல் பரிந்துரைகளை செயல்படுத்தவும் - எச்டி கார்டுக்கு ஏற்றுமதி சரிசெய்யவும் - ரத்து செய்யப்பட்ட நிகழ்வுகளின் தலைப்பு மூலம் வேலைநிறுத்தம் - ஆண்ட்ராய்டு 10 இல் கணினி கருப்பொருள் அமைப்பைப் பயன்படுத்துங்கள் - புதிய மொழிபெயர்ப்புகள் - பிழைத்திருத்தங்கள்

# changelogs/25.txt:1
source: - Recover time zone database - SVG app icon - Rework and reactivate the widget - New translations
ta: - நேர மண்டல தரவுத்தளத்தை மீட்டெடுக்கவும் - எச்.வி.சி பயன்பாட்டு படவுரு - விட்செட்டை மறுவேலை செய்து மீண்டும் செயல்படுத்தவும் - புதிய மொழிபெயர்ப்புகள்

# changelogs/26.txt:1
source: - Rework edit event layout - Drop support for Android 4.4 - General bug fixes - New translations
ta: - நிகழ்வு தளவமைப்பைத் திருத்து - ஆண்ட்ராய்டு 4.4 க்கான ஆதரவை கைவிடவும் - பொது பிழை திருத்தங்கள் - புதிய மொழிபெயர்ப்புகள்

# changelogs/27.txt:1
source: - General bug fixes - New translations
ta: - பொது பிழை திருத்தங்கள் - புதிய மொழிபெயர்ப்புகள்

# changelogs/28.txt:1
source: - General bug fixes - New translations
ta: - பொது பிழை திருத்தங்கள் - புதிய மொழிபெயர்ப்புகள்

# changelogs/29.txt:1
source: - Support Android 12 - Support Material You Design - Remove connection to Android service for database backup (broken in most Android versions) - General bug fixes - New translations
ta: - ஆண்ட்ராய்டு 12 ஐ ஆதரிக்கவும் - நீங்கள் வடிவமைக்கும் உதவி பொருள் - தரவுத்தள காப்புப்பிரதிக்கான ஆண்ட்ராய்டு சேவைக்கான இணைப்பை அகற்று (பெரும்பாலான ஆண்ட்ராய்டு பதிப்புகளில் உடைக்கப்பட்டது) - பொது பிழை திருத்தங்கள் - புதிய மொழிபெயர்ப்புகள்

# changelogs/30.txt:1
source: - Fix notifications on Android 12 - Add DecSync and Birthday Adapter to "known" apps and don't crash
ta: - ஆண்ட்ராய்டு 12 இல் அறிவிப்புகளை சரிசெய்யவும் - "அறியப்பட்ட" பயன்பாடுகளில் decsync மற்றும் பிறந்தநாள் அடாப்டரைச் சேர்க்கவும், செயலிழக்க வேண்டாம்

# changelogs/31.txt:1
source: - Fix crash and notifications on Android 12 - Fix MIME type of shared event
ta: - ஆண்ட்ராய்டு 12 இல் செயலிழப்பு மற்றும் அறிவிப்புகளை சரிசெய்யவும் - பகிரப்பட்ட நிகழ்வின் MIME வகை சரிசெய்யவும்

# changelogs/32.txt:1
source: - Create and show reminders after start of event using a checkbox - Repair reminder with negative values - Fix invalid times due to timezone changes - Option to add a new event from the widget screen - Rework theme colors - Bugfixes - New translations
ta: - தேர்வுப்பெட்டியைப் பயன்படுத்தி நிகழ்வைத் தொடங்கிய பின் நினைவூட்டல்களை உருவாக்கி காண்பி - எதிர்மறை மதிப்புகளுடன் நினைவூட்டல் - நேர மண்டல மாற்றங்கள் காரணமாக தவறான நேரங்களை சரிசெய்யவும் - விட்செட் திரையில் இருந்து புதிய நிகழ்வைச் சேர்க்க விருப்பம் - மறுவேலை கருப்பொருள் வண்ணங்கள் - பிழைத்திருத்தங்கள் - புதிய மொழிபெயர்ப்புகள்

# changelogs/33.txt:1
source: - Add option to duplicate events - Show weekdays on tablet - Fix crash when opening an event with very large ID - Rework mini calendar in the tablet view - Add support for Themed App Icons in Android 13 - Show multiday events with correct start and end points - Bugfixes - New translations
ta: - நிகழ்வுகளை நகல் செய்ய விருப்பத்தைச் சேர்க்கவும் - டேப்லெட்டில் வார நாட்களைக் காட்டு - மிகப் பெரிய ஐடியுடன் ஒரு நிகழ்வைத் திறக்கும்போது செயலிழப்பை சரிசெய்யவும் - டேப்லெட் பார்வையில் மினி காலெண்டரை மறுவேலை செய்யுங்கள் - ஆண்ட்ராய்டு 13 இல் கருப்பொருள் பயன்பாட்டு சின்னங்களுக்கான ஆதரவைச் சேர்க்கவும் - சரியான தொடக்க மற்றும் இறுதி புள்ளிகளுடன் மல்டிடே நிகழ்வுகளைக் காட்டுங்கள் - பிழைத்திருத்தங்கள் - புதிய மொழிபெயர்ப்புகள்

# changelogs/34.txt:1
source: - Bugfixes - New translations
ta: - பிழைத்திருத்தங்கள் - புதிய மொழிபெயர்ப்புகள்

# changelogs/35.txt:1
source: - Add url field - Bugfixes - New translations
ta: - முகவரி புலத்தைச் சேர்க்கவும் - பிழைத்திருத்தங்கள் - புதிய மொழிபெயர்ப்புகள்

# changelogs/36.txt:1
source: - Bugfixes - New translations
ta: - பிழைத்திருத்தங்கள் - புதிய மொழிபெயர்ப்புகள்

# changelogs/37.txt:1
source: - Add per-app language support(android 13+) - Add left/right swipe to month view - Bugfixes - New translations
ta: - பயன்பாடு க்கு பயன்பாடு மொழி ஆதரவைச் சேர்க்கவும் (Android 13+) - மாதக் காட்சிக்கு இடது/வலது ச்வைப் சேர்க்கவும் - பிழைத்திருத்தங்கள் - புதிய மொழிபெயர்ப்புகள்

# changelogs/38.txt:1
source: - Fix crash on recurring events
ta: - தொடர்ச்சியான நிகழ்வுகளில் செயலிழப்பை சரிசெய்யவும்

# changelogs/39.txt:1
source: - Fix crash on month and week view due to invalid rrule - Bugfixes
ta: - தவறான RRULE காரணமாக மாதம் மற்றும் வாரக் காட்சியில் செயலிழப்பை சரிசெய்யவும் - பிழைத்திருத்தங்கள்

# changelogs/40.txt:1
source: - Hopefully, finally, fixed a crash on month and week view due to invalid rrule - Bugfixes
ta: . - பிழைத்திருத்தங்கள்

# changelogs/41.txt:1
source: - Fix F-Droid compile error
ta: - எஃப்-டிராய்டு தொகுத்தல் பிழையை சரிசெய்யவும்

# changelogs/42.txt:1
source: - Don't close edit event page when phone is rotated - Calendar notifications per calendar - Add preference: Don't check battery optimization
ta: - தொலைபேசி சுழற்றும்போது நிகழ்வு பக்கத்தைத் திருத்த வேண்டாம் - ஒரு காலெண்டருக்கு காலண்டர் அறிவிப்புகள் - விருப்பத்தைச் சேர்க்கவும்: பேட்டரி தேர்வுமுறை சரிபார்க்க வேண்டாம்

# changelogs/43.txt:1
source: - Add confirmation dialog on event discard - Add no snooze option - Improve left/right swipe and up/down swipe in month view - Small bugfixes
ta: - நிகழ்வு நிராகரிப்பில் உறுதிப்படுத்தல் உரையாடலைச் சேர்க்கவும் - உறக்கநிலை விருப்பத்தை சேர்க்கவும் - மாதக் காட்சியில் இடது/வலது ச்வைப் மற்றும் அப்/டவுன் ச்வைப் மேம்படுத்தவும் - சிறிய பிழைகள்

# changelogs/44.txt:1
source: - Add missing permission - Fix build failure
ta: - காணாமல் போன அனுமதியைச் சேர்க்கவும் - உருவாக்க தோல்வியை சரிசெய்யவும்

# changelogs/45.txt:1
source: - Fix build failure
ta: - உருவாக்க தோல்வியை சரிசெய்யவும்

# changelogs/46.txt:1
source: - Allow editing calendar on existing events - Fix go-to date function - Small bugfixes
ta: - ஏற்கனவே உள்ள நிகழ்வுகளில் காலெண்டரைத் திருத்த அனுமதிக்கவும் - செல்ல வேண்டிய தேதி செயல்பாட்டை சரிசெய்யவும் - சிறிய பிழைகள்

# changelogs/47.txt:1
source: - Tap on current month to open go to date - Small bugfixes
ta: - தேதிக்கு திறக்க நடப்பு மாதத்தைத் தட்டவும் - சிறிய பிழைகள்

# changelogs/48.txt:1
source: - Drop support for android 5 - Go back to default view instead of quitting - Clear notification after event ends - Small bugfixes
ta: - ஆண்ட்ராய்டு 5 க்கான ஆதரவை கைவிடவும் - வெளியேறுவதற்கு பதிலாக இயல்புநிலை பார்வைக்கு திரும்பவும் - நிகழ்வு முடிந்ததும் அறிவிப்பை அழிக்கவும் - சிறிய பிழைகள்

# changelogs/6.txt:1
source: - Removing Internet permission while keeping the same functionality. - Add 'Go To...'. - Fix: Agenda widget doesn't update daily.
ta: - அதே செயல்பாட்டை வைத்திருக்கும் போது இணைய அனுமதியை நீக்குதல். - 'செல்லுங்கள் ...' ஐச் சேர்க்கவும். - சரி: நிகழ்ச்சி நிரல் விட்செட் தினமும் புதுப்பிக்கப்படாது.

# changelogs/9.txt:1
source: - Some better UI changes. - Update Swedish translation. - Bug fixes.
ta: - சில சிறந்த இடைமுகம் மாற்றங்கள். - ச்வீடிச் மொழிபெயர்ப்பைப் புதுப்பிக்கவும். - பிழை திருத்தங்கள்.
