Repository: 247i/TACETr
Catalog: உரை/தானி/facilmap-facilmap-frontend-*.po
Languages: ta

# common.coordinates
source: Coordinates
ta: ஒருங்கிணைப்புகள்

# about-dialog.header
source: About FacilMap {{version}}
ta: FacilMap பற்றி {{version}}

# about-dialog.license-text
source: {{facilmap}} is available under the {{license}}.
ta: {{{facilmap}}} இன் கீழ் கிடைக்கிறது.

# about-dialog.license-text-facilmap
source: FacilMap
ta: வசதி

# about-dialog.license-text-license
source: GNU Affero General Public License, Version 3
ta: குனு பொது பொது உரிமம் பதிப்பு 3

# about-dialog.issues-text
source: If something does not work or you have a suggestion for improvement, please report on the {{tracker}}.
ta: ஏதாவது வேலை செய்யவில்லை அல்லது முன்னேற்றத்திற்கான பரிந்துரை இருந்தால், தயவுசெய்து {{tracker}} இல் புகாரளிக்கவும்.

# about-dialog.issues-text-tracker
source: issue tracker
ta: வெளியீடு டிராக்கர்

# about-dialog.help-text
source: If you have a question, please have a look at the {{documentation}}, raise a question in the {{discussions}} or ask in the {{chat}}.
ta: உங்களிடம் ஒரு கேள்வி இருந்தால், தயவுசெய்து {{documentation}} ஐப் பாருங்கள், {{discussions}} இல் ஒரு கேள்வியை எழுப்புங்கள் அல்லது {{chat} in இல் கேளுங்கள்.

# about-dialog.help-text-documentation
source: documentation
ta: ஆவணப்படுத்துதல்

# about-dialog.help-text-discussions
source: discussion forum
ta: கலந்துரையாடல் மன்றம்

# about-dialog.help-text-chat
source: Matrix chat
ta: அணி அரட்டை

# about-dialog.privacy-information
source: Privacy information
ta: தனியுரிமை செய்தி

# about-dialog.map-data
source: Map data
ta: வரைபட தரவு

# about-dialog.map-data-search
source: Search
ta: தேடல்

# about-dialog.map-data-pois
source: POIs
ta: பின்னர்

# about-dialog.map-data-directions
source: Directions
ta: திசைகள்

# about-dialog.map-data-geoip
source: GeoIP
ta: சியோப்

# about-dialog.map-data-geoip-description
source: This product includes GeoLite2 data created by MaxMind, available from {{maxmind}}.
ta: இந்த தயாரிப்பில் மேக்ச்மின்ட் உருவாக்கிய சியோலைட் 2 தரவு அடங்கும், இது {{maxmind} இருந்து இலிருந்து கிடைக்கிறது.

# about-dialog.attribution-osm-contributors
source: OSM Contributors
ta: OSM பங்களிப்பாளர்கள்

# about-dialog.programs-libraries
source: Programs/libraries
ta: திட்டங்கள்/நூலகங்கள்

# about-dialog.icons
source: Icons
ta: சின்னங்கள்

# add.hidden-markers-added-title
source: Marker added
ta: மார்க்கர் சேர்க்கப்பட்டது

# add.hidden-markers-added-message
source: The marker has been added successfully, but the active filter is preventing it from being shown.
ta: மார்க்கர் வெற்றிகரமாக சேர்க்கப்பட்டுள்ளது, ஆனால் செயலில் உள்ள வடிகட்டி அதைக் காண்பிப்பதைத் தடுக்கிறது.

# add.hidden-lines-added-title
source: Line added
ta: வரி சேர்க்கப்பட்டது

# add.hidden-lines-added-message
source: The line has been added successfully, but the active filter is preventing it from being shown.
ta: வரி வெற்றிகரமாக சேர்க்கப்பட்டுள்ளது, ஆனால் செயலில் உள்ள வடிகட்டி அதைக் காண்பிப்பதைத் தடுக்கிறது.

# add.hidden-objects-added-title
source: {{count}} objects added
ta: {{count}} பொருள்கள் சேர்க்கப்பட்டன

# add.hidden-objects-added-message
source: {{count}} objects have been added successfully, but the active filter is preventing them from being shown.
ta: {{count}} பொருள்கள் வெற்றிகரமாக சேர்க்கப்பட்டுள்ளன, ஆனால் செயலில் உள்ள வடிகட்டி அவற்றைக் காண்பிப்பதைத் தடுக்கிறது.

# add.hidden-objects-added-message-some
source: {{count}} objects have been added successfully, but the active filter is preventing some of them from being shown.
ta: {{count}} பொருள்கள் வெற்றிகரமாக சேர்க்கப்பட்டுள்ளன, ஆனால் செயலில் உள்ள வடிகட்டி அவற்றில் சில காண்பிக்கப்படுவதைத் தடுக்கிறது.

# add-to-map-dropdown.fallback-label
source: Add to map
ta: வரைபடத்தில் சேர்க்கவும்

# add-to-map-dropdown.add-error
source: Error adding to map
ta: வரைபடத்தில் சேர்ப்பது பிழை

# add-to-map-dropdown.add-marker-items
source: Marker items as {{typeName}}
ta: மார்க்கர் உருப்படிகள் {{typeName}}

# add-to-map-dropdown.add-line-items
source: Line/polygon items as {{typeName}}
ta: வரி/பலகோண உருப்படிகள் {{typeName}}

# alert.fallback-ok-label
source: OK
ta: சரி

# blame-results.show-details-tooltip
source: Show details
ta: விவரங்களைக் காட்டு

# blame-results.zoom-to-section-tooltip
source: Zoom to section
ta: பிரிவுக்கு பெரிதாக்கு

# blame-results.zoom-to-feature-label
source: Zoom to feature
ta: இடம்பெற பெரிதாக்கவும்

# blame-section-info.changeset
source: Changeset
ta: மாற்றங்கள்

# blame-section-info.changeset-analyze
source: Analyze changeset
ta: மாற்றங்களை பகுப்பாய்வு செய்யுங்கள்

# blame-section-info.timestamp
source: Timestamp
ta: நேர முத்திரை

# blame-section-info.user
source: User
ta: பயனர்

# blame-section-info.created-modified
source: Created/modified
ta: உருவாக்கப்பட்டது/மாற்றியமைக்கப்பட்டது

# blame-section-membership.tooltip
source: Show membership hierarchy
ta: உறுப்பினர் வரிசைக்கு காட்டு

# blame-section-membership.alt
source: Info
ta: தகவல்

# blame-section-membership.heading
source: Membership hierarchy
ta: உறுப்பினர் வரிசைமுறை

# blame-section-membership.member-with-name-role
source: {{feature}} ({{name}}, role: {{role}})
ta: {{feature}} ({{name}}, பங்கு: {{role}})

# blame-section-membership.member-with-role
source: {{feature}} (role: {{role}})
ta: {{feature}} (பங்கு: {{role}})

# changeset-results.heading
source: Changeset {{id}}
ta: மாற்றங்கள் {{id}}}

# changeset-results.created
source: Creation time
ta: உருவாக்கிய நேரம்

# changeset-results.closed
source: Closing time
ta: நிறைவு நேரம்

# changeset-results.user
source: User
ta: பயனர்

# changeset-results.features
source: Features
ta: நற்பொருத்தங்கள்

# changeset-results.created-tooltip
source: Created
ta: உருவாக்கப்பட்டது

# changeset-results.deleted-tooltip
source: Deleted
ta: நீக்கப்பட்டது

# changeset-results.modified-tooltip
source: Modified
ta: மாற்றியமைக்கப்பட்ட

# changeset-results.zoom-to-feature-tooltip
source: Zoom to feature
ta: இடம்பெற பெரிதாக்கவும்

# changeset-results.show-details-tooltip
source: Show details
ta: விவரங்களைக் காட்டு

# changeset-results.show-details-no-tag-changes-tooltip
source: Show details (no tag changes)
ta: விவரங்களைக் காட்டு (குறிச்சொல் மாற்றங்கள் இல்லை)

# changeset-results.show-details-no-tag-member-changes-tooltip
source: Show details (no tag/member changes)
ta: விவரங்களைக் காட்டு (குறிச்சொல்/உறுப்பினர் மாற்றங்கள் இல்லை)

# changeset-results.zoom-to-changeset-label
source: Zoom to changeset
ta: மாற்றங்களை பெரிதாக்கவும்

# changeset-feature-info.zoom-to-feature-label
source: Zoom to feature
ta: இடம்பெற பெரிதாக்கவும்

# changeset-feature-info.members
source: Members
ta: உறுப்பினர்கள்

# osm-feature-link.changeset
source: Changeset {{id}}
ta: மாற்றங்கள் {{id}}}

# osm-feature-link.node-tooltip
source: Open node on OpenStreetMap
ta: OpenStreetMap இல் முனை திறக்கவும்

# osm-feature-link.way-tooltip
source: Open way on OpenStreetMap
ta: OpenStreetMap இல் திறந்த வழி

# osm-feature-link.relation-tooltip
source: Open relation on OpenStreetMap
ta: OpenStreetMap இல் திறந்த உறவு

# osm-feature-link.changeset-tooltip
source: Open changeset on OpenStreetMap
ta: OpenStreetMap இல் மாற்றங்களைத் திறக்கவும்

# osm-feature-link.user-tooltip
source: Open user on OpenStreetMap
ta: OpenStreetMap இல் பயனரைத் திறக்கவும்

# osm-feature-info.zoom-to-node
source: Zoom to node
ta: முனைக்கு பெரிதாக்கு

# osm-feature-info.zoom-to-way
source: Zoom to way
ta: வழி பெரிதாக்கவும்

# osm-feature-info.zoom-to-relation
source: Zoom to relation
ta: உறவுக்கு பெரிதாக்கு

# osm-feature-info.show-details-tooltip
source: Show feature details
ta: அம்ச விவரங்களைக் காட்டு

# osm-feature-info.total-length
source: Total length
ta: மொத்த நீளம்

# osm-feature-info.sections
source: Sections
ta: பிரிவுகள்

# osm-feature-info.nodes
source: Nodes
ta: முனைகள்

# osm-feature-info.members
source: Relation members
ta: உறவு உறுப்பினர்கள்

# osm-feature-info.section-label
source: Section ({{distance}})
ta: பிரிவு ({{distance}})

# osm-feature-info.zoom-to-section-tooltip
source: Zoom to section
ta: பிரிவுக்கு பெரிதாக்கு

# osm-feature-info.role
source: Role
ta: பங்கு

# click-marker-tab.look-up-error
source: Error looking up point
ta: பிழை பார்க்கும் பிழை

# client-provider.loading-map-header
source: Loading
ta: ஏற்றுகிறது

# client-provider.loading-map
source: Loading map…
ta: வரைபடம் ஏற்றுகிறது…

# client-provider.connecting-header
source: Connecting
ta: இணைத்தல்

# client-provider.connecting
source: Connecting to server…
ta: சேவையகத்துடன் இணைக்கிறது…

# client-provider.map-deleted-header
source: Map deleted
ta: வரைபடம் நீக்கப்பட்டது

# client-provider.map-deleted
source: This map has been deleted.
ta: இந்த வரைபடம் நீக்கப்பட்டது.

# client-provider.close-map
source: Close map
ta: வரைபடத்தை மூடு

# client-provider.connection-error
source: Error connecting to server
ta: சேவையகத்துடன் இணைப்பதில் பிழை

# client-provider.open-map-error
source: Error opening map
ta: வரைபடத்தைத் திறக்கும் பிழை

# client-provider.disconnected-header
source: Disconnected
ta: துண்டிக்கப்பட்டது

# client-provider.disconnected
source: The connection to the server was lost. Trying to reconnect…
ta: சேவையகத்திற்கான இணைப்பு இழந்தது. மீண்டும் இணைக்க முயற்சிக்கிறது…

# colour-picker.format-error
source: Needs to be in 6-digit hex format, for example 0000ff.
ta: 6 இலக்க ஃச் வடிவத்தில் இருக்க வேண்டும், எடுத்துக்காட்டாக 0000 எஃப்.

# coordinates.copied-title
source: Coordinates copied
ta: நகலெடுக்கப்பட்ட ஒருங்கிணைப்புகள்

# coordinates.copied-message
source: The coordinates were copied to the clipboard.
ta: ஆயத்தொகுப்புகள் கிளிப்போர்டில் நகலெடுக்கப்பட்டன.

# coordinates.copy-to-clipboard
source: Copy to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கவும்

# coordinates.elevation
source: Elevation
ta: உயர்வு ரேகை

# copy-to-clipboard-input.copied-fallback-title
source: Link copied
ta: இணைப்பு நகலெடுக்கப்பட்டது

# copy-to-clipboard-input.copied-fallback-message
source: The link was copied to the clipboard.
ta: இணைப்பு இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது.

# copy-to-clipboard-input.copy-fallback-tooltip
source: Copy to clipboard
ta: நகலெடு பெறுநர் இடைநிலைப் பலகை

# copy-to-clipboard-input.copy-alt
source: Copy
ta: நகலெடு

# copy-to-clipboard-input.qr-code-alt
source: QR code
ta: QR குறியீடு

# copy-to-clipboard-input.qr-code-fallback-tooltip
source: Show QR code
ta: QR குறியீட்டைக் காட்டு

# custom-import-dialog.existing-type
source: Existing type “{{name}}”
ta: தற்போதுள்ள வகை “{{name}}”

# custom-import-dialog.import-type
source: Import type “{{name}}”
ta: இறக்குமதி வகை “{{name}}”

# custom-import-dialog.no-import
source: Do not import
ta: இறக்குமதி செய்ய வேண்டாம்

# custom-import-dialog.import-error
source: Error importing to map
ta: வரைபடத்திற்கு இறக்குமதி செய்வதில் பிழை

# custom-import-dialog.dialog-title
source: Custom Import
ta: தனிப்பயன் இறக்குமதி

# custom-import-dialog.ok-label
source: Import
ta: இறக்குமதி

# custom-import-dialog.type
source: Type
ta: வகை

# custom-import-dialog.map-to
source: Map to…
ta: வரைபடம்…

# custom-import-dialog.markers
source: Marker of type {{typeName}} ({{count}})
ta: வகையின் மார்க்கர் {{typeName}} ({{count}})

# custom-import-dialog.lines
source: Line of type {{typeName}} ({{count}})
ta: வகை {{typeName}} ({{count}})

# custom-import-dialog.untyped-markers
source: Untyped marker ({{count}})
ta: வெட்டப்படாத மார்க்கர் ({{count}})

# custom-import-dialog.untyped-lines
source: Untyped line/polygon ({{count}})
ta: வெட்டப்படாத வரி/பலகோணம் ({{count}})

# draw.add-marker-error
source: Error adding marker
ta: மார்க்கரைச் சேர்ப்பதில் பிழை

# draw.add-marker-title
source: Add {{typeName}}
ta: {{typeName}}} சேர்க்கவும்

# draw.add-marker-message
source: Please click on the map to add a marker.
ta: மார்க்கரைச் சேர்க்க வரைபடத்தில் சொடுக்கு செய்க.

# draw.add-marker-current
source: Add at current location
ta: தற்போதைய இடத்தில் சேர்க்கவும்

# draw.add-marker-cancel
source: Cancel
ta: ரத்துசெய்

# draw.move-marker-error
source: Error moving marker
ta: மார்க்கரை நகர்த்தும் பிழை

# draw.move-marker-title
source: Drag marker
ta: இழுவை புலங்கள்

# draw.move-marker-message
source: Drag the marker to reposition it.
ta: அதை மாற்றியமைக்க மார்க்கரை இழுக்கவும்.

# draw.move-marker-save
source: Save
ta: சேமி

# draw.move-marker-current
source: Move to current location
ta: தற்போதைய இடத்திற்கு செல்லுங்கள்

# draw.move-marker-cancel
source: Cancel
ta: ரத்துசெய்

# draw.add-line-title
source: Add {{typeName}}
ta: {{typeName}}} சேர்க்கவும்

# draw.add-line-message
source: Click on the map multiple times to draw a line. Then click “Finish” to save it.
ta: ஒரு வரியை வரைய வரைபடத்தில் பல முறை சொடுக்கு செய்க. அதைச் சேமிக்க “பூச்சு” என்பதைக் சொடுக்கு செய்க.

# draw.add-line-finish
source: Finish
ta: முடிக்க

# draw.add-line-cancel
source: Cancel
ta: ரத்துசெய்

# draw.add-line-error
source: Error adding line
ta: வரி சேர்ப்பதில் பிழை

# edit-filter-dialog.title
source: Filter
ta: வடிப்பி

# edit-filter-dialog.apply
source: Apply
ta: இடு

# edit-filter-dialog.introduction
source: Here you can set an advanced expression to show/hide certain markers/lines based on their attributes. The filter expression only applies to your view of the map, but it can be persisted as part of a saved view or a shared link.
ta: சில குறிப்பான்கள்/வரிகளை அவற்றின் பண்புகளின் அடிப்படையில் காட்ட/மறைக்க ஒரு மேம்பட்ட வெளிப்பாட்டை இங்கே அமைக்கலாம். வடிகட்டி வெளிப்பாடு வரைபடத்தைப் பற்றிய உங்கள் பார்வைக்கு மட்டுமே பொருந்தும், ஆனால் இது ஒரு சேமிக்கப்பட்ட பார்வையின் ஒரு பகுதியாக அல்லது பகிரப்பட்ட இணைப்பின் ஒரு பகுதியாக தொடரலாம்.

# edit-filter-dialog.syntax-header
source: Syntax
ta: தொடரியல்

# edit-filter-dialog.variable
source: Variable
ta: மாறக்கூடிய

# edit-filter-dialog.operator
source: Operator
ta: ஆபரேட்டர்

# edit-filter-dialog.description
source: Description
ta: விவரம்

# edit-filter-dialog.example
source: Example
ta: எடுத்துக்காட்டு

# edit-filter-dialog.name-description
source: Marker/Line name
ta: மார்க்கர்/வரி பெயர்

# edit-filter-dialog.data-description-1
source: Field values (example: {{example1}} or {{example2}}).
ta: புல மதிப்புகள் (எடுத்துக்காட்டு: {{example1}} அல்லது {{example2}}).

# edit-filter-dialog.data-description-2
source: For checkbox fields, the value is {{uncheckedValue}} (unchecked) or {{checkedValue}} (checked).
ta: தேர்வுப்பெட்டி புலங்களுக்கு, மதிப்பு {{uncheckedValue}}} (தேர்வு செய்யப்படாதது) அல்லது {{checkedValue}} (சரிபார்க்கப்பட்டது).

# edit-filter-dialog.lon-lat-description
source: Marker coordinates
ta: மார்க்கர் ஒருங்கிணைப்புகள்

# edit-filter-dialog.colour-description
source: Marker/line colour
ta: மார்க்கர்/வரி நிறம்

# edit-filter-dialog.size-description
source: Marker size
ta: மார்க்கர் அளவு

# edit-filter-dialog.icon-description
source: Marker icon
ta: மார்க்கர் படவுரு

# edit-filter-dialog.shape-description
source: Marker shape
ta: மார்க்கர் வடிவம்

# edit-filter-dialog.ele-description
source: Marker elevation
ta: மார்க்கர் உயரம்

# edit-filter-dialog.mode-description
source: Line routing mode ({{straight}} / {{car}} / {{bicycle}} / {{pedestrian}} / {{track}})
ta: வரி ரூட்டிங் பயன்முறை ({{straight}} / {{car}} / {{{bicycle}} / {{pedestrian}} / {{track}})

# edit-filter-dialog.width-description
source: Line width
ta: வரி அகலம்

# edit-filter-dialog.stroke-description
source: Line stroke ({{solid}} (solid) / {{dashed}} / {{dotted}})
ta: வரி பக்கவாதம் ({{solid}} (திட) / {{dashed}} / {{dotted}}))

# edit-filter-dialog.distance-description
source: Line distance in kilometers
ta: கிலோமீட்டரில் வரி தூரம்

# edit-filter-dialog.time-description
source: Line routing time in seconds
ta: வினாடிகளில் வரி ரூட்டிங் நேரம்

# edit-filter-dialog.ascent-descent-description
source: Total climb/drop of line
ta: மொத்த ஏறுதல்/வரியின் துளி

# edit-filter-dialog.routePoints-description
source: Line point coordinates
ta: வரி புள்ளி ஒருங்கிணைப்புகள்

# edit-filter-dialog.number-description
source: Numerical value
ta: எண் மதிப்பு

# edit-filter-dialog.text-description
source: Text value
ta: உரை மதிப்பு

# edit-filter-dialog.mathematical-description
source: Mathematical operations ({{modulo}}: modulo, {{power}}: power)
ta: கணித செயல்பாடுகள் ({{{modulo}}: மாடுலோ, {{power}}: சக்தி)

# edit-filter-dialog.logical-description
source: Logical operators
ta: தருக்க ஆபரேட்டர்கள்

# edit-filter-dialog.ternary-description
source: if/then/else operator
ta: if/பின்னர்/வேறு ஆபரேட்டர்

# edit-filter-dialog.comparison-description
source: Comparison ({{notEqual}}: not equal) (case sensitive)
ta: ஒப்பீடு ({{notEqual}}: சமமாக இல்லை) (வழக்கு உணர்திறன்)

# edit-filter-dialog.list-description
source: List operator (case sensitive)
ta: பட்டியல் ஆபரேட்டர் (வழக்கு உணர்திறன்)

# edit-filter-dialog.regexp-description
source: Regular expression match (case sensitive)
ta: வழக்கமான வெளிப்பாடு போட்டி (வழக்கு உணர்திறன்)

# edit-filter-dialog.lower-description
source: Convert to lower case
ta: கீழ் வழக்குக்கு மாற்றவும்

# edit-filter-dialog.round-description
source: Round ({{ceil}}: up, {{floor}}: down)
ta: சுற்று ({{ceil}}: UP, {{floor}}: கீழே)

# edit-filter-dialog.functions-description
source: Mathematical functions
ta: கணித செயல்பாடுகள்

# edit-filter-dialog.min-max-description
source: Smallest/highest value
ta: மிகச்சிறிய/மிக உயர்ந்த மதிப்பு

# edit-line-dialog.save-error
source: Error saving line
ta: பிழை சேமிப்பு வரி

# edit-line-dialog.title
source: Edit Line
ta: வரியைத் திருத்து

# edit-line-dialog.name
source: Name
ta: பெயர்

# edit-line-dialog.routing-mode
source: Routing mode
ta: ரூட்டிங் பயன்முறை

# edit-line-dialog.colour
source: Colour
ta: நிறம்

# edit-line-dialog.width
source: Width
ta: அகலம்

# edit-line-dialog.stroke
source: Stroke
ta: பக்கவாதம்

# edit-line-dialog.change-type
source: Change type
ta: வகை மாற்றவும்

# edit-line-dialog.edit-type
source: Edit type “{{type}}”
ta: “{{type}}” எனத் திருத்து

# edit-marker-dialog.save-error
source: Error saving marker
ta: மார்க்கரைச் சேமிக்கும் பிழை

# edit-marker-dialog.title
source: Edit Marker
ta: புலங்களைத் திருத்து

# edit-marker-dialog.name
source: Name
ta: பெயர்

# edit-marker-dialog.colour
source: Colour
ta: நிறம்

# edit-marker-dialog.size
source: Size
ta: அளவு

# edit-marker-dialog.icon
source: Icon
ta: படவுரு

# edit-marker-dialog.shape
source: Shape
ta: வடிவம்

# edit-marker-dialog.change-type
source: Change type
ta: வகை மாற்றவும்

# edit-marker-dialog.edit-type
source: Edit type “{{type}}”
ta: “{{type}}” எனத் திருத்து

# edit-type-dialog.delete-field-title
source: Delete field
ta: புலத்தை நீக்கு

# edit-type-dialog.delete-field-message
source: Do you really want to delete the field “{{fieldName}}”?
ta: “{{fieldName}}” புலத்தை நீக்க விரும்புகிறீர்களா?

# edit-type-dialog.delete-field-button
source: Delete
ta: நீக்கு

# edit-type-dialog.create-type-error
source: Error creating type
ta: வகை உருவாக்கும் பிழை

# edit-type-dialog.save-type-error
source: Error saving type
ta: பிழை சேமிப்பு வகை

# edit-type-dialog.field-update-error
source: Error updating field
ta: புலத்தை புதுப்பிப்பதில் பிழை

# edit-type-dialog.field-disappeared-error
source: The field cannot be found on the type anymore.
ta: புலத்தை இனி வகையில் காண முடியாது.

# edit-type-dialog.unique-field-name-error
source: Multiple fields cannot have the same name.
ta: பல புலங்களுக்கு ஒரே பெயரைக் கொண்டிருக்க முடியாது.

# edit-type-dialog.title
source: Edit Type
ta: திருத்து வகை

# edit-type-dialog.name
source: Name
ta: பெயர்

# edit-type-dialog.type
source: Type
ta: வகை

# edit-type-dialog.type-marker
source: Marker
ta: மார்க்கர்

# edit-type-dialog.type-line
source: Line
ta: வரி

# edit-type-dialog.styles-introduction
source: These styles are applied when a new object of this type is created. If “Fixed” is enabled, the style is applied to all objects of this type and cannot be changed for an individual object anymore. For more complex style control, dropdown or checkbox fields can be configured below to change the style based on their selected value.
ta: இந்த வகையின் புதிய பொருள் உருவாக்கப்படும்போது இந்த பாணிகள் பயன்படுத்தப்படுகின்றன. “நிலையானது” இயக்கப்பட்டிருந்தால், இந்த வகையின் அனைத்து பொருள்களுக்கும் பாணி பயன்படுத்தப்படுகிறது, மேலும் ஒரு தனிப்பட்ட பொருளுக்கு இனி மாற்ற முடியாது. மிகவும் சிக்கலான பாணி கட்டுப்பாட்டுக்கு, தேர்ந்தெடுக்கப்பட்ட மதிப்பின் அடிப்படையில் பாணியை மாற்ற கீழ்தோன்றல் அல்லது தேர்வுப்பெட்டி புலங்களை கீழே கட்டமைக்க முடியும்.

# edit-type-dialog.default-colour
source: Default colour
ta: இயல்புநிலை நிறம்

# edit-type-dialog.fixed
source: Fixed
ta: சரி

# edit-type-dialog.default-size
source: Default size
ta: இயல்புநிலை அளவு

# edit-type-dialog.default-icon
source: Default icon
ta: இயல்புநிலை படவுரு

# edit-type-dialog.default-shape
source: Default shape
ta: இயல்புநிலை வடிவம்

# edit-type-dialog.default-width
source: Default width
ta: இயல்புநிலை அகலம்

# edit-type-dialog.default-stroke
source: Default stroke
ta: இயல்புநிலை பக்கவாதம்

# edit-type-dialog.default-route-mode
source: Default routing mode
ta: இயல்புநிலை ரூட்டிங் பயன்முறை

# edit-type-dialog.legend
source: Legend
ta: புராணக்கதை

# edit-type-dialog.show-in-legend
source: Show in legend
ta: புராணக்கதையில் காட்டு

# edit-type-dialog.show-in-legend-description
source: An item for this type will be shown in the legend. Any fixed style attributes are applied to it. Dropdown or checkbox fields that control the style generate additional legend items.
ta: இந்த வகைக்கான ஒரு உருப்படி புராணத்தில் காண்பிக்கப்படும். எந்த நிலையான பாணி பண்புகளும் இதைப் பயன்படுத்துகின்றன. பாணியைக் கட்டுப்படுத்தும் கீழ்தோன்றல் அல்லது தேர்வுப்பெட்டி புலங்கள் கூடுதல் புராண உருப்படிகளை உருவாக்குகின்றன.

# edit-type-dialog.fields
source: Fields
ta: புலங்கள்

# edit-type-dialog.field-name
source: Name
ta: பெயர்

# edit-type-dialog.field-type
source: Type
ta: வகை

# edit-type-dialog.field-default-value
source: Default value
ta: இயல்புநிலை மதிப்பு

# edit-type-dialog.field-delete
source: Delete
ta: நீக்கு

# edit-type-dialog.field-type-input
source: Text field
ta: உரை புலம்

# edit-type-dialog.field-type-textarea
source: Text area
ta: உரை பகுதி

# edit-type-dialog.field-type-dropdown
source: Dropdown
ta: கீழ்தோன்றும்

# edit-type-dialog.field-type-checkbox
source: Checkbox
ta: தேர்வுப்பெட்டி

# edit-type-dialog.field-edit
source: Edit
ta: தொகு

# edit-type-dialog.field-reorder
source: Reorder
ta: மறுவரிசை

# edit-type-dialog.field-add
source: Add
ta: கூட்டு

# edit-type-dropdown-dialog.delete-option-title
source: Delete option
ta: விருப்பத்தை நீக்கு

# edit-type-dropdown-dialog.delete-option-message
source: Do you really want to delete the option “{{value}}”?
ta: “{{value}}” என்ற விருப்பத்தை நீக்க விரும்புகிறீர்களா?

# edit-type-dropdown-dialog.delete-option-button
source: Delete
ta: நீக்கு

# edit-type-dropdown-dialog.unique-value-error
source: Multiple options cannot have the same label.
ta: பல விருப்பங்கள் ஒரே லேபிளைக் கொண்டிருக்க முடியாது.

# edit-type-dropdown-dialog.no-options-error
source: Controlling fields need to have at least one option.
ta: கட்டுப்படுத்தும் புலங்களுக்கு குறைந்தது ஒரு விருப்பத்தோ இருக்க வேண்டும்.

# edit-type-dropdown-dialog.title-checkbox
source: Edit Checkbox
ta: தேர்வுப்பெட்டியைத் திருத்தவும்

# edit-type-dropdown-dialog.title-dropdown
source: Edit Dropdown
ta: கீழ்தோன்றும் திருத்து

# edit-type-dropdown-dialog.ok-button
source: OK
ta: சரி

# edit-type-dropdown-dialog.control
source: Control
ta: கட்டுப்பாடு

# edit-type-dropdown-dialog.control-interpolation-marker
source: marker
ta: மார்க்கர்

# edit-type-dropdown-dialog.control-interpolation-line
source: line
ta: வரி

# edit-type-dropdown-dialog.control-colour
source: Control {{type}} colour
ta: கட்டுப்பாடு {{type}} வண்ணம்

# edit-type-dropdown-dialog.control-size
source: Control {{type}} size
ta: கட்டுப்பாடு {{type}} அளவு

# edit-type-dropdown-dialog.control-icon
source: Control {{type}} icon
ta: கட்டுப்பாடு {{type}} படவுரு

# edit-type-dropdown-dialog.control-shape
source: Control {{type}} shape
ta: கட்டுப்பாடு {{type}} வடிவம்

# edit-type-dropdown-dialog.control-width
source: Control {{type}} width
ta: கட்டுப்பாடு {{type}} அகலம்

# edit-type-dropdown-dialog.control-stroke
source: Control {{type}} stroke
ta: கட்டுப்பாடு {{type}} பக்கவாதம்
