Repository: 247i/TACETr
Catalog: உரை/தானி/facilmap-facilmap-frontend-*.po
Languages: ta

# leaflet-map-components.pois-zoom-in
source: Zoom in to show POIs.
ta: POIS ஐக் காட்ட பெரிதாக்கவும்.

# leaflet-map-components.pois-error
source: Error loading POIs: {{message}}
ta: BOIS ஐ ஏற்றுவதில் பிழை: {{message}}

# legend.tab-label
source: Legend
ta: புராணக்கதை

# legend-content.click-explanation
source: Click to show/hide objects of this type.
ta: இந்த வகை பொருள்களைக் காட்ட/மறைக்க சொடுக்கு செய்க.

# line-info.delete-line-title
source: Delete line
ta: வரியை நீக்கு

# line-info.delete-line-message
source: Do you really want to delete the line “{{name}}”?
ta: “{{name}}” வரியை நீக்க விரும்புகிறீர்களா?

# line-info.delete-line-ok
source: Delete
ta: நீக்கு

# line-info.delete-line-error
source: Error deleting line
ta: வரி நீக்குவதில் பிழை

# line-info.save-line-error
source: Error saving line
ta: பிழை சேமிப்பு வரி

# line-info.move-line-title
source: Edit waypoints
ta: வழிப்புள்ளிகளைத் திருத்து

# line-info.move-line-message
source: Use the routing form or drag the line around to change it. Click “Finish” to save the changes.
ta: ரூட்டிங் படிவத்தைப் பயன்படுத்தவும் அல்லது அதை மாற்ற வரியை இழுக்கவும். மாற்றங்களைச் சேமிக்க “பூச்சு” என்பதைக் சொடுக்கு செய்க.

# line-info.move-line-finish
source: Finish
ta: முடிக்க

# line-info.move-line-cancel
source: Cancel
ta: ரத்துசெய்

# line-info.hide-elevation-plot
source: Hide elevation plot
ta: உயர சதித்திட்டத்தை மறைக்கவும்

# line-info.show-elevation-plot
source: Show elevation plot
ta: உயர சதித்திட்டத்தைக் காட்டு

# line-info.distance
source: Distance
ta: தூரம்

# line-info.ascent-descent
source: Climb/drop
ta: ஏறும்/கைவிடவும்

# line-info.zoom-to-object-label
source: Zoom to line
ta: வரி பெரிதாக்கவும்

# line-info.edit-data
source: Edit data
ta: தரவைத் திருத்தவும்

# line-info.actions
source: Actions
ta: செயல்கள்

# line-info.edit-waypoints
source: Edit waypoints
ta: வழிப்புள்ளிகளைத் திருத்து

# line-info.delete
source: Delete
ta: நீக்கு

# manage-bookmarks-dialog.title
source: Manage Bookmarks
ta: புக்மார்க்குகளை நிர்வகிக்கவும்

# manage-bookmarks-dialog.introduction
source: Bookmarks are a quick way to remember and access collaborative maps. They are saved in your browser, other users will not be able to see them.
ta: கூட்டு வரைபடங்களை நினைவில் கொள்வதற்கும் அணுகுவதற்கும் புக்மார்க்குகள் ஒரு விரைவான வழியாகும். அவை உங்கள் உலாவியில் சேமிக்கப்படுகின்றன, மற்ற பயனர்களால் அவற்றைப் பார்க்க முடியாது.

# manage-bookmarks-dialog.map-id
source: Map ID
ta: வரைபட ஐடி

# manage-bookmarks-dialog.name
source: Name
ta: பெயர்

# manage-bookmarks-dialog.delete
source: Delete
ta: நீக்கு

# manage-bookmarks-dialog.reorder-alt
source: Reorder
ta: மறுவரிசை

# manage-bookmarks-dialog.bookmark-current
source: Bookmark current map
ta: தற்போதைய வரைபடத்தை புக்மார்க்கு செய்கிறது

# manage-types-dialog.delete-title
source: Delete type
ta: வகையை நீக்கு

# manage-types-dialog.delete-message
source: Do you really want to delete the type “{{typeName}}”?
ta: “{{typeName}}” வகையை நீக்க விரும்புகிறீர்களா?

# manage-types-dialog.delete-ok
source: Delete
ta: நீக்கு

# manage-types-dialog.delete-error
source: Error deleting type “{{typeName}}”
ta: பிழையை நீக்குவது “{{typeName}}”

# manage-types-dialog.title
source: Manage Types
ta: வகைகளை நிர்வகிக்கவும்

# manage-types-dialog.name
source: Name
ta: பெயர்

# manage-types-dialog.type
source: Type
ta: வகை

# manage-types-dialog.edit
source: Edit
ta: தொகு

# manage-types-dialog.type-marker
source: Markers
ta: குறிப்பான்கள்

# manage-types-dialog.type-line
source: Lines
ta: வரிகள்

# manage-types-dialog.edit-button
source: Edit
ta: தொகு

# manage-types-dialog.delete-button
source: Delete
ta: நீக்கு

# manage-types-dialog.reorder-alt
source: Reorder
ta: மறுவரிசை

# manage-types-dialog.create
source: Create
ta: உருவாக்கு

# manage-types-dialog.marker-type
source: Marker type
ta: மார்க்கர் வகை

# manage-types-dialog.line-type
source: Line type
ta: வரி வகை

# manage-views-dialog.default-view-error
source: Error setting default view
ta: இயல்புநிலை பார்வையை அமைப்பது

# manage-views-dialog.delete-view-title
source: Delete view
ta: பார்வையை நீக்கு

# manage-views-dialog.delete-view-message
source: Do you really want to delete the view “{{viewName}}”?
ta: “{{viewName}}” பார்வையை நீக்க விரும்புகிறீர்களா?

# manage-views-dialog.delete-view-ok
source: Delete
ta: நீக்கு

# manage-views-dialog.delete-view-error
source: Error deleting view “{{viewName}}”
ta: பார்வையை நீக்குவதில் பிழை “{{viewName}}”

# manage-views-dialog.title
source: Manage Views
ta: காட்சிகளை நிர்வகிக்கவும்

# manage-views-dialog.make-default
source: Make default
ta: இயல்புநிலை செய்யுங்கள்

# manage-views-dialog.delete
source: Delete
ta: நீக்கு

# manage-views-dialog.reorder-alt
source: Reorder
ta: மறுவரிசை

# marker-info.delete-marker-title
source: Delete marker
ta: மதிப்பெண்களை நீக்கு

# marker-info.delete-marker-message
source: Do you really want to delete the marker “{{name}}”?
ta: “{{name}}” மார்க்கரை நீக்க விரும்புகிறீர்களா?

# marker-info.delete-marker-ok
source: Delete
ta: நீக்கு

# marker-info.delete-marker-error
source: Error deleting marker
ta: மார்க்கரை நீக்குவதில் பிழை

# marker-info.zoom-to-object-label
source: Zoom to marker
ta: மார்க்கருக்கு பெரிதாக்கு

# marker-info.edit-data
source: Edit data
ta: தரவைத் திருத்தவும்

# marker-info.actions
source: Actions
ta: செயல்கள்

# marker-info.move
source: Move
ta: நகர்த்தவும்

# marker-info.delete
source: Delete
ta: நீக்கு

# multiple-info.delete-objects-title
source: Delete {{count}} object
ta: {{count}} பொருளை நீக்கு

# multiple-info.delete-objects-message
source: Do you really want to remove {{count}} object?
ta: {{count}} பொருளை அகற்ற விரும்புகிறீர்களா?

# multiple-info.delete-objects-ok
source: Delete
ta: நீக்கு

# multiple-info.delete-objects-error
source: Error deleting objects
ta: பொருள்களை நீக்குவதில் பிழை

# multiple-info.zoom-to-object
source: Zoom to object
ta: பொருளுக்கு பெரிதாக்கவும்

# multiple-info.zoom
source: Zoom
ta: பெரிதாக்கு

# multiple-info.show-details
source: Show details
ta: விவரங்களைக் காட்டு

# multiple-info.details
source: Details
ta: விவரங்கள்

# multiple-info.zoom-to-object-label
source: Zoom to selection
ta: தேர்வுக்கு பெரிதாக்கு

# multiple-info.delete
source: Delete
ta: நீக்கு

# modal-dialog.close
source: Close
ta: மூடு

# modal-dialog.cancel
source: Cancel
ta: ரத்துசெய்

# modal-dialog.save
source: Save
ta: சேமி

# open-map-dialog.find-maps-error
source: Error searching for public maps
ta: பொது வரைபடங்களைத் தேடுவதில் பிழை

# open-map-dialog.map-id-format-error
source: Please enter a valid map ID or URL.
ta: செல்லுபடியாகும் வரைபட ஐடி அல்லது முகவரி ஐ உள்ளிடவும்.

# open-map-dialog.map-not-found-error
source: No map with this ID could be found.
ta: இந்த ஐடியுடன் எந்த வரைபடமும் காணப்படவில்லை.

# open-map-dialog.title
source: Open collaborative map
ta: திறந்த கூட்டு வரைபடம்

# open-map-dialog.introduction
source: Enter the link or ID of an existing collaborative map here to open that map.
ta: அந்த வரைபடத்தைத் திறக்க ஏற்கனவே உள்ள கூட்டு வரைபடத்தின் இணைப்பு அல்லது ஐடியை இங்கே உள்ளிடவும்.

# open-map-dialog.open-map-by-id-button
source: Open
ta: திற

# open-map-dialog.search-public-maps
source: Search public maps
ta: பொது வரைபடங்களைத் தேடுங்கள்

# open-map-dialog.search-alt
source: Search
ta: தேடல்

# open-map-dialog.no-maps-found
source: No maps could be found.
ta: வரைபடங்கள் எதுவும் காணப்படவில்லை.

# open-map-dialog.name
source: Name
ta: பெயர்

# open-map-dialog.description
source: Description
ta: விவரம்

# open-map-dialog.open-map-by-search-button
source: Open
ta: திற

# overpass-form.filter
source: Filter…
ta: வடிகட்டி…

# overpass-form.custom-explanation-1
source: Enter an {{statement}} here. Settings and an {{out}} statement are added automatically in the background. For ways and relations, a marker will be shown at the geometric centre, no lines or polygons are drawn.
ta: ஒரு {{statement}} இங்கே உள்ளிடவும். அமைப்புகள் மற்றும் {{out}} அறிக்கை ஆகியவை பின்னணியில் தானாக சேர்க்கப்படுகின்றன. வழிகள் மற்றும் உறவுகளுக்கு, வடிவியல் மையத்தில் ஒரு மார்க்கர் காண்பிக்கப்படும், கோடுகள் அல்லது பலகோணங்கள் எதுவும் வரையப்படவில்லை.

# overpass-form.custom-explanation-1-interpolation-statement
source: Overpass query statement
ta: ஓவர் பாச் வினவல் அறிக்கை

# overpass-form.custom-explanation-2
source: Example queries are {{parking}} to get parking places or {{atm}} for ATMs.
ta: எடுத்துக்காட்டு வினவல்கள் பார்க்கிங் இடங்களைப் பெற {{parking}} அல்லது ஏடிஎம்களுக்கு {{atm}}.

# overpass-form.custom-query
source: Custom query
ta: தனிப்பயன் வினவல்

# overpass-form-tab.pois
source: POIs
ta: பின்னர்

# overpass-info.zoom-to-object-label
source: Zoom to POI
ta: போயுக்கு பெரிதாக்கு

# overpass-multiple-info.zoom-to-object
source: Zoom to object
ta: பொருளுக்கு பெரிதாக்கவும்

# overpass-multiple-info.zoom
source: Zoom
ta: பெரிதாக்கு

# overpass-multiple-info.show-details
source: Show details
ta: விவரங்களைக் காட்டு

# overpass-multiple-info.details
source: Details
ta: விவரங்கள்

# overpass-multiple-info.zoom-to-object-label
source: Zoom to selection
ta: தேர்வுக்கு பெரிதாக்கு

# map-id-edit.unique-id-error
source: The same link cannot be used for different access levels.
ta: வெவ்வேறு அணுகல் நிலைகளுக்கும் அதே இணைப்பைப் பயன்படுத்த முடியாது.

# map-id-edit.copy-tooltip
source: Copy map link to clipboard
ta: நகலெடு map இணைப்பு பெறுநர் இடைநிலைப் பலகை

# map-id-edit.qr-tooltip
source: Show QR code for map link
ta: வரைபட இணைப்பிற்கான QR குறியீட்டைக் காட்டு

# map-id-edit.copied-title
source: Map link copied
ta: வரைபட இணைப்பு நகலெடுக்கப்பட்டது

# map-id-edit.copied-message
source: The map link was copied to the clipboard.
ta: The map இணைப்பு was copied பெறுநர் the clipboard.

# map-id-edit.random-tooltip
source: Generate random ID
ta: சீரற்ற ஐடியை உருவாக்குங்கள்

# map-id-edit.random-alt
source: Random
ta: சீரற்ற

# map-settings-dialog.create-map-error
source: Error creating map
ta: வரைபடத்தை உருவாக்கும் பிழை

# map-settings-dialog.save-map-error
source: Error saving map settings
ta: வரைபட அமைப்புகளைச் சேமிப்பது பிழை

# map-settings-dialog.delete-map-title
source: Delete map
ta: வரைபடத்தை நீக்கு

# map-settings-dialog.delete-map-message
source: Are you sure you want to delete the map “{{name}}”? Deleted maps cannot be restored!
ta: “{{name}}” வரைபடத்தை நீக்க விரும்புகிறீர்களா? நீக்கப்பட்ட வரைபடங்களை மீட்டெடுக்க முடியாது!

# map-settings-dialog.delete-map-ok
source: Delete map
ta: வரைபடத்தை நீக்கு

# map-settings-dialog.delete-map-error
source: Error deleting map
ta: வரைபடத்தை நீக்குவதில் பிழை

# map-settings-dialog.title-create
source: Create collaborative map
ta: கூட்டு வரைபடத்தை உருவாக்கவும்

# map-settings-dialog.title-edit
source: Map settings
ta: வரைபட அமைப்புகள்

# map-settings-dialog.create-button
source: Create
ta: உருவாக்கு

# map-settings-dialog.admin-link-label
source: Admin link
ta: நிர்வாக இணைப்பு

# map-settings-dialog.admin-link-description
source: When opening the map through this link, all parts of the map can be edited, including the map settings, object types and views.
ta: இந்த இணைப்பின் மூலம் வரைபடத்தைத் திறக்கும்போது, வரைபடத்தின் அனைத்து பகுதிகளும் வரைபட அமைப்புகள், பொருள் வகைகள் மற்றும் காட்சிகள் உட்பட திருத்தப்படலாம்.

# map-settings-dialog.write-link-label
source: Editable link
ta: திருத்தக்கூடிய இணைப்பு

# map-settings-dialog.write-link-description
source: When opening the map through this link, markers and lines can be added, changed and deleted, but the map settings, object types and views cannot be modified.
ta: இந்த இணைப்பு மூலம் வரைபடத்தைத் திறக்கும்போது, குறிப்பான்கள் மற்றும் கோடுகளைச் சேர்க்கலாம், மாற்றலாம் மற்றும் நீக்கலாம், ஆனால் வரைபட அமைப்புகள், பொருள் வகைகள் மற்றும் காட்சிகளை மாற்ற முடியாது.

# map-settings-dialog.read-link-label
source: Read-only link
ta: படிக்க மட்டும் இணைப்பு

# map-settings-dialog.read-link-description
source: When opening the map through this link, markers, lines and views can be seen, but nothing can be changed.
ta: இந்த இணைப்பு மூலம் வரைபடத்தைத் திறக்கும்போது, குறிப்பான்கள், கோடுகள் மற்றும் காட்சிகள் ஆகியவற்றைக் காணலாம், ஆனால் எதுவும் மாற்ற முடியாது.

# map-settings-dialog.map-name
source: Map name
ta: வரைபட பெயர்

# map-settings-dialog.search-engines
source: Search engines
ta: தேடுபொறிகள்

# map-settings-dialog.search-engines-label
source: Accessible for search engines
ta: தேடுபொறிகளுக்கு அணுகலாம்

# map-settings-dialog.search-engines-description
source: If this is enabled, search engines like Google will be allowed to add the read-only version of this map.
ta: இது இயக்கப்பட்டிருந்தால், கூகிள் போன்ற தேடுபொறிகள் இந்த வரைபடத்தின் படிக்க மட்டும் பதிப்பைச் சேர்க்க அனுமதிக்கப்படும்.

# map-settings-dialog.map-description
source: Short description
ta: குறுகிய விளக்கம்

# map-settings-dialog.map-description-description
source: This description will be shown under the result in search engines.
ta: இந்த விளக்கம் தேடுபொறிகளின் கீழ் காண்பிக்கப்படும்.

# map-settings-dialog.cluster-markers
source: Cluster markers
ta: கிளச்டர் குறிப்பான்கள்

# map-settings-dialog.cluster-markers-label
source: Cluster markers
ta: கிளச்டர் குறிப்பான்கள்

# map-settings-dialog.cluster-markers-description
source: If enabled, when there are many markers in one area, they will be replaced by a placeholder at low zoom levels. This improves performance on maps with many markers.
ta: இயக்கப்பட்டிருந்தால், ஒரு பகுதியில் பல குறிப்பான்கள் இருக்கும்போது, அவை குறைந்த சூம் மட்டத்தில் ஒரு ஒதுக்கிடத்தால் மாற்றப்படும். இது பல குறிப்பான்களுடன் வரைபடங்களில் செயல்திறனை மேம்படுத்துகிறது.

# map-settings-dialog.legend-text
source: Legend text
ta: புராண உரை

# map-settings-dialog.legend-text-description
source: Text that will be shown above and below the legend. Can be formatted with {{markdown}}.
ta: புராணக்கதைக்கு மேலேயும் கீழேயும் காட்டப்படும் உரை. {{markdown} with உடன் வடிவமைக்கப்படலாம்.

# map-settings-dialog.legend-text-description-interpolation-markdown
source: Markdown
ta: மார்க் பேரூர்

# map-settings-dialog.delete-map
source: Delete map
ta: வரைபடத்தை நீக்கு

# map-settings-dialog.delete-map-button
source: Delete map
ta: வரைபடத்தை நீக்கு

# map-settings-dialog.delete-description
source: To delete this map, type {{code}} into the field and click the “Delete map” button.
ta: இந்த வரைபடத்தை நீக்க, புலத்தில் {{code}} என தட்டச்சு செய்து “வரைபடத்தை நீக்கு” பொத்தானைக் சொடுக்கு செய்க.

# map-settings-dialog.delete-code
source: DELETE
ta: நீக்கு

# pagination.first-label
source: First
ta: முதல்

# pagination.previous-label
source: Previous
ta: முந்தைய

# pagination.next-label
source: Next
ta: அடுத்தது

# pagination.last-label
source: Last
ta: கடைசி

# results.zoom-alt
source: Zoom
ta: பெரிதாக்கு

# results.show-details-alt
source: Details
ta: விவரங்கள்

# save-view-dialog.save-view-error
source: Error saving view
ta: பிழை சேமிப்பு பார்வை

# save-view-dialog.title
source: Save current view
ta: தற்போதைய பார்வையைச் சேமிக்கவும்

# save-view-dialog.name
source: Name
ta: பெயர்

# save-view-dialog.top-left
source: Top left
ta: மேல் இடது

# save-view-dialog.bottom-right
source: Bottom right
ta: கீழே வலது

# save-view-dialog.base-layer
source: Base layer
ta: அடிப்படை அடுக்கு

# save-view-dialog.overlays
source: Overlays
ta: மேலடுக்குகள்

# save-view-dialog.pois
source: POIs
ta: பின்னர்

# save-view-dialog.include-pois
source: Include POIs ({{pois}})
ta: எனவே ({{}}) சேர்க்கவும்

# save-view-dialog.filter
source: Filter
ta: வடிப்பி

# save-view-dialog.include-current-filter
source: Include current filter ({{filter}})
ta: தற்போதைய வடிகட்டி ({{filter}}) சேர்க்கவும்

# save-view-dialog.default-view
source: Default view
ta: இயல்புநிலை பார்வை

# save-view-dialog.make-default
source: Make default view
ta: இயல்புநிலை காட்சியை உருவாக்குங்கள்

# search-result-info.type
source: Type
ta: வகை

# search-result-info.address
source: Address
ta: முகவரி

# search-result-info.zoom-to-result-label
source: Zoom to search result
ta: தேடல் முடிவுக்கு பெரிதாக்கு

# shape-picker.unknown-shape-error
source: Unknown shape
ta: தெரியாத வடிவம்

# shape-picker.no-shapes-error
source: No shapes could be found.
ta: வடிவங்கள் எதுவும் காணப்படவில்லை.

# share-dialog.type-admin
source: Admin
ta: நிர்வாகி

# share-dialog.type-write
source: Writable
ta: எழுதக்கூடியது

# share-dialog.type-read
source: Read-only
ta: படிக்க மட்டும்

# share-dialog.title
source: Share
ta: பங்கு

# share-dialog.settings
source: Settings
ta: அமைப்புகள்

# share-dialog.include-view
source: Include current map view (centre: {{centre}}; zoom level: {{zoom}}; layer(s): {{layers}}{{conditionalPois}}{{conditionalSelection}}{{conditionalFilter}})
ta: தற்போதைய வரைபடக் காட்சியைச் சேர் (மையம்: {{centre}}; சூம் நிலை: {{zoom}}; அடுக்கு(கள்): {{layers}}{{conditionalPois}}{{conditionalSelection}}{{conditionalFilter}})

# share-dialog.include-view-interpolation-conditionalPois
source: , POIs: {{pois}}
ta: எனவே: {{pois}}

# share-dialog.include-view-interpolation-conditionalSelection
source: ; active object(s): {{description}}
ta: ; செயலில் உள்ள பொருள் (கள்): {{description}}

# share-dialog.include-view-interpolation-conditionalFilter
source: ; filter: {{filter}}
ta: ; வடிகட்டி: {{filter}}}

# share-dialog.show-controls
source: Show controls
ta: கட்டுப்பாடுகளைக் காட்டு

# share-dialog.show-toolbox
source: Toolbox
ta: கருவிப்பெட்டி

# share-dialog.show-search-box
source: Search box
ta: தேடல் பெட்டி

# share-dialog.show-route
source: Route tab
ta: பாதை தாவல்

# share-dialog.show-pois
source: POI tab
ta: பின்னர் தாவல்

# share-dialog.show-legend
source: Legend
ta: புராணக்கதை

# share-dialog.show-locate
source: Location
ta: இடம்

# share-dialog.link-type
source: Link type
ta: இணைப்பு வகை

# share-dialog.share-link
source: Share link
ta: இணைப்பைப் பகிரவும்

# share-dialog.embed
source: Embed
ta: உட்பொதிக்கப்பட்டது

# share-dialog.link-copied-title
source: Map link copied
ta: வரைபட இணைப்பு நகலெடுக்கப்பட்டது

# share-dialog.link-copied-message
source: The map link was copied to the clipboard.
ta: வரைபட இணைப்பு இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது.

# share-dialog.embed-copied-title
source: Embed code copied
ta: உட்பொதிக்கப்பட்ட குறியீடு நகலெடுக்கப்பட்டது

# share-dialog.embed-copied-message
source: The code to embed {{appName}} was copied to the clipboard.
ta: {{appName} fud உட்பொதிக்கும் குறியீடு கிளிப்போர்டில் நகலெடுக்கப்பட்டது.

# share-dialog.embed-explanation
source: Add this HTML code to a web page to embed {{appName}}. {{learnMore}}
ta: {{appName}} உட்பொதிக்க இந்த உஉகுமொ குறியீட்டை ஒரு வலைப்பக்கத்தில் சேர்க்கவும். {{learnMore}}

# share-dialog.embed-explanation-interpolation-learnMore
source: Learn more
ta: மேலும் அறிக

# stroke-picker.solid
source: Solid
ta: திடமான

# stroke-picker.dashed
source: Dashed
ta: கோடு

# stroke-picker.dotted
source: Dotted
ta: புள்ளியிடப்பட்ட

# icon-picker.unknown-icon-error
source: Unknown icon
ta: தெரியாத படவுரு

# icon-picker.filter-placeholder
source: Filter
ta: வடிப்பி

# icon-picker.no-icons-found-error
source: No icons could be found.
ta: ஐகான்கள் எதுவும் காணப்படவில்லை.

# use-as-dropdown.label
source: Use as
ta: பயன்படுத்த

# use-as-dropdown.from
source: Route start
ta: பாதை தொடக்க

# use-as-dropdown.from-insert
source: Route start (insert before current start)
ta: Route தொடங்கு (insert before மின்னோட்ட்ம், ஓட்டம் start)

# use-as-dropdown.from-replace
source: Route start (replace current start)
ta: பாதை தொடக்க (தற்போதைய தொடக்கத்தை மாற்றவும்)

# use-as-dropdown.via
source: Route via
ta: வழியாக பாதை

# use-as-dropdown.via-first
source: Route via (first)
ta: (முதல்) வழியாக பாதை

# use-as-dropdown.via-last
source: Route via (last)
ta: Route வழிமம் (last)

# use-as-dropdown.to
source: Route destination
ta: பாதை இலக்கு

# use-as-dropdown.to-insert
source: Route destination (insert after current destination)
ta: பாதை இலக்கு (தற்போதைய இலக்குக்குப் பிறகு செருகவும்)

# use-as-dropdown.to-replace
source: Route destination (replace current destination)
ta: Route destination (replace மின்னோட்ட்ம், ஓட்டம் destination)

# user-preferences-dialog.title
source: User preferences
ta: பயனர் விருப்பத்தேர்வுகள்

# user-preferences-dialog.tab-general
source: General
ta: பொது

# user-preferences-dialog.tab-map-style
source: Map style
ta: Map சூல் தண்டு

# user-preferences-dialog.introduction
source: These settings are stored on your computer as a cookie and are applied independently of the opened map.
ta: இந்த அமைப்புகள் உங்கள் கணினியில் குக்கீ என சேமிக்கப்படுகின்றன, மேலும் அவை திறந்த வரைபடத்திலிருந்து சுயாதீனமாக பயன்படுத்தப்படுகின்றன.

# user-preferences-dialog.language
source: Language
ta: மொழி

# user-preferences-dialog.language-description
source: Some translations may not be complete yet. Translations are created by the community, feel free to contribute on {{weblate}}.
ta: சில மொழிபெயர்ப்புகள் இன்னும் முழுமையடையாமல் இருக்கலாம். மொழிபெயர்ப்புகள் சமூகத்தால் உருவாக்கப்பட்டுள்ளன, {{weblate} on இல் பங்களிக்க தயங்க.

# user-preferences-dialog.language-description-interpolation-weblate
source: Weblate
ta: வலைபெயர்ப்பு

# user-preferences-dialog.units
source: Units
ta: அலகுகள்

# user-preferences-dialog.units-metric
source: Metric
ta: மெட்ரிக்

# user-preferences-dialog.units-us
source: US customary (miles, feet)
ta: அமெரிக்க வழக்கம் (மைல்கள், அடி)

# user-preferences-dialog.default-map-style
source: Default map style
ta: இயல்புநிலை map சூல் தண்டு

# user-preferences-dialog.external-links
source: External links
ta: வெளிப்புற இணைப்புகள்

# user-preferences-dialog.external-links-description
source: Configure links to external maps here that will appear in the “Map style” toolbox menu (to show the current map section), and in the coordinates dropdown of markers, search results and POIs (to show the marker). Enable or disable preset map links here or configure your own.
ta: Configure links பெறுநர் external maps here that will appear in the “Map style” toolbox பட்டியல் (to காட்டு the மின்னோட்ட்ம், ஓட்டம் map section), and in the coordinates dropdown of markers, தேடல் முடிவுகள் and POIs (to காட்டு the marker). Enable or முடக்கு preset map links here or configure your own.

# user-preferences-dialog.external-links-placeholders
source: Available placeholders for custom link URLs:
ta: Available placeholders க்கு தனிப்பயன் இணைப்பு URLs:

# user-preferences-dialog.external-links-placeholder-coords
source: GPS coordinates
ta: சி.பி.எச் ஒருங்கிணைப்புகள்

# user-preferences-dialog.external-links-placeholder-coords-proj
source: Cooordinates in custom projection with an EPSG code, for example `%LON25833%`
ta: Cooordinates in தனிப்பயன் projection with an EPSG code, க்கு example `%LON25833%`

# user-preferences-dialog.external-links-placeholder-zoom
source: Zoom level
ta: Zoom நிலை

# user-preferences-dialog.external-links-placeholder-zoom-modified
source: Increased/decreased zoom level, for example `%ZOOM-8%`
ta: Increased/decreased zoom level, க்கு example `%ZOOM-8%`

# user-preferences-dialog.external-links-label
source: Label
ta: சிட்டை

# user-preferences-dialog.external-links-map-url
source: Map URL
ta: Map முகவரி

# user-preferences-dialog.external-links-marker-url
source: Marker URL
ta: Marker முகவரி

# user-preferences-dialog.external-links-delete-tooltip
source: Delete
ta: நீக்கு

# user-preferences-dialog.external-links-reorder-alt
source: Reorder
ta: மறுவரிசை

# user-preferences-dialog.external-links-create
source: Create
ta: உருவாக்கு

# utils.required-error
source: Must not be empty.
ta: காலியாக இருக்கக்கூடாது.

# route-form.route-description-outer
source: Route from {{inner}}
ta: {{inner} இருந்து இலிருந்து பாதை

# route-form.route-description-inner-joiner
source: to
ta: பெறுநர்

# route-form.find-destination-error
source: Error finding destination “{{query}}”
ta: இலக்கைக் கண்டுபிடிப்பது “{{query}}”

# route-form.some-destinations-not-found
source: Some destinations could not be found.
ta: சில இடங்களைக் கண்டுபிடிக்க முடியவில்லை.

# route-form.route-calculation-error
source: Error calculating route
ta: பாதையை கணக்கிடுவதில் பிழை

# route-form.reorder-alt
source: Reorder
ta: மறுவரிசை

# route-form.from-placeholder
source: From
ta: இருந்து
