Repository: 247i/TACETr
Catalog: உரை/தானி/facilmap-facilmap-frontend-*.po
Languages: ta

# route-form.to-placeholder
source: To
ta: பெறுநர்

# route-form.via-placeholder
source: Via
ta: வழிமம்

# route-form.zoom-alt
source: Zoom
ta: பெரிதாக்கு

# route-form.remove-destination-tooltip
source: Remove this destination
ta: இந்த இலக்கை அகற்று

# route-form.remove-destination-alt
source: Remove
ta: அகற்று

# route-form.add-destination-tooltip
source: Add another destination
ta: மற்றொரு இலக்கைச் சேர்க்கவும்

# route-form.add-destination-alt
source: Add
ta: கூட்டு

# route-form.submit
source: Go!
ta: போ!

# route-form.clear-route-tooltip
source: Clear route
ta: தெளிவான பாதை

# route-form.clear-route-alt
source: Clear
ta: தெளிவான

# route-form.distance
source: Distance
ta: தூரம்

# route-form.ascent-descent
source: Climb/drop
ta: ஏறும்/கைவிடவும்

# route-form.zoom-to-object-label
source: Zoom to route
ta: பாதை பெரிதாக்கவும்

# route-form.export-filename
source: FacilMap route
ta: Fixilmap பாதை

# route-form-tab.tab-label
source: Route
ta: பாதை

# route-mode.car-alt
source: Car
ta: கார்

# route-mode.bicycle-alt
source: Bicycle
ta: சைக்கிள்

# route-mode.pedestrian-alt
source: Foot
ta: கால்

# route-mode.straight-alt
source: Straight
ta: நேராக

# route-mode.car-title
source: Go by car
ta: கார் மூலம் செல்லுங்கள்

# route-mode.bicycle-title
source: Go by bicycle
ta: சைக்கிள் வழியாக செல்லுங்கள்

# route-mode.pedestrian-title
source: Go on foot
ta: காலில் செல்லுங்கள்

# route-mode.straight-title
source: Go in a straight line
ta: ஒரு நேர் கோட்டில் செல்லுங்கள்

# route-mode.car
source: Car
ta: கார்

# route-mode.hgv
source: HGV
ta: எச்.சி.வி.

# route-mode.bicycle
source: Bicycle
ta: சைக்கிள்

# route-mode.road-bike
source: Road bike
ta: சாலை பைக்

# route-mode.mountain-bike
source: Mountain bike
ta: மலை பைக்

# route-mode.electric-bike
source: Electric bike
ta: மின்சார பைக்

# route-mode.walking
source: Walking
ta: நடைபயிற்சி

# route-mode.hiking
source: Hiking
ta: ஐக்கிங்

# route-mode.wheelchair
source: Wheelchair
ta: சக்கர நாற்காலி

# route-mode.straight
source: Straight line
ta: நேர் கோடு

# route-mode.fastest
source: Fastest
ta: வேகமான

# route-mode.shortest
source: Shortest
ta: குறுகிய

# route-mode.avoid-highways
source: Avoid highways
ta: நெடுஞ்சாலைகளைத் தவிர்க்கவும்

# route-mode.avoid-toll-roads
source: Avoid toll roads
ta: கட்டண சாலைகளைத் தவிர்க்கவும்

# route-mode.avoid-ferries
source: Avoid ferries
ta: படகுகளைத் தவிர்க்கவும்

# route-mode.avoid-fords
source: Avoid fords
ta: ஃபோர்ட்களைத் தவிர்க்கவும்

# route-mode.avoid-steps
source: Avoid steps
ta: படிகளைத் தவிர்க்கவும்

# route-mode.custom-alt
source: Custom
ta: தனிப்பயன்

# route-mode.load-details
source: Load route details (elevation, road types, …)
ta: பாதை விவரங்களை ஏற்றவும் (உயரம், சாலை வகைகள்,…)

# search-box.close-alt
source: Close
ta: மூடு

# search-box.resize-tooltip
source: Drag to resize, click to reset
ta: மறுஅளவிட இழுக்கவும், மீட்டமைக்க சொடுக்கு செய்யவும்

# search-form.search-description
source: Search for {{query}}
ta: {{query}} ஐத் தேடுங்கள்

# search-form.search-error
source: Search error
ta: தேடல் பிழை

# search-form.search-alt
source: Search
ta: தேடல்

# search-form.clear-alt
source: Clear
ta: தெளிவான

# search-form.auto-zoom
source: Auto-zoom to results
ta: முடிவுகளுக்கு ஆட்டோ-சூம்

# search-form.zoom-to-all
source: Zoom to all results
ta: எல்லா முடிவுகளுக்கும் பெரிதாக்கு

# search-form.map-only
source: Only search on map “{{mapName}}”
ta: Only தேடல் on map “{{mapName}}”

# search-form-tab.tab-label
source: Search
ta: தேடல்

# search-results.no-results
source: No results have been found.
ta: முடிவுகள் எதுவும் கிடைக்கவில்லை.

# search-results.zoom-to-result-tooltip
source: Zoom to result
ta: முடிவுக்கு பெரிதாக்கவும்

# search-results.show-details-tooltip
source: Show details
ta: விவரங்களைக் காட்டு

# search-results.select-all
source: Select all
ta: அனைத்தையும் தெரிவுசெய்

# search-results.add-to-map-label
source: Add selected item to map
ta: வரைபடத்தில் தேர்ந்தெடுக்கப்பட்ட உருப்படியைச் சேர்க்கவும்

# search-results.custom-type-mapping
source: Custom type mapping…
ta: தனிப்பயன் வகை மேப்பிங்…

# toasts.unexpected-error
source: Unexpected error
ta: எதிர்பாராத பிழை

# toasts.close-label
source: Close
ta: மூடு

# toasts.spinner-label
source: Loading…
ta: ஏற்றுகிறது…

# toolbox-add-dropdown.label
source: Add
ta: கூட்டு

# toolbox-add-dropdown.manage-types
source: Manage types
ta: வகைகளை நிர்வகிக்கவும்

# toolbox-collab-maps-dropdown.label
source: Collaborative maps
ta: கூட்டு வரைபடங்கள்

# toolbox-collab-maps-dropdown.bookmark
source: Bookmark map “{{mapName}}”
ta: புத்தகக்குறி வரைபடம் "{{mapName}}"

# toolbox-collab-maps-dropdown.manage-bookmarks
source: Manage bookmarks
ta: புக்மார்க்குகளை நிர்வகிக்கவும்

# toolbox-collab-maps-dropdown.create-map
source: Create a new map
ta: புதிய வரைபடத்தை உருவாக்கவும்

# toolbox-collab-maps-dropdown.open-map
source: Open an existing map
ta: ஏற்கனவே உள்ள வரைபடத்தைத் திறக்கவும்

# toolbox-collab-maps-dropdown.open-other-map
source: Open another map
ta: மற்றொரு வரைபடத்தைத் திறக்கவும்

# toolbox-collab-maps-dropdown.close-map
source: Close map “{{mapName}}”
ta: வரைபடத்தை மூடு “{{mapName}}”

# toolbox-help-dropdown.label
source: Help
ta: உதவி

# toolbox-help-dropdown.documentation
source: Documentation
ta: ஆவணப்படுத்துதல்

# toolbox-help-dropdown.matrix-chat
source: Matrix chat room
ta: மேட்ரிக்ச் அரட்டை அறை

# toolbox-help-dropdown.bugtracker
source: Report a problem
ta: ஒரு சிக்கலைப் புகாரளிக்கவும்

# toolbox-help-dropdown.forum
source: Ask a question
ta: கேள்வி கேளுங்கள்

# toolbox-help-dropdown.about
source: About {{appName}}
ta: {{appName}} பற்றி

# toolbox-map-style-dropdown.label
source: Map style
ta: வரைபட நடை

# toolbox-tools-dropdown.label
source: Tools
ta: கருவிகள்

# toolbox-tools-dropdown.share
source: Share
ta: பங்கு

# toolbox-tools-dropdown.open-file
source: Open file
ta: கோப்பை திற

# toolbox-tools-dropdown.export
source: Export
ta: ஏற்றுமதி

# toolbox-tools-dropdown.filter
source: Filter
ta: வடிப்பி

# toolbox-tools-dropdown.settings
source: Map settings
ta: வரைபட அமைப்புகள்

# toolbox-tools-dropdown.history
source: History
ta: வரலாறு

# toolbox-tools-dropdown.user-preferences
source: User preferences
ta: பயனர் விருப்பத்தேர்வுகள்

# toolbox-views-dropdown.label
source: Views
ta: காட்சிகள்

# toolbox-views-dropdown.save-current-view
source: Save current view
ta: தற்போதைய பார்வையைச் சேமிக்கவும்

# toolbox-views-dropdown.manage-views
source: Manage views
ta: காட்சிகளை நிர்வகிக்கவும்

# validated-field.validation-error
source: Error while validating form field
ta: படிவ புலத்தை சரிபார்க்கும்போது பிழை

# zoom-to-object-button.fallback-label
source: Zoom to object
ta: பொருளுக்கு பெரிதாக்கவும்

# links.geo-link
source: geo: link
ta: சியோ: இணைப்பு

# links.openstreetmap
source: OpenStreetMap
ta: ஓபன்ச்ட்ரீட் வரைபடம்

# links.openstreetmap-editor
source: OpenStreetMap Editor
ta: OpenStreetMap எடிட்டர்

# links.google-maps
source: Google Maps
ta: கூகிள் வரைபடங்கள்

# links.google-maps-satellite
source: Google Maps (Satellite)
ta: கூகிள் வரைபடங்கள் (செயற்கைக்கோள்)

# links.bing-maps
source: Bing Maps
ta: பிங் வரைபடங்கள்

# links.bing-maps-satellite
source: Bing Maps (Satellite)
ta: பிங் வரைபடங்கள் (செயற்கைக்கோள்)

# links.park4night
source: park4night
ta: பூங்கா 4 இரவு
