Repository: 247i/TACETr
Catalog: உரை/தானி/facilmap-facilmap-frontend-*.po
Languages: ta

# edit-type-dropdown-dialog.show-in-legend
source: Show in legend
ta: காட்டு in legend

# edit-type-dropdown-dialog.option
source: Option
ta: சூதம்

# edit-type-dropdown-dialog.label
source: Label (for legend)
ta: சிட்டை (புராணக்கதைக்கு)

# edit-type-dropdown-dialog.colour
source: Colour
ta: நிறம்

# edit-type-dropdown-dialog.size
source: Size
ta: அளவு

# edit-type-dropdown-dialog.icon
source: Icon
ta: படவுரு

# edit-type-dropdown-dialog.shape
source: Shape
ta: வடிவம்

# edit-type-dropdown-dialog.width
source: Width
ta: அகலம்

# edit-type-dropdown-dialog.stroke
source: Stroke
ta: பக்கவாதம்

# edit-type-dropdown-dialog.option-remove
source: Remove
ta: அகற்று

# edit-type-dropdown-dialog.option-reorder
source: Reorder
ta: மறுவரிசை

# edit-type-dropdown-dialog.option-add
source: Add
ta: கூட்டு

# elevation-stats.ascent-alt
source: Ascent
ta: ஏற்றம்

# elevation-stats.descent-alt
source: Descent
ta: இறக்கம்

# elevation-stats.show-tooltip
source: Show elevation statistics
ta: உயர புள்ளிவிவரங்களைக் காட்டு

# elevation-stats.show-alt
source: Show stats
ta: புள்ளிவிவரங்களைக் காட்டு

# elevation-stats.total-ascent
source: Total ascent
ta: மொத்த ஏற்றம்

# elevation-stats.total-descent
source: Total descent
ta: மொத்த வம்சாவளி

# export-dialog.format-option-gpx
source: GPX
ta: சி.பி.எக்ச்

# export-dialog.format-option-geojson
source: GeoJSON
ta: சியோச்சன்

# export-dialog.format-option-html
source: HTML
ta: உஉகுமொ

# export-dialog.format-option-csv
source: CSV
ta: சிஎச்வி

# export-dialog.column-name
source: Name
ta: பெயர்

# export-dialog.column-position
source: Position
ta: நிலை

# export-dialog.column-distance
source: Distance
ta: தூரம்

# export-dialog.column-time
source: Line time
ta: வரி நேரம்

# export-dialog.route-type-track
source: Track points
ta: டிராக் புள்ளிகள்

# export-dialog.route-type-track-zip
source: Track points, one file per line (ZIP file)
ta: ட்ராக் புள்ளிகள், ஒரு வரிக்கு ஒரு கோப்பு (சிப் கோப்பு)

# export-dialog.route-type-route
source: Route points
ta: பாதை புள்ளிகள்

# export-dialog.open-file
source: Open file
ta: கோப்பை திற

# export-dialog.download-file
source: Download file
ta: கோப்பைப் பதிவிறக்கவும்

# export-dialog.generate-link
source: Generate link
ta: இணைப்பை உருவாக்குங்கள்

# export-dialog.copy-to-clipboard
source: Copy to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கவும்

# export-dialog.select-type-error
source: Please select a type.
ta: ஒரு வகையைத் தேர்ந்தெடுக்கவும்.

# export-dialog.export-ok
source: Export
ta: ஏற்றுமதி

# export-dialog.copy-ok
source: Copy
ta: நகலெடு

# export-dialog.export-copied-title
source: {{format}} export copied
ta: {{format}} ஏற்றுமதி நகலெடுக்கப்பட்டது

# export-dialog.export-copied-message
source: The {{format}} export was copied to the clipboard.
ta: {{format}} ஏற்றுமதி கிளிப்போர்டில் நகலெடுக்கப்பட்டது.

# export-dialog.title
source: Export collaborative map
ta: கூட்டு வரைபடத்தை ஏற்றுமதி செய்யுங்கள்

# export-dialog.introduction
source: Export your map here to transfer it to another application, another device or another collaborative map.
ta: உங்கள் வரைபடத்தை மற்றொரு பயன்பாடு, மற்றொரு சாதனம் அல்லது மற்றொரு கூட்டு வரைபடத்திற்கு மாற்ற இங்கே ஏற்றுமதி செய்யுங்கள்.

# export-dialog.format
source: Format
ta: வடிவம்

# export-dialog.gpx-explanation
source: {{gpx}} files can be used to transfer your map data into navigation and route planning software and devices, such as OsmAnd or Garmin. They contain your markers and lines with their names and descriptions, but not their style attributes (with the exception of some basic attributes supported by OsmAnd).
ta: Map {{gpx}}} உங்கள் வரைபடத் தரவை வழிசெலுத்தல் மற்றும் பாதை திட்டமிடல் மென்பொருள் மற்றும் ஆச்மண்ட் அல்லது கார்மின் போன்ற சாதனங்களுக்கு மாற்ற கோப்புகள் பயன்படுத்தப்படலாம். அவை உங்கள் குறிப்பான்கள் மற்றும் வரிகளை அவற்றின் பெயர்கள் மற்றும் விளக்கங்களுடன் கொண்டிருக்கின்றன, ஆனால் அவற்றின் பாணி பண்புக்கூறுகள் அல்ல (ஆச்மாண்டால் ஆதரிக்கப்படும் சில அடிப்படை பண்புகளைத் தவிர).

# export-dialog.gpx-explanation-interpolation-gpx
source: GPX
ta: சி.பி.எக்ச்

# export-dialog.geojson-explanation
source: {{geojson}} files can be used to create complete backups or copies of your map. They contain the complete data of your map, including the map settings, views, types, markers and lines along with all their data attributes. To restore a GeoJSON backup or to create a copy of your map, simply import the file into FacilMap again.
ta: உங்கள் வரைபடத்தின் முழுமையான காப்புப்பிரதிகள் அல்லது நகல்களை உருவாக்க {{geojson}} கோப்புகளைப் பயன்படுத்தலாம். வரைபட அமைப்புகள், காட்சிகள், வகைகள், குறிப்பான்கள் மற்றும் கோடுகள் மற்றும் அவற்றின் அனைத்து தரவு பண்புகளும் உட்பட உங்கள் வரைபடத்தின் முழுமையான தரவைக் கொண்டுள்ளன. ஒரு சியோச்சன் காப்புப்பிரதியை மீட்டெடுக்க அல்லது உங்கள் வரைபடத்தின் நகலை உருவாக்க, கோப்பை மீண்டும் FICILMAP இல் இறக்குமதி செய்யுங்கள்.

# export-dialog.geojson-explanation-interpolation-geojson
source: GeoJSON
ta: சியோச்சன்

# export-dialog.html-explanation
source: {{html}} files can be opened by any web browser. Exporting a map to HTML will render a table with only the data attributes of all markers and lines. This table can also be copy&pasted into a spreadsheet application for further processing.
ta: {{html}} கோப்புகளை எந்த வலை உலாவியால் திறக்க முடியும். உஉகுமொ க்கு ஒரு வரைபடத்தை ஏற்றுமதி செய்வது அனைத்து குறிப்பான்கள் மற்றும் வரிகளின் தரவு பண்புகளை மட்டுமே கொண்ட அட்டவணையை வழங்கும். இந்த அட்டவணையை நகலெடுத்து மேலும் செயலாக்க ஒரு விரிதாள் பயன்பாட்டில் ஒட்டலாம்.

# export-dialog.html-explanation-interpolation-html
source: HTML
ta: உஉகுமொ

# export-dialog.csv-explanation
source: {{csv}} files can be imported into most spreadsheet applications and only contain the data attributes of the objects of one type of marker or line.
ta: {{csv}} கோப்புகளை பெரும்பாலான விரிதாள் பயன்பாடுகளில் இறக்குமதி செய்யலாம் மற்றும் ஒரு வகை மார்க்கர் அல்லது வரியின் பொருள்களின் தரவு பண்புகளை மட்டுமே கொண்டிருக்கலாம்.

# export-dialog.csv-explanation-interpolation-csv
source: CSV
ta: சிஎச்வி

# export-dialog.export-method
source: Export method
ta: ஏற்றுமதி முறை

# export-dialog.route-type
source: Route type
ta: பாதை வகை

# export-dialog.track-explanation
source: {{track}} will export your lines exactly as they are on your map.
ta: {{track} your உங்கள் வரிகள் உங்கள் வரைபடத்தில் இருப்பதைப் போலவே ஏற்றுமதி செய்யும்.

# export-dialog.track-explanation-interpolation-track
source: Track points
ta: டிராக் புள்ளிகள்

# export-dialog.track-zip-explanation
source: {{trackZip}} will create a ZIP file with one GPX file for all markers and one GPX file for each line. This works better with apps such as OsmAnd that only support one line style per file.
ta: {{trackZip} அனைத்தும் அனைத்து குறிப்பான்களுக்கும் ஒரு சிபிஎக்ச் கோப்புடன் ஒரு சிப் கோப்பையும் ஒவ்வொரு வரிக்கும் ஒரு சிபிஎக்ச் கோப்பையும் உருவாக்கும். ஒரு கோப்பிற்கு ஒரு வரி பாணியை மட்டுமே ஆதரிக்கும் OSMand போன்ற பயன்பாடுகளுடன் இது சிறப்பாக செயல்படுகிறது.

# export-dialog.track-zip-explanation-interpolation-trackZip
source: Track points, one file per line (ZIP file)
ta: ட்ராக் புள்ளிகள், ஒரு வரிக்கு ஒரு கோப்பு (சிப் கோப்பு)

# export-dialog.route-explanation
source: {{route}} will export only the from/via/to route points of your lines, and your navigation software/device will have to calculate the route using its own map data and algorithm.
ta: {{route} your உங்கள் வரிகளின்/வழியாக/முதல் பாதை புள்ளிகளை மட்டுமே ஏற்றுமதி செய்யும், மேலும் உங்கள் வழிசெலுத்தல் மென்பொருள்/சாதனம் அதன் சொந்த வரைபட தரவு மற்றும் வழிமுறையைப் பயன்படுத்தி பாதையை கணக்கிட வேண்டும்.

# export-dialog.route-explanation-interpolation-route
source: Route points
ta: பாதை புள்ளிகள்

# export-dialog.type
source: Type
ta: வகை

# export-dialog.include-columns
source: Include columns
ta: நெடுவரிசைகளை உள்ளடக்குங்கள்

# export-dialog.apply-filter
source: Apply filter
ta: வடிகட்டியைப் பயன்படுத்துங்கள்

# export-dialog.apply-filter-label
source: Only include objects visible under current filter
ta: தற்போதைய வடிகட்டியின் கீழ் காணக்கூடிய பொருள்களை மட்டுமே சேர்க்கவும்

# export-dropdown.export-error
source: Error exporting route
ta: பிழை ஏற்றுமதி பாதை

# export-dropdown.button-label
source: Export
ta: ஏற்றுமதி

# export-dropdown.gpx-track-tooltip
source: GPX files can be opened with most navigation software. In track mode, the calculated route is saved in the file.
ta: சிபிஎக்ச் கோப்புகளை பெரும்பாலான வழிசெலுத்தல் மென்பொருளுடன் திறக்க முடியும். டிராக் பயன்முறையில், கணக்கிடப்பட்ட பாதை கோப்பில் சேமிக்கப்படுகிறது.

# export-dropdown.gpx-track-label
source: Export as GPX track
ta: சிபிஎக்ச் பாதையாக ஏற்றுமதி செய்யுங்கள்

# export-dropdown.gpx-route-tooltip
source: GPX files can be opened with most navigation software. In route mode, only the start/end/via points are saved in the file, and the navigation software needs to calculate the route.
ta: சிபிஎக்ச் கோப்புகளை பெரும்பாலான வழிசெலுத்தல் மென்பொருளுடன் திறக்க முடியும். பாதை பயன்முறையில், தொடக்க/முடிவு/வழியாக புள்ளிகள் மட்டுமே கோப்பில் சேமிக்கப்படுகின்றன, மேலும் வழிசெலுத்தல் மென்பொருள் பாதையை கணக்கிட வேண்டும்.

# export-dropdown.gpx-route-label
source: Export as GPX route
ta: சிபிஎக்ச் பாதையாக ஏற்றுமதி செய்யுங்கள்

# export-dropdown.geojson-tooltip
source: GeoJSON files are commonly used in software that visualizes or analyzes geographical data.
ta: சியோச்சன் கோப்புகள் பொதுவாக புவியியல் தரவைக் காட்சிப்படுத்தும் அல்லது பகுப்பாய்வு செய்யும் மென்பொருளில் பயன்படுத்தப்படுகின்றன.

# export-dropdown.geojson-label
source: Export as GeoJSON
ta: ஏற்றுமதி அச் GeoJSON

# file-results.import-view-error
source: Error importing view
ta: பார்வை இறக்குமதி செய்வதில் பிழை

# file-results.import-type-error
source: Error importing type
ta: வகை இறக்குமதி வகை

# file-results.views
source: Views
ta: காட்சிகள்

# file-results.view
source: View
ta: பார்வை

# file-results.add-view-tooltip
source: Add this view to the map
ta: இந்த பார்வையை வரைபடத்தில் சேர்க்கவும்

# file-results.add-view-alt
source: Add
ta: கூட்டு

# file-results.markers-lines
source: Markers/Lines
ta: குறிப்பான்கள்/கோடுகள்

# file-results.types
source: Types
ta: வகைகள்

# file-results.type
source: Type
ta: வகை

# file-results.add-type-tooltip
source: Add this type to the map
ta: இந்த வகையை வரைபடத்தில் சேர்க்கவும்

# file-results.add-type-alt
source: Add
ta: கூட்டு

# files.invalid-xml-error
source: Invalid XML: {{textContent}}
ta: தவறான எக்ச்எம்எல்: {{textContent}}}

# heightgraph.distance
source: Distance
ta: தூரம்

# heightgraph.elevation
source: Elevation
ta: உயர்வு ரேகை

# heightgraph.segment-length
source: Segment length
ta: பிரிவு நீளம்

# heightgraph.type
source: Type
ta: வகை

# heightgraph.legend
source: Legend
ta: புராணக்கதை

# heightgraph.steepness
source: Steepness
ta: செங்குத்தானது

# heightgraph.waytype
source: Road type
ta: சாலை வகை

# heightgraph.surface
source: Surface
ta: மேற்பரப்பு

# heightgraph.suitablity
source: Suitability
ta: பொருந்தக்கூடிய தன்மை

# heightgraph.green
source: Green
ta: பச்சை

# heightgraph.noise
source: Noise
ta: இரைச்சல்

# heightgraph.tollways
source: Tollways
ta: டோல்வ்வேச்

# heightgraph.avgspeed
source: Average speed
ta: சராசரி விரைவு

# heightgraph.traildifficulty
source: Trail difficulty
ta: பாதை தொல்லை

# heightgraph.roadaccessrestrictions
source: Access restrictions
ta: அணுகல் கட்டுப்பாடுகள்

# heightgraph.unknown
source: Unknown
ta: தெரியவில்லை

# heightgraph.waytype-other
source: Other
ta: மற்றொன்று

# heightgraph.waytype-state-road
source: State road
ta: மாநில சாலை

# heightgraph.waytype-road
source: Road
ta: சாலை

# heightgraph.waytype-street
source: Street
ta: தெரு

# heightgraph.waytype-path
source: Path
ta: பாதை

# heightgraph.waytype-track
source: Track
ta: மின்தடம்

# heightgraph.waytype-cycleway
source: Cycleway
ta: சைக்கிள் பாதை

# heightgraph.waytype-footway
source: Footway
ta: பாதை

# heightgraph.waytype-steps
source: Steps
ta: படிகள்

# heightgraph.waytype-ferry
source: Ferry
ta: படகு

# heightgraph.waytype-construction
source: Construction
ta: கட்டுமானம்

# heightgraph.surface-other
source: Other
ta: மற்றொன்று

# heightgraph.surface-paved
source: Paved
ta: நடைபாதை

# heightgraph.surface-unpaved
source: Unpaved
ta: செப்பனிடப்படாதது

# heightgraph.surface-asphalt
source: Asphalt
ta: நிலக்கீல்

# heightgraph.surface-contrete
source: Concrete
ta: கான்கிரீட்

# heightgraph.surface-cobblestone
source: Cobblestone
ta: கோப்ச்டோன்

# heightgraph.surface-metal
source: Metal
ta: மாழை

# heightgraph.surface-wood
source: Wood
ta: மரம்

# heightgraph.surface-compacted-gravel
source: Compacted gravel
ta: கச்சிதமான சரளை

# heightgraph.surface-fine-gravel
source: Fine gravel
ta: நன்றாக சரளை

# heightgraph.surface-gravel
source: Gravel
ta: சரளை

# heightgraph.surface-dirt
source: Dirt
ta: அழுக்கு

# heightgraph.surface-ground
source: Ground
ta: மைதானம்

# heightgraph.surface-ice
source: Ice
ta: பனி

# heightgraph.surface-paving-stones
source: Paving stones
ta: நடைபாதை கற்கள்

# heightgraph.surface-sand
source: Sand
ta: மணல்

# heightgraph.surface-woodchips
source: Woodchips
ta: வூட் சிப்ச்

# heightgraph.surface-grass
source: Grass
ta: புல்

# heightgraph.surface-grass-paver
source: Grass paver
ta: புல் பேவர்

# heightgraph.tollway-no
source: No tollway
ta: டோல்வே இல்லை

# heightgraph.tollway-yes
source: Tollway
ta: டோல்வே

# heightgraph.traildifficulty-unknown
source: Missing SAC tag
ta: SAC குறிச்சொல்லைக் காணவில்லை

# heightgraph.access-yes
source: Yes
ta: ஆம்

# heightgraph.access-no
source: No
ta: இல்லை

# heightgraph.access-customers
source: Customers
ta: வாடிக்கையாளர்கள்

# heightgraph.access-destination
source: Destination
ta: இலக்கு

# heightgraph.access-delivery
source: Delivery
ta: வழங்கு

# heightgraph.access-private
source: Private
ta: தனிப்பட்ட

# heightgraph.access-permissive
source: Permissive
ta: இசைவு

# help-popover.show-alt
source: Show explanation
ta: விளக்கத்தைக் காட்டு

# history-dialog.loading-error
source: Error loading history
ta: வரலாற்றை ஏற்றுவதில் பிழை

# history-dialog.revert-error
source: Error reverting history entry
ta: வரலாற்று நுழைவை மாற்றுவதில் பிழை

# history-dialog.title
source: History
ta: வரலாறு

# history-dialog.introduction
source: Here you can inspect and revert the last 50 changes to the map.
ta: வரைபடத்தின் கடைசி 50 மாற்றங்களை இங்கே நீங்கள் ஆய்வு செய்து மாற்றலாம்.

# history-dialog.date
source: Date
ta: திகதி

# history-dialog.action
source: Action
ta: செயல்

# history-dialog.restore
source: Restore
ta: மீட்டமை

# history-dialog.diff-field
source: Field
ta: புலம்

# history-dialog.diff-before
source: Before
ta: முன்

# history-dialog.diff-after
source: After
ta: பிறகு

# history-utils.description-create-marker
source: Created marker {{id}} {{quotedName}}
ta: உருவாக்கிய மார்க்கர் {{id}} {{{quotedName}}}

# history-utils.description-create-line
source: Created line {{id}} {{quotedName}}
ta: உருவாக்கிய வரி {{id}} {{{quotedName}}

# history-utils.description-create-view
source: Created view {{id}} {{quotedName}}
ta: உருவாக்கப்பட்ட பார்வை {{id}} {{quotedName}}}

# history-utils.description-create-type
source: Created type {{id}} {{quotedName}}
ta: உருவாக்கிய வகை {{id}} {{{quotedName}}}

# history-utils.description-update-map
source: Changed map settings
ta: மாற்றப்பட்ட வரைபட அமைப்புகள்

# history-utils.description-update-marker
source: Changed marker {{id}} {{quotedName}}
ta: மாற்றப்பட்ட மார்க்கர் {{id}} {{quotedName}}

# history-utils.description-update-line
source: Changed line {{id}} {{quotedName}}
ta: மாற்றப்பட்ட வரி {{id}} {{{quotedName}}}

# history-utils.description-update-view
source: Changed view {{id}} {{quotedName}}
ta: மாற்றப்பட்ட பார்வை {{id}} {{quotedName}}}

# history-utils.description-update-type
source: Changed type {{id}} {{quotedName}}
ta: மாற்றப்பட்ட வகை {{id}} {{quotedName}}

# history-utils.description-delete-marker
source: Deleted marker {{id}} {{quotedName}}
ta: நீக்கப்பட்ட மார்க்கர் {{id}} {{quotedName}}

# history-utils.description-delete-line
source: Deleted line {{id}} {{quotedName}}
ta: நீக்கப்பட்ட வரி {{id}} {{quotedName}}

# history-utils.description-delete-view
source: Deleted view {{id}} {{quotedName}}
ta: நீக்கப்பட்ட பார்வை {{id}} {{quotedName}}

# history-utils.description-delete-type
source: Deleted type {{id}} {{quotedName}}
ta: நீக்கப்பட்ட வகை {{id}} {{{quotedName}}

# history-utils.description-interpolation-quotedName-renamed
source: {{quotedBefore}} (new name: {{quotedAfter}})
ta: {{quotedBefore}}} (புதிய பெயர்: {{quotedAfter}})

# history-utils.revert-create
source: Revert (delete)
ta: மாற்றியமைக்கவும் (நீக்கு)

# history-utils.revert-create-marker-title
source: Delete marker
ta: மதிப்பெண்களை நீக்கு

# history-utils.revert-create-line-title
source: Delete line
ta: வரியை நீக்கு

# history-utils.revert-create-view-title
source: Delete view
ta: பார்வையை நீக்கு

# history-utils.revert-create-type-title
source: Delete type
ta: வகையை நீக்கு

# history-utils.revert-create-marker-message-named
source: Do you really want to delete the marker {{quotedName}}?
ta: நீங்கள் உண்மையில் மார்க்கரை நீக்க விரும்புகிறீர்களா {{quotedName}}}

# history-utils.revert-create-marker-message-unnamed
source: Do you really want to delete this marker?
ta: இந்த மார்க்கரை நீக்க விரும்புகிறீர்களா?

# history-utils.revert-create-line-message-named
source: Do you really want to delete the line {{quotedName}}?
ta: {{quotedName}} வரியை நீக்க விரும்புகிறீர்களா?

# history-utils.revert-create-line-message-unnamed
source: Do you really want to delete this line?
ta: இந்த வரியை நீக்க விரும்புகிறீர்களா?

# history-utils.revert-create-view-message-named
source: Do you really want to delete the view {{quotedName}}?
ta: பார்வையை நீக்க விரும்புகிறீர்களா {{quotedName}}}}

# history-utils.revert-create-view-message-unnamed
source: Do you really want to delete this view?
ta: இந்த பார்வையை நீக்க விரும்புகிறீர்களா?

# history-utils.revert-create-type-message-named
source: Do you really want to delete the type {{quotedName}}?
ta: {{quotedName}} வகையை நீக்க விரும்புகிறீர்களா?

# history-utils.revert-create-type-message-unnamed
source: Do you really want to delete this type?
ta: இந்த வகையை நீக்க விரும்புகிறீர்களா?

# history-utils.revert-create-button
source: Delete
ta: நீக்கு

# history-utils.revert-update
source: Revert
ta: மாற்றியமைக்கவும்

# history-utils.revert-update-map-title
source: Revert map settings
ta: வரைபட அமைப்புகளை மாற்றவும்

# history-utils.revert-update-marker-title
source: Revert marker
ta: மதிப்பெண்களைத் திருப்பி விடுங்கள்

# history-utils.revert-update-line-title
source: Revert line
ta: வரி மாற்றவும்

# history-utils.revert-update-view-title
source: Revert view
ta: பார்வையை மாற்றவும்

# history-utils.revert-update-type-title
source: Revert type
ta: வகை

# history-utils.revert-update-map-message
source: Do you really want to restore the old version of the map settings?
ta: வரைபட அமைப்புகளின் பழைய பதிப்பை மீட்டெடுக்க விரும்புகிறீர்களா?

# history-utils.revert-update-marker-message-named
source: Do you really want to restore the old version of the marker {{quotedName}}?
ta: மார்க்கரின் பழைய பதிப்பை {{quotedName}} மீட்டமைக்க விரும்புகிறீர்களா?

# history-utils.revert-update-marker-message-unnamed
source: Do you really want to restore the old version of this marker?
ta: இந்த மார்க்கரின் பழைய பதிப்பை மீட்டெடுக்க விரும்புகிறீர்களா?

# history-utils.revert-update-line-message-named
source: Do you really want to restore the old version of the line {{quotedName}}?
ta: {{quotedName}} வரியின் பழைய பதிப்பை மீட்டெடுக்க விரும்புகிறீர்களா?

# history-utils.revert-update-line-message-unnamed
source: Do you really want to restore the old version of this line?
ta: இந்த வரியின் பழைய பதிப்பை மீட்டெடுக்க விரும்புகிறீர்களா?

# history-utils.revert-update-view-message-named
source: Do you really want to restore the old version of the view {{quotedName}}?
ta: பார்வையின் பழைய பதிப்பை {{quotedName}} மீட்டமைக்க விரும்புகிறீர்களா?

# history-utils.revert-update-view-message-unnamed
source: Do you really want to restore the old version of this view?
ta: இந்த பார்வையின் பழைய பதிப்பை மீட்டெடுக்க விரும்புகிறீர்களா?

# history-utils.revert-update-type-message-named
source: Do you really want to restore the old version of the type {{quotedName}}?
ta: {{quotedName}} வகையின் பழைய பதிப்பை மீட்டெடுக்க விரும்புகிறீர்களா?

# history-utils.revert-update-type-message-unnamed
source: Do you really want to restore the old version of this type?
ta: இந்த வகையின் பழைய பதிப்பை மீட்டெடுக்க விரும்புகிறீர்களா?

# history-utils.revert-update-button
source: Revert
ta: மாற்றியமைக்கவும்

# history-utils.revert-delete
source: Restore
ta: மீட்டமை

# history-utils.revert-delete-marker-title
source: Restore marker
ta: மார்க்கரை மீட்டமை

# history-utils.revert-delete-line-title
source: Restore line
ta: வரியை மீட்டமை

# history-utils.revert-delete-view-title
source: Restore view
ta: பார்வையை மீட்டமை

# history-utils.revert-delete-type-title
source: Restore type
ta: வகையை மீட்டமை

# history-utils.revert-delete-marker-message-named
source: Do you really want to restore the marker {{quotedName}}?
ta: {{quotedName}} மார்க்கரை மீட்டெடுக்க விரும்புகிறீர்களா?

# history-utils.revert-delete-marker-message-unnamed
source: Do you really want to restore this marker?
ta: இந்த மார்க்கரை மீட்டெடுக்க விரும்புகிறீர்களா?

# history-utils.revert-delete-line-message-named
source: Do you really want to restore the line {{quotedName}}?
ta: {{quotedName}} வரியை மீட்டெடுக்க விரும்புகிறீர்களா?

# history-utils.revert-delete-line-message-unnamed
source: Do you really want to restore this line?
ta: இந்த வரியை மீட்டெடுக்க நீங்கள் உண்மையில் விரும்புகிறீர்களா?

# history-utils.revert-delete-view-message-named
source: Do you really want to restore the view {{quotedName}}?
ta: {{quotedName}} பார்வையை மீட்டெடுக்க விரும்புகிறீர்களா?

# history-utils.revert-delete-view-message-unnamed
source: Do you really want to restore this view?
ta: இந்த பார்வையை மீட்டெடுக்க நீங்கள் உண்மையில் விரும்புகிறீர்களா?

# history-utils.revert-delete-type-message-named
source: Do you really want to restore the type {{quotedName}}?
ta: {{quotedName}} வகையை மீட்டெடுக்க விரும்புகிறீர்களா?

# history-utils.revert-delete-type-message-unnamed
source: Do you really want to restore this type?
ta: இந்த வகையை மீட்டெடுக்க நீங்கள் உண்மையில் விரும்புகிறீர்களா?

# history-utils.revert-delete-button
source: Restore
ta: மீட்டமை

# hybrid-popover.close-label
source: Close
ta: மூடு

# hybrid-popover.ok-label
source: OK
ta: சரி

# import-tab.parse-error-title
source: Parsing error
ta: பாகுபடுத்தும் பிழை

# import-tab.parse-error-message
source: The selected file could not be parsed.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பை பாகுபடுத்த முடியவில்லை.

# import-tab.no-geometries-error-title
source: No geometries
ta: வடிவியல் இல்லை

# import-tab.no-geometries-error-message
source: The selected file did not contain any geometries.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பில் எந்த வடிவவியலும் இல்லை.

# import-tab.partial-parse-error-title
source: Parsing error
ta: பாகுபடுத்தும் பிழை

# import-tab.partial-parse-error-message
source: Some of the selected files could not be parsed.
ta: தேர்ந்தெடுக்கப்பட்ட சில கோப்புகளை பாகுபடுத்த முடியவில்லை.

# import-tab.read-error-title
source: Error reading files
ta: கோப்புகளைப் படிப்பதில் பிழை

# leaflet-map.open-full-size
source: Open {{appName}} in full size
ta: முழு அளவில் {{appName}} ஐத் திறக்கவும்

# leaflet-map.loading
source: Loading…
ta: ஏற்றுகிறது…

# leaflet-map.attribution-notice
source: This app is based on map data from [OpenStreetMap](https://www.openstreetmap.org/copyright). Find out more in the “[About {{appName}}](#about-dialog)” dialog in the Help menu.
ta: இந்த பயன்பாடு [openstreetmap] (https://www.openstreetmap.org/copyright) இலிருந்து MAP தரவை அடிப்படையாகக் கொண்டது. உதவி பட்டியலில் “[பற்றி {{appName}}] (#பற்றி-டயலாக்)” உரையாடலில் மேலும் அறியவும்.

# leaflet-map-components.pois-too-many-results
source: Not all POIs are shown because there are too many results. Zoom in to show all results.
ta: பல முடிவுகள் இருப்பதால் எல்லா POI களும் காட்டப்படவில்லை. எல்லா முடிவுகளையும் காட்ட பெரிதாக்கவும்.
