Repository: 247i/TACETr
Catalog: உரை/தானி/feishin-translation-*.po
Languages: ta

# action.addToFavorites
source: add to $t(entity.favorite, {"count": 2})
ta: $t(entity.favorite, {"count": 2}) இல் சேர்க்கவும்

# action.addToPlaylist
source: add to $t(entity.playlist, {"count": 1})
ta: $t(entity.playlist, {"count": 1})இல் சேர்க்கவும்

# action.addOrRemoveFromSelection
source: add or remove from selection
ta: தேர்வில் இருந்து சேர்க்கவும் அல்லது நீக்கவும்

# action.selectRangeOfItems
source: select a range of items
ta: உருப்படிகளின் வரம்பைத் தேர்ந்தெடுக்கவும்

# action.clearQueue
source: clear queue
ta: தெளிவான வரிசை

# action.createPlaylist
source: create $t(entity.playlist, {"count": 1})
ta: $t(entity.playlist, {"count": 1})ஐ உருவாக்கவும்

# action.createRadioStation
source: create $t(entity.radioStation, {"count": 1})
ta: $t(entity.radioStation, {"count": 1}) உருவாக்கவும்

# action.deletePlaylist
source: delete $t(entity.playlist, {"count": 1})
ta: $t(entity.playlist, {"count": 1})ஐ நீக்கு

# action.deleteRadioStation
source: delete $t(entity.radioStation, {"count": 1})
ta: $t(entity.radioStation, {"count": 1}) நீக்கு

# action.selectAll
source: select all
ta: அனைத்தையும் தெரிவுசெய்

# action.deselectAll
source: deselect all
ta: அனைத்தையும் தேர்வு செய்யுங்கள்

# action.downloadStarted
source: started download of {{count}} items
ta: {{count}} உருப்படிகளின் பதிவிறக்கம் தொடங்கியது

# action.editPlaylist
source: edit $t(entity.playlist, {"count": 1})
ta: திருத்து $t(entity.playlist, {"count": 1})

# action.goToPage
source: go to page
ta: பக்கத்திற்குச் செல்லுங்கள்

# action.moveToNext
source: move to next
ta: அடுத்து செல்லுங்கள்

# action.moveToBottom
source: move to bottom
ta: கீழே செல்லுங்கள்

# action.moveToTop
source: move to top
ta: மேலே செல்லுங்கள்

# action.moveUp
source: move up
ta: மேலே செல்ல

# action.moveDown
source: move down
ta: கீழே நகர

# action.holdToMoveToTop
source: hold to move to top
ta: மேலே செல்ல அழுத்திப் பிடிக்கவும்

# action.holdToMoveToBottom
source: hold to move to bottom
ta: கீழே நகர்த்த பிடிக்கவும்

# action.moveItems
source: move items
ta: பொருட்களை நகர்த்த

# action.shuffle
source: shuffle
ta: கலக்கு

# action.shuffleAll
source: shuffle all
ta: அனைத்தையும் கலக்கவும்

# action.shuffleSelected
source: shuffle selected
ta: கலக்கு தேர்ந்தெடுக்கப்பட்டது

# action.removeFromFavorites
source: remove from $t(entity.favorite, {"count": 2})
ta: $t(entity.favorite, {"count": 2})இலிருந்து அகற்று

# action.removeFromPlaylist
source: remove from $t(entity.playlist, {"count": 1})
ta: $t(entity.playlist, {"count": 1}) இலிருந்து அகற்று

# action.removeFromQueue
source: remove from queue
ta: வரிசையிலிருந்து அகற்று

# action.setRating
source: set rating
ta: மதிப்பீட்டை அமைக்கவும்

# action.toggleSmartPlaylistEditor
source: toggle $t(entity.smartPlaylist) editor
ta: மாற்று $t(entity.smartPlaylist) ஆசிரியர்

# action.viewPlaylists
source: view $t(entity.playlist, {"count": 2})
ta: $t(entity.playlist, {"count": 2}) காண்க

# action.viewMore
source: view more
ta: மேலும் பார்க்க

# action.openApplicationDirectory
source: open application directory
ta: பயன்பாட்டு கோப்பகத்தைத் திறக்கவும்

# action.openIn.lastfm
source: Open in Last.fm
ta: Last.fm இல் திறந்திருக்கும்

# action.openIn.musicbrainz
source: Open in MusicBrainz
ta: மியூசிக் பிரைன்ச் திறந்திருக்கும்

# common.countSelected
source: {{count}} selected
ta: {{count}} தேர்ந்தெடுக்கப்பட்டது

# common.explicitStatus
source: explicit status
ta: வெளிப்படையான நிலை

# common.action
source: action
ta: செயல்

# common.add
source: add
ta: கூட்டு

# common.additionalParticipants
source: additional participants
ta: கூடுதல் பங்கேற்பாளர்கள்

# common.newVersion
source: a new version has been installed ({{version}})
ta: புதிய பதிப்பு நிறுவப்பட்டுள்ளது ({{version}})

# common.viewReleaseNotes
source: view release notes
ta: வெளியீட்டு குறிப்புகளைக் காண்க

# common.albumGain
source: album gain
ta: ஆல்பம் ஆதாயம்

# common.albumPeak
source: album peak
ta: ஆல்பம் உச்சம்

# common.areYouSure
source: are you sure?
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா?

# common.ascending
source: ascending
ta: ஏறுதல்

# common.backward
source: backward
ta: பின்னோக்கு

# common.biography
source: biography
ta: சுயசரிதை

# common.bitDepth
source: bit depth
ta: பிட் ஆழம்

# common.bitrate
source: bitrate
ta: பிட்ரேட்

# common.bpm
source: bpm
ta: பிபிஎம்

# common.cancel
source: cancel
ta: ரத்துசெய்

# common.center
source: center
ta: நடுவண்

# common.channel
source: channel
ta: வாய்க்கால்

# common.clear
source: clear
ta: தெளிவான

# common.close
source: close
ta: மூடு

# common.codec
source: codec
ta: புரிப்பு

# common.collapse
source: collapse
ta: சரிவு

# common.comingSoon
source: coming soon…
ta: விரைவில் வருகிறது…

# common.configure
source: configure
ta: உள்ளமைக்கவும்

# common.confirm
source: confirm
ta: உறுதிப்படுத்தவும்

# common.create
source: create
ta: உருவாக்கு

# common.currentSong
source: current $t(entity.track, {"count": 1})
ta: தற்போதைய $t(entity.track, {"count": 1})

# common.decrease
source: decrease
ta: குறைவு

# common.delete
source: delete
ta: நீக்கு

# common.descending
source: descending
ta: இறங்கு

# common.description
source: description
ta: விவரம்

# common.disable
source: disable
ta: முடக்கு

# common.disc
source: disc
ta: வட்டு

# common.dismiss
source: dismiss
ta: தள்ளுபடி

# common.doNotShowAgain
source: do not show this again
ta: இதை மீண்டும் காட்டாதே

# common.duration
source: duration
ta: காலம்

# common.view
source: view
ta: பார்வை

# common.edit
source: edit
ta: தொகு

# common.enable
source: enable
ta: இயக்கு

# common.expand
source: expand
ta: விரிவாக்கு

# common.example
source: example
ta: சான்று

# common.externalLinks
source: external links
ta: வெளிப்புற இணைப்புகள்

# common.faster
source: faster
ta: வேகமாக

# common.favorite
source: favorite
ta: பிடித்த

# common.filter
source: filter
ta: வடிப்பி

# common.filters
source: filters
ta: வடிப்பான்கள்

# common.filter_single
source: single
ta: ஒற்றை

# common.filter_multiple
source: multi
ta: பல

# common.forceRestartRequired
source: restart to apply changes… close the notification to restart
ta: மாற்றங்களைப் பயன்படுத்த மறுதொடக்கம் செய்… மறுதொடக்கம் செய்ய அறிவிப்பை மூடு

# common.forward
source: forward
ta: முன்னோக்கி

# common.gap
source: gap
ta: இடைவெளி

# common.home
source: home
ta: வீடு

# common.increase
source: increase
ta: அதிகரிப்பு

# common.left
source: left
ta: இடது

# common.limit
source: limit
ta: வரம்பு

# common.manage
source: manage
ta: நிர்வகிக்கவும்

# common.maximize
source: maximize
ta: அதிகரிக்கவும்

# common.menu
source: menu
ta: பட்டியல்

# common.minimize
source: minimize
ta: குறைக்கவும்

# common.modified
source: modified
ta: மாற்றியமைக்கப்பட்ட

# common.mbid
source: MusicBrainz ID
ta: மியூசிக் பிரேன்ச் ஐடி

# common.mood
source: mood
ta: மனநிலை

# common.name
source: name
ta: பெயர்

# common.no
source: no
ta: இல்லை

# common.none
source: none
ta: எதுவுமில்லை

# common.noResultsFromQuery
source: the query returned no results
ta: வினவல் எந்த முடிவுகளும் திரும்பவில்லை

# common.noFilters
source: no filters configured
ta: வடிப்பான்கள் எதுவும் கட்டமைக்கப்படவில்லை

# common.note
source: note
ta: குறிப்பு

# common.ok
source: ok
ta: சரி

# common.owner
source: owner
ta: உரிமையாளர்

# common.path
source: path
ta: பாதை

# common.playerMustBePaused
source: player must be paused
ta: வீரர் இடைநிறுத்தப்பட வேண்டும்

# common.preview
source: preview
ta: முன்னோட்டம்

# common.previousSong
source: previous $t(entity.track, {"count": 1})
ta: முந்தைய $t(entity.track, {"count": 1})

# common.private
source: private
ta: தனிப்பட்ட

# common.public
source: public
ta: பொது

# common.quit
source: quit
ta: வெளியேறு

# common.random
source: random
ta: சீரற்ற

# common.rating
source: rating
ta: செயல்வரம்பு

# common.retry
source: retry
ta: மீண்டும் முயற்சிக்கவும்

# common.recordLabel
source: record label
ta: பதிவு சிட்டை

# common.releaseType
source: release type
ta: வெளியீட்டு வகை

# common.refresh
source: refresh
ta: புதுப்பிப்பு

# common.reload
source: reload
ta: ஏற்றவும்

# common.rename
source: rename
ta: மறுபெயரிடுங்கள்

# common.reset
source: reset
ta: மீட்டமை

# common.resetToDefault
source: reset to default
ta: இயல்புநிலைக்கு மீட்டமைக்கவும்

# common.restartRequired
source: restart required
ta: மறுதொடக்கம் தேவை

# common.right
source: right
ta: வலது

# common.sampleRate
source: sample rate
ta: மாதிரி வீதம்

# common.save
source: save
ta: சேமி

# common.saveAndReplace
source: save and replace
ta: சேமித்து மாற்றவும்

# common.saveAs
source: save as
ta: என சேமி

# common.search
source: search
ta: தேடல்

# common.setting
source: setting
ta: அமைத்தல்

# common.slower
source: slower
ta: மெதுவாக

# common.share
source: share
ta: பங்கு

# common.size
source: size
ta: அளவு

# common.sort
source: sort
ta: வரிசைப்படுத்து

# common.sortOrder
source: order
ta: ஒழுங்கு

# common.tags
source: tags
ta: குறிச்சொற்கள்

# common.title
source: title
ta: தலைப்பு

# common.trackNumber
source: track
ta: மின்தடம்

# common.trackGain
source: track gain
ta: தடமறிதல்

# common.trackPeak
source: track peak
ta: ட்ராக் பீக்

# common.translation
source: translation
ta: மொழிபெயர்ப்பு

# common.unknown
source: unknown
ta: தெரியவில்லை

# common.version
source: version
ta: பதிப்பு

# common.year
source: year
ta: ஆண்டு

# common.yes
source: yes
ta: ஆம்

# common.explicit
source: explicit
ta: வெளிப்படையான

# common.clean
source: clean
ta: தூய்மையான

# common.gridRows
source: grid rows
ta: கட்டம் வரிசைகள்

# common.tableColumns
source: table columns
ta: அட்டவணை நெடுவரிசைகள்

# common.itemsMore
source: {{count}} more
ta: மேலும் {{count}}

# entity.album
source: album
ta: ஆல்பம்

# entity.albumArtist
source: album artist
ta: ஆல்பம் கலைஞர்

# entity.albumArtistCount
source: {{count}} album artist
ta: {{count}} ஆல்பம் கலைஞர்

# entity.albumWithCount
source: {{count}} album
ta: {{count}} ஆல்பம்

# entity.radioStation
source: radio station
ta: வானொலி நிலையம்

# entity.radioStationWithCount
source: {{count}} radio station
ta: {{count}} வானொலி நிலையம்

# entity.artist
source: artist
ta: கலைஞர்

# entity.artistWithCount
source: {{count}} artist
ta: {{count}} கலைஞர்

# entity.favorite
source: favorite
ta: பிடித்தது

# entity.folder
source: folder
ta: கோப்புறை

# entity.folderWithCount
source: {{count}} folder
ta: {{count}} கோப்புறை

# entity.genre
source: genre
ta: வகை

# entity.genreWithCount
source: {{count}} genre
ta: {{count}} வகை

# entity.playlist
source: playlist
ta: பிளேலிச்ட்

# entity.play
source: {{count}} play
ta: {{count}} விளையாடு

# entity.playlistWithCount
source: {{count}} playlist
ta: {{count}} பிளேலிச்ட்

# entity.smartPlaylist
source: smart $t(entity.playlist, {"count": 1})
ta: அறிவுள்ள $t(entity.playlist, {"count": 1})

# entity.track
source: track
ta: மின்தடம்

# entity.song
source: song
ta: பாடல்

# entity.trackWithCount
source: {{count}} track
ta: {{count}} தடம்

# error.apiRouteError
source: unable to route request
ta: பாதை கோரிக்கை செய்ய முடியவில்லை

# error.audioDeviceFetchError
source: an error occurred when trying to get audio devices
ta: ஆடியோ சாதனங்களைப் பெற முயற்சிக்கும்போது பிழை ஏற்பட்டது

# error.authenticationFailed
source: authentication failed
ta: ஏற்பு தோல்வியடைந்தது

# error.badAlbum
source: you are seeing this page because this song is not part of an album. you are most likely seeing this issue if you have a song at the top level of your music folder. Jellyfin only groups tracks if they are in a folder
ta: இந்த பாடல் ஆல்பத்தின் பகுதியாக இல்லாததால் இந்தப் பக்கத்தைப் பார்க்கிறீர்கள். உங்கள் இசை கோப்புறையின் மேல் மட்டத்தில் ஒரு பாடல் இருந்தால் இந்த சிக்கலைப் பார்க்கிறீர்கள். செல்லிஃபின் ஒரு கோப்புறையில் இருந்தால் தடங்களை மட்டுமே குழுக்கள்

# error.badValue
source: invalid option "{{value}}". this value no longer exists
ta: தவறான விருப்பம் "{{value}}". இந்த மதிப்பு இனி இல்லை

# error.credentialsRequired
source: credentials required
ta: நற்சான்றிதழ்கள் தேவை

# error.endpointNotImplementedError
source: endpoint {{endpoint}} is not implemented for {{serverType}}
ta: Endpoint {{endpoint}} {{serverType}} க்கு செயல்படுத்தப்படவில்லை

# error.genericError
source: an error occurred
ta: பிழை ஏற்பட்டது

# error.invalidJson
source: invalid JSON
ta: தவறான சாதொபொகு

# error.invalidServer
source: invalid server
ta: தவறான சேவையகம்

# error.localFontAccessDenied
source: access denied to local fonts
ta: உள்ளக எழுத்துருக்களுக்கு மறுக்கப்பட்டது

# error.loginRateError
source: too many login attempts, please try again in a few seconds
ta: பல உள்நுழைவு முயற்சிகள், தயவுசெய்து சில நொடிகளில் மீண்டும் முயற்சிக்கவும்

# error.mpvRequired
source: MPV required
ta: MPV தேவை

# error.multipleServerSaveQueueError
source: the play queue has one or more songs which are not from the current server. this is not supported
ta: நாடக வரிசையில் ஒன்று அல்லது அதற்கு மேற்பட்ட பாடல்கள் உள்ளன, அவை தற்போதைய சேவையகத்திலிருந்து இல்லை. இது ஆதரிக்கப்படவில்லை

# error.networkError
source: a network error occurred
ta: பிணைய பிழை ஏற்பட்டது

# error.noNetwork
source: server unavailable
ta: சர்வர் கிடைக்கவில்லை

# error.noNetworkDescription
source: couldn't connect to this server
ta: இந்த சேவையகத்துடன் இணைக்க முடியவில்லை

# error.notificationDenied
source: permissions for notifications were denied. this setting has no effect
ta: அறிவிப்புகளுக்கான அனுமதிகள் மறுக்கப்பட்டன. இந்த அமைப்பு எந்த விளைவையும் ஏற்படுத்தாது

# error.openError
source: could not open file
ta: கோப்பைத் திறக்க முடியவில்லை

# error.playbackError
source: an error occurred when trying to play the media
ta: ஊடகங்களை விளையாட முயற்சிக்கும்போது பிழை ஏற்பட்டது

# error.remoteDisableError
source: an error occurred when trying to $t(common.disable) the remote server
ta: தொலைநிலை சேவையகத்தை $t(common.disable) முயற்சிக்கும்போது பிழை ஏற்பட்டது

# error.remoteEnableError
source: an error occurred when trying to $t(common.enable) the remote server
ta: தொலைநிலை சேவையகத்தை $t(common.enable) முயற்சிக்கும்போது பிழை ஏற்பட்டது

# error.remotePortError
source: an error occurred when trying to set the remote server port
ta: தொலை சேவையக துறைமுகத்தை அமைக்க முயற்சிக்கும்போது பிழை ஏற்பட்டது

# error.remotePortWarning
source: restart the server to apply the new port
ta: புதிய துறைமுகத்தைப் பயன்படுத்த சேவையகத்தை மறுதொடக்கம் செய்யுங்கள்

# error.saveQueueFailed
source: failed to save queue
ta: வரிசையைச் சேமிக்க முடியவில்லை

# error.serverLockSingleServer
source: only one server is allowed when server is locked
ta: சேவையகம் பூட்டப்பட்டிருக்கும் போது ஒரு சேவையகம் மட்டுமே அனுமதிக்கப்படும்

# error.serverNotSelectedError
source: no server selected
ta: சேவையகம் எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# error.serverRequired
source: server required
ta: சேவையகம் தேவை

# error.sessionExpiredError
source: your session has expired
ta: உங்கள் அமர்வு காலாவதியானது

# error.systemFontError
source: an error occurred when trying to get system fonts
ta: கணினி எழுத்துருக்களைப் பெற முயற்சிக்கும்போது பிழை ஏற்பட்டது

# error.settingsSyncError
source: discrepancies were found between the settings in the renderer and the main process. restart the application to apply the changes
ta: ரெண்டரரில் உள்ள அமைப்புகளுக்கும் முக்கிய செயல்முறைக்கும் இடையே முரண்பாடுகள் கண்டறியப்பட்டன. மாற்றங்களைப் பயன்படுத்த பயன்பாட்டை மறுதொடக்கம் செய்யுங்கள்

# filter.matchAnd
source: and
ta: மற்றும்

# filter.matchOr
source: or
ta: அல்லது

# filter.albumCount
source: $t(entity.album, {"count": 2}) count
ta: $t(entity.album, {"count": 2}) எண்ணிக்கை

# filter.biography
source: biography
ta: சுயசரிதை

# filter.bitrate
source: bitrate
ta: பிட்ரேட்

# filter.bpm
source: bpm
ta: பிபிஎம்

# filter.comment
source: comment
ta: கருத்து

# filter.communityRating
source: community rating
ta: சமூக மதிப்பீடு

# filter.criticRating
source: critic rating
ta: விமர்சகர் மதிப்பீடு

# filter.dateAdded
source: date added
ta: தேதி சேர்க்கப்பட்டது

# filter.disc
source: disc
ta: வட்டு

# filter.duration
source: duration
ta: காலம்

# filter.favorited
source: favorited
ta: பிடித்தது

# filter.fromYear
source: from year
ta: ஆண்டு முதல்

# filter.id
source: id
ta: ஐடி

# filter.isCompilation
source: is compilation
ta: தொகுப்பு

# filter.isFavorited
source: is favorited
ta: பிடித்தது

# filter.isPublic
source: is public
ta: பொது

# filter.isRated
source: is rated
ta: மதிப்பிடப்படுகிறது

# filter.isRecentlyPlayed
source: is recently played
ta: அண்மைக் காலத்தில் விளையாடியது

# filter.lastPlayed
source: last played
ta: கடைசியாக விளையாடியது

# filter.mostPlayed
source: most played
ta: அதிகம் விளையாடியது

# filter.name
source: name
ta: பெயர்

# filter.note
source: note
ta: குறிப்பு

# filter.path
source: path
ta: பாதை

# filter.playCount
source: play count
ta: விளையாட்டு எண்ணிக்கை

# filter.random
source: random
ta: சீரற்ற

# filter.rating
source: rating
ta: செயல்வரம்பு

# filter.recentlyAdded
source: recently added
ta: அண்மைக் காலத்தில் சேர்க்கப்பட்டது

# filter.recentlyPlayed
source: recently played
ta: அண்மைக் காலத்தில் விளையாடியது

# filter.recentlyUpdated
source: recently updated
ta: அண்மைக் காலத்தில் புதுப்பிக்கப்பட்டது

# filter.releaseDate
source: release date
ta: வெளியீட்டு தேதி

# filter.releaseYear
source: release year
ta: வெளியீட்டு ஆண்டு

# filter.search
source: search
ta: தேடல்

# filter.songCount
source: song count
ta: பாடல் எண்ணிக்கை

# filter.sortName
source: sort name
ta: வரிசை பெயர்

# filter.title
source: title
ta: தலைப்பு

# filter.toYear
source: to year
ta: ஆண்டு

# filter.trackNumber
source: track
ta: மின்தடம்

# datetime.minuteShort
source: m
ta: மீ

# datetime.secondShort
source: s
ta: கள்

# datetime.hourShort
source: h
ta: ம

# datetime.dayShort
source: d
ta: டி

# filterOperator.after
source: is after
ta: பிறகு உள்ளது

# filterOperator.afterDate
source: is after (date)
ta: பிறகு (தேதி)

# filterOperator.before
source: is before
ta: முன்பு உள்ளது

# filterOperator.beforeDate
source: is before (date)
ta: முன் (தேதி)

# filterOperator.contains
source: contains
ta: கொண்டுள்ளது

# filterOperator.endsWith
source: ends with
ta: உடன் முடிகிறது

# filterOperator.inPlaylist
source: is in
ta: உள்ளது

# filterOperator.inTheLast
source: is in the last
ta: கடைசியில் உள்ளது

# filterOperator.inTheRange
source: is in the range
ta: வரம்பில் உள்ளது

# filterOperator.inTheRangeDate
source: is in the range (date)
ta: வரம்பில் உள்ளது (தேதி)

# filterOperator.is
source: is
ta: உள்ளது

# filterOperator.isNot
source: is not
ta: இல்லை

# filterOperator.isGreaterThan
source: is greater than
ta: விட அதிகமாக உள்ளது

# filterOperator.isLessThan
source: is less than
ta: விட குறைவாக உள்ளது

# filterOperator.matchesRegex
source: matches regex
ta: ரெசெக்சுடன் பொருந்துகிறது

# filterOperator.notContains
source: does not contain
ta: கொண்டிருக்கவில்லை

# filterOperator.notInPlaylist
source: is not in
ta: உள்ளே இல்லை

# filterOperator.notInTheLast
source: is not in the last
ta: கடைசியில் இல்லை

# filterOperator.startsWith
source: starts with
ta: உடன் தொடங்குகிறது

# form.addServer.error_savePassword
source: an error occurred when trying to save the password
ta: கடவுச்சொல்லை சேமிக்க முயற்சிக்கும்போது பிழை ஏற்பட்டது

# form.addServer.ignoreCors
source: ignore cors ($t(common.restartRequired))
ta: CORS ஐ புறக்கணிக்கவும் ($t(common.restartRequired))

# form.addServer.ignoreSsl
source: ignore ssl ($t(common.restartRequired))
ta: SSL ஐ புறக்கணிக்கவும் ($t(common.restartRequired))

# form.addServer.input_legacyAuthentication
source: enable legacy authentication
ta: மரபு அங்கீகாரத்தை இயக்கவும்

# form.addServer.input_name
source: server name
ta: சேவையக பெயர்

# form.addServer.input_password
source: password
ta: கடவுச்சொல்

# form.addServer.input_preferInstantMix
source: prefer instant mix
ta: உடனடி கலவையை விரும்புகிறது

# form.addServer.input_preferInstantMixDescription
source: only use instant mix to get similar songs. useful if you have plugins that modify this behavior
ta: ஒரே மாதிரியான பாடல்களைப் பெற உடனடி கலவையை மட்டுமே பயன்படுத்தவும். இந்த நடத்தையை மாற்றும் செருகுநிரல்கள் உங்களிடம் இருந்தால் பயனுள்ளதாக இருக்கும்

# form.addServer.input_preferRemoteUrl
source: prefer public url
ta: பொது முகவரி ஐ விரும்பு

# form.addServer.input_remoteUrl
source: public url
ta: பொது முகவரி

# form.addServer.input_remoteUrlPlaceholder
source: optional: public url for external features
ta: விருப்பத்தேர்வு: வெளிப்புற அம்சங்களுக்கான பொது முகவரி

# form.addServer.input_savePassword
source: save password
ta: கடவுச்சொல்லைச் சேமிக்கவும்

# form.addServer.input_url
source: url
ta: முகவரி

# form.addServer.input_username
source: username
ta: பயனர்பெயர்

# form.addServer.success
source: server added successfully
ta: சேவையகம் வெற்றிகரமாக சேர்க்கப்பட்டது

# form.addServer.title
source: add server
ta: சேவையகத்தைச் சேர்க்கவும்

# form.largeFetchConfirmation.title
source: add items to the queue
ta: பொருட்களை வரிசையில் சேர்க்கவும்

# form.largeFetchConfirmation.description
source: This action will add all items in the current filtered view
ta: இந்தச் செயல் தற்போதைய வடிகட்டப்பட்ட காட்சியில் உள்ள அனைத்து உருப்படிகளையும் சேர்க்கும்

# form.addToPlaylist.create
source: create $t(entity.playlist, {"count": 1}) {{playlist}}
ta: $t(entity.playlist, {"count": 1}) {{playlist}} உருவாக்கு

# form.addToPlaylist.input_skipDuplicates
source: skip duplicates
ta: நகல்களைத் தவிர்க்கவும்

# form.addToPlaylist.searchOrCreate
source: search $t(entity.playlist, {"count": 2}) or type to create a new one
ta: $t(entity.playlist, {"count": 2}) தேடவும் அல்லது புதிய ஒன்றை உருவாக்க தட்டச்சு செய்யவும்

# form.addToPlaylist.success
source: added $t(entity.trackWithCount, {"count": {{message}} }) to $t(entity.playlistWithCount, {"count": {{numOfPlaylists}} })
ta: $t(entity.trackWithCount, {"count": {{message}} }) இதற்கு $t(entity.playlistWithCount, {"count": {{numOfPlaylists}} }) சேர்க்கப்பட்டது

# form.addToPlaylist.title
source: add to $t(entity.playlist, {"count": 1})
ta: $t(entity.playlist, {"count": 1}) இல் சேர்

# form.createPlaylist.input_public
source: public
ta: பொது

# form.createPlaylist.success
source: $t(entity.playlist, {"count": 1}) created successfully
ta: $t(entity.playlist, {"count": 1}) வெற்றிகரமாக உருவாக்கப்பட்டது

# form.createPlaylist.title
source: create $t(entity.playlist, {"count": 1})
ta: $t(entity.playlist, {"count": 1}) ஐ உருவாக்கவும்

# form.createRadioStation.success
source: radio station created successfully
ta: வானொலி நிலையம் வெற்றிகரமாக உருவாக்கப்பட்டது

# form.createRadioStation.title
source: create radio station
ta: வானொலி நிலையத்தை உருவாக்குங்கள்

# form.createRadioStation.input_homepageUrl
source: homepage url
ta: முகப்பு முகவரி

# form.createRadioStation.input_name
source: name
ta: பெயர்

# form.createRadioStation.input_streamUrl
source: stream url
ta: ச்ட்ரீம் முகவரி

# form.deletePlaylist.input_confirm
source: type the name of the $t(entity.playlist, {"count": 1}) to confirm
ta: உறுதிப்படுத்த $t(entity.playlist, {"count": 1}) பெயரைத் தட்டச்சு செய்க

# form.deletePlaylist.success
source: $t(entity.playlist, {"count": 1}) deleted successfully
ta: $t(entity.playlist, {"count": 1}) வெற்றிகரமாக நீக்கப்பட்டது

# form.deletePlaylist.title
source: delete $t(entity.playlist, {"count": 1})
ta: $t(entity.playlist, {"count": 1})ஐ நீக்கு

# form.editPlaylist.publicJellyfinNote
source: Jellyfin for some reason does not expose whether a playlist is public or not. If you wish for this to remain public, please have the following input selected
ta: சில காரணங்களால் செல்லிஃபின் ஒரு பிளேலிச்ட் பொதுவில் இல்லையா என்பதை அம்பலப்படுத்தவில்லை. இது பொதுவில் இருக்க விரும்பினால், தயவுசெய்து பின்வரும் உள்ளீட்டைத் தேர்ந்தெடுக்கவும்

# form.editPlaylist.editNote
source: manual edits are not recommended for large playlists. are you sure you accept the risk of data loss incurred by overwriting the existing playlist?
ta: பெரிய பிளேலிச்ட்களுக்கு கைமுறை திருத்தங்கள் பரிந்துரைக்கப்படவில்லை. ஏற்கனவே உள்ள பிளேலிச்ட்டை மேலெழுதுவதால் ஏற்படும் தரவு இழப்பின் அபாயத்தை நிச்சயமாக ஏற்றுக்கொள்கிறீர்களா?

# form.editPlaylist.success
source: $t(entity.playlist, {"count": 1}) updated successfully
ta: $t(entity.playlist, {"count": 1}) வெற்றிகரமாகப் புதுப்பிக்கப்பட்டது
