Repository: 247i/TACETr
Catalog: உரை/தானி/feishin-translation-*.po
Languages: ta

# setting.imageResolution_optionItemCard
source: item card
ta: பொருள் அட்டை

# setting.imageResolution_optionSidebar
source: sidebar
ta: பக்கப்பட்டி

# setting.imageResolution_optionHeader
source: header
ta: தலைப்பி

# setting.imageResolution_optionFullScreenPlayer
source: fullscreen player
ta: முழுத்திரை பிளேயர்

# setting.playerbarOpenDrawer_description
source: allows clicking of the playerbar to open the full screen player
ta: முழு திரை பிளேயரைத் திறக்க பிளேயர்பாரைக் சொடுக்கு செய்ய அனுமதிக்கிறது

# setting.playerbarOpenDrawer
source: playerbar fullscreen toggle
ta: பிளேயர்பார் முழுத்திரை மாற்று

# setting.playerbarSlider
source: playerbar slider
ta: பிளேயர்பார் ச்லைடர்

# setting.playerbarSlider_description
source: the waveform is not recommended if on a slow or metered internet connection
ta: மெதுவான அல்லது மீட்டர் இணைய இணைப்பில் இருந்தால் அலைவடிவம் பரிந்துரைக்கப்படுவதில்லை

# setting.playerbarSliderType_optionSlider
source: slider
ta: ச்லைடர்

# setting.playerbarSliderType_optionWaveform
source: waveform
ta: அலைவடிவம், அலைப்படம்

# setting.playerbarWaveformAlign
source: waveform align
ta: அலை வடிவ சீரமைப்பு

# setting.playerbarWaveformAlign_optionTop
source: top
ta: மேலே

# setting.playerbarWaveformAlign_optionCenter
source: center
ta: நடுவண்

# setting.playerbarWaveformAlign_optionBottom
source: bottom
ta: கீழே

# setting.playerbarWaveformBarWidth
source: waveform bar width
ta: அலைவடிவ பட்டை அகலம்

# setting.playerbarWaveformGap
source: waveform gap
ta: அலைவடிவ இடைவெளி

# setting.playerbarWaveformRadius
source: waveform radius
ta: அலைவடிவ ஆரம்

# setting.preferLocalLyrics_description
source: prefer local lyrics over remote lyrics when available
ta: கிடைக்கும்போது தொலைநிலை பாடல்களை விட உள்ளக பாடல்களை விரும்புங்கள்

# setting.preferLocalLyrics
source: prefer local lyrics
ta: உள்ளக பாடல்களை விரும்புங்கள்

# setting.showLyricsInSidebar_description
source: a panel will be added to the attached play queue that displays the lyrics
ta: பாடல் வரிகளைக் காண்பிக்கும் இணைக்கப்பட்ட நாடக வரிசையில் ஒரு குழு சேர்க்கப்படும்

# setting.showLyricsInSidebar
source: show lyrics in player sidebar
ta: பிளேயர் பக்கப்பட்டியில் பாடல் வரிகளைக் காட்டு

# setting.showRatings_description
source: controls if the star ratings feature shows up in the interface
ta: நட்சத்திர மதிப்பீடு நற்பொருத்தம் இடைமுகத்தில் காட்டப்பட்டால் கட்டுப்படுத்துகிறது

# setting.showRatings
source: show star ratings
ta: நட்சத்திர மதிப்பீடுகளைக் காட்டு

# setting.blurExplicitImages
source: blur explicit images
ta: வெளிப்படையான படங்களை மங்கலாக்கும்

# setting.blurExplicitImages_description
source: album and song artwork tagged as explicit will be blurred
ta: வெளிப்படையாகக் குறியிடப்பட்ட ஆல்பம் மற்றும் பாடல் கலைப்படைப்புகள் மங்கலாக்கப்படும்

# setting.enableGridMultiSelect
source: enable grid multi-select
ta: கட்டம் பல தேர்வை இயக்கவும்

# setting.enableGridMultiSelect_description
source: when enabled, allows selecting multiple items in grid views. when disabled, clicking grid item images will navigate to the item page
ta: இயக்கப்பட்டால், கட்டக் காட்சிகளில் பல உருப்படிகளைத் தேர்ந்தெடுக்க அனுமதிக்கிறது. முடக்கப்பட்டிருக்கும் போது, ​​கிரிட் உருப்படி படங்களைக் சொடுக்கு செய்வதன் மூலம் உருப்படி பக்கத்திற்குச் செல்லும்

# setting.showVisualizerInSidebar_description
source: a panel will be added to the player sidebar that displays the visualizer
ta: விசுவலைசரைக் காட்டும் பிளேயர் பக்கப்பட்டியில் ஒரு பேனல் சேர்க்கப்படும்

# setting.showVisualizerInSidebar
source: show visualizer in player sidebar
ta: பிளேயர் பக்கப்பட்டியில் காட்சிப்படுத்தலைக் காட்டு

# setting.combinedLyricsAndVisualizer_description
source: combine lyrics and visualizer into the same panel
ta: பாடல் வரிகளையும் காட்சிப்படுத்தலையும் ஒரே பேனலில் இணைக்கவும்

# setting.combinedLyricsAndVisualizer
source: combine lyrics and visualizer in player sidebar
ta: பிளேயர் பக்கப்பட்டியில் பாடல் வரிகள் மற்றும் காட்சிப்படுத்தல் ஆகியவற்றை இணைக்கவும்

# setting.preservePitch_description
source: preserves pitch when modifying playback speed
ta: பின்னணி வேகத்தை மாற்றும்போது சுருதியைப் பாதுகாக்கிறது

# setting.preservePitch
source: preserve pitch
ta: சுருதியைப் பாதுகாக்கவும்

# setting.audioFadeOnStatusChange
source: audio fade on status change
ta: நிலை மாறும்போது ஆடியோ மங்குகிறது

# setting.audioFadeOnStatusChange_description
source: enables fade out and fade in when play/pause status changes
ta: ப்ளே/இடைநிறுத்தம் நிலை மாறும்போது ஃபேட் அவுட் மற்றும் ஃபேட் இன் செயல்படுத்துகிறது

# setting.preventSleepOnPlayback_description
source: prevent the display from sleeping while music is playing
ta: இசை இயங்கும் போது காட்சி தூங்குவதைத் தடுக்கிறது

# setting.preventSleepOnPlayback
source: prevent sleep on playback
ta: பிளேபேக்கில் தூக்கத்தைத் தடுக்கவும்

# setting.remotePassword_description
source: sets the password for the remote control server. These credentials are by default transferred insecurely, so you should use a unique password that you do not care about
ta: ரிமோட் கண்ட்ரோல் சேவையகத்திற்கான கடவுச்சொல்லை அமைக்கிறது. இந்த நற்சான்றிதழ்கள் இயல்பாகவே பாதுகாப்பற்ற முறையில் மாற்றப்படுகின்றன, எனவே நீங்கள் கவலைப்படாத தனிப்பட்ட கடவுச்சொல்லைப் பயன்படுத்த வேண்டும்

# setting.remotePassword
source: remote control server password
ta: ரிமோட் கண்ட்ரோல் சர்வர் கடவுச்சொல்

# setting.remotePort_description
source: sets the port for the remote control server
ta: ரிமோட் கண்ட்ரோல் சேவையகத்திற்கான துறைமுகத்தை அமைக்கிறது

# setting.remotePort
source: remote control server port
ta: ரிமோட் கண்ட்ரோல் சர்வர் துறைமுகம்

# setting.remoteUsername_description
source: sets the username for the remote control server. if both username and password are empty, authentication will be disabled
ta: ரிமோட் கண்ட்ரோல் சேவையகத்திற்கான பயனர்பெயரை அமைக்கிறது. பயனர்பெயர் மற்றும் கடவுச்சொல் இரண்டும் காலியாக இருந்தால், ஏற்பு முடக்கப்படும்

# setting.remoteUsername
source: remote control server username
ta: ரிமோட் கண்ட்ரோல் சர்வர் பயனர்பெயர்

# setting.replayGainClipping_description
source: Prevent clipping caused by {{ReplayGain}} by automatically lowering the gain
ta: ஆதாயத்தைத் தானாகவே குறைப்பதன் மூலம் {{ReplayGain}} காரணமாக ஏற்படும் கிளிப்பிங்கைத் தடுக்கவும்

# setting.replayGainClipping
source: {{ReplayGain}} clipping
ta: {{ReplayGain}} கிளிப்பிங்

# setting.replayGainFallback_description
source: gain in db to apply if the file has no {{ReplayGain}} tags
ta: கோப்பில் {{ReplayGain}} குறிச்சொற்கள் இல்லையென்றால் விண்ணப்பிக்க DB இல் ஆதாயம்

# setting.replayGainFallback
source: {{ReplayGain}} fallback
ta: {{ReplayGain}} பின்னடைவு

# setting.replayGainMode_description
source: adjust volume gain according to {{ReplayGain}} values stored in the file metadata
ta: {{ReplayGain}}} மதிப்புகளின் படி தொகுதி ஆதாயத்தை சரிசெய்யவும் மேனிலை தரவு கோப்பு

# setting.replayGainMode
source: {{ReplayGain}} mode
ta: {{ReplayGain}} பயன்முறை

# setting.replayGainPreamp_description
source: adjust the preamp gain applied to the {{ReplayGain}} values
ta: {{ReplayGain}}} மதிப்புகளுக்கு பயன்படுத்தப்படும் Preamp ஆதாயத்தை சரிசெய்யவும்

# setting.sampleRate_description
source: select the output sample rate to be used if the sample frequency selected is different from that of the current media. a value less than 8000 will use the default frequency
ta: தேர்ந்தெடுக்கப்பட்ட மாதிரி அதிர்வெண் தற்போதைய மீடியாவிலிருந்து வேறுபட்டால் பயன்படுத்த வேண்டிய வெளியீட்டு மாதிரி வீதத்தைத் தேர்ந்தெடுக்கவும். 8000 க்கும் குறைவான மதிப்பு இயல்புநிலை அதிர்வெண்ணைப் பயன்படுத்தும்

# setting.sampleRate
source: sample rate
ta: மாதிரி வீதம்

# setting.savePlayQueue_description
source: save the play queue when the application is closed and restore it when the application is opened
ta: பயன்பாடு மூடப்படும் போது ப்ளே வரிசையை சேமித்து, பயன்பாடு திறக்கப்படும் போது அதை மீட்டெடுக்கவும்

# setting.savePlayQueue
source: save play queue
ta: விளையாட்டு வரிசையை சேமிக்கவும்

# setting.scrobble_description
source: scrobble plays to your media server
ta: உங்கள் மீடியா சேவையகத்திற்கு ச்க்ரோபில் விளையாடுகிறது

# setting.scrobble
source: scrobble
ta: ச்க்ரோபில்

# setting.showSkipButton_description
source: show or hide the skip buttons on the player bar
ta: பிளேயர் பட்டியில் ச்கிப் பொத்தான்களைக் காட்டவும் அல்லது மறைக்கவும்

# setting.showSkipButton
source: show skip buttons
ta: ச்கிப் பொத்தான்களைக் காட்டு

# setting.showSkipButtons_description
source: show or hide the skip buttons on the player bar
ta: பிளேயர் பட்டியில் ச்கிப் பொத்தான்களைக் காட்டவும் அல்லது மறைக்கவும்

# setting.showSkipButtons
source: show skip buttons
ta: ச்கிப் பொத்தான்களைக் காட்டு

# setting.sidebarCollapsedNavigation_description
source: show or hide the navigation in the collapsed sidebar
ta: சரிந்த பக்கப்பட்டியில் வழிசெலுத்தலைக் காட்டவும் அல்லது மறைக்கவும்

# setting.sidebarCollapsedNavigation
source: sidebar (collapsed) navigation
ta: பக்கப்பட்டி (சரிந்த) வழிசெலுத்தல்

# setting.sidebarConfiguration_description
source: select the items and order in which they appear in the sidebar
ta: பக்கப்பட்டியில் தோன்றும் உருப்படிகள் மற்றும் வரிசையைத் தேர்ந்தெடுக்கவும்

# setting.sidebarConfiguration
source: sidebar configuration
ta: பக்கப்பட்டி உள்ளமைவு

# setting.sidebarPlaylistList_description
source: show or hide the playlist list in the sidebar
ta: பக்கப்பட்டியில் பிளேலிச்ட் பட்டியலைக் காட்டவும் அல்லது மறைக்கவும்

# setting.sidebarPlaylistList
source: sidebar playlist list
ta: பக்கப்பட்டி பிளேலிச்ட் பட்டியல்

# setting.sidebarPlaylistSorting_description
source: allows manual playlist sorting in the sidebar using drag and drop instead of the default server order
ta: இயல்புநிலை சர்வர் ஆர்டருக்குப் பதிலாக இழுத்து விடுவதைப் பயன்படுத்தி பக்கப்பட்டியில் கைமுறையாக பிளேலிச்ட்டை வரிசைப்படுத்த அனுமதிக்கிறது

# setting.sidebarPlaylistSorting
source: sidebar playlist sorting
ta: பக்கப்பட்டி பிளேலிச்ட் வரிசையாக்கம்

# setting.sidebarPlaylistListFilterRegex_description
source: hide playlists in the sidebar that match this regular expression
ta: இந்த வழக்கமான வெளிப்பாட்டுடன் பொருந்தக்கூடிய பிளேலிச்ட்களை பக்கப்பட்டியில் மறைக்கவும்

# setting.sidebarPlaylistListFilterRegex_placeholder
source: e.g. ^Daily Mix.*
ta: எ.கா. ^தினசரி கலவை.*

# setting.sidebarPlaylistListFilterRegex
source: playlist filter regex
ta: பிளேலிச்ட் வடிகட்டி வழக்கவெளி

# setting.sidePlayQueueStyle_description
source: sets the style of the side play queue
ta: பக்க நாடக வரிசையின் பாணியை அமைக்கிறது

# setting.sidePlayQueueStyle_optionAttached
source: attached
ta: இணைக்கப்பட்டுள்ளது

# setting.sidePlayQueueStyle_optionDetached
source: detached
ta: பிரிக்கப்பட்டது

# setting.mediaSession_description
source: enables Media Session integration, displaying media controls and metadata in the system volume overlay and lock screen
ta: மீடியா அமர்வு ஒருங்கிணைப்பை செயல்படுத்துகிறது, மீடியா கட்டுப்பாடுகள் மற்றும் மெட்டாடேட்டாவை கணினி தொகுதி மேலடுக்கு மற்றும் பூட்டுத் திரையில் காண்பிக்கும்

# setting.mediaSession
source: enable media session
ta: ஊடக அமர்வை இயக்கவும்

# setting.sidePlayQueueStyle
source: side play queue style
ta: சைட் பிளே வரிசை பாணி

# setting.skipDuration_description
source: sets the duration to skip when using the skip buttons on the player bar
ta: பிளேயர் பட்டியில் தவிர் பொத்தான்களைப் பயன்படுத்தும் போது தவிர்க்க வேண்டிய காலத்தை அமைக்கிறது

# setting.skipDuration
source: skip duration
ta: கால அளவைத் தவிர்க்கவும்

# setting.skipPlaylistPage_description
source: when navigating to a playlist, go to the playlist song list page instead of the default page
ta: பிளேலிச்ட்டுக்கு செல்லும்போது, இயல்புநிலை பக்கத்திற்கு பதிலாக பிளேலிச்ட் பாடல் பட்டியல் பக்கத்திற்குச் செல்லவும்

# setting.skipPlaylistPage
source: skip playlist page
ta: பிளேலிச்ட் பக்கத்தைத் தவிர்க்கவும்

# setting.startMinimized_description
source: start the application in system tray
ta: கணினி தட்டில் பயன்பாட்டைத் தொடங்கவும்

# setting.startMinimized
source: start minimized
ta: குறைக்கத் தொடங்குங்கள்

# setting.theme_description
source: sets the theme to use for the application
ta: பயன்பாட்டிற்கு பயன்படுத்த கருப்பொருள் அமைக்கிறது

# setting.theme
source: theme
ta: கருப்பொருள்

# setting.themeDark_description
source: sets the dark theme to use for the application
ta: பயன்பாட்டிற்கு பயன்படுத்த இருண்ட கருப்பொருள் அமைக்கிறது

# setting.themeDark
source: theme (dark)
ta: கருப்பொருள் (இருண்ட)

# setting.themeLight_description
source: sets the light theme to use for the application
ta: பயன்பாட்டிற்கு பயன்படுத்த ஒளி கருப்பொருள் அமைக்கிறது

# setting.themeLight
source: theme (light)
ta: கருப்பொருள் (ஒளி)

# setting.transcode
source: enable transcoding
ta: டிரான்ச்கோடிங்கை இயக்கவும்

# setting.transcode_description
source: enables transcoding to different formats
ta: வெவ்வேறு வடிவங்களுக்கு மாற்றுவதை செயல்படுத்துகிறது

# setting.transcodeBitrate_description
source: selects the bitrate to transcode. 0 means let the server pick
ta: டிரான்ச்கோடிற்கு பிட்ரேட்டைத் தேர்ந்தெடுக்கிறது. 0 என்றால் சேவையகம் எடுக்கட்டும்

# setting.transcodeBitrate
source: bitrate to transcode
ta: டிரான்ச்கோடிற்கு பிட்ரேட்

# setting.transcodeFormat_description
source: selects the format to transcode. leave empty to let the server decide
ta: டிரான்ச்கோடிற்கு வடிவமைப்பைத் தேர்ந்தெடுக்கிறது. சேவையகம் தீர்மானிக்க காலியாக விடவும்

# setting.transcodeFormat
source: format to transcode
ta: டிரான்ச்கோடுக்கு வடிவம்

# setting.translationApiKey_description
source: api key for translation (global service endpoint only)
ta: மொழிபெயர்ப்பிற்கான பநிஇ விசை (உலகளாவிய பணி இறுதிப்புள்ளியை மட்டும் ஆதரிக்கவும்)

# setting.translationApiKey
source: translation api key
ta: மொழிபெயர்ப்பு பநிஇ விசை

# setting.translationApiProvider_description
source: api provider for translation
ta: மொழிபெயர்ப்புக்கான பநிஇ வழங்குநர்

# setting.translationApiProvider
source: translation api provider
ta: மொழிபெயர்ப்பு பநிஇ வழங்குநர்

# setting.translationTargetLanguage_description
source: target language for translation
ta: மொழிபெயர்ப்பிற்கான இலக்கு மொழி

# setting.translationTargetLanguage
source: translation target language
ta: மொழிபெயர்ப்பு இலக்கு மொழி

# setting.trayEnabled_description
source: show/hide tray icon/menu. if disabled, also disables minimize/exit to tray
ta: தட்டு ஐகான்/மெனுவைக் காட்டவும்/மறைக்கவும். முடக்கப்பட்டால், தட்டில் குறைக்க/வெளியேறவும் முடக்குகிறது

# setting.trayEnabled
source: show tray
ta: தட்டில் காட்டு

# setting.useSystemTheme_description
source: follow the system-defined light or dark preference
ta: கணினி வரையறுக்கப்பட்ட ஒளி அல்லது இருண்ட விருப்பத்தைப் பின்பற்றவும்

# setting.useSystemTheme
source: use system theme
ta: கணினி கருப்பொருளைப் பயன்படுத்தவும்

# setting.volumeWheelStep_description
source: the amount of volume to change when scrolling the mouse wheel on the volume slider
ta: தொகுதி ச்லைடரில் சுட்டி சக்கரத்தை ச்க்ரோலிங் செய்யும் போது மாற்ற வேண்டிய அளவின் அளவு

# setting.volumeWheelStep
source: volume wheel step
ta: தொகுதி சக்கர படி

# setting.volumeWidth_description
source: the width of the volume slider
ta: தொகுதி ச்லைடரின் அகலம்

# setting.volumeWidth
source: volume slider width
ta: தொகுதி ச்லைடர் அகலம்

# setting.webAudio_description
source: use web audio. this enables advanced features like replaygain. disable if you experience otherwise
ta: வலை ஆடியோவைப் பயன்படுத்தவும். இது ரீப்ளே கெய்ன் போன்ற மேம்பட்ட அம்சங்களை செயல்படுத்துகிறது. நீங்கள் வேறுவிதமாக அனுபவித்தால் முடக்கு

# setting.webAudio
source: use web audio
ta: வலை ஆடியோவைப் பயன்படுத்தவும்

# setting.windowBarStyle_description
source: select the style of the window bar
ta: சாளர பட்டியின் பாணியைத் தேர்ந்தெடுக்கவும்

# setting.windowBarStyle
source: window bar style
ta: சாளரம் பார் பாணி

# setting.zoom_description
source: sets the zoom percentage for the application
ta: பயன்பாட்டிற்கான சூம் சதவீதத்தை அமைக்கிறது

# setting.zoom
source: zoom percentage
ta: சூம் விழுக்காடு

# setting.queryBuilder
source: query builder
ta: வினவல் கட்டுபவர்

# setting.queryBuilderCustomFields_inputLabel
source: label
ta: சிட்டை

# setting.queryBuilderCustomFields_inputTag
source: tag
ta: குறிச்சொல்

# setting.queryBuilderCustomFields
source: custom fields
ta: விருப்ப புலங்கள்

# setting.queryBuilderCustomFields_description
source: add custom fields to use in query builders
ta: வினவல் பில்டர்களில் பயன்படுத்த தனிப்பயன் புலங்களைச் சேர்க்கவும்

# table.column.album
source: album
ta: ஆல்பம்

# table.column.albumArtist
source: album artist
ta: ஆல்பம் கலைஞர்

# table.column.biography
source: biography
ta: சுயசரிதை

# table.column.bitrate
source: bitrate
ta: பிட்ரேட்

# table.column.bpm
source: bpm
ta: பிபிஎம்

# table.column.comment
source: comment
ta: கருத்து

# table.column.dateAdded
source: date added
ta: தேதி சேர்க்கப்பட்டது

# table.column.discNumber
source: disc
ta: வட்டு

# table.column.favorite
source: favorite
ta: பிடித்த

# table.column.lastPlayed
source: last played
ta: கடைசியாக விளையாடியது

# table.column.path
source: path
ta: பாதை

# table.column.playCount
source: plays
ta: நாடகங்கள்

# table.column.rating
source: rating
ta: செயல்வரம்பு

# table.column.releaseDate
source: release date
ta: வெளியீட்டு தேதி

# table.column.releaseYear
source: year
ta: ஆண்டு

# table.column.title
source: title
ta: தலைப்பு

# table.column.trackNumber
source: track
ta: மின்தடம்

# table.column.owner
source: owner
ta: உரிமையாளர்

# table.config.general.advancedSettings
source: advanced settings
ta: மேம்பட்ட அமைப்புகள்

# table.config.general.autoFitColumns
source: auto fit columns
ta: ஆட்டோ பொருத்தம் நெடுவரிசைகள்

# table.config.general.autosize
source: autosize
ta: தானியங்கு அளவு

# table.config.general.moveUp
source: move up
ta: மேலே செல்ல

# table.config.general.moveDown
source: move down
ta: கீழே நகர

# table.config.general.pinToLeft
source: pin to left
ta: இடப்புறம் முள்

# table.config.general.pinToRight
source: pin to right
ta: வலதுபுறமாக முள்

# table.config.general.alignLeft
source: align left
ta: இடதுபுறம் சீரமைக்கவும்

# table.config.general.alignCenter
source: align center
ta: மையத்தை சீரமைக்கவும்

# table.config.general.alignRight
source: align right
ta: வலது சீரமை

# table.config.general.followCurrentSong
source: follow current song
ta: தற்போதைய பாடலைப் பின்தொடரவும்

# table.config.general.displayType
source: display type
ta: காட்சி வகை

# table.config.general.itemGap
source: item gap (px)
ta: உருப்படி இடைவெளி (பிஎக்ச்)

# table.config.general.itemSize
source: item size (px)
ta: உருப்படி அளவு (பிஎக்ச்)

# table.config.general.itemsPerRow
source: items per row
ta: ஒரு வரிசைக்கு பொருட்கள்

# table.config.general.size_default
source: default
ta: இயல்புநிலை

# table.config.general.size_compact
source: compact
ta: கச்சிதமான

# table.config.general.size_large
source: large
ta: பெரிய

# table.config.general.tableColumns
source: table columns
ta: அட்டவணை நெடுவரிசைகள்

# table.config.general.pagination
source: pagination
ta: பேசினேசன்

# table.config.general.pagination_itemsPerPage
source: items per page
ta: ஒரு பக்கத்திற்கு உருப்படிகள்

# table.config.general.pagination_infinite
source: infinite
ta: கந்தழி, முடிவிலி

# table.config.general.pagination_paginate
source: paginated
ta: பக்கமாக

# table.config.general.alternateRowColors
source: alternate row colors
ta: மாற்று வரிசை வண்ணங்கள்

# table.config.general.horizontalBorders
source: row borders
ta: வரிசை எல்லைகள்

# table.config.general.rowHoverHighlight
source: row hover highlight
ta: வரிசை மிதவை ஐலைட்

# table.config.general.showHeader
source: show header
ta: தலைப்பு நிகழ்ச்சி

# table.config.general.verticalBorders
source: column borders
ta: நெடுவரிசை எல்லைகள்

# table.config.label.albumGroup
source: album group
ta: ஆல்பம் குழு

# table.config.label.composer
source: composer
ta: இசையமைப்பாளர்

# table.config.label.dateAdded
source: date added
ta: தேதி சேர்க்கப்பட்டது

# table.config.label.discNumber
source: disc number
ta: வட்டு எண்

# table.config.label.favorite
source: $t(common.favorite)
ta: $t(common.favourite)

# table.config.label.genreBadge
source: $t(entity.genre, {"count": 1}) (badges)
ta: $t(entity.genre, {"count": 1}) (பேட்ச்கள்)

# table.config.label.image
source: image
ta: படம்

# table.config.label.lastPlayed
source: last played
ta: கடைசியாக விளையாடியது

# table.config.label.playCount
source: play count
ta: விளையாட்டு எண்ணிக்கை

# table.config.label.releaseDate
source: release date
ta: வெளியீட்டு தேதி

# table.config.label.rowIndex
source: row index
ta: வரிசை அட்டவணை

# table.config.label.titleArtist
source: $t(common.title) (artist)
ta: $t(common.title) (கலைஞர்)

# table.config.label.titleCombined
source: $t(common.title) (combined)
ta: $t(common.title) (இணைந்தது)

# table.config.label.trackNumber
source: track number
ta: ட்ராக் எண்

# table.config.view.detail
source: detail
ta: விவரம்

# table.config.view.grid
source: grid
ta: வலைவாய்

# table.config.view.list
source: list
ta: பட்டியல்

# table.config.view.table
source: table
ta: அட்டவணை

# dragDropZone.error_oneFileOnly
source: Please only select 1 file
ta: 1 கோப்பை மட்டும் தேர்ந்தெடுக்கவும்

# dragDropZone.error_readingFile
source: there has been an issue reading the file: {{errorMessage}}
ta: கோப்பைப் படிப்பதில் சிக்கல் உள்ளது: {{errorMessage}}

# dragDropZone.mainText
source: drop a file here
ta: ஒரு கோப்பை இங்கே விடுங்கள்

# visualizer.visualizerType
source: Visualizer Type
ta: விசுவலைசர் வகை

# visualizer.cyclePresets
source: Cycle Presets
ta: சுழற்சி முன்னமைவுகள்

# visualizer.cycleTime
source: Cycle Time (seconds)
ta: சுழற்சி நேரம் (வினாடிகள்)

# visualizer.includeAllPresets
source: Include All Presets
ta: அனைத்து முன்னமைவுகளையும் சேர்க்கவும்

# visualizer.ignoredPresets
source: Ignored Presets
ta: புறக்கணிக்கப்பட்ட முன்னமைவுகள்

# visualizer.selectedPresets
source: Selected Presets
ta: தேர்ந்தெடுக்கப்பட்ட முன்னமைவுகள்

# visualizer.randomizeNextPreset
source: Randomize Next Preset
ta: அடுத்த முன்னமைவை சீரமைக்கவும்

# visualizer.blendTime
source: Blend Time
ta: கலப்பு நேரம்

# visualizer.presets
source: Presets
ta: முன்னமைவுகள்

# visualizer.selectPreset
source: Select Preset
ta: முன்னமைவைத் தேர்ந்தெடுக்கவும்

# visualizer.applyPreset
source: Apply Preset
ta: முன்னமைவைப் பயன்படுத்தவும்

# visualizer.saveAsPreset
source: Save as Preset
ta: முன்னமைவாக சேமிக்கவும்

# visualizer.updatePreset
source: Update Preset
ta: முன்னமைவைப் புதுப்பிக்கவும்

# visualizer.copyConfiguration
source: Copy Configuration
ta: நகல் கட்டமைப்பு

# visualizer.pasteConfiguration
source: Paste Configuration
ta: ஒட்டு கட்டமைப்பு

# visualizer.pasteConfigurationPlaceholder
source: Paste JSON configuration here...
ta: சாதொபொகு உள்ளமைவை இங்கே ஒட்டவும்...

# visualizer.pasteFromClipboard
source: Paste from Clipboard
ta: கிளிப்போர்டில் இருந்து ஒட்டவும்

# visualizer.applyConfiguration
source: Apply Configuration
ta: உள்ளமைவைப் பயன்படுத்து

# visualizer.configCopied
source: Configuration copied to clipboard
ta: உள்ளமைவு இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது

# visualizer.configCopyFailed
source: Failed to copy configuration
ta: உள்ளமைவை நகலெடுக்க முடியவில்லை

# visualizer.configPasted
source: Configuration applied successfully
ta: உள்ளமைவு வெற்றிகரமாக பயன்படுத்தப்பட்டது

# visualizer.configPasteFailed
source: Failed to apply configuration. Please check the format.
ta: உள்ளமைவைப் பயன்படுத்துவதில் தோல்வி. தயவுசெய்து வடிவமைப்பைச் சரிபார்க்கவும்.

# visualizer.configPasteReadFailed
source: Failed to read from clipboard
ta: கிளிப்போர்டில் இருந்து படிக்க முடியவில்லை

# visualizer.presetName
source: Preset Name
ta: முன்னமைக்கப்பட்ட பெயர்

# visualizer.presetNamePlaceholder
source: Enter preset name
ta: முன்னமைக்கப்பட்ட பெயரை உள்ளிடவும்

# visualizer.general
source: General
ta: பொது

# visualizer.mode
source: Mode
ta: பயன்முறை

# visualizer.mode1To8
source: Mode 1 - 8
ta: முறை 1 - 8

# visualizer.mode10
source: Mode 10
ta: முறை 10

# visualizer.barSpace
source: Bar Space
ta: பார் இடம்

# visualizer.lineWidth
source: Line Width
ta: வரி அகலம்

# visualizer.fillAlpha
source: Fill Alpha
ta: ஆல்ஃபாவை நிரப்பவும்

# visualizer.channelLayout
source: Channel Layout
ta: சேனல் தளவமைப்பு

# visualizer.maxFPS
source: Max FPS
ta: அதிகபட்ச FPS

# visualizer.opacity
source: Opacity
ta: ஒளிபுகாநிலை
