Repository: 247i/TACETr
Catalog: உரை/தானி/feishin-translation-*.po
Languages: ta

# form.editPlaylist.title
source: edit $t(entity.playlist, {"count": 1})
ta: திருத்து $t(entity.playlist, {"count": 1})

# form.lyricsExport.export
source: export lyrics
ta: ஏற்றுமதி பாடல் வரிகள்

# form.lyricsExport.input_synced
source: export synced lyrics
ta: ஒத்திசைக்கப்பட்ட பாடல் வரிகளை ஏற்றுமதி செய்யவும்

# form.lyricSearch.title
source: lyric search
ta: பாடல் தேடல்

# form.queryEditor.title
source: query editor
ta: வினவல் ஆசிரியர்

# form.queryEditor.input_optionMatchAll
source: match all
ta: அனைத்தையும் பொருத்துங்கள்

# form.queryEditor.input_optionMatchAny
source: match any
ta: எந்த பொருத்தவும்

# form.queryEditor.addRuleGroup
source: add rule group
ta: விதி குழுவைச் சேர்க்கவும்

# form.queryEditor.removeRuleGroup
source: remove rule group
ta: விதி குழுவை அகற்று

# form.queryEditor.resetToDefault
source: reset to default
ta: இயல்புநிலைக்கு மீட்டமைக்கவும்

# form.queryEditor.clearFilters
source: clear filters
ta: தெளிவான வடிகட்டிகள்

# form.saveQueue.success
source: saved play queue to server
ta: சேவையகத்தில் விளையாடும் வரிசை சேமிக்கப்பட்டது

# form.shareItem.allowDownloading
source: allow downloading
ta: பதிவிறக்க அனுமதிக்கவும்

# form.shareItem.copyToClipboard
source: Copy to clipboard: Ctrl+C, Enter
ta: இடைநிலைப்பலகைக்கு நகலெடு: Ctrl+C, உள்ளிடவும்

# form.shareItem.description
source: description
ta: விவரம்

# form.shareItem.setExpiration
source: set expiration
ta: காலாவதியை அமைக்கவும்

# form.shareItem.success
source: share link copied to clipboard (or click here to open)
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்ட இணைப்பைப் பகிரவும் (அல்லது திறக்க இங்கே சொடுக்கு செய்க)

# form.shareItem.successMustClick
source: share created successfully. click here to open
ta: பகிர்வு வெற்றிகரமாக உருவாக்கப்பட்டது. திறக்க இங்கே சொடுக்கு செய்யவும்

# form.shareItem.expireInvalid
source: expiration must be in the future
ta: காலாவதி எதிர்காலத்தில் இருக்க வேண்டும்

# form.shareItem.createFailed
source: failed to create share (is sharing enabled?)
ta: பங்கை உருவாக்கத் தவறிவிட்டது (பகிர்வு இயக்கப்பட்டதா?)

# form.shuffleAll.title
source: play random
ta: சீரற்ற விளையாட

# form.shuffleAll.input_limit
source: how many songs?
ta: எத்தனை பாடல்கள்?

# form.shuffleAll.input_minYear
source: from year
ta: ஆண்டு முதல்

# form.shuffleAll.input_maxYear
source: to year
ta: ஆண்டுக்கு

# form.shuffleAll.input_played
source: play filter
ta: விளையாடு வடிகட்டி

# form.shuffleAll.input_played_optionAll
source: all tracks
ta: அனைத்து தடங்கள்

# form.shuffleAll.input_played_optionUnplayed
source: only unplayed tracks
ta: இயக்கப்படாத தடங்கள் மட்டுமே

# form.shuffleAll.input_played_optionPlayed
source: only played tracks
ta: டிராக்குகளை மட்டுமே இயக்கியது

# form.updateServer.success
source: server updated successfully
ta: சேவையகம் வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# form.updateServer.title
source: update server
ta: புதுப்பிப்பு சேவையகம்

# form.privateMode.enabled
source: private mode enabled, playback status is now hidden from external integrations
ta: தனிப்பட்ட பயன்முறை இயக்கப்பட்டது, பின்னணி நிலை இப்போது வெளிப்புற ஒருங்கிணைப்புகளிலிருந்து மறைக்கப்பட்டுள்ளது

# form.privateMode.disabled
source: private mode disabled, playback status is now visible to enabled external integrations
ta: தனிப்பட்ட பயன்முறை முடக்கப்பட்டுள்ளது, இயக்கப்பட்ட வெளிப்புற ஒருங்கிணைப்புகளுக்கு இப்போது பின்னணி நிலை தெரியும்

# form.privateMode.title
source: private mode
ta: தனிப்பட்ட முறை

# page.albumArtistDetail.about
source: About {{artist}}
ta: {{artist}} பற்றி

# page.albumArtistDetail.appearsOn
source: appears on
ta: தோன்றும்

# page.albumArtistDetail.favoriteSongs
source: favorite songs
ta: பிடித்த பாடல்கள்

# page.albumArtistDetail.groupingTypeAll
source: all release types
ta: அனைத்து வகையான வெளியீடுகள்

# page.albumArtistDetail.groupingTypePrimary
source: primary release types
ta: முதன்மை வெளியீட்டு வகைகள்

# page.albumArtistDetail.recentReleases
source: recent releases
ta: அண்மைக் கால வெளியீடுகள்

# page.albumArtistDetail.viewDiscography
source: view discography
ta: டிச்கோகிராஃபி காண்க

# page.albumArtistDetail.relatedArtists
source: related $t(entity.artist, {"count": 2})
ta: தொடர்புடைய $t(entity.artist, {"count": 2})

# page.albumArtistDetail.topSongs
source: top songs
ta: சிறந்த பாடல்கள்

# page.albumArtistDetail.topSongsCommunity
source: community
ta: சமூகம்

# page.albumArtistDetail.topSongsFrom
source: top songs from {{title}}
ta: {{title}} இலிருந்து சிறந்த பாடல்கள்

# page.albumArtistDetail.topSongsPersonal
source: personal
ta: தனிப்பட்ட

# page.albumArtistDetail.favoriteSongsFrom
source: favorite songs from {{title}}
ta: {{title}} இலிருந்து பிடித்த பாடல்கள்

# page.albumArtistDetail.viewAll
source: view all
ta: அனைத்தையும் காண்க

# page.albumArtistDetail.viewAllTracks
source: view all $t(entity.track, {"count": 2})
ta: அனைத்தையும் காண்க $t(entity.track, {"count": 2})

# page.albumDetail.moreFromArtist
source: more from this $t(entity.artist, {"count": 1})
ta: இந்த $t(entity.artist, {"count": 1}) இலிருந்து மேலும்

# page.albumDetail.moreFromGeneric
source: more from {{item}}
ta: {{item}} இலிருந்து மேலும்

# page.albumDetail.released
source: released
ta: வெளியிடப்பட்டது

# page.albumList.artistAlbums
source: albums by {{artist}}
ta: ஆல்பங்கள் {{artist}}

# page.radioList.title
source: radio stations
ta: வானொலி நிலையங்கள்

# page.releasenotes.commitsSinceStable
source: commits since {{stable}}
ta: {{stable}} முதல் உறுதியளிக்கிறது

# page.releasenotes.noNewCommits
source: no new commits in this range
ta: இந்த வரம்பில் புதிய பொறுப்புகள் எதுவும் இல்லை

# page.releasenotes.noStableReleaseToCompare
source: no stable release available to compare with
ta: ஒப்பிடுவதற்கு நிலையான வெளியீடு இல்லை

# page.windowBar.paused
source: (Paused)
ta: (இடைநிறுத்தப்பட்டது)

# page.windowBar.privateMode
source: (Private mode)
ta: (தனிப்பட்ட முறை)

# page.appMenu.collapseSidebar
source: collapse sidebar
ta: பக்கப்பட்டி சரிவு

# page.appMenu.commandPalette
source: open command palette
ta: கட்டளை தட்டு திறக்க

# page.appMenu.expandSidebar
source: expand sidebar
ta: பக்கப்பட்டியை விரிவாக்குங்கள்

# page.appMenu.goBack
source: go back
ta: திரும்பிச் செல்லுங்கள்

# page.appMenu.goForward
source: go forward
ta: முன்னோக்கிச் செல்லுங்கள்

# page.appMenu.manageServers
source: manage servers
ta: சேவையகங்களை நிர்வகிக்கவும்

# page.appMenu.privateModeOff
source: turn off private mode
ta: தனிப்பட்ட பயன்முறையை அணைக்கவும்

# page.appMenu.privateModeOn
source: turn on private mode
ta: தனிப்பட்ட பயன்முறையை இயக்கவும்

# page.appMenu.openBrowserDevtools
source: open browser devtools
ta: திறந்த உலாவி தேவ்டூல்கள்

# page.appMenu.selectServer
source: select server
ta: சேவையகத்தைத் தேர்ந்தெடுக்கவும்

# page.appMenu.selectMusicFolder
source: select music folder
ta: இசை கோப்புறையைத் தேர்ந்தெடுக்கவும்

# page.appMenu.noMusicFolder
source: no music folder selected
ta: இசை கோப்புறை எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# page.appMenu.multipleMusicFolders
source: {{count}} music folders selected
ta: {{count}} இசை கோப்புறைகள் தேர்ந்தெடுக்கப்பட்டன

# page.appMenu.version
source: version {{version}}
ta: பதிப்பு {{version}}

# page.manageServers.title
source: manage servers
ta: சேவையகங்களை நிர்வகிக்கவும்

# page.manageServers.serverDetails
source: server details
ta: சேவையக விவரங்கள்

# page.manageServers.url
source: URL
ta: முகவரி

# page.manageServers.username
source: username
ta: பயனர்பெயர்

# page.manageServers.editServerDetailsTooltip
source: edit server details
ta: சேவையக விவரங்களைத் திருத்தவும்

# page.manageServers.removeServer
source: remove server
ta: சேவையகத்தை அகற்று

# page.contextMenu.download
source: download
ta: பதிவிறக்கம்

# page.contextMenu.numberSelected
source: {{count}} selected
ta: {{count}} தேர்ந்தெடுக்கப்பட்டது

# page.contextMenu.shareItem
source: share item
ta: உருப்படியைப் பகிரவும்

# page.contextMenu.goTo
source: go to
ta: செல்

# page.contextMenu.goToAlbum
source: go to $t(entity.album, {"count": 1})
ta: $t(entity.album, {"count": 1}) க்குச் செல்

# page.contextMenu.goToAlbumArtist
source: go to $t(entity.albumArtist, {"count": 1})
ta: $t(entity.albumArtist, {"count": 1}) க்குச் செல்

# page.contextMenu.showDetails
source: get info
ta: தகவலைப் பெறுங்கள்

# page.fullscreenPlayer.config.dynamicBackground
source: dynamic background
ta: மாறும் பின்னணி

# page.fullscreenPlayer.config.dynamicImageBlur
source: image blur size
ta: பட மங்கலான அளவு

# page.fullscreenPlayer.config.dynamicIsImage
source: enable background image
ta: பின்னணி படத்தை இயக்கவும்

# page.fullscreenPlayer.config.followCurrentLyric
source: follow current lyric
ta: தற்போதைய பாடலைப் பின்பற்றுங்கள்

# page.fullscreenPlayer.config.lyricAlignment
source: lyric alignment
ta: பாடல் சீரமைப்பு

# page.fullscreenPlayer.config.lyricOffset
source: lyrics offset (ms)
ta: பாடல் ஆஃப்செட் (எம்.எச்)

# page.fullscreenPlayer.config.lyricGap
source: lyric gap
ta: பாடல் இடைவெளி

# page.fullscreenPlayer.config.lyricSize
source: lyric size
ta: பாடல் அளவு

# page.fullscreenPlayer.config.opacity
source: opacity
ta: ஒளிபுகாநிலை

# page.fullscreenPlayer.config.showLyricMatch
source: show lyric match
ta: பாடல் போட்டியைக் காட்டு

# page.fullscreenPlayer.config.showLyricProvider
source: show lyric provider
ta: பாடல் வழங்குநரைக் காட்டு

# page.fullscreenPlayer.config.synchronized
source: synchronized
ta: ஒத்திசைக்கப்பட்டது

# page.fullscreenPlayer.config.unsynchronized
source: unsynchronized
ta: ஒத்திசைக்கப்படாதது

# page.fullscreenPlayer.config.useImageAspectRatio
source: use image aspect ratio
ta: பட விகித விகிதத்தைப் பயன்படுத்தவும்

# page.fullscreenPlayer.lyrics
source: lyrics
ta: பாடல்

# page.fullscreenPlayer.related
source: related
ta: தொடர்புடைய

# page.fullscreenPlayer.upNext
source: up next
ta: அடுத்து

# page.fullscreenPlayer.visualizer
source: visualizer
ta: காட்சிப்படுத்தல்

# page.fullscreenPlayer.noLyrics
source: no lyrics found
ta: பாடல் வரிகள் இல்லை

# page.genreList.showAlbums
source: show $t(entity.genre, {"count": 1}) $t(entity.album, {"count": 2})
ta: காட்டு $t(entity.genre, {"count": 1}) $t(entity.album, {"count": 2})

# page.genreList.showTracks
source: show $t(entity.genre, {"count": 1}) $t(entity.track, {"count": 2})
ta: காட்டு $t(entity.genre, {"count": 1}) $t(entity.track, {"count": 2})

# page.globalSearch.commands.goToPage
source: go to page
ta: பக்கத்திற்குச் செல்லுங்கள்

# page.globalSearch.commands.searchFor
source: search for {{query}}
ta: {{query}} ஐத் தேடுங்கள்

# page.globalSearch.commands.serverCommands
source: server commands
ta: சேவையக கட்டளைகள்

# page.globalSearch.title
source: commands
ta: கட்டளைகள்

# page.home.explore
source: explore from your library
ta: உங்கள் நூலகத்திலிருந்து ஆராயுங்கள்

# page.home.mostPlayed
source: most played
ta: அதிகம் விளையாடியது

# page.home.newlyAdded
source: newly added releases
ta: புதிதாக சேர்க்கப்பட்ட வெளியீடுகள்

# page.home.recentlyPlayed
source: recently played
ta: அண்மைக் காலத்தில் விளையாடியது

# page.home.recentlyReleased
source: recently released
ta: அண்மைக் காலத்தில் வெளியானது

# page.itemDetail.copyPath
source: copy path to clipboard
ta: இடைநிலைப்பலகைக்கு பாதையை நகலெடுக்கவும்

# page.itemDetail.copiedPath
source: path copied successfully
ta: பாதை வெற்றிகரமாக நகலெடுக்கப்பட்டது

# page.itemDetail.openFile
source: show track in file manager
ta: கோப்பு மேலாளரில் தடத்தைக் காட்டு

# page.playlist.reorder
source: reordering only enabled when sorting by id
ta: ஐடியால் வரிசைப்படுத்தும்போது மட்டுமே மறுசீரமைப்பு இயக்கப்பட்டது

# page.collections.overrideExisting
source: override existing
ta: ஏற்கனவே உள்ளதை மேலெழுதவும்

# page.collections.saveAsCollection
source: save as collection
ta: சேகரிப்பாக சேமிக்கவும்

# page.setting.advanced
source: advanced
ta: மேம்பட்ட

# page.setting.analytics
source: analytics
ta: பகுப்பாய்வு

# page.setting.generalTab
source: general
ta: பொது

# page.setting.hotkeysTab
source: hotkeys
ta: ஆட்கீச்

# page.setting.playbackTab
source: playback
ta: பின்னணி

# page.setting.windowTab
source: window
ta: சாளரம்

# page.setting.updates
source: update
ta: புதுப்பிப்பு

# page.setting.cache
source: cache
ta: தற்காலிக சேமிப்பு

# page.setting.application
source: application
ta: விண்ணப்பம்

# page.setting.queryBuilder
source: query builder
ta: வினவல் கட்டுபவர்

# page.setting.theme
source: theme
ta: கருப்பொருள்

# page.setting.controls
source: controls
ta: கட்டுப்பாடுகள்

# page.setting.sidebar
source: sidebar
ta: பக்கப்பட்டி

# page.setting.remote
source: remote
ta: தொலைவில்

# page.setting.exportImport
source: import/export
ta: இறக்குமதி/ஏற்றுமதி

# page.setting.scrobble
source: scrobble
ta: சுருள்

# page.setting.audio
source: audio
ta: ஆடியோ

# page.setting.lyrics
source: lyrics
ta: பாடல் வரிகள்

# page.setting.lyricsDisplay
source: lyrics display
ta: பாடல் வரிகள் காட்சி

# page.setting.transcoding
source: transcoding
ta: டிரான்ச்கோடிங்

# page.setting.discord
source: discord
ta: முரண்பாடு

# page.setting.logger
source: logger
ta: மரம் வெட்டுபவர்

# page.setting.playerFilters
source: player filters
ta: பிளேயர் வடிப்பான்கள்

# page.sidebar.collections
source: collections
ta: சேகரிப்புகள்

# page.sidebar.myLibrary
source: my library
ta: எனது நூலகம்

# page.sidebar.nowPlaying
source: now playing
ta: இப்போது விளையாடுகிறது

# page.sidebar.shared
source: shared $t(entity.playlist, {"count": 2})
ta: $t(entity.playlist, {"count": 2}) பகிரப்பட்டது

# page.trackList.artistTracks
source: tracks by {{artist}}
ta: {{artist}}

# player.addLast
source: last
ta: கடைசி

# player.addNext
source: next
ta: அடுத்தது

# player.addLastShuffled
source: last (shuffled)
ta: கடைசியாக (குறைக்கப்பட்டது)

# player.addNextShuffled
source: next (shuffled)
ta: அடுத்தது (குலைக்கப்பட்டது)

# player.albumRadio
source: album radio
ta: ஆல்பம் வானொலி

# player.artistRadio
source: artist radio
ta: கலைஞர் வானொலி

# player.holdToShuffle
source: hold to shuffle
ta: கலக்க பிடி

# player.favorite
source: favorite
ta: பிடித்த

# player.lyrics
source: lyrics
ta: பாடல் வரிகள்

# player.mute
source: mute
ta: ஒலிமுடக்கு

# player.muted
source: muted
ta: முடக்கிய

# player.next
source: next
ta: அடுத்தது

# player.play
source: play
ta: விளையாடுங்கள்

# player.playbackFetchCancel
source: this is taking a while… close the notification to cancel
ta: இது சிறிது நேரம் ஆகும்… ரத்து செய்ய அறிவிப்பை மூடு

# player.playbackFetchInProgress
source: loading songs…
ta: பாடல்களை ஏற்றுகிறது…

# player.playbackFetchNoResults
source: no songs found
ta: பாடல்கள் எதுவும் கிடைக்கவில்லை

# player.playbackSpeed
source: playback speed
ta: பிளேபேக் விரைவு

# player.playRandom
source: play random
ta: சீரற்ற முறையில் விளையாடுங்கள்

# player.playSimilarSongs
source: play similar songs
ta: ஒத்த பாடல்களை வாசிக்கவும்

# player.previous
source: previous
ta: முந்தைய

# player.queue_clear
source: clear queue
ta: தெளிவான வரிசை

# player.queue_moveToBottom
source: move selected to top
ta: மேலே தேர்ந்தெடுக்கப்பட்ட நகர்த்து

# player.queue_moveToTop
source: move selected to bottom
ta: தேர்ந்தெடுக்கப்பட்டதை கீழே நகர்த்தவும்

# player.queue_remove
source: remove selected
ta: தேர்ந்தெடுக்கப்பட்டதை அகற்று

# player.repeat
source: repeat
ta: மீண்டும்

# player.repeat_all
source: repeat all
ta: அனைத்தையும் மீண்டும் செய்யவும்

# player.repeat_off
source: repeat disabled
ta: முடக்கப்பட்டதை மீண்டும் செய்யவும்

# player.restoreQueueFromServer
source: restore queue from server
ta: சேவையகத்திலிருந்து வரிசையை மீட்டமை

# player.saveQueueToServer
source: save queue to server
ta: சேவையகத்தில் வரிசையைச் சேமிக்கவும்

# player.shuffle
source: play (shuffled)
ta: விளையாடு (குலைக்கப்பட்டது)

# player.shuffle_off
source: shuffle disabled
ta: கலக்கு முடக்கப்பட்டது

# player.skip
source: skip
ta: தவிர்

# player.skip_back
source: skip backwards
ta: பின்னோக்கி தவிர்க்கவும்

# player.skip_forward
source: skip forwards
ta: முன்னோக்கி தவிர்க்கவும்

# player.stop
source: stop
ta: நிறுத்து

# player.toggleFullscreenPlayer
source: toggle fullscreen player
ta: முழுத்திரை பிளேயரை மாற்றவும்

# player.trackRadio
source: track radio
ta: டிராக் ரேடியோ

# player.unfavorite
source: unfavorite
ta: மாறாத

# player.pause
source: pause
ta: இடைநிறுத்தம்

# player.viewQueue
source: view queue
ta: வரிசையைக் காண்க

# player.sleepTimer
source: sleep timer
ta: தூக்க நேரம்

# player.sleepTimer_endOfSong
source: end of current song
ta: தற்போதைய பாடலின் முடிவு

# player.sleepTimer_minutes
source: {{count}} min
ta: {{count}} மணித்துளி

# player.sleepTimer_hours
source: {{count}} hr
ta: {{count}} மணி

# player.sleepTimer_custom
source: custom
ta: தனிப்பயன்

# player.sleepTimer_off
source: off
ta: அணை

# player.sleepTimer_timeRemaining
source: {{time}} remaining
ta: {{time}} மீதமுள்ளது

# player.sleepTimer_setCustom
source: set timer
ta: டைமரை அமைக்கவும்

# player.sleepTimer_cancel
source: cancel timer
ta: நேரங்குறிகருவி ரத்து

# queryBuilder.standardTags
source: standard tags
ta: நிலையான குறிச்சொற்கள்

# queryBuilder.customTags
source: custom tags
ta: விருப்ப குறிச்சொற்கள்

# releaseType.primary.broadcast
source: broadcast
ta: ஒளிபரப்பு

# releaseType.primary.ep
source: ep
ta: எபி

# releaseType.primary.other
source: other
ta: மற்றொன்று

# releaseType.primary.single
source: single
ta: ஒற்றை

# releaseType.secondary.audiobook
source: audiobook
ta: ஒலிப்புத்தகம்

# releaseType.secondary.audioDrama
source: audio drama
ta: ஆடியோ நாடகம்

# releaseType.secondary.compilation
source: compilation
ta: தொகுத்தல்

# releaseType.secondary.djMix
source: dj mix
ta: dj கலவை

# releaseType.secondary.demo
source: demo
ta: டெமோ

# releaseType.secondary.fieldRecording
source: field recording
ta: களப்பதிவு

# releaseType.secondary.interview
source: interview
ta: நேர்காணல்

# releaseType.secondary.live
source: live
ta: வாழ்க

# releaseType.secondary.mixtape
source: mixtape
ta: கலவை

# releaseType.secondary.remix
source: remix
ta: ரீமிக்ச்

# releaseType.secondary.soundtrack
source: soundtrack
ta: ஒலிப்பதிவு

# releaseType.secondary.spokenWord
source: spoken word
ta: பேசப்பட்ட சொல்

# setting.autoDJ
source: auto DJ
ta: ஆட்டோ டி.சே

# setting.autoDJ_description
source: automatically add similar songs to the queue
ta: தானாக வரிசையில் ஒத்த பாடல்களைச் சேர்க்கவும்

# setting.autoDJ_itemCount
source: item count
ta: பொருள் எண்ணிக்கை

# setting.autoDJ_itemCount_description
source: the number of items attempted to be added to the queue when auto DJ is enabled
ta: ஆட்டோ DJ இயக்கப்பட்டிருக்கும் போது, ​​வரிசையில் சேர்க்க முயற்சிக்கும் உருப்படிகளின் எண்ணிக்கை

# setting.autoDJ_timing
source: timing
ta: நேரவிவரம்

# setting.autoDJ_timing_description
source: the number of songs remaining in the queue before auto DJ is triggered
ta: ஆட்டோ டிசேக்கு முன் வரிசையில் மீதமுள்ள பாடல்களின் எண்ணிக்கை தூண்டப்படுகிறது

# setting.accentColor_description
source: sets the accent color for the application
ta: பயன்பாட்டிற்கான உச்சரிப்பு வண்ணத்தை அமைக்கிறது

# setting.accentColor
source: accent color
ta: உச்சரிப்பு நிறம்

# setting.useThemeAccentColor
source: use theme accent color
ta: கருப்பொருள் உச்சரிப்பு நிறத்தைப் பயன்படுத்தவும்

# setting.useThemeAccentColor_description
source: use the primary color defined in the selected theme instead of the custom accent color
ta: தனிப்பயன் உச்சரிப்பு நிறத்திற்குப் பதிலாக தேர்ந்தெடுக்கப்பட்ட தீமில் வரையறுக்கப்பட்ட முதன்மை வண்ணத்தைப் பயன்படுத்தவும்

# setting.albumBackground_description
source: adds a background image for album pages containing the album art
ta: ஆல்பம் கலை கொண்ட ஆல்பம் பக்கங்களுக்கு பின்னணி படத்தை சேர்க்கிறது

# setting.albumBackground
source: album background image
ta: ஆல்பம் பின்னணி படம்

# setting.albumBackgroundBlur_description
source: adjusts the amount of blur applied to the album background image
ta: ஆல்பத்தின் பின்னணி படத்திற்கு பயன்படுத்தப்படும் மங்கலின் அளவை சரிசெய்கிறது

# setting.albumBackgroundBlur
source: album background image blur size
ta: ஆல்பம் பின்னணி பட மங்கலான அளவு

# setting.analyticsDisable
source: Opt-out of usage based analytics
ta: பயன்பாடு அடிப்படையிலான பகுப்பாய்வுகளில் இருந்து விலகுதல்

# setting.analyticsDisable_description
source: Anonymized usage data is sent to the developer to help improve the application
ta: பயன்பாட்டை மேம்படுத்த உதவ டெவெலப்பருக்கு அநாமதேய பயன்பாட்டுத் தரவு அனுப்பப்படுகிறது

# setting.analyticsEnable
source: Send usage-based analytics
ta: பயன்பாட்டு அடிப்படையிலான பகுப்பாய்வுகளை அனுப்பவும்

# setting.analyticsEnable_description
source: Anonymized usage data is sent to the developer to help improve the application
ta: பயன்பாட்டை மேம்படுத்த உதவ டெவெலப்பருக்கு அநாமதேய பயன்பாட்டுத் தரவு அனுப்பப்படுகிறது

# setting.applicationHotkeys_description
source: configure application hotkeys. toggle the checkbox to set as a global hotkey (desktop only)
ta: பயன்பாட்டு ஆட்கீசை உள்ளமைக்கவும். உலகளாவிய ஆட்ச்கியாக அமைக்க தேர்வுப்பெட்டியை மாற்றவும் (டெச்க்டாப் மட்டும்)

# setting.applicationHotkeys
source: application hotkeys
ta: பயன்பாட்டு ஆட்கீச்

# setting.artistBackground
source: artist background image
ta: கலைஞர் பின்னணி படம்

# setting.artistBackground_description
source: adds a background image for artist pages containing the artist art
ta: கலைஞர் கலையை உள்ளடக்கிய கலைஞர் பக்கங்களுக்கு பின்னணி படத்தை சேர்க்கிறது

# setting.artistBackgroundBlur
source: artist background image blur size
ta: கலைஞர் பின்னணி படம் மங்கலான அளவு

# setting.artistBackgroundBlur_description
source: adjusts the amount of blur applied to the artist background image
ta: கலைஞரின் பின்னணி படத்தில் பயன்படுத்தப்படும் மங்கலின் அளவை சரிசெய்கிறது

# setting.artistConfiguration
source: album artist page configuration
ta: ஆல்பம் கலைஞர் பக்க உள்ளமைவு

# setting.artistConfiguration_description
source: configure what items are shown, and in what order, on the album artist page
ta: எந்த உருப்படிகள் காண்பிக்கப்படுகின்றன, எந்த வரிசையில், ஆல்பம் கலைஞர் பக்கத்தில் உள்ளமைக்கவும்

# setting.artistReleaseTypeConfiguration
source: artist release type configuration
ta: கலைஞர் வெளியீட்டு வகை கட்டமைப்பு

# setting.artistReleaseTypeConfiguration_description
source: configure what release types are shown, and in what order, on the album artist page
ta: ஆல்பம் கலைஞர் பக்கத்தில் என்ன வெளியீட்டு வகைகள் காட்டப்படுகின்றன, எந்த வரிசையில் உள்ளன என்பதை உள்ளமைக்கவும்

# setting.audioDevice_description
source: select the audio device to use for playback
ta: பிளேபேக்கிற்குப் பயன்படுத்த ஆடியோ சாதனத்தைத் தேர்ந்தெடுக்கவும்

# setting.audioDevice
source: audio device
ta: ஆடியோ சாதனம்

# setting.audioExclusiveMode_description
source: enable exclusive output mode. In this mode, the system is usually locked out, and only mpv will be able to output audio
ta: பிரத்யேக வெளியீட்டு பயன்முறையை இயக்கவும். இந்த பயன்முறையில், கணினி வழக்கமாக பூட்டப்படுகிறது, மேலும் MPV மட்டுமே ஆடியோவை வெளியிட முடியும்

# setting.audioExclusiveMode
source: audio exclusive mode
ta: ஆடியோ பிரத்தியேக பயன்முறை

# setting.audioPlayer_description
source: select the audio player to use for playback
ta: பிளேபேக்கிற்கு பயன்படுத்த ஆடியோ பிளேயரைத் தேர்ந்தெடுக்கவும்

# setting.audioPlayer
source: audio player
ta: ஆடியோ பிளேயர்

# setting.buttonSize_description
source: the size of the player bar buttons
ta: பிளேயர் பார் பொத்தான்களின் அளவு

# setting.buttonSize
source: player bar button size
ta: பிளேயர் பார் பொத்தான் அளவு

# setting.clearCache_description
source: a 'hard clear' of feishin. in addition to clearing feishin's cache, empty the browser cache (saved images and other assets). server credentials and settings are preserved
ta: ஃபீசினின் ஒரு 'கடினமான தெளிவான'. ஃபெசினின் தற்காலிக சேமிப்பை அழிப்பதைத் தவிர, உலாவி தற்காலிக சேமிப்பை (சேமித்த படங்கள் மற்றும் பிற சொத்துக்கள்) வெறுமை செய்யுங்கள். சேவையக நற்சான்றிதழ்கள் மற்றும் அமைப்புகள் பாதுகாக்கப்படுகின்றன

# setting.clearCache
source: clear browser cache
ta: தெளிவான உலாவி தற்காலிக சேமிப்பு

# setting.clearCacheSuccess
source: cache cleared successfully
ta: கேச் வெற்றிகரமாக அழிக்கப்பட்டது
