Repository: 247i/TACETr
Catalog: உரை/தானி/feishin-translation-*.po
Languages: ta

# visualizer.customGradients
source: Custom Gradients
ta: தனிப்பயன் சாய்வு

# visualizer.addCustomGradient
source: Add Custom Gradient
ta: தனிப்பயன் சாய்வு சேர்க்கவும்

# visualizer.gradientName
source: Gradient Name
ta: சாய்வு பெயர்

# visualizer.gradientNamePlaceholder
source: Gradient Name
ta: சாய்வு பெயர்

# visualizer.vertical
source: Vertical
ta: செங்குத்து

# visualizer.horizontal
source: Horizontal
ta: கிடைமட்ட

# visualizer.colorStops
source: Color Stops
ta: வண்ண நிறுத்தங்கள்

# visualizer.addColor
source: Add Color
ta: வண்ணத்தைச் சேர்க்கவும்

# visualizer.position
source: Position
ta: பதவி

# visualizer.level
source: Level
ta: நிலை

# visualizer.remove
source: Remove
ta: அகற்று

# visualizer.pasteGradient
source: Paste Gradient
ta: சாய்வு ஒட்டவும்

# visualizer.pasteGradientPlaceholder
source: Paste gradient JSON here...
ta: இங்கே சாய்வு சாதொபொகு ஒட்டவும்...

# visualizer.custom
source: Custom
ta: தனிப்பயன்

# visualizer.builtIn
source: Built-in
ta: உள்ளமைக்கப்பட்ட

# visualizer.colors
source: Colors
ta: நிறங்கள்

# visualizer.colorMode
source: Color Mode
ta: வண்ண முறை

# visualizer.gradient
source: Gradient
ta: சரிவு

# visualizer.gradientLeft
source: Gradient Left
ta: கிரேடியன்ட் இடது

# visualizer.gradientRight
source: Gradient Right
ta: கிரேடியன்ட் ரைட்

# visualizer.fftSize
source: FFT Size
ta: FFT அளவு

# visualizer.smoothing
source: Smoothing
ta: மென்மையாக்கும்

# visualizer.frequencyRangeAndScaling
source: Frequency range and scaling
ta: அதிர்வெண் வரம்பு மற்றும் அளவிடுதல்

# visualizer.minimumFrequency
source: Minimum Frequency
ta: குறைந்தபட்ச அதிர்வெண்

# visualizer.maximumFrequency
source: Maximum Frequency
ta: அதிகபட்ச அதிர்வெண்

# visualizer.frequencyScale
source: Frequency Scale
ta: அதிர்வெண் அளவுகோல்

# visualizer.sensitivity
source: Sensitivity
ta: உணர்திறன்

# visualizer.weightingFilter
source: Weighting Filter
ta: எடை வடிகட்டி

# visualizer.minimumDecibels
source: Minimum Decibels
ta: குறைந்தபட்ச டெசிபல்கள்

# visualizer.maximumDecibels
source: Maximum Decibels
ta: அதிகபட்ச டெசிபல்கள்

# visualizer.linearAmplitude
source: Linear Amplitude
ta: நேரியல் அலைவீச்சு

# visualizer.linearBoost
source: Linear Boost
ta: லீனியர் பூச்ட்

# visualizer.peakBehavior
source: Peak Behavior
ta: உச்ச நடத்தை

# visualizer.showPeaks
source: Show Peaks
ta: சிகரங்களைக் காட்டு

# visualizer.fadePeaks
source: Fade Peaks
ta: மங்கலான சிகரங்கள்

# visualizer.peakLine
source: Peak Line
ta: உச்சக் கோடு

# visualizer.gravity
source: Gravity
ta: புவியீர்ப்பு

# visualizer.peakFadeTime
source: Peak Fade Time (ms)
ta: பீக் ஃபேட் நேரம் (மிவி)

# visualizer.peakHoldTime
source: Peak Hold Time (ms)
ta: பீக் ஓல்ட் நேரம் (மிவி)

# visualizer.radialSpectrum
source: Radial Spectrum
ta: ரேடியல் ச்பெக்ட்ரம்

# visualizer.radial
source: Radial
ta: ரேடியல்

# visualizer.radialInvert
source: Radial Invert
ta: ரேடியல் தலைகீழ்

# visualizer.spinSpeed
source: Spin Speed
ta: சுழல் விரைவு

# visualizer.radius
source: Radius
ta: ஆரம்

# visualizer.reflexMirror
source: Reflex Mirror
ta: ரிஃப்ளெக்ச் மிரர்

# visualizer.reflexFit
source: Reflex Fit
ta: ரிஃப்ளெக்ச் ஃபிட்

# visualizer.reflexRatio
source: Reflex Ratio
ta: பிரதிபலிப்பு விகிதம்

# visualizer.reflexAlpha
source: Reflex Alpha
ta: ரிஃப்ளெக்ச் ஆல்பா

# visualizer.reflexBrightness
source: Reflex Brightness
ta: ரிஃப்ளெக்ச் ஒளி

# visualizer.mirror
source: Mirror
ta: கண்ணாடி

# visualizer.miscellaneousSettings
source: Miscellaneous Settings
ta: இதர அமைப்புகள்

# visualizer.alphaBars
source: Alpha Bars
ta: ஆல்பா பார்கள்

# visualizer.ansiBands
source: ANSI Bands
ta: ANSI பட்டைகள்

# visualizer.ledBars
source: LED Bars
ta: LED பார்கள்

# visualizer.trueLeds
source: True LEDs
ta: உண்மையான எல்.ஈ

# visualizer.lumiBars
source: Lumi Bars
ta: லுமி பார்கள்

# visualizer.outlineBars
source: Outline Bars
ta: அவுட்லைன் பார்கள்

# visualizer.roundBars
source: Round Bars
ta: சுற்று பார்கள்

# visualizer.lowResolution
source: Low Resolution
ta: குறைந்த தெளிவுத்திறன்

# visualizer.splitGradient
source: Split Gradient
ta: பிளவு சாய்வு

# visualizer.showFPS
source: Show FPS
ta: FPS ஐக் காட்டு

# visualizer.showScaleX
source: Show Scale X
ta: ஃச் அளவைக் காட்டு

# visualizer.noteLabels
source: Note Labels
ta: குறிப்பு லேபிள்கள்

# visualizer.showScaleY
source: Show Scale Y
ta: ஒய் அளவைக் காட்டு

# visualizer.options.mode.0
source: [0] Discrete Frequencies
ta: [0] தனித்துவமான அதிர்வெண்கள்

# visualizer.options.mode.1
source: [1] 1/24th octave / 240 bands
ta: [1] 1/24வது ஆக்டேவ் / 240 பட்டைகள்

# visualizer.options.mode.2
source: [2] 1/12th octave / 120 bands
ta: [2] 1/12வது ஆக்டேவ் / 120 பட்டைகள்

# visualizer.options.mode.3
source: [3] 1/8th octave / 80 bands
ta: [3] 1/8 ஆக்டேவ் / 80 பட்டைகள்

# visualizer.options.mode.4
source: [4] 1/6th octave / 60 bands
ta: [4] 1/6வது ஆக்டேவ் / 60 பட்டைகள்

# visualizer.options.mode.5
source: [5] 1/4th octave / 40 bands
ta: [5] 1/4வது ஆக்டேவ் / 40 பட்டைகள்

# visualizer.options.mode.6
source: [6] 1/3rd octave / 30 bands
ta: [6] 1/3 ஆக்டேவ் / 30 பட்டைகள்

# visualizer.options.mode.7
source: [7] Half octave / 20 bands
ta: [7] அரை ஆக்டேவ் / 20 பட்டைகள்

# visualizer.options.mode.8
source: [8] Full octave / 10 bands
ta: [8] முழு ஆக்டேவ் / 10 பட்டைகள்

# visualizer.options.mode.10
source: [10] Line / Area graph
ta: [10] கோடு / பகுதி வரைபடம்

# visualizer.options.colorMode.gradient
source: Gradient
ta: சரிவு

# visualizer.options.colorMode.barIndex
source: Bar-Index
ta: பார்-இண்டெக்ச்

# visualizer.options.colorMode.barLevel
source: Bar-Level
ta: பட்டை-நிலை

# visualizer.options.gradient.classic
source: Classic
ta: கிளாசிக்

# visualizer.options.gradient.prism
source: Prism
ta: அரியம், பட்டகம்

# visualizer.options.gradient.rainbow
source: Rainbow
ta: வானவில்

# visualizer.options.gradient.steelblue
source: Steelblue
ta: இரும்புநீலம்

# visualizer.options.gradient.orangered
source: Orangered
ta: ஆரஞ்சுசிவப்பு

# visualizer.options.channelLayout.single
source: Single
ta: ஒற்றை

# visualizer.options.channelLayout.dualCombined
source: Dual-Combined
ta: இரட்டை-இணைந்த

# visualizer.options.channelLayout.dualHorizontal
source: Dual-Horizontal
ta: இரட்டை-கிடைமட்ட

# visualizer.options.channelLayout.dualVertical
source: Dual-Vertical
ta: இரட்டை-செங்குத்து

# visualizer.options.frequencyScale.none
source: None
ta: எதுவுமில்லை

# visualizer.options.frequencyScale.bark
source: Bark Scale
ta: பட்டை அளவு

# visualizer.options.frequencyScale.linear
source: Linear Scale
ta: நேரியல் அளவுகோல்

# visualizer.options.frequencyScale.log
source: Log Scale
ta: பதிவு அளவுகோல்

# visualizer.options.frequencyScale.mel
source: Mel Scale
ta: மெல் அளவுகோல்

# visualizer.options.weightingFilter.none
source: None
ta: எதுவுமில்லை

# visualizer.options.weightingFilter.a
source: A
ta: ஏ

# visualizer.options.weightingFilter.b
source: B
ta: பி

# visualizer.options.weightingFilter.c
source: C
ta: சி

# visualizer.options.weightingFilter.d
source: D
ta: டி

# visualizer.options.weightingFilter.z
source: Z
ta: சட்
