Repository: 247i/TACETr
Catalog: உரை/தானி/feishin-translation-*.po
Languages: ta

# setting.clearQueryCache_description
source: a 'soft clear' of feishin. this will refresh playlists, track metadata, and reset saved lyrics. settings, server credentials and cached images are preserved
ta: ஃபீசினின் 'மென்மையான தெளிவான'. இது பிளேலிச்ட்களைப் புதுப்பிக்கும், மெட்டாடேட்டாவைக் கண்காணிக்கும் மற்றும் சேமித்த பாடல் வரிகளை மீட்டமைக்கும். அமைப்புகள், சேவையக நற்சான்றிதழ்கள் மற்றும் தற்காலிக சேமிப்பு படங்கள் பாதுகாக்கப்படுகின்றன

# setting.clearQueryCache
source: clear feishin cache
ta: தெளிவான ஃபைசின் கேச்

# setting.contextMenu_description
source: allows you to hide items that are shown in the menu when you right click on an item. items that are unchecked will be hidden
ta: நீங்கள் ஒரு உருப்படியை வலது சொடுக்கு செய்யும் போது பட்டியலில் காட்டப்பட்டுள்ள உருப்படிகளை மறைக்க உங்களை அனுமதிக்கிறது. சரிபார்க்கப்படாத உருப்படிகள் மறைக்கப்படும்

# setting.contextMenu
source: context menu (right click) configuration
ta: சூழல் பட்டியல் (வலது கிளிக்) உள்ளமைவு

# setting.crossfadeDuration_description
source: sets the duration of the crossfade effect
ta: கிராச்ஃபேட் விளைவின் காலத்தை அமைக்கிறது

# setting.crossfadeDuration
source: crossfade duration
ta: கிராச்ஃபேட் காலம்

# setting.crossfadeStyle
source: crossfade style
ta: குறுக்குவழி பாணி

# setting.crossfadeStyle_description
source: select the crossfade style to use for the audio player
ta: ஆடியோ பிளேயருக்கு பயன்படுத்த கிராச்ஃபேட் பாணியைத் தேர்ந்தெடுக்கவும்

# setting.customCss_description
source: custom css content. Note: content and remote urls are disallowed properties. A preview of your content is shown below. Additional fields you didn't set are present due to sanitization
ta: தனிப்பயன் சிஎச்எச் உள்ளடக்கம். குறிப்பு: உள்ளடக்கம் மற்றும் தொலைநிலை முகவரி கள் அனுமதிக்கப்படாத பண்புகள். உங்கள் உள்ளடக்கத்தின் முன்னோட்டம் கீழே காட்டப்பட்டுள்ளது. நீங்கள் அமைக்காத கூடுதல் புலங்கள் சுத்திகரிப்பு காரணமாக உள்ளன

# setting.customCss
source: custom css
ta: தனிப்பயன் சிஎச்எச்

# setting.customCssEnable_description
source: allow for writing custom css
ta: தனிப்பயன் சிஎச்எச் ஐ எழுத அனுமதிக்கவும்

# setting.customCssEnable
source: enable custom css
ta: தனிப்பயன் சிஎச்எச் ஐ இயக்கவும்

# setting.customCssNotice
source: Warning: while there is some sanitization (disallowing url() and content:), using custom css can still pose risks by changing the interface
ta: எச்சரிக்கை: சில சுத்திகரிப்பு (URL () மற்றும் உள்ளடக்கத்தை அனுமதிக்காதது :) இருக்கும்போது, தனிப்பயன் சிஎச்எச் ஐப் பயன்படுத்துவது இடைமுகத்தை மாற்றுவதன் மூலம் ஆபத்துக்களை ஏற்படுத்தக்கூடும்

# setting.customFontPath_description
source: sets the path to the custom font to use for the application
ta: பயன்பாட்டிற்கு பயன்படுத்த தனிப்பயன் எழுத்துருவுக்கு பாதையை அமைக்கிறது

# setting.customFontPath
source: custom font path
ta: தனிப்பயன் எழுத்துரு பாதை

# setting.automaticUpdates
source: Automatic updates
ta: தானியங்கி புதுப்பிப்புகள்

# setting.automaticUpdates_description
source: Check for and install updates automatically
ta: புதுப்பிப்புகளை தானாக சரிபார்த்து நிறுவவும்

# setting.releaseChannel_optionAlpha
source: alpha (nightly)
ta: ஆல்பா (இரவு)

# setting.releaseChannel_optionBeta
source: beta
ta: பீட்டா

# setting.releaseChannel_optionLatest
source: latest
ta: அண்மைக் கால

# setting.releaseChannel
source: release channel
ta: வெளியீடு சேனல்

# setting.releaseChannel_description
source: choose between stable, beta, or alpha (nightly) releases for automatic updates
ta: தானியங்கி புதுப்பிப்புகளுக்கு நிலையான, பீட்டா அல்லது ஆல்பா (இரவு) வெளியீடுகளுக்கு இடையே தேர்வு செய்யவும்

# setting.disableLibraryUpdateOnStartup
source: disable checking for new versions on startup
ta: தொடக்கத்தில் புதிய பதிப்புகளைச் சரிபார்ப்பதை முடக்கு

# setting.discordApplicationId_description
source: the application id for {{discord}} rich presence (defaults to {{defaultId}})
ta: {{discord}} பணக்கார இருப்புக்கான பயன்பாட்டு ஐடி (இயல்புநிலை {{defaultId}})

# setting.discordApplicationId
source: {{discord}} application id
ta: {{discord}} பயன்பாட்டு ஐடி

# setting.discordDisplayType_artistname
source: artist name(s)
ta: கலைஞர் பெயர்(கள்)

# setting.discordDisplayType_description
source: changes what you are listening to in your status
ta: உங்கள் நிலையில் நீங்கள் கேட்பதை மாற்றுகிறது

# setting.discordDisplayType_songname
source: song name
ta: பாடல் பெயர்

# setting.discordDisplayType
source: {{discord}} presence display type
ta: {{discord}} இருப்பு காட்சி வகை

# setting.discordIdleStatus_description
source: when enabled, update status while player is idle
ta: இயக்கப்பட்டால், பிளேயர் சும்மா இருக்கும்போது நிலையைப் புதுப்பிக்கவும்

# setting.discordIdleStatus
source: show rich presence idle status
ta: பணக்கார இருப்பு செயலற்ற நிலையைக் காட்டுங்கள்

# setting.discordLinkType_description
source: adds external links to {{lastfm}} or {{musicbrainz}} to the song and artist fields in {{discord}} rich presence. {{musicbrainz}} is the most accurate but requires tags and doesn't provide artist links while {{lastfm}} should always provide a link. makes no extra network requests
ta: {{discord}} சிறந்த முன்னிலையில் பாடல் மற்றும் கலைஞர் புலங்களுக்கு {{lastfm}} அல்லது {{musicbrainz}} வெளிப்புற இணைப்புகளைச் சேர்க்கிறது. {{musicbrainz}} மிகவும் துல்லியமானது ஆனால் குறிச்சொற்கள் தேவை மற்றும் கலைஞர் இணைப்புகளை வழங்காது, {{lastfm}} எப்போதும் இணைப்பை வழங்க வேண்டும். கூடுதல் பிணைய கோரிக்கைகளை செய்யாது

# setting.discordLinkType_mbz_lastfm
source: {{musicbrainz}} with {{lastfm}} fallback
ta: {{musicbrainz}} உடன் {{lastfm}} ஃபால்பேக்

# setting.discordLinkType
source: {{discord}} presence links
ta: {{discord}} இருப்பு இணைப்புகள்

# setting.discordListening_description
source: show status as listening instead of playing
ta: விளையாடுவதற்குப் பதிலாக கேட்பது என்று அந்த நிலையைக் காட்டுங்கள்

# setting.discordListening
source: show status as listening
ta: கேட்பது என நிலையைக் காட்டுங்கள்

# setting.discordPausedStatus_description
source: when enabled, status will show when player is paused
ta: இயக்கப்பட்டால், பிளேயர் இடைநிறுத்தப்படும்போது நிலை காண்பிக்கப்படும்

# setting.discordPausedStatus
source: show rich presence when paused
ta: இடைநிறுத்தப்படும்போது பணக்கார இருப்பைக் காட்டுங்கள்

# setting.discordRichPresence
source: {{discord}} rich presence
ta: {{discord}} பணக்கார இருப்பு

# setting.discordRichPresence_description
source: enable playback status in {{discord}} rich presence. Image keys are: {{icon}}, {{playing}}, and {{paused}}
ta: {{discord}} பணக்கார இருப்பில் பின்னணி நிலையை இயக்கவும். பட விசைகள்: {{icon}}, {{playing}}, மற்றும் {{paused}}

# setting.discordServeImage
source: serve {{discord}} images from server
ta: சேவையகத்திலிருந்து {{discord}} படங்களை பரிமாறவும்

# setting.discordServeImage_description
source: share cover art for {{discord}} rich presence from server itself, only available for Jellyfin and Navidrome. {{discord}} uses a bot to fetch images, so your server must be reachable from the public internet
ta: சேவையகத்திலிருந்தே {{discord}} சிறந்த இருப்புக்கான கவர் ஆர்ட்டைப் பகிரவும், செல்லிஃபின் மற்றும் நவிட்ரோமுக்கு மட்டுமே கிடைக்கும். படங்களைப் பெற {{discord}} ஒரு போட்டைப் பயன்படுத்துகிறது, எனவே உங்கள் சர்வர் பொது இணையத்திலிருந்து அணுகக்கூடியதாக இருக்க வேண்டும்

# setting.discordStateIcon
source: show playing icon
ta: விளையாடும் ஐகானைக் காட்டு

# setting.discordStateIcon_description
source: show a small playing icon in the rich presence status. the paused icon is always shown when "Show rich presence when paused" is enabled
ta: பணக்கார இருப்பு நிலையில் சிறிய விளையாடும் ஐகானைக் காட்டு. இடைநிறுத்தப்பட்ட படவுரு எப்போதும் "இடைநிறுத்தப்பட்ட போது பணக்கார இருப்பைக் காட்டு" இயக்கப்பட்டிருக்கும் போது காண்பிக்கப்படும்

# setting.discordUpdateInterval
source: {{discord}} rich presence update interval
ta: {{discord}} பணக்கார இருப்பு புதுப்பிப்பு இடைவெளி

# setting.discordUpdateInterval_description
source: the time in seconds between each update (minimum 15 seconds)
ta: ஒவ்வொரு புதுப்பிப்புக்கும் இடையிலான விநாடிகளில் நேரம் (குறைந்தபட்சம் 15 வினாடிகள்)

# setting.enableAutoTranslation_description
source: enable translation automatically when lyrics are loaded
ta: பாடல் வரிகள் ஏற்றப்படும் போது தானாகவே மொழிபெயர்ப்பை இயக்கவும்

# setting.enableAutoTranslation
source: enable auto translation
ta: தானியங்கு மொழிபெயர்ப்பை இயக்கு

# setting.enableRemote_description
source: enables the remote control server to allow other devices to control the application
ta: பயன்பாட்டைக் கட்டுப்படுத்த மற்ற சாதனங்களை அனுமதிக்க ரிமோட் கண்ட்ரோல் சேவையகத்தை இயக்குகிறது

# setting.enableRemote
source: enable remote control server
ta: ரிமோட் கண்ட்ரோல் சேவையகத்தை இயக்கவும்

# setting.exitToTray_description
source: exit the application to the system tray
ta: கணினி தட்டில் பயன்பாட்டிலிருந்து வெளியேறவும்

# setting.exitToTray
source: exit to tray
ta: தட்டில் வெளியேறவும்

# setting.exportImportSettings_control_description
source: export and import settings via JSON
ta: சாதொபொகு வழியாக ஏற்றுமதி மற்றும் இறக்குமதி அமைப்புகளை

# setting.exportImportSettings_control_exportText
source: export settings
ta: ஏற்றுமதி அமைப்புகள்

# setting.exportImportSettings_control_importText
source: import settings
ta: இறக்குமதி அமைப்புகள்

# setting.exportImportSettings_control_title
source: import / export settings
ta: இறக்குமதி / ஏற்றுமதி அமைப்புகள்

# setting.exportImportSettings_destructiveWarning
source: importing settings is destructive, please review the above before clicking "import" below!
ta: அமைப்புகளை இறக்குமதி செய்வது அழிவுகரமானது, கீழே உள்ள "இறக்குமதி" என்பதைக் சொடுக்கு செய்வதற்கு முன் மேலே உள்ளவற்றை மதிப்பாய்வு செய்யவும்!

# setting.exportImportSettings_importBtn
source: import settings
ta: இறக்குமதி அமைப்புகள்

# setting.exportImportSettings_importModalTitle
source: import feishin settings
ta: feishin அமைப்புகளை இறக்குமதி செய்யவும்

# setting.exportImportSettings_importSuccess
source: settings have been imported successfully!
ta: அமைப்புகள் வெற்றிகரமாக இறக்குமதி செய்யப்பட்டன!

# setting.exportImportSettings_notValidJSON
source: the file passed is not valid JSON
ta: அனுப்பப்பட்ட கோப்பு சாதொபொகு செல்லுபடியாகாது

# setting.exportImportSettings_offendingKeyError
source: "{{offendingKey}}" is incorrect - {{reason}}
ta: "{{offendingKey}}" தவறானது - {{reason}}

# setting.externalLinks_description
source: enables showing external links (Last.fm, MusicBrainz) on artist/album pages
ta: கலைஞர்/ஆல்பம் பக்கங்களில் வெளிப்புற இணைப்புகளை (last.fm, மியூசிக் ப்ரெய்ன்ச்) காண்பிக்க உதவுகிறது

# setting.externalLinks
source: show external links
ta: வெளிப்புற இணைப்புகளைக் காட்டு

# setting.followCurrentSong_description
source: automatically scroll the play queue to the current playing song
ta: தானாக விளையாடும் வரிசையை தற்போதைய பாடலுக்கு உருட்டும்

# setting.followCurrentSong
source: follow current song
ta: தற்போதைய பாடலைப் பின்பற்றவும்

# setting.followLyric_description
source: scroll the lyric to the current playing position
ta: தற்போதைய விளையாட்டு நிலைக்கு பாடலை உருட்டவும்

# setting.followLyric
source: follow current lyric
ta: தற்போதைய பாடலைப் பின்பற்றுங்கள்

# setting.font_description
source: sets the font to use for the application
ta: பயன்பாட்டிற்கு பயன்படுத்த எழுத்துருவை அமைக்கிறது

# setting.font
source: font
ta: எழுத்துரு

# setting.fontType_description
source: built-in font selects one of the fonts provided by feishin. system font allows you to select any font provided by your operating system. custom allows you to provide your own font
ta: உள்ளமைக்கப்பட்ட எழுத்துரு ஃபீசின் வழங்கிய எழுத்துருக்களில் ஒன்றைத் தேர்ந்தெடுக்கிறது. உங்கள் இயக்க முறைமை வழங்கிய எந்த எழுத்துருவையும் தேர்ந்தெடுக்க கணினி எழுத்துரு உங்களை அனுமதிக்கிறது. உங்கள் சொந்த எழுத்துருவை வழங்க தனிப்பயன் உங்களை அனுமதிக்கிறது

# setting.fontType_optionBuiltIn
source: built-in font
ta: உள்ளமைக்கப்பட்ட எழுத்துரு

# setting.fontType_optionCustom
source: custom font
ta: தனிப்பயன் எழுத்துரு

# setting.fontType_optionSystem
source: system font
ta: கணினி எழுத்துரு

# setting.fontType
source: font type
ta: எழுத்துரு வகை

# setting.gaplessAudio_description
source: sets the gapless audio setting for mpv
ta: MPV க்கான இடைவெளி இல்லாத ஆடியோ அமைப்பை அமைக்கிறது

# setting.gaplessAudio_optionWeak
source: weak (recommended)
ta: பலவீனமான (பரிந்துரைக்கப்படுகிறது)

# setting.gaplessAudio
source: gapless audio
ta: இடைவெளி இல்லாத ஆடியோ

# setting.globalMediaHotkeys_description
source: enable or disable the usage of your system media hotkeys to control playback
ta: பிளேபேக்கைக் கட்டுப்படுத்த உங்கள் கணினி மீடியா ஆட்கீசின் பயன்பாட்டை இயக்கவும் அல்லது முடக்கவும்

# setting.globalMediaHotkeys
source: global media hotkeys
ta: உலகளாவிய மீடியா ஆட்கீச்

# setting.homeConfiguration_description
source: configure what items are shown, and in what order, on the home page
ta: என்னென்ன உருப்படிகள் காட்டப்படுகின்றன, எந்த வரிசையில், முகப்பு பக்கத்தில் உள்ளமைக்கவும்

# setting.homeConfiguration
source: home page configuration
ta: முகப்பு பக்க உள்ளமைவு

# setting.homeFeature_description
source: controls whether to show the large featured carousel on the home page
ta: முகப்பு பக்கத்தில் பெரிய பிரத்யேக கொணர்வி காட்ட வேண்டுமா என்பதைக் கட்டுப்படுத்துகிறது

# setting.homeFeature
source: home featured carousel
ta: வீட்டில் கொணர்வி இடம்பெற்றது

# setting.homeFeatureStyle_description
source: controls the style of the home featured carousel
ta: வீட்டில் இடம்பெற்றுள்ள கொணர்வியின் பாணியைக் கட்டுப்படுத்துகிறது

# setting.homeFeatureStyle
source: home featured carousel style
ta: வீட்டில் இடம்பெற்றது கொணர்வி பாணி

# setting.homeFeatureStyle_optionMultiple
source: multiple
ta: பல

# setting.homeFeatureStyle_optionSingle
source: single
ta: ஒற்றை

# setting.hotkey_browserBack
source: browser back
ta: உலாவி மீண்டும்

# setting.hotkey_browserForward
source: browser forward
ta: முன்னோக்கி உலாவி

# setting.hotkey_favoriteCurrentSong
source: favorite $t(common.currentSong)
ta: பிடித்த $t(common.currentSong)

# setting.hotkey_favoritePreviousSong
source: favorite $t(common.previousSong)
ta: பிடித்த $t(common.previousSong)

# setting.hotkey_globalSearch
source: global search
ta: உலக தேடல்

# setting.hotkey_localSearch
source: in-page search
ta: பக்க தேடல்

# setting.hotkey_listNavigateToPage
source: list navigate to item page
ta: பட்டியல் உருப்படி பக்கத்திற்கு செல்லவும்

# setting.hotkey_listPlayDefault
source: list play
ta: பட்டியல் நாடகம்

# setting.hotkey_listPlayLast
source: list play last
ta: பட்டியல் கடைசியாக விளையாடு

# setting.hotkey_listPlayNext
source: list play next
ta: பட்டியல் அடுத்து விளையாடு

# setting.hotkey_listPlayNow
source: list play now
ta: பட்டியல் விளையாட இப்போது

# setting.hotkey_navigateHome
source: navigate to home
ta: வீட்டிற்கு செல்லவும்

# setting.hotkey_playbackNext
source: next track
ta: அடுத்த பாடல்

# setting.hotkey_playbackPause
source: pause
ta: இடைநிறுத்தம்

# setting.hotkey_playbackPlay
source: play
ta: விளையாடுங்கள்

# setting.hotkey_playbackPlayPause
source: play / pause
ta: விளையாடு / இடைநிறுத்தம்

# setting.hotkey_playbackPrevious
source: previous track
ta: முந்தைய பாடல்

# setting.hotkey_playbackStop
source: stop
ta: நிறுத்து

# setting.hotkey_rate0
source: rating clear
ta: மதிப்பீடு தெளிவாக

# setting.hotkey_rate1
source: rating 1 star
ta: மதிப்பீடு 1 விண்மீன்

# setting.hotkey_rate2
source: rating 2 stars
ta: மதிப்பீடு 2 நட்சத்திரங்கள்

# setting.hotkey_rate3
source: rating 3 stars
ta: மதிப்பீடு 3 நட்சத்திரங்கள்

# setting.hotkey_rate4
source: rating 4 stars
ta: மதிப்பீடு 4 நட்சத்திரங்கள்

# setting.hotkey_rate5
source: rating 5 stars
ta: மதிப்பீடு 5 நட்சத்திரங்கள்

# setting.hotkey_skipBackward
source: skip backward
ta: பின்தங்கிய நிலையில் தவிர்க்கவும்

# setting.hotkey_skipForward
source: skip forward
ta: முன்னோக்கி செல்லுங்கள்

# setting.hotkey_toggleCurrentSongFavorite
source: toggle $t(common.currentSong) favorite
ta: மாற்று $t(common.currentSong) பிடித்தது

# setting.hotkey_toggleFullScreenPlayer
source: toggle full screen player
ta: முழு திரை பிளேயரை மாற்றவும்

# setting.hotkey_togglePreviousSongFavorite
source: toggle $t(common.previousSong) favorite
ta: மாற்றவும் $t(common.previousSong) பிடித்தது

# setting.hotkey_toggleQueue
source: toggle queue
ta: வரிசையை மாற்றவும்

# setting.hotkey_toggleRepeat
source: toggle repeat
ta: மாற்று மறுநிகழ்வு

# setting.hotkey_toggleShuffle
source: toggle shuffle
ta: கலக்கு மாற்று

# setting.hotkey_unfavoriteCurrentSong
source: unfavorite $t(common.currentSong)
ta: பிடிக்காத $t(common.currentSong)

# setting.hotkey_unfavoritePreviousSong
source: unfavorite $t(common.previousSong)
ta: பிடிக்காத $t(common.previousSong)

# setting.hotkey_volumeDown
source: volume down
ta: தொகுதி கீழே

# setting.hotkey_volumeMute
source: volume mute
ta: தொகுதி முடக்கு

# setting.hotkey_volumeUp
source: volume up
ta: தொகுதி

# setting.hotkey_zoomIn
source: zoom in
ta: பெரிதாக்கு

# setting.hotkey_zoomOut
source: zoom out
ta: சிறிதாக்கு

# setting.imageAspectRatio_description
source: if enabled, cover art will be shown using their native aspect ratio. for art that is not 1:1, the remaining space will be empty
ta: இயக்கப்பட்டால், கவர் கலை அவற்றின் சொந்த விகித விகிதத்தைப் பயன்படுத்தி காண்பிக்கப்படும். 1: 1 இல்லாத கலைக்கு, மீதமுள்ள இடம் காலியாக இருக்கும்

# setting.imageAspectRatio
source: use native cover art aspect ratio
ta: சொந்த கவர் கலை விகித விகிதத்தைப் பயன்படுத்தவும்

# setting.language
source: language
ta: மொழி

# setting.language_description
source: sets the language for the application ($t(common.restartRequired))
ta: பயன்பாட்டிற்கான மொழியை அமைக்கிறது ($t(common.restartRequired))

# setting.lastfm_description
source: show links to Last.fm on artist/album pages
ta: கலைஞர்/ஆல்பம் பக்கங்களில் Last.fm க்கான இணைப்புகளைக் காட்டு

# setting.lastfm
source: show last.fm links
ta: last.fm இணைப்புகளைக் காட்டு

# setting.lastfmApiKey_description
source: the API key for {{lastfm}}. required for cover art
ta: {{lastfm}} க்கான பநிஇ விசை. கவர் கலைக்குத் தேவை

# setting.lastfmApiKey
source: {{lastfm}} API key
ta: {{lastfm}} பநிஇ key

# setting.lyricFetch_description
source: fetch lyrics from various internet sources
ta: பல்வேறு இணைய மூலங்களிலிருந்து பாடல் வரிகள்

# setting.lyricFetch
source: fetch lyrics from the internet
ta: இணையத்திலிருந்து வரிகளை பெறுங்கள்

# setting.lyricFetchProvider_description
source: select the providers to fetch lyrics from
ta: பாடல் வரிகளைப் பெற வழங்குநர்களைத் தேர்ந்தெடுக்கவும்

# setting.lyricFetchProvider
source: providers to fetch lyrics from
ta: பாடல் பெற வழங்குநர்கள்

# setting.lyricOffset_description
source: offset the lyric by the specified amount of milliseconds
ta: குறிப்பிட்ட அளவு மில்லி விநாடிகளால் பாடலை ஈடுசெய்யவும்

# setting.lyricOffset
source: lyric offset (ms)
ta: பாடல் ஆஃப்செட் (எம்.எச்)

# setting.logLevel
source: log level
ta: பதிவு நிலை

# setting.logLevel_description
source: sets the minimum log level to display. debug shows all logs, error only shows errors
ta: காண்பிக்க குறைந்தபட்ச பதிவு அளவை அமைக்கிறது. பிழைத்திருத்தம் அனைத்து பதிவுகளையும் காட்டுகிறது, பிழை பிழைகளை மட்டுமே காட்டுகிறது

# setting.logLevel_optionDebug
source: debug
ta: பிழைத்திருத்தம்

# setting.logLevel_optionError
source: error
ta: பிழை

# setting.logLevel_optionInfo
source: info
ta: தகவல்

# setting.logLevel_optionWarn
source: warn
ta: முன்னறிவிப்பு

# setting.minimizeToTray_description
source: minimize the application to the system tray
ta: கணினி தட்டில் பயன்பாட்டைக் குறைக்கவும்

# setting.minimizeToTray
source: minimize to tray
ta: தட்டில் குறைக்கவும்

# setting.minimumScrobblePercentage_description
source: the minimum percentage of the song that must be played before it is scrobbled
ta: பாடலின் குறைந்தபட்ச விழுக்காடு அதைத் துடைப்பதற்கு முன்பு இசைக்க வேண்டும்

# setting.minimumScrobblePercentage
source: minimum scrobble duration (percentage)
ta: குறைந்தபட்ச துணிச்சல் காலம் (சதவீதம்)

# setting.minimumScrobbleSeconds_description
source: the minimum duration in seconds of the song that must be played before it is scrobbled
ta: பாடலின் விநாடிகளில் குறைந்தபட்ச காலம் அது வேட்டையாடப்படுவதற்கு முன்பு இசைக்கப்பட வேண்டும்

# setting.minimumScrobbleSeconds
source: minimum scrobble (seconds)
ta: குறைந்தபட்ச தோண்டல் (விநாடிகள்)

# setting.mpvExecutablePath_description
source: sets the path to the mpv executable. if left empty, the default path will be used
ta: MPV இயங்கக்கூடிய பாதையை அமைக்கிறது. காலியாக இருந்தால், இயல்புநிலை பாதை பயன்படுத்தப்படும்

# setting.mpvExecutablePath
source: mpv executable path
ta: MPV இயங்கக்கூடிய பாதை

# setting.mpvExtraParameters
source: mpv extra parameters
ta: mpv கூடுதல் அளவுருக்கள்

# setting.mpvExtraParameters_description
source: extra arguments to pass to mpv
ta: mpv க்கு அனுப்ப கூடுதல் வாதங்கள்

# setting.mpvExtraParameters_help
source: one per line
ta: ஒரு வரிக்கு ஒன்று

# setting.musicbrainz_description
source: show links to MusicBrainz on artist/album pages, where MusicBrainz ID exists
ta: கலைஞர்/ஆல்பம் பக்கங்களில் மியூசிக் பிரைன்ச் இணைப்புகளைக் காட்டு, அங்கு மியூசிக் பிரைன்ச் ID உள்ளது

# setting.musicbrainz
source: show MusicBrainz links
ta: மியூசிக் பிரேன்ச் இணைப்புகளைக் காட்டு

# setting.neteaseTranslation_description
source: When enabled, fetches and displays translated lyrics from NetEase if available
ta: இயக்கப்பட்டால், கிடைத்தால் நெட்சிலிருந்து மொழிபெயர்க்கப்பட்ட பாடல்களைப் பெறுகிறது மற்றும் காட்சிப்படுத்துகிறது

# setting.neteaseTranslation
source: Enable NetEase translations
ta: நெட்ச் மொழிபெயர்ப்புகளை இயக்கவும்

# setting.notify
source: enable song notifications
ta: பாடல் அறிவிப்புகளை இயக்கவும்

# setting.notify_description
source: show notifications when changing the current song
ta: தற்போதைய பாடலை மாற்றும்போது அறிவிப்புகளைக் காட்டு

# setting.pathReplace
source: file path replacement
ta: கோப்பு பாதை மாற்று

# setting.pathReplace_description
source: replace your server's default filepath
ta: உங்கள் சேவையகத்தின் இயல்புநிலை கோப்பு பாதையை மாற்றவும்

# setting.pathReplace_optionRemovePrefix
source: remove prefix
ta: முன்னொட்டை அகற்று

# setting.pathReplace_optionAddPrefix
source: add prefix
ta: முன்னொட்டு சேர்க்கவும்

# setting.passwordStore_description
source: what password/secret store to use. change this if you are having issues storing passwords
ta: என்ன கடவுச்சொல்/ரகசிய கடை பயன்படுத்த வேண்டும். கடவுச்சொற்களை சேமிப்பதில் சிக்கல்கள் இருந்தால் இதை மாற்றவும்

# setting.passwordStore
source: passwords/secret store
ta: கடவுச்சொற்கள்/ரகசிய கடை

# setting.playerFilters
source: Filter songs from the queue
ta: வரிசையில் இருந்து பாடல்களை வடிகட்டவும்

# setting.playerFilters_description
source: omit songs from being added to the queue based on the following criteria
ta: பின்வரும் அளவுகோல்களின் அடிப்படையில் பாடல்களை வரிசையில் சேர்க்காமல் தவிர்க்கவும்

# setting.playbackStyle_description
source: select the playback style to use for the audio player
ta: ஆடியோ பிளேயருக்கு பயன்படுத்த பிளேபேக் பாணியைத் தேர்ந்தெடுக்கவும்

# setting.playbackStyle_optionCrossFade
source: crossfade
ta: கிராச்ஃபேட்

# setting.playbackStyle_optionNormal
source: normal
ta: சாதாரண

# setting.playbackStyle
source: playback style
ta: பிளேபேக் பாணி

# setting.playButtonBehavior_description
source: sets the default behavior of the play button when adding songs to the queue
ta: வரிசையில் பாடல்களைச் சேர்க்கும்போது ப்ளே பொத்தானின் இயல்புநிலை நடத்தை அமைக்கிறது

# setting.playButtonBehavior
source: play button behavior
ta: பொத்தான் நடத்தை விளையாடுங்கள்

# setting.artistRadioCount_description
source: sets the number of songs to fetch for artist radio and track radio
ta: கலைஞர் வானொலி மற்றும் ட்ராக் வானொலிக்கான பாடல்களின் எண்ணிக்கையை அமைக்கிறது

# setting.artistRadioCount
source: artist/track radio count
ta: கலைஞர்/டிராக் ரேடியோ எண்ணிக்கை

# setting.imageResolution
source: image resolution
ta: படத்தின் தீர்மானம்

# setting.imageResolution_description
source: the resolution for the images used around the app. using a value of 0 will default to the native image resolution
ta: பயன்பாட்டைச் சுற்றிப் பயன்படுத்தப்படும் படங்களுக்கான தீர்மானம். 0 இன் மதிப்பைப் பயன்படுத்துவது இயல்பான படத் தீர்மானத்திற்கு இயல்புநிலையாக இருக்கும்

# setting.imageResolution_optionTable
source: table
ta: அட்டவணை
