Repository: 247i/TACETr
Catalog: உரை/தானி/foss-warn-foss-warn-app-*.po
Languages: ta

# explanation_CBRNE_text
source: Information in the event of incidents involving chemical, biological, radiological, nuclear and explosive substances.
ta: வேதியியல், உயிரியல், கதிரியக்க, அணு மற்றும் வெடிக்கும் பொருட்கள் சம்பந்தப்பட்ட சம்பவங்கள் ஏற்பட்டால் தகவல்கள்.

# explanation_environment
source: Environment
ta: சூழல்

# explanation_environment_text
source: Information during natural events such as storm surges
ta: புயல் எழுச்சி போன்ற இயற்கை நிகழ்வுகளின் போது தகவல்கள்

# explanation_weather
source: Weather
ta: வானிலை

# explanation_weather_text
source: Information in case of meteorological events such as storm squalls and floods.
ta: புயல் சதுரங்கள் மற்றும் வெள்ளம் போன்ற வானிலை நிகழ்வுகளின் செய்தி.

# explanation_safety
source: Safety
ta: பாதுகாப்பு

# explanation_safety_text
source: Information in case of police reports
ta: பொலிச் அறிக்கைகள் ஏற்பட்டால் செய்தி

# explanation_other
source: Other
ta: மற்றொன்று

# explanation_other_text
source: Information with other messages
ta: பிற செய்திகளுடன் செய்தி

# explanation_transport
source: Transport
ta: போக்குவரத்து

# explanation_rescue
source: Rescue
ta: மீட்பு

# delete_place_headline
source: Delete place?
ta: இடத்தை நீக்கவா?

# delete_place_confirmation
source: Are you sure you want to delete this place?
ta: இந்த இடத்தை நீக்க விரும்புகிறீர்களா?

# delete_place_delete
source: Delete
ta: நீக்கு

# delete_place_cancel
source: Cancel
ta: ரத்துசெய்

# delete_place_error
source: Can not remove place. Please check your internet connection.
ta: இடத்தை அகற்ற முடியாது. உங்கள் இணைய இணைப்பை சரிபார்க்கவும்.

# explanation_warning_level_headline
source: Warning levels
ta: எச்சரிக்கை நிலைகள்

# explanation_warning_level_attention
source: Attention
ta: கவனம்

# explanation_warning_level_attention_text
source: New report on an acute and current threat.
ta: கடுமையான மற்றும் தற்போதைய அச்சுறுத்தல் குறித்த புதிய அறிக்கை.

# explanation_warning_level_update
source: Update
ta: புதுப்பிப்பு

# explanation_warning_level_update_text
source: Update of a previous message.
ta: முந்தைய செய்தியின் புதுப்பிப்பு.

# explanation_warning_level_all_clear
source: All clear
ta: அனைத்தும் தெளிவாக

# explanation_warning_level_all_clear_text
source: All-clear for a previous message. Most of the time the warning is now lifted.
ta: முந்தைய செய்திக்கு அனைத்தையும் தெளிவுபடுத்துங்கள். பெரும்பாலான நேரங்களில் எச்சரிக்கை இப்போது நீக்கப்பட்டுள்ளது.

# explanation_warning_level_ack
source: Acknowledged
ta: ஒப்புக்கொள்ளப்பட்டது

# explanation_warning_level_error
source: Error
ta: பிழை

# my_place_warnings_count
source: There {count, plural, =0{are no warnings} =1{is one warning} other{are {count} warnings}}
ta: அங்கு {count, plural, =0{are no warnings} =1{is one warning} other{{count} முன்னறிவிப்புகள்}}

# warning_widget_and
source: and
ta: மற்றும்

# warning_widget_other
source: other
ta: மற்றொன்று

# warning_widget_unknown
source: unknown
ta: தெரியவில்லை

# legacy_warning_dialog_title
source: Version updated to
ta: பதிப்பு புதுப்பிக்கப்பட்டது

# legacy_warning_dialog_text
source: FOSS Warn has been upgraded to its latest iteration, introducing several changes. One of them is a map view, which displays the area of an alert on a map. As part of this update, FOSSWarn utilizes an updated list of places. Therefore, you have to migrate from old places to new ones. The process should automatically work if you press the `start auto migration` button. It will remove the old places and will try to add the same place from the new list. Some places may not be available anymore as the old list contains some nonvalid places. Please check if all your selected places are migrated successfully and add missing places manually. We apologize for any inconvenience.
ta: FOSS WARN அதன் அண்மைக் கால மறு செய்கைக்கு மேம்படுத்தப்பட்டுள்ளது, பல மாற்றங்களை அறிமுகப்படுத்துகிறது. அவற்றில் ஒன்று வரைபடக் காட்சி, இது ஒரு வரைபடத்தில் எச்சரிக்கையின் பகுதியைக் காட்டுகிறது. இந்த புதுப்பிப்பின் ஒரு பகுதியாக, ஃபோச்வர்ன் புதுப்பிக்கப்பட்ட இடங்களின் பட்டியலைப் பயன்படுத்துகிறது. எனவே, நீங்கள் பழைய இடங்களிலிருந்து புதிய இடங்களுக்கு இடம்பெயர வேண்டும். நீங்கள் `தொடக்க ஆட்டோ இடம்பெயர்வு` பொத்தானை அழுத்தினால் செயல்முறை தானாகவே செயல்பட வேண்டும். இது பழைய இடங்களை அகற்றும், மேலும் புதிய பட்டியலிலிருந்து அதே இடத்தைச் சேர்க்க முயற்சிக்கும். பழைய பட்டியலில் சில செல்லாத இடங்கள் இருப்பதால் சில இடங்கள் இனி கிடைக்காது. நீங்கள் தேர்ந்தெடுத்த இடங்கள் அனைத்தும் வெற்றிகரமாக இடம்பெயர்ந்து காணாமல் போன இடங்களை கைமுறையாக சேர்க்கின்றனவா என்பதை சரிபார்க்கவும். ஏதேனும் சிரமத்திற்கு நாங்கள் மன்னிப்பு கோருகிறோம்.

# notification_settings_slidervalue_extreme
source: extreme
ta: எக்ச்ட்ரீம்

# notification_settings_slidervalue_moderate
source: moderate
ta: மிதமான

# notification_settings_slidervalue_severe
source: severe
ta: கடுமையான

# notification_settings_slidervalue_minor
source: minor
ta: சிறிய

# source_other_description
source: General setting that is used if no more precise setting has been made.
ta: இன்னும் துல்லியமான அமைப்பு செய்யப்படாவிட்டால் பயன்படுத்தப்படும் பொதுவான அமைப்பு.

# source_other_title
source: Other
ta: மற்றொன்று

# notification_settings_open_severity_explanation
source: Explanations of the degree of severity
ta: தீவிரத்தின் அளவு பற்றிய விளக்கங்கள்

# notification_settings_description
source: Here you can set the warning level for each source for which you want to receive a warning.
ta: நீங்கள் ஒரு எச்சரிக்கையைப் பெற விரும்பும் ஒவ்வொரு மூலத்திற்கும் எச்சரிக்கை அளவை இங்கே அமைக்கலாம்.

# warning_severity_explanation_dialog_severe_description
source: Significant threat to life or property. May affect your health, property and/or public infrastructure.
ta: வாழ்க்கை அல்லது சொத்துக்கு குறிப்பிடத்தக்க அச்சுறுத்தல். உங்கள் உடல்நலம், சொத்து மற்றும்/அல்லது பொது உள்கட்டமைப்பை பாதிக்கலாம்.

# warning_severity_explanation_dialog_moderate_description
source: A warning of a possible threat to life or property. Can severely disrupt normal daily routines.
ta: வாழ்க்கை அல்லது சொத்துக்கு அச்சுறுத்தல் பற்றிய எச்சரிக்கை. சாதாரண அன்றாட நடைமுறைகளை கடுமையாக சீர்குலைக்கும்.

# warning_severity_explanation_dialog_minor_description
source: Minimal to no known threat to life or property. May interfere with normal daily activities.
ta: வாழ்க்கை அல்லது சொத்துக்கு அறியப்பட்ட அச்சுறுத்தல் இல்லை. சாதாரண அன்றாட நடவடிக்கைகளில் தலையிடலாம்.

# warning_severity_explanation_dialog_extreme_description
source: Extraordinary threat to life or property. May have a significant short-term impact on your health, property and/or public infrastructure.
ta: வாழ்க்கை அல்லது சொத்துக்கு அசாதாரண அச்சுறுத்தல். உங்கள் உடல்நலம், சொத்து மற்றும்/அல்லது பொது உள்கட்டமைப்பில் குறிப்பிடத்தக்க குறுகிய கால தாக்கத்தை ஏற்படுத்தக்கூடும்.

# warning_severity_explanation_dialog_update_description
source: Update of an already notified alert
ta: புதுப்பிப்பு of an already notified alert

# warning_severity_explanation_dialog_headline
source: Severity
ta: தீவிரம்

# warning_severity_minor
source: Minor
ta: சிறிய

# warning_severity_moderate
source: Moderate
ta: மிதமான

# warning_severity_severe
source: Severe
ta: கடுமையான

# warning_severity_extreme
source: Extreme
ta: எக்ச்ட்ரீம்

# warning_severity_unknown
source: Unknown
ta: தெரியவில்லை

# warning_widget_update_thread_tooltip
source: Show the update thread of this alert
ta: இந்த எச்சரிக்கையின் புதுப்பிப்பு நூலைக் காட்டு

# meta_info_for_place_dialog_latitude
source: Latitude
ta: அகலாங்கு

# meta_info_for_place_dialog_headline
source: Detailed information on
ta: பற்றிய விரிவான தகவல்கள்

# meta_info_for_place_dialog_longitude
source: Longitude
ta: நெட்டாங்கு

# meta_info_for_place_dialog_bounding_box_max
source: Bounding box max
ta: எல்லை பெட்டி அதிகபட்சம்

# meta_info_for_place_dialog_bounding_box_min
source: Bounding box min
ta: எல்லை பெட்டி மணித்துளி

# meta_info_for_place_dialog_subscription_id
source: Subscription ID
ta: சந்தா ஐடி

# main_app_bar_action_sort_tooltip
source: Open dialog to sort alerts
ta: விழிப்பூட்டல்களை வரிசைப்படுத்த உரையாடல்

# notification_no_places_selected_body
source: Please check your selection
ta: உங்கள் தேர்வை சரிபார்க்கவும்

# notification_no_places_selected_title
source: You haven't selected a place yet
ta: நீங்கள் இன்னும் ஒரு இடத்தைத் தேர்ந்தெடுக்கவில்லை

# warning_status_actual
source: actual
ta: உண்மையான

# warning_status_exercise
source: excercise
ta: உடற்பயிற்சி

# warning_status_system
source: system
ta: மண்டலம்

# warning_status_test
source: test
ta: தேர்வு

# warning_status_draft
source: draft
ta: வரைவு

# warning_urgency_immediate
source: immediate
ta: உடனடியாக

# warning_urgency_expected
source: expected
ta: எதிர்பார்க்கப்படுகிறது

# warning_urgency_future
source: future
ta: எதிர்காலம்

# warning_urgency_past
source: past
ta: கடந்த

# warning_urgency_unknown
source: unknown
ta: தெரியவில்லை

# add_my_place_with_map_add_place_button
source: Add place
ta: இடம் சேர்க்கவும்

# warning_certainty_observed
source: observed
ta: கவனிக்கப்பட்டது

# warning_certainty_likely
source: likely
ta: நிகழக்கூடிய

# warning_certainty_possible
source: possible
ta: நிகழக்கூடிய

# warning_certainty_unlikely
source: unlikely
ta: சாத்தியமில்லை

# warning_certainty_unknown
source: unknown
ta: தெரியவில்லை

# warning_certainty_other
source: other
ta: மற்றொன்று

# warning_scope_public
source: Public
ta: பொது

# warning_scope_restricted
source: Restricted
ta: தடைசெய்யப்பட்டது

# warning_scope_private
source: Private
ta: தனிப்பட்ட

# map_view_warning_overview_no_alerts
source: There are no alerts
ta: எச்சரிக்கைகள் எதுவும் இல்லை

# map_view_filter_chips_tooltip_show
source: show
ta: காட்டு

# map_view_filter_chips_tooltip_select_filter
source: Select filter
ta: வடிகட்டியைத் தேர்ந்தெடுக்கவும்

# map_view_filter_chips_tooltip_hide
source: hide
ta: மறை

# my_places_view_add_new_place_button_tooltip
source: open new page to add a place
ta: ஒரு இடத்தைச் சேர்க்க புதிய பக்கத்தைத் திறக்கவும்

# warning_detail_view_map_center_map_button_tooltip
source: Center map
ta: மைய வரைபடம்

# loading_screen_loading
source: Loading
ta: ஏற்றுகிறது

# loading_screen_wait_for_push_to_complete
source: Wait for push registration to complete.
ta: Wait க்கு push registration பெறுநர் complete.

# add_my_place_with_map_loading_screen_subscription_error
source: Something went wrong. Can not subscribe. Please try again later. The server responded with {error}
ta: ஏதோ தவறு நடந்தது. குழுசேர முடியாது. தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும். சேவையகம் {error} உடன் பதிலளித்தது

# add_my_place_with_map_loading_screen_subscription_success
source: successfully subscribed
ta: வெற்றிகரமாக குழுசேர்ந்தது

# add_my_place_with_map_select_area_size
source: Select area size
ta: பகுதி அளவைத் தேர்ந்தெடுக்கவும்

# add_my_place_with_map_loading_screen_searching
source: searching…
ta: தேடுகிறது…

# add_my_place_with_map_loading_screen_search_no_result_found
source: No results found. Please try again
ta: முடிவுகள் எதுவும் கிடைக்கவில்லை. மீண்டும் முயற்சிக்கவும்

# choose_theme_dialog_headline
source: Select color theme
ta: வண்ண கருப்பொருள் என்பதைத் தேர்ந்தெடுக்கவும்

# choose_theme_dialog_choose_accent_color
source: Choose accent color
ta: உச்சரிப்பு நிறத்தைத் தேர்வுசெய்க

# legacy_warning_dialog_migration_button
source: start auto migration
ta: ஆட்டோ இடம்பெயர்வு தொடங்கவும்

# add_my_place_with_map_loading_screen_search_error
source: Something went wrong. Please try it again later.
ta: ஏதோ தவறு நடந்தது. தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும்.

# error_dialog_text_privacy
source: The log does not contain any privacy sensitive information beside maybe your selected place. FOSS Warn also does not send any log information to a server.
ta: பதிவில் நீங்கள் தேர்ந்தெடுக்கப்பட்ட இடத்தைத் தவிர வேறு எந்த தனியுரிமை முக்கியமான தகவல்களும் இல்லை. Foss எச்சரிக்கையும் ஒரு சேவையகத்திற்கு எந்த பதிவு தகவலையும் அனுப்பாது.

# error_dialog_text_introduction
source: FOSS Warn has noticed an error. If this error persists, please contact the developer and attach the following log:
ta: ஃபோச் முன்னறிவிப்பு ஒரு பிழையைக் கவனித்துள்ளது. இந்த பிழை தொடர்ந்தால், தயவுசெய்து டெவலப்பரைத் தொடர்புகொண்டு பின்வரும் பதிவை இணைக்கவும்:

# app_error_message
source: Ups. Something went wrong. Please contact the developer
ta: யுபிஎச். ஏதோ தவறு நடந்தது. டெவலப்பரைத் தொடர்பு கொள்ளவும்

# error_dialog_headline
source: Oh no - something went wrong :(
ta: ஓ இல்லை - ஏதோ தவறு நடந்தது :(

# error_dialog_text_instructions_text
source: - Check your internet connection - Check if the issue is persistent - write an E-Mail to: foss-warn@posteo.de - or open an Github Issue
ta: - உங்கள் இணைய இணைப்பை சரிபார்க்கவும் - சிக்கல் தொடர்ந்து இருக்கிறதா என்று சரிபார்க்கவும் -இதற்கு ஒரு மின்னஞ்சல் எழுதுங்கள்: foss-warn@posteo.de - அல்லது ஒரு அறிவிலிமையம் சிக்கலைத் திறக்கவும்

# error_dialog_text_instructions_headline
source: What should I do now?
ta: நான் இப்போது என்ன செய்ய வேண்டும்?

# welcome_view_foss_public_alert_server_headline
source: FOSS Public Alert Server
ta: பொது முன்னறிவிப்பு சேவையகத்தைப் பயன்படுத்துங்கள்

# welcome_view_foss_public_alert_server_text
source: FOSS Warn now uses the FOSS Public Alert Server as the backend. This allows us to deliver push notifications and support more areas worldwide. The FOSS Public Alert Server is developed by the FOSS Warn team in cooperation with KDE.
ta: FOSS முன்னறிவிப்பு இப்போது FOSS பொது முன்னறிவிப்பு சேவையகத்தை பின்தளத்தில் பயன்படுத்துகிறது. இது புச் அறிவிப்புகளை வழங்கவும், உலகளவில் அதிகமான பகுதிகளை ஆதரிக்கவும் அனுமதிக்கிறது. FOSS பொது முன்னறிவிப்பு சேவையகம் KDE உடன் ஒத்துழைப்புடன் FOSS முன்னறிவிப்பு குழுவால் உருவாக்கப்பட்டது.

# welcome_view_notification_permission_text
source: FOSSWarn needs your permission to send you notifications in case there are alerts for your area. Press the button below to open the permission dialog.
ta: உங்கள் பகுதிக்கு எச்சரிக்கைகள் இருந்தால் உங்களுக்கு அறிவிப்புகளை அனுப்ப ஃபோச்வர்ன் உங்கள் இசைவு தேவை. இசைவு உரையாடலைத் திறக்க கீழே உள்ள பொத்தானை அழுத்தவும்.

# welcome_view_foss_public_alert_server_select_instance
source: Select server instance
ta: சேவையக உதாரணத்தைத் தேர்ந்தெடுக்கவும்

# welcome_view_notification_permission_headline
source: Notification permission
ta: அறிவிப்பு இசைவு

# welcome_view_alarm_permission_headline
source: Alarm permission
ta: அலாரம் இசைவு

# welcome_view_alarm_permission_text
source: FOSSWarn needs your permission to schedule exact alarms. Press on the button below to open the permission dialog.
ta: சரியான அலாரங்களை திட்டமிட ஃபோச்வர்னுக்கு உங்கள் இசைவு தேவை. இசைவு உரையாடலைத் திறக்க கீழே உள்ள பொத்தானை அழுத்தவும்.

# welcome_view_foss_public_alert_server_select_instance_helptext
source: Why do I need to select a server?
ta: நான் ஏன் ஒரு சேவையகத்தைத் தேர்ந்தெடுக்க வேண்டும்?

# welcome_view_request_permission
source: Request permission
ta: இசைவு கோருங்கள்

# settings_foss_public_alert_server_enter_url_label_text
source: Enter FPAS Server URL
ta: FPAS சேவையக முகவரி ஐ உள்ளிடவும்

# settings_foss_public_alert_server_enter_url_error
source: Invalid Server URL
ta: தவறான சேவையக முகவரி

# welcome_view_foss_public_alert_server_server_operator
source: This server is operated by:
ta: இந்த சேவையகம் இயக்கப்படுகிறது:

# welcome_view_foss_public_alert_server_use_custom_server
source: Use custom server
ta: தனிப்பயன் சேவையகத்தைப் பயன்படுத்தவும்

# welcome_view_foss_public_alert_server_confirm_button
source: Confirm
ta: உறுதிப்படுத்தவும்

# welcome_view_foss_public_alert_server_confirm_success
source: Confirmed
ta: உறுதிப்படுத்தப்பட்டது

# welcome_view_foss_public_alert_server_use_default_server
source: Use default server
ta: இயல்புநிலை சேவையகத்தைப் பயன்படுத்தவும்

# alert_publisher_unknown
source: Unknown
ta: தெரியவில்லை

source: Failed to open URL
ta: முகவரி ஐ திறக்கத் தவறிவிட்டது

# error_dialog_description
source: FOSSWarn has noticed an error. Please report the error and attach the following log.
ta: ஃபோச்வர்ன் ஒரு பிழையை கவனித்திருக்கிறார். பிழையைப் புகாரளித்து பின்வரும் பதிவை இணைக்கவும்.

# error_dialog_privacy
source: The log does not contain any privacy-sensitive information besides maybe your selected places. FOSSWarn does not send any logs to a server.
ta: நீங்கள் தேர்ந்தெடுக்கப்பட்ட இடங்களைத் தவிர வேறு எந்த தனியுரிமை-உணர்திறன் தகவலும் பதிவில் இல்லை. ஃபோச்வர்ன் எந்த பதிவுகளையும் ஒரு சேவையகத்திற்கு அனுப்பாது.

# error_dialog_instruction_headline
source: What should I do now?
ta: நான் இப்போது என்ன செய்ய வேண்டும்?

# error_dialog_instruction_body
source: 1. Check if the error is just because of a missing internet connection 2. Check if there is already an open issue on GitHub 3. Find the relevant part of the log. If the same error message occurs multiple times in the log, sending just one error message is enough. 4. Open a new issue or write an email to foss-warn@posteo.de
ta: 1. இணைய இணைப்பு காணாமல் போனதால் பிழை இருக்கிறதா என்று சரிபார்க்கவும் 2. கிட்அப்பில் ஏற்கனவே திறந்த சிக்கல் இருக்கிறதா என்று சோதிக்கவும் 3. பதிவின் தொடர்புடைய பகுதியைக் கண்டறியவும். பதிவில் அதே பிழை செய்தி பல முறை ஏற்பட்டால், ஒரு பிழை செய்தியை அனுப்புவது போதுமானது. 4. ஒரு புதிய சிக்கலைத் திறக்கவும் அல்லது foss-warn@posteo.de க்கு மின்னஞ்சல் எழுதவும்

# error_dialog_hide_error_bar
source: Hide error bar
ta: பிழை பட்டியை மறைக்கவும்

# error_dialog_copy
source: copy error log
ta: பிழை பதிவை நகலெடுக்கவும்

# error_dialog_copy_success
source: copied
ta: நகலெடுக்கப்பட்டது

# error_log_viewer_title
source: Log file Viewer
ta: பதிவு கோப்பு பார்வையாளர்

# error_log_viewer_headline
source: Here you can read the error log for FOSSWarn
ta: ஃபோச்வர்னுக்கான பிழை பதிவை இங்கே படிக்கலாம்

# error_log_button_delete
source: Delete
ta: நீக்கு

# error_log_button_share
source: Share logfile
ta: உள்நுழைவு பகிர்வு

# error_log_share_info
source: Error log shared from FOSSWarn
ta: ஃபோச்வர்னில் இருந்து பகிரப்பட்ட பிழை பதிவு

# dev_settings_subscribe_for_test_alert
source: Subscribe for technical test alerts from the FOSS Public Alert Server
ta: FOSS பொது முன்னறிவிப்பு சேவையகத்திலிருந்து தொழில்நுட்ப சோதனை விழிப்பூட்டல்களுக்கு குழுசேரவும்

# dev_settings_troubleshoot_notifications
source: Troubleshoot notifications
ta: அறிவிப்புகளை சரிசெய்யவும்

# invalid_subscription_dialog_headline
source: Renew expired subscriptions
ta: காலாவதியான சந்தாக்களை புதுப்பிக்கவும்

# invalid_subscription_dialog_text
source: Some of your subscriptions have expired. Click on resubscribe to get push notifications again
ta: உங்கள் சில சந்தாக்கள் காலாவதியானன. புச் அறிவிப்புகளை மீண்டும் பெற retubscribe இல் சொடுக்கு செய்க

# invalid_subscription_dialog_resubscribe_button
source: resubscribe
ta: மறுபயன்பாடு

# invalid_subscription_dialog_loading_indicator_replace_places
source: replacing the old places...
ta: பழைய இடங்களை மாற்றுவது ...

# invalid_subscription_dialog_error_body
source: Oh no, failed to resubscribe.
ta: ஓ, மறுபரிசீலனை செய்யத் தவறிவிட்டது.

# invalid_subscription_dialog_error_status_code
source: HTTP Status code: {status_code}
ta: HTTP நிலை code: {status_code}

# invalid_subscription_dialog_error_message
source: Error message: {message}
ta: பிழை செய்தி: {message}

# invalid_subscription_dialog_successfully_resubscribed
source: Successfully resubscribed
ta: வெற்றிகரமாக மறுபரிசீலனை செய்யப்பட்டது

# notification_channel_other_name
source: Other
ta: மற்றொன்று

# notification_channel_other_description
source: Other notifications
ta: பிற அறிவிப்புகள்

# notification_group_name
source: FOSSWarn notifications
ta: ஃபோச்வர்ன் அறிவிப்புகள்

# notification_group_description
source: There are multiple notifications from FOSSWarn
ta: There அரே multiple notifications இருந்து FOSSWarn

# notification_alert_new_title
source: New alert for {place}
ta: புதிய alert க்கு {place}

# notification_alert_update_title
source: Updated alert for {place}
ta: {place}

# troubleshoot_notification_title
source: Troubleshoot notifications
ta: அறிவிப்புகளை சரிசெய்யவும்

# troubleshoot_notification_register_state
source: Currently registered? {state}
ta: தற்போது பதிவு செய்யப்பட்டுள்ளதா? {state}

# troubleshoot_notification_current_endpoint
source: Current endpoint: {endpoint}
ta: மின்னோட்ட்ம், ஓட்டம் endpoint: {endpoint}

# troubleshoot_notification_current_vapid_key
source: Current VAPID key: {key}
ta: தற்போதைய VAPID விசை: {key}

# troubleshoot_notification_current_public_key
source: Current public key: {key}
ta: மின்னோட்ட்ம், ஓட்டம் public key: {key}

# troubleshoot_notification_current_auth_key
source: Current auth key: {key}
ta: தற்போதைய அங்கீகார விசை: {key}

# troubleshoot_notification_reset_push_setup
source: Reset push setup
ta: புச் அமைப்பை மீட்டமைக்கவும்

# troubleshoot_notification_unregister_for_push
source: Unregister
ta: பதிவு செய்யப்படாதது

# troubleshoot_notification_resubscribe
source: Re-subscribe for places with new push config
ta: Re-subscribe க்கு places with புதிய push கட்டமைப்பு

# no_up_distributor_found_dialog_title
source: No push distributor found
ta: இல்லை push distributor found

# no_up_distributor_found_dialog_explanation
source: FOSSWarn couldn't find any UnifiedPush distributor installed on your device. To subscribe to an area, you must have one installed, or you won't get any notifications. Please install a distributor and retry the subscription.
ta: உங்கள் சாதனத்தில் நிறுவப்பட்ட எந்தவொரு ஒருங்கிணைந்த புச் விநியோகச்தரையும் ஃபோச்வர்ன் கண்டுபிடிக்க முடியவில்லை. ஒரு பகுதிக்கு குழுசேர, நீங்கள் ஒன்றை நிறுவ வேண்டும், அல்லது உங்களுக்கு எந்த அறிவிப்பும் கிடைக்காது. தயவுசெய்து ஒரு விநியோகச்தரை நிறுவி சந்தாவை மீண்டும் முயற்சிக்கவும்.

# no_up_distributor_found_up_explanation_button
source: What is unifiedPush and how to install a distributor?
ta: What is unifiedPush and how பெறுநர் install a distributor?

# no_up_distributor_found_direct_link_to_ntfy
source: For the fast ones: ntfy on F-Droid (requires changing the default server)
ta: க்கு the fast ones: ntfy on F-Droid (requires changing the இயல்புநிலை server)
