Repository: 247i/TACETr
Catalog: உரை/தானி/foss-warn-foss-warn-app-*.po
Languages: ta

# main_nav_bar_all_warnings
source: All warnings
ta: அனைத்து எச்சரிக்கைகள்

# main_nav_bar_my_places
source: My places
ta: என் இடங்கள்

# main_nav_bar_map
source: Map
ta: வரைபடம்

# main_dot_menu_settings
source: Settings
ta: அமைப்புகள்

# main_dot_menu_about
source: About
ta: பற்றி

# main_app_bar_tooltip_mark_all_warnings_as_read
source: mark warnings as read
ta: எச்சரிக்கைகளை வாசித்தபடி குறிக்கவும்

# main_app_bar_tooltip_show_menu
source: show menu
ta: மெனுவைக் காட்டு

# main_dialog_understand
source: understood
ta: புரிந்து கொள்ளப்பட்டது

# main_dialog_save
source: Save
ta: சேமி

# main_dialog_close
source: Close
ta: மூடு

# all_warnings_no_places_chosen
source: No places are selected
ta: எந்த இடங்களும் தேர்ந்தெடுக்கப்படவில்லை

# all_warnings_no_places_chosen_text
source: Please press the plus to add a place
ta: ஒரு இடத்தைச் சேர்க்க பிளசை அழுத்தவும்

# all_warnings_failed_to_fetch_alerts
source: Failed to fetch alerts
ta: விழிப்பூட்டல்களைப் பெறுவதில் தோல்வி

# all_warnings_nothing_to_show
source: Nothing to see here
ta: இங்கே பார்க்க எதுவும் இல்லை

# all_warnings_nothing_to_show_text
source: FOSS Warn has nothing to show here
ta: ஃபோச் எச்சரிக்கை இங்கே காட்ட எதுவும் இல்லை

# all_warnings_everything_ok
source: Everything is fine
ta: எல்லாம் நன்றாக இருக்கிறது

# all_warnings_everything_ok_text
source: There are no warnings for you
ta: உங்களுக்கு எந்த எச்சரிக்கையும் இல்லை

# all_warnings_reload
source: Reload
ta: ஏற்றவும்

# my_place_warning_found
source: There are warnings for you
ta: உங்களுக்காக எச்சரிக்கைகள் உள்ளன

# my_place_no_place_added
source: No place is selected
ta: எந்த இடமும் தேர்ந்தெடுக்கப்படவில்லை

# my_place_no_place_added_text
source: Please selected a place first
ta: முதலில் ஒரு இடத்தைத் தேர்ந்தெடுத்தார்

source: Settings
ta: அமைப்புகள்

# settings_notification
source: Notifications
ta: அறிவிப்புகள்

# settings_android_notification_settings
source: Open Android notifications settings
ta: ஆண்ட்ராய்டு அறிவிப்புகள் அமைப்புகளைத் திறக்கவும்

# settings_app_notification_settings
source: Open notifications settings
ta: திறந்த அறிவிப்புகள் அமைப்புகள்

# settings_show_status_notification_title
source: Show status notification
ta: நிலை அறிவிப்பைக் காட்டு

# settings_show_status_notification_subtitle
source: Displays a notification with the time of the last update
ta: கடைசி புதுப்பிப்பின் நேரத்துடன் அறிவிப்பைக் காட்டுகிறது

# settings_background_service
source: Background updates
ta: பின்னணி புதுப்பிப்புகள்

# settings_frequent_of_background_update
source: Frequency of background updates
ta: பின்னணி புதுப்பிப்புகளின் அதிர்வெண்

# settings_frequent_of_background_update_minute
source: min
ta: மணித்துளி

# settings_display
source: Display
ta: காட்சி

# settings_start_view
source: Start view
ta: பார்வையைத் தொடங்குங்கள்

# settings_start_view_all_warnings
source: All warnings
ta: அனைத்து எச்சரிக்கைகள்

# settings_start_view_only_my_places
source: My places
ta: என் இடங்கள்

# settings_show_extended_metadata
source: Show extended metadata
ta: நீட்டிக்கப்பட்ட மெட்டாடேட்டாவைக் காட்டு

# settings_color_schema
source: Colour scheme
ta: வண்ணத் திட்டம்

# settings_color_schema_light
source: Light
ta: ஒளி

# settings_color_schema_dark
source: Dark
ta: இருண்ட

# settings_color_schema_auto
source: Automatic
ta: தானியங்கி

# settings_display_all_warnings_title
source: Display all warnings
ta: அனைத்து எச்சரிக்கைகளையும் காண்பி

# settings_display_all_warnings_subtitle
source: Shows all warnings
ta: அனைத்து எச்சரிக்கைகளையும் காட்டுகிறது

# settings_font_size
source: Font size
ta: எழுத்துரு அளவு

# settings_sorting
source: Sorting
ta: வரிசைப்படுத்துதல்

# settings_extended_settings
source: Advanced settings
ta: மேம்பட்ட அமைப்புகள்

# settings_show_welcome_dialog
source: Show welcome dialogue again
ta: வரவேற்பு உரையாடலை மீண்டும் காட்டு

# settings_dev_settings
source: Open developer settings
ta: திறந்த உருவாக்குபவர் அமைப்புகள்

# warning_tags
source: Tags
ta: குறிச்சொற்கள்

# warning_from_title
source: Message from
ta: இருந்து செய்தி

# warning_region_title
source: Region
ta: பகுதி

# warning_type_title
source: Type
ta: வகை

# warning_severity_title
source: Severity
ta: தீவிரம்

# warning_description_title
source: Description
ta: விவரம்

# warning_recommended_action_title
source: Recommended action
ta: பரிந்துரைக்கப்பட்ட செயல்

# warning_source_title
source: Source
ta: மூலம்

# warning_from
source: Message from: {datetime}
ta: இருந்து செய்தி: {datetime}

# warning_context_information
source: Context information:
ta: சூழல் தகவல்:

# warning_effective
source: Effective
ta: பயனுள்ள

# warning_onset
source: Onset
ta: துவக்கம்

# warning_expires
source: Expires
ta: காலாவதியாகிறது

# warning_share
source: Share
ta: பங்கு

# warning_shared_by_foss_warn
source: Shared by FOSS Warn
ta: ஃபோச் எச்சரிக்கையால் பகிரப்பட்டது

# warning_open_picture_with_browser
source: Open picture with browser
ta: உலாவியுடன் படத்தைத் திறக்கவும்

# warning_type
source: Type: {warningType}
ta: தட்டச்சு: {warningType}

# warning_event
source: Event
ta: நிகழ்வு

# warning_severity
source: Severity: {severity}
ta: தீவிரம்: {severity}

# warning_urgency
source: Urgency
ta: விரைவு

# warning_certainty
source: Certainty
ta: உறுதியானது

# warning_scope
source: Scope
ta: நோக்கம்

# warning_identifier
source: ID
ta: ஐடி

# warning_sender
source: Sender
ta: அனுப்புநர்

# warning_status
source: Status
ta: நிலை

# warning_show_more
source: Show more
ta: மேலும் காட்டு

# warning_show_less
source: Show less
ta: குறைவாகக் காட்டு

# warning_appendix
source: Appendix
ta: பின் இணைப்பு

# warning_region
source: Region {region}
ta: பகுதி {region}

# warning_places
source: Places
ta: இடங்கள்

# warning_description
source: Description {description}
ta: விளக்கம் {description}

# warning_recommended_action
source: Recommended action {recommendedAction}
ta: பரிந்துரைக்கப்பட்ட செயல் {recommendedAction}

# warning_source
source: Source {source}
ta: சான்று {source}

# warning_contact
source: Contact
ta: தொடர்பு

# warning_website
source: Website
ta: வலைத்தளம்

# add_new_place_place_name
source: Add a new place
ta: புதிய இடத்தைச் சேர்க்கவும்

# add_new_place
source: Add a new Place
ta: புதிய இடத்தைச் சேர்க்கவும்

# about_headline
source: About
ta: பற்றி

# about_summery
source: This app is a free and open source project and has been created in the hope that it will be useful. Suggestions on how it can be improved or reports on bugs you have experienced are welcome. If you like this app and find it useful, I would love to hear about it.
ta: இந்த பயன்பாடு ஒரு இலவச மற்றும் திறந்த மூலத் திட்டமாகும், மேலும் இது பயனுள்ளதாக இருக்கும் என்ற நம்பிக்கையில் உருவாக்கப்பட்டுள்ளது. இதை எவ்வாறு மேம்படுத்தலாம் அல்லது நீங்கள் அனுபவித்த பிழைகள் குறித்த அறிக்கைகள் வரவேற்கப்படுகின்றன. இந்த பயன்பாட்டை நீங்கள் விரும்பினால், பயனுள்ளதாக இருந்தால், அதைப் பற்றி கேட்க விரும்புகிறேன்.

# about_official_source
source: Official Source
ta: அதிகாரப்பூர்வ சான்று

# about_official_source_subtitle
source: not used
ta: பயன்படுத்தப்படவில்லை

# about_author
source: Author
ta: நூலாசிரியர்

# about_author_subtitle
source: not used
ta: பயன்படுத்தப்படவில்லை

# about_contact
source: Contact
ta: தொடர்பு

# about_contact_subtitle
source: not used
ta: பயன்படுத்தப்படவில்லை

# about_imprint
source: Imprint?
ta: முத்திரை?

# about_imprint_subtitle
source: should there be an imprint here?
ta: இங்கே ஒரு முத்திரை இருக்க வேண்டுமா?

# about_privacy
source: Privacy
ta: தனியுரிமை

# about_privacy_subtitle
source: Everything the app does and does not do
ta: பயன்பாடு செய்யும் மற்றும் செய்யாத அனைத்தும்

# about_disclaimer
source: Disclaimer
ta: மறுப்பு

# about_disclaimer_subtitle
source: What Foss warn cannot do
ta: ஃபோச் எச்சரிக்கை என்ன செய்ய முடியாது

# about_version
source: Version
ta: பதிப்பு

# about_licence
source: License
ta: உரிமம்

# about_other_license
source: Other License
ta: பிற உரிமம்

# about_other_license_subtitle
source: FOSS Warn uses other useful software
ta: FOSS எச்சரிக்கை பிற பயனுள்ள மென்பொருளைப் பயன்படுத்துகிறது

# about_contributors
source: Contributors
ta: பங்களிப்பாளர்கள்

# about_contributors_subtitle
source: people who have contributed to FOSS Warn
ta: FOSS எச்சரிக்கைக்கு பங்களித்தவர்கள்

# about_sourcecode
source: Sourcecode
ta: சோர்ச் கோட்

# about_sourcecode_subtitle
source: Soon on floppy, meanwhile on github
ta: விரைவில் நெகிழ்ந்து, இதற்கிடையில் கிட்அப்பில்

# privacy_headline
source: Privacy
ta: தனியுரிமை

# privacy_main_text
source: FOSS Warn does not send any information about its usage and only connects to the following services: - the FPAS server: this server handles the subscriptions, sends push notifications and can be selected in the settings. - opensteetmap.org: Used to display the map and to search for places. FOSS Warn transmits only the technically necessary data.
ta: FOSS முன்னறிவிப்பு அதன் பயன்பாடு பற்றிய எந்த தகவலையும் அனுப்பாது, மேலும் பின்வரும் சேவைகளுடன் மட்டுமே இணைகிறது: - FPAS சேவையகம்: இந்த சேவையகம் சந்தாக்களைக் கையாளுகிறது, புச் அறிவிப்புகளை அனுப்புகிறது மற்றும் அமைப்புகளில் தேர்ந்தெடுக்கப்படலாம். - OpenSteetMap.org: வரைபடத்தைக் காண்பிப்பதற்கும் இடங்களைத் தேடுவதற்கும் பயன்படுகிறது. FOSS முன்னறிவிப்பு தொழில்நுட்ப ரீதியாக தேவையான தரவை மட்டுமே கடத்துகிறது.

# privacy_link_to_privacy
source: To the privacy policy of
ta: தனியுரிமைக் கொள்கைக்கு

# imprint_headline
source: Imprint
ta: முத்திரை

# imprint_main_text
source: Research on my part could not clearly answer whether software falls under the TMG and thus would be imprint mandatory or not. The vast majority of apps in F-Droid do NOT have an imprint - desktop apps even less. If you know and can give me a clear answer to the question, I would be happy if you contact me. This app is a non-commercial open-source project without journalistic content.
ta: மென்பொருள் டி.எம்.சி.யின் கீழ் வருகிறது, இதனால் பதிக்கப்பட்ட கட்டாயமா இல்லையா என்பதை எனது பங்கைப் பற்றிய ஆராய்ச்சி தெளிவாக பதிலளிக்க முடியவில்லை. எஃப் -டிராய்டில் உள்ள பெரும்பாலான பயன்பாடுகளுக்கு முத்திரை இல்லை - டெச்க்டாப் பயன்பாடுகள் இன்னும் குறைவாக இல்லை. உங்களுக்குத் தெரிந்தால், கேள்விக்கு ஒரு தெளிவான பதிலைக் கொடுக்க முடிந்தால், நீங்கள் என்னைத் தொடர்பு கொண்டால் நான் மகிழ்ச்சியாக இருப்பேன். இந்த பயன்பாடு செய்தித் தாள் உள்ளடக்கம் இல்லாமல் வணிகரீதியான திறந்த மூல திட்டமாகும்.

# source_headline
source: Source
ta: மூலம்

# source_mowas_description
source: Federal Office of Civil Protection and Disaster Assistance - warns of disasters
ta: குடிமை பாதுகாப்பு மற்றும் பேரழிவு உதவி கூட்டாட்சி அலுவலகம் - பேரழிவுகளை எச்சரிக்கிறது

# source_biwapp_title
source: Biwapp (Citizen Info & Warning App)
ta: BWAPP (குடிமக்கள் செய்தி மற்றும் எச்சரிக்கை பயன்பாடு)

# source_katwarn_description
source: Developed by the Fraunhofer-Gesellschaft - warns e.g. in case of: Major fire, bomb discovery and environmental disaster
ta: Fraunhofer -gesellschaft ஆல் உருவாக்கப்பட்டது - எச்சரிக்கிறது எ.கா. விசயத்தில்: பெரிய தீ, வெடிகுண்டு கண்டுபிடிப்பு மற்றும் சுற்றுச்சூழல் பேரழிவு

# source_dwd_title
source: DWD (German Weather Service)
ta: டி.டபிள்யூ.டி (செர்மன் வானிலை சேவை)

# source_lhp_title
source: LHP (Interstate Flood Portal)
ta: எல்.எச்.பி (இன்டர்ச்டேட் வெள்ள போர்டல்)

# status_headline
source: Status
ta: நிலை

# status_source_status
source: Source status
ta: மூல நிலை

# status_server_not_reachable
source: Server not reachable
ta: சேவையகம் அடைய முடியாது

# status_error_while_parsing
source: Error while parsing
ta: பாகுபடுத்தும் போது பிழை

# status_everything_ok
source: Everything is fine
ta: எல்லாம் நன்றாக இருக்கிறது

# status_count_of_message
source: Count of message
ta: செய்தியின் எண்ணிக்கை

# notification_settings_headline
source: Notification Settings
ta: அறிவிப்பு அமைப்புகள்

# notification_settings_notify_by
source: Notify by
ta: மூலம் அறிவிக்கவும்

# notification_settings_notify_by_extreme
source: Extreme Messages
ta: தீவிர செய்திகள்

# notification_settings_notify_by_severe
source: Severe Messages
ta: கடுமையான செய்திகள்

# notification_settings_notify_by_moderate
source: Moderate Messages
ta: மிதமான செய்திகள்

# notification_settings_notify_by_minor
source: Minor Messages
ta: சிறிய செய்திகள்

# notification_settings_notify_by_update
source: Update Messages
ta: செய்திகளைப் புதுப்பிக்கவும்

# notification_settings_thunderstorm
source: Thunderstorm
ta: இடியுடன் கூடிய மழை

# notification_settings_strong_weather
source: Strong weather
ta: வலுவான வானிலை

# notification_settings_everything_else
source: Everything else
ta: மற்ற அனைத்தும்

# notification_settings_everything
source: everything
ta: எல்லாம்

# dev_settings_headline
source: Developer Settings
ta: உருவாக்குபவர் அமைப்புகள்

# dev_settings_delete_list_of_read_warnings
source: Delete list of read warnings
ta: வாசிப்பு எச்சரிக்கைகளின் பட்டியலை நீக்கு

# dev_settings_delete_list_of_read_warnings_text
source: manually clears the saved list of warnings already read.
ta: ஏற்கனவே படித்த எச்சரிக்கைகளின் சேமிக்கப்பட்ட பட்டியலை கைமுறையாக அழிக்கிறது.

# dev_settings_delete_notification_list
source: Delete Notification list
ta: அறிவிப்பு பட்டியலை நீக்கு

# dev_settings_delete_notification_list_text
source: Manually clears the saved list of alerts for which you have already received a notification.
ta: நீங்கள் ஏற்கனவே ஒரு அறிவிப்பைப் பெற்ற விழிப்பூட்டல்களின் சேமிக்கப்பட்ட பட்டியலை கைமுறையாக அழிக்கிறது.

# dev_settings_load_cached_warnings
source: Load cached warnings
ta: தற்காலிக சேமிப்பு எச்சரிக்கைகளை ஏற்றவும்

# dev_settings_load_cached_warnings_text
source: Loads the cached messages
ta: தற்காலிக சேமிப்பு செய்திகளை ஏற்றுகிறது

# dev_settings_success
source: done
ta: முடிந்தது

# dev_settings_collect_system_information_title
source: Collect system information for Troubleshooting
ta: சரிசெய்தலுக்கான கணினி தகவல்களை சேகரிக்கவும்

# dev_settings_collect_system_information_subtitle
source: Collects information about the system that can be sent to the developer for error handling. No data is sent automatically.
ta: பிழை கையாளுதலுக்காக டெவலப்பருக்கு அனுப்பக்கூடிய கணினி பற்றிய தகவல்களை சேகரிக்கிறது. எந்த தரவு தானாக அனுப்பப்படுவதில்லை.

# dev_settings_collect_system_information_snackbar
source: Collecting system information.
ta: கணினி தகவல்களை சேகரித்தல்.

# dev_settings_open_log_file_viewer_title
source: Open Logfile viewer
ta: திற Logfile viewer

# dev_settings_open_log_file_viewer_subtitle
source: Provides an overview over all error messages
ta: எல்லா பிழை செய்திகளுக்கும் ஒரு கண்ணோட்டத்தை வழங்குகிறது

# dev_settings_show_error_messages_title
source: Show error messages
ta: காட்டு பிழை செய்திகள்

# dev_settings_show_error_messages_subtitle
source: Shows a dialog with error messages
ta: பிழை செய்திகளுடன் உரையாடலைக் காட்டுகிறது

# dev_settings_max_size_bounding_box_title
source: Max size of bounding box for a subscription (be careful)
ta: Max அளவு of bounding box க்கு a சந்தா (be careful)

# dev_settings_max_size_bounding_box_subtitle
source: Allows to select the max size of the bounding box for a subscription. Larger subscription areas can affect performance. Be careful.
ta: Allows பெறுநர் தேர்ந்தெடு the max அளவு of the bounding box க்கு a subscription. Larger சந்தா areas can affect performance. கவனமாக இருங்கள்.

# dev_settings_show_debug_notification
source: Show debug notifications
ta: பிழைத்திருத்த அறிவிப்புகளைக் காட்டு

# dev_settings_remove_cached_alerts
source: Remove cached alerts
ta: தற்காலிக சேமிப்பு விழிப்பூட்டல்களை அகற்று

# welcome_view_foss_warn_headline
source: FOSS Warn
ta: ஃபோச் எச்சரிக்கை

# welcome_view_foss_warn_text
source: Glad you want to use FOSS Warn. Swipe to start the introduction.
ta: நீங்கள் FOSS எச்சரிக்கையைப் பயன்படுத்த விரும்பியதில் மகிழ்ச்சி. அறிமுகத்தைத் தொடங்க ச்வைப் செய்யவும்.

# welcome_view_foss_server_selection_headline
source: FOSS Public Alert Server
ta: பொது முன்னறிவிப்பு சேவையகத்தைப் பயன்படுத்துங்கள்

# welcome_view_foss_server_selection_text
source: FOSSWarn now uses the FOSS Public Alert Server (FPAS) to receive alerts. This server allows to get push notifications about emergency alerts for a large number of countries in the world. The default server is operated by KDE and is hosted in Germany. You can change the selected server in the settings and use any other FPAS server. This version is an alpha test version of FOSSWarn with FPAS support. This version is not yet ready for production.
ta: ஃபோச்வர்ன் இப்போது விழிப்பூட்டல்களைப் பெற FOSS பொது முன்னறிவிப்பு சேவையகத்தை (FPAS) பயன்படுத்துகிறது. இந்த சேவையகம் உலகில் அதிக எண்ணிக்கையிலான நாடுகளுக்கான அவசர எச்சரிக்கைகள் குறித்த புச் அறிவிப்புகளைப் பெற அனுமதிக்கிறது. இயல்புநிலை சேவையகம் KDE ஆல் இயக்கப்படுகிறது மற்றும் செர்மனியில் புரவலன் செய்யப்படுகிறது. அமைப்புகளில் தேர்ந்தெடுக்கப்பட்ட சேவையகத்தை மாற்றலாம் மற்றும் வேறு எந்த FPAS சேவையகத்தையும் பயன்படுத்தலாம். இந்த பதிப்பு FPAS ஆதரவுடன் ஃபோச்வர்னின் ஆல்பா சோதனை பதிப்பாகும். இந்த பதிப்பு இன்னும் தயாரிப்புக்கு தயாராக இல்லை.

# welcome_view_foss_server_selection_select_instance_helptext
source: Learn more about the FPAS
ta: FPAS பற்றி மேலும் அறிக

# welcome_view_permission_action
source: Request permission
ta: இசைவு கோருங்கள்

# welcome_view_important_headline
source: Important
ta: முக்கியமானது

# welcome_view_important_text
source: Please read the disclaimer before use. By using the app, you agree to it.
ta: பயன்பாட்டிற்கு முன் மறுப்பைப் படியுங்கள். பயன்பாட்டைப் பயன்படுத்துவதன் மூலம், நீங்கள் அதை ஒப்புக்கொள்கிறீர்கள்.

# welcome_view_battery_optimisation_headline
source: Battery optimization
ta: பேட்டரி தேர்வுமுறை

# welcome_view_battery_optimisation_text
source: In order for FOSS Warn to reliably send you background notifications, battery optimization for FOSS Warn should be disabled.
ta: FOSS எச்சரிக்கைக்கு பின்னணி அறிவிப்புகளை உங்களுக்கு நம்பத்தகுந்த வகையில் அனுப்ப, FOSS எச்சரிக்கைக்கான பேட்டரி தேர்வுமுறை முடக்கப்பட வேண்டும்.

# welcome_view_battery_optimisation_verifying
source: Verifying battery optimization state...
ta: பேட்டரி தேர்வுமுறை நிலையை சரிபார்க்கிறது ...

# welcome_view_battery_optimisation_action
source: Disable
ta: முடக்கு

# welcome_view_battery_optimisation_action_success
source: Success
ta: செய்

# welcome_view_action_success
source: Success
ta: செய்

# welcome_view_my_places_headline
source: My places
ta: என் இடங்கள்

# welcome_view_my_places_text
source: To receive alerts, you have to subscribe to an area of interest. You can subscribe to any area in the world. We currently support around 100 countries. You will receive push notifications for every subscription. To unsubscribe, you can long-press the location and click on delete.
ta: விழிப்பூட்டல்களைப் பெற, நீங்கள் ஆர்வமுள்ள பகுதிக்கு குழுசேர வேண்டும். உலகின் எந்தவொரு பகுதிக்கும் நீங்கள் குழுசேரலாம். நாங்கள் தற்போது சுமார் 100 நாடுகளை ஆதரிக்கிறோம். ஒவ்வொரு சந்தாவிற்கும் புச் அறிவிப்புகளைப் பெறுவீர்கள். குழுவிலக, நீங்கள் இருப்பிடத்தை நீண்ட அழுத்தி நீக்கு என்பதைக் சொடுக்கு செய்யலாம்.

# welcome_view_warning_steps_headline
source: Warning levels
ta: எச்சரிக்கை நிலைகள்

# welcome_view_warning_steps_text
source: All alerts have a warning or importance level determined by the publisher. In the settings you can set for which of the four levels you want to receive notifications. By default, you will not be notified for messages of 'low' importance. In the app itself, all messages are always displayed.
ta: அனைத்து விழிப்பூட்டல்களுக்கும் வெளியீட்டாளரால் தீர்மானிக்கப்படும் எச்சரிக்கை அல்லது முக்கியத்துவம் நிலை உள்ளது. அமைப்புகளில் நீங்கள் அறிவிப்புகளைப் பெற விரும்பும் நான்கு நிலைகளில் எது அமைக்கலாம். இயல்பாக, 'குறைந்த' முக்கியத்துவம் வாய்ந்த செய்திகளுக்கு உங்களுக்கு அறிவிக்கப்படாது. பயன்பாட்டில், எல்லா செய்திகளும் எப்போதும் காண்பிக்கப்படும்.

# welcome_view_lets_go_headline
source: Let's go!
ta: போகலாம்!

# welcome_view_lets_go_text
source: If you find this app useful, feel free to let me know ☺️
ta: இந்த பயன்பாடு உங்களுக்கு பயனுள்ளதாக இருந்தால், எனக்குத் தெரியப்படுத்த தயங்க

# welcome_view_end_button
source: End
ta: முடிவு

# welcome_view_unifiedpush_headline
source: Push Notifications
ta: அறிவிப்புகளை அழுத்தவும்

# welcome_view_unifiedpush_text
source: FOSSWarn uses UnifiedPush to receive push notifications about new emergency alerts. UnifiedPush is a decentralized push notification system that lets you choose the service you want to use. It’s designed to be privacy-friendly, flexible, and open. To use UnifiedPush, you must install an additional app that acts as a distributor.
ta: புதிய அவசர எச்சரிக்கைகள் பற்றிய புச் அறிவிப்புகளைப் பெற ஃபோச்வர்ன் யுனிஃபைட் புசைப் பயன்படுத்துகிறது. UNIFIDEPUSH என்பது ஒரு பரவலாக்கப்பட்ட புச் அறிவிப்பு அமைப்பாகும், இது நீங்கள் பயன்படுத்த விரும்பும் சேவையைத் தேர்வுசெய்ய உதவுகிறது. இது தனியுரிமை நட்பு, நெகிழ்வான மற்றும் திறந்ததாக வடிவமைக்கப்பட்டுள்ளது. UNIFIDEPUSH ஐப் பயன்படுத்த, விநியோகச்தராக செயல்படும் கூடுதல் பயன்பாட்டை நீங்கள் நிறுவ வேண்டும்.

# welcome_view_unifiedpush_learn_more_button
source: Learn more about UnifiedPush.
ta: ஒருங்கிணைந்த புச் பற்றி மேலும் அறிக.

# welcome_view_navigation_previous
source: Previous
ta: முந்தைய

# welcome_view_navigation_next
source: Next
ta: அடுத்தது

# connection_error_no_internet
source: No server connection
ta: சேவையக இணைப்பு இல்லை

# connection_error_app_error
source: Ups Something went wrong. Please contact the developer
ta: யுபிஎச் ஏதோ தவறு நடந்தது. டெவலப்பரைத் தொடர்பு கொள்ளவும்

# connection_error_subscription_expired
source: Some of your subscriptions have expired.
ta: உங்கள் சில சந்தாக்கள் காலாவதியானன.

# connection_error_fetching_new_alerts
source: Fetching new alerts...
ta: புதிய விழிப்பூட்டல்களைப் பெறுகிறது...

# font_size_headline
source: Font size
ta: எழுத்துரு அளவு

# font_size_big
source: Big
ta: பெரியது

# font_size_normal
source: Normal
ta: சாதாரண

# font_size_small
source: Small
ta: சிறிய

# font_size_very_big
source: extra large
ta: கூடுதல் பெரிய

# disclaimer_headline
source: Disclaimer
ta: மறுப்பு

# disclaimer_text
source: This app was created in the hope that it will be helpful, but it comes WITHOUT ANY WARRANTY. The developer cannot guarantee that the app will function without errors or that it will display all warnings at all times. Also, the developer does not assume any warranty for the topicality, correctness, and completeness of the displayed messages. Therefore, do NOT rely on this app at ANY TIME. Also, the warnings may received with a certain DELAY. You agree to this by using FOSS Warn.
ta: இந்த பயன்பாடு இது உதவியாக இருக்கும் என்ற நம்பிக்கையில் உருவாக்கப்பட்டது, ஆனால் அது எந்த உத்தரவாதமும் இல்லாமல் வருகிறது. பயன்பாடு பிழைகள் இல்லாமல் செயல்படும் அல்லது அது எல்லா நேரங்களிலும் அனைத்து எச்சரிக்கைகளையும் காண்பிக்கும் என்று உருவாக்குபவர் பொறுப்பு அளிக்க முடியாது. மேலும், காண்பிக்கப்படும் செய்திகளின் மேற்பூச்சு, சரியான தன்மை மற்றும் முழுமைக்கான எந்தவொரு உத்தரவாதத்தையும் உருவாக்குபவர் கருதவில்லை. எனவே, இந்த பயன்பாட்டை எந்த நேரத்திலும் நம்ப வேண்டாம். மேலும், எச்சரிக்கைகள் ஒரு குறிப்பிட்ட தாமதத்துடன் பெறப்படலாம். FOSS எச்சரிக்கையைப் பயன்படுத்தி இதை ஒப்புக்கொள்கிறீர்கள்.

# sorting_headline
source: How should the messages be sorted?
ta: செய்திகளை எவ்வாறு வரிசைப்படுத்த வேண்டும்?

# sorting_by_date
source: By date of issue (latest first)
ta: வெளியீட்டு தேதியில் (சமீபத்திய முதல்)

# sorting_by_warning_level
source: by warning level (highest first)
ta: எச்சரிக்கை நிலை மூலம் (மிக உயர்ந்தது)

# sorting_by_source
source: By source
ta: மூலத்தால்

# explanation_headline
source: Explanation
ta: விளக்கம்

# explanation_health
source: Health
ta: உடல்நலம்

# explanation_health_text
source: health-threatening events such as pandemics or water contamination
ta: தொற்றுநோய்கள் அல்லது நீர் மாசுபாடு போன்ற உடல்நல அச்சுறுத்தும் நிகழ்வுகள்

# explanation_fire
source: Fire
ta: தீ

# explanation_fire_text
source: Fire information
ta: தீ செய்தி

# explanation_infrastructure
source: Infrastructure
ta: உள்கட்டமைப்பு

# explanation_infrastructure_text
source: Information in the event of infrastructural incidents such as a failure of the emergency line
ta: செய்தி அவசர வரியின் தோல்வி போன்ற உள்கட்டமைப்பு சம்பவங்கள் ஏற்பட்டால் செய்தி

# explanation_CBRNE
source: CBRNE
ta: Cborne
