Repository: 247i/TACETr
Catalog: உரை/தானி/gafam-translations-*.po
Languages: ta

# google-title
source: Google
ta: கூகிள்

# google-body
source: FILTERS YOUR THOUGHTS
ta: வடிப்பான்கள் உங்கள் எண்ணங்கள்

# google-footer
source: Google filters your search results and YouTube recommendations to analyze your reactions and confine you to its filter bubble
ta: கூகிள் உங்கள் தேடல் முடிவுகள் மற்றும் YouTube ஐ வடிகட்டுகிறது உங்கள் எதிர்வினைகளை பகுப்பாய்வு செய்வதற்கான பரிந்துரைகள் அதன் வடிகட்டி குமிழியில் உங்களை கட்டுப்படுத்தவும்

# apple-title
source: Apple
ta: அரத்திப்பழம், குமளிப்பழம்

# apple-body
source: KNOWS WHERE YOUR MOM IS
ta: தெரியும் எங்கே அம்மா என்பது

# apple-footer
source: If you have an iOS or Android smartphone, Apple and Google track, collect and analyze your location without telling you or giving you a choice
ta: உங்களிடம் ஐஇமு அல்லது ஆண்ட்ராய்டு ச்மார்ட்போன் இருந்தால், ஆப்பிள் உங்கள் இருப்பிடத்தை கூகிள் டிராக், சேகரித்து பகுப்பாய்வு செய்யுங்கள் உங்களிடம் சொல்லாமல் அல்லது உங்களுக்கு ஒரு தேர்வு கொடுக்காமல்

# facebook-title
source: facebook
ta: பேச்புக்

# facebook-body
source: CHOOSES WHAT YOU READ
ta: தேர்வு நீங்கள் என்ன படிக்க

# facebook-footer
source: Facebook selects the contents of your newsfeed to analyze your reactions and confine you to its filter bubble
ta: பேச்புக் உங்கள் நியூச்ஃபீட்டின் உள்ளடக்கங்களைத் தேர்ந்தெடுக்கிறது உங்கள் எதிர்வினைகளை பகுப்பாய்வு செய்து உங்களை கட்டுப்படுத்த அதன் வடிகட்டி குமிழி

# amazon-title
source: amazon
ta: அமேசான்

# amazon-body
source: KNOWS WHAT PRESENTS YOU ARE GETTING
ta: தெரியும் என்ன முன்வைக்கிறது நீங்கள் பெறுகிறது

# amazon-footer
source: Analyzed on a sufficient scale, behaviours that might seem trivial can reveal a lot about your personality, your expectations and your peers
ta: போதுமான அளவில் பகுப்பாய்வு செய்யப்பட்டது, நடத்தைகள் அற்பமானதாகத் தோன்றலாம் ஆளுமை, உங்கள் எதிர்பார்ப்புகள் மற்றும் உங்கள் சகாக்கள்

# microsoft-title
source: Microsoft
ta: மைக்ரோசாப்ட்

# microsoft-body
source: FORMATS YOUR KIDS
ta: வடிவங்கள் உங்கள் குழந்தைகள்

# microsoft-footer
source: Microsoft is buying its way into schools and universities by striking deals to train teachers and students
ta: மைக்ரோசாப்ட் பள்ளிகளுக்குள் வாங்குகிறது மற்றும் பல்கலைக்கழகங்கள் பயிற்சி பெறுவதற்கான ஒப்பந்தங்களை உருவாக்குகின்றன ஆசிரியர்கள் மற்றும் மாணவர்கள்
