Repository: 247i/TACETr
Catalog: உரை/தானி/galette-doc-plugins-index-*.po
Languages: ta

source: :doc:`Plugins documentation <index>`
ta: :doc:`Plugins ஆவணங்கள் <index>`

source: Plugins
ta: செருகுநிரல்கள்

source: Plugins system allows to extend Galette with specific features that would not be useful for most of the users. Incompatible plugins will automatically be disabled, in which case you should consider upgrading to a more recent version.
ta: பெரும்பாலான பயனர்களுக்குப் பயன்படாத குறிப்பிட்ட அம்சங்களுடன் கேலட்டை நீட்டிக்க செருகுநிரல் அமைப்பு அனுமதிக்கிறது. பொருந்தாத செருகுநிரல்கள் தானாக முடக்கப்படும், அப்படியானால், நீங்கள் அண்மைக் கால பதிப்பிற்கு மேம்படுத்துவதைக் கருத்தில் கொள்ள வேண்டும்.

source: Each plugin is a simple directory in ``{galette}/plugins/``, then refer to the plugin documentation to install it.
ta: ஒவ்வொரு செருகுநிரலும் ``{galette}/plugins/`` இல் உள்ள ஒரு எளிய கோப்பகமாகும், பின்னர் அதை நிறுவ செருகுநிரல் ஆவணத்தைப் பார்க்கவும்.

source: You can disable a plugin creating a ``_disabled`` file in its directory.
ta: அதன் கோப்பகத்தில் ``_disabled`` கோப்பை உருவாக்கும் செருகுநிரலை நீங்கள் முடக்கலாம்.

source: Official Plugins
ta: அதிகாரப்பூர்வ செருகுநிரல்கள்

source: Official plugins are developed and maintained by the Galette team. Available official plugins are:
ta: அதிகாரப்பூர்வ செருகுநிரல்கள் கேலட் குழுவால் உருவாக்கப்பட்டு பராமரிக்கப்படுகின்றன. கிடைக்கக்கூடிய அதிகாரப்பூர்வ செருகுநிரல்கள்:

source: Third party plugins
ta: மூன்றாம் தரப்பு செருகுநிரல்கள்

source: Third party plugins are developed and maintained by community members. Some of them may not be translated, or available on only one database engine.
ta: மூன்றாம் தரப்பு செருகுநிரல்கள் சமூக உறுப்பினர்களால் உருவாக்கப்பட்டு பராமரிக்கப்படுகின்றன. அவற்றில் சில மொழிபெயர்க்கப்படாமல் இருக்கலாம் அல்லது ஒரே ஒரு தரவுத்தள இயந்திரத்தில் மட்டுமே கிடைக்கும்.

source: `oAuth2 <https://galette-community.github.io/plugin-oauth2/>`_ (Galette act as an oAuth2 provider),
ta: `oAuth2 <https://galette-community.github.io/plugin-oauth2/>`_ (Galette oAuth2 வழங்குநராக செயல்படுகிறது),

source: `Stripe <https://galette-community.github.io/plugin-stripe/>`_ (handle `Stripe payments <https://stripe.com/>`_),
ta: `ச்ட்ரைப் <https://galette-community.github.io/plugin-stripe/>`_ (`Stripe கட்டணங்கள் <https://stripe.com/>`_)

source: `HelloAsso <https://galette-community.github.io/plugin-helloasso/>`_ (handle `HelloAsso payments <https://www.helloasso.com/>`_),
ta: `HelloAsso <https://galette-community.github.io/plugin-helloasso/>`_ (`HelloAsso கட்டணங்களைக் கையாளவும் <https://www.helloasso.com/>`_),

source: `LegalNotices <https://galette-community.github.io/plugin-legalnotices/>`_ (manage legal notices pages),
ta: `LegalNotices <https://galette-community.github.io/plugin-legalnotices/>`_ (சட்ட அறிவிப்புகள் பக்கங்களை நிர்வகிக்கவும்),

source: A `Github community <https://github.com/galette-community/>`_ has been created to :doc:`manage third party plugins <plugins-tiers>`, if you want to add your plugin.
ta: உங்கள் செருகுநிரலைச் சேர்க்க விரும்பினால், மூன்றாம் தரப்பு செருகுநிரல்களை <plugins-tiers>` நிர்வகிப்பதற்கு :doc:``Github சமூகம் <https://github.com/galette-community/>`_ உருவாக்கப்பட்டது.

source: Plugins management interface
ta: செருகுநிரல் மேலாண்மை இடைமுகம்

source: A plugins management interface is provided, you will find it from the dashboard or in the configuration menu. After you have downloaded plugin(s) in Galette ``plugins`` directory, a list will be displayed:
ta: ஒரு செருகுநிரல் மேலாண்மை இடைமுகம் வழங்கப்பட்டுள்ளது, நீங்கள் அதை டாச்போர்டில் இருந்து அல்லது உள்ளமைவு பட்டியலில் காணலாம். Galette ``plugins`` கோப்பகத்தில் செருகுநிரல்(களை) பதிவிறக்கம் செய்த பிறகு, ஒரு பட்டியல் காட்டப்படும்:

source: Plugins management
ta: செருகுநிரல்கள் மேலாண்மை

source: If web server has read access to your plugins directory, then you can enable or disable any plugin from the related icon.
ta: இணைய சேவையகம் உங்கள் செருகுநிரல் கோப்பகத்தை படிக்க அணுகினால், தொடர்புடைய ஐகானிலிருந்து எந்த செருகுநிரலையும் நீங்கள் இயக்கலாம் அல்லது முடக்கலாம்.

source: If plugin requires a database to work, you can play installation and update scripts from the interface.
ta: சொருகி வேலை செய்ய ஒரு தரவுத்தளம் தேவைப்பட்டால், நீங்கள் நிறுவலை இயக்கலாம் மற்றும் இடைமுகத்திலிருந்து ச்கிரிப்ட்களைப் புதுப்பிக்கலாம்.

source: Database ACLs will then be checked. Unlike Galette, no information will be asked to you, since all is already available from your current instance.
ta: தரவுத்தள ACLகள் பின்னர் சரிபார்க்கப்படும். கேலட்டைப் போலன்றி, உங்களிடம் எந்தத் தகவலும் கேட்கப்படாது, ஏனெனில் உங்கள் தற்போதைய நிகழ்விலிருந்து அனைத்தும் ஏற்கனவே கிடைக்கின்றன.
