Repository: 247i/TACETr
Catalog: உரை/தானி/gmt-tutorials-layout-design-*.po
Languages: ta

source: 在這裡我們只需要垂直偏移，因此使用 ``-Y`` 即可。例如 ``-Y12c`` 就是向上偏移 12 公分。或是你也可以使用 ``h`` 以及 ``w`` 代表前一張地圖的作圖高度與寬度，例如 ``-Yh+3c`` 就是向上偏移上一張地圖的高度再加 3 公分。``-X`` 和 ``-Y`` 會永久改變地圖在紙張上呈現的位置，因此只需要在\ **下一張地圖的第一個繪圖指令**\ 附上這些選項就可以以了。
ta: இங்கே நாம் செங்குத்தாக மட்டுமே மாற்ற வேண்டும், எனவே `` `-y`` ஐப் பயன்படுத்தவும். எடுத்துக்காட்டாக, `` -y12c`` என்பது 12 செ.மீ வரை மாற்றப்பட வேண்டும். அல்லது முந்தைய வரைபடத்தின் பட உயரத்தையும் அகலத்தையும் குறிக்க `` h`` மற்றும் `w`` ஐப் பயன்படுத்தலாம், அதாவது` `` `` `` `` `` `` `` `` 3 போன்றவை முதல்வர். `-X`` மற்றும்` `-y`` ஆகியவை காகிதத்தில் வரைபடத்தின் நிலையை நிரந்தரமாக மாற்றும், எனவே இந்த விருப்பங்களுடன் அடுத்த வரைபடத்தின் முதல் வரைதல் அறிவுறுத்தலில் மட்டுமே இருக்க வேண்டும்.

source: 接下來我們來看看蘭伯特等積方位投影使用的 ``-R`` 與 ``-J`` 選項。此投影法限定使用全球的作圖範圍，也就是 ``-R-180/180/-90/90``。你也可以使用比較短的特殊代號 ``-Rg``，它的效果與前者相同。``-J`` 語法則為：
ta: அடுத்து, லேண்ட்பர்ட் பயன்படுத்தும் விருப்பங்களை `` -r`` மற்றும் `` `` `` `` `` `` `` `. இந்த திட்ட முறை உலகளாவிய விளக்கப்படத்தின் எல்லைக்கு மட்டுப்படுத்தப்பட்டுள்ளது, அதாவது `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` ``. நீங்கள் ஒரு குறுகிய சிறப்புக் குறியீட்டைப் பயன்படுத்தலாம், `-rg``, விளைவு முந்தையதைப் போன்றது. `` `-J`` சூழல்:

source: -JA中心點經度/中心點緯度/尺寸
ta: -JA சென்டர் பாயிண்ட் நீளமுள்ள/மைய புள்ளி அட்சரேகை/அளவு

source: 選擇烏蘭巴托的座標當作投影的中心點，就可以畫出地圖、海岸線、大圓路徑與城市位置：
ta: உலன் பாட்டோவின் இருக்கையை ஒரு மையத் திட்டமாகத் தேர்வுசெய்க, நீங்கள் வரைபடங்கள், கடற்கரையோரங்கள், பெரிய வட்டங்கள் மற்றும் நகர நிலைகளை வரையலாம்:

source: # (前略) # ==== 開始繪圖 ==== gmt begin ulaanbaatar_seattle png # (上述麥卡托地圖的部份) # ==== 繪圖 (蘭伯特) ==== gmt basemap -Rg -JA106:55/47:55/13c -Yh+3c -B+tLambert --MAP_TITLE_OFFSET=0c # 把標題與地圖邊框弄靠近一點 gmt coast -Dl -A1000 -G$land_color -N1/thick,60 -Bxg60 -Byg30 --MAP_GRID_CROSS_SIZE_PRIMARY=0p # 我們不要十字符號出現在此地圖中所以 MAP_GRID_CROSS_SIZE_PRIMARY 設為 0 gmt plot $input_xy -: -W1p,$gc_color # 大圓路徑 gmt plot $input_xy -: -Sa0.4c -Gblack # 城市位置 gmt end
ta: # (முந்தைய) # ==== தொடக்கம் வரைதல் ==== Gmt ulaanbaatar_seattle png # (மெக்காடோ வரைபடத்தின் மேலே உள்ள பகுதி) # ==== வரைதல் (லாங்பர்ட்) ==== GMT BASEMAP -RG -JA106: 55/47: 55/13C -YH+3C -IB+Tampert -MAP_TITLE_OFFSET = 0C # வரைபட எல்லையிலிருந்து தலைப்புக்கு அருகில் சிறிது நெருக்கமாக சிறிது நெருக்கமாக இருக்கும். Gmt cost -dl -a1000 -g $ land_color -n1/தடிமனான, 60 -bxg60 -byg30 -map_grid_cross_size_primary = 0p 0p # இந்த வரைபடத்தில் குறுக்கு அடையாளம் தோன்றுவதை நாங்கள் விரும்பவில்லை, எனவே MAP_GRID_CROSS_SIZE_PRIMARY 0 என அமைக்கவும் GMT சூழ்ச்சி $ input_xy -: -w1p, $ gc_color # g g GMT சூழ்ச்சி $ input_xy -: -sa0.4c -gblack # நகர இருப்பிடம் GMT முடிவு

source: 注意 GMT 無法透過 ``-B`` 選項為蘭伯特地圖設定座標刻度，我們稍後得自行使用 ``text`` 額外標上去。現在烏蘭巴托已經被置於地圖正中間了，這時大圓路徑在地圖上就是一直線前往西雅圖，如果我們把 ``-A`` 選項打開，也只會得到相同的路徑。那麼，**該如何畫出在這張地圖上的恆向線？**\ 由於西雅圖和烏蘭巴托的緯度非常相近，因此恆向線相當於沿著緯線前進的線段。對於這種狀況，我們可以使用 ``-Ap`` 選項，強制讓兩點之間沿著緯線和經線連接：
ta: லம்பேர்ட் வரைபடத்திற்கான இருக்கை குறிக்கும் அளவை `` `-B`` விருப்பத்தின் மூலம் சிஎம்டி அமைக்க முடியாது என்பதை நினைவில் கொள்க. இப்போது உலன் பாட்டோ வரைபடத்தின் நடுவில் வைக்கப்பட்டுள்ளது. எனவே, இந்த வரைபடத்தில் நிலையான கோட்டை எவ்வாறு வரையலாம்? ** \ சியாட்டில் மற்றும் உலன்பாடோவின் அட்சரேகை மிகவும் ஒத்ததாக இருப்பதால், நிலையான வரி அட்சரேகையுடன் வரி பிரிவுக்கு சமம். இந்த சூழ்நிலைக்கு, `` `-ap`` விருப்பத்தைப் பயன்படுத்தி இரண்டு புள்ளிகளையும் WEFT மற்றும் நெட்டாங்கு உடன் இணைக்க கட்டாயப்படுத்தலாம்:

source: gmt plot $input_xy -: -Ap -W1p,$rl_color # (第二個地圖上的) 恆向線
ta: GMT சூழ்ச்சி $ input_xy -: -ap -w1p, $ rl_color # (இரண்டாவது வரைபடத்தில்) நிலையான வரி

source: 以上繪製恆向線的技巧在兩地處在不同的緯度下無法適用。更一般性的作法是呼叫 GMT 中一個多功能的指令：``project``。這個指令可以用來進行座標轉換或是產生在某個特定的座標系統下的兩點間移動路徑。使用 ``project`` 在平面直角座標下產生直線路徑，再送給 ``plot`` 繪圖，就可以畫出恆向線：
ta: நிலையான கோட்டை வரைய மேலே குறிப்பிடப்பட்ட நுட்பங்கள் வெவ்வேறு அட்சரேகையில் பொருந்தாது. GMT இல் பல செயல்பாட்டு அறிவுறுத்தலை அழைப்பதே மிகவும் பொதுவான அணுகுமுறை: `` திட்டம்``. ஒரு குறிப்பிட்ட இருக்கை அமைப்பின் கீழ் இரண்டு புள்ளிகளுக்கு இடையில் ஒரு ஆயங்களை மாற்ற அல்லது இரண்டு நகரும் பாதைகளை உருவாக்க இந்த அறிவுறுத்தல் பயன்படுத்தப்படலாம். விமானத்தின் வலதுபுறத்தின் கீழ் ஒரு நேர் கோடு தடத்தை உருவாக்க `` திட்டம்`` ஐப் பயன்படுத்தவும், பின்னர் நிலையான வரியை வரைய வரைய `` சதி`` க்கு கொடுங்கள்:

source: gmt project -C106.92/47.92 -E237.67/47.61 -G10 -N | gmt plot -W1p,$rl_color # (第二個地圖上的) 恆向線 # -C: 起點座標 (烏蘭巴托) # -E: 終點座標 (西雅圖, 經度要比烏蘭巴托大，因此加上 360) # -G: 每個取樣點的距離 (單位與起終點座標相同) # -N: 設定座標系為平面直角座標
ta: GMT திட்டம் -C106.92/47.92 -E237.67/47.61 -G10 -N | # -C: தொடக்க -அப் இருக்கை சிட்டை (உலாங்பாடோ) # -E: முடிவின் முடிவு (சியாட்டில், தீர்க்கரேகை உலன்பாடோவை விட பெரியது, எனவே 360 ஐச் சேர்க்கவும்) # -G: ஒவ்வொரு மாதிரி புள்ளியின் தூரம் (அலகு தொடக்க புள்ளி இருக்கைக்கு சமம்) # -N: இருக்கை தரத்தை விமான மலக்குடல் மூலையில் இருக்கையாக அமைக்கவும்

source: 歡迎自行使用此行取代腳本中畫恆向線的指令。有關 ``project`` 指令的詳細說明，請參閱「\ :doc:`contour_and_profile`\ 」。
ta: ச்கிரிப்டில் உள்ள ச்கிரிப்டில் உள்ள வழிமுறைகளை மாற்ற இந்த வரியைப் பயன்படுத்த வரவேற்கிறோம். `` திட்டம்` `அறிவுறுத்தலைப் பற்றிய விரிவான வழிமுறைகளுக்கு," \: டாக்: `contour_and_profile` \" ஐப் பார்க்கவும்.

source: 本地圖的最後一步，就是替兩條線與經緯格線加上文字標籤。換 ``text`` 上場了！這次要標的文字比較複雜，因為每個標籤的角度都不一樣，使用 ``echo`` 一一指定的話會變得有點麻煩。幸好，``text`` 和 ``plot`` 一樣，都可以利用重導向符號 ``<<`` 一次輸入以上這些不同資訊。它的具體語法為：
ta: இந்த வரைபடத்தின் கடைசி படி இரண்டு கோடுகள் மற்றும் அட்சரேகை கோடுகளுக்கு உரை குறிச்சொற்களைச் சேர்ப்பது. புலத்தில் `உரை`` ஐ மாற்றவும்! இந்த நேரத்தில், பொருள் உரை மிகவும் சிக்கலானது, ஏனென்றால் ஒவ்வொரு லேபிளின் கோணமும் வேறுபட்டது, மேலும் `` எதிரொலி`` ஒன்றைப் பயன்படுத்துவது சற்று தொந்தரவாக மாறும். அதிர்ச்டவசமாக, `` சதி` போன்ற `` உரை``, நீங்கள் கனமான சார்ந்த சின்னங்களைப் பயன்படுத்தலாம் `` `` ஒரு நேரத்தில் மேலே உள்ள வேறுபட்ட தகவல்களை உள்ளிடவும். அதன் குறிப்பிட்ட இலக்கணம்:

source: gmt text -F+欄位a+欄位b+.... [其他選項] << EOF 第一欄(固定為X) 第二欄(固定為Y) 第三欄(欄位a) 第四欄(欄位b) ... 最後一欄(固定為標籤文字) ... ... ... ... ... ... ... ... ... ... ... ... EOF
ta: GMT உரை -F+FAIR A+FAIR B+.... [பிற விருப்பங்கள்] << EOF முதல் நெடுவரிசையின் முதல் நெடுவரிசை (x க்கு சரி செய்யப்பட்டது) (y க்கு சரி செய்யப்பட்டது) 3 (நெடுவரிசை A) நான்காவது நெடுவரிசை (நெடுவரிசை B) ... கடைசி நெடுவரிசை (குறிச்சொல் உரையாக சரி செய்யப்பட்டது) ... ... ... ... ... ... ... ... EOF

source: 也就是說，``text`` 要求輸入最少為 3 欄 (X、Y、標籤文字)，而透過 ``-F`` 選項，可以指定更多的欄位。如果要加上經緯格線的文字標籤，我們可以使用 ``-F+a``，如此一來第 3 欄就會是每個文字的角度 (從水平開始往逆時針旋轉)，標籤文字則會被擠到第 4 欄，如下所示：
ta: வேறு வார்த்தைகளில் கூறுவதானால், `` உரை`` உள்ளீடு குறைந்தது 3 நெடுவரிசைகள் (x, ஒய், குறிச்சொல் உரை) தேவை, மேலும் `` -ff``` விருப்பத்தின் மூலம் மேலும் நெடுவரிசைகளை குறிப்பிடலாம். அட்சரேகை மற்றும் WEFT வரியின் உரை குறிச்சொற்களை நீங்கள் சேர்க்க விரும்பினால், நாங்கள் `` `-f+a`` ஐப் பயன்படுத்தலாம், இதனால் மூன்றாவது நெடுவரிசை ஒவ்வொரு உரையின் கோணமாக இருக்கும் (மட்டத்திலிருந்து வெர் கிளாக் திசையில் தொடங்குகிறது) , சிட்டை உரை கீழே காட்டப்பட்டுள்ளபடி, 4 வது நெடுவரிசைக்கு அழுத்தும்:

source: gmt text -F+a << ANNOTEND 106.92 -30 0 30@.S 106.92 30 0 30@.N 60 15 70 60@.E 180 15 305 180@. ANNOTEND # 經度 緯度 角度 文字 # "@." 會被解讀成度數符號
ta: GMT உரை -f+a << annotend 106.92 -30 0 30@.எச் 106.92 30 0 30@.n 60 15 70 60 @.e 180 15 305 180@. Annotnd # மெரிட்டி அட்சரேகை கோண உரை # "@இது எண்களின் எண்ணிக்கையில் விளக்கப்படும்

source: 如果要加上大圓路徑和恆向線的標籤，我們除了要指定旋轉角度外，也要指定不同的字型。在前面的麥卡托地圖中，指定字型的方式是 ``-F+f字型樣式`` ，如果不給 ``字型樣式`` 的話，就代表 ``text`` 必需要在輸入資料中尋找對應的欄位。因此，我們也可使用 ``-F+a+f`` 來指定第 3 欄為角度、第 4 欄為字型樣式，而標籤文字這次則被放到了第 5 欄：
ta: சுழற்சி கோணத்தைக் குறிப்பிடுவதோடு கூடுதலாக, பெரிய வட்டம் பாதை மற்றும் நிலையான வரி லேபிளைச் சேர்க்க விரும்பினால், வெவ்வேறு எழுத்துருக்களையும் குறிப்பிட வேண்டும். முன்னால் உள்ள மெக்காடோ வரைபடத்தில், குறிப்பிட்ட முறை `` `` `` `` `` தரவுகளில் தொடர்புடைய புலத்தைக் கண்டுபிடிக்க வேண்டும். ஆகையால், 3 வது நெடுவரிசையை கோணமாகவும், நான்காவது நெடுவரிசை எழுத்துரு பாணியாகவும், சிட்டை உரை இந்த நேரத்தில் 5 வது நெடுவரிசையில் வைக்கப்பட்டுள்ளது: `` -f+a+f`` ஐப் பயன்படுத்தலாம்:

source: gmt text -F+a+f << LABELEND 180 40 58 ,Bookman-DemiItalic,$rl_color Rhumb Line 180 80 58 ,Bookman-DemiItalic,$gc_color Great Circle LABELEND # 經度 緯度 角度 字型樣式 文字
ta: GMT உரை -f+a+f << lablend 180 40 58, புக்மேன்-டெமியாலிக், $ rl_color rumb line 180 80 58, புக்மேன்-டெமியாலிக், $ gc_color பெரிய வட்டம் Lablend # மெரிட்டி அட்சரேகை கோண எழுத்துரு பாணி உரை

source: 把以上兩段指令加在腳本內 ``# ==== 繪圖 (蘭伯特) ====`` 的段落中，就能加上我們想要的標籤。
ta: மேலே உள்ள இரண்டு வழிமுறைகளை ச்கிரிப்டின் பத்திகளில் சேர்க்கவும் `# ==== வரைதல் (லாங்பர்ட்) ====` `` `நாம் விரும்பும் லேபிளைச் சேர்க்கலாம்.

source: 恭喜！我們終於完成本章目標的地圖了。最後再次提醒：使用 ``set`` 修改的預設參數，都會被存在 ``gmt.conf`` 中。如果你下次要在同一個資料夾作圖，但是又不想使用這次的設定，那麼在地圖完成後，請自行刪除 ``gmt.conf`` 或是把刪除指令放在腳本中的最後一行：
ta: வாழ்த்துக்கள்! இந்த அத்தியாயத்தின் வரைபடத்தை இறுதியாக முடித்துவிட்டோம். இறுதியாக, நான் மீண்டும் நினைவூட்டுகிறேன்: `` செட்` உடன் மாற்றியமைக்கப்பட்ட முன்னமைக்கப்பட்ட அளவுருக்கள் `` gmt.conf`` இன் இருப்பில் இருக்கும். அடுத்த முறை அதே கோப்புறையில் நீங்கள் ஒரு படத்தை உருவாக்க வேண்டும் என்றால், ஆனால் நீங்கள் இந்த அமைப்பைப் பயன்படுத்த விரும்பவில்லை என்றால், வரைபடம் முடிந்ததும், தயவுசெய்து `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` gmt.conf ”ஒரு வரி:

source: # (前略) gmt end rm -rf gmt.conf # <---- 消除舊的組態設定檔
ta: # (முந்தைய) GMT முடிவு RM-RF GMT.CONF # <---- பழைய உள்ளமைவு அமைப்புக் கோப்பை அகற்றவும்

source: 指令稿
ta: வழிமுறைகள்

source: 本地圖的最終指令稿如下：
ta: இந்த வரைபடத்தின் இறுதி அறிவுறுத்தல் வரைவு பின்வருமாறு:

source: # ==== 設定變數 ==== input_xy="coord.txt" land_color="#CEB9A0" rl_color="#FF0073" # 恆向線顏色 gc_color="#0044FF" # 大圓路徑顏色 # 把兩個城市的 xy 座標寫入 $input_xy 檔案中 # 如果你已經下載了 coord.txt，以下四行可以註解掉。 xy_ulaanbaatar="47:55:0N, 106:55:0E" # 烏蘭巴托的座標 xy_seattle="47:36:35N, 122:19:59W" # 西雅圖的座標 echo $xy_ulaanbaatar > $input_xy echo $xy_seattle >> $input_xy # ==== 設定作圖參數 ==== gmt set FONT_ANNOT_PRIMARY 12p,20,#0D057A \ FONT_TITLE 30,Bookman-Demi,#0D057A \ FORMAT_GEO_MAP dddF \ MAP_ANNOT_OBLIQUE 32 \ MAP_FRAME_TYPE plain \ MAP_GRID_CROSS_SIZE_PRIMARY 8p \ MAP_GRID_PEN_PRIMARY thinner,#ED99F0 \ MAP_TICK_PEN_PRIMARY thicker,black \ MAP_TITLE_OFFSET 0.5c \ PS_PAGE_COLOR ivory # ==== 開始繪圖 ==== gmt begin ulaanbaatar_seattle_gmt6 png # ==== 下圖 (麥卡托) ==== gmt basemap -R70/270/30S/70N -JM13c -B+tMercator gmt coast -Dl -A1000 -G$land_color -N1/thick,60 -Ba40f20g20 --MAP_GRID_PEN_PRIMARY=thicker gmt plot $input_xy -: -A -W1p,$rl_color # 恆向線 gmt plot $input_xy -: -W1p,$gc_color # 大圓路徑 gmt plot $input_xy -: -Sa0.4c -Gblack echo "174 41 Rhumb Line" | gmt text -F+f,18,$rl_color echo "174 61 Great Circle" | gmt text -F+f,18,$gc_color # ==== 上圖 (蘭伯特) ==== gmt basemap -Rg -JA106:55/47:55/13c -Yh+3c -B+tLambert --MAP_TITLE_OFFSET=0c gmt coast -Dl -A1000 -G$land_color -N1/thick,60 -Bxg60 -Byg30 --MAP_GRID_CROSS_SIZE_PRIMARY=0p gmt plot $input_xy -: -Ap -W1p,$rl_color # 恆向線 gmt plot $input_xy -: -W1p,$gc_color # 大圓路徑 gmt plot $input_xy -: -Sa0.4c -Gblack gmt text -F+a << ANNOTEND 106.92 -30 0 30@.S 106.92 30 0 30@.N 60 15 70 60@.E 180 15 305 180@. ANNOTEND gmt text -F+a+f << LABELEND 180 40 58 ,Bookman-DemiItalic,$rl_color Rhumb Line 180 80 58 ,Bookman-DemiItalic,$gc_color Great Circle LABELEND gmt end # rm -rf gmt.conf # 消除舊的 GMT 參數檔
ta: # ==== மாறி ==== அமைக்கவும் Input_xy = "koor.txt" லேண்ட்_கோலர் = "#ceb9a0" Rl_color = " # ff0073" # பின்தொடர் -up வரி வண்ணம் GC_COLOR = " # 0044FF" # தலுவான் சாலை நிறம் # இரண்டு நகரங்களின் XY இருக்கைகளை $ input_xy கோப்பில் எழுதுங்கள் # நீங்கள் your.txt ஐ பதிவிறக்கம் செய்திருந்தால், பின்வரும் நான்கு வரிகளை செலுத்தலாம். xy_ulaanbaata = "47: 55: 0n, 106: 55: 0e" # XY_SEATTLE = "47: 36: 35n, 122: 19: 59W" # சியாட்டலின் இருக்கை சிட்டை எதிரொலி $ XY_ULAANBAATA> $ input_xy எதிரொலி $ XY_SEATTLE >> $ input_xy # ==== வரைபட அளவுருவை அமைக்கவும் ==== Gmt செட் font_annot_primary 12p, 20,#0d057a \ Font_title 30, புக்மேன்-டெமி,#0d057a \ Format_geo_map dddf \ Map_annot_oblique 32 \ Map_frame_type வெற்று \ Map_grid_cross_size_primary 8p \ Map_grid_pen_primary மெல்லிய,#ed99f0 \ Map_tick_pen_primary தடிமனான, கருப்பு \ Map_title_offset 0.5c \ Ps_page_color தந்தம் # ==== தொடக்கம் வரைதல் ==== GMT ULAANBAATAR_SEATTLE_GMT6 Png # ==== கீழே (மெக்காடோ) ==== GMT BASEMAP -R70/270/30S/70N -JM13C -B+TMERCATOR Gmt cost -dl -a1000 -g $ land_color -n1/தடிமனான, 60 -ba40f20g20 -map_grid_primary = தடிமனான GMT சூழ்ச்சி $ input_xy -: -a -w1p, $ rl_color # hengxiang line GMT சூழ்ச்சி $ input_xy -: -w1p, $ gc_color # g g GMT சூழ்ச்சி $ input_xy -: -sa0.4c -gblack எதிரொலி "174 41 ரம்ப் வரி" | எதிரொலி "174 61 பெரிய வட்டம்" | # ==== படம் மேலே (லான்பர்ட்) ==== GMT BASEMAP -RG -JA106: 55/47: 55/13C -YH+3C -B+Tambert -MAP_TITLE_OFFSET = 0C Gmt cost -dl -a1000 -g $ land_color -n1/தடிமனான, 60 -bxg60 -byg30 -map_grid_cross_size_primary = 0p 0p GMT சூழ்ச்சி $ input_xy -: -ap -w1p, $ rl_color # g GMT சூழ்ச்சி $ input_xy -: -w1p, $ gc_color # g g GMT சூழ்ச்சி $ input_xy -: -sa0.4c -gblack GMT உரை -f+a << annotend 106.92 -30 0 30@.எச் 106.92 30 0 30@.n 60 15 70 60 @.e 180 15 305 180@. Annotnd GMT உரை -f+a+f << lablend 180 40 58, புக்மேன்-டெமியாலிக், $ rl_color rumb line 180 80 58, புக்மேன்-டெமியாலிக், $ gc_color பெரிய வட்டம் Lablend GMT முடிவு # Rm -rf gmt.conf #

source: 「繪製大圓路徑與恆向線。版面與地圖框線、標示的外貌與位置皆經過微調，先畫下圖 (麥卡托投影) 再畫上圖 (蘭伯特投影)。在腳本中也額外標上了上圖的格線經緯度。」
ta: "பெரிய வட்ட பாதையையும் நிலையான வரியையும் வரையவும். தளவமைப்பு மற்றும் வரைபட சட்ட வரி, குறிக்கப்பட்ட தோற்றம் மற்றும் நிலை ஆகியவை நன்றாக உள்ளன, முதலில் கீழே உள்ள படத்தை வரையவும், பின்னர் மேலே உள்ள படத்தை வரையவும் (லாங்பர்ட் ப்ரொசெக்சன்). தி மேலே உள்ள படத்தில் கட்டம் கோட்டின் அட்சரேகை மற்றும் அட்சரேகை.

source: 觀看\ `最終版地圖`_
ta: \ `இறுதி பதிப்பு வரைபடத்தைப் பாருங்கள்` _

source: 習題
ta: உடற்பயிற்சி

source: 畫出跟下圖越相似越好的赤道幾內亞 (Equatorial Guinea) 地圖\ [#]_，但不用標上道路、鄉鎮市名稱、地理名稱與比例尺，紅色圓圈與連接紅色圓圈的黑色虛線則須標明，喀麥隆 (Cameroon)、加彭 (Gabon) 與聖多美普林西比 (São Tomé e Príncipe) 的國名也必須標出，地圖中的五個大島嶼的名稱也要顯示在地圖上。地圖左上方的位置示意圖，可看待為第二張地圖，利用 ``-X`` 與 ``-Y`` 選擇位置並疊在第一張地圖上。
ta: பூமத்திய கோடு கினியாவின் வரைபடத்தை வரையவும், இது கேமரூன், காபோன் மற்றும் சான் டோமியின் தேசிய பெயரும் குறிக்கப்பட வேண்டும், மேலும் வரைபடத்தில் உள்ள ஐந்து பெரிய தீவுகளின் பெயர்கள் வரைபடத்திலும் காட்டப்படும். வரைபடத்தின் மேல் இடதுபுறத்தில் உள்ள நிலை வரைபடத்தை இரண்டாவது வரைபடமாக பார்க்கலாம்.

source: `Public domain country maps <http://ian.macky.net/pat/map/gq/gq.html>`_.
ta: `பொது டொமைன் நாட்டு வரைபடங்கள் <http://ian.macky.net/pat/map/gq/gq.html>` _.
