Repository: 247i/TACETr
Catalog: உரை/தானி/gmt-tutorials-pen-and-painting-*.po
Languages: ta

source: 畫筆與調色技巧
ta: தூரிகை மற்றும் வண்ண சரிசெய்தல் நுட்பங்கள்

source: 本教學適用於 GMT 6 的現代模式。如須參閱 GMT 6 (傳統模式) 與 GMT 4-5 繪製相似地圖的教程，\ `請至這裡 <pen_and_painting_gmt5.html>`_。
ta: இந்த கற்பித்தல் GMT 6 இன் நவீன மாதிரிக்கு ஏற்றது. சிஎம்டி 6 (பாரம்பரிய பயன்முறை) மற்றும் சிஎம்டி 4-5 உடன் ஒத்த வரைபடங்களை வரைவதற்கான டுடோரியலை நீங்கள் குறிப்பிட வேண்டும் என்றால், தயவுசெய்து இங்கே <ben_and_painting_gmt5.html> `_ க்குச் செல்லவும்.

source: 為了有效的在地圖上呈現資料，顏色與線條樣式應要謹慎選擇。為地圖挑選合適的配色是門藝術，地圖製作者通常都會花上許多時間，把地圖調整成看起來最調和、最舒服的外觀。這裡我們要介紹如何在 GMT 中操作相關設定，讓你能夠更快的找到心目中的完美配色。本章也會說明如何繪製簡單的色階圖例。
ta: வரைபடத்தில் தகவல்களை திறம்பட முன்வைக்க, வண்ணம் மற்றும் வரி பாணி எச்சரிக்கையாக இருக்க வேண்டும். வரைபடத்திற்கான சரியான வண்ணத் திட்டத்தைத் தேர்ந்தெடுப்பது கதவின் கலை. சிஎம்டியில் தொடர்புடைய அமைப்புகளை எவ்வாறு இயக்குவது என்பதை இங்கே அறிமுகப்படுத்துவோம், இதன் மூலம் உங்கள் மனதில் சரியான வண்ண பொருத்தத்தை விரைவாகக் காணலாம். இந்த அத்தியாயம் ஒரு எளிய வண்ண வரிசையை எவ்வாறு வரையலாம் என்பதையும் விளக்குகிறது.

source: 目標
ta: இலக்கு

source: 製作一張中美洲的地圖，海域部份為分層設色地形圖，陸域部份則依國家來著色，如下圖所示。被中美地峽與島嶼群圍起來的區域為\ `加勒比海 <https://zh.wikipedia.org/wiki/%E5%8A%A0%E5%8B%92%E6%AF%94%E6%B5%B7>`_，而左上方的海灣則為\ `墨西哥灣 <https://zh.wikipedia.org/wiki/%E5%A2%A8%E8%A5%BF%E5%93%A5%E6%B9%BE>`_。圖中可以找到此區域的十幾個比較大的國家，也可以發現加勒比海和墨西哥灣，都比東北方的大西洋要淺得多。根據地圖上的海床色階圖例，也可以發現最深的地方位於波多黎各北方的海溝，有大概 8000 多公尺深。
ta: நடு அமெரிக்காவின் வரைபடத்தை உருவாக்குங்கள். சினோ -ச் சார்ச் மற்றும் தீவு குழுவால் சூழப்பட்ட பகுதி \ `` கரீபியன் கடல் <https://zh.wikipedia.org/wiki/%E5%8A0%E5%8B%92%E6%AF%94P6% P b5%b7> `_, மற்றும் மேல் இடதுபுறத்தில் உள்ள விரிகுடா மெக்சிகோ வளைகுடா <https://zh.wikipedia.org/wiki/%E5%A8%A8%E8%BF%E5 %93%A5%A5%A5%A5%A5%A E6%B9%BE> `_. படத்தில், இந்த பகுதியில் ஒரு டசன் பெரிய நாடுகளை நீங்கள் காணலாம். வரைபடத்தில் கடல் படுக்கை வண்ண படிகளின்படி, புவேர்ட்டோ ரிக்கோவின் வடக்கே அகழியில் ஆழமான இடம் அமைந்துள்ளது என்பதையும் நீங்கள் காணலாம், சுமார் 8,000 மீட்டர் ஆழத்தில்.

source: 直接觀看\ `指令稿`_
ta: \ `` அறிவுறுத்தல் வரைவு `_ ஐப் பாருங்கள்

source: 使用的指令與概念
ta: பயன்படுத்தப்படும் வழிமுறைகள் மற்றும் கருத்துக்கள்

source: ``coast`` - **為國家上色**
ta: `` கடற்கரை`` - ** என்பது நாட்டின் நிறம் **

source: ``grdimage`` - 繪製著色影像
ta: `` grdimage`` - வண்ண படங்களை வரையவும்

source: ``colorbar`` - **繪製色階條**
ta: `` colorbarbar`` - ** வண்ண வரைதல் தரப் பட்டி **

source: ``grdinfo`` - 查閱網格檔的基本資訊
ta: `` grdinfo`` -கட்டம் கோப்பின் அடிப்படை தகவல்களைப் பாருங்கள்

source: 外部指令 ``grep`` - **在 GMT 的輸出中搜尋字串** (Windows 為 ``findstr``) (非必要)
ta: வெளிப்புற வழிமுறைகள் `GREP`` - ** GMT இன் வெளியீட்டில் சரத்தைத் தேடுங்கள் ** (விண்டோச்` FindStr``) (தேவையற்றது)

source: 如何指定作圖顏色
ta: படத்தின் நிறத்தை எவ்வாறு குறிப்பிடுவது

source: 畫筆的屬性設定
ta: தூரிகையின் பண்புக்கூறு அமைப்பு

source: 疊加多個圖層
ta: பல அடுக்குகள்

source: 在腳本中使用變數以美化排版
ta: தட்டச்சுப்பொறியை அழகுபடுத்த ச்கிரிப்டில் மாறிகளைப் பயன்படுத்தவும்

source: 使用錨點指定色階條的繪製位置
ta: வண்ண ஆர்டர் பட்டியின் வரைதல் நிலையைக் குறிப்பிட நங்கூரம் புள்ளியைப் பயன்படுத்தவும்

source: 前置作業
ta: முன் -செயல்பாடு

source: 在本章中，我們一樣會使用 GMT 伺服器提供的 ``@earth_relief_01m`` 資料庫。相關的介紹請看「\ :doc:`coloring_topography`\ 」。本次的作圖區域，是 ``-R-100/1/-50/34r``，如以下 *Google Map* 截圖所示。有關 ``-R`` 的詳細說明，請參閱「\ :doc:`making_first_map`\ 」。
ta: இந்த அத்தியாயத்தில், GMT சேவையகத்தால் வழங்கப்பட்ட `` `` _ நிவாரணம்_01m`` தரவுத்தளத்தைப் பயன்படுத்துவோம். தொடர்புடைய அறிமுகத்திற்கு, தயவுசெய்து "\: DOC:` வண்ணமயமாக்கல்_டோபோகிராபி` \ "ஐப் பார்க்கவும். இந்த நேரத்தின் படப் பகுதி `` -r-1 100/1/-50/34r``, பின்வரும் * Google வரைபடம் * ச்கிரீன்சாட்டில் காட்டப்பட்டுள்ளது. `` -R`` இல் விரிவான வழிமுறைகளுக்கு, "\: DOC:` Macking_first_map` \ "ஐப் பார்க்கவும்.

source: 操作流程
ta: செயல்பாட்டு செயல்முறை

source: 我們先來分析一下目標的地圖。在此地圖中有很多不同的元素，依照固定的順序疊加。如果認真檢查，這些元素可以分成四群，由底層到頂層分別為
ta: இலக்கின் வரைபடத்தை முதலில் பகுப்பாய்வு செய்வோம். இந்த வரைபடத்தில் பல்வேறு கூறுகள் உள்ளன, அவை நிலையான வரிசையில் மிகைப்படுத்தப்பட்டுள்ளன. நீங்கள் கவனமாகச் சரிபார்த்தால், இந்த கூறுகளை நான்கு குழுக்களாக பிரிக்கலாம், கீழே இருந்து மேல் அடுக்கு வரை

source: 地形圖
ta: நிலப்பரப்பு

source: 國家的著色
ta: தேசத்தின் நிறம்

source: 海岸線、國家邊界與地圖格線
ta: கடற்கரை, தேசிய எல்லை மற்றும் வரைபட கட்டம் வரி

source: 色階圖例的區塊
ta: வண்ண படி புராணத்தின் தொகுதி

source: 因此，我們的 GMT 繪圖腳本，應該也要照如上的順序進行繪圖，也就是說程式碼看起來會長這樣
ta: எனவே, எங்கள் சிஎம்டி வரைதல் ச்கிரிப்டும் மேலே உள்ள வரிசையில் வரையப்பட வேண்டும், அதாவது குறியீடு இப்படி தெரிகிறது

source: 第一段：海底地形圖 (grdimage) 第二段：國家的著色 (coast) 第三段：所有的線段 (coast) 第四段：色階條 (colorbar)
ta: பத்தி 1: grdimage பிரிவு 2: நாட்டின் வண்ணம் (கடற்கரை) 3 வது பத்தி: அனைத்து வரி பிரிவுகளும் (கடற்கரை) நான்காவது பத்தி: கலர்பார்

source: 海底地形圖和國家著色，都必需要指定繪圖的顏色或色階，所以這裡我們先來看看單一的顏色要怎麼指定。最簡單，並也在之前的章節使用的一種方法，就是指定顏色的名稱。GMT 支援了超過百種顏色的名稱，可以在\ `這邊 <https://docs.generic-mapping-tools.org/latest/gmtcolors.html?highlight=gmtcolor#list-of-colors>`_\ 查看並使用。例如說以下指令
ta: கடலின் நிலப்பரப்பு வரைபடம் மற்றும் நாட்டின் நிறம் வரைபடத்தின் நிறம் அல்லது நிறத்தைக் குறிப்பிட வேண்டும், எனவே முதலில் இங்கே ஒரு வண்ணத்தை எவ்வாறு குறிப்பிடுவது என்பதைப் பார்ப்போம். முந்தைய அத்தியாயத்தில் எளிமையான மற்றும் மிகவும் பயன்படுத்தப்பட்ட முறை குறிப்பிட்ட வண்ணத்தின் பெயர். சிஎம்டி நூற்றுக்கும் மேற்பட்ட வண்ணங்களின் பெயரை ஆதரிக்கிறது, அவை <https://docs.gocs.gneric-tools.org/lag/gmtcolors.html. எடுத்துக்காட்டாக, பின்வரும் வழிமுறைகள்

source: gmt coast -Ggreen # ...後續省略
ta: GMT கோச்ட் -கிரீன் # ... பின்தொடர் -up

source: 可以把陸域染成綠色。由於這裡我們要著色的是個別的國家，所以得先介紹另外一個 ``coast`` 的選項 ``-E`` 才行。``-E`` 會讀取一個稱為 `DCW <https://www.soest.hawaii.edu/pwessel/dcw/>`_ 的資料庫，使用內含的國家邊界資料進行著色。``-E`` 的語法大致為
ta: நீங்கள் நிலத்தை பச்சை நிறத்தில் சாயமிடலாம். நாங்கள் இங்கு சில நாடுகளை வண்ணமயமாக்க விரும்புவதால், முதலில் மற்றொரு `` கடற்கரை` `-e`` இன் மற்றொரு விருப்பத்தை அறிமுகப்படுத்த வேண்டும். `` -E`` `dcw <https://www.soest.hawaii.edu/pwessel/dcw/> _ _, உள்ளே உள்ள தேசிய எல்லை தரவைப் பயன்படுத்தவும். `` -E`` இன் இலக்கணம் தோராயமாக

source: -E代碼1,代碼2,...+g填色+p畫筆
ta: -E குறியீடு 1, குறியீடு 2, ...+g நிரப்புதல் வண்ணம்+பி தூரிகை

source: 其中的\ ``代碼``\ 指的是 `ISO 3166-1 alpha-2 <https://en.wikipedia.org/wiki/ISO_3166-1_alpha-2>`_ 國家名稱的二位字母代碼，例如 ``TW`` 代表台灣，``US`` 代表美國等等。除了可以從維基百科查詢這些代碼以外，也可以輸入以下指令，直接在 GMT 中查詢：
ta: அவற்றில் \ `` குறியீடு `` ஐஎச்ஓ 3166-1 ஆல்பா -2 <https://en.wikipedia.org/wiki/iso_3166-1_alpha-2> `` tw`` பிரதிபலிக்கிறது அமெரிக்கா மற்றும் பல. விக்கிபீடியாவிலிருந்து இந்த குறியீட்டை வினவுவதோடு மட்டுமல்லாமல், நீங்கள் பின்வரும் வழிமுறைகளையும் உள்ளிட்டு நேரடியாக GMT இல் வினவலாம்:

source: $ gmt coast -E+l # 在螢幕中列出二位字母國碼 # 或 $ gmt coast -E+L # 在螢幕中列出二位字母國碼與幾個大國家的省份碼
ta: $ gmt Cost -e+l # இரண்டு -டைசிட் எழுத்துக்கள் தேசிய குறியீட்டை திரையில் பட்டியலிடுங்கள் # அல்லது $ Gmt Cost -e+l # இரண்டு -டைசிட் கடிதங்கள் தேசிய குறியீடு மற்றும் திரையில் பல பெரிய நாடுகளின் மாகாணக் குறியீட்டை பட்டியலிடுங்கள்

source: 這邊順便舉個方便的技巧：如果你想查詢特定國家 (已經知道英文國名) 的代碼，可以使用 ``sh`` 內建的 ``grep`` 指令來輔助查詢。如下這樣：
ta: மூலம், ஒரு வசதியான திறன்களை உருவாக்குங்கள்: நீங்கள் ஒரு குறிப்பிட்ட நாட்டின் குறியீட்டை வினவ விரும்பினால் (ஏற்கனவே ஆங்கில நாட்டின் பெயரை அறிந்திருக்கிறீர்கள்), விசாரணைகளுக்கு உதவ நீங்கள் கட்டப்பட்ட `` grep`` வழிமுறைகளைப் பயன்படுத்தலாம். பின்வருமாறு:

source: $ gmt coast -E+l | grep -i japan JP Japan
ta: $ gmt Coard -e+l | grep -i சப்பான் சே.பி. சப்பான்

source: 這邊的 ``-i`` 選項是「大小寫視為相同」之意。在下方的搜尋結果中，就出現了日本的代碼 ``JP``。
ta: `` `` `` இங்கே “வழக்கு ஒன்றுதான்” என்று பொருள். கீழேயுள்ள தேடல் முடிவுகளில், சப்பானிய குறியீடு `jp`` தோன்றும்.

source: 如果你的作業系統是 **Windows**，內建會沒有 ``grep``，但你可以使用替代的指令 ``findstr`` 來操作，如下：
ta: உங்கள் வேலை முறை ** சாளரங்கள் ** என்றால், கட்டப்பட்ட -இனில் `` கிரெப்`` இருக்காது, ஆனால் பின்வருமாறு செயல்பட ஒரு மாற்று வழிமுறையை `ஃபைண்ட்ச்ட்ச்ட்ரேசன்` பயன்படுத்தலாம்:

source: $ gmt coast -E+l | findstr /i japan
ta: $ gmt Coard -e+l | findstr /i சப்பான்

source: 如果你想要使用 ``grep`` 一次查詢多個國家，可以使用如下語法：
ta: ஒரு நேரத்தில் பல நாடுகளை வினவுவதற்கு `` grep`` ஐப் பயன்படுத்த விரும்பினால், நீங்கள் பின்வரும் தொடரியல் பயன்படுத்தலாம்:

source: $ gmt coast -E+l | grep -i 'japan\|singapore\|zealand'
ta: $ gmt Coard -e+l | grep -i 'சப்பான் \ | சிங்கப்பூர் \ | சிலாந்து'

source: 這樣程式會一次把日本、新加坡跟紐西蘭的代碼找出來。
ta: இந்த வழியில், குறியீடு சப்பான், சிங்கப்பூர் மற்றும் நியூசிலாந்து குறியீட்டைக் கண்டுபிடிக்கும்.

source: 接下來就是\ **填色**。GMT 實際上支援了六種顏色表達方式，分別為
ta: அடுத்த கட்டம் \ ** வண்ண நிரப்புதல் **. சிஎம்டி உண்மையில் ஆறு வண்ண வெளிப்பாடு முறைகளை ஆதரிக்கிறது, அதாவது

source: 「green」 # 1. 使用顏色名稱 「255/99/71」 # 2. 使用 R/G/B 值 (從 0 到 255)，左邊這是蕃茄色 「#87CEEE」 # 3. 使用 HTML 標記的顏色表示法 (#RRGGBB，十六進位)，左邊這是天藍色 「25-0.86-0.82」 # 4. 使用 H-S-V 值 (前者從 0 到 255，後兩者從 0 到 1)，左邊這是巧克力色 「8/8/0/2」 # 5. 使用 C/M/Y/K 值 (百分比表示)，左邊這是薰衣草色 「169」 # 6. 灰階號碼，此例相當於 R/G/B 的 169/169/169
ta: "பச்சை" # 1. வண்ண பெயரைப் பயன்படுத்தவும் "255/99/71" # 2. r/g/b மதிப்பைப் பயன்படுத்தவும் (0 முதல் 255 வரை), இடதுபுறத்தில் உள்ள தக்காளி வண்ணம் "#87CEEE"#3 குறிக்கப்பட்ட உஉகுமொ இன் வண்ண பிரதிநிதித்துவத்தைப் பயன்படுத்தவும். "25-0.86-0.82" #4. H-S-V மதிப்பைப் பயன்படுத்தவும் (முந்தையது 0 முதல் 255 வரை, பிந்தைய இரண்டு 0 முதல் 1 வரை), இடது பக்கம் சாக்லேட் "8/8/0/2" # 5. சி/எம்/ஒய்/கே மதிப்பைப் பயன்படுத்தவும் (சதவீத பிரதிநிதித்துவம்), இடது பக்கம் லாவெண்டர் "169" # 6. சாம்பல் ஆர்டர் எண், இந்த எடுத்துக்காட்டு 169/169/169 க்கு சமம் r/g/b

source: 你可以使用你喜歡的表達方式給定顏色。這邊我們要試著幫墨西哥 (代碼 ``MX``) 塗上磚紅色，使用 HTML 標記的代碼 ``#CD5C5C``，語法如下：
ta: வண்ணம் கொடுக்க உங்களுக்கு பிடித்த வெளிப்பாட்டைப் பயன்படுத்தலாம். இங்கே நாம் மெக்சிகோ (குறியீடு `MX``) செங்கல் சிவப்பு வண்ணம் தீட்டவும், HTML`#CD5C5C`` ஆல் குறிக்கப்பட்ட குறியீட்டைப் பயன்படுத்தவும் முயற்சிக்க வேண்டும், இலக்கணம் பின்வருமாறு:

source: $ gmt coast -R-100/1/-50/34r -JM15c -EMX+g#CD5C5C -png central_america # 地圖 15 公分寬
ta: $ Gmt Coart -r -100/1/-50/34r -jm15c -emx+g # cd5c5c -png சென்ட்ரல்_அமெரிக்கா # வரைபடம் 15 செ.மீ அகலம்

source: 成品就會看到有個磚紅色的區塊，這就是墨西哥的國土。
ta: முடிக்கப்பட்ட தயாரிப்பு ஒரு செங்கல் -ரெட் தொகுதியைக் காணும், இது மெக்சிகோவின் நிலமாகும்.

source: 因為我們等一下會為不同的國家塗上不同的顏色，為了程式碼的美觀，可以把顏色和對應的國家先以變數的方式存放，之後執行 ``coast`` 再使用這些變數。這種方式除了可以整齊排版，更利於之後的編輯修改。每個 shell 指定變數的方式略有不同，這裡以 ``bash`` 為示範，變數的指定與取方式為：
ta: வெவ்வேறு நாடுகள் வெவ்வேறு வண்ணங்களைப் பயன்படுத்துவதற்கு நாங்கள் காத்திருப்போம். சுத்தமாக தட்டச்சு செய்வதோடு கூடுதலாக, இந்த முறை திருத்துதல் மாற்றத்திற்கு மிகவும் உகந்தது. ஒவ்வொரு செல்லும் மாறிகளைக் குறிப்பிடும் முறை இங்கே `` பாச்`` உடன் ஒரு ஆர்ப்பாட்டம்.

source: 變數名稱='變數內容' # 指定變數 ${變數名稱} # 存取變數 (這串文字會被'變數內容'取代掉)
ta: மாறி பெயர் = 'மாறி உள்ளடக்கம்' # குறிப்பிட்ட மாறி $ {மாறி பெயர்} # அணுகல் மாறி (இந்த உரையின் சரம் 'மாறி உள்ளடக்கம்' மூலம் மாற்றப்படும்)

source: 把上述語法套用到我們的例子中，就像是這樣：
ta: மேற்கண்ட இலக்கணத்தை எங்கள் எடுத்துக்காட்டில் வைப்பது இது போன்றது:

source: color1='#CD5C5C' colorgroup1='MX,BR,PA,DO' gmt coast -R-100/1/-50/34r -JM15c -E${colorgroup1}+g${color1} -png central_america
ta: color1 = '#CD5C5C' colorGroup1 = 'mx, br, pa, do' gmt cost -r -100/1/-50/34r -jm15c -e $ {colorgroup1}+g $ {color1} -png central_america

source: 以上腳本可以把墨西哥 (``MX``)、巴西 (``BR``)、巴拿馬 (``PA``) 和多明尼加 (``DO``) 一次塗上磚紅色。如果你想要更改顏色或國家，只要修改變數 ``colorgroup1`` 或 ``color1`` 的內容即可，不需要動到 ``coast`` 的指令。
ta: மேற்கண்ட ச்கிரிப்ட்கள் மெக்சிகோ (`` Mx``), பிரேசில் (`` Br``), பனாமா (`` pa``) மற்றும் டொமினிகா (`` `` `` `` `` `` `` `` ` ``). நீங்கள் வண்ணத்தை அல்லது நாட்டை மாற்ற விரும்பினால், `ColorGroup1`` அல்லது` color1`` என்ற மாறியின் உள்ளடக்கங்களை மாற்றவும்,` கடற்கரை`` இன் அறிவுறுத்தலுக்கு நீங்கள் செல்ல தேவையில்லை.

source: 由於不同的指令列環境有不同的變數設定方式，而且是值得另闢章節討論的話題，在此我們先略過這些內容以集中精神在 GMT 指令上。有關於變數指定的細節，請參考你所使用的 shell 如 cmd、bash 或 csh 等的技術專書或網頁。
ta: வெவ்வேறு வழிமுறைகள் வெவ்வேறு மாறி அமைப்புகளைக் கொண்டிருப்பதால், மற்றொரு அத்தியாயத்தில் விவாதிக்க வேண்டிய தலைப்புகள் என்பதால், சிஎம்டி அறிவுறுத்தல்களில் கவனம் செலுத்த இந்த உள்ளடக்கங்களைத் தவிர்ப்போம். மாறிகளில் குறிப்பிடப்பட்டுள்ள விவரங்களுக்கு, சிஎம்டி, பாச் அல்லது சிஎச்எச் போன்ற நீங்கள் பயன்படுத்திய செல்லின் தொழில்நுட்ப புத்தகங்கள் அல்லது வலைப்பக்கங்களைப் பார்க்கவும்.

source: 有許多不錯的網頁調色盤，如 `HTML color codes <http://html-color-codes.info/>`_，可以幫助你用視覺化的方式挑選你想要的顏色，然後再把色碼貼到腳本變數中就行了。好好尋找你想要的顏色吧！
ta: `HTML வண்ணக் குறியீடுகள் <http: // html-color-info/> _ _ போன்ற பல நல்ல வலைப்பக்கங்கள் உள்ளன, நீங்கள் விரும்பும் வண்ணத்தை காட்சி வழியில் தேர்வுசெய்ய உதவும், பின்னர் வண்ணம் ஒட்டிக்கொண்டது ச்கிரிப்ட் மாறி. நீங்கள் விரும்பும் வண்ணத்தைத் தேடுங்கள்!

source: 接下來，只要依樣畫葫蘆，把所有的鄰近國家都填上顏色就可以了。依照\ `上一章 <coloring_topography.html>`_\ 所示，我們先使用 ``grdimage`` 畫地形底圖，再使用 ``coast`` 把剛剛提的所有東西填上去：
ta: அடுத்து, அதே வழியில் சுரைக்காயை வரையவும், அருகிலுள்ள அனைத்து நாடுகளையும் வண்ணத்துடன் நிரப்பவும். \ `முந்தைய <coloring_topography.html>` _ இருந்து இன் படி, நாங்கள் முதலில் `` `grdimage`` இன் கீழ் வரைபடத்தைப் பயன்படுத்துகிறோம், பின்னர் இப்போது குறிப்பிட்ட அனைத்தையும் நிரப்பவும்:

source: # ==== 設定顏色與對應的國家 ==== # mexico, brazil, costa rica, dominican color1='#CD5C5C' colorgroup1='MX,BR,CR,DO' # guatemala, venezuela, jamaica, french guiana, bahamas color2='pink' colorgroup2='GT,JM,VE,GF,BS' # united states, puerto rico, nicaragua, guyana color3='240/230/140' colorgroup3='US,PR,NI,GY' # belize, haiti, trinidad and tobago, panama, salvador color4='0/36/74/4' colorgroup4='BZ,HT,TT,PA,SV' # colombia, cuba, honduras, suriname color5='97-0.52-0.94' colorgroup5='CO,CU,HN,SR' # 其他國家 color0='169' # ==== 主要指令 ==== gmt begin central_america png gmt grdimage @earth_relief_01m -JB-80.27/8.58/-8/24/15c -R-100/1/-50/34r -Cgeo gmt coast -G${color0} \ -E${colorgroup1}+g${color1} \ -E${colorgroup2}+g${color2} \ -E${colorgroup3}+g${color3} \ -E${colorgroup4}+g${color4} \ -E${colorgroup5}+g${color5} gmt end
ta: # ==== வண்ணத்தையும் அதனுடன் தொடர்புடைய நாட்டையும் அமைக்கவும் ==== # மெக்சிகோ, பிரேசில், கோச்டாரிகா, டொமினிகன் color1 = '#CD5C5C' colorGroup1 = 'mx, br, cr, do' # குவாத்தமாலா, வெனிசுலா, சமைக்கா, பிரஞ்சு கயானா, பஆமாச் color2 = 'இளஞ்சிவப்பு' ColorGroup2 = 'gt, jm, ve, gf, bs' # ஒன்றுபட்டது ச்டேட்ச், புவேர்ட்டோ ரிக்கோ, நிகரகுவா, கயானா color3 = '240/230/140' colorGroup3 = 'US, PR, Ni, Gy' # பெலிச், ஐட்டி, டிரினிடாட் மற்றும் டொபாகோ, பனாமா, சால்வடார் color4 = '0/36/74/4' colorGroup4 = 'BZ, HT, TT, PA, SV' # கொலம்பியா, கியூபா, ஓண்டுராச், சுரினாம் color5 = '97 -0.52-0.94 ' colorGroup5 = 'co, cu, hn, sr' # பிற நாடுகள் color0 = '169' # ==== முக்கிய வழிமுறைகள் ==== Gmt தொடங்கும் மத்திய_அமெரிக்கா பி.என்.சி. Gmt grdimage @earth_relief_01m-jb-80.27/8.58/24/15c -r-100/1/-50/34r -cgeo gmt cost -g $ {color0} \ -E $ {colorgroup1}+g $ {color1} \ -E $ {colorgroup2}+g $ {color2} \ -E $ {colorgroup3}+g $ {color3} \ -E $ {colorgroup4}+g $ {color4} \ -E $ {colorgroup5}+g $ {color5} GMT முடிவு

source: 注意在 ``grdimage`` 中，``-J`` 選項使用了 ``B``，這是另一種稱為 `Albers 投影 <https://zh.wikipedia.org/wiki/%E4%BA%9A%E5%B0%94%E5%8B%83%E6%96%AF%E6%8A%95%E5%BD%B1>`_\ 的地圖投影法，是一種圓錐型投影，可使地圖上的每個區域面積保持一致。它的語法為
ta: `` Grdimage`` இல், `` `` `விருப்பம்` `பி`` ஐப் பயன்படுத்துகிறது என்பதை நினைவில் கொள்க, இது` ஆல்பர்ச் ப்ரொசெக்சன் <https://zh.wikipedia.org/wiki/%E4%E4 என அழைக்கப்படுகிறது %பா%9a%E5%B0%94%E5%8B%83%E6%E6%AF%E6%8A%E5%BD%B1> `_ \ MAP MAP திட்ட முறை ஒரு கூம்பு -வடிவ திட்டமாகும், இது செய்ய முடியும் வரைபடத்தில் ஒவ்வொரு பகுதியிலும் நிலைத்தன்மை. அதன் இலக்கணம்

source: -JB投影中心經線/投影中心緯線/圓錐上端緯線/圓錐下端緯線/地圖尺寸
ta: -JB ப்ரொசெக்சன் சென்டர் மெரிடியன்/ப்ரொசெக்சன் சென்டர் வெஃப்ட்/கூம்பு மேல் அட்சரேகை வரி/கூம்பு கீழ் இறுதியில் WEFT/MAP அளவு

source: 另外，在「\ :doc:`coloring_topography`\ 」中也提過，地形資料的 ``-C`` 選項 (色階) 預設值是 ``geo``。這邊我們為了使讀者了解我們使用的設定，因此特地加上 ``-Cgeo``。實際上，就算不加上色階檔檔名 (``-C`` 或乾脆省略)，GMT 也會使用相同的色階畫圖。在\ ``設定顏色與對應的國家``\ 的部份，我們總共指定了 6 種顏色與 22 個國家。``color0`` 是灰色，用於中美洲其餘的國家。而在\ ``主要指令``\ 中，我們先使用 ``-G`` 把所有陸域塗上灰色，然後再使用 ``-E`` 為各個國家填色。你會發現所有的 ``-E`` 選項都可以被加在同一個 ``coast`` 指令內，省去重複輸入的麻煩！整個腳本執行的結果如下所示 (中文註解可能要改成英文才可順利執行)。
ta: கூடுதலாக, "\: DOC:` வண்ணமயமாக்கல்_டோபோகிராபி` \ " நாங்கள் பயன்படுத்தும் அமைப்புகளைப் புரிந்துகொள்ள வாசகர்களை அனுமதிக்க, நாங்கள் `` `` `` `` `` `` ``. உண்மையில், வண்ண ஆர்டர் கோப்பு பெயர் சேர்க்கப்படாவிட்டாலும் (`` -c`` அல்லது வெறுமனே தவிர்க்கப்பட்டாலும்), GMT அதே வண்ண கிராபிக்ச் பயன்படுத்தும். \ `` `` `` `` \ தொடர்புடைய நாடுகளில், நாங்கள் மொத்தம் 6 வண்ணங்களையும் 22 நாடுகளையும் நியமித்தோம். `` Color0`` சாம்பல், இது நடு அமெரிக்காவின் பிற நாடுகளில் பயன்படுத்தப்படுகிறது. \ `` முதன்மையான அறிவுறுத்தல்கள் `\ இல், முதலில் அனைத்து நிலங்களையும் சாம்பல் நிறத்தைப் பயன்படுத்த` `-g`` ஐப் பயன்படுத்துகிறோம், பின்னர் பல்வேறு நாடுகளுக்கான நிறத்தை நிரப்ப` `` -e`` ஐப் பயன்படுத்துகிறோம். அனைத்து `` -e`` விருப்பங்களையும் ஒரே `கடற்கரை`` அறிவுறுத்தலில் சேர்க்கலாம், மீண்டும் மீண்டும் உள்ளீட்டின் சிக்கலை நீக்குகிறது! முழு ச்கிரிப்ட் செயல்படுத்தலின் முடிவுகளும் கீழே காட்டப்பட்டுள்ளன (சீன சிறுகுறிப்புகள் அதை சீராக செயல்படுத்த ஆங்கிலத்திற்கு மாற்றப்படலாம்).

source: 接下來，我們再為國界和海岸線畫點線，國家就會更突顯出來。在\ :doc:`making_first_map`\ 中，我們曾經提及線條的「畫筆樣式」由三個部份組成：``粗細,顏色,樣式``。``粗細`` 可以為預先定義好的名稱，像是 ``thinner``、``thickest``，``fat``\ 等等，總共有 12 個，所有的名稱可以在\ `此連結 <https://docs.generic-mapping-tools.org/latest/cookbook/features.html?highlight=pen%20attributes#specifying-pen-attributes>`_\ 查詢。如果你想要自訂粗細，也可以使用 ``c`` (公分)、``i`` (英吋)、``p`` (點) 等長度單位，如 ``0.1c`` 就是 0.1 公分。畫筆的\ ``顏色``\ 與上述的色碼通用，選你喜歡的表達方式即可。畫筆的\ ``樣式``\ 預設是連續線條，你可以使用 ``-`` (折線) 與 ``.`` (點) 自由的混搭樣式，如 ``-..`` 會畫出折線中間間隔兩個點的線條。以下是一些示範：
ta: அடுத்து, தேசிய எல்லைகள் மற்றும் கடற்கரைக்கு ஒரு கோட்டை வரையும்போது, ​​நாடு மிகவும் முக்கியத்துவம் வாய்ந்ததாக இருக்கும். \: Doc: `Maink_first_map` \ இல், வரிகளின்" தூரிகை பாணி "மூன்று பகுதிகளைக் கொண்டுள்ளது என்று ஒரு முறை குறிப்பிட்டோம்: தடிமன், நிறம், நடை`. `` தடிமன் `` `` மெல்லிய`, `தடிமனான`,` கொழுப்பு`` \ மற்றும் <https://docs. சமீபத்திய/சமையல் புத்தகம்/அம்சங்கள். Html? சிறப்பம்சமாக = பேனா%20ATTributes #-ttributes> `_ \ வினவல். நீங்கள் தடிமன் ஆர்டர் செய்ய விரும்பினால், `` `பி` பி`` (புள்ளி) போன்ற` `` (அங்குல), `` `` போன்ற நீள அலகுகளையும் பயன்படுத்தலாம். `` `0.1 சி`` 0.1 செ.மீ. \ `` `The தூரிகையின் தூரிகை மேலே உள்ள வண்ணக் குறியீட்டிற்கு பொதுவானது, உங்களுக்கு பிடித்த வெளிப்பாட்டைத் தேர்வுசெய்க. `` தூரிகையின் `` `` \ இயல்புநிலை தொடர்ச்சியான கோடுகள், நீங்கள் `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `; . சில ஆர்ப்பாட்டங்கள் இங்கே:

source: thinner,green,- # 綠色的細折線 (0.5 點) 3p,100/0/100,. # 3 點寬，深紫色的點線 1c,#555555,--.. # 1 公分寬，灰色的 "--.." 樣式線條
ta: மெல்லிய, பச்சை,- # பச்சை நன்றாக மடிப்பு வரி (0.5 புள்ளிகள்) 3 பி, 100/0/100, 1 சி, # 555555,-.. # 1 செ.மீ அகலம், சாம்பல் "-.." பாணி ​​லைன்

source: ``coast`` 有三個跟畫線有關的指令，分別為
ta: `` கடற்கரை`` வரைபடக் கோட்டுடன் தொடர்புடைய மூன்று வழிமுறைகள் உள்ளன, அவை

source: -I編號/畫筆 # 畫上河流 -N編號/畫筆 # 畫上政治邊界 -W編號/畫筆 # 畫上水域邊界
ta: -I எண்/தூரிகை # நதி ஓட்டத்தில் ஓவியம் -N எண்/தூரிகை # நிறம் பூசப்பட்ட அரசியல் எல்லை -W எண்/தூரிகை # நீர் எல்லையில் ஓவியம்

source: 其中 ``-I`` 和 ``-N`` 的編號已在\ :doc:`coloring_topography`\ 中介紹過，而 ``-W`` 的編號可以為 ``1``、``2``、``3`` 及 ``4``，分別代表海岸線、湖岸線、湖中島岸線、湖中島中湖岸線。這裡我們就再使用一次 ``coast`` 把海岸線和國界線用 ``thinner`` 等級的線條來畫畫看，順便再使用 ``-Bafg`` 畫上地圖邊框及格線：
ta: அவற்றில், `` `` மற்றும்` `-n`` எண்ணிக்கை \: டாக்:` வண்ணமயமாக்கல்_டோபோகிராபி` \. கடற்கரை, ஏரி கரையோரம், லேக்சைட் தீவு கடற்கரை, மற்றும் ஏரியின் ஏரியின் ஏரி. கடற்கரை மற்றும் தேசிய எல்லைகளை கடற்கரை மற்றும் தேசிய எல்லைகளை வரைய நாங்கள் பயன்படுத்துகிறோம். `` `` `` `` `` `` `` `` `` `

source: # (前略) # ==== 主要指令 ==== gmt begin central_america png gmt grdimage @earth_relief_01m -JB-80.27/8.58/-8/24/15c -R-100/1/-50/34r -Cgeo gmt coast -G${color0} \ -E${colorgroup1}+g${color1} \ -E${colorgroup2}+g${color2} \ -E${colorgroup3}+g${color3} \ -E${colorgroup4}+g${color4} \ -E${colorgroup5}+g${color5} gmt coast -W1/thinner -N1/thinner -Di -Bafg gmt end
ta: # (前祥)) # ==== 主要指令 ============= Gmt தொடங்கும் மத்திய_அமெரிக்கா பி.என்.சி. Gmt gdimage @earth_relief_01m -80.27/8.58/-8/15c -r-r-r-r-/-50/34r -cgoo Gmt cost -g $ {color0} \ k -e $ {colorgroup1}}} '+g $ {color1}} \ -e $ {colorgroup2}}+g $ {color2} \ -e $ {colorgroup3}+g $ {color3} \ -e $ {colorgroup4}}+g $ {color4} \ -E $ {colorgroup5}+g $ {color5}} GMT COST -W1/TINNER -N1/TINNER -DI -BAFG GMT முடிவு

source: 這次的成品看起來就像這樣：
ta: இந்த நேரத்தில் முடிக்கப்பட்ட தயாரிப்பு இப்படி தெரிகிறது:

source: 不知道你有沒有發現換了投影方法的同時，邊框的形式也會跟著變化？有關邊框進一步的設定，請參閱\ :doc:`layout_design`。
ta: நீங்கள் திட்ட முறையை மாற்றும்போது, ​​எல்லையின் வடிவம் மாறும் என்று நீங்கள் கண்டறிந்தால் எனக்கு ஆச்சரியமாக இருக்கிறது? மேலும் அமைப்புகளுக்கு, \: doc: `layout_design` ஐப் பார்க்கவும்.

source: 為了清楚的表示海床的深度，最後我們要來加上色階圖例，顯示不同深度對應的顏色。在 GMT 6 中用來畫色階條與色階圖例的指令是 ``colorbar`` (在之前的版本中稱為 ``psscale``)。``colorbar`` 的基本語法為：
ta: கடல் படுக்கையின் ஆழத்தை தெளிவாகக் குறிக்க, இறுதியில் வெவ்வேறு ஆழங்களுக்கு ஒத்த வண்ணத்தைக் காண்பிக்க வண்ண படிகளைச் சேர்க்க வேண்டும். GMT 6 இல், வண்ண படிகள் மற்றும் வண்ண படிகளை வரையப் பயன்படுத்தப்படும் வழிமுறைகள் `` colorbar`` (முந்தைய பதிப்பில் `` psscale`` என அழைக்கப்படுகின்றன). `` Colorbar`` இன் அடிப்படை இலக்கணம்:

source: gmt colorbar -D[位置與尺寸] -B[格線、座標間距、標題等資訊]
ta: GMT colorBar -d [இருப்பிடம் மற்றும் அளவு] -B [கிரகம், இருக்கை இடைவெளி, தலைப்பு மற்றும் பிற தகவல்கள்]

source: ``colorbar`` 提供了設定 ``-D`` 的許多不同方法，這裡我們要使用最簡單的一種：
ta: `` கலர்பார் `அமைப்பதற்கான பல வேறுபட்ட முறைகளை வழங்கியது` -d``, இங்கே நாம் எளிமையான ஒன்றைப் பயன்படுத்த வேண்டும்:

source: -Dj[錨點位置]+w[色階條長度]
ta: -Dj [நங்கூரம் புள்ளி நிலை]+w [வண்ண ஒழுங்கு நீளம்]

source: ``-Dj`` 會使色階圖例被畫在地圖內部的\ **九宮格錨點**\ 中的任一個位置。GMT 使用 6 個字母來指定錨點的相對位置，分別是 ``L`` (左側)、``C`` (水平中央)、``R`` (右側)、``T`` (上方)、``M`` (垂直中央)、``B`` (下方)。前三個字母中挑一個加上後三個字母中挑一個，就能得到錨點的位置與相對應的組合：
ta: `` -Dj`` வரைபடத்தில் உள்ள \ ** சியுகோங் கட்டத்தின் \ ** சியுகோங் கட்டம் நங்கூரம் புள்ளியில் எந்த நிலையிலும் வண்ண ஒழுங்கு புராணத்தை வரையும். நங்கூர புள்ளியின் ஒப்பீட்டு நிலையைக் குறிப்பிட GMT 6 எழுத்துக்களைப் பயன்படுத்துகிறது, அதாவது `` l`` (இடது பக்கம்), `` c`` (மைய மையம்), `r``` (வலது பக்கம்),` t`` ), `` எம்`` (செங்குத்து மையம்), `` பி`` (கீழே). முதல் மூன்று எழுத்துக்களில் ஒன்றைத் தேர்ந்தெடுத்து, பிந்தைய மூன்று எழுத்துக்களில் ஒன்று நங்கூர புள்ளியின் நிலை மற்றும் அதனுடன் தொடர்புடைய கலவையைப் பெறலாம்:

source: LT CT RT LM CM RM LB CB RB
ta: Lt ct rt Lm cm rm எல்பி சிபி ஆர்.பி.

source: 如果我們想要在圖的中央右側畫上長度為 ``3`` 公分的色階圖例，只要這麼寫就行了：
ta: உருவத்தின் மையத்தில் உள்ள உருவத்தின் வலது பக்கத்தில் நீளத்தின் நீளத்துடன் ஒரு வண்ண செதில்களை வரைய விரும்பினால், அது எழுதப்படும் வரை:

source: 下一個 ``-B`` 選項基本上和 ``coast`` 的 ``-B`` 選項方法相同。不過因為色階條的顏色只沿著一維方向變化，我們必須要分開調整 x 軸和 y 軸的設定：
ta: அடுத்த `` -B`` விருப்பம் அடிப்படையில் `` `` `` கடற்கரை`` `` `கடற்கரை`` இன் முறை முறைக்கு சமம். இருப்பினும், வண்ண வரிசையின் நிறம் ஒரு பரிமாணத்தில் மட்டுமே மாறுவதால், ஃச் மற்றும் ஒய் அச்சின் அமைப்பை நாம் பிரிக்க வேண்டும்:

source: -Bx[格線與刻度 (afg 設定)]+l[擺在刻度一側的標籤] -By+l[擺在色階條一端的標籤]
ta: -BX [கட்டம் வரி மற்றும் அளவுகோல் (AFG அமைப்புகள்)]+L [அளவின் ஒரு பக்கத்தில் லேபிள்] -BY+L [வண்ண ஒழுங்கு பட்டியின் முடிவில் லேபிள்]

source: 這裡我們試著使用 ``-Bx3000`` (``afg`` 三種設定都是每隔 ``3000`` 單位繪製一次) 以及 ``-By+lm`` (在色階條一端寫上 ``m`` 這個字)。我們沒有要在有刻度的一側擺上任何標籤，所以在 ``-Bx`` 中的 ``+l`` 可以省略。把 ``colorbar`` 指令擺在 ``coast`` 後面，就能確保它被畫在地圖的頂層：
ta: இங்கே நாம் `` `` afg``` afg`` ஒவ்வொரு `3000`` ஐ ஒரு முறை வரையவும்) மற்றும்` `` பி+எல்எம்`` (வண்ண வரிசையின் ஒரு முனையில் எழுதுங்கள் `` எம்`` என்ற வார்த்தையைத் துடைக்கவும். நாம் அளவின் ஒரு பக்கத்தில் எந்த லேபிள்களையும் வைக்க வேண்டியதில்லை, எனவே `` `` `` `` `` `` `` `` `` `` `பி `` வரைபடத்தின் மேற்புறத்தில் வரையப்பட்டிருப்பதை உறுதிப்படுத்த `` கலர்பார்பார் "அறிவுறுத்தலை` கடற்கரை`` வைக்கவும்:

source: # (前略) # ==== 主要指令 ==== gmt begin central_america png gmt grdimage @earth_relief_01m -JB-80.27/8.58/-8/24/15c -R-100/1/-50/34r -Cgeo gmt coast -G${color0} \ -E${colorgroup1}+g${color1} \ -E${colorgroup2}+g${color2} \ -E${colorgroup3}+g${color3} \ -E${colorgroup4}+g${color4} \ -E${colorgroup5}+g${color5} gmt coast -W1/thinner -N1/thinner -Di -Bafg gmt colorbar -DjRM+w3c -Bx3000 -By+lm gmt end
ta: # (前祥)) # ==== 主要指令 ============= Gmt தொடங்கும் மத்திய_அமெரிக்கா பி.என்.சி. Gmt gdimage @earth_relief_01m -80.27/8.58/-8/15c -r-r-r-r-/-50/34r -cgoo Gmt cost -g $ {color0} \ k -e $ {colorgroup1}}} '+g $ {color1}} \ -e $ {colorgroup2}}+g $ {color2} \ -e $ {colorgroup3}+g $ {color3} \ -e $ {colorgroup4}}+g $ {color4} \ -E $ {colorgroup5}+g $ {color5}} GMT COST -W1/TINNER -N1/TINNER -DI -BAFG GMT colorBar -djrm+W3C -BX3000 -BY+LM GMT முடிவு
