Repository: 247i/TACETr
Catalog: உரை/தானி/gmt-tutorials-layout-design-*.po
Languages: ta

source: 版面設計與地圖的幾何布局
ta: உபகரணங்கள் வடிவமைப்பு மற்றும் வரைபட வடிவியல் தளவமைப்பு

source: 本教學適用於 GMT 6 的現代模式。如須參閱 GMT 6 (傳統模式) 與 GMT 4-5 繪製相似地圖的教程，\ `請至這裡 <layout_design_gmt5.html>`_。
ta: இந்த கற்பித்தல் GMT 6 இன் நவீன மாதிரிக்கு ஏற்றது. சிஎம்டி 6 (பாரம்பரிய பயன்முறை) மற்றும் சிஎம்டி 4-5 உடன் ஒத்த வரைபடங்களை வரைவதற்கான டுடோரியலை நீங்கள் குறிப்பிட வேண்டும் என்றால், தயவுசெய்து இங்கே வாருங்கள் <laayout_design_gmt5.html> `_.

source: 接下來讓我們來探討一下 GMT 的版面設計功能。GMT 使用了許多預設選項，讓使用者不需做太多設定就能產生想要的地圖。如果我們想設計比較複雜的配置，例如版面分割、邊框樣式調整、字型與字體樣式，就需要調整 GMT 的「使用者組態設定」。另外，我們也會在這裡介紹地理空間資料常用的兩大類座標：平面與球面，以及 GMT 作圖時的相關設定。
ta: GMT இன் தளவமைப்பு செயல்பாடு பற்றி விவாதிப்போம். சிஎம்டி பல முன்னமைக்கப்பட்ட விருப்பங்களைப் பயன்படுத்துகிறது, இதனால் பயனர்கள் பல அமைப்புகளை உருவாக்காமல் விரும்பிய வரைபடத்தை உருவாக்க முடியும். தளவமைப்பு பிரிவு, எல்லை பாணி சரிசெய்தல், எழுத்துரு மற்றும் எழுத்துரு பாணி போன்ற மிகவும் சிக்கலான உள்ளமைவுகளை வடிவமைக்க விரும்பினால், GMT இன் "பயனர் உள்ளமைவு அமைப்புகளை" சரிசெய்ய வேண்டும். கூடுதலாக, புவியியல் விண்வெளி தரவுகளில் பொதுவாகப் பயன்படுத்தப்படும் இரண்டு முக்கிய வகை இருக்கைகளையும் இங்கே அறிமுகப்படுத்துவோம்: வானூர்தி மற்றும் கோள மேற்பரப்பு மற்றும் GMT இன் தொடர்புடைய அமைப்புகள்.

source: 目標
ta: இலக்கு

source: 繪製從蒙古\ *烏蘭巴托* (Ulaanbaatar) 到美國\ *西雅圖* (Seattle) 的\ `大圓路徑 <https://en.wikipedia.org/wiki/Great-circle_distance>`_ (**Great Circle** Route) 與\ `恆向線 <https://en.wikipedia.org/wiki/Rhumb_line>`_ (**Rhumb Line**)。大圓路徑指的是沿著大圓 (半徑為地球半徑的的圓) 前進的路徑，恆向線則是對於所有的子午線，交角皆相等的路線。本章地圖使用了兩個不同的投影方法，上圖為「蘭伯特等積方位投影」 (**Lambert** azimuthal equal-area projection) ，下圖為「麥卡托投影」(**Mercator** Projection)。圖中說明了幾個特點：
ta: மங்கோலியா \*ulan bato*(ulaanbaatar) இலிருந்து \ `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` `` `/வட்டம் ** பாதை) மற்றும் \` சி <https://en.wikipedia.org/wiki/rhumb_line> _ (** ரம்ப் வரி **). டான்யுவான் சாலை விட்டம் என்பது பெரிய வட்டத்துடன் முன்னேறும் ஒரு பாதையை குறிக்கிறது (பூமியின் ஆரம் கொண்ட ஆரம்), மற்றும் நிலையான வரி என்பது அனைத்து மெரிடியனுக்கும் சம கோணங்களைக் கொண்ட கோடு. இந்த அத்தியாயத்தின் வரைபடம் இரண்டு வெவ்வேறு திட்ட முறைகளைப் பயன்படுத்துகிறது. படம் பல பண்புகளை விளக்குகிறது:

source: 恆向線在麥卡托投影中會以直線呈現，而大圓路徑在相同的圖中則是曲線。不過，大圓路徑才是兩地之間實際較短的路徑。
ta: நிலையான வரி மெக்காடோவில் ஒரு நேர் கோட்டில் வழங்கப்படும், அதே நேரத்தில் பெரிய வட்ட பாதை அதே உருவத்தில் வளைந்திருக்கும். இருப்பினும், பெரிய வட்ட பாதை இரண்டு இடங்களுக்கிடையில் குறுகிய பாதை.

source: 連接到蘭伯特等積方位投影中心點 (本例中為烏蘭巴托) 的大圓路徑會是直線，恆向線則變成曲線。這是比較能直觀連結它們的實際長度的一種方法，也是投影名稱的「方位」二字緣由 (大圓路徑保持在相同方位)。
ta: லாங்பெர்ட்டின் திரட்டப்பட்ட நிலைக்கு (இந்த எடுத்துக்காட்டில்) இணைக்கப்பட்ட பெரிய வட்ட பாதை ஒரு நேர் கோட்டாக இருக்கும், மேலும் நிலையான திசை வரி வளைவாக மாறும். இது அவற்றின் உண்மையான நீளத்தை உள்ளுணர்வாக இணைக்கக்கூடிய ஒரு வழியாகும், மேலும் திட்ட பெயரின் "நோக்குநிலை" க்கான காரணம் (பெரிய வட்ட பாதை ஒரே நிலையில் பராமரிக்கப்படுகிறது).

source: 另外，本地圖也替換了 GMT 的預設字型、顏色與版面配置。這些細節將會在以下部份一一解說。
ta: கூடுதலாக, வரைபடம் GMT இன் முன்னமைக்கப்பட்ட எழுத்துரு, வண்ணம் மற்றும் தளவமைப்பையும் மாற்றுகிறது. இந்த விவரங்கள் பின்வரும் பகுதிகளில் விளக்கப்படும்.

source: 直接觀看\ `指令稿`_
ta: \ `` அறிவுறுத்தல் வரைவு `_ ஐப் பாருங்கள்

source: 使用的指令與概念
ta: பயன்படுத்தப்படும் வழிமுறைகள் மற்றும் கருத்துக்கள்

source: ``defaults`` - **查看 GMT 的預設作圖參數**
ta: `` இயல்புநிலை`` - ** GMT இன் முன்னமைக்கப்பட்ட வரைதல் அளவுருவைக் காண்க **

source: ``set`` - **更改 GMT 的預設作圖參數**
ta: `` set`` - ** GMT இன் முன்னமைக்கப்பட்ட வரைதல் அளவுருவை மாற்றவும் **

source: ``plot`` - **在地理座標系統上畫點和線**
ta: `` சதி`` - ** புவியியல் ஒருங்கிணைப்பு அமைப்பில் புள்ளிகளையும் வரிகளையும் வரையவும் **

source: ``text`` - **詳細的設定標記在圖上的文字**
ta: `` உரை`` - ** விரிவான அமைப்பு படத்தில் குறிக்கப்பட்ட உரையை **

source: ``basemap`` - 設定繪圖區、座標軸與邊框
ta: `` பேச்மேப்`` -வரைதல் பகுதி, அச்சு மற்றும் எல்லை

source: ``coast`` - 繪製海岸線與國界
ta: `` கடற்கரை`` -கடற்கரையையும் எல்லையையும் வரையவும்

source: 外部指令 ``rm`` - **刪除檔案** (Windows 為 ``del``)
ta: வெளிப்புற வழிமுறைகள் `rm`` - ** கோப்புகளை நீக்கு ** (விண்டோச்` டெல்``)

source: 外部指令 ``echo`` - 把資料輸入到管線命令中
ta: வெளிப்புற வழிமுறைகள் `` எதிரொலி`` - பைப்லைன் கட்டளையில் தரவை உள்ளிடவும்

source: GMT 共用選項：``-X`` ``-Y`` ``-:``
ta: GMT பகிர்வு விருப்பங்கள்: `` `` `` `` `-:` ``

source: GMT 的預設參數與 ``gmt.conf`` 檔案
ta: GMT இன் முன்னமைக்கப்பட்ட அளவுருக்கள் மற்றும் `` gmt.conf``

source: 地理座標的給定方式
ta: புவியியல் இருக்கை இலக்கின் நிர்வாக முறை

source: 地圖版面的設定
ta: வரைபட தளவமைப்பின் அமைப்பு

source: 文字風格設定
ta: உரை நடை அமைப்பு

source: GMT 針對不同投影座標系統的不同處理方式
ta: வெவ்வேறு திட்ட இருக்கை லோகோ அமைப்புகளின் வெவ்வேறு செயலாக்க முறைகளுக்கு GMT

source: 前置作業
ta: முன் -செயல்பாடு

source: 我們要先取得烏蘭巴托與西雅圖兩地的經緯度座標。從 *Wikipedia* 的條目頁面中，可以找到「經緯度」的資訊欄位，點選連結後，可以看到不同座標系統的位置資訊，如下所示 (以烏蘭巴托為例)。
ta: நாம் முதலில் உலன் பாட்டோவுக்கும் சியாட்டலுக்கும் இடையில் அட்சரேகை மற்றும் தீர்க்கரேகை இருக்கைகளைப் பெற வேண்டும். * விக்கிபீடியா * இன் நுழைவு பக்கத்திலிருந்து, "அட்சரேகை மற்றும் தீர்க்கரேகை" செய்தி பட்டியைக் காணலாம், கீழே காட்டப்பட்டுள்ளபடி வெவ்வேறு இருக்கை அமைப்புகளின் இருப்பிட தகவல்களைக் காணலாம் (உலன்பாடோவை உதாரணமாக எடுத்துக் கொள்ளுங்கள்).

source: 注意在「\ **WGS84**\ 」欄位中，有兩種座標的格式。你要使用哪種都可以，GMT 都有支援。另外也請注意這裡的座標是「緯度在前，經度在後」。在下表中，也蒐集了兩地的經緯座標 (十進位制四捨五入至小數點第二位)：
ta: "\ ** WGS84 ** \" புலத்தில், இரண்டு வகையான இருக்கை வடிவங்கள் உள்ளன என்பதை நினைவில் கொள்க. உங்களில் எவரையும் நீங்கள் பயன்படுத்தலாம், GMT க்கு உதவி உள்ளது. கூடுதலாக, இங்குள்ள ஆயத்தொகுப்புகள் "அட்சரேகை முன்னால் உள்ளது, நீளமான தீர்க்கரேகை பின்னால் உள்ளது" என்பதையும் நினைவில் கொள்க. கீழேயுள்ள அட்டவணையில், இரண்டு இடங்களின் அட்சரேகை மற்றும் அட்சரேகை ஆயங்களும் சேகரிக்கப்படுகின்றன (தசம மற்றும் நான்கு வீடுகள் மற்றும் தசம புள்ளியில் ஐந்து நுழைவு):

source: 城市
ta: நகரம்

source: 烏蘭巴托
ta: உலன்பாடோ

source: 西雅圖
ta: சியாட்டில்

source: 經緯度 (度分秒)
ta: லெபாட்டரிட்டி (விநாடிகளின் பட்டம்)

source: 經緯度 (十進位)
ta: லெபாட்டரிட்டி (தசம) (தசம)

source: 為了方便使用這些資料，我們可以建立一個純文字文件 ``coord.txt``，再把兩地的座標資訊複製到文件中存檔，如此一來供 GMT 使用的資料表就建立完成。以下是使用十進位制座標的 ``coord.txt`` 內容：
ta: இந்த பொருட்களின் பயன்பாட்டை எளிதாக்குவதற்காக, நாம் ஒரு தூய உரை கோப்பை `` Coar.txt`` ஐ உருவாக்கலாம், பின்னர் கோப்பை சேமிக்க இரண்டு இடங்களின் இருக்கை தகவல்களை கோப்பில் நகலெடுக்கலாம், இதனால் பயன்படுத்தப்படும் தரவு அட்டவணை GMT முடிந்தது. பின்வருவது தசம இருக்கை தரத்தின் உள்ளடக்கம் `kord.txt````` `` ``

source: 再次強調，資料中的第一欄現在是緯度 (y 值)，第二欄是經度 (x 值)。這與我們在「\ :doc:`scatter_plot`\ 」一章中所使用的 xy 順序相反，不過只要適當的指定欄位意義，GMT 仍然可以讀取。另外，兩個欄位中間使用了「逗號」分隔，在 GMT 中也是可以接受的。
ta: மீண்டும், தரவின் முதல் நெடுவரிசை இப்போது அட்சரேகை (y மதிப்பு), மற்றும் இரண்டாவது நெடுவரிசை தீர்க்கரேகை (x மதிப்பு). இது "\: Doc:` SCATTER_PLOT` \ "அத்தியாயத்தில் பயன்படுத்தப்படும் XY வரிசைக்கு நேர்மாறானது, ஆனால் குறிப்பிட்ட புலத்தின் முக்கியத்துவம் பொருத்தமானதாக இருக்கும் வரை, GMT ஐ இன்னும் படிக்க முடியும். கூடுதலாக, இரண்டு துறைகளும் நடுவில் உள்ள "கமாவிலிருந்து" பிரிக்கப்படுகின்றன, இது GMT இல் ஏற்றுக்கொள்ளத்தக்கது.

source: 以下是使用度分秒制座標的 ``coord.txt`` 內容：
ta: பின்வருவது இரண்டாம் நிலை விநாடிகளின் பயன்பாட்டின் உள்ளடக்கம்

source: 47:55:0N, 106:55:0E 47:36:35N, 122:19:59W
ta: 47: கே: 0 என், 106: கே: 0 சே 47: 36: அகோயன், 122: 19: ச auசு

source: 注意我把所有的度分秒符號都統一成「冒號」，而且座標字串中間的空白都被移除了。這種格式是 GMT 接受的標準地理座標 (度分秒) 格式，如果你有一串地理座標資料是以度分秒格式儲存，記得在輸入 GMT 之前，把所有的度分秒符號都改為冒號，如上所示。
ta: இரண்டாம் நிலை சின்னங்களின் அனைத்து அளவையும் நான் "பெருங்குடல்" ஆக ஒன்றிணைத்தேன், மற்றும் இருக்கை சரத்தின் நடுவில் வெற்று அகற்றப்பட்டது என்பதை நினைவில் கொள்க. இந்த வடிவம் GMT ஆல் ஏற்றுக்கொள்ளப்பட்ட ஒரு நிலையான புவியியல் இருக்கை சிட்டை (விநாடிகளின் பட்டம்) வடிவமாகும். மேலே காட்டப்பட்டுள்ளபடி, பெருங்குடலுக்கு GMT க்கு இரண்டாவது சின்னத்திற்கு.

source: 你也可以從這裡下載資料檔：\ :download:`coord.txt <layout_design/coord.txt>`\，這個版本使用度分秒制座標。
ta: தரவுக் கோப்பையும் இங்கிருந்து பதிவிறக்கம் செய்யலாம்: \: பதிவிறக்கம்: `Coard.txt <layout_design/cory.txt>` \, இந்த பதிப்பு நொடிகளில் பயன்படுத்தப்படுகிறது.

source: 簡單小結 GMT 對於文字輸入檔與地理座標格式的要求：
ta: உரை உள்ளீட்டு கோப்புகள் மற்றும் புவியியல் இருக்கை மதிப்பெண்களுக்கான எளிய சுருக்கம் GMT இன் தேவைகள்:

source: 欄位的分隔符號可以是\ **空白**\ 、\ **逗號** (``.csv`` 檔) 與 **Tab** (``.tsv`` 檔) 三者之一，但不能在同一個檔案中使用超過一種的分隔符號來分隔欄位。欄位代表的意義預設是第一欄 x 值、第二欄 y 值，不過可以在下指令時逐一指定。
ta: புலத்தின் பிரிப்பு அடையாளம் \ ** காலியாக இருக்கலாம் ** \ \, \ ** கமா ** (`` .csv`` கோப்பு) மற்றும் ** தாவல் ** (`` .tsv`` கோப்பு) பிரிப்பான் பிரிக்க அதே கோப்பில் அதே கோப்பில் பயன்படுத்த முடியாது. புலத்தின் பொருள் முதல் நெடுவரிசை ஃச் மதிப்பு மற்றும் இரண்டாவது நெடுவரிசை ஒய் மதிப்பைக் குறிக்கிறது, ஆனால் அடுத்த அறிவுறுத்தலின் போது நீங்கள் ஒவ்வொன்றாக குறிப்பிடலாம்.

source: 地理座標可以採用\ **十進位**\ 或\ **度分秒**：
ta: புவியியல் இருக்கைகளைப் பயன்படுத்தலாம் \ ** தசமமாக்குகிறது ** \ அல்லது \ ** டிகிரி வினாடிகள் **:

source: 以十進位系統表示時，南緯要表示為負緯度，西經則表示為負經度或是東經 180 度之後持續累加，如經度 243 和 -63 都代表西經 63 度。
ta: இது காபி தண்ணீர் அமைப்பால் வெளிப்படுத்தப்படும்போது, ​​தெற்கு அட்சரேகை எதிர்மறை மற்றும் தீர்க்கரேகை என வெளிப்படுத்தப்பட வேண்டும், மேலும் மேற்கு மெரிடியன் கிழக்கில் 180 டிகிரிக்கு பிறகு எதிர்மறையான உரையாடல் அல்லது தொடர்ச்சியான திரட்சியாக வெளிப்படுத்தப்படுகிறது.

source: 以度分秒系統表示時，使用 ``ddd:mm:ssF`` 的方法，``ddd`` 為度，``mm`` 為分，``ss`` 為秒，``F`` 則是 NEWS 四個字母之一。
ta: விநாடிகளில் பட்டம் மூலம் வெளிப்படுத்தப்படும் போது, ​​`` ddd: mm: ssf``, `` ddd`` ஒரு பட்டம், `` மிமீ`` பிரிக்கப்பட்டுள்ளது, `எச்எச்`` இரண்டாவதாக,` எஃப்` `இது செய்திகளின் நான்கு கடிதங்களில் ஒன்றாகும்.

source: 操作流程
ta: செயல்பாட்டு செயல்முறை

source: 讓我們從目標地圖的下半部 (麥卡托投影的部份) 開始吧。先來畫出海岸線與國界：
ta: இலக்கு வரைபடத்தின் கீழ் பாதியில் (மெக்காடோ திட்டத்தின் பகுதி) ஆரம்பிக்கலாம். முதலில் கடற்கரையையும் எல்லையையும் வரையவும்:

source: land_color="#CEB9A0" # 陸域填色 gmt begin ulaanbaatar_seattle png gmt basemap -R70/270/30S/70N -JM13c -B+tMercator gmt coast -Dl -A1000 -G$land_color -N1/thick,60 -Ba40f20g20 # -D: 調整海岸線解析度。因為我們畫的是全球資料，用不著高解析度的海岸線，所以設定為 l (low) 即可。 gmt end
ta: LAND_COLOR = " # CEB9A0" # L L. Gmt ulaanbaatar_seattle png GMT BASEMAP -R70/270/30S/70N -JM13C -B+TMERCATOR GMT COST -DL -A1000 -G $ LAND_COLOR -N1/தடிமனான, 60 -BA40F20G20G20 # -D: கடற்கரையின் தீர்மானத்தை சரிசெய்யவும். நாங்கள் உலகளாவிய தரவை வரைவதால், எங்களுக்கு அதிக தெளிவுத்திறன் கொண்ட கடற்கரை தேவையில்லை, எனவே இதை எல் (குறைந்த) என அமைக்கலாம். GMT முடிவு

source: 這張地圖的細節設定，例如字體大小、格線粗細等等，採用的是 GMT 的預設參數。你可以使用 ``defaults`` 指令在終端機中查看所有的參數值：
ta: இந்த வரைபடத்தின் விவரங்கள், எழுத்துரு அளவு, கட்டம் தடிமன் போன்றவை, GMT இன் முன்னமைக்கப்பட்ட அளவுருக்களைப் பயன்படுத்துகின்றன. முனையத்தில் உள்ள அனைத்து அளவுரு மதிப்புகளையும் காண `` இயல்புநிலை`` அறிவுறுத்தலைப் பயன்படுத்தலாம்:

source: $ gmt defaults -D
ta: $ GMT இயல்புநிலை -டி

source: 螢幕的輸出如下所示：
ta: திரையின் வெளியீடு கீழே காட்டப்பட்டுள்ளது:

source: # # GMT 6.0.0 Defaults file # # COLOR Parameters # COLOR_BACKGROUND = black COLOR_FOREGROUND = white COLOR_NAN = 127.5 COLOR_MODEL = none ... #(以下省略)
ta: # # GMT 6.0.0 இயல்புநிலை கோப்பு # # வண்ண அளவுருக்கள் # Color_background = கருப்பு Color_foreground = வெள்ளை Color_nan = 127.5 Color_model = எதுவுமில்லை ... #(以下省略)

source: 所有不以 ``#`` 號開頭的每一行都是一個 GMT 參數，參數的名稱就是在這裡出現的大寫字串。所有參數的意思，都可以在 `GMT 的官方手冊 <https://docs.generic-mapping-tools.org/6.0/gmt.conf.html>`_\ 中找到。我們可以使用兩種方式更改預設的參數：
ta: ``#`` `` `` `` `` உடன் தொடங்காத ஒவ்வொரு வரியும் இங்கே தோன்றும் மூலதன சரம். அனைத்து அளவுருக்களின் பொருளையும் `GMT <https://docs.gneric-mappis-tools.org/6.0/gmt.html>` _ fir இன் அதிகாரப்பூர்வ கையேட்டில் காணலாம். முன்னமைக்கப்பட்ட அளவுருக்களை மாற்ற இரண்டு வழிகளைப் பயன்படுத்தலாம்:

source: 在下 GMT 指令時，使用 ``--參數=設定值`` (\ **長指令**\ 語法)。在「\ :doc:`cpt_colormap`\ 」中，我們就是使用此方法調整 ``COLOR_NAN`` 的設定，讓地圖無資料的區域顯示為灰色。**使用此方法改變的參數只對這個指令有效**，其他指令仍然會使用原先的預設值。
ta: GMT வழிமுறைகள் GMT அறிவுறுத்தலின் கீழ் இருக்கும்போது, ​​`` `` `\ \ ** நீண்ட அறிவுறுத்தல் ** \ தொடரியல்). "\: Doc:` cpt_colormap` \ "இல், வரைபடக் காட்சியின் எந்த தகவலையும் சாம்பல் நிறமாக மாற்ற` `color_nan`` அமைப்புகளை சரிசெய்ய இந்த முறையைப் பயன்படுத்துகிறோம். ** இந்த முறையைப் பயன்படுத்தும் அளவுருக்கள் இந்த அறிவுறுத்தலுக்கு மட்டுமே பயனுள்ளதாக இருக்கும் **, மற்றும் பிற வழிமுறைகள் அசல் முன்னமைக்கப்பட்ட மதிப்பைப் பயன்படுத்துகின்றன.

source: 使用 ``set`` 指令設定參數的預設值。它的語法如下：
ta: அளவுருவின் முன்னமைக்கப்பட்ட மதிப்பை `` set`` அறிவுறுத்தலுடன் அமைக்கவும். அதன் இலக்கணம் பின்வருமாறு:

source: $ gmt set 參數名1 參數值1 [參數名2 參數值2 參數名3 參數值3...] # ---- 或是 ---- $ gmt set 參數名1=參數值1 [參數名2=參數值2 參數名3=參數值3...]
ta: $ GMT தொகுப்பு அளவுரு பெயர் 1 அளவுரு மதிப்பு 1 [அளவுரு பெயர் 2 அளவுரு மதிப்பு 2 அளவுரு பெயர் 3 அளவுரு மதிப்பு 3 ...] # ---- அல்லது ----- $ GMT தொகுப்பு அளவுரு பெயர் 1 = அளவுரு மதிப்பு 1 [அளவுரு பெயர் 2 = அளவுரு மதிப்பு 2 அளவுரு பெயர் 3 = அளவுரு மதிப்பு 3 ...]

source: 在本教學中我會使用第一種語法以方便對齊參數值。這種方法與前一種方法的主要差異是，GMT 會紀錄改變的預設值，只要紀錄不被覆蓋或刪除，**改變的參數對接下來的所有指令都有效**。第一次下達 ``set`` 指令時，GMT 會在當前目錄下建立 ``gmt.conf`` 檔案，並把所有更動儲存在內。之後所有的 GMT 指令都會讀取此檔案，這就是為什麼使用 ``set`` 設定參數會有永久性效用的原因。
ta: இந்த போதனையில், சீரமைப்பு மதிப்பை எளிதாக்க முதல் தொடரியல் பயன்படுத்துவேன். இந்த முறைக்கும் முந்தைய முறைக்கும் இடையிலான முக்கிய வேறுபாடு என்னவென்றால், மாறும் மாற்றங்களின் முன்னமைக்கப்பட்ட மதிப்பை GMT பதிவுசெய்கிறது. முதல் முறையாக எட்டும்போது, ​​`` அமைக்கவும்` அறிவுறுத்தல்கள் போது, ​​சிஎம்டி தற்போதைய கோப்பகத்தில் ஒரு கோப்பை உருவாக்கி, மேலும் அனைத்து இயக்கங்களையும் சேமிக்கும். அதன்பிறகு, அனைத்து சிஎம்டி வழிமுறைகளும் இந்த கோப்பைப் படிக்கும், அதனால்தான் அளவுருக்கள் `` செட்`` உடன் அமைக்கப்பட்டிருப்பது நிரந்தர விளைவை ஏற்படுத்தும்.

source: 如果你的資料夾中已經有了上一次繪圖時產生的 ``gmt.conf``，而你又不想讓上一次的設定選項「干擾」到你這一次要畫的地圖，則你可以簡單的把 ``gmt.conf`` 刪掉，這樣 GMT 會重新使用系統預設值，然後就可以從頭使用 ``set`` 來設定新的繪圖參數。
ta: உங்களிடம் ஏற்கனவே `` `gmt.conf``` `` `` `` `` `` `如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果 如果如果 如果 如果 如果 如果 如果 如果 ”எளிமையானதாக இருக்கும்` `gmt.conf``, இதனால் சிஎம்டி கணினியின் முன்னமைக்கப்பட்ட மதிப்பை மீண்டும் பயன்படுத்தும், பின்னர் நீங்கள் ஆரம்பத்தில் இருந்து புதிய வரைதல் அளவுருக்களை அமைக்க` `செட்`` ஐப் பயன்படுத்தலாம் .

source: 介紹完 ``set`` 後，讓我們馬上來做個測試。在剛剛目標地圖下半部的腳本中加入此指令：
ta: `` Set`` ஐ அறிமுகப்படுத்திய பிறகு, உடனடியாக ஒரு சோதனை செய்வோம். இலக்கு வரைபடத்தின் கீழ் பாதியில் இந்த அறிவுறுத்தலை ச்கிரிப்ட்டில் சேர்க்கவும்:

source: land_color="#CEB9A0" gmt set MAP_FRAME_TYPE plain # MAP_FRAME_TYPE：地圖邊框樣式。預設是 fancy，就是上圖的黑白相間邊框。改成 plain 的話，邊框會變成最基本的樣式。 gmt begin ulaanbaatar_seattle png gmt basemap -R70/270/30S/70N -JM13c -B+tMercator gmt coast -Dl -A1000 -G$land_color -N1/thick,60 -Ba40f20g20 gmt end
ta: லேண்ட்_கோலர் = "#ceb9a0" GMT கணம் MAP_FRAME_TYPE ப்ளைன் # MAP_FRAME_TYPE: வரைபட பிரேம் பாணி. இயல்புநிலை ஆடம்பரமானது, இது மேலே உள்ள படத்தில் கருப்பு மற்றும் வெள்ளை எல்லை. இது வெற்று என மாற்றப்பட்டால், சட்டகம் மிக அடிப்படையான பாணியாக மாறும். Gmt ulaanbaatar_seattle png GMT BASEMAP -R70/270/30S/70N -JM13C -B+TMERCATOR GMT COST -DL -A1000 -G $ LAND_COLOR -N1/தடிமனான, 60 -BA40F20G20G20 GMT முடிவு

source: 可以看出地圖的邊緣從斑馬框變成一條線了。運用相同的方式，我們還要逐一修改以下預設參數：
ta: வரைபடத்தின் விளிம்பு சீப்ரா சட்டகத்திலிருந்து ஒரு வரியாக மாறிவிட்டதைக் காணலாம். அதே வழியில், பின்வரும் முன்னமைக்கப்பட்ட அளவுருக்களை ஒவ்வொன்றாக மாற்ற வேண்டும்:

source: ``FONT_TITLE``：標題字型。在 GMT 中，**字型與畫筆類似，由三個部份組成**：``尺寸,字型,顏色``。「尺寸」可為任意數值，預設單位為點 (points)；「樣式」則可參考 `PostScript 的字型樣式表 <https://docs.generic-mapping-tools.org/6.0/cookbook/postscript_fonts.html>`_，可以使用字型的代號或是字型的名稱來表示。「顏色」則是 GMT 通用的顏色格式。我們想要的設定是 ``30,Bookman-Demi,#0D057A`` (30 點字的 Bookman-Demi，顏色是 #0D057A)。
ta: `` Font_title``: தலைப்பு எழுத்துரு. GMT இல், ** எழுத்துருக்கள் தூரிகைகளுக்கு ஒத்தவை, இதில் மூன்று பகுதிகள் உள்ளன **: `` `அளவு, எழுத்துரு, வண்ணம்``. "அளவு" எந்த மதிப்பாகவும் இருக்கலாம், மற்றும் முன்னமைக்கப்பட்ட அலகு புள்ளி (புள்ளிகள்); > `_, எழுத்துரு அல்லது எழுத்துருவின் பெயரால் குறிப்பிடலாம். "வண்ணம்" என்பது GMT இன் வண்ண வடிவம். நாங்கள் விரும்பும் அமைப்புகள் `` 30, புக்மேன்-டெக்மி, #0d057a`` (30 சொற்களில் புக்மேன்-டெமி, மற்றும் வண்ணம் #0d057a).

source: ``FONT_ANNOT_PRIMARY``：座標軸主格點標示的字型，使用 ``12p,20,#0D057A`` (12點字的 Bookman-LightItalic，顏色與標題一樣)。
ta: `` Font_annot_primary ``: இருக்கை அச்சின் முதன்மையான கட்டம் புள்ளியால் குறிக்கப்பட்ட எழுத்துருக்கள், `` 12p, 20,#0d057a`` (புக்மேன்-லைட்டிடாலிக், வண்ணம் தலைப்புக்கு சமமானதாகும்) பயன்படுத்தவும்.

source: ``FORMAT_GEO_MAP``：(地理作圖的) 座標刻度標示的格式，使用英文代號的搭配組合表示，``d`` 代表度，``m`` 代表分，``s`` 代表秒，``F`` 代表數值後面會加的「NEWS」後綴符號，詳細設定可\ `在此查閱 <https://docs.generic-mapping-tools.org/6.0/gmt.conf.html>`_。我們要使用的是 ``dddF``，如此一來可令所有座標只以至多三位數的度來表示，並搭配後綴符號。
ta: `` Format_geo_map``: (புவியியல் வரைதல்) இருக்கை சிட்டை செதில்களின் வடிவம், ஆங்கிலக் குறியீட்டின் கலவையை பிரதிநிதித்துவப்படுத்த பயன்படுத்துகிறது, `` டி`` குறிக்கிறது, `எம்`` புள்ளிகளைக் குறிக்கிறது,` எச்`` வினாடிகளில் வினாடிகளைக் குறிக்கிறது . நாம் பயன்படுத்த விரும்புவது `` dddf``, இதனால் அனைத்து இருக்கைகளையும் அனைத்து இருக்கைகளிலும் மூன்று இலக்கங்களாலும், பின்னொட்டுகளாலும் குறிக்க முடியும்.

source: ``MAP_GRID_CROSS_SIZE_PRIMARY``：地圖格線的十字交叉符號大小。使用 ``8p``。
ta: `` MAP_GRID_CROSS_SIZE_PRIMARY``: வரைபட கட்டம் வரியின் குறுக்கு வெட்டு அளவு. `` 8p`` ஐப் பயன்படுத்தவும்.

source: ``MAP_GRID_PEN_PRIMARY``：地圖格線的畫筆屬性。使用 ``thinner,#ED99F0``。
ta: `` MAP_GRID_PEN_PRIMARY ``: வரைபட கட்டம் வரியின் தூரிகை பண்புக்கூறு. `` மெல்லிய,#ED99F0`` ஐப் பயன்படுத்தவும்.

source: ``MAP_TICK_PEN_PRIMARY``：地圖座標刻度的畫筆屬性。使用 ``thicker,black``。
ta: `` Map_tick_pen_primary ``: வரைபட இருக்கையின் சிட்டை அளவின் தூரிகை பண்புக்கூறு. `` தடிமனான, கருப்பு`` ஐப் பயன்படுத்தவும்.

source: ``MAP_TITLE_OFFSET``：地圖標題與座標軸刻度的垂直距離。使用 ``0.5c``。
ta: `` Map_title_offset``: தலைப்புக்கும் இருக்கையின் அச்சு அளவிற்கும் இடையிலான செங்குத்து தூரம். `` 0.5 சி`` ஐப் பயன்படுத்தவும்.

source: ``MAP_ANNOT_OBLIQUE``：座標軸刻度的「擺放模式」。在上圖中，經度和緯度的刻度都是水平顯示的，我們要使用的設定代號是 ``32``，意謂著「經度保持原樣，緯度與地圖的邊框平行顯示」。
ta: `` Map_annot_oblique``: இருக்கையின் அச்சு அளவின் "வேலைவாய்ப்பு பயன்முறை". மேலே உள்ள படத்தில், நாம் பயன்படுத்த விரும்பும் அமைப்புக் குறியீடு `` 32 ``, அதாவது அட்சரேகை பராமரிக்கப்படுகிறது, மேலும் அட்சரேகையின் உளிச்சாயுமோரம் மற்றும் வரைபடம் இணையாக காட்டப்படும். "

source: ``PS_PAGE_COLOR``：紙張的底色。使用 ``ivory`` (象牙色)。
ta: `` Ps_page_color``: காகிதத்தின் பின்னணி நிறம். `` தந்தம் `` `iations) பயன்படுத்தவும்.

source: 因此，在原腳本中 ``set`` 的設定可以擴展成：
ta: எனவே, அசல் ச்கிரிப்டில் `செட்`` அமைப்பை நீட்டிக்க முடியும்:

source: # (前略) gmt set FONT_ANNOT_PRIMARY 12p,20,#0D057A \ FONT_TITLE 30,Bookman-Demi,#0D057A \ FORMAT_GEO_MAP dddF \ MAP_ANNOT_OBLIQUE 32 \ MAP_FRAME_TYPE plain \ MAP_GRID_CROSS_SIZE_PRIMARY 8p \ MAP_GRID_PEN_PRIMARY thinner,#ED99F0 \ MAP_TICK_PEN_PRIMARY thicker,black \ MAP_TITLE_OFFSET 0.5c \ PS_PAGE_COLOR ivory # 注意我在每一行結尾使用了 "\" 符號，意味著下一行仍然是 gmt set 的內容。 # (後略)
ta: # (முந்தைய) Gmt செட் font_annot_primary 12p, 20,#0d057a \ Font_title 30, புக்மேன்-டெமி,#0d057a \ Format_geo_map dddf \ Map_annot_oblique 32 \ Map_frame_type வெற்று \ Map_grid_cross_size_primary 8p \ Map_grid_pen_primary மெல்லிய,#ed99f0 \ Map_tick_pen_primary தடிமனான, கருப்பு \ Map_title_offset 0.5c \ Ps_page_color தந்தம் # ஒவ்வொரு வரியின் முடிவிலும் நான் "\" சின்னத்தைப் பயன்படுத்தினேன் என்பதை நினைவில் கொள்க, அதாவது அடுத்த வரி இன்னும் GMT தொகுப்பின் உள்ளடக்கமாக உள்ளது. # (இடுகை -பூட்டி)

source: 有許多參數名稱都有 ``PRIMARY``，這是由於 GMT 的某些邊框 (尤其是 ``fancy`` 類型的邊框) 會使用不同的設定來指定主格線 (刻度) 與副格線 (刻度)。在我們的例子中，只設定了主格線，副格線皆已省略。你也可以換成 ``fancy`` 類型的邊框，指定副格線的樣式 (帶有 ``SECONDARY`` 的參數名稱)，看看出圖會是什麼樣的感覺！
ta: `` `முதன்மை`` கொண்ட பல அளவுரு பெயர்கள் உள்ளன, இது சிஎம்டியின் சில பிரேம்கள் (குறிப்பாக` ஃபேன்சி`` வகை வகையின் எல்லைகள்) காரணமாகும், இது முதன்மையான கட்டத்தை (அளவுகோல்) குறிப்பிட வெவ்வேறு அமைப்புகளைப் பயன்படுத்தும் மற்றும் துணை வரி (அளவு). எங்கள் எடுத்துக்காட்டில், முதன்மையான வரி மட்டுமே அமைக்கப்பட்டுள்ளது, மேலும் துணை வரி தவிர்க்கப்பட்டுள்ளது. நீங்கள் அதை `ஃபேன்சி`` வகையின் எல்லையுடன் மாற்றலாம், துணைக் கோட்டின் பாணியைக் குறிப்பிடவும் (` இரண்டாம் நிலை`` உடன் அளவுரு பெயர்), அது படத்தைப் போல என்ன உணர்கிறது என்பதைப் பாருங்கள்!

source: 如要使用不是 GMT 預先定義的 PostScript 字型，請參閱 `這個例子 <https://docs.generic-mapping-tools.org/6.0/gallery/ex31.html>`_。
ta: GMT இல்லாத போச்ட்ச்கிரிப்ட் எழுத்துருவைப் பயன்படுத்த விரும்பினால், தயவுசெய்து இந்த உதாரணத்தைப் பார்க்கவும்.

source: 以上腳本出圖如下：
ta: மேலே உள்ள ச்கிரிப்ட்கள் பின்வருமாறு:

source: 大部分的改動都如我們所預期：所有的字體樣式都換了、地圖邊框改了、顏色和格線也換成比較舒服的搭配。接下來讓我們補完這張地圖上的城市位置和兩條不同的路徑。由於在 ``coord.txt`` 中，座標欄位是「先緯度再經度」，因此在使用 ``plot`` 時，需要加上 ``-:`` 選項，「告訴」GMT 第一欄是 Y 值，第二欄是 X 值。``plot`` 在地圖上畫線時的預設模式是「畫出大圓路徑」，如果加上 ``-A`` 選項，可以改成「畫出投影系統中的直線路徑」，在麥卡托投影中，這條路徑就是恆向線。因此，運用 ``plot`` 與 ``text``，就可以畫出以上目標，並且標注兩條路徑的名稱：
ta: நாம் எதிர்பார்ப்பது போல் பெரும்பாலான மாற்றங்கள்: அனைத்து எழுத்துரு பாணிகளும் மாற்றப்பட்டுள்ளன, வரைபட சட்டகம் மாற்றப்பட்டுள்ளது, மேலும் வண்ணம் மற்றும் வரி வரிகளும் மிகவும் வசதியான பொருத்தத்துடன் மாற்றப்படுகின்றன. அடுத்து, இந்த வரைபடத்தில் இருப்பிடத்தையும் இரண்டு வெவ்வேறு பாதைகளையும் முடிப்போம். ஏனெனில் `` kory.txt`` இல், இருக்கை புலம் "முதல் அட்சரேகை மற்றும் கணக்கீடு" ஆகும், எனவே `` சதி`` ஐப் பயன்படுத்தும் போது, ​​நீங்கள் `` `` விருப்பங்களைச் சேர்க்க வேண்டும், "gmt முதலில் முதலில் நெடுவரிசை என்று சொல்லுங்கள் ஒய் மதிப்பு, மற்றும் இரண்டாவது நெடுவரிசை ஃச் மதிப்பு. `` சதி` `முன்னமைக்கப்பட்ட பயன்முறை வரைபடத்தில்" பெரிய வட்ட பாதையை வரைதல் "ஆகும். ", கேடோவின் திட்டத்தில் மை மாயில் மாய் மாயில், இந்த பாதை நிலையான வரி. எனவே, `` சதி`` மற்றும் `` உரை`` ஐப் பயன்படுத்துவது மேற்கண்ட இலக்குகளை வரையலாம், மேலும் இரண்டு பாதைகளின் பெயரைக் குறிக்கலாம்:

source: # ==== 設定變數 ==== input_xy="coord.txt" land_color="#CEB9A0" # 陸域填色 rl_color="#FF0073" # 恆向線顏色 gc_color="#0044FF" # 大圓路徑顏色 # ==== 設定作圖參數 ==== gmt set FONT_ANNOT_PRIMARY 12p,20,#0D057A \ FONT_TITLE 30,Bookman-Demi,#0D057A \ FORMAT_GEO_MAP dddF \ MAP_ANNOT_OBLIQUE 32 \ MAP_FRAME_TYPE plain \ MAP_GRID_CROSS_SIZE_PRIMARY 8p \ MAP_GRID_PEN_PRIMARY thinner,#ED99F0 \ MAP_TICK_PEN_PRIMARY thicker,black \ MAP_TITLE_OFFSET 0.5c \ PS_PAGE_COLOR ivory # ==== 開始繪圖 ==== gmt begin ulaanbaatar_seattle png gmt basemap -R70/270/30S/70N -JM13c -B+tMercator gmt coast -Dl -A1000 -G$land_color -N1/thick,60 -Ba40f20g20 --MAP_GRID_PEN_PRIMARY=thicker # 調整 MAP_GRID_PEN_PRIMARY 讓十字符號粗一點 gmt plot $input_xy -: -A -W1p,$rl_color # 恆向線 gmt plot $input_xy -: -W1p,$gc_color # 大圓路徑 gmt plot $input_xy -: -Sa0.4c -Gblack # 城市的位置，-Sa0.4c 是外接圓為 0.4 公分的星形符號。 # 以下是兩條線的說明文字 echo "174 41 Rhumb Line" | gmt text -F+f,18,$rl_color echo "174 61 Great Circle" | gmt text -F+f,18,$gc_color gmt end
ta: # ==== மாறி ==== அமைக்கவும் Input_xy = "koor.txt" LAND_COLOR = " # CEB9A0" # L L. Rl_color = " # ff0073" # பின்தொடர் -up வரி வண்ணம் GC_COLOR = " # 0044FF" # தலுவான் சாலை நிறம் # ==== வரைபட அளவுருவை அமைக்கவும் ==== Gmt செட் font_annot_primary 12p, 20,#0d057a \ Font_title 30, புக்மேன்-டெமி,#0d057a \ Format_geo_map dddf \ Map_annot_oblique 32 \ Map_frame_type வெற்று \ Map_grid_cross_size_primary 8p \ Map_grid_pen_primary மெல்லிய,#ed99f0 \ Map_tick_pen_primary தடிமனான, கருப்பு \ Map_title_offset 0.5c \ Ps_page_color தந்தம் # ==== தொடக்கம் வரைதல் ==== Gmt ulaanbaatar_seattle png GMT BASEMAP -R70/270/30S/70N -JM13C -B+TMERCATOR Gmt cost -dl -a1000 -g $ land_color -n1/தடிமனான, 60 -ba40f20g20 -map_grid_primary = தடிமனான குறுக்கு சின்னத்தை தடிமனாக மாற்ற # _ MAP_GRID_PEN_PRIMARY GMT சூழ்ச்சி $ input_xy -: -a -w1p, $ rl_color # hengxiang வரி GMT சூழ்ச்சி $ input_xy -: -w1p, $ gc_color # g g GMT சூழ்ச்சி $ input_xy -: -sa0.4c -gblack # அமைந்துள்ளது. # பின்வருபவை இரண்டு வரிகளின் விளக்க உரை எதிரொலி "174 41 ரம்ப் வரி" | எதிரொலி "174 61 பெரிய வட்டம்" | GMT முடிவு

source: 如此一來，目標地圖的下半部就完成了！
ta: இந்த வழியில், இலக்கு வரைபடத்தின் கீழ் பாதி முடிந்தது!

source: 接下來讓我們進入上半部，蘭伯特投影的地圖。為了不讓地圖彼此重疊，我們必須把第二個地圖呈現的位置往上移。GMT 的通用選項 ``-X`` 和 ``-Y`` 就是用來設定地圖的相對位置，它的用法為
ta: அடுத்து, லேண்ட்பெர்ட்டின் திட்டமான மேல் பாதியின் வரைபடத்தில் நுழைவோம். வரைபடம் ஒருவருக்கொருவர் ஒன்றுடன் ஒன்று தடுக்காமல் தடுக்க, இரண்டாவது வரைபடத்தின் நிலையை நாம் நகர்த்த வேண்டும். GMT இன் உலகளாவிய விருப்பங்கள் `-x`` மற்றும்`` -y`` ஆகியவை வரைபடத்தின் ஒப்பீட்டு நிலையை அமைக்கப் பயன்படுகின்றன.

source: -X水平偏移量 (向右為正) -Y垂直偏移量 (向上為正)
ta: -X கிடைமட்ட ஆஃப்செட் (வலமிருந்து வலமாக) -Y செங்குத்து ஆஃப்செட் (மேல்நோக்கி)
