Repository: 247i/TACETr
Catalog: உரை/தானி/gmt-tutorials-pen-and-painting-*.po
Languages: ta

source: 到目前為止，我們的地圖幾乎已經完成了。剩下的工作，就是讓色階圖例更顯眼，更易判讀。由於色階圖例直接畫在深色的海床上會看不清楚，我們可以在圖例下方填上一層帶有透明度的白色，讓黑色的數字和線條浮現出來。``colorbar`` 的填色指令為：
ta: இதுவரை, எங்கள் வரைபடம் கிட்டத்தட்ட முடிக்கப்பட்டுள்ளது. வண்ண ஒழுங்கு புராணத்தை மிகவும் வெளிப்படையாகவும் படிக்க எளிதாகவும் மாற்றுவதே மீதமுள்ள வேலைகள். வண்ண ஒழுங்கு புராணக்கதை நேரடியாக இருண்ட கடல் படுக்கையில் வரையப்பட்டிருப்பதால், அது தெளிவாக இருக்காது. `` Colorbar`` இன் வண்ண நிரப்புதல் வழிமுறைகள்:

source: -F+g[顏色]
ta: -F+g [வண்ணம்]

source: 如要指定\ **透明度**，只要在顏色後方加上 ``@[透明度%]`` 就行了。``@100`` 是完全透明 (等於沒有畫)，而 ``@0`` 是完全不透明 (等於不加透明度時的填色)。這邊我們使用 ``-F+gwhite@50`` 來達成我們的目標。另外，由於陸域的地形被國家填色給蓋掉了，導致色階圖例的上半部 (0 至 5000 公尺) 是無用的資訊。為了省略此段的內容，我們可以使用 ``-G`` 選項來指定繪製圖例時使用的色階範圍。語法為
ta: நீங்கள் \ ** வெளிப்படைத்தன்மை ** ஐக் குறிப்பிட விரும்பினால், `@[வெளிப்படைத்தன்மை%]` `` ஆகியவற்றைச் சேர்க்கவும். ``@100 `` முற்றிலும் வெளிப்படையானது (ஓவியத்திற்கு சமம்), மற்றும் ``@0 `` முற்றிலும் ஒளிபுகா (வெளிப்படையானதாக இல்லாதபோது நிறத்தை நிரப்புவதற்கு சமம்). எங்கள் இலக்குகளை அடைய இங்கே `` -f+gwhite@50`` ஐப் பயன்படுத்துகிறோம். கூடுதலாக, நிலப்பரப்பின் நிலப்பரப்பு வண்ணத்தால் மூடப்பட்டிருப்பதால், வண்ண ஒழுங்கு புராணத்தின் மேல் பாதி (0 முதல் 5000 மீட்டர் வரை) பயனற்ற செய்தி. இந்த பத்தியின் உள்ளடக்கத்தைத் தவிர்க்க, வரைதல் புராணக்கதை குறிப்பிடப்படும்போது பயன்படுத்தப்படும் வண்ண வரம்பைக் குறிப்பிட `` `-g`` விருப்பங்களைப் பயன்படுத்தலாம். இலக்கணம்

source: -G[最小值]/[最大值]
ta: -G [குறைந்தபட்ச மதிப்பு]/[அதிகபட்ச மதிப்பு]

source: ``最大值`` 可以設定為海平面 (``0``)，那最小值呢？別忘了我們可以使用 ``grdinfo`` 來查閱網格檔的基本資訊，只是這次要加上查詢的地理範圍 (``-R``)：
ta: `` அதிகபட்ச மதிப்பு `` கடல் மட்டமாக (`` 0``) அமைக்கப்படலாம், குறைந்தபட்ச மதிப்பைப் பற்றி என்ன? கட்டம் கோப்பின் அடிப்படை தகவல்களைச் சரிபார்க்க `` grdinfo`` ஐப் பயன்படுத்தலாம் என்பதை மறந்துவிடாதீர்கள், ஆனால் இந்த நேரத்தில் வினவலின் புவியியல் வரம்பைச் சேர்க்க வேண்டும் (`` -r``):

source: $ gmt grdinfo @earth_relief_01m -R-100/1/-50/34r # (前略) /home/whyj/.gmt/server/earth_relief_01m.grd: x_min: -100 x_max: -50 x_inc: 0.0166666666667 (1 min) name: longitude n_columns: 3001 /home/whyj/.gmt/server/earth_relief_01m.grd: y_min: 1 y_max: 34 y_inc: 0.0166666666667 (1 min) name: latitude n_rows: 1981 /home/whyj/.gmt/server/earth_relief_01m.grd: z_min: -8434 z_max: 5310 name: elevation (m) # (後略)
ta: $ gmt grdinfo @earth_relief_01m -r-100/1/-50/34r # (前略) /ஓம்/ /ஓம் /ஓம்/ # (後略)

source: 注意 ``z_min`` 的值，就是在搜尋區域中最低的像素值。因此，``最小值`` 使用 ``-8434`` 就可以了。完整的選項設定為 ``-G-8434/0``。把 ``-G`` 和 ``-F`` 的設定都加進 ``colorbar`` 指令內，就完成了本章地圖所有的要求。
ta: `` Z_MIN`` இன் மதிப்பு தேடல் பகுதியில் மிகக் குறைந்த படப்புள்ளி மதிப்பு என்பதை நினைவில் கொள்க. எனவே, குறைந்தபட்ச மதிப்பு `` `-8434`` பயன்படுத்தப்படலாம். முழுமையான விருப்பம் `` -G -8434/0`` என அமைக்கப்பட்டுள்ளது. `` `` `மற்றும்`` `` `` `` colorbarbar`` `` colorbar`` இன் அமைப்புகள், இந்த அத்தியாய வரைபடத்தின் அனைத்து தேவைகளையும் நிறைவு செய்கின்றன.

source: ``colorbar`` 預設繪製在腳本中最後一次使用的色階，在本例中為 ``geo``。如果你要使用 ``colorbar`` 繪製不同的色階條，必須使用 ``-C[色階名]`` 來指定色階進行繪圖。
ta: `` Colorbar`` ச்கிரிப்டில் பயன்படுத்தப்படும் கடைசி வண்ண தரத்தை முன்னமைக்கப்பட்டு, இந்த எடுத்துக்காட்டில் `` சியோ``. வெவ்வேறு வண்ண படிகளை வரைய `` colorbarbar `` பயன்படுத்த விரும்பினால், வரைபடத்திற்கான வண்ண வரிசையைக் குறிப்பிட `` `-c வண்ண ஆர்டர் பெயரை] பயன்படுத்த வேண்டும்.

source: 本章示範的是最基本的色階條繪製方法，如須查閱更多進階的技巧，請參閱\ :doc:`editing_cpt_colorbar`。
ta: இந்த அத்தியாயம் மிக அடிப்படையான வண்ண ஒழுங்கு வரைதல் முறையை நிரூபிக்கிறது.

source: 指令稿
ta: வழிமுறைகள்

source: 本地圖的最終指令稿如下：
ta: இந்த வரைபடத்தின் இறுதி அறிவுறுத்தல் வரைவு பின்வருமாறு:

source: # ==== 設定顏色與對應的國家 ==== # mexico, brazil, costa rica, dominican color1='#CD5C5C' colorgroup1='MX,BR,CR,DO' # guatemala, venezuela, jamaica, french guiana, bahamas color2='pink' colorgroup2='GT,JM,VE,GF,BS' # united states, puerto rico, nicaragua, guyana color3='240/230/140' colorgroup3='US,PR,NI,GY' # belize, haiti, trinidad and tobago, panama, salvador color4='0/36/74/4' colorgroup4='BZ,HT,TT,PA,SV' # colombia, cuba, honduras, suriname color5='97-0.52-0.94' colorgroup5='CO,CU,HN,SR' # 其他國家 color0='169' # ==== 主要指令 ==== gmt begin central_america_gmt6 png gmt grdimage @earth_relief_01m -JB-80.27/8.58/-8/24/15c -R-100/1/-50/34r -Cgeo # 底圖 gmt coast -G${color0} \ -E${colorgroup1}+g${color1} \ -E${colorgroup2}+g${color2} \ -E${colorgroup3}+g${color3} \ -E${colorgroup4}+g${color4} \ -E${colorgroup5}+g${color5} # 國家上色 gmt coast -W1/thinner -N1/thinner -Di -Bafg # 國界與海岸線 gmt colorbar -DjRM+w3c -G-8434/0 -Bx3000 -By+lm -F+gwhite@50 # 色階條 gmt end
ta: # ==== வண்ணத்தையும் அதனுடன் தொடர்புடைய நாட்டையும் அமைக்கவும் ==== # மெக்சிகோ, பிரேசில், கோச்டாரிகா, டொமினிகன் color1 = '#CD5C5C' colorGroup1 = 'mx, br, cr, do' # குவாத்தமாலா, வெனிசுலா, சமைக்கா, பிரஞ்சு கயானா, பஆமாச் color2 = 'இளஞ்சிவப்பு' ColorGroup2 = 'gt, jm, ve, gf, bs' # ஒன்றுபட்டது ச்டேட்ச், புவேர்ட்டோ ரிக்கோ, நிகரகுவா, கயானா color3 = '240/230/140' colorGroup3 = 'US, PR, Ni, Gy' # பெலிச், ஐட்டி, டிரினிடாட் மற்றும் டொபாகோ, பனாமா, சால்வடார் color4 = '0/36/74/4' colorGroup4 = 'BZ, HT, TT, PA, SV' # கொலம்பியா, கியூபா, ஓண்டுராச், சுரினாம் color5 = '97 -0.52-0.94 ' colorGroup5 = 'co, cu, hn, sr' # பிற நாடுகள் color0 = '169' # ==== முக்கிய வழிமுறைகள் ==== Gmt rection central_america_gmt6 png Gmt grdimage @earth_relief_01m-jb-80.27/8.58/24/15c -r-100/1/34r -cgeo # கீழ் விளக்கப்படம் gmt cost -g $ {color0} \ -E $ {colorgroup1}+g $ {color1} \ -E $ {colorgroup2}+g $ {color2} \ -E $ {colorgroup3}+g $ {color3} \ -E $ {colorgroup4}+g $ {color4} \ -E $ {colorgroup5}+g $ {color5} # தேசிய வண்ணம் GMT COST -W1/THINNER -N1/THINNER -DI -BAFG # தேசிய எல்லை மற்றும் கடற்கரை GMT colorBar -djrm+W3C -G -8434/0 -BX3000 -BY+LM -F+Gwhite@50 # வண்ண படி பட்டி GMT முடிவு

source: 「繪製國界與海床地形圖：以 **100W - 50W，1N - 34N** 為邊界，Albers 圓錐投影，地圖橫向寬 **15** 公分。國家使用 6 種不同的顏色著色，為國界和海岸線加上黑色細線條，海底地形使用 ``@earth_relief_01m`` 資料並以 ``geo`` 為色階。最後在地圖的\ **右側**\ 畫上 **3** 公分長的色階圖例，每隔 3000 公尺標示海床的深度，色階圖例背景使用透明白來填色。」
ta: . ஒரு கருப்பு மெல்லிய கோட்டோடு, மற்றும் கடல் தளத்தின் மேற்பரப்பு `@earth_relief_01m`` மற்றும்` சியோ` `வண்ண தகுதி, ஒவ்வொரு 3000 மீட்டருக்கும் கடல் படுக்கையின் ஆழத்தைக் குறித்தது. வண்ண வரிசையின் பின்னணியில் நிறத்தை நிரப்பவும்.

source: 觀看\ `最終版地圖`_
ta: \ `இறுதி பதிப்பு வரைபடத்தைப் பாருங்கள் _ _

source: PyGMT 指令稿
ta: PYGMT அறிவுறுத்தல் வரைவு

source: 使用 PyGMT，可以如下腳本繪製本地圖：
ta: ஒரு வரைபடத்தை பின்வருமாறு வரைய PYGMT ஐப் பயன்படுத்தவும்:

source: import pygmt # ==== 設定顏色與對應的國家 ==== # 這裡我們利用了 Python 的 Dictionary 資料結構來縮短程式碼！ color_dict = {'MX,BR,CR,DO': '#CD5C5C', # mexico, brazil, costa rica, dominican 'GT,JM,VE,GF,BS': 'pink', # guatemala, venezuela, jamaica, french guiana, bahamas 'US,PR,NI,GY': '240/230/140', # united states, puerto rico, nicaragua, guyana 'BZ,HT,TT,PA,SV': '0/36/74/4', # belize, haiti, trinidad and tobago, panama, salvador 'CO,CU,HN,SR': '97-0.52-0.94'} # colombia, cuba, honduras, suriname color0 = '169' # 其他國家 dcw_list = [key + '+g' + value for key, value in color_dict.items()] # ==== 取得地形資料 ==== region = [-100, -50, 1, 34] grid = pygmt.datasets.load_earth_relief(resolution='05m', region=region) # ==== 繪圖 ==== fig = pygmt.Figure() fig.grdimage(grid, region=region, projection='B-80.27/8.58/-8/24/15c', cmap='geo') fig.coast(land=color0, dcw=dcw_list) fig.coast(shorelines='1/thinner', borders='1/thinner', resolution='i', frame='afg') # 注意這裡我們在色階條的位置字串中加上了 +o1c/0，稍微偏移其位置。 fig.colorbar(position='jRM+w3c+o1c/0', truncate=[-8000, 0], frame=['x3000', 'y+lm'], box='+gwhite@50') fig.show() fig.savefig('central_america_pygmt.png')
ta: இறக்குமதி பைக்ம்ட் # ==== வண்ணத்தையும் அதனுடன் தொடர்புடைய நாட்டையும் அமைக்கவும் ==== # இங்கே குறியீட்டைக் குறைக்க பைதானின் அகராதி தரவு கட்டமைப்பைப் பயன்படுத்துகிறோம்! color_dict = {'mx, br, cr, do': # cd5c5c ', # மெக்சிகோ, பிரேசில், கோச்டாரிகா, டொமினிகன் 'சி.டி, சே.எம்., வி.இ, சி.எஃப். 'யு.எச். 'BZ, HT, TT, PA, SV': '0/36/74/4', # பெலிச், ஐட்டி, டிரினிடாட் மற்றும் டொபாகோ, பனாமா, சால்வடார் 'கோ, கியூ, எச்.என். color 0 = '169' # பிற நாடுகள் dcw_list = [key + ' + g' + KEY க்கான மதிப்பு, color_dict.items () இல் மதிப்பு ()] # ==== நிலப்பரப்பு தகவலைப் பெறுங்கள் ==== பகுதி = [-100, -50, 1, 34] கட்டம் = pygmt.datasets.load_earth_relife (தீர்மானம் = '05 மீ', பகுதி = பகுதி) # ==== வரைதல் ==== படம் = pygmt.figure () படம். Fig.coast (நிலம் = வண்ணம் 0, dcw = dcw_list) Fig.coast (கரையோரங்கள் = '1/மெல்லிய', எல்லைகள் = '1/மெல்லிய', தீர்மானம் = 'i', பிரேம் = 'afg')) # வண்ண ஆர்டர் பட்டியின் நிலை சரத்திற்கு +O1C/0 ஐச் சேர்ப்பதை இங்கே கவனியுங்கள், அதன் நிலையை சற்று ஈடுசெய்கிறது. படம். fig.show () fig.savefig ('centrual_america_pygmt.png')

source: 你可以使用以下的 Binder 連結嘗試此程式碼：
ta: இந்த குறியீட்டை முயற்சிக்க பின்வரும் பைண்டர் இணைப்பைப் பயன்படுத்தலாம்:

source: 習題
ta: உடற்பயிற்சி

source: 仿造此章節的地圖，畫出南海 (*South China Sea*) 的海底地形與週邊國家圖。座標可使用 ``95E 至 123E``，以及 ``0N 至 26N``。可使用本章節的顏色或自行調整你愛的搭配。
ta: தென் சீனக் கடலின் நீருக்கடியில் நிலப்பரப்பு மற்றும் அண்டை நாடுகளை (*தென் சீனக் கடல்*) வரைய இந்த அத்தியாயத்தின் வரைபடத்தைப் பின்பற்றுங்கள். ஒருங்கிணைப்புகள் `` 95e முதல் 123e``, மற்றும் `0n முதல் 26n`` ஆகியவற்றைப் பயன்படுத்தலாம். இந்த அத்தியாயத்தின் நிறத்தைப் பயன்படுத்தலாம் அல்லது உங்கள் அன்பை சரிசெய்யலாம்.

source: 有沒有辦法把香港與海南島塗上與中國不同的顏色？
ta: சீனாவிலிருந்து வேறுபட்ட ஆங்காங் மற்றும் ஐனன் தீவை வரைவதற்கு ஒரு வழி இருக்கிறதா?
