Repository: 247i/TACETr
Catalog: உரை/தானி/guardianproject-circulo-ios-*.po
Languages: ta

source: Please go to Settings and allow camera access.
ta: தயவுசெய்து அமைப்புகளுக்குச் சென்று கேமரா அணுகலை அனுமதிக்கவும்.

source: Please go to Settings and enable notifications for this app.
ta: தயவுசெய்து அமைப்புகளுக்குச் சென்று இந்த பயன்பாட்டிற்கான அறிவிப்புகளை இயக்கவும்.

source: Preferences
ta: விருப்பத்தேர்வுகள்

source: Profile
ta: சுயவிவரம்

source: Published Address
ta: வெளியிடப்பட்ட முகவரி

source: Push Notification settings successfully refreshed.
ta: அறிவிப்பு அமைப்புகள் வெற்றிகரமாக புதுப்பிக்கப்பட்டுள்ளன.

source: Push Notifications
ta: அறிவிப்புகளை அழுத்தவும்

source: QR Code
ta: QR குறியீடு

source: Quick Reaction
ta: விரைவான எதிர்வினை

source: Re-request encryption keys
ta: குறியாக்க விசைகளை மீண்டும் கோருங்கள்

source: Really delete the key backup on the server?
ta: சேவையகத்தின் முக்கிய காப்புப்பிரதியை உண்மையில் நீக்கவா?

source: Reason: %
ta: காரணம்: %

source: Recording Audio
ta: ஆடியோவைப் பதிவுசெய்கிறது

source: Recovery Key
ta: மீட்பு விசை

source: Recovery Password
ta: மீட்பு கடவுச்சொல்

source: Registration Token
ta: பதிவு கிள்ளாக்கு

source: Release to Send
ta: அனுப்ப வெளியீடு

source: Release to cancel recording
ta: பதிவை ரத்து செய்ய வெளியீடு

source: Release to send
ta: அனுப்ப வெளியீடு

source: Remind me to check in
ta: சரிபார்க்க எனக்கு நினைவூட்டுங்கள்

source: Remove
ta: அகற்று

source: Remove as moderator
ta: மதிப்பீட்டாளராக அகற்று

source: Reply
ta: பதில்

source: Request was cancelled
ta: கோரிக்கை ரத்து செய்யப்பட்டது

source: Resend
ta: மீண்டும்

source: Reset to normal user
ta: சாதாரண பயனருக்கு மீட்டமைக்கவும்

source: Resolved %
ta: தீர்க்கப்பட்டது %

source: Restore
ta: மீட்டமை

source: Restore Successful
ta: வெற்றிகரமாக மீட்டெடுங்கள்

source: Restore from Backup
ta: காப்புப்பிரதியிலிருந்து மீட்டமைக்கவும்

source: Ringtone
ta: ரிங்டோன்

source: Room Name
ta: அறை பெயர்

source: Room Topic
ta: அறை தலைப்பு

source: Scan QR Code
ta: QR குறியீட்டை ச்கேன் செய்யுங்கள்

source: Scan the other party's QR code or compare emoji instead.
ta: மற்ற கட்சியின் QR குறியீட்டை ச்கேன் செய்யுங்கள் அல்லது அதற்கு பதிலாக ஈமோசியை ஒப்பிடுக.

source: Scanned
ta: ச்கேன்

source: See who needs help
ta: யாருக்கு உதவி தேவை என்று பாருங்கள்

source: See your messages?
ta: உங்கள் செய்திகளைப் பார்க்கவா?

source: Seen by % people
ta: % நபர்களால் பார்க்கப்படுகிறது

source: Send location with alerts
ta: விழிப்பூட்டல்களுடன் இருப்பிடத்தை அனுப்பவும்

source: Send your invite link
ta: உங்கள் அழைப்பிதழ் இணைப்பை அனுப்பவும்

source: Sending…
ta: அனுப்புகிறது…

source: Sent
ta: அனுப்பப்பட்டது

source: Sent %
ta: அனுப்பப்பட்டது %

source: Sent %@
ta: அனுப்பப்பட்டது %@

source: Server
ta: சேவையகம்

source: Server didn't return anything!
ta: சேவையகம் எதையும் திருப்பித் தரவில்லை!

source: Set a password for the backup which you can use to restore later:
ta: பின்னர் மீட்டமைக்க நீங்கள் பயன்படுத்தக்கூடிய காப்புப்பிரதிக்கு கடவுச்சொல்லை அமைக்கவும்:

source: Settings
ta: அமைப்புகள்

source: Share
ta: பங்கு

source: Share Link
ta: இணைப்பைப் பகிரவும்

source: Share Profile
ta: சுயவிவரத்தைப் பகிரவும்

source: Share without verification
ta: சரிபார்ப்பு இல்லாமல் பகிரவும்

source: Shared and received photos will appear here
ta: பகிரப்பட்ட மற்றும் பெறப்பட்ட புகைப்படங்கள் இங்கே தோன்றும்

source: Show
ta: காட்டு

source: Show Advanced Options
ta: மேம்பட்ட விருப்பங்களைக் காட்டு

source: Show QR
ta: QR ஐக் காட்டு

source: Show in Maps
ta: வரைபடங்களில் காட்டு

source: Show the other party this QR code or compare emoji instead.
ta: மற்ற கட்சிக்கு இந்த QR குறியீட்டைக் காட்டுங்கள் அல்லது அதற்கு பதிலாக ஈமோசியை ஒப்பிடுக.

source: Show the other party this QR code or scan theirs.
ta: இந்த QR குறியீட்டை மற்ற கட்சியைக் காட்டுங்கள் அல்லது அவற்றின் ச்கேன்.

source: Show the other party this QR code, scan theirs or compare emoji instead.
ta: இந்த QR குறியீட்டைக் காட்டுங்கள், அவற்றின் ச்கேன் அல்லது அதற்கு பதிலாக ஈமோசியை ஒப்பிட்டுப் பாருங்கள்.

source: Sign In
ta: விடுபதிகை

source: Sign Up
ta: பதிவு செய்க

source: Sign into an Existing Account
ta: ஏற்கனவே உள்ள கணக்கில் உள்நுழைக

source: Sign-in to an existing account
ta: ஏற்கனவே உள்ள கணக்கிற்கு உள்நுழைக

source: Skip
ta: தவிர்

source: Solve Recaptcha
ta: ரெக்காப்ட்சாவை தீர்க்கவும்

source: Someone joined your circle
ta: யாரோ உங்கள் வட்டத்தில் சேர்ந்தனர்

source: Someone resolved their status.
ta: யாரோ தங்கள் நிலையைத் தீர்த்தனர்.

source: Sorry, you are not allowed to view the photo library.
ta: மன்னிக்கவும், புகைப்பட நூலகத்தைப் பார்க்க உங்களுக்கு இசைவு இல்லை.

source: Sorry, you cannot use this feature, because location access is in a state which cannot be recognized.
ta: மன்னிக்கவும், இந்த அம்சத்தை நீங்கள் பயன்படுத்த முடியாது, ஏனென்றால் இருப்பிட அணுகல் அங்கீகரிக்க முடியாத நிலையில் உள்ளது.

source: Sorry, you cannot use this feature, because you're not allowed to share your location.
ta: மன்னிக்கவும், இந்த அம்சத்தை நீங்கள் பயன்படுத்த முடியாது, ஏனென்றால் உங்கள் இருப்பிடத்தைப் பகிர உங்களுக்கு இசைவு இல்லை.

source: Sound
ta: ஒலி

source: Standing next to them?
ta: அவர்களுக்கு அருகில் நிற்கிறதா?

source: Start verifying
ta: சரிபார்க்கத் தொடங்குங்கள்

source: Sticker
ta: ச்டிக்கர்

source: Stop
ta: நிறுத்து

source: Stop App
ta: பயன்பாட்டை நிறுத்து

source: Stop Location Share
ta: இருப்பிட பங்கை நிறுத்துங்கள்

source: Stop the app and open it again.
ta: பயன்பாட்டை நிறுத்தி மீண்டும் திறக்கவும்.

source: Story Stream
ta: கதை ச்ட்ரீம்

source: Success
ta: செய்

source: Syncing…
ta: ஒத்திசைவு…

source: Tap here to add friends and start chatting
ta: நண்பர்களைச் சேர்க்க இங்கே தட்டவும், அரட்டையடிக்கத் தொடங்கவும்

source: Tap here to enable microphone
ta: மைக்ரோஃபோனை இயக்க இங்கே தட்டவும்

source: Tap hold to send alert.
ta: எச்சரிக்கையை அனுப்ப ஓல்ட் தட்டவும்.

source: That QR code doesn't contain a valid Matrix ID!
ta: அந்த QR குறியீட்டில் செல்லுபடியாகும் மேட்ரிக்ச் ஐடி இல்லை!

source: That QR code doesn't contain a valid verification code!
ta: அந்த QR குறியீட்டில் செல்லுபடியாகும் சரிபார்ப்பு குறியீடு இல்லை!

source: The account will also be removed from this device!
ta: இந்த சாதனத்திலிருந்து கணக்கு அகற்றப்படும்!

source: The other party cancelled the request
ta: மற்ற கட்சி கோரிக்கையை ரத்து செய்தது

source: There was an error connecting to the server.
ta: சேவையகத்துடன் இணைக்கும் பிழை இருந்தது.

source: They Don't Match
ta: அவர்கள் பொருந்தவில்லை

source: They Match
ta: அவர்கள் பொருந்துகிறார்கள்

source: This Device
ta: இந்த சாதனம்

source: This allows the app to get your location even when it's running in the background.
ta: இது பின்னணியில் இயங்கும்போது கூட பயன்பாட்டை உங்கள் இருப்பிடத்தைப் பெற அனுமதிக்கிறது.

source: This allows the app to get your location, even when it's running in the background.
ta: இது பின்னணியில் இயங்கும்போது கூட, உங்கள் இருப்பிடத்தைப் பெற பயன்பாட்டை அனுமதிக்கிறது.

source: This server needs a token to be able to register an account.
ta: ஒரு கணக்கை பதிவு செய்ய இந்த சேவையகத்திற்கு ஒரு கிள்ளாக்கு தேவை.

source: This username is already taken.
ta: இந்த பயனர்பெயர் ஏற்கனவே எடுக்கப்பட்டுள்ளது.

source: To be able to share a room, it needs a published address. Please create one here.
ta: ஒரு அறையைப் பகிர்ந்து கொள்ள, அதற்கு வெளியிடப்பட்ட முகவரி தேவை. தயவுசெய்து இங்கே ஒன்றை உருவாக்கவும்.

source: To join a circle, open an invite link with Círculo or paste it below.
ta: ஒரு வட்டத்தில் சேர, Circulo உடன் அழைப்பிதழ் இணைப்பைத் திறக்கவும் அல்லது அதை கீழே ஒட்டவும்.

source: Turn On Location Services to Allow "%" Determine Your Location
ta: உங்கள் இருப்பிடத்தை தீர்மானிக்க "%" அனுமதிக்க இருப்பிட சேவைகளை இயக்கவும்

source: Type
ta: வகை

source: Unable to join room.
ta: அறையில் சேர முடியவில்லை.

source: Unarchive
ta: அன்கான்

source: Unavailable
ta: கிடைக்கவில்லை

source: Undo
ta: செயல்தவிர்

source: Unknown
ta: தெரியவில்லை

source: Unknown Location
ta: தெரியாத இடம்

source: Unknown Sender
ta: தெரியாத அனுப்புநர்

source: Unknown devices
ta: அறியப்படாத சாதனங்கள்

source: Unkown server error
ta: அறியப்படாத சேவையக பிழை

source: Until I arrive
ta: நான் வரும் வரை

source: Updated %
ta: புதுப்பிக்கப்பட்டது %

source: Uploading... tap to cancel
ta: பதிவேற்றுதல் ... ரத்து செய்ய தட்டவும்

source: Use Custom Identity Server
ta: தனிப்பயன் அடையாள சேவையகத்தைப் பயன்படுத்தவும்

source: Use Interactive Mode Instead
ta: அதற்கு பதிலாக ஊடாடும் பயன்முறையைப் பயன்படுத்தவும்

source: Used to send an audio memo with your alert.
ta: உங்கள் எச்சரிக்கையுடன் ஆடியோ மெமோவை அனுப்ப பயன்படுகிறது.

source: Used to share your location while the alert is active.
ta: எச்சரிக்கை செயலில் இருக்கும்போது உங்கள் இருப்பிடத்தைப் பகிர்ந்து கொள்ளப் பயன்படுகிறது.

source: User Name
ta: பயனர் பெயர்

source: Validation Code
ta: சரிபார்ப்பு குறியீடு

source: Verification Successful!
ta: சரிபார்ப்பு வெற்றிகரமாக!

source: Verify
ta: சரிபார்க்கவும்

source: Verify Device
ta: சாதனத்தை சரிபார்க்கவும்

source: Version: %, Build: %
ta: பதிப்பு: %, உருவாக்க: %

source: Vibration
ta: அதிர்வு

source: Video file
ta: வீடியோ கோப்பு

source: View
ta: பார்வை

source: View Devices and Keys
ta: சாதனங்கள் மற்றும் விசைகளைக் காண்க

source: View Profile
ta: சுயவிவரத்தைக் காண்க

source: View Resources
ta: வளங்களைக் காண்க

source: View profile
ta: சுயவிவரத்தைக் காண்க

source: Voice message
ta: குரல் செய்தி

source: Waiting
ta: காத்திருக்கிறது

source: Waiting on challenge negotiation…
ta: அறைகூவல் பேச்சுவார்த்தையில் காத்திருக்கிறது…

source: Waiting on confirmation from other device…
ta: மற்ற சாதனங்களிலிருந்து உறுதிப்படுத்த காத்திருக்கிறது…

source: Waiting on other party to accept…
ta: ஏற்றுக்கொள்ள மற்ற கட்சிக்கு காத்திருக்கிறது…

source: Waiting to be seen…
ta: பார்க்க காத்திருக்கிறது…

source: Want to contribute?
ta: பங்களிக்க வேண்டுமா?

source: We recommend changing your password and remove the new device from your account immediately.
ta: உங்கள் கடவுச்சொல்லை மாற்ற பரிந்துரைக்கிறோம், உடனடியாக உங்கள் கணக்கிலிருந்து புதிய சாதனத்தை அகற்றவும்.

source: We'll notify your circle and resolve the alert.
ta: நாங்கள் உங்கள் வட்டத்திற்கு அறிவித்து எச்சரிக்கையை தீர்ப்போம்.

source: We'll remember your encryption keys so you can see encrypted messages when you log back in.
ta: உங்கள் குறியாக்க விசைகளை நாங்கள் நினைவில் கொள்வோம், எனவே நீங்கள் மீண்டும் உள்நுழையும்போது மறைகுறியாக்கப்பட்ட செய்திகளைக் காணலாம்.

source: We've detected that your device is jailbroken. If you're aware, ignore this message. If you're not aware, seek an expert to help you.
ta: உங்கள் சாதனம் செயில்பிரோகன் என்பதை நாங்கள் கண்டறிந்துள்ளோம். உங்களுக்குத் தெரிந்தால், இந்த செய்தியை புறக்கணிக்கவும். உங்களுக்குத் தெரியாவிட்டால், உங்களுக்கு உதவ ஒரு நிபுணரைத் தேடுங்கள்.

source: Welcome to Keanu
ta: கீனுவுக்கு வருக

source: When to notify
ta: எப்போது அறிவிக்க வேண்டும்

source: Yes
ta: ஆம்

source: You are sharing for %
ta: நீங்கள் % ஐப் பகிர்கிறீர்கள்

source: You are sharing for %@
ta: நீங்கள் %@ க்கு பகிர்கிறீர்கள்

source: You are sharing your location
ta: உங்கள் இருப்பிடத்தைப் பகிர்கிறீர்கள்

source: You can opt out of this study anytime.
ta: இந்த ஆய்விலிருந்து நீங்கள் எப்போது வேண்டுமானாலும் விலகலாம்.

source: You have % unseen events
ta: உங்களிடம் % காணப்படாத நிகழ்வுகள் உள்ளன

source: You have % unseen events in % groups
ta: % குழுக்களில் நீங்கள் காணப்படாத % நிகழ்வுகள் உள்ளன

source: You have 1 unseen event
ta: உங்களிடம் 1 காணப்படாத நிகழ்வு உள்ளது

source: You should have received this by the server operator.
ta: இதை நீங்கள் சேவையக ஆபரேட்டரால் பெற்றிருக்க வேண்டும்.

source: You've been invited to a circle.
ta: நீங்கள் ஒரு வட்டத்திற்கு அழைக்கப்பட்டுள்ளீர்கள்.

source: You've been invited to a new circle. Would you like to leave your current circle to join it?
ta: நீங்கள் ஒரு புதிய வட்டத்திற்கு அழைக்கப்பட்டுள்ளீர்கள். அதில் சேர உங்கள் தற்போதைய வட்டத்தை விட்டு வெளியேற விரும்புகிறீர்களா?

source: You've been invited to the ´%´ circle.
ta: நீங்கள் ´%´ வட்டத்திற்கு அழைக்கப்பட்டுள்ளீர்கள்.

source: You've been invited to the ´%´ circle. Would you like to leave your current circle to join it?
ta: நீங்கள் ´%´ வட்டத்திற்கு அழைக்கப்பட்டுள்ளீர்கள். அதில் சேர உங்கள் தற்போதைய வட்டத்தை விட்டு வெளியேற விரும்புகிறீர்களா?

source: You've been mentioned.
ta: நீங்கள் குறிப்பிடப்பட்டுள்ளீர்கள்.

source: Your Friend
ta: உங்கள் நண்பர்

source: Your Public Name
ta: உங்கள் பொது பெயர்

source: Your Story
ta: உங்கள் கதை

source: Your Story Title
ta: உங்கள் கதை தலைப்பு

source: Your account is not secure
ta: உங்கள் கணக்கு பாதுகாப்பாக இல்லை

source: Your circle agreement starts outside of this app. Talk with the people who will be in a circle together. One person from the group should create the circle and send an invite link to the others.
ta: உங்கள் வட்ட ஒப்பந்தம் இந்த பயன்பாட்டிற்கு வெளியே தொடங்குகிறது. ஒன்றாக வட்டத்தில் இருக்கும் மக்களுடன் பேசுங்கள். குழுவில் இருந்து ஒரு நபர் வட்டத்தை உருவாக்கி மற்றவர்களுக்கு அழைப்பிதழ் இணைப்பை அனுப்ப வேண்டும்.

source: Your circle is responding!
ta: உங்கள் வட்டம் பதிலளிக்கிறது!

source: Your history can be seen by your circle.
ta: உங்கள் வரலாற்றை உங்கள் வட்டத்தால் காணலாம்.

source: Your history from % ago can be seen by your circle.
ta: % முந்தைய உங்கள் வரலாற்றை உங்கள் வட்டத்தால் காணலாம்.

source: Your location is never exposed.
ta: உங்கள் இருப்பிடம் ஒருபோதும் அம்பலப்படுத்தப்படவில்லை.

source: Your location is only accessed by % when you choose to share live location or when you send an alert.
ta: நீங்கள் நேரடி இருப்பிடத்தைப் பகிரத் தேர்வுசெய்யும்போது அல்லது நீங்கள் எச்சரிக்கையை அனுப்பும்போது உங்கள் இருப்பிடம் % மட்டுமே அணுகப்படுகிறது.

source: Your password, server or the internet connection might be accessed without your knowledge.
ta: உங்கள் கடவுச்சொல், சேவையகம் அல்லது இணைய இணைப்பு உங்கள் அறிவு இல்லாமல் அணுகப்படலாம்.

source: Your room chat history will be wiped away. To keep these chats, archive the room instead.
ta: உங்கள் அறை அரட்டை வரலாறு அழிக்கப்படும். இந்த அரட்டைகளை வைத்திருக்க, அதற்கு பதிலாக அறையை காப்பகப்படுத்தவும்.

source: blocked
ta: தடுக்கப்பட்டது

source: cancelled
ta: ரத்து செய்யப்பட்டது

source: disabled
ta: முடக்கப்பட்டது

source: enabled
ta: இயக்கப்பட்டது

source: errored
ta: பிழை

source: expired
ta: காலாவதியான

source: iweury wieuyr iweuyr iwueyr iuweyr iuweyriu weyiury weiruy weiury weiury iweuyr iwuer iwe
ta: Iwaury wiuyr iwuyr iwuyir iuweir iuweiriu weyiiury weiruy weiuury weiury iwuyr iwuer

source: new
ta: புதிய

source: offline
ta: இணையமில்லாமல்

source: offline, last active % ago
ta: இணைப்பில்லாத, கடைசியாக செயலில் % முன்பு

source: online
ta: ஆன்லைனில்

source: presence unclear
ta: இருப்பு தெளிவாக இல்லை

source: right now
ta: இப்போது

source: somebody
ta: யாரோ

source: successful
ta: செய்

source: unavailable, last active % ago
ta: கிடைக்கவில்லை, கடைசியாக செயலில் % முன்பு

source: unknown
ta: தெரியவில்லை

source: unverified
ta: சரிபார்க்கப்படாதது

source: verified
ta: சரிபார்க்கப்பட்டது

source: years
ta: ஆண்டுகள்

source: 📣 Someone posted a message.
ta: 📣 யாரோ ஒரு செய்தியை வெளியிட்டனர்.
