Repository: 247i/TACETr
Catalog: உரை/தானி/guardianproject-orbot-*.po
Languages: ta

# setting_padding
source: Padding
ta: திணிப்பு

# setting_debug
source: Debug
ta: வழுநீக்கு

# pref_flag_secure_summary
source: Prevent other apps from taking screenshots of Orbot
ta: மற்ற பயன்பாடுகள் ஆர்போட்டின் திரை சாட்களை எடுப்பதைத் தடுக்கவும்

# pref_flag_secure_title
source: Screen Security
ta: திரை பாதுகாப்பு

# root_warning
source: Orbot has detected your device is rooted, which can cause security issues.
ta: ஆர்போட் உங்கள் சாதனம் வேரூன்றியிருப்பதைக் கண்டறிந்துள்ளது, இது பாதுகாப்பு சிக்கல்களை ஏற்படுத்தும்.

# pref_detect_root_summary
source: Warn on startup if root permissions are enabled on this device
ta: இந்த சாதனத்தில் ரூட் அனுமதிகள் இயக்கப்பட்டிருந்தால் தொடக்கத்தைப் பற்றி எச்சரிக்கவும்

# pref_detect_root_title
source: Root Detection
ta: ரூட் கண்டறிதல்

# app_icon_chooser_label_night_watch
source: Night Watch
ta: இரவு கடிகாரம்

# app_icon_chooser_label_assistant
source: Assistant
ta: உதவியாளர்

# app_icon_chooser_label_paint
source: Paint
ta: வண்ணப்பூச்சு

# app_icon_chooser_label_tetras
source: Tetras
ta: டெட்ராச்

# app_icon_chooser_label_todo
source: To-Do
ta: செய்ய வேண்டியவை

# app_icon_chooser_label_birdie
source: Birdie
ta: பறவை

# camo_dialog_title
source: Camouflage as %1$s
ta: உருமறைப்பு %1$s

# camo_dialog_enable_confirm_msg
source: Orbot will camouflage itself as the app %1$s. This will hide all notification details about Tor and change how the appearance of Orbot on your home screen. Camouflaging as %2$s will restart Orbot.
ta: ஆர்போட் தன்னை %1$s ஆக மறைக்கும். இது TOR பற்றிய அனைத்து அறிவிப்பு விவரங்களையும் மறைத்து, உங்கள் முகப்புத் திரையில் ஆர்போட்டின் தோற்றத்தை எவ்வாறு மாற்றும். %2$s என உருமறைப்பது ஆர்போட்டை மறுதொடக்கம் செய்யும்.

# camo_dialog_disable_confirm_msg
source: Orbot will resume displaying notification information about your Tor connection and will appear as normal on your home screen. Disabling Camouflage Mode will restart Orbot.
ta: ஆர்போட் உங்கள் TOR இணைப்பு பற்றிய அறிவிப்பு தகவல்களைக் காண்பிக்கும் மற்றும் உங்கள் முகப்புத் திரையில் இயல்பானதாகத் தோன்றும். உருமறைப்பு பயன்முறையை முடக்குவது சுற்றுப்பாதையை மறுதொடக்கம் செய்யும்.

# camo_dialog_disable_title
source: Disable Camouflage Mode
ta: உருமறைப்பு பயன்முறையை முடக்கு

# camo_samsung_instructions
source: On Your Samsung Galaxy device Camouflage Mode's notifications will only work by opening your Settings -> Notifications -> Advanced Settings and disabling "Show app icon in notifications". Click here to open Notification Settings.
ta: உங்கள் சாம்சங் கேலக்சி சாதனத்தில் உருமறைப்பு பயன்முறையின் அறிவிப்புகள் உங்கள் அமைப்புகளைத் திறப்பதன் மூலம் மட்டுமே செயல்படும் -> அறிவிப்புகள் -> மேம்பட்ட அமைப்புகள் மற்றும் "அறிவிப்புகளில் பயன்பாட்டு ஐகானைக் காட்டு" என்பதை முடக்குகின்றன. அறிவிப்பு அமைப்புகளைத் திறக்க இங்கே சொடுக்கு செய்க.

# pref_camo_mode_title
source: Camouflage Mode
ta: உருமறைப்பு முறை

# pref_camo_mode_description
source: Disguise how Orbot's icon, label and notification text will appear on your device
ta: உங்கள் சாதனத்தில் ஆர்போட்டின் படவுரு, சிட்டை மற்றும் அறிவிப்பு உரை எவ்வாறு தோன்றும் என்பதை மறைக்கவும்

# power_user_mode_permission
source: Alarms & Reminders Permission Needed for Power User Mode
ta: பவர் பயனர் பயன்முறைக்கு அலாரங்கள் மற்றும் நினைவூட்டல் இசைவு தேவை

# power_user_mode_permission_msg
source: Please allow Orbot to set alarms and reminders in order to use power user mode. This won't actually set any alarms on your device. This permission is needed to have the system keep OrbotService running when Orbot is not being used as a system-wide VPN.
ta: ஆற்றல் பயனர் பயன்முறையைப் பயன்படுத்த அலாரங்கள் மற்றும் நினைவூட்டல்களை அமைக்க ஆர்போட்டை அனுமதிக்கவும். இது உண்மையில் உங்கள் சாதனத்தில் எந்த அலாரங்களையும் அமைக்காது. கணினி அளவிலான VPN ஆக ஆர்போட் பயன்படுத்தப்படாதபோது, கணினி ஆர்போட்சர்வீசை இயக்குவதற்கு இந்த இசைவு தேவை.

# request_notification_permission
source: Please enable notifications for Orbot
ta: ஆர்போட்டிற்கான அறிவிப்புகளை இயக்கவும்

# request_notification_permission_msg
source: Without turning on notifications Orbot can't act as a Tor VPN or use Kindness Mode. When enabled, we only show a single notification when Orbot is running.
ta: அறிவிப்புகளை இயக்காமல் ஆர்போட் ஒரு டோர் வி.பி.என் ஆக செயல்பட முடியாது அல்லது கருணை பயன்முறையைப் பயன்படுத்த முடியாது. இயக்கப்பட்டால், ஆர்போட் இயங்கும்போது மட்டுமே ஒரு அறிவிப்பைக் காண்பிப்போம்.

source: Open Settings
ta: திறந்த அமைப்புகள்

# pref_require_password
source: Orbot Authentication
ta: ஆர்போட் ஏற்பு

# pref_require_password_description
source: Prevent access to Orbot until you authenticate by entering your device password or fingerprint. This can be combined with Camouflage Mode to help hide that Orbot is installed on your device
ta: உங்கள் சாதன கடவுச்சொல் அல்லது கைரேகையை உள்ளிடுவதன் மூலம் நீங்கள் அங்கீகரிக்கும் வரை ஆர்போட் அணுகலைத் தடுக்கவும். உங்கள் சாதனத்தில் ஆர்போட் நிறுவப்பட்டுள்ளது என்பதை மறைக்க உதவும் உருமறைப்பு பயன்முறையுடன் இதை இணைக்கலாம்

# error_no_password_set
source: Please secure your device in order to use Orbot Authentication
ta: ஆர்போட் அங்கீகாரத்தைப் பயன்படுத்த உங்கள் சாதனத்தைப் பாதுகாக்கவும்

# device_lock_unsupported
source: Orbot Authentication is not supported on your device
ta: உங்கள் சாதனத்தில் ஆர்போட் ஏற்பு ஆதரிக்கப்படவில்லை

# device_lock_security_update_needed
source: You must download Android security updates for your device in order to use Orbot Authentication
ta: ஆர்போட் அங்கீகாரத்தைப் பயன்படுத்த உங்கள் சாதனத்திற்கான ஆண்ட்ராய்டு பாதுகாப்பு புதுப்பிப்புகளை நீங்கள் பதிவிறக்கம் செய்ய வேண்டும்

source: Invalid bridge format
ta: தவறான பாலம் வடிவம்

# error_asking_tor_for_bridges
source: Error asking Tor how to connect
ta: எவ்வாறு இணைப்பது என்று டோர் கேட்பது

source: Enter bridge address
ta: பாலம் முகவரியை உள்ளிடவும்

source: Built-in Bridges (obfs4)
ta: உள்ளமைக்கப்பட்ட பாலங்கள் (OBFS4)

# built_in_bridges_obfs4_subtitle
source: Cloaks your traffic. Gets around some Tor blocking. Good if you're on public WiFi, but in a country where Tor isn't blocked.
ta: உங்கள் போக்குவரத்தை மூடுகிறது. சில டோர் தடுப்புகளைச் சுற்றி வருகிறது. நீங்கள் பொது வைஃபை வைத்திருந்தால் நல்லது, ஆனால் டோர் தடுக்கப்படாத ஒரு நாட்டில்.

# unlock_app_msg
source: Please unlock your device in order to use %s
ta: %s ஐப் பயன்படுத்த உங்கள் சாதனத்தைத் திறக்கவும்

# pref_password_only_no_biometric
source: Disallow Biometrics for Orbot Authentication
ta: ஆர்போட் அங்கீகாரத்திற்கான பயோமெட்ரிக்சை அனுமதிக்காதீர்கள்

# pref_password_only_no_biometric_description
source: This forces Orbot Authentication to only require your device's password even if biometric authentication, such as fingerprint or face unlock, are configured on your device.
ta: கைரேகை அல்லது முகம் திறத்தல் போன்ற பயோமெட்ரிக் ஏற்பு உங்கள் சாதனத்தில் கட்டமைக்கப்பட்டிருந்தாலும் கூட, உங்கள் சாதனத்தின் கடவுச்சொல்லை மட்டுமே தேவைப்படும் ஆர்போட் அங்கீகாரத்தை இந்த கட்டாயப்படுத்துகிறது.

# run_smart_connect_
source: Run Smart Connect to find the best way
ta: சிறந்த வழியைக் கண்டுபிடிக்க அறிவுள்ள கனெக்டை இயக்கவும்

source: Scan QR Code
ta: QR குறியீட்டை வருடு செய்யுங்கள்

# status_starting_up
source: Orbot is Starting…
ta: ஆர்பாட் துவங்குகிறது…

# status_activated
source: Connected to the Tor Network
ta: தோர் நெட்வொர்க் இணைக்கப்பட்ட

# status_disabled
source: Orbot is Deactivated
ta: ஆர்பாட் நிறுத்தப்பட்டது

source: Open Orbot to Connect to Tor
ta: TOR உடன் இணைக்க ஆர்போட் திறக்கவும்

# status_shutting_down
source: Orbot is Shutting Down
ta: ஆர்போட் மூடப்படுகிறது

source: Connect to Tor
ta: TOR உடன் இணைக்கவும்

# orbot_config_invalid
source: Orbot Configuration Invalid
ta: சுற்றுப்பாதை உள்ளமைவு தவறானது

source: Couldn't start Tor process:
ta: டோர் செயல்முறையைத் தொடங்க முடியவில்லை:

source: Your ReachableAddresses settings caused an exception!
ta: உங்கள் அடையக்கூடிய அலங்கார அமைப்புகள் விதிவிலக்கை ஏற்படுத்தின!

source: Unable to start Tor:
ta: டோர் தொடங்க முடியவில்லை:

source: updating settings in Tor service
ta: TOR சேவையில் அமைப்புகளை புதுப்பித்தல்

# kibibyte_per_second
source: KiB/s
ta: கிப் / கள்

# snowflake_proxy_client_connected_msg
source: %1$s Kindness Mode helped someone circumvent censorship %2$s
ta: %1$s கருணை முறை தணிக்கை %2$s ஐத் தவிர்க்க உதவியது

# log_notice_unable_to_update_onions
source: unable to upload onion names
ta: வெங்காய பெயர்களைப் பதிவேற்ற முடியவில்லை

# log_notice_updating_torrc
source: Updating torrc custom configuration…
ta: டோர்க் தனிப்பயன் உள்ளமைவைப் புதுப்பித்தல்…

# log_notice_connected_to_tor_control_port
source: Connected to tor control port
ta: TOR கட்டுப்பாட்டு துறைமுகத்துடன் இணைக்கப்பட்டுள்ளது
