Repository: 247i/TACETr
Catalog: உரை/தானி/guardianproject-encirculo-website-2021-*.po
Languages: ta

# text_direction
source: ltr
ta: எல்.டி.ஆர்

# more_locales
source: More translations
ta: மேலும் மொழிபெயர்ப்புகள்

# locale_name
source: English
ta: ஆங்கிலம்

# menu
source: Open menu
ta: திறந்த பட்டியல்

# locale_current
source: (current language)
ta: (தற்போதைய மொழி)

# locale_available
source: Available languages
ta: கிடைக்கும் மொழிகள்

# website_name
source: Círculo
ta: வட்டம்

# website_headline_1
source: Safety starts with community
ta: பாதுகாப்பு சமூகத்துடன் தொடங்குகிறது

# website_headline_2
source: Círculo helps connect you to a reliable network of six peers. Establish protocols, send alerts and keep those in your circle informed.
ta: ஆறு சகாக்களின் நம்பகமான நெட்வொர்க்குடன் உங்களை இணைக்க Círculo உதவுகிறது. நெறிமுறைகளை நிறுவுங்கள், விழிப்பூட்டல்களை அனுப்பவும், உங்கள் வட்டத்தில் உள்ளவர்களுக்கு செய்தி தெரிவிக்கவும்.

# website_headline_image_1
source: assets/images/en/our_circle.svg
ta: சொத்துக்கள்/படங்கள்/en/எங்கள்_சர்கில்.ச்விசி

# website_headline_image_2
source: assets/images/en/home.svg
ta: சொத்துக்கள்/படங்கள்/en/home.svg

# how_it_works_headline
source: How it works
ta: இது எவ்வாறு இயங்குகிறது

# how_it_works_card_1_headline
source: Decide who will be in your circle
ta: உங்கள் வட்டத்தில் யார் இருப்பார்கள் என்பதை முடிவு செய்யுங்கள்

# how_it_works_card_1_content
source: A circle is made up of 6 trusted peers who collectively agree to support one another.
ta: ஒரு வட்டம் 6 நம்பகமான சகாக்களால் ஆனது, அவர்கள் ஒருவருக்கொருவர் ஆதரவளிக்க கூட்டாக ஒப்புக்கொள்கிறார்கள்.

# how_it_works_card_2_headline
source: Identify your safety protocols
ta: உங்கள் பாதுகாப்பு நெறிமுறைகளை அடையாளம் காணவும்

# how_it_works_card_2_content
source: Proper safety protocols can make a difference. Establish ones that make sense for your circle. Article 19 can help.
ta: சரியான பாதுகாப்பு நெறிமுறைகள் ஒரு வித்தியாசத்தை ஏற்படுத்தும். உங்கள் வட்டத்திற்கு அர்த்தமுள்ளவற்றை நிறுவுங்கள். கட்டுரை 19 உதவலாம்.

# how_it_works_card_2_call_to_action
source: Visit Seguridad Integral
ta: விரிவான பாதுகாப்பைப் பார்வையிடவும்

# how_it_works_card_3_headline
source: Form a social agreement
ta: ஒரு சமூக ஒப்பந்தத்தை உருவாக்குங்கள்

# how_it_works_card_3_content
source: Talk with your circle about what you need from each other. The ‘Find me on Circulo’ game is designed to aid this discussion.
ta: ஒருவருக்கொருவர் உங்களுக்குத் தேவையானதைப் பற்றி உங்கள் வட்டத்துடன் பேசுங்கள். இந்த விவாதத்திற்கு உதவ ‘என்னைக் கண்டுபிடி” விளையாட்டு வடிவமைக்கப்பட்டுள்ளது.

# how_it_works_card_3_call_to_action
source: Get the game
ta: விளையாட்டைப் பெறுங்கள்

# how_it_works_card_3_call_to_action_url
source: assets/documents/Find_Me_On_Circulo_Game-ENGLISH_v1.pdf
ta: சொத்துக்கள்/ஆவணங்கள்/find_me_on_circulo_game-english_v1.pdf

# how_it_works_card_4_headline
source: Use Círculo to stay connected
ta: இணைந்திருக்க Círculo ஐப் பயன்படுத்தவும்

# how_it_works_card_4_content
source: To get started, download the circulo app and create an invite link for your circle.
ta: தொடங்குவதற்கு, சர்க்லோ பயன்பாட்டைப் பதிவிறக்கி, உங்கள் வட்டத்திற்கான அழைப்பிதழ் இணைப்பை உருவாக்கவும்.

# website_intro
source: Círculo is a safe digital space for when journalists, activists and human rights defenders feel unsafe. It offers a secure form of communication for people to lean on their networks and communities when they face and challenge harassment and violence. This tool was created as an effort by the Guardian Project and ARTICLE 19, based on the experience, needs and concerns of women who occupy a central role in society by working in the journalistic activity, social initiatives and mobilizations for the defense of human rights. At the heart of the app is wellness, ensuring that each journalist, activist and human rights defender is supported by a self-chosen community. This can help to mitigate burnout and trauma and consequently self-censorship in what are high-risk fields of work.
ta: பத்திரிகையாளர்கள், ஆர்வலர்கள் மற்றும் மனித உரிமைகள் பாதுகாவலர்கள் பாதுகாப்பற்றதாக உணரும்போது, ​​Cí rculo ஒரு பாதுகாப்பான டிசிட்டல் இடமாகும். துன்புறுத்தல் மற்றும் வன்முறையை எதிர்கொள்ளும்போது மக்கள் தங்கள் நெட்வொர்க்குகள் மற்றும் சமூகங்கள் மீது சாய்வதற்கு இது ஒரு பாதுகாப்பான தகவல்தொடர்புகளை வழங்குகிறது. இந்த கருவி கார்டியன் திட்டம் மற்றும் பிரிவு 19 ஆகியோரின் முயற்சியாக உருவாக்கப்பட்டது, இது மனித உரிமைகளைப் பாதுகாப்பதற்கான செய்தித் தாள் செயல்பாடு, சமூக முன்முயற்சிகள் மற்றும் அணிதிரட்டல் ஆகியவற்றில் பணியாற்றுவதன் மூலம் சமூகத்தில் முக்கிய பங்கை ஆக்கிரமிக்கும் பெண்களின் பட்டறிவு, தேவைகள் மற்றும் கவலைகள் ஆகியவற்றின் அடிப்படையில். பயன்பாட்டின் மையத்தில் ஆரோக்கியமானது, ஒவ்வொரு பத்திரிகையாளர், ஆர்வலர் மற்றும் மனித உரிமைகள் பாதுகாவலரும் ஒரு சுய-தேர்ந்தெடுக்கப்பட்ட சமூகத்தால் ஆதரிக்கப்படுவதை உறுதிசெய்கிறது. இது எரித்தல் மற்றும் அதிர்ச்சியைத் தணிக்க உதவும், இதன் விளைவாக அதிக ஆபத்துள்ள வேலைகளில் தன்வய தணிக்கை செய்ய உதவும்.

# what_you_can_do_headline
source: What you can do with the app
ta: பயன்பாட்டுடன் நீங்கள் என்ன செய்ய முடியும்

# ask_for_help_headline
source: Ask for help
ta: உதவி கேட்க

# ask_for_help_content
source: Send alerts to those you trust in times of need both big and small. Círculo is a protected place to share with your circle.
ta: பெரிய மற்றும் சிறிய தேவைப்படும் காலங்களில் நீங்கள் நம்புபவர்களுக்கு விழிப்பூட்டல்களை அனுப்புங்கள். உங்கள் வட்டத்துடன் பகிர்ந்து கொள்ள Círculo ஒரு பாதுகாக்கப்பட்ட இடம்.

# ask_for_help_image
source: assets/images/en/status.svg
ta: சொத்துக்கள்/படங்கள்/en/status.svg

# share_location_headline
source: Give secure location updates while traveling.
ta: பயணம் செய்யும் போது பாதுகாப்பான இருப்பிட புதுப்பிப்புகளைக் கொடுங்கள்.

# share_location_content
source: When you share your location on Círculo, it’s encrypted and sent only to your circle. The app does not track, expose or use your location.
ta: உங்கள் இருப்பிடத்தை Círculo இல் பகிரும்போது, ​​அது குறியாக்கம் செய்யப்பட்டு உங்கள் வட்டத்திற்கு மட்டுமே அனுப்பப்படும். பயன்பாடு உங்கள் இருப்பிடத்தைக் கண்காணிக்கவோ, அம்பலப்படுத்தவோ அல்லது பயன்படுத்தவோ இல்லை.

# share_location_notification
source: assets/images/en/location.svg
ta: சொத்துக்கள்/படங்கள்/en/location.svg

# stay_informed_headline
source: Stay informed
ta: தகவலறிந்திருங்கள்

# stay_informed_content
source: Círculo brings priority to the situations that need your attention most.
ta: உங்கள் கவனத்தை அதிகம் தேவைப்படும் சூழ்நிலைகளுக்கு Cí rculo முன்னுரிமையைக் கொண்டுவருகிறது.

# stay_informed_notification_1_image
source: assets/images/en/mariel.svg
ta: சொத்துக்கள்/படங்கள்/en/mareyel.svg

# stay_informed_notification_2_image
source: assets/images/en/ana.svg
ta: சொத்துக்கள்/படங்கள்/en/ana.svg

# stay_informed_notification_3_image
source: assets/images/en/marta.svg
ta: சொத்துக்கள்/படங்கள்/en/marda.svg

# developers_headline
source: Developed with Care
ta: கவனத்துடன் உருவாக்கப்பட்டது

# developers_content
source: Círculo was built through a partnership with leading organizations concerned with human rights, digital privacy and physical safety.
ta: மனித உரிமைகள், டிசிட்டல் தனியுரிமை மற்றும் உடல் பாதுகாப்பு ஆகியவற்றுடன் தொடர்புடைய முன்னணி அமைப்புகளுடன் கூட்டாண்மை மூலம் Circulo கட்டப்பட்டது.

# developer_video_1_url
source: assets/videos/this_is_circulo_1080p.mp4
ta: சொத்துக்கள்/வீடியோக்கள்/this_is_circulo_1080p.mp4

# developer_video_1_image
source: assets/images/this_is_circulo.png
ta: சொத்துக்கள்/படங்கள்/this_is_circulo.png

# developer_video_1_title
source: Why We Made It
ta: நாங்கள் அதை ஏன் செய்தோம்

# developer_video_2_url
source: assets/videos/how_circulo_works_1080p.mp4
ta: சொத்துக்கள்/வீடியோக்கள்/how_circulo_works_1080p.mp4

# developer_video_2_image
source: assets/images/how_it_works.png
ta: சொத்துக்கள்/படங்கள்/how_it_works.png

# developer_video_2_title
source: How It Works
ta: இது எவ்வாறு இயங்குகிறது

# features_card_1_headline
source: No email or phone number
ta: மின்னஞ்சல் அல்லது தொலைபேசி எண் இல்லை

# features_card_2_headline
source: Encrypted conversations
ta: மறைகுறியாக்கப்பட்ட உரையாடல்கள்

# features_card_3_headline
source: Lock & disguise features
ta: பூட்டு மற்றும் மாறுவேடங்கள் நற்பொருத்தங்கள்

# features_card_4_headline
source: No histories stored
ta: வரலாறுகள் சேமிக்கப்படவில்லை

# disclaimer_content
source: Please note: The app in itself does not provide emergency response. It simply helps you inform people and indicate what you need. An internet connection is required to send and receive messages.
ta: தயவுசெய்து கவனிக்கவும்: பயன்பாடு அவசரகால பதிலை வழங்காது. இது மக்களுக்கு தெரிவிக்கவும் உங்களுக்குத் தேவையானதைக் குறிக்கவும் உதவுகிறது. செய்திகளை அனுப்பவும் பெறவும் இணைய இணைப்பு தேவை.

# call_to_action_headline
source: Check out our community resources
ta: எங்கள் சமூக வளங்களைப் பாருங்கள்

# call_to_action_content
source: View Resources
ta: வளங்களைக் காண்க

# footer_learn_more_headline
source: Learn More
ta: மேலும் அறிக

# footer_learn_more_list_1_content
source: Guardian Project (Developer)
ta: கார்டியன் திட்டம் (டெவலப்பர்)

# footer_learn_more_list_2_content
source: Article 19 (Partner)
ta: கட்டுரை 19 (கூட்டாளர்)

# footer_learn_more_list_3_content
source: Community Resources
ta: சமூக வளங்கள்

# footer_learn_more_list_3_url
source: community-resources/
ta: சமூக வளங்கள்/

# footer_free_software_headline
source: Free Software
ta: இலவச மென்பொருள்

# footer_free_software_content
source: This app is free and open-source software. Learn more and help us build at <https://gitlab.com/circuloapp>.
ta: இந்த பயன்பாடு இலவச மற்றும் திறந்த மூல மென்பொருள். மேலும் அறிக மற்றும் <https://gitlab.com/circuloapp> இல் உருவாக்க எங்களுக்கு உதவுங்கள்.

# copyright
source: Copyright ©2021 All rights reserved
ta: பதிப்புரிமை © 2021 அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை

# community_resources_headline
source: Community Resources
ta: சமூக வளங்கள்

# community_resources_content
source: If you want to deploy Círculo with your community, here are some resources to help you.
ta: உங்கள் சமூகத்துடன் Circulo ஐ வரிசைப்படுத்த விரும்பினால், உங்களுக்கு உதவ சில ஆதாரங்கள் இங்கே.

# community_resources_permalink
source: community-resources/
ta: சமூக வளங்கள்/

# community_resources_list_1_tagline
source: Seguridad Integral
ta: விரிவான பாதுகாப்பு

# community_resources_list_1_headline
source: Explore Physical Safety Protocols
ta: உடல் பாதுகாப்பு நெறிமுறைகளை ஆராயுங்கள்

# community_resources_list_1_content
source: Explore 'Integral Security for Journalists' of ARTICLE 19, Office for Mexico and Central America, where you can find tools on physical security, digital security, regulations, right to information, among other topics, that can help journalists and human rights defenders to reduce the risks related to their work.
ta: 'பத்திரிகையாளர்களுக்கான ஒருங்கிணைந்த பாதுகாப்பை' கட்டுரை 19, மெக்சிகோ மற்றும் நடு அமெரிக்காவிற்கான அலுவலகம், உடல் பாதுகாப்பு, டிசிட்டல் பாதுகாப்பு, விதிமுறைகள், செய்தி உரிமை, பிற தலைப்புகளில், பத்திரிகையாளர்கள் மற்றும் மனித உரிமை பாதுகாவலர்கள் குறித்த கருவிகளை நீங்கள் காணலாம் அவர்களின் வேலை தொடர்பான அபாயங்கள்.

# community_resources_list_1_call_to_action_1_content
source: Visit Seguridad Integral
ta: விரிவான பாதுகாப்பைப் பார்வையிடவும்

# community_resources_list_1_image
source: assets/images/seguridad_integral.png
ta: சொத்துக்கள்/படங்கள்/segurity_integral.png

# community_resources_list_2_tagline
source: Find me on Círculo: The Game
ta: Circulo இல் என்னைக் கண்டுபிடி: விளையாட்டு

# community_resources_list_2_headline
source: Establish social commitments
ta: சமூக கடமைகளை நிறுவுதல்

# community_resources_list_2_content
source: 'Find me on Circulo' is a role playing game that guides players through situations where emotional support, physical assistance or simply solidarity is needed. The objective of the game is to realize the commitment made when joining a circle on Círculo.
ta: 'என்னை கண்டுபிடி ஆன் சர்க்குலோ' என்பது ஒரு பங்கு விளையாடும் விளையாட்டாகும், இது உணர்ச்சி உதவி, உடல் உதவி அல்லது வெறுமனே ஒற்றுமை தேவைப்படும் சூழ்நிலைகளில் வீரர்களை வழிநடத்துகிறது. கோர்குலோவில் ஒரு வட்டத்தில் சேரும்போது செய்யப்பட்ட உறுதிப்பாட்டை உணர்ந்து கொள்வதே விளையாட்டின் நோக்கம்.

# community_resources_list_2_call_to_action_1_content
source: DOWNLOAD MATERIALS
ta: பொருட்களைப் பதிவிறக்கவும்

# community_resources_list_2_call_to_action_1_help
source: In English
ta: ஆங்கிலத்தில்

# community_resources_list_2_call_to_action_1_url
source: assets/documents/Find_Me_On_Circulo_Game-ENGLISH_v1.pdf
ta: சொத்துக்கள்/ஆவணங்கள்/find_me_on_circulo_game-english_v1.pdf

# community_resources_list_2_call_to_action_2_content
source: DOWNLOAD MATERIALS
ta: பொருட்களைப் பதிவிறக்கவும்

# community_resources_list_2_call_to_action_2_help
source: In Spanish
ta: ச்பானிச் மொழியில்

# community_resources_list_2_call_to_action_2_url
source: assets/documents/Find_Me_On_Circulo_Game-SPANISH_v1.pdf
ta: சொத்துக்கள்/ஆவணங்கள்/find_me_on_circulo_game-panish_v1.pdf

# community_resources_list_2_image
source: assets/images/game.png
ta: சொத்துக்கள்/படங்கள்/came.png

# community_resources_list_3_tagline
source: Background Research
ta: பின்னணி ஆராய்ச்சி

# community_resources_list_3_headline
source: Support proposal for women journalists
ta: பெண்கள் பத்திரிகையாளர்களுக்கான உதவி திட்டம்

# community_resources_list_3_content
source: This document offers a review of violence against women journalists in Mexico, Guatemala and Honduras, mapping the characteristics of the journalistic exercise and the exercise of gender among one territory and another. Based on the above, it is identified that hostile scenarios will continue to be a constant in the professional practice of women journalists until the necessary structural changes are implemented to reduce violence against the press and violence against women. However, in the spirit of contributing in the short term to the feeling of security of women journalists and aiming for them to continue with their important work, Guardian Project and ARTICLE 19 present Círculo.
ta: இந்த ஆவணம் மெக்சிகோ, குவாத்தமாலா மற்றும் ஓண்டுராசில் உள்ள பெண்கள் பத்திரிகையாளர்களுக்கு எதிரான வன்முறையை மறுஆய்வு செய்கிறது, பத்திரிகைப் பயிற்சியின் சிறப்பியல்புகளையும் ஒரு பிரதேசத்திலும் மற்றொரு பிரதேசத்திலும் பாலினத்தைப் பயன்படுத்துவதையும் வரைபடமாக்குகிறது. மேற்கூறியவற்றின் அடிப்படையில், பெண்கள் பத்திரிகையாளர்களின் தொழில்முறை நடைமுறையில் விரோதமான காட்சிகள் தொடர்ந்து ஒரு நிலையானதாக இருக்கும் என்று அடையாளம் காணப்பட்டுள்ளது, இது பத்திரிகைகளுக்கு எதிரான வன்முறைகளையும் பெண்களுக்கு எதிரான வன்முறையையும் குறைக்க தேவையான கட்டமைப்பு மாற்றங்கள் செயல்படுத்தப்படும் வரை. எவ்வாறாயினும், பெண்கள் பத்திரிகையாளர்களின் பாதுகாப்பு உணர்வுக்கு குறுகிய காலத்தில் பங்களிக்கும் மனப்பான்மையாகவும், அவர்களின் முக்கியமான படைப்புகள், கார்டியன் திட்டம் மற்றும் 19 வது பிரிவு தற்போதைய கோர்குலோவைத் தொடர வேண்டும் என்ற நோக்கத்தில்.

# community_resources_list_3_call_to_action_1_content
source: DOWNLOAD PAPER
ta: காகிதத்தைப் பதிவிறக்கவும்

# community_resources_list_3_call_to_action_1_help
source: In English
ta: ஆங்கிலத்தில்

# community_resources_list_3_call_to_action_1_url
source: assets/docs/A19CirculoReport2021_en.pdf
ta: இருக்கைகள்/டாக்ச்/A19circus

# community_resources_list_3_call_to_action_2_content
source: DOWNLOAD PAPER
ta: காகிதத்தைப் பதிவிறக்கவும்

# community_resources_list_3_call_to_action_2_help
source: In Spanish
ta: ச்பானிச் மொழியில்

# community_resources_list_3_call_to_action_2_url
source: assets/docs/A19CirculoReport2021_es.pdf
ta: சொத்துக்கள்/டாக்ச்/A19circuloreport2021_es.pdf

# community_resources_list_3_image
source: assets/images/map.png
ta: சொத்துக்கள்/படங்கள்/map.png

# community_resources_license_content
source: These works are licensed under a Creative Commons Attribution-ShareAlike 4.0 International License.
ta: இந்த படைப்புகள் ஒரு கிரியேட்டிவ் காமன்ச் பண்புக்கூறு-சேர்அலைக் 4.0 பன்னாட்டு உரிமத்தின் கீழ் உரிமம் பெற்றுள்ளன.

# community_resources_license_image
source: assets/images/cc_by_sa.png
ta: சொத்துக்கள்/படங்கள்/cc_by_sa.png

# community_resources_call_to_action_headline
source: Need help?
ta: உதவி தேவையா?

# community_resources_call_to_action_content
source: If you have questions or feedback, get in touch with the support team at Guardian Project.
ta: உங்களிடம் கேள்விகள் அல்லது பின்னூட்டங்கள் இருந்தால், கார்டியன் திட்டத்தில் உதவி குழுவுடன் தொடர்பு கொள்ளுங்கள்.

# community_resources_call_to_action
source: Send an Email
ta: மின்னஞ்சல் அனுப்புங்கள்

# community_resources_call_to_action_url
source: mailto:support@guardianproject.info
ta: mailto: support@goardianproject.info

# invitation_headline
source: You've been invited to a circle.
ta: நீங்கள் ஒரு வட்டத்திற்கு அழைக்கப்பட்டுள்ளீர்கள்.

# invitation_content
source: Install the Círculo app, then tap your invite link again to join.
ta: Círculo பயன்பாட்டை நிறுவவும், பின்னர் சேர உங்கள் அழைப்பிதழ் இணைப்பைத் தட்டவும்.

# invitation_call_to_action
source: Explore Círculo &#8594;
ta: வட்டத்தை ஆராயுங்கள் &#8594;

# invitation_more_options
source: More Download Options &#9660;
ta: மேலும் பதிவிறக்க விருப்பங்கள் &#9660;

# invitation_less_options
source: Less Options &#9650;
ta: குறைந்த விருப்பங்கள் &#9650;

# direct_download_content
source: Direct Download
ta: நேரடி பதிவிறக்க

# direct_download_help
source: Android APK
ta: ஆண்ட்ராய்டு APK

# ana_title
source: Ana
ta: குகை

# ana_status
source: Uncertain
ta: நிச்சயமற்றது

# ana_location
source: 1 new location
ta: 1 புதிய இடம்

# ana_time
source: Just now
ta: இப்போது
