Repository: 247i/TACETr
Catalog: உரை/தானி/guardianproject-circulo-ios-*.po
Languages: ta

source: (You)
ta: (நீங்கள்)

source: Your history will be available to your circle until you delete it.
ta: உங்கள் வட்டத்தை நீக்கும் வரை உங்கள் வரலாறு உங்கள் வட்டத்திற்கு கிடைக்கும்.

source: % Frequency of location sharing
ta: இருப்பிட பகிர்வின் % அதிர்வெண்

source: % How long a status is active
ta: ஒரு நிலை எவ்வளவு காலம் செயலில் உள்ளது

source: % If messages are sent offline
ta: செய்திகள் ஆஃப்லைனில் அனுப்பப்பட்டால்

source: % Response time
ta: % மறுமொழி நேரம்

source: % Untrusted New Devices for %
ta: % நம்பத்தகாத புதிய சாதனங்கள் %

source: % Use of conditions (safe, uncertain, etc)
ta: நிபந்தனைகளின் % பயன்பாடு (பாதுகாப்பான, நிச்சயமற்ற, முதலியன)

source: % changed avatar
ta: % மாற்றப்பட்ட அவதாரம்

source: % changed display name to '%'
ta: காட்சி பெயரை '%' என்று மாற்றியது

source: % changed the room name to "%"
ta: % அறை பெயரை "%" என்று மாற்றியது

source: % changed the room topic to "%"
ta: % அறை தலைப்பை "%" என்று மாற்றியது

source: % has unknown devices
ta: % அறியப்படாத சாதனங்கள் உள்ளன

source: % is now a trusted device.
ta: % இப்போது நம்பகமான சாதனம்.

source: % is typing
ta: % தட்டச்சு செய்கிறது

source: % joined the room
ta: % அறையில் சேர்ந்தார்

source: % joined your circle
ta: % உங்கள் வட்டத்தில் சேர்ந்தது

source: % keys were found, % where imported!
ta: % விசைகள் கண்டுபிடிக்கப்பட்டன, % இறக்குமதி செய்யப்பட்ட இடத்தில்!

source: % left
ta: % இடது

source: % left the room
ta: % அறையை விட்டு வெளியேறினார்

source: % logged into your account. Please confirm it was you.
ta: % உங்கள் கணக்கில் உள்நுழைந்துள்ளது. தயவுசெய்து நீங்கள் இருந்ததை உறுதிப்படுத்தவும்.

source: % of % is now a trusted device.
ta: % இப்போது நம்பகமான சாதனம்.

source: % people are typing
ta: % மக்கள் தட்டச்சு செய்கிறார்கள்

source: % people changed their avatars
ta: % மக்கள் தங்கள் அவதாரங்களை மாற்றினர்

source: % people changed their display name
ta: % மக்கள் தங்கள் காட்சி பெயரை மாற்றினர்

source: % people have seen this alert. Tap the button to let % know you've seen it.
ta: இந்த எச்சரிக்கையை மக்கள் பார்த்திருக்கிறார்கள். நீங்கள் பார்த்தீர்கள் என்று % தெரியப்படுத்த பொத்தானைத் தட்டவும்.

source: % people have unknown devices
ta: % மக்கள் அறியப்படாத சாதனங்களைக் கொண்டுள்ளனர்

source: % people joined the room
ta: % மக்கள் அறையில் சேர்ந்தனர்

source: % people left the room
ta: % மக்கள் அறையை விட்டு வெளியேறினர்

source: % people were invited
ta: % மக்கள் அழைக்கப்பட்டனர்

source: % sees you. We have confirmation that your alert was viewed.
ta: % உங்களைப் பார்க்கிறார். உங்கள் எச்சரிக்கை பார்க்கப்பட்டது என்பதை நாங்கள் உறுதிப்படுத்தியுள்ளோம்.

source: % users have % unknown devices
ta: % பயனர்களுக்கு % அறியப்படாத சாதனங்கள் உள்ளன

source: % wants to chat.
ta: % அரட்டை அடிக்க விரும்புகிறது.

source: % wants to verify
ta: % சரிபார்க்க விரும்புகிறது

source: % was added to your friends list!
ta: உங்கள் நண்பர்கள் பட்டியலில் % சேர்க்கப்பட்டது!

source: % was invited
ta: % அழைக்கப்பட்டது

source: (edited)
ta: (திருத்தப்பட்டது)

source: 1 Year
ta: 1 வருடம்

source: 1 hour
ta: 1 மணி நேரம்

source: 1 hr
ta: 1 மணி

source: 1 user has % unknown devices
ta: 1 பயனருக்கு % அறியப்படாத சாதனங்கள் உள்ளன

source: 1 user has an unknown device
ta: 1 பயனருக்கு தெரியாத சாதனம் உள்ளது

source: 15 min
ta: 15 மணித்துளி

source: 15 minutes
ta: 15 நிமிடங்கள்

source: 1699 Ontario Dr, Sunnyvale CA 94087, United States
ta: 1699 ஒன்ராறியோ டி.ஆர், சன்னிவேல் சி.ஏ 94087, அமெரிக்கா

source: 2 min ago
ta: 2 மணித்துளி முன்பு

source: 4 hours
ta: 4 மணி நேரம்

source: 4 hrs
ta: 4 மணி

source: 8 hours
ta: 8 மணி நேரம்

source: 8 hrs
ta: 8 மணி

source: A circle is made up of 6 people who agree to support each other.
ta: ஒருவருக்கொருவர் ஆதரவளிக்க ஒப்புக் கொள்ளும் 6 பேரால் ஒரு வட்டம் ஆனது.

source: A mobile phone number must have at least 4 digits.
ta: மொபைல் தொலைபேசி எண்ணில் குறைந்தது 4 இலக்கங்கள் இருக்க வேண்டும்.

source: A safe place to connect with a small group of people
ta: ஒரு சிறிய குழுவினருடன் இணைக்க ஒரு பாதுகாப்பான இடம்

source: ATTENTION: This is non-reversible! You will never again be able to log in, re-register or reactivate that account!
ta: கவனம்: இது மாற்ற முடியாதது! அந்தக் கணக்கை நீங்கள் மீண்டும் உள்நுழையவோ, மீண்டும் பதிவு செய்யவோ அல்லது மீண்டும் செயல்படுத்தவோ முடியாது!

source: About
ta: பற்றி

source: Accept
ta: ஏற்றுக்கொள்

source: Access Denied
ta: அணுகல் மறுக்கப்பட்டது

source: Access Restricted
ta: அணுகல் தடைசெய்யப்பட்டுள்ளது

source: Account
ta: கணக்கு

source: Active
ta: செயலில்

source: Add
ta: கூட்டு

source: Add Account
ta: கணக்கைச் சேர்க்கவும்

source: Add Friend
ta: நண்பரைச் சேர்க்கவும்

source: Add Friends
ta: நண்பர்களைச் சேர்க்கவும்

source: Add Group Code
ta: குழு குறியீட்டைச் சேர்க்கவும்

source: Add friends
ta: நண்பர்களைச் சேர்க்கவும்

source: Admin only
ta: நிர்வாகி மட்டும்

source: Alert Active
ta: செயலில் எச்சரிக்கை

source: Alert Preferences
ta: எச்சரிக்கை விருப்பத்தேர்வுகள்

source: Alert from %
ta: % இலிருந்து எச்சரிக்கை

source: Alert from %! Open % to see.
ta: %இலிருந்து எச்சரிக்கை! பார்க்க திறந்த %.

source: Alert from Maria
ta: மரியாவிடமிருந்து எச்சரிக்கை

source: Allow "%" to also use your location when the app is running in the background?
ta: பயன்பாடு பின்னணியில் இயங்கும்போது உங்கள் இருப்பிடத்தைப் பயன்படுத்த "%" ஐ அனுமதிக்கவா?

source: Allow access to microphone
ta: மைக்ரோஃபோனுக்கான அணுகலை அனுமதிக்கவும்

source: An SMS was sent to the given number. Enter the received validation code in the below field and press "Continue".
ta: கொடுக்கப்பட்ட எண்ணுக்கு ஒரு எச்எம்எச் அனுப்பப்பட்டது. கீழேயுள்ள புலத்தில் பெறப்பட்ட சரிபார்ப்புக் குறியீட்டை உள்ளிட்டு "தொடரவும்" என்பதை அழுத்தவும்.

source: An e-mail was sent to the given address. Please follow the instructions in it and return here, when completed, to press "Continue".
ta: கொடுக்கப்பட்ட முகவரிக்கு ஒரு மின்னஞ்சல் அனுப்பப்பட்டது. தயவுசெய்து அதில் உள்ள வழிமுறைகளைப் பின்பற்றி, "தொடரவும்" என்பதை அழுத்தவும் இங்கே திரும்பவும்.

source: An unknown error happened.
ta: அறியப்படாத பிழை நடந்தது.

source: Any name
ta: எந்த பெயர்

source: Anyone with a link can join
ta: இணைப்பு உள்ள எவரும் சேரலாம்

source: Anyone with the link can join. Once everyone is here disable the link.
ta: இணைப்பு உள்ள எவரும் சேரலாம். எல்லோரும் இங்கே வந்தவுடன் இணைப்பை முடக்கவும்.

source: Anytime there’s a new message
ta: எப்போது வேண்டுமானாலும் ஒரு புதிய செய்தி இருக்கும்

source: Archive
ta: காப்பகம்

source: Are you sure you want to delete % from your account?
ta: உங்கள் கணக்கிலிருந்து % ஐ நீக்க விரும்புகிறீர்களா?

source: Are you sure you want to delete the current circle?
ta: தற்போதைய வட்டத்தை நீக்க விரும்புகிறீர்களா?

source: Are you sure you want to leave the current circle?
ta: தற்போதைய வட்டத்தை விட்டு வெளியேற விரும்புகிறீர்களா?

# Are you sure you want to log out of the account "%"?\n
source: Are you sure you want to log out of the account "%"?
ta: "%" கணக்கிலிருந்து வெளியேற விரும்புகிறீர்களா?

# Are you sure you want to remove the account "%"?\n
source: Are you sure you want to remove the account "%"?
ta: கணக்கை "%" அகற்ற விரும்புகிறீர்களா?

source: Are you sure you want to stop sharing your location with your circle?
ta: உங்கள் வட்டத்துடன் உங்கள் இருப்பிடத்தைப் பகிர்வதை நிறுத்த விரும்புகிறீர்களா?

source: Audio file
ta: ஆடியோ கோப்பு

source: Available
ta: கிடைக்கிறது

source: Back
ta: பின்

source: Backup Keys
ta: காப்பு விசைகள்

source: Backup Keys to Server
ta: சேவையகத்திற்கு காப்பு விசைகள்

source: Backup Password
ta: காப்புப்பிரதி கடவுச்சொல்

source: CODE ERROR
ta: குறியீடு பிழை

source: CREATE A CIRCLE
ta: ஒரு வட்டத்தை உருவாக்கவும்

source: Cancel
ta: ரத்துசெய்

source: Cancelled
ta: ரத்து செய்யப்பட்டது

source: Cannot delete devices because password-based authentication is not supported by the server.
ta: கடவுச்சொல் அடிப்படையிலான ஏற்பு சேவையகத்தால் ஆதரிக்கப்படாததால் சாதனங்களை நீக்க முடியாது.

source: Cannot find room.
ta: அறை கண்டுபிடிக்க முடியவில்லை.

source: Cannot find thread.
ta: நூலைக் கண்டுபிடிக்க முடியவில்லை.

source: Change Password
ta: கடவுச்சொல்லை மாற்றவும்

source: Change Published Address
ta: வெளியிடப்பட்ட முகவரியை மாற்றவும்

source: Change room name
ta: அறை பெயரை மாற்றவும்

source: Change room topic
ta: அறை தலைப்பை மாற்றவும்

source: Chat with %
ta: % உடன் அரட்டையடிக்கவும்

source: Chats
ta: அரட்டைகள்

source: Choose Friends
ta: நண்பர்களைத் தேர்வுசெய்க

source: Choose Method
ta: முறையைத் தேர்வுசெய்க

source: Choose Password
ta: கடவுச்சொல்லைத் தேர்வுசெய்க

source: Choose a name to use on Círculo.
ta: Circulo இல் பயன்படுத்த ஒரு பெயரைத் தேர்வுசெய்க.

source: Choose per group
ta: ஒரு குழுவிற்கு தேர்வு செய்யவும்

source: Circle Info
ta: வட்ட செய்தி

source: Circle name
ta: வட்ட பெயர்

source: Close Account
ta: கணக்கு மூடு

source: Close Account Forever
ta: எப்போதும் கணக்கை மூடு

source: Close your account on the server.
ta: சேவையகத்தில் உங்கள் கணக்கை மூடு.

source: Closed
ta: மூடப்பட்டது

source: Compare Emoji
ta: ஈமோசியை ஒப்பிடுக

source: Compare this key fingerprint with the key on the other device to complete verification.
ta: சரிபார்ப்பை முடிக்க இந்த விசை கைரேகையை மற்ற சாதனத்தின் விசையுடன் ஒப்பிடுக.

source: Confirm
ta: உறுதிப்படுத்தவும்

source: Confirm the emoji below are displayed on both sessions, in the same order:
ta: கீழே உள்ள ஈமோசிகள் இரண்டு அமர்வுகளிலும் ஒரே வரிசையில் காட்டப்படும் என்பதை உறுதிப்படுத்தவும்:

source: Confirmation Sent
ta: உறுதிப்படுத்தல் அனுப்பப்பட்டது

source: Consent given to measure for % more days.
ta: % அதிக நாட்களுக்கு அளவிட ஒப்புதல் வழங்கப்படுகிறது.

source: Continue
ta: தொடரவும்

source: Contribute Without a Code
ta: குறியீடு இல்லாமல் பங்களிக்கவும்

source: Copy Message
ta: செய்தியை நகலெடுக்கவும்

source: Could not leave the private room with %!
ta: %உடன் தனியார் அறையை விட்டு வெளியேற முடியவில்லை!

source: Create
ta: உருவாக்கு

source: Create Published Address
ta: வெளியிடப்பட்ட முகவரியை உருவாக்கவும்

source: Create a Group
ta: ஒரு குழுவை உருவாக்கவும்

source: Create an Account
ta: ஒரு கணக்கை உருவாக்கவும்

source: Created by %
ta: % ஆல் உருவாக்கப்பட்டது

source: Creating circle... tap to cancel
ta: வட்டத்தை உருவாக்குதல் ... ரத்து செய்ய தட்டவும்

source: Creating room... tap to cancel
ta: அறையை உருவாக்குதல் ... ரத்து செய்ய தட்டவும்

source: Critical Alerts
ta: விமர்சன எச்சரிக்கைகள்

source: Cross signing on this device is not enabled, yet. It's highly recommended to do that, in order to improve your and your peers security! Please provide your account password!
ta: இந்த சாதனத்தில் குறுக்கு கையொப்பம் இயக்கப்படவில்லை, இன்னும். உங்கள் மற்றும் உங்கள் சகாக்களின் பாதுகாப்பை மேம்படுத்துவதற்காக, அதைச் செய்ய மிகவும் பரிந்துரைக்கப்படுகிறது! உங்கள் கணக்கு கடவுச்சொல்லை வழங்கவும்!

source: Círculo needs permission to notify you of new messages!
ta: புதிய செய்திகளை உங்களுக்குத் தெரிவிக்க Cículo க்கு இசைவு தேவை!

source: Círculo was created by the Guardian Project and ARTICLE 19, based on the experience, needs and concerns of women who occupy a central role in society by working in the journalistic activity, social initiatives and mobilizations for the defense of human rights. At the heart of the app is wellness, ensuring that each journalist, activist and human rights defender is supported by a self-chosen community. This can help to mitigate burnout and trauma and consequently self-censorship in what are high-risk fields of work.
ta: மனித உரிமைகளைப் பாதுகாப்பதற்கான செய்தித் தாள் செயல்பாடு, சமூக முன்முயற்சிகள் மற்றும் அணிதிரட்டல்களில் பணியாற்றுவதன் மூலம் சமூகத்தில் முக்கிய பங்கை ஆக்கிரமித்துள்ள பெண்களின் பட்டறிவு, தேவைகள் மற்றும் கவலைகள் ஆகியவற்றின் அடிப்படையில் கார்குலோ கார்டியன் திட்டம் மற்றும் பிரிவு 19 ஆல் உருவாக்கப்பட்டது. பயன்பாட்டின் மையத்தில் ஆரோக்கியமானது, ஒவ்வொரு பத்திரிகையாளர், ஆர்வலர் மற்றும் மனித உரிமைகள் பாதுகாவலரும் ஒரு சுய-தேர்ந்தெடுக்கப்பட்ட சமூகத்தால் ஆதரிக்கப்படுவதை உறுதிசெய்கிறது. இது எரித்தல் மற்றும் அதிர்ச்சியைத் தணிக்க உதவும், இதன் விளைவாக அதிக ஆபத்துள்ள வேலைகளில் தன்வய தணிக்கை செய்ய உதவும்.

source: DELETE ME!
ta: என்னை நீக்கு!

source: Decline
ta: வீழ்ச்சி

source: Delete
ta: நீக்கு

source: Delete Circle
ta: வட்டத்தை நீக்கு

source: Delete History
ta: வரலாற்றை நீக்கு

source: Delete Key Backup
ta: முக்கிய காப்புப்பிரதியை நீக்கு

source: Delete circle?
ta: வட்டத்தை நீக்கவா?

source: Delete linked ID
ta: இணைக்கப்பட்ட ஐடியை நீக்கு

source: Description
ta: விவரம்

source: Details
ta: விவரங்கள்

source: Disable
ta: முடக்கு

source: Disabled
ta: முடக்கப்பட்டது

source: Disabled, because backup on server is untrusted!
ta: முடக்கப்பட்டது, ஏனென்றால் சேவையகத்தின் காப்புப்பிரதி நம்பத்தகாதது!

source: Discover
ta: கண்டுபிடி

source: Display Name
ta: காட்சி பெயர்

source: Done
ta: முடிந்தது

source: Downloading: :percent%
ta: பதிவிறக்கம்:: சதவீதம்%

source: E-Mail
ta: மின்னஞ்சல்

source: EDIT PROFILE
ta: சுயவிவரத்தைத் திருத்து

source: Edit
ta: தொகு

source: Edit Details
ta: விவரங்களைத் திருத்தவும்

source: Edit Name
ta: பெயரைத் திருத்து

source: Edit Profile
ta: சுயவிவரத்தைத் திருத்து

source: Enable
ta: இயக்கு

source: Enable Cross Signing
ta: குறுக்கு கையொப்பத்தை இயக்கவும்

source: Enable Key Backup
ta: முக்கிய காப்புப்பிரதியை இயக்கவும்

source: Enable Push
ta: உந்துதலை இயக்கவும்

source: Enable/Delete Backup
ta: காப்புப்பிரதியை இயக்கவும்/நீக்கவும்

source: Enabled
ta: இயக்கப்பட்டது

source: Encryption
ta: குறியாக்கம்

source: Enter
ta: உள்ளிடவும்

source: Enter group code
ta: குழு குறியீட்டை உள்ளிடவும்

source: Enter your friend's Matrix ID. Yours is %
ta: உங்கள் நண்பரின் மேட்ரிக்ச் ஐடியை உள்ளிடவும். உங்களுடையது %

source: Error
ta: பிழை

source: Error: %
ta: பிழை: %

source: Failed to create circle
ta: வட்டத்தை உருவாக்கத் தவறிவிட்டது

source: Failed to create room
ta: அறையை உருவாக்கத் தவறிவிட்டது

source: Feedback
ta: கருத்து

source: Fetching Location
ta: இருப்பிடத்தைப் பெறுதல்

source: File not found.
ta: கோப்பு கிடைக்கவில்லை.

source: Find your friend on Matrix
ta: மேட்ரிக்சில் உங்கள் நண்பரைக் கண்டறியவும்

source: Fix Push Notifications
ta: புச் அறிவிப்புகளை சரிசெய்யவும்

source: Form Your Circle
ta: உங்கள் வட்டத்தை உருவாக்குங்கள்

source: Form your circle of trust.
ta: உங்கள் நம்பிக்கையின் வட்டத்தை உருவாக்குங்கள்.

source: Forward
ta: முன்னோக்கி

source: Friend Added
ta: நண்பர் மேலும் கூறினார்

source: Friend in Private Room
ta: தனியார் அறையில் நண்பர்

source: Friends
ta: நண்பர்கள்

source: GET STARTED
ta: தொடங்கவும்

source: Gallery
ta: கேலரி

source: Glad you're okay
ta: நீங்கள் நன்றாக இருக்கிறீர்கள் என்பதில் மகிழ்ச்சி

source: Go to Profile
ta: சுயவிவரத்திற்குச் செல்லுங்கள்

source: Got It
ta: கிடைத்தது

source: Hello
ta: வணக்கம்

source: Hello!
ta: வணக்கம்!

source: Hello, %
ta: வணக்கம், %

source: Help improve the app with confidential usage stats.
ta: ரகசிய பயன்பாட்டு புள்ளிவிவரங்களுடன் பயன்பாட்டை மேம்படுத்த உதவுங்கள்.

source: Help us understand how Círculo is used. The study measures 5 things about your usage.
ta: Círculo எவ்வாறு பயன்படுத்தப்படுகிறது என்பதைப் புரிந்துகொள்ள எங்களுக்கு உதவுங்கள். இந்த ஆய்வு உங்கள் பயன்பாட்டைப் பற்றிய 5 விசயங்களை அளவிடுகிறது.

source: Hold to record
ta: பதிவு செய்ய பிடிக்கவும்

source: Home Server
ta: முகப்பு சேவையகம்

source: How long?
ta: எவ்வளவு காலம்?

source: I'm Okay
ta: நான் நன்றாக இருக்கிறேன்

source: Identifier: %
ta: அடையாளங்காட்டி: %

source: Identity Server
ta: அடையாள சேவையகம்

source: If someone sends an alert, you will receive a critical alert. Critical alerts appear on the lock screen and play a sound, even if a focus is on or the iPhone is muted.
ta: யாராவது ஒரு எச்சரிக்கையை அனுப்பினால், நீங்கள் ஒரு முக்கியமான எச்சரிக்கையைப் பெறுவீர்கள். பூட்டுத் திரையில் முக்கியமான எச்சரிக்கைகள் தோன்றி ஒலியை இயக்குகின்றன, கவனம் செலுத்தினாலும் அல்லது ஐபோன் முடக்கப்பட்டிருந்தாலும் கூட.

source: If someone shares their location or sends a message, you will receive a basic notification
ta: யாராவது தங்கள் இருப்பிடத்தைப் பகிர்ந்து கொண்டால் அல்லது ஒரு செய்தியை அனுப்பினால், நீங்கள் ஒரு அடிப்படை அறிவிப்பைப் பெறுவீர்கள்

source: If you don't recognize this device, your messages might be accessed by strangers without your permission.
ta: இந்த சாதனத்தை நீங்கள் அடையாளம் காணவில்லை என்றால், உங்கள் அனுமதியின்றி உங்கள் செய்திகளை அந்நியர்களால் அணுகலாம்.

source: If you have joined a research study, ask the facilitator for your group code.
ta: நீங்கள் ஒரு ஆராய்ச்சி ஆய்வில் சேர்ந்திருந்தால், உங்கள் குழு குறியீட்டிற்கு வசதியாளரிடம் கேளுங்கள்.

source: If you’re getting new message notifications, they will sound like this.
ta: நீங்கள் புதிய செய்தி அறிவிப்புகளைப் பெறுகிறீர்கள் என்றால், அவை இப்படி இருக்கும்.

source: If you’re mentioned, the notification will sound like this.
ta: நீங்கள் குறிப்பிட்டால், அறிவிப்பு இப்படி இருக்கும்.

source: Ignore
ta: புறக்கணிக்கவும்

source: Image file
ta: பட கோப்பு

source: In Settings, tap Location > "Always" and leave the "Precise" option on.
ta: அமைப்புகளில், இருப்பிடம்> "எப்போதும்" என்பதைத் தட்டி, "துல்லியமான" விருப்பத்தை விட்டு விடுங்கள்.

source: In order for your circle to know where you are, % needs access to your location always.
ta: உங்கள் வட்டம் நீங்கள் எங்கிருக்கிறீர்கள் என்பதை அறிய, % எப்போதும் உங்கள் இருப்பிடத்தை அணுக வேண்டும்.

source: Incoming event
ta: உள்வரும் நிகழ்வு

source: Info
ta: தகவல்

source: Internal Error
ta: உள் பிழை

source: Invalid invite link format
ta: தவறான அழைப்பு இணைப்பு வடிவம்

source: Invite Link is Open
ta: அழைப்பு இணைப்பு திறந்திருக்கும்

source: Invite link disabled
ta: இணைப்பு முடக்கப்பட்டதை அழைக்கவும்

source: Invited
ta: அழைக்கப்பட்டார்

source: Is the other device showing the same shield?
ta: மற்ற சாதனம் அதே கவசத்தைக் காட்டுகிறதா?

source: Is this your device?
ta: இது உங்கள் சாதனமா?

source: It doesn’t have to be your real name.
ta: இது உங்கள் உண்மையான பெயராக இருக்க வேண்டியதில்லை.

source: It doesn’t have to be your real name. You can change this anytime.
ta: இது உங்கள் உண்மையான பெயராக இருக்க வேண்டியதில்லை. இதை எப்போது வேண்டுமானாலும் மாற்றலாம்.

source: JOIN A CIRCLE
ta: ஒரு வட்டத்தில் சேரவும்

source: Jailbroken Device Detected
ta: செயில்பிரோகன் சாதனம் கண்டறியப்பட்டது

source: Join
ta: சேர

source: Join Círculo
ta: வட்டத்தில் சேரவும்

source: Join Known Room
ta: அறியப்பட்ட அறையில் சேரவும்

source: Join Status
ta: அந்தச்தில் சேரவும்

source: Join a Circle
ta: ஒரு வட்டத்தில் சேரவும்

source: Join my circle
ta: எனது வட்டத்தில் சேரவும்

source: Join/Knock
ta: சேர/தட்டவும்

source: Keanu needs permission to notify you of new messages!
ta: புதிய செய்திகளை உங்களுக்குத் தெரிவிக்க கீனுவுக்கு இசைவு தேவை!

source: Keep watch! % started sharing location.
ta: கவனித்துக் கொள்ளுங்கள்! % இருப்பிடத்தைப் பகிரத் தொடங்கியது.

source: Key Backup
ta: முக்கிய காப்புப்பிரதி

source: Key Backup Password
ta: முக்கிய காப்புப்பிரதி கடவுச்சொல்

source: Keys Match
ta: விசைகள் பொருந்தும்

source: Kick
ta: கிக்

source: LOGIN
ta: புகுபதிவு

source: Language
ta: மொழி

source: Leave
ta: விடுப்பு

source: Leave circle?
ta: வட்டத்தை விட்டு விடுங்கள்?

source: Leave room?
ta: அறையை விட்டு வெளியேறவா?

source: Leave ´%´ to join new circle
ta: புதிய வட்டத்தில் சேர ´%´ ஐ விடுங்கள்

source: Leave ´%´ to join ´%´?
ta: ´%´ இல் சேர விடுங்கள் ´%´?

source: Leaving room
ta: அறையை விட்டு

source: Link another ID
ta: மற்றொரு ஐடியை இணைக்கவும்

source: Live location off
ta: நேரடி இருப்பிடம் முடக்கப்பட்டுள்ளது

source: Loading attachment... tap to cancel
ta: இணைப்பை ஏற்றுகிறது ... ரத்து செய்ய தட்டவும்

source: Loading messages
ta: செய்திகளை ஏற்றுகிறது

source: Loading story... tap to cancel
ta: கதையை ஏற்றுகிறது ... ரத்து செய்ய தட்டவும்

source: Loading... tap to cancel
ta: ஏற்றுதல் ... ரத்து செய்ய தட்டவும்

source: Location share complete!
ta: இருப்பிட பகிர்வு முடிந்தது!

source: Location was %
ta: இடம் %

source: Location was %@
ta: இடம் %@

source: Log Out
ta: விடுபதிகை

source: Make admin
ta: நிர்வாகி

source: Make moderator
ta: மதிப்பீட்டாளரை உருவாக்குங்கள்

source: Make sure the keys match the latest keys on your devices.
ta: உங்கள் சாதனங்களின் அண்மைக் கால விசைகளுடன் விசைகள் பொருந்துகின்றன என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: Make sure the keys match your friend's latest keys on his or her devices.
ta: உங்கள் நண்பரின் சாதனங்களில் உங்கள் நண்பரின் அண்மைக் கால விசைகளுடன் சாவிகள் பொருந்துகின்றன என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: Me
ta: நான்

source: Me yiuweyr iwueyr iuwey riuweyriuyweqituwy iquewyt iqwuey tiuqweytiuqyweit uq
ta: Me yiuweir iuweir iuweiriuywituwytiyt iquewyt ​​iqueyt iqueytiy tiuqweeti

source: Measurement Study
ta: அளவீட்டு ஆய்வு

source: Members
ta: உறுப்பினர்கள்

source: Mentions
ta: குறிப்பிடுகிறது

source: Mobile Phone
ta: மொபைல் போன்

source: My Location
ta: எனது இருப்பிடம்

source: My sessions
ta: என் அமர்வுகள்

source: NEXT
ta: அடுத்தது

source: Name
ta: பெயர்

source: Name of Your Friend
ta: உங்கள் நண்பரின் பெயர்

source: Name your circle
ta: உங்கள் வட்டத்திற்கு பெயரிடுங்கள்

source: Name: %
ta: பெயர்: %

source: New Log In
ta: புதிய பதிவு

source: New device
ta: புதிய சாதனம்

source: New device logged in
ta: புதிய சாதனம் உள்நுழைந்தது

source: New events
ta: புதிய நிகழ்வுகள்

source: New message notifications
ta: புதிய செய்தி அறிவிப்புகள்

source: Newer version on server!
ta: சேவையகத்தில் புதிய பதிப்பு!

source: No
ta: இல்லை

source: No Devices for %
ta: % க்கு சாதனங்கள் இல்லை

source: No Internet
ta: இணையம் இல்லை

source: No active statuses
ta: செயலில் நிலை இல்லை

source: No attachment found.
ta: எந்த இணைப்பும் கிடைக்கவில்லை.

source: No backup could be found to restore from!
ta: மீட்டமைக்க எந்த காப்புப்பிரதியும் காணப்படவில்லை!

source: No description available
ta: எந்த விளக்கமும் கிடைக்கவில்லை

source: No details available.
ta: விவரங்கள் எதுவும் கிடைக்கவில்லை.

source: No mutually supported verification methods.
ta: இருவழி ஆதரிக்கப்படும் சரிபார்ப்பு முறைகள் இல்லை.

source: No readable file found.
ta: படிக்கக்கூடிய கோப்பு எதுவும் கிடைக்கவில்லை.

source: No reason available.
ta: எந்த காரணமும் கிடைக்கவில்லை.

source: No thanks
ta: நன்றி இல்லை

source: No working session.
ta: வேலை அமர்வு இல்லை.

source: Not now
ta: இப்போது இல்லை

source: Not okay
ta: சரியில்லை

source: Notifications
ta: அறிவிப்புகள்

source: Notifications Disabled
ta: அறிவிப்புகள் முடக்கப்பட்டன

source: Now
ta: இப்போது

source: OK
ta: சரி

source: OR
ta: அல்லது

source: Off
ta: அணை

source: Offline
ta: இணையமில்லாமல்

source: Old Password
ta: பழைய கடவுச்சொல்

source: On
ta: ஆன்

source: Once you join a circle, you’ll see updates and calls for help here.
ta: நீங்கள் ஒரு வட்டத்தில் சேர்ந்தவுடன், உதவிக்கான புதுப்பிப்புகள் மற்றும் அழைப்புகளைப் பார்ப்பீர்கள்.

source: Only if I’m mentioned
ta: நான் குறிப்பிட்டால் மட்டுமே

source: Only people added are in your circle
ta: சேர்க்கப்பட்டவர்கள் மட்டுமே உங்கள் வட்டத்தில் உள்ளனர்

source: Open
ta: திற

source: Open - Anyone with a link can join Closed - Only people added are in your circle
ta: திறந்த - இணைப்பு உள்ள எவரும் சேரலாம் மூடியது - சேர்க்கப்பட்டவர்கள் மட்டுமே உங்கள் வட்டத்தில் உள்ளனர்

source: Open Settings
ta: திறந்த அமைப்புகள்

source: Open in Maps
ta: வரைபடங்களில் திறந்திருக்கும்

source: Open invite link to add people?
ta: மக்களைச் சேர்க்க அழைப்பைத் திறக்கவா?

source: Other
ta: மற்றொன்று

source: Other linked IDs
ta: மற்ற இணைக்கப்பட்ட ஐடிகள்

source: Our Circle
ta: எங்கள் வட்டம்

source: Our secure server remembers your encryption keys for you, so you can view your message history on all of your devices. Your account password is used unless you set a custom one.
ta: எங்கள் பாதுகாப்பான சேவையகம் உங்களுக்காக உங்கள் குறியாக்க விசைகளை நினைவில் கொள்கிறது, எனவே உங்கள் செய்தி வரலாற்றை உங்கள் எல்லா சாதனங்களிலும் காணலாம். நீங்கள் தனிப்பயன் ஒன்றை அமைக்காவிட்டால் உங்கள் கணக்கு கடவுச்சொல் பயன்படுத்தப்படுகிறது.

source: PDF
ta: பி.டி.எஃப்

source: Password
ta: கடவுச்சொல்

source: Password successfully changed!
ta: கடவுச்சொல் வெற்றிகரமாக மாற்றப்பட்டது!

source: Paste a circle link
ta: ஒரு வட்ட இணைப்பை ஒட்டவும்

source: Photo Stream
ta: புகைப்பட ச்ட்ரீம்

source: Pick New Admin(s) Before You Leave
ta: நீங்கள் புறப்படுவதற்கு முன் புதிய நிர்வாகி (களை) தேர்ந்தெடுங்கள்

source: Place the QR code in the center.
ta: QR குறியீட்டை மையத்தில் வைக்கவும்.

source: Play Audio
ta: ஆடியோ விளையாடுங்கள்

source: Please choose another server!
ta: மற்றொரு சேவையகத்தைத் தேர்வுசெய்க!
