Repository: 247i/TACETr
Catalog: உரை/தானி/guardianproject-globalsupportlink-*.po
Languages: ta

source: description: Powered by the People and Ready to Assist!
ta: விளக்கம்: மக்களால் இயக்கப்படுகிறது மற்றும் உதவ தயாராக உள்ளது!

source: Welcome to Your Help Desk
ta: உங்கள் உதவி மேசைக்கு வருக

source: _Ahora disponible en Español / Castellano en_ [_https://ayuda.globalsupport.link/_]{1}
ta: இப்போது ச்பானிச்/ச்பானிச் மொழியில் [_https: //ayuda.globalsupport.link/_] {1}

source: The Help Desk provides **free** resources to people and organizations who are part of the **Powered by the People (PxP)** global network. In addition to the online resources, members of the [Help Desk]{1} can answer questions and provide advice on digital and physical security via chat, messaging or email channels. Depending on your needs, the Help Desk can assist with:
ta: உதவி மேசை ** இலவச ** வளங்களை வழங்குகிறது, மக்கள் மற்றும் அமைப்புகளுக்கு ** மக்கள் (PXP) ** உலகளாவிய பிணையம் மூலம் இயக்கப்படுகிறது. நிகழ்நிலை ஆதாரங்களுக்கு கூடுதலாக, [எல்ப் டெச்க்] {1 of இன் உறுப்பினர்கள் கேள்விகளுக்கு பதிலளிக்கலாம் மற்றும் அரட்டை, செய்தி அனுப்புதல் அல்லது மின்னஞ்சல் சேனல்கள் வழியாக டிசிட்டல் மற்றும் உடல் பாதுகாப்பு குறித்த ஆலோசனைகளை வழங்கலாம். உங்கள் தேவைகளைப் பொறுத்து, உதவி மேசை உதவலாம்:

source: Relocation and evacuation requests
ta: இடமாற்றம் மற்றும் வெளியேற்ற கோரிக்கைகள்

source: In-person workshops and trainings on security & resiliency for civil society organizations
ta: குடிமை சமூக அமைப்புகளுக்கான பாதுகாப்பு மற்றும் பின்னடைவு குறித்த தனிப்பட்ட பட்டறைகள் மற்றும் பயிற்சிகள்

source: Digital security investigations and support
ta: டிசிட்டல் பாதுகாப்பு விசாரணைகள் மற்றும் உதவி

source: Physical security consultations
ta: உடல் பாதுகாப்பு ஆலோசனைகள்

source: Expert support on developing security policies
ta: பாதுகாப்புக் கொள்கைகளை வளர்ப்பதில் வல்லுநர் உதவி

source: Travel security briefings
ta: பயண பாதுகாப்பு விளக்கங்கள்

source: Psychosocial support
ta: உளவியல் சமூக உதவி

source: **Reach out today to discuss with a member of the** [**Help Desk**]{1} to see what is right for you or your organization or click through the resources available online:
ta: ** [** உதவி மேசை **] {1 of இன் உறுப்பினருடன் விவாதிக்க இன்று அணுகவும். உங்களுக்கு அல்லது உங்கள் நிறுவனத்திற்கு எது சரியானது என்பதைக் காண அல்லது ஆன்லைனில் கிடைக்கும் வளங்களைக் சொடுக்கு செய்க:

source: [Digital Security]{1}
ta: [டிசிட்டல் பாதுகாப்பு] {1}

source: [Physical Security]{1}
ta: [உடல் பாதுகாப்பு] {1}

source: [Psychosocial Support]{1}
ta: [உளவியல் சமூக ஆதரவு] {1}

source: This is an evolving resource that will be updated and improved with feedback from all of you!
ta: இது வளர்ந்து வரும் ஒரு வளமாகும், இது உங்கள் அனைவரிடமிருந்தும் கருத்துடன் புதுப்பிக்கப்பட்டு மேம்படுத்தப்படும்!
