Repository: 247i/TACETr
Catalog: உரை/தானி/guardianproject-letsconvene-www-air-*.po
Languages: ta

# hero-section->title
source: Simply Connect
ta: வெறுமனே இணைக்கவும்

# hero-section->text
source: Tired of looking for the messaging app everyone is using? Chat with Convene.
ta: எல்லோரும் பயன்படுத்தும் செய்தியிடல் பயன்பாட்டைத் தேடுவதில் சோர்வாக இருக்கிறதா? கூட்டுடன் அரட்டையடிக்கவும்.

# hero-section->list->[0]
source: No phone numbers
ta: தொலைபேசி எண்கள் இல்லை

# hero-section->list->[1]
source: No account setup
ta: கணக்கு அமைப்பு இல்லை

# hero-section->list->[2]
source: No app
ta: பயன்பாடு இல்லை

# hero-section->image->[1]
source: Banner image
ta: பேனர் படம்

# hero-section->button-text
source: Request Access
ta: அணுகல் கோருங்கள்

# air-section->title
source: Convene Anywhere.
ta: எங்கும் கூடுங்கள்.

# air-section->text
source: ConveneAir edition lets you run our secure chat server directly on your Android phone. It allows your friends to directly connect to a chat room on a local network or through your phone's wifi hotspot. This secure chat service can run anytime, anywhere, even without internet access.<br/><br/> Pop up a (destructible) digital room anywhere offline. No internet connection is required. <ul><li>Requirements: Android phone with Hotspot or Connected to a Local Wifi network</li> <li>Range: 30-50 ft</li> </ul> <br/> No data service is required or used. Just connect to a local wifi network or run a hotspot from your phone, and everyone can connect and share directly, for free.
ta: உங்கள் பாதுகாப்பான அரட்டை சேவையகத்தை உங்கள் ஆண்ட்ராய்டு தொலைபேசியில் நேரடியாக இயக்க Canspeeair பதிப்பு உங்களை அனுமதிக்கிறது. உள்ளக நெட்வொர்க்கில் அல்லது உங்கள் தொலைபேசியின் வைஃபை ஆட்ச்பாட் மூலம் அரட்டை அறையுடன் நேரடியாக இணைக்க இது உங்கள் நண்பர்களை அனுமதிக்கிறது. இந்த பாதுகாப்பான அரட்டை பணி எப்போது வேண்டுமானாலும், எங்கும், இணைய அணுகல் இல்லாமல் கூட இயக்க முடியும். இணைய இணைப்பு தேவையில்லை. இப்போது பயன்படுத்தப்பட்டது. உள்ளக வைஃபை நெட்வொர்க்குடன் இணைக்கவும் அல்லது உங்கள் தொலைபேசியிலிருந்து ஒரு ஆட்ச்பாட்டை இயக்கவும், எல்லோரும் நேரடியாக இணைக்கவும் பகிரவும் முடியும்.

# air-section->button-text
source: Download ConveneAir for Android
ta: ஆண்ட்ராய்டு க்கான கன்வீரைப் பதிவிறக்கவும்

# air-section->image->[1]
source: Banner image
ta: பேனர் படம்

# info-section->title
source: Share directly with anyone.
ta: யாருடனும் நேரடியாகப் பகிரவும்.

# info-section->text
source: ConveneAir lets you run chat rooms from your phone that anyone around you can access from any phone or computer, to share any kind of file, photo, image or sound.
ta: எந்தவொரு தொலைபேசி அல்லது கணினியிலிருந்தும் உங்களைச் சுற்றியுள்ள எவரும் அணுகக்கூடிய, எந்த வகையான கோப்பு, புகைப்படம், படம் அல்லது ஒலியைப் பகிரலாம் என்று உங்கள் தொலைபேசியிலிருந்து அரட்டை அறைகளை இயக்க கன்வேயர் உங்களை அனுமதிக்கிறது.

# info-section->image->[0]
source: /assets/images/convene/convene-video-audio-file-sharing.png
ta: /assets/images/convene/convene-video-audio-file-file-file-file-ping.png

# info-section->image->[1]
source: Banner image
ta: பேனர் படம்

# features-section->title
source: Useful even when times are tough.
ta: நேரம் கடினமாக இருக்கும்போது கூட பயனுள்ளதாக இருக்கும்.

# features-section->text
source: Convene is designed to make connecting simple and resilient in challenging digital environments, even when there is no internet.
ta: இணையம் இல்லாதிருந்தாலும் கூட, டிசிட்டல் சூழல்களை அறைகூவல் செய்வதில் எளிமையான மற்றும் நெகிழ்ச்சியுடன் இணைப்பதற்காக கான்கன் வடிவமைக்கப்பட்டுள்ளது.

# features-section->list->[0]->title
source: Training
ta: பயிற்சி

# features-section->list->[0]->description
source: Gather everyone in one spot at the same time. Share teachings, materials and more. Useful for first-responders and others during a natural disaster or crisis when the internet is not available.
ta: அனைவரையும் ஒரே நேரத்தில் ஒரே இடத்தில் சேகரிக்கவும். பங்கு போதனைகள், பொருட்கள் மற்றும் பல. இணையம் கிடைக்காதபோது இயற்கை பேரழிவு அல்லது நெருக்கடியின் போது முதல் பதிலளிப்பவர்களுக்கும் மற்றவர்களுக்கு பயனுள்ளதாக இருக்கும்.

# features-section->list->[0]->image->[0]
source: assets/images/convene/online-training-low-bandwidth.svg
ta: சொத்துக்கள்/படங்கள்/கான்டென்/ஆன்லைன்-பயிற்சி-குறைந்த-அலைவரிசை

# features-section->list->[0]->image->[1]
source: Feature logo
ta: அம்ச லோகோ

# features-section->list->[1]->title
source: Message Board
ta: செய்தி வாரியம்

# features-section->list->[1]->description
source: Run ConveneAir on a phone with a hotspot in a public place, and people can use it as private, secure message board to share news, photos and more.
ta: ஒரு பொது இடத்தில் ஆட்ச்பாட் கொண்ட தொலைபேசியில் கன்சீயரை இயக்கவும், மேலும் செய்தி, புகைப்படங்கள் மற்றும் பலவற்றைப் பகிர்ந்து கொள்ள மக்கள் இதை தனிப்பட்ட, பாதுகாப்பான செய்தி வாரியமாகப் பயன்படுத்தலாம்.

# features-section->list->[1]->image->[0]
source: assets/images/convene/side-chat-secure-encrypted.svg
ta: சொத்துக்கள்/படங்கள்/கான்டென்/சைட்-அரட்டை-பாதுகாப்பான-மறைகுறியாக்கப்பட்ட.ச்விசி

# features-section->list->[1]->image->[1]
source: Feature logo
ta: அம்ச லோகோ

# features-section->list->[2]->title
source: Data Saver
ta: தரவு சேமிப்பாளர்

# features-section->list->[2]->description
source: ConveneAir is a great way to share large files locally between a small group of people, saving precious data and time.
ta: ஒரு சிறிய குழுவினரிடையே பெரிய கோப்புகளை உள்நாட்டில் பகிர்வதற்கான சிறந்த வழியாகும், விலைமதிப்பற்ற தரவு மற்றும் நேரத்தை மிச்சப்படுத்துகிறது.

# features-section->list->[2]->image->[0]
source: assets/images/convene/back-channel-chat.svg
ta: சொத்துக்கள்/படங்கள்/கான்டென்/பின்-சேனல்-சாட்.ச்விசி

# features-section->list->[2]->image->[1]
source: Feature logo
ta: அம்ச லோகோ

# features-section->list->[3]->title
source: Voice
ta: குரல்

# features-section->list->[3]->description
source: Upload and share audio, recored voice memos and audio files, to easily share stories, testimony, reports and more.
ta: கதைகள், சாட்சியங்கள், அறிக்கைகள் மற்றும் பலவற்றை எளிதாகப் பகிர ஆடியோவை பதிவேற்றி பகிர்ந்து கொள்ளுங்கள்.

# features-section->list->[3]->image->[0]
source: assets/images/convene/voice-chat.svg
ta: சொத்துக்கள்/படங்கள்/கான்டென்/குரல்-அரட்டை

# features-section->list->[3]->image->[1]
source: Feature logo
ta: அம்ச லோகோ

# features-section->image->[0]
source: /assets/images/convene/connect-training-channel-voice.png
ta: /assets/images/convene/connect-training-cannel-voice.png

# features-section->image->[1]
source: Banner image
ta: பேனர் படம்

# features-cta->title
source: You can customize Convene for your organization!
ta: உங்கள் நிறுவனத்திற்கான கூட்டுத் தனிப்பயனாக்கலாம்!

# features-cta->btn-text
source: LEARN MORE
ta: மேலும் அறிக

# footer->title
source: About
ta: பற்றி

# footer->text
source: Convene is powered by the <a href="https://keanu.im">free and open source Keanu Engine</a>. Developed by <a href="https://guardianproject.info">Guardian Project</a> & designed by <a href="https://okthanks.com">Okthanks</a>.
ta: கான்கன் <a href = "https://keanu.im"> இலவச மற்றும் திறந்த மூல கீனு இயந்திரம் </a> ஆல் இயக்கப்படுகிறது. <A href = "https://guardianproject.info"> கார்டியன் திட்டம் </a> ஆல் உருவாக்கப்பட்டது & <a href = "https://okthanks.com"> ஓக்தாங்க்ச் </a>.

# modal->title
source: For your Organization
ta: உங்கள் நிறுவனத்திற்கு

# modal->subtitle
source: We offer customizations of Convene to suit your organization’s needs. For the first year, the fee is $9500 (includes setup fee). After the first year, there is a $300 monthly fee ($3000 if paid annually - two months free). Note that we also have discounts for non-profits.
ta: உங்கள் நிறுவனத்தின் தேவைகளுக்கு ஏற்ப கூட்டத்தின் தனிப்பயனாக்கங்களை நாங்கள் வழங்குகிறோம். முதல் வருடத்திற்கு, கட்டணம் 00 9500 (அமைவு கட்டணம் அடங்கும்). முதல் வருடத்திற்குப் பிறகு, $ 300 மாதாந்திர கட்டணம் (ஆண்டுதோறும் பணம் செலுத்தினால் $ 3000 - இரண்டு மாதங்கள் இலவசம்). இலாப நோக்கற்ற நிறுவனங்களுக்கான தள்ளுபடியும் எங்களிடம் உள்ளது என்பதை நினைவில் கொள்க.

# modal->list-title
source: PAID SERVICE INCLUDES
ta: கட்டண பணி அடங்கும்

# modal->list->[0]
source: Custom branding <br /> <p>Logo, color scheme, hosting under your website domain</p>
ta: தனிப்பயன் பிராண்டிங் <br /> <p> லோகோ, வண்ணத் திட்டம், உங்கள் வலைத்தள களத்தின் கீழ் ஓச்டிங் < /p>

# modal->list->[1]
source: Server setup <br /> <p>Deploy on your cloud server or let us host it. You can select your hosting region.</p>
ta: சேவையக அமைப்பு <br /> <p> உங்கள் முகில் சேவையகத்தில் வரிசைப்படுத்தவும் அல்லது அதை புரவலன் செய்வோம். உங்கள் ஓச்டிங் பகுதியை நீங்கள் தேர்ந்தெடுக்கலாம். </P>

# modal->list->[2]
source: Data retention policy for your organization
ta: உங்கள் நிறுவனத்திற்கான தரவு தக்கவைப்பு கொள்கை

# modal->list->[3]
source: 99.99% uptime Service Level Agreement (SLA) for cloud
ta: கிளவுட்டுக்கான 99.99% அதிக நேர பணி நிலை ஒப்பந்தம் (SLA)

# modal->list->[4]
source: One day business support SLA
ta: ஒரு நாள் வணிக உதவி SLA

# modal->mail-cta
source: **Want to know more?** Contact us at [sales@letsconvene.im](mailto:sales@letsconvene.im).
ta: **Want பெறுநர் know more?** தொடர்பு us at [sales@letsconvene.im](mailto:sales@letsconvene.im).

# modal->btn->text
source: SEND AN EMAIL
ta: மின்னஞ்சல் அனுப்புங்கள்
