Repository: 247i/TACETr
Catalog: உரை/தானி/guardianproject-locationprivacy-*.po
Languages: ta

# app_name
source: LocationPrivacy
ta: இருப்பிடமானது

# app_description
source: LocationPrivacy is not really app but rather a set of Intent Filters for all of the various ways of sharing location. When you share location from one app, LocationPrivacy offers itself as an option. It then recognizes insecure methods of sharing location, and then converts them to more secure methods. This mostly means that it rewrites URLs to use https, and even to use `geo:` URIs, which can work on fully offline setups. LocationPrivacy mostly works by reading the location information from the URL itself. For many URLs, LocationPrivacy must actually load some of the webpage in order to get the location.
ta: இருப்பிடமானது உண்மையில் பயன்பாடு அல்ல, மாறாக இருப்பிடத்தைப் பகிர்வதற்கான பல்வேறு வழிகளுக்கான நோக்கம் வடிப்பான்களின் தொகுப்பு. ஒரு பயன்பாட்டிலிருந்து இருப்பிடத்தைப் பகிரும்போது, ​​இருப்பிடப் பிரைவசி தன்னை ஒரு விருப்பமாக வழங்குகிறது. இது இருப்பிடத்தைப் பகிர்வதற்கான பாதுகாப்பற்ற முறைகளை அங்கீகரிக்கிறது, பின்னர் அவற்றை மிகவும் பாதுகாப்பான முறைகளாக மாற்றுகிறது. இது பெரும்பாலும் HTTP களைப் பயன்படுத்த முகவரி களை மீண்டும் எழுதுகிறது, மேலும் `GEO:` URIS ஐப் பயன்படுத்தவும், இது முழு இணைப்பில்லாத அமைப்புகளில் வேலை செய்ய முடியும். முகவரி இலிருந்து இருப்பிட தகவல்களைப் படிப்பதன் மூலம் இருப்பிடப் பிரைவசி பெரும்பாலும் செயல்படுகிறது. பல முகவரி களுக்கு, இருப்பிடத்தைப் பெறுவதற்கு இருப்பிடப் சார்பாளர் உண்மையில் சில வலைப்பக்கங்களை ஏற்ற வேண்டும்.

# usage
source: To use this app, click on a location link and choose LocationPrivacy, or share some text to LocationPrivacy. First select LocationPrivacy, it will process the info, then prompt you again with a new list of apps that accept the more private location URL. Click below for an example:
ta: இந்த பயன்பாட்டைப் பயன்படுத்த, இருப்பிட இணைப்பைக் சொடுக்கு செய்து, இருப்பிடப் பிரைவானைத் தேர்வுசெய்க அல்லது சில உரையை இருப்பிடப் பிரைவ்சிக்கு பகிரவும். முதலில் இருப்பிடத்தை தேர்ந்தெடுக்கவும், இது தகவலை செயலாக்கும், பின்னர் தனிப்பட்ட இருப்பிட முகவரி ஐ ஏற்றுக்கொள்ளும் பயன்பாடுகளின் புதிய பட்டியலை மீண்டும் கேட்கும். எடுத்துக்காட்டுக்கு கீழே சொடுக்கு செய்க:

# give_feedback
source: We want your feedback! Click here to file an issue: https://dev.guardianproject.info/projects/panic/issues
ta: உங்கள் கருத்தை நாங்கள் விரும்புகிறோம்! சிக்கலை தாக்கல் செய்ய இங்கே சொடுக்கு செய்க: https://dev.guardianproject.info/projects/panic/issues

source: Force HTTPS
ta: Https ஐ கட்டாயப்படுத்துங்கள்

source: Send location to…
ta: இருப்பிடத்தை அனுப்பவும்…

# view_in
source: view in %1$s
ta: %1$s இல் காண்க

# ignoring_unparsable_url
source: Ignoring unparsable URL, try a different app!
ta: அங்கீகரிக்க முடியாத முகவரி ஐ புறக்கணித்து, வேறு பயன்பாட்டை முயற்சிக்கவும்!

source: Choose trusted map app
ta: நம்பகமான வரைபட பயன்பாட்டைத் தேர்வுசெய்க

# recommended_app
source: OsmAnd is recommended as a private map app that provides complete, offline operation. That means it won't leak your private info to anything off of your device. It is also Free Software.
ta: முழுமையான, இணைப்பில்லாத செயல்பாட்டை வழங்கும் தனியார் வரைபட பயன்பாடாக OSMAND பரிந்துரைக்கப்படுகிறது. அதாவது இது உங்கள் தனிப்பட்ட தகவலை உங்கள் சாதனத்தின் எதற்கும் கசியாது. இது இலவச மென்பொருளாகும்.

source: Install OsmAnd
ta: Osmand ஐ நிறுவவும்

# why_orbot
source: Orbot provides Tor, which anonymizes your network traffic. LocationPrivacy will leak a lot less information when it works together with Orbot. It is Free Software.
ta: ஆர்போட் டோர் வழங்குகிறது, இது உங்கள் பிணைய போக்குவரத்தை அநாமதேயப்படுத்துகிறது. Orbot உடன் இணைந்து செயல்படும்போது இருப்பிடப் சார்பாளர் மிகவும் குறைவான தகவல்களைக் கசிய வைக்கும். இது இலவச மென்பொருள்.

source: Install Orbot
ta: ஆர்போட்டை நிறுவவும்

# blocked_url
source: LocationPrivacy blocked this URL!
ta: இருப்பிடமானது இந்த முகவரி ஐத் தடுத்தது!

# no_geo_map_app
source: No installed map app that understands geo: location URIs!
ta: சியோவைப் புரிந்துகொள்ளும் நிறுவப்பட்ட வரைபட பயன்பாடு இல்லை: இருப்பிட யுஆர்ஐக்கள்!

source: Start Orbot?
ta: ஆர்போட் தொடங்கவா?

# you_must_have_orbot
source: You must have Orbot installed and activated to proxy traffic through it. Would you like to download it?
ta: நீங்கள் ஆர்போட் நிறுவப்பட்டு அதன் மூலம் பதிலாள் போக்குவரத்திற்கு செயல்படுத்தப்பட வேண்டும். அதை பதிவிறக்கம் செய்ய விரும்புகிறீர்களா?

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Waiting for Orbot
ta: ஆர்போட்டுக்காக காத்திருக்கிறது

# orbot_stopped
source: Orbot stopped, cancelling location lookup!
ta: ஆர்போட் நிறுத்தப்பட்டது, இருப்பிட தேடலை ரத்து செய்தல்!

source: About…
ta: பற்றி…

source: Blocked
ta: தடுக்கப்பட்டது

source: Chooser
ta: தேர்வாளர்
