Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: test=> CREATE TABLE hello (who TEXT NOT NULL); CREATE TABLE test=> INSERT INTO hello (who) VALUES ('world'); INSERT 0 1 test=> SELECT * FROM hello; who ------- world (1 row)
ta: test=> க்ரேட் டேபிள் அலோ (யார் உரை NULL); அட்டவணையை உருவாக்கவும் test=> வணக்கம் (யார்) மதிப்புகளில் ('உலகம்') நுழைக்கவும்; 0 1ஐச் செருகவும் test=> தேர்ந்தெடு * வணக்கம்; யார் ------- உலகம் (1 வரிசை)

source: Now that we're done with this little demonstration let's clean up:
ta: இப்போது நாம் இந்த சிறிய ஆர்ப்பாட்டத்தை முடித்துவிட்டோம், தூய்மை செய்வோம்:

source: sudo kill $pid sudo ip netns del $ns sudo ip link del $host
ta: சூடோ கொலை $pid sudo ip netns del $ns sudo ip இணைப்பு del $host

source: Guix can produce disk images (@pxref{Invoking guix system,,, guix, GNU Guix Reference Manual}) that can be used with virtual machines solutions such as virt-manager, GNOME Boxes or the more bare QEMU, among others.
ta: Guix வட்டு படங்களை (@pxref{Invoking guix system,,, guix, GNU Guix குறிப்பு Manual}) உருவாக்க முடியும், அவை virt-manager, GNOME Boxes அல்லது அதிக வெற்று QEMU போன்ற மெய்நிகர் இயந்திர தீர்வுகளுடன் பயன்படுத்தப்படலாம்.

source: This chapter aims to provide hands-on, practical examples that relates to the usage and configuration of virtual machines on a Guix System.
ta: இந்த அத்தியாயம் கைக்ச் சிச்டத்தில் மெய்நிகர் இயந்திரங்களின் பயன்பாடு மற்றும் உள்ளமைவு தொடர்பான நடைமுறை உதாரணங்களை வழங்குவதை நோக்கமாகக் கொண்டுள்ளது.

source: Network bridge interface
ta: பிணையம் பிரிட்ச் இடைமுகம்

source: networking, bridge
ta: நெட்வொர்க்கிங், பாலம்

source: qemu, network bridge
ta: qemu, பிணைய பாலம்

source: By default, QEMU uses a so-called ``user mode'' host network back-end, which is convenient as it does not require any configuration. Unfortunately, it is also quite limited. In this mode, the guest @abbr{VM, virtual machine} can access the network the same way the host would, but it cannot be reached from the host. Additionally, since the QEMU user networking mode relies on ICMP, ICMP-based networking tools such as @command{ping} do @emph{not} work in this mode. Thus, it is often desirable to configure a network bridge, which enables the guest to fully participate in the network. This is necessary, for example, when the guest is to be used as a server.
ta: இயல்பாக, QEMU ``பயனர் பயன்முறை'' என அழைக்கப்படும் புரவலன் பிணையம் பின்-இறுதியைப் பயன்படுத்துகிறது, இது எந்த உள்ளமைவும் தேவையில்லை என்பதால் வசதியானது. எதிர்பாராதவிதமாக, இது மிகவும் குறைவாகவே உள்ளது. இந்த பயன்முறையில், விருந்தினர் @abbr{VM, மெய்நிகர் இயந்திரம்} ஓச்ட்டைப் போலவே நெட்வொர்க்கை அணுக முடியும், ஆனால் அதை ஓச்டிலிருந்து அணுக முடியாது. கூடுதலாக, QEMU பயனர் நெட்வொர்க்கிங் பயன்முறை ICMPயை நம்பியிருப்பதால், @command{ping} போன்ற ICMP அடிப்படையிலான நெட்வொர்க்கிங் கருவிகள் இந்தப் பயன்முறையில் @emph{not} வேலை செய்கின்றன. எனவே, பிணையம் பிரிட்சை உள்ளமைப்பது பெரும்பாலும் விரும்பத்தக்கது, இது விருந்தினரை நெட்வொர்க்கில் முழுமையாகப் பங்கேற்கச் செய்கிறது. எடுத்துக்காட்டாக, விருந்தினர் சேவையகமாகப் பயன்படுத்தப்படும்போது இது தேவை.

source: Creating a network bridge interface
ta: பிணைய பாலம் இடைமுகத்தை உருவாக்குதல்

source: There are many ways to create a network bridge. The following command shows how to use NetworkManager and its @command{nmcli} command line interface (CLI) tool, which should already be available if your operating system declaration is based on one of the desktop templates:
ta: பிணைய பாலத்தை உருவாக்க பல வழிகள் உள்ளன. பின்வரும் கட்டளை NetworkManager மற்றும் அதன் @command{nmcli} கட்டளை வரி இடைமுகம் (CLI) கருவியை எவ்வாறு பயன்படுத்துவது என்பதைக் காட்டுகிறது, இது உங்கள் இயக்க முறைமை அறிவிப்பு டெச்க்டாப் டெம்ப்ளேட்களில் ஒன்றின் அடிப்படையில் இருந்தால் ஏற்கனவே கிடைக்கும்:

source: # nmcli con add type bridge con-name br0 ifname br0
ta: # nmcli கோன் கூட்டு வகை bridge con-name br0 ifname br0

source: To have this bridge be part of your network, you must associate your network bridge with the Ethernet interface used to connect with the network. Assuming your interface is named @samp{enp2s0}, the following command can be used to do so:
ta: இந்த பாலம் உங்கள் நெட்வொர்க்கின் ஒரு பகுதியாக இருக்க, பிணையத்துடன் இணைக்கப் பயன்படுத்தப்படும் ஈதர்நெட் இடைமுகத்துடன் உங்கள் பிணைய பாலத்தை இணைக்க வேண்டும். உங்கள் இடைமுகம் @samp{enp2s0} என்று பெயரிடப்பட்டால், பின்வரும் கட்டளையை அவ்வாறு செய்ய பயன்படுத்தலாம்:

source: # nmcli con add type bridge-slave ifname enp2s0 master br0
ta: # nmcli கோன் கூட்டு வகை bridge-slave ifname enp2s0 master br0

source: Important
ta: முக்கியமானது

source: Only Ethernet interfaces can be added to a bridge. For wireless interfaces, consider the routed network approach detailed in @xref{Routed network for libvirt}.
ta: ஈத்தர்நெட் இடைமுகங்களை மட்டுமே ஒரு பிரிட்சில் சேர்க்க முடியும். வயர்லெச் இடைமுகங்களுக்கு, @xref{Routed network for libvirt} இல் விவரிக்கப்பட்டுள்ள வழித்தட பிணையம் அணுகுமுறையைக் கவனியுங்கள்.

source: By default, the network bridge will allow your guests to obtain their IP address via DHCP, if available on your local network. For simplicity, this is what we will use here. To easily find the guests, they can be configured to advertise their host names via mDNS.
ta: இயல்பாக, உங்கள் உள்ளக நெட்வொர்க்கில் இருந்தால், DHCP வழியாக உங்கள் விருந்தினர்கள் தங்கள் IP முகவரியைப் பெற பிணையம் பிரிட்ச் அனுமதிக்கும். எளிமைக்காக, இதைத்தான் இங்கே பயன்படுத்துவோம். விருந்தினர்களை எளிதாகக் கண்டறிய, அவர்கள் தங்கள் புரவலன் பெயர்களை mDNS வழியாக விளம்பரப்படுத்த உள்ளமைக்க முடியும்.

source: Configuring the QEMU bridge helper script
ta: QEMU பிரிட்ச் உதவி ச்கிரிப்டை உள்ளமைக்கிறது

source: QEMU comes with a helper program to conveniently make use of a network bridge interface as an unprivileged user @pxref{Network options,,, QEMU, QEMU Documentation}. The binary must be made setuid root for proper operation; this can be achieved by adding it to the @code{privileged-programs} field of your (host) @code{operating-system} definition, as shown below:
ta: பிணையம் பிரிட்ச் இடைமுகத்தை வசதியற்ற பயனராகப் பயன்படுத்துவதற்கு QEMU ஒரு உதவி நிரலுடன் வருகிறது @pxref{நெட்வொர்க் விருப்பங்கள்,,, QEMU, QEMU ஆவணம்}. பைனரி சரியான செயல்பாட்டிற்கு செட்யூட் ரூட் செய்யப்பட வேண்டும்; கீழே காட்டப்பட்டுள்ளபடி, உங்கள் (host) @code{operating-system} வரையறையின் @code{privileged-programs} புலத்தில் சேர்ப்பதன் மூலம் இதை அடையலாம்:

source: (privileged-programs (cons (privileged-program (program (file-append qemu "/libexec/qemu-bridge-helper")) (setuid? #t)) %default-privileged-programs))
ta: (சலுகை பெற்ற திட்டங்கள் (பாதிப்புகள் (சலுகை-திட்டம் (நிரல் (கோப்பு-இணைப்பு qemu "/libexec/qemu-bridge-helper")) (செட்யூட்? #டி)) %default-privileged-நிரல்கள்))

source: The file @file{/etc/qemu/bridge.conf} must also be made to allow the bridge interface, as the default is to deny all. Add the following to your list of services to do so:
ta: @file{/etc/qemu/bridge.conf} என்ற கோப்பு பிரிட்ச் இடைமுகத்தை அனுமதிக்கும் வகையில் உருவாக்கப்பட வேண்டும், ஏனெனில் அனைத்தையும் மறுப்பது இயல்பு. அவ்வாறு செய்ய உங்கள் சேவைகளின் பட்டியலில் பின்வருவனவற்றைச் சேர்க்கவும்:

source: (extra-special-file "/etc/qemu/host.conf" (plain-file "host.conf" "allow br0\n"))
ta: (extra-special-file "/etc/qemu/host.conf" (எளிமையான கோப்பு "host.conf" "இசைவு br0\n"))

source: Invoking QEMU with the right command line options
ta: சரியான கட்டளை வரி விருப்பங்களுடன் QEMU ஐ அழைக்கிறது

source: When invoking QEMU, the following options should be provided so that the network bridge is used, after having selected a unique MAC address for the guest.
ta: QEMU ஐ அழைக்கும்போது, விருந்தினருக்கான தனிப்பட்ட MAC முகவரியைத் தேர்ந்தெடுத்த பிறகு, பிணையம் பிரிட்ச் பயன்படுத்தப்படும் வகையில் பின்வரும் விருப்பங்கள் வழங்கப்பட வேண்டும்.

source: By default, a single MAC address is used for all guests, unless provided. Failing to provide different MAC addresses to each virtual machine making use of the bridge would cause networking issues.
ta: இயல்பாக, அனைத்து விருந்தினர்களுக்கும் ஒரே MAC முகவரி பயன்படுத்தப்படும். பாலத்தைப் பயன்படுத்தும் ஒவ்வொரு மெய்நிகர் இயந்திரத்திற்கும் வெவ்வேறு MAC முகவரிகளை வழங்கத் தவறினால் நெட்வொர்க்கிங் சிக்கல்கள் ஏற்படும்.

source: To generate MAC addresses that have the QEMU registered prefix, the following snippet can be employed:
ta: QEMU பதிவு செய்யப்பட்ட முன்னொட்டைக் கொண்ட MAC முகவரிகளை உருவாக்க, பின்வரும் துணுக்கைப் பயன்படுத்தலாம்:

source: mac_address="52:54:00:$(dd if=/dev/urandom bs=512 count=1 2>/dev/null \ | md5sum \ | sed -E 's/^(..)(..)(..).*$/\1:\2:\3/')" echo $mac_address
ta: mac_address="52:54:00:$(dd if=/dev/urandom bs=512 count=1 2>/dev/null \ | md5sum \ | sed -E 's/^(..)(..)(..).*$/\1:\2:\3/')" எதிரொலி $mac_address

source: Networking issues caused by Docker
ta: டோக்கரால் ஏற்படும் நெட்வொர்க்கிங் சிக்கல்கள்

source: If you use Docker on your machine, you may experience connectivity issues when attempting to use a network bridge, which are caused by Docker also relying on network bridges and configuring its own routing rules. The solution is add the following @code{iptables} snippet to your @code{operating-system} declaration:
ta: உங்கள் கணினியில் டோக்கரைப் பயன்படுத்தினால், பிணையம் பிரிட்சைப் பயன்படுத்த முயற்சிக்கும் போது இணைப்புச் சிக்கல்களை நீங்கள் சந்திக்க நேரிடலாம், இது டோக்கரும் பிணையம் பிரிட்ச்களை நம்பி அதன் சொந்த ரூட்டிங் விதிகளை உள்ளமைப்பதால் ஏற்படும். உங்கள் @code{operating-system} அறிவிப்பில் பின்வரும் @code{iptables} துணுக்கைச் சேர்ப்பதே தீர்வு:

source: (service iptables-service-type (iptables-configuration (ipv4-rules (plain-file "iptables.rules" "\ *filter :INPUT ACCEPT [0:0] :FORWARD DROP [0:0] :OUTPUT ACCEPT [0:0] -A FORWARD -i br0 -o br0 -j ACCEPT COMMIT "))
ta: (service iptables-service-type (iptables-கட்டமைப்பு (ipv4-rules (plain-file "iptables.rules" "\ * வடிகட்டி :உள்ளீடு ஏற்றுக்கொள் [0:0] :ஃபார்வேர்ட் டிராப் [0:0] :அவுட்புட் ஏற்றுக்கொள் [0:0] -ஒரு முன்னோக்கி -i br0 -o br0 -j ஏற்றுக்கொள் COMMIT "))

source: Virtual network bridge interface
ta: விர்ச்சுவல் பிணையம் பிரிட்ச் இடைமுகம்

source: networking, virtual bridge
ta: நெட்வொர்க்கிங், மெய்நிகர் பாலம்

source: libvirt, virtual network switch
ta: libvirt, மெய்நிகர் பிணையம் சுவிட்ச்

source: If the machine hosting your virtual machines is connected wirelessly to the network, you won't be able to use a true network bridge as explained in the preceding section (@pxref{Network bridge for QEMU}). In this case, the next best option is to use a @emph{virtual network switch} with static routing and to configure a libvirt-powered virtual machine to use it (via the @command{virt-manager} GUI for example). This is similar to the default mode of operation of QEMU/libvirt, except that instead of using @abbr{NAT, Network Address Translation}, it relies on static routes to join the @abbr{VM, virtual machine} IP address to the @abbr{LAN, local area network}. This provides two-way connectivity to and from the virtual machine, which is needed for exposing services hosted on the virtual machine.
ta: உங்கள் மெய்நிகர் இயந்திரங்களை புரவலன் செய்யும் இயந்திரம் நெட்வொர்க்குடன் வயர்லெச் முறையில் இணைக்கப்பட்டிருந்தால், முந்தைய பிரிவில் (@pxref{Network bridge for QEMU}) விளக்கப்பட்டுள்ளபடி, உண்மையான பிணையம் பிரிட்சை உங்களால் பயன்படுத்த முடியாது. இந்த நிலையில், நிலையான ரூட்டிங் மூலம் @emph{virtual network switch} பயன்படுத்துவதும், அதைப் பயன்படுத்த libvirt-ஆல் இயங்கும் மெய்நிகர் இயந்திரத்தை உள்ளமைப்பதும் அடுத்த சிறந்த விருப்பமாகும் (உதாரணமாக @command{virt-manager} GUI வழியாக). இது QEMU/libvirt இன் இயல்புநிலை செயல்பாட்டு முறையைப் போலவே உள்ளது, தவிர, @abbr{NAT, பிணையம் முகவரி மொழிபெயர்ப்பு} ஐப் பயன்படுத்துவதற்குப் பதிலாக, @abbr{LAN, உள்ளக ஏரியா நெட்வொர்க்} இல் @abbr{VM, virtual machine} IP முகவரியைச் சேர்வதற்கு நிலையான வழிகளை இது சார்ந்துள்ளது. இது மெய்நிகர் இயந்திரத்திற்கு மற்றும் இருவழி இணைப்பை வழங்குகிறது, இது மெய்நிகர் கணினியில் புரவலன் செய்யப்பட்ட சேவைகளை வெளிப்படுத்துவதற்குத் தேவைப்படுகிறது.

source: Creating a virtual network switch
ta: மெய்நிகர் பிணையம் சுவிட்சை உருவாக்குதல்

source: A virtual network switch consists of a virtual network device called a `virtual bridge', DHCP server (dnsmasq) and firewall rules (iptables). See the @url{https://wiki.libvirt.org/VirtualNetworking.html, libvirt Wiki article on Virtual Networking} for more details on the modes of operation, management and implementation of virtual network switches.
ta: மெய்நிகர் பிணையம் சுவிட்ச் என்பது `மெய்நிகர் பிரிட்ச்' எனப்படும் மெய்நிகர் பிணையம் சாதனம், DHCP சர்வர் (dnsmasq) மற்றும் ஃபயர்வால் விதிகள் (iptables) ஆகியவற்றைக் கொண்டுள்ளது. விர்ச்சுவல் பிணையம் சுவிட்சுகளின் செயல்பாட்டு முறைகள், மேலாண்மை மற்றும் செயல்படுத்தல் பற்றிய கூடுதல் விவரங்களுக்கு @url{https://wiki.libvirt.org/VirtualNetworking.html, libvirt விக்கி விர்ச்சுவல் நெட்வொர்க்கிங் கட்டுரையைப் பார்க்கவும்.

source: The @command{virsh} command, provided by the @code{libvirt} package, makes it very easy to create a virtual switch. You first need to choose a network subnet for your virtual switch; if your home LAN is in the @samp{192.168.1.0/24} network, you could opt to use e.g.@: @samp{192.168.2.0/24}. Define an XML file, e.g.@: @file{/tmp/virbr0.xml}, containing the following:
ta: @code{libvirt} தொகுப்பால் வழங்கப்பட்ட @command{virsh} கட்டளை, மெய்நிகர் சுவிட்சை உருவாக்குவதை மிகவும் எளிதாக்குகிறது. உங்கள் மெய்நிகர் மாறுதலுக்கான பிணைய சப்நெட்டை நீங்கள் முதலில் தேர்வு செய்ய வேண்டும்; உங்கள் வீட்டு லேன் @samp{192.168.1.0/24} நெட்வொர்க்கில் இருந்தால், நீங்கள் எ.கா.@: @samp{192.168.2.0/24} ஐப் பயன்படுத்தலாம். நீகுமொ கோப்பை வரையறுக்கவும், எ.கா.@: @file{/tmp/virbr0.xml}, பின்வருவனவற்றைக் கொண்டுள்ளது:

source: <network> <name>virbr0</name> <bridge name="virbr0" /> <forward mode="route"/> <ip address="192.168.2.0" netmask="255.255.255.0"> <dhcp> <range start="192.168.2.1" end="192.168.2.254"/> </dhcp> </ip> </network>
ta: <network> <name>விர்பொரோ</name> <bridge name="விர்பொரோ" /> <forward mode="வழி"/> <ip address="192.168.2.0" netmask="255.255.255.0"> <dhcp> <range start="192.168.2.1" end="192.168.2.254"/> </dhcp> </ip> </network>

source: Then create and configure the interface using the @command{virsh} command, as root:
ta: பின்னர் ரூட்டாக @command{virsh} கட்டளையைப் பயன்படுத்தி இடைமுகத்தை உருவாக்கி உள்ளமைக்கவும்:

source: virsh net-define /tmp/virbr0.xml virsh net-autostart virbr0 virsh net-start virbr0
ta: virsh net-define /tmp/virbr0.xml virsh அல்லாத தானியங்கு virbr0 virsh அல்லாத தொடக்க virbr0

source: The @samp{virbr0} interface should now be visible e.g.@: via the @samp{ip address} command. It will be automatically started every time your libvirt virtual machine is started.
ta: @samp{virbr0} இடைமுகம் இப்போது தெரியும் எ.கா.@: @samp{ip address} கட்டளை வழியாக. ஒவ்வொரு முறையும் உங்கள் libvirt மெய்நிகர் இயந்திரம் தொடங்கப்படும்போது அது தானாகவே தொடங்கப்படும்.

source: Configuring the static routes for your virtual bridge
ta: உங்கள் மெய்நிகர் பாலத்திற்கான நிலையான வழிகளை உள்ளமைக்கிறது

source: If you configured your virtual machine to use your newly created @samp{virbr0} virtual bridge interface, it should already receive an IP via DHCP such as @samp{192.168.2.15} and be reachable from the server hosting it, e.g.@: via @samp{ping 192.168.2.15}. There's one last configuration needed so that the VM can reach the external network: adding static routes to the network's router.
ta: நீங்கள் புதிதாக உருவாக்கப்பட்ட @samp{virbr0} விர்ச்சுவல் பிரிட்ச் இடைமுகத்தைப் பயன்படுத்த உங்கள் மெய்நிகர் இயந்திரத்தை உள்ளமைத்திருந்தால், அது ஏற்கனவே @samp{192.168.2.15} போன்ற DHCP வழியாக ஐபியைப் பெற்றிருக்க வேண்டும், மேலும் அதை புரவலன் செய்யும் சர்வரில் எ.கா.@: @samp{ping 192.158 வழியாக அணுகலாம். VM வெளிப்புற நெட்வொர்க்கை அடைய ஒரு கடைசி உள்ளமைவு தேவைப்படுகிறது: பிணையத்தின் திசைவிக்கு நிலையான வழிகளைச் சேர்த்தல்.

source: In this example, the LAN network is @samp{192.168.1.0/24} and the router configuration web page may be accessible via e.g.@: the @url{http://192.168.1.1} page. On a router running the @url{https://librecmc.org/, libreCMC} firmware, you would navigate to the @clicksequence{Network @click{} Static Routes} page (@url{https://192.168.1.1/cgi-bin/luci/admin/network/routes}), and you would add a new entry to the @samp{Static IPv4 Routes} with the following information:
ta: இந்த எடுத்துக்காட்டில், LAN பிணையம் @samp{192.168.1.0/24} மற்றும் ரூட்டர் உள்ளமைவு இணையப் பக்கத்தை எ.கா.@: @url{http://192.168.1.1} பக்கம் வழியாக அணுகலாம். @url{https://librecmc.org/, libreCMC} ஃபார்ம்வேரில் இயங்கும் ரூட்டரில், நீங்கள் @clicksequence{Network @click{} Static Routes} பக்கத்திற்குச் செல்வீர்கள் (@url{https://192.168.1.1/cgi-bin/luci/admin/routes க்கு புதிய நெட்வொர்க்கைச் சேர்க்க), @samp{Static IPv4 Routes} பின்வரும் தகவலுடன்:

source: Interface
ta: இடைமுகம்

source: lan
ta: லான்

source: Target
ta: இலக்கு

source: IPv4-Netmask
ta: IPv4 நெட்மாஸ்க்

source: IPv4-Gateway
ta: IPv4-கேட்வே

source: server-ip
ta: சர்வர்-ஐபி

source: Route type
ta: பாதை வகை

source: unicast
ta: ஒரே மாதிரியான

source: where @var{server-ip} is the IP address of the machine hosting the VMs, which should be static.
ta: @var{server-ip} என்பது VMகளை வழங்கும் இயந்திரத்தின் IP முகவரி, இது நிலையானதாக இருக்க வேண்டும்.

source: After saving/applying this new static route, external connectivity should work from within your VM; you can e.g.@: run @samp{ping gnu.org} to verify that it functions correctly.
ta: இந்தப் புதிய நிலையான வழியைச் சேமித்த/பயன்படுத்திய பிறகு, வெளிப்புற இணைப்பு உங்கள் VM க்குள் இருந்து செயல்பட வேண்டும்; நீங்கள் எ.கா.@: @samp{ping gnu.org} ஐ இயக்கி அது சரியாகச் செயல்படுகிறதா என்பதைச் சரிபார்க்கலாம்.

source: As mentioned in the preceding section (@pxref{Routed network for libvirt}), libvirt allows virtual networks to be defined via XML files and managed by the @command{virsh} command. The details of the creation and removal of virtual network switches are handled by libvirt, so the user does not have to deal with them.
ta: முந்தைய பிரிவில் (@pxref{Routed network for libvirt}) குறிப்பிட்டுள்ளபடி, libvirt மெய்நிகர் நெட்வொர்க்குகளை நீகுமொ கோப்புகள் வழியாக வரையறுக்க அனுமதிக்கிறது மற்றும் @command{virsh} கட்டளையால் நிர்வகிக்கப்படுகிறது. மெய்நிகர் பிணையம் சுவிட்சுகளை உருவாக்குதல் மற்றும் அகற்றுதல் பற்றிய விவரங்கள் libvirt ஆல் கையாளப்படுகின்றன, எனவே பயனர் அவற்றைச் சமாளிக்க வேண்டியதில்லை.

source: However, libvirt's handling of virtual network switches can sometimes clash with more complex networking setups. In particular, the iptables rules inserted by libvirt for switches operating in the NAT mode can clash with existing iptables/nftables rules, leading to insecure or broken packet filtering.
ta: இருப்பினும், libvirt இன் மெய்நிகர் பிணையம் சுவிட்சுகளை கையாளுவது சில நேரங்களில் மிகவும் சிக்கலான நெட்வொர்க்கிங் அமைப்புகளுடன் மோதலாம். குறிப்பாக, NAT பயன்முறையில் இயங்கும் சுவிட்சுகளுக்கு libvirt மூலம் செருகப்பட்ட iptables விதிகள் ஏற்கனவே இருக்கும் iptables/nftables விதிகளுடன் மோதலாம், இது பாதுகாப்பற்ற அல்லது உடைந்த பாக்கெட் வடிகட்டலுக்கு வழிவகுக்கும்.

source: In such cases, the only solution is to manually set up a virtual network switch. This section will provide instructions on how to do so using Guix System services.
ta: இதுபோன்ற சந்தர்ப்பங்களில், மெய்நிகர் பிணையம் சுவிட்சை கைமுறையாக அமைப்பதே ஒரே தீர்வு. Guix மண்டலம் சேவைகளைப் பயன்படுத்தி எப்படிச் செய்வது என்பது குறித்த வழிமுறைகளை இந்தப் பகுதி வழங்கும்.

source: Creating the virtual network bridge
ta: மெய்நிகர் பிணைய பாலத்தை உருவாக்குதல்

source: The @code{static-networking-service-type} can be used to create a virtual network bridge and assign an IP address to it:
ta: @code{static-networking-service-type} ஆனது ஒரு மெய்நிகர் பிணையம் பிரிட்சை உருவாக்கவும் அதற்கு ஐபி முகவரியை ஒதுக்கவும் பயன்படுத்தப்படலாம்:

source: (service static-networking-service-type (list (static-networking ;; The default provision is 'networking; if you're using any ;; other service with this provision, such as ;; `network-manager-service-type`, then you need to change the ;; default. (provision '(static-networking)) (links (list (network-link (name "virbr0") (type 'bridge) (arguments '())))) (addresses (list (network-address (device "virbr0") (value "192.168.10.1/24")))))))
ta: (சேவை நிலையான-நெட்வொர்க்கிங்-சேவை-வகை (பட்டியல் (நிலையான-நெட்வொர்க்கிங் ;; இயல்புநிலை ஏற்பாடு 'நெட்வொர்க்கிங்; நீங்கள் எதையாவது பயன்படுத்தினால் ;; இந்த ஏற்பாட்டுடன் கூடிய பிற பணி, போன்றவை ;; `நெட்வொர்க்-மேனேசர்-சேவை-வகை`, பின்னர் நீங்கள் மாற்ற வேண்டும் ;; இயல்புநிலை. (விதிமுறை '(நிலையான-நெட்வொர்க்கிங்)) (இணைப்புகள் (பட்டியல் (நெட்வொர்க்-இணைப்பு (பெயர் "virbr0") (வகை 'பாலம்) (வாதங்கள் '()))) (முகவரிகள் (பட்டியல் (நெட்வொர்க் முகவரி (சாதனம் "virbr0") (மதிப்பு "192.168.10.1/24")))))))

source: Running dnsmasq for the virtual network bridge
ta: விர்ச்சுவல் பிணையம் பிரிட்சிற்காக dnsmasqஐ இயக்குகிறது

source: The @code{dnsmasq-service-type} can be used to provide DNS and DHCP for guests connected to this virtual network switch:
ta: இந்த விர்ச்சுவல் பிணையம் சுவிட்ச்சுடன் இணைக்கப்பட்ட விருந்தினர்களுக்கு DNS மற்றும் DHCP ஐ வழங்க @code{dnsmasq-service-type}ஐப் பயன்படுத்தலாம்:

source: (service dnsmasq-service-type (dnsmasq-configuration ;; You can have multiple instances of `dnsmasq-service-type` as long ;; as each one has a different shepherd-provision. (shepherd-provision '(dnsmasq-virbr0)) (extra-options (list ;; Only bind to the virtual bridge. This ;; avoids conflicts with other running ;; dnsmasq instances. "--except-interface=lo" "--interface=virbr0" "--bind-dynamic" ;; IPv4 addresses to offer to VMs. This ;; should match the chosen subnet. "--dhcp-range=192.168.10.2,192.168.10.254"))))
ta: (சேவை dnsmasq-service-type (dnsmasq-configuration ;; `dnsmasq-service-type` இன் பல நிகழ்வுகளை நீங்கள் நீண்ட காலமாக வைத்திருக்கலாம் ;; ஒவ்வொருவருக்கும் வெவ்வேறு மேய்ப்பர்-ஒதுக்கீடு உள்ளது. (மேய்ப்பன்-ஒதுக்கீடு '(dnsmasq-virbr0)) (கூடுதல் விருப்பங்கள் (பட்டியல் ;; மெய்நிகர் பாலத்துடன் மட்டும் பிணைக்கவும். இது ;; மற்ற ஓட்டங்களுடனான மோதல்களைத் தவிர்க்கிறது ;; dnsmasq நிகழ்வுகள். "--தவிர-இடைமுகம்=lo" "--இடைமுகம்=virbr0" "--பைண்ட்-டைனமிக்" ;; VMகளுக்கு வழங்க IPv4 முகவரிகள். இது ;; தேர்ந்தெடுக்கப்பட்ட சப்நெட்டுடன் பொருந்த வேண்டும். "--dhcp-range=192.168.10.2,192.168.10.254"))))

source: Configuring NAT for the virtual network switch
ta: மெய்நிகர் பிணையம் சுவிட்சுக்காக NAT ஐ கட்டமைக்கிறது

source: If you intend to use the virtual network switch in NAT mode, you will need to use nftables (or iptables) rules to set up IP masquerading. The following example shows how to use @code{nftables-service-type} to do this:
ta: நீங்கள் NAT பயன்முறையில் மெய்நிகர் பிணையம் சுவிட்சைப் பயன்படுத்த விரும்பினால், IP முகமூடியை அமைக்க நீங்கள் nftables (அல்லது iptables) விதிகளைப் பயன்படுத்த வேண்டும். இதைச் செய்ய, @code{nftables-service-type}ஐ எவ்வாறு பயன்படுத்துவது என்பதை பின்வரும் எடுத்துக்காட்டு காட்டுகிறது:

source: (service nftables-service-type (nftables-configuration (ruleset (plain-file "nftables.conf" "\ table inet filter @{
ta: (service nftables-service-type (nftables-configuration (விதிமுறை (எளிமையான கோப்பு "nftables.conf" "\ டேபிள் இன்ட் ஃபில்டர் @{

source: chain input @{ type filter hook input priority filter; policy drop; # Add your existing packet filtering rules here... iifname virbr0 udp dport 67 counter accept comment \"allow dhcp on virbr0\" iifname virbr0 meta l4proto @{tcp, udp@} th dport 53 accept \\ comment \"allow dns on virbr0\" @}
ta: சங்கிலி உள்ளீடு @{ வகை வடிகட்டி ஊக் உள்ளீடு முன்னுரிமை வடிகட்டி; கொள்கை வீழ்ச்சி; # ஏற்கனவே உள்ள பாக்கெட் வடிகட்டுதல் விதிகளை இங்கே சேர்க்கவும்... iifname virbr0 udp dport 67 கவுண்டர் \"virbr0 இல் dhcp ஐ அனுமதிக்கவும்\" கருத்தை ஏற்கவும் iifname virbr0 மேவு l4proto @{tcp, udp@} th dport 53 ஏற்கிறேன் \\ கருத்து \"virbr0 இல் dns ஐ அனுமதிக்கவும்\" @}
