Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: You should now have @code{my-hello} in your profile!
ta: இப்போது உங்கள் சுயவிவரத்தில் @code{my-hello} இருக்க வேண்டும்!

source: $ guix package --list-installed=my-hello my-hello 2.10 out /gnu/store/f1db2mfm8syb8qvc357c53slbvf1g9m9-my-hello-2.10
ta: $ guix தொகுப்பு --list-installed=my-hello my-hello 2.10 அவுட் /gnu/store/f1db2mfm8syb8qvc357c53slbvf1g9m9-my-hello-2.10

source: We've gone as far as we could without any knowledge of Scheme. Before moving on to more complex packages, now is the right time to brush up on your Scheme knowledge. @xref{A Scheme Crash Course} to get up to speed.
ta: திட்டத்தைப் பற்றி எந்த அறிவும் இல்லாமல் நாங்கள் முடிந்தவரை சென்றுவிட்டோம். மிகவும் சிக்கலான தொகுப்புகளுக்குச் செல்வதற்கு முன், உங்கள் திட்ட அறிவைப் பெறுவதற்கு இதுவே சரியான நேரம். வேகத்தை அதிகரிக்க @xref{A Scheme Crash Course}.

source: In the rest of this chapter we will rely on some basic Scheme programming knowledge. Now let's detail the different possible setups for working on Guix packages.
ta: இந்த அத்தியாயத்தின் எஞ்சிய பகுதியில் சில அடிப்படை திட்ட நிரலாக்க அறிவை நம்பியிருப்போம். இப்போது Guix தொகுப்புகளில் வேலை செய்வதற்கான பல்வேறு சாத்தியமான அமைப்புகளை விவரிப்போம்.

source: There are several ways to set up a Guix packaging environment.
ta: Guix பேக்கேசிங் சூழலை அமைக்க பல வழிகள் உள்ளன.

source: We recommend you work directly on the Guix source checkout since it makes it easier for everyone to contribute to the project.
ta: திட்டத்தில் பங்களிப்பதை அனைவரும் எளிதாக்குவதால், Guix மூல செக் அவுட்டில் நேரடியாகப் பணியாற்றுமாறு பரிந்துரைக்கிறோம்.

source: But first, let's look at other possibilities.
ta: ஆனால் முதலில், மற்ற சாத்தியக்கூறுகளைப் பார்ப்போம்.

source: This is what we previously did with @samp{my-hello}. With the Scheme basics we've covered, we are now able to explain the leading chunks. As stated in @code{guix package --help}:
ta: இதைத்தான் நாங்கள் முன்பு @samp{my-hello} மூலம் செய்தோம். நாங்கள் உள்ளடக்கிய திட்டத்தின் அடிப்படைகள் மூலம், இப்போது முன்னணி பகுதிகளை விளக்க முடியும். @code{guix தொகுப்பு --help} இல் கூறப்பட்டுள்ளபடி:

source: -f, --install-from-file=FILE install the package that the code within FILE evaluates to
ta: -f, --install-from-file=FILE FILE க்குள் குறியீடு இருக்கும் தொகுப்பை நிறுவவும் என மதிப்பிடுகிறது

source: Thus the last expression @emph{must} return a package, which is the case in our earlier example.
ta: எனவே கடைசி வெளிப்பாடு @emph{must} ஒரு தொகுப்பை வழங்கும், இது எங்கள் முந்தைய எடுத்துக்காட்டில் உள்ளது.

source: The @code{use-modules} expression tells which of the modules we need in the file. Modules are a collection of values and procedures. They are commonly called ``libraries'' or ``packages'' in other programming languages.
ta: @code{use-modules} வெளிப்பாடு, கோப்பில் நமக்குத் தேவையான தொகுதிக்கூறுகளைக் கூறுகிறது. தொகுதிகள் என்பது மதிப்புகள் மற்றும் நடைமுறைகளின் தொகுப்பாகும். அவை பொதுவாக பிற நிரலாக்க மொழிகளில் `` நூலகங்கள்'' அல்லது `` தொகுப்புகள்'' என்று அழைக்கப்படுகின்றன.

source: channel
ta: வாய்க்கால்

source: Guix and its package collection can be extended through @dfn{channels}. A channel is a Git repository, public or not, containing @file{.scm} files that provide packages (@pxref{Defining Packages,,, guix, GNU Guix Reference Manual}) or services (@pxref{Defining Services,,, guix, GNU Guix Reference Manual}).
ta: Guix மற்றும் அதன் தொகுப்பு சேகரிப்பு @dfn{channels} மூலம் நீட்டிக்கப்படலாம். சேனலானது பொது அல்லது பொதுவில் உள்ள Git களஞ்சியமாகும், இது @file{.scm} கோப்புகளைக் கொண்ட தொகுப்புகள் (@pxref{Defining Packages,,, guix, GNU Guix குறிப்பு Manual}) அல்லது சேவைகளை (@pxref{Defining Services,,, guix, GNU Guix குறிப்பு Manual}) வழங்குகிறது.

source: How would you go about creating a channel? First, create a directory that will contain your @file{.scm} files, say @file{~/my-channel}:
ta: சேனலை உருவாக்குவது எப்படி? முதலில், உங்கள் @file{.scm} கோப்புகளைக் கொண்ட ஒரு கோப்பகத்தை உருவாக்கவும், @file{~/my-channel} எனக் கூறவும்:

source: mkdir ~/my-channel
ta: mkdir ~/என்-கால்வாய்

source: Suppose you want to add the @samp{my-hello} package we saw previously; it first needs some adjustments:
ta: நாம் முன்பு பார்த்த @samp{my-hello} தொகுப்பை நீங்கள் சேர்க்க விரும்புகிறீர்கள் என்று வைத்துக்கொள்வோம்; இதற்கு முதலில் சில மாற்றங்கள் தேவை:

source: (define-module (my-hello) #:use-module (guix licenses) #:use-module (guix packages) #:use-module (guix build-system gnu) #:use-module (guix download))
ta: (வரையறை-தொகுதி (மை-அலோ) #:use-module (guix உரிமங்கள்) #:use-module (guix தொகுப்புகள்) #:use-module (guix build-system gnu) #:use-module (guix பதிவிறக்கம்))

source: (define-public my-hello (package (name "my-hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Hello, Guix world: An example custom Guix package") (description "GNU Hello prints the message \"Hello, world!\" and then exits. It serves as an example of standard GNU coding practices. As such, it supports command-line arguments, multiple languages, and so on.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+)))
ta: (வரையறை-பொது என்-வணக்கம் (தொகுப்பு (பெயர் "மை-அலோ") (பதிப்பு "2.10") (ஆதாரம் (முறை url-பெறுதல்) (உரி (சரம்-இணைப்பு "mirror://gnu/hello/hello-" பதிப்பு ".tar.gz")) (sha256 (அடிப்படை 32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (கட்டுமான அமைப்பு gnu-build-system) (சுருக்கம் "அலோ, Guix உலகம்: ஒரு எடுத்துக்காட்டு தனிப்பயன் Guix தொகுப்பு") (விளக்கம் "GNU Hello \"Hello, world!\" என்ற செய்தியை அச்சிட்டு பின்னர் வெளியேறுகிறது நிலையான குனு குறியீட்டு நடைமுறைகளுக்கு ஒரு எடுத்துக்காட்டு. அதுபோல, ஆதரிக்கிறது கட்டளை வரி வாதங்கள், பல மொழிகள் மற்றும் பல.") (முகப்பு பக்கம் "https://www.gnu.org/software/hello/") (உரிமம் gpl3+)))

source: Note that we have assigned the package value to an exported variable name with @code{define-public}. This is effectively assigning the package to the @code{my-hello} variable so that it can be referenced, among other as dependency of other packages.
ta: @code{define-public} உடன் ஏற்றுமதி செய்யப்பட்ட மாறி பெயருக்கு தொகுப்பு மதிப்பை ஒதுக்கியுள்ளோம் என்பதை நினைவில் கொள்ளவும். இது @code{my-hello} மாறிக்கு தொகுப்பை திறம்பட ஒதுக்குகிறது, இதனால் மற்ற தொகுப்புகளின் சார்பு போன்றவற்றைக் குறிப்பிடலாம்.

source: If you use @code{guix package --install-from-file=my-hello.scm} on the above file, it will fail because the last expression, @code{define-public}, does not return a package. If you want to use @code{define-public} in this use-case nonetheless, make sure the file ends with an evaluation of @code{my-hello}:
ta: மேலே உள்ள கோப்பில் @code{guix தொகுப்பு --install-from-file=my-hello.scm}ஐப் பயன்படுத்தினால், அது தோல்வியடையும், ஏனெனில் @code{define-public} என்ற கடைசி வெளிப்பாடு ஒரு தொகுப்பை வழங்காது. ஆயினும்கூட, இந்தப் பயன்பாட்டில் @code{define-public} ஐப் பயன்படுத்த விரும்பினால், @code{my-hello} இன் மதிப்பீட்டில் கோப்பு முடிவடைவதை உறுதிசெய்யவும்:

source: ;; ... (define-public my-hello ;; ... )
ta: ;; ... (வரையறை-பொது என்-வணக்கம் ;; ... )

source: my-hello
ta: என்-வணக்கம்

source: This last example is not very typical.
ta: இந்த கடைசி சான்று மிகவும் பொதுவானது அல்ல.

source: Now how do you make that package visible to @command{guix} commands so you can test your packages? You need to add the directory to the search path using the @option{-L} command-line option, as in these examples:
ta: இப்போது அந்தப் பேக்கேசை @command{guix} கட்டளைகளுக்குக் காட்டுவது எப்படி? அதனால் உங்கள் பேக்கேச்களைச் சோதிக்கலாம்? இந்த எடுத்துக்காட்டுகளில் உள்ளதைப் போல, @option{-L} கட்டளை-வரி விருப்பத்தைப் பயன்படுத்தி தேடல் பாதையில் கோப்பகத்தைச் சேர்க்க வேண்டும்:

source: guix show -L ~/my-channel my-hello guix build -L ~/my-channel my-hello
ta: guix காட்டு -L ~/my-channel my-hello guix உருவாக்கு -L ~/my-channel my-hello

source: The final step is to turn @file{~/my-channel} into an actual channel, making your package collection seamlessly available @i{via} any @command{guix} command. To do that, you first need to make it a Git repository:
ta: @file{~/my-channel}ஐ உண்மையான சேனலாக மாற்றுவதே இறுதிப் படியாகும், இதன் மூலம் உங்கள் தொகுப்பு சேகரிப்பு @i{via} எந்த @command{guix} கட்டளைக்கும் தடையின்றி கிடைக்கும். அதைச் செய்ய, நீங்கள் முதலில் அதை Git களஞ்சியமாக மாற்ற வேண்டும்:

source: cd ~/my-channel git init git add my-hello.scm git commit -m "First commit of my channel."
ta: cd ~/my-channel git init git கூட்டு my-hello.scm git commit -m "எனது சேனலின் முதல் உறுதி."

source: And that's it, you have a channel! From there on, you can add this channel to your channel configuration in @file{~/.config/guix/channels.scm} (@pxref{Specifying Additional Channels,,, guix, GNU Guix Reference Manual}); assuming you keep your channel local for now, the @file{channels.scm} would look something like this:
ta: அவ்வளவுதான், உங்களிடம் ஒரு சேனல் உள்ளது! அங்கிருந்து, @file{~/.config/guix/channels.scm} (@pxref{கூடுதல் சேனல்களைக் குறிப்பிடுதல்,,, guix, GNU Guix குறிப்பு Manual}) இல் இந்த சேனலை உங்கள் சேனல் உள்ளமைவில் சேர்க்கலாம்; தற்போதைக்கு உங்கள் சேனலை உள்ளூரில் வைத்திருக்கிறீர்கள் என வைத்துக் கொண்டால், @file{channels.scm} இப்படி இருக்கும்:

source: (append (list (channel (name 'my-channel) (url (string-append "file://" (getenv "HOME") "/my-channel")))) %default-channels)
ta: (சேனல்) (பட்டியல் (பெயர் 'மை-சேனல்) (url (string-append "file://" (getenv "HOME") "/மை-சேனல்")))) %இயல்பு சேனல்கள்)

source: Next time you run @command{guix pull}, your channel will be picked up and the packages it defines will be readily available to all the @command{guix} commands, even if you do not pass @option{-L}. The @command{guix describe} command will show that Guix is, indeed, using both the @code{my-channel} and the @code{guix} channels.
ta: அடுத்த முறை நீங்கள் @command{guix pull} ஐ இயக்கினால், உங்கள் சேனல் எடுக்கப்படும், மேலும் அது வரையறுக்கும் தொகுப்புகள், @option{-L} ஐ நீங்கள் கடந்து செல்லாவிட்டாலும், அனைத்து @command{guix} கட்டளைகளுக்கும் உடனடியாகக் கிடைக்கும். @command{guix describe} கட்டளை Guix உண்மையில் @code{my-channel} மற்றும் @code{guix} சேனல்கள் இரண்டையும் பயன்படுத்துகிறது என்பதைக் காட்டும்.

source: @xref{Creating a Channel,,, guix, GNU Guix Reference Manual}, for details.
ta: @xref{ஒரு சேனலை உருவாக்குதல்,,, guix, GNU Guix குறிப்பு Manual}, விவரங்களுக்கு.

source: Working directly on the Guix project is recommended: it reduces the friction when the time comes to submit your changes upstream to let the community benefit from your hard work!
ta: Guix திட்டத்தில் நேரடியாகப் பணிபுரிவது பரிந்துரைக்கப்படுகிறது: உங்களின் கடின உழைப்பால் சமூகம் பயனடைய, உங்கள் மாற்றங்களை அப்ச்ட்ரீமில் சமர்ப்பிக்க வேண்டிய நேரம் வரும்போது அது உராய்வைக் குறைக்கிறது!

source: Unlike most software distributions, the Guix repository holds in one place both the tooling (including the package manager) and the package definitions. This choice was made so that it would give developers the flexibility to modify the API without breakage by updating all packages at the same time. This reduces development inertia.
ta: பெரும்பாலான மென்பொருள் விநியோகங்களைப் போலன்றி, Guix களஞ்சியமானது கருவிகள் (தொகுப்பு மேலாளர் உட்பட) மற்றும் தொகுப்பு வரையறைகள் இரண்டையும் ஒரே இடத்தில் வைத்திருக்கிறது. அனைத்து தொகுப்புகளையும் ஒரே நேரத்தில் புதுப்பிப்பதன் மூலம் டெவலப்பர்களுக்கு பநிஇ உடையாமல் மாற்றுவதற்கான நெகிழ்வுத்தன்மையை வழங்கும் வகையில் இந்த தேர்வு செய்யப்பட்டது. இது வளர்ச்சி நிலைத்தன்மையைக் குறைக்கிறது.

source: Check out the official @uref{https://git-scm.com/, Git} repository:
ta: அதிகாரப்பூர்வ @uref{https://git-scm.com/, Git} களஞ்சியத்தைப் பார்க்கவும்:

source: $ git clone https://git.guix.gnu.org/guix.git
ta: $ git நகலி https://git.guix.gnu.org/guix.git

source: In the rest of this article, we use @samp{$GUIX_CHECKOUT} to refer to the location of the checkout.
ta: இந்தக் கட்டுரையின் எஞ்சிய பகுதியில், செக் அவுட் செய்யும் இடத்தைக் குறிப்பிடுவதற்கு @samp{$GUIX_CHECKOUT}ஐப் பயன்படுத்துகிறோம்.

source: Follow the instructions in the manual (@pxref{Contributing,,, guix, GNU Guix Reference Manual}) to set up the repository environment.
ta: களஞ்சிய சூழலை அமைக்க, கையேட்டில் உள்ள வழிமுறைகளைப் பின்பற்றவும் (@pxref{Contributing,,, guix, GNU Guix குறிப்பு Manual}).

source: Once ready, you should be able to use the package definitions from the repository environment.
ta: தயாரானதும், நீங்கள் களஞ்சிய சூழலில் இருந்து தொகுப்பு வரையறைகளைப் பயன்படுத்த முடியும்.

source: Feel free to edit package definitions found in @samp{$GUIX_CHECKOUT/gnu/packages}.
ta: @samp{$GUIX_CHECKOUT/gnu/packages} இல் காணப்படும் தொகுப்பு வரையறைகளைத் திருத்த தயங்க வேண்டாம்.

source: The @samp{$GUIX_CHECKOUT/pre-inst-env} script lets you use @samp{guix} over the package collection of the repository (@pxref{Running Guix Before It Is Installed,,, guix, GNU Guix Reference Manual}).
ta: @samp{$GUIX_CHECKOUT/pre-inst-env} ச்கிரிப்ட், களஞ்சியத்தின் தொகுப்பு சேகரிப்பில் @samp{guix} ஐப் பயன்படுத்த உங்களை அனுமதிக்கிறது (@pxref{நிறுவப்படும் முன் Guix, GNU Guix குறிப்பு Manual}).

source: Search packages, such as Ruby:
ta: ரூபி போன்ற தேடல் தொகுப்புகள்:

source: $ cd $GUIX_CHECKOUT $ ./pre-inst-env guix package --list-available=ruby ruby 1.8.7-p374 out gnu/packages/ruby.scm:119:2 ruby 2.1.6 out gnu/packages/ruby.scm:91:2 ruby 2.2.2 out gnu/packages/ruby.scm:39:2
ta: $ cd $GUIX_CHECKOUT $ ./pre-inst-env guix தொகுப்பு --list-available=ruby ரூபி 1.8.7-p374 அவுட் gnu/packages/ruby.scm:119:2 ரூபி 2.1.6 அவுட் gnu/packages/ruby.scm:91:2 ரூபி 2.2.2 அவுட் gnu/packages/ruby.scm:39:2

source: Build a package, here Ruby version 2.1:
ta: ஒரு தொகுப்பை உருவாக்கவும், இங்கே ரூபி பதிப்பு 2.1:

source: $ ./pre-inst-env guix build --keep-failed ruby@@2.1 /gnu/store/c13v73jxmj2nir2xjqaz5259zywsa9zi-ruby-2.1.6
ta: $ ./pre-inst-env guix உருவாக்கு --keep-failed ruby@@2.1 /gnu/store/c13v73jxmj2nir2xjqaz5259zywsa9zi-ruby-2.1.6

source: Install it to your user profile:
ta: உங்கள் பயனர் சுயவிவரத்தில் இதை நிறுவவும்:

source: $ ./pre-inst-env guix package --install ruby@@2.1
ta: $ ./pre-inst-env guix தொகுப்பு --ரூபியை நிறுவவும்@@2.1

source: Check for common mistakes:
ta: பொதுவான தவறுகளைச் சரிபார்க்கவும்:

source: $ ./pre-inst-env guix lint ruby@@2.1
ta: $ ./pre-inst-env பிளாச்டர் லிண்ட் ரூபி@@2.1

source: Guix strives at maintaining a high packaging standard; when contributing to the Guix project, remember to
ta: Guix உயர் பேக்கேசிங் தரத்தை பராமரிக்க பாடுபடுகிறது; Guix திட்டத்திற்கு பங்களிக்கும் போது, நினைவில் கொள்ளுங்கள்

source: follow the coding style (@pxref{Coding Style,,, guix, GNU Guix Reference Manual}),
ta: குறியீட்டு பாணியைப் பின்பற்றவும் (@pxref{Coding Style,,, guix, GNU Guix குறிப்பு Manual}),

source: and review the check list from the manual (@pxref{Submitting Patches,,, guix, GNU Guix Reference Manual}).
ta: மற்றும் கையேட்டில் இருந்து சரிபார்ப்பு பட்டியலை மதிப்பாய்வு செய்யவும் (@pxref{Submitting Patches,,, guix, GNU Guix குறிப்பு Manual}).

source: Once you are happy with the result, you are welcome to send your contribution to make it part of Guix. This process is also detailed in the manual. (@pxref{Contributing,,, guix, GNU Guix Reference Manual})
ta: முடிவில் நீங்கள் மகிழ்ச்சியடைந்தவுடன், அதை Guix இன் ஒரு பகுதியாக மாற்ற உங்கள் பங்களிப்பை அனுப்ப உங்களை வரவேற்கிறோம். இந்த செயல்முறை கையேட்டில் விரிவாக உள்ளது. (@pxref{Contributing,,, guix, GNU Guix குறிப்பு Manual})

source: It's a community effort so the more join in, the better Guix becomes!
ta: இது ஒரு சமூக முயற்சி, எனவே மேலும் சேர, சிறந்த Guix ஆகிறது!

source: The above ``Hello World'' example is as simple as it goes. Packages can be more complex than that and Guix can handle more advanced scenarios. Let's look at another, more sophisticated package (slightly modified from the source):
ta: மேலே உள்ள ``அலோ வேர்ல்ட்'' சான்று மிகவும் எளிமையானது. தொகுப்புகள் அதை விட சிக்கலானதாக இருக்கும் மற்றும் Guix மேலும் மேம்பட்ட காட்சிகளை கையாள முடியும். மற்றொரு அதிநவீன தொகுப்பைப் பார்ப்போம் (மூலத்திலிருந்து சிறிது மாற்றியமைக்கப்பட்டது):

source: (define-module (gnu packages version-control) #:use-module ((guix licenses) #:prefix license:) #:use-module (guix utils) #:use-module (guix packages) #:use-module (guix git-download) #:use-module (guix build-system cmake) #:use-module (gnu packages) #:use-module (gnu packages compression) #:use-module (gnu packages pkg-config) #:use-module (gnu packages python) #:use-module (gnu packages ssh) #:use-module (gnu packages tls) #:use-module (gnu packages web))
ta: (define-module (gnu தொகுப்புகள் பதிப்பு-கட்டுப்பாடு) #:use-module ((guix உரிமங்கள்) #:prefix உரிமம்:) #:use-module (guix utils) #:use-module (guix தொகுப்புகள்) #:பயன்படுத்தும் தொகுதி (guix git-download) #:use-module (guix build-system cmake) #:use-module (gnu தொகுப்புகள்) #:use-module (gnu தொகுப்புகள் சுருக்கம்) #:use-module (gnu தொகுப்புகள் pkg-config) #:use-module (gnu தொகுப்புகள் python) #:use-module (gnu தொகுப்புகள் ssh) #:use-module (gnu தொகுப்புகள் tls) #:use-module (gnu தொகுப்புகள் வலை))

source: (define-public my-libgit2 (let ((commit "e98d0a37c93574d2c6107bf7f31140b548c6a7bf") (revision "1")) (package (name "my-libgit2") (version (git-version "0.26.6" revision commit)) (source (origin (method git-fetch) (uri (git-reference (url "https://github.com/libgit2/libgit2/") (commit commit))) (file-name (git-file-name name version)) (sha256 (base32 "17pjvprmdrx4h6bb1hhc98w9qi6ki7yl57f090n9kbhswxqfs7s3")) (patches (search-patches "libgit2-mtime-0.patch")) (modules '((guix build utils))) ;; Remove bundled software. (snippet '(delete-file-recursively "deps")))) (build-system cmake-build-system) (outputs '("out" "debug")) (arguments `(#:tests? #true ; Run the test suite (this is the default) #:configure-flags '("-DUSE_SHA1DC=ON") ; SHA-1 collision detection #:phases (modify-phases %standard-phases (add-after 'unpack 'fix-hardcoded-paths (lambda _ (substitute* "tests/repo/init.c" (("#!/bin/sh") (string-append "#!" (which "sh")))) (substitute* "tests/clar/fs.h" (("/bin/cp") (which "cp")) (("/bin/rm") (which "rm"))))) ;; Run checks more verbosely. (replace 'check (lambda* (#:key tests? #:allow-other-keys) (when tests? (invoke "./libgit2_clar" "-v" "-Q")))) (add-after 'unpack 'make-files-writable-for-tests (lambda _ (for-each make-file-writable (find-files "."))))))) (inputs (list libssh2 http-parser python-wrapper)) (native-inputs (list pkg-config)) (propagated-inputs ;; These two libraries are in 'Requires.private' in libgit2.pc. (list openssl zlib)) (home-page "https://libgit2.github.com/") (synopsis "Library providing Git core methods") (description "Libgit2 is a portable, pure C implementation of the Git core methods provided as a re-entrant linkable library with a solid API, allowing you to write native speed custom Git applications in any language with bindings.") ;; GPLv2 with linking exception (license license:gpl2))))
ta: (define-public my-libgit2 ((கமிட் "e98d0a37c93574d2c6107bf7f31140b548c6a7bf") (திருத்தம் "1")) (தொகுப்பு (பெயர் "my-libgit2") (பதிப்பு (git-version "0.26.6" revision commit)) (ஆதாரம் (கிட்-பெட்ச் முறை) (உரி (சிட்-குறிப்பு (url "https://github.com/libgit2/libgit2/") (உறுதி உறுதி))) (கோப்பு-பெயர் (git-file-பெயர் பெயர் பதிப்பு)) (sha256 (அடிப்படை 32 "17pjvprmdrx4h6bb1hhc98w9qi6ki7yl57f090n9kbhswxqfs7s3")) (இணைப்புகள் (தேடல்-இணைப்புகள் "libgit2-mtime-0.patch")) (தொகுதிகள் '((guix உருவாக்கு utils))) ;; தொகுக்கப்பட்ட மென்பொருளை அகற்று. (துணுக்கை '(delete-file-recursively "deps")))) (கட்டுமான அமைப்பு cmake-build-system) (வெளியீடுகள் '("அவுட்" "பிழைத்திருத்தம்")) (வாதங்கள் `(#:சோதனைகளா? #உண்மை ; சோதனைத் தொகுப்பை இயக்கு (இது இயல்புநிலை) #:configure-flags '("-DUSE_SHA1DC=ON") ; SHA-1 மோதல் கண்டறிதல் #:கட்டங்கள் (மாற்று-கட்டங்கள் %தரநிலை-கட்டங்கள் (சேர்-பிறகு 'அன்பேக்' ஃபிக்ச்-ஆர்ட்கோட்-பாத்ச் (லாம்ப்டா _ (மாற்று* "tests/repo/init.c" ("#!/bin/sh") (சரம்-இணைப்பு "#!" (இது "sh")))) (மாற்று* "tests/clar/fs.h" (("/bin/cp") (இது "cp")) (("/bin/rm") (இது "rm"))))) ;; காசோலைகளை இன்னும் வாய்மொழியாக இயக்கவும். ('காசோலையை மாற்றவும் (lambda* (#:முக்கிய சோதனைகள்? #:allow-other-keys) (சோதனைகள் எப்போது? ("./libgit2_clar" "-v" "-Q")))) (சேர்-பிறகு 'அன்பேக்' செய்து-கோப்புகளை-எழுதக்கூடிய-சோதனைகளுக்கு (லாம்ப்டா _ (ஒவ்வொரு மேக்-கோப்புக்கும்-எழுதக்கூடியது (""))))))) (உள்ளீடுகள் (libssh2 http-parser python-wrapper) (சொந்த-உள்ளீடுகள் (pkg-config பட்டியல்)) (பரபரப்பு-உள்ளீடுகள் ;; இந்த இரண்டு நூலகங்களும் libgit2.pc இல் 'Requires.private' இல் உள்ளன. (list openssl zlib)) (முகப்பு பக்கம் "https://libgit2.github.com/") (சுருக்கம் "லைப்ரரி வழங்கும் சிட் கோர் முறைகள்") (விளக்கம் "Libgit2 என்பது Git கோர் முறைகளின் கையடக்க, தூய்மையான C செயலாக்கமாகும் திடமான பநிஇ உடன் மீண்டும் இணைக்கக்கூடிய நூலகமாக வழங்கப்படுகிறது, இது உங்களை அனுமதிக்கிறது சொந்த வேக தனிப்பயன் Git பயன்பாடுகளை எந்த மொழியிலும் பிணைப்புகளுடன் எழுதவும்.") ;; GPLv2 இணைப்பு விதிவிலக்கு (உரிமம் உரிமம்:gpl2)))

source: (In those cases were you only want to tweak a few fields from a package definition, you should rely on inheritance instead of copy-pasting everything. See below.)
ta: (அந்தச் சமயங்களில் நீங்கள் ஒரு தொகுப்பு வரையறையிலிருந்து சில புலங்களை மட்டும் மாற்றியமைக்க விரும்பினால், எல்லாவற்றையும் நகலெடுத்து ஒட்டுவதற்குப் பதிலாக நீங்கள் மரபுரிமையை நம்பியிருக்க வேண்டும். கீழே பார்க்கவும்.)

source: Let's discuss those fields in depth.
ta: அந்த துறைகளை ஆழமாக விவாதிப்போம்.

source: @code{git-fetch} method
ta: @code{git-fetch} முறை

source: Unlike the @code{url-fetch} method, @code{git-fetch} expects a @code{git-reference} which takes a Git repository and a commit. The commit can be any Git reference such as tags, so if the @code{version} is tagged, then it can be used directly. Sometimes the tag is prefixed with a @code{v}, in which case you'd use @code{(commit (string-append "v" version))}.
ta: @code{url-fetch} முறையைப் போலன்றி, @code{git-fetch} ஆனது @code{git-reference} ஐ எதிர்பார்க்கிறது, இது ஒரு Git களஞ்சியத்தையும் உறுதியையும் எடுக்கும். உறுதியானது குறிச்சொற்கள் போன்ற எந்த Git குறிப்பாகவும் இருக்கலாம், எனவே @code{version} குறியிடப்பட்டிருந்தால், அதை நேரடியாகப் பயன்படுத்தலாம். சில நேரங்களில் குறிச்சொல் @code{v} உடன் முன்னொட்டாக இருக்கும், இதில் நீங்கள் @code{(commit (string-append "v" பதிப்பு))} ஐப் பயன்படுத்துவீர்கள்.

source: To ensure that the source code from the Git repository is stored in a directory with a descriptive name, we use @code{(file-name (git-file-name name version))}.
ta: Git களஞ்சியத்திலிருந்து மூலக் குறியீடு ஒரு விளக்கப் பெயருடன் ஒரு கோப்பகத்தில் சேமிக்கப்படுவதை உறுதிசெய்ய, @code{(file-name (git-file-name பெயர் version))} ஐப் பயன்படுத்துகிறோம்.

source: The @code{git-version} procedure can be used to derive the version when packaging programs for a specific commit, following the Guix contributor guidelines (@pxref{Version Numbers,,, guix, GNU Guix Reference Manual}).
ta: Guix பங்களிப்பாளர் வழிகாட்டுதல்களைப் பின்பற்றி (@pxref{பதிப்பு எண்கள்,,, guix, GNU Guix குறிப்பு கையேடு}) ஒரு குறிப்பிட்ட உறுதிப்பாட்டிற்கான நிரல்களை பேக்கேசிங் செய்யும் போது பதிப்பைப் பெற @code{git-version} செயல்முறை பயன்படுத்தப்படலாம்.

source: How does one obtain the @code{sha256} hash that's in there, you ask? By invoking @command{guix hash} on a checkout of the desired commit, along these lines:
ta: அதில் உள்ள @code{sha256} ஆசை ஒருவர் எப்படிப் பெறுவது, நீங்கள் கேட்கிறீர்களா? @command{guix hash} ஐ அழைப்பதன் மூலம், விரும்பிய உறுதிப்பாட்டின் செக் அவுட்டில், பின்வரும் வழிகளில்:

source: git clone https://github.com/libgit2/libgit2/ cd libgit2 git checkout v0.26.6 guix hash -rx .
ta: git நகலி https://github.com/libgit2/libgit2/ cd libgit2 git செக்அவுட் v0.26.6 guix ஆச் -rx.

source: @command{guix hash -rx} computes a SHA256 hash over the whole directory, excluding the @file{.git} sub-directory (@pxref{Invoking guix hash,,, guix, GNU Guix Reference Manual}).
ta: @command{guix hash -rx} ஆனது @file{.git} துணை அடைவு (@pxref{Invoking guix hash,,, guix, GNU Guix குறிப்பு Manual}) தவிர்த்து, முழு கோப்பகத்திலும் SHA256 ஆசைக் கணக்கிடுகிறது.
