Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: Guix uses these kernel features to provide fully isolated environments and even complete Guix System containers, lightweight virtual machines that share the host system's kernel. This feature comes in especially handy when using Guix on a foreign distribution to prevent interference from foreign libraries or configuration files that are available system-wide.
ta: Guix இந்த கர்னல் அம்சங்களை முழுமையாக தனிமைப்படுத்தப்பட்ட சூழல்கள் மற்றும் முழுமையான Guix மண்டலம் கன்டெய்னர்கள், புரவலன் சிச்டத்தின் கர்னலைப் பகிர்ந்து கொள்ளும் இலகுரக மெய்நிகர் இயந்திரங்களை வழங்கவும் பயன்படுத்துகிறது. வெளிநாட்டு விநியோகத்தில் Guix ஐப் பயன்படுத்தும் போது, வெளிநாட்டு நூலகங்கள் அல்லது கணினி முழுவதும் கிடைக்கும் உள்ளமைவு கோப்புகளில் இருந்து குறுக்கிடுவதைத் தடுக்க இந்த நற்பொருத்தம் மிகவும் பயனுள்ளதாக இருக்கும்.

source: The easiest way to get started is to use @command{guix shell} with the @option{--container} option. @xref{Invoking guix shell,,, guix, GNU Guix Reference Manual} for a reference of valid options.
ta: @option{--container} விருப்பத்துடன் @command{guix shell} ஐப் பயன்படுத்துவது தொடங்குவதற்கான எளிதான வழியாகும். செல்லுபடியாகும் விருப்பங்களின் குறிப்புக்கு @xref{Invoking guix shell,,, guix, GNU Guix குறிப்பு Manual}.

source: The following snippet spawns a minimal shell process with most namespaces unshared from the system. The current working directory is visible to the process, but anything else on the file system is unavailable. This extreme isolation can be very useful when you want to rule out any sort of interference from environment variables, globally installed libraries, or configuration files.
ta: பின்வரும் துணுக்கு கணினியிலிருந்து பகிரப்படாத பெரும்பாலான பெயர்வெளிகளுடன் குறைந்தபட்ச செல் செயல்முறையை உருவாக்குகிறது. தற்போது செயல்படும் கோப்பகம் செயல்முறைக்கு தெரியும், ஆனால் கோப்பு முறைமையில் வேறு எதுவும் கிடைக்கவில்லை. சுற்றுச்சூழல் மாறிகள், உலகளவில் நிறுவப்பட்ட நூலகங்கள் அல்லது உள்ளமைவு கோப்புகள் ஆகியவற்றிலிருந்து எந்த வகையான குறுக்கீடுகளையும் நீங்கள் நிராகரிக்க விரும்பும் போது இந்த தீவிர தனிமைப்படுத்தல் மிகவும் பயனுள்ளதாக இருக்கும்.

source: guix shell --container
ta: பிளாச்டர் செல் --கொள்கலன்

source: It is a bleak environment, barren, desolate. You will find that not even the GNU coreutils are available here, so to explore this deserted wasteland you need to use built-in shell commands. Even the usually gigantic @file{/gnu/store} directory is reduced to a faint shadow of itself.
ta: இது ஒரு இருண்ட சூழல், தரிசு, வெறிச்சோடியது. GNU coreutils கூட இங்கு கிடைக்கவில்லை என்பதை நீங்கள் காண்பீர்கள், எனவே இந்த பாலைவனமான தரிசு நிலத்தை ஆராய நீங்கள் உள்ளமைக்கப்பட்ட செல் கட்டளைகளைப் பயன்படுத்த வேண்டும். பொதுவாக பிரமாண்டமான @file{/gnu/store} கோப்பகம் கூட மங்கலான நிழலாகக் குறைக்கப்படுகிறது.

source: exiting a container
ta: ஒரு கொள்கலனில் இருந்து வெளியேறுதல்

source: There isn't much you can do in an environment like this other than exiting it. You can use @key{^D} or @command{exit} to terminate this limited shell environment.
ta: இது போன்ற சூழலில் இருந்து வெளியேறுவதைத் தவிர உங்களால் அதிகம் செய்ய முடியாது. இந்த வரையறுக்கப்பட்ட செல் சூழலை நிறுத்த @key{^D} அல்லது @command{exit} ஐப் பயன்படுத்தலாம்.

source: exposing directories, container
ta: அம்பலப்படுத்தும் அடைவுகள், கொள்கலன்

source: sharing directories, container
ta: பகிர்வு அடைவுகள், கொள்கலன்

source: mapping locations, container
ta: மேப்பிங் இடங்கள், கொள்கலன்

source: You can make other directories available inside of the container environment; use @option{--expose=DIRECTORY} to bind-mount the given directory as a read-only location inside the container, or use @option{--share=DIRECTORY} to make the location writable. With an additional mapping argument after the directory name you can control the name of the directory inside the container. In the following example we map @file{/etc} on the host system to @file{/the/host/etc} inside a container in which the GNU coreutils are installed.
ta: கொள்கலன் சூழலின் உள்ளே மற்ற கோப்பகங்களை நீங்கள் கிடைக்கச் செய்யலாம்; @option{--expose=DIRECTORY}ஐப் பயன்படுத்தி, கொடுக்கப்பட்ட கோப்பகத்தை கன்டெய்னருக்குள் படிக்க மட்டுமேயான இடமாக இணைக்கவும் அல்லது இருப்பிடத்தை எழுதக்கூடியதாக மாற்ற @option{--share=DIRECTORY} ஐப் பயன்படுத்தவும். கோப்பகத்தின் பெயருக்குப் பிறகு கூடுதல் மேப்பிங் வாதத்துடன், கொள்கலனுக்குள் உள்ள கோப்பகத்தின் பெயரை நீங்கள் கட்டுப்படுத்தலாம். பின்வரும் எடுத்துக்காட்டில், GNU coreutils நிறுவப்பட்ட ஒரு கொள்கலனுக்குள் @file{/etc} ஐ புரவலன் சிச்டத்தில் @file{/the/host/etc} என வரைபடமாக்குவோம்.

source: $ guix shell --container --share=/etc=/the/host/etc coreutils $ ls /the/host/etc
ta: $ guix ஓடு --container --share=/etc=/the/host/etc coreutils $ ls /the/host/etc

source: Similarly, you can prevent the current working directory from being mapped into the container with the @option{--no-cwd} option. Another good idea is to create a dedicated directory that will serve as the container's home directory, and spawn the container shell from that directory.
ta: இதேபோல், @option{--no-cwd} விருப்பத்தின் மூலம் தற்போதைய வேலை செய்யும் கோப்பகம் கொள்கலனில் மேப் செய்யப்படுவதைத் தடுக்கலாம். மற்றொரு நல்ல சிந்தனை, கொள்கலனின் முகப்பு கோப்பகமாக செயல்படும் ஒரு பிரத்யேக கோப்பகத்தை உருவாக்குவது மற்றும் அந்த கோப்பகத்திலிருந்து கொள்கலன் செல் உருவாகும்.

source: hide system libraries, container
ta: கணினி நூலகங்கள், கொள்கலன் ஆகியவற்றை மறை

source: avoid ABI mismatch, container
ta: ABI பொருத்தமின்மையை தவிர்க்கவும், கொள்கலன்

source: On a foreign system a container environment can be used to compile software that cannot possibly be linked with system libraries or with the system's compiler toolchain. A common use-case in a research context is to install packages from within an R session. Outside of a container environment there is a good chance that the foreign compiler toolchain and incompatible system libraries are found first, resulting in incompatible binaries that cannot be used by R. In a container shell this problem disappears, as system libraries and executables simply aren't available due to the unshared @code{mount} namespace.
ta: ஒரு வெளிநாட்டு கணினியில், கணினி நூலகங்களுடன் அல்லது கணினியின் கம்பைலர் கருவித்தொகுப்புடன் இணைக்க முடியாத மென்பொருளைத் தொகுக்க ஒரு கொள்கலன் சூழலைப் பயன்படுத்தலாம். ஆர் அமர்வில் இருந்து தொகுப்புகளை நிறுவுவதே ஆராய்ச்சி சூழலில் பொதுவான பயன்பாடாகும். ஒரு கொள்கலன் சூழலுக்கு வெளியே வெளிநாட்டு கம்பைலர் டூல்செயின் மற்றும் இணக்கமற்ற கணினி நூலகங்கள் முதலில் கண்டறியப்படுவதற்கான நல்ல வாய்ப்புகள் உள்ளன, இதன் விளைவாக R ஆல் பயன்படுத்த முடியாத இணக்கமற்ற பைனரிகள் உருவாகின்றன. ஒரு கொள்கலன் செல்லில் இந்தச் சிக்கல் மறைந்துவிடும், ஏனெனில் பகிரப்படாத @code{mount} நேம்ச்பேச் காரணமாக கணினி நூலகங்களும் இயங்கக்கூடியவைகளும் கிடைக்காது.

source: Let's take a comprehensive manifest providing a comfortable development environment for use with R:
ta: R உடன் பயன்படுத்த வசதியான வளர்ச்சி சூழலை வழங்கும் ஒரு விரிவான மேனிஃபெச்டை எடுத்துக்கொள்வோம்:

source: (specifications->manifest (list "r-minimal"
ta: (விவரக்குறிப்புகள்->வெளிப்படை ("r-minimal" பட்டியல்

source: ;; base packages "bash-minimal" "glibc-locales" "nss-certs"
ta: ;; அடிப்படை தொகுப்புகள் "பேச்-குறைந்தபட்சம்" "glibc-locales" "nss-certs"

source: ;; Common command line tools lest the container is too empty. "coreutils" "grep" "which" "wget" "sed"
ta: ;; கொள்கலன் மிகவும் காலியாக இருக்கக்கூடாது என்பதற்காக பொதுவான கட்டளை வரி கருவிகள். "coreutils" "grep" "எது" "wget" "செட்"

source: ;; R markdown tools "pandoc"
ta: ;; ஆர் மார்க் பேரூர் கருவிகள் "பாண்டோக்"

source: ;; Toolchain and common libraries for "install.packages" "gcc-toolchain@@10" "gfortran-toolchain" "gawk" "tar" "gzip" "unzip" "make" "cmake" "pkg-config" "cairo" "libxt" "openssl" "curl" "zlib"))
ta: ;; "install.packages" க்கான டூல்செயின் மற்றும் பொதுவான நூலகங்கள் "gcc-toolchain@@10" "gfortran-toolchain" "காக்" "தார்" "சிசிப்" "அவிழ்" "செய்" "சிமேக்" "pkg-config" "கெய்ரோ" "libxt" "openssl" "சுருட்டு" "zlib"))

source: Let's use this to run R inside a container environment. For convenience we share the @code{net} namespace to use the host system's network interfaces. Now we can build R packages from source the traditional way without having to worry about ABI mismatch or incompatibilities.
ta: ஒரு கொள்கலன் சூழலில் R ஐ இயக்க இதைப் பயன்படுத்துவோம். வசதிக்காக, புரவலன் சிச்டத்தின் பிணையம் இடைமுகங்களைப் பயன்படுத்த, @code{net} நேம்ச்பேசைப் பகிர்கிறோம். இப்போது நாம் ABI பொருத்தமின்மை அல்லது இணக்கமின்மை பற்றி கவலைப்படாமல் பாரம்பரிய முறையில் மூலத்திலிருந்து R தொகுப்புகளை உருவாக்கலாம்.

source: $ guix shell --container --network --manifest=manifest.scm -- R
ta: $ guix ஓடு --container --network --manifest=manifest.scm -- R

source: R version 4.2.1 (2022-06-23) -- "Funny-Looking Kid" Copyright (C) 2022 The R Foundation for Statistical Computing @dots{} > e <- Sys.getenv("GUIX_ENVIRONMENT") > Sys.setenv(GIT_SSL_CAINFO=paste0(e, "/etc/ssl/certs/ca-certificates.crt")) > Sys.setenv(SSL_CERT_FILE=paste0(e, "/etc/ssl/certs/ca-certificates.crt")) > Sys.setenv(SSL_CERT_DIR=paste0(e, "/etc/ssl/certs")) > install.packages("Cairo", lib=paste0(getwd())) @dots{} * installing *source* package 'Cairo' ... @dots{} * DONE (Cairo)
ta: R பதிப்பு 4.2.1 (2022-06-23) -- "வேடிக்கையான தோற்றம் கொண்ட குழந்தை" பதிப்புரிமை (சி) 2022 புள்ளியியல் கம்ப்யூட்டிங்கிற்கான ஆர் அறக்கட்டளை @dots{} > இ <- Sys.getenv("GUIX_ENVIRONMENT") > Sys.setenv(GIT_SSL_CAINFO=paste0(e, "/etc/ssl/certs/ca-certificates.crt")) > Sys.setenv(SSL_CERT_FILE=paste0(e, "/etc/ssl/certs/ca-certificates.crt")) > Sys.setenv(SSL_CERT_DIR=paste0(e, "/etc/ssl/certs")) > install.packages("கெய்ரோ", lib=paste0(getwd())) @dots{} *மூல* தொகுப்பை நிறுவுகிறது 'கெய்ரோ' ... @dots{} * முடிந்தது (கெய்ரோ)

source: The downloaded source packages are in '/tmp/RtmpCuwdwM/downloaded_packages' > library("Cairo", lib=getwd()) > # success!
ta: பதிவிறக்கம் செய்யப்பட்ட மூல தொகுப்புகள் உள்ளன '/tmp/RtmpCuwdwM/downloaded_packages' > நூலகம்("கெய்ரோ", lib=getwd()) > # வெற்றி!

source: Using container shells is fun, but they can become a little cumbersome when you want to go beyond just a single interactive process. Some tasks become a lot easier when they sit on the rock solid foundation of a proper Guix System and its rich set of system services. The next section shows you how to launch a complete Guix System inside of a container.
ta: கொள்கலன் குண்டுகளைப் பயன்படுத்துவது வேடிக்கையானது, ஆனால் நீங்கள் ஒரு ஊடாடும் செயல்முறையைத் தாண்டிச் செல்ல விரும்பினால் அவை கொஞ்சம் சிரமமாக இருக்கும். சரியான Guix சிச்டம் மற்றும் அதன் செழுமையான அமைப்பு சேவைகளின் பாறை உறுதியான அடித்தளத்தில் அமர்ந்திருக்கும் போது சில பணிகள் மிகவும் எளிதாகிவிடும். ஒரு கொள்கலனுக்குள் முழுமையான Guix சிச்டத்தை எவ்வாறு தொடங்குவது என்பதை அடுத்த பகுதி காட்டுகிறது.

source: The Guix System provides a wide array of interconnected system services that are configured declaratively to form a dependable stateless GNU System foundation for whatever tasks you throw at it. Even when using Guix on a foreign distribution you can benefit from the design of Guix System by running a system instance as a container. Using the same kernel features of unshared namespaces mentioned in the previous section, the resulting Guix System instance is isolated from the host system and only shares file system locations that you explicitly declare.
ta: Guix சிச்டம் பலவிதமான ஒன்றோடொன்று இணைக்கப்பட்ட சிச்டம் சேவைகளை வழங்குகிறது, அவை நீங்கள் எந்தப் பணிகளுக்குச் சென்றாலும் நம்பகமான நிலையற்ற குனு சிச்டம் அடித்தளத்தை உருவாக்குவதற்கு பிரகடனமாக கட்டமைக்கப்படுகின்றன. வெளிநாட்டு விநியோகத்தில் Guix ஐப் பயன்படுத்தும் போது கூட, ஒரு கணினி நிகழ்வை ஒரு கொள்கலனாக இயக்குவதன் மூலம் Guix அமைப்பின் வடிவமைப்பிலிருந்து நீங்கள் பயனடையலாம். முந்தைய பிரிவில் குறிப்பிடப்பட்ட பகிரப்படாத பெயர்வெளிகளின் அதே கர்னல் அம்சங்களைப் பயன்படுத்தி, விளைவான Guix சிச்டம் நிகழ்வு புரவலன் அமைப்பிலிருந்து தனிமைப்படுத்தப்பட்டு, நீங்கள் வெளிப்படையாக அறிவிக்கும் கோப்பு முறைமை இருப்பிடங்களை மட்டுமே பகிரும்.

source: A Guix System container differs from the shell process created by @command{guix shell --container} in a number of important ways. While in a container shell the containerized process is a Bash shell process, a Guix System container runs the Shepherd as PID 1. In a system container all system services (@pxref{Services,,, guix, GNU Guix Reference Manual}) are set up just as they would be on a Guix System in a virtual machine or on bare metal---this includes daemons managed by the GNU@tie{}Shepherd (@pxref{Shepherd Services,,, guix, GNU Guix Reference Manual}) as well as other kinds of extensions to the operating system (@pxref{Service Composition,,, guix, GNU Guix Reference Manual}).
ta: பல முக்கியமான வழிகளில் @command{guix ஓடு --container} உருவாக்கிய செல் செயல்முறையிலிருந்து Guix சிச்டம் கண்டெய்னர் வேறுபடுகிறது. கன்டெய்னர் செல்லில் கொள்கலன் செய்யப்பட்ட செயல்முறையானது பாச் செல் செயல்முறையாக இருக்கும் போது, ஒரு Guix சிச்டம் கொள்கலன் செப்பர்டை PID 1 ஆக இயக்குகிறது. ஒரு கணினி கொள்கலனில் அனைத்து கணினி சேவைகளும் (@pxref{Services,,, guix, GNU Guix குறிப்பு Manual}) ஒரு Guix சிச்டத்தில் இருப்பதைப் போலவே அமைக்கப்பட்டுள்ளன. GNU@tie{}Shepherd (@pxref{Shepherd Services,,, guix, GNU Guix குறிப்பு Manual}) மற்றும் இயக்க முறைமைக்கான பிற வகையான நீட்டிப்புகள் (@pxref{சேவை கலவை,,, guix, GNU Guix குறிப்பு கையேடு}).

source: The perceived increase in complexity of running a Guix System container is easily justified when dealing with more complex applications that have higher or just more rigid requirements on their execution contexts---configuration files, dedicated user accounts, directories for caches or log files, etc. In Guix System the demands of this kind of software are satisfied through the deployment of system services.
ta: ஒரு Guix சிச்டம் கண்டெய்னரை இயக்குவதில் உள்ள சிக்கலான அதிகரிப்பு, அவற்றின் செயல்பாட்டின் சூழல்களில் அதிக அல்லது மிகவும் கடினமான தேவைகளைக் கொண்ட சிக்கலான பயன்பாடுகளைக் கையாளும் போது எளிதில் நியாயப்படுத்தப்படுகிறது - கட்டமைப்பு கோப்புகள், பிரத்யேக பயனர் கணக்குகள், தற்காலிக சேமிப்புகள் அல்லது பதிவு கோப்புகளுக்கான கோப்பகங்கள் போன்றவை.

source: A good example might be a PostgreSQL database server. Much of the complexity of setting up such a database server is encapsulated in this deceptively short service declaration:
ta: ஒரு சிறந்த சான்று PostgreSQL தரவுத்தள சேவையகமாக இருக்கலாம். அத்தகைய தரவுத்தள சேவையகத்தை அமைப்பதில் உள்ள பெரும்பாலான சிக்கலானது இந்த ஏமாற்றும் குறுகிய பணி அறிவிப்பில் இணைக்கப்பட்டுள்ளது:

source: (service postgresql-service-type (postgresql-configuration (postgresql postgresql-14)))
ta: (சேவை postgresql-service-type (postgresql-configuration (postgresql postgresql-14)))

source: A complete operating system declaration for use with a Guix System container would look something like this:
ta: Guix சிச்டம் கொள்கலனுடன் பயன்படுத்துவதற்கான முழுமையான இயக்க முறைமை அறிவிப்பு இதுபோல் இருக்கும்:

source: (use-modules (gnu)) (use-package-modules databases) (use-service-modules databases)
ta: (பயன்படுத்தும் தொகுதிகள் (gnu)) (பயன்பாடு-தொகுப்பு-தொகுதிகள் தரவுத்தளங்கள்) (பயன்பாடு-சேவை-தொகுதிகள் தரவுத்தளங்கள்)

source: (operating-system (host-name "container") (timezone "Europe/Berlin") (file-systems (cons (file-system (device (file-system-label "does-not-matter")) (mount-point "/") (type "ext4")) %base-file-systems)) (bootloader (bootloader-configuration (bootloader grub-bootloader) (targets '("/dev/sdX")))) (services (cons* (service postgresql-service-type (postgresql-configuration (postgresql postgresql-14) (config-file (postgresql-config-file (log-destination "stderr") (hba-file (plain-file "pg_hba.conf" "\ local all all trust host all all 10.0.0.1/32 trust")) (extra-config '(("listen_addresses" "*") ("log_directory" "/var/log/postgresql"))))))) (service postgresql-role-service-type (postgresql-role-configuration (roles (list (postgresql-role (name "test") (create-database? #t)))))) %base-services)))
ta: (இயக்க அமைப்பு (புரவலன்-பெயர் "கொள்கலன்") (நேர மண்டலம் "ஐரோப்பா/பெர்லின்") (கோப்பு முறைமைகள் (தீமைகள் (கோப்பு முறை (சாதனம் (கோப்பு-அமைப்பு-லேபிள் "முக்கியமில்லை")) (மவுண்ட்-பாயின்ட் "/") (வகை "ext4")) %base-file-systems)) (பூட்லோடர் (பூட்லோடர்-கட்டமைப்பு (பூட்லோடர் க்ரப்-பூட்லோடர்) (இலக்குகள் '("/dev/sdX"))) (சேவைகள் (தீமைகள்* (service postgresql-service-type (postgresql-configuration (postgresql postgresql-14) (config-file (postgresql-config-file (log-destination "stderr") (hba-file (எளிமையான கோப்பு "pg_hba.conf" "\ உள்ளக அனைத்து நம்பிக்கை அனைத்து 10.0.0.1/32 நம்பிக்கையையும் புரவலன் செய்யுங்கள்")) (கூடுதல் கட்டமைப்பு '("listen_addresses" "*") ("log_directory" "/var/log/postgresql")))))) (சேவை postgresql-role-service-type (postgresql-role-configuration (பாத்திரங்கள் (பட்டியல் (postgresql-role (பெயர் "சோதனை") (தரவுத்தளத்தை உருவாக்கவா? #t)))))) %அடிப்படை-சேவைகள்)))

source: With @code{postgresql-role-service-type} we define a role ``test'' and create a matching database, so that we can test right away without any further manual setup. The @code{postgresql-config-file} settings allow a client from IP address 10.0.0.1 to connect without requiring authentication---a bad idea in production systems, but convenient for this example.
ta: @code{postgresql-role-service-type} மூலம், ``சோதனை'' ஒரு பாத்திரத்தை வரையறுத்து, அதற்குப் பொருத்தமான தரவுத்தளத்தை உருவாக்குகிறோம், இதனால் எந்த ஒரு கைமுறை அமைப்பும் இல்லாமல் உடனடியாகச் சோதனை செய்யலாம். @code{postgresql-config-file} அமைப்புகள், IP முகவரி 10.0.0.1 இலிருந்து ஒரு கிளையண்டை அங்கீகரிப்பு தேவையில்லாமல் இணைக்க அனுமதிக்கிறது---உற்பத்தி முறைமைகளில் ஒரு தவறான சிந்தனை, ஆனால் இந்த உதாரணத்திற்கு வசதியானது.

source: Let's build a script that will launch an instance of this Guix System as a container. Write the @code{operating-system} declaration above to a file @file{os.scm} and then use @command{guix system container} to build the launcher. (@pxref{Invoking guix system,,, guix, GNU Guix Reference Manual}).
ta: இந்த Guix சிச்டத்தின் உதாரணத்தை ஒரு கொள்கலனாகத் தொடங்கும் ஒரு ச்கிரிப்டை உருவாக்குவோம். மேலே உள்ள @code{operating-system} அறிவிப்பை @file{os.scm} கோப்பில் எழுதவும், பின்னர் துவக்கியை உருவாக்க @command{guix system container} ஐப் பயன்படுத்தவும். (@pxref{Invoking guix system,,, guix, GNU Guix குறிப்பு Manual}).

source: $ guix system container os.scm The following derivations will be built: /gnu/store/@dots{}-run-container.drv @dots{} building /gnu/store/@dots{}-run-container.drv... /gnu/store/@dots{}-run-container
ta: $ guix அமைப்பு கொள்கலன் os.scm பின்வரும் வழித்தோன்றல்கள் உருவாக்கப்படும்: /gnu/store/@dots{}-run-container.drv @dots{} கட்டிடம் /gnu/store/@dots{}-run-container.drv... /gnu/store/@dots{}-run-container

source: Now that we have a launcher script we can run it to spawn the new system with a running PostgreSQL service. Note that due to some as yet unresolved limitations we need to run the launcher as the root user, for example with @command{sudo}.
ta: இப்போது எங்களிடம் லாஞ்சர் ச்கிரிப்ட் இருப்பதால், இயங்கும் PostgreSQL சேவையுடன் புதிய அமைப்பை உருவாக்க அதை இயக்கலாம். இன்னும் தீர்க்கப்படாத சில வரம்புகள் காரணமாக நாம் துவக்கியை ரூட் பயனராக இயக்க வேண்டும், எடுத்துக்காட்டாக @command{sudo} உடன்.

source: $ sudo /gnu/store/@dots{}-run-container system container is running as PID 5983 @dots{}
ta: $ sudo /gnu/store/@dots{}-run-container கணினி கொள்கலன் PID 5983 ஆக இயங்குகிறது @dots{}

source: Background the process with @key{Ctrl-z} followed by @command{bg}. Note the process ID in the output; we will need it to connect to the container later. You know what? Let's try attaching to the container right now. We will use @command{nsenter}, a tool provided by the @code{util-linux} package:
ta: @key{Ctrl-z} ஐத் தொடர்ந்து @command{bg}ஐக் கொண்டு செயல்முறையை பின்னணியில் அமைக்கவும். வெளியீட்டில் செயல்முறை ஐடியைக் கவனியுங்கள்; பின்னர் கொள்கலனுடன் இணைக்க இது தேவைப்படும். என்ன தெரியுமா? இப்போது கொள்கலனில் இணைக்க முயற்சிப்போம். @code{util-linux} தொகுப்பின் மூலம் வழங்கப்படும் @command{nsenter} என்ற கருவியைப் பயன்படுத்துவோம்:

source: $ guix shell util-linux $ sudo nsenter -a -t 5983 root@@container /# pgrep -a postgres 49 /gnu/store/@dots{}-postgresql-14.4/bin/postgres -D /var/lib/postgresql/data --config-file=/gnu/store/@dots{}-postgresql.conf -p 5432 51 postgres: checkpointer 52 postgres: background writer 53 postgres: walwriter 54 postgres: autovacuum launcher 55 postgres: stats collector 56 postgres: logical replication launcher root@@container /# exit
ta: $ guix செல் util-linux $ sudo nsenter -a -t 5983 ரூட்@@ கொள்கலன் /# pgrep -a postgres 49 /gnu/store/@dots{}-postgresql-14.4/bin/postgres -D /var/lib/postgresql/data --config-file=/gnu/store/@dots{}-postgresql.conf -p 5432 51 postgres: சோதனைச் சாவடி 52 postgres: பின்னணி எழுத்தாளர் 53 postgres: வால்ரைட்டர் 54 postgres: autovacuum launcher 55 postgres: புள்ளிவிவர சேகரிப்பாளர் 56 போச்ட்கிரெச்: லாசிக்கல் ரெப்ளிகேசன் லாஞ்சர் ரூட்@@ கொள்கலன் /# வெளியேறு

source: The PostgreSQL service is running in the container!
ta: PostgreSQL பணி கொள்கலனில் இயங்குகிறது!

source: container networking
ta: கொள்கலன் நெட்வொர்க்கிங்

source: What good is a Guix System running a PostgreSQL database service as a container when we can only talk to it with processes originating in the container? It would be much better if we could talk to the database over the network.
ta: போச்ட்கிரெச்க்யூஎல் தரவுத்தள சேவையை ஒரு கொள்கலனாக இயக்கும் Guix சிச்டம், கொள்கலனில் தோன்றும் செயல்முறைகளுடன் மட்டுமே நாம் அதனுடன் பேச முடியும் என்றால் என்ன பயன்? பிணையம் மூலம் தரவுத்தளத்துடன் பேசினால் அது மிகவும் சிறப்பாக இருக்கும்.

source: The easiest way to do this is to create a pair of connected virtual Ethernet devices (known as @code{veth}). We move one of the devices (@code{ceth-test}) into the @code{net} namespace of the container and leave the other end (@code{veth-test}) of the connection on the host system.
ta: இதைச் செய்வதற்கான எளிதான வழி, இணைக்கப்பட்ட மெய்நிகர் ஈதர்நெட் சாதனங்களை (@code{veth} என அறியப்படுகிறது) உருவாக்குவதாகும். சாதனங்களில் ஒன்றை (@code{ceth-test}) கண்டெய்னரின் @code{net} நேம்ச்பேசுக்கு நகர்த்தி, இணைப்பின் மறுமுனையை (@code{veth-test}) புரவலன் சிச்டத்தில் விட்டுவிடுவோம்.

source: pid=5983 ns="guix-test" host="veth-test" client="ceth-test"
ta: pid=5983 ns="guix-test" host="veth-test" கிளையன்ட்="செத்-டெச்ட்"

source: # Attach the new net namespace "guix-test" to the container PID. sudo ip netns attach $ns $pid
ta: # புதிய நிகர பெயர்வெளி "guix-test" ஐ கொள்கலன் PID உடன் இணைக்கவும். sudo ip netns இணைக்கவும் $ns $pid

source: # Create the pair of devices sudo ip link add $host type veth peer name $client
ta: # இணை சாதனங்களை உருவாக்கவும் sudo ip இணைப்பு $host வகை veth ஒப்பி பெயர் $client ஐச் சேர்க்கவும்

source: # Move the client device into the container's net namespace sudo ip link set $client netns $ns
ta: # கிளையன்ட் சாதனத்தை கொள்கலனின் நிகர பெயர்வெளியில் நகர்த்தவும் sudo ip இணைப்பு தொகுப்பு $client netns $ns

source: Then we configure the host side:
ta: பின்னர் புரவலன் பக்கத்தை உள்ளமைக்கிறோம்:

source: sudo ip link set $host up sudo ip addr add 10.0.0.1/24 dev $host
ta: sudo ip இணைப்பு $host மேலே அமைக்கப்பட்டது sudo ip addr 10.0.0.1/24 dev $host ஐ சேர்க்கவும்

source: @dots{}and then we configure the client side:
ta: @dots{}பின்னர் நாங்கள் கிளையன்ட் பக்கத்தை உள்ளமைக்கிறோம்:

source: sudo ip netns exec $ns ip link set lo up sudo ip netns exec $ns ip link set $client up sudo ip netns exec $ns ip addr add 10.0.0.2/24 dev $client
ta: sudo ip netns exec $ns ஐபி இணைப்பை அமைக்கவும் sudo ip netns exec $ns ip இணைப்பு $கிளையண்ட் அப் அமைக்கிறது sudo ip netns exec $ns ip addr சேர் 10.0.0.2/24 dev $client

source: At this point the host can reach the container at IP address 10.0.0.2, and the container can reach the host at IP 10.0.0.1. This is all we need to talk to the database server inside the container from the host system on the outside.
ta: இந்த கட்டத்தில் புரவலன் IP முகவரி 10.0.0.2 இல் கொள்கலனை அடையலாம், மேலும் கொள்கலன் IP 10.0.0.1 இல் ஓச்டை அடையலாம். வெளியில் உள்ள புரவலன் சிச்டத்தில் இருந்து கண்டெய்னருக்குள் இருக்கும் டேட்டாபேச் சர்வருடன் நாம் பேச வேண்டியது இதுதான்.

source: $ psql -h 10.0.0.2 -U test psql (14.4) Type "help" for help.
ta: $ psql -h 10.0.0.2 -U சோதனை psql (14.4) உதவிக்கு "உதவி" என தட்டச்சு செய்யவும்.
