Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: chain forward @{ type filter hook forward priority filter; policy drop; # Add your existing forwarding rules here... iifname virbr0 accept comment \"allow outbound traffic from virbr0\" oifname virbr0 ct state @{established, related @} accept \\ comment \"allow established traffic to virbr0\" @}
ta: சங்கிலி முன்னோக்கி @{ வகை வடிகட்டி ஊக் முன்னோக்கி முன்னுரிமை வடிகட்டி; கொள்கை வீழ்ச்சி; # உங்கள் தற்போதைய முன்னனுப்புதல் விதிகளை இங்கே சேர்க்கவும்... iifname virbr0 கருத்தை ஏற்கவும் \"virbr0 இலிருந்து வெளிச்செல்லும் போக்குவரத்தை அனுமதிக்கவும்\" oifname virbr0 ct நிலை @{ நிறுவப்பட்டது, தொடர்புடைய @} ஏற்கவும் \\ \"virbr0 க்கு நிறுவப்பட்ட போக்குவரத்தை அனுமதி\" கருத்து @}

source: table inet nat @{ chain postrouting @{ type nat hook postrouting priority srcnat; policy accept; # Add your existing nat rules here... iifname virbr0 ip daddr @{ 224.0.0.0/24, 255.255.255.255/32 @} return \\ comment \"don't masquerade to reserved address blocks\" iifname virbr0 oifname != virbr0 masquerade \\ comment \"masquerade all outgoing traffic from VMs\" @} @} "))))
ta: டேபிள் இன்ட் நாட் @{ செயின் போச்ட்ரூட்டிங் @{ வகை நாட் ஊக் போச்ட்ரூட்டிங் முன்னுரிமை srcnat; கொள்கை ஏற்றுக்கொள்வது; # உங்கள் தற்போதைய நாட் விதிகளை இங்கே சேர்க்கவும்... iifname virbr0 ip daddr @{ 224.0.0.0/24, 255.255.255.255/32 @} திரும்ப \\ \"முன்பதிவு செய்யப்பட்ட முகவரித் தொகுதிகளுக்கு மாறுவேடமிட வேண்டாம்\" என்று கருத்துத் தெரிவிக்கவும் iifname virbr0 oifname != virbr0 முகமூடி \\ \"VM களில் இருந்து வெளிச்செல்லும் அனைத்து போக்குவரத்தையும் மறைக்கவும்\" கருத்து @} @} "))))

source: Ensure that you have IPv4 forwarding enabled (you can use @code{sysctl-service-type} for this).
ta: நீங்கள் IPv4 முன்னனுப்புதல் இயக்கப்பட்டிருப்பதை உறுதிசெய்யவும் (இதற்கு நீங்கள் @code{sysctl-service-type} ஐப் பயன்படுத்தலாம்).

source: VM References
ta: VM குறிப்புகள்

source: @uref{https://jamielinux.com/docs/libvirt-networking-handbook/index.html, The (unofficial) libvirt Networking Handbook}@* Note that this resource is rather outdated at the time of writing (as of March 2025, it was last updated in 2015). Nevertheless, the authors of this chapter have found it to be a valuable source of information.
ta: @uref{https://jamielinux.com/docs/libvirt-networking-handbook/index.html, (அதிகாரப்பூர்வமற்ற) libvirt நெட்வொர்க்கிங் கையேடு}@* இந்த சான்று எழுதும் நேரத்தில் காலாவதியானது என்பதை நினைவில் கொள்ளவும் (மார்ச் 2025 இல், இது கடைசியாக 2015 இல் புதுப்பிக்கப்பட்டது). ஆயினும்கூட, இந்த அத்தியாயத்தின் ஆசிரியர்கள் இது ஒரு மதிப்புமிக்க தகவலாக இருப்பதைக் கண்டறிந்துள்ளனர்.

source: Guix is a functional package manager that offers many features beyond what more traditional package managers can do. To the uninitiated, those features might not have obvious use cases at first. The purpose of this chapter is to demonstrate some advanced package management concepts.
ta: Guix என்பது ஒரு செயல்பாட்டு தொகுப்பு மேலாளர் ஆகும், இது பாரம்பரிய தொகுப்பு மேலாளர்கள் என்ன செய்ய முடியும் என்பதைத் தாண்டி பல அம்சங்களை வழங்குகிறது. தொடங்காதவர்களுக்கு, அந்த அம்சங்களில் முதலில் வெளிப்படையான பயன்பாட்டு நிகழ்வுகள் இருக்காது. இந்த அத்தியாயத்தின் நோக்கம் சில மேம்பட்ட தொகுப்பு மேலாண்மை கருத்துகளை விளக்குவதாகும்.

source: @pxref{Package Management,,, guix, GNU Guix Reference Manual} for a complete reference.
ta: முழுமையான குறிப்புக்கு @pxref{Package Management,,, guix, GNU Guix குறிப்பு Manual}.

source: Guix provides a very useful feature that may be quite foreign to newcomers: @dfn{profiles}. They are a way to group package installations together and all users on the same system are free to use as many profiles as they want.
ta: Guix மிகவும் பயனுள்ள அம்சத்தை வழங்குகிறது, இது புதியவர்களுக்கு மிகவும் அந்நியமாக இருக்கலாம்: @dfn{profiles}. அவை தொகுப்பு நிறுவல்களை ஒன்றாகக் குழுவாக்குவதற்கான ஒரு வழியாகும் மற்றும் ஒரே கணினியில் உள்ள அனைத்து பயனர்களும் அவர்கள் விரும்பும் பல சுயவிவரங்களைப் பயன்படுத்த இலவசம்.

source: Whether you're a developer or not, you may find that multiple profiles bring you great power and flexibility. While they shift the paradigm somewhat compared to @emph{traditional package managers}, they are very convenient to use once you've understood how to set them up.
ta: நீங்கள் டெவலப்பராக இருந்தாலும் இல்லாவிட்டாலும், பல சுயவிவரங்கள் உங்களுக்கு சிறந்த ஆற்றலையும் நெகிழ்வுத்தன்மையையும் தருவதை நீங்கள் காணலாம். @emph{traditional package managers} ஒப்பிடும்போது அவை முன்னுதாரணத்தை ஓரளவு மாற்றினாலும், அவற்றை எவ்வாறு அமைப்பது என்பதை நீங்கள் புரிந்துகொண்டவுடன் பயன்படுத்த மிகவும் வசதியாக இருக்கும்.

source: This section is an opinionated guide on the use of multiple profiles. It predates @command{guix shell} and its fast profile cache (@pxref{Invoking guix shell,,, guix, GNU Guix Reference Manual}).
ta: இந்தப் பிரிவு பல சுயவிவரங்களைப் பயன்படுத்துவது குறித்த கருத்துள்ள வழிகாட்டியாகும். இது @command{guix shell} மற்றும் அதன் வேகமான சுயவிவர கேச் (@pxref{Invoking guix shell,,, guix, GNU Guix குறிப்பு Manual}) ஆகியவற்றிற்கு முந்தையது.

source: In many cases, you may find that using @command{guix shell} to set up the environment you need, when you need it, is less work that maintaining a dedicated profile. Your call!
ta: பல சந்தர்ப்பங்களில், உங்களுக்குத் தேவையான சூழலை அமைக்க @command{guix shell}ஐப் பயன்படுத்துவது, உங்களுக்குத் தேவைப்படும்போது, பிரத்யேக சுயவிவரத்தைப் பராமரிப்பது குறைவான வேலையாக இருப்பதை நீங்கள் காணலாம். உங்கள் அழைப்பு!

source: If you are familiar with Python's @samp{virtualenv}, you can think of a profile as a kind of universal @samp{virtualenv} that can hold any kind of software whatsoever, not just Python software. Furthermore, profiles are self-sufficient: they capture all the runtime dependencies which guarantees that all programs within a profile will always work at any point in time.
ta: பைதான் இன் @samp{virtualenv} உங்களுக்குத் தெரிந்திருந்தால், பைதான் மென்பொருளை மட்டுமின்றி, எந்த வகையான மென்பொருளையும் வைத்திருக்கக்கூடிய உலகளாவிய @samp{virtualenv} சுயவிவரத்தைப் பற்றி நீங்கள் நினைக்கலாம். மேலும், சுயவிவரங்கள் தன்னிறைவு பெற்றவை: அவை அனைத்து இயக்க நேர சார்புகளையும் கைப்பற்றுகின்றன, இது ஒரு சுயவிவரத்தில் உள்ள அனைத்து நிரல்களும் எப்போதும் எந்த நேரத்திலும் வேலை செய்யும் என்று பொறுப்பு அளிக்கிறது.

source: Multiple profiles have many benefits:
ta: பல சுயவிவரங்கள் பல நன்மைகளைக் கொண்டுள்ளன:

source: Clean semantic separation of the various packages a user needs for different contexts.
ta: வெவ்வேறு சூழல்களுக்கு ஒரு பயனருக்குத் தேவைப்படும் பல்வேறு தொகுப்புகளின் தூய்மையான சொற்பொருள் பிரிப்பு.

source: Multiple profiles can be made available into the environment either on login or within a dedicated shell.
ta: உள்நுழைவு அல்லது பிரத்யேக செல்லுக்குள் பல சுயவிவரங்கள் சூழலில் கிடைக்கச் செய்யலாம்.

source: Profiles can be loaded on demand. For instance, the user can use multiple shells, each of them running different profiles.
ta: சுயவிவரங்களை தேவைக்கேற்ப ஏற்றலாம். உதாரணமாக, பயனர் பல செல்களைப் பயன்படுத்தலாம், அவை ஒவ்வொன்றும் வெவ்வேறு சுயவிவரங்களை இயக்குகின்றன.

source: Isolation: Programs from one profile will not use programs from the other, and the user can even install different versions of the same programs to the two profiles without conflict.
ta: தனிமைப்படுத்தல்: ஒரு சுயவிவரத்திலிருந்து நிரல்கள் மற்றொன்றிலிருந்து நிரல்களைப் பயன்படுத்தாது, மேலும் பயனர் முரண்பாடு இல்லாமல் இரண்டு சுயவிவரங்களுக்கும் ஒரே நிரல்களின் வெவ்வேறு பதிப்புகளை நிறுவலாம்.

source: Deduplication: Profiles share dependencies that happens to be the exact same. This makes multiple profiles storage-efficient.
ta: இரட்டிப்பு: சுயவிவரங்கள் ஒரே மாதிரியான சார்புகளைப் பகிர்ந்து கொள்கின்றன. இது பல சுயவிவரங்களை சேமிப்பக-திறனுள்ளதாக்குகிறது.

source: Reproducible: when used with declarative manifests, a profile can be fully specified by the Guix commit that was active when it was set up. This means that the exact same profile can be @uref{https://guix.gnu.org/blog/2018/multi-dimensional-transactions-and-rollbacks-oh-my/, set up anywhere and anytime}, with just the commit information. See the section on @ref{Reproducible profiles}.
ta: மறுஉருவாக்கம் செய்யக்கூடியது: பிரகடன வெளிப்பாட்டுடன் பயன்படுத்தப்படும் போது, அது அமைக்கப்பட்ட போது செயலில் இருந்த Guix கமிட் மூலம் சுயவிவரத்தை முழுமையாகக் குறிப்பிட முடியும். அதாவது, அதே சுயவிவரம் @uref{https://guix.gnu.org/blog/2018/multi-dimensional-transactions-and-rollbacks-oh-my/, எங்கு வேண்டுமானாலும் எப்போது வேண்டுமானாலும் அமைக்கப்படும்}, உறுதியளிக்கும் தகவலுடன். @ref{Reproducible profiles} இல் உள்ள பகுதியைப் பார்க்கவும்.

source: Easier upgrades and maintenance: Multiple profiles make it easy to keep package listings at hand and make upgrades completely frictionless.
ta: எளிதான மேம்படுத்தல்கள் மற்றும் பராமரிப்பு: பல சுயவிவரங்கள் தொகுப்பு பட்டியல்களை கையில் வைத்திருப்பதை எளிதாக்குகிறது மற்றும் மேம்படுத்தல்களை முற்றிலும் உராய்வில்லாமல் செய்கிறது.

source: Concretely, here follows some typical profiles:
ta: உறுதியாக, இங்கே சில பொதுவான சுயவிவரங்கள் பின்வருமாறு:

source: The dependencies of a project you are working on.
ta: நீங்கள் பணிபுரியும் திட்டத்தின் சார்புநிலைகள்.

source: Your favourite programming language libraries.
ta: உங்களுக்கு பிடித்த நிரலாக்க மொழி நூலகங்கள்.

source: Laptop-specific programs (like @samp{powertop}) that you don't need on a desktop.
ta: டெச்க்டாப்பில் உங்களுக்குத் தேவையில்லாத லேப்டாப் சார்ந்த நிரல்கள் (@samp{powertop} போன்றவை).

source: @TeX{}live (this one can be really useful when you need to install just one package for this one document you've just received over email).
ta: @TeX{}நேரலையில் (மின்னஞ்சலில் நீங்கள் பெற்ற இந்த ஆவணத்திற்கு ஒரு தொகுப்பை மட்டும் நிறுவ வேண்டியிருக்கும் போது இது மிகவும் பயனுள்ளதாக இருக்கும்).

source: Games.
ta: விளையாட்டுகள்.

source: Let's dive in the set up!
ta: அமைப்பில் மூழ்குவோம்!

source: A Guix profile can be set up @i{via} a @dfn{manifest}. A manifest is a snippet of Scheme code that specifies the set of packages you want to have in your profile; it looks like this:
ta: Guix சுயவிவரத்தை @i{via} a @dfn{manifest} அமைக்கலாம். மேனிஃபெச்ட் என்பது உங்கள் சுயவிவரத்தில் நீங்கள் வைத்திருக்க விரும்பும் தொகுப்புகளின் தொகுப்பைக் குறிப்பிடும் திட்டக் குறியீட்டின் துணுக்கு ஆகும்; இது போல் தெரிகிறது:

source: (specifications->manifest '("package-1" ;; Version 1.3 of package-2. "package-2@@1.3" ;; The "lib" output of package-3. "package-3:lib" ; ... "package-N"))
ta: (விவரக்குறிப்புகள்->வெளிப்படை '("தொகுப்பு-1" ;; தொகுப்பு-2 இன் பதிப்பு 1.3. "தொகுப்பு-2@@1.3" ;; தொகுப்பு-3 இன் "லிப்" வெளியீடு. "தொகுப்பு-3:லிப்" ; ... "தொகுப்பு-N"))

source: @xref{Writing Manifests,,, guix, GNU Guix Reference Manual}, for more information about the syntax.
ta: @xref{Writing Manifests,,, guix, GNU Guix குறிப்பு Manual}, தொடரியல் பற்றிய கூடுதல் தகவலுக்கு.

source: We can create a manifest specification per profile and install them this way:
ta: ஒவ்வொரு சுயவிவரத்திற்கும் ஒரு வெளிப்படையான விவரக்குறிப்பை உருவாக்கலாம் மற்றும் அவற்றை இந்த வழியில் நிறுவலாம்:

source: GUIX_EXTRA_PROFILES=$HOME/.guix-extra-profiles mkdir -p "$GUIX_EXTRA_PROFILES"/my-project # if it does not exist yet guix package --manifest=/path/to/guix-my-project-manifest.scm \ --profile="$GUIX_EXTRA_PROFILES"/my-project/my-project
ta: GUIX_EXTRA_PROFILES=$HOME/.guix-extra-profiles mkdir -p "$GUIX_EXTRA_PROFILES"/my-project # அது இன்னும் இல்லை என்றால் guix தொகுப்பு --manifest=/path/to/guix-my-project-manifest.scm \ --profile="$GUIX_EXTRA_PROFILES"/my-project/my-project

source: Here we set an arbitrary variable @samp{GUIX_EXTRA_PROFILES} to point to the directory where we will store our profiles in the rest of this article.
ta: இந்தக் கட்டுரையின் எஞ்சிய பகுதியில் எங்களின் சுயவிவரங்களைச் சேமிக்கும் கோப்பகத்தைக் குறிக்க, இங்கே @samp{GUIX_EXTRA_PROFILES} என்ற தன்னிச்சையான மாறியை அமைத்துள்ளோம்.

source: Placing all your profiles in a single directory, with each profile getting its own sub-directory, is somewhat cleaner. This way, each sub-directory will contain all the symlinks for precisely one profile. Besides, ``looping over profiles'' becomes obvious from any programming language (e.g.@: a shell script) by simply looping over the sub-directories of @samp{$GUIX_EXTRA_PROFILES}.
ta: உங்கள் எல்லா சுயவிவரங்களையும் ஒரே கோப்பகத்தில் வைப்பது, ஒவ்வொரு சுயவிவரமும் அதன் சொந்த துணை கோப்பகத்தைப் பெறுவது ஓரளவு தூய்மையானது. இந்த வழியில், ஒவ்வொரு துணை கோப்பகமும் துல்லியமாக ஒரு சுயவிவரத்திற்கான அனைத்து சிம்லிங்க்களையும் கொண்டிருக்கும். அதுமட்டுமின்றி, @samp{$GUIX_EXTRA_PROFILES} இன் துணை அடைவுகளில் லூப் செய்வதன் மூலம், எந்த நிரலாக்க மொழியிலிருந்தும் (எ.கா.@: செல் ச்கிரிப்ட்) ``சுயவிவரங்களின் மீது லூப்பிங்' என்பது தெளிவாகிறது.

source: Note that it's also possible to loop over the output of
ta: அவுட்புட்டின் மேல் லூப் செய்யவும் முடியும் என்பதை நினைவில் கொள்ளவும்

source: guix package --list-profiles
ta: guix தொகுப்பு --list-profiles

source: although you'll probably have to filter out @file{~/.config/guix/current}.
ta: நீங்கள் @file{~/.config/guix/current}ஐ வடிகட்ட வேண்டியிருக்கும்.

source: To enable all profiles on login, add this to your @file{~/.bash_profile} (or similar):
ta: உள்நுழைவில் உள்ள அனைத்து சுயவிவரங்களையும் இயக்க, இதை உங்கள் @file{~/.bash_profile} இல் சேர்க்கவும் (அல்லது இது போன்ற):

source: for i in $GUIX_EXTRA_PROFILES/*; do profile=$i/$(basename "$i") if [ -f "$profile"/etc/profile ]; then GUIX_PROFILE="$profile" . "$GUIX_PROFILE"/etc/profile fi unset profile done
ta: நான் $GUIX_EXTRA_PROFILES/* இல்; செய்ய சுயவிவரம்=$i/$(அடிப்படை பெயர் "$i") என்றால் [ -f "$profile"/etc/profile ]; பிறகு GUIX_PROFILE="$profile" . "$GUIX_PROFILE"/etc/profile fi சுயவிவரத்தை அமைக்கவில்லை முடிந்தது

source: Note to Guix System users: the above reflects how your default profile @file{~/.guix-profile} is activated from @file{/etc/profile}, that latter being loaded by @file{~/.bashrc} by default.
ta: Guix சிச்டம் பயனர்களுக்கு குறிப்பு: @file{/etc/profile} இலிருந்து உங்கள் இயல்புநிலை சுயவிவரம் @file{~/.guix-profile} எவ்வாறு செயல்படுத்தப்படுகிறது என்பதை மேலே விவரிக்கிறது, அது இயல்பாகவே @file{~/.bashrc} மூலம் ஏற்றப்படும்.

source: You can obviously choose to only enable a subset of them:
ta: அவற்றின் துணைக்குழுவை மட்டும் இயக்குவதற்கு நீங்கள் வெளிப்படையாகத் தேர்வுசெய்யலாம்:

source: for i in "$GUIX_EXTRA_PROFILES"/my-project-1 "$GUIX_EXTRA_PROFILES"/my-project-2; do profile=$i/$(basename "$i") if [ -f "$profile"/etc/profile ]; then GUIX_PROFILE="$profile" . "$GUIX_PROFILE"/etc/profile fi unset profile done
ta: நான் "$GUIX_EXTRA_PROFILES"/my-project-1 "$GUIX_EXTRA_PROFILES"/my-project-2; செய்ய சுயவிவரம்=$i/$(அடிப்படை பெயர் "$i") என்றால் [ -f "$profile"/etc/profile ]; பிறகு GUIX_PROFILE="$profile" . "$GUIX_PROFILE"/etc/profile fi சுயவிவரத்தை அமைக்கவில்லை முடிந்தது

source: When a profile is off, it's straightforward to enable it for an individual shell without "polluting" the rest of the user session:
ta: சுயவிவரம் முடக்கப்பட்டிருக்கும் போது, பயனர் அமர்வின் எஞ்சிய பகுதியை "மாசுபடுத்தாமல்" தனிப்பட்ட செல்லுக்காக அதை இயக்குவது நேரடியானது:

source: GUIX_PROFILE="path/to/my-project" ; . "$GUIX_PROFILE"/etc/profile
ta: GUIX_PROFILE="பாதை/எனது திட்டம்" ; . "$GUIX_PROFILE"/etc/profile

source: The key to enabling a profile is to @emph{source} its @samp{etc/profile} file. This file contains shell code that exports the right environment variables necessary to activate the software contained in the profile. It is built automatically by Guix and meant to be sourced. It contains the same variables you would get if you ran:
ta: சுயவிவரத்தை இயக்குவதற்கான திறவுகோல் @emph{source} அதன் @samp{etc/profile} கோப்பாகும். இந்த கோப்பில் செல் குறியீடு உள்ளது, இது சுயவிவரத்தில் உள்ள மென்பொருளை செயல்படுத்த தேவையான சரியான சூழல் மாறிகளை ஏற்றுமதி செய்கிறது. இது Guix ஆல் தானாக கட்டமைக்கப்பட்டது மற்றும் ஆதாரமாக உள்ளது. நீங்கள் ஓடினால் கிடைக்கும் அதே மாறிகள் இதில் உள்ளன:

source: guix package --search-paths=prefix --profile=$my_profile"
ta: guix தொகுப்பு --search-paths=prefix --profile=$my_profile"

source: Once again, see @ref{Invoking guix package,,, guix, GNU Guix Reference Manual} for the command line options.
ta: மீண்டும் ஒருமுறை, கட்டளை வரி விருப்பங்களுக்கு @ref{Invoking guix தொகுப்பு,,, guix, GNU Guix குறிப்பு Manual} ஐப் பார்க்கவும்.

source: To upgrade a profile, simply install the manifest again:
ta: சுயவிவரத்தை மேம்படுத்த, மெனிஃபெச்டை மீண்டும் நிறுவவும்:

source: guix package -m /path/to/guix-my-project-manifest.scm \ -p "$GUIX_EXTRA_PROFILES"/my-project/my-project
ta: guix தொகுப்பு -m /path/to/guix-my-project-manifest.scm \ -p "$GUIX_EXTRA_PROFILES"/my-project/my-project

source: To upgrade all profiles, it's easy enough to loop over them. For instance, assuming your manifest specifications are stored in @file{~/.guix-manifests/guix-$profile-manifest.scm}, with @samp{$profile} being the name of the profile (e.g.@: "project1"), you could do the following in Bourne shell:
ta: எல்லா சுயவிவரங்களையும் மேம்படுத்த, அவற்றின் மீது லூப் செய்வது போதுமானது. எடுத்துக்காட்டாக, உங்கள் மேனிஃபெச்ட் விவரக்குறிப்புகள் @file{~/.guix-manifests/guix-$profile-manifest.scm} இல் சேமிக்கப்பட்டதாகக் கருதி, @samp{$profile} என்பது சுயவிவரத்தின் பெயராக (எ.கா.@: "project1") இருப்பதால், பின்வருவனவற்றை நீங்கள் Bourne செல்லில் செய்யலாம்:

source: for profile in "$GUIX_EXTRA_PROFILES"/*; do guix package --profile="$profile" \ --manifest="$HOME/.guix-manifests/guix-$profile-manifest.scm" done
ta: சுயவிவரத்திற்கு "$GUIX_EXTRA_PROFILES"/*; கொடுக்க guix தொகுப்பு --profile="$profile" \ --manifest="$HOME/.guix-manifests/guix-$profile-manifest.scm" கொடுக்கப்பட்டது

source: Each profile has its own generations:
ta: ஒவ்வொரு சுயவிவரத்திற்கும் அதன் சொந்த தலைமுறைகள் உள்ளன:

source: guix package -p "$GUIX_EXTRA_PROFILES"/my-project/my-project --list-generations
ta: guix தொகுப்பு -p "$GUIX_EXTRA_PROFILES"/my-project/my-project --list-generations

source: You can roll-back to any generation of a given profile:
ta: கொடுக்கப்பட்ட சுயவிவரத்தின் எந்த தலைமுறைக்கும் நீங்கள் திரும்பப் பெறலாம்:

source: guix package -p "$GUIX_EXTRA_PROFILES"/my-project/my-project --switch-generations=17
ta: guix தொகுப்பு -p "$GUIX_EXTRA_PROFILES"/my-project/my-project --switch-generations=17

source: Finally, if you want to switch to a profile without inheriting from the current environment, you can activate it from an empty shell:
ta: இறுதியாக, தற்போதைய சூழலில் இருந்து பெறாமல் சுயவிவரத்திற்கு மாற விரும்பினால், அதை வெற்று செல்லில் இருந்து செயல்படுத்தலாம்:

source: env -i $(which bash) --login --noprofile --norc . my-project/etc/profile
ta: env -i $(எந்த பாச்) --login --noprofile --norc . my-project/etc/profile

source: Activating a profile essentially boils down to exporting a bunch of environmental variables. This is the role of the @samp{etc/profile} within the profile.
ta: ஒரு சுயவிவரத்தை செயல்படுத்துவது, சுற்றுச்சூழலுக்கான மாறுபாடுகளின் ஒரு கூட்டத்தை ஏற்றுமதி செய்வதில் முக்கியமாக கொதிக்கிறது. இது சுயவிவரத்தில் உள்ள @samp{etc/profile} இன் பங்கு.

source: Note: Only the environmental variables of the packages that consume them will be set.
ta: குறிப்பு: அவற்றை உட்கொள்ளும் தொகுப்புகளின் சுற்றுச்சூழல் மாறிகள் மட்டுமே அமைக்கப்படும்.

source: For instance, @samp{MANPATH} won't be set if there is no consumer application for man pages within the profile. So if you need to transparently access man pages once the profile is loaded, you've got two options:
ta: எடுத்துக்காட்டாக, சுயவிவரத்தில் மேன் பக்கங்களுக்கான நுகர்வோர் பயன்பாடு இல்லை என்றால் @samp{MANPATH} அமைக்கப்படாது. சுயவிவரம் ஏற்றப்பட்டதும், மேன் பக்கங்களை நீங்கள் வெளிப்படையாக அணுக வேண்டும் என்றால், உங்களுக்கு இரண்டு விருப்பங்கள் உள்ளன:

source: Either export the variable manually, e.g.
ta: மாறியை கைமுறையாக ஏற்றுமதி செய்யவும், எ.கா.

source: export MANPATH=/path/to/profile$@{MANPATH:+:@}$MANPATH
ta: MANPATH=/path/to/profile$@{MANPATH:+:@}$MANPATH ஐ ஏற்றுமதி வெற்றி

source: Or include @samp{man-db} to the profile manifest.
ta: அல்லது சுயவிவர மேனிஃபெச்டில் @samp{man-db}ஐச் சேர்க்கவும்.

source: The same is true for @samp{INFOPATH} (you can install @samp{info-reader}), @samp{PKG_CONFIG_PATH} (install @samp{pkg-config}), etc.
ta: @samp{INFOPATH} (நீங்கள் @samp{info-reader} ஐ நிறுவலாம்), @samp{PKG_CONFIG_PATH} (@samp{pkg-config} ஐ நிறுவவும்) போன்றவற்றுக்கும் இது பொருந்தும்.

source: What about the default profile that Guix keeps in @file{~/.guix-profile}?
ta: @file{~/.guix-profile} இல் Guix வைத்திருக்கும் இயல்புநிலை சுயவிவரத்தைப் பற்றி என்ன?

source: You can assign it the role you want. Typically you would install the manifest of the packages you want to use all the time.
ta: நீங்கள் விரும்பும் பாத்திரத்தை நீங்கள் ஒதுக்கலாம். பொதுவாக நீங்கள் எப்போதும் பயன்படுத்த விரும்பும் தொகுப்புகளின் மேனிஃபெச்டை நிறுவுவீர்கள்.

source: Alternatively, you could keep it ``manifest-less'' for throw-away packages that you would just use for a couple of days. This way makes it convenient to run
ta: மாற்றாக, ஓரிரு நாட்களுக்கு நீங்கள் பயன்படுத்தும் த்ரோ-அவே பேக்கேச்களுக்கு இதை ``மேனிஃபெச்ட்-லெச்'' என்று வைத்துக் கொள்ளலாம். இந்த வழியில் இயக்க வசதியாக உள்ளது

source: guix install package-foo guix upgrade package-bar
ta: guix நிறுவல் தொகுப்பு-foo guix மேம்படுத்தல் தொகுப்பு-பட்டி

source: without having to specify the path to a profile.
ta: சுயவிவரத்திற்கான பாதையைக் குறிப்பிடாமல்.

source: Manifests let you @dfn{declare} the set of packages you'd like to have in a profile (@pxref{Writing Manifests,,, guix, GNU Guix Reference Manual}). They are a convenient way to keep your package lists around and, say, to synchronize them across multiple machines using a version control system.
ta: சுயவிவரத்தில் (@pxref{Writing Manifests,,, guix, GNU Guix குறிப்பு Manual}) நீங்கள் விரும்பும் தொகுப்புகளின் தொகுப்பை @dfn{declare} செய்ய மேனிஃபெச்ட்கள் உங்களை அனுமதிக்கின்றன. அவை உங்கள் தொகுப்புப் பட்டியலைச் சுற்றி வைத்திருப்பதற்கும், பதிப்புக் கட்டுப்பாட்டு அமைப்பைப் பயன்படுத்தி பல கணினிகளில் அவற்றை ஒத்திசைப்பதற்கும் வசதியான வழியாகும்.

source: A common complaint about manifests is that they can be slow to install when they contain large number of packages. This is especially cumbersome when you just want get an upgrade for one package within a big manifest.
ta: மேனிஃபெச்டுகள் பற்றிய பொதுவான குற்றச்சாட்டு என்னவென்றால், அவை அதிக எண்ணிக்கையிலான தொகுப்புகளைக் கொண்டிருக்கும்போது அவை மெதுவாக நிறுவப்படும். ஒரு பெரிய மேனிஃபெச்டுக்குள் ஒரு பேக்கேசுக்கான மேம்படுத்தலைப் பெற விரும்பினால், இது மிகவும் சிரமமாக இருக்கும்.

source: This is one more reason to use multiple profiles, which happen to be just perfect to break down manifests into multiple sets of semantically connected packages. Using multiple, small profiles provides more flexibility and usability.
ta: பல சுயவிவரங்களைப் பயன்படுத்துவதற்கு இதுவும் ஒரு காரணமாகும், இது மேனிஃபெச்டுகளை சொற்பொருள் ரீதியாக இணைக்கப்பட்ட பல தொகுப்புகளாக உடைப்பதற்கு மிகச் சரியானதாக இருக்கும். பல, சிறிய சுயவிவரங்களைப் பயன்படுத்துவது அதிக நெகிழ்வுத்தன்மை மற்றும் பயன்பாட்டினை வழங்குகிறது.

source: Manifests come with multiple benefits. In particular, they ease maintenance:
ta: வெளிப்பாடுகள் பல நன்மைகளுடன் வருகின்றன. குறிப்பாக, அவை பராமரிப்பை எளிதாக்குகின்றன:

source: When a profile is set up from a manifest, the manifest itself is self-sufficient to keep a ``package listing'' around and reinstall the profile later or on a different system. For ad-hoc profiles, we would need to generate a manifest specification manually and maintain the package versions for the packages that don't use the default version.
ta: ஒரு மேனிஃபெச்டிலிருந்து சுயவிவரம் அமைக்கப்படும் போது, மேனிஃபெச்ட்டே ஒரு ``பேக்கேச் பட்டியலை'' வைத்திருப்பதற்கும், சுயவிவரத்தை பின்னர் அல்லது வேறு கணினியில் மீண்டும் நிறுவுவதற்கும் தன்னிறைவாக இருக்கும். தற்காலிக சுயவிவரங்களுக்கு, நாங்கள் மேனிஃபெச்ட் விவரக்குறிப்பை கைமுறையாக உருவாக்க வேண்டும் மற்றும் இயல்புநிலை பதிப்பைப் பயன்படுத்தாத தொகுப்புகளுக்கான தொகுப்பு பதிப்புகளைப் பராமரிக்க வேண்டும்.

source: @code{guix package --upgrade} always tries to update the packages that have propagated inputs, even if there is nothing to do. Guix manifests remove this problem.
ta: @code{guix தொகுப்பு --upgrade} எப்பொழுதும் எதுவும் செய்யாவிட்டாலும், உள்ளீடுகளை பரப்பிய தொகுப்புகளை புதுப்பிக்க முயற்சிக்கும். Guix வெளிப்பாடுகள் இந்த சிக்கலை நீக்குகின்றன.
