Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: GNU Guix Cookbook
ta: GNU Guix கையேடு

source: Copyright @copyright{} 2019, 2022 Ricardo Wurmus@* Copyright @copyright{} 2019 Efraim Flashner@* Copyright @copyright{} 2019 Pierre Neidhardt@* Copyright @copyright{} 2020 Oleg Pykhalov@* Copyright @copyright{} 2020 Matthew Brooks@* Copyright @copyright{} 2020 Marcin Karpezo@* Copyright @copyright{} 2020 Brice Waegeneire@* Copyright @copyright{} 2020 André Batista@* Copyright @copyright{} 2020 Christine Lemmer-Webber@* Copyright @copyright{} 2021 Joshua Branson@* Copyright @copyright{} 2022, 2023 Maxim Cournoyer@* Copyright @copyright{} 2023--2026 Ludovic Courtès@* Copyright @copyright{} 2023 Thomas Ieong@* Copyright @copyright{} 2024 Florian Pelz@* Copyright @copyright{} 2025 45mg@* Copyright @copyright{} 2023 Marek Felšöci@* Copyright @copyright{} 2023 Konrad Hinsen@* Copyright @copyright{} 2023 Philippe Swartvagher@*
ta: பதிப்புரிமை @பதிப்புரிமை{} 2019, 2022 ரிக்கார்டோ வுர்மசு@* பதிப்புரிமை @பதிப்புரிமை{} 2019 எஃப்ரைம் ஃப்ளாசுனர்@* பதிப்புரிமை @பதிப்புரிமை{} 2019 பியர் நீடார்ட்@* பதிப்புரிமை @பதிப்புரிமை{} 2020 ஒலெக் பைகலோவ்@* பதிப்புரிமை @பதிப்புரிமை{} 2020 மேத்யூ புரூக்சு@* பதிப்புரிமை @பதிப்புரிமை{} 2020 மார்சின் கார்பெசோ@* பதிப்புரிமை @பதிப்புரிமை{} 2020 பிரைச் வெய்செனிரே@* பதிப்புரிமை @பதிப்புரிமை{} 2020 அன்ட்ரே பாடிச்டா@* பதிப்புரிமை @பதிப்புரிமை{} 2020 Christine Lemmer-Webber@* பதிப்புரிமை @பதிப்புரிமை{} 2021 Joshua பிரான்சன்@* பதிப்புரிமை @பதிப்புரிமை{} 2022, 2023 மாக்சிம் கோர்னோயர்@* பதிப்புரிமை @பதிப்புரிமை{} 2023-2025 லுடோவிக் கோர்டெசு@* பதிப்புரிமை @பதிப்புரிமை{} 2023 தாமசு இயோங்@* பதிப்புரிமை @பதிப்புரிமை{} 2024 புளோரியன் பெல்சு@* பதிப்புரிமை @பதிப்புரிமை{} 2025 45எம்சி@* பதிப்புரிமை @பதிப்புரிமை{} 2023 மாரெக் ஃபெல்சி@* பதிப்புரிமை @பதிப்புரிமை{} 2023 கொன்ராட் இன்சன்@* பதிப்புரிமை @பதிப்புரிமை{} 2023 பிலிப் சுவார்ட்வாகர்@*

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled ``GNU Free Documentation License''.
ta: இலவச மென்பொருள் அறக்கட்டளையால் வெளியிடப்பட்ட குனு இலவச ஆவண உரிமம், பதிப்பு 1.3 அல்லது அதற்குப் பிந்தைய பதிப்பின் விதிமுறைகளின் கீழ் இந்த ஆவணத்தை நகலெடுக்க, விநியோகிக்க மற்றும்/அல்லது மாற்றுவதற்கு இசைவு வழங்கப்படுகிறது; மாறாத பிரிவுகள் இல்லாமல், முன் அட்டை உரைகள் இல்லை, பின் அட்டை உரைகள் இல்லை. உரிமத்தின் நகல் ``GNU இலவச ஆவண உரிமம்'' என்ற பிரிவில் சேர்க்கப்பட்டுள்ளது.

source: System administration
ta: அமைப்பு நிர்வாகம்

source: Guix cookbook: (guix-cookbook)
ta: கிக்ஸ் பயனர் கையேடு: (guix-cookbook.ta)

source: Tutorials and examples for GNU Guix.
ta: குனு கிக்ஸ் க்கான பயிற்சிகள் மற்றும் எடுத்துக்காட்டுகள்.

source: Tutorials and examples for using the GNU Guix Functional Package Manager
ta: குனு கிக்ஸ் செயல்பாட்டு தொகுப்பு மேலாளரைப் பயன்படுத்துவதற்கான பயிற்சிகள் மற்றும் எடுத்துக்காட்டுகள்

source: The GNU Guix Developers
ta: குனு கிக்ஸ் நிரலாளர்

source: This document presents tutorials and detailed examples for GNU@tie{}Guix, a functional package management tool written for the GNU system. Please @pxref{Top,,, guix, GNU Guix reference manual} for details about the system, its API, and related concepts.
ta: இந்த ஆவணம் GNU@tie{}Guix க்கான பயிற்சிகள் மற்றும் விரிவான எடுத்துக்காட்டுகளை வழங்குகிறது, இது GNU அமைப்பிற்காக எழுதப்பட்ட ஒரு செயல்பாட்டு தொகுப்பு மேலாண்மை கருவியாகும். கணினி, அதன் பநிஇ மற்றும் தொடர்புடைய கருத்துக்கள் பற்றிய விவரங்களுக்கு @pxref{Top,,, guix, GNU Guix குறிப்பு கையேடு}.

source: This manual is also available in Simplified Chinese (@pxref{Top,,, guix-cookbook.zh_CN, GNU Guix 烹饪书}), French (@pxref{Top,,, guix-cookbook.fr, Livre de recettes de GNU Guix}), German (@pxref{Top,,, guix-cookbook.de, GNU-Guix-Kochbuch}), Korean (@pxref{Top,,, guix-cookbook.ko, GNU Guix 쿡북}), Spanish (@pxref{Top,,, guix-cookbook.es, Libro de recetas de GNU Guix}), Italian (@pxref{Top,,, guix-cookbook.it, Ricettario di GNU Guix}), Brazilian Portuguese (@pxref{Top,,, guix-cookbook.pt_BR, Livro de receitas do GNU Guix}), Russian (@pxref{Top,,, guix-cookbook.ru, GNU Guix Рецепты}), Slovak (@pxref{Top,,, guix-cookbook.sk, Receptár GNU Guix}), Swedish (@pxref{Top,,, guix-cookbook.sv, Kokbok för GNU Guix}), and Tamil (@pxref{Top,,, guix-cookbook.ta, GNU Guix கையேடு}). If you would like to translate this document in your native language, consider joining @uref{https://translate.codeberg.org/projects/guix/documentation-cookbook, Weblate} (@pxref{Translating Guix,,, guix, GNU Guix Reference Manual}).
ta: இந்த கையேடு ஆங்கில கிடைக்கிறது (@pxref{Top,,, guix-cookbook, GNU Guix Cookbook}) எளிமைப்படுத்தப்பட்ட சீன மொழியிலும் (@pxref{Top,,, guix-cookbook.zh_CN, GNU Guix 烹饪书}), பிரெஞ்சு (@pxref{Top,,, guix-cookbook.fr, Livre de recettes de GNU Guix}), செர்மன் (@pxref{Top,,, guix-cookbook.de, GNU-Guix-Kochbuch}), , கொரியன் (@pxref{Top,,, guix-cookbook.ko, GNU Guix 쿡북}), ச்பானிச் (@pxref{Top,,, guix-cookbook.es, Libro de recetas de GNU Guix}), இத்தாலியன் (@pxref{Top,,, guix-cookbook.it, Ricettario di GNU Guix}), பிரேசிலிய போர்த்துகீசியம் (@pxref{Top,,, guix-cookbook.pt_BR, Livro de receitas do GNU Guix}), ரசியன் (@pxref{Top,,, guix-cookbook.ru, GNU Guix Рецепты}, ச்லோவாக் (@pxref{Top,,, guix-cookbook.sk, Receptár GNU Guix}), மற்றும் ச்வீடிச் (@pxref{Top,,, guix-cookbook.sv, Kokbok för GNU Guix}). இந்த ஆவணத்தை உங்கள் தாய் மொழியில் மொழிபெயர்க்க விரும்பினால், @uref{https://translate.codeberg.org/projects/guix/documentation-cookbook, Weblate} (@pxref{Translating Guix,,, guix, GNU Guix குறிப்பு கையேடு}) இல் சேரவும்.

source: Scheme tutorials
ta: ஸ்கீம்(Scheme) பயிற்சிகள்

source: Meet your new favorite language!
ta: உங்களுக்குப் பிடித்த புதிய மொழியைச் சந்திக்கவும்!

source: Packaging
ta: பொதியாக்கம்

source: Packaging tutorials
ta: பேக்கேசிங் பயிற்சிகள்

source: System Configuration
ta: அமைப்பின் உள்ளமைப்பு

source: Customizing the GNU System
ta: குனு அமைப்பைத் தனிப்பயனாக்குதல் (customize)

source: Containers
ta: கொள்கலன்கள்

source: Isolated environments and nested systems
ta: தனிமைப்படுத்தப்பட்ட சூழல்கள் மற்றும் உள்ளமை அமைப்புகள்

source: Virtual Machines
ta: மெய்நிகர் பொறிகள்

source: Virtual machines usage and configuration
ta: மெய்நிகர் இயந்திரங்களின் பயன்பாடு மற்றும் கட்டமைப்பு

source: Advanced package management
ta: மேம்பட்ட தொகுப்பு மேலாண்மை

source: Power to the users!
ta: பயனாளர்களுக்கு அதிகாரம்!

source: Software Development
ta: மென்பொருள் மேம்பாடு

source: Environments, continuous integration, etc.
ta: சூழல்கள், தொடர்ச்சியான ஒருங்கிணைப்பு போன்றவை.

source: Environment management
ta: சுற்றுச்சூழல் மேலாண்மை

source: Control environment
ta: கட்டுப்பாட்டு சூழல்

source: Reproducible Research
ta: மீண்டும் உருவாக்கக்கூடிய ஆராய்ச்சி

source: A foundation for reproducible research.
ta: மீண்டும் உருவாக்கக்கூடிய ஆராய்ச்சிக்கான அடித்தளம்.

source: Installing Guix on a Cluster
ta: ஒரு கிளச்டரில் Guix ஐ நிறுவுகிறது

source: High-performance computing.
ta: உயர் செயல்திறன் கணினி.

source: Guix System Management
ta: Guix கணினி மேலாண்மை

source: System Management specifics.
ta: கணினி மேலாண்மை விவரக்குறிப்புகள்.

source: Acknowledgments
ta: அங்கீகாரங்கள்

source: Thanks!
ta: நன்றி!

source: GNU Free Documentation License
ta: குனு இலவச ஆவண உரிமம்

source: The license of this document.
ta: இந்த ஆவணத்தின் உரிமம்.

source: Concept Index
ta: கருத்து அட்டவணை

source: Concepts.
ta: கருத்துக்கள்.

source: --- The Detailed Node Listing ---
ta: --- விரிவான முனை பட்டியல் ---

source: A Scheme Crash Course
ta: ஒரு ச்கீம் க்ராச் கோர்ச்

source: Packaging Tutorial
ta: பேக்கேசிங் பயிற்சி

source: A tutorial on how to add packages to Guix.
ta: Guix இல் தொகுப்புகளை எவ்வாறு சேர்ப்பது என்பது பற்றிய ஒரு பயிற்சி.

source: Packaging Workflows
ta: பேக்கேசிங் பணிப்பாய்வு

source: Real life examples on working with specific build systems.
ta: குறிப்பிட்ட உருவாக்க அமைப்புகளுடன் பணிபுரிவதற்கான நிச வாழ்க்கை எடுத்துக்காட்டுகள்.

source: A ``Hello World'' package
ta: ஒரு ``அலோ வேர்ல்ட்'' தொகுப்பு

source: Setup
ta: அமைவு

source: Extended example
ta: நீட்டிக்கப்பட்ட சான்று

source: Other build systems
ta: பிற உருவாக்க அமைப்புகள்

source: Programmable and automated package definition
ta: நிரல்படுத்தக்கூடிய மற்றும் தானியங்கு தொகுப்பு வரையறை

source: Getting help
ta: உதவி பெறுதல்

source: Conclusion
ta: முடிவுரை

source: References
ta: குறிப்புகள்

source: Local file
ta: உள்ளக கோப்பு

source: Channels
ta: சேனல்கள்

source: Direct checkout hacking
ta: நேரடி செக்அவுட் ஏக்கிங்

source: Recursive importers
ta: சுழல்நிலை இறக்குமதியாளர்கள்

source: Automatic update
ta: தானியங்கி மேம்படுத்தல்

source: Inheritance
ta: பரம்பரை

source: Packaging Rust Crates
ta: பேக்கேசிங் ரச்ட் கிரேட்ச்

source: Common Workflow for Rust Packaging
ta: ரச்ட் பேக்கேசிங்கிற்கான பொதுவான பணிப்பாய்வு

source: Cargo Workspaces and Development Snapshots
ta: சரக்கு பணியிடங்கள் மற்றும் மேம்பாட்டு ச்னாப்சாட்கள்

source: Using Rust Libraries in Other Build Systems
ta: மற்ற பில்ட் சிச்டங்களில் ரச்ட் லைப்ரரிகளைப் பயன்படுத்துதல்

source: Auto-Login to a Specific TTY
ta: ஒரு குறிப்பிட்ட TTY இல் தானாக உள்நுழைக

source: Automatically Login a User to a Specific TTY
ta: ஒரு குறிப்பிட்ட TTY இல் ஒரு பயனரை தானாக உள்நுழையவும்

source: Customizing the Kernel
ta: கர்னலைத் தனிப்பயனாக்குதல்

source: Creating and using a custom Linux kernel on Guix System.
ta: Guix கணினியில் தனிப்பயன் Linux கர்னலை உருவாக்கி பயன்படுத்துதல்.

source: Guix System Image API
ta: Guix சிச்டம் இமேச் பநிஇ

source: Customizing images to target specific platforms.
ta: குறிப்பிட்ட தளங்களை குறிவைக்க படங்களை தனிப்பயனாக்குதல்.

source: Using security keys
ta: பாதுகாப்பு விசைகளைப் பயன்படுத்துதல்

source: How to use security keys with Guix System.
ta: Guix மண்டலம் உடன் பாதுகாப்பு விசைகளை எவ்வாறு பயன்படுத்துவது.

source: Dynamic DNS mcron job
ta: மாறும் டிஎன்எச் மெக்ரான் வேலை

source: Job to update the IP address behind a DuckDNS host name.
ta: DuckDNS புரவலன் பெயருக்குப் பின்னால் உள்ள IP முகவரியைப் புதுப்பிப்பதற்கான வேலை.

source: Connecting to Wireguard VPN
ta: Wireguard VPN உடன் இணைக்கிறது

source: Connecting to a Wireguard VPN.
ta: வயர்கார்டு VPN உடன் இணைக்கிறது.

source: Customizing a Window Manager
ta: சாளர மேலாளரைத் தனிப்பயனாக்குதல்

source: Handle customization of a Window manager on Guix System.
ta: Guix கணினியில் ஒரு சாளர மேலாளரின் தனிப்பயனாக்கத்தைக் கையாளவும்.

source: Running Guix on a Linode Server
ta: லினோட் சேவையகத்தில் Guix ஐ இயக்குகிறது

source: Running Guix on a Linode Server.
ta: லினோட் சேவையகத்தில் Guix ஐ இயக்குகிறது.

source: Running Guix on a Kimsufi Server
ta: கிம்சுஃபி சர்வரில் Guixஐ இயக்குகிறது

source: Running Guix on a Kimsufi Server.
ta: கிம்சுஃபி சர்வரில் Guixஐ இயக்குகிறது.

source: Setting up a bind mount
ta: பைண்ட் மவுண்ட் அமைத்தல்

source: Setting up a bind mount in the file-systems definition.
ta: கோப்பு முறைமைகளின் வரையறையில் பைண்ட் மவுண்ட்டை அமைத்தல்.

source: Getting substitutes from Tor
ta: Tor இலிருந்து மாற்றுகளைப் பெறுதல்

source: Configuring Guix daemon to get substitutes through Tor.
ta: Tor மூலம் மாற்றுகளைப் பெற Guix deemon ஐ உள்ளமைக்கிறது.

source: Setting up NGINX with Lua
ta: லுவா உடன் NGINX ஐ அமைக்கிறது

source: Configuring NGINX web-server to load Lua modules.
ta: லுவா தொகுதிகளை ஏற்றுவதற்கு NGINX இணைய சேவையகத்தை உள்ளமைக்கிறது.

source: Music Server with Bluetooth Audio
ta: ஊடலை ஆடியோவுடன் இசை சேவையகம்

source: Headless music player with Bluetooth output.
ta: ஊடலை வெளியீட்டுடன் எட்லெச் மியூசிக் பிளேயர்.

source: StumpWM
ta: ச்டம்ப்டபிள்யூஎம்

source: Session lock
ta: அமர்வு பூட்டு

source: Xorg
ta: கோர்க்

source: Guix Containers
ta: சிப்சம் கொள்கலன்கள்

source: Perfectly isolated environments
ta: முற்றிலும் தனிமைப்படுத்தப்பட்ட சூழல்கள்

source: Guix System Containers
ta: Guix சிச்டம் கொள்கலன்கள்

source: A system inside your system
ta: உங்கள் கணினியில் உள்ள ஒரு அமைப்பு

source: A Database Container
ta: ஒரு தரவுத்தள கொள்கலன்

source: Container Networking
ta: கொள்கலன் நெட்வொர்க்கிங்

source: Network bridge for QEMU
ta: QEMU க்கான பிணைய பாலம்

source: Routed network for libvirt
ta: libvirt க்கான வழித்தட பிணையம்

source: Custom NAT-based network for libvirt
ta: libvirt க்கான தனிப்பயன் NAT அடிப்படையிலான பிணையம்

source: References: VM References
ta: குறிப்புகள்: VM குறிப்புகள்

source: Further reading on virtual machines.
ta: மெய்நிகர் கணினிகளில் மேலும் படிக்கவும்.

source: Guix Profiles in Practice
ta: நடைமுறையில் உள்ள Guix சுயவிவரங்கள்

source: Strategies for multiple profiles and manifests.
ta: பல சுயவிவரங்கள் மற்றும் வெளிப்பாடுகளுக்கான உத்திகள்.

source: Basic setup with manifests
ta: மேனிஃபெச்ட்சுடன் அடிப்படை அமைப்பு

source: Required packages
ta: தேவையான தொகுப்புகள்

source: Default profile
ta: இயல்புநிலை சுயவிவரம்

source: The benefits of manifests
ta: வெளிப்படும் நன்மைகள்

source: Reproducible profiles
ta: மீண்டும் உருவாக்கக்கூடிய சுயவிவரங்கள்

source: Getting Started
ta: தொடங்குதல்

source: Step 0: using `guix shell'.
ta: படி 0: `guix shell' ஐப் பயன்படுத்துதல்.

source: Building with Guix
ta: Guix உடன் கட்டிடம்

source: Step 1: building your code.
ta: படி 1: உங்கள் குறியீட்டை உருவாக்குதல்.

source: The Repository as a Channel
ta: சேனலாக களஞ்சியம்

source: Step 2: turning the repo in a channel.
ta: படி 2: ஒரு சேனலில் ரெப்போவை திருப்புதல்.

source: Package Variants
ta: தொகுப்பு மாறுபாடுகள்

source: Bonus: Defining variants.
ta: போனச்: மாறுபாடுகளை வரையறுத்தல்.

source: Setting Up Continuous Integration
ta: தொடர்ச்சியான ஒருங்கிணைப்பை அமைத்தல்

source: Step 3: continuous integration.
ta: படி 3: தொடர்ச்சியான ஒருங்கிணைப்பு.

source: Build Manifest
ta: மேனிஃபெச்ட்டை உருவாக்குங்கள்

source: Bonus: Manifest.
ta: போனச்: மேனிஃபெச்ட்.

source: Wrapping Up
ta: மடக்குதல்

source: Recap.
ta: மறுபரிசீலனை.

source: Guix environment via direnv
ta: direnv வழியாக Gix சூழல்

source: Setup Guix environment with direnv
ta: Direnv உடன் Guix சூழலை அமைக்கவும்

source: Using Guix for Reproducible Research
ta: மறுஉருவாக்கம் செய்யக்கூடிய ஆராய்ச்சிக்கு Guix ஐப் பயன்படுத்துதல்

source: Setting Up the Environment
ta: சூழலை அமைத்தல்

source: Step 1: using `guix shell'.
ta: படி 1: `guix shell' ஐப் பயன்படுத்துதல்.

source: Recording the Environment
ta: சூழலைப் பதிவு செய்தல்

source: Step 2: using `guix describe'.
ta: படி 2: `guix description' ஐப் பயன்படுத்துதல்.

source: Ensuring Long-Term Source Code Archiving
ta: நீண்ட கால மூலக் குறியீடு காப்பகத்தை உறுதி செய்தல்

source: Step 3: Software Heritage.
ta: படி 3: மென்பொருள் பாரம்பரியம்.

source: Referencing the Software Environment
ta: மென்பொருள் சூழலைக் குறிப்பிடுதல்

source: Step 4: SWHIDs.
ta: படி 4: SWHIDகள்.

source: Setting Up a Head Node
ta: ஒரு தலை முனையை அமைத்தல்

source: The node that runs the daemon.
ta: டெமானை இயக்கும் முனை.

source: Setting Up Compute Nodes
ta: கணினி முனைகளை அமைத்தல்

source: Client nodes.
ta: வாங்கி முனைகள்.

source: Cluster Network Access
ta: கிளச்டர் பிணையம் அணுகல்

source: Dealing with network access restrictions.
ta: பிணையம் அணுகல் கட்டுப்பாடுகளைக் கையாள்வது.

source: Cluster Disk Usage
ta: கிளச்டர் வட்டு பயன்பாடு

source: Disk usage considerations.
ta: வட்டு பயன்பாடு பரிசீலனைகள்.

source: Cluster Security Considerations
ta: கிளச்டர் பாதுகாப்பு பரிசீலனைகள்

source: Keeping the cluster secure.
ta: கிளச்டரை பாதுகாப்பாக வைத்திருத்தல்.

source: Upgrade Postgres for Cuirass
ta: Cuiras க்கான Postgres ஐ மேம்படுத்தவும்

source: Upgrading from the default postgres.
ta: இயல்புநிலை postgres இலிருந்து மேம்படுத்துகிறது.

source: GNU@tie{}Guix is written in the general purpose programming language Scheme, and many of its features can be accessed and manipulated programmatically. You can use Scheme to generate package definitions, to modify them, to build them, to deploy whole operating systems, etc.
ta: GNU@tie{}Guix பொது நோக்கத்திற்கான நிரலாக்க மொழி திட்டத்தில் எழுதப்பட்டுள்ளது, மேலும் அதன் பல அம்சங்களை நிரல் ரீதியாக அணுகலாம் மற்றும் கையாளலாம். தொகுப்பு வரையறைகளை உருவாக்க, அவற்றை மாற்ற, அவற்றை உருவாக்க, முழு இயக்க முறைமைகளை வரிசைப்படுத்த, போன்றவற்றை நீங்கள் திட்டத்தைப் பயன்படுத்தலாம்.

source: Knowing the basics of how to program in Scheme will unlock many of the advanced features Guix provides --- and you don't even need to be an experienced programmer to use them!
ta: திட்டத்தில் எவ்வாறு நிரல் செய்வது என்பதற்கான அடிப்படைகளை அறிந்துகொள்வது Guix வழங்கும் பல மேம்பட்ட அம்சங்களைத் திறக்கும் --- மேலும் அவற்றைப் பயன்படுத்த நீங்கள் அனுபவமிக்க புரோகிராமராக இருக்க வேண்டிய அவசியமில்லை!

source: Let's get started!
ta: தொடங்குவோம்!

source: Scheme, crash course
ta: ச்கீம், க்ராச் கோர்ச்

source: Guix uses the Guile implementation of Scheme. To start playing with the language, install it with @code{guix install guile} and start a @dfn{REPL}---short for @uref{https://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop, @dfn{read-eval-print loop}}---by running @code{guile} from the command line.
ta: சுண்ணாம்பு திட்டத்தின் கையில் செயல்படுத்தலைப் பயன்படுத்துகிறது. மொழியுடன் விளையாடுவதைத் தொடங்க, அதை @code{guix install guile} மூலம் நிறுவி, @dfn{REPL}----short க்கு @uref{https://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop, @dfn{read-eval-print loop}}-@code{guile} கட்டைளை வரியிலிருந்து இயக்கப்படும்.

source: Alternatively you can also run @code{guix shell guile -- guile} if you'd rather not have Guile installed in your user profile.
ta: மாற்றாக, உங்கள் பயனர் சுயவிவரத்தில் Guile நிறுவப்படாமல் இருந்தால், @code{guix ஓடு guile -- guile} ஐயும் இயக்கலாம்.

source: In the following examples, lines show what you would type at the REPL; lines starting with ``@result{}'' show evaluation results, while lines starting with ``@print{}'' show things that get printed. @xref{Using Guile Interactively,,, guile, GNU Guile Reference Manual}, for more details on the REPL.
ta: பின்வரும் எடுத்துக்காட்டுகளில், REPL இல் நீங்கள் என்ன தட்டச்சு செய்வீர்கள் என்பதைக் கோடுகள் காட்டுகின்றன; ``@result{}'' உடன் தொடங்கும் வரிகள் மதிப்பீட்டு முடிவுகளைக் காட்டுகின்றன, அதே சமயம் ``@print{}'' உடன் தொடங்கும் வரிகள் அச்சிடப்படும் விசயங்களைக் காட்டுகின்றன. REPL பற்றிய கூடுதல் விவரங்களுக்கு @xref{குயிலை ஊடாடலாகப் பயன்படுத்துதல்,,, guile, GNU Guile குறிப்பு Manual}.

source: Scheme syntax boils down to a tree of expressions (or @emph{s-expression} in Lisp lingo). An expression can be a literal such as numbers and strings, or a compound which is a parenthesized list of compounds and literals. @code{#true} and @code{#false} (abbreviated @code{#t} and @code{#f}) stand for the Booleans ``true'' and ``false'', respectively.
ta: திட்ட தொடரியல் வெளிப்பாடுகளின் மரமாக (அல்லது லிச்ப் லிங்கோவில் @emph{s-expression}) கொதிக்கிறது. ஒரு வெளிப்பாடு என்பது எண்கள் மற்றும் சரங்கள் போன்ற ஒரு எழுத்துப் பொருளாக இருக்கலாம் அல்லது சேர்மங்கள் மற்றும் எழுத்துகளின் அடைப்புக் குறியிடப்பட்ட பட்டியலான கலவையாக இருக்கலாம். @code{#true} மற்றும் @code{#false} (சுருக்கமாக @code{#t} மற்றும் @code{#f}) முறையே பூலியன்கள் ``true'' மற்றும் ```false'' என்பதைக் குறிக்கிறது.

source: Examples of valid expressions:
ta: சரியான வெளிப்பாடுகளின் எடுத்துக்காட்டுகள்:

source: "Hello World!" @result{} "Hello World!"
ta: "அலோ வேர்ல்ட்!" @result{} "அலோ வேர்ல்ட்!"

source: (display (string-append "Hello " "Guix" "\n")) @print{} Hello Guix @result{} #<unspecified>
ta: (display (string-append "அலோ " "குயிக்ச்" "\n")) @print{} அலோ குயிக்ச் @result{} #<unspecified>

source: This last example is a function call nested in another function call. When a parenthesized expression is evaluated, the first term is the function and the rest are the arguments passed to the function. Every function returns the last evaluated expression as its return value.
ta: இந்த கடைசி சான்று மற்றொரு செயல்பாட்டு அழைப்பில் உள்ள ஒரு செயல்பாட்டு அழைப்பு ஆகும். அடைப்புக் குறியிடப்பட்ட வெளிப்பாடு மதிப்பிடப்படும்போது, முதல் சொல் செயல்பாடு ஆகும், மீதமுள்ளவை செயல்பாட்டிற்கு அனுப்பப்பட்ட வாதங்கள். ஒவ்வொரு செயல்பாடும் கடைசியாக மதிப்பிடப்பட்ட வெளிப்பாட்டை அதன் திரும்ப மதிப்பாக வழங்கும்.

source: Anonymous functions---@dfn{procedures} in Scheme parlance---are declared with the @code{lambda} term:
ta: அநாமதேய செயல்பாடுகள்---@dfn{procedures} திட்ட மொழியில்--- @code{lambda} வார்த்தையுடன் அறிவிக்கப்படுகின்றன:

source: The above procedure returns the square of its argument. Since everything is an expression, the @code{lambda} expression returns an anonymous procedure, which can in turn be applied to an argument:
ta: மேலே உள்ள செயல்முறை அதன் வாதத்தின் சதுரத்தை வழங்குகிறது. எல்லாம் ஒரு வெளிப்பாடு என்பதால், @code{lambda} வெளிப்பாடு ஒரு அநாமதேய செயல்முறையை வழங்குகிறது, இது ஒரு வாதத்திற்குப் பயன்படுத்தப்படலாம்:

source: Procedures are regular values just like numbers, strings, Booleans, and so on.
ta: நடைமுறைகள் எண்கள், சரங்கள், பூலியன்கள் மற்றும் பல போன்ற வழக்கமான மதிப்புகள்.

source: Anything can be assigned a global name with @code{define}:
ta: @code{define} மூலம் எதற்கும் உலகளாவிய பெயரை ஒதுக்கலாம்:

source: (define a 3) (define square (lambda (x) (* x x))) (square a) @result{} 9
ta: (define a 3) (define சதுரம் (lambda (x) (* x x))) (சதுரம் a) @result{} 9

source: Procedures can be defined more concisely with the following syntax:
ta: பின்வரும் தொடரியல் மூலம் செயல்முறைகளை இன்னும் சுருக்கமாக வரையறுக்கலாம்:

source: (define (square x) (* x x))
ta: (define (சதுரம் x) (* x x))

source: A list structure can be created with the @code{list} procedure:
ta: @code{list} செயல்முறை மூலம் பட்டியல் கட்டமைப்பை உருவாக்கலாம்:

source: Standard procedures are provided by the @code{(srfi srfi-1)} module to create and process lists (@pxref{SRFI-1, list processing,, guile, GNU Guile Reference Manual}). Here are some of the most useful ones in action:
ta: பட்டியல்களை உருவாக்கவும் செயலாக்கவும் @code{(srfi srfi-1)} தொகுதி மூலம் நிலையான நடைமுறைகள் வழங்கப்படுகின்றன (@pxref{SRFI-1, list processing,, guile, GNU Guile குறிப்பு Manual}). செயல்பாட்டில் மிகவும் பயனுள்ள சில இங்கே:

source: (use-modules (srfi srfi-1)) ;import list processing procedures
ta: (use-modules (srfi srfi-1)) ;இறக்குமதி பட்டியல் செயலாக்க நடைமுறைகள்

source: Notice how the first argument to @code{map}, @code{filter}, @code{remove}, and @code{find} is a procedure!
ta: @code{map}, @code{filter}, @code{remove} மற்றும் @code{find} ஆகியவற்றுக்கான முதல் உரையாடல் எப்படி ஒரு செயல்முறையாகும் என்பதைக் கவனியுங்கள்!

source: S-expression
ta: எச்-வெளிப்பாடு

source: The @dfn{quote} disables evaluation of a parenthesized expression, also called an S-expression or ``s-exp'': the first term is not called over the other terms (@pxref{Expression Syntax, quote,, guile, GNU Guile Reference Manual}). Thus it effectively returns a list of terms.
ta: S-expression அல்லது ``s-exp'' என்றும் அழைக்கப்படும் அடைப்புக் குறியிடப்பட்ட வெளிப்பாட்டின் மதிப்பீட்டை @dfn{quote} முடக்குகிறது: முதல் சொல் மற்ற விதிமுறைகளுக்கு மேல் அழைக்கப்படுவதில்லை (@pxref{Expression Syntax, quote,, guile, GNU Guile Reference Manual}). எனவே இது விதிமுறைகளின் பட்டியலை திறம்பட வழங்குகிறது.

source: '(display (string-append "Hello " "Guix" "\n")) @result{} (display (string-append "Hello " "Guix" "\n"))
ta: '(display (string-append "வணக்கம்" "சுண்ணாம்பு" "\n")) @result{} (display (string-append "வணக்கம்" "சுண்ணாம்பு" "\n"))

source: The @code{quasiquote} (@code{`}, a backquote) disables evaluation of a parenthesized expression until @code{unquote} (@code{,}, a comma) re-enables it. Thus it provides us with fine-grained control over what is evaluated and what is not.
ta: @code{quasiquote} (@code{`}, ஒரு காற்புள்ளி) அதை மீண்டும் இயக்கும் வரை @code{unquote} (@code{,}, ஒரு பின்கோட்) அடைப்புக் குறியிடப்பட்ட வெளிப்பாட்டின் மதிப்பீட்டை முடக்குகிறது. இவ்வாறு மதிப்பிடப்படும் மற்றும் மதிப்பிடப்படாதவற்றின் மீது நமக்கு நுணுக்கமான கட்டுப்பாட்டை வழங்குகிறது.

source: Note that the above result is a list of mixed elements: numbers, symbols (here @code{a}) and the last element is a list itself.
ta: மேலே உள்ள முடிவு கலப்பு உறுப்புகளின் பட்டியல் என்பதை நினைவில் கொள்ளவும்: எண்கள், குறியீடுகள் (இங்கே @code{a}) மற்றும் கடைசி உறுப்பு ஒரு பட்டியலே.

source: G-expressions, syntax
ta: சி-வெளிப்பாடுகள், தொடரியல்
