Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: (operating-system (host-name "my-server") (timezone "America/New_York") (locale "en_US.UTF-8") ;; This goofy code will generate the grub.cfg ;; without installing the grub bootloader on disk. (bootloader (bootloader-configuration (bootloader (bootloader (inherit grub-bootloader) (installer #~(const #true)))))) (file-systems (cons (file-system (device "/dev/sda") (mount-point "/") (type "ext4")) %base-file-systems))
ta: (இயக்க அமைப்பு (புரவலன் பெயர் "மை-சர்வர்") (நேர மண்டலம் "அமெரிக்கா/நியூயார்க்") (உள்ளூர் "en_US.UTF-8") ;; இந்த முட்டாள்தனமான குறியீடு grub.cfg ஐ உருவாக்கும் ;; வட்டில் grub பூட்லோடரை நிறுவாமல். (பூட்லோடர் (பூட்லோடர்-கட்டமைப்பு (பூட்லோடர் (பூட்லோடர் (கிரப்-பூட்லோடரைப் பெறு) (நிறுவி #~(const #true)))))) (கோப்பு முறைமைகள் (தீமைகள் (கோப்பு முறை (சாதனம் "/dev/sda") (மவுண்ட்-பாயின்ட் "/") (வகை "ext4")) %base-file-systems))

source: (initrd-modules (cons "virtio_scsi" ; Needed to find the disk %base-initrd-modules))
ta: (initrd-modules (cons "virtio_scsi" ; வட்டைக் கண்டுபிடிக்க வேண்டும் %base-initrd-modules))

source: (users (cons (user-account (name "janedoe") (group "users") ;; Adding the account to the "wheel" group ;; makes it a sudoer. (supplementary-groups '("wheel")) (home-directory "/home/janedoe")) %base-user-accounts))
ta: (பயனர்கள் (தீமைகள் (பயனர் கணக்கு (பெயர் "சானெடோ") (குழு "பயனர்கள்") ;; "சக்கரம்" குழுவில் கணக்கைச் சேர்த்தல் ;; அதை ஒரு சூடோயராக ஆக்குகிறது. (துணை-குழுக்கள் '("சக்கரம்")) (முகப்பு அடைவு "/home/janedoe")) %பேச்-பயனர்-கணக்குகள்))

source: (packages (cons* openssh-sans-x %base-packages))
ta: (தொகுப்புகள் (cons* openssh-sans-x %அடிப்படை தொகுப்புகள்))

source: (services (cons* (service dhcp-client-service-type) (service openssh-service-type (openssh-configuration (openssh openssh-sans-x) (password-authentication? #false) (authorized-keys `(("janedoe" ,(local-file "janedoe_rsa.pub")) ("root" ,(local-file "janedoe_rsa.pub")))))) %base-services)))
ta: (சேவைகள் (பாதிப்புகள்* (சேவை dhcp-client-service-type) (சேவை openssh-service-type (openssh-கட்டமைப்பு (openssh openssh-sans-x) (கடவுச்சொல்-அங்கீகாரமா? #தவறு) (அங்கீகரிக்கப்பட்ட விசைகள் `("janedoe" ,(உள்ளூர்-கோப்பு "janedoe_rsa.pub")) ("ரூட்" ,(உள்ளூர்-கோப்பு "janedoe_rsa.pub")))))) %அடிப்படை-சேவைகள்)))

source: Replace the following fields in the above configuration:
ta: மேலே உள்ள கட்டமைப்பில் பின்வரும் புலங்களை மாற்றவும்:

source: (host-name "my-server") ; replace with your server name ; if you chose a linode server outside the U.S., then ; use tzselect to find a correct timezone string (timezone "America/New_York") ; if needed replace timezone (name "janedoe") ; replace with your username ("janedoe" ,(local-file "janedoe_rsa.pub")) ; replace with your ssh key ("root" ,(local-file "janedoe_rsa.pub")) ; replace with your ssh key
ta: (புரவலன்-பெயர் "மை-சர்வர்") ; உங்கள் சர்வர் பெயரை மாற்றவும் ; நீங்கள் அமெரிக்காவிற்கு வெளியே லினோட் சேவையகத்தைத் தேர்வுசெய்தால் ; சரியான நேர மண்டல சரத்தைக் கண்டறிய tzselect ஐப் பயன்படுத்தவும் (நேர மண்டலம் "அமெரிக்கா/நியூயார்க்") ; தேவைப்பட்டால் நேர மண்டலத்தை மாற்றவும் (பெயர் "சானெடோ") ; உங்கள் பயனர்பெயருடன் மாற்றவும் ("janedoe" ,(உள்ளூர்-கோப்பு "janedoe_rsa.pub")) ; உங்கள் பாஓடு விசையை மாற்றவும் ("ரூட்" ,(உள்ளூர்-கோப்பு "janedoe_rsa.pub")) ; உங்கள் பாஓடு விசையை மாற்றவும்

source: The last line in the above example lets you log into the server as root and set the initial root password (see the note at the end of this recipe about root login). After you have done this, you may delete that line from your configuration and reconfigure to prevent root login.
ta: மேலே உள்ள எடுத்துக்காட்டில் உள்ள கடைசி வரியானது, சர்வரில் ரூட்டாக உள்நுழைந்து ஆரம்ப ரூட் கடவுச்சொல்லை அமைக்க உங்களை அனுமதிக்கிறது (ரூட் உள்நுழைவு பற்றிய இந்த செய்முறையின் முடிவில் உள்ள குறிப்பைப் பார்க்கவும்). இதைச் செய்த பிறகு, உங்கள் உள்ளமைவிலிருந்து அந்த வரியை நீக்கிவிட்டு ரூட் உள்நுழைவைத் தடுக்க மறுகட்டமைக்கலாம்.

source: Copy your ssh public key (eg: @file{~/.ssh/id_rsa.pub}) as @file{@var{<your-username-here>}_rsa.pub} and put @file{guix-config.scm} in the same directory. In a new terminal run these commands.
ta: உங்கள் பாஓடு பொது விசையை (எ.கா: @file{~/.ssh/id_rsa.pub}) @file{@var{<your-username-here>}_rsa.pub} ஆக நகலெடுத்து, அதே கோப்பகத்தில் @file{guix-config.scm} ஐ வைக்கவும். புதிய முனையத்தில் இந்த கட்டளைகளை இயக்கவும்.

source: sftp root@@<remote server ip address> put /path/to/files/<username>_rsa.pub . put /path/to/files/guix-config.scm .
ta: sftp ரூட்@@<தொலை சேவையக ஐபி முகவரி> /path/to/files/<username>_rsa.pub ஐ வைக்கவும். /path/to/files/guix-config.scm ஐ வைக்கவும்.

source: In your first terminal, mount the guix drive:
ta: உங்கள் முதல் முனையத்தில், guix இயக்கியை ஏற்றவும்:

source: mkdir /mnt/guix mount /dev/sdc /mnt/guix
ta: mkdir /mnt/guix மவுண்ட் /dev/sdc /mnt/guix

source: Due to the way we set up the bootloader section of the guix-config.scm, only the grub configuration file will be installed. So, we need to copy over some of the other GRUB stuff already installed on the Debian system:
ta: guix-config.scm இன் பூட்லோடர் பிரிவை நாம் அமைப்பதன் காரணமாக, grub உள்ளமைவு கோப்பு மட்டுமே நிறுவப்படும். எனவே, டெபியன் கணினியில் ஏற்கனவே நிறுவப்பட்ட சில GRUB பொருட்களை நாம் நகலெடுக்க வேண்டும்:

source: Now initialize the Guix installation:
ta: இப்போது Guix நிறுவலை துவக்கவும்:

source: guix system init guix-config.scm /mnt/guix
ta: பிளாச்டர் அமைப்பு init plaster-config.scm /mnt/plaster

source: Ok, power it down! Now from the Linode console, select boot and select "Guix".
ta: சரி, பவர் டவுன்! இப்போது லினோட் கன்சோலில் இருந்து, துவக்கத்தைத் தேர்ந்தெடுத்து "Guix" என்பதைத் தேர்ந்தெடுக்கவும்.

source: Once it boots, you should be able to log in via SSH! (The server config will have changed though.) You may encounter an error like:
ta: அது துவங்கியதும், நீங்கள் பாஓடு வழியாக உள்நுழைய முடியும்! (சர்வர் கட்டமைப்பு மாறியிருக்கும்.) நீங்கள் ஒரு பிழையை சந்திக்கலாம்:

source: $ ssh root@@<server ip address> @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @ WARNING: REMOTE HOST IDENTIFICATION HAS CHANGED! @ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ IT IS POSSIBLE THAT SOMEONE IS DOING SOMETHING NASTY! Someone could be eavesdropping on you right now (man-in-the-middle attack)! It is also possible that a host key has just been changed. The fingerprint for the ECDSA key sent by the remote host is SHA256:0B+wp33w57AnKQuHCvQP0+ZdKaqYrI/kyU7CfVbS7R4. Please contact your system administrator. Add correct host key in /home/joshua/.ssh/known_hosts to get rid of this message. Offending ECDSA key in /home/joshua/.ssh/known_hosts:3 ECDSA host key for 198.58.98.76 has changed and you have requested strict checking. Host key verification failed.
ta: $ பாஓடு ரூட்@@<சேவையக ஐபி முகவரி> @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @ எச்சரிக்கை: ரிமோட் புரவலன் அடையாளம் மாறிவிட்டது! @ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ யாரோ ஒரு மோசமான செயலைச் செய்வது சாத்தியம்! யாரேனும் ஒருவர் இப்போது உங்களை ஒட்டுக்கேட்கலாம் (நடுத்தர தாக்குதல்)! புரவலன் விசை இப்போது மாற்றப்பட்டிருக்கலாம். ரிமோட் புரவலன் அனுப்பிய ECDSA விசைக்கான கைரேகை SHA256:0B+wp33w57AnKQuHCvQP0+ZdKaqYrI/kyU7CfVbS7R4. உங்கள் கணினி நிர்வாகியைத் தொடர்பு கொள்ளவும். இந்தச் செய்தியிலிருந்து விடுபட /home/joshua/.ssh/known_hosts இல் சரியான புரவலன் விசையைச் சேர்க்கவும். /home/joshua/.ssh/known_hosts:3 இல் ECDSA விசையை மீறுகிறது 198.58.98.76க்கான ECDSA புரவலன் விசை மாற்றப்பட்டது மற்றும் நீங்கள் கண்டிப்பான சரிபார்ப்பைக் கோரியுள்ளீர்கள். புரவலன் கீ சரிபார்ப்பு தோல்வியடைந்தது.

source: Either delete @file{~/.ssh/known_hosts} file, or delete the offending line starting with your server IP address.
ta: @file{~/.ssh/known_hosts} கோப்பை நீக்கவும் அல்லது உங்கள் சர்வர் ஐபி முகவரியுடன் தொடங்கும் தவறான வரியை நீக்கவும்.

source: Be sure to set your password and root's password.
ta: உங்கள் கடவுச்சொல் மற்றும் ரூட்டின் கடவுச்சொல்லை அமைக்க மறக்காதீர்கள்.

source: ssh root@@<remote ip address> passwd ; for the root password passwd <username> ; for the user password
ta: பாஓடு ரூட்@@<தொலைநிலை ஐபி முகவரி> கடவுச்சீட்டு ; ரூட் கடவுச்சொல்லுக்கு passwd <பயனர்பெயர்> ; பயனர் கடவுச்சொல்லுக்காக

source: You may not be able to run the above commands at this point. If you have issues remotely logging into your linode box via SSH, then you may still need to set your root and user password initially by clicking on the ``Launch Console'' option in your linode. Choose the ``Glish'' instead of ``Weblish''. Now you should be able to ssh into the machine.
ta: இந்த கட்டத்தில் மேலே உள்ள கட்டளைகளை இயக்க முடியாமல் போகலாம். பாஓடு வழியாக உங்கள் லினோட் பெட்டியில் தொலைவிலிருந்து உள்நுழைவதில் சிக்கல்கள் இருந்தால், உங்கள் லினோடில் உள்ள ``Launch Console" விருப்பத்தை சொடுக்கு செய்வதன் மூலம் உங்கள் ரூட் மற்றும் பயனர் கடவுச்சொல்லை ஆரம்பத்தில் அமைக்க வேண்டும். ``Weblish'' என்பதற்குப் பதிலாக ``Glish'' என்பதைத் தேர்ந்தெடுக்கவும். இப்போது நீங்கள் இயந்திரத்தில் பாஓடு செய்ய முடியும்.

source: Hooray! At this point you can shut down the server, delete the Debian disk, and resize the Guix to the rest of the size. Congratulations!
ta: ஊரே! இந்த கட்டத்தில் நீங்கள் சேவையகத்தை மூடலாம், டெபியன் வட்டை நீக்கலாம் மற்றும் மீதமுள்ள அளவிற்கு Guix அளவை மாற்றலாம். வாழ்த்துகள்!

source: By the way, if you save it as a disk image right at this point, you'll have an easy time spinning up new Guix images! You may need to down-size the Guix image to 6144MB, to save it as an image. Then you can resize it again to the max size.
ta: இந்த நேரத்தில், நீங்கள் அதை வட்டுப் படமாகச் சேமித்தால், புதிய Guix படங்களைச் சுழற்றுவது உங்களுக்கு எளிதாக இருக்கும்! Guix படத்தைப் படமாகச் சேமிக்க, 6144MB ஆகக் குறைக்க வேண்டும். பின்னர் நீங்கள் அதை மீண்டும் அதிகபட்ச அளவிற்கு மாற்றலாம்.

source: kimsufi, Kimsufi, OVH
ta: கிம்சுஃபி, கிம்சுஃபி, ஓவிஎச்

source: To run Guix on a server hosted by @uref{https://www.kimsufi.com/, Kimsufi}, click on the netboot tab then select rescue64-pro and restart.
ta: @uref{https://www.kimsufi.com/, Kimsufi} வழங்கும் சர்வரில் Guix ஐ இயக்க, netboot தாவலைக் சொடுக்கு செய்து, restore64-pro என்பதைத் தேர்ந்தெடுத்து மீண்டும் தொடங்கவும்.

source: OVH will email you the credentials required to ssh into a Debian system.
ta: டெபியன் அமைப்பில் சேர்வதற்குத் தேவையான நற்சான்றிதழ்களை OVH உங்களுக்கு மின்னஞ்சல் செய்யும்.

source: Now you can run the "install guix from @pxref{Binary Installation,,, guix, GNU Guix}" steps:
ta: இப்போது நீங்கள் "install guix இருந்து @pxref{Binary Installation,,, guix, GNU Guix}" படிகளை இயக்கலாம்:

source: wget https://git.savannah.gnu.org/cgit/guix.git/plain/etc/guix-install.sh chmod +x guix-install.sh ./guix-install.sh guix pull
ta: wget https://git.savannah.gnu.org/cgit/guix.git/plain/etc/guix-install.sh chmod +x guix-install.sh ./guix-install.sh guix இழுப்பு

source: Partition the drives and format them, first stop the raid array:
ta: டிரைவ்களைப் பிரித்து அவற்றை வடிவமைக்கவும், முதலில் ரெய்டு வரிசையை நிறுத்தவும்:

source: Then wipe the disks and set up the partitions, we will create a RAID 1 array.
ta: பின்னர் வட்டுகளை துடைத்து பகிர்வுகளை அமைக்கவும், நாம் ஒரு RAID 1 வரிசையை உருவாக்குவோம்.

source: parted /dev/sda --align=opt -s -m -- mklabel gpt parted /dev/sda --align=opt -s -m -- \ mkpart bios_grub 1049kb 512MiB \ set 1 bios_grub on parted /dev/sda --align=opt -s -m -- \ mkpart primary 512MiB -512MiB set 2 raid on parted /dev/sda --align=opt -s -m -- mkpart primary linux-swap 512MiB 100%
ta: பிரிந்தது /dev/sda --align=opt -s -m -- mklabel gpt பிரிந்தது /dev/sda --align=opt -s -m -- \ mkpart bios_grub 1049kb 512MiB \ 1 bios_grub ஐ அமைக்கவும் பிரிந்தது /dev/sda --align=opt -s -m -- \ mkpart முதன்மை 512MiB -512MiB மீது 2 ரெய்டு அமைக்கப்பட்டது parted /dev/sda --align=opt -s -m -- mkpart முதன்மை linux-swap 512MiB 100%

source: parted /dev/sdb --align=opt -s -m -- mklabel gpt parted /dev/sdb --align=opt -s -m -- \ mkpart bios_grub 1049kb 512MiB \ set 1 bios_grub on parted /dev/sdb --align=opt -s -m -- \ mkpart primary 512MiB -512MiB \ set 2 raid on parted /dev/sdb --align=opt -s -m -- mkpart primary linux-swap 512MiB 100%
ta: பிரிந்தது /dev/sdb --align=opt -s -m -- mklabel gpt பிரிந்தது /dev/sdb --align=opt -s -m -- \ mkpart bios_grub 1049kb 512MiB \ 1 bios_grub ஐ அமைக்கவும் பிரிந்தது /dev/sdb --align=opt -s -m -- \ mkpart முதன்மை 512MiB -512MiB \ மீது 2 ரெய்டு அமைக்கப்பட்டது parted /dev/sdb --align=opt -s -m -- mkpart முதன்மை linux-swap 512MiB 100%

source: Create the array:
ta: வரிசையை உருவாக்கவும்:

source: mdadm --create /dev/md127 --level=1 --raid-disks=2 \ --metadata=0.90 /dev/sda2 /dev/sdb2
ta: mdadm --create /dev/md127 --level=1 --raid-disks=2 \ --மெட்டாடேட்டா=0.90 /dev/sda2 /dev/sdb2

source: Now create file systems on the relevant partitions, first the boot partitions:
ta: இப்போது தொடர்புடைய பகிர்வுகளில் கோப்பு முறைமைகளை உருவாக்கவும், முதலில் துவக்க பகிர்வுகள்:

source: Then the root partition:
ta: பின்னர் ரூட் பகிர்வு:

source: Initialize the swap partitions:
ta: ச்வாப் பகிர்வுகளை துவக்கவும்:

source: mkswap /dev/sda3 swapon /dev/sda3 mkswap /dev/sdb3 swapon /dev/sdb3
ta: மக்சூப்/விருந்தினர்/தலைவலி நோக்கம்/விருந்தினர்/தலைவலி மக்சூப்/விருந்தினர்/சதாபா நோக்கம்/விருந்தினர்/சதாபா

source: Mount the guix drive:
ta: guix இயக்கியை ஏற்றவும்:

source: mkdir /mnt/guix mount /dev/md127 /mnt/guix
ta: mkdir /mnt/chalk மவுண்ட் /dev/md127 /mnt/plaster

source: Now is time to write an operating system declaration @file{os.scm} file; here is a sample:
ta: இயக்க முறைமை அறிவிப்பு @file{os.scm} கோப்பை எழுதுவதற்கான நேரம் இது; இங்கே ஒரு மாதிரி:

source: (use-modules (gnu) (guix)) (use-service-modules networking ssh vpn virtualization sysctl admin mcron) (use-package-modules ssh tls tmux vpn virtualization)
ta: (பயன்படுத்தும் தொகுதிகள் (gnu) (guix)) (use-service-modules networking பாஓடு vpn virtualization sysctl admin mcron) (use-package-modules பாஓடு tls tmux vpn virtualization)

source: (operating-system (host-name "kimsufi")
ta: (இயக்க அமைப்பு (புரவலர் பெயர் "கிம்சுஃபி")

source: (bootloader (bootloader-configuration (bootloader grub-bootloader) (targets (list "/dev/sda" "/dev/sdb")) (terminal-outputs '(console))))
ta: (பூட்லோடர் (பூட்லோடர்-கட்டமைப்பு (பூட்லோடர் க்ரப்-பூட்லோடர்) (இலக்குகள் (பட்டியல் "/dev/sda" "/dev/sdb")) (டெர்மினல்-அவுட்புட்ச் '(கன்சோல்)))

source: ;; Add a kernel module for RAID-1 (aka. "mirror"). (initrd-modules (cons* "raid1" %base-initrd-modules))
ta: ;; RAID-1 க்கான கர்னல் தொகுதியைச் சேர்க்கவும் (அக்கா. "மிரர்"). (initrd-modules (cons* "raid1" %base-initrd-modules))

source: (mapped-devices (list (mapped-device (source (list "/dev/sda2" "/dev/sdb2")) (target "/dev/md127") (type raid-device-mapping))))
ta: (வரைபடம் செய்யப்பட்ட சாதனங்கள் (பட்டியலிடப்பட்ட சாதனம் (ஆதாரம் (பட்டியல் "/dev/sda2" "/dev/sdb2")) (இலக்கு "/dev/md127") (வகை ரெய்டு-சாதனம்-மேப்பிங்))))

source: (swap-devices (list (swap-space (target "/dev/sda3")) (swap-space (target "/dev/sdb3"))))
ta: (இடமாற்று சாதனங்கள் (பட்டியல் (இடமாற்று-வெளி (இலக்கு "/dev/sda3")) (இடமாற்று-வெளி (இலக்கு "/dev/sdb3")))

source: (issue ;; Default contents for /etc/issue. "\ This is the GNU system at Kimsufi. Welcome.\n")
ta: (பிரச்சினை ;; /etc/issue க்கான இயல்புநிலை உள்ளடக்கங்கள். "\ இது கிம்சுஃபியில் உள்ள குனு அமைப்பு. வரவேற்கிறோம்.\n")

source: (file-systems (cons* (file-system (mount-point "/") (device "/dev/md127") (type "ext4") (dependencies mapped-devices)) %base-file-systems))
ta: (கோப்பு முறைமைகள் (தீமைகள்* (கோப்பு முறை (மவுண்ட்-பாயின்ட் "/") (சாதனம் "/dev/md127") (வகை "ext4") (சார்புகள் வரைபட-சாதனங்கள்)) %base-file-systems))

source: (users (cons (user-account (name "guix") (comment "guix") (group "users") (supplementary-groups '("wheel")) (home-directory "/home/guix")) %base-user-accounts))
ta: (பயனர்கள் (தீமைகள் (பயனர் கணக்கு (பெயர் "guix") (கருத்து "guix") (குழு "பயனர்கள்") (துணை-குழுக்கள் '("சக்கரம்")) (முகப்பு அடைவு "/home/guix")) %பேச்-பயனர்-கணக்குகள்))

source: (sudoers-file (plain-file "sudoers" "\ root ALL=(ALL) ALL %wheel ALL=(ALL) ALL guix ALL=(ALL) NOPASSWD:ALL\n"))
ta: (sudoers-file (வெற்று கோப்பு "sudoers" "\ ரூட் ALL=(ALL) அனைத்தும் %சக்கரம் ALL=(ALL) அனைத்தும் guix ALL=(ALL) NOPASSWD:ALL\n"))

source: ;; Globally-installed packages. (packages (cons* tmux gnutls wireguard-tools %base-packages)) (services (cons* (service static-networking-service-type (list (static-networking (addresses (list (network-address (device "enp3s0") (value "@var{server-ip-address}/24")))) (routes (list (network-route (destination "default") (gateway "@var{server-gateway}")))) (name-servers '("213.186.33.99")))))
ta: ;; உலகளவில் நிறுவப்பட்ட தொகுப்புகள். (தொகுப்புகள் (cons* tmux gnutls wireguard-tools %base-packages)) (சேவைகள் (தீமைகள்* (சேவை நிலையான-நெட்வொர்க்கிங்-சேவை-வகை (பட்டியல் (நிலையான-நெட்வொர்க்கிங் (முகவரிகள் (பட்டியல் (நெட்வொர்க்-முகவரி (சாதனம் "enp3s0") (மதிப்பு "@var{server-ip-address}/24")))) (பாதைகள் (பட்டியல் (நெட்வொர்க்-ரூட் (இலக்கு "இயல்புநிலை") (கேட்வே "@var{server-gateway}")))) (பெயர்-சேவையகங்கள் '("213.186.33.99")))))

source: (service unattended-upgrade-service-type)
ta: (சேவை கவனிக்கப்படாத-மேம்படுத்தல்-சேவை வகை)

source: (service openssh-service-type (openssh-configuration (openssh openssh-sans-x) (permit-root-login #f) (authorized-keys `(("guix" ,(plain-file "@var{ssh-key-name.pub}" "@var{ssh-public-key-content}")))))) (modify-services %base-services (sysctl-service-type config => (sysctl-configuration (settings (append '(("net.ipv6.conf.all.autoconf" . "0") ("net.ipv6.conf.all.accept_ra" . "0")) %default-sysctl-settings))))))))
ta: (சேவை openssh-service-type (openssh-கட்டமைப்பு (openssh openssh-sans-x) (permit-root-login #f) (அங்கீகரிக்கப்பட்ட விசைகள் `("guix" ,(plain-file "@var{ssh-key-name.pub}" "@var{ssh-public-key-content}")))))) (மாற்று-சேவைகள் %அடிப்படை-சேவைகள் (sysctl-சேவை வகை config => (sysctl-கட்டமைப்பு (அமைப்புகள் (("net.ipv6.conf.all.autoconf" . "0") ("net.ipv6.conf.all.accept_ra" . "0")) %default-sysctl-settings))))))))

source: Don't forget to substitute the @var{server-ip-address}, @var{server-gateway}, @var{ssh-key-name} and @var{ssh-public-key-content} variables with your own values.
ta: @var{server-ip-address}, @var{server-gateway}, @var{ssh-key-name} மற்றும் @var{ssh-public-key-content} மாறிகளை உங்கள் சொந்த மதிப்புகளுடன் மாற்ற மறக்காதீர்கள்.

source: The gateway is the last usable IP in your block so if you have a server with an IP of @samp{37.187.79.10} then its gateway will be @samp{37.187.79.254}.
ta: கேட்வே உங்கள் பிளாக்கில் கடைசியாகப் பயன்படுத்தக்கூடிய IP ஆகும், எனவே உங்களிடம் @samp{37.187.79.10} ஐபி கொண்ட சர்வர் இருந்தால், அதன் கேட்வே @samp{37.187.79.254} ஆக இருக்கும்.

source: Transfer your operating system declaration @file{os.scm} file on the server via the @command{scp} or @command{sftp} commands.
ta: @command{sftp} அல்லது @command{scp} கட்டளைகள் வழியாக உங்கள் இயக்க முறைமை அறிவிப்பு @file{os.scm} கோப்பை சர்வரில் மாற்றவும்.

source: Now all that is left is to install Guix with a @code{guix system init} and restart.
ta: இப்போது @code{guix system init} உடன் Guix ஐ நிறுவி, மறுதொடக்கம் செய்வது மட்டுமே எஞ்சியுள்ளது.

source: However we first need to set up a chroot, because the root partition of the rescue system is mounted on an aufs partition and if you try to install Guix it will fail at the GRUB install step complaining about the canonical path of "aufs".
ta: இருப்பினும் நாம் முதலில் ஒரு chroot ஐ அமைக்க வேண்டும், ஏனெனில் மீட்பு அமைப்பின் ரூட் பகிர்வு ஒரு aufs பகிர்வில் பொருத்தப்பட்டுள்ளது மற்றும் நீங்கள் Guix ஐ நிறுவ முயற்சித்தால் அது GRUB நிறுவல் கட்டத்தில் தோல்வியடையும், "aufs" இன் நியமன பாதையைப் பற்றி குற்றச்சாட்டு செய்கிறது.

source: Install packages that will be used in the chroot:
ta: chroot இல் பயன்படுத்தப்படும் தொகுப்புகளை நிறுவவும்:

source: guix install bash-static parted util-linux-with-udev coreutils guix
ta: guix இன்ச்டால் பாச்-ச்டேடிக் பார்ட்டட் util-linux-with-udev coreutils guix

source: Then run the following to create directories needed for the chroot:
ta: chroot க்கு தேவையான கோப்பகங்களை உருவாக்க பின்வருவனவற்றை இயக்கவும்:

source: cd /mnt && \ mkdir -p bin etc gnu/store root/.guix-profile/ root/.config/guix/current \ var/guix proc sys dev
ta: cd /mnt && \ mkdir -p bin போறவை gnu/store root/.guix-profile/ root/.config/guix/current \ var/guix proc sys dev

source: Copy the host resolv.conf in the chroot:
ta: chroot இல் புரவலன் resolv.conf ஐ நகலெடுக்கவும்:

source: cp /etc/resolv.conf etc/
ta: cp /etc/resolv.conf போன்றவை/

source: Mount block devices, the store and its database and the current guix config:
ta: மவுண்ட் பிளாக் சாதனங்கள், கடை மற்றும் அதன் தரவுத்தளம் மற்றும் தற்போதைய guix config:

source: mount --rbind /proc /mnt/proc mount --rbind /sys /mnt/sys mount --rbind /dev /mnt/dev mount --rbind /var/guix/ var/guix/ mount --rbind /gnu/store gnu/store/ mount --rbind /root/.config/ root/.config/ mount --rbind /root/.guix-profile/bin/ bin mount --rbind /root/.guix-profile root/.guix-profile/
ta: மவுண்ட் --rbind /proc /mnt/proc மவுண்ட் --rbind /sys /mnt/sys மவுண்ட் --rbind /dev /mnt/dev மவுண்ட் --rbind /var/guix/ var/guix/ மவுண்ட் --rbind /gnu/store gnu/store/ ஏற்ற --rbind /root/.config/ root/.config/ மவுண்ட் --rbind /root/.guix-profile/bin/ bin மவுண்ட் --rbind /root/.guix-profile root/.guix-profile/

source: Chroot in /mnt and install the system:
ta: /mnt இல் க்ரூட் செய்து கணினியை நிறுவவும்:

source: chroot /mnt/ /bin/bash
ta: chroot /mnt/ /தொட்டி/பாமீஓடு

source: guix system init /root/os.scm /guix
ta: பிளாச்டர் அமைப்பு init /root/os.scm /plaster

source: Finally, from the web user interface (UI), change @samp{netboot} to @samp{boot to disk} and restart (also from the web UI).
ta: இறுதியாக, இணைய பயனர் இடைமுகத்திலிருந்து (UI), @samp{netboot} ஐ @samp{boot to disk} மற்றும் மறுதொடக்கம் (இணைய இடைமுகம் இலிருந்தும்).

source: Wait a few minutes and try to ssh with @code{ssh guix@@@var{server-ip-address>} -i @var{path-to-your-ssh-key}}
ta: சில நிமிடங்கள் காத்திருந்து, @code{ssh guix@@@var{server-ip-address>} -i @var{path-to-your-ssh-key}} மூலம் பாஓடு செய்ய முயற்சிக்கவும்

source: You should have a Guix system up and running on Kimsufi; congratulations!
ta: நீங்கள் கிம்சுஃபியில் ஒரு Guix அமைப்பு இயங்க வேண்டும்; வாழ்த்துக்கள்!

source: To bind mount a file system, one must first set up some definitions before the @code{operating-system} section of the system definition. In this example we will bind mount a folder from a spinning disk drive to @file{/tmp}, to save wear and tear on the primary SSD, without dedicating an entire partition to be mounted as @file{/tmp}.
ta: ஒரு கோப்பு முறைமையை மவுண்ட் செய்ய, முதலில் கணினி வரையறையின் @code{operating-system} பிரிவிற்கு முன் சில வரையறைகளை அமைக்க வேண்டும். இந்த எடுத்துக்காட்டில், முழுப் பகிர்வையும் @file{/tmp} ஆக ஏற்றுவதற்கு ஒதுக்காமல், முதன்மை SSDயில் தேய்மானம் மற்றும் தேய்மானத்தைச் சேமிக்க, சுழலும் வட்டு இயக்ககத்திலிருந்து @file{/tmp}க்கு ஒரு கோப்புறையை பிணைப்போம்.

source: First, the source drive that hosts the folder we wish to bind mount should be defined, so that the bind mount can depend on it.
ta: முதலில், நாம் பைண்ட் மவுண்ட் செய்ய விரும்பும் கோப்புறையை புரவலன் செய்யும் சோர்ச் இயக்கி வரையறுக்கப்பட வேண்டும், இதனால் பைண்ட் மவுண்ட் அதைச் சார்ந்திருக்கும்.

source: (define source-drive ;; "source-drive" can be named anything you want. (file-system (device (uuid "UUID goes here")) (mount-point "/path-to-spinning-disk-goes-here") (type "ext4"))) ;Make sure to set this to the appropriate type for your drive.
ta: (மூல-இயக்கியை வரையறுக்கவும்;; "மூல-இயக்கி" நீங்கள் விரும்பும் எதையும் பெயரிடலாம். (கோப்பு முறை (சாதனம் (uuid "UUID இங்கே செல்கிறது")) (மவுண்ட்-பாயின்ட் "/path-to-spinning-disk-goes-here") (வகை "ext4"))) ;உங்கள் இயக்ககத்திற்கு பொருத்தமான வகைக்கு இதை அமைக்கவும்.

source: The source folder must also be defined, so that guix will know it's not a regular block device, but a folder.
ta: மூலக் கோப்புறையும் வரையறுக்கப்பட வேண்டும், எனவே இது வழக்கமான பிளாக் சாதனம் அல்ல, ஒரு கோப்புறை என்பதை guix அறியும்.
