Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: ;; "source-directory" can be named any valid variable name. (define (%source-directory) "/path-to-spinning-disk-goes-here/tmp")
ta: ;; "source-directory" எந்த செல்லுபடியாகும் மாறி பெயரையும் பெயரிடலாம். (%source-டைரக்டரி) "/path-to-spinning-disk-goes-here/tmp")

source: Finally, inside the @code{file-systems} definition, we must add the mount itself.
ta: இறுதியாக, @code{file-systems} வரையறைக்குள், நாம் மவுண்ட்டையே சேர்க்க வேண்டும்.

source: (file-systems (cons*
ta: (கோப்பு முறைமைகள் (பாதிப்புகள்*

source: ...<other drives omitted for clarity>...
ta: ...<தெளிவுக்காக மற்ற இயக்கிகள் தவிர்க்கப்பட்டன>...

source: ;; Must match the name you gave the source drive in the earlier definition. source-drive
ta: ;; முந்தைய வரையறையில் மூல இயக்ககத்திற்கு நீங்கள் கொடுத்த பெயருடன் பொருந்த வேண்டும். மூல இயக்கி

source: (file-system ;; Make sure "source-directory" matches your earlier definition. (device (%source-directory)) (mount-point "/tmp") ;; We are mounting a folder, not a partition, so this type needs to be "none" (type "none") (flags '(bind-mount)) ;; Ensure "source-drive" matches what you've named the variable for the drive. (dependencies (list source-drive)) )
ta: (கோப்பு முறை ;; "மூல-கோப்பகம்" உங்கள் முந்தைய வரையறையுடன் பொருந்துகிறது என்பதை உறுதிப்படுத்தவும். (சாதனம் (%மூல-அடைவு)) (மவுண்ட்-பாயின்ட் "/டிஎம்பி") ;; நாங்கள் ஒரு கோப்புறையை ஏற்றுகிறோம், பகிர்வை அல்ல, எனவே இந்த வகை "இல்லை" என்று இருக்க வேண்டும் ("இல்லை" என தட்டச்சு செய்க) (கொடிகள் '(பைண்ட்-மவுண்ட்)) ;; இயக்ககத்திற்கான மாறிக்கு நீங்கள் பெயரிட்டுள்ளவற்றுடன் "source-drive" பொருந்துகிறது என்பதை உறுதிப்படுத்தவும். (சார்புகள் (பட்டியல் மூல இயக்கி)) )

source: ...<other drives omitted for clarity>...
ta: ...<தெளிவுக்காக மற்ற இயக்கிகள் தவிர்க்கப்பட்டன>...

source: Guix daemon can use a HTTP proxy to get substitutes, here we are configuring it to get them via Tor.
ta: Guix deemon மாற்றுகளைப் பெற HTTP ப்ராக்சியைப் பயன்படுத்தலாம், அவற்றை Tor வழியாகப் பெறுவதற்கு இங்கே உள்ளமைக்கிறோம்.

source: Warning
ta: எச்சரிக்கை

source: @emph{Not all} Guix daemon's traffic will go through Tor! Only HTTP/HTTPS will get proxied; FTP, Git protocol, SSH, etc connections will still go through the clearnet. Again, this configuration isn't foolproof some of your traffic won't get routed by Tor at all. Use it at your own risk.
ta: @emph{Not all} Guix deemon இன் போக்குவரத்து Tor வழியாக செல்லும்! HTTP/HTTPS மட்டுமே பதிலாள் செய்யப்படும்; FTP, Git புரோட்டோகால், பாஓடு போன்ற இணைப்புகள் இன்னும் கிளியர்நெட் வழியாகச் செல்லும். மீண்டும், இந்த உள்ளமைவு தவறானது அல்ல, உங்களின் சில ட்ராஃபிக்கை Tor ஆல் வழிநடத்த முடியாது. உங்கள் சொந்த ஆபத்தில் அதைப் பயன்படுத்தவும்.

source: Also note that the procedure described here applies only to package substitution. When you update your guix distribution with @command{guix pull}, you still need to use @command{torsocks} if you want to route the connection to guix's git repository servers through Tor.
ta: இங்கே விவரிக்கப்பட்டுள்ள செயல்முறை தொகுப்பு மாற்றீட்டிற்கு மட்டுமே பொருந்தும் என்பதை நினைவில் கொள்ளவும். @command{guix pull} மூலம் உங்கள் guix விநியோகத்தைப் புதுப்பிக்கும்போது, Tor மூலம் guix இன் git களஞ்சிய சேவையகங்களுக்கு இணைப்பைச் செலுத்த விரும்பினால், நீங்கள் @command{torsocks} ஐப் பயன்படுத்த வேண்டும்.

source: Guix's substitute server is available as a Onion service, if you want to use it to get your substitutes through Tor configure your system as follow:
ta: Guix இன் மாற்று சேவையகம் வெங்காய சேவையாகக் கிடைக்கிறது, Tor மூலம் உங்கள் மாற்றுகளைப் பெற அதைப் பயன்படுத்த விரும்பினால், உங்கள் கணினியை பின்வருமாறு கட்டமைக்கவும்:

source: (use-modules (gnu)) (use-service-module base networking)
ta: (பயன்படுத்தும் தொகுதிகள் (gnu)) (பயன்பாடு-சேவை-தொகுதி அடிப்படை நெட்வொர்க்கிங்)

source: (operating-system … (services (cons (service tor-service-type (tor-configuration (config-file (plain-file "tor-config" "HTTPTunnelPort 127.0.0.1:9250")))) (modify-services %base-services (guix-service-type config => (guix-configuration (inherit config) ;; ci.guix.gnu.org's Onion service (substitute-urls "\ @value{SUBSTITUTE-TOR-URL}") (http-proxy "http://localhost:9250")))))))
ta: (இயக்க அமைப்பு … (சேவைகள் (பாதிப்பு (சேவை முதல் பணி வகை (டோர்-கட்டமைப்பு (config-file (எளிய-கோப்பு "tor-config" "HTTPTunnelPort 127.0.0.1:9250")))) (மாற்று-சேவைகள் %அடிப்படை-சேவைகள் (guix-சேவை வகை config => (guix-configuration (மரபு கட்டமைப்பு) ;; ci.guix.gnu.org இன் வெங்காய பணி (மாற்று-urls "\ @மதிப்பு{SUBSTITUTE-TOR-URL}") (http-ப்ராக்சி "http://localhost:9250")))))))

source: This will keep a tor process running that provides a HTTP CONNECT tunnel which will be used by @command{guix-daemon}. The daemon can use other protocols than HTTP(S) to get remote resources, request using those protocols won't go through Tor since we are only setting a HTTP tunnel here. Note that @code{substitutes-urls} is using HTTPS and not HTTP or it won't work, that's a limitation of Tor's tunnel; you may want to use @command{privoxy} instead to avoid such limitations.
ta: இது @command{guix-daemon} ஆல் பயன்படுத்தப்படும் HTTP கனெக்ட் சுரங்கப்பாதையை வழங்கும் டோர் செயல்முறையை தொடர்ந்து இயக்கும். தொலைநிலை ஆதாரங்களைப் பெற HTTP(S) ஐத் தவிர மற்ற நெறிமுறைகளை டெமான் பயன்படுத்தலாம், அந்த நெறிமுறைகளைப் பயன்படுத்துவதற்கான கோரிக்கை Tor வழியாக செல்லாது, ஏனெனில் நாங்கள் இங்கு HTTP சுரங்கப்பாதையை மட்டுமே அமைக்கிறோம். @code{substitutes-urls} HTTPS ஐப் பயன்படுத்துகிறது, HTTP அல்ல அல்லது அது வேலை செய்யாது, இது Tor இன் சுரங்கப்பாதையின் வரம்பு; அத்தகைய வரம்புகளைத் தவிர்க்க நீங்கள் @command{privoxy} ஐப் பயன்படுத்த விரும்பலாம்.

source: If you don't want to always get substitutes through Tor but using it just some of the times, then skip the @code{guix-configuration}. When you want to get a substitute from the Tor tunnel run:
ta: நீங்கள் எப்போதும் Tor மூலம் மாற்றுகளைப் பெற விரும்பவில்லை, ஆனால் சில நேரங்களில் அதைப் பயன்படுத்தினால், @code{guix-configuration} ஐத் தவிர்க்கவும். டோர் சுரங்கப்பாதை ஓட்டத்திலிருந்து மாற்றீட்டைப் பெற விரும்பினால்:

source: sudo herd set-http-proxy guix-daemon http://localhost:9250 guix build \ --substitute-urls=@value{SUBSTITUTE-TOR-URL} @dots{}
ta: sudo hrd set-http-proxy guix-daemon http://localhost:9250 guix உருவாக்கம் \ --substitute-urls=@value{SUBSTITUTE-TOR-URL} @dots{}

source: NGINX could be extended with Lua scripts.
ta: லுவா ச்கிரிப்ட்களுடன் NGINX நீட்டிக்கப்படலாம்.

source: Guix provides NGINX service with ability to load Lua module and specific Lua packages, and reply to requests by evaluating Lua scripts.
ta: Guix ஆனது லுவா மாட்யூல் மற்றும் குறிப்பிட்ட லுவா தொகுப்புகளை ஏற்றும் திறனுடன் NGINX சேவையை வழங்குகிறது, மேலும் லுவா ச்கிரிப்ட்களை மதிப்பிடுவதன் மூலம் கோரிக்கைகளுக்கு பதிலளிக்கிறது.

source: The following example demonstrates system definition with configuration to evaluate @file{index.lua} Lua script on HTTP request to @uref{http://localhost/hello} endpoint:
ta: @uref{http://localhost/hello} எண்ட்பாயிண்டிற்கான HTTP கோரிக்கையில் @file{index.lua} லுவா ச்கிரிப்டை மதிப்பிடுவதற்கான உள்ளமைவுடன் பின்வரும் எடுத்துக்காட்டு அமைப்பு வரையறையை நிரூபிக்கிறது:

source: local shell = require "resty.shell"
ta: உள்ளக செல் = "resty.shell" தேவை

source: local stdin = "" local timeout = 1000 -- ms local max_size = 4096 -- byte
ta: உள்ளக stdin = "" உள்ளக நேரம் முடிந்தது = 1000 -- ms உள்ளக max_size = 4096 -- பைட்

source: local ok, stdout, stderr, reason, status = shell.run([[/run/current-system/profile/bin/ls /tmp]], stdin, timeout, max_size)
ta: உள்ளக சரி, stdout, stderr, காரணம், நிலை = shell.run([[/run/current-system/profile/bin/ls /tmp]], stdin, timeout, max_size)

source: (use-modules (gnu)) (use-service-modules #;… web) (use-package-modules #;… lua) (operating-system ;; … (services ;; … (service nginx-service-type (nginx-configuration (modules (list (file-append nginx-lua-module "/etc/nginx/modules/ngx_http_lua_module.so"))) (lua-package-path (list lua-resty-core lua-resty-lrucache lua-resty-signal lua-tablepool lua-resty-shell)) (lua-package-cpath (list lua-resty-signal)) (server-blocks (list (nginx-server-configuration (server-name '("localhost")) (listen '("80")) (root "/etc") (locations (list (nginx-location-configuration (uri "/hello") (body (list #~(format #f "content_by_lua_file ~s;" #$(local-file "index.lua"))))))))))))))
ta: (பயன்படுத்தும் தொகுதிகள் (gnu)) (பயன்-சேவை-தொகுதிகள் #;... வலை) (பயன்பாடு-தொகுப்பு-தொகுதிகள் #;... lua) (இயக்க அமைப்பு ;; … (சேவைகள் ;; … (சேவை nginx-சேவை வகை (nginx-கட்டமைப்பு (தொகுதிகள் (பட்டியல் (file-append nginx-lua-module "/etc/nginx/modules/ngx_http_lua_module.so"))) (lua-package-path (Lua-resty-core பட்டியல் lua-resty-lrucache lua-resty-signal lua-tablepool lua-resty-shell)) (lua-package-cpath (list lua-resty-signal)) (சேவையகத் தொகுதிகள் (பட்டியல் (nginx-server-configuration (சர்வர்-பெயர் '("லோக்கல் ஓச்ட்")) (கேளுங்கள் '("80")) (ரூட் "/etc") (இடங்கள் (பட்டியல் (nginx-location-configuration (உரி "/அலோ") (உடல் (பட்டியல் #~(வடிவம் #f "உள்ளடக்கம்_லுவா_கோப்பு ~s;" #$(உள்ளூர்-கோப்பு "index.lua")))))))))))))))

source: music server, headless
ta: இசை சர்வர், தலையில்லாத

source: bluetooth, ALSA configuration
ta: ஊடலை, ALSA கட்டமைப்பு

source: MPD, the Music Player Daemon, is a flexible server-side application for playing music. Client programs on different machines on the network --- a mobile phone, a laptop, a desktop workstation --- can connect to it to control the playback of audio files from your local music collection. MPD decodes the audio files and plays them back on one or many outputs.
ta: MPD, மியூசிக் பிளேயர் டீமான், இசையை இயக்குவதற்கான ஒரு நெகிழ்வான சர்வர்-சைட் அப்ளிகேசன் ஆகும். நெட்வொர்க்கில் உள்ள வெவ்வேறு கணினிகளில் உள்ள கிளையன்ட் புரோகிராம்கள் --- மொபைல் ஃபோன், லேப்டாப், டெச்க்டாப் பணிநிலையம் --- உங்கள் உள்ளக இசை சேகரிப்பில் இருந்து ஆடியோ கோப்புகளை இயக்குவதைக் கட்டுப்படுத்த அதனுடன் இணைக்க முடியும். MPD ஆடியோ கோப்புகளை டிகோட் செய்து ஒன்று அல்லது பல வெளியீடுகளில் மீண்டும் இயக்குகிறது.

source: By default MPD will play to the default audio device. In the example below we make things a little more interesting by setting up a headless music server. There will be no graphical user interface, no Pulseaudio daemon, and no local audio output. Instead we will configure MPD with two outputs: a bluetooth speaker and a web server to serve audio streams to any streaming media player.
ta: இயல்பாக MPD ஆனது இயல்புநிலை ஆடியோ சாதனத்தில் இயங்கும். கீழே உள்ள எடுத்துக்காட்டில், எட்லெச் மியூசிக் சர்வரை அமைப்பதன் மூலம் விசயங்களை இன்னும் கொஞ்சம் சுவாரச்யமாக்குகிறோம். வரைகலை பயனர் இடைமுகம், பல்சோடியோ டீமான் மற்றும் உள்ளக ஆடியோ வெளியீடு எதுவும் இருக்காது. அதற்குப் பதிலாக MPDயை இரண்டு வெளியீடுகளுடன் உள்ளமைப்போம்: ஒரு ஊடலை ச்பீக்கர் மற்றும் எந்த ச்ட்ரீமிங் மீடியா பிளேயருக்கும் ஆடியோ ச்ட்ரீம்களை வழங்க வெப் சர்வர்.

source: Bluetooth is often rather frustrating to set up. You will have to pair your Bluetooth device and make sure that the device is automatically connected as soon as it powers on. The Bluetooth system service returned by the @code{bluetooth-service} procedure provides the infrastructure needed to set this up.
ta: ஊடலை அமைப்பது பெரும்பாலும் வெறுப்பாக இருக்கும். உங்கள் ஊடலை சாதனத்தை இணைக்க வேண்டும் மற்றும் சாதனம் இயக்கப்பட்டவுடன் தானாகவே இணைக்கப்பட்டிருப்பதை உறுதிசெய்ய வேண்டும். @code{bluetooth-service} நடைமுறை மூலம் வழங்கப்படும் ஊடலை சிச்டம் பணி, இதை அமைப்பதற்குத் தேவையான உள்கட்டமைப்பை வழங்குகிறது.

source: Reconfigure your system with at least the following services and packages:
ta: குறைந்தபட்சம் பின்வரும் சேவைகள் மற்றும் தொகுப்புகளுடன் உங்கள் கணினியை மறுகட்டமைக்கவும்:

source: (operating-system ;; … (packages (cons* bluez bluez-alsa %base-packages)) (services ;; … (dbus-service #:services (list bluez-alsa)) (bluetooth-service #:auto-enable? #t)))
ta: (இயக்க அமைப்பு ;; … (தொகுப்புகள் (தீமைகள்* bluez bluez-alsa %அடிப்படை தொகுப்புகள்)) (சேவைகள் ;; … (dbus-service #:services (list bluez-alsa)) (bluetooth-service #:auto-enable? #t)))

source: Start the @code{bluetooth} service and then use @command{bluetoothctl} to scan for Bluetooth devices. Try to identify your Bluetooth speaker and pick out its device ID from the resulting list of devices that is indubitably dominated by a baffling smorgasbord of your neighbors' home automation gizmos. This only needs to be done once:
ta: @code{bluetooth} சேவையைத் தொடங்கி, ஊடலை சாதனங்களை வருடு செய்ய @command{bluetoothctl} ஐப் பயன்படுத்தவும். உங்கள் ஊடலை ச்பீக்கரை அடையாளம் கண்டு, உங்கள் அண்டை வீட்டு ஆட்டோமேசன் கிச்மோசின் குழப்பமான ச்மோர்காச்போர்டால் சந்தேகத்திற்கு இடமின்றி ஆதிக்கம் செலுத்தும் சாதனங்களின் பட்டியலிலிருந்து அதன் சாதன ஐடியைத் தேர்ந்தெடுக்கவும். இது ஒரு முறை மட்டுமே செய்யப்பட வேண்டும்:

source: $ bluetoothctl [NEW] Controller 00:11:22:33:95:7F BlueZ 5.40 [default]
ta: $ bluetoothctl [புதிய] கன்ட்ரோலர் 00:11:22:33:95:7F BlueZ 5.40 [இயல்புநிலை]

source: [bluetooth]# power on [bluetooth]# Changing power on succeeded
ta: [புளூடூத் # பவர் ஆன் [புளூடூத்] சக்தியை மாற்றுதல் வெற்றியடைந்தது

source: [bluetooth]# agent on [bluetooth]# Agent registered
ta: [ப்ளூடூத் # ஏசென்ட் ஆன் [ப்ளூடூத் # ஏசென்ட் பதிவு

source: [bluetooth]# default-agent [bluetooth]# Default agent request successful
ta: [bluetooth]# default-agent [bluetooth]# இயல்புநிலை முகவர் கோரிக்கை செய்

source: [bluetooth]# scan on [bluetooth]# Discovery started [CHG] Controller 00:11:22:33:95:7F Discovering: yes [NEW] Device AA:BB:CC:A4:AA:CD My Bluetooth Speaker [NEW] Device 44:44:FF:2A:20:DC My Neighbor's TV @dots{}
ta: [ப்ளூடூத் # வருடு ஆன் [புளூடூத்] # கண்டுபிடிப்பு தொடங்கியது [CHG] கன்ட்ரோலர் 00:11:22:33:95:7F கண்டறிதல்: ஆம் [புதிய] சாதனம் AA:BB:CC:A4:AA:CD எனது ஊடலை ச்பீக்கர் [புதிய] சாதனம் 44:44:FF:2A:20:DC மை நேபர்ச் டிவி @dots{}

source: [bluetooth]# pair AA:BB:CC:A4:AA:CD Attempting to pair with AA:BB:CC:A4:AA:CD [CHG] Device AA:BB:CC:A4:AA:CD Connected: yes
ta: [புளூடூத்]# இணை AA:BB:CC:A4:AA:CD இதன் உடன் இணைக்க முயற்சிக்கிறது AA:BB:CC:A4:AA:CD [CHG] கருவி AA:BB:CC:A4:AA:CD இணைக்கப்பட்டுள்ளது: ஆம்

source: [My Bluetooth Speaker]# [CHG] Device AA:BB:CC:A4:AA:CD UUIDs: 0000110b-0000-1000-8000-00xxxxxxxxxx [CHG] Device AA:BB:CC:A4:AA:CD UUIDs: 0000110c-0000-1000-8000-00xxxxxxxxxx [CHG] Device AA:BB:CC:A4:AA:CD UUIDs: 0000110e-0000-1000-8000-00xxxxxxxxxx [CHG] Device AA:BB:CC:A4:AA:CD Paired: yes Pairing successful
ta: [எனது ஊடலை ச்பீக்கர்]# [CHG] சாதனம் AA:BB:CC:A4:AA:CD UUIDகள்: 0000110b-0000-1000-8000-00xxxxxxxxxx [CHG] சாதனம் AA:BB:CC:A4:AA:CD UUIDகள்: 0000110c-0000-1000-8000-00xxxxxxxxxx [CHG] சாதனம் AA:BB:CC:A4:AA:CD UUIDகள்: 0000110e-0000-1000-8000-00xxxxxxxxxx [CHG] சாதனம் AA:BB:CC:A4:AA:CD இணைக்கப்பட்டது: ஆம் இணைத்தல் செய்

source: [CHG] Device AA:BB:CC:A4:AA:CD Connected: no
ta: [CHG] சாதனம் AA:BB:CC:A4:AA:CD இணைக்கப்பட்டுள்ளது: இல்லை

source: [bluetooth]# [bluetooth]# trust AA:BB:CC:A4:AA:CD [bluetooth]# [CHG] Device AA:BB:CC:A4:AA:CD Trusted: yes Changing AA:BB:CC:A4:AA:CD trust succeeded
ta: [புளூடூத்] [ப்ளூடூத் # நம்பிக்கை AA:BB:CC:A4:AA:CD [bluetooth]# [CHG] சாதனம் AA:BB:CC:A4:AA:CD நம்பகமானது: ஆம் AA:BB:CC:A4:AA:CD நம்பிக்கையை மாற்றுவது வெற்றியடைந்தது

source: [bluetooth]# [bluetooth]# connect AA:BB:CC:A4:AA:CD Attempting to connect to AA:BB:CC:A4:AA:CD [bluetooth]# [CHG] Device AA:BB:CC:A4:AA:CD RSSI: -63 [CHG] Device AA:BB:CC:A4:AA:CD Connected: yes Connection successful
ta: [புளூடூத்] [bluetooth]# இணைக்க AA:BB:CC:A4:AA:CD AA:BB:CC:A4:AA:CD உடன் இணைக்க முயற்சிக்கிறது [bluetooth]# [CHG] சாதனம் AA:BB:CC:A4:AA:CD RSSI: -63 [CHG] சாதனம் AA:BB:CC:A4:AA:CD இணைக்கப்பட்டுள்ளது: ஆம் இணைப்பு வெற்றிகரமாக உள்ளது

source: [My Bluetooth Speaker]# scan off [CHG] Device AA:BB:CC:A4:AA:CD RSSI is nil Discovery stopped [CHG] Controller 00:11:22:33:95:7F Discovering: no
ta: [எனது ஊடலை ச்பீக்கர் # வருடு ஆஃப் [CHG] சாதனம் AA:BB:CC:A4:AA:CD RSSI சுழியம் கண்டுபிடிப்பு நிறுத்தப்பட்டது [CHG] கன்ட்ரோலர் 00:11:22:33:95:7F கண்டறிதல்: இல்லை

source: Congratulations, you can now automatically connect to your Bluetooth speaker!
ta: வாழ்த்துக்கள், நீங்கள் இப்போது தானாகவே உங்கள் ஊடலை ச்பீக்கருடன் இணைக்கலாம்!

source: It is now time to configure ALSA to use the @emph{bluealsa} Bluetooth module, so that you can define an ALSA pcm device corresponding to your Bluetooth speaker. For a headless server using @emph{bluealsa} with a fixed Bluetooth device is likely simpler than configuring Pulseaudio and its stream switching behavior. We configure ALSA by crafting a custom @code{alsa-configuration} for the @code{alsa-service-type}. The configuration will declare a @code{pcm} type @code{bluealsa} from the @code{bluealsa} module provided by the @code{bluez-alsa} package, and then define a @code{pcm} device of that type for your Bluetooth speaker.
ta: @emph{bluealsa} ஊடலை தொகுதியைப் பயன்படுத்த ALSA ஐ உள்ளமைக்க வேண்டிய நேரம் இது, இதன் மூலம் உங்கள் ஊடலை ச்பீக்கருடன் தொடர்புடைய ALSA pcm சாதனத்தை நீங்கள் வரையறுக்கலாம். நிலையான ஊடலை சாதனத்துடன் @emph{bluealsa} ஐப் பயன்படுத்தும் எட்லெச் சர்வருக்கு Pulseaudio மற்றும் அதன் ச்ட்ரீம் மாறுதல் நடத்தை உள்ளமைப்பதை விட எளிமையானதாக இருக்கலாம். @code{alsa-service-type} க்கான தனிப்பயன் @code{alsa-configuration} ஐ உருவாக்குவதன் மூலம் ALSA ஐ உள்ளமைக்கிறோம். @code{bluez-alsa} தொகுப்பால் வழங்கப்பட்ட @code{bluealsa} தொகுதியிலிருந்து @code{pcm} வகை @code{bluealsa} வகையை உள்ளமைவு அறிவிக்கும், பின்னர் உங்கள் ஊடலை ச்பீக்கருக்கு அந்த வகையான @code{pcm} சாதனத்தை வரையறுக்கும்.

source: All that is left then is to make MPD send audio data to this ALSA device. We also add a secondary MPD output that makes the currently played audio files available as a stream through a web server on port 8080. When enabled a device on the network could listen to the audio stream by connecting any capable media player to the HTTP server on port 8080, independent of the status of the Bluetooth speaker.
ta: இந்த ALSA சாதனத்திற்கு MPD ஆடியோ டேட்டாவை அனுப்புவதுதான் மிச்சம். துறைமுகம் 8080 இல் உள்ள இணைய சேவையகம் மூலம் தற்போது இயக்கப்படும் ஆடியோ கோப்புகளை ச்ட்ரீமாக கிடைக்கச் செய்யும் இரண்டாம் நிலை MPD வெளியீட்டையும் நாங்கள் சேர்க்கிறோம். நெட்வொர்க்கில் உள்ள சாதனம், ஊடலை ச்பீக்கரின் நிலையைப் பொருட்படுத்தாமல், துறைமுகம் 8080 இல் உள்ள HTTP சேவையகத்துடன் எந்தவொரு திறமையான மீடியா பிளேயரையும் இணைப்பதன் மூலம் ஆடியோ ச்ட்ரீமைக் கேட்க முடியும்.

source: What follows is the outline of an @code{operating-system} declaration that should accomplish the above-mentioned tasks:
ta: மேற்கூறிய பணிகளைச் செய்ய வேண்டிய @code{operating-system} அறிவிப்பின் அவுட்லைன் பின்வருமாறு:

source: (use-modules (gnu)) (use-service-modules audio dbus sound #;… etc) (use-package-modules audio linux #;… etc) (operating-system ;; … (packages (cons* bluez bluez-alsa %base-packages)) (services ;; … (service mpd-service-type (mpd-configuration (user "your-username") (music-dir "/path/to/your/music") (address "192.168.178.20") (outputs (list (mpd-output (type "alsa") (name "MPD") (extra-options ;; Use the same name as in the ALSA ;; configuration below. '((device . "pcm.btspeaker")))) (mpd-output (type "httpd") (name "streaming") (enabled? #false) (always-on? #true) (tags? #true) (mixer-type 'null) (extra-options '((encoder . "vorbis") (port . "8080") (bind-to-address . "192.168.178.20") (max-clients . "0") ;no limit (quality . "5.0") (format . "44100:16:1")))))))) (dbus-service #:services (list bluez-alsa)) (bluetooth-service #:auto-enable? #t) (service alsa-service-type (alsa-configuration (pulseaudio? #false) ;we don't need it (extra-options #~(string-append "\ # Declare Bluetooth audio device type \"bluealsa\" from bluealsa module pcm_type.bluealsa @{ lib \"" #$(file-append bluez-alsa "/lib/alsa-lib/libasound_module_pcm_bluealsa.so") "\" @}
ta: (பயன்படுத்தும் தொகுதிகள் (gnu)) (பயன்பாடு-சேவை-தொகுதிகள் ஆடியோ டிபச் ஒலி #;... போன்றவை) (use-package-modules audio linux #;... etc) (இயக்க அமைப்பு ;; … (தொகுப்புகள் (தீமைகள்* bluez bluez-alsa %அடிப்படை தொகுப்புகள்)) (சேவைகள் ;; … (சேவை mpd-சேவை-வகை (mpd-configuration (பயனர் "உங்கள்-பயனர்பெயர்") (இசை-இயக்குனர் "/பாதை/டு/உங்கள்/இசை") (முகவரி "192.168.178.20") (வெளியீடுகள் (பட்டியல் (mpd-output.). (வகை "அல்சா") (பெயர் "MPD") (கூடுதல் விருப்பங்கள் ;; ALSA இல் உள்ள அதே பெயரைப் பயன்படுத்தவும் ;; கீழே உள்ளமைவு. '((சாதனம் . "pcm.btspeaker")))) (mpd-அவுட்புட் (வகை "httpd") (பெயர் "ச்ட்ரீமிங்") (இயக்கப்பட்டதா? #false) (எப்போதும் இயங்குமா? #உண்மை) (குறிச்சொற்கள்? #உண்மை) (கலவை வகை 'பூச்யம்) (கூடுதல் விருப்பங்கள் '((குறியாக்கி . "வோர்பிச்") (போர்ட் . "8080") (முகவரிக்கு இணைக்கவும். "192.168.178.20") (அதிகபட்ச வாடிக்கையாளர் . "0") ;வரம்பு இல்லை (தரம் . "5.0") (வடிவம் . "44100:16:1")))))))) (dbus-service #:services (list bluez-alsa)) (bluetooth-service #:auto-enable? #t) (சேவை அல்சா-சேவை வகை (alsa-configuration (பல்ச்ஆடியோ? #பொய்) ;எங்களுக்கு இது தேவையில்லை (கூடுதல் விருப்பங்கள் #~(சரம்-இணைப்பு "\ # Bluealsa தொகுதியிலிருந்து ப்ளூடூத் ஆடியோ சாதன வகை \"bluealsa\" என்பதை அறிவிக்கவும் pcm_type.bluealsa @{ lib \"" #$(fil-append bluez-alsa "/lib/alsa-lib/libasound_module_pcm_bluealsa.so") "\" @}

source: # Declare control device type \"bluealsa\" from the same module ctl_type.bluealsa @{ lib \"" #$(file-append bluez-alsa "/lib/alsa-lib/libasound_module_ctl_bluealsa.so") "\" @}
ta: # அதே தொகுதியிலிருந்து \"bluealsa\" என்ற கட்டுப்பாட்டு சாதன வகையை அறிவிக்கவும் ctl_type.bluealsa @{ lib \"" #$(fil-append bluez-alsa "/lib/alsa-lib/libasound_module_ctl_bluealsa.so") "\" @}

source: # Define the actual Bluetooth audio device. pcm.btspeaker @{ type bluealsa device \"AA:BB:CC:A4:AA:CD\" # unique device identifier profile \"a2dp\" @}
ta: # உண்மையான ஊடலை ஆடியோ சாதனத்தை வரையறுக்கவும். pcm.btspeaker @{ வகை bluealsa சாதனம் \"AA:BB:CC:A4:AA:CD\" # தனிப்பட்ட சாதன அடையாளங்காட்டி சுயவிவரம் \"a2dp\" @}

source: # Define an associated controller. ctl.btspeaker @{ type bluealsa @} "))))))
ta: # தொடர்புடைய கட்டுப்படுத்தியை வரையறுக்கவும். ctl.btspeaker @{ வகை bluealsa @} "))))))

source: Enjoy the music with the MPD client of your choice or a media player capable of streaming via HTTP!
ta: உங்களுக்கு விருப்பமான MPD வாங்கி அல்லது HTTP வழியாக ச்ட்ரீமிங் செய்யக்கூடிய மீடியா பிளேயர் மூலம் இசையை அனுபவிக்கவும்!

source: The kernel Linux provides a number of shared facilities that are available to processes in the system. These facilities include a shared view on the file system, other processes, network devices, user and group identities, and a few others. Since Linux 3.19 a user can choose to @emph{unshare} some of these shared facilities for selected processes, providing them (and their child processes) with a different view on the system.
ta: கர்னல் லினக்ச் கணினியில் உள்ள செயல்முறைகளுக்கு கிடைக்கக்கூடிய பல பகிர்வு வசதிகளை வழங்குகிறது. இந்த வசதிகளில் கோப்பு முறைமை, பிற செயல்முறைகள், பிணைய சாதனங்கள், பயனர் மற்றும் குழு அடையாளங்கள் மற்றும் சிலவற்றின் பகிரப்பட்ட பார்வை ஆகியவை அடங்கும். Linux 3.19 என்பதால், தேர்ந்தெடுக்கப்பட்ட செயல்முறைகளுக்கு இந்தப் பகிரப்பட்ட வசதிகளில் சிலவற்றை ஒரு பயனர் @emph{unshare} செய்ய தேர்வு செய்யலாம், அவர்களுக்கு (மற்றும் அவர்களின் குழந்தை செயல்முறைகள்) கணினியில் வித்தியாசமான பார்வையை வழங்குகிறது.

source: A process with an unshared @code{mount} namespace, for example, has its own view on the file system --- it will only be able to see directories that have been explicitly bound in its mount namespace. A process with its own @code{proc} namespace will consider itself to be the only process running on the system, running as PID 1.
ta: பகிரப்படாத @code{mount} பெயர்வெளியைக் கொண்ட ஒரு செயல்முறை, எடுத்துக்காட்டாக, கோப்பு முறைமையில் அதன் சொந்த பார்வையைக் கொண்டுள்ளது --- அதன் மவுண்ட் நேம்ச்பேசில் வெளிப்படையாக பிணைக்கப்பட்ட கோப்பகங்களை மட்டுமே அது காண முடியும். அதன் சொந்த @code{proc} நேம்ச்பேச் கொண்ட ஒரு செயல்முறையானது PID 1 ஆக இயங்கும் கணினியில் இயங்கும் ஒரே செயல்முறையாகக் கருதப்படும்.
