Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: @xref{Build Systems,,, guix, GNU Guix Reference Manual}, for more information on build systems, or check the source code in the @samp{$GUIX_CHECKOUT/guix/build} and @samp{$GUIX_CHECKOUT/guix/build-system} directories.
ta: @xref{பில்ட் சிச்டம்ச்,,, guix, GNU Guix குறிப்பு Manual}, பில்ட் சிச்டம்ச் பற்றிய கூடுதல் தகவலுக்கு, அல்லது @samp{$GUIX_CHECKOUT/guix/build} மற்றும் @samp{$GUIX_CHECKOUT/guix/build-system} கோப்பகங்களில் உள்ள மூலக் குறியீட்டைப் பார்க்கவும்.

source: We can't repeat it enough: having a full-fledged programming language at hand empowers us in ways that reach far beyond traditional package management.
ta: எங்களால் போதுமான அளவு அதை மீண்டும் செய்ய முடியாது: ஒரு முழு அளவிலான நிரலாக்க மொழியைக் கொண்டிருப்பது பாரம்பரிய தொகுப்பு மேலாண்மைக்கு அப்பாற்பட்ட வழிகளில் நம்மை மேம்படுத்துகிறது.

source: Let's illustrate this with some awesome features of Guix!
ta: Guix இன் சில அற்புதமான அம்சங்களுடன் இதை விளக்குவோம்!

source: You might find some build systems good enough that there is little to do at all to write a package, to the point that it becomes repetitive and tedious after a while. A @emph{raison d'être} of computers is to replace human beings at those boring tasks. So let's tell Guix to do this for us and create the package definition of an R package from CRAN (the output is trimmed for conciseness):
ta: ஒரு தொகுப்பை எழுதுவதற்குச் சிறிதும் செய்ய வேண்டியதில்லை, சிறிது நேரத்திற்குப் பிறகு அது மறுநிகழ்வு சலிப்படையச் செய்யும் அளவிற்கு, சில உருவாக்க அமைப்புகளை நீங்கள் நன்றாகக் காணலாம். ஒரு @emph{raison d'être} கணினிகள் அந்த சலிப்பான பணிகளில் மனிதர்களை மாற்றுவதாகும். எனவே, நமக்காக இதைச் செய்யுமாறு Guix க்குக் கூறுவோம் மற்றும் CRAN இலிருந்து R தொகுப்பின் தொகுப்பு வரையறையை உருவாக்குவோம் (வெளியீடு சுருக்கமாக வெட்டப்பட்டது):

source: $ guix import cran --recursive walrus
ta: $guix இறக்குமதி கிரான் --ரிகர்சிவ் வால்ரச்

source: (define-public r-mc2d ; ... (license gpl2+)))
ta: (வரையறை-பொது r-mc2d ; ... (உரிமம் gpl2+)))

source: (define-public r-jmvcore ; ... (license gpl2+)))
ta: (வரையறை-பொது r-jmvcore ; ... (உரிமம் gpl2+)))

source: (define-public r-wrs2 ; ... (license gpl3)))
ta: (வரையறை-பொது r-wrs2 ; ... (உரிமம் gpl3)))

source: (define-public r-walrus (package (name "r-walrus") (version "1.0.3") (source (origin (method url-fetch) (uri (cran-uri "walrus" version)) (sha256 (base32 "1nk2glcvy4hyksl5ipq2mz8jy4fss90hx6cq98m3w96kzjni6jjj")))) (build-system r-build-system) (propagated-inputs (list r-ggplot2 r-jmvcore r-r6 r-wrs2)) (home-page "https://github.com/jamovi/walrus") (synopsis "Robust Statistical Methods") (description "This package provides a toolbox of common robust statistical tests, including robust descriptives, robust t-tests, and robust ANOVA. It is also available as a module for 'jamovi' (see <https://www.jamovi.org> for more information). Walrus is based on the WRS2 package by Patrick Mair, which is in turn based on the scripts and work of Rand Wilcox. These analyses are described in depth in the book 'Introduction to Robust Estimation & Hypothesis Testing'.") (license gpl3)))
ta: (வரையறை-பொது ஆர்-வால்ரச் (தொகுப்பு (பெயர் "ஆர்-வால்ரச்") (பதிப்பு "1.0.3") (ஆதாரம் (தோற்றம் (முறை url-பெறுதல்) (உரி (கிரான்-யூரி "வால்ரச்" பதிப்பு)) (sha256 (அடிப்படை 32 "1nk2glcvy4hyksl5ipq2mz8jy4fss90hx6cq98m3w96kzjni6jjj")))) (கட்டுமான-அமைப்பு r-கட்டுமான-அமைப்பு) (பிரசாரம்-உள்ளீடுகள் (பட்டியல் r-ggplot2 r-jmvcore r-r6 r-wrs2)) (முகப்பு பக்கம் "https://github.com/jamovi/walrus") (சுருக்கம் "வலுவான புள்ளியியல் முறைகள்") (விளக்கம் "இந்த தொகுப்பு பொதுவான வலுவான புள்ளிவிவரங்களின் கருவிப்பெட்டியை வழங்குகிறது வலுவான விளக்கங்கள், வலுவான டி-டெச்ட்கள் மற்றும் வலுவான ANOVA உள்ளிட்ட சோதனைகள். இது 'சமோவி'க்கான தொகுதியாகவும் கிடைக்கிறது (பார்க்க மேலும் தகவலுக்கு <https://www.jamovi.org>). வால்ரச் அடிப்படையாக கொண்டது பேட்ரிக் மெய்ரின் WRS2 தொகுப்பு, இது ச்கிரிப்ட்கள் மற்றும் அடிப்படையிலானது ராண்ட் வில்காக்சின் வேலை. இந்த ஆய்வுகள் புத்தகத்தில் ஆழமாக விவரிக்கப்பட்டுள்ளன 'வலுவான மதிப்பீடு மற்றும் கருதுகோள் சோதனைக்கான அறிமுகம்'.") (உரிமம் gpl3)))

source: The recursive importer won't import packages for which Guix already has package definitions, except for the very first.
ta: சுழல்நிலை இறக்குமதியாளர், Guix ஏற்கனவே தொகுப்பு வரையறைகளைக் கொண்ட தொகுப்புகளை இறக்குமதி செய்யமாட்டார், முதல் தவிர.

source: Not all applications can be packaged this way, only those relying on a select number of supported systems. Read about the full list of importers in the guix import section of the manual (@pxref{Invoking guix import,,, guix, GNU Guix Reference Manual}).
ta: எல்லா பயன்பாடுகளையும் இவ்வாறு தொகுக்க முடியாது, தேர்ந்தெடுக்கப்பட்ட உதவி அமைப்புகளை மட்டுமே நம்பியிருக்கும். கையேட்டின் guix இறக்குமதி பிரிவில் இறக்குமதியாளர்களின் முழுப் பட்டியலைப் பற்றி படிக்கவும் (@pxref{Invoking guix import,,, guix, GNU Guix குறிப்பு Manual}).

source: Guix can be smart enough to check for updates on systems it knows. It can report outdated package definitions with
ta: Guix தனக்குத் தெரிந்த கணினிகளில் புதுப்பிப்புகளைச் சரிபார்க்கும் அளவுக்கு புத்திசாலியாக இருக்க முடியும். காலாவதியான தொகுப்பு வரையறைகளை இது தெரிவிக்கலாம்

source: $ guix refresh hello
ta: $ சுண்ணாம்பு புதுப்பி வணக்கம்

source: In most cases, updating a package to a newer version requires little more than changing the version number and the checksum. Guix can do that automatically as well:
ta: பெரும்பாலான சந்தர்ப்பங்களில், ஒரு தொகுப்பை புதிய பதிப்பிற்குப் புதுப்பிப்பது, பதிப்பு எண் மற்றும் செக்சம் ஆகியவற்றை மாற்றுவதைக் காட்டிலும் அதிகம் தேவைப்படுகிறது. Guix அதை தானாகவே செய்ய முடியும்:

source: $ guix refresh hello --update
ta: $guix புதுப்பிப்பு hello --update

source: If you've started browsing the existing package definitions, you might have noticed that a significant number of them have a @code{inherit} field:
ta: ஏற்கனவே உள்ள தொகுப்பு வரையறைகளை நீங்கள் உலாவத் தொடங்கியிருந்தால், அவற்றில் கணிசமான எண்ணிக்கையில் @code{inherit} புலம் இருப்பதை நீங்கள் கவனித்திருக்கலாம்:

source: (define-public adwaita-icon-theme (package (inherit gnome-icon-theme) (name "adwaita-icon-theme") (version "3.26.1") (source (origin (method url-fetch) (uri (string-append "mirror://gnome/sources/" name "/" (version-major+minor version) "/" name "-" version ".tar.xz")) (sha256 (base32 "17fpahgh5dyckgz7rwqvzgnhx53cx9kr2xw0szprc6bnqy977fi8")))) (native-inputs (list `(,gtk+ "bin")))))
ta: (வரையறை-பொது அத்வைதா-ஐகான்-தீம் (தொகுப்பு (குனோம்-ஐகான்-தீம் மரபுரிமை) (பெயர் "அத்வைதா-ஐகான்-தீம்") (பதிப்பு "3.26.1") (ஆதாரம் (முறை url-பெறுதல்) (உரி (string-append "mirror://gnome/sources/" பெயர் "/" (பதிப்பு-பெரிய+சிறிய பதிப்பு) "/" பெயர் "-" பதிப்பு ".tar.xz")) (sha256 (அடிப்படை 32 "17fpahgh5dyckgz7rwqvzgnhx53cx9kr2xw0szprc6bnqy977fi8")))) (சொந்த-உள்ளீடுகள் (list `(,gtk+ "bin")))))

source: All unspecified fields are inherited from the parent package. This is very convenient to create alternative packages, for instance with different source, version or compilation options.
ta: அனைத்து குறிப்பிடப்படாத புலங்களும் பெற்றோர் தொகுப்பிலிருந்து பெறப்பட்டவை. மாற்று தொகுப்புகளை உருவாக்க இது மிகவும் வசதியானது, உதாரணமாக வெவ்வேறு மூலங்கள், பதிப்பு அல்லது தொகுப்பு விருப்பங்கள்.

source: Sadly, some applications can be tough to package. Sometimes they need a patch to work with the non-standard file system hierarchy enforced by the store. Sometimes the tests won't run properly. (They can be skipped but this is not recommended.) Other times the resulting package won't be reproducible.
ta: எதிர்பாராதவிதமாக, சில பயன்பாடுகள் தொகுக்க கடினமாக இருக்கும். சில நேரங்களில் கடையால் செயல்படுத்தப்படும் தரமற்ற கோப்பு முறைமை படிநிலையுடன் பணிபுரிய அவர்களுக்கு ஒரு இணைப்பு தேவைப்படுகிறது. சில நேரங்களில் சோதனைகள் சரியாக நடக்காது. (அவை தவிர்க்கப்படலாம் ஆனால் இது பரிந்துரைக்கப்படவில்லை.) மற்ற நேரங்களில் விளைந்த தொகுப்பு மீண்டும் உருவாக்கப்படாது.

source: Should you be stuck, unable to figure out how to fix any sort of packaging issue, don't hesitate to ask the community for help.
ta: ஏதேனும் பேக்கேசிங் சிக்கலை எவ்வாறு சரிசெய்வது என்பதைக் கண்டுபிடிக்க முடியாமல் நீங்கள் சிக்கிக்கொண்டால், சமூகத்திடம் உதவி கேட்க தயங்காதீர்கள்.

source: See the @uref{https://guix.gnu.org/contact/, Guix homepage} for information on the mailing lists, IRC, etc.
ta: அஞ்சல் பட்டியல்கள், IRC போன்றவை பற்றிய தகவலுக்கு @uref{https://guix.gnu.org/contact/, Guix முகப்புப்பக்கம்} பார்க்கவும்.

source: This tutorial was a showcase of the sophisticated package management that Guix boasts. At this point we have mostly restricted this introduction to the @code{gnu-build-system} which is a core abstraction layer on which more advanced abstractions are based.
ta: இந்த டுடோரியல் Guix பெருமைப்படுத்தும் அதிநவீன தொகுப்பு நிர்வாகத்தின் காட்சிப் பொருளாகும். இந்த கட்டத்தில், இந்த அறிமுகத்தை @code{gnu-build-system}க்குக் கட்டுப்படுத்தியுள்ளோம், இது மிகவும் மேம்பட்ட சுருக்கங்களை அடிப்படையாகக் கொண்ட ஒரு முக்கிய சுருக்க அடுக்கு ஆகும்.

source: Where do we go from here? Next we ought to dissect the innards of the build system by removing all abstractions, using the @code{trivial-build-system}: this should give us a thorough understanding of the process before investigating some more advanced packaging techniques and edge cases.
ta: இங்கிருந்து நாம் எங்கு செல்வது? அடுத்து, @code{trivial-build-system}ஐப் பயன்படுத்தி, அனைத்து சுருக்கங்களையும் அகற்றுவதன் மூலம், கட்டமைப்பின் உள்ளுறுப்புகளைப் பிரிக்க வேண்டும்: இது இன்னும் சில மேம்பட்ட பேக்கேசிங் நுட்பங்கள் மற்றும் விளிம்பு வழக்குகளை விசாரிப்பதற்கு முன், செயல்முறையை முழுமையாகப் புரிந்து கொள்ள வேண்டும்.

source: Other features worth exploring are the interactive editing and debugging capabilities of Guix provided by the Guile REPL@.
ta: Guile REPL@ ஆல் வழங்கப்பட்ட Guix இன் ஊடாடும் திருத்துதல் மற்றும் பிழைத்திருத்த திறன்கள் ஆகியவை ஆராயத் தகுந்த மற்ற நற்பொருத்தங்கள்.

source: Those fancy features are completely optional and can wait; now is a good time to take a well-deserved break. With what we've introduced here you should be well armed to package lots of programs. You can get started right away and hopefully we will see your contributions soon!
ta: அந்த ஆடம்பரமான நற்பொருத்தங்கள் முற்றிலும் விருப்பமானவை மற்றும் காத்திருக்கலாம்; தகுதியான ஓய்வு எடுக்க இப்போது நல்ல நேரம். நாங்கள் இங்கு அறிமுகப்படுத்தியிருப்பதன் மூலம், நிறைய திட்டங்களைத் தொகுக்க நீங்கள் நன்கு கருவி ஏந்தியிருக்க வேண்டும். நீங்கள் இப்போதே தொடங்கலாம், உங்கள் பங்களிப்புகளை விரைவில் பார்ப்போம்!

source: The @uref{https://guix.gnu.org/manual/en/html_node/Defining-Packages.html, package reference in the manual}
ta: @uref{https://guix.gnu.org/manual/en/html_node/Defining-Packages.html, கையேட்டில் உள்ள தொகுப்பு குறிப்பு}

source: @uref{https://gitlab.com/pjotrp/guix-notes/blob/master/HACKING.org, Pjotr’s hacking guide to GNU Guix}
ta: @uref{https://gitlab.com/pjotrp/guix-notes/blob/master/HACKING.org, GNU Guix க்கு Pjotr இன் ஏக்கிங் வழிகாட்டி}

source: @uref{https://guix.gnu.org/guix-ghm-andreas-20130823.pdf, ``GNU Guix: Package without a scheme!''}, by Andreas Enge
ta: @UREF{https://guix.gnu.org/guix-ghm-andreas-20130823.pdf, `gnu guix: திட்டம் இல்லாத தொகுப்பு!''}, By Andreas Enge

source: The following sections provide real-life examples on working with specific build systems, serving as extensions to the concise packaging guidelines (@pxref{Packaging Guidelines,,, guix, GNU Guix Reference Manual}).
ta: பின்வரும் பிரிவுகள் குறிப்பிட்ட உருவாக்க அமைப்புகளுடன் பணிபுரிவதற்கான நிச வாழ்க்கை எடுத்துக்காட்டுகளை வழங்குகின்றன, சுருக்கமான பேக்கேசிங் வழிகாட்டுதல்களுக்கு நீட்டிப்புகளாக செயல்படுகின்றன (@pxref{பேக்கேசிங் வழிகாட்டுதல்கள்,,, guix, GNU Guix குறிப்பு கையேடு}).

source: In preparation, add the following packages to our environment:
ta: தயாரிப்பில், பின்வரும் தொகுப்புகளை நமது சூழலில் சேர்க்கவும்:

source: $ guix shell rust rust:cargo cargo-audit cargo-license
ta: $ guix செல் துரு துரு: சரக்கு சரக்கு-தணிக்கை சரக்கு-உரிமம்

source: In this example, we'll package @code{cargo-audit}, which is published on the @uref{https://crates.io, crates.io} Rust package repository. All its dependencies are on crates.io as well.
ta: இந்த எடுத்துக்காட்டில், @uref{https://crates.io, crates.io} ரச்ட் தொகுப்பு களஞ்சியத்தில் வெளியிடப்பட்ட @code{cargo-audit}ஐ நாங்கள் தொகுப்போம். அதன் அனைத்து சார்புகளும் crates.io இல் உள்ளன.

source: Since @code{cargo-audit} is available on crates.io, we can generate a template via the crates.io importer (@pxref{Invoking guix import,,, guix, GNU Guix Reference Manual}):
ta: crates.io இல் @code{cargo-audit} இருப்பதால், crates.io இறக்குமதியாளர் (@pxref{Invoking guix import,,, guix, GNU Guix குறிப்பு Manual}) வழியாக ஒரு டெம்ப்ளேட்டை உருவாக்கலாம்:

source: $ guix import crate cargo-audit
ta: $ சிப்சம் இறக்குமதி கிரேட் சரக்கு-தணிக்கை

source: After manual editing, we'll have the following definiton:
ta: கைமுறையாகத் திருத்திய பிறகு, பின்வரும் வரையறையைப் பெறுவோம்:

source: (define-public cargo-audit (package (name "cargo-audit") (version "0.21.2") (source (origin (method url-fetch) (uri (crate-uri "cargo-audit" version)) (file-name (string-append name "-" version ".tar.gz")) (sha256 (base32 "1a00yqpckkw86zh2hg7ra82c5fx0ird5766dyynimbvqiwg2ps0n")))) (build-system cargo-build-system) (arguments (list #:install-source? #f)) (inputs (cargo-inputs 'cargo-audit)) (home-page "https://rustsec.org/") (synopsis "Audit Cargo.lock for crates with security vulnerabilities") (description "This package provides a Cargo subcommand, @@command@{cargo audit@}, to audit @@file@{Cargo.lock@} for crates with security vulnerabilities.") (license (list license:asl2.0 license:expat))))
ta: (வரையறை-பொது சரக்கு-தணிக்கை (தொகுப்பு (பெயர் "சரக்கு-தணிக்கை") (பதிப்பு "0.21.2") (ஆதாரம் (தோற்றம் (முறை url-பெறுதல்) (உரி (crate-uri "cargo-audit" பதிப்பு)) (கோப்பு-பெயர் (சரம்-இணைப்பு பெயர் "-" பதிப்பு ".tar.gz")) (sha256 (base32 "1a00yqpckkw86zh2hg7ra82c5fx0ird5766dyynimbvqiwg2ps0n"))) (கட்டமைப்பு-அமைப்பு சரக்கு-கட்டமைப்பு-அமைப்பு) (வாதங்கள் (list #:install-source? #f)) (உள்ளீடுகள் (சரக்கு-உள்ளீடுகள் 'சரக்கு-தணிக்கை)) (முகப்பு பக்கம் "https://rustsec.org/") (சுருக்கம் "பாதுகாப்பு குறைபாடுகள் உள்ள கிரேட்களுக்கான கார்கோ.லாக் தணிக்கை") (விளக்கம் "இந்த தொகுப்பு சரக்கு துணைக் கட்டளையை வழங்குகிறது, @@command@{cargo audit@} பாதுகாப்பு குறைபாடுகள் உள்ள பெட்டிகளுக்கு @@file@{Cargo.lock@} தணிக்கை செய்யவும்.") (உரிமம் (பட்டியல் உரிமம்:asl2.0 உரிமம்:வெளிநாட்டவர்))))

source: The identifier used to invoke @code{cargo-inputs}, in this case @code{'cargo-audit}, must be unique, usually matching the variable name of the package.
ta: @code{cargo-inputs} ஐ செயல்படுத்தப் பயன்படுத்தப்படும் அடையாளங்காட்டி, இந்த விசயத்தில் @code{'cargo-audit}, தனித்துவமாக இருக்க வேண்டும், பொதுவாக பேக்கேசின் மாறி பெயருடன் பொருந்தும்.

source: Unpack package source and navigate to the unpacked directory, then run the following commands:
ta: தொகுப்பு மூலத்தைத் திறந்து, தொகுக்கப்படாத கோப்பகத்திற்குச் செல்லவும், பின்னர் பின்வரும் கட்டளைகளை இயக்கவும்:

source: $ cargo generate-lockfile $ cargo audit $ cargo license
ta: $ சரக்கு உருவாக்க-பூட்டு கோப்பு $ சரக்கு தணிக்கை $ சரக்கு உரிமம்

source: @command{cargo generate-lockfile} updates dependencies to compatible versions. Applying it to all Rust applications helps reduce a great number of Rust libraries we need to check later. Although sometimes libraries may fail to follow the @uref{https://semver.org/, semantic versioning} scheme, it's still acceptable.
ta: @command{cargo generate-lockfile} சார்புகளை இணக்கமான பதிப்புகளுக்கு மேம்படுத்துகிறது. அனைத்து ரச்ட் அப்ளிகேசன்களிலும் இதைப் பயன்படுத்துவது, நாம் பின்னர் சரிபார்க்க வேண்டிய ஏராளமான ரச்ட் லைப்ரரிகளைக் குறைக்க உதவுகிறது. சில நேரங்களில் நூலகங்கள் @uref{https://semver.org/, சொற்பொருள் பதிப்பு} திட்டத்தைப் பின்பற்றத் தவறினாலும், அது இன்னும் ஏற்றுக்கொள்ளத்தக்கது.

source: @command{cargo audit} checks known vulnerabilities and @command{cargo license} checks licenses, for all the dependencies. We must have an acceptable output of @command{cargo audit} and ensure all dependencies are licensed with our supported licenses (@pxref{Defining Packages,,, guix, GNU Guix Reference Manual}).
ta: @command{cargo audit} அறியப்பட்ட பாதிப்புகளைச் சரிபார்க்கிறது மற்றும் @command{cargo license} அனைத்து சார்புநிலைகளுக்கான உரிமங்களையும் சரிபார்க்கிறது. @command{cargo audit} இன் ஏற்றுக்கொள்ளக்கூடிய வெளியீடு எங்களிடம் இருக்க வேண்டும் மற்றும் அனைத்து சார்புகளும் எங்கள் ஆதரிக்கப்படும் உரிமங்களுடன் உரிமம் பெற்றுள்ளதை உறுதிசெய்ய வேண்டும் (@pxref{Defining Packages,,, guix, GNU Guix குறிப்பு Manual}).

source: Import dependencies from the generated lockfile:
ta: உருவாக்கப்பட்ட லாக்ஃபைலில் இருந்து சார்புகளை இறக்குமதி செய்யவும்:

source: $ guix import --insert=gnu/packages/rust-crates.scm \ crate --lockfile=/path/to/Cargo.lock cargo-audit
ta: $ guix இறக்குமதி --insert=gnu/packages/rust-crates.scm \ crate --lockfile=/path/to/Cargo.lock cargo-audit

source: # Or use short options, in this case the shell processes file names # before passing them to Guix, allowing tilde expansion, for example. $ guix import -i gnu/packages/rust-crates.scm \ crate -f /path/to/Cargo.lock cargo-audit
ta: # அல்லது குறுகிய விருப்பங்களைப் பயன்படுத்தவும், இந்த விசயத்தில் செல் கோப்பு பெயர்களை செயலாக்குகிறது # அவற்றை Guix க்கு அனுப்புவதற்கு முன், டில்டே விரிவாக்கத்தை அனுமதிக்கிறது, எடுத்துக்காட்டாக. $ guix இறக்குமதி -i gnu/packages/rust-crates.scm \ crate -f /path/to/Cargo.lock சரக்கு-தணிக்கை

source: @code{cargo-audit} here must be consistent with the identifier used for @code{cargo-inputs} invocation in the package definition.
ta: இங்கே @code{cargo-audit} என்பது பேக்கேச் வரையறையில் @code{cargo-inputs} அழைப்பிற்குப் பயன்படுத்தப்படும் அடையாளங்காட்டியுடன் ஒத்துப்போக வேண்டும்.

source: At this stage, the package @code{cargo-audit} is buildable.
ta: இந்த கட்டத்தில், @code{cargo-audit} தொகுப்பை உருவாக்க முடியும்.

source: Finally we'll unbundle the vendored dependencies. The lockfile importer inserts @code{TODO REVIEW:} comments for libraries with high probability of bundled dependencies. @code{cargo-build-system} also performs additional check for binary files in its @code{check-for-pregenerated-files} phase, which usually indicates bundling:
ta: இறுதியாக நாங்கள் விற்பனையான சார்புகளை அவிழ்ப்போம். லாக்ஃபைல் இறக்குமதியாளர், தொகுக்கப்பட்ட சார்புகளின் அதிக நிகழ்தகவு கொண்ட நூலகங்களுக்கு @code{TODO REVIEW:} கருத்துகளைச் செருகுகிறார். @code{cargo-build-system} ஆனது அதன் @code{check-for-pregenerated-files} கட்டத்தில் பைனரி கோப்புகளுக்கான கூடுதல் சரிபார்ப்பையும் செய்கிறது, இது பொதுவாகத் தொகுப்பைக் குறிக்கிறது:

source: $ ./pre-inst-env guix build cargo-audit @dots{} starting phase `check-for-pregenerated-files' Searching for binary files... ./guix-vendor/rust-async-compression-0.4.21.tar.gz/tests/artifacts/dictionary-rust ./guix-vendor/rust-async-compression-0.4.21.tar.gz/tests/artifacts/dictionary-rust-other ./guix-vendor/rust-async-compression-0.4.21.tar.gz/tests/artifacts/lib.rs.zst ./guix-vendor/rust-async-compression-0.4.21.tar.gz/tests/artifacts/long-window-size-lib.rs.zst ./guix-vendor/rust-winapi-i686-pc-windows-gnu-0.4.0.tar.gz/lib/libwinapi_aclui.a ./guix-vendor/rust-winapi-i686-pc-windows-gnu-0.4.0.tar.gz/lib/libwinapi_activeds.a ./guix-vendor/rust-winapi-i686-pc-windows-gnu-0.4.0.tar.gz/lib/libwinapi_asycfilt.a ./guix-vendor/rust-winapi-i686-pc-windows-gnu-0.4.0.tar.gz/lib/libwinapi_amsi.a @dots{}
ta: $ ./pre-inst-env guix பில்ட் கார்கோ-ஆடிட் @dots{} ஆரம்ப கட்டம் `செக்-ஃபார்-முன்-செனரேட்டட்-ஃபைல்ச்' பைனரி கோப்புகளைத் தேடுகிறது... ./guix-vendor/rust-async-compression-0.4.21.tar.gz/tests/artifacts/dictionary-rust ./guix-vendor/rust-async-compression-0.4.21.tar.gz/tests/artifacts/dictionary-rust-other ./guix-vendor/rust-async-compression-0.4.21.tar.gz/tests/artifacts/lib.rs.zst ./guix-vendor/rust-async-compression-0.4.21.tar.gz/tests/artifacts/long-window-size-lib.rs.zst ./guix-vendor/rust-winapi-i686-pc-windows-gnu-0.4.0.tar.gz/lib/libwinapi_aclui.a ./guix-vendor/rust-winapi-i686-pc-windows-gnu-0.4.0.tar.gz/lib/libwinapi_activeds.a ./guix-vendor/rust-winapi-i686-pc-windows-gnu-0.4.0.tar.gz/lib/libwinapi_asycfilt.a ./guix-vendor/rust-winapi-i686-pc-windows-gnu-0.4.0.tar.gz/lib/libwinapi_amsi.a @dots{}

source: Although Rust libraries are not publicly exported, we can still select them via the Guix command-line interface via a Guile expression:
ta: ரச்ட் நூலகங்கள் பொதுவில் ஏற்றுமதி செய்யப்படவில்லை என்றாலும், நாம் அவற்றை Guix கட்டளை வரி இடைமுகம் வழியாக Guile வெளிப்பாடு வழியாகத் தேர்ந்தெடுக்கலாம்:

source: $ guix build --expression='(@@@@ (gnu packages rust-crates) rust-ring-0.17.14)'
ta: $ guix உருவாக்கு --expression='(@@@@ (gnu தொகுப்புகள் rust-crates) rust-ring-0.17.14)'

source: To unbundle most dependencies, a snippet is sufficient:
ta: பெரும்பாலான சார்புகளை அவிழ்க்க, ஒரு துணுக்கு போதுமானது:

source: (define rust-curl-sys-0.4.80+curl-8.12.1 (crate-source "curl-sys" "0.4.80+curl-8.12.1" "0d7ppx4kq77hc5nyff6jydmfabpgd0i3ppjvn8x0q833mhpdzxsm" #:snippet '(delete-file-recursively "curl")))
ta: (rust-curl-sys-0.4.80+curl-8.12.1ஐ வரையறுக்கவும் (crate-source "curl-sys" "0.4.80+curl-8.12.1" "0d7ppx4kq77hc5nyff6jydmfabpgd0i3ppjvn8x0q833mhpdzxsm" #:துணுக்கை '(நீக்கு-கோப்பு-தொடர்ச்சியாக "சுருட்டு")))

source: (define rust-bzip2-sys-0.1.13+1.0.8 (crate-source "bzip2-sys" "0.1.13+1.0.8" "056c39pgjh4272bdslv445f5ry64xvb0f7nph3z7860ln8rzynr2" #:snippet '(begin (delete-file-recursively "bzip2-1.0.8") (delete-file "build.rs") (with-output-to-file "build.rs" (lambda _ (format #t "fn main() @{~@@ println!(\"cargo:rustc-link-lib=bz2\");~@@ @}~%"))))))
ta: (rust-bzip2-sys-0.1.13+1.0.8 ஐ வரையறுக்கவும் (crate-source "bzip2-sys" "0.1.13+1.0.8" "056c39pgjh4272bdslv445f5ry64xvb0f7nph3z7860ln8rzynr2" #:துணுக்கு '(தொடங்கு (delete-file-recursively "bzip2-1.0.8") (delete-file "build.rs") ("build.rs" கோப்புக்கு வெளியீட்டுடன் (லாம்ப்டா _ (வடிவமைப்பு #t "fn முக்கிய() @{~@@ println!(\"cargo:rustc-link-lib=bz2\");~@@ @}~%"))))))

source: In a more complex case, where unbundling one dependency requires a build process that involves other packages, we should make a full package in @code{(gnu packages rust-sources)} first and reference it in the imported definition.
ta: மிகவும் சிக்கலான சூழ்நிலையில், ஒரு சார்புநிலையை அவிழ்க்க மற்ற தொகுப்புகளை உள்ளடக்கிய உருவாக்க செயல்முறை தேவைப்படுகிறது, முதலில் @code{(gnu தொகுப்புகள் rust-sources)} இல் ஒரு முழு தொகுப்பை உருவாக்கி அதை இறக்குமதி செய்யப்பட்ட வரையறையில் குறிப்பிட வேண்டும்.

source: For example, we have defined a @code{rust-ring-0.17} in @code{(gnu packages rust-sources)}, then the imported definition in @code{(gnu packages rust-crates)} should be modified to reference it.
ta: எடுத்துக்காட்டாக, @code{(gnu தொகுப்புகள் rust-sources)} இல் @code{rust-ring-0.17} ஐ வரையறுத்துள்ளோம், பின்னர் @code{(gnu தொகுப்புகள் rust-crates)} இல் இறக்குமதி செய்யப்பட்ட வரையறை அதைக் குறிப்பிட மாற்றியமைக்கப்பட வேண்டும்.

source: (define rust-ring-0.17.14 rust-ring-0.17)
ta: (துரு வளையம்-0.17.14 துரு வளையம்-0.17 வரையறுக்கவும்)

source: When one dependency can be safely removed, modify it to @code{#f}.
ta: ஒரு சார்புநிலையை பாதுகாப்பாக அகற்றினால், அதை @code{#f} ஆக மாற்றவும்.

source: (define rust-openssl-src-300.4.2+3.4.1 #f)
ta: (வரையறுக்கவும் rust-openssl-src-300.4.2+3.4.1 #f)

source: To facilitate various tasks in the common workflow, several scripts are provided in the @file{etc/teams/rust} directory of Guix source tree.
ta: பொதுவான பணிப்பாய்வுகளில் பல்வேறு பணிகளை எளிதாக்க, Guix மூல மரத்தின் @file{etc/teams/rust} கோப்பகத்தில் பல ச்கிரிப்டுகள் வழங்கப்பட்டுள்ளன.

source: In this example, we'll package @code{niri}, which depends on development snapshots (also Cargo workspaces here).
ta: இந்த எடுத்துக்காட்டில், டெவலப்மெண்ட் ச்னாப்சாட்களைப் பொறுத்து @code{niri} தொகுப்போம் (இங்கே சரக்கு பணியிடங்களும்).

source: As we can't ensure compatibility of a development snapshot, before executing @command{cargo generate-lockfile}, we should modify @file{Cargo.toml} to pin it to a known working revision.
ta: டெவலப்மென்ட் ச்னாப்சாட்டின் இணக்கத்தன்மையை எங்களால் உறுதிசெய்ய முடியாததால், @command{cargo generate-lockfile} ஐச் செயல்படுத்தும் முன், தெரிந்த வேலை செய்யும் திருத்தத்திற்குப் பின் செய்ய, @file{Cargo.toml} ஐ மாற்ற வேண்டும்.
