Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: When partially upgrading a profile, conflicts may arise (due to diverging dependencies between the updated and the non-updated packages) and they can be annoying to resolve manually. Manifests remove this problem altogether since all packages are always upgraded at once.
ta: ஒரு சுயவிவரத்தை ஓரளவு மேம்படுத்தும் போது, முரண்பாடுகள் ஏற்படலாம் (புதுப்பிக்கப்பட்ட மற்றும் புதுப்பிக்கப்படாத தொகுப்புகளுக்கு இடையே உள்ள மாறுபட்ட சார்புகள் காரணமாக) மேலும் அவை கைமுறையாகத் தீர்க்க எரிச்சலூட்டும். எல்லா தொகுப்புகளும் ஒரே நேரத்தில் மேம்படுத்தப்படும் என்பதால் மேனிஃபெச்ட்கள் இந்தச் சிக்கலை முழுவதுமாக நீக்குகிறது.

source: As mentioned above, manifests allow for reproducible profiles, while the imperative @code{guix install}, @code{guix upgrade}, etc. do not, since they produce different profiles every time even when they hold the same packages. See @uref{https://issues.guix.gnu.org/issue/33285, the related discussion on the matter}.
ta: மேலே குறிப்பிட்டுள்ளபடி, மேனிஃபெச்டுகள் மறுஉருவாக்கம் செய்யக்கூடிய சுயவிவரங்களை அனுமதிக்கின்றன, அதே சமயம் கட்டாயமான @code{guix install}, @code{guix upgrade} போன்றவை செய்யாது, ஏனெனில் அவை ஒரே பேக்கேச்களை வைத்திருக்கும் போது கூட ஒவ்வொரு முறையும் வெவ்வேறு சுயவிவரங்களை உருவாக்குகின்றன. @uref{https://issues.guix.gnu.org/issue/33285, இது தொடர்பான விவாதத்தைப் பார்க்கவும்}.

source: Manifest specifications are usable by other @samp{guix} commands. For example, you can run @code{guix weather -m manifest.scm} to see how many substitutes are available, which can help you decide whether you want to try upgrading today or wait a while. Another example: you can run @code{guix pack -m manifest.scm} to create a pack containing all the packages in the manifest (and their transitive references).
ta: மேனிஃபெச்ட் விவரக்குறிப்புகள் பிற @samp{guix} கட்டளைகளால் பயன்படுத்தப்படலாம். எடுத்துக்காட்டாக, எத்தனை மாற்றீடுகள் உள்ளன என்பதைப் பார்க்க @code{guix weather -m manifest.scm} ஐ இயக்கலாம், இது இன்றே மேம்படுத்த விரும்புகிறீர்களா அல்லது சிறிது நேரம் காத்திருக்க வேண்டுமா என்பதைத் தீர்மானிக்க உதவும். மற்றொரு எடுத்துக்காட்டு: நீங்கள் @code{guix pack -m manifest.scm}ஐ இயக்கி மேனிஃபெச்டில் உள்ள அனைத்து தொகுப்புகளையும் (மற்றும் அவற்றின் இடைநிலை குறிப்புகள்) கொண்ட பேக்கை உருவாக்கலாம்.

source: Finally, manifests have a Scheme representation, the @samp{<manifest>} record type. They can be manipulated in Scheme and passed to the various Guix @uref{https://en.wikipedia.org/wiki/Api, APIs}.
ta: இறுதியாக, மேனிஃபெச்டுகள் @samp{<manifest>} பதிவு வகையிலான திட்டப் பிரதிநிதித்துவத்தைக் கொண்டுள்ளன. அவை திட்டத்தில் கையாளப்பட்டு பல்வேறு Guix @uref{https://en.wikipedia.org/wiki/Api, APIs}க்கு அனுப்பப்படலாம்.

source: It's important to understand that while manifests can be used to declare profiles, they are not strictly equivalent: profiles have the side effect that they ``pin'' packages in the store, which prevents them from being garbage-collected (@pxref{Invoking guix gc,,, guix, GNU Guix Reference Manual}) and ensures that they will still be available at any point in the future. The @command{guix shell} command also protects recently-used profiles from garbage collection; profiles that have not been used for a while may be garbage-collected though, along with the packages they refer to.
ta: சுயவிவரங்களை அறிவிக்க மேனிஃபெச்ட்களைப் பயன்படுத்தினாலும், அவை கண்டிப்பாகச் சமமானவை அல்ல என்பதைப் புரிந்துகொள்வது முக்கியம்: சுயவிவரங்கள் கடையில் உள்ள பேக்கேச்களை ``பின்' செய்வதால் பக்கவிளைவுகள் உள்ளன, இது குப்பை சேகரிக்கப்படுவதைத் தடுக்கிறது (@pxref{Invoking guix gc,,, guix, GNU Guix குறிப்பு கையேடு. எதிர்காலத்தில் அவை கிடைக்குமா என்பதை உறுதிப்படுத்தவும்}) @command{guix shell} கட்டளையானது அண்மைக் காலத்தில் பயன்படுத்தப்பட்ட சுயவிவரங்களையும் குப்பை சேகரிப்பிலிருந்து பாதுகாக்கிறது; சிறிது காலமாகப் பயன்படுத்தப்படாத சுயவிவரங்கள், அவை குறிப்பிடும் தொகுப்புகளுடன் குப்பை சேகரிக்கப்பட்டதாக இருக்கலாம்.

source: To be 100% sure that a given profile will never be collected, install the manifest to a profile and use @code{GUIX_PROFILE=/the/profile; . "$GUIX_PROFILE"/etc/profile} as explained above: this guarantees that our hacking environment will be available at all times.
ta: கொடுக்கப்பட்ட சுயவிவரம் ஒருபோதும் சேகரிக்கப்படாது என்பதில் 100% உறுதியாக இருக்க, ஒரு சுயவிவரத்தில் மேனிஃபெச்டை நிறுவி, @code{GUIX_PROFILE=/the/profile; . மேலே விவரிக்கப்பட்டுள்ளபடி "$GUIX_PROFILE"/etc/profile}: இது எங்கள் ஏக்கிங் சூழல் எல்லா நேரங்களிலும் கிடைக்கும் என்பதற்கு பொறுப்பு அளிக்கிறது.

source: @emph{Security warning:} While keeping old profiles around can be convenient, keep in mind that outdated packages may not have received the latest security fixes.
ta: @emph{Security warning:} பழைய சுயவிவரங்களைச் சுற்றி வைத்திருப்பது வசதியானது என்றாலும், காலாவதியான தொகுப்புகள் அண்மைக் கால பாதுகாப்புத் திருத்தங்களைப் பெற்றிருக்காமல் இருக்கலாம் என்பதை நினைவில் கொள்ளவும்.

source: To reproduce a profile bit-for-bit, we need two pieces of information:
ta: பிட்-க்கு-பிட் சுயவிவரத்தை மீண்டும் உருவாக்க, எங்களுக்கு இரண்டு தகவல்கள் தேவை:

source: a manifest (@pxref{Writing Manifests,,, guix, GNU Guix Reference Manual});
ta: ஒரு மேனிஃபெச்ட் (@pxref{Writing Manifests,,, guix, GNU Guix குறிப்பு Manual});

source: a Guix channel specification (@pxref{Replicating Guix,,, guix, GNU Guix Reference Manual}).
ta: ஒரு Guix சேனல் விவரக்குறிப்பு (@pxref{Replicating Guix,,, guix, GNU Guix குறிப்பு Manual}).

source: Indeed, manifests alone might not be enough: different Guix versions (or different channels) can produce different outputs for a given manifest.
ta: உண்மையில், மேனிஃபெச்டுகள் மட்டும் போதுமானதாக இருக்காது: வெவ்வேறு Guix பதிப்புகள் (அல்லது வெவ்வேறு சேனல்கள்) கொடுக்கப்பட்ட மேனிஃபெச்ட்டிற்கு வெவ்வேறு வெளியீடுகளை உருவாக்க முடியும்.

source: You can output the Guix channel specification with @samp{guix describe --format=channels} (@pxref{Invoking guix describe,,, guix, GNU Guix Reference Manual}). Save this to a file, say @samp{channel-specs.scm}.
ta: நீங்கள் Guix சேனல் விவரக்குறிப்பை @samp{guix விவரம் --format=channels} உடன் வெளியிடலாம் (@pxref{Invoking guix description,,, guix, GNU Guix குறிப்பு Manual}). இதை ஒரு கோப்பில் சேமித்து, @samp{channel-specs.scm} எனக் கூறவும்.

source: On another computer, you can use the channel specification file and the manifest to reproduce the exact same profile:
ta: மற்றொரு கணினியில், அதே சுயவிவரத்தை மீண்டும் உருவாக்க சேனல் விவரக்குறிப்பு கோப்பையும் மேனிஃபெச்டையும் பயன்படுத்தலாம்:

source: mkdir -p "$GUIX_EXTRA_PROFILES/my-project" "$GUIX_EXTRA"/my-project/guix/bin/guix package \ --manifest=/path/to/guix-my-project-manifest.scm \ --profile="$GUIX_EXTRA_PROFILES"/my-project/my-project
ta: mkdir -p "$GUIX_EXTRA_PROFILES/my-project" "$GUIX_EXTRA"/my-project/guix/bin/guix தொகுப்பு \ --manifest=/path/to/guix-my-project-manifest.scm \ --profile="$GUIX_EXTRA_PROFILES"/my-project/my-project

source: It's safe to delete the Guix channel profile you've just installed with the channel specification, the project profile does not depend on it.
ta: சேனல் விவரக்குறிப்புடன் நீங்கள் நிறுவிய Guix சேனல் சுயவிவரத்தை நீக்குவது பாதுகாப்பானது, திட்ட சுயவிவரம் அதைச் சார்ந்து இருக்காது.

source: development, with Guix
ta: வளர்ச்சி, Guix உடன்

source: software development, with Guix
ta: Guix உடன் மென்பொருள் மேம்பாடு

source: Guix is a handy tool for developers; @command{guix shell}, in particular, gives a standalone development environment for your package, no matter what language(s) it's written in (@pxref{Invoking guix shell,,, guix, GNU Guix Reference Manual}). To benefit from it, you have to initially write a package definition and have it either in Guix proper, or in a channel, or directly in your project's source tree as a @file{guix.scm} file. This last option is appealing: all developers have to do to get set up is clone the project's repository and run @command{guix shell}, with no arguments.
ta: Guix டெவலப்பர்களுக்கு ஒரு எளிமையான கருவியாகும்; @command{guix shell}, குறிப்பாக, எந்த மொழி(கள்) இல் எழுதப்பட்டிருந்தாலும் (@pxref{Invoking guix shell,,, guix, GNU Guix குறிப்பு Manual}) உங்கள் தொகுப்புக்கான முழுமையான வளர்ச்சி சூழலை வழங்குகிறது. அதிலிருந்து பயனடைய, நீங்கள் ஆரம்பத்தில் ஒரு தொகுப்பு வரையறையை எழுதி, அதை Guix முறையான அல்லது சேனலில் அல்லது நேரடியாக உங்கள் திட்டத்தின் மூல மரத்தில் @file{guix.scm} கோப்பாக வைத்திருக்க வேண்டும். இந்த கடைசி விருப்பம் கவர்ச்சிகரமானதாக உள்ளது: அமைக்க உருவாக்குபவர்கள் செய்ய வேண்டியது ப்ராசெக்ட்டின் களஞ்சியத்தை நகலி செய்து @command{guix shell}ஐ எந்த வாதங்களும் இல்லாமல் இயக்க வேண்டும்.

source: Development needs go beyond development environments though. How can developers perform continuous integration of their code in Guix build environments? How can they deliver their code straight to adventurous users? This chapter describes a set of files developers can add to their repository to set up Guix-based development environments, continuous integration, and continuous delivery---all at once@footnote{This chapter is adapted from a @uref{https://guix.gnu.org/en/blog/2023/from-development-environments-to-continuous-integrationthe-ultimate-guide-to-software-development-with-guix/, blog post} published in June 2023 on the Guix web site.}.
ta: வளர்ச்சி தேவைகள் வளர்ச்சி சூழலுக்கு அப்பாற்பட்டவை. உருவாக்குபவர்கள் தங்கள் குறியீட்டின் தொடர்ச்சியான ஒருங்கிணைப்பை Guix உருவாக்க சூழல்களில் எவ்வாறு செய்யலாம்? சாகசப் பயனாளிகளுக்கு எப்படி அவர்கள் தங்கள் குறியீட்டை நேரடியாக வழங்க முடியும்? Guix-அடிப்படையிலான மேம்பாட்டு சூழல்கள், தொடர்ச்சியான ஒருங்கிணைப்பு மற்றும் தொடர்ச்சியான வழங்கல் ஆகியவற்றை அமைக்க உருவாக்குபவர்கள் தங்கள் களஞ்சியத்தில் சேர்க்கக்கூடிய கோப்புகளின் தொகுப்பை இந்த அத்தியாயம் விவரிக்கிறது---அனைத்தும் ஒரே நேரத்தில்@அடிக்குறிப்பு{இந்த அத்தியாயம் @uref{https://guix.gnu.org/en/blog/2023/from-development-environments-to-continuous-integrationthe-ultimate-guide-to-software-development-with-guix/, வலைப்பதிவு post} சூன் 2023 இல் Guix இணையதளத்தில் வெளியிடப்பட்டது.}.

source: How do we go about ``Guixifying'' a repository? The first step, as we've seen, will be to add a @file{guix.scm} at the root of the repository in question. We'll take @uref{https://www.gnu.org/software/guile,Guile} as an example in this chapter: it's written in Scheme (mostly) and C, and has a number of dependencies---a C compilation tool chain, C libraries, Autoconf and its friends, LaTeX, and so on. The resulting @file{guix.scm} looks like the usual package definition (@pxref{Defining Packages,,, guix, GNU Guix Reference Manual}), just without the @code{define-public} bit:
ta: ஒரு களஞ்சியத்தை ``Guixifying" பற்றி நாம் எவ்வாறு செல்வது? கேள்விக்குரிய களஞ்சியத்தின் மூலத்தில் @file{guix.scm} ஐச் சேர்ப்பதே நாம் பார்த்த முதல் படியாகும். இந்த அத்தியாயத்தில் @uref{https://www.gnu.org/software/guile,Guile} ஐ எடுத்துக்கொள்வோம்: இது ச்கீம் (பெரும்பாலும்) மற்றும் C இல் எழுதப்பட்டுள்ளது, மேலும் பல சார்புகளைக் கொண்டுள்ளது---ஒரு C தொகுப்பு கருவி சங்கிலி, C நூலகங்கள், ஆட்டோகான்ஃப் மற்றும் அதன் நண்பர்கள், லாடெக்சு மற்றும் பல. இதன் விளைவாக வரும் @file{guix.scm}, @code{define-public} பிட் இல்லாமல் வழக்கமான தொகுப்பு வரையறை (@pxref{Defining Packages,,, guix, GNU Guix குறிப்பு Manual}) போல் தெரிகிறது:

source: ;; The ‘guix.scm’ file for Guile, for use by ‘guix shell’.
ta: ;; Guileக்கான ‘guix.scm’ கோப்பு, ‘guix shell’ மூலம் பயன்படுத்தப்படும்.

source: (use-modules (guix) (guix build-system gnu) ((guix licenses) #:prefix license:) (gnu packages autotools) (gnu packages base) (gnu packages bash) (gnu packages bdw-gc) (gnu packages compression) (gnu packages flex) (gnu packages gdb) (gnu packages gettext) (gnu packages gperf) (gnu packages libffi) (gnu packages libunistring) (gnu packages linux) (gnu packages pkg-config) (gnu packages readline) (gnu packages tex) (gnu packages texinfo) (gnu packages version-control))
ta: (பயன்படுத்தும் தொகுதிகள் (guix) (guix build-system gnu) ((guix உரிமங்கள்) #: முன்னொட்டு உரிமம்:) (gnu தொகுப்புகள் autotools) (gnu தொகுப்புகள் அடிப்படை) (gnu தொகுப்புகள் பாச்) (gnu தொகுப்புகள் bdw-gc) (gnu தொகுப்புகள் சுருக்கம்) (gnu தொகுப்புகள் நெகிழ்வு) (gnu தொகுப்புகள் gdb) (gnu தொகுப்புகள் gettext) (gnu தொகுப்புகள் gperf) (gnu தொகுப்புகள் libffi) (gnu தொகுப்புகள் libunistring) (gnu தொகுப்புகள் லினக்ச்) (gnu தொகுப்புகள் pkg-config) (gnu தொகுப்புகள் ரீட்லைன்) (gnu தொகுப்புகள் டெக்ச்) (gnu தொகுப்புகள் texinfo) (gnu தொகுப்புகள் பதிப்பு-கட்டுப்பாடு))

source: (package (name "guile") (version "3.0.99-git") ;funky version number (source #f) ;no source (build-system gnu-build-system) (native-inputs (append (list autoconf automake libtool gnu-gettext flex texinfo texlive-base ;for "make pdf" texlive-epsf gperf git gdb strace readline lzip pkg-config)
ta: (தொகுப்பு (பெயர் "குயில்") (பதிப்பு "3.0.99-சிட்") ;பங்கி பதிப்பு எண் (ஆதாரம் #f) ;ஆதாரம் இல்லை (கட்டுமான அமைப்பு gnu-build-system) (சொந்த-உள்ளீடுகள் (சேர்க்கவும் (பட்டியல் autoconf தானியங்கி libtool gnu-gettext நெகிழ்வு டெக்ச்இன்ஃபோ டெக்ச்லைவ்-பேச் ; "pdf ஐ உருவாக்க" டெக்ச்லைவ்-ஈபிஎச்எஃப் gperf git gdb அடுக்கு வாசிப்பு வரி lzip pkg-config)

source: ;; When cross-compiling, a native version of Guile itself is ;; needed. (if (%current-target-system) (list this-package) '()))) (inputs (list libffi bash-minimal)) (propagated-inputs (list libunistring libgc))
ta: ;; குறுக்கு-தொகுக்கும் போது, Guile இன் சொந்த பதிப்பு ;; தேவை. (எனில் (%தற்போதைய இலக்கு-அமைப்பு) (இந்த தொகுப்பை பட்டியலிடுங்கள்) '()))) (உள்ளீடுகள் (லிப்ஃபி பாச்-குறைந்தபட்ச பட்டியல்)) (பிரசாரம்-உள்ளீடுகள் (லிபுனிச்ட்ரிங் libgc பட்டியல்))

source: (native-search-paths (list (search-path-specification (variable "GUILE_LOAD_PATH") (files '("share/guile/site/3.0"))) (search-path-specification (variable "GUILE_LOAD_COMPILED_PATH") (files '("lib/guile/3.0/site-ccache"))))) (synopsis "Scheme implementation intended especially for extensions") (description "Guile is the GNU Ubiquitous Intelligent Language for Extensions, and it's actually a full-blown Scheme implementation!") (home-page "https://www.gnu.org/software/guile/") (license license:lgpl3+))
ta: (சொந்த-தேடல்-பாதைகள் (பட்டியல் (தேடல்-பாதை-குறிப்பிடுதல் (மாறி "GUILE_LOAD_PATH") (கோப்புகள் '("share/guile/site/3.0"))) (தேடல்-பாதை-குறிப்பிடுதல் (மாறி "GUILE_LOAD_COMPILED_PATH") (கோப்புகள் '("lib/guile/3.0/site-ccache"))))) (சுருக்கம் "திட்டம் செயல்படுத்தல் குறிப்பாக நீட்டிப்புகளுக்காக") (விளக்கம் "Guile என்பது நீட்டிப்புகளுக்கான GNU எங்கும் நிறைந்த அறிவார்ந்த மொழி, மேலும் இது உண்மையில் ஒரு முழுமையான திட்ட அமலாக்கம்!") (முகப்பு பக்கம் "https://www.gnu.org/software/guile/") (உரிமம் உரிமம்:lgpl3+))

source: Quite a bit of boilerplate, but now someone who'd like to hack on Guile now only needs to run:
ta: கொஞ்சம் கொதிகலன், ஆனால் இப்போது Guile ஐ ஏக் செய்ய விரும்பும் ஒருவர் இப்போது இயக்க வேண்டும்:

source: guix shell
ta: செல் பூச்சு

source: That gives them a shell containing all the dependencies of Guile: those listed above, but also @emph{implicit dependencies} such as the GCC tool chain, GNU@ Make, sed, grep, and so on. @xref{Invoking guix shell,,, guix, GNU Guix Reference Manual}, for more info on @command{guix shell}.
ta: இது Guile இன் அனைத்து சார்புகளையும் உள்ளடக்கிய செல்லை அவர்களுக்கு வழங்குகிறது: மேலே பட்டியலிடப்பட்டவை, ஆனால் GCC கருவி சங்கிலி, GNU@ Make, sed, grep மற்றும் பல போன்ற @emph{implicit dependencies}. @xref{Invoking guix shell,,, guix, GNU Guix குறிப்பு Manual}, @command{guix shell} பற்றிய கூடுதல் தகவலுக்கு.

source: The chef's recommendation
ta: சமையல்காரரின் பரிந்துரை

source: Our suggestion is to create development environments like this:
ta: இது போன்ற வளர்ச்சி சூழல்களை உருவாக்குவதே எங்கள் பரிந்துரை:

source: guix shell --container --link-profile
ta: guix ஓடு --container --link-profile

source: ... or, for short:
ta: ... அல்லது, சுருக்கமாக:

source: guix shell -CP
ta: பிளாச்டர் செல் -CP

source: That gives a shell in an isolated container, and all the dependencies show up in @code{$HOME/.guix-profile}, which plays well with caches such as @file{config.cache} (@pxref{Cache Files,,, autoconf, Autoconf}) and absolute file names recorded in generated @code{Makefile}s and the likes. The fact that the shell runs in a container brings peace of mind: nothing but the current directory and Guile's dependencies is visible inside the container; nothing from the system can possibly interfere with your development.
ta: இது ஒரு தனிமைப்படுத்தப்பட்ட கொள்கலனில் செல் கொடுக்கிறது, மேலும் அனைத்து சார்புகளும் @code{$HOME/.guix-profile} இல் காண்பிக்கப்படும், இது @file{config.cache} (@pxref{Cache Files,,, autoconf, Autoconf}) மற்றும் உருவாக்கப்பட்ட @code{Makefile இல் பதிவுசெய்யப்பட்ட முழுமையான கோப்பு பெயர்கள் போன்ற தற்காலிக சேமிப்புகளுடன் நன்றாக இயங்கும். செல் ஒரு கொள்கலனில் இயங்குவது மன அமைதியைத் தருகிறது: தற்போதைய அடைவு மற்றும் குயிலின் சார்புகளைத் தவிர வேறு எதுவும் கொள்கலனுக்குள் தெரியவில்லை; கணினியில் இருந்து எதுவும் உங்கள் வளர்ச்சியில் தலையிட முடியாது.

source: Level 1: Building with Guix
ta: நிலை 1: Guix உடன் கட்டிடம்

source: Now that we have a package definition (@pxref{Getting Started}), why not also take advantage of it so we can build Guile with Guix? We had left the @code{source} field empty, because @command{guix shell} above only cares about the @emph{inputs} of our package---so it can set up the development environment---not about the package itself.
ta: இப்போது எங்களிடம் ஒரு தொகுப்பு வரையறை உள்ளது (@pxref{Getting Started}), அதை ஏன் பயன்படுத்திக் கொள்ளக்கூடாது, அதனால் நாம் Guix உடன் Guile ஐ உருவாக்க முடியும்? @code{source} புலத்தை காலியாக விட்டுவிட்டோம், ஏனெனில் மேலே உள்ள @command{guix shell} எங்கள் தொகுப்பின் @emph{inputs} பற்றி மட்டுமே அக்கறை கொண்டுள்ளது---அதனால் அது வளர்ச்சி சூழலை அமைக்கும்---தொகுப்பைப் பற்றி அல்ல.

source: To build the package with Guix, we'll need to fill out the @code{source} field, along these lines:
ta: Guix உடன் தொகுப்பை உருவாக்க, பின்வரும் வழிகளில் @code{source} புலத்தை நிரப்ப வேண்டும்:

source: (use-modules (guix) (guix git-download) ;for ‘git-predicate’ @dots{})
ta: (பயன்படுத்தும் தொகுதிகள் (guix) (guix git-download) ;'git-predicate'க்கு @dots{})

source: (define vcs-file? ;; Return true if the given file is under version control. (or (git-predicate (current-source-directory)) (const #t))) ;not in a Git checkout
ta: (விசிஎச்-கோப்பை வரையறுக்கவா? ;; கொடுக்கப்பட்ட கோப்பு பதிப்புக் கட்டுப்பாட்டில் இருந்தால் உண்மை என்பதைத் திரும்பவும். (அல்லது (git-predicate (தற்போதைய-மூல-அடைவு)) (const #t))) ;Git செக் அவுட்டில் இல்லை

source: (package (name "guile") (version "3.0.99-git") ;funky version number (source (local-file "." "guile-checkout" #:recursive? #t #:select? vcs-file?)) @dots{})
ta: (தொகுப்பு (பெயர் "குயில்") (பதிப்பு "3.0.99-சிட்") ;பங்கி பதிப்பு எண் (ஆதாரம் (உள்ளூர்-கோப்பு "." "guile-checkout" #:சுழற்சி? #டி #:தேர்ந்தெடுக்கவா? vcs-file?)) @dots{})

source: Here's what we changed compared to the previous section:
ta: முந்தைய பகுதியுடன் ஒப்பிடும்போது நாங்கள் மாற்றியவை இங்கே:

source: We added @code{(guix git-download)} to our set of imported modules, so we can use its @code{git-predicate} procedure.
ta: இறக்குமதி செய்யப்பட்ட தொகுதிகளின் தொகுப்பில் @code{(guix git-download)}ஐச் சேர்த்துள்ளோம், எனவே அதன் @code{git-predicate} நடைமுறையைப் பயன்படுத்தலாம்.

source: We defined @code{vcs-file?} as a procedure that returns true when passed a file that is under version control. For good measure, we add a fallback case for when we're not in a Git checkout: always return true.
ta: @code{vcs-file?} என்பது பதிப்புக் கட்டுப்பாட்டின் கீழ் உள்ள கோப்பை அனுப்பும் போது உண்மையாக இருக்கும் செயல்முறை என வரையறுத்துள்ளோம். நல்ல நடவடிக்கையாக, நாங்கள் Git செக் அவுட்டில் இல்லாதபோது, எப்பொழுதும் உண்மையாக இருக்கும் என்பதற்கு ஒரு ஃபால்பேக் கேசைச் சேர்க்கிறோம்.

source: We set @code{source} to a @uref{https://guix.gnu.org/manual/devel/en/html_node/G_002dExpressions.html#index-local_002dfile,@code{local-file}}---a recursive copy of the current directory (@code{"."}), limited to files under version control (the @code{#:select?} bit).
ta: @code{source}ஐ @uref{https://guix.gnu.org/manual/devel/en/html_node/G_002dExpressions.html#index-local_002dfile,@code{local-file}}---ஒரு சுழல்நிலைப் பதிப்பு ({"கோப்பின் கட்டுப்படுத்தப்பட்ட கோப்பின் கீழ் உள்ள கோப்பின் வரையறுக்கப்பட்ட பதிப்பு") என அமைத்துள்ளோம்."@} @code{#:select?} bit).

source: From there on, our @file{guix.scm} file serves a second purpose: it lets us build the software with Guix. The whole point of building with Guix is that it's a ``clean'' build---you can be sure nothing from your working tree or system interferes with the build result---and it lets you test a variety of things. First, you can do a plain native build:
ta: அங்கிருந்து, எங்கள் @file{guix.scm} கோப்பு இரண்டாவது நோக்கத்திற்காக உதவுகிறது: இது Guix உடன் மென்பொருளை உருவாக்க உதவுகிறது. Guix ஐக் கொண்டு உருவாக்குவதன் முழு நற்பொருத்தம் என்னவென்றால், இது ஒரு ``சுத்தமான" உருவாக்கம் ---உங்கள் வேலை செய்யும் மரம் அல்லது அமைப்பு எதுவும் உருவாக்க முடிவுகளில் குறுக்கிடவில்லை என்பதை நீங்கள் உறுதியாக நம்பலாம் --- மேலும் இது பல்வேறு விசயங்களைச் சோதிக்க உங்களை அனுமதிக்கிறது. முதலில், நீங்கள் ஒரு எளிய சொந்த உருவாக்கம் செய்யலாம்:

source: guix build -f guix.scm
ta: பூச்சு கட்ட -f plaster.scm

source: But you can also build for another system (possibly after setting up @pxref{Daemon Offload Setup, offloading,, guix, GNU Guix Reference Manual} or @pxref{Virtualization Services, transparent emulation,, guix, GNU Guix Reference Manual}):
ta: ஆனால் நீங்கள் மற்றொரு அமைப்பிற்காக உருவாக்கலாம் (@pxref{Daemon Offload அமைப்பு, ஆஃப்லோடிங்,, guix, GNU Guix குறிப்பு Manual} அல்லது @pxref{Virtualization Services, transparent emulation,, guix, GNU Guix குறிப்பு Manual} ஆகியவற்றை அமைத்த பிறகு:

source: guix build -f guix.scm -s aarch64-linux -s riscv64-linux
ta: guix உருவாக்கு -f guix.scm -s aarch64-linux -s riscv64-linux

source: @dots{} or cross-compile:
ta: @dots{} அல்லது குறுக்கு தொகுத்தல்:

source: guix build -f guix.scm --target=x86_64-w64-mingw32
ta: guix உருவாக்கு -f guix.scm --target=x86_64-w64-mingw32

source: You can also use @dfn{package transformations} to test package variants (@pxref{Package Transformation Options,,, guix, GNU Guix Reference Manual}):
ta: தொகுப்பு மாறுபாடுகளைச் சோதிக்க நீங்கள் @dfn{package transformations} ஐப் பயன்படுத்தலாம் (@pxref{Package Transformation Options,,, guix, GNU Guix குறிப்பு Manual}):

source: # What if we built with Clang instead of GCC? guix build -f guix.scm \ --with-c-toolchain=guile@@3.0.99-git=clang-toolchain
ta: # GCC க்கு பதிலாக க்ளாங் மூலம் கட்டினால் என்ன ஆகும்? guix உருவாக்கு -f guix.scm \ --with-c-toolchain=guile@@3.0.99-git=cang-toolchain

source: # What about that under-tested configure flag? guix build -f guix.scm \ --with-configure-flag=guile@@3.0.99-git=--disable-networking
ta: # சோதனைக்குட்பட்ட உள்ளமைவுக் கொடி பற்றி என்ன? guix உருவாக்கு -f guix.scm \ --with-configure-flag=guile@@3.0.99-git=--disable-networking

source: Handy!
ta: எளிது!

source: Level 2: The Repository as a Channel
ta: நிலை 2: சேனலாக களஞ்சியம்

source: We now have a Git repository containing (among other things) a package definition (@pxref{Building with Guix}). Can't we turn it into a @dfn{channel} (@pxref{Channels,,, guix, GNU Guix Reference Manual})? After all, channels are designed to ship package definitions to users, and that's exactly what we're doing with our @file{guix.scm}.
ta: இப்போது எங்களிடம் ஒரு Git களஞ்சியம் உள்ளது (மற்றவற்றுடன்) ஒரு தொகுப்பு வரையறை (@pxref{Building with Guix}). அதை @dfn{channel} (@pxref{Channels,,, guix, GNU Guix குறிப்பு Manual}) ஆக மாற்ற முடியாதா? எல்லாவற்றிற்கும் மேலாக, பேக்கேச் வரையறைகளை பயனர்களுக்கு அனுப்புவதற்காக சேனல்கள் வடிவமைக்கப்பட்டுள்ளன, அதையே நாங்கள் எங்கள் @file{guix.scm} மூலம் செய்து வருகிறோம்.
