Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: Turns out we can indeed turn it into a channel, but with one caveat: we must create a separate directory for the @code{.scm} file(s) of our channel so that @command{guix pull} doesn't load unrelated @code{.scm} files when someone pulls the channel---and in Guile, there are lots of them! So we'll start like this, keeping a top-level @file{guix.scm} symlink for the sake of @command{guix shell}:
ta: நாம் அதை ஒரு சேனலாக மாற்றலாம், ஆனால் ஒரு எச்சரிக்கையுடன்: எங்கள் சேனலின் @code{.scm} கோப்பிற்கான (கள்) தனி கோப்பகத்தை உருவாக்க வேண்டும், இதனால் @command{guix pull} தொடர்பில்லாத @code{.scm} கோப்புகளை யாராவது சேனலை இழுக்கும்போது ---மற்றும் Guile இல், அவற்றில் நிறைய உள்ளன! எனவே, @command{guix shell}க்காக ஒரு உயர்மட்ட @file{guix.scm} சிம்லிங்கை வைத்து, இப்படித் தொடங்குவோம்:

source: To make it usable as part of a channel, we need to turn our @file{guix.scm} file into a @dfn{package module} (@pxref{Package Modules,,, guix, GNU Guix Reference Manual}): we do that by changing the @code{use-modules} form at the top to a @code{define-module} form. We also need to actually @emph{export} a package variable, with @code{define-public}, while still returning the package value at the end of the file so we can still use @command{guix shell} and @command{guix build -f guix.scm}. The end result looks like this (not repeating things that haven't changed):
ta: சேனலின் ஒரு பகுதியாகப் பயன்படுத்தக்கூடியதாக மாற்ற, எங்கள் @file{guix.scm} கோப்பை @dfn{package தொகுதியாக மாற்ற வேண்டும் நாங்கள் @emph{package module} ஒரு தொகுப்பு மாறி, @code{define-public} உடன், கோப்பின் முடிவில் தொகுப்பு மதிப்பைத் திருப்பித் தர வேண்டும், எனவே @command{export} மற்றும் @command{guix உருவாக்கு -f guix.scm} ஆகியவற்றைப் பயன்படுத்தலாம். இறுதி முடிவு இப்படித் தெரிகிறது (மாறாத விசயங்களை மீண்டும் செய்யவில்லை):

source: (define-module (guile-package) #:use-module (guix) #:use-module (guix git-download) ;for ‘git-predicate’ @dots{})
ta: (வரையறுத்தல்-தொகுதி (guile-package) #:use-module (guix) #:use-module (guix git-download) ;'git-predicate'க்கு @dots{})

source: (define vcs-file? ;; Return true if the given file is under version control. (or (git-predicate (dirname (dirname (current-source-directory)))) (const #t))) ;not in a Git checkout
ta: (விசிஎச்-கோப்பை வரையறுக்கவா? ;; கொடுக்கப்பட்ட கோப்பு பதிப்புக் கட்டுப்பாட்டில் இருந்தால் உண்மை என்பதைத் திரும்பவும். (அல்லது (git-predicate (dirname (dirname (தற்போதைய மூல-அடைவு)))) (const #t))) ;Git செக் அவுட்டில் இல்லை

source: (define-public guile (package (name "guile") (version "3.0.99-git") ;funky version number (source (local-file "../.." "guile-checkout" #:recursive? #t #:select? vcs-file?)) @dots{}))
ta: (வரையறை-பொது ஏமாற்று (தொகுப்பு (பெயர் "குயில்") (பதிப்பு "3.0.99-சிட்") ;பங்கி பதிப்பு எண் (மூலம் (உள்ளூர்-கோப்பு "../.." "guile-checkout" #:சுழற்சி? #டி #:தேர்ந்தெடுக்கவா? vcs-file?)) @dots{}))

source: ;; Return the package object define above at the end of the module. guile
ta: ;; தொகுதியின் முடிவில் மேலே வரையறுக்கப்பட்ட தொகுப்புப் பொருளைத் திருப்பி அனுப்பவும். வஞ்சகம்

source: We need one last thing: a @uref{https://guix.gnu.org/manual/devel/en/html_node/Package-Modules-in-a-Sub_002ddirectory.html,@code{.guix-channel} file} so Guix knows where to look for package modules in our repository:
ta: எங்களுக்குக் கடைசியாக ஒன்று தேவை: @uref{https://guix.gnu.org/manual/devel/en/html_node/Package-Modules-in-a-Sub_002ddirectory.html,@code{.guix-channel} கோப்பு}எனவே எங்கள் களஞ்சியத்தில் தொகுப்புத் தொகுதிகளை எங்குத் தேடுவது என்று குயிக்சுக்கு தெரியும்:

source: ;; This file lets us present this repo as a Guix channel.
ta: ;; இந்தக் கோப்பு இந்த ரெப்போவை Guix சேனலாக வழங்க உதவுகிறது.

source: (channel (version 0) (directory ".guix/modules")) ;look for package modules under .guix/modules/
ta: (சேனல் (பதிப்பு 0) (கோப்பகம் ".guix/modules")) ;.guix/modules/ இன் கீழ் தொகுப்பு தொகுதிகளை தேடவும்

source: To recap, we now have these files:
ta: மறுபரிசீலனை செய்ய, எங்களிடம் இப்போது பின்வரும் கோப்புகள் உள்ளன:

source: . ├── .guix-channel ├── guix.scm → .guix/modules/guile-package.scm └── .guix └── modules └── guile-package.scm
ta: . ├── .gix-channel ├── guile.scm → .guix/modules/guile-package.scm └── .சுண்ணாம்பு └── தொகுதிகள் └── guile-package.scm

source: And that's it: we have a channel! (We could do better and support @uref{https://guix.gnu.org/manual/devel/en/html_node/Specifying-Channel-Authorizations.html,@emph{channel authentication}} so users know they're pulling genuine code. We'll spare you the details here but it's worth considering!) Users can pull from this channel by @uref{https://guix.gnu.org/manual/devel/en/html_node/Specifying-Additional-Channels.html,adding it to @code{~/.config/guix/channels.scm}}, along these lines:
ta: அவ்வளவுதான்: எங்களிடம் ஒரு சேனல் உள்ளது! (நாங்கள் இன்னும் சிறப்பாகச் செய்து @uref{https://guix.gnu.org/manual/devel/en/html_node/Specifying-Channel-Authorizations.html,@emph{channel authentication}}க்கு ஆதரவளிக்க முடியும். எனவே பயனர்கள் அவர்கள் உண்மையான குறியீட்டை இழுக்கிறார்கள் என்பதை அறிவோம். இந்தச் சேனலில் இருந்து உங்களுக்குத் தேவையான விவரங்களைப் பயன்படுத்திக் கொள்ளலாம். @uref{https://guix.gnu.org/manual/devel/en/html_node/Specifying-Additional-Channels.html, @code{~/.config/guix/channels.scm}} இல், இந்த வழிகளில் சேர்க்கிறது:

source: (append (list (channel (name 'guile) (url "https://git.savannah.gnu.org/git/guile.git") (branch "main"))) %default-channels)
ta: (சேனல்) (பட்டியல் (பெயர் 'குயில்) (url "https://git.savannah.gnu.org/git/guile.git") (கிளை "முதன்மை"))) %இயல்பு சேனல்கள்)

source: After running @command{guix pull}, we can see the new package:
ta: @command{guix pull} இயக்கிய பிறகு, புதிய தொகுப்பைக் காணலாம்:

source: $ guix describe Generation 264 May 26 2023 16:00:35 (current) guile 36fd2b4 repository URL: https://git.savannah.gnu.org/git/guile.git branch: main commit: 36fd2b4920ae926c79b936c29e739e71a6dff2bc guix c5bc698 repository URL: https://git.guix.gnu.org/guix.git commit: c5bc698e8922d78ed85989985cc2ceb034de2f23 $ guix package -A ^guile$ guile 3.0.99-git out,debug guile-package.scm:51:4 guile 3.0.9 out,debug gnu/packages/guile.scm:317:2 guile 2.2.7 out,debug gnu/packages/guile.scm:258:2 guile 2.2.4 out,debug gnu/packages/guile.scm:304:2 guile 2.0.14 out,debug gnu/packages/guile.scm:148:2 guile 1.8.8 out gnu/packages/guile.scm:77:2 $ guix build guile@@3.0.99-git [@dots{}] /gnu/store/axnzbl89yz7ld78bmx72vpqp802dwsar-guile-3.0.99-git-debug /gnu/store/r34gsij7f0glg2fbakcmmk0zn4v62s5w-guile-3.0.99-git
ta: $ guix விவரிக்கிறது தலைமுறை 264 மே 26 2023 16:00:35 (தற்போது) guile 36fd2b4 களஞ்சிய URL: https://git.savannah.gnu.org/git/guile.git கிளை: முக்கிய உறுதி: 36fd2b4920ae926c79b936c29e739e71a6dff2bc guix c5bc698 களஞ்சிய URL: https://git.guix.gnu.org/guix.git உறுதி: c5bc698e8922d78ed85989985cc2ceb034de2f23 $ guix தொகுப்பு -A ^guile$ guile 3.0.99-git out,debug guile-package.scm:51:4 guile 3.0.9 out,debug gnu/packages/guile.scm:317:2 guile 2.2.7 out,debug gnu/packages/guile.scm:258:2 guile 2.2.4 out,debug gnu/packages/guile.scm:304:2 guile 2.0.14 out,debug gnu/packages/guile.scm:148:2 guile 1.8.8 out gnu/packages/guile.scm:77:2 $ guix பில்ட் guile@@3.0.99-git [@dots{}] /gnu/store/axnzbl89yz7ld78bmx72vpqp802dwsar-guile-3.0.99-git-debug /gnu/store/r34gsij7f0glg2fbakcmmk0zn4v62s5w-guile-3.0.99-git

source: That's how, as a developer, you get your software delivered directly into the hands of users! No intermediaries, yet no loss of transparency and provenance tracking.
ta: இப்படித்தான், ஒரு டெவலப்பராக, உங்கள் மென்பொருளை நேரடியாகப் பயனர்களின் கைகளுக்கு வழங்குவீர்கள்! இடைத்தரகர்கள் இல்லை, இன்னும் வெளிப்படைத்தன்மை மற்றும் ஆதார கண்காணிப்பு இழப்பு இல்லை.

source: With that in place, it also becomes trivial for anyone to create Docker images, Deb/RPM packages, or a plain tarball with @command{guix pack} (@pxref{Invoking guix pack,,, guix, GNU Guix Reference Manual}):
ta: அதை வைத்து, கப்பல்துறை படங்கள், Deb/RPM தொகுப்புகள் அல்லது @command{guix pack} (@pxref{Invoking guix pack,,, guix, GNU Guix குறிப்பு Manual}) கொண்ட ஒரு சாதாரண நாடாகாப்பகபந்து உருவாக்குவது எவருக்கும் அற்பமானது:

source: # How about a Docker image of our Guile snapshot? guix pack -f docker -S /bin=bin guile@@3.0.99-git
ta: # எங்கள் கைல் ச்னாப்சாட்டின் கப்பல்துறை படம் எப்படி இருக்கும்? guix pack -f docker -S /bin=bin guile@@3.0.99-git

source: # And a relocatable RPM? guix pack -f rpm -R -S /bin=bin guile@@3.0.99-git
ta: # மற்றும் இடமாற்றம் செய்யக்கூடிய RPM? guix pack -f rpm -R -S /bin=bin guile@@3.0.99-git

source: Bonus: Package Variants
ta: போனச்: தொகுப்பு மாறுபாடுகள்

source: We now have an actual channel, but it contains only one package (@pxref{The Repository as a Channel}). While we're at it, we can define @dfn{package variants} (@pxref{Defining Package Variants,,, guix, GNU Guix Reference Manual}) in our @file{guile-package.scm} file, variants that we want to be able to test as Guile developers---similar to what we did above with transformation options. We can add them like so:
ta: எங்களிடம் ஒரு உண்மையான சேனல் உள்ளது, ஆனால் அதில் ஒரே ஒரு தொகுப்பு மட்டுமே உள்ளது (@pxref{The Repository as a Channel}). நாங்கள் இருக்கும் போது, எங்கள் @file{guile-package.scm} கோப்பில், @dfn{package variants} (@pxref{Defining தொகுப்பு Variants,,, guix, GNU Guix குறிப்பு Manual}) வரையறுக்கலாம். நாம் அவற்றை இவ்வாறு சேர்க்கலாம்:

source: ;; This is the ‘.guix/modules/guile-package.scm’ file.
ta: ;; இது ‘.guix/modules/guile-package.scm’ கோப்பு.

source: (define-module (guile-package) @dots{})
ta: (வரையறுத்தல்-தொகுதி (guile-package) @dots{})

source: (define-public guile @dots{})
ta: (வரையறை-பொது ஏமாற்று @dots{})

source: (define (package-with-configure-flags p flags) "Return P with FLAGS as additional 'configure' flags." (package/inherit p (arguments (substitute-keyword-arguments (package-arguments p) ((#:configure-flags original-flags #~(list)) #~(append #$original-flags #$flags))))))
ta: (வரையறுக்கவும் (கட்டமைப்புடன்-கொடிகள் p கொடிகள்) "FLAGS உடன் P ஐ கூடுதல் 'configure' கொடிகளாகத் திரும்பவும்." (தொகுப்பு/மரபு பக் (வாதங்கள் (மாற்று-திறவுச்சொல்-வாதங்கள் (தொகுப்பு-வாதங்கள் ப) (#:configure-flags original-flags #~(list)) #~(#$அசல்-கொடிகள் #$கொடிகள்))))))

source: (define-public guile-without-threads (package (inherit (package-with-configure-flags guile #~(list "--without-threads"))) (name "guile-without-threads")))
ta: (வரையறை-பொது வஞ்சகம்-இழைகள் இல்லாமல் (தொகுப்பு (பேக்கேச்-உடன்-கட்டமைக்க-கொடிகள் கயில் #~(பட்டியல் "--இழைகள் இல்லாமல்"))) (பெயர் "கயில்-இழைகள் இல்லாத")))

source: (define-public guile-without-networking (package (inherit (package-with-configure-flags guile #~(list "--disable-networking"))) (name "guile-without-networking")))
ta: (வரையறுத்தல்-பொது வஞ்சகம்-இல்லாத-நெட்வொர்க்கிங் (தொகுப்பு (பேக்கேச்-உடன்-கட்டமைக்க-கொடிகள் கயில் #~(பட்டியல் "--முடக்கு-நெட்வொர்க்கிங்"))) (பெயர் "குயில்-இல்லாத-நெட்வொர்க்கிங்")))

source: ;; Return the package object defined above at the end of the module. guile
ta: ;; தொகுதியின் முடிவில் மேலே வரையறுக்கப்பட்ட தொகுப்பு பொருளை திருப்பி அனுப்பவும். வஞ்சகம்

source: We can build these variants as regular packages once we've pulled the channel. Alternatively, from a checkout of Guile, we can run a command like this one from the top level:
ta: சேனலை இழுத்தவுடன் இந்த மாறுபாடுகளை வழக்கமான தொகுப்புகளாக உருவாக்கலாம். மாற்றாக, Guile இன் செக் அவுட்டில் இருந்து, மேல் மட்டத்திலிருந்து இது போன்ற கட்டளையை இயக்கலாம்:

source: guix build -L $PWD/.guix/modules guile-without-threads
ta: guix உருவாக்கு -L $PWD/.guix/modules guile-without-threads

source: Level 3: Setting Up Continuous Integration
ta: நிலை 3: தொடர்ச்சியான ஒருங்கிணைப்பை அமைத்தல்

source: continuous integration (CI)
ta: தொடர்ச்சியான ஒருங்கிணைப்பு (CI)

source: The channel we defined above (@pxref{The Repository as a Channel}) becomes even more interesting once we set up @uref{https://en.wikipedia.org/wiki/Continuous_integration, @dfn{continuous integration}} (CI). There are several ways to do that.
ta: @uref{https://en.wikipedia.org/wiki/Continuous_integration, @dfn{The Repository as a Channel}} (CI) ஆகியவற்றை அமைத்தவுடன் மேலே நாங்கள் வரையறுத்துள்ள சேனல் (@pxref{continuous integration}) இன்னும் சுவாரச்யமாகிறது. அதற்கு பல வழிகள் உள்ளன.

source: You can use one of the mainstream continuous integration tools, such as GitLab-CI. To do that, you need to make sure you run jobs in a Docker image or virtual machine that has Guix installed. If we were to do that in the case of Guile, we'd have a job that runs a shell command like this one:
ta: GitLab-CI போன்ற முக்கிய தொடர்ச்சியான ஒருங்கிணைப்பு கருவிகளில் ஒன்றை நீங்கள் பயன்படுத்தலாம். அதைச் செய்ய, Guix நிறுவப்பட்ட கப்பல்துறை படம் அல்லது மெய்நிகர் கணினியில் வேலைகளை இயக்குவதை உறுதிசெய்ய வேண்டும். குயிலின் விசயத்தில் நாம் அதைச் செய்தால், இது போன்ற செல் கட்டளையை இயக்கும் ஒரு வேலை நமக்கு இருக்கும்:

source: guix build -L $PWD/.guix/modules guile@@3.0.99-git
ta: சுவர் கட்ட -L $PWD/.

source: Doing this works great and has the advantage of being easy to achieve on your favorite CI platform.
ta: இதைச் செய்வது சிறப்பாகச் செயல்படுவதுடன், உங்களுக்குப் பிடித்த தொஒ பிளாட்ஃபார்மில் எளிதாகச் சாதிக்க முடியும்.

source: That said, you'll really get the most of it by using @uref{https://guix.gnu.org/en/cuirass,Cuirass}, a CI tool designed for and tightly integrated with Guix. Using it is more work than using a hosted CI tool because you first need to set it up, but that setup phase is greatly simplified if you use its Guix System service (@pxref{Continuous Integration,,, guix, GNU Guix Reference Manual}). Going back to our example, we give Cuirass a spec file that goes like this:
ta: Guix க்காக வடிவமைக்கப்பட்ட மற்றும் இறுக்கமாக ஒருங்கிணைக்கப்பட்ட தொஒ கருவியான @uref{https://guix.gnu.org/en/cuirass,Cuirass} ஐப் பயன்படுத்துவதன் மூலம் நீங்கள் உண்மையில் அதிகப் பலனைப் பெறுவீர்கள். புரவலன் செய்யப்பட்ட தொஒ கருவியைப் பயன்படுத்துவதை விட இதைப் பயன்படுத்துவது அதிக வேலையாகும், ஏனெனில் நீங்கள் முதலில் அதை அமைக்க வேண்டும், ஆனால் அதன் Guix சிச்டம் சேவையைப் (@pxref{தொடர்ச்சியான ஒருங்கிணைப்பு,,, guix, GNU Guix குறிப்பு Manual}) பயன்படுத்தினால், அந்த அமைவு கட்டம் மிகவும் எளிமைப்படுத்தப்படும். எங்கள் உதாரணத்திற்குச் செல்லும்போது, இது போன்ற ஒரு ச்பெக் கோப்பை குய்ராசுக்கு வழங்குகிறோம்:

source: ;; Cuirass spec file to build all the packages of the ‘guile’ channel. (list (specification (name "guile") (build '(channels guile)) (channels (append (list (channel (name 'guile) (url "https://git.savannah.gnu.org/git/guile.git") (branch "main"))) %default-channels))))
ta: ;; 'guile' சேனலின் அனைத்து தொகுப்புகளையும் உருவாக்க Cuiras ச்பெக் கோப்பு. (பட்டியல் (குறிப்பு (பெயர் "குயில்") (கட்டுமானம்' (சேனல்கள் வஞ்சகம்)) (சேனல்கள் (சேனல்) (பட்டியல் (பெயர் 'குயில்) (url "https://git.savannah.gnu.org/git/guile.git") (கிளை "முதன்மை"))) %default-channels))))

source: It differs from what you'd do with other CI tools in two important ways:
ta: இரண்டு முக்கியமான வழிகளில் மற்ற தொஒ கருவிகளுடன் நீங்கள் என்ன செய்வீர்கள் என்பதில் இருந்து இது வேறுபடுகிறது:

source: Cuirass knows it's tracking @emph{two} channels, @code{guile} and @code{guix}. Indeed, our own @code{guile} package depends on many packages provided by the @code{guix} channel---GCC, the GNU libc, libffi, and so on. Changes to packages from the @code{guix} channel can potentially influence our @code{guile} build and this is something we'd like to see as soon as possible as Guile developers.
ta: @emph{two} சேனல்கள், @code{guile} மற்றும் @code{guix} ஆகியவற்றைக் கண்காணிப்பது குய்ராசுக்குத் தெரியும். உண்மையில், எங்கள் சொந்த @code{guile} தொகுப்பு @code{guix} சேனல்-GCC, GNU libc, libffi மற்றும் பலவற்றால் வழங்கப்படும் பல தொகுப்புகளைப் பொறுத்தது. @code{guix} சேனலில் இருந்து பேக்கேச்களில் ஏற்படும் மாற்றங்கள், எங்கள் @code{guile} கட்டமைப்பில் தாக்கத்தை ஏற்படுத்தக்கூடும், மேலும் இது Guile டெவலப்பர்களாகிய நாங்கள் கூடிய விரைவில் பார்க்க விரும்புகிறோம்.

source: Build results are not thrown away: they can be distributed as @dfn{substitutes} so that users of our @code{guile} channel transparently get pre-built binaries! (@pxref{Substitutes,,, guix, GNU Guix Reference Manual}, for background info on substitutes.)
ta: பில்ட் முடிவுகள் தூக்கி எறியப்படவில்லை: அவை @dfn{substitutes} ஆக விநியோகிக்கப்படலாம், இதனால் எங்கள் @code{guile} சேனலின் பயனர்கள் முன் கட்டமைக்கப்பட்ட பைனரிகளைப் பெறுவார்கள்! (@pxref{Substitutes,,, guix, GNU Guix குறிப்பு Manual}, மாற்றீடுகள் பற்றிய பின்னணித் தகவலுக்கு.)

source: From a developer's viewpoint, the end result is this @uref{https://ci.guix.gnu.org/jobset/guile,status page} listing @emph{evaluations}: each evaluation is a combination of commits of the @code{guix} and @code{guile} channels providing a number of @emph{jobs}---one job per package defined in @file{guile-package.scm} times the number of target architectures.
ta: டெவலப்பரின் பார்வையில், இறுதி முடிவு இந்த @uref{https://ci.guix.gnu.org/jobset/guile,status page} பட்டியலிடுகிறது @emph{evaluations}: ஒவ்வொரு மதிப்பீடும் @emph{guix} மற்றும் @code{guile} சேனல்களின் உறுதிப்பாடுகளின் கலவையாகும் இலக்கு கட்டமைப்புகளின் எண்ணிக்கையை விட மடங்கு அதிகம்.

source: As for substitutes, they come for free! As an example, since our @code{guile} jobset is built on ci.guix.gnu.org, which runs @command{guix publish} (@pxref{Invoking guix publish,,, guix, GNU Guix Reference Manual}) in addition to Cuirass, one automatically gets substitutes for @code{guile} builds from ci.guix.gnu.org; no additional work is needed for that.
ta: மாற்றுகளைப் பொறுத்தவரை, அவர்கள் இலவசமாக வருகிறார்கள்! உதாரணமாக, எங்கள் @code{guile} வேலைத்தொகுப்பு ci.guix.gnu.org இல் கட்டமைக்கப்பட்டுள்ளது, இது @command{guix publish} (@pxref{Invoking guix public,,, guix, GNU Guix குறிப்பு கையேடு}) இயங்கும் Cuirass ஐத் தவிர, @code{guile. அதற்கு கூடுதல் வேலை தேவையில்லை.

source: Bonus: Build manifest
ta: போனச்: மேனிஃபெச்ட்டை உருவாக்குங்கள்

source: The Cuirass spec above is convenient: it builds every package in our channel, which includes a few variants (@pxref{Setting Up Continuous Integration}). However, this might be insufficiently expressive in some cases: one might want specific cross-compilation jobs, transformations, Docker images, RPM/Deb packages, or even system tests.
ta: மேலே உள்ள Cuiras விவரக்குறிப்பு வசதியானது: இது எங்கள் சேனலில் உள்ள ஒவ்வொரு தொகுப்பையும் உருவாக்குகிறது, இதில் சில மாறுபாடுகள் உள்ளன (@pxref{Setting Up Continuous Integration}). இருப்பினும், சில சந்தர்ப்பங்களில் இது போதுமான அளவு வெளிப்படுத்தப்படாமல் இருக்கலாம்: குறிப்பிட்ட குறுக்கு-தொகுப்பு வேலைகள், மாற்றங்கள், கப்பல்துறை படங்கள், RPM/Deb தொகுப்புகள் அல்லது கணினி சோதனைகள் கூட தேவைப்படலாம்.

source: To achieve that, you can write a @dfn{manifest} (@pxref{Writing Manifests,,, guix, GNU Guix Reference Manual}). The one we have for Guile has entries for the package variants we defined above, as well as additional variants and cross builds:
ta: அதை அடைய, நீங்கள் @dfn{manifest} (@pxref{Writing Manifests,,, guix, GNU Guix குறிப்பு Manual}) எழுதலாம். Guile க்காக எங்களிடம் உள்ள ஒன்று, மேலே நாம் வரையறுத்த தொகுப்பு வகைகளுக்கான உள்ளீடுகளையும், கூடுதல் மாறுபாடுகள் மற்றும் குறுக்கு உருவாக்கங்களையும் கொண்டுள்ளது:

source: ;; This is ‘.guix/manifest.scm’.
ta: ;; இது ‘.guix/manifest.scm’.

source: (use-modules (guix) (guix profiles) (guile-package)) ;import our own package module
ta: (பயன்படுத்தும் தொகுதிகள் (guix) (guix சுயவிவரங்கள்) (guile-package)) ;எங்கள் சொந்த தொகுப்பு தொகுதியை இறக்குமதி செய்யவும்

source: (define* (package->manifest-entry* package system #:key target) "Return a manifest entry for PACKAGE on SYSTEM, optionally cross-compiled to TARGET." (manifest-entry (inherit (package->manifest-entry package)) (name (string-append (package-name package) "." system (if target (string-append "." target) ""))) (item (with-parameters ((%current-system system) (%current-target-system target)) package))))
ta: (வரையறுத்தல்* (தொகுப்பு->மேனிஃபெச்ட்-நுழைவு* தொகுப்பு அமைப்பு #:முக்கிய இலக்கு) "SYSTEM இல் PACKAGEக்கான மேனிஃபெச்ட் உள்ளீட்டை திருப்பி அனுப்பவும், விருப்பமாக குறுக்கு தொகுக்கப்பட்டவை இலக்கு." (வெளிப்பாடு-நுழைவு (பேக்கேச்->மேனிஃபெச்ட்-என்ட்ரி தொகுப்பு) (பெயர் (string-append (தொகுப்பு-பெயர் தொகுப்பு) "." அமைப்பு (இலக்கு என்றால் (string-append "." இலக்கு) ""))) (அளவுருவுடன் கூடிய உருப்படி ((%தற்போதைய அமைப்பு அமைப்பு) (%தற்போதைய இலக்கு-அமைப்பு இலக்கு)) தொகுப்பு))))

source: (define native-builds (manifest (append (map (lambda (system) (package->manifest-entry* guile system))
ta: (சொந்த கட்டிடங்களை வரையறுக்கவும் (வெளிப்படை (வரைபடம் (லாம்ப்டா (அமைப்பு)) இணைக்கவும் (தொகுப்பு->மேனிஃபெச்ட்-என்ட்ரி* கில் சிச்டம்))

source: '("x86_64-linux" "i686-linux" "aarch64-linux" "armhf-linux" "powerpc64le-linux")) (map (lambda (guile) (package->manifest-entry* guile "x86_64-linux")) (cons (package (inherit (package-with-c-toolchain guile `(("clang-toolchain" ,(specification->package "clang-toolchain"))))) (name "guile-clang")) (list guile-without-threads guile-without-networking guile-debug guile-strict-typing))))))
ta: '("x86_64-linux" "i686-linux" "aarch64-linux" "armhf-linux" "powerpc64le-linux")) (வரைபடம் (லாம்ப்டா) (தொகுப்பு->மேனிஃபெச்ட்-என்ட்ரி* guile "x86_64-linux")) (தீமைகள் (தொகுப்பு (பேக்கேச்-வித்-சி-டூல்செயின் வஞ்சகம் `("கிளாங்-டூல்செயின்" ,(குறிப்பிடுதல்-> தொகுப்பு "கிளாங்-டூல்செயின்"))))) (பெயர் "guile-clang")) (இழைகள் இல்லாத வஞ்சகத்தை பட்டியலிடுங்கள் வஞ்சகம்-இல்லாத-நெட்வொர்க்கிங் ஏமாற்று-பிழை ஏமாற்று-கடுமையான தட்டச்சு))))))

source: (define cross-builds (manifest (map (lambda (target) (package->manifest-entry* guile "x86_64-linux" #:target target)) '("i586-pc-gnu" "aarch64-linux-gnu" "riscv64-linux-gnu" "i686-w64-mingw32" "x86_64-linux-gnu"))))
ta: (குறுக்கு-கட்டமைவுகளை வரையறுக்கவும் (வெளிப்படை வரைபடம் (லாம்ப்டா (இலக்கு) (தொகுப்பு->மேனிஃபெச்ட்-என்ட்ரி* guile "x86_64-linux" #:இலக்கு இலக்கு)) '("i586-pc-gnu" "aarch64-linux-gnu" "riscv64-linux-gnu" "i686-w64-mingw32" "x86_64-linux-gnu"))))

source: (concatenate-manifests (list native-builds cross-builds))
ta: (இணைப்பு-வெளிப்பாடுகள் (சொந்த-கட்டமைப்புகள் குறுக்கு-கட்டமைவுகளின் பட்டியல்))

source: We won't go into the details of this manifest; suffice to say that it provides additional flexibility. We now need to tell Cuirass to build this manifest, which is done with a spec slightly different from the previous one:
ta: இந்த மேனிஃபெச்ட்டின் விவரங்களுக்கு நாங்கள் செல்லமாட்டோம்; இது கூடுதல் நெகிழ்வுத்தன்மையை வழங்குகிறது என்று சொன்னால் போதுமானது. இந்த மேனிஃபெச்ட்டை உருவாக்குமாறு நாம் இப்போது குய்ராசிடம் சொல்ல வேண்டும், இது முந்தையதை விட சற்று வித்தியாசமான ச்பெக் மூலம் செய்யப்படுகிறது:

source: ;; Cuirass spec file to build all the packages of the ‘guile’ channel. (list (specification (name "guile") (build '(manifest ".guix/manifest.scm")) (channels (append (list (channel (name 'guile) (url "https://git.savannah.gnu.org/git/guile.git") (branch "main"))) %default-channels))))
ta: ;; 'guile' சேனலின் அனைத்து தொகுப்புகளையும் உருவாக்க Cuiras ச்பெக் கோப்பு. (பட்டியல் (குறிப்பு (பெயர் "குயில்") (உருவாக்கம் '(வெளிப்படையான ".guix/manifest.scm")) (சேனல்கள் (சேனல்) (பட்டியல் (பெயர் 'குயில்) (url "https://git.savannah.gnu.org/git/guile.git") (கிளை "முதன்மை"))) %default-channels))))

source: We changed the @code{(build @dots{})} part of the spec to @code{'(manifest ".guix/manifest.scm")} so that it would pick our manifest, and that's it!
ta: விவரக்குறிப்பின் @குறியீட்டின் {(build @dots{})} பகுதியை @code{'(வெளிப்படையான ".guix/manifest.scm")} என மாற்றியுள்ளோம், அதனால் அது எங்கள் மேனிஃபெச்ட்டைத் தேர்ந்தெடுக்கும், அவ்வளவுதான்!

source: We picked Guile as the running example in this chapter and you can see the result here:
ta: இந்த அத்தியாயத்தில் இயங்கும் உதாரணமாக குயிலைத் தேர்ந்தெடுத்துள்ளோம், அதன் முடிவை நீங்கள் இங்கே பார்க்கலாம்:

source: @uref{https://git.savannah.gnu.org/cgit/guile.git/tree/.guix/modules/guile-package.scm?id=cd57379b3df636198d8cd8e76c1bfbc523762e79,@code{.guix/modules/guile-package.scm}} with the top-level @file{guix.scm} symlink;
ta: @uref{https://git.savannah.gnu.org/cgit/guile.git/tree/.guix/modules/guile-package.scm?id=cd57379b3df636198d8cd8e76c1bfbc523762e79,@mcodep} உயர்மட்ட @file{guix.scm} symlink உடன்;
