Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: @uref{https://git.savannah.gnu.org/cgit/guile.git/tree/.guix/manifest.scm?id=cd57379b3df636198d8cd8e76c1bfbc523762e79,@code{.guix/manifest.scm}}.
ta: @Uref{https://git.savannah.gnu.gnu.gn.git/guile.git/tree/.guix/manifest.scm?id57379b3f636198d8cd8cd8cd8cd8e76c1bbfFbc1bbs523762Eif.

source: These days, repositories are commonly peppered with dot files for various tools: @code{.envrc}, @code{.gitlab-ci.yml}, @code{.github/workflows}, @code{Dockerfile}, @code{.buildpacks}, @code{Aptfile}, @code{requirements.txt}, and whatnot. It may sound like we're proposing a bunch of @emph{additional} files, but in fact those files are expressive enough to @emph{supersede} most or all of those listed above.
ta: இந்த நாட்களில், களஞ்சியங்கள் பொதுவாக பல்வேறு கருவிகளுக்கான டாட் கோப்புகளால் நிரப்பப்படுகின்றன: @code{.envrc}, @code{.gitlab-ci.yml}, @code{.github/workflows}, @code{Dockerfile}, @code{.buildpacks}, @code{requirements.txt}, @code{Aptfile} மற்றும் என்ன. @emph{additional} கோப்புகளின் தொகுப்பை நாங்கள் முன்மொழிவது போல் தோன்றலாம், ஆனால் உண்மையில் அந்தக் கோப்புகள் மேலே பட்டியலிடப்பட்டுள்ளவற்றில் பெரும்பாலானவை அல்லது அனைத்தையும் @emph{supersede} வெளிப்படுத்தும் அளவுக்கு உள்ளன.

source: With a couple of files, we get support for:
ta: இரண்டு கோப்புகளுடன், நாங்கள் இதற்கான ஆதரவைப் பெறுகிறோம்:

source: development environments (@command{guix shell});
ta: மேம்பாட்டு சூழல்கள் (@command{guix shell});

source: pristine test builds, including for package variants and for cross-compilation (@command{guix build});
ta: தொகுப்பு மாறுபாடுகள் மற்றும் குறுக்கு-தொகுப்பு (@command{guix build}) உட்பட, அசல் சோதனை உருவாக்கங்கள்;

source: continuous integration (with Cuirass or with some other tool);
ta: தொடர்ச்சியான ஒருங்கிணைப்பு (குயிராச் அல்லது வேறு சில கருவிகளுடன்);

source: continuous delivery to users (@emph{via} the channel and with pre-built binaries);
ta: பயனர்களுக்கு தொடர்ச்சியான டெலிவரி (@emph{via} சேனல் மற்றும் முன் கட்டப்பட்ட பைனரிகளுடன்);

source: generation of derivative build artifacts such as Docker images or Deb/RPM packages (@command{guix pack}).
ta: கப்பல்துறை படங்கள் அல்லது Deb/RPM தொகுப்புகள் (@command{guix pack}) போன்ற வழித்தோன்றல் உருவாக்க கலைப்பொருட்களின் உருவாக்கம்.

source: This a nice (in our view!) unified tool set for reproducible software deployment, and an illustration of how you as a developer can benefit from it!
ta: இது ஒரு நல்ல (எங்கள் பார்வையில்!) மறுஉருவாக்கம் செய்யக்கூடிய மென்பொருள் வரிசைப்படுத்தலுக்கான ஒருங்கிணைக்கப்பட்ட கருவி மற்றும் டெவலப்பராக நீங்கள் எவ்வாறு பயனடையலாம் என்பதற்கான எடுத்துக்காட்டு!

source: Guix provides multiple tools to manage environment. This chapter demonstrate such utilities.
ta: Guix சுற்றுச்சூழலை நிர்வகிக்க பல கருவிகளை வழங்குகிறது. இந்த அத்தியாயம் அத்தகைய பயன்பாடுகளை நிரூபிக்கிறது.

source: Guix provides a @samp{direnv} package, which could extend shell after directory change. This tool could be used to prepare a pure Guix environment.
ta: Guix ஒரு @samp{direnv} தொகுப்பை வழங்குகிறது, இது அடைவு மாற்றத்திற்குப் பிறகு செல்லை நீட்டிக்க முடியும். இந்த கருவி தூய Guix சூழலை ஆயத்தம் செய்ய பயன்படுத்தப்படலாம்.

source: The following example provides a shell function for @file{~/.direnvrc} file, which could be used from Guix Git repository in @file{~/src/guix/.envrc} file to setup a build environment similar to described in @pxref{Building from Git,,, guix, GNU Guix Reference Manual}.
ta: பின்வரும் எடுத்துக்காட்டு @file{~/.direnvrc} கோப்பிற்கான செல் செயல்பாட்டை வழங்குகிறது, இது @file{~/src/guix/.envrc} கோப்பில் உள்ள Guix Git களஞ்சியத்தில் இருந்து @pxref{Git,,, guix, GNU Guix குறிப்பு கையேட்டில் விவரிக்கப்பட்டுள்ளதைப் போன்ற உருவாக்க சூழலை அமைப்பதற்குப் பயன்படுத்தப்படலாம்.

source: Create a @file{~/.direnvrc} with a Bash code:
ta: பாச் குறியீட்டைக் கொண்டு @file{~/.direnvrc} ஐ உருவாக்கவும்:

source: # Thanks <https://github.com/direnv/direnv/issues/73#issuecomment-152284914> export_function() @{ local name=$1 local alias_dir=$PWD/.direnv/aliases mkdir -p "$alias_dir" PATH_add "$alias_dir" local target="$alias_dir/$name" if declare -f "$name" >/dev/null; then echo "#!$SHELL" > "$target" declare -f "$name" >> "$target" 2>/dev/null # Notice that we add shell variables to the function trigger. echo "$name \$*" >> "$target" chmod +x "$target" fi @}
ta: # நன்றி <https://github.com/direnv/direnv/issues/73#issuecomment-152284914> ஏற்றுமதி_செயல்பாடு() @{ உள்ளக பெயர்=$1 உள்ளக மாற்று_dir=$PWD/.direnv/aliases mkdir -p "$alias_dir" PATH_சேர் "$alias_dir" உள்ளக இலக்கு="$alias_dir/$name" அறிவித்தால் -f "$name" >/dev/null; பிறகு எதிரொலி "#!$SHELL" > "$target" declare -f "$name" >> "$target" 2>/dev/null # செயல்பாடு தூண்டுதலில் செல் மாறிகளைச் சேர்ப்பதைக் கவனியுங்கள். எதிரொலி "$பெயர் \$*" >> "$இலக்கு" chmod +x "$target" fi @}

source: use_guix() @{ # Set GitHub token. export GUIX_GITHUB_TOKEN="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"
ta: use_guix() @{ # GitHub கிள்ளாக்கை அமைக்கவும். ஏற்றுமதி செய்யவும்

source: # Unset 'GUIX_PACKAGE_PATH'. export GUIX_PACKAGE_PATH=""
ta: # 'GUIX_PACKAGE_PATH' அமைக்கப்படவில்லை. ஏற்றுமதி GUIX_PACKAGE_PATH=""

source: # Recreate a garbage collector root. gcroots="$HOME/.config/guix/gcroots" mkdir -p "$gcroots" gcroot="$gcroots/guix" if [ -L "$gcroot" ] then rm -v "$gcroot" fi
ta: # குப்பை கல்லூரி வேரை மீண்டும் உருவாக்கவும். GCROOTS="$Home/.Config/Guix/Gcroots" mkdir -p "$gcrots" GCroot="$gcrots/Guix" [ -l "$gcrot" என்றால் பிறகு RM -V "$gcroot" மற்றும்

source: # Miscellaneous packages. PACKAGES_MAINTENANCE=( direnv git git:send-email git-cal gnupg guile-colorized guile-readline less ncurses openssh xdot )
ta: # இதர தொகுப்புகள். PACKAGES_MAINTENANCE=( direnv git git:அனுப்பு-மின்னஞ்சல் git-cal gnupg வஞ்சக நிறமுடைய வஞ்சனை-படிக்கலை குறைவாக சபிக்கிறது openssh xdot )

source: # Environment packages. PACKAGES=(help2man guile-sqlite3 guile-gcrypt)
ta: # சுற்றுச்சூழல் தொகுப்புகள். தொகுப்புகள்=(help2man guile-sqlite3 guile-gcrypt)

source: # Thanks <https://lists.gnu.org/archive/html/guix-devel/2016-09/msg00859.html> eval "$(guix shell --search-paths --root="$gcroot" --pure \ --development guix $@{PACKAGES[@@]@} $@{PACKAGES_MAINTENANCE[@@]@} "$@@")"
ta: # நன்றி <https://lists.gnu.org/archive/html/guix-devel/2016-09/msg00859.html> eval "$(guix ஓடு --search-paths --root="$gcroot" --pure \ --development guix $@{PACKAGES[@@]@} $@{PACKAGES_MAINTENANCE[@@]@} "$@@")"

source: # Predefine configure flags. configure() @{ ./configure @} export_function configure
ta: # உள்ளமைவு கொடிகளை முன் வரையறுக்கவும். கட்டமைக்க() @{ ./கட்டமைக்கவும் @} ஏற்றுமதி_செயல்பாடு உள்ளமைவு

source: # Run make and optionally build something. build() @{ make -j 2 if [ $# -gt 0 ] then ./pre-inst-env guix build "$@@" fi @} export_function build
ta: # தயாரிப்பை இயக்கவும் மற்றும் விருப்பமாக ஏதாவது ஒன்றை உருவாக்கவும். கட்ட () @{ செய்ய -j 2 என்றால் [ $# -gt 0 ] பிறகு ./pre-inst-env guix பில்ட் "$@@" fi @} ஏற்றுமதி_செயல்பாடு உருவாக்கம்

source: # Predefine push Git command. push() @{ git push --set-upstream origin @} export_function push
ta: # புச் சிட் கட்டளையை முன் வரையறுக்கவும். மிகுதி() @{ git push --set-upstream origin @} ஏற்றுமதி_செயல்பாடு மிகுதி

source: clear # Clean up the screen. git-cal --author='Your Name' # Show contributions calendar.
ta: தெளிவு # திரையை தூய்மை செய்யவும். git-cal --author='உங்கள் பெயர்' # பங்களிப்புகள் காலெண்டரைக் காட்டு.

source: # Show commands help. echo " build build a package or just a project if no argument provided configure run ./configure with predefined parameters push push to upstream Git repository " @}
ta: # கட்டளைகள் உதவியைக் காட்டு. echo " build எந்த வாதமும் வழங்கப்படாவிட்டால், ஒரு தொகுப்பை உருவாக்கு அல்லது ஒரு திட்டத்தை உருவாக்கு configure இயக்கு ./configure முன் வரையறுக்கப்பட்ட அளவுருக்களுடன் கட்டமை push மேலோடை Git களஞ்சியத்திற்கு தள்ளு " @}

source: Every project containing @file{.envrc} with a string @code{use guix} will have predefined environment variables and procedures.
ta: @code{use guix} என்ற சரத்துடன் @file{.envrc} உள்ள ஒவ்வொரு திட்டமும் முன் வரையறுக்கப்பட்ட சூழல் மாறிகள் மற்றும் நடைமுறைகளைக் கொண்டிருக்கும்.

source: Run @command{direnv allow} to setup the environment for the first time.
ta: முதல் முறையாக சூழலை அமைக்க @command{direnv allow} ஐ இயக்கவும்.

source: reproducible research
ta: மீண்டும் உருவாக்கக்கூடிய ஆராய்ச்சி

source: Because it supports reproducible deployment, Guix is a solid foundation for @dfn{reproducible research workflows}. This section is targeted at scientists; it shows how to add Guix to one's reproducible research toolbox@footnote{This chapter is adapted from a @uref{https://hpc.guix.info/blog/2023/06/a-guide-to-reproducible-research-papers/, blog post published on the Guix-HPC web site in 2023.}.}.
ta: இது மீண்டும் உருவாக்கக்கூடிய வரிசைப்படுத்தலை ஆதரிப்பதால், Guix @dfn{reproducible research workflows} க்கான உறுதியான அடித்தளமாகும். இந்த பிரிவு விஞ்ஞானிகளை இலக்காகக் கொண்டது; ஒருவரின் மறுஉருவாக்கம் செய்யக்கூடிய ஆராய்ச்சிக் கருவியில் Guix ஐ எவ்வாறு சேர்ப்பது என்பதை இது காட்டுகிறது@footnote{இந்த அத்தியாயம் Guix-HPC2 இணையதளத்தில் வெளியிடப்பட்ட @uref{https://hpc.guix.info/blog/2023/06/a-guide-to-reproducible-reproducible-papers/ என்ற வலைப்பதிவு இடுகையிலிருந்து தழுவி எடுக்கப்பட்டது.}20.

source: With Guix as the basis of your computational workflow, you can get what's in essence @emph{executable provenance meta-data}: it's like the list of package name/version pairs some provide as an appendix to their publication, except more precise and immediately deployable.
ta: உங்கள் கணக்கீட்டு பணிப்பாய்வு அடிப்படையில் Guix மூலம், நீங்கள் சாராம்சத்தில் உள்ளவற்றைப் பெறலாம் @emph{எக்சிகியூடபிள் புரோவென்ச் மெட்டா-டேட்டா}: இது மிகவும் துல்லியமான மற்றும் உடனடியாக வரிசைப்படுத்தக்கூடியவை தவிர, சிலர் தங்கள் வெளியீட்டிற்கு பிற்சேர்க்கையாக வழங்கும் தொகுப்பு பெயர்/பதிப்பு சோடிகளின் பட்டியல் போன்றது.

source: This section is a guide in just four steps on how to make your computational experiments reproducible using Guix, and how to provide that information in your research paper.
ta: Guix ஐப் பயன்படுத்தி உங்கள் கணக்கீட்டு சோதனைகளை எவ்வாறு மீண்டும் உருவாக்குவது மற்றும் உங்கள் ஆய்வுக் கட்டுரையில் அந்தத் தகவலை எவ்வாறு வழங்குவது என்பதற்கான நான்கு படிகளில் இந்தப் பகுதி வழிகாட்டியாக உள்ளது.

source: Step 1: Setting Up the Environment
ta: படி 1: சூழலை அமைத்தல்

source: The first step is to identify precisely what packages you need in your software environment to run your computational experiment.
ta: உங்கள் கணக்கீட்டு பரிசோதனையை இயக்க உங்கள் மென்பொருள் சூழலில் உங்களுக்கு என்ன தொகுப்புகள் தேவை என்பதைத் துல்லியமாகக் கண்டறிவதே முதல் படி.

source: Assuming you have a Python script that uses NumPy, you can start by creating an environment that contains these two packages and to run your code in that environment (@pxref{Invoking guix shell,,, guix, GNU Guix Reference Manual}):
ta: NumPy ஐப் பயன்படுத்தும் பைதான் ச்கிரிப்ட் உங்களிடம் இருப்பதாகக் கருதினால், இந்த இரண்டு தொகுப்புகளைக் கொண்ட சூழலை உருவாக்கி, அந்த சூழலில் உங்கள் குறியீட்டை இயக்குவதன் மூலம் தொடங்கலாம் (@pxref{Invoking guix shell,,, guix, GNU Guix குறிப்பு Manual}):

source: guix shell -C python python-numpy -- python3 ./myscript.py
ta: guix ஓடு -C பைதான் பைதான்-numpy -- python3 ./myscript.py

source: The @code{-C} flag here (or @code{--container}) instructs @command{guix shell} to create that environment in an isolated container with nothing but the two packages you asked for. That way, if @command{./myscript.py} needs more than these two packages, it'll fail to run and you'll immediately notice. On some systems @code{--container} is not supported; in that case, you can resort to @code{--pure} instead.
ta: இங்குள்ள @code{-C} கொடி (அல்லது @code{--container}) நீங்கள் கேட்ட இரண்டு தொகுப்புகளைத் தவிர வேறு எதுவும் இல்லாமல் தனிமைப்படுத்தப்பட்ட கொள்கலனில் அந்த சூழலை உருவாக்க @command{guix shell} ஐ அறிவுறுத்துகிறது. அந்த வகையில், @command{./myscript.py}க்கு இந்த இரண்டு பேக்கேச்களை விட அதிகமாகத் தேவைப்பட்டால், அது இயங்கத் தவறிவிடும், அதை நீங்கள் உடனடியாக கவனிப்பீர்கள். சில கணினிகளில் @code{--container} ஆதரிக்கப்படாது; அப்படியானால், அதற்கு பதிலாக @code{--pure} ஐ நாடலாம்.

source: Perhaps you'll find that you also need Pandas and add it to the environment:
ta: ஒருவேளை நீங்கள் பாண்டாக்களும் தேவைப்படுவதைக் கண்டறிந்து அதைச் சூழலில் சேர்க்கலாம்:

source: guix shell -C python python-numpy python-pandas -- \ python3 ./myscript.py
ta: குயிக்ச் செல் -சி பைதான் பைதான்-நம்பி பைதான்-பாண்டாச் -- \ python3 ./myscript.py

source: If you fail to guess the name of the package (this one was easy!), try @code{guix search}.
ta: தொகுப்பின் பெயரை நீங்கள் யூகிக்கத் தவறினால் (இது எளிதானது!), @code{guix search} ஐ முயற்சிக்கவும்.

source: Environments for Python, R, and similar high-level languages are relatively easy to set up. For C/C++ code, you may need more packages:
ta: Python, R மற்றும் ஒத்த உயர்நிலை மொழிகளுக்கான சூழல்கள் அமைப்பது ஒப்பீட்டளவில் எளிதானது. சி/சி++ குறியீட்டிற்கு, உங்களுக்கு கூடுதல் தொகுப்புகள் தேவைப்படலாம்:

source: guix shell -C gcc-toolchain cmake coreutils grep sed make -- @dots{}
ta: guix ஓடு -C gcc-toolchain cmake coreutils grep sed make -- @dots{}

source: Or perhaps you'll find that you could just as well provide a package definition for your code---@pxref{Defining Packages,,, guix, GNU Guix Reference Manual}, to learn more on how to do that.
ta: அல்லது அதை எப்படி செய்வது என்பது பற்றி மேலும் அறிய, உங்கள் குறியீடு---@pxref{தொகுப்புகளை வரையறுத்தல்,,, guix, GNU Guix குறிப்பு கையேடு} ஆகியவற்றிற்கான தொகுப்பு வரையறையை வழங்குவதை நீங்கள் காணலாம்.

source: Eventually, you'll have a list of packages that satisfies your needs.
ta: இறுதியில், உங்கள் தேவைகளைப் நிறைவு செய்யும் தொகுப்புகளின் பட்டியல் உங்களிடம் இருக்கும்.

source: What if a package is missing?
ta: ஒரு தொகுப்பு காணவில்லை என்றால் என்ன செய்வது?

source: Guix and the main scientific channels provide about @uref{https://hpc.guix.info/browse, tens of thousands of packages}. Yet, there's always the possibility that the one package you need is missing.
ta: Guix மற்றும் முக்கிய அறிவியல் சேனல்கள் @uref{https://hpc.guix.info/browse, பல்லாயிரக்கணக்கான தொகுப்புகள்} பற்றி வழங்குகின்றன. இருப்பினும், உங்களுக்குத் தேவையான ஒரு தொகுப்பு காணாமல் போகும் வாய்ப்பு எப்போதும் உள்ளது.

source: In that case, you will need to provide a definition for it (@pxref{Defining Packages,,, guix, GNU Guix Reference Manual}) in a dedicated channel of yours (@pxref{Creating a Channel,,, guix, GNU Guix Reference Manual}). For software in Python, R, and other high-level languages, most of the work can usually be automated by using @command{guix import} (@pxref{Invoking guix import,,, guix, GNU Guix Reference Manual}).
ta: அப்படியானால், உங்களுக்கான ஒரு பிரத்யேக சேனலில் (@pxref{டிஃபைனிங் பேக்கேச்கள்,,, guix, GNU Guix குறிப்பு Manual}) அதற்கான வரையறையை நீங்கள் வழங்க வேண்டும் (@pxref{சேனலை உருவாக்குதல்,,, guix, GNU Guix குறிப்பு Manual}). Python, R மற்றும் பிற உயர்நிலை மொழிகளில் உள்ள மென்பொருளுக்கு, @command{guix import} (@pxref{Invoking guix import,,, guix, GNU Guix குறிப்பு Manual}) மூலம் பெரும்பாலான வேலைகளை பொதுவாக தானியக்கமாக்க முடியும்.

source: Join @uref{https://guix.gnu.org/contact/,the friendly Guix community} to get help!
ta: உதவியைப் பெற @uref{https://guix.gnu.org/contact/, நட்பு Guix சமூகத்தில்} சேரவும்!

source: Step 2: Recording the Environment
ta: படி 2: சூழலைப் பதிவு செய்தல்

source: Now that you have that @code{guix shell} command line with a list of packages, the best course of action is to save it in a @emph{manifest} file---essentially a software bill of materials---that Guix can then ingest (@pxref{Writing Manifests,,, guix, GNU Guix Reference Manual}). The easiest way to get started is by ``translating'' your command line into a manifest:
ta: இப்போது உங்களிடம் @code{guix shell} கட்டளை வரி தொகுப்புகளின் பட்டியலுடன் உள்ளது, அதை ஒரு @emph{manifest} கோப்பில் சேமிப்பதே சிறந்த செயல் ஆகும்---அடிப்படையில் ஒரு மென்பொருள் பில் பொருள்கள்---அதை Guix பின்னர் உட்கொள்ளலாம் (@pxref{Writing Manifests,,, guix, GNU Guix குறிப்பு Manual}). தொடங்குவதற்கான எளிதான வழி, உங்கள் கட்டளை வரியை மேனிஃபெச்டாக ``மொழிபெயர்ப்பதாகும்``:

source: guix shell python python-numpy python-pandas \ --export-manifest > manifest.scm
ta: குயிக்ச் செல் பைதான் பைதான்-நம்பி பைதான்-பாண்டாச் \ --export-manifest > manifest.scm

source: Put that manifest under version control! From there anyone can redeploy the software environment described by the manifest and run code in that environment:
ta: அந்த மேனிஃபெச்ட்டை பதிப்புக் கட்டுப்பாட்டின் கீழ் வைக்கவும்! அங்கிருந்து எவரும் மேனிஃபெச்ட்டால் விவரிக்கப்பட்ட மென்பொருள் சூழலை மீண்டும் வரிசைப்படுத்தலாம் மற்றும் அந்த சூழலில் குறியீட்டை இயக்கலாம்:

source: guix shell -C -m manifest.scm -- python3 ./myscript.py
ta: guix ஓடு -C -m manifest.scm -- python3 ./myscript.py

source: Here's what @file{manifest.scm} reads:
ta: @file{manifest.scm} என்ன படிக்கிறது:

source: ;; What follows is a "manifest" equivalent to the command line you gave. ;; You can store it in a file that you may then pass to any 'guix' command ;; that accepts a '--manifest' (or '-m') option.
ta: ;; பின்வருபவை நீங்கள் கொடுத்த கட்டளை வரிக்கு சமமான "மேனிஃபெச்ட்" ஆகும். ;; நீங்கள் அதை ஒரு கோப்பில் சேமிக்கலாம், பின்னர் நீங்கள் எந்த 'guix' கட்டளைக்கும் அனுப்பலாம் ;; அது '--மேனிஃபெச்ட்' (அல்லது '-m') விருப்பத்தை ஏற்றுக்கொள்கிறது.

source: (specifications->manifest (list "python" "python-numpy" "python-pandas"))
ta: (விவரக்குறிப்புகள்->வெளிப்படை (பட்டியல் "பைதான்" "பைதான்-நம்பி" "பைதான்-பாண்டாச்"))

source: It's a code snippet that lists packages. Notice that there are no version numbers! Indeed, these version numbers are specified in package definitions, located in Guix channels. To allow others to reproduce the exact same environment as the one you're running, you need to @emph{pin Guix itself} , by capturing the current Guix channel commits with @command{guix describe} (@pxref{Replicating Guix,,, guix, GNU Guix Reference Manual}):
ta: இது தொகுப்புகளை பட்டியலிடும் குறியீடு துணுக்கு. பதிப்பு எண்கள் இல்லை என்பதைக் கவனியுங்கள்! உண்மையில், இந்த பதிப்பு எண்கள் Guix சேனல்களில் அமைந்துள்ள தொகுப்பு வரையறைகளில் குறிப்பிடப்பட்டுள்ளன. நீங்கள் இயங்கும் சூழலைப் போலவே மற்றவர்களையும் மீண்டும் உருவாக்க அனுமதிக்க, நீங்கள் @emph{pin Guix itself} , தற்போதைய Guix சேனலை @command{guix describe} உடன் கைப்பற்றுவதன் மூலம் (@pxref{Replicating Guix,,, guix, GNU Guix குறிப்பு Manual}):

source: guix describe -f channels > channels.scm
ta: guix விவரிக்க -f சேனல்கள் > channels.scm

source: lock files, for reproducibility
ta: மறுஉருவாக்கம் செய்ய கோப்புகளை பூட்டு

source: This @code{channels.scm} file is similar in spirit to ``lock files'' that some deployment tools employ to pin package revisions. You should also keep it under version control in your code, and possibly update it once in a while when you feel like running your code against newer versions of its dependencies. With this file, anyone, @emph{at any time and on any machine}, can now reproduce the exact same environment by running:
ta: இந்த @code{channels.scm} கோப்பு, தொகுப்பு திருத்தங்களைப் பின் செய்ய சில வரிசைப்படுத்தல் கருவிகளைப் பயன்படுத்தும் ``கோப்புகளைப் பூட்டு'' போன்றது. நீங்கள் அதை உங்கள் குறியீட்டில் பதிப்புக் கட்டுப்பாட்டின் கீழ் வைத்திருக்க வேண்டும், மேலும் உங்கள் குறியீட்டை அதன் சார்புகளின் புதிய பதிப்புகளுக்கு எதிராக இயக்க வேண்டும் என நீங்கள் நினைக்கும் போது அதை ஒருமுறை புதுப்பிக்கவும். இந்தக் கோப்பின் மூலம், @emph{at any time and on any machine}, இப்போது இயக்குவதன் மூலம் அதே சூழலை மீண்டும் உருவாக்க முடியும்:

source: In this example we rely solely on the @code{guix} channel, which provides the Python packages we need. Perhaps some of the packages you need live @uref{https://hpc.guix.info/channels,in other channels}---maybe @code{guix-cran} if you use R, maybe @code{guix-science}. That's fine: @code{guix describe} also captures that.
ta: இந்த எடுத்துக்காட்டில் நாம் @code{guix} சேனலை மட்டுமே நம்பியுள்ளோம், இது நமக்குத் தேவையான பைதான் தொகுப்புகளை வழங்குகிறது. நீங்கள் R ஐப் பயன்படுத்தினால், @uref{https://hpc.guix.info/channels, பிற சேனல்களில் உங்களுக்கு நேரலை @uref{https://hpc.guix.info/channels}---ஒருவேளை @code{guix-cran} தேவைப்படலாம், ஒருவேளை @code{guix-science}. பரவாயில்லை: @code{guix describe} அதையும் பிடிக்கிறது.

source: Of course do include a @file{README} file giving the exact command to run the code. Not everyone uses Guix so it can be helpful to also provide minimal non-Guix setup instructions: which package versions are used, how software is built, etc. As we have seen, such instructions would likely be inaccurate and inconvenient to follow at best. Yet, it can be a useful starting point to someone trying to recreate a @emph{similar} environment using different tools. It should probably be presented as such, with the understanding that the only way to get the @emph{same} environment is to use Guix.
ta: நிச்சயமாக @file{README} கோப்பைச் சேர்த்து, குறியீட்டை இயக்க சரியான கட்டளையைக் கொடுக்கவும். எல்லோரும் Guix ஐப் பயன்படுத்துவதில்லை, எனவே குறைந்தபட்ச Guix அல்லாத அமைவு வழிமுறைகளை வழங்குவதும் உதவியாக இருக்கும்: எந்த தொகுப்பு பதிப்புகள் பயன்படுத்தப்படுகின்றன, மென்பொருள் எவ்வாறு கட்டமைக்கப்பட்டுள்ளது, முதலியன. நாம் பார்த்தபடி, அத்தகைய வழிமுறைகள் துல்லியமற்றதாகவும் சிறந்த முறையில் பின்பற்றுவதற்கு சிரமமாகவும் இருக்கும். இருப்பினும், வெவ்வேறு கருவிகளைப் பயன்படுத்தி @emph{similar} சூழலை மீண்டும் உருவாக்க முயற்சிக்கும் ஒருவருக்கு இது ஒரு பயனுள்ள தொடக்கப் புள்ளியாக இருக்கும். @emph{same} சூழலைப் பெறுவதற்கான ஒரே வழி Guix ஐப் பயன்படுத்துவதே என்ற புரிதலுடன் இது அநேகமாக வழங்கப்பட வேண்டும்.

source: Step 3: Ensuring Long-Term Source Code Archiving
ta: படி 3: நீண்ட கால மூலக் குறியீடு காப்பகத்தை உறுதி செய்தல்

source: We insisted on version control before: for the @file{manifest.scm} and @file{channels.scm} files, but of course also for your own code. Our recommendation is to have these two @file{.scm} files in the same repository as the code they're about.
ta: நாங்கள் முன்பே பதிப்புக் கட்டுப்பாட்டை வலியுறுத்தினோம்: @file{manifest.scm} மற்றும் @file{channels.scm} கோப்புகளுக்கு, ஆனால் நிச்சயமாக உங்கள் சொந்த குறியீட்டிற்கும். இந்த இரண்டு @file{.scm} கோப்புகள் எந்தக் குறியீடாக இருக்கிறதோ அதே களஞ்சியத்தில் இருக்க வேண்டும் என்பதே எங்கள் பரிந்துரை.

source: Since the goal is enabling reproducibility, source code availability is a prime concern. Source code hosting services come and go and we don't want our code to vanish in a whim and render our published research work unverifiable. @uref{https://www.softwareheritage.org/,Software Heritage} (SWH for short) is @emph{the} solution for this: SWH archives public source code and provides unique intrinsic identifiers to refer to it---@uref{https://swhid.org, @dfn{SWHIDs}}. Guix itself is @uref{https://doi.org/10.1145/3641525.3663622,connected to SWH} to (1)@ ensure that the source code of its packages is archived, and (2)@ to fall back to downloading from the SWH archive should code vanish from its original site.
ta: மறுஉருவாக்கத்தை செயல்படுத்துவதே குறிக்கோள் என்பதால், மூலக் குறியீடு கிடைப்பது முக்கிய கவலையாக உள்ளது. சோர்ச் கோட் ஓச்டிங் சேவைகள் வந்து செல்கின்றன, மேலும் எங்கள் குறியீடு மறைந்துவிடுவதையும், வெளியிடப்பட்ட எங்கள் ஆராய்ச்சிப் பணிகளைச் சரிபார்க்க முடியாததாக மாற்றுவதையும் நாங்கள் விரும்பவில்லை. @uref{https://www.softwareheritage.org/,SWHSoftwareheritage} (சுருக்கமாக SWH) இதற்கான @emph{the} தீர்வாகும்: SWH பொது மூலக் குறியீட்டைக் காப்பகப்படுத்துகிறது மற்றும் அதைப் பார்க்க தனித்துவமான உள்ளார்ந்த அடையாளங்காட்டிகளை வழங்குகிறது---@uref{https://swhid.org, @dfn}{SWHIDs. Guix ஆனது @uref{https://doi.org/10.1145/3641525.3663622, SWH} உடன் (1)@ க்கு இணைக்கப்பட்டுள்ளது, அதன் தொகுப்புகளின் மூலக் குறியீடு காப்பகப்படுத்தப்பட்டுள்ளதா என்பதை உறுதிசெய்து, (2)@ அதன் அசல் தளத்திலிருந்து பதிவிறக்கம் செய்ய குறியீடு மறைந்துவிட வேண்டும்.
