Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: In the future, @command{guix download} will hopefully be able to do these steps for you, just like it does for regular downloads.
ta: எதிர்காலத்தில், வழக்கமான பதிவிறக்கங்களைப் போலவே, @command{guix download} உங்களுக்காக இந்தப் படிகளைச் செய்ய முடியும்.

source: Snippets
ta: துணுக்குகள்

source: Snippets are quoted (i.e. non-evaluated) Scheme code that are a means of patching the source. They are a Guix-y alternative to the traditional @file{.patch} files. Because of the quote, the code in only evaluated when passed to the Guix daemon for building. There can be as many snippets as needed.
ta: துணுக்குகள் மேற்கோள் காட்டப்படுகின்றன (அதாவது மதிப்பீடு செய்யப்படாதவை) திட்டக் குறியீடு மூலத்தை ஒட்டுவதற்கான வழிமுறையாகும். அவை பாரம்பரிய @file{.patch} கோப்புகளுக்கு மாற்றாக Guix-y ஆகும். மேற்கோள் காரணமாக, கட்டியெழுப்புவதற்காக Guix deemon க்கு அனுப்பப்படும் போது மட்டுமே குறியீடு மதிப்பிடப்படுகிறது. தேவையான அளவு துணுக்குகள் இருக்கலாம்.

source: Snippets might need additional Guile modules which can be imported from the @code{modules} field.
ta: @code{modules} புலத்திலிருந்து இறக்குமதி செய்யக்கூடிய கூடுதல் Guile தொகுதிகள் துணுக்குகளுக்குத் தேவைப்படலாம்.

source: Inputs
ta: உள்ளீடுகள்

source: There are 3 different input types. In short:
ta: 3 வெவ்வேறு உள்ளீட்டு வகைகள் உள்ளன. சுருக்கமாக:

source: native-inputs
ta: சொந்த-உள்ளீடுகள்

source: Required for building but not runtime -- installing a package through a substitute won't install these inputs.
ta: உருவாக்குவதற்குத் தேவை ஆனால் இயக்க நேரம் அல்ல -- மாற்று மூலம் தொகுப்பை நிறுவுவது இந்த உள்ளீடுகளை நிறுவாது.

source: inputs
ta: உள்ளீடுகள்

source: Installed in the store but not in the profile, as well as being present at build time.
ta: ச்டோரில் நிறுவப்பட்டது, ஆனால் சுயவிவரத்தில் இல்லை, அதே போல் உருவாக்க நேரத்திலும் உள்ளது.

source: propagated-inputs
ta: பரப்பப்பட்ட-உள்ளீடுகள்

source: Installed in the store and in the profile, as well as being present at build time.
ta: கடை மற்றும் சுயவிவரத்தில் நிறுவப்பட்டது, அதே போல் உருவாக்க நேரத்திலும் உள்ளது.

source: @xref{package Reference,,, guix, GNU Guix Reference Manual} for more details.
ta: மேலும் விவரங்களுக்கு @xref{package Reference,,, guix, GNU Guix குறிப்பு Manual}.

source: The distinction between the various inputs is important: if a dependency can be handled as an @emph{input} instead of a @emph{propagated input}, it should be done so, or else it ``pollutes'' the user profile for no good reason.
ta: பல்வேறு உள்ளீடுகளுக்கு இடையே உள்ள வேறுபாடு முக்கியமானது: @emph{propagated input} பதிலாக @emph{input} சார்புநிலையைக் கையாள முடிந்தால், அது அவ்வாறு செய்யப்பட வேண்டும், இல்லையெனில் அது சரியான காரணமின்றி பயனர் சுயவிவரத்தை ``மாசுபடுத்துகிறது''.

source: For instance, a user installing a graphical program that depends on a command line tool might only be interested in the graphical part, so there is no need to force the command line tool into the user profile. The dependency is a concern to the package, not to the user. @emph{Inputs} make it possible to handle dependencies without bugging the user by adding undesired executable files (or libraries) to their profile.
ta: எடுத்துக்காட்டாக, ஒரு கட்டளை வரி கருவியை சார்ந்து ஒரு வரைகலை நிரலை நிறுவும் பயனர் வரைகலை பகுதியில் மட்டுமே ஆர்வமாக இருக்கலாம், எனவே பயனர் சுயவிவரத்தில் கட்டளை வரி கருவியை கட்டாயப்படுத்த வேண்டிய அவசியமில்லை. சார்பு என்பது பேக்கேச் பற்றிய கவலை, பயனருக்கு அல்ல. @emph{Inputs} பயனரின் சுயவிவரத்தில் தேவையற்ற இயங்கக்கூடிய கோப்புகளை (அல்லது நூலகங்கள்) சேர்ப்பதன் மூலம், பயனரைப் பிழையின்றிச் சார்புகளைக் கையாளுவதை சாத்தியமாக்குகிறது.

source: Same goes for @emph{native-inputs}: once the program is installed, build-time dependencies can be safely garbage-collected. It also matters when a substitute is available, in which case only the @emph{inputs} and @emph{propagated inputs} will be fetched: the @emph{native inputs} are not required to install a package from a substitute.
ta: @emph{native-inputs} க்கும் இதுவே செல்கிறது: நிரல் நிறுவப்பட்டதும், பில்ட்-டைம் சார்புகளை பாதுகாப்பாக குப்பை-சேகரிக்க முடியும். மாற்றீடு எப்போது கிடைக்கும் என்பதும் முக்கியமானது, இதில் @emph{inputs} மற்றும் @emph{propagated inputs} மட்டுமே பெறப்படும்: மாற்றீட்டிலிருந்து தொகுப்பை நிறுவ @emph{native inputs} தேவையில்லை.

source: Note
ta: குறிப்பு

source: You may see here and there snippets where package inputs are written quite differently, like so:
ta: தொகுப்பு உள்ளீடுகள் மிகவும் வித்தியாசமாக எழுதப்பட்ட துணுக்குகளை நீங்கள் இங்கும் அங்கும் காணலாம், இது போன்றது:

source: ;; The "old style" for inputs. (inputs `(("libssh2" ,libssh2) ("http-parser" ,http-parser) ("python" ,python-wrapper)))
ta: ;; உள்ளீடுகளுக்கான "பழைய பாணி". (உள்ளீடுகள் `("libssh2" ,libssh2) ("http-பாகுபடுத்தி" ,http-பாகுபடுத்தி) ("பைதான்" ,பைதான்-ரேப்பர்)))

source: This is the ``old style'', where each input in the list is explicitly given a label (a string). It is still supported but we recommend using the style above instead. @xref{package Reference,,, guix, GNU Guix Reference Manual}, for more info.
ta: இது ``பழைய பாணி'', பட்டியலில் உள்ள ஒவ்வொரு உள்ளீடுக்கும் வெளிப்படையாக ஒரு சிட்டை (ஒரு சரம்) வழங்கப்படுகிறது. இது இன்னும் ஆதரிக்கப்படுகிறது, ஆனால் அதற்கு பதிலாக மேலே உள்ள பாணியைப் பயன்படுத்த பரிந்துரைக்கிறோம். @xref{package Reference,,, guix, GNU Guix குறிப்பு Manual}, மேலும் தகவலுக்கு.

source: Outputs
ta: வெளியீடுகள்

source: Just like how a package can have multiple inputs, it can also produce multiple outputs.
ta: ஒரு தொகுப்பு எப்படி பல உள்ளீடுகளைக் கொண்டிருக்க முடியுமோ, அது போல பல வெளியீடுகளையும் உருவாக்க முடியும்.

source: Each output corresponds to a separate directory in the store.
ta: ஒவ்வொரு வெளியீடும் கடையில் ஒரு தனி அடைவுக்கு ஒத்திருக்கிறது.

source: The user can choose which output to install; this is useful to save space or to avoid polluting the user profile with unwanted executables or libraries.
ta: எந்த வெளியீட்டை நிறுவ வேண்டும் என்பதை பயனர் தேர்வு செய்யலாம்; இது இடத்தை சேமிக்க அல்லது தேவையற்ற இயங்கக்கூடியவை அல்லது நூலகங்களால் பயனர் சுயவிவரத்தை மாசுபடுத்துவதைத் தவிர்க்க பயனுள்ளதாக இருக்கும்.

source: Output separation is optional. When the @code{outputs} field is left out, the default and only output (the complete package) is referred to as @code{"out"}.
ta: வெளியீடு பிரித்தல் விருப்பமானது. @code{outputs} புலம் வெளியேறினால், இயல்புநிலை மற்றும் ஒரே வெளியீடு (முழுமையான தொகுப்பு) @code{"out"} என குறிப்பிடப்படும்.

source: Typical separate output names include @code{debug} and @code{doc}.
ta: வழக்கமான தனி வெளியீட்டுப் பெயர்களில் @code{debug} மற்றும் @code{doc} ஆகியவை அடங்கும்.

source: It's advised to separate outputs only when you've shown it's worth it: if the output size is significant (compare with @code{guix size}) or in case the package is modular.
ta: வெளியீட்டின் அளவு குறிப்பிடத்தக்கதாக இருந்தால் (@code{guix size} உடன் ஒப்பிடவும்) அல்லது தொகுப்பு மட்டுப்படுத்தப்பட்டதாக இருந்தால் மட்டுமே வெளியீடுகளை தனித்தனியாகப் பிரிக்க அறிவுறுத்தப்படுகிறது.

source: Build system arguments
ta: கணினி வாதங்களை உருவாக்கவும்

source: The @code{arguments} is a keyword-value list used to configure the build process.
ta: @code{arguments} என்பது உருவாக்க செயல்முறையை உள்ளமைக்கப் பயன்படுத்தப்படும் ஒரு முக்கிய-மதிப்பு பட்டியல்.

source: The simplest argument @code{#:tests?} can be used to disable the test suite when building the package. This is mostly useful when the package does not feature any test suite. It's strongly recommended to keep the test suite on if there is one.
ta: தொகுப்பை உருவாக்கும்போது சோதனைத் தொகுப்பை முடக்க எளிய உரையாடல் @code{#:tests?} பயன்படுத்தப்படலாம். பேக்கேச் எந்த சோதனைத் தொகுப்பையும் கொண்டிருக்காதபோது இது மிகவும் பயனுள்ளதாக இருக்கும். சோதனைத் தொகுப்பில் ஏதேனும் ஒன்று இருந்தால், அதை இயக்கி வைக்க பரிந்துரைக்கப்படுகிறது.

source: Another common argument is @code{:make-flags}, which specifies a list of flags to append when running make, as you would from the command line. For instance, the following flags
ta: மற்றொரு பொதுவான உரையாடல் @code{:make-flags} ஆகும், இது கட்டளை வரியிலிருந்து நீங்கள் செய்வது போல், make ஐ இயக்கும் போது சேர்க்க வேண்டிய கொடிகளின் பட்டியலைக் குறிப்பிடுகிறது. உதாரணமாக, பின்வரும் கொடிகள்

source: translate into
ta: மொழிபெயர்க்க

source: $ make CC=gcc prefix=/gnu/store/...-<out>
ta: $ செய்ய CC=gcc prefix=/gnu/store/...-<out>

source: This sets the C compiler to @code{gcc} and the @code{prefix} variable (the installation directory in Make parlance) to @code{(assoc-ref %outputs "out")}, which is a build-stage global variable pointing to the destination directory in the store (something like @file{/gnu/store/...-my-libgit2-20180408}).
ta: இது C கம்பைலரை @code{gcc} ஆகவும், @code{prefix} மாறியை (Make parlance இன் நிறுவல் கோப்பகம்) @code{(assoc-ref %outputs "out")} ஆகவும் அமைக்கிறது, இது ச்டோரில் உள்ள இலக்கு கோப்பகத்தை சுட்டிக்காட்டும் ஒரு கட்ட-நிலை உலகளாவிய மாறியாகும் (எது போன்றது @file{/gnu/store/...-my-libgit2-20180408}).

source: Similarly, it's possible to set the configure flags:
ta: இதேபோல், கட்டமைக்கும் கொடிகளை அமைக்க முடியும்:

source: The @code{%build-inputs} variable is also generated in scope. It's an association table that maps the input names to their store directories.
ta: @code{%build-inputs} மாறியும் ச்கோப்பில் உருவாக்கப்பட்டுள்ளது. இது உள்ளீட்டு பெயர்களை அவற்றின் கடை டைரக்டரிகளுக்கு வரைபடமாக்கும் ஒரு சங்க அட்டவணை.

source: The @code{phases} keyword lists the sequential steps of the build system. Typically phases include @code{unpack}, @code{configure}, @code{build}, @code{install} and @code{check}. To know more about those phases, you need to work out the appropriate build system definition in @samp{$GUIX_CHECKOUT/guix/build/gnu-build-system.scm}:
ta: @code{phases} திறவுச்சொல், உருவாக்க முறைமையின் தொடர் படிகளை பட்டியலிடுகிறது. பொதுவாக கட்டங்களில் @code{unpack}, @code{configure}, @code{build}, @code{install} மற்றும் @code{check} ஆகியவை அடங்கும். அந்த கட்டங்களைப் பற்றி மேலும் அறிய, @samp{$GUIX_CHECKOUT/guix/build/gnu-build-system.scm} இல் பொருத்தமான கட்டமைப்பின் வரையறையை நீங்கள் உருவாக்க வேண்டும்:

source: (define %standard-phases ;; Standard build phases, as a list of symbol/procedure pairs. (let-syntax ((phases (syntax-rules () ((_ p ...) `((p . ,p) ...))))) (phases set-SOURCE-DATE-EPOCH set-paths install-locale unpack bootstrap patch-usr-bin-file patch-source-shebangs configure patch-generated-file-shebangs build check install patch-shebangs strip validate-runpath validate-documentation-location delete-info-dir-file patch-dot-desktop-files make-dynamic-linker-cache install-license-files reset-gzip-timestamps compress-documentation)))
ta: (define %standard-phases ;; குறியீடு/செயல்முறை சோடிகளின் பட்டியலாக நிலையான கட்ட கட்டங்கள். (லெட்-சின்டாக்ச் ((கட்டங்கள்) தொடரியல் விதிகள் () ((_ p ...) `((p. ,p) ...))))) (கட்டங்கள் தொகுப்பு-சோர்ச்-தேதி-எபோச் செட்-பாத்ச் இன்ச்டால்-லோகேல் அன்பேக் தொடக்கவார் patch-usr-bin-file patch-source-shebangs பேட்ச்-செனரேட்டட்-ஃபைல்-செபாங்சை உள்ளமைக்கிறது கட்ட காசோலை நிறுவல் patch-shebangs துண்டு சரிபார்த்தல்-ரன்பாத் சரிபார்க்க-ஆவணம்-இடம் delete-info-dir-file patch-dot-desktop-files உருவாக்க-டைனமிக்-லிங்க்கர்-கேச் நிறுவல் உரிமம் கோப்புகள் reset-gzip-timestamps சுருக்க ஆவணம்)))

source: Or from the REPL:
ta: அல்லது REPL இலிருந்து:

source: (add-to-load-path "/path/to/guix/checkout") ,use (guix build gnu-build-system) (map car %standard-phases) @result{} (set-SOURCE-DATE-EPOCH set-paths install-locale unpack bootstrap patch-usr-bin-file patch-source-shebangs configure patch-generated-file-shebangs build check install patch-shebangs strip validate-runpath validate-documentation-location delete-info-dir-file patch-dot-desktop-files make-dynamic-linker-cache install-license-files reset-gzip-timestamps compress-documentation)
ta: (ஆட்-டு-லோட்-பாத் "/பாத்/டு/குயிக்ச்/செக்அவுட்") ,பயன்படுத்துங்கள் (guix உருவாக்கு gnu-build-system) (வரைபடம் கார் %தரநிலை-கட்டங்கள்) @result{} (set-SOURCE-DATE-EPOCH set-paths install-locale unpack தொடக்கவார் patch-usr-bin-file patch-source-shebangs configure patch-generated-file-shebangs உருவாக்கு சரிபார் install patch-shebangs striple validate-runpath validate-documentation-locedation-location-location-location-location patch-dot-desktop-files make-dynamic-linker-cache install-license-files reset-gzip-timestamps compress-documentation)

source: If you want to know more about what happens during those phases, consult the associated procedures.
ta: அந்தக் கட்டங்களில் என்ன நடக்கிறது என்பதைப் பற்றி மேலும் அறிய விரும்பினால், தொடர்புடைய நடைமுறைகளைப் பார்க்கவும்.

source: For instance, as of this writing the definition of @code{unpack} for the GNU build system is:
ta: உதாரணமாக, இதை எழுதும் போது குனு உருவாக்க அமைப்புக்கான @code{unpack} இன் வரையறை:

source: (define* (unpack #:key source #:allow-other-keys) "Unpack SOURCE in the working directory, and change directory within the source. When SOURCE is a directory, copy it in a sub-directory of the current working directory." (if (file-is-directory? source) (begin (mkdir "source") (chdir "source")
ta: (வரையறுக்கவும்* (அன்பேக் #:விசை சான்று #:மற்ற-விசைகளை அனுமதி) "செயல்படும் கோப்பகத்தில் மூலத்தைத் திறக்கவும், மேலும் கோப்பகத்தை மாற்றவும் சான்று. மூலம் ஒரு கோப்பகமாக இருக்கும்போது, அதை தற்போதைய துணை கோப்பகத்தில் நகலெடுக்கவும் வேலை செய்யும் அடைவு." (என்றால் (கோப்பு-அடைவு? ஆதாரம்) (தொடங்கு (mkdir "ஆதாரம்") (chdir "ஆதாரம்")

source: ;; Preserve timestamps (set to the Epoch) on the copied tree so that ;; things work deterministically. (copy-recursively source "." #:keep-mtime? #t) ;; Make the source checkout files writable, for convenience. (for-each (lambda (f) (false-if-exception (make-file-writable f))) (find-files "."))) (begin (cond ((string-suffix? ".zip" source) (invoke "unzip" source)) ((tarball? source) (invoke "tar" "xvf" source)) (else (let ((name (strip-store-file-name source)) (command (compressor source))) (copy-file source name) (when command (invoke command "--decompress" name))))) ;; Attempt to change into child directory. (and=> (first-subdirectory ".") chdir))))
ta: ;; நகலெடுக்கப்பட்ட மரத்தில் நேர முத்திரைகளை (சகாப்தத்திற்கு அமைக்கவும்) பாதுகாக்கவும் ;; விசயங்கள் உறுதியாக வேலை செய்கின்றன. (நகல்-சுழற்சியில் சான்று "." #:நேரத்தை வைத்திருக்கவா? #t) ;; வசதிக்காக, மூல செக்அவுட் கோப்புகளை எழுதக்கூடியதாக மாற்றவும். (ஒவ்வொருவருக்கும் (லாம்ப்டா (எஃப்) (தவறு என்றால்-விதிவிலக்கு (கோப்பு-எழுதக்கூடிய f))) (Find-files "."))) (தொடங்கு (காண்ட் ((சரம் பின்னொட்டு? ".zip" மூலம்) ("அன்சிப்" மூலத்தை அழைக்கவும்)) ((தார்பால்? ஆதாரம்) ("தார்" "xvf" மூலத்தை அழைக்கவும்)) (வேறு ((பெயர் (strip-store-file-name source)) (கட்டளை (கம்ப்ரசர் மூலம்))) (நகல்-கோப்பு மூல பெயர்) (கட்டளையின் போது ("--டிகம்ப்ரச்" பெயரை அழைக்கவும்))))) ;; குழந்தை கோப்பகமாக மாற்ற முயற்சி. (மற்றும்=> (முதல்-துணை அடைவு ".") chdir))))

source: Note the @code{chdir} call: it changes the working directory to where the source was unpacked. Thus every phase following the @code{unpack} will use the source as a working directory, which is why we can directly work on the source files. That is to say, unless a later phase changes the working directory to something else.
ta: @code{chdir} அழைப்பைக் கவனியுங்கள்: இது செயல்படும் கோப்பகத்தை சான்று திறக்கப்பட்ட இடத்திற்கு மாற்றுகிறது. இவ்வாறு @code{unpack} ஐத் தொடர்ந்து ஒவ்வொரு கட்டமும் மூலத்தை வேலை செய்யும் கோப்பகமாகப் பயன்படுத்தும், அதனால்தான் நாம் நேரடியாக மூலக் கோப்புகளில் வேலை செய்ய முடியும். அதாவது, ஒரு பிந்தைய கட்டம் வேலை செய்யும் கோப்பகத்தை வேறு ஏதாவது மாற்றும் வரை.

source: We modify the list of @code{%standard-phases} of the build system with the @code{modify-phases} macro as per the list of specified modifications, which may have the following forms:
ta: பின்வரும் படிவங்களைக் கொண்டிருக்கும் குறிப்பிட்ட மாற்றங்களின் பட்டியலின்படி @code{%standard-phases} உருவாக்க அமைப்பின் பட்டியலை @code{modify-phases} மேக்ரோ மூலம் மாற்றியமைப்போம்:

source: @code{(add-before @var{phase} @var{new-phase} @var{procedure})}: Run @var{procedure} named @var{new-phase} before @var{phase}.
ta: @code{(add-before @var{phase} @var{new-phase} @var{phase})}: @var{procedure} என்ற பெயரிடப்பட்ட @var{procedure} ஐ @var{phase}க்கு முன் இயக்கவும்.

source: @code{(add-after @var{phase} @var{new-phase} @var{procedure})}: Same, but afterwards.
ta: @code{(add-after @var{phase} @var{new-phase} @var{procedure})}: அதே, ஆனால் பின்னர்.

source: @code{(replace @var{phase} @var{procedure})}.
ta: @code{(@var{phase} @var{procedure} ஐ மாற்றவும்)}.

source: @code{(delete @var{phase})}.
ta: @code{(@var{phase})}.

source: The @var{procedure} supports the keyword arguments @code{inputs} and @code{outputs}. Each input (whether @emph{native}, @emph{propagated} or not) and output directory is referenced by their name in those variables. Thus @code{(assoc-ref outputs "out")} is the store directory of the main output of the package. A phase procedure may look like this:
ta: @var{procedure} முக்கிய வாதங்கள் @code{inputs} மற்றும் @code{outputs} ஆகியவற்றை ஆதரிக்கிறது. ஒவ்வொரு உள்ளீடும் (@emph{native}, @emph{propagated} அல்லது இல்லாவிட்டாலும்) மற்றும் வெளியீட்டு கோப்பகம் அந்த மாறிகளில் அவற்றின் பெயரால் குறிப்பிடப்படுகிறது. எனவே @code{(assoc-ref வெளியீடுகள் "அவுட்")} என்பது தொகுப்பின் முக்கிய வெளியீட்டின் கடை கோப்பகமாகும். ஒரு கட்ட செயல்முறை இப்படி இருக்கலாம்:

source: (lambda* (#:key inputs outputs #:allow-other-keys) (let ((bash-directory (assoc-ref inputs "bash")) (output-directory (assoc-ref outputs "out")) (doc-directory (assoc-ref outputs "doc"))) ;; ... ))
ta: (லாம்ப்டா* (#:முக்கிய உள்ளீடுகள் வெளியீடுகள் #:அனுமதி-பிற-விசைகள்) ((பேச்-டைரக்டரி (assoc-ref உள்ளீடுகள் "bash")) (output-directory (assoc-ref வெளியீடுகள் "அவுட்")) (doc-directory (assoc-ref வெளியீடுகள் "doc"))) ;; ...))

source: Its return value is ignored.
ta: அதன் வருவாய் மதிப்பு புறக்கணிக்கப்பட்டது.

source: Code staging
ta: குறியீடு நிலைப்படுத்தல்

source: The astute reader may have noticed the quasi-quote and comma syntax in the argument field. Indeed, the build code in the package declaration should not be evaluated on the client side, but only when passed to the Guix daemon. This mechanism of passing code around two running processes is called @uref{https://arxiv.org/abs/1709.00833, code staging}.
ta: வாதப் புலத்தில் உள்ள அரை மேற்கோள் மற்றும் காற்புள்ளியின் தொடரியலை நுணுக்கமான வாசகர் கவனித்திருக்கலாம். உண்மையில், தொகுப்பு அறிவிப்பில் உள்ள உருவாக்கக் குறியீடு கிளையன்ட் பக்கத்தில் மதிப்பீடு செய்யப்படக்கூடாது, ஆனால் Guix deemon க்கு அனுப்பப்படும் போது மட்டுமே. இரண்டு இயங்கும் செயல்முறைகளைச் சுற்றி குறியீட்டைக் கடத்தும் இந்த வழிமுறை @uref{https://arxiv.org/abs/1709.00833, குறியீடு staging} என அழைக்கப்படுகிறது.

source: Utility functions
ta: பயன்பாட்டு செயல்பாடுகள்

source: When customizing @code{phases}, we often need to write code that mimics the equivalent system invocations (@code{make}, @code{mkdir}, @code{cp}, etc.)@: commonly used during regular ``Unix-style'' installations.
ta: @code{phases}ஐத் தனிப்பயனாக்கும்போது, வழக்கமான ``Unix-style'' நிறுவல்களின் போது பொதுவாகப் பயன்படுத்தப்படும் சமமான கணினி அழைப்புகளை (@code{make}, @code{mkdir}, @code{cp}, முதலியன) பிரதிபலிக்கும் குறியீட்டை நாம் அடிக்கடி எழுத வேண்டும்.

source: Some like @code{chmod} are native to Guile. @xref{,,, guile, Guile reference manual} for a complete list.
ta: @code{chmod} போன்ற சில குயிலை பூர்வீகமாகக் கொண்டவை. முழுமையான பட்டியலுக்கு @xref{,,, guile, Guile குறிப்பு manual}.

source: Guix provides additional helper functions which prove especially handy in the context of package management.
ta: Guix கூடுதல் உதவி செயல்பாடுகளை வழங்குகிறது, இது தொகுப்பு நிர்வாகத்தின் சூழலில் மிகவும் பயனுள்ளதாக இருக்கும்.

source: Some of those functions can be found in @samp{$GUIX_CHECKOUT/guix/guix/build/utils.scm}. Most of them mirror the behaviour of the traditional Unix system commands:
ta: அந்த செயல்பாடுகளில் சிலவற்றை @samp{$GUIX_CHECKOUT/guix/guix/build/utils.scm} இல் காணலாம். அவற்றில் பெரும்பாலானவை பாரம்பரிய யூனிக்ச் அமைப்பு கட்டளைகளின் நடத்தையை பிரதிபலிக்கின்றன:

source: which
ta: எது

source: Like the @samp{which} system command.
ta: @samp{which} கணினி கட்டளையைப் போல.

source: find-files
ta: கண்டுபிடிக்க-கோப்புகள்

source: Akin to the @samp{find} system command.
ta: @samp{find} கணினி கட்டளைக்கு ஒத்ததாகும்.

source: Like @samp{mkdir -p}, which creates all parents as needed.
ta: @samp{mkdir -p} போன்றது, தேவைக்கேற்ப அனைத்து பெற்றோரையும் உருவாக்குகிறது.

source: install-file
ta: நிறுவல்-கோப்பு

source: Similar to @samp{install} when installing a file to a (possibly non-existing) directory. Guile has @code{copy-file} which works like @samp{cp}.
ta: @samp{install} போன்ற ஒரு கோப்பை (ஒருவேளை இல்லாத) கோப்பகத்தில் நிறுவும் போது. Guile @samp{cp} போன்று செயல்படும் @code{copy-file} உள்ளது.

source: copy-recursively
ta: நகல்-சுழற்சி

source: Like @samp{cp -r}.
ta: @samp{cp -r} போல.

source: delete-file-recursively
ta: நீக்க-கோப்பு-சுழற்சியாக

source: Like @samp{rm -rf}.
ta: @samp{rm -rf} போல.

source: invoke
ta: அழைக்கவும்

source: Run an executable. This should be used instead of @code{system*}.
ta: இயங்கக்கூடிய ஒன்றை இயக்கவும். @code{system*}க்குப் பதிலாக இதைப் பயன்படுத்த வேண்டும்.

source: with-directory-excursion
ta: உடன்-அடைவு-உல்லாசப் பயணம்

source: Run the body in a different working directory, then restore the previous working directory.
ta: வேறு வேலை செய்யும் கோப்பகத்தில் உடலை இயக்கவும், பின்னர் முந்தைய வேலை கோப்பகத்தை மீட்டெடுக்கவும்.

source: substitute*
ta: மாற்று*

source: A ``@command{sed}-like'' function.
ta: ``@கமாண்ட்{sed}-போன்ற'' செயல்பாடு.

source: @xref{Build Utilities,,, guix, GNU Guix Reference Manual}, for more information on these utilities.
ta: @xref{பில்ட் யூட்டிலிட்டிச்,,, guix, GNU Guix குறிப்பு Manual}, இந்த பயன்பாடுகள் பற்றிய கூடுதல் தகவலுக்கு.

source: Module prefix
ta: தொகுதி முன்னொட்டு

source: The license in our last example needs a prefix: this is because of how the @code{license} module was imported in the package, as @code{#:use-module ((guix licenses) #:prefix license:)}. The Guile module import mechanism (@pxref{Using Guile Modules,,, guile, Guile reference manual}) gives the user full control over namespacing: this is needed to avoid clashes between, say, the @samp{zlib} variable from @samp{licenses.scm} (a @emph{license} value) and the @samp{zlib} variable from @samp{compression.scm} (a @emph{package} value).
ta: எங்கள் கடைசி எடுத்துக்காட்டில் உள்ள உரிமத்திற்கு முன்னொட்டு தேவை: @code{#:use-module ((guix உரிமங்கள்) #:prefix உரிமம்:)} என, தொகுப்பில் @code{license} தொகுதி எவ்வாறு இறக்குமதி செய்யப்பட்டது என்பதன் காரணமாக இது ஏற்படுகிறது. Guile தொகுதி இறக்குமதி பொறிமுறையானது (@pxref{Guile தொகுதிகள் ஐப் பயன்படுத்துதல்,,, guile, Guile குறிப்பு manual}) பயனருக்கு பெயர் இடைவெளியில் முழுக் கட்டுப்பாட்டை அளிக்கிறது: @samp{zlib} மாறி, @samp{licenses.scm} (@emph{}variable} amp இலிருந்து @zlib} மதிப்பு) ஆகியவற்றுக்கு இடையேயான மோதல்களைத் தவிர்க்க இது தேவைப்படுகிறது. @samp{license} (ஒரு @emph{zlib} மதிப்பு).

source: What we've seen so far covers the majority of packages using a build system other than the @code{trivial-build-system}. The latter does not automate anything and leaves you to build everything manually. This can be more demanding and we won't cover it here for now, but thankfully it is rarely necessary to fall back on this system.
ta: நாம் இதுவரை பார்த்தது @code{trivial-build-system} ஐத் தவிர வேறு பில்ட் சிச்டத்தைப் பயன்படுத்தி பெரும்பாலான தொகுப்புகளை உள்ளடக்கியது. பிந்தையது எதையும் தானியக்கமாக்காது மற்றும் எல்லாவற்றையும் கைமுறையாக உருவாக்க உங்களை அனுமதிக்கிறது. இது மிகவும் தேவைப்படக்கூடியதாக இருக்கலாம், இப்போது நாங்கள் அதை இங்கே மறைக்க மாட்டோம், ஆனால் அதிர்ச்டவசமாக இந்த அமைப்பில் பின்வாங்குவது அரிதாகவே தேவை.

source: For the other build systems, such as ASDF, Emacs, Perl, Ruby and many more, the process is very similar to the GNU build system except for a few specialized arguments.
ta: ASDF, Emacs, Perl, ரூபி மற்றும் பல போன்ற பிற உருவாக்க அமைப்புகளுக்கு, சில சிறப்பு வாதங்களைத் தவிர, செயல்முறை GNU பில்ட் சிச்டத்தைப் போலவே உள்ளது.
