Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: Air-gapped clusters require more work. At the moment, our suggestion would be to download all the necessary source code on a workstation running Guix. For instance, using the @option{--sources} option of @command{guix build} (@pxref{Invoking guix build,,, guix, GNU Guix Reference Manual}), the example below downloads all the source code the @code{openmpi} package depends on:
ta: காற்று இடைவெளி கொண்ட கொத்துக்களுக்கு அதிக வேலை தேவைப்படுகிறது. இந்த நேரத்தில், Guix இயங்கும் பணிநிலையத்தில் தேவையான அனைத்து மூலக் குறியீட்டையும் பதிவிறக்கம் செய்வதே எங்கள் பரிந்துரை. எடுத்துக்காட்டாக, @option{--sources} விருப்பத்தைப் பயன்படுத்தி @command{guix build} (@pxref{Invoking guix build,,, guix, GNU Guix குறிப்பு Manual}), கீழே உள்ள எடுத்துக்காட்டு, @code{openmpi} தொகுப்பின் அனைத்து மூலக் குறியீட்டையும் பதிவிறக்குகிறது:

source: $ guix build --sources=transitive openmpi
ta: $ guix உருவாக்கு --sources=transitive openmpi

source: (In case you're wondering, that's more than 320@ MiB of @emph{compressed} source code.)
ta: (நீங்கள் ஆச்சரியப்படுகிறீர்கள் என்றால், அது @emph{compressed} மூலக் குறியீட்டின் 320@ MiB ஐ விட அதிகமாகும்.)

source: We can then make a big archive containing all of this (@pxref{Invoking guix archive,,, guix, GNU Guix Reference Manual}):
ta: பின்னர் இவை அனைத்தையும் உள்ளடக்கிய ஒரு பெரிய காப்பகத்தை உருவாக்கலாம் (@pxref{Invoking guix archive,,, guix, GNU Guix குறிப்பு Manual}):

source: $ guix archive --export \ `guix build --sources=transitive openmpi` \ > openmpi-source-code.nar
ta: $ guix காப்பகம் --ஏற்றுமதி \ `guix உருவாக்கு --sources=transitive openmpi` \ > openmpi-source-code.nar

source: @dots{} and we can eventually transfer that archive to the cluster on removable storage and unpack it there:
ta: @dots{} மற்றும் அந்த காப்பகத்தை நீக்கக்கூடிய சேமிப்பகத்தில் உள்ள கிளச்டருக்கு மாற்றலாம் மற்றும் அதை அங்கே திறக்கலாம்:

source: $ guix archive --import < openmpi-source-code.nar
ta: $ guix காப்பகம் --இறக்குமதி < openmpi-source-code.nar

source: This process has to be repeated every time new source code needs to be brought to the cluster.
ta: ஒவ்வொரு முறையும் புதிய மூலக் குறியீட்டை கிளச்டருக்குக் கொண்டு வரும்போது இந்த செயல்முறை மீண்டும் செய்யப்பட வேண்டும்.

source: As we write this, the research institutes involved in Guix-HPC do not have air-gapped clusters though. If you have experience with such setups, we would like to hear feedback and suggestions.
ta: நாம் இதை எழுதுகையில், Guix-HPC இல் ஈடுபட்டுள்ள ஆராய்ச்சி நிறுவனங்களில் காற்று-இடைவெளி கிளச்டர்கள் இல்லை. அத்தகைய அமைப்புகளில் உங்களுக்கு பட்டறிவு இருந்தால், நாங்கள் கருத்துகளையும் பரிந்துரைகளையும் கேட்க விரும்புகிறோம்.

source: Disk Usage
ta: வட்டு பயன்பாடு

source: disk usage, on a cluster
ta: வட்டு பயன்பாடு, ஒரு கிளச்டரில்

source: A common concern of sysadmins' is whether this is all going to eat a lot of disk space. If anything, if something is going to exhaust disk space, it's going to be scientific data sets rather than compiled software---that's our experience with almost ten years of Guix usage on HPC clusters. Nevertheless, it's worth taking a look at how Guix contributes to disk usage.
ta: சிசாட்மின்களின் பொதுவான கவலை இதுவெல்லாம் நிறைய வட்டு இடத்தை சாப்பிடப் போகிறதா என்பதுதான். ஏதேனும் இருந்தால், ஏதாவது வட்டு இடத்தை வெளியேற்றப் போகிறது என்றால், அது தொகுக்கப்பட்ட மென்பொருளைக் காட்டிலும் அறிவியல் தரவுத் தொகுப்புகளாக இருக்கும்--- இது HPC கிளச்டர்களில் கிட்டத்தட்ட பத்து வருட Guix பயன்பாட்டில் உள்ள எங்கள் பட்டறிவு. இருப்பினும், வட்டு பயன்பாட்டிற்கு Guix எவ்வாறு பங்களிக்கிறது என்பதைப் பார்ப்பது மதிப்பு.

source: First, having several versions or variants of a given package in @file{/gnu/store} does not necessarily cost much, because @command{guix-daemon} implements deduplication of identical files, and package variants are likely to have a number of common files.
ta: முதலாவதாக, @file{/gnu/store} இல் கொடுக்கப்பட்ட தொகுப்பின் பல பதிப்புகள் அல்லது மாறுபாடுகளை வைத்திருப்பது அதிகச் செலவாகாது, ஏனெனில் @command{guix-daemon} ஒரே மாதிரியான கோப்புகளின் துப்பறிவைச் செயல்படுத்துகிறது, மேலும் தொகுப்பு மாறுபாடுகளில் பல பொதுவான கோப்புகள் இருக்க வாய்ப்புள்ளது.

source: As mentioned above, we recommend having a cron job to run @code{guix gc} periodically, which removes @emph{unused} software from @file{/gnu/store}. However, there's always a possibility that users will keep lots of software in their profiles, or lots of old generations of their profiles, which is ``live'' and cannot be deleted from the viewpoint of @command{guix gc}.
ta: மேலே குறிப்பிட்டுள்ளபடி, @code{guix gc}ஐ அவ்வப்போது இயக்குவதற்கு கிரான் வேலையைப் பரிந்துரைக்கிறோம், இது @emph{unused} மென்பொருளை @file{/gnu/store} இலிருந்து அகற்றும். எவ்வாறாயினும், பயனர்கள் தங்கள் சுயவிவரங்களில் நிறைய மென்பொருட்களை வைத்திருப்பதற்கான சாத்தியக்கூறுகள் அல்லது பல பழைய தலைமுறை சுயவிவரங்கள் உள்ளன, அவை `நேரடி' மற்றும் @command{guix gc} இன் பார்வையில் இருந்து நீக்க முடியாது.

source: The solution to this is for users to regularly remove old generations of their profile. For instance, the following command removes generations that are more than two-month old:
ta: பயனர்கள் தங்கள் சுயவிவரத்தின் பழைய தலைமுறைகளை தவறாமல் அகற்றுவதே இதற்கான தீர்வாகும். உதாரணமாக, பின்வரும் கட்டளை இரண்டு மாதங்களுக்கும் மேலான தலைமுறைகளை நீக்குகிறது:

source: guix package --delete-generations=2m
ta: guix தொகுப்பு --delete-generations=2m

source: Likewise, it's a good idea to invite users to regularly upgrade their profile, which can reduce the number of variants of a given piece of software stored in @file{/gnu/store}:
ta: அதேபோல், பயனர்கள் தங்கள் சுயவிவரத்தை தொடர்ந்து மேம்படுத்த அழைப்பது நல்லது, இது @file{/gnu/store} இல் சேமிக்கப்படும் கொடுக்கப்பட்ட மென்பொருளின் மாறுபாடுகளின் எண்ணிக்கையைக் குறைக்கலாம்:

source: guix pull guix upgrade
ta: பூச்சு இழுக்கவும் பிளாச்டர் மேம்படுத்தல்

source: As a last resort, it is always possible for sysadmins to do some of this on behalf of their users. Nevertheless, one of the strengths of Guix is the freedom and control users get on their software environment, so we strongly recommend leaving users in control.
ta: கடைசி முயற்சியாக, சிசாட்மின்கள் தங்கள் பயனர்களின் சார்பாக சிலவற்றைச் செய்வது எப்போதும் சாத்தியமாகும். இருப்பினும், Guix இன் பலங்களில் ஒன்று, பயனர்கள் தங்கள் மென்பொருள் சூழலில் பெறும் விடுதலை மற்றும் கட்டுப்பாடு, எனவே பயனர்களை கட்டுப்பாட்டில் விடுமாறு நாங்கள் கடுமையாக பரிந்துரைக்கிறோம்.

source: Security Considerations
ta: பாதுகாப்பு பரிசீலனைகள்

source: security, on a cluster
ta: பாதுகாப்பு, ஒரு கிளச்டரில்

source: On an HPC cluster, Guix is typically used to manage scientific software. Security-critical software such as the operating system kernel and system services such as @code{sshd} and the batch scheduler remain under control of sysadmins.
ta: HPC கிளச்டரில், Guix பொதுவாக அறிவியல் மென்பொருளை நிர்வகிக்கப் பயன்படுகிறது. ஆப்பரேட்டிங் சிச்டம் கர்னல் போன்ற பாதுகாப்பு முக்கியமான மென்பொருள் மற்றும் @code{sshd} மற்றும் தொகுதி திட்டமிடல் போன்ற கணினி சேவைகள் சிசாட்மின்களின் கட்டுப்பாட்டில் இருக்கும்.

source: The Guix project has a good track record delivering security updates in a timely fashion (@pxref{Security Updates,,, guix, GNU Guix Reference Manual}). To get security updates, users have to run @code{guix pull && guix upgrade}.
ta: Guix திட்டமானது சரியான நேரத்தில் பாதுகாப்பு புதுப்பிப்புகளை வழங்கும் ஒரு நல்ல சாதனையைக் கொண்டுள்ளது (@pxref{Security Updates,,, guix, GNU Guix குறிப்பு Manual}). பாதுகாப்பு புதுப்பிப்புகளைப் பெற, பயனர்கள் @code{guix pull && guix upgrade} ஐ இயக்க வேண்டும்.

source: Because Guix uniquely identifies software variants, it is easy to see if a vulnerable piece of software is in use. For instance, to check whether the glibc@ 2.25 variant without the mitigation patch against ``@uref{https://www.qualys.com/2017/06/19/stack-clash/stack-clash.txt,Stack Clash}'', one can check whether user profiles refer to it at all:
ta: Guix மென்பொருள் மாறுபாடுகளை தனித்துவமாக அடையாளம் காண்பதால், பாதிக்கப்படக்கூடிய மென்பொருள் பயன்பாட்டில் உள்ளதா என்பதைப் பார்ப்பது எளிது. எடுத்துக்காட்டாக, ``@uref{https://www.qualys.com/2017/06/19/stack-clash/stack-clash.txt,Stack Clash}''க்கு எதிரான குறைப்பு இணைப்பு இல்லாமல் glibc@ 2.25 மாறுபாடு உள்ளதா என்பதைச் சரிபார்க்க, பயனர் சுயவிவரங்கள் அதைக் குறிப்பிடுகின்றனவா என்பதைச் சரிபார்க்கலாம்:

source: guix gc --referrers /gnu/store/…-glibc-2.25
ta: plaster gc --referrers /gnu/store/…-glibc-2.25

source: This will report whether profiles exist that refer to this specific glibc variant.
ta: இந்த குறிப்பிட்ட glibc மாறுபாட்டைக் குறிக்கும் சுயவிவரங்கள் உள்ளதா என்பதை இது தெரிவிக்கும்.

source: system management
ta: அமைப்பு மேலாண்மை

source: sysadmin
ta: சிசாட்மின்

source: Since Guix does not handle packaging, system configuration and services the way other (more ``classical'') distributions do, some workflows tend to unfold slightly different as we are used to and need slight adjustment. This chapter intends to help with such manners.
ta: குயிக்ச் பேக்கேசிங், சிச்டம் உள்ளமைவு மற்றும் சேவைகளை மற்ற (அதிக ``கிளாசிக்கல்'') விநியோகங்கள் கையாளாததால், சில பணிப்பாய்வுகள் நாம் பழகியதைப் போல சற்று வித்தியாசமாக வெளிவருகின்றன, மேலும் சிறிது சரிசெய்தல் தேவைப்படுகிறது. இந்த அத்தியாயம் அத்தகைய நடத்தைகளுக்கு உதவும்.

source: With the deprecation of the default value for the postgres package in postgresql-configuration (see b93434e656eba4260df82158a96c295000d3ff44), system upgrades need some manual action before they can take place. Here's a handy guide on how to.
ta: postgresql-configuration இல் உள்ள postgres தொகுப்பிற்கான இயல்புநிலை மதிப்பின் தேய்மானத்துடன் (b93434e656eba4260df82158a96c295000d3ff44 ஐப் பார்க்கவும்), கணினி மேம்படுத்தல்கள் நடைபெறுவதற்கு முன் சில கைமுறையாகச் செயல்பட வேண்டும். எப்படி செய்வது என்பதற்கான எளிய வழிகாட்டி இங்கே.

source: Please note that this is a straight-forward way for smaller datasets. For larger databases @url{https://www.postgresql.org/docs/current/pgupgrade.html, @code{pg_upgrade}} may be the better choice. Handling the service and system upgrade as described in this guide still applies, though.
ta: சிறிய தரவுத்தொகுப்புகளுக்கு இது ஒரு நேரடியான வழி என்பதை நினைவில் கொள்ளவும். பெரிய தரவுத்தளங்களுக்கு @url{https://www.postgresql.org/docs/current/pgupgrade.html, @code{pg_upgrade}} சிறந்த தேர்வாக இருக்கலாம். இந்த வழிகாட்டியில் விவரிக்கப்பட்டுள்ளபடி பணி மற்றும் கணினி மேம்படுத்தலைக் கையாளுதல் இன்னும் பொருந்தும்.

source: Stop and disable cuirass.
ta: குய்ராசை நிறுத்தி முடக்கவும்.

source: Prevent the service from starting and failing after a reconfiguration:
ta: மறுகட்டமைப்பிற்குப் பிறகு சேவையைத் தொடங்குதல் மற்றும் தோல்வியடைவதைத் தடுக்கவும்:

source: sudo herd stop cuirass && sudo herd disable cuirass
ta: sudo herd நிறுத்து cuiras && sudo herd முடக்கு cuiras

source: Dump the database contents.
ta: தரவுத்தள உள்ளடக்கங்களை டம்ப் செய்யவும்.

source: Add or alter the postgres service.
ta: போச்ட்கிரெச் சேவையைச் சேர்க்கவும் அல்லது மாற்றவும்.

source: Depending on whether your postgres service is defined implicitly (through the dependency from the cuirass service) or its own entry in your operating system's @code{(services)} property, you need to either add or alter the already existing configuration to reflect your intended version upgrade.
ta: உங்கள் போச்ட்கிரெச் பணி மறைமுகமாக வரையறுக்கப்பட்டுள்ளதா (குயிராச் சேவையின் சார்பு மூலம்) அல்லது உங்கள் இயக்க முறைமையின் @code{(services)} சொத்தில் அதன் சொந்த உள்ளீடு என்பதைப் பொறுத்து, நீங்கள் உத்தேசித்துள்ள பதிப்பு மேம்படுத்தலைப் பிரதிபலிக்க, ஏற்கனவே உள்ள உள்ளமைவைச் சேர்க்க வேண்டும் அல்லது மாற்ற வேண்டும்.

source: Be careful not to upgrade directly to postgres-16 -- cuirass service for some reason doesn't like that. I had to find and purge the relevant files and then re-initialize after a failed upgrade to postgres 16.
ta: போச்ட்கிரெச்-16க்கு நேரடியாக மேம்படுத்தாமல் கவனமாக இருங்கள் -- சில காரணங்களால் குய்ராச் பணி அதை விரும்பவில்லை. நான் தொடர்புடைய கோப்புகளைக் கண்டுபிடித்து சுத்தப்படுத்த வேண்டும், பின்னர் postgres 16 க்கு மேம்படுத்துவதில் தோல்வியடைந்த பிறகு மீண்டும் தொடங்க வேண்டும்.

source: (service postgresql-service-type (postgresql-configuration (postgresql (@@ (gnu packages databases) postgresql-15))))
ta: (சேவை postgresql-service-type (postgresql-configuration (postgresql (@@ (gnu தொகுப்புகள் தரவுத்தளங்கள்) postgresql-15))))

source: Note: If you for some reason didn't read the text here but somewhat blindly followed the examples and @emph{did upgrade to 16}, here's how you reset the state:
ta: குறிப்பு: சில காரணங்களால் நீங்கள் இங்குள்ள உரையைப் படிக்காமல், உதாரணங்களை ஓரளவு கண்மூடித்தனமாகப் பின்பற்றி @emph{did upgrade to 16}க்கு மேம்படுத்தியிருந்தால், நிலையை எவ்வாறு மீட்டமைப்பது என்பது இங்கே:

source: Delete the database instance files.
ta: தரவுத்தள நிகழ்வு கோப்புகளை நீக்கவும்.

source: They default to live under @file{/var/lib/postgres/data}.
ta: @file{/var/lib/postgres/data} இன் கீழ் அவை இயல்புநிலையாக இருக்கும்.

source: Re-initialize postgres.
ta: போச்ட்கிரேசை மீண்டும் தொடங்கவும்.

source: Reconfigure your system.
ta: உங்கள் கணினியை மீண்டும் கட்டமைக்கவும்.

source: sudo guix system reconfigure path/to/your/altered/config.scm
ta: sudo guix அமைப்பு பாதை/to/your/altered/config.scm ஐ மறுகட்டமைக்கிறது

source: Restore database contents.
ta: தரவுத்தள உள்ளடக்கங்களை மீட்டமைக்கவும்.

source: Enable and start the service.
ta: சேவையை இயக்கி தொடங்கவும்.

source: sudo herd enable cuirass sudo herd start cuirass
ta: sudo மந்தை குய்ராசை செயல்படுத்துகிறது sudo மந்தை தொடக்க cuiras

source: Guix is based on the @uref{https://nixos.org/nix/, Nix package manager}, which was designed and implemented by Eelco Dolstra, with contributions from other people (see the @file{nix/AUTHORS} file in Guix.) Nix pioneered functional package management, and promoted unprecedented features, such as transactional package upgrades and rollbacks, per-user profiles, and referentially transparent build processes. Without this work, Guix would not exist.
ta: Guix ஆனது @uref{https://nixos.org/nix/, Nix தொகுப்பு மேலாளர்} ஐ அடிப்படையாகக் கொண்டது, இது Eelco Dolstra ஆல் வடிவமைத்து செயல்படுத்தப்பட்டது, பிறரின் பங்களிப்புகளுடன் (Guix இல் @file{nix/AUTHORS} கோப்பைப் பார்க்கவும்.) Nix முன்னோடியாக செயல்பட்ட தொகுப்பு மேலாண்மை, மற்றும் முன்னோடியில்லாத அம்சங்களை மேம்படுத்தியது, பரிவர்த்தனை மற்றும் பரிந்துரை பேக்கேச் சுயவிவரம் போன்றவற்றின் அடிப்படையில் வெளிப்படையான உருவாக்க செயல்முறைகள். இந்த வேலை இல்லாமல், Guix இருக்காது.

source: The Nix-based software distributions, Nixpkgs and NixOS, have also been an inspiration for Guix.
ta: Nix-அடிப்படையிலான மென்பொருள் விநியோகங்கள், Nixpkgs மற்றும் NixOS ஆகியவை Guix க்கு ஒரு உத்வேகமாக உள்ளன.

source: GNU@tie{}Guix itself is a collective work with contributions from a number of people. See the @file{AUTHORS} file in Guix for more information on these fine people. The @file{THANKS} file lists people who have helped by reporting bugs, taking care of the infrastructure, providing artwork and themes, making suggestions, and more---thank you!
ta: GNU@tie{}Guix என்பது பலரின் பங்களிப்புகளைக் கொண்ட ஒரு கூட்டுப் பணியாகும். இந்த சிறந்த நபர்களைப் பற்றிய கூடுதல் தகவலுக்கு Guix இல் உள்ள @file{AUTHORS} கோப்பைப் பார்க்கவும். @file{THANKS} கோப்பு, பிழைகளைப் புகாரளித்தல், உள்கட்டமைப்பைக் கவனித்துக்கொள்வது, கலைப்படைப்பு மற்றும் கருப்பொருள்களை வழங்குதல், பரிந்துரைகள் செய்தல் மற்றும் பலவற்றின் மூலம் உதவியவர்களை பட்டியலிடுகிறது---நன்றி!

source: This document includes adapted sections from articles that have previously been published on the Guix blog at @uref{https://guix.gnu.org/blog} and on the Guix-HPC blog at @uref{https://hpc.guix.info/blog}.
ta: Guix வலைப்பதிவில் @uref{https://guix.gnu.org/blog} இல் மற்றும் Guix-HPC வலைப்பதிவில் @uref{https://hpc.guix.info/blog} இல் முன்னர் வெளியிடப்பட்ட கட்டுரைகளிலிருந்து தழுவிய பகுதிகளை இந்த ஆவணம் கொண்டுள்ளது.

source: license, GNU Free Documentation License
ta: உரிமம், குனு இலவச ஆவண உரிமம்
