Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: To use our packaged development snapshots, it's also necessary to modify @file{Cargo.toml} in a build phase, with a package-specific substitution pattern.
ta: எங்களின் பேக்கேச் செய்யப்பட்ட டெவலப்மெண்ட் ச்னாப்சாட்களைப் பயன்படுத்த, @file{Cargo.toml}ஐ, தொகுப்பு-குறிப்பிட்ட மாற்று வடிவத்துடன், உருவாக்க கட்டத்தில் மாற்றுவதும் தேவை.

source: (define-public niri (package (name "niri") (version "25.02") (source (origin (method git-fetch) (uri (git-reference (url "https://github.com/YaLTeR/niri") (commit (string-append "v" version)))) (file-name (git-file-name name version)) (sha256 (base32 "0vzskaalcz6pcml687n54adjddzgf5r07gggc4fhfsa08h1wfd4r")))) (build-system cargo-build-system) (arguments (list #:install-source? #f #:phases #~(modify-phases %standard-phases (add-after 'unpack 'use-guix-vendored-dependencies (lambda _ (substitute* "Cargo.toml" (("# version =.*") "version = \"*\"") (("git.*optional") "version = \"*\", optional") (("^git = .*") ""))))))) (native-inputs (list pkg-config)) (inputs (cons* clang libdisplay-info libinput-minimal libseat libxkbcommon mesa pango pipewire wayland (cargo-inputs 'niri))) (home-page "https://github.com/YaLTeR/niri") (synopsis "Scrollable-tiling Wayland compositor") (description "Niri is a scrollable-tiling Wayland compositor which arranges windows in a scrollable format. It is considered stable for daily use and performs most functions expected of a Wayland compositor.") (license license:gpl3+)))
ta: (வரையறை-பொது நிரி (தொகுப்பு (பெயர் "நிரி") (பதிப்பு "25.02") (ஆதாரம் (கிட்-எடுக்கும் முறை) (உரி (சிட்-குறிப்பு (url "https://github.com/YaLTeR/niri") (commit (string-append "v" பதிப்பு)))) (கோப்பு-பெயர் (git-file-பெயர் பெயர் பதிப்பு)) (sha256 (அடிப்படை 32 "0vzskaalcz6pcml687n54adjddzgf5r07gggc4fhfsa08h1wfd4r")))) (கட்டமைப்பு-அமைப்பு சரக்கு-கட்டமைப்பு-அமைப்பு) (வாதங்கள் (list #:install-source? #f #:கட்டங்கள் #~(மாற்று-கட்டங்கள் %தரநிலை-கட்டங்கள் (சேர்-பிறகு 'அன்பேக்' யூச்-குயிக்ச்-வெண்டார்டு-சார்புகள் (லாம்ப்டா _ (மாற்று* "Cargo.toml" ("# பதிப்பு =.*") "பதிப்பு = \"*\"") ("சிட்.*விரும்பினால்") "பதிப்பு = \"*\", விருப்பமானது") ("^சிட் = .*") ""))))))) (சொந்த-உள்ளீடுகள் (pkg-config பட்டியல்)) (உள்ளீடுகள் (தீமைகள் * கணகண வென்ற ஒலி libdisplay-info லிபின்புட்-குறைந்தபட்சம் லிப்சீட் libxkbcommon மேசா பாங்கோ குழாய் கம்பி வழி நிலம் (சரக்கு உள்ளீடுகள் 'நிரி))) (முகப்பு பக்கம் "https://github.com/YaLTeR/niri") (சுருக்கம் "சுருள்-டைலிங் வேலண்ட் இசையமைப்பாளர்") (விளக்கம் "நிரி ஒரு ச்க்ரோல்-டைலிங் வேலண்ட் இசையமைப்பாளர் ஆகும், இது சன்னல்களை ஏ உருட்டக்கூடிய வடிவம். இது நாள்தோறும் பயன்பாட்டிற்கு நிலையானதாகக் கருதப்படுகிறது மற்றும் பெரும்பாலானவற்றைச் செய்கிறது வேலண்ட் இசையமைப்பாளரிடமிருந்து எதிர்பார்க்கப்படும் செயல்பாடுகள்.") (உரிமம் உரிமம்:gpl3+)))

source: @code{niri} has Cargo workspace dependencies. When packaging a Cargo workspace dependency, parameter @code{#:cargo-package-crates} is required.
ta: @code{niri} ஆனது சரக்கு பணியிட சார்புகளைக் கொண்டுள்ளது. கார்கோ பணியிட சார்புநிலையை பேக்கேசிங் செய்யும் போது, @code{#:cargo-package-crates} அளவுரு தேவை.

source: (define-public rust-pipewire-0.8.0.fd3d8f7 (let ((commit "fd3d8f7861a29c2eeaa4c393402e013578bb36d9") (revision "0")) (package (name "rust-pipewire") (version (git-version "0.8.0" revision commit)) (source (origin (method git-fetch) (uri (git-reference (url "https://gitlab.freedesktop.org/pipewire/pipewire-rs.git") (commit commit))) (file-name (git-file-name name version)) (sha256 (base32 "1hzyhz7xg0mz8a5y9j6yil513p1m610q3j9pzf6q55vdh5mcn79v")))) (build-system cargo-build-system) (arguments (list #:skip-build? #t #:cargo-package-crates ''("libspa-sys" "libspa" "pipewire-sys" "pipewire"))) (inputs (cargo-inputs 'rust-pipewire-0.8.0.fd3d8f7)) (home-page "https://pipewire.org/") (synopsis "Rust bindings for PipeWire") (description "This package provides Rust bindings for PipeWire.") (license license:expat))))
ta: (define-public rust-pipewire-0.8.0.fd3d8f7 ((கமிட் "fd3d8f7861a29c2eeaa4c393402e013578bb36d9") (திருத்தம் "0")) (தொகுப்பு (பெயர் "துரு-குழாய் கம்பி") (பதிப்பு (git-version "0.8.0" revision commit)) (ஆதாரம் (தோற்றம் (கிட்-எடுக்கும் முறை) (உரி (சிட்-குறிப்பு (url "https://gitlab.freedesktop.org/pipewire/pipewire-rs.git") (உறுதி உறுதி))) (கோப்பு-பெயர் (git-file-பெயர் பெயர் பதிப்பு)) (sha256 (base32 "1hzyhz7xg0mz8a5y9j6yil513p1m610q3j9pzf6q55vdh5mcn79v")))) (கட்டமைப்பு-அமைப்பு சரக்கு-கட்டமைப்பு-அமைப்பு) (வாதங்கள் (list #:skip-build? #t #:சரக்கு-பொதி-பெட்டிகள் ''("libspa-sys" "libspa" "pipewire-sys" "pipewire"))) (உள்ளீடுகள் (சரக்கு உள்ளீடுகள் 'rust-pipewire-0.8.0.fd3d8f7)) (முகப்பு பக்கம் "https://pipewire.org/") (சுருக்கம் "பைப்வயருக்கான ரச்ட் பைண்டிங்ச்") (விளக்கம் "இந்த தொகுப்பு PipeWire க்கான ரச்ட் பிணைப்புகளை வழங்குகிறது.") (உரிமம் உரிமம்:வெளிநாட்டவர்)))

source: Don't forget to modify all workspace members in @code{(gnu packages rust-crates)}:
ta: @code{(gnu தொகுப்புகள் rust-crates)} இல் அனைத்து பணியிட உறுப்பினர்களையும் மாற்ற மறக்காதீர்கள்:

source: In this example, we'll package @code{libchewing}, which combines two build systems.
ta: இந்த எடுத்துக்காட்டில், இரண்டு உருவாக்க அமைப்புகளை இணைக்கும் @code{libchewing}ஐ தொகுப்போம்.

source: When building Rust packages in other build systems, we need to add @code{rust}, and @code{rust:cargo} to @code{native-inputs}, import and use modules from both build systems, and apply necessary build phases from @code{cargo-build-system}.
ta: மற்ற உருவாக்க அமைப்புகளில் துறு தொகுப்புகளை உருவாக்கும்போது, @code{rust} மற்றும் @code{rust:cargo} ஆகியவற்றை @code{native-inputs} இல் சேர்க்க வேண்டும், இரண்டு உருவாக்க அமைப்புகளிலிருந்தும் தொகுதிகளை இறக்குமதி செய்து பயன்படுத்த வேண்டும், மேலும் @code{cargo-build-system} இலிருந்து தேவையான உருவாக்க கட்டங்களைப் பயன்படுத்த வேண்டும்.

source: For cross-compilation support, we'll also add @code{rust-sysroot} created with @code{(make-rust-sysroot (%current-target-system))} to @code{native-inputs}, and set @code{#:cargo-target} for @code{cargo-build-system}'s build phases.
ta: குறுக்கு-தொகுப்பு ஆதரவுக்காக, @code{(make-rust-sysroot (%current-target-system))} உடன் உருவாக்கப்பட்ட @code{rust-sysroot} ஐ @code{நேட்டிவ்-இன்புட்ச்} என்பதில் சேர்ப்போம், மேலும் @code{cargo-build-system இன் கட்டங்களுக்கு @code{#:cargo-target}ஐ அமைப்போம்.

source: (define-public libchewing (package (name "libchewing") (version "0.9.1") (source (origin (method git-fetch) (uri (git-reference (url "https://github.com/chewing/libchewing") (commit (string-append "v" version)))) (file-name (git-file-name name version)) (sha256 (base32 "0gh64wvrk5pn0fhmpvj1j99d5g7f7697rk96zbkc8l72yjr819z5")))) (build-system cmake-build-system) (arguments (list #:imported-modules (append %cmake-build-system-modules %cargo-build-system-modules) #:modules '(((guix build cargo-build-system) #:prefix cargo:) (guix build cmake-build-system) (guix build utils)) #:phases #~(modify-phases %standard-phases (add-after 'unpack 'prepare-cargo-build-system (lambda args (for-each (lambda (phase) (format #t "Running cargo phase: ~a~%" phase) (apply (assoc-ref cargo:%standard-phases phase) ;; For cross-compilation. #:cargo-target #$(cargo-triplet) args)) '(unpack-rust-crates configure check-for-pregenerated-files patch-cargo-checksums))))))) (native-inputs (append (list rust `(,rust "cargo") ) ;; For cross-compilation. (or (and=> (%current-target-system) (compose list make-rust-sysroot)) '()))) (inputs (cons* corrosion ncurses sqlite (cargo-inputs 'libchewing))) (synopsis "Chinese phonetic input method") (description "Chewing is an intelligent phonetic (Zhuyin/Bopomofo) input method, one of the most popular choices for Traditional Chinese users.") (home-page "https://chewing.im/") (license license:lgpl2.1+)))
ta: (வரையறை-பொது லிப்சூயிங் (தொகுப்பு (பெயர் "லிப்சூயிங்") (பதிப்பு "0.9.1") (ஆதாரம் (தோற்றம் (கிட்-பெட்ச் முறை) (உரி (சிட்-குறிப்பு (url "https://github.com/chewing/libchewing") (commit (string-append "v" பதிப்பு)))) (கோப்பு-பெயர் (git-file-பெயர் பெயர் பதிப்பு)) (sha256 (base32 "0gh64wvrk5pn0fhmpvj1j99d5g7f7697rk96zbkc8l72yjr819z5"))) (கட்டுமான அமைப்பு cmake-build-system) (வாதங்கள் (list #:imported-modules (%cmake-build-system-modules ஐ இணைக்கவும் %கார்கோ-பில்ட்-சிச்டம்-தொகுதிகள்) #:தொகுதிகள் '(((guix உருவாக்கு cargo-build-system) #:prefix cargo:) (guix உருவாக்கு cmake-build-system) (guix உருவாக்க பயன்பாடுகள்)) #:கட்டங்கள் #~(மாற்று-கட்டங்கள் %தரநிலை-கட்டங்கள் (சேர்-பிறகு 'அன்பேக்' தயார்-சரக்கு-உருவாக்கம்-அமைப்பு (லாம்ப்டா ஆர்க்ச் (ஒவ்வொருவருக்கும் (லாம்ப்டா (கட்டம்) (வடிவமைப்பு #t "இயங்கும் சரக்கு கட்டம்: ~a~%" கட்டம்) (விண்ணப்பிக்கவும் (assoc-ref cargo:%standard-phases stage) ;; குறுக்கு தொகுப்புக்காக. #:சரக்கு-இலக்கு #$(சரக்கு-மூன்று) args)) '(அவிழ்-துரு-கிரேட்ச் கட்டமைக்க முன்கூட்டியே உருவாக்கப்பட்ட கோப்புகளை சரிபார்க்கவும் பேட்ச்-கார்கோ-செக்சம்ச்))))))) (சொந்த-உள்ளீடுகள் (சேர்க்கவும் (பட்டியல் துரு `(,துரு "சரக்கு") ) ;; குறுக்கு தொகுப்புக்காக. (அல்லது (மற்றும்=> (%current-target-system) (மேக்-ரச்ட்-சிச்ரூட் பட்டியலை எழுதவும்)) '()))) (உள்ளீடுகள் (கான்ச்* அரிப்பை ncurses sqlite (சரக்கு உள்ளீடுகள் 'libchewing))) (சுருக்கம் "சீன ஒலிப்பு உள்ளீட்டு முறை") (விளக்கம் "மெல்லுதல் என்பது ஒரு அறிவார்ந்த ஒலிப்பு (சுயின்/போபோமோஃபோ) உள்ளீடு முறை, பாரம்பரிய சீன பயனர்களுக்கு மிகவும் பிரபலமான தேர்வுகளில் ஒன்றாகும்.") (முகப்பு பக்கம் "https://chewing.im/") (உரிமம் உரிமம்:lgpl2.1+)))

source: Guix offers a flexible language for declaratively configuring your Guix System. This flexibility can at times be overwhelming. The purpose of this chapter is to demonstrate some advanced configuration concepts.
ta: உங்கள் Guix சிச்டத்தை பிரகடனமாக உள்ளமைக்க Guix ஒரு நெகிழ்வான மொழியை வழங்குகிறது. இந்த நெகிழ்வுத்தன்மை சில சமயங்களில் அதிகமாக இருக்கலாம். இந்த அத்தியாயத்தின் நோக்கம் சில மேம்பட்ட கட்டமைப்பு கருத்துகளை விளக்குவதாகும்.

source: @pxref{System Configuration,,, guix, GNU Guix Reference Manual} for a complete reference.
ta: ஒரு முழுமையான குறிப்புக்கு @pxref{System Configuration,,, guix, GNU Guix குறிப்பு Manual}.

source: While the Guix manual explains auto-login one user to @emph{all} TTYs (@pxref{auto-login to TTY,,, guix, GNU Guix Reference Manual}), some might prefer a situation, in which one user is logged into one TTY with the other TTYs either configured to login different users or no one at all. Note that one can auto-login one user to any TTY, but it is usually advisable to avoid @code{tty1}, which, by default, is used to log warnings and errors.
ta: Guix கையேடு ஒரு பயனரை @emph{all} TTY களுக்கு தானாக உள்நுழைவதை விளக்குகிறது (@pxref{ TTYக்கு தானாக உள்நுழைய,,, guix, GNU Guix குறிப்பு கையேடு}), சிலர் ஒரு சூழ்நிலையை விரும்பலாம், இதில் ஒரு பயனர் ஒரு TTY யில் மற்ற TTY களில் உள்நுழைந்திருப்பார் அல்லது அனைத்து வெவ்வேறு பயனர்கள் உள்நுழைய கட்டமைக்கப்படவில்லை. எந்தவொரு TTY யிலும் ஒருவர் ஒரு பயனரைத் தானாக உள்நுழைய முடியும் என்பதை நினைவில் கொள்ளவும், ஆனால் @code{tty1} ஐத் தவிர்ப்பது பொதுவாக அறிவுறுத்தப்படுகிறது, இது முன்னிருப்பாக எச்சரிக்கைகள் மற்றும் பிழைகளைப் பதிவு செய்யப் பயன்படுகிறது.

source: Here is how one might set up auto login for one user to one tty:
ta: ஒரு பயனருக்கு ஒரு ttyக்கு தானியங்கு உள்நுழைவை எவ்வாறு அமைக்கலாம் என்பது இங்கே:

source: (define (auto-login-to-tty config tty user) (if (string=? tty (mingetty-configuration-tty config)) (mingetty-configuration (inherit config) (auto-login user)) config))
ta: (வரையறுக்கவும் (தானியங்கு-உள்நுழைவு-to-tty கட்டமைப்பு tty பயனர்) (என்றால் (string=? tty (mingetty-configuration-tty config)) (மிங்கெட்டி-கட்டமைப்பு (மரபு கட்டமைப்பு) (தானாக உள்நுழையும் பயனர்) கட்டமைப்பு))

source: (define %my-services (modify-services %base-services ;; @dots{} (mingetty-service-type config => (auto-login-to-tty config "tty3" "alice"))))
ta: (%மை-சேவைகளை வரையறுக்கவும் (மாற்று-சேவைகள் %அடிப்படை-சேவைகள் ;; @dots{} (mingetty-service-type கட்டமைப்பு => (ஆட்டோ-லாக்-இன்-டு-டிடி config "tty3" "alice"))))

source: (operating-system ;; @dots{} (services %my-services))
ta: (இயக்க அமைப்பு ;; @dots{} (சேவைகள் %எனது சேவைகள்))

source: One could also @code{compose} (@pxref{Higher-Order Functions,,, guile, The Guile Reference Manual}) @code{auto-login-to-tty} to login multiple users to multiple ttys.
ta: பல பயனர்களை பல ttys இல் உள்நுழைய @code{compose} (@pxref{Higher-Order Functions,,, guile, The Guile குறிப்பு Manual}) @code{auto-login-to-tty}.

source: Finally, here is a note of caution. Setting up auto login to a TTY, means that anyone can turn on your computer and run commands as your regular user. However, if you have an encrypted root partition, and thus already need to enter a passphrase when the system boots, auto-login might be a convenient option.
ta: இறுதியாக, இங்கே ஒரு முன்னறிவிப்பு குறிப்பு. TTY இல் தானாக உள்நுழைவை அமைப்பது என்றால், உங்கள் கணினியை எவரும் இயக்கலாம் மற்றும் உங்கள் வழக்கமான பயனராக கட்டளைகளை இயக்கலாம். இருப்பினும், உங்களிடம் மறைகுறியாக்கப்பட்ட ரூட் பகிர்வு இருந்தால், கணினி துவங்கும் போது ஏற்கனவே கடவுச்சொல்லை உள்ளிட வேண்டும் என்றால், தானாக உள்நுழைவு ஒரு வசதியான விருப்பமாக இருக்கலாம்.

source: Guix is, at its core, a source based distribution with substitutes (@pxref{Substitutes,,, guix, GNU Guix Reference Manual}), and as such building packages from their source code is an expected part of regular package installations and upgrades. Given this starting point, it makes sense that efforts are made to reduce the amount of time spent compiling packages, and recent changes and upgrades to the building and distribution of substitutes continues to be a topic of discussion within Guix.
ta: Guix என்பது, அதன் மையத்தில், மாற்றுகளுடன் கூடிய மூல அடிப்படையிலான விநியோகமாகும் (@pxref{Substitutes,,, guix, GNU Guix குறிப்பு Manual}), மேலும் அவற்றின் மூலக் குறியீட்டிலிருந்து தொகுப்புகளை உருவாக்குவது வழக்கமான தொகுப்பு நிறுவல்கள் மற்றும் மேம்படுத்தல்களில் எதிர்பார்க்கப்படும் பகுதியாகும். இந்த தொடக்கப் புள்ளியைக் கருத்தில் கொண்டு, தொகுப்புகளைத் தொகுக்க செலவழித்த நேரத்தைக் குறைக்க முயற்சிகள் மேற்கொள்ளப்படுகின்றன, மேலும் அண்மைக் கால மாற்றங்கள் மற்றும் மாற்றீடுகளின் உருவாக்கம் மற்றும் விநியோகத்திற்கான மேம்படுத்தல்கள் Guix க்குள் விவாதத்தின் தலைப்பாகத் தொடர்கின்றன.

source: The kernel, while not requiring an overabundance of RAM to build, does take a rather long time on an average machine. The official kernel configuration, as is the case with many GNU/Linux distributions, errs on the side of inclusiveness, and this is really what causes the build to take such a long time when the kernel is built from source.
ta: கர்னல், அதிக அளவு ரேம் உருவாக்கத் தேவையில்லை என்றாலும், சராசரி கணினியில் அதிக நேரம் எடுக்கும். அதிகாரப்பூர்வ கர்னல் உள்ளமைவு, பல குனு/லினக்ச் விநியோகங்களில் உள்ளதைப் போலவே, உள்ளடக்கியதன் பக்கத்தில் பிழைகள் ஏற்படுகிறது, மேலும் இதுவே மூலத்திலிருந்து கர்னல் கட்டமைக்கப்படும்போது உருவாக்கம் நீண்ட நேரம் எடுக்கும்.

source: The Linux kernel, however, can also just be described as a regular old package, and as such can be customized just like any other package. The procedure is a little bit different, although this is primarily due to the nature of how the package definition is written.
ta: இருப்பினும், லினக்ச் கர்னலை ஒரு வழக்கமான பழைய தொகுப்பாக விவரிக்கலாம், மேலும் மற்ற எந்த தொகுப்பையும் போலவே தனிப்பயனாக்கலாம். செயல்முறை சற்று வித்தியாசமானது, இருப்பினும் இது முதன்மையாக தொகுப்பு வரையறை எழுதப்பட்டதன் தன்மை காரணமாகும்.

source: The @code{linux-libre} kernel package definition is actually a procedure which creates a package.
ta: @code{linux-libre} கர்னல் தொகுப்பு வரையறை என்பது ஒரு தொகுப்பை உருவாக்கும் செயல்முறையாகும்.

source: (define* (make-linux-libre* version gnu-revision source supported-systems #:key (extra-version #f) ;; A function that takes an arch and a variant. ;; See kernel-config for an example. (configuration-file #f) (defconfig "defconfig") (extra-options (default-extra-linux-options version))) ...)
ta: (வரையறுக்கவும்* (make-linux-libre* version gnu-revision மூலம் supported-systems #:சாவி (கூடுதல் பதிப்பு #f) ;; ஒரு வளைவு மற்றும் மாறுபாட்டை எடுக்கும் ஒரு செயல்பாடு. ;; உதாரணத்திற்கு kernel-config ஐப் பார்க்கவும். (configuration-file #f) (defconfig "defconfig") (கூடுதல் விருப்பங்கள் (default-extra-linux-options பதிப்பு))) ...)

source: The current @code{linux-libre} package is for the 5.15.x series, and is declared like this:
ta: தற்போதைய @code{linux-libre} தொகுப்பு 5.15.x தொடருக்கானது, மேலும் இவ்வாறு அறிவிக்கப்பட்டுள்ளது:

source: Any keys which are not assigned values inherit their default value from the @code{make-linux-libre} definition. When comparing the two snippets above, notice the code comment that refers to @code{#:configuration-file}. Because of this, it is not actually easy to include a custom kernel configuration from the definition, but don't worry, there are other ways to work with what we do have.
ta: மதிப்புகள் ஒதுக்கப்படாத எந்த விசைகளும் @code{make-linux-libre} வரையறையிலிருந்து அவற்றின் இயல்பு மதிப்பைப் பெறுகின்றன. மேலே உள்ள இரண்டு துணுக்குகளையும் ஒப்பிடும் போது, @code{#:configuration-file} ஐக் குறிக்கும் குறியீடு கருத்தைக் கவனிக்கவும். இதன் காரணமாக, வரையறையிலிருந்து தனிப்பயன் கர்னல் உள்ளமைவைச் சேர்ப்பது உண்மையில் எளிதானது அல்ல, ஆனால் கவலைப்பட வேண்டாம், எங்களிடம் உள்ளதைக் கொண்டு வேலை செய்ய வேறு வழிகள் உள்ளன.

source: There are two ways to create a kernel with a custom kernel configuration. The first is to provide a standard @file{defconfig} to @code{customize-linux} procedure. To produce such file you need to obtain Linux source code, create a @file{.config} file (using @code{make menuconfig} command, for example) or provide one you already have. After that you will need to run @code{make savedefconfig} command within the kernel source tree---this will produce the @file{defconfig} file which we will use to build a custom kernel.
ta: தனிப்பயன் கர்னல் உள்ளமைவுடன் கர்னலை உருவாக்க இரண்டு வழிகள் உள்ளன. முதலில் @file{defconfig} க்கு @code{customize-linux} நடைமுறையை வழங்குவது. அத்தகைய கோப்பை உருவாக்க, நீங்கள் லினக்ச் மூலக் குறியீட்டைப் பெற வேண்டும், @file{.config} கோப்பை உருவாக்கவும் (உதாரணமாக @code{make menuconfig} கட்டளையைப் பயன்படுத்தி) அல்லது உங்களிடம் ஏற்கனவே உள்ள ஒன்றை வழங்கவும். அதன் பிறகு நீங்கள் கர்னல் மூல மரத்தில் @code{make savedefconfig} கட்டளையை இயக்க வேண்டும்---இது @file{defconfig} கோப்பை உருவாக்கும், நாங்கள் தனிப்பயன் கர்னலை உருவாக்கப் பயன்படுத்துவோம்.

source: Below is a sample kernel package.
ta: கீழே ஒரு மாதிரி கர்னல் தொகுப்பு உள்ளது.

source: (define-public my-linux-libre (package (inherit (customize-linux #:linux linux-libre #:defconfig (local-file "defconfig"))) (name "my-linux-libre")))
ta: (define-public my-linux-libre (தொகுப்பு (பரம்பரை (தனிப்பயனாக்கு-லினக்ச் #:linux linux-libre #:defconfig (உள்ளூர்-கோப்பு "defconfig"))) (பெயர் "my-linux-libre")))

source: In the same directory as the file defining @code{my-linux-libre} is a file named @file{defconfig}. This way you can provide kernel options you want to have in the result kernel.
ta: @code{my-linux-libre}ஐ வரையறுக்கும் கோப்பின் அதே கோப்பகத்தில் @file{defconfig} என்ற கோப்பு உள்ளது. இந்த வழியில் நீங்கள் முடிவு கர்னலில் நீங்கள் விரும்பும் கர்னல் விருப்பங்களை வழங்கலாம்.

source: The second way to create a custom kernel is to pass a new value to the @code{extra-options} keyword of the @code{make-linux-libre} procedure. The @code{extra-options} keyword works with another function defined right below it:
ta: தனிப்பயன் கர்னலை உருவாக்குவதற்கான இரண்டாவது வழி, @code{make-linux-libre} செயல்முறையின் @code{extra-options} முக்கிய சொல்லுக்கு புதிய மதிப்பை அனுப்புவதாகும். @code{extra-options} திறவுச்சொல் அதன் கீழே வரையறுக்கப்பட்ட மற்றொரு செயல்பாட்டுடன் செயல்படுகிறது:

source: (define (default-extra-linux-options version) `(;; https://lists.gnu.org/archive/html/guix-devel/2014-04/msg00039.html ("CONFIG_DEVPTS_MULTIPLE_INSTANCES" . #true) ;; Modules required for initrd: ("CONFIG_NET_9P" . m) ("CONFIG_NET_9P_VIRTIO" . m) ("CONFIG_VIRTIO_BLK" . m) ("CONFIG_VIRTIO_NET" . m) ("CONFIG_VIRTIO_PCI" . m) ("CONFIG_VIRTIO_BALLOON" . m) ("CONFIG_VIRTIO_MMIO" . m) ("CONFIG_FUSE_FS" . m) ("CONFIG_CIFS" . m) ("CONFIG_9P_FS" . m)))
ta: (வரையறுக்கவும் (default-extra-linux-options பதிப்பு) `(;; https://lists.gnu.org/archive/html/guix-devel/2014-04/msg00039.html ("CONFIG_DEVPTS_MULTIPLE_INSTANCES" . #true) ;; initrd க்கு தேவையான தொகுதிகள்: ("CONFIG_NET_9P" . மீ) ("CONFIG_NET_9P_VIRTIO" . மீ) ("CONFIG_VIRTIO_BLK" . மீ) ("CONFIG_VIRTIO_NET" . மீ) ("CONFIG_VIRTIO_PCI" . மீ) ("CONFIG_VIRTIO_BALLOON" . மீ) ("CONFIG_VIRTIO_MMIO" . மீ) ("CONFIG_FUSE_FS" . மீ) ("CONFIG_CIFS" . மீ) ("CONFIG_9P_FS" . மீ)))

source: (define (config->string options) (string-join (map (match-lambda ((option . 'm) (string-append option "=m")) ((option . #true) (string-append option "=y")) ((option . #false) (string-append option "=n"))) options) "\n"))
ta: (வரையறுக்கவும் (config-> சரம் விருப்பங்கள்) (string-join (வரைபடம்) (மேட்ச்-லாம்ப்டா (விருப்பம் . 'm) (string-append விருப்பம் "=m")) (விருப்பம். #உண்மை) (string-append விருப்பம் "=y")) (விருப்பம். #தவறு) (string-append விருப்பம் "=n"))) விருப்பங்கள்) "\n"))

source: And in the custom configure script from the `make-linux-libre` package:
ta: மேலும் தனிப்பயன் உள்ளமைவு ச்கிரிப்ட்டில் `make-linux-libre` தொகுப்பிலிருந்து:

source: ;; Appending works even when the option wasn't in the ;; file. The last one prevails if duplicated. (let ((port (open-file ".config" "a")) (extra-configuration ,(config->string extra-options))) (display extra-configuration port) (close-port port))
ta: ;; ஆப்சன் இல்லாவிட்டாலும் சேர்ப்பது வேலை செய்கிறது ;; கோப்பு. நகலெடுக்கப்பட்டால் கடைசியானது மேலோங்கும். ((போர்ட் (open-file ".config""a")) (கூடுதல் கட்டமைப்பு ,(config-> சரம் கூடுதல் விருப்பங்கள்))) (காட்சி கூடுதல் கட்டமைப்பு துறைமுகம்) (நெருங்கிய துறைமுக துறைமுகம்)

source: (invoke "make" "oldconfig")
ta: ("make" "oldconfig" ஐ அழைக்கவும்)

source: So by not providing a configuration-file the @file{.config} starts blank, and then we write into it the collection of flags that we want. Here's another custom kernel:
ta: எனவே உள்ளமைவு-கோப்பை வழங்காததன் மூலம் @file{.config} காலியாகத் தொடங்குகிறது, பின்னர் அதில் நமக்குத் தேவையான கொடிகளின் தொகுப்பை எழுதுகிறோம். இதோ மற்றொரு தனிப்பயன் கர்னல்:

source: (define %macbook41-full-config (append %macbook41-config-options %file-systems %efi-support %emulation ((@@@@ (gnu packages linux) default-extra-linux-options) version)))
ta: (%macbook41-full-config ஐ வரையறுக்கவும் (%macbook41-config-options ஐச் சேர்க்கவும் %கோப்பு முறைமைகள் %efi-ஆதரவு % முன்மாதிரி ((@@@@ (gnu தொகுப்புகள் லினக்ச்) default-extra-linux-options) பதிப்பு)))

source: (define-public linux-libre-macbook41 ;; XXX: Access the internal 'make-linux-libre*' procedure, which is ;; private and unexported, and is liable to change in the future. ((@@@@ (gnu packages linux) make-linux-libre*) (@@@@ (gnu packages linux) linux-libre-version) (@@@@ (gnu packages linux) linux-libre-gnu-revision) (@@@@ (gnu packages linux) linux-libre-source) '("x86_64-linux") #:extra-version "macbook41" #:extra-options %macbook41-config-options))
ta: (define-public linux-libre-macbook41 ;; XXX: அக 'make-linux-libre*' செயல்முறையை அணுகவும், அதாவது ;; தனிப்பட்ட மற்றும் ஏற்றுமதி செய்யப்படாதது, மேலும் எதிர்காலத்தில் மாற்றத்திற்கு உட்பட்டது. ((@@@@ (gnu தொகுப்புகள் லினக்ச்) make-linux-libre*) (@@@@ (gnu தொகுப்புகள் லினக்ச்) linux-libre-version) (@@@@ (gnu தொகுப்புகள் லினக்ச்) linux-libre-gnu-revision) (@@@@ (gnu தொகுப்புகள் லினக்ச்) linux-libre-source) '("x86_64-linux") #:கூடுதல் பதிப்பு "macbook41" #:கூடுதல்-விருப்பங்கள் %macbook41-config-options))
