Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: Alternatively, you could use the @command{ykman-gui} command provided by the @code{yubikey-manager-qt} package and either wholly disable the @samp{OTP} application for the USB interface or, from the @samp{Applications -> OTP} view, delete the slot 1 configuration, which comes pre-configured with the Yubico OTP application.
ta: மாற்றாக, நீங்கள் @code{yubikey-manager-qt} தொகுப்பின் மூலம் வழங்கப்படும் @command{ykman-gui} கட்டளையைப் பயன்படுத்தலாம் மற்றும் USB இடைமுகத்திற்கான @samp{OTP} பயன்பாட்டை முழுவதுமாக முடக்கலாம் அல்லது @samp{Applications -> OTP} பார்வையிலிருந்து, ச்லாட் 1 உள்ளமைவுடன் OTP உள்ளமைவுடன் வரும் ச்லாட் 1 பயன்பாட்டை நீக்கவும்.

source: Requiring a Yubikey to open a KeePassXC database
ta: KeePassXC தரவுத்தளத்தைத் திறக்க யூபிகே தேவை

source: yubikey, keepassxc integration
ta: yubikey, Keepassxc ஒருங்கிணைப்பு

source: The KeePassXC password manager application has support for Yubikeys, but it requires installing a udev rules for your Guix System and some configuration of the Yubico OTP application on the key.
ta: கீபாச்எக்ச்சி பாச்வேர்டு மேனேசர் அப்ளிகேசன் யூபிக்கெய்சிற்கான ஆதரவைக் கொண்டுள்ளது, ஆனால் அதற்கு உங்களின் Guix சிச்டத்திற்கான udev விதிகள் மற்றும் விசையில் Yubico OTP பயன்பாட்டின் சில உள்ளமைவுகளை நிறுவ வேண்டும்.

source: The necessary udev rules file comes from the @code{yubikey-personalization} package, and can be installed like:
ta: தேவையான udev ரூல்ச் கோப்பு @code{yubikey-personalization} தொகுப்பிலிருந்து வருகிறது, மேலும் இதை இப்படி நிறுவலாம்:

source: (use-package-modules ... security-token ...) ... (operating-system ... (services (cons* ... (udev-rules-service 'yubikey yubikey-personalization))))
ta: (பயன்பாடு-தொகுப்பு-தொகுதிகள் ... பாதுகாப்பு-டோக்கன் ...) ... (இயக்க அமைப்பு ... (சேவைகள் (தீமைகள்* ... (udev-rules-service 'yubikey yubikey-personalization))))

source: After reconfiguring your system (and reconnecting your Yubikey), you'll then want to configure the OTP challenge/response application of your Yubikey on its slot 2, which is what KeePassXC uses. It's easy to do so via the Yubikey Manager graphical configuration tool, which can be invoked with:
ta: உங்கள் கணினியை மறுகட்டமைத்த பிறகு (உங்கள் யூபிகேயை மீண்டும் இணைத்த பிறகு), அதன் ச்லாட் 2 இல் உங்கள் யூபிகேயின் OTP சவால்/பதிலளிப்பு பயன்பாட்டை உள்ளமைக்க வேண்டும், இதையே KeePassXC பயன்படுத்துகிறது. Yubikey Manager வரைகலை உள்ளமைவுக் கருவி மூலம் இதைச் செய்வது எளிது, இதைப் பயன்படுத்தலாம்:

source: guix shell yubikey-manager-qt -- ykman-gui
ta: guix செல் yubikey-manager-qt -- ykman-gui

source: First, ensure @samp{OTP} is enabled under the @samp{Interfaces} tab, then navigate to @samp{Applications -> OTP}, and click the @samp{Configure} button under the @samp{Long Touch (Slot 2)} section. Select @samp{Challenge-response}, input or generate a secret key, and click the @samp{Finish} button. If you have a second Yubikey you'd like to use as a backup, you should configure it the same way, using the @emph{same} secret key.
ta: முதலில், @samp{OTP} என்பது @samp{Interfaces} தாவலின் கீழ் இயக்கப்பட்டிருப்பதை உறுதிசெய்து, பின்னர் @samp{Applications -> OTP}க்கு செல்லவும், @samp{Long Touch (Slot 2)} பிரிவின் கீழ் @samp{Configure} பொத்தானைக் சொடுக்கு செய்யவும். @samp{Challenge-response} என்பதைத் தேர்ந்தெடுத்து, ரகசிய விசையை உள்ளிடவும் அல்லது உருவாக்கவும், @samp{Finish} பொத்தானைக் சொடுக்கு செய்யவும். நீங்கள் காப்புப்பிரதியாகப் பயன்படுத்த விரும்பும் இரண்டாவது Yubikey உங்களிடம் இருந்தால், @emph{same} ரகசிய விசையைப் பயன்படுத்தி அதை அதே வழியில் உள்ளமைக்க வேண்டும்.

source: Your Yubikey should now be detected by KeePassXC. It can be added to a database by navigating to KeePassXC's @samp{Database -> Database Security...} menu, then clicking the @samp{Add additional protection...} button, then @samp{Add Challenge-Response}, selecting the security key from the drop-down menu and clicking the @samp{OK} button to complete the setup.
ta: உங்கள் Yubikey இப்போது KeePassXC ஆல் கண்டறியப்பட வேண்டும். KeePassXC இன் @samp{டேட்டாபேச் -> டேட்டாபேச் செக்யூரிட்டி...} மெனுவிற்குச் சென்று, பின்னர் @samp{Add additional protection...} பொத்தானைக் சொடுக்கு செய்து, பின்னர் @samp{சேலஞ்ச்-பதிலளிப்பை} சொடுக்கு செய்து, கீழ்தோன்றும் மெனுவிலிருந்து பாதுகாப்பு விசையைத் தேர்ந்தெடுத்து, @s ஐ செட்அப் செய்து முடிக்க, @s ஐ முடிக்க, அதை ஒரு தரவுத்தளத்தில் சேர்க்கலாம்.

source: dynamic DNS, DDNS
ta: மாறும் டிஎன்எச், டிடிஎன்எச்

source: If your @acronym{ISP, Internet Service Provider} only provides dynamic IP addresses, it can be useful to setup a dynamic @acronym{DNS, Domain Name System} (also known as @acronym{DDNS, Dynamic DNS}) service to associate a static host name to a public but dynamic (often changing) IP address. There are multiple existing services that can be used for this; in the following mcron job, @url{https://duckdns.org, DuckDNS} is used. It should also work with other dynamic DNS services that offer a similar interface to update the IP address, such as @url{https://freedns.afraid.org/}, with minor adjustments.
ta: உங்கள் @Acronym{ISP, Internet பணி Provider} ஆனது மாறும் ஐபி முகவரிகளை மட்டுமே வழங்கினால், நிலையான புரவலன் பெயரை பொது முகவரியுடன் இணைக்க, மாறும் @acronym{DNS, Domain பெயர் System} (@acronym{DDNS, Dynamic DNS}) சேவையை அமைப்பது பயனுள்ளதாக இருக்கும். இதற்குப் பயன்படுத்தக்கூடிய பல சேவைகள் உள்ளன; பின்வரும் mcron வேலையில், @url{https://duckdns.org, DuckDNS} பயன்படுத்தப்படுகிறது. சிறிய மாற்றங்களுடன் @url{https://freedns.afraid.org/} போன்ற ஐபி முகவரியைப் புதுப்பிக்க இதேபோன்ற இடைமுகத்தை வழங்கும் பிற மாறும் டிஎன்எச் சேவைகளுடனும் இது செயல்பட வேண்டும்.

source: The mcron job is provided below, where @var{DOMAIN} should be substituted for your own domain prefix, and the DuckDNS provided token associated to @var{DOMAIN} added to the @file{/etc/duckdns/@var{DOMAIN}.token} file.
ta: mcron வேலை கீழே கொடுக்கப்பட்டுள்ளது, இங்கு @var{DOMAIN} என்பது உங்கள் சொந்த டொமைன் முன்னொட்டிற்கு மாற்றாக இருக்க வேண்டும், மேலும் @var{DOMAIN} உடன் தொடர்புடைய DuckDNS வழங்கிய கிள்ளாக்கு @file{/etc/duckdns/@var{DOMAIN}.token} கோப்பில் சேர்க்கப்பட்டது.

source: (define duckdns-job ;; Update personal domain IP every 5 minutes. #~(job '(next-minute (range 0 60 5)) #$(program-file "duckdns-update" (with-extensions (list guile-gnutls) ;required by (web client) #~(begin (use-modules (ice-9 textual-ports) (web client)) (let ((token (string-trim-both (call-with-input-file "/etc/duckdns/@var{DOMAIN}.token" get-string-all))) (query-template (string-append "https://www.duckdns.org/" "update?domains=@var{DOMAIN}" "&token=~a&ip="))) (http-get (format #f query-template token)))))) "duckdns-update" #:user "nobody"))
ta: (duckdns-job ஐ வரையறுக்கவும் ;; ஒவ்வொரு 5 நிமிடங்களுக்கும் தனிப்பட்ட டொமைன் ஐபியைப் புதுப்பிக்கவும். #~(வேலை '(அடுத்த மணித்துளி (வரம்பு 0 60 5)) #$(நிரல்-கோப்பு "duckdns-update" (நீட்டிப்புகளுடன் (list guile-gnutls) ;(இணைய கிளையன்ட்) மூலம் தேவை #~(தொடங்கு (பயன்பாடு-தொகுதிகள் (பனி-9 உரை-துறைமுகங்கள்) (வலை கிளையன்ட்)) ((டோக்கன் (ச்ட்ரிங்-டிரிம்-இரண்டும்). (call-with-input-file "/etc/duckdns/@var{DOMAIN}.token" எல்லாத்தையும் பெறு))) (query-template (string-append "https://www.duckdns.org/" "update?domains=@var{DOMAIN}" "&டோக்கன்=~a&ip="))) (http-get (format #f query-template token)))))) "duckdns-update" #:பயனர் "யாரும்"))

source: The job then needs to be added to the list of mcron jobs for your system, using something like:
ta: உங்கள் கணினிக்கான மெக்ரான் வேலைகளின் பட்டியலில் வேலை சேர்க்கப்பட வேண்டும், இது போன்ற ஒன்றைப் பயன்படுத்தி:

source: (operating-system (services (cons* (service mcron-service-type (mcron-configuration (jobs (list duckdns-job ...)))) ... %base-services)))
ta: (இயக்க அமைப்பு (சேவைகள் (தீமைகள்* (சேவை மெக்ரான்-சேவை-வகை (mcron-configuration (வேலைகள் (பட்டியல் duckdns-வேலை ...)))) ... %அடிப்படை-சேவைகள்)))

source: To connect to a Wireguard VPN server you need the kernel module to be loaded in memory and a package providing networking tools that support it (e.g. @code{wireguard-tools} or @code{network-manager}).
ta: Wireguard VPN சேவையகத்துடன் இணைக்க, நினைவகத்தில் கர்னல் தொகுதியை ஏற்ற வேண்டும் மற்றும் அதை ஆதரிக்கும் நெட்வொர்க்கிங் கருவிகளை வழங்கும் தொகுப்பு (எ.கா. @code{wireguard-tools} அல்லது @code{network-manager}).

source: Here is a configuration example for Linux-Libre < 5.6, where the module is out of tree and need to be loaded manually---following revisions of the kernel have it built-in and so don't need such configuration:
ta: Linux-Libre <5.6 க்கான உள்ளமைவு எடுத்துக்காட்டு இங்கே உள்ளது, அங்கு தொகுதி மரத்திற்கு வெளியே உள்ளது மற்றும் கைமுறையாக ஏற்றப்பட வேண்டும் - கர்னலின் திருத்தங்களைத் தொடர்ந்து அது உள்ளமைக்கப்பட்டுள்ளது, எனவே அத்தகைய கட்டமைப்பு தேவையில்லை:

source: (use-modules (gnu)) (use-service-modules desktop) (use-package-modules vpn)
ta: (பயன்படுத்தும் தொகுதிகள் (gnu)) (பயன்பாடு-சேவை-தொகுதிகள் டெச்க்டாப்) (பயன்பாடு-தொகுப்பு-தொகுதிகள் vpn)

source: (operating-system ;; … (services (cons (simple-service 'wireguard-module kernel-module-loader-service-type '("wireguard")) %desktop-services)) (packages (cons wireguard-tools %base-packages)) (kernel-loadable-modules (list wireguard-linux-compat)))
ta: (இயக்க அமைப்பு ;; … (சேவைகள் (தீமைகள் (எளிய-சேவை 'wireguard-module kernel-module-loader-service-type '("வயர்கார்ட்")) %டெச்க்டாப்-சேவைகள்)) (தொகுப்புகள் (cons wireguard-tools %base-packages)) (kernel-loadable-modules (list wireguard-linux-compat)))

source: After reconfiguring and restarting your system you can either use Wireguard tools or NetworkManager to connect to a VPN server.
ta: உங்கள் கணினியை மறுகட்டமைத்து மறுதொடக்கம் செய்த பிறகு, VPN சேவையகத்துடன் இணைக்க Wireguard கருவிகள் அல்லது NetworkManager ஐப் பயன்படுத்தலாம்.

source: Using Wireguard tools
ta: வயர்கார்ட் கருவிகளைப் பயன்படுத்துதல்

source: To test your Wireguard setup it is convenient to use @command{wg-quick}. Just give it a configuration file @command{wg-quick up ./wg0.conf}; or put that file in @file{/etc/wireguard} and run @command{wg-quick up wg0} instead.
ta: உங்கள் Wireguard அமைப்பைச் சோதிக்க, @command{wg-quick}ஐப் பயன்படுத்துவது வசதியானது. @command{wg-quick மேலே ./wg0.conf} என்ற உள்ளமைவுக் கோப்பைக் கொடுங்கள்; அல்லது அந்தக் கோப்பை @file{/etc/wireguard} இல் வைத்து, அதற்குப் பதிலாக @command{wg-quick மேலே wg0}ஐ இயக்கவும்.

source: Be warned that the author described this command as a: “[…] very quick and dirty bash script […]”.
ta: ஆசிரியர் இந்தக் கட்டளையை இவ்வாறு விவரித்தார்: “[…] மிக விரைவான மற்றும் அழுக்கான பாச் ச்கிரிப்ட் […]”.

source: Using NetworkManager
ta: NetworkManager ஐப் பயன்படுத்துதல்

source: Thanks to NetworkManager support for Wireguard we can connect to our VPN using @command{nmcli} command. Up to this point this guide assumes that you're using Network Manager service provided by @code{%desktop-services}. Ortherwise you need to adjust your services list to load @code{network-manager-service-type} and reconfigure your Guix system.
ta: Wireguardக்கான NetworkManager ஆதரவுக்கு நன்றி @command{nmcli} கட்டளையைப் பயன்படுத்தி எங்கள் VPN உடன் இணைக்க முடியும். இது வரை @code{%desktop-services} வழங்கிய பிணையம் மேலாளர் சேவையை நீங்கள் பயன்படுத்துகிறீர்கள் என்று இந்த வழிகாட்டி கருதுகிறது. இல்லையெனில், @code{network-manager-service-type}ஐ ஏற்றுவதற்கும் உங்கள் Guix அமைப்பை மறுகட்டமைப்பதற்கும் உங்கள் சேவைப் பட்டியலைச் சரிசெய்ய வேண்டும்.

source: To import your VPN configuration execute nmcli import command:
ta: உங்கள் VPN உள்ளமைவை இறக்குமதி செய்ய, nmcli இறக்குமதி கட்டளையை இயக்கவும்:

source: # nmcli connection import type wireguard file wg0.conf Connection 'wg0' (edbee261-aa5a-42db-b032-6c7757c60fde) successfully added
ta: # nmcli இணைப்பு இறக்குமதி வகை வயர்கார்ட் கோப்பு wg0.conf இணைப்பு 'wg0' (edbee261-aa5a-42db-b032-6c7757c60fde) வெற்றிகரமாக சேர்க்கப்பட்டது

source: This will create a configuration file in @file{/etc/NetworkManager/wg0.nmconnection}. Next connect to the Wireguard server:
ta: இது @file{/etc/NetworkManager/wg0.nmconnection} இல் உள்ளமைவு கோப்பை உருவாக்கும். அடுத்து Wireguard சேவையகத்துடன் இணைக்கவும்:

source: $ nmcli connection up wg0 Connection successfully activated (D-Bus active path: /org/freedesktop/NetworkManager/ActiveConnection/6)
ta: $ nmcli இணைப்பு வரை wg0 இணைப்பு வெற்றிகரமாக செயல்படுத்தப்பட்டது (டி-பச் செயலில் உள்ள பாதை: /org/freedesktop/NetworkManager/ActiveConnection/6)

source: By default NetworkManager will connect automatically on system boot. To change that behaviour you need to edit your config:
ta: முன்னிருப்பாக NetworkManager கணினி துவக்கத்தில் தானாகவே இணைக்கப்படும். அந்த நடத்தையை மாற்ற, உங்கள் கட்டமைப்பை நீங்கள் திருத்த வேண்டும்:

source: # nmcli connection modify wg0 connection.autoconnect no
ta: # nmcli இணைப்பு wg0 இணைப்பை மாற்றவும்.autoconnect எண்

source: For more specific information about NetworkManager and wireguard @uref{https://blogs.gnome.org/thaller/2019/03/15/wireguard-in-networkmanager/,see this post by thaller}.
ta: NetworkManager மற்றும் wireguard @uref{https://blogs.gnome.org/thaller/2019/03/15/wireguard-in-networkmanager/ பற்றிய மேலும் குறிப்பிட்ட தகவலுக்கு, thaller இன் இந்த இடுகையைப் பார்க்கவும்.

source: stumpwm
ta: ச்டம்ப்

source: You could install StumpWM with a Guix system by adding @code{stumpwm} and optionally @code{`(,stumpwm "lib")} packages to a system configuration file, e.g.@: @file{/etc/config.scm}.
ta: சிச்டம் உள்ளமைவு கோப்பில் @code{stumpwm} மற்றும் விருப்பமாக @code{`(,stumpwm "lib")} தொகுப்புகளை சேர்ப்பதன் மூலம் Guix சிச்டத்துடன் StumpWM ஐ நிறுவலாம், எ.கா.@: @file{/etc/config.scm}.

source: An example configuration can look like this:
ta: ஒரு எடுத்துக்காட்டு உள்ளமைவு இப்படி இருக்கலாம்:

source: (use-modules (gnu)) (use-package-modules wm)
ta: (பயன்படுத்தும் தொகுதிகள் (gnu)) (பயன்பாடு-தொகுப்பு-தொகுதிகள் wm)

source: (operating-system ;; … (packages (append (list sbcl stumpwm `(,stumpwm "lib")) %base-packages)))
ta: (இயக்க அமைப்பு ;; … (தொகுப்புகள் (இணைப்பு ( பட்டியல் sbcl stumpwm `(,stumpwm "lib""))) %அடிப்படை தொகுப்புகள்)))

source: stumpwm fonts
ta: stumpwm எழுத்துருக்கள்

source: By default StumpWM uses X11 fonts, which could be small or pixelated on your system. You could fix this by installing StumpWM contrib Lisp module @code{sbcl-ttf-fonts}, adding it to Guix system packages:
ta: இயல்பாக StumpWM X11 எழுத்துருக்களைப் பயன்படுத்துகிறது, அவை உங்கள் கணினியில் சிறியதாகவோ அல்லது பிக்சலேட்டாகவோ இருக்கலாம். StumpWM contrib Lisp தொகுதி @code{sbcl-ttf-fonts}ஐ நிறுவி, Guix சிச்டம் தொகுப்புகளில் சேர்ப்பதன் மூலம் இதை நீங்கள் சரிசெய்யலாம்:

source: (use-modules (gnu)) (use-package-modules fonts wm)
ta: (பயன்படுத்தும் தொகுதிகள் (gnu)) (பயன்பாடு-தொகுப்பு-தொகுதிகள் எழுத்துருக்கள் wm)

source: (operating-system ;; … (packages (append (list sbcl stumpwm `(,stumpwm "lib")) sbcl-ttf-fonts font-dejavu %base-packages)))
ta: (இயக்க அமைப்பு ;; … (தொகுப்புகள் (இணைப்பு ( பட்டியல் sbcl stumpwm `(,stumpwm "lib""))) sbcl-ttf-fonts font-dejavu %base-packages)))

source: Then you need to add the following code to a StumpWM configuration file @file{~/.stumpwm.d/init.lisp}:
ta: பிறகு பின்வரும் குறியீட்டை StumpWM உள்ளமைவு கோப்பில் @file{~/.stumpwm.d/init.lisp} சேர்க்க வேண்டும்:

source: (require :ttf-fonts) (setf xft:*font-dirs* '("/run/current-system/profile/share/fonts/")) (setf clx-truetype:+font-cache-filename+ (concat (getenv "HOME") "/.fonts/font-cache.sexp")) (xft:cache-fonts) (set-font (make-instance 'xft:font :family "DejaVu Sans Mono" :subfamily "Book" :size 11))
ta: (தேவை :ttf-fonts) (setf xft:*font-dirs* '("/run/current-system/profile/share/fonts/")) (setf clx-truetype:+font-cache-filename+ (concat (getenv "HOME") "/.fonts/font-cache.sexp")) (xft:cache-fonts) (செட்-எழுத்துரு (make-instance 'xft:font:family "DejaVu Sans Mono" :துணைக் குடும்பம் "நூல்" : அளவு 11))

source: sessionlock
ta: அமர்வுபூட்டு

source: Depending on your environment, locking the screen of your session might come built in or it might be something you have to set up yourself. If you use a desktop environment like GNOME or KDE, it's usually built in. If you use a plain window manager like StumpWM or EXWM, you might have to set it up yourself.
ta: உங்கள் சூழலைப் பொறுத்து, உங்கள் அமர்வின் திரையைப் பூட்டுவது கட்டமைக்கப்பட்டதாக இருக்கலாம் அல்லது அதை நீங்களே அமைத்துக்கொள்ள வேண்டியதாக இருக்கலாம். நீங்கள் GNOME அல்லது KDE போன்ற டெச்க்டாப் சூழலைப் பயன்படுத்தினால், அது பொதுவாக உள்ளமைக்கப்பட்டிருக்கும். StumpWM அல்லது EXWM போன்ற எளிய சாளர மேலாளரைப் பயன்படுத்தினால், அதை நீங்களே அமைக்க வேண்டும்.

source: If you use Xorg, you can use the utility @uref{https://www.mankier.com/1/xss-lock, xss-lock} to lock the screen of your session. xss-lock is triggered by DPMS which since Xorg 1.8 is auto-detected and enabled if ACPI is also enabled at kernel runtime.
ta: நீங்கள் Xorg ஐப் பயன்படுத்தினால், உங்கள் அமர்வின் திரையைப் பூட்ட @uref{https://www.mankier.com/1/xss-lock, xss-lock} பயன்பாட்டைப் பயன்படுத்தலாம். xss-lock ஆனது DPMS ஆல் தூண்டப்படுகிறது, இது Xorg 1.8 தானாகவே கண்டறியப்பட்டு, கர்னல் இயக்க நேரத்தில் ACPI இயக்கப்பட்டிருந்தால் இயக்கப்படும்.

source: To use xss-lock, you can simple execute it and put it into the background before you start your window manager from e.g. your @file{~/.xsession}:
ta: xss-lock ஐப் பயன்படுத்த, உங்கள் சாளர மேலாளரைத் தொடங்குவதற்கு முன், அதை எளிதாக இயக்கலாம் மற்றும் பின்னணியில் வைக்கலாம் எ.கா. உங்கள் @file{~/.xsession}:

source: xss-lock -- slock & exec stumpwm
ta: xss-lock -- slock & exec ச்டம்ப்

source: In this example, xss-lock uses @code{slock} to do the actual locking of the screen when it determines it's appropriate, like when you suspend your device.
ta: இந்த எடுத்துக்காட்டில், xss-lock ஆனது @code{slock} ஐப் பயன்படுத்தி, உங்கள் சாதனத்தை இடைநிறுத்துவது போன்று, அது பொருத்தமானது என்பதைத் தீர்மானிக்கும் போது, திரையின் உண்மையான பூட்டுதலைச் செய்ய.

source: For slock to be allowed to be a screen locker for the graphical session, it needs to be made setuid-root so it can authenticate users, and it needs a PAM service. This can be achieved by adding the following service to your @file{config.scm}:
ta: வரைகலை அமர்வுக்கான ச்லாக் ச்க்ரீன் லாக்கராக அனுமதிக்கப்படுவதற்கு, அது செட்யூட்-ரூட் ஆக்கப்பட வேண்டும், அதனால் பயனர்களை அங்கீகரிக்க முடியும், மேலும் அதற்கு பாம் சேவையும் தேவை. உங்கள் @file{config.scm} இல் பின்வரும் சேவையைச் சேர்ப்பதன் மூலம் இதை அடையலாம்:

source: (service screen-locker-service-type (screen-locker-configuration (name "slock") (program (file-append slock "/bin/slock"))))
ta: (service screen-locker-service-type (screen-locker-configuration (name "பாபூட்டு") (program (file-append slock "/தொட்டி/பாபூட்டு"))))

source: If you manually lock your screen, e.g. by directly calling slock when you want to lock your screen but not suspend it, it's a good idea to notify xss-lock about this so no confusion occurs. This can be done by executing @code{xset s activate} immediately before you execute slock.
ta: உங்கள் திரையை கைமுறையாகப் பூட்டினால், எ.கா. உங்கள் திரையைப் பூட்ட வேண்டும் ஆனால் அதை இடைநிறுத்தாமல் இருக்க ச்லாக்கை நேரடியாக அழைப்பதன் மூலம், இது குறித்து xss-lock க்கு அறிவிப்பது நல்லது, அதனால் எந்த குழப்பமும் ஏற்படாது. ச்லாக்கை இயக்கும் முன் உடனடியாக @code{xset s activate} ஐ இயக்குவதன் மூலம் இதைச் செய்யலாம்.

source: linode, Linode
ta: லினோட், லினோட்

source: To run Guix on a server hosted by @uref{https://www.linode.com, Linode}, start with a recommended Debian server. We recommend using the default distro as a way to bootstrap Guix. Create your SSH keys.
ta: @uref{https://www.linode.com, Linode} வழங்கும் சேவையகத்தில் Guix ஐ இயக்க, பரிந்துரைக்கப்பட்ட Debian சேவையகத்துடன் தொடங்கவும். Guix ஐ தொடக்கவார் செய்வதற்கான ஒரு வழியாக இயல்புநிலை டிச்ட்ரோவைப் பயன்படுத்த பரிந்துரைக்கிறோம். உங்கள் பாஓடு விசைகளை உருவாக்கவும்.

source: Be sure to add your SSH key for easy login to the remote server. This is trivially done via Linode's graphical interface for adding SSH keys. Go to your profile and click add SSH Key. Copy into it the output of:
ta: ரிமோட் சர்வரில் எளிதாக உள்நுழைய உங்கள் பாஓடு விசையைச் சேர்க்க மறக்காதீர்கள். இது பாஓடு விசைகளைச் சேர்ப்பதற்காக லினோடின் வரைகலை இடைமுகம் வழியாக அற்பமாக செய்யப்படுகிறது. உங்கள் சுயவிவரத்திற்குச் சென்று, பாஓடு விசையைச் சேர் என்பதைக் சொடுக்கு செய்யவும். இதன் வெளியீட்டை அதில் நகலெடுக்கவும்:

source: cat ~/.ssh/<username>_rsa.pub
ta: பூனை ~/.ssh/<பயனர்பெயர்>_rsa.pub

source: Power the Linode down.
ta: லினோடைக் குறைக்கவும்.

source: In the Linode's Storage tab, resize the Debian disk to be smaller. 30 GB free space is recommended. Then click "Add a disk", and fill out the form with the following:
ta: லினோடின் சேமிப்பக தாவலில், டெபியன் வட்டின் அளவை சிறியதாக மாற்றவும். 30 சிபி இலவச இடம் பரிந்துரைக்கப்படுகிறது. பின்னர் "ஒரு வட்டைச் சேர்" என்பதைக் சொடுக்கு செய்து, பின்வருவனவற்றைக் கொண்டு படிவத்தை நிரப்பவும்:

source: Label: "Guix"
ta: லேபிள்: "பிளாச்டர்"

source: Filesystem: ext4
ta: கோப்பு முறைமை: ext4

source: Set it to the remaining size
ta: மீதமுள்ள அளவு அதை அமைக்கவும்

source: In the Configurations tab, press "Edit" on the default Debian profile. Under "Block Device Assignment" click "Add a Device". It should be @file{/dev/sdc} and you can select the "Guix" disk. Save Changes.
ta: கட்டமைப்புகள் தாவலில், இயல்புநிலை டெபியன் சுயவிவரத்தில் "திருத்து" என்பதை அழுத்தவும். "பிளாக் டிவைச் அசைன்மென்ட்" என்பதன் கீழ் "சாதனத்தைச் சேர்" என்பதைக் சொடுக்கு செய்யவும். அது @file{/dev/sdc} ஆக இருக்க வேண்டும் மேலும் நீங்கள் "Guix" வட்டைத் தேர்ந்தெடுக்கலாம். மாற்றங்களைச் சேமிக்கவும்.

source: Now "Add a Configuration", with the following:
ta: இப்போது "ஒரு கட்டமைப்பைச் சேர்", பின்வருவனவற்றைக் கொண்டு:

source: Label: Guix
ta: லேபிள்: பிளாச்டர்

source: Kernel:GRUB 2 (it's at the bottom! This step is @b{IMPORTANT!})
ta: கர்னல்:GRUB 2 (இது கீழே உள்ளது! இந்த படி @b{முக்கியமானது!})

source: Block device assignment:
ta: சாதன ஒதுக்கீட்டைத் தடு:

source: @file{/dev/sda}: Guix
ta: @file{/dev/sda}: சுண்ணாம்பு

source: @file{/dev/sdb}: swap
ta: @file{/dev/sdb}: இடமாற்று

source: Root device: @file{/dev/sda}
ta: ரூட் சாதனம்: @file{/dev/sda}

source: Turn off all the filesystem/boot helpers
ta: அனைத்து கோப்பு முறைமை/பூட் உதவியாளர்களையும் அணைக்கவும்

source: Now power it back up, booting with the Debian configuration. Once it's running, ssh to your server via @code{ssh root@@@var{<your-server-IP-here>}}. (You can find your server IP address in your Linode Summary section.) Now you can run the "install guix from @pxref{Binary Installation,,, guix, GNU Guix}" steps:
ta: இப்போது டெபியன் உள்ளமைவுடன் அதை மீண்டும் இயக்கவும். அது இயங்கியதும், @code{ssh root@@@var{<your-server-IP-here>}} வழியாக உங்கள் சர்வருக்கு பாஓடு அனுப்பவும். (உங்கள் லினோட் சுருக்கம் பிரிவில் உங்கள் சர்வர் ஐபி முகவரியைக் காணலாம்.) இப்போது நீங்கள் "@pxref{Binary Installation,,, guix, GNU Guix} இலிருந்து guix ஐ நிறுவு" படிகளை இயக்கலாம்:

source: sudo apt-get install gpg wget https://sv.gnu.org/people/viewgpg.php?user_id=15145 -qO - | gpg --import - wget https://git.savannah.gnu.org/cgit/guix.git/plain/etc/guix-install.sh chmod +x guix-install.sh ./guix-install.sh guix pull
ta: sudo apt-get install gpg wget https://sv.gnu.org/people/viewgpg.php?user_id=15145 -qO - | சிபிசி --இறக்குமதி - wget https://git.savannah.gnu.org/cgit/guix.git/plain/etc/guix-install.sh chmod +x guix-install.sh ./guix-install.sh guix இழுப்பு

source: Now it's time to write out a config for the server. The key information is below. Save the resulting file as @file{guix-config.scm}.
ta: சேவையகத்திற்கான கட்டமைப்பை எழுத வேண்டிய நேரம் இது. முக்கிய தகவல்கள் கீழே உள்ளன. இதன் விளைவாக வரும் கோப்பை @file{guix-config.scm} ஆக சேமிக்கவும்.

source: (use-modules (gnu) (guix modules)) (use-service-modules networking ssh) (use-package-modules admin package-management ssh tls)
ta: (பயன்படுத்தும் தொகுதிகள் (gnu) (guix தொகுதிகள்)) (பயன்-சேவை-தொகுதிகள் நெட்வொர்க்கிங் ssh) (பயன்பாடு-தொகுப்பு-தொகுதிகள் நிர்வாகி தொகுப்பு மேலாண்மை ssh tls)
