Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: gexps, syntax
ta: gexps, தொடரியல்

source: Guix defines a variant of S-expressions on steroids called @dfn{G-expressions} or ``gexps'', which come with a variant of @code{quasiquote} and @code{unquote}: @code{#~} (or @code{gexp}) and @code{#$} (or @code{ungexp}). They let you @emph{stage code for later execution}.
ta: @dfn{G-expressions} அல்லது ``gexps'' எனப்படும் ச்டீராய்டுகளில் S-எக்ச்பிரசன்களின் மாறுபாட்டை Guix வரையறுக்கிறது, இது @code{quasiquote} மற்றும் @code{unquote}: @code{#~} (அல்லது @code{gexp}) மற்றும் @code{#$} (அல்லது @code{#$}) அவர்கள் @emph{ungexp} அனுமதிக்கிறார்கள்.

source: For example, you'll encounter gexps in some package definitions where they provide code to be executed during the package build process. They look like this:
ta: எடுத்துக்காட்டாக, சில தொகுப்பு வரையறைகளில் நீங்கள் gexps ஐ சந்திப்பீர்கள், அங்கு அவை தொகுப்பு உருவாக்க செயல்முறையின் போது செயல்படுத்தப்பட வேண்டிய குறியீட்டை வழங்குகின்றன. அவை இப்படி இருக்கும்:

source: (use-modules (guix gexp) ;so we can write gexps (gnu packages base)) ;for 'coreutils'
ta: (use-modules (guix gexp) ;எனவே நாம் gexps எழுதலாம் (gnu packages base)) ;'coreutils'க்கு

source: ;; Below is a G-expression representing staged code. #~(begin ;; Invoke 'ls' from the package defined by the 'coreutils' ;; variable. (system* #$(file-append coreutils "/bin/ls") "-l")
ta: ;; ச்டேச் செய்யப்பட்ட குறியீட்டைக் குறிக்கும் சி-எக்ச்பிரசன் கீழே உள்ளது. #~(தொடங்கு ;; 'coreutils' மூலம் வரையறுக்கப்பட்ட தொகுப்பிலிருந்து 'ls' ஐ அழைக்கவும் ;; மாறி. (கணினி* #$(கோப்பு-இணைப்பு coreutils "/bin/ls") "-l")

source: ;; Create this package's output directory. (mkdir #$output))
ta: ;; இந்த தொகுப்பின் வெளியீட்டு கோப்பகத்தை உருவாக்கவும். (mkdir #$அவுட்புட்))

source: @xref{G-Expressions,,, guix, GNU Guix Reference Manual}, for more on gexps.
ta: @xref{G-Expressions,,, guix, GNU Guix குறிப்பு Manual}, gexps பற்றி மேலும் அறிய.

source: Multiple variables can be named locally with @code{let} (@pxref{Local Bindings,,, guile, GNU Guile Reference Manual}):
ta: @code{let} (@pxref{Local Bindings,,, guile, GNU Guile Reference Manual}) மூலம் பல மாறிகளுக்கு உள்நாட்டில் பெயரிடலாம்:

source: Use @code{let*} to allow later variable declarations to refer to earlier definitions.
ta: முந்தைய வரையறைகளைக் குறிப்பிடுவதற்குப் பிற்கால மாறி அறிவிப்புகளை அனுமதிக்க @code{let*} ஐப் பயன்படுத்தவும்.

source: @dfn{Keywords} are typically used to identify the named parameters of a procedure. They are prefixed by @code{#:} (hash, colon) followed by alphanumeric characters: @code{#:like-this}. @xref{Keywords,,, guile, GNU Guile Reference Manual}.
ta: ஒரு செயல்முறையின் பெயரிடப்பட்ட அளவுருக்களை அடையாளம் காண @dfn{Keywords} பொதுவாகப் பயன்படுத்தப்படுகின்றன. அவை @code{#:} (ஆச், பெருங்குடல்) மற்றும் எண்ணெழுத்து எழுத்துக்களால் முன்னொட்டப்படுகின்றன: @code{#:like-this}. @xref{Keywords,,, guile, GNU Guile குறிப்பு Manual}.

source: The percentage @code{%} is typically used for read-only global variables in the build stage. Note that it is merely a convention, like @code{_} in C. Scheme treats @code{%} exactly the same as any other letter.
ta: @code{%} சதவிகிதம் பொதுவாக உருவாக்க நிலையில் படிக்க-மட்டும் உலகளாவிய மாறிகளுக்குப் பயன்படுத்தப்படுகிறது. C இல் உள்ள @code{_} போன்று இது ஒரு மாநாடு என்பதை நினைவில் கொள்ளவும். Scheme @code{%}ஐ வேறு எந்த எழுத்தையும் போலவே கருதுகிறது.

source: Modules are created with @code{define-module} (@pxref{Creating Guile Modules,,, guile, GNU Guile Reference Manual}). For instance
ta: தொகுதிகள் @code{define-module} மூலம் உருவாக்கப்படுகின்றன (@pxref{Creating Guile Modules,,, guile, GNU Guile குறிப்பு Manual}). உதாரணமாக

source: defines the module @code{guix build-system ruby} which must be located in @file{guix/build-system/ruby.scm} somewhere in the Guile load path. It depends on the @code{(guix store)} module and it exports two variables, @code{ruby-build} and @code{ruby-build-system}.
ta: @code{guix build-system ruby} தொகுதியை வரையறுக்கிறது, இது Guile ஏற்ற பாதையில் எங்காவது @file{guix/build-system/ruby.scm} இல் இருக்க வேண்டும். இது @code{(guix store)} தொகுதியைச் சார்ந்தது மேலும் இது @code{ruby-build} மற்றும் @code{ruby-build-system} ஆகிய இரண்டு மாறிகளை ஏற்றுமதி செய்கிறது.

source: @xref{Package Modules,,, guix, GNU Guix Reference Manual}, for info on modules that define packages.
ta: @xref{Package Modules,,, guix, GNU Guix குறிப்பு Manual}, தொகுப்புகளை வரையறுக்கும் தொகுதிகள் பற்றிய தகவலுக்கு.

source: Going further
ta: மேலும் செல்கிறது

source: Scheme is a language that has been widely used to teach programming and you'll find plenty of material using it as a vehicle. Here's a selection of documents to learn more about Scheme:
ta: திட்டம் என்பது நிரலாக்கத்தை கற்பிக்க பரவலாகப் பயன்படுத்தப்படும் ஒரு மொழியாகும், மேலும் அதை வாகனமாகப் பயன்படுத்தி ஏராளமான பொருட்களைக் காணலாம். திட்டத்தைப் பற்றி மேலும் அறிய ஆவணங்களின் தேர்வு இங்கே:

source: @uref{https://spritely.institute/static/papers/scheme-primer.html, @i{A Scheme Primer}}, by Christine Lemmer-Webber and the Spritely Institute.
ta: @uref{https://spritely.institute/static/papers/scheme-primer.html, @i{A Scheme Primer}}, கிறிச்டின் லெம்மர்-வெப்பர் மற்றும் ச்ப்ரைட்லி நிறுவனம்.

source: @uref{https://sarabander.github.io/sicp/, @i{Structure and Interpretation of Computer Programs}}, by Harold Abelson and Gerald Jay Sussman, with Julie Sussman. Colloquially known as ``SICP'', this book is a reference.
ta: @uref{https://sarabander.github.io/sicp/, @i{Structure and Interpretation of Computer Programs}}, சூலி சுச்மானுடன் அரோல்ட் அபெல்சன் மற்றும் செரால்ட் சே சுச்மேன். பேச்சு வழக்கில் ``SICP'' என்று அழைக்கப்படும் இந்தப் நூல் ஒரு குறிப்பு.

source: You can also install it and read it from your computer:
ta: நீங்கள் அதை நிறுவி உங்கள் கணினியிலிருந்தும் படிக்கலாம்:

source: You'll find more books, tutorials and other resources at @url{https://schemers.org/}.
ta: @url{https://schemers.org/} இல் கூடுதல் புத்தகங்கள், பயிற்சிகள் மற்றும் பிற ஆதாரங்களைக் காணலாம்.

source: packaging
ta: பொதியாக்கம்

source: This chapter is dedicated to teaching you how to add packages to the collection of packages that come with GNU Guix. This involves writing package definitions in Guile Scheme, organizing them in package modules, and building them.
ta: இந்த அத்தியாயம் GNU Guix உடன் வரும் தொகுப்புகளின் தொகுப்பில் தொகுப்புகளை எவ்வாறு சேர்ப்பது என்பதை உங்களுக்கு கற்பிப்பதற்காக அர்ப்பணிக்கப்பட்டுள்ளது. இது Guile திட்டத்தில் தொகுப்பு வரையறைகளை எழுதுதல், அவற்றை தொகுப்பு தொகுதிகளில் ஒழுங்கமைத்தல் மற்றும் அவற்றை உருவாக்குதல் ஆகியவை அடங்கும்.

source: GNU Guix stands out as the @emph{hackable} package manager, mostly because it uses @uref{https://www.gnu.org/software/guile/, GNU Guile}, a powerful high-level programming language, one of the @uref{https://en.wikipedia.org/wiki/Scheme_%28programming_language%29, Scheme} dialects from the @uref{https://en.wikipedia.org/wiki/Lisp_%28programming_language%29, Lisp family}.
ta: GNU Guix ஆனது @emph{hackable} தொகுப்பு நிர்வாகியாகத் தனித்து நிற்கிறது, ஏனெனில் இது @uref{https://www.gnu.org/software/guile/, GNU Guile}, ஒரு சக்திவாய்ந்த உயர்நிலை நிரலாக்க மொழி, @uref{https://en.wikipedia.org/wiki/Scheme_%28programming_language%29, Scheme} இல் இருந்து, @uref{https://en.wikipedia.org/wiki/Lisp_%28programming_language%29, Lisp குடும்பம்}.

source: Package definitions are also written in Scheme, which empowers Guix in some very unique ways, unlike most other package managers that use shell scripts or simple languages.
ta: செல் ச்கிரிப்டுகள் அல்லது எளிய மொழிகளைப் பயன்படுத்தும் பிற தொகுப்பு மேலாளர்களைப் போலல்லாமல், சில தனித்துவமான வழிகளில் Guix ஐ மேம்படுத்தும் திட்டத்தில் தொகுப்பு வரையறைகளும் எழுதப்பட்டுள்ளன.

source: Use functions, structures, macros and all of Scheme expressiveness for your package definitions.
ta: உங்கள் தொகுப்பு வரையறைகளுக்கு செயல்பாடுகள், கட்டமைப்புகள், மேக்ரோக்கள் மற்றும் அனைத்து திட்ட வெளிப்பாடுகளையும் பயன்படுத்தவும்.

source: Inheritance makes it easy to customize a package by inheriting from it and modifying only what is needed.
ta: மரபுரிமையானது, ஒரு தொகுப்பை அதிலிருந்து பெறுவதன் மூலமும், தேவையானதை மட்டும் மாற்றியமைப்பதன் மூலமும் தனிப்பயனாக்குவதை எளிதாக்குகிறது.

source: Batch processing: the whole package collection can be parsed, filtered and processed. Building a headless server with all graphical interfaces stripped out? It's possible. Want to rebuild everything from source using specific compiler optimization flags? Pass the @code{#:make-flags "..."} argument to the list of packages. It wouldn't be a stretch to think @uref{https://wiki.gentoo.org/wiki/USE_flag, Gentoo USE flags} here, but this goes even further: the changes don't have to be thought out beforehand by the packager, they can be @emph{programmed} by the user!
ta: தொகுதி செயலாக்கம்: முழு தொகுப்பு சேகரிப்பையும் பாகுபடுத்தலாம், வடிகட்டலாம் மற்றும் செயலாக்கலாம். அனைத்து வரைகலை இடைமுகங்களும் அகற்றப்பட்ட எட்லெச் சர்வரை உருவாக்குகிறீர்களா? இது நிகழக்கூடிய. குறிப்பிட்ட கம்பைலர் ஆப்டிமைசேசன் கொடிகளைப் பயன்படுத்தி மூலத்திலிருந்து அனைத்தையும் மீண்டும் உருவாக்க விரும்புகிறீர்களா? @code{#:make-flags "..."} வாதத்தை தொகுப்புகளின் பட்டியலுக்கு அனுப்பவும். இங்கே @uref{https://wiki.gentoo.org/wiki/USE_flag, Gentoo USE flags} என்று நினைப்பது ஒரு நீண்ட விசயமாக இருக்காது, ஆனால் இது இன்னும் மேலே செல்கிறது: மாற்றங்களை பேக்கேசரால் முன்பே யோசிக்க வேண்டியதில்லை, அவை பயனரால் @emph{programmed} செய்யப்படலாம்!

source: The following tutorial covers all the basics around package creation with Guix. It does not assume much knowledge of the Guix system nor of the Lisp language. The reader is only expected to be familiar with the command line and to have some basic programming knowledge.
ta: பின்வரும் பயிற்சியானது Guix உடன் தொகுப்பு உருவாக்கம் பற்றிய அனைத்து அடிப்படைகளையும் உள்ளடக்கியது. இது Guix அமைப்பு அல்லது Lisp மொழி பற்றிய அதிக அறிவைக் கொண்டிருக்கவில்லை. வாசகர் கட்டளை வரியை நன்கு அறிந்திருக்க வேண்டும் மற்றும் சில அடிப்படை நிரலாக்க அறிவு இருக்க வேண்டும் என்று எதிர்பார்க்கப்படுகிறது.

source: The ``Defining Packages'' section of the manual introduces the basics of Guix packaging (@pxref{Defining Packages,,, guix, GNU Guix Reference Manual}). In the following section, we will partly go over those basics again.
ta: கையேட்டின் ``டிஃபைனிங் பேக்கேச்கள்'' பிரிவு Guix பேக்கேசிங்கின் அடிப்படைகளை அறிமுகப்படுத்துகிறது (@pxref{Defining Packages,,, guix, GNU Guix குறிப்பு Manual}). பின்வரும் பகுதியில், அந்த அடிப்படைகளை மீண்டும் ஓரளவுக்கு மேற்கொள்வோம்.

source: GNU@tie{}Hello is a dummy project that serves as an idiomatic example for packaging. It uses the GNU build system (@code{./configure && make && make install}). Guix already provides a package definition which is a perfect example to start with. You can look up its declaration with @code{guix edit hello} from the command line. Let's see how it looks:
ta: GNU@tie{}அலோ என்பது ஒரு போலித் திட்டமாகும், இது பேக்கேசிங்கிற்கு ஒரு தனித்துவமான எடுத்துக்காட்டு. இது குனு உருவாக்க அமைப்பைப் பயன்படுத்துகிறது (@குறியீடு{./configure && செய்து && நிறுவவும்}). Guix ஏற்கனவே ஒரு தொகுப்பு வரையறையை வழங்குகிறது, இது தொடங்குவதற்கு ஒரு சிறந்த எடுத்துக்காட்டு. கட்டளை வரியிலிருந்து @code{guix edit hello} மூலம் அதன் அறிவிப்பைப் பார்க்கலாம். அது எப்படி இருக்கிறது என்று பார்ப்போம்:

source: (define-public hello (package (name "hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Hello, GNU world: An example GNU package") (description "GNU Hello prints the message \"Hello, world!\" and then exits. It serves as an example of standard GNU coding practices. As such, it supports command-line arguments, multiple languages, and so on.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+)))
ta: (வரையறுக்கவும்-பொது வணக்கம் (தொகுப்பு (பெயர் "அலோ") (பதிப்பு "2.10") (ஆதாரம் (முறை url-பெறுதல்) (உரி (சரம்-இணைப்பு "mirror://gnu/hello/hello-" பதிப்பு ".tar.gz")) (sha256 (அடிப்படை 32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (கட்டுமான அமைப்பு gnu-build-system) (சுருக்கம் "வணக்கம், குனு உலகம்: ஒரு எடுத்துக்காட்டு குனு தொகுப்பு") (விளக்கம் "GNU Hello \"Hello, world!\" என்ற செய்தியை அச்சிட்டு பின்னர் வெளியேறுகிறது நிலையான குனு குறியீட்டு நடைமுறைகளுக்கு ஒரு எடுத்துக்காட்டு. அதுபோல, ஆதரிக்கிறது கட்டளை வரி வாதங்கள், பல மொழிகள் மற்றும் பல.") (முகப்பு பக்கம் "https://www.gnu.org/software/hello/") (உரிமம் gpl3+)))

source: As you can see, most of it is rather straightforward. But let's review the fields together:
ta: நீங்கள் பார்க்க முடியும் என, பெரும்பாலானவை நேரடியானவை. ஆனால் புலங்களை ஒன்றாக மதிப்பாய்வு செய்வோம்:

source: The project name. Using Scheme conventions, we prefer to keep it lower case, without underscore and using dash-separated words.
ta: திட்டத்தின் பெயர். திட்ட மரபுகளைப் பயன்படுத்தி, அடிக்கோடிடாமல், கோடுகளால் பிரிக்கப்பட்ட சொற்களைப் பயன்படுத்தாமல் சிறிய எழுத்தில் வைக்க விரும்புகிறோம்.

source: This field contains a description of the source code origin. The @code{origin} record contains these fields:
ta: இந்த புலத்தில் மூல குறியீடு தோற்றம் பற்றிய விளக்கம் உள்ளது. @code{origin} பதிவில் பின்வரும் புலங்கள் உள்ளன:

source: The method, here @code{url-fetch} to download via HTTP/FTP, but other methods
ta: முறை, இங்கே @code{url-fetch} HTTP/FTP வழியாக பதிவிறக்கம் செய்ய, ஆனால் பிற முறைகள்

source: exist, such as @code{git-fetch} for Git repositories.
ta: Git களஞ்சியங்களுக்கான @code{git-fetch} போன்றவை உள்ளன.

source: The URI, which is typically some @code{https://} location for @code{url-fetch}. Here
ta: URI, இது பொதுவாக @code{url-fetch} க்கான சில @code{https://} இருப்பிடமாகும். இங்கே

source: the special `mirror://gnu` refers to a set of well known locations, all of which can be used by Guix to fetch the source, should some of them fail.
ta: சிறப்பு `mirror://gnu` என்பது நன்கு அறியப்பட்ட இடங்களின் தொகுப்பைக் குறிக்கிறது, அவற்றில் சில தோல்வியுற்றால், மூலத்தைப் பெற Guix ஆல் பயன்படுத்தப்படலாம்.

source: The @code{sha256} checksum of the requested file. This is essential to ensure
ta: கோரப்பட்ட கோப்பின் @code{sha256} செக்சம். இதை உறுதிப்படுத்துவது தேவை

source: the source is not corrupted. Note that Guix works with base32 strings, hence the call to the @code{base32} function.
ta: சான்று சிதைக்கப்படவில்லை. Guix அடிப்படை32 சரங்களுடன் செயல்படுகிறது என்பதை நினைவில் கொள்ளவும், எனவே @code{base32} செயல்பாட்டிற்கு அழைப்பு.

source: build-system
ta: கட்ட-அமைப்பு

source: This is where the power of abstraction provided by the Scheme language really shines: in this case, the @code{gnu-build-system} abstracts away the famous @code{./configure && make && make install} shell invocations. Other build systems include the @code{trivial-build-system} which does not do anything and requires from the packager to program all the build steps, the @code{python-build-system}, the @code{emacs-build-system}, and many more (@pxref{Build Systems,,, guix, GNU Guix Reference Manual}).
ta: திட்ட மொழியால் வழங்கப்பட்ட சுருக்கத்தின் ஆற்றல் உண்மையில் பிரகாசிக்கிறது: இந்த வழக்கில், @code{gnu-build-system} புகழ்மிக்க @code{./configure && make && make install} செல் அழைப்பிதழ்களை சுருக்குகிறது. மற்ற உருவாக்க அமைப்புகளில் @code{trivial-build-system} ஆகியவை அடங்கும், இது எதையும் செய்யாது மற்றும் பேக்கேசரிடமிருந்து அனைத்து உருவாக்கப் படிகளையும் நிரல் செய்ய வேண்டும், @code{python-build-system}, @code{emacs-build-system}, மேலும் பல (@pxref{Build-build-system}, மேலும் பல (@pxref{Build-Guix சிச்டம்ச், GNU குயிக்சு குறியிடு கையேடு}).

source: synopsis
ta: சுருக்கம்

source: It should be a concise summary of what the package does. For many packages a tagline from the project's home page can be used as the synopsis.
ta: தொகுப்பு என்ன செய்கிறது என்பதற்கான சுருக்கமான சுருக்கமாக இது இருக்க வேண்டும். பல தொகுப்புகளுக்கு திட்டத்தின் முகப்புப் பக்கத்திலிருந்து ஒரு ஒலி சுருக்கமாகப் பயன்படுத்தப்படலாம்.

source: description
ta: விவரம்

source: Same as for the synopsis, it's fine to re-use the project description from the homepage. Note that Guix uses Texinfo syntax.
ta: சுருக்கத்தைப் போலவே, முகப்புப் பக்கத்திலிருந்து திட்ட விளக்கத்தை மீண்டும் பயன்படுத்துவது நல்லது. Guix Texinfo தொடரியல் பயன்படுத்துகிறது என்பதை நினைவில் கொள்க.

source: Use HTTPS if available.
ta: HTTPS இருந்தால் பயன்படுத்தவும்.

source: license
ta: உரிமம்

source: See @code{guix/licenses.scm} in the project source for a full list of available licenses.
ta: கிடைக்கக்கூடிய உரிமங்களின் முழுப் பட்டியலுக்கு, திட்ட மூலத்தில் @code{guix/licenses.scm} ஐப் பார்க்கவும்.

source: Time to build our first package! Nothing fancy here for now: we will stick to a dummy @code{my-hello}, a copy of the above declaration.
ta: எங்கள் முதல் தொகுப்பை உருவாக்குவதற்கான நேரம்! இப்போதைக்கு இங்கே ஆடம்பரமாக எதுவும் இல்லை: மேலே உள்ள அறிவிப்பின் நகலான போலி @code{my-hello} உடன் நாங்கள் ஒட்டிக்கொள்வோம்.

source: As with the ritualistic ``Hello World'' taught with most programming languages, this will possibly be the most ``manual'' approach. We will work out an ideal setup later; for now we will go the simplest route.
ta: பெரும்பாலான நிரலாக்க மொழிகளில் கற்பிக்கப்படும் ``அலோ வேர்ல்ட்'' என்ற சம்பிரதாயத்தைப் போலவே, இது மிகவும் ``கையேடு'' அணுகுமுறையாக இருக்கலாம். நாங்கள் பின்னர் ஒரு சிறந்த அமைப்பை உருவாக்குவோம்; இப்போது நாம் எளிமையான பாதையில் செல்வோம்.

source: Save the following to a file @file{my-hello.scm}.
ta: பின்வருவனவற்றை @file{my-hello.scm} கோப்பில் சேமிக்கவும்.

source: (use-modules (guix packages) (guix download) (guix build-system gnu) (guix licenses))
ta: (பயன்படுத்தும் தொகுதிகள் (guix தொகுப்புகள்) (guix பதிவிறக்கம்) (guix build-system gnu) (guix உரிமங்கள்))

source: (package (name "my-hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Hello, Guix world: An example custom Guix package") (description "GNU Hello prints the message \"Hello, world!\" and then exits. It serves as an example of standard GNU coding practices. As such, it supports command-line arguments, multiple languages, and so on.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+))
ta: (தொகுப்பு (பெயர் "மை-அலோ") (பதிப்பு "2.10") (ஆதாரம் (முறை url-பெறுதல்) (உரி (சரம்-இணைப்பு "mirror://gnu/hello/hello-" பதிப்பு ".tar.gz")) (sha256 (அடிப்படை 32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (கட்டுமான அமைப்பு gnu-build-system) (சுருக்கம் "அலோ, Guix உலகம்: ஒரு எடுத்துக்காட்டு தனிப்பயன் Guix தொகுப்பு") (விளக்கம் "GNU Hello \"Hello, world!\" என்ற செய்தியை அச்சிட்டு பின்னர் வெளியேறுகிறது நிலையான குனு குறியீட்டு நடைமுறைகளுக்கு ஒரு எடுத்துக்காட்டு. அதுபோல, ஆதரிக்கிறது கட்டளை வரி வாதங்கள், பல மொழிகள் மற்றும் பல.") (முகப்பு பக்கம் "https://www.gnu.org/software/hello/") (உரிமம் gpl3+))

source: We will explain the extra code in a moment.
ta: கூடுதல் குறியீட்டை சிறிது நேரத்தில் விளக்குவோம்.

source: Feel free to play with the different values of the various fields. If you change the source, you'll need to update the checksum. Indeed, Guix refuses to build anything if the given checksum does not match the computed checksum of the source code. To obtain the correct checksum of the package declaration, we need to download the source, compute the sha256 checksum and convert it to base32.
ta: பல்வேறு துறைகளின் வெவ்வேறு மதிப்புகளுடன் விளையாட தயங்க. மூலத்தை மாற்றினால், செக்சம் புதுப்பிக்க வேண்டும். உண்மையில், கொடுக்கப்பட்ட செக்சம், மூலக் குறியீட்டின் கணக்கிடப்பட்ட செக்சம் உடன் பொருந்தவில்லை என்றால், Guix எதையும் உருவாக்க மறுக்கிறது. தொகுப்பு அறிவிப்பின் சரியான செக்சம் பெற, நாம் மூலத்தைப் பதிவிறக்கம் செய்து, sha256 செக்சம் கணக்கிட்டு, அதை அடிப்படை32க்கு மாற்ற வேண்டும்.

source: Thankfully, Guix can automate this task for us; all we need is to provide the URI:
ta: அதிர்ச்டவசமாக, Guix இந்த பணியை எங்களுக்காக தானியங்குபடுத்த முடியும்; யூரி ஐ வழங்குவது மட்டுமே எங்களுக்குத் தேவை:

source: $ guix download mirror://gnu/hello/hello-2.10.tar.gz
ta: $ guix பதிவிறக்கம் மிரர்://gnu/hello/hello-2.10.tar.gz

source: Starting download of /tmp/guix-file.JLYgL7 From https://ftpmirror.gnu.org/gnu/hello/hello-2.10.tar.gz... following redirection to `https://mirror.ibcp.fr/pub/gnu/hello/hello-2.10.tar.gz'... …10.tar.gz 709KiB 2.5MiB/s 00:00 [##################] 100.0% /gnu/store/hbdalsf5lpf01x4dcknwx6xbn6n5km6k-hello-2.10.tar.gz 0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i
ta: /tmp/guix-file.JLYgL7 இன் பதிவிறக்கம் தொடங்குகிறது https://ftpmirror.gnu.org/gnu/hello/hello-2.10.tar.gz இலிருந்து... பின்வரும் திசைமாற்றம் `https://mirror.ibcp.fr/pub/gnu/hello/hello-2.10.tar.gz'... …10.tar.gz 709KiB 2.5MiB/s 00:00 [##################] 100.0% /gnu/store/hbdalsf5lpf01x4dcknwx6xbn6n5km6k-hello-2.10.tar.gz 0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i

source: In this specific case the output tells us which mirror was chosen. If the result of the above command is not the same as in the above snippet, update your @code{my-hello} declaration accordingly.
ta: இந்த குறிப்பிட்ட வழக்கில், எந்த கண்ணாடி தேர்ந்தெடுக்கப்பட்டது என்பதை வெளியீடு சொல்கிறது. மேலே உள்ள கட்டளையின் முடிவு மேலே உள்ள துணுக்கில் உள்ளதைப் போல இல்லையெனில், அதற்கேற்ப உங்கள் @code{my-hello} அறிவிப்பைப் புதுப்பிக்கவும்.

source: Note that GNU package tarballs come with an OpenPGP signature, so you should definitely check the signature of this tarball with `gpg` to authenticate it before going further:
ta: குனு பேக்கேச் டார்பால்ச் ஓபன்பிசிபி கையொப்பத்துடன் வருகிறது என்பதை நினைவில் கொள்ளவும், எனவே இந்த டார்பாலின் கையொப்பத்தை 'gpg' உடன் சரிபார்த்து, மேலும் செல்வதற்கு முன் அதை அங்கீகரிக்கவும்:

source: $ guix download mirror://gnu/hello/hello-2.10.tar.gz.sig
ta: $ guix பதிவிறக்கம் மிரர்://gnu/hello/hello-2.10.tar.gz.sig

source: Starting download of /tmp/guix-file.03tFfb From https://ftpmirror.gnu.org/gnu/hello/hello-2.10.tar.gz.sig... following redirection to `https://ftp.igh.cnrs.fr/pub/gnu/hello/hello-2.10.tar.gz.sig'... ….tar.gz.sig 819B 1.2MiB/s 00:00 [##################] 100.0% /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig 0q0v86n3y38z17rl146gdakw9xc4mcscpk8dscs412j22glrv9jf $ gpg --verify /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig /gnu/store/hbdalsf5lpf01x4dcknwx6xbn6n5km6k-hello-2.10.tar.gz gpg: Signature made Sun 16 Nov 2014 01:08:37 PM CET gpg: using RSA key A9553245FDE9B739 gpg: Good signature from "Sami Kerola <kerolasa@@iki.fi>" [unknown] gpg: aka "Sami Kerola (http://www.iki.fi/kerolasa/) <kerolasa@@iki.fi>" [unknown] gpg: WARNING: This key is not certified with a trusted signature! gpg: There is no indication that the signature belongs to the owner. Primary key fingerprint: 8ED3 96E3 7E38 D471 A005 30D3 A955 3245 FDE9 B739
ta: /tmp/guix-file.03tFfb இன் பதிவிறக்கம் தொடங்குகிறது இலிருந்து https://ftpmirror.gnu.org/gnu/hello/hello-2.10.tar.gz.sig... தொடர்ந்து `https://ftp.igh.cnrs.fr/pub/gnu/hello/hello-2.10.tar.gz.sig'... ….tar.gz.sig 819B 1.2MiB/s 00:00 [##################] 100.0% /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig 0q0v86n3y38z17rl146gdakw9xc4mcscpk8dscs412j22glrv9jf $ gpg --சரிபார்க்கவும் /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig /gnu/store/hbdalsf5lpf01x4dcknwx6xbn6n5km6k.0tar. gpg: கையொப்பம் ஞாயிறு 16 நவம்பர் 2014 01:08:37 PM CET gpg: RSA விசை A9553245FDE9B739 ஐப் பயன்படுத்துகிறது gpg: "கடவுள் கெரோலா <kerolasa@@iki.fi>" இலிருந்து நல்ல கையெழுத்து [தெரியவில்லை] gpg: அகா "கடவுள் கெரோலா (http://www.iki.fi/kerolasa/) <kerolasa@@iki.fi>" [தெரியவில்லை] gpg: எச்சரிக்கை: இந்த விசை நம்பகமான கையொப்பத்துடன் சான்றளிக்கப்படவில்லை! gpg: கையொப்பம் உரிமையாளருடையது என்பதற்கான எந்த அறிகுறியும் இல்லை. முதன்மை விசை கைரேகை: 8ED3 96E3 7E38 D471 A005 30D3 A955 3245 FDE9 B739

source: You can then happily run
ta: அப்போது நீங்கள் மகிழ்ச்சியாக ஓடலாம்

source: $ guix package --install-from-file=my-hello.scm
ta: $ guix தொகுப்பு --install-from-file=my-hello.scm
