Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: Once your own code is available in a public version-control repository, such as a Git repository on your lab's hosting service, you can ask SWH to archive it by going to its @uref{https://archive.softwareheritage.org/save/,Save Code Now} interface. SWH will process the request asynchronously and eventually you'll find your code has made it into @uref{https://archive.softwareheritage.org/,the archive}.
ta: உங்கள் ஆய்வகத்தின் ஓச்டிங் சேவையில் உள்ள Git களஞ்சியம் போன்ற பொது பதிப்பு-கட்டுப்பாட்டு களஞ்சியத்தில் உங்கள் சொந்த குறியீடு கிடைத்ததும், அதன் @uref{https://archive.softwareheritage.org/save/,Save குறியீடு Now} இடைமுகத்திற்குச் சென்று அதைக் காப்பகப்படுத்த SWHஐக் கேட்கலாம். SWH கோரிக்கையை ஒத்திசைவற்ற முறையில் செயல்படுத்தும், இறுதியில் உங்கள் குறியீடு @uref{https://archive.softwareheritage.org/, the archive} ஆக மாற்றப்பட்டிருப்பதைக் காண்பீர்கள்.

source: Step 4: Referencing the Software Environment
ta: படி 4: மென்பொருள் சூழலைக் குறிப்பிடுதல்

source: This brings us to the last step: referring to our code @emph{and} software environment in our beloved paper. We already have all our code and Guix files in the same repository, which is archived on SWH. Thanks to SWH, we now have a SWHID, which uniquely identifies the relevant revision of our code.
ta: இது எங்களை கடைசி கட்டத்திற்கு கொண்டு செல்கிறது: எங்கள் அன்பான காகிதத்தில் @emph{and} மென்பொருள் சூழலைக் குறிப்பிடுவது. SWH இல் காப்பகப்படுத்தப்பட்ட ஒரே களஞ்சியத்தில் ஏற்கனவே எங்களின் அனைத்து குறியீடு மற்றும் Guix கோப்புகள் உள்ளன. SWH க்கு நன்றி, எங்களிடம் ஒரு SWHID உள்ளது, இது எங்கள் குறியீட்டின் தொடர்புடைய திருத்தத்தை தனித்துவமாக அடையாளம் காட்டுகிறது.

source: Following @uref{https://www.softwareheritage.org/howto-archive-and-reference-your-code/,SWH's own guide}, we'll pick an @code{swh:dir} kind of identifier, which refers to the directory of the relevant revision/commit of our repository, and we'll keep @emph{contextual info} for clarity---that includes the original URL. Putting it all together, we'll conclude our paper with a sentence along these lines:
ta: @uref{https://www.softwareheritage.org/howto-archive-and-reference-your-code/,SWH இன் சொந்த வழிகாட்டி} ஐப் பின்பற்றி, நாங்கள் @code{swh:dir} வகையான அடையாளங்காட்டியைத் தேர்ந்தெடுப்போம், இது எங்கள் களஞ்சியத்தின் தொடர்புடைய மறுபரிசீலனை/கமிட்டின் கோப்பகத்தைக் குறிக்கிறது, மேலும் @emphtha} அசல் தகவலை உள்ளடக்கியிருக்கும். URL. எல்லாவற்றையும் ஒன்றாக இணைத்து, இந்த வரிகளுடன் ஒரு வாக்கியத்துடன் எங்கள் கட்டுரையை முடிப்போம்:

source: Example
ta: சான்று

source: The source code used to produce this study, as well as instructions to run it in the right software environment using GNU@ Guix, is archived on Software Heritage as @uref{https://archive.softwareheritage.org/swh:1:dir:cc8919d7705fbaa31efa677ce00bef7eb374fb80;origin=https://gitlab.inria.fr/lcourtes-phd/edcc-2006-redone;visit=swh:1:snp:71a4d08ef4a2e8455b67ef0c6b82349e82870b46;anchor=swh:1:rev:36fde7e5ba289c4c3e30d9afccebbe0cfe83853a,@code{swh:1:dir:cc8919d7705fbaa31efa677ce00bef7eb374fb80;origin=https://gitlab.inria.fr/lcourtes-phd/edcc-2006-redone;visit=swh:1:snp:71a4d08ef4a2e8455b67ef0c6b82349e82870b46;anchor=swh:1:rev:36fde7e5ba289c4c3e30d9afccebbe0cfe83853a}}.
ta: இந்த ஆய்வைத் தயாரிக்கப் பயன்படுத்தப்படும் மூலக் குறியீடு, குனு@ Guix ஐப் பயன்படுத்தி சரியான மென்பொருள் சூழலில் அதை இயக்குவதற்கான வழிமுறைகள், மென்பொருள் பாரம்பரியத்தில் காப்பகப்படுத்தப்பட்டுள்ளன @uref{https://archive.softwareheritage.org/swh:1:dir:cc8919d7705fbaa31efa677ce00bef7eb374fb80;origin=https://gitlab.inria.fr/lcourtes-phd/edcc-2006-redone;visit=swh:1:snp:71a4d08ef4a2e8455b67ef0c6b82349e82870b46;anchor=swh:1:rev:36fde7e5ba289c4c3e30d9afccebbe0cfe83853a,@code{swh:1:dir:cc8919d7705fbaa31efa677ce00bef7eb374fb80;origin=https://gitlab.inria.fr/lcourtes-phd/edcc-2006-redone;visit=swh:1:snp:71a4d08ef4a2e8455b67ef0c6b82349e82870b46;anchor=swh:1:rev:36fde7e5ba289c4c3e30d9afccebbe0cfe83853a}}.

source: With this information, the reader can:
ta: இந்தத் தகவலுடன், வாசகரால் முடியும்:

source: get the source code;
ta: மூலக் குறியீட்டைப் பெறுங்கள்;

source: reproduce its software environment with @code{guix time-machine} and run the code;
ta: @code{guix time-machine} மூலம் அதன் மென்பொருள் சூழலை மீண்டும் உருவாக்கி, குறியீட்டை இயக்கவும்;

source: inspect and possibly modify both the code and its environment.
ta: குறியீடு மற்றும் அதன் சூழல் இரண்டையும் ஆய்வு செய்து மாற்றலாம்.

source: Mission accomplished!
ta: பணி நிறைவேறியது!

source: cluster installation
ta: கிளச்டர் நிறுவல்

source: high-performance computing, HPC
ta: உயர் செயல்திறன் கணினி, HPC

source: HPC, high-performance computing
ta: HPC, உயர் செயல்திறன் கம்ப்யூட்டிங்

source: Guix is appealing to scientists and @acronym{HPC, high-performance computing} practitioners: it makes it easy to deploy potentially complex software stacks, and it lets you do so in a reproducible fashion---you can redeploy the exact same software on different machines and at different points in time.
ta: Guix விஞ்ஞானிகள் மற்றும் @Acronym{HPC, உயர் செயல்திறன் கொண்ட கம்ப்யூட்டிங்} பயிற்சியாளர்களை ஈர்க்கிறது: இது சிக்கலான மென்பொருள் அடுக்குகளை வரிசைப்படுத்துவதை எளிதாக்குகிறது, மேலும் இது உங்களை மீண்டும் உருவாக்கக்கூடிய பாணியில் செய்ய அனுமதிக்கிறது---நீங்கள் வெவ்வேறு இயந்திரங்களிலும் வெவ்வேறு நேரங்களிலும் சரியான மென்பொருளை மீண்டும் பயன்படுத்தலாம்.

source: In this chapter we look at how a cluster sysadmin can install Guix for system-wide use, such that it can be used on all the cluster nodes, and discuss the various tradeoffs@footnote{This chapter is adapted from a @uref{https://hpc.guix.info/blog/2017/11/installing-guix-on-a-cluster/, blog post published on the Guix-HPC web site in 2017}.}.
ta: இந்த அத்தியாயத்தில், ஒரு கிளச்டர் சிசாட்மின் எவ்வாறு சிச்டம் முழுவதும் பயன்படுத்த Guix ஐ நிறுவ முடியும் என்பதைப் பார்ப்போம், அது அனைத்து க்ளச்டர் நோட்களிலும் பயன்படுத்தப்படலாம், மேலும் பல்வேறு டிரேட்ஆஃப்ச்@ஃபுட்நோட் பற்றி விவாதிக்கவும்{இந்த அத்தியாயம் @uref{https://hpc.guix.info/blog/2017/11/installing, posted on the post posted on blog. Guix-HPC இணையத்தளம் 2017}.}.

source: Here we assume that the cluster is running a GNU/Linux distro other than Guix System and that we are going to install Guix on top of it.
ta: இங்கே நாம் க்ளச்டரில் Guix சிச்டம் அல்லாத GNU/Linux distro இயங்குகிறது என்றும் அதன் மேல் Guix ஐ நிறுவப் போகிறோம் என்றும் கருதுகிறோம்.

source: The recommended approach is to set up one @emph{head node} running @command{guix-daemon} and exporting @file{/gnu/store} over NFS to compute nodes.
ta: @emph{head node}ஐ @command{guix-daemon} இயக்குவது மற்றும் முனைகளைக் கணக்கிடுவதற்கு NFS வழியாக @file{/gnu/store}ஐ ஏற்றுமதி செய்வது பரிந்துரைக்கப்பட்ட அணுகுமுறையாகும்.

source: Remember that @command{guix-daemon} is responsible for spawning build processes and downloads on behalf of clients (@pxref{Invoking guix-daemon,,, guix, GNU Guix Reference Manual}), and more generally accessing @file{/gnu/store}, which contains all the package binaries built by all the users (@pxref{The Store,,, guix, GNU Guix Reference Manual}). ``Client'' here refers to all the Guix commands that users see, such as @code{guix install}. On a cluster, these commands may be running on the compute nodes and we'll want them to talk to the head node's @code{guix-daemon} instance.
ta: வாடிக்கையாளர்களின் சார்பாக உருவாக்க செயல்முறைகள் மற்றும் பதிவிறக்கங்களை உருவாக்குவதற்கு @command{guix-daemon} பொறுப்பு என்பதை நினைவில் கொள்ளவும் (@pxref{Invoking guix-daemon,,, guix, GNU Guix குறிப்பு கையேடு}), மேலும் பொதுவாக @file{/gnu/store} ஐ அணுகுகிறது, இதில் அனைத்து தொகுப்புகளும் உள்ளன. குறிப்பு கையேடு}). இங்கே ``கிளையண்ட்'' என்பது @code{guix install} போன்ற பயனர்கள் பார்க்கும் அனைத்து Guix கட்டளைகளையும் குறிக்கிறது. ஒரு கிளச்டரில், இந்த கட்டளைகள் கம்ப்யூட் நோட்களில் இயங்கக்கூடும், மேலும் அவை எட் நோட்டின் @code{guix-daemon} நிகழ்வில் பேச வேண்டும் என்று நாங்கள் விரும்புகிறோம்.

source: To begin with, the head node can be installed following the usual binary installation instructions (@pxref{Binary Installation,,, guix, GNU Guix Reference Manual}). Thanks to the installation script, this should be quick. Once installation is complete, we need to make some adjustments.
ta: தொடங்குவதற்கு, வழக்கமான பைனரி நிறுவல் வழிமுறைகளைப் பின்பற்றி எட் நோடை நிறுவலாம் (@pxref{பைனரி நிறுவல்,,, guix, GNU Guix குறிப்பு Manual}). நிறுவல் ச்கிரிப்ட்டுக்கு நன்றி, இது விரைவாக இருக்க வேண்டும். நிறுவல் முடிந்ததும், நாம் சில மாற்றங்களைச் செய்ய வேண்டும்.

source: Starting from Guix version 1.5.0, @command{guix-daemon} runs without root privileges by default; previously installed systems can also be migrated to this ``rootless'' mode (@pxref{Build Environment Setup,,, guix, GNU Guix Reference Manual}). Learn more about this change in a @uref{https://hpc.guix.info/blog/2025/03/build-daemon-drops-its-privileges/, 2025 blog post}.
ta: Guix பதிப்பு 1.5.0 இலிருந்து தொடங்கி, @command{guix-daemon} முன்னிருப்பாக ரூட் சலுகைகள் இல்லாமல் இயங்குகிறது; முன்பு நிறுவப்பட்ட கணினிகள் இந்த ``ரூட்லெச்'' பயன்முறைக்கு மாற்றப்படலாம் (@pxref{சுற்றுச்சூழலை உருவாக்கவும்,,, guix, GNU Guix குறிப்பு கையேடு}). @uref{https://hpc.guix.info/blog/2025/03/build-daemon-drops-its-privileges/, 2025 வலைப்பதிவு இடுகையில் இந்த மாற்றத்தைப் பற்றி மேலும் அறியவும்.

source: Since we want @code{guix-daemon} to be reachable not just from the head node but also from the compute nodes, we need to arrange so that it listens for connections over TCP/IP. To do that, we'll edit the systemd startup file for @command{guix-daemon}, @file{/etc/systemd/system/guix-daemon.service}, and add a @code{--listen} argument to the @code{ExecStart} line so that it looks something like this:
ta: @code{guix-daemon} ஐ எட் நோடில் இருந்து மட்டுமின்றி, கம்ப்யூட் நோட்களிலிருந்தும் சென்றடைய வேண்டும் என்பதால், அது TCP/IP மூலம் இணைப்புகளைக் கேட்கும் வகையில் ஏற்பாடு செய்ய வேண்டும். இதைச் செய்ய, @command{guix-daemon}, @file{/etc/systemd/system/guix-daemon.service} க்கான systemd தொடக்கக் கோப்பைத் திருத்துவோம், மேலும் @code{ExecStart} வரியில் @code{--listen} வாதத்தைச் சேர்ப்போம், அது இப்படி இருக்கும்:

source: For these changes to take effect, the service needs to be restarted:
ta: இந்த மாற்றங்கள் நடைமுறைக்கு வர, சேவையை மறுதொடக்கம் செய்ய வேண்டும்:

source: systemctl daemon-reload systemctl restart guix-daemon
ta: systemctl டீமான்-ரீலோட் systemctl மறுதொடக்கம் guix-daemon

source: The @code{--listen=0.0.0.0} bit means that @code{guix-daemon} will process @emph{all} incoming TCP connections on port 44146 (@pxref{Invoking guix-daemon,,, guix, GNU Guix Reference Manual}). This is usually fine in a cluster setup where the head node is reachable exclusively from the cluster's local area network---you don't want that to be exposed to the Internet!
ta: @code{--listen=0.0.0.0} பிட் என்பது துறைமுகம் 44146 இல் @emph{all} உள்வரும் TCP இணைப்புகளை @code{guix-daemon} செயலாக்கும் (@pxref{Invoking guix-daemon,,, guix, GNU Guix குறிப்பு Manual}). கிளச்டரின் உள்ளக ஏரியா நெட்வொர்க்கிலிருந்து பிரத்தியேகமாக எட் நோட் அடையக்கூடிய கிளச்டர் அமைப்பில் இது பொதுவாக நன்றாக இருக்கும்---இணையத்தில் வெளிப்படுவதை நீங்கள் விரும்பவில்லை!

source: The next step is to define our NFS exports in @uref{https://linux.die.net/man/5/exports,@file{/etc/exports}} by adding something along these lines:
ta: பின்வரும் வழிகளில் ஏதாவது ஒன்றைச் சேர்ப்பதன் மூலம் @uref{https://linux.die.net/man/5/exports,@file{/etc/exports}} இல் எங்கள் NFS ஏற்றுமதிகளை வரையறுப்பது அடுத்த படியாகும்:

source: The @file{/gnu/store} directory can be exported read-only since only @command{guix-daemon} on the master node will ever modify it. @file{/var/guix} contains @emph{user profiles} as managed by @code{guix package}; thus, to allow users to install packages with @code{guix package}, this must be read-write.
ta: @file{/gnu/store} கோப்பகத்தை படிக்க மட்டுமே ஏற்றுமதி செய்ய முடியும், ஏனெனில் முதன்மை முனையிலுள்ள @command{guix-daemon} மட்டுமே அதை மாற்றும். @file{/var/guix} ஆனது @code{guix package} மூலம் நிர்வகிக்கப்படும் @emph{user profiles}ஐக் கொண்டுள்ளது; எனவே, @code{guix package} உடன் தொகுப்புகளை நிறுவ பயனர்களை அனுமதிக்க, இதை படிக்க-எழுத வேண்டும்.

source: Although it is rarely used, Guix allows for the creation of profiles in non-default locations. For instance, @code{guix package -p ~/dev/python-dev -i python} installs Python in a profile reachable from the @code{~/dev/python-dev} symlink instead of the default @file{~/.guix-profile}.
ta: இது அரிதாகவே பயன்படுத்தப்பட்டாலும், இயல்புநிலை இல்லாத இடங்களில் சுயவிவரங்களை உருவாக்க Guix அனுமதிக்கிறது. எடுத்துக்காட்டாக, @code{guix தொகுப்பு -p ~/dev/python-dev -i python} ஆனது இயல்புநிலை @file{~/.guix-profile}க்குப் பதிலாக @code{~/dev/python-dev} symlink இலிருந்து அணுகக்கூடிய சுயவிவரத்தில் பைதான் ஐ நிறுவுகிறது.

source: To make sure that this profile is protected from garbage collection---i.e., that Python will not be removed from @file{/gnu/store} while this profile exists---, @emph{home directories should be mounted on the head node} as well so that @code{guix-daemon} knows about these non-standard profiles and avoids collecting software they refer to.
ta: இந்த சுயவிவரம் குப்பை சேகரிப்பிலிருந்து பாதுகாக்கப்படுகிறதா என்பதை உறுதிசெய்ய---அதாவது, இந்த சுயவிவரம் இருக்கும் போது @file{/gnu/store} இலிருந்து பைதான் அகற்றப்படாது---, @emph{home directories should be mounted on the head node} அத்துடன் @code{guix-daemon} இந்த தரமற்ற மென்பொருளைப் பற்றி அறிந்து அவற்றைச் சேகரிப்பதைத் தவிர்க்கிறது.

source: Doing so is optional though: profiles created by default by @command{guix package}, @command{guix pull}, and @command{guix shell} are all stored under @file{/var/guix} and thus protected from garbage collection.
ta: அவ்வாறு செய்வது விருப்பமானது என்றாலும்: @command{guix package}, @command{guix pull} மற்றும் @command{guix shell} மூலம் இயல்பாக உருவாக்கப்பட்ட சுயவிவரங்கள் அனைத்தும் @file{/var/guix} இன் கீழ் சேமிக்கப்பட்டு, குப்பை சேகரிப்பிலிருந்து பாதுகாக்கப்படும்.

source: It may be a good idea to periodically remove unused bits from @file{/gnu/store} by running @command{guix gc} (@pxref{Invoking guix gc,,, guix, GNU Guix Reference Manual}). This can be done by adding a systemd timer based on the one shipped with Guix:
ta: @command{guix gc} (@pxref{Invoking guix gc,,, guix, GNU Guix குறிப்பு Manual}) ஐ இயக்குவதன் மூலம் @file{/gnu/store} இலிருந்து பயன்படுத்தப்படாத பிட்களை அவ்வப்போது அகற்றுவது நல்ல யோசனையாக இருக்கலாம். Guix உடன் அனுப்பப்பட்டதை அடிப்படையாகக் கொண்ட systemd டைமரைச் சேர்ப்பதன் மூலம் இதைச் செய்யலாம்:

source: Make sure to edit @file{guix-gc.service} and @file{guix-gc.timer} under @file{/etc/systemd/system} to adjust the parameters to your need: timer frequency, amount of free space, and whether to delete user's old generations. We recommend executing @command{guix gc -F50G} every night, which will ensure that at least 50@tie{}GiB are available, without deleting user generations. Once you're satisfied, you can start the timer:
ta: உங்கள் தேவைக்கேற்ப அளவுருக்களை சரிசெய்ய @file{guix-gc.service} மற்றும் @file{guix-gc.timer} ஆகியவற்றை @file{/etc/systemd/system} இன் கீழ் திருத்துவதை உறுதிசெய்யவும்: நேரங்குறிகருவி அதிர்வெண், இலவச இடத்தின் அளவு மற்றும் பயனரின் பழைய தலைமுறைகளை நீக்க வேண்டுமா. ஒவ்வொரு இரவிலும் @command{guix gc -F50G}ஐ இயக்க பரிந்துரைக்கிறோம், இது பயனர் தலைமுறைகளை நீக்காமல், குறைந்தது 50@tie{}GiB கிடைப்பதை உறுதி செய்யும். நீங்கள் நிறைவு அடைந்தவுடன், நீங்கள் டைமரைத் தொடங்கலாம்:

source: systemctl daemon-reload systemctl start guix-gc.timer
ta: systemctl டீமான்-ரீலோட் systemctl தொடக்க guix-gc.timer

source: We're done with the head node! Let's look at compute nodes now.
ta: தலை முனையை முடித்துவிட்டோம்! இப்போது கம்ப்யூட் நோட்களைப் பார்ப்போம்.

source: First of all, we need compute nodes to mount those NFS directories that the head node exports. This can be done by adding the following lines to @uref{https://linux.die.net/man/5/fstab,@file{/etc/fstab}}:
ta: முதலாவதாக, எட் நோட் ஏற்றுமதி செய்யும் அந்த NFS கோப்பகங்களை ஏற்ற கணினி முனைகள் தேவை. @uref{https://linux.die.net/man/5/fstab,@file{/etc/fstab}} இல் பின்வரும் வரிகளைச் சேர்ப்பதன் மூலம் இதைச் செய்யலாம்:

source: ... where @var{head-node} is the name or IP address of your head node. From there on, assuming the mount points exist, you should be able to mount each of these on the compute nodes.
ta: ... @var{head-node} என்பது உங்கள் தலை முனையின் பெயர் அல்லது IP முகவரி. அங்கிருந்து, மவுண்ட் பாயிண்ட்கள் இருப்பதாகக் கருதினால், இவை ஒவ்வொன்றையும் நீங்கள் கம்ப்யூட் நோட்களில் ஏற்ற முடியும்.

source: Next, we need to provide a default @command{guix} command that users can run when they first connect to the cluster (eventually they will invoke @command{guix pull}, which will provide them with their ``own'' @command{guix} command). Similar to what the binary installation script did on the head node, we'll store that in @file{/usr/local/bin}:
ta: அடுத்து, பயனர்கள் முதலில் கிளச்டருடன் இணைக்கும்போது இயக்கக்கூடிய இயல்புநிலை @command{guix} கட்டளையை நாங்கள் வழங்க வேண்டும் (இறுதியில் அவர்கள் @command{guix pull} ஐ அழைப்பார்கள், இது அவர்களுக்கு ``சொந்த'' @command{guix} கட்டளையை வழங்கும்). பைனரி நிறுவல் ச்கிரிப்ட் எட் நோடில் செய்ததைப் போலவே, அதை @file{/usr/local/bin} இல் சேமிப்போம்:

source: mkdir -p /usr/local/bin ln -s /var/guix/profiles/per-user/root/current-guix/bin/guix \ /usr/local/bin/guix
ta: mkdir -p /usr/local/bin ln -s /var/gix/profiles/per-user/root/current-gix/bin/gix \ /usr/local/bin/plaster

source: We then need to tell @code{guix} to talk to the daemon running on our master node, by adding these lines to @code{/etc/profile}:
ta: இந்த வரிகளை @code{/etc/profile} இல் சேர்ப்பதன் மூலம், எங்கள் முதன்மை முனையில் இயங்கும் டீமானுடன் பேசுவதற்கு @code{guix} ஐச் சொல்ல வேண்டும்:

source: GUIX_DAEMON_SOCKET="guix://@var{head-node}" export GUIX_DAEMON_SOCKET
ta: GUIX_DAEMON_SOCKET="guix://@var{head-node}" ஏற்றுமதி GUIX_DAEMON_SOCKET

source: To avoid warnings and make sure @code{guix} uses the right locale, we need to tell it to use locale data provided by Guix (@pxref{Application Setup,,, guix, GNU Guix Reference Manual}):
ta: எச்சரிக்கைகளைத் தவிர்க்கவும், @code{guix} சரியான மொழியைப் பயன்படுத்துவதை உறுதிசெய்யவும், Guix (@pxref{Application Setup,,, guix, GNU Guix குறிப்பு Manual}) வழங்கிய மொழித் தரவைப் பயன்படுத்துமாறு நாங்கள் கூற வேண்டும்:

source: GUIX_LOCPATH=/var/guix/profiles/per-user/root/guix-profile/lib/locale export GUIX_LOCPATH
ta: GUIX_LOCPATH=/var/guix/profiles/per-user/root/guix-profile/lib/locale ஏற்றுமதி GUIX_LOCPATH

source: # Here we must use a valid locale name. Try "ls $GUIX_LOCPATH/*" # to see what names can be used. LC_ALL=fr_FR.utf8 export LC_ALL
ta: # இங்கே நாம் சரியான மொழிப் பெயரைப் பயன்படுத்த வேண்டும். "ls $GUIX_LOCPATH/*" முயற்சிக்கவும் # என்ன பெயர்களைப் பயன்படுத்தலாம் என்பதைப் பார்க்க. LC_ALL=fr_FR.utf8 ஏற்றுமதி LC_ALL

source: For convenience, @code{guix package} automatically generates @file{~/.guix-profile/etc/profile}, which defines all the environment variables necessary to use the packages---@code{PATH}, @code{C_INCLUDE_PATH}, @code{PYTHONPATH}, etc. Likewise, @command{guix pull} does that under @file{~/.config/guix/current}. Thus it's a good idea to source both from @code{/etc/profile}:
ta: வசதிக்காக, @code{guix package} தானாகவே @file ஐ உருவாக்குகிறது @file{~/.config/guix/current}. எனவே இரண்டையும் @code{/etc/profile} இலிருந்து பெறுவது நல்லது:

source: for GUIX_PROFILE in "$HOME/.config/guix/current" "$HOME/.guix-profile" do if [ -f "$GUIX_PROFILE/etc/profile" ]; then . "$GUIX_PROFILE/etc/profile" fi done
ta: GUIX_PROFILE க்கான "$HOME/.config/guix/current" "$HOME/.guix-profile" கொடுக்க என்றால் [ -f "$GUIX_PROFILE/etc/profile" ]; பிறகு . "$GUIX_PROFILE/etc/profile" முடிவு கொடுக்கப்பட்டது

source: Last but not least, Guix provides command-line completion notably for Bash and zsh. In @code{/etc/bashrc}, consider adding this line:
ta: கடைசியாக ஆனால் குறைந்தது அல்ல, Guix குறிப்பாக Bash மற்றும் zsh க்கு கட்டளை வரியை நிறைவு செய்கிறது. @code{/etc/bashrc} இல், இந்த வரியைச் சேர்ப்பதைக் கவனியுங்கள்:

source: Voilà!
ta: குரல்!

source: You can check that everything's in place by logging in on a compute node and running:
ta: கம்ப்யூட் முனையில் உள்நுழைந்து இயங்குவதன் மூலம் எல்லாம் சரியாக உள்ளதா என்பதை நீங்கள் சரிபார்க்கலாம்:

source: guix install hello
ta: பிளாச்டர் நிறுவ அலோ

source: The daemon on the head node should download pre-built binaries on your behalf and unpack them in @file{/gnu/store}, and @command{guix install} should create @file{~/.guix-profile} containing the @file{~/.guix-profile/bin/hello} command.
ta: எட் நோடில் உள்ள டெமான் உங்கள் சார்பாக முன்பே கட்டமைக்கப்பட்ட பைனரிகளைப் பதிவிறக்கி அவற்றை @file{/gnu/store} இல் திறக்க வேண்டும், மேலும் @command{guix install} @file{~/.guix-profile/bin/hello} கட்டளையைக் கொண்ட @file{~/.guix-profile} ஐ உருவாக்க வேண்டும்.

source: Network Access
ta: பிணைய அணுகல்

source: Guix requires network access to download source code and pre-built binaries. The good news is that only the head node needs that since compute nodes simply delegate to it.
ta: மூலக் குறியீடு மற்றும் முன் கட்டப்பட்ட பைனரிகளைப் பதிவிறக்க Guix க்கு பிணைய அணுகல் தேவை. நல்ல செய்தி என்னவென்றால், கம்ப்யூட் நோட்கள் அதற்கு வெறுமனே பிரதிநிதித்துவம் செய்வதால், தலை முனைக்கு மட்டுமே அது தேவைப்படுகிறது.

source: It is customary for cluster nodes to have access at best to a @emph{white list} of hosts. Our head node needs at least @code{ci.guix.gnu.org} in this white list since this is where it gets pre-built binaries from by default, for all the packages that are in Guix proper.
ta: க்ளச்டர் முனைகளுக்கு @emph{white list} ஓச்ட்களுக்கு சிறந்த அணுகல் இருப்பது வழக்கம். இந்த வெள்ளைப் பட்டியலில் எங்கள் எட் நோட் குறைந்தபட்சம் @code{ci.guix.gnu.org} தேவைப்படுவதால், Guix இல் உள்ள அனைத்து தொகுப்புகளுக்கும் முன்னரே கட்டமைக்கப்பட்ட பைனரிகள் இயல்பாகவே கிடைக்கும்.

source: Incidentally, @code{ci.guix.gnu.org} also serves as a @emph{content-addressed mirror} of the source code of those packages. Consequently, it is sufficient to have @emph{only} @code{ci.guix.gnu.org} in that white list.
ta: தற்செயலாக, @code{ci.guix.gnu.org} என்பது அந்த தொகுப்புகளின் மூலக் குறியீட்டின் @emph{content-addressed mirror} ஆகவும் செயல்படுகிறது. இதன் விளைவாக, அந்த வெள்ளைப் பட்டியலில் @emph{only} @code{ci.guix.gnu.org} இருந்தால் போதுமானது.

source: Software packages maintained in a separate repository such as one of the various @uref{https://hpc.guix.info/channels, HPC channels} are of course unavailable from @code{ci.guix.gnu.org}. For these packages, you may want to extend the white list such that source and pre-built binaries (assuming this-party servers provide binaries for these packages) can be downloaded. As a last resort, users can always download source on their workstation and add it to the cluster's @file{/gnu/store}, like this:
ta: பல்வேறு @uref{https://hpc.guix.info/channels, HPC சேனல்கள்} போன்ற ஒரு தனி களஞ்சியத்தில் பராமரிக்கப்படும் மென்பொருள் தொகுப்புகள் நிச்சயமாக @code{ci.guix.gnu.org} இலிருந்து கிடைக்காது. இந்தத் தொகுப்புகளுக்கு, நீங்கள் வெள்ளைப் பட்டியலை நீட்டிக்க விரும்பலாம், அதாவது மூல மற்றும் முன் கட்டப்பட்ட பைனரிகள் (இந்தத் தரப்பு சேவையகங்கள் இந்தத் தொகுப்புகளுக்குப் பைனரிகளை வழங்குகின்றன என்று வைத்துக்கொள்வோம்) பதிவிறக்கம் செய்யலாம். கடைசி முயற்சியாக, பயனர்கள் எப்போதும் தங்கள் பணிநிலையத்தில் மூலத்தைப் பதிவிறக்கம் செய்து, கிளச்டரின் @file{/gnu/store} இல் சேர்க்கலாம் @file{/gnu/store}, இதைப் போல:

source: GUIX_DAEMON_SOCKET=ssh://compute-node.example.org \ guix download http://starpu.gforge.inria.fr/files/starpu-1.2.3/starpu-1.2.3.tar.gz
ta: GUIX_DAEMON_SOCKET=ssh://compute-node.example.org \ guix பதிவிறக்கம் http://starpu.gforge.inria.fr/files/starpu-1.2.3/starpu-1.2.3.tar.gz

source: The above command downloads @code{starpu-1.2.3.tar.gz} @emph{and} sends it to the cluster's @code{guix-daemon} instance over SSH.
ta: மேலே உள்ள கட்டளை @code{starpu-1.2.3.tar.gz} @emph{and} ஐப் பதிவிறக்குகிறது, பாஓடு வழியாக கிளச்டரின் @code{guix-daemon} நிகழ்விற்கு அனுப்புகிறது.
