Repository: 247i/TACETr
Catalog: உரை/தானி/guix-documentation-cookbook-*.po
Languages: ta

source: In the above example @code{%file-systems} is a collection of flags enabling different file system support, @code{%efi-support} enables EFI support and @code{%emulation} enables a x86_64-linux machine to act in 32-bit mode also. The @code{default-extra-linux-options} procedure is the one defined above, which had to be used to avoid losing the default configuration options of the @code{extra-options} keyword.
ta: மேலே உள்ள எடுத்துக்காட்டில் @code{%file-systems} என்பது வெவ்வேறு கோப்பு முறைமை ஆதரவை செயல்படுத்தும் கொடிகளின் தொகுப்பாகும், @code{%efi-support} என்பது EFI ஆதரவை செயல்படுத்துகிறது மற்றும் @code{%emulation} ஒரு x86_64-linux இயந்திரத்தை 32-பிட் பயன்முறையிலும் செயல்படச் செய்கிறது. @code{default-extra-linux-options} செயல்முறையானது மேலே வரையறுக்கப்பட்டதாகும், இது @code{extra-options} முக்கிய வார்த்தையின் இயல்புநிலை உள்ளமைவு விருப்பங்களை இழப்பதைத் தவிர்க்கப் பயன்படுத்தப்பட வேண்டும்.

source: This all sounds like it should be doable, but how does one even know which modules are required for a particular system? Two places that can be helpful in trying to answer this question is the @uref{https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Kernel, Gentoo Handbook} and the @uref{https://www.kernel.org/doc/html/latest/admin-guide/README.html?highlight=localmodconfig, documentation from the kernel itself}. From the kernel documentation, it seems that @code{make localmodconfig} is the command we want.
ta: இவை அனைத்தும் செய்யக்கூடியது போல் தெரிகிறது, ஆனால் ஒரு குறிப்பிட்ட அமைப்பிற்கு எந்த தொகுதிகள் தேவை என்பதை ஒருவர் எப்படி அறிவார்? இந்தக் கேள்விக்குப் பதிலளிக்கும் முயற்சியில் உதவியாக இருக்கும் இரண்டு இடங்கள் @uref{https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Kernel, Gentoo Handbook} மற்றும் @uref{https://www.kernel.org/doc/html/latest/admin-guide/READmghighlight? கர்னல் தன்னை}. கர்னல் ஆவணத்தில் இருந்து, @code{make localmodconfig} என்பது நாம் விரும்பும் கட்டளை என்று தெரிகிறது.

source: In order to actually run @code{make localmodconfig} we first need to get and unpack the kernel source code:
ta: உண்மையில் @code{make localmodconfig} ஐ இயக்க, நாம் முதலில் கர்னல் மூலக் குறியீட்டைப் பெற்றுத் திறக்க வேண்டும்:

source: tar xf $(guix build linux-libre --source)
ta: கரிக்கீல் xf $(guix உருவாக்கு linux-libre --source)

source: Once inside the directory containing the source code run @code{touch .config} to create an initial, empty @file{.config} to start with. @code{make localmodconfig} works by seeing what you already have in @file{.config} and letting you know what you're missing. If the file is blank then you're missing everything. The next step is to run:
ta: மூலக் குறியீட்டைக் கொண்ட கோப்பகத்தின் உள்ளே சென்றதும், @code{touch .config} ஐ இயக்கவும், தொடக்க, காலியான @file{.config} ஐ உருவாக்கவும். @code{make localmodconfig} ஆனது @file{.config} இல் நீங்கள் ஏற்கனவே வைத்திருப்பதைப் பார்த்து, நீங்கள் எதைக் காணவில்லை என்பதை உங்களுக்குத் தெரியப்படுத்துகிறது. கோப்பு காலியாக இருந்தால், நீங்கள் எல்லாவற்றையும் இழக்கிறீர்கள். அடுத்த படி இயக்க வேண்டும்:

source: guix shell -D linux-libre -- make localmodconfig
ta: guix ஓடு -D linux-libre -- localmodconfig ஐ உருவாக்கவும்

source: and note the output. Do note that the @file{.config} file is still empty. The output generally contains two types of warnings. The first start with "WARNING" and can actually be ignored in our case. The second read:
ta: மற்றும் வெளியீட்டைக் கவனியுங்கள். @file{.config} கோப்பு இன்னும் காலியாக உள்ளது என்பதை நினைவில் கொள்ளவும். வெளியீடு பொதுவாக இரண்டு வகையான எச்சரிக்கைகளைக் கொண்டுள்ளது. முதல் தொடக்கம் "முன்னறிவிப்பு" மற்றும் உண்மையில் எங்கள் விசயத்தில் புறக்கணிக்கப்படலாம். இரண்டாவது படித்தது:

source: module pcspkr did not have configs CONFIG_INPUT_PCSPKR
ta: தொகுதி pcspkr இல் கட்டமைப்புகள் இல்லை CONFIG_INPUT_PCSPKR

source: For each of these lines, copy the @code{CONFIG_XXXX_XXXX} portion into the @file{.config} in the directory, and append @code{=m}, so in the end it looks like this:
ta: இந்த ஒவ்வொரு வரிக்கும், @code{CONFIG_XXXX_XXXX} பகுதியை கோப்பகத்தில் உள்ள @file{.config} இல் நகலெடுத்து, @code{=m} ஐ இணைக்கவும், இறுதியில் இது இப்படி இருக்கும்:

source: After copying all the configuration options, run @code{make localmodconfig} again to make sure that you don't have any output starting with ``module''. After all of these machine specific modules there are a couple more left that are also needed. @code{CONFIG_MODULES} is necessary so that you can build and load modules separately and not have everything built into the kernel. @code{CONFIG_BLK_DEV_SD} is required for reading from hard drives. It is possible that there are other modules which you will need.
ta: அனைத்து உள்ளமைவு விருப்பங்களையும் நகலெடுத்த பிறகு, @code{make localmodconfig} ஐ மீண்டும் இயக்கவும், ``module'' உடன் தொடங்கும் வெளியீடு எதுவும் உங்களிடம் இல்லை என்பதை உறுதிப்படுத்தவும். இந்த இயந்திர குறிப்பிட்ட தொகுதிகள் அனைத்திற்கும் பிறகு இன்னும் ஒரு இணை மீதமுள்ளது, அவை தேவைப்படுகின்றன. @code{CONFIG_MODULES} தேவை, எனவே நீங்கள் தனித்தனியாக தொகுதிகளை உருவாக்கலாம் மற்றும் ஏற்றலாம் மற்றும் எல்லாவற்றையும் கர்னலில் கட்டமைக்க முடியாது. ஆர்டு டிரைவ்களில் இருந்து படிக்க @code{CONFIG_BLK_DEV_SD} தேவை. உங்களுக்குத் தேவைப்படும் மற்ற தொகுதிகள் இருக்கலாம்.

source: This post does not aim to be a guide to configuring your own kernel however, so if you do decide to build a custom kernel you'll have to seek out other guides to create a kernel which is just right for your needs.
ta: இந்த இடுகை உங்கள் சொந்த கர்னலை உள்ளமைப்பதற்கான வழிகாட்டியாக இருக்கவில்லை, எனவே தனிப்பயன் கர்னலை உருவாக்க நீங்கள் முடிவு செய்தால், உங்கள் தேவைகளுக்கு ஏற்ற கர்னலை உருவாக்க மற்ற வழிகாட்டிகளைத் தேட வேண்டும்.

source: The second way to setup the kernel configuration makes more use of Guix's features and allows you to share configuration segments between different kernels. For example, all machines using EFI to boot have a number of EFI configuration flags that they need. It is likely that all the kernels will share a list of file systems to support. By using variables it is easier to see at a glance what features are enabled and to make sure you don't have features in one kernel but missing in another.
ta: கர்னல் உள்ளமைவை அமைப்பதற்கான இரண்டாவது வழி Guix இன் அம்சங்களை அதிகம் பயன்படுத்துகிறது மற்றும் வெவ்வேறு கர்னல்களுக்கு இடையே உள்ளமைவு பிரிவுகளைப் பகிர உங்களை அனுமதிக்கிறது. எடுத்துக்காட்டாக, துவக்குவதற்கு EFI ஐப் பயன்படுத்தும் அனைத்து இயந்திரங்களும் தங்களுக்குத் தேவையான பல EFI உள்ளமைவுக் கொடிகளைக் கொண்டுள்ளன. அனைத்து கர்னல்களும் ஆதரிக்கும் கோப்பு முறைமைகளின் பட்டியலைப் பகிரும். மாறிகளைப் பயன்படுத்துவதன் மூலம், என்ன நற்பொருத்தங்கள் இயக்கப்பட்டுள்ளன என்பதை ஒரே பார்வையில் பார்ப்பது மற்றும் ஒரு கர்னலில் நற்பொருத்தங்கள் இல்லை, ஆனால் மற்றொன்றில் காணவில்லை என்பதை உறுதிப்படுத்துவது எளிது.

source: Left undiscussed however, is Guix's initrd and its customization. It is likely that you'll need to modify the initrd on a machine using a custom kernel, since certain modules which are expected to be built may not be available for inclusion into the initrd.
ta: இருப்பினும் விவாதிக்கப்படாதது Guix இன் initrd மற்றும் அதன் தனிப்பயனாக்கம் ஆகும். தனிப்பயன் கர்னலைப் பயன்படுத்தி கணினியில் initrd ஐ மாற்ற வேண்டியிருக்கலாம், ஏனெனில் உருவாக்கப்படும் என்று எதிர்பார்க்கப்படும் சில தொகுதிகள் initrd இல் சேர்க்கப்படாமல் போகலாம்.

source: Historically, Guix System is centered around an @code{operating-system} structure. This structure contains various fields ranging from the bootloader and kernel declaration to the services to install.
ta: வரலாற்று ரீதியாக, Guix சிச்டம் @code{operating-system} கட்டமைப்பை மையமாகக் கொண்டது. இந்த கட்டமைப்பானது துவக்க ஏற்றி மற்றும் கர்னல் அறிவிப்பு முதல் நிறுவ வேண்டிய சேவைகள் வரை பல்வேறு துறைகளைக் கொண்டுள்ளது.

source: Depending on the target machine, that can go from a standard @code{x86_64} machine to a small ARM single board computer such as the Pine64, the image constraints can vary a lot. The hardware manufacturers will impose different image formats with various partition sizes and offsets.
ta: இலக்கு இயந்திரத்தைப் பொறுத்து, அது நிலையான @code{x86_64} இயந்திரத்திலிருந்து Pine64 போன்ற சிறிய கை சிங்கிள் போர்டு கணினிக்கு செல்லலாம், படக் கட்டுப்பாடுகள் மிகவும் மாறுபடும். வன்பொருள் உற்பத்தியாளர்கள் பல்வேறு பகிர்வு அளவுகள் மற்றும் ஆஃப்செட்களுடன் வெவ்வேறு பட வடிவங்களை திணிப்பார்கள்.

source: To create images suitable for all those machines, a new abstraction is necessary: that's the goal of the @code{image} record. This record contains all the required information to be transformed into a standalone image, that can be directly booted on any target machine.
ta: அந்த எல்லா இயந்திரங்களுக்கும் பொருத்தமான படங்களை உருவாக்க, ஒரு புதிய சுருக்கம் அவசியம்: அதுதான் @code{image} பதிவின் குறிக்கோள். இந்த பதிவில் ஒரு முழுமையான படமாக மாற்றுவதற்கு தேவையான அனைத்து தகவல்களும் உள்ளன, அவை எந்த இலக்கு கணினியிலும் நேரடியாக துவக்கப்படும்.

source: (define-record-type* <image> image make-image image? (name image-name ;symbol (default #f)) (format image-format) ;symbol (target image-target (default #f)) (size image-size ;size in bytes as integer (default 'guess)) (operating-system image-operating-system ;<operating-system> (default #f)) (partitions image-partitions ;list of <partition> (default '())) (compression? image-compression? ;boolean (default #t)) (volatile-root? image-volatile-root? ;boolean (default #t)) (substitutable? image-substitutable? ;boolean (default #t)))
ta: (define-record-type* <image> படத்தை உருவாக்க-படம் படம்? (பெயர் படம்-பெயர்; அடையாளம் (இயல்பு #f)) (பட வடிவம் வடிவம்) ;சின்னம் (இலக்கு படம்-இலக்கு (இயல்பு #f)) (அளவு படத்தின் அளவு ;பைட்டுகளில் முழு எண்ணாக அளவு (இயல்புநிலை யூகம்)) (ஆப்பரேட்டிங்-சிச்டம் இமேச்-ஆப்பரேட்டிங்-சிச்டம் ;<operating-system> (இயல்பு #f)) (partitions image-partitions ;list of <partition> (இயல்புநிலை '())) (அமுக்கம்? படம்-அமுக்கம்? ;பூலியன் (இயல்பு #t)) (கொந்தளிப்பான-வேர்? படம்- ஆவியாகும்-வேர்? ;பூலியன் (இயல்பு #t)) (மாற்று? படம்-மாற்று? ;பூலியன் (இயல்பு #t)))

source: This record contains the operating-system to instantiate. The @code{format} field defines the image type and can be @code{efi-raw}, @code{qcow2} or @code{iso9660} for instance. In the future, it could be extended to @code{docker} or other image types.
ta: இந்த பதிவில் உடனடியான இயக்க முறைமை உள்ளது. @code{format} புலம் படத்தின் வகையை வரையறுக்கிறது மேலும் இது @code{efi-raw}, @code{qcow2} அல்லது @code{iso9660} ஆக இருக்கலாம். எதிர்காலத்தில், இது @code{docker} அல்லது பிற பட வகைகளுக்கு நீட்டிக்கப்படலாம்.

source: A new directory in the Guix sources is dedicated to images definition. For now there are four files:
ta: Guix மூலங்களில் ஒரு புதிய அடைவு படங்கள் வரையறைக்கு அர்ப்பணிக்கப்பட்டுள்ளது. இப்போது நான்கு கோப்புகள் உள்ளன:

source: Let's have a look to @file{pine64.scm}. It contains the @code{pine64-barebones-os} variable which is a minimal definition of an operating-system dedicated to the @b{Pine A64 LTS} board.
ta: @file{pine64.scm}ஐப் பார்க்கலாம். இது @b{Pine A64 LTS} போர்டுக்கு அர்ப்பணிக்கப்பட்ட இயக்க முறைமையின் குறைந்தபட்ச வரையறையான @code{pine64-barebones-os} மாறியைக் கொண்டுள்ளது.

source: (define pine64-barebones-os (operating-system (host-name "vignemale") (timezone "Europe/Paris") (locale "en_US.utf8") (bootloader (bootloader-configuration (bootloader u-boot-pine64-lts-bootloader) (targets '("/dev/vda")))) (initrd-modules '()) (kernel linux-libre-arm64-generic) (file-systems (cons (file-system (device (file-system-label "my-root")) (mount-point "/") (type "ext4")) %base-file-systems)) (services (cons (service agetty-service-type (agetty-configuration (extra-options '("-L")) ; no carrier detect (baud-rate "115200") (term "vt100") (tty "ttyS0"))) %base-services))))
ta: (pine64-barebones-os ஐ வரையறுக்கவும் (இயக்க அமைப்பு (புரவலன்-பெயர் "விக்னெமேல்") (நேர மண்டலம் "ஐரோப்பா/பாரிச்") (உள்ளூர் "en_US.utf8") (பூட்லோடர் (பூட்லோடர்-கட்டமைப்பு (bootloader u-boot-pine64-lts-bootloader) (இலக்குகள் '("/dev/vda"))) (initrd-modules '()) (kernel linux-libre-arm64-generic) (கோப்பு முறைமைகள் (தீமைகள் (கோப்பு முறை (சாதனம் (கோப்பு முறை-லேபிள் "மை-ரூட்")) (மவுண்ட்-பாயின்ட் "/") (வகை "ext4")) %base-file-systems)) (சேவைகள் (தீமைகள் (சேவை ஏசெட்டி-சேவை வகை (அசெட்டி-கட்டமைப்பு (கூடுதல் விருப்பங்கள் '("-L")) ; கேரியர் கண்டறியவில்லை (பாட்-ரேட் "115200") (சொல் "vt100") (tty "ttyS0"))) %அடிப்படை-சேவைகள்))))

source: The @code{kernel} and @code{bootloader} fields are pointing to packages dedicated to this board.
ta: @code{kernel} மற்றும் @code{bootloader} புலங்கள் இந்தப் பலகைக்கு அர்ப்பணிக்கப்பட்ட தொகுப்புகளை சுட்டிக்காட்டுகின்றன.

source: Right below, the @code{pine64-image-type} variable is also defined.
ta: கீழேயே, @code{pine64-image-type} மாறியும் வரையறுக்கப்பட்டுள்ளது.

source: (define pine64-image-type (image-type (name 'pine64-raw) (constructor (cut image-with-os arm64-disk-image <>))))
ta: (பைன்64-பட-வகையை வரையறுக்கவும் (பட வகை (பெயர் 'pine64-raw) (கட்டமைப்பாளர் (கட் படம்-வித்-ஓஎச் ஆர்ம்64-டிச்க்-படம் <>))))

source: It's using a record we haven't talked about yet, the @code{image-type} record, defined this way:
ta: இது நாம் இதுவரை பேசாத ஒரு பதிவைப் பயன்படுத்துகிறது, @code{image-type} பதிவு, இவ்வாறு வரையறுக்கப்பட்டுள்ளது:

source: (define-record-type* <image-type> image-type make-image-type image-type? (name image-type-name) ;symbol (constructor image-type-constructor)) ;<operating-system> -> <image>
ta: (define-record-type* <image-type> பட-வகை செய்ய-பட-வகை பட வகை? (பெயர் படம்-வகை-பெயர்) ;சின்னம் (கன்ச்ட்ரக்டர் இமேச்-டைப்-கன்ச்ட்ரக்டர்)) ;<operating-system> -> <image>

source: The main purpose of this record is to associate a name to a procedure transforming an @code{operating-system} to an image. To understand why it is necessary, let's have a look to the command producing an image from an @code{operating-system} configuration file:
ta: இந்தப் பதிவின் முக்கிய நோக்கம், @code{operating-system} ஐ ஒரு படமாக மாற்றும் செயல்முறைக்கு ஒரு பெயரை இணைப்பதாகும். இது ஏன் தேவை என்பதைப் புரிந்து கொள்ள, @code{operating-system} உள்ளமைவு கோப்பிலிருந்து படத்தை உருவாக்கும் கட்டளையைப் பார்ப்போம்:

source: guix system image my-os.scm
ta: guix அமைப்பு படம் my-os.scm

source: This command expects an @code{operating-system} configuration but how should we indicate that we want an image targeting a Pine64 board? We need to provide an extra information, the @code{image-type}, by passing the @code{--image-type} or @code{-t} flag, this way:
ta: இந்தக் கட்டளை ஒரு @code{operating-system} உள்ளமைவை எதிர்பார்க்கிறது ஆனால் Pine64 போர்டை இலக்காகக் கொண்ட ஒரு படத்தை நாம் எப்படிக் குறிப்பிட வேண்டும்? இந்த வழியில் @code{--image-type} அல்லது @code{-t} கொடியைக் கடந்து, @code{image-type} என்ற கூடுதல் தகவலை நாங்கள் வழங்க வேண்டும்:

source: guix system image --image-type=pine64-raw my-os.scm
ta: guix அமைப்பு படம் --image-type=pine64-raw my-os.scm

source: This @code{image-type} parameter points to the @code{pine64-image-type} defined above. Hence, the @code{operating-system} declared in @code{my-os.scm} will be applied the @code{(cut image-with-os arm64-disk-image <>)} procedure to turn it into an image.
ta: இந்த @code{image-type} அளவுரு மேலே வரையறுக்கப்பட்ட @code{pine64-image-type}ஐக் குறிக்கிறது. எனவே, @code{my-os.scm} இல் அறிவிக்கப்பட்டுள்ள @code{operating-system}, அதை ஒரு படமாக மாற்ற @code{(cut image-with-os arm64-disk-image <>)} செயல்முறை பயன்படுத்தப்படும்.

source: The resulting image looks like:
ta: இதன் விளைவாக வரும் படம் இதுபோல் தெரிகிறது:

source: (image (format 'disk-image) (target "aarch64-linux-gnu") (operating-system my-os) (partitions (list (partition (inherit root-partition) (offset root-offset)))))
ta: (படம் (வடிவமைப்பு 'வட்டு-படம்) (இலக்கு "aarch64-linux-gnu") (இயக்க முறைமை my-os) (பகிர்வுகள் (பட்டியல் (பகிர்வு (ரூட்-பகிர்வு மரபுரிமை) (ஆஃப்செட் ரூட்-ஆஃப்செட்)))))

source: which is the aggregation of the @code{operating-system} defined in @code{my-os.scm} to the @code{arm64-disk-image} record.
ta: @code{my-os.scm} இல் @code{arm64-disk-image} பதிவில் வரையறுக்கப்பட்ட @code{operating-system} இன் ஒருங்கிணைப்பு ஆகும்.

source: But enough Scheme madness. What does this image API bring to the Guix user?
ta: ஆனால் போதுமான ச்கீம் பைத்தியம். Guix பயனருக்கு இந்தப் பட பநிஇ என்ன தருகிறது?

source: One can run:
ta: ஒருவர் இயக்கலாம்:

source: mathieu@@cervin:~$ guix system --list-image-types The available image types are:
ta: mathieu@@cervin:~$ guix அமைப்பு --list-image-types கிடைக்கக்கூடிய பட வகைகள்:

source: - unmatched-raw - rock64-raw - pinebook-pro-raw - pine64-raw - novena-raw - hurd-raw - hurd-qcow2 - qcow2 - iso9660 - uncompressed-iso9660 - tarball - efi-raw - mbr-raw - docker - wsl2 - raw-with-offset - efi32-raw
ta: - பொருந்தாத-பச்சை - rock64-raw - pinebook-pro-raw - pine64-raw - novena-raw - அர்ட்-ரா - hurd-qcow2 - qcow2 - iso9660 - uncompressed-iso9660 - தார் பந்து - எஃபி-ரா - mbr-raw - டாக்கர் - wsl2 - ரா-வித்-ஆஃப்செட் - efi32-raw

source: and by writing an @code{operating-system} file based on @code{pine64-barebones-os}, you can customize your image to your preferences in a file (@file{my-pine-os.scm}) like this:
ta: @code{pine64-barebones-os} ஐ அடிப்படையாகக் கொண்ட @code{operating-system} கோப்பை எழுதுவதன் மூலம், இது போன்ற ஒரு கோப்பில் (@file{my-pine-os.scm}) உங்கள் விருப்பத்திற்கு ஏற்ப உங்கள் படத்தைத் தனிப்பயனாக்கலாம்:

source: (use-modules (gnu services linux) (gnu system images pine64))
ta: (பயன்படுத்தும் தொகுதிகள் (gnu சேவைகள் linux) (gnu அமைப்பு படங்கள் pine64))

source: (let ((base-os pine64-barebones-os)) (operating-system (inherit base-os) (timezone "America/Indiana/Indianapolis") (services (cons (service earlyoom-service-type (earlyoom-configuration (prefer-regexp "icecat|chromium"))) (operating-system-user-services base-os)))))
ta: (((base-os pine64-barebones-os)) (இயக்க அமைப்பு (பேச்-ஓஎச் மரபுரிமை) (நேர மண்டலம் "அமெரிக்கா/இந்தியானா/இந்தியனாபோலிச்") (சேவைகள் (பாதிப்பு (சேவை ஆரம்ப-சேவை-வகை (முன்கூட்டிய-கட்டமைப்பு (prefer-regexp "icecat|chromium"))) (இயக்க முறைமை-பயனர்-சேவைகள் அடிப்படை-OS))))

source: run:
ta: இயக்கு:

source: guix system image --image-type=pine64-raw my-pine-os.scm
ta: guix அமைப்பு படம் --image-type=pine64-raw my-pine-os.scm

source: or,
ta: அல்லது,

source: guix system image --image-type=hurd-raw my-hurd-os.scm
ta: guix அமைப்பு படம் --image-type=hurd-raw my-hurd-os.scm

source: to get an image that can be written directly to a hard drive and booted from.
ta: ஒரு ஆர்ட் டிரைவில் நேரடியாக எழுதப்பட்டு துவக்கக்கூடிய படத்தைப் பெற.

source: Without changing anything to @code{my-hurd-os.scm}, calling:
ta: @code{my-hurd-os.scm}க்கு எதையும் மாற்றாமல், அழைக்கவும்:

source: guix system image --image-type=hurd-qcow2 my-hurd-os.scm
ta: guix அமைப்பு படம் --image-type=hurd-qcow2 my-hurd-os.scm

source: will instead produce a Hurd QEMU image.
ta: பதிலாக அர்ட் கியூஇஎம்யூ படத்தை உருவாக்கும்.

source: 2FA, two-factor authentication
ta: 2FA, இரு காரணி ஏற்பு

source: U2F, Universal 2nd Factor
ta: U2F, யுனிவர்சல் 2வது காரணி

source: security key, configuration
ta: பாதுகாப்பு விசை, கட்டமைப்பு

source: The use of security keys can improve your security by providing a second authentication source that cannot be easily stolen or copied, at least for a remote adversary (something that you have), to the main secret (a passphrase -- something that you know), reducing the risk of impersonation.
ta: பாதுகாப்பு விசைகளைப் பயன்படுத்துவது, எளிதில் திருடப்படவோ அல்லது நகலெடுக்கவோ முடியாத இரண்டாவது அங்கீகார மூலத்தை வழங்குவதன் மூலம் உங்கள் பாதுகாப்பை மேம்படுத்தலாம், குறைந்தபட்சம் தொலைநிலை எதிரிக்கு (உங்களிடம் உள்ள ஒன்று), முக்கிய மறைபொருள் (கடவுச்சொல் -- உங்களுக்குத் தெரிந்த ஒன்று), ஆள்மாறாட்டம் ஆபத்தை குறைக்கும்.

source: The example configuration detailed below showcases what minimal configuration needs to be made on your Guix System to allow the use of a Yubico security key. It is hoped the configuration can be useful for other security keys as well, with minor adjustments.
ta: கீழே விவரிக்கப்பட்டுள்ள எடுத்துக்காட்டு உள்ளமைவு, Yubico பாதுகாப்பு விசையைப் பயன்படுத்த அனுமதிக்க உங்கள் Guix கணினியில் என்ன குறைந்தபட்ச உள்ளமைவு செய்யப்பட வேண்டும் என்பதைக் காட்டுகிறது. சிறிய மாற்றங்களுடன், மற்ற பாதுகாப்பு விசைகளுக்கும் உள்ளமைவு பயனுள்ளதாக இருக்கும் என நம்பப்படுகிறது.

source: Configuration for use as a two-factor authenticator (2FA)
ta: இரண்டு காரணி அங்கீகரிப்பாளராகப் பயன்படுத்துவதற்கான கட்டமைப்பு (2FA)

source: To be usable, the udev rules of the system should be extended with key-specific rules. The following shows how to extend your udev rules with the @file{lib/udev/rules.d/70-u2f.rules} udev rule file provided by the @code{libfido2} package from the @code{(gnu packages security-token)} module and add your user to the @samp{"plugdev"} group it uses:
ta: பயன்படுத்தக்கூடியதாக இருக்க, கணினியின் udev விதிகள் முக்கிய-குறிப்பிட்ட விதிகளுடன் நீட்டிக்கப்பட வேண்டும். @code{(gnu தொகுப்பு security-token)} தொகுதியிலிருந்து @code{libfido2} தொகுப்பால் வழங்கப்பட்ட @file{lib/udev/rules.d/70-u2f.rules} udev விதிக் கோப்புடன் உங்கள் udev விதிகளை எவ்வாறு நீட்டிப்பது மற்றும் அது பயன்படுத்தும் @samp{"plugdev"} குழுவில் உங்கள் பயனரைச் சேர்ப்பது எப்படி என்பதை பின்வரும் காட்டுகிறது:

source: (use-package-modules ... security-token ...) ... (operating-system ... (users (cons* (user-account (name "your-user") (group "users") (supplementary-groups '("wheel" "netdev" "audio" "video" "plugdev")) ;<- added system group (home-directory "/home/your-user")) %base-user-accounts)) ... (services (cons* ... (udev-rules-service 'fido2 libfido2 #:groups '("plugdev")))))
ta: (பயன்பாடு-தொகுப்பு-தொகுதிகள் ... பாதுகாப்பு-டோக்கன் ...) ... (இயக்க அமைப்பு ... (பயனர்கள் (தீமைகள்* (பயனர் கணக்கு (பெயர் "உங்கள்-பயனர்") (குழு "பயனர்கள்") (துணை குழுக்கள் '("சக்கரம்" "நெட்தேவ்" "ஆடியோ" "வீடியோ" "plugdev")) ;<- கணினி குழுவைச் சேர்த்தது (முகப்பு அடைவு "/ஓம்/உங்கள்-பயனர்")) %பேச்-பயனர்-கணக்குகள்)) ... (சேவைகள் (தீமைகள்* ... (udev-rules-service 'fido2 libfido2 #:groups '("plugdev"))))

source: After re-configuring your system and re-logging in your graphical session so that the new group is in effect for your user, you can verify that your key is usable by launching:
ta: உங்கள் கணினியை மீண்டும் கட்டமைத்து, உங்கள் வரைகலை அமர்வில் மீண்டும் உள்நுழைந்த பிறகு, புதிய குழு உங்கள் பயனருக்கு நடைமுறையில் இருக்கும், துவக்குவதன் மூலம் உங்கள் விசை பயன்படுத்தக்கூடியதா என்பதை நீங்கள் சரிபார்க்கலாம்:

source: guix shell ungoogled-chromium -- chromium chrome://settings/securityKeys
ta: guix ஓடு ungoogled-chromium -- நீலிரும்பு, குருமம் chrome://settings/securityKeys

source: and validating that the security key can be reset via the ``Reset your security key'' menu. If it works, congratulations, your security key is ready to be used with applications supporting two-factor authentication (2FA).
ta: மற்றும் ``உங்கள் பாதுகாப்பு விசையை மீட்டமை'' பட்டியல் மூலம் பாதுகாப்பு விசையை மீட்டமைக்க முடியும் என்பதை சரிபார்க்கிறது. இது வேலை செய்தால், வாழ்த்துக்கள், உங்கள் பாதுகாப்பு விசை இரண்டு காரணி அங்கீகாரத்தை (2FA) ஆதரிக்கும் பயன்பாடுகளுடன் பயன்படுத்த தயாராக உள்ளது.

source: Disabling OTP code generation for a Yubikey
ta: யூபிகேக்கான OTP குறியீடு உருவாக்கத்தை முடக்குகிறது

source: disabling yubikey OTP
ta: yubikey OTP ஐ முடக்குகிறது

source: If you use a Yubikey security key and are irritated by the spurious OTP codes it generates when inadvertently touching the key (e.g. causing you to become a spammer in the @samp{#guix} channel when discussing from your favorite IRC client!), you can disable it via the following @command{ykman} command:
ta: நீங்கள் Yubikey பாதுகாப்பு விசையைப் பயன்படுத்தினால், விசையை கவனக்குறைவாகத் தொடும்போது அது உருவாக்கும் போலி OTP குறியீடுகளால் எரிச்சல் அடைந்தால் (எ.கா. உங்களுக்குப் பிடித்த IRC கிளையண்டிடம் விவாதிக்கும்போது @samp{#guix} சேனலில் ச்பேமராக மாறுவது!), பின்வரும் @command{ykman} கட்டளையின் மூலம் அதை முடக்கலாம்:

source: guix shell python-yubikey-manager -- ykman config usb --force --disable OTP
ta: guix ஓடு python-yubikey-manager -- ykman கட்டமைப்பு usb --force --OTP ஐ முடக்கு
