Repository: 247i/TACETr
Catalog: உரை/தானி/harbour-file-browser-translations-*.po
Languages: ta

# AboutPage
source: A fully-fledged file manager for Sailfish OS.
ta: SAILFISH OS க்கான முழுமையான கோப்பு மேலாளர்.

# AboutPage
source: Development
ta: வளர்ச்சி

# AboutPage
source: Programming
ta: நிரலாக்க

# AboutPage
source: Icon Design
ta: படவுரு வடிவமைப்பு

# AboutPage
source: Translations
ta: மொழிபெயர்ப்புகள்

# AboutPage
source: Romanian
ta: ருமேனிய

# AboutPage
source: Norwegian Bokmål
ta: நார்வேசியன் பொக்மால்

# AboutPage
source: English
ta: ஆங்கிலம்

# AboutPage
source: Belarusian
ta: பெலாருசியன்

# AboutPage
source: German
ta: செர்மன்

# AboutPage
source: Finnish
ta: பின்னிச்

# AboutPage
source: Dutch (Belgium)
ta: டச்சு (பெல்சியம்)

# AboutPage
source: Chinese
ta: சீன

# AboutPage
source: Russian
ta: ரச்ய

# AboutPage
source: Swedish
ta: ச்வீடிச்

# AboutPage
source: Ukrainian
ta: உக்ரேனிய

# AboutPage
source: Italian
ta: இத்தாலிய

# AboutPage
source: Spanish
ta: ச்பானிச்

# AboutPage
source: French
ta: பிரஞ்சு

# AboutPage
source: Dutch
ta: டச்சு

# AboutPage
source: Greek
ta: கிரேக்கம்

# AboutPage
source: Czech
ta: செக்

# AboutPage
source: Slovak
ta: ச்லோவாக்

# AboutPage
source: Hungarian
ta: அங்கேரியன்

# AboutPage
source: Estonian
ta: எச்டோனிய

# AboutPage
source: Polish
ta: போலீச்

# AboutPage
source: Indonesian
ta: இந்தோனேசிய

# AboutPage
source: Turkish
ta: துருக்கிய

# AskForSupport
source: Please take a moment to consider if you can contribute to this project in one way or another.
ta: இந்த திட்டத்திற்கு நீங்கள் ஒரு வழியில் அல்லது வேறு வழியில் பங்களிக்க முடியுமா என்பதைக் கருத்தில் கொள்ள சிறிது நேரம் ஒதுக்குங்கள்.

# BookmarksModel
source: Memory card
ta: நினைவக அட்டை

# BookmarksModel
source: Attached folder
ta: இணைக்கப்பட்ட கோப்புறை

# BookmarksModel
source: Remote folder
ta: தொலை கோப்புறை

# BookmarksModel
source: Removable media
ta: நீக்கக்கூடிய மீடியா

# BookmarksModel
source: Internal storage
ta: உள் சேமிப்பு

# BookmarksModel
source: “%1” on “%2”
ta: “%2” இல் “%1”

# BookmarksModel
source: Home
ta: வீடு

# BookmarksModel
source: Documents
ta: ஆவணங்கள்

# BookmarksModel
source: Downloads
ta: பதிவிறக்கங்கள்

# BookmarksModel
source: Music
ta: இசை

# BookmarksModel
source: Pictures
ta: படங்கள்

# BookmarksModel
source: Videos
ta: வீடியோக்கள்

# BookmarksModel
source: Android storage
ta: ஆண்ட்ராய்டு சேமிப்பு

# BookmarksModel
source: Root
ta: மூலம்

# BookmarksRenameDialog as in 'apply these changes'
source: Apply
ta: இடு

# BookmarksRenameDialog
source: Rename bookmarks
ta: புக்மார்க்குகளை மறுபெயரிடுங்கள்

# BookmarksRenameDialog
source: Name must not be empty
ta: பெயர் காலியாக இருக்கக்கூடாது

# BookmarksSortPage
source: Sort bookmarks
ta: புக்மார்க்குகளை வரிசைப்படுத்துங்கள்

# ClipboardPage
source: Clipboard
ta: இடைநிலைப் பலகை

# ClipboardPage
source: %n item to be copied
ta: %N உருப்படி நகலெடுக்கப்பட வேண்டும்

# ClipboardPage
source: %n item to be moved
ta: %N உருப்படி நகர்த்தப்பட வேண்டும்

# ClipboardPage
source: Remove from clipboard
ta: கிளிப்போர்டிலிருந்து அகற்று

# ClipboardPage
source: Open this folder
ta: இந்த கோப்புறையைத் திறக்கவும்

# ClipboardPage
source: %n item to be linked
ta: இணைக்கப்பட வேண்டிய %n உருப்படி

# ClipboardPage verb as in 'clear all contents from the clipboard'
source: Clear
ta: தெளிவான

# ClipboardPage
source: Clipboard cleared
ta: கிளிப்போர்டு அழிக்கப்பட்டது

# ClipboardPage
source: Open containing folder
ta: கோப்புறை கொண்ட திறந்த

# ClipboardPage
source: Empty
ta: காலி

# ClipboardPage
source: Cut or copied files will be shown here.
ta: வெட்டு அல்லது நகலெடுக்கப்பட்ட கோப்புகள் இங்கே காண்பிக்கப்படும்.

# ConsoleModel
source: ** crashed
ta: ** செயலிழந்தது

# ConsoleModel
source: ** error: %1
ta: ** பிழை: %1

# ConsoleModel
source: ** command “%1” not found
ta: ** கட்டளை “%1” காணப்படவில்லை

# ConsoleModel
source: ** timeout reached
ta: ** நேரம் முடிந்தது

# ConsoleModel
source: ** internal communication failed
ta: ** உள் தொடர்பு தோல்வியுற்றது

# ConsoleModel
source: ** an unknown error occurred
ta: ** அறியப்படாத பிழை ஏற்பட்டது

# ConsolePage as in 'incomplete/aggregated preview of the contents of a file'
source: Preview
ta: முன்னோட்டம்

# ConsolePage
source: This file appears to be a software package. To install, swipe back and select the “Install” option from the menu.
ta: இந்த கோப்பு ஒரு மென்பொருள் தொகுப்பாகத் தோன்றுகிறது. நிறுவ, மீண்டும் ச்வைப் செய்து மெனுவிலிருந்து “நிறுவு” விருப்பத்தைத் தேர்ந்தெடுக்கவும்.

# ConsolePage
source: Swipe from the right to view raw contents.
ta: மூல உள்ளடக்கங்களைக் காண உரிமையிலிருந்து ச்வைப் செய்யவும்.

# CoverPage
source: Root Mode
ta: ரூட் பயன்முறை

# CreateNewDialog
source: Create
ta: உருவாக்கு

# CreateNewDialog
source: Not permitted
ta: அனுமதிக்கப்படவில்லை

# CreateNewDialog
source: You don't have permission to change the contents of this directory.
ta: இந்த கோப்பகத்தின் உள்ளடக்கங்களை மாற்ற உங்களுக்கு இசைவு இல்லை.

# CreateNewDialog
source: Create new
ta: புதியதை உருவாக்கவும்

# CreateNewDialog placeholder is the parent directory of the new element
source: The new folder will be created under “%1”.
ta: புதிய கோப்புறை “%1” இன் கீழ் உருவாக்கப்படும்.

# CreateNewDialog placeholder is the parent directory of the new element
source: The new text file will be created under “%1” and can be edited later.
ta: புதிய உரை கோப்பு “%1” இன் கீழ் உருவாக்கப்படும், பின்னர் திருத்தலாம்.

# CreateNewDialog
source: folder
ta: கோப்புறை

# CreateNewDialog
source: empty text file
ta: வெற்று உரை கோப்பு

# CreateNewDialog
source: Folder name
ta: கோப்புறை பெயர்

# CreateNewDialog
source: File name
ta: கோப்பு பெயர்

# CreateNewDialog
source: File names must not contain slashes. To create a new file in a folder below “%1”, first create a folder and then create the file.
ta: கோப்பு பெயர்களில் குறைப்புக்கள் இருக்கக்கூடாது. “%1” க்குக் கீழே ஒரு கோப்புறையில் ஒரு புதிய கோப்பை உருவாக்க, முதலில் ஒரு கோப்புறையை உருவாக்கி பின்னர் கோப்பை உருவாக்கவும்.

# CreateNewDialog
source: A file or folder with this name already exists.
ta: இந்த பெயருடன் ஒரு கோப்பு அல்லது கோப்புறை ஏற்கனவே உள்ளது.

# CreateNewDialog
source: Using slashes in folder names will create sub-folders, like so:
ta: கோப்புறை பெயர்களில் ச்லாச்களைப் பயன்படுத்துவது அவ்வாறு துணை கோப்புறைகளை உருவாக்கும்:

# DetailList
source: ... and %n more
ta: ... மற்றும் %n மேலும்

# DetailsDrawer
source: show less
ta: குறைவாகக் காட்டு

# DetailsDrawer
source: show more
ta: மேலும் காட்டு

# DirectoryPage
source: View Preferences
ta: விருப்பங்களைக் காண்க

# DirectoryPage
source: Create New...
ta: புதியதை உருவாக்கு ...

# DirectoryPage
source: Paste
ta: ஒட்டு

# DirectoryPage
source: Filter directory contents
ta: அடைவு உள்ளடக்கங்களை வடிகட்டவும்

# DirectoryPage
source: Search
ta: தேடல்

# DirectoryPage
source: Remove bookmark
ta: புத்தகக்குறியை அகற்று

# DirectoryPage
source: Add to bookmarks
ta: புக்மார்க்குகளில் சேர்க்கவும்

# DirectoryPage
source: Copy path to clipboard
ta: கிளிப்போர்டுக்கு பாதையை நகலெடுக்கவும்

# DirectoryPage
source: filtered by: %1
ta: வடிகட்டப்பட்டது: %1

# DirectoryPage as in “no files matched the current filter”
source: No match
ta: பொருந்தவில்லை

# DirectoryPage as in “this folder is empty”
source: Empty
ta: காலி

# DirectoryPage
source: No files matched the filter.
ta: கோப்புகள் எதுவும் வடிகட்டியுடன் பொருந்தவில்லை.

# DirectoryPage
source: This directory contains no files.
ta: இந்த கோப்பகத்தில் கோப்புகள் இல்லை.

# DirectoryPage
source: Deleting
ta: நீக்குதல்

# DirectoryPage
source: Internally not ready
ta: உள்நாட்டில் தயாராக இல்லை

# DirectoryPage
source: Please simply try again
ta: தயவுசெய்து மீண்டும் முயற்சிக்கவும்

# DirectoryPage
source: Trying to move between phone and SD Card? It does not work, try copying.
ta: தொலைபேசி மற்றும் எச்டி கார்டுக்கு இடையில் செல்ல முயற்சிக்கிறீர்களா? இது வேலை செய்யாது, நகலெடுக்க முயற்சிக்கவும்.

# DirectoryPage
source: Perhaps the storage is full?
ta: ஒருவேளை சேமிப்பு நிரம்பியிருக்கலாம்?

# DirectoryPageEntry
source: Deleting
ta: நீக்குதல்

# DirectoryPageEntry
source: Open target folder
ta: இலக்கு கோப்புறையைத் திறக்கவும்

# DirectoryPageEntry
source: Open containing folder
ta: கோப்புறை கொண்ட திறந்த

# DirectoryPageEntry
source: Remove bookmark
ta: புத்தகக்குறியை அகற்று

# DirectoryPageEntry
source: Add to bookmarks
ta: புக்மார்க்குகளில் சேர்க்கவும்

# DirectoryPopup
source: Hide hidden files
ta: மறைக்கப்பட்ட கோப்புகளை மறைக்கவும்

# DirectoryPopup
source: Show hidden files
ta: மறைக்கப்பட்ட கோப்புகளைக் காட்டு

# DirectoryPopup
source: Edit path
ta: பாதையைத் திருத்து

# Engine
source: No files to paste
ta: ஒட்டுவதற்கு கோப்புகள் இல்லை

# Engine
source: Destination does not exist
ta: இலக்கு இல்லை

# Engine
source: Cannot overwrite itself
ta: தன்னை மேலெழுத முடியாது

# Engine
source: Cannot move/copy to itself
ta: தனக்குத்தானே நகர்த்த/நகலெடுக்க முடியாது

# Engine
source: File does not exist
ta: கோப்பு இல்லை

# Engine
source: Broken symbolic link
ta: உடைந்த குறியீட்டு இணைப்பு

# Engine
source: Cannot read this type of file
ta: இந்த வகை கோப்பைப் படிக்க முடியாது

# Engine
source: No permission to read the file
ta: கோப்பைப் படிக்க இசைவு இல்லை

# Engine
source: Error reading file
ta: கோப்பைப் படிப்பது பிழை

# Engine
source: Empty file
ta: வெற்று கோப்பு

# Engine
source: Binary file preview clipped at %1 kB
ta: பைனரி கோப்பு முன்னோட்டம் %1 kb இல் கிளிப் செய்யப்பட்டது

# Engine
source: Text file preview clipped at %1 lines
ta: உரை கோப்பு முன்னோட்டம் %1 வரிகளில் கிளிப் செய்யப்பட்டது

# Engine
source: Text file preview clipped at %1 kB
ta: உரை கோப்பு முன்னோட்டம் %1 kb இல் கிளிப் செய்யப்பட்டது

# Engine
source: No permissions to create %1
ta: %1 ஐ உருவாக்க அனுமதிகள் எதுவும் இல்லை

# Engine
source: Cannot create folder %1
ta: %1 கோப்புறை உருவாக்க முடியாது

# Engine
source: No permissions to create “%1” in “%2”
ta: “%2” இல் “%1” ஐ உருவாக்க அனுமதிகள் எதுவும் இல்லை

# Engine
source: Cannot create file “%1” in “%2”
ta: “%2” இல் “%1” கோப்பை உருவாக்க முடியாது

# Engine
source: Cannot rename %1
ta: %1 ஐ மறுபெயரிட முடியாது

# Engine
source: Source “%1” is not a symbolic link
ta: மூல “%1” என்பது ஒரு குறியீட்டு இணைப்பு அல்ல

# Engine
source: No permissions to change contents of “%1”
ta: “%1” இன் உள்ளடக்கங்களை மாற்ற அனுமதிகள் இல்லை

# Engine
source: Failed to remove old link “%1” pointing to “%2”
ta: “%2” ஐ சுட்டிக்காட்டி பழைய இணைப்பை “%1” அகற்றுவதில் தோல்வி

# Engine
source: Failed to revert link “%1” pointing to “%2” after failing to change target to “%3”
ta: %3 இலக்கை “%2” என்று சுட்டிக்காட்டி “%1” ஐ மாற்றுவதில் தோல்வியுற்றது

# Engine
source: Failed to change link target of “%1” to “%2”
ta: “%1” இன் இணைப்பு இலக்கை “%2” ஆக மாற்றத் தவறிவிட்டது

# Engine
source: Cannot change permissions
ta: அனுமதிகளை மாற்ற முடியாது

# FileActions
source: %n file selected
ta: %n கோப்பு தேர்ந்தெடுக்கப்பட்டது

# FileActions
source: clear selection
ta: தெளிவான தேர்வு

# FileActions
source: select all
ta: அனைத்தையும் தெரிவுசெய்

# FileActions
source: cut file
ta: கோப்பு வெட்டு

# FileActions
source: %n file cut
ta: %n கோப்பு வெட்டு

# FileActions
source: copy file
ta: கோப்பை நகலெடுக்கவும்

# FileActions
source: %n file copied
ta: %n கோப்பு நகலெடுக்கப்பட்டது

# FileActions
source: transfer file
ta: கோப்பை மாற்றவும்

# FileActions
source: delete file
ta: கோப்பை அழி

# FileActions
source: rename file
ta: கோப்பை மறுபெயரிடுங்கள்

# FileActions
source: share file
ta: கோப்பைப் பகிரவும்

# FileActions
source: compress file
ta: கோப்பை சுருக்கவும்

# FileActions
source: edit link target
ta: இணைப்பு இலக்கைத் திருத்தவும்

# FileActions
source: Apply
ta: இடு

# FileActions
source: edit file
ta: கோப்பைத் திருத்து

# FileActions
source: show file properties
ta: கோப்பு பண்புகளைக் காட்டு

# FileClipModePicker
source: Copy
ta: நகலெடு

# FileClipModePicker
source: Move
ta: நகர்த்தவும்

# FileClipModePicker
source: Link
ta: இணைப்பு

# FileData
source: empty
ta: காலி

# FileData
source: %n item
ta: %n உருப்படி

# FileData
source: File does not exist
ta: கோப்பு இல்லை

# FileData
source: block device
ta: தொகுதி சாதனம்

# FileData
source: character device
ta: எழுத்து சாதனம்

# FileData
source: pipe
ta: புழம்பு

# FileData
source: socket
ta: மாட்டி

# FileData
source: folder
ta: கோப்புறை

# FileData
source: unknown
ta: தெரியவில்லை

# FileModel
source: folder
ta: கோப்புறை

# FileModel
source: link
ta: இணைப்பு

# FileModel
source: file
ta: கோப்பு

# FileModel
source: empty
ta: காலி

# FileModel
source: %n item
ta: %n உருப்படி

# FileModelWorker
source: Folder does not exist
ta: கோப்புறை இல்லை

# FileModelWorker
source: No permission to read the folder
ta: கோப்புறையைப் படிக்க இசைவு இல்லை

# FileOperationsPage
source: Tasks
ta: பணிகள்

# FileOperationsPage
source: Empty
ta: காலி

# FilePage
source: Install launched
ta: நிறுவப்பட்டது

# FilePage
source: If nothing happens, then the package is probably faulty.
ta: எதுவும் நடக்கவில்லை என்றால், தொகுப்பு அநேகமாக தவறானது.

# FilePage
source: Open successful
ta: திறந்திருக்கும் வெற்றிகரமாக

# FilePage
source: Sometimes the application stays in the background
ta: சில நேரங்களில் பயன்பாடு பின்னணியில் இருக்கும்

# FilePage
source: No application to open the file
ta: கோப்பைத் திறக்க விண்ணப்பம் இல்லை

# FilePage
source: Change Permissions
ta: அனுமதிகளை மாற்றவும்

# FilePage
source: View Raw Contents
ta: மூல உள்ளடக்கங்களைக் காண்க

# FilePage
source: Install
ta: நிறுவவும்

# FilePage
source: Open
ta: திற

# FilePage
source: File cannot be opened
ta: கோப்பைத் திறக்க முடியாது

# FilePage
source: This type of file cannot be opened.
ta: இந்த வகை கோப்பைத் திறக்க முடியாது.

# FilePage
source: Swipe from the right to inspect its contents.
ta: அதன் உள்ளடக்கங்களை ஆய்வு செய்ய உரிமையிலிருந்து ச்வைப் செய்யவும்.

# FilePage
source: Go to Target
ta: இலக்குக்குச் செல்லுங்கள்

# FilePage
source: Open containing folder
ta: கோப்புறை கொண்ட திறந்த

# FilePage
source: The file has been moved.
ta: கோப்பு நகர்த்தப்பட்டுள்ளது.

# FilePage
source: Deleting
ta: நீக்குதல்

# FilePage
source: Location
ta: இடம்

# FilePage
source: Type
ta: வகை

# FilePage
source: Unknown (link target not found)
ta: தெரியாத (இணைப்பு இலக்கு கிடைக்கவில்லை)

# FilePage
source: Link to %1
ta: %1 உடன் இணைப்பு

# FilePage
source: Permissions
ta: அனுமதிகள்

# FilePage
source: Owner
ta: உரிமையாளர்

# FilePage
source: Group
ta: குழு

# FilePage
source: Last modified
ta: கடைசியாக மாற்றப்பட்டது

# FileSize
source: KiB
ta: வினோதமாக

# FileSize
source: GiB
ta: கிப்

# FileSize
source: TiB
ta: திப்

# FileSize
source: PiB
ta: தொடங்கவும்

# FileSize
source: ZiB
ta: இனிப்பு

# FileSize
source: YiB
ta: யிப்

# FileWorker
source: File operation already in progress
ta: கோப்பு செயல்பாடு ஏற்கனவே செயலில் உள்ளது

# FileWorker
source: Empty filename
ta: வெற்று கோப்பு பெயர்

# FileWorker
source: Cancelled
ta: ரத்து செய்யப்பட்டது

# FileWorker
source: File not found
ta: கோப்பு கிடைக்கவில்லை

# FileWorker
source: Folder delete failed
ta: கோப்புறை நீக்குதல் தோல்வியடைந்தது

# FileWorker
source: Source folder does not exist
ta: மூல கோப்புறை இல்லை

# FileWorker
source: Cannot create target folder %1
ta: இலக்கு கோப்புறை %1 ஐ உருவாக்க முடியாது

# FileWorker
source: Failed to remove source folder “%1” after moving.
ta: நகர்ந்த பிறகு “%1” மூல கோப்புறையை அகற்றுவதில் தோல்வி.

# GlobalSettingsPage
source: App Settings
ta: பயன்பாட்டு அமைப்புகள்

# GlobalSettingsPage
source: Directory View
ta: அடைவு பார்வை

# GlobalSettingsPage
source: Use per-directory view settings
ta: ஒவ்வொரு அடக்கு பார்வை அமைப்புகளையும் பயன்படுத்தவும்

# GlobalSettingsPage
source: Save view preferences individually for all folders in your home directory. The options below are used by default.
ta: உங்கள் வீட்டு கோப்பகத்தில் உள்ள அனைத்து கோப்புறைகளுக்கும் தனித்தனியாக காட்சி விருப்பங்களை சேமிக்கவும். கீழே உள்ள விருப்பங்கள் இயல்பாகவே பயன்படுத்தப்படுகின்றன.

# GlobalSettingsPage
source: In gallery mode, images will be shown to fit the screen. Other files are shown without preview thumbnails.
ta: கேலரி பயன்முறையில், திரைக்கு ஏற்றவாறு படங்கள் காண்பிக்கப்படும். பிற கோப்புகள் முன்னோட்ட சிறு உருவங்கள் இல்லாமல் காட்டப்படுகின்றன.

# GlobalSettingsPage
source: Hint
ta: குறிப்பு

# GlobalSettingsPage
source: You can enable per-directory settings to configure your preferences for individual folders.
ta: தனிப்பட்ட கோப்புறைகளுக்கான உங்கள் விருப்பங்களை உள்ளமைக்க ஒவ்வொரு அடைவு அமைப்புகளையும் இயக்கலாம்.

# GlobalSettingsPage
source: Show hidden files
ta: மறைக்கப்பட்ட கோப்புகளைக் காட்டு

# GlobalSettingsPage
source: Show files with names starting with a full stop (“.”).
ta: முழு நிறுத்தத்துடன் (“.”) தொடங்கும் பெயர்களுடன் கோப்புகளைக் காண்பி.

# GlobalSettingsPage
source: Show preview images
ta: முன்னோட்டப் படங்களைக் காட்டு

# GlobalSettingsPage
source: Preview contents of supported file types.
ta: ஆதரிக்கப்பட்ட கோப்பு வகைகளின் உள்ளடக்கங்களை முன்னோட்டமிடுங்கள்.

# GlobalSettingsPage
source: Thumbnail size
ta: சிறு அளவு

# GlobalSettingsPage
source: small
ta: சிறிய

# GlobalSettingsPage
source: medium
ta: சராசரி

# GlobalSettingsPage
source: large
ta: பெரிய

# GlobalSettingsPage
source: huge
ta: பெரிய

# GlobalSettingsPage
source: Sorting
ta: வரிசைப்படுத்துதல்

# GlobalSettingsPage
source: Show folders first
ta: முதலில் கோப்புறைகளைக் காட்டு

# GlobalSettingsPage
source: Always show folders at the top of the file list.
ta: கோப்பு பட்டியலின் மேலே எப்போதும் கோப்புறைகளைக் காட்டுங்கள்.

# GlobalSettingsPage
source: Show hidden files last
ta: மறைக்கப்பட்ட கோப்புகளை கடைசியாக காட்டு

# GlobalSettingsPage
source: Always show files starting with a full stop (“.”) at the end of the file list.
ta: கோப்பு பட்டியலின் முடிவில் முழு நிறுத்தத்தில் (“.”) தொடங்கும் கோப்புகளை எப்போதும் காண்பி.

# GlobalSettingsPage
source: Sort by
ta: வரிசைப்படுத்தவும்

# GlobalSettingsPage
source: name
ta: பெயர்

# GlobalSettingsPage
source: size
ta: அளவு

# GlobalSettingsPage
source: file type
ta: கோப்பு வகை

# GlobalSettingsPage
source: Sort case-sensitively
ta: வழக்கு-உணர்திறன் வரிசைப்படுத்தவும்

# GlobalSettingsPage
source: Show files with names starting with a capital letter first.
ta: முதலில் ஒரு பெரிய கடிதத்துடன் தொடங்கும் பெயர்களுடன் கோப்புகளைக் காண்பி.

# GlobalSettingsPage
source: Sort order
ta: வரிசைப்படுத்தும் முறை

# GlobalSettingsPage
source: Sort names starting with the beginning of the alphabet first.
ta: முதலில் எழுத்துக்களின் தொடக்கத்தில் தொடங்கி பெயர்களை வரிசைப்படுத்துங்கள்.

# GlobalSettingsPage
source: Show smaller files first.
ta: முதலில் சிறிய கோப்புகளைக் காட்டுங்கள்.

# GlobalSettingsPage
source: Sort names starting with the end of the alphabet first.
ta: முதலில் எழுத்துக்களின் முடிவில் தொடங்கும் பெயர்களை வரிசைப்படுத்தவும்.

# GlobalSettingsPage
source: Show larger files first.
ta: பெரிய கோப்புகளை முதலில் காட்டு.

# GlobalSettingsPage
source: Places
ta: இடங்கள்

# GlobalSettingsPage
source: Show older files first.
ta: பழைய கோப்புகளை முதலில் காட்டு.

# GlobalSettingsPage
source: ascending
ta: ஏறுதல்

# GlobalSettingsPage
source: View mode
ta: பார்வை பயன்முறையை

# GlobalSettingsPage
source: list
ta: பட்டியல்

# GlobalSettingsPage
source: Show files in a list. Optionally enable preview thumbnails using the separate setting below.
ta: பட்டியலில் கோப்புகளைக் காட்டு. கீழேயுள்ள தனி அமைப்பைப் பயன்படுத்தி முன்னோட்ட சிறு உருவங்களை விருப்பமாக இயக்கவும்.

# GlobalSettingsPage
source: gallery
ta: கேலரி

# GlobalSettingsPage
source: Show more recently changed files first.
ta: அண்மைக் காலத்தில் மாற்றப்பட்ட கோப்புகளை முதலில் காட்டு.

# GlobalSettingsPage
source: descending
ta: இறங்கு

# GlobalSettingsPage
source: modification date
ta: மாற்றும் தேதி

# GlobalSettingsPage
source: Behavior and View
ta: நடத்தை மற்றும் பார்வை

# GlobalSettingsPage
source: Initial view
ta: தொடக்க பார்வை

# GlobalSettingsPage
source: The page that is shown when the app starts.
ta: பயன்பாடு தொடங்கும் போது காண்பிக்கப்படும் பக்கம்.

# GlobalSettingsPage
source: Directory
ta: அடைவு

# GlobalSettingsPage
source: Search
ta: தேடல்

# GlobalSettingsPage
source: Initial directory
ta: தொடக்க அடைவு

# GlobalSettingsPage
source: The directory that is shown when the app starts.
ta: பயன்பாடு தொடங்கும் போது காண்பிக்கப்படும் அடைவு.

# GlobalSettingsPage
source: user's home
ta: பயனரின் வீடு

# GlobalSettingsPage
source: last visited
ta: கடைசியாக பார்வையிட்டார்

# GlobalSettingsPage
source: custom path
ta: தனிப்பயன் பாதை

# GlobalSettingsPage
source: Choose
ta: தேர்வு

# GlobalSettingsPage
source: Default transfer action
ta: இயல்புநிலை பரிமாற்ற செயல்

# GlobalSettingsPage
source: The action that is selected by default when using the bulk file management feature (available through the “shuffle” icon after selecting files).
ta: மொத்த கோப்பு மேலாண்மை அம்சத்தைப் பயன்படுத்தும் போது இயல்புநிலையாக தேர்ந்தெடுக்கப்பட்ட செயல் (கோப்புகளைத் தேர்ந்தெடுத்த பிறகு “கலக்கு” ஐகான் மூலம் கிடைக்கிறது).

# GlobalSettingsPage
source: copy
ta: நகலெடு

# GlobalSettingsPage
source: move
ta: நகர்த்தவும்

# GlobalSettingsPage
source: link
ta: இணைப்பு

# GlobalSettingsPage
source: none
ta: எதுவுமில்லை

# GlobalSettingsPage
source: Default filter line action
ta: இயல்புநிலை வடிகட்டி வரி செயல்

# GlobalSettingsPage
source: Which action to take when the Enter key is pressed in the filter line in a directory's pull-down menu.
ta: ஒரு கோப்பகத்தின் இழுக்கும் பட்டியலில் வடிகட்டி வரியில் ENTER விசையை அழுத்தும்போது எந்த நடவடிக்கை எடுக்க வேண்டும்.

# GlobalSettingsPage
source: return to directory view
ta: அடைவு பார்வைக்குத் திரும்பு

# GlobalSettingsPage
source: start recursive search
ta: சுழல்நிலை தேடலைத் தொடங்குங்கள்

# GlobalSettingsPage
source: File name abbreviation
ta: கோப்பு பெயர் சுருக்கம்

# GlobalSettingsPage
source: How very long filenames are abbreviated in the directory view.
ta: அடைவு பார்வையில் எவ்வளவு மிக நீண்ட கோப்பு பெயர்கள் சுருக்கமாக உள்ளன.

# GlobalSettingsPage
source: fade out
ta: மங்கிவிடும்

# GlobalSettingsPage
source: elide end
ta: எலைட் முடிவு

# GlobalSettingsPage
source: elide middle
ta: எலைட் மிடில்

# GlobalSettingsPage
source: Share clipboard among windows
ta: சாளரங்களிடையே கிளிப்போர்டைப் பகிரவும்

# GlobalSettingsPage
source: Share the list of files currently in the clipboard among all open File Browser windows. When this is enabled, you can cut files in one window and paste them in another.
ta: அனைத்து திறந்த கோப்பு உலாவி சாளரங்களுக்கிடையில் தற்போது கிளிப்போர்டில் உள்ள கோப்புகளின் பட்டியலைப் பகிரவும். இது இயக்கப்பட்டிருக்கும் போது, நீங்கள் ஒரு சாளரத்தில் கோப்புகளை வெட்டி அவற்றை மற்றொரு இடத்தில் ஒட்டலாம்.

# GlobalSettingsPage
source: Show full directory paths
ta: முழு அடைவு பாதைகளைக் காட்டு

# GlobalSettingsPage
source: Show the full path in the page header of the directory view.
ta: அடைவு பார்வையின் பக்க தலைப்பில் முழு பாதையையும் காட்டுங்கள்.

# GlobalSettingsPage
source: Show navigation menu icon
ta: வழிசெலுத்தல் பட்டியல் ஐகானைக் காட்டு

# GlobalSettingsPage
source: Show a visual hint that the navigation menu is available by tapping the page header of the directory view.
ta: கோப்பகக் காட்சியின் பக்கத் தலைப்பைத் தட்டுவதன் மூலம் வழிசெலுத்தல் பட்டியல் கிடைக்கிறது என்பதற்கான காட்சி குறிப்பைக் காட்டு.

# GlobalSettingsPage
source: Enable solid window background
ta: திட சாளர பின்னணியை இயக்கவும்

# GlobalSettingsPage
source: Use a solid color instead of your wallpaper as the background of this app.
ta: இந்த பயன்பாட்டின் பின்னணியாக உங்கள் வால்பேப்பருக்கு பதிலாக திட நிறத்தைப் பயன்படுத்தவும்.

# GlobalSettingsPage
source: Swipe from the right to view File Browser's source code, license information, and a list of contributors.
ta: கோப்பு உலாவியின் மூலக் குறியீடு, உரிமத் செய்தி மற்றும் பங்களிப்பாளர்களின் பட்டியலைக் காண உரிமையிலிருந்து ச்வைப் செய்யவும்.

# GlobalSettingsPage
source: Settings
ta: அமைப்புகள்

# ImageMetaData
source: Image Size
ta: பட அளவு

# ImageMetaData
source: %1 x %2
ta: %1 ஃச் %2

# ImageMetaData
source: %1 x %2 (%3)
ta: %1 ஃச் %2 ( %3)

# ImageMetaData
source: Make
ta: உருவாக்கு

# ImageMetaData
source: Model
ta: மாதிரியுரு

# ImageMetaData
source: Date/Time
ta: தேதி/நேரம்

# ImageMetaData
source: Orientation
ta: நோக்குநிலை

# ImageMetaData
source: Color/BW
ta: நிறம்/BW

# ImageMetaData
source: Black and White
ta: கருப்பு மற்றும் வெள்ளை

# ImageMetaData
source: Strobe light not detected
ta: ச்ட்ரோப் லைட் கண்டறியப்படவில்லை
