Repository: 247i/TACETr
Catalog: உரை/தானி/harbour-file-browser-translations-*.po
Languages: ta

# ImageMetaData
source: Strobe light detected
ta: ச்ட்ரோப் லைட் கண்டறியப்பட்டது

# ImageMetaData
source: Manual
ta: கையேடு

# ImageMetaData
source: Manual, return light not detected
ta: கையேடு, திரும்ப ஒளி கண்டறியப்படவில்லை

# ImageMetaData
source: Manual, return light detected
ta: கையேடு, திரும்ப ஒளி கண்டறியப்பட்டது

# ImageMetaData
source: Auto
ta: தானி

# ImageMetaData
source: Auto, return light not detected
ta: ஆட்டோ, திரும்ப ஒளி கண்டறியப்படவில்லை

# ImageMetaData
source: Auto, return light detected
ta: ஆட்டோ, ரிட்டர்ன் லைட் கண்டறியப்பட்டது

# ImageMetaData
source: Red eye reduction mode
ta: சிவப்பு கண் குறைப்பு முறை

# ImageMetaData
source: Red eye reduction mode, return light not detected
ta: சிவப்பு கண் குறைப்பு முறை, திரும்ப ஒளி கண்டறியப்படவில்லை

# ImageMetaData
source: Red eye reduction mode, return light detected
ta: சிவப்பு கண் குறைப்பு முறை, திரும்ப ஒளி கண்டறியப்பட்டது

# ImageMetaData
source: Manual, red eye reduction mode
ta: கையேடு, சிவப்பு கண் குறைப்பு முறை

# ImageMetaData
source: Manual, red eye reduction mode, return light not detected
ta: கையேடு, சிவப்பு கண் குறைப்பு முறை, திரும்ப ஒளி கண்டறியப்படவில்லை

# ImageMetaData
source: Auto, red eye reduction mode
ta: ஆட்டோ, சிவப்பு கண் குறைப்பு முறை

# ImageMetaData
source: Auto, red eye reduction mode, return light not detected
ta: ஆட்டோ, சிவப்பு கண் குறைப்பு முறை, திரும்ப ஒளி கண்டறியப்படவில்லை

# ImageMetaData
source: Auto, red eye reduction mode, return light detected
ta: ஆட்டோ, சிவப்பு கண் குறைப்பு முறை, திரும்ப ஒளி கண்டறியப்பட்டது

# ImageMetaData
source: Flash
ta: ஃபிளாச்

# ImageMetaData
source: Yes (%1)
ta: ஆம் (%1)

# ImageMetaData
source: Yes
ta: ஆம்

# ImageMetaData
source: No (Auto)
ta: இல்லை (ஆட்டோ)

# ImageMetaData
source: No
ta: இல்லை

# ImageMetaData
source: %1mm (35mm equivalent: %2mm)
ta: %1 மிமீ (35 மிமீ சமம்: %2 மிமீ)

# ImageMetaData
source: %1mm
ta: %1 மிமீ

# ImageMetaData
source: Focal Length
ta: குவிநீளம், குவியத் தொலைவு

# ImageMetaData
source: Digital Zoom
ta: டிசிட்டல் சூம்

# ImageMetaData
source: CCD Width
ta: சிசிடி அகலம்

# ImageMetaData
source: Exposure Time
ta: நேரிடுதல் காலம்

# ImageMetaData
source: Aperture
ta: துளை

# ImageMetaData
source: f/%1
ta: எஃப்/%1

# ImageMetaData
source: Focus Distance
ta: கவனம் தூரம்

# ImageMetaData
source: Infinite
ta: கந்தழி, முடிவிலி

# ImageMetaData
source: %1m
ta: %1 மீ

# ImageMetaData
source: ISO Equivalent
ta: ஐஎச்ஓ சமமான

# ImageMetaData
source: Exposure Bias
ta: வெளிப்பாடு சார்பு

# ImageMetaData
source: White Balance
ta: வெள்ளை இருப்பு

# ImageMetaData
source: Light Source
ta: ஒளி மூல

# ImageMetaData
source: Daylight
ta: பகல்

# ImageMetaData
source: Fluorescent
ta: ஒளிரும்

# ImageMetaData
source: Incandescent
ta: ஒளிரும்

# ImageMetaData
source: Fine weather
ta: நல்ல வானிலை

# ImageMetaData
source: Shade
ta: நிழல்

# ImageMetaData
source: Average
ta: சராசரி

# ImageMetaData
source: Center weighted average
ta: மைய எடை சராசரி

# ImageMetaData
source: Spot
ta: ச்பாட்

# ImageMetaData
source: Multi spot
ta: பல இடங்கள்

# ImageMetaData
source: Pattern
ta: முறை

# ImageMetaData
source: Partial
ta: பகுதி

# ImageMetaData
source: Other
ta: மற்றொன்று

# ImageMetaData
source: Unknown (%1)
ta: தெரியாத (%1)

# ImageMetaData
source: Metering Mode
ta: அளவீட்டு முறை

# ImageMetaData
source: Program (auto)
ta: நிரல் (கார்)

# ImageMetaData
source: Aperture priority (semi-auto)
ta: துளை முன்னுரிமை (அரை ஆட்டோ)

# ImageMetaData
source: Shutter priority (semi-auto)
ta: சட்டர் முன்னுரிமை (அரை ஆட்டோ)

# ImageMetaData
source: Creative Program (based towards depth of field)
ta: கிரியேட்டிவ் புரோகிராம் (புலத்தின் ஆழத்தை அடிப்படையாகக் கொண்டது)

# ImageMetaData
source: Action program (based towards fast shutter speed)
ta: செயல் நிரல் (வேகமான சட்டர் வேகத்தை நோக்கி)

# ImageMetaData
source: Portrait mode
ta: ஃபேசன் உருவப்படம்

# ImageMetaData
source: Landscape mode
ta: இயற்கை முறை

# ImageMetaData
source: Exposure Program
ta: வெளிப்பாடு திட்டம்

# ImageMetaData
source: Exposure Mode
ta: வெளிப்பாடு பயன்முறை

# ImageMetaData
source: Auto bracketing
ta: ஆட்டோ அடைப்புக்குறி

# ImageMetaData
source: Macro
ta: குறுநிரல்

# ImageMetaData
source: Close
ta: மூடு

# ImageMetaData
source: Distant
ta: தொலைவில்

# ImageMetaData
source: Focus Range
ta: கவனம் வரம்பு

# ImageMetaData
source: JPEG Process
ta: JPEG செயல்முறை

# ImageMetaData
source: Unknown
ta: தெரியாத

# ImageMetaData
source: Latitude
ta: அகலாங்கு

# ImageMetaData
source: Longitude
ta: நெட்டாங்கு

# ImageMetaData
source: Altitude
ta: குத்துயரம்

# ImageMetaData
source: JPEG Quality
ta: JPEG தகுதி

# ImageMetaData
source: Comment
ta: கருத்து

# LicenseListPart
source: License text
ta: உரிம உரை

# MultiFilePage
source: Selection Properties
ta: தேர்வு பண்புகள்

# MultiFilePage
source: The files have been moved.
ta: கோப்புகள் நகர்த்தப்பட்டுள்ளன.

# MultiFilePage
source: %n item selected
ta: %n உருப்படி தேர்ந்தெடுக்கப்பட்டது

# MultiFilePage
source: Deleting
ta: நீக்குதல்

# MultiFilePage
source: Directories
ta: கோப்பகங்கள்

# MultiFilePage
source: Files
ta: கோப்புகள்

# MultiFilePage
source: none
ta: எதுவுமில்லை

# MySupportDialog
source: Donate on Liberapay
ta: லிபராபேயில் நன்கொடை

# MySupportDialog
source: Pay the amount of a cup of coffee, a slice of pizza, or a ticket to the theater.
ta: ஒரு கப் காபி, ஒரு துண்டு பீச்சா அல்லது தியேட்டருக்கு டிக்கெட் ஆகியவற்றின் அளவு செலுத்துங்கள்.

# MySupportDialog
source: Translate on Weblate
ta: வெப்லேட்டில் மொழிபெயர்க்கவும்

# MySupportDialog
source: Help with translating this app in as many languages as possible.
ta: இந்த பயன்பாட்டை முடிந்தவரை பல மொழிகளில் மொழிபெயர்க்க உதவுங்கள்.

# MySupportDialog
source: Develop on Github
ta: கிட்அப்பில் உருவாக்குங்கள்

# MySupportDialog
source: Support with maintenance and packaging, write code, or provide valuable bug reports.
ta: பராமரிப்பு மற்றும் பேக்கேசிங், குறியீட்டை எழுதுதல் அல்லது மதிப்புமிக்க பிழை அறிக்கைகளை வழங்குதல்.

# MySupportDialog
source: Why should you care?
ta: நீங்கள் ஏன் கவலைப்பட வேண்டும்?

# MySupportDialog
source: This project is built with love and passion by a single developer in their spare time, and is provided to you free of charge.
ta: இந்த திட்டம் அவர்களின் ஓய்வு நேரத்தில் ஒரு டெவலப்பரால் அன்புடனும் ஆர்வத்துடனும் கட்டப்பட்டுள்ளது, மேலும் இது உங்களுக்கு இலவசமாக வழங்கப்படுகிறது.

# MySupportDialog
source: I develop Free Software because I am convinced that it is the ethical thing to do - and it is a fun hobby. However, developing software takes a lot of time and effort. As Sailfish and living in general costs money, I need your support to be able to spend time on non-paying projects like this.
ta: நான் இலவச மென்பொருளை உருவாக்குகிறேன், ஏனென்றால் இது நெறிமுறை சேதி என்று நான் நம்புகிறேன் - இது ஒரு வேடிக்கையான பொழுதுபோக்கு. இருப்பினும், மென்பொருளை உருவாக்குவதற்கு நிறைய நேரமும் முயற்சியும் தேவை. படகோட்டியாகவும், பொது செலவினங்களுடனும், இது போன்ற ஊதியம் பெறாத திட்டங்களுக்கு நேரத்தை செலவிட எனக்கு உங்கள் உதவி தேவை.

# MySupportDialog
source: Why donate?
ta: ஏன் நன்கொடை?

# MySupportDialog
source: Jolla raised prices and is trying to force developers (who work for free) to pay rent for Sailfish.
ta: சொல்லா விலைகளை உயர்த்தினார், மேலும் டெவலப்பர்களை (இலவசமாக வேலை செய்யும்) படகோட்டிக்கு வாடகை செலுத்த கட்டாயப்படுத்த முயற்சிக்கிறார்.

# MySupportDialog
source: If you can afford it, donating is the easiest way to ensure that I can continue working on apps for Sailfish. Any amount is appreciated, be it a cup of coffee, a slice of pizza, or more.
ta: நீங்கள் அதை வாங்க முடிந்தால், சாய்ல்ஃபிசிற்கான பயன்பாடுகளில் நான் தொடர்ந்து பணியாற்ற முடியும் என்பதை உறுதிப்படுத்த நன்கொடை என்பது எளிதான வழியாகும். எந்தவொரு தொகையும் பாராட்டப்படுகிறது, அது ஒரு கப் காபி, ஒரு துண்டு பீச்சா அல்லது அதற்கு மேற்பட்டதாக இருக்கலாம்.

# Opal.About
source: About
ta: பற்றி

# Opal.About
source: Version %1
ta: பதிப்பு %1

# Opal.About
source: Development
ta: வளர்ச்சி

# Opal.About
source: show contributors
ta: பங்களிப்பாளர்களைக் காட்டு

# Opal.About
source: Homepage
ta: முகப்புப்பக்கம்

# Opal.About
source: Changelog
ta: மாற்றபதிவு

# Opal.About
source: Donations
ta: நன்கொடைகள்

# Opal.About
source: License
ta: உரிமம்

# Opal.About
source: show license
ta: உரிமத்தைக் காட்டு

# Opal.About
source: Translations
ta: மொழிபெயர்ப்புகள்

# Opal.About
source: Source Code
ta: மூலக் குறியீடு

# Opal.About
source: show details
ta: விவரங்களைக் காட்டு

# Opal.About
source: Contributors
ta: பங்களிப்பாளர்கள்

# Opal.About
source: Acknowledgements
ta: ஒப்புதல்கள்

# Opal.About
source: Thank you!
ta: நன்றி!

# Opal.About
source: Details
ta: விவரங்கள்

# Opal.About
source: Download license texts
ta: உரிம உரைகளைப் பதிவிறக்கவும்

# Opal.About
source: Note: please check the source code for most accurate information.
ta: குறிப்பு: மிகவும் துல்லியமான தகவல்களுக்கு மூலக் குறியீட்டைச் சரிபார்க்கவும்.

# Opal.About
source: External Link
ta: வெளிப்புற இணைப்பு

# Opal.About
source: Open in browser
ta: உலாவியில் திற

# Opal.About
source: Copied to clipboard: %1
ta: கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டது: %1

# Opal.About
source: Copy to clipboard
ta: கிளிப்போர்டுக்கு நகலெடுக்கவும்

# Opal.About
source: News
ta: செய்தி

# Opal.About
source: Changes since version %1
ta: பதிப்பு %1 முதல் மாற்றங்கள்

# Opal.About
source: Please refer to <a href="%1">%1</a>
ta: தயவுசெய்து <a href="%1">%1 </a> ஐப் பார்க்கவும்

# Opal.About.Common
source: If you want to support my work, you can buy me a cup of coffee.
ta: நீங்கள் எனது வேலையை ஆதரிக்க விரும்பினால், நீங்கள் எனக்கு ஒரு கப் காபி வாங்கலாம்.

# Opal.About.Common
source: You can support this project by contributing, or by donating using any of these services.
ta: இந்த திட்டத்தை பங்களிப்பதன் மூலம் அல்லது இந்த சேவைகளில் ஏதேனும் ஒன்றைப் பயன்படுத்தி நன்கொடை அளிப்பதன் மூலம் நீங்கள் ஆதரிக்கலாம்.

# Opal.About.Common
source: Your contributions to translations or code would be most welcome.
ta: மொழிபெயர்ப்புகள் அல்லது குறியீட்டிற்கான உங்கள் பங்களிப்புகள் மிகவும் வரவேற்கப்படும்.

# Opal.LinkHandler
source: External Link
ta: வெளிப்புற இணைப்பு

# Opal.LinkHandler
source: Open in browser
ta: உலாவியில் திற

# Opal.LinkHandler
source: Open externally
ta: வெளிப்புறமாக திறக்கவும்

# Opal.LinkHandler
source: Copied to clipboard: %1
ta: கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டது: %1

# Opal.LinkHandler
source: Copy to clipboard
ta: கிளிப்போர்டுக்கு நகலெடுக்கவும்

# Opal.MediaPlayer error info page heading
source: Playback failed
ta: பிளேபேக் தோல்வியடைந்தது

# Opal.MediaPlayer error info page heading
source: Resource error
ta: வள பிழை

# Opal.MediaPlayer error info page heading
source: Format error
ta: வடிவமைப்பு பிழை

# Opal.MediaPlayer error info page heading
source: Network error
ta: பிணைய பிழை

# Opal.MediaPlayer error info page heading
source: Access denied
ta: அணுகல் மறுக்கப்பட்டது

# Opal.MediaPlayer error info page heading
source: Media service missing
ta: ஊடக பணி இல்லை

# Opal.MediaPlayer
source: The video cannot be played due to a problem allocating resources.
ta: வளங்களை ஒதுக்குவதில் சிக்கல் காரணமாக வீடியோவை இயக்க முடியாது.

# Opal.MediaPlayer
source: The audio and or video format is not supported.
ta: ஆடியோ மற்றும் வீடியோ வடிவம் ஆதரிக்கப்படவில்லை.

# Opal.MediaPlayer
source: The video cannot be played due to network issues.
ta: பிணையம் சிக்கல்கள் காரணமாக வீடியோவை இயக்க முடியாது.

# Opal.MediaPlayer
source: The video cannot be played due to insufficient permissions.
ta: போதிய அனுமதிகள் இல்லாததால் வீடியோவை இயக்க முடியாது.

# Opal.MediaPlayer
source: The video cannot be played because the media service could not be instantiated.
ta: ஊடக சேவையை உடனடிப்படுத்த முடியாததால் வீடியோவை இயக்க முடியாது.

# Opal.MediaPlayer
source: Playback failed due to an expected error. Please restart the app and try again.
ta: எதிர்பார்க்கப்படும் பிழை காரணமாக பின்னணி தோல்வியடைந்தது. பயன்பாட்டை மறுதொடக்கம் செய்து மீண்டும் முயற்சிக்கவும்.

# Opal.MediaPlayer
source: Clear subtitles
ta: தெளிவான வசன வரிகள்

# Opal.MediaPlayer
source: Load subtitles
ta: வசன வரிகள் ஏற்றவும்

# Opal.MediaPlayer
source: Zoomed to fit screen
ta: திரைக்கு பொருத்தமாக பெரிதாக்கப்பட்டது

# Opal.MediaPlayer
source: Original
ta: அசல்

# Opal.MediaPlayer
source: Play on repeat
ta: மீண்டும் விளையாடுங்கள்

# Opal.MediaPlayer
source: Play once
ta: ஒரு முறை விளையாடுங்கள்

# Opal.MediaPlayer
source: Select from file system
ta: கோப்பு முறைமையிலிருந்து தேர்ந்தெடுக்கவும்

# Opal.MediaPlayer
source: No files ready
ta: கோப்புகள் தயாராக இல்லை

# Opal.MediaPlayer
source: Copy subtitle files in the SRT format next to the video file to open them quickly.
ta: நகலெடுக்க வீடியோ கோப்புக்கு அடுத்த SRT வடிவத்தில் நகலெடுக்கவும் அவற்றை விரைவாக திறக்க.

# Opal.MediaPlayer
source: Pull down to pick a file.
ta: ஒரு கோப்பை எடுக்க கீழே இழுக்கவும்.

# OverwriteDialog
source: Replace?
ta: மாற்றவா?

# OverwriteDialog
source: Replace
ta: மாற்றவும்

# OverwriteDialog
source: These files or folders already exist in “%1”:
ta: இந்த கோப்புகள் அல்லது கோப்புறைகள் ஏற்கனவே “%1” இல் உள்ளன:

# OverwriteDialog
source: These files or folders already exist:
ta: இந்த கோப்புகள் அல்லது கோப்புறைகள் ஏற்கனவே உள்ளன:

# PathEditDialog
source: Path to a folder
ta: ஒரு கோப்புறைக்கு பாதை

# PathEditDialog
source: Remove last part
ta: கடைசி பகுதியை அகற்று

# PathEditDialog
source: New folder
ta: புதிய கோப்புறை

# PathEditDialog
source: Places
ta: இடங்கள்

# PathEditDialog
source: Path to a target
ta: இலக்குக்கான பாதை

# PathEditDialog
source: %n file
ta: %n கோப்பு

# PathEditDialog
source: %n folder
ta: %n கோப்புறை

# PathEditDialog
source: empty
ta: காலி

# PermissionsDialog
source: Change
ta: மாற்றம்

# PermissionsDialog
source: Change permissions for %1
ta: அனுமதிகளை மாற்றவும் %1

# PermissionsDialog
source: Read
ta: படிக்க

# PermissionsDialog
source: Write
ta: எழுதுங்கள்

# PermissionsDialog
source: Execute
ta: செயல்படுத்தவும்

# PermissionsDialog
source: Owner
ta: உரிமையாளர்

# PermissionsDialog
source: Group
ta: குழு

# PermissionsDialog
source: Others
ta: மற்றவர்கள்

# QObject
source: hh:mm:ss
ta: HH: மிமீ: எச்.எச்

# QuickSwitchDialog
source: Switch
ta: ஆளி, நிலைமாறி

# RenameDialog
source: Rename
ta: மறுபெயரிடுங்கள்

# RenameDialog
source: Give a new name for %1
ta: ஒரு புதிய பெயரைக் கொடுங்கள் %1

# RenameDialog
source: New name
ta: புதிய பெயர்

# RenameDialog
source: A file with this name already exists.
ta: இந்த பெயருடன் ஒரு கோப்பு ஏற்கனவே உள்ளது.

# RootModeLockPage
source: Unable to authenticate
ta: அங்கீகரிக்க முடியவில்லை

# RootModeLockPage
source: It is not possible to use File Browser in Root Mode without authentication.
ta: ஏற்பு இல்லாமல் ரூட் பயன்முறையில் கோப்பு உலாவியைப் பயன்படுத்த முடியாது.

# RootModeLockPage
source: Root Mode: be careful, you could break your system.
ta: ரூட் பயன்முறை: கவனமாக இருங்கள், உங்கள் கணினியை உடைக்கலாம்.

# RootModeLockPage
source: Understood!
ta: புரிந்து கொண்டேன்!

# RootModeLockPage
source: Root Mode
ta: ரூட் பயன்முறை

# RootModeLockPage
source: Be careful when using File Browser in Root Mode. Actions may unexpectedly break your system.
ta: ரூட் பயன்முறையில் கோப்பு உலாவியைப் பயன்படுத்தும் போது கவனமாக இருங்கள். செயல்கள் எதிர்பாராத விதமாக உங்கள் கணினியை உடைக்கக்கூடும்.

# RootModeLockPage
source: Start File Browser in Root Mode
ta: ரூட் பயன்முறையில் கோப்பு உலாவியைத் தொடங்கவும்

# SearchPage
source: Searching
ta: தேடுகிறது

# SearchPage
source: Settings
ta: அமைப்புகள்

# SearchPage
source: Search
ta: தேடல்

# SearchPage
source: Search below “%1”
ta: “%1” க்கு கீழே தேடுங்கள்

# SearchPage
source: %n hit
ta: %n வெற்றி

# SearchPage
source: Deleting
ta: நீக்குதல்

# SearchPage
source: Go to containing folder
ta: கோப்புறையைக் கொண்டிருக்கும்

# SearchPage
source: Cut
ta: வெட்டு

# SearchPage
source: Copy
ta: நகலெடு

# SearchPage
source: Delete
ta: நீக்கு

# SearchPage
source: Internally not ready
ta: உள்நாட்டில் தயாராக இல்லை

# SearchPage
source: Please simply try again
ta: தயவுசெய்து மீண்டும் முயற்சிக்கவும்

# SearchWorker
source: Search already in progress
ta: ஏற்கனவே செயலில் தேடுங்கள்

# SearchWorker
source: Bad search parameters
ta: மோசமான தேடல் அளவுருக்கள்

# SelectionPanel
source: %n file selected
ta: %n கோப்பு தேர்ந்தெடுக்கப்பட்டது

# ShortcutsDialog
source: Select
ta: தேர்ந்தெடு

# ShortcutsList
source: Open system settings
ta: கணினி அமைப்புகள்

# ShortcutsList
source: Rename
ta: மறுபெயரிடுங்கள்

# ShortcutsList
source: Sort
ta: வரிசைப்படுத்து

# ShortcutsList
source: Remove
ta: அகற்று

# ShortcutsList
source: Custom
ta: தனிப்பயன்

# ShortcutsList
source: Locations
ta: இருப்பிடங்கள்

# ShortcutsList
source: Storage devices
ta: சேமிப்பக சாதனங்கள்

# ShortcutsList
source: Bookmarks
ta: புக்மார்க்குகள்

# ShortcutsPage
source: Places
ta: இடங்கள்

# ShortcutsPage
source: Clipboard
ta: இடைநிலைப் பலகை

# ShortcutsPage
source: Transfers
ta: இடமாற்றங்கள்

# ShortcutsPage
source: Documents
ta: ஆவணங்கள்

# ShortcutsPage
source: Pictures
ta: படங்கள்

# ShortcutsPage
source: Videos
ta: வீடியோக்கள்

# ShortcutsPage
source: Music
ta: இசை

# ShortcutsPage
source: Remove bookmark for “%1”
ta: “%1” க்கான புத்தகக்குறியை அகற்று

# ShortcutsPage
source: Add “%1” to bookmarks
ta: புக்மார்க்குகளில் “%1” ஐச் சேர்க்கவும்

# ShortcutsPage
source: New window opened. Sometimes the application stays in the background.
ta: புதிய சாளரம் திறக்கப்பட்டது. சில நேரங்களில் பயன்பாடு பின்னணியில் இருக்கும்.

# ShortcutsPage
source: Open new window
ta: புதிய சாளரத்தைத் திறக்கவும்

# ShortcutsPage
source: Search
ta: தேடல்

# ShortcutsPage
source: Create a new bookmark
ta: புதிய புத்தகக்குறியை உருவாக்கவும்

# ShortcutsPage
source: Save
ta: சேமி

# ShortcutsPage
source: Open storage settings
ta: திறந்த சேமிப்பு அமைப்புகள்

# SizeDetailItem
source: Size
ta: அளவு

# SizeDetailItem
source: size
ta: அளவு

# SizeDetailItem
source: directories
ta: கோப்பகங்கள்

# SizeDetailItem
source: files
ta: கோப்புகள்

# SizeDetailItem
source: unknown size
ta: தெரியாத அளவு

# SizeDetailItem
source: %n directories
ta: %n கோப்பகம்

# SizeDetailItem
source: %n file
ta: %n கோப்பு

# SpaceInspectorMenuItem
source: Analyse disk usage
ta: பகுப்பாய்வு வட்டு பயன்பாடு

# SpaceInspectorMenuItem
source: The “Space Inspector” app will open shortly.
ta: “ச்பேச் இன்ச்பெக்டர்” பயன்பாடு விரைவில் திறக்கப்படும்.

# SpaceInspectorMenuItem
source: The “Space Inspector” app could not be opened.
ta: “ச்பேச் இன்ச்பெக்டர்” பயன்பாட்டை திறக்க முடியவில்லை.

# StorageSizeBar
source: %1 free
ta: %1 இலவசம்

source: %1 full (%2%)
ta: %1 முழு (%2%)

# SupportDialog
source: Hi there!
ta: ஆய்!

# SupportDialog
source: Thank you for using my little app! Maybe you can contribute back?
ta: எனது சிறிய பயன்பாட்டைப் பயன்படுத்தியதற்கு நன்றி! ஒருவேளை நீங்கள் மீண்டும் பங்களிக்க முடியுமா?

# SupportDialog
source: Thank you for your support!
ta: உங்கள் ஆதரவுக்கு நன்றி!

# SupportDialog
source: Remind me later
ta: பின்னர் எனக்கு நினைவூட்டுங்கள்

# SupportDialog
source: Don't ask me again
ta: மீண்டும் என்னிடம் கேட்க வேண்டாம்

# TextEditor
source: Cannot open “%1”
ta: “%1” ஐ திறக்க முடியாது

# TextEditor
source: File “%1” is too large to be edited
ta: “%1” கோப்பு திருத்தப்பட முடியாத அளவுக்கு பெரியது

# TextEditor
source: No file name specified
ta: கோப்பு பெயர் எதுவும் குறிப்பிடப்படவில்லை

# TextEditor
source: No permission to write to “%1”
ta: “%1” க்கு எழுத இசைவு இல்லை

# TextEditor
source: Cannot open “%1” for writing
ta: எழுதுவதற்கு “%1” ஐ திறக்க முடியாது

# TextEditorDialog translated app name
source: File Browser
ta: கோப்பு உலாவி

# TextEditorDialog
source: Failed to open “%1”
ta: “%1” ஐ திறக்கத் தவறிவிட்டது

# TextEditorDialog
source: Failed to save “%1”
ta: “%1” ஐ சேமிப்பதில் தோல்வி

# TextEditorDialog
source: Failed to edit “%1”
ta: “%1” ஐ திருத்துவதில் தோல்வி

# TextEditorDialog
source: Open externally
ta: வெளிப்புறமாக திறக்கவும்

# TextEditorDialog
source: No application to open the file
ta: கோப்பைத் திறக்க விண்ணப்பம் இல்லை

# TextEditorDialog
source: Disable predictive text input
ta: முன்கணிப்பு உரை உள்ளீட்டை முடக்கு

# TextEditorDialog
source: Enable predictive text input
ta: முன்கணிப்பு உரை உள்ளீட்டை இயக்கவும்

# TextEditorDialog
source: Save
ta: சேமி

# TransferDialog
source: Clear selection
ta: துடை தேர்வு

# TransferDialog
source: Enter target path
ta: இலக்கு பாதையை உள்ளிடவும்

# TransferDialog
source: Select
ta: தேர்ந்தெடு

# TransferDialog
source: Switch to target directory
ta: இலக்கு கோப்பகத்திற்கு மாறவும்

# TransferDialog
source: %n item
ta: %n உருப்படி

# TransferDialog
source: %n target
ta: %n இலக்கு

# TransferDialog
source: Nothing selected to transfer
ta: இடமாற்றம் செய்ய எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# TransferPanel
source: %n file
ta: %n கோப்பு

# TransferPanel
source: %n destination
ta: %n இலக்கிடம்

# TransferPanel
source: Successfully copied
ta: வெற்றிகரமாக நகலெடுக்கப்பட்டது

# TransferPanel
source: Successfully moved
ta: வெற்றிகரமாக நகர்ந்தது

# TransferPanel
source: Successfully linked
ta: வெற்றிகரமாக இணைக்கப்பட்டுள்ளது

# TransferPanel
source: Failed to copy
ta: நகலெடுப்பதில் தோல்வி

# TransferPanel
source: Failed to move
ta: நகர்த்தத் தவறிவிட்டது

# TransferPanel
source: Failed to link
ta: இணைக்கத் தவறிவிட்டது

# TransferPanel
source: Replace?
ta: மாற்றவா?

# TransferPanel
source: Cancel
ta: ரத்துசெய்

# TransferPanel
source: Overwrite
ta: மேலெழுதும்

# TransferPanel
source: These files or folders already exist in “%1”:
ta: இந்த கோப்புகள் அல்லது கோப்புறைகள் ஏற்கனவே “%1” இல் உள்ளன:

# TransferPanel
source: Trying to move between phone and SD Card? It does not work, try copying.
ta: தொலைபேசி மற்றும் எச்டி கார்டுக்கு இடையில் செல்ல முயற்சிக்கிறீர்களா? இது வேலை செய்யாது, நகலெடுக்க முயற்சிக்கவும்.

# TransferPanel
source: Perhaps the storage is full?
ta: ஒருவேளை சேமிப்பு நிரம்பியிருக்கலாம்?

# TransferPanel
source: Unable to overwrite existing file with symlink
ta: சிம்லிங்குடன் இருக்கும் கோப்பை மேலெழுத முடியவில்லை

# TransferPanel
source: Copying
ta: நகலெடுக்கும்

# TransferPanel
source: Moving
ta: நகரும்

# TransferPanel
source: Linking
ta: இணைத்தல்

# ViewImagePage
source: Loading image
ta: படத்தை ஏற்றுகிறது

# ViewImagePage
source: Failed to load
ta: ஏற்றுவதில் தோல்வி

# ViewPage verb as in 'edit this file'
source: Edit
ta: தொகு

# ViewSettingsPage
source: Sorting and View
ta: வரிசைப்படுத்துதல் மற்றும் பார்வை

# ViewSettingsPage
source: Settings apply only to the current folder. Swipe from the right to change default values.
ta: அமைப்புகள் தற்போதைய கோப்புறைக்கு மட்டுமே பொருந்தும். இயல்புநிலை மதிப்புகளை மாற்றுவதற்கான உரிமையிலிருந்து ச்வைப் செய்யவும்.

# ViewSettingsPage
source: Settings apply to all folders.
ta: அனைத்து கோப்புறைகளுக்கும் அமைப்புகள் பொருந்தும்.

# ViewSettingsPage
source: Sort by...
ta: வரிசைப்படுத்துங்கள் ...

# ViewSettingsPage
source: Name
ta: பெயர்

# ViewSettingsPage
source: Size
ta: அளவு

# ViewSettingsPage
source: Modification date
ta: மாற்றும் தேதி

# ViewSettingsPage
source: File type
ta: கோப்பு வகை

# ViewSettingsPage
source: Order...
ta: ஒழுங்கு ...

# ViewSettingsPage
source: ascending
ta: ஏறுதல்

# ViewSettingsPage
source: descending
ta: இறங்கு

# ViewSettingsPage
source: Preview images...
ta: முன்னோட்ட படங்கள் ...

# ViewSettingsPage
source: none
ta: எதுவுமில்லை

# ViewSettingsPage
source: small
ta: சிறிய

# ViewSettingsPage
source: medium
ta: நடுத்தர

# ViewSettingsPage
source: large
ta: பெரிய

# ViewSettingsPage
source: huge
ta: பெரிய

# ViewSettingsPage
source: Show hidden files
ta: மறைக்கப்பட்ட கோப்புகளைக் காட்டு

# ViewSettingsPage
source: Show files with names starting with a full stop (“.”).
ta: முழு நிறுத்தத்துடன் (“.”) தொடங்கும் பெயர்களுடன் கோப்புகளைக் காண்பி.

# ViewSettingsPage
source: Enable gallery mode
ta: கேலரி பயன்முறையை இயக்கவும்

# ViewSettingsPage
source: In gallery mode, images will be shown to fit the screen. Other files are shown without preview thumbnails.
ta: கேலரி பயன்முறையில், திரைக்கு ஏற்றவாறு படங்கள் காண்பிக்கப்படும். பிற கோப்புகள் முன்னோட்ட சிறு உருவங்கள் இல்லாமல் காட்டப்படுகின்றன.

# ViewSettingsPage
source: Sort case-sensitively
ta: வழக்கு-உணர்திறன் வரிசைப்படுத்தவும்
