Repository: 247i/TACETr
Catalog: உரை/தானி/harbour-file-browser-translations-*.po
Languages: ta

# ViewSettingsPage
source: Show files with names starting with a capital letter first.
ta: முதலில் ஒரு பெரிய கடிதத்துடன் தொடங்கும் பெயர்களுடன் கோப்புகளைக் காண்பி.

# ViewSettingsPage
source: Show folders first
ta: முதலில் கோப்புறைகளைக் காட்டு

# ViewSettingsPage
source: Always show folders at the top of the file list.
ta: கோப்பு பட்டியலின் மேலே எப்போதும் கோப்புறைகளைக் காட்டுங்கள்.

# ViewSettingsPage
source: Show hidden files last
ta: மறைக்கப்பட்ட கோப்புகளை கடைசியாக காட்டு

# ViewSettingsPage
source: Always show files starting with a full stop (“.”) at the end of the file list.
ta: கோப்பு பட்டியலின் முடிவில் முழு நிறுத்தத்தில் (“.”) தொடங்கும் கோப்புகளை எப்போதும் காண்பி.

# ViewVideoPage translated app name
source: File Browser
ta: கோப்பு உலாவி

# files
source: Copying
ta: நகலெடுக்கும்

# files
source: Moving
ta: நகரும்

# files
source: Linking
ta: இணைத்தல்

# files
source: Unknown
ta: தெரியாத

# paths
source: root
ta: மூலம்
