Repository: 247i/TACETr
Catalog: உரை/தானி/harmony-music-project-translations-*.po
Languages: ta

source: Home
ta: முகப்பு

source: Songs
ta: பாடல்கள்

source: Playlists
ta: இசைப்பட்டியல்

source: Albums
ta: ஆல்பம்

source: Singles
ta: ஒற்றைபாடல்கள்

source: Artists
ta: கலைஞர்கள்

source: Settings
ta: அமைப்புகள்

source: Library
ta: இசைத் தொகுப்பு

# libSongs
source: Library Songs
ta: இசை தொகுப்புகள்

# libPlaylists
source: Library Playlists
ta: இசை தொகுப்பு பட்டியல்கள்

# libAlbums
source: Library Albums
ta: இசை தொகுப்பு ஆல்பங்கள்

# libArtists
source: Library Artists
ta: இசை தொகுப்பு கலைஞர்கள்

source: Community Playlists
ta: சமூக இசைப்பட்டியல்கள்

source: Featured Playlists
ta: முதன்மை பட்டியல்

source: items
ta: உருப்படிகள்

# networkError1
source: Oops network error!
ta: இணைய இணைப்பு பிழை!

source: Retry!
ta: மறுபடியும் முயற்சி செய்!

# noOfflineSong
source: No offline songs!
ta: ஆஃப்லைன் பாடல்கள் இல்லை!

source: Recently Played
ta: சமீபத்தில் இசைத்தது

source: Favorites
ta: விருப்பமானவை

# cachedOrOffline
source: Cached/Offline
ta: தற்காலிக சேமிப்பு/ஆஃப்லைன்

source: Downloads
ta: பதிவிறக்கங்கள்

source: Empty playlist!
ta: வெறுமையான பட்டியல்!

source: Enqueue all
ta: எல்லாவற்றையும் வரிசைப்படுத்து

source: Rename Playlist
ta: பட்டியலை மறுபெயரிடு

source: Remove playlist
ta: பட்டியலை நீக்கு

source: Create new playlist
ta: புதிய பட்டியலை உருவாக்கு

source: Rearrange playlist
ta: பட்டியலை மறுசீரமைக்கவும்

# removeMultiple
source: Remove multiple songs
ta: பல பாடல்களை நீக்கு

# addMultipleSongs
source: Add songs to playlist
ta: பட்டியலுக்கு பாடல்களைச் சேர்க்கவும்

source: Cancel
ta: ரத்து செய்

source: Create
ta: உருவாக்கு

source: Rename
ta: மறுபெயரிடு

# createnAdd
source: Create & add
ta: உருவாக்கி சேர்க்க

source: No bookmarks!
ta: எந்த குறிப்புகளும் இல்லை!

source: Start radio
ta: ரேடியோ தொடங்கு

source: Play next
ta: அடுத்து இசைக்க

source: Add to playlist
ta: பிளேலிச்ட்டில் சேர்க்கவும்

# noLibPlaylist
source: You don't have any lib playlist!
ta: உங்களிடம் லிப் பிளேலிச்ட் இல்லை!

# enqueueSong
source: Enqueue this song
ta: இந்த பாடலை enqueue

source: Go to album
ta: ஆல்பத்திற்குச் செல்லுங்கள்

source: View Artist
ta: கலைஞரைக் காண்க

source: Open in
ta: திறந்த

# shareSong
source: Share this song
ta: இந்த பாடலைப் பகிரவும்

source: Remove from playlist
ta: பிளேலிச்ட்டிலிருந்து அகற்று

source: Remove from queue
ta: வரிசையிலிருந்து அகற்று

# queueShufflingDeniedMsg
source: Queue can't be shuffled when shuffle mode is enabled
ta: கலக்கு பயன்முறை இயக்கப்பட்டால் வரிசையை மாற்ற முடியாது

# queuerearrangingDeniedMsg
source: Queue can't be rearranged when shuffle mode is enabled
ta: கலக்கு பயன்முறை இயக்கப்பட்டால் வரிசையை மறுசீரமைக்க முடியாது

# songNotPlayable
source: Song is not playable due to server restriction!
ta: சேவையக கட்டுப்பாடு காரணமாக பாடல் இயக்கப்படவில்லை!

source: Up Next
ta: அடுத்து

# playnextMsg
source: Upcoming
ta: வரவிருக்கும்

source: Shuffle Queue
ta: கலக்கு வரிசை

source: Queue loop
ta: வரிசை வளையம்

# queueLoopNotDisMsg1
source: Queue loop mode cannot be disabled when shuffle mode is enabled.
ta: கலக்கு பயன்முறை இயக்கப்பட்டால் வரிசை லூப் பயன்முறையை முடக்க முடியாது.

# queueLoopNotDisMsg2
source: Queue loop mode cannot be enabled in radio mode.
ta: ரேடியோ பயன்முறையில் வரிசை லூப் பயன்முறையை இயக்க முடியாது.

# removeFromLib
source: Remove from Library Songs
ta: நூலக பாடல்களிலிருந்து அகற்று

source: Sleep Timer
ta: தூக்க நேரங்குறிகருவி

source: Add 5 minutes
ta: 5 நிமிடங்கள் சேர்க்கவும்

source: Cancel timer
ta: டைமரை ரத்துசெய்

# deleteDownloadData
source: Remove from downloads
ta: பதிவிறக்கங்களிலிருந்து அகற்று

source: minutes
ta: நிமிடங்கள்

source: End of this song
ta: இந்த பாடலின் முடிவு

source: App Info
ta: பயன்பாட்டு செய்தி

source: Download
ta: பதிவிறக்கம்

# autoDownFavSong
source: Auto download favorite songs
ta: தானாக பதிவிறக்கம் பிடித்த பாடல்கள்

# autoDownFavSongDes
source: Automatically download favorite songs when added to favorites
ta: பிடித்தவைகளில் சேர்க்கும்போது தானாகவே பிடித்த பாடல்களை பதிவிறக்கவும்

# networkError
source: Network error! Check your network connection.
ta: பிணைய பிழை! உங்கள் பிணைய இணைப்பை சரிபார்க்கவும்.

# downloadError2
source: Requested song is not downloadable due to server restriction. You may try again
ta: சேவையக கட்டுப்பாடு காரணமாக கோரப்பட்ட பாடல் பதிவிறக்கம் செய்யப்படாது. நீங்கள் மீண்டும் முயற்சி செய்யலாம்

# downloadError3
source: Downloading failed due to network error! Please try again
ta: பிணையம் பிழை காரணமாக பதிவிறக்கம் தோல்வியுற்றது! மீண்டும் முயற்சிக்கவும்

source: Music & Playback
ta: இசை & பின்னணி

source: Content
ta: உள்ளடக்கம்

source: Personalisation
ta: தனிப்பயனாக்கம்

source: Theme Mode
ta: கருப்பொருள் பயன்முறை

source: Dynamic
ta: மாறும்

source: System default
ta: கணினி இயல்புநிலை

source: Dark
ta: இருண்ட

source: Light
ta: ஒளி

source: Language
ta: மொழி

source: Player Ui
ta: பிளேயர் இடைமுகம்

# playerUiDes
source: Select player user interface
ta: பிளேயர் பயனர் இடைமுகத்தைத் தேர்ந்தெடுக்கவும்

source: Standard
ta: தரநிலை

source: Gesture
ta: சைகை

# languageDes
source: Set App language
ta: பயன்பாட்டு மொழியை அமைக்கவும்

source: Set discover content
ta: டிச்கவர் உள்ளடக்கத்தை அமைக்கவும்

source: Quick Picks
ta: விரைவான தேர்வுகள்

source: Discover
ta: கண்டுபிடி

source: Trending
ta: டிரெண்டிங்

source: Top Music Videos
ta: சிறந்த இசை வீடியோக்கள்

# basedOnLast
source: Based on last interaction
ta: கடைசி தொடர்புகளின் அடிப்படையில்

source: Restore last playback session
ta: கடைசி பின்னணி அமர்வை மீட்டமைக்கவும்

# restoreLastPlaybackSessionDes
source: Automatically restore the last playback session on app start
ta: பயன்பாட்டு தொடக்கத்தில் கடைசி பிளேபேக் அமர்வை தானாக மீட்டெடுக

source: Home content count
ta: வீட்டு உள்ளடக்க எண்ணிக்கை

# homeContentCountDes
source: Select the number of initial homescreen-content(approx). Lesser results faster loading
ta: ஆரம்ப ஓம்ச்கிரீன்-உள்ளடக்கத்தின் எண்ணிக்கையைத் தேர்ந்தெடுக்கவும் (தோராயமாக). குறைந்த முடிவுகள் வேகமாக ஏற்றுதல்

# enableBottomNav
source: Bottom navigation bar
ta: கீழே உள்ள வழிசெலுத்தல் பட்டி

# enableBottomNavDes
source: Switch to bottom navigation bar
ta: கீழ் வழிசெலுத்தல் பட்டியில் மாறவும்

source: Cache Songs
ta: கேச் பாடல்கள்

# cacheSongsDes
source: Caching songs while playing for future/offline playback, it will take additional space on your device
ta: எதிர்கால/ஆஃப்லைன் பின்னணியில் விளையாடும்போது பாடல்களை தேக்கப்படுத்துதல், இது உங்கள் சாதனத்தில் கூடுதல் இடத்தை எடுக்கும்

source: Skip silence
ta: ம .னத்தைத் தவிர்க்கவும்

# skipSilenceDes
source: Silence will be skipped in music playback
ta: மியூசிக் பிளேபேக்கில் ம silence னம் தவிர்க்கப்படும்

source: Loudness normalization
ta: உரத்த இயல்பாக்கம்

# loudnessNormalizationDes
source: Sets same lavel of loudness for all songs (Experimental) (Will not work on songs downloaded on previous version(< v1.10.0))
ta: எல்லா பாடல்களுக்கும் ஒரே அளவிலான சத்தத்தை அமைக்கிறது (சோதனை) (முந்தைய பதிப்பில் பதிவிறக்கம் செய்யப்பட்ட பாடல்களில் (<v1.10.0) வேலை செய்யாது)

source: Streaming quality
ta: ச்ட்ரீமிங் தகுதி

# streamingQualityDes
source: Quality of music stream
ta: இசை ச்ட்ரீமின் தகுதி

source: Disable transition animation
ta: மாற்றம் அனிமேசனை முடக்கு

# disableTransitionAnimationDes
source: Enable this option to disable tab transition animation
ta: தாவல் மாற்றம் அனிமேசனை முடக்க இந்த விருப்பத்தை இயக்கவும்

# enableSlidableAction
source: Enable slidable actions
ta: மந்தமான செயல்களை இயக்கவும்

# enableSlidableActionDes
source: Enable slidable actions on song tile
ta: பாடல் ஓடு மீது மந்தமான செயல்களை இயக்கவும்

source: High
ta: உயர்ந்த

source: Low
ta: குறைந்த

# backgroundPlay
source: Background music play
ta: பின்னணி இசை நாடகம்

# backgroundPlayDes
source: Enable/Disable music playing in background (App can be accessed from system tray when app is running in background)
ta: பின்னணியில் இசையை இயக்கவும்/முடக்கவும் (பயன்பாடு பின்னணியில் இயங்கும்போது கணினி தட்டில் இருந்து பயன்பாட்டை அணுகலாம்)

source: Download Location
ta: இருப்பிடத்தைப் பதிவிறக்கவும்

# cacheHomeScreenData
source: Cache home screen content data
ta: முகப்பு திரை உள்ளடக்க தரவு கேச்

# cacheHomeScreenDataDes
source: Enable Caching home screen content data, Home screen will load instantly if this option is enabled
ta: முகப்புத் திரை உள்ளடக்கத் தரவை கேச்சிங் செய்யுங்கள், இந்த விருப்பம் இயக்கப்பட்டிருந்தால் முகப்புத் திரை உடனடியாக ஏற்றப்படும்

# downloadingFormat
source: Downloading File Format
ta: கோப்பு வடிவமைப்பைப் பதிவிறக்குகிறது

# downloadingFormatDes
source: Select downloading file format. "Opus" will provide best quality
ta: கோப்பு வடிவமைப்பைப் பதிவிறக்குவதைத் தேர்ந்தெடுக்கவும். "ஓபச்" சிறந்த தரத்தை வழங்கும்

# exportDowloadedFiles
source: Export downloaded files
ta: பதிவிறக்கம் செய்யப்பட்ட கோப்புகளை ஏற்றுமதி செய்யுங்கள்

# exportDowloadedFilesDes
source: Click here to export downloaded file from inApp dir to external dir
ta: பதிவிறக்கம் செய்யப்பட்ட கோப்பை inapp அடைவு இலிருந்து வெளிப்புற அடைவு க்கு ஏற்றுமதி செய்ய இங்கே சொடுக்கு செய்க

# exportedFileLocation
source: Downloaded file export location
ta: பதிவிறக்கம் செய்யப்பட்ட கோப்பு ஏற்றுமதி இடம்

source: Export
ta: ஏற்றுமதி

source: Exporting...
ta: ஏற்றுமதி ...

source: Scanning...
ta: ச்கேனிங் ...

# downFilesFound
source: downloaded files found
ta: பதிவிறக்கம் செய்யப்பட்ட கோப்புகள் கிடைத்தன

source: Close
ta: மூடு

# exportMsg
source: Files successfully exported
ta: கோப்புகள் வெற்றிகரமாக ஏற்றுமதி செய்யப்பட்டன

source: Equalizer
ta: சமநிலைப்படுத்தி

# equalizerDes
source: Open system equalizer
ta: திறந்த கணினி சமநிலைப்படுத்தி

# clearImgCache
source: Clear images cache
ta: அழி படங்கள் தற்காலிக சேமிப்பு

# clearImgCacheAlert
source: Images cache cleared successfully
ta: படங்கள் கேச் வெற்றிகரமாக அழிக்கப்பட்டது

# clearImgCacheDes
source: Click here to clear cached thumbnails/images. (Not recommended unless want to refresh cached images data)
ta: தற்காலிக சேமிப்பு சிறு உருவங்கள்/படங்களை அழிக்க இங்கே சொடுக்கு செய்க. (தற்காலிக சேமிப்பு படங்களை புதுப்பிக்க விரும்பினால் தவிர பரிந்துரைக்கப்படவில்லை)

# ignoreBatOpt
source: Ignore battery optimization
ta: பேட்டரி தேர்வுமுறை புறக்கணிக்கவும்

# ignoreBatOptDes
source: If you are facing notification issues or playback stopped by system optimization, please enable this option
ta: கணினி உகப்பாக்கம் மூலம் நீங்கள் அறிவிப்பு சிக்கல்கள் அல்லது பிளேபேக் நிறுத்தப்பட்டால், தயவுசெய்து இந்த விருப்பத்தை இயக்கவும்

source: Status
ta: நிலை

source: Enabled
ta: இயக்கப்பட்டது

source: Disabled
ta: முடக்கப்பட்டது

source: GitHub
ta: கிரப்

# githubDes
source: View GitHub source code if you like this project, don't forget to give a ⭐
ta: அறிவிலிமையம் மூலக் குறியீட்டைக் காண்க இந்த திட்டத்தை நீங்கள் விரும்பினால், கொடுக்க மறக்காதீர்கள்

source: by
ta: மூலம்

# urlSearchDes
source: Url detected click on it to open/play associated content
ta: தொடர்புடைய உள்ளடக்கத்தைத் திறக்க/விளையாட முகவரி கண்டறியப்பட்டதைக் சொடுக்கு செய்க

source: Search
ta: தேடல்

# searchDes
source: Songs, Playlist, Album or Artist
ta: பாடல்கள், பிளேலிச்ட், ஆல்பம் அல்லது கலைஞர்

# searchRes
source: Search results
ta: தேடல் முடிவுகள்

# for1
source: for
ta: க்கு

source: Videos
ta: வீடியோக்கள்

source: View all
ta: அனைத்தையும் காண்க

source: Results
ta: முடிவுகள்

# nomatch
source: No Match found for
ta: எந்த போட்டியும் கிடைக்கவில்லை

source: subscribers
ta: சந்தாதாரர்கள்

source: About
ta: பற்றி

source: Synced
ta: ஒத்திசைக்கப்பட்டது

source: Plain
ta: வெற்று

source: Song Info
ta: பாடல் செய்தி

source: Id
ta: ஐடி

source: Title
ta: தலைப்பு

source: Duration
ta: காலம்

source: Audio Codec
ta: ஆடியோ கோடெக்

source: Bitrate
ta: பிட்ரேட்

source: LoudnessDb
ta: Olownessdb

# deleteDownloadedDataAlert
source: Successfully removed from downloads!
ta: பதிவிறக்கங்களிலிருந்து வெற்றிகரமாக அகற்றப்பட்டது!

# cancelTimerAlert
source: Sleep timer cancelled
ta: ச்லீப் நேரங்குறிகருவி ரத்து செய்யப்பட்டது

# sleepTimeSetAlert
source: Your sleep timer is set
ta: உங்கள் தூக்க நேரங்குறிகருவி அமைக்கப்பட்டுள்ளது

# radioNotAvailable
source: Radio not available for this artist!
ta: இந்த கலைஞருக்கு வானொலி கிடைக்கவில்லை!

# songRemovedfromQueue
source: Removed from queue!
ta: வரிசையிலிருந்து அகற்றப்பட்டது!

# songRemovedfromQueueCurrSong
source: You can't remove currently playing song
ta: தற்போது வாசிக்கும் பாடலை நீங்கள் அகற்ற முடியாது

# songAddedToPlaylistAlert
source: Song added to playlist!
ta: பிளேலிச்ட்டில் பாடல் சேர்க்கப்பட்டது!

source: Song already exists!
ta: பாடல் ஏற்கனவே உள்ளது!

# songAlreadyOfflineAlert
source: Song already offline in cache
ta: கேச்சில் ஏற்கனவே ஆஃப்லைனில் பாடல்

# songEnqueueAlert
source: Song enqueued!
ta: பாடல் enqueud!

# songRemovedAlert
source: Removed from
ta: இருந்து அகற்றப்பட்டது

# errorOccuredAlert
source: Some error occured!
ta: சில பிழை ஏற்பட்டது!

# pipedplstSyncAlert
source: Piped playlist synced!
ta: குழாய் பிளேலிச்ட் ஒத்திசைக்கப்பட்டது!

# playlistCreatedAlert
source: Playlist created!
ta: பிளேலிச்ட் உருவாக்கப்பட்டது!

# playlistCreatednsongAddedAlert
source: Playlist created & song added!
ta: பிளேலிச்ட் உருவாக்கப்பட்டது மற்றும் பாடல் சேர்க்கப்பட்டது!

# playlistRenameAlert
source: Renamed successfully!
ta: வெற்றிகரமாக மறுபெயரிடப்பட்டது!

# playlistRemovedAlert
source: Playlist removed!
ta: பிளேலிச்ட் அகற்றப்பட்டது!

# playlistBookmarkAddAlert
source: Playlist bookmarked!
ta: பிளேலிச்ட் புக்மார்க்கு செய்யப்பட்டது!

# playlistBookmarkRemoveAlert
source: Playlist bookmark removed!
ta: பிளேலிச்ட் புக்மார்க்கு அகற்றப்பட்டது!

# albumBookmarkAddAlert
source: Album bookmarked!
ta: ஆல்பம் புக்மார்க்கு செய்யப்பட்டது!

# albumBookmarkRemoveAlert
source: Album bookmark removed!
ta: ஆல்பம் புக்மார்க்கு அகற்றப்பட்டது!

# artistBookmarkAddAlert
source: Artist bookmarked!
ta: கலைஞர் புக்மார்க்கு!

# artistBookmarkRemoveAlert
source: Artist bookmark removed!
ta: கலைஞர் புக்மார்க்கு நீக்கப்பட்டது!

source: Lyrics not available!
ta: வரிகள் கிடைக்கவில்லை!

source: Synced lyrics not available!
ta: ஒத்திசைக்கப்பட்ட பாடல் கிடைக்கவில்லை!

# artistDesNotAvailable
source: Description not available!
ta: விளக்கம் கிடைக்கவில்லை!

source: New version available!
ta: புதிய பதிப்பு கிடைக்கிறது!

# dontShowInfoAgain
source: Don't show this info again
ta: இந்த தகவலை மீண்டும் காட்ட வேண்டாம்

source: Dismiss
ta: தள்ளுபடி

# notaSongVideo
source: Not a Song/Music-Video!
ta: ஒரு பாடல்/இசை-வீடியோ அல்ல!

source: Not a valid link!
ta: சரியான இணைப்பு அல்ல!

source: Operation failed
ta: செயல்பாடு தோல்வியடைந்தது

# goToDownloadPage
source: Click here to go to download page
ta: பதிவிறக்க பக்கத்திற்குச் செல்ல இங்கே சொடுக்கு செய்க

source: Local
ta: உள்ளக

source: Piped
ta: குழாய்

source: Link
ta: இணைப்பு

source: Unlink
ta: இணைக்கவும்

# hintApiUrl
source: API URL to Piped instance
ta: குழாய் உதாரத்திற்கு பநிஇ முகவரி

# customIns
source: Custom Instance
ta: தனிப்பயன் நிகழ்வு

# customInsSelectMsg
source: Please select Custom Instance
ta: தனிப்பயன் நிகழ்வைத் தேர்ந்தெடுக்கவும்

# selectAuthInsMsg
source: Please select Authentication instance!
ta: அங்கீகார நிகழ்வைத் தேர்ந்தெடுக்கவும்!

# allFieldsReqMsg
source: All fields required
ta: தேவையான அனைத்து புலங்களும்

# linkPipedDes
source: Link with piped for playlists
ta: பிளேலிச்ட்களுக்கான குழாய் மூலம் இணைப்பு

# selectAuthIns
source: Select Auth Instance
ta: அங்கீகார நிகழ்வைத் தேர்ந்தெடுக்கவும்

source: Username
ta: பயனர்பெயர்

source: Password
ta: கடவுச்சொல்

# linkAlert
source: Linked successfully!
ta: வெற்றிகரமாக இணைக்கப்பட்டுள்ளது!

# unlinkAlert
source: Unlinked successfully!
ta: வெற்றிகரமாக இணைக்கப்படவில்லை!

# playlistBlacklistAlert
source: Playlist blacklisted!
ta: பிளேலிச்ட் தடுப்புப்பட்டியல்!

source: Reset
ta: மீட்டமை

# blacklistPlstResetAlert
source: Reset successfully!
ta: வெற்றிகரமாக மீட்டமைக்கவும்!

# resetblacklistedplaylist
source: Reset blacklisted playlists
ta: தடுப்புப்பட்டியல் பிளேலிச்ட்களை மீட்டமைக்கவும்

# resetblacklistedplaylistDes
source: Reset all the piped blacklisted playlists
ta: குழாய் பட்டியலிடப்பட்ட பிளேலிச்ட்கள் அனைத்தையும் மீட்டமைக்கவும்

source: Stop music on task clear
ta: பணியில் இசையை நிறுத்துங்கள்

# stopMusicOnTaskClearDes
source: Music playback will stop when App being swiped away from the task manager
ta: பணி மேலாளரிடமிருந்து பயன்பாடு ச்வைப் செய்யப்படும்போது மியூசிக் பிளேபேக் நின்றுவிடும்

source: Backup App data
ta: காப்புப்பிரதி பயன்பாட்டு தரவு

# androidBackupWarning
source: Not tested: Selecting the checkbox after downloading more than 60 files, process may consume a large amount of memory and could cause the phone or app to crash. Proceed at your own risk.
ta: சோதிக்கப்படவில்லை: தேர்வுப்பெட்டியைத் தேர்ந்தெடுப்பது 60 க்கும் மேற்பட்ட கோப்புகளைப் பதிவிறக்கிய பிறகு, செயல்முறை அதிக அளவு நினைவகத்தை உட்கொள்ளக்கூடும், மேலும் தொலைபேசி அல்லது பயன்பாடு செயலிழக்கக்கூடும். உங்கள் சொந்த ஆபத்தில் தொடரவும்.

# backupSettingsAndPlaylistsDes
source: Saves all settings, playlists and login data in a backup file
ta: காப்புப்பிரதி கோப்பில் அனைத்து அமைப்புகள், பிளேலிச்ட்கள் மற்றும் உள்நுழைவு தரவை சேமிக்கிறது

source: Backup
ta: காப்புப்பிரதி

# letsStrart
source: Let's start..
ta: ஆரம்பிக்கலாம் ..

# processFiles
source: Processing files...
ta: செயலாக்க கோப்புகளை ...

# includeDownloadedFiles
source: Include downloded songs files
ta: பதிவிறக்கம் செய்யப்பட்ட பாடல்கள் கோப்புகளைச் சேர்க்கவும்

source: Backup in progress...
ta: காப்புப்பிரதி முன்னேற்றம் ...

source: Restore App data
ta: பயன்பாட்டு தரவை மீட்டமைக்கவும்

# restoreSettingsAndPlaylistsDes
source: Restores all settings, login data and playlists from a backup file. Overwrites all current data
ta: காப்புப்பிரதி கோப்பிலிருந்து அனைத்து அமைப்புகளையும், உள்நுழைவு தரவு மற்றும் பிளேலிச்ட்களை மீட்டமைக்கிறது. தற்போதைய எல்லா தரவையும் மேலெழுதும்

# backupMsg
source: Backup successfully saved!
ta: காப்புப்பிரதி வெற்றிகரமாக சேமிக்கப்பட்டது!

# backFilesFound
source: databases found
ta: தரவுத்தளங்கள் காணப்பட்டன

# restoreMsg
source: Successfully restored! Changes are applied on restart
ta: வெற்றிகரமாக மீட்டெடுக்கப்பட்டது! மறுதொடக்கத்தில் மாற்றங்கள் பயன்படுத்தப்படுகின்றன

source: Restoring...
ta: மீட்டமைத்தல் ...

source: Restore
ta: மீட்டமை

source: Close App
ta: பயன்பாட்டை மூடு

source: Restart App
ta: பயன்பாட்டை மறுதொடக்கம் செய்யுங்கள்
