Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-webpages-*.po
Languages: ta

# workbooks->levels->[3]->exercises->[10]->answer
source: Incorrect. You need quotation marks at the end of the sentence.
ta: தவறானது. வாக்கியத்தின் முடிவில் உங்களுக்கு மேற்கோள் குறிகள் தேவை.

# workbooks->levels->[3]->exercises->[11]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[3]->exercises->[11]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[3]->exercises->[11]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[3]->exercises->[11]->code
source: print "I think I'll feed the llama"
ta: அச்சிடுக "நான் லாமாவுக்கு உணவளிப்பேன் என்று நினைக்கிறேன்"

# workbooks->levels->[3]->exercises->[11]->answer
source: Correct! You can use the apostrophe when using the double quotation marks.
ta: சரியானது! இரட்டை மேற்கோள் மதிப்பெண்களைப் பயன்படுத்தும் போது நீங்கள் அப்போச்ட்ரோபியைப் பயன்படுத்தலாம்.

# workbooks->levels->[3]->exercises->[12]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[3]->exercises->[12]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[3]->exercises->[12]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[3]->exercises->[12]->code
source: print 'The llama just wondered off into the streets' print "Such an adventure"
ta: அச்சிடுக 'லாமா தெருக்களில் ஆச்சரியப்பட்டார்' "அத்தகைய சாகசத்தை" அச்சிடுக

# workbooks->levels->[3]->exercises->[12]->answer
source: Correct! You don't need to use the same quotation marks in every sentence, but we do recommend it though
ta: சரியானது! ஒவ்வொரு வாக்கியத்திலும் நீங்கள் அதே மேற்கோள் மதிப்பெண்களைப் பயன்படுத்தத் தேவையில்லை, ஆனால் நாங்கள் அதை பரிந்துரைக்கிறோம்

# workbooks->levels->[3]->exercises->[13]->type
source: text
ta: உரை

# workbooks->levels->[3]->exercises->[13]->contents
source: #### Ask Remember to use quotation marks after `ask` as well! #### Exercise 3: Error? Read the programs carefully! Which ones are correct?
ta: #### கேளுங்கள் `கேளுங்கள் 'க்குப் பிறகு மேற்கோள் மதிப்பெண்களைப் பயன்படுத்த நினைவில் கொள்ளுங்கள்! #### உடற்பயிற்சி 3: பிழை? நிரல்களை கவனமாகப் படியுங்கள்! எது சரியானது?

# workbooks->levels->[3]->exercises->[14]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[3]->exercises->[14]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[3]->exercises->[14]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[3]->exercises->[14]->code
source: ask 'Do you see those two rabbits?'
ta: 'அந்த இரண்டு முயல்களையும் நீங்கள் பார்க்கிறீர்களா?'

# workbooks->levels->[3]->exercises->[14]->answer
source: Incorrect. Remember to use a variable with ask!
ta: தவறானது. கேட்பதன் மூலம் ஒரு மாறியைப் பயன்படுத்த நினைவில் கொள்ளுங்கள்!

# workbooks->levels->[3]->exercises->[15]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[3]->exercises->[15]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[3]->exercises->[15]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[3]->exercises->[15]->code
source: naam is ask 'What is your name
ta: Naam என்று கேளுங்கள் 'உங்கள் பெயர் என்ன

# workbooks->levels->[3]->exercises->[15]->answer
source: Incorrect. You need a pair of quotation marks.
ta: தவறானது. உங்களுக்கு ஒரு இணை மேற்கோள் மதிப்பெண்கள் தேவை.

# workbooks->levels->[3]->exercises->[16]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[3]->exercises->[16]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[3]->exercises->[16]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[3]->exercises->[16]->code
source: owner is ask "Is that Jack's capybara or Lucy's?"
ta: உரிமையாளர் கேட்கிறார் "அது சாக் கேபிபரா அல்லது லூசியின்?"

# workbooks->levels->[3]->exercises->[16]->answer
source: Correct.
ta: சரியானது.

# workbooks->levels->[3]->exercises->[17]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[3]->exercises->[17]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[3]->exercises->[17]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[3]->exercises->[17]->code
source: owner is ask "Is that Jack's capybara or Lucy's?" print 'It is owner'
ta: உரிமையாளர் கேட்கிறார் "அது சாக் கேபிபரா அல்லது லூசியின்?" 'இது உரிமையாளர்'

# workbooks->levels->[3]->exercises->[17]->answer
source: Incorrect. The word owner will be printed, not the value of the variable
ta: தவறானது. உரிமையாளர் என்ற சொல் அச்சிடப்படும், மாறியின் மதிப்பு அல்ல

# workbooks->levels->[3]->exercises->[18]->type
source: text
ta: உரை

# workbooks->levels->[3]->exercises->[18]->contents
source: #### Exercise 4: Write the code Look at the output and make up a fitting code.
ta: #### உடற்பயிற்சி 4: குறியீட்டை எழுதுங்கள் வெளியீட்டைப் பார்த்து, பொருத்தமான குறியீட்டை உருவாக்கவும்.

# workbooks->levels->[3]->exercises->[19]->type
source: input
ta: உள்ளீடு

# workbooks->levels->[3]->exercises->[19]->answer
source: print 'Welcome to bingo night' print 'Here comes the first number...!'
ta: அச்சிடுக 'பிங்கோ நைட்டுக்கு வருக' அச்சு 'இதோ முதல் எண் வருகிறது ...!'

# workbooks->levels->[3]->exercises->[19]->output
source: Welcome to bingo night! Here comes the first number...!
ta: பிங்கோ இரவுக்கு வருக! இங்கே முதல் எண் வருகிறது ...!

# workbooks->levels->[3]->exercises->[20]->type
source: input
ta: உள்ளீடு

# workbooks->levels->[3]->exercises->[20]->answer
source: print 'We are going to the movies tonight' film is ask 'What kind of film are you in for?'
ta: அச்சு 'நாங்கள் இன்றிரவு திரைப்படங்களுக்குச் செல்கிறோம்' 'நீங்கள் எந்த வகையான படத்தில் இருக்கிறீர்கள்?'

# workbooks->levels->[3]->exercises->[20]->output
source: We are going to the movies tonight What kind of film are you in for?
ta: நாங்கள் இன்று இரவு திரைப்படங்களுக்குச் செல்கிறோம் நீங்கள் எந்த வகையான படத்தில் இருக்கிறீர்கள்?

# workbooks->levels->[3]->exercises->[21]->type
source: text
ta: உரை

# workbooks->levels->[3]->exercises->[21]->contents
source: #### Exercise 5: Programming words We have learned some new programming words! Explain them in your own words.
ta: #### உடற்பயிற்சி 5: நிரலாக்க சொற்கள் சில புதிய நிரலாக்க சொற்களை நாங்கள் கற்றுக்கொண்டோம்! அவற்றை உங்கள் சொந்த வார்த்தைகளில் விளக்குங்கள்.

# workbooks->levels->[3]->exercises->[22]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[3]->exercises->[22]->word
source: quotation marks
ta: மேற்கோள் மதிப்பெண்கள்

# workbooks->levels->[3]->exercises->[22]->answer
source: Apostrophes that you use for printing or asking something.
ta: ஏதாவது அச்சிட அல்லது கேட்க நீங்கள் பயன்படுத்தும் அப்போச்ட்ரோப்கள்.

# workbooks->levels->[3]->exercises->[23]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[3]->exercises->[23]->word
source: how to use quotation marks in Hedy?
ta: எடியில் மேற்கோள் குறிகளை எவ்வாறு பயன்படுத்துவது?

# workbooks->levels->[3]->exercises->[23]->answer
source: You use quotation marks when you want to print the text to the screen literally
ta: உரையை திரையில் அச்சிட விரும்பும் போது மேற்கோள் குறிகளை நீங்கள் பயன்படுத்துகிறீர்கள்

# workbooks->levels->[3]->exercises->[24]->type
source: text
ta: உரை

# workbooks->levels->[3]->exercises->[24]->contents
source: #### Exercise 6: Commands We also have learned some new commands in level 4.
ta: #### உடற்பயிற்சி 6: கட்டளைகள் நிலை 4 இல் சில புதிய கட்டளைகளையும் கற்றுக்கொண்டோம்.

# workbooks->levels->[3]->exercises->[25]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[3]->exercises->[25]->word
source: the `clear` command
ta: `தெளிவான` கட்டளை

# workbooks->levels->[3]->exercises->[25]->answer
source: Empties the screen
ta: திரையை வெறுமை செய்கிறது

# workbooks->levels->[3]->exercises->[26]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[3]->exercises->[26]->word
source: the `color` command
ta: `வண்ணம்` கட்டளை

# workbooks->levels->[3]->exercises->[26]->answer
source: changes the color of the turtle
ta: ஆமை நிறத்தை மாற்றுகிறது

# workbooks->levels->[3]->exercises->[27]->type
source: text
ta: உரை

# workbooks->levels->[3]->exercises->[27]->contents
source: #### What do you think?
ta: #### நீங்கள் என்ன நினைக்கிறீர்கள்?

# workbooks->levels->[3]->exercises->[28]->type
source: question
ta: கேள்வி

# workbooks->levels->[3]->exercises->[28]->text
source: Which exercise did you like best this level?
ta: இந்த நிலைக்கு நீங்கள் எந்த உடற்பயிற்சியை விரும்பினீர்கள்?

# workbooks->levels->[3]->exercises->[29]->type
source: question
ta: கேள்வி

# workbooks->levels->[3]->exercises->[29]->text
source: What did you like about it?
ta: இதைப் பற்றி நீங்கள் என்ன விரும்பினீர்கள்?

# workbooks->levels->[3]->exercises->[30]->type
source: question
ta: கேள்வி

# workbooks->levels->[3]->exercises->[30]->text
source: Which exercise did you like least this level?
ta: இந்த நிலையை நீங்கள் எந்த உடற்பயிற்சியை விரும்பினீர்கள்?

# workbooks->levels->[3]->exercises->[31]->type
source: question
ta: கேள்வி

# workbooks->levels->[3]->exercises->[31]->text
source: What didn't you like about it?
ta: இதைப் பற்றி உங்களுக்கு என்ன பிடிக்கவில்லை?

# workbooks->levels->[4]->intro
source: ## if else By the end of this lesson, you can: * let the computer react to different input.
ta: ## வேறு என்றால் இந்த பாடத்தின் முடிவில், உங்களால் முடியும்: * கணினி வெவ்வேறு உள்ளீட்டிற்கு எதிர்வினையாற்றட்டும்.

# workbooks->levels->[4]->exercises->[0]->type
source: text
ta: உரை

# workbooks->levels->[4]->exercises->[0]->contents
source: ### Making choices Up until now Hedy would always run each and every line of code. From now on you can let it only run certain lines in certain cases, with an `if`. The code that follows behind the `if` is called a conditional. In this example the conditional is `friend is Yasmine`.
ta: ### தேர்வுகள் இப்போது வரை எடி எப்போதும் ஒவ்வொரு குறியீட்டையும் இயக்கும். இனிமேல் நீங்கள் `if` உடன் சில சந்தர்ப்பங்களில் சில வரிகளை மட்டுமே இயக்க அனுமதிக்க முடியும். `If` க்கு பின்னால் வரும் குறியீடு நிபந்தனைக்குட்பட்டது என்று அழைக்கப்படுகிறது. இந்த எடுத்துக்காட்டில் நிபந்தனை `நண்பர் யாச்மின்`.

# workbooks->levels->[4]->exercises->[0]->code
source: friend is ask "What's your name?" if friend is Yasmine print "Hi Yasmine!" else print "No, I didn't mean you!"
ta: நண்பர் "உங்கள் பெயர் என்ன?" நண்பர் என்றால் யாச்மின் அச்சு "ஆய் யாச்மின்!" வேறு "இல்லை, நான் உன்னை அர்த்தப்படுத்தவில்லை!"

# workbooks->levels->[4]->exercises->[1]->type
source: text
ta: உரை

# workbooks->levels->[4]->exercises->[1]->contents
source: #### Exercise 1: Mark the conditions What is a conditional? Mark the conditionals in the next programs!
ta: #### உடற்பயிற்சி 1: நிபந்தனைகளைக் குறிக்கவும் நிபந்தனை என்றால் என்ன? அடுத்த நிரல்களில் நிபந்தனைகளைக் குறிக்கவும்!

# workbooks->levels->[4]->exercises->[2]->type
source: circle
ta: வட்டம்

# workbooks->levels->[4]->exercises->[2]->goal
source: the conditional
ta: நிபந்தனை

# workbooks->levels->[4]->exercises->[2]->code
source: today is ask 'What day is it?' if today is friday print 'Yay' else print 'No'
ta: இன்று 'இது என்ன நாள்?' இன்று வெள்ளிக்கிழமை என்றால் 'ஆம்' என்ட் வேறு 'இல்லை'

# workbooks->levels->[4]->exercises->[2]->answer
source: today is friday
ta: இன்று வெள்ளிக்கிழமை

# workbooks->levels->[4]->exercises->[3]->type
source: circle
ta: வட்டம்

# workbooks->levels->[4]->exercises->[3]->goal
source: the conditional
ta: நிபந்தனை

# workbooks->levels->[4]->exercises->[3]->code
source: today is ask 'What day is today?' if today is saturday print 'No school today!' else print 'You have to go to school'
ta: இன்று 'இன்று என்ன நாள்?' இன்று காரிக்கிழமை என்றால் 'இன்று பள்ளி இல்லை!' 'நீங்கள் பள்ளிக்குச் செல்ல வேண்டும்'

# workbooks->levels->[4]->exercises->[3]->answer
source: today is saturday
ta: இன்று காரிக்கிழமை

# workbooks->levels->[4]->exercises->[4]->type
source: circle
ta: வட்டம்

# workbooks->levels->[4]->exercises->[4]->goal
source: the conditional
ta: நிபந்தனை

# workbooks->levels->[4]->exercises->[4]->code
source: age is ask 'How old are you?' if age is 16 print 'Perfecto' else print 'You are too young!'
ta: அகவை 'உங்களுக்கு எவ்வளவு வயது?' அகவை என்றால் 16 அச்சு 'பெர்பெக்டோ' 'நீங்கள் மிகவும் இளமையாக இருக்கிறீர்கள்!'

# workbooks->levels->[4]->exercises->[4]->answer
source: age is 16
ta: அகவை 16

# workbooks->levels->[4]->exercises->[5]->type
source: text
ta: உரை

# workbooks->levels->[4]->exercises->[5]->contents
source: #### Exercise 2: Mark the correct lines Which code will be ran? Mark only those parts. Pretend that today is friday and you are 12 years old.
ta: #### உடற்பயிற்சி 2: சரியான வரிகளைக் குறிக்கவும் எந்த குறியீடு இயக்கப்படும்? அந்த பகுதிகளை மட்டுமே குறிக்கவும். இன்று வெள்ளிக்கிழமை, உங்களுக்கு 12 அகவை என்று பாசாங்கு செய்யுங்கள்.

# workbooks->levels->[4]->exercises->[6]->type
source: circle
ta: வட்டம்

# workbooks->levels->[4]->exercises->[6]->goal
source: the code that will be **printed**
ta: ** அச்சிடப்பட்ட குறியீடு **

# workbooks->levels->[4]->exercises->[6]->code
source: today is ask 'What day is today?' if today is friday print 'Yay' else print 'No'
ta: இன்று 'இன்று என்ன நாள்?' இன்று வெள்ளிக்கிழமை என்றால் 'ஆம்' என்ட் வேறு 'இல்லை'

# workbooks->levels->[4]->exercises->[6]->answer
source: print 'Yay'
ta: 'ஆம்'

# workbooks->levels->[4]->exercises->[7]->type
source: circle
ta: வட்டம்

# workbooks->levels->[4]->exercises->[7]->goal
source: the code that will be **printed**
ta: ** அச்சிடப்பட்ட குறியீடு **

# workbooks->levels->[4]->exercises->[7]->code
source: today is ask 'What day is today?' if today is saturday print 'No school today!' else print 'You have to go to school'
ta: இன்று 'இன்று என்ன நாள்?' இன்று காரிக்கிழமை என்றால் 'இன்று பள்ளி இல்லை!' 'நீங்கள் பள்ளிக்குச் செல்ல வேண்டும்'

# workbooks->levels->[4]->exercises->[7]->answer
source: print 'You have to go to school'
ta: அச்சிடுக 'நீங்கள் பள்ளிக்கு செல்ல வேண்டும்'

# workbooks->levels->[4]->exercises->[8]->type
source: circle
ta: வட்டம்

# workbooks->levels->[4]->exercises->[8]->goal
source: the code that will be **printed**
ta: ** அச்சிடப்பட்ட குறியீடு **

# workbooks->levels->[4]->exercises->[8]->code
source: age is ask 'How old are you?' if age is 16 print 'Perfecto' else print 'You are too young!'
ta: அகவை 'உங்களுக்கு எவ்வளவு வயது?' அகவை என்றால் 16 அச்சு 'பெர்பெக்டோ' 'நீங்கள் மிகவும் இளமையாக இருக்கிறீர்கள்!'

# workbooks->levels->[4]->exercises->[8]->answer
source: print 'You are too young!'
ta: 'நீங்கள் மிகவும் இளமையாக இருக்கிறீர்கள்!'

# workbooks->levels->[4]->exercises->[9]->type
source: text
ta: உரை

# workbooks->levels->[4]->exercises->[9]->contents
source: #### Exercise 3: Error? Carefully read the programs! Which ones are correct?
ta: #### உடற்பயிற்சி 3: பிழை? நிரல்களை கவனமாக படியுங்கள்! எது சரியானது?

# workbooks->levels->[4]->exercises->[10]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[4]->exercises->[10]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[4]->exercises->[10]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[4]->exercises->[10]->code
source: age is ask 'How old are you?' if age is 16 print 'Right on!' else 'You are too young!'
ta: அகவை 'உங்களுக்கு எவ்வளவு வயது?' அகவை 16 என்றால் 'சரியானது!' வேறு 'நீங்கள் மிகவும் இளமையாக இருக்கிறீர்கள்!'

# workbooks->levels->[4]->exercises->[10]->answer
source: Incorrect. There is no `print` after `else`
ta: தவறானது. `வேறு` க்குப் பிறகு` அச்சு` இல்லை

# workbooks->levels->[4]->exercises->[11]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[4]->exercises->[11]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[4]->exercises->[11]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[4]->exercises->[11]->code
source: animal is ask 'What kind of animal is that?' if animal is llama print 'Bahhhhh'
ta: விலங்கு 'அது என்ன வகையான விலங்கு?' விலங்கு என்றால் லாமா அச்சு 'பஅ்அ்அ்'

# workbooks->levels->[4]->exercises->[11]->answer
source: Correct! You don't always need an `else`
ta: சரியானது! உங்களுக்கு எப்போதும் `வேறு` தேவையில்லை

# workbooks->levels->[4]->exercises->[12]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[4]->exercises->[12]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[4]->exercises->[12]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[4]->exercises->[12]->code
source: print "I'm so happy!"
ta: அச்சிடு "நான் மிகவும் மகிழ்ச்சியாக இருக்கிறேன்!"

# workbooks->levels->[4]->exercises->[12]->answer
source: Correct! You can use the apostrophe when using the double quotes.
ta: சரியானது! இரட்டை மேற்கோள்களைப் பயன்படுத்தும் போது நீங்கள் அப்போச்ட்ரோபியைப் பயன்படுத்தலாம்.

# workbooks->levels->[4]->exercises->[13]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[4]->exercises->[13]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[4]->exercises->[13]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[4]->exercises->[13]->code
source: if name Hedy print 'Programming is fun!'
ta: பெயர் எடி என்றால் அச்சு 'நிரலாக்கமானது வேடிக்கையானது!'

# workbooks->levels->[4]->exercises->[13]->answer
source: Incorrect. There needs to be an `is` in the frist line.
ta: தவறானது. முதல் வரியில் ஒரு `ஐஎச் 'இருக்க வேண்டும்.

# workbooks->levels->[4]->exercises->[14]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[4]->exercises->[14]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[4]->exercises->[14]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[4]->exercises->[14]->code
source: ask 'What school do you go to?' if school is LK print 'Yes!'
ta: 'நீங்கள் எந்த பள்ளிக்குச் செல்கிறீர்கள்?' பள்ளி என்றால் எல்.கே. அச்சு 'ஆம்!'

# workbooks->levels->[4]->exercises->[14]->answer
source: Incorrect. There is no variable in the first line.
ta: தவறானது. முதல் வரியில் எந்த மாறி இல்லை.

# workbooks->levels->[4]->exercises->[15]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[4]->exercises->[15]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[4]->exercises->[15]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[4]->exercises->[15]->code
source: amount is ask "how many capybaras are over there?" if amount is 5 print 'There are amount capybaras over there.'
ta: "எத்தனை கேபிபராச் அங்கேயே முடிந்துவிட்டது?" தொகை 5 அச்சு என்றால் 'அங்கே கேபிபராக்கள் உள்ளன.'

# workbooks->levels->[4]->exercises->[15]->answer
source: Incorrect. The variable amount will be printed as text.
ta: தவறானது. மாறி அளவு உரையாக அச்சிடப்படும்.

# workbooks->levels->[4]->exercises->[16]->type
source: text
ta: உரை

# workbooks->levels->[4]->exercises->[16]->contents
source: #### Exercise 4: Predict the output What will the output of these programs be? Please note! Sometimes `random` is used in a program. You can choose a random item yourself. This means multiple answers could be correct!
ta: #### உடற்பயிற்சி 4: வெளியீட்டைக் கணிக்கவும் இந்த நிரல்களின் வெளியீடு என்னவாக இருக்கும்? தயவுசெய்து கவனிக்கவும்! சில நேரங்களில் `சீரற்ற` ஒரு நிரலில் பயன்படுத்தப்படுகிறது. ஒரு சீரற்ற உருப்படியை நீங்களே தேர்வு செய்யலாம். இதன் பொருள் பல பதில்கள் சரியாக இருக்கலாம்!

# workbooks->levels->[4]->exercises->[17]->type
source: output
ta: வெளியீடு

# workbooks->levels->[4]->exercises->[17]->code
source: teachers is Hermans, Merbis, Bagci, Senkal teacher is teachers at random if teacher is Hermans print 'Hooray!'
ta: ஆசிரியர்கள் எர்மன்ச், மெர்பிச், பாக்சி, சென்கல் ஆசிரியர் சீரற்ற ஆசிரியர்கள் ஆசிரியர் என்றால் எர்மன்ச் 'ஊரே!'

# workbooks->levels->[4]->exercises->[17]->answer
source: Hooray! or no output
ta: ஊரே! அல்லது வெளியீடு இல்லை

# workbooks->levels->[4]->exercises->[18]->type
source: output
ta: வெளியீடு

# workbooks->levels->[4]->exercises->[18]->code
source: teachers is Hermans, Merbis, Bagci, Senkal teacher is teachers at random if teacher is Hermans print 'Too bad!' else print 'Hooray!'
ta: ஆசிரியர்கள் எர்மன்ச், மெர்பிச், பாக்சி, சென்கல் ஆசிரியர் சீரற்ற ஆசிரியர்கள் ஆசிரியர் எர்மன்ச் என்றால் 'மிகவும் மோசமானது!' வேறு 'ஊரே!'

# workbooks->levels->[4]->exercises->[18]->answer
source: Too bad! or Hooray!
ta: மிகவும் மோசமானது! அல்லது ஊரே!

# workbooks->levels->[4]->exercises->[19]->type
source: output
ta: வெளியீடு

# workbooks->levels->[4]->exercises->[19]->code
source: numbers is 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 print 'Welcome at bingo night!' number is numbers at random if number is 10 print 'I won!' else print 'Bummer'
ta: எண்கள் 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 அச்சிடுக 'பிங்கோ இரவில் வரவேற்கிறோம்!' எண் சீரற்ற எண்கள் எண் 10 அச்சு என்றால் 'நான் வென்றேன்!' 'பம்மர்'

# workbooks->levels->[4]->exercises->[19]->answer
source: Welcome to bingo night! I won! or Bummer
ta: பிங்கோ இரவுக்கு வருக! நான் வென்றேன்! அல்லது பம்மர்

# workbooks->levels->[4]->exercises->[20]->type
source: output
ta: வெளியீடு

# workbooks->levels->[4]->exercises->[20]->code
source: number is ask 'What is your favorite number?' if number is 10 print 'Mine too!'
ta: எண் 'உங்களுக்கு பிடித்த எண் எது?' எண் 10 ஆக இருந்தால் 'என்னுடையது கூட!'

# workbooks->levels->[4]->exercises->[20]->answer
source: Mine too! or no output
ta: என்னுடையது! அல்லது வெளியீடு இல்லை

# workbooks->levels->[4]->exercises->[21]->type
source: text
ta: உரை

# workbooks->levels->[4]->exercises->[21]->contents
source: #### Exercise 5: Programming words We have learned some new programming words this lesson! Explain them in your own words.
ta: #### உடற்பயிற்சி 5: நிரலாக்க சொற்கள் இந்த பாடம் சில புதிய நிரலாக்க சொற்களைக் கற்றுக்கொண்டோம்! அவற்றை உங்கள் சொந்த வார்த்தைகளில் விளக்குங்கள்.

# workbooks->levels->[4]->exercises->[22]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[4]->exercises->[22]->word
source: conditional
ta: நிபந்தனை

# workbooks->levels->[4]->exercises->[22]->answer
source: Something that is true or false. It follows behind the `if`.
ta: உண்மை அல்லது தவறான ஒன்று. இது `if` க்கு பின்னால் பின்வருமாறு.

# workbooks->levels->[4]->exercises->[23]->type
source: text
ta: உரை

# workbooks->levels->[4]->exercises->[23]->contents
source: #### Exercise 6: Commands We have also learned some new commands in level 5.
ta: #### உடற்பயிற்சி 6: கட்டளைகள் நிலை 5 இல் சில புதிய கட்டளைகளையும் கற்றுக்கொண்டோம்.

# workbooks->levels->[4]->exercises->[24]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[4]->exercises->[24]->word
source: the `if` command
ta: `if` கட்டளை

# workbooks->levels->[4]->exercises->[24]->answer
source: Decides which code will be run. If the conditional is true, the code behind it will be run.
ta: எந்த குறியீடு இயக்கப்படும் என்பதை தீர்மானிக்கிறது. நிபந்தனை உண்மையாக இருந்தால், அதன் பின்னால் உள்ள குறியீடு இயக்கப்படும்.

# workbooks->levels->[4]->exercises->[25]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[4]->exercises->[25]->word
source: the `else` command
ta: `வேறு` கட்டளை

# workbooks->levels->[4]->exercises->[25]->answer
source: Decides which code will be run. If the conditional is false, the code behind it will be run.
ta: எந்த குறியீடு இயக்கப்படும் என்பதை தீர்மானிக்கிறது. நிபந்தனை தவறானது என்றால், அதன் பின்னால் உள்ள குறியீடு இயக்கப்படும்.

# workbooks->levels->[4]->exercises->[26]->type
source: text
ta: உரை

# workbooks->levels->[4]->exercises->[26]->contents
source: #### What do you think?
ta: #### நீங்கள் என்ன நினைக்கிறீர்கள்?

# workbooks->levels->[4]->exercises->[27]->type
source: question
ta: கேள்வி

# workbooks->levels->[4]->exercises->[27]->text
source: Which exercise did you like best this level?
ta: இந்த நிலைக்கு நீங்கள் எந்த உடற்பயிற்சியை விரும்பினீர்கள்?

# workbooks->levels->[4]->exercises->[28]->type
source: question
ta: கேள்வி

# workbooks->levels->[4]->exercises->[28]->text
source: What did you like about it?
ta: இதைப் பற்றி நீங்கள் என்ன விரும்பினீர்கள்?

# workbooks->levels->[4]->exercises->[29]->type
source: question
ta: கேள்வி

# workbooks->levels->[4]->exercises->[29]->text
source: Which exercise did you like least this level?
ta: இந்த நிலையை நீங்கள் எந்த உடற்பயிற்சியை விரும்பினீர்கள்?

# workbooks->levels->[4]->exercises->[30]->type
source: question
ta: கேள்வி

# workbooks->levels->[4]->exercises->[30]->text
source: What didn't you like about it?
ta: இதைப் பற்றி உங்களுக்கு என்ன பிடிக்கவில்லை?
