Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-webpages-*.po
Languages: ta

# teacher-guide->[8]->levels->[8]->sections->[0]->example->error_code
source: {print} 'Robin is walking downtown' location = {ask} 'Is Robin going into a shop, or does she go home?' {if} location {is} shop {print} 'She enters the shop.' {print} 'Robin sees an interesting looking book' book = {ask} 'Does Robin buy the book?' {if} book {is} yes {print} 'Robin buys the book and goes home' {else} {print} 'Robin leaves the shop and goes home' {else} {print} 'Robin goes home'
ta: {print} 'ராபின் டவுன்டவுனில் நடந்து செல்கிறார்' இருப்பிடம் = {ask} 'ராபின் ஒரு கடைக்குச் செல்கிறாரா, அல்லது அவள் வீட்டிற்குச் செல்கிறாளா?' {if} இருப்பிடம் {is} கடை {print} 'அவள் கடைக்குள் நுழைகிறாள்.' {print} 'ராபின் ஒரு சுவையான தோற்றத்தை பார்க்கிறார்' நூல் = {ask} 'ராபின் புத்தகத்தை வாங்குகிறாரா?' {if} book {is} ஆம் {print} 'ராபின் புத்தகத்தை வாங்கி வீட்டிற்கு செல்கிறார்' {else} {print} 'ராபின் கடையை விட்டு வெளியேறி வீட்டிற்கு செல்கிறார்' {else} {print} 'ராபின் வீட்டிற்கு செல்கிறார்'

# teacher-guide->[8]->levels->[8]->sections->[0]->example->solution_text
source: This is the correct code. Try to keep track of all the different constructions when putting `{if}` statements inside other `{if}` statements.
ta: இது சரியான குறியீடு. `{If` அறிக்கைகளை மற்ற `{if}` அறிக்கைகளுக்குள் வைக்கும்போது அனைத்து வெவ்வேறு கட்டுமானங்களையும் கண்காணிக்க முயற்சிக்கவும்.

# teacher-guide->[8]->levels->[8]->sections->[0]->example->solution_code
source: {print} 'Robin is walking downtown' location = {ask} 'Is Robin going into a shop, or does she go home?' {if} location {is} shop {print} 'She enters the shop.' {print} 'Robin sees an interesting looking book' book = {ask} 'Does Robin buy the book?' {if} book {is} yes {print} 'Robin buys the book and goes home' {else} {print} 'Robin leaves the shop and goes home' {else} {print} 'Robin goes home'
ta: {print} 'ராபின் டவுன்டவுனில் நடந்து செல்கிறார்' இருப்பிடம் = {ask} 'ராபின் ஒரு கடைக்குச் செல்கிறாரா, அல்லது அவள் வீட்டிற்குச் செல்கிறாளா?' {if} இருப்பிடம் {is} கடை {print} 'அவள் கடைக்குள் நுழைகிறாள்.' {print} 'ராபின் ஒரு சுவையான தோற்றத்தை பார்க்கிறார்' நூல் = {ask} 'ராபின் புத்தகத்தை வாங்குகிறாரா?' {if} book {is} ஆம் {print} 'ராபின் புத்தகத்தை வாங்கி வீட்டிற்கு செல்கிறார்' {else} {print} 'ராபின் கடையை விட்டு வெளியேறி வீட்டிற்கு செல்கிறார்' {else} {print} 'ராபின் வீட்டிற்கு செல்கிறார்'

# teacher-guide->[8]->levels->[9]->sections->[0]->title
source: Students do not use the `{for}` command correctly
ta: மாணவர்கள் `{for` கட்டளையை சரியாகப் பயன்படுத்துவதில்லை

# teacher-guide->[8]->levels->[9]->sections->[0]->example->error_text
source: We often see that students try to print the list (in the example animals) instead of the items of the list.
ta: பட்டியலின் உருப்படிகளுக்கு பதிலாக மாணவர்கள் பட்டியலை (எடுத்துக்காட்டு விலங்குகளில்) அச்சிட முயற்சிப்பதை நாங்கள் அடிக்கடி காண்கிறோம்.

# teacher-guide->[8]->levels->[9]->sections->[0]->example->error_code
source: animals {is} dog, cat, blobfish {for} animal {in} animals {print} 'I love ' animals
ta: விலங்குகள் {is} நாய், பூனை, குமிழி }} விலங்குகளில்} விலங்குகளில் {for} 'நான் நேசிக்கிறேன்' விலங்குகள்

# teacher-guide->[8]->levels->[9]->sections->[0]->example->solution_text
source: The word animals in the last line should be changed into animal.
ta: கடைசி வரியில் உள்ள விலங்குகள் என்ற சொல் விலங்குகளாக மாற்றப்பட வேண்டும்.

# teacher-guide->[8]->levels->[9]->sections->[0]->example->solution_code
source: animals {is} dog, cat, blobfish {for} animal {in} animals {print} 'I love ' animal
ta: விலங்குகள் {is} நாய், பூனை, குமிழி }} விலங்குகளில்} விலங்குகளில் {for} 'நான் நேசிக்கிறேன்' விலங்கு

# teacher-guide->[8]->levels->[9]->sections->[1]->title
source: Students forget the indentation
ta: மாணவர்கள் உள்தள்ளலை மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[9]->sections->[1]->example->error_text
source: Students tend to forget to use indentation after a for command.
ta: ஒரு கட்டளைக்குப் பிறகு உள்தள்ளலைப் பயன்படுத்த மாணவர்கள் மறந்துவிடுகிறார்கள்.

# teacher-guide->[8]->levels->[9]->sections->[1]->example->error_code
source: animals {is} dog, cat, blobfish {for} animal {in} animals {print} 'I love ' animals
ta: விலங்குகள் {is} நாய், பூனை, குமிழி }} விலங்குகளில்} விலங்குகளில் {for} 'நான் நேசிக்கிறேன்' விலங்குகள்

# teacher-guide->[8]->levels->[9]->sections->[1]->example->solution_text
source: You should use indentation after a for command.
ta: ஒரு கட்டளைக்குப் பிறகு நீங்கள் உள்தள்ளலைப் பயன்படுத்த வேண்டும்.

# teacher-guide->[8]->levels->[9]->sections->[1]->example->solution_code
source: animals {is} dog, cat, blobfish {for} animal {in} animals {print} 'I love ' animal
ta: விலங்குகள் {is} நாய், பூனை, குமிழி }} விலங்குகளில்} விலங்குகளில் {for} 'நான் நேசிக்கிறேன்' விலங்கு

# teacher-guide->[8]->levels->[10]->sections->[0]->title
source: Students forget to use indentation
ta: மாணவர்கள் உள்தள்ளலைப் பயன்படுத்த மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[10]->sections->[0]->example->error_text
source: Make sure that the students use indentation.
ta: மாணவர்கள் உள்தள்ளலைப் பயன்படுத்துகிறார்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# teacher-guide->[8]->levels->[10]->sections->[0]->example->error_code
source: {for} i {in} {range} 1 {to} 5 {print} i
ta: {for} i {in} {range} 1 {to} 5 வரை {print} i

# teacher-guide->[8]->levels->[10]->sections->[0]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[10]->sections->[0]->example->solution_code
source: {for} i {in} {range} 1 {to} 5 {print} i
ta: {for} i {in} {range} 1 {to} 5 வரை {print} i

# teacher-guide->[8]->levels->[10]->sections->[1]->title
source: Students don't understand the i
ta: மாணவர்களுக்கு நான் புரியவில்லை

# teacher-guide->[8]->levels->[10]->sections->[1]->example->error_text
source: Some students don't understand that i is a variable. i is chosen, because it is used in Python programming, but you could just as easily use a different variable name. For example, this code:
ta: நான் ஒரு மாறி என்று சில மாணவர்களுக்கு புரியவில்லை. நான் தேர்ந்தெடுக்கப்பட்டேன், ஏனென்றால் இது பைதான் நிரலாக்கத்தில் பயன்படுத்தப்படுகிறது, ஆனால் நீங்கள் வேறு மாறி பெயரைப் பயன்படுத்தலாம். எடுத்துக்காட்டாக, இந்த குறியீடு:

# teacher-guide->[8]->levels->[10]->sections->[1]->example->error_code
source: {for} i {in} {range} 1 {to} 5 {print} i
ta: {for} i {in} {range} 1 {to} 5 வரை {print} i

# teacher-guide->[8]->levels->[10]->sections->[1]->example->solution_text
source: Could just as well be replaced with this code. It works the same.
ta: இந்த குறியீட்டால் மாற்றப்படலாம். அது அதே வேலை செய்கிறது.

# teacher-guide->[8]->levels->[10]->sections->[1]->example->solution_code
source: {for} banana {in} {range} 1 {to} 5 {print} banana
ta: }} வாழை {for} {in} 1 {range} 5 வரை {to} வாழைப்பழம்

# teacher-guide->[8]->levels->[11]->sections->[0]->title
source: Students forget quotation marks
ta: மேற்கோள் மதிப்பெண்களை மாணவர்கள் மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[11]->sections->[0]->example->error_text
source: Students need more quotation marks now than in the previous levels. In this example quotation marks were forgotten in the list and in the `{if}` command.
ta: முந்தைய நிலைகளை விட மாணவர்களுக்கு இப்போது மேற்கோள் மதிப்பெண்கள் தேவை. இந்த எடுத்துக்காட்டில் மேற்கோள் மதிப்பெண்கள் பட்டியலிலும் `{if}` கட்டளையிலும் மறக்கப்பட்டன.

# teacher-guide->[8]->levels->[11]->sections->[0]->example->error_code
source: superheroes = Spiderman, Batman, Iron Man superhero = superheroes {at} {random} {if} superhero = Batman {print} 'IM BATMAN!'
ta: சூப்பர் ஈரோக்கள் = ச்பைடர்மேன், பேட்மேன், அயர்ன் மேன் சூப்பர் ஈரோ = சூப்பர் ஈரோக்கள் {at} {random} {if} சூப்பர் ஈரோ = பேட்மேன் {print} 'im batman!'

# teacher-guide->[8]->levels->[11]->sections->[0]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[11]->sections->[0]->example->solution_code
source: superheroes = 'Spiderman', 'Batman', 'Iron Man' superhero = superheroes {at} {random} {if} superhero {is} 'Batman' {print} 'IM BATMAN!'
ta: சூப்பர் ஈரோக்கள் = 'ச்பைடர்மேன்', 'பேட்மேன்', 'அயர்ன் மேன்' சூப்பர் ஈரோ = சூப்பர் ஈரோக்கள் {at} {random} } if} சூப்பர் ஈரோ {if} 'பேட்மேன்' {is} 'im batman!'

# teacher-guide->[8]->levels->[11]->sections->[1]->title
source: Students use quotation marks on numbers they want to use for calculations
ta: கணக்கீடுகளுக்கு பயன்படுத்த விரும்பும் எண்களில் மாணவர்கள் மேற்கோள் குறிகளை பயன்படுத்துகின்றனர்

# teacher-guide->[8]->levels->[11]->sections->[1]->example->error_text
source: You can use quotation marks on numbers, but only if you want the computer to think of them as text. This means you can't do calculations with the number. In the example below, you can't do maths with the number 25, because it's in quotation marks.
ta: எண்களில் மேற்கோள் குறிகளை நீங்கள் பயன்படுத்தலாம், ஆனால் கணினி அவற்றை உரையாக நினைக்க விரும்பினால் மட்டுமே. இதன் பொருள் நீங்கள் எண்ணுடன் கணக்கீடுகளைச் செய்ய முடியாது. கீழேயுள்ள எடுத்துக்காட்டில், நீங்கள் 25 வது எண்ணுடன் கணிதத்தை செய்ய முடியாது, ஏனெனில் இது மேற்கோள் மதிப்பெண்களில் உள்ளது.

# teacher-guide->[8]->levels->[11]->sections->[1]->example->error_code
source: score = '25' answer {is} {ask} 'Do you want a point?' {if} answer {is} 'yes' score = score + 1 {print} score
ta: ச்கோர் = '25' பதில் {is {{ask} 'உங்களுக்கு ஒரு புள்ளி வேண்டுமா?' } என்றால்} பதில் {is} 'ஆம்' மதிப்பெண் = மதிப்பெண் + 1 {if} மதிப்பெண்

# teacher-guide->[8]->levels->[11]->sections->[1]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[11]->sections->[1]->example->solution_code
source: score = 25 answer {is} {ask} 'Do you want a point?' {if} answer {is} 'yes' score = score + 1 {print} score
ta: மதிப்பெண் = 25 பதில் {is {{ask} 'உங்களுக்கு ஒரு புள்ளி வேண்டுமா?' } என்றால்} பதில் {is} 'ஆம்' மதிப்பெண் = மதிப்பெண் + 1 {if} மதிப்பெண்

# teacher-guide->[8]->levels->[11]->sections->[2]->title
source: Students use commas instead of periods in decimal numbers
ta: மாணவர்கள் தசம எண்களில் உள்ள காலங்களுக்கு பதிலாக காற்புள்ளிகளைப் பயன்படுத்துகிறார்கள்

# teacher-guide->[8]->levels->[11]->sections->[2]->example->error_text
source: Decimal numbers can be used from this level on, but you can't use commas.
ta: இந்த மட்டத்திலிருந்து தசம எண்களைப் பயன்படுத்தலாம், ஆனால் நீங்கள் காற்புள்ளிகளைப் பயன்படுத்த முடியாது.

# teacher-guide->[8]->levels->[11]->sections->[2]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[12]->sections->[0]->title
source: Students confuse `{and}` with `{or}`
ta: மாணவர்கள் `{and}` `{or}` உடன் குழப்புகிறார்கள்

# teacher-guide->[8]->levels->[12]->sections->[0]->example->error_text
source: Both commands might appear similar, but their functions are very different.
ta: இரண்டு கட்டளைகளும் ஒத்ததாகத் தோன்றலாம், ஆனால் அவற்றின் செயல்பாடுகள் மிகவும் வேறுபட்டவை.

# teacher-guide->[8]->levels->[12]->sections->[0]->example->error_code
source: game {is} {ask} 'Do you want to play a game?' time {is} {ask} 'Do you have time to play?' {if} game {is} 'yes' {or} time {is} 'yes' {print} 'Lets play!'
ta: விளையாட்டு {{{ask} 'நீங்கள் ஒரு விளையாட்டை விளையாட விரும்புகிறீர்களா?' நேரம் {{{ask} 'உங்களுக்கு விளையாட நேரம் இருக்கிறதா?' {is} விளையாட்டு {is} 'ஆம்' {if} நேரம் {is 'ஆம்' {is} 'விளையாட அனுமதிக்கிறது!'

# teacher-guide->[8]->levels->[12]->sections->[0]->example->solution_text
source: In this case, the person should answer yes on both questions, so you should use `and`.
ta: இந்த வழக்கில், நபர் இரண்டு கேள்விகளிலும் ஆம் என்று பதிலளிக்க வேண்டும், எனவே நீங்கள் `மற்றும்` ஐப் பயன்படுத்த வேண்டும்.

# teacher-guide->[8]->levels->[12]->sections->[0]->example->solution_code
source: game {is} {ask} 'Do you want to play a game?' time {is} {ask} 'Do you have time to play?' {if} game {is} 'yes' {and} time {is} 'yes' {print} 'Lets play!'
ta: விளையாட்டு {{{ask} 'நீங்கள் ஒரு விளையாட்டை விளையாட விரும்புகிறீர்களா?' நேரம் {{{ask} 'உங்களுக்கு விளையாட நேரம் இருக்கிறதா?' {is} விளையாட்டு {is} 'ஆம்' {if} நேரம் {is} 'ஆம்' {and} 'விளையாட அனுமதிக்கிறது!'

# teacher-guide->[8]->levels->[13]->sections->[0]->title
source: Students confuse the < and > signs
ta: மாணவர்கள் <மற்றும்> அறிகுறிகளைக் குழப்புகிறார்கள்

# teacher-guide->[8]->levels->[13]->sections->[0]->example->error_text
source: Often, students are already familiar with these signs from maths class. But if your students don't know these signs yet, they might have a challenge with it.
ta: பெரும்பாலும், கணித வகுப்பிலிருந்து இந்த அறிகுறிகளை மாணவர்கள் ஏற்கனவே அறிந்திருக்கிறார்கள். ஆனால் உங்கள் மாணவர்களுக்கு இந்த அறிகுறிகள் இன்னும் தெரியாவிட்டால், அவர்களுக்கு ஒரு அறைகூவல் இருக்கலாம்.

# teacher-guide->[8]->levels->[13]->sections->[0]->example->error_code
source: age = {ask} 'How old are you?' {if} age < 12 {print} 'You are older than I am!'
ta: அகவை = {ask} 'உங்களுக்கு எவ்வளவு வயது?' {if} அகவை <12 {print} 'நீங்கள் என்னை விட வயதானவர்!'

# teacher-guide->[8]->levels->[13]->sections->[0]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[13]->sections->[0]->example->solution_code
source: age = {ask} 'How old are you?' {if} age > 12 {print} 'You are older than I am!'
ta: அகவை = {ask} 'உங்களுக்கு எவ்வளவு வயது?' } என்றால்} வயது> 12 {if} 'நீங்கள் என்னை விட வயதானவர்!'

# teacher-guide->[8]->levels->[13]->sections->[1]->title
source: Students use the wrong signs for `!=` `<=` and `>=`
ta: மாணவர்கள் தவறான அறிகுறிகளை `! =` `<=` மற்றும் `> =`

# teacher-guide->[8]->levels->[13]->sections->[1]->example->error_text
source: These signs are probably new for most students. Make sure to explain these signs to your students.
ta: இந்த அறிகுறிகள் பெரும்பாலான மாணவர்களுக்கு புதியவை. இந்த அறிகுறிகளை உங்கள் மாணவர்களுக்கு விளக்குவதை உறுதிசெய்க.

# teacher-guide->[8]->levels->[13]->sections->[1]->example->error_code
source: name = {ask} 'What is your name?' {if} name = 'Hedy' {print} 'You are not Hedy'
ta: பெயர் = {ask} 'உங்கள் பெயர் என்ன?' } if} பெயர் = 'hedy' {if} 'நீங்கள் எடி இல்லை'

# teacher-guide->[8]->levels->[13]->sections->[1]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[13]->sections->[1]->example->solution_code
source: name = {ask} 'What is your name?' {if} name != 'Hedy' {print} 'You are not Hedy'
ta: பெயர் = {ask} 'உங்கள் பெயர் என்ன?' {if} பெயர்! = 'எடி' {print} 'நீங்கள் எடி இல்லை'

# teacher-guide->[8]->levels->[13]->sections->[2]->title
source: Students forget to use the == sign
ta: மாணவர்கள் == அடையாளத்தைப் பயன்படுத்த மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[13]->sections->[2]->example->error_text
source: In this level, students are still allowed to use = or is. But on other levels, or in python, they might get in trouble for that. So it is best to train them to use it.
ta: இந்த மட்டத்தில், மாணவர்கள் இன்னும் = அல்லது IS ஐப் பயன்படுத்த அனுமதிக்கப்படுகிறார்கள். ஆனால் மற்ற நிலைகளில், அல்லது பைத்தானில், அவர்கள் அதற்காக சிக்கலில் சிக்கக்கூடும். எனவே அதைப் பயன்படுத்த அவர்களுக்கு பயிற்சி அளிப்பது நல்லது.

# teacher-guide->[8]->levels->[13]->sections->[2]->example->error_code
source: name = {ask} 'What is your name?' {if} name = 'Hedy' {print} 'You are cool!'
ta: பெயர் = {ask} 'உங்கள் பெயர் என்ன?' } if} பெயர் = 'hedy' {if} 'நீங்கள் குளிர்ச்சியாக இருக்கிறீர்கள்!'

# teacher-guide->[8]->levels->[13]->sections->[2]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[13]->sections->[2]->example->solution_code
source: name = {ask} 'What is your name?' {if} name == 'Hedy' {print} 'You are cool!'
ta: பெயர் = {ask} 'உங்கள் பெயர் என்ன?' {if} பெயர் == 'hedy' {print} 'நீங்கள் குளிர்ச்சியாக இருக்கிறீர்கள்!'

# teacher-guide->[8]->levels->[14]->sections->[0]->title
source: Students forget indentation in the while loop
ta: மாணவர்கள் உள்தள்ளலை மறந்துவிடுகிறார்கள்

# teacher-guide->[8]->levels->[14]->sections->[0]->example->error_text
source: Indentation is often hard for students.
ta: உள்தள்ளல் பெரும்பாலும் மாணவர்களுக்கு கடினம்.

# teacher-guide->[8]->levels->[14]->sections->[0]->example->error_code
source: answer = 0 {while} answer != 25 answer = {ask} 'What is 5 times 5?' {print} 'A correct answer has been given'
ta: பதில் = 0 } போது} பதில்! = 25 பதில் = {while} '5 முறை 5 என்ன?' {ask} 'சரியான பதில் வழங்கப்பட்டுள்ளது'

# teacher-guide->[8]->levels->[14]->sections->[0]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[14]->sections->[0]->example->solution_code
source: answer = 0 {while} answer != 25 answer = {ask} 'What is 5 times 5?' {print} 'A correct answer has been given'
ta: பதில் = 0 } போது} பதில்! = 25 பதில் = {while} '5 முறை 5 என்ன?' {ask} 'சரியான பதில் வழங்கப்பட்டுள்ளது'

# teacher-guide->[8]->levels->[15]->sections->[0]->title
source: Students forget the brackets
ta: மாணவர்கள் அடைப்புக்குறிகளை மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[15]->sections->[0]->example->error_text
source: From this level on lists should be in brackets.
ta: பட்டியல்களில் இந்த மட்டத்திலிருந்து அடைப்புக்குறிக்குள் இருக்க வேண்டும்.

# teacher-guide->[8]->levels->[15]->sections->[0]->example->error_code
source: icecream = 'starwberry', 'chocolate' {print} 'I love ' icecream[{random}] ' icecream'
ta: ஐச்கிரீம் = 'ச்ட்ராபெரி', 'சாக்லேட்' {print} 'ஐ லவ்' ஐச்கிரீம் [{random}] 'ஐச்கிரீம்'

# teacher-guide->[8]->levels->[15]->sections->[0]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[15]->sections->[0]->example->solution_code
source: icecream = ['starwberry', 'chocolate'] {print} 'I love ' icecream[{random}] ' icecream'
ta: ஐச்கிரீம் = ['ச்ட்ராபெரி', 'சாக்லேட்'] {print} 'ஐ லவ்' ஐச்கிரீம் [{random}] 'ஐச்கிரீம்'

# teacher-guide->[8]->levels->[15]->sections->[1]->title
source: Students use the wrong brackets
ta: மாணவர்கள் தவறான அடைப்புக்குறிகளைப் பயன்படுத்துகிறார்கள்

# teacher-guide->[8]->levels->[15]->sections->[1]->example->error_text
source: From this level on lists should be in brackets.
ta: பட்டியல்களில் இந்த மட்டத்திலிருந்து அடைப்புக்குறிக்குள் இருக்க வேண்டும்.

# teacher-guide->[8]->levels->[15]->sections->[1]->example->error_code
source: icecream = ('starwberry', 'chocolate') {print} 'I love ' icecream[{random}] ' icecream'
ta: ஐச்கிரீம் = ('ச்ட்ராபெரி', 'சாக்லேட்') {print} 'ஐ லவ்' ஐச்கிரீம் [{random}] 'ஐச்கிரீம்'

# teacher-guide->[8]->levels->[15]->sections->[1]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[15]->sections->[1]->example->solution_code
source: icecream = ['starwberry', 'chocolate'] {print} 'I love ' icecream[{random}] ' icecream'
ta: ஐச்கிரீம் = ['ச்ட்ராபெரி', 'சாக்லேட்'] {print} 'ஐ லவ்' ஐச்கிரீம் [{random}] 'ஐச்கிரீம்'

# teacher-guide->[8]->levels->[15]->sections->[2]->title
source: Students forget the quotation marks while focussing on the brackets
ta: அடைப்புக்குறிக்குள் கவனம் செலுத்தும்போது மாணவர்கள் மேற்கோள் மதிப்பெண்களை மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[15]->sections->[2]->example->error_text
source: Students are sometimes very focussed on the new aspect of the syntax, that they forget the quotation marks.
ta: மேற்கோள் மதிப்பெண்களை மறந்துவிடுமாறு மாணவர்கள் சில நேரங்களில் தொடரியல் புதிய அம்சத்தில் மிகவும் கவனம் செலுத்துகிறார்கள்.

# teacher-guide->[8]->levels->[15]->sections->[2]->example->error_code
source: icecream = [starwberry, chocolate] {print} 'I love ' icecream[{random}] ' icecream'
ta: ஐச்கிரீம் = [ச்ட்ராபெரி, சாக்லேட்] {print} 'ஐ லவ்' ஐச்கிரீம் [{random}] 'ஐச்கிரீம்'

# teacher-guide->[8]->levels->[15]->sections->[2]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[15]->sections->[2]->example->solution_code
source: icecream = ['starwberry', 'chocolate'] {print} 'I love ' icecream[{random}] ' icecream'
ta: ஐச்கிரீம் = ['ச்ட்ராபெரி', 'சாக்லேட்'] {print} 'ஐ லவ்' ஐச்கிரீம் [{random}] 'ஐச்கிரீம்'

# teacher-guide->[8]->levels->[15]->sections->[3]->title
source: Students still use the old at random command
ta: மாணவர்கள் இன்னும் பழையதை சீரற்ற கட்டளையைப் பயன்படுத்துகிறார்கள்

# teacher-guide->[8]->levels->[15]->sections->[3]->example->error_text
source: Students are sometimes very focussed on the new aspect of the syntax, that they forget the quotation marks.
ta: மேற்கோள் மதிப்பெண்களை மறந்துவிடுமாறு மாணவர்கள் சில நேரங்களில் தொடரியல் புதிய அம்சத்தில் மிகவும் கவனம் செலுத்துகிறார்கள்.

# teacher-guide->[8]->levels->[15]->sections->[3]->example->error_code
source: icecream = [starwberry, chocolate] {print} 'I love ' icecream at random ' icecream'
ta: ஐச்கிரீம் = [ச்ட்ராபெரி, சாக்லேட்] {print} 'ஐ லவ்' ஐச்கிரீமை சீரற்ற 'ஐச்கிரீம்'

# teacher-guide->[8]->levels->[15]->sections->[3]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[15]->sections->[3]->example->solution_code
source: icecream = ['starwberry', 'chocolate'] {print} 'I love ' icecream[{random}] ' icecream'
ta: ஐச்கிரீம் = ['ச்ட்ராபெரி', 'சாக்லேட்'] {print} 'ஐ லவ்' ஐச்கிரீம் [{random}] 'ஐச்கிரீம்'

# teacher-guide->[8]->levels->[15]->sections->[4]->title
source: Students forget the quotation marks while focussing on the brackets
ta: அடைப்புக்குறிக்குள் கவனம் செலுத்தும்போது மாணவர்கள் மேற்கோள் மதிப்பெண்களை மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[15]->sections->[4]->example->error_text
source: Students are sometimes very focussed on the new aspect of the syntax, that they forget the quotation marks.
ta: மேற்கோள் மதிப்பெண்களை மறந்துவிடுமாறு மாணவர்கள் சில நேரங்களில் தொடரியல் புதிய அம்சத்தில் மிகவும் கவனம் செலுத்துகிறார்கள்.

# teacher-guide->[8]->levels->[15]->sections->[4]->example->error_code
source: icecream = [starwberry, chocolate] {print} 'I love ' icecream[{random}] ' icecream'
ta: ஐச்கிரீம் = [ச்ட்ராபெரி, சாக்லேட்] {print} 'ஐ லவ்' ஐச்கிரீம் [{random}] 'ஐச்கிரீம்'

# teacher-guide->[8]->levels->[15]->sections->[4]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[15]->sections->[4]->example->solution_code
source: icecream = ['starwberry', 'chocolate'] {print} 'I love ' icecream[{random}] ' icecream'
ta: ஐச்கிரீம் = ['ச்ட்ராபெரி', 'சாக்லேட்'] {print} 'ஐ லவ்' ஐச்கிரீம் [{random}] 'ஐச்கிரீம்'

# teacher-guide->[8]->levels->[16]->sections->[0]->title
source: Students use `{elif}` like `{else}`, so without a condition
ta: மாணவர்கள் `{elif}` போன்ற `{else}` ஐப் பயன்படுத்துகிறார்கள், எனவே ஒரு நிபந்தனை இல்லாமல்

# teacher-guide->[8]->levels->[16]->sections->[0]->example->error_text
source: The `{elif}` command needs a condition behind it. It cannot be used like `{else}`, without a condition.
ta: `{elif}` கட்டளைக்கு பின்னால் ஒரு நிபந்தனை தேவை. நிபந்தனை இல்லாமல் `{else}` போல இதைப் பயன்படுத்த முடியாது.

# teacher-guide->[8]->levels->[16]->sections->[0]->example->error_code
source: color = ask 'What is your favorite color?' {if} color == 'green': {print} 'green is nice' {elif}: {print} 'I like green'
ta: color = கேளுங்கள் 'உங்களுக்கு பிடித்த நிறம் என்ன?' {if} color == 'பச்சை': {print} 'பச்சை நன்றாக இருக்கிறது' {elif}: {print} 'எனக்கு பச்சை பிடிக்கும்'

# teacher-guide->[8]->levels->[16]->sections->[0]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[16]->sections->[0]->example->solution_code
source: color = {ask} 'What is your favorite color?' {if} color == 'green': {print} 'green is nice' {elif} color == yellow: {print} 'yellow is alright' {else}: {print} 'I like green'
ta: color = {ask} 'உங்களுக்கு பிடித்த நிறம் என்ன?' {if} color == 'பச்சை': {print} 'பச்சை நன்றாக இருக்கிறது' {elif} color == மஞ்சள்: {print} 'மஞ்சள் சரி' {else}: {print} 'எனக்கு பச்சை பிடிக்கும்'

# teacher-guide->[8]->levels->[16]->sections->[1]->title
source: Students forget the colon
ta: மாணவர்கள் பெருங்குடலை மறந்து விடுகிறார்கள்
