Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-webpages-*.po
Languages: ta

# teacher-guide->[0]->subsections->[0]->text
source: Hedy is a textual programming language, specifically developed for (pre-)teens (10 to 15 years old). In contrast to programming languages for kids, like Scratch, Hedy doesn't use code blocks but textual code. So with Hedy you'll learn how to type code like the real programmers do, but in small steps with playful exercises. This way Hedy can function as a stepping stone to real programming languages like Python in an accessible and mostly fun way! If you want to know more, you can watch this <a href="https://www.youtube.com/watch?v=EdqT313rM40&amp;t=2s" target="_blank">video</a> about the development of Hedy as a programming language.
ta: எடி ஒரு உரை நிரலாக்க மொழியாகும், இது குறிப்பாக (முன்) பதின்ம வயதினருக்காக (10 முதல் 15 அகவை வரை) உருவாக்கப்பட்டது. குழந்தைகளுக்கான நிரலாக்க மொழிகளுக்கு மாறாக, கீறல் போன்றவை, எடி குறியீடு தொகுதிகள் ஆனால் உரை குறியீட்டைப் பயன்படுத்தாது. எனவே எடி மூலம் உண்மையான புரோகிராமர்களைப் போல குறியீட்டை எவ்வாறு தட்டச்சு செய்வது என்பதைக் கற்றுக்கொள்வீர்கள், ஆனால் சிறிய படிகளில் விளையாட்டுத்தனமான பயிற்சிகளுடன். இந்த வழியில் எடி அணுகக்கூடிய மற்றும் பெரும்பாலும் வேடிக்கையான வழியில் பைதான் போன்ற உண்மையான நிரலாக்க மொழிகளுக்கு ஒரு படிப்படியாக செயல்பட முடியும்! நீங்கள் மேலும் அறிய விரும்பினால், இதை <a href = "https://www.youtube.com/watch?v=edqt313rm40&amp; ஒரு நிரலாக்க மொழியாக எடி.

# teacher-guide->[0]->subsections->[1]->title
source: Target audience
ta: இலக்கு பார்வையாளர்கள்

# teacher-guide->[0]->subsections->[1]->text
source: Hedy is developed with middle school and junior high school students in mind (ages 10 - 15). It's important for the students to be able to read well. We recommend not to start with Hedy before the students have achieved at least a 3rd grade reading level. Students (and teachers!) don't need any programming experience before starting with Hedy.
ta: நடுத்தர பள்ளி மற்றும் சூனியர் உயர்நிலைப் பள்ளி மாணவர்களை மனதில் (வயது 10 - 15) எடி உருவாக்கப்படுகிறது. மாணவர்கள் நன்றாகப் படிக்க முடியும் என்பது முதன்மை. மாணவர்கள் குறைந்தது 3 ஆம் வகுப்பு வாசிப்பு நிலையை அடைவதற்கு முன்பு எடியுடன் தொடங்க வேண்டாம் என்று நாங்கள் பரிந்துரைக்கிறோம். எடியுடன் தொடங்குவதற்கு முன் மாணவர்களுக்கு (மற்றும் ஆசிரியர்கள்!) எந்த நிரலாக்க அனுபவமும் தேவையில்லை.

# teacher-guide->[0]->subsections->[2]->title
source: How does Hedy work?
ta: எடி எவ்வாறு செயல்படுகிறது?

# teacher-guide->[0]->subsections->[2]->text
source: Hedy is divided into levels, in which new commands are taught. Each level contains a variety of adventures to practice the newly learned commands. As a teacher, you get to decide which adventures are available for your students. Will they be making a restaurant, a calculator or a haunted house this level? Within each level, the adventures are arranged from easiest to hardest. So your students keep getting challenged. The adventures can be done by the students individually, or you can use them in a classical instruction. The adventures also include a code example, to make sure the less digitally informed teachers are able to use Hedy too! Of course Hedy also caters to the creative teachers that love to make their own lessonplans and adventures! After programming all the adventures of a certain level, your students can test their knowledge in the quiz. You can track your students' work and their progress on the class page.
ta: எடி நிலைகளாக பிரிக்கப்பட்டுள்ளது, இதில் புதிய கட்டளைகள் கற்பிக்கப்படுகின்றன. ஒவ்வொரு மட்டத்திலும் புதிதாகக் கற்றுக்கொண்ட கட்டளைகளைப் பயிற்சி செய்ய பலவிதமான சாகசங்கள் உள்ளன. ஒரு ஆசிரியராக, உங்கள் மாணவர்களுக்கு எந்த சாகசங்கள் உள்ளன என்பதை நீங்கள் தீர்மானிக்க வேண்டும். அவர்கள் இந்த மட்டத்தில் ஒரு உணவகம், ஒரு கால்குலேட்டர் அல்லது பேய் வீட்டை உருவாக்குவார்களா? ஒவ்வொரு மட்டத்திலும், சாகசங்கள் எளிதான முதல் கடினமான வரை ஏற்பாடு செய்யப்பட்டுள்ளன. எனவே உங்கள் மாணவர்கள் அறைகூவல் விடுகிறார்கள். சாகசங்களை மாணவர்களால் தனித்தனியாகச் செய்யலாம், அல்லது அவற்றை ஒரு பாரம்பரிய அறிவுறுத்தலில் பயன்படுத்தலாம். டிசிட்டல் முறையில் தகவலறிந்த ஆசிரியர்கள் எடியையும் பயன்படுத்த முடியும் என்பதை உறுதிப்படுத்த, சாகசங்களில் ஒரு குறியீடு எடுத்துக்காட்டும் அடங்கும்! நிச்சயமாக எடி தங்கள் சொந்த படிப்பினைகளையும் சாகசங்களையும் செய்ய விரும்பும் படைப்பாற்றல் ஆசிரியர்களையும் வழங்குகிறது! ஒரு குறிப்பிட்ட அளவின் அனைத்து சாகசங்களையும் நிரலாக்க பிறகு, உங்கள் மாணவர்கள் தங்கள் அறிவை நொடி வினாவில் சோதிக்க முடியும். உங்கள் மாணவர்களின் வேலையையும் அவர்களின் முன்னேற்றத்தையும் வகுப்பு பக்கத்தில் கண்காணிக்கலாம்.

# teacher-guide->[0]->subsections->[3]->title
source: Devices
ta: சாதனங்கள்

# teacher-guide->[0]->subsections->[3]->text
source: Hedy is web-based, which means it works on any device with a browser (Google Chrome, Firefox, Edge etc), so laptops, Chromebooks, tablets and even smartphones are suitable to use Hedy. There's no need to download anything before working with Hedy, just go to the website and you're all set!
ta: எடி என்பது வலை அடிப்படையிலானது, அதாவது இது உலாவி (கூகிள் குரோம், பயர்பாக்ச், எட்ச் போன்றவை) கொண்ட எந்த சாதனத்திலும் வேலை செய்கிறது, எனவே மடிக்கணினிகள், Chromebooks, டேப்லெட்டுகள் மற்றும் ச்மார்ட்போன்கள் கூட எடியைப் பயன்படுத்த ஏற்றவை. எடியுடன் பணிபுரிவதற்கு முன்பு எதையும் பதிவிறக்கம் செய்ய வேண்டிய அவசியமில்லை, வலைத்தளத்திற்குச் செல்லுங்கள், நீங்கள் அனைவரும் அமைக்கப்பட்டிருக்கிறீர்கள்!

# teacher-guide->[0]->subsections->[4]->title
source: The Hedy Community
ta: எடி சமூகம்

# teacher-guide->[0]->subsections->[4]->text
source: All Hedy teachers, programmers and other fans are welcome to join our <a href="https://discord.gg/8yY7dEme9r" target="_blank">Discord server</a>. This is the ideal place to chat about Hedy: we have channels where you can show your cool projects and lessons, channels to report bugs, and channels to chat with other teachers and with the Hedy team. <a href="https://www.youtube.com/watch?v=Lyz_Lnd-_aI" target="_blank">Here</a> you can find a video on how to join the Discord Community.
ta: அனைத்து எடி ஆசிரியர்கள், புரோகிராமர்கள் மற்றும் பிற ரசிகர்கள் எங்கள் <a href = "https://discord.gg/8yy7deme9r" இலக்கு = "_ வெற்று"> டிச்கார்ட் சேவையகம் </a> இல் சேர வரவேற்கப்படுகிறார்கள். எடியைப் பற்றி அரட்டையடிக்க இது சிறந்த இடம்: எங்களிடம் சேனல்கள் உள்ளன, அங்கு உங்கள் அருமையான திட்டங்கள் மற்றும் பாடங்கள், பிழைகள் புகாரளிக்க சேனல்கள் மற்றும் மற்ற ஆசிரியர்களுடன் அரட்டையடிக்க சேனல்கள் மற்றும் எடி குழுவுடன் அரட்டை அடிக்கலாம். <a href = "https://www.youtube.com/watch?v=lyz_lnd-_ai" இலக்கு = "_ வெற்று"> இங்கே </a> டிச்கார்ட் சமூகத்தில் எவ்வாறு சேருவது என்பது குறித்த வீடியோவைக் காணலாம்.

# teacher-guide->[0]->subsections->[5]->title
source: Hedy and the GDPR
ta: எடி மற்றும் சிடிபிஆர்

# teacher-guide->[0]->subsections->[5]->text
source: Organizations in the EU have to comply with the GDPR (General Data Protection Regulation) when processing personal data. Because this is a complex issue for many schools, you can use all Hedy programming functionalities without sharing personal data. The easiest way to do this is to use Hedy without creating accounts for the teacher and students. Without accounts, all functionality is available, with the exception of personalizing levels, saving students' programs and viewing their progress. That is limiting, but there are schools that use Hedy in that way. A second way is for a teacher to create an account with an email address without personal data, for example "docent25@email.com". Apart from an email address, which is only required to reset your password, you do not need to share any information when you create a teacher account. With a teacher account, you can create anonymous accounts for students, e.g. rainbow-student1, rainbow-student2, etc (See 'Teaching preparations' for a detailed manual). This way you can use all functionality of Hedy, including saving progress, without sharing personal data of yourself or your students. If the above is not sufficient for your context, we can sign a processing agreement for the processing of your personal data.
ta: தனிப்பட்ட தரவை செயலாக்கும்போது ஐரோப்பிய ஒன்றியத்தில் உள்ள நிறுவனங்கள் மொத்த உள்நாட்டு உற்பத்தியில் (பொது தரவு பாதுகாப்பு ஒழுங்குமுறை) இணங்க வேண்டும். இது பல பள்ளிகளுக்கு ஒரு சிக்கலான சிக்கல் என்பதால், தனிப்பட்ட தரவைப் பகிராமல் அனைத்து எடி நிரலாக்க செயல்பாடுகளையும் நீங்கள் பயன்படுத்தலாம். இதைச் செய்வதற்கான எளிதான வழி, ஆசிரியர் மற்றும் மாணவர்களுக்கு கணக்குகளை உருவாக்காமல் எடியைப் பயன்படுத்துவது. கணக்குகள் இல்லாமல், அனைத்து செயல்பாடுகளும் கிடைக்கின்றன, நிலைகளைத் தனிப்பயனாக்குவதைத் தவிர்த்து, மாணவர்களின் திட்டங்களைச் சேமித்தல் மற்றும் அவற்றின் முன்னேற்றத்தைப் பார்ப்பது. அது கட்டுப்படுத்துகிறது, ஆனால் அந்த வகையில் எடியைப் பயன்படுத்தும் பள்ளிகள் உள்ளன. தனிப்பட்ட தரவு இல்லாமல் மின்னஞ்சல் முகவரியுடன் ஒரு கணக்கை உருவாக்க ஆசிரியருக்கு இரண்டாவது வழி, எடுத்துக்காட்டாக "docent25@email.com". உங்கள் கடவுச்சொல்லை மீட்டமைக்க மட்டுமே தேவைப்படும் மின்னஞ்சல் முகவரியைத் தவிர, நீங்கள் ஒரு ஆசிரியர் கணக்கை உருவாக்கும்போது எந்த தகவலையும் பகிர தேவையில்லை. ஆசிரியர் கணக்கு மூலம், நீங்கள் மாணவர்களுக்கு அநாமதேய கணக்குகளை உருவாக்கலாம், எ.கா. ரெயின்போ-ச்டுடென்ட் 1, ரெயின்போ-ச்டுடென்ட் 2 போன்றவை (விரிவான கையேட்டிற்கான 'கற்பித்தல் ஏற்பாடுகள்' ஐப் பார்க்கவும்). இந்த வழியில் நீங்கள் அல்லது உங்கள் மாணவர்களின் தனிப்பட்ட தரவைப் பகிராமல், முன்னேற்றத்தை சேமிப்பது உட்பட அனைத்து செயல்பாடுகளையும் நீங்கள் பயன்படுத்தலாம். உங்கள் சூழலுக்கு மேலே உள்ளவை போதுமானதாக இல்லாவிட்டால், உங்கள் தனிப்பட்ட தரவை செயலாக்குவதற்கான செயலாக்க ஒப்பந்தத்தில் நாங்கள் கையெழுத்திடலாம்.

# teacher-guide->[1]->title
source: Tutorial
ta: பயிற்சி

# teacher-guide->[1]->key
source: tutorial
ta: பயிற்சி

# teacher-guide->[1]->subsections->[0]->title
source: Tutorial
ta: பயிற்சி

# teacher-guide->[1]->subsections->[0]->text
source: Do you want to follow the tutorial (again)? Click <a href="https://hedy.org/tutorial" target="_blank">here</a>.
ta: நீங்கள் டுடோரியலைப் பின்பற்ற விரும்புகிறீர்களா (மீண்டும்)? <A href = "https://hedy.org/tutorial" இலக்கு = "_ வெற்று"> இங்கே </a> என்பதைக் சொடுக்கு செய்க.

# teacher-guide->[2]->title
source: Teaching preparations
ta: கற்பித்தல் ஏற்பாடுகள்

# teacher-guide->[2]->key
source: preparations
ta: ஏற்பாடுகள்

# teacher-guide->[2]->subsections->[0]->title
source: For teachers
ta: ஆசிரியர்களுக்கு

# teacher-guide->[2]->subsections->[0]->text
source: You can prepare your classes at the <a href="https://hedy.org/for-teachers" target="_blank">For Teachers page</a>. On this page you'll find everything you'll need to teach with Hedy, like your classes, your adventures and slides. All the functionalities of the for teachers page are explained below.
ta: உங்கள் வகுப்புகளை <a href = "https://hedy.org/for-teachers" இலக்கு = "_ வெற்று"> ஆசிரியர்கள் பக்கத்திற்கு </a> இல் தயாரிக்கலாம். இந்த பக்கத்தில், உங்கள் வகுப்புகள், உங்கள் சாகசங்கள் மற்றும் ச்லைடுகள் போன்ற எடியுடன் நீங்கள் கற்பிக்க வேண்டிய அனைத்தையும் நீங்கள் காணலாம். ஆசிரியர்கள் பக்கத்தின் அனைத்து செயல்பாடுகளும் கீழே விளக்கப்பட்டுள்ளன.

# teacher-guide->[2]->subsections->[1]->title
source: Creating a Class
ta: ஒரு வகுப்பை உருவாக்குதல்

# teacher-guide->[2]->subsections->[1]->text
source: As a teacher, you can create a class for your students. In this class you can see the students' accounts and their programs and you could monitor their progress. This <a href="https://www.youtube.com/watch?v=Y3RTIWftJQg" target="_blank">video</a> shows you how to quickly create a class in Hedy.
ta: ஒரு ஆசிரியராக, உங்கள் மாணவர்களுக்கு ஒரு வகுப்பை உருவாக்கலாம். இந்த வகுப்பில் நீங்கள் மாணவர்களின் கணக்குகளையும் அவற்றின் திட்டங்களையும் காணலாம், மேலும் அவர்களின் முன்னேற்றத்தை நீங்கள் கண்காணிக்க முடியும். இந்த <a href = "https://www.youtube.com/watch?v=y3rtiwftjqg" இலக்கு = "_ வெற்று"> வீடியோ </a> எடியில் ஒரு வகுப்பை எவ்வாறு விரைவாக உருவாக்குவது என்பதைக் காட்டுகிறது.

# teacher-guide->[2]->subsections->[2]->title
source: Duplicate a class
ta: ஒரு வகுப்பை நகல்

# teacher-guide->[2]->subsections->[2]->text
source: Are you teaching multiple classes? Then you don't have to customize each class individually. Simply make a class, costumize the class (see "Customize your Class" to learn how) and then duplicate this class as many times as you want. You can duplicate the class on the 'For Teachers' page. If you duplicate a class, all the class settings are duplicated as well. This means that all the levels and adventures you've made unavailable for the first class will now be unavailable for the new class(es) as well. The student accounts and second teacher accounts in your class will not be duplicated into the new class.
ta: அரே you teaching multiple classes? ஒவ்வொரு வகுப்பையும் நீங்கள் தனித்தனியாக தனிப்பயனாக்க வேண்டியதில்லை. வெறுமனே ஒரு வகுப்பை உருவாக்குங்கள், வகுப்பை வழங்கவும் (எப்படி அறிய "உங்கள் வகுப்பைத் தனிப்பயனாக்கு" என்பதைப் பார்க்கவும்) பின்னர் இந்த வகுப்பை நீங்கள் விரும்பும் பல முறை நகலெடுக்கவும். 'ஆசிரியர்களுக்காக' பக்கத்தில் நீங்கள் வகுப்பை நகலெடுக்கலாம். நீங்கள் ஒரு வகுப்பை நகலெடுத்தால், அனைத்து வகுப்பு அமைப்புகளும் நகலெடுக்கப்படுகின்றன. இதன் பொருள் என்னவென்றால், முதல் வகுப்பிற்கு நீங்கள் கிடைக்காத அனைத்து நிலைகளும் சாகசங்களும் இப்போது புதிய வகுப்பிற்கும் (ES) கிடைக்காது. உங்கள் வகுப்பில் மாணவர் கணக்குகள் மற்றும் இரண்டாவது ஆசிரியர் கணக்குகள் புதிய வகுப்பில் நகலெடுக்கப்படாது.

# teacher-guide->[2]->subsections->[3]->title
source: Add a second teacher
ta: இரண்டாவது ஆசிரியரைச் சேர்க்கவும்

# teacher-guide->[2]->subsections->[3]->text
source: Are you not the only teacher that teaches your class? Then you can now add another teacher to the class. Go to the 'For teachers' page and click on the class. Then choose 'Invite a teacher' and fill in the username of your colleague. Your colleague will get an invitation on their account to join your class. They can see that invitation message by clicking on their username in the upper right corner of the screen and selecting 'My account'. Once the other teacher accepts the invitation they can customize the class as well. To remove a second teacher from your class, go to the class page and remove the second teacher. The teacher who's created the class cannot be removed.
ta: உங்கள் வகுப்பைக் கற்பிக்கும் ஒரே ஆசிரியர் நீங்கள் இல்லையா? பின்னர் நீங்கள் இப்போது மற்றொரு ஆசிரியரை வகுப்பில் சேர்க்கலாம். 'ஆசிரியர்களுக்காக' பக்கத்திற்குச் சென்று வகுப்பைக் சொடுக்கு செய்க. பின்னர் 'ஒரு ஆசிரியரை அழைக்க' என்பதைத் தேர்ந்தெடுத்து உங்கள் சகாவின் பயனர்பெயரை நிரப்பவும். உங்கள் வகுப்பில் சேர உங்கள் தம ஊழியருக்கு அவர்களின் கணக்கில் அழைப்பு கிடைக்கும். திரையின் மேல் வலது மூலையில் உள்ள பயனர்பெயரைக் சொடுக்கு செய்து 'எனது கணக்கை' தேர்ந்தெடுப்பதன் மூலம் அந்த அழைப்பிதழ் செய்தியை அவர்கள் காணலாம். மற்ற ஆசிரியர் அழைப்பை ஏற்றுக்கொண்டவுடன் அவர்கள் வகுப்பையும் தனிப்பயனாக்கலாம். உங்கள் வகுப்பிலிருந்து இரண்டாவது ஆசிரியரை அகற்ற, வகுப்பு பக்கத்திற்குச் சென்று இரண்டாவது ஆசிரியரை அகற்றவும். வகுப்பை உருவாக்கிய ஆசிரியரை அகற்ற முடியாது.

# teacher-guide->[2]->subsections->[4]->title
source: Customize your Class
ta: உங்கள் வகுப்பைத் தனிப்பயனாக்குங்கள்

# teacher-guide->[2]->subsections->[4]->text
source: You can customize your class and choose which adventures are available for your students. This way your students won't be overwhelmed by the amount of adventures and levels, and they can specifically focus on the adventures you'd like them to practice with. Click on your class on the for teachers page and choose 'customize class'. On this page you can select levels, set opening dates, unlock level thresholds and more. **Select and order adventures** <img src="https://github.com/hedyorg/hedy/assets/80678586/df38cbb2-468e-4317-ac67-92eaf4212adc" width="1000"> In this section you can select and order adventures. The pink tabs are adventures with new commands. The gray tabs are regular adventures. To rearrange the order of the adventures, you can drag the tabs. However, we do advise you to use the regular order of adventures as the Hedy team made sure the adventures go from easiest to hardest. If you want to remove an adventure for your students, simply click the cross on the adventure's tab. <img src="https://github.com/hedyorg/hedy/assets/80678586/0ddd10b5-ef60-4480-a0c4-fc9a0f323baa" width="300"> If you want to add adventures, for instance your own adventure or an adventure you accidentally removed, use this menu to add the adventure to your students' adventures. Simply click the adventure you want to add and it (re)appears in the line of adventures. To undo all your changes to the adventures, click 'Reset'. **Opening dates** <img src="https://github.com/hedyorg/hedy/assets/80678586/4e59acfa-4772-429f-8328-babb43c942d5" width="300"> With this feature you can set opening dates for the levels. This way you can make a lesson plan before your course begins and not worry about opening new levels each week. In the image above the first level is opened directly, the second will open the 23th of september, and the 3rd level the week after. The other levels are closed. Don't want to set opening dates? No problem, just leave this section blank. **Unlock level thresholds** <img src="https://github.com/hedyorg/hedy/assets/80678586/99a34dab-f112-459e-bfd1-07618be4715a" width = "1000"> This featue allows you to set a threshold for your students' quiz grade, before they can continue to the next level. For example, if you enter "80" your students have to score at least 80% on the quiz before they are allowed to go to the next level. If they haven't met the threshold, they are not allowed to continue and have to retake the quiz. Don't want to use the threshold? No worries, just keep this section blank. **Other settings** <img src="https://github.com/hedyorg/hedy/assets/80678586/a8491d67-6d6e-42a7-b672-fd3d083a76f8"/> There are some other setting that could be useful to you as well. Our first extra setting is 'Mandatory developer's mode'. In developers mode the students only see their input and output screens and the run button. The adventures are hidden and there are no cheatsheets available. This might come in handy in a test situation. If this option is not selected the developer's mode is available for students too as a voluntary option. If you want all your students to be visible in de class highscore, you can select the second option. With all the other options you can choose to hide some functions or content for your students, this might help them focus more. **Save** <img src="https://github.com/hedyorg/hedy/assets/80678586/df179df3-3073-4d15-bba6-62e58fb675be" width="300"> Don't forget to save your changes when you're done customizing your class.
ta: உங்கள் வகுப்பைத் தனிப்பயனாக்கலாம் மற்றும் உங்கள் மாணவர்களுக்கு எந்த சாகசங்கள் உள்ளன என்பதைத் தேர்வுசெய்யலாம். இந்த வழியில் உங்கள் மாணவர்கள் சாகசங்கள் மற்றும் நிலைகளின் அளவைக் கடந்து செல்ல மாட்டார்கள், மேலும் அவர்கள் பயிற்சி செய்ய விரும்பும் சாகசங்களில் அவர்கள் குறிப்பாக கவனம் செலுத்த முடியும். ஆசிரியர்கள் பக்கத்தில் உங்கள் வகுப்பைக் சொடுக்கு செய்து 'வகுப்பைத் தனிப்பயனாக்கு' என்பதைத் தேர்வுசெய்க. இந்த பக்கத்தில் நீங்கள் நிலைகளைத் தேர்ந்தெடுக்கலாம், திறப்பு தேதிகளை அமைக்கலாம், திறத்தல் நிலை வரம்புகள் மற்றும் பல. ** சாகசங்களைத் தேர்ந்தெடுத்து ஆர்டர் செய்யுங்கள் ** <img src = "https://github.com/hedib. இந்த பிரிவில் நீங்கள் சாகசங்களைத் தேர்ந்தெடுத்து ஆர்டர் செய்யலாம். இளஞ்சிவப்பு தாவல்கள் புதிய கட்டளைகளுடன் சாகசங்கள். சாம்பல் தாவல்கள் வழக்கமான சாகசங்கள். சாகசங்களின் வரிசையை மறுசீரமைக்க, நீங்கள் தாவல்களை இழுக்கலாம். எவ்வாறாயினும், சாகசங்களின் வழக்கமான ஆர்டர் ஆஃப் அட்வென்ச்சர்ச் பயன்படுத்துமாறு நாங்கள் உங்களுக்கு அறிவுறுத்துகிறோம், ஏனெனில் சாகசங்கள் எளிதானவையாக இருந்து கடினமானதாக இருப்பதை உறுதிசெய்தது. உங்கள் மாணவர்களுக்கு ஒரு சாகசத்தை அகற்ற விரும்பினால், சாகச தாவலில் உள்ள சிலுவையைக் சொடுக்கு செய்க. <img src = "https://github.com/hdedurg/hedy/assets/80678586/0ddd10b5-ef60-4480-a0c4-fc9a0f323baa" அகலம் = "300"> நீங்கள் சாகசங்களைச் சேர்க்க விரும்பினால், உதாரணமாக உங்கள் சொந்த துணிவு அல்லது நீங்கள் தற்செயலாக அகற்றப்பட்ட ஒரு சாகசத்தை, உங்கள் மாணவர்களின் சாகசங்களுக்கு சாகசத்தைச் சேர்க்க இந்த மெனுவைப் பயன்படுத்தவும். நீங்கள் சேர்க்க விரும்பும் சாகசத்தைக் சொடுக்கு செய்து, அது (மறு) சாகசங்களின் வரிசையில் தோன்றும். சாகசங்களில் உங்கள் எல்லா மாற்றங்களையும் செயல்தவிர்க்க, 'மீட்டமை' என்பதைக் சொடுக்கு செய்க. ** திறப்பு தேதிகள் ** <img src = "https://github.com/hdedurg/hedy/assets/80678586/4e59acfa-4772-429f-8328-BABB43C942D5" அகலம் = "300"> இந்த அம்சத்துடன் நீங்கள் நிலைகளுக்கான திறப்பு தேதிகளை அமைக்கலாம். இந்த வழியில் உங்கள் பாடநெறி தொடங்குவதற்கு முன்பு நீங்கள் ஒரு பாடம் திட்டத்தை உருவாக்கலாம், மேலும் ஒவ்வொரு வாரமும் புதிய நிலைகளைத் திறப்பது பற்றி கவலைப்பட வேண்டாம். முதல் நிலைக்கு மேலே உள்ள படத்தில் நேரடியாக திறக்கப்படுகிறது, இரண்டாவது செப்டம்பர் 23, மற்றும் 3 வது நிலைக்கு பின்னர் 3 வது நிலை திறக்கப்படும். மற்ற நிலைகள் மூடப்பட்டுள்ளன. தொடக்க தேதிகளை அமைக்க விரும்பவில்லையா? எந்த பிரச்சனையும் இல்லை, இந்த பகுதியை காலியாக விடவும். ** திறக்க நிலை வரம்புகளைத் திறக்கவும் ** <img src = "https://github.com/hdedurg/hedy/assets/80678586/99A34DAB-FF112-459E-BFD1-07618BE4715A" அகலம் = "1000"> உங்கள் மாணவர்களின் நொடி வினா தரத்திற்கு ஒரு நுழைவாயிலை அமைக்க இந்த சாதனை உங்களை அனுமதிக்கிறது, அவர்கள் அடுத்த கட்டத்திற்கு தொடருமுன். எடுத்துக்காட்டாக, நீங்கள் "80" உள்ளிட்டால், உங்கள் மாணவர்கள் அடுத்த நிலைக்குச் செல்ல அனுமதிக்கப்படுவதற்கு முன்பு உங்கள் மாணவர்கள் நொடி வினாவில் குறைந்தது 80% மதிப்பெண் பெற வேண்டும். அவர்கள் நுழைவாயிலை சந்திக்கவில்லை என்றால், அவர்கள் தொடர அனுமதிக்கப்படுவதில்லை, மேலும் நொடி வினாவை மீண்டும் எடுக்க வேண்டும். வாசலைப் பயன்படுத்த விரும்பவில்லையா? எந்த கவலையும் இல்லை, இந்த பகுதியை காலியாக வைத்திருங்கள். ** பிற அமைப்புகள் ** <img src = "https://github.com/hdedurg/hedy/assets/80678586/a8491d67-6d6e-42a7-b672-fd3d083a76f8"/> உங்களுக்கு பயனுள்ளதாக இருக்கும் வேறு சில அமைப்புகளும் உள்ளன. எங்கள் முதல் கூடுதல் அமைப்பு 'கட்டாய டெவலப்பரின் பயன்முறை'. உருவாக்குபவர்கள் பயன்முறையில் மாணவர்கள் தங்கள் உள்ளீடு மற்றும் வெளியீட்டு திரைகள் மற்றும் ரன் பொத்தானை மட்டுமே பார்க்கிறார்கள். சாகசங்கள் மறைக்கப்பட்டுள்ளன, மேலும் சீட்சீட்கள் எதுவும் கிடைக்கவில்லை. இது ஒரு சோதனை சூழ்நிலையில் கைக்கு வரக்கூடும். இந்த விருப்பம் தேர்ந்தெடுக்கப்படாவிட்டால், டெவலப்பரின் பயன்முறை மாணவர்களுக்கும் தன்னார்வ விருப்பமாக கிடைக்கிறது. உங்கள் மாணவர்கள் அனைவரும் டி வகுப்பு ஐச்கோரில் காணப்பட வேண்டும் என்று நீங்கள் விரும்பினால், நீங்கள் இரண்டாவது விருப்பத்தைத் தேர்ந்தெடுக்கலாம். உங்கள் மாணவர்களுக்கான சில செயல்பாடுகள் அல்லது உள்ளடக்கத்தை மறைக்க நீங்கள் தேர்வுசெய்யக்கூடிய மற்ற எல்லா விருப்பங்களுடனும், இது அவர்களுக்கு அதிக கவனம் செலுத்த உதவும். ** சேமி ** <img src = "https://github.com/hdedurg/hedy/assets/80678586/df179df3-3073-4d15-bba6-62e58fb675be" அகலம் = "300"> உங்கள் வகுப்பைத் தனிப்பயனாக்கும்போது உங்கள் மாற்றங்களைச் சேமிக்க மறக்காதீர்கள்.

# teacher-guide->[2]->subsections->[5]->title
source: Student Accounts
ta: மாணவர் கணக்குகள்
