Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-webpages-*.po
Languages: ta

# title
source: Hedy documentation
ta: எடி ஆவணங்கள்

# home-sections->[0]->title
source: Textual programming made easy!
ta: உரை நிரலாக்கமானது எளிதானது!

# home-sections->[0]->text
source: Many schools and teachers around the world want to teach their students programming. Initially this is often done with playful tools, ranging from the Beebot robot to Scratch Junior or Scratch. After using such tools, kids often want to move to more powerful, textual programming languages, like Python. Python however is hard, because it is only available in English, and requires learners to learn complex programming concepts and syntax at once. Hedy is the easy way to get started with textual programming languages! Hedy is free to use, open source, and unlike any other textual programming language in three ways. 1. Hedy is multi-lingual, you can use Hedy in your own language 2. Hedy is gradual, so you can learn one concept and its syntax a time 3. Hedy is built for the classroom, allowing teachers to fully customize their student's experience
ta: உலகெங்கிலும் உள்ள பல பள்ளிகளும் ஆசிரியர்களும் தங்கள் மாணவர்களின் நிரலாக்கத்தை கற்பிக்க விரும்புகிறார்கள். ஆரம்பத்தில் இது பெரும்பாலும் பீபோட் ரோபோ முதல் வரை விளையாட்டுத்தனமான கருவிகளால் செய்யப்படுகிறது கீறல் சூனியர் அல்லது கீறல். இத்தகைய கருவிகளைப் பயன்படுத்திய பிறகு, குழந்தைகள் பெரும்பாலும் பைதான் போன்ற சக்திவாய்ந்த, உரை நிரலாக்க மொழிகளுக்கு செல்ல விரும்புகிறார்கள். இருப்பினும் பைதான் கடினமானது, ஏனென்றால் இது ஆங்கிலத்தில் மட்டுமே கிடைக்கிறது, மேலும் கற்றவர்கள் ஒரே நேரத்தில் சிக்கலான நிரலாக்கக் கருத்துகளையும் தொடரியல் என்பதைக் கற்றுக்கொள்ள வேண்டும். உரை நிரலாக்க மொழிகளுடன் தொடங்குவதற்கான எளிதான வழி எடி! எடி என்பது மூன்று வழிகளில் வேறு எந்த உரை நிரலாக்க மொழியைப் பயன்படுத்தவும், திறந்த மூலமாகவும், திறந்த மூலமாகவும் இலவசமாகவும் இருக்கும். 1. எடி பல மொழி, நீங்கள் உங்கள் சொந்த மொழியில் எடியைப் பயன்படுத்தலாம் 2. எடி படிப்படியாக உள்ளது, எனவே நீங்கள் ஒரு கருத்தையும் அதன் தொடரியல் ஒரு நேரத்தையும் கற்றுக்கொள்ளலாம் 3. வகுப்பறைக்காக எடி கட்டப்பட்டுள்ளது, ஆசிரியர்கள் தங்கள் மாணவர்களின் அனுபவத்தை முழுமையாக தனிப்பயனாக்க அனுமதிக்கிறது

# home-sections->[1]->title
source: Multi-lingual programming
ta: பல மொழி நிரலாக்க

# home-sections->[1]->text
source: While almost all textual programming language have keywords in English, such as `for` or `repeat`, Hedy can be used in any language! We currently support 47 different languages, including Dutch, Spanish, Arabic, Turkish, Chinese and Hindi. If your language is not available you can always start a new translation.
ta: கிட்டத்தட்ட எல்லா உரை நிரலாக்க மொழியும் ஆங்கிலத்தில் முக்கிய வார்த்தைகளைக் கொண்டிருக்கும்போது, ​​`` அல்லது `மீண்டும் நிகழும்` போன்றவை, எந்த மொழியிலும் எடி பயன்படுத்தப்படலாம்! டச்சு, ச்பானிச், அரபு, துருக்கிய, சீன மற்றும் இந்தி உள்ளிட்ட 47 வெவ்வேறு மொழிகளை நாங்கள் தற்போது ஆதரிக்கிறோம். உங்கள் மொழி கிடைக்கவில்லை என்றால் நீங்கள் எப்போதும் புதிய மொழிபெயர்ப்பைத் தொடங்கலாம்.

# home-sections->[2]->title
source: Step by step learning
ta: படிப்படியான கற்றல்

# home-sections->[2]->text
source: Learning a programming language can be overwhelming, since learners have to learn concepts (for example if-else or loops) and syntax (like quotation marks or round brackets) at the same time. In Hedy, concepts are first introduced with little syntax and then refined. A scientifically proven way to learn!
ta: ஒரு நிரலாக்க மொழியைக் கற்றுக்கொள்வது மிகப்பெரியது, ஏனெனில் கற்பவர்கள் ஒரே நேரத்தில் கருத்துக்கள் (எடுத்துக்காட்டாக IF-ELSE அல்லது சுழல்கள்) மற்றும் தொடரியல் (மேற்கோள் மதிப்பெண்கள் அல்லது சுற்று அடைப்புக்குறிகள் போன்றவை) கற்றுக்கொள்ள வேண்டும். எடியில், கருத்துக்கள் முதலில் சிறிய தொடரியல் மூலம் அறிமுகப்படுத்தப்பட்டு பின்னர் சுத்திகரிக்கப்படுகின்றன. கற்றுக்கொள்ள விஞ்ஞான ரீதியாக நிரூபிக்கப்பட்ட வழி!

# home-sections->[3]->title
source: Built for the classroom
ta: வகுப்பறைக்காக கட்டப்பட்டது

# home-sections->[3]->text
source: Hedy is suitable for kids aged 10 and up and designed for classroom use. Teachers can use our free, built-in lesson plans, but can also author their own lessons and load these into the Hedy user interface.
ta: எடி 10 மற்றும் அதற்கு மேற்பட்ட குழந்தைகளுக்கு ஏற்றது மற்றும் வகுப்பறை பயன்பாட்டிற்காக வடிவமைக்கப்பட்டுள்ளது. ஆசிரியர்கள் எங்கள் இலவச, உள்ளமைக்கப்பட்ட பாடம் திட்டங்களைப் பயன்படுத்தலாம், ஆனால் அவற்றின் சொந்த பாடங்களை எழுதி இவற்றை எடி பயனர் இடைமுகத்தில் ஏற்றலாம்.

# home-sections->[4]->title
source: Programming in context
ta: சூழலில் நிரலாக்க

# home-sections->[4]->text
source: Hedy shows programming in the broadest way possible, and can be used in variety of exciting ways. Hedy allows for the creation of digital and interactive stories, colorful drawings that can be shown on the screen but also drawn with a pen plotter or embroidered on a shirt, and can be used to create games or apps with buttons and keyboard actions.
ta: எடி நிரலாக்கத்தை சாத்தியமான பரந்த வழியில் காட்டுகிறது, மேலும் பலவிதமான அற்புதமான வழிகளில் பயன்படுத்தப்படலாம். டிசிட்டல் மற்றும் ஊடாடும் கதைகளை உருவாக்க எடி அனுமதிக்கிறது, திரையில் காட்டக்கூடிய வண்ணமயமான வரைபடங்கள், ஆனால் பேனா சதித்திட்டத்துடன் வரையப்படலாம் அல்லது ஒரு சட்டையில் எம்ப்ராய்டரி செய்யப்பட்டன, மேலும் பொத்தான்கள் மற்றும் விசைப்பலகை செயல்களுடன் விளையாட்டுகள் அல்லது பயன்பாடுகளை உருவாக்க பயன்படுத்தலாம்.

# home-sections->[5]->title
source: Is Hedy free?
ta: எடி இலவசமா?

# home-sections->[5]->text
source: Yes! Hedy is 'Open source', which means that everyone can help us make Hedy better. You can find our code on <a href="https://github.com/hedyorg/hedy" target="_blank">Github</a>. If you like Hedy and want to contribute, we accept (and are very grateful for) <a href="https://github.com/sponsors/hedyorg" target="_blank">donations</a>!
ta: ஆம்! எடி 'திறந்த மூல', அதாவது எடியை சிறப்பாகச் செய்ய எல்லோரும் எங்களுக்கு உதவ முடியும். எங்கள் குறியீட்டை <a href = "https://github.com/hediorg/hedy" இலக்கு = "_ வெற்று"> அறிவிலிமையம் </a> இல் காணலாம். நீங்கள் எடியை விரும்பினால், பங்களிக்க விரும்பினால், நாங்கள் ஏற்றுக்கொள்கிறோம் (மற்றும் மிகவும் நன்றியுள்ளவர்களாக இருக்கிறோம்) <a href = "https://github.com/sponsors/hediorg" இலக்கு = "_ வெற்று"> நன்கொடைகள் </a>!

# home-sections->[6]->title
source: Do I need to install anything?
ta: நான் எதையும் நிறுவ வேண்டுமா?

# home-sections->[6]->text
source: No. Hedy works in the browser, which is the program you are using to look at this page. Probably Chrome or Edge or Firefox. Hedy also works on phones and tablets.
ta: இல்லை. எடி உலாவியில் வேலை செய்கிறது, இது இந்த பக்கத்தைப் பார்க்க நீங்கள் பயன்படுத்தும் நிரலாகும். அநேகமாக குரோம் அல்லது எட்ச் அல்லது பயர்பாக்ச். எடி தொலைபேசிகள் மற்றும் டேப்லெட்டுகளிலும் வேலை செய்கிறது.

# home-sections->[7]->title
source: Do I need programming experience to teach with Hedy?
ta: எடியுடன் கற்பிக்க எனக்கு நிரலாக்க பட்டறிவு தேவையா?

# home-sections->[7]->text
source: No, that is not needed. All concepts are explained in the slides and in the interface for learners. If you create a free teacher's account, you also get access to the teacher's manual with information on how to teach and frequently made mistakes.
ta: இல்லை, அது தேவையில்லை. அனைத்து கருத்துக்களும் ச்லைடுகளிலும் கற்பவர்களுக்கான இடைமுகத்திலும் விளக்கப்பட்டுள்ளன. நீங்கள் ஒரு இலவச ஆசிரியரின் கணக்கை உருவாக்கினால், ஆசிரியரின் கையேட்டில் அணுகலைப் பெறுவீர்கள் மற்றும் அடிக்கடி தவறுகளைச் செய்தது.

# join-sections->[0]->title
source: Supporting Hedy
ta: எடி துணை

# join-sections->[0]->text
source: # There are three ways in which you can support Hedy!
ta: # நீங்கள் எடியை ஆதரிக்க மூன்று வழிகள் உள்ளன!

# join-sections->[1]->title
source: Improving the language
ta: மொழியை மேம்படுத்துதல்

# join-sections->[1]->text
source: The gradual and multi-lingual nature of Hedy create a lot of interesting technical challenges. Find those issues on <a href="https://github.com/hedyorg/hedy/issues?q=is%3Aopen+is%3Aissue+label%3Alanguage" target="_blank">Github</a>.
ta: எடியின் படிப்படியான மற்றும் பல மொழி இயல்பு நிறைய சுவையான தொழில்நுட்ப சவால்களை உருவாக்குகிறது. அந்த சிக்கல்களை <a href = "https://github.com/hdedurg/hedy/issues?q=is%3Aopen+is%3Aissue+label%3Alanguage" இலக்கு = "_ வெற்று"> அறிவிலிமையம் </a>.

# join-sections->[2]->title
source: Translating Hedy
ta: மொழிபெயர்ப்பு எடி

# join-sections->[2]->text
source: Not a programmer? No problem! Another way to support Hedy is by <a href="https://github.com/hedyorg/hedy/wiki/Hedy-Translation-Tutorial" target="_blank">translating keywords, error messages, adventures and other content</a>. This is the current status, help us complete a language, or add a new one! <a href="https://hosted.weblate.org/engage/hedy/"> <img src="https://hosted.weblate.org/widgets/hedy/-/multi-auto.svg" alt="Translation status" /></a>
ta: ஒரு புரோகிராமர் அல்லவா? எந்த பிரச்சனையும் இல்லை! எடியை ஆதரிப்பதற்கான மற்றொரு வழி <a href = "https://github.com/hdedorg/hedy/wiki/hedy-translation-tutorial" இலக்கு = "_ வெற்று"> முக்கிய வார்த்தைகள், பிழை செய்திகள், சாகசங்கள் மற்றும் பிற உள்ளடக்கங்களை மொழிபெயர்க்கிறது </ a>. இது தற்போதைய நிலை, ஒரு மொழியை முடிக்க எங்களுக்கு உதவுங்கள் அல்லது புதியதைச் சேர்க்கவும்! <a href = "https://hosted.weblate.org/engage/hedy/"> <img src = "https://hosted.weblate.org/widgets/hedy/-/multi-auto.svg" மாற்று = "மொழிபெயர்ப்பு நிலை"/> </a>

# join-sections->[3]->title
source: Help teachers get started
ta: ஆசிரியர்களுக்கு தொடங்க உதவுங்கள்

# join-sections->[3]->text
source: Hedy is designed to support teachers in providing programming lessons in class. We have specific teacher features like the option to create a class, customize it and see how your students are doing. If you like Hedy, you can reach out to schools that you know to help teachers get started! We can help you find schools or teachers via <a href="https://discord.gg/8yY7dEme9r" target="_blank">Discord</a>.
ta: வகுப்பில் நிரலாக்க பாடங்களை வழங்குவதில் ஆசிரியர்களை ஆதரிப்பதற்காக எடி வடிவமைக்கப்பட்டுள்ளது. ஒரு வகுப்பை உருவாக்குவதற்கும், அதைத் தனிப்பயனாக்குவதற்கும், உங்கள் மாணவர்கள் எவ்வாறு செயல்படுகிறார்கள் என்பதைப் பார்ப்பதற்கும் விருப்பம் போன்ற குறிப்பிட்ட ஆசிரியர் நற்பொருத்தங்கள் எங்களிடம் உள்ளன. நீங்கள் எடியை விரும்பினால், ஆசிரியர்கள் தொடங்க உதவ உங்களுக்குத் தெரிந்த பள்ளிகளை அணுகலாம்! <A href = "https://discord.gg/8yy7deme9r" இலக்கு = "_ வெற்று"> முரண்பாடு </a> வழியாக பள்ளிகள் அல்லது ஆசிரியர்களைக் கண்டுபிடிக்க நாங்கள் உங்களுக்கு உதவ முடியும்.

# learn-more-sections->[0]->title
source: The Hedy foundation
ta: எடி அறக்கட்டளை

# learn-more-sections->[0]->text
source: Hedy is maintained by the Hedy Foundation (Stichting Hedy), Sportmanstaat 8, 2341 JG Oegstgeest, Dutch Chamber of Commerce number 94013985. The board of the foundation consists of: * Felienne Hermans, president * Eelko Huizing, finance * Renée Merbis, secretary The board of Stichting Hedy does not get any financial compensation for their tasks.
ta: எடி தி எடி பவுண்டேசன் (ச்டிச்சிங் எடி), ச்போர்ட்ச்மேன்ச்டாட் 8, 2341 சே.சி. அறக்கட்டளையின் வாரியம் பின்வருமாறு: * ஃபெலியன் எர்மன்ச், தலைவர் * ஈல்கோ ஊயிங், பொருள் * ரெனீ மெர்பிச், செயலாளர் ச்டிச்சிங் எடி வாரியத்திற்கு அவர்களின் பணிகளுக்கு எந்த பொருள் இழப்பீடும் கிடைக்காது.

# learn-more-sections->[1]->title
source: A deep dive!
ta: ஒரு ஆழமான டைவ்!

# learn-more-sections->[1]->text
source: Want to know more about Hedy's philosophy and design? Check out this talk Felienne gave at the StrangeLoop Conference in 2022: <iframe width="560" height="315" class="mx-auto mt-4" src="https://www.youtube.com/embed/fmF7HpU_-9k?wmode=opaque" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen=""></iframe>
ta: எடியின் உண்மை மற்றும் வடிவமைப்பு பற்றி மேலும் அறிய விரும்புகிறீர்களா? 2022 ஆம் ஆண்டில் ச்ட்ராங்கலூப் மாநாட்டில் ஃபெலியென் அளித்த பேச்சைப் பாருங்கள்: <iframe wedth = "560" உயரம் = "315" வகுப்பு = "mx-auto mt-4" src = "https://www.youtube. இசைவு = "முடுக்கமானி; ஆட்டோபிளே; கிளிப்போர்டு-ரைட்; குறியாக்கப்பட்ட-மீடியா; கைரோச்கோப்; படம்-பட-பட" இசைவு ஃபுல்ச்கிரீன் = ""> </iframe>

# learn-more-sections->[2]->title
source: Hedy in the news
ta: செய்தியில் எடி

# learn-more-sections->[2]->text
source: Some websites and newspapers have written about Hedy since our release in early 2020. We keep a list here: * [Java Magazine 04.2023](images/Hedy_Javamagazine2023.pdf) * [Tech Optimism - A Solution to the IT Shortage (Dutch), August 2022](https://pom.show/2022/08/12/een-oplossing-voor-het-it-tekort/) * [Codeweek Podcast, July 2022](https://codeweek.eu/podcast/26) * [Heise.de (German), Januari 2022](https://www.heise.de/news/Hedy-die-mitwachsende-Programmiersprache-6336264.html) * [Strumenta, November 2021](https://tomassetti.me/teaching-programming-with-hedy/) * [Vives (Dutch), CodeWeek Special October 2021](images/Vives-174-Codeweek.pdf) * [CodeWeek.eu - Haunted House Challenge, September 2021](https://codeweek.eu/2021/challenges/haunted-house) * [Opensource.com, April 2021](https://opensource.com/article/21/4/hedy-teach-code) * [IO Magazine, April 2021](https://ict-research.nl/wordpress/wp-content/uploads/2021/04/IO-magazine-NR1-2021_web.pdf) * [Ingeniería De Software (Spanish), February 2021](https://ingenieriadesoftware.es/hedy-mejor-lenguaje-ensenar-programacion-ninos/) * [Hello World Magazine, February 2021](images/Hello_World_15_Hedy.pdf) * [Discoro, January 2021](https://discoro.wordpress.com/2021/01/09/hedy-gradually-learning-a-programming-language/) * [Felienne wins the Dutch award for ICT research for Hedy, January 2021](https://www.nwo.nl/en/news/felienne-hermans-receives-dutch-prize-ict-research-2021) * [SlashDot, August 2020](https://news.slashdot.org/story/20/08/17/024248/scientist-proposes-a-new-programming-language-for-teaching-coding-and-python) * [GenBeta (Spanish), August 2020](https://www.genbeta.com/desarrollo/nuevo-lenguaje-para-ensenar-programacion-a-ninos-como-se-ensena-a-leer-escribir-forma-gradual-niveles) * [Developpez (French), August 2020](https://programmation.developpez.com/actu/308095/Une-scientifique-propose-un-nouveau-langage-de-programmation-pour-enseigner-aux-enfants-le-codage-informatique-au-travers-d-une-approche-graduelle-implementee-en-Python-sur-13-paliers/) * [Vives (Dutch), October 2020](images/artikel_vives.pdf) "Met Hedy stap voor stap leren programmeren" * [Leiden University, April 2020](https://www.universiteitleiden.nl/en/news/2020/03/looking-to-distract-the-kids-while-you-work-from-home-get-them-programming) * [Mare (Dutch), April 2020](https://www.mareonline.nl/cultuur/computercode-voor-de-kids/) * [AG Connect (Dutch), April 2020](https://www.agconnect.nl/artikel/stapsgewijs-python-leren-programmeren-met-nieuwe-taal-hedy)
ta: சில வலைத்தளங்கள் மற்றும் செய்தித்தாள்கள் 2020 ஆம் ஆண்டின் தொடக்கத்தில் நாங்கள் வெளியானதிலிருந்து எடி பற்றி எழுதியுள்ளன. நாங்கள் ஒரு பட்டியலை இங்கே வைத்திருக்கிறோம்: * [சாவா இதழ் 04.2023] (படங்கள்/hedy_javamagazine2023.pdf) . * [கோட் வீக் போட்காச்ட், சூலை 2022] (https://codeweek.eu/podcast/26) *. . . *. . . . . *. ! *. * -பயன்பாட்டு நிவில்ச்) * -கோடேச்-இன்ஃபார்மாடிக்-ஓ-ட்ரேவர்ச்-டி-ஐன்-அப்ராச்-கிராக்டுவேல்-இம்ப்லெமென்டீ-என்-பைதான்-சுர் -13-பாலியர்கள்/) *. * -பிராகிங்) . *.

# start-sections->[0]->title
source: Getting started with Hedy
ta: எடியுடன் தொடங்குதல்

# start-sections->[0]->text
source: Welcome to Hedy, we are happy to help you get started with Hedy. Our [Teacher Manual](https://www.hedy.org/for-teachers/manual) has an overview of all features in detail, but this page has a brief overview so you know what it what before you dive in. A few highlights that are important to know: * Hedy is a tool designed to help manage a classroom of kids programming! You can create your own classes, lesson plans and follow how kids are doing. * You do not need to know a lot of programming if you begin, Hedy works step by step, also for you! * You can use Hedy in your native tongue because it has been translated into many other languages! * Every kid can programme!! Hedy is especially helpful for kids who have vision problems because it can read material aloud to you without the need for a mouse. * We are here to help, you can find us for example on [Discord](https://discord.gg/8yY7dEme9r) or you can [email-us](hello@hedy.org).
ta: எர்டிக்கு வருக, எடியுடன் தொடங்க உங்களுக்கு உதவ நாங்கள் மகிழ்ச்சியடைகிறோம். எங்கள் [ஆசிரியர் கையேடு] (https://www.hedy.org/for-teachers/manual) அனைத்து அம்சங்களின் கண்ணோட்டத்தையும் விரிவாகக் கொண்டுள்ளது, ஆனால் இந்தப் பக்கத்தில் ஒரு சுருக்கமான கண்ணோட்டத்தைக் கொண்டுள்ளது, எனவே நீங்கள் டைவ் செய்வதற்கு முன்பு என்னவென்று உங்களுக்குத் தெரியும். தெரிந்து கொள்ள வேண்டிய சில சிறப்பம்சங்கள்: * எடி என்பது குழந்தைகள் நிரலாக்கத்தின் வகுப்பறையை நிர்வகிக்க உதவும் வகையில் வடிவமைக்கப்பட்ட ஒரு கருவி! நீங்கள் உங்கள் சொந்த வகுப்புகள், பாடம் திட்டங்களை உருவாக்கலாம் மற்றும் குழந்தைகள் எவ்வாறு செயல்படுகிறார்கள் என்பதைப் பின்பற்றலாம். * நீங்கள் தொடங்கினால் நிறைய நிரலாக்கங்கள் தெரிந்து கொள்ளத் தேவையில்லை, எடி படிப்படியாக வேலை செய்கிறது, உங்களுக்காகவும்! * நீங்கள் உங்கள் சொந்த நாக்கில் எடியைப் பயன்படுத்தலாம், ஏனெனில் இது பல மொழிகளில் மொழிபெயர்க்கப்பட்டுள்ளது! * ஒவ்வொரு குழந்தையும் நிரல் செய்யலாம் !! பார்வை சிக்கல்களைக் கொண்ட குழந்தைகளுக்கு எடி குறிப்பாக உதவியாக இருக்கும், ஏனெனில் இது ஒரு சுட்டியின் தேவை இல்லாமல் உங்களுக்கு சத்தமாக பொருட்களைப் படிக்க முடியும். .

# start-sections->[1]->title
source: Teachers about Hedy
ta: எடி பற்றி ஆசிரியர்கள்

# start-sections->[1]->text
source: Various teachers worldwide have expressed their passion for Hedy, as some have shared with us: *Incredibly inspiring! Super good way to make programming a lot more accessible for yourself, but also for students. Very fun to play with and a lot of potential to use with the students. I think it is a very nice tool! I believe this is a valuable way for children to start learning programming. Python and coding have always been very exciting, because the barrier to learning is very high. Now everything is a bit lower and it was explained that it can actually be very easy. I enjoyed seeing how Hedy tries to make programming as accessible as possible for users!* Netherlands: Mathematics teachers in training (secondary school) *Simple interface and good examples.* Teacher: 3rd - 6th grades (elementary) *Multilingual programming and just the gradual programming concept itself.* US: middle school, 6th-8th grade *The gradual nature of introducing programming.* Australia: High school *Continues automatically.* Netherlands: 2 HAVO-VWO *Both that the explanation can be in Dutch (and the code in English), and that it builds up with more and more possibilities.* Netherlands: Plus class group *But Hedy and its gradual levels...what an idea, I wanted to personally thank you for creating this. I cannot thank you enough. Also, I have never seen the level of engagement and enthusiasm of my students, as I have seen with Hedy. We have covered till level 5, and plan to spend one more week on it in classes and labs, before starting Python.* Pakistan *The 'realness' of programming, it resembles how it is in reality.* Netherlands: Plus class group 4 to 8 *Step-by-step activities. Fun activities.* Netherlands: 1e All levels, 2e VWO/HAVO 2e VWO +, 3e HAVO 3e VWO *I really like Hedy very much and it is also nicely set up, which makes it good to use in primary school. Hedy's gradual approach works very well. The short explanation at the beginning of each level and the short example programs help to give the children a quick insight into what is new in the chosen level. The different assignments that the children can choose also work very well. You see the children choose assignments that appeal to them and they then get to work with them, through the levels. Hedy is great fun for children who are good at programming and want to get a taste of a real programming language. It is good preparation for secondary school as soon as more ICT education is given there.* Netherlands: Oegstgeest Montessori school *The construction is so good.* Netherlands: Lower secondary school HAVO-VWO *I can keep the pace of the class.* Netherlands: group 7 en 8 ![Felienne teaching kids](/images/teacherfeedback/Fkids1.JPG) *Felienne teaching kids* ![Kids learning about Hedy](/images/teacherfeedback/Fkids2.JPG) *Kids learning about Hedy*
ta: உலகளவில் பல்வேறு ஆசிரியர்கள் எடி மீதான ஆர்வத்தை வெளிப்படுத்தியுள்ளனர், சிலர் எங்களுடன் பகிர்ந்து கொண்டனர்: *நம்பமுடியாத அளவிற்கு ஊக்கமளிக்கும்! நிரலாக்கத்தை உங்களுக்காக இன்னும் அணுகக்கூடியதாக மாற்றுவதற்கான சூப்பர் நல்ல வழி, ஆனால் மாணவர்களுக்கும். விளையாடுவதற்கு மிகவும் வேடிக்கையாகவும், மாணவர்களுடன் பயன்படுத்த நிறைய சாத்தியங்கள். இது ஒரு நல்ல கருவி என்று நான் நினைக்கிறேன்! குழந்தைகளுக்கு நிரலாக்கத்தைத் தொடங்க இது ஒரு மதிப்புமிக்க வழி என்று நான் நம்புகிறேன். பைதான் மற்றும் குறியீட்டு முறை எப்போதுமே மிகவும் உற்சாகமாக இருந்தன, ஏனென்றால் கற்றலுக்கான தடை மிக அதிகமாக உள்ளது. இப்போது எல்லாம் சற்று குறைவாக உள்ளது, அது உண்மையில் மிகவும் எளிதானது என்று விளக்கப்பட்டது. பயனர்களை முடிந்தவரை அணுகக்கூடியதாக மாற்ற எடி எவ்வாறு முயற்சிக்கிறார் என்பதைப் பார்த்து மகிழ்ந்தேன்!* நெதர்லாந்து: பயிற்சியில் கணித ஆசிரியர்கள் (மேல்நிலைப் பள்ளி) * எளிய இடைமுகம் மற்றும் நல்ல எடுத்துக்காட்டுகள்.* ஆசிரியர்: 3 வது - 6 வது தரங்கள் (தொடக்க) * பன்மொழி நிரலாக்க மற்றும் படிப்படியான நிரலாக்கக் கருத்து.* யு.எச்: நடுநிலைப்பள்ளி, 6 -8 ஆம் வகுப்பு * நிரலாக்கத்தை அறிமுகப்படுத்துவதன் படிப்படியான தன்மை.* ஆச்திரேலியா: உயர்நிலைப்பள்ளி * தானாகவே தொடர்கிறது.* நெதர்லாந்து: 2 HAVO-VWO * விளக்கம் டச்சுக்காரர்களில் (மற்றும் ஆங்கிலத்தில் குறியீடு) இருக்கக்கூடும், மேலும் அது மேலும் மேலும் சாத்தியக்கூறுகளுடன் உருவாகிறது.* நெதர்லாந்து: பிளச் வகுப்பு குழு *ஆனால் எடி மற்றும் அதன் படிப்படியான நிலைகள் ... என்ன ஒரு சிந்தனை, இதை உருவாக்கியதற்கு தனிப்பட்ட முறையில் நன்றி தெரிவிக்க விரும்பினேன். நான் உங்களுக்கு போதுமான நன்றி சொல்ல முடியாது. மேலும், நான் எடியுடன் பார்த்தது போல, எனது மாணவர்களின் மண உறுதி மற்றும் உற்சாகத்தின் அளவை நான் பார்த்ததில்லை. நாங்கள் 5 ஆம் நிலை வரை உள்ளடக்கியுள்ளோம், மேலும் ஒரு வாரத்தை பைத்தானைத் தொடங்குவதற்கு முன்பு வகுப்புகள் மற்றும் ஆய்வகங்களில் செலவிட திட்டமிட்டுள்ளோம்.* பாகிச்தான் * நிரலாக்கத்தின் 'யதார்த்தம்', அது உண்மையில் எப்படி இருக்கிறது என்பதை ஒத்திருக்கிறது.* நெதர்லாந்து: பிளச் வகுப்பு குழு 4 முதல் 8 வரை *படிப்படியான நடவடிக்கைகள். வேடிக்கையான செயல்பாடுகள். *நான் எடியை மிகவும் விரும்புகிறேன், அதுவும் நன்றாக அமைக்கப்பட்டுள்ளது, இது தொடக்கப்பள்ளியில் பயன்படுத்துவது நல்லது. எடியின் படிப்படியான அணுகுமுறை நன்றாக வேலை செய்கிறது. ஒவ்வொரு மட்டத்தின் தொடக்கத்திலும் குறுகிய விளக்கம் மற்றும் குறுகிய எடுத்துக்காட்டு திட்டங்கள் தேர்ந்தெடுக்கப்பட்ட மட்டத்தில் புதியவை குறித்து குழந்தைகளுக்கு விரைவான பார்வையை அளிக்க உதவுகின்றன. குழந்தைகள் தேர்வுசெய்யக்கூடிய வெவ்வேறு பணிகளும் நன்றாக வேலை செய்கின்றன. குழந்தைகள் அவர்களை ஈர்க்கும் பணிகளைத் தேர்ந்தெடுப்பதை நீங்கள் காண்கிறீர்கள், பின்னர் அவர்கள் அவர்களுடன் வேலை செய்கிறார்கள். நிரலாக்கத்தில் நல்ல மற்றும் உண்மையான நிரலாக்க மொழியின் சுவை பெற விரும்பும் குழந்தைகளுக்கு எடி மிகவும் வேடிக்கையாக உள்ளது. ஐ.சி.டி கல்வி வழங்கப்பட்டவுடன் மேல்நிலைப் பள்ளிக்கு இது நல்ல தயாரிப்பு.* நெதர்லாந்து: ஓக்ச்ட்செச்ட் மாண்டிசோரி பள்ளி * கட்டுமானம் மிகவும் நல்லது.* நெதர்லாந்து: கீழ்நிலைப்பள்ளி அவோ-வோவோ * வகுப்பின் வேகத்தை என்னால் வைத்திருக்க முடியும்.* நெதர்லாந்து: குழு 7 என் 8 !

# teacher-guide->[0]->title
source: Introduction
ta: அறிமுகம்

# teacher-guide->[0]->key
source: intro
ta: அறிமுகம்

# teacher-guide->[0]->subsections->[0]->title
source: What's Hedy?
ta: எடி என்ன?
