Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-webpages-*.po
Languages: ta

# teacher-guide->[8]->levels->[16]->sections->[1]->example->error_text
source: After each command that requires indentation, a colon should be used.
ta: உள்தள்ளல் தேவைப்படும் ஒவ்வொரு கட்டளைக்கும் பிறகு, ஒரு பெருங்குடல் பயன்படுத்தப்பட வேண்டும்.

# teacher-guide->[8]->levels->[16]->sections->[1]->example->error_code
source: answer = ask 'How are you doing?' {if} answer {is} 'great' {print} 'Me too!' {elif} answer {is} 'bad' {print} 'Let me cheer you up!' {else} {print} 'Im great!'
ta: பதில் = 'நீங்கள் எப்படி இருக்கிறீர்கள்?' } என்றால்} பதில் {if} 'பெரியது' {elif} 'நானும்!' {print} பதில் {is} 'மோசமானது' {is} 'நான் உன்னை உற்சாகப்படுத்துகிறேன்!' {print} {else} 'நான் பெரியவன்!'

# teacher-guide->[8]->levels->[16]->sections->[1]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[16]->sections->[1]->example->solution_code
source: answer = {ask} 'How are you doing?' {if} answer {is} 'great': {print} 'Me too!' {elif} answer {is} 'bad': {print} 'Let me cheer you up!' {else}: {print} 'Im great!'
ta: பதில் = {ask} 'நீங்கள் எப்படி இருக்கிறீர்கள்?' {if} பதில் {is} 'பெரியது': {print} 'நானும்!' {elif} பதில் {is} 'மோசமானது': {print} 'நான் உன்னை உற்சாகப்படுத்துகிறேன்!' {else}: {print} 'நான் பெரியவன்!'

# teacher-guide->[8]->levels->[17]->sections->[0]->title
source: Students forget to use the brackets
ta: மாணவர்கள் அடைப்புக்குறிகளைப் பயன்படுத்த மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[17]->sections->[0]->example->error_text
source: Students will forget to put brackets around their text.
ta: மாணவர்கள் தங்கள் உரையைச் சுற்றி அடைப்புக்குறிகளை வைக்க மறந்துவிடுவார்கள்.

# teacher-guide->[8]->levels->[17]->sections->[0]->example->error_code
source: {print} 'my name is Hedy!'
ta: {print} 'என் பெயர் எடி!'

# teacher-guide->[8]->levels->[17]->sections->[0]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[17]->sections->[0]->example->solution_code
source: {print}('my name is Hedy!')
ta: {print} ('என் பெயர் எடி!')

# teacher-guide->[8]->levels->[17]->sections->[1]->title
source: Students will still use the ask command
ta: மாணவர்கள் இன்னும் ASK கட்டளையைப் பயன்படுத்துவார்கள்

# teacher-guide->[8]->levels->[17]->sections->[1]->example->error_text
source: The ask command has been used since level 1. So it might be hard for the students to switch to input instead of ask.
ta: நிலை 1 முதல் ASK கட்டளை பயன்படுத்தப்பட்டுள்ளது. எனவே மாணவர்கள் கேட்பதற்கு பதிலாக உள்ளீட்டிற்கு மாறுவது கடினமாக இருக்கலாம்.

# teacher-guide->[8]->levels->[17]->sections->[1]->example->error_code
source: {print}('My name is Hedy!') name = ask('What is your name?') {print}('So your name is ', name)
ta: {print} ('என் பெயர் எடி!') பெயர் = கேளுங்கள் ('உங்கள் பெயர் என்ன?') {print} ('எனவே உங்கள் பெயர்', பெயர்)

# teacher-guide->[8]->levels->[17]->sections->[1]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[17]->sections->[1]->example->solution_code
source: {print}('My name is Hedy!') name = {input}('What is your name?') {print}('So your name is ', name)
ta: {print} ('என் பெயர் எடி!') பெயர் = {input} ('உங்கள் பெயர் என்ன?') {print} ('எனவே உங்கள் பெயர்', பெயர்)

# teacher-guide->[8]->levels->[17]->sections->[2]->title
source: Students might use the brackets as quotation marks
ta: மாணவர்கள் அடைப்புக்குறிகளை மேற்கோள் மதிப்பெண்களாகப் பயன்படுத்தலாம்

# teacher-guide->[8]->levels->[17]->sections->[2]->example->error_text
source: They have learned to keep the variables outside of the quotation marks, so they might do the same with the brackets. Which is not the correct way to use them.
ta: மேற்கோள் மதிப்பெண்களுக்கு வெளியே மாறிகளை வைத்திருக்க அவர்கள் கற்றுக் கொண்டனர், எனவே அவர்கள் அடைப்புக்குறிகளிலும் இதைச் செய்யலாம். அவற்றைப் பயன்படுத்துவதற்கான சரியான வழி இது அல்ல.

# teacher-guide->[8]->levels->[17]->sections->[2]->example->error_code
source: temperature = 25 {print}('It is ') temperature ('degrees outside')
ta: வெப்பநிலை = 25 {print} ('இது') வெப்பநிலை ('டிகிரி வெளியே')

# teacher-guide->[8]->levels->[17]->sections->[2]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[17]->sections->[2]->example->solution_code
source: temperature = 25 {print}('It is ', temperature, 'degrees outside')
ta: வெப்பநிலை = 25 {print} ('இது', வெப்பநிலை, 'டிகிரி வெளியே')

# workbooks->levels->[0]->intro
source: ### Print and input By the end of this lesson, you can: * Write code that prints text * Create a story with input
ta: ### அச்சு மற்றும் உள்ளீடு இந்த பாடத்தின் முடிவில், உங்களால் முடியும்: * உரையை அச்சிடும் குறியீட்டை எழுதுங்கள் * உள்ளீட்டுடன் ஒரு கதையை உருவாக்கவும்

# workbooks->levels->[0]->exercises->[0]->type
source: text
ta: உரை

# workbooks->levels->[0]->exercises->[0]->contents
source: ### Exercises A computer does not just do something by itself. You must always give a computer a task. Such a task is called a command. To print out code, we use the command `print`. ### Printing text On the screen you've just deen the `print` command. A `print` command prints a word, when it's between quotation marks. For example `print hello`. #### Exercise 1: Predict the output
ta: ### பயிற்சிகள் ஒரு கணினி தானாகவே ஏதாவது செய்யாது. நீங்கள் எப்போதும் ஒரு கணினிக்கு ஒரு பணியைக் கொடுக்க வேண்டும். அத்தகைய பணி ஒரு கட்டளை என்று அழைக்கப்படுகிறது. குறியீட்டை அச்சிட, `அச்சு` என்ற கட்டளையைப் பயன்படுத்துகிறோம். ### அச்சிடும் உரை திரையில் நீங்கள் `அச்சு` கட்டளையை உருவாக்கியுள்ளீர்கள். மேற்கோள் குறிகளுக்கு இடையில் இருக்கும்போது ஒரு `அச்சு` கட்டளை ஒரு வார்த்தையை அச்சிடுகிறது. உதாரணமாக `அலோ அச்சு`. #### உடற்பயிற்சி 1: வெளியீட்டைக் கணிக்கவும்

# workbooks->levels->[0]->exercises->[1]->type
source: output
ta: வெளியீடு

# workbooks->levels->[0]->exercises->[1]->code
source: print Hello everybody
ta: அனைவருக்கும் வணக்கம் அச்சிடுங்கள்

# workbooks->levels->[0]->exercises->[1]->answer
source: Hello everybody
ta: அனைவருக்கும் வணக்கம்

# workbooks->levels->[0]->exercises->[2]->type
source: output
ta: வெளியீடு

# workbooks->levels->[0]->exercises->[2]->code
source: print goedemorgen
ta: குட் மார்னிங் அச்சிடுக

# workbooks->levels->[0]->exercises->[2]->answer
source: goedemorgen
ta: காலை வணக்கம்

# workbooks->levels->[0]->exercises->[3]->type
source: text
ta: உரை

# workbooks->levels->[0]->exercises->[3]->contents
source: #### Exercise 2: Error? Sometimes an error sneaks into your code. That's no big deal, but Hedy can't read your code properly then. Which of these programs do you think are wrong?
ta: #### உடற்பயிற்சி 2: பிழை? சில நேரங்களில் ஒரு பிழை உங்கள் குறியீட்டில் பதுங்குகிறது. அது பெரிய விசயமல்ல, ஆனால் எடி உங்கள் குறியீட்டை சரியாகப் படிக்க முடியாது. இந்த திட்டங்களில் எது தவறு என்று நீங்கள் நினைக்கிறீர்கள்?

# workbooks->levels->[0]->exercises->[4]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[0]->exercises->[4]->options->[0]
source: Right
ta: வலது

# workbooks->levels->[0]->exercises->[4]->options->[1]
source: Wrong
ta: தவறு

# workbooks->levels->[0]->exercises->[4]->code
source: prnt Hello everybody!
ta: அனைவருக்கும் prnt வணக்கம்!

# workbooks->levels->[0]->exercises->[4]->answer
source: Wrong
ta: தவறு

# workbooks->levels->[0]->exercises->[5]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[0]->exercises->[5]->options->[0]
source: Right
ta: வலது

# workbooks->levels->[0]->exercises->[5]->options->[1]
source: Wrong
ta: தவறு

# workbooks->levels->[0]->exercises->[5]->code
source: print print
ta: அச்சு அச்சு

# workbooks->levels->[0]->exercises->[5]->answer
source: Right
ta: வலது

# workbooks->levels->[0]->exercises->[6]->type
source: text
ta: உரை

# workbooks->levels->[0]->exercises->[6]->contents
source: ### Asking for input Only text is a bit boring. You can also ask for _input_ in Hedy. Input is text that you give to the computer. The computer remembers that text and can show it to you later. This code shows the question 'What is your name?' ```hedy ask What is your name? ``` ### Showing input The ask command saves the answer, but it doesn't show it yet. For that you'll need the `echo` command. `echo` will show the answer at the end of the sentence. Like this: ```hedy ask what is your name? echo so your name is: ``` If someone called Olivia would use this code, the output would be: ``` so your name is: Olivia ``` Mind that the computer will print the text exactly as you've entered it. So with the colon and the same use of upper- or lowercase letters! #### Exercise 3: Predict the output Predict the output of these programs. Pretend to have filled in your own name.
ta: ### உள்ளீட்டைக் கேட்பது உரை மட்டுமே சற்று சலிப்பை ஏற்படுத்துகிறது. நீங்கள் எடியில் _input_ ஐக் கேட்கலாம். உள்ளீடு என்பது நீங்கள் கணினிக்கு வழங்கும் உரை. கணினி அந்த உரையை நினைவில் வைத்திருக்கிறது, பின்னர் அதை உங்களுக்குக் காண்பிக்க முடியும். இந்த குறியீடு 'உங்கள் பெயர் என்ன?' `` `எடி உங்கள் பெயர் என்ன என்று கேளுங்கள்? `` ` ### உள்ளீட்டைக் காட்டுகிறது கேட்கும் கட்டளை பதிலைச் சேமிக்கிறது, ஆனால் அது இன்னும் காட்டவில்லை. அதற்காக உங்களுக்கு `எதிரொலி` கட்டளை தேவை. `எதிரொலி` வாக்கியத்தின் முடிவில் பதிலைக் காண்பிக்கும். இது போன்றது: `` `எடி உங்கள் பெயர் என்ன என்று கேளுங்கள்? எதிரொலி எனவே உங்கள் பெயர்: `` ` ஒலிவியா என்று அழைக்கப்படும் ஒருவர் இந்த குறியீட்டைப் பயன்படுத்தினால், வெளியீடு இருக்கும்: `` ` எனவே உங்கள் பெயர்: ஒலிவியா `` ` கணினி உரையை உள்ளிட்டபடியே அச்சிடும் என்பதை நினைவில் கொள்ளுங்கள். எனவே பெருங்குடல் மற்றும் மேல் அல்லது சிறிய எழுத்துக்களின் அதே பயன்பாட்டுடன்! #### உடற்பயிற்சி 3: வெளியீட்டைக் கணிக்கவும் இந்த நிரல்களின் வெளியீட்டைக் கணிக்கவும். உங்கள் சொந்த பெயரை நிரப்பியதாக பாசாங்கு.

# workbooks->levels->[0]->exercises->[7]->type
source: output
ta: வெளியீடு

# workbooks->levels->[0]->exercises->[7]->code
source: ask what is your name? echo so your name is:
ta: உங்கள் பெயர் என்ன என்று கேளுங்கள்? எதிரொலி எனவே உங்கள் பெயர்:

# workbooks->levels->[0]->exercises->[7]->answer
source: so your name is: **name**
ta: எனவே உங்கள் பெயர்: ** பெயர் **

# workbooks->levels->[0]->exercises->[8]->type
source: output
ta: வெளியீடு

# workbooks->levels->[0]->exercises->[8]->code
source: ask What is your name? echo Nice to meet you,
ta: உங்கள் பெயர் என்ன என்று கேளுங்கள்? உங்களை சந்தித்ததில் மகிழ்ச்சி,

# workbooks->levels->[0]->exercises->[8]->answer
source: Nice to meet you, **name**
ta: உங்களை சந்தித்ததில் மகிழ்ச்சி, ** பெயர் **

# workbooks->levels->[0]->exercises->[9]->type
source: text
ta: உரை

# workbooks->levels->[0]->exercises->[9]->contents
source: #### Exercise 4: Programming words Every lesson we are going to learn new words, including this lesson. Do you know what these terms mean? Explain it from your own words.
ta: #### உடற்பயிற்சி 4: நிரலாக்க சொற்கள் இந்த பாடம் உட்பட புதிய சொற்களைக் கற்றுக்கொள்ளப் போகும் ஒவ்வொரு பாடமும். இந்த விதிமுறைகள் என்ன என்று உங்களுக்குத் தெரியுமா? அதை உங்கள் சொந்த வார்த்தைகளிலிருந்து விளக்குங்கள்.

# workbooks->levels->[0]->exercises->[10]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[0]->exercises->[10]->word
source: command
ta: கட்டளை

# workbooks->levels->[0]->exercises->[10]->answer
source: A task you'll give to the computer, e.g. print.
ta: கணினிக்கு நீங்கள் கொடுக்கும் ஒரு பணி, எ.கா. அச்சிடுக.

# workbooks->levels->[0]->exercises->[11]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[0]->exercises->[11]->word
source: input
ta: உள்ளீடு

# workbooks->levels->[0]->exercises->[11]->answer
source: What you type into the computer when Hedy shows an ask screen
ta: எடி ஒரு கேட்கும் திரையைக் காண்பிக்கும் போது நீங்கள் கணினியில் தட்டச்சு செய்க

# workbooks->levels->[0]->exercises->[12]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[0]->exercises->[12]->word
source: output
ta: வெளியீடு

# workbooks->levels->[0]->exercises->[12]->answer
source: What Hedy shows in the right screen after you've pressed the 'run code' button.
ta: நீங்கள் 'ரன் கோட்' பொத்தானை அழுத்திய பின் சரியான திரையில் என்ன எடி.

# workbooks->levels->[0]->exercises->[13]->type
source: text
ta: உரை

# workbooks->levels->[0]->exercises->[13]->contents
source: #### Exercise 5: Commands We have learned 3 commands so far: `print`, `ask` and `echo`. What so they do? Explain in your own words.
ta: #### உடற்பயிற்சி 5: கட்டளைகள் நாங்கள் இதுவரை 3 கட்டளைகளைக் கற்றுக்கொண்டோம்: `அச்சு`,` கேளுங்கள்` மற்றும் `எதிரொலி`. அவர்கள் என்ன செய்கிறார்கள்? உங்கள் சொந்த வார்த்தைகளில் விளக்குங்கள்.

# workbooks->levels->[0]->exercises->[14]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[0]->exercises->[14]->word
source: the `print` command
ta: `அச்சு` கட்டளை

# workbooks->levels->[0]->exercises->[14]->answer
source: Shows text on the screen.
ta: திரையில் உரையைக் காட்டுகிறது.

# workbooks->levels->[0]->exercises->[15]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[0]->exercises->[15]->word
source: the `ask` command
ta: `கேளுங்கள்` கட்டளை

# workbooks->levels->[0]->exercises->[15]->answer
source: Asks the user for input.
ta: பயனரிடம் உள்ளீடு கேட்கிறது.

# workbooks->levels->[0]->exercises->[16]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[0]->exercises->[16]->word
source: the `echo` command
ta: `எதிரொலி` கட்டளை

# workbooks->levels->[0]->exercises->[16]->answer
source: Repeats the user's input.
ta: பயனரின் உள்ளீட்டை மீண்டும் செய்கிறது.

# workbooks->levels->[1]->intro
source: ### Variables By the end of this lesson, you can: * Save something in a variable * Create a story or drawing using variables
ta: ### மாறிகள் இந்த பாடத்தின் முடிவில், உங்களால் முடியும்: * ஒரு மாறியில் எதையாவது சேமிக்கவும் * மாறிகளைப் பயன்படுத்தி ஒரு கதை அல்லது வரைபடத்தை உருவாக்கவும்

# workbooks->levels->[1]->exercises->[0]->type
source: text
ta: உரை

# workbooks->levels->[1]->exercises->[0]->contents
source: ### Using variables You've just seen the `is` command on the screen. An `is` command saves something in the computer memory and gives it a name. We call this a variable. What is saved in the variable is calles the value of the variable.
ta: ### மாறிகளைப் பயன்படுத்துதல் திரையில் `இச்` கட்டளையை நீங்கள் பார்த்திருக்கிறீர்கள். ஒரு `என்பது கட்டளை கணினி நினைவகத்தில் ஏதாவது சேமித்து அதற்கு ஒரு பெயரைக் கொடுக்கிறது. இதை நாங்கள் ஒரு மாறி என்று அழைக்கிறோம். மாறியில் சேமிக்கப்படுவது மாறியின் மதிப்பை அழைக்கிறது.

# workbooks->levels->[1]->exercises->[0]->code
source: name is Mo print name
ta: பெயர் மோ பெயரை அச்சிடுக

# workbooks->levels->[1]->exercises->[1]->type
source: text
ta: உரை

# workbooks->levels->[1]->exercises->[1]->contents
source: #### Exercise 1: Mark the correct piece of the code
ta: #### உடற்பயிற்சி 1: குறியீட்டின் சரியான பகுதியைக் குறிக்கவும்

# workbooks->levels->[1]->exercises->[2]->type
source: circle
ta: வட்டம்

# workbooks->levels->[1]->exercises->[2]->goal
source: variables
ta: மாறிகள்

# workbooks->levels->[1]->exercises->[2]->code
source: name is Hedy print Hello name age is 17 print You are age years old
ta: பெயர் எடி அலோ பெயரை அச்சிடுக அகவை 17 உங்களுக்கு அகவை அகவை

# workbooks->levels->[1]->exercises->[2]->answer
source: On all lines
ta: எல்லா வரிகளிலும்

# workbooks->levels->[1]->exercises->[3]->type
source: circle
ta: வட்டம்

# workbooks->levels->[1]->exercises->[3]->goal
source: places where the variable is **being set**
ta: மாறி ** அமைக்கப்பட்ட இடங்கள் **

# workbooks->levels->[1]->exercises->[3]->code
source: name is Hedy print Hello name age is 17 print You are age years old
ta: பெயர் எடி அலோ பெயரை அச்சிடுக அகவை 17 உங்களுக்கு அகவை அகவை

# workbooks->levels->[1]->exercises->[3]->answer
source: Line 1 & 3
ta: வரி 1 & 3

# workbooks->levels->[1]->exercises->[4]->type
source: circle
ta: வட்டம்

# workbooks->levels->[1]->exercises->[4]->goal
source: places where the variables are **being used**
ta: மாறிகள் ** பயன்படுத்தப்படும் இடங்கள் **

# workbooks->levels->[1]->exercises->[4]->code
source: name is Hedy print Hello name age is 17 print You are age years old
ta: பெயர் எடி அலோ பெயரை அச்சிடுக அகவை 17 உங்களுக்கு அகவை அகவை

# workbooks->levels->[1]->exercises->[4]->answer
source: Line 2 and 4
ta: வரி 2 மற்றும் 4

# workbooks->levels->[1]->exercises->[5]->type
source: text
ta: உரை

# workbooks->levels->[1]->exercises->[5]->contents
source: #### Exercise 2: Predict the output Tip: Are you having a hard time predicting the output? Follow these steps: 1. Mark the place where a variable is being set 2. Mark the place where a variable is being used 3. Draw a line between these two places 4. Write the value (what comes after `is`) in the place where the variable is being used.
ta: #### உடற்பயிற்சி 2: வெளியீட்டைக் கணிக்கவும் உதவிக்குறிப்பு: வெளியீட்டைக் கணிக்க உங்களுக்கு சிரமப்படுகிறீர்களா? இந்த படிகளைப் பின்பற்றவும்: 1. ஒரு மாறி அமைக்கப்பட்ட இடத்தைக் குறிக்கவும் 2. ஒரு மாறி பயன்படுத்தப்படும் இடத்தைக் குறிக்கவும் 3. இந்த இரண்டு இடங்களுக்கிடையில் ஒரு கோட்டை வரையவும் 4. மாறி பயன்படுத்தப்படும் இடத்தில் மதிப்பை (`ஐ.எச்` க்குப் பிறகு என்ன) எழுதுங்கள்.

# workbooks->levels->[1]->exercises->[6]->type
source: output
ta: வெளியீடு

# workbooks->levels->[1]->exercises->[6]->code
source: name is Mo print Great job name!
ta: பெயர் மோ சிறந்த வேலை பெயரை அச்சிடுங்கள்!

# workbooks->levels->[1]->exercises->[6]->answer
source: Great job Mo!
ta: பெரிய வேலை மோ!

# workbooks->levels->[1]->exercises->[7]->type
source: output
ta: வெளியீடு

# workbooks->levels->[1]->exercises->[7]->code
source: name is Mo print Great job Mo!
ta: பெயர் மோ அச்சிடுக Great பணி Mo!

# workbooks->levels->[1]->exercises->[7]->answer
source: Great job Mo!
ta: பெரிய வேலை மோ!

# workbooks->levels->[1]->exercises->[8]->type
source: output
ta: வெளியீடு

# workbooks->levels->[1]->exercises->[8]->code
source: first_name is Layla print Goodmorning first_name!
ta: first_name என்பது லயலா first_name ஐ அச்சிடுக!

# workbooks->levels->[1]->exercises->[8]->answer
source: Goodmorning Layla!
ta: குட்மார்னிங் லயலா!

# workbooks->levels->[1]->exercises->[9]->type
source: text
ta: உரை

# workbooks->levels->[1]->exercises->[9]->contents
source: #### Exercise 3: Error? Read the programs carefully. Which ones are correct?
ta: #### உடற்பயிற்சி 3: பிழை? நிரல்களை கவனமாகப் படியுங்கள். எது சரியானது?

# workbooks->levels->[1]->exercises->[10]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[1]->exercises->[10]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[1]->exercises->[10]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[1]->exercises->[10]->code
source: surname is Johnson print Goodmorning surname!
ta: குடும்பப்பெயர் சான்சன் குட்மார்னிங் குடும்பப்பெயரை அச்சிடுங்கள்!

# workbooks->levels->[1]->exercises->[10]->answer
source: Correct
ta: சரியான

# workbooks->levels->[1]->exercises->[11]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[1]->exercises->[11]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[1]->exercises->[11]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[1]->exercises->[11]->code
source: name is print Goodmorning, name!
ta: பெயர் குட்மார்னிங் அச்சிடுக, பெயர்!

# workbooks->levels->[1]->exercises->[11]->answer
source: Incorrect. Name is not set.
ta: தவறானது. பெயர் அமைக்கப்படவில்லை.

# workbooks->levels->[1]->exercises->[12]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[1]->exercises->[12]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[1]->exercises->[12]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[1]->exercises->[12]->code
source: name is Johnson print Goodmorning mr name! print Hello mr name!
ta: பெயர் சான்சன் நல்ல திரு பெயரை அச்சிடுங்கள்! அலோ திரு பெயர் அச்சிடுக!

# workbooks->levels->[1]->exercises->[12]->answer
source: Correct. You are allowed to use a variable multiple times.
ta: சரியானது. ஒரு மாறியை பல முறை பயன்படுத்த அனுமதிக்கப்படுகிறீர்கள்.

# workbooks->levels->[1]->exercises->[13]->type
source: text
ta: உரை

# workbooks->levels->[1]->exercises->[13]->contents
source: ### Asking for input Just saving text isn't very useful. In level 1 we've seen the code `ask`. From now on you are allowed to combine `ask` with `is`, like this:
ta: ### உள்ளீட்டைக் கேட்பது உரையைச் சேமிப்பது மிகவும் பயனுள்ளதாக இல்லை. நிலை 1 இல் `கேளுங்கள்` குறியீட்டைக் கண்டோம். இனிமேல் நீங்கள் `கேளுங்கள் '` ஐ.எச். உடன் இணைக்க அனுமதிக்கப்படுகிறீர்கள், இது போன்றது:

# workbooks->levels->[1]->exercises->[13]->code
source: name is ask What is your name?
ta: பெயர் உங்கள் பெயர் என்ன என்று கேளுங்கள்?

# workbooks->levels->[1]->exercises->[14]->type
source: text
ta: உரை

# workbooks->levels->[1]->exercises->[14]->contents
source: ### Showing input With variables, we do not need `echo` anymore. Just use `print` to show the answer.
ta: ### உள்ளீட்டைக் காட்டுகிறது மாறிகள் மூலம், எங்களுக்கு இனி `எதிரொலி` தேவையில்லை. பதிலைக் காட்ட `அச்சு` ஐப் பயன்படுத்தவும்.

# workbooks->levels->[1]->exercises->[14]->code
source: name is ask What is your name? print so you are called: name
ta: பெயர் உங்கள் பெயர் என்ன என்று கேளுங்கள்? அச்சிடுங்கள், எனவே நீங்கள் அழைக்கப்படுகிறீர்கள்: பெயர்

# workbooks->levels->[1]->exercises->[15]->type
source: text
ta: உரை

# workbooks->levels->[1]->exercises->[15]->contents
source: If someone called Olivia would use this code, the output would be: `so you are called: Olivia` #### Exercise 4: Predict the output Predict these programs' output. Pretend to have used your own name.
ta: ஒலிவியா என்று அழைக்கப்படும் ஒருவர் இந்த குறியீட்டைப் பயன்படுத்தினால், வெளியீடு இருக்கும்: `எனவே நீங்கள் அழைக்கப்படுகிறீர்கள்: ஒலிவியா` #### உடற்பயிற்சி 4: வெளியீட்டைக் கணிக்கவும் இந்த நிரல்களின் வெளியீட்டைக் கணிக்கவும். உங்கள் சொந்த பெயரைப் பயன்படுத்தியதாக பாசாங்கு.

# workbooks->levels->[1]->exercises->[16]->type
source: output
ta: வெளியீடு

# workbooks->levels->[1]->exercises->[16]->code
source: name is ask What is your name? print so you are called: name
ta: பெயர் உங்கள் பெயர் என்ன என்று கேளுங்கள்? அச்சிடுங்கள், எனவே நீங்கள் அழைக்கப்படுகிறீர்கள்: பெயர்

# workbooks->levels->[1]->exercises->[16]->answer
source: so you are called: **name**
ta: எனவே நீங்கள் அழைக்கப்படுகிறீர்கள்: ** பெயர் **

# workbooks->levels->[1]->exercises->[17]->type
source: output
ta: வெளியீடு

# workbooks->levels->[1]->exercises->[17]->code
source: mood is ask How are you doing today? print So you are feeling mood today
ta: மனநிலை கேட்கிறது நீங்கள் இன்று எப்படி இருக்கிறீர்கள்? அச்சிடுங்கள், எனவே நீங்கள் இன்று மனநிலையை உணர்கிறீர்கள்

# workbooks->levels->[1]->exercises->[17]->answer
source: So you are feeling **mood** today
ta: எனவே நீங்கள் இன்று ** மனநிலை ** உணர்கிறீர்கள்

# workbooks->levels->[1]->exercises->[18]->type
source: text
ta: உரை

# workbooks->levels->[1]->exercises->[18]->contents
source: #### Exercise 5: Programming words We have learned some new words this level! Explain them in your own words.
ta: #### உடற்பயிற்சி 5: நிரலாக்க சொற்கள் இந்த மட்டத்தில் சில புதிய சொற்களைக் கற்றுக்கொண்டோம்! அவற்றை உங்கள் சொந்த வார்த்தைகளில் விளக்குங்கள்.

# workbooks->levels->[1]->exercises->[19]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[1]->exercises->[19]->word
source: variable
ta: மாறக்கூடிய

# workbooks->levels->[1]->exercises->[19]->answer
source: A name you give something, like a surname or an age.
ta: நீங்கள் ஒரு குடும்பப்பெயர் அல்லது அகவை போன்ற ஏதாவது கொடுக்கிறீர்கள்.

# workbooks->levels->[1]->exercises->[20]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[1]->exercises->[20]->word
source: value
ta: மதிப்பு

# workbooks->levels->[1]->exercises->[20]->answer
source: What is saved in a variable, like Andrew or 12.
ta: ஆண்ட்ரூ அல்லது 12 போன்ற ஒரு மாறியில் சேமிக்கப்படுகிறது.

# workbooks->levels->[1]->exercises->[21]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[1]->exercises->[21]->word
source: setting
ta: அமைத்தல்

# workbooks->levels->[1]->exercises->[21]->answer
source: You can set a variable with an `is` command
ta: நீங்கள் ஒரு `ஐஎச்` கட்டளையுடன் ஒரு மாறியை அமைக்கலாம்

# workbooks->levels->[1]->exercises->[22]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[1]->exercises->[22]->word
source: interactive
ta: ஊடாடும்
