Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-webpages-*.po
Languages: ta

# teacher-guide->[2]->subsections->[5]->text
source: To add students to your class go to the class page by clicking in the class name on the 'for teachers' page. Then click 'add students'. There are 2 ways to let your students join your class: You can create accounts for them, or they could create their own accounts. **You create accounts for your students** The easiest way to add students to your class is by creating an account for them. This can be done by clicking the 'create student accounts' button and filling in the usernames and passwords for them. The students can login with the username and password that you chose. Afterwards, they can change their username or password if they'd like and they'll still remain in your class. This <a href="https://www.youtube.com/watch?v=eEQvik-Ce5M" target="_blank">video</a> shows how to add students to your class in the quickest and easiest way. **Students make their own accounts** Your students can also go to the Hedy website and create their own accounts, just like you did. To get them into your class, they simply have to click the invite link. You can find the invite link on the class page and send it to your students. Mind that your students have to be logged in to Hedy when they click the link, in order to make it work smoothly. You can also manually invite a student to your class with the button 'Invite by username'.
ta: உங்கள் வகுப்பில் மாணவர்களைச் சேர்க்க, 'ஆசிரியர்களுக்காக' பக்கத்தில் வகுப்பு பெயரைக் சொடுக்கு செய்வதன் மூலம் வகுப்பு பக்கத்திற்குச் செல்லவும். பின்னர் 'மாணவர்களைச் சேர்' என்பதைக் சொடுக்கு செய்க. உங்கள் வகுப்பில் உங்கள் வகுப்பில் சேர 2 வழிகள் உள்ளன: நீங்கள் அவர்களுக்கான கணக்குகளை உருவாக்கலாம், அல்லது அவர்கள் தங்கள் சொந்த கணக்குகளை உருவாக்கலாம். ** உங்கள் மாணவர்களுக்கு கணக்குகளை உருவாக்குகிறீர்கள் ** உங்கள் வகுப்பில் மாணவர்களைச் சேர்ப்பதற்கான எளிதான வழி, அவர்களுக்கு ஒரு கணக்கை உருவாக்குவதன் மூலம். 'மாணவர் கணக்குகளை உருவாக்கு' பொத்தானைக் சொடுக்கு செய்து அவற்றுக்கான பயனர்பெயர்கள் மற்றும் கடவுச்சொற்களை நிரப்புவதன் மூலம் இதைச் செய்யலாம். நீங்கள் தேர்ந்தெடுத்த பயனர்பெயர் மற்றும் கடவுச்சொல்லுடன் மாணவர்கள் உள்நுழையலாம். பின்னர், அவர்கள் விரும்பினால் அவர்கள் பயனர்பெயர் அல்லது கடவுச்சொல்லை மாற்றலாம், மேலும் அவர்கள் உங்கள் வகுப்பில் இருப்பார்கள். இந்த <a href = "https://www.youtube.com/watch?v=eeqvik-ce5m" இலக்கு = "_ வெற்று"> வீடியோ </a> உங்கள் வகுப்பில் மாணவர்களை விரைவான மற்றும் எளிதான வழியில் எவ்வாறு சேர்ப்பது என்பதைக் காட்டுகிறது. ** மாணவர்கள் தங்கள் சொந்த கணக்குகளை உருவாக்குகிறார்கள் ** உங்கள் மாணவர்கள் எடி வலைத்தளத்திற்குச் சென்று நீங்கள் செய்ததைப் போலவே அவர்களின் சொந்த கணக்குகளையும் உருவாக்கலாம். அவற்றை உங்கள் வகுப்பில் சேர்ப்பதற்கு, அவர்கள் அழைப்பிதழ் இணைப்பைக் சொடுக்கு செய்ய வேண்டும். நீங்கள் வகுப்பு பக்கத்தில் அழைப்பிதழ் இணைப்பைக் கண்டுபிடித்து உங்கள் மாணவர்களுக்கு அனுப்பலாம். உங்கள் மாணவர்கள் இணைப்பைக் சொடுக்கு செய்யும் போது, ​​அது சீராக செயல்படும்படி, அவர்கள் இணைப்பைக் சொடுக்கு செய்யும்போது உள்நுழைய வேண்டும் என்பதை நினைவில் கொள்ளுங்கள். 'பயனர்பெயர் மூலம் அழைப்பிதழ்' என்ற பொத்தானைக் கொண்டு உங்கள் வகுப்பிற்கு ஒரு மாணவரை கைமுறையாக அழைக்கலாம்.

# teacher-guide->[2]->subsections->[6]->title
source: Setting preferred language
ta: விருப்பமான மொழியை அமைத்தல்

# teacher-guide->[2]->subsections->[6]->text
source: When students create profiles they are supposed to choose a 'preferred language'. Hedy will always be loaded in this selected language. Changing this language can always be done later on by navigating to 'My account' and 'My personal settings' again. **For non-English speakers** Not only can you change the language of the adventures to your own language. You can also choose which language the keywords (for example 'print' or 'ask') should be in. This way you can teach your students to code with English keywords, but you can also let them program in their own language. For example, Dutch students can use the command 'vraag' instead of 'ask'. If a student wants to switch languages, they can click the keyword switcher. It will switch the keywords from English to the preferred language and back. Fun fact! Students are allowed program in both English and their own language at the same time! So, if they have trouble remembering some keywords in English, but easily remember other ones they can use both at the same time. <img src="https://github.com/hedyorg/hedy/assets/80678586/0b3122e6-ff22-43d7-b8b6-62f47f485293" width="100"> **Video** This <a href="https://www.youtube.com/watch?v=QrVZETj4oLM" target="_blank">video</a> show you how to set a preferred language and change the keywords to you preferred language as well.
ta: மாணவர்கள் சுயவிவரங்களை உருவாக்கும்போது அவர்கள் 'விருப்பமான மொழியை' தேர்வு செய்ய வேண்டும். தேர்ந்தெடுக்கப்பட்ட இந்த மொழியில் எடி எப்போதும் ஏற்றப்படும். இந்த மொழியை மாற்றுவது எப்போதும் 'எனது கணக்கு' மற்றும் 'எனது தனிப்பட்ட அமைப்புகள்' ஆகியவற்றிற்கு செல்லுவதன் மூலம் பின்னர் செய்ய முடியும். ** ஆங்கிலம் அல்லாத பேச்சாளர்களுக்கு ** சாகசங்களின் மொழியை உங்கள் சொந்த மொழிக்கு மாற்றுவது மட்டுமல்ல. எந்த மொழியில் முக்கிய வார்த்தைகள் (எடுத்துக்காட்டாக 'அச்சு' அல்லது 'கேளுங்கள்') இருக்க வேண்டும் என்பதையும் நீங்கள் தேர்வு செய்யலாம். இந்த வழியில் நீங்கள் உங்கள் மாணவர்களுக்கு ஆங்கிலச் சொற்களுடன் குறியிட கற்றுக் கொடுக்கலாம், ஆனால் நீங்கள் அவர்களை தங்கள் சொந்த மொழியில் நிரல் செய்ய அனுமதிக்கலாம். எடுத்துக்காட்டாக, டச்சு மாணவர்கள் 'கேளுங்கள்' என்பதற்கு பதிலாக 'வ்ராக்' கட்டளையைப் பயன்படுத்தலாம். ஒரு மாணவர் மொழிகளை மாற்ற விரும்பினால், அவர்கள் முக்கிய ச்விட்சரைக் சொடுக்கு செய்யலாம். இது முக்கிய வார்த்தைகளை ஆங்கிலத்திலிருந்து விருப்பமான மொழிக்கு மாற்றும். வேடிக்கையான உண்மை! ஒரே நேரத்தில் ஆங்கிலம் மற்றும் அவர்களின் சொந்த மொழி இரண்டிலும் மாணவர்கள் அனுமதிக்கப்படுகிறார்கள்! எனவே, ஆங்கிலத்தில் சில முக்கிய வார்த்தைகளை நினைவில் கொள்வதில் அவர்களுக்கு சிக்கல் இருந்தால், ஆனால் மற்றவற்றை எளிதாக நினைவில் கொள்ளுங்கள், அவை இரண்டையும் ஒரே நேரத்தில் பயன்படுத்தலாம். <img src = "https://github.com/hdedurg/hedy/assets/80678586/0b3122e6-ff22-43D7-B8B6-62F47F485293" அகலம் = "100"> ** வீடியோ ** இந்த <a href = "https://www.youtube.com/watch?v=qrvzetj4olm" இலக்கு = "_ வெற்று"> வீடியோ </a> விருப்பமான மொழியை எவ்வாறு அமைப்பது மற்றும் முக்கிய சொற்களை உங்களுக்கு விருப்பமான மொழியாக மாற்றுவது என்பதைக் காட்டுங்கள் நன்றாக.

# teacher-guide->[2]->subsections->[7]->title
source: Storing programs
ta: நிரல்களை சேமித்தல்

# teacher-guide->[2]->subsections->[7]->text
source: When you are logged in, you'll see My programs next to your profile icon. This option exists for your students too. In My programs you can find all the programs that you've worked on. By default, programs will be saved to 'My programs' when you run the code, and every 10 seconds, under their default name and their level (for example: Story 5). If you want to store a program under a new name, just type the new name in the name bar. Currently, only one program can be saved per level, per tab. You (and your students) can also share programs using the share button next to program names. These programs will be posted on our <a href="https://hedy.org/explore" target="_blank">explore page</a>, for everybody to see and use. If you want to unshare your program, go to 'My programs' and click 'Unshare'. The paper plane icon can be used to hand in programs to the teacher of a class. Programs that have been handed is will no longer be editable.
ta: நீங்கள் உள்நுழையும்போது, ​​உங்கள் சுயவிவர ஐகானுக்கு அடுத்ததாக எனது நிரல்களைக் காண்பீர்கள். இந்த விருப்பம் உங்கள் மாணவர்களுக்கும் உள்ளது. எனது நிரல்களில் நீங்கள் பணிபுரிந்த அனைத்து நிரல்களையும் காணலாம். இயல்பாக, நீங்கள் குறியீட்டை இயக்கும்போது நிரல்கள் 'எனது நிரல்களில்' சேமிக்கப்படும், ஒவ்வொரு 10 விநாடிகளிலும், அவற்றின் இயல்புநிலை பெயரில் மற்றும் அவற்றின் நிலை (எடுத்துக்காட்டாக: கதை 5). நீங்கள் ஒரு புதிய பெயரில் ஒரு நிரலை சேமிக்க விரும்பினால், புதிய பெயரை பெயர் பட்டியில் தட்டச்சு செய்க. தற்போது, ​​ஒரு தாவலுக்கு ஒரு நிலைக்கு மட்டுமே சேமிக்க முடியும். நிரல் பெயர்களுக்கு அடுத்த பங்கு பொத்தானைப் பயன்படுத்தி நீங்கள் (மற்றும் உங்கள் மாணவர்கள்) நிரல்களைப் பகிரலாம். இந்த திட்டங்கள் எங்கள் <a href = "https://hedy.org/explore" இலக்கு = "_ வெற்று"> பக்கத்தை ஆராயவும் </a>, எல்லோரும் பார்க்கவும் பயன்படுத்தவும் வெளியிடப்படும். உங்கள் நிரலை வடிவமைக்க விரும்பினால், 'எனது நிரல்களுக்கு' சென்று 'சேர்' என்பதைக் சொடுக்கு செய்க. காகித விமான படவுரு ஒரு வகுப்பின் ஆசிரியரிடம் நிரல்களை ஒப்படைக்க பயன்படுத்தப்படலாம். ஒப்படைக்கப்பட்ட திட்டங்கள் இனி திருத்தப்படாது.

# teacher-guide->[3]->title
source: Teaching with Hedy
ta: எடியுடன் கற்பித்தல்

# teacher-guide->[3]->key
source: teaching
ta: கற்பித்தல்

# teacher-guide->[3]->subsections->[0]->title
source: Teaching with Hedy
ta: எடியுடன் கற்பித்தல்

# teacher-guide->[3]->subsections->[0]->text
source: Hedy contains a lot of different levels that each teach a different new skill. We recommend to teach one level per lesson. This gives your students the time to fully grasp a new command or concept and practice with it, before moving on to the next level. We use this structure in our lessons: Introduction, New concepts and commands, let's get to work, puzzles and quizzes.
ta: ஒவ்வொன்றும் வெவ்வேறு புதிய திறனைக் கற்பிக்கும் பல்வேறு நிலைகள் எடி. பாடத்திற்கு ஒரு நிலை கற்பிக்க பரிந்துரைக்கிறோம். இது உங்கள் மாணவர்களுக்கு ஒரு புதிய கட்டளை அல்லது கருத்தை முழுமையாகப் புரிந்துகொள்வதற்கும், அதனுடன் பயிற்சியையும், அடுத்த கட்டத்திற்குச் செல்வதற்கு முன், அதைக் கொண்டுள்ளது. இந்த கட்டமைப்பை எங்கள் பாடங்களில் பயன்படுத்துகிறோம்: அறிமுகம், புதிய கருத்துக்கள் மற்றும் கட்டளைகள், வேலைக்குச் செல்வோம், புதிர்கள் மற்றும் நொடி வினாக்கள்.

# teacher-guide->[3]->subsections->[1]->title
source: Slides
ta: ச்லைடுகள்

# teacher-guide->[3]->subsections->[1]->text
source: When giving instructions you might want to use our slides. Our slides are available on the 'For teachers' page. There is a set of slides for each level. In the slides all the new commands for that level are explained. We have aimed to explain why these changes are nessecary or how the new commands come in handy. We also give some examples of how the new commands can be used. You could of course also use your own slides, or just open Hedy and show your students around the website. Whichever you prefer to give the best Hedy lessons!
ta: வழிமுறைகளை வழங்கும்போது நீங்கள் எங்கள் ச்லைடுகளைப் பயன்படுத்த விரும்பலாம். எங்கள் ச்லைடுகள் 'ஆசிரியர்களுக்காக' பக்கத்தில் கிடைக்கின்றன. ஒவ்வொரு நிலைக்கும் ச்லைடுகளின் தொகுப்பு உள்ளது. ச்லைடுகளில் அந்த நிலைக்கான அனைத்து புதிய கட்டளைகளும் விளக்கப்பட்டுள்ளன. இந்த மாற்றங்கள் ஏன் நெச்செசரி அல்லது புதிய கட்டளைகள் எவ்வாறு கைக்குள் வருகின்றன என்பதை விளக்குவதை நோக்கமாகக் கொண்டுள்ளோம். புதிய கட்டளைகளை எவ்வாறு பயன்படுத்தலாம் என்பதற்கான சில எடுத்துக்காட்டுகளையும் நாங்கள் தருகிறோம். நீங்கள் நிச்சயமாக உங்கள் சொந்த ச்லைடுகளையும் பயன்படுத்தலாம், அல்லது எடியைத் திறந்து உங்கள் மாணவர்களை வலைத்தளத்தைச் சுற்றி காட்டலாம். சிறந்த எடி பாடங்களை நீங்கள் எதை விரும்புகிறீர்கள்!

# teacher-guide->[3]->subsections->[2]->title
source: Introduction
ta: அறிமுகம்

# teacher-guide->[3]->subsections->[2]->text
source: You can start your lessons by activating your students' prior knowledge: What do they already know about the subject, what did they learn in the previous lesson and which mistakes did they make that they've now learned from? This way all the previously learned commands and frequently made mistakes are fresh in your students' memories, when you start introducing the new lesson.
ta: உங்கள் மாணவர்களின் முன் அறிவை செயல்படுத்துவதன் மூலம் உங்கள் பாடங்களைத் தொடங்கலாம்: இந்த விசயத்தைப் பற்றி அவர்களுக்கு ஏற்கனவே என்ன தெரியும், முந்தைய பாடத்தில் அவர்கள் என்ன கற்றுக்கொண்டார்கள், இப்போது அவர்கள் கற்றுக்கொண்ட தவறுகளைச் செய்தார்கள்? இந்த வழியில் முன்னர் கற்றுக்கொண்ட அனைத்து கட்டளைகளும், அடிக்கடி செய்த தவறுகளும் உங்கள் மாணவர்களின் நினைவுகளில் புதியவை, நீங்கள் புதிய பாடத்தை அறிமுகப்படுத்தத் தொடங்கும் போது.

# teacher-guide->[3]->subsections->[3]->title
source: Introduction of new concepts and commands
ta: புதிய கருத்துகள் மற்றும் கட்டளைகளின் அறிமுகம்

# teacher-guide->[3]->subsections->[3]->text
source: The new concepts and commands can be very hard for some students to fully understand. That's why it's of importance to model the proper use of the new commands to your students. Especially in the lower levels, where some students have no experience with programming at all, it can be hard for them to understand the new abstract concepts. Showing a lot of examples makes an abstract concept (for instance: 'What is a variable?') more recognizable and easier to understand ('Look, the variable pet changed into dog'). Our slides could help you with that.
ta: புதிய கருத்துகள் மற்றும் கட்டளைகள் சில மாணவர்களுக்கு முழுமையாக புரிந்து கொள்ள மிகவும் கடினமாக இருக்கும். அதனால்தான் உங்கள் மாணவர்களுக்கு புதிய கட்டளைகளை முறையாகப் பயன்படுத்துவது முக்கியத்துவம் வாய்ந்தது. குறிப்பாக கீழ் மட்டங்களில், சில மாணவர்களுக்கு நிரலாக்கத்தில் பட்டறிவு இல்லாத இடத்தில், புதிய சுருக்கக் கருத்துகளைப் புரிந்துகொள்வது அவர்களுக்கு கடினமாக இருக்கும். நிறைய எடுத்துக்காட்டுகளைக் காண்பிப்பது ஒரு சுருக்கமான கருத்தை உருவாக்குகிறது (உதாரணமாக: 'ஒரு மாறி என்றால் என்ன?') மிகவும் அடையாளம் காணக்கூடியது மற்றும் புரிந்துகொள்ள எளிதானது ('பார், மாறி செல்லப்பிராணி நாயாக மாற்றப்பட்டது'). எங்கள் ச்லைடுகள் உங்களுக்கு உதவக்கூடும்.

# teacher-guide->[3]->subsections->[4]->title
source: Let's get to work
ta: வேலைக்கு வருவோம்

# teacher-guide->[3]->subsections->[4]->text
source: Each level contains different adventures that you can find in the pink tabs. The first pink tab explains the new commands in this level. The following tabs are adventures that the students can try out and make their own. The adventures are arranged from easiest to hardest, so we recommend to start on the left and your your way to the right. The last tab 'what's next' gives a little teaser of what you'll learn in the next level. Of course, you can select the adventures you want your students to do for each level. They don't always have to make every adventure. Every adventure contains an example code, that the students can try out with the green button. The example code gets copied to the workfield, where the students can try out the code and adjust it to make it their own. Stimulate your students to turn the example code into their own projects by adding their own ideas and making their own variation of the adventure.
ta: ஒவ்வொரு மட்டத்திலும் இளஞ்சிவப்பு தாவல்களில் நீங்கள் காணக்கூடிய வெவ்வேறு சாகசங்கள் உள்ளன. முதல் இளஞ்சிவப்பு தாவல் இந்த மட்டத்தில் புதிய கட்டளைகளை விளக்குகிறது. பின்வரும் தாவல்கள் மாணவர்கள் முயற்சி செய்து தங்கள் சொந்தமாக்கக்கூடிய சாகசங்கள். சாகசங்கள் எளிதானவை முதல் கடினமானவை வரை ஏற்பாடு செய்யப்பட்டுள்ளன, எனவே இடதுபுறத்திலும் உங்கள் வழியிலும் வலதுபுறம் தொடங்க பரிந்துரைக்கிறோம். கடைசி தாவல் 'அடுத்தது என்ன' என்பது அடுத்த கட்டத்தில் நீங்கள் கற்றுக் கொள்ளும் விசயங்களுக்கு ஒரு சிறிய டீசரைத் தருகிறது. நிச்சயமாக, ஒவ்வொரு நிலைக்கும் உங்கள் மாணவர்கள் செய்ய விரும்பும் சாகசங்களை நீங்கள் தேர்ந்தெடுக்கலாம். அவர்கள் எப்போதும் ஒவ்வொரு சாகசத்தையும் செய்ய வேண்டியதில்லை. ஒவ்வொரு சாகசத்திலும் ஒரு எடுத்துக்காட்டு குறியீடு உள்ளது, மாணவர்கள் பச்சை பொத்தானைக் கொண்டு முயற்சி செய்யலாம். எடுத்துக்காட்டு குறியீடு பணிமனைக்கு நகலெடுக்கப்படுகிறது, அங்கு மாணவர்கள் குறியீட்டை முயற்சி செய்து அதை தங்கள் சொந்தமாக்க அதை சரிசெய்யலாம். உங்கள் சொந்த யோசனைகளைச் சேர்ப்பதன் மூலமும், சாகசத்தின் சொந்த மாறுபாட்டை உருவாக்குவதன் மூலமும் எடுத்துக்காட்டு குறியீட்டை தங்கள் சொந்த திட்டங்களாக மாற்ற உங்கள் மாணவர்களைத் தூண்டவும்.

# teacher-guide->[3]->subsections->[5]->title
source: Quizzes and puzzles
ta: நொடி வினாக்கள் மற்றும் புதிர்கள்

# teacher-guide->[3]->subsections->[5]->text
source: To test whether your students have picked up all the new info in the level, you can let them take the quiz. The quiz contains 10 multiple choice questions about the new concepts and command to that level. Not every level has a quiz yet, as we are still building the quizzes. Some levels also contain puzzles. Puzzles show the students a couple of line of code that the students have to put in the right order. This <a href="https://www.youtube.com/watch?v=lNh5EdZVUwc" target="_blank">video</a> shows the quizzes and puzzles.
ta: உங்கள் மாணவர்கள் அனைத்து புதிய தகவல்களையும் மட்டத்தில் எடுத்திருக்கிறார்களா என்பதை சோதிக்க, நீங்கள் அவர்களை நொடி வினாவை எடுக்க அனுமதிக்கலாம். நொடி வினாவில் புதிய கருத்துக்கள் மற்றும் கட்டளை பற்றிய 10 பல தேர்வு கேள்விகள் உள்ளன. ஒவ்வொரு நிலைக்கும் இன்னும் ஒரு நொடி வினா இல்லை, ஏனெனில் நாங்கள் இன்னும் நொடி வினாக்களை உருவாக்குகிறோம். சில நிலைகளில் புதிர்கள் உள்ளன. மாணவர்கள் சரியான வரிசையில் வைக்க வேண்டிய இரண்டு குறியீட்டு குறியீட்டை புதிர்கள் மாணவர்களுக்கு காட்டுகின்றன. இந்த <a href = "https://www.youtube.com/watch?v=lnh5edzvuwc" இலக்கு = "_ வெற்று"> வீடியோ </a> நொடி வினா மற்றும் புதிர்களைக் காட்டுகிறது.

# teacher-guide->[3]->subsections->[6]->title
source: Evaluation
ta: மதிப்பீடு

# teacher-guide->[3]->subsections->[6]->text
source: Round up your lesson by having a brief evaluation. What did the students learn? Which hardships did they come across? How did they learn from their mistakes? And of course: What did they create? Students are often very proud of their own creations, so it's nice to save a little time and give your students the opportunity to show their work to their classmates.
ta: சுருக்கமான மதிப்பீட்டைக் கொண்டிருப்பதன் மூலம் உங்கள் பாடத்தை சுற்றி வளைக்கவும். மாணவர்கள் என்ன கற்றுக்கொண்டார்கள்? அவர்கள் எந்த கச்டங்களைக் கண்டார்கள்? அவர்கள் செய்த தவறுகளிலிருந்து அவர்கள் எவ்வாறு கற்றுக்கொண்டார்கள்? நிச்சயமாக: அவர்கள் என்ன உருவாக்கினர்? மாணவர்கள் தங்கள் சொந்த படைப்புகளைப் பற்றி பெரும்பாலும் பெருமிதம் கொள்கிறார்கள், எனவே சிறிது நேரம் மிச்சப்படுத்துவதும், உங்கள் மாணவர்களுக்கு தங்கள் வகுப்பு தோழர்களிடம் தங்கள் வேலையைக் காண்பிப்பதற்கான வாய்ப்பை வழங்குவதும் நல்லது.

# teacher-guide->[4]->title
source: Teacher Statistics
ta: ஆசிரியர் புள்ளிவிவரங்கள்

# teacher-guide->[4]->key
source: teacher_statistics
ta: ஆசிரியர்_ச்டாடிச்டிக்ச்

# teacher-guide->[4]->subsections->[0]->title
source: Live Dashboard
ta: நேரடி டாச்போர்டு

# teacher-guide->[4]->subsections->[0]->text
source: If you would like to keep track of your students' progress, you can make use of the live dashboard. You can find the live dashboard by clicking 'Live statistics' on your class page. <img src="https://github.com/hedyorg/hedy/assets/80678586/97a54679-b1d6-46b4-a633-ab0161114642" width="1000"> All the features of this dashboard are explained below.
ta: உங்கள் மாணவர்களின் முன்னேற்றத்தைக் கண்காணிக்க விரும்பினால், நீங்கள் நேரடி டாச்போர்டைப் பயன்படுத்தலாம். உங்கள் வகுப்பு பக்கத்தில் 'நேரடி புள்ளிவிவரங்கள்' என்பதைக் சொடுக்கு செய்வதன் மூலம் நேரடி டாச்போர்டைக் காணலாம். <img src = "https://github.com/hdedurg/hedy/assets/80678586/97A54679-B1D6-46B4-A633-AB0161114642" அகலம் = "1000"> இந்த டாச்போர்டின் அனைத்து அம்சங்களும் கீழே விளக்கப்பட்டுள்ளன.

# teacher-guide->[4]->subsections->[1]->title
source: Level Selection
ta: நிலை தேர்வு

# teacher-guide->[4]->subsections->[1]->text
source: <img src="https://github.com/hedyorg/hedy/assets/80678586/94dc891d-cdd6-4311-91f2-51900eaf4c2a" width="500"> Firstly, you can select the levels you'd like to see on the dahsboard. Select the levels your students are currently working on by clicking on the number of that level. Deselect levels that you do not want to see by clicking them again. In this example level 1 and 2 are selected. You can click on refresh to refresh the dashboard and get the most current stats.
ta: <img src = "https://github.com/hdedurg/hedy/assets/80678586/94DC891D-CDD6-4311-91F2-51900EAF4C2A" அகலம் = "500"> முதலாவதாக, நீங்கள் டாச்போர்டில் பார்க்க விரும்பும் நிலைகளைத் தேர்ந்தெடுக்கலாம். அந்த அளவின் எண்ணிக்கையைக் சொடுக்கு செய்வதன் மூலம் உங்கள் மாணவர்கள் தற்போது பணிபுரியும் நிலைகளைத் தேர்ந்தெடுக்கவும். அவற்றை மீண்டும் சொடுக்கு செய்வதன் மூலம் நீங்கள் பார்க்க விரும்பாத நிலைகளைத் தேர்வுசெய்க. இந்த எடுத்துக்காட்டில் நிலை 1 மற்றும் 2 தேர்ந்தெடுக்கப்படுகின்றன. டாச்போர்டைப் புதுப்பிக்கவும், தற்போதைய புள்ளிவிவரங்களைப் பெறவும் நீங்கள் புதுப்பிப்பைக் சொடுக்கு செய்யலாம்.

# teacher-guide->[4]->subsections->[2]->title
source: Class Overview
ta: வகுப்பு கண்ணோட்டம்

# teacher-guide->[4]->subsections->[2]->text
source: <img src="https://github.com/hedyorg/hedy/assets/80678586/b2c30ef9-6eba-4c02-92a3-9669504a54a8" width="1000"> In the class overview you can see which adventure your students are working on right now. You can see that one student is working on the 'Rock, Paper, Scissors' adventure in level 1, one is working on the 'Fortune Teller' in level 1 and one student is working on the 'Rock, Paper, Scissors' adventure in level 2. If you'd like to know which of your students is working on the adventure, simply click the number and their accountnames will appear. You can also see how many of your students have finished the quiz. In this case, one student finished the quiz in level 1. Again, you can click the 1 to see which of your students it is. You can also see one of the students is 'missing' from this overview. That's because he's working on an adventure in level 4, which is not selected.
ta: <img src = "https://github.com/hdedurg/hedy/assets/80678586/b2c30ef9-6eba-4c02-92a3-9669504a54a8" அகலம் = "1000"> வகுப்பு கண்ணோட்டத்தில், உங்கள் மாணவர்கள் இப்போது எந்த சாகசத்தை வேலை செய்கிறார்கள் என்பதை நீங்கள் காணலாம். ஒரு மாணவர் நிலை 1 இல் 'ராக், பேப்பர், கத்தரிக்கோல்' சாகசத்தில் பணிபுரிவதை நீங்கள் காணலாம், ஒருவர் நிலை 1 இல் 'பார்ச்சூன் டெல்லர்' இல் பணிபுரிகிறார், மேலும் ஒரு மாணவர் 'ராக், பேப்பர், கத்தரிக்கோல்' சாகசத்தில் பணிபுரிகிறார் நிலை 2. உங்கள் மாணவர்களில் யார் சாகசத்தில் வேலை செய்கிறார்கள் என்பதை நீங்கள் அறிய விரும்பினால், எண்ணைக் சொடுக்கு செய்து, அவர்களின் கணக்கு பெயர்கள் தோன்றும். உங்கள் மாணவர்களில் எத்தனை பேர் நொடி வினாவை முடித்துவிட்டார்கள் என்பதையும் நீங்கள் காணலாம். இந்த வழக்கில், ஒரு மாணவர் நிலை 1 இல் நொடி வினாவை முடித்தார். மீண்டும், உங்கள் மாணவர்களில் யார் என்பதைக் காண 1 ஐக் சொடுக்கு செய்யலாம். இந்த கண்ணோட்டத்தில் மாணவர்களில் ஒருவர் 'காணவில்லை' என்பதையும் நீங்கள் காணலாம். ஏனென்றால், அவர் 4 ஆம் நிலையில் ஒரு சாகசத்தில் பணிபுரிகிறார், அது தேர்ந்தெடுக்கப்படவில்லை.

# teacher-guide->[4]->subsections->[3]->title
source: Student List
ta: மாணவர் பட்டியல்
