Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-client-messages-*.po
Languages: ta

# CheckInternet
source: Check whether your Internet connection is working.
ta: உங்கள் இணைய இணைப்பு செயல்படுகிறதா என சரிபார்க்கவும்.

# Connection_error
source: We couldn't reach the server.
ta: எங்களால் சேவையகத்தை அடைய முடியவில்லை.

# Empty_output
source: This code works but does not print anything. Add a print command to your code or use the turtle to get output.
ta: இந்த குறியீடு வேலை செய்கிறது ஆனால் எதையும் அச்சிடாது. உங்கள் குறியீட்டில் ஒரு அச்சு கட்டளையைச் சேர்க்கவும் அல்லது வெளியீட்டைப் பெற ஆமை பயன்படுத்தவும்.

# Errors_found
source: You made a mistake! Don't worry, we still ran the program
ta: உங்கள் நிரலில் பிழைகள் இருக்கின்றன! எனினும் கவலையுற வேண்டாம். இருப்பினும் உங்கள் நிரலை இயக்க முடிந்தது

# Execute_error
source: Something went wrong.
ta: ஏதோ தவறு நடந்தது.

# Other_error
source: Oops! Maybe we made a little mistake.
ta: அச்சச்சோ! ஒருவேளை நாங்கள் ஒரு சிறிய தவறு செய்திருக்கலாம்.

# Program_repair
source: This could be the correct code, can you fix it?
ta: இது சரியான குறியீடாக இருக்கலாம், அதை சரிசெய்ய முடியுமா?

# Program_too_long
source: Your program takes too long to run.
ta: உங்கள் நிரல் இயக்க அதிக நேரம் எடுக்கும்.

# ServerError
source: You can help us out by sending an email with the level and your program to hello@hedy.org. In the meantime, try something a little different. Thanks!
ta: நிலை மற்றும் உங்கள் நிரலுடன் ஒரு மின்னஞ்சலை hello@hedy.org க்கு அனுப்புவதன் மூலம் எங்களுக்கு உதவலாம். இதற்கிடையில், கொஞ்சம் வித்தியாசமாக ஏதாவது முயற்சிக்கவும். நன்றி!

# Transpile_error
source: We can't run your program.
ta: உங்கள் திட்டத்தை எங்களால் இயக்க முடியாது.

# Transpile_success->[0]
source: Good job!
ta: நல்ல வேலை!

# Transpile_success->[1]
source: Amazing!
ta: ஆச்சரியம்!

# Transpile_success->[2]
source: Well done!
ta: நல்லது!

# Transpile_success->[3]
source: Excellent!
ta: அருமை!

# Transpile_success->[4]
source: You did great!
ta: நீங்கள் நன்றாக செய்தீர்கள்!

# Transpile_warning
source: Warning!
ta: எச்சரிக்கை!

# Unsaved_Changes
source: You have an unsaved program. Do you want to leave without saving it?
ta: உங்களிடம் சேமிக்கப்படாத திட்டம் உள்ளது. சேமிக்காமல் வெளியேற விரும்புகிறீர்களா?
