Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-webpages-*.po
Languages: ta

# workbooks->levels->[1]->exercises->[22]->answer
source: A program in which a user can give input.
ta: ஒரு பயனர் உள்ளீட்டைக் கொடுக்கக்கூடிய ஒரு நிரல்.

# workbooks->levels->[1]->exercises->[23]->type
source: text
ta: உரை

# workbooks->levels->[1]->exercises->[23]->contents
source: #### Exercise 6: Commands We have learned new commands: `is` and `is ask` together. What to they do? Explain in your own words.
ta: #### உடற்பயிற்சி 6: கட்டளைகள் நாங்கள் புதிய கட்டளைகளைக் கற்றுக்கொண்டோம்: `என்பது` மற்றும்` கேட்கும்` ஒன்றாக. அவர்கள் என்ன செய்ய வேண்டும்? உங்கள் சொந்த வார்த்தைகளில் விளக்குங்கள்.

# workbooks->levels->[1]->exercises->[24]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[1]->exercises->[24]->word
source: the `is` command
ta: `என்பது கட்டளை

# workbooks->levels->[1]->exercises->[24]->answer
source: Saving a value (after the `is`) in a variable (before the `is`)
ta: ஒரு மாறியில் ஒரு மதிப்பைச் சேமித்தல் (`is` க்குப் பிறகு) (` க்கு முன்)

# workbooks->levels->[1]->exercises->[25]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[1]->exercises->[25]->word
source: the `is ask` command
ta: `கேட்கும்` கட்டளை

# workbooks->levels->[1]->exercises->[25]->answer
source: Asking the user for input and saving it in a variable.
ta: பயனரிடம் உள்ளீட்டைக் கேட்பது மற்றும் ஒரு மாறியில் சேமித்தல்.

# workbooks->levels->[2]->intro
source: ### Lists and randomness By the end of this lesson, you can: * Save multiple items in a variable, this is called a list. * Create a story in which random things will happen. * Create a drawing in which random thing will be drawn.
ta: ### பட்டியல்கள் மற்றும் சீரற்ற தன்மை இந்த பாடத்தின் முடிவில், உங்களால் முடியும்: * பல உருப்படிகளை ஒரு மாறியில் சேமிக்கவும், இது ஒரு பட்டியல் என்று அழைக்கப்படுகிறது. * சீரற்ற விசயங்கள் நடக்கும் ஒரு கதையை உருவாக்குங்கள். * சீரற்ற சேதி வரையப்படும் ஒரு வரைபடத்தை உருவாக்கவும்.

# workbooks->levels->[2]->exercises->[0]->type
source: text
ta: உரை

# workbooks->levels->[2]->exercises->[0]->contents
source: ### Variables You have just seen the `is` command being used with a list. Just like with a regular variable, we use `is` to save something.
ta: ### மாறிகள் ஒரு பட்டியலுடன் `என்பது கட்டளை பயன்படுத்தப்படுவதை நீங்கள் பார்த்திருக்கிறீர்கள். ஒரு வழக்கமான மாறியைப் போலவே, எதையாவது சேமிக்க `இச் 'ஐப் பயன்படுத்துகிறோம்.

# workbooks->levels->[2]->exercises->[0]->code
source: friends is Mo, Layla, Danny print Today I will visit friends at random
ta: நண்பர்கள் மோ, லயலா, டேனி இன்று அச்சிடுங்கள் நான் சீரற்ற முறையில் நண்பர்களைப் பார்ப்பேன்

# workbooks->levels->[2]->exercises->[1]->type
source: text
ta: உரை

# workbooks->levels->[2]->exercises->[1]->contents
source: #### Exercise 1: Mark the correct piece of the code
ta: #### உடற்பயிற்சி 1: குறியீட்டின் சரியான பகுதியைக் குறிக்கவும்

# workbooks->levels->[2]->exercises->[2]->type
source: circle
ta: வட்டம்

# workbooks->levels->[2]->exercises->[2]->goal
source: lists
ta: பட்டியல்கள்

# workbooks->levels->[2]->exercises->[2]->code
source: today is monday classes is 1HC, 1HB, 1HA rooms is 011, 304, 305, 501
ta: இன்று திங்கள் வகுப்புகள் 1HC, 1HB, 1HA அறைகள் 011, 304, 305, 501

# workbooks->levels->[2]->exercises->[2]->answer
source: classes and rooms
ta: வகுப்புகள் மற்றும் அறைகள்

# workbooks->levels->[2]->exercises->[3]->type
source: circle
ta: வட்டம்

# workbooks->levels->[2]->exercises->[3]->goal
source: place(s) where text from a list is being used
ta: இடங்கள்) ஒரு பட்டியலிலிருந்து உரை பயன்படுத்தப்படுகிறது

# workbooks->levels->[2]->exercises->[3]->code
source: classes is 1HC, 1HB, 1HA print today classes at random gets a day off!
ta: வகுப்புகள் 1HC, 1HB, 1HA சீரற்ற முறையில் இன்று வகுப்புகளை அச்சிடுக ஒரு நாள் விடுமுறை!

# workbooks->levels->[2]->exercises->[3]->answer
source: The end of line 2
ta: வரி 2 இன் முடிவு

# workbooks->levels->[2]->exercises->[4]->type
source: text
ta: உரை

# workbooks->levels->[2]->exercises->[4]->contents
source: #### Exercise 2: Predict the output Having a hard time? Use these steps again to predict the output of the variable. 1. Mark the place where a variable is being set 2. Mark the place where a variable is being used 3. Draw a line between these two places 4. Pick a random item of the list when `at` `random` is used.
ta: #### உடற்பயிற்சி 2: வெளியீட்டைக் கணிக்கவும் கடினமான நேரம் இருக்கிறதா? மாறியின் வெளியீட்டைக் கணிக்க இந்த படிகளை மீண்டும் பயன்படுத்தவும். 1. ஒரு மாறி அமைக்கப்பட்ட இடத்தைக் குறிக்கவும் 2. ஒரு மாறி பயன்படுத்தப்படும் இடத்தைக் குறிக்கவும் 3. இந்த இரண்டு இடங்களுக்கிடையில் ஒரு கோட்டை வரையவும் 4. `` சீரற்ற` பயன்படுத்தப்படும்போது பட்டியலின் சீரற்ற உருப்படியைத் தேர்ந்தெடுக்கவும்.

# workbooks->levels->[2]->exercises->[5]->type
source: output
ta: வெளியீடு

# workbooks->levels->[2]->exercises->[5]->code
source: teachers is Hermans, Merbis, Bagci, Senkal print Today teachers at random will be teaching you!
ta: ஆசிரியர்கள் எர்மன்ச், மெர்பிச், பாக்சி, சென்கல் இன்று ஆசிரியர்கள் சீரற்ற முறையில் அச்சிடுக உங்களுக்கு கற்பிப்பார்கள்!

# workbooks->levels->[2]->exercises->[5]->answer
source: Today **pick a teacher** will be teaching you!
ta: இன்று ** ஒரு ஆசிரியரைத் தேர்ந்தெடுங்கள் ** உங்களுக்கு கற்பிக்கும்!

# workbooks->levels->[2]->exercises->[6]->type
source: output
ta: வெளியீடு

# workbooks->levels->[2]->exercises->[6]->code
source: teachers is Hermans, Merbis, Bagci, Senkal print Today's teacher is Hermans.
ta: ஆசிரியர்கள் எர்மன்ச், மெர்பிச், பாக்சி, சென்கல் இன்றைய ஆசிரியரை அச்சிடுங்கள் எர்மன்ச்.

# workbooks->levels->[2]->exercises->[6]->answer
source: Today's teacher is Hermans.
ta: இன்றைய ஆசிரியர் எர்மன்ச்.

# workbooks->levels->[2]->exercises->[7]->type
source: output
ta: வெளியீடு

# workbooks->levels->[2]->exercises->[7]->code
source: weather is sunny, rainy, cloudy, stormy print What lovely weather today!
ta: வானிலை வெயில், மழை, மேகமூட்டம், புயல் இன்று என்ன அழகான வானிலை அச்சிடுங்கள்!

# workbooks->levels->[2]->exercises->[7]->answer
source: What lovely weather today!
ta: இன்று என்ன அழகான வானிலை!

# workbooks->levels->[2]->exercises->[8]->type
source: text
ta: உரை

# workbooks->levels->[2]->exercises->[8]->contents
source: #### Exercise 3: Error? Read the programs carefully. Which ones are correct?
ta: #### உடற்பயிற்சி 3: பிழை? நிரல்களை கவனமாகப் படியுங்கள். எது சரியானது?

# workbooks->levels->[2]->exercises->[9]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[2]->exercises->[9]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[2]->exercises->[9]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[2]->exercises->[9]->code
source: rocks is pebbles, stones, boulders print I love programming! It rocks!
ta: பாறைகள் கூழாங்கற்கள், கற்கள், கற்பாறைகள் நான் நிரலாக்கத்தை விரும்புகிறேன்! அது பாறைகள்!

# workbooks->levels->[2]->exercises->[9]->answer
source: Incorrect. You can't print a list
ta: தவறானது. நீங்கள் ஒரு பட்டியலை அச்சிட முடியாது

# workbooks->levels->[2]->exercises->[10]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[2]->exercises->[10]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[2]->exercises->[10]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[2]->exercises->[10]->code
source: teachers is Hermans print It will be teachers at random today
ta: ஆசிரியர்கள் எர்மன்ச் அச்சிடுங்கள் இது இன்று சீரற்ற முறையில் ஆசிரியர்களாக இருக்கும்

# workbooks->levels->[2]->exercises->[10]->answer
source: Incorrect. Teachers is not a list
ta: தவறானது. ஆசிரியர்கள் ஒரு பட்டியல் அல்ல

# workbooks->levels->[2]->exercises->[11]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[2]->exercises->[11]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[2]->exercises->[11]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[2]->exercises->[11]->code
source: teachers is sunny, rainy, cloudy, stormy print It will be teachers at random today
ta: ஆசிரியர்கள் சன்னி, மழை, மேகமூட்டம், புயல் அச்சிடுங்கள் இது இன்று சீரற்ற முறையில் ஆசிரியர்களாக இருக்கும்

# workbooks->levels->[2]->exercises->[11]->answer
source: Correct, the computer doesn't care if the variable name doesn't make sense.
ta: சரியானது, மாறி பெயர் அர்த்தமல்ல என்றால் கணினி கவலைப்படாது.

# workbooks->levels->[2]->exercises->[12]->type
source: text
ta: உரை

# workbooks->levels->[2]->exercises->[12]->contents
source: ## Adventures This is a good time to start with these adventures: Introduction Random Dice Rock, paper, scissors Music Fortune Teller Restaurant Haunted House Dishes
ta: ## சாகசங்கள் இந்த சாகசங்களுடன் தொடங்க இது ஒரு நல்ல நேரம்: அறிமுகம் சீரற்ற பகடை பாறை, காகிதம், கத்தரிக்கோல் இசை அதிர்ச்டம் சொல்பவர் உணவகம் பேய் வீடு உணவுகள்

# workbooks->levels->[2]->exercises->[13]->type
source: text
ta: உரை

# workbooks->levels->[2]->exercises->[13]->contents
source: ### Adjusting lists Up until now we have always set our lists at the beginning of a program.
ta: ### பட்டியல்களை சரிசெய்தல் இப்போது வரை ஒரு நிரலின் தொடக்கத்தில் எங்கள் பட்டியல்களை எப்போதும் அமைத்துள்ளோம்.

# workbooks->levels->[2]->exercises->[13]->code
source: answers is yes, no, maybe print The answer is answers at random
ta: பதில்கள் ஆம், இல்லை, ஒருவேளை பதில் பதில்கள் பதில்கள் சீரற்றவை

# workbooks->levels->[2]->exercises->[14]->type
source: text
ta: உரை

# workbooks->levels->[2]->exercises->[14]->contents
source: But sometimes you want your user to add items to the list. You can use the `add to` command for that. You can also remove items from the list with `remove from`.
ta: ஆனால் சில நேரங்களில் உங்கள் பயனர் பட்டியலில் உருப்படிகளைச் சேர்க்க வேண்டும். அதற்காக `சேர் 'கட்டளையைப் பயன்படுத்தலாம். `அகற்று` உடன் பட்டியலிலிருந்து உருப்படிகளையும் அகற்றலாம்.

# workbooks->levels->[2]->exercises->[14]->code
source: animals is 🐿, 🦔, 🦇, 🦉 animal is ask What made that sound? add animal to animals print It was... animals at random
ta: விலங்குகள் 🐿, 🦔, 🦔, விலங்கு என்ன என்று கேளுங்கள்? விலங்குகளுக்கு விலங்கு சேர்க்கவும் அதை அச்சிடுங்கள் ... விலங்குகள் சீரற்ற முறையில்

# workbooks->levels->[2]->exercises->[15]->type
source: text
ta: உரை

# workbooks->levels->[2]->exercises->[15]->contents
source: #### Exercise 4: Correct or incorrect?
ta: #### உடற்பயிற்சி 4: சரியானதா அல்லது தவறா?

# workbooks->levels->[2]->exercises->[16]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[2]->exercises->[16]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[2]->exercises->[16]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[2]->exercises->[16]->code
source: letters is a,b,c,d remove a to letters
ta: கடிதங்கள் A, B, C, D. எழுத்துக்களுக்கு A ஐ அகற்றவும்

# workbooks->levels->[2]->exercises->[16]->answer
source: Incorrect. It is `remove from`, not `remove to`.
ta: தவறானது. இது `அகற்று`, `அகற்று அல்ல.

# workbooks->levels->[2]->exercises->[17]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[2]->exercises->[17]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[2]->exercises->[17]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[2]->exercises->[17]->code
source: food is pizza, fries, tacos remove burger from food
ta: உணவு என்பது பீச்சா, பொரியல், டகோச் உணவில் இருந்து பர்கரை அகற்றவும்

# workbooks->levels->[2]->exercises->[17]->answer
source: Correct, you are allowed to remove something that isn't on the list. But it doesn't make sense to do so
ta: சரியானது, பட்டியலில் இல்லாத ஒன்றை அகற்ற உங்களுக்கு இசைவு உண்டு. ஆனால் அவ்வாறு செய்வது அர்த்தமல்ல

# workbooks->levels->[2]->exercises->[18]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[2]->exercises->[18]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[2]->exercises->[18]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[2]->exercises->[18]->code
source: food is pizza, fries, tacos add pizza to food
ta: உணவு என்பது பீச்சா, பொரியல், டகோச் மற்றும் உணவுக்கு பீச்சா

# workbooks->levels->[2]->exercises->[18]->answer
source: Correct, you are allowed to put something on a list twice or multiple times.
ta: சரியானது, ஒரு பட்டியலில் ஏதாவது ஒன்றை இரண்டு அல்லது பல முறை வைக்க அனுமதிக்கப்படுகிறீர்கள்.

# workbooks->levels->[2]->exercises->[19]->type
source: text
ta: உரை

# workbooks->levels->[2]->exercises->[19]->contents
source: #### Exercise 5: Write the code Take a good look at the output and write a matching code for it. **Make sure that your code contains at least one random choice, so don't just use print!**
ta: #### உடற்பயிற்சி 5: குறியீட்டை எழுதுங்கள் வெளியீட்டை நன்றாகப் பார்த்து, அதற்கான பொருந்தக்கூடிய குறியீட்டை எழுதுங்கள். ** உங்கள் குறியீட்டில் குறைந்தது ஒரு சீரற்ற தேர்வைக் கொண்டிருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், எனவே அச்சிடலைப் பயன்படுத்த வேண்டாம்! **

# workbooks->levels->[2]->exercises->[20]->type
source: input
ta: உள்ளீடு

# workbooks->levels->[2]->exercises->[20]->answer
source: numbers is 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 print Welcome at bingo night! print The 3 lucky numbers are: print numbers at random and print numbers at random and print numbers at random
ta: எண்கள் 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 பிங்கோ நைட்டில் வரவேற்பு! அச்சிடுக 3 அதிர்ச்ட எண்கள்: சீரற்ற மற்றும் எண்களை சீரற்ற முறையில் அச்சிடவும் மற்றும் எண்களை சீரற்ற முறையில் அச்சிடவும்

# workbooks->levels->[2]->exercises->[20]->output
source: Welcome at bingo night! The 3 lucky numbers are: 5 and 3 and 10
ta: பிங்கோ இரவில் வரவேற்கிறோம்! 3 அதிர்ச்ட எண்கள்: 5 மற்றும் 3 மற்றும் 10

# workbooks->levels->[2]->exercises->[21]->type
source: input
ta: உள்ளீடு

# workbooks->levels->[2]->exercises->[21]->answer
source: movies is Avengers, Barbie, Inside Out print We are going to watch a movie tonight. print We will pick: movies at random
ta: திரைப்படங்கள் அவென்சர்ச், பார்பி, இன்சைட் அவுட் அச்சிட நாங்கள் இன்றிரவு ஒரு திரைப்படத்தைப் பார்க்கப் போகிறோம். அச்சிடுவோம்: சீரற்ற திரைப்படங்கள்

# workbooks->levels->[2]->exercises->[21]->output
source: We are going to watch a movie tonight. We will pick: Inside Out
ta: நாங்கள் இன்றிரவு ஒரு திரைப்படத்தைப் பார்க்கப் போகிறோம். நாங்கள் தேர்ந்தெடுப்போம்: உள்ளே

# workbooks->levels->[2]->exercises->[22]->type
source: text
ta: உரை

# workbooks->levels->[2]->exercises->[22]->contents
source: #### Exercise 6: Programming words We have learned some new programming words again! Explain them in your own words.
ta: #### உடற்பயிற்சி 6: நிரலாக்க சொற்கள் சில புதிய நிரலாக்க சொற்களை மீண்டும் கற்றுக்கொண்டோம்! அவற்றை உங்கள் சொந்த வார்த்தைகளில் விளக்குங்கள்.

# workbooks->levels->[2]->exercises->[23]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[2]->exercises->[23]->word
source: list
ta: பட்டியல்

# workbooks->levels->[2]->exercises->[23]->answer
source: A variable in which multiple values are stored
ta: பல மதிப்புகள் சேமிக்கப்படும் மாறி

# workbooks->levels->[2]->exercises->[24]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[2]->exercises->[24]->word
source: random
ta: சீரற்ற

# workbooks->levels->[2]->exercises->[24]->answer
source: Picked by the computer.
ta: கணினியால் எடுக்கப்பட்டது.

# workbooks->levels->[2]->exercises->[25]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[2]->exercises->[25]->word
source: add
ta: கூட்டு

# workbooks->levels->[2]->exercises->[25]->answer
source: putting something on a list
ta: ஒரு பட்டியலில் எதையாவது வைப்பது

# workbooks->levels->[2]->exercises->[26]->type
source: text
ta: உரை

# workbooks->levels->[2]->exercises->[26]->contents
source: #### Exercise 7: Commands The `is` command has changed in this level and we have learned some new commands. What do they do? Explain in your own words.
ta: #### உடற்பயிற்சி 7: கட்டளைகள் `என்பது 'கட்டளை இந்த மட்டத்தில் மாறிவிட்டது, நாங்கள் சில புதிய கட்டளைகளைக் கற்றுக்கொண்டோம். அவர்கள் என்ன செய்கிறார்கள்? உங்கள் சொந்த வார்த்தைகளில் விளக்குங்கள்.

# workbooks->levels->[2]->exercises->[27]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[2]->exercises->[27]->word
source: The `is` command (Mind: `is` can now do multiple things!)
ta: `என்பது 'கட்டளை (மனம்:` என்பது இப்போது பல விசயங்களைச் செய்ய முடியும்!)

# workbooks->levels->[2]->exercises->[27]->answer
source: Saving the value (before the is) in a variable or list (after the is)
ta: ஒரு மாறி அல்லது பட்டியலில் (IS க்கு முன்) மதிப்பைச் சேமிக்கிறது (IS க்குப் பிறகு)

# workbooks->levels->[2]->exercises->[28]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[2]->exercises->[28]->word
source: The `add to` command
ta: `சேர்` கட்டளைக்கு

# workbooks->levels->[2]->exercises->[28]->answer
source: Adds an item to a list. It looks like this: add item to list
ta: ஒரு உருப்படியை ஒரு பட்டியலில் சேர்க்கிறது. இது போல் தெரிகிறது: பட்டியலுக்கு உருப்படியைச் சேர்க்கவும்

# workbooks->levels->[2]->exercises->[29]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[2]->exercises->[29]->word
source: The `remove from` command
ta: `அகற்று` கட்டளையை

# workbooks->levels->[2]->exercises->[29]->answer
source: Removes an item from a list. It looks like this: remove item from list
ta: ஒரு பட்டியலிலிருந்து ஒரு உருப்படியை நீக்குகிறது. இது போல் தெரிகிறது: பட்டியலிலிருந்து உருப்படியை அகற்று

# workbooks->levels->[2]->exercises->[30]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[2]->exercises->[30]->word
source: The `at random` command
ta: `சீரற்ற` கட்டளை

# workbooks->levels->[2]->exercises->[30]->answer
source: Picks a random item from a list.
ta: ஒரு பட்டியலிலிருந்து ஒரு சீரற்ற உருப்படியைத் தேர்ந்தெடுக்கிறது.

# workbooks->levels->[2]->exercises->[31]->type
source: text
ta: உரை

# workbooks->levels->[2]->exercises->[31]->contents
source: #### What's your opinion?
ta: #### உங்கள் கருத்து என்ன?

# workbooks->levels->[2]->exercises->[32]->type
source: question
ta: கேள்வி

# workbooks->levels->[2]->exercises->[32]->text
source: Which exercise did you like best in this level?
ta: இந்த மட்டத்தில் நீங்கள் எந்த உடற்பயிற்சியை விரும்பினீர்கள்?

# workbooks->levels->[2]->exercises->[33]->type
source: question
ta: கேள்வி

# workbooks->levels->[2]->exercises->[33]->text
source: What did you like about that exercise?
ta: அந்த உடற்பயிற்சியைப் பற்றி நீங்கள் என்ன விரும்பினீர்கள்?

# workbooks->levels->[2]->exercises->[34]->type
source: question
ta: கேள்வி

# workbooks->levels->[2]->exercises->[34]->text
source: Which exercise did you like least in this level?
ta: இந்த மட்டத்தில் நீங்கள் எந்த உடற்பயிற்சியை விரும்பினீர்கள்?

# workbooks->levels->[2]->exercises->[35]->type
source: question
ta: கேள்வி

# workbooks->levels->[2]->exercises->[35]->text
source: What didn't you like about that exercise?
ta: அந்த உடற்பயிற்சியைப் பற்றி உங்களுக்கு என்ன பிடிக்கவில்லை?

# workbooks->levels->[3]->intro
source: ## Quotation marks By the end of this lesson, you can: * understand why quotation marks are needed in programming. * put quotation marks in the correct places. * understand error messages about wrongful use of quotation marks.
ta: ## மேற்கோள் மதிப்பெண்கள் இந்த பாடத்தின் முடிவில், உங்களால் முடியும்: * நிரலாக்கத்தில் மேற்கோள் மதிப்பெண்கள் ஏன் தேவை என்பதைப் புரிந்து கொள்ளுங்கள். * மேற்கோள் குறிகளை சரியான இடங்களில் வைக்கவும். * மேற்கோள் மதிப்பெண்களின் தவறான பயன்பாடு குறித்த பிழை செய்திகளைப் புரிந்து கொள்ளுங்கள்.

# workbooks->levels->[3]->exercises->[0]->type
source: text
ta: உரை

# workbooks->levels->[3]->exercises->[0]->contents
source: ### Quotation marks We have learned to use quotation marks, when a text needs to appear literally that way on the screen. We use quotation marks with `print` and `ask`.
ta: ### மேற்கோள் மதிப்பெண்கள் ஒரு உரை திரையில் அந்த வழியில் தோன்ற வேண்டியிருக்கும் போது, ​​மேற்கோள் மதிப்பெண்களைப் பயன்படுத்த நாங்கள் கற்றுக்கொண்டோம். `அச்சு` மற்றும்` கேளுங்கள்` உடன் மேற்கோள் மதிப்பெண்களைப் பயன்படுத்துகிறோம்.

# workbooks->levels->[3]->exercises->[0]->code
source: friend is ask 'what is your name?' print 'Cool! I will go to the mall with ' friend
ta: நண்பர் 'உங்கள் பெயர் என்ன?' அச்சிடுக 'கூல்! நான் 'நண்பருடன் மாலுக்குச் செல்வேன்

# workbooks->levels->[3]->exercises->[1]->type
source: text
ta: உரை

# workbooks->levels->[3]->exercises->[1]->contents
source: #### Exercise 1: Finish the code. Do this exercise in two steps: 1. Place the quotation marks correctly in the code. 2. Did you do it? Then predict the output of this code.
ta: #### உடற்பயிற்சி 1: குறியீட்டை முடிக்கவும். இந்த பயிற்சியை இரண்டு படிகளில் செய்யுங்கள்: 1. மேற்கோள் குறிகளை குறியீட்டில் சரியாக வைக்கவும். 2. நீங்கள் அதைச் செய்தீர்களா? இந்த குறியீட்டின் வெளியீட்டை கணிக்கவும்.

# workbooks->levels->[3]->exercises->[2]->type
source: output
ta: வெளியீடு

# workbooks->levels->[3]->exercises->[2]->code
source: print Hi everybody! print Welcome to Hedy
ta: அனைவருக்கும் வணக்கம்! எர்டிக்கு வரவேற்கிறோம்

# workbooks->levels->[3]->exercises->[2]->answer
source: Hi everybody! Welcome to Hedy
ta: அனைவருக்கும் வணக்கம்! எடிக்கு வருக

# workbooks->levels->[3]->exercises->[3]->type
source: text
ta: உரை

# workbooks->levels->[3]->exercises->[3]->contents
source: Don't forget to do both steps of this exercise. Put the quotes on the left side and the code on the right side.
ta: இந்த பயிற்சியின் இரண்டு படிகளையும் செய்ய மறக்காதீர்கள். மேற்கோள்களை இடது பக்கத்திலும் குறியீட்டையும் வலது பக்கத்தில் வைக்கவும்.

# workbooks->levels->[3]->exercises->[4]->type
source: output
ta: வெளியீடு

# workbooks->levels->[3]->exercises->[4]->code
source: name is Hermans classroom is 305 print Todays lesson is by name in room classroom!
ta: பெயர் எர்மன்ச் வகுப்பறை 305 இன்றைய பாடம் அறை வகுப்பறையில் பெயரில் உள்ளது!

# workbooks->levels->[3]->exercises->[4]->answer
source: Todays lesson is by Hermans in room 305!
ta: இன்றைய பாடம் அறை 305 இல் எர்மன்ச்!

# workbooks->levels->[3]->exercises->[5]->type
source: output
ta: வெளியீடு

# workbooks->levels->[3]->exercises->[5]->code
source: teachers is Hermans, Merbis, Bagci, Senkal print Today teachers at random is teaching.
ta: ஆசிரியர்கள் எர்மன்ச், மெர்பிச், பாக்சி, சென்கல் இன்றைய ஆசிரியர்களை சீரற்ற முறையில் அச்சிடுக.

# workbooks->levels->[3]->exercises->[5]->answer
source: Today Hermans is teaching
ta: இன்று எர்மன்ச் கற்பிக்கிறார்

# workbooks->levels->[3]->exercises->[6]->type
source: output
ta: வெளியீடு

# workbooks->levels->[3]->exercises->[6]->code
source: rocks is pebbles, stones, boulders print I love programming! It rocks!
ta: பாறைகள் கூழாங்கற்கள், கற்கள், கற்பாறைகள் நான் நிரலாக்கத்தை விரும்புகிறேன்! அது பாறைகள்!

# workbooks->levels->[3]->exercises->[6]->answer
source: I love programming! It rocks
ta: நான் நிரலாக்கத்தை விரும்புகிறேன்! அது பாறைகள்

# workbooks->levels->[3]->exercises->[7]->type
source: output
ta: வெளியீடு

# workbooks->levels->[3]->exercises->[7]->code
source: print Lovely weather today! name is Bozo
ta: இன்று அழகான வானிலை அச்சிடுங்கள்! பெயர் போசோ

# workbooks->levels->[3]->exercises->[7]->answer
source: Lovely weather today!
ta: இன்று அழகான வானிலை!

# workbooks->levels->[3]->exercises->[8]->type
source: text
ta: உரை

# workbooks->levels->[3]->exercises->[8]->contents
source: #### Exercise 2: Error? Read the programs carefully. Which ones are correct?
ta: #### உடற்பயிற்சி 2: பிழை? நிரல்களை கவனமாகப் படியுங்கள். எது சரியானது?

# workbooks->levels->[3]->exercises->[9]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[3]->exercises->[9]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[3]->exercises->[9]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[3]->exercises->[9]->code
source: print 'I'll go to the zoo tomorrow'
ta: 'நான் நாளை மிருகக்காட்சிசாலையில் செல்வேன்'

# workbooks->levels->[3]->exercises->[9]->answer
source: Incorrect. You can't use a apostrophe when you use the single quotation marks.
ta: தவறானது. நீங்கள் ஒற்றை மேற்கோள் மதிப்பெண்களைப் பயன்படுத்தும்போது அப்போச்ட்ரோபியைப் பயன்படுத்த முடியாது.

# workbooks->levels->[3]->exercises->[10]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[3]->exercises->[10]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[3]->exercises->[10]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[3]->exercises->[10]->code
source: print 'I saw a llama at the zoo
ta: அச்சிடுக 'நான் மிருகக்காட்சிசாலையில் ஒரு லாமாவைப் பார்த்தேன்
