Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-webpages-*.po
Languages: ta

# teacher-guide->[8]->levels->[0]->sections->[4]->example->solution_text
source: In the example, students tend to think that the turn command failed; even though it did what it what supossed to. What happened is the turtle walked past the screen limits. Use smaller numbers to prevent this from happening.
ta: எடுத்துக்காட்டில், டர்ன் கட்டளை தோல்வியடைந்தது என்று மாணவர்கள் நினைக்கிறார்கள்; அது என்ன செய்தாலும். நடந்தது என்னவென்றால், ஆமை திரை வரம்புகளைத் தாண்டி நடந்தது. இது நிகழாமல் தடுக்க சிறிய எண்களைப் பயன்படுத்தவும்.

# teacher-guide->[8]->levels->[0]->sections->[5]->title
source: Turtle: Students use the command backward, but there's no such command.
ta: ஆமை: மாணவர்கள் கட்டளையை பின்னோக்கி பயன்படுத்துகிறார்கள், ஆனால் அத்தகைய கட்டளை இல்லை.

# teacher-guide->[8]->levels->[0]->sections->[5]->example->error_text
source: Backward is not a command.
ta: பின்தங்கியவர் ஒரு கட்டளை அல்ல.

# teacher-guide->[8]->levels->[0]->sections->[5]->example->error_code
source: backward 100
ta: பின்தங்கிய 100

# teacher-guide->[8]->levels->[0]->sections->[5]->example->solution_text
source: To make the turtle go backwards, you use the forward command and a negative number. For example:
ta: ஆமை பின்னோக்கி செல்ல, நீங்கள் முன்னோக்கி கட்டளை மற்றும் எதிர்மறை எண்ணைப் பயன்படுத்துகிறீர்கள். உதாரணமாக:

# teacher-guide->[8]->levels->[1]->sections->[0]->title
source: Students make typos in their commands
ta: மாணவர்கள் தங்கள் கட்டளைகளில் எழுத்துப்பிழைகளை உருவாக்குகிறார்கள்

# teacher-guide->[8]->levels->[1]->sections->[0]->example->error_text
source: Hedy can't recognize a command with a typo.
ta: ஒரு எழுத்துப்பிழையுடன் ஒரு கட்டளையை எடி அடையாளம் காண முடியாது.

# teacher-guide->[8]->levels->[1]->sections->[0]->example->error_code
source: prinnt Don't make typos
ta: அச்சு எழுத்துப்பிழைகளை உருவாக்க வேண்டாம்

# teacher-guide->[8]->levels->[1]->sections->[0]->example->solution_text
source: Teach your students to read the error messages. This way they can find out themselves what went wrong.
ta: பிழை செய்திகளைப் படிக்க உங்கள் மாணவர்களுக்கு கற்றுக் கொடுங்கள். இந்த வழியில் அவர்கள் என்ன தவறு நடந்தார்கள் என்பதைக் கண்டுபிடிக்க முடியும்.

# teacher-guide->[8]->levels->[1]->sections->[0]->example->solution_code
source: {print} Don't make typos
ta: {அச்சு the எழுத்துப்பிழைகளை உருவாக்க வேண்டாம்

# teacher-guide->[8]->levels->[1]->sections->[1]->title
source: Students forget that the ask command has changed
ta: கேட்கும் கட்டளை மாறிவிட்டது என்பதை மாணவர்கள் மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[1]->sections->[1]->example->error_text
source: In this level students learn about variables. The ask command requires a variable as well, but students forget this.
ta: இந்த மட்டத்தில் மாணவர்கள் மாறிகள் பற்றி அறிந்து கொள்கிறார்கள். ASK கட்டளைக்கு ஒரு மாறி தேவைப்படுகிறது, ஆனால் மாணவர்கள் இதை மறந்துவிடுகிறார்கள்.

# teacher-guide->[8]->levels->[1]->sections->[1]->example->error_code
source: ask what would you like to eat
ta: நீங்கள் என்ன சாப்பிட விரும்புகிறீர்கள் என்று கேளுங்கள்

# teacher-guide->[8]->levels->[1]->sections->[1]->example->solution_text
source: In this level you have to tell Hedy where to save your answer, so it can be used later on. This is called a variable.
ta: இந்த மட்டத்தில் உங்கள் பதிலை எங்கு சேமிக்க வேண்டும் என்று நீங்கள் எண்டியைச் சொல்ல வேண்டும், எனவே பின்னர் அதைப் பயன்படுத்தலாம். இது ஒரு மாறி என்று அழைக்கப்படுகிறது.

# teacher-guide->[8]->levels->[1]->sections->[1]->example->solution_code
source: order {is} {ask} What would you like to eat
ta: ஆர்டர் {is} {ask} நீங்கள் என்ன சாப்பிட விரும்புகிறீர்கள்

# teacher-guide->[8]->levels->[1]->sections->[2]->title
source: Students try to use the `{echo}` command
ta: மாணவர்கள் `{echo}` கட்டளையைப் பயன்படுத்த முயற்சிக்கிறார்கள்

# teacher-guide->[8]->levels->[1]->sections->[2]->example->error_text
source: For some students it might be frustrating to learn that the `{echo}` command doesn't work anymore. That's why it's very important to explain the advantages of using variables. For example you can use multiple variables in a code, and you can put them anywhere you like in a sentence!
ta: சில மாணவர்களுக்கு `{echo}` கட்டளை இனி வேலை செய்யாது என்பதை அறிந்து கொள்வது வெறுப்பாக இருக்கலாம். அதனால்தான் மாறிகளைப் பயன்படுத்துவதன் நன்மைகளை விளக்குவது மிகவும் முதன்மை. எடுத்துக்காட்டாக நீங்கள் ஒரு குறியீட்டில் பல மாறிகளைப் பயன்படுத்தலாம், மேலும் அவற்றை ஒரு வாக்கியத்தில் நீங்கள் விரும்பும் எங்கும் வைக்கலாம்!

# teacher-guide->[8]->levels->[1]->sections->[2]->example->error_code
source: answer {is} {ask} Why doesn't {echo} work anymore?! {echo}
ta: பதில் {is} {ask} ஏன் {echo} இனி வேலை செய்யாது?! {echo}

# teacher-guide->[8]->levels->[1]->sections->[2]->example->solution_text
source: Use a variable instead.
ta: அதற்கு பதிலாக ஒரு மாறியைப் பயன்படுத்தவும்.

# teacher-guide->[8]->levels->[1]->sections->[2]->example->solution_code
source: answer {is} {ask} Why doens't {echo} work anymore?! {print} answer
ta: பதில் {is} {ask} ஏன் இனி {echo} வேலை செய்யக்கூடாது?! {print} பதில்

# teacher-guide->[8]->levels->[1]->sections->[3]->title
source: Students use a variable name or as a normal word
ta: மாணவர்கள் மாறி பெயரைப் பயன்படுத்துகிறார்கள் அல்லது சாதாரண வார்த்தையாகப் பயன்படுத்துகிறார்கள்

# teacher-guide->[8]->levels->[1]->sections->[3]->example->error_text
source: In the example below the word 'name' is used as a variable, but also as a normal text. The output of this code will be 'Hi my Hedy is Hedy'.
ta: கீழே உள்ள எடுத்துக்காட்டில் 'பெயர்' என்ற வார்த்தையை ஒரு மாறியாகவும், சாதாரண உரையாகவும் பயன்படுத்தப்படுகிறது. இந்த குறியீட்டின் வெளியீடு 'ஆய் மை எடி இச் எடி' ஆக இருக்கும்.

# teacher-guide->[8]->levels->[1]->sections->[3]->example->error_code
source: name {is} Hedy {print} Hi my name is name
ta: பெயர் {is} எடி {print} ஆய் என் பெயர் பெயர்

# teacher-guide->[8]->levels->[1]->sections->[3]->example->solution_text
source: So don't use a word you want to use in the text as a variable name. In level 4 this is solved with quotation marks.
ta: எனவே உரையில் நீங்கள் பயன்படுத்த விரும்பும் ஒரு வார்த்தையை மாறி பெயராகப் பயன்படுத்த வேண்டாம். நிலை 4 இல் இது மேற்கோள் மதிப்பெண்களுடன் தீர்க்கப்படுகிறது.

# teacher-guide->[8]->levels->[1]->sections->[3]->example->solution_code
source: name {is} Hedy {print} Hi I'm name
ta: பெயர் {is} எடி {print} ஆய் நான் பெயர்

# teacher-guide->[8]->levels->[1]->sections->[4]->title
source: Students use long variable names containing two words.
ta: மாணவர்கள் இரண்டு சொற்களைக் கொண்ட நீண்ட மாறி பெயர்களைப் பயன்படுத்துகின்றனர்.

# teacher-guide->[8]->levels->[1]->sections->[4]->example->error_text
source: A variable should be named with one word. You could use an underscore to connect two words. That counts as one.
ta: ஒரு வார்த்தையுடன் ஒரு மாறி பெயரிடப்பட வேண்டும். இரண்டு சொற்களை இணைக்க நீங்கள் அடிக்கோடிட்டுக் காட்டலாம். அது ஒன்றாகும்.

# teacher-guide->[8]->levels->[1]->sections->[4]->example->error_code
source: chosen door is ask Which door do you pick
ta: தேர்ந்தெடுக்கப்பட்ட கதவு நீங்கள் எந்த கதவைத் தேர்ந்தெடுப்பீர்கள் என்று கேளுங்கள்

# teacher-guide->[8]->levels->[1]->sections->[4]->example->solution_text
source: Add an underscore.
ta: அடிக்கோடிட்டு சேர்க்கவும்.

# teacher-guide->[8]->levels->[1]->sections->[4]->example->solution_code
source: chosen_door {is} {ask} which door do you pick
ta: தேர்ந்தெடுக்கப்பட்ட கதவு {is} {ask} நீங்கள் எந்த கதவைத் தேர்ந்தெடுப்பீர்கள்

# teacher-guide->[8]->levels->[1]->sections->[5]->title
source: Students might use two different names for the same variable
ta: ஒரே மாறிக்கு மாணவர்கள் இரண்டு வெவ்வேறு பெயர்களைப் பயன்படுத்தலாம்

# teacher-guide->[8]->levels->[1]->sections->[5]->example->error_text
source: In this example the student has used 'horse' and 'name' for the same variables.
ta: இந்த எடுத்துக்காட்டில் மாணவர் ஒரே மாறிகளுக்கு 'குதிரை' மற்றும் 'பெயர்' ஆகியவற்றைப் பயன்படுத்தினார்.

# teacher-guide->[8]->levels->[1]->sections->[5]->example->error_code
source: horse {is} {ask} What is your horse called {print} Your horse is called name
ta: குதிரை {is} {கேளுங்கள் your உங்கள் குதிரை என்ன அழைக்கப்படுகிறது {ask} உங்கள் குதிரை பெயர் என்று அழைக்கப்படுகிறது

# teacher-guide->[8]->levels->[1]->sections->[5]->example->solution_text
source: Always check whether the variable has the same name throughout the code. Slight differences can be hard to spot (for example plurals) but they will interfere with the code.
ta: குறியீடு முழுவதும் மாறிக்கு ஒரே பெயர் இருக்கிறதா என்பதை எப்போதும் சரிபார்க்கவும். சிறிய வேறுபாடுகளைக் கண்டறிவது கடினம் (எடுத்துக்காட்டாக பன்மை) ஆனால் அவை குறியீட்டில் தலையிடும்.

# teacher-guide->[8]->levels->[1]->sections->[5]->example->solution_code
source: name {is} {ask} What is your horse called {print} Your horse is called name
ta: பெயர் {is} {ask} What is your horse called {print} உங்கள் குதிரை பெயர் என்று அழைக்கப்படுகிறது

# teacher-guide->[8]->levels->[2]->sections->[0]->title
source: Students try to print whole lists
ta: மாணவர்கள் முழு பட்டியல்களையும் அச்சிட முயற்சிக்கிறார்கள்

# teacher-guide->[8]->levels->[2]->sections->[0]->example->error_text
source: A list can't be printed. You can only print one item from the list with {at} {random}.
ta: ஒரு பட்டியலை அச்சிட முடியாது. பட்டியலிலிருந்து ஒரு உருப்படியை {at {{சீரற்ற with உடன் மட்டுமே அச்சிட முடியும்.

# teacher-guide->[8]->levels->[2]->sections->[0]->example->error_code
source: groceries {is} apples, milk, chocolate {print} groceries
ta: மளிகைப் பொருட்கள் {is} ஆப்பிள், பால், சாக்லேட் {print} மளிகைப் பொருட்கள்

# teacher-guide->[8]->levels->[2]->sections->[0]->example->solution_text
source: To print a list of all the groceries, you simply need to put them after a `{print}` command. Else you can use the list to print one item with `{at}` `{random}`.
ta: அனைத்து மளிகைப் பொருட்களின் பட்டியலையும் அச்சிட, நீங்கள் அவற்றை `{print}` கட்டளைக்குப் பிறகு வைக்க வேண்டும். இல்லையெனில் நீங்கள் ஒரு உருப்படியை `{` `{at}` இல் அச்சிட பட்டியலைப் பயன்படுத்தலாம்.

# teacher-guide->[8]->levels->[2]->sections->[0]->example->solution_code
source: {print} apples, milk, chocolate # or groceries {is} apples, milk, chocolate {print} groceries {at} {random}
ta: {print} ஆப்பிள்கள், பால், சாக்லேட் # அல்லது மளிகைப் பொருட்கள் {is} ஆப்பிள், பால், சாக்லேட் {print} மளிகைப் பொருட்கள் {at {{at}

# teacher-guide->[8]->levels->[2]->sections->[1]->title
source: Students use the name of a variable or list as regular text
ta: மாணவர்கள் ஒரு மாறி அல்லது பட்டியலின் பெயரை வழக்கமான உரையாகப் பயன்படுத்துகின்றனர்

# teacher-guide->[8]->levels->[2]->sections->[1]->example->error_text
source: This problem probably occured in level 2 as well. Now it can happen with lists too.
ta: இந்த சிக்கல் நிலை 2 இல் நிகழ்ந்தது. இப்போது அது பட்டியல்களிலும் நிகழலாம்.

# teacher-guide->[8]->levels->[2]->sections->[1]->example->error_code
source: name {is} Hedy {print} Hi my name is name # or animal {is} rhino, bee, swan {print} The best animal is... animal {at} {random}
ta: பெயர் {is} எடி {print} ஆய் என் பெயர் பெயர் # அல்லது விலங்கு {is} ரினோ, தேனீ, ச்வான் {print} சிறந்த விலங்கு ... விலங்கு {at} {random}

# teacher-guide->[8]->levels->[2]->sections->[1]->example->solution_text
source: Don't use the names of variables or lists in regular text to print. In level 4 this problem is solved with quotation marks.
ta: அச்சிட வழக்கமான உரையில் மாறிகள் அல்லது பட்டியல்களின் பெயர்களைப் பயன்படுத்த வேண்டாம். நிலை 4 இல் இந்த சிக்கல் மேற்கோள் மதிப்பெண்களுடன் தீர்க்கப்படுகிறது.

# teacher-guide->[8]->levels->[2]->sections->[1]->example->solution_code
source: name {is} Hedy {print} Hi I'm name # or animals {is} rhino, bee, swan {print} The best animal is... animals {at} {random}
ta: பெயர் {is} எடி {print} ஆய் நான் பெயர் # அல்லது விலங்குகள் {is} ரினோ, தேனீ, ச்வான் {print} சிறந்த விலங்கு ... விலங்குகள் {at {{at}

# teacher-guide->[8]->levels->[2]->sections->[2]->title
source: Students forget `{at}` in `{at}` `{random}`
ta: மாணவர்கள் `{at` {in {`` {at} `இல் மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[2]->sections->[2]->example->error_text
source: Like in the example
ta: எடுத்துக்காட்டில் போல

# teacher-guide->[8]->levels->[2]->sections->[2]->example->error_code
source: birds {is} sparrow, seagull, robin {print} birds random
ta: பறவைகள் {is} ச்பாரோ, சீகல், ராபின் {print} பறவைகள் சீரற்ற

# teacher-guide->[8]->levels->[2]->sections->[2]->example->solution_text
source: This problem is solved by adding the word at.
ta: வார்த்தையைச் சேர்ப்பதன் மூலம் இந்த சிக்கல் தீர்க்கப்படுகிறது.

# teacher-guide->[8]->levels->[2]->sections->[2]->example->solution_code
source: birds {is} sparrow, seagull, robin {print} birds {at} {random}
ta: பறவைகள் {is} ச்பாரோ, சீகல், ராபின் {print} பறவைகள் {at} {random}

# teacher-guide->[8]->levels->[2]->sections->[3]->title
source: Students forget to use the `{print}` command when also using the `{at}` `{random}` command
ta: `{{print}` `{at}` கட்டளையைப் பயன்படுத்தும் போது `{random}` கட்டளையைப் பயன்படுத்த மாணவர்கள் மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[2]->sections->[3]->example->error_text
source: Or they will sometimes put `{at}` `{random}` at the beginning of the line.
ta: அல்லது அவர்கள் சில நேரங்களில் {`` {at} `என்ற வரியின் தொடக்கத்தில் வைப்பார்கள்.

# teacher-guide->[8]->levels->[2]->sections->[3]->example->error_code
source: fruit {is} apple, cherry, banana fruit {at} {random}
ta: பழம் {is} ஆப்பிள், செர்ரி, வாழைப்பழம் பழம் {at} {random}

# teacher-guide->[8]->levels->[2]->sections->[3]->example->solution_text
source: Emphasize to your students that you always need a print to print text.
ta: உரையை அச்சிட உங்களுக்கு எப்போதும் அச்சு தேவை என்பதை உங்கள் மாணவர்களுக்கு வலியுறுத்துங்கள்.

# teacher-guide->[8]->levels->[2]->sections->[3]->example->solution_code
source: fruit {is} apple, cherry, banana {print} fruit {at} {random}
ta: பழம் {is} ஆப்பிள், செர்ரி, வாழைப்பழம் {print} பழம் {at} {random}

# teacher-guide->[8]->levels->[2]->sections->[4]->title
source: Students forget to use commas in their lists
ta: மாணவர்கள் தங்கள் பட்டியல்களில் காற்புள்ளிகளைப் பயன்படுத்த மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[2]->sections->[4]->example->error_text
source: In a list items are seperated with a comma.
ta: ஒரு பட்டியல் உருப்படிகள் கமாவுடன் பிரிக்கப்படுகின்றன.

# teacher-guide->[8]->levels->[2]->sections->[4]->example->error_code
source: pizzas {is} funghi tonno quattro stagioni {print} pizzas {at} {random}
ta: பீச்சாக்கள் {is} காளான்கள் டுனா நான்கு பருவங்கள் {print} பீச்சாக்கள் {at} {random}

# teacher-guide->[8]->levels->[2]->sections->[4]->example->solution_text
source: After each item on your list, there should be a comma
ta: உங்கள் பட்டியலில் உள்ள ஒவ்வொரு பொருளுக்கும் பிறகு, ஒரு கமா இருக்க வேண்டும்

# teacher-guide->[8]->levels->[2]->sections->[4]->example->solution_code
source: pizzas {is} funghi, tonno, quattro stagioni {print} pizzas {at} {random}
ta: பீச்சாக்கள் {is} காளான்கள், டுனா, நான்கு பருவங்கள் {print} பீச்சாக்கள் {at} {random}

# teacher-guide->[8]->levels->[2]->sections->[5]->title
source: Students try to use `{at}` `{random}` without a list
ta: பட்டியல் இல்லாமல் மாணவர்கள் `{` `{at}` பயன்படுத்த முயற்சிக்கிறார்கள்

# teacher-guide->[8]->levels->[2]->sections->[5]->example->error_text
source: For example
ta: உதாரணமாக

# teacher-guide->[8]->levels->[2]->sections->[5]->example->error_code
source: clubs {is} Manchester United {print} clubs {at} {random}
ta: கிளப்புகள் {is} மான்செச்டர் ஒன்றுபட்டது {print} கிளப்புகள் {at {{at}

# teacher-guide->[8]->levels->[2]->sections->[5]->example->solution_text
source: Hedy can't print anything at random, because there is no list to choose from.
ta: எடி எதையும் சீரற்ற முறையில் அச்சிட முடியாது, ஏனென்றால் தேர்வு செய்ய எந்த பட்டியலும் இல்லை.

# teacher-guide->[8]->levels->[2]->sections->[5]->example->solution_code
source: clubs {is} Manchester United, Bayrn Munchen, FC Barcelona {print} clubs {at} {random}
ta: கிளப்புகள்}} மான்செச்டர் ஒன்றுபட்டது, பேயர்ன் முன்சென், எஃப்.சி பார்சிலோனா {is} கிளப்புகள் {at {{print}

# teacher-guide->[8]->levels->[2]->sections->[6]->title
source: Students try to use add/remove without a list
ta: பட்டியல் இல்லாமல் சேர்/அகற்று பயன்படுத்த மாணவர்கள் முயற்சி செய்கிறார்கள்

# teacher-guide->[8]->levels->[2]->sections->[6]->example->error_text
source: In the example below 'names' is not a list, but a variable. You cannot add anything to it.
ta: 'பெயர்கள்' கீழே உள்ள எடுத்துக்காட்டில் பட்டியல் அல்ல, ஆனால் ஒரு மாறி. நீங்கள் அதில் எதையும் சேர்க்க முடியாது.

# teacher-guide->[8]->levels->[2]->sections->[6]->example->error_code
source: names {is} Jake your_name {is} {ask} Who are you? {add} your_name {to} names {print} names {at} {random}
ta: பெயர்கள் {is} சேக் your_name {is} {ask} நீங்கள் யார்? {your_name {add} பெயர்களைச் சேர்க்கவும் {to} பெயர்கள் {at {{print}

# teacher-guide->[8]->levels->[2]->sections->[6]->example->solution_text
source: There has to be a list first, so you have to add a second name to turn names into a list, for example Amy. If you don't want amy on your list, you can use remove to remove it after.
ta: முதலில் ஒரு பட்டியல் இருக்க வேண்டும், எனவே பெயர்களை ஒரு பட்டியலாக மாற்ற இரண்டாவது பெயரைச் சேர்க்க வேண்டும், எடுத்துக்காட்டாக ஆமி. உங்கள் பட்டியலில் ஆமி விரும்பவில்லை என்றால், அதை அகற்ற அகற்று பயன்படுத்தலாம்.

# teacher-guide->[8]->levels->[2]->sections->[6]->example->solution_code
source: names {is} Jake, Amy your_name {is} {ask} Who are you? {add} your_name {to} names {print} names {at} {random}
ta: பெயர்கள் {is} சேக், ஆமி your_name {is} {ask} நீங்கள் யார்? {your_name {add} பெயர்களைச் சேர்க்கவும் {to} பெயர்கள் {at {{print}

# teacher-guide->[8]->levels->[2]->sections->[7]->title
source: Students forget to use `{to}`/`{from}` in `{add}`/`{remove}`
ta: `{to}`/`{from}` in {add} `/` {remove} `ஆகியவற்றைப் பயன்படுத்த மாணவர்கள் மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[2]->sections->[7]->example->error_text
source: Without to/from the add/remove command won't work.
ta: சேர்க்கை/சேர்க்கை/நீக்குதல் கட்டளை வேலை செய்யாது.

# teacher-guide->[8]->levels->[2]->sections->[7]->example->error_code
source: adventures {is} story, parrot, dice choice {is} Which adventure do you like best? {add} choice {remove} dice {print} I love adventures {at} {random}
ta: சாகசங்கள் {is} கதை, கிளி, பகடை சாய்ச் {is} நீங்கள் எந்த சாகசத்தை விரும்புகிறீர்கள்? {add} தேர்வு {remove} பகடை {print} நான் சாகசங்களை விரும்புகிறேன் {{{at}

# teacher-guide->[8]->levels->[2]->sections->[7]->example->solution_text
source: Hedy has to know which list the item should be added to/removed from.
ta: எந்த பட்டியலில் உருப்படி சேர்க்கப்பட வேண்டும்/அகற்றப்பட வேண்டும் என்பதை எடி தெரிந்து கொள்ள வேண்டும்.

# teacher-guide->[8]->levels->[2]->sections->[7]->example->solution_code
source: adventures {is} story, parrot, dice choice {is} Which adventure do you like best? {add} choice {to_list} adventures {remove} dice {from} adventures {print} I love adventures {at} {random}
ta: சாகசங்கள் {is} கதை, கிளி, பகடை சாய்ச் {is} நீங்கள் எந்த சாகசத்தை விரும்புகிறீர்கள்? {add} தேர்வு {to_list} சாகசங்கள் } சாகசங்களிலிருந்து} டைச் {அகற்று {remove} நான் சாகசங்களை விரும்புகிறேன் {{{from}

# teacher-guide->[8]->levels->[3]->sections->[0]->title
source: Students forget to use quotation marks on both sides of the text
ta: உரையின் இருபுறமும் மேற்கோள் மதிப்பெண்களைப் பயன்படுத்த மாணவர்கள் மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[3]->sections->[0]->example->error_text
source: In this level print and ask need a set of quotation marks. One before of the text and one after.
ta: இந்த நிலை அச்சு மற்றும் கேட்பது மேற்கோள் மதிப்பெண்களின் தொகுப்பு தேவை. உரையின் முன் ஒன்று மற்றும் பிறகு.

# teacher-guide->[8]->levels->[3]->sections->[0]->example->error_code
source: {print} Hello mood {is} {ask} 'How are you?
ta: {print} வணக்கம் மனநிலை {is {{is} 'நீங்கள் எப்படி இருக்கிறீர்கள்?

# teacher-guide->[8]->levels->[3]->sections->[0]->example->solution_text
source: Add the correct quotation marks.
ta: சரியான மேற்கோள் மதிப்பெண்களைச் சேர்க்கவும்.

# teacher-guide->[8]->levels->[3]->sections->[0]->example->solution_code
source: {print} 'Hello' mood {is} {ask} 'How are you?'
ta: {print} 'அலோ' மனநிலை {is} {ask} 'நீங்கள் எப்படி இருக்கிறீர்கள்?'

# teacher-guide->[8]->levels->[3]->sections->[1]->title
source: Students use the wrong quotation marks
ta: மாணவர்கள் தவறான மேற்கோள் மதிப்பெண்களைப் பயன்படுத்துகின்றனர்

# teacher-guide->[8]->levels->[3]->sections->[1]->example->error_text
source: It is important to start your lesson by checking if the students know how to type a quotation mark properly. On Hedy, students might use single quotes ('') and double quotes (""). Backticks on the other hand, are not considered valid quotes (``).
ta: மேற்கோள் அடையாளத்தை சரியாக தட்டச்சு செய்வது எப்படி என்று மாணவர்களுக்குத் தெரியுமா என்பதைச் சரிபார்ப்பதன் மூலம் உங்கள் பாடத்தைத் தொடங்குவது முதன்மை. எடியில், மாணவர்கள் ஒற்றை மேற்கோள்கள் ('') மற்றும் இரட்டை மேற்கோள்கள் ("") ஐப் பயன்படுத்தலாம். மறுபுறம் பின்னிணைப்புகள், செல்லுபடியாகும் மேற்கோள்களாக கருதப்படுவதில்லை (``).

# teacher-guide->[8]->levels->[3]->sections->[1]->example->error_code
source: {print} `Welcome to the restaurant` food {is} {ask} "What would you like to order?"
ta: {print} `உணவகத்திற்கு வருக` உணவு {{{is} "நீங்கள் என்ன ஆர்டர் செய்ய விரும்புகிறீர்கள்?"

# teacher-guide->[8]->levels->[3]->sections->[1]->example->solution_text
source: These are the correct quotation marks:
ta: இவை சரியான மேற்கோள் மதிப்பெண்கள்:

# teacher-guide->[8]->levels->[3]->sections->[1]->example->solution_code
source: {print} 'Welcome to the restaurant' food {is} {ask} 'What would you like to order?'
ta: {print} 'உணவகத்திற்கு வருக' உணவு {{{is} 'நீங்கள் என்ன ஆர்டர் செய்ய விரும்புகிறீர்கள்?'

# teacher-guide->[8]->levels->[3]->sections->[2]->title
source: Students use an apostrophe in their text
ta: மாணவர்கள் தங்கள் உரையில் ஒரு அப்போச்ட்ரோபியைப் பயன்படுத்துகிறார்கள்

# teacher-guide->[8]->levels->[3]->sections->[2]->example->error_text
source: From this level on apostrophes are not allowed. They are often used in English when typing contractions like you're, don't or what's.
ta: அப்போச்ட்ரோப்களில் இந்த மட்டத்திலிருந்து அனுமதிக்கப்படவில்லை. நீங்கள், வேண்டாம் அல்லது என்ன போன்ற சுருக்கங்களைத் தட்டச்சு செய்யும் போது அவை பெரும்பாலும் ஆங்கிலத்தில் பயன்படுத்தப்படுகின்றன.

# teacher-guide->[8]->levels->[3]->sections->[2]->example->error_code
source: {print} 'You're not allowed to type this'
ta: {print} 'இதைத் தட்டச்சு செய்ய உங்களுக்கு இசைவு இல்லை'

# teacher-guide->[8]->levels->[3]->sections->[2]->example->solution_text
source: You can choose to use the wrong grammar and just leave the apostrophe out. Or you could use the ` as an apostrophe.
ta: தவறான இலக்கணத்தைப் பயன்படுத்த நீங்கள் தேர்வு செய்யலாம் மற்றும் அப்போச்ட்ரோபியை வெளியே விடலாம். அல்லது நீங்கள் `ஒரு அப்போச்ட்ரோபியாகப் பயன்படுத்தலாம்.

# teacher-guide->[8]->levels->[3]->sections->[2]->example->solution_code
source: {print} 'Youre allowed to type this' {print} 'And you`re able to do this'
ta: {print} 'இதைத் தட்டச்சு செய்ய உங்களுக்கு இசைவு உண்டு' {print} 'மற்றும் நீங்கள் இதைச் செய்ய முடியும்'

# teacher-guide->[8]->levels->[4]->sections->[0]->title
source: Students forget to use `{print}` in an `{if}` command
ta: மாணவர்கள் `{print}` கட்டளையில் `{if}` பயன்படுத்த மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[4]->sections->[0]->example->error_text
source: After students use `{if}` or `{else}` they forget to use a second command like `{print}` or `{ask}`.
ta: மாணவர்கள் `{if}` அல்லது `{else}` பயன்படுத்திய பிறகு, `{print}` அல்லது `{ask}` போன்ற இரண்டாவது கட்டளையைப் பயன்படுத்த மறந்துவிடுகிறார்கள்.

# teacher-guide->[8]->levels->[4]->sections->[0]->example->error_code
source: {if} name {is} Hedy 'Great!' {else} Hedy {is} better!
ta: {if} பெயர் {is} hedy 'பெரியது!' {else} hedy {is} சிறந்தது!

# teacher-guide->[8]->levels->[4]->sections->[0]->example->solution_text
source: Add the print command to fix it.
ta: அதை சரிசெய்ய அச்சு கட்டளையைச் சேர்க்கவும்.

# teacher-guide->[8]->levels->[4]->sections->[0]->example->solution_code
source: {if} name {is} Hedy {print} 'Great!' {else} {print} 'Hedy is better!'
ta: {if} பெயர் {is} hedy {print} 'பெரியது!' {else} {print} 'hedy சிறந்தது!'
