Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-webpages-*.po
Languages: ta

# workbooks->levels->[7]->exercises->[12]->contents
source: ### Exercise 4: Correct or incorrect? Take a careful look at the programs and decide if they will trigger an error message or not.
ta: ### உடற்பயிற்சி 4: சரியானதா அல்லது தவறானதா? நிரல்களை கவனமாகப் பார்த்து, அவை பிழை செய்தியைத் தூண்டுமா இல்லையா என்பதை முடிவு செய்யுங்கள்.

# workbooks->levels->[7]->exercises->[13]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[7]->exercises->[13]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[7]->exercises->[13]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[7]->exercises->[13]->code
source: name is Hermans if name is Senkal print 'Hooray!' else print 'Bad luck'
ta: பெயர் எர்மன்ச் பெயர் சென்கல் என்றால் 'ஊரே!' வேறு 'துரதிர்ச்டம்'

# workbooks->levels->[7]->exercises->[13]->answer
source: Incorrect, there is no indentation after else
ta: தவறானது, வேறு பிறகு உள்தள்ளல் இல்லை

# workbooks->levels->[7]->exercises->[14]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[7]->exercises->[14]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[7]->exercises->[14]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[7]->exercises->[14]->code
source: number is 10 if number is 5 print 'Hooray!' else print 'Bad luck'
ta: எண் 10 எண் 5 என்றால் 'ஊரே!' வேறு 'துரதிர்ச்டம்'

# workbooks->levels->[7]->exercises->[14]->answer
source: Incorrect, the indentation was used the wrong way around.
ta: தவறானது, உள்தள்ளல் தவறான வழியில் பயன்படுத்தப்பட்டது.

# workbooks->levels->[7]->exercises->[15]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[7]->exercises->[15]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[7]->exercises->[15]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[7]->exercises->[15]->code
source: people = mom, dad, Emma, Sophie repeat 7 times print 'The dishes will be done by ' people at random
ta: மக்கள் = அம்மா, அப்பா, எம்மா, சோஃபி 'உணவுகள்' சீரற்ற முறையில் 'உணவுகள் செய்யப்படும்' என்று 7 முறை அச்சிடவும்

# workbooks->levels->[7]->exercises->[15]->answer
source: Incorrect, you can no longer use the repeat command in only one line.
ta: தவறானது, நீங்கள் இனி ஒரே வரியில் மீண்டும் மீண்டும் கட்டளையைப் பயன்படுத்த முடியாது.

# workbooks->levels->[7]->exercises->[16]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[7]->exercises->[16]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[7]->exercises->[16]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[7]->exercises->[16]->code
source: day is ask 'What is is it?' if day is friday print 'Yeah!'
ta: நாள் 'அது என்ன?' நாள் வெள்ளிக்கிழமை என்றால் 'ஆம்!'

# workbooks->levels->[7]->exercises->[16]->answer
source: Good
ta: நல்லது

# workbooks->levels->[7]->exercises->[17]->type
source: text
ta: உரை

# workbooks->levels->[7]->exercises->[17]->contents
source: #### Exercise 5: Write the code Take a good look at the output and write a matching code for it. Use `repeat` if possible. Mind the amount of lines your code needs!
ta: #### உடற்பயிற்சி 5: குறியீட்டை எழுதுங்கள் வெளியீட்டை நன்றாகப் பார்த்து, அதற்கான பொருந்தக்கூடிய குறியீட்டை எழுதுங்கள். முடிந்தால் `மீண்டும் மீண்டும்` பயன்படுத்தவும். உங்கள் குறியீட்டிற்கு தேவையான வரிகளின் அளவை நினைவில் கொள்ளுங்கள்!

# workbooks->levels->[7]->exercises->[18]->type
source: input
ta: உள்ளீடு

# workbooks->levels->[7]->exercises->[18]->answer
source: repeat 4 times print 'Yoo Hoo!'
ta: 4 முறை மீண்டும் செய்யவும் 'யூ ஊ!'

# workbooks->levels->[7]->exercises->[18]->output
source: Yoo Hoo! Yoo Hoo! Yoo Hoo! Yoo Hoo!
ta: யூ ஊ! யூ ஊ! யூ ஊ! யூ ஊ!

# workbooks->levels->[7]->exercises->[19]->type
source: input
ta: உள்ளீடு

# workbooks->levels->[7]->exercises->[19]->answer
source: repeat 2 times print 'Are you sleeping?' repeat 2 times print 'Brother John' repeat 2 times print 'Morning bells are ringing!' repeat 2 times print 'Ding Dang Dong!'
ta: 2 முறை மீண்டும் செய்யவும் 'நீங்கள் தூங்குகிறீர்களா?' 2 முறை மீண்டும் செய்யவும் 'சகோதரர் சான்' 2 முறை மீண்டும் செய்யவும் 'காலை மணிகள் ஒலிக்கின்றன!' 2 முறை மீண்டும் செய்யவும் 'டிங் டாங் டோங்!'

# workbooks->levels->[7]->exercises->[19]->output
source: Are you sleeping? Are you sleeping? Brother John Brother John Morning bells are ringing! Morning bells are ringing! Ding Dang Dong Ding Dang Dong
ta: நீங்கள் தூங்குகிறீர்களா? நீங்கள் தூங்குகிறீர்களா? சகோதரர் சான் சகோதரர் சான் காலை மணிகள் ஒலிக்கின்றன! காலை மணிகள் ஒலிக்கின்றன! டிங் டாங் டோங் டிங் டாங் டோங்

# workbooks->levels->[7]->exercises->[20]->type
source: text
ta: உரை

# workbooks->levels->[7]->exercises->[20]->contents
source: #### Exercise 6: Programming words We have learned a new programming term again: indentation! Explain it in your own words.
ta: #### உடற்பயிற்சி 6: நிரலாக்க சொற்கள் நாங்கள் மீண்டும் ஒரு புதிய நிரலாக்க காலத்தைக் கற்றுக்கொண்டோம்: உள்தள்ளல்! அதை உங்கள் சொந்த வார்த்தைகளில் விளக்குங்கள்.

# workbooks->levels->[7]->exercises->[21]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[7]->exercises->[21]->word
source: How do you create an indent?
ta: ஒரு உள்தள்ளலை எவ்வாறு உருவாக்குவது?

# workbooks->levels->[7]->exercises->[21]->answer
source: By starting a line with multiple spaces
ta: பல இடங்களுடன் ஒரு வரியைத் தொடங்குவதன் மூலம்

# workbooks->levels->[7]->exercises->[22]->type
source: text
ta: உரை

# workbooks->levels->[7]->exercises->[22]->contents
source: #### What did you think?
ta: #### நீங்கள் என்ன நினைத்தீர்கள்?

# workbooks->levels->[7]->exercises->[23]->type
source: question
ta: கேள்வி

# workbooks->levels->[7]->exercises->[23]->text
source: Which exercise did you like best this level?
ta: இந்த நிலைக்கு நீங்கள் எந்த உடற்பயிற்சியை விரும்பினீர்கள்?

# workbooks->levels->[7]->exercises->[24]->type
source: question
ta: கேள்வி

# workbooks->levels->[7]->exercises->[24]->text
source: What did you like about it?
ta: இதைப் பற்றி நீங்கள் என்ன விரும்பினீர்கள்?

# workbooks->levels->[7]->exercises->[25]->type
source: question
ta: கேள்வி

# workbooks->levels->[7]->exercises->[25]->text
source: Which exercise did you like least this level?
ta: இந்த நிலையை நீங்கள் எந்த உடற்பயிற்சியை விரும்பினீர்கள்?

# workbooks->levels->[7]->exercises->[26]->type
source: question
ta: கேள்வி

# workbooks->levels->[7]->exercises->[26]->text
source: What didn't you like about it?
ta: இதைப் பற்றி உங்களுக்கு என்ன பிடிக்கவில்லை?
