Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-webpages-*.po
Languages: ta

# teacher-guide->[8]->levels->[4]->sections->[1]->title
source: Students might use two different names for the same variable
ta: ஒரே மாறிக்கு மாணவர்கள் இரண்டு வெவ்வேறு பெயர்களைப் பயன்படுத்தலாம்

# teacher-guide->[8]->levels->[4]->sections->[1]->example->error_text
source: In this example the student has used 'horse' and 'name' for the same variables.
ta: இந்த எடுத்துக்காட்டில் மாணவர் ஒரே மாறிகளுக்கு 'குதிரை' மற்றும் 'பெயர்' ஆகியவற்றைப் பயன்படுத்தினார்.

# teacher-guide->[8]->levels->[4]->sections->[1]->example->error_code
source: horse {is} {ask} 'What is your horse called?' {if} name {is} Bonfire {print} 'cool' {else} {print} 'less cool!'
ta: குதிரை {is} {ask} 'உங்கள் குதிரை என்ன அழைக்கப்படுகிறது?' {if} பெயர் {is} Bonfire {print} 'cool' {else} {print} 'குறைவான குளிர்ச்சியாக!'

# teacher-guide->[8]->levels->[4]->sections->[1]->example->solution_text
source: Always check whether the variable has the same name throughout the code. Slight differences can be hard to spot (for example plurals) but they will interfere with the code.
ta: குறியீடு முழுவதும் மாறிக்கு ஒரே பெயர் இருக்கிறதா என்பதை எப்போதும் சரிபார்க்கவும். சிறிய வேறுபாடுகளைக் கண்டறிவது கடினம் (எடுத்துக்காட்டாக பன்மை) ஆனால் அவை குறியீட்டில் தலையிடும்.

# teacher-guide->[8]->levels->[4]->sections->[1]->example->solution_code
source: horse {is} {ask} 'What is your horse called' {if} horse {is} Bonfire {print} 'cool!' {else} {print} 'less cool!'
ta: குதிரை {is} {ask} 'உங்கள் குதிரை என்ன அழைக்கப்படுகிறது' {if} குதிரை {is} Bonfire {print} 'cool!' {else} {print} 'குறைவான குளிர்ச்சியாக!'

# teacher-guide->[8]->levels->[4]->sections->[2]->title
source: Students still forget the quotes on both sides
ta: மாணவர்கள் இன்னும் இருபுறமும் மேற்கோள்களை மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[4]->sections->[2]->example->error_text
source: Using the `if` command can make the code lines very long and students tend to forget to use quotes.
ta: `If` கட்டளையைப் பயன்படுத்துவது குறியீடு கோடுகளை மிக நீளமாக்க முடியும் மற்றும் மாணவர்கள் மேற்கோள்களைப் பயன்படுத்த மறந்துவிடுவார்கள்.

# teacher-guide->[8]->levels->[4]->sections->[2]->example->error_code
source: {if} name {is} Hedy {print} fun {else} {print} 'meh!
ta: {if} பெயர் {is} hedy {print} fun {else} {print} 'meh!

# teacher-guide->[8]->levels->[4]->sections->[2]->example->solution_text
source: Always use 2 quotes in a print command.
ta: அச்சு கட்டளையில் எப்போதும் 2 மேற்கோள்களைப் பயன்படுத்துங்கள்.

# teacher-guide->[8]->levels->[4]->sections->[2]->example->solution_code
source: {if} name {is} Hedy {print} 'fun' {else} {print} 'meh!'
ta: {if} பெயர் {is} hedy {print} 'fun' {else} {print} 'meh!'

# teacher-guide->[8]->levels->[4]->sections->[3]->title
source: Students use quotes around variable names
ta: மாணவர்கள் மாறி பெயர்களைச் சுற்றி மேற்கோள்களைப் பயன்படுத்துகின்றனர்

# teacher-guide->[8]->levels->[4]->sections->[3]->example->error_text
source: In this level there are no quotes around variable names.
ta: இந்த மட்டத்தில் மாறி பெயர்களைச் சுற்றி மேற்கோள்கள் இல்லை.

# teacher-guide->[8]->levels->[4]->sections->[3]->example->error_code
source: {if} name {is} 'Hedy' {print} 'fun' {else} {print} 'meh!'
ta: {if} பெயர் {is} 'hedy' {print} 'fun' {else} {print} 'meh!'

# teacher-guide->[8]->levels->[4]->sections->[3]->example->solution_text
source: Remove the quotes to get the code to work.
ta: குறியீட்டை வேலை செய்ய மேற்கோள்களை அகற்றவும்.

# teacher-guide->[8]->levels->[4]->sections->[3]->example->solution_code
source: {if} name {is} Hedy {print} 'fun' {else} {print} 'meh!
ta: {if} பெயர் {is} hedy {print} 'fun' {else} {print} 'meh!

# teacher-guide->[8]->levels->[4]->sections->[4]->title
source: Students use long variable names containing two or more words
ta: மாணவர்கள் இரண்டு அல்லது அதற்கு மேற்பட்ட சொற்களைக் கொண்ட நீண்ட மாறி பெயர்களைப் பயன்படுத்துகின்றனர்

# teacher-guide->[8]->levels->[4]->sections->[4]->example->error_text
source: Variables in Hedy can't contain spaces, so, in order to use together several words, students need to connect them using underscores (_)
ta: எடியில் உள்ள மாறிகள் இடைவெளிகளைக் கொண்டிருக்க முடியாது, எனவே, பல சொற்களை ஒன்றாகப் பயன்படுத்த, மாணவர்கள் அடிக்கோடிட்டு (_) ஐப் பயன்படுத்தி அவற்றை இணைக்க வேண்டும்

# teacher-guide->[8]->levels->[4]->sections->[4]->example->error_code
source: chosen door is ask Which door do you pick?
ta: தேர்ந்தெடுக்கப்பட்ட கதவு நீங்கள் எந்த கதவைத் தேர்ந்தெடுப்பீர்கள் என்று கேளுங்கள்?

# teacher-guide->[8]->levels->[4]->sections->[4]->example->solution_text
source: Add an underscore.
ta: அடிக்கோடிட்டு சேர்க்கவும்.

# teacher-guide->[8]->levels->[4]->sections->[4]->example->solution_code
source: chosen_door {is} {ask} 'which door do you pick?'
ta: தேர்ந்தெடுக்கப்பட்ட கதவு {is} {ask} 'நீங்கள் எந்த கதவைத் தேர்ந்தெடுப்பீர்கள்?'

# teacher-guide->[8]->levels->[4]->sections->[5]->title
source: Students want multiple answers to be correct
ta: மாணவர்கள் பல பதில்களை சரியாக இருக்க விரும்புகிறார்கள்

# teacher-guide->[8]->levels->[4]->sections->[5]->example->error_text
source: For example this student wants Hedy to tell all his friends that they are funny, while other classmates should be told that they are not.
ta: உதாரணமாக, இந்த மாணவர் தனது நண்பர்கள் அனைவருக்கும் அவர்கள் வேடிக்கையானவர்கள் என்று சொல்ல வேண்டும், மற்ற வகுப்பு தோழர்கள் அவர்கள் இல்லை என்று சொல்லப்பட வேண்டும்.

# teacher-guide->[8]->levels->[4]->sections->[5]->example->error_code
source: {if} name {is} Jesse, David, Souf {print} 'You are funny' {else} {print} 'You are not funny'
ta: {if} பெயர் {is} செச்சி, டேவிட், ச ouf {print} 'நீங்கள் வேடிக்கையானவர்' {else} {print} 'நீங்கள் வேடிக்கையானவர் அல்ல'

# teacher-guide->[8]->levels->[4]->sections->[5]->example->solution_text
source: You could use the `{in}` command for that. While it is explained in a higher level, it does already work in level 5. Another solution is to use multiple `{if}` commands and no `{else}` command. The disadvantage is that it won't tell the other classmates that they are not funny.
ta: அதற்காக `{in}` கட்டளையைப் பயன்படுத்தலாம். இது உயர் மட்டத்தில் விளக்கப்பட்டாலும், இது ஏற்கனவே 5 ஆம் மட்டத்தில் வேலை செய்கிறது. மற்றொரு தீர்வு என்னவென்றால், பல `{if if` கட்டளைகள் மற்றும் `{if}` கட்டளை இல்லை. குறைபாடு என்னவென்றால், மற்ற வகுப்பு தோழர்கள் அவர்கள் வேடிக்கையானவர்கள் அல்ல என்று அது சொல்லாது.

# teacher-guide->[8]->levels->[4]->sections->[5]->example->solution_code
source: friends {is} Jesse, David, Souf name {is} {ask} 'Who are you?' {if} name {in} friends {print} 'You are funny' {else} {print} 'You are not funny' # or name {is} {ask} 'Who are you?' {if} naam {is} Jesse {print} 'You are funny' {if} naam {is} David {print} 'You are funny' {if} naam {is} Souf {print} 'You are funny'
ta: நண்பர்கள் {is} செச்சி, டேவிட், ச ouf பெயர் {is} {ask} 'நீங்கள் யார்?' {if} பெயர் {in} நண்பர்களில் {print} 'நீங்கள் வேடிக்கையானவர்' {else} {print} 'நீங்கள் வேடிக்கையானவர் அல்ல' # அல்லது பெயர் {is} {ask} 'நீங்கள் யார்?' {if} naam {is} jesse {print} 'நீங்கள் வேடிக்கையானவர்' {if} naam {is} டேவிட் {print} 'நீங்கள் வேடிக்கையானவர்' {if} naam {is} souf {print} 'நீங்கள் வேடிக்கையானவர்'

# teacher-guide->[8]->levels->[4]->sections->[6]->title
source: The students make the variable name the same as the value in the `{if}` statement
ta: மாணவர்கள் `{if}` அறிக்கையில் உள்ள மதிப்பைப் போலவே மாறி பெயரை உருவாக்குகிறார்கள்

# teacher-guide->[8]->levels->[4]->sections->[6]->example->error_text
source: In the example below the password is 'password'. This will result in it always being correct.
ta: கடவுச்சொல்லுக்கு கீழே உள்ள எடுத்துக்காட்டில் 'கடவுச்சொல்' உள்ளது. இது எப்போதும் சரியாக இருக்கும்.

# teacher-guide->[8]->levels->[4]->sections->[6]->example->error_code
source: password {is} {ask} 'What is the password?' {if} password {is} password {print} 'Access granted' {else} {print} 'Acces denied!'
ta: கடவுச்சொல் {is {{is} 'கடவுச்சொல் என்றால் என்ன?' {ask} கடவுச்சொல் {if} கடவுச்சொல் {is} 'அணுகல் வழங்கப்பட்டது' {else} {print} 'மறுக்கப்பட்டது!'

# teacher-guide->[8]->levels->[4]->sections->[6]->example->solution_text
source: Pick a different name for your variable.
ta: உங்கள் மாறிக்கு வேறு பெயரைத் தேர்ந்தெடுக்கவும்.

# teacher-guide->[8]->levels->[4]->sections->[6]->example->solution_code
source: secret_password {is} {ask} 'What is the password' {if} secret_password {is} password {print} 'Access granted!' {else} {print} 'Access denied!'
ta: ரகசியம்_பாச் வேர்ட் {is} {ask} 'கடவுச்சொல் என்ன' {if} rection_password {is} கடவுச்சொல் {print} 'அணுகல் வழங்கப்பட்டது!' {else} {print} 'அணுகல் மறுக்கப்பட்டது!'

# teacher-guide->[8]->levels->[5]->sections->[0]->title
source: Students struggle with quotation marks
ta: மாணவர்கள் மேற்கோள் மதிப்பெண்களுடன் போராடுகிறார்கள்

# teacher-guide->[8]->levels->[5]->sections->[0]->example->error_text
source: Some students struggle with adding quotation marks or not. If you add quotation marks, the output screen will literally show '5+5'.
ta: சில மாணவர்கள் மேற்கோள் குறிகளைச் சேர்ப்பதில் போராடுகிறார்கள் இல்லையா. நீங்கள் மேற்கோள் மதிப்பெண்களைச் சேர்த்தால், வெளியீட்டுத் திரை உண்மையில் '5+5' ஐக் காண்பிக்கும்.

# teacher-guide->[8]->levels->[5]->sections->[0]->example->solution_text
source: In this code the output screen will print '10'.
ta: இந்த குறியீட்டில் வெளியீட்டுத் திரை '10' அச்சிடும்.

# teacher-guide->[8]->levels->[5]->sections->[1]->title
source: Students struggle with the concept of doing maths with a variable
ta: மாணவர்கள் ஒரு மாறியுடன் கணிதத்தைச் செய்வதற்கான கருத்துடன் போராடுகிறார்கள்

# teacher-guide->[8]->levels->[5]->sections->[1]->example->error_text
source: Some students will find it hard to do maths with variables. Try to show them very simple examples, like:
ta: சில மாணவர்கள் மாறிகள் கொண்ட கணிதத்தைச் செய்வது கடினம். அவற்றைப் போன்ற மிக எளிய எடுத்துக்காட்டுகளைக் காட்ட முயற்சிக்கவும்:

# teacher-guide->[8]->levels->[5]->sections->[1]->example->error_code
source: age = {ask} 'How old are you?' {print} 'Next year you will be ' age + 1
ta: அகவை = {ask} 'உங்களுக்கு எவ்வளவு வயது?' {print} 'அடுத்த ஆண்டு நீங்கள்' அகவை + 1 ஆக இருப்பீர்கள்

# teacher-guide->[8]->levels->[5]->sections->[1]->example->solution_text
source: Or take it a step further like this.
ta: அல்லது இது போன்ற ஒரு படி மேலே செல்லுங்கள்.

# teacher-guide->[8]->levels->[5]->sections->[1]->example->solution_code
source: price = 0 {print} 'Welcome to our burger restaurant' burger = {ask} 'Would you like a burger?' {if} burger = yes price = price + 10 drink = {ask} 'Would you like a drink?' {if} drink = yes price = price + 4 {print} 'That will be ' price ' euros please'
ta: விலை = 0 {print} 'எங்கள் பர்கர் உணவகத்திற்கு வரவேற்கிறோம்' பர்கர் = {ask} 'நீங்கள் ஒரு பர்கரை விரும்புகிறீர்களா?' {if} பர்கர் = ஆம் விலை = விலை + 10 பானம் = {ask} 'நீங்கள் ஒரு பானம் விரும்புகிறீர்களா?' {if} பானம் = ஆம் விலை = விலை + 4 {print} 'அது' விலை 'யூரோக்களாக இருக்கும்'

# teacher-guide->[8]->levels->[6]->sections->[0]->title
source: Students forget one of the word of the repeat command, or they forget the print command
ta: மீண்டும் மீண்டும் கட்டளையின் வார்த்தையில் ஒன்றை மாணவர்கள் மறந்துவிடுகிறார்கள், அல்லது அவர்கள் அச்சு கட்டளையை மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[6]->sections->[0]->example->error_text
source: Make sure that the students know to use both the full repeat command and the print command.
ta: முழு மீண்டும் கட்டளை மற்றும் அச்சு கட்டளை இரண்டையும் பயன்படுத்த மாணவர்களுக்கு தெரியும் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# teacher-guide->[8]->levels->[6]->sections->[0]->example->error_code
source: {repeat} 3 {times} For he`s a jolly good fellow {repeat} 3 print
ta: {repeat} 3 {times} ஏனென்றால் அவர் ஒரு நல்ல நல்லவர் {repeat} 3 அச்சு

# teacher-guide->[8]->levels->[6]->sections->[0]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[6]->sections->[0]->example->solution_code
source: {repeat} 3 {times} {print} 'For he`s a jolly good fellow' {repeat} 3 {times} {print} 'Which nobody can deny!'
ta: {repeat} 3 {times} {print} 'அவர் ஒரு நல்ல நல்ல தம மனிதர்' {repeat} 3 {times} {print} 'அதை யாரும் மறுக்க முடியாது!'

# teacher-guide->[8]->levels->[6]->sections->[1]->title
source: Students try to repeat multiple lines
ta: மாணவர்கள் பல வரிகளை மீண்டும் செய்ய முயற்சிக்கிறார்கள்

# teacher-guide->[8]->levels->[6]->sections->[1]->example->error_text
source: In this level you can only repeat one line of code multiple times. In this code the student wanted to print 3 different drinks, but it won't work. It will ask the question 3 times and only print the last answer.
ta: இந்த மட்டத்தில் நீங்கள் ஒரு வரியை பல முறை மட்டுமே மீண்டும் செய்ய முடியும். இந்த குறியீட்டில் மாணவர் 3 வெவ்வேறு பானங்களை அச்சிட விரும்பினார், ஆனால் அது வேலை செய்யாது. இது கேள்வியை 3 முறை கேட்கும் மற்றும் கடைசி பதிலை மட்டுமே அச்சிடுகிறது.

# teacher-guide->[8]->levels->[6]->sections->[1]->example->error_code
source: {repeat} 3 {times} drink = {ask} 'What would you like to drink?' {print} drink
ta: {repeat} 3 {times} பானம் = {ask} 'நீங்கள் என்ன குடிக்க விரும்புகிறீர்கள்?' {print} பானம்

# teacher-guide->[8]->levels->[6]->sections->[1]->example->solution_text
source: You should go to the next level to be able to repeat multiple lines. So on this level you'll have to print everything seperately.
ta: பல வரிகளை மீண்டும் செய்ய நீங்கள் அடுத்த நிலைக்குச் செல்ல வேண்டும். எனவே இந்த மட்டத்தில் நீங்கள் எல்லாவற்றையும் தனித்தனியாக அச்சிட வேண்டும்.

# teacher-guide->[8]->levels->[6]->sections->[1]->example->solution_code
source: drink = {ask} 'What would you like to drink?' {print} drink drink = {ask} 'What would you like to drink?' {print} drink drink = {ask} 'What would you like to drink?' {print} drink
ta: பானம் = {ask} 'நீங்கள் என்ன குடிக்க விரும்புகிறீர்கள்?' {print} பானம் பானம் = {ask} 'நீங்கள் என்ன குடிக்க விரும்புகிறீர்கள்?' {print} பானம் பானம் = {ask} 'நீங்கள் என்ன குடிக்க விரும்புகிறீர்கள்?' {print} பானம்

# teacher-guide->[8]->levels->[6]->sections->[2]->title
source: Students make programs that take too long to run
ta: மாணவர்கள் இயக்க அதிக நேரம் எடுக்கும் திட்டங்களை உருவாக்குகிறார்கள்

# teacher-guide->[8]->levels->[6]->sections->[2]->example->error_text
source: In this level it's very easy to make programs that take a lot of time to complete. If the program takes too long, it'll be stopped, this with the intention to prevent straining the student's machine.
ta: இந்த மட்டத்தில் முடிக்க நிறைய நேரம் எடுக்கும் நிரல்களை உருவாக்குவது மிகவும் எளிதானது. நிரல் அதிக நேரம் எடுத்தால், அது நிறுத்தப்படும், இது மாணவர்களின் இயந்திரத்தை கச்டப்படுத்துவதைத் தடுக்கும் நோக்கத்துடன்.

# teacher-guide->[8]->levels->[6]->sections->[2]->example->error_code
source: {repeat} 100 {times} {print} 'How many times can I repeat this?'
ta: {repeat} 100 {times} {print} 'இதை எத்தனை முறை மீண்டும் செய்ய முடியும்?'

# teacher-guide->[8]->levels->[6]->sections->[2]->example->solution_text
source: Make sure the code doesn't take too long to execute
ta: குறியீடு செயல்படுத்த அதிக நேரம் எடுக்காது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்

# teacher-guide->[8]->levels->[6]->sections->[2]->example->solution_code
source: {repeat} 20 {times} {print} 'This is enough'
ta: {repeat} 20 {times} {print} 'இது போதும்'

# teacher-guide->[8]->levels->[7]->sections->[0]->title
source: Students use the indentation wrong
ta: மாணவர்கள் உள்தள்ளலை தவறாகப் பயன்படுத்துகிறார்கள்

# teacher-guide->[8]->levels->[7]->sections->[0]->example->error_text
source: Indentation is a new concept in this level, and for some students it might be hard to learn. Make sure they practise some simple examples before making a whole program with it.
ta: உள்தள்ளல் இந்த மட்டத்தில் ஒரு புதிய கருத்தாகும், சில மாணவர்களுக்கு அதைக் கற்றுக்கொள்வது கடினமாக இருக்கலாம். ஒரு முழு நிரலையும் உருவாக்குவதற்கு முன்பு அவர்கள் சில எளிய எடுத்துக்காட்டுகளை பயிற்சி செய்கிறார்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# teacher-guide->[8]->levels->[7]->sections->[0]->example->error_code
source: {repeat} 3 {times} {print} 'hello'
ta: {repeat} 3 {times} {print} 'அலோ'

# teacher-guide->[8]->levels->[7]->sections->[0]->example->solution_text
source: This is the correct code:
ta: இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[7]->sections->[0]->example->solution_code
source: {repeat} 3 {times} {print} 'hello'
ta: {repeat} 3 {times} {print} 'அலோ'

# teacher-guide->[8]->levels->[7]->sections->[1]->title
source: Students only repeat 1 line when they wanted to repeat multiple lines
ta: மாணவர்கள் பல வரிகளை மீண்டும் செய்ய விரும்பும்போது 1 வரியை மட்டுமே மீண்டும் கூறுகிறார்கள்

# teacher-guide->[8]->levels->[7]->sections->[1]->example->error_text
source: For instance, in the code below the student wanted to take the drinks order of 3 people. But instead the program asked 3 times, but only wrote down one order.
ta: உதாரணமாக, கீழே உள்ள குறியீட்டில் மாணவர் 3 பேரின் பானங்களை எடுக்க விரும்பினார். ஆனால் அதற்கு பதிலாக நிரல் 3 முறை கேட்டது, ஆனால் ஒரு ஆர்டரை மட்டுமே எழுதினார்.

# teacher-guide->[8]->levels->[7]->sections->[1]->example->error_code
source: {repeat} 3 {times} drink = {ask} 'What would you like to drink?' {print} drink
ta: {repeat} 3 {times} பானம் = {ask} 'நீங்கள் என்ன குடிக்க விரும்புகிறீர்கள்?' {print} பானம்

# teacher-guide->[8]->levels->[7]->sections->[1]->example->solution_text
source: In the correct code the third line starts with indentation too. This way it belongs to the repeat block and therefore it will be repeated 3 times. Showing your students these differences can help them understand why we need indentation to make our programs work.
ta: சரியான குறியீட்டில் மூன்றாவது வரி உள்தள்ளலுடன் தொடங்குகிறது. இந்த வழியில் இது மீண்டும் மீண்டும் தொகுதிக்கு சொந்தமானது, எனவே இது 3 முறை மீண்டும் செய்யப்படும். உங்கள் மாணவர்களுக்கு இந்த வேறுபாடுகளைக் காண்பிப்பது, எங்கள் திட்டங்களை செயல்படுத்துவதற்கு எங்களுக்கு ஏன் உள்தள்ளல் தேவை என்பதைப் புரிந்துகொள்ள அவர்களுக்கு உதவும்.

# teacher-guide->[8]->levels->[7]->sections->[1]->example->solution_code
source: {repeat} 3 {times} drink = {ask} 'What would you like to drink?' {print} drink
ta: {repeat} 3 {times} பானம் = {ask} 'நீங்கள் என்ன குடிக்க விரும்புகிறீர்கள்?' {print} பானம்

# teacher-guide->[8]->levels->[7]->sections->[2]->title
source: Students want to nest `{if}` statements, or put `{if}` statements inside a loop
ta: மாணவர்கள் கூடு கட்ட விரும்புகிறார்கள் `{if}` அறிக்கைகள், அல்லது `{if}` அறிக்கைகளை ஒரு வளையத்திற்குள் வைக்கவும்

# teacher-guide->[8]->levels->[7]->sections->[2]->example->error_text
source: In this level students aren't allowed yet to put `{if}` statements inside other `{if}` statements or inside repeat loops. In the next level this is allowed.
ta: இந்த மட்டத்தில் மாணவர்கள் இன்னும் `{if` அறிக்கைகளை மற்ற `{if}` அறிக்கைகள் அல்லது மீண்டும் மீண்டும் சுழல்களுக்குள் வைக்க அனுமதிக்கப்படவில்லை. அடுத்த கட்டத்தில் இது அனுமதிக்கப்படுகிறது.

# teacher-guide->[8]->levels->[7]->sections->[2]->example->error_code
source: birthday = {ask} 'Is it you birthday?' {if} birthday = yes {repeat} 3 {times} {print} 'Hip Hip Hooray!'
ta: பிறந்த நாள் = {ask} 'இது உங்கள் பிறந்தநாளா?' {if} பிறந்த நாள் = ஆம் {repeat} 3 {times} {print} 'இடுப்பு இடுப்பு ஊரே!'

# teacher-guide->[8]->levels->[7]->sections->[2]->example->solution_text
source: This is the correct code for this level:
ta: இந்த நிலைக்கு இது சரியான குறியீடு:

# teacher-guide->[8]->levels->[7]->sections->[2]->example->solution_code
source: birthday = {ask} 'Is it you birthday?' {if} birthday = yes {print} 'Hip Hip Hooray!' {print} 'Hip Hip Hooray!' {print} 'Hip Hip Hooray!'
ta: பிறந்த நாள் = {ask} 'இது உங்கள் பிறந்தநாளா?' {if} பிறந்த நாள் = ஆம் {print} 'இடுப்பு இடுப்பு ஊரே!' {print} 'இடுப்பு இடுப்பு ஊரே!' {print} 'இடுப்பு இடுப்பு ஊரே!'

# teacher-guide->[8]->levels->[7]->sections->[3]->title
source: Students make programs that take too long to run
ta: மாணவர்கள் இயக்க அதிக நேரம் எடுக்கும் திட்டங்களை உருவாக்குகிறார்கள்

# teacher-guide->[8]->levels->[7]->sections->[3]->example->error_text
source: In this level it's very easy to make programs that take a lot of time to complete. If the program takes too long, it'll be stopped, this with the intention to prevent straining the student's machine.
ta: இந்த மட்டத்தில் முடிக்க நிறைய நேரம் எடுக்கும் நிரல்களை உருவாக்குவது மிகவும் எளிதானது. நிரல் அதிக நேரம் எடுத்தால், அது நிறுத்தப்படும், இது மாணவர்களின் இயந்திரத்தை கச்டப்படுத்துவதைத் தடுக்கும் நோக்கத்துடன்.

# teacher-guide->[8]->levels->[7]->sections->[3]->example->error_code
source: {repeat} 100 {times} {print} 'How many times can I repeat this?'
ta: {repeat} 100 {times} {print} 'இதை எத்தனை முறை மீண்டும் செய்ய முடியும்?'

# teacher-guide->[8]->levels->[7]->sections->[3]->example->solution_text
source: Make sure the code doesn't take too long to execute
ta: குறியீடு செயல்படுத்த அதிக நேரம் எடுக்காது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்

# teacher-guide->[8]->levels->[7]->sections->[3]->example->solution_code
source: {repeat} 20 {times} {print} 'This is enough'
ta: {repeat} 20 {times} {print} 'இது போதும்'

# teacher-guide->[8]->levels->[7]->sections->[4]->title
source: Students use the `{if}` command to check if the variable value is the same as the variable name
ta: மாறி மதிப்பு மாறி பெயருக்கு சமமானதா என்பதைச் சரிபார்க்க மாணவர்கள் `{if}` கட்டளையைப் பயன்படுத்துகின்றனர்

# teacher-guide->[8]->levels->[7]->sections->[4]->example->error_text
source: We've noticed a common error among our students: they try to create a program that checks for a password, but they make the password 'password'. In line 2 the computer is asked to check whether the variable password is the same as the variable password, so itself. Which means the answer is always yes. So with this code the answer will always be 'You can come in' no matter what the player fills in.
ta: எங்கள் மாணவர்களிடையே ஒரு பொதுவான பிழையை நாங்கள் கவனித்திருக்கிறோம்: கடவுச்சொல்லை சரிபார்க்கிறது, ஆனால் அவை கடவுச்சொல்லை 'கடவுச்சொல்லை' உருவாக்குகின்றன. 2 வது வரிசையில், மாறி கடவுச்சொல் மாறி கடவுச்சொல்லுக்கு சமமானதா என்பதைச் சரிபார்க்க கணினி கேட்கப்படுகிறது, எனவே தானே. அதாவது பதில் எப்போதும் ஆம். எனவே இந்த குறியீட்டைக் கொண்டு பதில் எப்போதும் 'நீங்கள் வரலாம்' வீரர் என்ன நிரப்பினாலும் பரவாயில்லை.

# teacher-guide->[8]->levels->[7]->sections->[4]->example->error_code
source: password {is} {ask} 'What is the password?' {if} password {is} password {print} 'You can come in' {else} {print} 'You are not allowed'
ta: கடவுச்சொல் {is {{is} 'கடவுச்சொல் என்றால் என்ன?' } என்றால்} கடவுச்சொல் {ask} கடவுச்சொல் {if} 'நீங்கள் வரலாம்' {is} {print} 'உங்களுக்கு அனுமதிக்கப்படவில்லை'

# teacher-guide->[8]->levels->[7]->sections->[4]->example->solution_text
source: You can fix this mistake by adding quotation marks. This way the computer knows that the second password in `{if} password {is} 'password'` is a string value (so normal text) and not the variable name.
ta: மேற்கோள் மதிப்பெண்களைச் சேர்ப்பதன் மூலம் இந்த தவறை நீங்கள் சரிசெய்யலாம். `{is} கடவுச்சொல் {if} 'கடவுச்சொல்'` ஒரு சரம் மதிப்பு (எனவே சாதாரண உரை) மற்றும் மாறி பெயர் அல்ல என்பதை கணினி இந்த வழியில் கணினிக்கு தெரியும்.

# teacher-guide->[8]->levels->[7]->sections->[4]->example->solution_code
source: password {is} {ask} 'What is the password?' {if} password {is} 'password' {print} 'You can come in' {else} {print} 'You are not allowed'
ta: கடவுச்சொல் {is {{is} 'கடவுச்சொல் என்றால் என்ன?' {ask} கடவுச்சொல் {if} 'கடவுச்சொல்' {is} 'நீங்கள் வரலாம்' {print} {else} 'உங்களுக்கு அனுமதிக்கப்படவில்லை'

# teacher-guide->[8]->levels->[8]->sections->[0]->title
source: Students make mistakes with indentation
ta: மாணவர்கள் உள்தள்ளலுடன் தவறு செய்கிறார்கள்

# teacher-guide->[8]->levels->[8]->sections->[0]->example->error_text
source: The hardest part about this level is getting the indentation right. Students love nesting `{if}` statements, sometimes even inside other nested `{if}` statements. Keeping track of indentation can get pretty tough.
ta: இந்த நிலையைப் பற்றிய கடினமான பகுதி உள்தள்ளலை சரியாகப் பெறுகிறது. மாணவர்கள் கூடு கட்டுவதை விரும்புகிறார்கள் `{if` அறிக்கைகள், சில சமயங்களில் மற்ற கூடு {if} `அறிக்கைகளுக்குள் கூட. உள்தள்ளலைக் கண்காணிப்பது மிகவும் கடினமாக இருக்கும்.
