Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-webpages-*.po
Languages: ta

# teacher-guide->[4]->subsections->[3]->text
source: <img src="https://github.com/hedyorg/hedy/assets/80678586/693e976c-199f-46f4-abae-3f18f9854cd0" width="1000"> Here you can find a list of your students and you can see their individual progress. The blue ring shows you what your students are currently working on. <img src="https://github.com/hedyorg/hedy/assets/80678586/c7e2150f-60de-4ef7-8862-5901a7fb6609" width="150"> It is important to notice that the blue dots means that a students 'attempted' the adventure. This means that they ran a code in this adventure and went on to the next adventure, so this does not automatically mean that they did a good job! If you want to see how an individual student is getting along, you can click their name in this overview. This is what you see if you click on marleen_h3a for example: <img src="https://github.com/hedyorg/hedy/assets/80678586/f8c2480d-c724-46f9-a702-33532828de70" width="800"> You see that Marleen is having some trouble programming. She tried to run a program that contains blanks multiple times, so she might not realize that she has to change the code examples before running them. In this way this overview can give you a better understanding of what a student is struggling with.
ta: <img src = "https://github.com/hedib. இங்கே நீங்கள் உங்கள் மாணவர்களின் பட்டியலைக் காணலாம், மேலும் அவர்களின் தனிப்பட்ட முன்னேற்றத்தை நீங்கள் காணலாம். உங்கள் மாணவர்கள் தற்போது என்ன வேலை செய்கிறார்கள் என்பதை ப்ளூ ரிங் காட்டுகிறது. <img src = "https://github.com/hdedurg/hedy/assets/80678586/c7e2150f-60de-4ef7-8862-8862-5901a7fb6609" அகலம் = "150"> நீல புள்ளிகள் என்பது ஒரு மாணவர்கள் சாகசத்தை 'முயற்சித்தனர்' என்று பொருள் என்பதை கவனிக்க வேண்டியது தேவை. இதன் பொருள் அவர்கள் இந்த சாகசத்தில் ஒரு குறியீட்டை நடத்தி அடுத்த சாகசத்திற்குச் சென்றனர், எனவே இது தானாகவே அவர்கள் ஒரு நல்ல வேலையைச் செய்தார்கள் என்று அர்த்தமல்ல! ஒரு தனிப்பட்ட மாணவர் எவ்வாறு பழகுகிறார் என்பதை நீங்கள் காண விரும்பினால், இந்த கண்ணோட்டத்தில் அவர்களின் பெயரைக் சொடுக்கு செய்யலாம். உதாரணமாக நீங்கள் மார்லீன்_எச் 3a இல் சொடுக்கு செய்தால் இதுதான் நீங்கள் பார்க்கிறீர்கள்: <img src = "https://github.com/hdedurg/hedy/assets/80678586/f8c2480d-c724-46f9-a702-33532828de70" அகலம் = "800"> மார்லீனுக்கு சில சிக்கல் நிரலாக்கத்தை நீங்கள் காண்கிறீர்கள். அவர் பல முறை வெற்றிடங்களைக் கொண்ட ஒரு திட்டத்தை இயக்க முயன்றார், எனவே குறியீடு எடுத்துக்காட்டுகளை இயக்குவதற்கு முன்பு அவள் மாற்ற வேண்டும் என்பதை அவள் உணரவில்லை. இந்த வழியில் இந்த கண்ணோட்டம் ஒரு மாணவர் என்ன போராடுகிறார் என்பதைப் பற்றிய சிறந்த புரிதலை உங்களுக்கு வழங்க முடியும்.

# teacher-guide->[4]->subsections->[4]->title
source: Common Errors
ta: பொதுவான பிழைகள்

# teacher-guide->[4]->subsections->[4]->text
source: <img src="https://github.com/hedyorg/hedy/assets/80678586/e7af5ce3-ca74-48e7-9654-f17435596fbc" width="500"> If you're not only interested in individual struggles of your students, but you'd like to know what the whole class seems to be doing wrong, you can use this oversight of common errors. The most common error messages that your students are recieving will appear in this oversight for you, so you could give some more instructions to the whole class if needed. By clicking the error, you can see which students are having trouble with this error. By clicking resolve, you'll remove this error from the list.
ta: <img src = "https://github.com/hdedurg/hedy/assets/80678586/e7af5ce3ca74-48e7-9654-F17435596fbc" அகலம் = "500"> உங்கள் மாணவர்களின் தனிப்பட்ட போராட்டங்களில் நீங்கள் ஆர்வம் காட்டவில்லை, ஆனால் முழு வகுப்பினரும் என்ன தவறு செய்கிறார்கள் என்று நீங்கள் அறிய விரும்பினால், பொதுவான பிழைகளின் இந்த மேற்பார்வையைப் பயன்படுத்தலாம். உங்கள் மாணவர்கள் பெறும் மிகவும் பொதுவான பிழை செய்திகள் உங்களுக்காக இந்த மேற்பார்வையில் தோன்றும், எனவே தேவைப்பட்டால் முழு வகுப்பிற்கும் இன்னும் சில வழிமுறைகளை வழங்கலாம். பிழையைக் சொடுக்கு செய்வதன் மூலம், இந்த பிழையில் எந்த மாணவர்கள் சிக்கல் உள்ளனர் என்பதை நீங்கள் காணலாம். தீர்வைக் சொடுக்கு செய்வதன் மூலம், இந்த பிழையை பட்டியலிலிருந்து அகற்றுவீர்கள்.

# teacher-guide->[4]->subsections->[5]->title
source: Overview of programs per adventure
ta: ஒரு சாகசத்திற்கு நிகழ்ச்சிகளின் கண்ணோட்டம்

# teacher-guide->[4]->subsections->[5]->text
source: <img src="https://github.com/hedyorg/hedy/assets/80678586/f07bf714-7250-4711-82a1-616f9f7b55e8" width="1000"> Another useful overview of all the programs your students made in a level can be found on your class page. Go to the class page and click 'Overview of programs per adventure'. Here you'll find this overview. You could use this overview to check your students' work. If they have made a program in an adventure, an eye appears in your overview. Click the eye to view their work. Did you like it? Then you can check the box and a green tick will appear. This way you create a nice overview for yourself of your students' results.
ta: <img src = "https://github.com/hediorg/hedy/assets/80678586/f07bf714-7250-4711-82A1-616F9F7B55E8" அகலம் = "1000"> உங்கள் மாணவர்கள் ஒரு மட்டத்தில் உருவாக்கிய அனைத்து திட்டங்களின் மற்றொரு பயனுள்ள கண்ணோட்டத்தை உங்கள் வகுப்பு பக்கத்தில் காணலாம். வகுப்பு பக்கத்திற்குச் சென்று 'ஒரு சாகசத்திற்கு நிரல்களின் கண்ணோட்டம்' என்பதைக் சொடுக்கு செய்க. இந்த கண்ணோட்டத்தை இங்கே காணலாம். உங்கள் மாணவர்களின் வேலையைச் சரிபார்க்க இந்த கண்ணோட்டத்தைப் பயன்படுத்தலாம். அவர்கள் ஒரு சாகசத்தில் ஒரு திட்டத்தை உருவாக்கியிருந்தால், உங்கள் கண்ணோட்டத்தில் ஒரு கண் தோன்றும். அவர்களின் வேலையைக் காண கண்ணைக் சொடுக்கு செய்க. உங்களுக்கு பிடித்ததா? நீங்கள் பெட்டியை சரிபார்க்கலாம் மற்றும் ஒரு பச்சை டிக் தோன்றும். இந்த வழியில் உங்கள் மாணவர்களின் முடிவுகளைப் பற்றி நீங்களே ஒரு நல்ல கண்ணோட்டத்தை உருவாக்குகிறீர்கள்.

# teacher-guide->[5]->title
source: Extra Hedy features
ta: கூடுதல் எடி நற்பொருத்தங்கள்

# teacher-guide->[5]->key
source: features
ta: நற்பொருத்தங்கள்

# teacher-guide->[5]->subsections->[0]->title
source: Make your own adventure
ta: உங்கள் சொந்த சாகசத்தை உருவாக்குங்கள்

# teacher-guide->[5]->subsections->[0]->text
source: It is also possible for teachers to create your own adventure. This <a href="https://www.youtube.com/watch?v=A0zbXpxX4q4" target="_blank">video</a> shows you how to create your own adventure as a teacher and add it to your class(es).
ta: ஆசிரியர்கள் உங்கள் சொந்த சாகசத்தை உருவாக்குவதும் சாத்தியமாகும். இந்த <a href = "https://www.youtube.com/watch?v=A0ZBXPXX4Q4" இலக்கு = "_ வெற்று"> வீடியோ </a> ஒரு ஆசிரியராக உங்கள் சொந்த சாகசத்தை எவ்வாறு உருவாக்கி அதை உங்கள் வகுப்பில் சேர்க்க வேண்டும் என்பதைக் காட்டுகிறது (எச்).

# teacher-guide->[5]->subsections->[1]->title
source: Public adventures
ta: பொது சாகசங்கள்

# teacher-guide->[5]->subsections->[1]->text
source: Would you like to use adventures made by other teachers? Then you can visit our <a href="https://hedy.org/public-adventures" target="_blank">public adventures page</a>. Here you can find all the adventures made by other teachers from all over the world. To find a good fit for you, you can select a level, language and even a tag. Have you found an adventure you'd like to use? Then you can press 'clone' to make a copy of that adventure to your own account. You can edit the clone to your liking and add the adventure to your class in the same way you would your own adventures. You cannot edit the original, so the original will always be safe. Have you made an adventure yourself that you'd like to add to the public adventures? Tick the box that makes your adventure publicly available when creating the adventure!
ta: மற்ற ஆசிரியர்களால் செய்யப்பட்ட சாகசங்களைப் பயன்படுத்த விரும்புகிறீர்களா? பின்னர் நீங்கள் எங்கள் <a href = "https://hedy.org/public-adventures" இலக்கு = "_ வெற்று"> பொது சாகசப் பக்கம் </a> ஐப் பார்வையிடலாம். உலகம் முழுவதிலுமிருந்து மற்ற ஆசிரியர்கள் தயாரித்த அனைத்து சாகசங்களையும் இங்கே காணலாம். உங்களுக்காக ஒரு நல்ல பொருத்தத்தைக் கண்டுபிடிக்க, நீங்கள் ஒரு நிலை, மொழி மற்றும் ஒரு குறிச்சொல்லைத் தேர்ந்தெடுக்கலாம். நீங்கள் பயன்படுத்த விரும்பும் ஒரு சாகசத்தைக் கண்டுபிடித்தீர்களா? அந்த சாகசத்தின் நகலை உங்கள் சொந்த கணக்கிற்கு உருவாக்க 'நகலி' ஐ அழுத்தலாம். உங்கள் விருப்பப்படி குளோனைத் திருத்தலாம் மற்றும் உங்கள் சொந்த சாகசங்களை நீங்கள் போலவே உங்கள் வகுப்பிலும் சாகசத்தை சேர்க்கலாம். நீங்கள் அசலைத் திருத்த முடியாது, எனவே அசல் எப்போதும் பாதுகாப்பாக இருக்கும். பொது சாகசங்களில் நீங்கள் சேர்க்க விரும்பும் ஒரு சாகசத்தை நீங்களே செய்துள்ளீர்களா? சாகசத்தை உருவாக்கும் போது உங்கள் சாகசத்தை பகிரங்கமாகக் கிடைக்கச் செய்யும் பெட்டியைத் தேர்வுசெய்க!

# teacher-guide->[5]->subsections->[2]->title
source: Explore page
ta: பக்கத்தை ஆராயுங்கள்

# teacher-guide->[5]->subsections->[2]->text
source: On the <a href="https://hedy.org/explore" target="_blank">explore page</a> you can view the work of other Hedy users. You can try out their programs and use them as inspiration to create something cool yourself. You can also add a program you've made to the explore page yourself by clicking 'Save and share code' in the coding screen or go to My Programs and click 'Share'. Don't want to share your work anymore? Simply go to 'My Programs' and click 'Unshare'. If you want more information about the explore page, check out this <a href="https://www.youtube.com/watch?v=26boFjqvS5Q" target="_blank">video</a>.
ta: <A href = "https://hedy.org/explore" இலக்கு = "_ வெற்று"> பக்கத்தை ஆராயுங்கள் </a> மற்ற எடி பயனர்களின் வேலையை நீங்கள் காணலாம். நீங்கள் அவர்களின் திட்டங்களை முயற்சி செய்யலாம் மற்றும் உங்களை குளிர்ச்சியாக உருவாக்க உத்வேகமாக பயன்படுத்தலாம். குறியீட்டுத் திரையில் 'சேமி மற்றும் பகிர்வு' என்பதைக் சொடுக்கு செய்வதன் மூலம் அல்லது எனது நிரல்களுக்குச் சென்று 'பகிர்' என்பதைக் சொடுக்கு செய்வதன் மூலம் நீங்கள் உருவாக்கிய ஒரு நிரலை ஆராயலாம். உங்கள் வேலையை இனி பகிர்ந்து கொள்ள விரும்பவில்லையா? வெறுமனே 'எனது நிரல்களுக்கு' சென்று 'சேர்' என்பதைக் சொடுக்கு செய்க. எக்ச்ப்ளோர் பக்கத்தைப் பற்றிய கூடுதல் தகவல்களை நீங்கள் விரும்பினால், இதை <a href = "https://www.youtube.com/watch?v=26bofjqvs5q" _ வெற்று "> வீடியோ </a> ஐப் பாருங்கள்.

# teacher-guide->[5]->subsections->[3]->title
source: My achievements
ta: எனது சாதனைகள்

# teacher-guide->[5]->subsections->[3]->text
source: If you click on your username in the topright corner of your screen, you can go to <a href="https://hedy.org/my-achievements" target="_blank">My achievements</a>. On this page you achievements are collected. Your students have such a page as well. When you hover over the badge with your mouse, you'll see how to earn the badge. There are hidden badges too, of which you'll have to find out yourself how to earn them. If you want more information on the achievements, check out this <a href="https://www.youtube.com/watch?v=-FjmKejukCs" target="_blank">video</a>.
ta: உங்கள் திரையின் மேல் மூலையில் உள்ள உங்கள் பயனர்பெயரைக் சொடுக்கு செய்தால், நீங்கள் <a href = "https://hedy.org/my-atavements" இலக்கு = "_ வெற்று"> எனது சாதனைகள் </a> க்கு செல்லலாம். இந்த பக்கத்தில் நீங்கள் சாதனைகள் சேகரிக்கப்படுகின்றன. உங்கள் மாணவர்களுக்கு அத்தகைய பக்கமும் உள்ளது. உங்கள் சுட்டியுடன் பேட்சின் மீது நீங்கள் சுற்றும்போது, ​​பேட்சை எவ்வாறு சம்பாதிப்பது என்று பார்ப்பீர்கள். மறைக்கப்பட்ட பேட்ச்களும் உள்ளன, அவற்றில் அவற்றை எவ்வாறு சம்பாதிப்பது என்பதை நீங்களே கண்டுபிடிக்க வேண்டும். சாதனைகள் குறித்த கூடுதல் தகவல்களை நீங்கள் விரும்பினால், இதை <a href = "https://www.youtube.com/watch?v=-fjmkejukcs" இலக்கு = "_ வெற்று"> வீடியோ </a> ஐப் பாருங்கள்.

# teacher-guide->[5]->subsections->[4]->title
source: High Scores
ta: அதிக மதிப்பெண்கள்

# teacher-guide->[5]->subsections->[4]->text
source: On <a href="www.https://hedy.org/highscores" target="_blank">this page</a> you can see the high scores of all Hedy users. In this <a href="https://www.youtube.com/watch?v=IqTiUkBVTo8" target="_blank">video</a>you can learn some more about the high scores.
ta: <A href = "www.https: //hedy.org/highscores" இலக்கு = "_ வெற்று"> இந்த பக்கம் </a> அனைத்து எடி பயனர்களின் அதிக மதிப்பெண்களையும் நீங்கள் காணலாம். இந்த <a href = "https://www.youtube.com/watch?v=iqtiukbvto8" இலக்கு = "_ வெற்று"> வீடியோ </a> அதிக மதிப்பெண்களைப் பற்றி நீங்கள் இன்னும் சிலவற்றைக் கற்றுக்கொள்ளலாம்.

# teacher-guide->[5]->subsections->[5]->title
source: Debugger
ta: பிழைத்திருத்தம்

# teacher-guide->[5]->subsections->[5]->text
source: Is your (student's) code not working? There must be a bug (coding mistake) in it! You can use the debugger to find the mistake. The debugger is the ladybug button in your coding screen. If you press it, you can run your code line by line to find your mistake. Have you found the mistake? Press the red stop button and the debugger will shut off.
ta: உங்கள் (மாணவர்களின்) குறியீடு செயல்படவில்லையா? அதில் ஒரு பிழை (குறியீட்டு தவறு) இருக்க வேண்டும்! தவறைக் கண்டுபிடிக்க நீங்கள் பிழைத்திருத்தியைப் பயன்படுத்தலாம். பிழைத்திருத்தம் உங்கள் குறியீட்டு திரையில் உள்ள லேடிபக் பொத்தான். நீங்கள் அதை அழுத்தினால், உங்கள் தவறைக் கண்டுபிடிக்க உங்கள் குறியீடு வரியை வரி மூலம் இயக்கலாம். நீங்கள் தவறைக் கண்டுபிடித்தீர்களா? ரெட் ச்டாப் பொத்தானை அழுத்தவும், பிழைத்திருத்தியை நிறுத்திவிடும்.

# teacher-guide->[5]->subsections->[6]->title
source: Read aloud
ta: சத்தமாக படியுங்கள்

# teacher-guide->[5]->subsections->[6]->text
source: Do you want the output of your program to be read aloud? Then you can use the read aloud function that is found under the 'run code' button in your coding screen.
ta: உங்கள் நிரலின் வெளியீடு சத்தமாக படிக்க வேண்டுமா? உங்கள் குறியீட்டு திரையில் 'ரன் கோட்' பொத்தானின் கீழ் காணப்படும் வாசிப்பு உரத்த செயல்பாட்டை நீங்கள் பயன்படுத்தலாம்.

# teacher-guide->[5]->subsections->[7]->title
source: Programmers mode
ta: புரோகிராமர்கள் பயன்முறை

# teacher-guide->[5]->subsections->[7]->text
source: Distracted by all the adventures, or do you want to make a long program? Then check out the 'Programmers Mode' switch at the bottom of your coding screen. Programmers mode allows you and your students to use a bigger coding screen.
ta: எல்லா சாகசங்களாலும் திசைதிருப்பப்படுகிறது, அல்லது நீங்கள் ஒரு நீண்ட திட்டத்தை உருவாக்க விரும்புகிறீர்களா? உங்கள் குறியீட்டு திரையின் அடிப்பகுதியில் உள்ள 'புரோகிராமர்கள் பயன்முறை' சுவிட்சைப் பாருங்கள். புரோகிராமர்கள் பயன்முறை உங்களுக்கும் உங்கள் மாணவர்களுக்கும் ஒரு பெரிய குறியீட்டு திரையைப் பயன்படுத்த அனுமதிக்கிறது.

# teacher-guide->[5]->subsections->[8]->title
source: Cheat sheets
ta: ஏமாற்றுத் தாள்கள்

# teacher-guide->[5]->subsections->[8]->text
source: In every level there is a button with this emoji 🤔. You and your students can find the "cheat sheets" there. On this cheat sheet, you can find all the commands that are usable in this level in their correct form. So if you've forgotten how a command works, simply take a peek at the cheat sheet!
ta: ஒவ்வொரு மட்டத்திலும் இந்த ஈமோசியுடன் ஒரு பொத்தான் உள்ளது. நீங்களும் உங்கள் மாணவர்களும் அங்கு "ஏமாற்றுத் தாள்களை" காணலாம். இந்த ஏமாற்றுத் தாளில், இந்த மட்டத்தில் பயன்படுத்தக்கூடிய அனைத்து கட்டளைகளையும் அவற்றின் சரியான வடிவத்தில் காணலாம். எனவே ஒரு கட்டளை எவ்வாறு செயல்படுகிறது என்பதை நீங்கள் மறந்துவிட்டால், ஏமாற்றுத் தாளைப் பாருங்கள்!

# teacher-guide->[5]->subsections->[9]->title
source: Video
ta: ஒளிதோற்றம்

# teacher-guide->[5]->subsections->[9]->text
source: This <a href="https://www.youtube.com/watch?v=c4MntPPgl1Y" target="_blank">video</a> shows you even more features of Hedy, like the cheatsheets and the keyword switcher.
ta: இந்த <a href = "https://www.youtube.com/watch?v=c4mntppl1y" இலக்கு = "_ வெற்று"> வீடியோ </a>, சீட்சீட்ச் மற்றும் முக்கிய சுவிட்சர் போன்ற எடியின் இன்னும் பல அம்சங்களைக் காட்டுகிறது.

# teacher-guide->[6]->title
source: After Hedy
ta: எண்டிக்குப் பிறகு

# teacher-guide->[6]->key
source: after
ta: பிறகு

# teacher-guide->[6]->subsections->[0]->title
source: What to do after Hedy?
ta: எண்டிக்குப் பிறகு என்ன செய்வது?

# teacher-guide->[6]->subsections->[0]->text
source: Congratulations on reaching the end of Hedy! Your students have now learned how to create their own basic programs in the Python programming language. Of course, you could keep programming in our Hedy compiler, but it might be more exciting for your students to transfer to a "real" Python interface. Would you like to continue teaching Python? Then please visit <a href="https://www.python.org/about/gettingstarted/" target="_blank">the Python website</a> to learn how to get started in another compiler. Now that your students have a basic knowledge of programming in general, you could also show them around in other textual programming languages. The language might change but the concepts do not, so Hedy will still give them a big advantage.
ta: எடியின் முடிவை அடைந்ததற்கு வாழ்த்துக்கள்! பைதான் நிரலாக்க மொழியில் தங்கள் சொந்த அடிப்படை திட்டங்களை எவ்வாறு உருவாக்குவது என்பதை உங்கள் மாணவர்கள் இப்போது கற்றுக்கொண்டனர். நிச்சயமாக, நீங்கள் எங்கள் எடி கம்பைலரில் நிரலாக்கத்தை வைத்திருக்க முடியும், ஆனால் உங்கள் மாணவர்கள் "உண்மையான" பைதான் இடைமுகத்திற்கு மாற்றுவது மிகவும் உற்சாகமாக இருக்கலாம். பைதான் தொடர்ந்து கற்பிக்க விரும்புகிறீர்களா? மற்றொரு தொகுப்பில் எவ்வாறு தொடங்குவது என்பதை அறிய <a href = "https://www.python.org/about/gettingstarted/" இலக்கு = "_ வெற்று"> பைதான் வலைத்தளம் </a> ஐப் பார்வையிடவும். இப்போது உங்கள் மாணவர்களுக்கு பொதுவாக நிரலாக்கத்தைப் பற்றிய அடிப்படை அறிவு இருப்பதால், அவற்றை மற்ற உரை நிரலாக்க மொழிகளிலும் காண்பிக்கலாம். மொழி மாறக்கூடும், ஆனால் கருத்துக்கள் இல்லை, எனவே எடி இன்னும் அவர்களுக்கு ஒரு பெரிய நன்மையைத் தரும்.

# teacher-guide->[7]->title
source: Answers to the exercises
ta: பயிற்சிகளுக்கான பதில்கள்

# teacher-guide->[7]->key
source: answers
ta: பதில்கள்

# teacher-guide->[7]->intro
source: The answers to all the exercises can be found on the public profile of the useraccount 'Hedy_answers'. We often encourage students to use their own creativity in their answers, so these answers are merely a guideline as to what a possible correct answer could look like. To go to the 'Hedy_answers' profile, please click <a href="https://hedy.org/user/hedy_answers" target="_blank">here</a>.
ta: அனைத்து பயிற்சிகளுக்கான பதில்களையும் பயனர் கணக்கீடு 'Hedy_answers' இன் பொது சுயவிவரத்தில் காணலாம். மாணவர்களின் பதில்களில் தங்கள் சொந்த படைப்பாற்றலைப் பயன்படுத்த நாங்கள் அடிக்கடி ஊக்குவிக்கிறோம், எனவே இந்த பதில்கள் சரியான சரியான பதில் எப்படி இருக்கும் என்பதற்கான வழிகாட்டுதலாகும். 'Hedy_answers' சுயவிவரத்திற்குச் செல்ல, தயவுசெய்து <a href = "https://hedy.org/user/hedy_answers" இலக்கு = "_ வெற்று"> இங்கே </a> என்பதைக் சொடுக்கு செய்க.

# teacher-guide->[8]->title
source: Common mistakes
ta: பொதுவான தவறுகள்

# teacher-guide->[8]->key
source: common_mistakes
ta: பொதுவான தவறுகள்

# teacher-guide->[8]->intro
source: You can learn from your mistakes, especially in coding! Making mistakes is unavoidable, and a great opportunity to learn, but for teachers, it can be a challenge to find the correct fix for a mistake! Especially as the programs get longer and longer as the students progress through the levels. That's why we've made a list with frequently made mistakes in each level, and their solutions.
ta: உங்கள் தவறுகளிலிருந்து, குறிப்பாக குறியீட்டில் நீங்கள் கற்றுக்கொள்ளலாம்! தவறுகளைச் செய்வது தவிர்க்க முடியாதது, கற்றுக்கொள்ள ஒரு சிறந்த வாய்ப்பு, ஆனால் ஆசிரியர்களைப் பொறுத்தவரை, ஒரு தவறுக்கான சரியான தீர்வைக் கண்டுபிடிப்பது ஒரு சவாலாக இருக்கும்! குறிப்பாக மாணவர்கள் நிலைகள் முன்னேறும்போது திட்டங்கள் நீண்ட காலமாக இருக்கும். அதனால்தான் ஒவ்வொரு மட்டத்திலும் அடிக்கடி தவறுகளுடன் ஒரு பட்டியலை உருவாக்கியுள்ளோம், அவற்றின் தீர்வுகள்.

# teacher-guide->[8]->levels->[0]->sections->[0]->title
source: Students forget to type commands
ta: மாணவர்கள் கட்டளைகளைத் தட்டச்சு செய்ய மறந்து விடுகிறார்கள்

# teacher-guide->[8]->levels->[0]->sections->[0]->example->error_text
source: For example they type a sentence without using print.
ta: எடுத்துக்காட்டாக அவர்கள் அச்சு பயன்படுத்தாமல் ஒரு வாக்கியத்தை தட்டச்சு செய்க.

# teacher-guide->[8]->levels->[0]->sections->[0]->example->error_code
source: Hedy can't print this
ta: எடி இதை அச்சிட முடியாது

# teacher-guide->[8]->levels->[0]->sections->[0]->example->solution_text
source: Teach your students to always start a line of code with a command.
ta: உங்கள் மாணவர்களுக்கு எப்போதும் ஒரு கட்டளையுடன் குறியீட்டின் வரியைத் தொடங்க கற்றுக்கொடுங்கள்.

# teacher-guide->[8]->levels->[0]->sections->[0]->example->solution_code
source: {print} Hedy can print this!
ta: {print} எடி இதை அச்சிடலாம்!

# teacher-guide->[8]->levels->[0]->sections->[1]->title
source: Students use capitals when typing commands
ta: கட்டளைகளைத் தட்டச்சு செய்யும் போது மாணவர்கள் தலைநகரங்களைப் பயன்படுத்துகிறார்கள்

# teacher-guide->[8]->levels->[0]->sections->[1]->example->error_text
source: Commands won't work if they are in capitals.
ta: கட்டளைகள் தலைநகரங்களில் இருந்தால் அவை இயங்காது.

# teacher-guide->[8]->levels->[0]->sections->[1]->example->error_code
source: Ask Why does my code fail? Print Because I'm using capitals.
ta: எனது குறியீடு ஏன் தோல்வியடைகிறது என்று கேளுங்கள்? நான் தலைநகரங்களைப் பயன்படுத்துவதால் அச்சிடுங்கள்.

# teacher-guide->[8]->levels->[0]->sections->[1]->example->solution_text
source: Remove the capitals.
ta: தலைநகரங்களை அகற்றவும்.

# teacher-guide->[8]->levels->[0]->sections->[1]->example->solution_code
source: {ask} Why does my code work now? {print} Because I removed the capitals!
ta: {ask} எனது குறியீடு இப்போது ஏன் செயல்படுகிறது? {print} ஏனென்றால் நான் தலைநகரங்களை அகற்றினேன்!

# teacher-guide->[8]->levels->[0]->sections->[2]->title
source: Students use echo without ask
ta: மாணவர்கள் கேட்காமல் எதிரொலியைப் பயன்படுத்துகிறார்கள்

# teacher-guide->[8]->levels->[0]->sections->[2]->example->error_text
source: Echo is made to repeat an answer after an ask command. Without ask echo won't do anything.
ta: கேட்கும் கட்டளைக்குப் பிறகு ஒரு பதிலை மீண்டும் செய்ய எதிரொலி செய்யப்படுகிறது. கேட்காமல் எதிரொலி எதுவும் செய்யாது.

# teacher-guide->[8]->levels->[0]->sections->[2]->example->error_code
source: {echo} Your name is
ta: {எதிரொலி your உங்கள் பெயர்

# teacher-guide->[8]->levels->[0]->sections->[2]->example->solution_text
source: Add an ask command to make it work.
ta: அதைச் செயல்படுத்த ஒரு கேளுங்கள் கட்டளையைச் சேர்க்கவும்.

# teacher-guide->[8]->levels->[0]->sections->[2]->example->solution_code
source: {ask} What's your name? {echo} Your name is
ta: {கேளுங்கள் your உங்கள் பெயர் என்ன? {எதிரொலி your உங்கள் பெயர்

# teacher-guide->[8]->levels->[0]->sections->[3]->title
source: Students want their echo word (variable) to be in the middle of a sentence
ta: மாணவர்கள் தங்கள் எதிரொலி சொல் (மாறி) ஒரு வாக்கியத்தின் நடுவில் இருக்க வேண்டும் என்று விரும்புகிறார்கள்

# teacher-guide->[8]->levels->[0]->sections->[3]->example->error_text
source: And they are right! That's why they will learn to use proper variables in the next level.
ta: அவர்கள் சொல்வது சரிதான்! அதனால்தான் அவர்கள் அடுத்த கட்டத்தில் சரியான மாறிகளைப் பயன்படுத்த கற்றுக்கொள்வார்கள்.

# teacher-guide->[8]->levels->[0]->sections->[3]->example->error_code
source: {ask} Which programming language is the most fun? {echo} is the best!
ta: {ask} எந்த நிரலாக்க மொழி மிகவும் வேடிக்கையானது? {echo} சிறந்தது!

# teacher-guide->[8]->levels->[0]->sections->[3]->example->solution_text
source: In level 1 we have to keep it at this:
ta: நிலை 1 இல் நாம் இதை வைத்திருக்க வேண்டும்:

# teacher-guide->[8]->levels->[0]->sections->[3]->example->solution_code
source: {ask} Which programming language is the most fun? {echo} The best is...
ta: {ask} எந்த நிரலாக்க மொழி மிகவும் வேடிக்கையானது? {echo} சிறந்தது ...

# teacher-guide->[8]->levels->[0]->sections->[4]->title
source: Turtle: Students let the turtle walk off of the screen
ta: ஆமை: மாணவர்கள் ஆமை திரையில் இருந்து வெளியேற அனுமதிக்கிறார்கள்

# teacher-guide->[8]->levels->[0]->sections->[4]->example->error_text
source: Often students love to try out big numbers when using the turtle, which causes the arrow to walk off the screen.
ta: ஆமை பயன்படுத்தும் போது பெரும்பாலும் மாணவர்கள் பெரிய எண்களை முயற்சிக்க விரும்புகிறார்கள், இதனால் அம்பு திரையில் இருந்து நடக்க காரணமாகிறது.
