Repository: 247i/TACETr
Catalog: உரை/தானி/hedy-webpages-*.po
Languages: ta

# workbooks->levels->[5]->intro
source: ## Maths By the end of this lesson, you can: * use maths in Hedy
ta: ## கணிதம் இந்த பாடத்தின் முடிவில், உங்களால் முடியும்: * எடியில் கணிதத்தைப் பயன்படுத்துங்கள்

# workbooks->levels->[5]->exercises->[0]->type
source: text
ta: உரை

# workbooks->levels->[5]->exercises->[0]->contents
source: ### Maths Making calculations is an important task for computers. Addition is done with the normal plus sign: `5 + 5`. Subtraction is also using the normal minus sign: `5 - 5`. With multiplications it might look a bit differnt than usually, we use the asterisk (above the 8): `5 * 5`. Division is done with the slash forward: `5 / 5`. Please note that maths code doesn't need quotation marks.
ta: ### கணிதம் கணக்கீடுகளை உருவாக்குவது கணினிகளுக்கு ஒரு முக்கியமான பணியாகும். கூடுதலாக சாதாரண பிளச் அடையாளத்துடன் செய்யப்படுகிறது: `5 + 5`. கழித்தல் என்பது சாதாரண கழித்தல் அடையாளத்தையும் பயன்படுத்துகிறது: `5 - 5`. பெருக்கங்களுடன் இது வழக்கமாக இருப்பதை விட சற்று வேறுபடுவதாகத் தோன்றலாம், நாங்கள் நட்சத்திரத்தைப் பயன்படுத்துகிறோம் (8 க்கு மேல்): `5 * 5`. பிரிவு முன்னோக்கி ச்லாச் மூலம் செய்யப்படுகிறது: `5 / 5`. கணிதக் குறியீட்டிற்கு மேற்கோள் குறிகள் தேவையில்லை என்பதை நினைவில் கொள்க.

# workbooks->levels->[5]->exercises->[0]->code
source: print 'five times five is ' 5 * 5
ta: 'ஐந்து முறை ஐந்து' 5 * 5 ஐ அச்சிடுக

# workbooks->levels->[5]->exercises->[1]->type
source: text
ta: உரை

# workbooks->levels->[5]->exercises->[1]->contents
source: #### Exercise 1: Predict the output What do you think the output of these programs will be?
ta: #### உடற்பயிற்சி 1: வெளியீட்டைக் கணிக்கவும் இந்த நிரல்களின் வெளியீடு என்னவாக இருக்கும் என்று நீங்கள் நினைக்கிறீர்கள்?

# workbooks->levels->[5]->exercises->[2]->type
source: output
ta: வெளியீடு

# workbooks->levels->[5]->exercises->[2]->code
source: print 'two plus ten is ' 2 * 10 print 5 * 5 ' is 30 minus 5' print 10 / 2
ta: 'இரண்டு பிளச் பத்து இச்' 2 * 10 ஐ அச்சிடுக அச்சு 5 * 5 'என்பது 30 மைனச் 5' 10/2 அச்சிடுக

# workbooks->levels->[5]->exercises->[2]->answer
source: two plus ten is 20 25 is 30 minus 5 5
ta: இரண்டு பிளச் பத்து 20 ஆகும் 25 என்பது 30 மைனச் 5 ஆகும் 5

# workbooks->levels->[5]->exercises->[3]->type
source: text
ta: உரை

# workbooks->levels->[5]->exercises->[3]->contents
source: #### Exercise 2: Maths Follow these steps to complete the exercise: 1. Finish the programs by filling in a sum on the lines. The code has to make sense. 2. Finished? Fill in what you think the output of the code will be.
ta: #### உடற்பயிற்சி 2: கணிதம் உடற்பயிற்சியை முடிக்க இந்த படிகளைப் பின்பற்றவும்: 1. வரிகளில் ஒரு தொகையை நிரப்புவதன் மூலம் நிரல்களை முடிக்கவும். குறியீடு அர்த்தமுள்ளதாக இருக்க வேண்டும். 2. முடிந்தது? குறியீட்டின் வெளியீடு இருக்கும் என்று நீங்கள் நினைப்பதை நிரப்பவும்.

# workbooks->levels->[5]->exercises->[4]->type
source: output
ta: வெளியீடு

# workbooks->levels->[5]->exercises->[4]->code
source: print 'five plus ten is ' ___ print 'six minus five is ' ___ print 'one hunderd diveded by five is ' ___ ___ _________________________ 4 * 12
ta: 'ஃபைவ் பிளச் டென் இச்' ___ அச்சிடுக 'ஆறு மைனச் ஃபைவ் இச்' ___ அச்சிடுக அச்சிடுக 'ஒரு நூறு ஐந்தால் வகுக்கப்படுகிறது' ___ ___ _________________________ 4 * 12

# workbooks->levels->[5]->exercises->[4]->answer
source: five plus ten is 50 six minus five is 1 one hunderd devided by five is 20 four times twelve is 48
ta: ஐந்து பிளச் பத்து 50 ஆகும் ஆறு கழித்தல் ஐந்து 1 ஐந்தில் பிரிக்கப்பட்ட நூறு 20 ஆகும் நான்கு முறை பன்னிரண்டு 48

# workbooks->levels->[5]->exercises->[5]->type
source: text
ta: உரை

# workbooks->levels->[5]->exercises->[5]->contents
source: ### Exercise 2: Maths with ask and variables You can also save a sum in a variable, compare it with an `ask` and run it with an `if`. We'll practice that now. Predict the output of these programs. When `ask` and `random` are used, you can make up your own answers.
ta: ### உடற்பயிற்சி 2: கேள்விகள் மற்றும் மாறிகள் கொண்ட கணிதம் நீங்கள் ஒரு மாறியில் ஒரு தொகையைச் சேமிக்கலாம், அதை `கேளுங்கள்` உடன் ஒப்பிட்டு` if` உடன் இயக்கலாம். நாங்கள் இப்போது அதைப் பயிற்சி செய்வோம். இந்த நிரல்களின் வெளியீட்டைக் கணிக்கவும். `கேளுங்கள்` மற்றும்` சீரற்ற` பயன்படுத்தப்படும்போது, ​​நீங்கள் உங்கள் சொந்த பதில்களை உருவாக்கலாம்.

# workbooks->levels->[5]->exercises->[6]->type
source: output
ta: வெளியீடு

# workbooks->levels->[5]->exercises->[6]->code
source: sum = 2 * 5 print 'The answer to this sum is ' sum
ta: தொகை = 2 * 5 'இந்த தொகைக்கான பதில்' தொகை

# workbooks->levels->[5]->exercises->[6]->answer
source: The answer to this sum is 10
ta: இந்த தொகைக்கான பதில் 10

# workbooks->levels->[5]->exercises->[7]->type
source: output
ta: வெளியீடு

# workbooks->levels->[5]->exercises->[7]->code
source: correct_answer = 142 / 2 your_answer = ask 'What is 142 divided by 2?' if correct_answer is your_answer print 'Great job' else print 'Bummer!'
ta: சரியான_அன்வெர் = 142/2 your_answer = கேளுங்கள் '142 2 ஆல் வகுக்கப்படுகிறது?' சரியான_அன்வெர் உங்கள்_அன்வர் என்றால் 'பெரிய வேலை' வேறு 'பம்மர்!'

# workbooks->levels->[5]->exercises->[7]->answer
source: Great job! or Bummer!
ta: பெரிய வேலை! அல்லது பம்மர்!

# workbooks->levels->[5]->exercises->[8]->type
source: output
ta: வெளியீடு

# workbooks->levels->[5]->exercises->[8]->code
source: numbers is 2, 4, 6, 7, 9, 11, 17 number is numbers at random print 'How much is ' number ' times 7?'
ta: எண்கள் 2, 4, 6, 7, 9, 11, 17 எண் சீரற்ற எண்கள் 'எண்' டைம்ச் 7 எவ்வளவு? '

# workbooks->levels->[5]->exercises->[8]->answer
source: How much is 7 times 7? (or any other number from the list: 2, 4, 6, 9, 11, 17)
ta: 7 முறை 7 எவ்வளவு? (அல்லது பட்டியலிலிருந்து வேறு எந்த எண்ணும்: 2, 4, 6, 9, 11, 17)

# workbooks->levels->[5]->exercises->[9]->type
source: output
ta: வெளியீடு

# workbooks->levels->[5]->exercises->[9]->code
source: favorite is ask 'What is your favorite number?' print '3 times ' favorite ' is ' 3 * favorite
ta: பிடித்தது 'உங்களுக்கு பிடித்த எண் எது?' '3 முறை பிடித்தது' '3 * பிடித்தது

# workbooks->levels->[5]->exercises->[9]->answer
source: 3 times 6 (for example) is 18
ta: 3 முறை 6 (எடுத்துக்காட்டாக) 18

# workbooks->levels->[5]->exercises->[10]->type
source: text
ta: உரை

# workbooks->levels->[5]->exercises->[10]->contents
source: ### Exercise 3: Input You'll be shown an output. Write a program that could produce this output. Please note: Multiple answers can be correct. Choose whatever you want, as long as it's correct. Fill up all the lines, so look carefully at the amount of lines!
ta: ### உடற்பயிற்சி 3: உள்ளீடு உங்களுக்கு வெளியீடு காண்பிக்கப்படும். இந்த வெளியீட்டை உருவாக்கக்கூடிய ஒரு நிரலை எழுதுங்கள். தயவுசெய்து கவனிக்கவும்: பல பதில்கள் சரியாக இருக்கும். நீங்கள் விரும்பியதைத் தேர்வுசெய்க, அது சரியானதாக இருக்கும் வரை. எல்லா வரிகளையும் நிரப்பவும், எனவே வரிகளின் அளவை கவனமாகப் பாருங்கள்!

# workbooks->levels->[5]->exercises->[11]->type
source: input
ta: உள்ளீடு

# workbooks->levels->[5]->exercises->[11]->answer
source: print 'This is a very big number:' 4*17
ta: அச்சு 'இது மிகப் பெரிய எண்:' 4*17

# workbooks->levels->[5]->exercises->[11]->output
source: This is a very big number: 68
ta: இது மிகப் பெரிய எண்: 68

# workbooks->levels->[5]->exercises->[12]->type
source: input
ta: உள்ளீடு

# workbooks->levels->[5]->exercises->[12]->answer
source: print 1000/10 ' is the answer to 1000/10.'
ta: அச்சு 1000/10 'என்பது 1000/10 க்கு பதில்.'

# workbooks->levels->[5]->exercises->[12]->output
source: 100 is the answer to 1000/10.
ta: 100 என்பது 1000/10 க்கு பதில்.

# workbooks->levels->[5]->exercises->[13]->type
source: input
ta: உள்ளீடு

# workbooks->levels->[5]->exercises->[13]->answer
source: numbers is 1,2,3,4,5,6,7,8,9,10 print numbers at random * 7 ' is a random multiple of 7'
ta: எண்கள் 1,2,3,4,5,7,7,8,9,10 சீரற்ற எண்களில் அச்சிடுக * 7 'என்பது 7 இன் சீரற்ற பெருக்கமாகும்'

# workbooks->levels->[5]->exercises->[13]->output
source: 14 is a random multiple of 7
ta: 14 என்பது 7 இன் சீரற்ற பெருக்கமாகும்

# workbooks->levels->[5]->exercises->[14]->type
source: text
ta: உரை

# workbooks->levels->[5]->exercises->[14]->contents
source: #### Exercise 4: Programming words We have learned to use some new signs in our code. Which signs are used in these cases?
ta: #### உடற்பயிற்சி 4: நிரலாக்க சொற்கள் எங்கள் குறியீட்டில் சில புதிய அறிகுறிகளைப் பயன்படுத்த கற்றுக்கொண்டோம். இந்த சந்தர்ப்பங்களில் எந்த அறிகுறிகள் பயன்படுத்தப்படுகின்றன?

# workbooks->levels->[5]->exercises->[15]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[5]->exercises->[15]->word
source: times
ta: பெருக்கல்

# workbooks->levels->[5]->exercises->[16]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[5]->exercises->[16]->word
source: divided by
ta: பிரிக்கப்பட்டுள்ளது

# workbooks->levels->[5]->exercises->[17]->type
source: text
ta: உரை

# workbooks->levels->[5]->exercises->[17]->contents
source: #### What did you think?
ta: #### நீங்கள் என்ன நினைத்தீர்கள்?

# workbooks->levels->[5]->exercises->[18]->type
source: question
ta: கேள்வி

# workbooks->levels->[5]->exercises->[18]->text
source: Which exercise did you like best this level?
ta: இந்த நிலைக்கு நீங்கள் எந்த உடற்பயிற்சியை விரும்பினீர்கள்?

# workbooks->levels->[5]->exercises->[19]->type
source: question
ta: கேள்வி

# workbooks->levels->[5]->exercises->[19]->text
source: What did you like about it?
ta: இதைப் பற்றி நீங்கள் என்ன விரும்பினீர்கள்?

# workbooks->levels->[5]->exercises->[20]->type
source: question
ta: கேள்வி

# workbooks->levels->[5]->exercises->[20]->text
source: Which exercise did you like least this level?
ta: இந்த நிலையை நீங்கள் எந்த உடற்பயிற்சியை விரும்பினீர்கள்?

# workbooks->levels->[5]->exercises->[21]->type
source: question
ta: கேள்வி

# workbooks->levels->[5]->exercises->[21]->text
source: What didn't you like about it?
ta: இதைப் பற்றி உங்களுக்கு என்ன பிடிக்கவில்லை?

# workbooks->levels->[6]->intro
source: ## Repeat! By the end of this lesson, you can: * run a line of code multiple times
ta: ## மீண்டும்! இந்த பாடத்தின் முடிவில், உங்களால் முடியும்: * குறியீட்டின் வரியை பல முறை இயக்கவும்

# workbooks->levels->[6]->exercises->[0]->type
source: text
ta: உரை

# workbooks->levels->[6]->exercises->[0]->contents
source: ### Repetition Sometimes you want to repeat a line of code multiple times, for example in a song or a story.
ta: ### மறுபடியும் சில நேரங்களில் நீங்கள் பல முறை குறியீட்டை மீண்டும் செய்ய விரும்புகிறீர்கள், எடுத்துக்காட்டாக ஒரு பாடல் அல்லது கதையில்.

# workbooks->levels->[6]->exercises->[0]->code
source: repeat 5 times print 'Baby shark!'
ta: 'குழந்தை சுறா!'

# workbooks->levels->[6]->exercises->[1]->type
source: text
ta: உரை

# workbooks->levels->[6]->exercises->[1]->contents
source: #### Exercise 1: Predict the output What will be the output of these programs?
ta: #### உடற்பயிற்சி 1: வெளியீட்டைக் கணிக்கவும் இந்த நிரல்களின் வெளியீடு என்னவாக இருக்கும்?

# workbooks->levels->[6]->exercises->[2]->type
source: output
ta: வெளியீடு

# workbooks->levels->[6]->exercises->[2]->code
source: repeat 3 times print 'Baby shark!'
ta: 'குழந்தை சுறா!'

# workbooks->levels->[6]->exercises->[2]->answer
source: Baby shark! Baby shark! Baby shark!
ta: குழந்தை சுறா! குழந்தை சுறா! குழந்தை சுறா!

# workbooks->levels->[6]->exercises->[3]->type
source: output
ta: வெளியீடு

# workbooks->levels->[6]->exercises->[3]->code
source: repeat 1 times print 'Hi everybody!'
ta: 'அனைவருக்கும் வணக்கம்!'

# workbooks->levels->[6]->exercises->[3]->answer
source: Hi everybody!
ta: அனைவருக்கும் வணக்கம்!

# workbooks->levels->[6]->exercises->[4]->type
source: output
ta: வெளியீடு

# workbooks->levels->[6]->exercises->[4]->code
source: a is 4 repeat a times print 'Hi everybody'
ta: a 4 'அனைவருக்கும் வணக்கம்' என்ற நேரங்களை அச்சிடவும்

# workbooks->levels->[6]->exercises->[4]->answer
source: Hi everybody! Hi everybody! Hi everybody! Hi everybody!
ta: அனைவருக்கும் வணக்கம்! அனைவருக்கும் வணக்கம்! அனைவருக்கும் வணக்கம்! அனைவருக்கும் வணக்கம்!

# workbooks->levels->[6]->exercises->[5]->type
source: text
ta: உரை

# workbooks->levels->[6]->exercises->[5]->contents
source: ### Exercise 2: Input Take a look at the output. Write a program that could belong to this output. Please note: Multiple answers can be correct. Choose whatever you want, as long as it's correct. Fill up all the lines, so look carefully at the amount of lines!
ta: ### உடற்பயிற்சி 2: உள்ளீடு வெளியீட்டைப் பாருங்கள். இந்த வெளியீட்டிற்கு சொந்தமான ஒரு நிரலை எழுதுங்கள். தயவுசெய்து கவனிக்கவும்: பல பதில்கள் சரியாக இருக்கும். நீங்கள் விரும்பியதைத் தேர்வுசெய்க, அது சரியானதாக இருக்கும் வரை. எல்லா வரிகளையும் நிரப்பவும், எனவே வரிகளின் அளவை கவனமாகப் பாருங்கள்!

# workbooks->levels->[6]->exercises->[6]->type
source: input
ta: உள்ளீடு

# workbooks->levels->[6]->exercises->[6]->answer
source: print 'Hi everybody!' repeat 2 times print 'This is one line.'
ta: 'அனைவருக்கும் வணக்கம்!' 2 முறை அச்சிடுக 'இது ஒரு வரி.'

# workbooks->levels->[6]->exercises->[6]->output
source: Hi everybody! This is one line. This is one line.
ta: அனைவருக்கும் வணக்கம்! இது ஒரு வரி. இது ஒரு வரி.

# workbooks->levels->[6]->exercises->[7]->type
source: input
ta: உள்ளீடு

# workbooks->levels->[6]->exercises->[7]->answer
source: print 'This is line 1' print 'This is line 2' print 'This is line 3'
ta: 'இது வரி 1' 'இது வரி 2' 'இது வரி 3'

# workbooks->levels->[6]->exercises->[7]->output
source: This is line 1 This is line 2 This is line 3
ta: இது வரி 1 இது வரி 2 இது வரி 3

# workbooks->levels->[6]->exercises->[8]->type
source: text
ta: உரை

# workbooks->levels->[6]->exercises->[8]->contents
source: ### Exercise 3: Correct or Incorrect Take a careful look at the programs and decide if they will trigger an errormessage or not.
ta: ### உடற்பயிற்சி 3: சரியானது அல்லது தவறானது நிரல்களை கவனமாகப் பார்த்து, அவை ஒரு பிழையான தன்மையைத் தூண்டுமா இல்லையா என்பதை முடிவு செய்யுங்கள்.

# workbooks->levels->[6]->exercises->[9]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[6]->exercises->[9]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[6]->exercises->[9]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[6]->exercises->[9]->code
source: print 'The prince kept screaming for help' repeat 3 times 'Help!'
ta: 'இளவரசர் உதவிக்காக கத்திக் கொண்டே இருந்தார்' 3 முறை 'உதவி!'

# workbooks->levels->[6]->exercises->[9]->answer
source: Incorrect, print is missing
ta: தவறானது, அச்சு காணவில்லை

# workbooks->levels->[6]->exercises->[10]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[6]->exercises->[10]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[6]->exercises->[10]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[6]->exercises->[10]->code
source: forward 100 repeat 3 times turn 90
ta: முன்னோக்கி 100 90 முறை திரும்பவும்

# workbooks->levels->[6]->exercises->[10]->answer
source: Correct
ta: சரியான

# workbooks->levels->[6]->exercises->[11]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[6]->exercises->[11]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[6]->exercises->[11]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[6]->exercises->[11]->code
source: people = mum, dad, Emma, Sophie repeat 7 times print 'The dishes will be done by ' mensen
ta: மக்கள் = அம்மா, அப்பா, எம்மா, சோஃபி 'உணவுகள்' மென்சனால் செய்யப்படும் 7 முறை அச்சிடுக

# workbooks->levels->[6]->exercises->[11]->answer
source: Incorrect, at random is missing
ta: தவறானது, சீரற்ற முறையில் காணவில்லை

# workbooks->levels->[6]->exercises->[12]->type
source: MC-code
ta: எம்.சி-கோட்

# workbooks->levels->[6]->exercises->[12]->options->[0]
source: Correct
ta: சரியான

# workbooks->levels->[6]->exercises->[12]->options->[1]
source: Incorrect
ta: தவறானது

# workbooks->levels->[6]->exercises->[12]->code
source: options = 1, 2, 3, 4, 5, 6 repeat 5 times print 'You threw: ' options at random
ta: விருப்பங்கள் = 1, 2, 3, 4, 5, 6 5 முறை அச்சிடுக 'நீங்கள் எறிந்தீர்கள்:' விருப்பங்கள் சீரற்றவை

# workbooks->levels->[6]->exercises->[12]->answer
source: Correct
ta: சரியான

# workbooks->levels->[6]->exercises->[13]->type
source: text
ta: உரை

# workbooks->levels->[6]->exercises->[13]->contents
source: #### Exercise 6: Programming words We have learned a new programming word again! Explain in your own words.
ta: #### உடற்பயிற்சி 6: நிரலாக்க சொற்கள் நாங்கள் மீண்டும் ஒரு புதிய நிரலாக்க வார்த்தையை கற்றுக்கொண்டோம்! உங்கள் சொந்த வார்த்தைகளில் விளக்குங்கள்.

# workbooks->levels->[6]->exercises->[14]->type
source: define
ta: வரையறுக்கவும்

# workbooks->levels->[6]->exercises->[14]->word
source: repeat
ta: மீண்டும்

# workbooks->levels->[6]->exercises->[14]->answer
source: repeating a line multiple times
ta: ஒரு வரியை பல முறை மீண்டும் மீண்டும் செய்கிறது

# workbooks->levels->[6]->exercises->[15]->type
source: text
ta: உரை

# workbooks->levels->[6]->exercises->[15]->contents
source: #### What did you think?
ta: #### நீங்கள் என்ன நினைத்தீர்கள்?

# workbooks->levels->[6]->exercises->[16]->type
source: question
ta: கேள்வி

# workbooks->levels->[6]->exercises->[16]->text
source: Which exercise did you like best this level?
ta: இந்த நிலைக்கு நீங்கள் எந்த உடற்பயிற்சியை விரும்பினீர்கள்?

# workbooks->levels->[6]->exercises->[17]->type
source: question
ta: கேள்வி

# workbooks->levels->[6]->exercises->[17]->text
source: What did you like about it?
ta: இதைப் பற்றி நீங்கள் என்ன விரும்பினீர்கள்?

# workbooks->levels->[6]->exercises->[18]->type
source: question
ta: கேள்வி

# workbooks->levels->[6]->exercises->[18]->text
source: Which exercise did you like least this level?
ta: இந்த நிலையை நீங்கள் எந்த உடற்பயிற்சியை விரும்பினீர்கள்?

# workbooks->levels->[6]->exercises->[19]->type
source: question
ta: கேள்வி

# workbooks->levels->[6]->exercises->[19]->text
source: What didn't you like about it?
ta: இதைப் பற்றி உங்களுக்கு என்ன பிடிக்கவில்லை?

# workbooks->levels->[7]->intro
source: ## Repeat! By the end of this lesson, you will be able to: * repeat multiple lines of code
ta: ## மீண்டும்! இந்த பாடத்தின் முடிவில், உங்களால் முடியும்: * குறியீட்டின் பல வரிகளை மீண்டும் செய்யவும்

# workbooks->levels->[7]->exercises->[0]->type
source: text
ta: உரை

# workbooks->levels->[7]->exercises->[0]->contents
source: ### Repetition Maybe you've noticed how you could only repeat 1 line of code before, very simplistic. Oftentimes you want to repeat multiple lines, to make a more complex program. In Hedy, and in Python too, this is done with indentation! Indentation means starting a line with a couple of spaces.
ta: ### மறுபடியும் இதற்கு முன் 1 வரியை மட்டுமே மீண்டும் மீண்டும் செய்ய முடியும் என்பதை நீங்கள் கவனித்திருக்கலாம், மிகவும் எளிமையானது. மிகவும் சிக்கலான நிரலை உருவாக்க, நீங்கள் பல வரிகளை மீண்டும் செய்ய விரும்புகிறீர்கள். எடி, மற்றும் பைத்தானிலும், இது உள்தள்ளலுடன் செய்யப்படுகிறது! உள்தள்ளல் என்பது ஓரிரு இடைவெளிகளுடன் ஒரு வரியைத் தொடங்குவதாகும்.

# workbooks->levels->[7]->exercises->[0]->code
source: repeat 5 times print 'Baby shark!'
ta: 5 முறை மீண்டும் செய்யவும் 'குழந்தை சுறா!'

# workbooks->levels->[7]->exercises->[1]->type
source: text
ta: உரை

# workbooks->levels->[7]->exercises->[1]->contents
source: #### Exercise 1: Which lines will be repeated? Tip: Take a careful look at the indentation (starting a line with spaces).
ta: #### உடற்பயிற்சி 1: எந்த வரிகள் மீண்டும் செய்யப்படும்? உதவிக்குறிப்பு: உள்தள்ளலை கவனமாக பாருங்கள் (இடைவெளிகளுடன் ஒரு வரியைத் தொடங்குதல்).

# workbooks->levels->[7]->exercises->[2]->type
source: circle
ta: வட்டம்

# workbooks->levels->[7]->exercises->[2]->goal
source: indentation
ta: உள்தள்ளல்

# workbooks->levels->[7]->exercises->[2]->code
source: repeat 3 times print 'Baby shark!' print 'Tudu tudu tudu!' print 'Baby shark!'
ta: 3 முறை மீண்டும் செய்யவும் 'குழந்தை சுறா!' 'Tudu tudu tudu!' 'குழந்தை சுறா!'

# workbooks->levels->[7]->exercises->[2]->answer
source: Lines 2 and 3
ta: கோடுகள் 2 மற்றும் 3

# workbooks->levels->[7]->exercises->[3]->type
source: circle
ta: வட்டம்

# workbooks->levels->[7]->exercises->[3]->goal
source: indentation
ta: உள்தள்ளல்

# workbooks->levels->[7]->exercises->[3]->code
source: print 'Hello!' repeat 2 times print 'Yes, hi everybody'
ta: 'அலோ!' 2 முறை மீண்டும் செய்யவும் 'ஆம், அனைவருக்கும் வணக்கம்'

# workbooks->levels->[7]->exercises->[3]->answer
source: Line 3
ta: வரி 3

# workbooks->levels->[7]->exercises->[4]->type
source: circle
ta: வட்டம்

# workbooks->levels->[7]->exercises->[4]->goal
source: indentation
ta: உள்தள்ளல்

# workbooks->levels->[7]->exercises->[4]->code
source: name is ask 'What is your name?' if name is Hedy print 'Yes' else print 'No'
ta: பெயர் 'உங்கள் பெயர் என்ன?' பெயர் எடி என்றால் 'ஆம்' என்று அச்சிடுக வேறு 'இல்லை'

# workbooks->levels->[7]->exercises->[4]->answer
source: No lines! There is indentation because of the if and else, but no lines will be repeated.
ta: வரிகள் இல்லை! IF மற்றும் வேறு காரணமாக உள்தள்ளல் உள்ளது, ஆனால் எந்த வரிகளும் மீண்டும் செய்யப்படாது.

# workbooks->levels->[7]->exercises->[5]->type
source: text
ta: உரை

# workbooks->levels->[7]->exercises->[5]->contents
source: #### Exercise 2: Predict the output What will be the output of these programs?
ta: #### உடற்பயிற்சி 2: வெளியீட்டைக் கணிக்கவும் இந்த நிரல்களின் வெளியீடு என்னவாக இருக்கும்?

# workbooks->levels->[7]->exercises->[6]->type
source: output
ta: வெளியீடு

# workbooks->levels->[7]->exercises->[6]->code
source: print 'Hello!' repeat 1 times print ':)'
ta: 'அலோ!' 1 முறை மீண்டும் செய்யவும் அச்சிடுக ':)'

# workbooks->levels->[7]->exercises->[6]->answer
source: Hello! :)
ta: வணக்கம்! :)

# workbooks->levels->[7]->exercises->[7]->type
source: output
ta: வெளியீடு

# workbooks->levels->[7]->exercises->[7]->code
source: print 'Hello!' repeat 5 times print ':(' print 'Done!'
ta: 'அலோ!' 5 முறை மீண்டும் செய்யவும் அச்சு ':(' 'முடிந்தது!'

# workbooks->levels->[7]->exercises->[7]->answer
source: Hello! :( :( :( :( :( Done!
ta: வணக்கம்! :( :( :( :( :( முடிந்தது!

# workbooks->levels->[7]->exercises->[8]->type
source: text
ta: உரை

# workbooks->levels->[7]->exercises->[8]->contents
source: ## If and else When using `if` and `else` you also need indentation. This way you can execute multiple lines when a condition is true or false. ### Exercise 3: Predict the output Predict the output of these programs.
ta: ## என்றால் மற்றும் வேறு `If` மற்றும்` வேறு` ஆகியவற்றைப் பயன்படுத்தும் போது உங்களுக்கு உள்தள்ளல் தேவை. இந்த வழியில் ஒரு நிபந்தனை உண்மையாகவோ அல்லது பொய்யாகவோ இருக்கும்போது பல வரிகளை இயக்க முடியும். ### உடற்பயிற்சி 3: வெளியீட்டைக் கணிக்கவும் இந்த நிரல்களின் வெளியீட்டைக் கணிக்கவும்.

# workbooks->levels->[7]->exercises->[9]->type
source: output
ta: வெளியீடு

# workbooks->levels->[7]->exercises->[9]->code
source: name is ask 'What is your name?' if name is Hedy print 'Yes' else print 'No'
ta: பெயர் 'உங்கள் பெயர் என்ன?' பெயர் எடி என்றால் 'ஆம்' என்று அச்சிடுக வேறு 'இல்லை'

# workbooks->levels->[7]->exercises->[9]->answer
source: No
ta: இல்லை

# workbooks->levels->[7]->exercises->[10]->type
source: output
ta: வெளியீடு

# workbooks->levels->[7]->exercises->[10]->code
source: numbers is 1, 2, 3, 4, 5, 6, 7 choice is numbers at random if choice is five print 'Hooray!' print 'Hooray!' else print 'Oh no!'
ta: எண்கள் 1, 2, 3, 4, 5, 6, 7 தேர்வு என்பது சீரற்ற எண்கள் தேர்வு ஐந்து என்றால் 'ஊரே!' 'ஊரே!' வேறு 'ஓ!'

# workbooks->levels->[7]->exercises->[10]->answer
source: Oh no!
ta: ஓ!

# workbooks->levels->[7]->exercises->[11]->type
source: output
ta: வெளியீடு

# workbooks->levels->[7]->exercises->[11]->code
source: dice = 1, 2, 3, 4, 5, 6 repeat 3 times print 'You threw: ' dice at random print 'Game over'
ta: பகடை = 1, 2, 3, 4, 5, 6 3 முறை மீண்டும் செய்யவும் 'நீங்கள் எறிந்தீர்கள்:' பகடை சீரற்ற முறையில் அச்சிடுங்கள் 'கேம் ஓவர்'

# workbooks->levels->[7]->exercises->[11]->answer
source: You threw: < 1, 2, 3, 4, 5, or 6> Game over You threw: < 1, 2, 3, 4, 5, or 6> Game over You threw: < 1, 2, 3, 4, 5, or 6> Game over
ta: நீங்கள் எறிந்தீர்கள்: <1, 2, 3, 4, 5, அல்லது 6> விளையாட்டு ஓவர் நீங்கள் எறிந்தீர்கள்: <1, 2, 3, 4, 5, அல்லது 6> விளையாட்டு ஓவர் நீங்கள் எறிந்தீர்கள்: <1, 2, 3, 4, 5, அல்லது 6> விளையாட்டு ஓவர்

# workbooks->levels->[7]->exercises->[12]->type
source: text
ta: உரை
