Repository: 247i/TACETr
Catalog: உரை/தானி/httpsgithubcomsenplfit-workout-fast-translate-*.po
Languages: ta

# global_confirm
source: Confirm
ta: உறுதிப்படுத்தவும்

# global_confirm_question
source: Are you sure?
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா?

# global_warning
source: Warning
ta: எச்சரிக்கை

# global_cancel
source: Cancel
ta: ரத்துசெய்

# global_ok
source: OK
ta: சரி

# global_yes
source: Yes
ta: ஆம்

# global_no
source: No
ta: இல்லை

source: Removed ID
ta: அகற்றப்பட்ட ஐடி

source: Failed to create folder
ta: கோப்புறையை உருவாக்கத் தவறிவிட்டது

# app_name
source: Workouts'N'Rest
ta: வொர்க்அவுட்சான் ரெச்ட்

# action_settings
source: Settings
ta: அமைப்புகள்

# DateLabel
source: Date
ta: திகதி

# FunctionLabel
source: Display
ta: காட்சி

# HistoryLabel
source: History
ta: வரலாறு

# GraphLabel
source: Graphs
ta: வரைபடங்கள்

# AddLabel
source: Add
ta: கூட்டு

# DeleteLabel
source: Delete
ta: அழி

# ShareLabel
source: Share
ta: பங்கு

# EditLabel
source: Edit
ta: தொகு

# DeleteRecordDialog
source: Remove this record?
ta: இந்த பதிவை அகற்றவா?

# FonteLabel
source: Strength
ta: வலிமை

# RecordLabel
source: Records
ta: பதிவுகள்

# SerieLabel
source: Sets
ta: செட்

# RepetitionLabel_short
source: Reps
ta: பிரதிநிதிகள்

# MachineLabel
source: Exercise
ta: உடற்பயிற்சி

# PoidsLabel
source: Weight
ta: எடை

# KgUnitLabel
source: Kg
ta: கிலோ

# LbsUnitLabel
source: Lbs
ta: பவுண்ட்

# NotesLabel
source: Notes
ta: குறிப்புகள்

# TopTenLabel
source: Last records:
ta: கடைசி பதிவுகள்:

# ShareText
source: Share
ta: பங்கு

# ShareTitle
source: Share your perf
ta: உங்கள் பெர்ஃப் பகிரவும்

# ShareInstruction
source: Edit your text before sending:
ta: அனுப்புவதற்கு முன் உங்கள் உரையைத் திருத்தவும்:

# ShareTextDefault
source: I have lifted __WEIGHT__ kg on __MACHINE__!
ta: நான் __machine__ இல் __ எடை __ கிலோவை உயர்த்தினேன்!

# ShareParamWeight
source: __WEIGHT__
ta: __ எடை __

# ShareParamMachine
source: __MACHINE__
ta: __ மச்சின்__

# CardioLabel
source: Cardio
ta: கார்டியோ

# DistanceLabel
source: Distance
ta: தூரம்

# KmUnitLabel
source: Km
ta: கி.மீ.

# MilesUnitLabel
source: Miles
ta: மைல்கள்

# DurationLabel
source: Duration
ta: காலம்

# ExerciceLabel
source: Exercises
ta: பயிற்சிகள்

# weightMenuLabel
source: Weight Track
ta: எடை பாதை

# weightLabel
source: Weight(kg)
ta: எடை (கிலோ)

# fatLabel
source: Fat(%)
ta: கொழுப்பு (%)

# bonesLabel
source: Bones(%)
ta: எலும்புகள் (

# waterLabel
source: Water(%)
ta: நீர் (%)

# musclesLabel
source: Muscles(%)
ta: தசைகள் (%)

# measureLabel
source: Measure
ta: அளவீடு

# sizeTableLabel
source: Measures history:
ta: வரலாற்றை அளவிடுகிறது:

# createProfilTitle
source: Create new profile
ta: புதிய சுயவிவரத்தை உருவாக்கவும்

source: Profile selected
ta: சுயவிவரம் தேர்ந்தெடுக்கப்பட்டது

# createProfilQuestion
source: Choose your profile name?
ta: உங்கள் சுயவிவரப் பெயரைத் தேர்வு செய்யவா?

source: User changed
ta: பயனர் மாற்றப்பட்டார்

# renameProfilTitle
source: Rename profile
ta: சுயவிவரத்தை மறுபெயரிடுங்கள்

# renameProfilQuestion
source: Rename this profile?
ta: இந்த சுயவிவரத்தை மறுபெயரிடவா?

# SettingLabel
source: Settings
ta: அமைப்புகள்

# export_database
source: Export Records
ta: ஏற்றுமதி பதிவுகள்

# export_question
source: Do you want to export the database of
ta: நீங்கள் தரவுத்தளத்தை ஏற்றுமதி செய்ய விரும்புகிறீர்களா?

# export_success
source: Database exported
ta: தரவுத்தளம் ஏற்றுமதி செய்யப்பட்டது

# export_failed
source: Database export failed
ta: தரவுத்தள ஏற்றுமதி தோல்வியடைந்தது

# import_database
source: Import Records
ta: பதிவுகளை இறக்குமதி செய்யுங்கள்

# deleteDB_warning
source: This action will reset the entire application. All data will be lost. Are you sure? This will exit the application.
ta: இந்த நடவடிக்கை முழு பயன்பாட்டையும் மீட்டமைக்கும். எல்லா தரவுகளும் இழக்கப்படும். நீங்கள் உறுதியாக இருக்கிறீர்களா? இது பயன்பாட்டிலிருந்து வெளியேறும்.

# ResetAppLabel
source: Reset application
ta: விண்ணப்பத்தை மீட்டமை

# MachinesLabel
source: Exercises
ta: பயிற்சிகள்

# pref_ui_setting
source: UI Settings
ta: இடைமுகம் அமைப்புகள்

# pref_show_mp3_player
source: Show MP3 Player
ta: எம்பி 3 பிளேயரைக் காட்டு

# pref_show_mp3_player_summary
source: Show/hide the MP3 player toolbar
ta: எம்பி 3 பிளேயர் கருவிப்பட்டியைக் காட்டவும்/மறைக்கவும்

# pref_preferredUnitSummary
source: Preferred unit:
ta: விருப்பமான அலகு:

# pref_preferredUnitTitle
source: Select your preferred weight unit
ta: உங்களுக்கு விருப்பமான எடை அலகு என்பதைத் தேர்ந்தெடுக்கவும்

# pref_preferredDistanceUnitTitle
source: Select your preferred distance unit
ta: உங்களுக்கு விருப்பமான தூர அலகு என்பதைத் தேர்ந்தெடுக்கவும்

# profil_create_new
source: Create new profile
ta: புதிய சுயவிவரத்தை உருவாக்கவும்

# profil_change
source: Change profile
ta: சுயவிவரத்தை மாற்றவும்

# profil_select_profil
source: Select a profile
ta: சுயவிவரத்தைத் தேர்ந்தெடுக்கவும்

# profil_delete
source: Delete a profile
ta: சுயவிவரத்தை நீக்கு

# profil_select_profil_to_delete
source: Select a profile to delete
ta: நீக்க ஒரு சுயவிவரத்தைத் தேர்ந்தெடுக்கவும்

# AboutLabel
source: About
ta: பற்றி

# drawer_open
source: Open navigation drawer
ta: திறந்த வழிசெலுத்தல் அலமாரியை

# drawer_close
source: Close navigation drawer
ta: வழிசெலுத்தல் அலமாரியை மூடு

# maxRep1
source: Maximum (Reps >= 1)
ta: அதிகபட்சம் (பிரதிநிதிகள்> = 1)

# maxRep5d
source: Maximum (Reps >= 5)
ta: அதிகபட்சம் (பிரதிநிதிகள்> = 5)

source: Sum
ta: தொகை

# sumDistance
source: Distance
ta: தூரம்

# sumDuration
source: Duration
ta: காலம்

source: Speed
ta: வேகம்

source: Max Weight per Duration
ta: ஒரு காலத்திற்கு அதிகபட்ச எடை

# nbSeriesPerDate
source: Nb Sets per Date
ta: ஒரு தேதிக்கு NB அமைக்கிறது

source: All
ta: அனைத்தும்

# bodytracking
source: Body Track
ta: உடல் பாதை

source: Select Muscles
ta: தசைகளைத் தேர்ந்தெடுக்கவும்

source: Biceps
ta: கயிறுகள்

source: Triceps
ta: ட்ரைசெப்ச்

# pectoraux
source: Chest
ta: மார்பு

source: Deltoids
ta: டெல்டாய்டுகள்

# dorseaux
source: Back
ta: பின்

# abdominaux
source: Abdominals
ta: வயிற்று

source: Quadriceps
ta: குவாட்ரைசெப்ச்

# ischio_jambiers
source: Hamstrings
ta: தொடை எலும்புகள்

# adducteurs
source: Thighs
ta: தொடைகள்

# mollets
source: Calves
ta: கன்றுகள்

# left_arm
source: Left biceps
ta: இடது கயிறுகள்

# right_arm
source: Right biceps
ta: வலது கயிறுகள்

source: Neck
ta: கழுத்து

source: Left thigh
ta: இடது தொடை

source: Right thigh
ta: வலது தொடை

source: Left calves
ta: இடது கன்றுகள்

source: Right calves
ta: சரியான கன்றுகள்

source: Waist
ta: இடுப்பு

# behind
source: Hips
ta: இடுப்பு

# MesureHint
source: Enter size here
ta: அளவை இங்கே உள்ளிடவும்

# backDialog_confirm_text
source: Do you want to save before exiting?
ta: வெளியேறுவதற்கு முன்பு சேமிக்க விரும்புகிறீர்களா?

# deleteMachine_confirm_text
source: Do you want to delete this exercise? All associated records will be deleted.
ta: இந்த பயிற்சியை நீக்க விரும்புகிறீர்களா? தொடர்புடைய அனைத்து பதிவுகளும் நீக்கப்படும்.

# deleteProgram_confirm_text
source: Do you want to delete this program? All associated exercise in that program will be deleted.
ta: இந்த திட்டத்தை நீக்க விரும்புகிறீர்களா? அந்த திட்டத்தில் தொடர்புடைய அனைத்து உடற்பயிற்சிகளும் நீக்கப்படும்.

# renameMachine_warning_text
source: WARNING: This exercise name already exists. Records will be merged with the other exercise.
ta: எச்சரிக்கை: இந்த உடற்பயிற்சி பெயர் ஏற்கனவே உள்ளது. பதிவுகள் மற்ற உடற்பயிற்சியுடன் இணைக்கப்படும்.

source: Camera
ta: கேமரா

source: Gallery
ta: கேலரி

# graph_all
source: All
ta: அனைத்தும்

# graph_lastyear
source: Last Year
ta: கடந்த ஆண்டு

# graph_lastmonth
source: Last Month
ta: கடந்த மாதம்

# graph_lastweek
source: Last Week
ta: கடந்த வாரம்

# ChronometerLabel
source: Chronometer
ta: காலமானி

# CountdownLabel
source: Rest time
ta: ஓய்வு நேரம்

# activate_rest_time
source: Activate rest countdown
ta: ஓய்வு கவுண்ட்டவுனை செயல்படுத்தவும்

# rest_time
source: Rest time (sec)
ta: ஓய்வு நேரம் (நொடி)

# lastRecordLabel
source: Last record
ta: கடைசி பதிவு

# FilterHint
source: Filter by exercise name
ta: உடற்பயிற்சி பெயரால் வடிகட்டவும்

source: Total weight
ta: மொத்த எடை

# total_session
source: Total during session
ta: அமர்வின் போது மொத்தம்

# total_machine
source: Total on exercise
ta: உடற்பயிற்சியில் மொத்தம்

# nb_serie
source: Nb Sets
ta: NB செட்

source: Exit
ta: வெளியேறு

# selectMachineDialogLabel
source: Select an existing exercise
ta: ஏற்கனவே உள்ள உடற்பயிற்சியைத் தேர்ந்தெடுக்கவும்

# fillNameField
source: Please enter your name, at least
ta: தயவுசெய்து உங்கள் பெயரை உள்ளிடவும்

# introSlide1Title
source: Hello
ta: வணக்கம்

# size_cm_optional
source: Size in cm (optional)
ta: முதல்வரில் அளவு (விரும்பினால்)

source: Create
ta: உருவாக்கு

source: Birthday (optional)
ta: பிறந்த நாள் (விரும்பினால்)

# name_or_pseudo
source: Name / pseudonym
ta: பெயர் / புனைப்பெயர்

source: Name is required
ta: பெயர் தேவை

source: Create a profile
ta: சுயவிவரத்தை உருவாக்கவும்

# introSlide1Text
source: Welcome to Workouts'N'Rest! App to training fast with automatic rest count.
ta: வொர்க்அவுட்சான் ரெச்டுக்கு வருக! தானியங்கி ஓய்வு எண்ணிக்கையுடன் வேகமாக பயிற்சியளிப்பதற்கான பயன்பாடு.

# introSlide2Text
source: In training program you could easly change exercises. Exercise could also change after your defined rest.
ta: பயிற்சித் திட்டத்தில் நீங்கள் பயிற்சிகளை எளிதாக்கலாம். உங்கள் வரையறுக்கப்பட்ட ஓய்வுக்குப் பிறகு உடற்பயிற்சியும் மாறக்கூடும்.

# introSlide2Title
source: Easily change exercises with buttons or gestures
ta: பொத்தான்கள் அல்லது சைகைகளுடன் பயிற்சிகளை எளிதாக மாற்றவும்

# titleSlideEssential
source: Go to the essential
ta: அத்தியாவசியத்திற்குச் செல்லுங்கள்

# textSlideEssential
source: Add program or edit existing. Then add exercise to program. Now in workout your program will run.
ta: நிரலைச் சேர்க்கவும் அல்லது இருக்கும். பின்னர் திட்டத்தில் உடற்பயிற்சியைச் சேர்க்கவும். இப்போது வொர்க்அவுட்டில் உங்கள் நிரல் இயங்கும்.

# pressBackAgain
source: Click BACK again to exit
ta: வெளியேற மீண்டும் சொடுக்கு செய்க

# titleSlideOpenSource
source: It's open-source!
ta: இது திறந்த மூல!

# textSlideOpenSource
source: Propose improvements and solutions! Visit us at https://github.com/senpl/Fit-workout-fast
ta: மேம்பாடுகள் மற்றும் தீர்வுகளை முன்மொழிகிறது! எங்களை https://github.com/senpl/fit-workout-fast இல் பார்வையிடவும்

source: Profile created
ta: சுயவிவரம் உருவாக்கப்பட்டது

source: Missing info
ta: செய்தி காணவில்லை

# createExerciseFirst
source: You must create an exercise first
ta: நீங்கள் முதலில் ஒரு பயிற்சியை உருவாக்க வேண்டும்

# impossibleToDeleteProfile
source: Impossible to delete current profile
ta: தற்போதைய சுயவிவரத்தை நீக்க இயலாது

source: Profile deleted
ta: சுயவிவரம் நீக்கப்பட்டது

source: Min
ta: மணித்துளி

source: Max
ta: அதிகபட்சம்

source: Are you sure?
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா?

source: Edit soon available
ta: திருத்து விரைவில் கிடைக்கும்

source: Name
ta: பெயர்

source: Description
ta: விவரம்

source: Muscles
ta: தசைகள்

source: Start
ta: தொடங்கு

source: Reset
ta: மீட்டமை

# profileEnterYourSize
source: Your size
ta: உங்கள் அளவு

# profileEnterYourBirthday
source: Your birthday
ta: உங்கள் பிறந்த நாள்

source: Profile page
ta: சுயவிவர பக்கம்

# ProfileLabel
source: Profile
ta: சுயவிவரம்

source: Edit value
ta: மதிப்பைத் திருத்தவும்

# menu_Workout
source: Workout
ta: பயிற்சி

# renameMachine_error_text2
source: ERROR: This exercise name already exists. It is not possible to merge two exercises with same name and different types.
ta: பிழை: இந்த உடற்பயிற்சி பெயர் ஏற்கனவே உள்ளது. ஒரே பெயர் மற்றும் வெவ்வேறு வகைகளுடன் இரண்டு பயிற்சிகளை ஒன்றிணைக்க முடியாது.

# renameProgram_error_text2
source: ERROR: This program name already exists. It is not possible to merge two programs with same name.
ta: பிழை: இந்த நிரல் பெயர் ஏற்கனவே உள்ளது. இரண்டு நிரல்களை ஒரே பெயருடன் ஒன்றிணைக்க முடியாது.

source: Record copied
ta: பதிவு நகலெடுக்கப்பட்டது

# imcLabel
source: BMI
ta: பி.எம்.ஐ.

# rfmLabel
source: RFM
ta: ஆர்.எஃப்.எம்

source: underweight
ta: எடை குறைவாக

source: normal
ta: சாதாரண

source: overweight
ta: அதிக எடை

source: obese
ta: பருமனான

# maleGender
source: Male
ta: ஆண்

# femaleGender
source: Female
ta: பெண்

# otherGender
source: Other
ta: மற்றொன்று

# enter_gender_here
source: Enter gender
ta: பாலினத்தை உள்ளிடவும்

source: no size available
ta: அளவு கிடைக்கவில்லை

source: no weight available
ta: எடை கிடைக்கவில்லை

# BMI_dialog_title
source: Body Mass Index (BMI)
ta: உடல் நிறை அட்டவணை (பி.எம்.ஐ)

# BMI_formula
source: BMI = weight(kg) / size(m)²
ta: BMI = எடை (கிலோ) / அளவு (மீ)

# RFM_dialog_title
source: Relative Fat Mass Index (RFM)
ta: உறவினர் கொழுப்பு வெகுசன அட்டவணை (RFM)

# RFM_female_formula
source: Women: RFM = 76 – (20 x (size/waist circumference))
ta: பெண்கள்: RFM = 76 - (20 ஃச் (அளவு/இடுப்பு சுற்றளவு))

# RFM_male_formula
source: Men: RFM = 64 – (20 x (size/waist circumference))
ta: ஆண்கள்: RFM = 64 - (20 ஃச் (அளவு/இடுப்பு சுற்றளவு))

source: Access granted
ta: அணுகல் வழங்கப்பட்டது

# another_time_maybe
source: Maybe another time :)
ta: மற்றொரு நேரம் :)

source: New folder
ta: புதிய கோப்புறை

# FFMI_dialog_title
source: Fat-free mass index (FFMI)
ta: கொழுப்பு இல்லாத வெகுசன அட்டவணை (FFMI)

# FFMI_formula
source: FFMI [kg/m2] = weight [kg] × (1 − (body fat [%] / 100)) / (height [m])²
ta: Ffmi [kg / m2] = எடை [kg] × (1 - (உடல் கொழுப்பு [%] / 100)) / (உயரம் [மீ]) ²

source: no fat available
ta: கொழுப்பு எதுவும் கிடைக்கவில்லை

# indexLabel
source: Index
ta: குறியெண்

source: What type of exercise?
ta: என்ன வகையான உடற்பயிற்சி?

source: Exercise Type:
ta: உடற்பயிற்சி வகை:

# staticExercise
source: Isometric
ta: ஐசோமெட்ரிக்

# SecondsLabel_short
source: Secs
ta: நொடி

# imported_successfully
source: imported
ta: இறக்குமதி செய்யப்பட்டது

source: import failed
ta: இறக்குமதி தோல்வியடைந்தது

# import_new_exercise_first
source: (Make sure to import new exercises first)
ta: (முதலில் புதிய பயிற்சிகளை இறக்குமதி செய்வதை உறுதிசெய்க)

# MachineHint
source: Name of your exercise
ta: உங்கள் உடற்பயிற்சியின் பெயர்

source: Trapezius
ta: ட்ரெபீசியச்

source: Obliques
ta: சாய்வுகள்

source: Shoulders
ta: தோள்கள்

# timeLabel
source: Time
ta: நேரம்

# light_mode
source: Light
ta: ஒளி

# dark_mode
source: Dark
ta: இருண்ட

# autoui_mode
source: Auto
ta: தானி

# daynightmode_settingtitle
source: Select your theme (restart needed)
ta: உங்கள் கருப்பொருளைத் தேர்ந்தெடுக்கவும் (மறுதொடக்கம் தேவை)

# fitness_programs
source: Programs
ta: திட்டங்கள்

# manu_programs
source: Programs
ta: திட்டங்கள்

# FromProgramLabel
source: Programs
ta: திட்டங்கள்

# NewProgramHint
source: Name of your training program
ta: உங்கள் பயிற்சி திட்டத்தின் பெயர்

# ProgramRunnerLabel
source: Run program
ta: ரன் புரோகிராம்

# ProgramsLabel
source: Programs
ta: திட்டங்கள்

# machine_name
source: Exercise Name
ta: உடற்பயிற்சி பெயர்

source: Program name
ta: நிரல் பெயர்

# program_hint
source: Enter program name
ta: நிரல் பெயரை உள்ளிடவும்

source: Exercises in program:
ta: நிரலில் பயிற்சிகள்:

# program_selection
source: Selected program:
ta: தேர்ந்தெடுக்கப்பட்ட நிரல்:

source: Seconds
ta: நொடிகள்

# expandad_aditional_details_arrow
source: expanded additional details arrow
ta: கூடுதல் விவரங்கள் அம்பு விரிவாக்கப்பட்டது

source: Automatic time
ta: தானியங்கி நேரம்

# ExercisesInProgramLabel
source: Exercises in program
ta: நிரலில் பயிற்சிகள்

source: Add program first
ta: முதலில் நிரலைச் சேர்க்கவும்

# delete_bodypart_confirm
source: Do you want to delete this bodypart ? All associated measures will be deleted.
ta: இந்த பாடர்பார்ட்டை நீக்க விரும்புகிறீர்களா? தொடர்புடைய அனைத்து நடவடிக்கைகளும் நீக்கப்படும்.

source: New measure
ta: புதிய நடவடிக்கை

source: Enter profile name
ta: சுயவிவர பெயரை உள்ளிடவும்

source: Enter size (cm)
ta: அளவை உள்ளிடவும் (முதல்வர்)

source: Enter birthday
ta: பிறந்தநாளை உள்ளிடவும்

source: Enter Body part name
ta: உடல் பகுதி பெயரை உள்ளிடவும்

# strength_category
source: Strength
ta: வலிமை

# rest_counter
source: Rest %1$d s
ta: ஓய்வு %1 $ டி கள்

source: Click to start
ta: தொடங்க சொடுக்கு செய்க

source: Exercise time
ta: உடற்பயிற்சி நேரம்

source: Rest finished
ta: ஓய்வு முடிந்தது

# count_string
source: %1$d s
ta: %1 $ டி கள்

source: Error
ta: பிழை

source: Programs Settings
ta: நிரல்கள் அமைப்புகள்

# playRestSound
source: Play rest finish sound
ta: ஓய்வு பூச்சு ஒலி

# playRestSoundDescription
source: Emit sound after rest times finishes
ta: ஓய்வு நேரங்கள் முடிந்ததும் ஒலியை வெளியிடுங்கள்

# playStaticExerciseFinishSoundDescription
source: Emit sound after static exercise time finished
ta: நிலையான உடற்பயிற்சி நேரம் முடிந்ததும் ஒலியை வெளியிடுங்கள்

source: Play static exercise finish sound
ta: நிலையான உடற்பயிற்சி பூச்சு ஒலி

# FailLabel
source: Fail
ta: தோல்வி

# DoneLabel
source: Done
ta: முடிந்தது

# failedToDoReps
source: Failed to do all repetitions
ta: எல்லா மறுபடியும் செய்யத் தவறிவிட்டது

source: Sound Settings
ta: ஒலி அமைப்புகள்

# nextExerciseSwitch
source: Next exercise after previous finish
ta: முந்தைய முடிவுக்குப் பிறகு அடுத்த உடற்பயிற்சி

# nextExerciseSwitchDescription
source: When You click check done on exercises it will move to next exercise in program
ta: பயிற்சிகளில் முடிந்த காசோலை என்பதைக் சொடுக்கு செய்யும் போது, ​​அது நிரலில் அடுத்த உடற்பயிற்சிக்கு நகரும்

source: End
ta: முடிவு

# swipeGesturesSwitch
source: Swipe gestures
ta: சைகைகளை ச்வைப் செய்யுங்கள்

# swipeGesturesDescription
source: Allow fast change of exercises to next with swipe gesture.
ta: ச்வைப் சைகையுடன் அடுத்ததாக பயிற்சிகளை விரைவாக மாற்ற அனுமதிக்கவும்.

# restLabel
source: Rest
ta: ஓய்வு

# chooseRestSound
source: Choose rest finish sound
ta: ஓய்வு பூச்சு ஒலியைத் தேர்வுசெய்க

# chooseStaticSound
source: Choose static timer end sound
ta: நிலையான நேரங்குறிகருவி எண்ட் ஒலியைத் தேர்வுசெய்க

source: kg
ta: கிலோ

source: Lbs
ta: பவுண்ட்

# single_exercise_and_results
source: Results
ta: முடிவுகள்

# static_prepare_seconds
source: Static exercise prepare time always 5 sec.
ta: நிலையான உடற்பயிற்சி எப்போதும் 5 நொடி நேரத்தை ஆயத்தம் செய்யுங்கள்.

# anonymous
source: Default
ta: இயல்புநிலை

# SaveWeightLabel
source: save weight into program
ta: எடையை நிரலில் சேமிக்கவும்

source: Saved into program
ta: நிரலில் சேமிக்கப்பட்டது

# SaveRepsLabel
source: Save reps into program
ta: பிரதிநிதிகளை நிரலில் சேமிக்கவும்

# add_exercise_to_program_first
source: Add exercise to program first. No program without exercises allowed.
ta: முதலில் நிரலில் உடற்பயிற்சியைச் சேர்க்கவும். பயிற்சிகள் இல்லாமல் எந்த நிரலும் அனுமதிக்கப்படவில்லை.
