Repository: 247i/TACETr
Catalog: உரை/தானி/idichotic-idichotic-*.po
Languages: ta

source: Settings
ta: அமைப்புகள்

source: Sex
ta: செக்ச்

source: Male
ta: ஆண்

source: Female
ta: பெண்

# otherSex
source: Other
ta: மற்றொன்று

source: Dominant hand
ta: ஆதிக்க கை

source: Age
ta: அகவை

source: Native Language
ta: சொந்த மொழி

source: Sound Language
ta: ஒலி மொழி

# unspecified
source: N/A
ta: இதற்கில்லை

source: Right
ta: வலது

source: Left
ta: இடது

source: Concentrate
ta: செறிவு

source: Listen
ta: கேளுங்கள்

source: Results
ta: முடிவுகள்

# duration_3
source: Duration: 3 minutes
ta: காலம்: 3 நிமிடங்கள்

# duration_5
source: Duration: 5 minutes
ta: காலம்: 5 நிமிடங்கள்

source: Duration: Infinite
ta: காலம்: எல்லையற்றது

source: The Tests
ta: சோதனைகள்

source: iDichotic
ta: ஐடிகோடிக்

# takeTests
source: Take the test
ta: சோதனை எடுத்துக் கொள்ளுங்கள்

source: Learn More
ta: மேலும் அறிக

# testChoose
source: Choose a test
ta: ஒரு சோதனையைத் தேர்வுசெய்க

# threeSeconds
source: Three seconds until the test start
ta: மூன்று வினாடிகள் வரை சோதனை தொடக்க

source: Practice
ta: பயிற்சி

# practiceInfo
source: If you have not taken this type of test before, we recommend you to practice before you do.
ta: இதற்கு முன்பு நீங்கள் இந்த வகை சோதனையை எடுக்கவில்லை என்றால், நீங்கள் செய்வதற்கு முன் பயிற்சி செய்ய பரிந்துரைக்கிறோம்.

# test1
source: Test One
ta: ஒன்றை சோதிக்கவும்

# test1Info
source: In this test you get presented multiple sound, with different syllables on each ear. You should press the button for the syllable you hear best.
ta: இந்த சோதனையில் நீங்கள் ஒவ்வொரு காதிலும் வெவ்வேறு எழுத்துக்களுடன் பல ஒலியை வழங்குகிறீர்கள். நீங்கள் சிறப்பாகக் கேட்கும் எழுத்துக்கு நீங்கள் பொத்தானை அழுத்த வேண்டும்.

# test2
source: Test Two
ta: இரண்டு சோதனை

# test2Info
source: In this test you also get presented with mulitple sounds with different syllables. But here you should concentrate on one ear at a time and press the button you hear best on that ear.
ta: இந்த சோதனையில் நீங்கள் வெவ்வேறு எழுத்துக்களுடன் பல ஒலிகளுடன் வழங்கப்படுவீர்கள். ஆனால் இங்கே நீங்கள் ஒரு நேரத்தில் ஒரு காதில் கவனம் செலுத்த வேண்டும், அந்த காதில் நீங்கள் சிறப்பாகக் கேட்கும் பொத்தானை அழுத்தவும்.

# concentrateOn
source: Consentrate on the
ta: கவனம் செலுத்துங்கள்

source: RIGHT EAR
ta: வலது காது

source: LEFT EAR
ta: இடது காது

# learnDichotic
source: Learn more about dichotic listening
ta: டைகோடிக் கேட்பது பற்றி மேலும் அறிக

# reference
source: References:
ta: குறிப்புகள்:

# dichoticReferences
source: Broadbent, D. E. (1954). The role of auditory localization in attention and memory span. Journal of experimental psychology, 47(3), 191-196. Bryden, M. P. (1988). An overview of the dichotic listening procedure and its relation to cerebral organization. In K. Hugdahl (Ed.), Handbook of dichotic listening: Theory, methods and research (pp.1-43). Chichester, England: Wiley. Frost, J. A., Binder, J. R., Springer, J. A., Hammeke, T. A., Bellgowan, P. S., Rao, S. M., & Cox, R.W. (1999). Language processing is strongly left lateralized in both sexes. Evidence from functional MRI. Brain, 122(2), 199-208. Hugdahl, K., & Andersson, L. (1986). The "forced-attention paradigm" in dichotic listening to CV-syllables: a comparison between adults and children. Cortex, 22(3), 417-432. Hugdahl, K. (2003). Dichotic listening in the study of auditory laterality. In K. Hugdahl & R. J. Davidson (Eds.), The asymmetrical brain. Cambridge, Mass.: MIT Press. Kimura, D. (1961a). Cerebral dominance and the perception of verbal stimuli. Canadian journal of psychology, 15(3), 166-171. Kimura, D. (1961b). Some effects of temporal-lobe damage on auditory perception. Canadian journal of psychology, 15, 156-165. Loring, D. W., Meador, K. J., Lee, G. P., Murro, A. M., Smith, J. R., Flanigin, H. F., Gallagher, B. B., & King, D. W. (1990). Cerebral language lateralization: evidence from intracarotid amobarbital testing. Neuropsychologia, 28(8), 831-838. Rosenzweig, M. R. (1951). Representations of the two ears at the auditory cortex. American journal of physiology, 167(1), 147. Tervaniemi, M. & Hugdahl, K. (2003). Lateralization of auditory-cortex functions. Brain Research Reviews, 43, 231-246.
ta: பிராட்பென்ட், டி. இ. (1954). கவனம் மற்றும் நினைவக இடைவெளியில் செவிவழி உள்ளூர்மயமாக்கலின் பங்கு. சோதனை உளவியல் இதழ், 47 (3), 191-196. பிரைடன், எம். பி. (1988). டைகோடிக் கேட்கும் நடைமுறை மற்றும் பெருமூளை அமைப்புடனான அதன் தொடர்பு பற்றிய கண்ணோட்டம். கே. அக்டால் (எட்.), டைகோடிக் கேட்பதற்கான கையேடு: கோட்பாடு, முறைகள் மற்றும் ஆராய்ச்சி (பக் .1-43). சிச்செச்டர், இங்கிலாந்து: விலே. ஃப்ரோச்ட், சே. ஏ., பைண்டர், சே. ஆர்., ச்பிரிங்கர், சே. ஏ., அம்மேக், டி. ஏ., பெல்கோவன், பி.எச்., ராவ், எச்.எம்., & காக்ச், ஆர்.டபிள்யூ. (1999). மொழி செயலாக்கம் இரு பாலினத்திலும் வலுவாக பக்கவாட்டாக உள்ளது. செயல்பாட்டு எம்.ஆர்.ஐ யிலிருந்து சான்றுகள். மூளை, 122 (2), 199-208. அக்டால், கே., & ஆண்டர்சன், எல். (1986). சி.வி.-எழுத்துக்களைக் கேட்பதில் "கட்டாய-கவனிப்பு முன்னுதாரணம்": பெரியவர்களுக்கும் குழந்தைகளுக்கும் இடையிலான ஒப்பீடு. கோர்டெக்ச், 22 (3), 417-432. அக்டால், கே. (2003). செவிவழி பக்கவாட்டு ஆய்வில் டைகோடிக் கேட்பது. கே. அக்டால் & ஆர். சே. டேவிட்சன் (எட்.), சமச்சீரற்ற மூளை. கேம்பிரிட்ச், மாச்.: எம்ஐடி பிரச். கிமுரா, டி. (1961 அ). பெருமூளை ஆதிக்கம் மற்றும் வாய்மொழி தூண்டுதல்களின் கருத்து. கனடிய சர்னல் ஆஃப் சைக்காலசி, 15 (3), 166-171. கிமுரா, டி. (1961 பி). செவிவழி உணர்வில் தற்காலிக-லோப் சேதத்தின் சில விளைவுகள். கனடியன் சர்னல் ஆஃப் சைக்காலசி, 15, 156-165. லோரிங், டி. டபிள்யூ., மீடோர், கே. சே., லீ, சி. பி., முர்ரோ, ஏ.எம்., ச்மித், சே. ஆர். பெருமூளை மொழி பக்கவாட்டுப்படுத்தல்: இன்ட்ராகரோடிட் அமோபார்பிட்டல் சோதனையிலிருந்து சான்றுகள். நியூரோ சைக்காலசியா, 28 (8), 831-838. ரோசென்ச்வீக், எம். ஆர். (1951). செவிவழி கோர்டெக்சில் இரண்டு காதுகளின் பிரதிநிதித்துவங்கள். அமெரிக்கன் சர்னல் ஆஃப் பிசியாலசி, 167 (1), 147. டெர்வானிமி, எம். & அக்டால், கே. (2003). செவிவழி-கார்டெக்ச் செயல்பாடுகளின் பக்கவாட்டு. மூளை ஆராய்ச்சி மதிப்புரைகள், 43, 231-246.

# dichoticParagraph
source: The beginnings of the dichotic listening technique can be traced back to the 1950s and Donald Broadbent, who was interested in testing auditory attention abilities in air traffic controllers. About 10 years later, Doreen Kimura (1961a, 1961b) modified the paradigm and used spoken digits, which were presented simultaneously via headphones, one to each ear, to investigate language lateralization in patients with epilepsy and healthy subjects. The results showed that in both cases subjects with left hemisphere language processing recalled more items from the right ear, yielding what is called the right ear advantage. Subjects with language functions lateralized to the right hemisphere showed a tendency to report items presented to the left ear, yielding a left ear advantage. These findings have been replicated by numerous scientific studies (Hugdahl, 2003; Bryden, 1988). More recently, Kenneth Hugdahl and colleagues have developed a consonant-vowel version of the dichotic listening paradigm (Hugdahl & Andersson, 1986), which is the basis of this iDichotic App. There are a few theoretical models that attempt to explain the common bias to report the right ear stimulus. The most widely accepted one goes back to Kimura (1967) and is called the structural model. It is based on the observation that each ear is predominantly connected to the opposite (contralateral) side of the brain (see Rosenzweig, 1951). As a result, the stimulus played to the right ear will be more strongly represented in the contralateral left hemisphere, which in most individuals is the hemisphere which processes speech and language (Tervaniemi & Hugdahl, 2003; Frost el al., 1999; Loring et al., 1990). However, stimuli presented to the left ear will first be transferred to the right hemisphere. Since the right hemisphere is not able to fully process speech, the incoming information needs to be transferred to the left hemisphere in order to get processed. The resulting in a delayed processing of the left-ear as compared to the right-ear stimulus is thought to explain the right-ear preference in dichotic listening.
ta: டைகோடிக் கேட்கும் நுட்பத்தின் தொடக்கத்தை 1950 களில் காணலாம் மற்றும் விமானப் போக்குவரத்துக் கட்டுப்பாட்டாளர்களில் செவிவழி கவனம் திறன்களை சோதிக்க ஆர்வமாக இருந்த டொனால்ட் பிராட்பெண்ட். சுமார் 10 ஆண்டுகளுக்குப் பிறகு, டோரீன் கிமுரா (1961 அ, 1961 பி) முன்னுதாரணத்தை மாற்றியமைத்து, பேசும் இலக்கங்களைப் பயன்படுத்தினார், அவை ஒரே நேரத்தில் எட்ஃபோன்கள் வழியாக வழங்கப்பட்டன, ஒவ்வொரு காதுக்கும் ஒன்று, கால் -கை வலிப்பு மற்றும் ஆரோக்கியமான பாடங்களில் மொழி பக்கவாட்டுப்படுத்தலை விசாரிக்க. இரண்டு நிகழ்வுகளிலும் இடது அரைக்கோளம் மொழி செயலாக்கத்துடன் கூடிய பாடங்கள் வலது காதில் இருந்து அதிகமான பொருட்களை நினைவுபடுத்துகின்றன, இது வலது காது நன்மை என்று அழைக்கப்படுகிறது. வலது அரைக்கோளத்திற்கு பக்கவாட்டு மொழி செயல்பாடுகளைக் கொண்ட பாடங்கள் இடது காதுக்கு வழங்கப்பட்ட உருப்படிகளைப் புகாரளிக்கும் போக்கைக் காட்டின, இடது காது நன்மையை அளித்தன. இந்த கண்டுபிடிப்புகள் பல அறிவியல் ஆய்வுகளால் பிரதிபலிக்கப்பட்டுள்ளன (அக்டால், 2003; பிரைடன், 1988). மிக அண்மைக் காலத்தில், கென்னத் அக்டால் மற்றும் சகாக்கள் இந்த ஐடிகோடிக் பயன்பாட்டின் அடிப்படையான டைகோடிக் கேட்கும் முன்னுதாரணத்தின் (அயடால் & ஆண்டர்சன், 1986) மெய்-உயிர் பதிப்பை உருவாக்கியுள்ளனர். சரியான காது தூண்டுதலைப் புகாரளிக்க பொதுவான சார்புகளை விளக்க முயற்சிக்கும் சில தத்துவார்த்த மாதிரிகள் உள்ளன. மிகவும் பரவலாக ஏற்றுக்கொள்ளப்பட்ட ஒருவர் கிமுராவுக்கு (1967) செல்கிறார், மேலும் இது கட்டமைப்பு மாதிரி என்று அழைக்கப்படுகிறது. ஒவ்வொரு காது முக்கியமாக மூளையின் எதிர் (முரண்பாடான) பக்கத்துடன் இணைக்கப்பட்டுள்ளது என்ற கவனிப்பை அடிப்படையாகக் கொண்டது (ரோசென்ச்வீக், 1951 ஐப் பார்க்கவும்). இதன் விளைவாக, வலது காதில் விளையாடும் தூண்டுதல் முரண்பாடான இடது அரைக்கோளத்தில் மிகவும் வலுவாக குறிப்பிடப்படும், இது பெரும்பாலான நபர்களில் பேச்சு மற்றும் மொழியை செயலாக்கும் அரைக்கோளமாகும் (டெர்வானிமி & அயடால், 2003; ஃப்ரோச்ட் எல் அல்., 1999; லோரிங் எட் அல்., 1990). இருப்பினும், இடது காதுக்கு வழங்கப்படும் தூண்டுதல்கள் முதலில் வலது அரைக்கோளத்திற்கு மாற்றப்படும். வலது அரைக்கோளத்தால் பேச்சை முழுமையாக செயலாக்க முடியவில்லை என்பதால், செயலாக்கப்படுவதற்கு உள்வரும் தகவல்களை இடது அரைக்கோளத்திற்கு மாற்ற வேண்டும். வலது காது தூண்டுதலுடன் ஒப்பிடும்போது இடது-காது தாமதமாக செயலாக்குவதன் விளைவாக, டைகோடிக் கேட்பதில் வலது-காது விருப்பத்தை விளக்கும் என்று கருதப்படுகிறது.

# brainLeft
source: LEFT
ta: இடது

# brainRight
source: RIGHT
ta: வலது

# brainBoth
source: BOTH
ta: இரண்டும்

# earLeft
source: You had more correct answers from the right ear. This indicates that language is processed mainly in the
ta: சரியான காதில் இருந்து சரியான பதில்கள் உங்களிடம் இருந்தன. மொழி முக்கியமாக செயலாக்கப்படுகிறது என்பதை இது குறிக்கிறது

# earBoth
source: You had the same amount of correct answers from the both ears. This indicates that language is processed in
ta: இரு காதுகளிலிருந்தும் சரியான பதில்கள் உங்களிடம் இருந்தன. மொழி செயலாக்கப்படுவதை இது குறிக்கிறது

# earRight
source: You had more correct answers from the left ear. This indicates that language is processed mainly in the
ta: இடது காதில் இருந்து இன்னும் சரியான பதில்கள் உங்களிடம் இருந்தன. மொழி முக்கியமாக செயலாக்கப்படுகிறது என்பதை இது குறிக்கிறது

# sideSingle
source: side of your brain
ta: உங்கள் மூளையின் பக்கம்

# sidePlural
source: sides of your brain
ta: உங்கள் மூளையின் பக்கங்கள்

# soundProcessing
source: Shows the location of your basic sound processing
ta: உங்கள் அடிப்படை இருப்பிடத்தைக் காட்டுகிறது ஒலி செயலாக்கம்

source: Well done!
ta: நல்லது!

# prRight
source: % Right
ta: % சரி

# prError
source: % Error
ta: % பிழை

# prLeft
source: % Left
ta: % இடது

# submitResults
source: Submit results for our research
ta: எங்கள் ஆராய்ச்சிக்கான முடிவுகளை சமர்ப்பிக்கவும்

# contribute
source: You can contribute to our research by submitting your results to our global dichotic listening databas The transfer of your test results to our database is optional and depends on your consent. The size of the files is very small (< 2kb). Most importantly, the transferred file is completely anonymous. We use a secure file transfer protocol and password protected data storage on a university-owned server. The file cannot be traced to a particular iPhone ID. It includes the settings and test scores. We reserve the rights to use this information for statistical analyses and scientific publications. The average statistics of results received by us can be viewed at www.dichoticlistening.com. You can read more about us at http://fmri.uib.no
ta: உங்கள் முடிவுகளை எங்கள் உலகளாவிய டைகோடிக் கேட்கும் தரவுத்தளங்களுக்கு சமர்ப்பிப்பதன் மூலம் எங்கள் ஆராய்ச்சிக்கு நீங்கள் பங்களிக்க முடியும், உங்கள் சோதனை முடிவுகளை எங்கள் தரவுத்தளத்திற்கு மாற்றுவது விருப்பமானது மற்றும் உங்கள் ஒப்புதலைப் பொறுத்தது. கோப்புகளின் அளவு மிகச் சிறியது (<2KB). மிக முக்கியமாக, மாற்றப்பட்ட கோப்பு முற்றிலும் அநாமதேயமானது. பல்கலைக்கழகத்திற்கு சொந்தமான சேவையகத்தில் பாதுகாப்பான கோப்பு பரிமாற்ற நெறிமுறை மற்றும் கடவுச்சொல் பாதுகாக்கப்பட்ட தரவு சேமிப்பிடத்தைப் பயன்படுத்துகிறோம். கோப்பை ஒரு குறிப்பிட்ட ஐபோன் ஐடியைக் கண்டுபிடிக்க முடியாது. இது அமைப்புகள் மற்றும் சோதனை மதிப்பெண்களை உள்ளடக்கியது. புள்ளிவிவர பகுப்பாய்வுகள் மற்றும் அறிவியல் வெளியீடுகளுக்கு இந்த தகவலைப் பயன்படுத்துவதற்கான உரிமைகளை நாங்கள் வைத்திருக்கிறோம். எங்களால் பெறப்பட்ட முடிவுகளின் சராசரி புள்ளிவிவரங்களை www.dichoticlistening.com இல் காணலாம். எங்களைப் பற்றி http://fmri.uib.no இல் மேலும் படிக்கலாம்

source: Submit
ta: சமர்ப்பிக்கவும்

source: Back
ta: பின்

source: Main Results
ta: முக்கிய முடிவுகள்

source: Details
ta: விவரங்கள்

source: Animation
ta: அனிமேசன்

source: Tests
ta: தேர்வுகள்

# handedness
source: Dominant Hand
ta: ஆதிக்க கை

source: Both
ta: இரண்டும்

# continueString
source: Continue
ta: தொடரவும்

# missingOption
source: You appear to not have filled out some of the options, please look over them again
ta: சில விருப்பங்களை நீங்கள் நிரப்பவில்லை என்று தோன்றுகிறது, தயவுசெய்து அவற்றை மீண்டும் பாருங்கள்

# canContinue
source: You can press the button below to ignore the warning, at the cost of accuracy
ta: துல்லியமான செலவில், எச்சரிக்கையை புறக்கணிக்க கீழே உள்ள பொத்தானை அழுத்தலாம்

# dismiss
source: Ignore
ta: புறக்கணிக்கவும்
