Repository: 247i/TACETr
Catalog: உரை/தானி/impfen-mediator-*.po
Languages: ta

# mediator.imprint.page-title
source: Impressum
ta: முத்திரை

# mediator.logout.button
source: Abmelden
ta: வெளியேறு

# mediator.logout.intro
source: Möchten Sie sich wirklich abmelden? Bitte stellen Sie sicher, dass Sie die Sicherungsdatei mit Ihren Login-Daten zur Verfügung haben. Ohne diese können Sie sich nicht wieder anmelden. Es gibt keine "Passwort vergessen"-Funktion.
ta: நீங்கள் உண்மையில் குழுவிலக விரும்புகிறீர்களா? உங்கள் உள்நுழைவு தரவுகளுடன் காப்புப்பிரதி கோப்பு இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். இது இல்லாமல் நீங்கள் மீண்டும் பதிவு செய்ய முடியாது. "மறந்துபோன கடவுச்சொல்" செயல்பாடு இல்லை.

# mediator.logout.notification.success
source: Erfolgreich abgemeldet
ta: வெற்றிகரமாக ஒழுங்குபடுத்தப்பட்டது

# mediator.logout.page-title
source: Abmelden
ta: வெளியேறு

# mediator.logout.title
source: Abmelden
ta: வெளியேறு

# mediator.nav.logout
source: Abmelden
ta: வெளியேறு

# mediator.nav.providers
source: Impfstellen
ta: தடுப்பூசி புள்ளிகள்

# mediator.privacy.page-title
source: Datenschutzerklärung
ta: தரவு பாதுகாப்பு அறிவிப்பு

# mediator.providers.button.unverified-providers
source: Unbestätigte Impfstellen
ta: ஆக்கிரமிக்கப்படாத தடுப்பூசி மையங்கள்

# mediator.providers.button.verified-providers
source: Bestätigte Impfstellen
ta: தடுப்பூசி புள்ளிகள் உறுதிப்படுத்தப்பட்டன

# mediator.providers.details.back-link
source: Zurück zur Übersicht
ta: கண்ணோட்டத்திற்குத் திரும்பு

# mediator.providers.details.confirm-question
source: Sind Sie sicher, dass Sie die Daten der Impfstelle bestätigen wollen?
ta: தடுப்பூசி மையத்திலிருந்து தரவை உறுதிப்படுத்த விரும்புகிறீர்கள் என்பதில் உறுதியாக இருக்கிறீர்களா?

# mediator.providers.details.notification.error
source: Bestätigung der Impfstelle fehlgeschlagen
ta: தடுப்பூசி தளத்தின் உறுதிப்படுத்தல் தோல்வியடைந்தது

# mediator.providers.details.notification.success
source: Impfstelle erfolgreich bestätigt
ta: தடுப்பூசி புள்ளி வெற்றிகரமாக உறுதிப்படுத்தப்பட்டது

# mediator.providers.details.page-title
source: Impfstellen
ta: தடுப்பூசி புள்ளிகள்

# mediator.providers.details.provider
source: Impfstelle
ta: தடுப்பூசி புள்ளி

# mediator.providers.index.page-title
source: Impfstellen
ta: தடுப்பூசி புள்ளிகள்

# mediator.providers.index.table.caption
source: Impfstellen
ta: தடுப்பூசி புள்ளிகள்

# mediator.providers.index.table.head.actions
source: Aktionen
ta: செயல்கள்

# mediator.providers.index.table.head.adress
source: Adresse
ta: முகவரி

# mediator.providers.index.table.head.name
source: Name der Impfstelle
ta: தடுப்பூசி புள்ளியின் பெயர்

# mediator.providers.index.table.head.status
source: Status
ta: நிலை

# mediator.providers.index.table.row.no-data
source: Keine Impfstellen gefunden
ta: தடுப்பூசி மையங்கள் எதுவும் கிடைக்கவில்லை

# mediator.providers.index.table.row.show-details
source: Details anzeigen
ta: விவரங்களைக் காட்டு

# mediator.provider-row.invalid
source: Nicht bestätigte Daten
ta: யு.என்.எச் உறுதிப்படுத்தப்பட்ட தரவு

# mediator.provider-row.valid
source: Impfstelle bestätigt
ta: தடுப்பூசி புள்ளி உறுதிப்படுத்தப்பட்டது

# mediator.providers.index.title
source: Impfstellen
ta: தடுப்பூசி புள்ளிகள்

# mediator.providers.show.accessible
source: Besteht barrierefreier Zugang zur Praxis/zur Impfstelle?
ta: தடுப்பு -இலவச அணுகல் நடைமுறைக்கு/தடுப்பூசி மையத்திற்கு இலவசமாக அணுகுமா?

# mediator.providers.show.accessible-no
source: Nein
ta: இல்லை

# mediator.providers.show.accessible-yes
source: Ja
ta: மற்றும்

# mediator.providers.show.button-confirm
source: Impfstelle bestätigen
ta: தடுப்பூசி உறுதிப்படுத்தவும்

# mediator.providers.show.description
source: Informationen für Impfinteressierte
ta: தடுப்பூசிக்கு ஆர்வமுள்ளவர்களுக்கான செய்தி

# mediator.providers.show.email
source: E-Mail-Adresse
ta: மின்னஞ்சல்-அம்சம்

# mediator.providers.show.name
source: Name der Impfstelle
ta: தடுப்பூசி புள்ளியின் பெயர்

# mediator.providers.show.not-given
source: (keine Angabe)
ta: (குறிப்பிடப்படவில்லை)

# mediator.providers.show.street
source: Straße
ta: தெரு

# mediator.providers.show.website
source: Webseite
ta: வலைத்தளம்

# mediator.providers.show.zip-code
source: Postleitzahl
ta: அஞ்சல் குறியீடு

# mediator.welcome.button-submit
source: Als Vermittler anmelden
ta: ஒரு இடைத்தரகராக பதிவு செய்யுங்கள்

# mediator.welcome.input-select-keypairs
source: Sicherungsdatei
ta: காப்புப்பிரதி கோப்பு

# mediator.welcome.intro
source: Bitte laden Sie die Sicherungsdatei mit Ihren geheimen Login-Daten.
ta: உங்கள் ரகசிய உள்நுழைவு தரவுகளுடன் காப்புப்பிரதி கோப்பைப் பதிவிறக்கவும்.

# mediator.welcome.login.notification.error
source: Bei der Anmeldung ist ein Fehler aufgetreten
ta: பதிவு செய்யும் போது பிழை ஏற்பட்டது

# mediator.welcome.login.notification.success
source: Erfolgreich angemeldet
ta: வெற்றிகரமாக பதிவு செய்யப்பட்டுள்ளது

# mediator.welcome.page-title
source: Impfstellen freischalten
ta: தடுப்பூசி ஏசென்சிகளைத் திறக்கவும்

# mediator.welcome.select-keypairs
source: Login-Daten auswählen
ta: உள்நுழைவு தரவைத் தேர்ந்தெடுக்கவும்

# mediator.welcome.title
source: Impfstellen freischalten
ta: தடுப்பூசி ஏசென்சிகளைத் திறக்கவும்
