Repository: 247i/TACETr
Catalog: உரை/தானி/jexiftoolgui-program_strings-*.po
Languages: ta

# emd.expfolder
source: Folder containing exported files
ta: ஏற்றுமதி செய்யப்பட்ட கோப்புகளைக் கொண்ட கோப்புறை

# cmd.dlgtitle
source: Copy all metadata to XMP format
ta: அனைத்து மெட்டாடேட்டாவையும் எக்ச்எம்பி வடிவத்திற்கு நகலெடுக்கவும்

# cmd.dlgtext
source: Copy all possible info from Exif and other tags into XMP format?<br>(This is an internal "same image to same image" copy, for all the selected images.)
ta: EXIF மற்றும் பிற குறிச்சொற்களிலிருந்து சாத்தியமான அனைத்து தகவல்களையும் XMP வடிவத்தில் நகலெடுக்கவா? <br> (இது தேர்ந்தெடுக்கப்பட்ட அனைத்து படங்களுக்கும் ஒரு உள் "ஒரே படத்திற்கு ஒரே படத்திற்கு" நகல்.)

# rmd.toptext
source: What metadata do you want to remove from your selected image(s)?<br>This screen is meant to remove all tags from a certain category from your selected images(s).<br>By writing "Clean empty fields" from the "Edit data" tabs you can clean that metadata specifically.
ta: நீங்கள் தேர்ந்தெடுத்த படத்திலிருந்து (கள்) என்ன மெட்டாடேட்டாவை அகற்ற விரும்புகிறீர்கள்? <br> இந்தத் திரை ஒரு குறிப்பிட்ட வகையிலிருந்து எல்லா குறிச்சொற்களையும் நீங்கள் தேர்ந்தெடுத்த படங்களிலிருந்து (கள்) அகற்றுவதாகும். <br> "தூய்மையான வெற்று புலங்களை" எழுதுவதன் மூலம் "தரவைத் திருத்து" தாவல்கள் அந்த மெட்டாடேட்டாவை குறிப்பாக தூய்மை செய்யலாம்.

# rmd.removeall
source: Remove all metadata
ta: அனைத்து மெட்டாடேட்டாவையும் அகற்று

# rmd.removeexif
source: Remove all Exif data
ta: அனைத்து EXIF ​​தரவையும் அகற்று

# rmd.removexmp
source: Remove all XMP data
ta: அனைத்து எக்ச்எம்பி தரவையும் அகற்று

# rmd.removegps
source: Remove all GPS data
ta: அனைத்து சி.பி.எச் தரவையும் அகற்று

# rmd.removeiptc
source: Remove all IPTC data
ta: அனைத்து ஐபிடிசி தரவையும் அகற்று

# rmd.removeicc
source: Remove all ICC data
ta: அனைத்து ஐ.சி.சி தரவையும் அகற்று

# rmd.removegeotag
source: Remove all Geotagging data
ta: அனைத்து உலகம் தரவுகளையும் அகற்று

# rmd.removegexmp
source: Remove all (only) XMP Geotagging data
ta: அனைத்து (மட்டும்) எக்ச்எம்பி சியோடாகிங் தரவையும் அகற்று

# rmd.youhaveselected
source: You have selected:<br>
ta: நீங்கள் தேர்ந்தெடுத்துள்ளீர்கள்: <br>

# rmd.allmetadata
source: All metadata
ta: அனைத்து மேனிலை தரவு

# rmd.dlgyouwantto
source: You want to remove metadata
ta: நீங்கள் மெட்டாடேட்டாவை அகற்ற விரும்புகிறீர்கள்

# rmd.dlgnooptiontitle
source: No removal option selected
ta: அகற்றும் விருப்பம் எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# rmd.dlgnooptiontext
source: Select an option first.
ta: முதலில் ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்.

# rmd.remcategory
source: Remove category
ta: வகையை அகற்று

# rmd.warning
source: Not all filetypes and not all tags in the several groups are writable. More info here:<br>
ta: எல்லா பைல்டைப்புகளும் அல்ல, பல குழுக்களில் உள்ள அனைத்து குறிச்சொற்களும் எழுதக்கூடியவை அல்ல. மேலும் செய்தி இங்கே: <br>

# rmd.mostused
source: Most used categories
ta: அதிகம் பயன்படுத்தப்படும் பிரிவுகள்

# sdt.dlgtitle
source: Shift Date/Time
ta: சிப்ட் தேதி/நேரம்

# sdt.toptext
source: Sometimes your camera clock is 1-2 hours behind or ahead because you are "suddenly" in another time-zone, or forgot to adjust for summer/winter time. This allows you to shift a bunch of photos, all with the same time shift.
ta: சில நேரங்களில் உங்கள் கேமரா கடிகாரம் 1-2 மணிநேரம் பின்னால் அல்லது அதற்கு முன்னால் இருக்கும், ஏனெனில் நீங்கள் மற்றொரு நேர மண்டலத்தில் "திடீரென்று" இருக்கிறீர்கள், அல்லது கோடை/குளிர்கால நேரத்தை சரிசெய்ய மறந்துவிட்டீர்கள். ஒரே நேரத்தில் மாற்றத்துடன் ஒரு சில புகைப்படங்களை மாற்ற இது உங்களை அனுமதிக்கிறது.

# sdt.shiftdatetimeoriginal
source: Shift exif:DateTimeoriginal
ta: சிப்ட் எக்ச்பிஃப்: தேதி சமநிலை

# sdt.shiftcreatedate
source: Shift exif:CreateDate
ta: சிப்ட் எக்ச்பிஃப்: உருவாக்கப்பட்டது

# sdt.shiftmodifydate
source: Shift exif:ModifyDate
ta: சிப்ட் எக்சிஃப்: மாற்றியமைத்தல்

# sdt.updatexmp
source: Update XMP values too
ta: எக்ச்எம்பி மதிப்புகளையும் புதுப்பிக்கவும்

# sdt.shifttext
source: Shift date and/or time for selected images
ta: தேர்ந்தெடுக்கப்பட்ட படங்களுக்கான சிப்ட் தேதி மற்றும்/அல்லது நேரம்

# sdt.forward
source: Shift forward
ta: முன்னோக்கி மாற்றவும்

# sdt.dlgnoshift
source: No shift value set
ta: சிப்ட் மதிப்பு தொகுப்பு இல்லை

# sdt.dlgshiftzero
source: You left the shift value at "0000:00:00 00:00:00".<br>Nothing to do.
ta: சிப்ட் மதிப்பை "0000: 00: 00 00:00:00" என்ற எண்ணில் விட்டுவிட்டீர்கள். <br> எதுவும் செய்ய எதுவும் இல்லை.

# mdt.title
source: Modify Date/Time
ta: தேதி/நேரத்தை மாற்றவும்

# mdt.toptext
source: This dialog gives you the option to modify the several date/time tags in the Exif (and XMP) info like in the "Edit data → Exif" tab.It works on the selected images.<br>The corresponding XMP values can be updated simultaneously.
ta: இந்த உரையாடல் "தரவு → Exif" தாவலில் உள்ள EXIF ​​(மற்றும் XMP) தகவல்களில் பல தேதி/நேர குறிச்சொற்களை மாற்றுவதற்கான விருப்பத்தை உங்களுக்கு வழங்குகிறது. இது தேர்ந்தெடுக்கப்பட்ட படங்களில் செயல்படுகிறது. <br> தொடர்புடைய எக்ச்எம்பி மதிப்புகள் புதுப்பிக்கப்படலாம் ஒரே நேரத்தில்.

# mdt.modifydate
source: ModifyDate
ta: மாற்றியமைத்தல்

# mdt.createdate
source: CreateDate
ta: உருவாக்கப்பட்டது

# mdt.updatexmp
source: update XMP values too
ta: எக்ச்எம்பி மதிப்புகளையும் புதுப்பிக்கவும்

# madt.title
source: Modify all possible dates/times
ta: சாத்தியமான அனைத்து தேதிகளையும்/நேரங்களையும் மாற்றவும்

# madt.toptext
source: This dialog gives you the option to set a date/time to all possible dates/times tags for every available tag group in an image or video that exiftool can write to.
ta: எக்சிப்டூல் எழுதக்கூடிய ஒரு படம் அல்லது வீடியோவில் கிடைக்கக்கூடிய ஒவ்வொரு குறிச்சொல் குழுவிற்கும் சாத்தியமான அனைத்து தேதிகள்/நேர குறிச்சொற்களுக்கும் ஒரு தேதி/நேரத்தை அமைப்பதற்கான விருப்பத்தை இந்த உரையாடல் உங்களுக்கு வழங்குகிறது.

# madt.newdate
source: New Date/Time
ta: புதிய தேதி/நேரம்

# sfdt.title
source: Set file date/time to DateTimeOriginal?
ta: கோப்பு தேதி/நேரத்தை தேதி சமநிலை வடிவத்திற்கு அமைக்கவா?

# sfdt.text
source: If you have modified your images in a "sloppy" image editor or copied them around or whatever other action(s), the file timestamp of your images might have changed to the date you did the action/modification on the image where as the real file date (timestamp) (= original creation date) of your images is most certainly (much) older.<br>This function will take the original date/time when the photo was taken from the Exif:DateTimeOriginal and use that (again) as file timestamp.<br><br>Continue?
ta: உங்கள் படங்களை "ச்லோப்பி" பட எடிட்டரில் மாற்றியமைத்திருந்தால் அல்லது அவற்றை அல்லது வேறு எந்த செயலையும் (கள்) நகலெடுத்திருந்தால், உங்கள் படங்களின் கோப்பு நேர முத்திரை நீங்கள் படத்தில் செயல்/மாற்றத்தை செய்த தேதிக்கு மாறியிருக்கலாம், அங்கு உண்மையானது உங்கள் படங்களின் கோப்பு தேதி (நேர முத்திரை) (= அசல் படைப்பு தேதி) நிச்சயமாக (அதிகம்) பழையது. கோப்பு நேர முத்திரையாக. <br> <br> தொடரவா?

# rjpg.dialogtitle
source: Repair corrupted metadata in JPG(s)
ta: JPG (கள்) இல் சரிசெய்யப்பட்ட மெட்டாடேட்டாவை சரிசெய்தல்

# rjpg.dialogtext
source: If ExifTool can't write to your photo it might be due to corrupted metadata. ExifTool can fix this but only for the tags that are still readible.<br>In a JPG the image data is separated from the metadata. If your photo can't be displayed in an image viewer, your image data itself is corrupt. ExifTool can't repair that.<br><br>Continue and repair as much metadata as possible?
ta: எக்சிப்டூல் உங்கள் புகைப்படத்திற்கு எழுத முடியாவிட்டால், அது சிதைந்த மேனிலை தரவு காரணமாக இருக்கலாம். எக்சிப்டூல் இதை சரிசெய்ய முடியும், ஆனால் இன்னும் படிக்கக்கூடிய குறிச்சொற்களுக்கு மட்டுமே. <br> ஒரு JPG இல் படத் தரவு மெட்டாடேட்டாவிலிருந்து பிரிக்கப்பட்டுள்ளது. உங்கள் புகைப்படத்தை ஒரு பட பார்வையாளரில் காட்ட முடியாவிட்டால், உங்கள் படத் தரவு ஊழல் நிறைந்ததாக இருக்கும். எக்சிப்டூல் அதை சரிசெய்ய முடியாது. <br> <br> முடிந்தவரை மெட்டாடேட்டாவை தொடரவும் சரிசெய்யவும்?

# args.toptext
source: Which metadata from your selected image(s) do you want to add to your args file(s)?<br>
ta: நீங்கள் தேர்ந்தெடுத்த படத்திலிருந்து (கள்) எந்த மேனிலை தரவு உங்கள் ஆர்க்ச் கோப்பு (கள்) இல் சேர்க்க விரும்புகிறீர்கள்? <br>

# args.all
source: Add all metadata to args file(s)
ta: ஆர்க்ச் கோப்பு (கள்) க்கு அனைத்து மெட்டாடேட்டாவைச் சேர்க்கவும்

# args.exif
source: Add Exif data to args file(s)
ta: ஆர்க்ச் கோப்பு (கள்) க்கு EXIF ​​தரவைச் சேர்க்கவும்

# args.xmp
source: Add XMP data to args file(s)
ta: ஆர்க்ச் கோப்பு (கள்) க்கு எக்ச்எம்பி தரவைச் சேர்க்கவும்

# args.gps
source: Add GPS data to args file(s)
ta: ஆர்க்ச் கோப்பு (கள்) க்கு சி.பி.எச் தரவைச் சேர்க்கவும்

# args.iptc
source: Add IPTC data to args file(s)
ta: ஆர்க்ச் கோப்பு (கள்) இல் ஐபிடிசி தரவைச் சேர்க்கவும்

# args.icc
source: Add ICC data to args file(s)
ta: ஆர்க்ச் கோப்பு (கள்) இல் ஐ.சி.சி தரவைச் சேர்க்கவும்

# args.dlgtext
source: You have selected the following:<br>
ta: நீங்கள் பின்வருவனவற்றைத் தேர்ந்தெடுத்துள்ளீர்கள்: <br>

# args.nothingselected
source: No options selected.
ta: விருப்பங்கள் எதுவும் தேர்ந்தெடுக்கப்படவில்லை.

# args.dlgcorrect
source: Is this correct?
ta: இது சரியானதா?

# ept.dlgtitle
source: Extract previews/thumbnails
ta: முன்னோட்டங்கள்/சிறுபடங்களை பிரித்தெடுக்கவும்

# ept.dlgtext
source: This option will export all preview images and thumbnails from the selected images. This can only be done if your image(s) have them.<br>Continue?
ta: இந்த விருப்பம் தேர்ந்தெடுக்கப்பட்ட படங்களிலிருந்து அனைத்து முன்னோட்டப் படங்களையும் சிறு உருவங்களையும் ஏற்றுமதி செய்யும். உங்கள் படம் (கள்) அவற்றைக் கொண்டிருந்தால் மட்டுமே இதைச் செய்ய முடியும். <br> தொடரவா?

# ept.exporterror
source: Could not create previews
ta: முன்னோட்டங்களை உருவாக்க முடியவில்லை

# stfio.loadimages
source: Load Image(s)… (or select another file filter)
ta: படத்தை (களை) ஏற்றவும்… (அல்லது மற்றொரு கோப்பு வடிப்பானைத் தேர்ந்தெடுக்கவும்)

# stfio.loadfolder
source: Locate the image folder…
ta: படக் கோப்புறையைக் கண்டுபிடி…

# stfio.images
source: (images)
ta: (படங்கள்)

# stfio.audioformats
source: (audio files)
ta: (ஆடியோ கோப்புகள்)

# stfio.videoformats
source: (video files)
ta: (வீடியோ கோப்புகள்)

# stfio.allformats
source: (all supported files)
ta: (அனைத்து ஆதரிக்கப்பட்ட கோப்புகளும்)

# stfio.userdefinedfilter
source: (user-defined file filter)
ta: (பயனர் வரையறுக்கப்பட்ட கோப்பு வடிகட்டி)

# mduc.title
source: User-defined metadata combi-sets
ta: பயனர் வரையறுக்கப்பட்ட மேனிலை தரவு காம்பி-செட்

# mduc.columnlabel
source: Screen label
ta: திரை சிட்டை

# mduc.columntag
source: Metadata tags
ta: மேனிலை தரவு குறிச்சொற்கள்

# mduc.columndefault
source: Default value
ta: இயல்புநிலை மதிப்பு

# mduc.buttonsave
source: Save
ta: சேமி

# mduc.buttonsaveas
source: Save As…
ta: சேமிக்கவும்…

# mduc.buttonclose
source: Close
ta: மூடு

# mduc.buttonhelp
source: Help
ta: உதவி

# mduc.insert
source: Insert Row(s)
ta: வரிசை (களை) செருகவும்

# mduc.delete
source: Delete Row(s)
ta: வரிசையை நீக்கவும் (கள்)

# mduc.inpdlgname
source: Please enter a name for this metadata custom-set and optionally for a config file
ta: இந்த மேனிலை தரவு தனிப்பயன்-தொகுப்பிற்கான பெயரை உள்ளிடவும், விருப்பமாக ஒரு கட்டமைப்பு கோப்புக்கு

# mduc.name
source: Name
ta: பெயர்

# mduc.current
source: Currently defined metadata custom-set(s):
ta: தற்போது வரையறுக்கப்பட்ட மேனிலை தரவு தனிப்பயன்-செட் (கள்):

# mduc.overwrite
source: Overwrite/update the following already existing custom metadata set?
ta: ஏற்கனவே ஏற்கனவே உள்ள தனிப்பயன் மேனிலை தரவு தொகுப்பை மேலெழுதும்/புதுப்பிக்கவா?

# mduc.overwriteconfirm
source: Overwrite/update?
ta: மேலெழுதும்/புதுப்பிக்கவும்?

# mduc.errorupdatetitle
source: Updating failed
ta: புதுப்பித்தல் தோல்வியுற்றது

# mduc.errorupdatetext
source: Could not update your custom metadata-set
ta: உங்கள் தனிப்பயன் மெட்டாடேட்டா-செட்டை புதுப்பிக்க முடியவில்லை

# mduc.saved
source: Saved custom metadata set:
ta: சேமித்த தனிப்பயன் மேனிலை தரவு தொகுப்பு:

# mduc.savedb
source: Saved custom metadata set
ta: சேமிக்கப்பட்ட தனிப்பயன் மேனிலை தரவு தொகுப்பு

# mduc.errorinserttitel
source: Insertion error
ta: செருகும் பிழை

# mduc.errorinserttext
source: Could not insert your custom metadata-set
ta: உங்கள் தனிப்பயன் மெட்டாடேட்டா-செட்டை செருக முடியவில்லை

# mduc.dlgtitle
source: No custom metadata-set name given
ta: தனிப்பயன் மெட்டாடேட்டா-செட் பெயர் கொடுக்கப்படவில்லை

# mduc.dlgtext
source: You did not provide a custom metadata-set name. Nothing to save/update.
ta: தனிப்பயன் மெட்டாடேட்டா-செட் பெயரை நீங்கள் வழங்கவில்லை. சேமிக்க/புதுப்பிக்க எதுவும் இல்லை.

# mduc.incompletetitle
source: Incorrect/incomplete data
ta: தவறான/முழுமையற்ற தரவு

# mduc.incompletetext
source: Populate the mandatory screen_label and/or tag fields.
ta: கட்டாய ச்கிரீன்_லாபெல் மற்றும்/அல்லது குறிச்சொல் புலங்களை விரிவுபடுத்துங்கள்.

# mduc.curdispcombi
source: Currently displayed user combination:
ta: தற்போது காட்டப்படும் பயனர் சேர்க்கை:

# mduc.lblcustconfig
source: Custom config (optional):
ta: தனிப்பயன் கட்டமைப்பு (விரும்பினால்):

# mduc.locconfigfile
source: Locate custom config file…
ta: தனிப்பயன் கட்டமைப்பு கோப்பைக் கண்டறியவும்…

# mduc.locatebutton
source: Select file
ta: கோப்பைத் தேர்ந்தெடு

# mduc.lblconffile
source: Config file:
ta: கட்டமைப்பு கோப்பு:

# mduc.explanation
source: If you want to add custom tags to your images that are not known to ExifTool, you need to provide a custom config file. Select your special config file via the file chooser. This program will then copy it inside your user home folder into the sub-folder "jexftoolgui_data".
ta: Exiftool க்கு அறியப்படாத உங்கள் படங்களுக்கு தனிப்பயன் குறிச்சொற்களைச் சேர்க்க விரும்பினால், நீங்கள் தனிப்பயன் கட்டமைப்பு கோப்பை வழங்க வேண்டும். கோப்பு தேர்வு வழியாக உங்கள் சிறப்பு கட்டமைப்பு கோப்பைத் தேர்ந்தெடுக்கவும். இந்த நிரல் அதை உங்கள் பயனர் வீட்டு கோப்புறையில் துணை நட்பாளர் "செக்ச்ஃப்டூல்சு_டேட்டா" இல் நகலெடுக்கும்.

# mduc.deltitle
source: Delete this metadata set?
ta: இந்த மேனிலை தரவு தொகுப்பை நீக்கவா?

# mduc.deltext
source: Delete this metadata custom-set?
ta: இந்த மேனிலை தரவு தனிப்பயன்-செட்டை நீக்கவா?

# mduc.exptitle
source: Custom metadata-set exported
ta: தனிப்பயன் மெட்டாடேட்டா-செட் ஏற்றுமதி செய்யப்பட்டது

# mduc.exptext
source: Custom metadata-set exported to
ta: தனிப்பயன் மெட்டாடேட்டா-செட் ஏற்றுமதி செய்யப்பட்டது

# mduc.exptextconfig
source: Custom config file exported to
ta: தனிப்பயன் கட்டமைப்பு கோப்பு ஏற்றுமதி செய்யப்பட்டது

# mduc.csvfile
source: CSV file
ta: சி.எச்.வி கோப்பு

# mduc.loccsvfile
source: Locate CSV file for import ...
ta: இறக்குமதிக்கு காபிம கோப்பைக் கண்டுபிடி ...

# esc.xmptitle
source: export XMP Sidecar file(s)
ta: எக்ச்எம்பி சைட்கார் கோப்பு (கள்) ஏற்றுமதி செய்யுங்கள்

# esc.xmptext
source: This option allows you to export an XMP sidecar with all tags or only XMP tags
ta: இந்த விருப்பம் அனைத்து குறிச்சொற்கள் அல்லது எக்ச்எம்பி குறிச்சொற்களுடன் ஒரு எக்ச்எம்பி பக்கவாட்டு ஏற்றுமதி செய்ய உங்களை அனுமதிக்கிறது

# esc.all
source: All tags
ta: அனைத்து குறிச்சொற்களும்

# esc.xmp
source: XMP only
ta: எக்ச்எம்பி மட்டும்

# esc.exiftitle
source: Export Exif Sidecar file(s)
ta: ஏற்றுமதி எக்சிஃப் சைட்கார் கோப்பு (கள்)

# esc.exiftext
source: Exif files store Exif info in the same TIFF-based format as the EXIF APP1-segment of a JPEG image, but without the "Exif00" header.
ta: EXIF கோப்புகள் Exif தகவலை ஒரு JPEG படத்தின் EXIF ​​APP1- பிரிவு போன்ற அதே TIFF- அடிப்படையிலான வடிவத்தில் சேமிக்கின்றன, ஆனால் "Exif00" தலைப்பு இல்லாமல்.

# esc.mietitle
source: Export MIE sidecar file(s)
ta: மை sidecar கோப்பு (கள்) ஏற்றுமதி செய்யுங்கள்

# esc.mietext
source: The MIE file format allows storage of native binary meta info, and is the best option for saving metadata from a file in its original format.
ta: மை கோப்பு வடிவம் சொந்த பைனரி மேவு தகவலை சேமிக்க அனுமதிக்கிறது, மேலும் மெட்டாடேட்டாவை ஒரு கோப்பிலிருந்து அதன் அசல் வடிவத்தில் சேமிப்பதற்கான சிறந்த வழி இது.

# esc.exvtitle
source: export EXV Sidecar file(s)
ta: exv பக்கவாட்டு கோப்பு (கள்) ஏற்றுமதி செய்யுங்கள்

# esc.exvtext
source: EXV files are used by Exiv2, and are basically JPG-files without the image data, so they may be used as a metadata file to contain any info supported by the JPG format (EXIF, XMP, IPTC, etc.)
ta: EXV கோப்புகள் EXIV2 ஆல் பயன்படுத்தப்படுகின்றன, மேலும் அவை அடிப்படையில் படத் தரவு இல்லாமல் JPG- கோப்புகள், எனவே அவை JPG வடிவத்தால் ஆதரிக்கப்படும் எந்த தகவலையும் கொண்டிருக்க மேனிலை தரவு கோப்பாக பயன்படுத்தப்படலாம் (EXIF, XMP, IPTC, முதலியன)

# esc.fintitle
source: Sidecar export finished.
ta: சைட்கார் ஏற்றுமதி முடிந்தது.

# esc.fintext
source: The Sidecar export has finished. Your exported Sidecar files are in the same folder as your images.
ta: சைட்கார் ஏற்றுமதி முடிந்தது. உங்கள் ஏற்றுமதி செய்யப்பட்ட பக்கவாட்டு கோப்புகள் உங்கள் படங்களின் அதே கோப்புறையில் உள்ளன.

# fav.selecttitle
source: Select an existing favorite to load it.
ta: அதை ஏற்ற ஏற்கனவே பிடித்த விருப்பத்தைத் தேர்ந்தெடுக்கவும்.

# fav.cursavedfavs
source: Current saved favorite(s):
ta: தற்போதைய சேமிக்கப்பட்ட பிடித்த (கள்):

# fav.type
source: Favorite type
ta: பிடித்த வகை

# fav.name
source: Name
ta: பெயர்

# fav.descr
source: Description
ta: விவரம்

# fav.selfordel
source: Select a favorite for deletion
ta: நீக்குவதற்கு பிடித்ததைத் தேர்ந்தெடுக்கவும்

# fav.inserterrshort
source: insert error
ta: பிழையைச் செருகவும்

# fav.inserterror
source: Encountered an error adding your favorite:
ta: உங்களுக்கு பிடித்ததைச் சேர்ப்பதில் பிழையை எதிர்கொண்டது:

# fav.nofavnameshort
source: no favorite name given
ta: பிடித்த பெயர் எதுவும் கொடுக்கப்படவில்லை

# fav.nofavname
source: You did not provide a favorite name. Nothing to save/update.
ta: நீங்கள் பிடித்த பெயரை வழங்கவில்லை. சேமிக்க/புதுப்பிக்க எதுவும் இல்லை.

# fav.updateerrshort
source: Updating error
ta: புதுப்பித்தல் பிழை

# fav.updateerror
source: Could not update your favorite
ta: உங்களுக்கு பிடித்ததைப் புதுப்பிக்க முடியவில்லை

# fav.delerrorshort
source: Deletion error
ta: நீக்குதல் பிழை

# fav.delerror
source: Could not delete your favorite
ta: உங்களுக்கு பிடித்ததை நீக்க முடியவில்லை

# fav.deletedshort
source: Favorite deleted
ta: பிடித்த நீக்கப்பட்டது

# fav.deleted
source: The following favorite is deleted:
ta: பின்வரும் பிடித்தது நீக்கப்பட்டது:

# fav.commandtext
source: Please enter a name for this ExifTool command.
ta: இந்த Exiftool கட்டளைக்கு ஒரு பெயரை உள்ளிடவும்.

# fav.querytext
source: Please enter a name for this database query.
ta: இந்த தரவுத்தள வினவலுக்கு ஒரு பெயரை உள்ளிடவும்.

# fav.overwrite
source: Overwrite/update the already existing favorite:
ta: ஏற்கனவே இருக்கும் விருப்பத்தை மேலெழுதும்/புதுப்பிக்கவும்:

# fav.overwriteshort
source: Overwrite/update?
ta: மேலெழுதும்/புதுப்பிக்கவும்?

# fav.savedshort
source: Favorite saved.
ta: பிடித்த சேமிப்பு.

# fav.saved
source: The following favorite has been saved:
ta: பின்வரும் பிடித்தவை சேமிக்கப்பட்டுள்ளன:

# addlens.toptxt
source: Please enter a lens name for this config and optionally a description.<br>Or select a row from the table to copy it in the text fields to update an existing lens configuration.
ta: தயவுசெய்து இந்த கட்டமைப்பிற்கான லென்ச் பெயரை உள்ளிடவும், விருப்பமாக ஒரு விளக்கத்தை உள்ளிடவும். <br> அல்லது ஏற்கனவே உள்ள லென்ச் உள்ளமைவைப் புதுப்பிக்க உரை புலங்களில் நகலெடுக்க அட்டவணையில் இருந்து ஒரு வரிசையைத் தேர்ந்தெடுக்கவும்.

# addlens.overwriteshort
source: Overwrite/update?
ta: மேலெழுதும்/புதுப்பிக்கவும்?

# addlens.overwrite
source: Overwrite/update the already existing lens configuration:
ta: ஏற்கனவே இருக்கும் லென்ச் உள்ளமைவை மேலெழுதும்/புதுப்பிக்கவும்:

# addlens.inserterrorshort
source: Insertion error
ta: செருகும் பிழை

# addlens.inserterror
source: Could not add your lens:
ta: உங்கள் லென்சைச் சேர்க்க முடியவில்லை:

# addlens.updateerrorshort
source: Updating error
ta: புதுப்பித்தல் பிழை

# addlens.updateerror
source: Could not update your lens:
ta: உங்கள் லென்சைப் புதுப்பிக்க முடியவில்லை:

# addlens.savedshort
source: Lens saved
ta: லென்ச் சேமிக்கப்பட்டது

# addlens.saved
source: The following lens was saved:
ta: பின்வரும் லென்ச் சேமிக்கப்பட்டது:

# addlens.nonameshort
source: No lens name provided
ta: லென்ச் பெயர் எதுவும் வழங்கப்படவில்லை

# addlens.noname
source: Enter a lens name if you want to save it.
ta: நீங்கள் சேமிக்க விரும்பினால் லென்ச் பெயரை உள்ளிடவும்.

# sellens.loadlenstxt
source: Select a row from the table to select and load an existing lens configuration.
ta: ஏற்கனவே உள்ள லென்ச் உள்ளமைவைத் தேர்ந்தெடுத்து ஏற்ற அட்டவணையில் இருந்து ஒரு வரிசையைத் தேர்ந்தெடுக்கவும்.

# sellens.deletelenstxt
source: Select a lens from the table for deletion.
ta: நீக்க அட்டவணையில் இருந்து ஒரு லென்சைத் தேர்ந்தெடுக்கவும்.

# sellens.currentlenses
source: Current defined lens(es):
ta: தற்போதைய வரையறுக்கப்பட்ட லென்ச் (எச்):

# sellens.name
source: Name
ta: பெயர்

# sellens.descr
source: Description
ta: விவரம்

# selllens.delerror
source: Could not delete your lens
ta: உங்கள் லென்சை நீக்க முடியவில்லை

# sellens.deletedshort
source: Lens deleted
ta: லென்ச் நீக்கப்பட்டது

# sellens.deleted
source: The following lens was deleted:
ta: பின்வரும் லென்ச் நீக்கப்பட்டது:

# exppdf.toptext
source: From this tab you can<br> export a PDF per image with selected metadata,<br> or all images with their metadata in one document
ta: இந்த தாவலில் இருந்து நீங்கள் தேர்ந்தெடுக்கப்பட்ட மேனிலை தரவு, <br> அல்லது ஒரு ஆவணத்தில் மெட்டாடேட்டாவுடன் அனைத்து படங்களுக்கும் ஒரு படத்திற்கு ஒரு PDF ஐ ஏற்றுமதி செய்யலாம்

# exppdf.supp
source: JPG, PNG, GIF, BMP, TIF(F) is directly supported. RAW needs a conversion step maybe resulting in a low quality image. MP4 is only supported if it supports previews/thumbnails.
ta: JPG, PNG, GIF, BMP, TIF (F) நேரடியாக ஆதரிக்கப்படுகிறது. ராவுக்கு ஒரு மாற்று படி தேவை, இதன் விளைவாக குறைந்த தரமான படத்தை ஏற்படுத்தும். MP4 முன்னோட்டங்கள்/சிறுபடங்களை ஆதரித்தால் மட்டுமே ஆதரிக்கப்படுகிறது.

# exppdf.paper
source: Paper format:
ta: காகித வடிவம்:

# exppdf.a4
source: A4
ta: இளஞ்சிவப்பு

# exppdf.letter
source: Letter
ta: கடிதம்

# exppdf.output
source: Output:
ta: வெளியீடு:

# exppdf.single
source: One document per image
ta: ஒரு படத்திற்கு ஒரு ஆவணம்

# exppdf.combined
source: One combined document
ta: ஒரு ஒருங்கிணைந்த ஆவணம்

# exppdf.whichdata
source: Data to be exported:
ta: ஏற்றுமதி செய்ய வேண்டிய தரவு:

# exppdf.name
source: Filename
ta: கோப்புப்பெயர்

# exppdf.path
source: File path
ta: கோப்பு பாதை

# exppdf.image
source: Image
ta: படம்

# exppdf.metadata
source: Metadata belonging to
ta: மேனிலை தரவு சொந்தமானது

# exppdf.pdfscreated
source: Created PDF documents
ta: PDF ஆவணங்களை உருவாக்கியது

# cmpimg.comparetitle
source: Compare images…
ta: படங்களை ஒப்பிடுக…

# cmpimg.exptopdf
source: Export to PDF
ta: PDF க்கு ஏற்றுமதி

# cmpimg.exptocsv
source: Export to CSV
ta: காபிம க்கு ஏற்றுமதி

# cmpimg.csvscreated
source: Created CSV files
ta: காபிம கோப்புகளை உருவாக்கியது

# cmpimg.rbtnfilepimg
source: One CSV file per image
ta: ஒரு படத்திற்கு ஒரு காபிம கோப்பு

# cmpimg.rbtncombined
source: One combined CSV for all images
ta: அனைத்து படங்களுக்கும் ஒரு சி.எச்.வி.

# sys.title
source: System and Program Info
ta: கணினி மற்றும் நிரல் செய்தி

# sys.os
source: Operating system:
ta: இயக்க முறைமை:

# sys.osarch
source: Operating system architecture:
ta: இயக்க முறைமை கட்டமைப்பு:

# sys.osv
source: Operating system version:
ta: இயக்க முறைமை பதிப்பு:

# sys.uhome
source: User home directory:
ta: பயனர் வீட்டு அடைவு:

# sys.jtgv
source: jExifToolGUI version:
ta: jexiftoolgui பதிப்பு:

# sys.ev
source: ExifTool version:
ta: Exiftool பதிப்பு:

# sys.jv
source: Java version:
ta: சாவா பதிப்பு:

# sys.jhome
source: Java home:
ta: சாவா வீடு:

# mpv.title
source: Find coordinates for your location
ta: உங்கள் இருப்பிடத்திற்கான ஒருங்கிணைப்புகளைக் கண்டறியவும்

# mpv.hints
source: Left mouse button: pan, mouse wheel: zoom in/out, right mouse button: add marker and get coordinates
ta: இடது மவுச் பொத்தான்: பான், மவுச் சக்கரம்: பெரிதாக்குதல்/வெளியே, வலது சுட்டி பொத்தான்: மார்க்கரைச் சேர்த்து ஆயத்தொலைவுகளைப் பெறுங்கள்

# mpv.searchlbl
source: Search Location/Place
ta: இடம்/இடத்தைத் தேடுங்கள்

# mpv.tooltip
source: <HTML>Eiffel tower OR<br>Downingstreet 10 OR<br>Brandenburger Tor OR<br>Pennsylvania Avenue Northwest 1600 OR<br>Iguazu Falls
ta: இப்போது

# mpv.searchbtn
source: Search
ta: தேடல்

# mpv.name
source: Name
ta: பெயர்

# mpv.location
source: Location:
ta: இடம்:
