Repository: 247i/TACETr
Catalog: உரை/தானி/jexiftoolgui-program_strings-*.po
Languages: ta

# gpano.initialviewpitchdegrees
source: Initial View Pitch Degrees
ta: ஆரம்ப பார்வை சுருதி டிகிரி

# gpano.initialviewrolldegrees
source: Initial View Roll Degrees
ta: ஆரம்ப பார்வை ரோல் டிகிரிகள்

# gpano.initialhorizontalfovdegrees
source: Initial Horizontal FOV Degrees
ta: ஆரம்ப கிடைமட்ட FOV டிகிரி

# gpano.mandatoryfilestitle
source: Not all mandatory fields complete
ta: அனைத்து கட்டாய புலங்களும் நிறைவடையவில்லை

# gpano.mandatoryfilestxt
source: At least one of the mandatory fields is not complete. Please complete the missing mandatory data.<br><br>The program can't continue without it.
ta: கட்டாய புலங்களில் ஒன்று முழுமையடையவில்லை. காணாமல் போன கட்டாய தரவை தயவுசெய்து முடிக்கவும். <br> <br> நிரல் இல்லாமல் தொடர முடியாது.

# gpano.savecheckboxestitle
source: Set Save checkboxes
ta: சேமிப்பகங்களை சேமிக்கவும்

# gpano.savecheckboxestxt
source: Do not forget to set the "Save" checkboxes upon saving, when relevant.
ta: பொருத்தமானதாக இருக்கும்போது, ​​சேமித்தவுடன் "சேமி" தேர்வுப்பெட்டிகளை அமைக்க மறக்காதீர்கள்.

# lens.lensmake
source: Lens make
ta: லென்ச் செய்யுங்கள்

# lens.lensmodel
source: Lens model
ta: லென்ச் மாதிரி

source: Lens serial-number
ta: லென்ச் சீரியல் எண்

# lens.focallength
source: Focal length
ta: குவிநீளம், குவியத் தொலைவு

# lens.focallength35mm
source: Equivalent 35 mm focal length
ta: சமமான 35 மிமீ குவிய நீளம்

# lens.fnumber
source: F-number
ta: எஃப்-எண்

# lens.maxaperturevalue
source: max. aperture value
ta: அதிகபட்சம். துளை மதிப்பு

# lens.meteringmode
source: Metering mode
ta: அளவீட்டு முறை

# lens.focusdistance
source: Focus distance
ta: கவனம் தூரம்

# lens.lensid
source: Lens ID
ta: லென்ச் ஐடி

# lens.conversionlens
source: Conversion lens
ta: மாற்று லென்ச்

# lens.lenstype
source: Lens type
ta: லென்ச் வகை

# lens.firmwarevers
source: Lens firmware version
ta: லென்ச் ஃபார்ம்வேர் பதிப்பு

# lens.saveloadconfig
source: The two buttons below lets you set up one or more of your lenses and save it/them for<br>later use. When saving a lens the "Save" checkboxes are not used. All values in fields will be saved regardless<br>of having entered data or not.
ta: கீழேயுள்ள இரண்டு பொத்தான்கள் உங்கள் லென்ச்கள் ஒன்று அல்லது அதற்கு மேற்பட்டவற்றை அமைத்து/அவற்றைச் சேமிக்கவும் <br> பின்னர் பயன்படுத்தவும். லென்சை சேமிக்கும்போது "சேமி" தேர்வுப்பெட்டிகள் பயன்படுத்தப்படாது. புலங்களில் உள்ள அனைத்து மதிப்புகளும் தரவை உள்ளிட்டுள்ளதா இல்லையா என்பதைப் பொருட்படுத்தாமல் சேமிக்கப்படும்.

# lens.btnconfigsave
source: Save this lens config
ta: இந்த லென்ச் கட்டமைப்பைச் சேமிக்கவும்

# lens.btnconfigload
source: Load a lens config
ta: லென்ச் கட்டமைப்பை ஏற்றவும்

# xis.toptext
source: This tab (currently) combines several XMP and one IPTC String+ tags. String+ tags can contain multiple strings. Multiple Keywords/Subjects/Persons in those fields need to be separated by the "separator". The program will separate them in multiple strings upon writing to the file.<br>Note: The XMP keywords in this tab are the xmp-acdsee keywords.<br><br>You can also choose the write option for the specific string+ when writing them to your files.<br>Note: When choosing to append, only specify the new value and do not include the keywords/subjects/persons already in your file as they will be appended again.
ta: இந்த தாவல் (தற்போது) பல எக்ச்எம்பி மற்றும் ஒரு ஐபிடிசி சரம்+ குறிச்சொற்களை ஒருங்கிணைக்கிறது. சரம்+ குறிச்சொற்களில் பல சரங்கள் இருக்கலாம். அந்த துறைகளில் உள்ள பல முக்கிய சொற்கள்/பாடங்கள்/நபர்கள் "பிரிப்பான்" மூலம் பிரிக்கப்பட வேண்டும். நிரல் கோப்புக்கு எழுதும்போது அவற்றை பல சரங்களில் பிரிக்கும். <br> குறிப்பு: இந்த தாவலில் உள்ள எக்ச்எம்பி முக்கிய வார்த்தைகள் எக்ச்எம்பி-அக்ட்சீ முக்கிய வார்த்தைகள். <br> <br> குறிப்பிட்ட சரம்+ க்கான எழுதும் விருப்பத்தையும் நீங்கள் தேர்வு செய்யலாம் உங்கள் கோப்புகளுக்கு அவற்றை எழுதுதல். <br> குறிப்பு: சேர்க்கத் தேர்ந்தெடுக்கும்போது, ​​புதிய மதிப்பை மட்டுமே குறிப்பிடவும், உங்கள் கோப்பில் ஏற்கனவே உள்ள முக்கிய வார்த்தைகள்/பாடங்கள்/நபர்கள் மீண்டும் சேர்க்கப்படுவார்கள்.

# xis.separator
source: Separator:
ta: பிரிப்பான்:

# xis.separatortext
source: <b>Separator:</b> The standard separator is ",". If your string contains commas, you might want to use another separator. Be careful with special characters like "^" and "$" and with the "|" sign as it is used internally by ExifTool.<br>
ta: <b> பிரிப்பான்: </b> நிலையான பிரிப்பான் ",". உங்கள் சரத்தில் காற்புள்ளிகள் இருந்தால், நீங்கள் மற்றொரு பிரிப்பானைப் பயன்படுத்த விரும்பலாம். "^" மற்றும் "$" போன்ற சிறப்பு எழுத்துக்களுடன் கவனமாக இருங்கள் மற்றும் "| Exiftool ஆல் உள்நாட்டில் பயன்படுத்தப்படுவதால் கையொப்பமிடுங்கள். <br>

# xis.keywords
source: Keywords
ta: முக்கிய வார்த்தைகள்

# xis.subject
source: Subject
ta: பொருள்

# xis.pim
source: Person(s) In Image
ta: படத்தில் நபர் (கள்)

# xis.onlyxmp
source: (Only XMP)
ta: (எக்ச்எம்பி மட்டுமே)

# xis.action
source: Action
ta: செயல்

# xis.overwrite
source: Overwrite
ta: மேலெழுதும்

# xis.append
source: Append
ta: பிற்சேர்

# xis.remove
source: Remove
ta: அகற்று

# xis.dontsave
source: Don't save
ta: சேமிக்க வேண்டாம்

# xis.sepcomma
source: comma (,)
ta: கமா (,)

# xis.sepcolon
source: colon (:)
ta: பெருங்குடல் (:)

# xis.sepsemicolon
source: semicolon (;)
ta: அரைப்புள்ளி (;)

# xis.sephash
source: hash sign (#)
ta: ஆச் அடையாளம் (#)

# xis.sepother
source: other:
ta: மற்றவை:

# copyd.copyallmetadatasame
source: Copy the values of all writable tags from the source image to the target image(s), writing the info to same-named tags in the preferred groups
ta: மூல படத்திலிருந்து இலக்கு படம் (கள்) க்கு அனைத்து எழுதக்கூடிய குறிச்சொற்களின் மதிப்புகளையும் நகலெடுத்து, விருப்பமான குழுக்களில் ஒரே பெயரிடப்பட்ட குறிச்சொற்களுக்கு தகவலை எழுதுங்கள்

# copyd.copyallsamegroup
source: Copy the values of all writable tags from the source image to the target image(s), preserving the original tag groups.
ta: மூல படத்திலிருந்து இலக்கு படத்திலிருந்து (கள்) அனைத்து எழுதக்கூடிய குறிச்சொற்களின் மதிப்புகளையும் நகலெடுத்து, அசல் குறிச்சொல் குழுக்களைப் பாதுகாக்கிறது.

# copyd.copyallmetadatatoxmpformat
source: Copy all metadata to XMP format
ta: அனைத்து மெட்டாடேட்டாவையும் எக்ச்எம்பி வடிவத்திற்கு நகலெடுக்கவும்

# copyd.copybyselection
source: Copy metadata using the selective group options mentioned below.
ta: கீழே குறிப்பிடப்பட்டுள்ள தேர்ந்தெடுக்கப்பட்ட குழு விருப்பங்களைப் பயன்படுத்தி மெட்டாடேட்டாவை நகலெடுக்கவும்.

# copyd.copyexifcheckbox
source: Copy Exif data (-exif:all)
ta: Exif தரவை நகலெடுக்கவும் (-exif: அனைத்தும்)

# copyd.copyxmpcheckbox
source: Copy XMP data (-xmp:all)
ta: எக்ச்எம்பி தரவை நகலெடுக்கவும் (-xmp: அனைத்தும்)

# copyd.copyiptccheckbox
source: Copy IPTC data (-iptc:all)
ta: ஐபிடிசி தரவை நகலெடுக்கவும் (-ஐபிடிசி: அனைத்தும்)

# copyd.copyicc_profilecheckbox
source: Copy ICC profile (-icc_profile:all)
ta: ஐ.சி.சி சுயவிவரத்தை நகலெடுக்கவும் (-icc_profile: அனைத்தும்)

# copyd.copygpscheckbox
source: Copy GPS data (-gps:all)
ta: சி.பி.எச் தரவை நகலெடுக்கவும் (-சிபிஎச்: அனைத்தும்)

# copyd.copyjfifcheckbox
source: Copy JFIF data (from the JPG JFIF header)
ta: JFIF தரவை நகலெடுக்கவும் (JPG JFIF தலைப்பிலிருந்து)

# copyd.copymakernotescheckbox
source: Copy makernotes (-makernotes:all)
ta: மேக்கர்னோட்டுகளை நகலெடுக்கவும் (-மேக்கர்நொட்ச்: அனைத்தும்)

# copyd.dlgtitle
source: You want to copy metadata
ta: நீங்கள் மெட்டாடேட்டாவை நகலெடுக்க விரும்புகிறீர்கள்

# copyd.dlgyouhaveselected
source: You have selected:<br>
ta: நீங்கள் தேர்ந்தெடுத்துள்ளீர்கள்: <br>

# copyd.dlgisthiscorrect
source: Is this correct?
ta: இது சரியானதா?

# copyd.alltopreferred
source: All metadata writing info to same named tags to preferred groups
ta: விருப்பமான குழுக்களுக்கு பெயரிடப்பட்ட குறிச்சொற்களுக்கு அனைத்து மேனிலை தரவு எழுதும் தகவல்களும்

# copyd.alltoorggroup
source: All metadata preserving the original tag groups
ta: அசல் குறிச்சொல் குழுக்களை பாதுகாக்கும் அனைத்து மேனிலை தரவு

# copyd.fromgrouptogroup
source: Copy tags from one group to other group where possible
ta: குறிச்சொற்களை ஒரு குழுவிலிருந்து மற்ற குழுவிற்கு முடிந்தவரை நகலெடுக்கவும்

# copyd.tagstoxmp
source: To XMP:
ta: XMP க்கு:

# copyd.tagstoexif
source: To Exif:
ta: Exif க்கு:

# copyd.tagstoiptc
source: To IPTC:
ta: ஐபிடிசிக்கு:

# copyd.tagstogps
source: To GPS:
ta: சி.ஐ.எச்:

# copyd.tagstopdf
source: To PDF:
ta: PDF க்கு:

# copyd.nooptionsselectedtitle
source: No copy option selected
ta: நகல் விருப்பம் எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# copyd.nooptionsselectedtxt
source: You did not select one single option. Cancel would have been the correct option. The program will not do anything.
ta: நீங்கள் ஒரு ஒற்றை விருப்பத்தைத் தேர்ந்தெடுக்கவில்லை. ரத்துசெய் சரியான விருப்பமாக இருந்திருக்கும். நிரல் எதுவும் செய்யாது.

# yc.toptext
source: On this tab you can define your own parameters to "send to" ExifTool. The parameters will be executed on the images you have selected on the left.<br>You can both specify read parameters as well as write parameters. You can also combine several parameters.<br><b>Note:</b> Don't provide the ExifTool command itself, as the GUI takes care of that.
ta: இந்த தாவலில் உங்கள் சொந்த அளவுருக்களை "அனுப்ப" எக்சிப்டூலுக்கு வரையறுக்கலாம். நீங்கள் இடதுபுறத்தில் தேர்ந்தெடுத்த படங்களில் அளவுருக்கள் செயல்படுத்தப்படும். <br> நீங்கள் இரண்டும் வாசிப்பு அளவுருக்களையும் எழுதும் அளவுருக்களையும் குறிப்பிடலாம். நீங்கள் பல அளவுருக்களையும் இணைக்கலாம். <br> <b> குறிப்பு: </b> GUI அதை கவனித்துக்கொள்வதால், Exiftool கட்டளையை வழங்க வேண்டாம்.

# yc.parameters
source: Parameters:
ta: அளவுருக்கள்:

# yc.btnclrparamfield
source: Clear parameter(s) field
ta: தெளிவான அளவுரு (கள்) புலம்

# yc.btnclroutput
source: Clear output field
ta: வெளியீட்டு புலத்தை அழிக்கவும்

# yc.btngo
source: Go
ta: போ

# yc.btnaddfav
source: Add favorite
ta: பிடித்ததைச் சேர்க்கவும்

# yc.btnloadfav
source: Load favorite
ta: பிடித்ததை ஏற்றவும்

# yc.radbtnmonospace
source: Use a non-proportional "monospaced" font
ta: விகிதாசாரமற்ற "மோனோச்பேச்" எழுத்துருவைப் பயன்படுத்தவும்

# yc.radbtnproportional
source: Use a proportional font
ta: விகிதாசார எழுத்துருவைப் பயன்படுத்தவும்

# yc.labeloutput
source: The final output will be displayed below:
ta: இறுதி வெளியீடு கீழே காட்டப்படும்:

# edb.toptext
source: This screen gives you the option to query the built-in ExifTool "groups and tags" database. You can query by selecting values from the drop-downs or by issueing a direct SQL query.<br>Note: This shows what available tags (tagnames) that ExifTool knows. This tab doesn't do anything with your images.
ta: உள்ளமைக்கப்பட்ட எக்சிப்டூல் "குழுக்கள் மற்றும் குறிச்சொற்கள்" தரவுத்தளத்தை வினவுவதற்கான விருப்பத்தை இந்த திரை உங்களுக்கு வழங்குகிறது. கீழ்தோன்றல்களிலிருந்து மதிப்புகளைத் தேர்ந்தெடுப்பதன் மூலமோ அல்லது நேரடி கவிமொ வினவலை வெளியிடுவதன் மூலமோ நீங்கள் வினவலாம். இந்த தாவல் உங்கள் படங்களுடன் எதுவும் செய்யாது.

# edb.wheretaglike
source: Where tag like:
ta: எங்கு குறிச்சொல்:

# edb.btnsearchlike
source: Search like
ta: தேடுங்கள்

# edb.ownquery
source: Your own query:
ta: உங்கள் சொந்த வினவல்:

# udc.toptext
source: This tab gives you the option to use your own defined combination of tags that you wish to write to your images. <br>Logic: if changed => save; if made empty => save empty tag.
ta: உங்கள் படங்களுக்கு நீங்கள் எழுத விரும்பும் குறிச்சொற்களின் சொந்த வரையறுக்கப்பட்ட கலவையைப் பயன்படுத்துவதற்கான விருப்பத்தை இந்த தாவல் உங்களுக்கு வழங்குகிறது. <br> தர்க்கம்: மாற்றப்பட்டால் => சேமி; வெற்று செய்தால் => வெற்று குறிச்சொல்லைச் சேமிக்கவும்.

# udc.sets
source: Your defined sets:
ta: உங்கள் வரையறுக்கப்பட்ட தொகுப்புகள்:

# udc.crbutton
source: Create new combination
ta: புதிய கலவையை உருவாக்கவும்

# udc.thisset
source: This set is using custom config file:
ta: இந்த தொகுப்பு தனிப்பயன் கட்டமைப்பு கோப்பைப் பயன்படுத்துகிறது:

# prefs.generaltab
source: General
ta: பொது

# prefs.languagetab
source: Language
ta: மொழி

# prefs.lookandfeeltab
source: Appearance and function
ta: தோற்றம் மற்றும் செயல்பாடு

# prefs.system
source: System
ta: மண்டலம்

# prefs.btnchoose
source: Choose
ta: தேர்வு

# prefs.exiftoolocation
source: ExifTool location:
ta: Exiftool இடம்:

# prefs.defaultimgstartdir
source: Default image start-directory:
ta: இயல்புநிலை படம் தொடக்க-அடைவு:

# prefs.alwaysuselastfolder
source: Always use the last opened folder
ta: கடைசியாக திறக்கப்பட்ட கோப்புறையை எப்போதும் பயன்படுத்தவும்

# prefs.metdatadisplaylang
source: Language to use to display metadata tag names/descriptions
ta: மேனிலை தரவு குறிச்சொல் பெயர்கள்/விளக்கங்களைக் காண்பிக்க பயன்படுத்த வேண்டிய மொழி

# prefs.rawviewerlocation
source: RAW viewer location (if installed):
ta: மூல பார்வையாளர் இருப்பிடம் (நிறுவப்பட்டால்):

# prefs.alwaysuserawviewer
source: Use the RAW viewer also for non-RAW images
ta: ரா அல்லாத படங்களுக்கும் மூல பார்வையாளரைப் பயன்படுத்தவும்

# prefs.macosrawremark
source: <html>macOS always overrules the "Use the RAW viewer also for non-RAW images" and launches<br>their own Preview.app next to the RAW viewer.</html>
ta: <HTML> MACOS எப்போதும் "RAW அல்லாத படங்களுக்கும் மூல பார்வையாளரைப் பயன்படுத்துங்கள்" மற்றும் <br> மூல பார்வையாளருக்கு அடுத்ததாக அவற்றின் சொந்த முன்னோட்டம். </html> ஐத் தொடங்குகிறது.

# prefs.alwaysaddvals
source: Values to always add to your images
ta: உங்கள் படங்களில் எப்போதும் சேர்க்க மதிப்புகள்

# prefs.artist
source: Creator (xmp-dc:creator, iptc:by-line, exif:artist)
ta: உருவாக்கியவர் (எக்ச்எம்பி-டி.சி: படைப்பாளி, ஐபிடிசி: பை-லைன், எக்சிஃப்: கலைஞர்)

# prefs.copyright
source: Copyrights/Rights (xmp-dc:rights, iptc:copyrightnotice, exif:copyright)
ta: பதிப்புரிமை/உரிமைகள் (எக்ச்எம்பி-டிசி: உரிமைகள், ஐபிடிசி: பதிப்புரிமை, exif: பதிப்புரிமை)

# prefs.credits
source: Credits (xmp-photoshop:credits, iptc:credit)
ta: வரவு (எக்ச்எம்பி-ஃபோட்டோசாப்: வரவு, ஐபிடிசி: கடன்)

# prefs.checknewversion
source: Check for new jExifToolGUI version when starting the program
ta: நிரலைத் தொடங்கும்போது புதிய jexiftoolgui பதிப்பைச் சரிபார்க்கவும்

# prefs.chkboxrawtitle
source: No RAW viewer selected
ta: மூல பார்வையாளர் எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# prefs.chkboxrawtext
source: You can't set this as your default viewer without setting up a RAW viewer first.
ta: முதலில் ஒரு மூல பார்வையாளரை அமைக்காமல் இதை உங்கள் இயல்புநிலை பார்வையாளராக அமைக்க முடியாது.

# prefs.etlocatecanceltitle
source: Cancelled locating ExifTool
ta: ரத்துசெய்யப்பட்ட இடம் எக்சிப்டூல்

# prefs.etlocatecanceltext
source: You cancelled providing the location of ExifTool.<br>The current preference will be left as is.
ta: எக்சிப்டூலின் இருப்பிடத்தை வழங்குவதை நீங்கள் ரத்து செய்தீர்கள். <br> தற்போதைய விருப்பம் இருக்கும்.

# prefs.etwrongtitle
source: Wrong executable
ta: தவறான இயங்கக்கூடியது

# prefs.etwrongtext
source: This is not the ExifTool executable/binary.<br>It can not be used, and jExifToolGUI will exit.
ta: இது Exiftool இயங்கக்கூடிய/பைனரி அல்ல. <br> இதைப் பயன்படுத்த முடியாது, மற்றும் jexiftoolgui வெளியேறும்.

# prefs.locateprefimgfolder
source: Locate preferred default image folder…
ta: விருப்பமான இயல்புநிலை படக் கோப்புறையைக் கண்டறியவும்…

# prefs.locaterawviewer
source: Locate your preferred RAW image viewer…
ta: உங்களுக்கு விருப்பமான மூல பட பார்வையாளரைக் கண்டுபிடி…

# prefs.settingssaved
source: Settings saved
ta: அமைப்புகள் சேமிக்கப்பட்டன

# prefs.applanguage
source: Preferred program language (requires restarting the program)
ta: விருப்பமான நிரல் மொழி (நிரலை மறுதொடக்கம் செய்ய வேண்டும்)

# prefs.whichdialog
source: Preferred file dialog
ta: விருப்பமான கோப்பு உரையாடல்

# prefs.awtdialog
source: AWT-file dialog
ta: AWT-FILE உரையாடல்

# prefs.jfilechooser
source: JFilechooser (default)
ta: Jfilechooser (இயல்புநிலை)

# prefs.dialogexplained
source: The JFileChooser is a far more flexible file dialog allowing "on the fly" file filters, like "images", "audio formats", "video formats", etc. but looks a bit simple (and ugly to some).<br>The AWT file-dialog looks more like a native operating system file-dialog, but less flexible.
ta: "படங்கள்", "ஆடியோ வடிவங்கள்", "வீடியோ வடிவங்கள்" போன்ற "பறக்க ஆன் தி ஃப்ளை" கோப்பு வடிப்பான்களை அனுமதிக்கும் மிகவும் நெகிழ்வான கோப்பு உரையாடல் JFILECHOOSER ஆகும், ஆனால் சற்று எளிமையானது (மற்றும் சிலருக்கு அசிங்கமாக). <br> AWT கோப்பு-டயலாக் ஒரு சொந்த இயக்க முறைமை கோப்பு-டயலாக் போல தோற்றமளிக்கிறது, ஆனால் குறைவான நெகிழ்வானது.

# prefs.showdecdegrees
source: Show coordinates in decimal degrees (ExifTool defaults to Deg Min Sec)
ta: தசம டிகிரிகளில் ஆயத்தொலைவுகளைக் காட்டு (எக்சிப்டூல் இயல்புநிலை முதல் டி.இ.

# prefs.loglevel
source: Log level
ta: பதிவு நிலை

# prefs.logleveltext
source: Log levels range from "Off" to "Error" (lightest) to "Info" (average; default value) to "Trace" (log everything)
ta: பதிவு நிலைகள் "ஆஃப்" முதல் "பிழை" (லேசான) வரை "செய்தி" (சராசரி; இயல்புநிலை மதிப்பு) "சுவடு" வரை (எல்லாவற்றையும் பதிவு செய்யுங்கள்)

# prefs.logrestart
source: Requires restarting the program
ta: நிரலை மறுதொடக்கம் செய்ய வேண்டும்

# prefs.useg1group
source: Use G1 group instead of G for viewing
ta: பார்க்க ஐயா க்கு பதிலாக ஐயா 1 குழுவைப் பயன்படுத்தவும்

# prefs.udfilefilter
source: User defined file filter:
ta: பயனர் வரையறுக்கப்பட்ட கோப்பு வடிகட்டி:

# prefs.filterexample
source: example: jpg,cr3,raf,mp4,mie (comma-separated)
ta: எடுத்துக்காட்டு: JPG, CR3, RAF, MP4, மை (கமாவால் பிரிக்கப்பட்ட)

# prefs.presmoddate
source: Preserve file modification date/time
ta: கோப்பு மாற்றும் தேதி/நேரத்தைப் பாதுகாக்கவும்

# prefs.dualcolumn
source: Select for dual columns; deselect for single column
ta: இரட்டை நெடுவரிசைகளுக்கு தேர்ந்தெடுக்கவும்; ஒற்றை நெடுவரிசைக்கு தேர்வுநீக்கு

# prefs.sortcatstags
source: Sort Category/Tags in "View tab" alphabetically
ta: "காட்சி தாவல்" இல் வகை/குறிச்சொற்களை வரிசைப்படுத்தவும்

# prefs.enablestructs
source: Enable output of structured info
ta: கட்டமைக்கப்பட்ட தகவலின் வெளியீட்டை இயக்கவும்

# prefs.fontpaneltxt
source: Select your preferred font (requires restart of jExifToolGUI)
ta: உங்களுக்கு விருப்பமான எழுத்துருவைத் தேர்ந்தெடுக்கவும் (jexiftoolgui இன் மறுதொடக்கம் தேவை)

# prefs.btndefaultfont
source: Default Font
ta: இயல்புநிலை எழுத்துரு

# prefs.etprefincorrecttitle
source: Erroneous ExifTool preference
ta: தவறான exiftool விருப்பம்

# prefs.etprefincorrecttext
source: The ExifTool specified in your preferences does not exist.<br>Did you move/rename/delete it?<br>The program will now first try to find ExifTool in the PATH.
ta: உங்கள் விருப்பங்களில் குறிப்பிடப்பட்டுள்ள எக்சிப்டூல் இல்லை. <br> நீங்கள் அதை நகர்த்தினீர்களா/மறுபெயரிட்டீர்களா/நீக்கிவிட்டீர்களா?

# rph.toptext
source: If you want to autonumber your images, make sure they are in the right alphabetical or date order. This is not a problem if you use the "Source folder" here,but can be a problem if you use the images from the main screen and if they are in "random" order.
ta: உங்கள் படங்களை நீங்கள் தன்னாட்சி பெற விரும்பினால், அவை சரியான அகர வரிசைப்படி அல்லது தேதி வரிசையில் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். நீங்கள் இங்கே "மூல கோப்புறையை" பயன்படுத்தினால் இது ஒரு பிரச்சனையல்ல, ஆனால் நீங்கள் முதன்மையான திரையில் இருந்து படங்களை பயன்படுத்தினால், அவை "சீரற்ற" வரிசையில் இருந்தால் சிக்கலாக இருக்கலாம்.

# rph.sourcefolder
source: Source folder:
ta: மூல கோப்புறை:

# rph.btnbrowse
source: Browse
ta: உலாவு

# rph.selrenameoptions
source: Select renaming options:
ta: மறுபெயரிடுதல் விருப்பங்களைத் தேர்ந்தெடுக்கவும்:

# rph.prefix
source: Prefix:
ta: முன்னொட்டு:

# rph.datetime
source: Date_time
ta: தேதி_ நேரம்

# rph.date
source: Date
ta: திகதி

# rph.string
source: String
ta: சரம்

# rph.cammodel
source: Camera model
ta: கேமரா மாதிரி

# rph.suffix
source: Suffix:
ta: பின்னொட்டு:

# rph.donotuse
source: Do not use
ta: பயன்படுத்த வேண்டாம்

# rph.location
source: location
ta: இடம்

# rph.cityname
source: City name
ta: நகரத்தின் பெயர்

# rph.iso
source: ISO
ta: ஐசோ

# rph.foclength35mm
source: Equivalent 35 mm focal length
ta: சமமான 35 மிமீ குவிய நீளம்

# rph.orgfilename
source: Original filename (without extension)
ta: அசல் கோப்பு பெயர் (நீட்டிப்பு இல்லாமல்)

# rph.duplicatestext
source: In case your chosen options leads to duplicate names, the tool auto-numbers the images.<br>Please specify how the tool should do this.
ta: நீங்கள் தேர்ந்தெடுத்த விருப்பங்கள் நகல் பெயர்களுக்கு வழிவகுத்தால், கருவி தானாகவே படங்களை எரிச்சலூட்டுகிறது. <br> கருவி இதை எவ்வாறு செய்ய வேண்டும் என்பதைக் குறிப்பிடவும்.

# rph.noofdigits
source: No. of digits
ta: இலக்கங்களின் எண்ணிக்கை

# rph.nooffidgitszero
source: Do not add counter
ta: கவுண்டரைச் சேர்க்க வேண்டாம்

# rph.nooffidgitsone
source: Start counting from 1st image
ta: 1 வது படத்திலிருந்து எண்ணத் தொடங்குங்கள்

# rph.nooffidgitstwo
source: Start counting from 2nd image
ta: 2 வது படத்திலிருந்து எண்ணத் தொடங்குங்கள்

# rph.filextension
source: File extension:
ta: கோப்பு நீட்டிப்பு:

# rph.fileextleave
source: Leave as is
ta: விடுங்கள்

# rph.fileextlower
source: Make lowercase
ta: சிறிய எழுத்தை உருவாக்குங்கள்

# rph.fileextupper
source: Make uppercase
ta: பெரிய எழுத்தை உருவாக்குங்கள்

# rph.nameexample
source: Name: Prefix_suffix.extension
ta: பெயர்: prefix_suffix.extension

# rph.locateimgfolder
source: Locate the image folder…
ta: படக் கோப்புறையைக் கண்டுபிடி…

# rph.noimgsnopathtitle
source: No path or selected files
ta: பாதை அல்லது தேர்ந்தெடுக்கப்பட்ட கோப்புகள் இல்லை

# rph.noimgsnopathtext
source: No image folder path selected<br>and/or<br>No images selected in the main screen
ta: பட கோப்புறை பாதை எதுவும் தேர்ந்தெடுக்கப்படவில்லை <br> மற்றும்/அல்லது <br> முதன்மையான திரையில் எந்த படங்களும் தேர்ந்தெடுக்கப்படவில்லை

# rph.selectedoptionstitle
source: Selected options
ta: தேர்ந்தெடுக்கப்பட்ட விருப்பங்கள்

# rph.youselected
source: You have selected:
ta: நீங்கள் தேர்ந்தெடுத்துள்ளீர்கள்:

# rph.asprefix
source: As prefix:
ta: முன்னொட்டு:

# rph.assuffix
source: And as suffix:
ta: மற்றும் பின்னொட்டு:

# rph.forcounting
source: For enumerating:
ta: கணக்கிட:

# rph.forextension
source: For the extension:
ta: நீட்டிப்புக்கு:

# emd.toptext
source: This option lets you export the metadata from your selected photo(s).<br>All supported formats give an export file per selected photo, apart from CSV, which gives you one (big) CSV file for all selected photos.<br><br>The exported files are saved to the image folder you loaded your images from.
ta: நீங்கள் தேர்ந்தெடுக்கப்பட்ட புகைப்படத்திலிருந்து (கள்) மெட்டாடேட்டாவை ஏற்றுமதி செய்ய இந்த விருப்பம் உங்களை அனுமதிக்கிறது. <br> ஏற்றுமதி செய்யப்பட்ட கோப்புகள் உங்கள் படங்களை ஏற்றிய பட கோப்புறையில் சேமிக்கப்படுகின்றன.

# emd.exportall
source: Export all metadata
ta: அனைத்து மெட்டாடேட்டாவையும் ஏற்றுமதி செய்யுங்கள்

# emd.exportexif
source: Export Exif data
ta: EXIF தரவை ஏற்றுமதி செய்யுங்கள்

# emd.extportxmp
source: Export XMP data
ta: எக்ச்எம்பி தரவை ஏற்றுமதி செய்யுங்கள்

# emd.exportgps
source: Export GPS data
ta: சி.பி.எச் தரவை ஏற்றுமதி செய்யுங்கள்

# emd.exportiptc
source: Export IPTC data
ta: ஐபிடிசி தரவை ஏற்றுமதி செய்யுங்கள்

# emd.exporticc
source: Export ICC data
ta: ஐ.சி.சி தரவை ஏற்றுமதி செய்யுங்கள்

# emd.uselang
source: Use language from Preferences for metadata-tag descriptions
ta: மெட்டாடேட்டா-டேக் விளக்கங்களுக்கான விருப்பங்களிலிருந்து மொழியைப் பயன்படுத்தவும்

# emd.exportto
source: Export to:
ta: ஏற்றுமதி:

# emd.tab
source: tab
ta: தாவல்

# emd.xml
source: XML
ta: நீகுமொ

# emd.html
source: HTML
ta: உஉகுமொ

# emd.xmp
source: XMP
ta: எக்ச்எம்பி

# emd.csv
source: CSV
ta: சிஎச்வி

# emd.allmetadata
source: All metadata
ta: அனைத்து மேனிலை தரவு

# emd.dlgtitle
source: You want to export metadata
ta: நீங்கள் மெட்டாடேட்டாவை ஏற்றுமதி செய்ய விரும்புகிறீர்கள்

# emd.dlgnoexporttitle
source: No export option selected
ta: ஏற்றுமதி விருப்பம் எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# emd.dlgnoexporttext
source: Select an option first.
ta: முதலில் ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்.

# emd.exportoption
source: Export from:
ta: இருந்து ஏற்றுமதி:

# emd.catmetadata
source: by category
ta: வகை மூலம்

# emd.usercombi
source: user-defined metadata set
ta: பயனர் வரையறுக்கப்பட்ட மேனிலை தரவு தொகுப்பு

# emd.askusercombi
source: You want to export this user-defined metadata set:
ta: இந்த பயனர் வரையறுக்கப்பட்ட மேனிலை தரவு தொகுப்பை ஏற்றுமதி செய்ய விரும்புகிறீர்கள்:

# emd.expfiles
source: Exported file(s)
ta: ஏற்றுமதி செய்யப்பட்ட கோப்பு (கள்)
