Repository: 247i/TACETr
Catalog: உரை/தானி/jexiftoolgui-program_strings-*.po
Languages: ta

# application.title
source: (for ExifTool by Phil Harvey)
ta: (பில் ஆர்வி எழுதிய எக்சிப்டூலுக்கு)

# preferences.title
source: Preferences
ta: விருப்பத்தேர்வுகள்

# renamephotos.title
source: Rename Photos
ta: புகைப்படங்களை மறுபெயரிடுங்கள்

# createargsfile.title
source: Create args file(s)
ta: ஆர்க்ச் கோப்பு (களை) உருவாக்கவும்

# exportmetadata.title
source: Export metadata
ta: ஏற்றுமதி மேனிலை தரவு

# removemetadata.title
source: Remove metadata
ta: மெட்டாடேட்டாவை அகற்று

# favoriteaddquery.title
source: Add database query
ta: தரவுத்தள வினவலைச் சேர்க்கவும்

# favoriteaddcommand.title
source: Add ExifTool command
ta: Exiftool கட்டளையைச் சேர்க்கவும்

# favoriteselect.title
source: Select a favorite
ta: பிடித்ததைத் தேர்ந்தெடுக்கவும்

# createupdatelens.title
source: Create or update lens config
ta: லென்ச் கட்டமைப்பை உருவாக்கவும் அல்லது புதுப்பிக்கவும்

# selectlens.title
source: Select a lens config
ta: லென்ச் கட்டமைப்பைத் தேர்ந்தெடுக்கவும்

# exiftooldb.title
source: ExifTool groups/tags reference
ta: Exiftool குழுக்கள்/குறிச்சொற்கள் குறிப்பு

# menu.file
source: File
ta: கோப்பு

# fmenu.loadimages
source: Load Images
ta: படங்களை ஏற்றவும்

# fmenu.loaddirectory
source: Load Directory
ta: கோப்பகத்தை ஏற்றவும்

# fmenu.preferences
source: Preferences
ta: விருப்பத்தேர்வுகள்

# fmenu.exit
source: Exit
ta: வெளியேறு

# menu.renaming
source: Renaming
ta: மறுபெயரிடுதல்

# rmenu.renamephotos
source: Rename photos
ta: புகைப்படங்களை மறுபெயரிடுங்கள்

# menu.metadata
source: Metadata
ta: மேனிலை தரவு

# mmenu.exportmetadata
source: Export metadata
ta: ஏற்றுமதி மேனிலை தரவு

# mmenu.exportsidecar
source: Sidecar exports
ta: சைட்கார் ஏற்றுமதி

# mmenu.copyallmetadatatoxmpformat
source: Copy all metadata to XMP format
ta: அனைத்து மெட்டாடேட்டாவையும் எக்ச்எம்பி வடிவத்திற்கு நகலெடுக்கவும்

# mmenu.removemetadata
source: Remove metadata
ta: மெட்டாடேட்டாவை அகற்று

# menu.datetime
source: Date/Time
ta: தேதி/நேரம்

# dtmenu.shiftdatetime
source: Shift Date/time
ta: சிப்ட் தேதி/நேரம்

# dtmenu.modifydatetime
source: Modify Date/time
ta: தேதி/நேரத்தை மாற்றவும்

# dtmenu.modifyalldatetime
source: Modify all dates and times
ta: எல்லா தேதிகளையும் நேரங்களையும் மாற்றவும்

# dtmenu.setfiledatetodatetimeoriginal
source: Set file date to DateTimeOriginal
ta: கோப்பு தேதியை டேட் டைமோரிசினலுக்கு அமைக்கவும்

# dtmenu.setmoviedatetocreatedate
source: Set movieclip date to CreateDate
ta: MovieClip தேதியை உருவாக்க அமைக்கவும்

# menu.other
source: Other
ta: மற்றொன்று

# omenu.repairjpgs
source: Repair JPG(s) with corrupted metadata
ta: சிதைந்த மெட்டாடேட்டாவுடன் JPG (களை) சரிசெய்யவும்

# omenu.createargfiles
source: Create arg file(s)
ta: ஆர்க் கோப்பை (களை) உருவாக்கவும்

# omenu.exportallpreviews
source: Export all previews/thumbnails from selected
ta: தேர்ந்தெடுக்கப்பட்டவற்றிலிருந்து அனைத்து முன்னோட்டங்கள்/சிறு உருவங்களை ஏற்றுமதி செய்யுங்கள்

# menu.tools
source: Tools
ta: கருவிகள்

# tmenu.mdusercombis
source: User-defined metadata-sets
ta: பயனர் வரையறுக்கப்பட்ட மெட்டாடேட்டா-செட்

# tmenu.deletefavs
source: Delete favorites
ta: பிடித்தவைகளை நீக்கு

# tmenu.deletelens
source: Delete lenses
ta: லென்ச்கள் நீக்கு

# tmenu.backuprestore
source: Backup/Restore User Data
ta: பயனர் தரவை காப்புப்பிரதி/மீட்டமை

# tmenu.exiftooldb
source: ExifTool groups/tags reference
ta: Exiftool குழுக்கள்/குறிச்சொற்கள் குறிப்பு

# menu.help
source: Help
ta: உதவி

# hmenu.jexiftoolguihomepage
source: jExifToolGUI homepage
ta: jexiftoolgui முகப்பகுதி

# hmenu.exiftoolhomepage
source: ExifTool homepage
ta: Exiftool முகப்புப்பக்கம்

# hmenu.onlinemanual
source: Online Manual
ta: நிகழ்நிலை கையேடு

# hmenu.onlinemanueles
source: Spanish Online Manual
ta: ச்பானிச் நிகழ்நிலை கையேடு

# hmenu.youtube
source: YouTube instruction videos
ta: YouTube அறிவுறுத்தல் வீடியோக்கள்

# hmenu.helptopicsprogram
source: Help topics program
ta: தலைப்புகள் திட்டத்திற்கு உதவுங்கள்

# hmenu.credits
source: Credits
ta: வரவு

# hmenu.donate
source: Donate
ta: நன்கொடை

# hmenu.license
source: License
ta: உரிமம்

# hmenu.translate
source: Help translate jExifToolGUI
ta: Jexiftoolgui ஐ மொழிபெயர்க்க உதவுங்கள்

# hmenu.sysproginfo
source: System and program info
ta: கணினி மற்றும் நிரல் செய்தி

# hmenu.checkfornewversion
source: Check for new version
ta: புதிய பதிப்பை சரிபார்க்கவும்

# hmenu.changelog
source: Changelog
ta: மாற்றபதிவு

# hmenu.aboutexiftool
source: About ExifTool
ta: Exiftool பற்றி

# hmenu.aboutjexiftoolgui
source: About jExifToolGUI
ta: செக்சிப்டூல்சுஐ பற்றி

# subhmenu.editdataexif
source: Edit data → Exif
ta: தரவைத் திருத்து → exif

# subhmenu.editdataxmp
source: Edit data → XMP
ta: தரவைத் திருத்து → xmp

# subhmenu.editdatagps
source: Edit data → GPS
ta: தரவைத் திருத்து → சி.பி.எச்

# subhmenu.editdatageotag
source: Edit data → Geotagging
ta: தரவைத் திருத்து → சியோடாகிங்

# subhmenu.editdatagpano
source: Edit data → GPano
ta: தரவைத் திருத்து → GPANO

# subhmenu.editdatalens
source: Edit data → Lens
ta: தரவைத் திருத்து → லென்ச்

# subhmenu.copydata
source: Copy Data
ta: தரவை நகலெடுக்கவும்

# subhmenu.exiftoolcommands
source: ExifTool Commands
ta: Exiftool கட்டளைகள்

# subhmenu.exiftooldb
source: ExifTool groups/tags reference
ta: Exiftool குழுக்கள்/குறிச்சொற்கள் குறிப்பு

# subhmenu.menurenaminginfo
source: Menu → Renaming → Info
ta: பட்டியல் → மறுபெயரிடுதல் → செய்தி

# subexpsidecarmenu.xmp
source: Export XMP Sidecar file(s)
ta: எக்ச்எம்பி சைட்கார் கோப்பு (கள்) ஏற்றுமதி செய்யுங்கள்

# subexpsidecarmenu.exif
source: Export Exif Sidecar file(s)
ta: ஏற்றுமதி எக்சிஃப் சைட்கார் கோப்பு (கள்)

# subexpsidecarmenu.mie
source: Export MIE Sidecar file(s)
ta: மை sidecar கோப்பு (கள்) ஏற்றுமதி செய்யுங்கள்

# subexpsidecarmenu.exv
source: Export EXV Sidecar file(s)
ta: Exv பக்கவாட்டு கோப்பு (கள்) ஏற்றுமதி செய்யுங்கள்

# subexpsidecarmenu.help
source: Info about the Sidecar exports
ta: சைட்கார் ஏற்றுமதி பற்றிய செய்தி

# pt.loadingimages
source: Loading images…
ta: படங்களை ஏற்றுகிறது…

# pt.loadingdirectory
source: Load folder with images…
ta: படங்களுடன் கோப்புறையை ஏற்றவும்…

# pt.copyallxmpdata
source: Copying all relevant data to its XMP variants…
ta: தொடர்புடைய அனைத்து தரவையும் அதன் எக்ச்எம்பி வகைகளுக்கு நகலெடுக்கிறது…

# pt.repairjpgs
source: Repairing JPG metadata…
ta: JPG மெட்டாடேட்டாவை சரிசெய்தல்…

# pt.extractpreviewsthumbs
source: Extracting previews and thumbnails from selected images…
ta: தேர்ந்தெடுக்கப்பட்ட படங்களிலிருந்து முன்னோட்டங்கள் மற்றும் சிறுபடங்களை பிரித்தெடுக்கும்…

# pt.yourcommands
source: Executing your ExifTool commands…
ta: உங்கள் Exiftool கட்டளைகளை செயல்படுத்துதல்…

# pt.yourcommandsoutput
source: The output should be displayed above.
ta: வெளியீடு மேலே காட்டப்பட வேண்டும்.

# pt.exiftoolavailable
source: ExifTool present, version:
ta: Exiftool தற்போது, ​​பதிப்பு:

# pt.xmpsidecar
source: Exporting XMP Sidecar files…
ta: எக்ச்எம்பி சைட்கார் கோப்புகளை ஏற்றுமதி செய்கிறது…

# pt.exifsidecar
source: Exporting Exif Sidecar files…
ta: எக்சிஃப் சைட்கார் கோப்புகளை ஏற்றுமதி செய்கிறது…

# pt.miesidecar
source: Exporting MIE Sidecar files…
ta: மை sidecar கோப்புகளை ஏற்றுமதி செய்கிறது…

# pt.exvsidecar
source: Exporting EXV Sidecar files…
ta: Exv பக்கவாட்டு கோப்புகளை ஏற்றுமதி செய்கிறது…

# pt.inscopytagtotag
source: Now copying tags from one group to another…
ta: இப்போது குறிச்சொற்களை ஒரு குழுவிலிருந்து மற்றொரு குழுவிற்கு நகலெடுக்கிறது…

# pt.exppdf
source: Writing PDF documents…
ta: PDF ஆவணங்களை எழுதுதல்…

# pt.droppedfiles
source: Loading drag-and-dropped files…
ta: இழுவை மற்றும் துளி கோப்புகளை ஏற்றுகிறது…

# pt.commandline
source: Loading files provided from the command line…
ta: கட்டளை வரியிலிருந்து வழங்கப்பட்ட கோப்புகளை ஏற்றுகிறது…

# pt.compare
source: Preparing image metadata for comparison…
ta: ஒப்பிடுவதற்கு பட மெட்டாடேட்டாவைத் தயாரித்தல்…

# pt.filesloaded
source: Files:
ta: கோப்புகள்:

# pt.folder
source: Folder:
ta: கோப்புறை:

# pt.reloadimages
source: Reloading images from metadata search result screen...
ta: மேனிலை தரவு தேடல் முடிவுத் திரையில் இருந்து படங்களை மீண்டும் ஏற்றுகிறது ...

# pt.readingmetadatabackground
source: Reading all the metadata in the background. You can continue working in the program.
ta: பின்னணியில் உள்ள அனைத்து மெட்டாடேட்டாவையும் படித்தல். நீங்கள் திட்டத்தில் தொடர்ந்து பணியாற்றலாம்.

# pt.finishedreadingmetadabackground
source: Finished reading all the metadata in the background
ta: பின்னணியில் உள்ள அனைத்து மெட்டாடேட்டாவையும் படித்து முடித்தேன்

# btn.loaddirectory
source: Load Directory
ta: கோப்பகத்தை ஏற்றவும்

# btn.loadimages
source: Load Images
ta: படங்களை ஏற்றவும்

# btn.displayimages
source: Display Image
ta: படத்தைக் காண்பி

# btn.compareimgs
source: Compare selected images
ta: தேர்ந்தெடுக்கப்பட்ட படங்களை ஒப்பிடுக

# btn.slideshow
source: Start slideshow with selected images
ta: தேர்ந்தெடுக்கப்பட்ட படங்களுடன் ச்லைடுசோவைத் தொடங்கவும்

# maintab.viewdata
source: View Data
ta: தரவைக் காண்க

# maintab.editdata
source: Edit Data
ta: தரவைத் திருத்தவும்

# maintab.copydata
source: Copy Data
ta: தரவை நகலெடுக்கவும்

# maintab.exiftoolcommands
source: ExifTool Commands
ta: Exiftool கட்டளைகள்

# maintab.exiftooldb
source: ExifTool groups/tags reference
ta: Exiftool குழுக்கள்/குறிச்சொற்கள் குறிப்பு

# maintab.exportimport
source: Export/Import
ta: ஏற்றுமதி/இறக்குமதி

# lp.tooltip
source: <html>Click image/row to select<br>Double-click image/row to open the image in the default viewer
ta: <BRML> இயல்புநிலை பார்வையாளரில் படத்தைத் திறக்க படத்தைத் தேர்ந்தெடுக்க படம்/வரிசையை சொடுக்கு செய்யவும்

# lp.thumbtablephotos
source: Photo
ta: புகைப்படம்

# lp.thumbtabledata
source: File data
ta: கோப்பு தரவு

# lp.filename
source: Name
ta: பெயர்

# lp.imagesize
source: Image size
ta: பட அளவு

# lp.orientation
source: Orientation
ta: நோக்குநிலை

# lp.iso
source: ISO
ta: ஐசோ

# lp.fnumber
source: F-number
ta: எஃப்-எண்

# lp.exposuretime
source: Shutter speed
ta: சட்டர் விரைவு

# lp.focallength
source: Focal length
ta: குவிநீளம், குவியத் தொலைவு

# lp.focallength35mm
source: Focal length in 35 mm
ta: குவிய நீளம் 35 மி.மீ.

# lp.notavailable
source: Not available
ta: கிடைக்கவில்லை

# lp.crpreview
source: Create previews
ta: முன்னோட்டங்களை உருவாக்கவும்

# lp.loadmetadata
source: Load metadata in foreground
ta: முன்புறத்தில் மெட்டாடேட்டாவை ஏற்றவும்

# ed.xmptab
source: XMP
ta: எக்ச்எம்பி

# ed.gpstab
source: GPS
ta: உலக இடம் காட்டும் அமைப்பு

# ed.geotaggingtab
source: Geotagging
ta: சியோடாகிங்

# ed.gpanotab
source: GPano
ta: இடைவெளி

# ed.lenstab
source: Lens
ta: லென்ச்

# ed.usercombis
source: User-defined combinations
ta: பயனர் வரையறுக்கப்பட்ட சேர்க்கைகள்

# cd.copyfromto
source: Copy from image to image
ta: படத்திலிருந்து படத்திற்கு நகலெடுக்கவும்

# cd.copyinimage
source: Copy inside image
ta: படத்தின் உள்ளே நகலெடுக்கவும்

# expimp.generalexp
source: General Export
ta: பொது ஏற்றுமதி

# expimp.exptopdf
source: Export to PDF
ta: PDF க்கு ஏற்றுமதி

# dlg.ok
source: OK
ta: சரி

# dlg.cancel
source: Cancel
ta: ரத்துசெய்

# dlg.yes
source: Yes
ta: ஆம்

# dlg.no
source: No
ta: இல்லை

# dlg.continue
source: Continue
ta: தொடரவும்

# dlg.save
source: Save
ta: சேமி

# dlg.close
source: Close
ta: மூடு

# dlg.delete
source: Delete
ta: நீக்கு

# dlg.browse
source: Browse
ta: உலாவு

# dlg.export
source: Export
ta: ஏற்றுமதி

# dlg.import
source: Import
ta: இறக்குமதி

# msd.noimgs
source: No images selected
ta: படங்கள் எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# msd.noimgslong
source: No images selected.<br>Nothing to work on.
ta: படங்கள் எதுவும் தேர்ந்தெடுக்கப்படவில்லை. <br> வேலை செய்ய எதுவும் இல்லை.

# msd.geonoimgpath
source: No images. No image path
ta: படங்கள் இல்லை. பட பாதை இல்லை

# msd.geonoimgpathlong
source: No images selected and no image folder path selected
ta: படங்கள் எதுவும் தேர்ந்தெடுக்கப்படவில்லை மற்றும் பட கோப்புறை பாதை தேர்ந்தெடுக்கப்படவில்லை

# msd.geonolog
source: No GPS track-log selected
ta: சி.பி.எச் ட்ராக்-லாக் எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# msd.nocommandparams
source: No command parameters given
ta: கட்டளை அளவுருக்கள் எதுவும் கொடுக்கப்படவில்லை

# msd.jtgnewversion
source: New version found
ta: புதிய பதிப்பு காணப்பட்டது

# msd.jtgnewversionlong
source: <big>A new version is available</big><br><br>Open the releases webpage where the new version can be downloaded?
ta: <bad> ஒரு புதிய பதிப்பு கிடைக்கிறது </big> <br> <br> புதிய பதிப்பை பதிவிறக்கம் செய்யக்கூடிய வெளியீட்டு வலைப்பக்கத்தைத் திறக்கவா?

# msd.jtglatestversion
source: Using the latest version
ta: அண்மைக் கால பதிப்பைப் பயன்படுத்துதல்

# msd.jtglatestversionlong
source: You are already using the latest version.
ta: நீங்கள் ஏற்கனவே அண்மைக் கால பதிப்பைப் பயன்படுத்துகிறீர்கள்.

# msd.max25imgs
source: Maximum 25 images allowed
ta: அதிகபட்சம் 25 படங்கள் அனுமதிக்கப்படுகின்றன

# msd.max25imgslong
source: A maximum of 25 images is allowed for comparison.
ta: ஒப்பிடுவதற்கு அதிகபட்சம் 25 படங்கள் அனுமதிக்கப்படுகின்றன.

# msd.nonetwork
source: no network or incorrect URL
ta: பிணையம் அல்லது தவறான முகவரி இல்லை

# msd.nonetwlong
source: There is no connection to the Internet, or the URL is incorrect.
ta: இணையத்துடன் எந்த தொடர்பும் இல்லை, அல்லது முகவரி தவறானது.

# vdtab.allradiobutton
source: All
ta: அனைத்தும்

# vdtab.commontags
source: Common Tags
ta: பொதுவான குறிச்சொற்கள்

# vdtab.bygroup
source: By G1 Group
ta: மூலம் ஐயா 1 குழு

# vdtab.bycamera
source: By Camera
ta: கேமரா மூலம்

# vdtab.tablegroup
source: Group
ta: குழு

# vdtab.tabletag
source: Tag
ta: குறிச்சொல்

# vdtab.tablevalue
source: Value
ta: மதிப்பு

# vdtab.multfiles
source: Multiple images/files selected
ta: தேர்ந்தெடுக்கப்பட்ட பல படங்கள்/கோப்புகள்

# vdtab.seloption
source: Select appropriate action
ta: பொருத்தமான செயலைத் தேர்ந்தெடுக்கவும்

# vdtab.multfilesloaded
source: Multiple images/files loaded
ta: பல படங்கள்/கோப்புகள் ஏற்றப்பட்டன

# vdtab.selectimage
source: Select an image to display its metadata
ta: அதன் மெட்டாடேட்டாவைக் காட்ட ஒரு படத்தைத் தேர்ந்தெடுக்கவும்

# label.save
source: Save
ta: சேமி

# button.copyfrom
source: Copy from selected image
ta: தேர்ந்தெடுக்கப்பட்ட படத்திலிருந்து நகலெடுக்கவும்

# button.saveto
source: Save to selected image(s)
ta: தேர்ந்தெடுக்கப்பட்ட படத்தை (கள்) சேமிக்கவும்

# button.copydefaults
source: Copy Defaults
ta: இயல்புநிலைகளை நகலெடுக்கவும்

# button.resetfields
source: Reset fields
ta: புலங்களை மீட்டமை

# button.help
source: Help
ta: உதவி

# chkbox.makebackup
source: Back up originals
ta: அசல் காப்புப்பிரதி

# exif.cameraequip
source: Camera/Equipment
ta: கேமரா/உபகரணங்கள்

# exif.make
source: Make:
ta: உருவாக்கு:

# exif.model
source: Model:
ta: மாதிரி:

# exif.datetime
source: Date and Time
ta: தேதி மற்றும் நேரம்

# exif.dtformat
source: YYYY:MM:DD hh:mm:ss (24Hrs); no syntax checking done; exif dates do not work on videos
ta: YYYY: MM: DD HH: MM: SS (24 மணிநேரம்); தொடரியல் சோதனை எதுவும் செய்யப்படவில்லை; EXIF தேதிகள் வீடியோக்களில் வேலை செய்யாது

# exif.modifydate
source: ModifyDate:
ta: மாற்றியமைத்தல்:

# exif.createdate
source: CreateDate:
ta: உருவாக்கப்பட்டது:

# exif.creatags
source: Creative Tags
ta: படைப்பு குறிச்சொற்கள்

# exif.artist
source: Artist/Creator:
ta: கலைஞர்/படைப்பாளி:

# exif.copyright
source: Copyright:
ta: பதிப்புரிமை:

# exif.usercomm
source: User comment:
ta: பயனர் கருத்து:

# exif.description
source: Description:
ta: விளக்கம்:

# xmp.toptext
source: These are some predefined XMP tags.<br>*: These fields are used in all Google (image) products<br>**: These are the "normal" xmp-pdf keywords. You can simply fill in multiple keywords.<br>***: These fields are so-called "string+" tags.Multiple Subjects/Persons in those fields need to be separated by a "," (without the double-quotes). The program will separate them in multiple strings upon saving.<br>--Note--: The string+ (***) fields in this (XMP) tab will always "overwite" the current values. For more overwrite/append/remove options use the "XMP_IPTC_String+" tab<br>
ta: இவை சில முன் வரையறுக்கப்பட்ட எக்ச்எம்பி குறிச்சொற்கள். நீங்கள் பல முக்கிய வார்த்தைகளை நிரப்பலாம். <br> ***: இந்த புலங்கள் "சரம்+" குறிச்சொற்கள் என்று அழைக்கப்படுகின்றன. அந்த துறைகளில் உள்ள பல பாடங்கள்/நபர்கள் ஒரு "," (இரட்டை மேற்கோள்கள் இல்லாமல்) பிரிக்க வேண்டும். நிரல் அவற்றை சேமிக்கும் போது பல சரங்களில் பிரிக்கும். <br>-குறிப்பு-: இந்த (எக்ச்எம்பி) தாவலில் உள்ள சரம்+ (***) புலங்கள் எப்போதும் தற்போதைய மதிப்புகளை "மேலெழுதும்". மேலும் மேலெழுதும்/சேர்க்க/அகற்று விருப்பங்களுக்கு "xmp_iptc_string+" தாவலைப் பயன்படுத்தவும் <br>

# xmp.creator
source: Creator*:
ta: உருவாக்கியவர்*:

# xmp.credline
source: Credit line*:
ta: கடன் வரி*:

# xmp.rights
source: Rights*:
ta: உரிமைகள்*:

# xmp.description
source: Description:
ta: விளக்கம்:

# xmp.label
source: Label:
ta: லேபிள்:

# xmp.title
source: Title:
ta: தலைப்பு:

# xmp.keywords
source: Keywords**:
ta: முக்கிய வார்த்தைகள் **:

# xmp.subject
source: Subject***:
ta: பொருள் ***:

# xmp.pim
source: Person in image***:
ta: படத்தில் நபர் ***:

# gps.savella
source: Save Latitude/Longitude/Altitude
ta: அட்சரேகை/தீர்க்கரேகை/உயரத்தை சேமிக்கவும்

# gps.gps
source: GPS
ta: உலக இடம் காட்டும் அமைப்பு

# gps.decimal
source: Decimal
ta: தசம

# gps.latitude
source: Latitude
ta: அகலாங்கு

# gps.longitude
source: Longitude
ta: நெட்டாங்கு

# gps.altitude
source: Altitude
ta: குத்துயரம்

# gps.above
source: Above sea level
ta: கடல் மட்டத்திற்கு மேலே

# gps.xmpiptcloc
source: XMP/IPTC location
ta: எக்ச்எம்பி/ஐபிடிசி இருப்பிடம்

# gps.whereis
source: (Where is/are the photo(s) taken)
ta: (எங்கே/புகைப்படம் (கள்) எடுக்கப்பட்டது)

# gps.location
source: Location
ta: இடம்

# gps.country
source: Country
ta: நாடு

# gps.statprov
source: State/Province
ta: மாநில/மாகாணம்

# gps.city
source: City
ta: நகரம்

# gps.calc
source: Calculator
ta: கணிப்பான்

# gps.decdegrees
source: Decimal degrees
ta: தசம டிகிரி

# gps.degrees
source: deg
ta: டெக்

# gps.minutes
source: min
ta: மணித்துளி

# gps.seconds
source: sec
ta: நொடி

# gps.s
source: S
ta: கள்

# gps.e
source: E
ta: இ

# gps.btnopenmapcoords
source: Open MapCoordinates.net
ta: Mapcoordinates.net ஐத் திறக்கவும்

# gps.btnconvert
source: Convert to decimal degrees
ta: தசம டிகிரிகளுக்கு மாற்றவும்

# gps.btncopytoinp
source: Copy to input fields
ta: உள்ளீட்டு புலங்களுக்கு நகலெடுக்கவும்

# gps.calcerror
source: error
ta: பிழை

# gps.calcdegerror
source: degrees must be between 0 and <90
ta: டிகிரி 0 முதல் <90 வரை இருக்க வேண்டும்

# gps.calcminerror
source: minutes must be between 0 and <60
ta: நிமிடங்கள் 0 முதல் <60 வரை இருக்க வேண்டும்

# gps.calcsecerror
source: seconds must be between 0 and <60
ta: விநாடிகள் 0 முதல் <60 வரை இருக்க வேண்டும்

# gps.decformat
source: Decimal format
ta: தசம வடிவம்

# gps.dmsformat
source: Deg-Min-Sec format
ta: நீங்கள்-MIN-SEC வடிவம்

# gps.searchbtn
source: Find Location
ta: இருப்பிடத்தைக் கண்டறியவும்

# gps.searchbycoordsbtn
source: Find Location using coordinates from image
ta: படத்திலிருந்து ஒருங்கிணைப்புகளைப் பயன்படுத்தி இருப்பிடத்தைக் கண்டறியவும்

# gps.searchtxt
source: <b>Find Location:</b> Internal Nominatim search with map screen, with option to "copy coordinates and location" back from map search screen.<br><b>Find Location using coordinates from image:</b> Internal Nominatim search with map screen using the coordinates you copied from one of the images using "Copy from selected image", with option to "copy coordinates and location" back from map search screen.
ta: <b> இருப்பிடத்தைக் கண்டறியவும்: </b> வரைபடத் திரை மூலம் உள் பெயரிடுதல் தேடல் திரையில் இருந்து "ஆயத்தொகுதிகள் மற்றும் இருப்பிடத்தை நகலெடுக்க" விருப்பத்துடன். <br> <b> படத்திலிருந்து ஆயர்களைப் பயன்படுத்தி இருப்பிடத்தைக் கண்டறியவும்: </b> உள் "தேர்ந்தெடுக்கப்பட்ட படத்திலிருந்து நகல்" ஐப் பயன்படுத்தி படங்களில் ஒன்றிலிருந்து நீங்கள் நகலெடுத்த ஆயத்தொகுப்புகளைப் பயன்படுத்தி வரைபடத் திரையுடன் நோமினாடிம் தேடல், வரைபடத் தேடல் திரையில் இருந்து "ஒருங்கிணைப்புகள் மற்றும் இருப்பிடம்" என்ற விருப்பத்துடன்.

# gps.extsearch
source: <b>MapCoordinates.net (deprecated):</b> External Google web-search also providing estimated altitude.<br>Requires coordinates copying the coordinates manually from the browser back to the GPS tab.
ta: <b> mapcoordinates.net (நீக்கப்பட்டது): </b> வெளிப்புற கூகிள் வலைத் தேடலும் மதிப்பிடப்பட்ட உயரத்தை வழங்குகிறது.

# gps.inputval
source: Erroneous input values
ta: தவறான உள்ளீட்டு மதிப்புகள்

# gps.declatlon
source: Latitude must be between -90 and 90; Longitude must be between -180 and 180. Or you have empty fields.
ta: அட்சரேகை -90 முதல் 90 வரை இருக்க வேண்டும்; தீர்க்கரேகை -180 முதல் 180 வரை இருக்க வேண்டும். அல்லது உங்களிடம் வெற்று புலங்கள் உள்ளன.

# gps.dmserror
source: Latitude: 0 to 90 degrees, longitude: 0 to 180 degrees<br>Minutes and seconds: 0 to 60. Or you have empty fields.
ta: அட்சரேகை: 0 முதல் 90 டிகிரி, தீர்க்கரேகை: 0 முதல் 180 டிகிரி <br> நிமிடங்கள் மற்றும் விநாடிகள்: 0 முதல் 60 வரை. அல்லது உங்களிடம் வெற்று புலங்கள் உள்ளன.

# gps.alterror
source: Height must be between -100000 and 100000.
ta: உயரம் -100000 முதல் 100000 வரை இருக்க வேண்டும்.

# gps.minorerror
source: Use "-m" parameter to allow for longer strings than 32 characters for IPTC.
ta: ஐபிடிசிக்கு 32 எழுத்துகளை விட நீண்ட சரங்களை அனுமதிக்க "-எம்" அளவுருவைப் பயன்படுத்தவும்.

# gps.addtomakernotes
source: Add Location to makernotes
ta: Makernotes இல் இருப்பிடத்தைச் சேர்க்கவும்

# gps.nocoordinates
source: Missing coordinates
ta: ஆயத்தொகுப்புகளைக் காணவில்லை

# gps.nocoordinatestxt
source: No coordinates in either or both Latitude and Longitude fields
ta: அட்சரேகை மற்றும் தீர்க்கரேகை புலங்களில் அல்லது இரண்டிலும் ஒருங்கிணைப்புகள் இல்லை

# geo.gpslogfile
source: GPS track-file
ta: சி.பி.எச் டிராக்-கோப்பு

# geo.geosynctime
source: Geosynced time
ta: புவிசார் நேரம்

# geo.geosyncexpl
source: A positive geosync time adds that time to your image(s),<br>before comparing it/them to the track log.
ta: ஒரு நேர்மறையான சியோசின்க் நேரம் உங்கள் படத்திற்கு (கள்) அந்த நேரத்தை சேர்க்கிறது, <br> அதை/அவற்றை ட்ராக் பதிவோடு ஒப்பிடுவதற்கு முன்.

# geo.geotagexpl
source: Geotagging adds the GPS coordinates to your images, but not the location.<br> Using the textfields below you can add that too.
ta: சியோடாகிங் உங்கள் படங்களுக்கு சி.பி.எச் ஆயத்தொகுதிகளைச் சேர்க்கிறது, ஆனால் இருப்பிடம் அல்ல. <br> கீழே உள்ள உரைநிலைகளைப் பயன்படுத்தி நீங்கள் அதையும் சேர்க்கலாம்.

# geo.btnwritegeoinfo
source: Write geotag info to image(s)
ta: படத்திற்கு (கள்) சியோடாக் தகவலை எழுதுங்கள்

# gpano.toptext
source: Tags marked with * are mandatory. They have no "Save" checkbox as they need to be populated anyway.
ta: * உடன் குறிக்கப்பட்ட குறிச்சொற்கள் கட்டாயமாகும். எப்படியிருந்தாலும் மக்கள் தொகை இருக்க வேண்டும் என்பதால் அவர்களிடம் "சேமி" தேர்வுப்பெட்டி இல்லை.

# gpano.croppedareaimageheightpixels
source: Cropped area Image Height pixels *
ta: செதுக்கப்பட்ட பகுதி பட உயர படப்புள்ளிகள் *

# gpano.croppedareaimagewidthpixels
source: Cropped area Image Width pixels *
ta: செதுக்கப்பட்ட பகுதி படம் அகல படப்புள்ளிகள் *

# gpano.croppedarealeftpixels
source: Cropped Area Left pixels *
ta: செதுக்கப்பட்ட பகுதி இடது படப்புள்ளிகள் *

# gpano.croppedareatoppixels
source: Cropped Area Top pixels *
ta: செதுக்கப்பட்ட பகுதி மேல் படப்புள்ளிகள் *

# gpano.fullpanoheightpixels
source: Full Pano Height pixels *
ta: முழு பனோ உயர படப்புள்ளிகள் *

# gpano.fullpanowidthpixels
source: Full Pano Width pixels *
ta: முழு பனோ அகல படப்புள்ளிகள் *

# gpano.projectiontype
source: Projection Type *
ta: திட்ட வகை *

# gpano.usepanoramaviewer
source: Use panorama viewer *
ta: பனோரமா பார்வையாளரைப் பயன்படுத்தவும் *

# gpano.googlemapsfields
source: The fields below are necessary for Google Maps
ta: கூகிள் வரைபடங்களுக்கு கீழே உள்ள புலங்கள் தேவை

# gpano.disabledfields
source: The fields necessary for Google Maps below are turned off because your ExifTool version is higher than 9.09.
ta: உங்கள் எக்சிப்டூல் பதிப்பு 9.09 ஐ விட அதிகமாக இருப்பதால் கீழே உள்ள Google வரைபடங்களுக்கு தேவையான புலங்கள் அணைக்கப்படுகின்றன.

# gpano.poseheadingdegrees
source: Pose Heading Degrees (mandatory)
ta: தலைப்பு டிகிரி (கட்டாயமானது)

# gpano.stitchingsoftware
source: Stitching Software
ta: தையல் மென்பொருள்

# gpano.initialviewheadingdegrees
source: Initial View Heading Degrees
ta: ஆரம்ப பார்வை தலைப்பு பட்டங்கள்
