Repository: 247i/TACETr
Catalog: உரை/தானி/jexiftoolgui-program_strings-*.po
Languages: ta

# mpv.lat
source: Latitude:
ta: அட்சரேகை:

# mpv.lon
source: Longitude:
ta: தீர்க்கரேகை:

# mpv.locationbtn
source: Copy only location name to GPS tab
ta: இருப்பிட பெயரை மட்டுமே சி.பி.எச் தாவலுக்கு நகலெடுக்கவும்

# mpv.okbtn
source: Copy all GPS data to GPS tab
ta: அனைத்து சி.பி.எச் தரவையும் சி.பி.எச் தாவலில் நகலெடுக்கவும்

# mpv.nosrchphrs
source: No seach phrase provided
ta: சீச் சொற்றொடர் எதுவும் வழங்கப்படவில்லை

# mpv.noresults
source: No results
ta: முடிவுகள் இல்லை

# mpv.tbllat
source: Latitude
ta: அகலாங்கு

# mpv.tbllon
source: Longitude
ta: நெட்டாங்கு

# smd.dlgtitle
source: Search through metadata
ta: மேனிலை தரவு மூலம் தேடுங்கள்

# smd.dlgtext
source: Search through metadata tags and values in your loaded images.
ta: உங்கள் ஏற்றப்பட்ட படங்களில் மேனிலை தரவு குறிச்சொற்கள் மற்றும் மதிப்புகள் மூலம் தேடுங்கள்.

# smd.nothingfoundtitle
source: No data found
ta: தரவு எதுவும் கிடைக்கவில்லை

# smd.nothingfoundtxt
source: No data found using your search string:
ta: உங்கள் தேடல் சரம் பயன்படுத்தி தரவு எதுவும் கிடைக்கவில்லை:

# smd.foundmetadatatitle
source: Found keys or values
ta: சாவிகள் அல்லது மதிப்புகள் கிடைத்தன

# smd.foundmetadata
source: Found keys or values for your metadata search string:
ta: உங்கள் மேனிலை தரவு தேடல் சரத்திற்கான விசைகள் அல்லது மதிப்புகள் கிடைத்தன:

# smd.imgname
source: Filename
ta: கோப்புப்பெயர்

# smd.keyorvalue
source: Key or value
ta: விசை அல்லது மதிப்பு

# smd.foundstring
source: Found string
ta: சரம் கிடைத்தது

# smd.key
source: Key
ta: விசை

# smd.value
source: Value
ta: மதிப்பு

# smd.reloadimages
source: Reload these images
ta: இந்த படங்களை மீண்டும் ஏற்றவும்

# fld.explanation
source: Loading folders with a large amount of pictures via the preview might take a (very) long time. It might be (much) faster to simply specify the folder containing your images here and execute the command directly on your images or movies.<br>This folder works on the tabs below.
ta: முன்னோட்டம் வழியாக பெரிய அளவிலான படங்களுடன் கோப்புறைகளை ஏற்றுவது ஒரு (மிக) நீண்ட நேரம் ஆகலாம். உங்கள் படங்களைக் கொண்ட கோப்புறையை இங்கே குறிப்பிடவும், உங்கள் படங்கள் அல்லது திரைப்படங்களில் நேரடியாக கட்டளையை இயக்கவும் (மிகவும்) வேகமாக இருக்கலாம். <br> இந்த கோப்புறை கீழேயுள்ள தாவல்களில் வேலை செய்கிறது.

# fld.folderexplanation
source: Leave the "Folder containing the images:" empty if you want to use (a selection of) the images in the left images pane.
ta: "படங்களைக் கொண்ட கோப்புறையை விட்டு விடுங்கள்:" இடது படங்கள் பலகத்தில் உள்ள படங்களை நீங்கள் பயன்படுத்த விரும்பினால் (ஒரு தேர்வு).

# fld.imagefolder
source: Use all images in this folder
ta: இந்த கோப்புறையில் உள்ள அனைத்து படங்களையும் பயன்படுத்தவும்

# fld.inclsubfolders
source: Include subfolders
ta: துணை கோப்புறைகளைச் சேர்க்கவும்

# exift.dlgtitle
source: Locate ExifTool...
ta: Exiftool ஐக் கண்டறியவும் ...

# exift.notinwinpathtitle
source: Not allowed ExifTool location
ta: எக்சிப்டூல் இருப்பிடம் அனுமதிக்கப்படவில்லை

# exift.notinwinpathtext
source: You have ExifTool in c:\\windows. This is not allowed as it would require local admin rights on Win 7/8/10/11 if you are a normal user. I will now request for an alternate location.
ta: நீங்கள் சி: \\ சாளரங்களில் எக்சிப்டூல் உள்ளது. நீங்கள் ஒரு சாதாரண பயனராக இருந்தால் 7/8/10/11 இல் உள்ளக நிர்வாக உரிமைகள் தேவைப்படும் என்பதால் இது அனுமதிக்கப்படாது. நான் இப்போது மாற்று இடத்தைக் கோருவேன்.

# exift.wrongexebin
source: Wrong executable
ta: தவறான இயங்கக்கூடியது

# exift.lookupcancelled
source: You cancelled locating ExifTool
ta: எக்சிப்டூலை கண்டுபிடிப்பதை ரத்து செய்தீர்கள்

# exift.download
source: Download ExifTool
ta: Exiftool ஐ பதிவிறக்கவும்

# exift.optlocation
source: Specify ExifTool location
ta: Exiftool இருப்பிடத்தைக் குறிப்பிடவும்

# exift.optdownload
source: Download
ta: பதிவிறக்கம்

# exift.optstop
source: Stop
ta: நிறுத்து

# exift.exifktitle
source: exiftool(-k).exe provided
ta: exiftool (-k) .exe வழங்கப்பட்டது

# exift.exifktxt
source: You provided "exiftool(-k).exe". This one can't be used as it pauses after every screen of output. The program will exit now. Please rename to "exiftool.exe" and then specify again.
ta: நீங்கள் "exiftool (-K) .exe" ஐ வழங்கினீர்கள். வெளியீட்டின் ஒவ்வொரு திரைக்குப் பிறகு இடைநிறுத்தப்படுவதால் இதைப் பயன்படுத்த முடியாது. நிரல் இப்போது வெளியேறும். தயவுசெய்து "exiftool.exe" என மறுபெயரிட்டு மீண்டும் குறிப்பிடவும்.

# exift.cancelledetlocatefromstartup
source: You cancelled providing the location of exiftool.<br>The program will now exit.
ta: எக்சிப்டூலின் இருப்பிடத்தை வழங்குவதை நீங்கள் ரத்து செய்தீர்கள். <br> நிரல் இப்போது வெளியேறும்.

# exift.wrongetbinaryfromstartup
source: This is not the exiftool executable/binary.<br>The program can't use it and will now exit.
ta: இது Exiftool இயங்கக்கூடிய/பைனரி அல்ல. <br> நிரலால் அதைப் பயன்படுத்த முடியாது, இப்போது வெளியேறும்.

# edb.etrefversion
source: ExifTool Reference version:
ta: Exiftool குறிப்பு பதிப்பு:
