Repository: 247i/TACETr
Catalog: உரை/தானி/jshelter-website-wrappers-*.po
Languages: ta

source: U. Iqbal, S. Englehardt and Z. Shafiq, "Fingerprinting the Fingerprinters: Learning to Detect Browser Fingerprinting Behaviors," in 2021 2021 IEEE Symposium on Security and Privacy (SP), San Francisco, CA, US, 2021 pp. 283-301 observed (https://github.com/uiowa-irl/FP-Inspector/blob/master/Data/potential_fingerprinting_APIs.md) that the interface is used in the wild to fingerprint users. As it is likely that only a minority of users have a VR display connected and the API provides additional information on the HW, it is likely that users with a VR display connected are easily fingerprintable.
ta: யு. இக்பால், எச். 301 கவனிக்கப்பட்டது (https://github.com/uiowa-irl/fp-inspector/blob/master/data/data/potential_fingerprinting_apis.md) இடைமுகம் காடுகளில் கைரேகை பயனர்களுக்கு பயன்படுத்தப்படுகிறது. சிறுபான்மை பயனர்கள் மட்டுமே வி.ஆர் டிச்ப்ளே இணைக்கப்பட்டிருக்கலாம் மற்றும் பநிஇ எச்.டபிள்யூவில் கூடுதல் தகவல்களை வழங்குகிறது என்பதால், வி.ஆர் டிச்ப்ளே இணைக்கப்பட்ட பயனர்கள் எளிதில் கைரேகை இருக்கக்கூடும்.

source: As we expect that the majority of the users does not have a VR display connected, we provide only a single mitigation - the wrapped APIs returns an empty list.
ta: பெரும்பாலான பயனர்கள் வி.ஆர் காட்சி இணைக்கப்படவில்லை என்று நாங்கள் எதிர்பார்ப்பது போல, நாங்கள் ஒரே ஒரு தணிப்பை மட்டுமே வழங்குகிறோம் - போர்த்தப்பட்ட ஏபிஐக்கள் வெற்று பட்டியலைத் தருகின்றன.

source: **Known bug**: The standard provides events *vrdisplayconnect*, *vrdisplaydisconnect* *vrdisplayactivate* and *vrdisplaydeactivate* that fires at least on the window object. We do not mitigate the event to fire and consequently, it is possible that an adversary can learn that a VR display was (dis)connected but there was no change in the result of the navigator.activeVRDisplays() API.
ta: ** அறியப்பட்ட பிழை **: தரநிலை நிகழ்வுகளை வழங்குகிறது*vrdisplayconnect*,*vrdisplaydisconnect**vrdisplayactivate*மற்றும்*vrdisplaydeactivate*இது சாளர பொருளின் மீது சுடுகிறது. நிகழ்வை நாங்கள் தீப்பிடிக்க மாட்டோம், இதன் விளைவாக, ஒரு வி.ஆர் காட்சி (டிச்) இணைக்கப்பட்டுள்ளது என்பதை ஒரு பகைவன் அறிய முடியும், ஆனால் நேவிகேட்டர்.அக்டிவ்.வி.ஆர்.டிச்ப்ளேச் () பநிஇ ஆகியவற்றின் விளைவாக எந்த மாற்றமும் இல்லை.

source: The VRFrameData object carries a timestamp. As we allow wrapping of several ways to obtain timestamps, we need to provide the same precision for the VRFrameData object.
ta: Vrframedata பொருள் ஒரு நேர முத்திரையைக் கொண்டுள்ளது. நேர முத்திரைகளைப் பெறுவதற்கு பல வழிகளை மடக்குவதை நாங்கள் அனுமதிக்கும்போது, ​​Vrframedata பொருளுக்கும் அதே துல்லியத்தை வழங்க வேண்டும்.

source: Title: WebAudio Filename: ../common/wrappingS-WEBA.js
ta: தலைப்பு: வலை ஆடியோ கோப்பு பெயர்: ../common/wrappings-web.js

source: This file contains wrappers for AudioBuffer and AnalyserNode related calls
ta: இந்த கோப்பில் ஆடியோபுஃபர் மற்றும் அனலிசெர்னோட் தொடர்பான அழைப்புகளுக்கான ரேப்பர்கள் உள்ளன

source: The goal is to prevent fingerprinting by modifying the values from functions which are reading/copying from AudioBuffer and AnalyserNode. So the audio content of wrapped objects is the same as intended.
ta: ஆடியோபுஃபர் மற்றும் அனலிசெர்னோடில் இருந்து படிக்கும்/நகலெடுக்கும் செயல்பாடுகளிலிருந்து மதிப்புகளை மாற்றுவதன் மூலம் கைரேகையைத் தடுப்பதே குறிக்கோள். எனவே மூடப்பட்ட பொருள்களின் ஆடியோ உள்ளடக்கம் நோக்கம் கொண்டது.

source: The modified content can be either a white noise based on domain key or a fake audio data that is modified according to domain key to be different than the original albeit very similar (i.e. the approach inspired by the algorithms created by Brave Software <https://brave.com> available at https://github.com/brave/brave-core/blob/master/chromium_src/third_party/blink/renderer/core/execution_context/execution_context.cc.)
ta: மாற்றியமைக்கப்பட்ட உள்ளடக்கம் டொமைன் விசையை அடிப்படையாகக் கொண்ட ஒரு வெள்ளை சத்தமாக இருக்கலாம் அல்லது டொமைன் விசையின் படி மாற்றியமைக்கப்பட்ட போலி ஆடியோ தரவாக அசல் மிகவும் ஒத்ததாக இருந்தாலும் வித்தியாசமாக இருக்க முடியும் (அதாவது துணிச்சலான மென்பொருளால் உருவாக்கப்பட்ட வழிமுறைகளால் ஈர்க்கப்பட்ட அணுகுமுறை <https:/ /brave.com> https://github.com/brave/brave-core/blob/masromium_src/third_party/blink/renderer/core/execution_context/execution_context.cc இல் கிடைக்கிறது.)

source: **Note**: Both approaches are detectable by a fingerprinter that checks if a predetermined audio is the same as the read one. Nevertheless, the aim of the wrappers is to limit the finerprintability.
ta: ** குறிப்பு **: இரண்டு அணுகுமுறைகளும் ஒரு கைரேகை மூலம் கண்டறியப்படுகின்றன, இது முன்னரே தீர்மானிக்கப்பட்ட ஆடியோ வாசிப்புக்கு சமமானதா என்பதை சரிபார்க்கும். ஆயினும்கூட, ரேப்பர்களின் நோக்கம் மிகச்சிறந்த தன்மையைக் கட்டுப்படுத்துவதாகும்.

source: **Known bug**: Possibly inconsistant data between AudioBuffer and AnalyserNode wrappers.
ta: ** அறியப்பட்ட பிழை **: ஆடியோபுஃபர் மற்றும் அனலிசெர்னோட் ரேப்பர்களுக்கு இடையே சீரற்ற தரவு.

source: **Known bug**: Inconsistency between AudioBuffer.prototype.copyFromChannel and AudioBuffer.prototype.getChannelData. AudioBuffer.prototype.copyFromChannel should call AudioBuffer.prototype.getChannelData wrapper and then return result of the original call.
ta: . ஆடியோபுஃபர்.பிரோட்டோடைப்.கோபிஃப்ரோம்சானல் ஆடியோபுஃபர்.பிரோட்டோடைப்.செட்டோண்டேட்டா ரேப்பரை அழைத்து அசல் அழைப்பின் முடிவைத் தர வேண்டும்.

source: Title: WebGL Filename: ../common/wrappingS-WEBGL.js
ta: தலைப்பு: வெப்சிஎல் கோப்பு பெயர்: ../common/wrappings-webgl.js

source: This file contains wrappers for WebGL related calls
ta: இந்த கோப்பில் வெப்சிஎல் தொடர்பான அழைப்புகளுக்கான ரேப்பர்கள் உள்ளன

source: The goal is to prevent fingerprinting by modifying the values from certain WebGLRenderingContext API functions. This includes return values of various functions which can be hardware/software specific and image data reading.
ta: சில வெப்க்ள்ரெண்டரிங் கான்டெக்ச்ட் பநிஇ செயல்பாடுகளிலிருந்து மதிப்புகளை மாற்றுவதன் மூலம் கைரேகையைத் தடுப்பதே குறிக்கோள். வன்பொருள்/மென்பொருள் குறிப்பிட்ட மற்றும் பட தரவு வாசிப்பாக இருக்கக்கூடிய பல்வேறு செயல்பாடுகளின் வருவாய் மதிப்புகள் இதில் அடங்கும்.

source: Content is either modified according to domain and session keys to be different than the original albeit very similar or replaced by bottom value which is consistent every time. Both approaches are inspired by the algorithms created by [Brave Software](https://brave.com) available [here](https://github.com/brave/brave-core/$blob/master/chromium_src/third_party/blink/renderer/modules/webgl/webgl_rendering_context_base.cc) and [here](https://github.com/brave/brave-core/blob/master/chromium_src/third_party/blink/renderer/modules/webgl/webgl2_rendering_context_base.cc).
ta: உள்ளடக்கம் டொமைன் மற்றும் அமர்வு விசைகள் படி மாற்றியமைக்கப்படுகிறது, அசல் விட வேறுபட்டதாக இருக்கும் அல்லது ஒவ்வொரு முறையும் சீரானதாக இருக்கும் கீழ் மதிப்பால் மாற்றப்படுகிறது. இரண்டு அணுகுமுறைகளும் [துணிச்சலான மென்பொருள்] (https://brave.com) உருவாக்கிய வழிமுறைகளால் ஈர்க்கப்பட்டுள்ளன [இங்கே] (https://github.com/brave/brave-core/$blob/master/chromium_src/third_party/ பிளிங்க்/ரெண்டரர்/தொகுதிகள்/வெப்சிஎல்/வெப்சிஎல்_ரெண்டரிங்_கோன்டெக்ச்ட்_பேச்.சிசி) மற்றும் [இங்கே] (https://github.com/brave-core/blob/master/chromium_src/third_party/blink/rendererer/modgaseralorgel/webgl/webgl/webgl/webgl/webgl/webgl/webgl/webgl2_obl2_ராக் ).

source: This wrapper operates with two levels of protection:
ta: இந்த ரேப்பர் இரண்டு நிலை பாதுகாப்புடன் இயங்குகிறது:

source: (0) - return modified results, such as slightly changed image, slightly changed number or random string
ta: (0) - சற்று மாற்றப்பட்ட படம், சற்று மாற்றப்பட்ட எண் அல்லது சீரற்ற சரம் போன்ற மாற்றியமைக்கப்பட்ட முடிவுகளைத் தரவும்

source: (1) - return bottom values - such as zero, empty string, empty image, null, etc.
ta: (1) - கீழே மதிப்புகளைத் தரவும் - பூச்சியம், வெற்று சரம், வெற்று படம், சுழியம் போன்றவை.

source: Level 0 is trying to force WebGL fingeprint to be unique on every domain and every session. This can be effective when used with other wrappers with same options. This level causes breakage of websites using WebGL only rarely. Level 1 is trying to return as little information as possible while being consistent across domains and sessions. This level can cause breakage on majority of websites using WebGL.
ta: நிலை 0 ஒவ்வொரு களத்திலும் ஒவ்வொரு அமர்விலும் webgl fingeprint ஐ தனித்துவமாக இருக்க கட்டாயப்படுத்த முயற்சிக்கிறது. அதே விருப்பங்களுடன் மற்ற ரேப்பர்களுடன் பயன்படுத்தும்போது இது பயனுள்ளதாக இருக்கும். இந்த நிலை Webgl ஐப் பயன்படுத்தி வலைத்தளங்களை உடைப்பதை அரிதாகவே ஏற்படுத்துகிறது. நிலை 1 களங்கள் மற்றும் அமர்வுகள் முழுவதும் சீராக இருக்கும்போது முடிந்தவரை சிறிய தகவல்களைத் திருப்ப முயற்சிக்கிறது. இந்த நிலை வெப்சிஎல் பயன்படுத்தும் பெரும்பாலான வலைத்தளங்களில் உடைக்கப்படலாம்.

source: **Note**: Both approaches are detectable by a fingerprinter that checks if a predetermined image is the same as the read one or if specific function returns expected value. Nevertheless, the aim of the wrappers is to limit the finerprintability.
ta: ** குறிப்பு **: இரண்டு அணுகுமுறைகளும் ஒரு கைரேகை மூலம் கண்டறியப்படுகின்றன, இது முன்னரே தீர்மானிக்கப்பட்ட படம் ஒன்றைப் படித்ததா அல்லது குறிப்பிட்ட செயல்பாடு எதிர்பார்க்கப்படும் மதிப்பை அளித்தால் சரிபார்க்கிறது. ஆயினும்கூட, ரேப்பர்களின் நோக்கம் மிகச்சிறந்த தன்மையைக் கட்டுப்படுத்துவதாகும்.

source: Title: Web XR Filename: ../common/wrappingS-XR.js
ta: தலைப்பு: வலை எக்ச்ஆர் கோப்பு பெயர்: ../common/wrappings-xr.js

source: navigator.xr allows any page script to learn the VR displays attached to the computer and more.
ta: Navigator.xr எந்த பக்க ச்கிரிப்டையும் கணினியுடன் இணைக்கப்பட்ட வி.ஆர் காட்சிகளைக் கற்றுக்கொள்ள அனுமதிக்கிறது.

source: U. Iqbal, S. Englehardt and Z. Shafiq, "Fingerprinting the Fingerprinters: Learning to Detect Browser Fingerprinting Behaviors," in 2021 2021 IEEE Symposium on Security and Privacy (SP), San Francisco, CA, US, 2021 pp. 283-301 observed (https://github.com/uiowa-irl/FP-Inspector/blob/master/Data/potential_fingerprinting_APIs.md) that the orginal WebVR API is used in the wild to fingerprint users. As it is likely that only a minority of users have a VR display connected and the API provides additional information on the HW, it is likely that users with a VR display connected are easily fingerprintable.
ta: யு. இக்பால், எச். 301 கவனிக்கப்பட்டது (https://github.com/uiowa-irl/fp-inspector/blob/master/data/data/potential_fingerprinting_apis.md) கைரேகை பயனர்களுக்கு ஆர்கினல் வெப்விஆர் பநிஇ பயன்படுத்தப்படுகிறது. சிறுபான்மை பயனர்கள் மட்டுமே வி.ஆர் டிச்ப்ளே இணைக்கப்பட்டிருக்கலாம் மற்றும் பநிஇ எச்.டபிள்யூவில் கூடுதல் தகவல்களை வழங்குகிறது என்பதால், வி.ஆர் டிச்ப்ளே இணைக்கப்பட்ட பயனர்கள் எளிதில் கைரேகை இருக்கக்கூடும்.

source: As all the API calls are accessible through the navigator.xr API, we provide a single mitigation. We disable the API completely. This might need to be revised once this API is commonly enabled in browsers.
ta: அனைத்து பநிஇ அழைப்புகளும் நேவிகேட்டர்.எக்ச்ஆர் பநிஇ மூலம் அணுகக்கூடியவை என்பதால், நாங்கள் ஒரு தணிப்பை வழங்குகிறோம். நாங்கள் பநிஇ ஐ முழுமையாக முடக்குகிறோம். இந்த பநிஇ பொதுவாக உலாவிகளில் இயக்கப்பட்டவுடன் இதை திருத்த வேண்டும்.
