Repository: 247i/TACETr
Catalog: உரை/தானி/jshelter-website-wrappers-*.po
Languages: ta

source: Title: Ajax Filename: ../common/wrappingS-AJAX.js
ta: தலைப்பு: அசாக்ச் கோப்பு பெயர்: ../common/wrappings-ajax.js

source: XHR may be misused to exfiltrate data from the browser to the server. We provide a wrapper that either blocks all XHR requests or lets the user decide.
ta: உலாவியில் இருந்து சேவையகத்திற்கு தரவை வெளியேற்ற எக்ச்எச்ஆர் தவறாகப் பயன்படுத்தப்படலாம். எல்லா எக்ச்எச்ஆர் கோரிக்கைகளையும் தடுக்கும் அல்லது பயனரை தீர்மானிக்க அனுமதிக்கும் ஒரு ரேப்பரை நாங்கள் வழங்குகிறோம்.

source: **Known bug**: There are two flaws in the current implementation:
ta: ** அறியப்பட்ட பிழை **: தற்போதைய செயலாக்கத்தில் இரண்டு குறைபாடுகள் உள்ளன:

source: There are many ways (see e.g. https://github.com/cure53/HTTPLeaks) to replace XHR and consequently evade the wrapper. This can be mitigating by monitoring the requests using Web Request API.
ta: எக்ச்எச்ஆரை மாற்றுவதற்கு பல வழிகள் உள்ளன (எ.கா. வலை கோரிக்கை பநிஇ ஐப் பயன்படுத்தி கோரிக்கைகளை கண்காணிப்பதன் மூலம் இது தணிக்கலாம்.

source: The confirm method puts a lot of responsibility on the user who needs to have a good knowledge about the requests on each visited page.
ta: உறுதிப்படுத்தும் முறை பயனருக்கு நிறைய பொறுப்பை அளிக்கிறது, அவர் பார்வையிட்ட ஒவ்வொரு பக்கத்திலும் கோரிக்கைகளைப் பற்றி நல்ல அறிவைக் கொண்டிருக்க வேண்டும்.

source: **Note**: We expect to remove the wrapper once we release JShelter with Fingerprint Detector (FPD). FPD should solve both issues above.
ta: ** குறிப்பு **: கைரேகை டிடெக்டர் (FPD) உடன் JShelter ஐ வெளியிட்டவுடன் ரேப்பரை அகற்ற எதிர்பார்க்கிறோம். மேலே உள்ள இரண்டு சிக்கல்களையும் FPD தீர்க்க வேண்டும்.

source: Title: Battery level Filename: ../common/wrappingS-BATTERY-CR.js
ta: தலைப்பு: பேட்டரி நிலை கோப்பு பெயர்: ../common/wrappings-battery-cr.js

source: The `navigator.getBattery()` reports the state of the battery and can be misused to fingerprint users for a short term. The API was removed from Firefox, but is still supported in browsers derived from Chromium. The wrapper mimics Firefox behaviour.
ta: `Navigator.getBattery ()` பேட்டரியின் நிலையைப் புகாரளிக்கிறது மற்றும் கைரேகை பயனர்களுக்கு குறுகிய காலத்திற்கு தவறாகப் பயன்படுத்தப்படலாம். பநிஇ பயர்பாக்சிலிருந்து அகற்றப்பட்டது, ஆனால் குரோமியத்திலிருந்து பெறப்பட்ட உலாவிகளில் இன்னும் ஆதரிக்கப்படுகிறது. ரேப்பர் பயர்பாக்ச் நடத்தையை பிரதிபலிக்கிறது.

source: \see <https://lukaszolejnik.com/battery>
ta: \ <https://lukaszolejnik.com/battery> ஐப் பார்க்கவும்

source: **Known bug**: Because we mimic Firefox behaviour, a Chromium derived browser becomes more easily fingerprintable. This can be fixed by properly wrapping `BatteryManager.prototype` getters and setters.
ta: ** அறியப்பட்ட பிழை **: நாங்கள் பயர்பாக்ச் நடத்தையைப் பிரதிபலிப்பதால், ஒரு குரோமியம் பெறப்பட்ட உலாவி மிகவும் எளிதாக கைரேகையாகிறது. `பேட்டர்மேனேசர்.பிராடோடைப்` பெறுபவர்கள் மற்றும் செட்டர்களை சரியாக மடக்குவதன் மூலம் இதை சரிசெய்யலாம்.

source: Title: Beacon API Filename: ../common/wrappingS-BE.js
ta: தலைப்பு: பெக்கான் பநிஇ கோப்பு பெயர்: ../common/wrappings-be.js

source: The `navigator.sendBeacon()` method asynchronously sends a small amount of data over HTTP to a web server. It is intended to be used for sending analytics data to a web server. For more details see the MDN docs on the [Beacon API](https://developer.mozilla.org/en-US/docs/Web/API/Beacon_API) and [sendBeacon](https://developer.mozilla.org/en-US/docs/Web/API/Navigator/sendBeacon).
ta: `Navigator.sendbeacon ()` முறை ஒத்திசைவற்ற முறையில் HTTP வழியாக ஒரு சிறிய அளவு தரவை வலை சேவையகத்திற்கு அனுப்புகிறது. இது ஒரு வலை சேவையகத்திற்கு பகுப்பாய்வு தரவை அனுப்புவதற்கு பயன்படுத்தப்பட வேண்டும். மேலும் விவரங்களுக்கு [பெக்கான் ஏபிஐ] (https://developer.mozilla.org/en-us/docs/web/api/beacon_api) மற்றும் [sendBeacon] (https://developer.mozilla..org /en-us/docs/web/api/navigator/sendBeacon).

source: `navigator.sendBeacon` is the only method currently defined for the Beacon API.
ta: `நேவிகேட்டர்.செண்ட்பீச்கான்` என்பது பெக்கான் ஏபிஐக்கு தற்போது வரையறுக்கப்பட்ட ஒரே முறை.

source: Title: Cooperative Scheduling Filename: ../common/wrappingS-COOP-SCHEDULING.js
ta: தலைப்பு: கூட்டுறவு திட்டமிடல் கோப்பு பெயர்: ../common/wrappings-oop-scheduling.js

source: The `window.requestIdleCallback()` API can schedule background tasks such that they do not introduce delays to other high priority tasks that share the same event loop, such as input processing, animations and frame compositing.
ta: `சாளரம்.

source: But the API leaks information about the other tasks running in the browser as it leaks information on currently scheduled tasks, vsync deadlines, user-interaction and so on.
ta: ஆனால் தற்போது திட்டமிடப்பட்ட பணிகள், VSYNC காலக்கெடுக்கள், பயனர் தொடர்பு மற்றும் பலவற்றின் தகவல்களை கசியவிட்டதால், உலாவியில் இயங்கும் மற்ற பணிகளைப் பற்றிய தகவல்களை பநிஇ கசியவிட்டது.

source: JShelter modifies the return call to:
ta: திரும்ப அழைப்பை jshelter மாற்றியமைக்கிறது:

source: Never leak the information that the call was triggered by an expired timeout.
ta: காலாவதியான காலக்கெடு மூலம் அழைப்பு தூண்டப்பட்ட தகவல்களை ஒருபோதும் கசிய வேண்டாம்.

source: Fake the information on remaining time in synchronization with the `Date.now()` wrapper. Returns up to 50% more time compared to the original value.
ta: `தேதி. இப்போது ()` ரேப்பருடன் ஒத்திசைவில் மீதமுள்ள நேரம் குறித்த தகவல்களை போலியானது. அசல் மதிப்புடன் ஒப்பிடும்போது 50% அதிக நேரம் வரை கிடைக்கும்.

source: Title: Device memory Filename: ../common/wrappingS-DM.js
ta: தலைப்பு: சாதன நினைவக கோப்பு பெயர்: ../common/wrappings-dm.js

source: This file contains a wrapper for [navigator.deviceMemory](https://developer.mozilla.org/en-US/docs/Web/API/Navigator/deviceMemory).
ta: இந்த கோப்பில் [navigator.devicememory] (https://developer.mozilla.org/en-us/docs/web/api/navigator/devicememory) க்கான ஒரு ரேப்பர் உள்ளது.

source: The goal is to prevent fingerprinting by modifying the return value of the `navigator.deviceMemory` parameter.
ta: `Navigator.devicememory` அளவுருவின் வருவாய் மதிப்பை மாற்றியமைப்பதன் மூலம் கைரேகையைத் தடுப்பதே குறிக்கோள்.

source: This wrapper operates with three levels of protection:
ta: இந்த ரேப்பர் மூன்று நிலை பாதுகாப்புடன் இயங்குகிறது:

source: (0) - return random valid value from range [0.25 - real value]
ta: (0) - வரம்பிலிருந்து சீரற்ற செல்லுபடியாகும் மதிப்பைத் திரும்புக [0.25 - உண்மையான மதிப்பு]

source: (1) - return random valid value from range [0.25 - 8]
ta: (1) - வரம்பிலிருந்து சீரற்ற செல்லுபடியாகும் மதிப்பைத் திரும்புக [0.25 - 8]

source: (2) - return 4
ta: (2) - திரும்ப 4

source: These approaches are inspired by the algorithms created by [Brave Software](https://brave.com) available [here](https://github.com/brave/brave-core/blob/master/chromium_src/third_party/blink/renderer/core/frame/navigator_device_memory.cc).
ta: இந்த அணுகுமுறைகள் [துணிச்சலான மென்பொருள்] (https://brave.com) உருவாக்கிய வழிமுறைகளால் ஈர்க்கப்பட்டுள்ளன [இங்கே] /renderer/core/frame/navigator_device_memory.cc).

source: Title: DOM API Filename: ../common/wrappingS-DOM.js
ta: தலைப்பு: டோம் பநிஇ கோப்பு பெயர்: ../common/wrappings-dom.js

source: The events carry timestamp of their creation. As we allow wrapping of several ways to obtain timestamps, we need to provide the same precision for the Event API.
ta: நிகழ்வுகள் அவற்றின் உருவாக்கத்தின் நேர முத்திரையைக் கொண்டுள்ளன. நேர முத்திரைகளைப் பெறுவதற்கு பல வழிகளை மடக்குவதை நாங்கள் அனுமதிக்கும்போது, ​​நிகழ்வு பநிஇ க்கும் அதே துல்லியத்தை நாங்கள் வழங்க வேண்டும்.

source: Title: ECMAscript arrays Filename: ../common/wrappingS-ECMA-ARRAY.js
ta: தலைப்பு: ecmascript வரிசைகள் கோப்பு பெயர்: ../common/wrappings-ecma-array.js

source: This wrapper aims on prevention of microarchitectural attacks like Meltdown and Spectre. This code was originally a part of [ChromeZero](https://github.com/IAIK/ChromeZero).
ta: இந்த ரேப்பர் மெல்டவுன் மற்றும் ச்பெக்டர் போன்ற மைக்ரோஆர்க்கிடெக்சரல் தாக்குதல்களைத் தடுப்பதை நோக்கமாகக் கொண்டுள்ளது. இந்த குறியீடு முதலில் [Chromezero] (https://github.com/iaik/chromezero) இன் ஒரு பகுதியாக இருந்தது.

source: **Known bug**: The `subarray()` method always ruturns the full array.
ta: ** அறியப்பட்ட பிழை **: `சப்அரே ()` முறை எப்போதும் முழு வரிசையையும் வழங்குகிறது.

source: The wrappers support the following behaviour:
ta: ரேப்பர்கள் பின்வரும் நடத்தையை ஆதரிக்கின்றன:

source: Offset: The content of the buffer is shifted by a fix offset. This is a faster method but can be removed.
ta: ஆஃப்செட்: இடையகத்தின் உள்ளடக்கம் ஒரு பிழைத்திருத்த ஆஃப்செட் மூலம் மாற்றப்படுகிறது. இது ஒரு வேகமான முறை ஆனால் அகற்றப்படலாம்.

source: Random mapping: All items are mapped randomly. This is a slower method but more reliable.
ta: சீரற்ற மேப்பிங்: அனைத்து பொருட்களும் தோராயமாக வரைபடமாக்கப்படுகின்றன. இது மெதுவான முறை ஆனால் மிகவும் நம்பகமானது.

source: \see <https://www.fit.vut.cz/study/thesis/22374/?year=0&sup=Pol%C4%8D%C3%A1k>, especially Sect. 5.1
ta: \ பார்க்க <https://www.fit.vut.cz/study/tizes/22374/?year=0&sup=pol%C4%8D%C3%A1K>, குறிப்பாக பிரிவு. 5.1

source: Title: ECMAscript date Filename: ../common/wrappingS-ECMA-DATE.js
ta: தலைப்பு: ecmascript தேதி கோப்பு பெயர்: ../common/wrappings-ecma-date.js

source: This wrapper aims on prevention of microarchitectural attacks, clock-skew attacks, and other time related attacks. The goal is to limit the precision of the time returned by the Date object.
ta: இந்த ரேப்பர் மைக்ரோஆர்கிடெக்சரல் தாக்குதல்கள், கடிகாரத்தைத் துடைக்கும் தாக்குதல்கள் மற்றும் பிற நேர தொடர்பான தாக்குதல்களைத் தடுப்பதை நோக்கமாகக் கொண்டுள்ளது. தேதி பொருளால் திரும்பிய நேரத்தின் துல்லியத்தை மட்டுப்படுத்துவதே குறிக்கோள்.

source: \see <https://www.fit.vut.cz/study/thesis/22308/?year=0&sup=Pol%C4%8D%C3%A1k>, especially Sect. 7.2.
ta: \ காண்க <https://www.fit.vut.cz/study/tizes/22308/?year=0&sup=pol%C4%8D%C3%A1K>, குறிப்பாக பிரிவு. 7.2.

source: \see Tom Van Goethem, Wouter Joosen, Nick Nikiforakis. The Clock is Still Ticking: Timing Attacks in the Modern Web. CCS'15. [Link](https://lirias.kuleuven.be/retrieve/389086), [DOI](http://dx.doi.org/10.1145/2810103.2813632)
ta: Tom டாம் வான் கோத்தெம், வூட்டர் சூசென், நிக் நிகிஃபோராகிச். கடிகாரம் இன்னும் துடிக்கிறது: நவீன வலையில் நேர தாக்குதல்கள். CCS'15. .

source: \see Schwarz, M., Lipp, M. a Gruss, D. JavaScript Zero: Real JavaScript and Zero Side-Channel Attacks. NDSS'18.
ta: Sh ச்வார்ச், எம்., லிப், எம். எ க்ரச், டி. சாவாச்கிரிப்ட் சீரோ: ரியல் சாவாச்கிரிப்ட் மற்றும் சீரோ சைட்-சேனல் தாக்குதல்கள். Ndss'18.

source: \see Schwarz M., Maurice C., Gruss D., Mangard S. (2017) Fantastic Timers and Where to Find Them: High-Resolution Microarchitectural Attacks in JavaScript. In: Kiayias A. (eds) Financial Cryptography and Data Security. FC 2017. Lecture Notes in Computer Science, vol 10322. Springer, Cham. https://doi.org/10.1007/978-3-319-70972-7_13
ta: Sh ச்வார்ச் எம்., மாரிச் சி., கிரச் டி., மங்கார்ட் எச். இல்: கியாயியாச் ஏ. (பதிப்புகள்) பொருள் குறியாக்கவியல் மற்றும் தரவு பாதுகாப்பு. எஃப்சி 2017. கணினி அறிவியலில் விரிவுரை குறிப்புகள், தொகுதி 10322. ச்பிரிங்கர், சாம். https://doi.org/10.1007/978-3-319-70972-7_13

source: Round timestamp: Limit the precision by removing (a part of) the decimal part of the timestamp.
ta: சுற்று நேர முத்திரை: நேர முத்திரையின் தசம பகுதியை (ஒரு பகுதியின்) அகற்றுவதன் மூலம் துல்லியத்தை கட்டுப்படுத்துங்கள்.

source: Randomize after rounding: Create a fake decimal part to confuse attackers and to create timestamps that look similar to expected timestamps.
ta: ரவுண்டிங் செய்த பிறகு சீரற்றதாக: தாக்குபவர்களைக் குழப்பவும், எதிர்பார்த்த நேர முத்திரைகளுக்கு ஒத்ததாக இருக்கும் நேர முத்திரைகளை உருவாக்கவும் ஒரு போலி தசம பகுதியை உருவாக்கவும்.

source: Title: ECMA shared buffers Filename: ../common/wrappingS-ECMA-SHARED.js
ta: தலைப்பு: ECMA பகிரப்பட்ட இடையக கோப்பு பெயர்: ..

source: This wrapper aims on prevention of misusing `SharedArrayBuffer` to create perfect timers and to perfrom microarchitectural attacks. This code was originally a part of [ChromeZero](https://github.com/IAIK/ChromeZero).
ta: இந்த ரேப்பர் சரியான டைமர்களை உருவாக்குவதற்கும் மைக்ரோஆர்கிடெக்சரல் தாக்குதல்களைத் துடைப்பதற்கும் `சேர்டாரே பஃபர்` தவறாகப் பயன்படுத்துவதைத் தடுப்பதை நோக்கமாகக் கொண்டுள்ளது. இந்த குறியீடு முதலில் [Chromezero] (https://github.com/iaik/chromezero) இன் ஒரு பகுதியாக இருந்தது.

source: \see https://www.fit.vut.cz/study/thesis/22374/?year=0&sup=Pol%C4%8D%C3%A1k, especially Sect. 5.1
ta: Ht ஐப் பார்க்கவும் https://www.fit.vut.cz/study/thesis/22374/?year=0&sup=pol%C4%8D%C3%A1K, குறிப்பாக பிரிவு. 5.1

source: Title: Encrypted Media Extensions Filename: ../common/wrappingS-EME.js
ta: தலைப்பு: மறைகுறியாக்கப்பட்ட மீடியா நீட்டிப்புகள் கோப்பு பெயர்: ../common/wrappings-eme.js

source: `Navigator.requestMediaKeySystemAccess()` provides access to `MediaKeySystemAccess` object that allows to query supported encryption mechanisms and other information about the system.
ta: `Navigator.

source: For example, visit https://www.fit.vutbr.cz/~polcak/jsr/hdcp/ and try a different browser or computer.
ta: எடுத்துக்காட்டாக, https://www.fit.vutbr.cz/~polcak/jsr/hdcp/ ஐப் பார்வையிடவும், வேறு உலாவி அல்லது கணினியை முயற்சிக்கவும்.

source: \see https://w3c.github.io/encrypted-media/ \see https://developer.mozilla.org/en-US/docs/Web/API/Navigator/requestMediaKeySystemAccess \see https://developer.mozilla.org/en-US/docs/Web/API/MediaKeySystemAccess \see https://developer.mozilla.org/en-US/docs/Web/API/MediaKeySystemAccess/getConfiguration
ta: Ht ஐப் பார்க்கவும் https://w3c.github.io/encrypted-media/ \ பார்க்க https://developer.mozilla.org/en-us/docs/web/api/navigator/requestmediakysystemaccess \ https: //developer.mosillaer.mosillaer ஐப் பார்க்கவும் .org/en-us/docs/web/api/mediakeysystemaccess ht ஐப் பார்க்கவும் https://developer.mozilla.org/en-us/docs/web/api/mediakeysystemaccess/getconfiguration ஐப் பார்க்கவும்

source: We provide two modes of protection:
ta: நாங்கள் இரண்டு பாதுகாப்பு முறைகளை வழங்குகிறோம்:

source: Strict approach prevents accessing the API.
ta: கடுமையான அணுகுமுறை பநிஇ ஐ அணுகுவதைத் தடுக்கிறது.

source: Farbling approach changes the output to a non-existing key system with 12.5% probability.
ta: ஃபர்ப்ளிங் அணுகுமுறை வெளியீட்டை 12.5% ​​நிகழ்தகவுடன் இல்லாத முக்கிய அமைப்பாக மாற்றுகிறது.

source: Title: Geolocation Filename: ../common/wrappingS-GEO.js
ta: தலைப்பு: புவிஇருப்பிட கோப்பு பெயர்: ../common/wrappings-geo.js

source: The goal is to prevent leaks of user current position. The Geolocation API also provides access to high precision timestamps which can be used to various web attacks (see for example, http://www.jucs.org/jucs_21_9/clock_skew_based_computer, https://lirias.kuleuven.be/retrieve/389086).
ta: பயனர் தற்போதைய நிலை கசிவுகளைத் தடுப்பதே குறிக்கோள். பல்வேறு வலைத் தாக்குதல்களுக்குப் பயன்படுத்தக்கூடிய உயர் துல்லியமான நேர முத்திரைகளுக்கான அணுகலையும் புவிஇருப்பிட பநிஇ வழங்குகிறது (எடுத்துக்காட்டாக, http://www.jucs.org/jucs_21_9/clock_skew_based_computer, https://lirias.kuleuven.be/retrieve/389086 ஐக் காண்க ).

source: Although it is true that the user needs to specificaly approve access to location facilities, these wrappers aim on improving the control of the precision of the geolocation.
ta: இருப்பிட வசதிகளுக்கான அணுகலை பயனர் குறிப்பிட்டதாக ஒப்புக் கொள்ள வேண்டும் என்பது உண்மைதான் என்றாலும், இந்த ரேப்பர்கள் புவிஇருப்பிடத்தின் துல்லியத்தின் கட்டுப்பாட்டை மேம்படுத்துவதை நோக்கமாகக் கொண்டுள்ளன.

source: The wrappers support the following controls:
ta: ரேப்பர்கள் பின்வரும் கட்டுப்பாடுகளை ஆதரிக்கின்றன:

source: Accurate data: the extension provides precise geolocation position but modifies the time precision in conformance with the Date and Performance wrappers.
ta: துல்லியமான தரவு: நீட்டிப்பு துல்லியமான புவிஇருப்பிட நிலையை வழங்குகிறது, ஆனால் தேதி மற்றும் செயல்திறன் ரேப்பர்களுடன் ஒத்துப்போகும் நேர துல்லியத்தை மாற்றியமைக்கிறது.

source: Modified position: the extension modifies the time precision of the time stamps in conformance with the Date and Performance wrappers, and additionally, allows to limit the precision of the current position to hundered of meters, kilometers, tens, or hundereds of kilometers.
ta: மாற்றியமைக்கப்பட்ட நிலை: தேதி மற்றும் செயல்திறன் ரேப்பர்களுடன் ஒத்துப்போகும் நேர முத்திரைகளின் நேர துல்லியத்தை நீட்டிப்பு மாற்றியமைக்கிறது, மேலும் கூடுதலாக, தற்போதைய நிலையின் துல்லியத்தை மீட்டர், கிலோமீட்டர், பல்லாயிரக்கணக்கான அல்லது கிலோமீட்டர் வேட்டையாடல்களைக் கட்டுப்படுத்த அனுமதிக்கிறது.

source: When modifying position:
ta: நிலையை மாற்றும்போது:

source: Repeated calls of `navigator.geolocation.getCurrentPosition()` return the same position without page load and typically return another position after page reload.
ta: `Navigator.geolocation.getCurrentPosition () இன் தொடர்ச்சியான அழைப்புகள் பக்க சுமை இல்லாமல் அதே நிலையைத் திருப்பி, பக்க மறுஏற்றத்திற்குப் பிறகு பொதுவாக மற்றொரு நிலையைத் தரவும்.

source: `navigator.geolocation.watchPosition()` does not change position.
ta: `navigator.geolocation.watchPosition ()` நிலையை மாற்றாது.

source: Title: Gamepad Filename: ../common/wrappingS-GP.js
ta: தலைப்பு: கேம்பேட் கோப்பு பெயர்: ../common/wrappings-gp.js

source: navigator.getGamepads() allows any page script to learn the gamepads connected to the computer if the feature is not blocked by the Feature-Policy.
ta: அம்சம்-கொள்கை மூலம் நற்பொருத்தம் தடுக்கப்படாவிட்டால், கணினியுடன் இணைக்கப்பட்ட கேம்பேட்களைக் கற்றுக்கொள்ள எந்த பக்க ச்கிரிப்டையும் Navigator.getGamePads () அனுமதிக்கிறது.

source: The "Fingerprinting the Fingerprinters" paper (see reference below) observed that the interface is used in the wild to fingerprint users. As it is likely that only a minority of users have a gamepad connected and the API provides additional information on the HW, it is likely that users with a gamepad connected are easily fingerprintable.
ta: கைரேகை பயனர்களுக்கு இடைமுகம் காடுகளில் பயன்படுத்தப்படுவதைக் கண்டறிந்த "கைரேகைகளை கைரேகை" காகிதம் (கீழே உள்ள குறிப்பைக் காண்க) கவனித்தது. சிறுபான்மை பயனர்களில் மட்டுமே கேம்பேட் இணைக்கப்பட்டிருக்கலாம் மற்றும் பநிஇ HW இல் கூடுதல் தகவல்களை வழங்குவதால், கேம்பேட் இணைக்கப்பட்ட பயனர்கள் எளிதில் கைரேகையாக இருக்கக்கூடும்.

source: As we expect that the majority of the users does not have a gamepad connected, we provide only a single mitigation - the wrapped APIs return an empty list.
ta: பெரும்பான்மையான பயனர்களுக்கு கேம்பேட் இணைக்கப்படவில்லை என்று நாங்கள் எதிர்பார்ப்பது போல, நாங்கள் ஒரு தணிப்பை மட்டுமே வழங்குகிறோம் - போர்த்தப்பட்ட பநிஇ கள் வெற்று பட்டியலைத் தருகின்றன.

source: **Known bug**: The standard provides an event `gamepadconnected` and `gamepaddisconnected` that fires at least on the window object. We do not mitigate the event to fire and consequently, it is possible that an adversary can learn that a gamepad was (dis)connected but there was no change in the result of the `navigator.getGamepads()` API.
ta: ** அறியப்பட்ட பிழை **: தரநிலை `கேம்பேட் கனெக்ட்` மற்றும்` கேம்பாட் டிச்க்னெக்ட்` ஒரு நிகழ்வை வழங்குகிறது, இது சாளர பொருளில் குறைந்தபட்சம் சுடும். இந்த நிகழ்வை நாங்கள் தீப்பிடிப்பதைத் தணிக்கவில்லை, இதன் விளைவாக, ஒரு கேம்பேட் (டிச்) இணைக்கப்பட்டிருப்பதை ஒரு எதிரி அறிய முடியும், ஆனால் `navigator.getgamepads ()` பநிஇ இன் விளைவாக எந்த மாற்றமும் இல்லை.

source: The gamepad representing object carries a timestamp of the last change of the gamepad. As we allow wrapping of several ways to obtain timestamps, we need to provide the same precision for the Gamepad object.
ta: பொருளைக் குறிக்கும் கேம்பேட் கேம்பேடின் கடைசி மாற்றத்தின் நேர முத்திரையைக் கொண்டுள்ளது. நேர முத்திரைகளைப் பெறுவதற்கு பல வழிகளை மடக்குவதை நாங்கள் அனுமதிக்கும்போது, ​​கேம்பேட் பொருளுக்கும் அதே துல்லியத்தை வழங்க வேண்டும்.

source: \see U. Iqbal, S. Englehardt and Z. Shafiq, [Fingerprinting the Fingerprinters: Learning to Detect Browser Fingerprinting Behaviors](https://github.com/uiowa-irl/FP-Inspector/blob/master/Data/potential_fingerprinting_APIs.md) in 2021 2021 IEEE Symposium on Security and Privacy (SP), San Francisco, CA, US, 2021 pp. 283-301
ta: உ யு. இக்பால், எச். .எம்டி) 2021 2021 இல் பாதுகாப்பு மற்றும் தனியுரிமை பற்றிய IEEE சிம்போசியம் (SP), சான் பிரான்சிச்கோ, CA, யு.எச்., 2021 பக். 283-301

source: Title: HTML Canvas Filename: ../common/wrappingS-H-C.js
ta: தலைப்பு: உஉகுமொ கேன்வாச் கோப்பு பெயர்: ../common/wrappings-c.js

source: This file contains wrappers for calls related to the Canvas API, about which you can read more at MDN:
ta: இந்த கோப்பில் கேன்வாச் பநிஇ தொடர்பான அழைப்புகளுக்கான ரேப்பர்கள் உள்ளன, அதைப் பற்றி நீங்கள் எம்.டி.என் இல் மேலும் படிக்கலாம்:

source: The goal is to prevent fingerprinting by modifying the values that can be read from the canvas. So the visual content of wrapped canvases as displayed on the screen is the same as intended.
ta: கேன்வாசிலிருந்து படிக்கக்கூடிய மதிப்புகளை மாற்றியமைப்பதன் மூலம் கைரேகையைத் தடுப்பதே குறிக்கோள். எனவே திரையில் காட்டப்பட்டுள்ளபடி மூடப்பட்ட கேன்வாச்களின் காட்சி உள்ளடக்கம் நோக்கம் கொண்டது.

source: The modified content can be either an empty image or a fake image that is modified according to session and domain keys to be different than the original albeit very similar (i.e. the approach inspired by the algorithms created by [Brave Software](https://brave.com) available [here](https://github.com/brave/brave-core/blob/master/chromium_src/third_party/blink/renderer/core/execution_context/execution_context.cc).
ta: மாற்றியமைக்கப்பட்ட உள்ளடக்கம் ஒரு வெற்று படமாக இருக்கலாம் அல்லது அமர்வு மற்றும் டொமைன் விசைகள் படி மாற்றியமைக்கப்பட்ட போலி படமாக இருக்கலாம், அசலை விட வித்தியாசமாக இருக்கும் (அதாவது [துணிச்சலான மென்பொருள்] உருவாக்கிய வழிமுறைகளால் ஈர்க்கப்பட்ட அணுகுமுறை (https: // பிரேவ்.காம்) கிடைக்கிறது [இங்கே] (https://github.com/brave/brave-core/blob/master/chromium_src/third_party/blink/renderer/core/execution_context/execution_context.cc).

source: Note that both approaches are detectable by a fingerprinter that checks if a predetermined image inserted to the canvas is the same as the read one, see [here](https://arkenfox.github.io/TZP/tests/canvasnoise.html) for an example, Nevertheless, the aim of the wrappers is to limit the finerprintability.
ta: இரண்டு அணுகுமுறைகளும் ஒரு கைரேகை மூலம் கண்டறியப்படுகின்றன என்பதை நினைவில் கொள்க, இது கேன்வாசில் செருகப்பட்ட ஒரு முன்னரே தீர்மானிக்கப்பட்ட படம் படிக்க ஒன்றைப் போலவே இருந்தால், [இங்கே] பார்க்க ஒரு எடுத்துக்காட்டுக்கு, ஆயினும்கூட, ரேப்பர்களின் நோக்கம் மிகச்சிறந்த அச்சுப்பொறியைக் கட்டுப்படுத்துவதாகும்.

source: Also note that a determined fingerprinter can reveal the modifications and consequently uncover the original image. This can be avoided with the approach that completely clears the data stored in the canvas. Use the modifications based on session and domain keys if you want to provide an image that is similar to the original or if you want to produce a fake image that is not obviously spoofed to a naked eye. Otherwise, use the clearing approach.
ta: ஒரு தீர்மானிக்கப்பட்ட கைரேகை மாற்றங்களை வெளிப்படுத்தலாம், இதன் விளைவாக அசல் படத்தை கண்டறிய முடியும் என்பதையும் நினைவில் கொள்க. கேன்வாசில் சேமிக்கப்பட்ட தரவை முற்றிலுமாக அழிக்கும் அணுகுமுறையுடன் இதைத் தவிர்க்கலாம். அசல் போன்ற ஒரு படத்தை நீங்கள் வழங்க விரும்பினால் அல்லது ஒரு நிர்வாணக் கண்ணுக்கு வெளிப்படையாக ஏமாற்றப்படாத ஒரு போலி படத்தை உருவாக்க விரும்பினால் அமர்வு மற்றும் டொமைன் விசைகளின் அடிப்படையில் மாற்றங்களைப் பயன்படுத்தவும். இல்லையெனில், தீர்வு அணுகுமுறையைப் பயன்படுத்தவும்.

source: Title: HTML Performance Filename: ../common/wrappingS-HRT.js
ta: தலைப்பு: உஉகுமொ செயல்திறன் கோப்பு பெயர்: ../common/wrappings-hrt.js

source: This wrapper aims on prevention of microarchitectural attacks, clock-skew attacks, and other time related attacks. The goal is to limit the precision of the time returned by the Performance API.
ta: இந்த ரேப்பர் மைக்ரோஆர்கிடெக்சரல் தாக்குதல்கள், கடிகாரத்தைத் துடைக்கும் தாக்குதல்கள் மற்றும் பிற நேர தொடர்பான தாக்குதல்களைத் தடுப்பதை நோக்கமாகக் கொண்டுள்ளது. செயல்திறன் பநிஇ திரும்பிய நேரத்தின் துல்லியத்தை மட்டுப்படுத்துவதே குறிக்கோள்.

source: \see https://www.fit.vut.cz/study/thesis/22308/?year=0&sup=Pol%C4%8D%C3%A1k, especially Sect. 7.2.
ta: Ht ஐப் பார்க்கவும் https://www.fit.vut.cz/study/tizes/22308/?year=0&sup=pol%C4%8D%C3%A1K, குறிப்பாக பிரிவு. 7.2.
