Repository: 247i/TACETr
Catalog: உரை/தானி/jshelter-website-wrappers-*.po
Languages: ta

source: \see Tom Van Goethem, Wouter Joosen, Nick Nikiforakis. The Clock is Still Ticking: Timing Attacks in the Modern Web. CCS'15. DOI: http://dx.doi.org/10.1145/2810103.2813632. https://lirias.kuleuven.be/retrieve/389086
ta: Tom டாம் வான் கோத்தெம், வூட்டர் சூசென், நிக் நிகிஃபோராகிச். கடிகாரம் இன்னும் துடிக்கிறது: நவீன வலையில் நேர தாக்குதல்கள். CCS'15. Doi: http://dx.doi.org/10.1145/2810103.2813632. https://lirias.kuleuven.be/retrieve/389086

source: Title: HTML multimedia Filename: ../common/wrappingS-HTML5.js
ta: தலைப்பு: உஉகுமொ மல்டிமீடியா கோப்பு பெயர்: ../common/wrappings-html5.js

source: Supported codecs (multimedia media types) can be misued for fingerprinting, see for example the [FPMon paper](https://fpmon.github.io/fingerprinting-monitor/files/FPMON.pdf).
ta: உதவி கோடெக்குகள் (மல்டிமீடியா மீடியா வகைகள்) கைரேகைக்கு தவறாகப் பயன்படுத்தப்படலாம், எடுத்துக்காட்டாக [FPM காகிதத்தில்] (https://fpmon.github.io/fingerprinting-monitor/files/fpmon.pdf) ஐப் பார்க்கவும்.

source: JShelter provides two modes of protection:
ta: JShelter இரண்டு பாதுகாப்பு முறைகளை வழங்குகிறது:

source: Strict approach returns all media types as not supported.
ta: கடுமையான அணுகுமுறை அனைத்து ஊடக வகைகளையும் ஆதரிக்காதபடி வழங்குகிறது.

source: Modifies the output of probably/maybe supported codecs.
ta: அநேகமாக/ஒருவேளை ஆதரிக்கப்பட்ட கோடெக்குகளின் வெளியீட்டை மாற்றியமைக்கிறது.

source: Title: HTML Workers Filename: ../common/wrappingS-HTML-LS.js
ta: தலைப்பு: உஉகுமொ தொழிலாளர்கள் கோப்பு பெயர்: ../common/wrappings-html-ls.js

source: This wrapper aims on prevention of microarchitectural attacks. This code was originally a part of [ChromeZero](https://github.com/IAIK/ChromeZero).
ta: இந்த ரேப்பர் மைக்ரோஆர்கிடெக்சரல் தாக்குதல்களைத் தடுப்பதை நோக்கமாகக் கொண்டுள்ளது. இந்த குறியீடு முதலில் [Chromezero] (https://github.com/iaik/chromezero) இன் ஒரு பகுதியாக இருந்தது.

source: Polyfill: Completely eliminates the paralelism.
ta: பாலிஃபில்: இணையான தன்மையை முற்றிலுமாக நீக்குகிறது.

source: Randomly slow messages: Add noise to the `postMessage` method execution.
ta: தோராயமாக மெதுவான செய்திகள்: `போச்ட்மெசேச்` முறை செயலாக்கத்தில் ஒலி சேர்க்கவும்.

source: \see Lipp, M., Gruss, D., Schwarz, M., Bidner, D., Maurice, C. et al. Practical Keystroke Timing Attacks in Sandboxed JavaScript. In:. August 2017, s. 191–209. ISBN 978-3-319-66398-2.
ta: Lip லிப், எம்., க்ரச், டி., ச்வார்ச், எம்., பிட்னர், டி., மாரிச், சி. மற்றும் பலர் பார்க்கவும். சாண்ட்பாக்ச் செய்யப்பட்ட சாவாச்கிரிப்டில் நடைமுறை கீச்ட்ரோக் நேர தாக்குதல்கள். இல்:. ஆகச்ட் 2017, கள். 191-209. ஐ.எச்.பி.என் 978-3-319-66398-2.

source: \see <https://www.fit.vut.cz/study/thesis/22374/?year=0&sup=Pol%C4%8D%C3%A1k>
ta: \ பார்க்க <https://www.fit.vut.cz/study/tizes/22374/?year=0&sup=pol%C4%8D%C3%A1K> ஐப் பார்க்கவும்

source: Title: HTML window name Filename: ../common/wrappingS-HTML.js
ta: தலைப்பு: உஉகுமொ சாளர பெயர் கோப்பு பெயர்: ../common/wrappings-html.js

source: `window.name` provides a simple cross-origin tracking method of the same tab:
ta: `சாளரம்.நாம்` அதே தாவலின் எளிய குறுக்கு-தோற்றம் கண்காணிப்பு முறையை வழங்குகிறது:

source: Go to completely different web site and window.name stays the same.
ta: முற்றிலும் மாறுபட்ட வலைத்தளம் மற்றும் சாளரத்திற்குச் செல்லுங்கள். பெயர் அப்படியே இருக்கும்.

source: \see https://2019.www.torproject.org/projects/torbrowser/design/ provides a library build on top of `window.name`: https://www.thomasfrank.se/sessionvars.html.
ta: Ht ஐப் பார்க்கவும் https://2019.www.torproject.org/projects/torbrowser/design/ `சாளரத்தின் மேல் ஒரு நூலகத்தை உருவாக்குகிறது.

source: \see https://html.spec.whatwg.org/#history-traversal; this feature should not be ncessary for Firefox 86 or newer https://bugzilla.mozilla.org/show_bug.cgi?id=444222.
ta: The https://html.spec.whatwg.org/#history-traversal ஐக் காண்க; இந்த நற்பொருத்தம் பயர்பாக்ச் 86 அல்லது புதிய https://bugzilla.mozilla.org/show_bug.cgi?id=444222 க்கு மிகச்சிறந்ததாக இருக்கக்கூடாது.

source: Title: Idle detection Filename: ../common/wrappingS-IDLE.js
ta: தலைப்பு: செயலற்ற கண்டறிதல் கோப்பு பெயர்: ../common/wrappings-idle.js

source: \see https://web.dev/idle-detection/ \see https://developer.mozilla.org/en-US/docs/Web/API/IdleDetector
ta: The https://web.dev/idle-detection/ ஐப் பார்க்கவும் https://developer.mozilla.org/en-us/docs/web/api/idledetector ஐப் பார்க்கவும்

source: The Idle Detection API can detect inactive users and locked screens. JShelter either removes the API (IdleDetector), or disables permission requests and returns user activity and unlocked screen (for previously granted permissions), or just always report user activity and unlocked screen.
ta: செயலற்ற கண்டறிதல் பநிஇ செயலற்ற பயனர்களையும் பூட்டப்பட்ட திரைகளையும் கண்டறிய முடியும். JSHELTER பநிஇ (idlededector) ஐ நீக்குகிறது, அல்லது இசைவு கோரிக்கைகளை முடக்குகிறது மற்றும் பயனர் செயல்பாடு மற்றும் திறக்கப்பட்ட திரையை (முன்னர் வழங்கப்பட்ட அனுமதிகளுக்கு) வழங்குகிறது, அல்லது எப்போதும் பயனர் செயல்பாடு மற்றும் திறக்கப்படாத திரையைப் புகாரளிக்கிறது.

source: Title: Media devices Filename: ../common/wrappingS-MCS.js
ta: தலைப்பு: மீடியா சாதனங்கள் கோப்பு பெயர்: ../common/wrappings-mcs.js

source: This file contains wrapper for MediaDevices.enumerateDevices https://developer.mozilla.org/en-US/docs/Web/API/MediaDevices/enumerateDevices
ta: இந்த கோப்பில் மீடியா டிவிச்களுக்கான ரேப்பர் உள்ளது

source: The goal is to prevent fingerprinting by modifying return value of enumerateDevices.
ta: கணக்கிடப்படங்களின் வருவாய் மதிப்பை மாற்றியமைப்பதன் மூலம் கைரேகையைத் தடுப்பதே குறிக்கோள்.

source: (0) - return promise with shuffled array
ta: (0) - மாற்றப்பட்ட வரிசையுடன் வாக்குறுதியைத் திரும்புக

source: (1) - return promise with shuffled array with additional 0-4 fake devices
ta: (1) - கூடுதல் 0-4 போலி சாதனங்களுடன் மாற்றப்பட்ட வரிசையுடன் வாக்குறுதியைத் தரவும்

source: (2) - return empty promise
ta: (2) - வெற்று வாக்குறுதியைத் தரவும்

source: The shuffling approach is inspired by the algorithms created by [Brave Software](https://brave.com) available [here](https://github.com/brave/brave-core/blob/master/chromium_src/third_party/blink/renderer/modules/mediastream/media_devices.cc).
ta: [துணிச்சலான மென்பொருள்] (https://brave.com) உருவாக்கிய வழிமுறைகளால் கலக்குதல் அணுகுமுறை ஈர்க்கப்பட்டுள்ளது [இங்கே] பிளிங்க்/ரெண்டரர்/தொகுதிகள்/மீடியாச்ட்ரீம்/மீடியா_டெவிச்.சிசி).

source: Title: Media capabilities Filename: ../common/wrappingS-MEDIA-CAPABILITIES.js
ta: தலைப்பு: ஊடக திறன்கள் கோப்பு பெயர்: ..

source: `` provides access to `MediaKeySystemAccess` object that allows to query supported codecs and other informations about the system.
ta: `` `மீடியா கேச் சிச்டம்அக்சச்` பொருளுக்கான அணுகலை வழங்குகிறது, இது ஆதரிக்கப்படும் கோடெக்குகள் மற்றும் கணினியைப் பற்றிய பிற தகவல்களை வினவ அனுமதிக்கிறது.

source: \see https://w3c.github.io/media-capabilities/
ta: The https://w3c.github.io/media-capapapities/ ஐப் பார்க்கவும்

source: Farbling approach changes the output to a non-existing codec with 12.5% probability.
ta: ஃபர்ப்ளிங் அணுகுமுறை வெளியீட்டை 12.5% ​​நிகழ்தகவுடன் இல்லாத கோடெக் ஆக மாற்றுகிறது.

source: Title: Network information Filename: ../common/wrappingS-NET.js
ta: தலைப்பு: பிணைய செய்தி கோப்பு பெயர்: ../common/wrappings-net.js

source: This file contains a wrapper for [NetworkInformation](https://developer.mozilla.org/en-US/docs/Web/API/NetworkInformation#specifications).
ta: இந்த கோப்பில் [நெட்வொர்க் இன்ஃப்ளேசன்] (https://developer.mozilla.org/en-us/docs/web/api/networkinformation#specifications க்கு ஒரு ரேப்பர் உள்ளது.

source: NetworkInformation allows sites to learn about local network conditions by querying `navigator.connection`. Fingerprinters can misuse the feature. Long-term observers may learn about traveling patterns through observation of repeated values (for example a network at work, home, travel, etc.).
ta: `Navigator.connection` ஐ வினவுவதன் மூலம் உள்ளக பிணைய நிலைமைகளைப் பற்றி அறிய பிணையம் இன்ஃப்ளேசன் தளங்களை அனுமதிக்கிறது. கைரேகைகள் அம்சத்தை தவறாகப் பயன்படுத்தலாம். நீண்டகால பார்வையாளர்கள் மீண்டும் மீண்டும் மதிப்புகளைக் கவனிப்பதன் மூலம் பயண முறைகளைப் பற்றி அறிந்து கொள்ளலாம் (எடுத்துக்காட்டாக வேலை, வீடு, பயணம் போன்றவை).

source: We implement the same protection as Brave: https://github.com/brave/brave-browser/issues/20122.
ta: துணிச்சலான அதே பாதுகாப்பை நாங்கள் செயல்படுத்துகிறோம்: https://github.com/brave/brave-browser/issues/20122.

source: Title: Web NFC Filename: ../common/wrappingS-NFC.js
ta: தலைப்பு: வலை NFC கோப்பு பெயர்: ../common/wrappings-nfc.js

source: This file contains a wrapper for [Web NFC API](https://developer.mozilla.org/en-US/docs/Web/API/Web_NFC_API).
ta: இந்த கோப்பில் [வலை NFC API] (https://developer.mozilla.org/en-us/docs/web/api/web_nfc_api) க்கான ரேப்பர் உள்ளது.

source: This API is not broadly supported and we just disable all objects.
ta: இந்த பநிஇ பரவலாக ஆதரிக்கப்படவில்லை, நாங்கள் எல்லா பொருட்களையும் முடக்குகிறோம்.

source: Title: Navigator Plugins Filename: ../common/wrappingS-NP.js
ta: தலைப்பு: நேவிகேட்டர் சொருகி கோப்பு பெயர்: ../common/wrapping-npmjs

source: This file contains wrappers for NavigatorPlugins. See the MDN docs on the [plugins](https://developer.mozilla.org/en-US/docs/Web/API/NavigatorPlugins/plugins) and [MIME types](https://developer.mozilla.org/en-US/docs/Web/API/NavigatorPlugins/mimeTypes).
ta: இந்த கோப்பில் நேவிகேட்டர் பிளகின்சிற்கான ரேப்பர்கள் உள்ளன. [செருகுநிரல்கள்] (https://developer.mozilla.org/en-us/docs/web/api/navigatorplugins/plugins) மற்றும் [Mime வகைகள்] (https://developer.mozilla.org/ en-us/docs/web/api/navigatorplugins/mimetypes).

source: The goal is to prevent fingerprinting by modifying value returned by getters navigator.plugins and navigator.mimeTypes
ta: Getters navigator.plugins மற்றும் navigator.mimetypes ஆல் வழங்கப்பட்ட மதிப்பை மாற்றியமைப்பதன் மூலம் கைரேகையைத் தடுப்பதே குறிக்கோள்.

source: (0) - replace by shuffled edited PluginArray with two added fake plugins, edited MimeTypeArray
ta: (0) - மாற்றவும் by shuffled edited PluginArray with two added fake plugins, edited MimeTypeArray

source: (1) - replace by shuffled PluginArray with two fake plugins, empty MimeTypeArray
ta: (1) - இரண்டு போலி செருகுநிரல்களுடன் மாற்றப்பட்ட செருகுநிரல் மூலம் மாற்றவும்

source: (2) - replace by empty PluginArray and MimeTypeArray
ta: (2) - வெற்று செருகுநிரல் மற்றும் மைமெட்டிபேரே மூலம் மாற்றவும்

source: These approaches are inspired by the algorithms created by [Brave Software](https://brave.com) available [here](https://github.com/brave/brave-core/blob/master/chromium_src/third_party/blink/renderer/modules/plugins/dom_plugin_array.cc).
ta: இந்த அணுகுமுறைகள் [துணிச்சலான மென்பொருள்] (https://brave.com) உருவாக்கிய வழிமுறைகளால் ஈர்க்கப்பட்டுள்ளன [இங்கே] /renderer/modules/plugins/dom_plugin_array.cc).

source: The purpose of the wrappers is solely to prevent fingerprinting. However, browsers modyfing the array stand out of the crowd, which makes them more fingerprintable. Consequently, JShelter does not modify an empty list. So no matter the configuration, an empty list is not populated by the wrappers.
ta: ரேப்பர்களின் நோக்கம் கைரேகையைத் தடுப்பதே மட்டுமே. இருப்பினும், உலாவிகள் கூட்டத்திலிருந்து நிற்கும் வரிசையை மோடிஃபிங் செய்வது, இது அவர்களை கைரேகமாக்குகிறது. இதன் விளைவாக, JShelter ஒரு வெற்று பட்டியலை மாற்றாது. எனவே உள்ளமைவைப் பொருட்படுத்தாமல், வெற்று பட்டியல் ரேப்பர்களால் மக்கள் தொகை இல்லை.

source: If PDF inline viewing is supported, Firefox returns 5 plugins:
ta: PDF இன்லைன் பார்வை ஆதரிக்கப்பட்டால், பயர்பாக்ச் 5 செருகுநிரல்களை வழங்குகிறது:

source: "PDF Viewer"
ta: "பி.டி.எஃப் பார்வையாளர்"

source: "Chrome PDF Viewer"
ta: "குரோம் பி.டி.எஃப் பார்வையாளர்"

source: "Chromium PDF Viewer"
ta: "குரோமியம் பி.டி.எஃப் பார்வையாளர்"

source: "Microsoft Edge PDF Viewer"
ta: "நுண்மென் எட்ச் பி.டி.எஃப் பார்வையாளர்"

source: "WebKit built-in PDF"
ta: "வெப்கிட் உள்ளமைக்கப்பட்ட பி.டி.எஃப்"

source: A list containing exactly these plugins is treated as the empty list and it is not modified.
ta: இந்த செருகுநிரல்களைக் கொண்ட பட்டியல் வெற்று பட்டியலாகக் கருதப்படுகிறது, அது மாற்றியமைக்கப்படவில்லை.

source: Title: Performance Timeline (L2) Filename: ../common/wrappingS-PT2.js
ta: தலைப்பு: செயல்திறன் காலவரிசை (எல் 2) கோப்பு பெயர்: ../common/wrappings-pt2.js

source: This wrapper aims on prevention of microarchitectural attacks, clock-skew attacks, and other time related attacks. The goal is to limit the precision of the time returned by the Performance Timeline API.
ta: இந்த ரேப்பர் மைக்ரோஆர்கிடெக்சரல் தாக்குதல்கள், கடிகாரத்தைத் துடைக்கும் தாக்குதல்கள் மற்றும் பிற நேர தொடர்பான தாக்குதல்களைத் தடுப்பதை நோக்கமாகக் கொண்டுள்ளது. செயல்திறன் காலவரிசை பநிஇ ஆல் திரும்பிய நேரத்தின் துல்லியத்தை மட்டுப்படுத்துவதே குறிக்கோள்.

source: Title: Accelerometer Filename: ../common/wrappingS-SENSOR-ACCELEROMETER.js
ta: தலைப்பு: முடுக்கமானி கோப்பு பெயர்: ..

source: MOTIVATION Readings from the Accelerometer, LinearAccelerationSensor, and GravitySensor of the Generic Sensor API should be secured as they provide a potentially valuable data for creating fingerprints. There are multiple options. A unique fingerprint can be obtained by describing the device's vibrations (See https://link.springer.com/chapter/10.1007/978-3-319-30806-7_7). Using trajectory inference and matching of the model to map data, one may use the readings from the Accelerometer to determing the device's position (See https://www.researchgate.net/publication/220990763_ACComplice_Location_ inference_using_accelerometers_on_smartphones).
ta: கைரேகைகளை உருவாக்குவதற்கான மதிப்புமிக்க தரவை வழங்குவதால், முடுக்கமானி, லீனியர்அக்செலரேசன்ச் சென்சார் மற்றும் கிரேட்டர்சென்சர் ஆகியவற்றிலிருந்து உந்துதல் அளவீடுகள் பாதுகாக்கப்பட வேண்டும். பல விருப்பங்கள் உள்ளன. சாதனத்தின் அதிர்வுகளை விவரிப்பதன் மூலம் ஒரு தனித்துவமான கைரேகையைப் பெறலாம் (https://link.springer.com/chapter/10.1007/978-3-319-30806-7_7 ஐப் பார்க்கவும்). தரவை வரைபடமாக்குவதற்கு மாதிரியின் பாதை அனுமானம் மற்றும் பொருத்தத்தைப் பயன்படுத்தி, சாதனத்தின் நிலையைத் தடுப்பதற்கு முடுக்கமானியிலிருந்து வாசிப்புகளைப் பயன்படுத்தலாம் (https://www.researchgate.net/publication/220990763_accomplice_location_usering_usingelerometers_smartphoces).

source: WRAPPING The wrapper replaces the "XYZ" getters of the Accelerometer sensor, LinearAccelerationSensor, and GravitySensor. The wrapping's goal is to simulate a stationary device that is lying bottom down on a flat surface, e.g., a cell phone on the table. In such a case, only the `z` axis is affected by gravity. The `x` and `y` axes values should be set to zero. Yet, there could be vibrations that may change values a little bit, e.g., to spin around -0.1 to +0.1. This usually does not happed with every reading but only in intervals of seconds. And thus, after a few seconds we pseudo-randomly change these values. For the LinearAccelerationSensor, the returned values should represent the acceleration without the conribution of gravity. For stationary devices, the `x` and `y` are zeroes, while the 'z' portion fluctuates between 0 and 0.1 on the examined devices. The wrapper simulates the same behavior. Lastly, the GravitySensor's readings are calculated as the difference between the previous two.
ta: ரேப்பரை மடக்குவது முடுக்கமானி சென்சார், லீனியர்அக்செலரேசன்ச் சென்சார் மற்றும் ஈர்ப்பு சென்சரின் "XYZ" பெறுநர்களை மாற்றுகிறது. ஒரு தட்டையான மேற்பரப்பில் கீழே கிடந்த ஒரு நிலையான சாதனத்தை உருவகப்படுத்துவதே மடக்குதலின் குறிக்கோள், எ.கா., அட்டவணையில் ஒரு செல்போன். அத்தகைய சந்தர்ப்பத்தில், `Z` அச்சு மட்டுமே ஈர்ப்பு விசையால் பாதிக்கப்படுகிறது. `X` மற்றும்` y` அச்சுகள் மதிப்புகள் பூச்சியமாக அமைக்கப்பட வேண்டும். ஆயினும்கூட, -0.1 முதல் +0.1 வரை சுழல, எ.கா., மதிப்புகளை சிறிது மாற்றக்கூடிய அதிர்வுகள் இருக்கலாம். இது வழக்கமாக ஒவ்வொரு வாசிப்பிலும் மகிழ்ச்சியாக இல்லை, ஆனால் விநாடிகளின் இடைவெளியில் மட்டுமே. இதனால், சில நொடிகளுக்குப் பிறகு, இந்த மதிப்புகளை போலி-சீரற்ற முறையில் மாற்றுகிறோம். லீனியர்அக்செலரேசன்ச் சென்சரைப் பொறுத்தவரை, திரும்பிய மதிப்புகள் ஈர்ப்பு விசையின்றி முடுக்கம் குறிக்க வேண்டும். நிலையான சாதனங்களுக்கு, `x` மற்றும்` y` ஆகியவை பூச்சியங்கள், அதே நேரத்தில் 'சட்' பகுதி ஆய்வு செய்யப்பட்ட சாதனங்களில் 0 முதல் 0.1 வரை மாறுபடுகிறது. ரேப்பர் அதே நடத்தையை உருவகப்படுத்துகிறது. கடைசியாக, கிராஃப்ட்சென்சரின் வாசிப்புகள் முந்தைய இரண்டிற்கும் இடையிலான வித்தியாசமாக கணக்கிடப்படுகின்றன.

source: POSSIBLE IMPROVEMENTS Currently, we assume te device is lying on a flat surface bottom down, and thus only the `z` is affected by gravity. As improvement, we can also assume the device is in an oblique position. In this case, the gravitational acceleration would affect two or three axes. Those will have to be updated properly to create a realistic behavior.
ta: சாத்தியமான மேம்பாடுகள் தற்போது, ​​TE சாதனம் ஒரு தட்டையான மேற்பரப்பில் கீழே கிடந்ததாக நாங்கள் கருதுகிறோம், இதனால் `Z` மட்டுமே ஈர்ப்பு விசையால் பாதிக்கப்படுகிறது. முன்னேற்றமாக, சாதனம் ஒரு சாய்ந்த நிலையில் இருப்பதாகவும் நாம் கருதலாம். இந்த வழக்கில், ஈர்ப்பு முடுக்கம் இரண்டு அல்லது மூன்று அச்சுகளை பாதிக்கும். ஒரு யதார்த்தமான நடத்தையை உருவாக்க அவை சரியாக புதுப்பிக்கப்பட வேண்டும்.

source: Title: Accelerometer Filename: ../common/wrappingS-SENSOR-ACCEL.js
ta: தலைப்பு: முடுக்கமானி கோப்பு பெயர்: ../common/wrappings-sensor-accel.js

source: MOTIVATION Readings from the Accelerometer, LinearAccelerationSensor, and GravitySensor of the Generic Sensor API should be secured as they provide a potentially valuable data for creating fingerprints. There are multiple options. A unique fingerprint can be obtained by describing the device's vibrations (See https://link.springer.com/chapter/10.1007/978-3-319-30806-7_7). Using trajectory inference and matching of the model to map data, one may use the readings from the Accelerometer to determing the device's position (See https://www.researchgate.net/publication/220990763_ACComplice_Location_ inference_using_accelerometers_on_smartphones). Accelerometer readings can also be used for determining human walking patterns (See https://www.researchgate.net/publication/322835708_Classifying_Human_ Walking_Patterns_using_Accelerometer_Data_from_Smartphone).
ta: கைரேகைகளை உருவாக்குவதற்கான மதிப்புமிக்க தரவை வழங்குவதால், முடுக்கமானி, லீனியர்அக்செலரேசன்ச் சென்சார் மற்றும் கிரேட்டர்சென்சர் ஆகியவற்றிலிருந்து உந்துதல் அளவீடுகள் பாதுகாக்கப்பட வேண்டும். பல விருப்பங்கள் உள்ளன. சாதனத்தின் அதிர்வுகளை விவரிப்பதன் மூலம் ஒரு தனித்துவமான கைரேகையைப் பெறலாம் (https://link.springer.com/chapter/10.1007/978-3-319-30806-7_7 ஐப் பார்க்கவும்). தரவை வரைபடமாக்குவதற்கு மாதிரியின் பாதை அனுமானம் மற்றும் பொருத்தத்தைப் பயன்படுத்தி, சாதனத்தின் நிலையைத் தடுப்பதற்கு முடுக்கமானியிலிருந்து வாசிப்புகளைப் பயன்படுத்தலாம் (https://www.researchgate.net/publication/220990763_accomplice_location_usering_usingelerometers_smartphoces). மனித நடைபயிற்சி முறைகளைத் தீர்மானிக்க முடுக்கமானி அளவீடுகள் பயன்படுத்தப்படலாம் (https://www.researchgate.net/publication/322835708_Classifine_human_ Walking_patterns_using_accelerometer_from_smarthone ஐப் பார்க்கவும்).

source: WRAPPING The wrapper replaces the "XYZ" getters of the Accelerometer sensor, LinearAccelerationSensor, and GravitySensor. The wrapping's goal is to simulate a stationary device that can be possibly rotated. The rotation of the device is represented by the fake rotation matrix "orient.rotMat".
ta: ரேப்பரை மடக்குவது முடுக்கமானி சென்சார், லீனியர்அக்செலரேசன்ச் சென்சார் மற்றும் ஈர்ப்பு சென்சரின் "XYZ" பெறுநர்களை மாற்றுகிறது. சுழலக்கூடிய ஒரு நிலையான சாதனத்தை உருவகப்படுத்துவதே மடக்குதலின் குறிக்கோள். சாதனத்தின் சுழற்சி போலி சுழற்சி மேட்ரிக்ச் "ஓரியண்ட்.ராட்மாட்" ஆல் குறிப்பிடப்படுகிறது.

source: The GravitySensor should provide readings of gravity acceleration applied to the device. This is represented by a vector made of x, y, z portions. To get this faked gravity vector for the device, the reference vector [0, 0, 9.8] is multipled with the rotation matrix. Wrappers for the GravitySensor's getters return x, y, z portions of the fake gravity vector.
ta: கிராஃப்ட்சென்சர் சாதனத்திற்கு பயன்படுத்தப்படும் ஈர்ப்பு முடுக்கம் பற்றிய வாசிப்புகளை வழங்க வேண்டும். இது ஃச், ஒய், சட் பகுதிகளால் ஆன திசையன் மூலம் குறிக்கப்படுகிறது. சாதனத்திற்கான இந்த போலி ஈர்ப்பு திசையனைப் பெற, குறிப்பு திசையன் [0, 0, 9.8] சுழற்சி மேட்ரிக்சுடன் பலப்படுத்தப்பட்டுள்ளது. கிராஃப்ட்சென்சரின் பெறுநர்களுக்கான ரேப்பர்கள் போலி ஈர்ப்பு திசையனின் ஃச், ஒய், சட் பகுதிகளைத் தருகின்றன.

source: Next, the LinearAccelerationSensor should return acceleration values without the contribution of gravity. For a stationary device, it should be all zeroes. Yet, there could be vibrations that may change values a little bit, e.g., spin around -0.1 to +0.1, as seen on the examined devices. This usually does not happed with every reading but only in intervals of seconds. And thus, after a few seconds we pseudo-randomly change these values.
ta: அடுத்து, லீனியர்அக்செலரேசன்ச் சென்சார் ஈர்ப்பு விசையின் பங்களிப்பு இல்லாமல் முடுக்கம் மதிப்புகளைத் தர வேண்டும். ஒரு நிலையான சாதனத்திற்கு, இது அனைத்து பூச்சியங்களாக இருக்க வேண்டும். ஆயினும்கூட, பரிசோதிக்கப்பட்ட சாதனங்களில் காணப்படுவது போல, மதிப்புகளை சிறிது மாற்றக்கூடிய அதிர்வுகள் இருக்கலாம், எ.கா., -0.1 முதல் +0.1 வரை சுழலும். இது வழக்கமாக ஒவ்வொரு வாசிப்பிலும் மகிழ்ச்சியாக இல்லை, ஆனால் விநாடிகளின் இடைவெளியில் மட்டுமே. இதனால், சில நொடிகளுக்குப் பிறகு, இந்த மதிப்புகளை போலி-சீரற்ற முறையில் மாற்றுகிறோம்.

source: Finally, the Accelerometer sensor combines the previous two. Our wrappers thus return tha values from the LinearAccelerationSensor with the fake gravity vector portions added.
ta: இறுதியாக, முடுக்கமானி சென்சார் முந்தைய இரண்டையும் ஒருங்கிணைக்கிறது. எங்கள் ரேப்பர்கள் இவ்வாறு நேரியல் முடுக்கம் சென்சாரிலிருந்து மதிப்புகளை சேர்க்கப்பட்ட போலி ஈர்ப்பு திசையன் பகுதிகளுடன் திருப்பித் தருகின்றன.

source: POSSIBLE IMPROVEMENTS Support for simulation of a non-stationary device where the rotation can change. Currently, the calculation of the gravity vector is done only once by the initDataGenerator() where the reference vector is multiplied with the rotation matrix. If orient.rotMat could change, the dataGen would have to be updated periodically. Moreover, such a change should also be taken into account in wrappers for other movement-related sensors (Gyroscope, etc.).
ta: சுழற்சி மாறக்கூடிய நிலையான அல்லாத சாதனத்தின் உருவகப்படுத்துதலுக்கான சாத்தியமான மேம்பாடுகள் உதவி. தற்போது, ​​ஈர்ப்பு திசையனின் கணக்கீடு ஒரு முறை மட்டுமே initdatagenerator () ஆல் செய்யப்படுகிறது, அங்கு குறிப்பு திசையன் சுழற்சி மேட்ரிக்சுடன் பெருக்கப்படுகிறது. Orient.rotmat மாற முடிந்தால், டேட்டாசன் அவ்வப்போது புதுப்பிக்கப்பட வேண்டும். மேலும், இதுபோன்ற மாற்றம் மற்ற இயக்கம் தொடர்பான சென்சார்களுக்கான (கைரோச்கோப் போன்றவை) ரேப்பர்களில் கணக்கில் எடுத்துக்கொள்ளப்பட வேண்டும்.

source: Title: Gyroscope Filename: ../common/wrappingS-SENSOR-GYRO.js
ta: தலைப்பு: கைரோச்கோப் கோப்பு பெயர்: ../common/wrappings-sensor-gyro.js

source: MOTIVATION Gyroscope readings can be used for speech recognition: https://crypto.stanford.edu/gyrophone/ and various fingerprinting operations. For stationary devices, the resonance of the unique internal or external sounds affects angular velocities affect the Gyroscope and allow to create a fingerprint: https://www.researchgate.net/publication/356678825_Mobile_Device_Fingerprint_Identification_Using_Gyroscope_Resonance For moving devices, one of the options is using the Gyroscope analyze human walking patterns: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7071017/
ta: பேச்சு அங்கீகாரத்திற்கு உந்துதல் கைரோச்கோப் அளவீடுகளைப் பயன்படுத்தலாம்: https://crypto.stanford.edu/gyroboone/ மற்றும் பல்வேறு கைரேகை செயல்பாடுகள். க்கு stationary devices, the ஒத்திசை of the unique internal or external sounds affects கோண velocities affect the Gyroscope and allow பெறுநர் create a fingerprint: https://www.researchgate.net/publication/356678825_Mobile_Device_Fingerprint_Identification_Using_Gyroscope_Resonance க்கு moving devices, one of the விருப்பங்கள் is using the கைரோச்கோப் மனித நடை முறைகளை பகுப்பாய்வு செய்யுங்கள்: https://www.ncbi.nlm.nih.gov/pmc/articles/pmc7071017/
