Repository: 247i/TACETr
Catalog: உரை/தானி/jshelter-website-wrappers-*.po
Languages: ta

source: WRAPPING The Gyroscope sensor provides readings of the angular velocity of the device alongthe x/y/z axes. For a stationary device, all velocities should be zero in an ideal state. As we observed on the examined devices, device sensor imperfections andlittle vibrations cause the `x`, `y` and `z` to oscillate between -0.002 and 0.002 on the examined devices. The wrapper simulates the same behavior.
ta: கைரோச்கோப் சென்சார் மடக்குதல் x/y/z அச்சுகளுடன் சாதனத்தின் கோண வேகத்தின் வாசிப்புகளை வழங்குகிறது. ஒரு நிலையான சாதனத்தைப் பொறுத்தவரை, அனைத்து வேகங்களும் ஒரு சிறந்த நிலையில் பூச்சியமாக இருக்க வேண்டும். பரிசோதிக்கப்பட்ட சாதனங்களில் நாங்கள் கவனித்தபடி, சாதன சென்சார் குறைபாடுகள் மற்றும் சிறிய அதிர்வுகள் `x`,` y` மற்றும் `z` ஆகியவற்றை ஆய்வு செய்யப்பட்ட சாதனங்களில் -0.002 மற்றும் 0.002 க்கு இடையில் ஊசலாடுகின்றன. ரேப்பர் அதே நடத்தையை உருவகப்படுத்துகிறது.

source: POSSIBLE IMPROVEMENTS Support for simulation of a non-stationary device. This would require modifications to other movement-related sensors (Accelerometer, etc.)
ta: நிலையான அல்லாத சாதனத்தின் உருவகப்படுத்துதலுக்கான சாத்தியமான மேம்பாடுகள் உதவி. இதற்கு இயக்கம் தொடர்பான பிற சென்சார்களுக்கு மாற்றங்கள் தேவைப்படும் (முடுக்கமானி, முதலியன)

source: Title: Ambient light sensor Filename: ../common/wrappingS-SENSOR-LIGHT.js
ta: தலைப்பு: சுற்றுப்புற ஒளி சென்சார் கோப்பு பெயர்: ../common/wrappings-sensor-light.js

source: MOTIVATION The AmbientLightSensor returns illuminance of the device's environment. This is another value that describes the nearby physical surrounding of the device, and can thus be used together with other readings for creating a unique fingerprint.
ta: உந்துதல் சுற்றுப்புறக்கிள்சென்சர் சாதனத்தின் சூழலின் வெளிச்சத்தை வழங்குகிறது. இது சாதனத்தின் அருகிலுள்ள உடல் ரீதியான சூழலை விவரிக்கும் மற்றொரு மதிப்பு, இதனால் ஒரு தனித்துவமான கைரேகையை உருவாக்க மற்ற வாசிப்புகளுடன் சேர்ந்து பயன்படுத்தலாம்.

source: WRAPPING On examined stationary devices inside an office, the illuminance measured was between 500 and 900, depending on the concrete position's light conditions. All measured values were rounded to nearest 50 illuminance value. The wrapper silumlates the same behavior. At start, a pseudorandom illuminance value is drawn. As we simulate a stationary device, this value remains constant for all AmbientLightSensor.prototype.illuminance calls.
ta: ஒரு அலுவலகத்திற்குள் பரிசோதிக்கப்பட்ட நிலையான சாதனங்களில் மடக்குதல், அளவிடப்பட்ட வெளிச்சம் 500 முதல் 900 வரை இருந்தது, இது கான்கிரீட் நிலையின் ஒளி நிலைமைகளைப் பொறுத்து இருந்தது. அளவிடப்பட்ட அனைத்து மதிப்புகளும் அருகிலுள்ள 50 ஒளிரும் மதிப்புக்கு வட்டமானவை. ரேப்பர் அதே நடத்தை சிலும்லேட் செய்கிறது. தொடக்கத்தில், ஒரு போலி வெளிச்சம் மதிப்பு வரையப்படுகிறது. ஒரு நிலையான சாதனத்தை நாங்கள் உருவகப்படுத்தும்போது, ​​இந்த மதிப்பு அனைத்து சுற்றுப்புறங்களுக்கு மாறாமல் இருக்கும்.பிராடோடைப்.லுமினன்ச் அழைப்புகள்.

source: POSSIBLE IMPROVEMENTS Simulation of changes in the illuminance.
ta: சாத்தியமான மேம்பாடுகள் வெளிச்சத்தில் ஏற்படும் மாற்றங்களின் உருவகப்படுத்துதல்.

source: Title: Magnet Filename: ../common/wrappingS-SENSOR-MAGNET.js
ta: தலைப்பு: காந்த கோப்பு பெயர்: ../common/wrappings-sensor-magnet.js

source: MOTIVATION
ta: உந்துதல்

source: Magnetometer is a platform sensor available under the Generic Sensor API. Magnetometer measures strength and direction of the magnetic field at device's location. The interface offers sensor readings using three properties: x, y, and z. Each returns a number that describes the magnetic field aroud the particular axis. The numbers have a double precision and can be positive or negative, depending on the orientation of the field. The total strength of the magnetic field (M) can be calculated as M = sqrt(x^2 + z^2 + y^2). The unit is in microtesla (µT).
ta: மேக்னடோமீட்டர் என்பது பொதுவான சென்சார் பநிஇ கீழ் கிடைக்கும் ஒரு இயங்குதள சென்சார் ஆகும். சாதனத்தின் இருப்பிடத்தில் காந்தப்புலத்தின் வலிமையையும் திசையையும் காந்தமானி அளவிடுகிறது. ஃச், ஒய் மற்றும் சட் ஆகிய மூன்று பண்புகளைப் பயன்படுத்தி சென்சார் அளவீடுகளை இடைமுகம் வழங்குகிறது. ஒவ்வொன்றும் காந்தப்புலத்தை விவரிக்கும் ஒரு எண்ணை வழங்குகிறது. எண்கள் இரட்டை துல்லியத்தைக் கொண்டுள்ளன, மேலும் புலத்தின் நோக்குநிலையைப் பொறுத்து நேர்மறை அல்லது எதிர்மறையாக இருக்கலாம். காந்தப்புலத்தின் (மீ) மொத்த வலிமையை m = sqrt (x^2 + z^2 + y^2) என கணக்கிடலாம். அலகு மைக்ரோடெச்லாவில் (µt) உள்ளது.

source: The Earth's magnetic field ranges between approximately 25 and 65 µT. Concrete values depend on location, altitude, weather, interference made by other electric. devices, etc. While we consider it is unlikely that someone determines the precise location of the device from the Mangetometer values, its data can be used for fingerprinting. For instance, it can be determined wheter the device is moving or not. In case of a stationary device, we can make a fingerprint from the device's orientation. Another fingerprintable value is the average total strength of the field, which should remain stable if the device is at the same position and in the same environment.
ta: பூமியின் காந்தப்புலம் தோராயமாக 25 முதல் 65 µt வரை இருக்கும். கான்கிரீட் மதிப்புகள் இருப்பிடம், உயரம், வானிலை, பிற மின்சாரத்தால் செய்யப்பட்ட குறுக்கீடு ஆகியவற்றைப் பொறுத்தது. சாதனங்கள், முதலியன. மங்கெட்டோமீட்டர் மதிப்புகளிலிருந்து சாதனத்தின் துல்லியமான இருப்பிடத்தை யாராவது தீர்மானிப்பது சாத்தியமில்லை என்று நாங்கள் கருதினாலும், அதன் தரவை கைரேகைக்கு பயன்படுத்தலாம். உதாரணமாக, சாதனம் நகரும் அல்லது இல்லை என்பதை தீர்மானிக்க முடியும். ஒரு நிலையான சாதனத்தைப் பொறுத்தவரை, சாதனத்தின் நோக்குநிலையிலிருந்து கைரேகையை உருவாக்கலாம். மற்றொரு கைரேகை மதிப்பு புலத்தின் சராசரி மொத்த வலிமை ஆகும், இது சாதனம் ஒரே நிலையில் இருந்தால் அதே சூழலில் இருந்தால் நிலையானதாக இருக்க வேண்டும்.

source: WRAPPING
ta: மடக்குதல்

source: To protect the device, we are wrapping the x, y, z getters of the `Magnetometer.prototype` object. Instead of using the original data, we use artificially generated values that look like actual sensor readings.
ta: சாதனத்தைப் பாதுகாக்க, `காந்தமானி.பிரோடோடைப்` பொருளின் ஃச், ஒய், சட் பெறுபவர்களை நாங்கள் போர்த்திக் கொண்டிருக்கிறோம். அசல் தரவைப் பயன்படுத்துவதற்குப் பதிலாக, உண்மையான சென்சார் அளவீடுகளைப் போல செயற்கையாக உருவாக்கப்பட்ட மதிப்புகளைப் பயன்படுத்துகிறோம்.

source: At every moment, our wrapper stores information about the previous reading. Each rewrapped getter first checks the `timestamp` value of the sensor object. If there is no difference from the previous reading's timestamp, the wrapper returns the last measured value. Otherwise, it provides a new fake reading.
ta: ஒவ்வொரு தருணத்திலும், எங்கள் ரேப்பர் முந்தைய வாசிப்பு பற்றிய தகவல்களை சேமிக்கிறது. ஒவ்வொரு மாற்றியமைக்கப்பட்ட பெறுநரும் முதலில் சென்சார் பொருளின் `நேர முத்திரை` மதிப்பை சரிபார்க்கிறார். முந்தைய வாசிப்பின் நேர முத்திரையிலிருந்து எந்த வித்தியாசமும் இல்லை என்றால், ரேப்பர் கடைசி அளவிடப்பட்ட மதிப்பை வழங்குகிறது. இல்லையெனில், இது ஒரு புதிய போலி வாசிப்பை வழங்குகிறது.

source: We designed our fake field generator to fulfill the following properties:
ta: பின்வரும் பண்புகளை நிறைவேற்ற எங்கள் போலி புலம் செனரேட்டரை வடிவமைத்தோம்:

source: The randomness of the generator should be high enough to prevent attackers from deducing the sensor values.
ta: தாக்குதல் நடத்தியவர்கள் சென்சார் மதிப்புகளைக் குறைப்பதைத் தடுக்க செனரேட்டரின் சீரற்ற தன்மை போதுமானதாக இருக்க வேண்டும்.

source: Multiple scripts from the same website that access readings with the same timestamp must get the same results. And thus:
ta: ஒரே நேர முத்திரையுடன் வாசிப்புகளை அணுகும் ஒரே வலைத்தளத்திலிருந்து பல ச்கிரிப்ட்கள் ஒரே முடிவுகளைப் பெற வேண்டும். இவ்வாறு:

source: The readings are deterministic - e.g., for a given website and time, we must be able to say what values to return.
ta: வாசிப்புகள் தீர்மானகரமானவை - எ.கா., கொடுக்கப்பட்ட வலைத்தளம் மற்றும் நேரத்திற்கு, என்ன மதிப்புகள் திரும்ப வேண்டும் என்பதை நாம் சொல்ல முடியும்.

source: For every "random" draw, we use the Mulberry32 sen_prng that is seeded with a value generated from the `domainHash` which ensures deterministic behavior for the given website. First, we choose the desired total strength `M` of the magnetic field at our simulated location. This is a pseudo-random number from 25 to 60 uT, like on the Earth.
ta: ஒவ்வொரு "சீரற்ற" டிராவிற்கும், `டொமைன்ஆச்` இலிருந்து உருவாக்கப்பட்ட மதிப்புடன் விதைக்கப்பட்டுள்ள மல்பெரி 32 சென்_பிராங்கைப் பயன்படுத்துகிறோம், இது கொடுக்கப்பட்ட வலைத்தளத்திற்கான தீர்மானகரமான நடத்தையை உறுதி செய்கிறது. முதலாவதாக, எங்கள் உருவகப்படுத்தப்பட்ட இடத்தில் காந்தப்புலத்தின் விரும்பிய மொத்த வலிமையை `m` தேர்வு செய்கிறோம். இது பூமியைப் போலவே 25 முதல் 60 யுடி வரை ஒரு போலி-சீரற்ற எண்.

source: We support two variants of settings the initial axes orientaton:
ta: ஆரம்ப அச்சுகள் நோக்குநிலையை அமைப்பதற்கான இரண்டு வகைகளை நாங்கள் ஆதரிக்கிறோம்:

source: A pseudorandom draw (RANDOM_AXES_ORIENTATION = true) - the original implementation
ta: ஒரு சூடோராண்டம் டிரா (சீரற்ற_அக்ச்_ரியண்டேசன் = உண்மை) - அசல் செயல்படுத்தல்

source: Calculation from the faked device rotation (shared by other wrappers) - improved version
ta: போலி சாதன சுழற்சியில் இருந்து கணக்கீடு (பிற ரேப்பர்களால் பகிரப்பட்டது) - மேம்படுத்தப்பட்ட பதிப்பு

source: For both methods, the orientation is defined by a number from -1 to 1 for each axis: `baseX`, `baseY`, and `baseZ`. By modifying the above-shown formula, we calculate the `multiplier` that needs to be applied to the base values to get the desired field. The calculation is done as follows:
ta: இரண்டு முறைகளுக்கும், ஒவ்வொரு அச்சுக்கும் -1 முதல் 1 வரையிலான எண்ணால் நோக்குநிலை வரையறுக்கப்படுகிறது: `பேச்எக்ச்`,` பேச் ', மற்றும் `பேச்`. மேலே கவரும் சூத்திரத்தை மாற்றியமைப்பதன் மூலம், விரும்பிய புலத்தைப் பெற அடிப்படை மதிப்புகளுக்கு பயன்படுத்தப்பட வேண்டிய `பெருக்கி` ஐக் கணக்கிடுகிறோம். கணக்கீடு பின்வருமாறு செய்யப்படுகிறது:

source: mult = (M * sqrt(baseX^2 + baseY^2 + baseZ^2) / (baseX^2 + baseY^2 + baseZ^2)) Now, we know that for axis `x`, the value should fluctuate around `baseX * mult`, etc.
ta: mult = (m * sqrt (basex^2 + basy^2 + basez^2) / (basex^2 + basy^2 + basez^2)) இப்போது, ​​அச்சு `x` க்கு, மதிப்பு ஏற்ற இறக்கமாக இருக்க வேண்டும் என்பதை நாங்கள் அறிவோம் `BASEX * MULT`, முதலியன.

source: How much the field changes over time is specified by the fluctuation factor (0;1] that can also be configured. For instance, 0.2 means that the magnetic field on the axis may change from the base value by 20% in both positive and negative way.
ta: காலப்போக்கில் புலம் எவ்வளவு மாறுகிறது என்பது ஏற்ற இறக்க காரணியால் குறிப்பிடப்படுகிறது (0; 1] இது கட்டமைக்கப்படலாம். உதாரணமாக, 0.2 என்பது அச்சில் உள்ள காந்தப்புலம் அடிப்படை மதிப்பிலிருந்து 20% நேர்மறை மற்றும் எதிர்மறை இரண்டிலும் மாறக்கூடும் என்பதாகும் வழி.

source: The fluctuation is simulated by using a series of **sine** functions for each axis. Each sine has a unique amplitude, phase shift, and period. The number of sines per axis is chosen pseudorandomly based on the wrapper settings. For initial experiments, we used around 20 to 30 sines for each axis. The optimal configuration is in question. More sines give less predictable results, but also increase the computing complexity that could have a negative impact on the browser's performance.
ta: ஒவ்வொரு அச்சுக்கும் ** சைன் ** செயல்பாடுகளைப் பயன்படுத்துவதன் மூலம் ஏற்ற இறக்கங்கள் உருவகப்படுத்தப்படுகின்றன. ஒவ்வொரு சைனுக்கும் ஒரு தனித்துவமான வீச்சு, கட்ட மாற்றம் மற்றும் காலம் உள்ளது. ஒரு அச்சுக்கு சைன்களின் எண்ணிக்கை ரேப்பர் அமைப்புகளின் அடிப்படையில் சூடோராண்டம்லி தேர்ந்தெடுக்கப்படுகிறது. ஆரம்ப சோதனைகளுக்கு, ஒவ்வொரு அச்சுக்கும் 20 முதல் 30 சைன்களைப் பயன்படுத்தினோம். உகந்த உள்ளமைவு கேள்விக்குரியது. அதிகமான சைன்கள் குறைவான கணிக்கக்கூடிய முடிவுகளைத் தருகின்றன, ஆனால் உலாவியின் செயல்திறனில் எதிர்மறையான தாக்கத்தை ஏற்படுத்தக்கூடிய கம்ப்யூட்டிங் சிக்கலையும் அதிகரிக்கின்றன.

source: For the given timestamp `t`, we make the sum of all sine values at the point `x=t`. The result is then shifted over the y-axis by adding `base[X|Y|Z] * multiplier` to the sum. The initial configuration of the fake field generator was chosen intuitively to resemble the results of the real measurements. Currently, the generator uses at least one sine with the period around 100 us (with 10% tolerance), which seems to be the minimum sampling rate obtainable using the API on mobile devices. Then, at least one sine around 1 s, around 10 s, 1 minute, and 1 hour. When more than 5 sines are used, the cycle repeats using `modulo 5` and creates a new sine with the period around 100 us, but this time the tolerance is 20%. The same follows for seconds, tens of seconds, minutes, hours. The tolerance grows every 5 sines. For 11+ sines, the tolerance is 30% up to the maximum (currently 50%). The amplitude of each sine is chosen pseudo- randomly based on the **fluctuation factor** described above. The phase shift of each sine is also pseudo-random number from [0;2PI).
ta: கொடுக்கப்பட்ட நேர முத்திரை `t` க்கு, அனைத்து சைன் மதிப்புகளின் தொகையை` ஃச் = t` புள்ளியில் செய்கிறோம். இதன் விளைவாக `அடிப்படை [x | ஒய் | z] * பெருக்கி` தொகையில் சேர்ப்பதன் மூலம் Y- அச்சுக்கு மேல் மாற்றப்படுகிறது. உண்மையான அளவீடுகளின் முடிவுகளை ஒத்திருக்க போலி புலம் செனரேட்டரின் ஆரம்ப உள்ளமைவு உள்ளுணர்வாக தேர்ந்தெடுக்கப்பட்டது. தற்போது, ​​செனரேட்டர் குறைந்தது ஒரு சைனை 100 அமெரிக்காவுடன் (10% சகிப்புத்தன்மையுடன்) பயன்படுத்துகிறது, இது மொபைல் சாதனங்களில் பநிஇ ஐப் பயன்படுத்தி பெறக்கூடிய குறைந்தபட்ச மாதிரி விகிதமாகத் தெரிகிறது. பின்னர், குறைந்தது ஒரு சைன் 1 வினாடிகளில், 10 வி, 1 மணித்துளி, மற்றும் 1 மணிநேரம். 5 சைன்களுக்கு மேல் பயன்படுத்தப்படும்போது, ​​சுழற்சி `மாடுலோ 5` ஐப் பயன்படுத்தி மீண்டும் மீண்டும் 100 அமெரிக்க டாலர் காலத்துடன் ஒரு புதிய சைனை உருவாக்குகிறது, ஆனால் இந்த நேரத்தில் சகிப்புத்தன்மை 20%ஆகும். சில நொடிகள், பல்லாயிரக்கணக்கான விநாடிகள், நிமிடங்கள், மணிநேரங்கள். சகிப்புத்தன்மை ஒவ்வொரு 5 சைன்களையும் வளர்க்கிறது. 11+ சைன்களுக்கு, சகிப்புத்தன்மை 30% அதிகபட்சம் (தற்போது 50%). ஒவ்வொரு சைனின் வீச்சு போலி- மேலே விவரிக்கப்பட்ட ** ஏற்ற இறக்க காரணி ** ஐ அடிப்படையாகக் கொண்டது. ஒவ்வொரு சைனின் கட்ட மாற்றமும் [0; 2pi) இலிருந்து போலி-சீரற்ற எண்.

source: Based on the results, this heuristic returns belivable values that look like actual sensor readings. Nevertheless, the generator uses a series of constants, whose optimal values should be a subject of future research and improvements. Perphaps, a correlation analysis with real mesurements could help in the future.
ta: முடிவுகளின் அடிப்படையில், இந்த ஊரிச்டிக் உண்மையான சென்சார் அளவீடுகளைப் போல தோற்றமளிக்கும் மதிப்புகளைத் தருகிறது. ஆயினும்கூட, செனரேட்டர் தொடர்ச்சியான மாறிலிகளைப் பயன்படுத்துகிறது, அதன் உகந்த மதிப்புகள் எதிர்கால ஆராய்ச்சி மற்றும் மேம்பாடுகளுக்கு உட்பட்டதாக இருக்க வேண்டும். பெர்பாப்ச், உண்மையான மெசூரேமென்ட்சுடன் ஒரு தொடர்பு பகுப்பாய்வு எதிர்காலத்தில் உதவக்கூடும்.

source: POSSIBLE IMPROVEMENTS Non-stationary devices can be supported if the baseX,Y,Z is updated with each movement. Do more experiments in real environments and possibly update the reference magnetic field vector, or the sine generator, e.g. by simulating temporary pseudorandom electromagnetic interferences, etc.
ta: ஒவ்வொரு இயக்கத்திலும் பேச்எக்ச், ஒய், சட் புதுப்பிக்கப்பட்டால், சாத்தியமான மேம்பாடுகள் நிலையான அல்லாத சாதனங்களை ஆதரிக்க முடியும். உண்மையான சூழல்களில் கூடுதல் சோதனைகளைச் செய்யுங்கள் மற்றும் குறிப்பு காந்தப்புல திசையன் அல்லது சைன் செனரேட்டரைப் புதுப்பிக்கலாம், எ.கா. தற்காலிக சூடோராண்டம் மின்காந்த குறுக்கீடுகள் போன்றவற்றை உருவகப்படுத்துவதன் மூலம்.

source: Title: Generic sensor Filename: ../common/wrappingS-SENSOR.js
ta: தலைப்பு: பொதுவான சென்சார் கோப்பு பெயர்: ../common/wrappings-sensor.js

source: MOTIVATION The risk of using Generic Sensor API calls for device fingerprinting is mentioned within the W3C Candidate Recommendation Draft, 29 July 2021 (https://www.w3.org/TR/2021/CRD-generic-sensor-20210729/#device-fingerprinting) Documented threats include manufacturing imperfections and differences that are unique to the concrete model of the device and can be used for fingerprinting.
ta: உந்துதல் சாதன கைரேகைக்கான பொதுவான சென்சார் பநிஇ அழைப்புகளைப் பயன்படுத்துவதற்கான இடர் W3C வேட்பாளர் பரிந்துரை வரைவுக்குள் குறிப்பிடப்பட்டுள்ளது, 29 சூலை 2021 (https://www.w3.org/tr/2021/crd-generic-sensor-20210729/#device- கைரேகை) ஆவணப்படுத்தப்பட்ட அச்சுறுத்தல்களில் விளைவாக்கம் குறைபாடுகள் மற்றும் சாதனத்தின் கான்கிரீட் மாதிரிக்கு தனித்துவமான வேறுபாடுகள் ஆகியவை அடங்கும், மேலும் அவை கைரேகைக்கு பயன்படுத்தப்படலாம்.

source: We discovered another loophole in the `Sensor.timestamp` attribute. The value describes when the last `Sensor.onreading` event occurred, in millisecond precision. We observed the time origin is not the time of browsing context creation but the last boot time of the device. Exposing such information is dangerous as it allows to fingerprint the user easily. It is unlikely that two different devices will boot at exactly the same time.
ta: `Sensor.timestamp` பண்புக்கூறில் மற்றொரு ஓட்டை கண்டுபிடித்தோம். மில்லி நொடி துல்லியத்தில், கடைசி `சென்சார்.ஆன் ரீடிங்` நிகழ்வு நிகழ்ந்தபோது மதிப்பு விவரிக்கிறது. நேர தோற்றம் சூழல் உருவாக்கும் நேரம் அல்ல, ஆனால் சாதனத்தின் கடைசி துவக்க நேரம் என்பதை நாங்கள் கவனித்தோம். அத்தகைய தகவல்களை அம்பலப்படுத்துவது ஆபத்தானது, ஏனெனில் இது பயனரை எளிதாக கைரேகைக்கு அனுமதிக்கிறது. இரண்டு வெவ்வேறு சாதனங்கள் ஒரே நேரத்தில் துவங்கும் என்பது சாத்தியமில்லை.

source: Tested with the Magnetometer sensor on the following devices:
ta: பின்வரும் சாதனங்களில் காந்தமாமீட்டர் சென்சார் மூலம் சோதிக்கப்பட்டது:

source: Samsung Galaxy S21 Ultra; Android 11, kernel 5.4.6-215566388-abG99BXXU3AUE1, Build/RP1A.200720.012.G998BXXU3AUE1 Chrome 94.0.4606.71 and Kiwi (Chromium) 94.0.4606.56
ta: சாம்சங் கேலக்சி எச் 21 அல்ட்ரா; ஆண்ட்ராய்டு 11, கர்னல் 5.4.6-21566388-ABG99BXXU3AUE1, பில்ட்/RP1A.200720.012.G998BXXU3AUE1 CHROME 94.0.4606.71 மற்றும் பசலிப்பழம் (குரோமியம்) 94.0.4606.56.56.

source: Xiaomi Redmi Note 5; Android 9, kernel 4.4.156-perf+, Build/9 PKQ1.180901.001 Chrome 94.0.4606.71
ta: சியோமி ரெட்மி குறிப்பு 5; ஆண்ட்ராய்டு 9, கர்னல் 4.4.156-பெர்ஃப்+, பில்ட்/9 பி.கே.க்யூ 1.180901.001 குரோம் 94.0.4606.71

source: The wrapper thus protects device by changing the time origin to the browsing context creation time, whereas the timestamp should still uniquely identify the reading. This is achieved in the following way:
ta: டைம் தோற்றத்தை உலாவல் சூழல் உருவாக்கும் நேரத்திற்கு மாற்றுவதன் மூலம் ரேப்பர் சாதனத்தைப் பாதுகாக்கிறது, அதேசமயம் நேர முத்திரை வாசிப்பை தனித்துவமாக அடையாளம் காண வேண்டும். இது பின்வரும் வழியில் அடையப்படுகிறது:

source: At the first reading, we calculate the difference between the original value and performance.now(). This gives us the offset between 1) the device boot and 2) the page context initialization.
ta: முதல் வாசிப்பில், அசல் மதிப்பு மற்றும் செயல்திறன் ஆகியவற்றுக்கு இடையிலான வேறுபாட்டைக் கணக்கிடுகிறோம். இப்போது (). இது 1) சாதன துவக்கத்திற்கும் 2) பக்க சூழல் துவக்கத்திற்கும் இடையில் ஆஃப்செட்டை நமக்கு வழங்குகிறது.

source: On every reading, the offset is subtracted from the original value. The resulting value then uniquely identifies the reading sample without exposing the boot time.
ta: ஒவ்வொரு வாசிப்பிலும், ஆஃப்செட் அசல் மதிப்பிலிருந்து கழிக்கப்படுகிறது. இதன் விளைவாக வரும் மதிப்பு துவக்க நேரத்தை அம்பலப்படுத்தாமல் வாசிப்பு மாதிரியை தனித்துவமாக அடையாளம் காட்டுகிறது.

source: Like in the other time precision wrappers, the resulting timestamp is processed by the mitigation function before return. The mitigation may round and (optionally) add noise to the resulting timestamp.
ta: மற்ற நேர துல்லியமான ரேப்பர்களைப் போலவே, இதன் விளைவாக நேர முத்திரையும் திரும்புவதற்கு முன் தணிப்பு செயல்பாட்டால் செயலாக்கப்படுகிறது. தணிப்பு சுற்றிலும் (விருப்பமாக) இதன் விளைவாக வரும் நேர முத்திரைக்கு ஒலி சேர்க்கலாம்.

source: POSSIBLE IMPROVEMENTS in protection level 2, the timestamp origin may be set to a random value based on the session hash. This can serve as a "fake boot time."
ta: பாதுகாப்பு நிலை 2 இல் சாத்தியமான மேம்பாடுகள், நேர முத்திரை தோற்றம் அமர்வு ஆசின் அடிப்படையில் ஒரு சீரற்ற மதிப்புக்கு அமைக்கப்படலாம். இது "போலி துவக்க நேரம்" ஆக செயல்படும்.

source: Title: Orientation sensor Filename: ../common/wrappingS-SENSOR-ORIENT.js
ta: தலைப்பு: நோக்குநிலை சென்சார் கோப்பு பெயர்: ../common/wrappings-sensor-orient.js

source: MOTIVATION Device orientation sensors can be easily used for fingerprinting. As it highly unlikely that two devices visiting the same site will be oriented exactly the same, the orientation itself can serve as a fingerprint.
ta: உந்துதல் சாதன நோக்குநிலை சென்சார்கள் கைரேகைக்கு எளிதாகப் பயன்படுத்தப்படலாம். ஒரே தளத்தைப் பார்வையிடும் இரண்டு சாதனங்கள் ஒரே மாதிரியாக இருக்கும் என்பது மிகவும் சாத்தியமில்லை என்பதால், நோக்குநிலை கைரேகையாக செயல்பட முடியும்.

source: WRAPPING AbsoluteOrientationSensor returns a quaterion decribing the physical orientation of the device in relation to the Earth's reference coordinate system. The faked orientation of the device is saved inside the "orient" global variable that is accessible to all wrappers. The value is chosen pseudorandomly from the domain hash. The wrappper supports possible change of orientation. With each reading, it loads the "orient"'s contents, converts the rotation matrix to a quaternion that is returned by the wrapped getter.
ta: பூமியின் குறிப்பு ஒருங்கிணைப்பு அமைப்பு தொடர்பாக சாதனத்தின் இயற்பியல் நோக்குநிலையை குறைக்கும் ஒரு குவாட்டரியனை மடக்குதல். சாதனத்தின் போலியான நோக்குநிலை அனைத்து ரேப்பர்களுக்கும் அணுகக்கூடிய "ஓரியண்ட்" உலகளாவிய மாறிக்குள் சேமிக்கப்படுகிறது. டொமைன் ஆசிலிருந்து சூடோராண்டம்லி என்ற மதிப்பு தேர்ந்தெடுக்கப்படுகிறது. ரேப்பர் நோக்குநிலையின் மாற்றத்தை ஆதரிக்கிறது. ஒவ்வொரு வாசிப்பிலும், இது "ஓரியண்டின்" உள்ளடக்கங்களை ஏற்றுகிறது, சுழற்சி மேட்ரிக்சை ஒரு குவாட்டர்னியனாக மாற்றுகிறது, இது போர்த்தப்பட்ட பெறுநரால் திருப்பித் தரப்படுகிறது.

source: RelativeOrientationSensor also describes the orientation, but without regard to the Earth's reference coordinate system. We suppose the coordinate system is chosen at the beginning of the sensor instance creation. As we observed, no matter how the device is oriented, there is always a slight difference from the AbsoluteOrientationSensor's in at least one axis. When the device moves, both sensors' readings change. But their difference should be always constant. And thus, we pseudorandomly generate a deviation from the Earth's reference coordinate system. And for each reading, we take the values from the fake AbsoluteOrientationSensor and modify them by the constant deviation.
ta: உறவினர்சென்சர் நோக்குநிலையையும் விவரிக்கிறது, ஆனால் பூமியின் குறிப்பு ஒருங்கிணைப்பு அமைப்பைப் பொருட்படுத்தாமல். சென்சார் நிகழ்வு உருவாக்கத்தின் தொடக்கத்தில் ஒருங்கிணைப்பு அமைப்பு தேர்ந்தெடுக்கப்பட்டதாக நாங்கள் கருதுகிறோம். நாங்கள் கவனித்தபடி, சாதனம் எவ்வாறு நோக்குநிலையாக இருந்தாலும், குறைந்தது ஒரு அச்சில் உள்ள முழுமையான வடிவத்திலிருந்து எப்போதும் ஒரு சிறிய வேறுபாடு இருக்கும். சாதனம் நகரும் போது, ​​இரண்டு சென்சார்களின் அளவீடுகளும் மாறுகின்றன. ஆனால் அவற்றின் வேறுபாடு எப்போதும் மாறாமல் இருக்க வேண்டும். இதனால், பூமியின் குறிப்பு ஒருங்கிணைப்பு அமைப்பிலிருந்து ஒரு விலகலை நாங்கள் போலி உருவாக்குகிறோம். ஒவ்வொரு வாசிப்புக்கும், போலி முழுமையான செயல்பாட்டாளரிடமிருந்து மதிப்புகளை எடுத்து நிலையான விலகலால் மாற்றுவோம்.

source: POSSIBLE IMPROVEMENTS Study the supported coordinate systems of the RelativeOrientationSensor and modify the wrapper behavior if needed.
ta: சாத்தியமான மேம்பாடுகள் உறவினர்களின் ஆதாரத்தின் உதவி ஒருங்கிணைப்பு அமைப்புகளைப் படித்து, தேவைப்பட்டால் ரேப்பர் நடத்தை மாற்றியமைக்கின்றன.

source: Title: Virtual Reality 1.1 Filename: ../common/wrappingS-VR.js
ta: தலைப்பு: மெய்நிகர் ரியாலிட்டி 1.1 கோப்பு பெயர்: ../common/wrappings-vr.js

source: navigator.activeVRDisplays() allows any page script to learn the VR displays attached to the computer.
ta: navigator.activevrdisplays () எந்த பக்க ச்கிரிப்டையும் கணினியுடன் இணைக்கப்பட்ட VR காட்சிகளைக் கற்றுக்கொள்ள அனுமதிக்கிறது.
