Repository: 247i/TACETr
Catalog: உரை/தானி/kainote-kainote-*.po
Languages: ta

# Zarządzanie katalogami czcionek
source: Manage font catalogs
ta: எழுத்துரு பட்டியல்களை நிர்வகிக்கவும்

# Nazwa czcionki
source: Font name
ta: எழுத்துரு பெயர்

# Katalog
source: Catalog
ta: பட்டியல்

# Przykład
source: Sample
ta: மாதிரி

# Dodaj
source: Add
ta: கூட்டு

# Usuń
source: Delete
ta: நீக்கு

# Wczytaj
source: Load
ta: சுமை

# Zapisz Filtr
source: Save filter
ta: வடிகட்டியை சேமிக்கவும்

# Czy na pewno chcesz usunąć ten katalog?
source: Are you sure you want to delete this catalog?
ta: இந்த பட்டியலை நீக்க விரும்புகிறீர்களா?

# Pytanie
source: Prompt
ta: உடனடி

# Lista katalogów ma opcję autozapisu, pliki znajdują się w folderze "Config".
source: Catalog list have autosave, files can be find in "Config" folder.
ta: அட்டவணை பட்டியலில் ஆட்டோசேவ் உள்ளது, கோப்புகளை "கட்டமைப்பு" கோப்புறையில் காணலாம்.

# Katalogi:
source: Catalogs:
ta: பட்டியல்கள்:

# Szukaj:
source: Find:
ta: கண்டுபிடி:

# Autozapis
source: Autosave
ta: தானிசேமி

# Wybierz plik wideo
source: Choose video file
ta: வீடியோ கோப்பைத் தேர்வுசெய்க

# Pliki tekstowe (*.txt)|*.txt
source: Text files (*.txt)|*.txt
ta: உரை கோப்புகள் (*.txt) |*.txt

# Nie można odnaleźć elementów linii %i
source: Cannot find elements of line %i
ta: வரி %i இன் கூறுகளைக் கண்டுபிடிக்க முடியவில்லை

# Nie można dodać czcionki %s.
source: Cannot add font "%s".
ta: எழுத்துருக்களைச் சேர்க்க முடியாது ".

source: For adding fonts to catalog, click "Manage" button first, to create new catalog.
ta: பட்டியலில் எழுத்துருக்களைச் சேர்ப்பதற்கு, முதலில் "நிர்வகி" பொத்தானைக் சொடுக்கு செய்க, புதிய பட்டியலை உருவாக்க.

# Katalog o nazwie "%s" istnieje, co zrobić?
source: Catalog named "%s" already exists. What to do?
ta: "%s" என்று பெயரிடப்பட்ட பட்டியல் ஏற்கனவே உள்ளது. என்ன செய்வது?

# Scal
source: Merge
ta: ஒன்றிணைக்கவும்

# W stylach:
source: In styles:
ta: பாணிகளில்:

# zakładki:
source: tabs:
ta: தாவல்கள்:

# W linijkach:
source: In lines:
ta: வரிகளில்:

# Kolekcjoner czcionek
source: Fonts collector
ta: எழுத்துருக்கள் சேகரிப்பான்

# Wybierz folder
source: Select a folder
ta: ஒரு கோப்புறையைத் தேர்ந்தெடுக்கவும்

# Sprawdź dostępność czcionek
source: Check availability of fonts
ta: எழுத்துருக்களின் கிடைக்கும் தன்மையை சரிபார்க்கவும்

# Skopiuj do wybranego folderu
source: Copy to selected folder
ta: தேர்ந்தெடுக்கப்பட்ட கோப்புறையில் நகலெடுக்கவும்

# Spakuj zipem
source: Zip
ta: சிப்

# Opcje
source: Options
ta: விருப்பங்கள்

# Zapisuj do folderu z napisami / wideo.
source: Save to video / subtitles folder.
ta: வீடியோ / வசன வரிகள் கோப்புறையில் சேமிக்கவும்.

# Zapisuje do folderu z wideo przy wyciąganiu czcionek z pliku MKV.
source: Save to video folder when demux fonts from MKV.
ta: வீடியோ கோப்புறையில் சேமிக்கவும் MKV இலிருந்து டெமக்ச் எழுத்துருக்கள்.

# Wyciągnij czcionki z wczytanego pliku MKV
source: Demux fonts from loaded MKV file
ta: ஏற்றப்பட்ட எம்.கே.வி கோப்பிலிருந்து டெமக்ச் எழுத்துருக்கள்

# Rozpocznij
source: Start
ta: தொடங்கு

# Rozpocznij na zakładkach
source: Start on tabs
ta: தாவல்களில் தொடங்கவும்

# Folder zapisu
source: Save folder
ta: கோப்புறையை சேமிக்கவும்

# Wybierz nazwę archiwum
source: Select the name of the archive
ta: காப்பகத்தின் பெயரைத் தேர்ந்தெடுக்கவும்

# Pliki archiwum (*.zip)|*.zip
source: Archive files (*.zip)|*.zip
ta: காப்பக கோப்புகள் (*.zip) |*.zip

# Brak wczytanego wideo lub napisów
source: No video or subtitles loaded
ta: வீடியோ அல்லது வசன வரிகள் ஏற்றப்படவில்லை

# Wybierz folder, gdzie mają zostać skopiowane czcionki
source: Select the folder where you want to copy fonts
ta: நீங்கள் எழுத்துருக்களை நகலெடுக்க விரும்பும் கோப்புறையைத் தேர்ந்தெடுக்கவும்

# Brak wczytanych napisów, wczytaj napisy albo odznacz tę opcję.
source: No subtitles loaded. Load subtitles or deselect this option.
ta: வசன வரிகள் எதுவும் ஏற்றப்படவில்லை. வசன வரிகள் ஏற்றவும் அல்லது இந்த விருப்பத்தை தேர்வுநீக்கவும்.

# Wybierz nazwę dla archiwum
source: Choose a name for the archive
ta: காப்பகத்திற்கு ஒரு பெயரைத் தேர்வுசெய்க

# Wybrana ścieżka zapisu jest niepoprawna.
source: Save patch is not valid.
ta: சேமி ஒட்டு செல்லுபடியாகாது.

# Plik zip już istnieje, usunąć go?
source: The zip file already exists, delete it?
ta: சிப் கோப்பு ஏற்கனவே உள்ளது, அதை நீக்கவா?

# Potwierdzenie
source: Confirmation
ta: உறுதிப்படுத்தல்

# Nie znaleziono czcionki "
source: Not Found font "
ta: எழுத்துரு கிடைக்கவில்லை "

# Znaleziono czcionkę "%s"
source: Found font "%s"
ta: எழுத்துருக்களைக் கண்டறியவும் "

# Nie można pobrać rozmiarów i nazw plików czcionek kopiowanie zostaje przerwane.
source: You can not get the fonts file sizes and names, copying is canceled.
ta: நீங்கள் எழுத்துருக்கள் கோப்பு அளவுகள் மற்றும் பெயர்களைப் பெற முடியாது, நகலெடுப்பது ரத்து செய்யப்பட்டது.

# Pobrano rozmiary i nazwy %i czcionek, upłynęło %sms.
source: Taken sizes and names of %i fonts, elapsed %sms.
ta: எடுக்கப்பட்ட அளவுகள் மற்றும் %i எழுத்துருக்களின் பெயர்கள், கடந்த %sMS.

# Ścieżka jest niedostępna
source: Path is not available
ta: பாதை கிடைக்கவில்லை

# Czcionka "%s" należy do stylu, który nie jest wykorzystywany.
source: Font "%s" is from style, that is not used.
ta: எழுத்துரு "%s" பாணியிலிருந்து வந்தது, அது பயன்படுத்தப்படவில்லை.

# Niektóre czcionki nie mają wszystkich znaków użytych w tekście.
source: Some fonts do not contain all glyps used in text.
ta: சில எழுத்துருக்களில் உரையில் பயன்படுத்தப்படும் அனைத்து கிளைப்களும் இல்லை.

# Zakończono, %s %s.
source: Finished, %s %s.
ta: முடிந்தது, %s %s.

# znaleziono
source: found
ta: காணப்பட்டது

# skopiowano
source: copied
ta: நகலெடுக்கப்பட்டது

# czcionkę
source: font
ta: எழுத்துரு

# czcionki
source: fonts
ta: எழுத்துருக்கள்

# czcionek
source: fonts
ta: எழுத்துருக்கள்

# Nie znaleziono %s.
source: Not found %s.
ta: %s காணப்படவில்லை.

# Nie udało się skopiować %s.
source: Cannot copy %s.
ta: %s ஐ நகலெடுக்க முடியாது.

# Zakończono powodzeniem, %s %s.
source: Completed Successfully, %s %s.
ta: வெற்றிகரமாக முடிக்கப்பட்டது, %s %s.

# Dodano do archiwum czcionkę "%s".
source: Added to archive font "%s".
ta: காப்பக எழுத்துரு "%s" இல் சேர்க்கப்பட்டது.

# Nie można spakować czcionki "%s".
source: Cannot zip font "%s".
ta: எழுத்துரு "%s" ஐ சிப் செய்ய முடியாது.

# Skopiowano czcionkę "%s".
source: Copied font "%s".
ta: நகலெடுத்த எழுத்துரு "%s".

# Nie można skopiować czcionki "%s".
source: Cannot copy font "%s".
ta: எழுத்துருக்களை நகலெடுக்க முடியாது ".

# Wideo: %s
source: Video: %s
ta: வீடியோ: %s

# To wideo nie jest plikiem MKV.
source: This video is not MKV file.
ta: இந்த வீடியோ எம்.கே.வி கோப்பு அல்ல.

# Nie można otworzyć pliku MKV
source: Cannot open MKV file.
ta: எம்.கே.வி கோப்பைத் திறக்க முடியாது.

# Wczytany plik MKV nie ma żadnych czcionek.
source: Loaded MKV file does not have any fonts.
ta: ஏற்றப்பட்ட எம்.கே.வி கோப்பில் எழுத்துருக்கள் இல்லை.

# Zapisano czcionkę o nazwie "
source: Saved a font named "
ta: பெயரிடப்பட்ட ஒரு எழுத்துருவை சேமித்தது "

# Nie można zapisać czcionki o nazwie "
source: You can not save the font named "
ta: பெயரிடப்பட்ட எழுத்துருவை நீங்கள் சேமிக்க முடியாது "

# Zakończono, skopiowano %i czcionek. Nie udało się skopiować %i czcionek.
source: Completed, copied %i fonts. Failed to copy %i fonts.
ta: முடிந்தது, நகலெடுக்கப்பட்டது %i எழுத்துருக்கள். %i எழுத்துருக்களை நகலெடுப்பதில் தோல்வி.

# Zakończono powodzeniem, skopiowano %i czcionek.
source: Completed successfully and copied %i fonts.
ta: வெற்றிகரமாக நிறைவு செய்யப்பட்டு %i எழுத்துருக்களை நகலெடுத்தது.

# Nie można utworzyć folderu.
source: Cannot create folder.
ta: கோப்புறையை உருவாக்க முடியாது.

# Znaleziono czcionkę "%s".
source: Found font "%s".
ta: எழுத்துருக்களைக் கண்டறியவும் ".

# Czcionka "%s" należy do stylu, który nie jest wykorzystywany.%s
source: Font "%s" is from style, that is not used.%s
ta: எழுத்துரு "%s" பாணியிலிருந்து வந்தது, அது பயன்படுத்தப்படவில்லை.%s

# Nie zostanie skopiowana.
source: Will not be copied.
ta: நகலெடுக்கப்படாது.

# Czcionka "%s" nie ma stylu normalnego.
source: Font "%s" is missing normal style.
ta: எழுத்துரு "%s" சாதாரண பாணியைக் காணவில்லை.

# Czcionka "%s" nie ma pogrubienia z kursywą.
source: Font "%s" is missing bold italics.
ta: எழுத்துருக்கள் "தைரியமான சாய்வு காணவில்லை.

# Czcionka "%s" nie ma pogrubienia.
source: Font "%s" is missing bold.
ta: எழுத்துரு "%s" தைரியத்தைக் காணவில்லை.

# Czcionka "%s" nie ma kursywy.
source: Font "%s" is missing italics.
ta: எழுத்துரு "%s" சாய்வைக் காணவில்லை.

# Nie można sprawdzić znaków czcionki "%s".
source: Cannot check font "%s" characters.
ta: எழுத்துரு "%s" எழுத்துக்களை சரிபார்க்க முடியாது.

# Czcionka "%s" nie zawiera znaków: "%s".
source: Font "%s" not contains characters: "%s".
ta: எழுத்துருக்களில் "எழுத்துக்கள் இல்லை".

# Nie można pobrać zawartości czcionki "%s".
source: Cannot get content of font "%s".
ta: எழுத்துருக்களின் உள்ளடக்கத்தைப் பெற முடியாது ".

# Nie można otworzyć pliku "%s".
source: Cannot open file "%s".
ta: "%s" கோப்பைத் திறக்க முடியாது.

# Rozmiar czcionki "%s" się różni.
source: Size of font "%s" is different.
ta: எழுத்துரு "%s" இன் அளவு வேறுபட்டது.

# Nie można odczytać czcionki "%s" z folderu Fonts.
source: Could not read "%s" font from the Fonts folder.
ta: எழுத்துருக்கள் கோப்புறையிலிருந்து "%s" எழுத்துருவைப் படிக்க முடியவில்லை.

# Znaleziono plik czcionki "%s".
source: Found "%s" font file.
ta: "%s" எழுத்துரு கோப்பு கிடைத்தது.

# Nie można znaleźć czcionki "%s" w folderze Fonts.
source: Cannot find "%s" font in Fonts folder.
ta: எழுத்துருக்கள் கோப்புறையில் "%s" எழுத்துருவைக் கண்டுபிடிக்க முடியவில்லை.

# Nie można stworzyć procesu, muxowanie przerwane
source: Couldn't create process. Muxing canceled
ta: செயல்முறையை உருவாக்க முடியவில்லை. மக்சிங் ரத்து செய்யப்பட்டது

# Zakończono w %sms
source: Finished in %sms
ta: %sMS இல் முடிந்தது

# Wybierz czcionkę
source: Select a font
ta: எழுத்துருவைத் தேர்ந்தெடுக்கவும்

# Czcionka
source: Font
ta: எழுத்துரு

# Podgląd
source: Preview
ta: முன்னோட்டம்

# Kursywa
source: Italic
ta: சாய்வு

# Wszystkie czcionki
source: All fonts
ta: அனைத்து எழுத்துருக்களும்

# Bez katalogu
source: Without catalog
ta: பட்டியல் இல்லாமல்

# Dodaje czcionki do wcześniej utworzonego katalogu
source: Adding fonts to catalog
ta: பட்டியலில் எழுத்துருக்களைச் சேர்ப்பது

# Zarządzaj
source: Manage
ta: நிர்வகிக்கவும்

# Umorzliwia zarządzanie katalogami stylów
source: Manages font catalogs
ta: எழுத்துரு பட்டியல்களை நிர்வகிக்கிறது

# Filtruj
source: Filter
ta: வடிப்பி

# Filtruje czcionki, by zawierały wpisane znaki
source: Filter fonts for written characters
ta: எழுதப்பட்ட எழுத்துக்களுக்கான எழுத்துருக்களை வடிகட்டவும்

# Filtrowanie i katalogi czcionek
source: Filtering and font catalogs
ta: வடிகட்டுதல் மற்றும் எழுத்துரு பட்டியல்கள்

# Nie można stworzyć uchwytu notyfikacji zmian folderu czcionek.
source: Cannot create notification handler for fonts folder.
ta: எழுத்துருக்கள் கோப்புறைக்கு அறிவிப்பு கையாளுதலை உருவாக்க முடியாது.

# Nie można stworzyć następnego uchwytu notyfikacji zmian folderu czcionek.
source: Cannot create next notification handler for fonts folder.
ta: எழுத்துருக்கள் கோப்புறைக்கு அடுத்த அறிவிப்பு கையாளுபவரை உருவாக்க முடியாது.

# Wyjście
source: Exit
ta: வெளியேறு

# Otwórz nową zakładkę
source: Open new tab
ta: புதிய தாவலைத் திறக்கவும்

# Zamknij bieżącą zakładkę
source: Close current tab
ta: தற்போதைய தாவலை மூடு

# Okno zmiany czasów
source: Shift times
ta: சிப்ட் நேரங்கள்

# Konwertuj do ASS
source: Convert to ASS
ta: கழுதைக்கு மாற்றவும்

# Konwertuj do SRT
source: Convert to SRT
ta: SRT க்கு மாற்றவும்

# Konwertuj do MDVD
source: Convert to MDVD
ta: MDVD ஆக மாற்றவும்

# Konwertuj do MPL2
source: Convert to MPL2
ta: MPL2 ஆக மாற்றவும்

# Konwertuj do TMP
source: Convert to TMP
ta: TMP க்கு மாற்றவும்

# Menedżer stylów
source: Style manager
ta: பாணி ​​மேனேசர்

# Włącz / Wyłącz edytor
source: Enable / Disable editor
ta: எடிட்டரை இயக்கவும் / முடக்கவும்

# Otwórz wideo
source: Open video
ta: வீடியோ திறந்த வீடியோ

# Znajdź i zmień
source: Find and replace
ta: கண்டுபிடித்து மாற்றவும்

# Cofnij
source: Undo
ta: செயல்தவிர்

# Ponów
source: Redo
ta: மீண்டும்செய்

# Historia
source: History
ta: வரலாறு

# Otwórz napisy
source: Open subtitles
ta: திறந்த வசன வரிகள்

# Zapisz
source: Save
ta: சேமி

# Zapisz jako...
source: Save as...
ta: சேமி ...

# Usuń tekst
source: Delete text
ta: உரையை நீக்கு

# Usuń linijkę
source: Delete line
ta: வரியை நீக்கு

# Wstaw czas początkowy z wideo
source: Insert start time from video
ta: வீடியோவிலிருந்து தொடக்க நேரத்தை செருகவும்

# Wstaw czas końcowy z wideo
source: Insert end time from video
ta: வீடியோவிலிருந்து இறுதி நேரத்தை செருகவும்

# Odtwórz / Pauza
source: Play / Pause
ta: விளையாடு / இடைநிறுத்தம்

# Klatka w tył
source: Previous frame
ta: முந்தைய சட்டகம்

# Klatka w przód
source: Next frame
ta: அடுத்த சட்டகம்

# Poprzednia linijka
source: Previous line
ta: முந்தைய வரி

# Następna linijka
source: Next line
ta: அடுத்த வரி

# Znajdź następny
source: Find next
ta: அடுத்ததை தேடு

# Scal z poprzednią linijką
source: Merge with previous line
ta: முந்தைய வரியுடன் ஒன்றிணைக்கவும்

# Scal z następną linijką
source: Merge with next line
ta: அடுத்த வரியுடன் ஒன்றிணைக்கவும்

# Przyklej start do klatki kluczowej
source: Change start time to nearest keyframe
ta: தொடக்க நேரத்தை அருகிலுள்ள கீஃப்ரேமுக்கு மாற்றவும்

# Przyklej koniec do klatki kluczowej
source: Change end time to nearest keyframe
ta: இறுதி நேரத்தை அருகிலுள்ள கீஃப்ரேமுக்கு மாற்றவும்

# Następna karta
source: Next tab
ta: அடுத்த தாவல்

# Poprzednia karta
source: Previous tab
ta: முந்தைய தாவல்

# Zaznacz linię z czasem wideo
source: Select line at current video position
ta: தற்போதைய வீடியோ நிலையில் வரியைத் தேர்ந்தெடுக்கவும்

# Pomoc (niekompletna, ale jednak)
source: Help (not available in English)
ta: உதவி (ஆங்கிலத்தில் கிடைக்கவில்லை)

# Duplikuj linie
source: Duplicate lines
ta: நகல் கோடுகள்

# Kopiuj kolumny
source: Copy columns
ta: நெடுவரிசைகளை நகலெடுக்கவும்

# Wklej kolumny
source: Paste columns
ta: நெடுவரிசைகளை ஒட்டவும்

# Pokaż podgląd napisów
source: Show subtitles preview
ta: வசன வரிகள் முன்னோட்டத்தைக் காட்டு

# 5 sekund do przodu
source: 5 seconds forward
ta: 5 வினாடிகள் முன்னோக்கி

# 5 sekund do tyłu
source: 5 seconds backward
ta: 5 விநாடிகள் பின்தங்கிய

# Minuta do przodu
source: 1 minute forward
ta: 1 மணித்துளி முன்னோக்கி

# Minuta do tyłu
source: 1 minute backward
ta: 1 மணித்துளி பின்தங்கிய

# Następny plik
source: Next file
ta: அடுத்த கோப்பு

# Poprzedni plik
source: Previous file
ta: முந்தைய கோப்பு

# Dźwięk głośniej
source: Volume up
ta: தொகுதி

# Dźwięk ciszej
source: Volume down
ta: தொகுதி கீழே

# Następny rozdział
source: Next chapter
ta: அடுத்த அத்தியாயம்

# Poprzedni rozdział
source: Previous chapter
ta: முந்தைய அத்தியாயம்

# Wstaw pogrubienie
source: Add bold
ta: தைரியத்தைச் சேர்க்கவும்

# Wstaw kursywę
source: Add italic
ta: சாய்வு சேர்க்கவும்

# Wstaw znak podziału
source: Add line wrap
ta: வரி மடக்கு சேர்க்கவும்

# Wstaw różnicę początkową
source: Insert difference from the start
ta: தொடக்கத்திலிருந்து வித்தியாசத்தை செருகவும்

# Wstaw różnicę końcową
source: Insert difference to the end
ta: வித்தியாசத்தை இறுதியில் செருகவும்

# Następne niepewne
source: Next not confirmed line
ta: அடுத்து உறுதிப்படுத்தப்படவில்லை வரி

# Następne nieprzetłumaczone
source: Next non translated
ta: அடுத்து மொழிபெயர்க்கப்படாதது

# Ustaw jako niepewne i przejdź dalej
source: Set as not confirmed and go to the next line
ta: உறுதிப்படுத்தப்படாதபடி அமைக்கப்பட்டு அடுத்த வரிக்குச் செல்லுங்கள்

# Zatwierdź zmiany idź do następnej linii
source: Apply the changes and go to the next line
ta: மாற்றங்களைப் பயன்படுத்துங்கள் மற்றும் அடுத்த வரிக்குச் செல்லவும்

# Zatwierdź
source: Commit
ta: கமிட்

# Zatwierdź zastępcze
source: Commit alt
ta: எல்லாவற்றையும் செய்யுங்கள்

# Poprzednia linijka zastępcze
source: Previous line alt
ta: முந்தைய வரி ஆல்ட்

# Następna linijka zastępcze
source: Next line alt
ta: அடுத்த வரி ஆல்ட்

# Odtwarzaj
source: Play
ta: விளையாடுங்கள்

# Odtwarzaj zastępcze
source: Play alt
ta: ஆல்ட் விளையாடுங்கள்

# Odtwarzaj linię
source: Play line
ta: விளையாட்டு வரி

# Odtwarzaj linię zastępcze
source: Play line alt
ta: வரி அல்ட் விளையாடுங்கள்

# Zatrzymaj
source: Stop
ta: நிறுத்து

# Przewiń w lewo
source: Scroll left
ta: உருள் இடது

# Przewiń w prawo
source: Scroll right
ta: வலதுபுறம் உருட்டவும்

# Odtwarzaj przed znacznikem
source: Play before the marker
ta: மார்க்கருக்கு முன் விளையாடுங்கள்

# Odtwarzaj po znaczniku
source: Play after the marker
ta: மார்க்கருக்குப் பிறகு விளையாடுங்கள்

# Odtwarzaj pierwsze 500ms
source: Play first 500ms
ta: முதல் 500 மீ

# Odtwarzaj końcowe 500ms
source: Play last 500ms
ta: கடைசி 500 மீ

# Odtwarzaj 500ms przed
source: Play 500ms before
ta: முன்பு 500 மீ

# Odtwarzaj 500ms po
source: Play 500ms after
ta: 500 எம்.எச்

# Odtwarzaj do końca
source: Play to the end
ta: இறுதிவரை விளையாடுங்கள்

# Dodaj wstęp
source: Add lead-in
ta: லீட்-இன் சேர்க்கவும்

# Dodaj zakończenie
source: Add lead-out
ta: லீட்-அவுட் சேர்க்கவும்

# Plik skrótów jest przestarzały zostanie zamieniony domyślnym
source: Shortcuts file is outdated, it will be replaced by default
ta: குறுக்குவழிகள் கோப்பு காலாவதியானது, அது இயல்பாக மாற்றப்படும்

# Skrót "%s" nie jest prawidłowy
source: Key "%s" is not valid
ta: விசை "%s" செல்லுபடியாகாது

# Nie można przywrócić skrótu, bo nie ma domyślnego ustawienia o id %i
source: This setting does not have a default hotkey with id %i to revert to
ta: இந்த அமைப்பில் ஐடி %i உடன் இயல்புநிலை ஆட்ச்கி இல்லை

# Mapowanie przycisków
source: Hotkey mapping
ta: ஆட்கி மேப்பிங்

# Skrót globalny
source: Global hotkey
ta: உலகளாவிய ஆட்ச்கி

# Skrót pola napisów
source: Subtitles grid hotkey
ta: வசன வரிகள் கட்டம் ஆட்ச்கி

# Skrót pola edycji
source: Edit box hotkey
ta: பெட்டி ஆட்ச்கி திருத்து

# Skrót wideo
source: Video hotkey
ta: வீடியோ ஆட்ச்கி

# Skrót audio
source: Audio hotkey
ta: ஆடியோ ஆட்ச்கி

# Proszę wcisnąć klawisze skrótu dla "%s".
source: Please enter a hotkey for "%s".
ta: தயவுசெய்து "%s" க்கு ஆட்ச்கியை உள்ளிடவும்.

# Skróty globalne i edytora muszą zawierać modyfikatory (Shift, Ctrl lub Alt).
source: Global and editor shortcuts must include modifiers (e.g. Shift, Ctrl, Alt).
ta: உலகளாவிய மற்றும் எடிட்டர் குறுக்குவழிகளில் மாற்றியமைப்பாளர்கள் இருக்க வேண்டும் (எ.கா. சிப்ட், சி.டி.ஆர்.எல், ஆல்ட்).

# Nie można używać skrótów do kopiowania, wycinania i wklejania.
source: You can not use shortcuts for copying, cutting and pasting.
ta: நகலெடுப்பது, வெட்டுதல் மற்றும் ஒட்டுவதற்கு நீங்கள் குறுக்குவழிகளைப் பயன்படுத்த முடியாது.

# Nie można używać skrótu zamykania programu.
source: You can not use shortcut for program close.
ta: நிரல் நெருக்கமான குறுக்குவழியைப் பயன்படுத்த முடியாது.

# O programie
source: About
ta: பற்றி

# Wątek programu na forum AnimeSub.info
source: Forum thread on animesub.info (Polish)
ta: Animesub.info (போலந்து) இல் மன்ற நூல்

# Zmień proporcje wideo
source: Change aspect ratio
ta: அம்ச விகிதத்தை மாற்றவும்

# Właściwości pliku ASS
source: ASS file properties
ta: கழுதை கோப்பு பண்புகள்

# Otwórz audio z wideo
source: Open audio from video
ta: வீடியோவிலிருந்து ஆடியோவைத் திறக்கவும்

# Wczytaj skrypt
source: Load script
ta: ச்கிரிப்டை ஏற்றவும்

# Otwórz okno mapowania skrótów
source: Open shortcut mapping window
ta: குறுக்குவழி மேப்பிங் சாளரத்தைத் திறக்கவும்

# Odśwież skrypty autoload
source: Refresh autoload scripts
ta: ஆட்டோலோட் ச்கிரிப்ட்களை புதுப்பிக்கவும்

# Zamknij audio
source: Close audio
ta: ஆடியோவை மூடு

# Ustaw czasy jako ciągłe (następna linijka)
source: Set times as a continuous (next line)
ta: நேரங்களை தொடர்ச்சியான (அடுத்த வரி) என அமைக்கவும்

# Ustaw czasy jako ciągłe (poprzednia linijka)
source: Set times as a continuous (previous line)
ta: நேரங்களை தொடர்ச்சியான (முந்தைய வரி) என அமைக்கவும்

# Usuń plik wideo
source: Remove video
ta: வீடியோவை அகற்று

# Pierwszy przycisk tagów
source: First tag button
ta: முதல் குறிச்சொல் பொத்தான்

# Drugi przycisk tagów
source: Second tag button
ta: இரண்டாவது குறிச்சொல் பொத்தான்

# Trzeci przycisk tagów
source: Third tag button
ta: மூன்றாவது குறிச்சொல் பொத்தான்

# Czwarty przycisk tagów
source: 4th tag button
ta: 4 வது குறிச்சொல் பொத்தான்

# Piąty przycisk tagów
source: 5th tag button
ta: 5 வது குறிச்சொல் பொத்தான்

# Szósty przycisk tagów
source: 6th tag button
ta: 6 வது குறிச்சொல் பொத்தான்

# Siódmy przycisk tagów
source: 7th tag button
ta: 7 வது குறிச்சொல் பொத்தான்

# Ósmy przycisk tagów
source: 8th tag button
ta: 8 வது குறிச்சொல் பொத்தான்

# Dziewiąty przycisk tagów
source: 9th tag button
ta: 9 வது குறிச்சொல் பொத்தான்

# Dziesiąty przycisk tagów
source: 10th tag button
ta: 10 வது குறிச்சொல் பொத்தான்

# Jedenasty przycisk tagów
source: 11th tag button
ta: 11 வது குறிச்சொல் பொத்தான்

# Dwunasty przycisk tagów
source: 12th tag button
ta: 12 வது குறிச்சொல் பொத்தான்

# Trzynasty przycisk tagów
source: 13th tag button
ta: 13 வது குறிச்சொல் பொத்தான்

# Czternasty przycisk tagów
source: 14th tag button
ta: 14 வது குறிச்சொல் பொத்தான்

# Piętnast przycisk tagów
source: 15th tag button
ta: 15 வது குறிச்சொல் பொத்தான்

# Szesnasty przycisk tagów
source: 16th tag button
ta: 16 வது குறிச்சொல் பொத்தான்

# Siedemnasty przycisk tagów
source: 17th tag button
ta: 17 வது குறிச்சொல் பொத்தான்

# Osiemnasty przycisk tagów
source: 18th tag button
ta: 18 வது குறிச்சொல் பொத்தான்

# Dziewiętnasty przycisk tagów
source: 19th tag button
ta: 19 வது குறிச்சொல் பொத்தான்

# Dwudziesty przycisk tagów
source: 20th tag button
ta: 20 வது குறிச்சொல் பொத்தான்

# Ukryj komentarze
source: Hide comments
ta: கருத்துகளை மறைக்கவும்

# Pokaż niepewne
source: Show not confirmed
ta: உறுதிப்படுத்தப்படவில்லை

# Wyłącz filtrowanie
source: Turn of filtering
ta: வடிகட்டுதல் முறை

# Ukryj zaznaczone linie
source: Hide selection
ta: தேர்வை மறைக்க

# Ukryj linie ze stylami
source: Hide lines with styles
ta: பாணிகளுடன் வரிகளை மறைக்கவும்

# Pokaż nieprzetłumaczone
source: Show not translated
ta: மொழிபெயர்க்கப்படவில்லை

# Ustaw FPS z wideo
source: Set FPS from video
ta: வீடியோவிலிருந்து FPS ஐ அமைக்கவும்

# Kopiuj klatkę do schowka
source: Copy frame to clipboard
ta: இடைநிலைப்பலகைக்கு சட்டத்தை நகலெடுக்கவும்

# Zapisz klatkę jako PNG
source: Save frame as PNG
ta: சட்டகமாக png ஆக சேமிக்கவும்

# Sortuj wszystko według czasu początkowego
source: Sort all lines by start time
ta: தொடக்க நேரத்தால் எல்லா வரிகளையும் வரிசைப்படுத்துங்கள்

# Sortuj wszystko według czasu końcowego
source: Sort all lines by end time
ta: அனைத்து வரிகளையும் இறுதி நேரத்தால் வரிசைப்படுத்துங்கள்

# Sortuj wszystko według stylów
source: Sort all lines by styles
ta: அனைத்து வரிகளையும் பாணிகளால் வரிசைப்படுத்துங்கள்

# Sortuj wszystko według aktora
source: Sort all lines by actor
ta: நடிகரின் அனைத்து வரிகளையும் வரிசைப்படுத்துங்கள்

# Sortuj wszystko według efektu
source: Sort all lines by effect
ta: எல்லா வரிகளையும் விளைவால் வரிசைப்படுத்தவும்

# Sortuj wszystko według warstwy
source: Sort all lines by layer
ta: அனைத்து வரிகளையும் அடுக்கு மூலம் வரிசைப்படுத்தவும்

# Sortuj zaznaczenie według czasu początkowego
source: Sort selected lines by start time
ta: தொடக்க நேரத்தின் மூலம் தேர்ந்தெடுக்கப்பட்ட வரிகளை வரிசைப்படுத்தவும்

# Sortuj zaznaczenie według czasu końcowego
source: Sort selected lines by end time
ta: தேர்ந்தெடுக்கப்பட்ட வரிகளை இறுதி நேரத்தில் வரிசைப்படுத்தவும்

# Sortuj zaznaczenie według stylów
source: Sort selected lines by styles
ta: தேர்ந்தெடுக்கப்பட்ட வரிகளை பாணிகளால் வரிசைப்படுத்தவும்

# Sortuj zaznaczenie według aktora
source: Sort selected lines by actor
ta: நடிகரின் தேர்ந்தெடுக்கப்பட்ட வரிகளை வரிசைப்படுத்தவும்

# Sortuj zaznaczenie według efektu
source: Sort selected lines by effect
ta: தேர்ந்தெடுக்கப்பட்ட வரிகளை விளைவு மூலம் வரிசைப்படுத்தவும்

# Sortuj zaznaczenie według warstwy
source: Sort selected lines by layer
ta: தேர்ந்தெடுக்கப்பட்ட வரிகளை அடுக்கு மூலம் வரிசைப்படுத்தவும்

# Przesuń czasy / uruchom post processor
source: Shift times / run time post processor
ta: நேரங்களை மாற்றவும் / நேர போச்ட் செயலி இயக்கவும்

# Przejdź do poprzedniej klatki kluczowej
source: Go to previous keyframe
ta: முந்தைய கீஃப்ரேமுக்குச் செல்லவும்

# Przejdź do następnej klatki kluczowej
source: Go to next keyframe
ta: அடுத்த கீஃப்ரேமுக்குச் செல்லவும்
