Repository: 247i/TACETr
Catalog: உரை/தானி/kainote-kainote-*.po
Languages: ta

# Pasek szukania
source: Search bar
ta: தேடல் பட்டி

# Rozciągnięcie w poziomie
source: Horizontal stretching
ta: கிடைமட்ட நீட்சி

# Rozciągnięcie w pionie
source: Vertical stretching
ta: செங்குத்து நீட்சி

# Głośność
source: Volume
ta: தொகுதி

# Połącz suwak głośności i rozciągnięcia
source: Link the slider of the volume and stretching
ta: தொகுதி மற்றும் நீட்டிப்பின் ச்லைடரை இணைக்கவும்

# Odtwórz poprzednią linijkę
source: Play the previous line
ta: முந்தைய வரியை விளையாடுங்கள்

# Odtwórz następną linijkę
source: Play the next line
ta: அடுத்த வரியை விளையாடுங்கள்

# Odtwórz aktualną sylabę / linijkę
source: Play next syllable / line
ta: அடுத்த எழுத்துக்கள் / வரியை விளையாடுங்கள்

# Odtwórz aktualną linijkę
source: Play the current line
ta: தற்போதைய வரியை விளையாடுங்கள்

# Zatrzymaj odtwarzanie
source: Stop playback
ta: பிளேபேக்கை நிறுத்துங்கள்

# Odtwórz przed znacznikiem
source: Play before the tag
ta: குறிச்சொல்லுக்கு முன் விளையாடுங்கள்

# Odtwórz po znaczniku
source: Play after the tag
ta: குறிச்சொல்லுக்குப் பிறகு விளையாடுங்கள்

# Odtwórz 500ms przed czasem startowym
source: Play 500ms before the start time
ta: தொடக்க நேரத்திற்கு முன் 500 மீ

# Odtwórz 500ms po czasie startowym
source: Play 500 ms after the start time
ta: தொடக்க நேரத்திற்குப் பிறகு 500 எம்.எச்

# Odtwórz 500ms przed czasem końcowym
source: Play 500ms before the end time
ta: இறுதி நேரத்திற்கு முன் 500 மீ

# Odtwórz 500ms po czasie końcowym
source: Play 500ms after the end time
ta: இறுதி நேரத்திற்குப் பிறகு 500 மீ

# Odtwórz do końca
source: Play to the end
ta: இறுதிவரை விளையாடுங்கள்

# Dodaj wstęp do aktywnej linijki
source: Add lead-in to the active line
ta: செயலில் உள்ள வரிக்கு முன்னணி சேர்க்கவும்

# Dodaj zakończenie do aktywnej linijki
source: Add lead-out to the active line
ta: செயலில் உள்ள வரியில் லீட்-அவுட் சேர்க்கவும்

# Zatwierdź zmiany
source: Apply changes
ta: மாற்றங்களைப் பயன்படுத்துங்கள்

# Przejdź do zaznaczenia
source: Go to selection
ta: தேர்வுக்குச் செல்லுங்கள்

# Włącz / Wyłącz tworzenie karaoke
source: Enable / Disable the creation of karaoke
ta: கரோக்கி உருவாக்கத்தை இயக்கவும் / முடக்கவும்

# Włącz / Wyłącz automatyczne dzielenie sylab
source: Enable / Disable automatic splitting of syllables
ta: எழுத்துக்களின் தானியங்கி பிளவுகளை இயக்கவும் / முடக்கவும்

# Automatycznie zatwierdza zmiany
source: Automatically approve changes
ta: மாற்றங்களை தானாக ஒப்புதல் அளிக்கவும்

# Przechodzenie do następnej linijki po zatwierdzeniu zmian
source: Going to the next line after the approval of changes
ta: மாற்றங்களின் ஒப்புதலுக்குப் பிறகு அடுத்த வரிக்குச் செல்வது

# Automatyczne przewijanie do aktywnej linijki
source: Auto-scroll to the active line
ta: செயலில் உள்ள வரிக்கு தானாக ச்க்ரோல்

# Tryb spektrum
source: Spectrum mode
ta: ச்பெக்ட்ரம் பயன்முறை

# Uwydatnienie częstotliwości głosu na spektrum
source: Spectrum speech frequency enhancement
ta: ச்பெக்ட்ரம் பேச்சு அதிர்வெண் மேம்பாடு

# Nieprawidłowy format klatek kluczowych
source: Invalid keyframes format
ta: தவறான கீஃப்ரேம்கள் வடிவம்

# Błąd
source: Error
ta: பிழை

# Nie można utworzyć obiektu Direct3D
source: Cannot create Direct 3D object
ta: நேரடி 3D பொருளை உருவாக்க முடியாது

# Nie można utworzyć urządzenia D3D9
source: Cannot create D3D9 device
ta: D3D9 சாதனத்தை உருவாக்க முடியாது

# Zawiodło któreś z ustawień DirectX
source: One of the DirectX settings failed
ta: டைரக்ட்எக்ச் அமைப்புகளில் ஒன்று தோல்வியடைந்தது

# Nie można ustawić macierzy porojekcji
source: Cannot set matrix projection
ta: மேட்ரிக்ச் திட்டத்தை அமைக்க முடியாது

# Nie można ustawić macierzy świata
source: Cannot set matrix view
ta: மேட்ரிக்ச் பார்வையை அமைக்க முடியாது

# Nie można ustawić macierzy widoku
source: Cannot set matrix world
ta: மேட்ரிக்ச் உலகத்தை அமைக்க முடியாது

# Nie można stworzyć powierzchni
source: Cannot create surface
ta: மேற்பரப்பை உருவாக்க முடியாது

# Nie można stworzyć linii D3DX
source: Cannot open D3DX line
ta: D3DX வரியைத் திறக்க முடியாது

# Nie można stworzyć czcionki D3DX
source: Cannot create D3DX font
ta: D3DX எழுத்துருவை உருவாக்க முடியாது

# Nie można stworzyć plain surface
source: Cannot create plain surface
ta: வெற்று மேற்பரப்பை உருவாக்க முடியாது

# Nie można zresetować Direct3D
source: Cannot reset Direct3D
ta: நேரடி 3 டி மீட்டமைக்க முடியாது

# Zmodyfikowano
source: Modified
ta: மாற்றியமைக்கப்பட்ட

# Czas ujemny
source: Negative time
ta: எதிர்மறை நேரம்

# Nie można zablokować bufora tekstury
source: Cannot lock texture buffer
ta: அமைப்பு இடையகத்தை பூட்ட முடியாது

# Nie można nałożyć powierzchni spectrum na siebie
source: Cannot blit spectrum surfaces
ta: ச்பெக்ட்ரம் மேற்பரப்புகளை கலக்க முடியாது

# Otwórz plik autozapisu
source: Open auto save file
ta: ஆட்டோ சேமி கோப்பைத் திறக்கவும்

# Wyszukaj pliki
source: Find files
ta: கோப்புகளைக் கண்டறியவும்

# Filtruj listę
source: Filter list
ta: வடிகட்டி பட்டியல்

# Wszystkie słowa
source: Seek for all words
ta: எல்லா வார்த்தைகளையும் தேடுங்கள்

# Pliki
source: Files
ta: கோப்புகள்

# Wersje
source: Versions
ta: பதிப்புகள்

# Otwórz
source: Open
ta: திற

# Anuluj
source: Cancel
ta: ரத்துசெய்

# Nie można otworzyć folderu autozapisu
source: Cannot open auto save folder
ta: ஆட்டோ சேமி கோப்புறையைத் திறக்க முடியாது

# Bez Nazwy
source: Untitled
ta: தலைப்பிடப்படாத

# Folder autozapisu jest pusty
source: Auto save folder is empty
ta: ஆட்டோ சேமி கோப்புறை காலியாக உள்ளது

# Wczytywanie autozapisu nie powiodło się
source: Could not open auto save folder
ta: ஆட்டோ சேமிப்பு கோப்புறையைத் திறக்க முடியவில்லை

# Usuń pliki tymczasowe
source: Remove temporary files
ta: தற்காலிக கோப்புகளை அகற்று

# Usuń pliki starsze niż
source: Remove files older than
ta: பழைய கோப்புகளை அகற்று

# Styczeń
source: January
ta: மா-தை

# Luty
source: February
ta: தை-மாசி

# Marzec
source: March
ta: மா-பங்குனி

# Kwiecień
source: April
ta: ப-சித்திரை

# Maj
source: May
ta: சி-வைகாசி

# Czerwiec
source: June
ta: வை-ஆனி

# Lipiec
source: July
ta: ஆ-ஆடி

# Sierpień
source: August
ta: ஆ-ஆவணி

# Wrzesień
source: September
ta: ஆ-புரட்டாசி

# Październik
source: October
ta: பு-ஐப்பசி

# Listopad
source: November
ta: ஐ-கார்த்திகை

# Grudzień
source: December
ta: கா-மார்கழி

# Usuń z wszystkich folderów
source: Remove from all folders
ta: அனைத்து கோப்புறைகளிலிருந்தும் அகற்று

# Usuń wszystkie pliki
source: Remove all files
ta: எல்லா கோப்புகளையும் அகற்று

# Usuń wszystkie starsze pliki
source: Remove all older files
ta: எல்லா பழைய கோப்புகளையும் அகற்று

# Auto zapis
source: Auto save
ta: தானியங்கு சேமிப்பு

# Usuń wybrane pliki auto zapisu
source: Remove chosen auto save files
ta: தேர்ந்தெடுக்கப்பட்ட ஆட்டோ சேமி கோப்புகளை அகற்று

# Usuń wszystkie pliki auto zapisu
source: Remove all auto save files
ta: அனைத்து ஆட்டோ சேமிப்பு கோப்புகளையும் அகற்று

# Usuń starsze pliki auto zapisu
source: Remove older auto save files
ta: பழைய ஆட்டோ சேமி கோப்புகளை அகற்று

# Indeks
source: FFMS2 index
ta: FFMS2 குறியெண்

# Usuń wybrane indeksy
source: Remove chosen index files
ta: தேர்ந்தெடுக்கப்பட்ட குறியீட்டு கோப்புகளை அகற்று

# Usuń wszystkie indeksy
source: Remove all index files
ta: எல்லா குறியீட்டு கோப்புகளையும் அகற்று

# Usuń starsze indeksy
source: Remove older index files
ta: பழைய குறியீட்டு கோப்புகளை அகற்று

source: Audio cache
ta: கேச் ஆடியோ

# Usuń wybrane pliki audio cache
source: Remove chosen audio cache files
ta: தேர்ந்தெடுக்கப்பட்ட ஆடியோ கேச் கோப்புகளை அகற்று

# Usuń wszystkie pliki audio cache
source: Remove all audio cache files
ta: எல்லா ஆடியோ கேச் கோப்புகளையும் அகற்று

# Usuń starsze pliki audio cache
source: Remove older audio cache files
ta: பழைய ஆடியோ கேச் கோப்புகளை அகற்று

source: Subtitle files (*.ass),(*.ssa),(*.srt),(*.sub),(*.txt)|*.ass;*.ssa;*.srt;*.sub;*.txt
ta: வசன வரிகள் (*.ஆச்), (*. எச்.எச்.ஏ), (*. எச்.ஆர்.டி), (*. துணை), (*. txt

# Pliki indeksów (*.ffindex)|*.ffindex
source: Index files (*.ffindex)|*.ffindex
ta: குறியீட்டு கோப்புகள் (*.FFINDEX) |*.fffindex

# Pliki audio cache (*.w64)|*.w64
source: Audio cache files (*.w64)|*.w64
ta: ஆடியோ கேச் கோப்புகள் (*.w64) |*.w64

# Wybierz plik i do usunięcia
source: Choose file to remove
ta: அகற்ற கோப்பைத் தேர்வுசெய்க

# Nie można otworzyć folderu plików tymczasowych
source: Cannot open temporary files folder
ta: தற்காலிக கோப்புகள் கோப்புறையைத் திறக்க முடியாது

# Błąd inicjalizacji skryptu Lua "%s": %s.
source: Error initialization script Lua "%s": %s.
ta: பிழை துவக்க ச்கிரிப்ட் லுவா "%s": %s.

source: You are trying to load the script Automation 3 as a script Automation 4. Automation 3 is no longer supported.
ta: ச்கிரிப்ட் ஆட்டோமேசன் 3 ஐ ச்கிரிப்ட் ஆட்டோமேசன் 4 ஆக ஏற்ற முயற்சிக்கிறீர்கள். ஆட்டோமேசன் 3 இனி ஆதரிக்கப்படாது.

# Makro o nazwie '%s' jest już zdefiniowane w skrypcie '%s'
source: Macro named '%s' is already defined in the script '%s'
ta: '%s' என்று பெயரிடப்பட்ட மேக்ரோ '%s' ச்கிரிப்டில் ஏற்கனவே வரையறுக்கப்பட்டுள்ளது

# Wystąpił błąd podczas wykonywania skryptu Lua:
source: An error occurred during the loading of the script Lua:
ta: ச்கிரிப்ட் லுவா ஏற்றும்போது பிழை ஏற்பட்டது:

# Błąd wczytywania skryptu Lua: %s %s
source: Error loading script Lua: %s %s
ta: ச்கிரிப்டை ஏற்றுவதில் பிழை லுவா: %s %s

# Nieznany błąd wczytywania skryptu Lua: %s.
source: Unknown error loading the script Lua: %s.
ta: அறியப்படாத பிழை ச்கிரிப்டை ஏற்றுவதில் LUA: %s.

source: One or more autoload script contains errors. See descriptions of the script for more information.
ta: ஒன்று அல்லது அதற்கு மேற்பட்ட ஆட்டோலோட் ச்கிரிப்டில் பிழைகள் உள்ளன. மேலும் தகவலுக்கு ச்கிரிப்டின் விளக்கங்களைப் பார்க்கவும்.

source: At least one script from a subtitles file contains errors. See description of the script for more information.
ta: வசன வரிகளிலிருந்து குறைந்தது ஒரு ச்கிரிப்டில் பிழைகள் உள்ளன. மேலும் தகவலுக்கு ச்கிரிப்டின் விளக்கத்தைப் பார்க்கவும்.

# Wybierz edytor skryptów
source: Select a script editor
ta: ச்கிரிப்ட் எடிட்டரைத் தேர்ந்தெடுக்கவும்

# Programy (*.exe)|*.exe|Wszystkie pliki (*.*)|*.*
source: Programs (* .exe) | * .exe | All Files (*. *) | *. *
ta: நிரல்கள் (* .exe) | * .exe | எல்லா கோப்புகளும் ( *. *) | *. *

# Nie można uruchomić edytora.
source: Cannot start editor.
ta: எடிட்டரைத் தொடங்க முடியாது.

# Błąd automatyzacji
source: Automation error
ta: ஆட்டோமேசன் பிழை

# Pełny opis błędu Lua
source: Full description of the error Lua
ta: பிழையின் முழு விளக்கம் லுவா

# Edytuj
source: Edit
ta: தொகு

# Odśwież
source: Refresh
ta: புதுப்பிப்பு

# Lista skrótów klawiszowych skryptów automatyzacji
source: List of automation shortcuts
ta: ஆட்டோமேசன் குறுக்குவழிகளின் பட்டியல்

# Ścieżka i nazwa skryptu
source: Path and script name
ta: பாதை மற்றும் ச்கிரிப்ட் பெயர்

# Makro
source: Macro
ta: குறுநிரல்

# Skrót
source: Hotkey
ta: ஆட்ச்கி

# Folder automatycznego wczytywania
source: Autoload folder
ta: ஆட்டோலோட் கோப்புறை

# Z napisów
source: From subs
ta: சப்சிலிருந்து

# Mapuj skrót
source: Map hotkey
ta: வரைபட ஆட்ச்கி

# Usuń skrót
source: Delete hotkey
ta: ஆட்ச்கியை நீக்கு

# Globalny
source: Global
ta: உலகளாவிய

# Napisy
source: Subtitles
ta: வசன வரிகள்

# Edytor
source: Editor
ta: திருத்தி

# Wideo
source: Video
ta: ஒளிதோற்றம்

source: Audio
ta: ஆடியோ

# Ten skrót już istnieje jako skrót do "%s". Co zrobić?
source: This hotkey already exists for "%s". What to do?
ta: இந்த ஆட்கி ஏற்கனவே "%s" க்கு உள்ளது. என்ன செய்வது?

# Uwaga
source: Warning
ta: எச்சரிக்கை

# Zamień skróty
source: Switch hotkeys
ta: ஆட்ச்கிகளை மாற்றவும்

# Ten skrót już istnieje w %s jako skrót do "%s". Co zrobić?
source: This shortcut exist in %s as shortcut to "%s". What to do?
ta: இந்த குறுக்குவழி %s இல் " %s" க்கு குறுக்குவழியாக உள்ளது. என்ன செய்வது?

# innych oknach
source: another windows
ta: மற்றொரு சாளரங்கள்

# innym oknie
source: another window
ta: மற்றொரு சாளரம்

# Ustaw mimo to
source: Set still
ta: இன்னும் அமைக்கவும்

# Zamknij
source: Close
ta: மூடு

# stylów
source: styles
ta: பாணிகள்

# dialogów
source: dialogues
ta: உரையாடல்கள்

# Nie można dodać linii klasy: %s w pole klasy: %s
source: Cannot add line of class: %s in field of class: %s
ta: வகுப்பின் வரியைச் சேர்க்க முடியாது: வர்க்கத் துறையில் %s: %s

# Brakujący wskaźnik napisów
source: Missing subtitles pointer
ta: வசன வரிகள் சுட்டிக்காட்டுகின்றன

# Skrót można ustawić Shift + Klik
source: Shortcut can be set using Shift + Click
ta: சிப்ட் + சொடுக்கு பயன்படுத்தி குறுக்குவழியை அமைக்கலாம்

# Wybierz kolor
source: Choose color
ta: வண்ணத்தைத் தேர்வுசெய்க

# Kolor spektrum
source: Spectrum color
ta: ச்பெக்ட்ரம் நிறம்

# Kolor RGB
source: RGB color
ta: ஆர்சிபி நிறம்

# Kolor HSL
source: HSL color
ta: எச்.எச்.எல் நிறம்

# Kolor HSV
source: HSV color
ta: HSV நிறம்

# Kolor podstawowy
source: Primary color
ta: முதன்மை நிறம்

# Kolor zastępczy
source: Secondary color
ta: இரண்டாம் நிலை நிறம்

# Kolor obwódki
source: Border color
ta: எல்லை நிறம்

# Kolor cienia
source: Shadow color
ta: நிழல் நிறம்

# Zamień ze sobą skróty próbnika i okna wyboru kolorów
source: Swap shortcuts of colorpicker and color choose window
ta: கலர் பிக்கர் மற்றும் வண்ணத்தின் குறுக்குவழிகளை மாற்றவும் சாளரத்தைத் தேர்வுசெய்க

source: Checking this option open colorpicker on left mouse click, and color choose window after right click.
ta: இந்த விருப்பத்தை சரிபார்க்கிறது இடது மவுச் கிளிக்கில் கலர் பிக்கரைத் திறக்கவும், வலது சொடுக்கு செய்த பிறகு சாளரத்தைத் தேர்வுசெய்க.

# Wybrany kolor:
source: Selected color:
ta: தேர்ந்தெடுக்கப்பட்ட நிறம்:

# Czerwony:
source: Red:
ta: சிவப்பு:

# Zielony:
source: Green:
ta: பச்சை:

# Niebieski:
source: Blue:
ta: நீலம்:

# Odcień:
source: Hue:
ta: சாயல்:

# Nasycenie:
source: Saturation:
ta: செறிவு:

# Jaskrawość:
source: Lightness:
ta: லேசான தன்மை:

# Wartość:
source: Value:
ta: மதிப்பு:

# Próbnik koloru
source: Color picker
ta: வண்ண தேர்வாளர்

# Przenoś okno w miejsce wyboru koloru
source: Move window in place of color pick
ta: சாளரத்தை நகர்த்தவும் வண்ண தேர்வுக்கு பதிலாக

# Wystąpił błąd indeksowania: %s
source: Indexing error occurred: %s
ta: குறியீட்டு பிழை ஏற்பட்டது: %s

# Plik nie ma żadnej ścieżki z napisami.
source: File doesn't have any subtitles.
ta: கோப்பில் எந்த வசனங்களும் இல்லை.

# Wybierz ścieżkę napisów
source: Choose subtitles track
ta: வசன வரிகளைத் தேர்வுசெய்க

# Odczyt napisów z pliku Matroska.
source: Loading subtitles from Matroska.
ta: மேட்ரோச்காவிலிருந்து வசன வரிகள் ஏற்றுகின்றன.

# Sugestie poprawy
source: Fix suggestions
ta: பரிந்துரைகளை சரிசெய்யவும்

# &Kopiuj
source: Copy
ta: நகலெடு

# Wy&tnij
source: Cut
ta: வெட்டு

# &Wklej
source: Paste
ta: ஒட்டு

# Szukaj tłumaczenia słowa na ling.pl
source: Search word translation on ling.pl
ta: Ling.pl இல் சொல் மொழிபெயர்ப்பைத் தேடுங்கள்

# Szukaj tłumaczenia słowa na pl.ba.bla
source: Search word translation on pl.ba.bla
ta: Pl.ba.bla இல் சொல் மொழிபெயர்ப்பைத் தேடுங்கள்

# Szukaj zaznaczonej frazy w Google
source: Seek selected phrase in Google
ta: Google இல் தேர்ந்தெடுக்கப்பட்ட சொற்றொடரைத் தேடுங்கள்

# Szukaj synonimu na synonimy.net
source: Search for synonyms on synonimy.net
ta: Synonimy.net இல் ஒத்த சொற்களைத் தேடுங்கள்

# Sprawdzanie pisowni
source: Spellchecker
ta: தோல்வி காசோலைகள்

# Zainstalowane języki
source: Installed languages
ta: நிறுவப்பட்ட மொழிகள்

# &Dodaj słowo "%s" do słownika
source: Add word "%s" to dictionary
ta: அகராதியில் "%s" என்ற வார்த்தையைச் சேர்க்கவும்

# &Usuń
source: Delete
ta: நீக்கு

# Pokaż pasek stanu
source: Show status bar
ta: நிலை பட்டியைக் காட்டு

# Automatycznie zamieniaj cudzysłów
source: Automatically change quotes
ta: தானாகவே மேற்கோள்களை மாற்றவும்

# Błąd, słowo "%s" nie zostało dodane.
source: Error. Word "%s" was not added.
ta: பிழை. "%s" என்ற சொல் சேர்க்கப்படவில்லை.

# Opcje dummy wideo
source: Dummy video options
ta: போலி வீடியோ விருப்பங்கள்

# Rozdzielczość wideo:
source: Video resolution:
ta: வீடியோ தீர்மானம்:

# Siatka
source: Checkerboard pattern
ta: செக்கர்போர்டு முறை

# Kolor:
source: Color:
ta: வண்ணம்:

# Klatki na sekundę:
source: Frames per second:
ta: நொடிக்கு பிரேம்கள்:

# Co daje %i klatek
source: It's %i frames
ta: இது %நான் பிரேம்கள்

# Czas trwania:
source: Duration:
ta: காலம்:

# Nieprawidłowa wartość fps.
source: Bad FPS.
ta: மோசமான எஃப்.பி.எச்.

# Wpisz tag ASS
source: Enter ASS tag
ta: கழுதை குறிச்சொல்லை உள்ளிடவும்

# Tag wstawiany w miejsce kursora
source: Tag inserted in place of cursor
ta: குறிச்சொல் கர்சருக்கு பதிலாக செருகப்பட்டது

# Tag wstawiany na początku tekstu
source: Insert Tag at text beginning
ta: உரை தொடக்கத்தில் குறிச்சொல்லைச் செருகவும்

# Zwykły tekst
source: Plain text
ta: சாதாரண எழுத்து

# Nazwa przycisku
source: Button name
ta: பொத்தான் பெயர்

# Tag przycisku
source: Tag of button
ta: பொத்தானின் குறிச்சொல்

# Zapisz tag
source: Save tag
ta: குறிச்சொல்லைச் சேமிக்கவும்

# Wybór czcionki
source: Font selection
ta: எழுத்துரு தேர்வு

# Pogrubienie
source: Bold
ta: தடிமான

# Pochylenie
source: Italic
ta: சாய்வு

# Podkreślenie
source: Underline
ta: அடிக்கோடிட்டு

# Przekreślenie
source: Strikethrough
ta: ச்ட்ரைகெத்ரோ

# Kolor zastępczy do karaoke
source: Secondary color for karaoke
ta: கரோக்கிக்கு இரண்டாம் நிலை வண்ணம்

# Tryb tłumacza
source: Translator mode
ta: மொழிபெயர்ப்பாளர் பயன்முறை

# Linia: 0
source: Line: 0
ta: வரி: 0

# Łamania: 0/86
source: Wraps: 0/86
ta: மறைப்புகள்: 0/86

# Znaki na sekundę: 0<=15
source: Characters per second: 0<=15
ta: நொடிக்கு எழுத்துக்கள்: 0 <= 15

# Czas
source: Time
ta: நேரம்

# Klatki
source: Frames
ta: சட்டங்கள்

# Wklej wszystko
source: Paste all
ta: அனைத்தையும் ஒட்டவும்

# Wklej zaznaczone
source: Paste the selected
ta: தேர்ந்தெடுக்கப்பட்டதை ஒட்டவும்

# Ukryj oryginał
source: Hide original
ta: அசலை மறைக்கவும்

# Niepewne
source: Not confirmed
ta: உறுதிப்படுத்தப்படவில்லை

# Przenoszenie tagów
source: Moving tags
ta: நகரும் குறிச்சொற்கள்

# Komentarz
source: Comment
ta: கருத்து

# Aktor
source: Actor
ta: நடிகர்

# Efekt
source: Effect
ta: விளைவு

# Linia: %i
source: Line: %i
ta: வரி: %i

# Łamania:
source: Wraps:
ta: மறைப்புகள்:

# Znaki na sekundę: %i<=15
source: Characters per second: %i<=15
ta: நொடிக்கு எழுத்துக்கள்: %i <= 15

# Położenie tekstu
source: Text position
ta: உரை நிலை

source: Translator mode displays and saves both foreign text and translation text
ta: மொழிபெயர்ப்பாளர் பயன்முறை வெளிநாட்டு உரை மற்றும் மொழிபெயர்ப்பு உரை இரண்டையும் காண்பிக்கும் மற்றும் சேமிக்கிறது

# Kopiuje cały tekst obcojęzyczny do pola z tłumaczeniem
source: Copies the entire text of the foreign language to the field of translation
ta: வெளிநாட்டு மொழியின் முழு உரையையும் மொழிபெயர்ப்பு துறையில் நகலெடுக்கிறது

# Kopiuje zaznaczony tekst obcojęzyczny do pola z tłumaczeniem
source: Copies selected text foreign language to the field of translation
ta: மொழிபெயர்ப்பு துறையில் தேர்ந்தெடுக்கப்பட்ட உரை வெளிநாட்டு மொழியை நகல்கள்

# Ustawia linijkę jako komentarz. Komentarze nie są wyświetlane
source: Sets the line as a comment. Comments are not shown
ta: ஒரு கருத்தாக வரியை அமைக்கிறது. கருத்துகள் காட்டப்படவில்லை

# Warstwa linijki, wyższe warstwy są na wierzchu
source: The layer line. The higher layers are on top
ta: அடுக்கு வரி. அதிக அடுக்குகள் மேலே உள்ளன

# Czas początkowy linijki
source: Line start time
ta: வரி தொடக்க நேரம்

# Czas końcowy linijki
source: Line end time
ta: வரி இறுதி நேரம்

# Czas trwania linijki
source: Line duration
ta: வரி காலம்

# Styl linijki
source: Line style
ta: வரி நடை

# Umożliwia szybką edycję stylu linijki
source: You can quickly edit style for current line
ta: தற்போதைய வரிக்கான பாணியை விரைவாக திருத்தலாம்

# Oznaczenie aktora linijki. Nie wpływa na wygląd napisów
source: Marking actor. It does not affect the appearance of the subtitles
ta: குறிக்கும் நடிகர். இது வசன வரிகள் தோற்றத்தை பாதிக்காது

# Margines lewy linijki
source: Left margin line
ta: இடது விளிம்பு வரி

# Margines prawy linijki
source: Right margin line
ta: வலது விளிம்பு வரி

# Margines górny i dolny linijki
source: The top and bottom margin line
ta: மேல் மற்றும் கீழ் விளிம்பு வரி

source: The line effect. It is used to mark lines, which used to be karaoke or VSFilter effects
ta: வரி விளைவு. இது கோடுகளைக் குறிக்கப் பயன்படுகிறது, இது கரோக்கி அல்லது வி.எச்.பில்டர் விளைவுகளாக இருந்தது

source: Number of characters in each line. No more than 43 characters per line (maximum 2 lines).
ta: ஒவ்வொரு வரியிலும் எழுத்துகளின் எண்ணிக்கை. ஒரு வரிக்கு 43 எழுத்துகளுக்கு மேல் இல்லை (அதிகபட்சம் 2 கோடுகள்).

# Znaki na sekundę. Nie powinny przekraczać 15 znaków na sekundę
source: Characters per second. Should not exceed 15 characters per second
ta: ஒரு நொடிக்கு எழுத்துக்கள். நொடிக்கு 15 எழுத்துகளுக்கு மிகாமல் இருக்கக்கூடாது

# Zmień ilość przycisków
source: Change amount of buttons
ta: பொத்தான்களின் அளவை மாற்றவும்

# Nie znaleziono niepewnych
source: Not confirmed not found
ta: காணப்படவில்லை என்பதை உறுதிப்படுத்தவில்லை

# Nie znaleziono nieprzetłumaczonych
source: Untranslated not found
ta: மொழிபெயர்க்கப்படாதது கிடைக்கவில்லை

# Zarządzaj przyciskami tagów
source: Manage tag buttons
ta: குறிச்சொல் பொத்தான்களை நிர்வகிக்கவும்

# Szukany tekst:
source: Search text:
ta: தேடல் உரை:

# Zamień na:
source: Replace with:
ta: இதனுடன் மாற்றவும்:

source: Windows search filters separated by semicolons, e.g. "*.ass; *.srt". Because of the large video file, the search for everything "*. *" Is changed to *.ass
ta: அரைக்காற்புள்ளிகளால் பிரிக்கப்பட்ட சாளரங்கள் தேடல் வடிப்பான்கள், எ.கா. " *.ஆச்; *.srt". பெரிய வீடியோ கோப்பு காரணமாக, எல்லாவற்றிற்கும் தேடல் " *. *" *.

# Filtry:
source: Filters:
ta: வடிப்பான்கள்:

# Katalog szukania napisów:
source: Subtitles seeking folder:
ta: கோப்புறை தேடும் வசன வரிகள்:

# Wybierz folder zapisu
source: Choose save folder
ta: சேமி கோப்புறையைத் தேர்வுசெய்க

# Katalog:
source: Catalog:
ta: பட்டியல்:

# Uwzględniaj wielkość liter
source: Match case
ta: போட்டி வழக்கு

# Wyrażenia regularne
source: Regular expressions
ta: வழக்கமான வெளிப்பாடுகள்

# Początek tekstu
source: Beginning of text
ta: உரையின் துவக்கம்

# Koniec tekstu
source: End of text
ta: உரையின் முடிவு

# Uwzględnij komentarze
source: Use comments
ta: கருத்துகளைப் பயன்படுத்துங்கள்

# Pomiń tagi
source: Skip tags
ta: குறிச்சொற்களைத் தவிர்க்கவும்

# Pomiń tekst
source: Skip text
ta: உரையைத் தவிர்க்கவும்

# W polu
source: In field
ta: புலத்தில்

# Tekst
source: Text
ta: உரை

# Styl
source: Style
ta: சூல் தண்டு

# Znajdź
source: Find
ta: கண்டுபிடி

# Znajdź we wszystkich otwartych napisach
source: Find in all opened subtitles
ta: திறக்கப்பட்ட அனைத்திலும் காண்க வசன வரிகள்

# Znajdź wszystko w bieżących napisach
source: Find all in current subtitles
ta: அனைத்தையும் கண்டுபிடி தற்போதைய வசன வரிகள்

# Zamień następne
source: Swap next
ta: அடுத்து இடமாற்றம் செய்யுங்கள்

# Zamień wszystko
source: Replace all
ta: அனைத்தையும் மாற்றவும்

# Zamień we wszystkich otwartych napisach
source: Find in all opened subtitles
ta: திறக்கப்பட்ட அனைத்திலும் காண்க வசன வரிகள்

# Znajdź w napisach
source: Find in subtitles
ta: வசன வரிகள் காண்க

# Zamień w napisach
source: Replace in subtitles
ta: வசன வரிகள் மாற்றவும்

# Szukaj w podfolderach
source: Seek in subfolders
ta: துணை கோப்புறைகளில் தேடுங்கள்

# Szukaj w ukrytych folderach
source: Seek in hidden folders
ta: மறைக்கப்பட்டு தேடுங்கள் கோப்புறைகள்

# Linijki
source: Lines
ta: வரிகள்

# Wszystkie linijki
source: All lines
ta: அனைத்து வரிகளும்

# Zaznaczone linijki
source: Selected lines
ta: தேர்ந்தெடுக்கப்பட்ட கோடுகள்

# Od zaznaczonej
source: From selected
ta: தேர்ந்தெடுக்கப்பட்டதிலிருந்து

# Znajdź i zamień
source: Find and replace
ta: கண்டுபிடித்து மாற்றவும்

# Wyniki szukania
source: Seeking results
ta: முடிவுகளைத் தேடுகிறது

# Zahacz wszystko
source: Check all
ta: அனைத்தையும் சரிபார்க்கவும்

# Odhacz wszystko
source: Uncheck all
ta: அனைத்தையும் தேர்வு செய்யவும்

# Zamień
source: Replace
ta: மாற்றவும்

# Linia %i:
source: Line %i:
ta: வரி %i:

# Wybierz nazwę profilu
source: Select the name of the profile
ta: சுயவிவரத்தின் பெயரைத் தேர்ந்தெடுக்கவும்

# Wprowadź nową nazwę katalogu
source: Choose new catalog name
ta: புதிய அட்டவணை பெயரைத் தேர்வுசெய்க

# Proszę wprowadzić nazwę nowego katalogu
source: Enter a name for the new catalog
ta: புதிய பட்டியலுக்கு ஒரு பெயரை உள்ளிடவும்

# Informacja
source: Info
ta: தகவல்
