Repository: 247i/TACETr
Catalog: உரை/தானி/kainote-kainote-*.po
Languages: ta

# Filtruj po wczytaniu napisów
source: Filter after loading subtitles
ta: வசன வரிகள் ஏற்றிய பின் வடிகட்டவும்

# Nie resetuj wcześniejszego filtrowania
source: Don't reset previous filtering
ta: முந்தைய வடிகட்டலை மீட்டமைக்க வேண்டாம்

# Ignoruj filtrowanie przy akcjach
source: Ignore filtering in some actions
ta: சில செயல்களில் வடிகட்டலை புறக்கணிக்கவும்

# Filtrowanie odwrócone
source: Reverse filtering
ta: தலைகீழ் வடிகட்டுதல்

# Ukryj aktora
source: Hide actor
ta: நடிகரை மறைக்கவும்

# Ukryj znaki na sekundę
source: Hide characters per second
ta: ஒரு நொடிக்கு எழுத்துக்களை மறைக்கவும்

# Ukryj czas końcowy
source: Hide end time
ta: இறுதி நேரத்தை மறைக்கவும்

# Ukryj efekt
source: Hide effect
ta: விளைவை மறைக்க

# Ukryj warstwę
source: Hide layer
ta: அடுக்கு மறைக்க

# Ukryj lewy margines
source: Hide left margin
ta: இடது விளிம்பை மறைக்கவும்

# Ukryj prawy margines
source: Hide right margin
ta: சரியான விளிம்பை மறைக்கவும்

# Ukryj pionowy margines
source: Hide vertical margin
ta: செங்குத்து விளிம்பை மறைக்கவும்

# Ukryj czas początkowy
source: Hide start time
ta: தொடக்க நேரத்தை மறைக்கவும்

# Ukryj styl
source: Hide style
ta: பாணியை மறைக்கவும்

# Stwórz drzewko
source: Make tree
ta: மரத்தை உருவாக்குங்கள்

# Lista osób pomocnych przy tworzeniu programu
source: Credits
ta: வரவு

# Ukryj / pokaż pasek postępu
source: Show / hide progress bar
ta: முன்னேற்றப் பட்டியைக் காட்டவும் / மறைக்கவும்

# Ukryj zaznaczone linijki
source: Hide selected lines
ta: தேர்ந்தெடுக்கப்பட்ட வரிகளை மறைக்கவும்

# Ukryj tagi w nawiasach
source: Hide tags
ta: குறிச்சொற்களை மறைக்கவும்

# Wstaw po
source: Insert after
ta: பின்னர் செருகவும்

# Wstaw po z czasem wideo
source: Insert after with video time
ta: வீடியோ நேரத்துடன் செருகவும்

# Wstaw po z czasem klatki wideo
source: Insert after with video frame time
ta: வீடியோ பிரேம் நேரத்துடன் செருகவும்

# Wstaw przed
source: Insert before
ta: முன் செருகவும்

# Wstaw przed z czasem wideo
source: Insert before with video time
ta: வீடியோ நேரத்துடன் முன் செருகவும்

# Wstaw przed z czasem klatki wideo
source: Insert before with video frame time
ta: வீடியோ பிரேம் நேரத்துடன் முன் செருகவும்

# Złącz linijki
source: Join lines
ta: வரிகளில் சேரவும்

# Złącz linijki zostaw pierwszą
source: Join lines and keep first
ta: வரிகளில் சேர்ந்து முதலில் வைக்கவும்

# Złącz linijki zostaw ostatnią
source: Join lines and keep last
ta: வரிகளில் சேரவும், கடைசியாக வைக்கவும்

# Otwórz klatki kluczowe
source: Open keyframes
ta: கீஃப்ரேம்களைத் திறக்கவும்

# Otwórz autozapis
source: Open auto save
ta: திறந்த ஆட்டோ சேமிப்பு

# Uruchom ostatnio zaczytany skrypt
source: Run recent script
ta: அண்மைக் கால ச்கிரிப்டை இயக்கவும்

# Ustaw nowy FPS
source: Set new FPS
ta: புதிய FPS ஐ அமைக்கவும்

# Otwórz audio
source: Open audio
ta: திறந்த ஆடியோ

# Wklej tekst tłumaczenia
source: Paste text translations
ta: உரை மொழிபெயர்ப்புகளை ஒட்டவும்

# Odtwórz aktywną linijkę
source: Play active line
ta: செயலில் வரி விளையாடுங்கள்

# Usuń napisy z edytora
source: Remove subtitles from the editor
ta: எடிட்டரிடமிருந்து வசன வரிகள் அகற்றவும்

# Zapisz wszystkie napisy
source: Save all subtitles
ta: அனைத்து வசனங்களையும் சேமிக்கவும்

# Zapisz tłumaczenie
source: Save translation
ta: மொழிபெயர்ப்பைச் சேமிக்கவும்

# Zapisuj napisy z nazwą wideo
source: Save the subtitles with name of the video
ta: வீடியோவின் பெயருடன் வசன வரிகள் சேமிக்கவும்

# Zaznacz linijki
source: Select lines
ta: வரிகளைத் தேர்ந்தெடுக்கவும்

# Ustaw audio z czasem wideo
source: Set audio with video time
ta: வீடியோ நேரத்துடன் ஆடியோவை அமைக்கவும்

# Ustaw znacznik audio z czasem wideo
source: Set audio marker with video time
ta: வீடியோ நேரத்துடன் ஆடியோ மார்க்கரை அமைக்கவும்

# Ustawienia
source: Settings
ta: அமைப்புகள்

# Przejdź do czasu początkowego linii
source: Go to start time
ta: தொடக்க நேரத்திற்குச் செல்லுங்கள்

# Przejdź do czasu końcowego linii
source: Go to end time of line
ta: வரியின் இறுதி நேரத்திற்குச் செல்லுங்கள்

# Sprawdź poprawność pisowni
source: Spell checker
ta: எழுத்துப்பிழை சரிபார்ப்பு

# Kopiuj klatkę z napisami do schowka
source: Copy frame with subtitles to clipboard
ta: இடைநிலைப்பலகைக்கு வசன வரிகளுடன் சட்டகத்தை நகலெடுக்கவும்

# Zapisz klatkę z napisami jako PNG
source: Save frame with subtitles as PNG
ta: பி.என்.சி என வசன வரிகள் மூலம் சட்டத்தை சேமிக்கவும்

# Zmień rozdzielczość napisów
source: Resample subtitles
ta: மறுவிற்பனை வசன வரிகள்

# Wczytaj napisy z pliku MKV
source: Load subtitles of MKV file
ta: MKV கோப்பின் வசன வரிகள் ஏற்றவும்

# Zamień linie
source: Swap lines
ta: இடமாற்று கோடுகள்

# Okno przesuwania dialogów
source: Match translation to existing subs
ta: தற்போதுள்ள துணைக்கு மொழிபெயர்ப்புடன் பொருந்தவும்

# Cofnij do ostatniego zapisu
source: Undo to last save
ta: கடைசியாக சேமிக்க செயல்தவிர்க்கவும்

# Otwieraj wideo przez FFMS2
source: Open video with FFMS2
ta: FFMS2 உடன் வீடியோவைத் திறக்கவும்

# Powiększ wideo
source: Zoom video
ta: சூம் வீடியோ

# Widok wszystko
source: View all
ta: அனைத்தையும் காண்க

# Widok audio i napisy
source: View audio and subtitles
ta: ஆடியோ மற்றும் வசன வரிகள் காண்க

# Widok tylko napisy
source: View only subtitles
ta: வசன வரிகள் மட்டுமே காண்க

# Widok wideo i napisy
source: View video and subtitles
ta: வீடியோ மற்றும் வசனங்களைக் காண்க

# Widok tylko wideo
source: View only video
ta: வீடியோவைக் காண்க

# Oczyść style pliku ASS
source: Clean styles of ASS file
ta: கழுதை கோப்பின் தூய்மையான பாணிகள்

# Popraw drobne błędy (eksperymentalne)
source: Multireplacer (experimental)
ta: மல்டிர்பிளாசர் (சோதனை)

# Pełny ekran
source: Full screen
ta: முழுத் திரை

# Wczytaj ostatnią sesję
source: Load last session
ta: கடைசி அமர்வை ஏற்றவும்

# Zastosuj dla wszystkich
source: Apply to All
ta: அனைவருக்கும் பொருந்தும்

# Tak dla wszystkich
source: Yes to all
ta: அனைவருக்கும் ஆம்

# Tak
source: Yes
ta: ஆம்

# Nie
source: No
ta: இல்லை

# Pomoc
source: Help
ta: உதவி

# Bez nazwy -
source: Untitled -
ta: பெயரிடப்படாதது -

# Skala obrazu wideo
source: Video scale
ta: வீடியோ அளவு

# Powiększenie wideo
source: Video zoom
ta: வீடியோ சூம்

# Czas trwania wideo
source: Video duration
ta: வீடியோ காலம்

# Klatki na Sekundę
source: Frames per second
ta: நொடிக்கு பிரேம்கள்

# Rozdzielczość wideo
source: Video resolution
ta: வீடியோ தீர்மானம்

# Proporcje wideo
source: Video aspect ratio
ta: வீடியோ விகித விகிதம்

# Rozdzielczość napisów
source: Subtitles resolution
ta: வசனத் தீர்மானம்

# Nazwa pliku wideo
source: Video file name
ta: வீடியோ கோப்பு பெயர்

# Wczytuje poprzednio zaczytane pliki
source: Open files loaded last time
ta: திறந்த கோப்புகளை கடந்த முறை ஏற்றியது

# Wczytaj sesję z pliku
source: Load session from file
ta: கோப்பிலிருந்து அமர்வை ஏற்றவும்

# Wczytuje sesję z wcześniej zapisanego pliku sesji
source: Loads session from saved session file
ta: சேமித்த அமர்வு கோப்பிலிருந்து அமர்வை ஏற்றுகிறது

# Zapisz sesję do pliku
source: Save session to file
ta: அமர்வை தாக்கல் செய்ய சேமிக்கவும்

# Zapisuje sesję do pliku
source: Saves session to file
ta: தாக்கல் செய்ய அமர்வை சேமிக்கிறது

# Pytaj o wczytanie ostatniej sesji przy starcie programu
source: Ask for load last session after program start
ta: நிரல் தொடங்கிய பிறகு கடைசி அமர்வைக் கேளுங்கள்

# Pyta, czy wczytać ostatnio zaczytane pliki przy starcie programu
source: Asks whether to load recently read files at program startup
ta: நிரல் தொடக்கத்தில் அண்மைக் காலத்தில் படித்த கோப்புகளை ஏற்றலாமா என்று கேட்கிறது

# Wczytaj ostatnią sesję przy starcie programu
source: Load last session after program start
ta: நிரல் தொடக்கத்திற்குப் பிறகு கடைசி அமர்வை ஏற்றவும்

# Wczytuje poprzednio zaczytane pliki przy starcie programu
source: Loading last session after program start
ta: நிரல் தொடக்கத்திற்குப் பிறகு கடைசி அமர்வை ஏற்றுகிறது

# &Otwórz napisy
source: &Open subtitles
ta: திறந்த வசன வரிகள்

# Otwórz plik napisów
source: Open subtitle file
ta: திறந்த வசன கோப்பு

# &Zapisz
source: &Save
ta: சேமி (&s)

# Zapisz aktualny plik
source: Save current file
ta: தற்போதைய கோப்பை சேமிக்கவும்

# Zapisz &wszystko
source: Save all
ta: அனைத்தையும் சேமி

# Zapisz &jako...
source: Save &as...
ta: என சேமி... (&a)

# Zapisz jako
source: Save as
ta: என சேமி

# Zapisz &tłumaczenie
source: Save translation
ta: மொழிபெயர்ப்பைச் சேமிக்கவும்

# Ostatnio otwa&rte napisy
source: Recently opened subtitles
ta: அண்மைக் காலத்தில் திறக்கப்பட்ட வசன வரிகள்

# Ostatnio otwarte napisy
source: Recently opened subtitles
ta: அண்மைக் காலத்தில் திறக்கப்பட்ட வசன வரிகள்

# Usuń napisy z e&dytora
source: Remove subtitles from the editor
ta: எடிட்டரிடமிருந்து வசன வரிகள் அகற்றவும்

# Otwiera autozapis wybrany z listy
source: Opens auto save from list
ta: பட்டியலிலிருந்து ஆட்டோசேவைத் திறக்கவும்

# Otwiera okno usuwania plików tymczasowych
source: Opens temporary files removing window
ta: சாளரத்தை அகற்றும் தற்காலிக கோப்புகளைத் திறக்கவும்

# Pokaż / Ukryj okno logów
source: Show / Hide log window
ta: பதிவு சாளரத்தைக் காட்டவும் / மறைக்கவும்

# Ostatnia sesja
source: Last session
ta: கடைசி அமர்வு

# Opcje ostatniej sesji
source: Last session options
ta: கடைசி அமர்வு விருப்பங்கள்

# &Ustawienia
source: &Settings
ta: &அமைப்புகள்

# Ustawienia programu
source: Program settings
ta: நிரல் அமைப்புகள்

# Wyjści&e Alt-F4
source: &Exit Alt-F4
ta: & Alt-f4 வெளியேறு

# Zakończ działanie programu
source: Exit the program
ta: நிரலில் இருந்து வெளியேறவும்

# &Plik
source: &File
ta: கோப்பு (&f)

# &Cofnij
source: &Undo
ta: செயல்தவிர் (&u)

# &Ponów
source: &Redo
ta: மீண்டும்செய் (&r)

# &Historia
source: &History
ta: & வரலாறு

# Znajdź i za&mień
source: Find and re&place
ta: கண்டுபிடித்து மாற்றவும்

# Szuka i podmienia dane frazy tekstu
source: Searches for expressions and replaces them
ta: வெளிப்பாடுகளைத் தேடி அவற்றை மாற்றுகிறது

# Z&najdź
source: &Find
ta: தேடு (&f)

# Szuka dane frazy tekstu
source: Searches for expressions
ta: வெளிப்பாடுகளைத் தேடுகிறது

# Znajduje kolejne wystąpięnie frazy w tekście
source: Finds next phrase placement in text
ta: உரையில் அடுத்த சொற்றொடர் வேலைவாய்ப்பைக் காண்கிறது

# Czas początkowy
source: The starting time
ta: தொடக்க நேரம்

# Sortuj według czasu początkowego
source: Sort by start time
ta: தொடக்க நேரத்தால் வரிசைப்படுத்துங்கள்

# Czas końcowy
source: End time
ta: இறுதி நேரம்

# Sortuj według czasu końcowego
source: Sort by end time
ta: இறுதி நேரத்தால் வரிசைப்படுத்துங்கள்

# Style
source: Styles
ta: பாணிகள்

# Sortuj według stylów
source: Sort by styles
ta: பாணிகளால் வரிசைப்படுத்துங்கள்

# Sortuj według aktora
source: Sort by actor
ta: நடிகரால் வரிசைப்படுத்துங்கள்

# Sortuj według efektu
source: Sort by effect
ta: விளைவால் வரிசைப்படுத்துங்கள்

# Warstwa
source: Layer
ta: அடுக்கு

# Sortuj według warstwy
source: Sort by layer
ta: அடுக்கு மூலம் வரிசைப்படுத்துங்கள்

# Sort&uj wszystkie linie
source: So&rt all lines
ta: எனவே & rt அனைத்து வரிகளும்

# Sortuje wszystkie linie napisów ASS
source: Sorts all lines in ASS file
ta: கழுதை கோப்பில் அனைத்து வரிகளையும் வரிசைப்படுத்துகிறது

# Sortu&j zaznaczone linie
source: So&rt selected lines
ta: எனவே & ஆர்டி தேர்ந்தெடுக்கப்பட்ட கோடுகள்

# Sortuje zaznaczone linie napisów ASS
source: Sorts selected lines in ASS file
ta: கழுதை கோப்பில் தேர்ந்தெடுக்கப்பட்ட வரிகளை வரிசைப்படுத்துகிறது

# Włącza okno poprawiania błędów
source: Turns on multireplacer
ta: மல்டி மாற்றியை இயக்கவும்

# Zaznacz &linijki
source: Select &lines
ta: தேர்ந்தெடு & கோடுகள்

# Zaznacza linijki wg danej frazy tekstu
source: Selects lines by expressions
ta: வெளிப்பாடுகளால் வரிகளைத் தேர்ந்தெடுக்கிறது

# &Edycja
source: &Edit
ta: திருத்து (&e)

# Otwiera wybrane wideo
source: Opens video file
ta: வீடியோ கோப்பைத் திறக்கவும்

# Ostatnio otwarte wideo
source: Recently opened videos
ta: அண்மைக் காலத்தில் திறக்கப்பட்ட வீடியோக்கள்

# Ostatnio otwarte video
source: Recently opened videos
ta: அண்மைக் காலத்தில் திறக்கப்பட்ட வீடியோக்கள்

# Ostatnio otwarte klatki kluczowe
source: Recently opened keyframes
ta: அண்மைக் காலத்தில் திறக்கப்பட்ட கீஃப்ரேம்கள்

# Otwórz dummy wideo
source: Open dummy video
ta: திறந்திருக்கும் போலி வீடியோ

# Wstawia czas początkowy z wideo
source: Insert start time from video
ta: வீடியோவிலிருந்து தொடக்க நேரத்தை செருகவும்

# Wstawia czas końcowy z wideo
source: Insert end time from video
ta: வீடியோவிலிருந்து இறுதி நேரத்தை செருகவும்

# Przechodzi o jedną klatkę w tył
source: Go to previous frame
ta: முந்தைய சட்டகத்திற்குச் செல்லுங்கள்

# Przechodzi o jedną klatkę w przód
source: Go to next frame
ta: அடுத்த சட்டகத்திற்குச் செல்லுங்கள்

# Przechodzi wideo do czasu początkowego linii
source: Moves video to start time
ta: வீடியோவைத் தொடங்க வீடியோவை நகர்த்துகிறது

# Przechodzi wideo do czasu końcowego linii
source: Moves video to end time
ta: வீடியோவை இறுதி நேரத்திற்கு நகர்த்துகிறது

# Odtwarzaj / Pauza
source: Play / Pause
ta: விளையாடு / இடைநிறுத்தம்

# Odtwarza lub pauzuje wideo
source: Plays / Pauses video
ta: வீடியோவை இயக்கவும் / இடைநிறுத்தவும்

# Otwiera wideo przez FFMS2, co daje dokładność klatkową
source: Opens video with FFMS2 for frame precision
ta: பிரேம் துல்லியத்திற்காக FFMS2 உடன் வீடியோவைத் திறக்கிறது

# &Wideo
source: &Video
ta: & வீடியோ

# Otwiera wybrane audio
source: Opens audio file
ta: ஆடியோ கோப்பைத் திறக்கிறது

# Ostatnio otwarte audio
source: Recently opened audio
ta: அண்மைக் காலத்தில் ஆடியோ திறக்கப்பட்டது

# Otwiera audio z wideo
source: Opens audio from video
ta: வீடியோவிலிருந்து ஆடியோவைத் திறக்கிறது

# Otwórz puste audio na 2:30 godziny
source: Open blank 2h30m audio
ta: வெற்று 2h30M ஆடியோவைத் திறக்கவும்

# Otwiera puste audio na 2:30 godziny
source: Opens blank audio 2 hour and 30 minutes long
ta: வெற்று ஆடியோவை 2 மணி நேரம் 30 நிமிடங்கள் நீளமாக திறக்கிறது

# Zamyka audio
source: Closes audio
ta: ஆடியோவை மூடுகிறது

source: A&udio
ta: A & அழுகை

# Wszystko
source: All
ta: அனைத்தும்

# Wszystkie okna są widoczne
source: Shows all windows
ta: அனைத்து சாளரங்களையும் காட்டுகிறது

# Wideo i napisy
source: Video and subs
ta: வீடியோ மற்றும் சப்ச்

# Widoczne tylko okno wideo i napisów
source: Shows only video window and subs window
ta: வீடியோ சாளரம் மற்றும் சப்ச் சாளரத்தை மட்டுமே காட்டுகிறது

# Audio i napisy
source: Audio and subs
ta: ஆடியோ மற்றும் சப்ச்

# Widoczne tylko okno audio i napisów
source: Shows only audio window and subs window
ta: ஆடியோ சாளரம் மற்றும் சப்ச் சாளரத்தை மட்டுமே காட்டுகிறது

# Tylko wideo
source: Only video
ta: வீடியோ மட்டுமே

# Widoczne tylko okno wideo
source: Shows only video window
ta: வீடியோ சாளரத்தை மட்டுமே காட்டுகிறது

# Tylko napisy
source: Only subtitles
ta: வசன வரிகள் மட்டுமே

# Widoczne tylko okno napisów
source: Shows only subtitles window
ta: வசன வரிகள் சாளரத்தை மட்டுமே காட்டுகிறது

# Wido&k
source: View
ta: பார்வை

# Włączanie bądź wyłączanie edytora
source: Enables / disables editor
ta: எடிட்டரை இயக்குகிறது / முடக்குகிறது

# Właściwości napisów ASS
source: ASS subtitles properties
ta: ASS வசன வரிகள் பண்புகள்

# &Menedżer stylów
source: Style &manager
ta: நடை & மேலாளர்

# Służy do zarządzania stylami ASS
source: Is used to manage ASS styles
ta: கழுதை பாணிகளை நிர்வகிக்க பயன்படுகிறது

# Konwertuje do formatu ASS
source: Converts to ASS format
ta: கழுதை வடிவத்திற்கு மாற்றுகிறது

# Konwertuje do formatu SRT
source: Converts to SRT format
ta: SRT வடிவத்திற்கு மாற்றுகிறது

# Konwertuje do formatu microDVD
source: Converts to microDVD format
ta: மைக்ரோடிவிடி வடிவத்திற்கு மாற்றுகிறது

# Konwertuje do formatu MPL2
source: Converts to MPL2 format
ta: MOL2 வடிவத்திற்கு மாற்றவும்

# Konwertuje do formatu TMPlayer (niezalecane)
source: Converts to TMPlayer format (not recommended)
ta: TMPlayer வடிவத்திற்கு மாற்றுகிறது (பரிந்துரைக்கப்படவில்லை)

# Konwersja
source: Conversion
ta: மாற்றம்

# Konwersja z jednego formatu napisów na inny
source: Converts from one format to another
ta: ஒரு வடிவத்திலிருந்து இன்னொரு வடிவத்திற்கு மாற்றுகிறது

# Okno zmiany &czasów Ctrl-I
source: Shift &times... Ctrl-I
ta: சிப்ட் & டைம்ச் ... ctrl-i

# Przesuwanie czasów napisów
source: Shifts subtitles times
ta: வசன வரிகளை மாற்றுகிறது

# Ukrywa tagi w nawiasach ASS i MDVD
source: Hides tags in ASS and MDVD
ta: குறிச்சொற்களை கழுதை மற்றும் டிவிடியில் மறைக்கவும்

# &Napisy
source: Su&btitles
ta: வசன வரிகள்

# Au&tomatyzacja
source: Au&tomation
ta: தானியங்கு

# &Pomoc (niekompletna, ale jednak)
source: &Help (English version is not yet available)
ta: & உதவி (ஆங்கில பதிப்பு இன்னும் கிடைக்கவில்லை)

# Otwiera pomoc w domyślnej przeglądarce
source: Opens help in default browser
ta: இயல்புநிலை உலாவியில் உதவியைத் திறக்கிறது

# &Wątek programu na forum AnimeSub.info
source: &Forum thread on animesub.info (Polish)
ta: & Animesub.info (போலந்து) இல் மன்ற நூல்

# Otwiera wątek programu na forum AnimeSub.info
source: Opens forum thread on animesub.info (Polish)
ta: Animesub.info (போலந்து) இல் மன்ற நூலைத் திறக்கிறது

# &O programie
source: &About
ta: &பற்றி

# Wyświetla informacje o programie
source: Shows program info
ta: நிரல் தகவலைக் காட்டுகிறது

# &Lista osób pomocnych przy tworzeniu programu
source: &Credits
ta: & வரவு

# Wyświetla listę osób pomocnych przy tworzeniu programu
source: Shows credits
ta: வரவுகளைக் காட்டுகிறது

# Pomo&c
source: &Help
ta: உதவி (&h)

# Bez tytułu
source: Untitled
ta: தலைப்பிடப்படாத

# Wybierz sktypt
source: Choose script
ta: ச்கிரிப்டைத் தேர்வுசெய்க

# Pliki skryptów (*.lua),(*.moon)|*.lua;*.moon;
source: Script files (*.lua),(*.moon)|*.lua;*.moon;
ta: ச்கிரிப்ட் கோப்புகள் (*.லுவா), (*. மூன்) |*.லுவா;*. சந்திரன்;

# Ten plik napisów nie ma dodanych żadnych skryptów
source: This subtitles don't have any scripts added
ta: இந்த வசன வரிகள் எந்த ச்கிரிப்டுகளும் சேர்க்கப்படவில்லை

# Warunki skryptu Lua '%s' nie zostały spełnione
source: Validation Lua script '%s' failed
ta: சரிபார்ப்பு லுவா ச்கிரிப்ட் '%s' தோல்வியடைந்தது

# Wybierz plik napisów
source: Choose subtitles file
ta: வசன வரிகளைத் தேர்வுசெய்க

source: Subtitle files (*.ass),(*.ssa),(*.srt),(*.sub),(*.txt)|*.ass;*.ssa;*.srt;*.sub;*.txt|Video with subtitles (*.mkv),(*.ogm)|*.mkv;*.ogm
ta: வசன வரிகள் (*.ஆச்), (*. எச்.எச்.ஏ), (*. எச்.ஆர்.டி), (*. துணை), (*. TXT | வசனங்களுடன் வீடியோ (*.MKV), (*. OGM) |*.MKV;*. OGM

source: Video files (*.avi),(*.mkv),(*.mp4),(*.ogm),(*.wmv),(*.asf),(*.rmvb),(*.rm),(*.3gp),(*.mpg),(*.mpeg),(*.avs)|*.avi;*.mkv;*.mp4;*.ogm;*.wmv;*.asf;*.rmvb;*.rm;*.mpg;*.mpeg;*.3gp;*.avs|All files (*.*)|*.*
ta: வீடியோ கோப்புகள் (*.avi), (*. Mkv), (*. Mp4), (*. OGM), (*. WMV), (*. ASF), (*. RMVB), (*. RM), . rmvb;*. rm;*. mpg;*. Mpeg;*. 3GP;*.

source: Keyframes file (*.txt),(*.pass),(*.stats),(*.log)|*.txt;*.pass;*.stats;*.log|All files (*.*)|*.*
ta: கீஃப்ரேம்கள் கோப்பு (*.txt), (*. பாச்), (*. புள்ளிவிவரங்கள்), (*. பதிவு) |*.txt;* *.*

source: Subtitles editor by Marcin Drob aka Bakura or Bjakja (bjakja7@gmail.com), version %s from day %s
ta: மார்கின் ட்ரோப் அக்கா பகுரா அல்லது பிசாக்சா (bjakja7@gmail.com), வசன ஆசிரியர் ஆசிரியர், நாள் %s முதல் பதிப்பு %s

# Ten program powstał w celu zastąpienia dwóch programów: Bestplayera i Aegisuba.
source: I wrote this program to replace two programs: Bestplayer and Aegisub.
ta: பெச்ட் பிளேயர் மற்றும் ஏசிசுப் ஆகிய இரண்டு நிரல்களை மாற்ற இந்த திட்டத்தை எழுதினேன்.

source: If you have noticed any bugs or have any suggestions for changes or new features, you can write about it in: Discord https://discord.gg/9WacFTtK6q, Github, or by email.
ta: நீங்கள் ஏதேனும் பிழைகள் கவனித்திருந்தால் அல்லது மாற்றங்கள் அல்லது புதிய அம்சங்களுக்கான பரிந்துரைகள் ஏதேனும் இருந்தால், நீங்கள் இதைப் பற்றி எழுதலாம்: டிச்கார்ட் https://discord.gg/9wacfttk6q, github அல்லது மின்னஞ்சல் மூலம்.

# Kainote zawiera w sobie części następujących projektów:
source: Kainote includes parts of the following projects:
ta: கைனோட் பின்வரும் திட்டங்களின் சில பகுதிகளை உள்ளடக்கியது:

source: Color picker, mkv subtitling, audiobox, audio player, automation and several other functions taken from Aegisub -
ta: கலர் பிக்கர், எம்.கே.வி வசன வருதல், ஆடியோபாக்ச், ஆடியோ பிளேயர், ஆட்டோமேசன் மற்றும் ஏசிசுபிலிருந்து எடுக்கப்பட்ட பல செயல்பாடுகள் -

# O Kainote
source: About Kainote
ta: Avut

# Pomoc graficzna: (przyciski, obrazki do pomocy itd.)
source: Graphical help: (buttons, help pictures etc.)
ta: வரைகலை உதவி: (பொத்தான்கள், உதவி படங்கள் போன்றவை)

# - Xandros (przyciski do wideo).
source: - Xandros (new video buttons).
ta: - சாண்ட்ரோச் (புதிய வீடியோ பொத்தான்கள்).

# - Devilkan (ikony do menu i paska narzędzi, obrazki do pomocy).
source: - Devilkan (menu and toolbar buttons)
ta: - பிசாசன் (மெனு மற்றும் கருவிப்பட்டி பொத்தான்கள்)

# - Zły Los (ikony do skojarzonych plików i do menu).
source: - Zły Los (icons for file associations and menu).
ta: - ZłY LOS (கோப்பு சங்கங்கள் மற்றும் மெனுக்கான சின்னங்கள்).

# Testerzy: (mniej i bardziej wprawieni użytkownicy programu)
source: Testers:
ta: சோதனையாளர்கள்:

source: - Sacredus (first translator using translator mode, great help testing Kainote on a slow computer)
ta: - சேக்ரெடச் (மொழிபெயர்ப்பாளர் பயன்முறையைப் பயன்படுத்தி முதல் மொழிபெயர்ப்பாளர், மெதுவான கணினியில் கைனோட்டை சோதிக்கும் சிறந்த உதவி)

source: - Devilkan (crashhunter, because of his system and habits he made Kainote crash a lot
ta: - பிசாசன் (க்ராச்அண்டர், அவரது அமைப்பு மற்றும் பழக்கவழக்கங்கள் காரணமாக அவர் கைனோட்டை நிறைய செயலிழக்கச் செய்தார்

source: helped with typesetting tools and came up with many more improvements).
ta: தட்டச்சு செய்யும் கருவிகளுக்கு உதவியது மற்றும் இன்னும் பல மேம்பாடுகளைக் கொண்டு வந்தது).

source: - MatiasMovie (found some crashes and suggessted some improvements, helps with crash debugging).
ta: - மத்தியாச்மோவி (சில விபத்துக்களைக் கண்டறிந்தது மற்றும் சில மேம்பாடுகளை பரிந்துரைத்தது, செயலிழப்பு பிழைத்திருத்தத்திற்கு உதவுகிறது).

# - mas1904 (wyłapał trochę błędów, pomaga w debugowaniu crashy).
source: - mas1904 (found some errors and helping with crash debuging).
ta: - MAS 1904 (சில பிழைகள் மற்றும் செயலிழப்பு பிழைத்திருத்தத்திற்கு உதவுதல்).

# - Senami (stworzył nowe motywy, a także wyłapał parę błędów).
source: - Senami (made new themes and found some bugs).
ta: - சேனாமி (புதிய கருப்பொருள்களை உருவாக்கி சில பிழைகள் கிடைத்தன).

# - altinat (tajskie tłumaczenie).
source: - altinat (Thai translation).
ta: - ஆல்டினாட் (தாய் மொழிபெயர்ப்பு).

# - labrie75 (koreańskie tłumaczenie).
source: - labrie75 (Korean translation).
ta: - லாப்ரி 75 (கொரிய மொழிபெயர்ப்பு).

# - Niskala5570 (malajskie tłumaczenie).
source: - Niskala5570 (Malay translation).
ta: - நிச்கலா 5570 (மலாய் மொழிபெயர்ப்பு).

# Podziękowania także dla osób, które używają programu i zgłaszali błędy.
source: Thanks to other Kainote users who reported bugs:
ta: பிழைகள் புகாரளித்த பிற கைனோட் பயனர்களுக்கு நன்றி:

# Plik napisów
source: Subtitles file
ta: வசன வரிகள் கோப்பு

# Zapisz plik napisów
source: Save subtitles file
ta: வசன வரிகளைச் சேமிக்கவும்

source: Chosen file is read only, please save with different name or change file attribute.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பு மட்டுமே படிக்கப்படுகிறது, தயவுசெய்து வெவ்வேறு பெயருடன் சேமிக்கவும் அல்லது கோப்பு பண்புக்கூறு மாற்றவும்.

# Wczytać napisy o nazwie "%s"?
source: Do you want to load subtitles named %s?
ta: %s என்ற வசன வரிகள் ஏற்ற விரும்புகிறீர்களா?

# Nie można otworzyć napisów
source: Cannot open subtitle file
ta: வசன கோப்பைத் திறக்க முடியாது

# Brak
source: None
ta: எதுவுமில்லை

# Zapisać napisy o nazwie "%s" przed %s?
source: Do you want to save subtitles named "%s" before %s?
ta: %s க்கு முன் " %s" என்ற வசன வரிகள் சேமிக்க விரும்புகிறீர்களா?

# zamknięciem programu
source: exiting program
ta: வெளியேறும் திட்டம்

# zamknięciem zakładki
source: closing tab
ta: நிறைவு தாவல்

# wczytaniem nowych napisów
source: loading new subtitles
ta: புதிய வசன வரிகள் ஏற்றுகின்றன

# usunięciem napisów
source: removing subtitles
ta: வசன வரிகள் நீக்குதல்

# Nie można wczytać skrótów klawiszowych audio
source: Cannot load audio hotkeys
ta: ஆடியோ ஆட்கீவை ஏற்ற முடியாது

# Nie można wczytać opcji audio
source: Cannot load audio configuration
ta: ஆடியோ உள்ளமைவை ஏற்ற முடியாது

# Wybierz plik audio
source: Choose audio file
ta: ஆடியோ கோப்பைத் தேர்வுசெய்க

# Pliki audio i wideo
source: Audio and video files
ta: ஆடியோ மற்றும் வீடியோ கோப்புகள்

# Wszystkie pliki
source: All files
ta: அனைத்து கோப்புகள்
