Repository: 247i/TACETr
Catalog: உரை/தானி/kainote-kainote-*.po
Languages: ta

# Audio znaczniki sekund
source: Audio seconds boundaries
ta: ஆடியோ விநாடிகள் எல்லைகள்

# Audio klatki kluczowe
source: Audio keyframes
ta: ஆடியோ கீஃப்ரேம்கள்

# Audio znaczniki sylab
source: Audio syllable marker
ta: ஆடியோ எழுத்து மார்க்கர்

# Audio tekst sylab
source: Audio syllable text
ta: ஆடியோ எழுத்து உரை

# Audio zaznaczenie
source: Audio selection
ta: ஆடியோ தேர்வு

# Audio zaznaczenie po modyfikacji
source: Audio the selection after modification
ta: மாற்றத்திற்குப் பிறகு தேர்வு ஆடியோ

# Audio tło nieaktywnych linijek
source: Audio inactive line background
ta: ஆடியோ செயலற்ற வரி பின்னணி

# Audio wykres falowy
source: Audio waveform
ta: ஆடியோ அலைவடிவம்

# Audio nieaktywny wykres falowy
source: Audio Inactive waveform
ta: ஆடியோ செயலற்ற அலைவடிவம்

# Audio zmodyfikowany wykres falowy
source: Audio modified waveform
ta: ஆடியோ மாற்றியமைக்கப்பட்ட அலைவடிவம்

# Audio zaznaczony wykres falowy
source: Audio selected waveform
ta: ஆடியோ தேர்ந்தெடுக்கப்பட்ட அலைவடிவம்

# Audio tło spektrum
source: Audio spectrum background
ta: ஆடியோ ச்பெக்ட்ரம் பின்னணி

# Audio echo spektrum
source: Audio spectrum echo
ta: ஆடியோ ச்பெக்ட்ரம் எதிரொலி

# Audio spektrum
source: Audio spectrum
ta: ஆடியோ ச்பெக்ட்ரம்

# Pole tekstowe tło
source: Text field background
ta: உரை புலம் பின்னணி

# Pole tekstowe obramowanie
source: Text field border
ta: உரை புல எல்லை

# Pole tekstowe obramowanie aktywnego okna
source: Text field border on focus
ta: கவனம் செலுத்துவதில் உரை புல எல்லை

# Pole tekstowe zaznaczenie
source: Text field selection
ta: உரை புலம் தேர்வு

# Pole tekstowe zaznaczenie w nieaktywnym oknie
source: Text field inactive window selection
ta: உரை புலம் செயலற்ற சாளர தேர்வு

# Przycisk i lista tło
source: Button and list background
ta: பொத்தான் மற்றும் பட்டியல் பின்னணி

# Przycisk i lista tło po najechaniu
source: Button and list background upon hover
ta: பொத்தான் மற்றும் ஓவர் மீது பின்னணி பட்டியல்

# Przycisk i lista tło po wciśnięciu
source: Button and list pushed background
ta: பொத்தான் மற்றும் பட்டியல் தள்ளப்பட்ட பின்னணி

# Przycisk i lista tło aktywnego
source: Button and list background on focus
ta: பொத்தான் மற்றும் பின்னணியை மையமாகக் கொண்டது

# Przycisk i lista obramowanie
source: Button and list border
ta: பொத்தான் மற்றும் பட்டியல் எல்லை

# Przycisk i lista obramowanie po najechaniu
source: Button and list border upon hover
ta: பொத்தானை மற்றும் வட்டத்தை பட்டியலிடுங்கள்

# Przycisk i lista obramowanie po wciśnięciu
source: Button and list border of pushed
ta: பொத்தான் மற்றும் தள்ளப்பட்ட பட்டியல் எல்லை

# Przycisk i lista obramowanie aktywnego
source: Button and list border on focus
ta: பொத்தான் மற்றும் கவனம் செலுத்துவதில் எல்லை

# Przycisk i lista obramowanie nieaktywne
source: Button and list inactive border
ta: பொத்தான் மற்றும் செயலற்ற எல்லையை பட்டியலிடுங்கள்

# Przełącznik tło włączonego
source: Togglebutton toggled background
ta: டோக்ல்பட்டன் டாக் செய்யப்பட்ட பின்னணி

# Przełącznik obramowanie włączonego
source: Togglebutton toggled border
ta: டோக்ல்பட்டன் எல்லை மாற்றினார்

# Pasek przewijania tło
source: Scroll bar background
ta: உருள் பார் பின்னணி

# Pasek przewijania suwak
source: Scroll bar slider
ta: உருள் பார் ச்லைடர்

# Pasek przewijania suwak po najechaniu
source: Scroll bar slider upon hover
ta: ஓவர் மீது உருள் ச்லைடர்

# Pasek przewijania suwak po wciśnięciu
source: Scroll bar pushed slider
ta: ச்லைடரை உருட்டல் பட்டி தள்ளியது

# Ramka z opisem obramowanie
source: Staticbox border
ta: ச்டாடிக்பாக்ச் எல்லை

# Lista statyczna obramowanie
source: Static list border
ta: நிலையான பட்டியல் எல்லை

# Lista statyczna tło
source: Static list background
ta: நிலையான பட்டியல் பின்னணி

# Lista statyczna zaznaczenie
source: Static list selection
ta: நிலையான பட்டியல் தேர்வு

# Lista statyczna tło nagłówka
source: Static list header background
ta: நிலையான பட்டியல் தலைப்பு பின்னணி

# Lista statyczna tekst nagłówka
source: Static list header text
ta: நிலையான பட்டியல் தலைப்பு உரை

# Pasek statusu obramowanie
source: Status bar border
ta: நிலை பட்டி எல்லை

# Pasek menu tło 1
source: Menu bar background 1
ta: பட்டியல் பார் பின்னணி 1

# Pasek menu tło 2
source: Menu bar background 2
ta: பட்டியல் பார் பின்னணி 2

# Pasek menu obramowanie zaznaczenia
source: Menu bar selection border
ta: பட்டியல் பார் தேர்வு எல்லை

# Pasek menu najechane tło zaznaczenia
source: Menu bar selection hover bacground
ta: பட்டியல் பார் தேர்வு மிதவை பின்னணி

# Pasek menu kliknięte tło zaznaczenia
source: Menu bar selection clicked bacground
ta: பட்டியல் பார் தேர்வு பின்னணி சொடுக்கு செய்தது

# Menu tło
source: Menu background
ta: பட்டி பின்னணி

# Menu obramowanie zaznaczenia
source: Menu selection border
ta: பட்டியல் தேர்வு எல்லை

# Menu tło zaznaczenia
source: Menu selection background
ta: பட்டியல் தேர்வு பின்னணி

# Pasek zakładek tło 1
source: Tab bar background 1
ta: தாவல் பார் பின்னணி 1

# Pasek zakładek tło 2
source: Tab bar background 2
ta: தாவல் பார் பின்னணி 2

# Zakładki obramowanie aktywnej
source: Tab active border
ta: தாவல் செயலில் உள்ள எல்லை

# Zakładki obramowanie nieaktywnej
source: Tab inactive border
ta: தாவல் செயலற்ற எல்லை

# Zakładki tło aktywnej
source: Tab active background
ta: தாவல் செயலில் உள்ள பின்னணி

# Zakładki tło nieaktywnej
source: Tab inactive background
ta: தாவல் செயலற்ற பின்னணி

# Zakładki tło nieaktywnej po najechaniu
source: Tab inactive background upon hover
ta: ஓவர் குறித்த தாவல் செயலற்ற பின்னணி

# Zakładki tło drugiej widocznej zakładki
source: Tab background of second visible tab
ta: இரண்டாவது புலப்படும் தாவலின் தாவல் பின்னணி

# Zakładki tekst aktywnej
source: Tab active text
ta: தாவல் செயலில் உள்ள உரை

# Zakładki tekst nieaktywnej
source: Tab inactive background
ta: தாவல் செயலற்ற பின்னணி

# Zakładki zamknięcie po najechaniu
source: Tab close upon hover
ta: தாவல் மூடு

# Pasek zakładek strzałka
source: Tab bar arrow
ta: தாவல் பார் அம்பு

# Pasek zakładek strzałka tło
source: Tab bar arrow background
ta: தாவல் பார் அம்பு பின்னணி

# Pasek zakładek strzałka tło po najechaniu
source: Tab bar arrow background upon hover
ta: ஓவர் மீது தாவல் பார் அம்பு பின்னணி

# Suwak ścieżka tło
source: Slider path background
ta: ச்லைடர் பாதை பின்னணி

# Suwak ścieżka obramowanie
source: Slider path border
ta: ச்லைடர் பாதை எல்லை

# Suwak obramowanie
source: Slider border
ta: ச்லைடர் எல்லை

# Suwak obramowanie po najechaniu
source: Slider border upon hover
ta: ஓவர் மீது ச்லைடர் எல்லை

# Suwak obramowanie po wciśnięciu
source: Slider border of pushed
ta: தள்ளப்பட்ட ச்லைடர் எல்லை

# Suwak tło
source: Slider background
ta: ச்லைடர் பின்னணி

# Suwak tło po najechaniu
source: Slider background upon hover
ta: ஓவர் மீது ச்லைடர் பின்னணி

# Suwak tło po wciśnięciu
source: Slider background of pushed
ta: தள்ளப்பட்ட ச்லைடர் பின்னணி

# Linia zmiany rozdzielczości kropki
source: Resize line dots
ta: வரி புள்ளிகளை மறுஅளவிடுங்கள்

# Wynik szukania czcionka nazwy pliku
source: Finding result file name foreground
ta: முடிவு கோப்பு பெயர் முன்புறத்தைக் கண்டறிதல்

# Wynik szukania tło nazwy pliku
source: Finding result file name background
ta: முடிவு கோப்பு பெயர் பின்னணியைக் கண்டறிதல்

# Wynik szukania czcionka znalezionej frazy
source: Finding result found phrase foreground
ta: முடிவைக் கண்டறிந்தது சொற்றொடர் முன்புறம்

# Wynik szukania tło znalezionej frazy
source: Finding result found phrase background
ta: முடிவைக் கண்டறிந்த சொற்றொடர் பின்னணியைக் கண்டறிதல்

# Pierwszy kolor podglądu stylów
source: First color of style preview background
ta: பாணி முன்னோட்ட பின்னணியின் முதல் வண்ணம்

# Drugi kolor podglądu stylów
source: Second color of style preview background
ta: பாணி முன்னோட்ட பின்னணியின் இரண்டாவது வண்ணம்

# Nazwa motywu:
source: Theme name:
ta: கருப்பொருள் பெயர்:

source: Name of coping theme. Default themes: DarkSentro & LightSentro cannot be edited. It have to be copied.
ta: சமாளிக்கும் கருப்பொருளின் பெயர். இயல்புநிலை கருப்பொருள்கள்: டார்க்சென்ட்ரோ & லைட்சென்ட்ரோ திருத்த முடியாது. அதை நகலெடுக்க வேண்டும்.

# Kopiuj
source: Copy
ta: நகலெடு

source: Warning! Transparency works only on audio spectrun, text file and subtitles grid.
ta: எச்சரிக்கை! ஆடியோ ச்பெக்ட்ரனில் மட்டுமே வெளிப்படைத்தன்மை செயல்படுகிறது, உரை கோப்பு மற்றும் வசன வரிகள் கட்டம்.

# Nazwa
source: Name
ta: பெயர்

# Kolor
source: Color
ta: நிறம்

# Napisy ASS
source: Subtitles ASS
ta: வசன வரிகள் கழுதை

# Napisy SSA
source: Subtitles SSA
ta: வசன வரிகள் எச்.எச்.ஏ.

# Napisy SRT
source: Subtitles SRT
ta: வசன வரிகள் எச்.ஆர்.டி.

# Napisy SUB
source: Subtitles SUB
ta: வசன வரிகள் துணை

# Napisy TXT
source: Subtitles TXT
ta: வசன வரிகள் txt

# Wideo MKV
source: Video MKV
ta: வீடியோ எம்.கே.வி.

# Wideo MP4
source: Video MP4
ta: வீடியோ எம்பி 4

# Wideo AVI
source: Video AVI
ta: வீடியோ அவி

# Wideo OGM
source: Video OGM
ta: வீடியோ OGM

# Wideo WMV
source: Video WMV
ta: வீடியோ WMV

# Wideo ASF
source: Video ASF
ta: வீடியோ ஏ.எச்.எஃப்

# Wideo RMVB
source: Video RMVB
ta: வீடியோ RMVB

# Wideo RM
source: Video RM
ta: வீடியோ ஆர்.எம்

# Wideo 3GP
source: Video 3GP
ta: வீடியோ 3 சிபி

# Wideo MPG
source: Video MPG
ta: வீடியோ எம்பிசி

# Wideo MPEG
source: Video MPEG
ta: வீடியோ MPEG

# Wideo TS
source: Video TS
ta: வீடியோ டி.எச்

# Wideo M2TS
source: Video M2TS
ta: வீடியோ M2TS

source: WARNING! It works different on every Windows.
ta: எச்சரிக்கை! இது ஒவ்வொரு சாளரங்களிலும் வித்தியாசமாக வேலை செய்கிறது.

# Zaznacz wszystko
source: Select all
ta: அனைத்தையும் தெரிவுசெய்

# Zaznacz napisy
source: Select subtitles
ta: வசன வரிகள் தேர்ந்தெடுக்கவும்

# Zaznacz wideo
source: Select video
ta: வீடியோவைத் தேர்ந்தெடுக்கவும்

# Odznacz wszystko
source: Deselect all
ta: அனைத்தையும் தேர்வு செய்யுங்கள்

# Zaawansowane
source: Advanced
ta: மேம்பட்ட

# Motywy
source: Themes
ta: கருப்பொருள்கள்

# Skróty klawiszowe
source: Hotkeys
ta: ஆட்கீச்

# Skojarzenia
source: Associations
ta: சங்கங்கள்

# Właściwości napisów
source: ASS subtitles properties
ta: ASS வசன வரிகள் பண்புகள்

# Ustaw domyślne
source: Set default
ta: இயல்புநிலையை அமைக்கவும்

# Informacje o napisach
source: Subtitles info
ta: வசன வரிகள் செய்தி

# Tytuł
source: Title
ta: தலைப்பு

# Autor
source: Author
ta: நூலாசிரியர்

# Tłumaczenie
source: Translator
ta: மொழிபெயர்

# Korekta
source: Editor
ta: திருத்தி

# Timing
source: Timer
ta: நேரங்குறிகருவி

# Edycja
source: Updated by
ta: புதுப்பித்தார்

# Zawsze pytaj o zmianę informacji o napisach
source: Always ask for change subtitles info
ta: மாற்ற வசன வரிகளை எப்போதும் கேளுங்கள்

# Upłynęło 00:00:00.00 sekund
source: Time elapsed: 00:00:00.00
ta: நேரம் கடந்துவிட்டது: 00: 00: 00.00

# Upłynęło %s sekund
source: Time elapsed: %s
ta: நேரம் கடந்துவிட்டது: %s

# Indeksowanie pliku wideo
source: Indexing video
ta: குறியீட்டு வீடியோ

# Bez nazwy
source: Untitled
ta: தலைப்பிடப்படாத

# Wybierz ścieżkę
source: Choose the track
ta: பாதையைத் தேர்வுசெய்க

# Nie można zapisać indeksu, wystąpił błąd %s
source: Cannot save index, error %s occurred
ta: குறியீட்டைச் சேமிக்க முடியாது, பிழை %s நிகழ்ந்தன

# Nie można utworzyć VideoSource.
source: Cannot create VideoSource.
ta: வீடியோகோர்சை உருவாக்க முடியாது.

# Nie można przekonwertować wideo na RGBA
source: Cannot convert video to RGBA
ta: வீடியோவை RGBA ஆக மாற்ற முடியாது

# Nie można zmienić macierzy YCbCr
source: Cannot change YCbCr matrix
ta: YCBCR மேட்ரிக்சை மாற்ற முடியாது

# Nie można pobrać ścieżki wideo
source: You cannot load the video track
ta: நீங்கள் வீடியோ பாதையை ஏற்ற முடியாது

# Nie można pobrać informacji o wideo
source: You cannot get information about the video
ta: வீடியோவைப் பற்றிய தகவல்களை நீங்கள் பெற முடியாது

# Wystąpił błąd tworzenia źródła audio: %s
source: An error occurred when creating audio source: %s
ta: ஆடியோ மூலத்தை உருவாக்கும்போது பிழை ஏற்பட்டது: %s

# Wystąpił błąd konwertowania audio: %s
source: An error occurred when converting audio: %s
ta: ஆடியோவை மாற்றும்போது பிழை ஏற்பட்டது: %s

# Nie można ustawić opóźnienia, przekracza czas trwania audio
source: Delay failed, it's longer than audio duration time
ta: நேரந்தவறுகை தோல்வியுற்றது, இது ஆடியோ கால நேரத்தை விட நீண்டது

# Za mało pamięci RAM
source: Not enough RAM
ta: போதுமான ரேம் இல்லை

# Nie można stworzyć DXVA processor service
source: Cannot create DXVA processor service
ta: DXVA செயலி சேவையை உருவாக்க முடியாது

# Nie można pobrać GUIDów DXVA
source: Cannot get DXVA GUIDs
ta: DXVA GUID களைப் பெற முடியாது

# Nie można uzyskać formatów DXVA
source: Cannot enumerate DXVA formats
ta: DXVA வடிவங்களை கணக்கிட முடியாது

# Ten format nie jest obsługiwany przez DXVA
source: This format is not supported by DXVA
ta: இந்த வடிவத்தை DXVA ஆதரிக்கவில்லை

# GetVideoProcessorCaps zawiodło
source: GetVideoProcessorCaps failed
ta: GetVideoprocesserCaps தோல்வியுற்றது

# Nie można stworzyć powierzchni DXVA %i
source: Cannot create DXVA surface %i
ta: Dxva மேற்பரப்பை உருவாக்க முடியாது %i

# Nie można stworzyć processora DXVA
source: Cannot create DXVA processor
ta: DXVA செயலியை உருவாக்க முடியாது

# Zawiodło któreś z ustawień DirectX vertices
source: One of the DirectX vertices settings failed
ta: டைரக்ட்எக்ச் செங்குத்துகள் அமைப்புகளில் ஒன்று தோல்வியடைந்தது

# Nie można storzyć tekstury napisów
source: Cannot create subtitles texture
ta: வசன வரிகள் அமைப்பை உருவாக்க முடியாது

# Brak bufora klatki
source: No frame buffer
ta: பிரேம் பஃபர் இல்லை

# Nie można odblokować bufora tekstury napisów
source: Cannot unlock subtitles texture buffer
ta: வசன வரிகள் அமைப்பு இடையகத்தைத் திறக்க முடியாது

# Nie można odblokować bufora tekstury
source: Cannot unlock texture buffer
ta: அமைப்பு இடையகத்தைத் திறக்க முடியாது

# Nie można nałożyć powierzchni na siebie
source: Cannot overlay surfaces
ta: மேற்பரப்புகளை மேலெழுத முடியாது

# Nie można ustawić macierzy projekcji
source: Cannot set matrix projection
ta: மேட்ரிக்ச் திட்டத்தை அமைக்க முடியாது

# Rozdzielczość
source: Resolution
ta: பகுத்தல்

# Z wideo
source: From video
ta: வீடியோவிலிருந்து

# Szerokość
source: Width
ta: அகலம்

# Wysokość
source: Height
ta: உயரம்

# Macierz YCbCr
source: YCbCr matrix
ta: YCBCR மேட்ரிக்ச்

# 0: Autopodział, górna linijka jest szersza
source: 0: Auto, top line wider
ta: 0: ஆட்டோ, டாப் லைன் அகலமானது

# 1: Podział co koniec linijki, dzieli tylko \N
source: 1: End-of-line wrapping, only \N breaks
ta: 1: இறுதி-வரி மடக்குதல், \ n இடைவெளிகள் மட்டுமே

# 2: Brak podziału, dzieli \n i \N
source: 2: No wrapping, both \n and \N break
ta: 2: மடக்குதல் இல்லை, இரண்டும் \ n மற்றும் \ n இடைவெளி

# 3: Autopodział, dolna linijka jest szersza
source: 3: Auto, bottom line wider
ta: 3: ஆட்டோ, பாட்டம் லைன் அகலமானது

# Odwrócone
source: Reversed
ta: தலைகீழ்

# Styl dzielenia linijek
source: Wrap style
ta: மடக்கு பாணி

# Kolidowanie linijek
source: Colliding lines
ta: மோதிக் கோடுகள்

# Skaluj obwódkę i cień
source: Scale border and shadow
ta: அளவு எல்லை மற்றும் நிழல்

# Wysokość wideo
source: Video height
ta: வீடியோ உயரம்

# Szerokość wideo
source: Video width
ta: வீடியோ அகலம்

# Sposób dzielenia napisów
source: How to wrap lines
ta: கோடுகளை மடக்குவது எப்படி

# Skalowana obwódka i cień
source: Scale border and shadow
ta: அளவு எல்லை மற்றும் நிழல்

# Zaznacz
source: Select
ta: தேர்ந்தெடு

# Zawiera
source: With
ta: உடன்

# Nie zawiera
source: Without
ta: இல்லாமல்

# Czas Początkowy
source: Start time
ta: தொடக்க நேரம்

# Czas Końcowy
source: End time
ta: இறுதி நேரம்

# Dialogi / komentarze
source: Dialogue / comments
ta: உரையாடல் / கருத்துகள்

# Dialogi
source: Dialogue
ta: உரையாடல்

# Komentarze
source: Comments
ta: கருத்துகள்

# Dodaj do zaznaczenia
source: Add to selection
ta: தேர்வில் சேர்க்கவும்

# Odznacz
source: Deselect
ta: தேர்வுநீக்கு

# Zaznaczenie
source: Selection
ta: தேர்வு

# Nie rób nic
source: Do nothing
ta: எதுவும் செய்ய வேண்டாம்

# Wytnij
source: Cut
ta: வெட்டு

# Przenieś na początek
source: Move to beginning
ta: தொடக்கத்திற்கு செல்லுங்கள்

# Przenieś na koniec
source: Move to end
ta: முடிவுக்கு நகர்த்தவும்

# Ustaw jako komentarz
source: Comment
ta: கருத்து

# Akcja
source: Action
ta: செயல்

# Zaznacz na wszystkich zakładkach
source: Select in all tabs
ta: எல்லா தாவல்களிலும் தேர்ந்தெடுக்கவும்

# Zaznaczono %i linijek.
source: %i lines selected.
ta: %நான் தேர்ந்தெடுக்கப்பட்ட கோடுகள்.

# Dodano do zaznaczenia %i linijek.
source: %i lines added to selection.
ta: %i கோடுகள் தேர்வில் சேர்க்கப்பட்டுள்ளன.

# Odznaczono %i linijek.
source: %i lines deselected.
ta: %நான் வரிகள் தேர்வு செய்யப்பட்டன.

# Wprowadź nazwę profilu, bądź wybierz istniejący, by nadpisać
source: Write the name of the profile or select existing profile to overwrite
ta: சுயவிவரத்தின் பெயரை எழுதுங்கள் அல்லது மேலெழுதும் சுயவிவரத்தைத் தேர்ந்தெடுக்கவும்

# Na pewno chcesz nadpisać profil o nazwie %s
source: Do you want to overwrite profile of name %s
ta: பெயர் %s இன் சுயவிவரத்தை மேலெழுத விரும்புகிறீர்களா?

source: Post processor
ta: இடுகை செயலி

# Przesuwanie czasów
source: Shift times
ta: சிப்ட் நேரங்கள்

# Czasy wyższe i równe
source: All times higher and equal
ta: எல்லா நேரங்களும் உயர்ந்த மற்றும் சமமான

# Czasy niższe i równe
source: All times lower and equal
ta: எல்லா நேரங்களும் கீழ் மற்றும் சமமானவை

# Edycja profilów
source: Profile edition
ta: சுயவிவர பதிப்பு

# Dodawanie i edycja profilów
source: Adding and editing profiles
ta: சுயவிவரங்களைச் சேர்ப்பது மற்றும் திருத்துதல்

# Usuwanie profilów
source: Removing profiles
ta: சுயவிவரங்களை நீக்குதல்

# Przesuń
source: Shift
ta: உயர்த்து

# Przesuń czas napisów
source: Shifts subtitles times
ta: வசன வரிகளை மாற்றுகிறது

# W przód
source: Forward
ta: முன்னோக்கி

# W tył
source: Backward
ta: பின்னோக்கு

# Czasy tagów
source: Tag times
ta: குறிச்சொல் நேரங்கள்

# Przesuwanie wg wideo / audio
source: Shift by video / audio
ta: வீடியோ / ஆடியோ மூலம் மாற்றவும்

# Początek
source: Start
ta: தொடங்கு

# Koniec
source: End
ta: முடிவு

# Przesuń znacznik do czasu wideo
source: Move the marker to video time
ta: மார்க்கரை நகர்த்தவும் வீடியோ நேரத்திற்கு

# Przesuń znacznik do czasu audio
source: Move the marker to audio time
ta: மார்க்கரை நகர்த்தவும் ஆடியோ நேரத்திற்கு

# Sposób przesuwania czasów
source: A method of time shift
ta: நேர மாற்றத்தின் முறை

# Obydwa czasy
source: Both times
ta: இரண்டு முறை

# Korekcja czasów końcowych
source: Correction end times
ta: திருத்தம் இறுதி நேரங்கள்

# Pozostaw bez zmian
source: Leave unchanged
ta: மாறாமல் விடுங்கள்

# Skoryguj nachodzące czasy
source: Adjust overlapping times
ta: ஒன்றுடன் ஒன்று நேரங்களை சரிசெய்யவும்

# Nowe czasy
source: New times
ta: புதிய நேரங்கள்

# Wstęp i zakończenie
source: Lead-in/lead-out
ta: லீட்-இன்/லீட்-அவுட்

# Uruchom postprocessor
source: Run post processor
ta: போச்ட் செயலியை இயக்கவும்

# Ustaw czasy jako ciągłe
source: Set times as continuous
ta: நேரங்களை தொடர்ச்சியாக அமைக்கவும்

# Włącz
source: Enable
ta: இயக்கு

# Próg czasu początku
source: Start time threshold
ta: தொடக்க நேர வாசல்

# Próg czasu końca
source: End time threshold
ta: இறுதி நேர வாசல்

# Wyrównaj do klatek kluczowych
source: Snap to keyframes
ta: கீஃப்ரேம்களுக்கு ஒடி

# Przed czasem początku
source: Before the start of time
ta: நேரம் தொடங்குவதற்கு முன்

# Po czasie początku
source: After the start time
ta: தொடக்க நேரத்திற்குப் பிறகு

# Przed czasem końca
source: Before the end time
ta: இறுதி நேரத்திற்கு முன்

# Po czasie końca
source: After the end time
ta: இறுதி நேரத்திற்குப் பிறகு

# Wybór linijek do przesunięcia
source: The choice of lines to move
ta: நகர வரிகளின் தேர்வு

# Wybierz style z listy
source: Select a style from the list
ta: பட்டியலிலிருந்து ஒரு பாணியைத் தேர்ந்தெடுக்கவும்

# Przesuń według następujących stylów (oddzielone przecinkiem)
source: Move according to the following styles (separated by a coma)
ta: பின்வரும் பாணிகளின்படி நகர்த்தவும் (கோமாவால் பிரிக்கப்பட்டுள்ளது)

# Czas przesunięcia
source: Time shifts
ta: நேரம் மாற்றுகிறது

# Przesuwanie zaznaczonej linijki do czasu wideo ± czas przesunięcia
source: Move the selected line to the time video ± time shift
ta: தேர்ந்தெடுக்கப்பட்ட வரியை நகர்த்தவும் நேர வீடியோ ± நேர மாற்றத்திற்கு

# Przesuwanie zaznaczonej linijki do czasu znacznika audio ± czas przesunięcia
source: Move the selected lines to mark time audio ± time shift
ta: தேர்ந்தெடுக்கப்பட்ட வரிகளை நகர்த்தவும் நேர ஆடியோ ± நேர மாற்றத்தைக் குறிக்கவும்

# Przesuwa czas początkowy do czasu wideo / audio
source: Move the start time to the time video / audio
ta: தொடக்க நேரத்தை நேர வீடியோ / ஆடியோவுக்கு நகர்த்தவும்

# Przesuwa czas końcowy do czasu wideo / audio
source: Moves the end time to the time video / audio
ta: இறுதி நேரத்தை நேர வீடியோ / ஆடியோவுக்கு நகர்த்துகிறது

# Opóźnia napisy
source: Delays subtitles
ta: வசன வரிகள் தாமதப்படுத்துகின்றன

# Przyspiesza napisy
source: Accelerates subtitles
ta: வசன வரிகள் துரிதப்படுத்துகின்றன

# Przesuwa napisy o ustawiony czas / klatki
source: Shift times by time / frames
ta: நேரம் / பிரேம்களால் நேரங்களை மாற்றவும்

source: Shift tag \move, \t, \fad times that its video position don't change. (slow downs shifting times)
ta: சிப்ட் டேக் \ நகர்வு, \ டி, \ ஃபேட் டைம்ச் அதன் வீடியோ நிலை மாறாது. (மெதுவாக மாற்றும் நேரங்கள்)

# Wybór czasów do przesunięcia
source: The choice of times to move
ta: நகர்த்துவதற்கான நேரங்களின் தேர்வு

# Korekcja czasów końcowych, gdy są niewłaściwe albo nachodzą na siebie
source: Correction end times, when they are improper or overlap each other
ta: திருத்தம் இறுதி நேரங்கள், அவை முறையற்றதாக இருக்கும்போது அல்லது ஒருவருக்கொருவர் ஒன்றுடன் ஒன்று

# Wstawia wstęp do czasu początkowego, dobre przy stosowaniu fad
source: Inserts introduction to the start time (good when using fad)
ta: தொடக்க நேரத்திற்கு அறிமுகத்தை செருகும் (FAD ஐப் பயன்படுத்தும் போது நல்லது)

# Czas wstępu w milisekundach
source: Introduction time in milliseconds
ta: மில்லி விநாடிகளில் அறிமுக நேரம்

# Wstawia zakończenie do czasu końcowego, dobre przy stosowaniu fad
source: Inserts introduction to the end time (good when using fad)
ta: இறுதி நேரத்திற்கு அறிமுகத்தை செருகும் (FAD ஐப் பயன்படுத்தும் போது நல்லது)

# Czas zakończenia w milisekundach
source: End time in milliseconds
ta: மில்லி விநாடிகளில் இறுதி நேரம்

# Próg wydłużania czasu początkowego
source: Start time threshold
ta: தொடக்க நேர வாசல்

# Próg wydłużania czasu końcowego
source: End time threshold
ta: இறுதி நேர வாசல்

source: The maximum shift to a keyframe before the start time in milliseconds
ta: ஒரு கீஃப்ரேமுக்கு அதிகபட்ச மாற்றம் மில்லி விநாடிகளில் தொடக்க நேரத்திற்கு முன்

source: The maximum shift to a keyframe after the start time in milliseconds
ta: ஒரு கீஃப்ரேமுக்கு அதிகபட்ச மாற்றம் மில்லி விநாடிகளில் தொடக்க நேரத்திற்குப் பிறகு

source: The maximum shift to a keyframe before the end time in milliseconds
ta: ஒரு கீஃப்ரேமுக்கு அதிகபட்ச மாற்றம் மில்லி விநாடிகளில் இறுதி நேரத்திற்கு முன்

# Maksymalne przesunięcie do klatki kluczowej po czasie końcowym w milisekundach
source: The maximum shift to a keyframe after the end time in milliseconds
ta: ஒரு கீஃப்ரேமுக்கு அதிகபட்ச மாற்றம் மில்லி விநாடிகளில் இறுதி நேரத்திற்குப் பிறகு

# Na liście nie wybrano profilu do usunięcia
source: There is no selected profile to remove
ta: அகற்ற தேர்ந்தெடுக்கப்பட்ட சுயவிவரம் எதுவும் இல்லை

# Na pewno chcesz usunąć profil o nazwie "%s"
source: Do you want to remove profile of name "%s"
ta: "%s" என்ற பெயரின் சுயவிவரத்தை அகற்ற விரும்புகிறீர்களா?

source: Cannot find dictionary files in "%s\Dictionary" folder. Spell checker will be disabled
ta: "%s \ அகராதி" கோப்புறையில் அகராதி கோப்புகளைக் கண்டுபிடிக்க முடியவில்லை. எழுத்துப்பிழை சரிபார்ப்பு முடக்கப்படும்

# Nie można odczytać formatu konwersji słownika.
source: Unable to read the dictionary conversion format.
ta: அகராதி மாற்று வடிவமைப்பைப் படிக்க முடியவில்லை.

# Nie można zainicjalizować sprawdzania pisowni.
source: Failed to initialize spell checker.
ta: எழுத்துப்பிழை சரிபார்ப்பைத் தொடங்குவதில் தோல்வி.

# Ignoruj komentarze
source: Ignore comments
ta: கருத்துகளை புறக்கணிக்கவும்

# Ignoruj słowa całe pisane wielką literą
source: Ignore upper case words
ta: மேல் வழக்கு சொற்களை புறக்கணிக்கவும்

# Błędne słowo:
source: Misspell word:
ta: எழுத்துப்பிழை:

# Zmień na:
source: Replace to:
ta: இதற்கு பதிலாக:

# Ignoruj
source: Ignore
ta: புறக்கணிக்கவும்
