Repository: 247i/TACETr
Catalog: உரை/தானி/kainote-kainote-*.po
Languages: ta

# Timing karaoke (nieobsługiwane)
source: Karaoke timing (not supported)
ta: கரோக்கி நேரம் (ஆதரிக்கப்படவில்லை)

# Ruch tekstu
source: Text movement
ta: உரை இயக்கம்

# Ruch po okręgu
source: Circle text movement
ta: வட்ட உரை இயக்கம்

# Ruch po krzywej (3 punkty)
source: Curve text movement (3 points)
ta: வளைவு உரை இயக்கம் (3 புள்ளிகள்)

# Ruch po krzywej (4 punkty)
source: Curve text movement (4 points)
ta: வளைவு உரை இயக்கம் (4 புள்ளிகள்)

# Ruch rysunku wektorowego
source: Move of vector clip
ta: திசையன் கிளிப்பின் நகர்வு

# Kotwica dla obrotów
source: Anchor for rotation
ta: சுழற்சிக்கான நங்கூரம்

# Rysunek wektorowy i skala
source: Drawing and its scale
ta: வரைதல் மற்றும் அதன் அளவு

# Przesunięcie punktów wektora w osi Y
source: Offset of Y vector points
ta: ஒய் திசையன் புள்ளிகளின் ஆஃப்செட்

# Pozycja tekstu
source: Text position
ta: உரை நிலை

# Sposób łamania linii
source: Text wrap method
ta: உரை மடக்கு முறை

# Reset tagów
source: Tags reset
ta: குறிச்சொற்கள் மீட்டமைக்கின்றன

# Losowość punktów czcionki
source: Random font points
ta: சீரற்ற எழுத்துரு புள்ளிகள்

# Losowość punktów czcionki seed
source: Random font points seed
ta: சீரற்ற எழுத்துரு புள்ளிகள் விதை

# Losowość punktów czcionki oś X
source: Random font points X axis
ta: சீரற்ற எழுத்துரு புள்ளிகள் ஃச் அச்சு

# Losowość punktów czcionki oś Y
source: Random font points Y axis
ta: சீரற்ற எழுத்துரு புள்ளிகள் ஒய் அச்சு

# Losowość punktów czcionki oś Z
source: Random font points Z axis
ta: சீரற்ற எழுத்துரு புள்ளிகள் சட் அச்சு

# Przekreślenie tekstu
source: Text strike out
ta: உரை வேலைநிறுத்தம்

# Cień tekstu
source: Text shadow
ta: உரை நிழல்

# Animacja tekstu
source: Text animation
ta: உரை அனிமேசன்

# Podkreślenie tekstu
source: Text underline
ta: உரை அடிக்கோடிட்டு

# Obwódka w osi X
source: Border in X axis
ta: ஃச் அச்சில் எல்லை

# Obwódka w osi Y
source: Border in Y axis
ta: ஒய் அச்சில் எல்லை

# Cień w osi X
source: Shadow in X axis
ta: ஃச் அச்சில் நிழல்

# Cień w osi Y
source: Shadow in Y axis
ta: ஒய் அச்சில் நிழல்

# Koordynata Z dla tagów \frx i \fry
source: Z coordinate for tags \frx and \fry
ta: குறிச்சொற்களுக்கு சட் ஒருங்கிணைப்பு \ frx மற்றும் \ fry

# Nie można znaleźć elementu o id %i
source: Cannot find element with id %i
ta: ஐடி %i உடன் உறுப்பைக் கண்டுபிடிக்க முடியவில்லை

# Wybierz ikony paska narzędzi
source: Choose toolbar icons
ta: கருவிப்பட்டி சின்னங்களைத் தேர்வுசெய்க

# Po lewej
source: On left
ta: இடதுபுறம்

# U góry
source: On top
ta: மேலே

# Po prawej
source: On right
ta: வலதுபுறம்

# Na dole
source: On bottom
ta: கீழே

# Pozycja paska narzędzi
source: Toolbar alignment
ta: கருவிப்பட்டி சீரமைப்பு

# Nie można pobrać informacji o monitorze
source: Unable to retrieve information about the monitor
ta: மானிட்டர் பற்றிய தகவல்களை மீட்டெடுக்க முடியவில்லை

# Proporcje ekranu: %5.3f
source: Aspect ratio: %5.3f
ta: விகித விகிதம்: %5.3 எஃப்

# Odtwórz aktywną linię
source: Play the current line
ta: தற்போதைய வரியை விளையாடுங்கள்

source: File isn't a correct video file or is corrupted or codecs or splitter might be missing
ta: கோப்பு சரியான வீடியோ கோப்பு அல்ல அல்லது சிதைந்துள்ளது அல்லது கோடெக்குகள் அல்லது ச்ப்ளிட்டர் காணாமல் போகலாம்

# Czy na pewno chcesz zindeksować poprzednie wideo?
source: Are you sure you want to index the previous video?
ta: முந்தைய வீடியோவை குறியிட விரும்புகிறீர்களா?

# Czy na pewno chcesz zindeksować następne wideo?
source: Are you sure you want to index the next video?
ta: அடுத்த வீடியோவை குறியிட விரும்புகிறீர்களா?

# Odtwórz
source: Play
ta: விளையாடுங்கள்

# Pauza
source: Pause
ta: இடைநிறுத்தம்

# Kopiuj pozycję na wideo
source: Copy video position
ta: வீடியோ நிலையை நகலெடுக்கவும்

# Pełny ekran F
source: Full screen F
ta: முழுத் திரை f

# Wyłącz pełny ekran Escape
source: Exit full screen Escape
ta: முழு திரை தப்பிக்க

# Przełącz pełny ekran na %i monitor
source: Switch full screen to monitor %i
ta: %i ஐ கண்காணிக்க முழுத் திரையை மாற்றவும்

# Włącz pełny ekran na %i monitorze
source: Open in full screen on monitor %i
ta: மானிட்டர் %i இல் முழுத் திரையில் திறக்கவும்

# Otwórz edytor
source: Open editor
ta: திறந்த ஆசிரியர்

# Filtry
source: Filters
ta: வடிப்பான்கள்

# Wyświetla użyte filtry
source: Shows used filters
ta: பயன்படுத்தப்பட்ட வடிப்பான்களைக் காட்டுகிறது

# Czy na pewno chcesz przenieść wczytany plik wideo do kosza?
source: Are you sure you want to move loaded video to recycle bin?
ta: ஏற்றப்பட்ட வீடியோவை மறுசுழற்சி தொட்டிக்கு நகர்த்த விரும்புகிறீர்களா?

# Usuwanie
source: Deleting
ta: நீக்குதல்

source: Video files(*.avi),(*.mkv),(*.mp4),(*.ogm),(*.wmv),(*.asf),(*.rmvb),(*.rm),(*.3gp),(*.avs)|*.avi;*.mkv;*.mp4;*.ogm;*.wmv;*.asf;*.rmvb;*.rm;*.3gp;*.avs|All files (*.*)|*.*
ta: வீடியோ கோப்புகள் (*. அவி), (*. எம்.கே.வி), (*. MP4), (*. OGM), (*. WMV), (*. ASF), (*. RMVB), (*. RM), (*.3GP), (*. Avs) |*. avs | அனைத்து கோப்புகளும் (*.*) |*.*

# Pliki napisów (*.ass),(*.sub),(*.txt)|*.ass;*.sub;*.txt
source: Subtitle files (*.ass),(*.sub),(*.txt)|*.ass;*.sub;*.txt
ta: வசன கோப்புகள் (*.ஆச்), (*. துணை), (*. TXT) |*.ASS;*. துணை;*

# Poprzedni plik wideo
source: Previous video file
ta: முந்தைய வீடியோ கோப்பு

# Pokaż pasek narzędzi
source: Show toolbar icons
ta: கருவிப்பட்டி சின்னங்களைக் காட்டு

# Wskaźnik pozycji
source: Position pointer
ta: நிலை சுட்டிக்காட்டி

# Przesuwanie tekstu
source: Text positioning
ta: உரை பொருத்துதல்

# Ruch
source: Text moving
ta: உரை நகரும்

# Skalowanie
source: Text scaling
ta: உரை அளவிடுதல்

# Obrót wokół osi Z
source: Text Z rotation
ta: உரை சட் சுழற்சி

# Obrót wokół osi X / Y
source: Text X / Y rotation
ta: உரை ஃச் / ஒய் சுழற்சி

# Wycinki prostokątne
source: Rectangle clipping
ta: செவ்வகம் கிளிப்பிங்

# Wycinki wektorowe
source: Vectorial clipping
ta: திசையன் கிளிப்பிங்

# Rysunki wektorowe
source: Vectorial drawing
ta: திசையன் வரைதல்

# Zmieniacz pozycji
source: Position shifter
ta: நிலை சிஃப்ட்டர்

source: Hydra
ta: ஐட்ரா

# Zmieniacz skali i obrotów
source: Scale and rotation shifter
ta: அளவு மற்றும் சுழற்சி சிஃப்ட்டர்

# Przesuń punkty
source: Move points
ta: புள்ளிகளை நகர்த்தவும்

# Dodaj krzywą Beziera
source: Add Bézier curve
ta: பெசியர் வளைவைச் சேர்க்கவும்

# Dodaj krzywą B-sklejaną
source: Add B-spline
ta: பி-ச்பைனைச் சேர்க்கவும்

# Dodaj nowy oddzielny punkt
source: Add separate point
ta: தனி புள்ளியைச் சேர்க்கவும்

# Usuń element
source: Delete point
ta: புள்ளியை நீக்கு

# Odwróć wycinek
source: Invert clip
ta: கிளிப் தலைகீழ்

# Przenieś punkty pozycjonowania
source: Move position points
ta: நிலை புள்ளிகளை நகர்த்தவும்

# Przenieś startowe punkty ruchu
source: Change \move starting points
ta: மாற்ற \ தொடக்க புள்ளிகளை நகர்த்தவும்

# Przenieś końcowe punkty ruchu
source: Change \move ending points
ta: மாற்றம் \ முடிவு புள்ளிகளை நகர்த்தவும்

# Przenieś wycinki
source: Move clips
ta: கிளிப்களை நகர்த்தவும்

source: Move drawings. Use only if you want to move drawing points. Do not use with first three options
ta: வரைபடங்களை நகர்த்தவும். வரைதல் புள்ளிகளை நகர்த்த விரும்பினால் மட்டுமே பயன்படுத்தவும். முதல் மூன்று விருப்பங்களுடன் பயன்படுத்த வேண்டாம்

# Przenieś punkty org
source: Move \org points
ta: \ Org புள்ளிகளை நகர்த்தவும்

source: Set angle from 2 points. After setting 2 points below text on video it calculates angle from it.
ta: 2 புள்ளிகளிலிருந்து கோணத்தை அமைக்கவும். வீடியோவில் உரைக்குக் கீழே 2 புள்ளிகளை அமைத்த பிறகு அதிலிருந்து கோணத்தை கணக்கிடுகிறது.

# Zmiana wszystkich tagów obrotu wokół osi Z
source: Changing all tags rotation Z
ta: எல்லா குறிச்சொற்களையும் மாற்றுதல் சுழற்சி சட்

source: Preserve proportions, that vector drawings and text don't change its original positions.
ta: விகிதாச்சாரங்களைப் பாதுகாக்கவும், அந்த திசையன் வரைபடங்கள் உரை அதன் அசல் நிலைகளை மாற்றாது.

source: Set scale by rectangle. After drawing rectangle text is scaled in two or one axis.
ta: செவ்வகம் மூலம் அளவை அமைக்கவும். செவ்வக உரை வரைதல் அளவிடப்பட்ட பிறகு இரண்டு அல்லது ஒரு அச்சில்.

# Skaluj szerokość
source: Scale width
ta: அளவிலான அகலம்

# Utrzymuj proporcje
source: Preserve aspect ratio
ta: விகித விகிதத்தைப் பாதுகாக்கவும்

# Skaluj wysokość
source: Scale height
ta: அளவிலான உயரம்

source: Set custom rectangle for current scale. When automatic size calculation not work properly it's possible to set rectangle for origin scale.
ta: தற்போதைய அளவிற்கு தனிப்பயன் செவ்வகத்தை அமைக்கவும். தானியங்கி அளவு கணக்கீடு சரியாக வேலை செய்யாதபோது தோற்றம் அளவிற்கு செவ்வகத்தை அமைக்க முடியும்.

# Zmiana wszystkich tagów skali
source: Change all scale tags
ta: அனைத்து அளவிலான குறிச்சொற்களையும் மாற்றவும்

source: Preserve proportions that vector drawings and text don't change its original positions.
ta: திசையன் வரைபடங்களை அந்த விகிதாச்சாரங்களைப் பாதுகாக்கவும் உரை அதன் அசல் நிலைகளை மாற்றாது.

source: Set position by rectangle. After draw a rectangle line will be positioned by one or two axis for chosen alignment.
ta: செவ்வகம் மூலம் நிலையை அமைக்கவும். வரையப்பட்ட பிறகு ஒரு செவ்வக கோடு நிலைநிறுத்தப்படும் தேர்ந்தெடுக்கப்பட்ட சீரமைப்புக்கு ஒன்று அல்லது இரண்டு அச்சு மூலம்.

# Pozycjonuj w osi X
source: Positioning in X axis
ta: ஃச் அச்சில் பொருத்துதல்

# Pozycjonuj w osi Y
source: Positioning in Y axis
ta: ஒய் அச்சில் பொருத்துதல்

source: Set move from 2 points and video position. After set first point on video before text that moving, set video to end that many frames, that element of first set point will still visible. vMove is generated after set second point.
ta: 2 புள்ளிகள் மற்றும் வீடியோ நிலையில் இருந்து நகர்த்தவும். நகரும் உரைக்கு முன் வீடியோவில் முதல் புள்ளியை அமைத்த பிறகு, பல பிரேம்களை முடிக்க வீடியோவை அமைக்கவும், முதல் செட் புள்ளியின் அந்த உறுப்பு இன்னும் தெரியும். இரண்டாவது புள்ளியை நிர்ணயித்த பிறகு vmove உருவாக்கப்படுகிறது.

# Zmiana wszystkich tagów obrotu wokół osi X / Y
source: Changing all tags of rotation X / Y
ta: சுழற்சியின் அனைத்து குறிச்சொற்களையும் மாற்றுதல் ஃச் / ஒய்

# Dwukrotnym kliknięciu linii (zawsze włączone)
source: Double-clicking line (always On)
ta: இரட்டை சொடுக்கு வரி (எப்போதும் இருக்கும்)

# Każdej zmianie linii
source: Every line change
ta: ஒவ்வொரு வரி மாற்றமும்

# Kliknięciu linii lub edycji na pauzie
source: Clicking line or edition when paused
ta: இடைநிறுத்தப்படும்போது வரி அல்லது பதிப்பைக் சொடுக்கு செய்க

# Kliknięciu linii lub edycji
source: Clicking line or edition
ta: வரி அல்லது பதிப்பைக் சொடுக்கு செய்க

# Edycji na pauzie
source: Editing line when paused
ta: இடைநிறுத்தப்படும் போது திருத்துதல் வரி

# Edycji
source: Editing line whenever
ta: எப்போது வேண்டுமானாலும் திருத்துதல்

# Nic
source: Nothing
ta: எதுவும்

# Audio do końca linii
source: Audio to the line end time
ta: வரி இறுதி நேரத்திற்கு ஆடியோ

# Wideo do końca linii
source: Video and audio to the line end time
ta: வரி இறுதி நேரத்திற்கு வீடியோ மற்றும் ஆடியோ

# Wideo do początku następnej linii
source: Video and audio to the next line start time
ta: வீடியோ மற்றும் ஆடியோ அடுத்த வரி தொடக்க நேரத்திற்கு

# Przesuwaj wideo do aktualnej linii po:
source: Move video to selected line on:
ta: தேர்ந்தெடுக்கப்பட்ட வரிக்கு வீடியோவை நகர்த்தவும்:

# Odtwarzaj po zmianie linii:
source: On moving to another line play:
ta: மற்றொரு வரி நாடகத்திற்குச் செல்லும்போது:

# Wybierz
source: Choose
ta: தேர்வு

source: List of ASS drawings with edit option. After choose drawing from list just set cursor i n place of start of drawing and click left mouse button and drag.
ta: திருத்து விருப்பத்துடன் கழுதை வரைபடங்களின் பட்டியல். பட்டியலிலிருந்து வரைபடத்தைத் தேர்ந்தெடுத்த பிறகு, கர்சர் i n இடத்தை அமைக்கவும் வரைதல் தொடங்கி இடது சுட்டி பொத்தானைக் சொடுக்கு செய்து இழுக்கவும்.

# Lista z tagami obsługiwanymi przez narzędzie
source: List of tags that can edit visual tool
ta: காட்சி கருவியைத் திருத்தக்கூடிய குறிச்சொற்களின் பட்டியல்

# Wstaw
source: Insert
ta: செருகவும்

# Pomnóż
source: Multiply
ta: பெருக்கவும்

# Pomnóż+
source: Multiply+
ta: பெருக்கல்+

# Gradient tekst
source: Gradient text
ta: சாய்வு உரை

# Gradient linia
source: Gradient line
ta: சாய்வு வரி

source: Options of tag changing: Add - changes all tags adding move on slider. Insert - inserts tag in cursor position when one line or on start of line when multiline. Multiply - multiply move of slider by number od selected line first line is not changes. Made for cascade placing.
ta: குறிச்சொல் மாற்றுவதற்கான விருப்பங்கள்: சேர் - ச்லைடரில் நகரும் அனைத்து குறிச்சொற்களையும் மாற்றுகிறது. செருகவும் - ஒரு வரியாக இருக்கும்போது கர்சர் நிலையில் குறிச்சொல்லை செருகவும் அல்லது மல்டிலைன் போது வரியின் தொடக்கத்தில். பெருக்கவும் - ச்லைடரின் நகர்வை எண் ஓட் தேர்ந்தெடுக்கப்பட்ட வரியால் பெருக்கவும் முதல் வரி மாற்றங்கள் அல்ல. அடுக்கை வைப்பதற்காக தயாரிக்கப்பட்டது.

# Edycja tagów z listy oraz tworzenie nowych
source: Edition list tags or adding a new tags
ta: பதிப்பு பட்டியல் குறிச்சொற்கள் அல்லது புதிய குறிச்சொற்களைச் சேர்ப்பது

# Lewo-dół
source: Left-bottom
ta: இடது கீழ்

# Środek-dół
source: Center-bottom
ta: சென்டர்-கீழ்

# Prawo-dół
source: Right-bottom
ta: வலது கீழ்

# Lewo-środek
source: Left-center
ta: இடது-மையம்

# Środek
source: Center
ta: நடுவண்

# Prawo-środek
source: Right-center
ta: வலது மையமானது

# Lewo-góra
source: Left-top
ta: இடது-மேல்

# Środek-góra
source: Center-top
ta: மையம்-மேல்

# Prawo-góra
source: Right-top
ta: வலது மேல்

# Lewo-poniżej
source: Left-below
ta: இடது-பெலோ

# Środek-poniżej
source: Center-below
ta: சென்டர்-பெலோ

# Prawo-poniżej
source: Right-below
ta: வலது-பெலோ

# Lewo-ponad
source: Left-above
ta: இடதுபுறம்

# Środek-ponad
source: Center-above
ta: மையத்திற்கு மேல்

# Prawo-ponad
source: Right-above
ta: வலதுபுறம்

# Przed-góra
source: Before-top
ta: முன்

# Przed-środek
source: Before-center
ta: மையத்திற்கு முன்

# Przed-dół
source: Before-bottom
ta: முன்

# Za-góra
source: After-top
ta: பின்-பின்

# Za-środek
source: After-center
ta: பின் மையத்தில்

# Za-dół
source: After-bottom
ta: பிறகு

# Położenie tekstu, działa podobnie jak w stylach
source: Text placing works similar like in styles
ta: உரை வைப்பது பாணிகளைப் போலவே செயல்படுகிறது

# Edycja tagów
source: Tag edition
ta: குறிச்சொல் பதிப்பு

# Edytowany tag
source: Edited tag
ta: திருத்தப்பட்ட குறிச்சொல்

# Dodaj tag
source: Add tag
ta: குறிச்சொல்லைச் சேர்க்கவும்

# Usuń tag
source: Delete tag
ta: குறிச்சொல்லை நீக்கு

# Edycja tagu
source: Tag edition
ta: குறிச்சொல் பதிப்பு

# Nazwa:
source: Name:
ta: பெயர்:

source: Tag:
ta: குறிச்சொல்:

# Minimalna wartość:
source: Minimal value:
ta: குறைந்தபட்ச மதிப்பு:

# Maksymalna wartość:
source: Maximal value:
ta: அதிகபட்ச மதிப்பு:

# Przeskok:
source: Step:
ta: படி:

# Wstawiany w miejscu kursora
source: Tag inserted in place of cursor
ta: குறிச்சொல் கர்சருக்கு பதிலாக செருகப்பட்டது

# Wstawiany tylko na początku
source: Insert Tag at text beginning of text
ta: உரையின் தொடக்கத்தில் குறிச்சொல்லைச் செருகவும்

# Wycinek prostokątny z obsługą animacji
source: Clip rectangle with \t animation
ta: \ T அனிமேசனுடன் கிளிப் செவ்வகம்

# Liczby po przecinku:
source: Number after dot:
ta: புள்ளிக்குப் பிறகு எண்:

# Brak dodatkowych wartości
source: No additional values
ta: கூடுதல் மதிப்புகள் இல்லை

# jedna dodatkowa wartość
source: One additional value
ta: ஒரு கூடுதல் மதிப்பு

# dwie dodatkowe wartości
source: two additional values
ta: இரண்டு கூடுதல் மதிப்புகள்

# trzy dodatkowe wartości
source: three additional values
ta: மூன்று கூடுதல் மதிப்புகள்

# Używane tylko w przypadku gdy tag ma 2 wartości bądź więcej
source: Used only when tag have 2 values or more
ta: குறிச்சொல்லில் 2 மதிப்புகள் அல்லது அதற்கு மேற்பட்டவை இருக்கும்போது மட்டுமே பயன்படுத்தப்படுகிறது

# Opcje zmiany tagów
source: Change tags options
ta: குறிச்சொற்களின் விருப்பங்களை மாற்றவும்

# Wartość %i
source: Value %i
ta: மதிப்பு %i

# Dodatkowe wartości:
source: Additional values:
ta: கூடுதல் மதிப்புகள்:

# Przywróć domyślne
source: Restore default
ta: இயல்புநிலையை மீட்டமைக்கவும்

# Czy na pewno chcesz przywrócić ustawienia domyślne?
source: Are you sure you want to reset to default?
ta: இயல்புநிலைக்கு மீட்டமைக்க விரும்புகிறீர்களா?

# Wpisz nazwę nowego tagu.
source: Enter a name for the new tag.
ta: புதிய குறிச்சொல்லுக்கு ஒரு பெயரை உள்ளிடவும்.

# Nowy tag już istnieje na liście, wpisz inną nazwę.
source: New tag already exists, enter another name.
ta: புதிய குறிச்சொல் ஏற்கனவே உள்ளது, மற்றொரு பெயரை உள்ளிடவும்.

# Nie można usunąć wszystkich tagów z listy
source: Cannot remove all tags from list
ta: எல்லா குறிச்சொற்களையும் பட்டியலிலிருந்து அகற்ற முடியாது

# Zapisać zmiany tagu "%s"?
source: Save changes of tag "%s"?
ta: குறிச்சொல்லின் மாற்றங்களை "%s" சேமிக்கவா?

# Pole "Tag" nie może być puste.
source: Field "Tag" cannot be empty.
ta: புலம் "குறிச்சொல்" காலியாக இருக்க முடியாது.

source: Field "Maximum value" have to contain value greater from field "Minimum value".
ta: புலம் "அதிகபட்ச மதிப்பு" மதிப்பைக் கொண்டிருக்க வேண்டும் புலம் "குறைந்தபட்ச மதிப்பு" இலிருந்து அதிகமாகும்.

# Pole "Przeskok" zawiera liczbę zbyt wysoką dla danego przedziału.
source: Field "Step" contains number too great for current min - max range.
ta: புலம் "படி" தற்போதைய மணித்துளி - அதிகபட்ச வரம்பிற்கு மிகச்சிறந்த எண்ணைக் கொண்டுள்ளது.

source: Double "m" was blocked because of Vsfilter bug
ta: VSFILTER பிழை காரணமாக இரட்டை "M" தடுக்கப்பட்டது

# Edycja kształtów wektorowych
source: Edition of vector shapes
ta: திசையன் வடிவங்களின் பதிப்பு

# Edytowany kształt
source: Edited shape
ta: திருத்தப்பட்ட வடிவம்

# Dodaj kształt
source: Add shape
ta: வடிவத்தைச் சேர்க்கவும்

# Usuń kształt
source: Delete shape
ta: வடிவத்தை நீக்கு

# Zmienna szerokość i wysokość
source: Changed width and height
ta: அகலம் மற்றும் உயரத்தை மாற்றியது

# Zachowaj proporcje boków
source: Preserve aspect ratio
ta: விகித விகிதத்தைப் பாதுகாக்கவும்

# Zmienna tylko szerokość
source: Changed is only width
ta: மாற்றப்பட்டது அகலம் மட்டுமே

# Zmiana koordynatów rysunku
source: Changing only drawing coordinates
ta: வரைதல் ஆயங்களை மட்டுமே மாற்றுகிறது

# Zmiana skali
source: Scale changing
ta: அளவிலான மாறும்

# Skalowanie względem kursora:
source: Scaling via cursor:
ta: கர்சர் வழியாக அளவிடுதல்:

# Rodzaj skalowania:
source: Scaling mode:
ta: அளவிடுதல் முறை:

# Pobierz kształt z aktywnej linii
source: Get shape from active line
ta: செயலில் உள்ள வரியிலிருந்து வடிவத்தைப் பெறுங்கள்

# Kształt:
source: Shape:
ta: வடிவம்:

# Wpisz nazwę nowego ksztatłu.
source: Enter a name for the new shape.
ta: புதிய வடிவத்திற்கு ஒரு பெயரை உள்ளிடவும்.

# Nowy ksztatł już istnieje na liście, wpisz inną nazwę.
source: New shape name already exists, enter another name.
ta: புதிய வடிவ பெயர் ஏற்கனவே உள்ளது, மற்றொரு பெயரை உள்ளிடவும்.

# Nie można usunąć wszystkich kształtów z listy
source: Cannot remove all shapes from the list
ta: பட்டியலிலிருந்து அனைத்து வடிவங்களையும் அகற்ற முடியாது

# Zapisać zmiany kształtu "%s"?
source: Save "%s" shape edition?
ta: "%s" வடிவ பதிப்பை சேமிக்கவா?

# Pole "kształt" nie może być puste.
source: Field "shape" cannot be empty.
ta: புலம் "வடிவம்" காலியாக இருக்க முடியாது.

# Wideo musi być ustawione minimum jedną klatkę po czasie początkowym linijki
source: Video must be set at least one frame after start time of line
ta: வரியின் தொடக்க நேரத்திற்குப் பிறகு குறைந்தபட்சம் ஒரு சட்டத்தையாவது வீடியோ அமைக்கப்பட வேண்டும்

# Nie można pobrać wartości clipa prostokątnego.
source: Cannot read clip rectangle values.
ta: கிளிப் செவ்வக மதிப்புகளைப் படிக்க முடியாது.

# Narzędzia edycji wizualnej nie działają na komentarzach
source: Visual tools not working on comments
ta: காட்சி கருவிகள் கருத்துகளில் செயல்படவில்லை

# Linia nie jest widoczna na wideo albo ma zerowy czas trwania
source: Line is not visible on video or has zero duration
ta: வீடியோவில் வரி தெரியவில்லை அல்லது சுழிய காலம் உள்ளது

# W motywie "%s" brakowało część kolorów, zostały doczytane z domyślnego.
source: In theme "%s" some colors was missing, and was loaded from default.
ta: கருப்பொருள் "%s" இல் சில வண்ணங்கள் காணவில்லை, இயல்புநிலையிலிருந்து ஏற்றப்பட்டன.

# Nie można zaczytać motywu, zostanie przywrócony domyśny
source: Cannot load theme, reset to default
ta: கருப்பொருள் ஏற்ற முடியாது, இயல்புநிலைக்கு மீட்டமைக்கவும்

# Nie można zainicjalizować COM
source: Cannot initialize COM
ta: COM ஐ துவக்க முடியாது

# Błąd inicjalizacji Direct Show
source: Failed to initialize Direct Show
ta: நேரடி நிகழ்ச்சியைத் தொடங்கத் தவறிவிட்டது

# Filtr źródła nie został dodany
source: Source filter not added
ta: மூல வடிகட்டி சேர்க்கப்படவில்லை

# Nie można dodać renderera wideo
source: Cannot add video renderer
ta: வீடியோ ரெண்டரரைச் சேர்க்க முடியாது

# Nie można utworzyć instancji renderera dźwięku
source: Cannot create audio renderer instance
ta: ஆடியோ ரெண்டரர் உதாரணத்தை உருவாக்க முடியாது

# Nie można dodać renderera Direct Sound
source: Cannot add Direct Sound renderer
ta: நேரடி ஒலி ரெண்டரரைச் சேர்க்க முடியாது

# Nie można wyliczyć pinów źródła
source: Cannot enumerate source pins
ta: மூல ஊசிகளை கணக்கிட முடியாது

# Nie można wyliczyć pinów renderera
source: Cannot enumerate renderer pins
ta: ரெண்டரர் ஊசிகளை கணக்கிட முடியாது

# Nie można wyliczyć pinów dsound
source: Cannot enumerate Direct Sound pins
ta: நேரடி ஒலி ஊசிகளை கணக்கிட முடியாது

# Nie można pobrać pinu renderera
source: Cannot get renderer pin
ta: ரெண்டரர் முள் பெற முடியாது

# Nie można pobrać pinu dsound
source: Cannot get dsound pin
ta: Dsound முள் பெற முடியாது

# Brak IMediaTypes
source: No IMediaTypes
ta: உடனடியாக

# Brak informacji o rodzaju ścieżki
source: No track type info
ta: ட்ராக் வகை செய்தி இல்லை

# Nie można połączyć pinu źródła z rendererem wideo
source: Cannot connect source pin to video renderer
ta: மூல முள் வீடியோ ரெண்டரருடன் இணைக்க முடியாது

# Nie można połączyć pinu źródła z rendererem audio
source: Cannot connect source pin to audio renderer
ta: மூல முள் ஆடியோ ரெண்டரருடன் இணைக்க முடியாது

# Nie można połączyć pinu źródła z rendererem audio1
source: Cannot connect source pin to audio1 renderer
ta: மூல முள் ஆடியோ 1 ரெண்டரருடன் இணைக்க முடியாது

# Nie można znaleźć połączonego pinu źródła
source: Cannot find connected source pin
ta: இணைக்கப்பட்ட மூல முள் கண்டுபிடிக்க முடியவில்லை

# Nie można pobrać informacji o pinie splittera
source: Cannot get splitter pin info
ta: ச்ப்ளிட்டர் முள் தகவலைப் பெற முடியாது

# Nie można wyliczyć pinów splittera
source: Cannot enumerate splitter pins
ta: ச்ப்ளிட்டர் ஊசிகளை கணக்கிட முடியாது

# Nie można połączyć pinu źródła z rendererem wideo2
source: Cannot connect source pin to video2 renderer
ta: மூல முள் வீடியோ 2 ரெண்டரருடன் இணைக்க முடியாது

# Nie można pobrać pinu źródła
source: Cannot get source pin
ta: மூல முள் பெற முடியாது

# Nie można stworzyć interfejsu filtrów
source: Cannot create filters interface
ta: வடிப்பான்கள் இடைமுகத்தை உருவாக்க முடியாது

# Nie można stworzyć kontrolera
source: Cannot create controller
ta: கட்டுப்படுத்தியை உருவாக்க முடியாது

# Nie można stworzyć interfejsu szukania
source: Cannot create search interface
ta: தேடல் இடைமுகத்தை உருவாக்க முடியாது

# Nie można stworzyć interfejsu audio
source: Cannot create audio interface
ta: ஆடியோ இடைமுகத்தை உருவாக்க முடியாது

# Nie można wyliczyć filtrów
source: Cannot enumerate filters
ta: வடிப்பான்களை கணக்கிட முடியாது

# Nie można pobrać nazwy filtra
source: Cannot get filter name
ta: வடிகட்டி பெயரைப் பெற முடியாது

# Nie można pobrać konfiguracji filtra
source: Cannot get filter configuration
ta: வடிகட்டி உள்ளமைவைப் பெற முடியாது

# Wyszukiwanie zakończone, rozpocząć od początku?
source: Reached end. Search from the beginning?
ta: முடிவடைந்தது. ஆரம்பத்தில் இருந்தே தேடவா?

# Nie znaleziono podanej frazy "
source: Couldn't find expression "
ta: வெளிப்பாட்டைக் கண்டுபிடிக்க முடியவில்லை "

# Zmieniono %i razy.
source: Replaced %i times.
ta: %i முறை மாற்றப்பட்டது.

# Szukaj Zamień
source: Search Replace
ta: மாற்றவும்

source: Do you want to replace in all subtitle files? After bad replacing backup files are in folder 'ReplaceBackup'
ta: அனைத்து வசனக் கோப்புகளிலும் மாற்ற விரும்புகிறீர்களா? மோசமான மாற்றிய பின் காப்புப்பிரதி கோப்புகள் 'மாற்றப்பட்ட பேக்அப்' கோப்புறையில் உள்ளன

# Ścieżka szukania jest nieprawidłowa
source: Seeking path is invalid
ta: பாதை தேடுவது தவறானது
