Repository: 247i/TACETr
Catalog: உரை/தானி/kainote-kainote-*.po
Languages: ta

# &Cofnij do
source: Undo to
ta: செயல்தவிர்க்கவும்

# &Ponów do
source: Redo to
ta: மீண்டும்

# Wybierz plik sesji
source: Choose session file
ta: அமர்வு கோப்பைத் தேர்வுசெய்க

# Plik sesji (*.kls),|*.kls
source: Session file (*.kls),|*.kls
ta: அமர்வு கோப்பு (*.kls), |*.kls

# Zapisz plik sesji
source: Save session file
ta: அமர்வு கோப்பைச் சேமிக்கவும்

# Skrót o nazwie '%s' nie należy do skrypru.
source: Hotkey "%s" it's not script hotkey.
ta: ஆட்ச்கி "%s" இது ச்கிரிப்ட் ஆட்ச்கி அல்ல.

# Okno Logów
source: Log window
ta: பதிவு சாளரம்

# Zastosuj
source: Apply
ta: இடு

# lub
source: or
ta: அல்லது

# Drugi skrót można ustawić Control + Klik
source: Second shortcut can be set using Control + Click
ta: கட்டுப்பாடு + சொடுக்கு பயன்படுத்தி இரண்டாவது குறுக்குவழியை அமைக்கலாம்

# Korekcja drobnych błędów
source: Multireplacer
ta: மல்டிர்ப்ளேசர்

# Edycja reguły
source: Rule edit
ta: விதி திருத்து

# Rozróżniaj wielkość znaków
source: Match case
ta: போட்டி வழக்கு

# Zmieniaj na tekst pisany małą literą
source: Change to lower case
ta: சிறிய வழக்குக்கு மாற்றவும்

# Zmieniaj na tekst pisany wielką literą
source: Change to upper case
ta: மேல் வழக்குக்கு மாற்றவும்

# Nie zmieniaj wielkości liter
source: Dont change case
ta: வழக்கை மாற்ற வேண்டாம்

# Zmieniaj tylko w tagach
source: Replace only in tags
ta: குறிச்சொற்களில் மட்டுமே மாற்றவும்

# Zmieniaj tylko w tekście
source: Replace only in text
ta: உரையில் மட்டுமே மாற்றவும்

# Szukana fraza (wyrażenia regularne)
source: Search phrase (regular expresions)
ta: தேடல் சொற்றொடர் (வழக்கமான வெளிப்பாடுகள்)

# Zmieniana fraza
source: Replace phrase
ta: சொற்றொடரை மாற்றவும்

# Opis reguły
source: Rule description
ta: விதி விளக்கம்

# Opis
source: Description
ta: விவரம்

# Reguła znajdź
source: Rule find
ta: விதி கண்டுபிடி

# Reguła zamień
source: Rule replace
ta: விதி மாற்றவும்

# Które linijki
source: Which lines
ta: எந்த கோடுகள்

# Od zaznaczonej linijki
source: From the selected line
ta: தேர்ந்தெடுக்கப்பட்ட வரியிலிருந்து

# Według wybranych stylów
source: According to the selected styles
ta: தேர்ந்தெடுக்கப்பட்ட பாணிகளின்படி

# Dodaj regułę
source: Add rule
ta: விதியைச் சேர்க்கவும்

# Edytuj regułę
source: Edit rule
ta: விதியைத் திருத்து

# Usuń regułę
source: Delete rule
ta: விதியை நீக்கு

# Znajdź błąd
source: Find
ta: கண்டுபிடி

# Znajdź błędy w bieżącej zakładce
source: Find in current tab
ta: தற்போதைய தாவலில் காணலாம்

# Znajdź błędy we wszystkich zakładkach
source: Find in all tabs
ta: எல்லா தாவல்களிலும் காண்க

# Zmień błąd
source: Replace
ta: மாற்றவும்

# Zamień wszystkie błędy w bieżącej zakładce
source: Replace all in current tab
ta: அனைத்தையும் தற்போதைய தாவலில் மாற்றவும்

# Zamień wszystkie błędy we wszystkich zakładkach
source: Replace in all tabs
ta: எல்லா தாவல்களிலும் மாற்றவும்

# Nie można zmieniać reguł, gdy okno wyników szukania jest otwarte
source: Cannot change rules when find results window is open
ta: விதிகளை மாற்ற முடியாது முடிவுகள் சாளரம் திறந்திருக்கும் போது

# Linia %i nie może być zamieniona, bo została zedytowana.
source: Line %i cannot be replaced, cause it was edited.
ta: வரி %என்னை மாற்ற முடியாது, காரணம் அது திருத்தப்பட்டது.

# Nie można zamienić "%s" na "%s", wykorzystując regułę "%s" w linii %i.
source: Cannot replace "%s" to "%s", with rule "%s" in line %i.
ta: "%s" ஐ "%s" ஆக மாற்ற முடியாது,%i இல் "%s" விதி.

# Usuwanie spacji przed przecinkiem bądź kropką
source: Remove space before comma or dot
ta: கமா அல்லது புள்ளிக்கு முன் இடத்தை அகற்று

# Usuwanie podwójnych spacji
source: Remove doubled spaces
ta: இரட்டை இடங்களை அகற்று

# Zmiana "...." i więcej na wielokropek
source: Replace more then three dots to suspension point
ta: மேலும் மூன்று புள்ளிகளை இடைநீக்க புள்ளிக்கு மாற்றவும்

# Zmiana ".." na wielokropek
source: Replace two dots to suspension point
ta: இரண்டு புள்ளிகளை இடைநீக்க புள்ளிக்கு மாற்றவும்

# Zmiana braku spacji po przecinku czy kropce
source: Replace missing spaces after dot or comma
ta: டாட் அல்லது கமாவுக்குப் பிறகு காணாமல் போன இடங்களை மாற்றவும்

# Usuwanie japońskich zwrotów grzecznościowych
source: Removing japanese suffixes
ta: சப்பானிய பின்னொட்டுகளை நீக்குதல்

# Zamiana "sie" na "się"
source: Fixing Polish "sie"
ta: போலிச் சரிசெய்தல் "நீங்கள்"

# Zamiana "nie możliwe" na "niemożliwe"
source: Fixing Polish "nie mozliwe"
ta: போலிச் சரிசெய்தல் "சாத்தியமற்றது"

# Zamiana "nie ważne" na "nieważne"
source: Fixing Polish "nie wazne"
ta: போலிசை சரிசெய்தல் "முக்கியமல்ல"

# Zamiana błędów wyrażenia "w ogóle"
source: Fixing Polish "w ogole"
ta: போலிசை சரிசெய்தல் "எல்லாவற்றிலும்"

# Zamiana błędów wyrazu "będę"
source: Fixing Polish "bede"
ta: போலிச் "பேட்" ஐ சரிசெய்தல்

# Reguła "%s" jest nieprawidłowa.
source: Rule "%s" is not valid.
ta: விதி "%s" செல்லுபடியாகாது.

# Wybór nazwy katalogu
source: Choose folder name
ta: கோப்புறை பெயரைத் தேர்வுசெய்க

# Podaj nazwę nowego katalogu
source: Enter a name for the new folder
ta: புதிய கோப்புறைக்கு ஒரு பெயரை உள்ளிடவும்

# Utwórz
source: Create
ta: உருவாக்கு

# Zapisz wszystko
source: Save all
ta: அனைத்தையும் சேமி

# Zamknij wszystkie zakładki
source: Close all tabs
ta: எல்லா தாவல்களையும் மூடு

# Otwórz folder zawierający napisy
source: Open subtitles containing folder
ta: கோப்புறை கொண்ட திறந்த வசன வரிகள்

# Otwórz folder zawierający wideo
source: Open video containing folder
ta: கோப்புறை கொண்ட வீடியோவைத் திறக்கவும்

# Otwórz folder zawierający audio
source: Open audio containing folder
ta: கோப்புறையைக் கொண்ட ஆடியோவைத் திறக்கவும்

# Otwórz folder zawierający klatki kluczowe
source: Open keyframes containing folder
ta: கோப்புறை கொண்ட கீஃப்ரேம்களைத் திறக்கவும்

# Wyświetl jedną zakładkę
source: Show one tab
ta: ஒரு தாவலைக் காட்டு

# Wyświetl dwie zakładki
source: Show two tabs
ta: இரண்டு தாவல்களைக் காட்டு

# Porównaj według czasów
source: Compare by times
ta: நேரங்களால் ஒப்பிடுக

# Porównaj według widocznych linijek
source: Compare by visible lines
ta: புலப்படும் வரிகளால் ஒப்பிடுக

# Porównaj według zaznaczeń
source: Compare by selections
ta: தேர்வுகள் மூலம் ஒப்பிடுக

# Porównaj według stylów
source: Compare by styles
ta: ச்டைல்களால் ஒப்பிடுக

# Porównaj według wybranych stylów
source: Compare by chosen styles
ta: தேர்ந்தெடுக்கப்பட்ட பாணிகளால் ஒப்பிடுக

# Porównaj
source: Compare
ta: ஒப்பிடுக

# Wyłącz porównanie
source: Turn off comparison
ta: ஒப்பீட்டை அணைக்கவும்

# Porównanie napisów
source: Subtitles comparison
ta: வசன வரிகள் ஒப்பீடு

# Zostaną zamknięte wszystkie zakładki, kontynuować?
source: All tabs will be closed, continue?
ta: எல்லா தாவல்களும் மூடப்படும், தொடருமா?

# Wideo:
source: Video:
ta: வீடியோ:

source: Audio:
ta: ஆடியோ:

# Klatki kluczowe:
source: Keyframes:
ta: கீஃப்ரேம்கள்:

# Skojarzone pliki:
source: Associated files:
ta: தொடர்புடைய கோப்புகள்:

# Wideo z folderu:
source: Video from directory:
ta: கோப்பகத்திலிருந்து வீடியோ:

# Wczytaj skojarzone
source: Load associated
ta: சுமை தொடர்புடையது

# Wczytaj z folderu
source: Load from directory
ta: கோப்பகத்திலிருந்து ஏற்றவும்

# Nieprawidłowy plik sesji
source: Session file is corrupt
ta: அமர்வு கோப்பு சிதைந்துள்ளது

# Nie można utworzyć pliku.
source: Cannot create file.
ta: கோப்பை உருவாக்க முடியாது.

# Nie można otworzyć pliku.
source: Cannot open file.
ta: கோப்பைத் திறக்க முடியாது.

# Nie można odczytać pliku.
source: Cannot read the file.
ta: கோப்பைப் படிக்க முடியாது.

# Plik nie został otwarty.
source: The file was not opened.
ta: கோப்பு திறக்கப்படவில்லை.

# Nie można zapisać do pliku.
source: Cannot save to file.
ta: கோப்பில் சேமிக்க முடியாது.

# Wczytywanie posortowanych napisów
source: Open sorted subtitles
ta: வரிசைப்படுத்தப்பட்ட வசன வரிகள்

# Włącz sprawdzanie pisowni
source: Turn spell checking
ta: எழுத்துப்பிழை சரிபார்ப்பைத் திருப்புங்கள்

# Zaznaczaj linijkę z czasem aktywnej linijki poprzedniej zakładki
source: Select the line with the time line of the previous active tab
ta: நேரக் கோட்டுடன் வரியைத் தேர்ந்தெடுக்கவும் முந்தைய செயலில் உள்ள தாவலின்

# Pokaż sugestie po dwukrotnym kliknięciu błędu
source: Show suggestions by double-clicking on misspell
ta: மிச்ச்பெல்லில் இருமுறை சொடுக்கு செய்வதன் மூலம் பரிந்துரைகளைக் காட்டுங்கள்

# Otwieraj napisy zawsze w nowej karcie
source: Always open subtitles in a new tab
ta: புதிய தாவலில் எப்போதும் வசன வரிகள் திறக்கவும்

# Nie przechodź do następnej linii przy edycji czasów
source: Stay on selected line when editing times
ta: நேரங்களைத் திருத்தும்போது தேர்ந்தெடுக்கப்பட்ட வரியில் இருங்கள்

# Wyłącz pokazywanie edycji na wideo (wymaga ponownego otwarcia zakładek)
source: Turn off edits preview on video (re-opening tab is required)
ta: வீடியோவில் திருத்தங்கள் முன்னோட்டத்தை அணைக்கவும் (மறு திறக்கும் தாவல் தேவை)

# Włącz szukanie widocznej linii po wyjściu z pełnego ekranu
source: Turn searching of visible line after switching from full screen
ta: புலப்படும் வரியைத் தேடுங்கள் முழுத் திரையில் இருந்து மாறிய பிறகு

# Włącz przenoszenie wartości pola przesuwania czasów
source: Synchronize time shifting window in all tabs
ta: எல்லா தாவல்களிலும் நேரத்தை மாற்றும் சாளரத்தை ஒத்திசைக்கவும்

# Zmieniaj aktywną linię przy zaznaczaniu
source: Change active line after add to selection
ta: தேர்வில் சேர்க்கப்பட்ட பிறகு செயலில் உள்ள வரியை மாற்றவும்

# Pokazuj oryginał w trybie tłumacza
source: Show original in translator mode
ta: மொழிபெயர்ப்பாளர் பயன்முறையில் அசல் காண்பி

# Ukryj oryginał na wideo w trybie tłumacza
source: Hide original on video in translator mode
ta: மொழிபெயர்ப்பாளர் பயன்முறையில் வீடியோவில் அசலை மறைக்கவும்

# Nie zmieniaj zaznaczeń przy duplikacji linii dialogowych
source: Don't change selection on dialogue lines duplication
ta: உரையாடல் கோடுகள் நகலெடுப்பில் தேர்வை மாற்ற வேண்டாம்

# Nie wypośrodkowuj aktywnej linii w polu napisów
source: Don't center vertically active line in subtitles grid
ta: வசன வரிகள் கட்டத்தில் செங்குத்தாக செயலில் உள்ள வரியை மையப்படுத்த வேண்டாம்

# Używaj skróty klawiszowe numpada w polach tekstowych
source: Use numpad shortcuts in text fields
ta: உரை புலங்களில் எண்பலகை குறுக்குவழிகளைப் பயன்படுத்தவும்

# Wyłącz ostrzeżenia w narzędziach edycji wizualnej
source: Turn off visual tools warning
ta: காட்சி கருவிகள் எச்சரிக்கையை அணைக்கவும்

# Nie ostrzegaj o niezgodności rozdzielczości
source: Don't inform about resolution incompatibility
ta: தீர்மானம் பொருந்தாத தன்மை பற்றி தெரிவிக்க வேண்டாம்

# Kompatybilność ze starymi skryptami Kainote
source: Compatibility with older Kainote scripts
ta: பழைய கைனோட் ச்கிரிப்டுகளுடன் பொருந்தக்கூடிய தன்மை

# Język (wymaga restartu programu)
source: Language (program restart required)
ta: மொழி (நிரல் மறுதொடக்கம் தேவை)

# Umieść pliki .dic i .aff do folderu "Dictionary"
source: Put files .dic and .aff to "Dictionary" folder
ta: கோப்புகளை வைக்கவும் .dic மற்றும் .aff "அகராதி" கோப்புறையில்

# Język sprawdzania pisowni (folder "Dictionary")
source: Spell checker language ("Dictionary" folder)
ta: எழுத்துப்பிழை செக்கர் மொழி ("அகராதி" கோப்புறை)

# Zero całkowicie wyłącza zapis przy edycji
source: 0 turns off saving while editing
ta: 0 திருத்துதல் செய்யும் போது சேமிப்பை முடக்குகிறது

# Liczbę plików autozapisu można ustawić od 2 do 1000000
source: Number of autosaves can be set from 2 to 1000000
ta: ஆட்டோசேவுகளின் எண்ணிக்கையை 2 முதல் 1000000 வரை அமைக்கலாம்

# Liczbę znaków widocznych na zakładce można ustawić od 20 do 150
source: Number of tab name characters. Range from 20 to 150
ta: தாவல் பெயர் எழுத்துகளின் எண்ணிக்கை. 20 முதல் 150 வரை

# Ilość edycji do zapisu
source: Number of edits to save
ta: சேமிக்க திருத்தங்களின் எண்ணிக்கை

# Maksymalna ilość plików autozapisu
source: Maximum number of autosave files
ta: ஆட்டோசேவ் கோப்புகளின் அதிகபட்ச எண்ணிக்கை

# Przyspieszenie klatki początkowej w ms:
source: Start frame offset in ms:
ta: எம்.எச்சில் பிரேம் ஆஃப்செட்டைத் தொடங்குங்கள்:

# Przyspieszenie klatki końcowej w ms:
source: End frame offset in ms:
ta: எம்.எச்சில் இறுதி பிரேம் ஆஃப்செட்:

# Znak podmiany tagów ASS:
source: ASS tag replacement:
ta: கழுதை குறிச்சொல் மாற்று:

# Ilość znaków widocznych na zakładce
source: Number of tab name characters
ta: தாவல் பெயர் எழுத்துகளின் எண்ணிக்கை

# Poziom śledzenia logów skryptów LUA
source: LUA scripts tracking level
ta: லுவா ச்கிரிப்டுகள் கண்காணிப்பு நிலை

# Czcionka pola napisów:
source: Subtitles grid font:
ta: வசன வரிகள் கட்டம் எழுத்துரு:

# Czcionka programu:
source: Program font:
ta: நிரல் எழுத்துரு:

# Sposób wczytywania skryptów autoload
source: Autoload loading method
ta: ஆட்டோலோட் ஏற்றுதல் முறை

# Przy starcie programu asynchronicznie
source: After program start asynchronously
ta: நிரல் ஒத்திசைவற்ற முறையில் தொடங்கிய பிறகு

# Przy starcie programu
source: After program start
ta: நிரல் தொடக்கத்திற்குப் பிறகு

# Przy otwarciu menu asynchronicznie
source: After open menu asynchronously
ta: திறந்த பட்டியல் ஒத்திசைவற்ற பிறகு

# Przy otwarciu menu
source: After open menu
ta: திறந்த மெனுவுக்குப் பிறகு

# Wybierz katalog
source: Choose catalog
ta: பட்டியலைத் தேர்வுசெய்க

# Wybierz styl
source: Choose style
ta: ச்டைலைத் தேர்வுசெய்க

# Wybierz FPS
source: Choose FPS
ta: FPS ஐத் தேர்வுசெய்க

# Czas w ms na jedną literę
source: Time for one letter in milliseconds
ta: மில்லி விநாடிகளில் ஒரு கடிதத்திற்கான நேரம்

# Tagi wstawiane na początku każdej linijki ass
source: Tags to paste at the beginning of every ASS line
ta: ஒவ்வொரு கழுதை வரியின் தொடக்கத்திலும் ஒட்ட வேண்டிய குறிச்சொற்கள்

# Rozdzielczość przy konwersji na ASS
source: Resolution when converting to ASS
ta: கழுதைக்கு மாற்றும்போது தீர்மானம்

# katalog dla stylu
source: catalog for style
ta: பாணிக்கான பட்டியல்

# styl
source: style
ta: சூல் தண்டு

# Wybrany %s konwersji nie istnieje, zostanie zmieniony na domyślny
source: Chosen %s for conversion doesn't exist, and will be changed to default
ta: மாற்றத்திற்காக தேர்ந்தெடுக்கப்பட்ட %s இல்லை, மற்றும் இயல்புநிலையாக மாற்றப்படும்

# FPS z wideo
source: FPS from video
ta: வீடியோவிலிருந்து FPS

# Nowe czasy końcowe
source: New end times
ta: புதிய இறுதி நேரங்கள்

# Pokaż okno przed konwersją
source: Show window before conversion
ta: மாற்றுவதற்கு முன் சாளரத்தைக் காட்டு

# Otwórz wideo z menu kontekstowego na pełnym ekranie
source: Open video from context menu on full screen
ta: முழு திரையில் சூழல் மெனுவிலிருந்து வீடியோவைத் திறக்கவும்

# Lewy przycisk myszy pauzuje wideo
source: Left mouse button pauses video
ta: இடது சுட்டி பொத்தான் வீடியோவை இடைநிறுத்துகிறது

# Otwieraj wideo z czasem aktywnej linii
source: Open video with time of active line
ta: செயலில் உள்ள நேரத்துடன் வீடியோவைத் திறக்கவும்

# Preferowane ścieżki audio (oddzielone średnikiem)
source: Preferred audio (separated by semicolons)
ta: விருப்பமான ஆடியோ (அரைக்காற்புள்ளிகளால் பிரிக்கப்படுகிறது)

# Sposób szukania wideo w FFMS2 (wymaga ponownego wczytania)
source: FFMS2 video seeking (require reload)
ta: FFMS2 வீடியோ தேடல் (மறுஏற்றம் தேவை)

# Filtr wyświetlania napisów
source: Subtitles filter
ta: வசன வரிகள் வடிகட்டி

# Liniowe
source: Linear
ta: நேரியல்

# Normalne
source: Normal
ta: சாதாரண

# Niebezpieczne (szybkie w każdym przypadku)
source: Unsafe (always fast)
ta: பாதுகாப்பற்ற (எப்போதும் வேகமாக)

# Agresywne (szybkie przy cofaniu)
source: Aggressive (fast in rewind)
ta: வன்கவர்வு (ரிவைண்டில் வேகமாக)

# Wybierz rodzaj filtrowania
source: Choose filtering
ta: வடிகட்டலைத் தேர்வுசெய்க

# Ustawione skróty
source: Set shortcuts
ta: குறுக்குவழிகளை அமைக்கவும்

# Skróty Globalne
source: Global shortcuts
ta: உலகளாவிய குறுக்குவழிகள்

# Skróty napisów
source: Subtitles shortcuts
ta: வசன வரிகள் குறுக்குவழிகள்

# Skróty edytora
source: Editor shortcuts
ta: ஆசிரியர் குறுக்குவழிகள்

# Skróty wideo
source: Video shortcuts
ta: வீடியோ குறுக்குவழிகள்

# Skróty audio
source: Audio Shortcuts
ta: ஆடியோ குறுக்குவழிகள்

# Rodzaj filtrowania:
source: Filtering mode:
ta: வடிகட்டுதல் பயன்முறை:

# Funkcja
source: Function
ta: சார்பு

# Przywróć skrót domyślny
source: Restore default hotkey
ta: இயல்புநிலை ஆட்ச்கியை மீட்டமைக்கவும்

# Wyświetlaj czas przy kursorze
source: Show time next to cursor
ta: கர்சருக்கு அடுத்து நேரத்தைக் காட்டு

# Wyświetlaj znaczniki sekund
source: Show seconds markers
ta: விநாடிகளின் குறிப்பான்களைக் காட்டு

# Wyświetlaj tło zaznaczenia
source: Show background selection
ta: பின்னணி தேர்வைக் காட்டு

# Wyświetlaj pozycję wideo
source: Show video position
ta: வீடியோ நிலையைக் காட்டு

# Wyświetlaj klatki kluczowe
source: Show keyframes
ta: கீஃப்ரேம்களைக் காட்டு

# Przewijaj wykres audio przy odtwarzaniu
source: Follow audio during playback
ta: பிளேபேக்கின் போது ஆடியோவைப் பின்தொடரவும்

# Aktywuj okno audio po najechaniu
source: Activate the audio when hover
ta: வட்டமிடும்போது ஆடியோவை செயல்படுத்தவும்

# Przyklejaj do klatek kluczowych
source: Snap to keyframe
ta: கீஃப்ரேமுக்கு ஒடி

# Przyklejaj do pozostałych linii
source: Snap to other lines
ta: மற்ற வரிகளுக்கு ஒடி

# Nie odtwarzaj audio po zmianie linijki
source: Don't play audio after change line
ta: மாற்ற வரிக்குப் பிறகு ஆடியோவை இயக்க வேண்டாம்

# Scalaj wszystkie "n" z poprzednią sylabą
source: Merge all the "n" with the previous syllable
ta: முந்தைய எழுத்துடன் அனைத்து "n" ஐ ஒன்றிணைக்கவும்

# Przenoś linie sylab po kliknięciu
source: Move syllable line after click
ta: சொடுக்கு செய்த பிறகு எழுத்து வரியை நகர்த்தவும்

# Wczytuj audio do pamięci RAM
source: Load audio into RAM
ta: ஆடியோவை ரேமில் ஏற்றவும்

# Przedział od 0 do 10000, gdzie 0 wyłącza całkowicie usuwanie plików audio cache.
source: Range from 0 to 10000, where 0 turns off removing audio cache files.
ta: 0 முதல் 10000 வரை இருக்கும், அங்கு 0 அணைக்கப்படும் ஆடியோ கேச் கோப்புகளை அகற்றுதல்.

# Przed i po aktywnej
source: Before and after the active
ta: செயலில் முன்னும் பின்னும்

# Wszystkie widoczne
source: All visible
ta: அனைத்தும் தெரியும்

# Opóźnienie audio w ms
source: Audio delay in milliseconds
ta: மில்லி விநாடிகளில் ஆடியோ நேரந்தவறுகை

# Czas odtwarzania audio przed i po znaczniku w ms
source: Audio to play before and after the marker in milliseconds
ta: மில்லி விநாடிகளில் மார்க்கருக்கு முன்னும் பின்னும் இயக்க ஆடியோ

# Wstęp
source: Lead-in
ta: முன்னணி

# Zakończenie
source: Lead-out
ta: லீட்-அவுட்

# Grubość linii znaczników
source: Line boundaries thickness
ta: வரி எல்லைகள் தடிமன்

# Limit plików audio cache
source: Audio cache files limit
ta: ஆடியோ கேச் கோப்புகள் வரம்பு

# Sposób wyświetlania nieaktywnych linijek
source: The way to display inactive lines
ta: செயலற்ற கோடுகளைக் காண்பிப்பதற்கான வழி

# Okno tło
source: Window background
ta: விண்டர் பின்னணி

# Okno nieaktywne tło
source: Inactive window background
ta: செயலற்ற சாளர பின்னணி

# Okno tekst
source: Window text
ta: சாளர உரை

# Okno nieaktywny tekst
source: Inactive window text
ta: செயலற்ற சாளர உரை

# Okno obramowanie
source: Window border
ta: சாளரம் எல்லை

# Okno obramowanie nieaktywne
source: Inactive window border
ta: செயலற்ற சாளர எல்லை

# Okno tło obramowania
source: Window border background
ta: சாளர எல்லை பின்னணி

# Okno tło obramowania nieaktywne
source: Inactive window border background
ta: செயலற்ற சாளர எல்லை பின்னணி

# Okno tekst nagłówka
source: Window header text
ta: சாளர தலைப்பு உரை

# Okno tekst nagłówka nieaktywny
source: Inactive window header text
ta: செயலற்ற சாளர தலைப்பு உரை

# Okno najechany element nagłówka
source: Window invaded element header
ta: சாளரம் படையெடுத்த உறுப்பு தலைப்பு

# Okno wciśnięty element nagłówka
source: Window pressed element header
ta: சாளரம் அழுத்தப்பட்ட உறுப்பு தலைப்பு

# Okno najechane zamykanie
source: Window closing upon hover
ta: ஓவர் மீது சாளர மூடல்

# Okno wciśnięte zamykanie
source: Window pressed closing
ta: சாளரம் மூடுவதை அழுத்தியது

# Okno elementy ostrzegające
source: Window elements warning
ta: சாளர கூறுகள் எச்சரிக்கை

# Napisy tekst
source: Subtitles text
ta: வசன வரிகள் உரை

# Napisy tło
source: Subtitles background
ta: வசன வரிகள் பின்னணி

# Napisy tło dialogów
source: Subtitles dialogue background
ta: வசன வரிகள் உரையாடல் பின்னணி

# Napisy tło komentarzy
source: Subtitles comment background
ta: வசன வரிகள் கருத்து பின்னணி

# Napisy zaznaczenia (przezroczystość)
source: Subtitles selections (transparency)
ta: வசனத் தேர்வுகள் (வெளிப்படைத்தன்மை)

# Napisy linijki widoczne na wideo
source: Subtitles lines visible on video
ta: வீடியோவில் காணக்கூடிய வசன வரிகள்

# Napisy kolidujące linie
source: Subtitles colliding lines
ta: வசன வரிகளை மோதுகிறது

# Napisy obramowanie linijki
source: Subtitles line boarder
ta: வசன வரிகள் வரி எல்லை

# Napisy obramowanie aktywnej linijki
source: Subtitles active line border
ta: வசன வரிகள் செயலில் வரி எல்லை

# Napisy nagłówek
source: Subtitles header background
ta: வசன வரிகள் தலைப்பு பின்னணி

# Napisy tekst nagłówka
source: Subtitles header text
ta: வசன வரிகள் தலைப்பு உரை

# Napisy etykieta
source: Subtitles line label
ta: வசன வரிகள் வரி சிட்டை

# Napisy etykieta zmodyfikowanej linii
source: Subtitles tag the modified line
ta: வசன வரிகள் மாற்றியமைக்கப்பட்ட வரியைக் குறிக்கின்றன

# Napisy etykieta zapisanej linii
source: Subtitles tag the saved line
ta: வசன வரிகள் சேமிக்கப்பட்ட வரியைக் குறிக்கின்றன

# Napisy etykieta niepewnej linii
source: Subtitles tag the not confirmed line
ta: வசன வரிகள் உறுதிப்படுத்தப்படாத வரியைக் குறிக்கின்றன

# Napisy tło błędów pisowni
source: Subtitles spelling error background
ta: வசன வரிகள் எழுத்துப்பிழை பிழை பின்னணி

# Napisy obramowanie porównania
source: Subtitles comparison border
ta: வசன வரிகள் ஒப்பீட்டு எல்லை

# Napisy tło porównania brak zgodności
source: Subtitles comparison background no match
ta: வசன வரிகள் ஒப்பீட்டு பின்னணி பொருந்தவில்லை

# Napisy tło porównania zgodność
source: Subtitles comparison background match
ta: வசன வரிகள் ஒப்பீட்டு பின்னணி போட்டி

# Napisy tło komentarza por. brak zgodności
source: Subtitles comp. comment background no match
ta: வசன வரிகள். கருத்து பின்னணி பொருந்தாது

# Napisy tło komentarza por. zgodność
source: Subtitles comp. comment background match
ta: வசன வரிகள். கருத்து பின்னணி போட்டி

# Edytor tekst
source: Editor text
ta: ஆசிரியர் உரை

# Edytor nazwy tagów
source: Editor tag names
ta: ஆசிரியர் குறிச்சொல் பெயர்கள்

# Edytor wartości tagów
source: Editor tag values
ta: எடிட்டர் குறிச்சொல் மதிப்புகள்

# Edytor nawiasy klamrowe
source: Editor curly braces
ta: ஆசிரியர் சுருள் பிரேச்கள்

# Edytor operatory tagów
source: Editor tags operators
ta: எடிட்டர் குறிச்சொற்கள் ஆபரேட்டர்கள்

# Edytor dzielenie linii i rysunki ASS
source: Editor line splitting and ASS drawings
ta: எடிட்டர் லைன் பிரித்தல் மற்றும் கழுதை வரைபடங்கள்

# Edytor zmienne template
source: Editor template variables
ta: எடிட்டர் வார்ப்புரு மாறிகள்

# Edytor znaczniki kodu template
source: Editor template code marks
ta: எடிட்டர் வார்ப்புரு குறியீடு மதிப்பெண்கள்

# Edytor funkcje template
source: Editor template functions
ta: எடிட்டர் வார்ப்புரு செயல்பாடுகள்

# Edytor słowa kluczowe template
source: Editor template keywords
ta: எடிட்டர் வார்ப்புரு முக்கிய வார்த்தைகள்

# Edytor ciągi znaków template
source: Editor template strings
ta: எடிட்டர் வார்ப்புரு சரங்கள்

# Edytor zaznaczenie znalezionej frazy
source: Editor found words selection
ta: ஆசிரியர் சொற்களைக் கண்டுபிடித்தார்

# Edytor tło nawiasów
source: Editor brackets background
ta: எடிட்டர் அடைப்புக்குறி பின்னணி

# Edytor tło
source: Editor background
ta: ஆசிரியர் பின்னணி

# Edytor zaznaczenie
source: Editor selection
ta: ஆசிரியர் தேர்வு

# Edytor zaznaczenie w nieaktywnym oknie
source: Editor inactive window selection
ta: எடிட்டர் செயலற்ற சாளர தேர்வு

# Edytor obramowanie
source: Editor border
ta: ஆசிரியர் எல்லை

# Edytor obramowanie aktywnego okna
source: Editor border on focus
ta: கவனம் செலுத்தும் ஆசிரியர் எல்லை

# Edytor błędy pisowni
source: Editor spelling error background
ta: ஆசிரியர் எழுத்துப்பிழை பிழை பின்னணி

# Audio tło
source: Audio background
ta: ஆடியோ பின்னணி

# Audio znacznik start
source: Audio start marker
ta: ஆடியோ ச்டார்ட் மார்க்கர்

# Audio znacznik koniec
source: Audio end marker
ta: ஆடியோ எண்ட் மார்க்கர்

# Audio znacznik przesuwania czasów
source: Audio time shift marker
ta: ஆடியோ டைம் சிப்ட் மார்க்கர்

# Audio znaczniki nieaktywnej linijki
source: Audio inactive line marker
ta: ஆடியோ செயலற்ற வரி மார்க்கர்

# Audio kursor
source: Audio cursor
ta: கர்சர் ஆடியோ
