Repository: 247i/TACETr
Catalog: உரை/தானி/kainote-kainote-*.po
Languages: ta

source: All of choosen styles not exist, and nothing will not be found. What to do?
ta: தேர்ந்தெடுக்கப்பட்ட பாணிகள் அனைத்தும் இல்லை, எதுவும் காணப்படாது. என்ன செய்வது?

# Wyczyść style
source: Remove styles
ta: பாணிகளை அகற்று

source: Styles named "%s" not exist in current subtitles, and it can reduce seeking results. What to do?
ta: தற்போதைய வசன வரிகள் இல்லை "%s" என்று பெயரிடப்பட்ட பாணிகள், மேலும் இது முடிவுகளைத் தேடுவதைக் குறைக்கலாம். என்ன செய்வது?

# Usuń nieistniejące style
source: Remove not existed styles
ta: இல்லாத பாணிகளை அகற்று

# Zabrakło pamięci RAM, usunięto część historii
source: Not enough RAM. History partially deleted
ta: போதுமான ரேம் இல்லை. வரலாறு ஓரளவு நீக்கப்பட்டது

# Nie udało się wczytać opcji. Działanie programu zostanie zakończone.
source: Cannot read settings. Program will be terminated.
ta: அமைப்புகளைப் படிக்க முடியாது. நிரல் நிறுத்தப்படும்.

# Nie udało się wczytać skrótów. Działanie programu zostanie zakończone.
source: Cannot read hotkeys. Program will be terminated.
ta: ஆட்கீசைப் படிக்க முடியாது. நிரல் நிறுத்தப்படும்.

# Wczytać poprzednią sesję?
source: Load last session?
ta: கடைசி அமர்வை ஏற்றவா?

source: Program crashed or was closed improperly, load last session with subtitles from auto save?
ta: நிரல் செயலிழக்கப்பட்டது அல்லது முறையற்ற முறையில் மூடப்பட்டது, ஆட்டோ சேமிப்பிலிருந்து வசன வரிகள் மூலம் கடைசி அமர்வை ஏற்றவா?

# Nowy
source: New
ta: புதிய

# Usuń wybrany katalog stylów
source: Delete chosen styles catalog
ta: தேர்ந்தெடுக்கப்பட்ட ச்டைல்கள் பட்டியலை நீக்கு

# Style katalogu:
source: Styles stored:
ta: ச்டைல்கள் சேமிக்கப்பட்டன:

# Sortuj
source: Sort
ta: வரிசைப்படுத்து

# Przesuń zaznaczone style na sam początek
source: Move selected styles to beginning
ta: தேர்ந்தெடுக்கப்பட்ட பாணிகளை தொடக்கத்திற்கு நகர்த்தவும்

# Przesuń zaznaczone style w górę
source: Move selected styles up
ta: தேர்ந்தெடுக்கப்பட்ட பாணிகளை நகர்த்தவும்

# Przesuń zaznaczone style w dół
source: Move selected styles down
ta: தேர்ந்தெடுக்கப்பட்ட பாணிகளை கீழே நகர்த்தவும்

# Przesuń zaznaczone style na sam koniec
source: Move selected styles to end
ta: தேர்ந்தெடுக்கப்பட்ட பாணிகளை முடிவுக்கு நகர்த்தவும்

# Dodaj do magazynu
source: Add to storage
ta: சேமிப்பகத்தில் சேர்க்கவும்

# Dodaj do ASS
source: Add to ASS
ta: கழுதையில் சேர்க்கவும்

# Dodaj do wszystkich otwartych ASS
source: Add to all opened ASS files
ta: திறந்த அனைத்து கழுதை கோப்புகளிலும் சேர்க்கவும்

# Style pliku ASS:
source: Styles in ASS file:
ta: கழுதை கோப்பில் பாணிகள்:

# Oczyść
source: Clear
ta: தெளிவான

# Odepnij okno edycji
source: Detach edition window
ta: பதிப்பு சாளரத்தைப் பிரிக்கவும்

# Styl o nazwie "%s" istnieje, podmienić go?
source: Style named "%s" already exists. Replace?
ta: "%s" என்று பெயரிடப்பட்ட பாணி ஏற்கனவே உள்ளது. மாற்றவா?

# Styl o nazwie "%s" jest już na liście.
source: Style named "%s" already exists.
ta: "%s" என்று பெயரிடப்பட்ட பாணி ஏற்கனவே உள்ளது.

# Nazwa stylu została zmieniona, czy chcesz zmienić ją także w napisach?
source: Style name modified. Do you want to change all instances to the new name?
ta: பாணி பெயர் மாற்றியமைக்கப்பட்டது. எல்லா நிகழ்வுகளையும் புதிய பெயருக்கு மாற்ற விரும்புகிறீர்களா?

# Wybierz plik ASS
source: Choose ASS file
ta: கழுதை கோப்பைத் தேர்வுசெய்க

# Pliki napisów ASS(*.ass)|*.ass
source: ASS subtitle files(*.ass)|*.ass
ta: கழுதை வசன கோப்புகள் (*. கழுதை) |*.ஆச்

# Kopia
source: Copy of
ta: நகல்

# Nowy Styl
source: New Style
ta: புதிய நடை

# Używane style: %s Usunięte style: %s
source: Styles used: %s Styles deleted: %s
ta: பயன்படுத்தப்பட்ட பாணிகள்: %s பாணிகள் நீக்கப்பட்டன: %s

# Status usuniętych stylów
source: Status of deleted styles
ta: நீக்கப்பட்ட பாணிகளின் நிலை

# Katalog stylów
source: Styles catalog
ta: ச்டைல்ச் பட்டியல்

# Nowy katalog stylów
source: New styles catalog
ta: புதிய பாணிகள் பட்டியல்

# Utwórz nowy styl magazynu
source: Create new style in storage
ta: சேமிப்பகத்தில் புதிய பாணியை உருவாக்கவும்

# Edytuj zaznaczony styl magazynu
source: Edit selected storage style
ta: தேர்ந்தெடுக்கப்பட்ட சேமிப்பக பாணியைத் திருத்தவும்

# Kopiuj styl magazynu
source: Copy the style in storage
ta: சேமிப்பகத்தில் பாணியை நகலெடுக்கவும்

# Wczytaj do magazynu styl z pliku ass
source: Load style from external ASS file to storage
ta: வெளிப்புற கழுதை கோப்பிலிருந்து சேமிப்பகத்திற்கு பாணியை ஏற்றவும்

# Usuń styl z magazynu
source: Delete style from storage
ta: சேமிப்பகத்திலிருந்து பாணியை நீக்கு

# Sortuj style w magazynie
source: Sort styles in storage
ta: சேமிப்பகத்தில் பாணிகளை வரிசைப்படுத்துங்கள்

# Utwórz nowy styl napisów
source: Create new ASS style
ta: புதிய கழுதை பாணியை உருவாக்கவும்

# Edytuj zaznaczony styl napisów
source: Edit selected ASS style
ta: தேர்ந்தெடுக்கப்பட்ட கழுதை பாணியைத் திருத்தவும்

# Kopiuj styl napisów
source: Copy style of ASS
ta: கழுதையின் நகல் பாணி

# Wczytaj do napisów styl z pliku ass
source: Load style from external ASS file
ta: வெளிப்புற கழுதை கோப்பிலிருந்து பாணியை ஏற்றவும்

# Usuń styl z napisów
source: Delete style from ASS
ta: கழுதையிலிருந்து பாணியை நீக்கு

# Sortuj style w napisach
source: Sort styles in ASS
ta: கழுதையில் பாணிகளை வரிசைப்படுத்துங்கள்

# Dodaj do magazynu styl z napisów
source: Copy style from ASS to storage
ta: கழுதையிலிருந்து சேமிப்பகத்திற்கு பாணியை நகலெடுக்கவும்

# Dodaj do napisów styl z magazynu
source: Copy style from storage to ASS
ta: சேமிப்பகத்திலிருந்து கழுதைக்கு பாணியை நகலெடுக்கவும்

# Oczyść napisy z nieużywanych stylów
source: Delete unused ASS styles
ta: பயன்படுத்தப்படாத கழுதை பாணிகளை நீக்கு
