Repository: 247i/TACETr
Catalog: உரை/தானி/kainote-kainote-*.po
Languages: ta

# Ignoruj wszystko
source: Ignore All
ta: அனைத்தையும் புறக்கணிக்கவும்

# Dodaj do słownika
source: Add to dictionary
ta: அகராதியில் சேர்க்கவும்

# Usuń ze słownika
source: Remove from dictionary
ta: அகராதியிலிருந்து அகற்று

# Usuwa ze słownika słowa dodane przez użytkownika.
source: Remove from dictionary words added by user.
ta: பயனரால் சேர்க்கப்பட்ட அகராதி சொற்களிலிருந்து அகற்று.

# Nie znaleziono więcej błędów pisowni
source: No spelling errors were found
ta: எழுத்துப்பிழை பிழைகள் எதுவும் காணப்படவில்லை

# Słowa dodane do słownika
source: Words added to dictionary
ta: அகராதியில் சேர்க்கப்பட்ட வார்த்தைகள்

# Edycja Stylu
source: Style edition
ta: பதிப்பு நடை

# Nazwa stylu:
source: Style name:
ta: பாணி பெயர்:

# Czcionka i rozmiar:
source: Font and size:
ta: எழுத்துரு மற்றும் அளவு:

# Umorzliwia zarządzanie katalogami czcionek
source: Manage font catalogs
ta: எழுத்துரு பட்டியல்களை நிர்வகிக்கவும்

# Kolory i przezroczystość:
source: Colors and transparency:
ta: வண்ணங்கள் மற்றும் வெளிப்படைத்தன்மை:

# Pierwszy
source: First
ta: முதல்

# Drugi
source: Second
ta: இரண்டாவது

# Obwódka
source: Border
ta: எல்லை

# Cień
source: Shadow
ta: நிழல்

# Obwódka:
source: Border:
ta: எல்லை:

# Cień:
source: Shadow:
ta: நிழல்:

# Skala X:
source: Scale X:
ta: அளவிலான எக்ச்:

# Skala Y:
source: Scale Y:
ta: Y: y:

# Kąt:
source: Angle:
ta: கோணம்:

# Odstępy:
source: Spacing:
ta: இடைவெளி:

# Typ obwódki:
source: Border type:
ta: எல்லை வகை:

# Prost. obw.
source: Opaque box
ta: ஒளிபுகா பெட்டி

# Margines lewy:
source: Left margin:
ta: இடது விளிம்பு:

# Prawy:
source: Right:
ta: வலது:

# Pionowy:
source: Vertical:
ta: செங்குத்து:

# Położenie tekstu:
source: Alignment:
ta: சீரமைப்பு:

source: 0 - ANSI
ta: 0 - அன்சி

# 1 - Domyślny
source: 1 - Default
ta: 1 - இயல்புநிலை

source: 2 - Symbol
ta: 2 - அடையாளம்

source: 77 - Mac
ta: 77 - மேக்

# 128 - Japoński
source: 128 - Japanese
ta: 128 - சப்பானிய

# 129 - Koreański
source: 129 - Hangul
ta: 129 - அங்குல்

source: 130 - Johab
ta: 130 - இஆப்

# 134 - Chiński GB2312
source: 134 - Chinese GB2312
ta: 134 - சீன சிபி 2312

# 135 - Chiński BIG5
source: 135 - Chinese BIG5
ta: 135 - சீன பிக் 5

# 161 - Grecki
source: 161 - Greek
ta: 161 - கிரேக்கம்

# 162 - Turecki
source: 162 - Turkish
ta: 162 - துருக்கிய

# 163 - Wietnamski
source: 163 - Vietnamese
ta: 163 - வியட்நாமிய

# 177 - Hebrajski
source: 177 - Hebrew
ta: 177 - எபிரேய

# 178 - Arabski
source: 178 - Arabic
ta: 178 - அரபு

# 186 - Języki Bałtyckie
source: 186 - Baltic
ta: 186 - பால்டிக்

# 204 - Rosyjski
source: 204 - Russian
ta: 204 - ரச்ய

# 222 - Tajski
source: 222 - Thai
ta: 222 - தாய்

# 238 - Europa Środkowa (Polski)
source: 238 - Central European (Polish)
ta: 238 - நடு ஐரோப்பிய (போலந்து)

source: 255 - OEM
ta: 255 - ஒஇஎம்

# Kodowanie tekstu:
source: Text encoding:
ta: உரை குறியாக்கம்:

# Podgląd stylu:
source: Style preview:
ta: பாணி ​​முன்னோட்டம்:

# Zmienić wszystkie zaznaczone style?
source: Change all selected styles?
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து பாணிகளையும் மாற்றவா?

# Nazwa stylu
source: Style name
ta: பாணி பெயர்

# Rozmiar czcionki
source: Font size
ta: எழுத்துரு அளவு

# Przezroczystość koloru podstawowego, 0 - brak, 255 - przezroczystość
source: First color transparency, 0 - none, 255 - transparent
ta: முதல் வண்ண வெளிப்படைத்தன்மை, 0 - எதுவுமில்லை, 255 - வெளிப்படையானது

# Przezroczystość koloru zastępczego, 0 - brak, 255 - przezroczystość
source: Second color transparency, 0 - none, 255 - transparent
ta: இரண்டாவது வண்ண வெளிப்படைத்தன்மை, 0 - எதுவுமில்லை, 255 - வெளிப்படையானது

# Przezroczystość koloru obwódki, 0 - brak, 255 - przezroczystość
source: Border transparency, 0 - none, 255 - transparent
ta: எல்லை வெளிப்படைத்தன்மை, 0 - எதுவுமில்லை, 255 - வெளிப்படையானது

# Przezroczystość koloru cienia, 0 - brak, 255 - przezroczystość
source: Shadow transparency, 0 - none, 255 - transparent
ta: நிழல் வெளிப்படைத்தன்மை, 0 - எதுவுமில்லை, 255 - வெளிப்படையானது

# Obwódka w pikselach
source: Border size in pixels
ta: பிக்சல்களில் எல்லை அளவு

# Cień w pikselach
source: Shadow size in pixels
ta: பிக்சல்களில் நிழல் அளவு

# Skala X w procentach
source: Scale X in %
ta: ஃச் அளவிலான ஃச்

# Skala Y w procentach
source: Scale Y in %
ta: % இல் ஒய் அளவு

# Kąt w stopniach
source: Rotation in degrees
ta: டிகிரிகளில் சுழற்சி

# Odstępy między literami w pikselach (wartości ujemne dozwolone)
source: Spacing in pixels (negative values permitted)
ta: பிக்சல்களில் இடைவெளி (எதிர்மறை மதிப்புகள் அனுமதிக்கப்பட்டன)

# Prostokątna obwódka
source: Rectangular border
ta: செவ்வக எல்லை

# Margines prawy
source: Right margin
ta: வலது விளிம்பு

# Margines lewy
source: Left margin
ta: இடது விளிம்பு

# Margines górny i dolny
source: Vertical margin
ta: செங்குத்து விளிம்பு

# Lewy dolny róg
source: Bottom left
ta: கீழே இடது

# Wyśrodkowane na dole
source: Bottom center
ta: கீழே நடுவண்

# Prawy dolny róg
source: Bottom right
ta: கீழே வலது

# Wyśrodkowane po lewej
source: Center left
ta: நடுவண் இடது

# Wyśrodkowane
source: Center
ta: நடுவண்

# Wyśrodkowane po prawej
source: Center right
ta: நடுவண் சரியானது

# Lewy górny róg
source: Top left
ta: மேல் இடது

# Wyśrodkowane u góry
source: Top center
ta: மேல் நடுவண்

# Prawy górny róg
source: Top right
ta: மேல் வலது

# Kodowanie tekstu
source: Text encoding
ta: உரை குறியாக்கம்

# Wybór stylów
source: Choose columns
ta: நெடுவரிசைகளைத் தேர்வுசெய்க

# Wybór kolumn
source: Choose columns
ta: நெடுவரிசைகளைத் தேர்வுசெய்க

# Wybierz style
source: Choose styles
ta: பாணிகளைத் தேர்வுசெய்க

# Wybierz kolumny
source: Choose columns
ta: நெடுவரிசைகளைத் தேர்வுசெய்க

# Ustaw
source: Set
ta: கணம்

source: element
ta: தனிமம்

# elementy
source: elements
ta: கூறுகள்

# elementów
source: elements
ta: கூறுகள்

# Otwarcie napisów
source: Subtitles opening
ta: வசன வரிகள் திறப்பு

# Nowe napisy
source: New subtitles
ta: புதிய வசன வரிகள்

# Edycja linii
source: Line edition
ta: வரி பதிப்பு

# Edycja wielu linii
source: Multiline edition
ta: மல்டிலைன் பதிப்பு

# Poprawa błędu pisowni w polu tekstowym
source: Correcting spell errors in text field
ta: உரை புலத்தில் எழுத்துப்பிழை பிழைகளை சரிசெய்தல்

# Powielenie linijek
source: Duplicating lines
ta: நகல் கோடுகள்

# Połączenie linijek
source: Joining lines
ta: கோடுகள் சேரும்

# Połączenie linijki z poprzednią
source: Joining line with previous
ta: முந்தையவற்றுடன் இணைகிறது

# Połączenie linijki z następną
source: Joining line with next
ta: அடுத்ததாக வரிசையில் சேருதல்

# Połączenie linijek pozostawienie pierwszej
source: Joining lines and keep first
ta: வரிகளில் சேரவும் முதலில் வைத்திருங்கள்

# Połączenie linijek pozostawienie ostatniej
source: Joining lines and keep last
ta: கோடுகளில் சேரவும், கடைசியாக வைத்திருங்கள்

# Wklejenie linijek
source: Pasting lines
ta: ஒட்டுதல் கோடுகள்

# Wklejenie kolumn
source: Pasting columns
ta: ஒட்டுதல் நெடுவரிசைகள்

# Wklejenie tłumaczenia
source: Pasting translation
ta: ஒட்டுதல் மொழிபெயர்ப்பு

# Przesunięcie tekstu tłumaczenia
source: Moving translation text
ta: நகரும் மொழிபெயர்ப்பு உரை

# Ustawienie czasów linii jako ciągłych
source: Setting times as continues
ta: தொடர்ச்சியான நேரங்களை அமைத்தல்

# Ustawienie FPSu obliczonego z wideo
source: Setting FPS from video
ta: வீடியோவிலிருந்து FPS ஐ அமைத்தல்

# Ustawienie własnego FPSu
source: Setting custom FPS
ta: தனிப்பயன் FPS ஐ அமைத்தல்

# Zamiana linijek
source: Swapping lines
ta: கோடுகளை மாற்றுதல்

# Konwersja napisów
source: Subtitles conversion
ta: வசன வரிகள்

# Sortowanie napisów
source: Sorting subtitles
ta: வசன வரிகள் வரிசைப்படுத்துதல்

# Usunięcie linijek
source: Deleting lines
ta: கோடுகளை நீக்குதல்

# Usunięcie tekstu
source: Deleting text
ta: உரையை நீக்குதல்

# Ustawienie czasu początkowego
source: Setting start time
ta: தொடக்க நேரத்தை அமைத்தல்

# Ustawienie czasu końcowego
source: Setting end time
ta: இறுதி நேரத்தை அமைத்தல்

# Włączenie trybu tłumacza
source: Turn on translator mode
ta: மொழிபெயர்ப்பாளர் பயன்முறையை இயக்கவும்

# Wyłączenie trybu tłumacza
source: Turn off translator mode
ta: மொழிபெயர்ப்பாளர் பயன்முறையை அணைக்கவும்

# Dodanie nowej linii
source: Adding new line
ta: புதிய வரியைச் சேர்ப்பது

# Wstawienie linii
source: Inserting line
ta: வரி செருகும்

# Zmiana czasu na wykresie audio
source: Changing time on audio spectrum
ta: ஆடியோ ச்பெக்ட்ரமில் நேரத்தை மாற்றுதல்

# Przyklejenie do klatki kluczowej
source: Snapping to keyframe
ta: கீஃப்ரேமுக்கு ச்னாப்பிங்

# Zmiana nagłówku napisów
source: Changing subtitles properties
ta: வசன வரிகள் பண்புகளை மாற்றுதல்

# Akcja zaznacz linijki
source: Select lines action
ta: கோடுகள் செயல் என்பதைத் தேர்ந்தெடுக்கவும்

# Przesunięcie czasów
source: Shifting times
ta: மாற்றும் நேரங்கள்

# Poprawa błędu pisowni
source: Correcting spell errors
ta: எழுத்துப்பிழை பிழைகளை சரிசெய்தல்

# Edycja stylów
source: Style edition
ta: பதிப்பு நடை

# Zmiana rozdzielczości napisów
source: Changing subtitles resolution
ta: வசனத் தீர்மானத்தை மாற்றுதல்

# Narzędzie pozycjonowania
source: Visual tool positioning
ta: காட்சி கருவி பொருத்துதல்

# Narzędzie ruchu
source: Visual tool moving
ta: காட்சி கருவி நகரும்

# Narzędzie skalowania
source: Visual tool scaling
ta: காட்சி கருவி அளவிடுதல்

# Narzędzie obrotów w osi Z
source: Visual tool axis Z rotation
ta: காட்சி கருவி அச்சு சட் சுழற்சி

# Narzędzie obrotów w osiach X i Y
source: Visual tool axis X and Y rotation
ta: காட்சி கருவி அச்சு ஃச் மற்றும் ஒய் சுழற்சி

# Narzędzie wycinków prostokątnych
source: Visual tool rectangle clipping
ta: காட்சி கருவி செவ்வகம் கிளிப்பிங்

# Narzędzie wycinków wektorowych
source: Visual tool vector clipping
ta: காட்சி கருவி திசையன் கிளிப்பிங்

# Narzędzie rysunków wektorowych
source: Visual tool vector drawing
ta: காட்சி கருவி திசையன் வரைதல்

# Narzędzie zmieniacz pozycji
source: Visual tool position shifting
ta: காட்சி கருவி நிலை மாற்றும்

# Narzędzie zmieniacz skali i obrotów
source: Visual tool scale and rotation shift
ta: காட்சி கருவி அளவு மற்றும் சுழற்சி மாற்றம்

# Narzędzie hydra
source: Visual tool hydra
ta: காட்சி கருவி ஐட்ரா

# Poprawa drobnych błędów
source: Multireplacer
ta: மல்டிர்ப்ளேசர்

# Wstawienie drzewka
source: Adding tree
ta: மரத்தைச் சேர்ப்பது

# Ustawienie opisu
source: Adding tree description
ta: மர விளக்கத்தை சேர்க்கிறது

# Dodanie linii do drzewka
source: Adding line to tree
ta: மரத்திற்கு வரி சேர்க்கிறது

# Usunięcie drzewka
source: Remove tree
ta: மரத்தை அகற்றவும்

# Skrypt automatyzacji
source: Automation script
ta: ஆட்டோமேசன் ச்கிரிப்ட்

# , aktywna linia %i
source: , active line %i
ta: , செயலில் வரி %i

# Ukryj łamania linii
source: Hide line wraps
ta: வரி மறைப்புகளை மறைக்கவும்

# Nie obejmuje zaznaczonych linii
source: Don't take into account selected lines
ta: தேர்ந்தெடுக்கப்பட்ட வரிகளை கணக்கில் எடுத்துக்கொள்ள வேண்டாம்

# Wstaw &przed
source: Insert before
ta: முன் செருகவும்

# Wstaw p&o
source: Insert after
ta: பின்னர் செருகவும்

# Wstaw przed z &czasem wideo
source: Insert before with &video time
ta: & வீடியோ நேரத்துடன் முன் செருகவும்

# Wstaw po z c&zasem wideo
source: Insert &after with video time
ta: வீடியோ நேரத்துடன் செருகவும்

# &Duplikuj linie
source: &Duplicate lines
ta: & நகல் கோடுகள்

# Za&mień
source: Swap
ta: இடமாற்றம்

# Złącz &linijki
source: Join lines
ta: வரிகளில் சேரவும்

# Kopiuj Ctrl-C
source: Copy Ctrl-C
ta: Ctrl-C ஐ நகலெடுக்கவும்

# Wytnij Ctrl-X
source: Cut Ctrl-X
ta: Ctrl-X ஐ வெட்டுங்கள்

# Wklej Ctrl-V
source: Paste Ctrl-V
ta: Ctrl-V ஐ ஒட்டவும்

# Ukryj kolumny
source: Hide columns
ta: நெடுவரிசைகளை மறைக்கவும்

# Filtrowanie
source: Filter
ta: வடிப்பி

# Wczytaj napisy z pliku MKV / OGM
source: Load subtitles of MKV / OGM file
ta: MKV / OGM கோப்பின் வசன வரிகள் ஏற்றவும்

# Dodaj linie
source: Add lines
ta: கோடுகளைச் சேர்க்கவும்

# Kopiuj drzewko
source: Copy tree
ta: மரத்தை நகலெடுக்கவும்

# Zmień opis
source: Change description
ta: விளக்கத்தை மாற்றவும்

# Zaznacz linie drzewka
source: Select tree lines
ta: மரக் கோடுகளைத் தேர்ந்தெடுக்கவும்

# Margines pionowy
source: Vertical margin
ta: செங்குத்து விளிம்பு

# Tekst do oryginału
source: Text into original
ta: அசலில் உரை

# Tekst do tłumaczenia
source: Text into translation
ta: மொழிபெயர்ப்பில் உரை

# Tekst bez tagów
source: Text without tags
ta: குறிச்சொற்கள் இல்லாமல் உரை

# Pliki napisów (*.ass),(*.srt),(*.sub),(*.txt)|*.ass;*.srt;*.sub;*.txt
source: Subtitle files (*.ass),(*.srt),(*.sub),(*.txt)|*.ass;*.srt;*.sub;*.txt
ta: வசன கோப்புகள் (*.ஆச்), (*. எச்.ஆர்.டி), (*. துணை), (*

# Zapisać plik przed wczytaniem napisów z MKV?
source: Save the file before loading the subtitles of MKV?
ta: MKV இன் வசன வரிகள் ஏற்றுவதற்கு முன் கோப்பைச் சேமிக்கவா?

# Otwieranie napisów nie powiodło się
source: Cannot open subtitles
ta: வசன வரிகள் திறக்க முடியாது

# W linii %i nie można przeskalować wartości '%s' w tagu '%s'
source: In line %i can't scale '%s' in tag '%s'
ta: வரி%வரிசையில் '%s' என்ற குறிச்சொல்லில் '%s' அளவிட முடியாது

# Wyłącz potwierdzenie
source: Turn-off warning
ta: எச்சரிக்கை

# Nieprawidłowy FPS. Popraw opcje i spróbuj ponownie.
source: Invalid FPS. Correct it in options and try again.
ta: தவறான எஃப்.பி.எச். அதை விருப்பங்களில் சரிசெய்து மீண்டும் முயற்சிக்கவும்.

# Wideo nie zostało wczytane przez FFMS2
source: Video wasn't loaded using FFMS2
ta: FFMS2 ஐப் பயன்படுத்தி வீடியோ ஏற்றப்படவில்லை

# Nie wybrano stylów do przesunięcia
source: Do not choose styles to shift time with
ta: நேரத்தை மாற்ற பாணிகளைத் தேர்வு செய்ய வேண்டாம்

# Czy naprawdę chcesz przesuwać tylko czasy %s?
source: Do you really want to shift only %s times?
ta: நீங்கள் உண்மையில் %s முறை மட்டுமே மாற்ற விரும்புகிறீர்களா?

# początkowe
source: start
ta: தொடங்கு

# końcowe
source: end
ta: முடிவு

# Nie zaznaczono linii do przesunięcia
source: No lines selected for shifting
ta: மாற்றுவதற்கு எந்த வரிகளும் தேர்ந்தெடுக்கப்படவில்லை

source: Are you sure you want to turn off translation mode? Foreign language text will be deleted.
ta: மொழிபெயர்ப்பு பயன்முறையை அணைக்க விரும்புகிறீர்களா? வெளிநாட்டு மொழி உரை நீக்கப்படும்.

# Wybierz nowy FPS
source: Choose new FPS
ta: புதிய FPS ஐத் தேர்வுசெய்க

# FPS napisów
source: Subtitles FPS
ta: வசன வரிகள் FPS

# Nowy FPS napisów
source: New FPS
ta: புதிய எஃப்.பி.எச்

# Zmień FPS
source: Change FPS
ta: FPS ஐ மாற்றவும்

# Niewłaściwy fps
source: Incorrect FPS
ta: தவறான FPS

# Opis drzewka
source: Tree description
ta: மர விளக்கம்

# Ustaw nazwę drzewka
source: Set tree name
ta: மரத்தின் பெயரை அமைக்கவும்

# Zmień nazwę drzewka
source: Change tree name
ta: மரத்தின் பெயரை மாற்றவும்

# W.
source: L.
ta: எல்.

source: Start
ta: தொடங்கு

# M.L.
source: Left
ta: இடது

# M.P.
source: Right
ta: வலது

# M.Pi.
source: Vert.
ta: வெர்ட்.

# ZNS
source: CPS
ta: சிபிஎச்

# Łamania
source: Wraps
ta: மறைப்புகள்

# Tekst oryginalny
source: Original text
ta: அசல் உரை

# Tekst tłumaczenia
source: Translation
ta: மொழிபெயர்ப்பு

# Nie można wyświetlić podglądu, ponieważ wielkość okna napisów jest zbyt mała
source: Cannot show preview cause grid height is too low
ta: முன்னோட்டக் காரணம் கட்டம் உயரம் மிகக் குறைவாக இருப்பதைக் காட்ட முடியாது

# Ten plik napisów jest zwykłym tekstem, zostaje otwarty jako napisy ASS
source: This subtitles file is plain text, was opened as ASS subtitles
ta: இந்த வசன வரிகள் எளிய உரை, கழுதை வசனங்களாக திறக்கப்பட்டது

# Niepoprawny format (plik uszkodzony lub zawiera błędy)
source: Invalid format (file may be corrupted or contain errors)
ta: தவறான வடிவம் (கோப்பு சிதைக்கப்படலாம் அல்லது பிழைகள் இருக்கலாம்)

# Zmień rozdzielczość
source: Change resolution
ta: தீர்மானத்தை மாற்றவும்

# Rozdzielczość docelowa
source: Target resolution
ta: இலக்கு தீர்மானம்

# Pobierz z napisów
source: From subtitles
ta: வசனங்களிலிருந்து

# Pobierz z wideo
source: From video
ta: வீடியோவிலிருந்து

# Nie rozciągaj
source: No stretch
ta: நீட்டிக்க இல்லை

# Rozciągaj
source: Stretch
ta: நீட்டிக்க

# Opcje skalowania
source: Resample options
ta: மறுசீரமைப்பு விருப்பங்கள்

# Niezgodna rozdzielczość
source: Incompatible resolution
ta: பொருந்தாத தீர்மானம்

source: Subtitles and video resolution is different. You can change them now or use subtitles resample. Video resolution: %i x %i Subtitles resolution: %i x %i Match resolution to video?
ta: வசன வரிகள் மற்றும் வீடியோ தெளிவுத்திறன் வேறுபட்டது. நீங்கள் இப்போது அவற்றை மாற்றலாம் அல்லது வசன வரிகள் மறுசீரமைப்பைப் பயன்படுத்தலாம். வீடியோ தீர்மானம்: %i ஃச் %i வசனத் தீர்மானம்: %i ஃச் %i வீடியோவுடன் தெளிவுத்திறனை பொருத்தவா?

# Zmień wyłącznie rozdzielczość napisów
source: Change only subtitles resolution
ta: வசனத் தீர்மானத்தை மட்டுமே மாற்றவும்

# Dopasuj skrypt napisów do rozdzielczości wideo (Nie rozciągaj)
source: Resample subtitles (no stretch)
ta: மறுவிற்பனை வசன வரிகள் (நீட்டிப்பு இல்லை)

# Dopasuj skrypt napisów do rozdzielczości wideo (Rozciągnij)
source: Resample subtitles (stretch)
ta: மறுவிற்பனை வசன வரிகள் (நீட்சி)

# Zmień
source: Change
ta: மாற்றம்

# Nie zmieniaj
source: Don't change
ta: மாற்ற வேண்டாம்

# Wyłącz ostrzeżenie
source: Turn-off warning
ta: எச்சரிக்கை

# Libass działa tylko z FFMS2
source: Libass works only with FFMS2
ta: லிபாச் FFMS2 உடன் மட்டுமே வேலை செய்கிறது

# Libass otwiera tylko napisy ASS i SSA
source: Libass only opens subtitles ASS and SSA
ta: லிபாச் ஆச் மற்றும் எச்எச்ஏ வசன வரிகள் மட்டுமே திறக்கிறது

# Nie można otworzyć napisów w Libass
source: Cannot open subtitles in Libass
ta: லிபாசில் வசன வரிகள் திறக்க முடியாது

# Nie można zinicjalizować CSRI.
source: Cannot initialize CSRI.
ta: சி.எச்.ஆர்.ஐ.

# Nie można utworzyć instancji CSRI.
source: Cannot create CSRI instance.
ta: சி.எச்.ஆர்.ஐ உதாரணத்தை உருவாக்க முடியாது.

# CSRI nie obsługuje tego formatu.
source: CSRI doesn't support this format.
ta: சி.எச்.ஆர்.ஐ இந்த வடிவமைப்பை ஆதரிக்கவில்லை.

# Opcje dopasowywania tłumaczenia
source: Matching lines options
ta: பொருந்தும் கோடுகள் விருப்பங்கள்

# Usuń linię
source: Delete line
ta: வரியை நீக்கு

# Usuwa zaznaczoną linijkę. Tłumaczenie idzie do góry.
source: Deletes selected line. Moves translation one line up.
ta: தேர்ந்தெடுக்கப்பட்ட வரியை நீக்குகிறது. மொழிபெயர்ப்பு ஒரு வரிசையை நகர்த்துகிறது.

# Dodaj linię
source: Add line
ta: வரி சேர்க்கவும்

# Dodaje pustą linijkę przed zaznaczoną. Tłumaczenie idzie w dół.
source: Adds a blank line. Moves translation one line down.
ta: ஒரு வெற்று வரியை சேர்க்கிறது. மொழிபெயர்ப்பை ஒரு வரி கீழே நகர்த்துகிறது.

# Złącz linie
source: Join lines
ta: வரிகளில் சேரவும்

# Złącza następną linijkę z zaznaczoną. Tłumaczenie idzie do góry.
source: Join selected line with next line. Moves translation one line up.
ta: அடுத்த வரியுடன் தேர்ந்தெடுக்கப்பட்ட வரியில் சேரவும். மொழிபெயர்ப்பு ஒரு வரிசையை நகர்த்துகிறது.

# Złącza następną linijkę z zaznaczoną. Oryginał idzie w górę.
source: Join selected line with next line. Moves original one line up.
ta: அடுத்த வரியுடன் தேர்ந்தெடுக்கப்பட்ட வரியில் சேரவும். அசல் ஒரு வரியை நகர்த்துகிறது.

# Usuwa zaznaczoną linijkę. Oryginał idzie do góry.
source: Deletes selected line. Moves original one line up.
ta: தேர்ந்தெடுக்கப்பட்ட வரியை நீக்குகிறது. அசல் ஒரு வரியை நகர்த்துகிறது.

source: Adds a blank line. Moves original one line down. Added line should be timed.
ta: ஒரு வெற்று வரியை சேர்க்கிறது. அசல் ஒரு வரியை கீழே நகர்த்துகிறது. சேர்க்கப்பட்ட வரி நேரம் ஒதுக்கப்பட வேண்டும்.

# Tekst oryginału
source: Original
ta: அசல்

source: Description: original - subtitles with right timing, you can see it to compare lines, it will be deleted translation - subtitles you paste into the right timing.
ta: விளக்கம்: அசல் - சரியான நேரத்துடன் வசன வரிகள், வரிகளை ஒப்பிட்டுப் பார்க்க நீங்கள் அதைப் பார்க்கலாம், அது நீக்கப்படும் மொழிபெயர்ப்பு - நீங்கள் சரியான நேரத்தில் ஒட்டும் வசனங்கள்.

# Pokaż opis
source: Show description
ta: விளக்கத்தைக் காட்டு

# Pokaż wszystkie tagi
source: Show all tags
ta: எல்லா குறிச்சொற்களையும் காட்டு

# Pokaż tagi VSFiltermoda
source: Show VSFiltermod tags
ta: Vsfiltermod குறிச்சொற்களைக் காட்டு

# Przezroczystość koloru podstawowego
source: Transparency of primary color
ta: முதன்மை வண்ணத்தின் வெளிப்படைத்தன்மை

# Przezroczystość koloru pomocniczego
source: Transparency of secondary color
ta: இரண்டாம் நிலை நிறத்தின் வெளிப்படைத்தன்மை

# Przezroczystość koloru obwódki
source: Transparency of border color
ta: எல்லை நிறத்தின் வெளிப்படைத்தன்மை

# Przezroczystość koloru cienia
source: Transparency of shadow color
ta: நிழல் நிறத்தின் வெளிப்படைத்தன்மை

# Kolor pomocniczy
source: Secondary color
ta: இரண்டாம் நிலை நிறம்

# Maska PNG koloru podstawowego
source: PNG mask of primary color
ta: முதன்மை வண்ணத்தின் பி.என்.சி மாச்க்

# Maska PNG koloru pomocniczego
source: PNG mask of secondary color
ta: இரண்டாம் நிலை வண்ணத்தின் பி.என்.சி முகமூடி

# Maska PNG koloru obwódki
source: PNG mask of border color
ta: எல்லை நிறத்தின் பி.என்.சி முகமூடி

# Maska PNG koloru cienia
source: ‪PNG mask of shadow color
ta: நிழல் நிறத்தின் பி.என்.சி மாச்க்

# Gradient przezroczystości koloru podstawowego
source: Gradient transparency of primary color
ta: முதன்மை வண்ணத்தின் சாய்வு வெளிப்படைத்தன்மை

# Gradient przezroczystości koloru pomocniczego
source: Gradient transparency of secondary color
ta: இரண்டாம் நிலை நிறத்தின் சாய்வு வெளிப்படைத்தன்மை

# Gradient przezroczystości koloru obwódki
source: Gradient transparency of border color
ta: எல்லை நிறத்தின் சாய்வு வெளிப்படைத்தன்மை

# Gradient przezroczystości koloru cienia
source: Gradient transparency of shadow color
ta: நிழல் நிறத்தின் சாய்வு வெளிப்படைத்தன்மை

# Gradient koloru podstawowego
source: Gradient of primary color
ta: முதன்மை வண்ணத்தின் சாய்வு

# Gradient koloru pomocniczego
source: Gradient of secondary color
ta: இரண்டாம் நிலை வண்ணத்தின் சாய்வு

# Gradient koloru obwódki
source: Gradient of border color
ta: எல்லை நிறத்தின் சாய்வு

# Gradient koloru cienia
source: Gradient of shadow color
ta: நிழல் நிறத்தின் சாய்வு

# Położenie tekstu (układ SSA)
source: Text alignment (SSA)
ta: உரை சீரமைப்பு (எச்எச்ஏ)

# Przezroczystość całego tekstu
source: Transparency
ta: வெளிப்படைத்தன்மை

# Pogrubienie tekstu
source: Text bold
ta: தைரியமான உரை

# Rozmycie krawędzi
source: Blur edge
ta: மங்கலான விளிம்பு

# Rozmycie
source: Blur of border, shadow or font
ta: எல்லை, நிழல் அல்லது எழுத்துருவின் மங்கலானது

# Grubość obwódki
source: Thickness of border
ta: எல்லையின் தடிமன்

# Wycinki wektorowe / prostokątne
source: Vector clip / rectangle clip
ta: திசையன் கிளிப் / செவ்வக கிளிப்

# Deformacja czcionki
source: Distort of font
ta: எழுத்துருவின் சிதைவு

# Pojawianie / znikanie tekstu
source: Fading in / fading out of text
ta: உரையிலிருந்து மங்குவது / மங்குகிறது

# Pojawianie / znikanie tekstu (zaawansowana wersja)
source: Fading in / fading out of text (advanced version)
ta: உரையிலிருந்து மங்குவது / மங்குவது (மேம்பட்ட பதிப்பு)

# Pochylenie w osi X
source: Skew in X axis
ta: ஃச் அச்சில் வளைவு

# Pochylenie w osi Y
source: Skew in Y axis
ta: ஒய் அச்சில் வளைவு

# Kodowanie znaków tekstu
source: Text encoding
ta: உரை குறியாக்கம்

# Zaokrąglenie tekstu
source: Round of text
ta: உரையின் சுற்று

# Obrót w osi X
source: Rotation in X axis
ta: ஃச் அச்சில் சுழற்சி

# Obrót w osi Y
source: Rotation in Y axis
ta: ஒய் அச்சில் சுழற்சி

# Obrót w osi Z
source: Rotation in Z axis
ta: சட் அச்சில் சுழற்சி

# Wielkość czcionki
source: Font size
ta: எழுத்துரு அளவு

# Skala w osi X i Y
source: Scale in X and Y axis
ta: ஃச் மற்றும் ஒய் அச்சில் அளவு

# Skala w osi X
source: Scale in X axis
ta: ஃச் அச்சில் அளவு

# Skala w osi Y
source: Scale in Y axis
ta: ஒய் அச்சில் அளவு

# Odstępy między znakami
source: Font spacing
ta: எழுத்துரு இடைவெளி

# Odstęp między znakami w pionie
source: Vertical font spacing
ta: செங்குத்து எழுத்துரு இடைவெளி

# Kursywa / pochylenie tekstu
source: Text italic
ta: உரை சாய்வு

# Odwrócone wycinki wektorowe / prostokątne
source: Reverse vector clip or rectangle clip
ta: தலைகீழ் திசையன் கிளிப் அல்லது செவ்வக கிளிப்

# Trzęsienie tekstu
source: Text jitter
ta: உரை நடுக்கம்

# Timing karaoke
source: Karaoke timing
ta: கரோக்கி நேரம்

# Timing karaoke płynne przejście
source: Karaoke timing smooth transition
ta: கரோக்கி நேரம் மென்மையான மாற்றம்

# Timing karaoke obwódka
source: Karaoke timing border
ta: கரோக்கி நேர எல்லை
