Repository: 247i/TACETr
Catalog: உரை/தானி/karaoke-mugen-karaoke-mugen-server-*.po
Languages: ta

# error.generic
source: Error
ta: பிழை

# error.private_profile
source: Profile is private.
ta: சுயவிவரம் தனிப்பட்டது.

# error.not_found_profile
source: Cannot find this user
ta: இந்த பயனரைக் கண்டுபிடிக்க முடியவில்லை

# error.not_found_playlist
source: Cannot find this playlist
ta: இந்த பிளேலிச்ட்டைக் கண்டுபிடிக்க முடியவில்லை

# error.home
source: Go home
ta: வீட்டிற்குச் செல்லுங்கள்

# error.not_found_tag
source: Tag not found
ta: குறிச்சொல் கிடைக்கவில்லை

# error.remote
source: Error when loading remotes list
ta: ரிமோட்ச் பட்டியலை ஏற்றும்போது பிழை

# error.bans
source: Error when loading bans list
ta: தடைகள் பட்டியலை ஏற்றும்போது பிழை

# kara.phrase
source: {songtype} from {series}
ta: {songtype} இலிருந்து {series}

# kara.meta
source: {songtitle} from {serieSinger}
ta: {பாடல் தலைப்பு {{songtitle}

# kara.notfound
source: Karaoke not found
ta: கரோக்கி கண்டுபிடிக்கப்படவில்லை

# kara.tagtypes.series
source: Series
ta: தொடர்

# kara.tagtypes.langs
source: Language | Languages
ta: மொழி | மொழிகள்

# kara.tagtypes.songtypes
source: Song type | Song types
ta: பாடல் வகை | பாடல் வகைகள்

# kara.tagtypes.singers
source: Singer | Singers
ta: பாடகர் | பாடகர்கள்

# kara.tagtypes.songwriters
source: Songwriter | Songwriters
ta: பாடலாசிரியர் | பாடலாசிரியர்கள்

# kara.tagtypes.families
source: Video Content | Video Contents
ta: வீடியோ உள்ளடக்கம் | வீடியோ உள்ளடக்கங்கள்

# kara.tagtypes.origins
source: Origin | Origins
ta: தோற்றம் | தோற்றம்

# kara.tagtypes.genres
source: Genre | Genres
ta: வகை | வகைகள்

# kara.tagtypes.platforms
source: Platform | Platforms
ta: இயங்குதளம் | தளங்கள்

# kara.tagtypes.creators
source: Creator | Creators
ta: உருவாக்கியவர் | படைப்பாளிகள்

# kara.tagtypes.authors
source: Karaoke author | Karaoke authors
ta: கரோக்கி ஆசிரியர் | கரோக்கி ஆசிரியர்கள்

# kara.tagtypes.groups
source: Group | Groups
ta: குழு | குழுக்கள்

# kara.tagtypes.misc
source: Miscellaneous
ta: மற்றவை

# kara.tagtypes.versions
source: Version | Versions
ta: பதிப்பு | பதிப்புகள்

# kara.tagtypes.warnings
source: Warning | Warnings
ta: எச்சரிக்கை | எச்சரிக்கைகள்

# kara.tagtypes.collections
source: Collection | Collections
ta: சேகரிப்பு | சேகரிப்புகள்

# kara.tagtypes.singergroups
source: Band | Bands
ta: இசைக்குழு | பட்டைகள்

# kara.tagtypes.franchises
source: Franchise | Franchises
ta: உரிமையாளர் | உரிமையாளர்கள்

# kara.tagtypes.years
source: Year | Years
ta: ஆண்டு | ஆண்டுகள்

# kara.tagtypes.default
source: By default
ta: இயல்பாக

# kara.singers_by
source: Sung by
ta: பாடியது

# kara.songwriters_by
source: Composed by
ta: இயற்றப்பட்டது

# kara.creators_by
source: Created by
ta: உருவாக்கியது

# kara.authors_by
source: Karaoke created by
ta: கரோக்கி உருவாக்கியது

# kara.singergroups_by
source: from the music band
ta: இசை இசைக்குழுவிலிருந்து

# kara.duration
source: Duration
ta: காலம்

# kara.created_at
source: Created
ta: உருவாக்கப்பட்டது

# kara.download
source: Download
ta: பதிவிறக்கம்

# kara.live_unavailable
source: You cannot play this karaoke in your browser. Either the video is in an unsupported format for browsers, or it has been disabled for legal reasons.
ta: உங்கள் உலாவியில் இந்த கரோக்கை நீங்கள் விளையாட முடியாது. வீடியோ உலாவிகளுக்கான ஆதரிக்கப்படாத வடிவத்தில் உள்ளது, அல்லது சட்ட காரணங்களுக்காக அது முடக்கப்பட்டுள்ளது.

# kara.lyrics.show
source: Show lyrics
ta: பாடல் காட்டு

# kara.lyrics.hide
source: Hide lyrics
ta: வரிகளை மறைக்க

# kara.favorites.add
source: Add to favorites
ta: பிடித்தவைகளில் சேர்க்கவும்

# kara.favorites.remove
source: Remove from favorites
ta: பிடித்தவைகளிலிருந்து அகற்று

# kara.set_banner.btn
source: Use as profile banner
ta: சுயவிவர பேனராக பயன்படுத்தவும்

# kara.set_banner.forbidden_label
source: You cannot use this karaoke as your profile banner.
ta: இந்த கரோக்கை உங்கள் சுயவிவர பேனராகப் பயன்படுத்த முடியாது.

# kara.playlists.add
source: Add to playlist
ta: பிளேலிச்ட்டில் சேர்க்கவும்

# kara.playlists.create
source: Create new playlist…
ta: புதிய பிளேலிச்ட்டை உருவாக்கவும்…

# kara.playlists.new_playlist_label
source: {nickname}'s playlist
ta: {புனைப்பெயர் பிளேலிச்ட்

# kara.playlists.add_success
source: Karaoke successfully added to playlist.
ta: கரோக்கி வெற்றிகரமாக பிளேலிச்ட்டில் சேர்த்தார்.

# kara.problem.title
source: An issue with {title}?
ta: {title} உடன் ஒரு சிக்கல்?

# kara.problem.btn.edit
source: Suggest an edit
ta: ஒரு திருத்தத்தை பரிந்துரைக்கவும்

# kara.problem.btn.media
source: Media issue
ta: ஊடக சிக்கல்

# kara.problem.btn.metadata
source: Metadata issue
ta: மேனிலை தரவு சிக்கல்

# kara.problem.btn.lyrics
source: Lyrics issue
ta: பாடல் சிக்கல்

# kara.problem.form.title
source: Report a problem
ta: ஒரு சிக்கலைப் புகாரளிக்கவும்

# kara.problem.form.subtitle
source: We do our best to have a high-quality database, but sometimes some issues are still there. Thanks for your help!
ta: உயர்தர தரவுத்தளத்தை வைத்திருப்பதற்கு நாங்கள் எங்களால் முடிந்த அனைத்தையும் செய்கிறோம், ஆனால் சில நேரங்களில் சில சிக்கல்கள் இன்னும் உள்ளன. உங்கள் உதவிக்கு நன்றி!

# kara.problem.form.type.label
source: Problem type
ta: சிக்கல் வகை

# kara.problem.form.type.media
source: Media issue
ta: ஊடக சிக்கல்

# kara.problem.form.type.metadata
source: Metadata issue
ta: மேனிலை தரவு சிக்கல்

# kara.problem.form.type.lyrics
source: Lyrics issue
ta: பாடல் சிக்கல்

# kara.problem.form.comment.label
source: Comment
ta: கருத்து

# kara.problem.form.comment.placeholder
source: After 2 minutes, the lyrics aren't synchronised anymore.
ta: 2 நிமிடங்களுக்குப் பிறகு, பாடல் வரிகள் இனி ஒத்திசைக்கப்படவில்லை.

# kara.problem.form.username.label
source: Your name
ta: உங்கள் பெயர்

# kara.problem.form.username.placeholder
source: IAmMeticulous
ta: Iammeticulaul

# kara.problem.form.submit
source: Submit
ta: சமர்ப்பிக்கவும்

# kara.problem.form.thanks.text
source: Thanks! We will fix this issue as soon as possible: {url}
ta: நன்றி! இந்த சிக்கலை விரைவில் சரிசெய்வோம்: {url}

# kara.problem.form.thanks.btn
source: Close
ta: மூடு

# kara.import.sections.files
source: Files
ta: கோப்புகள்

# kara.import.sections.parents
source: Parent Song(s)
ta: பெற்றோர் பாடல்கள்)

# kara.import.sections.titles
source: Title(s)
ta: தலைப்பு (கள்)

# kara.import.sections.identity
source: Identity
ta: முற்றொருமை

# kara.import.sections.categorization
source: Categorization
ta: வகைப்படுத்தல்

# kara.import.sections.meta
source: Metadata
ta: மேனிலை தரவு

# kara.import.desc.parents
source: If this song is an alternative version of another one, select its parent(s) to pre-fill this form.
ta: இந்த பாடல் இன்னொருவரின் மாற்று பதிப்பாக இருந்தால், இந்த படிவத்தை முன்கூட்டியே நிரப்ப அதன் பெற்றோர் (களை) தேர்ந்தெடுக்கவும்.

# kara.import.desc.parents_public
source: When a user selects a parent song in the public interface, they'll see all their children / alternative versions.
ta: ஒரு பயனர் பொது இடைமுகத்தில் பெற்றோர் பாடலைத் தேர்ந்தெடுக்கும்போது, அவர்கள் தங்கள் குழந்தைகள் / மாற்று பதிப்புகள் அனைத்தையும் பார்ப்பார்கள்.

# kara.import.desc.titles
source: Set all titles the song has in different languages. Usually, there's only one title.
ta: பாடலின் அனைத்து தலைப்புகளையும் வெவ்வேறு மொழிகளில் அமைக்கவும். வழக்கமாக, ஒரே ஒரு தலைப்பு மட்டுமே உள்ளது.

# kara.import.desc.titles_default_language
source: Default title language should be the song's original title. For titles in non-latin languages (chinese, japanese, arabic, korean…), add a "Romanization" title and make it default.
ta: இயல்புநிலை தலைப்பு மொழி பாடலின் அசல் தலைப்பாக இருக்க வேண்டும். லத்தீன் அல்லாத மொழிகளில் (சீன, சப்பானிய, அரபு, கொரிய…) தலைப்புகளுக்கு, "ரோமானியமயமாக்கல்" தலைப்பைச் சேர்த்து இயல்புநிலையாக மாற்றவும்.

# kara.import.desc.aliases
source: If the song is known as something else (abbreviations for example), set them here to help people find it through search. No need to use words already contained in the song title(s).
ta: பாடல் வேறொன்றாக அறியப்பட்டால் (எடுத்துக்காட்டாக சுருக்கங்கள்), தேடலின் மூலம் அதைக் கண்டுபிடிக்க மக்களுக்கு உதவ அவற்றை இங்கே அமைக்கவும். பாடல் தலைப்பு (கள்) இல் ஏற்கனவே உள்ள சொற்களைப் பயன்படுத்த வேண்டிய அவசியமில்லை.

# kara.import.description
source: This form allows you to submit a karaoke to the Karaoke Mugen team. It will not be immediately integrated in the karaoke database because it requires a validation. Please be patient. Your karaoke may be modified if it doesn't comply to the team rules.
ta: கரோக்கி முகன் அணிக்கு கரோக்கி சமர்ப்பிக்க இந்த படிவம் உங்களை அனுமதிக்கிறது. இது கரோக்கி தரவுத்தளத்தில் உடனடியாக ஒருங்கிணைக்கப்படாது, ஏனெனில் இதற்கு சரிபார்ப்பு தேவைப்படுகிறது. தயவுசெய்து பொறுமையாக இருங்கள். உங்கள் கரோக்கி குழு விதிகளுக்கு இணங்கவில்லை என்றால் மாற்றியமைக்கப்படலாம்.

# kara.import.attention
source: ATTENTION:
ta: கவனம்:

# kara.import.check_in_progress
source: Please check the list of karaoke subs currently being made before sending us a song. This'll avoid duplicate work, and the world will thus be a better place.
ta: எங்களுக்கு ஒரு பாடலை அனுப்புவதற்கு முன்பு தற்போது செய்யப்பட்ட கரோக்கி சப்சின் பட்டியலை சரிபார்க்கவும். இது நகல் வேலையைத் தவிர்க்கும், இதனால் உலகம் ஒரு சிறந்த இடமாக இருக்கும்.

# kara.import.documentation_link
source: Please read {instance}'s rules before submitting a song!
ta: ஒரு பாடலை சமர்ப்பிப்பதற்கு முன் {instance} இன் விதிகளைப் படியுங்கள்!

# kara.import.in_progress_link
source: Karaoke subs In Progress List
ta: கரோக்கி சப்ச் முன்னேற்ற பட்டியலில்

# kara.import.license_reminder
source: Your karaoke will be published with the {name} license
ta: உங்கள் கரோக்கி {name} உரிமத்துடன் வெளியிடப்படும்

# kara.import.license_link
source: Learn more about this license by clicking here.
ta: இங்கே சொடுக்கு செய்வதன் மூலம் இந்த உரிமத்தைப் பற்றி மேலும் அறிக.

# kara.import.add
source: Add
ta: கூட்டு

# kara.import.create
source: Create
ta: உருவாக்கு

# kara.import.show_hide
source: Show/Hide
ta: காட்டு/மறைக்க

# kara.import.choose_file
source: Choose a file
ta: ஒரு கோப்பைத் தேர்வுசெய்க

# kara.import.add_file_media_error
source: {name} is not a media file
ta: {name} என்பது ஊடக கோப்பு அல்ல

# kara.import.add_file_media_not_supported_error
source: {name} is not a supported media file, convert it to one of the following formats: {formats}
ta: {name} என்பது ஒரு உதவி ஊடக கோப்பு அல்ல, அதை பின்வரும் வடிவங்களில் ஒன்றாக மாற்றவும்: {formats}

# kara.import.add_file_lyrics_error
source: {name} is not a subtitle file
ta: {பெயர் a ஒரு வசன கோப்பு அல்ல

# kara.import.add_file_success
source: {name} file added successfully
ta: {name} கோப்பு வெற்றிகரமாக சேர்க்கப்பட்டது

# kara.import.comment
source: Leave a comment?
ta: கருத்துத் தெரிவிக்கவா?

# kara.import.comment_tooltip
source: If you want to add a message for the maintainers or just say thanks, say it here!
ta: நீங்கள் பராமரிப்பாளர்களுக்கு ஒரு செய்தியைச் சேர்க்க விரும்பினால் அல்லது நன்றி சொல்ல விரும்பினால், இங்கே சொல்லுங்கள்!

# kara.import.submit
source: Send karaoke
ta: கரோக்கி அனுப்புங்கள்

# kara.import.media_file
source: Media file
ta: மீடியா கோப்பு

# kara.import.media_file_edit
source: Replace media file
ta: மீடியா கோப்பை மாற்றவும்

# kara.import.media_file_required
source: Media file is mandatory
ta: மீடியா கோப்பு கட்டாயமாகும்

# kara.import.media_file_tooltip
source: Supported file formats: {formats}
ta: உதவி கோப்பு வடிவங்கள்: {formats}

# kara.import.lyrics_file
source: Lyrics file
ta: பாடல் கோப்பு

# kara.import.lyrics_file_tooltip
source: Supported file formats: {formats}
ta: உதவி கோப்பு வடிவங்கள்: {formats}

# kara.import.lyrics_file_missing
source: The lyrics file is missing, this is appropriate only if you are sending an MKV file or a karaoke without lyrics (yes).
ta: பாடல் கோப்பு இல்லை, நீங்கள் ஒரு எம்.கே.வி கோப்பு அல்லது பாடல் இல்லாமல் கரோக்கி அனுப்பினால் மட்டுமே இது பொருத்தமானது (ஆம்).

# kara.import.title
source: Title
ta: தலைப்பு

# kara.import.title_required
source: Please enter a title
ta: தயவுசெய்து ஒரு தலைப்பை உள்ளிடவும்

# kara.import.title_tooltip
source: If you don't know, put the series' name here as well. In the case of an alternative version, name your title as: 'My title ~ Disco vers.' for example
ta: உங்களுக்குத் தெரியாவிட்டால், தொடரின் பெயரை இங்கேயும் வைக்கவும். மாற்று பதிப்பின் விசயத்தில், உங்கள் தலைப்புக்கு இவ்வாறு பெயரிடுங்கள்: 'எனது தலைப்பு ~ டிச்கோ வெர்.' உதாரணமாக

# kara.import.titles_aliases
source: Aliases
ta: மாற்றுப்பெயர்கள்

# kara.import.titles_aliases_tooltip
source: Short names or alternative names, used for search.
ta: குறுகிய பெயர்கள் அல்லது மாற்று பெயர்கள், தேடலுக்குப் பயன்படுத்தப்படுகின்றன.

# kara.import.series_tooltip
source: TV series, movie title, video game title, etc.
ta: டிவி தொடர், திரைப்பட தலைப்பு, வீடியோ கேம் தலைப்பு போன்றவை.

# kara.import.series_singers_required
source: Series, Sung by and From the music band cannot be empty at the same time.
ta: இசை இசைக்குழுவிலிருந்து பாடிய தொடர், ஒரே நேரத்தில் காலியாக இருக்க முடியாது.

# kara.import.franchises_tooltip
source: If the series is part of a franchise (like Gundam, Mario, Zelda, Naruto, etc.) enter it here.
ta: தொடர் ஒரு உரிமையின் ஒரு பகுதியாக இருந்தால் (குண்டம், மரியோ, செல்டா, நருடோ போன்றவை) அதை இங்கே உள்ளிடவும்.

# kara.import.songtypes_required
source: Song type is required
ta: பாடல் வகை தேவை

# kara.import.collections_required
source: At least one collection must be checked
ta: குறைந்தது ஒரு சேகரிப்பை சரிபார்க்க வேண்டும்

# kara.import.songorder
source: Song order
ta: பாடல் வரிசை

# kara.import.songorder_invalid
source: Song order is invalid
ta: பாடல் ஒழுங்கு தவறானது

# kara.import.songorder_tooltip
source: Opening/Ending number. If this is the only opening/ending in the series, leave blank.
ta: திறப்பு/முடிவு எண். தொடரில் ஒரே திறப்பு/முடிவு என்றால், காலியாக விடவும்.

# kara.import.langs_required
source: Please choose a language
ta: தயவுசெய்து ஒரு மொழியைத் தேர்வுசெய்க

# kara.import.year
source: Broadcast year
ta: ஒளிபரப்பு ஆண்டு

# kara.import.year_tooltip
source: Year when the series was broadcasted or the video was produced
ta: தொடர் ஒளிபரப்பப்பட்ட அல்லது வீடியோ தயாரிக்கப்பட்ட ஆண்டு

# kara.import.year_required
source: Broadcast year is required
ta: ஒளிபரப்பு ஆண்டு தேவை

# kara.import.year_invalid
source: Broadcast year is invalid
ta: ஒளிபரப்பு ஆண்டு தவறானது

# kara.import.singergroups_tooltip
source: If the singers belong to a music band, put them in here. The band will be displayed in the player and song lists instead of individual singers.
ta: பாடகர்கள் ஒரு இசை இசைக்குழுவைச் சேர்ந்தவர்கள் என்றால், அவற்றை இங்கே வைக்கவும். தனிப்பட்ட பாடகர்களுக்கு பதிலாக பிளேயர் மற்றும் பாடல் பட்டியல்களில் இசைக்குழு காண்பிக்கப்படும்.

# kara.import.songwriters_tooltip
source: Composers, Arrangers and Lyricists.
ta: இசையமைப்பாளர்கள், ஏற்பாட்டாளர்கள் மற்றும் பாடலாசிரியர்கள்.

# kara.import.creators_tooltip
source: Entity that created the series. Can be animation studio, movie studio, or game studio.
ta: தொடரை உருவாக்கிய நிறுவனம். அனிமேசன் ச்டுடியோ, மூவி ச்டுடியோ அல்லது கேம் ச்டுடியோவாக இருக்கலாம்.

# kara.import.authors_tooltip
source: You should add yourself here ;)
ta: நீங்கள் இங்கே உங்களைச் சேர்க்க வேண்டும்;)

# kara.import.authors_required
source: Author of the karaoke is required
ta: கரோக்கின் ஆசிரியர் தேவை

# kara.import.groups_tooltip
source: Download groups for this song. The song will be included in these download packs
ta: இந்த பாடலுக்கான குழுக்களைப் பதிவிறக்கவும். இந்த பதிவிறக்க பொதிகளில் பாடல் சேர்க்கப்படும்

# kara.import.parents
source: Parents
ta: பெற்றோர்

# kara.import.parents_tooltip
source: If a parent is defined, this karaoke will show as alternative to the selected parent karaoke(s).
ta: ஒரு பெற்றோர் வரையறுக்கப்பட்டால், இந்த கரோக்கி தேர்ந்தெடுக்கப்பட்ட பெற்றோர் கரோக்கி (கள்) க்கு மாற்றாக காண்பிக்கப்படும்.

# kara.import.created_at
source: Creation date
ta: உருவாக்கும் தேதி

# kara.import.add_success
source: Your karaoke has been successfully sent!
ta: உங்கள் கரோக்கி வெற்றிகரமாக அனுப்பப்பட்டுள்ளது!

# kara.import.add_success_description
source: An issue has been created on our tracker. You can check its progression at {url}
ta: எங்கள் டிராக்கரில் ஒரு சிக்கல் உருவாக்கப்பட்டுள்ளது. அதன் முன்னேற்றத்தை {url on இல் சரிபார்க்கலாம்

# kara.import.add_error
source: An error has occurred, karaoke has not been sent properly
ta: பிழை ஏற்பட்டது, கரோக்கி சரியாக அனுப்பப்படவில்லை

# kara.import.restart
source: Submit new karaoke
ta: புதிய கரோக்கை சமர்ப்பிக்கவும்

# kara.import.i18n_select
source: Add a language
ta: ஒரு மொழியைச் சேர்க்கவும்

# kara.import.i18n_delete
source: Remove language
ta: மொழியை அகற்று

# kara.import.romanization_warning
source: This title/tag contains a non-Latin alphabet language. You must add the language “Latin Alphabet (Romanization)” as well unless the title in non-Latin alphabet is a transcription of another language in its entirety.
ta: இந்த தலைப்பு/குறிச்சொல்லில் லத்தீன் அல்லாத எழுத்துக்கள் உள்ளன. லத்தீன் அல்லாத எழுத்துக்களில் உள்ள தலைப்பு என்பது வேறொரு மொழியின் முழுமையின் படியெடுத்தல் இல்லாவிட்டால், நீங்கள் “லத்தீன் எழுத்துக்கள் (ரோமானிசேசன்)” மொழியைச் சேர்க்க வேண்டும்.

# kara.import.default_language
source: Default language
ta: இயல்புநிலை மொழி

# kara.import.send_contact_infos
source: Share my contact information with database maintainers
ta: எனது தொடர்புத் தகவலை தரவுத்தள பராமரிப்பாளர்களுடன் பகிரவும்

# kara.import.contact_infos
source: Contact information
ta: தொடர்பு செய்தி

# kara.import.contact_infos_tooltip
source: Enter your contact details, so we can come to you if we have any questions about the karaoke.
ta: உங்கள் தொடர்பு விவரங்களை உள்ளிடவும், எனவே கரோக்கி குறித்து எங்களுக்கு ஏதேனும் கேள்விகள் இருந்தால் நாங்கள் உங்களிடம் வரலாம்.

# kara.import.auto_send_contact_infos
source: If you log in, you can check a box on the form to automatically share your contact information with database maintainers.
ta: நீங்கள் உள்நுழைந்தால், தரவுத்தள பராமரிப்பாளர்களுடன் உங்கள் தொடர்புத் தகவலை தானாகவே பகிர படிவத்தில் ஒரு பெட்டியை சரிபார்க்கலாம்.

# kara.import.from_display_type
source: From tag type display
ta: குறிச்சொல் வகை காட்சியில் இருந்து

# kara.import.from_display_type_tooltip
source: Select the tag type to be displayed with the title of the song. It will show as “[title] from [this tag type]”.
ta: பாடலின் தலைப்புடன் காண்பிக்கப்பட வேண்டிய குறிச்சொல் வகையைத் தேர்ந்தெடுக்கவும். இது “[இந்த குறிச்சொல் வகையிலிருந்து] [தலைப்பு]” என்று காண்பிக்கப்படும்.

# kara.stats.favorited
source: Added to favorites by {number} users
ta: {number} பயனர்களால் பிடித்தவைகளில் சேர்க்கப்பட்டது

# kara.stats.requested
source: Requested {number} times
ta: கோரப்பட்டது {number} முறை

# kara.stats.played
source: Played {number} times
ta: {number} முறை விளையாடியது

# kara.siblings
source: Similar songs
ta: ஒத்த பாடல்கள்

# kara.childrens
source: Children songs
ta: குழந்தைகள் பாடல்கள்

# kara.parents
source: Parent songs
ta: பெற்றோர் பாடல்கள்

# kara.player.previous
source: Previous song (B)
ta: முந்தைய பாடல் (பி)

# kara.player.next
source: Next song (N)
ta: அடுத்த பாடல் (என்)

# kara.player.theater_mode
source: Theater mode (T)
ta: தியேட்டர் முறை (டி)

# kara.player.fullscreen
source: Fullscreen (F)
ta: முழுத்திரை (எஃப்)

# kara.player.autoplay
source: Autoplay
ta: ஆட்டோபிளே

# kara.player.loop
source: Loop
ta: லூப்

# kara.player.description
source: This video is hosted by {instance}. Please use our application if you plan an event or stream!
ta: இந்த வீடியோவை {நிகழ்வு க்கு ஆல் வழங்கப்படுகிறது. நீங்கள் ஒரு நிகழ்வைத் திட்டமிட்டால் அல்லது ச்ட்ரீம் செய்தால் எங்கள் விண்ணப்பத்தைப் பயன்படுத்தவும்!

# layout.loading
source: Loading…
ta: ஏற்றுகிறது…

# layout.empty
source: We looked everywhere, we didn't find anything.
ta: நாங்கள் எல்லா இடங்களிலும் பார்த்தோம், எங்களுக்கு எதுவும் கிடைக்கவில்லை.

# layout.suggest
source: Can't find what you're looking for?
ta: நீங்கள் தேடுவதைக் கண்டுபிடிக்க முடியவில்லையா?

# layout.suggest_open
source: Suggest us a song!
ta: எங்களுக்கு ஒரு பாடலை பரிந்துரைக்கவும்!

# layout.remove_tags
source: Did you try removing some of the filter tags from the search?
ta: தேடலில் இருந்து சில வடிகட்டி குறிச்சொற்களை அகற்ற முயற்சித்தீர்களா?

# layout.end_favorites
source: This is the end of favorites.
ta: இது பிடித்தவைகளின் முடிவு.

# layout.end_my_favorites
source: This is the end of your favorites.
ta: இது உங்களுக்கு பிடித்தவைகளின் முடிவு.

# layout.end_playlists
source: Display {number} more playlists
ta: {number} மேலும் பிளேலிச்ட்களைக் காண்பி

# layout.explore
source: Go add some!
ta: சில சேர்க்கச் செல்லுங்கள்!

# layout.results
source: {count} result | {count} results
ta: {count} முடிவு | {count} முடிவுகள்

# layout.collections
source: Karaoke Mugen provides many collections, choose the ones you are interested in.
ta: கரோக்கி முகன் பல தொகுப்புகளை வழங்குகிறார், நீங்கள் ஆர்வமுள்ளவற்றைத் தேர்வுசெய்க.

# layout.slogan
source: Come sing this song with Karaoke Mugen!
ta: கரோக்கி முகனுடன் இந்த பாடலைப் பாட வாருங்கள்!

# layout.end_users
source: You've reached the end of the user list (congratulations!).
ta: நீங்கள் பயனர் பட்டியலின் முடிவை அடைந்துவிட்டீர்கள் (வாழ்த்துக்கள்!).

# layout.app_banner.title
source: Did you know?
ta: உங்களுக்குத் தெரியுமா?

# layout.app_banner.description
source: Karaoke Mugen is also an application for Windows, macOS and Linux which allows you to manage playlists and karaoke events, may it be between friends, during anime conventions or even during your streams!
ta: கரோக்கி முகன் சாளரங்கள், மேகோச் மற்றும் லினக்சிற்கான ஒரு பயன்பாடாகும், இது பிளேலிச்ட்கள் மற்றும் கரோக்கி நிகழ்வுகளை நிர்வகிக்க உங்களை அனுமதிக்கிறது, இது நண்பர்களிடையே, அனிம் மாநாடுகளின் போது அல்லது உங்கள் நீரோடைகளின் போது கூட இருக்கட்டும்!

# layout.app_banner.more_features
source: There are lots more features than on {instance}!
ta: {உதாரணத்தை விட நிறைய நற்பொருத்தங்கள் உள்ளன!

# layout.app_banner.link
source: Check out the {link} to download the application for your computer.
ta: உங்கள் கணினிக்கான பயன்பாட்டைப் பதிவிறக்க {link} ஐப் பாருங்கள்.

# layout.app_banner.website
source: website
ta: வலைத்தளம்

# footer.home
source: Project home
ta: திட்ட வீடு

# footer.api_documentation
source: API Documentation
ta: பநிஇ ஆவணங்கள்

# footer.translation
source: Contribute to translations
ta: மொழிபெயர்ப்புகளுக்கு பங்களிக்கவும்

# footer.software_under_license
source: Software under license
ta: உரிமத்தின் கீழ் மென்பொருள்

# footer.base_under_licence
source: Karaoke base under license
ta: உரிமத்தின் கீழ் கரோக்கி அடிப்படை

# stats.karaokes
source: Song | Songs
ta: பாடல் | பாடல்கள்

# stats.all_duration
source: Duration of all songs
ta: அனைத்து பாடல்களின் காலம்

# stats.last_generation
source: Last update
ta: கடைசி புதுப்பிப்பு

# stats.media_size
source: Media size
ta: ஊடக அளவு

# duration.days
source: days
ta: நாட்கள்

# duration.hours
source: hours
ta: மணி

# duration.minutes
source: minutes
ta: நிமிடங்கள்

# duration.seconds
source: seconds
ta: நொடிகள்

# menu.play_random_song
source: Play random song
ta: சீரற்ற பாடலை வாசிக்கவும்

# menu.add_repository
source: Add this repository to your app
ta: இந்த களஞ்சியத்தை உங்கள் பயன்பாட்டில் சேர்க்கவும்

# menu.random
source: Roll the dice
ta: பகடை உருட்டவும்

# menu.database
source: Database
ta: தரவுத்தளம்

# menu.karas
source: Songs
ta: பாடல்கள்

# menu.songtypes
source: Types
ta: வகைகள்

# menu.tags
source: Others…
ta: மற்றவர்கள்…

# menu.singergroups
source: Bands
ta: பட்டைகள்

# menu.misc
source: Misc tags
ta: மற்ற குறிச்சொற்கள்

# menu.warnings
source: Warnings
ta: எச்சரிக்கைகள்

# menu.groups
source: Groups
ta: குழுக்கள்

# menu.families
source: Video Contents
ta: வீடியோ உள்ளடக்கங்கள்

# menu.origins
source: Origins
ta: தோற்றம்

# menu.genres
source: Genres
ta: வகைகள்

# menu.platforms
source: Platforms
ta: தளங்கள்

# menu.versions
source: Versions
ta: பதிப்புகள்

# menu.franchises
source: Franchises
ta: உரிமையாளர்கள்

# menu.singers
source: Singers
ta: பாடகர்கள்

# menu.series
source: Series
ta: தொடர்

# menu.songwriters
source: Songwriters
ta: பாடலாசிரியர்கள்

# menu.creators
source: Creators
ta: படைப்பாளிகள்

# menu.authors
source: Authors
ta: ஆசிரியர்கள்

# menu.langs
source: Languages
ta: மொழிகள்

# menu.years
source: Years
ta: ஆண்டுகள்

# menu.community
source: Community
ta: சமூகம்

# menu.playlists
source: Playlists
ta: பிளேலிச்ட்கள்
