Repository: 247i/TACETr
Catalog: உரை/தானி/karaoke-mugen-karaoke-mugen-server-*.po
Languages: ta

# toast.PASSWORD_TOO_SHORT
source: Password too short
ta: கடவுச்சொல் மிகக் குறைவு

# toast.CHECK_YOUR_PRIVILEGES
source: Insufficient rights
ta: போதிய உரிமைகள்

# toast.EDIT_USER_ERROR
source: Erreur editing profile
ta: சுயவிவரப் பிழையைத் திருத்துதல்

# toast.GITLAB_DISABLED
source: Gitlab support is disabled
ta: அறிவிலிஆய்வு உதவி முடக்கப்பட்டுள்ளது

# toast.SUBFILE_FORMAT_UNKNOWN
source: Unknown lyrics format
ta: அறியப்படாத பாடல் வடிவம்

# toast.SUBFILE_PROCESS_ERROR
source: Error processing lyrics
ta: பிழை செயலாக்க பாடல்

# toast.UPLOADED_MEDIA_ERROR
source: Error processing media
ta: பிழை செயலாக்க மீடியா

# toast.UNKNOWN_PLAYLIST
source: Unknown playlist
ta: தெரியாத பிளேலிச்ட்

# toast.PL_DELETE_ERROR
source: Error deleting playlist
ta: பிளேலிச்ட்டை நீக்குவதில் பிழை

# toast.PL_EDIT_ERROR
source: Error editing playlist
ta: பிளேலிச்ட்டை திருத்துதல் பிழை

# toast.PL_CREATE_ERROR
source: Error creating the playlist
ta: பிளேலிச்ட்டை உருவாக்கும் பிழை

# toast.PL_GET_ERROR
source: Error retrieving playlists
ta: பிளேலிச்ட்களை மீட்டெடுப்பதில் பிழை

# toast.PL_ADD_CONTRIBUTOR_NO_SELF_ERROR
source: Impossible to add yourself as a contributor
ta: உங்களை ஒரு பங்களிப்பாளராக சேர்க்க இயலாது

# toast.PL_ADD_CONTRIBUTOR_ERROR
source: Error adding contributors
ta: பங்களிப்பாளர்களைச் சேர்ப்பதில் பிழை

# toast.PL_REMOVE_CONTRIBUTOR_ERROR
source: Error deleting contributors
ta: பங்களிப்பாளர்களை நீக்குவதில் பிழை

# toast.PL_GET_CONTENTS_ERROR
source: Error retrieving content from playlist
ta: பிளேலிச்ட்டில் இருந்து உள்ளடக்கத்தை மீட்டெடுப்பதில் பிழை

# toast.UNKNOWN_SONG
source: Unknown song
ta: தெரியாத பாடல்

# toast.PL_ADD_SONG_ERROR
source: Error adding song to playlist
ta: பிளேலிச்ட்டில் பாடலைச் சேர்ப்பதில் பிழை

# toast.INVALID_DATA
source: Invalid data
ta: தவறான தரவு

# toast.PL_DELETE_SONG_ERROR
source: Error when deleting a song from the playlist
ta: பிளேலிச்ட்டில் இருந்து ஒரு பாடலை நீக்கும்போது பிழை

# toast.PL_EDIT_SONG_ERROR
source: Error editing playlist contents
ta: பிளேலிச்ட் உள்ளடக்கங்களை திருத்தும் பிழை

# toast.PL_EXPORT_ERROR
source: Error exporting playlist
ta: பிளேலிச்ட்டை ஏற்றுமதி செய்வதில் பிழை

# toast.PL_IMPORT_ERROR
source: Error importing playlist
ta: பிளேலிச்ட்டை இறக்குமதி செய்வதில் பிழை

# toast.PL_SHARE_ERROR
source: Error sharing playlist
ta: பிளேலிச்ட்டைப் பகிர்வதில் பிழை

# toast.PL_SHARE_CLIPBOARD_SUCCESS
source: Playlist link copied in clipboard
ta: கிளிப்போர்டில் பிளேலிச்ட் இணைப்பு நகலெடுக்கப்பட்டது

# toast.PL_SHARE_CLIPBOARD_FAIL
source: Couldn't write playlist link to clipboard
ta: இடைநிலைப்பலகைக்கு பிளேலிச்ட் இணைப்பை எழுத முடியவில்லை

# toast.PL_SHUFFLE_ERROR
source: Error shuffling playlist
ta: பிழை கலக்கும் பிளேலிச்ட்

# roles.donator
source: Donator
ta: நன்கொடையாளர்

# roles.contributor
source: Contributor
ta: பங்களிப்பாளர்

# roles.maintainer
source: Maintainer
ta: பராமரிப்பாளர்

# roles.admin
source: Administrator
ta: நிர்வாகி

# suggestions.kara.yes
source: Yes!
ta: ஆம்!

# suggestions.kara.ok
source: All good!
ta: எல்லாம் நல்லது!

# suggestions.kara.remove
source: Remove
ta: அகற்று

# suggestions.header.title
source: Import suggestions
ta: பரிந்துரைகள் இறக்குமதி

# suggestions.header.description
source: What is this?
ta: இது என்ன?

# suggestions.header.purpose
source: Here are some karaoke songs that are ready to be imported. You can search for a particular song or press the "Randomly select other songs" button. You can endorse a karaoke song by pressing "Yes!".
ta: இறக்குமதி செய்யத் தயாராக இருக்கும் சில கரோக்கி பாடல்கள் இங்கே. நீங்கள் ஒரு குறிப்பிட்ட பாடலைத் தேடலாம் அல்லது "தோராயமாகப் பிற பாடல்களைத் தேர்ந்தெடுக்கவும்" பொத்தானை அழுத்தவும். "ஆம்!".

# suggestions.header.suggestion
source: If you still can't find the song you're looking for, click "Send Suggestion".
ta: நீங்கள் தேடும் பாடலை இன்னும் கண்டுபிடிக்க முடியாவிட்டால், "பரிந்துரை அனுப்பு" என்பதைக் சொடுக்கு செய்க.

# suggestions.header.random_selection
source: Randomly select other songs
ta: தோராயமாக மற்ற பாடல்களைத் தேர்ந்தெடுக்கவும்

# suggestions.header.send_suggestion
source: Send suggestion
ta: ஆலோசனையை அனுப்புங்கள்

# suggestions.modal.welcome.title
source: Where am I?
ta: நான் எங்கே?

# suggestions.modal.welcome.text
source: There are a lot of other karaoke databases: ones for UltraStar, Karawin or Karafun software for example. So here are some already available titles with their lyrics synchronized. We can't integrate immediately everything, so we'd like to know your priorities!
ta: மற்ற கரோக்கி தரவுத்தளங்கள் நிறைய உள்ளன: எடுத்துக்காட்டாக அல்ட்ராச்டார், கராவின் அல்லது கராஃபூன் மென்பொருளுக்கு. எனவே அவற்றின் பாடல் ஒத்திசைக்கப்பட்ட சில தலைப்புகள் இங்கே. எல்லாவற்றையும் உடனடியாக ஒருங்கிணைக்க முடியாது, எனவே உங்கள் முன்னுரிமைகளை அறிய விரும்புகிறோம்!

# suggestions.modal.welcome.text2
source: You can either search something, or let randomness do the job. In both cases, we'd be grateful for the time you spend enhancing our databases. Thank you!
ta: நீங்கள் எதையாவது தேடலாம், அல்லது சீரற்ற தன்மை வேலையைச் செய்யட்டும். இரண்டு சந்தர்ப்பங்களிலும், எங்கள் தரவுத்தளங்களை மேம்படுத்த நீங்கள் செலவழிக்கும் நேரத்திற்கு நாங்கள் நன்றியுள்ளவர்களாக இருப்போம். நன்றி!

# suggestions.modal.welcome.text3
source: If you want to ask for help, come and see us on {discord}. We're listening your suggestions and critics.
ta: நீங்கள் உதவி கேட்க விரும்பினால், வந்து எங்களை {டிச்கார்ட் at இல் பார்க்கவும். உங்கள் பரிந்துரைகளையும் விமர்சகர்களையும் நாங்கள் கேட்கிறோம்.

# suggestions.modal.welcome.discord
source: Discord
ta: முரண்பாடு

# suggestions.modal.welcome.btn
source: OK!
ta: சரி!

# remote.code
source: Code
ta: குறியீடு

# remote.last_ip
source: Last ip
ta: கடைசி ஐபி

# remote.last_use
source: Last use
ta: கடைசி பயன்பாடு

# remote.permanent
source: Permanent
ta: நிரந்தர

# remote.token
source: Token
ta: கிள்ளாக்கு

# remote.edit_button
source: Edit line
ta: வரியைத் திருத்து

# remote.delete_button
source: Delete line
ta: வரியை நீக்கு

# remote.edit_success
source: Remote edited with success
ta: வெற்றியுடன் தொலைநிலை திருத்தப்பட்டது

# remote.edit_error
source: Error when editing remote
ta: ரிமோட்டைத் திருத்தும்போது பிழை

# remote.delete_error
source: Error when deleting remote
ta: ரிமோட்டை நீக்கும்போது பிழை

# remote.yes
source: Yes
ta: ஆம்

# remote.no
source: No
ta: இல்லை

# playlists.create
source: Create new playlist
ta: புதிய பிளேலிச்ட்டை உருவாக்கவும்

# playlists.import
source: Import playlist
ta: பிளேலிச்ட்டை இறக்குமதி செய்யுங்கள்

# playlists.karacount
source: {karacount} songs
ta: {karacount} பாடல்கள்

# playlists.duration
source: Duration {duration}
ta: காலம் {duration}

# playlists.public
source: Public
ta: பொது

# playlists.private
source: private
ta: தனிப்பட்ட

# playlists.export
source: Export
ta: ஏற்றுமதி

# playlists.shuffle
source: Shuffle
ta: கலக்கு

# playlists.copy
source: Copy
ta: நகலெடு

# playlists.copy_of
source: Copy of {playlist}
ta: {பிளேலிச்ட் of இன் நகல்

# playlists.edit
source: Edit
ta: தொகு

# playlists.delete
source: Delete
ta: நீக்கு

# playlists.share
source: Share
ta: பங்கு

# playlists.repeat
source: Repeat
ta: மீண்டும்

# playlists.add_karaoke
source: Add a karaoke to playlist
ta: பிளேலிச்ட்டில் ஒரு கரோக்கி சேர்க்கவும்

# playlists.by_owner
source: by {nickname}
ta: மூலம் {nickname}

# playlists.and_contributors
source: (and {contributors})
ta: (மற்றும் {contributors})

# playlists.and_contributors_more
source: (and {contributors}, {count} more)
ta: (மற்றும் {contributors}, {count} மேலும்)

# playlists.my_playlists
source: My playlists
ta: எனது பிளேலிச்ட்கள்

# playlists.community
source: Community
ta: சமூகம்

# playlists.favorites
source: Favorites
ta: பிடித்தவை

# playlists.app_banner
source: This playlist is getting big! If you're planning an event or stream, please use our application instead of {instance} for it. {instance} is NOT online 100% of the time.
ta: இந்த பிளேலிச்ட் பெரிதாகி வருகிறது! நீங்கள் ஒரு நிகழ்வு அல்லது ச்ட்ரீமைத் திட்டமிடுகிறீர்களானால், தயவுசெய்து எங்கள் பயன்பாட்டிற்கு {உதாரணத்திற்கு பதிலாக பயன்படுத்தவும். {instance} ஆன்லைனில் 100% நேரம் இல்லை.

# bans.add
source: Add new ban
ta: புதிய தடையைச் சேர்க்கவும்

# bans.type
source: Type
ta: வகை

# bans.value
source: Value
ta: மதிப்பு

# bans.banned_at
source: Banned at
ta: தடைசெய்யப்பட்டது

# bans.reason
source: Reason
ta: காரணம்

# bans.submit
source: Add
ta: கூட்டு

# bans.delete
source: Remove
ta: அகற்று

# languages.qro
source: Latin Alphabet (Romanization)
ta: லத்தீன் எழுத்துக்கள் (ரோமானிசேசன்)
