Repository: 247i/TACETr
Catalog: உரை/தானி/karaoke-mugen-karaoke-mugen-server-*.po
Languages: ta

# menu.remotes
source: Remotes
ta: தொலைதூரங்கள்

# menu.bans
source: Bans
ta: தடைகள்

# menu.search_users
source: Search users
ta: பயனர்களைத் தேடுங்கள்

# menu.discord
source: Discord
ta: முரண்பாடு

# menu.discourse
source: Forum
ta: மன்றம்

# menu.kara_import
source: Submit a karaoke
ta: கரோக்கை சமர்ப்பிக்கவும்

# menu.kara_suggest
source: Suggest a karaoke
ta: ஒரு கரோக்கை பரிந்துரைக்கவும்

# menu.account
source: Account
ta: கணக்கு

# menu.anime_list
source: My animes
ta: என் அனிம்கள்

# menu.login
source: Login
ta: புகுபதிவு

# menu.logout
source: Logout
ta: வெளியேற்றம்

# menu.register
source: Register
ta: பதிவு செய்யுங்கள்

# menu.connection
source: Login
ta: புகுபதிவு

# menu.switch_language
source: Switch language
ta: மொழியை மாற்றவும்

# profile.favorites
source: Favorites
ta: பிடித்தவை

# profile.you
source: (that's you!)
ta: (அது நீங்கள்!)

# profile.edit
source: Edit profile
ta: சுயவிவரத்தைத் திருத்து

# profile.private
source: Your profile is private, only you can see it.
ta: உங்கள் சுயவிவரம் தனிப்பட்டது, நீங்கள் மட்டுமே அதைப் பார்க்க முடியும்.

# profile.favorites_count
source: {count} favorite | {count} favorites
ta: {count} பிடித்த | {count} பிடித்தவை

# profile.playlists_count
source: {count} playlist | {count} playlists
ta: {count} பிளேலிச்ட் | {count} பிளேலிச்ட்கள்

# profile.anime_list
source: My animes
ta: என் அனிம்கள்

# profile.public_favorites
source: Your favorites are public. Click to hide them.
ta: உங்களுக்கு பிடித்தவை பொது. அவற்றை மறைக்க சொடுக்கு செய்க.

# profile.private_favorites
source: Your favorites are private. Click to show them.
ta: உங்களுக்கு பிடித்தவை தனிப்பட்டவை. அவற்றைக் காட்ட சொடுக்கு செய்க.

# search.placeholder.kara
source: Series, singers, names…
ta: தொடர், பாடகர்கள், பெயர்கள்…

# search.placeholder.user
source: Usernames…
ta: பயனர்பெயர்கள்…

# search.placeholder.tag
source: Tags names…
ta: குறிச்சொற்கள் பெயர்கள்…

# search.placeholder.playlist
source: Names, users…
ta: பெயர்கள், பயனர்கள்…

# search.sort.kara_count
source: Karaoke count
ta: கரோக்கி எண்ணிக்கை

# search.sort.recent
source: By added date
ta: கூடுதல் தேதி மூலம்

# search.sort.most_played
source: Most played
ta: அதிகம் விளையாடியது

# search.sort.most_played_recently
source: Most played (recently)
ta: அதிகம் விளையாடியது (சமீபத்தில்)

# search.sort.most_favorites
source: Most favorites
ta: மிகவும் பிடித்தவை

# search.sort.most_requested
source: Most requested
ta: மிகவும் கோரப்பட்டது

# search.sort.most_requested_recently
source: Most requested (recently)
ta: மிகவும் கோரப்பட்ட (சமீபத்தில்)

# search.sort.likes
source: Most likes
ta: பெரும்பாலான விருப்பங்கள்

# search.sort.languages
source: By languages
ta: மொழிகளால்

# search.sort.duration
source: By durations
ta: கால அளவு

# search.sort.username
source: By usernames
ta: பயனர்பெயர்களால்

# search.next
source: Next page
ta: அடுத்த பக்கம்

# search.previous
source: Previous page
ta: முந்தைய பக்கம்

# search.aria.goto
source: Go to page {0}
ta: {0} பக்கத்திற்குச் செல்லவும்

# search.aria.page
source: Page {0}
ta: பக்கம் {0}

# search.aria.sort
source: Sort by
ta: வரிசைப்படுத்தவும்

# search.types.karaokes
source: Songs
ta: பாடல்கள்

# search.types.users
source: Users
ta: பயனர்கள்

# search.types.favorites
source: User's favorites
ta: பயனரின் பிடித்தவை

# search.types.suggestions
source: Suggestions
ta: பரிந்துரைகள்

# modal.reset_password.description
source: Enter a new password
ta: புதிய கடவுச்சொல்லை உள்ளிடவும்

# modal.reset_password.button
source: Change password
ta: கடவுச்சொல்லை மாற்றவும்

# modal.login.title
source: Login
ta: புகுபதிவு

# modal.login.subtitle
source: Login to view your favorites and edit your profile!
ta: உங்களுக்கு பிடித்தவைகளைக் காணவும், உங்கள் சுயவிவரத்தைத் திருத்தவும் உள்நுழைக!

# modal.login.fields.username.label
source: Username
ta: பயனர்பெயர்

# modal.login.fields.username.placeholder
source: LoveLiveFan93
ta: லவ்லைவ்ஃபான் 93

# modal.login.fields.password.label
source: Password
ta: கடவுச்சொல்

# modal.login.fields.password.placeholder
source: ActuallyIdolM{'@'}sterIsBetter
ta: உண்மையில் {'@'} ச்டெரிச்பெட்டர்

# modal.login.fields.forgot_password.label
source: Forgot your password?
ta: உங்கள் கடவுச்சொல்லை மறந்துவிட்டீர்களா?

# modal.login.fields.forgot_password.error
source: Could not reset your password: contact the the server's administrator your account belongs to.
ta: உங்கள் கடவுச்சொல்லை மீட்டமைக்க முடியவில்லை: சேவையகத்தின் நிர்வாகியைத் தொடர்பு கொள்ளுங்கள் உங்கள் கணக்கு சொந்தமானது.

# modal.login.fields.forgot_password.success
source: An email has been sent with a link to reset your password.
ta: உங்கள் கடவுச்சொல்லை மீட்டமைக்க இணைப்புடன் மின்னஞ்சல் அனுப்பப்பட்டுள்ளது.

# modal.login.submit
source: Login
ta: புகுபதிவு

# modal.signup.title
source: Sign up
ta: பதிவு செய்க

# modal.signup.subtitle
source: Register to save your favorites and create your profile!
ta: உங்களுக்கு பிடித்தவைகளைச் சேமித்து உங்கள் சுயவிவரத்தை உருவாக்க பதிவு செய்யுங்கள்!

# modal.signup.fields.username.label
source: Username
ta: பயனர்பெயர்

# modal.signup.fields.username.placeholder
source: LoveLiveFan93
ta: லவ்லைவ்ஃபான் 93

# modal.signup.fields.password.label
source: Password
ta: கடவுச்சொல்

# modal.signup.fields.password.placeholder
source: ActuallyIdolM{'@'}sterIsBetter
ta: உண்மையில் {'@'} ச்டெரிச்பெட்டர்

# modal.signup.fields.password_confirmation.label
source: Password Confirmation
ta: கடவுச்சொல் உறுதிப்படுத்தல்

# modal.signup.fields.password_confirmation.placeholder
source: ActuallyIdolM{'@'}sterIsBetter
ta: உண்மையில் {'@'} ச்டெரிச்பெட்டர்

# modal.signup.fields.email.label
source: Email
ta: மின்னஞ்சல்

# modal.signup.fields.email.placeholder
source: test{'@'}shelter.moe
ta: சோதனை

# modal.signup.passwords_mismatch
source: Passwords do not match
ta: கடவுச்சொற்கள் பொருந்தவில்லை

# modal.signup.submit
source: Sign up
ta: பதிவு செய்க

# modal.profile.title
source: Edit profile
ta: சுயவிவரத்தைத் திருத்து

# modal.profile.headers.profile
source: About
ta: பற்றி

# modal.profile.headers.privacy
source: Privacy
ta: தனியுரிமை

# modal.profile.headers.lang
source: Language preferences
ta: மொழி விருப்பத்தேர்வுகள்

# modal.profile.headers.password
source: Change password
ta: கடவுச்சொல்லை மாற்றவும்

# modal.profile.fields.username.label
source: Username
ta: பயனர்பெயர்

# modal.profile.fields.nickname.label
source: Nickname
ta: புனைப்பெயர்

# modal.profile.fields.nickname.placeholder
source: LoveLiveFan93
ta: லவ்லைவ்ஃபான் 93

# modal.profile.fields.password.label
source: Password
ta: கடவுச்சொல்

# modal.profile.fields.password.placeholder
source: ReallyIPreferIdolM{'@'}ster
ta: Gealipreferidolm {'@'} ster

# modal.profile.fields.password_confirmation.label
source: Password confirmation
ta: கடவுச்சொல் உறுதிப்படுத்தல்

# modal.profile.fields.password_confirmation.placeholder
source: ReallyIPreferIdolM{'@'}ster
ta: Gealipreferidolm {'@'} ster

# modal.profile.fields.email.label
source: Email
ta: மின்னஞ்சல்

# modal.profile.fields.email.placeholder
source: test{'@'}shelter.moe
ta: சோதனை

# modal.profile.fields.url.label
source: Website
ta: வலைத்தளம்

# modal.profile.fields.bio.label
source: Biography
ta: சுயசரிதை

# modal.profile.fields.bio.placeholder
source: It' s my life
ta: இது என் வாழ்க்கை

# modal.profile.fields.location.label
source: Location
ta: இடம்

# modal.profile.fields.discord.label
source: Discord
ta: முரண்பாடு

# modal.profile.fields.discord.placeholder
source: Karak#1423
ta: கராக்#1423

# modal.profile.fields.twitter.label
source: Twitter
ta: ட்விட்டர்

# modal.profile.fields.twitter.placeholder
source: KaraokeMugen
ta: கரோகேசென்

# modal.profile.fields.bluesky.label
source: Bluesky
ta: ப்ளூச்கி

# modal.profile.fields.mastodon.label
source: Mastodon
ta: மாச்டோடன்

# modal.profile.fields.mastodon.placeholder
source: karaokemugen{'@'}shelter.moe
ta: karaokemugen {'@' resshelter.moe

# modal.profile.fields.instagram.label
source: Instagram
ta: இன்ச்டாகிராம்

# modal.profile.fields.instagram.placeholder
source: karaokemugen
ta: கரோகேசென்

# modal.profile.fields.twitch.label
source: Twitch
ta: இழுப்பு

# modal.profile.fields.twitch.placeholder
source: KaraokeLive
ta: கரோக்லைவ்

# modal.profile.fields.myanimelist.label
source: MyAnimeList
ta: மியானிமலிச்ட்

# modal.profile.fields.myanimelist.placeholder
source: karaokemugen
ta: கரோகேசென்

# modal.profile.fields.anilist.label
source: AniList
ta: அனிலிச்ட்

# modal.profile.fields.anilist.placeholder
source: karaokemugen
ta: கரோகேசென்

# modal.profile.fields.kitsu.label
source: Kitsu
ta: இறுக்கமான

# modal.profile.fields.kitsu.placeholder
source: karaokemugen
ta: கரோகேசென்

# modal.profile.fields.gitlab.label
source: Gitlab
ta: அறிவிலிஆய்வு

# modal.profile.fields.gitlab.placeholder
source: karaokemugen
ta: கரோகேசென்

# modal.profile.fields.anime_list_to_fetch.label
source: Anime list to fetch
ta: பெற அனிம் பட்டியல்

# modal.profile.fields.banner.label
source: Banner
ta: பேனர்

# modal.profile.fields.banner.remove
source: Reset to the default banner
ta: இயல்புநிலை பேனருக்கு மீட்டமைக்கவும்

# modal.profile.fields.banner.upload
source: Upload a banner
ta: ஒரு பேனரைப் பதிவேற்றவும்

# modal.profile.fields.banner.change
source: To change your banner, go to the page of a karaoke and click the "Use as profile banner" button. Fully customizable banners is a donator feature.
ta: உங்கள் பேனரை மாற்ற, கரோக்கின் பக்கத்திற்குச் சென்று "சுயவிவர பேனராகப் பயன்படுத்தவும்" பொத்தானைக் சொடுக்கு செய்க. முழுமையாக தனிப்பயனாக்கக்கூடிய பதாகைகள் ஒரு நன்கொடையாளர் அம்சமாகும்.

# modal.profile.fields.banner.donator
source: Thanks for your support, you're awesome! You can upload a custom banner or use one from a karaoke of your choice.
ta: உங்கள் ஆதரவுக்கு நன்றி, நீங்கள் அருமை! நீங்கள் தனிப்பயன் பேனரைப் பதிவேற்றலாம் அல்லது நீங்கள் விரும்பும் கரோக்கிலிருந்து ஒன்றைப் பயன்படுத்தலாம்.

# modal.profile.fields.flag_public.label
source: Public profile
ta: பொது சுயவிவரம்

# modal.profile.fields.flag_public.checkbox
source: Make my profile public
ta: எனது சுயவிவரத்தை பகிரங்கப்படுத்துங்கள்

# modal.profile.fields.flag_public.desc
source: By default, your account is visible via the user search and shows all the above informations with the exception of the e-mail address. If you uncheck this box, your account will not be available anymore in the search results (you will be the only one to be able to see it, once you've logged in).
ta: இயல்பாக, உங்கள் கணக்கு பயனர் தேடல் வழியாகத் தெரியும் மற்றும் மின்னஞ்சல் முகவரியைத் தவிர்த்து மேலே உள்ள அனைத்து தகவல்களையும் காட்டுகிறது. இந்த பெட்டியைத் தேர்வுசெய்தால், தேடல் முடிவுகளில் உங்கள் கணக்கு இனி கிடைக்காது (நீங்கள் உள்நுழைந்ததும் அதைப் பார்க்க முடியும்).

# modal.profile.fields.flag_displayfavorites.label
source: Favorites
ta: பிடித்தவை

# modal.profile.fields.flag_displayfavorites.checkbox
source: Show my favorites
ta: எனக்கு பிடித்தவைகளைக் காட்டு

# modal.profile.fields.flag_displayfavorites.desc
source: Along with showing your public profile, you can showcase your favorites (therefore your taste) to everyone. This option is disabled by default. To show your favorites, your profile must be public in the first place.
ta: உங்கள் பொது சுயவிவரத்தைக் காண்பிப்பதோடு, உங்களுக்கு பிடித்தவைகளை (எனவே உங்கள் சுவை) அனைவருக்கும் காண்பிக்கலாம். இந்த விருப்பம் இயல்பாக முடக்கப்பட்டுள்ளது. உங்களுக்கு பிடித்தவைகளைக் காட்ட, உங்கள் சுயவிவரம் முதலில் பொதுவில் இருக்க வேண்டும்.

# modal.profile.fields.flag_sendstats.label
source: Stats
ta: புள்ளிவிவரங்கள்

# modal.profile.fields.flag_sendstats.checkbox
source: Use my favorites and karaoke requests for stats
ta: புள்ளிவிவரங்களுக்கான எனக்கு பிடித்தவை மற்றும் கரோக்கி கோரிக்கைகளைப் பயன்படுத்தவும்

# modal.profile.fields.lang_prefs.main_song_name_lang
source: Song name display preference
ta: பாடல் பெயர் காட்சி விருப்பம்

# modal.profile.fields.lang_prefs.fallback_song_name_lang
source: Fallback song name display preference
ta: குறைவடையும் பாடல் பெயர் காட்சி விருப்பம்

# modal.profile.passwords_mismatch
source: Passwords do not match
ta: கடவுச்சொற்கள் பொருந்தவில்லை

# modal.profile.submit
source: Save
ta: சேமி

# modal.profile.delete
source: Delete account
ta: கணக்கை நீக்கு

# modal.profile.select_avatar
source: Select an avatar
ta: அவதாரத்தைத் தேர்ந்தெடுக்கவும்

# modal.add_repository.button
source: Repository :
ta: களஞ்சியம்:

# modal.add_repository.label
source: Add this repository to your Karaoke Mugen app!
ta: உங்கள் கரோக்கி முகன் பயன்பாட்டில் இந்த களஞ்சியத்தைச் சேர்க்கவும்!

# modal.add_repository.desc
source: You can add this repository to your Karaoke Mugen app by clicking on the button below. If Karaoke Mugen is not installed on your computer, this button will have no effect.
ta: கீழேயுள்ள பொத்தானைக் சொடுக்கு செய்வதன் மூலம் இந்த களஞ்சியத்தை உங்கள் கரோக்கி முகன் பயன்பாட்டில் சேர்க்கலாம். உங்கள் கணினியில் கரோக்கி முகன் நிறுவப்படவில்லை என்றால், இந்த பொத்தான் எந்த விளைவையும் ஏற்படுத்தாது.

# modal.add_repository.download
source: The application can be downloaded here.
ta: பயன்பாட்டை இங்கே பதிவிறக்கம் செய்யலாம்.

# modal.add_repository.manual
source: To manually add this repository, open your Karaoke Mugen application, add the {repository} repository to it, checking "{online}".
ta: இந்த களஞ்சியத்தை கைமுறையாகச் சேர்க்க, உங்கள் கரோக்கி முகன் பயன்பாட்டைத் திறக்கவும், அதற்கு {repository} களஞ்சியத்தைச் சேர்க்கவும், "{online}" ஐச் சரிபார்க்கவும்.

# modal.add_repository.online
source: Online
ta: ஆன்லைனில்

# modal.add_repository.add
source: Add
ta: கூட்டு

# modal.add_repository.cancel
source: Cancel
ta: ரத்துசெய்

# modal.delete_account.label
source: Do you really want to delete your account?
ta: உங்கள் கணக்கை நீக்க விரும்புகிறீர்களா?

# modal.delete_account.add
source: Delete account
ta: கணக்கை நீக்கு

# modal.delete_account.cancel
source: Cancel
ta: ரத்துசெய்

# modal.suggest.title
source: Suggestion
ta: பரிந்துரை

# modal.suggest.subtitle
source: You couldn't find what you've searched for? You can submit a suggestion.
ta: நீங்கள் தேடியதை நீங்கள் கண்டுபிடிக்க முடியவில்லை? நீங்கள் ஒரு ஆலோசனையை சமர்ப்பிக்கலாம்.

# modal.suggest.fields.title.label
source: Title
ta: தலைப்பு

# modal.suggest.fields.title.placeholder
source: JINGO JUNGLE
ta: சிங்கோ சங்கிள்

# modal.suggest.fields.series.label
source: Series / Singer
ta: தொடர் / பாடகர்

# modal.suggest.fields.series.placeholder
source: Yôjo Senki: Saga of Tanya the Evil
ta: யசோ யாரும்: பண்ணையின் சாகா தீமை

# modal.suggest.fields.type.label
source: Type
ta: வகை

# modal.suggest.fields.link.label
source: Link
ta: இணைப்பு

# modal.suggest.fields.name.label
source: Your name
ta: உங்கள் பெயர்

# modal.suggest.fields.name.placeholder
source: Magic anonymous
ta: மேசிக் அநாமதேய

# modal.suggest.submit
source: Submit
ta: சமர்ப்பிக்கவும்

# modal.suggest.submitted.subtitle
source: Message heard loud and clear!
ta: செய்தி சத்தமாகவும் தெளிவாகவும் கேட்டது!

# modal.suggest.submitted.text
source: Your suggestion was received, you can check its status by clicking {here}.
ta: உங்கள் பரிந்துரை பெறப்பட்டது, {here} என்பதைக் சொடுக்கு செய்வதன் மூலம் அதன் நிலையை சரிபார்க்கலாம்.

# modal.suggest.submitted.here
source: here
ta: இங்கே

# modal.suggest.submitted.close
source: Close
ta: மூடு

# modal.download.label
source: Download karaoke
ta: கரோக்கி பதிவிறக்கவும்

# modal.download.cancel
source: Cancel
ta: ரத்துசெய்

# modal.download.karabundle
source: Download data (.json)
ta: தரவைப் பதிவிறக்குக (.json)

# modal.download.subtitles
source: Download lyrics (.{format})
ta: பாடல் வரிகளைப் பதிவிறக்குக (. {format})

# modal.download.media
source: Download media (.{format})
ta: மீடியாவைப் பதிவிறக்குக (. {format})

# modal.download.media_hardsub
source: Download media including subtitles (hardsub .mp4)
ta: வசன வரிகள் உள்ளிட்ட ஊடகங்களைப் பதிவிறக்கவும் (ஆர்ட்சப் .mp4)

# modal.crop.label
source: Crop avatar
ta: பயிர் அவதார்

# modal.crop.add
source: Add
ta: கூட்டு

# modal.crop.cancel
source: Cancel
ta: ரத்துசெய்

# modal.join_kara.label
source: Join a karaoke party
ta: கரோக்கி விருந்தில் சேரவும்

# modal.join_kara.desc
source: Enter a code to join an existing karaoke party
ta: ஏற்கனவே உள்ள கரோக்கி விருந்தில் சேர ஒரு குறியீட்டை உள்ளிடவும்

# modal.join_kara.add
source: Join
ta: சேர

# modal.join_kara.cancel
source: Cancel
ta: ரத்துசெய்

# modal.join_kara.help
source: Enter the session code (usually 4 letters) or the karaoke URL.
ta: அமர்வு குறியீடு (பொதுவாக 4 எழுத்துக்கள்) அல்லது கரோக்கி முகவரி ஐ உள்ளிடவும்.

# modal.join_kara.error
source: The code is invalid, please check what you typed.
ta: குறியீடு தவறானது, நீங்கள் தட்டச்சு செய்ததைச் சரிபார்க்கவும்.

# modal.stats.label
source: Use my favorites and songs requests for stats
ta: எனக்கு பிடித்தவை மற்றும் புள்ளிவிவரங்களுக்கான பாடல்கள் கோரிக்கைகளைப் பயன்படுத்தவும்

# modal.stats.desc
source: We use your favorites as well as the songs that you have requested during a session to make usage statistics (for example, to find out the most popular songs).
ta: பயன்பாட்டு புள்ளிவிவரங்களை உருவாக்க ஒரு அமர்வின் போது நீங்கள் கோரிய பாடல்களையும் (எடுத்துக்காட்டாக, மிகவும் பிரபலமான பாடல்களைக் கண்டறிய) பயன்படுத்துகிறோம்.

# modal.stats.refuse_desc
source: If you do not want to participate, even if it's anonymous, in these usage statistics, please let us know. If you refuse, your data will be ignored by the server and not sent by the Karaoke Mugen Application.
ta: நீங்கள் பங்கேற்க விரும்பவில்லை என்றால், அது அநாமதேயராக இருந்தாலும், இந்த பயன்பாட்டு புள்ளிவிவரங்களில், தயவுசெய்து எங்களுக்குத் தெரியப்படுத்துங்கள். நீங்கள் மறுத்தால், உங்கள் தரவு சேவையகத்தால் புறக்கணிக்கப்படும் மற்றும் கரோக்கி முகன் பயன்பாட்டால் அனுப்பப்படாது.

# modal.stats.change
source: You can change this at any time in your profile. Do you accept the usage of your stats?
ta: உங்கள் சுயவிவரத்தில் எந்த நேரத்திலும் இதை மாற்றலாம். உங்கள் புள்ளிவிவரங்களின் பயன்பாட்டை நீங்கள் ஏற்றுக்கொள்கிறீர்களா?

# modal.stats.yes
source: Yes
ta: ஆம்

# modal.stats.no
source: No
ta: இல்லை

# modal.set_banner.label
source: Choose a banner
ta: ஒரு பேனரைத் தேர்வுசெய்க

# modal.set_banner.catch
source: Customize your profile with a wonderful banner! Scroll through the banners and confirm your choice.
ta: அற்புதமான பேனருடன் உங்கள் சுயவிவரத்தைத் தனிப்பயனாக்குங்கள்! பதாகைகள் மூலம் உருட்டி, உங்கள் விருப்பத்தை உறுதிப்படுத்தவும்.

# modal.set_banner.cancel
source: Cancel
ta: ரத்துசெய்

# modal.set_banner.set
source: Use this image
ta: இந்த படத்தைப் பயன்படுத்தவும்

# modal.set_banner.next
source: Next image
ta: அடுத்த படம்

# modal.set_banner.previous
source: Previous image
ta: முந்தைய படம்

# modal.set_banner.one
source: There is only one banner for audio only songs.
ta: ஆடியோ மட்டுமே பாடல்களுக்கு ஒரே ஒரு பேனர் மட்டுமே உள்ளது.

# modal.create_edit_playlist.title_create
source: Create playlist
ta: பிளேலிச்ட்டை உருவாக்கவும்

# modal.create_edit_playlist.title_edit
source: Edit playlist
ta: பிளேலிச்ட்டைத் திருத்து

# modal.create_edit_playlist.name
source: Name
ta: பெயர்

# modal.create_edit_playlist.description
source: Description
ta: விவரம்

# modal.create_edit_playlist.contributors
source: Contributors
ta: பங்களிப்பாளர்கள்

# modal.create_edit_playlist.public
source: Public
ta: பொது

# modal.create_edit_playlist.submit_create
source: Save
ta: சேமி

# modal.create_edit_playlist.submit_edit
source: Edit
ta: தொகு

# modal.delete_playlist.label
source: Do you really want to delete playlist '{name}'?
ta: பிளேலிச்ட்டை '{name}' நீக்க விரும்புகிறீர்களா?

# modal.delete_playlist.add
source: Delete playlist
ta: பிளேலிச்ட்டை நீக்கு

# modal.delete_playlist.cancel
source: Cancel
ta: ரத்துசெய்

# modal.add_duplicate_in_playlist.label
source: The karaoke is already in the playlist '{name}'.
ta: கரோக்கி ஏற்கனவே பிளேலிச்ட்டில் '{name}' இல் உள்ளது.

# modal.add_duplicate_in_playlist.add
source: Add anyway
ta: எப்படியும் சேர்க்கவும்

# modal.add_duplicate_in_playlist.cancel
source: Cancel
ta: ரத்துசெய்

# modal.create_tag.title
source: Quick tag create
ta: விரைவான குறிச்சொல் உருவாக்கு

# modal.create_tag.submit
source: Save
ta: சேமி

# modal.create_tag.name
source: Name
ta: பெயர்

# modal.create_tag.types
source: Tag types
ta: குறிச்சொல் வகைகள்

# titles.home
source: Home
ta: வீடு

# toast.LOG_ERROR
source: Incorrect credentials.
ta: தவறான நற்சான்றிதழ்கள்.

# toast.USER_ASCII_CHARACTERS_ONLY
source: Only alphanumeric characters in your username please (you can change your nickname later to whatever you wish).
ta: தயவுசெய்து உங்கள் பயனர்பெயரில் உள்ள எண்ணெழுத்து எழுத்துக்கள் மட்டுமே (உங்கள் புனைப்பெயரை நீங்கள் விரும்பியதை மாற்றலாம்).

# toast.USER_CREATED
source: User successfully created
ta: பயனர் வெற்றிகரமாக உருவாக்கப்பட்டது

# toast.GENERATED_KARA
source: Karaoke sent successfully.
ta: கரோக்கி வெற்றிகரமாக அனுப்பினார்.

# toast.EDITED_KARA
source: Modification sent successfully.
ta: மாற்றம் வெற்றிகரமாக அனுப்பப்பட்டது.

# toast.IMPORT_KARA_ERROR
source: Unable to send karaoke.
ta: கரோக்கி அனுப்ப முடியவில்லை.

# toast.EDIT_KARA_ERROR
source: Unable to send the edit.
ta: திருத்தத்தை அனுப்ப முடியவில்லை.

# toast.FILE_UPLOADED
source: File uploaded.
ta: கோப்பு பதிவேற்றப்பட்டது.

# toast.USER_EDITED
source: User successfully edited
ta: பயனர் வெற்றிகரமாக திருத்தப்பட்டார்

# toast.TAG_CREATED
source: Tag successfully created
ta: குறிச்சொல் வெற்றிகரமாக உருவாக்கப்பட்டது

# toast.USER_DELETED
source: User successfully deleted
ta: பயனர் வெற்றிகரமாக நீக்கப்பட்டார்

# toast.PASSWORD_UPDATED
source: Password successfully updated
ta: கடவுச்சொல் வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# toast.ADD_FAVORITE_ERROR
source: Unable to add this song to your favorites
ta: இந்த பாடலை உங்களுக்கு பிடித்தவைகளில் சேர்க்க முடியவில்லை

# toast.REMOVE_FAVORITE_ERROR
source: Unable to remove this song from your favorites
ta: இந்த பாடலை உங்களுக்கு பிடித்தவைகளிலிருந்து அகற்ற முடியவில்லை

# toast.POST_SUGGESTION_ERROR
source: Unable to send suggestion
ta: ஆலோசனையை அனுப்ப முடியவில்லை

# toast.NO_KARA_FOUND
source: No song found
ta: பாடல் எதுவும் கிடைக்கவில்லை

# toast.GET_KARA_ERROR
source: Error getting song
ta: பாடல் பெறுவது பிழை

# toast.GET_KARAS_ERROR
source: Error getting song list
ta: பாடல் பட்டியலைப் பெறுவதில் பிழை

# toast.GET_BASESTATS_ERROR
source: Error getting stats
ta: புள்ளிவிவரங்களைப் பெறுவதில் பிழை

# toast.GET_YEARS_ERROR
source: Error getting year list
ta: ஆண்டு பட்டியலைப் பெறுவதில் பிழை

# toast.GET_FAVORITES_FROM_USER_FORBIDDEN_ERROR
source: This user's favorites aren't public
ta: இந்த பயனரின் பிடித்தவை பொதுவில் இல்லை

# toast.GET_FAVORITES_FROM_USER_NOT_FOUND_ERROR
source: No user found
ta: பயனர் எதுவும் கிடைக்கவில்லை

# toast.NEW_KARA_ISSUE_ERROR
source: Unable to create issue
ta: சிக்கலை உருவாக்க முடியவில்லை

# toast.BAD_IMPORT_DATA_ERROR
source: Data format error
ta: தரவு வடிவமைப்பு பிழை

# toast.GET_SUGGESTIONS_ERROR
source: Unable to get suggestions
ta: பரிந்துரைகளைப் பெற முடியவில்லை

# toast.GET_SUGGESTIONS_LANGUAGES_ERROR
source: Unable to get suggestion languages
ta: பரிந்துரை மொழிகளைப் பெற முடியவில்லை

# toast.UPDATE_SUGGESTION_LIKE_ERROR
source: Unable to like this song
ta: இந்த பாடலை விரும்பவில்லை

# toast.ADD_SUGGESTION_ERROR
source: Unable to send suggestion
ta: ஆலோசனையை அனுப்ப முடியவில்லை

# toast.REMOVE_SUGGESTION_ERROR
source: Unable to remove suggestion
ta: ஆலோசனையை அகற்ற முடியவில்லை

# toast.GET_TAGS_ERROR
source: Error getting tags
ta: குறிச்சொற்களைப் பெறுவதில் பிழை

# toast.GET_USER_ERROR
source: Error getting user
ta: பயனரைப் பெறுவதில் பிழை

# toast.GET_USERS_ERROR
source: Error getting user list
ta: பயனர் பட்டியலைப் பெறுவதில் பிழை

# toast.CREATE_USER_ERROR
source: Error creating user
ta: பயனரை உருவாக்கும் பிழை

# toast.WRONG_AVATAR_FILE_TYPE
source: Bad avatar file type
ta: மோசமான அவதார் கோப்பு வகை

# toast.AVATAR_ERROR
source: Error importing avatar file
ta: அவதார் கோப்பை இறக்குமதி செய்வதில் பிழை

# toast.WRONG_BANNER_FILE_TYPE
source: Bad banner file type
ta: மோசமான பேனர் கோப்பு வகை

# toast.BANNER_NOT_GENERATED_YET
source: Banner hasn't been generated yet!
ta: பேனர் இன்னும் உருவாக்கப்படவில்லை!

# toast.BANNER_BANNED
source: This banner cannot be used
ta: இந்த பேனரைப் பயன்படுத்த முடியாது
