Repository: 247i/TACETr
Catalog: உரை/தானி/kavita-backend-*.po
Languages: ta

# confirm-email
source: You must confirm your email first
ta: முதலில் உங்கள் மின்னஞ்சலை உறுதிப்படுத்த வேண்டும்

# locked-out
source: You've been locked out from too many authorization attempts. Please wait 10 minutes.
ta: பல அங்கீகார முயற்சிகளிலிருந்து நீங்கள் பூட்டப்பட்டுள்ளீர்கள். தயவுசெய்து 10 நிமிடங்கள் காத்திருக்கவும்.

# disabled-account
source: Your account is disabled. Contact the server admin.
ta: உங்கள் கணக்கு முடக்கப்பட்டுள்ளது. சேவையக நிர்வாகியைத் தொடர்பு கொள்ளுங்கள்.

# register-user
source: Something went wrong when registering user
ta: பயனரை பதிவு செய்யும் போது ஏதோ தவறு ஏற்பட்டது

# validate-email
source: There was an issue validating your email: {0}
ta: உங்கள் மின்னஞ்சலை உறுதிப்படுத்தும் சிக்கல் இருந்தது: {0}

# confirm-token-gen
source: There was an issue generating a confirmation token
ta: உறுதிப்படுத்தல் கிள்ளாக்கை உருவாக்கும் சிக்கல் இருந்தது

# denied
source: Not allowed
ta: அனுமதிக்கப்படவில்லை

# permission-denied
source: You are not permitted to this operation
ta: இந்த நடவடிக்கைக்கு நீங்கள் அனுமதிக்கப்படவில்லை

# password-required
source: You must enter your existing password to change your account unless you're an admin
ta: நீங்கள் ஒரு நிர்வாகி இல்லையென்றால் உங்கள் கணக்கை மாற்ற உங்கள் ஏற்கனவே உள்ள கடவுச்சொல்லை உள்ளிட வேண்டும்

source: Invalid Password
ta: தவறான கடவுச்சொல்

source: Invalid token
ta: தவறான கிள்ளாக்கு

# unable-to-reset-key
source: Something went wrong, unable to reset key
ta: விசையை மீட்டமைக்க முடியாமல் ஏதோ தவறு நடந்தது

source: Invalid payload
ta: தவறான பேலோட்

source: Nothing to do
ta: செய்ய எதுவும் இல்லை

# share-multiple-emails
source: You cannot share emails across multiple accounts
ta: பல கணக்குகளில் மின்னஞ்சல்களைப் பகிர முடியாது

# generate-token
source: There was an issue generating a confirmation email token. See logs
ta: உறுதிப்படுத்தல் மின்னஞ்சல் கிள்ளாக்கை உருவாக்கும் சிக்கல் இருந்தது. பதிவுகள் பார்க்கவும்

# age-restriction-update
source: There was an error updating the age restriction
ta: அகவை கட்டுப்பாட்டை புதுப்பிப்பதில் பிழை ஏற்பட்டது

# no-user
source: User does not exist
ta: பயனர் இல்லை

# username-taken
source: Username already taken
ta: ஏற்கனவே எடுக்கப்பட்ட பயனர்பெயர்

# email-taken
source: Email already in use
ta: ஏற்கனவே பயன்பாட்டில் உள்ள மின்னஞ்சல்

# user-already-confirmed
source: User is already confirmed
ta: பயனர் ஏற்கனவே உறுதிப்படுத்தப்பட்டுள்ளது

# generic-user-update
source: There was an exception when updating the user
ta: பயனரைப் புதுப்பிக்கும்போது விதிவிலக்கு இருந்தது

# manual-setup-fail
source: Manual setup is unable to be completed. Please cancel and recreate the invite
ta: கையேடு அமைப்பை முடிக்க முடியவில்லை. தயவுசெய்து அழைப்பை ரத்து செய்து மீண்டும் உருவாக்கவும்

# user-already-registered
source: User is already registered as {0}
ta: பயனர் ஏற்கனவே {0 அச் என பதிவு செய்யப்பட்டுள்ளார்

# user-already-invited
source: User is already invited under this email and has yet to accepted invite.
ta: பயனர் ஏற்கனவே இந்த மின்னஞ்சலின் கீழ் அழைக்கப்படுகிறார், மேலும் அழைப்பை இன்னும் ஏற்கவில்லை.

# generic-invite-user
source: There was an issue inviting the user. Please check logs.
ta: பயனரை அழைக்கும் சிக்கல் இருந்தது. பதிவுகளை சரிபார்க்கவும்.

source: Invalid email confirmation
ta: தவறான மின்னஞ்சல் உறுதிப்படுத்தல்

# generic-user-email-update
source: Unable to update email for user. Check logs.
ta: பயனருக்கான மின்னஞ்சலைப் புதுப்பிக்க முடியவில்லை. பதிவுகளை சரிபார்க்கவும்.

# generic-password-update
source: There was an unexpected error when confirming new password
ta: புதிய கடவுச்சொல்லை உறுதிப்படுத்தும்போது எதிர்பாராத பிழை ஏற்பட்டது

source: Password Updated
ta: கடவுச்சொல் புதுப்பிக்கப்பட்டது

# forgot-password-generic
source: An email will be sent to the email if it exists in our database
ta: எங்கள் தரவுத்தளத்தில் இருந்தால் மின்னஞ்சல் அனுப்பப்படும்

# not-accessible-password
source: Your server is not accessible. The link to reset your password is in the logs
ta: உங்கள் சேவையகம் அணுக முடியாது. உங்கள் கடவுச்சொல்லை மீட்டமைப்பதற்கான இணைப்பு பதிவுகளில் உள்ளது

# invalid-email
source: The email on file for user is not a valid email. See logs for any links.
ta: பயனருக்கான கோப்பில் உள்ள மின்னஞ்சல் சரியான மின்னஞ்சல் அல்ல. எந்த இணைப்புகளுக்கான பதிவுகளையும் காண்க.

# not-accessible
source: Your server is not accessible externally
ta: உங்கள் சேவையகம் வெளிப்புறமாக அணுக முடியாது

source: Email sent
ta: மின்னஞ்சல் அனுப்பப்பட்டது

# user-migration-needed
source: This user needs to migrate. Have them log out and login to trigger a migration flow
ta: இந்த பயனர் இடம்பெயர வேண்டும். இடம்பெயர்வு ஓட்டத்தைத் தூண்டுவதற்கு அவை வெளியேறி உள்நுழைய வேண்டும்

# generic-invite-email
source: There was an issue resending invite email
ta: அழைப்பு மின்னஞ்சல் மீண்டும் ஒரு சிக்கல் இருந்தது

source: Admin already exists
ta: நிர்வாகி ஏற்கனவே உள்ளது

source: Invalid username
ta: தவறான பயனர்பெயர்

# critical-email-migration
source: There was an issue during email migration. Contact support
ta: மின்னஞ்சல் இடம்பெயர்வு போது ஒரு சிக்கல் இருந்தது. தொடர்பு உதவி

# email-not-enabled
source: Email is not enabled on this server. You cannot perform this action.
ta: இந்த சேவையகத்தில் மின்னஞ்சல் இயக்கப்படவில்லை. இந்த செயலை நீங்கள் செய்ய முடியாது.

# account-email-invalid
source: The email on file for the admin account is not a valid email. Cannot send test email.
ta: நிர்வாகக் கணக்கிற்கான கோப்பில் உள்ள மின்னஞ்சல் சரியான மின்னஞ்சல் அல்ல. சோதனை மின்னஞ்சலை அனுப்ப முடியாது.

# email-settings-invalid
source: Email settings missing information. Ensure all email settings are saved.
ta: மின்னஞ்சல் அமைப்புகள் காணவில்லை. அனைத்து மின்னஞ்சல் அமைப்புகளும் சேமிக்கப்படுவதை உறுதிசெய்க.

# chapter-doesnt-exist
source: Chapter does not exist
ta: அத்தியாயம் இல்லை

# file-missing
source: File was not found in book
ta: கோப்பு புத்தகத்தில் காணப்படவில்லை

# collection-updated
source: Collection updated successfully
ta: சேகரிப்பு வெற்றிகரமாக புதுப்பிக்கப்பட்டது

source: Collection deleted
ta: சேகரிப்பு நீக்கப்பட்டது

# generic-error
source: Something went wrong, please try again
ta: ஏதோ தவறு நடந்தது, தயவுசெய்து மீண்டும் முயற்சிக்கவும்

# collection-doesnt-exist
source: Collection does not exist
ta: சேகரிப்பு இல்லை

source: Collection already exists
ta: சேகரிப்பு ஏற்கனவே உள்ளது

# error-import-stack
source: There was an issue importing MAL stack
ta: மால் ச்டேக்கை இறக்குமதி செய்வதில் சிக்கல் இருந்தது

# person-doesnt-exist
source: Person does not exist
ta: நபர் இல்லை

# person-name-required
source: Person name is required and must not be null
ta: நபரின் பெயர் தேவை மற்றும் பூச்யமாக இருக்கக்கூடாது

# person-name-unique
source: Person name must be unique
ta: நபரின் பெயர் தனித்துவமாக இருக்க வேண்டும்

# person-image-doesnt-exist
source: Person does not exist in CoversDB
ta: கவர்ச்டிபியில் நபர் இல்லை

# device-doesnt-exist
source: Device does not exist
ta: சாதனம் இல்லை

# generic-device-create
source: There was an error when creating the device
ta: சாதனத்தை உருவாக்கும் போது பிழை ஏற்பட்டது

# generic-device-update
source: There was an error when updating the device
ta: சாதனத்தைப் புதுப்பிக்கும்போது பிழை ஏற்பட்டது

# generic-device-delete
source: There was an error when deleting the device
ta: சாதனத்தை நீக்கும்போது பிழை ஏற்பட்டது

# greater-0
source: {0} must be greater than 0
ta: {0} 0 ஐ விட அதிகமாக இருக்க வேண்டும்

# send-to-kavita-email
source: Send to device cannot be used without Email setup
ta: மின்னஞ்சல் அமைவு இல்லாமல் சாதனத்திற்கு அனுப்பு பயன்படுத்த முடியாது

# send-to-unallowed
source: You cannot send to a device that isn't yours
ta: உங்களுடையது இல்லாத சாதனத்திற்கு நீங்கள் அனுப்ப முடியாது

# send-to-size-limit
source: The file(s) you are trying to send are too large for your email provider
ta: நீங்கள் அனுப்ப முயற்சிக்கும் கோப்பு (கள்) உங்கள் மின்னஞ்சல் வழங்குநருக்கு மிகப் பெரியது

# send-to-device-status
source: Transferring files to your device
ta: உங்கள் சாதனத்திற்கு கோப்புகளை மாற்றுகிறது

# generic-send-to
source: There was an error sending the file(s) to the device
ta: சாதனத்திற்கு கோப்பு (களை) அனுப்புவதில் பிழை ஏற்பட்டது

# series-doesnt-exist
source: Series does not exist
ta: தொடர் இல்லை

# volume-doesnt-exist
source: Volume does not exist
ta: தொகுதி இல்லை

# bookmarks-empty
source: Bookmarks cannot be empty
ta: புக்மார்க்குகள் காலியாக இருக்க முடியாது

source: No cover image
ta: கவர் படம் இல்லை

# bookmark-doesnt-exist
source: Bookmark does not exist
ta: புக்மார்க்கு இல்லை

# must-be-defined
source: {0} must be defined
ta: {0} வரையறுக்கப்பட வேண்டும்

# generic-favicon
source: There was an issue fetching favicon for domain
ta: டொமைனுக்கு ஃபேவிகானைப் பெறுவதில் சிக்கல் இருந்தது

source: Invalid Filename
ta: தவறான கோப்பு பெயர்

# file-doesnt-exist
source: File does not exist
ta: கோப்பு இல்லை

# library-name-exists
source: Library name already exists. Please choose a unique name to the server.
ta: நூலக பெயர் ஏற்கனவே உள்ளது. சேவையகத்திற்கு ஒரு தனிப்பட்ட பெயரைத் தேர்வுசெய்க.

# generic-library
source: There was a critical issue. Please try again.
ta: ஒரு முக்கியமான சிக்கல் இருந்தது. மீண்டும் முயற்சிக்கவும்.

# no-library-access
source: User does not have access to this library
ta: பயனருக்கு இந்த நூலகத்திற்கு அணுகல் இல்லை

# user-doesnt-exist
source: User does not exist
ta: பயனர் இல்லை

# library-doesnt-exist
source: Library does not exist
ta: நூலகம் இல்லை

source: Invalid Path
ta: தவறான பாதை

# delete-library-while-scan
source: You cannot delete a library while a scan is in progress. Please wait for scan to complete or restart Kavita then try to delete
ta: ச்கேன் நடந்து கொண்டிருக்கும்போது நீங்கள் ஒரு நூலகத்தை நீக்க முடியாது. கவிதாவை ச்கேன் முடிக்க அல்லது மறுதொடக்கம் செய்ய காத்திருங்கள்

# generic-library-update
source: There was a critical issue updating the library.
ta: நூலகத்தைப் புதுப்பிப்பதில் ஒரு முக்கியமான சிக்கல் இருந்தது.

# pdf-doesnt-exist
source: PDF does not exist when it should
ta: பி.டி.எஃப் எப்போது இருக்க வேண்டும்

source: Invalid Access
ta: தவறான அணுகல்

# no-image-for-page
source: No such image for page {0}. Try refreshing to allow re-cache.
ta: பக்கத்திற்கு அத்தகைய படம் இல்லை {0}. மறு கேச் அனுமதிக்க புத்துணர்ச்சியை முயற்சிக்கவும்.

# perform-scan
source: Please perform a scan on this series or library and try again
ta: தயவுசெய்து இந்த தொடர் அல்லது நூலகத்தில் ச்கேன் செய்து மீண்டும் முயற்சிக்கவும்

# generic-read-progress
source: There was an issue saving progress
ta: முன்னேற்றத்தை மிச்சப்படுத்தும் சிக்கல் இருந்தது

# generic-clear-bookmarks
source: Could not clear bookmarks
ta: புக்மார்க்குகளை அழிக்க முடியவில்லை

# bookmark-permission
source: You do not have permission to bookmark/unbookmark
ta: புக்மார்க்கு/புத்தகமார்க்குக்கு உங்களுக்கு இசைவு இல்லை

# bookmark-save
source: Could not save bookmark
ta: புத்தகக்குறியை சேமிக்க முடியவில்லை

# cache-file-find
source: Could not find cached image. Reload and try again.
ta: தற்காலிக சேமிப்பு படத்தைக் கண்டுபிடிக்க முடியவில்லை. மீண்டும் ஏற்றவும் மீண்டும் முயற்சிக்கவும்.

# name-required
source: Name cannot be empty
ta: பெயர் காலியாக இருக்க முடியாது

# valid-number
source: Must be valid page number
ta: செல்லுபடியாகும் பக்க எண்ணாக இருக்க வேண்டும்

# duplicate-bookmark
source: Duplicate bookmark entry already exists
ta: நகல் புத்தகக்குறி நுழைவு ஏற்கனவே உள்ளது

# reading-list-permission
source: You do not have permissions on this reading list or the list doesn't exist
ta: இந்த வாசிப்பு பட்டியலில் உங்களிடம் இசைவு இல்லை அல்லது பட்டியல் இல்லை

# reading-list-position
source: Couldn't update position
ta: நிலையை புதுப்பிக்க முடியவில்லை

# reading-list-updated
source: Updated
ta: புதுப்பிக்கப்பட்டது

# reading-list-item-delete
source: Couldn't delete item(s)
ta: உருப்படி (களை) நீக்க முடியவில்லை

# reading-list-deleted
source: Reading List was deleted
ta: வாசிப்பு பட்டியல் நீக்கப்பட்டது

# generic-reading-list-delete
source: There was an issue deleting the reading list
ta: வாசிப்பு பட்டியலை நீக்குவதில் சிக்கல் இருந்தது

# generic-reading-list-update
source: There was an issue updating the reading list
ta: வாசிப்பு பட்டியலைப் புதுப்பிப்பதில் சிக்கல் இருந்தது

# generic-reading-list-create
source: There was an issue creating the reading list
ta: வாசிப்பு பட்டியலை உருவாக்கும் சிக்கல் இருந்தது

# reading-list-doesnt-exist
source: Reading list does not exist
ta: வாசிப்பு பட்டியல் இல்லை

# series-restricted
source: User does not have access to this Series
ta: பயனருக்கு இந்த தொடருக்கான அணுகல் இல்லை

# generic-scrobble-hold
source: An error occurred while adding the hold
ta: பிடியைச் சேர்க்கும்போது பிழை ஏற்பட்டது

# libraries-restricted
source: User does not have access to any libraries
ta: பயனருக்கு எந்த நூலகங்களுக்கும் அணுகல் இல்லை

# no-series
source: Could not get series for Library
ta: நூலகத்திற்கான தொடர்களைப் பெற முடியவில்லை

# no-series-collection
source: Could not get series for Collection
ta: சேகரிப்புக்கான தொடர்களைப் பெற முடியவில்லை

# generic-series-delete
source: There was an issue deleting the series
ta: தொடரை நீக்குவதில் சிக்கல் இருந்தது

# generic-series-update
source: There was an error with updating the series
ta: தொடரைப் புதுப்பிப்பதில் பிழை ஏற்பட்டது

# series-updated
source: Successfully updated
ta: வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# update-metadata-fail
source: Could not update metadata
ta: மெட்டாடேட்டாவை புதுப்பிக்க முடியவில்லை

# age-restriction-not-applicable
source: No Restriction
ta: கட்டுப்பாடு இல்லை

# generic-relationship
source: There was an issue updating relationships
ta: உறவுகளைப் புதுப்பிப்பதில் சிக்கல் இருந்தது

source: Job already running
ta: ஏற்கனவே இயங்கும் வேலை

# encode-as-warning
source: You cannot convert to PNG. For covers, use Refresh Covers. Bookmarks and favicons cannot be encoded back.
ta: நீங்கள் பி.என்.சி.க்கு மாற்ற முடியாது. அட்டைகளுக்கு, புதுப்பிப்பு அட்டைகளைப் பயன்படுத்தவும். புக்மார்க்குகள் மற்றும் ஃபாவிகான்களை மீண்டும் குறியாக்கம் செய்ய முடியாது.

# ip-address-invalid
source: IP Address '{0}' is invalid
ta: ஐபி முகவரி '{0}' தவறானது

# bookmark-dir-permissions
source: Bookmark Directory does not have correct permissions for Kavita to use
ta: கவிதாவைப் பயன்படுத்த புக்மார்க்கு கோப்பகத்திற்கு சரியான அனுமதிகள் இல்லை

# total-backups
source: Total Backups must be between 1 and 30
ta: மொத்த காப்புப்பிரதிகள் 1 முதல் 30 வரை இருக்க வேண்டும்

# total-logs
source: Total Logs must be between 1 and 30
ta: மொத்த பதிவுகள் 1 முதல் 30 வரை இருக்க வேண்டும்

# stats-permission-denied
source: You are not authorized to view another user's statistics
ta: மற்றொரு பயனரின் புள்ளிவிவரங்களைக் காண உங்களுக்கு ஏற்பு இல்லை

# url-not-valid
source: Url does not return a valid image or requires authorization
ta: முகவரி சரியான படத்தை திருப்பித் தராது அல்லது ஏற்பு தேவைப்படுகிறது

# url-required
source: You must pass a url to use
ta: பயன்படுத்த நீங்கள் ஒரு முகவரி ஐ அனுப்ப வேண்டும்

# generic-cover-series-save
source: Unable to save cover image to Series
ta: கவர் படத்தை தொடருக்கு சேமிக்க முடியவில்லை

# generic-cover-collection-save
source: Unable to save cover image to Collection
ta: கவர் படத்தை சேகரிப்புக்கு சேமிக்க முடியவில்லை

# generic-cover-reading-list-save
source: Unable to save cover image to Reading List
ta: கவர் படத்தை வாசிப்பு பட்டியலுக்கு சேமிக்க முடியவில்லை

# generic-cover-chapter-save
source: Unable to save cover image to Chapter
ta: கவர் படத்தை அத்தியாயத்தில் சேமிக்க முடியவில்லை

# generic-cover-library-save
source: Unable to save cover image to Library
ta: கவர் படத்தை நூலகத்தில் சேமிக்க முடியவில்லை

# generic-cover-person-save
source: Unable to save cover image to Person
ta: கவர் படத்தை நபருக்கு சேமிக்க முடியவில்லை

# generic-cover-volume-save
source: Unable to save cover image to Volume
ta: கவர் படத்தை தொகுதிக்கு சேமிக்க முடியவில்லை

# access-denied
source: You do not have access
ta: உங்களுக்கு அணுகல் இல்லை

# reset-chapter-lock
source: Unable to resetting cover lock for Chapter
ta: அத்தியாயத்திற்கான கவர் பூட்டை மீட்டமைக்க முடியவில்லை

# generic-user-delete
source: Could not delete the user
ta: பயனரை நீக்க முடியவில்லை

# generic-user-pref
source: There was an issue saving preferences
ta: விருப்பங்களை சேமிக்கும் சிக்கல் இருந்தது

# opds-disabled
source: OPDS is not enabled on this server
ta: இந்த சேவையகத்தில் OPDS இயக்கப்படவில்லை

source: On Deck
ta: டெக்கில்

source: Browse On Deck
ta: டெக்கில் உலாவுக

source: Recently Added
ta: அண்மைக் காலத்தில் சேர்க்கப்பட்டது

source: Want to Read
ta: படிக்க விரும்புகிறேன்

source: Browse Want to Read
ta: உலாவு படிக்க விரும்புகிறது

source: Browse Recently Added
ta: உலாவு அண்மைக் காலத்தில் சேர்க்கப்பட்டது

source: Reading Lists
ta: பட்டியல்களைப் படித்தல்

# browse-reading-lists
source: Browse by Reading Lists
ta: பட்டியல்களைப் படிப்பதன் மூலம் உலாவுக

# libraries
source: All Libraries
ta: அனைத்து நூலகங்களும்

# browse-libraries
source: Browse by Libraries
ta: நூலகங்களால் உலாவுக

# collections
source: All Collections
ta: அனைத்து சேகரிப்புகளும்

# browse-collections
source: Browse by Collections
ta: வசூல் மூலம் உலாவுக

# more-in-genre
source: More in Genre {0}
ta: {0} வகைகளில் மேலும்

# browse-more-in-genre
source: Browse more in {0}
ta: {0} இல் மேலும் உலாவுக

source: Recently Updated
ta: அண்மைக் காலத்தில் புதுப்பிக்கப்பட்டது

source: Browse Recently Updated
ta: உலாவு அண்மைக் காலத்தில் புதுப்பிக்கப்பட்டது

source: Smart Filters
ta: அறிவுள்ள வடிப்பான்கள்

source: External Sources
ta: வெளிப்புற ஆதாரங்கள்

source: Browse External Sources
ta: வெளிப்புற ஆதாரங்களை உலாவுக

# browse-smart-filters
source: Browse by Smart Filters
ta: அறிவுள்ள வடிப்பான்களால் உலாவுக

# reading-list-restricted
source: Reading list does not exist or you don't have access
ta: வாசிப்பு பட்டியல் இல்லை அல்லது உங்களுக்கு அணுகல் இல்லை

# query-required
source: You must pass a query parameter
ta: நீங்கள் ஒரு வினவல் அளவுருவை அனுப்ப வேண்டும்

source: Search
ta: தேடல்

# search-description
source: Search for Series, Collections, or Reading Lists
ta: தொடர், தொகுப்புகள் அல்லது வாசிப்பு பட்டியல்களைத் தேடுங்கள்

# favicon-doesnt-exist
source: Favicon does not exist
ta: ஃபாவிகான் இல்லை

source: Smart Filter doesn't exist
ta: அறிவுள்ள வடிகட்டி இல்லை

# smart-filter-already-in-use
source: There is an existing stream with this Smart Filter
ta: இந்த அறிவுள்ள வடிகட்டியுடன் ஏற்கனவே ச்ட்ரீம் உள்ளது

source: Dashboard Stream doesn't exist
ta: டாச்போர்டு ச்ட்ரீம் இல்லை

source: SideNav Stream doesn't exist
ta: சிடெனவ் ச்ட்ரீம் இல்லை

source: External Source already exists
ta: வெளிப்புற மூலமானது ஏற்கனவே உள்ளது

# external-source-required
source: ApiKey and Host required
ta: அப்பிகி மற்றும் புரவலன் தேவை

source: External Source doesn't exist
ta: வெளிப்புற மூல இல்லை

# external-source-already-in-use
source: There is an existing stream with this External Source
ta: இந்த வெளிப்புற மூலத்துடன் ஏற்கனவே ச்ட்ரீம் உள்ளது

# sidenav-stream-only-delete-smart-filter
source: Only smart filter streams can be deleted from the SideNav
ta: சைடனாவிலிருந்து அறிவுள்ள வடிகட்டி நீரோடைகளை மட்டுமே நீக்க முடியும்

# dashboard-stream-only-delete-smart-filter
source: Only smart filter streams can be deleted from the dashboard
ta: டாச்போர்டில் இருந்து அறிவுள்ள வடிகட்டி ச்ட்ரீம்களை மட்டுமே நீக்க முடியும்

source: Smart Filter name required
ta: அறிவுள்ள வடிகட்டி பெயர் தேவை

# smart-filter-system-name
source: You cannot use the name of a system provided stream
ta: வழங்கப்பட்ட ச்ட்ரீமின் பெயரை நீங்கள் பயன்படுத்த முடியாது

# not-authenticated
source: User is not authenticated
ta: பயனர் அங்கீகரிக்கப்படவில்லை

# unable-to-register-k+
source: Unable to register license due to error. Reach out to Kavita+ Support
ta: பிழை காரணமாக உரிமத்தை பதிவு செய்ய முடியவில்லை. கவிதா+ ஆதரவை அணுகவும்

# unable-to-reset-k+
source: Unable to reset Kavita+ license due to error. Reach out to Kavita+ Support
ta: Unable பெறுநர் மீட்டமை Kavita+ உரிமம் due பெறுநர் error. கவிதா+ ஆதரவை அணுகவும்

# anilist-cred-expired
source: AniList Credentials have expired or not set
ta: அனிலிச்ட் நற்சான்றிதழ்கள் காலாவதியானன அல்லது அமைக்கப்படவில்லை

# scrobble-bad-payload
source: Bad payload from Scrobble Provider
ta: ச்க்ரோபல் வழங்குநரிடமிருந்து மோசமான பேலோட்

# theme-doesnt-exist
source: Theme file missing or invalid
ta: கருப்பொருள் கோப்பு காணவில்லை அல்லது தவறானது

# bad-copy-files-for-download
source: Unable to copy files to temp directory archive download.
ta: கோப்புகளை தற்காலிக அடைவு காப்பக பதிவிறக்கத்திற்கு நகலெடுக்க முடியவில்லை.

# generic-create-temp-archive
source: There was an issue creating temp archive
ta: தற்காலிக காப்பகத்தை உருவாக்கும் சிக்கல் இருந்தது

# epub-malformed
source: The file is malformed! Cannot read.
ta: கோப்பு தவறாக உள்ளது! படிக்க முடியாது.

# epub-html-missing
source: Could not find the appropriate html for that page
ta: அந்தப் பக்கத்திற்கு பொருத்தமான உஉகுமொ ஐக் கண்டுபிடிக்க முடியவில்லை

# collection-tag-title-required
source: Collection Title cannot be empty
ta: சேகரிப்பு தலைப்பு காலியாக இருக்க முடியாது

# reading-list-title-required
source: Reading List Title cannot be empty
ta: பட்டியல் தலைப்பு காலியாக இருக்க முடியாது

# collection-tag-duplicate
source: A collection with this name already exists
ta: இந்த பெயருடன் ஒரு தொகுப்பு ஏற்கனவே உள்ளது

# device-duplicate
source: A device with this name already exists
ta: இந்த பெயரைக் கொண்ட ஒரு சாதனம் ஏற்கனவே உள்ளது

# device-not-created
source: This device doesn't exist yet. Please create first
ta: இந்த சாதனம் இன்னும் இல்லை. முதலில் உருவாக்கவும்

# send-to-permission
source: Cannot Send non-EPUB or PDF to devices as not supported on Kindle
ta: கின்டலில் ஆதரிக்கப்படாத சாதனங்களுக்கு எபப் அல்லாத அல்லது பி.டி.எஃப் அனுப்ப முடியாது

# progress-must-exist
source: Progress must exist on user
ta: பயனரில் முன்னேற்றம் இருக்க வேண்டும்

# reading-list-name-exists
source: A reading list of this name already exists
ta: இந்த பெயரின் வாசிப்பு பட்டியல் ஏற்கனவே உள்ளது

# user-no-access-library-from-series
source: User does not have access to the library this series belongs to
ta: பயனருக்கு நூலகத்திற்கு அணுகல் இல்லை இந்த தொடர் சொந்தமானது

# series-restricted-age-restriction
source: User is not allowed to view this series due to age restrictions
ta: அகவை கட்டுப்பாடுகள் காரணமாக இந்தத் தொடரைப் பார்க்க பயனருக்கு இசைவு இல்லை

# kavitaplus-restricted
source: This is restricted to Kavita+ only
ta: இது கவிதா+ க்கு மட்டுமே

# aliases-have-overlap
source: One or more of the aliases have overlap with other people, cannot update
ta: ஒன்று அல்லது அதற்கு மேற்பட்ட மாற்றுப்பெயர்கள் மற்றவர்களுடன் ஒன்றுடன் ஒன்று உள்ளன, புதுப்பிக்க முடியாது

# volume-num
source: Volume {0}
ta: தொகுதி {0}

# book-num
source: Book {0}
ta: நூல் {0}

# issue-num
source: Issue {0}{1}
ta: வெளியீடு {0} {1}

# chapter-num
source: Chapter {0}
ta: அத்தியாயம் {0}

source: Check Updates
ta: புதுப்பிப்புகளை சரிபார்க்கவும்

source: License Check
ta: உரிம சோதனை

source: Process Scrobbling Events
ta: செயலாக்க நிகழ்வுகளை செயலாக்கவும்

source: Report Stats
ta: புள்ளிவிவரங்களைப் புகாரளிக்கவும்

source: Check Scrobbling Tokens
ta: ச்க்ரோப்ளிங் டோக்கன்களை சரிபார்க்கவும்

source: Cleanup
ta: தூய்மைப்படுத்துதல்

source: Process Processed Scrobbling Events
ta: செயல்முறை செயலாக்கப்பட்ட ச்க்ரோப்லிங் நிகழ்வுகள்

# remove-from-want-to-read
source: Want to Read Cleanup
ta: தூய்மைப்படுத்தலைப் படிக்க விரும்புகிறேன்

source: Scan Libraries
ta: நூலகங்களை ச்கேன் செய்யுங்கள்

source: Kavita+ Data Refresh
ta: கவிதா+ தரவு புதுப்பிப்பு

source: Backup
ta: காப்புப்பிரதி

source: Update Yearly Stats
ta: ஆண்டு புள்ளிவிவரங்களைப் புதுப்பிக்கவும்

# generated-reading-profile-name
source: Generated from {0}
ta: {0 இருந்து இலிருந்து உருவாக்கப்பட்டது
