Repository: 247i/TACETr
Catalog: உரை/தானி/kimai-invoice-calculator-*.po
Languages: ta

# invoice_calculator
source: Grouping of invoice lines
ta: விலைப்பட்டியல் கோடுகளின் தொகுத்தல்

# invoice_calculator.help
source: Select by which fields the invoice items should be grouped
ta: விலைப்பட்டியல் உருப்படிகளை எந்த புலங்கள் தொகுக்க வேண்டும் என்பதைத் தேர்ந்தெடுக்கவும்

# default
source: Default (one row per entry)
ta: இயல்புநிலை (நுழைவுக்கு ஒரு வரிசை)

# short
source: All (one entry total)
ta: அனைத்தும் (ஒரு நுழைவு மொத்தம்)

source: User
ta: பயனர்

source: Activity
ta: செய்கைப்பாடு

# activity_user
source: Activity and user
ta: செயல்பாடு மற்றும் பயனர்

source: Project
ta: திட்டம்

# project_user
source: Project and user
ta: திட்டம் மற்றும் பயனர்

source: Date
ta: திகதி

# date_user
source: Date and user
ta: தேதி மற்றும் பயனர்

# weekly
source: Calendar week
ta: காலண்டர் வாரம்

source: Price
ta: விலை
