Repository: 247i/TACETr
Catalog: உரை/தானி/kimai-website-*.po
Languages: ta

# history->year-2006
source: The first version of Kimai is released and slowly gains a growing user and developer base.
ta: கிமாயின் முதல் பதிப்பு வெளியிடப்பட்டு மெதுவாக வளர்ந்து வரும் பயனர் மற்றும் உருவாக்குபவர் தளத்தைப் பெறுகிறது.

# history->year-2009
source: Torsten, the original developer, wants to shut down Kimai. Kevin steps in and becomes maintainer.
ta: அசல் டெவலப்பரான டோர்ச்டன் கிமாயை மூட விரும்புகிறார். கெவின் உள்ளே நுழைந்து பராமரிப்பாளராகிறார்.

# history->year-2014
source: The last release of Kimai 1 is created, development stalls and there is not much more activity.
ta: கிமாய் 1 இன் கடைசி வெளியீடு உருவாக்கப்பட்டது, மேம்பாட்டு ச்டால்கள் மற்றும் அதிக செயல்பாடு இல்லை.

# history->year-2018
source: The Kimai rewrite finds it's way into the community, data migration works, adoption is on the rise.
ta: கிமாய் மறு எழுதுதல் சமூகத்திற்குள் செல்வதைக் கண்டறிந்துள்ளது, தரவு இடம்பெயர்வு பணிகள், தத்தெடுப்பு அதிகரித்து வருகிறது.

# history->year-2019
source: The first plugins were created to survey the interest for paid open source software.
ta: கட்டண திறந்த மூல மென்பொருளுக்கான வட்டியை ஆய்வு செய்ய முதல் செருகுநிரல்கள் உருவாக்கப்பட்டன.

# history->year-2020
source: Kimai is offered as a subscription-based SaaS, with one free and two paid plans.
ta: கிமாய் சந்தா அடிப்படையிலான சாசாக வழங்கப்படுகிறது, ஒரு இலவச மற்றும் இரண்டு கட்டண திட்டங்களுடன்.

# history->year-2023
source: All the hard work has finally paid off and Kimai is now my 100% full time job. Thank you so much!
ta: அனைத்து கடின உழைப்பும் இறுதியாக பலனளித்தன, கிமாய் இப்போது எனது 100% முழுநேர வேலை. மிக்க நன்றி!

# history->current
source: Kimai is a time tracking software with a long history, the first version was released back in 2006. Why do I mention this? Because I have seen many programs come and go since then - believe me when I say: Kimai is here to stay. I spent many years developing Kimai for fun, today Kimai is my business and I have never been more motivated to keep improving it. I build Kimai for one purpose: to record, manage, evaluate and account for working hours. Kimai supports an unlimited number of users, clients, projects and time entries, so you can manage all your teams in one easy-to-use installation. Kimai is translated into dozens of languages and runs on any device with internet access and a browser, even on your mobile device when you are on the move thanks to the responsive design. You can create invoices from your timesheets directly in your browser, with customisable invoice templates. Kimai can also be extended in many ways, especially through the many plugins created by an active community. Whether you are a freelancer, a small organisation or a company with hundreds of employees, Kimai can help you manage your business. Please make up your own mind and test Kimai with the help of the demo installations.
ta: கிமாய் ஒரு நீண்ட வரலாற்றைக் கொண்ட நேர கண்காணிப்பு மென்பொருள், முதல் பதிப்பு 2006 இல் மீண்டும் வெளியிடப்பட்டது. இதை நான் ஏன் குறிப்பிடுகிறேன்? ஏனென்றால், பல திட்டங்கள் வருவதையும், அதன்பிறகு செல்வதையும் நான் கண்டிருக்கிறேன் - நான் சொல்லும்போது என்னை நம்புங்கள்: கிமாய் தங்குவதற்கு இங்கே இருக்கிறார். நான் வேடிக்கைக்காக கிமாயை வளர்த்துக் கொள்ள பல ஆண்டுகள் செலவிட்டேன், இன்று கிமாய் எனது வணிகம், அதை மேம்படுத்துவதற்கு நான் ஒருபோதும் உந்துதல் பெற்றதில்லை. நான் ஒரு நோக்கத்திற்காக கிமாயை உருவாக்குகிறேன்: வேலை நேரத்திற்கு பதிவு செய்ய, நிர்வகிக்க, மதிப்பீடு மற்றும் கணக்கில். கிமாய் வரம்பற்ற பயனர்கள், வாடிக்கையாளர்கள், திட்டங்கள் மற்றும் நேர உள்ளீடுகளை ஆதரிக்கிறது, எனவே உங்கள் எல்லா அணிகளையும் ஒரு சுலபமாக பயன்படுத்தக்கூடிய நிறுவலில் நிர்வகிக்கலாம். கிமாய் டசன் கணக்கான மொழிகளில் மொழிபெயர்க்கப்பட்டுள்ளது மற்றும் இணைய அணுகல் மற்றும் உலாவி கொண்ட எந்த சாதனத்திலும் இயங்குகிறது, உங்கள் மொபைல் சாதனத்தில் கூட நீங்கள் நகரும் போது பதிலளிக்கக்கூடிய வடிவமைப்பிற்கு நன்றி. தனிப்பயனாக்கக்கூடிய விலைப்பட்டியல் வார்ப்புருக்கள் மூலம், உங்கள் உலாவியில் நேரடியாக உங்கள் டைம்சீட்களிலிருந்து விலைப்பட்டியல் உருவாக்கலாம். கிமாயை பல வழிகளில் நீட்டிக்க முடியும், குறிப்பாக செயலில் உள்ள சமூகத்தால் உருவாக்கப்பட்ட பல செருகுநிரல்கள் மூலமாக. நீங்கள் ஒரு ஃப்ரீலான்சர், ஒரு சிறிய அமைப்பு அல்லது நூற்றுக்கணக்கான ஊழியர்களைக் கொண்ட ஒரு நிறுவனமாக இருந்தாலும், உங்கள் வணிகத்தை நிர்வகிக்க கிமாய் உங்களுக்கு உதவ முடியும். தயவுசெய்து உங்கள் சொந்த மனதை உருவாக்கி, செயற்காட்சி நிறுவல்களின் உதவியுடன் கிமாயை சோதிக்கவும்.

# history->past
source: Kimai has a long history and was way ahead of its time when Torsten Höltge's team started developing it in 2006. It had a responsive design (thanks to a lot of Javascript magic) at a time when the word had not even been officially invented. I took over the development of Kimai in 2009 when Torsten wanted to stop it due to lack of time, and have maintained and extended Kimai for several years with the help of other open source enthusiasts. In the meantime, the PHP community was making great strides, while Kimai was falling further and further behind due to its history. The base had many technical weaknesses, and after many years of development, the code base was becoming increasingly difficult to maintain. The idea of rewriting Kimai with modern frameworks had been around for some time, also driven by community requests, but no one had the resources to push this idea forward. At the end of 2017, several factors came together and I seized the moment to start developing the next evolutionary step, "Kimai 2". The original Kimai was first released in 2006 and has been used by many people around the world, I am proud of that and also of its great community. I would like to thank everyone who contributed to Kimai.
ta: கிமாய் ஒரு நீண்ட வரலாற்றைக் கொண்டுள்ளது, மேலும் 2006 ஆம் ஆண்டில் டார்ச்டன் ஆல்ட்சின் குழு அதை உருவாக்கத் தொடங்கிய காலத்திற்கு முன்னால் இருந்தது. இந்தச் சொல் அதிகாரப்பூர்வமாகக் கண்டுபிடிக்கப்படாத ஒரு நேரத்தில் இது ஒரு பதிலளிக்கக்கூடிய வடிவமைப்பைக் கொண்டிருந்தது (நிறைய சாவாச்கிரிப்ட் மேசிக்கத்திற்கு நன்றி). 2009 ஆம் ஆண்டில் கிமாயின் வளர்ச்சியை நான் ஏற்றுக்கொண்டேன், டார்ச்டன் நேரம் இல்லாததால் அதைத் தடுக்க விரும்பினார், மேலும் பிற திறந்த மூல ஆர்வலர்களின் உதவியுடன் பல ஆண்டுகளாகக் கிமாயை பராமரித்து நீட்டித்துள்ளார். இதற்கிடையில், பி.எச்.பி சமூகம் பெரும் முன்னேற்றம் கண்டது, அதே நேரத்தில் கிமாய் அதன் வரலாறு காரணமாக மேலும் பின்தங்கியிருந்தது. தளத்திற்கு பல தொழில்நுட்ப பலவீனங்கள் இருந்தன, மேலும் பல வருட வளர்ச்சிக்குப் பிறகு, குறியீடு தளத்தைப் பராமரிப்பது கடினமாகிவிட்டது. நவீன கட்டமைப்போடு கிமாயை மீண்டும் எழுதுவதற்கான சிந்தனை சில காலமாக இருந்தது, இது சமூக கோரிக்கைகளால் இயக்கப்படுகிறது, ஆனால் இந்த யோசனையை முன்னோக்கி தள்ள யாருக்கும் ஆதாரங்கள் இல்லை. 2017 ஆம் ஆண்டின் இறுதியில், பல காரணிகள் ஒன்றிணைந்தன, அடுத்த படிமலர்ச்சி படியான "கிமாய் 2" ஐ உருவாக்கத் தொடங்குவதற்கான தருணத்தை நான் கைப்பற்றினேன். அசல் கிமாய் முதன்முதலில் 2006 இல் வெளியிடப்பட்டது மற்றும் உலகெங்கிலும் உள்ள பலரால் பயன்படுத்தப்பட்டது, அதைப் பற்றியும் அதன் சிறந்த சமூகத்திலும் நான் பெருமைப்படுகிறேன். கிமாய்க்கு பங்களித்த அனைவருக்கும் நன்றி தெரிவிக்க விரும்புகிறேன்.

# cta->get-started->question
source: Ready to get started?
ta: தொடங்கத் தயாரா?

# cta->get-started->answer
source: Start your time-tracking now
ta: உங்கள் நேரத்தைக் கண்காணிப்பதைத் தொடங்குங்கள்

# cta->get-started->button
source: Get support
ta: ஆதரவை பெறு

# cta->tech-support->question
source: Tech &amp; Business Support
ta: தொழில்நுட்பம் &amp; வணிக உதவி

# cta->tech-support->answer
source: I ensure support for all applications I've built and I will assist you and your team.
ta: நான் கட்டிய அனைத்து பயன்பாடுகளுக்கும் ஆதரவை உறுதிசெய்கிறேன், உங்களுக்கும் உங்கள் குழுவிற்கும் உதவுவேன்.

# cta->tech-support->button
source: Let's work together
ta: ஒன்றாக வேலை செய்வோம்

# cta->best-features->question
source: The best time-tracking features for you
ta: உங்களுக்கான சிறந்த நேர கண்காணிப்பு நற்பொருத்தங்கள்

# cta->best-features->answer
source: Kimai provides a wide range of features that build around your project time-tracking needs and best practices solutions to our customers making their bookkeeping easier.
ta: கிமாய் உங்கள் திட்ட நேர-கண்காணிப்பு தேவைகள் மற்றும் எங்கள் வாடிக்கையாளர்களுக்கு அவர்களின் புத்தக பராமரிப்பை எளிதாக்கும் சிறந்த நடைமுறைகள் தீர்வுகளை உருவாக்கும் பரந்த அளவிலான அம்சங்களை வழங்குகிறது.

# cta->best-features->button
source: More features via plugin
ta: சொருகி வழியாக கூடுதல் நற்பொருத்தங்கள்

# comparison->compare_with
source: Compare Kimai with %name%
ta: கிமாயை %பெயர் %உடன் ஒப்பிடுக

# comparison->footer-title
source: Compare
ta: ஒப்பிடுக

# comparison->is_oss
source: Open source software
ta: திறந்த மூல மென்பொருள்

# comparison->on_premise
source: Available on-premises
ta: வளாகத்தில் கிடைக்கிறது

# comparison->cloud
source: Available in the cloud
ta: மேகக்கட்டத்தில் கிடைக்கிறது

# comparison->location
source: Data server in EU
ta: ஐரோப்பிய ஒன்றியத்தில் தரவு சேவையகம்

# comparison->max_customers
source: Max. customers
ta: அதிகபட்சம். வாடிக்கையாளர்கள்

# comparison->max_projects
source: Max. projects
ta: அதிகபட்சம். திட்டங்கள்

# comparison->max_activities
source: Max. activities
ta: அதிகபட்சம். நடவடிக்கைகள்

# comparison->rest_api
source: JSON API
ta: சாதொபொகு பநிஇ

# comparison->invoices
source: Invoicing
ta: விலைப்பட்டியல்

# comparison->export
source: Data export
ta: தரவு ஏற்றுமதி

# comparison->saml
source: SAML
ta: சாம்ல்

# comparison->support
source: Support
ta: உதவி

# comparison->backup_frequency
source: Backups
ta: காப்புப்பிரதிகள்

# comparison->tls_included
source: TLS Certificate
ta: டி.எல்.எச் சான்றிதழ்

# comparison->custom_domain
source: Custom domain
ta: தனிப்பயன் களம்

# comparison->automatic_upgrades
source: Automatic upgrades
ta: தானியங்கி மேம்படுத்தல்கள்

# comparison->server_maintenance
source: Server maintenance
ta: சேவையக பராமரிப்பு

# comparison->ip_restriction
source: IP access restriction
ta: ஐபி அணுகல் கட்டுப்பாடு

# comparison->alternatives
source: Kimai alternatives
ta: கியாடேவ்ச்

# comparison->finding
source: Finding the right time-tracking solution
ta: சரியான நேர-கண்காணிப்பு தீர்வைக் கண்டறிதல்

# comparison->use_case
source: Every use case, every company and every workflow is different and your requirements need to be evaluated before deciding on a time tracker. Here are some alternatives to Kimai that we will compare in detail.
ta: ஒவ்வொரு பயன்பாட்டு வழக்குகளும், ஒவ்வொரு நிறுவனமும் ஒவ்வொரு பணிப்பாய்வும் வேறுபட்டவை மற்றும் நேர கண்காணிப்பாளரைத் தீர்மானிப்பதற்கு முன் உங்கள் தேவைகள் மதிப்பீடு செய்யப்பட வேண்டும். கிமாய்க்கு சில மாற்று வழிகள் இங்கே நாம் விரிவாக ஒப்பிடுவோம்.

# support->name
source: Support
ta: உதவி

# support->description
source: Need support? Find help with using, installing or updating Kimai.
ta: உதவி தேவையா? கிமாயைப் பயன்படுத்த, நிறுவுதல் அல்லது புதுப்பிக்க உதவியைக் கண்டறியவும்.

# support->intro
source: Some customers prefer to run Kimai internally but don't want to miss out on professional support. I'm pleased to assist you and offer a support plan for self-hosted installations.
ta: சில வாடிக்கையாளர்கள் கிமாயை உள்நாட்டில் இயக்க விரும்புகிறார்கள், ஆனால் தொழில்முறை ஆதரவை இழக்க விரும்பவில்லை. உங்களுக்கு உதவ நான் மகிழ்ச்சியடைகிறேன், சுய-ஓச்ட் செய்யப்பட்ட நிறுவல்களுக்கான உதவி திட்டத்தை வழங்குகிறேன்.

# support->community
source: Community
ta: சமூகம்

# support->community_cta
source: Visit GitHub
ta: கிட்அப்பைப் பார்வையிடவும்

# support->community_intro
source: There is no email support available for free, self-hosted installations. Community support on GitHub usually responds quickly. Please search the existing issues to see if your problem has already been solved.
ta: இலவச, சுய-ஓச்ட் நிறுவல்களுக்கு மின்னஞ்சல் உதவி எதுவும் கிடைக்கவில்லை. கிதூப்பில் சமூக உதவி பொதுவாக விரைவாக பதிலளிக்கும். உங்கள் சிக்கல் ஏற்கனவே தீர்க்கப்பட்டுள்ளதா என்பதைப் பார்க்க ஏற்கனவே உள்ள சிக்கல்களைத் தேடுங்கள்.

# support->cloud
source: Cloud Customers
ta: முகில் வாடிக்கையாளர்கள்

# support->cloud_cta
source: Create a Ticket
ta: ஒரு டிக்கெட்டை உருவாக்கவும்

# support->cloud_intro
source: Email support is available to paying Cloud customers. Cloud customers can expect responses within 24 hours, Monday to Friday between 10am and 4pm CET (excluding public holidays).
ta: முகில் வாடிக்கையாளர்களுக்கு பணம் செலுத்துவதற்கு மின்னஞ்சல் உதவி கிடைக்கிறது. முகில் வாடிக்கையாளர்கள் 24 மணி நேரத்திற்குள் பதில்களை எதிர்பார்க்கலாம், திங்கள் முதல் வெள்ளி வரை காலை 10 மணி முதல் மாலை 4 மணி வரை (பொது விடுமுறை நாட்களைத் தவிர).

# support->premium
source: Direct Contact
ta: நேரடி தொடர்பு

# support->premium_cta
source: Learn more
ta: மேலும் அறிக

# support->premium_intro
source: Email support and video calls are available for paying customers. I offer competitive pricing so you can focus on your business. I assist with your questions, installation and upgrades of your Kimai installation.
ta: வாடிக்கையாளர்களுக்கு பணம் செலுத்துவதற்கு மின்னஞ்சல் உதவி மற்றும் வீடியோ அழைப்புகள் கிடைக்கின்றன. நான் போட்டி விலையை வழங்குகிறேன், எனவே நீங்கள் உங்கள் வணிகத்தில் கவனம் செலுத்த முடியும். உங்கள் கிமாய் நிறுவலின் உங்கள் கேள்விகள், நிறுவல் மற்றும் மேம்படுத்தல்களுக்கு நான் உதவுகிறேன்.

# support->calendar
source: Support call with screen sharing
ta: திரை பகிர்வுடன் அழைப்பு

# support->calendar_intro
source: If you would like an introduction to Kimai or support with updates etc., you can book a paid screen sharing session with the developer, Kevin Papst. When you select a time slot, you will be redirected to a Stripe payment page, after which you will receive an invitation to the session.
ta: கிமாய்க்கு அறிமுகம் அல்லது புதுப்பிப்புகள் போன்றவற்றுடன் உதவி விரும்பினால், உருவாக்குபவர் கெவின் பாப்ச்டுடன் கட்டண திரை பகிர்வு அமர்வை முன்பதிவு செய்யலாம். நீங்கள் ஒரு நேர ச்லாட்டைத் தேர்ந்தெடுக்கும்போது, நீங்கள் ஒரு பட்டை கட்டணப் பக்கத்திற்கு திருப்பி விடப்படுவீர்கள், அதன் பிறகு நீங்கள் அமர்வுக்கு அழைப்பைப் பெறுவீர்கள்.

# support->calendar_refund
source: If you are unable to attend your appointment, you must cancel at least 24 hours in advance so that it can be rescheduled. No refunds will be given.
ta: உங்கள் சந்திப்பில் நீங்கள் கலந்து கொள்ள முடியாவிட்டால், நீங்கள் குறைந்தது 24 மணிநேரங்களுக்கு முன்பே ரத்து செய்ய வேண்டும், இதனால் அதை மாற்றியமைக்க முடியும். பணத்தைத் திரும்பப்பெற எதுவும் வழங்கப்படாது.

# landing_oss->subtitle
source: Kimai is the open source %title% software you were looking for
ta: கிமாய் என்பது நீங்கள் தேடிக்கொண்டிருந்த திறந்த மூல % தலைப்பு % மென்பொருளாகும்

# landing_oss->vendor_title
source: No vendor lock-in
ta: விற்பனையாளர் பூட்டுதல் இல்லை

# landing_oss->vendor_intro
source: Vendor lock-in can cost a lot, not just in cash but also in hours. With Kimai, you can host it yourself, have me host it for you, or fork it and change it. You're never locked into a hosted product, and all of your data is easy to export so that if you ever decide Kimai isn't for you anymore, your data is still yours (the same applies to the paid plans, I offer data export upon cancellation).
ta: விற்பனையாளர் பூட்டுதல் பணத்தில் மட்டுமல்ல, மணிநேரத்திலும் நிறைய செலவாகும். கிமாய் மூலம், அதை நீங்களே புரவலன் செய்யலாம், அதை உங்களுக்காக புரவலன் செய்யலாம், அல்லது அதை முடக்கி மாற்றலாம். நீங்கள் ஒருபோதும் புரவலன் செய்யப்பட்ட தயாரிப்பில் பூட்டப்படவில்லை, உங்கள் தரவு அனைத்தும் ஏற்றுமதி செய்வது எளிதானது, இதனால் கிமாய் இனி உங்களுக்காக இல்லை என்று நீங்கள் எப்போதாவது முடிவு செய்தால், உங்கள் தரவு இன்னும் உங்களுடையது (கட்டணத் திட்டங்களுக்கும் இது பொருந்தும், நான் தரவை வழங்குகிறேன் ரத்து செய்யப்பட்டால் ஏற்றுமதி).

# landing_oss->transparency_title
source: Always transparent
ta: எப்போதும் வெளிப்படையானது

# landing_oss->transparency_intro
source: With closed source software, you have only the vendor's claims that they're keeping the software secure and adhering to standards. The visibility of the code behind open source software means you can see for yourself. You can always see my responses to the community, the release schedule and milestones, and every commit and pull request review.
ta: மூடிய மூல மென்பொருளைக் கொண்டு, விற்பனையாளரின் கூற்றுக்கள் மட்டுமே மென்பொருளைப் பாதுகாப்பாக வைத்திருக்கின்றன மற்றும் தரங்களை கடைபிடிக்கின்றன. திறந்த மூல மென்பொருளின் பின்னால் உள்ள குறியீட்டின் தெரிவுநிலை என்பது நீங்களே பார்க்க முடியும் என்பதாகும். சமூகத்திற்கான எனது பதில்கள், வெளியீட்டு அட்டவணை மற்றும் மைல்கற்கள் மற்றும் ஒவ்வொரு கமிட் மற்றும் புல் கோரிக்கை மதிப்பாய்வையும் நீங்கள் எப்போதும் காணலாம்.

# landing_oss->discover
source: Discover Kimai
ta: கிசைக் கண்டறியவும்

# landing_oss->version_choose
source: Which Kimai is right for you?
ta: எந்த கிமாய் உங்களுக்கு சரியானது?

# landing_oss->version_onpremise
source: I take care of the software, you take care about the hosting, updates and security. And if you don't want to do it yourself, there is always support available at your fingertips. You buy the plugins relevant to you in an annual update subscription.
ta: நான் மென்பொருளை கவனித்துக்கொள்கிறேன், ஓச்டிங், புதுப்பிப்புகள் மற்றும் பாதுகாப்பு குறித்து நீங்கள் கவனித்துக்கொள்கிறீர்கள். அதை நீங்களே செய்ய விரும்பவில்லை என்றால், உங்கள் விரல் நுனியில் எப்போதும் உதவி கிடைக்கும். வருடாந்திர புதுப்பிப்பு சந்தாவில் உங்களுக்கு தொடர்புடைய செருகுநிரல்களை வாங்குகிறீர்கள்.

# landing_oss->version_cloud
source: Get up and running in seconds, leave the hosting and update to me, you take care of your core business. Make sure your team is ready for the future, with a modern time tracking solution. All plugins are available in the cloud at no extra cost.
ta: எழுந்து நொடிகளில் ஓடுங்கள், ஓச்டிங்கை விட்டுவிட்டு எனக்கு புதுப்பிக்கவும், உங்கள் முக்கிய வணிகத்தை நீங்கள் கவனித்துக் கொள்ளுங்கள். நவீன நேர கண்காணிப்பு தீர்வுடன், உங்கள் குழு எதிர்காலத்திற்கு தயாராக உள்ளது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். அனைத்து செருகுநிரல்களும் கூடுதல் செலவில் மேகக்கட்டத்தில் கிடைக்கின்றன.

# non-profit->name
source: Non-Profits
ta: இலாப நோக்கற்ற

# non-profit->eligible
source: Learn more
ta: மேலும் அறிக

# non-profit->intro
source: Time-tracking for Non-Profit Organizations, cheap and reliable
ta: மலிவான மற்றும் நம்பகமான இலாப நோக்கற்ற நிறுவனங்களுக்கான நேர கண்காணிப்பு

# non-profit->testimonial-title
source: Non-profits trust on Kimai
ta: கிமாய் மீது இலாப நோக்கற்ற நம்பிக்கை

# non-profit->testimonial-intro
source: And I look forward to be able to support your organisation too.
ta: உங்கள் நிறுவனத்தையும் ஆதரிக்க நான் எதிர்நோக்குகிறேன்.

# discount-codes->name
source: Discount codes
ta: தள்ளுபடி குறியீடுகள்

# pricing->name
source: Pricing
ta: விலை

# pricing->subtitle
source: These plans are available for cloud customers
ta: இந்த திட்டங்கள் முகில் வாடிக்கையாளர்களுக்கு கிடைக்கின்றன

# pricing->short_monthly
source: Per user & month
ta: ஒரு பயனருக்கு & மாதம்

# pricing->short_annual
source: Per user & year
ta: ஒரு பயனர் & ஆண்டுக்கு

# pricing->monthly
source: Monthly
ta: மாதாந்திர

# pricing->annual
source: Annually
ta: ஆண்டுதோறும்

# pricing->not_available
source: Not available
ta: கிடைக்கவில்லை

# pricing->included
source: What's included?
ta: என்ன சேர்க்கப்பட்டுள்ளது?

# pricing->tax_exclusive
source: All prices are exclusive of taxes.
ta: அனைத்து விலைகளும் வரிகளிலிருந்து பிரத்தியேகமானவை.

# pricing->cancellation
source: You can cancel your subscription at any time up to one day before the end of the subscription period.
ta: சந்தா காலம் முடிவதற்கு ஒரு நாள் வரை எந்த நேரத்திலும் உங்கள் சந்தாவை ரத்து செய்யலாம்.

# plans->max_users
source: Users
ta: பயனர்கள்

# plans->timetracking
source: Project time-tracking
ta: திட்ட நேரம் கண்காணிப்பு

# plans->billable_hours
source: Billable and non-billable hours
ta: பில் செய்யக்கூடிய மற்றும் பில்லி செய்ய முடியாத மணிநேரம்

# plans->translation
source: Industry-specific translations
ta: தொழில் சார்ந்த மொழிபெயர்ப்புகள்

# plans->invoices
source: Invoicing
ta: விலைப்பட்டியல்

# plans->all_from_plan
source: All features from '%plan%'
ta: '%திட்டம்%' என்பதிலிருந்து அனைத்து அம்சங்களும்

# plans->email_support
source: Email Support
ta: மின்னஞ்சல் உதவி

# plans->saml
source: Single Sign-On with SAML
ta: SAML உடன் ஒற்றை உள்நுழைவு

# plans->tls_included
source: Free SSL Certificate
ta: இலவச எச்எச்எல் சான்றிதழ்

# plans->priority_features
source: Prioritized Feature Requests
ta: முன்னுரிமை செய்யப்பட்ட அம்ச கோரிக்கைகள்

# plans->expense_tracking
source: Expense tracking
ta: செலவு கண்காணிப்பு

# plans->absences
source: Public Holidays, vacation, sick leave
ta: பொது விடுமுறைகள், விடுமுறை, நோய்வாய்ப்பட்ட விடுப்பு

# plans->ip_whitelist
source: IP Access Restriction
ta: ஐபி அணுகல் கட்டுப்பாடு

# plans->daily_backups
source: Daily backups for download
ta: பதிவிறக்க நாள்தோறும் காப்புப்பிரதிகள்

# plans->rest_api
source: JSON API
ta: சாதொபொகு பநிஇ

# plans->github_support
source: Community Forum
ta: சமூக மன்றம்

# plans->custom_domain
source: Custom Domain with SSL
ta: SSL உடன் தனிப்பயன் டொமைன்

# plans->automatic_upgrades
source: Automatic Updates
ta: தானியங்கி புதுப்பிப்புகள்

# plans->server_maintenance
source: Server Maintenance
ta: சேவையக பராமரிப்பு

# plans->automatic_backups
source: Automatic Backups
ta: தானியங்கி காப்புப்பிரதிகள்

# plans->backup_frequency
source: Backup Frequency
ta: காப்பு அதிர்வெண்

# plans->audit_logs
source: Audit logs
ta: தணிக்கை பதிவுகள்

# plans->custom_fields
source: Custom fields
ta: தனிப்பயன் புலங்கள்

# plans->task_management
source: Task management
ta: பணி மேலாண்மை

# plans->custom_css
source: Custom CSS Rules
ta: தனிப்பயன் சிஎச்எச் விதிகள்

# plans->invoice_documents
source: Custom invoice templates
ta: தனிப்பயன் விலைப்பட்டியல் வார்ப்புருக்கள்

# plans->export
source: Data export
ta: தரவு ஏற்றுமதி

# plans->expense
source: Expense tracking
ta: செலவு கண்காணிப்பு

# plans->ip_restriction
source: Access restriction via IP
ta: ஐபி வழியாக அணுகல் கட்டுப்பாடு

# plans->work_contract
source: Working hour account
ta: வேலை நேர கணக்கு

# plans->export_templates
source: Export PDF-Templates
ta: PDF- வளர்புருகளை ஏற்றுமதி செய்

# plans->kiosk
source: Kiosk Mode
ta: கியோச்க் பயன்முறை

# plans->backup_weekly
source: Weekly
ta: வாராந்திர

# plans->backup_daily
source: Daily
ta: நாள்தோறும்

# error->back
source: Back to homepage
ta: முகப்புப்பக்கத்திற்குத் திரும்பு

# error->title
source: Ooops!
ta: அச்சச்சோ!

# 400->name
source: Bad request (400)
ta: மோசமான கோரிக்கை (400)

# 400->description
source: We are sorry, but your request contains bad syntax and cannot be fulfilled.
ta: நாங்கள் வருந்துகிறோம், ஆனால் உங்கள் கோரிக்கையில் மோசமான தொடரியல் உள்ளது, அதை நிறைவேற்ற முடியாது.

# 404->name
source: Not found (404)
ta: கண்டுபிடிக்கப்படவில்லை (404)

# 404->description
source: We are sorry, but we restructured our page recently and some old links might now be broken.
ta: மன்னிக்கவும், ஆனால் நாங்கள் அண்மைக் காலத்தில் எங்கள் பக்கத்தை மறுசீரமைத்தோம், சில பழைய இணைப்புகள் இப்போது உடைக்கப்படலாம்.

# 500->name
source: Server error (500)
ta: சேவையக பிழை (500)

# 500->description
source: We are sorry, but your request contains bad syntax and cannot be fulfilled.
ta: நாங்கள் வருந்துகிறோம், ஆனால் உங்கள் கோரிக்கையில் மோசமான தொடரியல் உள்ளது, அதை நிறைவேற்ற முடியாது.

# 503->name
source: Temporarily unavailable (503)
ta: தற்காலிகமாக கிடைக்கவில்லை (503)

# 503->description
source: We are sorry, but our server is currently in maintenance and currently not available. We'll be back soon!
ta: மன்னிக்கவும், ஆனால் எங்கள் சேவையகம் தற்போது பராமரிப்பில் உள்ளது, தற்போது கிடைக்கவில்லை. நாங்கள் விரைவில் திரும்பி வருவோம்!

# theme->light
source: Light
ta: ஒளி

# theme->dark
source: Dark
ta: இருண்ட
