Repository: 247i/TACETr
Catalog: உரை/தானி/kimai-website-*.po
Languages: ta

# store->subtitle
source: Use the wide range of plugins from the Kimai ecosystem to equip your self-hosted time recording solution with additional functions.
ta: உங்கள் தன்-ஓச்ட் டைம் பதிதல் தீர்வைக் கூடுதல் செயல்பாடுகளுடன் சித்தப்படுத்த கிமாய் சுற்றுச்சூழல் அமைப்பிலிருந்து பரந்த அளவிலான செருகுநிரல்கள், பயன்பாடுகள் மற்றும் நீட்டிப்புகளைப் பயன்படுத்தவும்.

# store->description
source: Plugins for Kimai extend your time-tracking experience with additional features
ta: கிமாய்க்கான செருகுநிரல்கள் கூடுதல் அம்சங்களுடன் உங்கள் நேர கண்காணிப்பு அனுபவத்தை நீட்டிக்கின்றன

# blog->name
source: Blog
ta: வலைப்பதிவு

# blog->title
source: News from Kimai
ta: கிமாய் இடமிருந்து செய்தி

# blog->description
source: News about Kimai, the time-tracking software
ta: கிமாய் பற்றிய செய்திகள், நேர கண்காணிப்பு மென்பொருள்

# blog->subtitle
source: News from the Kimai development team
ta: கிமாய் மேம்பாட்டுக் குழுவின் செய்தி

# blog->archive-link
source: Find older %topic% news here
ta: பழைய %topic% செய்திகளின் காப்பகத்தை இங்கே காணலாம்

# documentation->name
source: Documentation
ta: ஆவணப்படுத்துதல்

# documentation->description
source: Support information, user manual and other documentation for Kimai time-tracking
ta: கிமாய் நேர-கண்காணிப்புக்கான செய்தி, பயனர் கையேடு மற்றும் பிற ஆவணங்களை ஆதரிக்கவும்

# documentation->subtitle
source: Online documentation for the time-tracking application Kimai
ta: நேர கண்காணிப்பு பயன்பாட்டிற்கான நிகழ்நிலை ஆவணங்கள் கிமாய்

# privacy-policy->name
source: Privacy policy
ta: தனியுரிமைக் கொள்கை

# site-notice->name
source: Site notice
ta: தள அறிவிப்பு

# docu-cloud->name
source: Cloud
ta: முகில்

# docu-manual->name
source: User manual
ta: பயனர் கையேடு

# docu-developer->name
source: Developer
ta: உருவாக்குநர்

# docu-onpremise->name
source: On-Premise
ta: ஆன்-ப்ரைமிச்

# features->name
source: Features
ta: நற்பொருத்தங்கள்

# alternatives->name
source: Kimai alternatives
ta: கியாடேவ்ச்

# alternatives->description
source: Kimai is the best open source time tracking application available, not only for project-based teams. See how Kimai compares to alternative time tracking solutions so you can choose the right one for your organisation.
ta: திட்ட அடிப்படையிலான அணிகளுக்கு மட்டுமல்லாமல், கிமாய் சிறந்த திறந்த மூல நேர கண்காணிப்பு பயன்பாடாகும். மாற்று நேர கண்காணிப்பு தீர்வுகளுடன் கிமாய் எவ்வாறு ஒப்பிடுகிறது என்பதைப் பாருங்கள், எனவே உங்கள் நிறுவனத்திற்கு சரியானதைத் தேர்வு செய்யலாம்.

# industry->more
source: More industries
ta: மேலும் தொழில்கள்

# industry->title
source: Time tracking for every industry
ta: ஒவ்வொரு தொழிலுக்கும் நேர கண்காணிப்பு

# industry->name
source: Time tracking for every business
ta: ஒவ்வொரு வணிகத்திற்கும் நேர கண்காணிப்பு

# industry->subtitle
source: Keep your projects on track with Kimai
ta: கிமாயுடன் உங்கள் திட்டங்களை கண்காணிக்கவும்

# industry->intro
source: You can improve the productivity of your employees with the Kimai time recording software.
ta: கிமாய் டைம் ரெக்கார்டிங் மென்பொருளுடன் உங்கள் ஊழியர்களின் உற்பத்தித்திறனை மேம்படுத்தலாம்.

# industry->office
source: For office workers
ta: அலுவலக தொழிலாளர்களுக்கு

# time-tracking-terms->title
source: Time Tracking Terms
ta: நேர கண்காணிப்பு விதிமுறைகள்

# time-tracking-terms->name
source: Time Tracking Terms
ta: நேர கண்காணிப்பு விதிமுறைகள்

# time-tracking-terms->subtitle
source: Explanations of common terms
ta: பொதுவான சொற்களின் விளக்கங்கள்

# time-tracking-terms->intro
source: Take a look behind the scenes of time recording and learn more about the frequently used terms in Kimai
ta: நேர பதிவின் திரைக்குப் பின்னால் பாருங்கள் மற்றும் கிமாயில் அடிக்கடி பயன்படுத்தப்படும் சொற்களைப் பற்றி மேலும் அறிக

# feature->auth->name
source: Authentication and Security
ta: ஏற்பு மற்றும் பாதுகாப்பு

# feature->auth->description
source: Kimai supports external identity providers and login via LDAP and SAML across multiple providers (such as Google Workspace, Azure AD or Authentik). Two-factor authentication via TOTP tokens is optionally possible.
ta: கிமாய் வெளிப்புற அடையாள வழங்குநர்களை ஆதரிக்கிறது மற்றும் பல வழங்குநர்கள் (கூகிள் பணியிடங்கள், அசூர் கி.பி. TOTP டோக்கன்கள் வழியாக இரண்டு காரணி ஏற்பு விருப்பமாக சாத்தியமாகும்.

# feature->reporting->name
source: Reports and analyses
ta: அறிக்கைகள் மற்றும் பகுப்பாய்வு

# feature->reporting->description
source: Analysis of recorded times by users, customers, projects, activities, tags, time periods and more.
ta: பயனர்கள், வாடிக்கையாளர்கள், திட்டங்கள், செயல்பாடுகள், குறிச்சொற்கள், கால காலநீடிப்பு மற்றும் பலவற்றால் பதிவுசெய்யப்பட்ட நேரங்களின் பகுப்பாய்வு.

# feature->mobile-ready->name
source: Mobile ready
ta: மொபைல் ஆயத்தம்

# feature->mobile-ready->description
source: The layout is fully responsive, made for desktop and mobile usage. Every user can configure the data columns that should be shown, e.g. to prevent horizontal scrolling on small devices.
ta: தளவமைப்பு முழுமையாக பதிலளிக்கக்கூடியது, டெச்க்டாப் மற்றும் மொபைல் பயன்பாட்டிற்காக தயாரிக்கப்படுகிறது. ஒவ்வொரு பயனரும் காட்டப்பட வேண்டிய தரவு நெடுவரிசைகளை உள்ளமைக்க முடியும், எ.கா. சிறிய சாதனங்களில் கிடைமட்ட ச்க்ரோலிங் தடுக்க.

# feature->plugins->name
source: Plugins
ta: செருகுநிரல்கள்

# feature->plugins->description
source: Kimai was built to be extendable, and features can be added with plugins. Developers wanting to create them can use many extension points.
ta: கிமாய் நீட்டிக்கக்கூடியதாக கட்டப்பட்டது, மேலும் செருகுநிரல்களுடன் அம்சங்களைச் சேர்க்கலாம். அவற்றை உருவாக்க விரும்பும் உருவாக்குபவர்கள் பல நீட்டிப்பு புள்ளிகளைப் பயன்படுத்தலாம்.

# feature->multi-user->name
source: Multi user
ta: பல பயனர்

# feature->multi-user->description
source: Kimai can be used by as many users as you want: each installation supports unlimited users with different roles (see permissions).
ta: கிமாயை நீங்கள் விரும்பும் பல பயனர்களால் பயன்படுத்தலாம்: ஒவ்வொரு நிறுவலும் வரம்பற்ற பயனர்களை வெவ்வேறு பாத்திரங்களுடன் ஆதரிக்கிறது (அனுமதிகளைப் பார்க்கவும்).

# feature->multi-language->name
source: Multi language
ta: பல மொழி

# feature->multi-language->description
source: Kimai can be localized to any language and is already translated to more than 30 languages.
ta: கிமாய் எந்த மொழியுக்கும் மொழிபெயர்க்கப்படலாம் மற்றும் ஏற்கனவே 30 க்கும் மேற்பட்ட மொழிகளுக்கு மொழிபெயர்க்கப்பட்டுள்ளது.

# feature->teams->name
source: Teams
ta: அணிகள்

# feature->teams->description
source: Teams connects users into logical groups, like departments. Limit access to data by assigning customers and projects to your teams.
ta: அணிகள் பயனர்களை துறைகள் போன்ற தர்க்கரீதியான குழுக்களாக இணைக்கிறது. உங்கள் குழுக்களுக்கு வாடிக்கையாளர்கள் மற்றும் திட்டங்களை ஒதுக்குவதன் மூலம் தரவுகளுக்கான அணுகலைக் கட்டுப்படுத்துங்கள்.

# feature->customers->name
source: Customers
ta: வாடிக்கையாளர்கள்

# feature->customers->description
source: Manage your customers and set address, contacts, country, currency, visibility (for archiving) and many more fields.
ta: உங்கள் வாடிக்கையாளர்களை நிர்வகிக்கவும், முகவரி, தொடர்புகள், நாடு, நாணயம், தெரிவுநிலை (காப்பகத்திற்கு) மற்றும் இன்னும் பல துறைகளை அமைக்கவும்.

# feature->projects->name
source: Projects
ta: திட்டங்கள்

# feature->projects->description
source: Manage projects for each customer with order number, budget and visibility (for archiving).
ta: ஒவ்வொரு வாடிக்கையாளருக்கும் ஆர்டர் எண், பட்செட் மற்றும் தெரிவுநிலை (காப்பகத்திற்கு) திட்டங்களை நிர்வகிக்கவும்.

# feature->activities->name
source: Activities
ta: நடவடிக்கைகள்

# feature->activities->description
source: Activities are used to assign the unit of work to timesheet entries. Manage activities for each project with order number, budget and visibility (for archiving) or create global ones to prevent duplicates.
ta: வேலை அலகு டைம்சீட் உள்ளீடுகளுக்கு ஒதுக்க நடவடிக்கைகள் பயன்படுத்தப்படுகின்றன. ஒவ்வொரு திட்டத்திற்கும் ஆர்டர் எண், பட்செட் மற்றும் தெரிவுநிலையுடன் (காப்பகத்திற்கு) நடவடிக்கைகளை நிர்வகிக்கவும் அல்லது நகல்களைத் தடுக்க உலகளாவியவற்றை உருவாக்கவும்.

# feature->invoices->name
source: Invoicing
ta: விலைப்பட்டியல்

# feature->invoices->description
source: Configurable invoice templates, options for entry grouping, configurable invoice numbers, and multiple formats like PDF and DOCX.
ta: உள்ளமைக்கக்கூடிய விலைப்பட்டியல் வார்ப்புருக்கள், நுழைவு குழுவாக உள்ள விருப்பங்கள், உள்ளமைக்கக்கூடிய விலைப்பட்டியல் எண்கள் மற்றும் PDF மற்றும் DOCX போன்ற பல வடிவங்கள்.

# feature->export->name
source: Export data
ta: தரவு ஏற்றுமதி

# feature->export->description
source: Timesheet data can be exported and shared with in XLSX, PDF, CSV and HTML format. Exported records can be locked and protected against further changes.
ta: டைம்சீட் தரவை எக்ச்எல்எச்எக்ச், பி.டி.எஃப், சி.எச்.வி மற்றும் எச்.டி.எம்.எல் வடிவத்தில் ஏற்றுமதி செய்து பகிரலாம். ஏற்றுமதி செய்யப்பட்ட பதிவுகளை பூட்டப்பட்டு மேலும் மாற்றங்களிலிருந்து பாதுகாக்க முடியும்.

# feature->expenses->name
source: Expenses
ta: செலவுகள்

# feature->expenses->description
source: Buy the plugin and keep track of expenses based on customer, project and activity — for categorization and inclusion in your invoices.
ta: சொருகி வாங்கவும், வாடிக்கையாளர், திட்டம் மற்றும் செயல்பாட்டின் அடிப்படையில் செலவினங்களைக் கண்காணிக்கவும் - உங்கள் விலைப்பட்டியலில் வகைப்படுத்தல் மற்றும் சேர்க்க.

# feature->2fa->name
source: Two-factor auth (2FA)
ta: இரண்டு காரணி ஏற்பு (2FA)

# feature->2fa->description
source: Kimai supports two-factor authentication with TOTP tokens: secure your user accounts today!
ta: TOTP டோக்கன்களுடன் இரண்டு காரணி அங்கீகாரத்தை கிமாய் ஆதரிக்கிறது: இன்று உங்கள் பயனர் கணக்குகளைப் பாதுகாக்கவும்!

# feature->saml->name
source: SAML
ta: சாம்ல்

# feature->saml->description
source: Log in and register users with SAML via your existing SSO identity provider, like Google Workspace, Authentik or Azure Active Directory.
ta: கூகிள் பணியிடங்கள், உண்மையான அல்லது அசூர் ஆக்டிவ் டைரக்டரி போன்ற உங்கள் தற்போதைய ஒருகைஉள் அடையாள வழங்குநர் வழியாக SAML உடன் உள்நுழைந்து பயனர்களை பதிவு செய்யுங்கள்.

# feature->api->name
source: JSON API
ta: சாதொபொகு பநிஇ

# feature->api->description
source: Featuring an extensive JSON API for reading and writing data, so external apps and custom tools can communicate with Kimai.
ta: தரவைப் படிப்பதற்கும் எழுதுவதற்கும் ஒரு விரிவான சாதொபொகு பநிஇ ஐக் கொண்டுள்ளது, எனவே வெளிப்புற பயன்பாடுகள் மற்றும் தனிப்பயன் கருவிகள் கிமாயுடன் தொடர்பு கொள்ளலாம்.

# feature->ldap->description
source: Connect Kimai with your company directory server (LDAP or Active directory) and use your existing authentication infrastructure.
ta: கிமாயை உங்கள் நிறுவனத்தின் அடைவு சேவையகத்துடன் (LDAP அல்லது ஆக்டிவ் டைரக்டரி) இணைக்கவும், உங்கள் இருக்கும் அங்கீகார உள்கட்டமைப்பைப் பயன்படுத்தவும்.

# feature->statistics->name
source: Statistics
ta: புள்ளிவிவரங்கள்

# feature->statistics->description
source: Your dashboard will show you several statistics about recorded times and the amount of collected data. And we can always add more charts!
ta: பதிவுசெய்யப்பட்ட நேரங்கள் மற்றும் சேகரிக்கப்பட்ட தரவுகளின் அளவு குறித்த பல புள்ளிவிவரங்களை உங்கள் டாச்போர்டு உங்களுக்குக் காண்பிக்கும். நாம் எப்போதும் அதிக விளக்கப்படங்களைச் சேர்க்கலாம்!

# feature->docker->description
source: We have Docker images for development and there multiple variations of Docker-Compose setups for production usage.
ta: வளர்ச்சிக்கான கப்பல்துறை படங்கள் எங்களிடம் உள்ளன, மேலும் விளைவாக்கம் பயன்பாட்டிற்கான டோக்கர்-கம்ப்யூச் அமைப்புகளின் பல வேறுபாடுகள் உள்ளன.

# feature->migrate-v1->name
source: Migration
ta: குடிபெயர்வு

# feature->migrate-v1->description
source: Data from Kimai v1 can be imported, for a seamless migration of your time-tracker.
ta: உங்கள் நேர கண்காணிப்பாளரின் தடையற்ற இடம்பெயர்வுக்கு கிமாய் வி 1 இலிருந்து தரவை இறக்குமதி செய்யலாம்.

# feature->active-entries->name
source: Amount of active records
ta: செயலில் உள்ள பதிவுகளின் அளவு

# feature->active-entries->description
source: Record as many times as you want in parallel, or limit it to one.
ta: இணையாக நீங்கள் விரும்பும் பல முறை பதிவு செய்யுங்கள் அல்லது அதை ஒன்றுக்கு மட்டுப்படுத்தவும்.

# feature->am-pm-format->name
source: AM/PM format
ta: AM/PM வடிவம்

# feature->am-pm-format->description
source: Kimai uses localized version of the 24 hour format. But if you are used to the AM/PM format, you can configure that.
ta: கிமாய் 24 மணிநேர வடிவமைப்பின் உள்ளூர்மயமாக்கப்பட்ட பதிப்பைப் பயன்படுத்துகிறது. ஆனால் நீங்கள் AM/PM வடிவத்துடன் பழகினால், அதை உள்ளமைக்கலாம்.

# feature->time-clock->name
source: Time-clock
ta: நேர கடிகாரம்

# feature->time-clock->description
source: Don’t want your users to log arbitrary timesheet records? Switch to the time-clock mode, which only allows “punch in” and “punch out” records.
ta: உங்கள் பயனர்கள் தன்னிச்சையான டைம்சீட் பதிவுகளை பதிவு செய்ய விரும்பவில்லையா? நேர-கடிகார பயன்முறைக்கு மாறவும், இது “பஞ்ச் இன்” மற்றும் “பஞ்ச் அவுட்” பதிவுகளை மட்டுமே அனுமதிக்கிறது.

# feature->duration-only->name
source: Duration only
ta: காலம் மட்டுமே

# feature->duration-only->description
source: If your local laws require you to only show durations instead of start and end date-time, you can activate that mode globally.
ta: உங்கள் உள்ளக சட்டங்கள் தொடக்க மற்றும் இறுதி தேதி நேரத்திற்கு பதிலாக காலங்களை மட்டுமே காட்ட வேண்டும் என்றால், நீங்கள் அந்த பயன்முறையை உலகளவில் செயல்படுத்த முடியும்.

# feature->rates->name
source: Rate calculation
ta: வீதக் கணக்கீடு

# feature->rates->description
source: Rates can be calculated based on hourly and fixed amounts, configurable for customers, projects, activities and each timesheet record individually.
ta: வாடிக்கையாளர்களுக்காக கட்டமைக்கக்கூடிய மணிநேர மற்றும் நிலையான தொகைகளின் அடிப்படையில் விகிதங்களை கணக்கிட முடியும், திட்டங்கள், செயல்பாடுகள் மற்றும் ஒவ்வொரு டைம்சீட் பதிவும் தனித்தனியாக.

# feature->timesheet-filter->name
source: Timesheet filter
ta: டைம்சீட் வடிகட்டி

# feature->timesheet-filter->description
source: You can filter all time-records by user, customer, project, activity and date.
ta: பயனர், வாடிக்கையாளர், திட்டம், செயல்பாடு மற்றும் தேதி ஆகியவற்றால் அனைத்து நேர பதிவுகளையும் வடிகட்டலாம்.

# feature->permissions->name
source: Permissions
ta: அனுமதிகள்

# feature->permissions->description
source: Customizable permission structure. Assign different roles to your user, e.g. users can record times, teamleads can print invoices and configure project/activities, admins can configure users and customers.
ta: தனிப்பயனாக்கக்கூடிய இசைவு அமைப்பு. உங்கள் பயனருக்கு வெவ்வேறு பாத்திரங்களை ஒதுக்குங்கள், எ.கா. பயனர்கள் நேரங்களை பதிவு செய்யலாம், டீம்லீட்ச் விலைப்பட்டியல்களை அச்சிடலாம் மற்றும் திட்டம்/செயல்பாடுகளை உள்ளமைக்கலாம், நிர்வாகிகள் பயனர்களையும் வாடிக்கையாளர்களையும் உள்ளமைக்க முடியும்.

# feature->user-profile->name
source: User profile
ta: பயனர் சுயவிவரம்

# feature->user-profile->description
source: Personal statistics and per user settings for hourly rate, Kimai theme, password and avatar.
ta: தனிப்பட்ட புள்ளிவிவரங்கள் மற்றும் ஒரு பயனர் அமைப்புகளுக்கு மணிநேர விகிதம், கிமாய் கருப்பொருள், கடவுச்சொல் மற்றும் அவதார்.

# feature->user-registration->name
source: User registration
ta: பயனர் பதிவு

# feature->user-registration->description
source: Kimai supports user self-registration with e-mail activation.
ta: கிமாய் மின்னஞ்சல் செயல்படுத்தலுடன் பயனர் தன்வய பதிவை ஆதரிக்கிறது.

# feature->password-reset->name
source: Password reset
ta: கடவுச்சொல் மீட்டமைப்பு

# feature->password-reset->description
source: Forgot your password? Kimai helps you reset it via e-mail.
ta: உங்கள் கடவுச்சொல்லை மறந்துவிட்டீர்களா? கிமாய் அதை மின்னஞ்சல் வழியாக மீட்டமைக்க உதவுகிறது.

# feature->customer-portal->name
source: Customer Portal
ta: வாடிக்கையாளர் போர்டல்

# feature->customer-portal->description
source: Share client and project statistics and timesheets with anyone using a secret URL, optionally password protected.
ta: கிளையன்ட் மற்றும் திட்ட புள்ளிவிவரங்கள் மற்றும் டைம்சீட்களை ரகசிய முகவரி ஐப் பயன்படுத்தி யாருடனும் பகிர்ந்து கொள்ளுங்கள், விருப்பமாக கடவுச்சொல் பாதுகாக்கப்படுகிறது.

# feature->dark-mode->name
source: Dark mode
ta: இருண்ட முறை

# feature->dark-mode->description
source: Because every app needs a dark-mode, which helps to reduce eye strain in the evening or in dark environments.
ta: ஏனெனில் ஒவ்வொரு பயன்பாட்டிற்கும் ஒரு இருண்ட முறை தேவை, இது மாலையில் அல்லது இருண்ட சூழல்களில் கண் அழுத்தத்தை குறைக்க உதவுகிறது.

# feature->no-limits->name
source: Knows no limits
ta: வரம்புகள் எதுவும் தெரியாது

# feature->no-limits->description
source: Your SaaS software always includes limits? Not Kimai: there are no limits. You only pay for the amount of active users. I don't limit you, and I do not charge for inactive users. You can create an unlimited amount of users, customers, projects, activities, timesheets and more.
ta: உங்கள் சாச் மென்பொருளில் எப்போதும் வரம்புகள் உள்ளனவா? கிமாய் அல்ல: வரம்புகள் இல்லை. செயலில் உள்ள பயனர்களின் அளவை மட்டுமே நீங்கள் செலுத்துகிறீர்கள். நான் உன்னை மட்டுப்படுத்தவில்லை, செயலற்ற பயனர்களுக்கு நான் கட்டணம் வசூலிக்கவில்லை. நீங்கள் வரம்பற்ற பயனர்கள், வாடிக்கையாளர்கள், திட்டங்கள், செயல்பாடுகள், நேர அட்டவணைகள் மற்றும் பலவற்றை உருவாக்கலாம்.

# feature->privacy->name
source: Privacy comes first
ta: தனியுரிமை முதலில் வருகிறது

# feature->privacy->description
source: I respect your and your users privacy and data. No, this is not yet another boring introduction into a Privacy policy - that's how I run this business. I don't sell data. I follow the GDPR and will answer any question about involved sub-processors.
ta: உங்கள் மற்றும் உங்கள் பயனர்களின் தனியுரிமை மற்றும் தரவை நான் மதிக்கிறேன். இல்லை, இது ஒரு தனியுரிமைக் கொள்கையில் மற்றொரு சலிப்பான அறிமுகம் அல்ல - இந்த வணிகத்தை நான் எவ்வாறு நடத்துகிறேன். நான் தரவை விற்கவில்லை. நான் சிடிபிஆரைப் பின்பற்றுகிறேன், சம்பந்தப்பட்ட துணை செயலிகள் பற்றிய எந்தவொரு கேள்விக்கும் பதிலளிப்பேன்.

# feature->security->name
source: Security in Kimai
ta: கைமியில் பாதுகாப்பு

# feature->security->description
source: Kimai implements best-practices in application design to prevent common attacks. Automated security controls are critical to any software development workflow to reduce the amount of time from creation to defect detection. These scans run on every code change, every time.
ta: பொதுவான தாக்குதல்களைத் தடுக்க பயன்பாட்டு வடிவமைப்பில் சிறந்த நடைமுறைகளை கிமாய் செயல்படுத்துகிறது. எந்தவொரு மென்பொருள் மேம்பாட்டு பணிப்பாய்வுகளுக்கும் தானியங்கு பாதுகாப்பு கட்டுப்பாடுகள் முக்கியமானவை, இது படைப்பிலிருந்து கண்டறிதலுக்கான நேரத்தைக் குறைக்க. இந்த ச்கேன் ஒவ்வொரு குறியீடு மாற்றத்திலும், ஒவ்வொரு முறையும் இயங்குகிறது.

# feature->security->points->security_1
source: Secure password hashing with Argon2 or Sodium
ta: ஆர்கான் 2 அல்லது சோடியத்துடன் பாதுகாப்பான கடவுச்சொல் ஆசிங்

# feature->security->points->security_2
source: Granular user-roles restricting access
ta: அணுகலைக் கட்டுப்படுத்தும் சிறுமணி பயனர்-பாத்திரங்கள்

# feature->security->points->security_3
source: CSRF and XSS protection
ta: சி.எச்.ஆர்.எஃப் மற்றும் எக்ச்எச்எச் பாதுகாப்பு

# feature->security->points->security_4
source: Continuous integration with thousands of checks
ta: ஆயிரக்கணக்கான காசோலைகளுடன் தொடர்ச்சியான ஒருங்கிணைப்பு

# feature->security->points->security_5
source: In-depth code reviews
ta: ஆழமான குறியீடு மதிப்புரைகள்

# feature->security->points->security_6
source: Automated code test with a code coverage above 90%
ta: 90% க்கு மேல் குறியீடு கவரேச் கொண்ட தானியங்கி குறியீடு சோதனை

# feature->security-cloud->name
source: Security in the platform
ta: மேடையில் பாதுகாப்பு

# feature->security-cloud->description
source: Software is only as secure as the system it runs on. I take a defense-in-depth approach with server and network infrastructure. Customers on the hosted platform are secured through multiple layers of protection.
ta: மென்பொருள் அது இயங்கும் கணினியைப் போலவே பாதுகாப்பானது. சேவையகம் மற்றும் பிணையம் உள்கட்டமைப்புடன் பாதுகாப்பு-ஆழமான அணுகுமுறையை நான் எடுத்துக்கொள்கிறேன். புரவலன் செய்யப்பட்ட தளத்தில் உள்ள வாடிக்கையாளர்கள் பல அடுக்குகளின் மூலம் பாதுகாக்கப்படுகிறார்கள்.

# feature->security-cloud->points->security_1
source: All connections secured via TLS (SSL)
ta: டி.எல்.எச் (எச்.எச்.எல்) வழியாக பாதுகாக்கப்பட்ட அனைத்து இணைப்புகளும்

# feature->security-cloud->points->security_2
source: Best-practice security, firewalls and brute-force prevention
ta: சிறந்த நடைமுறை பாதுகாப்பு, ஃபயர்வால்கள் மற்றும் முரட்டுத்தனமான தடுப்பு

# feature->security-cloud->points->security_3
source: No multi-tenancy, each customer has their own database
ta: பல குத்தகைதாரர் இல்லை, ஒவ்வொரு வாடிக்கையாளருக்கும் அவற்றின் சொந்த தரவுத்தளம் உள்ளது

# feature->security-cloud->points->security_4
source: Servers are hosted in a data center in the EU
ta: சேவையகங்கள் ஐரோப்பிய ஒன்றியத்தில் ஒரு தரவு மையத்தில் வழங்கப்படுகின்றன

# feature->security-cloud->points->security_5
source: Critical services are not accessible to the outside world
ta: முக்கியமான சேவைகள் வெளி உலகத்திற்கு அணுக முடியாது

# feature->security-cloud->points->security_6
source: Code runs in tightly restricted domain environments
ta: இறுக்கமாக தடைசெய்யப்பட்ட டொமைன் சூழல்களில் குறியீடு இயங்குகிறது

# install->ssh
source: This method installs Kimai directly on your server.
ta: இந்த முறை கிமாயை உங்கள் சேவையகத்தில் நேரடியாக நிறுவுகிறது.

# install->docker
source: Use our Docker image to install and update Kimai container easily.
ta: கிமாய் கொள்கலனை எளிதாக நிறுவவும் புதுப்பிக்கவும் எங்கள் கப்பல்துறை படத்தைப் பயன்படுத்தவும்.

# install->kubernetes
source: You can deploy Kimai to Kubernetes using our Helm-Charts.
ta: எங்கள் எல்ம்-விளக்கப்படங்களைப் பயன்படுத்தி கிமாயை குபெர்னெட்சுக்கு அனுப்பலாம்.

# install->cloud
source: No need to install Kimai, you can start using it right now.
ta: கிமாயை நிறுவ தேவையில்லை, நீங்கள் இப்போது அதைப் பயன்படுத்தத் தொடங்கலாம்.

# install->caddy-docker
source: Using Docker-Compose and Caddy as reverse-proxy with SSL support.
ta: எச்எச்எல் ஆதரவுடன் தலைகீழ்-பிராக்சியாக டோக்கர்-கம்போச் மற்றும் கேடியைப் பயன்படுத்துதல்.

# install->alert-vps
source: At this stage, it’s not possible to install Kimai by downloading a ZIP file and uploading the files to your web server. You need to have SSH access to your server. This doesn’t necessarily mean you need a VPS. Some shared hosts give you SSH access, through which you should be able to install Composer and Kimai just fine.
ta: இந்த கட்டத்தில், சிப் கோப்பைப் பதிவிறக்கி, கோப்புகளை உங்கள் வலை சேவையகத்தில் பதிவேற்றுவதன் மூலம் கிமாயை நிறுவ முடியாது. உங்கள் சேவையகத்திற்கு பாஓடு அணுகல் இருக்க வேண்டும். உங்களுக்கு ஒரு வி.பி.எச் தேவை என்று அர்த்தமல்ல. சில பகிரப்பட்ட ஓச்ட்கள் உங்களுக்கு பாஓடு அணுகலை வழங்குகின்றன, இதன் மூலம் நீங்கள் இசையமைப்பாளர் மற்றும் கிமாயை நன்றாக நிறுவ முடியும்.

# developer->kevinpapst->intro
source: It has always been my dream to make a living with an open source product. With Kimai, I have been able to develop a software that provides great value to my customers and whose development drives me every day. My special thanks to the great community for their loyalty over the years, I'm looking forward to the next 10 years of Kimai 🚀
ta: திறந்த மூல தயாரிப்புடன் ஒரு வாழ்க்கையை உருவாக்குவது எப்போதுமே எனது கனவு. கிமாய் மூலம், எனது வாடிக்கையாளர்களுக்கு அதிக மதிப்பை வழங்கும் ஒரு மென்பொருளை என்னால் உருவாக்க முடிந்தது, மேலும் அதன் வளர்ச்சி ஒவ்வொரு நாளும் என்னை இயக்குகிறது. பல ஆண்டுகளாக பெரிய சமூகத்திற்கு அவர்களின் விசுவாசத்திற்கு எனது சிறப்பு நன்றி, நான் கிமாயின் அடுத்த 10 ஆண்டுகளை எதிர்பார்க்கிறேன்

# history->intro
source: What started as a hobby project is now the world's leading open source time tracking application. Let's take a look at its history.
ta: ஒரு பொழுதுபோக்கு திட்டமாகத் தொடங்கியது இப்போது உலகின் முன்னணி திறந்த மூல நேர கண்காணிப்பு பயன்பாடாகும். அதன் வரலாற்றைப் பார்ப்போம்.

# history->early-days-subtitle
source: Kimai has a long history and has been around since 2006, here is a brief overview of how it all started.
ta: கிமாய் ஒரு நீண்ட வரலாற்றைக் கொண்டுள்ளது மற்றும் 2006 முதல் உள்ளது, இது எவ்வாறு தொடங்கியது என்பதற்கான சுருக்கமான கண்ணோட்டம் இங்கே.

# history->early-days-title
source: How it all began
ta: இது எப்படி தொடங்கியது
