Repository: 247i/TACETr
Catalog: உரை/தானி/kimai-website-*.po
Languages: ta

# made-with-love
source: Developed by
ta: உருவாக்கியது

source: Developed at
ta: இல் உருவாக்கப்பட்டது

source: Access demo
ta: செயற்காட்சியை அணுகு

# docu-alert-english
source: Content is only available in English
ta: உள்ளடக்கம் ஆங்கிலத்தில் மட்டுமே கிடைக்கிறது

# store-hero-counter
source: More than %number% customers trust Kimai
ta: %number% வாடிக்கையாளர்கள் கிமாயை நம்புகிறார்கள்

# store-contribute-title
source: Contribute
ta: பங்களி

# store-contribute-subtitle
source: Are you a developer? Read how to
ta: நீங்கள் நிரலாளரா? எப்படி என்று படியுங்கள்

# store-contribute-plugin
source: create a new plugin
ta: புதிய சொருகி உருவாக்கவும்

# store-contribute-store
source: add your software here
ta: உங்கள் மென்பொருளை இங்கே சேர்க்கவும்

# store-plugins-title
source: Find more plugins
ta: மேலும் செருகுநிரல்களைக் கண்டறியவும்

# store-plugins-subtitle
source: You can search through the following GitHub topics to find more plugins
ta: மேலும் செருகுநிரல்களைக் கண்டுபிடிக்கப் பின்வரும் அறிவிலிமையம் தலைப்புகள்மூலம் தேடலாம்

# store-category-plugins
source: Plugins for your Kimai installation
ta: உங்கள் கிமாய் நிறுவலுக்கான செருகுநிரல்கள்

# store-category-apps
source: Native apps for your mobile device
ta: உங்கள் மொபைல் சாதனத்திற்கான சொந்த பயன்பாடுகள்

# store-category-client
source: Other ways to connect to Kimai
ta: கிமாயுடன் இணைக்கப் பிற வழிகள்

# store-category-desktop
source: Desktop applications
ta: மேசை செயலிகள்

# store-license-manager
source: Please enter a valid email address to download your plugins and manage your licences.
ta: உங்கள் செருகுநிரல்களைப் பதிவிறக்கி உங்கள் உரிமங்களை நிர்வகிக்க சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்.

# demo-reinstall
source: Demo will be reinstalled in %X% minutes.
ta: செயற்காட்சி %X% நிமையங்களில் மீண்டும் நிறுவப்படும்.

# homepage-quote-excel
source: With Kimai, the boring process of feeding Excel spreadsheets with your working hours is not only simplified, it also offers dozens of other exciting features that you don't even know you're missing so far!
ta: கிமாயுடன், உங்கள் வேலை நேரத்துடன் எக்செல் விரிதாள்களை உணவளிக்கும் சலிப்பான செயல்முறை எளிமைப்படுத்தப்படுவது மட்டுமல்லாமல், நீங்கள் இதுவரை காணவில்லை என்று கூட உங்களுக்குத் தெரியாத பல கணக்கான பிற அற்புதமான நற்பண்புகளையும் இது வழங்குகிறது!

# homepage-features-title
source: Feature list
ta: கூறுபாடு பட்டியல்

# homepage-features-subtitle
source: The following non-exhaustive list highlights some exciting features Kimai offers.
ta: கிமாய் வழங்கும் சில அற்புதமான அம்சங்களைப் பின்வரும் முழுமையான பட்டியல் எடுத்துக்காட்டுகிறது.

# homepage-alert-title
source: Free time-tracking for everyone
ta: அனைவருக்கும் இலவச நேர கண்காணிப்பு

# homepage-alert-intro
source: Kimai is an open-source time tracking solution. It tracks work time and prints out a summary of your activities on demand. Yearly, monthly, daily, by customer, by project … Its simplicity is its strength. Due to Kimai’s browser based interface it runs cross-platform, even on your mobile device.
ta: கிமாய் ஒரு திறந்த மூல நேர கண்காணிப்பு தீர்வாகும். இது வேலை நேரத்தைக் கண்காணிக்கிறது மற்றும் தேவைக்கேற்ப உங்கள் செயல்பாடுகளின் சுருக்கத்தை அச்சிடுகிறது. ஆண்டு, மாதாந்திர, நாள்தோறும், வாடிக்கையாளரால், திட்டத்தால்… அதன் எளிமை அதன் வலிமை. கிமாயின் உலாவி அடிப்படையிலான இடைமுகம் காரணமாக இது உங்கள் மொபைல் சாதனத்தில் கூட குறுக்கு-தளம் இயங்குகிறது.

# homepage-alert-button-download
source: Download
ta: பதிவிறக்கம்

# homepage-alert-button-demo
source: Try first
ta: முதலில் முயற்சிக்கவும்

# cloud-title
source: Kimai Cloud (SaaS)
ta: கியாச் முகில் (சாச்)

# cloud-feature-ssl
source: Free TLS (SSL) certificate
ta: இலவச டிஎல்எச் (எச்எச்எல்) சான்றிதழ்

# cloud-feature-hosting
source: Hosting and Updates
ta: ஓச்டிங் மற்றும் புதுப்பிப்புகள்

# cloud-feature-backups
source: Backups
ta: காப்புப்பிரதிகள்

# cloud-free-plan
source: Free plan available for 3 users
ta: 3 பயனர்களுக்கு இலவச திட்டம் கிடைக்கிறது

# cloud-call-to-action
source: Start for free
ta: இலவசமாகத் தொடங்குங்கள்

source: Login
ta: புகுபதிவு

# footer
source: Time tracking made easy. An open-source solution for teams of all sizes - self-hosted or SaaS.
ta: நேர கண்காணிப்பு எளிதானது. அனைத்து அளவிலான அணிகளுக்கும் ஒரு திறந்த மூல தீர்வு-தன்-ஓச்ட் அல்லது சாச்.

# slogan
source: #1 Open-Source Time-Tracking
ta: #1 திறந்த மூல நேர கண்காணிப்பு

# share-post
source: Share this post
ta: இந்த இடுகையைப் பகிரவும்

# new-badge
source: New
ta: புதிய

# free-badge
source: For free
ta: இலவசமாக

# price-contract
source: Upon request
ta: கோரிக்கையின் பேரில்

# store-back
source: Back to
ta: திரும்பு

# store-features
source: Features
ta: நற்பொருத்தங்கள்

# store-purchase
source: Purchase
ta: வாங்க

# store-buy-button
source: Buy now
ta: இப்போது வாங்க

# store-payment-methods
source: Available payment methods
ta: கிடைக்கும் கட்டண முறைகள்

# store-offered-by
source: Offered by
ta: வழங்கியவர்

# store-plugins-onpremise
source: Plugins are for on-premises customers, cloud users have access to plugins labelled %cloud%
ta: செருகுநிரல்கள் வளாகத்தில் உள்ள வாடிக்கையாளர்களுக்கானவை, முகில் பயனர்களுக்கு %cloud% எனப் பெயரிடப்பட்ட செருகுநிரல்களுக்கு அணுகல் உள்ளது

# price-without-vat
source: excl. VAT
ta: வரியின்றி

# screenshots-title
source: Screenshots
ta: திரைக்காட்சிகள்

source: Installation
ta: நிறுவல்

source: Updates
ta: புதுப்பிப்புகள்

source: Username
ta: பயனர்பெயர்

source: Password
ta: கடவுச்சொல்

# try-it
source: Demo
ta: செயற்காட்சி

# plugin-demo-at
source: You can test this plugin at
ta: இந்தச் சொருகி ஒன்றை நீங்கள் சோதிக்கலாம்

# plugin-demo-accounts
source: Find more test accounts here
ta: மேலும் சோதனை கணக்குகளை இங்கே காணலாம்

source: Read more
ta: மேலும் வாசிக்க

source: Contact
ta: தொடர்பு

# download-btn
source: Download
ta: பதிவிறக்கம்

source: Compatibility
ta: பொருந்தக்கூடிய தன்மை

# compatibility-kimai
source: Minimum Kimai version
ta: மினிமுக் கொமிபி பதிப்பு

# compatibility-bundle
source: Bundle version
ta: மூட்டைப் பதிப்பு

# compatibility-info
source: The following table contains a comparison between plugin and required minimum Kimai version.
ta: பின்வரும் அட்டவணையில் சொருகி மற்றும் தேவையான குறைந்தபட்ச கிமாய் பதிப்பிற்கு இடையிலான ஒப்பீடு உள்ளது.

source: Table of contents
ta: உள்ளடக்க அட்டவணை

source: Copy files
ta: கோப்புகளை நகலெடு

source: Clear cache
ta: தற்காலிக சேமிப்பு துடை

source: Create database
ta: தரவுத்தளத்தை உருவாக்கவும்

source: Install assets
ta: சொத்துக்களை நிறுவவும்

# ask-question
source: Ask a question
ta: ஒரு கேள்வி கேளு

# full-documentation
source: Full documentation in English
ta: ஆங்கிலத்தில் முழு ஆவணங்கள்

# contact-developer
source: If you have any question, please use the following contact information to get in touch with the developer directly.
ta: உங்களிடம் ஏதேனும் கேள்வி இருந்தால், நிரலாளருடன் நேரடியாகத் தொடர்பு கொள்ள பின்வரும் தொடர்புத் தகவலைப் பயன்படுத்தவும்.

# about-who
source: Who is building Kimai?
ta: கிமாய் கட்டுவது யார்?

source: Description
ta: விவரம்

source: per year
ta: வருடத்திற்கு

source: Roadmap
ta: பாதை வரைபடம்

source: Licenses
ta: உரிமங்கள்

# purchase-power-parity
source: Can't pay? Reach out for a PPP discount.
ta: செலுத்த முடியவில்லையா? பிபிபி தள்ளுபடியை அடையுங்கள்.

# changelogs->name
source: Changelog
ta: மாற்றபதிவு

# changelogs->title
source: Changelog Kimai Cloud
ta: மாற்றப்பதிவு கிமாய் முகில்

# changelogs->intro
source: Overview of all Kimai cloud updates and when they were installed.
ta: அனைத்து கிமாய் முகில் புதுப்பிப்புகளின் கண்ணோட்டம் மற்றும் அவை நிறுவப்பட்டபோது.

# cloud-cta->days_30
source: Sign up for your 30-days free trial
ta: உங்கள் 30 நாட்கள் இலவச சோதனைக்குப் பதிவுபெறுக

# industries->name
source: Industries
ta: தொழில்கள்

# community->name
source: Community
ta: சமூகம்

# forum->name
source: Forum
ta: மன்றம்

# reviews->name
source: Reviews
ta: மதிப்புரைகள்

# reviews->leave
source: Leave your review
ta: உங்கள் மதிப்பாய்வை இடுங்கள்

# reviews->subtitle
source: Thousands of companies use Kimai everyday to track their times. Here's what some of them have to say …
ta: ஆயிரக்கணக்கான நிறுவனங்கள் தங்கள் நேரங்களைக் கண்காணிக்க தினமும் கிமாயைப் பயன்படுத்துகின்றன. அவர்களில் சிலர் சொன்னது இங்கே …

# cloud->status
source: Status
ta: நிலை

# faq->title
source: FAQ
ta: கேள்விகள்

# faq->intro
source: These FAQs are provided by the developer of this offer.
ta: இந்தக் கேள்விகள் இந்தச் சலுகையின் டெவலப்பரால் வழங்கப்படுகின்றன.

# oss-cloud-compare->title
source: One software, two versions
ta: ஒரு மென்பொருள், இரண்டு பதிப்புகள்

# oss-cloud-compare->intro
source: Kimai is an open source software that is available for self-hosting as well as SaaS.
ta: கிமாய் என்பது ஒரு திறந்த மூல மென்பொருளாகும், இது தன்வய புரவலன் மற்றும் சேமெ.

# oss-cloud-compare->saas
source: Hosted for you
ta: உங்களுக்காகப் புரவலன் செய்யப்பட்டது

# oss-cloud-compare->onpremise
source: Hosted by you
ta: நீங்கள் தொகுத்து வழங்கியது

# highlight->title
source: Supports your business
ta: உங்கள் வணிகத்தை ஆதரிக்கிறது

# highlight->subtitle
source: Kimai has all the business core features you need to setup your time-tracking workflows and integrate it with your existing infrastructure.
ta: கிமாய் உங்கள் நேரத்தைக் கண்காணிக்கும் பணிப்பாய்வுகளை அமைத்து, அதை உங்கள் இருக்கும் உள்கட்டமைப்புடன் ஒருங்கிணைக்கத் தேவையான அனைத்து வணிக நிறுவன நற்பண்புகளையும் கொண்டுள்ளது.

# highlight->reasons->oss
source: Open Source
ta: திறந்த மூல

# highlight->reasons->enterprise
source: Enterprise add-ons
ta: நிறுவன துணை நிரல்கள்

# highlight->reasons->versions
source: Cloud and On-Premise
ta: முகில் மற்றும் நிறுவனத்தில்

# highlight->reasons->gdpr
source: GDPR compliant
ta: சிடிபிஆர் இணக்கம்

# highlight->reasons->european
source: Independent and European 🇪🇺 – built in Austria 🇦🇹 and hosted in Germany 🇩🇪 with a strong commitment to data protection, transparency and open-source quality.
ta: சுயாதீன மற்றும் ஐரோப்பிய 🇪🇺-ஆச்திரியாவில் கட்டப்பட்டது 🇦🇹 மற்றும் செர்மனியில் புரவலன் செய்யப்பட்டது தரவு பாதுகாப்பு, வெளிப்படைத்தன்மை மற்றும் திறந்த-மூல தரத்திற்கு வலுவான அர்ப்பணிப்புடன்.

# testimonials->title
source: What users say about Kimai
ta: கிமாய் பற்றிப் பயனர்கள் என்ன சொல்கிறார்கள்

# section-teaser->work-contract->title
source: Working time accounts
ta: வேலை நேர கணக்குகள்

# section-teaser->work-contract->description
source: Debit and overtime hours, monthly statements.
ta: பற்று மற்றும் கூடுதல் நேர நேரம், மாதாந்திர அறிக்கைகள்.

# section-teaser->timesheet->title
source: Time-Tracking
ta: நேர கண்காணிப்பு

# section-teaser->timesheet->description
source: Easy input of work done and clear control.
ta: முடிந்த வேலையின் எளிதான உள்ளீடு மற்றும் தெளிவான கட்டுப்பாடு.

# section-teaser->report->title
source: Reports
ta: அறிக்கைகள்

# section-teaser->report->description
source: Reports for the evaluation of users and projects.
ta: பயனர்கள் மற்றும் திட்டங்களின் மதிப்பீட்டிற்கான அறிக்கைகள்.

# section-teaser->dashboard->title
source: Dashboard
ta: முகப்புப்பெட்டி

# section-teaser->dashboard->description
source: Dashboard with configurable widgets.
ta: உள்ளமைக்கக்கூடிய நிரல்பலகளுடன் முகப்பலகம்.

# section-teaser->absence->title
source: Absences
ta: இல்லாதது

# section-teaser->absence->description
source: Public holidays, vacation, illness and absences.
ta: பொது விடுமுறை, விடுவு, நோய் மற்றும் இல்லாதது.

# section-features->title
source: What can Kimai do for you?
ta: கிமாய் உங்களுக்கு என்ன செய்ய முடியும்?

# section-features->subtitle
source: Kimai offers much more than just time-tracking, here is a list of other important business functions.
ta: கிமாய் நேரத்தைக் கண்காணிப்பதை விட அதிகமாக வழங்குகிறது, பிற முக்கியமான வணிக செயல்பாடுகளின் பட்டியல் இங்கே.

# homepage->title
source: Time tracking for project-driven teams
ta: திட்டத்தால் இயக்கப்படும் அணிகளுக்கான நேர கண்காணிப்பு

# homepage->intro
source: Our open-source platform is designed to keep track of and analyze your company's time-data, making it perfect for businesses of all sizes. Kimai helps you keep an eye on time and money.
ta: எங்கள் திறந்த மூல தளம் உங்கள் நிறுவனத்தின் நேரக் கடனைக் கண்காணிக்கவும் பகுப்பாய்வு செய்யவும் வடிவமைக்கப்பட்டுள்ளது, இது எல்லா அளவிலான வணிகங்களுக்கும் சரியானதாக அமைகிறது. நேரம் மற்றும் பணத்தை ஒரு கண் வைத்திருக்கக் கிமாய் உங்களுக்கு உதவுகிறது.

# open-source-community->name
source: Open Source
ta: திறந்த மூலம்

# newsletter->title
source: Don't Want to Miss Anything?
ta: எதையும் இழக்க விரும்பவில்லையா?

# newsletter->introduction
source: Subscribe to our newsletter and stay updated about Kimai and Plugin updates.
ta: எங்கள் செய்திமடலுக்கு குழுசேரவும், கிமாய் மற்றும் சொருகி புதுப்பிப்புகள் பற்றிப் புதுப்பிக்கவும்.

# newsletter->email-title
source: Your email address
ta: உங்கள் மின்னஞ்சல் முகவரி

# newsletter->email-help
source: Provide your email address to subscribe.
ta: குழுசேர உங்கள் மின்னஞ்சல் முகவரியை வழங்கவும்.

# newsletter->field-invalid
source: The information provided is invalid. Please review the format and try again.
ta: வழங்கப்பட்ட தகவல்கள் தவறானவை. தயவுசெய்து வடிவமைப்பை மதிப்பாய்வு செய்து மீண்டும் முயற்சிக்கவும்.

# newsletter->field-required
source: This field cannot be left blank.
ta: இந்தப் புலத்தைக் காலியாக விட முடியாது.

# newsletter->captcha-help
source: Very sorry for the Captcha, we know it's annoying!
ta: குறிதெளிதலுக்கு மிகவும் வருந்துகிறேன், அது எரிச்சலூட்டும் என்று எங்களுக்குத் தெரியும்!

# newsletter->sendinblue
source: We use Brevo as our marketing platform. By submitting this form, you acknowledge that the information you provided will be transferred to Brevo for processing in accordance with their %terms%.
ta: எங்கள் சந்தைப்படுத்தல் தளமாக ப்ரெவோவைப் பயன்படுத்துகிறோம். இந்தப் படிவத்தைச் சமர்ப்பிக்க கீழே சொடுக்கு செய்வதன் மூலம், நீங்கள் வழங்கிய தகவல்கள் அவற்றின் %terms% விதிமுறைகளுக்கு ஏற்பச் செயலாக்குவதற்காக ப்ரெவோவுக்கு மாற்றப்படும் என்பதை நீங்கள் ஒப்புக்கொள்கிறீர்கள்.

# newsletter->terms
source: terms of use
ta: பயன்பாட்டு விதிமுறைகள்

# newsletter->button
source: SUBSCRIBE
ta: குழுசேர்

# photos->dashboard->title
source: Dashboard
ta: முகப்புப்பெட்டி

# photos->dashboard->description
source: Get an insight with several statistics about your time-tracking records and more
ta: உங்கள் நேர கண்காணிப்பு பதிவுகள் மற்றும் பலவற்றைப் பற்றிய பல புள்ளிவிவரங்களுடன் ஒரு நுண்ணறிவைப் பெறுங்கள்

# photos->invoice->title
source: Invoices
ta: விலைப்பட்டியல்

# photos->invoice->description
source: Create invoices for your customers in several formats (PDF, DOCX, ODT)
ta: உங்கள் வாடிக்கையாளர்களுக்குப் பல வடிவங்களில் (PDF, DOCX, ODT) விலைப்பட்டியல் உருவாக்கவும்

# photos->timesheet->title
source: Time-Tracking
ta: நேர கண்காணிப்பு

# photos->timesheet->description
source: Create and manage your working times and export them to Excel, PDF or HTML
ta: உங்கள் வேலை நேரங்களை உருவாக்கி நிர்வகித்து அவற்றை அசத்து, எஆவ அல்லது உஉகுமொ வடிவில் ஏற்றுமதி

source: Donate
ta: நன்கொடை

# demo->name
source: Demo
ta: செயற்காட்சி

# demo->description
source: Test and evaluate our time-tracker Kimai online, directly from our demo page.
ta: எங்கள் செயற்காட்சி பக்கத்திலிருந்து நேரடியாக எங்கள் நேர கண்காணிப்பு கிமாயை ஆன்லைனில் சோதித்து மதிப்பீடு செய்யுங்கள்.

# demo->title
source: Test Kimai in one of the demos
ta: கிமாயை செயற்காட்சிகளில் ஒன்றில் சோதிக்கவும்

# demo->introduction
source: Try out the Kimai time-tracking demo, and we promise: you'll keep on using it!
ta: கிமாய் நேர-கண்காணிப்பு செயற்காட்சியை முயற்சிக்கவும், நாங்கள் வாய்மை செய்கிறோம்: நீங்கள் அதைப் பயன்படுத்திக் கொண்டே இருப்பீர்கள்!

# demo->choose
source: Please choose one of our demo installations, to get a first impression on how Kimai feels and which functionality it provides.
ta: கிமாய் எப்படி உணர்கிறார், எந்த செயல்பாட்டை வழங்குகிறது என்பதில் முதல் தோற்றத்தைப் பெற, எங்கள் செயற்காட்சி நிறுவல்களில் ஒன்றைத் தேர்வுசெய்க.

# demo->reinstall
source: Be aware that the demos will be reinstalled on a regular schedule and all entered data will be removed.
ta: செயற்காட்சிகள் வழக்கமான அட்டவணையில் மீண்டும் நிறுவப்படும் என்பதையும், உள்ளிடப்பட்ட அனைத்து தரவுகளும் அகற்றப்படும் என்பதையும் அறிந்து கொள்ளுங்கள்.

source: Demo user
ta: செயற்காட்சி பயனர்

# demo->accounts
source: These accounts are available for your tests. Or you create your own test user in the login form of each demo.
ta: உங்கள் சோதனைகளுக்கு இந்த கணக்குகள் கிடைக்கின்றன. அல்லது ஒவ்வொரு செயற்காட்சியின் உள்நுழைவு வடிவத்தில் உங்கள் சொந்த சோதனை பயனரை உருவாக்குகிறீர்கள்.

# demo->role_user
source: User
ta: பயனர்

# demo->role_teamlead
source: Teamlead
ta: குழு தலைவர்

# demo->role_admin
source: Administrator
ta: நிர்வாகி

# demo->role_super
source: Super-Admin
ta: சூப்பர் நிர்வாகி

# demo->stable-title
source: Core
ta: வயிரம்

# demo->stable-description
source: The latest release, without plugins, without demo data.
ta: செயற்காட்சி தரவு இல்லாமல், செருகுநிரல்கள் இல்லாமல் அண்மைக் கால வெளியீடு.

# demo->plugins-title
source: Featured
ta: இடம்பெற்றது

# demo->plugins-description
source: Development version with plugins and demo data.
ta: செருகுநிரல்கள் மற்றும் டெமோ தரவுகளுடன் மேம்பாட்டு பதிப்பு.

# demo->empty-title
source: Plugins
ta: செருகுநிரல்கள்

# demo->empty-description
source: The current version with featured plugins, without data.
ta: தரவு இல்லாமல், பிரத்யேக செருகுநிரல்களுடன் தற்போதைய பதிப்பு.

# index->name
source: Home
ta: வீடு

# index->title
source: Kimai - Open Source time-tracker
ta: கிமாய் - திறந்த மூல நேர -கண்காணிப்பு

# index->description
source: Kimai - free and easy time-tracking for freelancer, agencies and companies with user and invoice handling.
ta: கிமாய் - ஃப்ரீலான்சர், ஏசென்சிகள் மற்றும் பயனர் மற்றும் விலைப்பட்டியல் கையாளுதலுடன் கூடிய நிறுவனங்களுக்கு இலவச மற்றும் எளிதான நேர கண்காணிப்பு.

# download->name
source: Installation
ta: நிறுவல்

# download->title
source: Kimai Installation
ta: கிரா நிறுவல்

# download->description
source: Download and Installation with SSH, Docker and Kubernetes - Kimai time-tracking
ta: பாஓடு, கப்பல்துறை மற்றும் குபெர்னெட்சுடன் பதிவிறக்கம் செய்து நிறுவுதல் - கிமாய் நேர -கண்காணிப்பு

# download->subtitle
source: Download and Installation
ta: பதிவிறக்கம் மற்றும் நிறுவல்

# download->intro
source: We offer several ways to install Kimai. Choose the option that suits you.
ta: கிமாயை நிறுவ நாங்கள் பல வழிகளை வழங்குகிறோம். உங்களுக்கு ஏற்ற விருப்பத்தைத் தேர்வுசெய்க.

# trademark->name
source: Trademark
ta: வணிக முத்திரை

# terms-cloud->name
source: Terms
ta: விதிமுறைகள்

# terms-cloud->title
source: Terms of service
ta: பணி விதிமுறைகள்

# terms-gdpr->name
source: Data Processing
ta: தரவுச் செயலாக்கம்

# terms-plugins->name
source: Plugin license
ta: சொருகி உரிமம்

# product->name
source: Product
ta: தயாரிப்பு

# onpremise->name
source: Self hosting
ta: தன்வய ஓச்டிங்

# hosted->name
source: Cloud
ta: முகில்

# hosted->title
source: Kimai-Cloud — Use Kimai directly without setup. Hassle-free Kimai hosting!
ta: கிமாய்-கிளவுட்-கிமாயை நேரடியாக அமைக்காமல் பயன்படுத்தவும். தொந்தரவு இல்லாத கிமாய் ஓச்டிங்!

# start-trial->name
source: Start 30-day free trial of Kimai
ta: கிமாயின் 30 நாள் கட்டற்ற சோதனையைத் தொடங்கு

# start-trial->title
source: Start free trial
ta: கட்டற்ற சோதனையைத் தொடங்கு

# start-trial->subtitle
source: Your own time-tracking system in 3 steps. Try Kimai for 30 days, free of charge and without risk.
ta: 3 படிகளில் உங்கள் சொந்த நேர கண்காணிப்பு அமைப்பு. கிமாயை 30 நாட்கள், கட்டற்ற மற்றும் இடர் இல்லாமல் முயற்சிக்கவும்.

# start-trial->video_subtitle
source: Simple as that: In 45 seconds to your own time-tracking!
ta: அது எளிது: உங்கள் சொந்த நேரத்தைக் கண்காணிக்க 45 நொடிகளில்!

# start-trial->step_1_title
source: Create account
ta: கணக்கை உருவாக்கு

# start-trial->step_1_text
source: Create your account with your Google account or email and password, the later needs to be verified with an email link.
ta: உங்கள் கூகிள் கணக்கு அல்லது மின்னஞ்சல் மற்றும் கடவுச்சொல்லுடன் உங்கள் கணக்கை உருவாக்கவும், பின்னர் மின்னஞ்சல் இணைப்புமூலம் சரிபார்க்க வேண்டும்.

# start-trial->step_2_title
source: Choose cloud name
ta: முகில் பெயரைத் தேர்வுசெய்க

# start-trial->step_2_text
source: After account activation you have to create your Kimai-Cloud instance by selecting a (subdomain) name.
ta: கணக்கு செயல்படுத்தலுக்குப் பிறகு, ஒரு (சப்டொமைன்) பெயரைத் தேர்ந்தெடுப்பதன் மூலம் உங்கள் கிமாய்-கிளவுட் நிகழ்வை உருவாக்க வேண்டும்.

# start-trial->step_3_title
source: Start time-tracking
ta: நேரக் கண்காணிப்பைத் தொடங்கு

# start-trial->step_3_text
source: After a short moment your Kimai-Cloud is ready for use, you can now login and start time-tracking.
ta: ஒரு குறுகிய கணத்திற்குப் பிறகு, உங்கள் கிமாய்-முகில் பயன்படுத்தத் தயாராக உள்ளது, நீங்கள் இப்போது உள்நுழைந்து நேரத்தைக் கண்காணிக்கலாம்.

# about->name
source: About Kimai
ta: கிமாய் பற்றி

# about->description
source: Find out about the history of the time-tracker Kimai and its developer.
ta: டைம்-டிராக்கர் கிமாய் மற்றும் அதன் டெவலப்பரின் வரலாறு பற்றி அறியவும்.

# about->kevin
source: Kimai and the Cloud are developed and operated by Kevin, an independent software-developer from Vienna (Austria).
ta: கிமாய் மற்றும் முகில் ஆகியவை வியன்னாவிலிருந்து (ஆச்திரியா) ஒரு சுயாதீனமான மென்பொருள்-மேம்பட்ட கெவின் உருவாக்கி இயக்கப்படுகின்றன.

# about->collaboration->title
source: Collaboration
ta: ஒத்துழைப்பு

# about->collaboration->content
source: Customers appreciate the convenience that comes with free support and the exchange is an essential part of my work. I love the community engagement at GitHub, the collaboration and the agile work. The constant improvement based on your feedback makes this journey an extraordinary experience.
ta: இலவச ஆதரவுடன் வரும் வசதியை வாடிக்கையாளர்கள் பாராட்டுகிறார்கள், பரிமாற்றம் எனது பணியின் முக்கிய பகுதியாகும். கிதுபில் சமூக ஈடுபாட்டை நான் விரும்புகிறேன், ஒத்துழைப்பு மற்றும் சுறுசுறுப்பான வேலை. உங்கள் கருத்தை அடிப்படையாகக் கொண்ட நிலையான முன்னேற்றம் இந்தப் பயணத்தை ஒரு அசாதாரண அனுபவமாக ஆக்குகிறது.

# about->technology->title
source: Technology
ta: தொழில்நுட்பம்

# about->technology->content
source: As developer, I love testing new technologies. And if this improves the way you interact with Kimai, I'd call it a win-win situation. UI and UX are crucial to me because software has to be easy to use. Security is default requirement and open source software is a important success factor for many businesses.
ta: டெவலப்பராக, புதிய தொழில்நுட்பங்களைச் சோதிப்பதை நான் விரும்புகிறேன். இது கிமாயுடன் நீங்கள் தொடர்பு கொள்ளும் முறையை மேம்படுத்தினால், நான் அதை ஒரு வெற்றி-வெற்றி நிலைமை என்று அழைக்கிறேன். இடைமுகம் மற்றும் UX எனக்கு முக்கியமானவை, ஏனெனில் மென்பொருள் பயன்படுத்த எளிதாக இருக்க வேண்டும். பாதுகாப்பு என்பது இயல்புநிலை தேவை மற்றும் திறந்த மூல மென்பொருள் பல வணிகங்களுக்கு ஒரு முக்கியமான செய் காரணியாகும்.

# about->joy->title
source: Joy at work
ta: வேலையில் மகிழ்ச்சி

# about->joy->content
source: The development of Kimai is the ideal combination of the profession I love, with its infinite possibilities of education, and the need to earn money to support my family. Thanks to Kimai, I can spend more time with my wife and child, which is probably the best motivation you can ever imagine.
ta: கிமாயின் வளர்ச்சி என்பது நான் விரும்பும் தொழிலின் சிறந்த கலவையாகும், அதன் எல்லையற்ற கல்வியின் சாத்தியக்கூறுகள் மற்றும் எனது குடும்பத்தை ஆதரிக்கப் பணம் சம்பாதிக்க வேண்டிய தேவை. கிமாய்க்கு நன்றி, நான் என் மனைவி மற்றும் குழந்தையுடன் அதிக நேரம் செலவிட முடியும், இது நீங்கள் கற்பனை செய்யக்கூடிய சிறந்த உந்துதலாகும்.

# integrations->name
source: Apps & Integrations
ta: பயன்பாடுகள் மற்றும் ஒருங்கிணைப்புகள்

# integrations->title
source: Apps and integrations for Kimai
ta: கிமாய்க்கான பயன்பாடுகள் மற்றும் ஒருங்கிணைப்புகள்

# integrations->subtitle
source: Connect Kimai with your favorite tools — from desktop apps to mobile clients, CLI tools, and more — and track time wherever you work.
ta: கிமாயை உங்களுக்கு பிடித்த கருவிகளுடன் இணைக்கவும் - டெச்க்டாப் பயன்பாடுகள் முதல் மொபைல் கிளையண்டுகள், சி.எல்.ஐ கருவிகள் மற்றும் பலவற்றில் - நீங்கள் பணிபுரியும் நேரத்தைக் கண்காணிக்கவும்.

# store->name
source: Plugins
ta: செருகுநிரல்கள்

# store->title
source: Plugins for Kimai
ta: கிமாய்க்கான செருகுநிரல்கள்
