Repository: 247i/TACETr
Catalog: உரை/தானி/kitshn-metadata-*.po
Languages: ta

# title.txt:1
source: kitshn (for Tandoor)
ta: சமையலறை (தந்தூருக்கு)

# short_description.txt:1
source: An unofficial client for the self-hosted Tandoor recipe management software.
ta: சுய-ஓச்ட் செய்யப்பட்ட தந்தூர் செய்முறை மேலாண்மை மென்பொருளுக்கு அதிகாரப்பூர்வமற்ற வாடிக்கையாளர்.

# full_description.txt:1
source: Info: GrapheneOS users might need to disable the "Hardened memory allocator" or enable the "Exploit protection compatibility mode" for the app to run. Built with <b>Jetpack Compose</b> and <b>Material You</b> to deliver a modern, intuitive and responsive user experience. <b>Supported features:</b> <ul> <li>Dynamic home screen with suggestions</li> <li>Recipes</li> <ul> <li>Adding, importing, editing and deleting</li> <ul> <li>Steps combining tool</li> <li>Share receiver for recipe imports via URL</li> </ul> <li>Extensive search</li> <li>Cooking mode</li> <li>Step-ingredient allocation tool</li> <li>App links</li> <li>Markdown supported</li> </ul> <li>Meal plan</li> <ul> <li>Overview</li> <li>Adding, editing and deleting</li> </ul> <li>Shopping list</li> <ul> <li>Adding and deleting</li> <li>Auto-Sync</li> </ul> <li>Recipe books</li> <ul> <li>Adding and deleting</li> <li>Favorites feature</li> </ul> <li>UI</li> <ul> <li>Built with Jetpack Compose</li> <li>Material You dynamic colors</li> <li>Responsive two pane layouts for tablets and foldables</li> </ul> </ul> Please note that the app is currently in alpha phase. You can of course open issues on Github for bugs, feedback, and feature ideas. Icon made by Freepik from www.flaticon.com
ta: தகவல்: கிராபெனியோச் பயனர்கள் "கடினப்படுத்தப்பட்ட நினைவக ஒதுக்கீட்டாளரை" முடக்க வேண்டும் அல்லது பயன்பாடு இயங்குவதற்கான "சுரண்டல் பாதுகாப்பு பொருந்தக்கூடிய பயன்முறையை" இயக்க வேண்டும். நவீன, உள்ளுணர்வு மற்றும் பதிலளிக்கக்கூடிய பயனர் அனுபவத்தை வழங்க <b> செட் பேக் இசையமைத்தல் </b> மற்றும் <b> பொருள் நீங்கள் </b> உடன் கட்டப்பட்டுள்ளது. <b> உதவி அம்சங்கள்: </b> <ul> <li> பரிந்துரைகளுடன் மாறும் முகப்புத் திரை </li> <li> சமையல் </li> <ul> <li> சேர்த்தல், இறக்குமதி செய்தல், திருத்துதல் மற்றும் நீக்குதல் </li> <ul> <li> கருவியை இணைக்கும் படிகள் </li> <li> முகவரி </li> வழியாக செய்முறை இறக்குமதிக்கான பெறுநரைப் பகிரவும் </ul> <li> விரிவான தேடல் </li> <li> சமையல் முறை </li> <li> படி-தகவல் ஒதுக்கீடு கருவி </li> <li> பயன்பாட்டு இணைப்புகள் </li> <li> மார்க் பேரூர் உதவி </li> </ul> <li> உணவு திட்டம் </li> <ul> <li> கண்ணோட்டம் </li> <li> சேர்த்தல், திருத்துதல் மற்றும் நீக்குதல் </li> </ul> <li> சாப்பிங் பட்டியல் </li> <ul> <li> சேர்ப்பது மற்றும் நீக்குதல் </li> <li> ஆட்டோ-ஒத்திசைவு </li> </ul> <li> செய்முறை புத்தகங்கள் </li> <ul> <li> சேர்ப்பது மற்றும் நீக்குதல் </li> <li> பிடித்தவை நற்பொருத்தம் </li> </ul> <li> இடைமுகம் </li> <ul> <li> செட் பேக் இசையமைப்புடன் கட்டப்பட்டுள்ளது </li> <li> பொருள் நீங்கள் மாறும் வண்ணங்கள் </li> <li> டேப்லெட்டுகள் மற்றும் மடிப்புகளுக்கான இரண்டு பலக தளவமைப்புகள் </li> </ul> </ul> பயன்பாடு தற்போது ஆல்பா கட்டத்தில் உள்ளது என்பதை நினைவில் கொள்க. பிழைகள், பின்னூட்டங்கள் மற்றும் அம்ச யோசனைகளுக்காக நீங்கள் நிச்சயமாக கிதுபில் சிக்கல்களைத் திறக்கலாம். Www.flaticon.com இலிருந்து ஃப்ரீபிக் தயாரித்த படவுரு

# changelogs/100.txt:1
source: - Initial release
ta: - ஆரம்ப வெளியீடு

# changelogs/101.txt:1
source: - fix(build.gradle): removed minifying - fix(mealplan): mealplanType color may now be undefined
ta: - fix(build.gradle): removed minifying - fix(mealplan): mealplanType color சி-வைகாசி now be undefined

# changelogs/103.txt:1
source: - feat(acra): switched to acra-http - feat(home): improved list performance - feat(requests): improved error dialog - fix(requests): fixed crashes - fix(vm): crash when unable to parse version - fix(build.gradle): added minifying back
ta: - சாதனை (ACRA): ACRA-HTTP க்கு மாறியது - சாதனை (வீடு): மேம்படுத்தப்பட்ட பட்டியல் செயல்திறன் - சாதனை (கோரிக்கைகள்): மேம்பட்ட பிழை உரையாடல் - சரி (கோரிக்கைகள்): நிலையான செயலிழப்புகள் - சரிசெய்யவும் (வி.எம்): பதிப்பை அலச முடியாமல் செயலிழப்பு - fix(build.gradle): added minifying பின்

# changelogs/104.txt:1
source: - feat(recipes): added markdown support for step instructions (#1) - feat(recipes): added app links - feat(recipes): added share button - l10n(strings.xml): added Turkish (tr) (#3) (by @mikropsoft) - chore(libs): version bumps - multiple bug fixes and design improvements
ta: - சாதனை (சமையல்): படி வழிமுறைகளுக்கு மார்க் பேரூர் உதவி சேர்க்கப்பட்டது (#1) - சாதனை (சமையல் குறிப்புகள்): சேர்க்கப்பட்ட பயன்பாட்டு இணைப்புகள் - சாதனை (சமையல்): சேர்க்கப்பட்ட பங்கு பொத்தான் . - வேலை (லிப்ச்): பதிப்பு புடைப்புகள் - பல பிழை திருத்தங்கள் மற்றும் வடிவமைப்பு மேம்பாடுகள்

# changelogs/105.txt:1
source: - feat(onboarding): added API token sign in (#9) - feat(recipes): added auto timer links in instructions - feat(acra): added mail address field to AcraCrashReportDialog.kt - multiple bug fixes
ta: - சாதனை (ஆன் போர்டிங்): பநிஇ கிள்ளாக்கு உள்நுழைவு சேர்க்கப்பட்டது (#9) - சாதனை (சமையல்): அறிவுறுத்தல்களில் ஆட்டோ நேரங்குறிகருவி இணைப்புகள் சேர்க்கப்பட்டன - feat(acra): added mail முகவரி புலம் பெறுநர் AcraCrashReportDialog.kt - பல பிழை திருத்தங்கள்

# changelogs/106.txt:1
source: - feat(recipes): added support for step image files (resolved #14) - feat(shopping): grouping shopping list entries by food (resolved #13) - feat(manifest): added support for self-signed certificates (resolved #11) - feat(app): added "new instance" shortcut - feat(recipes): added "add to shopping" item to dropdown menu - feat(recipes): added recipe book management dialog - feat(utils): improved human readable date labels - feat(recipes): improved horizontal layout for tablets in cook mode - chore(libs): version bumps - fix(recipes): migrated to different markdown library - fix(shopping): text fields are now single line - fix(onboarding): checking token/password prefix before autofill
ta: - சாதனை (சமையல் குறிப்புகள்): படி படக் கோப்புகளுக்கான உதவி சேர்க்கப்பட்டது (தீர்க்கப்பட்டது #14) - சாதனை (சாப்பிங்): உணவு மூலம் சாப்பிங் பட்டியல் உள்ளீடுகளை தொகுத்தல் (தீர்க்கப்பட்டது #13) - சாதனை (மேனிஃபெச்ட்): தன்வய கையொப்பமிடப்பட்ட சான்றிதழ்களுக்கான உதவி (தீர்க்கப்பட்டது #11) - சாதனை (பயன்பாடு): "புதிய நிகழ்வு" குறுக்குவழி சேர்க்கப்பட்டது . - சாதனை (சமையல்): சேர்க்கை செய்முறை புத்தக மேலாண்மை உரையாடல் - சாதனை (பயன்பாடுகள்): மேம்பட்ட மனித படிக்கக்கூடிய தேதி லேபிள்கள் - சாதனை (சமையல்): சமையல் பயன்முறையில் டேப்லெட்களுக்கான மேம்பட்ட கிடைமட்ட தளவமைப்பு - வேலை (லிப்ச்): பதிப்பு புடைப்புகள் - சரி (சமையல்): வெவ்வேறு மார்க் பேரூர் நூலகத்திற்கு இடம்பெயர்ந்தது - சரி (சாப்பிங்): உரை புலங்கள் இப்போது ஒற்றை வரி - fix(onboarding): checking token/password prefix before autofill

# changelogs/107.txt:1
source: - feat(ui): changed recipe and meal plan bottom sheets to dialogs - feat(ui): added animation to fullscreen dialog - feat(recipes): added ability to hide ingredient allocation action chip (#16) - feat(settings): added toggle to ignore unallocated ingredients (resolved #16) - chore(libs): version bumps - feat(manifest): changed app link host - feat(share): shortened share wrapper links - feat(about): added website - feat(about): changed contact mail - feat(acra): changed acra report url - feat(share): changed share wrapper url - fix(ui): status bar icon color in fullscreen dialog - fix(mealplan): hide keyboard after selecting meal type
ta: - சாதனை (UI): மாற்றப்பட்ட செய்முறை மற்றும் உணவுத் திட்டத்தின் கீழ் தாள்கள் உரையாடல்களுக்கு - சாதனை (UI): முழுத்திரை உரையாடலில் அனிமேசன் சேர்க்கப்பட்டது - சாதனை (சமையல்): மூலப்பொருள் ஒதுக்கீடு செயல் சிப்பை மறைக்கும் திறன் சேர்க்கப்பட்டது (#16) - சாதனை (அமைப்புகள்): ஒதுக்கப்படாத பொருட்களை புறக்கணிக்க மாற்று சேர்க்கை (தீர்க்கப்பட்டது #16) - வேலை (லிப்ச்): பதிப்பு புடைப்புகள் - சாதனை (மேனிஃபெச்ட்): மாற்றப்பட்ட பயன்பாட்டு இணைப்பு புரவலன் - சாதனை (பகிர்வு): சுருக்கப்பட்ட பங்கு ரேப்பர் இணைப்புகள் - சாதனை (பற்றி): சேர்க்கப்பட்ட வலைத்தளம் - சாதனை (பற்றி): மாற்றப்பட்ட தொடர்பு அஞ்சல் - சாதனை (ACRA): மாற்றப்பட்ட ACRA அறிக்கை முகவரி - சாதனை (பங்கு): மாற்றப்பட்ட பங்கு ரேப்பர் முகவரி - சரி (UI): முழுத்திரை உரையாடலில் நிலை பட்டி படவுரு நிறம் - சரிசெய்யவும் (மீல் பிளான்): உணவு வகையைத் தேர்ந்தெடுத்த பிறகு விசைப்பலகையை மறைக்கவும்

# changelogs/108.txt:1
source: Hotfix - fix(settings): resolved #17 (Crash when trying to share recipe) Changes for v1.0.0-alpha.8 - feat(ui): changed recipe and meal plan bottom sheets to dialogs - feat(ui): added animation to fullscreen dialog - feat(recipes): added ability to hide ingredient allocation action chip (#16) - feat(settings): added toggle to ignore unallocated ingredients (resolved #16) - chore(libs): version bumps - feat(manifest): changed app link host - feat(share): shortened share wrapper links - feat(about): added website - feat(about): changed contact mail - feat(acra): changed acra report url - feat(share): changed share wrapper url - fix(ui): status bar icon color in fullscreen dialog - fix(mealplan): hide keyboard after selecting meal type
ta: ஆட்ஃபிக்ச் - சரிசெய்யவும் (அமைப்புகள்): தீர்க்கப்பட்டது #17 (செய்முறையைப் பகிர முயற்சிக்கும்போது செயலிழப்பு) V1.0.0-ஆல்பா 8 க்கான மாற்றங்கள் - சாதனை (UI): மாற்றப்பட்ட செய்முறை மற்றும் உணவுத் திட்டத்தின் கீழ் தாள்கள் உரையாடல்களுக்கு - சாதனை (UI): முழுத்திரை உரையாடலில் அனிமேசன் சேர்க்கப்பட்டது - சாதனை (சமையல்): மூலப்பொருள் ஒதுக்கீடு செயல் சிப்பை மறைக்கும் திறன் சேர்க்கப்பட்டது (#16) - சாதனை (அமைப்புகள்): ஒதுக்கப்படாத பொருட்களை புறக்கணிக்க மாற்று சேர்க்கை (தீர்க்கப்பட்டது #16) - வேலை (லிப்ச்): பதிப்பு புடைப்புகள் - சாதனை (மேனிஃபெச்ட்): மாற்றப்பட்ட பயன்பாட்டு இணைப்பு புரவலன் - சாதனை (பகிர்வு): சுருக்கப்பட்ட பங்கு ரேப்பர் இணைப்புகள் - சாதனை (பற்றி): சேர்க்கப்பட்ட வலைத்தளம் - சாதனை (பற்றி): மாற்றப்பட்ட தொடர்பு அஞ்சல் - சாதனை (ACRA): மாற்றப்பட்ட ACRA அறிக்கை முகவரி - சாதனை (பங்கு): மாற்றப்பட்ட பங்கு ரேப்பர் முகவரி - சரி (UI): முழுத்திரை உரையாடலில் நிலை பட்டி படவுரு நிறம் - சரிசெய்யவும் (மீல் பிளான்): உணவு வகையைத் தேர்ந்தெடுத்த பிறகு விசைப்பலகையை மறைக்கவும்

# changelogs/109.txt:1
source: - feat(recipes): added support for step video files (resolved #15) - feat(recipes): keep screen on (#18) (by @FineFindus) - feat(ui): intercepting configuration changes - fix(strings.xml): corrected behavior description
ta: - சாதனை (சமையல்): படி வீடியோ கோப்புகளுக்கான உதவி சேர்க்கப்பட்டது (தீர்க்கப்பட்டது #15) . - சாதனை (UI): உள்ளமைவு மாற்றங்களை இடைமறித்தல் - சரிசெய்யவும் (strings.xml): சரிசெய்யப்பட்ட நடத்தை விளக்கம்

# changelogs/110.txt:1
source: - feat(recipes): added templating support for step instructions (#25) - feat(recipes): added properties card (#24) - feat(mealplan): improved ui for tablets/foldables - feat(dialog): improved adaptive fullscreen dialog size - feat(recipes): hiding FAB when reaching bottom for legibility - fix(recipes): prevent truncated ingredient text - fix(share): replaced hard coded url (resolved #22) - chore(libs): version bumps - multiple bug fixes
ta: - சாதனை (சமையல்): படி வழிமுறைகளுக்கு வார்ப்புரு உதவி சேர்க்கப்பட்டது (#25) - சாதனை (சமையல்): சேர்க்கப்பட்ட பண்புகள் அட்டை (#24) - feat(mealplan): improved இடைமுகம் க்கு tablets/foldables - சாதனை (உரையாடல்): மேம்படுத்தப்பட்ட தகவமைப்பு முழுத்திரை உரையாடல் அளவு - சாதனை (சமையல்): தெளிவுக்கு கீழே வரும்போது ஃபேப் மறைத்தல் - சரிசெய்யவும் (சமையல்): துண்டிக்கப்பட்ட மூலப்பொருள் உரையைத் தடுக்கவும் - சரி (பங்கு): மாற்றப்பட்ட கடின குறியீட்டு முகவரி (தீர்க்கப்பட்டது #22) - வேலை (லிப்ச்): பதிப்பு புடைப்புகள் - பல பிழை திருத்தங்கள்

# changelogs/1101.txt:1
source: Hotfix - fix(dialog): ugly layout/animations in fullscreen dialog Changes for v1.0.0-alpha.10 - feat(recipes): added templating support for step instructions (#25) - feat(recipes): added properties card (#24) - feat(mealplan): improved ui for tablets/foldables - feat(dialog): improved adaptive fullscreen dialog size - feat(recipes): hiding FAB when reaching bottom for legibility - fix(recipes): prevent truncated ingredient text - fix(share): replaced hard coded url (resolved #22) - chore(libs): version bumps - multiple bug fixes
ta: ஆட்ஃபிக்ச் - சரிசெய்யவும் (உரையாடல்): முழுத்திரை உரையாடலில் அசிங்கமான தளவமைப்பு/அனிமேசன்கள் V1.0.0-ஆல்பா 10 க்கான மாற்றங்கள் - சாதனை (சமையல்): படி வழிமுறைகளுக்கு வார்ப்புரு உதவி சேர்க்கப்பட்டது (#25) - சாதனை (சமையல்): சேர்க்கப்பட்ட பண்புகள் அட்டை (#24) - சாதனை (மீல் பிளான்): டேப்லெட்டுகள்/மடிப்புகளுக்கு மேம்படுத்தப்பட்ட இடைமுகம் - சாதனை (உரையாடல்): மேம்படுத்தப்பட்ட தகவமைப்பு முழுத்திரை உரையாடல் அளவு - சாதனை (சமையல்): தெளிவுக்கு கீழே வரும்போது ஃபேப் மறைத்தல் - சரிசெய்யவும் (சமையல்): துண்டிக்கப்பட்ட மூலப்பொருள் உரையைத் தடுக்கவும் - சரி (பங்கு): மாற்றப்பட்ட கடின குறியீட்டு முகவரி (தீர்க்கப்பட்டது #22) - வேலை (லிப்ச்): பதிப்பு புடைப்புகள் - பல பிழை திருத்தங்கள்

# changelogs/1102.txt:1
source: Changes for v1.0.0-alpha.10.2 - fix(properties): parsing issue (#25) Changes for v1.0.0-alpha.10.1 - fix(dialog): ugly layout/animations in fullscreen dialog Changes for v1.0.0-alpha.10 - feat(recipes): added templating support for step instructions (#25) - feat(recipes): added properties card (#24) - feat(mealplan): improved ui for tablets/foldables - feat(dialog): improved adaptive fullscreen dialog size - feat(recipes): hiding FAB when reaching bottom for legibility - fix(recipes): prevent truncated ingredient text - fix(share): replaced hard coded url (resolved #22) - chore(libs): version bumps - multiple bug fixes
ta: V1.0.0-ஆல்பா 10.2 க்கான மாற்றங்கள் - சரி (பண்புகள்): பாகுபடுத்தல் சிக்கல் (#25) V1.0.0-ஆல்பா 10.1 க்கான மாற்றங்கள் - சரிசெய்யவும் (உரையாடல்): முழுத்திரை உரையாடலில் அசிங்கமான தளவமைப்பு/அனிமேசன்கள் V1.0.0-ஆல்பா 10 க்கான மாற்றங்கள் - சாதனை (சமையல்): படி வழிமுறைகளுக்கு வார்ப்புரு உதவி சேர்க்கப்பட்டது (#25) - சாதனை (சமையல்): சேர்க்கப்பட்ட பண்புகள் அட்டை (#24) - feat(mealplan): improved இடைமுகம் க்கு tablets/foldables - சாதனை (உரையாடல்): மேம்படுத்தப்பட்ட தகவமைப்பு முழுத்திரை உரையாடல் அளவு - சாதனை (சமையல்): தெளிவுக்கு கீழே வரும்போது ஃபேப் மறைத்தல் - சரிசெய்யவும் (சமையல்): துண்டிக்கப்பட்ட மூலப்பொருள் உரையைத் தடுக்கவும் - சரி (பங்கு): மாற்றப்பட்ட கடினமான குறியிடப்பட்ட முகவரி (தீர்க்கப்பட்டது #22) - வேலை (லிப்ச்): பதிப்பு புடைப்புகள் - பல பிழை திருத்தங்கள்

# changelogs/1110.txt:1
source: - feat(behavior): added toggles for showing fractional values (#24) - feat(settings): added bug report button - feat(acra): added download button - chore(api): marked v1.5.20 as compatible
ta: - சாதனை (நடத்தை): பகுதியளவு மதிப்புகளைக் காண்பிப்பதற்கான மாற்றங்கள் சேர்க்கப்பட்டுள்ளன (#24) - சாதனை (அமைப்புகள்): பிழை அறிக்கை பொத்தானைச் சேர்க்கவும் - சாதனை (ACRA): பதிவிறக்க பொத்தான் சேர்க்கப்பட்டது - CHORE (API): V1.5.20 ஐ இணக்கமாக குறித்தது

# changelogs/1120.txt:1
source: - feat(utils): set max decimal numbers to 2 (#24) - feat(home): improved dynamic home screen by caching foods and keywords - feat(home): added go-tos section - feat(home): added christmas section - feat(api): now retrieving version from openapi endpoint - fix(mealplan): respecting default mealplan share settings (resolved #19) - chore(api): marked v1.5.23 as compatible - chore(api): marked v1.5.21/22 as compatible
ta: - சாதனை (பயன்பாடுகள்): அதிகபட்ச தசம எண்களை 2 ஆக அமைக்கவும் (#24) . - சாதனை (வீடு): கோ-டோச் பிரிவு சேர்க்கப்பட்டது - சாதனை (வீடு): கிறிச்துமச் பிரிவு சேர்க்கப்பட்டது - feat(api): now retrieving version இருந்து openapi endpoint . - CHORE (API): V1.5.23 ஐ இணக்கமாக குறித்தது - வேலை (ஏபிஐ): குறிக்கப்பட்ட v1.5.21/22 இணக்கமாக

# changelogs/1121.txt:1
source: Hotfix - fix(recipes): issue with regex for template comments (resolved #27) Changes for v1.0.0-alpha.12 - feat(utils): set max decimal numbers to 2 (#24) - feat(home): improved dynamic home screen by caching foods and keywords - feat(home): added go-tos section - feat(home): added christmas section - feat(api): now retrieving version from openapi endpoint - fix(mealplan): respecting default mealplan share settings (resolved #19) - chore(api): marked v1.5.23 as compatible - chore(api): marked v1.5.21/22 as compatible
ta: ஆட்ஃபிக்ச் - சரி (சமையல்): வார்ப்புரு கருத்துகளுக்கான ரீசெக்சுடன் சிக்கல் (தீர்க்கப்பட்டது #27) V1.0.0-ஆல்பா 12 க்கான மாற்றங்கள் - சாதனை (பயன்பாடுகள்): அதிகபட்ச தசம எண்களை 2 ஆக அமைக்கவும் (#24) . - சாதனை (வீடு): கோ-டோச் பிரிவு சேர்க்கப்பட்டது - சாதனை (வீடு): கிறிச்துமச் பிரிவு சேர்க்கப்பட்டது - feat(api): now retrieving version இருந்து openapi endpoint . - CHORE (API): V1.5.23 ஐ இணக்கமாக குறித்தது - வேலை (ஏபிஐ): குறிக்கப்பட்ட v1.5.21/22 இணக்கமாக

# changelogs/1130.txt:1
source: - feat(recipes): added close functionality to list detail layout (resolved #28) - feat(ui): improved list detail pane size ratio - feat(various): added more TandoorRequestErrorHandlers - fix(import): added check to rule out double imports (resolved #29) - fix(home): issue with back gesture in search view - fix(recipes): several crash fixes and error handle improvements - fix(favorites): crash when retrieving favorites book - fix(recipes): crash when adding recipe to shopping list - fix(recipes): crash in RecipeCreationAndEditDialog - fix(api): added more information to TandoorRequestsError - chore(api): marked v1.5.24 as compatible
ta: . - சாதனை (UI): மேம்படுத்தப்பட்ட பட்டியல் விவரம் பலக அளவு விகிதம் - feat(various): added more TandoorRequestErrorHandlers - சரி (இறக்குமதி): இரட்டை இறக்குமதியை நிராகரிக்க சோதனை சேர்க்கப்பட்டது (தீர்க்கப்பட்டது #29) - சரி (வீடு): தேடல் பார்வையில் பின் சைகையுடன் சிக்கல் - சரி (சமையல்): பல செயலிழப்பு திருத்தங்கள் மற்றும் பிழை கையாளுதல் மேம்பாடுகள் - சரி (பிடித்தவை): பிடித்தவை புத்தகத்தை மீட்டெடுக்கும் போது செயலிழப்பு - சரி (சமையல்): சாப்பிங் பட்டியலில் செய்முறையைச் சேர்க்கும்போது செயலிழப்பு - fix(recipes): crash in RecipeCreationAndEditDialog - சரி (ஏபிஐ): tandoorrequestserror இல் கூடுதல் தகவல்களைச் சேர்த்தது - வேலை (ஏபிஐ): V1.5.24 ஐ இணக்கமாக குறித்தது

# changelogs/1140.txt:1
source: - feat(onboarding): added sign in via browser (resolved #30) - fix(recipes): blur overflow in recipe card info tag - fix(api): csrf issue when using Cookie log in (resolved #30)
ta: - சாதனை (ஆன் போர்டிங்): உலாவி வழியாக உள்நுழைவு (தீர்க்கப்பட்டது #30) - சரிசெய்யவும் (சமையல்): செய்முறை அட்டை செய்தி குறிச்சொல்லில் மங்கலான வழிதல் .

# changelogs/1150.txt:1
source: kitshn was migrated to Kotlin/Compose Multiplatform. This enables compatibility with iOS. There might also be some differences/issues affecting the Android build. Feel free to report those on GitHub! :) - feat(commonMain): added experimental back gesture for iOS - feat(iosApp & composeApp): added Bugsnag crash reporting for iOS - fix(shopping): hiding items when "checked" set to true - fix(api): improved TandoorRequestsError message - chore(commonMain/api): marked v1.5.25/26 as compatible - l10n(Dutch): translated using Weblate - l10n(Russian): translated using Weblate - l10n(Ukrainian): translated using Weblate - kmpMigration
ta: கிட்லின்/இசையமைத்தல் மல்டிபிளாட்ஃபார்முக்கு கிட்லுக்கு குடிபெயர்ந்தார். இது ஐஇமு உடன் பொருந்தக்கூடிய தன்மையை செயல்படுத்துகிறது. ஆண்ட்ராய்டு கட்டமைப்பை பாதிக்கும் சில வேறுபாடுகள்/சிக்கல்களும் இருக்கலாம். கிதுபில் உள்ளவர்களைப் புகாரளிக்க தயங்க! :) - சாதனை (காமன் மைன்): ஐஇமு க்கான சோதனை பின் சைகை சேர்க்கப்பட்டது . - fix(shopping): hiding items when "checked" கணம் பெறுநர் true - fix(api): improved TandoorRequestsError message - chore(commonMain/api): marked v1.5.25/26 அச் compatible - L10N (டச்சு): வெப்லேட்டைப் பயன்படுத்தி மொழிபெயர்க்கப்பட்டுள்ளது - L10N (ரச்யன்): வெப்லேட்டைப் பயன்படுத்தி மொழிபெயர்க்கப்பட்டுள்ளது - L10N (உக்ரேனிய): வெப்லேட்டைப் பயன்படுத்தி மொழிபெயர்க்கப்பட்டுள்ளது - kmpmigration

# changelogs/1151.txt:1
source: kitshn was migrated to Kotlin/Compose Multiplatform. This enables compatibility with iOS. There might also be some differences/issues affecting the Android build. Feel free to report those on GitHub! :) Hotfix - fix(build.gradle): set jvmToolchain to 17 for F-Droid build - feat(commonMain): added experimental back gesture for iOS - feat(iosApp & composeApp): added Bugsnag crash reporting for iOS - fix(shopping): hiding items when "checked" set to true - fix(api): improved TandoorRequestsError message - chore(commonMain/api): marked v1.5.25/26 as compatible - l10n(Dutch): translated using Weblate - l10n(Russian): translated using Weblate - l10n(Ukrainian): translated using Weblate - kmpMigration
ta: கிட்லின்/இசையமைத்தல் மல்டிபிளாட்ஃபார்முக்கு கிட்லுக்கு குடிபெயர்ந்தார். இது ஐஇமு உடன் பொருந்தக்கூடிய தன்மையை செயல்படுத்துகிறது. ஆண்ட்ராய்டு கட்டமைப்பை பாதிக்கும் சில வேறுபாடுகள்/சிக்கல்களும் இருக்கலாம். கிதுபில் உள்ளவர்களைப் புகாரளிக்க தயங்க! :) ஆட்ஃபிக்ச் - fix(build.gradle): கணம் jvmToolchain பெறுநர் 17 க்கு F-Droid build - சாதனை (காமன் மைன்): ஐஇமு க்கான சோதனை பின் சைகை சேர்க்கப்பட்டது . - fix(shopping): hiding items when "checked" கணம் பெறுநர் true - fix(api): improved TandoorRequestsError message - chore(commonMain/api): marked v1.5.25/26 அச் compatible - L10N (டச்சு): வெப்லேட்டைப் பயன்படுத்தி மொழிபெயர்க்கப்பட்டுள்ளது - L10N (ரச்யன்): வெப்லேட்டைப் பயன்படுத்தி மொழிபெயர்க்கப்பட்டுள்ளது - L10N (உக்ரேனிய): வெப்லேட்டைப் பயன்படுத்தி மொழிபெயர்க்கப்பட்டுள்ளது - kmpmigration

# changelogs/1152.txt:1
source: kitshn was migrated to Kotlin/Compose Multiplatform. This enables compatibility with iOS. There might also be some differences/issues affecting the Android build. Feel free to report those on GitHub! :) Changes for v1.0.0-alpha.15.2 - fix(build.gradle): disable CompileArtProfileTask for reproducibility Changes for v1.0.0-alpha.15.1 - fix(build.gradle): set jvmToolchain to 17 for F-Droid build - feat(commonMain): added experimental back gesture for iOS - feat(iosApp & composeApp): added Bugsnag crash reporting for iOS - fix(shopping): hiding items when "checked" set to true - fix(api): improved TandoorRequestsError message - chore(commonMain/api): marked v1.5.25/26 as compatible - l10n(Dutch): translated using Weblate - l10n(Russian): translated using Weblate - l10n(Ukrainian): translated using Weblate - kmpMigration
ta: கிட்லின்/இசையமைத்தல் மல்டிபிளாட்ஃபார்முக்கு கிட்லுக்கு குடிபெயர்ந்தார். இது ஐஇமு உடன் பொருந்தக்கூடிய தன்மையை செயல்படுத்துகிறது. ஆண்ட்ராய்டு கட்டமைப்பை பாதிக்கும் சில வேறுபாடுகள்/சிக்கல்களும் இருக்கலாம். கிதுபில் உள்ளவர்களைப் புகாரளிக்க தயங்க! :) V1.0.0-ஆல்பா 15.2 க்கான மாற்றங்கள் - fix(build.gradle): முடக்கு CompileArtProfileTask க்கு reproducibility V1.0.0-ஆல்பா 15.1 க்கான மாற்றங்கள் - fix(build.gradle): கணம் jvmToolchain பெறுநர் 17 க்கு F-Droid build - சாதனை (காமன் மைன்): ஐஇமு க்கான சோதனை பின் சைகை சேர்க்கப்பட்டது . - fix(shopping): hiding items when "checked" கணம் பெறுநர் true - fix(api): improved TandoorRequestsError message - chore(commonMain/api): marked v1.5.25/26 அச் compatible - L10N (டச்சு): வெப்லேட்டைப் பயன்படுத்தி மொழிபெயர்க்கப்பட்டுள்ளது - L10N (ரச்யன்): வெப்லேட்டைப் பயன்படுத்தி மொழிபெயர்க்கப்பட்டுள்ளது - L10N (உக்ரேனிய): வெப்லேட்டைப் பயன்படுத்தி மொழிபெயர்க்கப்பட்டுள்ளது - kmpmigration
