Repository: 247i/TACETr
Catalog: உரை/தானி/klipper-sponsors-*.po
Languages: ta

source: Sponsors
ta: ஒப்புரவாளர்கள்

source: Klipper is Free Software. We depend on the generous support from sponsors. Please consider sponsoring Klipper or supporting our sponsors.
ta: கிளிப்பர் இலவச மென்பொருள். ச்பான்சர்களிடமிருந்து தாராளமான ஆதரவை நாங்கள் சார்ந்து இருக்கிறோம். கிளிப்பருக்கு நிதியுதவி அல்லது எங்கள் ச்பான்சர்களை ஆதரிப்பதைக் கவனியுங்கள்.

source: BIGTREETECH
ta: பிக்ட்ரீடெக்

source: BIGTREETECH is the official mainboard sponsor of Klipper. BIGTREETECH is committed to developing innovative and competitive products to serve the 3D printing community better. Follow them on [Facebook](https://www.facebook.com/BIGTREETECH) or [Twitter](https://twitter.com/BigTreeTech).
ta: பிக்ட்ரீடெக் கிளிப்பரின் அதிகாரப்பூர்வ மெயின்போர்டு ஒப்புரவாளர் ஆவார். 3 டி பிரிண்டிங் சமூகத்திற்கு சிறப்பாக பணி செய்ய புதுமையான மற்றும் போட்டி தயாரிப்புகளை உருவாக்க பிக் ட்ரீட்டெக் உறுதிபூண்டுள்ளது. [பேச்புக்] (https://www.facebook.com/bigtreetech) அல்லது [ட்விட்டர்] (https://twitter.com/bigtreetech) இல் அவற்றைப் பின்தொடரவும்.

source: Klipper Developers
ta: கட்டிங் உருவாக்குபவர்கள்

source: Kevin O'Connor
ta: கெவின் ஓ'கானர்

source: Eric Callahan
ta: எரிக் கால்ஆன்

source: Eric is the author of bed_mesh, spi_flash, and several other Klipper modules. Eric has a donations page at: <https://ko-fi.com/arksine>
ta: எரிக் பெட்_மேச், ச்பை_ஃப்ளாச் மற்றும் பல கிளிப்பர் தொகுதிகளின் ஆசிரியர் ஆவார். எரிக் ஒரு நன்கொடைகள் பக்கத்தைக் கொண்டுள்ளது: <https://ko-fi.com/arksine>

source: Related Klipper Projects
ta: தொடர்புடைய கிளிப்பர் திட்டங்கள்

source: Klipper is frequently used with other Free Software. Consider using or supporting these projects.
ta: கிளிப்பர் மற்ற இலவச மென்பொருளுடன் அடிக்கடி பயன்படுத்தப்படுகிறது. இந்த திட்டங்களைப் பயன்படுத்தி அல்லது ஆதரிப்பதைக் கவனியுங்கள்.

source: Kevin is the original author and current maintainer of Klipper. Donate at: <https://ko-fi.com/koconnor> or <https://www.patreon.com/koconnor>
ta: கெவின் கிளிப்பரின் அசல் எழுத்தாளர் மற்றும் தற்போதைய பராமரிப்பாளர் ஆவார். நன்கொடை: <https://ko-fi.com/koconnor> அல்லது <https://www.patreon.com/koconnor>

source: [<img src="./img/sponsors/obico-light-horizontal.png" width="200" style="margin:25px" />](https://obico.io/klipper.html?source=klipper_sponsor) [<img src="./img/sponsors/peopoly-logo.png" width="200" style="margin:25px" />](https://peopoly.net)
ta: [<img src = " klipper_sponsor) [<img src = ".
