Repository: 247i/TACETr
Catalog: உரை/தானி/klipper-load_cell-*.po
Languages: ta

source: Load Cells
ta: செல்களை ஏற்றவும்

source: This document describes Klipper's support for load cells. Basic load cell functionality can be used to read force data and to weigh things like filament. A calibrated force sensor is an important part of a load cell based probe.
ta: இந்த ஆவணம் சுமை கலங்களுக்கு கிளிப்பரின் ஆதரவை விவரிக்கிறது. ஆற்றல் தரவைப் படிக்கவும், இழை போன்றவற்றை எடைபோடவும் அடிப்படை சுமை செல் செயல்பாட்டைப் பயன்படுத்தலாம். அளவீடு செய்யப்பட்ட படை சென்சார் ஒரு சுமை செல் அடிப்படையிலான ஆய்வின் முக்கிய பகுதியாகும்.

source: Related Documentation
ta: தொடர்புடைய ஆவணங்கள்

source: [load_cell Config Reference](Config_Reference.md#load_cell)
ta: [load_cell கட்டமைப்பு Reference](Config_Reference.md#load_cell)

source: [load_cell Status Reference](Status_Reference.md#load_cell)
ta: [load_cell நிலை Reference](Status_Reference.md#load_cell)

source: Using `LOAD_CELL_DIAGNOSTIC`
ta: `Load_cell_diagnostic` ஐப் பயன்படுத்துதல்

source: When you first connect a load cell its good practice to check for issues by running `LOAD_CELL_DIAGNOSTIC`. This tool collects 10 seconds of data from the load cell and resport statistics:
ta: `Load_cell_diagnostic` ஐ இயக்குவதன் மூலம் சிக்கல்களைச் சரிபார்க்க அதன் நல்ல நடைமுறையை நீங்கள் முதலில் இணைக்கும்போது. இந்த கருவி சுமை கலத்திலிருந்து 10 விநாடிகள் தரவைச் சேகரித்து புள்ளிவிவரங்களைத் தூண்டுகிறது:

source: Things you can check with this data:
ta: இந்தத் தரவைக் கொண்டு நீங்கள் சரிபார்க்கக்கூடிய விசயங்கள்:

source: The configured sample rate of the sensor should be close to the 'Measured samples per second' value. If it is not you may have a configuration or wiring issue.
ta: சென்சாரின் கட்டமைக்கப்பட்ட மாதிரி வீதம் 'நொடிக்கு அளவிடப்பட்ட மாதிரிகள்' மதிப்புக்கு நெருக்கமாக இருக்க வேண்டும். அது இல்லையென்றால் உங்களுக்கு உள்ளமைவு அல்லது வயரிங் சிக்கல் இருக்கலாம்.

source: 'Saturated samples' should be 0. If you have saturated samples it means the load sell is seeing more force than it can measure.
ta: 'நிறைவுற்ற மாதிரிகள்' 0 ஆக இருக்க வேண்டும். உங்களிடம் நிறைவுற்ற மாதிரிகள் இருந்தால், சுமை விற்பனை அளவிடக்கூடியதை விட அதிக சக்தியைக் காண்கிறது.

source: 'Unique values' should be a large percentage of the 'Samples Collected' value. If 'Unique values' is 1 it is very likely a wiring issue.
ta: 'தனித்துவமான மதிப்புகள்' 'சேகரிக்கப்பட்ட மாதிரிகள்' மதிப்பில் ஒரு பெரிய சதவீதமாக இருக்க வேண்டும். 'தனித்துவமான மதிப்புகள்' 1 என்றால் அது ஒரு வயரிங் சிக்கல்.

source: Tap or push on the sensor while `LOAD_CELL_DIAGNOSTIC` runs. If things are working correctly ths should increase the 'Sample range'.
ta: `சுமை செல் கண்டறிதல்` ரன்கள் எடுக்கும்போது சென்சாரைத் தட்டவும் அல்லது தள்ளவும். விசயங்கள் சரியாக வேலை செய்தால் இது 'மாதிரி வரம்பை' அதிகரிக்க வேண்டும்.

source: Calibrating a Load Cell
ta: ஒரு சுமை கலத்தை அளவீடு செய்தல்

source: Load cells are calibrated using the `LOAD_CELL_CALIBRATE` command. This is an interactive calibration utility that walks you though a 3 step process:
ta: `Load_cell_calibrate` கட்டளையைப் பயன்படுத்தி சுமை செல்கள் அளவீடு செய்யப்படுகின்றன. இது ஒரு ஊடாடும் அளவுத்திருத்த பயன்பாடாகும், இது 3 படி செயல்முறை என்றாலும் உங்களை அழைத்துச் செல்கிறது:

source: First use the `TARE` command to establish the zero force value. This is the `reference_tare_counts` config value.
ta: சுழிய ஆற்றல் மதிப்பை நிறுவ முதலில் `tare` கட்டளையைப் பயன்படுத்தவும். இது `குறிப்பு_டேர்_சவுண்ட்ச்` கட்டமைப்பு மதிப்பு.

source: Next you apply a known load or force to the load cell and run the `CALIBRATE GRAMS=nnn` command. From this the `counts_per_gram` value is calculated. See [the next section](#applying-a-known-force-or-load) for some suggestions on how to do this.
ta: அடுத்து நீங்கள் சுமை கலத்திற்கு அறியப்பட்ட சுமை அல்லது சக்தியைப் பயன்படுத்துங்கள் மற்றும் `அளவீடு கிராம் = என்.என்.என்` கட்டளையை இயக்கவும். இதிலிருந்து `couns_per_gram` மதிப்பு கணக்கிடப்படுகிறது. இதை எவ்வாறு செய்வது என்பது குறித்த சில பரிந்துரைகளுக்கு [அடுத்த பகுதி] (#அறியப்படாத-சக்தி அல்லது சுமை விண்ணப்பித்தல்) ஐப் பார்க்கவும்.

source: Finally, use the `ACCEPT` command to save the results.
ta: இறுதியாக, முடிவுகளைச் சேமிக்க `ஏற்றுக்கொள் 'கட்டளையைப் பயன்படுத்தவும்.

source: You can cancel the calibration process at any time with `ABORT`.
ta: நீங்கள் எந்த நேரத்திலும் அளவுத்திருத்த செயல்முறையை `` abort` உடன் ரத்து செய்யலாம்.

source: Applying a Known Force or Load
ta: அறியப்பட்ட ஆற்றல் அல்லது சுமைகளைப் பயன்படுத்துதல்

source: The `CALIBRATE GRAMS=nnn` step can be accomplished in a number of ways. If your load cell is under a platform like a bed or filament holder it might be easiest to put a known mass on the platform. E.g. you could use a couple of 1KG filament spools.
ta: `அளவீடு கிராம் = என்.என்.என்` படி பல வழிகளில் நிறைவேற்றப்படலாம். உங்கள் சுமை செல் ஒரு படுக்கை அல்லது இழை வைத்திருப்பவர் போன்ற ஒரு தளத்தின் கீழ் இருந்தால், அறியப்பட்ட வெகுசனத்தை மேடையில் வைப்பது எளிதானது. எ.கா. நீங்கள் 1 கிலோ இழை ச்பூல்களைப் பயன்படுத்தலாம்.

source: If your load cell is in the printer's toolhead a different approach is easier. Put a digital scale on the printers bed and gently lower the toolhead onto the scale (or raise the bed into the toolhead if your bed moves). You may be able to do this using the `FORCE_MOVE` command. But more likely you will have to manually moving the z axis with the motors off until the toolhead presses on the scale.
ta: உங்கள் சுமை செல் அச்சுப்பொறியின் கருவித்தடத்தில் இருந்தால் வேறு அணுகுமுறை எளிதானது. அச்சுப்பொறிகள் படுக்கையில் டிசிட்டல் அளவை வைத்து, கருவித்தொகையை அளவில் மெதுவாகக் குறைக்கவும் (அல்லது உங்கள் படுக்கை நகர்ந்தால் படுக்கையை கருவித்தடத்திற்கு உயர்த்தவும்). `Force_move` கட்டளையைப் பயன்படுத்தி இதை நீங்கள் செய்ய முடியும். ஆனால் கருவியின் அளவு அழுத்தும் வரை மோட்டார்கள் மூலம் சட் அச்சை கைமுறையாக நகர்த்த வேண்டியிருக்கும்.

source: A good calibration force would ideally be a large percentage of the load cell's rated capacity. E.g. if you have a 5Kg load cell you would ideally calibrate it with a 5kg mass. This might work well with under-bed sensors that have to support a lot of weight. For toolhead probes this may not be a load that your printer bed or toolhead can tolerate without damage. Do try to use at least 1Kg of force, most printers should tolerate this without issue.
ta: ஒரு நல்ல அளவுத்திருத்த ஆற்றல் சுமை கலத்தின் மதிப்பிடப்பட்ட திறனில் ஒரு பெரிய சதவீதமாக இருக்கும். எ.கா. உங்களிடம் 5 கிலோ சுமை செல் இருந்தால், அதை 5 கிலோ வெகுசனத்துடன் அளவீடு செய்வீர்கள். இது அதிக எடையை ஆதரிக்க வேண்டிய படுக்கைக்கு கீழ் சென்சார்களுடன் நன்றாக வேலை செய்யக்கூடும். கருவி எட் ஆய்வுகளுக்கு இது உங்கள் அச்சுப்பொறி படுக்கை அல்லது கருவித்தளம் சேதமின்றி பொறுத்துக்கொள்ளக்கூடிய ஒரு சுமையாக இருக்காது. குறைந்தது 1 கிலோ சக்தியைப் பயன்படுத்த முயற்சிக்கவும், பெரும்பாலான அச்சுப்பொறிகள் இதை சிக்கல் இல்லாமல் பொறுத்துக்கொள்ள வேண்டும்.

source: When calibrating make careful note of the values reported:
ta: அளவீடு செய்யும் போது அறிக்கையிடப்பட்ட மதிப்புகளை கவனமாக கவனிக்கவும்:

source: The `Total capacity` should be close to the theoretical rating of the load cell based on the sensor's capacity. If it is much larger you could have used a higher gain setting in the sensor or a more sensitive load cell. This isn't as critical for 32bit and 24bit sensors but is much more critical for low bit width sensors.
ta: `மொத்த திறன்` சென்சாரின் திறனின் அடிப்படையில் சுமை கலத்தின் தத்துவார்த்த மதிப்பீட்டிற்கு நெருக்கமாக இருக்க வேண்டும். இது மிகப் பெரியதாக இருந்தால், நீங்கள் சென்சாரில் அதிக ஆதாய அமைப்பைப் பயன்படுத்தலாம் அல்லது அதிக உணர்திறன் கொண்ட சுமை கலத்தைப் பயன்படுத்தலாம். இது 32 பிட் மற்றும் 24 பிட் சென்சார்களுக்கு மிகவும் முக்கியமானதல்ல, ஆனால் குறைந்த பிட் அகல சென்சார்களுக்கு இது மிகவும் முக்கியமானது.

source: Reading Force Data
ta: படைப்பு படிப்பு தரவைப் படித்தல்

source: Force data can be read with a GCode command:
ta: Gcode கட்டளையுடன் படை தரவை படிக்கலாம்:

source: Data is also continuously read and can be consumed from the load_cell printer object in a macro:
ta: தரவுகளும் தொடர்ந்து படிக்கப்படுகின்றன, மேலும் மேக்ரோவில் உள்ள சுமை_செல் அச்சுப்பொறி பொருளிலிருந்து நுகரலாம்:

source: This provides an average force over the last 1 second, similar to how temperature sensors work.
ta: வெப்பநிலை சென்சார்கள் எவ்வாறு செயல்படுகின்றன என்பதைப் போலவே இது கடைசி 1 நொடிக்கு சராசரி சக்தியை வழங்குகிறது.

source: Taring a Load Cell
ta: ஒரு சுமை கலத்தை திணறடிப்பது

source: Taring, sometimes called zeroing, sets the current weight reported by the load_cell to 0. This is useful for measuring relative to a known weight. e.g. when measuring a filament spool, using `LOAD_CELL_TARE` sets the weight to 0. Then as filament is printed the load_cell will report the weight of the filament used.
ta: டாரிங், சில நேரங்களில் சீரோயிங் என்று அழைக்கப்படுகிறது, சுமை_செல் மூலம் புகாரளிக்கப்பட்ட தற்போதைய எடையை 0 ஆக அமைக்கிறது. இது அறியப்பட்ட எடையுடன் ஒப்பிடும்போது அளவிட பயனுள்ளதாக இருக்கும். எ.கா. ஒரு இழை ச்பூலை அளவிடும்போது, ​​`load_cell_tare` ஐப் பயன்படுத்தி எடையை 0 ஆக அமைக்கிறது. பின்னர் இழை அச்சிடப்படுவதால் சுமை_செல் பயன்படுத்தப்படும் இழைகளின் எடையை புகாரளிக்கும்.

source: The current tare value is reported in the printers status and can be read in a macro:
ta: தற்போதைய TARE மதிப்பு அச்சுப்பொறிகளின் நிலையில் தெரிவிக்கப்பட்டுள்ளது மற்றும் ஒரு மேக்ரோவில் படிக்கலாம்:

source: Load Cell Probes
ta: செல் ஆய்வுகளை ஏற்றவும்

source: [load_cell_probe Config Reference](Config_Reference.md#load_cell_probe)
ta: [load_cell_probe கட்டமைப்பு Reference](Config_Reference.md#load_cell_probe)

source: Load Cell Probe Safety
ta: செல் ஆய்வு பாதுகாப்பை ஏற்றவும்

source: Because load cells are a direct nozzle contact probe there is a risk of damage to your printer if too much force is used. The load cell probing system includes a number of safety checks that try to keep your machine safe from excessive force to the toolhead. It's important to understand what they are and how they work as you can defeat most of them with poorly chosen config values.
ta: சுமை செல்கள் ஒரு நேரடி முனை தொடர்பு ஆய்வாக இருப்பதால், அதிக ஆற்றல் பயன்படுத்தப்பட்டால் உங்கள் அச்சுப்பொறிக்கு சேதம் ஏற்படும் இடர் உள்ளது. சுமை செல் ஆய்வு முறை பல பாதுகாப்பு சோதனைகளை உள்ளடக்கியது, அவை உங்கள் இயந்திரத்தை அதிகப்படியான சக்தியிலிருந்து கருவித்தடத்திற்கு பாதுகாப்பாக வைத்திருக்க முயற்சிக்கின்றன. மோசமாக தேர்ந்தெடுக்கப்பட்ட கட்டமைப்பு மதிப்புகளுடன் அவர்களில் பெரும்பாலோரை நீங்கள் தோற்கடிக்க முடியும் என்பதால் அவை என்ன, அவை எவ்வாறு செயல்படுகின்றன என்பதைப் புரிந்துகொள்வது முதன்மை.

source: Calibration Check
ta: அளவுத்திருத்த சோதனை

source: Every time a homing move starts, load_cell_probe checks that the load_cell is calibrated. If not it will stop the move with an error: `!! Load Cell not calibrated`.
ta: ஒவ்வொரு முறையும் ஒரு ஓமிங் நகர்வு தொடங்கும் போது, ​​சுமை_செல் அளவீடு செய்யப்படுவதை load_cell_probe சரிபார்க்கிறது. இல்லையென்றால் அது பிழையுடன் நகர்வதை நிறுத்திவிடும்: `!! செல் அளவீடு செய்யப்படவில்லை`.

source: `counts_per_gram`
ta: `couns_per_gram`

source: This setting is used to convert raw sensor counts into grams. All the safety limits are in gram units for your convenience. If the `counts_per_gram` setting is not accurate you can easily exceed the safe force on the toolhead. You should never guess this value. Use `LOAD_CELL_CALIBRATE` to find your load cells actual `counts_per_gram`.
ta: மூல சென்சார் எண்ணிக்கையை கிராம் ஆக மாற்ற இந்த அமைப்பு பயன்படுத்தப்படுகிறது. அனைத்து பாதுகாப்பு வரம்புகளும் உங்கள் வசதிக்காக கிராம் அலகுகளில் உள்ளன. `Couns_per_gram` அமைப்பு துல்லியமாக இல்லாவிட்டால், நீங்கள் கருவியின் பாதுகாப்பான சக்தியை எளிதாக மீறலாம். இந்த மதிப்பை நீங்கள் ஒருபோதும் யூகிக்கக்கூடாது. உங்கள் சுமை கலங்களை உண்மையான `counts_per_gram` கண்டுபிடிக்க` load_cell_calibrate` ஐப் பயன்படுத்தவும்.

source: `trigger_force`
ta: `தூண்டுதல்_ஃபோர்ச்`

source: This is the force in grams that triggers the endstop to halt the homing move. When a homing move starts the endstop tares itself with the current reading from the load cell. `trigger_force` is measured from that tare value. There is always some overshoot of this value when the probe collides with the bed, so be conservative. e.g. a setting of 100g could result in 350g of peak force before the toolhead stops. This overshoot will increase with faster probing `speed`, a low ADC sample rate or [multi MCU homing](Multi_MCU_Homing.md).
ta: கிராம்சில் உள்ள ஆற்றல் இது எண்ட்ச்டாப்பைத் தூண்டுகிறது. ஒரு ஓமிங் நடவடிக்கை எண்ட்ச்டாப் சுமை கலத்திலிருந்து தற்போதைய வாசிப்புடன் தன்னைத் தொடங்கும்போது. `TRIGGER_FORCE` அந்த மோசமான மதிப்பிலிருந்து அளவிடப்படுகிறது. ஆய்வு படுக்கையுடன் மோதுகையில் இந்த மதிப்பின் சில ஓவர்சூட் எப்போதும் இருக்கும், எனவே பழமைவாதமாக இருங்கள். எ.கா. 100 கிராம் அமைப்பானது கருவிக்காட்டி நிறுத்தப்படுவதற்கு முன்பு 350 கிராம் உச்ச சக்தியை ஏற்படுத்தும். இந்த ஓவர்சூட் `வேகம்`, குறைந்த ஏடிசி மாதிரி வீதம் அல்லது [மல்டி எம்.சி.யு ஓமிங்] (மல்டி_எம்சி_ஓமிங்.மிடி) மூலம் அதிகரிக்கும்.

source: `reference_tare_counts`
ta: `குறிப்பு_டேர்_கவுண்ட்ச்`

source: This is the baseline tare value that is set by `LOAD_CELL_CALIBRATE`. This value works with `force_safety_limit` to limit the maximum force on the toolhead.
ta: இது `load_cell_calibrate` ஆல் அமைக்கப்பட்ட அடிப்படை TARE மதிப்பு. இந்த மதிப்பு கருவியின் தலையில் அதிகபட்ச சக்தியைக் கட்டுப்படுத்த `force_safety_limit` உடன் செயல்படுகிறது.

source: This is the maximum absolute force, relative to `reference_tare_counts`, that the probe will allow while homing or probing. If the MCU sees this force exceeded it will shut down the printer with the error `!! Load cell endstop: too much force!`. There are a number of ways this can be triggered:
ta: இது `குறிப்பு_டேர்_கவுண்ட்ச்` உடன் ஒப்பிடும்போது, ​​அதிகபட்ச முழுமையான சக்தியாகும், இது ஆய்வு அல்லது ஆய்வு செய்யும் போது ஆய்வு அனுமதிக்கும். MCU இந்த சக்தியை தாண்டிவிட்டால், அது பிழையுடன் அச்சுப்பொறியை மூடிவிடும் `!! செல் எண்ட்ச்டாப்பை ஏற்றவும்: அதிக சக்தி! `. இதைத் தூண்டக்கூடிய பல வழிகள் உள்ளன:

source: The first risk this protects against is picking too large of a value for `drift_filter_cutoff_frequency`. This can cause the drift filter to filter out a probe event and continue the homing move. If this happens the `force_safety_limit` acts as a backup protection.
ta: இது பாதுகாக்கும் முதல் இடர் `STRIFT_FILTER_CUTOFF_FREQUENCY` க்கான மதிப்பை மிகப் பெரியதாக எடுப்பதாகும். இது சறுக்கல் வடிகட்டி ஒரு ஆய்வு நிகழ்வை வடிகட்டவும், ஓமிங் நகர்வைத் தொடரவும் காரணமாகிறது. இது நடந்தால் `force_safety_limit` காப்புப்பிரதி பாதுகாப்பாக செயல்படுகிறது.

source: The second problem is probing repeatedly in one place. Klipper does not retract the probe when doing a single `PROBE` command. This can result in force applied to the toolhead at the end of a probing cycle. Because external forces can vary greatly between probing locations, `load_cell_probe` performs a tare before beginning each probe. If you repeat the `PROBE` command, load_cell_probe will tare the endstop at the current force. Multiple cycles of this will result in ever-increasing force on the toolhead. `force_safety_limit` stops this cycle from running out of control.
ta: இரண்டாவது சிக்கல் ஒரே இடத்தில் மறுநிகழ்வு ஆராய்கிறது. ஒற்றை `ஆய்வு` கட்டளையைச் செய்யும்போது கிளிப்பர் விசாரணையைத் திரும்பப் பெறுவதில்லை. இது ஒரு ஆய்வு சுழற்சியின் முடிவில் கருவிக்குத் தலையில் பயன்படுத்தப்படும். வெளிப்புற சக்திகள் இருப்பிடங்களுக்கு இடையில் பெரிதும் மாறுபடும் என்பதால், ஒவ்வொரு ஆய்வையும் தொடங்குவதற்கு முன்பு `load_cell_probe 'ஒரு செயல்களைச் செய்கிறது. நீங்கள் `ஆய்வு` கட்டளையை மீண்டும் செய்தால், load_cell_probe தற்போதைய சக்தியில் எண்ட்ச்டாப்பைக் கவரும். இதன் பல சுழற்சிகள் கருவி தலையில் தொடர்ந்து அதிகரித்து வரும் சக்தியை ஏற்படுத்தும். `force_safety_limit` இந்த சுழற்சியை கட்டுப்பாட்டை மீறி நிறுத்துகிறது.

source: Another way this run-away can happen is damage to a strain gauge. If the metal part is permanently bent it wil change the `reference_tare_counts` of the device. This puts the starting tare value much closer to the limit making it more likely to be violated. You want to be notified if this is happening because your hardware has been permanently damaged.
ta: இந்த ரன்-அவே நிகழக்கூடிய மற்றொரு வழி ஒரு திரிபு அளவிற்கு சேதம். உலோக பகுதி நிரந்தரமாக வளைந்தால், அது சாதனத்தின் `குறிப்பு_டேர்_கவுண்ட்ச்` ஐ மாற்றும். இது தொடக்கத் தொட்டியின் மதிப்பை வரம்பிற்கு மிக நெருக்கமாக வைக்கிறது. உங்கள் வன்பொருள் நிரந்தரமாக சேதமடைந்துள்ளதால் இது நடக்கிறது என்றால் உங்களுக்கு அறிவிக்க விரும்புகிறீர்கள்.

source: The final way this can be triggered is due to temperature changes. If your strain gauges are heated their `reference_tare_counts` may be very different at ambient temperature vs operating temperature. In this case you may need to increase the `force_safety_limit` to allow for thermal changes.
ta: இதைத் தூண்டக்கூடிய இறுதி வழி வெப்பநிலை மாற்றங்கள் காரணமாகும். உங்கள் திரிபு அளவீடுகள் சூடேற்றப்பட்டால், அவற்றின் `குறிப்பு_டேர்_கவுண்ட்ச்` சுற்றுப்புற வெப்பநிலைக்கு எதிராக இயக்க வெப்பநிலையில் மிகவும் வித்தியாசமாக இருக்கலாம். இந்த விசயத்தில் நீங்கள் வெப்ப மாற்றங்களை அனுமதிக்க `force_safety_limit` ஐ அதிகரிக்க வேண்டியிருக்கலாம்.

source: Load Cell Endstop Watchdog Task
ta: செல் எண்ட்ச்டாப் வாட்ச் டாக் பணியை ஏற்றவும்

source: When homing the load_cell_endstop starts a task on the MCU to trac measurements arriving from the sensor. If the sensor fails to send measurements for 2 sample periods the watchdog will shut down the printer with an error `!! LoadCell Endstop timed out waiting on ADC data`.
ta: சுமை_செல்_இண்ட்ச்டாப் சென்சாரிலிருந்து வரும் டி.ஆர்.ஏ.சி அளவீடுகளுக்கு எம்.சி.யுவில் ஒரு பணியைத் தொடங்குகிறது. சென்சார் 2 மாதிரி காலங்களுக்கு அளவீடுகளை அனுப்பத் தவறினால், வாட்ச் டாக் ஒரு பிழையுடன் அச்சுப்பொறியை மூடிவிடும் `!! லோட்செல் எண்ட்ச்டாப் ஏடிசி தரவைக் காத்திருந்தது.

source: If this happens, the most likely cause is a fault from the ADC. Inadequate grounding of your printer can be the root cause. The frame, power supply case and pint bed should all be connected to ground. You may need to ground the frame in multiple places. Anodized aluminum extrusions do not conduct electricity well. You might need to sand the area where the grounding wire is attached to make good electrical contact.
ta: இது நடந்தால், பெரும்பாலும் காரணம் ADC இன் தவறு. உங்கள் அச்சுப்பொறியின் போதிய அடித்தளம் மூல காரணமாக இருக்கலாம். சட்டகம், மின்சாரம் வழங்கல் வழக்கு மற்றும் பைண்ட் படுக்கை அனைத்தும் தரையில் இணைக்கப்பட வேண்டும். நீங்கள் பல இடங்களில் சட்டகத்தை தரையிறக்க வேண்டியிருக்கலாம். அனோடைச் அலுமினிய வெளியேற்றங்கள் மின்சாரத்தை நன்கு நடத்துவதில்லை. நல்ல மின் தொடர்பு கொள்ள தரையிறக்கும் கம்பி இணைக்கப்பட்டுள்ள பகுதியை நீங்கள் மணல் அள்ள வேண்டும்.

source: Load Cell Probe Setup
ta: செல் ஆய்வு அமைப்பை ஏற்றவும்

source: This section covers the process for commissioning a load cell probe.
ta: இந்த பிரிவு ஒரு சுமை செல் ஆய்வை ஆணையிடுவதற்கான செயல்முறையை உள்ளடக்கியது.

source: Verify the Load Cell First
ta: முதலில் சுமை கலத்தை சரிபார்க்கவும்

source: A `[load_cell_probe]` is also a `[load_cell]` and G-code commands related to `[load_cell]` work with `[load_cell_probe]`. Before attempting to use a load cell probe, follow the directions for [calibrating the load cell](Load_Cell.md#calibrating-a-load-cell) with `CALIBRATE_LOAD_CELL` and checking its operation with `LOAD_CELL_DIAGNOSTIC`.
ta: ஒரு `[load_cell_probe]` என்பது `[load_cell]` மற்றும் `[load_cell]` [load_cell_probe] `உடன் தொடர்புடைய சி-குறியீட்டு கட்டளைகள். சுமை செல் ஆய்வைப் பயன்படுத்த முயற்சிக்கும் முன், `அளவீடு_ லோட்_செல்` உடன் [சுமை கலத்தை அளவீடு செய்வதற்கான] (load_cell.md#அளவீடு-ஒரு-சுமை-செல்) மற்றும் அதன் செயல்பாட்டை` load_cell_diagnostic` உடன் சரிபார்க்கும் திசைகளைப் பின்பற்றவும்.

source: Verify Probe Operation With LOAD_CELL_TEST_TAP
ta: LOAD_CELL_TEST_TAP உடன் ஆய்வு செயல்பாட்டை சரிபார்க்கவும்

source: Use the command `LOAD_CELL_TEST_TAP` to test the operation of the load cell probe before actually trying to probe with it. This command detects taps, just like the PROBE command, but it does not move the z axis. By default, it listens for 3 taps before ending the test. You have 30 seconds to do each tap, if no taps are detected the command will time out.
ta: சுமை செல் ஆய்வின் செயல்பாட்டை உண்மையில் ஆய்வு செய்ய முயற்சிக்கும் முன் `load_cell_test_tap` கட்டளையைப் பயன்படுத்தவும். இந்த கட்டளை ஆய்வு கட்டளையைப் போலவே குழாய்களையும் கண்டறிகிறது, ஆனால் அது சட் அச்சை நகர்த்தாது. இயல்பாக, இது சோதனையை முடிப்பதற்கு முன் 3 குழாய்களைக் கேட்கிறது. ஒவ்வொரு குழாய் செய்ய உங்களுக்கு 30 வினாடிகள் உள்ளன, குழாய்கள் எதுவும் கண்டறியப்படாவிட்டால் கட்டளை நேரம் வெளியேறும்.

source: If this test fails, check your configuration and `LOAD_CELL_DIAGNOSTIC` carefully to look for issues.
ta: இந்த சோதனை தோல்வியுற்றால், உங்கள் உள்ளமைவை சரிபார்க்கவும் மற்றும் சிக்கல்களைத் தேடுவதற்கு `load_cell_diagnostic` கவனமாக.

source: Load cell probes don't support the `QUERY_ENDSTOPS` or `QUERY_PROBE` commands. Use `LOAD_CELL_TEST_TAP` for testing functionality before probing.
ta: செல் ஆய்வுகள் `Query_endstops` அல்லது` Query_probe` கட்டளைகளை ஆதரிக்காது. ஆராய்வதற்கு முன் செயல்பாட்டைச் சோதிக்க `load_cell_test_tap` ஐப் பயன்படுத்தவும்.

source: Homing Macros
ta: ஓமிங் மேக்ரோக்கள்

source: Load cell probe is not an endstop and doesn't support `endstop: prove:z_virtual_endstop`. For the time being you'll need to configure your z axis with an MCU pin as its endstop. You won't actually be using the pin but for the time being you have to configure something.
ta: செல் ஆய்வு ஒரு எண்ட்ச்டாப் அல்ல, `எண்ட்ச்டாப்: நிரூபிக்கவும்: Z_Virtual_endstop` ஐ ஆதரிக்காது. தற்போதைக்கு, உங்கள் சட் அச்சை MCU முள் மூலம் அதன் எண்ட்ச்டாப்பாக உள்ளமைக்க வேண்டும். நீங்கள் உண்மையில் முள் பயன்படுத்த மாட்டீர்கள், ஆனால் தற்போதைக்கு நீங்கள் ஏதாவது கட்டமைக்க வேண்டும்.

source: To home the axis with just the probe you need to set up a custom homing macro. This requires setting up [homing_override](Config_Reference.md#homing_override).
ta: தனிப்பயன் ஓமிங் மேக்ரோவை அமைக்க வேண்டிய ஆய்வு மூலம் அச்சுக்கு வீட்டிற்கு வீட்டிற்கு வர வேண்டும். இதற்கு [ஓமிங் ஓவர்ரைடு] (config_reference.md#homing_override) அமைக்க வேண்டும்.

source: Here is a simple macro that can accomplish this. Note that the `_HOME_Z_FROM_LAST_PROBE` macro has to be separate because of the way macros work. The sub-call is needed so that the `_HOME_Z_FROM_LAST_PROBE` macro can see the result of the probe in `printer.probe.last_z_result`.
ta: இதை நிறைவேற்றக்கூடிய எளிய மேக்ரோ இங்கே. மேக்ரோக்கள் வேலை செய்யும் விதம் காரணமாக `_HOME_Z_FROM_LAST_PROBE` மேக்ரோ தனித்தனியாக இருக்க வேண்டும் என்பதை நினைவில் கொள்க. `_HOME_Z_FROM_LAST_PROBE` மேக்ரோ ஆய்வின் முடிவை` அச்சுப்பொறி.பிரோப்.லச்ட்_செச்_ரெச்யூல்ட்` இல் காணக்கூடிய வகையில் துணை அழைப்பு தேவைப்படுகிறது.

source: Suggested Probing Temperature
ta: பரிந்துரைக்கப்பட்ட வெப்பநிலை

source: Currently, we suggest keeping the nozzle temperature below the level that causes the filament to ooze while homing and probing. 140C is a good starting point. This temperature is also low enough not to scar PEI build surfaces.
ta: தற்போது, ​​முனை வெப்பநிலையை அளவிற்கு கீழே வைத்திருக்க பரிந்துரைக்கிறோம், இது இழை மற்றும் ஆய்வு செய்யும் போது இழைகளைத் தூண்டுகிறது. 140 சி ஒரு நல்ல தொடக்க புள்ளி. இந்த வெப்பநிலை பெய் உருவாக்க மேற்பரப்புகளை வடிக்காத அளவுக்கு குறைவாக உள்ளது.

source: Fouling of the nozzle and the print bed due to oozing filament is the #1 source of probing error with the load cell probe. Klipper does not yet have a universal way to detect poor quality taps due to filament ooze. The existing code may decide that a tap is valid when it is of poor quality. Classifying these poor quality taps is an area of active research.
ta: சுமை செல் ஆய்வுடன் பிழையை ஆராய்வதற்கான #1 மூலமாக முனை மற்றும் அச்சு படுக்கை ஆகியவற்றைக் கறைபடுத்துவது. ஃபிலிமென்ட் ஓச் காரணமாக மோசமான தரமான குழாய்களைக் கண்டறிய கிளிப்பருக்கு இன்னும் உலகளாவிய வழி இல்லை. ஒரு குழாய் தரமற்றதாக இருக்கும்போது அது செல்லுபடியாகும் என்று தற்போதுள்ள குறியீடு தீர்மானிக்கலாம். இந்த மோசமான தரமான குழாய்களை வகைப்படுத்துவது செயலில் உள்ள ஆராய்ச்சியின் ஒரு பகுதியாகும்.
