Repository: 247i/TACETr
Catalog: உரை/தானி/klipper-load_cell-*.po
Languages: ta

source: Klipper also lacks support for re-locating a probe point if the location has become fouled by filament ooze. Modules like `quad_gantry_level` will repeatedly probe the same coordinates even if a probe previously failed there.
ta: ஃபிலிமென்ட் ஓச் மூலம் இருப்பிடம் கறைபட்டுள்ளிருந்தால், ஒரு ஆய்வு புள்ளியை மீண்டும் வைப்பதற்கான ஆதரவும் கிளிப்பருக்கு இல்லை. `Quat_gantry_level` போன்ற தொகுதிகள் முன்னர் ஒரு ஆய்வு தோல்வியுற்றாலும் அதே ஆயங்களை மறுநிகழ்வு ஆராயும்.

source: Give the above it is strongly suggested not to probe at printing temperatures.
ta: மேலே கொடுங்கள், அச்சிடும் வெப்பநிலையை ஆராய வேண்டாம் என்று வலுவாக பரிந்துரைக்கப்படுகிறது.

source: Hot Nozzle Protection
ta: சூடான முனை பாதுகாப்பு

source: The Voron project has a great macro for protecting your print surface from the hot nozzle. See [Voron Tap's `activate_gcode`](https://github.com/VoronDesign/Voron-Tap/blob/main/config/tap_klipper_instructions.md)
ta: உங்கள் அச்சு மேற்பரப்பை சூடான முனையிலிருந்து பாதுகாக்க வோரான் திட்டம் ஒரு சிறந்த மேக்ரோவைக் கொண்டுள்ளது. [Voron tap’s `actation_gcode`] (https://github.com/vorondesign/voron-tap/blob/main/config/tap_klipper_instructions.md ஐப் பார்க்கவும்)

source: It is highly suggested to add something like this to your config.
ta: உங்கள் உள்ளமைவில் இதுபோன்ற ஒன்றைச் சேர்க்க மிகவும் பரிந்துரைக்கப்படுகிறது.

source: Nozzle Cleaning
ta: முனை தூய்மை

source: Before probing the nozzle should be clean. You could do this manually before every print. You can also implement a nozzle scrubber and automate the process. Here is a suggested sequence:
ta: முனை ஆராய்வதற்கு முன் சுத்தமாக இருக்க வேண்டும். ஒவ்வொரு அச்சுக்கும் முன் இதை கைமுறையாக செய்யலாம். நீங்கள் ஒரு முனை ச்க்ரப்பரை செயல்படுத்தலாம் மற்றும் செயல்முறையை தானியக்கமாக்கலாம். பரிந்துரைக்கப்பட்ட வரிசை இங்கே:

source: Wait for the nozzle to heat up to probing temp (e.g. `M109 S140`)
ta: தற்காலிக ஆய்வு செய்ய முனை வெப்பமடையும் வரை காத்திருங்கள் (எ.கா. `M109 S140`)

source: Home the machine (`G28`)
ta: வீட்டிற்கு இயந்திரம் (`சி 28`)

source: Scrub the nozzle on a brush
ta: ஒரு தூரிகையில் முனை துடைக்கவும்

source: Heat soak the print bed
ta: வெப்பம் அச்சு படுக்கையை ஊறவைக்கவும்

source: Perform probing tasks: QGL, bed mesh etc.
ta: ஆய்வு பணிகளைச் செய்யுங்கள்: QGL, BED MESH போன்றவை.

source: Temperature Compensation for Nozzle Growth
ta: முனை வளர்ச்சிக்கான வெப்பநிலை இழப்பீடு

source: If you are probing at a safe temperature, the nozzle will expand after heating to printing temperatures. This will cause the nozzle to get longer and closer to the print surface. You can compensate for this with [[z_thermal_adjust]](Config_Reference.md#z_thermal_adjust). This adjustment will work across a range of printing temperatures from PLA to PC.
ta: நீங்கள் பாதுகாப்பான வெப்பநிலையில் ஆய்வு செய்கிறீர்கள் என்றால், வெப்பநிலையை அச்சிட்ட பிறகு முனை விரிவடையும். இது முனை அச்சு மேற்பரப்புக்கு நீண்ட மற்றும் நெருக்கமாக இருக்கும். [[Z_thermal_adjust]] (config_reference.md#z_thermal_adjust) மூலம் இதை நீங்கள் ஈடுசெய்யலாம். இந்த சரிசெய்தல் பி.எல்.ஏ முதல் பிசி வரை அச்சிடும் வெப்பநிலையில் செயல்படும்.

source: Calculating the `temp_coeff` for `[z_thermal_adjust]`
ta: `[Z_thermal_adjust]` `temp_coeff` ஐக் கணக்கிடுகிறது

source: The easiest way to do this is to measure at 2 different temperatures. Ideally these should be the upper and lower limits of the printing temperature range. E.g. 180C and 290C. You can perform a `PROBE_ACCURACY` at both temperatures and then calculate the difference of the `average z` at both.
ta: இதைச் செய்வதற்கான எளிதான வழி 2 வெவ்வேறு வெப்பநிலையை அளவிடுவதாகும். வெறுமனே இவை அச்சிடும் வெப்பநிலை வரம்பின் மேல் மற்றும் கீழ் வரம்புகளாக இருக்க வேண்டும். எ.கா. 180 சி மற்றும் 290 சி. இரண்டு வெப்பநிலையிலும் நீங்கள் ஒரு `ஆய்வு_அக்யூரசி` செய்ய முடியும், பின்னர் இரண்டிலும்` சராசரி Z` இன் வேறுபாட்டைக் கணக்கிடலாம்.

source: The adjustment value is the change in nozzle length divided by the change in temperature. e.g.
ta: சரிசெய்தல் மதிப்பு என்பது வெப்பநிலையின் மாற்றத்தால் வகுக்கப்பட்ட முனை நீளத்தின் மாற்றம். எ.கா.

source: The expected result is a negative number. Positive values for `temp_coeff` move the nozzle closer to the bed and negative values move it further away. Expect to have to move the nozzle further away as it gets longer when hot.
ta: எதிர்பார்க்கப்படும் முடிவு எதிர்மறை எண். `Temp_coeff` க்கான நேர்மறையான மதிப்புகள் முனை படுக்கைக்கு நெருக்கமாக நகர்த்தவும், எதிர்மறை மதிப்புகள் அதை மேலும் தொலைவில் நகர்த்தவும். சூடாக இருக்கும்போது முனை மேலும் நகர்த்த வேண்டும் என்று எதிர்பார்க்கலாம்.

source: Configure `[z_thermal_adjust]`
ta: `[Z_thermal_adjust]` உள்ளமைக்கவும்

source: Set up z_thermal_adjust to reference the `extruder` as the source of temperature data. E.g.:
ta: `எக்ச்ட்ரூடர்` வெப்பநிலை தரவின் மூலமாகக் குறிப்பிட Z_Thermal_adjust ஐ அமைக்கவும். எ.கா .:

source: Continuous Tare Filters for Toolhead Load Cells
ta: கருவிஎட் சுமை கலங்களுக்கான தொடர்ச்சியான TARE வடிப்பான்கள்

source: Klipper implements a configurable IIR filter on the MCU to provide continuous tareing of the load cell while probing. Continuous taring means the 0 value moves with drift caused by external factors like bowden tubes and thermal changes. This is aimed at toolhead sensors and moving beds that experience lots of external forces that change while probing.
ta: க்ளிப்பர் எம்.சி.யுவில் கட்டமைக்கக்கூடிய ஐ.ஐ.ஆர் வடிப்பானை செயல்படுத்துகிறார். தொடர்ச்சியான தரிங் என்பது 0 மதிப்பு போடன் குழாய்கள் மற்றும் வெப்ப மாற்றங்கள் போன்ற வெளிப்புற காரணிகளால் ஏற்படும் சறுக்கலுடன் நகர்கிறது. இது கருவி எட் சென்சார்கள் மற்றும் நகரும் படுக்கைகளை நோக்கமாகக் கொண்டுள்ளது, இது ஆராயும் போது மாறும் நிறைய வெளிப்புற சக்திகளை அனுபவிக்கிறது.

source: Installing SciPy
ta: SCIPY ஐ நிறுவுதல்

source: The filtering code uses the excellent [SciPy](https://scipy.org/) library to compute the filter coefficients based on the values your enter into the config.
ta: வடிகட்டுதல் குறியீடு நீங்கள் உள்ளமைவில் உள்ளிடுவதற்கு மதிப்புகளின் அடிப்படையில் வடிகட்டி குணகங்களை கணக்கிட சிறந்த [SCIPY] (https://scipy.org/) நூலகத்தைப் பயன்படுத்துகிறது.

source: Pre-compiled SciPi builds are available for Python 3 on 32 bit Raspberry Pi systems. 32 bit + Python 3 is strongly recommended because it will streamline your installation experience. It does work with Python 2 but installation can take 30+ minutes and require installing additional tools.
ta: 32 பிட் ராச்பெர்ரி பை அமைப்புகளில் பைதான் 3 க்கு முன் தொகுக்கப்பட்ட SCIPI கட்டடங்கள் கிடைக்கின்றன. 32 பிட் + பைதான் 3 கடுமையாக பரிந்துரைக்கப்படுகிறது, ஏனெனில் இது உங்கள் நிறுவல் அனுபவத்தை நெறிப்படுத்தும். இது பைதான் 2 உடன் வேலை செய்கிறது, ஆனால் நிறுவல் 30+ நிமிடங்கள் ஆகலாம் மற்றும் கூடுதல் கருவிகளை நிறுவ வேண்டும்.

source: Filter Workbench
ta: வொர்க் பெஞ்சை வடிகட்டவும்

source: The filter parameters should be selected based on drift seen on the printer during normal operation. A Jupyter notebook is provided in scripts, [filter_workbench.ipynb](../scripts/filter_workbench.ipynb), to perform a detailed investigation with real captured data and FFTs.
ta: சாதாரண செயல்பாட்டின் போது அச்சுப்பொறியில் காணப்படும் சறுக்கலின் அடிப்படையில் வடிகட்டி அளவுருக்கள் தேர்ந்தெடுக்கப்பட வேண்டும். உண்மையான கைப்பற்றப்பட்ட தரவு மற்றும் FFT களுடன் விரிவான விசாரணையைச் செய்ய ச்கிரிப்ட்கள், [filter_workbench.ipynb] (../ ச்கிரிப்ட்கள்/வடிகட்டி_பொன்பெஞ்ச்.பின்பி) இல் ஒரு சூபிட்டர் நோட்புக் வழங்கப்பட்டுள்ளது.

source: Filtering Suggestions
ta: பரிந்துரைகள் வடிகட்டுதல்

source: For those just trying to get a filter working follow these suggestions:
ta: ஒரு வடிகட்டியைப் பெற முயற்சிப்பவர்களுக்கு இந்த பரிந்துரைகளைப் பின்பற்றவும்:

source: The only essential option is `drift_filter_cutoff_frequency`. A conservative starting value is `0.5`Hz. Prusa shipped the MK4 with a setting of `0.8`Hz and the XL with `11.2`Hz. This is probably a safe range to experiment with. This value should be increased only until normal drift due to bowden tube force is eliminated. Setting this value too high will result in slow triggering and excess force going through the toolhead.
ta: ஒரே அத்தியாவசிய விருப்பம் `STRIFT_FILTER_CUTOFF_FREQUENCY`. ஒரு பழமைவாத தொடக்க மதிப்பு `0.5`hz. ப்ரூசா எம்.கே 4 ஐ `0.8` எச்.இசட் மற்றும் எக்ச்எல் அமைப்புடன்` 11.2` எச்.இசட் மூலம் அனுப்பினார். இது ஆய்வு செய்ய ஒரு பாதுகாப்பான வரம்பாகும். போடன் குழாய் ஆற்றல் காரணமாக சாதாரண சறுக்கல் அகற்றப்படும் வரை மட்டுமே இந்த மதிப்பு அதிகரிக்கப்பட வேண்டும். இந்த மதிப்பை மிக அதிகமாக அமைப்பதன் மூலம் மெதுவான தூண்டுதல் மற்றும் கருவியின் வழியாக அதிகப்படியான ஆற்றல் ஏற்படும்.

source: Keep `trigger_force` low. The default is `75`g. The drift filter keeps the internal grams value very close to 0 so a large trigger force is not needed.
ta: `தூண்டுதல்_ஃபோர்ச்` குறைவாக வைத்திருங்கள். இயல்புநிலை `75` சி. சறுக்கல் வடிகட்டி உள் கிராம் மதிப்பை 0 க்கு மிக அருகில் வைத்திருக்கிறது, எனவே ஒரு பெரிய தூண்டுதல் ஆற்றல் தேவையில்லை.

source: Keep `force_safety_limit` to a conservative value. The default value is 2Kg and should keep your toolhead safe while experimenting. If you hit this limit the `drift_filter_cutoff_frequency` value may be too high.
ta: பழமைவாத மதிப்புக்கு `force_safety_limit` ஐ வைத்திருங்கள். இயல்புநிலை மதிப்பு 2 கிலோ மற்றும் ஆய்வு செய்யும் போது உங்கள் கருவித்தொகையை பாதுகாப்பாக வைத்திருக்க வேண்டும். நீங்கள் இந்த வரம்பைத் தாக்கினால், `child_filter_cutoff_frequency` மதிப்பு மிக அதிகமாக இருக்கலாம்.

source: Suggestions for Load Cell Tool Boards
ta: சுமை செல் கருவி பலகைகளுக்கான பரிந்துரைகள்

source: This section covers suggestions for those developing toolhead boards that want to support [load_cell_probe]
ta: [LOAD_CELL_PROBE] ஐ ஆதரிக்க விரும்பும் கருவிஎட் பலகைகளுக்கான பரிந்துரைகளை இந்த பிரிவு உள்ளடக்கியது

source: ADC Sensor Selection & Board Development Hints
ta: ஏடிசி சென்சார் தேர்வு மற்றும் போர்டு மேம்பாட்டு குறிப்புகள்

source: Ideally a sensor would meet these criteria:
ta: வெறுமனே ஒரு சென்சார் இந்த அளவுகோல்களை நிறைவு செய்யும்:

source: At least 24 bits wide
ta: குறைந்தது 24 பிட்கள் அகலம்

source: Use SPI communications
ta: SPI தகவல்தொடர்புகளைப் பயன்படுத்தவும்

source: Has a pin can be used to indicate sample ready without SPI communications. This is often called the "data ready" or "DRDY" pin. Checking a pin is much faster than running an SPI query.
ta: SPI தகவல்தொடர்புகள் இல்லாமல் மாதிரி தயாராக இருப்பதைக் குறிக்க ஒரு முள் பயன்படுத்தப்படலாம். இது பெரும்பாலும் "டேட்டா ரெடி" அல்லது "டி.ஆர்.டி" முள் என்று அழைக்கப்படுகிறது. ஒரு SPI வினவலை இயக்குவதை விட முள் சரிபார்ப்பது மிக வேகமாக உள்ளது.

source: Has a programmable gain amplifier gain setting of 128. This should eliminate the need for a separate amplifier.
ta: 128 இன் நிரல்படுத்தக்கூடிய ஆதாய பெருக்கி ஆதாய அமைப்பைக் கொண்டுள்ளது. இது ஒரு தனி பெருக்கியின் தேவையை அகற்ற வேண்டும்.

source: Indicates via SPI if the sensor has been reset. Detecting resets avoids timing errors in homing and using noisy data at startup. It can also help users track down wiring and grounding issues.
ta: சென்சார் மீட்டமைக்கப்பட்டிருந்தால் SPI வழியாக குறிக்கிறது. மீட்டமைப்புகளைக் கண்டறிதல் தொடக்கத்தில் நேர பிழைகளைத் தவிர்க்கிறது மற்றும் சத்தமில்லாத தரவைப் பயன்படுத்துகிறது. வயரிங் மற்றும் அடித்தள சிக்கல்களைக் கண்டறிய பயனர்களுக்கு இது உதவும்.

source: A selectable sample rate between 350Hz and 2Khz. Very high sample rates don't turn out to be beneficial in our 3D printers because they produce so much noise when moving fast. Sample rates below 250Hz will require slower probing speeds. They also increase the force on the toolhead due to longer delays between measurements. E.g. a 500Hz sensor moving at 5mm/s has the same safety factor as a 100Hz sensor moving at only 1mm/s.
ta: 350 எர்ட்ச் மற்றும் 2 கிஎர்ட்ச் இடையே தேர்ந்தெடுக்கப்பட்ட மாதிரி வீதம். மிக உயர்ந்த மாதிரி விகிதங்கள் எங்கள் 3D அச்சுப்பொறிகளில் பயனளிக்கும், ஏனெனில் அவை வேகமாக நகரும் போது அதிக சத்தத்தை உருவாக்குகின்றன. 250 எர்ட்சுக்கு கீழே உள்ள மாதிரி விகிதங்களுக்கு மெதுவான ஆய்வு விரைவு தேவைப்படும். அளவீடுகளுக்கு இடையில் நீண்ட தாமதங்கள் காரணமாக அவை கருவியின் சக்தியை அதிகரிக்கின்றன. எ.கா. 5 மிமீ/வி வேகத்தில் நகரும் 500 எர்ட்ச் சென்சார் 100 எர்ட்ச் சென்சார் 1 மிமீ/வி மட்டுமே நகரும் அதே பாதுகாப்பு காரணியைக் கொண்டுள்ளது.

source: If designing for under-bed applications, and you want to sense multiple load cells, use a chip that can sample all of its inputs simultaneously. Multiplex ADCs that require switching channels have a settling of several samples after each channel switch making them unsuitable for probing applications.
ta: BED இன் கீழ் பயன்பாடுகளை வடிவமைத்து, பல சுமை கலங்களை நீங்கள் உணர விரும்பினால், அதன் அனைத்து உள்ளீடுகளையும் ஒரே நேரத்தில் மாதிரி செய்யக்கூடிய ஒரு சிப்பைப் பயன்படுத்தவும். மாறுதல் சேனல்கள் தேவைப்படும் மல்டிபிளக்ச் ஏடிசிக்கள் ஒவ்வொரு சேனல் சுவிட்சிற்கும் பிறகு பல மாதிரிகளைத் தீர்ப்பதைக் கொண்டுள்ளன, அவை பயன்பாடுகளை ஆராய்வதற்கு பொருத்தமற்றவை.

source: Implementing support for a new sensor chip is not particularly difficult with Klipper's `bulk_sensor` and `load_cell_endstop` infrastructure.
ta: புதிய சென்சார் சிப்பிற்கான ஆதரவை செயல்படுத்துவது கிளிப்பரின் `மொத்த_சென்சர்` மற்றும்` load_cell_endstop` உள்கட்டமைப்புடன் குறிப்பாக கடினம் அல்ல.

source: 5V Power Filtering
ta: 5 வி ஆற்றல் வடிகட்டுதல்

source: It is strongly suggested to use larger capacitors than specified by the ADC chip manufacturer. ADC chips are usually targeted at low noise environments, like battery powered devices. Sensor manufacturers suggested application notes generally assume a quiet power supply. Treat their suggested capacitor values as minimums.
ta: ஏடிசி சிப் உற்பத்தியாளரால் குறிப்பிடப்பட்டதை விட பெரிய மின்தேக்கிகளைப் பயன்படுத்துவது வலுவாக பரிந்துரைக்கப்படுகிறது. ஏடிசி சில்லுகள் பொதுவாக பேட்டரி மூலம் இயங்கும் சாதனங்கள் போன்ற குறைந்த இரைச்சல் சூழல்களை இலக்காகக் கொண்டுள்ளன. சென்சார் உற்பத்தியாளர்கள் விண்ணப்பக் குறிப்புகள் பொதுவாக அமைதியான மின்சாரம் என்று கருதுகின்றனர். அவர்கள் பரிந்துரைத்த மின்தேக்கி மதிப்புகளை குறைந்தபட்சமாக கருதுங்கள்.

source: 3D printers put huge amounts of noise onto the 5V bus and this can ruin the sensor's accuracy. Test the sensor on the board with a typical 3D printer power supply and active stepper drivers before deciding on smoothing capacitor sizes.
ta: 3 டி அச்சுப்பொறிகள் 5 வி பச் மீது அதிக அளவு சத்தத்தை வைக்கிறது, இது சென்சாரின் துல்லியத்தை அழிக்கக்கூடும். மின்தேக்கி அளவுகளை மென்மையாக்குவதற்கு முன் ஒரு பொதுவான 3D அச்சுப்பொறி மின்சாரம் மற்றும் செயலில் உள்ள ச்டெப்பர் இயக்கிகள் மூலம் பலகையில் சென்சாரை சோதிக்கவும்.

source: Grounding & Ground Planes
ta: நிலத்தடி மற்றும் தரை விமானங்கள்

source: Analog ADC chips contain components that are very vulnerable to noise and ESD. A large ground plane on the first board layer under the chip can help with noise. Keep the chip away from power sections and DC to DC converters. The board should have proper grounding back to the DC supply.
ta: அனலாக் ஏடிசி சில்லுகளில் ஒலி மற்றும் ஈ.எச்.டி ஆகியவற்றிற்கு மிகவும் பாதிக்கப்படக்கூடிய கூறுகள் உள்ளன. சிப்பின் கீழ் முதல் பலகை அடுக்கில் ஒரு பெரிய தரை வானூர்தி சத்தத்திற்கு உதவும். பவர் பிரிவுகள் மற்றும் டி.சி முதல் டிசி மாற்றிகள் வரை சிப்பை விலக்கி வைக்கவும். வாரியத்தில் டி.சி விநியோகத்திற்கு சரியான தரையிறக்கம் இருக்க வேண்டும்.

source: HX711 and HX717 Notes
ta: HX711 மற்றும் HX717 குறிப்புகள்

source: This sensor is popular because of its low cost and availability in the supply chain. However, this is a sensor with some drawbacks:
ta: இந்த சென்சார் அதன் குறைந்த செலவு மற்றும் விநியோகச் சங்கிலியில் கிடைப்பதால் பிரபலமானது. இருப்பினும், இது சில குறைபாடுகளைக் கொண்ட ஒரு சென்சார்:

source: The HX71x sensors use bit-bang communication which has a high overhead on the MCU. Using a sensor that communicates via SPI would save resources on the tool board's CPU.
ta: HX71X சென்சார்கள் பிட்-பேங் தகவல்தொடர்புகளைப் பயன்படுத்துகின்றன, இது MCU இல் அதிக மேல்நிலை கொண்டது. SPI வழியாக தொடர்பு கொள்ளும் சென்சாரைப் பயன்படுத்துவது கருவி வாரியத்தின் சிபியு இல் வளங்களை மிச்சப்படுத்தும்.

source: The HX71x lacks a way to communicate reset events to the MCU. Klipper detects resets with a timing heuristic but this is not ideal. Resets indicate a problem with wiring or grounding.
ta: MCU உடன் நிகழ்வுகளை மீட்டமைத்தல் ஆகியவற்றைத் தொடர்புகொள்வதற்கான வழி HX71X இல் இல்லை. கிளிப்பர் ஒரு நேர ஊரிச்டிக் உடன் மீட்டமைப்பைக் கண்டறிந்துள்ளார், ஆனால் இது சிறந்ததல்ல. மீட்டமைப்புகள் வயரிங் அல்லது தரையில் சிக்கலைக் குறிக்கின்றன.

source: For probing applications the HX717 version is strongly preferred because of its higher sample rate (320 vs 80). Probing speed on the HX711 should be limited to less than 2mm/s.
ta: பயன்பாடுகளை ஆராய்வதற்கு HX717 பதிப்பு அதன் அதிக மாதிரி வீதத்தின் காரணமாக வலுவாக விரும்பப்படுகிறது (320 vs 80). HX711 இல் விரைவு 2 மிமீ/வி க்கும் குறைவாக இருக்க வேண்டும்.

source: The sample rate on the HX71x cannot be set from klipper's config. If you have the 10SPS version of the sensor (which is widely distributed) it needs to be physically re-wired to run at 80SPS.
ta: HX71X இல் உள்ள மாதிரி வீதத்தை கிளிப்பரின் உள்ளமைவிலிருந்து அமைக்க முடியாது. உங்களிடம் சென்சாரின் 10SPS பதிப்பு இருந்தால் (இது பரவலாக விநியோகிக்கப்படுகிறது) 80SPS இல் இயங்க உடல் ரீதியாக மீண்டும் கம்பி செய்யப்பட வேண்டும்.
