Repository: 247i/TACETr
Catalog: உரை/தானி/lecturify-contact-*.po
Languages: ta

source: Contact us
ta: எங்களை தொடர்புகொள்

source: E-mail
ta: மின்னஞ்சல்

source: Query [by email](mailto:support+202203@lecturify.net) for help please.
ta: வினவல் [மின்னஞ்சல் மூலம்] (மெயில்டோ: support+202203@lecturify.net) உதவிக்கு.

source: Speak with a tutor
ta: ஒரு ஆசிரியருடன் பேசுங்கள்

source: Please see tutoring timetable [here](http://lecturify.net/v6/time.php).
ta: பயிற்சி கால அட்டவணையைப் பார்க்கவும் [இங்கே] (http://lecturify.net/v6/time.php).

source: When the class is open, a tutor answers within several minutes.
ta: வகுப்பு திறந்திருக்கும் போது, ​​ஒரு ஆசிரியர் பல நிமிடங்களுக்குள் பதிலளிக்கிறார்.

source: Live chat
ta: நேரடி அரட்டை

source: We are not always instantly available. Please, keep the chat page open for at least half an hour.
ta: நாங்கள் எப்போதும் உடனடியாக கிடைக்கவில்லை. தயவுசெய்து, அரட்டை பக்கத்தை குறைந்தது அரை மணி நேரம் திறந்து வைக்கவும்.

source: Direct chat server address is <[irc.lecturify.net at #lecturify](irc://irc.lecturify.net/lecturify)>.
ta: நேரடி அரட்டை சேவையக முகவரி <[irc.lecturify.net இல் #lecturify] (irc: //irc.lecturify.net/lecturify)>.

source: Alternative server:
ta: மாற்று சேவையகம்:

source: ariana.lecturify.net (port 6667 / 6697 for TLS)
ta: arana.lecturify.net (TLS க்கு துறைமுகம் 6667 /6697)

source: Other networks
ta: பிற நெட்வொர்க்குகள்

source: Lecturify also has an IRC channel at the following networks:
ta: விரிவுரை பின்வரும் நெட்வொர்க்குகளில் ஒரு ஐ.ஆர்.சி சேனலையும் கொண்டுள்ளது:

source: [HybridIRC](https://www.hybridirc.com), in English and Turkish
ta: [HybridIRC](https://www.hybridirc.com), in ஆங்கிலம் and துருக்கிய

source: [IRCgo](https://www.ircgo.org), in English and Arabic
ta: [Ircgo] (https://www.ircgo.org), ஆங்கிலம் மற்றும் அரபு மொழியில்

source: [KampungChat](https://www.kampungchat.net), Malaysian
ta: [Kampungchat] (https://www.kampungchat.net), மலேசியன்

source: [libera](http://libera.chat)
ta: [லைபரா] (http://libera.chat)

source: [[!meta title="Lecturify - IRC chat, tutoring, virtual servers - contact"]]
ta: [[! மேவு தலைப்பு = "விரிவுரை - ஐ.ஆர்.சி அரட்டை, பயிற்சி, மெய்நிகர் சேவையகங்கள் - தொடர்பு"]]

source: [[!meta description="Lecturify - chat server, web hosting, and *NIX virtual servers - chat and email contacts."]]
ta: [[! மேவு விளக்கம் = "விரிவுரை - அரட்டை சேவையகம், வலை ஓச்டிங் மற்றும் *நிக்ச் மெய்நிகர் சேவையகங்கள் - அரட்டை மற்றும் மின்னஞ்சல் தொடர்புகள்."]]]
