Repository: 247i/TACETr
Catalog: உரை/தானி/lecturify-services-*.po
Languages: ta

source: How to request a service
ta: ஒரு சேவையை எவ்வாறு கோருவது

source: Click [here](http://lecturify.net/index_mail.php) to send a quick query. We will respond within 24 hours.
ta: விரைவான வினவலை அனுப்ப [இங்கே] (http://lecturify.net/index_mail.php) சொடுக்கு செய்க. நாங்கள் 24 மணி நேரத்திற்குள் பதிலளிப்போம்.

source: **<mark>[Book a class now](https://book0-lg.lecturify.net/)</mark> - we can help you with using our services, or learning programming, languages, mathematics, science, design, website development, internships, and many more.**
ta: . , வலைத்தள மேம்பாடு, இன்டர்ன்சிப் மற்றும் பல. **

source: Please request our services by email or live chat - see [[contact]] - include the following information:
ta: தயவுசெய்து எங்கள் சேவைகளை மின்னஞ்சல் அல்லது நேரடி அரட்டை மூலம் கோருங்கள் - [[தொடர்பு]] ஐப் பார்க்கவும் - பின்வரும் தகவல்களைச் சேர்க்கவும்:

source: Desired account name: Desired service (virtual server, web hosting, bouncer, tutoring): Reason for request (can include link to your publications, or your previous code, and a description of desired usage): Your contact (email, social media):
ta: விரும்பிய கணக்கு பெயர்: விரும்பிய பணி (மெய்நிகர் சேவையகம், வலை ஓச்டிங், பவுன்சர், பயிற்சி): கோரிக்கைக்கான காரணம் (உங்கள் வெளியீடுகளுக்கான இணைப்பு அல்லது உங்கள் முந்தைய குறியீடு மற்றும் விரும்பிய பயன்பாட்டின் விளக்கம்): உங்கள் தொடர்பு (மின்னஞ்சல், சமூக ஊடகங்கள்):

source: If you are requesting IRC classes tutoring, or a virtual server, please also include the following information:
ta: நீங்கள் ஐ.ஆர்.சி வகுப்புகள் பயிற்சி அல்லது மெய்நிகர் சேவையகத்தைக் கோருகிறீர்கள் என்றால், தயவுசெய்து பின்வரும் தகவல்களையும் சேர்க்கவும்:

source: Your time zone: Your hardware (laptop, desktop, which operating system): Your existing experience with computing: What you would like to learn or create:
ta: உங்கள் நேர மண்டலம்: உங்கள் வன்பொருள் (மடிக்கணினி, டெச்க்டாப், எந்த இயக்க முறைமை): கம்ப்யூட்டிங் மூலம் உங்கள் தற்போதைய அனுபவம்: நீங்கள் என்ன கற்றுக்கொள்ள அல்லது உருவாக்க விரும்புகிறீர்கள்:

source: Thank you!
ta: நன்றி!

source: Our services
ta: எங்கள் சேவைகள்

source: Anonymity network
ta: அநாமதேய பிணையம்

source: We are also available in Tor & I2P.
ta: நாங்கள் TOR மற்றும் I2P இல் கிடைக்கிறோம்.

source: Onion address: p3hv3vzds6ctjucd3l2mbr2cmgzrabighyth3q72a3ue46j46btpv5ad.onion
ta: வெங்காய முகவரி: P3HV3VZDS6CTJUCD3L2MBR2CMGZRABighth3Q72A3U3UE46J46BTPV5AD.ONION

source: Eepsites: lecturify.i2p
ta: Eepsites: rexeprify.i2p

source: Federated social media
ta: கூட்டாட்சி சமூக ஊடகங்கள்

source: Nostr Relay
ta: நோச்ட் ரிலே

source: > "nostr" stands for "Notes and Other Stuff Transmitted by Relays" and is an open protocol for censorship-resistant global networks
ta: > "நோச்ட்" என்பது "குறிப்புகள் மற்றும் ரிலேக்களால் கடத்தப்படும் பிற விசயங்கள்" மற்றும் தணிக்கை-எதிர்ப்பு உலகளாவிய நெட்வொர்க்குகளுக்கான திறந்த நெறிமுறையாகும்

source: Configure your Nostr client to connect to our relay at: wss://nostr.lecturify.net
ta: எங்கள் ரிலேவுடன் இணைக்க உங்கள் NOSR கிளையண்டை உள்ளமைக்கவும்: WSS: //nostr.lecturify.net

source: Toard
ta: டார்ட்

source: We are running Tird, which is an anonymous imageboard. Talk / create thread about stuff here: <https://yonle.lecturify.net/discover.html>
ta: நாங்கள் டர்ட் இயக்குகிறோம், இது அநாமதேய பட பலகை. இங்கே விசயங்களைப் பற்றி பேச/உருவாக்கவும்: <https://yonle.lecturify.net/discover.html>

source: XMPP <a href='https://compliance.conversations.im/server/lecturify.net'><img src='https://compliance.conversations.im/badge/lecturify.net'></a>
ta: XMPP <a href = 'https: //compliance.conversation.im/server/lecturify.net'> <img src = 'https: //compliance.conversations.im/badge/lecturify.net'> </a>

source: XMPP is an extensive chat protocol. We have XMPP server running at lecturify.net.
ta: எக்ச்எம்பிபி ஒரு விரிவான அரட்டை நெறிமுறை. எங்களிடம் XMPP சேவையகம் lecturify.net இல் இயங்குகிறது.

source: Install an [XMPP Client](https://xmpp.org/software/clients/), Sign up and meet us at [#lecturify@irc.lecturify.net](xmpp:%23lecturify@irc.lecturify.net?join)!
ta: ஒரு [XMPP கிளையண்ட்] (https://xmpp.org/software/clients/) ஐ நிறுவவும், பதிவுசெய்து எங்களை [#lecturify@irc.lecturify.net] இல் சந்திக்கவும்? )!

source: Pleroma
ta: பிளெரோமா

source: <https://fedi.lecturify.net> is a social media. We run it on the open-source federated pleroma software that supports the ActivityPub protocol. Join and share your links or images today.
ta: <https://fedi.lecturify.net> ஒரு சமூக ஊடகமாகும். செயல்பாட்டு பப் நெறிமுறையை ஆதரிக்கும் திறந்த-மூல கூட்டாட்சி பிளெரோமா மென்பொருளில் அதை இயக்குகிறோம். உங்கள் இணைப்புகள் அல்லது படங்களை இன்று சேர்த்து பகிர்ந்து கொள்ளுங்கள்.

source: Misskey
ta: மிச்கி

source: <https://soc.lecturify.net> is another federated social media platform similar to Pleroma.
ta: <https://soc.lecturify.net> என்பது பிளெரோமாவைப் போன்ற மற்றொரு கூட்டாட்சி சமூக ஊடக தளமாகும்.

source: Video and games
ta: வீடியோ மற்றும் விளையாட்டுகள்

source: Minetest block building game
ta: மின்டெச்ட் பிளாக் கட்டிட விளையாட்டு

source: Minetest is a classic and fun free software game in which players build with blocks.
ta: மின்டெச்ட் ஒரு உன்னதமான மற்றும் வேடிக்கையான இலவச மென்பொருள் விளையாட்டு ஆகும், இதில் வீரர்கள் தொகுதிகளுடன் உருவாக்குகிறார்கள்.

source: Install a client at <http://www.minetest.net> and configure the client to connect to our server minetest.lecturify.net:30000 today. :)
ta: ஒரு கிளையண்டை <http://www.minetest.net> இல் நிறுவி, எங்கள் சேவையக மினெட்டெச்டுடன் இணைக்க கிளையண்டை உள்ளமைக்கவும். Lecturify.net:30000. :)

source: <https://ytmous.lecturify.net> is a minimal youtube proxy, run with [ytmous](https://github.com/ytmous/ytmous).
ta: <https://ytmous.lecturify.net> என்பது குறைந்தபட்ச யூடியூப் பதிலாள் ஆகும், இது [ytmous] (https://github.com/ytmous/ytmous)

source: Hosting
ta: ஓச்டிங்

source: Web hosting
ta: வலை ஓச்டிங்

source: We offer web hosting with PHP; 1GB space per user; PHP enabled; no shell access, file upload using SFTP protocol.
ta: நாங்கள் பிஎச்பி உடன் வலை ஓச்டிங் வழங்குகிறோம்; ஒரு பயனருக்கு 1 சிபி இடம்; பிஎச்பி இயக்கப்பட்டது; செல் அணுகல் இல்லை, SFTP நெறிமுறையைப் பயன்படுத்தி கோப்பு பதிவேற்றம்.

source: Click [here](http://lecturify.net/index_mail.php) to request this service. We will reply to you within 2 working days.
ta: இந்த சேவையை கோர [இங்கே] (http://lecturify.net/index_mail.php) சொடுக்கு செய்க. 2 வேலை நாட்களுக்குள் நாங்கள் உங்களுக்கு பதிலளிப்போம்.

source: Virtual server rent
ta: மெய்நிகர் சேவையக வாடகை

source: We also offer virtual server hosting with OpenBSD or Linux. Includes root access. OpenBSD or Linux Operating System. Includes 1GB of RAM, and a shared CPU: 2x Intel Xeon E5-2630 V1 HEX (6) Core 2.3Ghz (will not work with V2 CPUs), and 5GB of disk storage.
ta: OpenBSD அல்லது Linux உடன் மெய்நிகர் சேவையக ஓச்டிங்கையும் வழங்குகிறோம். ரூட் அணுகல் அடங்கும். OpenBSD அல்லது Linux இயக்க முறைமை. 1 சிபி ரேம், மற்றும் பகிரப்பட்ட சிபியு: 2 ஃச் இன்டெல் சியோன் இ 5-2630 வி 1 ஃச் (6) கோர் 2.3 சிஎர்ட்ச் (வி 2 சிபியுக்களுடன் வேலை செய்யாது), மற்றும் 5 சிபி வட்டு சேமிப்பு ஆகியவை அடங்கும்.

source: IRC chat Bouncers
ta: ஐ.ஆர்.சி அரட்டை பவுன்சர்கள்

source: We offer IRC chat "bouncers", software that saves chat history while you are offline. Unlimited number of networks. Includes access to ZNC web panel for settings and configuration. Custom vHosts supported. Custom Bouncer modules supported.
ta: நீங்கள் ஆஃப்லைனில் இருக்கும்போது அரட்டை வரலாற்றைக் காப்பாற்றும் மென்பொருளான ஐ.ஆர்.சி அரட்டை "பவுன்சர்கள்" வழங்குகிறோம். வரம்பற்ற நெட்வொர்க்குகள். அமைப்புகள் மற்றும் உள்ளமைவுக்கான ZNC வலை குழுவிற்கான அணுகல் அடங்கும். தனிப்பயன் VHOST கள் ஆதரிக்கப்படுகின்றன. தனிப்பயன் பவுன்சர் தொகுதிகள் ஆதரிக்கப்படுகின்றன.

source: ZNC: [Screenshot 1](http://lecturify.net/znc1.png), [Screenshot 2](http://lecturify.net/znc3.png)
ta: ZNC: [ச்கிரீன்சாட் 1] (http://lecturify.net/znc1.png), [ச்கிரீன்சாட் 2] (http://lecturify.net/znc3.png)

source: 'Gamja(Soju)' webchat: [Screenshot 1](http://lecturify.net/soju1.png)
ta: 'கம்சா (சோசு)' வெப்சாட்: [ச்கிரீன்சாட் 1] (http://lecturify.net/soju1.png)

source: 'Theloungechat' webchat: [Screenshot 1](https://lecturify.net/2022-10-31-093412_1578x768_scrot.png)
ta: 'தி லவுஞ்ச் அரட்டை' வலை அரட்டை: [ச்கிரீன்சாட் 1] (https://lecturify.net/2022-10-31-093412_1578x768_scrot.png)

source: E-mail
ta: மின்னஞ்சல்

source: We offer NICK@pomelo.lecturify.net email hosting. 250MB free. We can add your domain or subdomain.
ta: நாங்கள் nick@pomelo.lecturify.net மின்னஞ்சல் ஓச்டிங்கை வழங்குகிறோம். 250MB இலவசம். நாங்கள் உங்கள் டொமைன் அல்லது சப்டொமைனைச் சேர்க்கலாம்.

source: Tutoring
ta: பயிற்சி

source: We also run tutoring via the live chat, where we can help you with computing and English topics. Please check its schedule [here](http://lecturify.net/v6/time.php). If you are interested in teaching your own course with us, please see [[how to add a new course|services/tutoring/add]] page.
ta: நேரடி அரட்டை வழியாக நாங்கள் பயிற்சியை நடத்துகிறோம், அங்கு கம்ப்யூட்டிங் மற்றும் ஆங்கில தலைப்புகளில் நாங்கள் உங்களுக்கு உதவ முடியும். அதன் அட்டவணையை [இங்கே] சரிபார்க்கவும் (http://lecturify.net/v6/time.php). எங்களுடன் உங்கள் சொந்த பாடத்திட்டத்தை கற்பிக்க நீங்கள் ஆர்வமாக இருந்தால், தயவுசெய்து [[புதிய பாடத்திட்டத்தை எவ்வாறு சேர்ப்பது | சேவைகள்/பயிற்சி/சேர்க்க]] பக்கத்தைப் பார்க்கவும்.

source: Subjects, teachers, students, and notes on availability
ta: பாடங்கள், ஆசிரியர்கள், மாணவர்கள் மற்றும் கிடைப்பது குறித்த குறிப்புகள்

source: The subjects and participants are listed below. The first column is the subject, the second column is the list of interested teachers and the third column is the list of interested learners. Please [[contact]] us to request being added to a topic, or a new topic to be created.
ta: பாடங்கள் மற்றும் பங்கேற்பாளர்கள் கீழே பட்டியலிடப்பட்டுள்ளனர். முதல் நெடுவரிசை பொருள், இரண்டாவது நெடுவரிசை ஆர்வமுள்ள ஆசிரியர்களின் பட்டியல் மற்றும் மூன்றாவது நெடுவரிசை ஆர்வமுள்ள கற்பவர்களின் பட்டியல். தயவுசெய்து [[தொடர்பு]] ஒரு தலைப்பில் சேர்க்கப்பட வேண்டும் அல்லது உருவாக்கப்பட வேண்டிய புதிய தலைப்பு.

source: Note: Tcache interested in learning plan9 and python
ta: குறிப்பு: பிளான் 9 மற்றும் பைதான் ஆகியவற்றைக் கற்றுக்கொள்வதில் TCACHE ஆர்வம்

source: Note: Tcache interested in teaching html, css and shell
ta: குறிப்பு: HTML, சிஎச்எச் மற்றும் செல் கற்பிப்பதில் TCACHE ஆர்வம்

source: Note: Tcache timezone GMT+5, availability to be confirmed on case by case basis
ta: குறிப்பு: TCACHE TIMESONE GMT+5, வழக்கு அடிப்படையில் வழக்கில் உறுதிப்படுத்தப்பட வேண்டும்

source: Note: antithesis interested in learning plan9 (front programming)
ta: குறிப்பு: பிளான் 9 கற்றலில் ஆர்வமுள்ள எதிர்விளைவு (முன் நிரலாக்க)

source: Outcomes
ta: விளைவுகள்

source: Possible 'duties' for the Lecturify 'tutoring / internship':
ta: விரிவுரை 'பயிற்சி / இன்டர்ன்சிப்' க்கான 'கடமைகள்':

source: writing chat-based interactive learning platform including a chat interface via IRC protocol in such programming languages as Perl or Python or Nodejs for courses delivery and a calendar scheduler
ta: பெர்ல் அல்லது பைதான் அல்லது படிப்புகள் வழங்கல் மற்றும் ஒரு காலண்டர் திட்டமிடல் போன்ற நிரலாக்க மொழிகளில் ஐ.ஆர்.சி நெறிமுறை வழியாக அரட்டை இடைமுகம் உட்பட அரட்டை அடிப்படையிலான ஊடாடும் கற்றல் தளத்தை எழுதுதல்

source: writing administrative modules for IRC chat 'bouncer' software to add tracking of users' metadata and identification of abusive accounts
ta: ஐ.ஆர்.சி அரட்டை 'பவுன்சர்' மென்பொருளுக்கான நிர்வாக தொகுதிகளை எழுதுதல் பயனர்களின் மேனிலை தரவு கண்காணிப்பு மற்றும் தவறான கணக்குகளை அடையாளம் காணுதல்

source: installation and administration of LDAP server for users authentication
ta: பயனர்களின் அங்கீகாரத்திற்காக LDAP சேவையகத்தின் நிறுவல் மற்றும் நிர்வாகம்

source: identification of suitable user-friendly software for localization, such as Weblate, and its subsequent installation and administration
ta: வலைபெயர்ப்பு போன்ற உள்ளூர்மயமாக்கலுக்கான பொருத்தமான பயனர் நட்பு மென்பொருளை அடையாளம் காணுதல் மற்றும் அதன் அடுத்தடுத்த நிறுவல் மற்றும் நிர்வாகம்

source: writing documentation about usage instructions for lecturify chat and tutoring services, and guides how to start contributing
ta: விரிவுரை அரட்டை மற்றும் பயிற்சி சேவைகளுக்கான பயன்பாட்டு வழிமுறைகளைப் பற்றிய ஆவணங்களை எழுதுதல், மற்றும் பங்களிப்பை எவ்வாறு தொடங்குவது என்பதை வழிநடத்துகிறது

source: communication with end users seeking their feedback and possible involvement with system administration, programming, testing, or translation
ta: இறுதி பயனர்களுடனான தொடர்பு மற்றும் கணினி நிர்வாகம், நிரலாக்க, சோதனை அல்லது மொழிபெயர்ப்பு ஆகியவற்றுடன் தங்கள் கருத்தைத் தேடும் மற்றும் சாத்தியமான ஈடுபாடு

source: testing sandbox programmable game minetest on minetest.lecturify.net port 3000
ta: சாண்ட்பாக்ச் நிரல்படுத்தக்கூடிய கேம் மின்டெச்ட்டை minetest.lecturify.net துறைமுகம் 3000 இல் சோதனை செய்தல்

source: implementation of A/B testing in the lecturify home page to identify design that improves users' engagement
ta: பயனர்களின் ஈடுபாட்டை மேம்படுத்தும் வடிவமைப்பை அடையாளம் காண விரிவுரை முகப்பு பக்கத்தில் A/B சோதனையை செயல்படுத்துதல்

source: Expected outcomes:
ta: எதிர்பார்க்கப்படும் முடிவுகள்:

source: in the case of found bugs, bug reports to the developers of free software, and possible written patches upstream
ta: கண்டுபிடிக்கப்பட்ட பிழைகள் விசயத்தில், இலவச மென்பொருளின் டெவலப்பர்களுக்கு பிழை அறிக்கைகள் மற்றும் சாத்தியமான எழுதப்பட்ட திட்டுகள் மேலோடை

source: new software being written, the 'ecourses' chat based learning platform
ta: புதிய மென்பொருள் எழுதப்படுவது, 'ஈகோர்சச்' அரட்டை அடிப்படையிலான கற்றல் தளம்

source: written materials for these 'ecourses', such as guides for beginners to learn English, programming, and system administration
ta: ஆங்கிலம், நிரலாக்க மற்றும் கணினி நிர்வாகம் கற்க ஆரம்பிக்கும் வழிகாட்டிகள் போன்ற இந்த 'ஈகோர்ச்களுக்கான' எழுதப்பட்ட பொருட்கள்

source: created improved version of the lecturify web site that is clearer and more engaging
ta: தெளிவான மற்றும் அதிக ஈடுபாட்டுடன் கூடிய விரிவுரை வலைத்தளத்தின் மேம்பட்ட பதிப்பை உருவாக்கியது

source: added translations from the end users into the lecturify software
ta: இறுதி பயனர்களிடமிருந்து மொழிபெயர்ப்புகளை விரிவுரைக்கும் மென்பொருளில் சேர்க்கப்பட்டது

source: Learned skills:
ta: கற்றறிந்த திறன்கள்:

source: gained experience talking with beginners and helping them with these interactive guides and improving these guides based on the users' feedback
ta: ஆரம்பகால நபர்களுடன் பேசுவதும், இந்த ஊடாடும் வழிகாட்டிகளுடன் அவர்களுக்கு உதவுவதும், பயனர்களின் கருத்தின் அடிப்படையில் இந்த வழிகாட்டிகளை மேம்படுத்துவதற்கும் பட்டறிவு பெற்றது

source: gained skill of searching for software for a specific purpose, such as the software search for localization
ta: உள்ளூர்மயமாக்கலுக்கான மென்பொருள் தேடல் போன்ற ஒரு குறிப்பிட்ட நோக்கத்திற்காக மென்பொருளைத் தேடுவதற்கான திறனைப் பெற்றது

source: gained skill of improvement of software UX and documentation to increase users' retention
ta: பயனர்களின் தக்கவைப்பை அதிகரிக்க மென்பொருள் யுஎக்ச் மற்றும் ஆவணங்களை மேம்படுத்துவதற்கான திறனைப் பெற்றது

source: gained skill of communication with end users and incorporating their feedback in the form of task items or fixes
ta: இறுதி பயனர்களுடன் தொடர்புகொள்வதற்கான திறனைப் பெற்றது மற்றும் அவர்களின் கருத்துக்களை பணி உருப்படிகள் அல்லது திருத்தங்கள் வடிவில் இணைத்துக்கொண்டது

source: improved understanding of authentication protocols and communication protocols on the Internet and their advantages and disadvantages
ta: இணையத்தில் அங்கீகார நெறிமுறைகள் மற்றும் செய்தி தொடர்பு நெறிமுறைகள் மற்றும் அவற்றின் நன்மைகள் மற்றும் தீமைகள் பற்றிய மேம்பட்ட புரிதல்

source: [[!meta title="Lecturify - IRC chat, tutoring, virtual servers"]]
ta: [[! மேவு தலைப்பு = "விரிவுரை - ஐ.ஆர்.சி அரட்டை, பயிற்சி, மெய்நிகர் சேவையகங்கள்"]]]

source: [[!meta description="Lecturify - chat server, web hosting, and *NIX virtual servers - first month free trial. Also, error-based tutoring and minetest."]]
ta: [[!meta description="Lecturify - chat சேவையகம், விரலிடைத் தோல் hosting, and *NIX virtual சேவையகங்கள் - first month free trial. Also, error-based tutoring and minetest."]]
