Repository: 247i/TACETr
Catalog: உரை/தானி/lexica-app-metadata-*.po
Languages: ta

# changelogs/20009.txt:1
source: Updated translations. Enjoy Lexica? Support further development via Liberapay or GitHub Sponsors.
ta: புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள். லெக்சிகாவை அனுபவிக்கவா? லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக மேலும் வளர்ச்சியை ஆதரிக்கவும்.

# changelogs/20010.txt:1
source: Multiplayer improvement: * Show how many words in the board prior to inviting others or joining a game. * If you prefer more or less words for your multiplayer game, you can now refresh the board prior to playing. Bug fix: * Consecutive sound effects now play as expected (One of the oldest reported bugs, from 2017, thanks for the report PakoPakoJr!) Enjoy Lexica? Support further development via Liberapay or GitHub Sponsors.
ta: மல்டிபிளேயர் மேம்பாடு: * மற்றவர்களை அழைப்பதற்கு அல்லது ஒரு விளையாட்டில் சேருவதற்கு முன்பு குழுவில் எத்தனை சொற்களைக் காட்டுங்கள். * உங்கள் மல்டிபிளேயர் விளையாட்டுக்கு அதிகமாகவோ அல்லது குறைவாகவோ சொற்களை விரும்பினால், இப்போது விளையாடுவதற்கு முன்பு பலகையை புதுப்பிக்கலாம். பிழை பிழைத்திருத்தம்: . லெக்சிகாவை அனுபவிக்கவா? லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக மேலும் வளர்ச்சியை ஆதரிக்கவும்.

# changelogs/20011.txt:1
source: Improved dictionary options for Portuguese (Brasil) thanks to assistance from gjeuken! * Current dictionary renamed to portuguese (Brasil) (Extended) and includes letters with diacritics çáéíóúâêôãõà and the letters kwy. * New dictionary replaces these with a, c, e, i, o, and u, and removes k, w, and y. * Removed words containing unused diacritics: åèîïö. Suggestions for your favourite language? Feedback welcome. Support further development via Liberapay or GitHub Sponsors.
ta: போர்த்துகீசியத்திற்கான மேம்பட்ட அகராதி விருப்பங்கள் (பிரேசில்) gjeuken இன் உதவிக்கு நன்றி! . * புதிய அகராதி இவற்றை A, C, E, I, O, மற்றும் உ உடன் மாற்றுகிறது, மேலும் K, W மற்றும் ஒய் ஐ நீக்குகிறது. * பயன்படுத்தப்படாத டயக்ரிடிக்ச் கொண்ட அகற்றப்பட்ட சொற்கள்: re. உங்களுக்கு பிடித்த மொழிக்கான பரிந்துரைகள்? கருத்து வரவேற்பு. லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக மேலும் வளர்ச்சியை ஆதரிக்கவும்.

# changelogs/20012.txt:1
source: Updated translations.
ta: புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்.

# changelogs/20013.txt:1
source: Improvements: * Prompt for confirmation prior to ending game, reducing the likelihood that you accidentally end a game in error (Thanks to all who provided their input on this issue on GitHub). * Black navigation bar on dark and high contrast themes. Bugfix: * Refresh the theme of the main menu after changing themes (all other screens updated as expected). Support further development via Liberapay or GitHub Sponsors.
ta: மேம்பாடுகள்: * விளையாட்டை முடிப்பதற்கு முன் உறுதிப்படுத்தலுக்கான தூண்டுதல், நீங்கள் தற்செயலாக ஒரு விளையாட்டை பிழையாக முடிக்கும் வாய்ப்பைக் குறைக்கிறது (கிட்அப்பில் இந்த சிக்கலில் தங்கள் உள்ளீட்டை வழங்கிய அனைவருக்கும் நன்றி). * இருண்ட மற்றும் உயர் மாறுபட்ட கருப்பொருள்களில் கருப்பு வழிசெலுத்தல் பட்டி. பிழைத்திருத்த: * கருப்பொருள்களை மாற்றிய பின் முதன்மையான மெனுவின் கருப்பொருளைப் புதுப்பிக்கவும் (மற்ற அனைத்து திரைகளும் எதிர்பார்த்தபடி புதுப்பிக்கப்பட்டன). லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக மேலும் வளர்ச்சியை ஆதரிக்கவும்.

# changelogs/20014.txt:1
source: Updated translations. A big and heartfelt thank you to all the translators, who have now collectively translated Lexica into an amazing 40 different languages!
ta: புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள். ஒரு பெரிய மற்றும் இதயப்பூர்வமான அனைத்து மொழிபெயர்ப்பாளர்களுக்கும் நன்றி, இப்போது லெக்சிகாவை ஒரு அற்புதமான 40 வெவ்வேறு மொழிகளில் மொழிபெயர்த்துள்ளனர்!

# changelogs/20015.txt:1
source: Translations: * Added Lithuanian translation (thanks to g) * Updated translations. A big and heartfelt thank you to all the translators, who have now collectively translated Lexica into *over 40 different languages*!
ta: மொழிபெயர்ப்பு: * சேர்க்கப்பட்டது லிதுவேனியன் மொழிபெயர்ப்பு (சி நன்றி) * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள். ஒரு பெரிய மற்றும் இதயப்பூர்வமான அனைத்து மொழிபெயர்ப்பாளர்களுக்கும் நன்றி, இப்போது 40 க்கும் மேற்பட்ட வெவ்வேறு மொழிகளில் *லெக்சிகாவை கூட்டாக மொழிபெயர்த்துள்ளது!

# changelogs/20016.txt:1
source: Additional Spanish dictionary with Ñ but not other diacritics. Thank you very much to @jgmy for contributing this change. If you would like to add additional dictionaries for your favourite language, come join the community at http://github.com/lexica/lexica. Pull requests will be warmly received, as will issues recommending new dictionaries.
ta: கூடுதல் ச்பானிச் அகராதி க்கு உடன் ஆனால் பிற டயக்ரிடிக்ச் அல்ல. இந்த மாற்றத்தை பங்களித்த @jgmy க்கு மிக்க நன்றி. உங்களுக்கு பிடித்த மொழிக்கு கூடுதல் அகராதிகளைச் சேர்க்க விரும்பினால், http://github.com/lexica/lexica இல் சமூகத்தில் சேர வாருங்கள். புதிய அகராதிகளை பரிந்துரைக்கும் சிக்கல்களைப் போலவே, இழுக்கும் கோரிக்கைகள் அன்புடன் பெறப்படும்.

# changelogs/30000.txt:1
source: Better multiplayer support (thanks to ecrips): * Fixes boards containing "Qu". * Hides contents of the board to eager eyes when sharing via SMS. * WARNING: Multiplayer games from v3+ will cause older versions to crash. Upgrade to play against newer versions. Future enhancements will ask players to upgrade instead of crashing. Translations updated.
ta: சிறந்த மல்டிபிளேயர் உதவி (எக்ரிப்களுக்கு நன்றி): * "க்யூ" கொண்ட பலகைகளை சரிசெய்கிறது. * எச்எம்எச் வழியாக பகிரும்போது ஆர்வமுள்ள கண்களுக்கு வாரியத்தின் உள்ளடக்கங்களை மறைக்கிறது. * எச்சரிக்கை: V3+ இலிருந்து மல்டிபிளேயர் விளையாட்டுகள் பழைய பதிப்புகள் செயலிழக்கும். புதிய பதிப்புகளுக்கு எதிராக விளையாட மேம்படுத்தவும். எதிர்கால மேம்பாடுகள் வீரர்களை செயலிழக்காமல் மேம்படுத்தும்படி கேட்கும். மொழிபெயர்ப்பு புதுப்பிக்கப்பட்டது.

# changelogs/30001.txt:1
source: Improvements: * Fix for missing words in German dictionaries (thanks to db2222 and Morphior) Updated translations. Please provide feedback/report issues at https://github.com/lexica/lexica/issues. Support Lexica development via Liberapay or GitHub Sponsors :)
ta: மேம்பாடுகள்: * செர்மன் அகராதிகளில் காணாமல் போன சொற்களை சரிசெய்யவும் (DB2222 மற்றும் MORPHIOR க்கு நன்றி) புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள். தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும். லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக லெக்சிகா வளர்ச்சியை ஆதரிக்கவும் :)

# changelogs/30002.txt:1
source: New feature: * To see all words found so far in a game, tap the number of words at the bottom of the screen (thanks to @db2222). Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: புதிய அம்சம்: * ஒரு விளையாட்டில் இதுவரை காணப்பட்ட அனைத்து சொற்களையும் காண, திரையின் அடிப்பகுதியில் உள்ள சொற்களின் எண்ணிக்கையைத் தட்டவும் ( @db2222 க்கு நன்றி). தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30003.txt:1
source: Share a challenge! After finishing a game, you can now share that board with your friends and challenge them to beat your score. Similar to multiplayer, but for that time when you've just played a particularly interesting or challenging board layout that you think your friends will enjoy. Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: ஒரு சவாலைப் பகிர்ந்து கொள்ளுங்கள்! ஒரு விளையாட்டை முடித்த பிறகு, நீங்கள் இப்போது அந்த பலகையை உங்கள் நண்பர்களுடன் பகிர்ந்து கொள்ளலாம் மற்றும் உங்கள் மதிப்பெண்ணை வெல்ல அவர்களுக்கு அறைகூவல் விடலாம். மல்டிபிளேயரைப் போலவே, ஆனால் அந்த நேரத்தில் நீங்கள் குறிப்பாக சுவையான அல்லது சவாலான பலகை தளவமைப்பை விளையாடியபோது, ​​உங்கள் நண்பர்கள் அனுபவிப்பார்கள் என்று நீங்கள் நினைக்கிறீர்கள். தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30004.txt:1
source: Share a challenge! After finishing a game, you can now share that board with your friends and challenge them to beat your score. Similar to multiplayer, but for that time when you've just played a particularly interesting or challenging board layout that you think your friends will enjoy. New in 3.3.1: Updated translations.
ta: ஒரு சவாலைப் பகிர்ந்து கொள்ளுங்கள்! ஒரு விளையாட்டை முடித்த பிறகு, நீங்கள் இப்போது அந்த பலகையை உங்கள் நண்பர்களுடன் பகிர்ந்து கொள்ளலாம் மற்றும் உங்கள் மதிப்பெண்ணை வெல்ல அவர்களுக்கு அறைகூவல் விடலாம். மல்டிபிளேயரைப் போலவே, ஆனால் அந்த நேரத்தில் நீங்கள் குறிப்பாக சுவையான அல்லது சவாலான பலகை தளவமைப்பை விளையாடியபோது, ​​உங்கள் நண்பர்கள் அனுபவிப்பார்கள் என்று நீங்கள் நினைக்கிறீர்கள். 3.3.1 இல் புதியது: புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்.

# changelogs/30005.txt:1
source: Introducing the web version of Lexica! Special thanks to @MattRCole for such a huge effort bringing this to life! Multiplayer invites now include links to the new (beta) web version for those without Android devices. The QR code shown when starting a new multiplayer game can also show a URL to the web version. Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: லெக்சிகாவின் வலை பதிப்பை அறிமுகப்படுத்துகிறது! இதை உயிர்ப்பிக்கும் ஒரு பெரிய முயற்சிக்கு @Mattrcole க்கு சிறப்பு நன்றி! மல்டிபிளேயர் அழைப்புகள் இப்போது ஆண்ட்ராய்டு சாதனங்கள் இல்லாதவர்களுக்கான புதிய (பீட்டா) வலை பதிப்பிற்கான இணைப்புகளை உள்ளடக்கியது. புதிய மல்டிபிளேயர் விளையாட்டைத் தொடங்கும்போது காட்டப்படும் QR குறியீடு வலை பதிப்பில் ஒரு முகவரி ஐக் காட்டலாம். தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30006.txt:1
source: Better use of sounds (thanks to @splisp). Improved Dutch dictionary - no more diacritics (thanks to @verinatanck and @Sjord for the language specific input). Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: ஒலிகளின் சிறந்த பயன்பாடு (@SPLISP க்கு நன்றி). மேம்படுத்தப்பட்ட டச்சு அகராதி - இனி டயாக்ரிடிக்ச் இல்லை (மொழி குறிப்பிட்ட உள்ளீட்டிற்கு @verinatanck மற்றும் @sjord க்கு நன்றி). தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30007.txt:1
source: Improvements: * Cautiously improve Dutch word list, making it more conforming to the Scrabble word list (SWL), OpenTaal list, and Wiktionary (thanks to @Sjord) Bug fix: * During end game scoring, only show scores and the word definition button for actual words. Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: மேம்பாடுகள்: . பிழை பிழைத்திருத்தம்: * இறுதி விளையாட்டு மதிப்பெண்ணின் போது, ​​உண்மையான சொற்களுக்கு மதிப்பெண்களையும் சொல் வரையறை பொத்தானையும் மட்டுமே காண்பி. தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30008.txt:1
source: Improvements (thanks to Sjord): * English (GB) wordlist: Remove words that are not present in Collins, NASPA, Tournament, or Wiktionary. * Dutch dictionary: Better letter distributions for more fun games. Bug fix (thanks to OpenWarp): * Multiplayer correctly opens on Android 6.0. Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: மேம்பாடுகள் (Sjord க்கு நன்றி): * ஆங்கிலம் (சிபி) வேர்ட்லிச்ட்: காலின்ச், நாச்பா, போட்டி அல்லது விக்சனரியில் இல்லாத சொற்களை அகற்று. * டச்சு அகராதி: மேலும் வேடிக்கையான விளையாட்டுகளுக்கான சிறந்த கடிதம் விநியோகம். பிழை திருத்தம் (ஓபன்வார்பிற்கு நன்றி): * மல்டிபிளேயர் ஆண்ட்ராய்டு 6.0 இல் சரியாக திறக்கிறது. தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30009.txt:1
source: Added Indonesia translation (thanks to liimee) and updated others (thanks as always to the community of translators). Fix (thanks to hhpmmd): * German scores 6 points for letter "v" (previously was accidentally scoring 1). Minor UI changes: * Due to a no-longer supported library used to render buttons. Required more changes than expected, hence the minor bump to 3.7.x. Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: இந்தோனேசியா மொழிபெயர்ப்பைச் சேர்த்தது (லைமிக்கு நன்றி) மற்றும் மற்றவர்களைப் புதுப்பித்தது (மொழிபெயர்ப்பாளர்களின் சமூகத்திற்கு எப்போதும் நன்றி). சரி (HHPMMD க்கு நன்றி): * "வி" என்ற எழுத்துக்கு செர்மன் 6 புள்ளிகளைப் பெறுகிறது (முன்பு தற்செயலாக 1 மதிப்பெண் பெற்றது). சிறிய இடைமுகம் மாற்றங்கள்: * பொத்தான்களை வழங்க பயன்படும் நீண்டகால உதவி நூலகம் காரணமாக. எதிர்பார்த்ததை விட அதிகமான மாற்றங்கள் தேவை, எனவே சிறிய பம்ப் 3.7.x. தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30010.txt:1
source: Technical release: Bump target SDK to latest version.
ta: தொழில்நுட்ப வெளியீடு: பம்ப் இலக்கு SDK ஐ அண்மைக் கால பதிப்பிற்கு.

# changelogs/30011.txt:1
source: Dictionaries: * Added Brenton dictionary (thanks to ewenak). Fixes: * Fix crash when choosing game modes on Android 4.4 (thanks to adam-poteralowicz and Elarnon for continuing to keep Lexica running on older devices). Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: அகராதிகள்: * ப்ரெண்டன் அகராதி சேர்க்கப்பட்டது (எவெனக்குக்கு நன்றி). திருத்தங்கள்: * ஆண்ட்ராய்டு 4.4 இல் விளையாட்டு முறைகளைத் தேர்ந்தெடுக்கும்போது செயலிழப்பை சரிசெய்யவும் (பழைய சாதனங்களில் லெக்சிகாவை தொடர்ந்து இயக்குவதற்கு ஆடம்-பொட்டரனோவிச் மற்றும் எலார்னனுக்கு நன்றி). தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30012.txt:1
source: Fixes: * Brenton dictionary C'h now fits tiles (thanks to @ewenak). * Prevent overflowing time limit or time limits of zero (thanks to @adam-poteralowicz). Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: திருத்தங்கள்: * ப்ரெண்டன் அகராதி சி'எச் இப்போது ஓடுகளுக்கு பொருந்துகிறது (@ewenak க்கு நன்றி). * நிரம்பி வழியும் நேர வரம்பு அல்லது பூச்சியத்தின் நேர வரம்புகளைத் தடுக்கவும் ( @ஆடம்-பொட்டரனோவிக்சுக்கு நன்றி). தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30013.txt:1
source: Dictionaries: * Added Finnish dictionary (thanks to @dancek). Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: அகராதிகள்: * ஃபின்னிச் அகராதி சேர்க்கப்பட்டது (@Dancek க்கு நன்றி). தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30014.txt:1
source: Bugfixes: * Increase probability of letter N in German (no diacritics) * Small screen support * Remove j, k, w, x, y from Italian dictionary * Ensure all letters are shuffled correctly * Correctly show max score when viewing in-game found words * Align past words correctly * Tidy preference screen Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: பிழைத்திருத்தங்கள்: * செர்மன் மொழியில் N கடிதத்தின் நிகழ்தகவை அதிகரிக்கவும் (டயக்ரிடிக்ச் இல்லை) * சிறிய திரை உதவி * இத்தாலிய அகராதியிலிருந்து சே, கே, டபிள்யூ, ஃச், ஒய் ஆகியவற்றை அகற்று * எல்லா கடிதங்களும் சரியாக மாற்றப்படுவதை உறுதிசெய்க * விளையாட்டில் காணப்பட்ட சொற்களைப் பார்க்கும்போது அதிகபட்ச மதிப்பெண்ணை சரியாகக் காட்டுங்கள் * கடந்த கால சொற்களை சரியாக சீரமைக்கவும் * நேர்த்தியான விருப்பத் திரை தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30015.txt:1
source: Dictionaries: * Added Turkish dictionary (thanks to feedback from @bmusalli). Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: அகராதிகள்: * துருக்கிய அகராதியைச் சேர்த்தது (@bmusalli இன் பின்னூட்டத்திற்கு நன்றி). தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30016.txt:1
source: French dictionary improvements (thanks to input from @mccoys): * Improved board selection: Probabilities now calculated from the frequency with which letters occur in the dictionary. * Removed letters à, ö, ü, ë: Each occur in less than 50 words, typically in loanwords. * Q is always followed by u. Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: பிரஞ்சு அகராதி மேம்பாடுகள் (@MCCOY களின் உள்ளீட்டிற்கு நன்றி): * மேம்படுத்தப்பட்ட போர்டு தேர்வு: அகராதியில் கடிதங்கள் நிகழும் அதிர்வெண்ணிலிருந்து இப்போது கணக்கிடப்பட்ட நிகழ்தகவுகள். . * Q எப்போதும் உ ஐ பின்பற்றுகிறது. தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30017.txt:1
source: Dictionaries: * Added Croatian dictionary (thanks to help from @milotype). Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: அகராதிகள்: * குரோசிய அகராதி சேர்க்கப்பட்டது (@milotype இன் உதவிக்கு நன்றி). தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/30018.txt:1
source: Fixed: * Fixed crash when creating game modes with very high time limits (thanks @adam-poteralowicz). Translations: * Updated various translations. Misc: * Bump target SDK to 34. Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: சரி: * மிக அதிக நேர வரம்புகளைக் கொண்ட விளையாட்டு முறைகளை உருவாக்கும்போது நிலையான செயலிழப்பு (நன்றி @ஆடம்-பொட்டரனோவிச்). மொழிபெயர்ப்பு: * பல்வேறு மொழிபெயர்ப்புகளைப் புதுப்பித்தது. தவறான: * பம்ப் இலக்கு SDK க்கு 34 ஆக. தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/904.txt:1
source: * Show percentage of words/percentage of score at the end of games. * Added Japanese translations (Thanks to naofum)
ta: * விளையாட்டுகளின் முடிவில் சொற்களின் சதவீதம்/மதிப்பெண்ணின் சதவீதத்தைக் காட்டு. * சப்பானிய மொழிபெயர்ப்புகள் சேர்க்கப்பட்டன (NAOFUM க்கு நன்றி)

# changelogs/905.txt:1
source: * Updated logo to be more modern and follow specs from Material Design guidelines closely. * Added Catalan translations (Thanks to David García Garzón) * Added Spanish translations (Thanks to David García Garzón) * Added Persian translations (Thanks to Amir Aghdam)
ta: * லோகோ மிகவும் நவீனமாக இருக்கவும், பொருள் வடிவமைப்பு வழிகாட்டுதல்களிலிருந்து கண்ணாடியைப் பின்பற்றவும். * சேர்க்கப்பட்ட கற்றலான் மொழிபெயர்ப்புகள் (டேவிட் கார்சியா கார்சானுக்கு நன்றி) * ச்பானிச் மொழிபெயர்ப்புகள் சேர்க்கப்பட்டன (டேவிட் கார்சியா கார்சானுக்கு நன்றி) * பாரசீக மொழிபெயர்ப்புகள் சேர்க்கப்பட்டன (அமீர் அக்தத்திற்கு நன்றி)

# changelogs/906.txt:1
source: Translation improvements: * Catalan (David García Garzón) * Dutch (Heimen Stoffels) * Persian (Amir Aghdam) * Spanish (David García Garzón)
ta: மொழிபெயர்ப்பு மேம்பாடுகள்: * காடலான் (டேவிட் கார்சியா கார்சான்) * டச்சு (எய்மன் ச்டோஃபெல்ச்) * பாரசீக (அமீர் அக்தம்) * ச்பானிச் (டேவிட் கார்சியா கார்சான்)
