Repository: 247i/TACETr
Catalog: உரை/தானி/lexica-app-metadata-*.po
Languages: ta

# title.txt:1
source: Lexica
ta: லெக்சிகா

# short_description.txt:1
source: Find as many words as possible on a grid of random letters within a time limit
ta: ஒரு கால எல்லைக்குள் சீரற்ற எழுத்துக்களின் கட்டத்தில் முடிந்தவரை பல சொற்களைக் கண்டறியவும்

# full_description.txt:1
source: A word game where players find as many words as possible on a grid of random letters with a time limit. Select from several international dictionaries, with a combined total of millions of words. Play against friends in multiplayer mode, by sending them offline challenges via SMS/Email/QR code/etc. Build your own rules with customisable game modes: * 4x4, 5x5, and 6x6 sized boards * Different durations * Various scoring and hint modes Fully open source. No ads. No in-app purchases. No tracking. Ever. Please support further development at GitHub sponsors or Liberapay.
ta: நேர வரம்புடன் சீரற்ற எழுத்துக்களின் கட்டத்தில் வீரர்கள் முடிந்தவரை பல சொற்களைக் கண்டுபிடிக்கும் ஒரு சொல் விளையாட்டு. பல பன்னாட்டு அகராதிகளிலிருந்து தேர்ந்தெடுக்கவும், மொத்தம் மில்லியன் கணக்கான சொற்களுடன். எச்எம்எச்/மின்னஞ்சல்/கியூஆர் குறியீடு/போன்றவற்றின் வழியாக இணைப்பில்லாத சவால்களை அனுப்புவதன் மூலம், மல்டிபிளேயர் பயன்முறையில் நண்பர்களுக்கு எதிராக விளையாடுங்கள். தனிப்பயனாக்கக்கூடிய விளையாட்டு முறைகளுடன் உங்கள் சொந்த விதிகளை உருவாக்குங்கள்: * 4x4, 5x5, மற்றும் 6x6 அளவிலான பலகைகள் * வெவ்வேறு காலம் * பல்வேறு மதிப்பெண் மற்றும் குறிப்பு முறைகள் முழுமையாக திறந்த மூல. விளம்பரங்கள் இல்லை. பயன்பாட்டு கொள்முதல் இல்லை. கண்காணிப்பு இல்லை. எப்போதும். அறிவிலிமையம் ஒப்புரவாளர்கள் அல்லது லிபராபேயில் மேலும் வளர்ச்சியை ஆதரிக்கவும்.

# changelogs/1000.txt:1
source: New features (all contributed by JulianPaoloThiry): * High scores * Choice of word-length or letter (e.g. Scrabble) scoring * 6 x 6 board (requires words of length 5 or longer) * Integration with Aard2 and QuickDic offline dictionaries for definitions Improvements * Miscellanious UI improvements around scoring (JulianPaoloThiry) * Changes to the internals, allowing for different language boards in the future New translations: * French: john paul * Chinese (Traditional): riotism * Italian: Enrico Monese
ta: புதிய நற்பொருத்தங்கள் (அனைத்தும் சூலியன்பாலோதரி பங்களித்தன): * அதிக மதிப்பெண்கள் * சொல் நீளம் அல்லது கடிதத்தின் தேர்வு (எ.கா. ச்கிராப்பிள்) மதிப்பெண் * 6 ஃச் 6 போர்டு (5 அல்லது அதற்கு மேற்பட்ட நீளம் தேவை) * வரையறைகளுக்கு AARD2 மற்றும் QuickDic இணைப்பில்லாத அகராதிகளுடன் ஒருங்கிணைப்பு மேம்பாடுகள் * மதிப்பெண்களைச் சுற்றியுள்ள இடைமுகம் மேம்பாடுகள் (சூலியன்பாலோத்தரி) * இன்டர்னல்களில் மாற்றங்கள், எதிர்காலத்தில் வெவ்வேறு மொழி பலகைகளை அனுமதிக்கிறது புதிய மொழிபெயர்ப்புகள்: * பிரஞ்சு: சான் பால் * சீன (பாரம்பரிய): கலகலம் * இத்தாலியன்: என்ரிகோ மோனீச்

# changelogs/10000.txt:1
source: New in 1.0.0: * Entire new theme, including dark mode! (thanks elbotho for the design) * Brazilian Portugese dictionary (thanks rffontenelle) * Updated translations (thanks to the numerous wonderful translators in the community) Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: 1.0.0 இல் புதியது: * இருண்ட பயன்முறை உட்பட முழு புதிய தீம்! (வடிவமைப்பிற்கு நன்றி எல்போதோ) * பிரேசிலிய போர்த்துகீசிய அகராதி (நன்றி rffontenelle) * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் (சமூகத்தில் ஏராளமான அற்புதமான மொழிபெயர்ப்பாளர்களுக்கு நன்றி) தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/10100.txt:1
source: * Entire new theme, including dark mode! (thanks elbotho for the design) * Brazilian Portugese dictionary (thanks rffontenelle) * Updated translations (thanks to the numerous wonderful translators in the community) * End game when all words found (thanks adam-poteralowicz) * Fixed dark theme hint mode colours Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: * இருண்ட பயன்முறை உட்பட முழு புதிய தீம்! (வடிவமைப்பிற்கு நன்றி எல்போதோ) * பிரேசிலிய போர்த்துகீசிய அகராதி (நன்றி rffontenelle) * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் (சமூகத்தில் ஏராளமான அற்புதமான மொழிபெயர்ப்பாளர்களுக்கு நன்றி) * எல்லா வார்த்தைகளும் காணப்படும் போது விளையாட்டை முடிக்கவும் (நன்றி ஆடம்-பொட்டரனோவிச்) * நிலையான இருண்ட கருப்பொருள் குறிப்பு முறை வண்ணங்கள் தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/10200.txt:1
source: News: * Support Lexica development via GitHub Sponsors :) Features: * Sort list of words at the end of the game (thanks gsheridansmith) * New Russian dictionary (thanks ildar) * High contrast theme * Russian words defined using wiktionary instead of DDG * Prefer game boards with at least 45 words Bugfixes: * Fix misaligned buttons in certain languages * Add missing "cancel" option when resetting high scores Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: செய்தி: * அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக லெக்சிகா வளர்ச்சியை ஆதரிக்கவும் :) அம்சங்கள்: * விளையாட்டின் முடிவில் சொற்களின் பட்டியலை வரிசைப்படுத்துங்கள் (நன்றி சிசெரிடன்ச்மித்) * புதிய ரச்ய அகராதி (நன்றி இல்தார்) * உயர் மாறுபட்ட கருப்பொருள் * டி.டி.சி.க்கு பதிலாக விக்சனரியைப் பயன்படுத்தி ரச்ய சொற்கள் வரையறுக்கப்பட்டுள்ளன * குறைந்தது 45 சொற்களைக் கொண்ட விளையாட்டு பலகைகளை விரும்புங்கள் பிழைத்திருத்தங்கள்: * சில மொழிகளில் தவறாக வடிவமைக்கப்பட்ட பொத்தான்களை சரிசெய்யவும் * அதிக மதிப்பெண்களை மீட்டமைக்கும்போது காணாமல் போன "ரத்துசெய்" விருப்பத்தைச் சேர்க்கவும் தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/10300.txt:1
source: News: * Support Lexica development via GitHub Sponsors :) Features: * Use Wiktionary instead of DuckDuckGo for defintions. This enables language specific definitions, whereas previously only English definitions would work well. Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: செய்தி: * அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக லெக்சிகா வளர்ச்சியை ஆதரிக்கவும் :) அம்சங்கள்: * வரையறைகளுக்கு டக்டகோவுக்கு பதிலாக விக்சனரியைப் பயன்படுத்துங்கள். இது மொழி குறிப்பிட்ட வரையறைகளை செயல்படுத்துகிறது, அதேசமயம் முன்பு ஆங்கில வரையறைகள் மட்டுமே சிறப்பாக செயல்படும். தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/10301.txt:1
source: News: * Support Lexica development via Liberapay or GitHub Sponsors :) Features: * Improved german dictionary (including nouns!!!). Thanks to all those contributing on GitHub to help choose an appropriate wordlist. Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: செய்தி: * லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக லெக்சிகா வளர்ச்சியை ஆதரிக்கவும் :) அம்சங்கள்: * மேம்பட்ட செர்மன் அகராதி (பெயர்ச்சொற்கள் உட்பட !!!). பொருத்தமான சொல் பட்டியலைத் தேர்வுசெய்ய உதவ கிதுபில் பங்களித்த அனைவருக்கும் நன்றி. தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/1100.txt:1
source: Support for international dictionaries! * English (UK) * English (US) * German (DE) * French (FR) * Spanish * Italian * Dutch * Catalan Most of these are still in beta, and will require better quality dictionaries in the future. Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: பன்னாட்டு அகராதிகளுக்கு ஆதரவு! * ஆங்கிலம் (யுகே) * ஆங்கிலம் (எங்களுக்கு) * செர்மன் (டி) * பிரஞ்சு (Fr) * ச்பானிச் * இத்தாலியன் * டச்சு * கற்றலான் இவற்றில் பெரும்பாலானவை இன்னும் பீட்டாவில் உள்ளன, மேலும் எதிர்காலத்தில் சிறந்த தரமான அகராதிகள் தேவைப்படும். தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/1101.txt:1
source: New in 0.11.1: Fix crash when opening game. New in 0.11.0: Support for international dictionaries! * English (UK) * English (US) * German (DE) * French (FR) * Spanish * Italian * Dutch * Catalan Most of these are still in beta, and will require better quality dictionaries in the future. Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: 0.11.1 இல் புதியது: விளையாட்டைத் திறக்கும்போது செயலிழப்பை சரிசெய்யவும். 0.11.0 இல் புதியது: பன்னாட்டு அகராதிகளுக்கான ஆதரவு! * ஆங்கிலம் (யுகே) * ஆங்கிலம் (எங்களுக்கு) * செர்மன் (டி) * பிரஞ்சு (Fr) * ச்பானிச் * இத்தாலியன் * டச்சு * கற்றலான் இவற்றில் பெரும்பாலானவை இன்னும் பீட்டாவில் உள்ளன, மேலும் எதிர்காலத்தில் சிறந்த தரமான அகராதிகள் தேவைப்படும். தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/1102.txt:1
source: New in 0.11.2: * Add Persian dictionary. * Fix "Q is followed by u" bug. New in 0.11.0: Support for international dictionaries! * English (UK) * English (US) * German (DE) * French (FR) * Spanish * Italian * Dutch * Catalan Most of these are still in beta, and will require better quality dictionaries in the future. Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: 0.11.2 இல் புதியது: * பாரசீக அகராதியைச் சேர்க்கவும். * சரிசெய்யவும் "Q ஐத் தொடர்ந்து u" பிழை. 0.11.0 இல் புதியது: பன்னாட்டு அகராதிகளுக்கான ஆதரவு! * ஆங்கிலம் (யுகே) * ஆங்கிலம் (எங்களுக்கு) * செர்மன் (டி) * பிரஞ்சு (Fr) * ச்பானிச் * இத்தாலியன் * டச்சு * கற்றலான் இவற்றில் பெரும்பாலானவை இன்னும் பீட்டாவில் உள்ளன, மேலும் எதிர்காலத்தில் சிறந்த தரமான அகராதிகள் தேவைப்படும். தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/1103.txt:1
source: New in 0.11.3: * Fix crash when using "Letter Points" score type. Uses Scrabble scores for all languages (sort of). Support for international dictionaries! * English (UK) * English (US) * German (DE) * French (FR) * Spanish * Italian * Dutch * Persian * Catalan Most of these are still in beta, and will require better quality dictionaries in the future. Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: 0.11.3 இல் புதியது: * "கடிதம் புள்ளிகள்" மதிப்பெண் வகையைப் பயன்படுத்தும் போது செயலிழப்பை சரிசெய்யவும். அனைத்து மொழிகளுக்கும் ச்கிராப்பிள் மதிப்பெண்களைப் பயன்படுத்துகிறது (வகை). பன்னாட்டு அகராதிகளுக்கு ஆதரவு! * ஆங்கிலம் (யுகே) * ஆங்கிலம் (எங்களுக்கு) * செர்மன் (டி) * பிரஞ்சு (Fr) * ச்பானிச் * இத்தாலியன் * டச்சு * பாரசீக * கற்றலான் இவற்றில் பெரும்பாலானவை இன்னும் பீட்டாவில் உள்ளன, மேலும் எதிர்காலத்தில் சிறந்த தரமான அகராதிகள் தேவைப்படும். தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/1104.txt:1
source: New in 0.11.3: * Added Japanese dictionary (thanks wichmann) * Russian translation (thanks HenriDellal) Support for international dictionaries! * English (UK) * English (US) * German (DE) * French (FR) * Spanish * Italian * Dutch * Persian * Catalan * Japanese Most of these are still in beta, and will require better quality dictionaries in the future. Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: 0.11.3 இல் புதியது: * சப்பானிய அகராதி சேர்க்கப்பட்டது (நன்றி விச்மேன்) * ரச்ய மொழிபெயர்ப்பு (நன்றி என்ரிடெல்லல்) பன்னாட்டு அகராதிகளுக்கு ஆதரவு! * ஆங்கிலம் (யுகே) * ஆங்கிலம் (எங்களுக்கு) * செர்மன் (டி) * பிரஞ்சு (Fr) * ச்பானிச் * இத்தாலியன் * டச்சு * பாரசீக * கற்றலான் * சப்பானியர்கள் இவற்றில் பெரும்பாலானவை இன்னும் பீட்டாவில் உள்ளன, மேலும் எதிர்காலத்தில் சிறந்த தரமான அகராதிகள் தேவைப்படும். தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/1105.txt:1
source: New in 0.11.5: * Added Hungarian dictionary (thanks urbalazs) * Turkish translation (thanks Gran Kardo) * Magyar translation (thanks urbalazs) * Updated translations Support for international dictionaries! * Catalan * Dutch * English (UK) * English (US) * French (FR) * German (DE) * Hungarian * Italian * Japanese * Persian * Spanish * Russian Most of these are still in beta, and will require better quality dictionaries in the future. Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: 0.11.5 இல் புதியது: * அங்கேரிய அகராதி சேர்க்கப்பட்டது (நன்றி அர்பாலாச்) * துருக்கிய மொழிபெயர்ப்பு (நன்றி கிரான் கர்டோ) * மாகியார் மொழிபெயர்ப்பு (நன்றி அர்பாலாச்) * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் பன்னாட்டு அகராதிகளுக்கு ஆதரவு! * கற்றலான் * டச்சு * ஆங்கிலம் (யுகே) * ஆங்கிலம் (எங்களுக்கு) * பிரஞ்சு (Fr) * செர்மன் (டி) * அங்கேரியன் * இத்தாலியன் * சப்பானியர்கள் * பாரசீக * ச்பானிச் * ரச்யன் இவற்றில் பெரும்பாலானவை இன்னும் பீட்டாவில் உள்ளன, மேலும் எதிர்காலத்தில் சிறந்த தரமான அகராதிகள் தேவைப்படும். தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/1200.txt:1
source: New in 0.12.0: * New "Hint Mode", enabled via preferences (thanks vlddeev) * Added Ukranian dictionary (thanks vlddeev) * Magyar translation (thanks urbalazs) * Updated translations Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: 0.12.0 இல் புதியது: * புதிய "குறிப்பு பயன்முறை", விருப்பத்தேர்வுகள் வழியாக இயக்கப்பட்டது (நன்றி VLDDEEV) * உக்ரேனிய அகராதி சேர்க்கப்பட்டது (நன்றி vlddeev) * மாகியார் மொழிபெயர்ப்பு (நன்றி அர்பாலாச்) * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/1201.txt:1
source: New in 0.12.1: * Added Polish dictionary (thanks bzaborow) * Updated translations (thanks to the numerous wonderful translators in the community) Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues.
ta: 0.12.1 இல் புதியது: * போலந்து அகராதி சேர்க்கப்பட்டது (நன்றி Bzaborow) * புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் (சமூகத்தில் ஏராளமான அற்புதமான மொழிபெயர்ப்பாளர்களுக்கு நன்றி) தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues.

# changelogs/20000.txt:1
source: Game Modes! These preferences are replaced with "Game Modes": * Duration * Board size * Min word length * Scoring type * Hint modes You can change game mode from the main screen, or create your own. High scores are based on game mode and lexicon. Please provide any feedback or report any issues on the issue tracker at https://github.com/lexica/lexica/issues. Support Lexica development via Liberapay or GitHub Sponsors :)
ta: விளையாட்டு முறைகள்! இந்த விருப்பத்தேர்வுகள் "விளையாட்டு முறைகள்" மூலம் மாற்றப்படுகின்றன: * காலம் * போர்டு அளவு * மணித்துளி சொல் நீளம் * மதிப்பெண் வகை * குறிப்பு முறைகள் முதன்மையான திரையில் இருந்து நீங்கள் விளையாட்டு பயன்முறையை மாற்றலாம் அல்லது உங்கள் சொந்தத்தை உருவாக்கலாம். அதிக மதிப்பெண்கள் விளையாட்டு முறை மற்றும் அகராதியை அடிப்படையாகக் கொண்டவை. தயவுசெய்து ஏதேனும் பின்னூட்டங்களை வழங்கவும் அல்லது வெளியீடு டிராக்கரில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கவும் https://github.com/lexica/lexica/issues. லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக லெக்சிகா வளர்ச்சியை ஆதரிக்கவும் :)

# changelogs/20001.txt:1
source: Game Modes! These preferences are replaced with "Game Modes": * Duration * Board size * Min word length * Scoring type * Hint modes You can change game mode from the main screen, or create your own. High scores are based on game mode and lexicon. Fixed critical bug in 2.0.0-alpha1 (thanks to all who reported the issue). Please provide feedback/report issues at https://github.com/lexica/lexica/issues. Support Lexica development via Liberapay or GitHub Sponsors :)
ta: விளையாட்டு முறைகள்! இந்த விருப்பத்தேர்வுகள் "விளையாட்டு முறைகள்" மூலம் மாற்றப்படுகின்றன: * காலம் * போர்டு அளவு * மணித்துளி சொல் நீளம் * மதிப்பெண் வகை * குறிப்பு முறைகள் முதன்மையான திரையில் இருந்து நீங்கள் விளையாட்டு பயன்முறையை மாற்றலாம் அல்லது உங்கள் சொந்தத்தை உருவாக்கலாம். அதிக மதிப்பெண்கள் விளையாட்டு முறை மற்றும் அகராதியை அடிப்படையாகக் கொண்டவை. 2.0.0-ஆல்பா 1 இல் நிலையான முக்கியமான பிழை (சிக்கலைப் புகாரளித்த அனைவருக்கும் நன்றி). தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும். லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக லெக்சிகா வளர்ச்சியை ஆதரிக்கவும் :)

# changelogs/20003.txt:1
source: Game Modes! These preferences are replaced with "Game Modes": * Duration * Board size * Min word length * Scoring type * Hint modes You can change game mode from the main screen, or create your own. High scores are based on game mode and lexicon. Fixed critical bug in 2.0.0-alpha2 for French and German locales (thanks to all who reported the issue). Please provide feedback/report issues at https://github.com/lexica/lexica/issues. Support Lexica development via Liberapay or GitHub Sponsors :)
ta: விளையாட்டு முறைகள்! இந்த விருப்பத்தேர்வுகள் "விளையாட்டு முறைகள்" மூலம் மாற்றப்படுகின்றன: * காலம் * போர்டு அளவு * மணித்துளி சொல் நீளம் * மதிப்பெண் வகை * குறிப்பு முறைகள் முதன்மையான திரையில் இருந்து நீங்கள் விளையாட்டு பயன்முறையை மாற்றலாம் அல்லது உங்கள் சொந்தத்தை உருவாக்கலாம். அதிக மதிப்பெண்கள் விளையாட்டு முறை மற்றும் அகராதியை அடிப்படையாகக் கொண்டவை. பிரெஞ்சு மற்றும் செர்மன் இடங்களுக்கு 2.0.0-ஆல்பா 2 இல் நிலையான விமர்சன பிழை (சிக்கலைப் புகாரளித்த அனைவருக்கும் நன்றி). தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும். லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக லெக்சிகா வளர்ச்சியை ஆதரிக்கவும் :)

# changelogs/20004.txt:1
source: Game Modes! You can change game mode from the main screen, or create your own. High scores are based on game mode and lexicon. Fixed in this alpha: * Allow deleting of (custom) game modes via long press. Please provide feedback/report issues at https://github.com/lexica/lexica/issues. Support Lexica development via Liberapay or GitHub Sponsors :)
ta: விளையாட்டு முறைகள்! முதன்மையான திரையில் இருந்து நீங்கள் விளையாட்டு பயன்முறையை மாற்றலாம் அல்லது உங்கள் சொந்தத்தை உருவாக்கலாம். அதிக மதிப்பெண்கள் விளையாட்டு முறை மற்றும் அகராதியை அடிப்படையாகக் கொண்டவை. இந்த ஆல்பாவில் சரி செய்யப்பட்டது: * லாங் பிரச் வழியாக (தனிப்பயன்) விளையாட்டு முறைகளை நீக்க அனுமதிக்கவும். தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும். லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக லெக்சிகா வளர்ச்சியை ஆதரிக்கவும் :)

# changelogs/20005.txt:1
source: High scores! * Previously, only the best score was remembered. * Now all your high scores are recorded, as are all the words you've ever found. * View your best scores by touching the high score on the main menu. Added Danish translation (thanks comradekingu), and updated many other translations (thanks to the wonderful community of translators). Please provide feedback/report issues at https://github.com/lexica/lexica/issues. Support Lexica development via Liberapay or GitHub Sponsors :)
ta: அதிக மதிப்பெண்கள்! * முன்பு, சிறந்த மதிப்பெண் மட்டுமே நினைவில் இருந்தது. * இப்போது உங்கள் அதிக மதிப்பெண்கள் அனைத்தும் பதிவு செய்யப்பட்டுள்ளன, நீங்கள் கண்டறிந்த எல்லா சொற்களும். * முதன்மையான பட்டியலில் அதிக மதிப்பெண்ணைத் தொடுவதன் மூலம் உங்கள் சிறந்த மதிப்பெண்களைக் காண்க. டேனிச் மொழிபெயர்ப்பைச் சேர்த்தது (நன்றி தோழர்), மற்றும் பல மொழிபெயர்ப்புகளைப் புதுப்பித்தது (மொழிபெயர்ப்பாளர்களின் அற்புதமான சமூகத்திற்கு நன்றி). தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும். லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக லெக்சிகா வளர்ச்சியை ஆதரிக்கவும் :)

# changelogs/20006.txt:1
source: Game modes and high scores! * Greatly simplifies the high scores, preferences, and many other aspects of Lexica, while also laying the foundations for future improvements. * You can change game modes from the main screen, or create your own. * High scores are based on game mode and lexicon. * View your best scores by touching the high score on the main menu. Thanks to all who provided feedback on v2.0.0 via GitHub. Support further development via Liberapay or GitHub Sponsors. Please provide feedback/report issues at https://github.com/lexica/lexica/issues.
ta: விளையாட்டு முறைகள் மற்றும் அதிக மதிப்பெண்கள்! * அதிக மதிப்பெண்கள், விருப்பத்தேர்வுகள் மற்றும் லெக்சிகாவின் பல அம்சங்களை பெரிதும் எளிதாக்குகிறது, அதே நேரத்தில் எதிர்கால மேம்பாடுகளுக்கான அடித்தளங்களையும் அமைக்கிறது. * நீங்கள் முதன்மையான திரையில் இருந்து விளையாட்டு முறைகளை மாற்றலாம் அல்லது உங்கள் சொந்தத்தை உருவாக்கலாம். * அதிக மதிப்பெண்கள் விளையாட்டு முறை மற்றும் அகராதியை அடிப்படையாகக் கொண்டவை. * முதன்மையான பட்டியலில் அதிக மதிப்பெண்ணைத் தொடுவதன் மூலம் உங்கள் சிறந்த மதிப்பெண்களைக் காண்க. அறிவிலிமையம் வழியாக V2.0.0 இல் கருத்துக்களை வழங்கிய அனைவருக்கும் நன்றி. லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக மேலும் வளர்ச்சியை ஆதரிக்கவும். தயவுசெய்து கருத்து/அறிக்கை சிக்கல்களை https://github.com/lexica/lexica/issues இல் வழங்கவும்.

# changelogs/20007.txt:1
source: Improved dictionary options for German, French, and Russian German: * Current dictionary renamed to German (Extended) and includes äöü. * New German dictionary replaces these with ae, oe, and ue. French: * Current dictionary renamed to French (Extended) and includes àâçéèêëîïôöûü. * New French dictionary replaces these with a, c, e, i, o, and u. Russian: * Earlier dictionary reinstated as Russian (Extended) containing many more words. * The current (smaller) dictionary remains. Thanks to everyone who provided language specific input. This could not have been done without your help. A truly international effort. Suggestions for your favourite language? Feedback welcome. Support further development via Liberapay or GitHub Sponsors.
ta: செர்மன், பிரஞ்சு மற்றும் ரச்யனுக்கான மேம்பட்ட அகராதி விருப்பங்கள் செர்மன்: . * புதிய செர்மன் அகராதி இவற்றை AE, OE மற்றும் UE உடன் மாற்றுகிறது. பிரஞ்சு: . * புதிய பிரஞ்சு அகராதி இவற்றை A, C, E, I, O மற்றும் உ உடன் மாற்றுகிறது. ரச்ய: * முந்தைய அகராதி இன்னும் பல சொற்களைக் கொண்ட ரச்ய (நீட்டிக்கப்பட்ட) என மீண்டும் நிலைநிறுத்தப்பட்டது. * தற்போதைய (சிறிய) அகராதி உள்ளது. மொழி குறிப்பிட்ட உள்ளீட்டை வழங்கிய அனைவருக்கும் நன்றி. உங்கள் உதவியின்றி இதைச் செய்ய முடியாது. உண்மையான பன்னாட்டு முயற்சி. உங்களுக்கு பிடித்த மொழிக்கான பரிந்துரைகள்? கருத்து வரவேற்பு. லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக மேலும் வளர்ச்சியை ஆதரிக்கவும்.

# changelogs/20008.txt:1
source: Initial support for multiplayer! * One player starts a new multiplayer game. * They share the details using their method of choice (e.g. QR Code, SMS, email, etc). * Each player can then play the same game on their own devices. This is all still quite new, so any feedback on the process is very welcome (though please note this is not intended to be a realtime / network multiplayer yet). Enjoy Lexica? Support further development via Liberapay or GitHub Sponsors.
ta: மல்டிபிளேயருக்கு ஆரம்ப ஆதரவு! * ஒரு வீரர் புதிய மல்டிபிளேயர் விளையாட்டைத் தொடங்குகிறார். * அவர்கள் தேர்வு முறையைப் பயன்படுத்தி விவரங்களை பகிர்ந்து கொள்கிறார்கள் (எ.கா. QR குறியீடு, எச்எம்எச், மின்னஞ்சல் போன்றவை). * ஒவ்வொரு வீரரும் தங்கள் சொந்த சாதனங்களில் ஒரே விளையாட்டை விளையாடலாம். இவை அனைத்தும் இன்னும் புதியவை, எனவே இந்த செயல்முறையைப் பற்றிய எந்தவொரு கருத்தும் மிகவும் வரவேற்கத்தக்கது (இருப்பினும் இது ஒரு நிகழ்நேர / பிணையம் மல்டிபிளேயராக இருக்க விரும்பவில்லை என்பதை நினைவில் கொள்க). லெக்சிகாவை அனுபவிக்கவா? லைபர்பே அல்லது அறிவிலிமையம் ஒப்புரவாளர்கள் வழியாக மேலும் வளர்ச்சியை ஆதரிக்கவும்.
