Repository: 247i/TACETr
Catalog: உரை/தானி/libresudoku-strings-*.po
Languages: ta

# app_name
source: LibreSudoku
ta: லிப்ரேசோகோகு

# nav_bar_statistics
source: Statistics
ta: புள்ளிவிபரம்

# nav_bar_home
source: Home
ta: இல்லம்

# nav_bar_more
source: More
ta: மேலும்

source: New game
ta: புதிய

# dialog_new_game
source: Game in progress
ta: இடையிலுள்ள

# dialog_new_game_text
source: You have an unfinished game, do you really want to start a new one?
ta: நீங்கள் இந்த விளையாட்டை முடிக்காமலேயே புதிய விளையாட்டைத் துவக்க வேண்டுமா?

# dialog_new_game_positive
source: Start new
ta: புதிய துவக்கம்

# action_cancel
source: Cancel
ta: கைவிடு

# action_confirm
source: Yes
ta: ஆம்

# action_play
source: Play
ta: விளையா (ட்)டு

# action_continue
source: Continue
ta: தொடர்க

# action_delete
source: Delete
ta: அழி

# difficulty_unspecified
source: Unspecified
ta: குறிப்பிடாத

# difficulty_simple
source: Simple
ta: எளிய

# difficulty_easy
source: Easy
ta: மிக எளிது

# difficulty_moderate
source: Moderate
ta: நடுத்தரம்

# difficulty_hard
source: Hard
ta: கடினமான

# difficulty_challenge
source: Challenge
ta: சவால்

# difficulty_custom
source: Custom
ta: தனிப்பயன்

# type_default_6x6
source: 6x6
ta: ச்

# type_default_9x9
source: 9x9
ta: காச்மோபோலிச்

# type_killer_9x9
source: Killer 9x9
ta: கில்லர் 9x9

# type_killer_6x6
source: Killer 6x6
ta: கொலையாளி 6x6

# type_killer_12x12
source: Killer 12x12
ta: கில்லர் 12x12

# type_unspecified
source: Unspecified
ta: குறிப்பிடாத

# settings_title
source: Settings
ta: அமைவு

# more_title
source: More
ta: மேலும்

# about_title
source: About
ta: பற்றி

# pref_appearance
source: Appearance
ta: தோற்றம்

# pref_dark_theme
source: Dark theme
ta: இருள் வடிவு

# pref_dark_theme_follow
source: Follow system
ta: முன்னமைவு வடிவு

# pref_dark_theme_off
source: Off
ta: அணை

# pref_dark_theme_on
source: On
ta: இயக்கு

# pref_board_font_size
source: Board font size
ta: எழுத்துரு அளவு

# pref_board_font_size_small
source: Small
ta: சிறிய

# pref_board_font_size_medium
source: Medium
ta: நடுத்தரம்

# pref_board_font_size_large
source: Large
ta: பெரிய

# pref_input
source: Input method
ta: உள்ளீடு முறை

# pref_input_cell_first
source: Cell first
ta: அறை முதலில்

# pref_input_digit_first
source: Value first
ta: எண் முதலில்

# pref_delete_stats
source: Clear all statistics
ta: புள்ளிவிபரம் அழி

# pref_delete_stats_summ
source: This action will delete all your statistics, saved games and records. It can't be undone
ta: அனைத்து புள்ளிவிபரங்களும் அழிக்கப்படும். இதை மீட்டமைக்க முடியாது

# action_deleted
source: Deleted
ta: அழிக்கப்பட்டது

# pref_app_theme
source: App theme
ta: செயலி வடிவு

# theme_dynamic
source: Dynamic
ta: மாறும் வகை

# theme_green
source: Green
ta: பச்சை

# theme_peach
source: Peach
ta: அடர் மஞ்சள்

# theme_yellow
source: Yellow
ta: மஞ்சள்

# theme_lavender
source: Lavender
ta: கத்தரி

# theme_black_and_white
source: Black and white
ta: கறுப்பு வெள்ளை

# pref_pure_black
source: Pure black dark theme
ta: மொத்த கறுப்பு இருள்வடிவு

# pref_gameplay
source: Gameplay
ta: விளையாட்டு

# pref_mistakes_limit
source: Mistakes limit
ta: தவறுகள் வரம்பு

# pref_mistakes_limit_summ
source: 3 mistakes and you're done
ta: 3 தவறுகள் மட்டும் அனுமதி

# pref_disable_hints
source: Disable hints
ta: உதவி வசதி அணை

# pref_disable_hints_summ
source: Don't like hints? Just remove them!
ta: உதவி தேவை இல்லையெனில் நீக்கி விடலாம்!

# pref_show_timer
source: Show timer
ta: நேரங்காட்டி காட்டு

# pref_reset_timer
source: Reset the timer on game reset
ta: விளையாட்டு மீட்டமைத்தால் நேரங்காட்டியும் மீட்டமை

# pref_assistance
source: Assistance
ta: உதவி

# pref_mistakes_check
source: Mistakes checking
ta: தவறுகள் சரிபார்த்தல்

# pref_mistakes_check_off
source: Off
ta: அணை

# pref_mistakes_check_violations
source: Rules violations
ta: விதி மீறல்கள்

# pref_mistakes_check_final
source: With final solution
ta: இறுதித் தீர்வுடன் ஒப்பு நோக்கு

# pref_highlight_identical
source: Highlight identical values
ta: ஒரே எண்ணை மேற்காட்டு

# pref_highlight_identical_summ
source: Selection of a value on the board highlights cells with the same value
ta: ஓர் எண்ணைத் தேர்ந்தெடுக்கையில் அதே எண்ணை மேற்காட்டும்

# pref_remaining_uses
source: Remaining uses
ta: மீதமுள்ள பயன்பாடுகள்

# pref_remaining_uses_summ
source: The number of remaining uses of a value is displayed on the keyboard
ta: ஓர் எண்ணின் மீதமுள்ள பயன்பாடுகள் காட்டப்படும்

# pref_position_lines
source: Position lines
ta: இட வரிகள்

# pref_position_lines_summ
source: The row and column of the selected cell are highlighted
ta: தேர்ந்தெடுக்கப்பட்ட நிரல் மற்றும் நிரை மேற்காட்டப்படும்

# pref_auto_erase_notes
source: Auto erase notes
ta: குறிப்புகள் தாமாகவே அகற்ற

# pref_other
source: Other
ta: மற்ற

# pref_keep_screen_on
source: Keep screen awake
ta: திரையை அணைக்காமல் வைத்திடு

# pref_reset_tipcards
source: Reset all tip cards
ta: அனைத்து உதவி அட்டைகளும் மீட்டமை

# pref_tipcards_reset
source: Tip cards was reset!
ta: உதவி அட்டைகள் மீட்டமைக்கப்பட்டன!

# pref_app_language
source: App language
ta: செயலி மொழி

# label_default
source: Default
ta: இயல்புநிலை

# about_version
source: Version
ta: பதிப்பு

# about_github_project
source: GitHub
ta: கிரப்

# about_github_source_code
source: Source code on GitHub
ta: கிதுபில் மூலக் குறியீடு

# action_give_up
source: Give up
ta: கைவிடு

# action_reset_game
source: Reset the game
ta: விளையாட்டு மீட்டமை

# dialog_yes
source: Yes
ta: ஆம்

# dialog_no
source: No
ta: இல்லை

# action_show_notes
source: Show notes
ta: குறிப்புகள் காட்டு

# action_clear_notes
source: Clear notes
ta: குறிப்புகள் நீக்கு

# action_compute_notes
source: Compute notes
ta: குறிப்புகள் கணக்கிடு

# action_show_solution
source: Show solution
ta: தீர்வு காட்டு

# action_show_mine_sudoku
source: Show mine
ta: என்னுடையது காட்டு

# onboard_title
source: Welcome
ta: நல்வரவு

# intro_what_is_sudoku
source: A classic sudoku looks as follows
ta: ஒரு மரபு சுடோகு கீழ்க்கண்டவாறு இருக்கும்

# intro_rules
source: The goal of the game is to fill all the cells with numbers from 1 to 9. So that the values do not repeat in any column, row or smaller box (3x3)
ta: ஒவ்வொரு கட்டத்திலும் 1 முதல் 9 வரை எண்களை இந்த விளையாட்டில் நிரப்ப வேண்டும். அவ்வாறு நிரப்பும் போது நிரலிலோ, நிரையிலோ அல்லது உள்ளிருக்கும் 3x3 சிற்றறையிலோ எந்த எண்ணும் மீண்டும் ஒருமுறை வரக்கூடாது.

# onboard_recommendation_prefs
source: We recommend that you have a look at the settings tab so that you can customize the application for your needs
ta: அமைப்புகள் தாவலைப் பார்க்க வேண்டும் என்று நாங்கள் பரிந்துரைக்கிறோம், இதன் மூலம் உங்கள் தேவைகளுக்கான பயன்பாட்டைத் தனிப்பயனாக்கலாம்

# action_start
source: Start
ta: தொடங்கு

# toolbar_undo_description
source: Undo. Just undo
ta: செயல்தவிர்க்கவும். செயல்தவிர்க்கவும்

# toolbar_notes_description
source: Activates the note mode (pencil marks)
ta: குறிப்பு பயன்முறையை செயல்படுத்துகிறது (பென்சில் மதிப்பெண்கள்)

# toolbar_hint_description
source: Inserts the correct value in the selected cell. Can be disabled in settings
ta: தேர்ந்தெடுக்கப்பட்ட கலத்தில் சரியான மதிப்பை செருகும். அமைப்புகளில் முடக்கப்படலாம்

# toolbar_erase_description
source: Removes a value or all notes from the selected cell
ta: தேர்ந்தெடுக்கப்பட்ட கலத்திலிருந்து ஒரு மதிப்பு அல்லது அனைத்து குறிப்புகளையும் நீக்குகிறது

# first_game_dialog_title
source: Quick tour
ta: விரைவான சுற்றுப்பயணம்

# first_game_dialog_got_it
source: Got it
ta: கிடைத்தது

# action_exit
source: Exit
ta: வெளியேறு

# action_stay
source: Stay
ta: தங்க

# mistakes_number_out_of
source: Mistakes %1$d/%2$d
ta: தவறுகள் %1$d/ %2$d

# reset_game_text
source: Want to reset the current puzzle?
ta: தற்போதைய புதிரை மீட்டமைக்க விரும்புகிறீர்களா?

# give_up_text
source: Do you want to give up? If you give up, you will be able to see the final solution
ta: நீங்கள் கைவிட விரும்புகிறீர்களா? நீங்கள் கைவிட்டால், நீங்கள் இறுதி தீர்வைக் காண முடியும்

source: Game completed
ta: விளையாட்டு முடிந்தது

# game_completed_text
source: You have completed the game. You can stay or return to the main menu
ta: நீங்கள் விளையாட்டை முடித்துவிட்டீர்கள். நீங்கள் தங்கலாம் அல்லது முதன்மையான மெனுவுக்கு திரும்பலாம்

source: Game over
ta: விளையாட்டு ஓவர்

# game_over_mistakes
source: You have made 3 mistakes
ta: நீங்கள் 3 தவறுகளைச் செய்துள்ளீர்கள்

# dialog_generating
source: Generating…
ta: உருவாக்குதல்…

# dialog_solving
source: Solving…
ta: தீர்க்கும்…

source: Statistics
ta: புள்ளிவிவரங்கள்

source: Games started
ta: விளையாட்டுகள் தொடங்கின

source: Games completed
ta: விளையாட்டுகள் முடிந்தது

source: Win rate
ta: செய் விகிதம்

source: Win streak
ta: செய் ச்ட்ரீக்

source: Current streak
ta: தற்போதைய ச்ட்ரீக்

source: Best streak
ta: சிறந்த ச்ட்ரீக்

# number_best_games
source: %1$d best games
ta: %1$d சிறந்த விளையாட்டுகள்

source: Games
ta: விளையாட்டுகள்

source: Time
ta: நேரம்

# delete_question
source: Delete?
ta: நீக்கவா?

# delete_record_dialog
source: Do you want to delete the #%1$d record? It can't be undone
ta: #%1$d பதிவை நீக்க விரும்புகிறீர்களா? அதை செயல்தவிர்க்க முடியாது

# statistics_difficulty_filter_all
source: All
ta: அனைத்தும்

source: Average time
ta: சராசரி நேரம்

source: Best time
ta: சிறந்த நேரம்

# tip_card_win_streak_summ
source: A win streak will be reset if you lose (reach the mistakes limit), give up, or start a new game without finishing the previous one, so be careful
ta: நீங்கள் இழந்தால் (தவறுகளின் வரம்பை அடையலாம்), கைவிடுங்கள் அல்லது முந்தையதை முடிக்காமல் புதிய விளையாட்டைத் தொடங்கினால் ஒரு செய் ச்ட்ரீக் மீட்டமைக்கப்படும், எனவே கவனமாக இருங்கள்

# tip_card_records_list_title
source: List of records
ta: பதிவுகளின் பட்டியல்

# tip_card_records_list_summ
source: This list contains up to 5 of your best records. You can delete a record that you don't like with a long press on the entry
ta: இந்த பட்டியலில் உங்கள் சிறந்த பதிவுகளில் 5 வரை உள்ளது. உள்ளீட்டில் நீண்ட பத்திரிகையுடன் நீங்கள் விரும்பாத ஒரு பதிவை நீக்கலாம்

# statistics_no_records
source: You have no records yet
ta: உங்களிடம் இன்னும் பதிவுகள் இல்லை

# history_title
source: History
ta: வரலாறு

# history_no_games
source: You haven't played yet
ta: நீங்கள் இன்னும் விளையாடவில்லை

# history_item_time
source: Time: %1$s
ta: நேரம்: %1$s

# history_item_id
source: Game ID: %1$d
ta: விளையாட்டு ஐடி: %1$d

# history_item_can_continue
source: You can continue this game
ta: இந்த விளையாட்டை நீங்கள் தொடரலாம்

# saved_game_screen_title
source: Game #%1$d
ta: விளையாட்டு #%1$d

# saved_game_current
source: Current
ta: மின்னோட்ட்ம், ஓட்டம்

# saved_game_initial
source: Initial
ta: தொடக்க

# saved_game_progress
source: Progress %1$d/%2$d
ta: முன்னேற்றம் %1$d/ %2$d

# saved_game_progress_percentage
source: Progress %1$d%%
ta: முன்னேற்றம்%1$d %%

# empty_screen_something_went_wrong
source: Oops, something went wrong…
ta: அச்சச்சோ, ஏதோ தவறு நடந்தது…

# saved_game_difficulty
source: Difficulty: %1$s
ta: சிரமம்: %1$s

# saved_game_type
source: Type: %1$s
ta: வகை: %1$s

# saved_game_time
source: Time: %1$s
ta: நேரம்: %1$s

# saved_game_completed
source: The game was completed
ta: விளையாட்டு முடிந்தது

# saved_game_give_up
source: You gave up
ta: நீங்கள் கைவிட்டீர்கள்

# saved_game_in_progress
source: In progress
ta: முன்னேற்றத்தில் உள்ளது

# saved_game_mistakes_limit
source: Mistakes limit exceeded
ta: தவறுகள் மீறியது

# learn_screen_title
source: Learn
ta: அறிக

# learn_tab_sudoku
source: Sudoku
ta: சுடோகு

# learn_tab_app
source: App
ta: பயன்பாடு

# learn_app_toolbar
source: Toolbar
ta: கருவிப்பட்டி

# learn_app_toolbar_desc
source: A panel under the keyboard
ta: விசைப்பலகையின் கீழ் ஒரு குழு

# learn_app_toolbar_notes_menu
source: You can press and hold the Notes button to open the Notes menu, where you can clear or compute notes and toggle their visibility
ta: குறிப்புகள் மெனுவைத் திறக்க நீங்கள் குறிப்புகள் பொத்தானை அழுத்திப் பிடிக்கலாம், அங்கு நீங்கள் குறிப்புகளை அழிக்கலாம் அல்லது கணக்கிடலாம் மற்றும் அவற்றின் தெரிவுநிலையை மாற்றலாம்

# learn_sudoku_rules
source: Sudoku rules
ta: சுடோகு விதிகள்

# sudoku_rules_mistakes
source: There is a mistake here, can you spot it? Maybe even two
ta: இங்கே ஒரு தவறு உள்ளது, அதை நீங்கள் கண்டுபிடிக்க முடியுமா? ஒருவேளை இரண்டு கூட

# sudoku_rules_mistakes_highlight
source: Highlight mistakes
ta: தவறுகளை முன்னிலைப்படுத்தவும்

# sudoku_rules_mistakes_explanation
source: The first mistake is two 2s in the sixth box. Remember the rule that there can't be double values in a box? The second mistake is the number 6 in row 2, column 8 (R2C8), because there is already a 6 in that column (R5C8)
ta: முதல் தவறு ஆறாவது பெட்டியில் இரண்டு 2 கள். ஒரு பெட்டியில் இரட்டை மதிப்புகள் இருக்க முடியாது என்ற விதி நினைவில் இருக்கிறதா? இரண்டாவது தவறு வரிசை 2, நெடுவரிசை 8 (R2C8) இல் உள்ள 6 வது எண், ஏனெனில் அந்த நெடுவரிசையில் ஏற்கனவே 6 உள்ளது (R5C8)

# naked_pairs_title
source: Naked pairs
ta: நிர்வாண சோடிகள்

# naked_pairs_explanation
source: There are two cells that share the same two pencil marks. Right now, we can't tell which one is the 2 and which one is the 3. But since the Sudoku rules tell us that each box can have only one 2 and only one 3, we can assume that one of them is the 2 and the other is the 3
ta: ஒரே இரண்டு பென்சில் மதிப்பெண்களைப் பகிர்ந்து கொள்ளும் இரண்டு செல்கள் உள்ளன. இப்போது, ​​எது 2 மற்றும் எது 3 என்று சொல்ல முடியாது. ஆனால் ஒவ்வொரு பெட்டியிலும் ஒரே 2 மற்றும் ஒரு 3 மட்டுமே இருக்க முடியும் என்று சுடோகு விதிகள் நமக்குச் சொல்வதால், அவற்றில் ஒன்று 2 என்றும் மற்றொன்று 3 என்றும் நாம் கருதலாம்

# naked_pairs_end
source: Now, this wouldn't help us if there weren't any other 2 or 3 pencil marks in that box. But since there are, we can remove them! The other cells in the box cannot be 2 or 3
ta: இப்போது, ​​அந்த பெட்டியில் வேறு 2 அல்லது 3 பென்சில் மதிப்பெண்கள் இல்லாவிட்டால் இது எங்களுக்கு உதவாது. ஆனால் இருப்பதால், அவற்றை நாம் அகற்றலாம்! பெட்டியில் உள்ள மற்ற செல்கள் 2 அல்லது 3 ஆக இருக்கக்கூடாது

# learn_basic_title
source: Basic
ta: அடிப்படை

# learn_basic_1
source: Let's select box number 7. There are already four cells filled
ta: பெட்டி எண் 7 ஐத் தேர்ந்தெடுப்போம். ஏற்கனவே நான்கு செல்கள் நிரப்பப்பட்டுள்ளன

# learn_basic_2
source: Now let's take a look at the number 8. The number 8 in row 4, column 3 (R4C3) blocks the entire column in our box. So the number 8 can't stand there
ta: இப்போது 8 வது எண்ணைப் பார்ப்போம். வரிசை 4, நெடுவரிசை 3 (R4C3) எங்கள் பெட்டியில் உள்ள முழு நெடுவரிசையையும் தடுக்கிறது. எனவே 8 எண் அங்கு நிற்க முடியாது

# learn_basic_3
source: Also, the number 8 in R7C5 blocks the entire row in our box
ta: மேலும், R7C5 இல் உள்ள எண் 8 எங்கள் பெட்டியில் முழு வரிசையையும் தடுக்கிறது

# learn_basic_4
source: And we are left with only one cell in which the number 8 can stand
ta: எண் 8 எண் நிற்கக்கூடிய ஒரே ஒரு கலத்தை நாம் கொண்டிருக்கிறோம்

# learn_basic_5
source: The same logic applies to rows and columns. Look at the first row. The number 4 in R7C3 blocks the third column in our row. The number 4 in R3C5 blocks two columns at once (4 and 6), because there can be no other fours in the same box. R6C7 blocks column 7
ta: அதே வழக்கு வரிசைகள் மற்றும் நெடுவரிசைகளுக்கும் பொருந்தும். முதல் வரிசையைப் பாருங்கள். R7C3 இல் உள்ள எண் 4 எங்கள் வரிசையில் மூன்றாவது நெடுவரிசையைத் தடுக்கிறது. R3C5 இல் உள்ள எண் 4 ஒரே நேரத்தில் (4 மற்றும் 6) இரண்டு நெடுவரிசைகளைத் தடுக்கிறது, ஏனென்றால் ஒரே பெட்டியில் வேறு பவுண்டரிகள் இருக்க முடியாது. R6C7 பிளாக்ச் நெடுவரிசை 7

# learn_basic_6
source: As a result, we are left with only one cell that can contain the number 4. This is cell R1C3
ta: இதன் விளைவாக, எண் 4 ஐக் கொண்டிருக்கக்கூடிய ஒரே ஒரு செல் மட்டுமே நம்மிடம் உள்ளது. இது செல் R1C3

# learn_hidden_pairs_title
source: Hidden pairs
ta: மறைக்கப்பட்ட சோடிகள்

# learn_hidden_pairs_1
source: Hidden pairs are almost the same as naked pairs, the only difference being that they are hidden among the others. These two cells have something in common, they can hold the numbers 6 and 9, and these are the only two squares here where they can stand on
ta: மறைக்கப்பட்ட சோடிகள் நிர்வாண சோடிகளைப் போலவே இருக்கின்றன, ஒரே வேறுபாடு என்னவென்றால், அவை மற்றவர்களிடையே மறைக்கப்படுகின்றன. இந்த இரண்டு உயிரணுக்களும் பொதுவான ஒன்றைக் கொண்டுள்ளன, அவை 6 மற்றும் 9 எண்களை வைத்திருக்க முடியும், மேலும் இவை இங்கு இரண்டு சதுரங்கள் மட்டுமே நிற்க முடியும்

# learn_hidden_pairs_2
source: You can conclude that these two cells contain only these two numbers and not the others. So you can remove unnecessary markers from these cells. As with naked pairs, this works the same way with columns and rows
ta: இந்த இரண்டு கலங்களும் இந்த இரண்டு எண்களை மட்டுமே கொண்டிருக்கின்றன, மற்றவை அல்ல என்று நீங்கள் முடிவு செய்யலாம். எனவே இந்த கலங்களிலிருந்து தேவையற்ற குறிப்பான்களை அகற்றலாம். நிர்வாண சோடிகளைப் போலவே, இது நெடுவரிசைகள் மற்றும் வரிசைகளுடன் அதே வழியில் செயல்படுகிறது

# page_previous
source: Previous
ta: முந்தைய

# page_next
source: Next
ta: அடுத்தது

# libraries_licenses
source: Licenses
ta: உரிமங்கள்

# libraries_licenses_title
source: Open Source Licenses
ta: திறந்த மூல உரிமங்கள்

# can_continue_label
source: Can continue
ta: தொடரலாம்

# custom_sudoku_title
source: Custom sudoku
ta: தனிப்பயன் சுடோகு

# create_sudoku_title
source: Create a sudoku
ta: ஒரு சுடோகு உருவாக்கவும்

# create_set_from_string
source: Set from a string
ta: ஒரு சரத்திலிருந்து அமைக்கவும்

# dialog_ok
source: OK
ta: சரி

# action_save
source: Save
ta: சேமி

# create_from_string_text
source: Enter a puzzle in string form. Empty cells are indicated by a . or a 0
ta: சரம் வடிவத்தில் ஒரு புதிரை உள்ளிடவும். வெற்று செல்கள் a ஆல் குறிக்கப்படுகின்றன. அல்லது ஒரு 0

# create_from_string_hint
source: Puzzle
ta: புதிர்

# create_incorrect_puzzle
source: Incorrect puzzle
ta: தவறான புதிர்

# multiple_solution_text
source: This puzzle has more than one solution. The correct sudoku puzzle must have a unique solution
ta: இந்த புதிர் ஒன்றுக்கு மேற்பட்ட தீர்வுகளைக் கொண்டுள்ளது. சரியான சுடோகு புதிர் ஒரு தனித்துவமான தீர்வைக் கொண்டிருக்க வேண்டும்

# no_solution_text
source: This puzzle has no solutions
ta: இந்த புதிருக்கு எந்த தீர்வுகளும் இல்லை

# create_import_set
source: Set
ta: கணம்

# custom_sudoku_no_added
source: You haven't added any sudokus yet
ta: நீங்கள் இதுவரை எந்த சுடோகசையும் சேர்க்கவில்லை

# custom_sudoku_delete_dialog_title
source: Delete selected
ta: தேர்ந்தெடுக்கப்பட்டதை நீக்கு

# custom_sudoku_delete_dialog_text
source: Are you sure you want to delete the selected sudokus? This action cannot be undone
ta: தேர்ந்தெடுக்கப்பட்ட சுடோகசை நீக்க விரும்புகிறீர்களா? இந்த செயலை செயல்தவிர்க்க முடியாது

# game_not_started
source: Not started
ta: தொடங்கப்படவில்லை

# export_string_text
source: Select text from the text field or simply click the copy button
ta: உரை புலத்திலிருந்து உரையைத் தேர்ந்தெடுக்கவும் அல்லது நகல் பொத்தானைக் சொடுக்கு செய்யவும்

# export_string_title
source: Export as string
ta: சரம் என ஏற்றுமதி

# export_string_copy
source: Copy
ta: நகலெடு

# export_string_state_copied
source: Copied
ta: நகலெடுக்கப்பட்டது

# export_string_state_error
source: Error
ta: பிழை

# filter_all
source: All
ta: அனைத்தும்

# filter_completed
source: Completed
ta: முடிந்தது

# filter_in_progress
source: In progress
ta: முன்னேற்றத்தில் உள்ளது

# filter_not_started
source: Not started
ta: தொடங்கப்படவில்லை

# sort_ascending
source: Ascending
ta: ஏறுதல்

# sort_descending
source: Descending
ta: இறங்கு

# sort_by_timer
source: Timer
ta: நேரங்குறிகருவி

# sort_by_game_id
source: ID
ta: ஐடி

# sort_label
source: Sort
ta: வரிசைப்படுத்து

# filter_label
source: Filter
ta: வடிப்பி

source: Weblate
ta: வலைபெயர்ப்பு

source: Help translate
ta: மொழிபெயர்க்க உதவுங்கள்

# title_folders
source: Folders
ta: கோப்புறைகள்

# create_folder
source: Create a folder
ta: ஒரு கோப்புறையை உருவாக்கவும்

# delete_folder
source: Delete a folder
ta: ஒரு கோப்புறையை நீக்கு

# folder_name
source: Folder: %1$s
ta: கோப்புறை: %1$s

# number_puzzles_to_import
source: %1$d puzzle to import
ta: இறக்குமதி செய்ய %1 $ புதிர்

# puzzles_in_folder
source: %1$d puzzle
ta: %1$d புதிர்

source: Edit name
ta: பெயரைத் திருத்து

source: Export
ta: ஏற்றுமதி

# create_folder_name
source: Folder name
ta: கோப்புறை பெயர்

# folder_import
source: Import
ta: இறக்குமதி

# dialog_delete_folder_text
source: Folder named %1$s will be deleted
ta: %1$s என பெயரிடப்பட்ட கோப்புறை நீக்கப்படும்

source: Help
ta: உதவி

# folders_help
source: Here you can manage your folder and import sudoku from a file
ta: இங்கே நீங்கள் உங்கள் கோப்புறையை நிர்வகிக்கலாம் மற்றும் ஒரு கோப்பிலிருந்து சுடோகு இறக்குமதி செய்யலாம்

# folder_import_supported_types
source: The following file types are supported: .sdm (or .txt with the same structure) .opensudoku .1gsudoku
ta: பின்வரும் கோப்பு வகைகள் ஆதரிக்கப்படுகின்றன: .sdm (அல்லது .txt அதே கட்டமைப்பைக் கொண்டது) .பென்சுடோகு .1GSudoku

# import_from_file_fail
source: Failed to import
ta: இறக்குமதி செய்யத் தவறிவிட்டது

# import_from_file_title
source: From a file
ta: ஒரு கோப்பிலிருந்து

# import_saving
source: Saving
ta: சேமிப்பு

# action_edit
source: Edit
ta: தொகு

# folder_empty_label
source: This folder is empty
ta: இந்த கோப்புறை காலியாக உள்ளது

# dialog_delete_selected
source: Delete selected
ta: தேர்ந்தெடுக்கப்பட்டதை நீக்கு

# explore_folder_add_sudoku
source: Add sudoku
ta: சுடோகு சேர்

source: Edit sudoku
ta: சுடோகு திருத்து

# delete_selected_in_folder
source: Are you sure you want to delete %1$d game?
ta: %1$d விளையாட்டை நீக்க விரும்புகிறீர்களா?

# game_id
source: Game #%1$d
ta: விளையாட்டு #%1$d

source: Add to folder
ta: கோப்புறையில் சேர்க்கவும்

# add_to_folder_create_new
source: Create new
ta: புதியதை உருவாக்கவும்

# add_to_folder_from_file
source: Import from a file
ta: ஒரு கோப்பிலிருந்து இறக்குமதி செய்யுங்கள்

# last_played_section_title
source: Recently played games
ta: அண்மைக் காலத்தில் விளையாடியது

# pref_boardtheme_accent
source: Apply accent colors
ta: உச்சரிப்பு வண்ணங்களைப் பயன்படுத்துங்கள்

# pref_boardtheme_accent_subtitle
source: Make your sudoku board more colorful
ta: உங்கள் சுடோகு போர்டை மேலும் வண்ணமயமாக்குங்கள்

# pref_board_theme_title
source: Sudoku board theme
ta: சுடோகு போர்டு கருப்பொருள்

# pref_board_theme_subtitle
source: Customize the look of the sudoku board
ta: சுடோகு வாரியத்தின் தோற்றத்தைத் தனிப்பயனாக்குங்கள்

# board_theme_title
source: Board theme
ta: போர்டு கருப்பொருள்

# action_move_selected
source: Move selected
ta: தேர்ந்தெடுக்கப்பட்ட நகர்வு

# move_games_to_folder_subtitle
source: Select the folder to which you want to move the selected games
ta: தேர்ந்தெடுக்கப்பட்ட விளையாட்டுகளை நகர்த்த விரும்பும் கோப்புறையைத் தேர்ந்தெடுக்கவும்

# pref_cross_highlight_subtitle
source: Highlight some boxes on the board
ta: பலகையில் சில பெட்டிகளை முன்னிலைப்படுத்தவும்

# pref_cross_highlight
source: Cross highlight
ta: குறுக்கு சிறப்பம்சமாக

# dialog_crash_report_text
source: Oops, LibreSudoku just crashed. Do you want to send a crash report to the developers?
ta: அச்சச்சோ, லிப்ரெசுடோகு இப்போது செயலிழந்தது. டெவலப்பர்களுக்கு விபத்து அறிக்கையை அனுப்ப விரும்புகிறீர்களா?

# pref_crash_reporting
source: Crash reporting
ta: செயலிழப்பு அறிக்கை

# pref_crash_reporting_subtitle
source: Help us fix bugs. App doesn't send logs by itself, you will be prompted to send a crash report by email
ta: பிழைகளை சரிசெய்ய எங்களுக்கு உதவுங்கள். பயன்பாடு பதிவுகளை தானே அனுப்பாது, மின்னஞ்சல் மூலம் செயலிழப்பு அறிக்கையை அனுப்பும்படி கேட்கப்படுவீர்கள்

# pref_fun_keyboard_over_num
source: Function panel over the values
ta: மதிப்புகள் மீது செயல்பாட்டு குழு

# pref_fun_keyboard_over_num_subtitle
source: Place the function panel above the values keyboard
ta: மதிப்புகள் விசைப்பலகைக்கு மேலே செயல்பாட்டு பேனலை வைக்கவும்

# pref_date_format
source: Date format
ta: தேதி வடிவம்

# pref_save_last_diff_and_type
source: Remember type and difficulty
ta: வகை மற்றும் சிரமத்தை நினைவில் கொள்ளுங்கள்

# pref_save_last_diff_and_type_subtitle
source: Remember the last game's type and difficulty
ta: கடைசி விளையாட்டின் வகை மற்றும் சிரமத்தை நினைவில் கொள்ளுங்கள்

# hints_used
source: Hints: %1$d
ta: குறிப்புகள்: %1$d

# mistakes_made
source: Mistakes: %1$d
ta: தவறுகள்: %1$d

# notes_taken
source: Notes: %1$d
ta: குறிப்புகள்: %1$d

# stat_time_current
source: Current: %1$s
ta: நடப்பு: %1$s

# stat_time_average
source: Avg.: %1$s
ta: ஏ.வி.சி.: %1$s
