Repository: 247i/TACETr
Catalog: உரை/தானி/libretube-libretube-*.po
Languages: ta

# queue_insert_related_videos
source: Insert related videos
ta: தொடர்புடைய வீடியோக்களைச் செருகவும்

source: Autoplay playlists
ta: ஆட்டோபிளே பிளேலிச்ட்கள்

# autoplay_playlists_summary
source: Automatically play next video in playlists regardless of selected autoplay setting
ta: தேர்ந்தெடுக்கப்பட்ட ஆட்டோபிளே அமைப்பைப் பொருட்படுத்தாமல் தானாகவே பிளேலிச்ட்களில் அடுத்த வீடியோவை இயக்கவும்

source: Local playlists
ta: உள்ளக பிளேலிச்ட்கள்

source: Brightness
ta: ஒளி

source: Volume
ta: தொகுதி

source: Auto
ta: தானி

source: Swipe controls
ta: கட்டுப்பாடுகள் ச்வைப்

# swipe_controls_summary
source: Swipe to adjust the brightness and volume while in fullscreen mode
ta: முழுத்திரை பயன்முறையில் இருக்கும்போது பிரகாசத்தையும் அளவையும் சரிசெய்ய ச்வைப்

source: Pinch control
ta: கிள்ளுதல் கட்டுப்பாடு

# pinch_control_summary
source: Use pinch gesture to zoom in/out
ta: /வெளியே பெரிதாக்க பிஞ்ச் சைகை பயன்படுத்தவும்

source: Defaults
ta: இயல்புநிலை

# comments_disabled
source: Comments are disabled by the uploader.
ta: பதிவேற்றியவரால் கருத்துகள் முடக்கப்படுகின்றன.

# no_comments_available
source: This video has no comments.
ta: இந்த வீடியோவில் எந்தக் கருத்தும் இல்லை.

# theme_monochrome
source: Minimalistic Monochrome
ta: குறைந்தபட்ச மோனோக்ரோம்

source: Captions size
ta: தலைப்புகளின் அளவு

# double_tap_seek
source: Double tap to seek
ta: தேட இரட்டை தட்டு

# double_tap_seek_summary
source: Tap twice at the left or right to rewind or forward the player position
ta: பிளேயர் நிலையை முன்னாடி அல்லது அனுப்ப இடது அல்லது வலதுபுறத்தில் இரண்டு முறை தட்டவும்

# all_caught_up
source: You're all caught up
ta: நீங்கள் அனைவரும் பிடிபட்டீர்கள்

# all_caught_up_summary
source: You've seen all new videos
ta: எல்லா புதிய வீடியோக்களையும் நீங்கள் பார்த்தீர்கள்

source: Import playlists
ta: பிளேலிச்ட்களை இறக்குமதி செய்யுங்கள்

source: Export playlists
ta: பிளேலிச்ட்கள் ஏற்றுமதி

source: Export playlist
ta: ஏற்றுமதி பிளேலிச்ட்

source: Import watch history
ta: கண்காணிப்பு வரலாற்றை இறக்குமதி செய்யுங்கள்

# import_watch_history_desc
source: Please note that not everything will be imported due to YouTube's limited export data.
ta: யூடியூப்பின் வரையறுக்கப்பட்ட ஏற்றுமதி தரவு காரணமாக அனைத்தும் இறக்குமதி செய்யப்படாது என்பதை நினைவில் கொள்க.

source: App Backup
ta: பயன்பாட்டு காப்புப்பிரதி

# backup_restore_summary
source: Import & export subscriptions, playlists, …
ta: இறக்குமதி மற்றும் ஏற்றுமதி சந்தாக்கள், பிளேலிச்ட்கள்,…

# exportsuccess
source: Exported.
ta: ஏற்றுமதி.

source: Privacy alert
ta: தனியுரிமை எச்சரிக்கை

# username_email
source: Using an email address as a username isn’t recommended. Proceed anyway?
ta: மின்னஞ்சல் முகவரியை பயனர்பெயராகப் பயன்படுத்துவது பரிந்துரைக்கப்படவில்லை. எப்படியும் தொடரவா?

source: Proceed
ta: தொடரவும்

source: Play latest videos
ta: அண்மைக் கால வீடியோக்களை இயக்கவும்

source: Nothing selected!
ta: எதுவும் தேர்ந்தெடுக்கப்படவில்லை!

# color_violet
source: Versatile Violet
ta: பல்துறை வயலட்

# failed_fetching_instances
source: Could not fetch available instances.
ta: கிடைக்கக்கூடிய நிகழ்வுகளைப் பெற முடியவில்லை.

# hide_watched_from_feed
source: Hide already watched videos
ta: ஏற்கனவே பார்த்த வீடியோக்களை மறைக்கவும்

source: Playlist URL
ta: பிளேலிச்ட் முகவரி

source: Shuffle
ta: கலக்கு

source: Add to bookmarks
ta: புக்மார்க்குகளில் சேர்க்கவும்

source: Remove bookmark
ta: புத்தகக்குறியை அகற்று

source: Rewind
ta: முன்னாடி

source: Forward
ta: முன்னோக்கி

source: Alternative PiP controls
ta: மாற்று குழாய் கட்டுப்பாடுகள்

# alternative_pip_controls_summary
source: Show audio only and skip controls in PiP instead of forward and rewind
ta: ஆடியோவை மட்டும் காண்பி, முன்னோக்கி மற்றும் முன்னாடி வைப்பதற்கு பதிலாக PIP இல் கட்டுப்பாடுகளைத் தவிர்க்கவும்

source: Audio only mode
ta: ஆடியோ மட்டும் பயன்முறை

# audio_only_mode_summary
source: Turn LibreTube into a music player
ta: லிப்ரெட்யூப்பை ஒரு மியூசிக் பிளேயராக மாற்றவும்

source: Sleep timer
ta: தூக்க நேரங்குறிகருவி

source: Skip silence
ta: ம .னத்தைத் தவிர்க்கவும்

source: Help
ta: உதவி

source: FAQ
ta: கேள்விகள்

# codecs
source: Video codecs
ta: வீடியோ கோடெக்குகள்

source: Audio codecs
ta: ஆடியோ கோடெக்குகள்

source: Mark as watched
ta: பார்த்தபடி குறி

# custom_playback_speed
source: Custom speed
ta: தனிப்பயன் விரைவு

# custom_playback_speed_summary
source: Use a different playback speed than for the normal player
ta: சாதாரண பிளேயரை விட வேறு பின்னணி வேகத்தைப் பயன்படுத்தவும்

source: Category
ta: வகை

source: Stats for nerds
ta: மேதாவிகளுக்கான புள்ளிவிவரங்கள்

source: Video ID
ta: வீடியோ ஐடி

# copy_tooltip
source: Copy
ta: நகலெடு

source: Autoplay countdown
ta: ஆட்டோபிளே கவுண்டவுன்

# autoplay_countdown_summary
source: Show a 5s countdown before auto-playing the next video
ta: அடுத்த வீடியோவை தானாக விளையாடுவதற்கு முன் 5 எச் கவுண்ட்டவுனைக் காட்டு

# playing_next
source: Playing next in %1$s
ta: %1$s இல் அடுத்து விளையாடுவது

# lbry_hls_summary
source: Use LBRY HLS for streaming if available
ta: கிடைத்தால் ச்ட்ரீமிங்கிற்கு LBRY HLS ஐப் பயன்படுத்தவும்

source: Proxy
ta: பதிலாள்

# disable_proxy
source: Disable Piped proxy
ta: குழாய் ப்ராக்சியை முடக்கவும்

# disable_proxy_summary
source: Load videos and images directly from YouTube's servers. Only enable the option if you always use a VPN
ta: YouTube இன் சேவையகங்களிலிருந்து நேரடியாக வீடியோக்களையும் படங்களையும் ஏற்றவும். நீங்கள் எப்போதும் VPN ஐப் பயன்படுத்தினால் மட்டுமே விருப்பத்தை இயக்கவும்

# auto_fullscreen_shorts
source: Auto fullscreen on short videos
ta: குறுகிய வீடியோக்களில் ஆட்டோ முழுத்திரை

source: Channel groups
ta: சேனல் குழுக்கள்

# new_group
source: New
ta: புதிய

source: Group name
ta: குழு பெயர்

# group_name_error_empty
source: Please enter a name
ta: தயவுசெய்து ஒரு பெயரை உள்ளிடவும்

# group_name_error_exists
source: Please choose a name that is unique
ta: தனித்துவமான பெயரைத் தேர்வுசெய்க

source: Play automatically
ta: தானாக விளையாடுங்கள்

# play_automatically_summary
source: Start playing video automatically when selecting
ta: தேர்ந்தெடுக்கும்போது தானாக வீடியோவை இயக்கத் தொடங்குங்கள்

# fullscreen_gestures
source: Enter/exit fullscreen gestures
ta: முழுத்திரை சைகைகளை உள்ளிடவும்/வெளியேறவும்

source: Go to video
ta: வீடியோவுக்குச் செல்லுங்கள்

source: Duration
ta: காலம்

source: Duration (reversed)
ta: காலம் (தலைகீழ்)

# shorts_notifications
source: Notifications for shorts
ta: குறும்படங்களுக்கான அறிவிப்புகள்

source: Creation date
ta: உருவாக்கும் தேதி

source: Creation date (reversed)
ta: உருவாக்கும் தேதி (தலைகீழ்)

source: Alphabetic
ta: அகரவரிசை

source: Alphabetic (reversed)
ta: அகரவரிசை (தலைகீழ்)

# welcome
source: Welcome to LibreTube
ta: லிப்ரெட்யூப்பிற்கு வருக

# choose_instance
source: Please choose an instance first!
ta: முதலில் ஒரு நிகழ்வைத் தேர்வுசெய்க!

# choose_instance_long
source: Please choose a Piped instance to use from below. The Piped instance will act as the middleman between you and YouTube. These instances are located at different physical locations - indicated by their country flag(s). Instances physically closer to you are likely faster than instances that are not. You can change the instance you use in the settings at any time.
ta: கீழே இருந்து பயன்படுத்த ஒரு குழாய் நிகழ்வைத் தேர்வுசெய்க. குழாய் நிகழ்வு உங்களுக்கும் யூடியூப்பிற்கும் இடையில் இடைத்தரகராக செயல்படும். இந்த நிகழ்வுகள் வெவ்வேறு உடல் இடங்களில் அமைந்துள்ளன - அவற்றின் நாட்டின் கொடி (கள்) மூலம் குறிக்கப்படுகிறது. இல்லாத நிகழ்வுகளை விட உடல் ரீதியாக உங்களுக்கு நெருக்கமான நிகழ்வுகள் வேகமாக இருக்கும். எந்த நேரத்திலும் நீங்கள் அமைப்புகளில் பயன்படுத்தும் நிகழ்வை மாற்றலாம்.

source: Mark as unwatched
ta: குறிக்கப்படாத எனக் குறிக்கவும்

source: Change playlist description
ta: பிளேலிச்ட் விளக்கத்தை மாற்றவும்

source: Playlist description
ta: பிளேலிச்ட் விளக்கம்

# emptyPlaylistDescription
source: The playlist description can't be empty
ta: பிளேலிச்ட் விளக்கம் காலியாக இருக்க முடியாது

source: Off
ta: அணை

source: Manual
ta: கையேடு

source: Automatic
ta: தானியங்கி

source: Automatic once
ta: ஒரு முறை தானியங்கி

# visible
source: Show in seek bar
ta: சீக் பட்டியில் காட்டு

# fallback_piped_proxy
source: Fallback to Piped proxy
ta: குழாய் பதிக்கப்பட்ட ப்ராக்சிக்கு குறைவு

# fallback_piped_proxy_summary
source: Load videos via the proxy if connecting to YouTube directly doesn't work for the current video (increases the initial loading times). If disabled, YouTube music content likely won't play due to YT restrictions
ta: தற்போதைய வீடியோவுக்கு யூடியூப்போடு நேரடியாக வேலை செய்யாவிட்டால் (ஆரம்ப ஏற்றுதல் நேரங்களை அதிகரிக்கிறது) பதிலாள் வழியாக வீடியோக்களை ஏற்றவும். முடக்கப்பட்டால், YouTube இசை உள்ளடக்கம் YT கட்டுப்பாடுகள் காரணமாக இயங்காது

# dearrow
source: Enable DeArrow
ta: அன்பே இயக்கு

# dearrow_summary
source: Show more accurate and less sensationalist titles and thumbnails. Increases loading times
ta: மிகவும் துல்லியமான மற்றும் குறைவான பரபரப்பான தலைப்புகள் மற்றும் சிறுபடங்களைக் காட்டுங்கள். ஏற்றுதல் நேரங்களை அதிகரிக்கிறது

source: Contribute to DeArrow
ta: அன்புக்கு பங்களிப்பு செய்யுங்கள்

source: Title
ta: தலைப்பு

source: Thumbnail time
ta: சிறு நேரம்

source: Visibility
ta: விழிமை

# visibility_public
source: Public
ta: பொது

# visibility_unlisted
source: Unlisted
ta: பட்டியலிடப்படாதது

source: Sort by
ta: வரிசைப்படுத்தவும்

source: Uploader name
ta: பதிவேற்றும் பெயர்

# duration_span
source: Duration: %1$s
ta: காலம்: %1$s

source: Remove watched videos
ta: பார்த்த வீடியோக்களை அகற்று

source: No-Fullscreen resolution
ta: முழு திரை தீர்மானம் இல்லை

source: Same as fullscreen
ta: முழுத்திரை அதே

# playback_during_call
source: Continue playback during phone call
ta: தொலைபேசி அழைப்பின் போது பிளேபேக்கைத் தொடரவும்

# playback_during_call_summary
source: Note that this also affects the app to not handle any kind of audio focus anymore
ta: எந்தவொரு ஆடியோ கவனத்தையும் கையாளக்கூடாது என்பதற்கான பயன்பாட்டையும் இது பாதிக்கிறது என்பதை நினைவில் கொள்க

source: Segment submitted
ta: பிரிவு சமர்ப்பிக்கப்பட்டது

source: Vote for segment
ta: பிரிவுக்கு வாக்களிக்கவும்

# upvote
source: Up
ta: மேலே

# downvote
source: Down
ta: கீழே

source: Undo
ta: செயல்தவிர்

source: Segment
ta: பிரிவு

source: Download playlist
ta: பிளேலிச்ட்டைப் பதிவிறக்கவும்

# download_playlist_note
source: Please select the maximum audio/video quality to download. Captions will only be downloaded if available.
ta: பதிவிறக்க அதிகபட்ச ஆடியோ/வீடியோ தரத்தைத் தேர்ந்தெடுக்கவும். கிடைத்தால் மட்டுமே தலைப்புகள் பதிவிறக்கம் செய்யப்படும்.

# enqueue_playlist_description
source: Shows a notification when enqueueing videos of a playlist to be downloaded.
ta: ஒரு பிளேலிச்ட்டின் வீடியோக்களை பதிவிறக்கம் செய்யும்போது அறிவிப்பைக் காட்டுகிறது.

# enqueueing_playlist_download
source: Enqueueing videos to download of playlist %1$s
ta: பிளேலிச்ட்டை பதிவிறக்கம் செய்ய வீடியோக்களை enqueueing %1$s

source: Audio language
ta: ஆடியோ மொழி

# default_language
source: Default
ta: இயல்புநிலை

source: Behavior when minimized
ta: குறைக்கும்போது நடத்தை

source: External player
ta: வெளிப்புற பிளேயர்

source: Screenshot
ta: திரைக்காட்சி

source: Crashlog
ta: ரெட்லாக்

source: Import subscriptions from
ta: இருந்து சந்தாக்களை இறக்குமதி செய்யுங்கள்

source: Export subscriptions to
ta: ஏற்றுமதி சந்தாக்கள்

source: Import playlists from
ta: இருந்து பிளேலிச்ட்களை இறக்குமதி செய்யுங்கள்

source: Export playlists to
ta: பிளேலிச்ட்களை ஏற்றுமதி செய்யுங்கள்

# import_format_piped
source: Piped
ta: குழாய்

# import_format_newpipe
source: NewPipe
ta: நியூபைப்

# import_format_freetube
source: FreeTube
ta: ஃப்ரீட்யூப்

# import_format_list_of_urls
source: List of URLs or video IDs
ta: முகவரி கள் அல்லது வீடியோ ஐடிகளின் பட்டியல்

source: Home tab content
ta: முகப்பு தாவல் உள்ளடக்கம்

source: Show search suggestions
ta: தேடல் பரிந்துரைகளைக் காட்டு

source: Unknown audio language
ta: தெரியாத ஆடியோ மொழி

source: Unknown audio track type
ta: அறியப்படாத ஆடியோ டிராக் வகை

# original_or_main_audio_track
source: original or main
ta: அசல் அல்லது முதன்மையான

# dubbed_audio_track
source: dubbed
ta: டப்பிங்

# descriptive_audio_track
source: descriptive
ta: விளக்கமான

# default_or_unknown_audio_track
source: default or unknown
ta: இயல்புநிலை அல்லது தெரியவில்லை

source: unknown or no audio
ta: தெரியாத அல்லது ஆடியோ இல்லை

source: Continue watching
ta: தொடர்ந்து பார்த்துக் கொள்ளுங்கள்

source: No chapter
ta: அத்தியாயம் இல்லை

source: Screen orientation
ta: திரை நோக்குநிலை

source: auto-generated
ta: தானாக உருவாக்கிய

# resolution_limited
source: limited
ta: வரையறுக்கப்பட்ட

source: Registration disabled
ta: பதிவு முடக்கப்பட்டது

# sb_create_segment
source: Create segment
ta: பிரிவை உருவாக்கவும்

source: Segment type
ta: பிரிவு வகை

# sb_invalid_segment
source: Invalid segment start or end
ta: தவறான பிரிவு தொடக்க அல்லது முடிவு

source: Contribute to SponsorBlock
ta: ஒப்புரவாளர் பிளாக் பங்களிப்பு

source: SponsorBlock UserID
ta: ஒப்புரவாளர் பிளாக் USERID

source: Filename too long!
ta: கோப்பு பெயர் மிக நீண்டது!

source: Remember playback speed
ta: பிளேபேக் வேகத்தை நினைவில் கொள்ளுங்கள்

# successfully_removed_from_playlist
source: Successfully removed "%1$s" from the playlist.
ta: பிளேலிச்ட்டிலிருந்து "%1$s" ஐ வெற்றிகரமாக அகற்றியது.

source: Watched
ta: பார்த்தேன்

# no_segments_found
source: There are no segments for this video yet.
ta: இந்த வீடியோவுக்கு இன்னும் பிரிவுகள் எதுவும் இல்லை.

source: Start sleep timer
ta: தூக்க டைமரைத் தொடங்குங்கள்

source: Disable sleep timer
ta: தூக்க டைமரை முடக்கு

source: Time in minutes
ta: நிமிடங்களில் நேரம்

source: Invalid input
ta: தவறான உள்ளீடு

source: Add to group
ta: குழுவில் சேர்க்கவும்

# uptime
source: %.2f%% uptime
ta: %.2f %% இயக்க நேரம்

source: Change
ta: மாற்றம்

source: Gestures
ta: சைகைகள்

source: External download provider
ta: வெளிப்புற பதிவிறக்க வழங்குநர்

# external_download_provider_summary
source: Enter the package name of the app you want to use for downloading videos. Leave blank to use LibreTube's inbuilt downloader.
ta: வீடியோக்களைப் பதிவிறக்க நீங்கள் பயன்படுத்த விரும்பும் பயன்பாட்டின் தொகுப்பு பெயரை உள்ளிடவும். லிப்ரெட்யூப்பின் உள்ளடிக்கிய பதிவிறக்கத்தைப் பயன்படுத்த காலியாக விடவும்.

source: Local stream extraction
ta: உள்ளக ச்ட்ரீம் பிரித்தெடுத்தல்

# local_stream_extraction_summary
source: Directly fetch video playback information from YouTube without using Piped.
ta: குழாய் பயன்படுத்தாமல் YouTube இலிருந்து வீடியோ பிளேபேக் தகவல்களை நேரடியாகப் பெறுங்கள்.

# local_ryd
source: Local Return Youtube Dislike extractor
ta: உள்ளக வருவாய் யூடியூப் பிரித்தெடுத்தல் விரும்பவில்லை

# local_ryd_summary
source: Directly fetch dislike information from https://returnyoutubedislikeapi.com
ta: Https://returnyoutubedislikeapi.com இலிருந்து வெறுப்புணர்வை நேரடியாகப் பெறுங்கள்

# dialog_play_offline_title
source: A local version of this video is available.
ta: இந்த வீடியோவின் உள்ளக பதிப்பு கிடைக்கிறது.

# dialog_play_offline_body
source: Would you like to play the video from the download folder?
ta: பதிவிறக்க கோப்புறையிலிருந்து வீடியோவை இயக்க விரும்புகிறீர்களா?

# view_count
source: %1$s views
ta: %1$s காட்சிகள்

# delete_only_watched_videos
source: Only delete already watched videos
ta: ஏற்கனவே பார்த்த வீடியோக்களை நீக்கு மட்டுமே

source: Local feed extraction
ta: உள்ளக தீவன பிரித்தெடுத்தல்

# local_feed_extraction_summary
source: Directly fetch the feed from YouTube. This may be significantly slower.
ta: YouTube இலிருந்து நேரடியாக ஊட்டத்தைப் பெறுங்கள். இது கணிசமாக மெதுவாக இருக்கலாம்.

# download_channel_name
source: Download Service
ta: சேவையைப் பதிவிறக்கவும்

# download_channel_description
source: Shows a notification when downloading media.
ta: மீடியாவைப் பதிவிறக்கும்போது அறிவிப்பைக் காட்டுகிறது.

# push_channel_name
source: Notification Worker
ta: அறிவிப்பு தொழிலாளி

# push_channel_description
source: Shows a notification when new streams are available.
ta: புதிய ச்ட்ரீம்கள் கிடைக்கும்போது அறிவிப்பைக் காட்டுகிறது.

source: Unlimited search history
ta: வரம்பற்ற தேடல் வரலாறு

# chapters_videoHighlight
source: Video Highlight
ta: வீடியோ சிறப்பம்சமாக

# player_channel_name
source: Player Service
ta: வீரர் பணி

# player_channel_description
source: Shows a notification when playing
ta: விளையாடும்போது அறிவிப்பைக் காட்டுகிறது

# years_ago
source: %d year ago
ta: %d ஆண்டுக்கு முன்பு

# months_ago
source: %d month ago
ta: %d மாதத்திற்கு முன்பு

# channel_new_streams
source: %d new stream
ta: %d புதிய ச்ட்ரீம்

# tooltip_repeat
source: Repeat
ta: மீண்டும்

# tooltip_reverse
source: Reverse
ta: தலைகீழ்

# tooltip_sort
source: Sort
ta: வரிசைப்படுத்து

# tooltip_watch_position
source: Watch position
ta: வாட்ச் நிலை

# tooltip_clear_queue
source: Clear queue
ta: தெளிவான வரிசை

# tooltip_dismiss
source: Dismiss
ta: தள்ளுபடி

# tooltip_locked
source: Lock player
ta: பூட்டு பிளேயர்

# tooltip_unlocked
source: Unlock player
ta: பிளேயரைத் திறக்கவும்

# tooltip_sponsorblock
source: Toggle SponsorBlock
ta: ஒப்புரவாளர் பிளாக் மாற்று

# tooltip_options
source: Options
ta: விருப்பங்கள்

# tooltip_minimize
source: Minimize
ta: குறைக்கவும்

# tooltip_fullscreen
source: Fullscreen
ta: முழு திரை

# tooltip_close
source: Close
ta: மூடு

# tooltip_play
source: Play
ta: விளையாடுங்கள்

# tooltip_filter
source: Filter
ta: வடிப்பி

# tooltip_edit_groups
source: Edit groups
ta: குழுக்களைத் திருத்து

# tooltip_create_playlist
source: Create playlist
ta: பிளேலிச்ட்டை உருவாக்கவும்

# tooltip_scroll_to_top
source: Scroll to top
ta: மேலே உருட்டவும்

source: Also clear watch positions
ta: தெளிவான கடிகார நிலைகளும்

# import_temp_playlist
source: Import temporary playlist?
ta: தற்காலிக பிளேலிச்ட்டை இறக்குமதி செய்யவா?

# import_temp_playlist_summary
source: Do you want to create a new playlist named '%1$s'? The playlist will contain %2$d videos.
ta: '%1$s' என்ற புதிய பிளேலிச்ட்டை உருவாக்க விரும்புகிறீர்களா? பிளேலிச்ட்டில் %2$d வீடியோக்கள் இருக்கும்.
