Repository: 247i/TACETr
Catalog: உரை/தானி/libretorrent-app-strings-*.po
Languages: ta

# pref_journal_save_log_to
source: Save log to…
ta: பதிவைச் சேமிக்கவும்…

# pref_journal_max_stored_entries
source: Maximum stored journal entries
ta: அதிகபட்சமாக சேமிக்கப்பட்ட பத்திரிகை உள்ளீடுகள்

# pref_header_appearance
source: Appearance
ta: தோற்றம்

# pref_header_behavior
source: Behavior
ta: நடத்தை

# pref_header_storage
source: Storage
ta: சேமிப்பு

# pref_header_limitations
source: Limitations
ta: வரம்புகள்

# pref_header_network
source: Network
ta: வலைப்பின்னல்

# pref_header_scheduling
source: Scheduling
ta: திட்டமிடல்

# pref_header_feed
source: RSS
ta: ஆர்எஸ்எஸ்

# pref_header_streaming
source: Streaming
ta: ஸ்ட்ரீமிங்

# pref_save_torrents_in_title
source: Save torrents in…
ta: டொரெண்டை சேமிக்கவும்…

# pref_move_after_download_title
source: Move after download
ta: பதிவிறக்கக்குப் பிறகு நகர்த்தவும்

# pref_move_after_download_in_title
source: Move after download in
ta: பதிவிறக்க பிறகு நகர்த்து

# pref_save_torrent_files_title
source: Save .torrent files
ta: .Torrent கோப்புகளை சேமி

# pref_save_torrent_files_summary
source: Save .torrent files when downloading starts.
ta: பதிவிறக்கும்போது .torrent கோப்புகளைச் சேமிக்கவும்.

# pref_save_torrent_files_in_title
source: Save .torrent files in…
ta: .Torrent கோப்புகளைச் சேமிக்கவும்…

# pref_watch_dir_title
source: Watch directory
ta: பாருங்கள் அடைவு

# pref_watch_dir_summary
source: .torrent files in this folder are auto-added and then deleted.
ta: இந்த கோப்புறையில் உள்ள டோரண்ட் கோப்புகள் தானாக கூட்டப்பட்டவை, பின்னர் நீக்கப்படும்.

# pref_dir_to_watch_title
source: Directory to watch
ta: பார்க்க கோப்பகம்

# pref_watch_dir_delete_file_title
source: Delete .torrent file after adding
ta: சேர்த்தபின் . torrent கோப்பை நீக்கு

# pref_posix_disk_io_title
source: POSIX Disk I/O
ta: POSIX வட்டு I/O.

# pref_posix_disk_io_summary
source: Note: this option only to use in particular situations, like support for some SD card filesystems. Enables a simple POSIX Disk I/O, used for systems that do not have a 64-bit virtual address space or do not support memory mapped files.
ta: குறிப்பு: சில எச்டி அட்டை கோப்பு முறைமைகளுக்கான உதவி போன்ற குறிப்பிட்ட சூழ்நிலைகளில் மட்டுமே பயன்படுத்த இந்த விருப்பம். 64-பிட் மெய்நிகர் முகவரி இடம் இல்லாத அல்லது நினைவக மேப் செய்யப்பட்ட கோப்புகளை ஆதரிக்காத அமைப்புகளுக்குப் பயன்படுத்தப்படும் எளிய POSIX வட்டு I/O ஐ இயக்குகிறது.

# pref_speed_category
source: Speed
ta: வேகம்

# pref_max_download_speed_title
source: Max. ⬇ speed
ta: அதிகபட்ச ⬇ வேகம்

# pref_max_upload_speed_title
source: Max. ⬆ speed
ta: அதிகபட்ச ⬆ வேகம்

# pref_max_connections_title
source: Max. number of connections
ta: அதிகபட்சம். இணைப்புகளின் எண்ணிக்கை

# pref_max_connections_summary
source: (Min. 2 connections.)
ta: (நிமிடம் 2 இணைப்புகள்.)

# pref_torrent_queueing_category
source: Torrent queueing
ta: டோண்ட் வரிசை

# pref_max_active_uploads_title
source: Max. number of active uploads
ta: அதிகபட்சம். செயலில் பதிவேற்றங்களின் எண்ணிக்கை

# pref_max_active_downloads_title
source: Max. number of active downloads
ta: அதிகபட்சம். செயலில் உள்ள பதிவிறக்கங்களின் எண்ணிக்கை

# pref_max_active_torrents_title
source: Max. number of active torrents
ta: அதிகபட்சம். செயலில் உள்ள டொரண்டுகளின் எண்ணிக்கை

# pref_max_connections_per_torrent_title
source: Max. number of connections per torrent
ta: அதிகபட்சம். ஒரு டொரண்டிற்கு இணைப்புகளின் எண்ணிக்கை

# pref_max_connections_per_torrent_summary
source: (Min. 2 connections.)
ta: (நிமிடம் 2 இணைப்புகள்.)

# pref_max_uploads_per_torrent_title
source: Max. number of upload slots per torrent
ta: அதிகபட்சம். டொரண்டிற்கு பதிவேற்றும் இடங்களின் எண்ணிக்கை

# pref_auto_manage_title
source: Auto-manage
ta: ஆட்டோ-மேனேச்

# pref_enable_auto_manage_title
source: Enable auto-manage
ta: ஆட்டோ-மேனேசை இயக்கவும்

# pref_auto_manage_summary
source: The torrent may be auto-resumed or paused at any point. (May slow down the pausing/resuming.)
ta: டொரண்ட் எந்த நேரத்திலும் தானாக மீட்கப்படலாம் அல்லது இடைநிறுத்தப்படலாம். (இடைநிறுத்தம்/மீண்டும் தொடங்குவதை மெதுவாக்கலாம்.)

# pref_max_active_uploads_downloads_dialog_msg
source: -1 without limit
ta: -1 வரம்பு இல்லாமல்

# pref_theme_category
source: Theme settings
ta: தீம் அமைப்புகள்

# pref_theme_title
source: Theme
ta: தீம்

# pref_theme_dynamic_colors_title
source: Dynamic colors
ta: மாறும் வண்ணங்கள்

# pref_theme_dynamic_colors_summary
source: Theme colors are adjusted based on your system settings, wallpapers or selected color
ta: உங்கள் கணினி அமைப்புகள், வால்பேப்பர்கள் அல்லது தேர்ந்தெடுக்கப்பட்ட வண்ணத்தின் அடிப்படையில் கருப்பொருள் வண்ணங்கள் சரிசெய்யப்படுகின்றன

# pref_theme_entries_0
source: Light
ta: ஒளி

# pref_theme_entries_1
source: Dark
ta: டார்க்

# pref_theme_entries_2
source: Black
ta: பிளாக்

# pref_theme_entries_3
source: System
ta: மண்டலம்

# pref_notification_category
source: Notification settings
ta: அறிவிப்பு அமைப்புகள்

# pref_torrent_finish_notify_title
source: Torrent finish notification
ta: டொரண்ட் முடிப்பு அறிவிப்பு

# pref_torrent_finish_notify_summary
source: Show notification when a torrent is downloaded.
ta: ஒரு டாரண்ட் பதிவிறக்கி முடிந்ததும் அறிவிப்பைக் காட்டு

# pref_play_sound_notify_title
source: Play sound
ta: ஒலி விளையாட

# pref_notify_sound_title
source: Notification sound
ta: அறிவிப்பு ஒலி

# pref_led_indicator_notify_title
source: LED indicator
ta: LED காட்டி

# pref_led_indicator_color_notify_title
source: LED indicator color
ta: LED காட்டி வண்ணம்

# pref_vibration_notify_title
source: Vibration
ta: அதிர்வு

# pref_foreground_notification_category
source: Foreground notification settings
ta: முன் அறிவிப்பு அமைப்புகள்

# pref_foreground_notify_status_filter
source: Status filter
ta: நிலை வடிகட்டி

# pref_foreground_notify_status_filter_entries_0
source: All
ta: அனைத்தும்

# pref_foreground_notify_status_filter_entries_1
source: Downloading…
ta: பதிவிறக்குகிறது…

# pref_foreground_notify_status_filter_entries_2
source: Downloaded
ta: பதிவு செய்யப்பட்டது

# pref_foreground_notify_status_filter_entries_3
source: Downloading metadata…
ta: மெட்டாடேட்டாவை பதிவிறக்குகிறது…

# pref_foreground_notify_status_filter_entries_4
source: Error
ta: பிழை

# pref_foreground_notify_sorting
source: Sorting
ta: வரிசைப்படுத்துகிறது

# pref_foreground_notify_sorting_entries_0
source: Name (A - Z)
ta: பெயர் (அ - ஔ )

# pref_foreground_notify_sorting_entries_1
source: Name (Z - A)
ta: பெயர் (ஔ -அ)

# pref_foreground_notify_sorting_entries_2
source: Date added (newest first)
ta: சேர்த்த தேதி (புதியது முதலில்)

# pref_foreground_notify_sorting_entries_3
source: Date added (oldest first)
ta: சேர்த்த தேதி (பழயது முதலில்)

# pref_foreground_notify_sorting_entries_4
source: Size (smallest first)
ta: அளவு (சிறியது முதலில்)

# pref_foreground_notify_sorting_entries_5
source: Size (greatest first)
ta: அளவு (பெரியது முதலில்)

# pref_foreground_notify_sorting_entries_6
source: Progress (smallest first)
ta: முன்னேற்றம் (சிறியது முதலில்)

# pref_foreground_notify_sorting_entries_7
source: Progress (greatest first)
ta: முன்னேற்றம் (பெரியது முதலில்)

# pref_foreground_notify_sorting_entries_8
source: ETA (smallest first)
ta: நேரம் (சிறியது முதலில்)

# pref_foreground_notify_sorting_entries_9
source: ETA (greatest first)
ta: நேரம் (பெரியது முதலில்)

# pref_foreground_notify_sorting_entries_10
source: Popularity (smallest first)
ta: பிரபலம் (சிறியது முதலில்)

# pref_foreground_notify_sorting_entries_11
source: Popularity (greatest first)
ta: பிரபலம் (பெரியது முதலில்)

# pref_foreground_notify_sorting_entries_12
source: No sorting
ta: வரிசைப்படுத்துதல் இல்லை

# pref_foreground_notify_combined_pause_button_title
source: Combined pause button
ta: ஒன்று சேர்த்து நிறுத்தும் பொத்தான்

# pref_foreground_notify_combined_pause_button_summary
source: Combines two buttons: pause all and resume all. The button will work like a switcher. Warning: the button state is not affected by manual pause/resume of the torrent.
ta: இரண்டு பொத்தான்களை ஒருங்கிணைக்கிறது: அனைத்தையும் இடைநிறுத்தி, அனைத்தையும் மீண்டும் தொடங்குங்கள். பொத்தான் ஒரு ச்விட்சர் போல வேலை செய்யும். எச்சரிக்கை: டொரண்டின் கையேடு இடைநிறுத்தம்/விண்ணப்பம் மூலம் பொத்தான் நிலை பாதிக்கப்படாது.

# pref_autostart_title
source: Auto-start
ta: ஆட்டோ-ச்டார்ட்

# pref_autostart_summary
source: Run the app upon starting the device.
ta: சாதனம் ஆன் செய்தவுடன் செயலியை தொடங்கவும்.

# pref_umnetered_connections_only_title
source: Only unmetered connections
ta: அளவிடப்படாத இணைப்புகள் மட்டுமே

# pref_umnetered_connections_only_summary
source: Only use connections without a quota (for example Wi-Fi or Ethernet).
ta: ஒதுக்கீடு இல்லாமல் மட்டுமே இணைப்புகளைப் பயன்படுத்துங்கள் (எடுத்துக்காட்டாக வைஃபை அல்லது ஈதர்நெட்).

# pref_enable_roaming_title
source: Roaming
ta: ரோமிங்

# pref_enable_roaming_summary
source: Only download if the device isn't roaming.
ta: சாதனம் ரோமிங் செய்யாவிட்டால் மட்டுமே பதிவிறக்கவும்.

# pref_power_management_category
source: Power management
ta: மின் மேலாண்மை

# pref_keep_alive_title
source: Keep running
ta: இயக்கிக்கொண்டே இரு

# pref_keep_alive_summary
source: Leaves the app running in the background. (Still respects closing the app when all downloads finish.)
ta: பயன்பாட்டை பின்னணியில் இயங்கும். (எல்லா பதிவிறக்கங்களும் முடிந்ததும் பயன்பாட்டை மூடுவதை இன்னும் மதிக்கிறது.)

# pref_shutdown_downloads_complete_title
source: Close after finishing all downloads
ta: எல்லா பதிவிறக்கங்களையும் முடித்த பிறகு மூடு

# pref_shutdown_downloads_complete_summary
source: Turns off the app when everything is downloaded.
ta: எல்லாம் பதிவிறக்கம் செய்யும்போது பயன்பாட்டை முடக்குகிறது.

# pref_cpu_do_not_sleep_title
source: Keep device awake
ta: சாதனத்தை விழித்திருங்கள்

# pref_cpu_do_not_sleep_summary
source: Use if the download speed reduces when the screen turns off. (Increases battery usage.)
ta: திரை அணைக்கப்படும் போது பதிவிறக்க விரைவு குறைக்கப்பட்டால் பயன்படுத்தவும். (பேட்டரி பயன்பாட்டை அதிகரிக்கிறது.)

# pref_download_and_upload_only_when_charging_title
source: Only download and upload when charging.
ta: சார்ச் செய்யும் போது மட்டுமே பதிவிறக்கம் செய்து பதிவேற்றவும்.

# pref_download_and_upload_only_when_charging_summary
source: No files are transferred unless the device is charging. (Pauses all torrents when not connected to a charger.)
ta: சாதனம் சார்ச் செய்யாவிட்டால் கோப்புகள் எதுவும் மாற்றப்படாது. (சார்சருடன் இணைக்கப்படாதபோது அனைத்து டொரண்டுகளையும் இடைநிறுத்துகிறது.)

# pref_battery_control_title
source: Battery control
ta: பேட்டரி கட்டுப்பாடு

# pref_custom_battery_control_title
source: Custom battery percentage
ta: விருப்ப பேட்டரி சதவீதம்

# pref_custom_battery_control_value_title
source: Battery control percentage
ta: பேட்டரி கட்டுப்பாடு சதவீதம்

# pref_battery_control_summary
source: Pauses all torrents if the battery level goes below %1$d%%. (The limit doesn't apply when charging.)
ta: பேட்டரி நிலை%1$d %% க்குக் கீழே சென்றால் அனைத்து டொரண்டுகளையும் இடைநிறுத்துகிறது. (கட்டணம் வசூலிக்கும்போது வரம்பு பொருந்தாது.)

# pref_custom_battery_control_summary
source: Set a battery %% to pause downloads at. (Ignores the default %1$d%%.)
ta: பதிவிறக்கங்களை இடைநிறுத்த பேட்டரி %% அமைக்கவும். (இயல்புநிலை%1$d %% ஐ புறக்கணிக்கிறது.)

# pref_custom_battery_control_dialog_summary
source: Really set a battery %% to look out for? (Increases battery use while downloading.)
ta: கவனிக்க ஒரு பேட்டரி %% உண்மையில் அமைக்கவா? (பதிவிறக்கும் போது பேட்டரி பயன்பாட்டை அதிகரிக்கிறது.)

# pref_default_trackers_list_title
source: Default trackers
ta: இயல்புநிலை சுவடுகள்

# pref_default_trackers_list_summary
source: Trackers list, that used in the following cases: 1. When adding a torrent, the default list is automatically added to the torrent list. 2. Used for fetching magnet links.
ta: டிராக்கர்ச் பட்டியல், பின்வரும் நிகழ்வுகளில் பயன்படுத்தப்படுகிறது: 1. ஒரு நீரோட்டத்தைச் சேர்க்கும்போது, இயல்புநிலை பட்டியல் தானாக டொரண்ட் பட்டியலில் சேர்க்கப்படும். 2. காந்த இணைப்புகளைப் பெற பயன்படுகிறது.

# pref_proxy_settings_title
source: Proxy settings
ta: பதிலாள் அமைப்புகள்

# pref_enable_dht_summary
source: Allows finding others without a tracker. (Increases battery usage.)
ta: டிராக்கர் இல்லாமல் மற்றவர்களைக் கண்டுபிடிக்க அனுமதிக்கிறது. (பேட்டரி பயன்பாட்டை அதிகரிக்கிறது.)

# pref_enable_lsd_title
source: LSD
ta: எல்.எச்.டி.

# pref_enable_lsd_summary
source: Designed to support local discovery, aiming to minimize traffic.
ta: உள்ளக கண்டுபிடிப்புக்கு ஆதரவாக வடிவமைக்கப்பட்டுள்ளது, போக்குவரத்தை குறைப்பதை நோக்கமாகக் கொண்டுள்ளது.

# pref_enable_utp_summary
source: Intended to mitigate poor latency and other congestion control issues found in conventional BitTorrent over TCP, while providing reliable, ordered delivery.
ta: டி.சி.பி மீது வழக்கமான பிட்டோரண்டில் காணப்படும் மோசமான நேரந்தவறுகை மற்றும் பிற நெரிசல் கட்டுப்பாட்டு சிக்கல்களைத் தணிக்கும் நோக்கம் கொண்டது, அதே நேரத்தில் நம்பகமான, உத்தரவிடப்பட்ட விநியோகத்தை வழங்கும்.

# pref_enable_upnp_title
source: UPnP
ta: யுபிஎன்பி

# pref_enable_natpmp_title
source: NAT-PMP
ta: நாட்-பி.எம்.பி.

# pref_port_settings_category
source: Port settings
ta: துறைமுக அமைப்புகள்

# pref_use_random_port_title
source: Use random port
ta: சீரற்ற போர்ட் பயன்படுத்தவும்

# pref_use_random_port_summarty
source: Sets the start port randomly in range [%1$d, %2$d] and the ending port as the first + 10.
ta: தொடக்க போர்ட்டை தோராயமாக [ %1$d, %2$d] மற்றும் இறுதி துறைமுகத்தை முதல் + 10 ஆக அமைக்கிறது.

# pref_port_range_title
source: Port range
ta: துறைமுக வரம்பு

# pref_port_range_start_title
source: Start
ta: தொடங்கு

# pref_port_range_end_title
source: End
ta: முடிவு

# pref_encryption_category
source: Encryption
ta: குறியாக்க

# pref_enc_mode_title
source: Mode
ta: பயன்முறை

# pref_enc_mode_entries_0
source: Prefer
ta: குறியாக்கத்தை விரும்புகிறேன்

# pref_enc_mode_entries_1
source: Require
ta: குறியாக்க தேவை

# pref_enc_mode_entries_2
source: Off
ta: குறியாக்கத்தை முடக்கு

# pref_enc_in_connections_title
source: Incoming connections
ta: உள்வரும் இணைப்புகள்

# pref_enc_out_connections_title
source: Outgoing connections
ta: வெளியேறும் இணைப்புகள்

# pref_ip_filtering_category
source: IP filtering
ta: IP வடிப்பான்

# pref_enable_ip_filtering_title
source: IP filtering
ta: ஐபி வடிகட்டுதல்

# pref_enable_ip_filtering_summary
source: Depending on the file size, applying the filter upon startup may take some time. (Increases memory usage.)
ta: கோப்பு அளவைப் பொறுத்து, தொடக்கத்தில் வடிகட்டியைப் பயன்படுத்துவதற்கு சிறிது நேரம் ஆகலாம். (நினைவக பயன்பாட்டை அதிகரிக்கிறது.)

# pref_ip_filtering_file_title
source: Path to filter file (.dat, .p2p)
ta: கோப்பு வடிகட்ட பாதை (.dat, .p2p)

# pref_show_nat_errors
source: Show NAT errors
ta: NAT பிழைகள் காட்டு

# pref_anonymous_mode_title
source: Anonymous mode
ta: அநாமதேய பயன்முறை

# pref_use_anonymous_mode
source: Use anonymous mode
ta: அநாமதேய பயன்முறையைப் பயன்படுத்தவும்

# pref_anonymous_mode_summary
source: No user-agent string for non-private torrents. Only proxied trackers. Listening sockets closed. Incoming connections through SOCKS5- or I2P proxy (if a peer proxy exists on the tracker proxy PC). NAT-PMP, UPnP, DHT and local discovery off.
ta: தனியார் அல்லாத நீரோடைகளுக்கு பயனர்-முகவர் சரம் இல்லை. ப்ராக்சிட் டிராக்கர்கள் மட்டுமே. கேட்கும் சாக்கெட்டுகள் மூடப்பட்டன. SOCKS5- அல்லது I2P பதிலாள் மூலம் உள்வரும் இணைப்புகள் (டிராக்கர் பதிலாள் கணினியில் ஒரு பியர் பதிலாள் இருந்தால்). NAT-PMP, UPNP, DHT மற்றும் உள்ளக டிச்கவரி ஆஃப்.

# pref_seeding_outgoing_connections_title
source: Outgoing connections for seeding
ta: விதைப்பதற்கான வெளிச்செல்லும் இணைப்புகள்

# pref_seeding_outgoing_connections_summary
source: Lets seeding torrents make outgoing connections. (Can be costly.)
ta: விதை நீரோடைகளை வெளிச்செல்லும் இணைப்புகளை உருவாக்க அனுமதிக்கிறது. (விலை உயர்ந்ததாக இருக்கலாம்.)

# pref_validate_https_trackers_title
source: Validate the certificates of HTTPS trackers
ta: HTTPS டிராக்கர்களின் சான்றிதழ்களை சரிபார்க்கவும்

# pref_validate_https_trackers_summary
source: The certificate of HTTPS trackers and HTTPS web seeds will be validated in the system certificate store.
ta: கணினி சான்றிதழ் கடையில் HTTPS டிராக்கர்கள் மற்றும் HTTPS வலை விதைகளின் சான்றிதழ் சரிபார்க்கப்படும்.

# pref_proxy_type_title
source: Proxy type
ta: பதிலாள் வகை

# pref_proxy_type_entries_0
source: (None)
ta: (எதுவும்)

# pref_proxy_type_entries_1
source: SOCKS4
ta: சாக்ச் 4

# pref_proxy_type_entries_2
source: SOCKS5
ta: சாக்ச் 5

# pref_proxy_address_title
source: Address
ta: முகவரி

# pref_proxy_port_title
source: Port
ta: போர்ட்

# pref_proxy_peers_too_title
source: Also use for connections
ta: இணைப்புகளுக்கும் பயன்படுத்தவும்

# pref_proxy_peers_too_summary
source: Connections to trackers, others and web-seeds are proxied. Does not affect DHT.
ta: டிராக்கர்கள், மற்றவர்கள் மற்றும் வலை விதைகளுக்கான இணைப்புகள் ப்ராக்சிச் செய்யப்படுகின்றன. DHT ஐ பாதிக்காது.

# pref_proxy_requires_auth_title
source: Requires authorization
ta: அங்கீகாரம் தேவைப்படுகிறது

# pref_proxy_requires_auth_summary
source: Warning: The password is saved as a regular file.
ta: எச்சரிக்கை: கடவுச்சொல் வழக்கமான கோப்பாக சேமிக்கப்படுகிறது.

# pref_proxy_login_title
source: Username
ta: பயனர்பெயர்

# pref_proxy_password_title
source: Password
ta: கடவுச்சொல்

# pref_enable_scheduling_start_title
source: Start-time
ta: தொடக்க நேரம்

# pref_enable_scheduling_start_summary
source: Start the app at a specified time. Torrents run according to their state before the last one is shut down.
ta: பயன்பாட்டை ஒரு குறிப்பிட்ட நேரத்தில் தொடங்கவும். கடைசியாக மூடப்படுவதற்கு முன்பு டோரண்ட்ச் தங்கள் மாநிலத்தின்படி இயங்குகிறது.

# pref_enable_scheduling_shutdown_title
source: Shutdown-time
ta: பணிநிறுத்தம் நேரம்

# pref_enable_scheduling_shutdown_summary
source: Shutdown the app at a specified time
ta: ஒரு குறிப்பிட்ட நேரத்தில் பயன்பாட்டை நிறுத்துங்கள்

# pref_scheduling_run_only_once_title
source: Only run once
ta: ஒரு முறை மட்டுமே இயக்கவும்

# pref_scheduling_switch_wifi_title
source: Toggle Wi-Fi
ta: வைஃபை மாற்று

# pref_scheduling_switch_wifi_summary
source: Turn on Wi-Fi for scheduled start, and off for scheduled stop.
ta: திட்டமிடப்பட்ட தொடக்கத்திற்காக வைஃபை இயக்கவும், திட்டமிடப்பட்ட நிறுத்தத்திற்கு அணைக்கவும்.

# exact_alarm_permission_warning
source: For the scheduler to work, you must obtain permission in a special system dialog. Proceed?
ta: திட்டமிடுபவர் வேலை செய்ய, நீங்கள் ஒரு சிறப்பு கணினி உரையாடலில் இசைவு பெற வேண்டும். தொடரவா?

# pref_feed_auto_refresh_title
source: Auto-refresh channels
ta: ஆட்டோ-ரஃப்ரெச் சேனல்கள்

# pref_enable_feed_auto_refresh
source: Enable auto-refresh
ta: ஆட்டோ-ரீஃப்ரெசை இயக்கவும்

# pref_feed_auto_refresh_summary
source: Periodically refresh channels in the background.
ta: அவ்வப்போது பின்னணியில் சேனல்களை புதுப்பிக்கவும்.

# pref_feed_refresh_interval_title
source: Refresh interval
ta: புதுப்பிப்பு இடைவெளி

# pref_feed_refresh_intervals_entries_0
source: 15 minutes
ta: 15 நிமிடங்கள்

# pref_feed_refresh_intervals_entries_1
source: 30 minutes
ta: 30 நிமிடம்

# pref_feed_refresh_intervals_entries_2
source: 1 hour
ta: 1 மணி நேரம்

# pref_feed_refresh_intervals_entries_3
source: 2 hours
ta: 2 மணி நேரம்

# pref_feed_refresh_intervals_entries_4
source: 6 hours
ta: 6 மணி

# pref_feed_refresh_intervals_entries_5
source: 12 hours
ta: 12 மணி நேரம்

# pref_feed_refresh_intervals_entries_6
source: 1 day
ta: 1 நாள்

# pref_feed_auto_refresh_unmetered_connections_only_title
source: Only on unmetered connections
ta: அளவிடப்படாத இணைப்புகளில் மட்டுமே

# pref_feed_auto_refresh_unmetered_connections_only_summary
source: Only refresh on connections without a quota (for example Wi-Fi or Ethernet).
ta: ஒதுக்கீடு இல்லாமல் இணைப்புகளில் மட்டுமே புதுப்பிக்கவும் (எடுத்துக்காட்டாக வைஃபை அல்லது ஈதர்நெட்).

# pref_feed_auto_refresh_enable_roaming_title
source: Roaming
ta: ரோமிங்

# pref_feed_keep_items_time_title
source: Keep articles
ta: கட்டுரைகளை வைத்திருங்கள்

# pref_feed_keep_items_time_entries_0
source: 1 day
ta: 1 நாள்

# pref_feed_keep_items_time_entries_1
source: 2 days
ta: 2 நாட்கள்

# pref_feed_keep_items_time_entries_2
source: 4 days
ta: 4 நாட்கள்

# pref_feed_keep_items_time_entries_3
source: 1 week
ta: 1 வாரம்

# pref_feed_keep_items_time_entries_4
source: 2 weeks
ta: 2 வாரங்கள்

# pref_feed_keep_items_time_entries_5
source: 1 month
ta: 1 மாதம்

# pref_feed_keep_items_time_entries_6
source: 2 months
ta: 2 மாதங்கள்

# pref_feed_keep_items_time_entries_7
source: 3 months
ta: 3 மாதங்கள்

# pref_feed_keep_items_time_entries_8
source: Indefinitely
ta: எப்போதும்

# pref_feed_start_torrents_title
source: Auto-start torrents
ta: ஆட்டோ-ச்டார்ட் டொரண்ட்ச்

# pref_feed_start_torrents_summary
source: Downloads added torrents.
ta: பதிவிறக்கங்கள் டோரண்டுகளைச் சேர்த்தன.

# pref_feed_remove_duplicates_title
source: No duplication
ta: நகல் இல்லை

# pref_feed_remove_duplicates_summary
source: Skips downloading already present file titles.
ta: ஏற்கனவே தற்போதைய கோப்பு தலைப்புகளை பதிவிறக்குவதைத் தவிர்க்கிறது.

# pref_streaming_enable_title
source: Streaming
ta: ச்ட்ரீமிங்

# pref_enable_streaming
source: Enable streaming
ta: ச்ட்ரீமிங்கை இயக்கவும்

# pref_streaming_enable_summary
source: Allows downloading individual files from a torrent using a web-browser or media player using HTTP/S URLs.
ta: HTTP/S முகவரி களைப் பயன்படுத்தி வலை-உலாவி அல்லது மீடியா பிளேயரைப் பயன்படுத்தி ஒரு டொரண்டிலிருந்து தனிப்பட்ட கோப்புகளைப் பதிவிறக்க அனுமதிக்கிறது.

# pref_streaming_hostname
source: Hostname
ta: ஹோஸ்ட்பெயர்

# pref_streaming_port
source: Port
ta: போர்ட்

# pref_streaming_error
source: Select a port or hostname for streaming that isn't busy or incorrect.
ta: பிசியாக அல்லது தவறாக இல்லாத ச்ட்ரீமிங்கிற்கு ஒரு துறைமுகம் அல்லது ஓச்ட்பெயரைத் தேர்ந்தெடுக்கவும்.

# about_title
source: About
ta: பற்றி

# about_description
source: More info and how to help the project: <a href=https://gitlab.com/proninyaroslav/libretorrent>https://gitlab.com/proninyaroslav/libretorrent</a><br><br> LibreTorrent is a copylefted libre (<a href=https://www.gnu.org/copyleft/gpl.html>GPLv3+</a>) torrent client for Android 4+, based on the libtorrent (Java wrapper <a href=https://github.com/aldenml/libtorrent4j>libtorrent4j</a>) lib.<br><br>
ta: மேலும் செய்தி மற்றும் திட்டத்திற்கு எவ்வாறு உதவுவது: <a href = https: //gitlab.com/pronininearoslav/libretorrent> https://gitlab.com/pronininearoslav/libretorrent </a> <br> <br> நூலகம் libre (<a href = https: //www.gnu.org/copileft/gpl.html> gplv3+</a>) ஆண்ட்ராய்டு 4+ க்கான டொரண்ட் வாங்கி, லிப்டோரெண்டின் அடிப்படையில் (சாவா ரேப்பர் <a href = https: // github.com/aldenml/libtorrent4j>libtorrent4j</a>) lib.<br><br>

# about_changelog
source: Changelog
ta: சேஞ்ச்

# perm_denied_warning_android_r
source: Access all files permission is required to download torrents and access .torrent files in arbitrary folders. Without this permission, LibreTorrent will only have access to a limited number of folders. Are you sure you want to deny this permission?
ta: அனைத்து கோப்புகளையும் அணுகவும் டொரண்ட்ச் மற்றும் அணுகலை அணுக அனுமதித்தல் தேவை. டோரண்ட் கோப்புகளை தன்னிச்சையான கோப்புறைகளில். இந்த அனுமதியின்றி, லிப்ரெட்டோரண்டிற்கு ஒரு குறிப்பிட்ட எண்ணிக்கையிலான கோப்புறைகளுக்கு மட்டுமே அணுகல் இருக்கும். இந்த அனுமதியை நீங்கள் மறுக்க விரும்புகிறீர்களா?

source: Torrents
ta: டொரண்ட்ச்

source: Ascending sort
ta: ஏறுவரிசை வரிசை

source: Descending sort
ta: இறங்கு வரிசை

source: Current storage
ta: தற்போதைய சேமிப்பு

source: Select
ta: தேர்ந்தெடு

source: Create
ta: உருவாக்கு

source: Color picker
ta: வண்ண தேர்வாளர்

# load_message
source: Load, please wait…
ta: ஏற்றவும், தயவுசெய்து காத்திருங்கள்…

source: Reset filter
ta: வடிகட்டியை மீட்டமை

# feed_articles
source: Articles
ta: கட்டுரைகள்

source: Enable journal
ta: பத்திரிகையை இயக்கு

source: Scroll up
ta: மேலே உருட்டவும்

source: Scroll down
ta: கீழே உருட்டவும்

# torrent_info_size_template_plural
source: %1$s • %2$d file
ta: %1$s • %2$d கோப்பு
