Repository: 247i/TACETr
Catalog: உரை/தானி/librecad-plugins-*.po
Languages: ta

# AsciiFile
source: Read ascii points
ta: ASCII புள்ளிகளைப் படியுங்கள்

# LC_Align
source: Align
ta: சீரமைத்தல்

# LC_Align
source: Align settings...
ta: அமைப்புகளை சீரமைக்கவும் ...

# LC_Align
source: Keep original objects
ta: அசல் பொருள்களை வைத்திருங்கள்

# LC_Align
source: Specify base points first
ta: முதலில் அடிப்படை புள்ளிகளைக் குறிப்பிடவும்

# LC_Align
source: Align Settings
ta: அமைப்புகளை சீரமைக்கவும்

# LC_Align
source: Click on options to set/unset, Ok to accept and start alignment.
ta: அமைக்க/அமைக்க விருப்பங்களைக் சொடுக்கு செய்க, சீரமைப்பை ஏற்றுக்கொள்வதற்கும் தொடங்குவதற்கும் சரி.

# LC_Align
source: If 'Keep original objects' is checked, Align will copy rather than move the selected objects. If 'Specify base points first' is checked, Align will prompt for the alignment points in the order first base, second base, first target, second target.
ta: 'அசல் பொருள்களை வைத்திருங்கள்' சரிபார்க்கப்பட்டால், தேர்ந்தெடுக்கப்பட்ட பொருள்களை நகர்த்துவதை விட சீரமைப்பு நகலெடுக்கும். 'முதலில் அடிப்படை புள்ளிகளைக் குறிப்பிடினால்' சரிபார்க்கப்பட்டால், வரிசையில் சீரமைப்பு புள்ளிகளுக்கு சீரமைத் தூண்டும் முதல் அடிப்படை, இரண்டாவது அடிப்படை, முதல் இலக்கு, இரண்டாவது இலக்கு.

# LC_Align
source: first base point:
ta: முதல் அடிப்படை புள்ளி:

# LC_Align
source: first target point:
ta: முதல் இலக்கு புள்ளி:

# LC_Align
source: second base point:
ta: இரண்டாவது அடிப்படை புள்ளி:

# LC_Align
source: second target point:
ta: இரண்டாவது இலக்கு புள்ளி:

# LC_Gear
source: Gear creation plugin
ta: கியர் உருவாக்கம் சொருகி

# LC_Gear
source: Gear plugin
ta: கியர் சொருகி

# LC_List
source: List entities
ta: பட்டியல் நிறுவனங்கள்

# LC_List
source: Empty Entity
ta: வெற்று நிறுவனம்

# LC_List
source: X
ta: ஃச்

# LC_List
source: Y
ta: ஒய்

# LC_List
source: Layer
ta: அடுக்கு

# LC_List
source: Color
ta: நிறம்

# LC_List
source: Line type
ta: வரி வகை

# LC_List
source: Line thickness
ta: வரி தடிமன்

# LC_List
source: ID
ta: ஐடி

# LC_List
source: POINT
ta: புள்ளி

# LC_List
source: in point
ta: புள்ளி

# LC_List
source: LINE
ta: வரி

# LC_List
source: from point
ta: புள்ளியிலிருந்து

# LC_List
source: to point
ta: புள்ளி

# LC_List
source: length
ta: நீளம்

# LC_List
source: Angle in XY plane
ta: XY விமானத்தில் கோணம்

# LC_List
source: Inc.
ta: இன்க்.

# LC_List
source: ARC
ta: வில்

# LC_List
source: center point
ta: மைய புள்ளி

# LC_List
source: radius
ta: ஆரம்

# LC_List
source: initial angle
ta: ஆரம்ப கோணம்

# LC_List
source: final angle
ta: இறுதி கோணம்

# LC_List
source: CIRCLE
ta: வட்டம்

# LC_List
source: circumference
ta: சுற்றளவு

# LC_List
source: area
ta: பகுதி

# LC_List
source: ELLIPSE
ta: நீள்வட்டம்

# LC_List
source: major axis
ta: பெரிய அச்சு

# LC_List
source: CONSTRUCTIONLINE
ta: கட்டுமான இடம்

# LC_List
source: OVERLAYBOX
ta: மேலடுக்கு பெட்டி

# LC_List
source: SOLID
ta: திடமான

# LC_List
source: TEXT
ta: உரை

# LC_List
source: TEXTCONTENT
ta: உரைப்பொருள்

# LC_List
source: INSERT
ta: செருகவும்

# LC_List
source: Name
ta: பெயர்

# LC_List
source: Insertion point
ta: செருகும் புள்ளி

# LC_List
source: Scale
ta: அளவு

# LC_List
source: Rotation
ta: சுழற்சி

# LC_List
source: Columns/Rows
ta: நெடுவரிசைகள்/வரிசைகள்

# LC_List
source: Column/Row Spacing
ta: நெடுவரிசை/வரிசை இடைவெளி

# LC_List
source: POLYLINE
ta: பாலிலைன்

# LC_List
source: Closed
ta: மூடப்பட்டது

# LC_List
source: No
ta: இல்லை

# LC_List
source: Yes
ta: ஆம்

# LC_List
source: Vertices
ta: கோண உச்சிகள்

# LC_List
source: IMAGE
ta: படம்

# LC_List
source: SPLINE
ta: ச்ப்லைன்

# LC_List
source: SPLINEPOINTS
ta: ச்ப்லைன் புள்ளிகள்

# LC_List
source: HATCH
ta: அட்ச்

# LC_List
source: DIMLEADER
ta: மங்கலான

# LC_List
source: DIMLINEAR
ta: Timlinear

# LC_List
source: DIMRADIAL
ta: மங்கலான

# LC_List
source: DIMDIAMETRIC
ta: மங்கலான

# LC_List
source: DIMANGULAR
ta: மங்கலான

# LC_List
source: UNKNOWN
ta: தெரியவில்லை

# LC_SameProp
source: Same properties
ta: அதே பண்புகள்

# LC_SameProp
source: select original entity:
ta: அசல் நிறுவனத்தைத் தேர்ந்தெடுக்கவும்:

# LC_SameProp
source: select entities to change
ta: மாற்ற நிறுவனங்களைத் தேர்ந்தெடுக்கவும்

# LC_Sample
source: Sample plugin
ta: மாதிரி சொருகி

# PicFile
source: Read PIC file
ta: படக் கோப்பைப் படியுங்கள்

# PicFile
source: import PIC file
ta: படக் கோப்பை இறக்குமதி செய்க

# dibPunto
source: Read ascii points
ta: ASCII புள்ளிகளைப் படியுங்கள்

# dibPunto
source: File...
ta: கோப்பு ...

# dibPunto
source: Format:
ta: வடிவம்:

# dibPunto
source: Space Separator
ta: விண்வெளி பிரிப்பான்

# dibPunto
source: Tab Separator
ta: தாவல் பிரிப்பான்

# dibPunto
source: Comma Separator
ta: கமா பிரிப்பான்

# dibPunto
source: Space in Columns
ta: நெடுவரிசைகளில் இடம்

# dibPunto
source: *.odb for Psion 2
ta: *. சியோன் 2 க்கு

# dibPunto
source: Connect points
ta: புள்ளிகளை இணைக்கவும்

# dibPunto
source: 2D Point
ta: 2 டி புள்ளி

# dibPunto
source: Draw 2D Point
ta: 2 டி புள்ளியை வரையவும்

# dibPunto
source: 3D Point
ta: 3 டி புள்ளி

# dibPunto
source: Draw 3D Point
ta: 3D புள்ளியை வரையவும்

# dibPunto
source: Point Number
ta: புள்ளி எண்

# dibPunto
source: Draw point number
ta: புள்ளி எண்ணை வரையவும்

# dibPunto
source: Point Elevation
ta: புள்ளி உயரம்

# dibPunto
source: Draw point elevation
ta: புள்ளி உயரத்தை வரையவும்

# dibPunto
source: Point Code
ta: புள்ளி குறியீடு

# dibPunto
source: Draw point code
ta: புள்ளி குறியீட்டை வரையவும்

# dibPunto
source: Accept
ta: ஏற்கவும்

# dibPunto
source: Cancel
ta: ரத்து

# dibPunto
source: Select file
ta: கோப்பைத் தேர்ந்தெடு

# dibPunto
source: Point 2D layer is empty
ta: புள்ளி 2 டி அடுக்கு காலியாக உள்ளது

# dibPunto
source: Point 3D layer is empty
ta: புள்ளி 3 டி அடுக்கு காலியாக உள்ளது

# dibPunto
source: Point elevation layer is empty
ta: புள்ளி உயர அடுக்கு காலியாக உள்ளது

# dibPunto
source: Point elevation height is empty
ta: புள்ளி உயர உயரம் காலியாக உள்ளது

# dibPunto
source: Point elevation separation is empty
ta: புள்ளி உயர பிரிப்பு காலியாக உள்ளது

# dibPunto
source: Point number layer is empty
ta: புள்ளி எண் அடுக்கு காலியாக உள்ளது

# dibPunto
source: Point number height is empty
ta: புள்ளி எண் உயரம் காலியாக உள்ளது

# dibPunto
source: Point number separation is empty
ta: புள்ளி எண் பிரிப்பு காலியாக உள்ளது

# dibPunto
source: Point code layer is empty
ta: புள்ளி குறியீடு அடுக்கு காலியாக உள்ளது

# dibPunto
source: Point code height is empty
ta: புள்ளி குறியீடு உயரம் காலியாக உள்ளது

# dibPunto
source: Point code separation is empty
ta: புள்ளி குறியீடு பிரிப்பு காலியாக உள்ளது

# dibPunto
source: The file %1 not exist
ta: கோப்பு %1 இல்லை

# dibPunto
source: Can't open the file %1
ta: %1 கோப்பைத் திறக்க முடியாது

source: Divide
ta: பிரிக்கவும்

# divide
source: Select a line, circle or arc and press return
ta: ஒரு வரி, வட்டம் அல்லது வளைவைத் தேர்ந்தெடுத்து திரும்பவும்

# divide
source: Error
ta: பிழை

# divide
source: Empty Entity
ta: வெற்று நிறுவனம்

# divide
source: X
ta: ஃச்

# divide
source: Y
ta: ஒய்

# divide
source: Layer
ta: அடுக்கு

# divide
source: Color
ta: நிறம்

# divide
source: Line type
ta: வரி வகை

# divide
source: Line thickness
ta: வரி தடிமன்

# divide
source: ID
ta: ஐடி

# divide
source: LINE
ta: வரி

# divide
source: from point
ta: புள்ளியிலிருந்து

# divide
source: to point
ta: புள்ளி

# divide
source: length
ta: நீளம்

# divide
source: Angle in XY plane
ta: XY விமானத்தில் கோணம்

# divide
source: Inc.
ta: இன்க்.

# divide
source: ARC
ta: வில்

# divide
source: center point
ta: மைய புள்ளி

# divide
source: radius
ta: ஆரம்

# divide
source: initial angle
ta: தொடக்க கோணம்

# divide
source: final angle
ta: இறுதி கோணம்

# divide
source: CIRCLE
ta: வட்டம்

# divide
source: circumference
ta: பரிதி

# divide
source: area
ta: பகுதி

# divide
source: POLYLINE
ta: பாலிலைன்

# divide
source: Closed
ta: மூடப்பட்டது

# divide
source: No
ta: இல்லை

# divide
source: Yes
ta: ஆம்

# divide
source: Vertices
ta: செங்குத்துகள்

# divide
source: in point
ta: புள்ளி

# divide
source: MUST be a line, circle or arc
ta: ஒரு வரி, வட்டம் அல்லது வளைவாக இருக்க வேண்டும்

# dividedlg
source: Divide -
ta: பிரிக்கவும் -

# dividedlg
source: Layers
ta: அடுக்குகள்

# dividedlg
source: OK
ta: சரி

# dividedlg
source: Cancel
ta: ரத்துசெய்

# dividedlg
source: Divide at
ta: பிரிக்கவும்

# dividedlg
source: Size
ta: அளவு

# dividedlg
source: places
ta: இடங்கள்

# dividedlg
source: Ticks - Off
ta: உண்ணி - ஆஃப்

# dividedlg
source: Breaks - Off
ta: இடைவெளிகள் - ஆஃப்

# dividedlg
source: <i>New</i>
ta: <i> புதிய </i>

# dividedlg
source: Enter start angle, in decimal degrees 0° at 3 o'clock goes anti-clockwise.
ta: தொடக்கத்தை உள்ளிடவும் கோணம், இல் தசம டிகிரி 0 ° 3 மணிக்கு செல்கிறது கடிகார எதிர்ப்பு.

# dividedlg
source: <i>"New"</i><br>Enter name<br>for a new layer<br>(if required?) to<br>draw ticks on.
ta: <i> "புதிய" </i> <br> பெயரை உள்ளிடுக <br> ஒரு புதிய அடுக்குக்கு <br> (தேவைப்பட்டால்?) <br> உண்ணி.

# dividedlg
source: Ticks
ta: உண்ணி

# dividedlg
source: Above
ta: மேலே

# dividedlg
source: Below
ta: கீழே

# dividedlg
source: Outside
ta: வெளியே

# dividedlg
source: Inside
ta: உள்ளே

# lc_Geardlg
source: Number of teeth
ta: பற்களின் எண்ணிக்கை

# lc_Geardlg
source: Pressure angle (deg)
ta: அழுத்தம் கோணம்

# lc_Geardlg
source: Rotation angle
ta: சுழற்சி கோணம்

# lc_Geardlg
source: Modulus
ta: மாடுலச்

# lc_Geardlg
source: Addendum (rel. to modulus)
ta: கூடுதல் (rel. மாடுலசுக்கு)

# lc_Geardlg
source: Dedendum (rel. to modulus)
ta: Dedendum (rel. மாடுலசுக்கு)

# lc_Geardlg
source: Number of segments to draw (dedendum)
ta: வரைய பகுதிகளின் எண்ணிக்கை (டெடெண்டம்)

# lc_Geardlg
source: Number of segments to draw (addendum)
ta: வரைய பகுதிகளின் எண்ணிக்கை (கூடுதல்)

# lc_Geardlg
source: Draw all teeth?
ta: அனைத்து பற்களையும் வரையவா?

# lc_Geardlg
source: Draw symmetric face?
ta: சமச்சீர் முகத்தை வரையவா?

# lc_Geardlg
source: Use layers?
ta: அடுக்குகளைப் பயன்படுத்தவா?

# lc_Geardlg
source: Draw addendum circle?
ta: கூடுதல் வட்டத்தை வரையவா?

# lc_Geardlg
source: Draw pitch circle?
ta: சுருதி வட்டத்தை வரையவா?

# lc_Geardlg
source: Draw base circle?
ta: அடிப்படை வட்டத்தை வரையவா?

# lc_Geardlg
source: Draw root circle?
ta: ரூட் வட்டத்தை வரையவா?

# lc_Geardlg
source: Draw pressure line?
ta: அழுத்தம் கோட்டை வரையவா?

# lc_Geardlg
source: Draw pressure limits?
ta: அழுத்தம் வரம்புகளை வரையவா?

# lc_Geardlg
source: Calculate interference?
ta: குறுக்கீட்டைக் கணக்கிடவா?

# lc_Geardlg
source: Number of segments to draw (interference)
ta: வரைய பகுதிகளின் எண்ணிக்கை (குறுக்கீடு)

# lc_Geardlg
source: Accept
ta: ஏற்றுக்கொள்

# lc_Geardlg
source: Cancel
ta: ரத்துசெய்

# lc_Listdlg
source: List entities
ta: பட்டியல் நிறுவனங்கள்

# lc_Sampledlg
source: Draw line
ta: கோடு டிரா

# lc_Sampledlg
source: Start X:
ta: ஃச் தொடங்கு:

# lc_Sampledlg
source: Start Y:
ta: ஒய் ஐத் தொடங்கு:

# lc_Sampledlg
source: End X:
ta: எண்ட் எக்ச்:

# lc_Sampledlg
source: End Y:
ta: முடிவு y:

# lc_Sampledlg
source: Accept
ta: ஏற்றுக்கொள்

# lc_Sampledlg
source: Cancel
ta: ரத்துசெய்

# lc_Sampledlg
source: Start X is empty
ta: தொடக்க ஃச் காலியாக உள்ளது

# lc_Sampledlg
source: Start Y is empty
ta: தொடக்க ஒய் காலியாக உள்ளது

# lc_Sampledlg
source: End X is empty
ta: முடிவு ஃச் காலியாக உள்ளது

# lc_Sampledlg
source: End Y is empty
ta: முடிவு ஒய் காலியாக உள்ளது

# lc_Sampledlg
source: Sample plugin
ta: மாதிரி சொருகி

# picPunto
source: File...
ta: கோப்பு ...

# picPunto
source: Scale:
ta: அளவு:

# picPunto
source: Accept
ta: ஏற்றுக்கொள்

# picPunto
source: Cancel
ta: ரத்துசெய்

# picPunto
source: Select file
ta: கோப்பைத் தேர்ந்தெடு

# picPunto
source: Scale Factor is empty or invalid
ta: அளவிலான காரணி காலியாக அல்லது தவறானது

# picPunto
source: The file %1 not exist
ta: கோப்பு %1 இல்லை

# picPunto
source: Can't open the file %1
ta: %1 கோப்பைத் திறக்க முடியாது

# picPunto
source: %1 objects imported
ta: %1 பொருள்கள் இறக்குமதி செய்யப்படுகின்றன

# picPunto
source: picPunto drawLine: first point is empty %1
ta: பிக்புண்டோ டிராக்லைன்: முதல் புள்ளி காலியாக உள்ளது %1

# picPunto
source: picPunto drawLine: next point is empty %1
ta: பிக்புண்டோ டிராக்லைன்: அடுத்த புள்ளி காலியாக உள்ளது %1

# picPunto
source: format error in %1
ta: %1 இல் வடிவமைப்பு பிழை

# plot
source: Plot plugin
ta: சூழ்ச்சி சொருகி

# plotDialog
source: Plot equation
ta: சூழ்ச்சி சமன்பாடு

# plotDialog
source: This plugin allows you to plot mathematical equations. If you don't want to use the parametric form, just leave out "Equation2". You can use pi when you need the value of pi (i.e. (3*pi)). Use t or x in your equation as a variable/parameter.
ta: இந்த சொருகி கணித சமன்பாடுகளைத் திட்டமிட உங்களை அனுமதிக்கிறது. நீங்கள் அளவுரு வடிவத்தைப் பயன்படுத்த விரும்பவில்லை என்றால், "சமன்பாடு 2" ஐ விட்டு விடுங்கள். உங்களுக்கு PI இன் மதிப்பு தேவைப்படும்போது PI ஐப் பயன்படுத்தலாம் (அதாவது (3*pi)). உங்கள் சமன்பாட்டில் T அல்லது ஃச் ஐ மாறி/அளவுருவாகப் பயன்படுத்தவும்.

# plotDialog
source: Equation 1:
ta: சமன்பாடு 1:

# plotDialog
source: Equation 2:
ta: சமன்பாடு 2:

# plotDialog
source: start value:
ta: தொடக்க மதிப்பு:

# plotDialog
source: end value:
ta: முடிவு மதிப்பு:

# plotDialog
source: step size:
ta: படி அளவு:

# plotDialog
source: Draw
ta: டிரா

# plotDialog
source: Cancel
ta: ரத்துசெய்

# plotDialog Plot Equation to generate RS_Line segments
source: Line Segments
ta: வரி பிரிவுகள்

# plotDialog Plot Equation to generate RS_Polyline
source: Polyline
ta: பாலிலைன்

# plotDialog Plot Equation to generate 2nd spline by LC_SplinePoints
source: SplinePoints
ta: ச்ப்லைன் புள்ளிகள்

# pointBox
source: Layer:
ta: அடுக்கு:

# textBox
source: Style:
ta: ச்டைல்:

# textBox
source: Height:
ta: உயரம்:

# textBox
source: Separation
ta: பிரித்தல்
