Repository: 247i/TACETr
Catalog: உரை/தானி/libretorrent-app-strings-*.po
Languages: ta

source: OK
ta: சரி

source: Cancel
ta: ரத்து

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Error
ta: பிழை

source: Warning
ta: எச்சரிக்கை

source: Shutdown
ta: நிறுத்தம்

source: Replace
ta: மாற்றவும்

source: Add
ta: கூட்டு

source: Delete
ta: அழி

source: Deleting…
ta: நீக்குதல்…

source: Select all
ta: அனைத்தையும் தெரிவுசெய்

source: Save
ta: சேமி

source: Search
ta: தேடல்

# not_available
source: N/A
ta: பொ / இ

# elapsed_time_format_d_h_mm
source: %1$d d. %2$d h. %3$d m
ta: %1$d d. %2$d h. %3$d மீ

# elapsed_time_format_h_mm_ss
source: %1$d h. %2$d m. %3$d s
ta: %1$d h. %2$d மீ. %3$d கள்

# elapsed_time_format_mm_ss
source: %1$d m. %2$d s
ta: %1$d மீ. %2$d கள்

# elapsed_time_format_ss
source: %1$d s
ta: %1$d கள்

# def
source: Default
ta: இயல்புநிலை

source: Foreground notification
ta: முன்னால் அறிவிப்பு

source: Link
ta: இணைப்பு

source: Filter
ta: வடிகட்டி

source: Refresh
ta: புதுப்பிப்பு

source: Edit
ta: தொகு

source: Menu
ta: பட்டி

source: Open navigation drawer
ta: வழிசெலுத்தல் அலமாரியைத் திறக்கவும்

source: Close navigation drawer
ta: வழிசெலுத்தல் அலமாரியை மூடு

source: File
ta: கோப்பு

source: Folder
ta: கோப்புறை

source: Finished
ta: முடிந்தது

source: Pause all
ta: அனைத்தையும் இடைநிறுத்துங்கள்

source: Resume all
ta: அனைத்தையும் மீண்டும் தொடங்குங்கள்

source: All
ta: அனைத்தும்

source: Details
ta: விவரங்கள்

source: Stats
ta: புள்ளிவிவரங்கள்

source: Filters
ta: வடிப்பான்கள்

source: Apply
ta: விண்ணப்பிக்கவும்

source: Clipboard
ta: கிளிப்போர்டு

# switch_on
source: On
ta: ஆன்

# switch_off
source: Off
ta: முடக்கு

# delete_torrent_with_downloaded_files
source: Delete with downloaded files
ta: பதிவிறக்கப்பட்ட கோப்புகளை நீக்கு

# delete_selected_torrent
source: Delete selected torrent? (Cannot be undone.)
ta: தேர்ந்தெடுக்கப்பட்ட டோரண்ட் நீக்க வேண்டுமா? (இந்த செயல்பாடு செயல்தவிர்க்க முடியாது)

# delete_selected_torrents
source: Delete selected torrents? (Cannot be undone.)
ta: தேர்ந்தெடுக்கப்பட்டுள்ள டோரண்டுகளை நீக்க வேண்டுமா? (இந்த செயல்பாடு செயல்தவிர்க்க முடியாது.)

# force_recheck_torrent
source: Force recheck
ta: படை மறுபடியும்

# force_announce_torrent
source: Force-announce
ta: படை-அஞ்சல்ல

source: Add link
ta: இணைப்பைச் சேர்க்கவும்

# dialog_add_link_title
source: Enter the infohash value, magnet link, or HTTP/S link
ta: இன்ஃபோஆச் மதிப்பு, காந்த இணைப்பு அல்லது HTTP/S இணைப்பை உள்ளிடவும்

# torrent_list_empty
source: No torrents
ta: இல்லை தொந்தரவுகள்

# select_or_add_torrent
source: Select or add a torrent
ta: ஒன்றைத் தேர்ந்தெடுக்கவும் அல்லது சேர்க்கவும்

# error_empty_link
source: Enter the link
ta: இணைப்பை உள்ளிடவும்

# error_invalid_link
source: Invalid link
ta: தவறான இணைப்பு

# error_open_torrent_file
source: Cannot open the .torrent file
ta: டோரண்ட் கோப்பை திறக்க முடியவில்லை

# error_open_ip_filter_file
source: Cannot open the IP filter file
ta: ஐபி வடிகட்டி கோப்பைத் திறக்க முடியாது

# error_select_folder
source: Cannot open the selected folder
ta: தேர்ந்தெடுக்கப்பட்ட கோப்புறையைத் திறக்க முடியாது

source: Open file
ta: கோப்பை திற

source: Settings
ta: அமைப்புகள்

# ip_filter_add_error
source: Could not add IP filter (%1$d failed). Maybe the file is damaged or in the wrong format?
ta: ஐபி வடிப்பான் சேர்க்க முடியவில்லை (%1$d தோல்வியுற்றது). ஒருவேளை கோப்பு சிதைந்துள்ளது அல்லது தவறான வடிவமைப்பு உள்ளது?

# ip_filter_add_success
source: IP filter added
ta: ஐபி வடிகட்டி சேர்க்கப்பட்டது

# proxy_settings_applied
source: Using the new proxy server settings.
ta: புதிய பதிலாள் சேவையக அமைப்புகளைப் பயன்படுத்துதல்.

# proxy_settings_apply_after_reboot
source: Restart the app to use the new proxy settings.
ta: புதிய பதிலாள் அமைப்புகளைப் பயன்படுத்த பயன்பாட்டை மறுதொடக்கம் செய்யுங்கள்.

# theme_settings_apply_after_reboot
source: Restart the app to use the new theme.
ta: புதிய தீம் பயன்படுத்த செயலியை மறுதொடக்கம் செய்.

# apply_settings_after_reboot
source: Changes will be applied after restarting the app.
ta: பயன்பாட்டை மறுதொடக்கம் செய்த பிறகு மாற்றங்கள் பயன்படுத்தப்படும்.

source: About
ta: பற்றி

# error_open_torrent
source: Unable to open torrent
ta: Torrent ஐ திறக்க முடியவில்லை

# session_stats_dht_nodes
source: DHT nodes: %1$d
ta: DHT கணுக்கள்:%1$d

# session_stats_listen_port
source: Listening port: %1$s
ta: கேட்கும் துறை:%1$s

# drawer_status
source: Status
ta: நிலை

# drawer_status_downloading
source: Downloading…
ta: பதிவிறக்குகிறது…

# drawer_status_downloaded
source: Downloaded
ta: பதிவிறக்கம் செய்யப்பட்டது

# drawer_status_downloading_metadata
source: Downloading metadata…
ta: மெட்டாடேட்டாவைப் பதிவிறக்குகிறது…

# drawer_status_error
source: Error
ta: பிழை

# drawer_sorting
source: Sorting
ta: வரிசைப்படுத்துதல்

# drawer_sorting_name
source: Name
ta: பெயர்

# drawer_sorting_date_added
source: Date added
ta: தேதி சேர்க்கப்பட்டது

# drawer_sorting_size
source: Size
ta: அளவு

# drawer_sorting_progress
source: Progress
ta: முன்னேற்றம்

# drawer_sorting_ETA
source: ETA
ta: மற்றும்

# drawer_sorting_peers
source: Popularity
ta: புகழ்

# drawer_sorting_no_sorting
source: No sorting
ta: வரிசையாக்கம் இல்லை

# drawer_date_added
source: Date added
ta: தேதி சேர்க்கப்பட்டது

# drawer_date_added_today
source: Today
ta: இன்று

# drawer_date_added_yesterday
source: Yesterday
ta: நேற்று

# drawer_date_added_week
source: Week
ta: வாரம்

# drawer_date_added_month
source: Month
ta: மாதம்

# drawer_date_added_year
source: Year
ta: ஆண்டு

source: Tags
ta: குறிச்சொற்கள்

source: Add tag
ta: குறிச்சொல்லைச் சேர்

source: Edit tag
ta: குறிச்சொல்லைத் திருத்து

source: Tag name
ta: குறிச்சொல் பெயர்

source: Tag color
ta: குறிச்சொல் நிறம்

# add_tag_failed
source: Could not add tag
ta: குறிச்சொல்லைச் சேர்ப்பதில் தோல்வி

# tag_deleting_failed
source: Could not delete tag
ta: குறிச்சொல்லை நீக்குவதில் தோல்வி

# tag_already_exists
source: This tag already exists
ta: குறிச்சொல் ஏற்கனவே உள்ளது

source: No tags
ta: குறிச்சொற்கள் இல்லை

source: Select tag
ta: குறிச்சொல்லைத் தேர்ந்தெடுக்கவும்

source: New tag
ta: புதிய குறிச்சொல்

source: Without tags
ta: குறிச்சொற்கள் இல்லாமல்

# foreground_notify_template
source: ↓ %1$s/s | ↑ %2$s/s • %3$s
ta: 1 %1$s/s | 2 %2$s/s • %3$s

# seeding_torrent_notify_template
source: %1$s • ↑ %2$s/s • %3$s
ta: %1$s • த்தி 2 $ s/s • %3$s

# torrent_count_notify_template
source: %1$d ⬇ of %2$d
ta: பதிவிறக்குகிறது: %1$d ⬇ இல் %2$d

# app_running_in_the_background
source: Running in the background…
ta: பின்புலத்தில் இயங்குகிறது…

# network_online
source: Online
ta: ஆன்லைன்

# network_offline
source: Offline
ta: ஆஃப்லைன்

# notify_shutting_down
source: Shutting down…
ta: நிறுத்துதல்…

# torrent_error_notify_title
source: Torrent error
ta: டோரண்ட் பிழை

# error_template
source: Error: %1$s
ta: பிழை: %1$s

# restore_torrent_error
source: Cannot restore torrent from previous session.
ta: முந்தைய அமர்விலிருந்து டொரெண்டை மீட்டெடுக்க முடியாது.

# session_error_title
source: Session error
ta: அமர்வு பிழை

# nat_error_title
source: NAT error
ta: NAT பிழை

# torrent_finished_notify
source: Torrent finished
ta: டொரண்ட் முடிந்தது

# torrent_moving_title
source: Moving torrent…
ta: நகரும் torrent…

# torrent_moving_content
source: Please wait while moving %1$s…
ta: தயவுசெய்து காத்திருங்கள், %1$s ஐ நகர்த்துகிறது…

# torrent_move_success
source: Torrent moved
ta: டோரண்ட் நகர்ந்தார்

# torrent_move_fail
source: Could not move torrent
ta: Torrent நகர்த்த முடியவில்லை

# download_upload_speed_template
source: ↓ %1$s/s | ↑ %2$s/s
ta: 1 %1$s/s | 2 %2$s/s

# torrent_status_downloading
source: Downloading…
ta: பதிவிறக்குகிறது…

# torrent_status_seeding
source: Seeding…
ta: விதைப்பு…

# torrent_status_paused
source: Paused
ta: இடைநிறுத்தப்பட்டது

# torrent_status_stopped
source: Stopped
ta: நிறுத்தப்பட்டது

# torrent_status_checking
source: Checking…
ta: சரிபார்க்கிறது…

# torrent_status_finished
source: Finished
ta: முடிந்தது

# torrent_status_downloading_metadata
source: Downloading metadata…
ta: மெட்டாடேட்டாவைப் பதிவிறக்குகிறது…

# perm_denied_title
source: Permission denied
ta: அனுமதி மறுக்கப்பட்டது

# perm_denied_warning
source: Storage permission is required to download torrents and access .torrent files. Do you really want to deny this permission?
ta: டொரண்ட்ச் மற்றும் அணுகல் .torrent கோப்புகளைப் பதிவிறக்குவதற்கு சேமிப்பக இசைவு தேவை. இந்த அனுமதியை நீங்கள் உண்மையில் மறுக்க விரும்புகிறீர்களா?

# manage_all_files_warning_dialog_title
source: Warning
ta: எச்சரிக்கை

# manage_all_files_warning_dialog_description
source: Don't use the Google Play version of LibreTorrent if you want to save torrents in folders other than 'Downloads' and similar. There are other sources on the project page.
ta: 'பதிவிறக்கங்கள்' தவிர வேறு கோப்புறைகளில் டோரண்டுகளை சேமிக்க விரும்பினால், லிப்ரெட்டோரண்டின் கூகிள் பிளே பதிப்பைப் பயன்படுத்த வேண்டாம். திட்ட பக்கத்தில் பிற ஆதாரங்கள் உள்ளன.

# add_torrent_title
source: Add torrent
ta: Torrent ஐ சேர்க்கவும்

# error_decode_torrent
source: Could not decode .torrent file. Maybe it is damaged or in the wrong format?
ta: டிரான்டிங் டிராண்ட் கோப்பு தோல்வியடைந்தது. ஒருவேளை கோப்பு சிதைந்திருக்கலாம் அல்லது தவறான வடிவமைப்பில் இருக்கலாம்?

# error_io_torrent
source: Could not read the .torrent file
ta: டோரண்ட் கோப்பை படிக்க முடியவில்லை

# error_fetch_link
source: Could not fetch data from the link
ta: இணைப்பிலிருந்து தரவைப் பெற முடியவில்லை

# error_fetch_torrent_metadata
source: Could not fetch metadata
ta: மேனிலை தரவு பெற முடியவில்லை

# error_invalid_link_or_path
source: Invalid link or torrent path
ta: தவறான இணைப்பு அல்லது டொரண்ட் பாதை

# error_add_torrent
source: Could not add the torrent
ta: நீரோட்டத்தைச் சேர்க்க முடியவில்லை

# error_file_not_found_add_torrent
source: Could not add the torrent. Maybe the .torrent file moved, or got deleted?
ta: வேகத்தை சேர்க்க முடியவில்லை. ஒருவேளை torrent கோப்பு நகர்த்தப்பட்டது அல்லது நீக்கப்பட்டது?

# error_io_add_torrent
source: Cannot add the torrent due to an I/O error.
ta: I/O பிழை காரணமாக நீரோட்டத்தைச் சேர்க்க முடியாது.

# torrent_exist
source: Since the torrent already exists they were merged.
ta: டொரண்ட் ஏற்கனவே இருப்பதால் அவை ஒன்றிணைக்கப்பட்டன.

# error_field_required
source: Required field
ta: தேவைப்படும் தகவல்

# error_no_files_selected
source: No files selected
ta: கோப்புகள் எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# free_space
source: %1$s free
ta: %1$s இலவசம்

# error_free_space
source: Not enough free space there to download the selected files.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்புகளைப் பதிவிறக்குவதற்கு போதுமான இலவச இடம் இல்லை.

# files_size
source: %1$s of %2$s selected
ta: %1$s %2$s தேர்ந்தெடுக்கப்பட்டது

source: Start torrent
ta: Torrent ஐத் தொடங்குங்கள்

# file_is_too_large_error
source: File too large
ta: கோப்பு மிகப் பெரியது

# unable_to_open_folder
source: Cannot open the selected folder. Try selecting a different one.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்புறையைத் திறக்க முடியாது. வேறு ஒன்றைத் தேர்ந்தெடுக்க முயற்சிக்கவும்.

# error_empty_name
source: Enter a name
ta: ஒரு பெயரை உள்ளிடவும்

# ignore_free_space
source: Ignore low storage space
ta: குறைந்த சேமிப்பு இடத்தை புறக்கணிக்கவும்

# download_first_last_pieces
source: Download first and last pieces first
ta: முதல் மற்றும் கடைசி பாகங்களை முதலில் தரவிறக்கவும்

# torrent_info
source: Info
ta: தகவல்

# torrent_files
source: Files
ta: கோப்புகள்

# torrent_name
source: Name
ta: பெயர்

# upload_torrent_into
source: Upload into…
ta: பதிவேற்றவும்…

# torrent_size
source: Size
ta: அளவு

# torrent_file_count
source: File count
ta: கோப்பு எண்ணிக்கை

# torrent_hash_sum
source: Checksum
ta: செக்சம்

# torrent_comment
source: Comment
ta: கருத்து

# torrent_create_date
source: Created
ta: உருவாக்கப்பட்டது

# torrent_created_in_program
source: Created in program
ta: நிரலில் உருவாக்கப்பட்டது

source: Sequential download
ta: தொடர்ச்சியான பதிவிறக்க

# dir_chooser_title
source: Folder selection
ta: அடைவு தேர்வு

# file_chooser_title
source: File selection
ta: கோப்பு தேர்வு

# torrent_file_chooser_title
source: Torrent selection
ta: டோரண்ட் தேர்வு

# dialog_new_folder_title
source: New folder
ta: புதிய அடைவை

# error_dialog_new_folder
source: Could not create new folder
ta: புதிய கோப்புறையை உருவாக்க முடியவில்லை

# error_open_dir
source: Could not open the folder
ta: கோப்புறையைத் திறக்க முடியவில்லை

# home_directory
source: Home
ta: முகப்பு

source: Go to folder
ta: கோப்புறைக்குச் செல்லுங்கள்

# internal_storage_name
source: Internal storage
ta: உள் சேமிப்பு

# external_storage_name
source: External storage %1$d
ta: வெளிப்புற சேமிப்பு %1$d

source: Permission denied
ta: அனுமதி மறுக்கப்பட்டது

source: Save file
ta: கோப்பை சேமி

source: Filename
ta: கோப்புப்பெயர்

# error_file_exists
source: The file already exists
ta: கோப்பு ஏற்கனவே உள்ளது

# file_name_is_empty
source: Enter a filename first
ta: கோப்பு பெயரை முதலில் உள்ளிடவும்

source: Replace file
ta: கோப்பை மாற்றவும்

source: Parent folder
ta: பெற்றோர் கோப்புறை

source: Report
ta: அறிக்கை

source: More details
ta: கூடுதல் தகவல்கள்

# file_downloading_status_template
source: %1$s • %2$s/%3$s • %4$d%% • Availability: %5$s
ta: %1$s • %2$s/%3$s • %4$d%% • கிடைக்கக்கூடியதாக்கல்: %5$s

# file_priority_normal
source: Normal
ta: இயல்பான

# file_priority_low
source: Ignore
ta: புறக்கணி

# file_priority_high
source: High
ta: உயர்

# file_priority_mixed
source: Mixed
ta: கலப்பு

# change_priority
source: Priority
ta: முன்னுரிமை

# dialog_change_priority_title
source: Change priority
ta: முன்னுரிமை மாற்றவும்

# change_priority_low
source: Low (ignore file)
ta: குறை (கோப்பு புறக்கணிக்க)

# change_priority_normal
source: Normal
ta: இயல்பான

# change_priority_high
source: High
ta: உயர்

# torrent_state
source: State
ta: நிலை

# torrent_speed
source: Speed
ta: வேகம்

# torrent_downloaded
source: Downloaded
ta: பதிவிறக்கியவை

# torrent_ETA
source: ETA
ta: எ.ப.நே

# torrent_seeds
source: Seeds
ta: விதைகள்

# torrent_peers
source: Peers
ta: சகாக்கள்

# torrent_leechers
source: Leechers
ta: லீச்சர்கள்

# torrent_uploaded
source: Uploaded
ta: பதிவேற்றிய

# torrent_share_ratio
source: Share ratio
ta: பகிர்வு விகிதம்

# torrent_active_time
source: Active time
ta: செயலில் நேரம்

# torrent_seeding_time
source: Seeding time
ta: விதைக்கும் நேரம்

# torrent_pieces
source: Pieces
ta: துண்டுகளும்

# torrent_trackers
source: Trackers
ta: டிராக்கர்ஸ்

# tracker_state_working
source: Working
ta: வேலை

# tracker_state_not_working
source: Not working
ta: வேலை செய்யவில்லை

# tracker_state_updating
source: Updating…
ta: புதுப்பிக்கிறது…

# tracker_state_not_contacted
source: Not contacted yet
ta: இதுவரை தொடர்பு கொள்ளப்படவில்லை

# share_tracker_url
source: Share URL…
ta: URL ஐப் பகிர்…

source: Delete selected tracker?
ta: தேர்ந்தெடுக்கப்பட்ட டிராக்கரை நீக்கவா?

source: Delete selected trackers?
ta: தேர்ந்தெடுக்கப்பட்ட டிராக்கர்களை நீக்கவா?

source: Add trackers
ta: டிராக்கர்ஸ் சேர்க்கவும்

# dialog_add_trackers
source: (One per line)
ta: (வரிக்கு ஒன்று)

source: Open using
ta: பயன்படுத்தி திறக்க

# peer_port
source: Port: %1$d
ta: போர்ட்:%1$d

# peer_relevance
source: Relevance: %1$.1f
ta: பொருத்தம்:%1$.1f

# peer_connection_type
source: Connection: %1$s
ta: இணைப்பு:%1$s

# peer_total_download_upload
source: ↓ %1$s • ↑ %2$s
ta: 1 %1$s • த்தி 2 $ s

# peer_client
source: Client: %1$s
ta: கிளையண்ட்:%1$s

# peer_connection_type_bittorrent
source: BT
ta: பிடி

# peer_connection_type_web
source: Web
ta: வலை

# peer_list_empty
source: This torrent has not connected to anyone yet
ta: இந்த நீரோடை இதுவரை யாருடனும் இணைக்கப்படவில்லை

# piece_map
source: Pieces map
ta: துண்டு வரைபடம்

# resume_torrent
source: Resume
ta: தற்குறிப்பு

# pause_torrent
source: Pause
ta: இடைநிறுத்தம்

source: Share magnet
ta: பகிர்வு காந்தம்

source: Save torrent file
ta: Torrent கோப்பை சேமி

# torrent_speed_limit
source: Speed limit
ta: வேக வரம்பு

source: Share via…
ta: வழியாக பகிர்…

# save_torrent_file_successfully
source: .torrent file saved
ta: .Torrent கோப்பு சேமிக்கப்பட்டது

# error_save_torrent_file
source: Could not save torrent file
ta: டொரண்ட் கோப்பை சேமிக்க முடியவில்லை

# speed_limit_title
source: Max speed
ta: அதிகபட்ச வேகம்

# upload_speed
source: Upload
ta: பதிவேற்றம்

# download_speed
source: Download
ta: பதிவிறக்க

# speed_limit_dialog
source: Set speed in KiB/s (0 - without limit)
ta: KiB / s இல் வேகத்தை அமைக்கவும் (0 - வரம்பு இல்லாத)

# torrent_speed_limit_dialog
source: Set speed in KiB/s. Note that setting a higher limit on a torrent then the global limit will not override the global limit.
ta: KIB/s இல் வேகத்தை அமைக்கவும். ஒரு நீரோட்டத்திற்கு அதிக வரம்பை நிர்ணயிப்பது பின்னர் உலக வரம்பு உலக வரம்பை மீறாது என்பதை நினைவில் கொள்க.

# torrent_added_date
source: Added
ta: சேர்க்கப்பட்டது

# torrent_availability
source: Availability
ta: கிடைக்கும்

source: Share stream URL…
ta: ஸ்ட்ரீம் URL ஐப் பகிர்…

# magnet_include_file_priorities
source: Include file priorities?
ta: கோப்பு முன்னுரிமைகள் அடங்கும்?

# magnet_more_about_bep53
source: More info at https://www.bittorrent.org/beps/bep_0053.html
ta: மேலும் செய்தி https://www.bittorrent.org/beps/bep_0053.html இல்

# tracker_list_empty
source: No trackers
ta: டிராக்கர்கள் இல்லை

source: Edit torrent name
ta: டொரண்ட் பெயரைத் திருத்து

# send_text_to_clipboard
source: Copy
ta: நகல்

# text_copied_to_clipboard
source: Copied to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது

# app_error_occurred
source: An app error occurred. You can report it to the developers.
ta: பயன்பாட்டு பிழை ஏற்பட்டது. நீங்கள் அதை டெவலப்பர்களிடம் புகாரளிக்கலாம்.

# error_comment_prompt
source: Add extra info and comments here:
ta: கூடுதல் செய்தி மற்றும் கருத்துகளை இங்கே சேர்க்கவும்:

# feed
source: RSS
ta: ஆர்எஸ்எஸ்

# feed_channel_list_empty
source: No channels
ta: சேனல்கள் இல்லை

# select_or_add_feed_channel
source: Select or add an RSS/Atom channel
ta: ஒரு RSS/Atom சேனலைத் தேர்ந்தெடுக்கவும் அல்லது சேர்க்கவும்

# add_feed_channel
source: Add channel
ta: சேனலைச் சேர்க்கவும்

# feed_name
source: (Optional) name
ta: (விரும்பினால்) பெயர்

# feed_filter_prompt
source: Enter the words (separated by "|"), one of which must be in the name, or enter a regular expression. Torrents are only added if this filter matches the torrent name.
ta: சொற்களை உள்ளிடவும் ("|" ஆல் பிரிக்கப்பட்டுள்ளது), அவற்றில் ஒன்று பெயரில் இருக்க வேண்டும் அல்லது வழக்கமான வெளிப்பாட்டை உள்ளிடவும். இந்த வடிகட்டி டொரண்ட் பெயருடன் பொருந்தினால் மட்டுமே டொரண்ட்ச் சேர்க்கப்படும்.

# feed_filter_prompt_one_per_line
source: Enter one filter per line.
ta: ஒரு வரிக்கு ஒரு வடிகட்டியை உள்ளிடவும்.

# feed_auto_download
source: Auto-download torrents
ta: ஆட்டோ-டவுன்லோட் டொரண்ட்கள்

# feed_use_regex
source: Use regular expression
ta: வழக்கமான வெளிப்பாட்டை பயன்படுத்தவும்

# backup_feed_channels
source: Save backup
ta: காப்புப்பிரதியைச் சேமிக்கவும்

# restore_feed_channels_backup
source: Restore backup
ta: காப்புப்பிரதியை மீட்டமை

# feed_last_update_template
source: Updated: %1$s
ta: புதுப்பிக்கப்பட்டது: %1$s

# feed_last_update_never
source: never
ta: ஒருபோதும்

# error_cannot_add_channel
source: Cannot add channel
ta: சேனலைச் சேர்க்க முடியாது

# error_cannot_edit_channel
source: Cannot edit channel
ta: சேனலைத் திருத்த முடியாது

# error_cannot_delete_channel
source: Cannot delete channel
ta: சேனலை நீக்க முடியாது

source: Copy link
ta: இணைப்பை நகலெடு

source: Delete selected channel?
ta: தேர்ந்தெடுக்கப்பட்ட சேனலை நீக்கவா?

source: Delete selected channels?
ta: தேர்ந்தெடுக்கப்பட்ட சேனல்களை நீக்கவா?

# edit_feed_channel
source: Edit channel
ta: சேனலைத் திருத்தவும்

# link_copied_to_clipboard
source: Copied to clipboard
ta: கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டது

source: Mark as read
ta: படித்ததாக

source: Mark as unread
ta: படிக்காதது என்று குறி

# feed_item_list_empty
source: No articles
ta: கட்டுரைகள் இல்லை

# backup_feeds_successfully
source: Channels saved
ta: சேனல்கள் சேமிக்கப்பட்டன

# restore_feeds_backup_successfully
source: Channels restored
ta: சேனல்கள் மீட்டமைக்கப்பட்டன

# error_backup_feeds
source: Could not save channels
ta: சேனல்களைச் சேமிக்க முடியவில்லை

# error_restore_feeds_backup
source: Could not restore channels
ta: சேனல்களை மீட்டெடுக்க முடியவில்லை

# feed_item_open_article_url
source: Open article
ta: திறந்த கட்டுரை

# feeds_backup_selection_dialog_title
source: Select backup file
ta: காப்பு கோப்பைத் தேர்ந்தெடுக்கவும்

# error_import_invalid_format
source: Invalid format
ta: தவறான வடிவம்

# feed_do_not_download_immediately
source: Do not download immediately
ta: உடனடியாக பதிவிறக்க வேண்டாம்

# feed_download_immediately
source: Download immediately
ta: உடனடியாக பதிவிறக்கவும்

# feed_item_url_not_found
source: URL not found
ta: URL கிடைக்கவில்லை

source: Create torrent
ta: Torrent ஐ உருவாக்கவும்

# creating_torrent_progress
source: Please wait while the torrent is created…
ta: டொரண்ட் உருவாக்கப்படும்போது தயவுசெய்து காத்திருங்கள்…

# file_or_folder_for_seeding
source: File or folder to seeding
ta: விதைப்புக்கு கோப்பு அல்லது கோப்புறை

# error_please_select_file_or_folder_for_seeding_first
source: Select a file or folder to seeding first.
ta: முதலில் விதைப்பதற்கு ஒரு கோப்பு அல்லது கோப்புறையைத் தேர்ந்தெடுக்கவும்.

source: Tracker URLs
ta: டிராக்கரின் URL கள்

source: Web-seed URLs
ta: வலை விதை முகவரி கள்

source: Comments
ta: கருத்துக்கள்

# tracker_urls_hint
source: (Optional) enter one tracker per line in order of priority.
ta: (விரும்பினால்) முன்னுரிமையின் வரிசையில் ஒரு வரிக்கு ஒரு டிராக்கரை உள்ளிடவும்.

# web_seed_urls_hint
source: (Optional) one per line
ta: (விரும்பினால்) ஒரு வரிக்கு ஒன்று

# optional_hint
source: (Optional)
ta: (விரும்பினால்)

source: Piece size
ta: பீஸ் அளவு

source: Torrent version
ta: டொரண்ட் பதிப்பு

# create_torrent_options
source: Options
ta: விருப்பங்கள்

# option_start_seeding
source: Start seeding
ta: விதைக்கத் தொடங்குங்கள்

# option_private_torrent
source: Private torrent
ta: தனியார் டோரண்ட்

# piece_size_entries_0
source: Auto
ta: ஆட்டோ

# piece_size_entries_2
source: 32 KiB
ta: 32 சிஐபி

# piece_size_entries_3
source: 64 KiB
ta: 64 சிஐபி

# piece_size_entries_4
source: 128 KiB
ta: 128 சிஐபி

# piece_size_entries_5
source: 256 KiB
ta: 256 குளிர்காலம்

# piece_size_entries_6
source: 512 KiB
ta: 512 சிஐபி

# torrent_version_entries_hybrid
source: Hybrid
ta: கலப்பினம்

# torrent_version_entries_v1_only
source: V1 only
ta: வி 1 மட்டும்

# torrent_version_entries_v2_only
source: V2 only
ta: வி 2 மட்டும்

# invalid_url
source: Invalid URL: %1$s
ta: தவறான URL: %1$s

# folder_is_empty
source: The selected folder is empty or all its files are excluded by the filter.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்புறை காலியாக உள்ளது அல்லது அதன் அனைத்து கோப்புகளும் வடிகட்டியால் விலக்கப்படுகின்றன.

# error_create_torrent
source: Could not create torrent
ta: டொரெண்டை உருவாக்க முடியவில்லை

source: Skip files
ta: கோப்புகளை தவிர்

# skip_files_hint
source: Enter filenames separated by "|"
ta: "|" ஆல் பிரிக்கப்பட்ட கோப்பு பெயர்களை உள்ளிடவும்

# select_folder_to_save
source: Select a folder to save
ta: சேமிக்க ஒரு கோப்புறையைத் தேர்ந்தெடுக்கவும்

# torrent_saved_to
source: Torrent saved to %1$s
ta: %1$s இல் டொரண்ட் சேமிக்கப்பட்டது

# unable_to_open_file
source: Could not open selected file
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பைத் திறக்க முடியவில்லை

# unable_to_create_file
source: Could not create file
ta: கோப்பை உருவாக்க முடியவில்லை

# log_journal
source: Journal
ta: இதழ்

# journal_list_empty
source: No entries
ta: உள்ளீடுகள் இல்லை

# journal_start_recording
source: Start recording
ta: பதிவு செய்யத் தொடங்குங்கள்

# journal_stop_recording
source: Stop recording
ta: பதிவு செய்வதை நிறுத்துங்கள்

# journal_started_recording
source: Started recording
ta: பதிவு செய்யத் தொடங்கியது

# journal_filter_session_log
source: Session log
ta: அமர்வு பதிவு

# journal_filter_dht_log
source: DHT log
ta: DHT பதிவு

# journal_filter_peer_log
source: Connection log
ta: இணைப்பு பதிவு

# journal_filter_portmap_log
source: UPnP/NAT-PMP log
ta: UPnP / NAT-PMP பதிவு

# journal_filter_torrent_log
source: Torrent log
ta: டொரண்ட் பதிவு

# journal_save_log_failed
source: Could not save log
ta: பதிவைச் சேமிக்க முடியவில்லை

# journal_save_log_success
source: Log saved: %1$s
ta: பதிவு சேமிக்கப்பட்டது: %1$s
