Repository: 247i/TACETr
Catalog: உரை/தானி/libresudoku-strings-*.po
Languages: ta

# stat_time_best
source: Best: %1$s
ta: சிறந்தது: %1$s

# pref_date_format_custom
source: Custom date format
ta: தனிப்பயன் தேதி வடிவம்

# pref_date_format_custom_summ
source: Enter date pattern according to Java DateTimeFormatter
ta: சாவா டேட் டைம்ஃபார்மேட்டரின் படி தேதி முறையை உள்ளிடவும்

# pref_date_format_custom_textfield_label
source: Pattern
ta: முறை

# pref_date_format_custom_label
source: Custom
ta: தனிப்பயன்

# theme_blue
source: Blue
ta: நீலம்

source: Redo
ta: மீண்டும்செய்

# backup_restore_title
source: Backup & restore
ta: காப்புப்பிரதி மற்றும் மீட்டமை

# action_create_backup
source: Backup
ta: காப்புப்பிரதி

# create_backup_description
source: Create backup file
ta: காப்புப்பிரதி கோப்பை உருவாக்கவும்

# action_restore
source: Restore
ta: மீட்டமை

# restore_description
source: Restore your backup from file
ta: கோப்பிலிருந்து உங்கள் காப்புப்பிரதியை மீட்டெடுக்கவும்

# creating_backup_error
source: Backup failed
ta: காப்புப்பிரதி தோல்வியடைந்தது

# save_backup_error
source: Failed to save backup file
ta: காப்பு கோப்பை சேமிப்பதில் தோல்வி

# save_backup_success
source: Backup saved
ta: காப்புப்பிரதி சேமிக்கப்பட்டது

# restoring_backup
source: Restoring
ta: மீட்டமைத்தல்

# restore_backup_error
source: Restoring failed
ta: மீட்டமைப்பது தோல்வியடைந்தது

# restore_backup_success
source: Backup restored
ta: காப்புப்பிரதி மீட்டெடுக்கப்பட்டது

# backup_restore_settings
source: Restore settings
ta: அமைப்புகளை மீட்டெடுங்கள்

# auto_backups
source: Automatic backups
ta: தானியங்கி காப்புப்பிரதிகள்

# auto_backups_frequency
source: Backup frequency
ta: காப்பு அதிர்வெண்

# auto_backups_directory
source: Backup directory
ta: காப்பு அடைவு

# auto_backups_max
source: Max automatic backups
ta: அதிகபட்ச தானியங்கி காப்புப்பிரதிகள்

# backup_option_games
source: Games and folders
ta: விளையாட்டுகள் மற்றும் கோப்புறைகள்

# backup_option_settings
source: Settings
ta: அமைப்புகள்

# autobackup_never
source: Never
ta: ஒருபோதும்

source: Daily
ta: நாள்தோறும்

source: Every 2 days
ta: ஒவ்வொரு 2 நாட்களுக்கும்

source: Every 5 days
ta: ஒவ்வொரு 5 நாட்களுக்கும்

source: Weekly
ta: வாராந்திர

# every_x_hours
source: Every %1$d hour
ta: ஒவ்வொரு %1$d மணிநேரமும்

# auto_backup_folder_access
source: Folder access for automatic backups
ta: தானியங்கி காப்புப்பிரதிகளுக்கான கோப்புறை அணுகல்

# auto_backup_folder_access_description
source: For automatic backups, you must grant access to a folder. App will create backups in the folder you choose
ta: தானியங்கி காப்புப்பிரதிகளுக்கு, நீங்கள் ஒரு கோப்புறையை அணுக வேண்டும். பயன்பாடு நீங்கள் தேர்ந்தெடுக்கும் கோப்புறையில் காப்புப்பிரதிகளை உருவாக்கும்

# action_grant
source: Grant
ta: மானியம்

# action_create
source: Create
ta: உருவாக்கு

# restore_existing_data_alert
source: Existing data will be deleted!
ta: தற்போதுள்ள தரவு நீக்கப்படும்!

# last_backup_date
source: Most recent backup: %1$s
ta: மிக அண்மைக் கால காப்புப்பிரதி: %1$s

source: Date started
ta: தேதி தொடங்கியது

source: Date last played
ta: கடைசியாக விளையாடிய தேதி

# pref_monet_style
source: Monet style
ta: மோனட் பாணி

# monet_tonalspot
source: Tonal Spot
ta: டோனல் ச்பாட்

# monet_neutral
source: Neutral
ta: நடுநிலை

# monet_vibrant
source: Vibrant
ta: துடிப்பான

# monet_expressive
source: Expressive
ta: வெளிப்படையான

# monet_rainbow
source: Rainbow
ta: ரெயின்போ

# monet_fruitsalad
source: Fruit Salad
ta: பழ சாலட்

# monet_monochrome
source: Monochrome
ta: ஒரே வண்ணமுடைய

# monet_fidelity
source: Fidelity
ta: மெய்நிலை

# monet_content
source: Content
ta: உள்ளடக்கம்

# theme_orange
source: Orange
ta: ஆரஞ்சு

# theme_cyan
source: Cyan
ta: சியான்

# theme_custom
source: Custom
ta: தனிப்பயன்

# color_picker_title
source: Pick a color
ta: ஒரு வண்ணத்தைத் தேர்ந்தெடுங்கள்

# parse_color_fail
source: Not a color
ta: ஒரு நிறம் அல்ல

# onboard_restore_backup
source: Restore backup
ta: காப்புப்பிரதியை மீட்டமைக்கவும்

# onboard_restore_backup_description
source: Do you already have a backup? Restore it now
ta: உங்களிடம் ஏற்கனவே காப்புப்பிரதி இருக்கிறதா? இப்போது அதை மீட்டெடுக்கவும்

# onboard_settings_description
source: Tune the app to your liking
ta: உங்கள் விருப்பப்படி பயன்பாட்டை டியூன் செய்யுங்கள்

# last_x_games
source: Last %1$d game
ta: கடைசி %1$d விளையாட்டு

source: Telegram
ta: தந்தி

# telegram_link
source: Join us on Telegram
ta: டெலிகிராமில் எங்களுடன் சேருங்கள்

# donation_title
source: Donation
ta: நன்கொடை

# donation_description
source: This app is free and ad-free forever. You can support me below
ta: இந்த பயன்பாடு இலவசம் மற்றும் விளம்பரமில்லாதது. நீங்கள் என்னை கீழே ஆதரிக்கலாம்

# crypto_bitcoin
source: Bitcoin
ta: பிட்காயின்

# crypto_ton
source: TON
ta: டன்

# card_mir
source: MIR
ta: மிர்

# app_version
source: Version %1$s (%2$s)
ta: பதிப்பு %1$s ( %2$s)

# hosted_weblate
source: You can help with translation on Hosted Weblate
ta: புரவலன் செய்யப்பட்ட வெப்லேட்டில் மொழிபெயர்ப்புக்கு நீங்கள் உதவலாம்

# perf_appearance_summary
source: Dark theme, color scheme, board theme, date format…
ta: இருண்ட கருப்பொருள், வண்ணத் திட்டம், பலகை கருப்பொருள், தேதி வடிவம்…

# perf_gameplay_summary
source: Input method, mistake limit, timer…
ta: உள்ளீட்டு முறை, தவறான வரம்பு, டைமர்…

# perf_assistance_summary
source: Mistakes checking, highlight identical values, remaining uses…
ta: தவறுகள் சரிபார்க்கிறது, ஒரே மாதிரியான மதிப்புகளை முன்னிலைப்படுத்தவும், மீதமுள்ள பயன்பாடுகளையும்…

# perf_other_summary
source: Remember type and difficulty, keep screen awake, reset stats…
ta: வகை மற்றும் சிரமத்தை நினைவில் கொள்ளுங்கள், திரையை விழித்திருங்கள், புள்ளிவிவரங்களை மீட்டமைக்கவும்…

# pref_board_theme_summary
source: Apply accent colors, position lines, font size…
ta: உச்சரிப்பு வண்ணங்கள், நிலை கோடுகள், எழுத்துரு அளவு ஆகியவற்றைப் பயன்படுத்துங்கள்…

# action_share_crash_log
source: Share crash log
ta: செயலிழப்பு பதிவைப் பகிரவும்

# action_restart_app
source: Restart the app
ta: பயன்பாட்டை மறுதொடக்கம் செய்யுங்கள்

# crash_screen_title
source: Whoops, something went wrong
ta: அச்சச்சோ, ஏதோ தவறு நடந்தது

# action_generate
source: Generate
ta: உருவாக்கு

# generating_number_of
source: Generating %1$s/%2$s
ta: %1$s/ %2$s ஐ உருவாக்குகிறது

# hint_full_house_group_detail
source: The cell %1$s is the last empty cell in this box, so you can fill it with the %2$s
ta: செல் %1$s இந்த பெட்டியின் கடைசி வெற்று செல், எனவே நீங்கள் அதை %2$s உடன் நிரப்பலாம்

# hint_full_house_group_title
source: Full House
ta: முழு வீடு

# hint_naked_single_title
source: Naked single
ta: நிர்வாண ஒற்றை

# hint_naked_single_detail
source: The cell %1$s has only one possible value left, so you can place the %2$s in this cell
ta: செல் %1$s இல் ஒரு சாத்தியமான மதிப்பு மட்டுமே உள்ளது, எனவே நீங்கள் இந்த கலத்தில் %2$s ஐ வைக்கலாம்

# hint_hidden_single_title
source: Hidden single
ta: மறைக்கப்பட்ட ஒற்றை

# hint_hidden_single_detail
source: The cell %1$s is the only cell in this group where %2$s can be
ta: இந்த குழுவில் %2$s இருக்கக்கூடிய ஒரே செல் %1$s மட்டுமே

# advanced_hint_title
source: Advanced hint
ta: மேம்பட்ட குறிப்பு

# hint_wrong_value_title
source: Wrong value
ta: தவறான மதிப்பு

# hint_wron_value_detail
source: The value %1$s in cell %2$s is wrong
ta: செல் %2$s இல் %1$s மதிப்பு தவறானது

# advanced_hint_summary
source: An experimental hint system
ta: ஒரு சோதனை குறிப்பு அமைப்பு

# nav_back
source: Back
ta: பின்

# action_apply
source: Apply
ta: இடு

# advanced_hint_in_development
source: More techniques in development…
ta: வளர்ச்சியில் அதிக நுட்பங்கள்…

# label_beta
source: Beta
ta: பீட்டா

# settings_advanced_hint_category_techniques
source: Techniques
ta: நுட்பங்கள்

# auto_update_title
source: Auto Update
ta: ஆட்டோ புதுப்பிப்பு

# update_whats_new
source: What's new
ta: புதியது என்ன

# action_download
source: Download
ta: பதிவிறக்கம்

# update_found
source: New update found
ta: புதிய புதுப்பிப்பு காணப்பட்டது

# update_channel_stable
source: Stable
ta: நிலையான

# update_channel_stable_summary
source: Get stable tested releases
ta: நிலையான சோதனை வெளியீடுகளைப் பெறுங்கள்

# update_channel_beta
source: Beta
ta: பீட்டா

# update_channel_beta_summary
source: Get beta releases, access new features and fixes first
ta: பீட்டா வெளியீடுகளைப் பெறுங்கள், முதலில் புதிய நற்பொருத்தங்கள் மற்றும் திருத்தங்களை அணுகவும்

# update_channel_disable
source: Disable
ta: முடக்கு

# update_channel_disable_summary
source: Disable automatic updates
ta: தானியங்கி புதுப்பிப்புகளை முடக்கு

# update_found_version
source: Update found %1$s
ta: புதுப்பிப்பு %1$s காணப்பட்டது

# whats_new_in_version
source: What's new in %1$s
ta: %1$s இல் புதியது என்ன

# check_for_updates_error
source: Couldn't check for updates
ta: புதுப்பிப்புகளை சரிபார்க்க முடியவில்லை

# check_for_update_error_summary
source: Check your connection or try again later (GitHub API rate limit may have been exceeded)
ta: உங்கள் இணைப்பைச் சரிபார்க்கவும் அல்லது பின்னர் மீண்டும் முயற்சிக்கவும் (கிதுப் பநிஇ வீத வரம்பு மீறப்பட்டிருக்கலாம்)

# action_retry
source: Retry
ta: மீண்டும் முயற்சிக்கவும்

# check_for_updates_checking
source: Checking for updates…
ta: புதுப்பிப்புகளைச் சரிபார்க்கிறது…

# check_for_update_using_latest
source: You're up to date
ta: நீங்கள் புதுப்பித்த நிலையில் உள்ளீர்கள்

# check_for_update_checking_summary
source: This can take some time
ta: இதற்கு சிறிது நேரம் ஆகலாம்

# check_for_update_latest_summary
source: Keep it up!
ta: அதை வைத்திருங்கள்!

# action_view_on_github
source: View on GitHub
ta: கிட்அப்பில் காண்க

# new_update_found_action
source: Go to settings to update
ta: புதுப்பிக்க அமைப்புகளுக்குச் செல்லவும்

# auto_updates_summary
source: Automatically check for updates
ta: புதுப்பிப்புகளை தானாக சரிபார்க்கவும்

# advanced_hint_no_hint
source: Couldn't get a hint. Maybe it's too hard for us at the moment
ta: ஒரு குறிப்பைப் பெற முடியவில்லை. இந்த நேரத்தில் இது எங்களுக்கு மிகவும் கடினமாக இருக்கலாம்

# advanced_hint_no_hint_title
source: No hint
ta: குறிப்பு இல்லை

# export_empty_cell
source: Empty cell
ta: வெற்று செல்

source: Update channel
ta: சேனலைப் புதுப்பிக்கவும்

# font_size_automatic
source: Automatic
ta: தானியங்கி
