Repository: 247i/TACETr
Catalog: உரை/தானி/libretube-libretube-*.po
Languages: ta

# app_name
source: LibreTube
ta: லிப்ரெட்யூப்

# startpage
source: Home
ta: முகப்பு

source: Subscriptions
ta: சந்தாக்கள்

source: Library
ta: நூலகம்

source: Yes
ta: ஆம்

# search_hint
source: Search
ta: தேடு

source: Videos
ta: கானொளிகள்

source: Subscribe
ta: சந்தாசேர்

source: Unsubscribe
ta: சந்தா நீக்கு

source: Share
ta: பகிர்

source: Download
ta: பதிவிறக்கு

source: Save
ta: சேமி

source: Username
ta: பயனாளி பெயர்

source: Password
ta: கடவுச்சொல்

source: Log in
ta: உள் நுழை

source: Register
ta: பதிவுசெய்

source: Log out
ta: வெளியேறு

source: Cancel
ta: நிராகரி

source: Logged in.
ta: உள்நுழைந்துவிட்டோம்

source: Logged out.
ta: வெளியேறிவிட்டோம்.

# registered
source: Registered. Now you can subscribe to channels.
ta: பதிவுசெய்யப்பட்டது. இப்போது நீங்கள் சேனல்களுக்கு குழுசேரலாம்.

# already_logged_in
source: Already logged in. You may log out of your account.
ta: ஏற்கனவே உள்நுழைந்தது. நீங்கள் உங்கள் கணக்கிலிருந்து வெளியேறலாம்.

# instances
source: Choose…
ta: தேர்ந்தெடு…

# customInstance
source: Custom
ta: தனிப்பயன்

source: Region
ta: பகுதி

source: Log in/register
ta: உள்நுழைக/பதிவு செய்யுங்கள்

# importsuccess
source: Subscribed
ta: சந்தா

# cannotDownload
source: Can't download this stream.
ta: இந்த ச்ட்ரீமை பதிவிறக்கம் செய்ய முடியாது.

source: Download failed.
ta: பதிவிறக்கம் தோல்வியடைந்தது.

# import_from_yt
source: Import subscriptions
ta: சந்தாக்களை இறக்குமதி செய்யுங்கள்

# import_from_yt_summary
source: From YouTube or NewPipe
ta: YouTube அல்லது NewPipe இலிருந்து

# app_theme
source: Theme
ta: கருப்பொருள்

# server_error
source: There seem to be a problem with the selected server. Try another instance.
ta: தேர்ந்தெடுக்கப்பட்ட சேவையகத்தில் சிக்கல் இருப்பதாகத் தெரிகிறது. மற்றொரு நிகழ்வை முயற்சிக்கவும்.

# unknown_error
source: Network error.
ta: பிணைய பிழை.

# error
source: Something went wrong.
ta: ஏதோ தவறு நடந்தது.

# empty
source: You have to enter a username and password.
ta: நீங்கள் ஒரு பயனர்பெயர் மற்றும் கடவுச்சொல்லை உள்ளிட வேண்டும்.

# notgmail
source: This is for a Piped account
ta: இது ஒரு குழாய் கணக்குக்கானது

# defres
source: Video resolution
ta: வீடியோ தீர்மானம்

# grid
source: Grid columns (portrait)
ta: கட்டம் நெடுவரிசைகள் (உருவப்படம்)

# grid_landscape
source: Grid columns (landscape)
ta: கட்டம் நெடுவரிசைகள்

# emptyList
source: Nothing here.
ta: இங்கே எதுவும் இல்லை.

source: Delete playlist
ta: பிளேலிச்ட்டை நீக்கு

# areYouSure
source: Delete the playlist?
ta: பிளேலிச்ட்டை நீக்கவா?

source: Create playlist
ta: பிளேலிச்ட்டை உருவாக்கவும்

source: Playlist created.
ta: பிளேலிச்ட் உருவாக்கப்பட்டது.

source: Playlist name
ta: பிளேலிச்ட் பெயர்

# emptyPlaylistName
source: The playlist name can't be empty
ta: பிளேலிச்ட் பெயர் காலியாக இருக்க முடியாது

source: Add to playlist
ta: பிளேலிச்ட்டில் சேர்க்கவும்

# success
source: Done.
ta: முடிந்தது.

# fail
source: Failed :(
ta: தோல்வியுற்றது :(

source: About
ta: பற்றி

# changeLanguage
source: Language
ta: மொழி

# systemLanguage
source: System
ta: மண்டலம்

# systemDefault
source: System
ta: மண்டலம்

# lightTheme
source: Light
ta: ஒளி

# darkTheme
source: Dark
ta: இருண்ட

# subscribers
source: %1$s subscribers
ta: %1$s சந்தாதாரர்கள்

source: Settings
ta: அமைப்புகள்

source: Location
ta: இடம்

source: Instance
ta: சான்று

# customization
source: Adjustments
ta: சரிசெய்தல்

source: Website
ta: வலைத்தளம்

source: Donate
ta: நன்கொடை

# uploaderAndVideoCount
source: %1$s • %2$d videos
ta: %1$s • %2$d வீடியோக்கள்

# subscriberAndVideoCounts
source: %1$s subscribers • %2$d videos
ta: %1$s சந்தாதாரர்கள் • %2$d வீடியோக்கள்

# videoCount
source: %1$d videos
ta: %1$d வீடியோக்கள்

# noInternet
source: Connect to the Internet first.
ta: முதலில் இணையத்துடன் இணைக்கவும்.

source: Retry
ta: மீண்டும் முயற்சிக்கவும்

source: Comments
ta: கருத்துகள்

# comments_count
source: Comments (%1$s)
ta: கருத்துகள் (%1$s)

source: Replies
ta: பதில்கள்

source: Channels
ta: சேனல்கள்

source: Albums
ta: ஆல்பம்

source: All
ta: அனைத்தும்

source: Playlists
ta: பிளேலிச்ட்கள்

# okay
source: OK
ta: சரி

source: Finished
ta: முடிந்தது

source: History
ta: வரலாறு

source: Search History
ta: தேடல் வரலாறு

source: Clear history
ta: வரலாற்றை அழிக்கவும்

# music_songs
source: YT Music Songs
ta: Yt இசை பாடல்கள்

# music_videos
source: YT Music Videos
ta: YT இசை வீடியோக்கள்

# music_albums
source: YT Music Albums
ta: YT இசை ஆல்பங்கள்

# music_playlists
source: YT Music Playlists
ta: YT மியூசிக் பிளேலிச்ட்கள்

# music_artists
source: YT Music Artists
ta: YT இசை கலைஞர்கள்

source: SponsorBlock
ta: ஒப்புரவாளர் தொகுதி

# sponsorblock_summary
source: Uses the https://sponsor.ajay.app API
ta: Https://sponsor.ajay.app பநிஇ ஐப் பயன்படுத்துகிறது

# segment_skipped
source: Skipped segment
ta: தவிர்க்கப்பட்ட பிரிவு

# category_segments
source: Segments
ta: பிரிவுகள்

# category_sponsor
source: Sponsor
ta: ஒப்புரவாளர்

# category_sponsor_summary
source: Paid promotion, paid referrals and direct advertisements. Not for self-promotion or free genuine shoutouts to causes, creators, websites, and products
ta: கட்டண பதவி உயர்வு, கட்டண பரிந்துரைகள் மற்றும் நேரடி விளம்பரங்கள். காரணங்கள், படைப்பாளிகள், வலைத்தளங்கள் மற்றும் தயாரிப்புகளுக்கு தன்வய விளம்பர அல்லது இலவச உண்மையான கூச்சல்களுக்கு அல்ல

# category_selfpromo
source: Unpaid/Self Promotion
ta: செலுத்தப்படாத/சுய பதவி உயர்வு

# category_selfpromo_summary
source: Similar to "sponsor" except for unpaid or self promotion. This includes sections about merchandise, donations, or info about who they collaborated with
ta: செலுத்தப்படாத அல்லது தன்வய பதவி உயர்வு தவிர "ஒப்புரவாளர்" போன்றது. வணிகப் பொருட்கள், நன்கொடைகள் அல்லது அவர்கள் யாருடன் ஒத்துழைத்தார்கள் என்பது பற்றிய செய்தி இதில் அடங்கும்

# category_interaction
source: Interaction reminder
ta: தொடர்பு நினைவூட்டல்

# category_interaction_summary
source: When there is a short reminder to like, subscribe or follow in the middle of content. If long or about something specific, it should instead be self promotion
ta: உள்ளடக்கத்தின் நடுவில் விரும்ப, குழுசேர அல்லது பின்பற்ற ஒரு குறுகிய நினைவூட்டல் இருக்கும்போது. நீண்ட அல்லது குறிப்பிட்ட ஏதாவது இருந்தால், அது தன்வய பதவி உயர்வாக இருக்க வேண்டும்

# category_intro
source: Intermission/Intro Animation
ta: இடைவெளி/அறிமுக அனிமேசன்

# category_intro_summary
source: An interval without actual content. Could be a pause, static frame, repeating animation. Should not be used for transitions containing info
ta: உண்மையான உள்ளடக்கம் இல்லாத இடைவெளி. இடைநிறுத்தம், நிலையான சட்டகம், மறுநிகழ்வு அனிமேசன் இருக்கலாம். தகவலைக் கொண்ட மாற்றங்களுக்கு பயன்படுத்தக்கூடாது

# category_outro
source: End cards and credits
ta: அட்டைகள் மற்றும் வரவுகளை இறுதி

# category_outro_summary
source: Info following the ending. Not for conclusions with info
ta: முடிவைத் தொடர்ந்து செய்தி. தகவலுடன் முடிவுகளுக்கு அல்ல

# category_filler
source: Filler Tangent/Jokes
ta: நிரப்பு தொடுகோடு/நகைச்சுவைகள்

# category_filler_summary
source: For tangential scenes added only for filler or humor not required to understand the main content of the video
ta: வீடியோவின் முக்கிய உள்ளடக்கத்தைப் புரிந்து கொள்ள நிரப்பு அல்லது நகைச்சுவைக்கு மட்டுமே சேர்க்கப்பட்ட தொடு காட்சிகளுக்கு

# category_music_offtopic
source: Music: Non-Music Section
ta: இசை: இசை அல்லாத பிரிவு

# category_music_offtopic_summary
source: Only for use in music videos. It should cover parts of the video not part of official mixes. In the end, the video should resemble the Spotify or any other mixed version as closely as possible, or reduce talking or other distractions
ta: இசை வீடியோக்களில் மட்டுமே பயன்படுத்த. இது அதிகாரப்பூர்வ கலவைகளின் ஒரு பகுதியாக அல்ல வீடியோவின் பகுதிகளை மறைக்க வேண்டும். முடிவில், வீடியோ ச்பாட்ஃபை அல்லது வேறு எந்த கலப்பு பதிப்பையும் முடிந்தவரை நெருக்கமாக ஒத்திருக்க வேண்டும், அல்லது பேசும் அல்லது பிற கவனச்சிதறல்களைக் குறைக்க வேண்டும்

# category_preview
source: Preview/Recap
ta: முன்னோட்டம்/மறுபரிசீலனை

# category_preview_summary
source: For segments detailing future content without additional info. If it includes clips that only appear here, this is very likely the wrong category
ta: கூடுதல் செய்தி இல்லாமல் எதிர்கால உள்ளடக்கத்தை விவரிக்கும் பிரிவுகளுக்கு. இங்கே மட்டுமே தோன்றும் கிளிப்புகள் இதில் இருந்தால், இது தவறான வகையாகும்

# category_highlight
source: Show video highlight
ta: வீடியோ சிறப்பம்சத்தைக் காட்டு

# category_highlight_summary
source: Could either be the advertised title, the thumbnail or the most interesting part of the video. You can skip to it by tapping on it in the chapters section
ta: விளம்பரப்படுத்தப்பட்ட தலைப்பு, சிறுபடம் அல்லது வீடியோவின் மிகவும் சுவையான பகுதியாக இருக்கலாம். அத்தியாயங்கள் பிரிவில் அதைத் தட்டுவதன் மூலம் அதைத் தவிர்க்கலாம்

# category_exclusive_access
source: Exclusive Access
ta: பிரத்யேக அணுகல்

source: License
ta: உரிமம்

# color_accent
source: Accents
ta: உச்சரிப்புகள்

# color_red
source: Resting red
ta: சிவப்பு ஓய்வெடுக்கும்

# color_blue
source: Blissful blue
ta: ஆனந்தமான நீலம்

# color_yellow
source: Yeeting yellow
ta: மஞ்சள்

# color_green
source: Groovy green
ta: க்ரூவி பச்சை

# color_purple
source: Pleasurable purple
ta: மகிழ்ச்சிகரமான ஊதா

source: Material You
ta: பொருள் நீங்கள்

# sponsorblock_notifications
source: Notifications
ta: அறிவிப்புகள்

# app_icon
source: Icon
ta: படவுரு

# enabled
source: On
ta: ஆன்

# disabled
source: Off
ta: அணை

source: Piped
ta: குழாய்

# playOnBackground
source: Play in the background
ta: பின்னணியில் விளையாடுங்கள்

source: Update available
ta: புதுப்பிப்பு கிடைக்கிறது

# update_available_text
source: New update available. Click to open the GitHub releases page.
ta: புதிய புதுப்பிப்பு கிடைக்கிறது. அறிவிலிமையம் வெளியீடுகள் பக்கத்தைத் திறக்க சொடுக்கு செய்க.

source: Appearance
ta: தோற்றம்

source: Downloads
ta: பதிவிறக்கங்கள்

# update_summary
source: Check for update
ta: புதுப்பிப்புக்கு சரிபார்க்கவும்

# app_uptodate
source: Running the latest version.
ta: அண்மைக் கால பதிப்பை இயக்குகிறது.

source: Playback speed
ta: பின்னணி விரைவு

source: Advanced
ta: மேம்பட்ட

source: Player
ta: வீரர்

# appearance_summary
source: Adjust the app to your liking
ta: உங்கள் விருப்பப்படி பயன்பாட்டை சரிசெய்யவும்

# advanced_summary
source: Downloads, and reset
ta: பதிவிறக்கங்கள், மீட்டமை

source: Live
ta: வாழ

source: Upcoming
ta: வரவிருக்கும்

# shareTo
source: Share URL to
ta: முகவரி ஐ பகிரவும்

# normal_views
source: %1$s views%2$s
ta: %1$s காட்சிகள்%2$s

# defaultIcon
source: Default
ta: இயல்புநிலை

# legacyIcon
source: Lost legacy
ta: இழந்த மரபு

# gradientIcon
source: Glib gradient
ta: கிளிப் சாய்வு

# fireIcon
source: Fashionable fire
ta: நாகரீகமான தீ

# torchIcon
source: Trendy torch
ta: நவநாகரீக டார்ச்

# shapedIcon
source: Silly shaped
ta: வேடிக்கையான வடிவம்

# flameIcon
source: Flying flame
ta: பறக்கும் சுடர்

# birdIcon
source: Boosted bird
ta: பறவை உயர்த்தப்பட்டது

# instance_summary
source: Piped, login, and account
ta: குழாய், உள்நுழைவு மற்றும் கணக்கு

# customInstance_summary
source: Add…
ta: சேர்க்கவும்…

source: Instance name
ta: சான்று பெயர்

# instance_api_url
source: URL to instance API
ta: உதாரணமாக பநிஇ க்கு முகவரி

source: Add Instance
ta: உதாரணத்தை சேர்க்கவும்

# empty_instance
source: Fill in the name and the API URL.
ta: பெயர் மற்றும் பநிஇ முகவரி ஐ நிரப்பவும்.

# clear_customInstances
source: Clear added
ta: கூடுதல் சேர்க்கப்பட்டது

# invalid_url
source: Please enter a URL that works
ta: வேலை செய்யும் முகவரி ஐ உள்ளிடவும்

# version
source: Version %1$s
ta: பதிப்பு %1$s

# show_updates
source: Check updates automatically
ta: புதுப்பிப்புகளை தானாக சரிபார்க்கவும்

# related_streams
source: Related content
ta: தொடர்புடைய உள்ளடக்கம்

# related_streams_summary
source: Show similar streams alongside what you watch
ta: நீங்கள் பார்ப்பதைக் கொண்டு ஒத்த நீரோடைகளைக் காட்டுங்கள்

# buffering_goal
source: Preloading
ta: முன்பே ஏற்றுதல்

# buffering_goal_summary
source: Max. amount of seconds of video to buffer
ta: அதிகபட்சம். இடையகத்திற்கு வீடியோவின் விநாடிகளின் அளவு

# playerVideoFormat
source: Video format for player
ta: பிளேயருக்கான வீடியோ வடிவம்

source: No audio
ta: ஆடியோ இல்லை

source: No video
ta: வீடியோ இல்லை

source: No subtitle
ta: வசன வரிகள் இல்லை

source: Audio
ta: ஆடியோ

source: Video
ta: ஒளிதோற்றம்

source: Downloading…
ta: பதிவிறக்கம்…

source: Download paused
ta: இடைநிறுத்தப்பட்டது

source: Download completed
ta: பதிவிறக்கம் முடிந்தது

# concurrent_downloads
source: Max concurrent downloads
ta: அதிகபட்சம் ஒரே நேரத்தில் பதிவிறக்கங்கள்

# concurrent_downloads_limit_reached
source: Max concurrent downloads limit reached.
ta: அதிகபட்ச ஒரே நேரத்தில் பதிவிறக்கங்கள் வரம்பு எட்டப்பட்டது.

source: Unknown
ta: தெரியவில்லை

source: Pause
ta: இடைநிறுத்தம்

source: Resume
ta: மீண்டும் தொடங்குங்கள்

source: Stop
ta: நிறுத்து

# player_autoplay
source: Autoplay
ta: ஆட்டோபிளே

# instance_frontend_url
source: URL to instance frontend
ta: முகவரி க்கு நிகழ்வு முன்பதிவு

source: Quality
ta: தகுதி

source: Behavior
ta: நடத்தை

# player_summary
source: Defaults and behavior
ta: இயல்புநிலை மற்றும் நடத்தை

source: Seek increment
ta: அதிகரிப்பு தேடுங்கள்

# pauseOnScreenOff
source: Auto-pause
ta: சுய-சரிவு

# pauseOnScreenOff_summary
source: Pause playback when the screen is turned off
ta: திரை அணைக்கப்படும் போது பின்னணி பின்னணி

source: Clone playlist
ta: நகலி பிளேலிச்ட்

# reset
source: Restore defaults
ta: இயல்புநிலைகளை மீட்டெடுங்கள்

# reset_message
source: Reset all settings and log out?
ta: எல்லா அமைப்புகளையும் மீட்டமைத்து வெளியேறவா?

source: Delete account
ta: கணக்கை நீக்கு

# deleteAccount_summary
source: Delete your Piped account
ta: உங்கள் குழாய் கணக்கை நீக்கவும்

source: Account
ta: கணக்கு

source: Restore
ta: மீட்டமை

source: Watch History
ta: வரலாற்றைப் பாருங்கள்

# watch_positions
source: Remember position
ta: நிலையை நினைவில் கொள்க

# auth_instance
source: Authentication instance
ta: அங்கீகார நிகழ்வு

# auth_instance_summary
source: Use a different instance for authenticated calls
ta: அங்கீகரிக்கப்பட்ட அழைப்புகளுக்கு வேறு நிகழ்வைப் பயன்படுத்தவும்

# auth_instances
source: Choose an auth instance
ta: அங்கீகார நிகழ்வைத் தேர்வுசெய்க

source: GitHub
ta: கிரப்

# audio_video
source: Audio and video
ta: ஆடியோ மற்றும் வீடியோ

source: Fullscreen orientation
ta: முழுத்திரை நோக்குநிலை

# aspect_ratio
source: Video aspect ratio
ta: வீடியோ விகித விகிதம்

source: Auto-rotation
ta: ஆட்டோ-சுழற்சி

source: Landscape
ta: நிலப்பரப்பு

source: Portrait
ta: உருவப்படம்

# turnInternetOn
source: Please turn on Wi-Fi or mobile data to connect to the Internet.
ta: இணையத்துடன் இணைக்க வைஃபை அல்லது மொபைல் தரவை இயக்கவும்.

source: Open…
ta: திற…

source: Chapters
ta: பாடங்கள்

# require_restart
source: App restart required
ta: பயன்பாட்டு மறுதொடக்கம் தேவை

# require_restart_message
source: Restart the app to use the new changes.
ta: புதிய மாற்றங்களைப் பயன்படுத்த பயன்பாட்டை மறுதொடக்கம் செய்யுங்கள்.

# navLabelVisibility
source: Label visibility
ta: சிட்டை தெரிவுநிலை

source: Always
ta: எப்போதும்

source: Selected
ta: தேர்ந்தெடுக்கப்பட்டது

source: Never
ta: ஒருபோதும்

# autoRotatePlayer
source: Auto-fullscreen
ta: ஆட்டோ-ஃபுல்ச்கிரீன்

# autoRotatePlayer_summary
source: Fullscreen playback when the device gets turned
ta: சாதனம் திரும்பும்போது முழுத்திரை பின்னணி

source: Pure theme
ta: தூய கருப்பொருள்

# pure_theme_summary
source: Pure white/black theme
ta: தூய வெள்ளை/கருப்பு கருப்பொருள்

# no_player_found
source: No external player found. Please make sure you have one installed.
ta: வெளிப்புற பிளேயர் எதுவும் கிடைக்கவில்லை. நீங்கள் ஒன்றை நிறுவியுள்ளீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: Data-saver mode
ta: தரவு-சேவர் பயன்முறை

# data_saver_mode_summary
source: Skip thumbnails and other images
ta: சிறு உருவங்கள் மற்றும் பிற படங்களைத் தவிர்க்கவும்

# search_history_summary
source: Remember searches
ta: தேடல்களை நினைவில் கொள்க

# watch_history_summary
source: Keep track of watched videos locally
ta: பார்த்த வீடியோக்களை உள்நாட்டில் கண்காணிக்கவும்

# history_summary
source: Watch and search history
ta: வரலாற்றைப் பார்த்து தேடல்

# watch_positions_title
source: Remembered playback positions
ta: நினைவுகூரப்பட்ட பின்னணி நிலைகள்

# reset_watch_positions
source: Reset
ta: மீட்டமை

source: System caption style
ta: கணினி தலைப்பு பாணி

source: Rich caption rendering
ta: பணக்கார தலைப்பு வழங்குதல்

# rich_caption_rendering_summary
source: Render web captions for a more rich and customized experience
ta: மிகவும் பணக்கார மற்றும் தனிப்பயனாக்கப்பட்ட அனுபவத்திற்கு வலை தலைப்புகளை வழங்கவும்

source: Captions
ta: தலைப்புகள்

source: None
ta: எதுவுமில்லை

source: General
ta: பொது

# general_summary
source: Language, and region
ta: மொழி, மற்றும் பகுதி

# playingOnBackground
source: Playing in the background…
ta: பின்னணியில் விளையாடுவது…

# caption_settings
source: Captions
ta: தலைப்புகள்

# playerAudioFormat
source: Audio format for player
ta: பிளேயருக்கான ஆடியோ வடிவம்

# playerAudioQuality
source: Audio quality
ta: ஆடியோ தகுதி

# worst_quality
source: Worst
ta: மோசமான

# best_quality
source: Best
ta: சிறந்த

# default_subtitle_language
source: Subtitle language
ta: வசன மொழி

source: Notifications
ta: அறிவிப்புகள்

# notify_new_streams
source: Show notifications for new streams
ta: புதிய நீரோடைகளுக்கான அறிவிப்புகளைக் காட்டு

# notify_new_streams_summary
source: Display notifications for new streams from creators you follow
ta: நீங்கள் பின்பற்றும் படைப்பாளர்களிடமிருந்து புதிய ச்ட்ரீம்களுக்கான அறிவிப்புகளைக் காண்பி

source: Show stream thumbnails
ta: ச்ட்ரீம் சிறுபடங்களைக் காட்டு

# show_stream_thumbnails_summary
source: Show the thumbnails of new streams. Enabling this will consume additional data
ta: புதிய நீரோடைகளின் சிறு உருவங்களைக் காட்டு. இதை செயல்படுத்துவது கூடுதல் தரவை நுகரும்

# checking_frequency
source: Checking every …
ta: ஒவ்வொன்றையும் சரிபார்க்கிறது…

# irreversible
source: Are you sure? This can't be undone!
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா? இதை செயல்தவிர்க்க முடியாது!

# history_empty
source: No history yet.
ta: இன்னும் வரலாறு இல்லை.

# most_recent
source: Newest
ta: புதியது

# least_recent
source: Oldest
ta: பழமையானது

source: Most views
ta: பெரும்பாலான பார்வைகள்

source: Least views
ta: குறைந்த காட்சிகள்

# required_network
source: Required connection
ta: தேவையான இணைப்பு

# network_all
source: All
ta: அனைத்தும்

# network_metered
source: Metered
ta: அளவிடப்பட்ட

# network_wifi
source: Only on Wi-Fi
ta: வைஃபை மட்டுமே

# translate
source: Translation
ta: மொழிபெயர்ப்பு

# no_search_result
source: No results.
ta: முடிவுகள் இல்லை.

# error_occurred
source: Error
ta: பிழை

source: Copied
ta: நகலெடுக்கப்பட்டது

# share_with_time
source: Share with time code
ta: நேரக் குறியீட்டைக் கொண்டு பகிரவும்

source: Export subscriptions
ta: ஏற்றுமதி சந்தாக்கள்

source: Skip buttons
ta: பொத்தான்களைத் தவிர்க்கவும்

# skip_buttons_summary
source: Show buttons to skip to the next or previous video
ta: அடுத்த அல்லது முந்தைய வீடியோவுக்கு தவிர்க்க பொத்தான்களைக் காட்டு

# history_size
source: Maximum history size
ta: அதிகபட்ச வரலாற்று அளவு

source: Unlimited
ta: வரம்பற்றது

source: Background mode
ta: பின்னணி முறை

source: Add to queue
ta: வரிசையில் சேர்க்கவும்

source: Misc
ta: இதர

# take_a_break
source: Time to take a break
ta: ஓய்வு எடுக்க நேரம்

# yt_shorts
source: Shorts
ta: குறுக்குகள்

source: No subtitles available
ta: வசன வரிகள் எதுவும் கிடைக்கவில்லை

source: Repeat Mode
ta: மீண்டும் பயன்முறை

# resize_mode_fit
source: Fit
ta: பொருத்தம்

# resize_mode_fill
source: Fill
ta: நிரப்பவும்

# resize_mode_zoom
source: Zoom
ta: பெரிதாக்கு

# repeat_mode_none
source: None
ta: எதுவுமில்லை

# repeat_mode_current
source: Current
ta: மின்னோட்ட்ம், ஓட்டம்

# repeat_mode_all
source: Repeat all
ta: அனைத்தையும் மீண்டும் செய்யவும்

source: Backup & restore
ta: காப்புப்பிரதி மற்றும் மீட்டமை

source: Backup
ta: காப்புப்பிரதி

source: Picture-in-Picture
ta: படம்-படம்

source: PiP
ta: பிப்

# player_resize_mode
source: Resize mode
ta: மறுஅளவிடுதல் பயன்முறை

# maximum_image_cache
source: Max image cache size
ta: அதிகபட்ச பட கேச் அளவு

source: Copied to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது

# open_copied
source: Open
ta: திற

# legacy_subscriptions
source: Legacy subscriptions view
ta: மரபு சந்தாக்கள் பார்வை

source: Device Info
ta: சாதன செய்தி

# audio_video_summary
source: Quality and format
ta: தகுதி மற்றும் வடிவம்

# delete
source: Delete from downloads
ta: பதிவிறக்கங்களிலிருந்து நீக்கு

# delete_all
source: All downloads will be deleted!
ta: எல்லா பதிவிறக்கங்களும் நீக்கப்படும்!

source: Rename playlist
ta: பிளேலிச்ட்டை மறுபெயரிடுங்கள்

source: Wi-Fi
ta: இல்

source: Mobile data
ta: மொபைல் தரவு

# new_videos_badge
source: Indicator for new videos
ta: புதிய வீடியோக்களுக்கான காட்டி

# new_videos_badge_summary
source: Show a badge with the amount of new videos if there are some
ta: சில இருந்தால் புதிய வீடியோக்களின் அளவைக் கொண்டு பேட்சைக் காட்டு

source: Skip segment
ta: பிரிவைத் தவிர்க்கவும்

source: Local subscriptions
ta: உள்ளக சந்தாக்கள்

source: Preferences
ta: விருப்பத்தேர்வுகள்

# backup_customInstances
source: Custom Instances
ta: தனிப்பயன் நிகழ்வுகள்

source: Play next
ta: அடுத்து விளையாடுங்கள்

source: Navigation bar
ta: வழிசெலுத்தல் பட்டி

# change_region
source: Trending seems to be unavailable for the current region. Please select another in the settings.
ta: தற்போதைய பிராந்தியத்திற்கு ட்ரெண்டிங் கிடைக்கவில்லை என்று தெரிகிறது. அமைப்புகளில் இன்னொன்றைத் தேர்ந்தெடுக்கவும்.

source: Change instance
ta: உதாரணத்தை மாற்றவும்

# suggest_change_instance
source: Loading is taking more than usual. Consider changing instance
ta: ஏற்றுதல் வழக்கத்தை விட அதிகமாக எடுக்கும். நிகழ்வை மாற்றுவதைக் கவனியுங்கள்

# playback_pitch
source: Pitch
ta: குனிவு

source: Filename
ta: கோப்புப்பெயர்

source: Invalid filename!
ta: தவறான கோப்பு பெயர்!

# time_code
source: Time code (seconds)
ta: நேரக் குறியீடு (விநாடிகள்)

# added_to_playlist
source: Added to playlist %1$s
ta: பிளேலிச்ட் %1$s இல் சேர்க்கப்பட்டது

source: Queue
ta: வரிசை

# sb_custom_colors_summary
source: Toggles custom color segments for SponsorBlock segments
ta: ஒப்புரவாளர் பிளாக் பிரிவுகளுக்கான தனிப்பயன் வண்ண பிரிவுகளை மாற்றுகிறது

# sb_custom_colors
source: Custom segment colors
ta: தனிப்பயன் பிரிவு வண்ணங்கள்

source: Color
ta: நிறம்

# invalid_color
source: Invalid color value entered!
ta: தவறான வண்ண மதிப்பு நுழைந்தது!

source: Livestreams
ta: லைவ்ச்ட்ரீம்கள்

source: Alternative videos layout
ta: மாற்று வீடியோக்கள் தளவமைப்பு

# defaultIconLight
source: Default light
ta: இயல்புநிலை ஒளி

source: Playlist cloned
ta: பிளேலிச்ட் நகலி

# confirm_unsubscribe
source: Are you sure you want to unsubscribe %1$s?
ta: %1$s குழுவிலக நீங்கள் நிச்சயமாக விரும்புகிறீர்களா?

source: Confirm unsubscribing
ta: குழுவிலகுவதை உறுதிப்படுத்தவும்

# confirm_unsubscribing_summary
source: Show a confirmation dialog before unsubscribing
ta: குழுவிலகும் முன் உறுதிப்படுத்தல் உரையாடலைக் காட்டு

source: Play all
ta: அனைத்தையும் விளையாடுங்கள்

source: Time
ta: நேரம்

source: Start time
ta: தொடக்க நேரம்

source: End time
ta: இறுதி நேரம்

# notification_time
source: Restrict notification time
ta: அறிவிப்பு நேரத்தைக் கட்டுப்படுத்துங்கள்

# notification_time_summary
source: Limit the time span in which stream notifications are shown
ta: ச்ட்ரீம் அறிவிப்புகள் காட்டப்படும் கால அளவைக் கட்டுப்படுத்துங்கள்

# navbar_order
source: Order
ta: ஒழுங்கு

source: Layout
ta: மனையமைவு

source: Audio track
ta: ஆடியோ டிராக்

# unsupported_file_format
source: Unsupported file format: %1$s
ta: ஆதரிக்கப்படாத கோப்பு வடிவம்: %1$s

# hls_instead_of_dash
source: Use HLS
ta: HLS ஐப் பயன்படுத்தவும்

# hls_instead_of_dash_summary
source: Use HLS instead of DASH (will be slower, not recommended)
ta: கோடுக்கு பதிலாக HLS ஐப் பயன்படுத்தவும் (மெதுவாக இருக்கும், பரிந்துரைக்கப்படவில்லை)

# auto_quality
source: Auto
ta: தானி

source: Limit to runtime
ta: இயக்க நேரத்திற்கு வரம்பு

source: Trends
ta: போக்குகள்

source: Featured
ta: இடம்பெற்றது

# trending
source: What's trending now
ta: இப்போது என்ன பிரபலமானது

source: Bookmarks
ta: புக்மார்க்குகள்

source: Bookmark
ta: புத்தககுறி

source: Clear bookmarks
ta: தெளிவான புக்மார்க்குகள்
