Repository: 247i/TACETr
Catalog: உரை/தானி/lilybot-lilybot-translations-*.po
Languages: ta

# basic.enabled
source: Enabled
ta: இயக்கப்பட்டது

# basic.disabled
source: Disabled
ta: முடக்கப்பட்டது

# basic.true
source: True
ta: உண்மை

# basic.false
source: False
ta: தவறு

# basic.none
source: None
ta: எதுவுமில்லை

# basic.yes
source: Yes
ta: ஆம்

# basic.no
source: No
ta: இல்லை

# basic.null
source: Null
ta: சுழியம்

# basic.default
source: Default
ta: இயல்புநிலை

# basic.original
source: Original
ta: அசல்

# basic.old
source: Old
ta: பழைய

# basic.new
source: New
ta: புதிய

# basic.requestedBy
source: Requested by {0}
ta: {0 by ஆல் கோரப்பட்டது

# basic.userField
source: User:
ta: பயனர்:

# basic.noReason
source: No reason provided
ta: எந்த காரணமும் வழங்கப்படவில்லை

# basic.createdBy
source: Created by {0}
ta: {0 by ஆல் உருவாக்கப்பட்டது

# basic.unableTo.tag
source: Unable to get username
ta: பயனர்பெயரைப் பெற முடியவில்லை

# basic.unableTo.mention
source: Unable to get user mention
ta: பயனரைக் குறிப்பிட முடியவில்லை

# basic.unableTo.findUser
source: Unable to find user
ta: பயனரைக் கண்டுபிடிக்க முடியவில்லை

# basic.unableTo.channel
source: Unable to get channel
ta: சேனலைப் பெற முடியவில்லை

# basic.unableTo.getContents
source: Unable to get contents of message
ta: செய்திகளின் உள்ளடக்கங்களைப் பெற முடியவில்லை

# basic.unableTo.author
source: Unable to get author of message
ta: செய்தியின் ஆசிரியரைப் பெற முடியவில்லை

# about.embedTitle
source: Info about LilyBot
ta: லில்லிபாட் பற்றிய செய்தி

# about.embedDesc
source: Lily is a FOSS multipurpose bot for Discord created by the HyacinthBots organization. Use `/help` for support or `/invite` to get an invitation link.
ta: லில்லி என்பது ஐசின்த்போட்ச் அமைப்பால் உருவாக்கப்பட்ட முரண்பாட்டிற்கான ஒரு ஃபோச் பல்நோக்கு போட் ஆகும். அழைப்பிதழ் இணைப்பைப் பெற `/உதவி` அல்லது`/அழைப்பிதழ்` ஐப் பயன்படுத்தவும்.

# about.howSupportTitle
source: How can I support the continued development of Lily?
ta: லில்லியின் தொடர்ச்சியான வளர்ச்சியை நான் எவ்வாறு ஆதரிக்க முடியும்?

# about.howSupportValue
source: Lily is developed primarily by NoComment#6411 in their free time. Hyacinth doesn't have the resources to invest in dedicated hosting, so financial donations via [Buy Me a Coffee](https://buymeacoffee.com/Hyacinthbots) help keep Lily afloat. Currently, we run lily on a Hetzner cloud server, which we can afford in our current situation. We also have domain costs for our website. Contributions of code & documentation are also incredibly appreciated, and you can read our [contributing guide]({0}/LilyBot/blob/main/CONTRIBUTING.md) or [development guide]({0}/LilyBot/blob/main/docs/development-guide.md) to get started.
ta: லில்லி முதன்மையாக அவர்களின் ஓய்வு நேரத்தில் நோகோம்மென்ட்#6411 ஆல் உருவாக்கப்பட்டது. அர்ப்பணிப்புள்ள ஓச்டிங்கில் முதலீடு செய்வதற்கான ஆதாரங்கள் ஐசின்ட்டுக்கு இல்லை, எனவே [எனக்கு ஒரு காபி வாங்க] வழியாக பொருள் நன்கொடைகள் (https://buymeacoffee.com/hyacinthbots) லில்லியை மிதக்க வைக்க உதவுகின்றன. தற்போது, லில்லி ஒரு எட்ச்னர் முகில் சேவையகத்தில் ஓடுகிறோம், அதை எங்கள் தற்போதைய சூழ்நிலையில் நாங்கள் வாங்க முடியும். எங்கள் வலைத்தளத்திற்கான டொமைன் செலவுகளும் எங்களிடம் உள்ளன. குறியீடு மற்றும் ஆவணங்களின் பங்களிப்புகளும் நம்பமுடியாத அளவிற்கு பாராட்டப்படுகின்றன, மேலும் நீங்கள் எங்கள் [பங்களிப்பு வழிகாட்டி] ({0} /lylybot/blob/main/contributing.md) அல்லது [மேம்பாட்டு வழிகாட்டி] ({0}/லில்லிபாட்/குமிழ்/முதன்மை/ தொடங்குவதற்கு டாக்ச்/டெவலப்மென்ட்-வழிகாட்டி. எம்.டி).

# about.version
source: Version
ta: பதிப்பு

# about.upSince
source: Up since
ta: முதல்

# checks.requiredConfigs.inServer
source: Must be in a server
ta: சேவையகத்தில் இருக்க வேண்டும்

# checks.requiredConfigs.noConfigInCode
source: There are no config options provided in the code. Please inform the developers immediately!
ta: குறியீட்டில் கட்டமைப்பு விருப்பங்கள் எதுவும் வழங்கப்படவில்லை. டெவலப்பர்களுக்கு உடனடியாக தெரிவிக்கவும்!

# checks.requiredConfigs.cantModConfig
source: Unable to access moderation config for this guild! Please inform a member of staff.
ta: இந்த கில்டுக்கு மிதமான கட்டமைப்பை அணுக முடியவில்லை! ஊழியர்களின் உறுப்பினருக்கு தெரிவிக்கவும்.

# checks.requiredConfigs.cantLoggingConfig
source: Unable to access logging config for this guild! Please inform a member of staff.
ta: இந்த கில்டுக்கு பதிவு கட்டமைப்பை அணுக முடியவில்லை! ஊழியர்களின் உறுப்பினருக்கு தெரிவிக்கவும்.

# checks.requiredConfigs.cantUtilityConfig
source: Unable to access utility config for this guild! Please inform a member of staff.
ta: இந்த கில்டுக்கு பயன்பாட்டு கட்டமைப்பை அணுக முடியவில்லை! ஊழியர்களின் உறுப்பினருக்கு தெரிவிக்கவும்.

# checks.requiredConfigs.modDisabled
source: Moderation is disabled for this guild!
ta: இந்த கில்டுக்கு மிதமான முடக்கப்பட்டுள்ளது!

# checks.requiredConfigs.noModRole
source: A moderator role has not been set for this guild!
ta: இந்த கில்டுக்கு ஒரு மதிப்பீட்டாளர் பங்கு அமைக்கப்படவில்லை!

# checks.requiredConfigs.noModLog
source: An action log has not been set for this guild!
ta: இந்த கில்டுக்கு ஒரு செயல் பதிவு அமைக்கப்படவில்லை!

# checks.requiredConfigs.logPubliclyOff
source: Public logging has not been enabled for this guild!
ta: இந்த கில்டுக்கு பொது பதிவு இயக்கப்படவில்லை!

# checks.requiredConfigs.noDeleteLogging
source: Message delete logging is disabled for this guild!
ta: இந்த கில்டுக்கு செய்தி நீக்குதல் பதிவு முடக்கப்பட்டுள்ளது!

# checks.requiredConfigs.noEditLogging
source: Message edit logging is disabled for this guild!
ta: இந்த கில்டுக்கு செய்தி திருத்து பதிவு முடக்கப்பட்டுள்ளது!

# checks.requiredConfigs.noMessageLogging
source: A message log has not been set for this guild!
ta: இந்த கில்டுக்கு செய்தி பதிவு அமைக்கப்படவில்லை!

# checks.requiredConfigs.noMemberLogging
source: Member logging is disabled for this guild!
ta: இந்த கில்டுக்கு உறுப்பினர் பதிவு முடக்கப்பட்டுள்ளது!

# checks.requiredConfigs.noMemberLogSet
source: A member log has not been set for this guild!
ta: இந்த கில்டுக்கு உறுப்பினர் பதிவு அமைக்கப்படவில்லை!

# checks.requiredConfigs.noUtilityLog
source: A utility log has not been set for this guild!
ta: இந்த கில்டுக்கு ஒரு பயன்பாட்டு பதிவு அமைக்கப்படவில்லை!

# checks.loggingChannelPerms.cannotGet
source: Lily is unable to send messages in the configured {0} for this guild. As a result, the corresponding config has been reset. *Note:* this channel has been used to send this message because it's the first channel in the guild Lily could use. Please inform this guild's staff about this message.
ta: இந்த கில்டுக்கு கட்டமைக்கப்பட்ட {0 in இல் செய்திகளை லில்லி அனுப்ப முடியவில்லை. இதன் விளைவாக, தொடர்புடைய உள்ளமைவு மீட்டமைக்கப்பட்டுள்ளது. * குறிப்பு:* இந்த செய்தியை அனுப்ப இந்த சேனல் பயன்படுத்தப்பட்டுள்ளது, ஏனெனில் இது கில்ட் லில்லி பயன்படுத்தக்கூடிய முதல் சேனல். இந்த செய்தியைப் பற்றி இந்த கில்ட்டின் ஊழியர்களுக்கு தெரிவிக்கவும்.

# checks.channelPerms.incorrectPerms
source: Incorrect permissions! I do not have the {0} permissions for {1}
ta: தவறான அனுமதிகள்! {1 க்கு க்கான {0} அனுமதிகள் என்னிடம் இல்லை

# checks.channelPerms.unableToPerms
source: Unable to get permissions for channel! Please report this to the developers!
ta: சேனலுக்கான அனுமதிகளைப் பெற முடியவில்லை! இதை டெவலப்பர்களிடம் புகாரளிக்கவும்!

# checks.botOrMod.noGuild
source: **Error:** Unable to access this guild. Please try again
ta: ** பிழை: ** இந்த கில்ட்டை அணுக முடியவில்லை. மீண்டும் முயற்சிக்கவும்

# checks.botOrMod.unableToAccess
source: **Error:** Unable to access configuration for this guild! Is your configuration set?
ta: ** பிழை: ** இந்த கில்டிற்கான உள்ளமைவை அணுக முடியவில்லை! உங்கள் உள்ளமைவு அமைக்கப்பட்டதா?

# checks.botOrMod.lilyError
source: There was an error getting Lily as a member of this server, please try again!
ta: இந்த சேவையகத்தின் உறுப்பினராக லில்லி பெறுவதில் பிழை ஏற்பட்டது, தயவுசெய்து மீண்டும் முயற்சிக்கவும்!

# checks.botOrMod.cantBot
source: You cannot {0} bot users!
ta: நீங்கள் {0} போட் பயனர்களால் முடியாது!

# checks.botOrMod.cantMod
source: You cannot {0} moderators!
ta: நீங்கள் {0} மதிப்பீட்டாளர்களால் முடியாது!

# checks.botOrMod.lilyNoRole
source: This user has a role and Lily does not, therefore she cannot {0} them.
ta: இந்த பயனருக்கு ஒரு பங்கு உள்ளது, லில்லி இல்லை, எனவே அவளால் {0} முடியாது.

# checks.botOrMod.userHigher
source: This users highest role is above Lily's, therefore she cannot {0} them.
ta: இந்த பயனர்களின் மிக உயர்ந்த பங்கு லில்லிக்கு மேலே உள்ளது, எனவே அவளால் {0} முடியாது.

# config.name
source: config
ta: கட்டமைப்பு

# config.description
source: Configure Lily's Settings
ta: லில்லியின் அமைப்புகளை உள்ளமைக்கவும்

# config.configuredBy
source: Configured by {0}
ta: {0 by ஆல் கட்டமைக்கப்பட்டுள்ளது

# config.considerUtility
source: Consider setting a utility config to log changes to configurations
ta: உள்ளமைவுகளில் மாற்றங்களை பதிவு செய்ய ஒரு பயன்பாட்டு உள்ளமைவு அமைப்பதைக் கவனியுங்கள்

# config.configAlreadyExists
source: You already have a {0} configuration set. Please clear it before attempting to set a new one.
ta: உங்களிடம் ஏற்கனவே {0} உள்ளமைவு தொகுப்பு உள்ளது. புதிய ஒன்றை அமைக்க முயற்சிக்கும் முன் அதை அழிக்கவும்.

# config.invalidChannel
source: The {0} you've selected is invalid, or I can't view it. Please attempt to resolve this and try again.
ta: நீங்கள் தேர்ந்தெடுத்த {0} தவறானது, அல்லது என்னால் அதைப் பார்க்க முடியாது. தயவுசெய்து இதைத் தீர்க்க முயற்சிக்கவும், மீண்டும் முயற்சிக்கவும்.

# config.unableTo.mention
source: Unable to get channel mention
ta: சேனல் குறிப்பைப் பெற முடியவில்லை

# config.unableTo.name
source: Unable to get channel name
ta: சேனல் பெயரைப் பெற முடியவில்லை

# config.moderation.name
source: moderation
ta: மிதமான

# config.moderation.description
source: Configure Lily's moderation system
ta: லில்லியின் மிதமான அமைப்பை உள்ளமைக்கவும்

# config.moderation.systemDisabled
source: Moderation system disabled
ta: மிதமான அமைப்பு முடக்கப்பட்டுள்ளது

# config.moderation.roleAndChannelRequired
source: You must set both the moderator role and the action log channel to use the moderation configuration.
ta: மிதமான உள்ளமைவைப் பயன்படுத்த நீங்கள் மதிப்பீட்டாளர் பங்கு மற்றும் செயல் பதிவு சேனல் இரண்டையும் அமைக்க வேண்டும்.

# config.moderation.roleNotPingable
source: I cannot use the role: {0}, because it is not mentionable by regular users. Please enable this in the role settings, or use a different role.
ta: என்னால் பாத்திரத்தைப் பயன்படுத்த முடியாது: {0}, ஏனெனில் இது வழக்கமான பயனர்களால் குறிப்பிடப்படவில்லை. தயவுசெய்து இதை பங்கு அமைப்புகளில் இயக்கவும் அல்லது வேறு பாத்திரத்தைப் பயன்படுத்தவும்.

# config.moderation.embed.title
source: Configuration: Moderation
ta: உள்ளமைவு: மிதமான

# config.moderation.embed.moderatorsFieldName
source: Moderators
ta: மதிப்பீட்டாளர்கள்

# config.moderation.embed.actionLogFieldName
source: Action Log
ta: செயல் பதிவு

# config.moderation.embed.logPubliclyFieldName
source: Log Publicly
ta: பகிரங்கமாக பதிவு

# config.moderation.embed.quickTimeoutLength.name
source: Quick timeout length
ta: விரைவான காலக்கெடு நீளம்

# config.moderation.embed.quickTimeoutLength.disabled
source: No quick timeout message set
ta: விரைவான நேரம் தொடங்கும் செய்தி அமைக்கப்படவில்லை

# config.moderation.embed.warningAutoPunishmentsName
source: Warning Auto-punishments
ta: எச்சரிக்கை ஆட்டோ-துச்பிரயோகம்

# config.moderation.embed.banDmMessage.name
source: Ban DM Message
ta: டிஎம் செய்தியைத் தடைசெய்க

# config.moderation.embed.banDmMessage.disabled
source: No custom Ban DM message set
ta: தனிப்பயன் தடை டிஎம் செய்தி அமைக்கப்படவில்லை

# config.moderation.embed.dmDefault.name
source: DM Default
ta: டி.எம் இயல்புநிலை

# config.moderation.embed.dmDefault.true
source: DM argument will default to true
ta: டிஎம் உரையாடல் உண்மைக்கு இயல்புநிலையாக இருக்கும்

# config.moderation.embed.dmDefault.false
source: DM argument will default to false
ta: டி.எம் உரையாடல் இயல்புநிலைக்கு தவறானது

# config.moderation.embed.autoInviteRoleName
source: Auto-invite Moderator Role
ta: ஆட்டோ-இன்வைட் மதிப்பீட்டாளர் பங்கு

# config.moderation.embed.memberRoleChangesName
source: Log member role changes
ta: பதிவு உறுப்பினர் பங்கு மாற்றங்கள்

# config.logging.name
source: logging
ta: பதிவு

# config.logging.description
source: Configure Lily's logging system
ta: லில்லியின் பதிவு முறையை உள்ளமைக்கவும்

# config.logging.memberMissing
source: You must specify a channel to log members joining and leaving too!
ta: உறுப்பினர்களுடன் சேரவும் வெளியேறவும் ஒரு சேனலை நீங்கள் குறிப்பிட வேண்டும்!

# config.logging.editMissing
source: You must specify a channel to log deleted/edited messages too!
ta: நீக்கப்பட்ட/திருத்தப்பட்ட செய்திகளையும் பதிவு செய்ய நீங்கள் ஒரு சேனலைக் குறிப்பிட வேண்டும்!

# config.logging.publicMemberMissing
source: You must specify a channel to publicly log members joining and leaving too!
ta: பொது உறுப்பினர்களை சேர்ப்பதற்கும் வெளியேறுவதற்கும் ஒரு சேனலையும் நீங்கள் குறிப்பிட வேண்டும்!

# config.logging.embed.title
source: Configuration: Logging
ta: உள்ளமைவு: பதிவு

# config.logging.embed.messageDeleteFieldName
source: Message Delete Logs
ta: செய்தி நீக்கு பதிவுகள்

# config.logging.embed.messageEditFieldName
source: Message Edit Logs
ta: செய்தி திருத்து பதிவுகள்

# config.logging.embed.memberFieldName
source: Member Logs
ta: உறுப்பினர் பதிவுகள்

# config.logging.embed.publicMemberField.name
source: Public Member logs
ta: பொது உறுப்பினர் பதிவுகள்

# config.logging.embed.publicMemberField.joinMessage
source: Join Message
ta: செய்தியில் சேரவும்

# config.logging.embed.publicMemberField.leaveMessage
source: Leave Message
ta: செய்தியை விடுங்கள்

# config.logging.embed.publicMemberField.pingOnJoin
source: Ping on Join
ta: சேர பிங்

# config.logging.modal.title
source: Public logging configuration
ta: பொது பதிவு உள்ளமைவு

# config.logging.modal.joinMessage.label
source: What would you like sent when a user joins
ta: ஒரு பயனர் சேரும்போது நீங்கள் என்ன அனுப்ப விரும்புகிறீர்கள்

# config.logging.modal.joinMessage.placeholder
source: Welcome to the server!
ta: சேவையகத்திற்கு வருக!

# config.logging.modal.leaveMessage.label
source: What would you like sent when a user leaves
ta: ஒரு பயனர் வெளியேறும்போது நீங்கள் என்ன அனுப்ப விரும்புகிறீர்கள்

# config.logging.modal.leaveMessage.placeholder
source: Adiós amigo!
ta: குட்பை நண்பர்!

# config.logging.modal.ping.label
source: Type `yes` to ping new users when they join
ta: புதிய பயனர்கள் சேரும்போது பிங் செய்ய `ஆம்` என தட்டச்சு செய்க

# config.logging.modal.ping.placeholder
source: Defaults to false if input is invalid or not `yes`
ta: உள்ளீடு தவறானது என்றால் தவறானது அல்லது `ஆம்` இல்லையென்றால் இயல்புநிலை

# config.utility.name
source: utility
ta: பயன்பாடு

# config.utility.description
source: Configure Lily's utility settings
ta: லில்லியின் பயன்பாட்டு அமைப்புகளை உள்ளமைக்கவும்

# config.utility.embed.title
source: Configuration: Utility
ta: உள்ளமைவு: பயன்பாடு

# config.utility.embed.utilityFieldName
source: Utility Log
ta: பயன்பாட்டு பதிவு

# config.utility.embed.channelUpdates
source: Log Channel updates
ta: பதிவு சேனல் புதுப்பிப்புகள்

# config.utility.embed.eventUpdates
source: Log Event updates
ta: பதிவு நிகழ்வு புதுப்பிப்புகள்

# config.utility.embed.inviteUpdates
source: Log Invite updates
ta: பதிவு புதுப்பிப்புகளை அழைக்கவும்

# config.utility.embed.roleUpdates
source: Log Role updates
ta: பதிவு பங்கு புதுப்பிப்புகள்

# config.clear.name
source: clear
ta: தெளிவான

# config.clear.description
source: Clear a config type
ta: ஒரு கட்டமைப்பு வகையை அழிக்கவும்

# config.clear.embed.title
source: Configuration Cleared: {0}
ta: உள்ளமைவு அழிக்கப்பட்டது: {0}

# config.clear.noConfigMod
source: No moderation configuration exists to clear
ta: அழிக்க மிதமான உள்ளமைவு எதுவும் இல்லை

# config.clear.noConfigLogging
source: No logging configuration exists to clear
ta: அழிக்க பதிவுசெய்யும் உள்ளமைவு எதுவும் இல்லை

# config.clear.noConfigUtility
source: No utility configuration exists to clear
ta: அழிக்க எந்த பயன்பாட்டு உள்ளமைவும் இல்லை

# config.clear.all
source: All configs cleared
ta: அனைத்து உள்ளமைவுகளும் அழிக்கப்பட்டன

# config.clear.footer
source: Config cleared by {0}
ta: {0 by ஆல் அழிக்கப்பட்ட கட்டமைப்பு

# config.view.name
source: view
ta: பார்வை

# config.view.description
source: View the current config you have set
ta: நீங்கள் அமைத்த தற்போதைய உள்ளமைவைக் காண்க

# config.view.noModConfig
source: There is no moderation config for this guild
ta: இந்த கில்டுக்கு மிதமான கட்டமைப்பு இல்லை

# config.view.noLoggingConfig
source: There is no logging config for this guild
ta: இந்த கில்டுக்கு பதிவுசெய்யும் கட்டமைப்பு இல்லை

# config.view.noUtilityConfig
source: There is no utility config for this guild
ta: இந்த கில்டுக்கு பயன்பாட்டு கட்டமைப்பு எதுவும் இல்லை

# config.view.currentConfig.modTitle
source: Current moderation config
ta: தற்போதைய மிதமான கட்டமைப்பு

# config.view.currentConfig.loggingTitle
source: Current logging config
ta: தற்போதைய பதிவு கட்டமைப்பு

# config.view.currentConfig.utilityTitle
source: Current utility config
ta: தற்போதைய பயன்பாட்டு கட்டமைப்பு

# config.view.currentConfig.modDescription
source: This is the current moderation config for this guild
ta: இந்த கில்டுக்கான தற்போதைய மிதமான கட்டமைப்பு இது

# config.view.currentConfig.loggingDescription
source: This is the current logging config for this guild
ta: இந்த கில்டுக்கான தற்போதைய பதிவு கட்டமைப்பு இது

# config.view.currentConfig.utilityDescription
source: This is the current utility config for this guild
ta: இந்த கில்டுக்கான தற்போதைய பயன்பாட்டு கட்டமைப்பு இது

# config.arguments.moderation.enabled.name
source: enable-moderation
ta: மாற்றத்தை இயக்கு

# config.arguments.moderation.enabled.description
source: Whether to enable the moderation system
ta: மிதமான அமைப்பை இயக்க வேண்டுமா

# config.arguments.moderation.moderatorRole.name
source: moderator-role
ta: மதிப்பீட்டாளர்-பங்கு

# config.arguments.moderation.moderatorRole.description
source: The role of your moderators, used for pinging in message logs
ta: உங்கள் மதிப்பீட்டாளர்களின் பங்கு, செய்தி பதிவுகளில் பிங் செய்யப் பயன்படுகிறது

# config.arguments.moderation.modActionLog.name
source: action-log
ta: செயல்-பதிவு

# config.arguments.moderation.modActionLog.description
source: The channel used to store moderator actions
ta: மதிப்பீட்டாளர் செயல்களைச் சேமிக்க சேனல் பயன்படுத்தப்படுகிறது

# config.arguments.moderation.quickTimeout.name
source: quick-timeout-length
ta: விரைவான நேர நீளம்

# config.arguments.moderation.quickTimeout.description
source: The length of timeouts to use for quick timeouts
ta: விரைவான காலக்கெடுவுக்கு பயன்படுத்த வேண்டிய காலக்கெடுவின் நீளம்

# config.arguments.moderation.autoPunish.name
source: warn-auto-punishments
ta: எச்சரிக்கை-ஆட்டோ-துச்பிரயோகம்

# config.arguments.moderation.autoPunish.description
source: Whether to automatically punish users for reaching a certain threshold on warns
ta: எச்சரிக்கைகள் மீது ஒரு குறிப்பிட்ட வாசலை அடைந்ததற்காக பயனர்களை தானாக தண்டிக்க வேண்டுமா?

# config.arguments.moderation.dmDefault.name
source: dm-default
ta: டி.எம்-தாக்குதல்

# config.arguments.moderation.dmDefault.description
source: The default value for whether to DM a user in a moderation action
ta: ஒரு மிதமான செயலில் ஒரு பயனரை டி.எம் செய்யலாமா என்பதற்கான இயல்புநிலை மதிப்பு

# config.arguments.moderation.logPublicly.name
source: log-publicly
ta: பதிவு-பொது

# config.arguments.moderation.logPublicly.description
source: Whether to log moderation publicly or not
ta: மிதமான முறையில் பொதுவில் பதிவு செய்யலாமா இல்லையா

# config.arguments.moderation.banDm.name
source: ban-dm-message
ta: பான்-டி.எம்-செய்தி

# config.arguments.moderation.banDm.description
source: A custom message to send to users when they are banned.
ta: பயனர்கள் தடைசெய்யப்படும்போது அவர்களுக்கு அனுப்ப வேண்டிய தனிப்பயன் செய்தி.

# config.arguments.moderation.inviteMods.name
source: auto-invite-moderator-role
ta: ஆட்டோ-இன்வைட்-மாடரேட்டர்-ரோல்

# config.arguments.moderation.inviteMods.description
source: Silent ping moderators to invite them to new threads.
ta: புதிய நூல்களுக்கு அழைக்க அமைதியான பிங் மதிப்பீட்டாளர்கள்.

# config.arguments.moderation.roleChanges.name
source: log-member-role-changes
ta: பதிவு-உறுப்பினர்-பங்கு மாற்றங்கள்

# config.arguments.moderation.roleChanges.description
source: Whether to log changes to the roles members have in a guild.
ta: உறுப்பினர்கள் ஒரு கில்டில் உள்ள பாத்திரங்களில் மாற்றங்களை பதிவு செய்யலாமா என்பது.

# config.arguments.logging.enableDelete.name
source: enable-delete-logs
ta: -டெலேட்-லாக்சை இயக்கவும்

# config.arguments.logging.enableDelete.description
source: Enable logging of message deletions
ta: செய்தி நீக்குதல்களின் பதிவை இயக்கவும்

# config.arguments.logging.enableEdit.name
source: enable-edit-logs
ta: -எடிட்-லாக்சை இயக்கு

# config.arguments.logging.enableEdit.description
source: Enable logging of message edits
ta: செய்தி திருத்தங்களின் பதிவை இயக்கவும்

# config.arguments.logging.enableMember.name
source: enable-member-logging
ta: உறுப்பினர்-பதிவை இயக்கு

# config.arguments.logging.enableMember.description
source: Enable logging of members joining and leaving the guild
ta: கில்ட்டில் சேரவும் வெளியேறவும் உறுப்பினர்களின் பதிவை இயக்கவும்

# config.arguments.logging.enablePublicMember.name
source: enable-public-member-logging
ta: -பொது-உறுப்பினர்-பதிவை இயக்கு

# config.arguments.logging.enablePublicMember.description
source: Enable logging of members joining and leaving the guild with a public message
ta: பொதுச் செய்தியுடன் கில்டில் சேரவும் விட்டு வெளியேறவும் உறுப்பினர்களின் பதிவை இயக்கவும்

# config.arguments.logging.messageLog.name
source: message-logs
ta: செய்தி-பதிவுகள்

# config.arguments.logging.messageLog.description
source: The channel for logging message deletions
ta: செய்தி நீக்குதல்களை பதிவு செய்வதற்கான சேனல்

# config.arguments.logging.memberLog.name
source: member-log
ta: உறுப்பினர்-பதிவு

# config.arguments.logging.memberLog.description
source: The channel for logging members joining and leaving the guild
ta: உள்நுழைவதற்கான சேனல் உறுப்பினர்கள் சேரவும் கில்ட்டை விட்டு வெளியேறவும்

# config.arguments.logging.publicMemberLog.name
source: public-member-log
ta: பொது உறுப்பினர்-பதிவு

# config.arguments.logging.publicMemberLog.description
source: The channel for the public logging of members joining and leaving the guild
ta: உறுப்பினர்களின் பொது பதிவுகளுக்கான சேனல் கில்டில் சேரவும் வெளியேறவும்

# config.arguments.utility.utilityLog.name
source: utility-log
ta: பயன்பாட்டு-பதிவு

# config.arguments.utility.utilityLog.description
source: The channel to log various utility actions too.
ta: பல்வேறு பயன்பாட்டு செயல்களையும் பதிவு செய்வதற்கான சேனல்.

# config.arguments.utility.channelUpdates.name
source: log-channel-updates
ta: பதிவு-சேனல்-புதுப்பிப்புகள்

# config.arguments.utility.channelUpdates.description
source: Whether to log changes made to channels in this guild.
ta: இந்த கில்டில் சேனல்களில் செய்யப்பட்ட மாற்றங்களை பதிவு செய்யலாமா?

# config.arguments.utility.eventUpdates.name
source: log-event-updates
ta: பதிவு-நிகழ்வு-புதுப்பிப்புகள்

# config.arguments.utility.eventUpdates.description
source: Whether to log changes made to events in this guild.
ta: இந்த கில்டில் நிகழ்வுகளில் செய்யப்பட்ட மாற்றங்களை பதிவு செய்யலாமா?

# config.arguments.utility.inviteUpdates.name
source: log-invite-updates
ta: உள்நுழைவு-புதுப்பிப்புகள்

# config.arguments.utility.inviteUpdates.description
source: Whether to log changes made to invites in this guild.
ta: இந்த கில்டில் அழைக்கப்படும் மாற்றங்களை பதிவு செய்யலாமா?

# config.arguments.utility.roleUpdates.name
source: log-role-updates
ta: பதிவு-பங்கு புதுப்பிப்புகள்

# config.arguments.utility.roleUpdates.description
source: Whether to log changes made to roles in this guild.
ta: இந்த கில்டில் பாத்திரங்களில் செய்யப்பட்ட மாற்றங்களை பதிவு செய்யலாமா?

# config.arguments.clear.name
source: config-type
ta: கட்டமைப்பு வகை

# config.arguments.clear.description
source: The type of config to clear
ta: அழிக்க கட்டமைப்பு வகை

# config.arguments.clear.choice.moderation
source: moderation
ta: மிதமான

# config.arguments.clear.choice.logging
source: logging
ta: பதிவு

# config.arguments.clear.choice.utility
source: utility
ta: பயன்பாடு

# config.arguments.clear.choice.all
source: all
ta: அனைத்தும்

# config.arguments.view.description
source: The type of config to view
ta: பார்க்க கட்டமைப்பு வகை
