Repository: 247i/TACETr
Catalog: உரை/தானி/lilybot-lilybot-translations-*.po
Languages: ta

# moderation.modUtilities.say.embedTitle
source: Say command used
ta: பயன்படுத்தப்பட்ட கட்டளை என்று சொல்லுங்கள்

# moderation.modUtilities.say.channelField
source: Channel:
ta: சேனல்:

# moderation.modUtilities.say.typeField
source: Type
ta: வகை

# moderation.modUtilities.say.embedType
source: Embed
ta: உட்பொதிக்கப்பட்டது

# moderation.modUtilities.say.messageType
source: Message
ta: செய்தி

# moderation.modUtilities.say.colorField
source: Color:
ta: வண்ணம்:

# moderation.modUtilities.say.jumpButton
source: Jump to message
ta: செய்திக்கு செல்லவும்

# moderation.modUtilities.say.arguments.message.name
source: message
ta: செய்தி

# moderation.modUtilities.say.arguments.message.description
source: The text of the message to be sent
ta: அனுப்பப்பட வேண்டிய செய்தியின் உரை

# moderation.modUtilities.say.arguments.channel.name
source: channel
ta: வாய்க்கால்

# moderation.modUtilities.say.arguments.channel.description
source: The channel the message should be sent in
ta: சேனலை அனுப்ப வேண்டும்

# moderation.modUtilities.say.arguments.embed.name
source: embed
ta: உட்பொதிக்கப்பட்டது

# moderation.modUtilities.say.arguments.embed.description
source: If the message should be sent as an embed
ta: செய்தியை உட்பொதியாக அனுப்ப வேண்டும் என்றால்

# moderation.modUtilities.say.arguments.timestamp.name
source: timestamp
ta: நேர முத்திரை

# moderation.modUtilities.say.arguments.timestamp.description
source: If the message should be sent with a timestamp. Only works with embeds.
ta: செய்தி ஒரு நேர முத்திரையுடன் அனுப்பப்பட வேண்டும் என்றால். உட்பொதிகளுடன் மட்டுமே வேலை செய்கிறது.

# moderation.modUtilities.say.arguments.color.name
source: color
ta: நிறம்

# moderation.modUtilities.say.arguments.color.description
source: The color of the embed. Can be either a hex code or one of Discord's support colors. Embeds only
ta: உட்பொதியின் நிறம். ஒரு ஃச் குறியீடு அல்லது டிச்கார்டின் உதவி வண்ணங்களில் ஒன்றாக இருக்கலாம். உட்பொதிக்கிறது

# moderation.modUtilities.editSay.name
source: edit-say
ta: திருத்து-சே

# moderation.modUtilities.editSay.description
source: Edit a message created by /say
ta: உருவாக்கிய /சொல்லும் செய்தியைத் திருத்தவும்

# moderation.modUtilities.editSay.unableTo
source: I was unable to get the target message! Please check the message exists
ta: இலக்கு செய்தியை என்னால் பெற முடியவில்லை! செய்தி இருப்பதை சரிபார்க்கவும்

# moderation.modUtilities.editSay.notAuthor
source: I did not send this message, I cannot edit it!
ta: நான் இந்த செய்தியை அனுப்பவில்லை, என்னால் அதைத் திருத்த முடியாது!

# moderation.modUtilities.editSay.missingContent
source: Please specify new message contents
ta: புதிய செய்தி உள்ளடக்கங்களைக் குறிப்பிடவும்

# moderation.modUtilities.editSay.maxLength
source: Maximum embed length reached! Your embed length cannot be more than 1024 characters, due to Discord limitations.
ta: அதிகபட்ச உட்பொதி நீளம் அடைந்தது! உங்கள் உட்பொதிக்கப்பட்ட நீளம் 1024 எழுத்துகளுக்கு மேல் இருக்க முடியாது, ஏனெனில் கருத்து வேறுபாடுகள் காரணமாக.

# moderation.modUtilities.editSay.response
source: Message edited
ta: செய்தி திருத்தப்பட்டது

# moderation.modUtilities.editSay.embedTitle
source: Say message edited
ta: செய்தி திருத்தப்பட்டது என்று சொல்லுங்கள்

# moderation.modUtilities.editSay.embedOriginal
source: Original Content
ta: அசல் உள்ளடக்கம்

# moderation.modUtilities.editSay.embedNew
source: New Content
ta: புதிய உள்ளடக்கம்

# moderation.modUtilities.editSay.editedBy
source: Edited by {0}
ta: {0 by ஆல் திருத்தப்பட்டது

# moderation.modUtilities.editSay.embedOldColor
source: Old color
ta: பழைய நிறம்

# moderation.modUtilities.editSay.embedNewColor
source: New Color
ta: புதிய நிறம்

# moderation.modUtilities.editSay.embedHasTime
source: Has Timestamp
ta: நேர முத்திரை உள்ளது

# moderation.modUtilities.editSay.arguments.messageToEdit.name
source: message-to-edit
ta: செய்தி-க்கு-திருத்த

# moderation.modUtilities.editSay.arguments.messageToEdit.description
source: The ID of the message you'd like to edit
ta: நீங்கள் திருத்த விரும்பும் செய்தியின் ஐடி

# moderation.modUtilities.editSay.arguments.newContent.name
source: new-content
ta: புதிய உள்ளடக்க

# moderation.modUtilities.editSay.arguments.newContent.description
source: The new content of the message
ta: செய்தியின் புதிய உள்ளடக்கம்

# moderation.modUtilities.editSay.arguments.newColor.name
source: new-color
ta: புதிய வண்ணம்

# moderation.modUtilities.editSay.arguments.newColor.description
source: The new color of the embed. Can be either a hex code or one of Discord's support colors. Embeds only
ta: உட்பொதியின் புதிய நிறம். ஒரு ஃச் குறியீடு அல்லது டிச்கார்டின் உதவி வண்ணங்களில் ஒன்றாக இருக்கலாம். உட்பொதிக்கிறது

# moderation.modUtilities.editSay.arguments.channelOf.name
source: channel-of-message
ta: சேனல்-ஆஃப்-மெசேச்

# moderation.modUtilities.editSay.arguments.channelOf.description
source: The channel of the message
ta: செய்தியின் சேனல்

# moderation.modUtilities.editSay.arguments.timestamp.name
source: timestamp
ta: நேர முத்திரை

# moderation.modUtilities.editSay.arguments.timestamp.description
source: Whether to timestamp the embed or not. Embeds only
ta: உட்பொதிக்க நேர முத்திரையா இல்லையா. உட்பொதிக்கிறது

# moderation.modUtilities.status.name
source: status
ta: நிலை

# moderation.modUtilities.status.description
source: Set Lily's current presence/status.
ta: லில்லியின் தற்போதைய இருப்பு/நிலையை அமைக்கவும்.

# moderation.modUtilities.status.set.name
source: set
ta: கணம்

# moderation.modUtilities.status.set.description
source: Set a custom status for Lily.
ta: லில்லிக்கு தனிப்பயன் நிலையை அமைக்கவும்.

# moderation.modUtilities.status.set.response
source: Presence set to `{0}`
ta: இருப்பு `{0}` என அமைக்கப்பட்டுள்ளது

# moderation.modUtilities.status.set.embedTitle
source: Presence changed
ta: இருப்பு மாற்றப்பட்டது

# moderation.modUtilities.status.set.embedDesc
source: Lily's presence has been set to `{0}`
ta: லில்லியின் இருப்பு `{0}` என அமைக்கப்பட்டுள்ளது

# moderation.modUtilities.status.reset.name
source: reset
ta: மீட்டமை

# moderation.modUtilities.status.reset.description
source: Reset Lily's presence to the default status.
ta: லில்லியின் இருப்பை இயல்புநிலை நிலைக்கு மீட்டமைக்கவும்.

# moderation.modUtilities.status.reset.response
source: Presence set to default
ta: இருப்பு இயல்புநிலையாக அமைக்கப்பட்டுள்ளது

# moderation.modUtilities.status.reset.embedDesc
source: Lily's presence has been set to default
ta: லில்லியின் இருப்பு இயல்புநிலையாக அமைக்கப்பட்டுள்ளது

# moderation.modUtilities.status.reset.embedValue
source: Watching {0} servers.
ta: {0} சேவையகங்களைப் பார்ப்பது.

# moderation.modUtilities.status.arguments.presence.name
source: presence
ta: இருப்பு

# moderation.modUtilities.status.arguments.presence.description
source: The new value Lily's presence should be set to
ta: புதிய மதிப்பு லில்லியின் இருப்பு அமைக்கப்பட வேண்டும்

# moderation.modUtilities.status.arguments.presenceType.name
source: presence-type
ta: இருப்பு வகை

# moderation.modUtilities.status.arguments.presenceType.description
source: The type of presence to use. E.G.: Playing / Watching / Listening to
ta: பயன்படுத்த வேண்டிய இருப்பு வகை. எ.கா.: விளையாடுவது / பார்ப்பது / கேட்பது

# moderation.modUtilities.status.arguments.presenceType.nothing
source: Nothing
ta: எதுவும்

# moderation.modUtilities.status.arguments.presenceType.playing
source: Playing
ta: விளையாடுவது

# moderation.modUtilities.status.arguments.presenceType.listening
source: Listening
ta: கேட்பது

# moderation.modUtilities.status.arguments.presenceType.streaming
source: Streaming
ta: ச்ட்ரீமிங்

# moderation.modUtilities.status.arguments.presenceType.watching
source: Watching
ta: பார்ப்பது

# moderation.modUtilities.status.arguments.presenceType.competing
source: Competing
ta: போட்டி

# moderation.modUtilities.reset.name
source: reset
ta: மீட்டமை

# moderation.modUtilities.reset.description
source: 'Resets' Lily for this guild by deleting all database information relating to this guild
ta: இந்த கில்ட் தொடர்பான அனைத்து தரவுத்தள தகவல்களையும் நீக்குவதன் மூலம் இந்த கில்டுக்கு 'மீட்டமைக்கிறது'

# moderation.modUtilities.reset.failResponse
source: Confirmation failure. Reset cancelled
ta: உறுதிப்படுத்தல் தோல்வி. மீட்டமைக்கப்பட்டது ரத்து செய்யப்பட்டது

# moderation.modUtilities.reset.tripleCheck
source: Are you sure you want to reset the database? This will remove all data associated with this guild from Lily's database. This includes configs, user-set reminders, usernames and more. This action is **irreversible** and the data **cannot** be recovered.
ta: தரவுத்தளத்தை மீட்டமைக்க விரும்புகிறீர்களா? இது லில்லியின் தரவுத்தளத்திலிருந்து இந்த கில்டுடன் தொடர்புடைய எல்லா தரவையும் அகற்றும். இதில் உள்ளமைவுகள், பயனர்-அமைக்கப்பட்ட நினைவூட்டல்கள், பயனர்பெயர்கள் மற்றும் பல உள்ளன. இந்த நடவடிக்கை ** மீளமுடியாத ** மற்றும் தரவு ** ** மீட்டெடுக்க முடியாது.

# moderation.modUtilities.reset.yesButton
source: I'm sure
ta: நான் உறுதியாக இருக்கிறேன்

# moderation.modUtilities.reset.resetResponse
source: Database reset!
ta: தரவுத்தள மீட்டமைப்பு!

# moderation.modUtilities.reset.embedDesc
source: All data associated with this guild has been removed.
ta: இந்த கில்டுடன் தொடர்புடைய அனைத்து தரவும் அகற்றப்பட்டுள்ளன.

# moderation.modUtilities.reset.noButton
source: Nevermind
ta: பரவாயில்லை

# moderation.modUtilities.reset.cancelResponse
source: Reset Cancelled
ta: மீட்டமைக்கப்பட்டது ரத்து செய்யப்பட்டது

# moderation.modUtilities.reset.modal.title
source: Reset data for this guild
ta: இந்த கில்டுக்கான தரவை மீட்டமைக்கவும்

# moderation.modUtilities.reset.modal.confirmation.label
source: Confirm Reset
ta: மீட்டமைப்பை உறுதிப்படுத்தவும்

# moderation.modUtilities.reset.modal.confirmation.placeholder
source: Type `yes` to confirm
ta: உறுதிப்படுத்த `ஆம்` என தட்டச்சு செய்க

# moderation.report.noAccess
source: Sorry, I can't properly access this message. Please ping the moderators instead.
ta: மன்னிக்கவும், இந்த செய்தியை என்னால் சரியாக அணுக முடியாது. அதற்கு பதிலாக மதிப்பீட்டாளர்களை பிங் செய்யுங்கள்.

# moderation.report.ownMessage
source: You may not report your own message.
ta: உங்கள் சொந்த செய்தியை நீங்கள் புகாரளிக்கக்கூடாது.

# moderation.report.messageCommand.name
source: Report
ta: அறிக்கை

# moderation.report.slashCommand.name
source: manual-report
ta: கையேடு-அறிக்கை

# moderation.report.slashCommand.description
source: Report a message, using a link instead of the message command
ta: செய்தி கட்டளைக்கு பதிலாக இணைப்பைப் பயன்படுத்தி ஒரு செய்தியைப் புகாரளிக்கவும்

# moderation.report.slashCommand.malformedLink
source: The URL provided was malformed and the message could not be found!
ta: வழங்கப்பட்ட முகவரி தவறாக இருந்தது மற்றும் செய்தியைக் கண்டுபிடிக்க முடியவில்லை!

# moderation.report.slashCommand.arguments.message.name
source: message-link
ta: செய்தி-இணைப்பு

# moderation.report.slashCommand.arguments.message.description
source: Link to the message to report
ta: புகாரளிக்க செய்தியுடன் இணைக்கவும்

# moderation.report.confirmation.content
source: Would you like to report this message? This will ping moderators, and false reporting will be treated as spam and punished accordingly
ta: இந்த செய்தியைப் புகாரளிக்க விரும்புகிறீர்களா? இது மதிப்பீட்டாளர்களை பிங் செய்யும், மற்றும் தவறான அறிக்கையிடல் ச்பேமாகக் கருதப்பட்டு அதற்கேற்ப தண்டிக்கப்படும்

# moderation.report.confirmation.response
source: Message reported to staff
ta: ஊழியர்களுக்கு செய்தி தெரிவிக்கப்படுகிறது

# moderation.report.confirmation.embedTitle
source: Message reported
ta: செய்தி தெரிவிக்கப்பட்டது

# moderation.report.confirmation.embedDesc
source: A message was reported in {0}
ta: {0} இல் ஒரு செய்தி தெரிவிக்கப்பட்டது

# moderation.report.confirmation.embedContentField
source: Message Content:
ta: செய்தி உள்ளடக்கம்:

# moderation.report.confirmation.embedAuthorField
source: Message Author:
ta: செய்தி ஆசிரியர்:

# moderation.report.confirmation.embedReasonField
source: Report Reason:
ta: அறிக்கை காரணம்:

# moderation.report.confirmation.embedReportedBy
source: Reported by: {0}
ta: அறிவித்தது: {0}

# moderation.report.confirmation.jumpButton
source: Jump to message
ta: செய்திக்கு செல்லவும்

# moderation.report.confirmation.notReported
source: Message not reported
ta: செய்தி தெரிவிக்கப்படவில்லை

# moderation.report.modal.title
source: Report a message
ta: ஒரு செய்தியைப் புகாரளிக்கவும்

# moderation.report.modal.label
source: Why are you reporting this message
ta: இந்த செய்தியை ஏன் புகாரளிக்கிறீர்கள்

# moderation.report.modal.placeholder
source: It violates rule X!
ta: இது விதி ஃச் ஐ மீறுகிறது!

# threads.autoThreading.name
source: auto-threading
ta: ஆட்டோ-த்ரெட்டிங்

# threads.autoThreading.description
source: The parent command for auto-threading management.
ta: ஆட்டோ-த்ரெட்டிங் நிர்வாகத்திற்கான பெற்றோர் கட்டளை.

# threads.autoThreading.alreadyOn
source: Auto-threading is already enabled for this channel.
ta: இந்த சேனலுக்கு ஆட்டோ-த்ரெட்டிங் ஏற்கனவே இயக்கப்பட்டிருக்கிறது.

# threads.autoThreading.alreadyOff
source: Auto-threading is not enabled for this channel.
ta: இந்த சேனலுக்கு ஆட்டோ-த்ரெட்டிங் இயக்கப்படவில்லை.

# threads.autoThreading.enable.name
source: enable
ta: இயக்கு

# threads.autoThreading.enable.description
source: Automatically create a thread for each message sent in this channel.
ta: இந்த சேனலில் அனுப்பப்பட்ட ஒவ்வொரு செய்திக்கும் தானாக ஒரு நூலை உருவாக்கவும்.

# threads.autoThreading.enable.noMention
source: Lily cannot mention this role. Please fix the role's permissions and try again.
ta: இந்த பாத்திரத்தை லில்லி குறிப்பிட முடியாது. பாத்திரத்தின் அனுமதிகளை சரிசெய்து மீண்டும் முயற்சிக்கவும்.

# threads.autoThreading.enable.enabled
source: Auto-threading has been **enabled** in this channel.
ta: இந்த சேனலில் ஆட்டோ-த்ரெட்டிங் ** இயக்கப்பட்டது **.

# threads.autoThreading.enable.embed.title
source: Auto-threading Enabled
ta: ஆட்டோ-த்ரெட்டிங் இயக்கப்பட்டது

# threads.autoThreading.enable.embed.channel
source: Channel:
ta: சேனல்:

# threads.autoThreading.enable.embed.role
source: Role:
ta: பங்கு:

# threads.autoThreading.enable.embed.preventDuplicates
source: Prevent Duplicates:
ta: நகல்களைத் தடுக்கவும்:

# threads.autoThreading.enable.embed.beginArchived
source: Begin Archived:
ta: காப்பகத்தைத் தொடங்குங்கள்:

# threads.autoThreading.enable.embed.smartNaming
source: Smart Naming Enabled:
ta: அறிவுள்ள பெயரிடுதல் இயக்கப்பட்டது:

# threads.autoThreading.enable.embed.mention
source: Mention:
ta: குறிப்பு:

# threads.autoThreading.enable.embed.initialMessage
source: Initial Message:
ta: தொடக்க செய்தி:

# threads.autoThreading.disable.name
source: disable
ta: முடக்கு

# threads.autoThreading.disable.description
source: Stop automatically creating threads in this channel.
ta: இந்த சேனலில் தானாகவே நூல்களை உருவாக்குவதை நிறுத்துங்கள்.

# threads.autoThreading.disable.disabled
source: Auto-threading has been **disabled** in this channel.
ta: இந்த சேனலில் ஆட்டோ-த்ரெட்டிங் ** முடக்கப்பட்டது **.

# threads.autoThreading.disable.embed.title
source: Auto-threading Disabled
ta: ஆட்டோ-த்ரெட்டிங் முடக்கப்பட்டது

# threads.autoThreading.disable.embed.channel
source: Channel:
ta: சேனல்:

# threads.autoThreading.list.name
source: list
ta: பட்டியல்

# threads.autoThreading.list.description
source: List all the auto-threaded channels in this server, if any.
ta: இந்த சேவையகத்தில் உள்ள அனைத்து ஆட்டோ-திரிக்கப்பட்ட சேனல்களையும் பட்டியலிடுங்கள்.

# threads.autoThreading.list.noChannels
source: There are no auto-threaded channels in this guild.
ta: இந்த கில்டில் ஆட்டோ-திரிக்கப்பட்ட சேனல்கள் எதுவும் இல்லை.

# threads.autoThreading.list.addNewChannels
source: Add new ones by using `/auto-threading enable`
ta: `/ஆட்டோ-த்ரெடிங் இயக்கு` ஐப் பயன்படுத்தி புதியவற்றைச் சேர்க்கவும்

# threads.autoThreading.list.channelList
source: Auto-threaded channels in this guild:
ta: இந்த கில்டில் தானாக திரிக்கப்பட்ட சேனல்கள்:

# threads.autoThreading.list.trimmed
source: (List trimmed.)
ta: (பட்டியல் ஒழுங்கமைக்கப்பட்டது.)

# threads.autoThreading.view.name
source: view
ta: பார்வை

# threads.autoThreading.view.description
source: View the settings of an auto-threaded channel
ta: ஆட்டோ-திரிக்கப்பட்ட சேனலின் அமைப்புகளைக் காண்க

# threads.autoThreading.view.noThreaded
source: **Error:** This is not an auto-threaded channel!
ta: ** பிழை: ** இது ஆட்டோ-திரட்டப்பட்ட சேனல் அல்ல!

# threads.autoThreading.view.embed.title
source: Auto-Threaded channel settings
ta: தானாக திரிக்கப்பட்ட சேனல் அமைப்புகள்

# threads.autoThreading.view.embed.description
source: These are the settings for channel: {0}
ta: சேனலுக்கான அமைப்புகள் இவை: {0}

# threads.autoThreading.view.embed.role
source: Ping role
ta: பிங் பங்கு

# threads.autoThreading.view.embed.unable
source: Unable to get role!
ta: பாத்திரத்தைப் பெற முடியவில்லை!

# threads.autoThreading.view.embed.extraRoles
source: Extra Ping Roles
ta: கூடுதல் பிங் பாத்திரங்கள்

# threads.autoThreading.view.embed.preventDuplicates
source: Prevent Duplicates
ta: நகல்களைத் தடுக்கவும்

# threads.autoThreading.view.embed.archiveOnStart
source: Archive on Creation
ta: படைப்பில் காப்பகம்

# threads.autoThreading.view.embed.contentAwareNaming
source: Content Aware Naming
ta: உள்ளடக்க விழிப்புணர்வு பெயரிடுதல்

# threads.autoThreading.view.embed.mentionCreator
source: Mention creator on creation
ta: படைப்பில் படைப்பாளரைக் குறிப்பிடவும்

# threads.autoThreading.view.embed.creationMessage
source: Creation Message
ta: உருவாக்கும் செய்தி

# threads.autoThreading.view.embed.addMods
source: Add mods and ping role
ta: மோட்ச் மற்றும் பிங் பாத்திரத்தை சேர்க்கவும்

# threads.autoThreading.addRoles.name
source: add-roles
ta: கூடுதல் பாத்திரங்கள்

# threads.autoThreading.addRoles.description
source: Add extra roles to threads in auto-threaded channels
ta: ஆட்டோ-திரிக்கப்பட்ட சேனல்களில் நூல்களுக்கு கூடுதல் பாத்திரங்களைச் சேர்க்கவும்

# threads.autoThreading.addRoles.extraInfo
source: This command will add roles to be pinged alongside the default ping role for this auto-threaded channel
ta: இந்த கட்டளை இந்த ஆட்டோ-திரிக்கப்பட்ட சேனலுக்கான இயல்புநிலை பிங் பாத்திரத்துடன் பிங் செய்யப்பட வேண்டிய பாத்திரங்களை சேர்க்கும்

# threads.autoThreading.addRoles.noThreaded
source: **Error:** This is not an auto-threaded channel!
ta: ** பிழை: ** இது ஆட்டோ-திரட்டப்பட்ட சேனல் அல்ல!

# threads.autoThreading.addRoles.alreadyAdded
source: This role has already been added.
ta: இந்த பங்கு ஏற்கனவே சேர்க்கப்பட்டுள்ளது.

# threads.autoThreading.addRoles.added
source: Role ({0}) added
ta: பங்கு ({0}) சேர்க்கப்பட்டது

# threads.autoThreading.removeRoles.name
source: remove-roles
ta: நீக்குதல்-பாத்திரங்கள்

# threads.autoThreading.removeRoles.description
source: Remove extra roles from threads in auto-threaded channels
ta: ஆட்டோ-திரிக்கப்பட்ட சேனல்களில் உள்ள நூல்களிலிருந்து கூடுதல் பாத்திரங்களை அகற்று

# threads.autoThreading.removeRoles.extraInfo
source: This command will remove roles that have been added to be pinged alongside the default ping role for this auto-threaded channel
ta: இந்த கட்டளை இந்த ஆட்டோ-திரட்டப்பட்ட சேனலுக்கான இயல்புநிலை பிங் பாத்திரத்துடன் சேர்க்கப்பட்ட பாத்திரங்களை அகற்றும்

# threads.autoThreading.removeRoles.notAdded
source: This role has not been added
ta: இந்த பங்கு சேர்க்கப்படவில்லை

# threads.autoThreading.removeRoles.removed
source: Role ({0}) removed
ta: பங்கு ({0}) அகற்றப்பட்டது

# threads.autoThreading.arguments.role.name
source: role
ta: பங்கு

# threads.autoThreading.arguments.role.description
source: The role, if any, to invite to threads created in this channel.
ta: இந்த சேனலில் உருவாக்கப்பட்ட நூல்களுக்கு அழைக்க பாத்திரம் ஏதேனும் இருந்தால்.

# threads.autoThreading.arguments.addMods.name
source: add-mods-and-role
ta: கூடுதல்-தொகுதிகள் மற்றும் பங்கு

# threads.autoThreading.arguments.addMods.description
source: Whether to add moderators to the thread alongside the role
ta: பாத்திரத்துடன் நூலில் மதிப்பீட்டாளர்களைச் சேர்க்கலாமா?

# threads.autoThreading.arguments.preventDuplicates.name
source: prevent-duplicates
ta: -நகல்களைத் தடுக்கவும்

# threads.autoThreading.arguments.preventDuplicates.description
source: If users should be stopped from having multiple open threads in this channel. Default false.
ta: இந்த சேனலில் பல திறந்த நூல்கள் இருப்பதை பயனர்கள் நிறுத்த வேண்டும். இயல்புநிலை தவறு.

# threads.autoThreading.arguments.archive.name
source: archive
ta: காப்பகம்

# threads.autoThreading.arguments.archive.description
source: If threads should be archived on creation to avoid filling the sidebar. Default false.
ta: பக்கப்பட்டியை நிரப்புவதைத் தவிர்க்க நூல்கள் படைப்பில் காப்பகப்படுத்தப்பட வேண்டும். இயல்புநிலை தவறு.

# threads.autoThreading.arguments.contentAware.name
source: content-aware-naming
ta: உள்ளடக்கம்-விழிப்புணர்வு

# threads.autoThreading.arguments.contentAware.description
source: If Lily should use content-aware thread titles. Default false
ta: லில்லி உள்ளடக்க-விழிப்புணர்வு நூல் தலைப்புகளைப் பயன்படுத்த வேண்டும் என்றால். இயல்புநிலை தவறு

# threads.autoThreading.arguments.mention.name
source: mention
ta: குறிப்பு

# threads.autoThreading.arguments.mention.description
source: If the creator should be mentioned in new threads in this channel. Default false.
ta: படைப்பாளரை இந்த சேனலில் புதிய நூல்களில் குறிப்பிட வேண்டும் என்றால். இயல்புநிலை தவறு.

# threads.autoThreading.arguments.message.name
source: message
ta: செய்தி

# threads.autoThreading.arguments.message.description
source: Whether to send a custom message on thread creation or not. Default false.
ta: நூல் உருவாக்கத்தில் தனிப்பயன் செய்தியை அனுப்ப வேண்டுமா இல்லையா. இயல்புநிலை தவறு.

# threads.autoThreading.arguments.extraRole.description
source: A role to invite to threads in this channel
ta: இந்த சேனலில் நூல்களுக்கு அழைக்க ஒரு பங்கு

# threads.autoThreading.arguments.channel.name
source: channel
ta: வாய்க்கால்

# threads.autoThreading.arguments.channel.description
source: The channel to view the auto-threading settings for.
ta: ஆட்டோ-த்ரெட்டிங் அமைப்புகளைக் காண சேனல்.

# threads.autoThreading.arguments.targetChannel.description
source: The target channel for auto-threading
ta: ஆட்டோ-த்ரெடிங்கிற்கான இலக்கு சேனல்

# threads.autoThreading.modal.title
source: Thread Creation Message Configuration
ta: நூல் உருவாக்கம் செய்தி உள்ளமைவு

# threads.autoThreading.modal.msgInput.name
source: Thread Creation Message
ta: நூல் உருவாக்கும் செய்தி

# threads.autoThreading.modal.msgInput.placeholder
source: Input the content of the message to send when a thread is created in this channel
ta: இந்த சேனலில் ஒரு நூல் உருவாக்கப்படும்போது அனுப்ப செய்தியின் உள்ளடக்கத்தை உள்ளிடவும்

# threads.autoThreading.threadFor
source: Thread for {0}
ta: {0 க்கு க்கான நூல்

# threads.autoThreading.existingThread
source: Please use your existing thread in this channel {0}
ta: இந்த சேனலில் உங்கள் இருக்கும் நூலைப் பயன்படுத்தவும் {0}

# threads.threadControl.name
source: thread
ta: நூல்

# threads.threadControl.description
source: The parent command for all /thread commands
ta: அனைத்து /நூல் கட்டளைகளுக்கும் பெற்றோர் கட்டளை

# threads.threadControl.rename.name
source: rename
ta: மறுபெயரிடுங்கள்

# threads.threadControl.rename.description
source: Rename a thread!
ta: ஒரு நூல் மறுபெயரிடுங்கள்!

# threads.threadControl.rename.renamedBy
source: Renamed by {0}
ta: {0 by ஆல் மறுபெயரிடப்பட்டது

# threads.threadControl.rename.renamed
source: Thread renamed!
ta: நூல் மறுபெயரிடப்பட்டது!

# threads.threadControl.archive.name
source: archive
ta: காப்பகம்

# threads.threadControl.archive.description
source: Archive this thread
ta: இந்த நூலை காப்பகப்படுத்தவும்

# threads.threadControl.archive.preventionDisabled.title
source: Thread archive prevention disabled
ta: நூல் காப்பக தடுப்பு முடக்கப்பட்டுள்ளது

# threads.threadControl.archive.preventionDisabled.description
source: Archive prevention has been disabled, as `/thread archive` was used.
ta: `/நூல் காப்பகம்` பயன்படுத்தப்பட்டதால், காப்பக தடுப்பு முடக்கப்பட்டுள்ளது.

# threads.threadControl.archive.user
source: User
ta: பயனர்

# threads.threadControl.archive.thread
source: Thread
ta: நூல்

# threads.threadControl.archive.already
source: **Error:** This channel is already archived!
ta: ** பிழை: ** இந்த சேனல் ஏற்கனவே காப்பகப்படுத்தப்பட்டுள்ளது!
