Repository: 247i/TACETr
Catalog: உரை/தானி/lilybot-lilybot-translations-*.po
Languages: ta

# utility.roleMenu.check.higherRole
source: The selected role is higher than me in the role hierarchy. Please move it and try again.
ta: தேர்ந்தெடுக்கப்பட்ட பங்கு பங்கு வரிசைக்கு என்னை விட அதிகமாக உள்ளது. தயவுசெய்து அதை நகர்த்தி மீண்டும் முயற்சிக்கவும்.

# utility.roleMenu.roleSubscription.name
source: role-subscription
ta: ரோல்-சப்ச்கிரிப்சன்

# utility.roleMenu.roleSubscription.description
source: The parent command for role-subscription commands
ta: பங்கு-சந்தா கட்டளைகளுக்கான பெற்றோர் கட்டளை

# utility.roleMenu.roleSubscription.update.name
source: update
ta: புதுப்பிப்பு

# utility.roleMenu.roleSubscription.update.description
source: Update your role subscription
ta: உங்கள் பங்கு சந்தாவை புதுப்பிக்கவும்

# utility.roleMenu.roleSubscription.update.noSubs
source: This guild does not have any subscribable roles.
ta: இந்த கில்ட்டுக்கு சந்தா செலுத்தக்கூடிய பாத்திரங்கள் எதுவும் இல்லை.

# utility.roleMenu.roleSubscription.update.useMenu
source: Use the menu below to subscribe to roles.
ta: பாத்திரங்களுக்கு குழுசேர கீழே உள்ள மெனுவைப் பயன்படுத்தவும்.

# utility.roleMenu.roleSubscription.update.placeholder
source: Select roles to subscribe to...
ta: குழுசேர பாத்திரங்களைத் தேர்ந்தெடுக்கவும் ...

# utility.roleMenu.roleSubscription.update.adjusted
source: Your role subscription has been adjusted
ta: உங்கள் பங்கு சந்தா சரிசெய்யப்பட்டுள்ளது

# utility.roleMenu.roleSubscription.add.name
source: add-role
ta: கூடுதல்-பாத்திரம்

# utility.roleMenu.roleSubscription.add.description
source: Add a role that can be added through role subscription commands
ta: பங்கு சந்தா கட்டளைகள் மூலம் சேர்க்கக்கூடிய ஒரு பாத்திரத்தைச் சேர்க்கவும்

# utility.roleMenu.roleSubscription.add.response
source: {0} was added as a subscribable role. Current subscribable roles are: {0}
ta: {0} சந்தா செலுத்தக்கூடிய பாத்திரமாக சேர்க்கப்பட்டது. தற்போதைய சந்தா பாத்திரங்கள்: {0}

# utility.roleMenu.roleSubscription.add.embedTitle
source: Subscribable Role added
ta: சந்தா பங்கு சேர்க்கப்பட்டது

# utility.roleMenu.roleSubscription.add.embedDesc
source: {0} was added as a subscribable role
ta: {0} சந்தா செலுத்தக்கூடிய பாத்திரமாக சேர்க்கப்பட்டது

# utility.roleMenu.roleSubscription.add.addedBy
source: Added by {0}
ta: {0 by ஆல் சேர்க்கப்பட்டது

# utility.roleMenu.roleSubscription.remove.name
source: remove-role
ta: அகற்று-பங்கு

# utility.roleMenu.roleSubscription.remove.description
source: Remove a role that can be added through role subscription commands
ta: பங்கு சந்தா கட்டளைகள் மூலம் சேர்க்கக்கூடிய ஒரு பாத்திரத்தை அகற்று

# utility.roleMenu.roleSubscription.remove.notSubable
source: This is not a subscribable role.
ta: இது சந்தா பங்கு அல்ல.

# utility.roleMenu.roleSubscription.remove.response
source: {0} was removed as a subscribable role. Current subscribable roles are: {0}
ta: {0} சந்தாதாரர் பாத்திரமாக அகற்றப்பட்டது. தற்போதைய சந்தா பாத்திரங்கள்: {0}

# utility.roleMenu.roleSubscription.remove.embedTitle
source: Subscribable Role removed
ta: சந்தா பங்கு அகற்றப்பட்டது

# utility.roleMenu.roleSubscription.remove.embedDesc
source: {0} was removed as a subscribable role
ta: {0} சந்தாதாரர் பாத்திரமாக அகற்றப்பட்டது

# utility.roleMenu.roleSubscription.remove.removedBy
source: Removed by {0}
ta: {0 by ஆல் அகற்றப்பட்டது

# utility.roleMenu.roleSubscription.arguments.role.description
source: A role to add or remove from the subscribable roles
ta: சந்தா செலுத்தக்கூடிய பாத்திரங்களிலிருந்து சேர்க்க அல்லது அகற்ற ஒரு பங்கு

# utility.startupHooks.onlineTitle
source: Lily is now online!
ta: லில்லி இப்போது ஆன்லைனில் இருக்கிறார்!

# utility.tags.unableToFind
source: Unable to find tag `{0}`. Be sure it exists and is spelt correctly
ta: குறிச்சொல் `{0}` கண்டுபிடிக்க முடியவில்லை. அது உள்ளது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் மற்றும் சரியாக உச்சரிக்கப்படுகிறது

# utility.tags.bodyTooLongSomehow
source: The body of this tag is too long! Somehow this tag has a body of 4096 characters or more, which is above the Discord limit. Please re-create this tag!
ta: இந்த குறிச்சொல்லின் உடல் மிக நீளமானது! எப்படியாவது இந்த குறிச்சொல்லில் 4096 எழுத்துக்கள் அல்லது அதற்கு மேற்பட்ட உடல் உள்ளது, இது முரண்பாடு வரம்பை விட அதிகமாக உள்ளது. தயவுசெய்து இந்த குறிச்சொல்லை மீண்டும் உருவாக்கவும்!

# utility.tags.bodyTooLong
source: That tag's body is too long! Due to Discord limitations tag bodies can only be 4096 characters or fewer!
ta: அந்த குறிச்சொல்லின் உடல் மிக நீளமானது! முரண்பாடு வரம்புகள் காரணமாக குறிச்சொல் உடல்கள் 4096 எழுத்துக்கள் அல்லது அதற்கும் குறைவாக மட்டுமே இருக்க முடியும்!

# utility.tags.tooLongTitle
source: That tag's title is too long! Due to Discord limitations tag titles can only be 256 characters or fewer!
ta: அந்த குறிச்சொல்லின் தலைப்பு மிக நீளமானது! முரண்பாடு வரம்புகள் காரணமாக குறிச்சொல் தலைப்புகள் 256 எழுத்துக்கள் அல்லது அதற்கும் குறைவாக மட்டுமே இருக்க முடியும்!

# utility.tags.tagAppearance
source: Tag appearance
ta: குறிச்சொல் தோற்றம்

# utility.tags.preview.name
source: tag-preview
ta: குறிச்சொல்-முன்னுரிமை

# utility.tags.preview.description
source: Preview a tag''s contents without sending it publicly.
ta: ஒரு குறிச்சொல்லின் உள்ளடக்கங்களை பகிரங்கமாக அனுப்பாமல் முன்னோட்டமிடுங்கள்.

# utility.tags.preview.footer
source: Tag preview
ta: குறிச்சொல் முன்னோட்டம்

# utility.tags.tag.name
source: tag
ta: குறிச்சொல்

# utility.tags.tag.description
source: Call a tag from this guild! Use /tag-help for more info.
ta: இந்த கில்டிலிருந்து ஒரு குறிச்சொல்லை அழைக்கவும்! மேலும் தகவலுக்கு /குறிச்சொல்-உதவியைப் பயன்படுத்தவும்.

# utility.tags.tag.response
source: Tag sent
ta: குறிச்சொல் அனுப்பப்பட்டது

# utility.tags.tag.footer
source: Tag requested by {0}
ta: குறிச்சொல் {0 by ஆல் கோரப்பட்டது

# utility.tags.tag.embedTitle
source: Message Tag used
ta: செய்தி குறிச்சொல் பயன்படுத்தப்பட்டது

# utility.tags.tag.embedName
source: Tag name:
ta: குறிச்சொல் பெயர்:

# utility.tags.tag.embedLocation
source: Location
ta: இடம்

# utility.tags.tag.embedFooter
source: User ID: {0}
ta: பயனர் ஐடி: {0}

# utility.tags.tag.arguments.name.name
source: name
ta: பெயர்

# utility.tags.tag.arguments.name.description
source: The name of the tag
ta: குறிச்சொல்லின் பெயர்

# utility.tags.tag.arguments.user.name
source: user
ta: பயனர்

# utility.tags.tag.arguments.user.description
source: The user to mention with the tag (optional)
ta: குறிச்சொல்லுடன் குறிப்பிட வேண்டிய பயனர் (விரும்பினால்)

# utility.tags.tagHelp.name
source: tag-help
ta: குறிச்சொல்-உதவி

# utility.tags.tagHelp.description
source: Explains how the tag command works
ta: குறிச்சொல் கட்டளை எவ்வாறு செயல்படுகிறது என்பதை விளக்குகிறது

# utility.tags.tagHelp.title
source: How does the tag system work?
ta: டேக் சிச்டம் எவ்வாறு செயல்படுகிறது?

# utility.tags.tagHelp.content
source: The tag command allows users to add guild specific 'tag' commands at runtime to their guild. **Tags are like custom commands**, they can do say what ever you want them to say. **To create a tag**, if you have the Moderate Members permission, run the following command: `/tag-create <name> <title> <value>` You will be prompted to enter a name for the tag, a title for the tag, and the value for the tag. This is what will appear in the embed of your tag. You can enter any character you like into all of these inputs. **To use a tag**, run the following command: `/tag <name>` You will be prompted to enter a tag name, but will have an autocomplete window to aid you. The window will list all the tags that the guild has. **To delete a tag**, if you have the Moderate Members permission, run the following command: `/tag-delete <name>` You will be prompted to enter the name of the tag, again aided by autocomplete. `/tag-edit` You will be prompted to enter a tag name, but will have an autocomplete window to aid you. The window will list all the tags that the guild has. From there you can enter a new name, title or value. None of these are mandatory. `/tag-list` Displays a paginated list of all tags for this guild. There are 10 tags on each page. **Guilds can have any number of tags they like.** The limit on `tagValue` for tags is 4096 characters, which is the embed description limit enforced by Discord.
ta: TAG கட்டளை பயனர்கள் தங்கள் கில்டில் இயக்க நேரத்தில் கில்ட் குறிப்பிட்ட 'குறிச்சொல்' கட்டளைகளைச் சேர்க்க அனுமதிக்கிறது. ** குறிச்சொற்கள் தனிப்பயன் கட்டளைகள் போன்றவை **, அவர்கள் என்ன சொல்ல வேண்டும் என்று நீங்கள் எப்போது வேண்டுமானாலும் சொல்லலாம். ** ஒரு குறிச்சொல்லை உருவாக்க **, உங்களிடம் மிதமான உறுப்பினர்கள் இசைவு இருந்தால், பின்வரும் கட்டளையை இயக்கவும்: `/குறிச்சொல்-உருவாக்கவும் <aname> <title> <value>` குறிச்சொல்லின் பெயர், குறிச்சொல்லின் தலைப்பு மற்றும் குறிச்சொல்லின் மதிப்பு ஆகியவற்றை உள்ளிடும்படி கேட்கப்படுவீர்கள். இதுதான் உங்கள் குறிச்சொல்லின் உட்பொதிப்பில் தோன்றும். இந்த உள்ளீடுகள் அனைத்திலும் நீங்கள் விரும்பும் எந்தவொரு கதாபாத்திரத்தையும் உள்ளிடலாம். ** ஒரு குறிச்சொல்லைப் பயன்படுத்த **, பின்வரும் கட்டளையை இயக்கவும்: `/குறிச்சொல் <பெயர்>` குறிச்சொல் பெயரை உள்ளிடுமாறு கேட்கப்படுவீர்கள், ஆனால் உங்களுக்கு உதவ ஒரு தன்னியக்க வேறுபாடு சாளரம் இருக்கும். கில்ட் வைத்திருக்கும் அனைத்து குறிச்சொற்களையும் சாளரம் பட்டியலிடும். ** ஒரு குறிச்சொல்லை நீக்க **, உங்களிடம் மிதமான உறுப்பினர்கள் இசைவு இருந்தால், பின்வரும் கட்டளையை இயக்கவும்: `/டேக்-டெலேட் <பெயர்>` குறிச்சொல்லின் பெயரை உள்ளிடும்படி கேட்கப்படுவீர்கள், மீண்டும் தன்னியக்கவியல் உதவியுடன். `/tag-edit` குறிச்சொல் பெயரை உள்ளிடுமாறு கேட்கப்படுவீர்கள், ஆனால் உங்களுக்கு உதவ ஒரு தன்னியக்க வேறுபாடு சாளரம் இருக்கும். கில்ட் வைத்திருக்கும் அனைத்து குறிச்சொற்களையும் சாளரம் பட்டியலிடும். அங்கிருந்து நீங்கள் ஒரு புதிய பெயர், தலைப்பு அல்லது மதிப்பை உள்ளிடலாம். இவை எதுவும் கட்டாயமில்லை. `/குறிச்சொல்-பட்டியல்` இந்த கில்டிற்கான அனைத்து குறிச்சொற்களின் சிறிய பட்டியலைக் காட்டுகிறது. ஒவ்வொரு பக்கத்திலும் 10 குறிச்சொற்கள் உள்ளன. ** கில்ட்ச் அவர்கள் விரும்பும் எந்த குறிச்சொற்களையும் கொண்டிருக்கலாம். ** குறிச்சொற்களுக்கான `டேக் மதிப்புக்கான வரம்பு 4096 எழுத்துக்கள், இது முரண்பாட்டால் செயல்படுத்தப்படும் உட்பொதிக்கப்பட்ட விளக்க வரம்பு ஆகும்.

# utility.tags.create.name
source: tag-create
ta: குறிச்சொல்-உருவாக்கவும்

# utility.tags.create.description
source: Create a tag for your guild! Use /tag-help for more info.
ta: உங்கள் கில்டுக்கு ஒரு குறிச்சொல்லை உருவாக்கவும்! மேலும் தகவலுக்கு /குறிச்சொல்-உதவியைப் பயன்படுத்தவும்.

# utility.tags.create.already
source: A tag with that name already exists in this guild
ta: இந்த கில்டில் ஏற்கனவே அந்த பெயருடன் ஒரு குறிச்சொல் உள்ளது

# utility.tags.create.embedTitle
source: Tag created!
ta: குறிச்சொல் உருவாக்கப்பட்டது!

# utility.tags.create.embedDesc
source: The tag `{0}` has been created
ta: குறிச்சொல் `{0}` உருவாக்கப்பட்டது

# utility.tags.create.embedTagTitle
source: Tag title:
ta: குறிச்சொல் தலைப்பு:

# utility.tags.create.embedTagValue
source: Tag value:
ta: குறிச்சொல் மதிப்பு:

# utility.tags.create.response
source: Tag: `{0}` created
ta: குறிச்சொல்: `{0}` உருவாக்கப்பட்டது

# utility.tags.create.arguments.title.name
source: title
ta: தலைப்பு

# utility.tags.create.arguments.title.description
source: The title of the tag embed
ta: குறிச்சொல்லின் தலைப்பு

# utility.tags.create.arguments.content.name
source: value
ta: மதிப்பு

# utility.tags.create.arguments.content.description
source: The content of the tag embed you're making
ta: நீங்கள் உருவாக்கும் குறிச்சொல்லின் உள்ளடக்கம்

# utility.tags.create.arguments.appearance.name
source: appearance
ta: தோற்றம்

# utility.tags.create.arguments.appearance.description
source: The appearance of the tag embed you're making
ta: நீங்கள் உருவாக்கும் குறிச்சொல்லின் தோற்றம்

# utility.tags.create.arguments.appearance.choice.embed
source: embed
ta: உட்பொதிக்கப்பட்டது

# utility.tags.create.arguments.appearance.choice.message
source: message
ta: செய்தி

# utility.tags.delete.name
source: tag-delete
ta: டேக்-டெலேட்

# utility.tags.delete.description
source: Delete a tag from your guild. Use /tag-help for more info.
ta: உங்கள் கில்டிலிருந்து ஒரு குறிச்சொல்லை நீக்கவும். மேலும் தகவலுக்கு /குறிச்சொல்-உதவியைப் பயன்படுத்தவும்.

# utility.tags.delete.embedTitle
source: Tag deleted!
ta: குறிச்சொல் நீக்கப்பட்டது!

# utility.tags.delete.embedDesc
source: The tag {0} was deleted
ta: குறிச்சொல் {0} நீக்கப்பட்டது

# utility.tags.delete.response
source: Tag: `{0}` deleted
ta: குறிச்சொல்: `{0}` நீக்கப்பட்டது

# utility.tags.edit.name
source: tag-edit
ta: குறிச்சொல்-திருத்த

# utility.tags.edit.description
source: Edit a tag in your guild. Use /tag-help for more info.
ta: உங்கள் கில்டில் ஒரு குறிச்சொல்லைத் திருத்தவும். மேலும் தகவலுக்கு /குறிச்சொல்-உதவியைப் பயன்படுத்தவும்.

# utility.tags.edit.response
source: Tag edited!
ta: குறிச்சொல் திருத்தப்பட்டது!

# utility.tags.edit.embedDesc
source: The tag, `{0}`, was edited
ta: குறிச்சொல், `{0}`, திருத்தப்பட்டது

# utility.tags.edit.embedName
source: Name:
ta: பெயர்:

# utility.tags.edit.embedTitleField
source: Title
ta: தலைப்பு

# utility.tags.edit.embedValue
source: Value
ta: மதிப்பு

# utility.tags.edit.editedBy
source: Edited by {0}
ta: {0 by ஆல் திருத்தப்பட்டது

# utility.tags.edit.oldValue
source: Old value
ta: பழைய மதிப்பு

# utility.tags.edit.newValue
source: New value
ta: புதிய மதிப்பு

# utility.tags.edit.arguments.newName.name
source: new-name
ta: புதிய பெயர்

# utility.tags.edit.arguments.newName.description
source: The new name for the tag
ta: குறிச்சொல்லின் புதிய பெயர்

# utility.tags.edit.arguments.newTitle.name
source: new-title
ta: புதிய தலைப்பு

# utility.tags.edit.arguments.newTitle.description
source: The new title for the tag
ta: குறிச்சொல்லின் புதிய தலைப்பு

# utility.tags.edit.arguments.newValue.name
source: new-value
ta: புதிய மதிப்பு

# utility.tags.edit.arguments.newValue.description
source: The new value for the tag
ta: குறிச்சொல்லின் புதிய மதிப்பு

# utility.tags.edit.arguments.newAppearance.name
source: new-appearance
ta: புதிய மேல்நிலை

# utility.tags.edit.arguments.newAppearance.description
source: The new appearance for the tag you're editing
ta: நீங்கள் திருத்தும் குறிச்சொல்லின் புதிய தோற்றம்

# utility.tags.list.name
source: tag-list
ta: குறிச்சொல் பட்டியல்

# utility.tags.list.description
source: List all tags for this guild
ta: இந்த கில்டுக்கான அனைத்து குறிச்சொற்களையும் பட்டியலிடுங்கள்

# utility.tags.list.noTags
source: There are no tags for this guild
ta: இந்த கில்டுக்கு குறிச்சொற்கள் எதுவும் இல்லை

# utility.tags.list.pageTitle
source: Tags for this guild
ta: இந்த கில்டுக்கான குறிச்சொற்கள்

# utility.tags.list.pageDesc
source: Here are all the tags for this guild
ta: இந்த கில்டுக்கான அனைத்து குறிச்சொற்களும் இங்கே

# utility.tags.list.pageValue
source: Name | Title
ta: பெயர் | தலைப்பு

# utility.publicUtilities.ping.name
source: ping
ta: பிங்

# utility.publicUtilities.ping.description
source: Am I alive?
ta: நான் உயிருடன் இருக்கிறேனா?

# utility.publicUtilities.ping.title
source: Pong!
ta: பாங்!

# utility.publicUtilities.ping.pingValue
source: Lily's Ping to Discord is:
ta: முரண்பாட்டிற்கு லில்லியின் பிங்:

# utility.publicUtilities.nickname.name
source: nickname
ta: புனைப்பெயர்

# utility.publicUtilities.nickname.description
source: The parent command for all nickname commands
ta: அனைத்து புனைப்பெயர்களுக்கும் பெற்றோர் கட்டளை

# utility.publicUtilities.nickname.request.name
source: request
ta: கோரிக்கை

# utility.publicUtilities.nickname.request.description
source: Request a new nickname for this server!
ta: இந்த சேவையகத்திற்கு புதிய புனைப்பெயரைக் கோருங்கள்!

# utility.publicUtilities.nickname.request.lilyNoRolePublic
source: You have a role and Lily does not, so she cannot change your nickname
ta: உங்களுக்கு ஒரு பங்கு இருக்கிறது, லில்லி இல்லை, எனவே அவளால் உங்கள் புனைப்பெயரை மாற்ற முடியாது

# utility.publicUtilities.nickname.request.lilyNoRolePrivate
source: This user has a role and Lily does not, so she cannot change their nickname. Please fix Lily's roles and then try again
ta: இந்த பயனருக்கு ஒரு பங்கு உண்டு, லில்லி இல்லை, எனவே அவளால் அவர்களின் புனைப்பெயரை மாற்ற முடியாது. தயவுசெய்து லில்லியின் பாத்திரங்களை சரிசெய்து மீண்டும் முயற்சிக்கவும்

# utility.publicUtilities.nickname.request.highestRolePublic
source: Your highest role is above Lily's, so she cannot change your nickname
ta: உங்கள் மிக உயர்ந்த பங்கு லில்லிக்கு மேலே உள்ளது, எனவே அவளால் உங்கள் புனைப்பெயரை மாற்ற முடியாது

# utility.publicUtilities.nickname.request.highestRolePrivate
source: This user's highest role is above Lily's, so she cannot change their nickname. Please fix Lily's permissions and try again
ta: இந்த பயனரின் மிக உயர்ந்த பங்கு லில்லிக்கு மேலே உள்ளது, எனவே அவளால் அவர்களின் புனைப்பெயரை மாற்ற முடியாது. தயவுசெய்து லில்லியின் அனுமதிகளை சரிசெய்து மீண்டும் முயற்சிக்கவும்

# utility.publicUtilities.nickname.request.hasPermission
source: You have permission to change your own nickname, so I've just made the change
ta: உங்கள் சொந்த புனைப்பெயரை மாற்ற உங்களுக்கு இசைவு உள்ளது, எனவே நான் மாற்றத்தை ஏற்படுத்தியுள்ளேன்

# utility.publicUtilities.nickname.request.sent
source: Nickname request sent!
ta: புனைப்பெயர் கோரிக்கை அனுப்பப்பட்டது!

# utility.publicUtilities.nickname.request.embedTitle
source: Nickname Request
ta: புனைப்பெயர் கோரிக்கை

# utility.publicUtilities.nickname.userField
source: User:
ta: பயனர்:

# utility.publicUtilities.nickname.request.embedCurrentNick
source: Current Nickname:
ta: தற்போதைய புனைப்பெயர்:

# utility.publicUtilities.nickname.request.embedRequestedNick
source: Requested Nickname:
ta: கோரப்பட்ட புனைப்பெயர்:

# utility.publicUtilities.nickname.request.logEmbed.acceptTitle
source: Nickname Request Accepted
ta: புனைப்பெயர் கோரிக்கை ஏற்றுக்கொள்ளப்பட்டது

# utility.publicUtilities.nickname.request.logEmbed.previousNick
source: Previous Nickname:
ta: முந்தைய புனைப்பெயர்:

# utility.publicUtilities.nickname.request.logEmbed.acceptedNick
source: Accepted Nickname:
ta: ஏற்றுக்கொள்ளப்பட்ட புனைப்பெயர்:

# utility.publicUtilities.nickname.request.logEmbed.acceptedBy
source: Nickname accepted by {0}
ta: {0 by ஆல் ஏற்றுக்கொள்ளப்பட்ட புனைப்பெயர்

# utility.publicUtilities.nickname.request.logEmbed.denyTitle
source: Nickname Request Denied
ta: புனைப்பெயர் கோரிக்கை மறுக்கப்பட்டது

# utility.publicUtilities.nickname.request.logEmbed.currentNick
source: Current Nickname:
ta: தற்போதைய புனைப்பெயர்:

# utility.publicUtilities.nickname.request.logEmbed.rejectedNick
source: Rejected Nickname:
ta: நிராகரிக்கப்பட்ட புனைப்பெயர்:

# utility.publicUtilities.nickname.request.logEmbed.deniedBy
source: Nickname denied by {0}
ta: புனைப்பெயர் {0 by ஆல் மறுக்கப்பட்டது

# utility.publicUtilities.nickname.request.dmAcceptTitle
source: Nickname Change Accepted in {0}
ta: புனைப்பெயர் மாற்றம் {0} இல் ஏற்றுக்கொள்ளப்பட்டது

# utility.publicUtilities.nickname.request.dmAcceptDescription
source: Nickname update from `{0}` to `{1}`
ta: புனைப்பெயர் புதுப்பிப்பு `{0}` முதல் {1} `வரை

# utility.publicUtilities.nickname.request.dmDenyTitle
source: Nickname Request Denied
ta: புனைப்பெயர் கோரிக்கை மறுக்கப்பட்டது

# utility.publicUtilities.nickname.request.dmDenyDescription
source: Moderators have reviewed your nickname request (`{0}`) and rejected it. Please try a different nickname
ta: மதிப்பீட்டாளர்கள் உங்கள் புனைப்பெயர் கோரிக்கையை ({0} `) மதிப்பாய்வு செய்து அதை நிராகரித்தனர். வேறு புனைப்பெயரை முயற்சிக்கவும்

# utility.publicUtilities.nickname.request.button.accept
source: Accept
ta: ஏற்றுக்கொள்

# utility.publicUtilities.nickname.request.button.deny
source: Deny
ta: மறுக்கவும்

# utility.publicUtilities.nickname.request.args.newNick.name
source: nickname
ta: புனைப்பெயர்

# utility.publicUtilities.nickname.request.args.newNick.description
source: The new nickname you would like
ta: நீங்கள் விரும்பும் புதிய புனைப்பெயர்

# utility.publicUtilities.nickname.clear.name
source: clear
ta: தெளிவான

# utility.publicUtilities.nickname.clear.description
source: Clear your current nickname
ta: உங்கள் தற்போதைய புனைப்பெயரை அழிக்கவும்

# utility.publicUtilities.nickname.clear.nothingToClear
source: You have no nickname to clear!
ta: அழிக்க உங்களுக்கு புனைப்பெயர் இல்லை!

# utility.publicUtilities.nickname.clear.cleared
source: Nickname Cleared!
ta: புனைப்பெயர் அழிக்கப்பட்டது!

# utility.publicUtilities.nickname.clear.logEmbed.title
source: Nickname Cleared
ta: புனைப்பெயர் அழிக்கப்பட்டது

# utility.publicUtilities.nickname.clear.logEmbed.newNickTitle
source: New Nickname:
ta: புதிய புனைப்பெயர்:

# utility.publicUtilities.nickname.clear.logEmbed.newNickValue
source: Nickname changed from `{0}` to `null`
ta: புனைப்பெயர் `{0}` இலிருந்து `NULL` ஆக மாற்றப்பட்டது

# utility.publicUtilities.nickname.failToSend
source: Error sending message to moderators. Please ask the moderators to check the `UTILITY` config.
ta: மதிப்பீட்டாளர்களுக்கு செய்தியை அனுப்புவதில் பிழை. `பயன்பாட்டு` கட்டமைப்பைச் சரிபார்க்க மதிப்பீட்டாளர்களிடம் கேளுங்கள்.

# utility.utilityEvents.noOverrides
source: No overrides set
ta: மேலெழுதல்கள் அமைக்கப்படவில்லை

# utility.utilityEvents.createTitle
source: {0} Created
ta: {0} உருவாக்கப்பட்டது

# utility.utilityEvents.createDesc
source: {0} ({1}) was created
ta: {0} ({1}) உருவாக்கப்பட்டது

# utility.utilityEvents.allowed
source: Allowed Permissions
ta: அனுமதிக்கப்பட்ட அனுமதிகள்

# utility.utilityEvents.denied
source: Denied Permissions
ta: மறுக்கப்பட்ட அனுமதிகள்

# utility.utilityEvents.deleteTitle
source: {0} Deleted
ta: {0} நீக்கப்பட்டது

# utility.utilityEvents.deleteDesc
source: `{0}` was deleted.
ta: `{0}` நீக்கப்பட்டது.

# utility.utilityEvents.updateTitle
source: {0} Updated
ta: {0} புதுப்பிக்கப்பட்டது

# utility.utilityEvents.typeChange
source: Type Change
ta: மாற்றத்தைத் தட்டச்சு செய்க

# utility.utilityEvents.nameChange
source: Name Change
ta: பெயர் மாற்றம்

# utility.utilityEvents.topicChange
source: Topic Change
ta: தலைப்பு மாற்றம்

# utility.utilityEvents.parentChange
source: Parent Category Change
ta: பெற்றோர் வகை மாற்றம்

# utility.utilityEvents.nsfwChange
source: NSFW Setting
ta: NSFW அமைப்பு

# utility.utilityEvents.positionChanged
source: Position Changed
ta: நிலை மாற்றப்பட்டது

# utility.utilityEvents.slowmodeChange
source: Slowmode time changed
ta: மெதுவான நேரம் மாறியது

# utility.utilityEvents.bitrateChange
source: Bitrate changed
ta: பிட்ரேட் மாற்றப்பட்டது

# utility.utilityEvents.userlimitChange
source: User Limit Changed
ta: பயனர் வரம்பு மாற்றப்பட்டது

# utility.utilityEvents.regionChanged
source: Region Changed
ta: பகுதி மாற்றப்பட்டது

# utility.utilityEvents.videoQualityChanged
source: Video Quality Changed
ta: வீடியோ தகுதி மாற்றப்பட்டது

# utility.utilityEvents.defaultAutoChanged
source: Default Auto-Archive Changed
ta: இயல்புநிலை ஆட்டோ-ஆர்க்கிவ் மாற்றப்பட்டது

# utility.utilityEvents.defaultSortChanged
source: Default Sort Changed
ta: இயல்புநிலை வரிசை மாற்றப்பட்டது

# utility.utilityEvents.defaultLayoutChanged
source: Default Layout Changed
ta: இயல்புநிலை தளவமைப்பு மாற்றப்பட்டது

# utility.utilityEvents.availableTagsChanged
source: Available tags changed
ta: கிடைக்கக்கூடிய குறிச்சொற்கள் மாற்றப்பட்டன

# utility.utilityEvents.appliedTagsChanged
source: Applied tags Changed
ta: பயன்பாட்டு குறிச்சொற்கள் மாற்றப்பட்டன

# utility.utilityEvents.defaultReactionChanged
source: Default Reaction Emoji Changed
ta: இயல்புநிலை எதிர்வினை ஈமோசி மாற்றப்பட்டது

# utility.utilityEvents.defaultThreadChanged
source: Default Thread Slowmode Changed
ta: இயல்புநிலை நூல் ச்லோமோட் மாற்றப்பட்டது

# utility.utilityEvents.newAllowed
source: New Allowed Permissions
ta: புதிய அனுமதிக்கப்பட்ட அனுமதிகள்

# utility.utilityEvents.oldAllowed
source: Old Allowed Permissions
ta: பழைய அனுமதிகள்

# utility.utilityEvents.newDenied
source: New Denied Permissions
ta: புதிய மறுக்கப்பட்ட அனுமதிகள்

# utility.utilityEvents.oldDenied
source: Old Denied Permissions
ta: பழைய அனுமதிகளை மறுத்தது

# utility.utilityEvents.scheduledCreateTitle
source: Scheduled Event Created
ta: திட்டமிடப்பட்ட நிகழ்வு உருவாக்கப்பட்டது

# utility.utilityEvents.scheduledCreateDesc
source: An event has been created
ta: ஒரு நிகழ்வு உருவாக்கப்பட்டுள்ளது

# utility.utilityEvents.guildMembersOnly
source: Guild Members only
ta: கில்ட் உறுப்பினர்கள் மட்டுமே

# utility.utilityEvents.scheduledDeleteTitle
source: Scheduled Event Deleted!
ta: திட்டமிடப்பட்ட நிகழ்வு நீக்கப்பட்டது!
