Repository: 247i/TACETr
Catalog: உரை/தானி/lilybot-lilybot-translations-*.po
Languages: ta

# utility.newsChannel.newsPublishing.arguments.channel.description
source: The channel to set auto-publishing for
ta: தானாக வெளியிடுவதற்கான சேனல்

# utility.newsChannel.newsPublishing.errorTitle
source: Unable to Auto-publish news channel!
ta: செய்தி சேனலை தானாக வெளியிட முடியவில்லை!

# utility.newsChannel.newsPublishing.missingPerms
source: Please ensure I have the `Send Messages` or `Manage Channel` permissions
ta: என்னிடம் `செய்திகளை அனுப்புங்கள்` அல்லது `சேனலை நிர்வகிக்கவும்.

# utility.newsChannel.newsPublishing.embedChannelField
source: Channel:
ta: சேனல்:

# utility.newsChannel.newsPublishing.set.name
source: set
ta: கணம்

# utility.newsChannel.newsPublishing.set.description
source: Set this channel to automatically publish messages.
ta: செய்திகளை தானாக வெளியிட இந்த சேனலை அமைக்கவும்.

# utility.newsChannel.newsPublishing.set.noPerms
source: I don't have permission for this channel;
ta: இந்த சேனலுக்கு எனக்கு இசைவு இல்லை;

# utility.newsChannel.newsPublishing.set.success
source: {0} has been set to automatically publish messages!
ta: {0 the செய்திகளை தானாக வெளியிட அமைக்கப்பட்டுள்ளது!

# utility.newsChannel.newsPublishing.set.embedTitle
source: News Channel set to Auto-publish
ta: செய்தி சேனல் தானாக வெளியீட்டுக்கு அமைக்கப்பட்டுள்ளது

# utility.newsChannel.newsPublishing.set.setBy
source: Set by {0}
ta: {0 by ஆல் அமைக்கப்பட்டது

# utility.newsChannel.newsPublishing.remove.name
source: remove
ta: அகற்று

# utility.newsChannel.newsPublishing.remove.description
source: Stop a news channel from auto-publishing messages
ta: தானாக வெளியிடும் செய்திகளிலிருந்து செய்தி சேனலை நிறுத்துங்கள்

# utility.newsChannel.newsPublishing.remove.noAuto
source: **Error:** {0} does not automatically publish messages!
ta: ** பிழை: ** {0} தானாக செய்திகளை வெளியிடாது!

# utility.newsChannel.newsPublishing.remove.success
source: {0} will no longer automatically publish
ta: {0} இனி தானாகவே வெளியிடாது

# utility.newsChannel.newsPublishing.remove.embedTitle
source: News Channel will no longer Auto-publish
ta: செய்தி சேனல் இனி தானாக வெளியிடாது

# utility.newsChannel.newsPublishing.remove.removedBy
source: Removed by {0}
ta: {0 by ஆல் அகற்றப்பட்டது

# utility.newsChannel.newsPublishing.list.name
source: list
ta: பட்டியல்

# utility.newsChannel.newsPublishing.list.description
source: List auto-publishing channels
ta: தானாக வெளியீட்டு சேனல்களை பட்டியலிடுங்கள்

# utility.newsChannel.newsPublishing.list.none
source: There are no news channels set for this guild.
ta: இந்த கில்டுக்கு செய்தி சேனல்கள் எதுவும் இல்லை.

# utility.newsChannel.newsPublishing.list.title
source: Auto-publishing channels for this guild
ta: இந்த கில்டுக்கு தானாக வெளியிடும் சேனல்கள்

# utility.newsChannel.newsPublishing.list.desc
source: These are all the news channels that automatically publish messages
ta: எல்லா செய்தி சேனல்களும் தானாகவே செய்திகளை வெளியிடுகின்றன

# utility.newsChannel.newsPublishing.removeAll.name
source: remove-al
ta: அகற்று-அல்

# utility.newsChannel.newsPublishing.removeAll.description
source: Remove all auto-publishing channels for this guild
ta: இந்த கில்டிற்கான அனைத்து ஆட்டோ-வெளியீட்டு சேனல்களையும் அகற்றவும்

# utility.newsChannel.newsPublishing.removeAll.noChannels
source: **Error:** There are no auto-publishing channels for this guild!
ta: ** பிழை: ** இந்த கில்டுக்கு தானாக வெளியிடும் சேனல்கள் எதுவும் இல்லை!

# utility.newsChannel.newsPublishing.removeAll.success
source: Cleared all auto-publishing channels from this guild!
ta: இந்த கில்டிலிருந்து அனைத்து ஆட்டோ-வெளியீட்டு சேனல்களையும் அழித்துவிட்டது!

# utility.reminders.reminder.name
source: reminder
ta: நினைவூட்டல்

# utility.reminders.reminder.description
source: The parent command for all reminder commands
ta: அனைத்து நினைவூட்டல் கட்டளைகளுக்கும் பெற்றோர் கட்டளை

# utility.reminders.reminder.set.name
source: set
ta: கணம்

# utility.reminders.reminder.set.description
source: Set a reminder for some time in the future!
ta: எதிர்காலத்தில் சிறிது நேரம் ஒரு நினைவூட்டலை அமைக்கவும்!

# utility.reminders.reminder.set.messageTooLong
source: Custom Message is too long. Message must be 1024 characters or fewer
ta: தனிப்பயன் செய்தி மிக நீளமானது. செய்தி 1024 எழுத்துக்கள் அல்லது குறைவாக இருக்க வேண்டும்

# utility.reminders.reminder.set.noRepeatingInt
source: You must specify a repeating interval if you are setting a repeating reminder
ta: நீங்கள் மீண்டும் மீண்டும் நினைவூட்டலை அமைத்தால் மீண்டும் மீண்டும் இடைவெளியைக் குறிப்பிட வேண்டும்

# utility.reminders.reminder.set.tooShort
source: The Repeating interval cannot be less than one hour! This is to prevent spam and/or abuse of reminders
ta: மீண்டும் மீண்டும் இடைவெளி ஒரு மணி நேரத்திற்கும் குறைவாக இருக்க முடியாது! இது ச்பேம் மற்றும்/அல்லது நினைவூட்டல்களை தீய பயன்பாடு செய்வதைத் தடுப்பதாகும்

# utility.reminders.reminder.set.embedTitle
source: Reminder set!
ta: நினைவூட்டல் தொகுப்பு!

# utility.reminders.reminder.set.repeatingEmbedTitle
source: Repeating Reminder set!
ta: நினைவூட்டல் தொகுப்பு மீண்டும் மீண்டும்!

# utility.reminders.reminder.set.embedDesc
source: I will remind you at {long} ({relative})
ta: நான் உங்களுக்கு {long} ({relative}) இல் நினைவூட்டுவேன்

# utility.reminders.reminder.set.embedRepeatingInt
source: Repeating interval
ta: மீண்டும் மீண்டும் இடைவெளி

# utility.reminders.reminder.set.embedCustomMessage
source: Custom Message
ta: தனிப்பயன் செய்தி

# utility.reminders.reminder.set.reminderToAll
source: Reminder will be sent via DM to all participants
ta: பங்கேற்பாளர்கள் அனைவருக்கும் டி.எம் வழியாக நினைவூட்டல் அனுப்பப்படும்

# utility.reminders.reminder.set.arguments.time.name
source: time
ta: நேரம்

# utility.reminders.reminder.set.arguments.time.description
source: How long until you need reminding? Format: 1d12h30m / 3d / 26m30s
ta: உங்களுக்கு நினைவூட்டல் தேவைப்படும் வரை எவ்வளவு காலம்? வடிவம்: 1D12H30M / 3D / 26M30S

# utility.reminders.reminder.set.arguments.dm.name
source: remind-in-dm
ta: -டி.எம்

# utility.reminders.reminder.set.arguments.dm.description
source: Whether to remind in DMs or not
ta: டி.எம்.எச் இல் நினைவூட்டுவதா இல்லையா

# utility.reminders.reminder.set.arguments.message.name
source: custom-message
ta: தனிப்பயன் செய்தி

# utility.reminders.reminder.set.arguments.message.description
source: A message to attach to your reminder
ta: உங்கள் நினைவூட்டலுடன் இணைக்க ஒரு செய்தி

# utility.reminders.reminder.set.arguments.repeating.name
source: repeat
ta: மீண்டும்

# utility.reminders.reminder.set.arguments.repeating.description
source: Whether to repeat the number or not
ta: எண்ணை மீண்டும் செய்ய வேண்டுமா இல்லையா

# utility.reminders.reminder.set.arguments.repeatingInt.name
source: repeat-interval
ta: மீண்டும்-இடைவெளி

# utility.reminders.reminder.set.arguments.repeatingInt.description
source: The interval to repeating the reminder at. Format: 1d / 4h / 5d
ta: நினைவூட்டலை மீண்டும் மீண்டும் செய்வதற்கான இடைவெளி. வடிவம்: 1D / 4H / 5D

# utility.reminders.reminder.list.name
source: list
ta: பட்டியல்

# utility.reminders.reminder.list.description
source: List your reminders for this guild
ta: இந்த கில்டுக்கு உங்கள் நினைவூட்டல்களை பட்டியலிடுங்கள்

# utility.reminders.reminder.remove.name
source: remove
ta: அகற்று

# utility.reminders.reminder.remove.description
source: Remove a reminder you have set in this guild
ta: இந்த கில்டில் நீங்கள் அமைத்த ஒரு நினைவூட்டலை அகற்றவும்

# utility.reminders.reminder.remove.notFound
source: Reminder not found. Please use `/reminder list` to find out the correct reminder number!
ta: நினைவூட்டல் கிடைக்கவில்லை. சரியான நினைவூட்டல் எண்ணைக் கண்டுபிடிக்க `/நினைவூட்டல் பட்டியல்` ஐப் பயன்படுத்தவும்!

# utility.reminders.reminder.remove.embedTitle
source: Reminder cancelled
ta: நினைவூட்டல் ரத்து செய்யப்பட்டது

# utility.reminders.reminder.remove.reminderField
source: Reminder
ta: நினைவூட்டல்

# utility.reminders.reminder.remove.arguments.reminder.name
source: reminder-number
ta: நினைவூட்டல் எண்

# utility.reminders.reminder.remove.arguments.reminder.description
source: The number of the reminder to remove. Use `/reminder list` to get this
ta: அகற்ற நினைவூட்டலின் எண்ணிக்கை. இதைப் பெற `/நினைவூட்டல் பட்டியல்` ஐப் பயன்படுத்தவும்

# utility.reminders.reminder.removeAll.name
source: remove-all
ta: அகற்றவும்

# utility.reminders.reminder.removeAll.description
source: Remove all of a specific reminder type from this guild
ta: இந்த கில்டிலிருந்து ஒரு குறிப்பிட்ட நினைவூட்டல் வகை அனைத்தையும் அகற்றவும்

# utility.reminders.reminder.removeAll.noReminders
source: You do not have any reminders for this guild!
ta: இந்த கில்டுக்கு உங்களிடம் எந்த நினைவூட்டல்களும் இல்லை!

# utility.reminders.reminder.removeAll.noRepeating
source: You do not have any repeating reminders for this guild!
ta: இந்த கில்டுக்கு மீண்டும் மீண்டும் நினைவூட்டல்கள் எதுவும் இல்லை!

# utility.reminders.reminder.removeAll.noNonRepeating
source: You do not have any non-repeating reminders for this guild!
ta: இந்த கில்டுக்கு மீண்டும் மீண்டும் செய்யாத நினைவூட்டல்கள் எதுவும் இல்லை!

# utility.reminders.reminder.removeAll.removedAll
source: Removed all reminders for this guild
ta: இந்த கில்டுக்கான அனைத்து நினைவூட்டல்களையும் அகற்றியது

# utility.reminders.reminder.removeAll.removedRepeating
source: Removed all repeating reminders for this guild
ta: இந்த கில்டுக்கான அனைத்து மீண்டும் நினைவூட்டல்களையும் அகற்றியது

# utility.reminders.reminder.removeAll.removedNonRepeating
source: Removed all non-repeating reminders for this guild
ta: இந்த கில்டிற்கான அனைத்து மீண்டும் மீண்டும் செய்யாத நினைவூட்டல்களையும் அகற்றியது

# utility.reminders.reminder.removeAll.arguments.type.name
source: reminder-type
ta: நினைவூட்டல் வகை

# utility.reminders.reminder.removeAll.arguments.type.description
source: The type of reminder to remove
ta: அகற்ற நினைவூட்டல் வகை

# utility.reminders.reminder.removeAll.arguments.type.choices.repeating
source: repeating
ta: மீண்டும் மீண்டும்

# utility.reminders.reminder.removeAll.arguments.type.choices.nonRepeating
source: non-repeating
ta: மீண்டும் மீண்டும் செய்யாதது

# utility.reminders.reminder.removeAll.arguments.type.choices.all
source: all
ta: அனைத்தும்

# utility.reminders.reminder.modList.name
source: mod-list
ta: மோட்-பட்டியல்

# utility.reminders.reminder.modList.description
source: List all reminders for a user, if you're a moderator
ta: நீங்கள் ஒரு மதிப்பீட்டாளராக இருந்தால், ஒரு பயனருக்கான அனைத்து நினைவூட்டல்களையும் பட்டியலிடுங்கள்

# utility.reminders.reminder.modList.arguments.user.name
source: user
ta: பயனர்

# utility.reminders.reminder.modList.arguments.user.description
source: The user to view reminders for
ta: நினைவூட்டல்களைக் காண பயனர்

# utility.reminders.reminder.modRemove.name
source: mod-remove
ta: மோட்-REMOVE

# utility.reminders.reminder.modRemove.description
source: Remove a reminder for a user, if you're a moderator
ta: நீங்கள் ஒரு மதிப்பீட்டாளராக இருந்தால், ஒரு பயனருக்கான நினைவூட்டலை அகற்று

# utility.reminders.reminder.modRemove.notFound
source: Reminder not found. Please use `/reminder mod-list` to find out the correct reminder number
ta: நினைவூட்டல் கிடைக்கவில்லை. சரியான நினைவூட்டல் எண்ணைக் கண்டுபிடிக்க `/நினைவூட்டல் மோட்-லிச்ட்` ஐப் பயன்படுத்தவும்

# utility.reminders.reminder.modRemove.embedTitle
source: Reminder cancelled by moderator
ta: நினைவூட்டல் மதிப்பீட்டாளரால் ரத்து செய்யப்பட்டது

# utility.reminders.reminder.modRemove.arguments.user.name
source: user
ta: பயனர்

# utility.reminders.reminder.modRemove.arguments.user.description
source: The user to remove the reminder for
ta: நினைவூட்டலை அகற்ற பயனர்

# utility.reminders.reminder.modRemove.arguments.reminder.name
source: reminder-number
ta: நினைவூட்டல் எண்

# utility.reminders.reminder.modRemove.arguments.reminder.description
source: The number of the reminder to remove. Use `/reminder mod-list` to get this.
ta: அகற்ற நினைவூட்டலின் எண்ணிக்கை. இதைப் பெற `/நினைவூட்டல் மோட்-லிச்ட்` ஐப் பயன்படுத்தவும்.

# utility.reminders.reminder.modRemoveAll.name
source: mod-remove-all
ta: மோட்-ரெமோவ்-ஆல்

# utility.reminders.reminder.modRemoveAll.description
source: Remove all of a specific reminder type for a user, if you're a moderator
ta: நீங்கள் ஒரு மதிப்பீட்டாளராக இருந்தால், ஒரு பயனருக்கான ஒரு குறிப்பிட்ட நினைவூட்டல் வகை அனைத்தையும் அகற்று

# utility.reminders.reminder.modRemoveAll.noReminders
source: {0} does not have any reminders for this guild!
ta: {0} இந்த கில்டுக்கு எந்த நினைவூட்டல்களும் இல்லை!

# utility.reminders.reminder.modRemoveAll.noRepeating
source: {0} does not have any repeating reminders for this guild!
ta: {0} இந்த கில்டுக்கு மீண்டும் மீண்டும் நினைவூட்டல்கள் இல்லை!

# utility.reminders.reminder.modRemoveAll.noNonRepeating
source: {0} does not have any non-repeating reminders for this guild!
ta: {0} இந்த கில்டுக்கு மீண்டும் மீண்டும் செய்யாத நினைவூட்டல்கள் இல்லை!

# utility.reminders.reminder.modRemoveAll.removedAll
source: Removed all {0} reminders for this guild
ta: இந்த கில்டுக்கான அனைத்து {0} நினைவூட்டல்களையும் அகற்றியது

# utility.reminders.reminder.modRemoveAll.removedRepeating
source: Removed all {0} repeating reminders for this guild
ta: இந்த கில்டிற்கான அனைத்து {0} மீண்டும் நினைவூட்டல்களை அகற்றியது

# utility.reminders.reminder.modRemoveAll.removedNonRepeating
source: Removed all {0} non-repeating reminders for this guild
ta: இந்த கில்ட்டிற்கான அனைத்து {0} மீண்டும் மீண்டும் நினைவூட்டல்களை அகற்றியது

# utility.reminders.reminder.modRemoveAll.arguments.user.name
source: user
ta: பயனர்

# utility.reminders.reminder.modRemoveAll.arguments.user.description
source: The user to remove the reminders for
ta: நினைவூட்டல்களை அகற்ற பயனர்

# utility.reminders.reminder.unableToAccess
source: I was unable to find/access the channel from {guild} that this reminder was set in.
ta: இந்த நினைவூட்டல் அமைக்கப்பட்ட {கில்ட் இருந்து இலிருந்து சேனலைக் கண்டுபிடிக்க/அணுக முடியவில்லை.

# utility.reminders.reminder.embed.title
source: Reminder
ta: நினைவூட்டல்

# utility.reminders.reminder.embed.set
source: Set time
ta: நேரத்தை அமைக்கவும்

# utility.reminders.reminder.embed.repeatingTitle
source: Repeating Interval
ta: மீண்டும் மீண்டும் இடைவெளி

# utility.reminders.reminder.embed.repeatingValue
source: This reminder repeats every {0}
ta: இந்த நினைவூட்டல் ஒவ்வொரு {0} ஐ மீண்டும் செய்கிறது

# utility.reminders.reminder.embed.footer
source: Use `/reminder remove` to cancel this reminder
ta: இந்த நினைவூட்டலை ரத்து செய்ய `/நினைவூட்டல் remove` ஐப் பயன்படுத்தவும்

# utility.reminders.reminder.originalMessage.canc
source: cancelled
ta: ரத்து செய்யப்பட்டது

# utility.reminders.reminder.originalMessage.byMod
source: by moderator
ta: மதிப்பீட்டாளரால்

# utility.reminders.reminder.originalMessage.complete
source: completed.
ta: முடிந்தது.

# utility.reminders.reminder.listPage.desc
source: You have no reminders set for this guild.
ta: இந்த கில்டுக்கு உங்களுக்கு நினைவூட்டல்கள் எதுவும் இல்லை.

# utility.reminders.reminder.listPage.modDesc
source: <@{0}> has no reminders set for this guild.
ta: <@{0}> இந்த கில்டுக்கு நினைவூட்டல்கள் எதுவும் இல்லை.

# utility.reminders.reminder.listPage.title
source: Reminders for {0}
ta: {0 க்கு க்கான நினைவூட்டல்கள்

# utility.reminders.reminder.content.line1
source: Reminder ID:
ta: நினைவூட்டல் ஐடி:

# utility.reminders.reminder.content.line2
source: Time set:
ta: நேர தொகுப்பு:

# utility.reminders.reminder.content.line3
source: Time until reminder:
ta: நினைவூட்டல் வரை நேரம்:

# utility.reminders.reminder.content.line4
source: Custom Message
ta: தனிப்பயன் செய்தி

# utility.roleMenu.name
source: role-menu
ta: ரோல்-மெனு

# utility.roleMenu.description
source: The parent command for managing role menus
ta: பங்கு மெனுக்களை நிர்வகிப்பதற்கான பெற்றோர் கட்டளை

# utility.roleMenu.jumpButton
source: Jump to menu
ta: மெனுவுக்கு செல்லவும்

# utility.roleMenu.create.name
source: create
ta: உருவாக்கு

# utility.roleMenu.create.description
source: Create a new role menu in this channel. A channel can have any number of role menus
ta: இந்த சேனலில் புதிய பங்கு மெனுவை உருவாக்கவும். ஒரு சேனலில் எத்தனை ரோல் மெனுக்கள் இருக்க முடியும்

# utility.roleMenu.create.selectButton
source: Select roles
ta: பாத்திரங்களைத் தேர்ந்தெடுக்கவும்

# utility.roleMenu.create.embedTitle
source: Role Menu Created
ta: பங்கு பட்டியல் உருவாக்கப்பட்டது

# utility.roleMenu.create.embedDesc
source: A role menu for the {0} role was created in {1}
ta: {0} பாத்திரத்திற்கான பங்கு பட்டியல் {1} இல் உருவாக்கப்பட்டது

# utility.roleMenu.create.embedContent
source: Content:
ta: திருப்தி:

# utility.roleMenu.create.embedColor
source: Color:
ta: வண்ணம்:

# utility.roleMenu.create.embedEmbed
source: Embed:
ta: உட்பொதிக்கப்பட்ட:

# utility.roleMenu.create.createdBy
source: Created by {0}
ta: {0 by ஆல் உருவாக்கப்பட்டது

# utility.roleMenu.create.response
source: Role menu created. You can add more roles using the `/role-menu add` command.
ta: பங்கு பட்டியல் உருவாக்கப்பட்டது. `/ரோல்-மெனு ஆட்` கட்டளையைப் பயன்படுத்தி கூடுதல் பாத்திரங்களைச் சேர்க்கலாம்.

# utility.roleMenu.create.arguments.role.name
source: role
ta: பங்கு

# utility.roleMenu.create.arguments.role.description
source: The first role to start the menu with. Add more via `/role-menu add`
ta: மெனுவைத் தொடங்க முதல் பங்கு. `/ரோல்-மெனு சேர்` வழியாக மேலும் சேர்க்கவும்

# utility.roleMenu.create.arguments.content.name
source: content
ta: உள்ளடக்கம்

# utility.roleMenu.create.arguments.content.description
source: The content of the embed or message.
ta: உட்பொதித்தல் அல்லது செய்தியின் உள்ளடக்கம்.

# utility.roleMenu.create.arguments.embed.name
source: embed
ta: உட்பொதிக்கப்பட்டது

# utility.roleMenu.create.arguments.embed.description
source: If the message containing the role menu should be sent as an embed
ta: பங்கு மெனுவைக் கொண்ட செய்தி உட்பொதியாக அனுப்பப்பட வேண்டும் என்றால்

# utility.roleMenu.create.arguments.color.name
source: color
ta: நிறம்

# utility.roleMenu.create.arguments.color.description
source: The color for the message to be. Embed only.
ta: செய்தி இருக்க வேண்டும். உட்பொதிக்க மட்டுமே.

# utility.roleMenu.add.name
source: add
ta: கூட்டு

# utility.roleMenu.add.description
source: Add a role to the existing role menu in this channel.
ta: இந்த சேனலில் இருக்கும் பங்கு பட்டியலில் ஒரு பங்கைச் சேர்க்கவும்.

# utility.roleMenu.add.alreadyGot
source: This menu already contains that role
ta: இந்த பட்டியலில் ஏற்கனவே அந்த பாத்திரம் உள்ளது

# utility.roleMenu.add.max24
source: You can't have more than 24 roles in a role menu. This is a Discord Limitation
ta: பங்கு பட்டியலில் உங்களிடம் 24 க்கும் மேற்பட்ட பாத்திரங்கள் இருக்க முடியாது. இது ஒரு முரண்பாடு வரம்பு

# utility.roleMenu.add.embedTitle
source: Role Added to Role Menu
ta: பங்கு பட்டியலில் பங்கு சேர்க்கப்பட்டது

# utility.roleMenu.add.embedDesc
source: The {0} role was added to a role menu in {1}
ta: {0} பங்கு {1} இல் ஒரு பங்கு பட்டியலில் சேர்க்கப்பட்டது

# utility.roleMenu.add.addedBy
source: Added by {0}
ta: {0 by ஆல் சேர்க்கப்பட்டது

# utility.roleMenu.add.response
source: Added the {0} role to the specified role menu.
ta: குறிப்பிட்ட பங்கு பட்டியலில் {0} பாத்திரத்தை சேர்த்தது.

# utility.roleMenu.add.arguments.id.name
source: menu-id
ta: மெனு-ஐடி

# utility.roleMenu.add.arguments.id.description
source: The message ID of the role menu you'd like to edit.
ta: நீங்கள் திருத்த விரும்பும் பங்கு மெனுவின் செய்தி ஐடி.

# utility.roleMenu.add.arguments.role.name
source: role
ta: பங்கு

# utility.roleMenu.add.arguments.role.description
source: The role you'd like to add to the selected role menu.
ta: தேர்ந்தெடுக்கப்பட்ட பங்கு பட்டியலில் நீங்கள் சேர்க்க விரும்பும் பங்கு.

# utility.roleMenu.remove.name
source: remove
ta: அகற்று

# utility.roleMenu.remove.description
source: Remove a role from the existing role menu in this channel.
ta: இந்த சேனலில் இருக்கும் பங்கு மெனுவிலிருந்து ஒரு பாத்திரத்தை அகற்று.

# utility.roleMenu.remove.cantRemove
source: You can't remove a role from a menu it isn't in.
ta: அது இல்லாத மெனுவிலிருந்து ஒரு பாத்திரத்தை நீங்கள் அகற்ற முடியாது.

# utility.roleMenu.remove.cantRemoveLast
source: You can't remove the last role from a role menu.
ta: பங்கு மெனுவிலிருந்து கடைசி பாத்திரத்தை நீங்கள் அகற்ற முடியாது.

# utility.roleMenu.remove.embedTitle
source: Role removed from Role Menu
ta: பங்கு மெனுவிலிருந்து பங்கு அகற்றப்பட்டது

# utility.roleMenu.remove.embedDesc
source: The {0} role was removed from a role menu in {0}
ta: {0} பங்கு {0} இல் ஒரு பங்கு மெனுவிலிருந்து அகற்றப்பட்டது

# utility.roleMenu.remove.removedBy
source: Removed by {0}
ta: {0 by ஆல் அகற்றப்பட்டது

# utility.roleMenu.remove.response
source: Removed the {0} role from the specified role menu.
ta: குறிப்பிட்ட பங்கு மெனுவிலிருந்து {0} பாத்திரத்தை அகற்றியது.

# utility.roleMenu.remove.arguments.role.description
source: The role you'd like to remove from the selected role menu,
ta: தேர்ந்தெடுக்கப்பட்ட பங்கு மெனுவிலிருந்து நீங்கள் அகற்ற விரும்பும் பங்கு,

# utility.roleMenu.pronouns.name
source: pronouns
ta: உச்சரிப்புகள்

# utility.roleMenu.pronouns.description
source: Create a pronoun selection role menu and the roles to go with it.
ta: ஒரு பிரதிபெயர் தேர்வு பங்கு பட்டியல் மற்றும் அதனுடன் செல்ல வேண்டிய பாத்திரங்களை உருவாக்கவும்.

# utility.roleMenu.pronouns.response
source: Pronoun role menu created
ta: பிரதிபெயர் பங்கு பட்டியல் உருவாக்கப்பட்டது

# utility.roleMenu.pronouns.message
source: Select pronoun roles from the menu below!
ta: கீழே உள்ள மெனுவிலிருந்து பிரதிபெயரைத் தேர்ந்தெடுக்கவும்!

# utility.roleMenu.pronouns.embedTitle
source: Pronoun Role Menu Created
ta: பிரதிபெயர் பங்கு பட்டியல் உருவாக்கப்பட்டது

# utility.roleMenu.pronouns.embedDesc
source: A pronoun role menu was created in {0}
ta: {0} இல் ஒரு பிரதிபெயர் பங்கு பட்டியல் உருவாக்கப்பட்டது

# utility.roleMenu.pronouns.createdBy
source: Created by {0}
ta: {0 by ஆல் உருவாக்கப்பட்டது

# utility.roleMenu.interaction.broken
source: This role menu seems to be broken, please ask staff to recreate it. If this isn't a role menu, or if the issue persists, open a report at <{0}/LilyBot/issues>
ta: இந்த பங்கு பட்டியல் உடைந்துவிட்டதாகத் தெரிகிறது, தயவுசெய்து அதை மீண்டும் உருவாக்க ஊழியர்களைக் கேளுங்கள். இது ஒரு பங்கு பட்டியல் இல்லையென்றால், அல்லது சிக்கல் தொடர்ந்தால், <{0}/lilybot/சிக்கல்கள்> என்ற அறிக்கையைத் திறக்கவும்

# utility.roleMenu.interaction.noRoles
source: Could not find any roles associated with this menu. PLease ask staff to add some. If this isn't a role menu, or if the issue persists, open a report at <{0}/LilyBot/issues>
ta: இந்த மெனுவுடன் தொடர்புடைய எந்த பாத்திரங்களையும் கண்டுபிடிக்க முடியவில்லை. சிலவற்றைச் சேர்க்க ஊழியர்களைக் கேளுங்கள். இது ஒரு பங்கு பட்டியல் இல்லையென்றால், அல்லது சிக்கல் தொடர்ந்தால், <{0}/lilybot/சிக்கல்கள்> என்ற அறிக்கையைத் திறக்கவும்

# utility.roleMenu.interaction.serverError
source: An error occurred when trying to get the server, please try again! If the issue persists, open a report at <{0}/LilyBot/issues>
ta: சேவையகத்தைப் பெற முயற்சிக்கும்போது பிழை ஏற்பட்டது, தயவுசெய்து மீண்டும் முயற்சிக்கவும்! சிக்கல் தொடர்ந்தால், <{0}/lilybot/சிக்கல்கள்> இல் ஒரு அறிக்கையைத் திறக்கவும்

# utility.roleMenu.interaction.menuMessage
source: Use the menu below to select roles.
ta: பாத்திரங்களைத் தேர்ந்தெடுக்க கீழே உள்ள மெனுவைப் பயன்படுத்தவும்.

# utility.roleMenu.interaction.placeholder
source: Select roles...
ta: பாத்திரங்களைத் தேர்ந்தெடுக்கவும் ...

# utility.roleMenu.interaction.response
source: Your roles have been adjusted
ta: உங்கள் பாத்திரங்கள் சரிசெய்யப்பட்டுள்ளன

# utility.roleMenu.interaction.noChanges
source: You didn't select any different roles, so no changes were made.
ta: நீங்கள் வேறு எந்த பாத்திரங்களையும் தேர்ந்தெடுக்கவில்லை, எனவே எந்த மாற்றங்களும் செய்யப்படவில்லை.

# utility.roleMenu.check.cantFind
source: I couldn't find that message in this channel. Make sure it exists.
ta: இந்த சேனலில் அந்த செய்தியை என்னால் கண்டுபிடிக்க முடியவில்லை. அது இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# utility.roleMenu.check.notRole
source: That message doesn't seem to be a role menu.
ta: அந்த செய்தி ஒரு பங்கு பட்டியல் என்று தெரியவில்லை.
