Repository: 247i/TACETr
Catalog: உரை/தானி/lilybot-lilybot-translations-*.po
Languages: ta

# threads.threadControl.archive.archivedBy
source: Archived by {0}
ta: {0 by ஆல் காப்பகப்படுத்தப்பட்டது

# threads.threadControl.archive.response
source: Thread archived
ta: நூல் காப்பகப்படுத்தப்பட்டது

# threads.threadControl.archive.responseLock
source: and locked
ta: மற்றும் பூட்டப்பட்டுள்ளது

# threads.threadControl.transfer.name
source: transfer
ta: இடமாற்றம்

# threads.threadControl.transfer.description
source: Transfer ownership of this thread
ta: இந்த நூலின் உரிமையை மாற்றவும்

# threads.threadControl.transfer.alreadyOwns
source: That person already owns the thread!
ta: அந்த நபர் ஏற்கனவே நூல் வைத்திருக்கிறார்!

# threads.threadControl.transfer.cannotBot
source: You cannot transfer ownership of a thread to a bot
ta: ஒரு நூலின் உரிமையை நீங்கள் ஒரு போட் -க்கு மாற்ற முடியாது

# threads.threadControl.transfer.success
source: Ownership transferred.
ta: உரிமையாளர் மாற்றப்பட்டது.

# threads.threadControl.transfer.fromTo
source: Thread ownership transferred from {old} to {new}
ta: நூல் உரிமையாளர் {old} இலிருந்து {new} க்கு மாற்றப்பட்டது

# threads.threadControl.transfer.transferredBy
source: Transferred by {0}
ta: {0 by ஆல் மாற்றப்பட்டது

# threads.threadControl.transfer.embed.title
source: Thread ownership transferred
ta: நூல் உரிமை மாற்றப்பட்டது

# threads.threadControl.transfer.embed.prevOwner
source: Previous owner
ta: முந்தைய உரிமையாளர்

# threads.threadControl.transfer.embed.cannotFind
source: Unable to find previous owner
ta: முந்தைய உரிமையாளரைக் கண்டுபிடிக்க முடியவில்லை

# threads.threadControl.transfer.embed.newOwner
source: New owner
ta: புதிய உரிமையாளர்

# threads.threadControl.preventArchiving.name
source: prevent-archived
ta: தடுப்பு-தொற்று

# threads.threadControl.preventArchiving.description
source: Stop a thread from being archived
ta: ஒரு நூல் காப்பகப்படுத்தப்படுவதை நிறுத்துங்கள்

# threads.threadControl.preventArchiving.alreadyPreventedWarning
source: Thread archiving is already being prevented, would you like to remove this?
ta: நூல் காப்பகமானது ஏற்கனவே தடுக்கப்பட்டுள்ளது, இதை அகற்ற விரும்புகிறீர்களா?

# threads.threadControl.preventArchiving.noLongerPrevented
source: Thread archiving will no longer be prevented
ta: நூல் காப்பகமானது இனி தடுக்கப்படாது

# threads.threadControl.preventArchiving.stillPrevented
source: Thread archiving will remain prevented
ta: நூல் காப்பகம் தடுக்கப்படும்

# threads.threadControl.preventArchiving.embed.title
source: Thread archive prevent enabled
ta: நூல் காப்பகம் இயக்கப்பட்டதைத் தடுக்கிறது

# threads.threadControl.preventArchiving.nowPrevented
source: Thread archiving will now be prevented
ta: நூல் காப்பகமானது இப்போது தடுக்கப்படும்

# threads.threadControl.preventArchiving.nowPreventedNoLog
source: Thread archiving will now be prevented Note: Failed to send a log to your specified mod action log. Please check the channel exists and permissions are correct
ta: நூல் காப்பகமானது இப்போது தடுக்கப்படும் குறிப்பு: உங்கள் குறிப்பிட்ட மோட் செயல் பதிவுக்கு ஒரு பதிவை அனுப்பத் தவறிவிட்டது. சேனல் இருப்பதை சரிபார்க்கவும், அனுமதிகள் சரியானவை

# threads.threadControl.fetchIssue
source: Are you sure this channel is a thread? If it is, I can't fetch it properly.
ta: இந்த சேனல் ஒரு நூல் என்று உறுதியாக நம்புகிறீர்களா? அது இருந்தால், என்னால் அதை சரியாகப் பெற முடியாது.

# threads.threadControl.arguments.rename.newName.name
source: new-name
ta: புதிய பெயர்

# threads.threadControl.arguments.rename.newName.description
source: The new name to give to the thread
ta: நூலுக்கு கொடுக்க புதிய பெயர்

# threads.threadControl.arguments.archive.lock.name
source: lock
ta: பூட்டு

# threads.threadControl.arguments.archive.lock.description
source: Whether to lock the thread if you are a moderator. Default is false.
ta: நீங்கள் ஒரு மதிப்பீட்டாளராக இருந்தால் நூலைப் பூட்ட வேண்டுமா. இயல்புநிலை தவறானது.

# threads.threadControl.arguments.transfer.newOwner.name
source: new-owner
ta: புதிய உரிமையாளர்

# threads.threadControl.arguments.transfer.newOwner.description
source: The user you want to transfer ownership of the thread to
ta: நீங்கள் நூலின் உரிமையை மாற்ற விரும்பும் பயனர்

# threads.threadControl.notYours
source: **Error:** This is not your thread!
ta: ** பிழை: ** இது உங்கள் நூல் அல்ல!

# events.memberLogging.memberEvent.footer
source: Member count {0}
ta: உறுப்பினர் எண்ணிக்கை {0}

# events.memberLogging.memberEvent.embedId
source: ID:
ta: ஐடி:

# events.memberLogging.memberJoin.embedAuthor
source: User joined the server!
ta: பயனர் சேவையகத்தில் சேர்ந்தார்!

# events.memberLogging.memberJoin.embedWelcome
source: Welcome:
ta: வரவேற்கிறோம்:

# events.memberLogging.memberJoin.publicEmbedAuthor
source: Welcome {0}
ta: வரவேற்கிறோம் {0}

# events.memberLogging.memberJoin.publicEmbedWelcomeMessage
source: Welcome to the server
ta: சேவையகத்திற்கு வருக

# events.memberLogging.memberLeave.embedAuthor
source: User left the server!
ta: பயனர் சேவையகத்தை விட்டு வெளியேறினார்!

# events.memberLogging.memberLeave.embedGoodbye
source: Goodbye:
ta: குட்பை:

# events.memberLogging.memberLeave.publicEmbedAuthor
source: Goodbye {0}
ta: குட்பை {0}

# events.memberLogging.memberLeave.publicEmbedGoodbyeMessage
source: Farewell!
ta: விடைபெறுதல்!

# events.messageEvent.location
source: Location: {0} ({1})
ta: இடம்: {0} ({1})

# events.messageEvent.failedContents
source: Failed to retrieve previous message contents
ta: முந்தைய செய்தி உள்ளடக்கங்களை மீட்டெடுப்பதில் தோல்வி

# events.messageDelete.noChannelName
source: Could not get channel name
ta: சேனல் பெயரைப் பெற முடியவில்லை

# events.messageDelete.single.embedAuthor
source: Message deleted
ta: செய்தி நீக்கப்பட்டது

# events.messageDelete.single.embedContents
source: Message Contents
ta: செய்தி உள்ளடக்கங்கள்

# events.messageDelete.bulk.embedTitle
source: Bulk Message Delete
ta: மொத்த செய்தி நீக்கு

# events.messageDelete.bulk.embedDescription
source: A Bulk delete of message occurred
ta: செய்தியின் மொத்த நீக்குதல் ஏற்பட்டது

# events.messageDelete.bulk.embedLocation
source: Location
ta: இடம்

# events.messageDelete.bulk.embedNumber
source: Number of Messages
ta: செய்திகளின் எண்ணிக்கை

# events.messageDelete.bulk.embedFailedContent
source: The messages from this event could not be gathered and logged
ta: இந்த நிகழ்வின் செய்திகளை சேகரித்து உள்நுழைய முடியவில்லை

# events.messageEdit.embedAuthor
source: Message edited
ta: செய்தி திருத்தப்பட்டது

# events.messageEdit.embedPrevious
source: Previous Contents
ta: முந்தைய உள்ளடக்கங்கள்

# events.messageEdit.embedNew
source: New Contents
ta: புதிய உள்ளடக்கங்கள்

# events.messageEdit.embedNewFail
source: Failed to retrieve new message contents
ta: புதிய செய்தி உள்ளடக்கங்களை மீட்டெடுப்பதில் தோல்வி

# events.messageEdit.embedButton
source: Jump
ta: தாவு

# events.moderation.ban.banned
source: Banned
ta: தடைசெய்யப்பட்டது

# events.moderation.ban.softBanned
source: Soft-Banned
ta: மென்மையான தடை

# events.moderation.ban.tempBanned
source: Temporarily Banned
ta: தற்காலிகமாக தடை செய்யப்பட்டது

# events.moderation.ban.aUser
source: a user!
ta: ஒரு பயனர்!

# events.moderation.ban.banDescription
source: {0} has been
ta: {0} உள்ளது

# events.moderation.ban.defaultBanDescription
source: {0} has been banned!
ta: {0} தடைசெய்யப்பட்டுள்ளது!

# events.moderation.ban.deleteDays
source: Days of messages deleted
ta: செய்திகளின் நாட்கள் நீக்கப்பட்டன

# events.moderation.ban.duration
source: Duration:
ta: காலம்:

# events.moderation.unban.tempRemoved
source: Temporary ban removed
ta: தற்காலிக தடை நீக்கப்பட்டது

# events.moderation.unban.unbanned
source: Unbanned a user
ta: ஒரு பயனரை தடைசெய்தது

# events.moderation.unban.description
source: {0} has
ta: {0} உள்ளது

# events.moderation.unban.tempRemovedDesc
source: had their temporary ban removed!
ta: அவர்களின் தற்காலிக தடை அகற்றப்பட்டதா!

# events.moderation.unban.unbannedDesc
source: been unbanned!
ta: தடைசெய்யப்படவில்லை!

# events.moderation.unban.reason
source: Reason:
ta: காரணம்:

# events.moderation.unban.initialDate
source: Initial Ban date:
ta: தொடக்க தடை தேதி:

# events.moderation.memberUpdate.timeoutRemoved
source: Timeout removed
ta: நேரம் முடிந்தது

# events.moderation.memberUpdate.timeoutAdded
source: Timeout
ta: நேரம் முடிந்தது

# events.moderation.memberUpdate.viaMenu
source: via Discord menus
ta: டிச்கார்ட் மெனுக்கள் வழியாக

# events.moderation.memberUpdate.updatedTitle
source: Member updates
ta: உறுப்பினர் புதுப்பிப்புகள்

# events.moderation.memberUpdate.updatedDesc
source: {0} has been updated
ta: {0} புதுப்பிக்கப்பட்டுள்ளது

# events.moderation.memberUpdate.nickChange
source: Nickname changed
ta: புனைப்பெயர் மாற்றப்பட்டது

# events.moderation.memberUpdate.nickChangeVal
source: Old: {old} New: {new}
ta: பழையது: {old} புதியது: {new}

# events.moderation.memberUpdate.newRoles
source: New Roles
ta: புதிய பாத்திரங்கள்

# events.moderation.memberUpdate.oldRoles
source: Old Roles
ta: பழைய பாத்திரங்கள்

# utility.galleryChannel.name
source: gallery-channel
ta: கேலரி-சேனல்

# utility.galleryChannel.description
source: The parent command for image channel setting
ta: பட சேனல் அமைப்பிற்கான பெற்றோர் கட்டளை

# utility.galleryChannel.set.name
source: set
ta: கணம்

# utility.galleryChannel.set.description
source: Set a channel as a gallery channel
ta: சேனலை கேலரி சேனலாக அமைக்கவும்

# utility.galleryChannel.set.already
source: This channel is already a gallery channel
ta: இந்த சேனல் ஏற்கனவே ஒரு கேலரி சேனலாகும்

# utility.galleryChannel.set.response
source: Set channel as a gallery channel.
ta: சேனலை கேலரி சேனலாக அமைக்கவும்.

# utility.galleryChannel.set.embedTitle
source: New Gallery channel
ta: புதிய கேலரி சேனல்

# utility.galleryChannel.set.embedDesc
source: {0} was added as a gallery channel
ta: {0} கேலரி சேனலாக சேர்க்கப்பட்டது

# utility.galleryChannel.set.embedRequested
source: Requested by {0}
ta: {0 by ஆல் கோரப்பட்டது

# utility.galleryChannel.unset.name
source: unset
ta: அமைக்கப்படாதது

# utility.galleryChannel.unset.description
source: Unset a channel as a gallery channel.
ta: கேலரி சேனலாக ஒரு சேனலை அமைக்கவும்.

# utility.galleryChannel.unset.response
source: Channel no-longer gallery channel.
ta: சேனல் நோ-நீண்ட கேலரி சேனல்.

# utility.galleryChannel.unset.embedTitle
source: Removed Gallery channel
ta: அகற்றப்பட்ட கேலரி சேனல்

# utility.galleryChannel.unset.embedDesc
source: {0} was removed as a Gallery channel
ta: {0 a ஒரு கேலரி சேனலாக அகற்றப்பட்டது

# utility.galleryChannel.unset.embedRequested
source: Requested by {0}
ta: {0 by ஆல் கோரப்பட்டது

# utility.galleryChannel.unset.notGallery
source: This channel is not a gallery channel!
ta: இந்த சேனல் கேலரி சேனல் அல்ல!

# utility.galleryChannel.list.name
source: list
ta: பட்டியல்

# utility.galleryChannel.list.description
source: List all gallery channels in the guild
ta: கில்டில் உள்ள அனைத்து கேலரி சேனல்களையும் பட்டியலிடுங்கள்

# utility.galleryChannel.list.embedTitle
source: Gallery Channels
ta: கேலரி சேனல்கள்

# utility.galleryChannel.list.embedDesc
source: Here are the gallery channels in this guild.
ta: இந்த கில்டில் உள்ள கேலரி சேனல்கள் இங்கே.

# utility.galleryChannel.list.embedChannelsField
source: Channels:
ta: சேனல்கள்:

# utility.galleryChannel.list.noneFound
source: No channels found!
ta: சேனல்கள் எதுவும் கிடைக்கவில்லை!

# utility.galleryChannel.noPerms
source: Hi! This is a gallery channel, but I don't have Manage Messages for this channel, therefore I cannot delete messages that don't contain images! Could someone ask staff fix it please? Thanks!
ta: ஆய்! இது ஒரு கேலரி சேனல், ஆனால் இந்த சேனலுக்கான செய்திகளை என்னிடம் நிர்வகிக்கவில்லை, எனவே படங்கள் இல்லாத செய்திகளை என்னால் நீக்க முடியாது! தயவுசெய்து யாராவது ஊழியர்களைக் கேட்க முடியுமா? நன்றி!

# utility.galleryChannel.images
source: This channel is for images only!
ta: இந்த சேனல் படங்களுக்கு மட்டுமே!

# utility.github.name
source: github
ta: கிரப்

# utility.github.description
source: THe parent command for all /github commands
ta: அனைவருக்கும் பெற்றோர் கட்டளை /கிதுப் கட்டளைகள்

# utility.github.noDefault
source: There is no default repository set. Please specify a repository to search, or set a default.
ta: இயல்புநிலை களஞ்சிய தொகுப்பு எதுவும் இல்லை. தேட ஒரு களஞ்சியத்தைக் குறிப்பிடவும் அல்லது இயல்புநிலையை அமைக்கவும்.

# utility.github.badFormatEmbedTitle
source: Make sure your repository input is formatted like this:
ta: உங்கள் களஞ்சிய உள்ளீடு இப்படி வடிவமைக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்:

# utility.github.badFormatEmbedDesc
source: Format: `User/Repo` or `Org/Repo` For example: `HyacinthBots/LilyBot`
ta: வடிவம்: `பயனர்/ரெப்போ` அல்லது` org/repo` எடுத்துக்காட்டாக: `ஐசின்த்போட்ச்/லில்லிபோட்`

# utility.github.unableToRepo
source: Unable to access repository, make sure this repository exists
ta: களஞ்சியத்தை அணுக முடியாமல், இந்த களஞ்சியம் இருப்பதை உறுதிசெய்க

# utility.github.issue.name
source: issue
ta: சிக்கல்

# utility.github.issue.description
source: Look up an issue on a specific repository
ta: ஒரு குறிப்பிட்ட களஞ்சியத்தில் ஒரு சிக்கலைப் பாருங்கள்

# utility.github.issue.unableToFind
source: Unable to find issue number! Make sure this issue exists
ta: வெளியீட்டு எண்ணைக் கண்டுபிடிக்க முடியவில்லை! இந்த சிக்கல் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்

# utility.github.issue.embedDescPr
source: **Information for Pull request #{number} in {repo}**
ta: ** {number} ** இல் இழுக்கும் கோரிக்கைக்கான செய்தி #{repo}

# utility.github.issue.embedDescIs
source: **Information for Issue #{number} in {repo}**
ta: ** வெளியீட்டிற்கான செய்தி #{number} {repo} **

# utility.github.issue.noDesc
source: No description provided
ta: எந்த விளக்கமும் வழங்கப்படவில்லை

# utility.github.issue.errorTitle
source: Error!
ta: பிழை!

# utility.github.issue.errorDesc
source: Error occurred initializing Pull Request. How did this happen?
ta: இழுப்பு கோரிக்கையைத் தொடங்க பிழை ஏற்பட்டது. இது எப்படி நடந்தது?

# utility.github.issue.statusField
source: Status:
ta: நிலை:

# utility.github.issue.merged
source: Merged
ta: ஒன்றிணைந்தது

# utility.github.issue.closed
source: Closed
ta: மூடப்பட்டது

# utility.github.issue.draft
source: Draft
ta: வரைவு

# utility.github.issue.open
source: Open
ta: திற

# utility.github.issue.authorField
source: Author:
ta: ஆசிரியர்:

# utility.github.issue.unknownAuthor
source: Unknown Author
ta: தெரியாத ஆசிரியர்

# utility.github.issue.openedField
source: Opened on:
ta: திறக்கப்பட்டது:

# utility.github.issue.labelsField
source: Labels:
ta: லேபிள்கள்:

# utility.github.issue.arguments.issue.name
source: issue-number
ta: வெளியீடு-எண்

# utility.github.issue.arguments.issue.description
source: The issue number you would like to search for
ta: நீங்கள் தேட விரும்பும் வெளியீட்டு எண்

# utility.github.issue.arguments.repo.name
source: repository
ta: களஞ்சியம்

# utility.github.issue.arguments.repo.description
source: The GitHub repository you would like to search, if no default is set.
ta: இயல்புநிலை எதுவும் அமைக்கப்படாவிட்டால், நீங்கள் தேட விரும்பும் அறிவிலிமையம் களஞ்சியம்.

# utility.github.repo.name
source: repo
ta: களஞ்சி

# utility.github.repo.description
source: Search GitHub for a specific repository
ta: ஒரு குறிப்பிட்ட களஞ்சியத்திற்கு கிதப்பைத் தேடுங்கள்

# utility.github.repo.embedTitle
source: GitHub Repository Info for {0}
ta: {0 க்கு க்கான அறிவிலிமையம் களஞ்சிய செய்தி

# utility.github.repo.licenceField
source: License:
ta: உரிமம்:

# utility.github.repo.openIssues
source: Open Issues and PRs:
ta: திறந்த சிக்கல்கள் மற்றும் பி.ஆர்.எச்:

# utility.github.repo.forks
source: Forks:
ta: ஃபோர்க்ச்:

# utility.github.repo.stars
source: Stars:
ta: நட்சத்திரங்கள்:

# utility.github.repo.size
source: Size:
ta: அளவு:

# utility.github.repo.language
source: Language:
ta: மொழி:

# utility.github.user.name
source: user
ta: பயனர்

# utility.github.user.description
source: Search GitHub for a User/Organization
ta: ஒரு பயனர்/நிறுவனத்திற்காக கிதப்பைத் தேடுங்கள்

# utility.github.user.invalidName
source: Invalid Username. Make sure this user exists!
ta: தவறான பயனர்பெயர். இந்த பயனர் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்!

# utility.github.user.embedTitle
source: GitHub profile for {0}
ta: {0 க்கு க்கான அறிவிலிமையம் சுயவிவரம்

# utility.github.user.repositories
source: Repository:
ta: களஞ்சியம்:

# utility.github.user.followers
source: Followers:
ta: பின்தொடர்பவர்கள்:

# utility.github.user.following
source: Following:
ta: பின்வருமாறு:

# utility.github.user.company
source: Company
ta: நிறுவனம்

# utility.github.user.website
source: Website:
ta: வலைத்தளம்:

# utility.github.user.publicMembers
source: Public Members
ta: பொது உறுப்பினர்கள்

# utility.github.user.arguments.username.name
source: username
ta: பயனர்பெயர்

# utility.github.user.arguments.username.description
source: The name of the User/Organisation you wissh to search for
ta: நீங்கள் தேட விரும்பும் பயனர்/அமைப்பின் பெயர்

# utility.github.defaultRepo.name
source: default-repo
ta: இயல்புநிலை-மறுதொடக்கம்

# utility.github.defaultRepo.description
source: Set the default repo to look up issues in
ta: சிக்கல்களைக் காண இயல்புநிலை ரெப்போவை அமைக்கவும்

# utility.github.defaultRepo.invalidUrl
source: Invalid repo URL, please try again
ta: தவறான ரெப்போ முகவரி, தயவுசெய்து மீண்டும் முயற்சிக்கவும்

# utility.github.defaultRepo.response
source: Default repo set.
ta: இயல்புநிலை ரெப்போ தொகுப்பு.

# utility.github.removeDefaultRepo.name
source: remove-default-repo
ta: அகற்றுதல்-மறுதொடக்கம்

# utility.github.removeDefaultRepo.description
source: Removes the default repo for this guild
ta: இந்த கில்டிற்கான இயல்புநிலை ரெப்போவை நீக்குகிறது

# utility.github.removeDefaultRepo.noDefault
source: There is no default repo for this guild!
ta: இந்த கில்டுக்கு இயல்புநிலை ரெப்போ இல்லை!

# utility.github.removeDefaultRepo.response
source: Default repo removed
ta: இயல்புநிலை ரெப்போ அகற்றப்பட்டது

# utility.guildAnnouncements.name
source: announcement
ta: அறிவிப்பு

# utility.guildAnnouncements.description
source: Send an announcement to all guilds Lily is in
ta: லில்லி உள்ள அனைத்து கில்டுகளுக்கும் ஒரு அறிவிப்பை அனுப்பவும்

# utility.guildAnnouncements.sendConfirm
source: Would you like to send this message
ta: இந்த செய்தியை அனுப்ப விரும்புகிறீர்களா?

# utility.guildAnnouncements.deliverAll
source: It will be delivered to all servers this bot is in.
ta: இந்த போட் இருக்கும் அனைத்து சேவையகங்களுக்கும் இது வழங்கப்படும்.

# utility.guildAnnouncements.deliverSpecific
source: It will be delivered to your specified target guild: {0}
ta: இது உங்கள் குறிப்பிட்ட இலக்கு கில்டுக்கு வழங்கப்படும்: {0}

# utility.guildAnnouncements.sent
source: Message sent!
ta: செய்தி அனுப்பப்பட்டது!

# utility.guildAnnouncements.targetNotFound
source: Target guild not found
ta: இலக்கு கில்ட் கிடைக்கவில்லை

# utility.guildAnnouncements.noAvailableChannel
source: Couldn't find an available channel to send a message in
ta: ஒரு செய்தியை அனுப்ப கிடைக்கக்கூடிய சேனலைக் கண்டுபிடிக்க முடியவில்லை

# utility.guildAnnouncements.deliveredToOne
source: This message was delivered to this server alone
ta: இந்த செய்தி இந்த சேவையகத்திற்கு மட்டும் வழங்கப்பட்டது

# utility.guildAnnouncements.sentBy
source: Sent by {0}
ta: {0 by ஆல் அனுப்பப்பட்டது

# utility.guildAnnouncements.notSent
source: Message not sent.
ta: செய்தி அனுப்பப்படவில்லை.

# utility.guildAnnouncements.arguments.target.name
source: target-guild
ta: இலக்கு-கில்ட்

# utility.guildAnnouncements.arguments.target.description
source: The ID of the target guild to send the announcement too.
ta: அறிவிப்பையும் அனுப்ப இலக்கு கில்ட்டின் ஐடி.

# utility.guildAnnouncements.modal.title
source: Send an announcement
ta: ஒரு அறிவிப்பை அனுப்பவும்

# utility.guildAnnouncements.modal.header.label
source: Announcement Header
ta: அறிவிப்பு தலைப்பு

# utility.guildAnnouncements.modal.header.placeholder
source: Version 7.6.5!
ta: பதிப்பு 7.6.5!

# utility.guildAnnouncements.modal.body.label
source: Announcement Body
ta: அறிவிப்பு அமைப்பு

# utility.guildAnnouncements.modal.body.placeholder
source: We're happy to announce Lily is now written in Rust! It turns out we really like crabs
ta: லில்லி இப்போது ரச்டில் எழுதப்பட்டதாக அறிவிப்பதில் நாங்கள் மகிழ்ச்சியடைகிறோம்! நாங்கள் நண்டுகளை விரும்புகிறோம்

# utility.infoCommands.help.name
source: help
ta: உதவி

# utility.infoCommands.help.description
source: Get help with using Lily!
ta: லில்லி பயன்படுத்த உதவி பெறுங்கள்!

# utility.infoCommands.help.embedTitle
source: What is LilyBot?
ta: லில்லிபோட் என்றால் என்ன?

# utility.infoCommands.help.embedDesc
source: Lily is a FOSS multipurpose bot for Discord created by the HyacinthBots organization. Use `/about` to learn more, or `/invite` to get an invitation link.
ta: லில்லி என்பது ஐசின்த்போட்ச் அமைப்பால் உருவாக்கப்பட்ட முரண்பாட்டிற்கான ஒரு ஃபோச் பல்நோக்கு போட் ஆகும். மேலும் அறிய `/பற்றி` பயன்படுத்தவும், அல்லது அழைப்பிதழ் இணைப்பைப் பெற`/அழைப்பிதழ்` பயன்படுத்தவும்.

# utility.infoCommands.help.configFieldName
source: How do I configure Lily?
ta: லில்லியை எவ்வாறு கட்டமைப்பது?

# utility.infoCommands.help.configFieldValue
source: Run the `/config X` commands and provide the requested values. For more information, use the `/command-list` command and navigate to the relevant page
ta: `/Config x` கட்டளைகளை இயக்கி, கோரப்பட்ட மதிப்புகளை வழங்கவும். மேலும் தகவலுக்கு, `/கட்டளை-பட்டியல்` கட்டளையைப் பயன்படுத்தி தொடர்புடைய பக்கத்திற்கு செல்லவும்

# utility.infoCommands.help.whatFieldName
source: What commands are there?
ta: என்ன கட்டளைகள் உள்ளன?

# utility.infoCommands.help.whatFieldValue
source: Lots! Too many to list here. You can read about the commands using the `/command-list` command, or visiting the [commands list on GitHub]
ta: நிறைய! இங்கே பட்டியலிட பல. `/கட்டளை-பட்டியல்` கட்டளையைப் பயன்படுத்தி கட்டளைகளைப் பற்றி நீங்கள் படிக்கலாம் அல்லது [Github இல் உள்ள [கட்டளைகள் பட்டியலைப் பார்வையிடலாம்]

# utility.infoCommands.help.supportFieldName
source: How do I get more help and/or learn more?
ta: நான் எவ்வாறு கூடுதல் உதவி பெறுவது மற்றும்/அல்லது மேலும் கற்றுக்கொள்வது?

# utility.infoCommands.help.supportFieldValue
source: To get additional support, discuss Lily, suggest features, or even lend a hand with development join our Discord at https://discord.gg/hy2329fcTZ
ta: கூடுதல் ஆதரவைப் பெற, லில்லி பற்றி விவாதிக்க, அம்சங்களை பரிந்துரைக்க, அல்லது வளர்ச்சியுடன் ஒரு கையை கடன் கொடுக்கவும் https://discord.gg/hy2329fctz இல் எங்கள் டிச்கார்ட்டில் சேரவும்

# utility.infoCommands.help.usefulFieldName
source: Useful links
ta: பயனுள்ள இணைப்புகள்

# utility.infoCommands.help.usefulFieldValue
source: Website: https://hyacinthbots.org GitHub: {0} Buy Me a Coffee: https://buymeacoffee.com/HyacinthBots Twitter: https://twitter.com/HyacinthBots Email: `hyacinthbots@outlook.com` Discord: https://discord.gg/hy2329fcTZ
ta: வலைத்தளம்: https://hyacinthbots.org கிதுப்: {0} எனக்கு ஒரு காபி வாங்கவும்: https://buymeacoffee.com/hyacinthbots ட்விட்டர்: https://twitter.com/hyacinthbots மின்னஞ்சல்: `ஐசின்த்போட்ச்@outlook.com` முரண்பாடு: https://discord.gg/hy2329fctz

# utility.infoCommands.help.button.invite
source: Invite Link
ta: இணைப்பை அழைக்கவும்

# utility.infoCommands.help.button.privacy
source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

# utility.infoCommands.help.button.tos
source: Terms of Service
ta: பணி விதிமுறைகள்

# utility.infoCommands.invite.name
source: invite
ta: அழைக்கவும்

# utility.infoCommands.invite.description
source: Get an invitation link for Lily!
ta: லில்லிக்கு அழைப்பிதழ் இணைப்பைப் பெறுங்கள்!

# utility.infoCommands.invite.value
source: Use this link to add Lily to your server: https://discord.com/api/oauth2/authorize?client_id=876278900836139008&permissions=1151990787078&scope=bot%20applications.commands
ta: உங்கள் சேவையகத்தில் லில்லி சேர்க்க இந்த இணைப்பைப் பயன்படுத்தவும்: https://discord.com/api/oauth2/authorize?client_id=876278900836139008&permissions=115190787078&scope=bot%20Applications.commands

# utility.newsChannel.newsPublishing.name
source: news-publishing
ta: செய்தி வெளியீடு

# utility.newsChannel.newsPublishing.description
source: The parent command for news publishing channels
ta: செய்தி வெளியீட்டு சேனல்களுக்கான பெற்றோர் கட்டளை

# utility.newsChannel.newsPublishing.arguments.channel.name
source: channel
ta: வாய்க்கால்
