Repository: 247i/TACETr
Catalog: உரை/தானி/lilybot-lilybot-translations-*.po
Languages: ta

# moderation.clearCommands.clear.name
source: clear
ta: தெளிவான

# moderation.clearCommands.clear.description
source: Parent command for clear commands
ta: தெளிவான கட்டளைகளுக்கு பெற்றோர் கட்டளை

# moderation.clearCommands.clear.count.name
source: count
ta: எண்ணுங்கள்

# moderation.clearCommands.clear.count.description
source: Clear a specific count of messages
ta: செய்திகளின் குறிப்பிட்ட எண்ணிக்கையை அழிக்கவும்

# moderation.clearCommands.clear.before.name
source: before
ta: முன்

# moderation.clearCommands.clear.before.description
source: Clear messages before a given message ID
ta: கொடுக்கப்பட்ட செய்தி ஐடியுக்கு முன் செய்திகளை அழிக்கவும்

# moderation.clearCommands.clear.before.arguments.before.name
source: before
ta: முன்

# moderation.clearCommands.clear.before.arguments.before.description
source: The ID of the message to clear before
ta: முன் அழிக்க செய்தியின் ஐடி

# moderation.clearCommands.clear.after.name
source: after
ta: பிறகு

# moderation.clearCommands.clear.after.description
source: clear messages after a given message ID
ta: கொடுக்கப்பட்ட செய்தி ஐடியுக்குப் பிறகு செய்திகளை அழிக்கவும்

# moderation.clearCommands.clear.after.arguments.after.name
source: after
ta: பிறகு

# moderation.clearCommands.clear.after.arguments.after.description
source: The ID of the message to clear after
ta: பிறகு அழிக்க செய்தியின் ஐடி

# moderation.clearCommands.clear.between.name
source: between
ta: இடையில்

# moderation.clearCommands.clear.between.description
source: Clear messages between 2 message ID's
ta: 2 செய்தி ஐடியுகளுக்கு இடையில் செய்திகளை அழிக்கவும்

# moderation.clearCommands.arguments.author.name
source: author
ta: நூலாசிரியர்

# moderation.clearCommands.arguments.author.description
source: The author of the messages to clear
ta: அழிக்க செய்திகளின் ஆசிரியர்

# moderation.clearCommands.arguments.count.name
source: message-count
ta: செய்தி-எண்ணிக்கை

# moderation.clearCommands.arguments.count.description
source: The number of messages to clear
ta: அழிக்க செய்திகளின் எண்ணிக்கை

# moderation.clearCommands.error.noChannel
source: Could not get the channel to clear messages from
ta: செய்திகளை அழிக்க சேனலைப் பெற முடியவில்லை

# moderation.clearCommands.error.beforeAfter
source: Before cannot be more recent than after
ta: இதற்கு முன் இருந்ததை விட மிக சமீபத்தியதாக இருக்க முடியாது

# moderation.clearCommands.cleared
source: Messages cleared.
ta: செய்திகள் அழிக்கப்பட்டன.

# moderation.clearCommands.numberCleared
source: {0} messages have been cleared
ta: {0} செய்திகள் அழிக்கப்பட்டுள்ளன

# moderation.clearCommands.occurredIn
source: Action occurred in {0}
ta: {0} இல் நடவடிக்கை ஏற்பட்டது

# moderation.lockingCommands.lock.name
source: lock
ta: பூட்டு

# moderation.lockingCommands.lock.description
source: The parent command for all locking commands
ta: அனைத்து பூட்டுதல் கட்டளைகளுக்கும் பெற்றோர் கட்டளை

# moderation.lockingCommands.channel.name
source: channel
ta: வாய்க்கால்

# moderation.lockingCommands.lock.channel.description
source: Lock a channel so those with default permissions cannot send messages
ta: ஒரு சேனலைப் பூட்டவும், இதனால் இயல்புநிலை அனுமதிகள் உள்ளவர்கள் செய்திகளை அனுப்ப முடியாது

# moderation.lockingCommands.lock.channel.permsError
source: There was an error getting the permissions for this channel. Please try again.
ta: இந்த சேனலுக்கான அனுமதிகளைப் பெறுவதில் பிழை ஏற்பட்டது. மீண்டும் முயற்சிக்கவும்.

# moderation.lockingCommands.lock.channel.already
source: This channel is already locked
ta: இந்த சேனல் ஏற்கனவே பூட்டப்பட்டுள்ளது

# moderation.lockingCommands.lock.channel.serverLocked
source: The server is locked, I cannot unlock this channel
ta: சேவையகம் பூட்டப்பட்டுள்ளது, இந்த சேனலை என்னால் திறக்க முடியாது

# moderation.lockingCommands.lock.channel.publicEmbedTitle
source: Channel Locked
ta: சேனல் பூட்டப்பட்டுள்ளது

# moderation.lockingCommands.lock.channel.publicEmbedDesc
source: This channel has been locked by a moderator.
ta: இந்த சேனல் ஒரு மதிப்பீட்டாளரால் பூட்டப்பட்டுள்ளது.

# moderation.lockingCommands.lock.channel.lockConfirmation
source: {0} has been locked.
ta: {0 the பூட்டப்பட்டுள்ளது.

# moderation.lockingCommands.lock.channel.embedDesc
source: {channel} has been locked. **Reason:** {reason}
ta: {சேனல் the பூட்டப்பட்டுள்ளது. ** காரணம்: ** {channel}

# moderation.lockingCommands.lock.channel.arguments.channel.description
source: Channel to lock. Defaults to current channel
ta: பூட்ட சேனல். தற்போதைய சேனலுக்கான இயல்புநிலை

# moderation.lockingCommands.lock.channel.arguments.reason.name
source: reason
ta: காரணம்

# moderation.lockingCommands.lock.channel.arguments.reason.description
source: Reason for locking the channel
ta: சேனலைப் பூட்டுவதற்கான காரணம்

# moderation.lockingCommands.lock.channel.arguments.reason.default
source: No reason provided
ta: எந்த காரணமும் வழங்கப்படவில்லை

# moderation.lockingCommands.server.name
source: server
ta: சேவையகம்

# moderation.lockingCommands.lock.server.description
source: Lock the server so those with default permissions cannot send messages
ta: சேவையகத்தைப் பூட்டவும், இதனால் இயல்புநிலை அனுமதிகள் உள்ளவர்கள் செய்திகளை அனுப்ப முடியாது

# moderation.lockingCommands.lock.server.already
source: The server is already locked.
ta: சேவையகம் ஏற்கனவே பூட்டப்பட்டுள்ளது.

# moderation.lockingCommands.lock.server.lockConfirmation
source: Server locked.
ta: சேவையகம் பூட்டப்பட்டுள்ளது.

# moderation.lockingCommands.lock.server.embedDesc
source: **Reason:** {0}
ta: ** காரணம்: ** {0}

# moderation.lockingCommands.unlock.name
source: unlock
ta: திறக்க

# moderation.lockingCommands.unlock.description
source: The parent command for all unlocking commands
ta: திறக்கும் அனைத்து கட்டளைகளுக்கும் பெற்றோர் கட்டளை

# moderation.lockingCommands.unlock.channel.description
source: Unlock a channel so everyone can type messages again
ta: ஒரு சேனலைத் திறக்கவும், இதனால் எல்லோரும் மீண்டும் செய்திகளைத் தட்டச்சு செய்யலாம்

# moderation.lockingCommands.unlock.channel.unlockServerToUnlock
source: Please unlock the server to unlock this channel
ta: இந்த சேனலைத் திறக்க சேவையகத்தைத் திறக்கவும்

# moderation.lockingCommands.unlock.channel.notLocked
source: This channel is not locked!
ta: இந்த சேனல் பூட்டப்படவில்லை!

# moderation.lockingCommands.unlock.channel.publicEmbedTitle
source: Channel Unlocked
ta: சேனல் திறக்கப்பட்டது

# moderation.lockingCommands.unlock.channel.publicEmbedDesc
source: This channel has been unlocked by a moderator. Please be aware of the rules when continuing discussion.
ta: இந்த சேனல் ஒரு மதிப்பீட்டாளரால் திறக்கப்பட்டுள்ளது. தொடர்ந்து கலந்துரையாடலில் இருக்கும்போது விதிகளைப் பற்றி எச்சரிக்கையாக இருங்கள்.

# moderation.lockingCommands.unlock.channel.unlockConfirmation
source: {0} has been unlocked.
ta: {0} திறக்கப்பட்டுள்ளது.

# moderation.lockingCommands.unlock.channel.arguments.channel.description
source: Channel to unlock. Defaults to current channel
ta: திறக்க சேனல். தற்போதைய சேனலுக்கான இயல்புநிலை

# moderation.lockingCommands.unlock.server.description
source: Unlock the server so everyone can send messages again
ta: சேவையகத்தைத் திறக்கவும், இதனால் அனைவரும் மீண்டும் செய்திகளை அனுப்பலாம்

# moderation.lockingCommands.unlock.server.notLocked
source: The server isn't locked!
ta: சேவையகம் பூட்டப்படவில்லை!

# moderation.lockingCommands.unlock.server.unlockConfirmation
source: Server unlocked.
ta: சேவையகம் திறக்கப்பட்டது.

# moderation.lockingCommands.unableToChannel
source: I can't fetch the targeted channel properly
ta: இலக்கு சேனலை என்னால் சரியாகப் பெற முடியாது

# moderation.lockingCommands.unableToEveryone
source: I was unable to get the `@everyone` role. Please try again.
ta: `@அனைவரையும்` `பாத்திரத்தை என்னால் பெற முடியவில்லை. மீண்டும் முயற்சிக்கவும்.

# moderation.modCommands.messageCommand.name
source: Moderate
ta: மிதமான

# moderation.modCommands.warnSuffix
source: Please consider your actions carefully. For more information about the warning system, please see [this document]
ta: உங்கள் செயல்களை கவனமாக கவனியுங்கள். எச்சரிக்கை அமைப்பு பற்றிய கூடுதல் தகவலுக்கு, தயவுசெய்து [இந்த ஆவணத்தை] பார்க்கவும்

# moderation.modCommands.arguments.user.name
source: user
ta: பயனர்

# moderation.modCommands.arguments.user.description
source: Person to action
ta: செயலுக்கு நபர்

# moderation.modCommands.arguments.messages.name
source: delete-message-days
ta: -செய்தி நாட்களை நீக்கு

# moderation.modCommands.arguments.messages.description
source: The number of days worth of messages to delete
ta: நீக்க செய்திகளின் மதிப்புள்ள நாட்களின் எண்ணிக்கை

# moderation.modCommands.arguments.reason.name
source: reason
ta: காரணம்

# moderation.modCommands.arguments.reason.description
source: The reason for the action
ta: செயலுக்கான காரணம்

# moderation.modCommands.arguments.reason.default
source: No reason provided
ta: எந்த காரணமும் வழங்கப்படவில்லை

# moderation.modCommands.arguments.soft.name
source: soft-ban
ta: மென்மையான-பான்

# moderation.modCommands.arguments.soft.description
source: Whether to soft-ban this user (unban them once messages are deleted)
ta: இந்த பயனரை மென்மையாக மாற்றுவதா (செய்திகள் நீக்கப்பட்டவுடன் அவற்றைக் கட்டுப்படுத்தவும்)

# moderation.modCommands.arguments.dm.name
source: dm
ta: டி.எம்

# moderation.modCommands.arguments.dm.description
source: Whether to send the user a direct message about the action
ta: செயலைப் பற்றி பயனருக்கு நேரடி செய்தியை அனுப்ப வேண்டுமா?

# moderation.modCommands.arguments.image.name
source: image
ta: படம்

# moderation.modCommands.arguments.image.description
source: An image you'd like to provide as extra context for the action
ta: செயலுக்கு கூடுதல் சூழலாக நீங்கள் வழங்க விரும்பும் படம்

# moderation.modCommands.messageCommand.notFound
source: The message this command was run on cannot be found! It may have been deleted
ta: இந்த கட்டளை இயக்கப்பட்ட செய்தியைக் கண்டுபிடிக்க முடியாது! அது நீக்கப்பட்டிருக்கலாம்

# moderation.modCommands.messageCommand.howMod
source: How would you like to moderate this message?
ta: இந்த செய்தியை எவ்வாறு மிதப்படுத்த விரும்புகிறீர்கள்?

# moderation.modCommands.messageCommand.selectMenu.placeholder
source: Select action...
ta: செயல் என்பதைத் தேர்ந்தெடுக்கவும் ...

# moderation.modCommands.messageCommand.selectMenu.ban
source: Ban
ta: தடை

# moderation.modCommands.messageCommand.selectMenu.softBan
source: Soft-ban
ta: மென்மையான-பான்

# moderation.modCommands.messageCommand.selectMenu.kick
source: Kick
ta: கிக்

# moderation.modCommands.messageCommand.selectMenu.timeout
source: Timeout
ta: நேரம் முடிந்தது

# moderation.modCommands.messageCommand.selectMenu.warn
source: Warn
ta: எச்சரிக்கை

# moderation.modCommands.messageCommand.selectMenu.noOption
source: You did not select an option!
ta: நீங்கள் ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவில்லை!

# moderation.modCommands.messageCommand.reasonSuffix
source: for sending the following message: `{0}`
ta: பின்வரும் செய்தியை அனுப்ப: {0} `

# moderation.modCommands.ban.name
source: ban
ta: தடை

# moderation.modCommands.ban.description
source: Bans a user.
ta: ஒரு பயனரை தடை செய்கிறது.

# moderation.modCommands.ban.invalidMessages
source: Invalid `messages` parameter! This must be between 0 and 7!
ta: தவறான `செய்திகள்` அளவுரு! இது 0 முதல் 7 வரை இருக்க வேண்டும்!

# moderation.modCommands.ban.dmTitle
source: You have been banned from {0}
ta: நீங்கள் {0 இருந்து இலிருந்து தடை செய்யப்பட்டுள்ளீர்கள்

# moderation.modCommands.ban.dmDesc
source: **Reason:**
ta: ** காரணம்: **

# moderation.modCommands.ban.wasSoft
source: You were soft-banned. You are free to rejoin without the need to be unbanned.
ta: நீங்கள் மென்மையாக தடைசெய்யப்பட்டீர்கள். தடைசெய்யப்படாத தேவையில்லாமல் நீங்கள் மீண்டும் சேர சுதந்திரமாக இருக்கிறீர்கள்.

# moderation.modCommands.ban.publicSoftDesc
source: {0} has been soft-banned!
ta: {0} மென்மையாக தடைசெய்யப்பட்டுள்ளது!

# moderation.modCommands.ban.publicDesc
source: {0} has been banned!
ta: {0} தடைசெய்யப்பட்டுள்ளது!

# moderation.modCommands.ban.quick.defaultDesc
source: Quick banned {0}
ta: விரைவாக தடைசெய்யப்பட்ட {0}

# moderation.modCommands.ban.quick.embedTitle
source: Banned
ta: தடைசெய்யப்பட்டது

# moderation.modCommands.ban.quick.embedDescMessage
source: {0} was banned for sending this message.
ta: Meand இந்த செய்தியை அனுப்ப தடை விதிக்கப்பட்டது.

# moderation.modCommands.ban.quick.embedDescDeleted
source: {0} was banned for sending a deleted message.
ta: நீக்கப்பட்ட செய்தியை அனுப்புவதற்கு {0} தடை செய்யப்பட்டது.

# moderation.modCommands.ban.response
source: Banned a user.
ta: ஒரு பயனருக்கு தடை விதிக்கப்பட்டது.

# moderation.modCommands.tempBan.name
source: temp-ban
ta: தற்காலிகமாக

# moderation.modCommands.tempBan.description
source: The parent command for temporary ban commands
ta: தற்காலிக தடை கட்டளைகளுக்கான பெற்றோர் கட்டளை

# moderation.modCommands.tempBan.add.name
source: add
ta: கூட்டு

# moderation.modCommands.tempBan.add.description
source: Temporarily bans a user
ta: தற்காலிகமாக ஒரு பயனரை தடை செய்கிறது

# moderation.modCommands.tempBan.add.dmTitle
source: You have been temporarily banned from {0}
ta: நீங்கள் தற்காலிகமாக {0 இருந்து இலிருந்து தடை செய்யப்பட்டுள்ளீர்கள்

# moderation.modCommands.tempBan.add.dmDesc
source: **Reason:** {0} You are banned until {1}
ta: ** காரணம்: ** {0} {1} வரை நீங்கள் தடைசெய்யப்பட்டுள்ளீர்கள்

# moderation.modCommands.tempBan.add.publicEmbedTitle
source: Temp Banned a user
ta: தற்காலிகமாக ஒரு பயனரை தடை செய்தது

# moderation.modCommands.tempBan.add.publicEmbedDesc
source: {0} has been Temp Banned!
ta: {0 the தற்காலிகமாக தடைசெய்யப்பட்டுள்ளது!

# moderation.modCommands.tempBan.add.response
source: Temporarily banned {0}
ta: தற்காலிகமாக தடைசெய்யப்பட்டது {0}

# moderation.modCommands.tempBan.view.name
source: view-all
ta: பார்வை-அனைத்தும்

# moderation.modCommands.tempBan.view.description
source: View all temporary bans for this guild
ta: இந்த கில்டுக்கான அனைத்து தற்காலிக தடைகளையும் காண்க

# moderation.modCommands.tempBan.view.none
source: There are no temporary bans for this guild
ta: இந்த கில்டுக்கு தற்காலிக தடைகள் எதுவும் இல்லை

# moderation.modCommands.tempBan.view.page.user
source: User: {0}
ta: பயனர்: {0}

# moderation.modCommands.tempBan.view.page.mod
source: Moderator: {0}
ta: மதிப்பீட்டாளர்: {0}

# moderation.modCommands.tempBan.view.page.start
source: Start Time: {0}
ta: தொடக்க நேரம்: {0}

# moderation.modCommands.tempBan.view.page.end
source: End time: {0}
ta: இறுதி நேரம்: {0}

# moderation.modCommands.tempBan.view.page.title
source: Temporary bans for {0}
ta: {0 க்கு க்கான தற்காலிக தடைகள்

# moderation.modCommands.tempBan.arguments.duration.name
source: duration
ta: காலம்

# moderation.modCommands.tempBan.arguments.duration.description
source: The duration of the action
ta: செயலின் காலம்

# moderation.modCommands.softBan.dmTitle
source: You have been soft-banned from {0}
ta: நீங்கள் {0 இருந்து இலிருந்து மென்மையாக தடை செய்யப்பட்டுள்ளீர்கள்

# moderation.modCommands.softBan.dmDesc
source: Quick soft-banned {0}. This is a soft-ban, you are free to rejoin at any time
ta: விரைவான மென்மையான தடை {0}. இது ஒரு மென்மையான-தொட்டி, நீங்கள் எந்த நேரத்திலும் மீண்டும் சேர சுதந்திரமாக இருக்கிறீர்கள்

# moderation.modCommands.softBan.quick.embedTitle
source: Soft-Banned
ta: மென்மையான தடை

# moderation.modCommands.softBan.quick.embedDescMessage
source: {0} was soft-banned for sending this message.
ta: செய்தியை அனுப்பியதற்காக {0 the மென்மையாக தடைசெய்யப்பட்டது.

# moderation.modCommands.softBan.quick.embedDescDeleted
source: {0} was soft-banned for sending a deleted message.
ta: நீக்கப்பட்ட செய்தியை அனுப்புவதற்கு {0} மென்மையாக தடைசெய்யப்பட்டது.

# moderation.modCommands.softBan.response
source: Soft-Banned a user.
ta: மென்மையான தடைசெய்யப்பட்ட ஒரு பயனர்.

# moderation.modCommands.unban.name
source: unban
ta: முணுமுணுப்பு

# moderation.modCommands.unban.description
source: Unbans a user.
ta: ஒரு பயனரைத் தூண்டுகிறது.

# moderation.modCommands.unban.response
source: Unbanned user.
ta: தடைசெய்யப்படாத பயனர்.

# moderation.modCommands.kick.name
source: kick
ta: கிக்

# moderation.modCommands.kick.description
source: Kicks a user.
ta: ஒரு பயனரை உதைக்கிறது.

# moderation.modCommands.kick.dmTitle
source: You have been kicked from {0}
ta: நீங்கள் {0 இருந்து இலிருந்து உதைக்கப்பட்டீர்கள்

# moderation.modCommands.kick.dmDesc
source: **Reason:** {0}
ta: ** காரணம்: ** {0}

# moderation.modCommands.kick.quick.dmDesc
source: Quick kicked {0}
ta: விரைவாக உதைக்கப்பட்டது {0}

# moderation.modCommands.kick.quick.embedTitle
source: Kicked.
ta: உதைக்கப்பட்டது.

# moderation.modCommands.kick.quick.embedDescMessage
source: {0} was kicked for sending this message.
ta: செய்தியை அனுப்பியதற்காக {0 the உதைக்கப்பட்டது.

# moderation.modCommands.kick.quick.embedDescDeleted
source: {0} was kicked for sending a deleted message.
ta: நீக்கப்பட்ட செய்தியை அனுப்புவதற்காக {0 becound உதைக்கப்பட்டது.

# moderation.modCommands.kick.quick.actionDesc
source: Quick kicked via moderate menu {0}
ta: மிதமான பட்டியல் வழியாக விரைவாக உதைக்கப்பட்டது {0}

# moderation.modCommands.kick.embedDesc
source: {0} has been kicked!
ta: {0 the உதைக்கப்பட்டது!

# moderation.modCommands.kick.response
source: Kicked a user.
ta: ஒரு பயனரை உதைத்தார்.

# moderation.modCommands.timeout.name
source: timeout
ta: நேரம் முடிந்தது

# moderation.modCommands.timeout.description
source: Times out a user.
ta: ஒரு பயனரை வெளியேற்றும் முறை.

# moderation.modCommands.timeout.noLength
source: No timeout length has been set in the moderation config, please set a length.
ta: மிதமான கட்டமைப்பில் காலக்கெடு நீளம் எதுவும் அமைக்கப்படவில்லை, தயவுசெய்து ஒரு நீளத்தை அமைக்கவும்.

# moderation.modCommands.timeout.dmDesc
source: **Duration:** {0} ({1}) **Reason:** ${2}
ta: ** காலம்: ** {0} ({1}) ** காரணம்: ** $ {2}

# moderation.modCommands.timeout.dmTitle
source: You have been timed-out in {0}
ta: நீங்கள் {0} இல் நேரம் முடிந்துவிட்டீர்கள்

# moderation.modCommands.timeout.embedDesc
source: {0} was timed out by a moderator
ta: {0 a ஒரு மதிப்பீட்டாளரால் நேரம் முடிந்தது

# moderation.modCommands.timeout.duration
source: Duration:
ta: காலம்:

# moderation.modCommands.timeout.quick.dmDesc
source: You have been timed out for {0} {1}
ta: நீங்கள் {0} {1 க்கு க்கு நேரம் முடிந்துவிட்டீர்கள்

# moderation.modCommands.timeout.quick.embedTitle
source: Timeout
ta: நேரம் முடிந்தது

# moderation.modCommands.timeout.quick.embedDescMessage
source: {0} was timed-out for {1} for sending this message.
ta: இந்த செய்தியை அனுப்புவதற்கு {1 the க்கு நேரம் முடிந்தது.

# moderation.modCommands.timeout.quick.embedDescDeleted
source: {0} was timed-out for {1} for sending a deleted message.
ta: நீக்கப்பட்ட செய்தியை அனுப்புவதற்கு {1 the க்கு நேரம் முடிந்தது.

# moderation.modCommands.timeout.quick.actionDesc
source: Quick timeout via moderate menu {0}
ta: மிதமான பட்டியல் வழியாக விரைவான நேரம் முடிந்தது {0}

# moderation.modCommands.timeout.response
source: Timed-out a user.
ta: ஒரு பயனருக்கு நேரம் முடிந்தது.

# moderation.modCommands.timeout.arguments.duration.description
source: Duration of timeout
ta: காலக்கெடு காலம்

# moderation.modCommands.removeTimeout.name
source: remove-timeout
ta: அகற்று-காலத்தை அகற்றவும்

# moderation.modCommands.removeTimeout.description
source: Removes a timeout from a user
ta: ஒரு பயனரிடமிருந்து நேரத்தை நீக்குகிறது

# moderation.modCommands.removeTimeout.dmTitle
source: Timeout removed in {0}
ta: {0} இல் நேரம் நீக்கப்பட்டது

# moderation.modCommands.removeTimeout.dmDesc
source: Your timeout has been manually removed in this guild.
ta: இந்த கில்டில் உங்கள் நேரம் கைமுறையாக அகற்றப்பட்டுள்ளது.

# moderation.modCommands.removeTimeout.response
source: Removed timeout from user.
ta: பயனரிடமிருந்து நேரம் முடிந்தது.

# moderation.modCommands.warning.name
source: warn
ta: எச்சரிக்கை

# moderation.modCommands.warning.description
source: Warns a user.
ta: ஒரு பயனரை எச்சரிக்கிறது.

# moderation.modCommands.warning.noAction
source: No moderation action has been taken.
ta: மிதமான நடவடிக்கை எதுவும் எடுக்கப்படவில்லை.

# moderation.modCommands.warning.action3h
source: You have been timed out for 3 hours.
ta: நீங்கள் 3 மணி நேரம் நேரம் முடிந்துவிட்டீர்கள்.

# moderation.modCommands.warning.action12h
source: You have been timed out for 12 hours.
ta: நீங்கள் 12 மணி நேரம் நேரம் முடிந்துவிட்டீர்கள்.

# moderation.modCommands.warning.action3d
source: You have been timed out for 3 days.
ta: நீங்கள் 3 நாட்கள் நேரம் முடிந்துவிட்டீர்கள்.

# moderation.modCommands.warning.dmDesc
source: **Reason:** {0} {1}
ta: ** காரணம்: ** {0} {1}

# moderation.modCommands.warning.embedDesc
source: {0} has been warned by a moderator
ta: {0 a ஒரு மதிப்பீட்டாளரால் எச்சரிக்கப்பட்டுள்ளது

# moderation.modCommands.warning.dmTitle
source: Warning {0} in {1}
ta: {1} இல் எச்சரிக்கை {0}

# moderation.modCommands.warning.quickDmDesc
source: Quick warned {0} {1}
ta: விரைவாக எச்சரிக்கை {0} {1}

# moderation.modCommands.warning.embedTitle
source: Warning
ta: எச்சரிக்கை

# moderation.modCommands.warning.quickWarned
source: Quick warned via moderate menu {0}
ta: மிதமான பட்டியல் வழியாக விரைவாக எச்சரிக்கப்படுகிறது {0}

# moderation.modCommands.warning.embedStrikeTot
source: Total strikes
ta: மொத்த வேலைநிறுத்தங்கள்

# moderation.modCommands.warning.response
source: Warned a user.
ta: ஒரு பயனரை எச்சரித்தார்.

# moderation.modCommands.warning.embedDescMessage
source: {0} was warned for sending this message.
ta: Mead 0 the இந்த செய்தியை அனுப்பியதற்காக எச்சரிக்கப்பட்டது.

# moderation.modCommands.warning.embedDescDeleted
source: {0} was warned for sending a deleted message.
ta: நீக்கப்பட்ட செய்தியை அனுப்பியதற்காக {0} எச்சரிக்கப்பட்டது.

# moderation.modCommands.warning.log.action3h
source: {0} has been timed-out for 3 hours due to 2 warn strikes
ta: {0} 2 எச்சரிக்கை வேலைநிறுத்தங்கள் காரணமாக 3 மணி நேரம் நேரம் முடக்கப்பட்டுள்ளது

# moderation.modCommands.warning.log.action12h
source: {0} has been timed-out for 12 hours due to 3 warn strikes
ta: {0} 3 எச்சரிக்கை வேலைநிறுத்தங்கள் காரணமாக 12 மணி நேரம் நேரம் முடக்கப்பட்டுள்ளது

# moderation.modCommands.warning.log.action3d
source: {0} has been timed-out for 3 days due to {1} warn strikes It might be time to consider other action.
ta: {0} {1} எச்சரிக்கை வேலைநிறுத்தங்கள் காரணமாக 3 நாட்களுக்கு நேரம் முடிந்துவிட்டது மற்ற செயல்களைக் கருத்தில் கொள்ள வேண்டிய நேரம் இதுவாக இருக்கலாம்.

# moderation.modCommands.warning.log.reason
source: Reason
ta: காரணம்

# moderation.modCommands.removeWarning.name
source: remove-warning
ta: அகற்று-எச்சரிக்கை

# moderation.modCommands.removeWarning.description
source: Removes a user's warnings
ta: பயனரின் எச்சரிக்கைகளை நீக்குகிறது

# moderation.modCommands.removeWarning.unableToFind
source: I was unable to find the member in this guild! Please try again!
ta: இந்த கில்டில் உறுப்பினரைக் கண்டுபிடிக்க முடியவில்லை! மீண்டும் முயற்சிக்கவும்!

# moderation.modCommands.removeWarning.noStrikes
source: This user does not have any warning strikes
ta: இந்த பயனருக்கு எந்த எச்சரிக்கை வேலைநிறுத்தங்களும் இல்லை

# moderation.modCommands.removeWarning.response
source: Removed strike from user
ta: பயனரிடமிருந்து வேலைநிறுத்தம் அகற்றப்பட்டது

# moderation.modCommands.removeWarning.dmTitle
source: Warning strike removal in {0}
ta: {0} இல் எச்சரிக்கை வேலைநிறுத்தம் அகற்றுதல்

# moderation.modCommands.removeWarning.dmDesc
source: You have had a warning strike remove. You now have {0} strikes.
ta: நீங்கள் ஒரு எச்சரிக்கை வேலைநிறுத்தம் நீக்கப்பட்டிருக்கிறீர்கள். உங்களிடம் இப்போது {0} வேலைநிறுத்தங்கள் உள்ளன.

# moderation.modCommands.removeWarning.embedTitle
source: Warning Removal
ta: எச்சரிக்கை அகற்றுதல்

# moderation.modCommands.removeWarning.embedDesc
source: {0} had a warning strike removed by a moderator
ta: {0 a ஒரு மதிப்பீட்டாளரால் எச்சரிக்கை வேலைநிறுத்தம் அகற்றப்பட்டது

# moderation.modUtilities.say.name
source: say
ta: சொல்லுங்கள்

# moderation.modUtilities.say.description
source: Say something through Lily.
ta: லில்லி மூலம் ஏதாவது சொல்லுங்கள்.

# moderation.modUtilities.say.noSendPerms
source: Lily does not have permission to send messages in this channel.
ta: இந்த சேனலில் செய்திகளை அனுப்ப லில்லிக்கு இசைவு இல்லை.

# moderation.modUtilities.say.response
source: Message sent.
ta: செய்தி அனுப்பப்பட்டது.
