Repository: 247i/TACETr
Catalog: உரை/தானி/lilybot-lilybot-translations-*.po
Languages: ta

# utility.utilityEvents.scheduledDeleteDesc
source: An event has been deleted
ta: ஒரு நிகழ்வு நீக்கப்பட்டது

# utility.utilityEvents.scheduledUpdateTitle
source: Scheduled Event Updated!
ta: திட்டமிடப்பட்ட நிகழ்வு புதுப்பிக்கப்பட்டது!

# utility.utilityEvents.scheduledUpdateDesc
source: An event has been updated
ta: ஒரு நிகழ்வு புதுப்பிக்கப்பட்டுள்ளது

# utility.utilityEvents.descriptionChange
source: Description Changed
ta: விளக்கம் மாற்றப்பட்டது

# utility.utilityEvents.locationChange
source: Location Changed
ta: இடம் மாற்றப்பட்டது

# utility.utilityEvents.startChanged
source: Start time changed
ta: தொடக்க நேரம் மாற்றப்பட்டது

# utility.utilityEvents.inviteCreateTitle
source: Invite link created
ta: உருவாக்கப்பட்ட இணைப்பை அழைக்கவும்

# utility.utilityEvents.inviteCreateDesc
source: An invitation has been created
ta: ஒரு அழைப்பு உருவாக்கப்பட்டுள்ளது

# utility.utilityEvents.code
source: Code
ta: குறியீடு

# utility.utilityEvents.targetChannel
source: Target Channel
ta: இலக்கு சேனல்

# utility.utilityEvents.maxUses
source: Max uses
ta: அதிகபட்சம் பயன்படுத்துகிறது

# utility.utilityEvents.duration
source: Duration of Invite
ta: அழைப்பின் காலம்

# utility.utilityEvents.tempMembershipInvite
source: Temporary Membership invite
ta: தற்காலிக உறுப்பினர் அழைப்பு

# utility.utilityEvents.inviteDeleteTitle
source: Invite link deleted
ta: லிங்க் நீக்கப்பட்டதை அழைக்கவும்

# utility.utilityEvents.inviteDeleteDesc
source: An invitation has been deleted
ta: அழைப்பு நீக்கப்பட்டது

# utility.utilityEvents.createdRoleTitle
source: Created a Role
ta: ஒரு பாத்திரத்தை உருவாக்கியது

# utility.utilityEvents.createdRoleDesc
source: A new role has been created
ta: ஒரு புதிய பங்கு உருவாக்கப்பட்டுள்ளது

# utility.utilityEvents.roleName
source: Role name
ta: பங்கு பெயர்

# utility.utilityEvents.roleColor
source: Role Color
ta: பங்கு நிறம்

# utility.utilityEvents.rolePosition
source: Position
ta: நிலை

# utility.utilityEvents.roleDisplaySep
source: Display separately?
ta: தனித்தனியாகக் காண்பி?

# utility.utilityEvents.roleMention
source: Mentionable
ta: குறிப்பிடக்கூடியது

# utility.utilityEvents.roleIcon
source: Icon
ta: படவுரு

# utility.utilityEvents.noRoleIcon
source: No icon
ta: படவுரு இல்லை

# utility.utilityEvents.emoji
source: Emoji
ta: ஈமோசி

# utility.utilityEvents.noEmoji
source: No emoji
ta: ஈமோசி

# utility.utilityEvents.managed
source: Managed by integration?
ta: ஒருங்கிணைப்பால் நிர்வகிக்கப்படுகிறது?

# utility.utilityEvents.permissions
source: Permissions
ta: அனுமதிகள்

# utility.utilityEvents.deletedRoleTitle
source: Role deleted
ta: பங்கு நீக்கப்பட்டது

# utility.utilityEvents.deletedRoleDesc
source: A role has been deleted
ta: ஒரு பங்கு நீக்கப்பட்டுள்ளது

# utility.utilityEvents.unableToName
source: Unable to get name
ta: பெயரைப் பெற முடியவில்லை

# utility.utilityEvents.updatedRoleTitle
source: Updated a Role
ta: ஒரு பாத்திரத்தை புதுப்பித்தது

# utility.utilityEvents.updatedRoleDesc
source: has been updated
ta: புதுப்பிக்கப்பட்டது

# utility.utilityEvents.displaySepChanged
source: Display separately setting changed
ta: தனித்தனியாக அமைப்பு மாற்றப்பட்டது

# utility.utilityEvents.mentionChanged
source: Mentionable setting changed
ta: குறிப்பிடக்கூடிய அமைப்பு மாற்றப்பட்டது

# utility.utilityEvents.iconChanged
source: Icon changed
ta: படவுரு மாற்றப்பட்டது

# utility.utilityEvents.emojiChanged
source: Emoji changed
ta: ஈமோசி மாறியது

# utility.utilityEvents.permissionsChanged
source: Permissions changed
ta: அனுமதிகள் மாற்றப்பட்டன

# utility.utilityEvents.oldColor
source: Old Color
ta: பழைய நிறம்

# utility.utilityEvents.newColor
source: New Color
ta: புதிய நிறம்

# utility.utilityEvents.parentChannel
source: Parent Channel
ta: பெற்றோர் சேனல்

# utility.utilityEvents.archiveDuration
source: Archive duration
ta: காப்பக காலம்

# utility.utilityEvents.appliedTags
source: Applied tags
ta: பயன்படுத்தப்பட்ட குறிச்சொற்கள்

# utility.utilityEvents.channel.category
source: Category
ta: வகை

# utility.utilityEvents.channel.announcement
source: Announcement Channel
ta: அறிவிப்பு சேனல்

# utility.utilityEvents.channel.forum
source: Forum Channel
ta: மன்ற சேனல்

# utility.utilityEvents.channel.stage
source: Stage Channel
ta: மேடை சேனல்

# utility.utilityEvents.channel.text
source: Text Channel
ta: உரை சேனல்

# utility.utilityEvents.channel.voice
source: Voice Channel
ta: குரல் சேனல்

# utility.utilityEvents.channel.thread
source: Thread
ta: நூல்

# utility.utilityEvents.channel.privateThread
source: Private Thread
ta: தனிப்பட்ட நூல்

# utility.utilityEvents.name
source: Name
ta: பெயர்

# utility.utilityEvents.moderated
source: Moderated
ta: மிதமான

# utility.utilityEvents.eventName
source: Event Name
ta: நிகழ்வு பெயர்

# utility.utilityEvents.eventDesc
source: Event Description
ta: நிகழ்வு விளக்கம்

# utility.utilityEvents.eventDescNone
source: No description provided
ta: எந்த விளக்கமும் வழங்கப்படவில்லை

# utility.utilityEvents.eventLocation
source: Event location
ta: நிகழ்வு இடம்

# utility.utilityEvents.externalChannel
source: External event, no channel.
ta: வெளிப்புற நிகழ்வு, சேனல் இல்லை.

# utility.utilityEvents.startTime
source: Start time
ta: தொடக்க நேரம்

# utility.utilityEvents.noImage
source: No image
ta: படம் இல்லை

# utils.generateBulkDelete.message
source: Message
ta: செய்தி

# utils.generateBulkDelete.total
source: Total
ta: மொத்தம்

# utils.dmField.userNotif
source: User Notification:
ta: பயனர் அறிவிப்பு:

# utils.dmField.success
source: User notified with direct message
ta: பயனர் நேரடி செய்தியுடன் அறிவிக்கப்பட்டார்

# utils.dmField.disabled
source: DM Notification Disabled
ta: டி.எம் அறிவிப்பு முடக்கப்பட்டுள்ளது

# utils.dmField.failure
source: Failed to notify user with direct message
ta: நேரடி செய்தியுடன் பயனருக்கு அறிவிப்பதில் தோல்வி

# utils.attachments.attachments
source: Attachments
ta: இணைப்புகள்

# utils.attachments.systemMember
source: System Member:
ta: கணினி உறுப்பினர்:

# utils.attachments.account
source: Account
ta: கணக்கு

# utils.attachments.unableToAccount
source: Unable to get account
ta: கணக்கு பெற முடியவில்லை

# utils.attachments.authorId
source: Author ID:
ta: ஆசிரியர் ஐடி:
