Repository: 247i/TACETr
Catalog: உரை/தானி/linagora-linshare-mobile-*.po
Languages: ta

source: Expiration
ta: காலாவதி

# shared_with
source: {nbContacts,plural, =0{Shared with: {nbContacts} contact}=1{Shared with: {nbContacts} contact}other{Shared with: {nbContacts} contacts}}
ta: {nbcontacts, பன்மை, = 0 {இதனுடன் பகிர்ந்து கொள்ளப்பட்டது: {nbContacts} தொடர்பு} = 1 {இதனுடன் பகிரப்பட்டது: {nbContacts} தொடர்பு} பிற {பகிரப்பட்டது: {nbContacts} தொடர்புகள்}}

source: Modified by
ta: மாற்றியமைக்கப்பட்டது

source: Biometric authentication
ta: பயோமெட்ரிக் ஏற்பு

source: Face ID
ta: முக ஐடி

source: Fingerprint
ta: கைரேகை

# biometric_authentication_message
source: Allow {biometricKind} to secure access to this app
ta: இந்த பயன்பாட்டிற்கான அணுகலைப் பாதுகாக்க {biometricKind} அனுமதிக்கவும்

# biometric_authentication_not_enrolled
source: {biometricKind} must be enabled to turn on biometric authentication
ta: {biometricKind} பயோமெட்ரிக் அங்கீகாரத்தை இயக்க இயக்கப்பட வேண்டும்

# biometric_authentication_localized_reason_enable
source: Please authenticate to enable biometric authentication for application
ta: பயன்பாட்டிற்கான பயோமெட்ரிக் அங்கீகாரத்தை இயக்க தயவுசெய்து அங்கீகரிக்கவும்

# biometric_authentication_localized_reason_disable
source: Please authenticate to disable biometric authentication for application
ta: பயன்பாட்டிற்கான பயோமெட்ரிக் அங்கீகாரத்தை முடக்க தயவுசெய்து அங்கீகரிக்கவும்

source: Manage version
ta: பதிப்பை நிர்வகிக்கவும்

# version
source: Version {version}
ta: பதிப்பு {version}

source: Face
ta: முகம்

source: TouchID
ta: டச்ஐடி

source: TouchID or FaceID
ta: டச்ஐடி அல்லது ஃபேச்ஐடி

source: Fingerprint or Face
ta: கைரேகை அல்லது முகம்

# biometric_authentication_localized_reason
source: Scan your {biometricKind} to authentication
ta: அங்கீகாரத்திற்கு உங்கள் {biometricKind} ஐ ச்கேன் செய்யுங்கள்

# biometric_disabled_in_setting_app
source: Please enable {biometricKind} in the Settings app on your phone to use biometric authentication
ta: பயோமெட்ரிக் அங்கீகாரத்தைப் பயன்படுத்த உங்கள் தொலைபேசியில் உள்ள அமைப்புகள் பயன்பாட்டில் {biometricKind} ஐ இயக்கவும்

# open_with_biometric
source: Open with {biometricKind}
ta: {பயோமெட்ரிகிண்ட் with உடன் திறக்கவும்

source: Or
ta: அல்லது

source: Go to Sign-In
ta: உள்நுழைவுக்குச் செல்லுங்கள்

# biometric_authentication_is_locked
source: Biometric authentication is locked due to exceeded number of attempts.
ta: முயற்சிகளின் எண்ணிக்கையை மீறுவதால் பயோமெட்ரிக் ஏற்பு பூட்டப்பட்டுள்ளது.

source: Duplicate
ta: நகல்

source: Files have been successfully duplicated
ta: கோப்புகள் வெற்றிகரமாக நகல் செய்யப்பட்டுள்ளன

# files_could_not_be_duplicated
source: The files could not be duplicated
ta: கோப்புகளை நகலெடுக்க முடியவில்லை

source: Some files could not be duplicated
ta: சில கோப்புகளை நகலெடுக்க முடியவில்லை

source: Restore
ta: மீட்டமை

source: Available offline
ta: ஆஃப்லைனில் கிடைக்கிறது

# files_will_be_made_available_for_offline_use
source: The files will be made available for offline use.
ta: கோப்புகள் இணைப்பில்லாத பயன்பாட்டிற்கு கிடைக்கும்.

# files_will_no_longer_be_usable_without_be_network
source: The files will no longer be usable without the network.
ta: பிணையம் இல்லாமல் கோப்புகள் இனி பயன்படுத்தப்படாது.

# file_cannot_be_switched_to_offline_mode
source: This file cannot be switched to offline mode
ta: இந்த கோப்பை இணைப்பில்லாத பயன்முறைக்கு மாற்ற முடியாது

# login_sso_button
source: Login with SSO
ta: ஒருகைஉள் உடன் உள்நுழைக

# login_sso_failed
source: Login failed
ta: உள்நுழைவு தோல்வியடைந்தது

source: Upload Requests
ta: கோரிக்கைகளை பதிவேற்றவும்

source: Pending
ta: நிலுவையில் உள்ளது

source: Active / Closed
ta: செயலில் / மூடியது

source: Archived
ta: காப்பகப்படுத்தப்பட்டது

source: Create upload requests here
ta: பதிவேற்ற கோரிக்கைகளை இங்கே உருவாக்கவும்

source: Activated {date}
ta: செயல்படுத்தப்பட்ட {date}

source: Archived {date}
ta: காப்பகப்படுத்தப்பட்ட {date}

source: Active
ta: செயலில்

source: Expired / Closed
ta: காலாவதியான / மூடப்பட்டது

source: Add new upload request
ta: புதிய பதிவேற்ற கோரிக்கையைச் சேர்க்கவும்

source: Collective Upload
ta: கூட்டு பதிவேற்றும்

source: Individual Upload
ta: தனிப்பட்ட பதிவேற்றும்

# create_collective_upload_request_title
source: Collective Upload
ta: கூட்டு பதிவேற்றம்

# create_individual_upload_request_title
source: Individual Upload
ta: தனிப்பட்ட பதிவேற்றம்

# create_upload_request_button
source: Create Upload Request
ta: பதிவேற்ற கோரிக்கையை உருவாக்கவும்

source: Email subject
ta: மின்னஞ்சல் பொருள்

source: Email message
ta: மின்னஞ்சல் செய்தி

source: Settings
ta: அமைப்புகள்

source: Advanced options
ta: மேம்பட்ட விருப்பங்கள்

source: Show less
ta: குறைவாகக் காட்டு

source: Activation date
ta: செயல்படுத்தும் தேதி

source: Expiration date
ta: காலாவதி தேதி

source: Reminder date
ta: நினைவூட்டல் தேதி

source: Max number of files
ta: கோப்புகளின் அதிகபட்ச எண்ணிக்கை

source: Max size of a file
ta: ஒரு கோப்பின் அதிகபட்ச அளவு

source: Allow deletion
ta: நீக்க அனுமதிக்கவும்

source: Allow closure
ta: மூடலை அனுமதிக்கவும்

source: Notification Language
ta: அறிவிப்பு மொழி

# max_number_files_error
source: Max number of files must be set and smaller than 1000
ta: கோப்புகளின் அதிகபட்ச எண்ணிக்கை 1000 ஐ விட சிறியதாக இருக்க வேண்டும்

# max_file_size_error
source: Max size of a file must be set and smaller than 100 GB
ta: ஒரு கோப்பின் அதிகபட்ச அளவு அமைக்கப்பட வேண்டும் மற்றும் 100 சிபி விட சிறியதாக இருக்க வேண்டும்

# upload_requests_root_back_title
source: Back to Upload Requests
ta: கோரிக்கைகளை பதிவேற்றவும்

# upload_requests_no_files_uploaded
source: No files uploaded yet
ta: கோப்புகள் இதுவரை பதிவேற்றப்படவில்லை

source: Status
ta: நிலை

source: Type
ta: வகை

source: Search in Upload Request Groups
ta: பதிவேற்ற கோரிக்கை குழுக்களில் தேடுங்கள்

source: Total size of files
ta: கோப்புகளின் மொத்த அளவு

source: Password protected
ta: கடவுச்சொல் பாதுகாக்கப்பட்டது

# total_file_size_error
source: Total size of files must be set and smaller than 100 GB
ta: கோப்புகளின் மொத்த அளவு நிர்ணயிக்கப்பட வேண்டும் மற்றும் 100 சிபி விட சிறியதாக இருக்க வேண்டும்

source: Add
ta: கூட்டு

# confirm_add_recipients_title
source: You are about to add a recipient to this upload request ! Beware, this action cannot be undone
ta: இந்த பதிவேற்ற கோரிக்கைக்கு நீங்கள் ஒரு பெறுநரைச் சேர்க்கப் போகிறீர்கள்! கவனமாக, இந்த செயலை செயல்தவிர்க்க முடியாது

source: Recipients have been successfully added
ta: பெறுநர்கள் வெற்றிகரமாக சேர்க்கப்பட்டுள்ளனர்

# confirm_cancel_multiple_upload_request
source: {numberOfItems,plural, =1{Are you sure you want to cancel "{singleItemName}"?}other{Are you sure you want to cancel {numberOfItems} items?}}
ta: {numberofitems, பன்மை, = 1 {நீங்கள் நிச்சயமாக "{singleItemName}" ரத்து செய்ய விரும்புகிறீர்களா?

# upload_request_proceed_button
source: Proceed
ta: தொடரவும்

source: Upload request has been updated
ta: பதிவேற்ற கோரிக்கை புதுப்பிக்கப்பட்டுள்ளது

source: Some upload requests have been updated
ta: சில பதிவேற்ற கோரிக்கைகள் புதுப்பிக்கப்பட்டுள்ளன

source: Upload request could not be updated
ta: பதிவேற்ற கோரிக்கையை புதுப்பிக்க முடியவில்லை

source: Some upload requests could not be updated
ta: சில பதிவேற்ற கோரிக்கைகளை புதுப்பிக்க முடியவில்லை

source: Archive
ta: காப்பகம்

# confirm_archive_multiple_upload_request
source: {numberOfItems,plural, =1{Are you sure you want to archive "{singleItemName}"?}other{Are you sure you want to archive {numberOfItems} items?}}
ta: {numberofitems, பன்மை, = 1 {நீங்கள் நிச்சயமாக காப்பகப்படுத்த விரும்புகிறீர்களா?

# copy_before_archiving
source: Copy all files to my personal space before archiving
ta: காப்பகப்படுத்துவதற்கு முன் எல்லா கோப்புகளையும் எனது தனிப்பட்ட இடத்திற்கு நகலெடுக்கவும்

source: Close
ta: மூடு

# confirm_close_multiple_upload_request
source: {numberOfItems,plural, =1{Are you sure you want to close "{singleItemName}"?}other{Are you sure you want to close {numberOfItems} items?}}
ta: {numberofitems, பன்மை, = 1 {நீங்கள் நிச்சயமாக "{singleItemName}"

# search_in_upload_request_entries
source: Search in Upload Requests Entries
ta: பதிவேற்ற கோரிக்கைகள் உள்ளீடுகளில் தேடுங்கள்

# biometric_timeout_title
source: Set timeout
ta: நேரம் முடிந்தது

# biometric_timeout_second
source: {numberOfItems,plural, =1{{numberOfItems} second}other{{numberOfItems} seconds}}
ta: {numberofitems, பன்மை, = 1 {{numberOfItems} இரண்டாவது} பிற {{numberOfItems} விநாடிகள்}}

# biometric_timeout_minute
source: {numberOfItems,plural, =1{{numberOfItems} minute}other{{numberOfItems} minutes}}
ta: {numberofitems, பன்மை, = 1 {{numberOfItems} நிமிடம்} பிற {{numberOfItems} நிமிடங்கள்}}

# biometric_timeout_hour
source: {numberOfItems,plural, =1{{numberOfItems} hour}other{{numberOfItems} hours}}
ta: {numberofitems, பன்மை, = 1 {{numberOfItems} மணிநேரம்} பிற {{numberOfItems} மணிநேரம்}}

# search_in
source: Search in {node}
ta: {முனை in இல் தேடுங்கள்

source: Move
ta: நகர்த்தவும்

source: Move here
ta: இங்கே நகர்த்தவும்

source: Versioning enable
ta: பதிப்பு இயக்கு

# are_you_sure_want_to_remove_this_version
source: Are you sure want to remove this version? Beware, this action cannot be undone.
ta: இந்த பதிப்பை அகற்ற விரும்புகிறீர்களா? கவனமாக, இந்த செயலை செயல்தவிர்க்க முடியாது.

# advance_search_setting
source: Advanced search settings
ta: மேம்பட்ட தேடல் அமைப்புகள்

# advance_search_type_document
source: Document
ta: ஆவணம்

# advance_search_type_pdf
source: PDF
ta: பி.டி.எஃப்

# advance_search_type_spreadsheet
source: Spreadsheet
ta: விரிவுத்தாள்

# advance_search_type_image
source: Image
ta: படம்

# advance_search_type_audio
source: Audio
ta: ஆடியோ

# advance_search_type_archive
source: Archive
ta: காப்பகம்

# advance_search_type_other
source: Other
ta: மற்றொன்று

# advance_search_date_any_time
source: Any time
ta: எந்த நேரத்திலும்

# advance_search_date_past_day
source: Past day
ta: கடந்த நாள்

# advance_search_date_past_week
source: Past week
ta: கடந்த வாரம்

# advance_search_date_past_month
source: Past month
ta: கடந்த மாதம்

# advance_search_date_past_year
source: Past year
ta: கடந்த ஆண்டு

# advance_search_button_reset
source: Reset
ta: மீட்டமை

# advance_search_button_apply
source: Apply
ta: இடு

# this_feature_not_supported
source: This feature is not currently supported
ta: இந்த நற்பொருத்தம் தற்போது ஆதரிக்கப்படவில்லை

source: Edit
ta: தொகு

source: Save
ta: சேமி

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: The upload request has been updated successfully!
ta: பதிவேற்ற கோரிக்கை வெற்றிகரமாக புதுப்பிக்கப்பட்டுள்ளது!

source: The upload request has been updated failed
ta: பதிவேற்ற கோரிக்கை தோல்வியுற்றது

source: Drive
ta: ஓட்டு

source: Loading
ta: ஏற்றுகிறது

source: Canceled
ta: ரத்து செய்யப்பட்டது

source: Back
ta: பின்

# login_message_center
source: Join +10000 active users using LinShare to store and share files with ease
ta: கோப்புகளை எளிதாக சேமித்து பகிர லின்சேரைப் பயன்படுத்தி +10000 செயலில் உள்ள பயனர்களுடன் சேரவும்

# login_message_bottom
source: By default you connect to Linagora servers. If you are not sure about this setting, please contact your technical specialist.
ta: இயல்பாக நீங்கள் லினகோரா சேவையகங்களுடன் இணைக்கிறீர்கள். இந்த அமைப்பைப் பற்றி உங்களுக்குத் தெரியாவிட்டால், தயவுசெய்து உங்கள் தொழில்நுட்ப நிபுணரைத் தொடர்பு கொள்ளவும்.

source: Create an account
ta: ஒரு கணக்கை உருவாக்கவும்

# login_user_own_server_message_center
source: Before you can proceed, please choose a default server connection
ta: நீங்கள் தொடர முன், தயவுசெய்து a ஐத் தேர்வுசெய்க இயல்புநிலை சேவையக இணைப்பு

# checkbox_text_login_with_sso
source: My server is using a single sign-on(SSO)
ta: எனது சேவையகம் ஒற்றை உள்நுழைவைப் பயன்படுத்துகிறது (SSO)

# login_email_title
source: Email
ta: மின்னஞ்சல்

# login_password_title
source: Password
ta: கடவுச்சொல்

# hint_input_password_login
source: Enter your password
ta: உங்கள் கடவுச்சொல்லை உள்ளிடவும்

# hint_input_email_login
source: Enter your email
ta: உங்கள் மின்னஞ்சலை உள்ளிடவும்

source: Email is required
ta: மின்னஞ்சல் தேவை

source: Password is required
ta: கடவுச்சொல் தேவை

source: URL is invalid
ta: முகவரி தவறானது

source: Email is invalid
ta: மின்னஞ்சல் தவறானது

source: Password is invalid
ta: கடவுச்சொல் தவறானது

source: Use your own server
ta: உங்கள் சொந்த சேவையகத்தைப் பயன்படுத்தவும்

source: Create Drive
ta: இயக்ககத்தை உருவாக்கவும்

source: Create Workgroup
ta: பணிக்குழுவை உருவாக்கவும்

source: Create new drive
ta: புதிய இயக்ககத்தை உருவாக்கவும்

source: New drive
ta: புதிய இயக்கி

source: Add a member
ta: ஒரு உறுப்பினரைச் சேர்க்கவும்

source: Add team members with roles
ta: பாத்திரங்களுடன் குழு உறுப்பினர்களைச் சேர்க்கவும்

source: Role in this drive
ta: இந்த இயக்ககத்தில் பங்கு

source: Default role in workgroups
ta: பணிக்குழுக்களில் இயல்புநிலை பங்கு

# member_default_role_of_all_workgroups_inside_this_drive
source: Member's default role of all workgroups inside this drive
ta: இந்த இயக்ககத்திற்குள் உள்ள அனைத்து பணிக்குழுக்களின் உறுப்பினரின் இயல்புநிலை பங்கு

source: Drive Admin
ta: இயக்கி நிர்வாகி

source: Drive Reader
ta: இயக்க வாசகர்

source: Drive Writer
ta: இயக்கி எழுத்தாளர்

source: Workgroup Admin
ta: பணிக்குழு நிர்வாகி

source: Workgroup Reader
ta: பணிக்குழு வாசகர்

source: Workgroup Writer
ta: பணிக்குழு எழுத்தாளர்

source: Workgroup Contributor
ta: பணிக்குழு பங்களிப்பாளர்

# are_you_sure_you_want_to_delete_drive_member
source: Are you sure you want to delete {memberName} from the drive {driveName} and all related workgroups?
ta: இயக்கி {memberName} மற்றும் அனைத்து தொடர்புடைய பணிக்குழுக்களிலிருந்தும் {உறுப்பினர் பெயரை நீக்க விரும்புகிறீர்களா?

source: Name is required
ta: பெயர் தேவை

source: Surname is required
ta: குடும்பப்பெயர் தேவை

# sign_up_continue
source: Continue
ta: தொடரவும்

# sign_up_send_me_a_password
source: Send me a password
ta: கடவுச்சொல்லை எனக்கு அனுப்புங்கள்

# sign_up_name_title
source: Name
ta: பெயர்

# sign_up_surname_title
source: Surname
ta: குடும்பப்பெயர்

# hint_input_sign_up_name
source: Enter your name
ta: உங்கள் பெயரை உள்ளிடவும்

# hint_input_sign_up_surname
source: Enter your surname
ta: உங்கள் குடும்பப்பெயரை உள்ளிடவும்

# sign_up_completed_title_center
source: Done, check your inbox
ta: முடிந்தது, உங்கள் இன்பாக்சை சரிபார்க்கவும்

# sign_up_completed_message_center
source: A password has been sent to your email {email}, check your email and continue login
ta: உங்கள் மின்னஞ்சல் {email} க்கு கடவுச்சொல் அனுப்பப்பட்டுள்ளது, உங்கள் மின்னஞ்சலை சரிபார்க்கவும் உள்நுழைவைத் தொடரவும்

source: Email is not available
ta: மின்னஞ்சல் கிடைக்கவில்லை

source: Drive member
ta: இயக்கி உறுப்பினர்

source: External member
ta: வெளி உறுப்பினர்

source: Files
ta: கோப்புகள்

source: Recipient
ta: பெறுநர்

source: Recipients
ta: பெறுநர்கள்

source: Meta-data
ta: மெட்டா-தரவு

# number_of_uploaded_files
source: {count} file uploaded
ta: {count} கோப்பு பதிவேற்றப்பட்டது

# upload_request_group_modification_date
source: Updated at {date}
ta: {date} இல் புதுப்பிக்கப்பட்டது

source: Owner
ta: உரிமையாளர்

source: View
ta: பார்வை

source: Created at
ta: உருவாக்கப்பட்டது

source: Activated at
ta: AT இல் செயல்படுத்தப்பட்டது

source: Collective
ta: கூட்டு

source: Max total file size
ta: அதிகபட்ச மொத்த கோப்பு அளவு

source: Max size per file
ta: ஒரு கோப்பிற்கு அதிகபட்ச அளவு

# notification_language_meta_data
source: Notification language
ta: அறிவிப்பு மொழி

source: Override this role for all existing workgroups
ta: தற்போதுள்ள அனைத்து பணிக்குழுக்களுக்கும் இந்த பாத்திரத்தை மீறவும்

source: Update
ta: புதுப்பிப்பு

source: Edit default workgroup role
ta: இயல்புநிலை பணிக்குழு பாத்திரத்தைத் திருத்தவும்

source: Files uploaded
ta: கோப்புகள் பதிவேற்றப்பட்டன

# audit_action_message_create_upload_request_recipient
source: Upload request has been created
ta: பதிவேற்ற கோரிக்கை உருவாக்கப்பட்டது

# audit_action_message_create_upload_request_url
source: An upload request email has been sent to: {contactEmail}
ta: பதிவேற்ற கோரிக்கை மின்னஞ்சல் இதற்கு அனுப்பப்பட்டுள்ளது: {contactEmail}

# audit_action_message_update_upload_request_recipient
source: Upload request has been updated.
ta: பதிவேற்ற கோரிக்கை புதுப்பிக்கப்பட்டுள்ளது.

source: Notification date
ta: அறிவிப்பு தேதி

# audit_action_message_create_upload_request_entry
source: File {resourceName} has been uploaded.
ta: கோப்பு {resourceName} பதிவேற்றப்பட்டுள்ளது.

# audit_action_message_download_upload_request_entry_self
source: You have downloaded the file: {resourceName}.
ta: நீங்கள் கோப்பை பதிவிறக்கம் செய்துள்ளீர்கள்: {resourceName}.

# audit_action_message_download_upload_request_entry_other
source: {authorName} has downloaded the file: {resourceName}.
ta: {authorName} கோப்பை பதிவிறக்கம் செய்துள்ளது: {resourceName}.

source: File type
ta: கோப்பு வகை

source: Check all
ta: அனைத்தையும் சரிபார்க்கவும்

source: New workspace
ta: புதிய பணியிடம்

source: Workspace
ta: பணியிடம்

source: Create new workspace
ta: புதிய பணியிடத்தை உருவாக்கவும்

source: Create Workspace
ta: பணியிடத்தை உருவாக்கவும்

source: Role in this workspace
ta: இந்த பணியிடத்தில் பங்கு

# member_default_role_of_all_workgroups_inside_this_workspace
source: Member's default role of all workgroups inside this workspace
ta: இந்த பணியிடத்திற்குள் உள்ள அனைத்து பணிக்குழுக்களின் உறுப்பினரின் இயல்புநிலை பங்கு

# are_you_sure_you_want_to_delete_work_space_member
source: Are you sure you want to delete {memberName} from the workspace {workspaceName} and all related workgroups?
ta: பணியிட {memberName} மற்றும் அனைத்து தொடர்புடைய அனைத்து பணிக்குழுக்களிலிருந்தும் {உறுப்பினர் பெயர் bed நீக்க விரும்புகிறீர்களா?

source: Workspace Admin
ta: பணியிட நிர்வாகி

source: Workspace Reader
ta: பணியிட வாசகர்

source: Workspace Writer
ta: பணியிட எழுத்தாளர்

source: Sign up Failed
ta: பதிவுபெறு தோல்வியுற்றது

# sign_up_message_failed
source: Unfortunately, something went wrong during your signup.
ta: துரதிர்ச்டவசமாக, ஏதோ தவறு நடந்தது உங்கள் பதிவு.

source: Sign up again
ta: மீண்டும் பதிவு செய்க

source: Contact technical support
ta: தொழில்நுட்ப ஆதரவைத் தொடர்பு கொள்ளுங்கள்

# contact_technical_support_failed
source: Support team is out of reach try again later
ta: உதவி குழு பின்னர் மீண்டும் முயற்சிக்கவில்லை

# title_feedback_dialog
source: LinShare
ta: லின்சேர்

# feedback_dialog_button
source: Please, share your feedback
ta: தயவுசெய்து, உங்கள் கருத்தைப் பகிர்ந்து கொள்ளுங்கள்

# message_feedback_dialog
source: We are running Linshare SaaS. We are working hard to fix all the bugs that impact user experience. We rely on your valuable feedback to make Linshare better for everyone.
ta: நாங்கள் லின்சேர் சாசை இயக்குகிறோம். பயனர் அனுபவத்தை பாதிக்கும் அனைத்து பிழைகளையும் சரிசெய்ய நாங்கள் கடுமையாக உழைக்கிறோம். லின்சேரை அனைவருக்கும் சிறப்பானதாக்க உங்கள் மதிப்புமிக்க கருத்துக்களை நாங்கள் நம்புகிறோம்.

source: Failed request
ta: தோல்வியுற்ற கோரிக்கை

# reach_workspace_limit_message
source: You have reached maximum number of upload requests. Please contact your company owner to upgrade plan first
ta: பதிவேற்ற கோரிக்கைகளின் அதிகபட்ச எண்ணிக்கையை நீங்கள் அடைந்துவிட்டீர்கள். முதலில் திட்டத்தை மேம்படுத்த உங்கள் நிறுவன உரிமையாளரைத் தொடர்பு கொள்ளவும்

source: Contact Now
ta: இப்போது தொடர்பு கொள்ளுங்கள்

# reach_workspace_limit_message_own_server
source: You have reached maximum number of workspaces
ta: நீங்கள் அதிகபட்ச பணியிடங்களை அடைந்துவிட்டீர்கள்

# reach_nested_workgroup_limit_message_saas
source: You have reached maximum number of workgroups in this workspace. Please contact your company owner to upgrade plan first
ta: இந்த பணியிடத்தில் அதிகபட்சமாக பணிக்குழுக்களை எட்டியுள்ளீர்கள். முதலில் திட்டத்தை மேம்படுத்த உங்கள் நிறுவன உரிமையாளரைத் தொடர்பு கொள்ளவும்

# reach_nested_workgroup_limit_message_own_server
source: You have reached maximum number of workgroups in this workspace
ta: இந்த பணியிடத்தில் அதிகபட்சமாக பணிக்குழுக்களை அடைந்துவிட்டீர்கள்

# reach_upload_request_limit_message_saas
source: You have reached maximum number of upload requests. Please contact your company owner to upgrade plan first
ta: பதிவேற்ற கோரிக்கைகளின் அதிகபட்ச எண்ணிக்கையை நீங்கள் அடைந்துவிட்டீர்கள். முதலில் திட்டத்தை மேம்படுத்த உங்கள் நிறுவன உரிமையாளரைத் தொடர்பு கொள்ளவும்

# reach_upload_request_limit_message_own_server
source: You have reached maximum number of upload requests
ta: பதிவேற்ற கோரிக்கைகளின் அதிகபட்ச எண்ணிக்கையை நீங்கள் அடைந்துவிட்டீர்கள்
