Repository: 247i/TACETr
Catalog: உரை/தானி/linagora-twake-console-web-*.po
Languages: ta

source: About the company
ta: நிறுவனம் பற்றி

source: Accept
ta: ஏற்றுக்கொள்

# ACCOUNT_ACTIVATED
source: Your account has successfully been activated
ta: உங்கள் கணக்கு வெற்றிகரமாக செயல்படுத்தப்பட்டுள்ளது

source: Action
ta: செயல்

source: Actions
ta: செயல்கள்

source: Activate
ta: செயல்படுத்து

source: Activate account
ta: கணக்கைச் செயல்படுத்தவும்

# ACTIVATE_CONFIRM_MESSAGE
source: Are you sure to activate
ta: நீங்கள் செயல்படுத்துவது உறுதி

source: Activate user
ta: பயனரை செயல்படுத்தவும்

source: Activate your account
ta: உங்கள் கணக்கை செயல்படுத்தவும்

# ACTIVATION_LINK_EXPIRED_INSTRUCTION
source: This activation link has been expired or already been used. Please sign in to re-activate your account.
ta: இந்த செயல்படுத்தும் இணைப்பு காலாவதியானது அல்லது ஏற்கனவே பயன்படுத்தப்பட்டுள்ளது. உங்கள் கணக்கை மீண்டும் செயல்படுத்த உள்நுழைக.

source: Active
ta: செயலில்

# ACTIVE_ACCOUNT_INSTRUCTION
source: An email with verification link has been sent to {0}. Please check your email and activate your account before {1}. Beyond that, the verification link will expire and your account will be blocked.
ta: சரிபார்ப்பு இணைப்பைக் கொண்ட மின்னஞ்சல் {0 க்கு க்கு அனுப்பப்பட்டுள்ளது. தயவுசெய்து உங்கள் மின்னஞ்சலைச் சரிபார்த்து {1 be க்கு முன் உங்கள் கணக்கை செயல்படுத்தவும். அதையும் மீறி, சரிபார்ப்பு இணைப்பு காலாவதியாகும், மேலும் உங்கள் கணக்கு தடுக்கப்படும்.

source: Active subscriptions
ta: செயலில் உள்ள சந்தாக்கள்

source: Add
ta: கூட்டு

source: Address
ta: முகவரி

source: Add a promo coupon
ta: ஒரு விளம்பர கூப்பனைச் சேர்க்கவும்

# ADD_COMPANY_USER_FAILED
source: Unable to add company user
ta: நிறுவன பயனரைச் சேர்க்க முடியவில்லை

source: Add new card
ta: புதிய அட்டையைச் சேர்க்கவும்

# ADD_NEW_CARD_VALIDATE_DESCRIPTION
source: Once you add your card details, we will validate it by deducting 1.00 EUR from your account with immediate refund.
ta: உங்கள் அட்டை விவரங்களைச் சேர்த்தவுடன், உடனடி பணத்தைத் திரும்பப் பெறுவதன் மூலம் உங்கள் கணக்கிலிருந்து 1.00 யூரோவைக் கழிப்பதன் மூலம் அதை சரிபார்க்கிறோம்.

source: Add new member
ta: புதிய உறுப்பினரைச் சேர்க்கவும்

source: Add payment card
ta: கட்டண அட்டையைச் சேர்க்கவும்

# ADD_PAYMENT_CARD_SUCCESSFULLY
source: Add a payment method successfully
ta: கட்டண முறையை வெற்றிகரமாகச் சேர்க்கவும்

source: Add Payment Info
ta: கட்டண தகவலைச் சேர்க்கவும்

source: Admin Panel
ta: நிர்வாக குழு

source: All time
ta: எல்லா நேரமும்

source: Already have an account?
ta: ஏற்கனவே ஒரு கணக்கு இருக்கிறதா?

source: Amount
ta: தொகை

source: Amount due
ta: செலுத்த வேண்டிய தொகை

source: Annually
ta: ஆண்டுதோறும்

source: Application
ta: பயன்பாடு

source: Applications
ta: பயன்பாடுகள்

source: Apply
ta: இடு

source: Are you sure?
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா?

source: Assign applications successful
ta: விண்ணப்பங்களை வெற்றிகரமாக ஒதுக்குங்கள்

# ASSIGN_COMPANY_MEMBERS_FAILED_MESSAGE
source: Failed to assign company members
ta: நிறுவன உறுப்பினர்களை ஒதுக்கத் தவறிவிட்டது

source: Assign members
ta: உறுப்பினர்களை நியமிக்கவும்

# ASSIGN_MEMBERS_SUBTITLE
source: Assign them to your products to access and collaborate with your team.
ta: உங்கள் குழுவுடன் அணுகவும் ஒத்துழைக்கவும் அவற்றை உங்கள் தயாரிப்புகளுக்கு ஒதுக்குங்கள்.

source: Attention!
ta: கவனம்!

# AT_LEAST_ONE_EMAIL_REQUIRED
source: At least one email is required.
ta: குறைந்தது ஒரு மின்னஞ்சல் தேவை.

source: Back
ta: பின்

source: Billing
ta: பட்டியலிடல்

source: Billing period
ta: பட்டியலிடல் காலம்

source: Browse file
ta: கோப்பு உலாவுக

source: Business
ta: வணிகம்

source: Cancel
ta: ரத்துசெய்

source: Cancel subscription
ta: சந்தாவை ரத்துசெய்

# CANCEL_SUBSCRIPTION_DESCRIPTION
source: Are you sure about downgrading your plan? In the Free plan, you will have limited features.
ta: உங்கள் திட்டத்தை தரமிறக்குவது குறித்து உறுதியாக இருக்கிறீர்களா? இலவச திட்டத்தில், உங்களிடம் வரையறுக்கப்பட்ட நற்பொருத்தங்கள் இருக்கும்.

# CANCEL_SUBSCRIPTION_FAILED
source: Cancelling subscription failed
ta: சந்தா ரத்து செய்வது தோல்வியடைந்தது

# CANCEL_SUBSCRIPTION_FAILURE_MESSAGE
source: You have unpaid bills/invoices, please finish them before canceling the subscription.
ta: உங்களிடம் செலுத்தப்படாத பில்கள்/விலைப்பட்டியல் உள்ளது, சந்தாவை ரத்து செய்வதற்கு முன் அவற்றை முடிக்கவும்.

# CANCEL_SUBSCRIPTION_SUCCESSFULLY
source: Successfully cancelled the subscription
ta: சந்தாவை வெற்றிகரமாக ரத்து செய்தது

source: Cannot update subscription
ta: சந்தாவை புதுப்பிக்க முடியாது

source: Card number
ta: அட்டை எண்

# CARD_VALDIATION_FAILED_DESCRIPTION
source: The card was declined. Try a different payment method or contact the card issuer.
ta: அட்டை மறுக்கப்பட்டது. வேறு கட்டண முறையை முயற்சிக்கவும் அல்லது அட்டை வழங்குபவரைத் தொடர்பு கொள்ளவும்.

source: Card validation failed
ta: அட்டை சரிபார்ப்பு தோல்வியடைந்தது

source: Card validation successful
ta: அட்டை சரிபார்ப்பு வெற்றிகரமாக

# CARD_VALIDATION_SUCCESSFUL_BRIEF_DESCRIPTION
source: Your card is validated.
ta: உங்கள் அட்டை சரிபார்க்கப்பட்டது.

# CARD_VALIDATION_SUCCESSFUL_DESCRIPTION
source: Your card is validated. Please proceed to pay for your subscription
ta: உங்கள் அட்டை சரிபார்க்கப்பட்டது. உங்கள் சந்தாவுக்கு பணம் செலுத்த தொடரவும்

source: Change password
ta: கடவுச்சொல்லை மாற்றவும்

source: Change your time zone
ta: உங்கள் நேர மண்டலத்தை மாற்றவும்

source: Choose an application
ta: பயன்பாட்டைத் தேர்வுசெய்க

# CHOOSE_AN_APPLICATION_DESCRIPTION
source: Select the application you want to add to your company.
ta: உங்கள் நிறுவனத்தில் நீங்கள் சேர்க்க விரும்பும் பயன்பாட்டைத் தேர்ந்தெடுக்கவும்.

source: Choose payment card
ta: கட்டண அட்டையைத் தேர்வுசெய்க

source: Choose your plan
ta: உங்கள் திட்டத்தைத் தேர்வுசெய்க

source: City
ta: நகரம்

source: Close
ta: மூடு

source: Coming soon
ta: விரைவில் வரும்

source: Company
ta: நிறுவனம்

# COMPANY_ADDRESS_IS_REQUIRED
source: Address is required
ta: முகவரி தேவை

# COMPANY_ADDRESS_LENGTH_EXCEED_MAXIMUM_CHARACTERS
source: The address cannot exceed 150 characters
ta: முகவரி 150 எழுத்துக்களை தாண்டக்கூடாது

# COMPANY_BIO_EXCEED_MAXIMUM_CHARACTERS
source: Introduction cannot exceed 200 characters
ta: அறிமுகம் 200 எழுத்துக்களை தாண்டக்கூடாது

# COMPANY_BOX_DESCRIPTION
source: You are not in any company yet. To collaborate with your team, please check the company invitations <a>here</a>, or create a new company.
ta: நீங்கள் இன்னும் எந்த நிறுவனத்திலும் இல்லை. உங்கள் குழுவுடன் ஒத்துழைக்க, தயவுசெய்து நிறுவனத்தின் அழைப்பிதழ்களைச் சரிபார்க்கவும் <a> இங்கே </a> அல்லது ஒரு புதிய நிறுவனத்தை உருவாக்கவும்.

# COMPANY_CITY_IS_REQUIRED
source: City is required
ta: நகரம் தேவை

# COMPANY_CITY_NAME_EXCEED_MAXIMUM_CHARACTERS
source: City cannot exceed 50 characters
ta: நகரம் 50 எழுத்துக்களைத் தாண்ட முடியாது

# COMPANY_COUNTRY_IS_REQUIRED
source: Country is required
ta: நாடு தேவை

source: Company deleted
ta: நிறுவனம் நீக்கப்பட்டது

source: Company info
ta: நிறுவனத்தின் செய்தி

source: Company name
ta: நிறுவனத்தின் பெயர்

# COMPANY_NAME_IS_REQUIRED
source: Name is required
ta: பெயர் தேவை

# COMPANY_PHONE_NUMBER_EXAMPLE
source: e.g. 1 46 96 63 63
ta: எ.கா. 1 பாச் சி ம

# COMPANY_PHONE_NUMBER_IS_REQUIRED
source: Phone number is required
ta: தொலைபேசி எண் தேவை

# COMPANY_POSTCODE_EXCEED_MAXIMUM_CHARACTERS
source: Postcode cannot exceed 15 characters
ta: அஞ்சல் குறியீடு 15 எழுத்துக்களைத் தாண்டக்கூடாது

# COMPANY_POSTCODE_IS_REQUIRED
source: Postcode is required
ta: அஞ்சல் குறியீடு தேவை

# COMPANY_WEBSITE_EXCEED_MAXIMUM_CHARACTERS
source: Website address cannot exceed 100 characters
ta: வலைத்தள முகவரி 100 எழுத்துக்களைத் தாண்டக்கூடாது

# COMPANY_WEBSITE_URL_MUST_BE_IN_FORMAT
source: Please follow the format of http(s)://domain.extension
ta: தயவுசெய்து http (கள்): //domain.extension இன் வடிவமைப்பைப் பின்பற்றவும்

source: Confirm
ta: உறுதிப்படுத்தவும்

source: Confirm password
ta: கடவுச்சொல்லை உறுதிப்படுத்தவும்

# CONSENT_AGREEMENT_WITH_TWO_ITEMS
source: I agree to the {0} and {1}
ta: நான் {0} மற்றும் {1} க்கு ஒப்புக்கொள்கிறேன்

source: Contact sales for pricing
ta: விலை நிர்ணயம் செய்வதற்கான விற்பனையைத் தொடர்பு கொள்ளுங்கள்

source: Contact us
ta: எங்களை தொடர்புகொள்

source: Continue
ta: தொடரவும்

source: Country
ta: நாடு

source: Create
ta: உருவாக்கு

source: Created date
ta: உருவாக்கப்பட்ட தேதி

source: Create company
ta: நிறுவனத்தை உருவாக்கவும்

# CREATE_COMPANY_SUCCESSFULLY_CONGRATS
source: Congratulations!
ta: வாழ்த்துக்கள்!

# CREATE_COMPANY_SUCCESSFULLY_MESSAGE
source: Now you can start managing your members, subscriptions, and company information
ta: இப்போது நீங்கள் உங்கள் உறுப்பினர்கள், சந்தாக்கள் மற்றும் நிறுவன தகவல்களை நிர்வகிக்கத் தொடங்கலாம்

# CREATE_COMPANY_SUCCESSFULLY_TITLE
source: Your company has been created
ta: உங்கள் நிறுவனம் உருவாக்கப்பட்டுள்ளது

# CREATE_FREE_SUBSCRIPTION_SUCCESSFUL_DESCRIPTION
source: Now you can start using the applications to collaborate with your team. Or go to Billing to set up your payment and get unlimited features.
ta: இப்போது நீங்கள் உங்கள் குழுவுடன் ஒத்துழைக்க பயன்பாடுகளைப் பயன்படுத்தத் தொடங்கலாம். அல்லது உங்கள் கட்டணத்தை அமைத்து வரம்பற்ற அம்சங்களைப் பெற பில்லிங்கிற்குச் செல்லுங்கள்.

source: Create member
ta: உறுப்பினரை உருவாக்கு

# CREATE_MEMBER_DESCRIPTION
source: Create member and assign them to your products to access and collaborate with your team.
ta: உங்கள் குழுவுடன் அணுகவும் ஒத்துழைக்கவும் உறுப்பினரை உருவாக்கி அவற்றை உங்கள் தயாரிப்புகளுக்கு ஒதுக்குங்கள்.

source: Create new company
ta: புதிய நிறுவனத்தை உருவாக்கவும்

# CREATE_NEW_COMPANY_DESCRIPTION
source: You are almost done, let's summarize your custom plan once again and start with your new company.
ta: நீங்கள் கிட்டத்தட்ட முடித்துவிட்டீர்கள், உங்கள் தனிப்பயன் திட்டத்தை மீண்டும் ஒரு முறை சுருக்கமாகக் கொண்டு உங்கள் புதிய நிறுவனத்துடன் தொடங்குவோம்.

# CREATE_NEW_COMPANY_FAILED
source: Unable to create a new company
ta: ஒரு புதிய நிறுவனத்தை உருவாக்க முடியவில்லை

source: Create new member
ta: புதிய உறுப்பினரை உருவாக்கவும்

# CREATE_SUBSCRIPTION_SUCCESSFUL_DESCRIPTION
source: Now you can start using the applications to collaborate with your team in a trial version. Or go to Billing to set up your payment and get unlimited features.
ta: இப்போது நீங்கள் ஒரு சோதனை பதிப்பில் உங்கள் குழுவுடன் ஒத்துழைக்க பயன்பாடுகளைப் பயன்படுத்தத் தொடங்கலாம். அல்லது உங்கள் கட்டணத்தை அமைத்து வரம்பற்ற அம்சங்களைப் பெற பில்லிங்கிற்குச் செல்லுங்கள்.

source: Crop
ta: பயிர்

source: Crop image
ta: பயிர் படம்

source: Current amount
ta: தற்போதைய தொகை

source: Current password
ta: தற்போதைய கடவுச்சொல்

source: Current plan
ta: தற்போதைய திட்டம்

source: Customers
ta: வாடிக்கையாளர்கள்

source: Customer detail
ta: வாடிக்கையாளர் விவரம்

# CUSTOM_PLAN_DESCRIPTION
source: Need a custom solution tailored to the needs of your company? Contact sales to get the best terms.
ta: உங்கள் நிறுவனத்தின் தேவைகளுக்கு ஏற்ப தனிப்பயன் தீர்வு வேண்டுமா? சிறந்த விதிமுறைகளைப் பெற விற்பனையைத் தொடர்பு கொள்ளுங்கள்.

# CUSTOM_PLAN_NAME
source: Enterprise
ta: நிறுவனம்

# CUSTOM_PLAN_SUBTITLE
source: Tailored enterprise solution
ta: வடிவமைக்கப்பட்ட நிறுவன தீர்வு

# CUSTOM_PLAN_SUB_TITLE
source: Custom
ta: தனிப்பயன்

source: Custom your plan
ta: உங்கள் திட்டத்தை தனிப்பயனாக்கவும்

# CUSTOM_YOUR_PLAN_DESCRIPTION
source: Custom your plan with lots of features and sizes suitable to your team.
ta: உங்கள் அணிக்கு ஏற்ற நிறைய நற்பொருத்தங்கள் மற்றும் அளவுகளுடன் உங்கள் திட்டத்தை தனிப்பயனாக்கவும்.

source: Data collection consent
ta: தரவு சேகரிப்பு ஒப்புதல்

# DATE
source: Date { date }
ta: தேதி { date }

# DATE_FILTER.CUSTOM_DATE
source: Custom date
ta: தனிப்பயன் தேதி

# DATE_FILTER.LAST_15_DAYS
source: Last 15 days
ta: கடந்த 15 நாட்கள்

# DATE_FILTER.LAST_30_DAYS
source: Last 30 days
ta: கடந்த 30 நாட்கள்

# DATE_FILTER.LAST_QUARTER
source: Last quarter
ta: கடந்த காலாண்டு

# DATE_FILTER.LAST_YEAR
source: Last year
ta: கடந்த ஆண்டு

# DATE_FILTER.TODAY
source: Today
ta: இன்று

source: Deactivate
ta: செயலிழக்கச் செய்யுங்கள்

# DEACTIVATE_CONFIRM_MESSAGE
source: Are you sure to deactivate
ta: செயலிழக்க நீங்கள் உறுதியாக இருக்கிறீர்களா?

source: Deactivate user
ta: பயனரை செயலிழக்கச் செய்யுங்கள்

# DEACTIVATE_USER_FAILED
source: Unable to deactivate user
ta: பயனரை செயலிழக்க முடியவில்லை

# DEACTIVATE_USER_SUCCESSFULLY
source: You have deactivated user {0}
ta: நீங்கள் செயலிழக்கச் செய்துள்ளீர்கள் {0}

source: Default card
ta: இயல்புநிலை அட்டை

source: Delete
ta: நீக்கு

source: Delete account
ta: கணக்கை நீக்கு

# DELETE_ACCOUNT_DESCRIPTION
source: Are you sure you want to delete your account? Your personal data and information will be deleted permanently. This action cannot be undone.
ta: உங்கள் கணக்கை நீக்க விரும்புகிறீர்களா? உங்கள் தனிப்பட்ட தரவு மற்றும் தகவல்கள் நிரந்தரமாக நீக்கப்படும். இந்த செயலை செயல்தவிர்க்க முடியாது.

# DELETE_ACCOUNT_ERROR_MESSAGE
source: You need to delete all the companies that you own before you can delete your account.
ta: உங்கள் கணக்கை நீக்குவதற்கு முன்பு உங்களுக்கு சொந்தமான அனைத்து நிறுவனங்களையும் நீக்க வேண்டும்.

# DELETE_ACCOUNT_ERROR_TITLE
source: Cannot delete account
ta: கணக்கை நீக்க முடியாது

source: Delete company
ta: நிறுவனத்தை நீக்கு

# DELETE_COMPANY_WARNING
source: All of your data will be deleted. To keep data you can transfer company ownership to other members.
ta: உங்கள் தரவு அனைத்தும் நீக்கப்படும். தரவை வைத்திருக்க நீங்கள் நிறுவனத்தின் உரிமையை மற்ற உறுப்பினர்களுக்கு மாற்றலாம்.

# DELETE_CONFIRM_MESSAGE
source: Are you sure you want to delete { name }?
ta: { name } ஐ நீக்க விரும்புகிறீர்களா?

source: Delete file
ta: கோப்பை அழி

# DELETE_INVITATION_SUCCESSFULLY
source: Delete an invitation successfully
ta: அழைப்பை வெற்றிகரமாக நீக்கவும்

# DELETE_MEMBER_SUCCESSFULLY
source: Delete a member successfully
ta: ஒரு உறுப்பினரை வெற்றிகரமாக நீக்கவும்

# DELETING_COMPANY_MESSAGE
source: Your active subscription, workspaces, and channels will be permanently deleted.
ta: உங்கள் செயலில் உள்ள சந்தா, பணியிடங்கள் மற்றும் சேனல்கள் நிரந்தரமாக நீக்கப்படும்.

# DENIED_BY_APPLICATION_MESSAGE
source: { application } does not allow adding these users to the application:
ta: {பயன்பாடு this இந்த பயனர்களை பயன்பாட்டில் சேர்க்க அனுமதிக்காது:

source: Description
ta: விவரம்

source: Details
ta: விவரங்கள்

source: Downgrade plan
ta: தரமிறக்க திட்டம்

# DOWNGRADE_PLAN_CONFLICT_MESSAGE
source: You have already scheduled to downgrade your subscription to {0} on {1}.
ta: உங்கள் சந்தாவை {1 on இல் {0} க்கு தரமிறக்க நீங்கள் ஏற்கனவே திட்டமிட்டுள்ளீர்கள்.

# DOWNGRADE_PLAN_MESSAGE
source: Are you sure you want to change from {0} to {1}? Your new plan will take effect on {2}. Please be aware that this action will lock some features.
ta: நீங்கள் {0} இலிருந்து {1 bo க்கு மாற்ற விரும்புகிறீர்களா? உங்கள் புதிய திட்டம் {2 of இல் நடைமுறைக்கு வரும். இந்த நடவடிக்கை சில அம்சங்களை பூட்டும் என்பதை நினைவில் கொள்க.

source: Downgrade subscription
ta: சந்தா தரமிறக்க

# DO_NOT_NEED_TO_RECOVER_PASSWORD
source: If you don't need to recover your password
ta: உங்கள் கடவுச்சொல்லை மீட்டெடுக்க தேவையில்லை என்றால்

source: Edit
ta: தொகு

source: Edit company
ta: நிறுவனத்தைத் திருத்து

source: Edit company info
ta: நிறுவனத்தின் தகவலைத் திருத்தவும்

source: Edit Payment Info
ta: கட்டணத் தகவலைத் திருத்தவும்

# EDIT_PLAN_QUANTITY_ON_CANCELLATION_WARNING
source: The subscription is in cancellation. If you change the number of paid units, the cancellation status will be terminated and the current plan will be applied in the next period.
ta: சந்தா ரத்து செய்யப்படுகிறது. கட்டண அலகுகளின் எண்ணிக்கையை நீங்கள் மாற்றினால், ரத்துசெய்யும் நிலை நிறுத்தப்பட்டு தற்போதைய திட்டம் அடுத்த காலகட்டத்தில் பயன்படுத்தப்படும்.

source: Edit subscription
ta: சந்தாவைத் திருத்தவும்

source: Edit user
ta: பயனரைத் திருத்து

# EDIT_USER_FAILED
source: Unable to edit user
ta: பயனரைத் திருத்த முடியவில்லை

# EDIT_USER_SUBTITLE
source: Edit member's roles and change their application assignment
ta: உறுப்பினரின் பாத்திரங்களைத் திருத்தி, அவற்றின் விண்ணப்ப ஒதுக்கீட்டை மாற்றவும்

# EDIT_USER_WARNING_MESSAGE
source: Editing this user role is not allowed since {0}'s quota reaches its limit. Please remove the user from the application and try again.
ta: {0} இன் ஒதுக்கீடு அதன் வரம்பை எட்டுவதால் இந்த பயனர் பாத்திரத்தைத் திருத்துவது அனுமதிக்கப்படாது. பயன்பாட்டிலிருந்து பயனரை அகற்றி மீண்டும் முயற்சிக்கவும்.

source: Edit your subscription
ta: உங்கள் சந்தாவைத் திருத்தவும்

source: Email
ta: மின்னஞ்சல்

source: Emails
ta: மின்னஞ்சல்கள்

# EMAIL_ALREADY_IN_USE
source: Email is already in use
ta: மின்னஞ்சல் ஏற்கனவே பயன்பாட்டில் உள்ளது

source: Email has been resent!
ta: மின்னஞ்சல் கோபமாகிவிட்டது!

# EMAIL_INVALID_ERROR_MESSAGE
source: Invalid email address
ta: தவறான மின்னஞ்சல் முகவரி

# EMAIL_INVITATION_COUNTER
source: { count } valid email will be invited | { count } valid emails will be invited
ta: { count } செல்லுபடியாகும் மின்னஞ்சல் அழைக்கப்படும் | { count } செல்லுபடியாகும் மின்னஞ்சல்கள் அழைக்கப்படும்

source: Email is required
ta: மின்னஞ்சல் தேவை

# EMAIL_VERIFICATION_ALREADY_VERIFIED_DESCRIPTION
source: The email address of your account has already been verified. You can now sign in and proceed to use our products.
ta: உங்கள் கணக்கின் மின்னஞ்சல் முகவரி ஏற்கனவே சரிபார்க்கப்பட்டது. நீங்கள் இப்போது உள்நுழைந்து எங்கள் தயாரிப்புகளைப் பயன்படுத்தலாம்.

# EMAIL_VERIFICATION_ALREADY_VERIFIED_TITLE
source: Already verified
ta: ஏற்கனவே சரிபார்க்கப்பட்டது

# EMAIL_VERIFICATION_SUCCESS_TITLE
source: Verification completed
ta: சரிபார்ப்பு முடிந்தது

# EMAIL_VERIFICATION_TOKEN_EXPIRED_TITLE
source: Verification expired
ta: சரிபார்ப்பு காலாவதியானது

# EMAIL_VERIFICATION_UNEXPECTED_ERROR_DESCRIPTION
source: Sorry, an unexpected error occurred, and we could not verify the email address of your account.
ta: மன்னிக்கவும், எதிர்பாராத பிழை ஏற்பட்டது, உங்கள் கணக்கின் மின்னஞ்சல் முகவரியை எங்களால் சரிபார்க்க முடியவில்லை.

# EMAIL_VERIFICATION_UNEXPECTED_ERROR_TITLE
source: Something went wrong
ta: ஏதோ தவறு நடந்தது

# EMAIL_VERIFICATION_USER_NOT_FOUND_DESCRIPTION
source: Your account could not be found within the system. Please sign up first and then proceed to activate your account.
ta: உங்கள் கணக்கை கணினியில் காண முடியவில்லை. தயவுசெய்து முதலில் பதிவுபெறுங்கள், பின்னர் உங்கள் கணக்கை செயல்படுத்த தொடரவும்.

# EMAIL_VERIFICATION_USER_NOT_FOUND_TITLE
source: Account not found
ta: கணக்கு காணப்படவில்லை

source: Enter city
ta: நகரத்தை உள்ளிடவும்

source: Enter company address
ta: நிறுவனத்தின் முகவரியை உள்ளிடவும்

# ENTER_COMPANY_BIO
source: Enter a brief introduction about your company
ta: உங்கள் நிறுவனத்தைப் பற்றி ஒரு சுருக்கமான அறிமுகத்தை உள்ளிடவும்

source: Enter company name
ta: நிறுவனத்தின் பெயரை உள்ளிடவும்

source: Enter company website
ta: நிறுவனத்தின் வலைத்தளத்தை உள்ளிடவும்

source: Enter existing password
ta: இருக்கும் கடவுச்சொல்லை உள்ளிடவும்

source: Enter postcode
ta: அஞ்சல் குறியீட்டை உள்ளிடவும்

source: Enter promo coupon
ta: விளம்பர கூப்பனை உள்ளிடவும்

source: Enter user email
ta: பயனர் மின்னஞ்சலை உள்ளிடவும்

source: Enter user first name
ta: பயனரின் முதல் பெயரை உள்ளிடவும்

source: Enter user last name
ta: பயனர் கடைசி பெயரை உள்ளிடவும்

source: Enter user name or email
ta: பயனர் பெயர் அல்லது மின்னஞ்சலை உள்ளிடவும்

source: Enter your password
ta: உங்கள் கடவுச்சொல்லை உள்ளிடவும்

source: Erase
ta: அழிக்கவும்

# EXAMPLE
source: Ex
ta: முன்னாள்

# EXCEED_ALLOWED_NUMBER_OF_USERS
source: Exceed the allowed number of users
ta: அனுமதிக்கப்பட்ட பயனர்களின் எண்ணிக்கையை மீறுங்கள்

# EXCEED_ALLOWED_NUMBER_OF_USERS_DETAIL
source: You cannot assign more than 50 users at a time.
ta: ஒரு நேரத்தில் 50 க்கும் மேற்பட்ட பயனர்களை நீங்கள் ஒதுக்க முடியாது.

source: Expired
ta: காலாவதியான

source: Expiring
ta: காலாவதியாகும்

source: Explore
ta: ஆராயுங்கள்

# FAILED_TO_CHANGE_LOCALE
source: Unable to change the locale
ta: இருப்பிடத்தை மாற்ற முடியவில்லை

# FAILED_TO_CHARGE_PAYMENT_METHOD
source: Your payment method has insufficient funds to process
ta: உங்கள் கட்டண முறை செயலாக்க போதுமான பொருள் இல்லை

# FAILED_TO_CREATE_IMPORTING_REQUEST
source: Fail to create importing request
ta: இறக்குமதி கோரிக்கையை உருவாக்கத் தவறியது

source: Failed to create subscription
ta: சந்தாவை உருவாக்குவதில் தோல்வி

source: Failed to delete company
ta: நிறுவனத்தை நீக்கத் தவறிவிட்டது

# FAILED_TO_DELETE_INVITATION
source: Failed to delete an invitation
ta: அழைப்பை நீக்குவதில் தோல்வி

# FAILED_TO_DELETE_MEMBER
source: Failed to delete a member
ta: ஒரு உறுப்பினரை நீக்குவதில் தோல்வி

source: Failed to delete your account
ta: உங்கள் கணக்கை நீக்குவதில் தோல்வி

source: Failed to estimate payment
ta: கட்டணத்தை மதிப்பிடுவதில் தோல்வி

# FAILED_TO_PAY_INVOICE
source: Failed to pay the invoice
ta: விலைப்பட்டியல் செலுத்தத் தவறிவிட்டது

source: Failed to reset password
ta: கடவுச்சொல்லை மீட்டமைப்பதில் தோல்வி

# FAILED_TO_SET_DEFAULT_PAYMENT_METHOD
source: Failed to set the default payment method
ta: இயல்புநிலை கட்டண முறையை அமைப்பதில் தோல்வி

source: Failed to update subscription
ta: சந்தாவைப் புதுப்பிக்கத் தவறிவிட்டது

source: First name
ta: முதல் பெயர்

source: First name is required
ta: முதல் பெயர் தேவை

source: Force changing password
ta: கடவுச்சொல்லை மாற்ற கட்டாயப்படுத்துங்கள்

source: Free trial
ta: இலவச சோதனை

source: From
ta: இருந்து

# FUNCTION_NOT_SUPPORTED
source: Function is not supported
ta: செயல்பாடு ஆதரிக்கப்படவில்லை

source: GDPR compliant
ta: சிடிபிஆர் இணக்கம்

source: Get Help
ta: உதவி பெறு

source: Got it
ta: கிடைத்தது

# GO_BACK_TO_HOME_PAGE
source: Go back to the home page
ta: முகப்பு பக்கத்திற்குச் செல்லுங்கள்

source: Go back to sign in screen
ta: திரையில் உள்நுழைய மீண்டும் செல்லவும்

# GO_INVITE_USER
source: Go to invite user »
ta: பயனரை அழைக்கச் செல்லுங்கள் »

source: Go to applications
ta: விண்ணப்பங்களுக்குச் செல்லவும்

source: Go to Billing
ta: பில்லிங்கிற்குச் செல்லுங்கள்

source: Go to console
ta: கன்சோலுக்குச் செல்லுங்கள்

source: Go to Invoices tab
ta: விலைப்பட்டியல் தாவலுக்குச் செல்லவும்

# GO_TO_LINSHARE_APP
source: Go to LinShare application
ta: லின்சேர் பயன்பாட்டிற்குச் செல்லவும்

# GO_TO_TWAKE_APP
source: Go to Twake application
ta: டூக் விண்ணப்பத்திற்குச் செல்லவும்

source: Guest
ta: விருந்தினர்

source: Guests
ta: விருந்தினர்கள்

# GUEST_COUNT
source: {0} guests
ta: {0} விருந்தினர்கள்

# GUEST_LIMIT_REACHED_ERROR_PROMPT
source: The number of guests has reached its limit ({0}), please upgrade your plan to have more guests.
ta: விருந்தினர்களின் எண்ணிக்கை அதன் வரம்பை எட்டியுள்ளது ({0}), தயவுசெய்து அதிக விருந்தினர்களைக் கொண்டிருப்பதற்கான உங்கள் திட்டத்தை மேம்படுத்தவும்.

source: Home
ta: வீடு

source: Import
ta: இறக்குமதி

source: Importing request created
ta: இறக்குமதி கோரிக்கை உருவாக்கப்பட்டது

source: Import users
ta: பயனர்கள் இறக்குமதி செய்யுங்கள்

# IMPORT_USER_DESCRIPTION
source: Upload your user's list from a .CSV file. You can only upload one file each time.
ta: உங்கள் பயனரின் பட்டியலை .csv கோப்பிலிருந்து பதிவேற்றவும். ஒவ்வொரு முறையும் ஒரு கோப்பை மட்டுமே பதிவேற்ற முடியும்.

source: Import user list
ta: பயனர் பட்டியலை இறக்குமதி செய்யுங்கள்

source: Incorrect password
ta: தவறான கடவுச்சொல்

source: Index
ta: குறியெண்

source: Invalid
ta: செல்லுபடியாகாத

# INVALID_COUPON
source: Coupon is invalid. Try another one
ta: கூப்பன் தவறானது. இன்னொன்றை முயற்சிக்கவும்

source: Invitations
ta: அழைப்பிதழ்கள்

# INVITATIONS_TO_ME_BOX_DESCRIPTION
source: Accept invitations and join the company to collaborate within your teams. You can only accept invitations from Collaborators for now.
ta: அழைப்பிதழ்களை ஏற்றுக்கொண்டு, உங்கள் அணிகளுக்குள் ஒத்துழைக்க நிறுவனத்தில் சேரவும். நீங்கள் இப்போது ஒத்துழைப்பாளர்களிடமிருந்து அழைப்பிதழ்களை மட்டுமே ஏற்க முடியும்.

# INVITATION_MESSAGE
source: {0} has invited you to join {1}
ta: {0} {1} இல் சேர உங்களை அழைத்தது

source: Invite
ta: அழைக்கவும்

# INVITE_FAILED_MESSAGE
source: Failed to invite some users
ta: சில பயனர்களை அழைக்கத் தவறிவிட்டது

source: Invite members
ta: உறுப்பினர்களை அழைக்கவும்
