Repository: 247i/TACETr
Catalog: உரை/தானி/linagora-twake-console-account-*.po
Languages: ta

# EMAIL_TEMPLATE.COMMON.HAVE_GOOD_DAY
source: Have a good day!
ta: ஒரு நல்ல நாள்!

# EMAIL_TEMPLATE.COMMON.THANK_YOU_FOR_CHOOSING_US
source: Thank you for choosing us! 😉
ta: எங்களைத் தேர்ந்தெடுத்ததற்கு நன்றி! .

# EMAIL_TEMPLATE.COMMON.WELCOME_MESSAGE
source: Welcome to the open source digital workplace!
ta: திறந்த மூல டிசிட்டல் பணியிடத்திற்கு வருக!

# EMAIL_TEMPLATE.COMPANY_DELETED.HELLO
source: Hello,
ta: வணக்கம்,

# EMAIL_TEMPLATE.COMPANY_DELETED.MESSAGE
source: You have been removed from company {{ companyName }} because the company no longer exists. All your personal data belonging to that company will be removed within 48 hours.
ta: நிறுவனம் இனி இல்லாததால் நீங்கள் நிறுவனத்தின் {{ companyName } இருந்து நிறுவனத்திலிருந்து அகற்றப்பட்டீர்கள். அந்த நிறுவனத்திற்கு சொந்தமான உங்கள் தனிப்பட்ட தரவு அனைத்தும் 48 மணி நேரத்திற்குள் அகற்றப்படும்.

# EMAIL_TEMPLATE.COMPANY_DELETED.SUBJECT
source: Company {{ companyName }} has been deleted!
ta: நிறுவனம் {{ companyName }} நீக்கப்பட்டது!

# EMAIL_TEMPLATE.COMPANY_DELETED.TITLE
source: Company {{ companyName }} has been deleted!
ta: நிறுவனம் {{ companyName }} நீக்கப்பட்டது!

# EMAIL_TEMPLATE.COMPANY_MEMBER_DELETED.HELLO
source: Hello,
ta: வணக்கம்,

# EMAIL_TEMPLATE.COMPANY_MEMBER_DELETED.MESSAGE
source: You have been removed from {{ companyName }}
ta: நீங்கள் {{ companyName } இருந்து இலிருந்து அகற்றப்பட்டீர்கள்

# EMAIL_TEMPLATE.COMPANY_MEMBER_DELETED.SUBJECT
source: You have been removed from the company "{{ companyName }}"
ta: நீங்கள் "{{ companyName }}" நிறுவனத்திலிருந்து அகற்றப்பட்டீர்கள்

# EMAIL_TEMPLATE.COMPANY_MEMBER_DELETED.TITLE
source: You have been removed from {{ companyName }} on the open source digital workplace!
ta: திறந்த மூல டிசிட்டல் பணியிடத்தில் நீங்கள் {{ companyName } இருந்து இலிருந்து அகற்றப்பட்டீர்கள்!

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED.COMPANY_DETAILS
source: Your company details are:
ta: உங்கள் நிறுவனத்தின் விவரங்கள்:

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED.FORMER_OWNER
source: Former owner:
ta: முன்னாள் உரிமையாளர்:

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED.HELLO
source: Hello {{ newOwnerName }},
ta: வணக்கம் {{ newOwnerName }},

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED.MESSAGE_1
source: You have been delegated as {{ companyName }}'s owner on the open source digital workplace.
ta: திறந்த மூல டிசிட்டல் பணியிடத்தில் நீங்கள் {{ companyName }} fork இன் உரிமையாளராக நியமிக்கப்பட்டுள்ளீர்கள்.

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED.MESSAGE_2
source: To manage tasks, click on the sign in button or copy the following link into the address bar of your browser:
ta: பணிகளை நிர்வகிக்க, உள்நுழைவு பொத்தானைக் சொடுக்கு செய்க அல்லது பின்வரும் இணைப்பை உங்கள் உலாவியின் முகவரி பட்டியில் நகலெடுக்கவும்:

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED.NAME
source: Name:
ta: பெயர்:

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED.OWNER
source: Owner:
ta: உரிமையாளர்:

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED.SIGN_IN
source: Sign in
ta: விடுபதிகை

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED.SUBJECT
source: You have been delegated as owner of company {{ companyName }}
ta: நிறுவனத்தின் உரிமையாளராக நீங்கள் நியமிக்கப்பட்டுள்ளீர்கள் {{ companyName }}

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED.TITLE
source: You have been delegated!
ta: நீங்கள் ஒப்படைக்கப்பட்டுள்ளீர்கள்!

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED_FORMER_OWNER.HELLO
source: Hello {{ formerOwnerName }},
ta: அலோ {{ formerOwnerName }},

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED_FORMER_OWNER.MESSAGE_1
source: Your delegate has been successful. Now you have a role of an admin.
ta: உங்கள் சார்பாளர் வெற்றிகரமாக உள்ளது. இப்போது உங்களுக்கு ஒரு நிர்வாகியின் பங்கு உண்டு.

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED_FORMER_OWNER.MESSAGE_2
source: To manage tasks, click on the sign in button or copy the following link into the address bar of your browser:
ta: பணிகளை நிர்வகிக்க, உள்நுழைவு பொத்தானைக் சொடுக்கு செய்க அல்லது பின்வரும் இணைப்பை உங்கள் உலாவியின் முகவரி பட்டியில் நகலெடுக்கவும்:

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED_FORMER_OWNER.SIGN_IN
source: Sign in
ta: விடுபதிகை

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED_FORMER_OWNER.SUBJECT
source: You have transferred ownership of company {{ companyName }}
ta: நிறுவனத்தின் உரிமையை நீங்கள் மாற்றியுள்ளீர்கள் {{ companyName }}

# EMAIL_TEMPLATE.COMPANY_OWNERSHIP_TRANSFERRED_FORMER_OWNER.TITLE
source: Successful delegation
ta: வெற்றிகரமான தூதுக்குழு

# EMAIL_TEMPLATE.COMPANY_SUBSCRIPTION_CANCELLED.HELLO
source: Hello {{ displayName }},
ta: வணக்கம் {{ displayName }},

# EMAIL_TEMPLATE.COMPANY_SUBSCRIPTION_CANCELLED.MESSAGE_1
source: You have changed your subscription to the free plan. Notice that all the limitations are applied following the free plan
ta: உங்கள் சந்தாவை இலவச திட்டத்திற்கு மாற்றியுள்ளீர்கள். இலவச திட்டத்தைப் பின்பற்றி அனைத்து வரம்புகளும் பயன்படுத்தப்படுகின்றன என்பதைக் கவனியுங்கள்

# EMAIL_TEMPLATE.COMPANY_SUBSCRIPTION_CANCELLED.MESSAGE_2
source: If you change your mind, you can update your subscription at any time.
ta: உங்கள் மனதை மாற்றினால், எந்த நேரத்திலும் உங்கள் சந்தாவை புதுப்பிக்கலாம்.

# EMAIL_TEMPLATE.COMPANY_SUBSCRIPTION_CANCELLED.MESSAGE_WITH_END_DATE
source: You have requested to cancel your subscription to the free plan, this request will apply at the end of period at {{ endOfTermDate }}. Notice that all limitations will be applied following the free plan
ta: இலவச திட்டத்திற்கு உங்கள் சந்தாவை ரத்து செய்யுமாறு நீங்கள் கோரியுள்ளீர்கள், இந்த கோரிக்கை காலத்தின் முடிவில் {{ endOfTermDate } at இல் பொருந்தும். இலவச திட்டத்தைத் தொடர்ந்து அனைத்து வரம்புகளும் பயன்படுத்தப்படும் என்பதைக் கவனியுங்கள்

# EMAIL_TEMPLATE.COMPANY_SUBSCRIPTION_CANCELLED.SUBJECT
source: You have cancelled subscription plan of company {{ companyName }}
ta: நிறுவனத்தின் சந்தா திட்டத்தை நீங்கள் ரத்து செய்துள்ளீர்கள் {{ companyName }}

# EMAIL_TEMPLATE.COMPANY_SUBSCRIPTION_CANCELLED.SUBJECT_WITHOUT_COMPANY_NAME
source: You have cancelled your company subscription plan
ta: உங்கள் நிறுவனத்தின் சந்தா திட்டத்தை ரத்து செய்துள்ளீர்கள்

# EMAIL_TEMPLATE.COMPANY_SUBSCRIPTION_CANCELLED.TITLE
source: Your subscription has changed
ta: உங்கள் சந்தா மாறிவிட்டது

# EMAIL_TEMPLATE.COMPANY_SUBSCRIPTION_DOWNGRADE.HELLO
source: Hello {{ ownerDisplayName }},
ta: வணக்கம் {{ ownerDisplayName }},

# EMAIL_TEMPLATE.COMPANY_SUBSCRIPTION_DOWNGRADE.MESSAGE_1
source: Your company {{ companyName }} has successfully requested to change from {{ currentPlanName }} to {{ targetPlanName}}. The {{ targetPlanName }} will take effect on {{ nextPeriod }}. Before that date, you can cancel the downgrading process by going to the Subscription page. Otherwise, your company will lose features from the {{ currentPlanName }}.
ta: உங்கள் நிறுவனம் {{ companyName }} {{ currentPlanName }} for} {{ targetPlanName} பெறுநர் க்கு மாற்றுமாறு வெற்றிகரமாக கோரியுள்ளது. {{ targetPlanName}} {{ targetPlanName }} இல் நடைமுறைக்கு வரும். அந்த தேதிக்கு முன், சந்தா பக்கத்திற்குச் செல்வதன் மூலம் தரமிறக்குதல் செயல்முறையை ரத்து செய்யலாம். இல்லையெனில், உங்கள் நிறுவனம் {{ currentPlanName } இருந்து இலிருந்து அம்சங்களை இழக்கும்.

# EMAIL_TEMPLATE.COMPANY_SUBSCRIPTION_DOWNGRADE.MESSAGE_2
source: If you think the change was made in error, report us by replying to this email. Thanks!
ta: மாற்றம் பிழையாகிவிட்டது என்று நீங்கள் நினைத்தால், இந்த மின்னஞ்சலுக்கு பதிலளிப்பதன் மூலம் எங்களை புகாரளிக்கவும். நன்றி!

# EMAIL_TEMPLATE.COMPANY_SUBSCRIPTION_DOWNGRADE.SUBJECT
source: You have scheduled a subscription downgrade for company {{ companyName }}
ta: நிறுவனத்திற்கான சந்தா தரமிறக்க நீங்கள் திட்டமிட்டுள்ளீர்கள் {{ companyName }}

# EMAIL_TEMPLATE.COMPANY_SUBSCRIPTION_DOWNGRADE.TITLE
source: The subscription has been changed for your company {{ companyName }}
ta: உங்கள் நிறுவனத்திற்கு சந்தா மாற்றப்பட்டுள்ளது {{ companyName }}

# EMAIL_TEMPLATE.COMPANY_USER_ADDED_TO_APPLICATION.HI
source: Hi {{ inviteeDisplayName }},
ta: ஆய் {{ inviteeDisplayName }},

# EMAIL_TEMPLATE.COMPANY_USER_ADDED_TO_APPLICATION.MESSAGE
source: {{ inviterDisplayName }} has invited you to use {{ applicationName }} on
ta: {{ inviterDisplayName }} {{ applicationName }} இல் பயன்படுத்த உங்களை அழைத்தது

# EMAIL_TEMPLATE.COMPANY_USER_ADDED_TO_APPLICATION.SIGN_IN
source: Sign in
ta: விடுபதிகை

# EMAIL_TEMPLATE.COMPANY_USER_ADDED_TO_APPLICATION.SIGN_IN_INSTRUCTION
source: To sign in, click on the following button or copy the following link into the address bar of your browser:
ta: உள்நுழைய, பின்வரும் பொத்தானைக் சொடுக்கு செய்க அல்லது பின்வரும் இணைப்பை உங்கள் உலாவியின் முகவரி பட்டியில் நகலெடுக்கவும்:

# EMAIL_TEMPLATE.COMPANY_USER_ADDED_TO_APPLICATION.SUBJECT
source: {{ inviterDisplayName }} has invited you to use {{ applicationName }} on "{{ companyName }}"
ta: {{{{ inviterDisplayName }} "இல் {{ applicationName }} ஐப் பயன்படுத்த உங்களை அழைத்துள்ளது

# EMAIL_TEMPLATE.COMPANY_USER_ADDED_TO_APPLICATION.SWITCH_APPLICATION_INSTRUCTION
source: Since you already have an account, please sign in and switch your application as shown here.
ta: உங்களிடம் ஏற்கனவே ஒரு கணக்கு இருப்பதால், தயவுசெய்து இங்கே காட்டப்பட்டுள்ளபடி உள்நுழைந்து உங்கள் பயன்பாட்டை மாற்றவும்.

# EMAIL_TEMPLATE.COMPANY_USER_ADDED_TO_APPLICATION.TITLE
source: You have been invited
ta: நீங்கள் அழைக்கப்பட்டுள்ளீர்கள்

# EMAIL_TEMPLATE.COMPANY_USER_CREATED.HAS_INVITED_YOU_TO_JOIN
source: has invited you to join
ta: சேர உங்களை அழைத்தார்

# EMAIL_TEMPLATE.COMPANY_USER_CREATED.HI
source: Hi {{ inviteeDisplayName }},
ta: ஆய் {{ inviteeDisplayName }},

# EMAIL_TEMPLATE.COMPANY_USER_CREATED.SET_PASSWORD_BUTTON
source: Set your password
ta: உங்கள் கடவுச்சொல்லை அமைக்கவும்

# EMAIL_TEMPLATE.COMPANY_USER_CREATED.SUBJECT
source: {{ inviterDisplayName }} has invited you to join "{{ companyName }}"
ta: {{ inviterDisplayName }} {{{ companyName }} "இல் சேர உங்களை அழைத்தது.

# EMAIL_TEMPLATE.COMPANY_USER_CREATED.VERIFY_ACCOUNT_INSTRUCTION
source: To set your password and verify your email, click on the following button:
ta: உங்கள் கடவுச்சொல்லை அமைத்து உங்கள் மின்னஞ்சலை சரிபார்க்க, பின்வரும் பொத்தானைக் சொடுக்கு செய்க:

# EMAIL_TEMPLATE.CONTENT_FOOTER.GOODTECH4GOOD_MESSAGE
source: Inventing free and open source ethical software to make the world a better place!
ta: உலகத்தை ஒரு சிறந்த இடமாக மாற்ற இலவச மற்றும் திறந்த மூல நெறிமுறை மென்பொருளை கண்டுபிடிப்பது!

# EMAIL_TEMPLATE.CONTENT_FOOTER.POWERED_BY
source: Powered by
ta: மூலம் இயக்கப்படுகிறது

# EMAIL_TEMPLATE.EXISTED_USER_INVITATION.HAS_INVITED_YOU_TO_JOIN
source: {{ inviter }} has invited you to join
ta: {{ inviter } the உங்களை சேர அழைத்தார்

# EMAIL_TEMPLATE.EXISTED_USER_INVITATION.HI
source: Hi {{ inviteeDisplayName }},
ta: ஆய் {{ inviteeDisplayName }},

# EMAIL_TEMPLATE.EXISTED_USER_INVITATION.PLEASE_SIGN_IN
source: Since you already have an account, please sign in and switch your company as shown here.
ta: உங்களிடம் ஏற்கனவே ஒரு கணக்கு இருப்பதால், தயவுசெய்து இங்கே காட்டப்பட்டுள்ளபடி உள்நுழைந்து உங்கள் நிறுவனத்தை மாற்றவும்.

# EMAIL_TEMPLATE.EXISTED_USER_INVITATION.SIGNIN_BUTTON
source: Sign in
ta: விடுபதிகை

# EMAIL_TEMPLATE.EXISTED_USER_INVITATION.SIGN_IN_INSTRUCTION
source: To sign in, click on the following button or copy the following link into the address bar of your browser:
ta: உள்நுழைய, பின்வரும் பொத்தானைக் சொடுக்கு செய்க அல்லது பின்வரும் இணைப்பை உங்கள் உலாவியின் முகவரிப் பட்டியில் நகலெடுக்கவும்:

# EMAIL_TEMPLATE.EXISTED_USER_INVITATION.TITLE
source: You have been invited to join a company
ta: ஒரு நிறுவனத்தில் சேர நீங்கள் அழைக்கப்பட்டுள்ளீர்கள்

# EMAIL_TEMPLATE.FOOTER.CONTACT
source: Tel: +33 1 46 96 63 63 | info@linagora.com
ta: தொலைபேசி: +33 1 46 96 63 63 | info@linagora.com

# EMAIL_TEMPLATE.FOOTER.FOLLOW_US_ON_SOCIAL_MEDIA
source: Follow us on social media
ta: சமூக ஊடகங்களில் எங்களைப் பின்தொடரவும்

# EMAIL_TEMPLATE.FOOTER.HELP_CENTER
source: Help Center
ta: உதவி நடுவண்

# EMAIL_TEMPLATE.FOOTER.PRIVACY_POLICY
source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

# EMAIL_TEMPLATE.FOOTER.SENT_BY_MESSAGE
source: Sent by LINAGORA | 100 Terrasse Boieldieu Tour Franklin 92042 Paris La Défense
ta: லினகோரா அனுப்பினார் | 100 டெரச் போயல்டீயு டூர் பிராங்க்ளின் 92042 பாரிச் லா டெஃபென்ச்

# EMAIL_TEMPLATE.FOOTER.TELEPHONE_NUMBER_ABBREVIATION
source: Tel
ta: தொலைபேசி

# EMAIL_TEMPLATE.FOOTER.TERM_OF_SERVICE
source: Terms of Service
ta: பணி விதிமுறைகள்

# EMAIL_TEMPLATE.IMPORTING_REQUEST_RESULT.CANCELED_MESSAGE
source: Your importing request has been canceled
ta: உங்கள் இறக்குமதி கோரிக்கை ரத்து செய்யப்பட்டுள்ளது

# EMAIL_TEMPLATE.IMPORTING_REQUEST_RESULT.FAILED_MESSAGE
source: Failed to process the request
ta: கோரிக்கையை செயலாக்குவதில் தோல்வி

# EMAIL_TEMPLATE.IMPORTING_REQUEST_RESULT.HELLO
source: Hello {{ requesterName }}
ta: அலோ {{ requesterName }}}

# EMAIL_TEMPLATE.IMPORTING_REQUEST_RESULT.SUBJECT
source: You have imported a user list
ta: நீங்கள் ஒரு பயனர் பட்டியலை இறக்குமதி செய்துள்ளீர்கள்

# EMAIL_TEMPLATE.IMPORTING_REQUEST_RESULT.SUCCESS_MESSAGE
source: There was {{ added }} member(s) added, {{ created }} created, {{ skipped }} skipped, {{ invalid }} invalid, {{ failed }} failed
ta: {{ added }} உறுப்பினர் (கள்) சேர்க்கப்பட்டது, {{ created }} உருவாக்கப்பட்டது, {{ skipped }} தவிர்க்கப்பட்டது, {{ invalid }} தவறான, {{ failed }} தோல்வியுற்றது

# EMAIL_TEMPLATE.INVITATION.CREATE_ACCOUNT
source: Create account
ta: கணக்கை உருவாக்கவும்

# EMAIL_TEMPLATE.INVITATION.CREATE_ACCOUNT_INSTRUCTION
source: Click on Create account to complete the registration:
ta: பதிவை முடிக்க கணக்கை உருவாக்கு என்பதைக் சொடுக்கு செய்க:

# EMAIL_TEMPLATE.INVITATION.HAS_INVITED_YOU_TO_JOIN
source: {{ inviter }} has invited you to join
ta: {{ inviter } the உங்களை சேர அழைத்தார்

# EMAIL_TEMPLATE.INVITATION.HI
source: Hi {{ inviteeDisplayName }},
ta: ஆய் {{ inviteeDisplayName }},

# EMAIL_TEMPLATE.INVITATION.MESSAGE
source: Please, create an account and start the collaboration with the team.
ta: தயவுசெய்து, ஒரு கணக்கை உருவாக்கி அணியுடன் ஒத்துழைப்பைத் தொடங்கவும்.

# EMAIL_TEMPLATE.INVITATION.SUBJECT
source: {{ inviterDisplayName }} has invited you to join "{{ companyName }}"
ta: {{ inviterDisplayName }} {{{ companyName }} "இல் சேர உங்களை அழைத்தது.

# EMAIL_TEMPLATE.INVITATION.TITLE
source: You have been invited
ta: நீங்கள் அழைக்கப்பட்டுள்ளீர்கள்

# EMAIL_TEMPLATE.PAYMENT_FAILED.HELLO
source: Hi {{ ownerName }},
ta: ஆய் {{ ownerName }},

# EMAIL_TEMPLATE.PAYMENT_FAILED.MAIN_MESSAGE
source: We are sorry to inform you that your payment method in {{ companyName }} was declined for the period of {{ termStart }} - {{ termEnd }}.
ta: {{நிறுவனத்தின் பெயரில் உங்கள் கட்டண முறை {{ companyName }} - {{ termStart } of இன் காலத்திற்கு மறுக்கப்பட்டது என்பதை உங்களுக்குத் தெரிவிக்க வருந்துகிறோம்.

# EMAIL_TEMPLATE.PAYMENT_FAILED.REACH_OUT_PROMPT
source: Please reach out to us at <a href="mailto:{{ emailSupportAddress }}">{{ emailSupportAddress }}</a> if you still have trouble with your payment.
ta: தயவுசெய்து <a href = "mailto: {{{{ emailSupportAddress }}"> {{{{ emailSupportAddress }} </a> உங்கள் கட்டணத்தில் உங்களுக்கு இன்னும் சிக்கல் இருந்தால்.

# EMAIL_TEMPLATE.PAYMENT_FAILED.REASONS
source: No worries, it happens sometimes to the best of us. The most common reasons are:
ta: எந்த கவலையும் இல்லை, இது சில நேரங்களில் நம்மில் சிறந்தவர்களுக்கு நடக்கும். மிகவும் பொதுவான காரணங்கள்:

# EMAIL_TEMPLATE.PAYMENT_FAILED.REASON_1
source: Insufficient funds on the account
ta: கணக்கில் போதுமான பொருள்

# EMAIL_TEMPLATE.PAYMENT_FAILED.REASON_2
source: Expired credit card
ta: காலாவதியான கடன் அட்டை

# EMAIL_TEMPLATE.PAYMENT_FAILED.REASON_3
source: The bank’s fraud rules blocked the transaction
ta: வங்கியின் மோசடி விதிகள் பரிவர்த்தனையைத் தடுத்தன

# EMAIL_TEMPLATE.PAYMENT_FAILED.SUBJECT
source: Your payment is failed
ta: உங்கள் கட்டணம் தோல்வியுற்றது

# EMAIL_TEMPLATE.PAYMENT_FAILED.TITLE
source: Your payment is failed
ta: உங்கள் கட்டணம் தோல்வியுற்றது

# EMAIL_TEMPLATE.PAYMENT_FAILED.UPDATE_BILLING
source: Update your billing details!
ta: உங்கள் பட்டியலிடல் விவரங்களை புதுப்பிக்கவும்!

# EMAIL_TEMPLATE.PAYMENT_FAILED.UPDATE_BILLING_PROMPT
source: Please update your billing information and we'll give it another try!
ta: தயவுசெய்து உங்கள் பட்டியலிடல் தகவலைப் புதுப்பிக்கவும், நாங்கள் அதை மற்றொரு முயற்சி செய்வோம்!

# EMAIL_TEMPLATE.PAYMENT_FAILED.WARNING_MESSAGE
source: Just giving you a heads-up in case you didn’t notice. Your subscription will be back to the free version after 14 days, counting from {{ termStart }}. (It would be a shame to lose the features of the current plan because of this!)
ta: நீங்கள் கவனிக்காவிட்டால் உங்களுக்கு தலைகீழாக வழங்குங்கள். உங்கள் சந்தா 14 நாட்களுக்குப் பிறகு இலவச பதிப்பிற்கு திரும்பும், {{ termStart } இருந்து இலிருந்து எண்ணப்படும். (இதன் காரணமாக தற்போதைய திட்டத்தின் அம்சங்களை இழப்பது வெட்கமாக இருக்கும்!)

# EMAIL_TEMPLATE.RECOVER_PASSWORD.CONTENT
source: A request has been received to change the password for your account.
ta: உங்கள் கணக்கிற்கான கடவுச்சொல்லை மாற்ற கோரிக்கை பெறப்பட்டுள்ளது.

# EMAIL_TEMPLATE.RECOVER_PASSWORD.HELLO
source: Hello {{ displayName }},
ta: வணக்கம் {{ displayName }},

# EMAIL_TEMPLATE.RECOVER_PASSWORD.NOTE
source: If you didn’t initiate this request, please contact us immediately at
ta: இந்த கோரிக்கையை நீங்கள் தொடங்கவில்லை என்றால், தயவுசெய்து எங்களை உடனடியாக தொடர்பு கொள்ளவும்

# EMAIL_TEMPLATE.RECOVER_PASSWORD.RESET_BUTTON
source: Reset your password
ta: உங்கள் கடவுச்சொல்லை மீட்டமைக்கவும்

# EMAIL_TEMPLATE.RECOVER_PASSWORD.SUBJECT
source: Password recovery request
ta: கடவுச்சொல் மீட்பு கோரிக்கை

# EMAIL_TEMPLATE.RECOVER_PASSWORD.TITLE
source: Password reset
ta: கடவுச்சொல் மீட்டமைப்பு

# EMAIL_TEMPLATE.USER_DELETED.HI
source: Hi {{ userDisplayName }},
ta: இல்லை {{ userDisplayName }},

# EMAIL_TEMPLATE.USER_DELETED.MESSAGE_1
source: Your account and data have been successfully deleted. You won't be able to log in to your account or access your data on our open-source digital workplace.
ta: உங்கள் கணக்கு மற்றும் தரவு வெற்றிகரமாக நீக்கப்பட்டுள்ளன. உங்கள் கணக்கில் உள்நுழையவோ அல்லது எங்கள் திறந்த மூல டிசிட்டல் பணியிடத்தில் உங்கள் தரவை அணுகவோ முடியாது.

# EMAIL_TEMPLATE.USER_DELETED.MESSAGE_2
source: We're sorry to see you go, and we hope to work with you again in the future. If you have any feedback on how we could have made our products better for you or if you did not intend to close your account, please just reply to this email. We'd love to hear from you.
ta: நீங்கள் செல்வதைக் கண்டு வருந்துகிறோம், எதிர்காலத்தில் மீண்டும் உங்களுடன் பணியாற்றுவோம் என்று நம்புகிறோம். எங்கள் தயாரிப்புகளை உங்களுக்காக எவ்வாறு சிறப்பாகச் செய்திருக்க முடியும் என்பது குறித்து உங்களுக்கு ஏதேனும் கருத்து இருந்தால் அல்லது உங்கள் கணக்கை மூட விரும்பவில்லை என்றால், தயவுசெய்து இந்த மின்னஞ்சலுக்கு பதிலளிக்கவும். உங்களிடமிருந்து கேட்க நாங்கள் விரும்புகிறோம்.

# EMAIL_TEMPLATE.USER_DELETED.SUBJECT
source: Deletion of your account
ta: உங்கள் கணக்கை நீக்குதல்

# EMAIL_TEMPLATE.USER_DELETED.TITLE
source: Your account has been deleted
ta: உங்கள் கணக்கு நீக்கப்பட்டது

# EMAIL_TEMPLATE.USER_LEFT_COMPANY.HELLO
source: Hello,
ta: வணக்கம்,

# EMAIL_TEMPLATE.USER_LEFT_COMPANY.MESSAGE
source: A member of your company {{ companyName }} on the open source digital workplace has left the company:
ta: திறந்த மூல டிசிட்டல் பணியிடத்தில் உங்கள் நிறுவனத்தின் உறுப்பினர் {{ companyName } the நிறுவனத்தை விட்டு வெளியேறிவிட்டார்:

# EMAIL_TEMPLATE.USER_LEFT_COMPANY.SUBJECT
source: {{ userName }} left {{ companyName }} on the open source digital workplace
ta: {{ userName }} இடது {{ companyName }} திறந்த மூல டிசிட்டல் பணியிடத்தில்

# EMAIL_TEMPLATE.USER_LEFT_COMPANY.TITLE
source: A member left your company
ta: ஒரு உறுப்பினர் உங்கள் நிறுவனத்தை விட்டு வெளியேறினார்

# EMAIL_TEMPLATE.USER_LEFT_COMPANY_SELF.HELLO
source: Hello
ta: வணக்கம்

# EMAIL_TEMPLATE.USER_LEFT_COMPANY_SELF.MESSAGE_1
source: You have left the company {{ companyName }} on the open source digital workplace.
ta: திறந்த மூல டிசிட்டல் பணியிடத்தில் {{ companyName }} நிறுவனத்தை விட்டுவிட்டீர்கள்.

# EMAIL_TEMPLATE.USER_LEFT_COMPANY_SELF.MESSAGE_2
source: Notice that all of your data on {{ companyName }} will be deleted immediately.
ta: {{ companyName } on இல் உள்ள உங்கள் தரவு அனைத்தும் உடனடியாக நீக்கப்படும் என்பதைக் கவனியுங்கள்.

# EMAIL_TEMPLATE.USER_LEFT_COMPANY_SELF.SUBJECT
source: You left {{ companyName }} on the open source digital workplace
ta: திறந்த மூல டிசிட்டல் பணியிடத்தில் {{ companyName }} ஐ விட்டுவிட்டீர்கள்

# EMAIL_TEMPLATE.USER_LEFT_COMPANY_SELF.TITLE
source: Notice of leaving the company
ta: நிறுவனத்தை விட்டு வெளியேறுவதற்கான அறிவிப்பு

# EMAIL_TEMPLATE.VERIFICATION.SET_PASSWORD_BUTTON
source: Set your password
ta: உங்கள் கடவுச்சொல்லை அமைக்கவும்

# EMAIL_TEMPLATE.VERIFICATION.SUBJECT
source: Confirm email address
ta: மின்னஞ்சல் முகவரியை உறுதிப்படுத்தவும்

# EMAIL_TEMPLATE.VERIFICATION.TITLE
source: Confirm email address
ta: மின்னஞ்சல் முகவரியை உறுதிப்படுத்தவும்

# EMAIL_TEMPLATE.VERIFICATION.VERIFY_ACCOUNT_INSTRUCTION
source: To change your password and verify your account, click on the following button:
ta: உங்கள் கடவுச்சொல்லை மாற்றவும், உங்கள் கணக்கை சரிபார்க்கவும், பின்வரும் பொத்தானைக் சொடுக்கு செய்க:

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.CHANGE_PASSWORD_MESSAGE
source: You can change password in account settings after verification
ta: சரிபார்ப்புக்குப் பிறகு கணக்கு அமைப்புகளில் கடவுச்சொல்லை மாற்றலாம்

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.CONGRATULATIONS_MESSAGE
source: Congratulations on taking advantage of our SaaS offer!🎉
ta: எங்கள் சாச் சலுகையைப் பயன்படுத்திக் கொண்டதற்கு வாழ்த்துக்கள்!

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.GENERATED_PASSWORD_MESSAGE
source: We generated a password for your account:
ta: உங்கள் கணக்கிற்கான கடவுச்சொல்லை நாங்கள் உருவாக்கினோம்:

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.INTRODUCTION_MESSAGE
source: Our products are used by more than 3000 organizations around the world!
ta: எங்கள் தயாரிப்புகள் உலகெங்கிலும் உள்ள 3000 க்கும் மேற்பட்ட நிறுவனங்களால் பயன்படுத்தப்படுகின்றன!

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.LINSHARE_DESCRIPTION
source: LinShare is a secure open-source product for file sharing.
ta: லின்சேர் என்பது கோப்பு பகிர்வுக்கான பாதுகாப்பான திறந்த மூல தயாரிப்பு ஆகும்.

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.LINSHARE_TITLE
source: File sharing and storage
ta: கோப்பு பகிர்வு மற்றும் சேமிப்பு

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.LINTO_DESCRIPTION
source: LinTO is an AI-based open-source voice platform.
ta: லிண்டோ AI- அடிப்படையிலான திறந்த மூல குரல் தளம்.

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.LINTO_TITLE
source: Open source voice tech platform
ta: திறந்த மூல குரல் தொழில்நுட்ப தளம்

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.OUR_PRODUCTS
source: Our products
ta: எங்கள் தயாரிப்புகள்

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.SET_PASSWORD_BUTTON
source: Set your password
ta: உங்கள் கடவுச்சொல்லை அமைக்கவும்

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.SUBJECT
source: Confirm email address
ta: மின்னஞ்சல் முகவரியை உறுதிப்படுத்தவும்

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.TMAIL_DESCRIPTION
source: T-mail is an open-source e-mail client for collaborative work.
ta: டி-மெயில் என்பது கூட்டு வேலைக்கான திறந்த மூல மின்னஞ்சல் வாங்கி ஆகும்.

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.TMAIL_TITLE
source: Secure and sustainable Email
ta: பாதுகாப்பான மற்றும் நிலையான மின்னஞ்சல்

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.TWAKE_DESCRIPTION
source: Twake is an open-source collaboration platform created to improve team organization.
ta: குழு அமைப்பை மேம்படுத்துவதற்காக உருவாக்கப்பட்ட திறந்த மூல ஒத்துழைப்பு தளமாகும்.

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.TWAKE_TITLE
source: Team collaboration
ta: குழு ஒத்துழைப்பு

# EMAIL_TEMPLATE.VERIFICATION_ON_SIGN_UP.VERIFY_ACCOUNT_INSTRUCTION
source: To set your password and verify your email, click on the following button:
ta: உங்கள் கடவுச்சொல்லை அமைத்து உங்கள் மின்னஞ்சலை சரிபார்க்க, பின்வரும் பொத்தானைக் சொடுக்கு செய்க:
