Repository: 247i/TACETr
Catalog: உரை/தானி/linagora-twake-console-web-*.po
Languages: ta

# INVITE_MEMBERS_DESCRIPTION
source: Invite people to your company and assign them to your products to access and collaborate with your team. You can invite multiple members by separate emails with semicolons.
ta: உங்கள் நிறுவனத்திற்கு மக்களை அழைக்கவும், உங்கள் குழுவுடன் அணுகவும் ஒத்துழைக்கவும் உங்கள் தயாரிப்புகளுக்கு அவர்களை நியமிக்கவும். அரைக்காற்புள்ளிகளுடன் தனி மின்னஞ்சல்கள் மூலம் பல உறுப்பினர்களை அழைக்கலாம்.

# INVITE_UNEXPECTED_ERROR_MESSAGE
source: Some unexpected error occured while inviting these users:
ta: இந்த பயனர்களை அழைக்கும்போது சில எதிர்பாராத பிழை ஏற்பட்டது:

source: Invoice
ta: விலைப்பட்டியல்

source: Invoiced on
ta: விலைப்பட்டியல்

source: Invoices
ta: விலைப்பட்டியல்

# INVOICES_DESCRIPTION
source: Manage invoices
ta: விலைப்பட்டியல் நிர்வகிக்கவும்

# INVOICE_DOWNLOAD_FAILED
source: Something went wrong when downloading the invoice
ta: விலைப்பட்டியல் பதிவிறக்கும்போது ஏதோ தவறு ஏற்பட்டது

# INVOICE_PAID_SUCCESSFULLY
source: The invoice has been paid successfully
ta: விலைப்பட்டியல் வெற்றிகரமாக செலுத்தப்பட்டுள்ளது

source: In trial
ta: விசாரணையில்

source: It's you
ta: இது நீங்கள்

source: Last name
ta: கடைசி பெயர்

source: Last name is required
ta: கடைசி பெயர் தேவை

source: Launch
ta: ஏவுதல்

source: Learn more
ta: மேலும் அறிக

source: Leave
ta: விடுப்பு

source: Leave company
ta: நிறுவனம் விடுப்பு

# LEAVE_COMPANY_DESCRIPTION
source: You will not be able to access the company anymore.
ta: நீங்கள் இனி நிறுவனத்தை அணுக முடியாது.

# LEAVE_COMPANY_FAILED
source: Failed to leave the company
ta: நிறுவனத்தை விட்டு வெளியேறத் தவறிவிட்டது

# LEAVE_COMPANY_OWNER_DESCRIPTION
source: You have to transfer your ownership before you can leave your company.
ta: உங்கள் நிறுவனத்தை விட்டு வெளியேறுவதற்கு முன்பு உங்கள் உரிமையை மாற்ற வேண்டும்.

# LEAVE_COMPANY_SUCCESSFULLY
source: Successfully left the company
ta: வெற்றிகரமாக நிறுவனத்தை விட்டு வெளியேறினார்

# LIMIT_EXCEEDED_FOR_APPLICATION_MESSAGE
source: The limit of { application } is reached, please upgrade your plan. Therefore, these users are not added to { application }:
ta: {பயன்பாடு of இன் வரம்பு அடைந்தது, தயவுசெய்து உங்கள் திட்டத்தை மேம்படுத்தவும். எனவே, இந்த பயனர்கள் {பயன்பாடு fit இல் சேர்க்கப்படவில்லை:

source: LinShare
ta: லின்சேர்

# LINSHARE_APP_DESCRIPTION
source: Private and secure file sharing and cloud storage solution.
ta: தனியார் மற்றும் பாதுகாப்பான கோப்பு பகிர்வு மற்றும் முகில் ச்டோரேச் தீர்வு.

# LINSHARE_BETA_FEEDBACK_BUTTON_TEXT
source: Please, share your feedback
ta: தயவுசெய்து, உங்கள் கருத்தைப் பகிர்ந்து கொள்ளுங்கள்

# LINSHARE_BETA_FEEDBACK_MESSAGE
source: We are testing LinShare SaaS on Beta. We are working hard to fix all the bugs that impact user experience. We rely on your valuable feedback to make LinShare better for everyone.
ta: பீட்டாவில் லின்சேர் சாசை சோதிக்கிறோம். பயனர் அனுபவத்தை பாதிக்கும் அனைத்து பிழைகளையும் சரிசெய்ய நாங்கள் கடுமையாக உழைக்கிறோம். லின்சேரை அனைவருக்கும் சிறந்ததாக்க உங்கள் மதிப்புமிக்க கருத்துக்களை நாங்கள் நம்புகிறோம்.

# LINSHARE_CUSTOM_PLAN_FEATURE_1
source: Unlimited Drive storage
ta: வரம்பற்ற இயக்கி சேமிப்பு

# LINSHARE_CUSTOM_PLAN_FEATURE_2
source: Available on-premise
ta: ஆன்-ப்ரைமிச் கிடைக்கிறது

# LINSHARE_DO_NOT_NEED_TO_RECOVER_PASSWORD
source: If you don’t need to recover your password
ta: உங்கள் கடவுச்சொல்லை மீட்டெடுக்க தேவையில்லை என்றால்

# LINSHARE_GO_BACK_TO_SIGN_IN_SCREEN
source: Go back to sign in
ta: உள்நுழைய மீண்டும் செல்லுங்கள்

# LINSHARE_RESET_PASSWORD_SUCCESSFULLY
source: We’ve reset a password for:
ta: இதற்கான கடவுச்சொல்லை நாங்கள் மீட்டமைக்கிறோம்:

source: Login and Security
ta: உள்நுழைவு மற்றும் பாதுகாப்பு

source: Login & security
ta: உள்நுழைவு மற்றும் பாதுகாப்பு

# LOGIN_SERCURITY_ACTION_BOX_DESCRIPTION
source: Secure your account with a strong password.
ta: வலுவான கடவுச்சொல் மூலம் உங்கள் கணக்கைப் பாதுகாக்கவும்.

source: Make default
ta: இயல்புநிலை செய்யுங்கள்

source: Manage members
ta: உறுப்பினர்களை நிர்வகிக்கவும்

source: Manage subscription
ta: சந்தாவை நிர்வகிக்கவும்

source: Maximum file size exceeded
ta: அதிகபட்ச கோப்பு அளவு மீறியது

# MAXIMUM_FILE_SIZE_EXCEEDED_MESSAGE
source: Your file size exceeds the maximum limit ({ fileSizeLimit }). Please reduce your file size and try again.
ta: உங்கள் கோப்பு அளவு அதிகபட்ச வரம்பை மீறுகிறது ({ fileSizeLimit }). தயவுசெய்து உங்கள் கோப்பு அளவைக் குறைத்து மீண்டும் முயற்சிக்கவும்.

# MAXIMUM_INVITATION_LIMIT_EXCEEDED_MESSAGE
source: You have exceeded the maximum number of emails (50). Please reduce your list to continue.
ta: நீங்கள் அதிகபட்ச மின்னஞ்சல்களை (50) தாண்டிவிட்டீர்கள். தொடர உங்கள் பட்டியலைக் குறைக்கவும்.

# MAXIMUM_NUMBER_OF_GUESTS_DETAIL
source: You have reached the maximum number of guests. Please upgrade your plan to invite more guests.
ta: நீங்கள் அதிகபட்ச விருந்தினர்களை அடைந்துவிட்டீர்கள். மேலும் விருந்தினர்களை அழைக்க உங்கள் திட்டத்தை மேம்படுத்தவும்.

# MAXIMUM_NUMBER_OF_MEMBERS_DETAIL
source: You have reached the maximum number of members. Please upgrade your plan to invite more members.
ta: நீங்கள் அதிகபட்ச உறுப்பினர்களை அடைந்துவிட்டீர்கள். மேலும் உறுப்பினர்களை அழைக்க உங்கள் திட்டத்தை மேம்படுத்தவும்.

source: Maximum number of users
ta: பயனர்களின் அதிகபட்ச எண்ணிக்கை

# MAX_NUMBER_OF_MEMBERS_WARNING
source: The number of members must be less than 10000
ta: உறுப்பினர்களின் எண்ணிக்கை 10000 க்கும் குறைவாக இருக்க வேண்டும்

source: Members
ta: உறுப்பினர்கள்

# MEMBERS_BOX_INTRODUCTION
source: Manage members in your organisation, create new members, invite external ones and remove them if necessary.
ta: உங்கள் நிறுவனத்தில் உறுப்பினர்களை நிர்வகிக்கவும், புதிய உறுப்பினர்களை உருவாக்கவும், வெளிப்புறங்களை அழைக்கவும், தேவைப்பட்டால் அவற்றை அகற்றவும்.

# MEMBERS_BOX_INTRODUCTION_FOR_MEMBERS_AND_GUESTS
source: Manage your membership in your organisation.
ta: உங்கள் நிறுவனத்தில் உங்கள் உறுப்பினரை நிர்வகிக்கவும்.

source: Members in your company
ta: உங்கள் நிறுவனத்தில் உறுப்பினர்கள்

# MEMBER_LIMIT_REACHED_ERROR_PROMPT
source: The number of members has reached its limit ({0}), please edit your subscription to add more members.
ta: உறுப்பினர்களின் எண்ணிக்கை அதன் வரம்பை எட்டியுள்ளது ({0}), மேலும் உறுப்பினர்களைச் சேர்க்க உங்கள் சந்தாவைத் திருத்தவும்.

# MIN_NUMBER_OF_MEMBERS_WARNING
source: The number of members must be greater than 0
ta: உறுப்பினர்களின் எண்ணிக்கை 0 ஐ விட அதிகமாக இருக்க வேண்டும்

# MIN_ONE_LOWER_CASE_CHARACTER
source: at least 1 lowercase character
ta: குறைந்தது 1 சிறிய எழுத்து

# MIN_ONE_SPECIAL_CHARACTER
source: at least 1 special character
ta: குறைந்தது 1 சிறப்பு எழுத்து

# MIN_ONE_UPPER_CASE_CHARACTER
source: at least 1 uppercase character
ta: குறைந்தது 1 பெரிய எழுத்து

source: Month
ta: மாதம்

source: Monthly
ta: மாதாந்திர

# MULTIPLE_LINSHARE_APPLICATIONS_NOT_ALLOWED_DESCRIPTION
source: We currently do not support multiple LinShare applications for one user. Contact us for more information. The users with those emails below already belong to a LinShare application in another company:
ta: ஒரு பயனருக்கான பல லின்சேர் பயன்பாடுகளை நாங்கள் தற்போது ஆதரிக்கவில்லை. மேலும் தகவலுக்கு எங்களை தொடர்பு கொள்ளவும். கீழே உள்ள மின்னஞ்சல்களைக் கொண்ட பயனர்கள் ஏற்கனவே மற்றொரு நிறுவனத்தில் ஒரு லின்சேர் பயன்பாட்டிற்கு சொந்தமானவர்கள்:

source: My company
ta: எனது நிறுவனம்

source: My subscription plan
ta: எனது சந்தா திட்டம்

source: Needed number of users
ta: பயனர்களின் எண்ணிக்கை தேவை

source: New password
ta: புதிய கடவுச்சொல்

# NEW_PASSWORD_IS_SAME_WITH_OLD_PASSWORD
source: New password must differ from your current password
ta: புதிய கடவுச்சொல் உங்கள் தற்போதைய கடவுச்சொல்லிலிருந்து வேறுபட வேண்டும்

source: New payment card
ta: புதிய கட்டண அட்டை

source: New user added
ta: புதிய பயனர் சேர்க்கப்பட்டது

source: Next billing
ta: அடுத்த பட்டியலிடல்

source: Next billing amount
ta: அடுத்த பட்டியலிடல் தொகை

source: Next billing on
ta: அடுத்த பட்டியலிடல்

source: Next period
ta: அடுத்த காலம்

source: Next plan
ta: அடுத்த திட்டம்

# NON_RENEWING
source: In cancellation
ta: ரத்து செய்வதில்

# NON_RENEWING_TEXT
source: Non-renewing
ta: புதுப்பிக்காதது

source: No cards found
ta: அட்டைகள் எதுவும் கிடைக்கவில்லை

source: No invitations available
ta: அழைப்புகள் எதுவும் கிடைக்கவில்லை

source: No Invoices
ta: விலைப்பட்டியல் இல்லை

# NO_INVOICES_DESCRIPTION
source: All created invoices will be recorded here
ta: உருவாக்கப்பட்ட அனைத்து விலைப்பட்டியல்களும் இங்கே பதிவு செய்யப்படும்

# NO_MEMBER_TO_TRANSFER_COMPANY_OWNERSHIP
source: No user to transfer. Please go to Members page to create or invite one.
ta: மாற்ற பயனர் இல்லை. ஒன்றை உருவாக்க அல்லது அழைக்க உறுப்பினர்கள் பக்கத்திற்குச் செல்லவும்.

# NO_PAYMENT_CARD_DESCRIPTION
source: Currently, you have no payment card. Please add a new one.
ta: தற்போது, ​​உங்களிடம் கட்டண அட்டை இல்லை. புதிய ஒன்றைச் சேர்க்கவும்.

# NO_PLAN_FOUND
source: We’re sorry,...it looks like no suitable plans are available for this search. Please try with other plans or {0} to get help.
ta: மன்னிக்கவும், ... இந்த தேடலுக்கு பொருத்தமான திட்டங்கள் எதுவும் கிடைக்கவில்லை என்று தெரிகிறது. உதவி பெற மற்ற திட்டங்களுடன் அல்லது {0} உடன் முயற்சிக்கவும்.

source: No results available
ta: முடிவுகள் எதுவும் கிடைக்கவில்லை

source: No results found
ta: முடிவுகள் எதுவும் கிடைக்கவில்லை

source: no space
ta: இடம் இல்லை

source: No users available
ta: பயனர்கள் எதுவும் கிடைக்கவில்லை

source: Number of guests
ta: விருந்தினர்களின் எண்ணிக்கை

source: Number of members
ta: உறுப்பினர்களின் எண்ணிக்கை

source: Number of users
ta: பயனர்களின் எண்ணிக்கை

# NUMBER_OF_USERS_CANNOT_BE_LESS_THAN_TOTAL_COMPANY_APPLICATION_USERS
source: You are trying to pay for fewer members than the currently assigned company members to { application } ({ numberOfMembers }). Please remove some members from { application } or pay for more members to proceed.
ta: தற்போது நியமிக்கப்பட்ட நிறுவன உறுப்பினர்களை விட குறைவான உறுப்பினர்களுக்கு { application } ({ numberOfMembers }) செலுத்த முயற்சிக்கிறீர்கள். தயவுசெய்து சில உறுப்பினர்களை {விண்ணப்பம் இருந்து இலிருந்து அகற்றவும் அல்லது மேலும் உறுப்பினர்கள் தொடர பணம் செலுத்துங்கள்.

source: Number of users is invalid
ta: பயனர்களின் எண்ணிக்கை தவறானது

# NUMBER_OF_USERS_MUST_BE_LESS_THAN
source: Number of users must be less than {0}
ta: பயனர்களின் எண்ணிக்கை {0 than ஐ விட குறைவாக இருக்க வேண்டும்

# NUMBER_OF_USER_MUST_BE_GREATER_THAN_TOTAL_COMPANY_APPLICATION_USERS
source: The number of members must be greater than the currently assigned company members to { application } ({ numberOfMembers }). Please remove some members from { application } or select a greater number to proceed.
ta: உறுப்பினர்களின் எண்ணிக்கை தற்போது நியமிக்கப்பட்ட நிறுவன உறுப்பினர்களை விட { application } ({ numberOfMembers }) க்கு அதிகமாக இருக்க வேண்டும். தயவுசெய்து சில உறுப்பினர்களை {பயன்பாடு இருந்து இலிருந்து அகற்றவும் அல்லது தொடர அதிக எண்ணைத் தேர்ந்தெடுக்கவும்.

source: Official repository
ta: அதிகாரப்பூர்வ களஞ்சியம்

source: Open Source
ta: திறந்த மூல

source: Optional
ta: விரும்பினால்

source: Organization
ta: அமைப்பு

source: Or drag and drop it here
ta: அல்லது அதை இங்கே இழுத்து விடுங்கள்

source: Owner info
ta: உரிமையாளர் செய்தி

source: Owner information
ta: உரிமையாளர் செய்தி

# PAGE_NOT_FOUND
source: Sorry, this page isn't available
ta: மன்னிக்கவும், இந்த பக்கம் கிடைக்கவில்லை

# PAGE_NOT_FOUND_DESCRIPTION
source: The page you were looking for could not be found, but don't let that stop you
ta: நீங்கள் தேடும் பக்கத்தைக் கண்டுபிடிக்க முடியவில்லை, ஆனால் அதைத் தடுக்க வேண்டாம்

source: Paid
ta: பணம்

source: Password
ta: கடவுச்சொல்

# PASSWORDS_NOT_MATCHING_ERROR_MESSAGE
source: Passwords do not match
ta: கடவுச்சொற்கள் பொருந்தவில்லை

source: Password is incorrect
ta: கடவுச்சொல் தவறானது

source: Password is required
ta: கடவுச்சொல் தேவை

# PASSWORD_MIN_LENGTH_MESSAGE
source: at least 12 characters
ta: குறைந்தது 12 எழுத்துக்கள்

# PASSWORD_NOT_STRONG_ENOUGH
source: Password is not strong enough
ta: கடவுச்சொல் போதுமானதாக இல்லை

source: Password recovery
ta: கடவுச்சொல் மீட்பு

# PASSWORD_RECOVERY_ERROR
source: Failed to request password recovery
ta: கடவுச்சொல் மீட்பைக் கோரத் தவறிவிட்டது

# PASSWORD_RECOVERY_RESENT_BUTTON
source: Re-send a recovery link
ta: மீட்பு இணைப்பை மீண்டும் வழங்கவும்

# PASSWORD_RECOVERY_SENT_EMAIL_MESSAGE
source: We've sent a recovery link to:
ta: நாங்கள் ஒரு மீட்பு இணைப்பை அனுப்பியுள்ளோம்:

# PASSWORD_RECOVERY_SENT_EMAIL_TITLE_MESSAGE
source: Done, check your inbox
ta: முடிந்தது, உங்கள் இன்பாக்சை சரிபார்க்கவும்

# PASSWORD_VALIDATOR_TITLE
source: Password must have:
ta: கடவுச்சொல் இருக்க வேண்டும்:

source: Pay
ta: செலுத்துங்கள்

source: Payment info
ta: கட்டண செய்தி

# PAYMENT_INSTRUCTION_OWNER
source: Your company has unpaid invoice(s), go to Invoices tab in Billing page to do the payment.
ta: உங்கள் நிறுவனத்தில் செலுத்தப்படாத விலைப்பட்டியல் உள்ளது), கட்டணம் செலுத்த பட்டியலிடல் பக்கத்தில் உள்ள விலைப்பட்டியல் தாவலுக்குச் செல்லவும்.

source: Payment methods
ta: கட்டண முறைகள்

# PAYMENT_METHODS_BOX_INTRODUCTION
source: You can add or replace payment card
ta: கட்டண அட்டையைச் சேர்க்கலாம் அல்லது மாற்றலாம்

# PAYMENT_METHOD_EXPIRED_MESSAGE
source: Your payment card { brand } { last4 } is expired, we can not charge the money, please check your card or issuer.
ta: உங்கள் கட்டண அட்டை {பிராண்ட் {{ brand } காலாவதியானது, நாங்கள் பணத்தை வசூலிக்க முடியாது, தயவுசெய்து உங்கள் அட்டை அல்லது வழங்குபவரை சரிபார்க்கவும்.

# PAYMENT_METHOD_EXPIRING_MESSAGE
source: Your payment card { brand } { last4 } is going to expired on { expiredDate }, please update your card to prevent payment problems.
ta: உங்கள் கட்டண அட்டை {பிராண்ட் {{ brand } {காலாவதியான டேட் beload இல் காலாவதியாகப் போகிறது, கட்டண சிக்கல்களைத் தடுக்க உங்கள் அட்டையைப் புதுப்பிக்கவும்.

# PAYMENT_METHOD_INVALID_MESSAGE
source: Your payment card { brand } { last4 } is invalid, we can not charge the money, please check your card or issuer.
ta: உங்கள் கட்டண அட்டை {பிராண்ட் {{ brand } தவறானது, நாங்கள் பணத்தை வசூலிக்க முடியாது, தயவுசெய்து உங்கள் அட்டை அல்லது வழங்குநரை சரிபார்க்கவும்.

source: Payment method problem
ta: கட்டண முறை சிக்கல்

source: Payment problem
ta: கட்டண சிக்கல்

source: Pay invoice
ta: விலைப்பட்டியல் செலுத்துங்கள்

source: Pay now
ta: இப்போது செலுத்துங்கள்

source: Period
ta: காலசுழற்சி

source: Personal
ta: தனிப்பட்ட

# PERSONAL_DATA_ACTION
source: Personal data actions
ta: தனிப்பட்ட தரவு நடவடிக்கைகள்

source: Personal info
ta: தனிப்பட்ட செய்தி

source: per user
ta: ஒரு பயனருக்கு

source: per user/month
ta: ஒரு பயனர்/மாதத்திற்கு

source: Phone
ta: தொலைபேசி

source: Phone number is invalid
ta: தொலைபேசி எண் தவறானது

source: Plan
ta: திட்டம்

source: Plans
ta: திட்டங்கள்

source: Please check the verification email at
ta: சரிபார்ப்பு மின்னஞ்சலை சரிபார்க்கவும்

# PLEASE_CHOOSE_PLAN
source: Please choose a plan to continue
ta: தொடர ஒரு திட்டத்தைத் தேர்வுசெய்க

# PLEASE_ENTER_COMPANY_NAME
source: Please enter a name for the company
ta: நிறுவனத்திற்கு ஒரு பெயரை உள்ளிடவும்

source: Please verify that you are not a robot
ta: நீங்கள் ஒரு ரோபோ அல்ல என்பதை சரிபார்க்கவும்

source: Postcode
ta: அஞ்சல் குறியீடு

source: powered by
ta: மூலம் இயக்கப்படுகிறது

source: Price
ta: விலை

source: Privacy
ta: தனியுரிமை

# PRIVACY_MATTERS
source: Your privacy matters
ta: உங்கள் தனியுரிமை முக்கியமானது

source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

source: Private and Secure
ta: தனிப்பட்ட மற்றும் பாதுகாப்பான

source: Proceed to payment
ta: கட்டணத்திற்கு தொடரவும்

source: Processing
ta: செயலாக்கம்

# PRODUCT_DEVELOPMENT_PILLAR_TITLE
source: Our product development pillars
ta: எங்கள் தயாரிப்பு மேம்பாட்டு தூண்கள்

# PROFILE_BOX_DESCRIPTION
source: Add some personal information so your colleagues can recognise you
ta: சில தனிப்பட்ட தகவல்களைச் சேர்க்கவும், இதனால் உங்கள் சகாக்கள் உங்களை அடையாளம் காண முடியும்

source: Profile saved
ta: சுயவிவரம் சேமிக்கப்பட்டது

# PROFILE_SAVE_FAILED
source: Unable to save profile
ta: சுயவிவரத்தை சேமிக்க முடியவில்லை

source: Promo coupon applied
ta: விளம்பர கூப்பன் பயன்படுத்தப்பட்டது

source: Provide more info
ta: மேலும் தகவலை வழங்கவும்

# PROVIDE_PAYMENT_INFO_MESSAGE
source: Your trial period for your company "{0}" will end on {1}. Please fill in the payment method.
ta: உங்கள் நிறுவனத்திற்கான உங்கள் சோதனைக் காலம் "{0}" {1 belown இல் முடிவடையும். கட்டண முறையை நிரப்பவும்.

# PROVIDE_PAYMENT_INFO_MESSAGE_FOR_NON_TRIAL_SUSBCRIPTION
source: Your subscription for your company "{0}" will end on {1}. Please fill in the payment method.
ta: உங்கள் நிறுவனத்திற்கான "{0}" க்கான உங்கள் சந்தா {1 on இல் முடிவடையும். கட்டண முறையை நிரப்பவும்.

source: Quick search
ta: விரைவான தேடல்

source: Reactivate user
ta: பயனரை மீண்டும் செயல்படுத்தவும்

# REACTIVATE_USER_ERROR_MESSAGE
source: Error occured when re-activate user {0}
ta: பயனரை மீண்டும் செயல்படுத்தும்போது பிழை ஏற்பட்டது {0}

# REACTIVATE_USER_SUCCESSFULLY
source: You have re-activated user {0}
ta: நீங்கள் மீண்டும் செயல்படுத்தப்பட்ட பயனரை {0}

# REDUCE_QUANTITY_WARNING_DESCRIPTION
source: You are reducing the number of users for this subscription. The new quantity will be applied after the update immediately. Please make sure before proceeding since this action cannot be undone.
ta: இந்த சந்தாவிற்கான பயனர்களின் எண்ணிக்கையை நீங்கள் குறைக்கிறீர்கள். புதுப்பிப்புக்குப் பிறகு புதிய அளவு உடனடியாக பயன்படுத்தப்படும். இந்த செயலை செயல்தவிர்க்க முடியாது என்பதால் தயவுசெய்து தொடர முன் உறுதிப்படுத்தவும்.

source: Remove
ta: அகற்று

source: Remove image
ta: படத்தை அகற்று

source: Remove invitation
ta: அழைப்பை அகற்று

# REMOVE_INVITATION_MODAL_DESCRIPTION
source: Are you sure you want to remove {0}? The user will no longer be able to register and access your company through this invite.
ta: நீங்கள் {0} ஐ அகற்ற விரும்புகிறீர்களா? இந்த அழைப்பின் மூலம் பயனர் இனி உங்கள் நிறுவனத்தை பதிவு செய்து அணுக முடியாது.

source: Remove member
ta: உறுப்பினரை அகற்று

# REMOVE_PAYMENT_CARD
source: Remove this card
ta: இந்த அட்டையை அகற்று

# REMOVE_PAYMENT_CARD_FAILED
source: Failed to remove a payment card
ta: கட்டண அட்டையை அகற்றுவதில் தோல்வி

# REMOVE_PAYMENT_CARD_SUCCESSFULLY
source: A payment card has been removed
ta: கட்டண அட்டை அகற்றப்பட்டது

# REMOVE_PAYMENT_METHOD_CONFIRMATION
source: Are you sure to delete payment card {0} ?
ta: கட்டண அட்டையை {0 fored ஐ நீக்குவது உறுதி?

# REMOVE_PAYMENT_METHOD_TITLE
source: Remove payment method
ta: கட்டண முறையை அகற்று

source: Remove user
ta: பயனரை அகற்று

# REMOVE_USER_DESCRIPTION_IN_MODAL
source: Are you sure to remove {0}?
ta: {0} ஐ அகற்றுவது உறுதி?

source: Replace
ta: மாற்றவும்

# REPLACE_CARD_WARNING
source: By replacing the new payment card, the current card will be removed.
ta: புதிய கட்டண அட்டையை மாற்றுவதன் மூலம், தற்போதைய அட்டை அகற்றப்படும்.

source: Replace payment card
ta: கட்டண அட்டையை மாற்றவும்

# REPLACE_PAYMENT_CARD_SUCCESSFULLY
source: Replace payment method successfully
ta: கட்டண முறையை வெற்றிகரமாக மாற்றவும்

source: Replace payment method
ta: கட்டண முறையை மாற்றவும்

# REQUIRED_FIELD_ERROR_MESSAGE
source: This field is required
ta: இந்த புலம் தேவை

source: Re-send email
ta: மின்னஞ்சல் மீண்டும் அனுப்பவும்

source: Re-send recovery email failed
ta: மீட்பு மின்னஞ்சல் தோல்வியுற்றது

source: Re-send verification email
ta: சரிபார்ப்பு மின்னஞ்சல் மீண்டும் அனுப்பவும்

source: Re-send verification email failed
ta: மறு அனுப்பும் சரிபார்ப்பு மின்னஞ்சல் தோல்வியடைந்தது

source: Reset password
ta: கடவுச்சொல்லை மீட்டமைக்கவும்

# RESET_PASSWORD_FAILED
source: Unable to reset password
ta: கடவுச்சொல்லை மீட்டமைக்க முடியவில்லை

# RESET_PASSWORD_INSTRUCTION
source: Set a new password and save it
ta: புதிய கடவுச்சொல்லை அமைத்து சேமிக்கவும்

# RESET_PASSWORD_SUCCESSFULLY
source: Done, we’ve reset the password for:
ta: முடிந்தது, இதற்கான கடவுச்சொல்லை மீட்டமைத்துள்ளோம்:

# REVOKE_APPLICATIONS_ON_DEACTIVATE_MESSAGE
source: Also, revoke all applications this user has been assigned.
ta: மேலும், இந்த பயனருக்கு ஒதுக்கப்பட்ட அனைத்து பயன்பாடுகளையும் ரத்து செய்யுங்கள்.

source: Role
ta: பங்கு

source: Roles
ta: பாத்திரங்கள்

# ROLE_ENUM.ADMIN
source: Admin
ta: நிர்வாகி

# ROLE_ENUM.GUEST
source: Guest
ta: விருந்தினர்

# ROLE_ENUM.MEMBER
source: Member
ta: உறுப்பினர்

# ROLE_ENUM.OWNER
source: Owner
ta: உரிமையாளர்

source: Save
ta: சேமி

source: Saved Cards
ta: சேமித்த அட்டைகள்

# SAVED_CARDS_DESCRIPTION
source: You can change your default card, update your information
ta: உங்கள் இயல்புநிலை அட்டையை மாற்றலாம், உங்கள் தகவலைப் புதுப்பிக்கலாம்

# SCHEDULE_DOWNGRADE_SUBSCRIPTION_FAILED
source: Failed to schedule a subscription downgrade
ta: சந்தா தரமிறக்கப்படுவதைத் திட்டமிடுவதில் தோல்வி

# SCHEDULE_DOWNGRADE_SUBSCRIPTION_SUCCESSFUL
source: You have scheduled a subscription downgrade successfully
ta: சந்தா தரமிறக்க நீங்கள் வெற்றிகரமாக திட்டமிட்டுள்ளீர்கள்

source: Search
ta: தேடல்

source: Search for countries
ta: நாடுகளைத் தேடுங்கள்

source: Search for invitations
ta: அழைப்பிதழ்களைத் தேடுங்கள்

source: Search for members
ta: உறுப்பினர்களைத் தேடுங்கள்

# SEARCH_FOR_ORGANIZATIONS
source: Search for the organization's name or code
ta: நிறுவனத்தின் பெயர் அல்லது குறியீட்டைத் தேடுங்கள்

source: See all features
ta: அனைத்து அம்சங்களையும் காண்க

source: Selected
ta: தேர்ந்தெடுக்கப்பட்டது

source: Select company country
ta: நிறுவன நாட்டைத் தேர்ந்தெடுக்கவும்

# SELECT_CSV_FILE_TO_UPLOAD
source: Select a CSV file to upload
ta: பதிவேற்ற ஒரு காபிம கோப்பைத் தேர்ந்தெடுக்கவும்

source: Select new owner
ta: புதிய உரிமையாளரைத் தேர்ந்தெடுக்கவும்

source: Select subscription
ta: சந்தா என்பதைத் தேர்ந்தெடுக்கவும்

source: Select this plan
ta: இந்த திட்டத்தைத் தேர்ந்தெடுக்கவும்

source: Select your country
ta: உங்கள் நாட்டைத் தேர்ந்தெடுக்கவும்

source: Select your language
ta: உங்கள் மொழியைத் தேர்ந்தெடுக்கவும்

source: Select your time zone
ta: உங்கள் நேர மண்டலத்தைத் தேர்ந்தெடுக்கவும்

# SEND_RECOVERY_PASSWORD_LINK_BUTTON
source: Send a recovery link
ta: மீட்பு இணைப்பை அனுப்பவும்

source: Service agreement required
ta: பணி ஒப்பந்தம் தேவை

source: Settings
ta: அமைப்புகள்

# SETTING_ACTION_BOX_DESCRIPTION
source: Specify a time zone for better synchronization
ta: சிறந்த ஒத்திசைவுக்கு நேர மண்டலத்தைக் குறிப்பிடவும்

source: Set a new password and save it
ta: புதிய கடவுச்சொல்லை அமைத்து சேமிக்கவும்

# SET_DEFAULT_PAYMENT_METHOD
source: Set the default payment method
ta: இயல்புநிலை கட்டண முறையை அமைக்கவும்

# SET_DEFAULT_PAYMENT_METHOD_DESCRIPTION_IN_MODAL
source: Do you want to set card {0} ••••{1} as default payment method?
ta: இயல்புநிலை கட்டண முறையாக அட்டை {0} •••• {1} அமைக்க விரும்புகிறீர்களா?

source: Set default payment method successfully
ta: இயல்புநிலை கட்டண முறையை வெற்றிகரமாக அமைக்கவும்

# SET_PASSWORD_INSTRUCTION
source: Create your new password
ta: உங்கள் புதிய கடவுச்சொல்லை உருவாக்கவும்

# SET_PRIMARY_CARD_DESCRIPTION
source: You can change your default card and use it on the current payment
ta: உங்கள் இயல்புநிலை அட்டையை மாற்றி தற்போதைய கட்டணத்தில் பயன்படுத்தலாம்

source: Show CSV template
ta: காபிம வார்ப்புருவைக் காட்டு

source: Sign in
ta: விடுபதிகை

source: Sign out
ta: விடுபதிகை

# SIGN_UP_ERROR
source: Failed to sign up
ta: பதிவுபெறத் தவறிவிட்டது

# SIGN_UP_FORM_SUB_TITLE
source: One account for all products
ta: அனைத்து தயாரிப்புகளுக்கும் ஒரு கணக்கு

# SIGN_UP_FORM_TITLE
source: Get Started
ta: தொடங்கவும்

source: Skip for now
ta: இப்போதைக்கு தவிர்க்கவும்

# SOMETHING_WENT_WRONG_INSTRUCTION
source: You may also refresh the page or try again later.
ta: நீங்கள் பக்கத்தையும் புதுப்பிக்கலாம் அல்லது பின்னர் மீண்டும் முயற்சி செய்யலாம்.

# SOMETHING_WENT_WRONG_WHILE_ASSIGNING_DESCRIPTION
source: Something went wrong while assigning the following users to the application:
ta: பின்வரும் பயனர்களை பயன்பாட்டிற்கு ஒதுக்கும்போது ஏதோ தவறு ஏற்பட்டது:

source: Sorry, something went wrong
ta: மன்னிக்கவும், ஏதோ தவறு நடந்தது

source: Sorting options
ta: வரிசையாக்க விருப்பங்கள்

# SORT_ENUM.COMPANY_NAME_ASCENDING
source: Company name ascending
ta: நிறுவனத்தின் பெயர் ஏறுதல்

# SORT_ENUM.COMPANY_NAME_DESCENDING
source: Company name descending
ta: நிறுவனத்தின் பெயர் இறங்கு

# SORT_ENUM.EMAIL_ASCENDING
source: By email (A-Z)
ta: மின்னஞ்சல் மூலம் (A-Z)

# SORT_ENUM.EMAIL_DESCENDING
source: By email (Z-A)
ta: மின்னஞ்சல் மூலம் (Z-A)
