Repository: 247i/TACETr
Catalog: உரை/தானி/linagora-linshare-mobile-*.po
Languages: ta

source: Initializing data...
ta: தரவைத் தொடங்குதல் ...

# login_text_slogan
source: Store and share your files from anywhere
ta: உங்கள் கோப்புகளை எங்கிருந்தும் சேமித்து பகிரவும்

# login_text_login_to_continue
source: Please login to continue
ta: தொடர உள்நுழைக

source: email
ta: மின்னஞ்சல்

source: password
ta: கடவுச்சொல்

# login_button_login
source: Log in
ta: புகுபதிகை

# upload_file_title
source: Upload file
ta: கோப்பைப் பதிவேற்றவும்

# upload_text_button
source: Upload to My Space
ta: எனது இடத்திற்கு பதிவேற்றவும்

# my_space_title
source: My Space
ta: என் இடம்

# upload_prepare_text
source: Preparing to upload...
ta: பதிவேற்றத் தயாராகிறது ...

# my_space_text_upload_your_files_here
source: Upload your files here
ta: உங்கள் கோப்புகளை இங்கே பதிவேற்றவும்

# upload_failure_text
source: Failed to upload file
ta: கோப்பைப் பதிவேற்றத் தவறிவிட்டது

# upload_success_text
source: File uploaded
ta: கோப்பு பதிவேற்றப்பட்டது

# wrong_url_message
source: Server URL is not valid, please try again
ta: சேவையக முகவரி செல்லுபடியாகாது, தயவுசெய்து மீண்டும் முயற்சிக்கவும்

# credential_error_message
source: Authentication failed, either the email or the password is invalid, please try again
ta: ஏற்பு தோல்வியுற்றது, மின்னஞ்சல் அல்லது கடவுச்சொல் தவறானது, தயவுசெய்து மீண்டும் முயற்சிக்கவும்

# unknown_error_login_message
source: Unknown error occurred, please try again
ta: தெரியாத பிழை ஏற்பட்டது, தயவுசெய்து மீண்டும் முயற்சிக்கவும்

source: Download to device
ta: சாதனத்திற்கு பதிவிறக்கவும்

source: Share
ta: பங்கு

# title_quick_share
source: Quick Share
ta: விரைவான பங்கு

source: Add recipients
ta: பெறுநர்களைச் சேர்க்கவும்

source: Add people
ta: மக்களைச் சேர்க்கவும்

# file_has_been_successfully_shared
source: {sharesNumber,plural, =1{The file has been successfully shared}other{The files have been successfully shared}}
ta: {சேர்ச்நம்பர், பன்மை, = 1 {The file has been successfully shared} பிற {The files have been successfully shared}}

# file_could_not_be_share
source: The file could not be shared
ta: கோப்பைப் பகிர முடியவில்லை

# item_last_modified
source: Modified {dateString}
ta: மாற்றியமைக்கப்பட்ட {dateString}

source: My Space
ta: என் இடம்

# common_error_occured_message
source: Unexpected error occurs Please reload or try again later
ta: எதிர்பாராத பிழை ஏற்படுகிறது தயவுசெய்து மீண்டும் ஏற்றவும் அல்லது பின்னர் மீண்டும் முயற்சிக்கவும்

source: Export file
ta: ஏற்றுமதி கோப்பு

source: Preparing to export
ta: ஏற்றுமதி செய்யத் தயாராகிறது

source: Cancel
ta: ரத்துசெய்

# downloading_file
source: Downloading {fileName}
ta: பதிவிறக்கம் {fileName}

source: Log out
ta: விடுபதிகை

# confirm_remove_account_title
source: Are you sure you want to log out of this account ?
ta: இந்த கணக்கிலிருந்து வெளியேற விரும்புகிறீர்களா?

source: Shared space
ta: பகிரப்பட்ட இடம்

# do_not_have_any_workgroup
source: You don't have any workgroup yet
ta: உங்களிடம் இதுவரை எந்த பணிக்குழு இல்லை

# not_have_received_yet
source: View your received shares
ta: நீங்கள் பெறப்பட்ட பங்குகளை காண்க

source: Unknown user
ta: தெரியாத பயனர்

# upload_and_share_button
source: Upload and Share
ta: பதிவேற்றி பகிரவும்

# sharing_single_after_uploaded_success
source: The file is uploaded and shared with {recipientName}
ta: கோப்பு பதிவேற்றப்பட்டு {பெறுநர் பெயர் with உடன் பகிரப்படுகிறது

# sharing_multiple_after_uploaded_success
source: The file is uploaded and shared with {numberOfRecipients} people
ta: கோப்பு பதிவேற்றப்பட்டு {numberOfRecipients} நபர்களுடன் பகிரப்படுகிறது

# sharing_after_uploaded_failure
source: The file will be ready for upload and sharing once connection is available
ta: இணைப்பு கிடைத்தவுடன் பதிவேற்றம் மற்றும் பகிர்வுக்கு கோப்பு தயாராக இருக்கும்

# workgroup_nodes_surfing_root_back_title
source: Back to Shared Space
ta: பகிரப்பட்ட இடத்திற்குத் திரும்பு

# workgroup_nodes_surfing_sort_type_title
source: Modification date
ta: மாற்றும் தேதி

source: Destination
ta: இலக்கு

source: Upload to Workspace
ta: பணியிடத்தில் பதிவேற்றவும்

source: Photos and Videos
ta: புகைப்படங்கள் மற்றும் வீடியோக்கள்

source: Browse
ta: உலாவு

source: Select all
ta: அனைத்தையும் தெரிவுசெய்

source: Unselect all
ta: அனைத்தையும் தேர்வு செய்யுங்கள்

# items
source: {numberOfItems,plural, =0{No item}=1{{numberOfItems} item}other{{numberOfItems} items}}
ta: {numberofitems, பன்மை, = 0 {No item} = 1 {{numberOfItems} பொருள்} பிற {{numberOfItems} உருப்படிகள்}}

# items_selected
source: {numberOfItems,plural, =1{{numberOfItems} item selected}other{{numberOfItems} items selected}}
ta: {numberofitems, பன்மை, = 1 {{numberOfItems} தேர்ந்தெடுக்கப்பட்ட உருப்படி} பிற {{numberOfItems} தேர்ந்தெடுக்கப்பட்ட உருப்படிகள்}}

# uploading_files_status_title
source: Uploading files
ta: கோப்புகளை பதிவேற்றுகிறது

# uploading_files_view_button
source: View
ta: பார்வை

# current_uploads_screen_title
source: Current uploads
ta: தற்போதைய பதிவேற்றங்கள்

# current_uploads_my_space_tab
source: My Space
ta: என் இடம்

# current_uploads_shared_space_tab
source: Shared Space
ta: பகிரப்பட்ட இடம்

# current_uploads_waiting_status
source: Waiting
ta: காத்திருக்கிறது

# current_uploads_uploading_status
source: Uploading
ta: பதிவேற்றம்

# current_uploads_upload_failed_status
source: Upload failed
ta: பதிவேற்றம் தோல்வியடைந்தது

# current_uploads_share_failed_status
source: Share failed
ta: பங்கு தோல்வியடைந்தது

# current_uploads_succeed_status
source: Completed
ta: முடிந்தது

source: Pick the destination
ta: இலக்கைத் தேர்ந்தெடுங்கள்

source: copy here
ta: இங்கே நகலெடுக்கவும்

source: Copy to a workgroup
ta: ஒரு பணிக்குழுவில் நகலெடுக்கவும்

source: The file is copied to a Shared space
ta: கோப்பு பகிரப்பட்ட இடத்திற்கு நகலெடுக்கப்படுகிறது

source: Can not copy file to Shared space
ta: பகிரப்பட்ட இடத்திற்கு கோப்பை நகலெடுக்க முடியாது

source: Some items could not be copied to Shared space
ta: சில பொருட்களை பகிரப்பட்ட இடத்திற்கு நகலெடுக்க முடியவில்லை

# are_you_sure_you_want_to_delete_multiple
source: {numberOfItems,plural, =1{Are you sure you want to delete "{singleItemName}"?}other{Are you sure you want to delete {numberOfItems} items?}}
ta: {numberofitems, பன்மை, = 1 {நீங்கள் நிச்சயமாக "{singleItemName}" ஐ நீக்க விரும்புகிறீர்களா?

source: The file has been successfully deleted
ta: கோப்பு வெற்றிகரமாக நீக்கப்பட்டது

source: Files have been successfully deleted
ta: கோப்புகள் வெற்றிகரமாக நீக்கப்பட்டுள்ளன

source: The file could not be deleted
ta: கோப்பை நீக்க முடியவில்லை

source: Files could not be deleted
ta: கோப்புகளை நீக்க முடியவில்லை

source: Some items could not be deleted
ta: சில பொருட்களை நீக்க முடியவில்லை

source: Some items are successfully deleted
ta: சில உருப்படிகள் வெற்றிகரமாக நீக்கப்படுகின்றன

# downloading_files
source: {numberOfFiles,plural, =1{Downloading {numberOfFiles} file}other{Downloading {numberOfFiles} files}}
ta: {numberOffiles, பன்மை, = 1 {பதிவிறக்கம் {numberOfFiles} file} பிற {பதிவிறக்கம் {numberOfFiles} கோப்புகள்}}

source: Delete
ta: நீக்கு

# can_not_connect_network
source: Cannot connect to the network
ta: பிணையத்துடன் இணைக்க முடியாது

# can_not_proceed_while_offline
source: Cannot process while offline
ta: ஆஃப்லைனில் இருக்கும்போது செயலாக்க முடியாது

source: choose
ta: தேர்வு

# account_details_title
source: Account Details
ta: கணக்கு விவரங்கள்

source: Account details
ta: கணக்கு விவரங்கள்

source: First name
ta: முதல் பெயர்

source: Last name
ta: கடைசி பெயர்

source: Last login
ta: கடைசி உள்நுழைவு

source: Available space
ta: கிடைக்கும் இடம்

# available_space_value
source: {usedSpace} on {quota}
ta: {usedSpace}

source: Received shares
ta: பங்குகள் பெற்றன

source: Received
ta: பெறப்பட்டது

# item_created_date
source: Created {dateString}
ta: உருவாக்கப்பட்டது {dateString}

# notEnoughQuota
source: You have reached the max quota of {quota}
ta: {ஒதுக்கீடு of இன் அதிகபட்ச ஒதுக்கீட்டை நீங்கள் அடைந்துவிட்டீர்கள்

# tooBigFiles
source: {nbFiles,plural, =1{{firstElementName} has exceeded the max file of {quota}}other{Some files have exceeded the max file of {quota}}}
ta: {nbfiles, பன்மை, = 1 {{{firstElementName} {quota}} பிற {சில கோப்புகள் {quota}} of இன் அதிகபட்ச கோப்பை மீறிவிட்டன

source: Copy to My Space
ta: எனது இடத்திற்கு நகலெடுக்கவும்

source: The file has been copied successfully
ta: கோப்பு வெற்றிகரமாக நகலெடுக்கப்பட்டுள்ளது

source: The file could not be copied
ta: கோப்பை நகலெடுக்க முடியவில்லை

source: The files could not be copied to My Space
ta: கோப்புகளை எனது இடத்திற்கு நகலெடுக்க முடியவில்லை

source: Some items have been copied to My Space
ta: சில உருப்படிகள் எனது இடத்திற்கு நகலெடுக்கப்பட்டுள்ளன

source: All items have been copied to My Space
ta: எல்லா பொருட்களும் எனது இடத்திற்கு நகலெடுக்கப்பட்டுள்ளன

source: Search in My Space
ta: எனது இடத்தில் தேடுங்கள்

source: Search in Shared Space files
ta: பகிரப்பட்ட விண்வெளி கோப்புகளில் தேடுங்கள்

# results_count
source: {numberOfResults,plural, =0{{numberOfResults} result}=1{{numberOfResults} result}other{{numberOfResults} results}}
ta: {numberofresults, பன்மை, = 0 {{numberOfResults} முடிவு} = 1 {{numberOfResults} முடிவு} பிற {{numberOfResults} முடிவுகள்}}

source: No results found
ta: முடிவுகள் எதுவும் கிடைக்கவில்லை

source: Search in Shared Space
ta: பகிரப்பட்ட இடத்தில் தேடுங்கள்

# shared_spaces_could_not_be_deleted
source: {sharedSpacesNumber,plural, =1{The Shared Space could not be deleted}other{Shared Spaces could not be deleted}}
ta: {பகிரப்பட்ட ச்பேச்நம்பர், பன்மை, = 1 {The Shared Space could not be deleted} பிற {Shared Spaces could not be deleted}}

# shared_space_has_been_deleted
source: The Shared Space has been deleted
ta: பகிரப்பட்ட இடம் நீக்கப்பட்டது

source: All Shared Spaces have been deleted
ta: பகிரப்பட்ட அனைத்து இடங்களும் நீக்கப்பட்டுள்ளன

source: Preview
ta: முன்னோட்டம்

source: No preview available
ta: முன்னோட்டம் எதுவும் கிடைக்கவில்லை

source: Preparing to preview file
ta: கோப்பை முன்னோட்டமிடத் தயாராகிறது

source: Add new file or folder
ta: புதிய கோப்பு அல்லது கோப்புறையைச் சேர்க்கவும்

source: Create folder
ta: கோப்புறையை உருவாக்கவும்

source: New folder
ta: புதிய கோப்புறை

source: Rename
ta: மறுபெயரிடுங்கள்

source: Create new folder
ta: புதிய கோப்புறையை உருவாக்கவும்

source: Modification date
ta: மாற்றும் தேதி

source: Creation date
ta: உருவாக்கும் தேதி

source: Size
ta: அளவு

source: Name
ta: பெயர்

source: Shared
ta: பகிரப்பட்டது

source: Order by
ta: வழங்கியவர்

source: Details
ta: விவரங்கள்

source: Members
ta: உறுப்பினர்கள்

source: Modified
ta: மாற்றியமைக்கப்பட்ட

source: Created
ta: உருவாக்கப்பட்டது

source: My rights
ta: எனது உரிமைகள்

source: Max file size
ta: அதிகபட்ச கோப்பு அளவு

source: Description
ta: விவரம்

source: No description
ta: விளக்கம் இல்லை

source: Copy to
ta: நகலெடுக்கவும்

source: Admin
ta: நிர்வாகி

source: Reader
ta: வாசகர்

source: Contributor
ta: பங்களிப்பாளர்

source: Writer
ta: எழுத்தாளர்

source: Unknown Role
ta: தெரியாத பங்கு

source: Activities
ta: நடவடிக்கைகள்

# audit_log_actor
source: by {actorName}
ta: வழங்கியவர் {actorName}

# audit_action_title_addition
source: Addition:
ta: கூடுதலாக:

# audit_action_title_delete
source: Delete:
ta: நீக்கு:

# audit_action_title_update
source: Update:
ta: புதுப்பிப்பு:

# audit_action_title_create
source: Creation:
ta: படைப்பு:

# audit_action_title_upload
source: Upload file:
ta: கோப்பைப் பதிவேற்றவும்:

# audit_action_title_copy
source: Copy:
ta: நகல்:

# audit_action_title_download
source: Download:
ta: பதிவிறக்கம்:

# audit_action_title_upload_revision
source: Version uploaded:
ta: பதிப்பு பதிவேற்றப்பட்டது:

# audit_action_title_delete_revision
source: Version deleted:
ta: பதிப்பு நீக்கப்பட்டது:

# audit_action_title_restore_revision
source: Restore version:
ta: பதிப்பை மீட்டமை:

# audit_action_title_download_revision
source: Version downloaded:
ta: பதிப்பு பதிவிறக்கம்:

# audit_action_message_create_workgroup_self
source: You have created a new Workgroup : {resourceName}.
ta: நீங்கள் ஒரு புதிய பணிக்குழுவை உருவாக்கியுள்ளீர்கள்: {resourceName}.

# audit_action_message_create_workgroup_other
source: {authorName} has created a new Workgroup : {resourceName}.
ta: {Authorname a ஒரு புதிய பணிக்குழுவை உருவாக்கியுள்ளது: {authorName}.

# audit_action_message_delete_workgroup_self
source: You have deleted the Workgroup : {resourceName}.
ta: நீங்கள் பணிக்குழுவை நீக்கிவிட்டீர்கள்: {resourceName}.

# audit_action_message_delete_workgroup_other
source: {authorName} has deleted the Workgroup : {resourceName}.
ta: {authorName} பணிக்குழுவை நீக்கிவிட்டது: {resourceName}.

# audit_action_message_update_workgroup_self
source: You have edited the Workgroup : {resourceName}.
ta: நீங்கள் பணிக்குழுவைத் திருத்தியுள்ளீர்கள்: {resourceName}.

# audit_action_message_update_workgroup_other
source: {authorName} has edited the Workgroup : {resourceName}.
ta: {authorName} பணிக்குழுவைத் திருத்தியுள்ளது: {resourceName}.

# audit_action_message_add_member_self
source: You have added a new member : {resourceName} to the Workgroup : {nameVarious}.
ta: நீங்கள் ஒரு புதிய உறுப்பினரைச் சேர்த்துள்ளீர்கள்: {resourceName} பணிக்குழுவில்: {nameVarious}.

# audit_action_message_add_member_other
source: {authorName} has added a new member : {resourceName} to the Workgroup : {nameVarious}.
ta: {Authorname a ஒரு புதிய உறுப்பினரைச் சேர்த்தது: {authorName} பணிக்குழுவில்: {resourceName}.

# audit_action_message_delete_member_self
source: You have removed the member : {resourceName} from the Workgroup : {nameVarious}.
ta: நீங்கள் உறுப்பினரை அகற்றிவிட்டீர்கள்: {ரிசோர்செனேம் the பணிக்குழுவிலிருந்து: {resourceName}.

# audit_action_message_delete_member_other
source: {authorName} has removed the member : {resourceName} from the Workgroup : {nameVarious}.
ta: {Authorname member உறுப்பினரை நீக்கிவிட்டது: {authorName} பணிக்குழுவிலிருந்து: {resourceName}.

# audit_action_message_update_member_self
source: You have edited the member : {resourceName} from the Workgroup : {nameVarious}.
ta: நீங்கள் உறுப்பினரைத் திருத்தியுள்ளீர்கள்: {ரிசோர்செனேம் வேலை பணிக்குழுவிலிருந்து: {resourceName}.

# audit_action_message_update_member_other
source: {authorName} has edited the member : {resourceName} from the Workgroup : {nameVarious}.
ta: {authorname member உறுப்பினரைத் திருத்தியுள்ளார்: {ரிசோர்செநாம் வேலை பணிக்குழுவிலிருந்து: {authorName}.

# audit_action_message_create_folder_self
source: You have created a new folder : {resourceName} into the Workgroup {nameVarious}.
ta: நீங்கள் ஒரு புதிய கோப்புறையை உருவாக்கியுள்ளீர்கள்: {resourceName} பணிக்குழுவில் {nameVarious}.

# audit_action_message_create_folder_other
source: {authorName} has created a new folder : {resourceName} into the Workgroup {nameVarious}.
ta: {Authorname a ஒரு புதிய கோப்புறையை உருவாக்கியுள்ளது: {authorName} பணிக்குழுவில் {resourceName}.

# audit_action_message_delete_folder_self
source: You have deleted the folder : {resourceName} from the Workgroup : {nameVarious}.
ta: நீங்கள் கோப்புறையை நீக்கிவிட்டீர்கள்: {ரிசோர்ச்அனேம் வேலை பணிக்குழுவிலிருந்து: {resourceName}.

# audit_action_message_delete_folder_other
source: {authorName} has deleted the folder : {resourceName} from the Workgroup : {nameVarious}.
ta: {Authorname the கோப்புறையை நீக்கிவிட்டது: {ரிசோர்ச்அனேம் வேலை பணிக்குழுவிலிருந்து: {authorName}.

# audit_action_message_update_folder_self
source: You have edited the folder : {resourceName} from the Workgroup : {nameVarious}.
ta: நீங்கள் கோப்புறையைத் திருத்தியுள்ளீர்கள்: {ரிசோர்ச்அனேம் வேலை பணிக்குழுவிலிருந்து: {resourceName}.

# audit_action_message_update_folder_other
source: {authorName} has edited the folder : {resourceName} from the Workgroup : {nameVarious}.
ta: {Authorname the கோப்புறையை திருத்தியுள்ளது: {ரிசோர்ச்அனேம் வேலை பணிக்குழுவிலிருந்து: {authorName}.

# audit_action_message_download_folder_self
source: You have downloaded the folder : {resourceName} from the Workgroup : {nameVarious}.
ta: பணிக்குழுவிலிருந்து கோப்புறையை பதிவிறக்கம் செய்துள்ளீர்கள்: {ரிசோர்செனேம்: {resourceName}.

# audit_action_message_download_folder_other
source: {authorName} has downloaded the folder : {resourceName} from the Workgroup : {nameVarious}.
ta: {authorName} பணிக்குழுவிலிருந்து கோப்புறையை பதிவிறக்கம் செய்துள்ளது: {ரிசோர்சென் பெயர்: {resourceName}.

# audit_action_message_delete_workgroup_document_self
source: You have deleted the file : {resourceName} from the Workgroup {nameVarious}.
ta: நீங்கள் கோப்பை நீக்கிவிட்டீர்கள்: {ரிசோர்செநாம் வேலை பணிக்குழுவிலிருந்து {resourceName}.

# audit_action_message_delete_workgroup_document_other
source: {authorName} has deleted the file : {resourceName} from the Workgroup {nameVarious}.
ta: {authorName} கோப்பை நீக்கிவிட்டது: {resourceName} பணிக்குழுவிலிருந்து {nameVarious}.

# audit_action_message_update_workgroup_document_self
source: You have edited the file : {resourceName} from the Workgroup {nameVarious}.
ta: பணிக்குழுவிலிருந்து {resourcename the பணிக்குழுவிலிருந்து கோப்பை திருத்தியுள்ளீர்கள்.

# audit_action_message_update_workgroup_document_other
source: {authorName} has edited the file : {resourceName} from the Workgroup {nameVarious}.
ta: {authorName} பணிக்குழுவிலிருந்து {resourcename the கோப்பைத் திருத்தியுள்ளது {resourceName}.

# audit_action_message_download_workgroup_document_self
source: You have downloaded the file : {resourceName} from the Workgroup {nameVarious}.
ta: பணிக்குழுவிலிருந்து {resourcename the கோப்பை பதிவிறக்கம் செய்துள்ளீர்கள் {resourceName}.

# audit_action_message_download_workgroup_document_other
source: {authorName} has downloaded the file : {resourceName} from the Workgroup {nameVarious}.
ta: {authorName} பணிக்குழுவிலிருந்து {resourcename the கோப்பைப் பதிவிறக்கம் செய்துள்ளது {resourceName}.

# audit_action_message_upload_workgroup_document_self
source: You have uploaded a new file : {resourceName} into the Workgroup : {nameVarious}.
ta: நீங்கள் ஒரு புதிய கோப்பை பதிவேற்றியுள்ளீர்கள்: {resourceName} பணிக்குழுவில்: {nameVarious}.

# audit_action_message_upload_workgroup_document_other
source: {authorName} has uploaded a new file : {resourceName} into the Workgroup : {nameVarious}.
ta: {Authorname a ஒரு புதிய கோப்பை பதிவேற்றியுள்ளது: {authorName} பணிக்குழுவில்: {resourceName}.

# audit_action_message_copy_document_from_personal_space_self
source: You have created the document : {resourceName} into {nameVarious}, from your Personal Space.
ta: உங்கள் தனிப்பட்ட இடத்திலிருந்து {resourceName} க்குள் ஆவணத்தை உருவாக்கியுள்ளீர்கள்.

# audit_action_message_copy_document_from_personal_space_other
source: {authorName} has created the document : {resourceName} into {nameVarious}, from his Personal Space.
ta: {Authorname the ஆவணத்தை உருவாக்கியுள்ளது: {authorName} {resourceName}, அவரது தனிப்பட்ட இடத்திலிருந்து.

# audit_action_message_copy_document_from_received_share_self
source: You have created the document : {resourceName} into {nameVarious}, from your received shares.
ta: நீங்கள் பெறப்பட்ட பங்குகளிலிருந்து {resourceName} க்குள் ஆவணத்தை உருவாக்கியுள்ளீர்கள்.

# audit_action_message_copy_document_from_received_share_other
source: {authorName} has created the document : {resourceName} into {nameVarious}, from his received shares.
ta: {Authorname the ஆவணத்தை உருவாக்கியுள்ளது: {authorName} {resourceName}, அவர் பெறப்பட்ட பங்குகளிலிருந்து.

# audit_action_message_copy_document_from_shared_space_self
source: You have created this file by copying : {resourceName} from another Workgroup.
ta: நகலெடுப்பதன் மூலம் இந்த கோப்பை உருவாக்கியுள்ளீர்கள்: {ரிசோர்ச்அனேம் the மற்றொரு பணிக்குழுவிலிருந்து.

# audit_action_message_copy_document_from_shared_space_other
source: {authorName} has created this file by copying : {resourceName} from another Workgroup.
ta: {Authorname the இந்த கோப்பை நகலெடுப்பதன் மூலம் உருவாக்கியுள்ளது: {ரிசோர்செனேம் மற்றொரு பணிக்குழுவிலிருந்து.

# audit_action_message_copy_document_to_personal_space_self
source: You have copied the document : {resourceName} into your Personal Space.
ta: உங்கள் தனிப்பட்ட இடத்தில் ஆவணத்தை நகலெடுத்துள்ளீர்கள்: {ரிசோர்செபேம்.

# audit_action_message_copy_document_to_personal_space_other
source: {authorName} has copied the document : {resourceName} into his Personal Space.
ta: {Authorname the ஆவணத்தை நகலெடுத்துள்ளது: {authorName} அவரது தனிப்பட்ட இடத்தில்.

# audit_action_message_copy_document_to_shared_space_self
source: You have created a duplicated of this file into {nameVarious}.
ta: இந்த கோப்பின் நகல் {nameVarious} இல் உருவாக்கியுள்ளீர்கள்.

# audit_action_message_copy_document_to_shared_space_other
source: {authorName} has created a duplicated of this file into {nameVarious}.
ta: {authorname the இந்த கோப்பின் நகல் {authorName} இல் உருவாக்கியுள்ளது.

# audit_action_message_upload_revision
source: A version of the file {resourceName} has been added in the workgroup {nameVarious}.
ta: {ரிசோர்ச்நேம் the கோப்பின் பதிப்பு {பெயர்வார்ட்டில் பணிக்குழுவில் சேர்க்கப்பட்டுள்ளது.

# audit_action_message_delete_revision
source: The version of the file {resourceName} had been removed from the workgroup {nameVarious}.
ta: {resourceName} கோப்பின் பதிப்பு {பெயர்வாரியசிலிருந்து பணிக்குழுவிலிருந்து அகற்றப்பட்டது.

# audit_action_message_copy_revision_from_shared_space
source: The document was restore with the version {resourceName}.
ta: ஆவணம் {resourceName} மூலம் ஆவணம் மீட்டெடுக்கப்பட்டது.

# audit_action_message_download_revision
source: {authorName} has downloaded the version : {resourceName} from the workgroup {nameVarious}.
ta: {authorName} பதிப்பைப் பதிவிறக்கம் செய்துள்ளது: {resourceName} பணிக்குழுவிலிருந்து {nameVarious}.

source: Me
ta: நான்

source: Second factor Authentication is required for your account
ta: உங்கள் கணக்கிற்கு இரண்டாவது காரணி ஏற்பு தேவை

source: Please enable Second factor Authentication to continue
ta: தொடர இரண்டாவது காரணி அங்கீகாரத்தை இயக்கவும்

source: Go to Setup
ta: அமைப்புக்குச் செல்லுங்கள்

source: SECOND FACTOR AUTHENTICATION
ta: இரண்டாவது காரணி ஏற்பு

# input_6_digit_from_free_otp
source: Input the 6-digit code in your FreeOTP app
ta: உங்கள் ஃப்ரீஓடிபி பயன்பாட்டில் 6 இலக்க குறியீட்டை உள்ளிடவும்

source: Submit
ta: சமர்ப்பிக்கவும்

source: Please fill up all numbers
ta: எல்லா எண்களையும் நிரப்பவும்

source: Invalid OTP
ta: தவறான OTP

# user_locked_message
source: Sorry! Your account is locked Please contact the support to unlock!
ta: மன்னிக்கவும்! உங்கள் கணக்கு பூட்டப்பட்டுள்ளது திறக்க ஆதரவைத் தொடர்பு கொள்ளவும்!

source: Create new workgroup
ta: புதிய பணிக்குழுவை உருவாக்கவும்

source: New Workgroup
ta: புதிய பணிக்குழு

source: Create
ta: உருவாக்கு

# rename_node
source: Rename {nodeName}
ta: {nodeName} என மறுபெயரிடுங்கள்

source: Workgroup
ta: பணிக்குழு

source: File
ta: கோப்பு

source: Folder
ta: கோப்புறை

# node_name_not_empty
source: {nodeName} name cannot be blank
ta: {nodeName} பெயர் காலியாக இருக்க முடியாது

# node_name_already_exists
source: {nodeName} name already exists
ta: {nodeName} பெயர் ஏற்கனவே உள்ளது

# node_name_contain_special_character
source: {nodeName} name cannot contain special characters
ta: {nodeName} பெயரில் சிறப்பு எழுத்துக்கள் இருக்க முடியாது

# node_name_contain_last_dot
source: {nodeName} name cannot finishes by character "."
ta: {nodeName} பெயர் எழுத்துக்குறி மூலம் முடிக்க முடியாது. "

source: Add team members
ta: குழு உறுப்பினர்களைச் சேர்க்கவும்

# existing_members
source: {nbMembers,plural, =1{Existing member: {nbMembers}}other{Existing members: {nbMembers}}}
ta: {nbmembers, பன்மை, = 1 {இருக்கும் உறுப்பினர்: {nbMembers}} பிற {இருக்கும் உறுப்பினர்கள்: {nbMembers}}}

source: The file has been successfully renamed
ta: கோப்பு வெற்றிகரமாக மறுபெயரிடப்பட்டது

source: The file could not be renamed
ta: கோப்பை மறுபெயரிட முடியவில்லை

source: Sender
ta: அனுப்புநர்

# search_in_my_received_shares
source: Search in Received Shares
ta: பெறப்பட்ட பங்குகளில் தேடுங்கள்

# are_you_sure_you_want_to_delete_member
source: Are you sure you want to delete {memberName} from {workspaceName}?
ta: {பணியிட பெயர் இருந்து இலிருந்து {உறுப்பினர் பெயர் bed ஐ நீக்க விரும்புகிறீர்களா?

# user_could_not_be_removed
source: The user could not be removed
ta: பயனரை அகற்ற முடியவில்லை

# user_is_successfully_removed
source: The user is successfully removed
ta: பயனர் வெற்றிகரமாக அகற்றப்படுகிறார்
