Repository: 247i/TACETr
Catalog: உரை/தானி/linagora-work-at-home-landing-page-*.po
Languages: ta

# TEAM_FIRST_SECTION_TITLE
source: Dream Team
ta: கனவு குழு

# TELESKOP_DESCRIPTION
source: Revolutionary video conferencing. Multiple participants and high quality of streaming.
ta: புரட்சிகர வீடியோ கான்பரன்சிங். பல பங்கேற்பாளர்கள் மற்றும் ச்ட்ரீமிங்கின் உயர் தகுதி.

# TMAIL_DESCRIPTION
source: Email messaging client based on Apache protocols. Brings new power to email exchange.
ta: அப்பாச்சி நெறிமுறைகளின் அடிப்படையில் மின்னஞ்சல் அனுப்புதல் கிளையன்ட். மின்னஞ்சல் பரிமாற்றத்திற்கு புதிய சக்தியைக் கொண்டுவருகிறது.

# TMAIL_FEATURE_1
source: Mail organizer
ta: அஞ்சல் அமைப்பாளர்

# TMAIL_FEATURE_2
source: Priority mail
ta: முன்னுரிமை அஞ்சல்

# TMAIL_FEATURE_3
source: Smart response
ta: அறிவுள்ள பதில்

# TMAIL_FEATURE_4
source: Team calendar
ta: அணி நாட்காட்டி

# TMAIL_SHORT_DESCRIPTION
source: T-mail is an open-source e-mail client for collaborative work.
ta: டி-மெயில் என்பது கூட்டு வேலைக்கான திறந்த மூல மின்னஞ்சல் வாங்கி ஆகும்.

source: Total SA
ta: மொத்த சோகம்

# TRUST_SECTION_DESCRIPTION
source: Work@Home is powered by Linagora, trusted by more than 3000 organizations around the world to improve their organizational productivity
ta: வேலை@வீடு லினகோராவால் இயக்கப்படுகிறது, இது அவர்களின் நிறுவன உற்பத்தித்திறனை மேம்படுத்த உலகெங்கிலும் உள்ள 3000 க்கும் மேற்பட்ட அமைப்புகளால் நம்பப்படுகிறது

# TRUST_SECTION_TITLE
source: Trusted by top performers
ta: சிறந்த நடிகர்களால் நம்பப்படுகிறது

# TWAKE_DESCRIPTION
source: Messenger for team collaboration with admin panel that contains all management tools in place.
ta: அனைத்து நிர்வாக கருவிகளையும் கொண்ட நிர்வாகக் குழுவுடன் குழு ஒத்துழைப்புக்கான மெசஞ்சர்.

source: Twake Lead Developer
ta: முன்னணி டெவலப்பரை வெளிப்படுத்தவும்

# TWAKE_SHORT_DESCRIPTION
source: Twake is an open-source collaboration platform created to improve team organization that combines T-mail, LinShare and Teleskope, a video conferencing platform.
ta: வீடியோ கான்பரன்சிங் தளமான டி-மெயில், லின்சேர் மற்றும் டெலிச்கோப் ஆகியவற்றை ஒருங்கிணைக்கும் குழு அமைப்பை மேம்படுத்துவதற்காக உருவாக்கப்பட்ட திறந்த மூல ஒத்துழைப்பு தளமாகும்.

# YAZID_BENAZZOUZ_SUMMARY
source: Yazid Benazzouz received his Ph.D. in 2011 in computer science from the National Graduate Engineering School of Saint-Etienne (EMSE). Since December 2015, he has held the position of research engineer at LINAGORA and has become a regular contributor to the C2NET European project. Previously, he was involved in several European projects such as OUTSMART, MIDAS, BUTLER and CLOUT. He has also participated in the french project BlueSky.
ta: யாசித் பெனாசோச் தனது பி.எச்.டி. 2011 ஆம் ஆண்டில் செயிண்ட்-எட்டியென் (ஈ.எம்.எச்.இ) தேசிய பட்டதாரி பொறியியல் பள்ளியில் இருந்து கணினி அறிவியலில். டிசம்பர் 2015 முதல், அவர் லினகோராவில் ஆராய்ச்சி பொறியாளர் பதவியை வகித்துள்ளார், மேலும் சி 2 நெட் ஐரோப்பிய திட்டத்திற்கு வழக்கமான பங்களிப்பாளராகிவிட்டார். முன்னதாக, அவர் அவுட்ச்மார்ட், மிடாச், பட்லர் மற்றும் முகில் போன்ற பல ஐரோப்பிய திட்டங்களில் ஈடுபட்டார். அவர் பிரெஞ்சு திட்டமான ப்ளூச்கியிலும் பங்கேற்றுள்ளார்.

# ZIED_SELLAMI_SUMMARY
source: Zied Sellami joined LINAGORA in September 2016, after obtaining a Ph.D. in Artificial Intelligence in 2011 from the University of Toulouse and holding various post-doc and industry positions. His research focuses on text-based knowledge engineering, which incorporates elements from the domains of ontology, natural language processing and machine learning. Drawing on this expertise, Zied supervises and participates in the development of innovative functionalities that rely on text processing, including Smart Reply, an automatic email answering solution, and data augmentation for the LinTO platform, which facilitates the creation of new commands for LinTO based on a small starting set. Zied is currently participating in a regional project called Multibot which aims to develop a voice and text chatbot solution for public employees and drivers who wish to report problems on public roads.
ta: பி.எச்.டி. 2011 ஆம் ஆண்டில் துலூச் பல்கலைக்கழகத்தில் செயற்கை நுண்ணறிவில் மற்றும் பல்வேறு பிந்தைய ஆவண மற்றும் தொழில்துறை பதவிகளை வகிக்கிறது. அவரது ஆராய்ச்சி உரை அடிப்படையிலான அறிவு பொறியியலில் கவனம் செலுத்துகிறது, இது ஆன்டாலசி, இயற்கை மொழி செயலாக்கம் மற்றும் இயந்திர கற்றல் களங்களிலிருந்து கூறுகளை உள்ளடக்கியது. இந்த நிபுணத்துவத்தை வரைதல், ZIED உரை செயலாக்கத்தை நம்பியிருக்கும் புதுமையான செயல்பாடுகளின் வளர்ச்சியில் மேற்பார்வையிடுகிறது மற்றும் பங்கேற்கிறது, இதில் அறிவுள்ள பதில், தானியங்கி மின்னஞ்சல் பதிலளிக்கும் தீர்வு மற்றும் லிண்டோ இயங்குதளத்திற்கான தரவு பெருக்குதல் ஆகியவை அடங்கும், இது லிண்டோவிற்கான புதிய கட்டளைகளை உருவாக்க உதவுகிறது ஒரு சிறிய தொடக்க தொகுப்பு. சீட் தற்போது மல்டிபோட் என்ற பிராந்திய திட்டத்தில் பங்கேற்கிறார், இது பொது ஊழியர்கள் மற்றும் பொது சாலைகளில் சிக்கல்களைப் புகாரளிக்க விரும்பும் ஓட்டுநர்களுக்கு குரல் மற்றும் உரை சாட்போட் தீர்வை உருவாக்குவதை நோக்கமாகக் கொண்டுள்ளது.
