Repository: 247i/TACETr
Catalog: உரை/தானி/linagora-twake-console-web-*.po
Languages: ta

# SORT_ENUM.FIRST_NAME_ASCENDING
source: By first name (A-Z)
ta: முதல் பெயரால் (A-Z)

# SORT_ENUM.FIRST_NAME_DESCENDING
source: By first name (Z-A)
ta: முதல் பெயரால் (Z-A)

# SORT_ENUM.LAST_NAME_ASCENDING
source: By last name (A-Z)
ta: கடைசி பெயரால் (A-Z)

# SORT_ENUM.LAST_NAME_DESCENDING
source: By last name (Z-A)
ta: கடைசி பெயரால் (Z-A)

# SORT_ENUM.NO_SORTING
source: By default
ta: இயல்பாக

# SORT_ENUM.ORGANIZATION_NAME_ASCENDING
source: By organization (A-Z)
ta: அமைப்பு மூலம் (A-Z)

# SORT_ENUM.ORGANIZATION_NAME_DESCENDING
source: By organization (Z-A)
ta: அமைப்பு மூலம் (Z-A)

source: Start collaborating
ta: ஒத்துழைக்கத் தொடங்குங்கள்

source: Start using LinShare
ta: லின்சேரைப் பயன்படுத்தத் தொடங்குங்கள்

source: Start using Twake
ta: TOUGH ஐப் பயன்படுத்தத் தொடங்குங்கள்

# STATUS_ENUM.ACTIVE
source: Active
ta: செயலில்

# STATUS_ENUM.DEACTIVATED
source: Deactivated
ta: செயலிழக்கச் செய்தது

# STATUS_ENUM.INVITED
source: Invited
ta: அழைக்கப்பட்டார்

source: Stop cancellation
ta: ரத்து செய்வதை நிறுத்துங்கள்

# STOP_SCHEDULED_CANCELLATION_DESCRIPTION
source: By doing this action, you continue to renew the payment at the end of the period.
ta: இந்த செயலைச் செய்வதன் மூலம், காலத்தின் முடிவில் கட்டணத்தை தொடர்ந்து புதுப்பிக்கிறீர்கள்.

# STOP_SCHEDULED_SUBSCRIPTION_FAILED
source: Remove subscription scheduled cancellation failed
ta: சந்தா திட்டமிடப்பட்ட ரத்து தோல்வியுற்றது

# STOP_SCHEDULED_SUBSCRIPTION_SUCCESSFULLY
source: Remove subscription scheduled cancellation successfully
ta: சந்தா திட்டமிடப்பட்ட ரத்து வெற்றிகரமாக அகற்றவும்

source: Stop subscription cancellation
ta: சந்தா ரத்து செய்வதை நிறுத்துங்கள்

source: Subscription
ta: சந்தா

source: Subscriptions
ta: சந்தாக்கள்

source: Subscription details
ta: சந்தா விவரங்கள்

source: Subscription overview
ta: சந்தா கண்ணோட்டம்

# SUBSCRIPTION_OVERVIEW_DESCRIPTION
source: You are almost done, let's review your custom plan once again and start managing your company.
ta: நீங்கள் கிட்டத்தட்ட முடித்துவிட்டீர்கள், உங்கள் தனிப்பயன் திட்டத்தை மீண்டும் மதிப்பாய்வு செய்து உங்கள் நிறுவனத்தை நிர்வகிக்கத் தொடங்குவோம்.

source: Subscription plan
ta: சந்தா திட்டம்

source: Subscription status
ta: சந்தா நிலை

source: Subscription updated
ta: சந்தா புதுப்பிக்கப்பட்டது

source: Subscription update failed
ta: சந்தா புதுப்பிப்பு தோல்வியடைந்தது

source: Success
ta: செய்

source: Support
ta: உதவி

# TEAM_MAIL_APP_DESCRIPTION
source: Secure email with team work solution.
ta: குழு வேலை தீர்வுடன் பாதுகாப்பான மின்னஞ்சல்.

source: Terms
ta: விதிமுறைகள்

source: Terms of Services
ta: சேவைகளின் விதிமுறைகள்

source: Thank you!
ta: நன்றி!

source: These column names must be in English
ta: இந்த நெடுவரிசை பெயர்கள் ஆங்கிலத்தில் இருக்க வேண்டும்

# THE_RANGE_OF_DATES_MESSAGE
source: The range is from {0} to {1}.
ta: வரம்பு {0} முதல் {1} வரை.

# TILL_DATE
source: Till {0}
ta: {0} வரை

source: Time zone
ta: நேர மண்டலம்

source: To
ta: பெறுநர்

# TOO_MANY_IMPORTING_REQUESTS_MESSAGE
source: Too many importing requests
ta: இறக்குமதி செய்யும் கோரிக்கைகள்

source: Total
ta: மொத்தம்

# TOUR_GUIDE_BOX_DESCRIPTION
source: Learn how to harness all possibilities Console 2.0 provides and manage everything with ease
ta: அனைத்து சாத்தியக்கூறுகளையும் எவ்வாறு பயன்படுத்துவது என்பதை அறிக கன்சோல் 2.0 எல்லாவற்றையும் எளிதாக வழங்குகிறது மற்றும் நிர்வகிக்கிறது

# TOUR_GUIDE_BOX_TITLE
source: Onboarding tour
ta: ஆன் போர்டிங் சுற்றுப்பயணம்

source: to unblock your account.
ta: உங்கள் கணக்கைத் தடுக்க.

# TRACKING_PERSONAL_INFO_MESSAGE
source: We use the collected data to improve your experience and the quality of our services.
ta: உங்கள் அனுபவத்தையும் எங்கள் சேவைகளின் தரத்தையும் மேம்படுத்த சேகரிக்கப்பட்ட தரவைப் பயன்படுத்துகிறோம்.

# TRACKING_PERSONAL_INFO_TITLE
source: Allow the app to collect my personal and usage data.
ta: எனது தனிப்பட்ட மற்றும் பயன்பாட்டு தரவை சேகரிக்க பயன்பாட்டை அனுமதிக்கவும்.

source: Transfer owner
ta: பரிமாற்ற உரிமையாளர்

# TRANSFER_OWNER_DESCRIPTION_1
source: After transferring the ownership, you cannot modify the company payment methods. If you desire to update or remove them, please go to the billing page to manage cards.
ta: உரிமையை மாற்றிய பின், நீங்கள் நிறுவனத்தின் கட்டண முறைகளை மாற்ற முடியாது. அவற்றைப் புதுப்பிக்க அல்லது அகற்ற விரும்பினால், அட்டைகளை நிர்வகிக்க பட்டியலிடல் பக்கத்திற்குச் செல்லவும்.

# TRANSFER_OWNER_DESCRIPTION_2
source: You will become an admin after the process
ta: செயல்முறைக்குப் பிறகு நீங்கள் ஒரு நிர்வாகியாக மாறுவீர்கள்

# TRANSFER_OWNER_FAILED
source: Failed to transfer company owner
ta: நிறுவன உரிமையாளரை மாற்றுவதில் தோல்வி

source: Transfer owner successfully
ta: உரிமையாளரை வெற்றிகரமாக மாற்றவும்

source: Trial period
ta: சோதனைக் காலம்

# TRIAL_PERIOD_UNIT.DAY
source: { count } day | { count } days
ta: { count } நாள் | { count } நாட்கள்

# TRIAL_PERIOD_UNIT.MONTH
source: { count } month | { count } months
ta: { count } மாதம் | { count } மாதங்கள்

# TRUSTED_BY_GOVERNMENT
source: Trusted by governments
ta: அரசாங்கங்களால் நம்பப்படுகிறது

source: Twake
ta: ரோல்

# TWAKE_APP_DESCRIPTION
source: Simple and secure collaboration platform.
ta: எளிய மற்றும் பாதுகாப்பான ஒத்துழைப்பு தளம்.

source: Type
ta: வகை

# UNABLE_LOAD_ESTIMATION_MESSAGE
source: Cannot process payment for now. Please refresh and retry later
ta: இப்போது கட்டணத்தை செயலாக்க முடியாது. தயவுசெய்து புதுப்பித்து மீண்டும் முயற்சிக்கவும்

source: Unknown email address
ta: அறியப்படாத மின்னஞ்சல் முகவரி

source: Unlimited
ta: வரம்பற்றது

source: Unpaid
ta: செலுத்தப்படாதது

# UNPAID_INVOICE
source: Unpaid invoice #{ invoiceId }
ta: செலுத்தப்படாத விலைப்பட்டியல் #{ invoiceId }

source: Unsaved changes
ta: சேமிக்கப்படாத மாற்றங்கள்

# UNSAVED_CHANGES_MESSAGE_1
source: All unsaved changes will be lost
ta: சேமிக்கப்படாத அனைத்து மாற்றங்களும் இழக்கப்படும்

# UNSAVED_CHANGES_MESSAGE_2
source: Are you sure to leave without saving changes?
ta: மாற்றங்களைச் சேமிக்காமல் வெளியேறுவது உறுதி?

# UNSAVED_CHANGES_MESSAGE_3
source: Are you sure you want to cancel this action? The progress will be terminated immediately.
ta: இந்த செயலை ரத்து செய்ய விரும்புகிறீர்களா? முன்னேற்றம் உடனடியாக நிறுத்தப்படும்.

# UNSUPPORTED_FILE_TYPE_MESSAGE
source: Unsupported file type. Only { fileExt } file is accepted. Please upload another file.
ta: ஆதரிக்கப்படாத கோப்பு வகை. { fileExt } கோப்பு மட்டுமே ஏற்றுக்கொள்ளப்படுகிறது. மற்றொரு கோப்பைப் பதிவேற்றவும்.

source: Unsupported guest feature
ta: ஆதரிக்கப்படாத விருந்தினர் நற்பொருத்தம்

# UNSUPPORTED_GUEST_FEATURE_DETAIL
source: Your current subscription does not support guests. Please update your plan to enable the feature.
ta: உங்கள் தற்போதைய சந்தா விருந்தினர்களை ஆதரிக்காது. அம்சத்தை இயக்க உங்கள் திட்டத்தை புதுப்பிக்கவும்.

# UPDATE_PASSWORD_FAILED
source: Unable to change the password
ta: கடவுச்சொல்லை மாற்ற முடியவில்லை

# UPDATE_PASSWORD_SUCCESS
source: New password saved
ta: புதிய கடவுச்சொல் சேமிக்கப்பட்டது

# UPDATE_PREFERENCE_SUCCESS
source: Preferences saved
ta: விருப்பத்தேர்வுகள் சேமிக்கப்பட்டன

# UPDATE_USER_PREFERENCE_FAILED
source: Unable to update the user preferences
ta: பயனர் விருப்பங்களை புதுப்பிக்க முடியவில்லை

source: Upgrade
ta: மேம்படுத்தல்

source: Upgrade now
ta: இப்போது மேம்படுத்தவும்

source: Upgrade subscription
ta: சந்தாவை மேம்படுத்தவும்

source: Upgrade your plan
ta: உங்கள் திட்டத்தை மேம்படுத்தவும்

# UPGRADE_YOUR_PLAN_ADMIN
source: Maximum number of users reached
ta: அதிகபட்ச பயனர்களின் எண்ணிக்கை

# UPGRADE_YOUR_PLAN_ADMIN_DESCRIPTION
source: You have reached the maximum number of users for the current plan. Please contact your company owner for more information.
ta: தற்போதைய திட்டத்திற்கான அதிகபட்ச பயனர்களின் எண்ணிக்கையை நீங்கள் அடைந்துவிட்டீர்கள். மேலும் தகவலுக்கு உங்கள் நிறுவன உரிமையாளரைத் தொடர்பு கொள்ளவும்.

# UPGRADE_YOUR_PLAN_DESCRIPTION
source: Expand member limit and take advantage of extra features
ta: உறுப்பினர் வரம்பை விரிவுபடுத்தி கூடுதல் அம்சங்களைப் பயன்படுத்திக் கொள்ளுங்கள்

# UPGRADE_YOUR_PLAN_OWNER
source: Upgrade your plan
ta: உங்கள் திட்டத்தை மேம்படுத்தவும்

# UPGRADE_YOUR_PLAN_OWNER_DESCRIPTION
source: You have reached the maximum number of users for the current plan. Please upgrade your plan to create more users.
ta: தற்போதைய திட்டத்திற்கான அதிகபட்ச பயனர்களின் எண்ணிக்கையை நீங்கள் அடைந்துவிட்டீர்கள். மேலும் பயனர்களை உருவாக்க உங்கள் திட்டத்தை மேம்படுத்தவும்.

source: Upgrade your subscription
ta: உங்கள் சந்தாவை மேம்படுத்தவும்

source: Uploading file...
ta: பதிவேற்றும் கோப்பு ...

source: Upload failed
ta: பதிவேற்றம் தோல்வியடைந்தது

# UPLOAD_FILE_LIMIT_MSG
source: Maximum size 5 Mb
ta: அதிகபட்ச அளவு 5 எம்பி

# USERS_ALREADY_BELONG_TO_COMPANY_MESSAGE
source: These users already belong to the company:
ta: இந்த பயனர்கள் ஏற்கனவே நிறுவனத்திற்கு சொந்தமானவர்கள்:

# USERS_ALREADY_INVITED_TO_COMPANY_MESSAGE
source: These users have already been invited to the company:
ta: இந்த பயனர்கள் ஏற்கனவே நிறுவனத்திற்கு அழைக்கப்பட்டுள்ளனர்:

# USER_ALREADY_BELONG_TO_LINSHARE_MESSAGE
source: The following users already belong to LinShare in another company, and we do not support multiple LinShare applications for one user:
ta: பின்வரும் பயனர்கள் ஏற்கனவே வேறொரு நிறுவனத்தில் லின்சேரைச் சேர்ந்தவர்கள், ஒரு பயனருக்கான பல லின்சேர் பயன்பாடுகளை நாங்கள் ஆதரிக்கவில்லை:

source: User already created with this email.
ta: இந்த மின்னஞ்சலுடன் பயனர் ஏற்கனவே உருவாக்கியவர்.

source: User already invited with this email.
ta: இந்த மின்னஞ்சலுடன் பயனர் ஏற்கனவே அழைக்கப்பட்டார்.

# USER_DELETED
source: Your account deleted
ta: உங்கள் கணக்கு நீக்கப்பட்டது

# USER_EDITED
source: You have edited
ta: நீங்கள் திருத்தியுள்ளீர்கள்

# USER_INVITATION_MESSAGE.ERROR_EMAIL_LIST
source: An error occurred while inviting the following people:
ta: பின்வரும் நபர்களை அழைக்கும்போது பிழை ஏற்பட்டது:

# USER_INVITATION_MESSAGE.SUCCESS_EMAIL_COUNTER
source: { count } user invited | { count } users invited
ta: { count } பயனர் அழைக்கப்பட்டார் | { count } பயனர்கள் அழைக்கப்பட்டனர்

source: User name
ta: பயனர் பெயர்

source: User role
ta: பயனர் பங்கு

# VALIDATE_CARD_TO_REPLACE_FAILED
source: The current valid payment method {0} has been removed.
ta: தற்போதைய செல்லுபடியாகும் கட்டண முறை {0} அகற்றப்பட்டது.

source: View PDF
ta: PDF ஐக் காண்க

# WARNING_OVER_CAPACITY_FOR_ADMIN
source: The company has reached the maximum number of users {0}. Please contact the company owner for further detail
ta: நிறுவனம் அதிகபட்ச பயனர்களின் எண்ணிக்கையை எட்டியுள்ளது {0}. மேலும் விவரங்களுக்கு நிறுவன உரிமையாளரைத் தொடர்பு கொள்ளவும்

# WARNING_OVER_CAPACITY_TO_ADD_MEMBER
source: You have reached the maximum number of users ({0}). You can only add users as guests. Please upgrade your plan to invite more members.
ta: நீங்கள் அதிகபட்ச பயனர்களின் எண்ணிக்கையை அடைந்துவிட்டீர்கள் ({0}). நீங்கள் பயனர்களை விருந்தினர்களாக மட்டுமே சேர்க்க முடியும். மேலும் உறுப்பினர்களை அழைக்க உங்கள் திட்டத்தை மேம்படுத்தவும்.

source: Website
ta: வலைத்தளம்

source: We are processing your card
ta: நாங்கள் உங்கள் அட்டையை செயலாக்குகிறோம்

source: We will send you a result email later.
ta: ஒரு முடிவு மின்னஞ்சலை பின்னர் உங்களுக்கு அனுப்புவோம்.

source: Year
ta: ஆண்டு

source: Yearly
ta: ஆண்டு

source: Your account has been blocked
ta: உங்கள் கணக்கு தடுக்கப்பட்டுள்ளது

# YOUR_ACCOUNT_HAS_BEEN_BLOCKED_DUE_TO_UNVERIFIED_EMAIL
source: Your account has been blocked due to unverified email address.
ta: சரிபார்க்கப்படாத மின்னஞ்சல் முகவரி காரணமாக உங்கள் கணக்கு தடுக்கப்பட்டுள்ளது.

source: Your account has been deactivated
ta: உங்கள் கணக்கு செயலிழக்கப்பட்டது

# YOUR_ACCOUNT_HAS_BEEN_DEACTIVATED_MESSAGE
source: Your account has been deactivated in the current company. Please contact the company's administrators for further assistance
ta: உங்கள் கணக்கு தற்போதைய நிறுவனத்தில் செயலிழக்கப்பட்டது. மேலதிக உதவிக்கு நிறுவனத்தின் நிர்வாகிகளை தொடர்பு கொள்ளவும்

source: Your subscription has been confirmed
ta: உங்கள் சந்தா உறுதிப்படுத்தப்பட்டுள்ளது
