Repository: 247i/TACETr
Catalog: உரை/தானி/linagora-work-at-home-landing-page-*.po
Languages: ta

# ANTON_SHEPILOV_SUMMARY
source: Anton Shepilov works as a Chief Technical Officer in LINAGORA, managing development of such products as Twake, LinShare and TMail.
ta: அன்டன் செபிலோவ் லினாகோராவில் ஒரு தலைமை தொழில்நுட்ப அதிகாரியாக பணிபுரிகிறார், டூ, லின்சேர் மற்றும் டமெயில் போன்ற தயாரிப்புகளின் வளர்ச்சியை நிர்வகிக்கிறார்.

source: Automatic Computing
ta: தானியங்கி கணினி

# BENOIT_TALLANDIER_SUMMARY
source: Benoît Tallandier was a co-founder and CEO of Twake, a startup acquired by Linagora in June of 2020. He continues to develop Twake as Product Manager.
ta: பெனாய்ட் டல்லண்டியர் 2020 ஆம் ஆண்டு சூன் மாதம் லினகோராவால் கையகப்படுத்தப்பட்ட டவுசின் இணை நிறுவனர் மற்றும் தலைமை நிர்வாக அதிகாரியாக இருந்தார். அவர் தொடர்ந்து தயாரிப்பு மேலாளராக டூக் உருவாக்கி வருகிறார்.

source: BPI France
ta: பிபிஐ பிரான்ச்

source: Business
ta: வணிகம்

source: Coming soon
ta: விரைவில் வரும்

source: Community
ta: சமூகம்

source: Cookie Consent
ta: குக்கீ ஒப்புதல்

# COPYRIGHT_INFO
source: Copyright © 2022 Linagora. All rights reserved.
ta: பதிப்புரிமை © 2022 லினகோரா. அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை.

# DAMIEN_LAINE_SUMMARY
source: Following a number of years as a software engineer, technical lead in IoT startups and entrepreneur, Damien Lainé joined LINAGORA in February 2018 as the R&D team’s engineering manager. His areas of expertise include strategic management of innovation projects, IoT, web technologies, cloud computing, DevSecOps and performance tuning.
ta: மென்பொருள் பொறியாளராக பல ஆண்டுகளைத் தொடர்ந்து, ஐஓடி தொடக்க நிறுவனங்கள் மற்றும் தொழில்முனைவோரில் தொழில்நுட்ப முன்னணி, டேமியன் லெய்னே பிப்ரவரி 2018 இல் ஆர் & டி அணியின் பொறியியல் மேலாளராக லினாகோராவில் சேர்ந்தார். புதுமை திட்டங்கள், ஐஓடி, வலை தொழில்நுட்பங்கள், முகில் கம்ப்யூட்டிங், டெவ்ச்கோப்ச் மற்றும் செயல்திறன் டியூனிங் ஆகியவற்றின் மூலோபாய மேலாண்மை ஆகியவை அவரது நிபுணத்துவம் வாய்ந்த துறைகளில் அடங்கும்.

source: Development Manager
ta: மேம்பாட்டு மேலாளர்

# DEVELOPMENT_PILLAR_SECTION_DESCRIPTION
source: Our product development pillars
ta: எங்கள் தயாரிப்பு மேம்பாட்டு தூண்கள்

# DEVELOPMENT_PILLAR_SECTION_TITLE
source: What are our values?
ta: எங்கள் மதிப்புகள் என்ன?

source: Digital Sovereignty
ta: டிசிட்டல் இறையாண்மை

# DIGITAL_SOVEREIGNTY_DESCRIPTION
source: GAFAM and BATX free European data center Made in France
ta: கஃபம் மற்றும் பேட்எக்ச் இலவசம் ஐரோப்பிய தரவு நடுவண் பிரான்சில் தயாரிக்கப்பட்டது

# DIRECTORATE_GENERAL_FOR_ENTERPRISE
source: Directorate General for Enterprise (DGE)
ta: நிறுவனத்திற்கான இயக்குநரகம் (டிசிஇ)

source: Documentation
ta: ஆவணப்படுத்துதல்

# DOCUMENTATION_FIRST_SECTION_DESCRIPTION
source: Work@Home is an R&D project that is planned to be a compilation of the best projects of LINAGORA. Here you can find links to the corresponding documentation for each part of the Work@Home puzzle.
ta: வேலை@வீடு என்பது ஒரு ஆர் & டி திட்டமாகும், இது லினகோராவின் சிறந்த திட்டங்களின் தொகுப்பாக திட்டமிடப்பட்டுள்ளது. வேலையின் ஒவ்வொரு பகுதிக்கும் தொடர்புடைய ஆவணங்களுக்கான இணைப்புகளை இங்கே காணலாம்@வீட்டு புதிர்.

# DOCUMENTATION_FIRST_SECTION_TITLE
source: Documentation
ta: ஆவணப்படுத்துதல்

source: Education
ta: கல்வி

source: Efficiency
ta: திறன்

# ELECTRICITY_OF_FRANCE
source: Électricité de France
ta: பிரான்சிலிருந்து மின்சாரம்

# EMPOWER_BUSINESS_DESCRIPTION
source: W@H is a perfect tool to bring your team together. There’s no need to use several different apps for videoconferences, sharing documents and communicating with your colleagues: W@H has it all!
ta: W@H என்பது உங்கள் அணியை ஒன்றிணைக்க சரியான கருவியாகும். வீடியோ கான்ஃபெரன்ச், ஆவணங்களைப் பகிர்வது மற்றும் உங்கள் சகாக்களுடன் தொடர்புகொள்வதற்கு பல்வேறு பயன்பாடுகளைப் பயன்படுத்த வேண்டிய அவசியமில்லை: W@h இதையெல்லாம் கொண்டுள்ளது!

# EMPOWER_EDUCATION_DESCRIPTION
source: W@H is a great platform for digitalization of education. Organization of studies is no longer complicated; we've combined everything you could need in one single workspace.
ta: W@H என்பது கல்வியின் டிசிட்டல்மயமாக்கலுக்கான சிறந்த தளமாகும். ஆய்வுகளின் அமைப்பு இனி சிக்கலானது அல்ல; உங்களுக்கு தேவையான அனைத்தையும் ஒரே ஒரு பணியிடத்தில் இணைத்துள்ளோம்.

# EMPOWER_HEALTHCARE_DESCRIPTION
source: W@H brings organization of medical services to a different level. Mail from your patients is now conveniently sorted, any online meetings can be held painlessly and all the information can now be easily accessed by those members of your team that require it. Everything on one single platform!
ta: W@H மருத்துவ சேவைகளின் அமைப்பை வேறு நிலைக்கு கொண்டு வருகிறது. உங்கள் நோயாளிகளிடமிருந்து அஞ்சல் இப்போது வசதியாக வரிசைப்படுத்தப்பட்டுள்ளது, எந்தவொரு நிகழ்நிலை கூட்டங்களையும் வலியின்றி வைக்கலாம், மேலும் அனைத்து தகவல்களையும் இப்போது உங்கள் அணியின் உறுப்பினர்களால் எளிதாக அணுக முடியும். ஒரே ஒரு மேடையில் எல்லாம்!

# EMPOWER_INDUSTRY_DESCRIPTION
source: W@H is a huge help in producing any type of goods. Organizing information and connecting to your team has never been easier!
ta: W@H என்பது எந்தவொரு பொருட்களையும் விளைவாக்கம் செய்வதில் ஒரு பெரிய உதவியாகும். தகவல்களை ஒழுங்கமைப்பது மற்றும் உங்கள் குழுவுடன் இணைப்பது ஒருபோதும் எளிதாக இருந்ததில்லை!

# EMPOWER_SECTION_DESCRIPTION
source: Here are the possible use cases of Work@Home platform after it is ready
ta: வேலை செய்யப்பட்ட பின்னர் வேலை செய்யப்பட்ட பின்னர் அது தயாரிக்கப்பட்ட பிறகு இங்கே

# EMPOWER_SECTION_TITLE
source: Work@Home’s final aim is to empower team collaboration in any domain
ta: வேலை@வீட்டின் இறுதி நோக்கம் எந்தவொரு களத்திலும் குழு ஒத்துழைப்பை மேம்படுத்துவதாகும்

source: European Parliament
ta: ஐரோப்பிய பாராளுமன்றம்

# FEATURE_SECTION_TITLE
source: Features
ta: நற்பொருத்தங்கள்

# FIRST_SECTION_DESCRIPTION
source: Smart collaborative platform for remote work
ta: தொலைநிலை வேலைக்கான அறிவுள்ள கூட்டு தளம்

# FIRST_SECTION_TITLE
source: Work@Home
ta: வேலை@வீடு

# FREDERIC_MARTIN_SUMMARY
source: Frédéric Martin works as a Development Manager of LinShare, private and secure file sharing and cloud storage solution.
ta: ஃப்ரெடெரிக் மார்ட்டின் லின்சேர், தனியார் மற்றும் பாதுகாப்பான கோப்பு பகிர்வு மற்றும் முகில் சேமிப்பக தீர்வின் மேம்பாட்டு மேலாளராக பணிபுரிகிறார்.

# FRENCH_COURT_OF_AUDIT
source: Cour des Comptes
ta: தணிக்கையாளர்களின் அறமன்றம்

# FRENCH_MINISTRY_OF_ECONOMY_AND_FINANCE
source: Ministry of Economy and Finance France
ta: பொருளாதாரம் மற்றும் பொருள் அமைச்சகம் பிரான்ச்

# GOOD_TECH_FOR_GOOD_DESCRIPTION
source: Positive impact on the world! Contribute to UN SDGs! Carbon free by 2030!
ta: உலகில் நேர்மறையான தாக்கம்! ஐ.நா. எச்.டி.சி.எச் -க்கு பங்களிக்கவும்! 2030 க்குள் கார்பன் இலவசம்!

source: Head of R&D Engineering
ta: ஆர் & டி இன்சினியரிங் தலைவர்

source: Healthcare
ta: சுகாதாரம்

source: How to contribute
ta: பங்களிப்பது எப்படி

source: Industry
ta: தொழில்

# INTRODUCTION_SECTION_DESCRIPTION_1
source: Since LINAGORA follows the mission of inventing free and open source ethical software to make the world a better place, it has been decided to develop a solution that would fit remote workers needs but moreover will respect their privacy and provide digital independence. Thus, the Work@Home platform will be based only on open source solutions. Learn more about W@H development here.
ta: உலகத்தை ஒரு சிறந்த இடமாக மாற்றுவதற்காக இலவச மற்றும் திறந்த மூல நெறிமுறை மென்பொருளை கண்டுபிடிக்கும் பணியை லினாகோரா பின்பற்றுவதால், தொலைதூர தொழிலாளர்களின் தேவைகளுக்கு ஏற்ற ஒரு தீர்வை உருவாக்க முடிவு செய்யப்பட்டுள்ளது, ஆனால் மேலும் அவர்களின் தனியுரிமையை மதிக்கும் மற்றும் டிசிட்டல் சுதந்திரத்தை வழங்கும். எனவே, வேலை@வீட்டு தளம் திறந்த மூல தீர்வுகளை மட்டுமே அடிப்படையாகக் கொண்டது. W@h வளர்ச்சி பற்றி இங்கே மேலும் அறிக.

# INTRODUCTION_SECTION_DESCRIPTION_2
source: As more and more employees are expected to be working from home in the coming years for a variety of reasons: ranging from environmental concerns to health crises like that triggered by Covid-19, LINAGORA has set out to create an open, resilient, sovereign and secure work environment to facilitate collaboration between employees working remotely.
ta: பல்வேறு காரணங்களுக்காக வரவிருக்கும் ஆண்டுகளில் அதிகமான ஊழியர்கள் வீட்டிலிருந்து வேலை செய்வார்கள் என்று எதிர்பார்க்கப்படுவதால்: சுற்றுச்சூழல் கவலைகள் முதல் கோவிட் -19 தூண்டப்பட்ட சுகாதார நெருக்கடிகள் வரை, லினாகோரா ஒரு திறந்த, நெகிழ்ச்சியான, இறையாண்மை மற்றும் உருவாக்கத் திட்டமிட்டுள்ளார் தொலைதூரத்தில் பணிபுரியும் ஊழியர்களிடையே ஒத்துழைப்பை எளிதாக்குவதற்கு பாதுகாப்பான பணிச்சூழல்.

# INTRODUCTION_SECTION_TITLE
source: Work@Home is an R&D project under LINAGORA Labs development.
ta: வேலை@வீடு என்பது லினாகோரா லேப்ச் வளர்ச்சியின் கீழ் ஒரு ஆர் & டி திட்டமாகும்.

source: In development
ta: வளர்ச்சியில்

# JEAN_PIERRE_LORRE_SUMMARY
source: As the director of research and development at LINGORA Labs, Jean-Pierre Lorré plays a central role in the definition of LINAGORA’s global strategy for product development, a vision which has guided him in building the strong team of researchers and engineering experts that serve as the innovative engine behind LINAGORA’s products. Jean-Pierre brings industrial and academic expertise in a wide range of topics, including Artificial Intelligence, Automatic Speech Recognition, Natural Language Processing as well as distributed software architecture and open-source models. This broad skill set enables him to tackle important problems in both fundamental research and industrialization, and to play a leading role in over twenty European and French collaborative projects to date.
ta: லிங்கோரா லேப்சில் ஆராய்ச்சி மற்றும் மேம்பாட்டு இயக்குநராக, சீன்-பியர் லோரே தயாரிப்பு மேம்பாட்டுக்கான லினகோராவின் உலகளாவிய மூலோபாயத்தின் வரையறையில் முக்கிய பங்கு வகிக்கிறார், இது ஒரு பார்வை, ஆராய்ச்சியாளர்கள் மற்றும் பொறியியல் நிபுணர்களின் வலுவான குழுவை உருவாக்குவதில் அவருக்கு வழிகாட்டியுள்ளது லினகோராவின் தயாரிப்புகளுக்குப் பின்னால் புதுமையான இயந்திரம். சீன்-பியர் தொழில்துறை மற்றும் கல்வி நிபுணத்துவத்தை செயற்கை நுண்ணறிவு, தானியங்கி பேச்சு ஏற்பு, இயற்கை மொழி செயலாக்கம் மற்றும் விநியோகிக்கப்பட்ட மென்பொருள் கட்டமைப்பு மற்றும் திறந்த மூல மாதிரிகள் உள்ளிட்ட பல்வேறு தலைப்புகளில் கொண்டு வருகிறார். இந்த பரந்த திறன் தொகுப்பு, அடிப்படை ஆராய்ச்சி மற்றும் தொழில்மயமாக்கல் இரண்டிலும் முக்கியமான சிக்கல்களைச் சமாளிக்கவும், இன்றுவரை இருபதுக்கும் மேற்பட்ட ஐரோப்பிய மற்றும் பிரெஞ்சு கூட்டு திட்டங்களில் முக்கிய பங்கு வகிக்கவும் உதவுகிறது.

# KATE_THOMPSON_SUMMARY
source: Kate Thompson is pursuing a doctoral degree with ANITI, LAAS and in collaboration with LINAGORA as a part of the <a class="primary" href="https://anr.fr/fr/plan-de-relance/" target="_blank" rel="noopener noreferrer">France Relance initiative</a>. Her research aims to integrate learning in the fields of Human Robot Interaction and Discourse Semantics in order to develop more sophisticated conversational agents to be used in various industrial contexts. She came to LINAGORA as a research engineer before beginning her doctoral work. Before that she worked as an engineer on the <a class="primary" href="https://www.irit.fr/STAC/index.html" target="_blank" rel="noopener noreferrer">STAC</a> project.
ta: கேட் தாம்சன் <a வகுப்பு = "primal" href = "https://anr.fr/fr/flan-de-de-de-de-de-de-de-de-de-de-de-de-de-de-de-relance/" இலக்கு = "_ பிளாங்க்" rel = "noopener noreferer"> பிரான்ச் ரிலேச் முன்முயற்சி </a>. பல்வேறு தொழில்துறை சூழல்களில் பயன்படுத்தப்பட வேண்டிய அதிநவீன உரையாடல் முகவர்களை வளர்ப்பதற்காக மனித ரோபோ தொடர்பு மற்றும் சொற்பொழிவு சொற்பொருள் துறைகளில் கற்றலை ஒருங்கிணைப்பதை அவரது ஆராய்ச்சி நோக்கமாகக் கொண்டுள்ளது. அவர் தனது முனைவர் பட்டப்படிப்பைத் தொடங்குவதற்கு முன்பு ஒரு ஆராய்ச்சி பொறியாளராக லினாகோராவுக்கு வந்தார். அதற்கு முன் அவர் <a வகுப்பு = "primal" href = "https://www.irit.fr/stac/index.html இல் ஒரு பொறியியலாளராக பணியாற்றினார். a> திட்டம்.

source: Languages
ta: மொழிகள்

source: Learn more about {{ feature }}
ta: {{ feature }} பற்றி மேலும் அறிக

# LINSHARE_DESCRIPTION
source: Secure file sharing with unlimited storage and high upload speed. 100% uptime.
ta: வரம்பற்ற சேமிப்பு மற்றும் அதிக பதிவேற்ற வேகத்துடன் பாதுகாப்பான கோப்பு பகிர்வு. 100% அதிக நேரம்.

# LINSHARE_FEATURE_1
source: File sharing
ta: கோப்பு பகிர்வு

# LINSHARE_FEATURE_2
source: File storage
ta: கோப்பு சேமிப்பு

# LINSHARE_FEATURE_3
source: Activity logs
ta: செயல்பாட்டு பதிவுகள்

# LINSHARE_FEATURE_4
source: Data control
ta: தரவு கட்டுப்பாடு

# LINSHARE_SHORT_DESCRIPTION
source: LinShare is a secure open-source product for file sharing
ta: லின்சேர் என்பது கோப்பு பகிர்வுக்கான பாதுகாப்பான திறந்த மூல தயாரிப்பு ஆகும்

# LINTO_DESCRIPTION
source: Revolutionary voiceover technology enabling multiple industries to perform better.
ta: புரட்சிகர குரல்வழி தொழில்நுட்பம் பல தொழில்களை சிறப்பாகச் செய்ய உதவுகிறது.

# LINTO_FEATURE_1
source: Speech recognition
ta: பேச்சு ஏற்பு

# LINTO_FEATURE_2
source: Voice control
ta: குரல் கட்டுப்பாடு

# LINTO_FEATURE_3
source: Smart transcripts of meetings
ta: கூட்டங்களின் அறிவுள்ள டிரான்ச்கிரிப்டுகள்

# LINTO_SHORT_DESCRIPTION
source: LinTO is an AI-based open-source voice platform.
ta: லிண்டோ AI- அடிப்படையிலான திறந்த மூல குரல் தளம்.

source: Mazars
ta: மசாரச்

source: Mission
ta: மிசன்

# MISSION_ABOUT_BLOCK_DESCRIPTION
source: Work@Home is a research and development project aimed to make remote work more comfortable and efficient both for the employers and the employees. Its goal is to put all of our best products together. Work@Home is to be a collaboration platform of the future constituted under the aegis of BPI France.
ta: வேலை@வீடு என்பது ஒரு ஆராய்ச்சி மற்றும் மேம்பாட்டுத் திட்டமாகும், இது தொலைதூர வேலையை முதலாளிகளுக்கும் ஊழியர்களுக்கும் மிகவும் வசதியாகவும் திறமையாகவும் மாற்றுவதை நோக்கமாகக் கொண்டுள்ளது. எங்கள் சிறந்த தயாரிப்புகள் அனைத்தையும் ஒன்றாக இணைப்பதே இதன் குறிக்கோள். வேலை@வீடு என்பது பிபிஐ பிரான்சின் ஏசிசின் கீழ் அமைக்கப்பட்ட எதிர்காலத்தின் ஒத்துழைப்பு தளமாக இருக்க வேண்டும்.

# MISSION_ABOUT_BLOCK_TITLE
source: What is Work@Home about?
ta: வேலை என்றால் என்ன?

# MISSION_FIRST_SECTION_TITLE
source: Making <highlight>Work@Home</highlight> easier for everyone
ta: <சிறப்பம்சமாக> வேலை@வீடு </சிறப்பம்சமாக> அனைவருக்கும் எளிதானது

# MISSION_HOW_SECTION_DESCRIPTION
source: Work@Home aims to merge all LINAGORA products on one platform for a better user experience
ta: வேலை@முகப்பு அனைத்து லினாகோரா தயாரிப்புகளையும் ஒரு சிறந்த பயனர் அனுபவத்திற்காக ஒரே மேடையில் ஒன்றிணைப்பதை நோக்கமாகக் கொண்டுள்ளது

# MISSION_HOW_SECTION_TITLE
source: How does Work@Home work?
ta: வேலை எவ்வாறு வேலை செய்கிறது?

# MISSION_PERK_FIFTH_BLOCK_DESCRIPTION
source: We are working on developing a knowledge graph within Work@Home. The idea is to consider all interaction data in a single graph-based model to perform the analysis required for the smart functions of Work@Home applications.
ta: வேலைக்குள் ஒரு அறிவு வரைபடத்தை உருவாக்குவதில் நாங்கள் பணியாற்றி வருகிறோம். வேலை@வீட்டு பயன்பாடுகளின் அறிவுள்ள செயல்பாடுகளுக்குத் தேவையான பகுப்பாய்வைச் செய்ய ஒற்றை வரைபட அடிப்படையிலான மாதிரியில் அனைத்து தொடர்பு தரவுகளையும் கருத்தில் கொள்வதே சிந்தனை.

# MISSION_PERK_FIFTH_BLOCK_TITLE
source: Knowledge graph
ta: அறிவு வரைபடம்

# MISSION_PERK_FIRST_BLOCK_DESCRIPTION
source: <highlight>An average person spends around an hour a day commuting to their workplace and back</highlight>, which sums up to a whole week a year spent entirely on a bus or in a car. Remote work helps one save up those precious minutes and use them wisely and efficiently.
ta: <falily> ஒரு சராசரி நபர் ஒரு நாளைக்கு ஒரு மணி நேரத்திற்கு ஒரு மணி நேரத்திற்கு தங்கள் பணியிடத்திற்குச் சென்று பின் </சிறப்பம்சம்> செலவிடுகிறார், இது ஒரு வருடம் முழுவதும் ஒரு பச்சில் அல்லது ஒரு காரில் செலவிடப்படுகிறது. தொலைநிலை வேலை அந்த விலைமதிப்பற்ற நிமிடங்களை சேமித்து அவற்றை புத்திசாலித்தனமாகவும் திறமையாகவும் பயன்படுத்த உதவுகிறது.

# MISSION_PERK_FIRST_BLOCK_TITLE
source: Time spent wisely
ta: புத்திசாலித்தனமாக கழித்த நேரம்

# MISSION_PERK_FOURTH_BLOCK_DESCRIPTION
source: Remote work is <highlight>beneficial for the environment as it helps reduce the carbon dioxide emissions</highlight> and saves energy that otherwise would have been spent on office heating.
ta: தொலைநிலை வேலை <சிறப்பம்சமாக> சுற்றுச்சூழலுக்கு நன்மை பயக்கும், ஏனெனில் இது கார்பன் டை ஆக்சைடு உமிழ்வைக் குறைக்க உதவுகிறது </சிறப்பம்சமாக> மற்றும் அலுவலக வெப்பத்திற்காக செலவழிக்கப்பட்ட ஆற்றலைச் சேமிக்கிறது.

# MISSION_PERK_FOURTH_BLOCK_TITLE
source: Enviromentally responsible
ta: சுற்றுச்சூழல் பொறுப்பு

# MISSION_PERK_SECOND_BLOCK_DESCRIPTION
source: Remote work helps build a more professional team, since the <highlight>employees are picked not based on their place of residence but on their skills and experience.</highlight>
ta: தொலைதூர வேலை ஒரு தொழில்முறை குழுவை உருவாக்க உதவுகிறது, ஏனெனில் <figital> ஊழியர்கள் அவர்கள் வசிக்கும் இடத்தின் அடிப்படையில் அல்ல, ஆனால் அவர்களின் திறமைகள் மற்றும் அனுபவத்தின் அடிப்படையில் தேர்வு செய்யப்படுகிறார்கள். </சிறப்பம்சமாக>

# MISSION_PERK_SECOND_BLOCK_TITLE
source: Skills-based selection
ta: திறன்கள் அடிப்படையிலான தேர்வு

# MISSION_PERK_SECTION_TITLE
source: What do we do?
ta: நாம் என்ன செய்வது?

# MISSION_PERK_THIRD_BLOCK_DESCRIPTION
source: Remote work is economically advantageous since the <highlight>company doesn’t have to spend money on rent, office equipment, water and electricity.</highlight>
ta: <சிறப்பம்சமாக> நிறுவனம் வாடகை, அலுவலக உபகரணங்கள், நீர் மற்றும் மின்சாரத்திற்காக பணத்தை செலவழிக்க வேண்டியதில்லை என்பதால் தொலைநிலை வேலை பொருளாதார ரீதியாக சாதகமானது. </சிறப்பம்சமாக>

# MISSION_PERK_THIRD_BLOCK_TITLE
source: Bottom line benefits
ta: அடிமட்ட நன்மைகள்

source: NLP
ta: என்.எல்.பி.

# ONLYOFFICE_DESCRIPTION
source: Document editing suite tailored to your needs. Work with all document formats.
ta: உங்கள் தேவைகளுக்கு ஏற்ப ஆவண திருத்துதல் தொகுப்பு. அனைத்து ஆவண வடிவங்களுடனும் வேலை செய்யுங்கள்.

source: Open Source
ta: திறந்த மூல

# OPEN_SOURCE_DESCRIPTION
source: Community driven Ethical by design Free
ta: சமூகம் உந்துதல் வடிவமைப்பால் நெறிமுறை இலவசம்

# OPEN_SOURCE_FIRST_SECTION_DESCRIPTION
source: Open source is at the heart of everything we do. Why open source? It's simple - free software is the safest and most convenient. Open source allows us to stay in touch with developers all around the globe and create quality and user-friendly products; we get a chance to join forces to make the world a better place for all users. At LINAGORA we are open to any suggestions, discussions and initiatives. Our employees are always ready for dialogue and share a common goal - to create a product to be proud of. The company's activity, as well as Open Source in general, is based on the principles of transparency and openness. LINAGORA is an open source company, and the community is crucial for us. Community is at the heart of our philosophy. We participate in the work on joint projects and always gratefully accept contributions of other developers to our code. We believe that open source has the power to unite cultures and we always stay in touch with the global Open Source community.
ta: நாம் செய்யும் எல்லாவற்றின் இதயத்திலும் திறந்த மூலமானது. திறந்த மூல ஏன்? இது எளிது - இலவச மென்பொருள் பாதுகாப்பானது மற்றும் மிகவும் வசதியானது. திறந்த மூலமானது உலகெங்கிலும் உள்ள டெவலப்பர்களுடன் தொடர்பில் இருக்கவும், தகுதி மற்றும் பயனர் நட்பு தயாரிப்புகளை உருவாக்கவும் அனுமதிக்கிறது; அனைத்து பயனர்களுக்கும் உலகத்தை ஒரு சிறந்த இடமாக மாற்ற படைகளில் சேர எங்களுக்கு வாய்ப்பு கிடைக்கிறது. லினகோராவில் எந்தவொரு பரிந்துரைகள், விவாதங்கள் மற்றும் முன்முயற்சிகளுக்கு நாங்கள் திறந்திருக்கிறோம். எங்கள் ஊழியர்கள் எப்போதுமே உரையாடலுக்கு தயாராக இருக்கிறார்கள் மற்றும் ஒரு பொதுவான இலக்கைப் பகிர்ந்து கொள்கிறார்கள் - பெருமைப்பட வேண்டிய ஒரு தயாரிப்பை உருவாக்க. நிறுவனத்தின் செயல்பாடு, பொதுவாக திறந்த மூலமும் வெளிப்படைத்தன்மை மற்றும் திறந்த தன்மையின் கொள்கைகளை அடிப்படையாகக் கொண்டது. லினகோரா ஒரு திறந்த மூல நிறுவனம், சமூகம் எங்களுக்கு முக்கியமானது. சமூகம் எங்கள் தத்துவத்தின் மையத்தில் உள்ளது. கூட்டுத் திட்டங்களின் பணியில் நாங்கள் பங்கேற்கிறோம், மற்ற டெவலப்பர்களின் பங்களிப்புகளை எங்கள் குறியீட்டிற்கு எப்போதும் நன்றியுடன் ஏற்றுக்கொள்கிறோம். திறந்த மூலத்திற்கு கலாச்சாரங்களை ஒன்றிணைக்கும் ஆற்றல் இருப்பதாக நாங்கள் நம்புகிறோம், நாங்கள் எப்போதும் உலகளாவிய திறந்த மூல சமூகத்துடன் தொடர்பில் இருப்போம்.

# OPEN_SOURCE_FIRST_SECTION_TITLE
source: Open Source
ta: திறந்த மூல

source: Policy
ta: கொள்கை

source: powered by
ta: மூலம் இயக்கப்படுகிறது

source: Privacy
ta: தனியுரிமை

source: Privacy and Security
ta: தனியுரிமை மற்றும் பாதுகாப்பு

# PRIVACY_AND_SECURITY_DESCRIPTION
source: GDPR Compliance Open and secure code Encrypted
ta: சிடிபிஆர் இணக்கம் திறந்த மற்றும் பாதுகாப்பான குறியீடு குறியாக்கப்பட்டது

source: Product Manager
ta: தயாரிப்பு மேலாளர்

# PRODUCT_PILLAR_SECTION_TITLE
source: 4 platform development pillars
ta: 4 இயங்குதள மேம்பாட்டு தூண்கள்

source: Project Manager
ta: திட்ட மேலாளர்

source: Publications
ta: வெளியீடுகள்

# PUBLICATIONS_FIRST_SECTION_DESCRIPTION
source: In LINAGORA we stand both for the practical and the theoretical approach: we believe that scientific research comes hand in hand with software development. You can find the list of our publications below.
ta: லினாகோராவில் நடைமுறை மற்றும் தத்துவார்த்த அணுகுமுறைக்காக நாங்கள் நிற்கிறோம்: விஞ்ஞான ஆராய்ச்சி மென்பொருள் மேம்பாட்டுடன் கைகோர்த்து வருகிறது என்று நாங்கள் நம்புகிறோம். எங்கள் வெளியீடுகளின் பட்டியலை கீழே காணலாம்.

# PUBLICATIONS_FIRST_SECTION_TITLE
source: Publications
ta: வெளியீடுகள்

source: R&D Director
ta: ஆர் & டி இயக்குனர்

source: Read
ta: படிக்க

# REPORT_ISSUE
source: Report an issue
ta: ஒரு சிக்கலைப் புகாரளிக்கவும்

# ROMARIC_MOURGUES_SUMMARY
source: Founder of Twake messenger. Serial innovator and creator in reg-tech, computer vision, gaming, music, vfx, video. Software Architect Engineer from Telecom Nancy, France.
ta: பேரூர் மெசஞ்சரின் நிறுவனர். ரெக்-டெக், கம்ப்யூட்டர் விசன், கேமிங், மியூசிக், விஎஃப்எக்ச், வீடியோ ஆகியவற்றில் தொடர் கண்டுபிடிப்பாளர் மற்றும் உருவாக்கியவர். பிரான்சின் டெலிகாம் நான்சியைச் சேர்ந்த மென்பொருள் கட்டிடக் கலைஞர் பொறியாளர்.

# SARAH_ZRIBI_SUMMARY
source: Sarah Zribi is the R&D team’s Innovation Project Manager, with a Ph.D in Computer Science from INSA Toulouse and Ecole des Mines d’Albi. With 10 years experience, she is familiar with European and French IT Research projects. Sarah’s expertise lies in the fields of Artificial Intelligence, Cloud Computing, SOA, SOA Governance, BPM, Modelling (UML, SoaML, BPMN, etc.), MDA and Model Transformation. She is currently managing the LinTO Project.
ta: சாரா ச்ரிபி ஆர் அண்ட் டி குழுவின் கண்டுபிடிப்பு திட்ட மேலாளராக உள்ளார், இன்சா துலூச் மற்றும் ஈகோல் டெச் மைன்ச் டி ஆல்பியிலிருந்து கணினி அறிவியலில் பி.எச்.டி. 10 வருட அனுபவத்துடன், அவர் ஐரோப்பிய மற்றும் பிரெஞ்சு செய்தி தொழில்நுட்ப ஆராய்ச்சி திட்டங்களை நன்கு அறிந்தவர். சாராவின் நிபுணத்துவம் செயற்கை நுண்ணறிவு, முகில் கம்ப்யூட்டிங், எச்ஓஏ, எச்ஓஏ ஆளுகை, பிபிஎம், மாடலிங் (யுஎம்எல், சோம்ல், பிபிஎம்என், முதலியன), எம்.டி.ஏ மற்றும் மாதிரி மாற்றம் போன்ற துறைகளில் உள்ளது. அவர் தற்போது லிண்டோ திட்டத்தை நிர்வகித்து வருகிறார்.

source: See our GitHub
ta: எங்கள் கிட்அப்பைப் பாருங்கள்

source: Social
ta: சமூக

# SOCIETE_GENERALE
source: Société Générale
ta: Socieété Générale

# STAKEHOLDER_SECTION_DESCRIPTION
source: Development of the platform is an R&D project that is being developed by LINAGORA with investment of BPI France and under the aegis of the Directorate General for Enterprise (DGE).
ta: தளத்தின் வளர்ச்சி என்பது ஒரு ஆர் அண்ட் டி திட்டமாகும், இது பிபிஐ பிரான்சின் முதலீட்டோடு லினாகோராவால் உருவாக்கப்பட்டு வருகிறது மற்றும் எண்டர்பிரைச் இயக்குநரகம் செனரலின் (டிசிஇ) இன் கீழ்.

# STAKEHOLDER_SECTION_TITLE
source: Major sponsors
ta: முக்கிய ஆதரவாளர்கள்

source: Team
ta: அணி

# TEAM_FIRST_SECTION_DESCRIPTION
source: Meet our dream team of performers and visionaries. We come from a diverse background of cultures, countries and experiences, but have gathered together with a common goal in mind – building the future of team communication and collaboration.
ta: கலைஞர்கள் மற்றும் தொலைநோக்கு பார்வையாளர்களின் எங்கள் கனவுக் குழுவை சந்திக்கவும். கலாச்சாரங்கள், நாடுகள் மற்றும் அனுபவங்களின் மாறுபட்ட பின்னணியில் இருந்து நாங்கள் வந்திருக்கிறோம், ஆனால் ஒரு பொதுவான இலக்கை மனதில் கொண்டு கூடிவருகிறோம் - குழு தொடர்பு மற்றும் ஒத்துழைப்பின் எதிர்காலத்தை உருவாக்குதல்.
