Repository: 247i/TACETr
Catalog: உரை/தானி/Linux-Deploy-Pro-linux-deploy-*.po
Languages: ta

# app_name
source: Linux Deploy
ta: லினக்ச் வரிசைப்படுத்தல்

# app_version
source: version %1$s
ta: பதிப்பு %1$s

# menu_start
source: START
ta: தொடங்கு

# menu_stop
source: STOP
ta: நிறுத்து

# menu_properties
source: Properties
ta: பண்புகள்

# nav_profiles
source: Profiles
ta: சுயவிவரங்கள்

# nav_repository
source: Repository
ta: களஞ்சியம்

# nav_terminal
source: Terminal
ta: முனையத்தில்

# nav_settings
source: Settings
ta: அமைப்புகள்

# nav_about
source: About
ta: பற்றி

# nav_exit
source: Exit
ta: வெளியேறு

# navigation_drawer_open
source: Open navigation drawer
ta: திறந்த வழிசெலுத்தல் அலமாரியை

# navigation_drawer_close
source: Close navigation drawer
ta: வழிசெலுத்தல் அலமாரியை மூடு

# menu_install
source: Install
ta: நிறுவவும்

# menu_configure
source: Configure
ta: உள்ளமைக்கவும்

# menu_export
source: Export
ta: ஏற்றுமதி

# menu_status
source: Status
ta: நிலை

# menu_clear
source: Clear
ta: தெளிவான

# menu_add
source: New
ta: புதிய

# menu_edit
source: Edit
ta: தொகு

# menu_delete
source: Delete
ta: நீக்கு

# menu_change_url
source: Change URL
ta: முகவரி ஐ மாற்றவும்

# menu_refresh
source: Refresh
ta: புதுப்பிப்பு

# menu_more
source: Menu
ta: பட்டியல்

# loading_message
source: Loading data…
ta: தரவை ஏற்றுகிறது…

# updating_env_message
source: Updating operating environment…
ta: இயக்க சூழலைப் புதுப்பித்தல்…

# removing_env_message
source: Removing operating environment…
ta: இயக்க சூழலை நீக்குதல்…

# notification_current_profile
source: Current profile
ta: தற்போதைய சுயவிவரம்

# title_activity_main
source: Linux Deploy
ta: லினக்ச் வரிசைப்படுத்தல்

# title_activity_about
source: About
ta: பற்றி

# title_activity_settings
source: Settings
ta: அமைப்புகள்

# title_activity_properties
source: Properties
ta: பண்புகள்

# title_activity_profiles
source: Profiles
ta: சுயவிவரங்கள்

# title_activity_mounts
source: Mounts
ta: ஏற்றங்கள்

# title_activity_repository
source: Repository
ta: களஞ்சியம்

# confirm_start_title
source: Start
ta: தொடங்கு

# confirm_stop_title
source: Stop
ta: நிறுத்து

# confirm_start_message
source: Mount the container and start services?
ta: கொள்கலனை ஏற்றி சேவைகளைத் தொடங்கவா?

# confirm_stop_message
source: Stop services and unmount the container?
ta: சேவைகளை நிறுத்தி, கொள்கலனை அவிழ்த்து விடுகிறீர்களா?

# new_profile_title
source: Profile name
ta: சுயவிவர பெயர்

# edit_profile_title
source: Profile name
ta: சுயவிவர பெயர்

# import_profile_title
source: Import profile
ta: சுயவிவரத்தை இறக்குமதி செய்யுங்கள்

# export_profile_title
source: Export profile
ta: ஏற்றுமதி சுயவிவரம்

# toast_import_profile_success
source: Profile has been successfully imported.
ta: சுயவிவரம் வெற்றிகரமாக இறக்குமதி செய்யப்பட்டுள்ளது.

# toast_import_profile_error
source: Error importing profile!
ta: சுயவிவரத்தை இறக்குமதி செய்வதில் பிழை!

# toast_export_profile_success
source: Profile has been successfully exported.
ta: சுயவிவரம் வெற்றிகரமாக ஏற்றுமதி செய்யப்பட்டுள்ளது.

# toast_export_profile_error
source: Error exporting profile!
ta: சுயவிவரத்தை ஏற்றுமதி செய்வதில் பிழை!

# toast_loading_error
source: Error loading data!
ta: தரவை ஏற்றுவதில் பிழை!

# toast_updating_env_error
source: Error updating of operating environment!
ta: இயக்க சூழலைப் புதுப்பிப்பதில் பிழை!

# confirm_profile_discard_title
source: Remove profile
ta: சுயவிவரத்தை அகற்று

# confirm_profile_discard_message
source: Remove selected profile?
ta: தேர்ந்தெடுக்கப்பட்ட சுயவிவரத்தை அகற்றவா?

# new_mount_title
source: New mount point
ta: புதிய மவுண்ட் பாயிண்ட்

# edit_mount_title
source: Edit mount point
ta: மவுண்ட் பாயிண்டைத் திருத்து

# confirm_mount_discard_title
source: Remove mount point
ta: மவுண்ட் பாயிண்ட்டை அகற்று

# confirm_mount_discard_message
source: Remove selected mount point from the list?
ta: பட்டியலிலிருந்து தேர்ந்தெடுக்கப்பட்ட மவுண்ட் பாயிண்ட்டை அகற்றவா?

# repository_import_message
source: %1$s Size: %2$s MB
ta: %1$s அளவு: %2$s MB

# repository_import_button
source: Import
ta: இறக்குமதி

# repository_purchase_button
source: Purchase
ta: வாங்க

# repository_change_url_title
source: Repository URL
ta: களஞ்சிய முகவரி

# repository_default_description
source: No description.
ta: விளக்கம் இல்லை.

# write_permissions_disallow
source: The app was not allowed to write to your storage
ta: பயன்பாடு உங்கள் சேமிப்பகத்திற்கு எழுத அனுமதிக்கப்படவில்லை

# app_preferences
source: Application
ta: பயன்பாடு

# title_screenlock_preference
source: Lock screen
ta: பூட்டுத் திரை

# summary_screenlock_preference
source: Keep screen active while the application is running
ta: பயன்பாடு இயங்கும்போது திரையை செயலில் வைத்திருங்கள்

# title_wifilock_preference
source: Lock Wi-Fi
ta: லாக் வைஃபை

# summary_wifilock_preference
source: Keep Wi-Fi active while the application is running
ta: பயன்பாடு இயங்கும்போது வைஃபை செயலில் வைக்கவும்

# title_wakelock_preference
source: Wake lock
ta: விழித்தெழுந்த பூட்டு

# summary_wakelock_preference
source: Keep CPU running to do work while the screen is off
ta: திரை முடக்கப்படும் போது வேலை செய்ய சிபியு ஐ இயக்கவும்

# title_language_preference
source: Language
ta: மொழி

# dialog_title_language_preference
source: Choose language
ta: மொழியைத் தேர்வுசெய்க

# title_fontsize_preference
source: Font size
ta: எழுத்துரு அளவு

# dialog_title_fontsize_preference
source: Font size
ta: எழுத்துரு அளவு

# title_maxlines_preference
source: Scroll size
ta: உருள் அளவு

# dialog_title_maxlines_preference
source: Scroll size
ta: உருள் அளவு

# title_theme_preference
source: Theme
ta: கருப்பொருள்

# dialog_title_theme_preference
source: Choose theme
ta: கருப்பொருள் தேர்வு செய்யவும்

# title_timestamp_preference
source: Timestamp
ta: நேர முத்திரை

# summary_timestamp_preference
source: Show timestamp
ta: நேர முத்திரையைக் காட்டு

# title_appicon_preference
source: Show icon
ta: ஐகானைக் காட்டு

# summary_appicon_preference
source: Display icon in notification bar
ta: அறிவிப்பு பட்டியில் ஐகானைக் காண்பி

# title_stealth_preference
source: Stealth mode
ta: திருட்டுத்தனமான பயன்முறை

# summary_stealth_preference
source: Hide application icon from launcher
ta: துவக்கத்திலிருந்து பயன்பாட்டு ஐகானை மறைக்கவும்

# title_autostart_preference
source: Autostart
ta: ஆட்டோச்டார்ட்

# summary_autostart_preference
source: Automatically run the container when starting Android
ta: ஆண்ட்ராய்டு ஐத் தொடங்கும்போது தானாகவே கொள்கலனை இயக்கவும்

# title_autostart_delay_preference
source: Autostart delay
ta: ஆட்டோச்டார்ட் நேரந்தவறுகை

# dialog_title_autostart_delay_preference
source: Delay (seconds)
ta: நேரந்தவறுகை (விநாடிகள்)

# title_nettrack_preference
source: Track network changes
ta: பிணையம் மாற்றங்களைக் கண்காணிக்கவும்

# summary_nettrack_preference
source: Track changes of the network and update the container
ta: நெட்வொர்க்கின் மாற்றங்களைக் கண்காணித்து கொள்கலனைப் புதுப்பிக்கவும்

# title_powertrack_preference
source: Track power changes
ta: ஆற்றல் மாற்றங்களைக் கண்காணிக்கவும்

# summary_powertrack_preference
source: Track changes of the power and update the container
ta: சக்தியின் மாற்றங்களைக் கண்காணித்து கொள்கலனைப் புதுப்பிக்கவும்

# env_preferences
source: Environment
ta: சூழல்

# title_env_dir_preference
source: ENV directory
ta: ENV அடைவு

# dialog_title_env_dir_preference
source: ENV directory
ta: ENV அடைவு

# title_path_preference
source: PATH variable
ta: பாதை மாறி

# dialog_title_path_preference
source: PATH variable
ta: பாதை மாறி

# title_server_url_preference
source: Server URL
ta: சேவையக முகவரி

# dialog_title_server_url_preference
source: Server URL
ta: சேவையக முகவரி

# title_method_preference
source: Containerization method
ta: கொள்கலன் முறை

# dialog_title_method_preference
source: Containerization method
ta: கொள்கலன் முறை

# title_method_options_preference
source: Containerization options
ta: கொள்கலன் விருப்பங்கள்

# dialog_title_method_options_preference
source: Containerization options
ta: கொள்கலன் விருப்பங்கள்

# title_installenv_preference
source: Update ENV
ta: ENV ஐப் புதுப்பிக்கவும்

# summary_installenv_preference
source: Update the operating environment
ta: இயக்க சூழலைப் புதுப்பிக்கவும்

# message_installenv_confirm_dialog
source: Update the operating environment?
ta: இயக்க சூழலைப் புதுப்பிக்கவா?

# title_removeenv_preference
source: Remove ENV
ta: ENV ஐ அகற்று

# summary_removeenv_preference
source: Remove the operating environment
ta: இயக்க சூழலை அகற்றவும்

# message_removeenv_confirm_dialog
source: Remove the operating environment?
ta: இயக்க சூழலை அகற்றவா?

# services_preferences
source: Services
ta: சேவைகள்

# title_is_telnet_preference
source: TELNET
ta: டெல்நெட்

# summary_is_telnet_preference
source: Enable telnetd daemon
ta: டெல்நெட் டீமனை இயக்கவும்

# title_telnet_port_preference
source: Port
ta: துறைமுகம்

# dialog_title_telnet_port_preference
source: TELNET port
ta: டெல்நெட்

# title_telnet_localhost_preference
source: Localhost
ta: உள்ளக புரவலன்

# summary_telnet_localhost_preference
source: Allow connections only from localhost
ta: உள்ளக ஓச்டிலிருந்து மட்டுமே இணைப்புகளை அனுமதிக்கவும்

# summary_is_http_preference
source: Enable httpd daemon
ta: HTTPD டீமனை இயக்கவும்

# title_http_port_preference
source: Port
ta: துறைமுகம்

# dialog_title_http_port_preference
source: HTTP port
ta: HTTP துறைமுகம்

# title_http_conf_preference
source: Access restriction
ta: அணுகல் கட்டுப்பாடு

# dialog_title_http_conf_preference
source: Access restriction
ta: அணுகல் கட்டுப்பாடு

# debug_preferences
source: Debug
ta: பிழைத்திருத்தம்

# title_debug_mode_preference
source: Debug mode
ta: பிழைத்திருத்த முறை

# summary_debug_mode_preference
source: Show debugging information
ta: பிழைத்திருத்த தகவலைக் காட்டு

# title_trace_mode_preference
source: Trace mode
ta: சுவடு பயன்முறை

# summary_trace_mode_preference
source: Enable tracing mode
ta: தடமறிதல் பயன்முறையை இயக்கவும்

# title_logger_preference
source: Logging
ta: பதிவு

# summary_logger_preference
source: Save logs to a file
ta: பதிவுகளை ஒரு கோப்பில் சேமிக்கவும்

# title_logfile_preference
source: Log file
ta: பதிவு கோப்பு

# dialog_title_logfile_preference
source: Log file
ta: பதிவு கோப்பு

# title_install_dialog
source: Install
ta: நிறுவவும்

# message_install_dialog
source: Start installation of GNU/Linux distribution?
ta: குனு/லினக்ச் விநியோகத்தின் நிறுவலைத் தொடங்கவா?

# title_configure_dialog
source: Configure
ta: உள்ளமைக்கவும்

# message_configure_dialog
source: Start configuration of the container?
ta: கொள்கலனின் உள்ளமைவைத் தொடங்கவா?

# title_export_dialog
source: Export
ta: ஏற்றுமதி

# bootstrap_preferences
source: BOOTSTRAP
ta: தொடக்கவார்

# title_distrib_preference
source: Distribution
ta: பரவல்

# dialog_title_distrib_preference
source: Distribution
ta: பரவல்

# title_arch_preference
source: Architecture
ta: கட்டிடக்கலை

# dialog_title_arch_preference
source: Architecture
ta: கட்டிடக்கலை

# title_suite_preference
source: Distribution suite
ta: விநியோக தொகுப்பு

# dialog_title_suite_preference
source: Distribution suite
ta: விநியோக தொகுப்பு

# title_source_path_preference
source: Source path
ta: மூல பாதை

# dialog_title_source_path_preference
source: Source path
ta: மூல பாதை

# title_target_type_preference
source: Installation type
ta: நிறுவல் வகை

# dialog_title_target_type_preference
source: Installation type
ta: நிறுவல் வகை

# title_target_path_preference
source: Installation path
ta: நிறுவல் பாதை

# dialog_title_target_path_preference
source: Installation path
ta: நிறுவல் பாதை

# title_disk_size_preference
source: Image size (MB)
ta: பட அளவு (எம்பி)

# dialog_title_disk_size_preference
source: Disk image size (MB)
ta: வட்டு பட அளவு (எம்பி)

# summary_disk_size_preference
source: Automatic calculation
ta: தானியங்கி கணக்கீடு

# title_fs_type_preference
source: File system
ta: கோப்பு முறைமை

# dialog_title_fs_type_preference
source: File system
ta: கோப்பு முறைமை

# title_host_name_preference
source: Host name
ta: புரவலன் பெயர்

# dialog_title_host_name_preference
source: Host name
ta: புரவலன் பெயர்

# title_user_name_preference
source: User name
ta: பயனர் பெயர்

# dialog_title_user_name_preference
source: User name
ta: பயனர் பெயர்

# title_user_password_preference
source: User password
ta: பயனர் கடவுச்சொல்

# dialog_title_user_password_preference
source: User password
ta: பயனர் கடவுச்சொல்

# title_privileged_users_preference
source: Privileged users
ta: சலுகை பெற்ற பயனர்கள்

# dialog_title_privileged_users_preference
source: Privileged users
ta: சலுகை பெற்ற பயனர்கள்

# title_locale_preference
source: Localization
ta: உள்ளகமாக்கல்

# dialog_title_locale_preference
source: Localization
ta: உள்ளகமாக்கல்

# title_dns_preference
source: DNS
ta: டி.என்.எச்

# dialog_title_dns_preference
source: Address of DNS server
ta: டிஎன்எச் சேவையகத்தின் முகவரி

# summary_dns_preference
source: Automatic detection
ta: தானியங்கி கண்டறிதல்

# title_net_trigger_preference
source: Network trigger
ta: பிணைய தூண்டுதல்

# dialog_title_net_trigger_preference
source: Path to trigger script
ta: ச்கிரிப்டைத் தூண்டுவதற்கான பாதை

# title_power_trigger_preference
source: Power trigger
ta: ஆற்றல் தூண்டுதல்

# dialog_title_power_trigger_preference
source: Path to trigger script
ta: ச்கிரிப்டைத் தூண்டுவதற்கான பாதை

# title_is_init_preference
source: Enable
ta: இயக்கு

# summary_is_init_preference
source: Allow to use a initialization system
ta: துவக்க முறையைப் பயன்படுத்த அனுமதிக்கவும்

# title_init_preference
source: Init system
ta: Init அமைப்பு

# dialog_title_init_preference
source: Init system
ta: Init அமைப்பு

# title_init_properties_preference
source: Init settings
ta: துவக்க அமைப்புகள்

# summary_init_properties_preference
source: Change settings for the initialization system
ta: துவக்க அமைப்புக்கான அமைப்புகளை மாற்றவும்

# title_init_path_preference
source: Init path
ta: தொடக்க பாதை

# dialog_title_init_path_preference
source: INIT: file or directory
ta: Init: கோப்பு அல்லது அடைவு

# title_init_level_preference
source: Init level
ta: Init நிலை

# dialog_title_init_level_preference
source: INIT: level
ta: Init: நிலை

# title_init_user_preference
source: Init user
ta: துவக்க பயனர்

# dialog_title_init_user_preference
source: INIT: user
ta: Init: பயனர்

# title_init_async_preference
source: Async
ta: ஒத்திசைவு

# summary_init_async_preference
source: Run the processes asynchronously
ta: செயல்முறைகளை ஒத்திசைவற்ற முறையில் இயக்கவும்

# mounts_preferences
source: MOUNTS
ta: ஏற்றங்கள்

# title_is_mounts_preference
source: Enable
ta: இயக்கு

# summary_is_mounts_preference
source: Allow to mount the Android resources
ta: ஆண்ட்ராய்டு வளங்களை ஏற்ற அனுமதிக்கவும்

# title_mounts_editor_preference
source: Mount points
ta: மவுண்ட் புள்ளிகள்

# summary_mounts_editor_preference
source: Edit the mount points list
ta: மவுண்ட் புள்ளிகள் பட்டியலைத் திருத்தவும்

# hint_mounts_source
source: Source
ta: மூலம்

# hint_mounts_target
source: Target (optional)
ta: இலக்கு (விரும்பினால்)

# ssh_preferences
source: SSH
ta: பாஓடு

# title_is_ssh_preference
source: Enable
ta: இயக்கு

# summary_is_ssh_preference
source: Allow to use a SSH server
ta: பாஓடு சேவையகத்தைப் பயன்படுத்த அனுமதிக்கவும்

# title_ssh_properties_preference
source: SSH settings
ta: பாஓடு அமைப்புகள்

# summary_ssh_properties_preference
source: Change settings for SSH server
ta: பாஓடு சேவையகத்திற்கான அமைப்புகளை மாற்றவும்

# title_ssh_port_preference
source: Port
ta: துறைமுகம்

# dialog_title_ssh_port_preference
source: SSH: port
ta: SSH: துறைமுகம்

# title_ssh_options_preference
source: SSH options
ta: பாஓடு விருப்பங்கள்

# dialog_title_ssh_options_preference
source: SSH: sshd options
ta: SSH: SSHD விருப்பங்கள்

# pulse_preferences
source: PulseAudio
ta: பல்சியுடியோ

# title_is_pulse_preference
source: Enable
ta: இயக்கு

# summary_is_pulse_preference
source: Allow to use an audio output
ta: ஆடியோ வெளியீட்டைப் பயன்படுத்த அனுமதிக்கவும்

# title_pulse_properties_preference
source: Audio settings
ta: ஆடியோ அமைப்புகள்

# summary_pulse_properties_preference
source: Change settings for audio output
ta: ஆடியோ வெளியீட்டிற்கான அமைப்புகளை மாற்றவும்

# title_pulse_host_preference
source: Host
ta: விருந்தோம்பி

# dialog_title_pulse_host_preference
source: PulseAudio: host
ta: பல்சியுடியோ: புரவலன்

# title_pulse_port_preference
source: Port
ta: துறைமுகம்

# dialog_title_pulse_port_preference
source: PulseAudio: port
ta: பல்சியுடியோ: துறைமுகம்

# gui_preferences
source: GUI
ta: குய்

# title_is_gui_preference
source: Enable
ta: இயக்கு

# summary_is_gui_preference
source: Allow to use a graphical environment
ta: வரைகலை சூழலைப் பயன்படுத்த அனுமதிக்கவும்

# title_graphics_preference
source: Graphics subsystem
ta: கிராபிக்ச் துணை அமைப்பு

# dialog_title_graphics_preference
source: Graphics subsystem
ta: கிராபிக்ச் துணை அமைப்பு

# title_gui_properties_preference
source: GUI settings
ta: GUI அமைப்புகள்

# summary_gui_properties_preference
source: Change settings for the graphics subsystem
ta: கிராபிக்ச் துணை அமைப்பிற்கான அமைப்புகளை மாற்றவும்

# title_desktop_preference
source: Desktop environment
ta: டெச்க்டாப் சூழல்

# dialog_title_desktop_preference
source: Desktop environment
ta: டெச்க்டாப் சூழல்

# vnc_preferences
source: VNC
ta: வி.என்.சி.

# title_vnc_display_preference
source: Display
ta: காட்சி

# dialog_title_vnc_display_preference
source: VNC: display number
ta: வி.என்.சி: காட்சி எண்

# title_vnc_depth_preference
source: Depth (bits)
ta: ஆழம் (பிட்கள்)

# dialog_title_vnc_depth_preference
source: VNC: depth (bits)
ta: வி.என்.சி: ஆழம் (பிட்கள்)

# title_vnc_dpi_preference
source: DPI
ta: டிபிஐ

# dialog_title_vnc_dpi_preference
source: VNC: dots per inch (DPI)
ta: வி.என்.சி: ஒரு அங்குலத்திற்கு புள்ளிகள் (டிபிஐ)

# title_vnc_width_preference
source: Width
ta: அகலம்

# dialog_title_vnc_width_preference
source: VNC: screen width
ta: வி.என்.சி: திரை அகலம்

# title_vnc_height_preference
source: Height
ta: உயரம்

# dialog_title_vnc_height_preference
source: VNC: screen height
ta: வி.என்.சி: திரை உயரம்

# title_vnc_args_preference
source: VNC options
ta: வி.என்.சி விருப்பங்கள்

# dialog_title_vnc_args_preference
source: VNC: vncserver options
ta: VNC: VNCServer விருப்பங்கள்

# title_x11_display_preference
source: Display
ta: காட்சி

# dialog_title_x11_display_preference
source: X11: display number
ta: X11: காட்சி எண்

# title_x11_host_preference
source: X server address
ta: ஃச் சேவையக முகவரி

# dialog_title_x11_host_preference
source: X11: IP or host name
ta: X11: ஐபி அல்லது புரவலன் பெயர்

# summary_x11_sdl_preference
source: Automatically open XServer XSDL
ta: தானாகத் திறந்து xserver xsdl

# title_x11_sdl_delay_preference
source: Start delay
ta: நேரந்தவறுகை தொடங்குகிறது

# dialog_title_x11_sdl_delay_preference
source: X11: delay in seconds
ta: ஃச் 11: விநாடிகளில் நேரந்தவறுகை

# fb_preferences
source: Framebuffer
ta: பிரேம் பஃபர்

# title_fb_display_preference
source: Display
ta: காட்சி

# dialog_title_fb_display_preference
source: FB: display number
ta: FB: காட்சி எண்

# title_fb_dpi_preference
source: DPI
ta: டிபிஐ

# dialog_title_fb_dpi_preference
source: FB: dots per inch (DPI)
ta: FB: ஒரு அங்குலத்திற்கு புள்ளிகள் (டிபிஐ)

# title_fb_dev_preference
source: Video device
ta: வீடியோ சாதனம்

# dialog_title_fb_dev_preference
source: FB: video device path
ta: FB: வீடியோ சாதன பாதை

# title_fb_input_preference
source: Input device
ta: உள்ளீட்டு சாதனம்

# dialog_title_fb_input_preference
source: FB: input device path
ta: FB: உள்ளீட்டு சாதன பாதை

# title_fb_args_preference
source: X options
ta: ஃச் விருப்பங்கள்

# dialog_title_fb_args_preference
source: FB: X options
ta: FB: ஃச் விருப்பங்கள்

# title_fb_freeze_preference
source: Freeze Android UI
ta: ஆண்ட்ராய்டு இடைமுகம் ஐ முடக்கம்

# dialog_title_fb_freeze_preference
source: Freeze Android UI
ta: ஆண்ட்ராய்டு இடைமுகம் ஐ முடக்கம்

# title_fb_refresh_preference
source: Force refresh
ta: கட்டாய புதுப்பிப்பு

# summary_fb_refresh_preference
source: Force refresh framebuffer
ta: ஃபோர்ச் புதுப்பிப்பு பிரேம் பஃபர்

# help_text
source: <b>Help</b> This application installs the selected GNU/Linux distribution and executes it in a chroot-container. Procedure: 1. Get superuser privileges (root). 2. Check the connection to Internet. 3. Specify the installation options. 4. Start the installation ("Menu =&gt; Install"). 5. Wait until the installation is complete. 6. Tap "START" button to run the container. 7. Connect to the container through CLI, SSH, VNC, or others. For more information, see "About".
ta: <b> உதவி </b> இந்த பயன்பாடு தேர்ந்தெடுக்கப்பட்ட குனு/லினக்ச் விநியோகத்தை நிறுவி அதை க்ரூட்-கான்டைனரில் செயல்படுத்துகிறது. செயல்முறை: 1. சூப்பர் யூசர் சலுகைகளைப் பெறுங்கள் (ரூட்). 2. இணையத்திற்கான இணைப்பை சரிபார்க்கவும். 3. நிறுவல் விருப்பங்களைக் குறிப்பிடவும். 4. நிறுவலைத் தொடங்கவும் ("மெனு = & gt; நிறுவு"). 5. நிறுவல் முடியும் வரை காத்திருங்கள். 6. கொள்கலனை இயக்க "தொடக்க" பொத்தானைத் தட்டவும். 7. சி.எல்.ஐ, எச்.எச்.எச், வி.என்.சி அல்லது பிறவற்றின் மூலம் கொள்கலனுடன் இணைக்கவும். மேலும் தகவலுக்கு, "பற்றி" பார்க்கவும்.

# about_text
source: This application installs the selected GNU/Linux distribution and executes it in a chroot-container. For more information see <a href="https://github.com/meefik/linuxdeploy">project page</a>, <a href="http://4pda.ru/forum/index.php?showtopic=378043">forum</a> or <a href="https://meefik.github.io">developer site</a>. © 2012–2019 Anton Skshidlevsky, GPLv3
ta: இந்த பயன்பாடு தேர்ந்தெடுக்கப்பட்ட குனு/லினக்ச் விநியோகத்தை நிறுவி அதை க்ரூட்-கான்டைனரில் செயல்படுத்துகிறது. மேலும் தகவலுக்கு <a href = "https://github.com/meefik/linuxdeplow"> திட்டப் பக்கம் </a>, <a href = "http://4pda.ru/forum/index.php?showtopic= ஐப் பார்க்கவும் 378043 "> மன்றம் </a> அல்லது <a href =" https://meefik.github.io "> உருவாக்குபவர் தளம் </a>. © 2012–2019 அன்டன் எச்.கேசிட்லெவ்ச்கி, சி.பி.எல்.வி 3

# service_notification_channel_name
source: Services
ta: சேவைகள்

# service_notification_channel_description
source: Channel to display service notifications
ta: பணி அறிவிப்புகளைக் காண்பிக்க சேனல்
