Repository: 247i/TACETr
Catalog: உரை/தானி/maemo-leste-rtcom-call-ui-l10n-*.po
Languages: ta

# call_bd_call_duration_clear_timers
source: Clear timers
ta: டைமர்களை அழிக்கவும்

# call_bd_idle_view_dialpad
source: Dialling pad
ta: டயலிங் பேட்

# call_bd_idle_view_select_contact
source: Select contact
ta: தொடர்பைத் தேர்ந்தெடுக்கவும்

# call_bd_incoming_call_answer
source: Answer
ta: பதில்

# call_bd_incoming_call_reject
source: Reject
ta: நிராகரிக்கவும்

# call_bd_manual_dial_call_type
source: Call type
ta: அழைப்பு வகை

# call_bd_manual_dial_cellular
source: Cellular
ta: செல்லுலார்

# call_bd_send
source: Send
ta: அனுப்பு

# call_bd_set_turning_display_orientation
source: Display orientation
ta: காட்சி நோக்குநிலை

# call_bd_set_turning_home_shortcut
source: Launch by turning
ta: திருப்புவதன் மூலம் தொடங்கவும்

# call_bd_skip
source: Skip
ta: தவிர்

# call_fi_call_duration_all_calls
source: All
ta: அனைத்தும்

# call_fi_call_duration_cellular
source: Mobile calls
ta: மொபைல் அழைப்புகள்

# call_fi_call_duration_dialed
source: Dialled
ta: டயல்

# call_fi_call_duration_received
source: Received
ta: பெறப்பட்டது

# call_fi_call_duration_voip
source: Internet calls
ta: இணைய அழைப்புகள்

# call_fi_call_handling_camera
source: Camera
ta: கேமரா

# call_fi_call_handling_device_locked
source: Device locked
ta: சாதனம் பூட்டப்பட்டுள்ளது

# call_fi_call_handling_emergency_call
source: Emergency call
ta: அவசர அழைப்பு

# call_fi_call_handling_emergency_call_number
source: %s – Emergency call
ta: %s - அவசர அழைப்பு

# call_fi_call_handling_end_call
source: End
ta: முடிவு

# call_fi_call_handling_fixed_title
source: Call
ta: அழைப்பு

# call_fi_call_handling_headset
source: Headset
ta: எட்செட்

# call_fi_call_handling_held_call
source: On hold
ta: நிறுத்தி

# call_fi_call_handling_speaker
source: Speaker
ta: ஒலிபெருக்கி, ஒலிபரப்பி

# call_fi_call_handling_split_conference
source: Private
ta: தனிப்பட்ட

# call_fi_call_header_active_call
source: Active call
ta: செயலில் அழைப்பு

# call_fi_call_header_active_call_portrait
source: Active call
ta: செயலில் அழைப்பு

# call_fi_call_header_active_conference_call
source: Conference call
ta: மாநாட்டு அழைப்பு

# call_fi_call_header_active_conference_call_portrait
source: Conference call
ta: மாநாட்டு அழைப்பு

# call_fi_call_header_ending
source: Ending
ta: முடிவு

# call_fi_call_header_held_call
source: On hold
ta: நிறுத்தி

# call_fi_call_header_video_call
source: Video call
ta: வீடியோ அழைப்பு

# call_fi_call_summary_identifier_incorrect_number
source: Incorrect number
ta: தவறான எண்

# call_fi_call_type_cellular
source: Cellular
ta: செல்லுலார்

# call_fi_display_orientation_automatic
source: Automatic
ta: தானியங்கி

# call_fi_display_orientation_landscape
source: Landscape
ta: நிலப்பரப்பு

# call_fi_display_orientation_portrait
source: Portrait
ta: உருவப்படம்

# call_fi_manual_dial_no_accounts
source: No accounts
ta: கணக்குகள் இல்லை

# call_ia_idle_view_no_calls
source: No recent calls
ta: அண்மைக் கால அழைப்புகள் இல்லை

# call_ib_account_not_in_use
source: Account not in use
ta: கணக்கு பயன்பாட்டில் இல்லை

# call_ib_als_wrong_line
source: Line 2 of SIM card not supported. Change SIM card.
ta: சிம் கார்டின் வரி 2 ஆதரிக்கப்படவில்லை. சிம் கார்டை மாற்றவும்.

# call_ib_audio_transferred_from_headset
source: Audio transferred from headset to device
ta: ஆடியோ எட்செட்டிலிருந்து சாதனத்திற்கு மாற்றப்பட்டது

# call_ib_audio_transferred_to_headset
source: Audio transferred to headset
ta: ஆடியோ எட்செட்டுக்கு மாற்றப்பட்டது

# call_ib_call_activated
source: Call activated
ta: அழைப்பு செயல்படுத்தப்பட்டது

# call_ib_call_on_hold
source: Call on hold
ta: நிறுத்தி

# call_ib_call_waiting
source: Call waiting
ta: காத்திருப்பதை அழைக்கவும்

# call_ib_cellular_connection_error
source: Connection error
ta: இணைப்பு பிழை

# call_ib_cellular_network_busy
source: Network busy
ta: பிணையம் பிசியாக

# call_ib_cost_limit_reached
source: Cost limit reached
ta: செலவு வரம்பு எட்டப்பட்டது

# call_ib_fdn_active
source: Call not allowed. Fixed dialling active.
ta: அழைப்பு அனுமதிக்கப்படவில்லை. நிலையான டயலிங் செயலில்.

# call_ib_not_allowed
source: Call not allowed
ta: அழைப்பு அனுமதிக்கப்படவில்லை

# call_ib_not_available
source: Not available
ta: கிடைக்கவில்லை

# call_ib_number_not_in_use
source: Number not in use
ta: பயன்பாட்டில் இல்லை

# call_ib_request_not_completed
source: Request not completed
ta: கோரிக்கை முடிக்கப்படவில்லை

# call_ib_request_rejected
source: Request rejected
ta: கோரிக்கை நிராகரிக்கப்பட்டது

# call_ib_sending_dtmf
source: Sending DTMF
ta: டி.டி.எம்.எஃப் அனுப்புகிறது

# call_ib_service_code_not_supported
source: Service code not supported
ta: பணி குறியீடு ஆதரிக்கப்படவில்லை

# call_ib_w_not_supported
source: Letter 'w' not supported
ta: 'W' கடிதம் ஆதரிக்கப்படவில்லை

# call_me_context_menu_contact_card
source: Open contact card
ta: தொடர்பு அட்டையைத் திறக்கவும்

# call_me_context_menu_delete
source: Delete
ta: நீக்கு

# call_me_menu_call_call_to_contact
source: New call to contact
ta: தொடர்பு கொள்ள புதிய அழைப்பு

# call_me_menu_call_call_to_number
source: New call to number
ta: எண்ணுக்கு புதிய அழைப்பு

# call_me_menu_call_speaker_off
source: Turn off speaker
ta: பேச்சாளரை அணைக்கவும்

# call_me_menu_call_speaker_on
source: Turn on speaker
ta: பேச்சாளரை இயக்கவும்

# call_me_menu_call_start_conference
source: Start conference call
ta: மாநாட்டு அழைப்பைத் தொடங்கவும்

# call_me_menu_call_video_call
source: Turn on video
ta: வீடியோவை இயக்கவும்

# call_me_menu_merge_with
source: Merge with contact
ta: தொடர்புடன் ஒன்றிணைக்கவும்

# call_me_menu_new_contact
source: New contact
ta: புதிய தொடர்பு

# call_me_menu_tools_activate_call
source: Activate call
ta: அழைப்பை செயல்படுத்தவும்

# call_me_menu_tools_clear_list
source: Clear recent calls
ta: அண்மைக் கால அழைப்புகளை அழிக்கவும்

# call_me_menu_tools_duration
source: Call timers
ta: டைமர்களை அழைக்கவும்

# call_me_menu_tools_end_held_call
source: End held call
ta: இறுதி அழைப்பு

# call_me_menu_tools_hold_call
source: Hold call
ta: அழைப்பை நடத்துங்கள்

# call_me_menu_turning_control
source: Turning control
ta: கட்டுப்பாட்டை திருப்புதல்

# call_nc_clear_all_calls
source: Clear recent calls?
ta: அண்மைக் கால அழைப்புகளை அழிக்கவா?

# call_nc_delete_call
source: Remove from recent calls?
ta: அண்மைக் கால அழைப்புகளிலிருந்து நீக்கவா?

# call_nc_end_call
source: End ongoing call?
ta: தற்போதைய அழைப்பை முடிக்கவா?

# call_nc_end_calls
source: End ongoing calls?
ta: நடந்துகொண்டிருக்கும் அழைப்புகளை முடிக்கவா?

# call_nc_requesting
source: Requesting
ta: கோருகிறது

# call_ti_call_duration
source: Call timers
ta: டைமர்களை அழைக்கவும்

# call_ti_call_type
source: Call type
ta: அழைப்பு வகை

# call_ti_message
source: Message
ta: செய்தி

# call_ti_set_turning_control
source: Turning control
ta: கட்டுப்பாட்டை திருப்புதல்

# voip_ap_feature_name
source: Phone
ta: தொலைபேசி

# voip_bd_dtmf_dialpad_close
source: Close
ta: மூடு

# voip_bd_manual_dial_ok
source: Call
ta: அழைப்பு

# voip_bv_call_handling_lock_enter_code
source: Unlock
ta: திறக்க

# voip_fi_call_header_connecting
source: Connecting
ta: இணைத்தல்

# voip_fi_call_header_initializing
source: Calling
ta: அழைப்பு

# voip_fi_call_header_initializing_portrait
source: Calling
ta: அழைப்பு

# voip_fi_call_summary_identifier_busy
source: Busy
ta: பிசியாக

# voip_fi_call_summary_identifier_call_rejected
source: Call not established
ta: அழைப்பு நிறுவப்படவில்லை

# voip_fi_call_summary_identifier_disconnected
source: Call disconnected
ta: அழைப்பு துண்டிக்கப்பட்டது

# voip_fi_call_summary_identifier_no_answer
source: No answer
ta: பதில் இல்லை

# voip_fi_call_summary_identifier_not_authorized
source: Call unauthorised
ta: அங்கீகரிக்கப்படாததை அழைக்கவும்

# voip_fi_call_summary_identifier_not_found
source: Incorrect address
ta: தவறான முகவரி

# voip_fi_caller_information_unknown_caller
source: Unknown number
ta: தெரியாத எண்

# voip_ib_call_not_possible_maximum_num_of_calls
source: End current call to start new call
ta: புதிய அழைப்பைத் தொடங்க தற்போதைய அழைப்பை முடிக்கவும்

# voip_ib_call_not_supported
source: This contact's application does not support calls
ta: இந்த தொடர்பின் பயன்பாடு அழைப்புகளை ஆதரிக்காது

# voip_ib_dtmf_not_supported
source: Call does not support DTMF tones
ta: அழைப்பு டிடிஎம்எஃப் டோன்களை ஆதரிக்காது

# voip_ib_error_in_contact
source: Unable to establish connection
ta: இணைப்பை நிறுவ முடியவில்லை

# voip_ib_microphone_muted
source: Microphone muted
ta: மைக்ரோஃபோன் முடக்கியது

# voip_ib_microphone_unmuted
source: Microphone unmuted
ta: மைக்ரோஃபோன் அசைக்கப்பட்டது

# voip_ib_not_enough_memory
source: Not enough memory
ta: போதுமான நினைவகம் இல்லை

# voip_ib_not_enough_memory_missed_call
source: Unable to accept incoming call. Not enough memory.
ta: உள்வரும் அழைப்பை ஏற்க முடியவில்லை. போதுமான நினைவகம் இல்லை.

# voip_ib_undefined_error
source: General error
ta: பொதுவான பிழை

# voip_me_menu_tools_accounts
source: Accounts
ta: கணக்குகள்

# voip_ni_unable_to_negotiate_codec
source: Codec incompatible with other party. Unable to start call.
ta: கோடெக் மற்ற கட்சிகளுடன் பொருந்தாது. அழைப்பைத் தொடங்க முடியவில்லை.

# voip_ti_dtmf_dialpad_title
source: Dialling pad
ta: டயலிங் பேட்

# voip_ti_manual_dial_title
source: Dialling pad
ta: டயலிங் பேட்

# voip_ti_manual_dial_title_portrait
source: Dialling pad
ta: டயலிங் பேட்
