Repository: 247i/TACETr
Catalog: உரை/தானி/maemo-leste-osso-addressbook-l10n-*.po
Languages: ta

# addr_ap_address_book
source: Contacts
ta: தொடர்புகள்

# addr_bd_browse
source: Browse
ta: உலாவு

# addr_bd_cont_starter_address
source: Address
ta: முகவரி

# addr_bd_cont_starter_address_home
source: home
ta: வீடு

# addr_bd_cont_starter_address_work
source: work
ta: வேலை

# addr_bd_cont_starter_birthday
source: Birthday
ta: பிறந்த நாள்

# addr_bd_cont_starter_call
source: %s call
ta: %s அழைப்பு

# addr_bd_cont_starter_email
source: E-mail
ta: மின்னஞ்சல்

# addr_bd_cont_starter_email_home
source: home
ta: வீடு

# addr_bd_cont_starter_email_work
source: work
ta: வேலை

# addr_bd_cont_starter_location
source: Location
ta: இடம்

# addr_bd_cont_starter_mobile
source: Mobile
ta: மொபைல்

# addr_bd_cont_starter_mobile_home
source: home
ta: வீடு

# addr_bd_cont_starter_mobile_work
source: work
ta: வேலை

# addr_bd_cont_starter_phone
source: Phone
ta: தொலைபேசி

# addr_bd_cont_starter_phone_fax
source: fax
ta: தொலைநகல்

# addr_bd_cont_starter_phone_home
source: home
ta: வீடு

# addr_bd_cont_starter_phone_other
source: other
ta: மற்றொன்று

# addr_bd_cont_starter_phone_work
source: work
ta: வேலை

# addr_bd_cont_starter_sip_audio
source: SIP audio
ta: சிப் ஆடியோ

# addr_bd_cont_starter_sip_out
source: SIP
ta: சிப்

# addr_bd_cont_starter_sip_out_home
source: home
ta: வீடு

# addr_bd_cont_starter_sip_out_work
source: work
ta: வேலை

# addr_bd_cont_starter_sip_video
source: SIP video
ta: சிப் வீடியோ

# addr_bd_cont_starter_skypeout
source: Call with Skype
ta: ச்கைப்புடன் அழைக்கவும்

# addr_bd_cont_starter_skypeout_home
source: home
ta: வீடு

# addr_bd_cont_starter_skypeout_work
source: work
ta: வேலை

# addr_bd_cont_starter_sms
source: SMS
ta: எச்.எம்.எச்

# addr_bd_cont_starter_sms_home
source: home
ta: வீடு

# addr_bd_cont_starter_sms_work
source: work
ta: வேலை

# addr_bd_cont_starter_video_call
source: %s video call
ta: %s வீடியோ அழைப்பு

# addr_bd_cont_starter_webpage
source: Web page
ta: வலைப்பக்கம்

# addr_bd_copy_sim
source: Copy
ta: நகலெடு

# addr_bd_delete_locally
source: Delete all contacts from device
ta: சாதனத்திலிருந்து அனைத்து தொடர்புகளையும் நீக்கவும்

# addr_bd_get_contacts_file
source: Import contacts
ta: தொடர்புகளை இறக்குமதி செய்யுங்கள்

# addr_bd_get_contacts_im_account
source: Import contacts from new account
ta: புதிய கணக்கிலிருந்து தொடர்புகளை இறக்குமதி செய்யுங்கள்

# addr_bd_get_contacts_sim_card
source: Copy from SIM card
ta: சிம் கார்டிலிருந்து நகலெடுக்கவும்

# addr_bd_get_contacts_sync
source: Synchronise from other device
ta: மற்ற சாதனங்களிலிருந்து ஒத்திசைக்கவும்

# addr_bd_get_from_file
source: Import contacts file
ta: தொடர்புகள் கோப்பை இறக்குமதி செய்யுங்கள்

# addr_bd_get_from_folder
source: Import contacts folder
ta: தொடர்புகள் கோப்புறையை இறக்குமதி செய்யுங்கள்

# addr_bd_import
source: Import
ta: இறக்குமதி

# addr_bd_import_exchange_contacts
source: Import Mail Exch. contacts
ta: இறக்குமதி அஞ்சல் பரிமாற்றம். தொடர்புகள்

# addr_bd_newedit_addfield
source: Add field
ta: புலத்தைச் சேர்க்கவும்

# addr_bd_newedit_address
source: Address
ta: முகவரி

# addr_bd_newedit_address_country
source: Region
ta: பகுதி

# addr_bd_newedit_birthday
source: Birthday
ta: பிறந்த நாள்

# addr_bd_newedit_email
source: E-mail
ta: மின்னஞ்சல்

# addr_bd_newedit_gender
source: Gender
ta: பாலினம்

# addr_bd_newedit_phone
source: Phone
ta: தொலைபேசி

# addr_bd_newedit_phone_mobile
source: Mobile
ta: மொபைல்

# addr_bd_newedit_removefield
source: Delete fields
ta: புலங்களை நீக்கு

# addr_bd_send_card_bluetooth
source: Bluetooth
ta: ஊடலை

# addr_bd_send_card_email
source: E-mail
ta: மின்னஞ்சல்

# addr_bd_send_card_sms
source: SMS
ta: எச்.எம்.எச்

# addr_bd_temporary_add
source: Merge with contact
ta: தொடர்புடன் ஒன்றிணைக்கவும்

# addr_bd_temporary_call
source: Call
ta: அழைப்பு

# addr_bd_temporary_chat
source: Instant message
ta: உடனடி செய்தி

# addr_bd_temporary_new
source: New contact
ta: புதிய தொடர்பு

# addr_bd_temporary_sip
source: SIP
ta: சிப்

# addr_bd_temporary_sipaudio
source: SIP audio
ta: சிப் ஆடியோ

# addr_bd_temporary_sipvideo
source: SIP video
ta: சிப் வீடியோ

# addr_bd_temporary_skypecall
source: Skype call
ta: ச்கைப் அழைப்பு

# addr_bd_temporary_skypechat
source: Skype chat
ta: ச்கைப் அரட்டை

# addr_bd_temporary_skypeout
source: Call with Skype
ta: ச்கைப்புடன் அழைக்கவும்

# addr_bd_temporary_sms
source: SMS
ta: எச்.எம்.எச்

# addr_bd_voicemail
source: Voicemail number
ta: குரல் அஞ்சல் எண்

# addr_fi_cont_starter_company
source: Company
ta: நிறுவனம்

# addr_fi_cont_starter_gender
source: Gender
ta: பாலினம்

# addr_fi_cont_starter_nickname
source: Nickname
ta: புனைப்பெயர்

# addr_fi_cont_starter_note
source: Note
ta: குறிப்பு

# addr_fi_cont_starter_title
source: Job title
ta: வேலை தலைப்பு

# addr_fi_display_sms_only_for_mobile
source: Display SMS only for Mobile numbers
ta: மொபைல் எண்களுக்கு மட்டுமே எச்எம்எச் காண்பி

# addr_fi_display_video_calling_options
source: Display video calling option
ta: வீடியோ அழைப்பு விருப்பத்தைக் காண்பி

# addr_fi_displayname
source: Display names
ta: பெயர்களைக் காண்பி

# addr_fi_export_wiz_st1a_all
source: All contacts
ta: அனைத்து தொடர்புகளும்

# addr_fi_export_wiz_st1a_format
source: Export:
ta: ஏற்றுமதி:

# addr_fi_export_wiz_st1a_selected
source: Selected contacts
ta: தேர்ந்தெடுக்கப்பட்ட தொடர்புகள்

# addr_fi_export_wiz_st2_format
source: Export to:
ta: ஏற்றுமதி:

# addr_fi_export_wiz_st3_location
source: Location
ta: இடம்

# addr_fi_export_wiz_st3_name_folder
source: Folder name
ta: கோப்புறை பெயர்

# addr_fi_mecard_address
source: Address
ta: முகவரி

# addr_fi_mecard_address_home
source: Address (home)
ta: முகவரி (வீடு)

# addr_fi_mecard_address_work
source: Address (work)
ta: முகவரி (வேலை)

# addr_fi_mecard_birthday
source: Birthday
ta: பிறந்த நாள்

# addr_fi_mecard_chat_googletalk
source: Google Talk user name
ta: கூகிள் பேச்சு பயனர் பெயர்

# addr_fi_mecard_chat_jabber
source: Jabber user name
ta: சாபர் பயனர் பெயர்

# addr_fi_mecard_chat_nokiachat
source: Nokia user name
ta: நோக்கியா பயனர் பெயர்

# addr_fi_mecard_chat_sip
source: SIP user name
ta: பயனர் பெயர்

# addr_fi_mecard_chat_skype
source: Skype Name
ta: ச்கைப் பெயர்

# addr_fi_mecard_company
source: Company
ta: நிறுவனம்

# addr_fi_mecard_email
source: E-mail
ta: மின்னஞ்சல்

# addr_fi_mecard_email_home
source: E-mail (home)
ta: மின்னஞ்சல் (வீடு)

# addr_fi_mecard_email_work
source: E-mail (work)
ta: மின்னஞ்சல் (வேலை)

# addr_fi_mecard_gender
source: Gender
ta: பாலினம்

# addr_fi_mecard_mobile
source: Mobile
ta: மொபைல்

# addr_fi_mecard_mobile_home
source: Mobile (home)
ta: மொபைல் (வீடு)

# addr_fi_mecard_mobile_work
source: Mobile (work)
ta: மொபைல் (வேலை)

# addr_fi_mecard_name
source: Name
ta: பெயர்

# addr_fi_mecard_nickname
source: Nickname
ta: புனைப்பெயர்

# addr_fi_mecard_note
source: Note
ta: குறிப்பு

# addr_fi_mecard_phone
source: Phone
ta: தொலைபேசி

# addr_fi_mecard_phone_fax
source: Fax
ta: தொலைநகல்

# addr_fi_mecard_phone_home
source: Phone (home)
ta: தொலைபேசி (வீடு)

# addr_fi_mecard_phone_work
source: Phone (work)
ta: தொலைபேசி (வேலை)

# addr_fi_mecard_title
source: Job title
ta: வேலை தலைப்பு

# addr_fi_mecard_webpage
source: Web page
ta: வலைப்பக்கம்

# addr_fi_newedit_address_city
source: City
ta: நகரம்

# addr_fi_newedit_address_extension
source: Extension
ta: நீட்டிப்பு

# addr_fi_newedit_address_p_o_box
source: PO Box
ta: போ பெட்டி

# addr_fi_newedit_address_postal
source: Postcode
ta: அஞ்சல் குறியீடு

# addr_fi_newedit_address_region
source: State/Province
ta: மாநில/மாகாணம்

# addr_fi_newedit_address_street
source: Street
ta: தெரு

# addr_fi_newedit_company
source: Company
ta: நிறுவனம்

# addr_fi_newedit_first_name
source: First name
ta: முதல் பெயர்

# addr_fi_newedit_gtalk_chat
source: Google Talk user name
ta: கூகிள் பேச்சு பயனர் பெயர்

# addr_fi_newedit_jabber_chat
source: Jabber user name
ta: சாபர் பயனர் பெயர்

# addr_fi_newedit_last_name
source: Last name
ta: கடைசி பெயர்

# addr_fi_newedit_nickname
source: Nickname
ta: புனைப்பெயர்

# addr_fi_newedit_nokia_chat
source: Nokia user name
ta: நோக்கியா பயனர் பெயர்

# addr_fi_newedit_note
source: Note
ta: குறிப்பு

# addr_fi_newedit_sip_chat
source: SIP user name
ta: பயனர் பெயர்

# addr_fi_newedit_skype_chat
source: Skype Name
ta: ச்கைப் பெயர்

# addr_fi_newedit_title
source: Job title
ta: வேலை தலைப்பு

# addr_fi_newedit_webpage
source: Web page
ta: வலைப்பக்கம்

# addr_fi_search_find_toolbar
source: Search
ta: தேடல்

# addr_fi_solve_conflict_birthday
source: Birthday
ta: பிறந்த நாள்

# addr_fi_solve_conflict_company
source: Company
ta: நிறுவனம்

# addr_fi_solve_conflict_first
source: First name
ta: முதல் பெயர்

# addr_fi_solve_conflict_gender
source: Gender
ta: பாலினம்

# addr_fi_solve_conflict_last
source: Last name
ta: கடைசி பெயர்

# addr_fi_solve_conflict_nick
source: Nickname
ta: புனைப்பெயர்

# addr_fi_solve_conflict_title
source: Job title
ta: வேலை தலைப்பு

# addr_fi_voicemailbox
source: Voicemail
ta: குரல் அஞ்சல்

# addr_ia_export_wiz_st1_msg
source: Export contacts wizard allows you to export your contacts so you can transfer them to other applications. Tap 'Next' to continue.
ta: ஏற்றுமதி தொடர்புகள் வழிகாட்டி உங்கள் தொடர்புகளை ஏற்றுமதி செய்ய உங்களை அனுமதிக்கிறது, எனவே அவற்றை பிற பயன்பாடுகளுக்கு மாற்றலாம். தொடர 'அடுத்து' தட்டவும்.

# addr_ia_export_wiz_st4_msg_fail
source: Export contacts failed. Tap 'Previous' to try again or tap outside dialog to close wizard.
ta: ஏற்றுமதி தொடர்புகள் தோல்வியடைந்தன. மீண்டும் முயற்சிக்க 'முந்தைய' என்பதைத் தட்டவும் அல்லது வழிகாட்டி மூடுவதற்கு வெளியே உரையாடலைத் தட்டவும்.

# addr_ia_export_wiz_st4_msg_folder
source: Export contacts setup is complete. Contacts have been exported to %s folder. Tap 'Finish' to exit the wizard.
ta: ஏற்றுமதி தொடர்புகள் அமைப்பு முடிந்தது. தொடர்புகள் %s கோப்புறைக்கு ஏற்றுமதி செய்யப்பட்டுள்ளன. வழிகாட்டி வெளியேற 'பூச்சு' தட்டவும்.

# addr_ia_export_wiz_st4_msg_memfail
source: Export contacts failed. Not enough memory. Tap 'Previous' to try again or tap outside dialog to close wizard.
ta: ஏற்றுமதி தொடர்புகள் தோல்வியடைந்தன. போதுமான நினைவகம் இல்லை. மீண்டும் முயற்சிக்க 'முந்தைய' என்பதைத் தட்டவும் அல்லது வழிகாட்டி மூடுவதற்கு வெளியே உரையாடலைத் தட்டவும்.

# addr_ia_export_wiz_st4_msg_storefail
source: Export contacts failed. Not enough memory in target location. Tap 'Previous' and select another location to try again or tap outside dialog to close wizard.
ta: ஏற்றுமதி தொடர்புகள் தோல்வியடைந்தன. இலக்கு இடத்தில் போதுமான நினைவகம் இல்லை. 'முந்தைய' என்பதைத் தட்டவும், மீண்டும் முயற்சிக்க மற்றொரு இருப்பிடத்தைத் தேர்ந்தெடுக்கவும் அல்லது வழிகாட்டி மூடுவதற்கு வெளியே உரையாடலைத் தட்டவும்.

# addr_ia_no_contacts
source: (no contacts)
ta: (தொடர்புகள் இல்லை)

# addr_ia_no_details
source: (no details)
ta: (விவரங்கள் இல்லை)

# addr_ia_request_author_text1
source: Authorise %s to see your availability?
ta: உங்கள் கிடைக்கும் தன்மையைக் காண %s அங்கீகரிக்கவா?

# addr_ia_search_not_found
source: No contacts found
ta: தொடர்புகள் எதுவும் கிடைக்கவில்லை

# addr_ib_cannot_load_picture
source: Unable to open image. It may be corrupted.
ta: படத்தைத் திறக்க முடியவில்லை. அது சிதைக்கப்படலாம்.

# addr_ib_cannot_show_contact
source: Unable to display contact information. Contact may have been deleted or IM account with contact may have been removed.
ta: தொடர்பு தகவல்களைக் காட்ட முடியவில்லை. தொடர்பு நீக்கப்பட்டிருக்கலாம் அல்லது தொடர்புடன் IM கணக்கு அகற்றப்பட்டிருக்கலாம்.

# addr_ib_contact_is_offline
source: Unable to call. Contact offline.
ta: அழைக்க முடியவில்லை. ஆஃப்லைனில் தொடர்பு கொள்ளவும்.

# addr_ib_contact_not_selectable
source: Unable to select contact. Context not supported.
ta: தொடர்பைத் தேர்ந்தெடுக்க முடியவில்லை. சூழல் ஆதரிக்கப்படவில்லை.

# addr_ib_disc_full
source: Unable to perform operation. Device storage full.
ta: செயல்பாட்டைச் செய்ய முடியவில்லை. சாதன சேமிப்பு நிரம்பியுள்ளது.

# addr_ib_field_amount_limited
source: Unable to add a new field. Maximum number of fields reached.
ta: புதிய புலத்தைச் சேர்க்க முடியவில்லை. அதிகபட்ச புலங்கள் அடைந்தன.

# addr_ib_file_name_empty
source: Enter file name first
ta: முதலில் கோப்பு பெயரை உள்ளிடவும்

# addr_ib_imported_partially_many_s_f
source: %d contacts imported. %d failed.
ta: இறக்குமதி செய்யப்பட்ட %d தொடர்புகள். %d தோல்வியுற்றது.

# addr_ib_imported_partially_one_f
source: %d contacts imported. 1 failed.
ta: இறக்குமதி செய்யப்பட்ட %d தொடர்புகள். 1 தோல்வியுற்றது.

# addr_ib_imported_partially_one_s
source: 1 contact imported. %d failed.
ta: 1 தொடர்பு இறக்குமதி செய்யப்பட்டது. %d தோல்வியுற்றது.

# addr_ib_imported_successfully
source: Contact imported
ta: இறக்குமதி செய்யப்பட்ட தொடர்பு

# addr_ib_imported_successfully_plural
source: Contacts imported
ta: இறக்குமதி செய்யப்பட்ட தொடர்புகள்

# addr_ib_imported_zero_contacts
source: No contacts found
ta: தொடர்புகள் எதுவும் கிடைக்கவில்லை

# addr_ib_invalid_username_call
source: Unable to initiate VoIP call. User name %s does not exist.
ta: VoIP அழைப்பைத் தொடங்க முடியவில்லை. பயனர் பெயர் %s இல்லை.

# addr_ib_invalid_username_chat
source: Unable to initiate Instant message. User name %s does not exist.
ta: உடனடி செய்தியைத் தொடங்க முடியவில்லை. பயனர் பெயர் %s இல்லை.

# addr_ib_maps_failed
source: Unable to open Maps. Address may be invalid.
ta: வரைபடங்களைத் திறக்க முடியவில்லை. முகவரி தவறானது.

# addr_ib_maps_server_timeout
source: Unable to open Maps. Server not responding.
ta: வரைபடங்களைத் திறக்க முடியவில்லை. சேவையகம் பதிலளிக்கவில்லை.

# addr_ib_no_name_given
source: Enter name for contact
ta: தொடர்புக்கு பெயரை உள்ளிடவும்

# addr_ib_not_available
source: Not available
ta: கிடைக்கவில்லை

# addr_ib_not_enough_memory
source: Unable to perform operation. Not enough memory.
ta: செயல்பாட்டைச் செய்ய முடியவில்லை. போதுமான நினைவகம் இல்லை.

# addr_ib_permission_denied
source: Unable to perform operation. Permission denied.
ta: செயல்பாட்டைச் செய்ய முடியவில்லை. இசைவு மறுக்கப்பட்டது.

# addr_ib_request_author_resend
source: Sending authorisation request to %s
ta: %s க்கு அங்கீகார கோரிக்கையை அனுப்புகிறது

# addr_ib_searching
source: Searching
ta: தேடுகிறது

# addr_ib_shortcut_created
source: Shortcut created on desktop.
ta: சார்ட்கட் டெச்க்டாப்பில் உருவாக்கப்பட்டது.

# addr_ib_system_error
source: Unable to perform operation. Internal error.
ta: செயல்பாட்டைச் செய்ய முடியவில்லை. உள் பிழை.

# addr_ib_unable_to_save
source: Unable to save
ta: சேமிக்க முடியவில்லை

# addr_ib_undefined_error
source: Undefined error
ta: வரையறுக்கப்படாத பிழை

# addr_ib_unknown_number
source: Unknown number. Unable to display contact information.
ta: தெரியாத எண். தொடர்பு தகவல்களைக் காட்ட முடியவில்லை.

# addr_li_alpha_1
source: ABC
ta: ஏபிசி

# addr_li_alpha_11
source: ABC
ta: ஏபிசி

# addr_li_alpha_2
source: DEF
ta: டெஃப்

# addr_li_alpha_22
source: DEF
ta: டெஃப்

# addr_li_alpha_3
source: GHI
ta: கவனத்தில் கொள்ளுங்கள்

# addr_li_alpha_33
source: GHI
ta: கவனத்தில் கொள்ளுங்கள்

# addr_li_alpha_4
source: JKL
ta: சல்லிகள்

# addr_li_alpha_44
source: JKL
ta: சல்லிகள்

# addr_li_alpha_7
source: STU
ta: ச்டு

# addr_li_alpha_77
source: STU
ta: ச்டு

# addr_li_alpha_8
source: V-Z
ta: வி-இசட்

# addr_li_sel_contact_none
source: (no contacts)
ta: (தொடர்புகள் இல்லை)

# addr_li_select_picture_none
source: (no images)
ta: (படங்கள் இல்லை)

# addr_li_unnamed_contact
source: No name
ta: பெயர் இல்லை

# addr_me_abc
source: ABC
ta: ஏபிசி

# addr_me_accounts
source: Accounts
ta: கணக்குகள்

# addr_me_communication_history
source: Communication history
ta: தொடர்பு வரலாறு

# addr_me_copy_to_contacts
source: Copy to Contacts
ta: தொடர்புகளுக்கு நகலெடுக்கவும்

# addr_me_create_shortcut
source: Create shortcut
ta: குறுக்குவழியை உருவாக்கவும்

# addr_me_cs_addtocontacts
source: Add to Contacts
ta: தொடர்புகளில் சேர்க்கவும்

# addr_me_edit_contact
source: Edit
ta: தொகு

# addr_me_editmyinfo
source: Edit
ta: தொகு

# addr_me_email
source: E-mail
ta: மின்னஞ்சல்

# addr_me_export
source: Export
ta: ஏற்றுமதி

# addr_me_groups
source: Groups
ta: குழுக்கள்

# addr_me_imaccounts
source: VoIP and IM accounts
ta: VoIP மற்றும் IM கணக்குகள்

# addr_me_import
source: Get contacts
ta: தொடர்புகளைப் பெறுங்கள்

# addr_me_importall
source: Copy all contacts
ta: அனைத்து தொடர்புகளையும் நகலெடுக்கவும்

# addr_me_importsel
source: Copy selected contacts
ta: தேர்ந்தெடுக்கப்பட்ட தொடர்புகளை நகலெடுக்கவும்

# addr_me_mecard
source: My information
ta: எனது செய்தி

# addr_me_merge_contact
source: Merge contact
ta: தொடர்பை ஒன்றிணைக்கவும்

# addr_me_new_contact
source: New contact
ta: புதிய தொடர்பு

# addr_me_recent
source: Recent
ta: அண்மைக் கால

# addr_me_remove_contact
source: Delete contact
ta: தொடர்பை நீக்கு

# addr_me_remove_contacts
source: Delete contacts
ta: தொடர்புகளை நீக்கு

# addr_me_request_author
source: Authorisation request
ta: அங்கீகார கோரிக்கை

# addr_me_send_card
source: Send contact card
ta: தொடர்பு அட்டையை அனுப்பவும்

# addr_me_send_detail
source: Send contact detail
ta: தொடர்பு விவரங்களை அனுப்பவும்

# addr_me_sendmycard
source: Send contact card
ta: தொடர்பு அட்டையை அனுப்பவும்

# addr_me_sendmydetail
source: Send contact detail
ta: தொடர்பு விவரங்களை அனுப்பவும்

# addr_me_settings
source: Settings
ta: அமைப்புகள்

# addr_me_status
source: Availability
ta: கிடைக்கும் தன்மை

# addr_nc_delete_all_locally
source: Delete all contacts from device? IM contacts are not deleted from the server.
ta: சாதனத்திலிருந்து அனைத்து தொடர்புகளையும் நீக்கவா? IM தொடர்புகள் சேவையகத்திலிருந்து நீக்கப்படவில்லை.

# addr_nc_delete_field
source: Delete field?
ta: புலத்தை நீக்கவா?

# addr_nc_delete_fields
source: Delete fields?
ta: புலங்களை நீக்கவா?

# addr_nc_delete_im_username_field
source: Delete IM username? %s Deleting this IM username will also remove it from %s.
ta: IM பயனர்பெயரை நீக்கவா? %s இந்த IM பயனர்பெயரை நீக்குவது %s இலிருந்து அதை அகற்றும்.

# addr_nc_delete_im_username_fields
source: Delete selected IM usernames? Deleting IM usernames will also remove them from %s.
ta: தேர்ந்தெடுக்கப்பட்ட IM பயனர்பெயர்களை நீக்கவா? IM பயனர்பெயர்களை நீக்குவது %s இலிருந்து அவற்றை அகற்றும்.

# addr_nc_delete_im_username_fields_several_services
source: Delete selected IM usernames? Deleting IM usernames will also remove them from the IM service.
ta: தேர்ந்தெடுக்கப்பட்ட IM பயனர்பெயர்களை நீக்கவா? IM பயனர்பெயர்களை நீக்குவதும் அவற்றை IM சேவையிலிருந்து அகற்றும்.

# addr_nc_notification14
source: No contacts can be found for this service in Contacts. Create new contact now?
ta: இந்த சேவைக்கு தொடர்புகளில் எந்த தொடர்புகளையும் காண முடியாது. இப்போது புதிய தொடர்பை உருவாக்கவா?

# addr_nc_notification15
source: Import to Contacts?
ta: தொடர்புகளுக்கு இறக்குமதி செய்யவா?

# addr_nc_notification16
source: Delete contact? %s
ta: தொடர்புகளை நீக்கு

# addr_nc_notification19
source: Server time-out. Contacts should be restarted. Restart now?
ta: சேவையக நேரம்-அவுட். தொடர்புகளை மறுதொடக்கம் செய்ய வேண்டும். இப்போது மறுதொடக்கம் செய்யவா?

# addr_nc_notification7
source: Delete selected contacts?
ta: தேர்ந்தெடுக்கப்பட்ட தொடர்புகளை நீக்கவா?

# addr_nc_notification_im_username
source: Delete contact? %s Deleting this contact will also remove it from %s.
ta: தொடர்பை நீக்கவா? %s இந்த தொடர்பை நீக்குவது %s இலிருந்து அதை அகற்றும்.

# addr_nc_notification_im_username_multiple
source: Delete selected contacts? Deleting contacts will also remove them from %s.
ta: தேர்ந்தெடுக்கப்பட்ட தொடர்புகளை நீக்கவா? தொடர்புகளை நீக்குவது அவற்றை %s இலிருந்து அகற்றும்.

# addr_nc_notification_im_username_multiple_several_services
source: Delete selected contacts? Deleting contacts will also remove them from the IM services.
ta: தேர்ந்தெடுக்கப்பட்ட தொடர்புகளை நீக்கவா? தொடர்புகளை நீக்குவது அவற்றை IM சேவைகளிலிருந்து அகற்றும்.

# addr_nc_notification_im_username_several_services
source: Delete contact? %s Deleting this contact will also remove it from the IM services.
ta: தொடர்பை நீக்கவா? %s இந்த தொடர்பை நீக்குவது IM சேவைகளிலிருந்தும் அதை அகற்றும்.

# addr_nc_send_avatar
source: Do you also want to send the avatar?
ta: அவதாரத்தையும் அனுப்ப விரும்புகிறீர்களா?

# addr_ni_importing_fail
source: Import failed
ta: இறக்குமதி தோல்வியடைந்தது

# addr_ni_importing_fail_format
source: Import failed. Format not recognised.
ta: இறக்குமதி தோல்வியடைந்தது. வடிவம் அங்கீகரிக்கப்படவில்லை.

# addr_ni_importing_fail_mem
source: Import failed. Not enough memory.
ta: இறக்குமதி தோல்வியடைந்தது. போதுமான நினைவகம் இல்லை.

# addr_ni_importing_fail_size
source: Import failed. File too large.
ta: இறக்குமதி தோல்வியடைந்தது. கோப்பு மிகப் பெரியது.

# addr_ni_internal_error
source: Internal error. Contacts must be restarted.
ta: உள் பிழை. தொடர்புகள் மறுதொடக்கம் செய்யப்பட வேண்டும்.

# addr_pb_exporting_contacts
source: Exporting contacts
ta: தொடர்புகளை ஏற்றுமதி செய்தல்

# addr_pb_importing_contacts
source: Importing contacts
ta: தொடர்புகளை இறக்குமதி செய்தல்

# addr_pb_load_contacts
source: Loading contacts
ta: தொடர்புகளை ஏற்றுகிறது

# addr_pb_notification13
source: Importing contacts
ta: தொடர்புகளை இறக்குமதி செய்தல்

# addr_pb_searching_contacts
source: Searching contacts
ta: தொடர்புகளைத் தேடுகிறது

# addr_ti_add_field_title
source: New field
ta: புதிய புலம்

# addr_ti_choose_own_account_bind
source: Select your own account
ta: உங்கள் சொந்த கணக்கைத் தேர்ந்தெடுக்கவும்

# addr_ti_choose_own_account_chat
source: Select an account to use with this contact
ta: இந்த தொடர்புடன் பயன்படுத்த ஒரு கணக்கைத் தேர்ந்தெடுக்கவும்

# addr_ti_choose_own_account_voip
source: Select an account to use with this contact
ta: இந்த தொடர்புடன் பயன்படுத்த ஒரு கணக்கைத் தேர்ந்தெடுக்கவும்

# addr_ti_crop_avatar_title
source: Crop avatar
ta: பயிர் அவதார்

# addr_ti_delete_field
source: Delete fields
ta: புலங்களை நீக்கு

# addr_ti_dia_select_contacts
source: Select contacts
ta: தொடர்புகளைத் தேர்ந்தெடுக்கவும்

# addr_ti_export_wiz_st1
source: Export contacts 1/5: Welcome
ta: ஏற்றுமதி தொடர்புகள் 1/5: வரவேற்கிறோம்

# addr_ti_export_wiz_st1a
source: Export contacts 2/5: Contacts to export
ta: ஏற்றுமதி தொடர்புகள் 2/5: ஏற்றுமதிக்கான தொடர்புகள்

# addr_ti_export_wiz_st2
source: Export contacts 3/5: File format
ta: ஏற்றுமதி தொடர்புகள் 3/5: கோப்பு வடிவம்

# addr_ti_export_wiz_st3_folder
source: Export contacts 4/5: Folder and location
ta: ஏற்றுமதி தொடர்புகள் 4/5: கோப்புறை மற்றும் இருப்பிடம்

# addr_ti_export_wiz_st4
source: Export contacts 5/5: Complete
ta: ஏற்றுமதி தொடர்புகள் 5/5: முழுமையானது

# addr_ti_export_wiz_st4_fail
source: Export contacts step 5/5: Failed
ta: ஏற்றுமதி தொடர்புகள் படி 5/5: தோல்வியுற்றது

# addr_ti_get_contacts
source: Get contacts
ta: தொடர்புகளைப் பெறுங்கள்

# addr_ti_groups_title
source: Groups
ta: குழுக்கள்

# addr_ti_import_contact_folder_title
source: Import contacts folder
ta: தொடர்புகள் கோப்புறையை இறக்குமதி செய்யுங்கள்

# addr_ti_import_contact_title
source: Import contacts file
ta: தொடர்புகள் கோப்பை இறக்குமதி செய்யுங்கள்

# addr_ti_import_contacts
source: Import contacts
ta: தொடர்புகளை இறக்குமதி செய்யுங்கள்

# addr_ti_main_view
source: All contacts (%d)
ta: அனைத்து தொடர்புகளும் (%d)

# addr_ti_main_view_loading
source: All contacts
ta: அனைத்து தொடர்புகளும்

# addr_ti_main_view_recent
source: Recent contacts
ta: அண்மைக் கால தொடர்புகள்

# addr_ti_mecard_title
source: My information
ta: எனது செய்தி

# addr_ti_mecard_title_add_my_information
source: Add my information
ta: எனது தகவலைச் சேர்க்கவும்

# addr_ti_merge_contacts
source: Merge with contact
ta: தொடர்புடன் ஒன்றிணைக்கவும்

# addr_ti_newedit_edit_my_information_title
source: Edit My information
ta: எனது தகவலைத் திருத்தவும்

# addr_ti_newedit_edit_title
source: Edit contact
ta: தொடர்பைத் திருத்து

# addr_ti_newedit_new_title
source: New contact
ta: புதிய தொடர்பு

# addr_ti_request_author
source: %s Authorisation request
ta: %s அங்கீகார கோரிக்கை

# addr_ti_search_exchange_contacts
source: Search Mail Exch. contacts
ta: தேடல் அஞ்சல் பரிமாற்றம். தொடர்புகள்

# addr_ti_sel_contact
source: Select contact
ta: தொடர்பைத் தேர்ந்தெடுக்கவும்

# addr_ti_select_avatar
source: Select image
ta: படத்தைத் தேர்ந்தெடுக்கவும்

# addr_ti_select_contact_detail
source: Send contact detail
ta: தொடர்பு விவரங்களை அனுப்பவும்

# addr_ti_select_picture_title
source: Select image
ta: படத்தைத் தேர்ந்தெடுக்கவும்
