Repository: 247i/TACETr
Catalog: உரை/தானி/maemo-leste-ke-recv-l10n-*.po
Languages: ta

# card_connected_via_usb_card
source: Only device storage connected. %s already in use.
ta: சாதன சேமிப்பக இணைப்பு மட்டுமே. %ஏற்கனவே பயன்பாட்டில் உள்ளது.

# card_connected_via_usb_device
source: Only %s connected. Device storage in use.
ta: %s மட்டுமே இணைக்கப்பட்டுள்ளன. பயன்பாட்டில் சாதன சேமிப்பு.

# card_ia_corrupted
source: Memory is read-only until fixed. Try fixing memory with a PC after plugging in USB cable. Create data backup first to save existing memory contents.
ta: சரி செய்யப்படும் வரை நினைவகம் மட்டுமே படிக்கப்படுகிறது. யூ.எச்.பி கேபிளில் செருகிய பின் கணினியுடன் நினைவகத்தை சரிசெய்ய முயற்சிக்கவும். ஏற்கனவே உள்ள நினைவக உள்ளடக்கங்களைச் சேமிக்க முதலில் தரவு காப்புப்பிரதியை உருவாக்கவும்.

# card_ib_formatting_complete
source: Formatting complete
ta: வடிவமைப்பு முழுமையானது

# card_ib_unknown_format_card
source: Memory card format unsupported
ta: நினைவக அட்டை வடிவம் ஆதரிக்கப்படவில்லை

# card_ib_unknown_format_device
source: Device storage format unsupported
ta: சாதன சேமிப்பு வடிவம் ஆதரிக்கப்படவில்லை

# card_ib_usb_disconnected
source: USB cable disconnected
ta: யூ.எச்.பி கேபிள் துண்டிக்கப்பட்டது

# card_ni_usb_failed_card_in_use
source: Unable to connect via USB. Device storage in use.
ta: யூ.எச்.பி வழியாக இணைக்க முடியவில்லை. சாதன சேமிப்பு பயன்பாட்டில்.

# card_ni_usb_failed_cards_in_use
source: Unable to connect via USB. Memories in use. Device storage %s
ta: யூ.எச்.பி வழியாக இணைக்க முடியவில்லை. பயன்பாட்டில் உள்ள நினைவுகள். சாதன சேமிப்பு %s

# card_nw_formatting_memory_card
source: Formatting memory
ta: நினைவகத்தை வடிவமைத்தல்

# card_ti_corrupted_card
source: Memory card corrupted
ta: நினைவக அட்டை சிதைந்தது

# card_ti_corrupted_device
source: Device storage corrupted
ta: சாதன சேமிப்பு சிதைந்தது

# cards_connected_via_usb
source: Connected via USB
ta: யூ.எச்.பி வழியாக இணைக்கப்பட்டுள்ளது

# cerm_device_memory_full
source: %s Device storage full. Remove data to free memory.
ta: %s சாதன சேமிப்பு நிரம்பியுள்ளது. இலவச நினைவகத்திற்கு தரவை அகற்று.

# cerm_memory_card_full
source: Memory card full. Remove data to free memory.
ta: நினைவக அட்டை நிரம்பியுள்ளது. இலவச நினைவகத்திற்கு தரவை அகற்று.

# cerm_system_memory_full
source: Device system storage full. Remove applications via Application manager to free memory.
ta: சாதன அமைப்பு சேமிப்பு நிரம்பியுள்ளது. இலவச நினைவகத்திற்கு பயன்பாட்டு மேலாளர் வழியாக பயன்பாடுகளை அகற்றவும்.

# memr_bd_close_applications_ok
source: Stop
ta: நிறுத்து

# memr_ia_close_applications_application_list
source: Close
ta: மூடு

# memr_ia_close_applications_opening
source: Too many applications open. Unable to open additional applications without closing some applications.
ta: பல பயன்பாடுகள் திறக்கப்படுகின்றன. சில பயன்பாடுகளை மூடாமல் கூடுதல் பயன்பாடுகளைத் திறக்க முடியவில்லை.

# memr_ia_close_applications_switching
source: Too many applications open. Unable to switch to requested application without closing some applications.
ta: பல பயன்பாடுகள் திறக்கப்படுகின்றன. சில பயன்பாடுகளை மூடாமல் கோரப்பட்ட பயன்பாட்டிற்கு மாற முடியவில்லை.

# memr_ib_operation_disabled
source: Operation temporarily disabled due to low memory
ta: குறைந்த நினைவகம் காரணமாக செயல்பாடு தற்காலிகமாக முடக்கப்பட்டுள்ளது

# memr_ni_application_closed_no_resources
source: Internal error. Application '%s' closed.
ta: உள் பிழை. பயன்பாடு '%' மூடப்பட்டுள்ளது.

# memr_ti_close_applications
source: Close applications
ta: பயன்பாடுகளை மூடு
