Repository: 247i/TACETr
Catalog: உரை/தானி/maemo-leste-osso-system-lock-l10n-*.po
Languages: ta

# lock_ap_application_title
source: Device lock
ta: சாதன பூட்டு

# lock_error_alphanumeric
source: Code must contain both numbers and letters.
ta: குறியீட்டில் எண்கள் மற்றும் எழுத்துக்கள் இரண்டுமே இருக்க வேண்டும்.

# lock_error_emergencycallfails
source: Emergency call not established
ta: அவசர அழைப்பு நிறுவப்படவில்லை

# lock_error_history
source: Previously used codes can not be reused.
ta: முன்னர் பயன்படுத்தப்பட்ட குறியீடுகளை மீண்டும் பயன்படுத்த முடியாது.

# lock_error_internalstorageread
source: Unable to read the lock code. Default lock code will be restored.
ta: பூட்டு குறியீட்டைப் படிக்க முடியவில்லை. இயல்புநிலை பூட்டு குறியீடு மீட்டமைக்கப்படும்.

# lock_error_internalstoragewrite
source: Unable to save lock code. Default lock code will be restored.
ta: பூட்டு குறியீட்டை சேமிக்க முடியவில்லை. இயல்புநிலை பூட்டு குறியீடு மீட்டமைக்கப்படும்.

# lock_error_nonalphabetical
source: Code must contain at least %d numbers or symbols
ta: குறியீட்டில் குறைந்தது %d எண்கள் அல்லது சின்னங்கள் இருக்க வேண்டும்

# lock_error_toosimple
source: Code must not contain only numbers.
ta: குறியீட்டில் எண்கள் மட்டுமே இருக்கக்கூடாது.

# secu_application_title
source: Enter lock code
ta: பூட்டு குறியீட்டை உள்ளிடவும்

# secu_application_title_changelock1
source: Lock code
ta: பூட்டு குறியீடு

# secu_ib_autolock_required
source: Automatic device lock is required by Exchange security policy.
ta: பரிமாற்ற பாதுகாப்புக் கொள்கையால் தானியங்கி சாதன பூட்டு தேவைப்படுகிறது.

# secu_ib_codedonotmatch
source: Codes do not match
ta: குறியீடுகள் பொருந்தவில்லை

# secu_ib_lock_code_shorter_than
source: Code length must be at least %d characters.
ta: குறியீடு நீளம் குறைந்தது %d எழுத்துக்கள் இருக்க வேண்டும்.

# secu_ib_lockcodechanged
source: Lock code changed
ta: பூட்டு குறியீடு மாற்றப்பட்டது

# secu_ib_lockcodenotchanged
source: Lock code not changed
ta: பூட்டு குறியீடு மாற்றப்படவில்லை

# secu_ib_lockcodetooshort
source: At least 5 digits must be entered
ta: குறைந்தது 5 இலக்கங்களை உள்ளிட வேண்டும்

# secu_in_device_wipe_one_try
source: Incorrect code. All data will be removed from device after one more incorrect entry.
ta: தவறான குறியீடு. இன்னும் ஒரு தவறான நுழைவுக்குப் பிறகு எல்லா தரவுகளும் சாதனத்திலிருந்து அகற்றப்படும்.

# secu_in_device_wipe_two_tries
source: Incorrect code. All data will be removed from device after two more incorrect entries.
ta: தவறான குறியீடு. மேலும் இரண்டு தவறான உள்ளீடுகளுக்குப் பிறகு எல்லா தரவுகளும் சாதனத்திலிருந்து அகற்றப்படும்.

# secu_info_closedevice
source: Switch off device?
ta: சாதனத்தை அணைக்கவா?

# secu_info_codeaccepted
source: Code accepted
ta: குறியீடு ஏற்றுக்கொள்ளப்பட்டது

# secu_info_enterlock
source: Enter lock code to lock device
ta: சாதனத்திற்கு பூட்டு குறியீட்டை உள்ளிடவும்

# secu_info_incorrectcode
source: Incorrect code
ta: தவறான குறியீடு

# secu_info_locked
source: Device locked
ta: சாதனம் பூட்டப்பட்டுள்ளது

# secu_info_notlocked
source: Device not locked
ta: சாதனம் பூட்டப்படவில்லை

# secu_lock_code_dialog_emergency_call
source: Emergency call
ta: அவசர அழைப்பு

# secu_security_autolock_dialog_change_lock_code
source: Change lock code
ta: பூட்டு குறியீட்டை மாற்றவும்

# secu_security_dialog_title
source: Device lock
ta: சாதன பூட்டு

# secu_security_ti_autolock
source: Autolock
ta: ஆட்டோலாக்

# secu_swipe_to_unlock
source: Swipe to unlock
ta: திறக்க ச்வைப் செய்யவும்

# secu_ti_changelock_1
source: Enter current lock code
ta: தற்போதைய பூட்டு குறியீட்டை உள்ளிடவும்

# secu_ti_changelock_2
source: Enter new lock code
ta: புதிய பூட்டு குறியீட்டை உள்ளிடவும்

# secu_ti_changelock_3
source: Verify new lock code
ta: புதிய பூட்டு குறியீட்டை சரிபார்க்கவும்

# secu_va_10minutes
source: After 10 minutes
ta: 10 நிமிடங்களுக்குப் பிறகு

# secu_va_1hour
source: After 1 hour
ta: 1 மணி நேரம் கழித்து

# secu_va_30minutes
source: After 30 minutes
ta: 30 நிமிடங்களுக்குப் பிறகு

# secu_va_5minutes
source: After 5 minutes
ta: 5 நிமிடங்களுக்குப் பிறகு

# secu_va_disabled
source: Disabled
ta: முடக்கப்பட்டது
