Repository: 247i/TACETr
Catalog: உரை/தானி/maemo-leste-osso-addressbook-l10n-*.po
Languages: ta

# addr_ti_send_card
source: Send contact card via
ta: தொடர்பு அட்டையை வழியாக அனுப்பவும்

# addr_ti_send_card_detail
source: Send contact detail via
ta: தொடர்பு விவரங்களை அனுப்பவும்

# addr_ti_settings2
source: Settings
ta: அமைப்புகள்

# addr_ti_solve_conflict
source: Resolve merge conflicts
ta: ஒன்றிணைக்கும் மோதல்களைத் தீர்க்கவும்

# addr_ti_view_select_contacts
source: Select contacts
ta: தொடர்புகளைத் தேர்ந்தெடுக்கவும்

# addr_ti_voicemail_contact_title
source: Voicemail
ta: குரல் அஞ்சல்

# addr_va_add_field_address
source: Address
ta: முகவரி

# addr_va_add_field_address_home
source: Address (home)
ta: முகவரி (வீடு)

# addr_va_add_field_address_work
source: Address (work)
ta: முகவரி (வேலை)

# addr_va_add_field_birthday
source: Birthday
ta: பிறந்த நாள்

# addr_va_add_field_chat_googletalk
source: Google Talk user name
ta: கூகிள் பேச்சு பயனர் பெயர்

# addr_va_add_field_chat_jabber
source: Jabber user name
ta: சாபர் பயனர் பெயர்

# addr_va_add_field_chat_nokiachat
source: Nokia user name
ta: நோக்கியா பயனர் பெயர்

# addr_va_add_field_chat_sip
source: SIP user name
ta: பயனர் பெயர்

# addr_va_add_field_chat_skype
source: Skype Name
ta: ச்கைப் பெயர்

# addr_va_add_field_company
source: Company
ta: நிறுவனம்

# addr_va_add_field_email
source: E-mail
ta: மின்னஞ்சல்

# addr_va_add_field_email_home
source: E-mail (home)
ta: மின்னஞ்சல் (வீடு)

# addr_va_add_field_email_work
source: E-mail (work)
ta: மின்னஞ்சல் (வேலை)

# addr_va_add_field_gender
source: Gender
ta: பாலினம்

# addr_va_add_field_mobile
source: Mobile
ta: மொபைல்

# addr_va_add_field_mobile_home
source: Mobile (home)
ta: மொபைல் (வீடு)

# addr_va_add_field_mobile_work
source: Mobile (work)
ta: மொபைல் (வேலை)

# addr_va_add_field_nickname
source: Nickname
ta: புனைப்பெயர்

# addr_va_add_field_note
source: Note
ta: குறிப்பு

# addr_va_add_field_phone
source: Phone
ta: தொலைபேசி

# addr_va_add_field_phone_fax
source: Fax
ta: தொலைநகல்

# addr_va_add_field_phone_home
source: Phone (home)
ta: தொலைபேசி (வீடு)

# addr_va_add_field_phone_work
source: Phone (work)
ta: தொலைபேசி (வேலை)

# addr_va_add_field_title
source: Job title
ta: வேலை தலைப்பு

# addr_va_add_field_webpage
source: Web page
ta: வலைப்பக்கம்

# addr_va_emergency_number
source: Emergency number
ta: அவசர எண்

# addr_va_export_wiz_st3_name_def
source: Exported contacts
ta: ஏற்றுமதி செய்யப்பட்ட தொடர்புகள்

# addr_va_firstname
source: First name Last name
ta: முதல் பெயர் கடைசி பெயர்

# addr_va_general_female
source: Female
ta: பெண்

# addr_va_general_male
source: Male
ta: ஆண்

# addr_va_general_undefined
source: Undefined
ta: வரையறுக்கப்படவில்லை

# addr_va_groups_simcard
source: SIM card contacts
ta: சிம் அட்டை தொடர்புகள்

# addr_va_groups_sip
source: SIP
ta: சிப்

# addr_va_lastname
source: Last name First name
ta: கடைசி பெயர் முதல் பெயர்

# addr_va_lastname_comma
source: Last name, First name
ta: கடைசி பெயர், முதல் பெயர்

# addr_va_newedit_address_general
source: general
ta: பொது

# addr_va_newedit_address_home
source: home
ta: வீடு

# addr_va_newedit_address_work
source: work
ta: வேலை

# addr_va_newedit_email_general
source: general
ta: பொது

# addr_va_newedit_email_home
source: home
ta: வீடு

# addr_va_newedit_email_work
source: work
ta: வேலை

# addr_va_newedit_mobile_home
source: home
ta: வீடு

# addr_va_newedit_mobile_work
source: work
ta: வேலை

# addr_va_newedit_phone_fax
source: fax
ta: தொலைநகல்

# addr_va_newedit_phone_general
source: general
ta: பொது

# addr_va_newedit_phone_home
source: home
ta: வீடு

# addr_va_newedit_phone_other
source: unsupported
ta: ஆதரிக்கப்படாதது

# addr_va_newedit_phone_work
source: work
ta: வேலை

# addr_va_nickname
source: Nickname
ta: புனைப்பெயர்

# addr_va_solve_conflict_birthday_set
source: Enter birthday
ta: பிறந்தநாளை உள்ளிடவும்
