Repository: 247i/TACETr
Catalog: உரை/தானி/matomo-communityplugin-ip2proxy-*.po
Languages: ta

# IP2Proxy.City
source: City
ta: நகரம்

# IP2Proxy.Country
source: Country
ta: நாடு

# IP2Proxy.Device
source: Device
ta: சாதனம்

# IP2Proxy.Domain
source: Domain
ta: டொமைன்

# IP2Proxy.DownloadYourBinDatabase
source: Download your free IP2Proxy database from %1$sIP2Location LITE%2$s website. For more accurate results, please use %3$sIP2Proxy Commercial%4$s database.<br>Upload the BIN database to <strong>/misc</strong> and insert the absolute path at here.
ta: உங்கள் இலவச IP2Proxy தரவுத்தளத்தை %1$sIP2Location Lite %2$s வலைத்தளத்திலிருந்து பதிவிறக்கவும். மேலும் துல்லியமான முடிவுகளுக்கு, தயவுசெய்து %3$sIP2Proxy வணிக %4 $ S தரவுத்தளத்தைப் பயன்படுத்தவும்.

# IP2Proxy.FindBelowProxyDetailsReport
source: You'll find below the Proxy Report for yesterday.
ta: நேற்று பதிலாள் அறிக்கைக்கு கீழே காணலாம்.

# IP2Proxy.Hi
source: Hi,
ta: ஆய்,

# IP2Proxy.IP2ProxyBinDatabase
source: IP2Proxy BIN Database
ta: Ip2proxy பின் தரவுத்தளம்

# IP2Proxy.IoApiKey
source: API Key (ip2location.io)
ta: பநிஇ key (ip2location.io)

# IP2Proxy.LastVisit
source: Last visit
ta: கடைசி வருகை

# IP2Proxy.LastVisitDuration
source: Last visit duration
ta: கடைசி வருகை காலம்

# IP2Proxy.LifeTimeOfCacheForResultsInWeeks
source: Number of weeks during which the results returned must be cached.
ta: முடிவுகள் திரும்பிய வாரங்களின் எண்ணிக்கை தற்காலிக சேமிப்பாக இருக்க வேண்டும்.

# IP2Proxy.NoOneVisitedWebsiteYesterday
source: We are sorry, but no one visited your website yesterday…
ta: மன்னிக்கவும், ஆனால் நேற்று யாரும் உங்கள் வலைத்தளத்தைப் பார்வையிடவில்லை…

# IP2Proxy.NumberOfVisits
source: Number of visits
ta: வருகைகளின் எண்ணிக்கை

# IP2Proxy.Proxy
source: Proxy
ta: பதிலாள்

# IP2Proxy.ProxyDetails
source: Proxy Details
ta: பதிலாள் விவரங்கள்

# IP2Proxy.ProxyDetailsReportSubject
source: [%1$s] Your daily report / Proxy Details
ta: [%1$s] உங்கள் நாள்தோறும் அறிக்கை / பதிலாள் விவரங்கள்

# IP2Proxy.ProxyType
source: Proxy Type
ta: பதிலாள் வகை

# IP2Proxy.ReferrerName
source: Referrer name
ta: குறிப்பு பெயர்

# IP2Proxy.ReferrerType
source: Referrer type
ta: குறிப்பு வகை

# IP2Proxy.Region
source: Region
ta: பகுதி

# IP2Proxy.SignUpFreeIP2LocationIo
source: Sign up for free 30,000 queries per month at %1$sIP2Location.io%2$s. Query will lookup with API is this field is filled.
ta: %1$sip2location.io %2$s இல் மாதத்திற்கு 30,000 வினவல்களுக்கு இலவசமாக பதிவுபெறுக. வினவல் பநிஇ உடன் தேடும் இந்த புலம் நிரப்பப்பட்டுள்ளது.

# IP2Proxy.SubscribeToEmailReport
source: Subscribe to the email reports
ta: மின்னஞ்சல் அறிக்கைகளுக்கு குழுசேரவும்

# IP2Proxy.ThanksForUsing
source: Thanks for using IP2Location service.
ta: IP2Location சேவையைப் பயன்படுத்தியதற்கு நன்றி.

# IP2Proxy.Threat
source: Threat
ta: அச்சுறுத்தல்

# IP2Proxy.Type
source: Type
ta: வகை

# IP2Proxy.UsageType
source: Usage Type
ta: பயன்பாட்டு வகை

# IP2Proxy.WantToReceiveDailyReport
source: I want to receive the daily reports by email with the proxy details that visited my websites.
ta: எனது வலைத்தளங்களைப் பார்வையிட்ட பதிலாள் விவரங்களுடன் மின்னஞ்சல் மூலம் நாள்தோறும் அறிக்கைகளைப் பெற விரும்புகிறேன்.
