Repository: 247i/TACETr
Catalog: உரை/தானி/matomo-plugin-api-*.po
Languages: ta

# API.ChangeTokenHint
source: If you want to change this token, please go to your %1$spersonal settings page%2$s.
ta: இந்த டோக்கனை மாற்ற விரும்பினால், உங்கள் %1$sதனிப்பட்ட அமைப்புகள் பக்கத்திற்கு%2$s செல்லவும்.

# API.GenerateVisits
source: If you don't have data for today, you can generate some using the %1$s plugin by going to 'Development → Visitor Generator' in the administration area of Matomo.
ta: இன்று உங்களிடம் தரவு இல்லையென்றால், மாடோமோவின் நிர்வாகப் பகுதியில் 'டெவலப்மென்ட் → பார்வையாளர் செனரேட்டருக்கு' செல்வதன் மூலம் %1$s சொருகி பயன்படுத்தி சிலவற்றை உருவாக்கலாம்.

# API.KeepTokenSecret
source: This token_auth is as secret as your login and password, %1$s do not share it%2$s!
ta: இந்த token_auth ஆனது உங்கள் கடவுச்சொல்லை போன்று இரகசியமானது. %1$s பகிர வேண்டாம்%2$s!

# API.LoadedAPIs
source: Loaded %s APIs
ta: ஏற்றப்பட்ட %s பநிஇ கள்

# API.MoreInformation
source: More info about the Matomo APIs available in %1$sIntroduction to Matomo API%2$s and the %3$sMatomo API Reference%4$s.
ta: மாடோமோ ஏபிஐக்கள் பற்றிய கூடுதல் தகவல்கள் %1 $ சிண்ட்ரோடக்சன் மேட்டோமோ பநிஇ %2$s மற்றும் %3 $ ச்மாடோமோ பநிஇ குறிப்பு %4 $ எச்.

# API.PluginDescription
source: All the data in Matomo is available through simple APIs. This plugin is the web-service entry point, that you can call to get your web analytics data in XML, JSON, PHP, CSV, etc.
ta: மாடோமோவில் உள்ள அனைத்து தரவுகளும் எளிய பநிஇ கள் மூலம் கிடைக்கின்றன. இந்த சொருகி என்பது வலை பணி நுழைவு புள்ளியாகும், இது உங்கள் வலை பகுப்பாய்வு தரவுகளை எக்ச்எம்எல், சேஎச்ஓஎன், பிஎச்பி, காபிம போன்றவற்றில் பெற அழைக்கலாம்.

# API.ReportingApiReference
source: Reporting API Reference
ta: பநிஇ குறிப்பு அறிக்கை

# API.TopLinkTooltip
source: Access your Web Analytics data programmatically through a simple API in JSON, XML, etc.
ta: சேசன், எக்ச்எம்எல் போன்றவற்றில் ஒரு எளிய பநிஇ மூலம் உங்கள் வலை பகுப்பாய்வு தரவை நிரல் ரீதியாக அணுகவும்.

# API.UserAuthentication
source: User authentication
ta: பயனர் உறுதிப்பாடு

# API.UsingTokenAuth
source: If you want to %1$srequest data within a script, a crontab, etc.%2$s you need to add the '%3$s' URL parameter to the API calls for URLs that require authentication.
ta: ஒரு ச்கிரிப்ட்டில், க்ரோன்டாப், முதலியன%1 $ கோர விரும்பினால்.%2$s ஏற்பு தேவைப்படும் முகவரி களுக்கான பநிஇ அழைப்புகளில் '%3$s' முகவரி அளவுருவைச் சேர்க்க வேண்டும்.

# API.Glossary
source: Glossary
ta: சொற்களஞ்சியம்

# API.MainMetricsReportDocumentation
source: This report gives an overview of the most important metrics across all categories and plugins.
ta: இந்த அறிக்கை அனைத்து வகைகள் மற்றும் செருகுநிரல்களிலும் மிக முக்கியமான அளவீடுகளின் கண்ணோட்டத்தை அளிக்கிறது.

# API.LearnAboutCommonlyUsedTerms2
source: Learn about commonly used terms to make the most of Matomo analytics.
ta: மாடோமோ பகுப்பாய்வுகளை அதிகம் பயன்படுத்த பொதுவாகப் பயன்படுத்தப்படும் சொற்களைப் பற்றி அறிக.

# API.EvolutionMetricName
source: %s Evolution
ta: %s பரிணாமம்
