Repository: 247i/TACETr
Catalog: உரை/தானி/matomo-plugin-visitorinterest-*.po
Languages: ta

# VisitorInterest.BetweenXYMinutes
source: %1$s–%2$s min
ta: %1$s -%2$s மணித்துளி

# VisitorInterest.ColumnPagesPerVisit
source: Pages per visit
ta: ஒரு வருகைக்கு பக்கங்கள்

# VisitorInterest.ColumnVisitDuration
source: Visit duration
ta: காலத்தைப் பார்வையிடவும்

# VisitorInterest.Engagement
source: Engagement
ta: மண உறுதி

# VisitorInterest.NPages
source: %s pages
ta: %பக்கங்கள்

# VisitorInterest.OnePage
source: 1 page
ta: 1 பக்கம்

# VisitorInterest.PluginDescription
source: Visitor interest: number of pages viewed, time spent on the website, days since last visit, and more.
ta: பார்வையாளர் ஆர்வம்: பார்க்கப்பட்ட பக்கங்களின் எண்ணிக்கை, இணையதளத்தில் செலவழித்த நேரம், கடைசி வருகைக்குப் பின்னர் நாட்கள் மற்றும் பல.

# VisitorInterest.VisitNum
source: Visit number
ta: எண் வருகை

# VisitorInterest.VisitsByDaysSinceLast
source: Visits by days since last visit
ta: கடைசி வருகைக்குப் பின்னர் சில நாட்களுக்குள் வருகை

# VisitorInterest.visitsByVisitCount
source: Visits by visit number
ta: வருகை எண்ணின் வருகைகள்

# VisitorInterest.VisitsPerDuration
source: Visits per visit duration
ta: வருகை காலத்திற்கு வருகை

# VisitorInterest.VisitsPerNbOfPages
source: Visits per number of pages
ta: பக்கங்களின் எண்ணிக்கையில் வருகைகள்

# VisitorInterest.WidgetLengths
source: Length of visits
ta: வருகைகளின் நீளம்

# VisitorInterest.WidgetLengthsDocumentation
source: How many visits had a certain total duration. Initially, the report is shown as a tag cloud, wherein more common durations have a larger font.
ta: எத்தனை வருகைகள் ஒரு குறிப்பிட்ட மொத்த காலத்தைக் கொண்டிருந்தன. ஆரம்பத்தில், அறிக்கை ஒரு குறிச்சொல் மேகமாக காட்டப்பட்டுள்ளது, இதில் மிகவும் பொதுவான காலங்கள் பெரிய எழுத்துருவைக் கொண்டுள்ளன.

# VisitorInterest.WidgetPages
source: Pages per visit
ta: ஒரு வருகைக்கு பக்கங்கள்

# VisitorInterest.WidgetPagesDocumentation
source: How many visits involved a certain number of pageviews. Initially, the report is shown as a tag cloud, wherein more common numbers of pages have a larger font.
ta: எத்தனை வருகைகள் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான பக்கக் காட்சிகளை உள்ளடக்கியது. ஆரம்பத்தில், அறிக்கை ஒரு குறிச்சொல் மேகமாக காட்டப்பட்டுள்ளது, இதில் மிகவும் பொதுவான பக்கங்கள் பெரிய எழுத்துருவைக் கொண்டுள்ளன.

# VisitorInterest.WidgetVisitsByDaysSinceLast
source: Visits by days since last visit
ta: கடைசி வருகைக்குப் பின்னர் சில நாட்களுக்குள் வருகை

# VisitorInterest.WidgetVisitsByDaysSinceLastDocumentation
source: How many visits were from returning visitors whose last visit was a certain number of days ago.
ta: ஒரு குறிப்பிட்ட எண்ணிக்கையிலான நாட்களுக்கு முன்பு கடைசி வருகை திரும்பிய பார்வையாளர்களிடமிருந்து எத்தனை வருகைகள் இருந்தன.

# VisitorInterest.WidgetVisitsByNumDocumentation
source: The number of visitors reaching their Nth visit. I.e. the total amount of visitors visiting your website a given amount of times or more.
ta: பார்வையாளர்களின் எண்ணிக்கை அவர்களின் nth வருகையை எட்டுகிறது. அதாவது. உங்கள் வலைத்தளத்தைப் பார்வையிடும் பார்வையாளர்களின் மொத்த அளவு ஒரு குறிப்பிட்ட நேரங்கள் அல்லது அதற்கு மேற்பட்டவை.
