Repository: 247i/TACETr
Catalog: உரை/தானி/matomo-plugin-customtranslations-*.po
Languages: ta

# CustomTranslations.PluginDescription
source: Translate entities and report values into different languages
ta: நிறுவனங்கள் மற்றும் மதிப்புகளை வெவ்வேறு மொழிகளில் மொழிபெயர்க்கவும்

# CustomTranslations.CustomTranslations
source: Custom Translations
ta: தனிப்பயன் மொழிபெயர்ப்புகள்

# CustomTranslations.LanguageInlineHelp
source: Select the language you want to translate.
ta: நீங்கள் மொழிபெயர்க்க விரும்பும் மொழியைத் தேர்ந்தெடுக்கவும்.

# CustomTranslations.Translation
source: Translation
ta: மொழிபெயர்ப்பு

# CustomTranslations.TranslationType
source: Translation Type
ta: மொழிபெயர்ப்பு வகை

# CustomTranslations.CustomReportName
source: Custom Report Name
ta: தனிப்பயன் அறிக்கை பெயர்

# CustomTranslations.CustomReportDescription
source: Translate the name of custom report entities
ta: தனிப்பயன் அறிக்கை நிறுவனங்களின் பெயரை மொழிபெயர்க்கவும்

# CustomTranslations.CustomDimensionName
source: Custom Dimension Name
ta: தனிப்பயன் பரிமாண பெயர்

# CustomTranslations.CustomDimensionDescription
source: Translate the name of custom dimension entities
ta: தனிப்பயன் பரிமாண நிறுவனங்களின் பெயரை மொழிபெயர்க்கவும்

# CustomTranslations.CustomDimensionValue
source: Custom Dimension Value
ta: தனிப்பயன் பரிமாண மதிப்பு

# CustomTranslations.CustomDimensionValueDescription
source: Translate the name of tracked event values
ta: கண்காணிக்கப்பட்ட நிகழ்வு மதிப்புகளின் பெயரை மொழிபெயர்க்கவும்

# CustomTranslations.EventValue
source: Event Value
ta: நிகழ்வு மதிப்பு

# CustomTranslations.EventValueDescription
source: Translate the name of tracked event values
ta: கண்காணிக்கப்பட்ட நிகழ்வு மதிப்புகளின் பெயரை மொழிபெயர்க்கவும்

# CustomTranslations.DashboardName
source: Dashboard Name
ta: டாச்போர்டு பெயர்

# CustomTranslations.DashboardDescription
source: Translate the name of dashboard entities
ta: டாச்போர்டு நிறுவனங்களின் பெயரை மொழிபெயர்க்கவும்
