Repository: 247i/TACETr
Catalog: உரை/தானி/matomo-plugin-widgetize-*.po
Languages: ta

# Widgetize.OpenInNewWindow
source: Open in a new window
ta: புதிய சாளரத்தில் திறக்கவும்

# Widgetize.PluginDescription
source: Display any Matomo report in your website or app with a simple "embed" HTML tag.
ta: உங்கள் வலைத்தளம் அல்லது பயன்பாட்டில் எந்த மாடோமோ அறிக்கையையும் எளிய "உட்பொதிக்கப்பட்ட" உஉகுமொ குறிச்சொல்லுடன் காண்பி.

# Widgetize.ViewAccessRequired
source: This user has at least some write access. Only tokens of users who have only view access can be used. Check %1$s for more info.
ta: இந்த பயனருக்கு குறைந்தபட்சம் சில எழுதும் அணுகல் உள்ளது. பார்வை அணுகலை மட்டுமே கொண்ட பயனர்களின் டோக்கன்களை மட்டுமே பயன்படுத்த முடியும். மேலும் தகவலுக்கு %1$s சரிபார்க்கவும்.

# Widgetize.TopLinkTooltip
source: Export Matomo reports as widgets and embed the dashboard in your app as an iframe.
ta: மாடோமோ அறிக்கைகளை விட்செட்டுகளாக ஏற்றுமதி செய்து, உங்கள் பயன்பாட்டில் டாச்போர்டை ஐஃப்ரேமாக உட்பொதிக்கவும்.

# Widgetize.TooHighAccessLevel
source: This user has super-user access. Embedding widgets with super-user token authentication is not allowed. %1$sCheck the FAQ for more info.%2$s
ta: இந்த பயனருக்கு சூப்பர் பயனர் அணுகல் உள்ளது. சூப்பர்-பயனர் கிள்ளாக்கு அங்கீகாரத்துடன் விட்செட்களை உட்பொதிப்பது அனுமதிக்கப்படவில்லை. %1 $ மேலும் தகவலுக்கு கேள்விகள்.%2$s

# Widgetize.SelectAReport
source: Select a report, and copy paste in your page the embed code below the widget:
ta: ஒரு அறிக்கையைத் தேர்ந்தெடுத்து, விட்செட்டுக்கு கீழே உள்ள உட்பொதிக்கப்பட்ட குறியீட்டை உங்கள் பக்கத்தில் பேச்ட்டை நகலெடுக்கவும்:

source: Widgetize reports
ta: அறிக்கைகளை விட்செட் செய்யுங்கள்

# Widgetize.Intro
source: With Matomo, you can %1$sexport your Web Analytics reports%2$s on your blog, website, or intranet dashboard… in one click.
ta: MATOMO உடன், உங்கள் வலைப்பதிவு, வலைத்தளம் அல்லது இன்ட்ராநெட் டாச்போர்டில் %2$s… ஒரே கிளிக்கில் உங்கள் வலை அனலிட்டிக்ச் அறிக்கைகள் %1$sexport முடியும்.

# Widgetize.DisplayDashboardInIframe
source: You can also display the full Matomo dashboard in your application or website in an IFRAME (%1$ssee example%2$s). The date parameter can be set to a specific calendar date, "today", or "yesterday". The period parameter can be set to "day", "week", "month", or "year". The language parameter can be set to the language code of a translation, such as language=fr. For example, for idSite=1 and date=yesterday, you can write:
ta: உங்கள் பயன்பாடு அல்லது வலைத்தளத்தில் முழு மாடோமோ டாச்போர்டையும் ஒரு IFRAME இல் காண்பிக்கலாம் (%1$ssee எடுத்துக்காட்டு%2$s). தேதி அளவுருவை ஒரு குறிப்பிட்ட காலண்டர் தேதி, "இன்று" அல்லது "நேற்று" என அமைக்கலாம். கால அளவுருவை "நாள்", "வாரம்", "மாதம்" அல்லது "ஆண்டு" என அமைக்கலாம். மொழி அளவுருவை மொழிபெயர்ப்பின் மொழி குறியீட்டிற்கு அமைக்கலாம், அதாவது மொழி = fr. எடுத்துக்காட்டாக, idsite = 1 மற்றும் தேதி = நேற்று, நீங்கள் எழுதலாம்:

# Widgetize.DisplayDashboardInIframeAllSites
source: You can also widgetize the all websites dashboard in an IFRAME (%1$ssee example%2$s)
ta: நீங்கள் அனைத்து வலைத்தளங்களையும் டாச்போர்டை ஒரு IFRAME (%1$sSEE எடுத்துக்காட்டு%2$s) இல் விட்செட்டிங் செய்யலாம்

# Widgetize.ViewableAnonymously
source: If you want your widgets to be viewable by everybody, you first have to set the 'view' permissions to the anonymous user in the %1$sUsers Management section%2$s. <br />Alternatively, if you are publishing widgets on a password protected or private page, you don't necessarily have to allow 'anonymous' to view your reports. In this case, you can add the secret <code>token_auth</code> parameter in the widget URL. You can manage your auth tokens on your %3$sSecurity page%4$s.
ta: உங்கள் விட்செட்டுகள் எல்லோரிடமும் பார்க்கப்பட வேண்டும் என்று நீங்கள் விரும்பினால், நீங்கள் முதலில் அநாமதேய பயனருக்கு %1$susers மேலாண்மை பிரிவு %2$s இல் 'பார்வை' அனுமதிகளை அமைக்க வேண்டும். <br /> மாற்றாக, நீங்கள் கடவுச்சொல் பாதுகாக்கப்பட்ட அல்லது தனிப்பட்ட பக்கத்தில் விட்செட்களை வெளியிடுகிறீர்கள் என்றால், உங்கள் அறிக்கைகளைக் காண 'அநாமதேய' அனுமதிக்க வேண்டிய அவசியமில்லை. இந்த வழக்கில், விட்செட் முகவரி இல் மறைபொருள் <குறியீடு> டோக்கன்_ஆத் </code> அளவுருவைச் சேர்க்கலாம். உங்கள் %3$ssecurity பக்கம் %4 $ s இல் உங்கள் அங்கீகார டோக்கன்களை நிர்வகிக்கலாம்.

# Widgetize.EmbedIframe
source: &rsaquo; Embed Iframe
ta: & rsaquo; Iframe உட்பொதிக்கவும்

# Widgetize.DirectLink
source: &rsaquo; Direct Link
ta: & rsaquo; நேரடி இணைப்பு
