Repository: 247i/TACETr
Catalog: உரை/தானி/matomo-plugin-ecommerce-*.po
Languages: ta

# Ecommerce.PluginDescription
source: Ecommerce lets you track when users add products to carts, and when they convert to an ecommerce sale. Also track products and product categories views and abandoned carts.
ta: பயனர்கள் வண்டிகளில் தயாரிப்புகளைச் சேர்க்கும்போது, ​​அவை இணையவழி விற்பனைக்கு மாற்றும்போது கண்காணிக்க இணையவழி உங்களை அனுமதிக்கிறது. தயாரிப்புகள் மற்றும் தயாரிப்பு வகைகள் காட்சிகள் மற்றும் கைவிடப்பட்ட வண்டிகளையும் கண்காணிக்கவும்.

# Ecommerce.Sales
source: Sales
ta: விற்பனை

# Ecommerce.Order
source: Order
ta: ஒழுங்கு

# Ecommerce.OrderId
source: Order ID
ta: ஐடி ஆர்டர்

# Ecommerce.OrderRevenue
source: Order Revenue
ta: ஆர்டர் வருவாய்

# Ecommerce.RevenueLeftInCart
source: Revenue Left In Cart
ta: வண்டியில் வருவாய்

# Ecommerce.Orders
source: Orders
ta: ஆர்டர்கள்

# Ecommerce.ViewedProductCategory
source: Viewed Product Category
ta: தயாரிப்பு வகை

# Ecommerce.ViewedProductName
source: Viewed Product Name
ta: தயாரிப்பு பெயர்

# Ecommerce.ViewedProductPrice
source: Viewed Product Price
ta: தயாரிப்பு விலை பார்க்கப்பட்டது

# Ecommerce.ViewedProductSKU
source: Viewed Product SKU
ta: பார்க்கப்பட்ட தயாரிப்பு SKU

# Ecommerce.SalesBy
source: Sales by %s
ta: விற்பனை %s விழுக்காட்டில்

# Ecommerce.SalesAdjective
source: Sales %s
ta: விற்பனை %s விழுக்காடு

# Ecommerce.NumberOfItems
source: Number of Items in Cart
ta: வண்டியில் உள்ள பொருட்களின் எண்ணிக்கை

# Ecommerce.OrderValue
source: Order value
ta: ஆர்டர் மதிப்பு

source: Ecommerce Life Time Value
ta: இணையவழி வாழ்க்கை நேர மதிப்பு

# Ecommerce.LifeTimeValueDescription
source: Total Ecommerce revenue attributed to this customer across all visits: the sum of revenue of all Ecommerce orders for Visitor ID %s.
ta: அனைத்து வருகைகளிலும் இந்த வாடிக்கையாளருக்குக் கூறப்படும் மொத்த இணையவழி வருவாய்: பார்வையாளர் ஐடி %s அனைத்து இணையவழி ஆர்டர்களின் வருவாயின் தொகை.

# Ecommerce.VisitorProfileLTV
source: Generated a Life Time Revenue of %1$s.
ta: %1$s ஆயுள் நேர வருவாயை உருவாக்கியது.

# Ecommerce.VisitorProfileItemsAndOrders
source: Purchased %1$s items in %2$s ecommerce orders.
ta: %2$s இணையவழி ஆர்டர்களில் %1$s உருப்படிகளை வாங்கியது.

# Ecommerce.VisitorProfileAbandonedCartSummary
source: Abandoned %1$s carts including %2$s items worth a total of %3$s.
ta: மொத்தம் %3$s மதிப்புள்ள %2$s உருப்படிகள் உட்பட %1$s வண்டிகள் கைவிடப்பட்டுள்ளன.

# Ecommerce.EcommerceOverviewSubcategoryHelp1
source: The Ecommerce Overview section is the best place to get a high-level view of your online store’s performance. At a glance, you can see how many sales you’re making, how much revenue you are generating, and your website’s conversion rate.
ta: உங்கள் நிகழ்நிலை ச்டோரின் செயல்திறனைப் பற்றிய உயர் மட்ட பார்வையைப் பெறுவதற்கான சிறந்த இடம் இணையவழி கண்ணோட்டம் பிரிவு. ஒரு பார்வையில், நீங்கள் எத்தனை விற்பனையை உருவாக்குகிறீர்கள், எவ்வளவு வருவாய் ஈட்டுகிறீர்கள், உங்கள் வலைத்தளத்தின் மாற்று விகிதம் ஆகியவற்றைக் காணலாம்.

# Ecommerce.EcommerceOverviewSubcategoryHelp2
source: Click on an individual metric within the sparkline chart to focus on it within the full-sized evolution graph.
ta: முழு அளவிலான படிமலர்ச்சி வரைபடத்தில் கவனம் செலுத்த ச்பார்க்லைன் விளக்கப்படத்தில் உள்ள ஒரு தனிப்பட்ட மெட்ரிக்கைக் சொடுக்கு செய்க.

# Ecommerce.EcommerceOverviewSubcategoryHelp3
source: Learn more in our Ecommerce guide here.
ta: எங்கள் இணையவழி வழிகாட்டியில் இங்கே மேலும் அறிக.

# Ecommerce.SalesSubcategoryHelp1
source: This section contains an extensive collection of reports to help you analyse the different conditions that most commonly lead to sales, such as the traffic and campaign sources, user time and location and devices used to access them.
ta: போக்குவரத்து மற்றும் பிரச்சார ஆதாரங்கள், பயனர் நேரம் மற்றும் இருப்பிடம் மற்றும் அவற்றை அணுக பயன்படுத்தப்படும் சாதனங்கள் போன்ற விற்பனைக்கு பொதுவாக வழிவகுக்கும் வெவ்வேறு நிபந்தனைகளை பகுப்பாய்வு செய்ய உதவும் அறிக்கைகளின் விரிவான சேகரிப்பு இந்த பிரிவில் உள்ளது.

# Ecommerce.SalesSubcategoryHelp2
source: You can also learn exactly how revenue is associated with each dimension, such as specific traffic types or tracked campaigns.
ta: குறிப்பிட்ட போக்குவரத்து வகைகள் அல்லது கண்காணிக்கப்பட்ட பிரச்சாரங்கள் போன்ற ஒவ்வொரு பரிமாணத்துடனும் வருவாய் எவ்வாறு தொடர்புடையது என்பதையும் நீங்கள் சரியாக அறியலாம்.

# Ecommerce.EcommerceLogSubcategoryHelp1
source: The Ecommerce log provides granular session-level data so you can look at the full session for each user that either made a purchase or abandoned their cart. This can help you understand what users do before and after purchasing to reveal optimisation opportunities.
ta: இணையவழி பதிவு சிறுமணி அமர்வு-நிலை தரவை வழங்குகிறது, எனவே ஒவ்வொரு பயனருக்கும் முழு அமர்வையும் வாங்கலாம் அல்லது அவர்களின் வண்டியை கைவிட்டது. தேர்வுமுறை வாய்ப்புகளை வெளிப்படுத்த வாங்குவதற்கு முன்னும் பின்னும் பயனர்கள் என்ன செய்கிறார்கள் என்பதைப் புரிந்துகொள்ள இது உதவும்.

# Ecommerce.EcommerceLogSubcategoryHelp2
source: Data on this page is updated in real-time.
ta: இந்த பக்கத்தில் உள்ள தரவு நிகழ்நேரத்தில் புதுப்பிக்கப்பட்டுள்ளது.

# Ecommerce.ProductSubcategoryHelp
source: The Products view can help you identify products and categories that are over-performing or under-performing to reveal trends and opportunities related to your product selection and store pages.
ta: உங்கள் தயாரிப்பு தேர்வு மற்றும் கடை பக்கங்கள் தொடர்பான போக்குகள் மற்றும் வாய்ப்புகளை வெளிப்படுத்த அதிக செயல்திறன் கொண்ட அல்லது குறைவான செயல்திறன் கொண்ட தயாரிப்புகள் மற்றும் வகைகளை அடையாளம் காண தயாரிப்புகள் பார்வை உங்களுக்கு உதவும்.
