Repository: 247i/TACETr
Catalog: உரை/தானி/matomo-plugin-live-*.po
Languages: ta

# Live.AveragePageGenerationTime
source: Each page took %1$s to load for this visitor on average.
ta: ஒவ்வொரு பக்கமும் இந்த பார்வையாளருக்கு சராசரியாக ஏற்ற %1$s எடுத்தது.

# Live.CalculatedOverNPageViews
source: Calculated using this visitor's last %1$s page views.
ta: இந்த பார்வையாளரின் கடைசி %1$s பக்கக் காட்சிகளைப் பயன்படுத்தி கணக்கிடப்படுகிறது.

# Live.ClickToViewMoreAboutVisit
source: Click for more info about this visit
ta: இந்த வருகையைப் பற்றிய கூடுதல் தகவலுக்கு சொடுக்கு செய்க

# Live.ClickToViewAllActions
source: Click for all actions of this group in detail
ta: இந்த குழுவின் அனைத்து செயல்களுக்கும் விரிவாக சொடுக்கு செய்க

# Live.ConvertedNGoals
source: Converted %s goals
ta: %s இலக்குகளை மாற்றியது

# Live.FirstVisit
source: First visit
ta: முதல் வருகை

# Live.GoalType
source: Type
ta: வகை

# Live.HideMap
source: hide map
ta: வரைபடத்தை மறைக்கவும்

# Live.KeywordRankedOnSearchResultForThisVisitor
source: The keyword "%1$s" was ranked %2$s on the %3$s search result page for this visitor
ta: இந்த பார்வையாளருக்கான %3$s தேடல் முடிவு பக்கத்தில் " %1$s" என்ற முக்கிய சொல் %2$s ஐ வழங்கியது

# Live.LastHours
source: Last %s hours
ta: கடைசி %s மணிநேரம்

# Live.LastMinutes
source: Last %s minutes
ta: கடைசி %s நிமிடங்கள்

# Live.LastVisit
source: Last visit
ta: கடைசி வருகை

# Live.LinkVisitorLog
source: View detailed visits log
ta: விரிவான வருகைகள் பதிவைக் காண்க

# Live.LoadMoreVisits
source: Load more
ta: மேலும் ஏற்றவும்

# Live.LimitedSummary
source: The info in this profile summarizes the last %1$s visits. This user had more visits in total.
ta: இந்த சுயவிவரத்தில் உள்ள செய்தி கடைசி %1$s வருகைகளை சுருக்கமாகக் கூறுகிறது. இந்த பயனருக்கு மொத்தம் அதிக வருகைகள் இருந்தன.

# Live.LimitedVisitsShown
source: Only the last %1$s visits are shown. This user had more visits in total.
ta: கடைசி %1$s வருகைகள் மட்டுமே காட்டப்பட்டுள்ளன. இந்த பயனருக்கு மொத்தம் அதிக வருகைகள் இருந்தன.

# Live.MorePagesNotDisplayed
source: more pages by this visitor are not displayed
ta: இந்த பார்வையாளரின் கூடுதல் பக்கங்கள் காட்டப்படாது

# Live.NbVisitor
source: 1 visitor
ta: 1 வருகையாளர்

# Live.NbVisitors
source: %s visitors
ta: %s வருகையாளர்கள்

# Live.NextVisitor
source: Next visitor
ta: அடுத்த பார்வையாளர்

# Live.NoMoreVisits
source: These are all the visits for this visitor.
ta: இவை அனைத்தும் இந்த பார்வையாளருக்கான வருகைகள்.

# Live.PageRefreshed
source: Number of times this page was viewed / refreshed in a row.
ta: இந்த பக்கம் ஒரு வரிசையில் பார்க்கப்பட்டது / புதுப்பிக்கப்பட்டது.

# Live.PluginDescription
source: Provides the live visits log and lets you watch your visitors live in the real-time dashboard widget. A visitor profile can be browsed for any given user.
ta: நேரடி வருகைகள் பதிவை வழங்குகிறது மற்றும் உங்கள் பார்வையாளர்களை நிகழ்நேர டாச்போர்டு விட்செட்டில் வாழ அனுமதிக்கிறது. எந்தவொரு பயனருக்கும் பார்வையாளர் சுயவிவரத்தை உலாவலாம்.

# Live.PreviousVisitor
source: Previous visitor
ta: முந்தைய பார்வையாளர்

# Live.RealTimeVisitors
source: Real-time Visits
ta: நிகழ்நேர வருகைகள்

# Live.RealTimeVisitorCount
source: Real-time visitor count
ta: நிகழ்நேர பார்வையாளர் எண்ணிக்கை

# Live.Referrer_URL
source: Referrer URL
ta: குறிப்பு முகவரி

# Live.ShowMap
source: show map
ta: வரைபடத்தைக் காட்டு

# Live.ActionsAndDuration
source: %1$s actions in %2$s
ta: %2$s இல் %1$s செயல்கள்

# Live.SimpleRealTimeWidget_Message
source: %1$s and %2$s in the last %3$s
ta: கடைசி %3$s இல் %1$s மற்றும் %2$s

# Live.ViewVisitorProfile
source: View visitor profile
ta: பார்வையாளர் சுயவிவரத்தைக் காண்க

# Live.DisableVisitorProfile
source: Turn off visitor profiles
ta: பார்வையாளர் சுயவிவரங்களை அணைக்கவும்

# Live.DisableVisitorProfileDescription
source: All visits-log related features always function.
ta: வருகைகள்-பதிவு தொடர்பான அனைத்து அம்சங்களும் எப்போதும் செயல்படுகின்றன.

# Live.VisitedPages
source: Visited pages
ta: பார்வையிட்ட பக்கங்கள்

# Live.RevisitedPages
source: Pages viewed more than once
ta: பக்கங்கள் ஒன்றுக்கு மேற்பட்ட முறை பார்க்கப்பட்டன

# Live.ToggleActions
source: Toggle visibility of all actions
ta: எல்லா செயல்களின் தெரிவுநிலையையும் மாற்றவும்

# Live.TopVisitedPages
source: Most visited pages
ta: பெரும்பாலான பார்வையிட்ட பக்கங்கள்

# Live.VisitsLog
source: Visits Log
ta: பதிவு

# Live.DisableVisitsLogAndProfile
source: Turn off visits log and visitor profiles
ta: வருகை பதிவு மற்றும் பார்வையாளர் சுயவிவரங்களை அணைக்கவும்

# Live.DisableVisitsLogAndProfileDescription
source: Also removes features that depend on these, like the e-commerce log, the segmented visits-log, the real-time map or the real-time widget. May be required to comply with local privacy laws/guidelines.
ta: இ-காமர்ச் பதிவு, பிரிக்கப்பட்ட வருகைகள்-பதிவு, நிகழ்நேர வரைபடம் அல்லது நிகழ்நேர விட்செட் போன்றவற்றைச் சார்ந்திருக்கும் அம்சங்களையும் நீக்குகிறது. உள்ளக தனியுரிமை சட்டங்கள்/வழிகாட்டுதல்களுக்கு இணங்க வேண்டியிருக்கலாம்.

# Live.QueryMaxExecutionTimeExceeded
source: Could not run the query in time.
ta: வினவலை சரியான நேரத்தில் இயக்க முடியவில்லை.

# Live.QueryMaxExecutionTimeExceededReasonDateRange
source: Maybe the selected date range is too wide?
ta: தேர்ந்தெடுக்கப்பட்ட தேதி வரம்பு மிகவும் அகலமாக இருக்கலாம்?

# Live.QueryMaxExecutionTimeExceededReasonSegment
source: Maybe the selected segment didn't match any visits?
ta: தேர்ந்தெடுக்கப்பட்ட பிரிவு எந்த வருகைகளுக்கும் பொருந்தவில்லையா?

# Live.QueryMaxExecutionTimeExceededReasonUnknown
source: Please try again. Get in touch with your administrator or support if the problem persists.
ta: மீண்டும் முயற்சிக்கவும். சிக்கல் தொடர்ந்தால் உங்கள் நிர்வாகியுடன் தொடர்பு கொள்ளுங்கள் அல்லது உதவி.

# Live.VisitorLog
source: Visits Log
ta: பதிவு

# Live.VisitorLogDocumentation
source: This table shows the latest visits within the selected date range. Hover over the date of a vist to find out when the most recent one occured. %1$s If the date range includes today, you can see your visitors in real-time. %2$s The data displayed here is always live, regardless of whether and how often you make use of the archiving cron-job.
ta: இந்த அட்டவணை தேர்ந்தெடுக்கப்பட்ட தேதி வரம்பிற்குள் அண்மைக் கால வருகைகளைக் காட்டுகிறது. மிகச் சமீபத்தியவை எப்போது நிகழ்ந்தன என்பதைக் கண்டறிய ஒரு விச்டின் தேதியில் வட்டமிடுங்கள். %1$s தேதி வரம்பில் இன்று இருந்தால், உங்கள் பார்வையாளர்களை நிகழ்நேரத்தில் காணலாம். %2$s இங்கே காண்பிக்கப்படும் தரவு எப்போதும் நேரலையில் இருக்கும், நீங்கள் காப்பக கிரான்-வேலையை எவ்வளவு அடிக்கடி பயன்படுத்துகிறீர்கள் என்பதைப் பொருட்படுத்தாமல்.

# Live.VisitorLogNoDataMessagePurged
source: The data has likely been purged because the regular deletion of old raw data is on, and the date for this report is more than %s days old. A superuser can change this setting by going to Administration → Privacy.
ta: பழைய மூல தரவை வழக்கமாக நீக்குவது இயக்கத்தில் இருப்பதால் தரவு சுத்திகரிக்கப்படலாம், மேலும் இந்த அறிக்கையின் தேதி %s நாட்களுக்கு மேல் பழமையானது. நிர்வாகத்திற்குச் செல்வதன் மூலம் ஒரு சூப்பர் யூசர் இந்த அமைப்பை மாற்ற முடியும் → தனியுரிமைக்கு.

# Live.VisitorProfile
source: Visitor profile
ta: பார்வையாளர் சுயவிவரம்

# Live.VisitorsInRealTime
source: Visits in real-time
ta: நிகழ்நேரத்தில் வருகை

# Live.VisitorsLastVisit
source: Also visited %s days earlier.
ta: %s நாட்களுக்கு முன்னர் பார்வையிட்டார்.

# Live.VisitsFrom
source: %1$s%2$s visits%3$s from
ta: %1$s%2$s வருகைகள்%3$s

# Live.VisitSummary
source: Spent a total of %1$s%2$s on the website%3$s, and viewed %4$s pages%5$s in %6$s visits%7$s.
ta: %3$s என்ற இணையதளத்தில் மொத்தம்%1$s%2$s செலவிட்டார், மேலும்%4 $ s பக்கங்கள்%5 $ s%6 $ s வருகைகள்%7 $ s ஐப் பார்த்தேன்.

# Live.VisitSummaryWithActionDetails
source: Spent a total of %1$s%2$s on the website%3$s, and performed %4$s actions%5$s (%6$s) in %7$s visits%8$s.
ta: %3$s என்ற இணையதளத்தில் மொத்தம்%1$s%2$s செலவிட்டார், மேலும்%4 $ s செயல்கள்%5 $ s (%6 $ s)%7 $ S வருகைகள்%8 $ s இல் செய்தனர்.

# Live.RowActionTooltipDefault
source: Show the visits log segmented by this row
ta: இந்த வரிசையால் பிரிக்கப்பட்ட வருகைகள் பதிவைக் காட்டு

# Live.RowActionTooltipWithDimension
source: Show the visits log segmented by this %s
ta: இந்த %s ஆல் பிரிக்கப்பட்ட வருகைகள் பதிவைக் காட்டு

# Live.RowActionTooltipTitle
source: Open the segmented visits log
ta: பிரிக்கப்பட்ட வருகைகள் பதிவைத் திறக்கவும்

# Live.SegmentedVisitorLogTitle
source: Visits log showing visits where %1$s is "%2$s"
ta: வருகை பதிவு வருகைகளைக் காட்டுகிறது %1$s என்பது " %2$s"

# Live.OnClickPause
source: %s is running… Click to pause it.
ta: %s இயங்குகின்றன… அதை இடைநிறுத்த சொடுக்கு செய்க.

# Live.OnClickStart
source: %s is stopped. Click to start it.
ta: %s நிறுத்தப்படுகின்றன. அதைத் தொடங்க சொடுக்கு செய்க.

# Live.ClickToSeeAllContents
source: Click to see each content interaction/impression
ta: ஒவ்வொரு உள்ளடக்க தொடர்பு/தோற்றத்தைக் காண சொடுக்கு செய்க

# Live.VisitorLogSubcategoryHelp1
source: The visits log shows you every visit your website receives in detail. Find out which actions each visitor has performed, how they got to your site, a bit about who they are, and more (while still complying with your local privacy regulations).
ta: வருகைகள் பதிவு உங்கள் வலைத்தளத்தைப் பெறும் ஒவ்வொரு வருகையும் விரிவாக உங்களுக்குக் காட்டுகிறது. ஒவ்வொரு பார்வையாளரும் எந்த செயல்களைச் செய்திருக்கிறார்கள், உங்கள் தளத்திற்கு அவர்கள் எவ்வாறு வந்தார்கள், அவர்கள் யார் என்பது பற்றி கொஞ்சம், மேலும் பல (உங்கள் உள்ளக தனியுரிமை விதிமுறைகளுக்கு இணங்க) என்பதைக் கண்டறியவும்.

# Live.VisitorLogSubcategoryHelp2
source: While other reports in Matomo show how your visitors behave at an aggregate level, the visits log provides granular detail. You can also use segments to narrow it down to specific types of visits to understand your visitors better.
ta: மாடோமோவில் உள்ள மற்ற அறிக்கைகள் உங்கள் பார்வையாளர்கள் மொத்த மட்டத்தில் எவ்வாறு நடந்துகொள்கின்றன என்பதைக் காட்டுகின்றன, வருகை பதிவு சிறுமணி விவரங்களை வழங்குகிறது. உங்கள் பார்வையாளர்களை நன்கு புரிந்துகொள்ள குறிப்பிட்ட வகை வருகைகளுக்கு அதைக் குறைக்க நீங்கள் பிரிவுகளையும் பயன்படுத்தலாம்.

# Live.VisitorLogSubcategoryHelp3
source: Learn more in the visit-log guide.
ta: வருகை-பதிவு வழிகாட்டியில் மேலும் அறிக.

# Live.RealTimeHelp1
source: The visits in the real-time report show the real-time flow of visits to your website. It includes a real-time counter of your visits and page views in the last 24 hours and the previous 30 minutes.
ta: நிகழ்நேர அறிக்கையில் வருகைகள் உங்கள் வலைத்தளத்திற்கு வருகைகளின் நிகழ்நேர ஓட்டத்தைக் காட்டுகின்றன. கடந்த 24 மணிநேரம் மற்றும் முந்தைய 30 நிமிடங்களில் உங்கள் வருகைகள் மற்றும் பக்கக் காட்சிகளின் நிகழ்நேர கவுண்டரை இதில் அடங்கும்.

# Live.RealTimeHelp2
source: This report refreshes every 5 seconds and displays new visits (or existing visitors that view a new page) at the top of the list with a fade-in effect.
ta: இந்த அறிக்கை ஒவ்வொரு 5 விநாடிகளிலும் புதுப்பிக்கிறது மற்றும் புதிய வருகைகளை (அல்லது புதிய பக்கத்தைக் காணும் பார்வையாளர்கள்) ஒரு மங்கலான விளைவுடன் பட்டியலின் மேலே காட்டுகிறது.
