Repository: 247i/TACETr
Catalog: உரை/தானி/matomo-plugin-invalidatereports-*.po
Languages: ta

# InvalidateReports.InvalidateReports
source: Invalidate reports
ta: அறிக்கைகளை செல்லாதது

# InvalidateReports.InvalidateHistoricalReports
source: Invalidate historical reports
ta: வரலாற்று அறிக்கைகளை செல்லாதது

# InvalidateReports.PageDescription
source: You can invalidate all historical reports for a specific or all websites by clicking the "Invalidate historical reports" button. This re-processes them from the raw logs the next time archiving runs. Force Matomo to re-process historical data for all reports, for example when:
ta: "வரலாற்று அறிக்கைகள் செல்லாதது" பொத்தானைக் சொடுக்கு செய்வதன் மூலம் ஒரு குறிப்பிட்ட அல்லது அனைத்து வலைத்தளங்களுக்கும் அனைத்து வரலாற்று அறிக்கைகளையும் நீங்கள் செல்லாது. இது அடுத்த முறை காப்பக இயங்கும் போது மூல பதிவுகளிலிருந்து அவற்றை மீண்டும் செயலாக்குகிறது. அனைத்து அறிக்கைகளுக்கும் வரலாற்றுத் தரவை மீண்டும் செயலாக்க மாடோமோவை கட்டாயப்படுத்துங்கள், எடுத்துக்காட்டாக: எப்போது:

# InvalidateReports.ExamplesCustomReports
source: you created a new %1$sCustom Report%2$s and want to process all historical data in it
ta: நீங்கள் ஒரு புதிய %1 $ ச்கச்டம் அறிக்கை %2$s ஐ உருவாக்கியுள்ளீர்கள், மேலும் அதில் உள்ள அனைத்து வரலாற்றுத் தரவையும் செயலாக்க விரும்புகிறீர்கள்

# InvalidateReports.ExamplesFunnels
source: you created a new %1$sFunnel%2$s and want to process all historical data in it
ta: நீங்கள் ஒரு புதிய %1$sfunnel %2$s ஐ உருவாக்கியுள்ளீர்கள், மேலும் அதில் உள்ள அனைத்து வரலாற்றுத் தரவையும் செயலாக்க விரும்புகிறீர்கள்

# InvalidateReports.ExamplesRawData
source: you have modified the raw visitor info (for example by %1$simporting new visitor logs%2$s) and want these raw log changes reflected in all your reports.
ta: மூல பார்வையாளர் தகவலை நீங்கள் மாற்றியமைத்துள்ளீர்கள் (எடுத்துக்காட்டாக %1 $ புதிய பார்வையாளர் பதிவுகள் %2$s) மற்றும் இந்த மூல பதிவு மாற்றங்கள் உங்கள் எல்லா அறிக்கைகளிலும் பிரதிபலிக்க வேண்டும்.

# InvalidateReports.AllWebsites
source: all websites
ta: அனைத்து வலைத்தளங்களும்

# InvalidateReports.AllSegments
source: all segments
ta: அனைத்து பிரிவுகளும்

# InvalidateReports.ChooseSegment
source: Choose segment
ta: பிரிவைத் தேர்வுசெய்க

# InvalidateReports.ChooseWebsite
source: Choose website
ta: இணையதளத்தை தெரிவு செய்ய

# InvalidateReports.ChooseRange
source: Choose how far back to invalidate data
ta: தரவை செல்லாததாக்குவதற்கு எவ்வளவு தூரம் என்பதைத் தேர்வுசெய்க

# InvalidateReports.AllData
source: all historical data
ta: அனைத்து வரலாற்று தரவு

# InvalidateReports.XMonths
source: last %1$s months
ta: கடைசி %1$s மாதங்கள்

# InvalidateReports.LastMonth
source: last month
ta: கடந்த மாதம்

# InvalidateReports.InvalidationSuccess
source: Reports have been invalidated. They will be re-processed next time reports archiving runs.
ta: அறிக்கைகள் செல்லாதவை. அடுத்த முறை காப்பக ரன்களை அறிக்கைகள் மீண்டும் செயல்படுத்தப்படும்.

# InvalidateReports.InvalidateAPIReturn
source: The CoreAdminHome.invalidateArchivedReports API returned:
ta: Coreadminhome.invalidatearchivedreports பநிஇ திரும்பியது:

# InvalidateReports.ConfirmInvalidation
source: Invalidate all historical reports for %1$s and %2$s? (This causes Matomo to re-process all historical reports the next time archiving runs, and it may take a long time.)
ta: %1$s மற்றும் %2$s க்கான அனைத்து வரலாற்று அறிக்கைகளையும் செல்லாதது? (இது அடுத்த முறை காப்பக ரன்கள் எடுக்கும்போது அனைத்து வரலாற்று அறிக்கைகளையும் மீண்டும் செயலாக்க மாடோமோ காரணமாகிறது, அதற்கு நீண்ட நேரம் ஆகலாம்.)
