Repository: 247i/TACETr
Catalog: உரை/தானி/matomo-communityplugin-flagcounter-*.po
Languages: ta

# FlagCounter.CacheTime
source: Cache lifetime
ta: கேச் வாழ்நாள்

# FlagCounter.CacheIntroduction
source: To avoid permanent load to the piwik server the country data will be cached for the given time.
ta: பிவிக் சேவையகத்திற்கு நிரந்தர சுமைகளைத் தவிர்க்க, குறிப்பிட்ட நேரத்திற்கு நாட்டின் தரவு தற்காலிக சேமிப்பு செய்யப்படும்.

# FlagCounter.CacheDescription
source: amount in seconds
ta: விநாடிகளில் தொகை

# FlagCounter.PluginDescription
source: This plugin allows you to include a simple statistic in your website showing the flags and hits of the countries your visitors came from.
ta: உங்கள் பார்வையாளர்கள் வந்த நாடுகளின் கொடிகள் மற்றும் வெற்றிகளைக் காட்டும் உங்கள் இணையதளத்தில் ஒரு எளிய புள்ளிவிவரத்தை சேர்க்க இந்த சொருகி உங்களை அனுமதிக்கிறது.

# FlagCounter.GeneratorDescription
source: Below you can choose some configuration options to generate the url for the image/iframe to be included in your website.
ta: உங்கள் இணையதளத்தில் சேர்க்க பட/ஐஃப்ரேமுக்கு முகவரி ஐ உருவாக்க சில உள்ளமைவு விருப்பங்களை கீழே தேர்வு செய்யலாம்.

# FlagCounter.NumberOfRows
source: Number of rows
ta: வரிசைகளின் எண்ணிக்கை

# FlagCounter.NumberOfColumns
source: Number of columns
ta: நெடுவரிசைகளின் எண்ணிக்கை

# FlagCounter.UrlToImage
source: URL to FlagCounter image
ta: கொடியின் படத்திற்கு முகவரி

# FlagCounter.ShowCountryCode
source: Show country code
ta: நாட்டு குறியீட்டைக் காட்டு

# FlagCounter.HideFlag
source: Hide flags
ta: கொடிகளை மறைக்கவும்

# FlagCounter.Font
source: Font family
ta: எழுத்துரு குடும்பம்

# FlagCounter.FontSize
source: Font size
ta: எழுத்துரு அளவு

# FlagCounter.FontColor
source: Font color
ta: எழுத்துரு நிறம்
