Repository: 247i/TACETr
Catalog: உரை/தானி/matomo-communityplugin-excludebyddns-*.po
Languages: ta

# ExcludeByDDNS.PluginDescription
source: This plugin lets you dynamically exclude an IP using a DDNS update
ta: இந்த சொருகி ஒரு டி.டி.என்.எச் புதுப்பிப்பைப் பயன்படுத்தி ஒரு ஐபி மாறும் வகையில் விலக்க உங்களை அனுமதிக்கிறது

# ExcludeByDDNS.DDNSSettings
source: DDNS Settings
ta: டி.டி.என்.எச் அமைப்புகள்

# ExcludeByDDNS.DDNSStatus
source: DDNS Status
ta: டி.டி.என்.எச் நிலை

# ExcludeByDDNS.DDNSSettingsDescription
source: Settings to exclude your dynamic IP address.
ta: உங்கள் மாறும் ஐபி முகவரியை விலக்க அமைப்புகள்.

# ExcludeByDDNS.CurrentExcludedIp
source: Your currently excluded IP is: %1$s (last update: %2$s)
ta: உங்கள் தற்போது விலக்கப்பட்ட ஐபி: %1$s (கடைசி புதுப்பிப்பு: %2$s)

# ExcludeByDDNS.NoIpExcluded
source: You have not excluded any IP yet.
ta: நீங்கள் இதுவரை எந்த ஐபி விலக்கவில்லை.

# ExcludeByDDNS.DDNSUpdateExclusion
source: Use a DDNS update to refresh the excluded IP
ta: விலக்கப்பட்ட ஐபி புதுப்பிக்க டி.டி.என்.எச் புதுப்பிப்பைப் பயன்படுத்தவும்

# ExcludeByDDNS.DDNSUpdateExclusionDesc
source: Use the following URL to exclude your dynamic IP address using a DDNS update:
ta: டிடிஎன்எச் புதுப்பிப்பைப் பயன்படுத்தி உங்கள் மாறும் ஐபி முகவரியை விலக்க பின்வரும் முகவரி ஐப் பயன்படுத்தவும்:

# ExcludeByDDNS.DDNSUpdateExclusionDesc2
source: Supplying hostname, username or password is not needed. Leave them empty or type in anything if a value is required.
ta: ஓச்ட்பெயர், பயனர்பெயர் அல்லது கடவுச்சொல்லை வழங்குவது தேவையில்லை. ஒரு மதிப்பு தேவைப்பட்டால் அவற்றை காலியாக விடவும் அல்லது எதையும் தட்டச்சு செய்யவும்.

# ExcludeByDDNS.HostnameExclusion
source: Exclude the IP of an auto-updated hostname
ta: தானாக புதுப்பிக்கப்பட்ட ஓச்ட்பெயரின் ஐபியை விலக்கவும்

# ExcludeByDDNS.HostnameExclusionDesc
source: If already using a DDNS update to update a specific hostname, you can use this hostname to exclude its IP.
ta: ஒரு குறிப்பிட்ட ஓச்ட்பெயரைப் புதுப்பிக்க ஏற்கனவே டி.டி.என்.எச் புதுப்பிப்பைப் பயன்படுத்தினால், இந்த ஓச்ட்பெயரைப் பயன்படுத்தி அதன் ஐபி விலக்கலாம்.

# ExcludeByDDNS.HostnameExclusionDesc2
source: The update will resolve the IP of the hostname every hour
ta: புதுப்பிப்பு ஒவ்வொரு மணி நேரமும் ஓச்ட்பெயரின் ஐபி ஐபி தீர்க்கும்

# ExcludeByDDNS.NoExclusionsSet
source: No IP exclusions are set up.
ta: ஐபி விலக்குகள் எதுவும் அமைக்கப்படவில்லை.

# ExcludeByDDNS.Hostname
source: Hostname
ta: புரவலன்பெயர்

# ExcludeByDDNS.HostnameError
source: Unable to resolve the IP of the given hostname
ta: கொடுக்கப்பட்ட ஓச்ட்பெயரின் ஐபி தீர்க்க முடியவில்லை
