Repository: 247i/TACETr
Catalog: உரை/தானி/matomo-plugin-multisites-*.po
Languages: ta

# MultiSites.Evolution
source: Evolution
ta: பரிணாமம்

# MultiSites.LoadingWebsites
source: Loading websites
ta: வலைத்தளங்களை ஏற்றுகிறது

# MultiSites.PluginDescription
source: View and compare all your websites and apps in this useful 'All Websites' dashboard.
ta: இந்த பயனுள்ள 'அனைத்து வலைத்தளங்களும்' டாச்போர்டில் உங்கள் எல்லா வலைத்தளங்களையும் பயன்பாடுகளையும் பார்த்து ஒப்பிட்டுப் பாருங்கள்.

# MultiSites.TopLinkTooltip
source: Compare Web Analytics stats for all of your Websites.
ta: உங்கள் எல்லா வலைத்தளங்களுக்கும் வலை பகுப்பாய்வு புள்ளிவிவரங்களை ஒப்பிடுக.

# MultiSites.SingleWebsitesDashboardDocumentation
source: This report gives you an informational overview for a specific website, containing the most general metrics about your visitors.
ta: இந்த அறிக்கை ஒரு குறிப்பிட்ட வலைத்தளத்திற்கான செய்தி கண்ணோட்டத்தை உங்களுக்கு வழங்குகிறது, இதில் உங்கள் பார்வையாளர்களைப் பற்றிய பொதுவான அளவீடுகள் உள்ளன.

# MultiSites.AllWebsitesDashboardDocumentation
source: This report gives you an informational overview for each of your websites, containing the most general metrics about your visitors.
ta: உங்கள் ஒவ்வொரு வலைத்தளங்களுக்கும் ஒரு செய்தி கண்ணோட்டத்தை இந்த அறிக்கை உங்களுக்கு வழங்குகிறது, இதில் உங்கள் பார்வையாளர்களைப் பற்றிய பொதுவான அளவீடுகள் உள்ளன.

# MultiSites.AllWebsitesDashboardTitle
source: All Websites
ta: அனைத்து வலைத்தளங்களும்

# MultiSites.AllWebsitesDashboardErrorMessage
source: Data is currently unavailable. This could be due to a temporary server issue or the report containing too much data. Please try again later. If the problem continues, please contact your Matomo administrator for assistance.
ta: தரவு தற்போது கிடைக்கவில்லை. இது ஒரு தற்காலிக சேவையக சிக்கல் அல்லது அதிக தரவைக் கொண்ட அறிக்கை காரணமாக இருக்கலாம். தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும். சிக்கல் தொடர்ந்தால், உதவிக்கு உங்கள் மாடோமோ நிர்வாகியை தொடர்பு கொள்ளவும்.

# MultiSites.EvolutionComparisonIncomplete
source: The currently selected time period is %1$s complete.
ta: தற்போது தேர்ந்தெடுக்கப்பட்ட கால அளவு %1$s முழுமையானது.

# MultiSites.EvolutionComparisonProportional
source: When the previous period was also %1$s complete, there would have been an estimated %2$s %3$s (out of a total of %4$s %3$s in the previous period).
ta: முந்தைய காலமும் %1$s முடிந்ததும், %2$s %3$s மதிப்பிடப்பட்டிருக்கும் (முந்தைய காலகட்டத்தில் மொத்தம் 4 $ s %3$s இல்).

# MultiSites.EvolutionComparisonDay
source: %1$s %2$s this day compared to %3$s %2$s in the previous partial period (%4$s) Evolution: %5$s
ta: முந்தைய பகுதி காலத்தில் ( %4 $ s) படிமலர்ச்சி வளர்ச்சியில் %3$s %2$s உடன் ஒப்பிடும்போது இந்த நாளில் %1$s %2$s: %5 $ s

# MultiSites.EvolutionComparisonWeek
source: %1$s %2$s this week compared to %3$s %2$s in the previous partial period (%4$s) Evolution: %5$s
ta: முந்தைய பகுதி காலத்தில் ( %4 $ s) படிமலர்ச்சி வளர்ச்சியில் %3$s %2$s உடன் ஒப்பிடும்போது இந்த வாரம் %1$s %2$s: %5 $ s

# MultiSites.EvolutionComparisonMonth
source: %1$s %2$s this month compared to %3$s %2$s in the previous partial period (%4$s) Evolution: %5$s
ta: முந்தைய பகுதி காலத்தில் ( %4 $ s) படிமலர்ச்சி வளர்ச்சியில் %3$s %2$s உடன் ஒப்பிடும்போது இந்த மாதம் %1$s %2$s: %5 $ s

# MultiSites.EvolutionComparisonYear
source: %1$s %2$s this year compared to %3$s %2$s in the previous partial period (%4$s) Evolution: %5$s
ta: முந்தைய பகுதி காலத்தில் ( %4 $ s) படிமலர்ச்சி வளர்ச்சியில் %3$s %2$s உடன் ஒப்பிடும்போது இந்த ஆண்டு %1$s %2$s: %5 $ s

# MultiSites.EvolutionFromPreviousDay
source: From previous day
ta: முந்தைய நாளிலிருந்து

# MultiSites.EvolutionFromPreviousMonth
source: From previous month
ta: முந்தைய மாதத்திலிருந்து

# MultiSites.EvolutionFromPreviousPeriod
source: From previous period
ta: முந்தைய காலத்திலிருந்து

# MultiSites.EvolutionFromPreviousWeek
source: From previous week
ta: முந்தைய வாரத்திலிருந்து

# MultiSites.EvolutionFromPreviousYear
source: From previous year
ta: முந்தைய ஆண்டிலிருந்து

# MultiSites.TotalHits
source: Total Hits
ta: மொத்த வெற்றிகள்

# MultiSites.TotalPageviews
source: Total Pageviews
ta: மொத்த பக்கக் காட்சிகள்

# MultiSites.TotalVisits
source: Total Visits
ta: மொத்த வருகைகள்
