Repository: 247i/TACETr
Catalog: உரை/தானி/matomo-plugin-feedback-*.po
Languages: ta

# Feedback.FrequentlyAskedQuestions
source: Frequently Asked Questions
ta: அடிக்கடி கேட்கப்படும் கேள்விகள்

# Feedback.DoYouHaveBugReportOrFeatureRequest
source: Do you have a bug to report or a feature request?
ta: நீங்கள் ஏதேனும் ஒரு பிழையை அல்லது புதிய அம்சம் பற்றி கோர வேண்டுமா?

# Feedback.HowToCreateTicket
source: Please read the recommendations on writing a good %1$sbug report%2$s or %3$sfeature request%4$s. Then register or login on %5$sour issue tracker%6$s and create a %7$snew issue%8$s.
ta: ஒரு நல்ல %1$sbug அறிக்கை %2$s அல்லது %3$sfeature கோரிக்கை %4 $ s ஐ எழுதுவதற்கான பரிந்துரைகளைப் படியுங்கள். பின்னர் %5 $ புளிப்பு வெளியீட்டு டிராக்கர் %6 $ s இல் பதிவுசெய்து அல்லது உள்நுழைகிறு, %7 $ snew வெளியீடு %8 $ s ஐ உருவாக்கவும்.

# Feedback.IWantTo
source: I want to:
ta: எனக்கு தேவை:

# Feedback.LearnWaysToParticipate
source: Learn about all the ways you can %1$s participate%2$s
ta: நீங்கள் %1$s பங்குகொள்ளகூடிய%2$s அனைத்து வழிகளைவும் தெரிந்து கொள்ள

# Feedback.ManuallySendEmailTo
source: Please manually send your message to
ta: தயவுசெய்து சுயமாக உங்கள் செய்தியை இவருக்கு அனுப்புங்கள்

# Feedback.PluginDescription
source: Send your Feedback to the Matomo Team. Share your ideas and suggestions to make Matomo the best analytics platform in the world!
ta: உங்கள் கருத்தை மாடோமோ குழுவுக்கு அனுப்புங்கள். மாடோமோவை உலகின் சிறந்த பகுப்பாய்வு தளமாக மாற்ற உங்கள் யோசனைகளையும் பரிந்துரைகளையும் பகிர்ந்து கொள்ளுங்கள்!

# Feedback.PrivacyClaim
source: Matomo respects your %1$sprivacy%2$s and gives you full control over your data.
ta: மாடோமோ உங்கள் %1 $ ச்பிரிவாசி %2$s ஐ மதிக்கிறது மற்றும் உங்கள் தரவின் மீது முழு கட்டுப்பாட்டையும் வழங்குகிறது.

# Feedback.RateFeatureLeaveMessageDislike
source: How can we improve this feature?
ta: இந்த அம்சத்தை எவ்வாறு மேம்படுத்தலாம்?

# Feedback.RateFeatureLeaveMessageDislikeNamedFeature
source: How can we improve %1$s?
ta: %1$s ஐ எவ்வாறு மேம்படுத்தலாம்?

# Feedback.RateFeatureLeaveMessageDislikeExtra
source: Please let us know more about how we can do better so we can improve Matomo.
ta: தயவுசெய்து நாங்கள் எவ்வாறு சிறப்பாகச் செய்ய முடியும் என்பது பற்றி மேலும் தெரியப்படுத்துங்கள், எனவே நாங்கள் மாடோமோவை மேம்படுத்தலாம்.

# Feedback.RateFeatureLeaveMessageDislikeExtraBugs
source: We're sorry that you encountered issues, please let us know more about what didn't work.
ta: நீங்கள் சிக்கல்களை எதிர்கொண்டதற்கு வருந்துகிறோம், தயவுசெய்து என்ன வேலை செய்யவில்லை என்பது பற்றி மேலும் தெரியப்படுத்துங்கள்.

# Feedback.RateFeatureLeaveMessageDislikeExtraSpeed
source: Could you provide an indication of how slow this feature is for you? Could you share how many visits per month you would typically record?
ta: இந்த நற்பொருத்தம் உங்களுக்கு எவ்வளவு மெதுவாக உள்ளது என்பதற்கான அறிகுறியை வழங்க முடியுமா? நீங்கள் பொதுவாக பதிவு செய்வீர்கள் என்று மாதத்திற்கு எத்தனை வருகைகள் பகிர்ந்து கொள்ள முடியுமா?

# Feedback.RateFeatureLeaveMessageDislikeExtraMissing
source: Which features are you missing?
ta: எந்த அம்சங்களை நீங்கள் காணவில்லை?

# Feedback.RateFeatureLeaveMessageDislikeExtraEasier
source: Was there a particular part of this feature you found difficult to use?
ta: இந்த அம்சத்தின் ஒரு குறிப்பிட்ட பகுதி நீங்கள் பயன்படுத்த கடினமாக இருந்ததா?

# Feedback.RateFeatureLeaveMessageLike
source: What do you like most about this feature?
ta: இந்த அம்சத்தைப் பற்றி நீங்கள் அதிகம் விரும்புவது என்ன?

# Feedback.RateFeatureLeaveMessageLikeNamedFeature
source: What do you like most about %1$s?
ta: %1$s பற்றி நீங்கள் அதிகம் விரும்புவது என்ன?

# Feedback.RateFeatureLeaveMessageLikeExtra
source: Please let us know more about how you use this feature so we can improve Matomo further.
ta: இந்த அம்சத்தை நீங்கள் எவ்வாறு பயன்படுத்துகிறீர்கள் என்பது பற்றி மேலும் தெரியப்படுத்துங்கள், எனவே நாங்கள் மேட்டோமோவை மேலும் மேம்படுத்தலாம்.

# Feedback.RateFeatureLeaveMessageLikeExtraUseful
source: Can you let us know a bit about how you use this information and what you find most useful about it?
ta: இந்த தகவலை நீங்கள் எவ்வாறு பயன்படுத்துகிறீர்கள், அதைப் பற்றி மிகவும் பயனுள்ளதாக இருப்பதைப் பற்றி எங்களுக்குத் தெரியப்படுத்த முடியுமா?

# Feedback.RateFeatureLeaveMessageLikeExtraEasy
source: Is there anything else that could make Matomo easier to use or improve your experience?
ta: உங்கள் அனுபவத்தைப் பயன்படுத்த அல்லது மேம்படுத்த மாடோமோவை எளிதாக்கும் வேறு ஏதாவது இருக்கிறதா?

# Feedback.RateFeatureLeaveMessageLikeExtraConfigurable
source: Are there any configuration options you find particularly useful? Are there any other options you would like to see?
ta: நீங்கள் குறிப்பாக பயனுள்ளதாக இருக்கும் ஏதேனும் உள்ளமைவு விருப்பங்கள் உள்ளதா? நீங்கள் பார்க்க விரும்பும் வேறு ஏதேனும் விருப்பங்கள் உள்ளதா?

# Feedback.RateFeatureSendFeedbackInformation
source: Your Matomo platform will send us (the Matomo team) an email (including your email address) so we can get in contact with you if you have any question.
ta: உங்கள் மாடோமோ இயங்குதளம் எங்களுக்கு (மாடோமோ குழு) ஒரு மின்னஞ்சலை (உங்கள் மின்னஞ்சல் முகவரி உட்பட) அனுப்பும், எனவே உங்களுக்கு ஏதேனும் கேள்வி இருந்தால் நாங்கள் உங்களுடன் தொடர்பு கொள்ளலாம்.

# Feedback.RateFeatureThankYouTitle
source: Thank you for rating '%s'!
ta: '%s' மதிப்பீட்டிற்கு நன்றி!

# Feedback.RateFeatureTitle
source: Do you like the '%s' feature? Please let us know so we can improve Matomo.
ta: '%s' அம்சத்தை விரும்புகிறீர்களா? தயவுசெய்து எங்களுக்குத் தெரியப்படுத்துங்கள், எனவே நாங்கள் மாடோமோவை மேம்படுத்த முடியும்.

# Feedback.RateFeatureUsefulInfo
source: Useful information
ta: பயனுள்ள செய்தி

# Feedback.RateFeatureEasyToUse
source: Easy to use
ta: பயன்படுத்த எளிதானது

# Feedback.RateFeatureConfigurable
source: Configurable
ta: உள்ளமைக்கக்கூடிய

# Feedback.RateFeatureDislikeAddMissingFeatures
source: Add missing features
ta: காணாமல் போன அம்சங்களைச் சேர்க்கவும்

# Feedback.RateFeatureDislikeMakeEasier
source: Make it easier to use
ta: பயன்படுத்த எளிதாக்குங்கள்

# Feedback.RateFeatureDislikeSpeedUp
source: Improve speed
ta: வேகத்தை மேம்படுத்தவும்

# Feedback.RateFeatureDislikeFixBugs
source: Fix bugs
ta: பிழைகள் சரிசெய்யவும்

# Feedback.RateFeatureOtherReason
source: Other reason
ta: மற்ற காரணம்

# Feedback.SendFeedback
source: Send Feedback
ta: கருத்து தெரிவிக்க

# Feedback.ThankYou
source: Thank you for helping us to make Matomo better!
ta: மாடோமோவை சிறந்ததாக்க எங்களுக்கு உதவியதற்கு நன்றி!

# Feedback.ThankYouHeart
source: Thank you for helping us to make Matomo better! %1$s
ta: மாடோமோவை சிறந்ததாக்க எங்களுக்கு உதவியதற்கு நன்றி! %1$s

# Feedback.ThankYouForSpreading
source: Thank you for spreading the word and creating a safer web
ta: வார்த்தையை பரப்புவதற்கும் பாதுகாப்பான வலையை உருவாக்கியதற்கும் நன்றி

# Feedback.TopLinkTooltip
source: Tell us what you think, or request Professional Support.
ta: நீங்கள் என்ன நினைக்கிறீர்கள் என்று எங்களிடம் கூறுங்கள், அல்லது தொழில்முறை ஆதரவைக் கோருங்கள்.

# Feedback.ViewAnswersToFAQ
source: View answers to %1$sFrequently Asked Questions%2$s
ta: %1 க்கான பதில்களைக் காண்க %அடிக்கடி கேட்கப்படும் கேள்விகள் %2$s

# Feedback.FAQs
source: FAQs
ta: கேள்விகள்

# Feedback.ViewUserGuides
source: Learn how to configure Matomo and how to effectively analyze your data with our %1$suser guides%2$s
ta: மாடோமோவை எவ்வாறு கட்டமைப்பது மற்றும் எங்கள் %1$sUSER வழிகாட்டிகள் %2$s உடன் உங்கள் தரவை எவ்வாறு திறம்பட பகுப்பாய்வு செய்வது என்பதை அறிக

# Feedback.UserGuides
source: User guides
ta: பயனர் வழிகாட்டிகள்

# Feedback.CommunityHelp
source: Community Help
ta: சமூக உதவி

# Feedback.ProfessionalHelp
source: Professional Help
ta: தொழில்முறை உதவி

# Feedback.ProfessionalServicesIntro
source: With a Matomo On-Premise Support Subscription, let our experienced team assist you online in utilising Matomo Analytics to grow your business.
ta: ஒரு மாடோமோ ஆன்-ப்ரைமிச் உதவி சந்தாவுடன், உங்கள் வணிகத்தை வளர்க்க மாடோமோ பகுப்பாய்வுகளைப் பயன்படுத்துவதில் எங்கள் பட்டறிவு வாய்ந்த குழு ஆன்லைனில் உங்களுக்கு உதவட்டும்.

# Feedback.ProfessionalServicesOfferIntro
source: What services can you benefit from?
ta: நீங்கள் என்ன சேவைகளுக்கு பயனடையலாம்?

# Feedback.ProfessionalServicesDedicatedSupport
source: Support from a dedicated Matomo team member every step of the way
ta: ஒரு பிரத்யேக மாடோமோ குழு உறுப்பினரின் உதவி ஒவ்வொரு அடியிலும்

# Feedback.ProfessionalServicesOnboarding
source: Onboarding questionnaire and meeting with a Matomo Support member
ta: ஆன் போர்டிங் வினாத்தாள் மற்றும் ஒரு மாடோமோ உதவி உறுப்பினருடன் சந்திப்பு

# Feedback.ProfessionalServicesSupport
source: 24/7 online request service
ta: 24/7 நிகழ்நிலை கோரிக்கை பணி

# Feedback.ProfessionalServicesTraining
source: Exclusive access to Matomo training videos
ta: மாடோமோ பயிற்சி வீடியோக்களுக்கான பிரத்யேக அணுகல்

# Feedback.ProfessionalServicesEmailAlerts
source: Email alerts for security releases for Matomo
ta: MATOMO க்கான பாதுகாப்பு வெளியீடுகளுக்கான மின்னஞ்சல் விழிப்பூட்டல்கள்

# Feedback.ContactUs
source: Contact us
ta: எங்களை தொடர்புகொள்

# Feedback.VisitTheForums
source: Visit the %1$s Forums%2$s and get help from the community of Matomo users
ta: %1$s மன்றங்களை %2$s ஐப் பார்வையிட்டு, மாடோமோ பயனர்களின் சமூகத்தின் உதவியைப் பெறுங்கள்

# Feedback.Forums
source: Forums
ta: மன்றங்கள்

# Feedback.ReviewMatomoTitle
source: Like Matomo?
ta: மாடோமோ போல?

# Feedback.PleaseLeaveExternalReviewForMatomo
source: We really appreciate your feedback. If you have a minute, please share your thoughts on one of these sites and inspire others to join our data revolution.
ta: உங்கள் கருத்தை நாங்கள் மிகவும் பாராட்டுகிறோம். உங்களுக்கு ஒரு மணித்துளி இருந்தால், தயவுசெய்து இந்த தளங்களில் ஒன்றைப் பற்றிய உங்கள் எண்ணங்களைப் பகிர்ந்துகொண்டு, எங்கள் தரவு புரட்சியில் சேர மற்றவர்களை ஊக்குவிக்கவும்.

# Feedback.RemindMeLater
source: Remind me later
ta: பின்னர் எனக்கு நினைவூட்டுங்கள்

# Feedback.NeverAskMeAgain
source: Never ask me again
ta: மீண்டும் என்னிடம் கேட்க வேண்டாம்

# Feedback.HowCanWeHelp
source: How can we help?
ta: நாங்கள் எவ்வாறு உதவ முடியும்?

# Feedback.NotTrackingVisits
source: Why isn’t Matomo tracking any visits?
ta: எந்த வருகைகளையும் மாடோமோ ஏன் கண்காணிக்கவில்லை?

# Feedback.TrackMultipleSites
source: How do I track multiple sites or subdomains?
ta: பல தளங்கள் அல்லது துணை டொமைன்களை எவ்வாறு கண்காணிப்பது?

# Feedback.RemoveOtherLabel
source: I want to see my 'Others' data
ta: எனது 'மற்றவர்கள்' தரவைப் பார்க்க விரும்புகிறேன்

# Feedback.PurgeOldData
source: I want to remove some old data
ta: சில பழைய தரவை அகற்ற விரும்புகிறேன்

# Feedback.SearchHelpResources
source: Search matomo.org help resources
ta: Matomo.org உதவி வளங்களைத் தேடுங்கள்

# Feedback.ReferMatomo
source: Refer Matomo
ta: மாடோமோவைப் பார்க்கவும்

# Feedback.ReferBannerTitle
source: Believe in Matomo?
ta: மாடோமோவை நம்புகிறீர்களா?

# Feedback.ReferBannerLonger
source: Please help us spread the word about us so more people get control over their analytics data.
ta: தயவுசெய்து எங்களைப் பற்றி பரப்ப எங்களுக்கு உதவுங்கள், எனவே அதிகமான மக்கள் தங்கள் பகுப்பாய்வு தரவின் மீது கட்டுப்பாட்டைப் பெறுகிறார்கள்.

# Feedback.ReferBannerEmailShareSubject
source: Refer them to Matomo Analytics now to take back control!
ta: கட்டுப்பாட்டை திரும்பப் பெற இப்போது அவற்றை மாடோமோ அனலிட்டிக்ச் பார்க்கவும்!

# Feedback.ReferBannerEmailShareBody
source: I choose Matomo, an ethical alternative to Google Analytics that gives me 100%% data ownership and protects the data of my website visitors. I’m sharing this message in the hope that you too will take back the power from Google and get complete ownership of your own data. Check out Matomo at https://matomo.org
ta: கூகிள் அனலிட்டிக்சுக்கு ஒரு நெறிமுறை மாற்றான மாடோமோவை நான் தேர்வு செய்கிறேன், இது எனக்கு 100 %% தரவு உரிமையை அளிக்கிறது மற்றும் எனது வலைத்தள பார்வையாளர்களின் தரவைப் பாதுகாக்கிறது. நீங்களும் கூகிளிலிருந்து அதிகாரத்தைத் திரும்பப் பெறுவீர்கள், உங்கள் சொந்த தரவின் முழுமையான உரிமையைப் பெறுவீர்கள் என்ற நம்பிக்கையில் இந்த செய்தியைப் பகிர்ந்து கொள்கிறேன். Https://matomo.org இல் மாடோமோவைப் பாருங்கள்

# Feedback.ReferBannerSocialShareText
source: If you’re using Google Analytics, stay in control by switching to an ethical alternative like Matomo now!
ta: நீங்கள் Google Analytics ஐப் பயன்படுத்துகிறீர்கள் என்றால், இப்போது மாடோமோ போன்ற நெறிமுறை மாற்றுக்கு மாறுவதன் மூலம் கட்டுப்பாட்டில் இருங்கள்!

# Feedback.FormNotEnoughFeedbackText
source: Please don't forget to share your feedback below.
ta: உங்கள் கருத்தை கீழே பகிர்ந்து கொள்ள மறக்காதீர்கள்.

# Feedback.AppreciateFeedback
source: We really appreciate your feedback
ta: உங்கள் கருத்தை நாங்கள் மிகவும் பாராட்டுகிறோம்

# Feedback.WontShowAgain
source: We won't show this message again.
ta: இந்த செய்தியை நாங்கள் மீண்டும் காட்ட மாட்டோம்.

# Feedback.Question0
source: What are your biggest problems or pain points with Matomo and why?
ta: மாடோமோவுடன் உங்கள் மிகப்பெரிய பிரச்சினைகள் அல்லது வலி புள்ளிகள் என்ன, ஏன்?

# Feedback.Question1
source: What is the one thing you’d like to see improved in Matomo and why?
ta: மாடோமோவில் மேம்பட்டதை நீங்கள் காண விரும்பும் ஒரு சேதி என்ன, ஏன்?

# Feedback.Question2
source: What is the feature you are missing the most in Matomo and why?
ta: மாடோமோவில் நீங்கள் அதிகம் காணாத நற்பொருத்தம் என்ன, ஏன்?

# Feedback.Question3
source: What is your main goal for using Matomo?
ta: மாடோமோவைப் பயன்படுத்துவதற்கான உங்கள் முக்கிய குறிக்கோள் என்ன?

# Feedback.Question4
source: What is your main concern about Matomo?
ta: மாடோமோவைப் பற்றிய உங்கள் முக்கிய கவலை என்ன?

# Feedback.FeedbackTitle
source: Please help us improve Matomo
ta: மாடோமோவை மேம்படுத்த எங்களுக்கு உதவுங்கள்

# Feedback.FeedbackSubtitle
source: Here's your chance to ask for it! Please describe in as much details as you can. <br/> Your feedback will help us improve Matomo. %1$s
ta: அதைக் கேட்க உங்களுக்கு வாய்ப்பு இங்கே! உங்களால் முடிந்தவரை விவரங்களை விவரிக்கவும். <br/> உங்கள் கருத்து மாடோமோவை மேம்படுத்த எங்களுக்கு உதவும். %1$s

# Feedback.ThankYourForFeedback
source: We really appreciate your feedback! %1$s We will be in touch in case we require more information about your feedback.
ta: உங்கள் கருத்தை நாங்கள் மிகவும் பாராட்டுகிறோம்! உங்கள் கருத்தைப் பற்றிய கூடுதல் தகவல்கள் தேவைப்பட்டால் நாங்கள் தொடர்பில் இருப்போம்.

# Feedback.Policy
source: Your message and your email address will be sent to us by submitting this form. The information will be only used to improve our products and services. Your data will be processed by us, our hosting provider, and our support ticket provider. For more information have a look at %1$sMatomo's Privacy Policy%2$s.
ta: இந்த படிவத்தை சமர்ப்பிப்பதன் மூலம் உங்கள் செய்தியும் உங்கள் மின்னஞ்சல் முகவரியும் எங்களுக்கு அனுப்பப்படும். எங்கள் தயாரிப்புகள் மற்றும் சேவைகளை மேம்படுத்த மட்டுமே செய்தி பயன்படுத்தப்படும். உங்கள் தரவு எங்களால், எங்கள் ஓச்டிங் வழங்குநர் மற்றும் எங்கள் உதவி டிக்கெட் வழங்குநரால் செயலாக்கப்படும். மேலும் தகவலுக்கு %1 $ ச்மாடோமோவின் தனியுரிமைக் கொள்கை %2$s ஐப் பாருங்கள்.

# Feedback.MessageBodyValidationError
source: The message body is too short (minimum is 10 characters).
ta: செய்தி உடல் மிகக் குறைவு (குறைந்தபட்சம் 10 எழுத்துக்கள்).

# Feedback.HowToMigrateFromGA
source: How do I migrate from Google Analytics?
ta: கூகிள் அனலிட்டிக்சிலிருந்து நான் எவ்வாறு இடம்பெயர்வது?

# Feedback.HowToDefineAndTrackGoals
source: How do I define and track Goal conversions?
ta: இலக்கு மாற்றங்களை எவ்வாறு வரையறுத்து கண்காணிப்பது?

# Feedback.HowToGetStartedWithMtm
source: How do I get started with Matomo Tag Manager?
ta: மாடோமோ டேக் மேலாளருடன் நான் எவ்வாறு தொடங்குவது?

# Feedback.HowToMigrateFromGtm
source: How do I migrate from Google Tag Manager?
ta: கூகிள் டேக் மேலாளரிடமிருந்து நான் எவ்வாறு இடம்பெயர்வது?

# Feedback.HowToTrackEcommerce
source: How do I track Ecommerce orders?
ta: இணையவழி ஆர்டர்களை எவ்வாறு கண்காணிப்பது?

# Feedback.MatomoHelpCentre
source: Matomo Help Centre
ta: மாடோமோ உதவி நடுவண்

# Feedback.KnowledgeBase
source: Knowledge Base
ta: அறிவுத் தளம்

# Feedback.KnowledgeBaseDescription
source: FAQs, comprehensive guides, how-to’s and troubleshooting documents.
ta: கேள்விகள், விரிவான வழிகாட்டிகள், எப்படி-எப்படி மற்றும் சரிசெய்தல் ஆவணங்கள்.

# Feedback.CommunityForum
source: Community Forum
ta: சமூக மன்றம்

# Feedback.CommunityForumDescription
source: Ask questions, browse solutions or share your knowledge with the Matomo Community.
ta: கேள்விகளைக் கேளுங்கள், தீர்வுகளை உலாவவும் அல்லது உங்கள் அறிவை மாடோமோ சமூகத்துடன் பகிர்ந்து கொள்ளவும்.

# Feedback.GlossaryDescription
source: Learn the definitions of terminology used in Matomo and web analytics.
ta: மாடோமோ மற்றும் வலை பகுப்பாய்வுகளில் பயன்படுத்தப்படும் சொற்களின் வரையறைகளை அறிக.

# Feedback.MatomoVideoTraining
source: Matomo Video Training
ta: மாடோமோ வீடியோ பயிற்சி

# Feedback.MatomoVideoTrainingDescription
source: Learn the fundamentals of web analytics and how to use Matomo.
ta: வலை பகுப்பாய்வுகளின் அடிப்படைகள் மற்றும் மாடோமோவை எவ்வாறு பயன்படுத்துவது என்பதை அறிக.

# Feedback.MtmVideoTraining
source: Matomo Tag Manager Video Training
ta: மாடோமோ டேக் மேலாளர் வீடியோ பயிற்சி

# Feedback.MtmVideoTrainingDescription
source: Get started or uncover more ways to master the power of Matomo Tag Manager.
ta: தொடங்கத் தொடங்கவும் அல்லது மேட்டோமோ டேக் மேலாளரின் சக்தியை மாச்டர் செய்ய கூடுதல் வழிகளைக் கண்டறியவும்.
