Repository: 247i/TACETr
Catalog: உரை/தானி/me-lucky-silence-app-*.po
Languages: ta

# app_name
source: Silence
ta: ம .னம்

# contacted_main
source: Contacted
ta: தொடர்பு கொள்ளப்பட்டது

# contacted_description
source: Allow calls from the numbers you have contacted.
ta: நீங்கள் தொடர்பு கொண்ட எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# contacted_call
source: Call
ta: அழைப்பு

# contacted_call_description
source: Allow calls from numbers you have called.
ta: நீங்கள் அழைத்த எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# contacted_message
source: Message
ta: செய்தி

# contacted_message_description
source: Allow calls from numbers you have sent a message to.
ta: நீங்கள் ஒரு செய்தியை அனுப்பிய எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# contacted_answer
source: Answer
ta: பதில்

# contacted_answer_description
source: Allow calls from numbers you have already answered.
ta: நீங்கள் ஏற்கனவே பதிலளித்த எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# groups_main
source: Groups
ta: குழுக்கள்

# groups_description
source: Allow calls from numbers within the selected groups.
ta: தேர்ந்தெடுக்கப்பட்ட குழுக்களுக்குள் எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# groups_local
source: Local
ta: உள்ளக

# groups_local_description
source: Allow calls from numbers with the same country code as your.
ta: உங்களுடைய அதே நாட்டு குறியீட்டைக் கொண்ட எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# groups_not_local
source: Not local
ta: உள்ளக அல்ல

# groups_not_local_description
source: Allow calls from numbers with country codes different from yours.
ta: உங்களிடமிருந்து வேறுபட்ட நாட்டு குறியீடுகளுடன் எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# groups_toll_free
source: Toll-Free
ta: கட்டணமில்லா

# groups_toll_free_description
source: Allow calls from Toll-Free numbers (ex 800).
ta: கட்டணமில்லா எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும் (EX 800).

# groups_mobile
source: Mobile
ta: மொபைல்

# groups_mobile_description
source: Allow calls from mobile numbers.
ta: மொபைல் எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# groups_local_mobile
source: Local & Mobile
ta: உள்ளக & மொபைல்

# groups_local_mobile_description
source: Allow calls from mobile numbers with the same country code as your.
ta: மொபைல் எண்களிலிருந்து அழைப்புகளை உங்கள் அதே நாட்டு குறியீட்டைக் கொண்டு அனுமதிக்கவும்.

# regex_main
source: Regex
ta: வழக்கவெளி

# regex_description
source: Process calls from numbers matching regular expression.
ta: வழக்கமான வெளிப்பாட்டுடன் பொருந்தக்கூடிய எண்களிலிருந்து செயல்முறை அழைப்புகள்.

# regex_pattern_hint
source: Pattern
ta: முறை

# regex_pattern_helper_text
source: Allow calls from numbers matching regular expression.
ta: வழக்கமான வெளிப்பாட்டுடன் பொருந்தக்கூடிய எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# regex_pattern_error
source: Invalid regex!
ta: தவறான ரீசெக்ச்!

# repeated_main
source: Repeated
ta: மறுநிகழ்வு

# repeated_description
source: Allow X registered call(s) from the same number within a set amount of minutes.
ta: அதே எண்ணிலிருந்து ஃச் பதிவுசெய்யப்பட்ட அழைப்பு (களை) ஒரு குறிப்பிட்ட நிமிடங்களுக்குள் அனுமதிக்கவும்.

# repeated_count
source: Count
ta: எண்ணுங்கள்

# repeated_minutes
source: Minutes
ta: நிமிடங்கள்

# repeated_settings_description
source: Count has to be lower than minutes. Because Android caches the result, calls have to be out of the cache interval.
ta: எண்ணிக்கை நிமிடங்களை விட குறைவாக இருக்க வேண்டும். அண்ட்ராய்டு முடிவைத் தேடும் என்பதால், அழைப்புகள் கேச் இடைவெளியில் இருக்க வேண்டும்.

# repeated_burst_timeout_hint
source: Timeout
ta: நேரம் முடிந்தது

# repeated_burst_timeout_helper_text
source: Minimal timeout in seconds between repeated calls.
ta: மறுநிகழ்வு அழைப்புகளுக்கு இடையில் விநாடிகளில் குறைந்தபட்ச நேரம் முடிந்தது.

# messages_main
source: Messages
ta: செய்திகள்

# messages_description
source: Allow calls from numbers found in messages.
ta: செய்திகளில் காணப்படும் எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# messages_inbox
source: Inbox
ta: இன்பாக்ச்

# messages_inbox_description
source: Allow calls from numbers that sent you a message.
ta: உங்களுக்கு ஒரு செய்தியை அனுப்பிய எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# messages_text
source: Text
ta: உரை

# messages_text_description
source: Temporarily allow calls from mobile numbers found in incoming messages text.
ta: உள்வரும் செய்திகள் உரையில் காணப்படும் மொபைல் எண்களிலிருந்து அழைப்புகளை தற்காலிகமாக அனுமதிக்கவும்.

# messages_text_ttl_hint
source: Time
ta: நேரம்

# messages_text_ttl_helper_text
source: How much time the number will be able to call you. Modifiers: [d]ays [h]ours [m]inutes
ta: எண் எவ்வளவு நேரம் உங்களை அழைக்க முடியும். மாற்றியமைப்பாளர்கள்: [d] ays [h] நம்முடையது [m] inutes

# messages_text_ttl_error
source: 7d / 48h / 120m
ta: 7 டி / 48 எச் / 120 மீ

# block_main
source: Block
ta: தொகுதி

# block_description
source: Block all incoming calls. To also block numbers from contacts you have to grant a permission.
ta: உள்வரும் அனைத்து அழைப்புகளையும் தடுக்கவும். தொடர்புகளிலிருந்து எண்களைத் தடுக்க நீங்கள் இசைவு வழங்க வேண்டும்.

source: SIM
ta: சிம்

source: SIM 1
ta: சிம் 1

# sim_1_description
source: Allow all calls from SIM 1.
ta: சிம் 1 இலிருந்து அனைத்து அழைப்புகளையும் அனுமதிக்கவும்.

source: SIM 2
ta: சிம் 2

# sim_2_description
source: Allow all calls from SIM 2.
ta: சிம் 2 இலிருந்து அனைத்து அழைப்புகளையும் அனுமதிக்கவும்.

source: Extra
ta: கூடுதல்

# extra_contacts
source: Contacts
ta: தொடர்புகள்

# extra_contacts_description
source: Allow calls from numbers in your contacts.
ta: உங்கள் தொடர்புகளில் உள்ள எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# extra_unknown_numbers
source: Unknown numbers
ta: தெரியாத எண்கள்

# extra_unknown_numbers_description
source: Allow calls from strangers without a number.
ta: எண் இல்லாமல் அந்நியர்களிடமிருந்து அழைப்புகளை அனுமதிக்கவும்.

# extra_short_numbers
source: Short numbers
ta: குறுகிய எண்கள்

# extra_short_numbers_description
source: Allow calls from numbers with length from 3 up to 5 digits.
ta: 3 முதல் 5 இலக்கங்கள் வரை நீளமுள்ள எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# extra_plus_numbers
source: Plus numbers
ta: பிளச் எண்கள்

# extra_plus_numbers_description
source: Allow calls from numbers not starting with a plus.
ta: பிளச் உடன் தொடங்காத எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

# extra_stir
source: STIR/SHAKEN
ta: கிளறவும்/அசைக்கவும்

# extra_stir_description
source: Allow calls from numbers passing STIR verification.
ta: STIR சரிபார்ப்பைக் கடக்கும் எண்களிலிருந்து அழைப்புகளை அனுமதிக்கவும்.

source: Settings
ta: அமைப்புகள்

# settings_controller
source: Controller
ta: கட்டுப்படுத்தி

# settings_controller_description
source: Enable broadcast receiver to control Silence with intents.
ta: நோக்கங்களுடன் ம silence னத்தைக் கட்டுப்படுத்த ஒளிபரப்பு பெறுநரை இயக்கவும்.

# settings_disallow_call
source: Disallow call
ta: அழைப்பை அனுமதிக்கவும்

# settings_disallow_call_description
source: Sets whether the incoming call should be blocked.
ta: உள்வரும் அழைப்பைத் தடுக்க வேண்டுமா என்பதை அமைக்கிறது.

# settings_reject_call
source: Reject call
ta: அழைப்பை நிராகரிக்கவும்

# settings_reject_call_description
source: Sets whether the incoming call should be disconnected as if the user had manually rejected it. This should only be checked if the call is disallowed.
ta: பயனர் அதை கைமுறையாக நிராகரித்ததைப் போல உள்வரும் அழைப்பு துண்டிக்கப்பட வேண்டுமா என்பதை அமைக்கிறது. அழைப்பு அனுமதிக்கப்படாவிட்டால் மட்டுமே இதைச் சரிபார்க்க வேண்டும்.

# settings_silence_call
source: Silence call
ta: ம silence ன அழைப்பு

# settings_silence_call_description
source: Sets whether ringing should be silenced for the incoming call. The call will, however, still be sent to the default dialer app if it is not blocked. Checking this only makes sense when the call has not been disallowed.
ta: உள்வரும் அழைப்புக்கு ரிங்கிங் ம sile னமாக இருக்க வேண்டுமா என்று அமைக்கிறது. இருப்பினும், அழைப்பு தடுக்கப்படாவிட்டால் இயல்புநிலை டயலர் பயன்பாட்டிற்கு அனுப்பப்படும். இதைச் சரிபார்ப்பது அழைப்பு அனுமதிக்கப்படாதபோது மட்டுமே அர்த்தமுள்ளதாக இருக்கும்.

# settings_skip_call_log
source: Skip call log
ta: அழைப்பு பதிவைத் தவிர்க்கவும்

# settings_skip_call_log_description
source: Sets whether the incoming call should not be displayed in the call log. This should only be checked if the call is disallowed. Calls will still be logged with type BLOCKED_TYPE.
ta: அழைப்பு பதிவில் உள்வரும் அழைப்பு காட்டப்படக்கூடாது என்பதை அமைக்கிறது. அழைப்பு அனுமதிக்கப்படாவிட்டால் மட்டுமே இதைச் சரிபார்க்க வேண்டும். வகை தடுக்கப்பட்ட_ வகை மூலம் அழைப்புகள் இன்னும் உள்நுழைந்திருக்கும்.

# settings_skip_notification
source: Skip notification
ta: அறிவிப்பைத் தவிர்க்கவும்

# settings_skip_notification_description
source: Sets whether a missed call notification should not be shown for the incoming call. This should only be checked if the call is disallowed.
ta: உள்வரும் அழைப்புக்கு தவறவிட்ட அழைப்பு அறிவிப்பு காட்டப்படக்கூடாது என்பதை அமைக்கிறது. அழைப்பு அனுமதிக்கப்படாவிட்டால் மட்டுமே இதைச் சரிபார்க்க வேண்டும்.

# panic_app_dialog_title
source: Confirm panic app
ta: அச்சம் பயன்பாட்டை உறுதிப்படுத்தவும்

# panic_app_dialog_message
source: Are you sure you want to allow %1$s to trigger destructive panic actions?
ta: அழிவுகரமான அச்சம் செயல்களைத் தூண்டுவதற்கு %1$s ஐ அனுமதிக்க விரும்புகிறீர்களா?

# panic_app_unknown_app
source: an unknown app
ta: அறியப்படாத பயன்பாடு

source: Allow
ta: இசைவு

source: Block
ta: தொகுதி

# notification_channel
source: Blocked calls
ta: தடுக்கப்பட்ட அழைப்புகள்

# notification_title
source: Blocked call
ta: தடுக்கப்பட்ட அழைப்பு

# goto_button
source: GOTO
ta: கோட்டோ

# extra_description
source: Allow calls from some miscellaneous groups/identifiers.
ta: சில இதர குழுக்கள்/அடையாளங்காட்டிகளிடமிருந்து அழைப்புகளை அனுமதிக்கவும்.

# sim_description
source: Process all calls from one or both SIM cards.
ta: ஒன்று அல்லது இரண்டு சிம் கார்டுகளிலிருந்தும் அனைத்து அழைப்புகளையும் செயலாக்கவும்.

source: Back
ta: பின்

# toggle_off
source: Off
ta: அணை

# toggle_on
source: On
ta: ஆன்
