Repository: 247i/TACETr
Catalog: உரை/தானி/meditation-assistant-application-*.po
Languages: ta

# appNameShort
source: Meditation Assistant
ta: தியான உதவியாளர்

source: About
ta: பற்றி

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Warning
ta: எச்சரிக்கை

source: Open with
ta: உடன் திறக்கவும்

source: Delete
ta: நீக்கு

source: Sessions
ta: அமர்வுகள்

source: Community
ta: சமூகம்

source: Forum
ta: மன்றம்

source: Rate
ta: மதிப்பிடவும்

source: Refresh
ta: புதுப்பிப்பு

source: Page
ta: பக்கம்

source: Back
ta: பின்

source: Forward
ta: முன்னோக்கி

source: Account
ta: கணக்கு

source: Groups
ta: குழுக்கள்

source: Announcement
ta: அறிவிப்பு

# installFileManager
source: Please install a file manager
ta: கோப்பு மேலாளரை நிறுவவும்

# disableBatteryOptimizations
source: Meditation Assistant must run in the background
ta: தியான உதவியாளர் பின்னணியில் இயங்க வேண்டும்

source: Permission Request
ta: இசைவு கோரிக்கை

# permissionRequired
source: This permission is required.
ta: இந்த இசைவு தேவை.

# permissionRequestNotificationControl
source: Please grant access on the next screen to control Do Not Disturb.
ta: தொந்தரவு செய்யாததைக் கட்டுப்படுத்த அடுத்த திரையில் அணுகலை வழங்கவும்.

source: Deny
ta: மறுக்கவும்

source: Try Again
ta: மீண்டும் முயற்சிக்கவும்

source: Timer
ta: நேரங்குறிகருவி

# timerHelp
source: Welcome to a brief tutorial. This is the session timer. Tap it now to change the timer mode and duration.
ta: ஒரு சுருக்கமான பயிற்சிக்கு வரவேற்கிறோம். இது அமர்வு நேரங்குறிகருவி ஆகும். நேரங்குறிகருவி பயன்முறையையும் கால அளவையும் மாற்ற இப்போது அதைத் தட்டவும்.

# editTimerHelp
source: Your session may be a specific duration, may last until a specific time of day, or may not be timed at all. Presets may be used to store common configurations. Press and hold a preset to remember the current session duration. Sounds and other settings may also be remembered by presets by enabling them in Preset Settings. After tapping OK, tap Cancel or Confirm to continue.
ta: உங்கள் அமர்வு ஒரு குறிப்பிட்ட கால அளவாக இருக்கலாம், ஒரு குறிப்பிட்ட நாளின் நேரம் வரை நீடிக்கலாம் அல்லது நேரமே இல்லாமல் இருக்கலாம். பொதுவான உள்ளமைவுகளைச் சேமிக்க முன்னமைவுகள் பயன்படுத்தப்படலாம். தற்போதைய அமர்வின் கால அளவை நினைவில் கொள்ள முன்னமைவை அழுத்திப் பிடிக்கவும். ஒலிகள் மற்றும் பிற அமைப்புகளை முன்னமைவு அமைப்புகளில் இயக்குவதன் மூலம் முன்னமைவுகளால் நினைவில் வைக்கப்படலாம். சரி என்பதைத் தட்டிய பிறகு, தொடர நீக்கறல் அல்லது உறுதிப்படுத்து என்பதைத் தட்டவும்.

# settingsHelp
source: This application includes numerous features and customizations. Tap the Settings icon to see these options.
ta: இந்த பயன்பாட்டில் பல நற்பொருத்தங்கள் மற்றும் தனிப்பயனாக்கங்கள் உள்ளன. இந்த விருப்பங்களைப் பார்க்க, அமைப்புகள் ஐகானைத் தட்டவும்.

# medinetHelp
source: Sign in to MediNET to save your sessions online. You can import your sessions later if you lose your data. This feature is entirely optional, storing sessions locally will not hinder your experience. This concludes the tutorial. I hope that Meditation Assistant will be beneficial for your practice.
ta: உங்கள் அமர்வுகளை ஆன்லைனில் சேமிக்க MediNET இல் உள்நுழையவும். உங்கள் தரவை இழந்தால் உங்கள் அமர்வுகளை பின்னர் இறக்குமதி செய்யலாம். இந்த நற்பொருத்தம் முற்றிலும் விருப்பமானது, அமர்வுகளை உள்நாட்டில் சேமிப்பது உங்கள் அனுபவத்தைத் தடுக்காது. இத்துடன் டுடோரியல் முடிவடைகிறது. தியான உதவியாளர் உங்கள் பயிற்சிக்கு பயனுள்ளதாக இருக்கும் என்று நம்புகிறேன்.

source: Cancel
ta: ரத்துசெய்

source: Set
ta: கணம்

source: Confirm
ta: உறுதிப்படுத்தவும்

source: Meditate
ta: தியானம் வெற்றி

# tapToSkip
source: Skip
ta: தவிர்

source: Pause
ta: இடைநிறுத்தம்

source: Resume
ta: ரெச்யூம்

source: End
ta: முடிவு

source: Pause or end
ta: இடைநிறுத்தவும் அல்லது முடிக்கவும்

source: Resume or end
ta: தொடரவும் அல்லது முடிக்கவும்

# pausedNotification
source: Session paused, hold to end
ta: அமர்வு இடைநிறுத்தப்பட்டது, முடிவடையும் வரை வைத்திருங்கள்

# mediNETConnecting
source: Connecting…
ta: இணைக்கிறது…

# mediNETConnected
source: Connected to MediNET
ta: MediNET உடன் இணைக்கப்பட்டுள்ளது

source: Session in progress
ta: அமர்வு நடந்து கொண்டிருக்கிறது

source: Session paused
ta: அமர்வு இடைநிறுத்தப்பட்டது

source: Progress
ta: முன்னேற்றம்

source: Set preset
ta: முன்னமைவை அமைக்கவும்

# setPresetHint
source: Hold to set preset
ta: முன்னமைவை அமைக்க அழுத்திப் பிடிக்கவும்

# setPresetTip
source: Choose which settings to restore by tapping the gear icon (Settings), then tap Preset settings.
ta: கியர் ஐகானை (அமைப்புகள்) தட்டுவதன் மூலம் எந்த அமைப்புகளை மீட்டமைக்க வேண்டும் என்பதைத் தேர்வுசெய்து, முன்னமைக்கப்பட்ட அமைப்புகளைத் தட்டவும்.

# setPresetHintBlank
source: Enter a duration (or end time) to set preset
ta: முன்னமைவை அமைக்க காலத்தை (அல்லது இறுதி நேரத்தை) உள்ளிடவும்

# setVibrationTip
source: Enter the number of milliseconds to turn the vibrator on or off, separated by commas.
ta: வைப்ரேட்டரை ஆன் அல்லது ஆஃப் செய்ய, காற்புள்ளிகளால் பிரிக்கப்பட்ட மில்லி விநாடிகளின் எண்ணிக்கையை உள்ளிடவும்.

source: Configure Widget
ta: விட்செட்டை உள்ளமைக்கவும்

source: Label
ta: சிட்டை

source: Pattern
ta: முறை

# setTimerDurationHint
source: Enter a valid duration (e.g. 0:22)
ta: சரியான கால அளவை உள்ளிடவும் (எ.கா. 0:22)

# setTimerEndAtHint
source: Enter a valid time (e.g. 4:20)
ta: சரியான நேரத்தை உள்ளிடவும் (எ.கா. 4:20)

# invalidEndAt
source: Invalid time to end session
ta: அமர்வை முடிக்க தவறான நேரம்

source: Timed
ta: நேரம் முடிந்தது

source: End at
ta: மணிக்கு முடிவு

source: Untimed
ta: நேரமில்லாது

source: Unlimited
ta: வரம்பற்றது

# presetLabelEndAt
source: End %s
ta: முடிவு %s

source: Resources
ta: வளங்கள்

source: Mindfulness bell
ta: நினைவாற்றல் மணி

source: Mindfulness bell active
ta: நினைவாற்றல் மணி செயலில் உள்ளது

source: Interval
ta: இடைவேளை

source: Deactivate
ta: செயலிழக்கச் வெற்றி

source: How to meditate
ta: தியானம் செய்வது எப்படி

# whatIsMediNET
source: MediNET overview
ta: மெடிநெட் கண்ணோட்டம்

# whatIsMediNETHelp
source: MediNET is an online meditation session repository and community. You may choose to store your sessions on MediNET to prevent data loss and/or to share your progress with others online. You may instead choose to store session data on the device only.
ta: MediNET என்பது நிகழ்நிலை தியான அமர்வு களஞ்சியம் மற்றும் சமூகமாகும். தரவு இழப்பைத் தடுக்க மற்றும்/அல்லது உங்கள் முன்னேற்றத்தை ஆன்லைனில் மற்றவர்களுடன் பகிர்ந்து கொள்ள MediNET இல் உங்கள் அமர்வுகளைச் சேமிக்க நீங்கள் தேர்வு செய்யலாம். அதற்குப் பதிலாக, சாதனத்தில் மட்டுமே அமர்வுத் தரவைச் சேமிப்பதைத் தேர்வுசெய்யலாம்.

source: Replay tutorial
ta: ரீப்ளே டுடோரியல்

# tapToLearnMore
source: Tap anywhere to learn more
ta: மேலும் அறிய எங்கும் தட்டவும்

source: Send email
ta: மின்னஞ்சல் அனுப்பவும்

# version
source: Version %s
ta: பதிப்பு %s

source: Translate
ta: மொழிபெயர்த்திடு

source: Donate
ta: நன்கொடை

# chooseDonationMethod
source: Please choose how you would like to donate. Liberapay is preferred by the developer and supports more countries and currencies.
ta: நீங்கள் எப்படி நன்கொடை அளிக்க விரும்புகிறீர்கள் என்பதைத் தேர்வு செய்யவும். Liberapay டெவலப்பரால் விரும்பப்படுகிறது மற்றும் அதிக நாடுகள் மற்றும் நாணயங்களை ஆதரிக்கிறது.

source: Share
ta: பங்கு

# sourceRepository
source: Source Code Repository
ta: மூலக் குறியீடு களஞ்சியம்

# invitationBlurb
source: Meditation Assistant is a fully featured companion to your practice.
ta: தியான உதவியாளர் உங்கள் பயிற்சியின் முழு அம்சமான துணை.

source: Session
ta: அமர்வு

# sessionDeleteEverywhere
source: Delete everywhere
ta: எல்லா இடங்களிலும் நீக்கு

# sessionDeleteLocally
source: Delete locally
ta: உள்ளூரில் நீக்கு

# sessionDeleteMediNET
source: Delete on MediNET
ta: MediNET இல் நீக்கு

# pref_sessionintro
source: Introduction
ta: அறிமுகம்

source: Preset settings
ta: முன்னமைக்கப்பட்ட அமைப்புகள்

source: Mode and duration
ta: முறை மற்றும் காலம்

# streakdifferencewarning
source: Your current meditation streak does not seem correct based on current session data. Use updated meditation streak? Current streak: %1$d Updated streak: %2$d
ta: தற்போதைய அமர்வுத் தரவின் அடிப்படையில் உங்கள் தற்போதைய தியானம் சரியாகத் தெரியவில்லை. புதுப்பிக்கப்பட்ட தியானப் பாதையைப் பயன்படுத்தவா? தற்போதைய தொடர்: %1$d புதுப்பிக்கப்பட்ட ச்ட்ரீக்: %2$d

# postUpdatedSession
source: Post updated session to MediNET?
ta: MediNET இல் புதுப்பிக்கப்பட்ட அமர்வை இடுகையிடவா?

source: Session Complete
ta: அமர்வு முடிந்தது

# sessionMessagePlaceholder
source: Message
ta: செய்தி

# askDiscardText
source: Discard session?
ta: அமர்வை நிராகரிக்கவா?

# sessionPosting
source: Posting session…
ta: அமர்வை இடுகையிடுகிறது…

# sessionPosted
source: Session posted to MediNET
ta: MediNET க்கு அமர்வு இடுகையிடப்பட்டது

source: Session already posted
ta: அமர்வு ஏற்கனவே வெளியிடப்பட்டது

# sessionNotPosted
source: Unable to post session
ta: அமர்வை இடுகையிட முடியவில்லை

# sessionNotPostedMeditating
source: Unable to post session while meditating
ta: தியானம் செய்யும் போது அமர்வை இடுகையிட முடியவில்லை

source: Session saved
ta: அமர்வு சேமிக்கப்பட்டது

source: Session deleted locally
ta: அமர்வு உள்ளூரில் நீக்கப்பட்டது

source: Browser
ta: உலாவி

source: Use browser:
ta: உலாவியைப் பயன்படுத்தவும்:

source: Sign in with…
ta: இதன் மூலம் உள்நுழைக…

# signInWithProvider
source: Sign in with %s…
ta: %s உடன் உள்நுழைக…

# signInWithOpenID
source: OpenID - Facebook, Twitter, etc.
ta: OpenID - Facebook, Twitter போன்றவை.

# signInGoogleError
source: Unable to authenticate using account manager. Try OpenID if this error persists.
ta: கணக்கு மேலாளரைப் பயன்படுத்தி அங்கீகரிக்க முடியவில்லை. இந்த பிழை தொடர்ந்தால் OpenID ஐ முயற்சிக்கவும்.

source: Calendar
ta: நாள்காட்டி

source: Statistics
ta: புள்ளிவிவரங்கள்

source: Total time spent meditating
ta: தியானத்தில் செலவழித்த மொத்த நேரம்

# dayMondayShort
source: Mon
ta: தி

# dayTuesdayShort
source: Tue
ta: செவ்வாய்

# dayWednesdayShort
source: Wed
ta: அறிவன்

# dayThursdayShort
source: Thu
ta: வியாழன்

# dayFridayShort
source: Fri
ta: வெள்ளி

# daySaturdayShort
source: Sat
ta: காரி

# daySundayShort
source: Sun
ta: சூரியன்

source: Add session
ta: அமர்வைச் சேர்க்கவும்

source: Edit session
ta: அமர்வைத் திருத்து

source: Session added
ta: அமர்வு சேர்க்கப்பட்டது

source: Session edited
ta: அமர்வு திருத்தப்பட்டது

source: Add
ta: கூட்டு

source: Edit
ta: தொகு

source: Export sessions
ta: ஏற்றுமதி அமர்வுகள்

# sessionExportFailed
source: Unable to export sessions
ta: அமர்வுகளை ஏற்றுமதி செய்ய முடியவில்லை

# sessionExportWasSuccessful
source: Sessions exported.
ta: அமர்வுகள் ஏற்றுமதி செய்யப்பட்டன.

# sessionStartedAt
source: Started at %s
ta: %s இல் தொடங்கியது

source: Started
ta: தொடங்கப்பட்டது

source: Completed
ta: முடிந்தது

source: Length
ta: நீளம்

source: Set date
ta: தேதியை அமைக்கவும்

source: Set time
ta: நேரத்தை அமைக்கவும்

source: Invalid date or time
ta: தவறான தேதி அல்லது நேரம்

source: Invalid length
ta: தவறான நீளம்

# addSessionMeditating
source: Unable to add a session while meditating
ta: தியானம் செய்யும் போது ஒரு அமர்வைச் சேர்க்க முடியவில்லை

# editSessionMeditating
source: Unable to edit a session while meditating
ta: தியானம் செய்யும் போது அமர்வைத் திருத்த முடியவில்லை

# sessionExists
source: Session already exists
ta: அமர்வு ஏற்கனவே உள்ளது

source: Days
ta: நாட்கள்

source: Hours
ta: மணிநேரம்

source: Minutes
ta: நிமிடங்கள்

source: Total sessions
ta: மொத்த அமர்வுகள்

source: Average duration
ta: சராசரி கால அளவு

source: Longest duration
ta: மிக நீண்ட காலம்

source: Longest streak
ta: மிக நீளமான கோடு

# reminderText
source: Do you have a moment?
ta: உங்களுக்கு ஒரு கணம் இருக்கிறதா?

source: Meditation
ta: தியானம்

source: Vibrate
ta: அதிர்வு

# pref_meditation_vibrate_start
source: Start vibration
ta: அதிர்வைத் தொடங்கவும்

# pref_meditation_vibrate_interval
source: Interval vibration
ta: இடைவெளி அதிர்வு

# pref_meditation_vibrate_finish
source: Complete vibration
ta: முழுமையான அதிர்வு

# pref_vibrate_summary
source: Occurs at the beginning, intervals, and end of meditation
ta: தியானத்தின் துவக்கம், இடைவெளிகள் மற்றும் முடிவில் நிகழ்கிறது

# pref_vibrate_reminder_summary
source: The daily reminder will vibrate the device
ta: நாள்தோறும் நினைவூட்டல் சாதனத்தை அதிர்வுறும்

# pref_sound_reminder
source: Play sound
ta: ஒலியை இயக்கவும்

# pref_sound_reminder_summary
source: The default notification sound will be played
ta: இயல்புநிலை அறிவிப்பு ஒலி இயக்கப்படும்

# pref_softfinish
source: Endless session
ta: முடிவற்ற அமர்வு

# pref_softfinish_summary
source: Keep the timer running
ta: டைமரை இயக்கவும்

source: Settings
ta: அமைப்புகள்

source: Disabled
ta: முடக்கப்பட்டது

source: None
ta: எதுவுமில்லை

source: No special behavior
ta: சிறப்பு நடத்தை இல்லை

source: Start
ta: தொடங்கு

# labelShort
source: Short
ta: குறுக்கு

# labelMedium
source: Medium
ta: சராசரி

# labelLong
source: Long
ta: நீளமானது

source: Custom
ta: தனிப்பயன்

source: No sound
ta: ஒலி இல்லை

source: Custom sound
ta: விருப்ப ஒலி

source: During session
ta: அமர்வின் போது

source: Always
ta: எப்போதும்

source: Keep screen on
ta: திரையை இயக்கவும்

source: Keep screen on and dim
ta: திரையை ஆன் செய்து மங்கலாக்கவும்

source: Dim screen
ta: மங்கலான திரை

# pref_display_seconds
source: Display seconds
ta: காட்சி வினாடிகள்

# pref_display_seconds_summary
source: Shown below the main timer
ta: முக்கிய நேரங்குறிகருவி கீழே காட்டப்பட்டுள்ளது

# pref_meditationstreakbuffer
source: Streak resets at
ta: ச்ட்ரீக் மீட்டமைக்கப்பட்டது

# pref_full_screen
source: Full screen
ta: முழுத்திரை

# pref_audio_output
source: Audio output
ta: ஆடியோ வெளியீடு

# pref_delay
source: Delay
ta: சுணக்கம்

# pref_interval
source: Interval duration
ta: இடைவெளி காலம்

# pref_interval_count
source: Interval count
ta: இடைவெளி எண்ணிக்கை

# pref_autosignin_summary
source: Connect to MediNET when opened
ta: திறக்கும் போது MediNET உடன் இணைக்கவும்

# pref_autosignin
source: Automatically connect
ta: தானாக இணைக்கவும்

# pref_autosave
source: Autosave
ta: தானிசேமி

# pref_rememberme_summary
source: Remain signed in after closed
ta: மூடப்பட்ட பிறகும் உள்நுழைந்திருக்கவும்

# pref_rememberme
source: Remember me
ta: என்னை நினைவில் வையுங்கள்

# pref_sessionvolume
source: Volume
ta: தொகுதி

# pref_sessionvolume_summary
source: Previous volume will be restored once the session is complete.
ta: அமர்வு முடிந்ததும் முந்தைய தொகுதி மீட்டமைக்கப்படும்.

# pref_screencontrol
source: Screen
ta: திரை

# pref_showstreak
source: Display meditation streak
ta: தியான வரிசையைக் காட்டு

# pref_showstreak_summary
source: Number of consecutive days with at least one recorded session
ta: குறைந்தபட்சம் ஒரு பதிவு செய்யப்பட்ட அமர்வுடன் தொடர்ச்சியான நாட்களின் எண்ணிக்கை

source: Select sound
ta: ஒலியைத் தேர்ந்தெடுக்கவும்

# pref_meditation_sound_start
source: Start sound
ta: ஒலியைத் தொடங்கு

# pref_meditation_sound_interval
source: Interval sound
ta: இடைவெளி ஒலி

# pref_meditation_sound_finish
source: Complete sound
ta: முழுமையான ஒலி

# pref_meditation_sound_bell
source: Mindfulness bell sound
ta: நினைவாற்றல் மணி ஒலி

# pref_remembermessage
source: Remember last message
ta: கடைசி செய்தியை நினைவில் கொள்க

# pref_remembermessage_summary
source: Default to the previous message
ta: முந்தைய செய்திக்கு இயல்புநிலை

# pref_theme
source: Holographic theme
ta: ஆலோகிராபிக் கருப்பொருள்

# pref_theme_light
source: Light
ta: ஒளி

# pref_theme_lightdark
source: Light with dark action bar
ta: இருண்ட செயல் பட்டையுடன் ஒளி

# pref_theme_dark
source: Dark
ta: இருள்

# pref_theme_black
source: Black
ta: கருப்பு

source: Buddhism
ta: பௌத்தம்

# pref_widgetcolor
source: Widget color
ta: விட்செட் நிறம்

# pref_notification
source: Notification
ta: அறிவிப்பு

# pref_notification_summary
source: Shown during meditation while away from the main window
ta: முதன்மையான சாளரத்திலிருந்து விலகி தியானத்தின் போது காட்டப்பட்டது

# pref_usetimepicker
source: Alternative duration interface
ta: மாற்று கால இடைமுகம்

# pref_usetimepicker_summary
source: Use hour and minute sliders when changing duration
ta: நேரத்தை மாற்றும்போது மணிநேரம் மற்றும் நிமிட ச்லைடர்களைப் பயன்படுத்தவும்

# pref_askdismiss
source: Ask before discard
ta: நிராகரிப்பதற்கு முன் கேளுங்கள்

# pref_askdismiss_summary
source: Confirm before discarding a session
ta: அமர்வை நிராகரிப்பதற்கு முன் உறுதிப்படுத்தவும்

# pref_mainbuttons
source: Hide buttons
ta: பொத்தான்களை மறை

# pref_progresstab
source: Default tab
ta: இயல்புநிலை தாவல்

source: Export sessions
ta: ஏற்றுமதி அமர்வுகள்

# exportsessions_summary
source: Export CSV file
ta: காபிம கோப்பை ஏற்றுமதி செய்யவும்

source: Import sessions
ta: அமர்வுகளை இறக்குமதி செய்யவும்

# importsessions_summary
source: Import CSV file
ta: காபிம கோப்பை இறக்குமதி செய்யவும்

source: Download sessions
ta: அமர்வுகளைப் பதிவிறக்கவும்

# downloadsessions_summary
source: Download remote sessions
ta: தொலைநிலை அமர்வுகளைப் பதிவிறக்கவும்

# importsessions_in_progress
source: Importing sessions…
ta: அமர்வுகளை இறக்குமதி செய்கிறது…

# importsessions_complete
source: Found %1$d existing and %2$d new.
ta: ஏற்கனவே உள்ள %1$d மற்றும் புதிய %2$d கண்டறியப்பட்டது.

# importsessions_utc_or_local
source: Does this export have local or UTC dates and times? Exports saved since version 1.5.6 have UTC dates and times.
ta: இந்த ஏற்றுமதிக்கு உள்ளக அல்லது UTC தேதிகள் மற்றும் நேரங்கள் உள்ளதா? பதிப்பு 1.5.6 முதல் சேமிக்கப்பட்ட ஏற்றுமதிகள் UTC தேதிகள் மற்றும் நேரங்களைக் கொண்டுள்ளன.

source: Local
ta: உள்ளக

source: Upload sessions
ta: அமர்வுகளைப் பதிவேற்றவும்

# uploadsessions_summary
source: Upload local sessions
ta: உள்ளக அமர்வுகளைப் பதிவேற்றவும்

source: Miscellaneous
ta: மற்றவை

source: Timer position
ta: நேரங்குறிகருவி நிலை

source: Top
ta: மேலே

source: Center
ta: நடுவண்

# pref_text_size
source: Timer size
ta: நேரங்குறிகருவி அளவு

source: Tiny
ta: சிறியது

source: Small
ta: சிறியது

source: Normal
ta: இயல்பானது

source: Large
ta: பெரியது

source: Extra-large
ta: மிக பெரியது

source: Alarm
ta: அலாரம்

source: Media
ta: ஊடகம்

source: Ringtone
ta: ரிங்டோன்

source: Notification
ta: அறிவிப்பு

# restartApp
source: Restart application to apply new settings
ta: புதிய அமைப்புகளைப் பயன்படுத்த, பயன்பாட்டை மறுதொடக்கம் செய்யவும்

# pref_notificationcontrol
source: Ringtone and notifications
ta: ரிங்டோன் மற்றும் அறிவிப்புகள்

# pref_notificationcontrol_priority
source: Priority only
ta: முன்னுரிமை மட்டுமே

# pref_notificationcontrol_alarms
source: Alarms only
ta: அலாரங்கள் மட்டுமே

# pref_notificationcontrol_vibrate
source: Set to vibrate
ta: அதிர்வுறும் வகையில் அமைக்கவும்

# pref_daily_reminder
source: Daily reminder
ta: நாள்தோறும் நினைவூட்டல்

# pref_daily_reminder_title
source: Remind me
ta: எனக்கு நினைவூட்டு

# pref_daily_reminder_summary
source: Display a notification when no sessions were recorded today
ta: இன்று எந்த அமர்வுகளும் பதிவு செய்யப்படாதபோது அறிவிப்பைக் காண்பி

# pref_daily_reminder_time
source: Time
ta: நேரம்

# pref_daily_reminder_text
source: Encouragement text
ta: ஊக்க உரை

source: Downloading sessions…
ta: அமர்வுகளைப் பதிவிறக்குகிறது…

source: Uploading sessions…
ta: அமர்வுகளைப் பதிவேற்றுகிறது…

source: MediNET
ta: மெடிநெட்

# unableToConnect
source: Unable to connect to MediNET
ta: MediNET உடன் இணைக்க முடியவில்லை

source: Dismiss
ta: நிராகரி

source: Discard
ta: நிராகரி

source: Save
ta: சேமி

source: Post
ta: இடுகை

source: Download
ta: பதிவிறக்கம்

# downloadSessionsHint
source: Click Download sessions in settings to retrieve missing sessions.
ta: விடுபட்ட அமர்வுகளை மீட்டெடுக்க அமைப்புகளில் உள்ள அமர்வுகளைப் பதிவிறக்கு என்பதைக் சொடுக்கு செய்யவும்.

# downloadsessionstitle
source: Download sessions?
ta: அமர்வுகளைப் பதிவிறக்கவா?

# downloadsessionsmessage
source: Previous sessions will be downloaded. This dialog will not appear again. You can download sessions later from the Settings window.
ta: முந்தைய அமர்வுகள் பதிவிறக்கம் செய்யப்படும். இந்த உரையாடல் மீண்டும் தோன்றாது. நீங்கள் அமர்வுகளை பின்னர் அமைப்புகள் சாளரத்தில் இருந்து பதிவிறக்கம் செய்யலாம்.

# wordimport
source: Import
ta: இறக்குமதி

# sessionDeletedMediNET
source: Session deleted on MediNET
ta: MediNET இல் அமர்வு நீக்கப்பட்டது

# sessionNotFoundMediNET
source: Session not found on MediNET
ta: MediNET இல் அமர்வு காணப்படவில்லை

# numtimes
source: %s time
ta: %s நேரம்

# sessionsDownloaded
source: Downloaded %s session
ta: %s அமர்வு பதிவிறக்கப்பட்டது

# sessionsUploaded
source: Uploaded %s session
ta: %s அமர்வு பதிவேற்றப்பட்டது

# sessionsUpToDate
source: Local data is up to date
ta: உள்ளக தரவு புதுப்பித்த நிலையில் உள்ளது

# daysOfMeditationMinimal
source: %d day
ta: %d நாள்

# daysOfMeditation
source: %d day of meditation
ta: %d நாள் தியானம்

# daysOfMeditationWithoutCount
source: day of meditation
ta: தியானத்தின் நாள்

source: Meditate today
ta: இன்று தியானியுங்கள்

source: Sign in to MediNET
ta: MediNET இல் உள்நுழையவும்

source: Sign out
ta: விடுபதிகை

source: Sign out of MediNET
ta: MediNET இலிருந்து வெளியேறவும்

# signOutOfMediNETConfirmTitle
source: Sign out of MediNET?
ta: MediNET இலிருந்து வெளியேறவா?

source: Rate Meditation Assistant
ta: தியான உதவியாளரை மதிப்பிடுங்கள்

# rateMeditationAssistantText
source: If you have found this application beneficial to your meditation practice, would you please add a rating? This dialog will not appear again.
ta: உங்கள் தியானப் பயிற்சிக்கு இந்தப் பயன்பாடு பயனுள்ளதாக இருந்தால், மதிப்பீட்டைச் சேர்ப்பீர்களா? இந்த உரையாடல் மீண்டும் தோன்றாது.

# translateMeditationAssistantText
source: Are you interested in assisting with translating Meditation Assistant?
ta: தியான உதவியாளரை மொழிபெயர்ப்பதில் உதவ ஆர்வமாக உள்ளீர்களா?

# widgetpreset1x1
source: Preset 1x1
ta: முன்னமைவு 1x1

# widgetpreset2x1
source: Preset 2x1
ta: முன்னமைவு 2x1

# widgetpreset3x1
source: Preset 3x1
ta: முன்னமைவு 3x1

# widgetstreak1x1
source: Streak 1x1
ta: ச்ட்ரீக் 1x1

# widgetstreak2x1
source: Streak 2x1
ta: ச்ட்ரீக் 2x1

# widgetstreak3x1
source: Streak 3x1
ta: ச்ட்ரீக் 3x1

# appStoreListingShort
source: Feature packed meditation session timer and recorder
ta: நிரம்பிய தியான அமர்வு நேரங்குறிகருவி மற்றும் ரெக்கார்டர்

# appStoreListingFull
source: - Automatic device mode while meditating. - Pauseable sessions. - Adjustable start/interval/end sounds, times, themes and device behaviour, and more. - Monthly progress overview. - Optionally post sessions to MediNET, and visit its forum. (Sharing progress of days with meditation motivates daily sessions, even for five or ten minutes.) Meditation Assistant is copylefted libre software. Do send in your problem/idea or fix: https://codeberg.org/tslocum/meditationassistant/issues Several features originated as user ideas. Translate Meditation Assistant: https://www.getlocalization.com/meditationassistant/ By Rocket Nine Laboratories: https://rocket9labs.com
ta: - தியானம் செய்யும் போது தானியங்கி சாதன முறை. - இடைநிறுத்தக்கூடிய அமர்வுகள். - சரிசெய்யக்கூடிய தொடக்க/இடைவெளி/முடிவு ஒலிகள், நேரங்கள், தீம்கள் மற்றும் சாதன நடத்தை மற்றும் பல. - மாதாந்திர முன்னேற்றக் கண்ணோட்டம். - விருப்பமாக MediNET இல் அமர்வுகளை இடுகையிடவும், அதன் மன்றத்தைப் பார்வையிடவும். (தியானத்துடன் நாட்களின் முன்னேற்றத்தைப் பகிர்ந்துகொள்வது நாள்தோறும் அமர்வுகளை ஐந்து அல்லது பத்து நிமிடங்கள் கூட ஊக்குவிக்கிறது.) தியான உதவியாளர் காப்பிலெஃப்ட் செய்யப்பட்ட லிபர் மென்பொருளாகும். உங்கள் பிரச்சனை/யோசனையை அனுப்பவும் அல்லது சரிசெய்யவும்: https://codeberg.org/tslocum/meditationassistant/issues பல நற்பொருத்தங்கள் பயனர் யோசனைகளாக உருவானது. தியான உதவியாளரை மொழிபெயர்: https://www.getlocalization.com/meditationassistant/ ராக்கெட் ஒன்பது ஆய்வகங்கள் மூலம்: https://rocket9labs.com
