Repository: 247i/TACETr
Catalog: உரை/தானி/meld.main.*.po
Languages: ta

source: Pattern
ta: முறை

source: Add new filter
ta: புதிய வடிகட்டியைச் சேர்க்கவும்

source: _Add
ta: _கூட்டு

source: Remove selected filter
ta: தேர்ந்தெடுக்கப்பட்ட வடிகட்டியை அகற்று

source: _Match case
ta: _ மேட்ச் கேச்

source: Who_le word
ta: who_le சொல்

source: Regular e_xpression
ta: வழக்கமான வெளிப்பாடு

source: Wrapped
ta: மூடப்பட்டிருக்கும்

source: Replace _All
ta: அனைத்தையும் மாற்று

source: _Replace
ta: மறுசீரமைப்பு (_r)

source: Switch between Find and Find-and-Replace
ta: கண்டுபிடிப்பு மற்றும் கண்டுபிடிப்பு மற்றும் மாற்றங்களுக்கு இடையில் மாறவும்

source: Search highlight mode…
ta: சிறப்பம்சமாக பயன்முறையைத் தேடுங்கள்…

source: New comparison
ta: புதிய ஒப்பீடு

source: File
ta: கோப்பு

source: Folder
ta: கோப்புறை

source: Version control
ta: பதிப்பு கட்டுப்பாடு

source: _3-way comparison
ta: _3-வழி ஒப்பீடு

source: Select First File
ta: முதல் கோப்பைத் தேர்ந்தெடுக்கவும்

source: Select Second File
ta: இரண்டாவது கோப்பைத் தேர்ந்தெடுக்கவும்

source: Select Third File
ta: மூன்றாவது கோப்பைத் தேர்ந்தெடுக்கவும்

source: Select First Folder
ta: முதல் கோப்புறையைத் தேர்ந்தெடுக்கவும்

source: Select Second Folder
ta: இரண்டாவது கோப்புறையைத் தேர்ந்தெடுக்கவும்

source: Select Third Folder
ta: மூன்றாவது கோப்புறையைத் தேர்ந்தெடுக்கவும்

source: Select A Version-Controlled Folder
ta: பதிப்பு கட்டுப்படுத்தப்பட்ட கோப்புறையைத் தேர்ந்தெடுக்கவும்

source: _Blank comparison
ta: _ பிளாங்க் ஒப்பீடு

source: Close Tab
ta: தாவலை மூடு

source: Format as Patch
ta: ஒட்டு என வடிவம்

source: Copy to Clipboard
ta: கிளிப்போர்டுக்கு நகலெடுக்கவும்

source: Save Patch
ta: ஒட்டு சேமிக்கவும்

source: Use differences between:
ta: இடையே வேறுபாடுகளைப் பயன்படுத்துங்கள்:

source: Left and middle panes
ta: இடது மற்றும் நடுத்தர பேன்கள்

source: Middle and right panes
ta: நடுத்தர மற்றும் வலது பேன்கள்

source: _Reverse patch direction
ta: தலைகீழ் பாதை திசை

source: Path
ta: பாதை

source: Copy Path
ta: நகல் பாதை

source: Copy the full path
ta: முழு பாதையையும் நகலெடுக்கவும்

source: View the folder in file manager
ta: கோப்பு மேலாளரில் கோப்புறையைக் காண்க

source: Preferences
ta: விருப்பத்தேர்வுகள்

source: Font
ta: எழுத்துரு

source: _Use the system fixed width font
ta: கணினி நிலையான அகல எழுத்துருவைப் பயன்படுத்தவும்

source: _Editor font:
ta: _editor எழுத்துரு:

source: Display
ta: காட்சி

source: _Tab width:
ta: _டாப் அகலம்:

source: _Insert spaces instead of tabs
ta: தாவல்களுக்கு பதிலாக இடைவெளிகளைச் செருகவும்

source: Enable text _wrapping
ta: உரை மடக்குதலை இயக்கவும்

source: Do not _split words over two lines
ta: இரண்டு வரிகளுக்கு மேல் சொற்களைத் தூண்ட வேண்டாம்

source: Highlight _current line
ta: தற்போதைய வரியை முன்னிலைப்படுத்தவும்

source: Show _line numbers
ta: வரி எண்களைக் காட்டு (_l)

source: Show w_hitespace
ta: வைட்ச்பேசைக் காட்டு

source: Prefer dark theme
ta: இருண்ட கருப்பொருளை விரும்புங்கள்

source: Use s_yntax highlighting
ta: தொடரியல் சிறப்பம்சத்தைப் பயன்படுத்தவும்

source: Syntax highlighting color scheme:
ta: வண்ணத் திட்டத்தை சிறப்பிக்கும் தொடரியல்:

source: Code Overview
ta: குறியீடு கண்ணோட்டம்

source: Show overview map
ta: கண்ணோட்டம் வரைபடத்தைக் காட்டு

source: Overview map style:
ta: கண்ணோட்டம் வரைபட நடை:

source: External Editor
ta: வெளி ஆசிரியர்

source: Use _default system editor
ta: _default கணினி எடிட்டரைப் பயன்படுத்தவும்

source: Edito_r command:
ta: itito_r கட்டளை:

source: Editor
ta: திருத்தி

source: Shallow Comparison
ta: ஆழமற்ற ஒப்பீடு

source: C_ompare files based only on size and timestamp
ta: அளவு மற்றும் நேர முத்திரையின் அடிப்படையில் மட்டுமே கோப்புகளை ஒப்பிடுக

source: _Timestamp resolution:
ta: _timestamp தீர்மானம்:

source: Note: enabling text filters may make comparing large files much slower
ta: குறிப்பு: உரை வடிப்பான்களை இயக்குவது பெரிய கோப்புகளை மிகவும் மெதுவாக ஒப்பிட்டுப் பார்க்கக்கூடும்

source: Symbolic Links
ta: குறியீட்டு இணைப்புகள்

source: Visible Columns
ta: தெரியும் நெடுவரிசைகள்

source: Folder Comparisons
ta: கோப்புறை ஒப்பீடுகள்

source: Version Comparisons
ta: பதிப்பு ஒப்பீடுகள்

source: _Order when comparing file revisions:
ta: கோப்பு திருத்தங்களை ஒப்பிடும்போது _ ஆர்டர்:

source: Order when _merging files:
ta: கோப்புகளை உருவாக்கும்போது ஆர்டர் செய்யுங்கள்:

source: Commit Messages
ta: செய்திகளைச் செய்யுங்கள்

source: Show _right margin at:
ta: சரியான விளிம்பைக் காட்டு:

source: Automatically _break lines at right margin on commit
ta: தானாகவே _ கமிட்டில் சரியான வித்தியாசத்தில் கோடுகள்

source: Version Control
ta: பதிப்பு கட்டுப்பாடு

source: Filename filters
ta: கோப்பு பெயர் வடிப்பான்கள்

source: When performing directory comparisons, you may filter out files and directories by name. Each pattern is a list of shell style wildcards separated by spaces.
ta: அடைவு ஒப்பீடுகளைச் செய்யும்போது, கோப்புகளையும் கோப்பகங்களையும் பெயரால் வடிகட்டலாம். ஒவ்வொரு வடிவமும் இடைவெளிகளால் பிரிக்கப்பட்ட செல் பாணி வைல்டு கார்டுகளின் பட்டியல்.

source: Change trimming
ta: டிரிம்மிங்கை மாற்றவும்

source: Trim blank line differences from the start and end of changes
ta: மாற்றங்களின் தொடக்க மற்றும் முடிவில் இருந்து வெற்று வரி வேறுபாடுகளை ஒழுங்கமைக்கவும்

source: Text filters
ta: உரை வடிப்பான்கள்

source: When performing file comparisons, you may ignore certain types of changes. Each pattern here is a python regular expression which replaces matching text with the empty string before comparison is performed. If the expression contains groups, only the groups are replaced. See the user manual for more details.
ta: கோப்பு ஒப்பீடுகளைச் செய்யும்போது, சில வகையான மாற்றங்களை நீங்கள் புறக்கணிக்கலாம். இங்கே ஒவ்வொரு வடிவமும் ஒரு பைதான் வழக்கமான வெளிப்பாடாகும், இது ஒப்பீடு செய்யப்படுவதற்கு முன்பு பொருந்தக்கூடிய உரையை வெற்று சரத்துடன் மாற்றுகிறது. வெளிப்பாட்டில் குழுக்கள் இருந்தால், குழுக்கள் மட்டுமே மாற்றப்படுகின்றன. மேலும் விவரங்களுக்கு பயனர் கையேட்டைப் பார்க்கவும்.

source: Left is remote, right is local
ta: இடது தொலைதூரமானது, வலது உள்ளக

source: Left is local, right is remote
ta: இடது உள்ளக, வலது தொலைதூரமானது

source: Simple change map
ta: எளிய மாற்ற வரைபடம்

source: Compact source map
ta: சிறிய மூல வரைபடம்

source: Full source map
ta: முழு மூல வரைபடம்

source: Remote, merge, local
ta: தொலைநிலை, ஒன்றிணைத்தல், உள்ளக

source: Local, merge, remote
ta: உள்ளக, ஒன்றிணைத்தல், தொலைநிலை

source: Ignore timestamp
ta: நேர முத்திரையை புறக்கணிக்கவும்

source: Push local commits to remote?
ta: உள்ளக கமிட்டுகளை தொலைதூரத்திற்கு தள்ளவா?

source: The commits to be pushed are determined by your version control system.
ta: தள்ளப்பட வேண்டிய கமிட்டுகள் உங்கள் பதிப்பு கட்டுப்பாட்டு அமைப்பால் தீர்மானிக்கப்படுகின்றன.

source: _Push commits
ta: _ பச் கம்யூச்

source: Search recent comparisons…
ta: அண்மைக் கால ஒப்பீடுகளைத் தேடுங்கள்…

source: Discard unsaved changes to documents?
ta: ஆவணங்களில் சேமிக்கப்படாத மாற்றங்களை நிராகரிக்கவா?

source: Changes made to the following documents will be permanently lost:
ta: பின்வரும் ஆவணங்களில் செய்யப்பட்ட மாற்றங்கள் நிரந்தரமாக இழக்கப்படும்:

source: _Discard
ta: _ டிச்கார்ட்

source: Save changes to documents before closing?
ta: மூடுவதற்கு முன் ஆவணங்களில் மாற்றங்களைச் சேமிக்கவா?

source: If you don’t save, changes will be permanently lost.
ta: நீங்கள் சேமிக்கவில்லை என்றால், மாற்றங்கள் நிரந்தரமாக இழக்கப்படும்.

source: Close _without Saving
ta: சேமிக்காமல் மூடு

source: _Save
ta: _சேவ்

source: Show whitespace
ta: வைட்ச்பேசைக் காட்டு

source: Text wrapping
ta: உரை மடக்குதல்

source: _Compare
ta: _ கூட்டு

source: Re_vert
ta: மீண்டும்

source: Delete
ta: அழி

source: Resolve Conflict
ta: மோதலைத் தீர்க்கவும்

source: Commit changes to version control
ta: பதிப்பு கட்டுப்பாட்டில் மாற்றங்களைச் செய்யுங்கள்

source: Commit…
ta: கமிட்…

source: Pull remote changes to the local repository
ta: உள்ளக களஞ்சியத்தில் தொலை மாற்றங்களை இழுக்கவும்

source: Push local changes to remote
ta: உள்ளக மாற்றங்களை தொலைதூரத்திற்கு தள்ளுங்கள்

source: Add to version control
ta: பதிப்பு கட்டுப்பாட்டுக்குச் சேர்க்கவும்

source: Remove from version control
ta: பதிப்பு கட்டுப்பாட்டிலிருந்து அகற்று

source: Revert working copy to original state
ta: வேலை நகலை அசல் நிலைக்கு மாற்றவும்

source: Mark as resolved in version control
ta: பதிப்பு கட்டுப்பாட்டில் தீர்க்கப்பட்டதைக் குறிக்கவும்

source: Open version controlled folder in this pane
ta: இந்த பலகத்தில் பதிப்பு கட்டுப்படுத்தப்பட்ட கோப்புறையைத் திறந்தது

source: Location
ta: இடம்

source: Status
ta: நிலை

source: Extra
ta: கூடுதல்

source: Console output
ta: ஆறுதல் வெளியீடு

source: Copy _up
ta: நகலெடு _up

source: Copy _down
ta: நகலெடு _ பேரூர்

source: UNIX (LF)
ta: யுனிக்சு (எல்எஃப்)

source: DOS/Windows (CR-LF)
ta: டோச்/விண்டோச் (சிஆர்-எல்எஃப்)

source: Mac OS (CR)
ta: மேக் ஓஎச் (சிஆர்)

source: Size
ta: அளவு

source: Modification time
ta: மாற்றும் நேரம்

source: Modification time (ISO)
ta: மாற்றும் நேரம் (ஐஎச்ஓ)

source: Permissions
ta: அனுமதிகள்

source: {filename} (scanning…)
ta: {filename} (ச்கேனிங்…)

source: [{label}] Scanning {folder}
ta: [{label}] ச்கேனிங் {folder}

source: [{label}] Done
ta: [{label}] முடிந்தது

source: Folder {} is being compared to itself
ta: கோப்புறை {} தன்னுடன் ஒப்பிடப்படுகிறது

source: Folders have no differences
ta: கோப்புறைகளுக்கு வேறுபாடுகள் இல்லை

source: Contents of scanned files in folders are identical.
ta: கோப்புறைகளில் ச்கேன் செய்யப்பட்ட கோப்புகளின் உள்ளடக்கங்கள் ஒரே மாதிரியானவை.

source: Scanned files in folders appear identical, but contents have not been scanned.
ta: கோப்புறைகளில் ச்கேன் செய்யப்பட்ட கோப்புகள் ஒரே மாதிரியாகத் தோன்றுகின்றன, ஆனால் உள்ளடக்கங்கள் ச்கேன் செய்யப்படவில்லை.

source: File filters are in use, so not all files have been scanned.
ta: கோப்பு வடிப்பான்கள் பயன்பாட்டில் உள்ளன, எனவே எல்லா கோப்புகளும் ச்கேன் செய்யப்படவில்லை.

source: Text filters are in use and may be masking content differences.
ta: உரை வடிப்பான்கள் பயன்பாட்டில் உள்ளன மற்றும் உள்ளடக்க வேறுபாடுகளை மறைக்கக்கூடும்.

source: Hide
ta: மறை

source: Multiple errors occurred while scanning this folder
ta: இந்த கோப்புறையை ச்கேன் செய்யும் போது பல பிழைகள் ஏற்பட்டன

source: Files with invalid encodings found
ta: தவறான குறியாக்கங்களைக் கொண்ட கோப்புகள் காணப்படுகின்றன

source: Some files were in an incorrect encoding. The names are something like:
ta: சில கோப்புகள் தவறான குறியாக்கத்தில் இருந்தன. பெயர்கள் போன்றவை:

source: Files hidden by case insensitive comparison
ta: வழக்கு உணர்வற்ற ஒப்பீடு மூலம் மறைக்கப்பட்ட கோப்புகள்

source: You are running a case insensitive comparison on a case sensitive filesystem. The following files in this folder are hidden:
ta: ஒரு வழக்கு உணர்திறன் கோப்பு முறைமையில் ஒரு வழக்கை உணரமுடியாத ஒப்பீட்டை இயக்குகிறீர்கள். இந்த கோப்புறையில் பின்வரும் கோப்புகள் மறைக்கப்பட்டுள்ளன:

source: Files had mismatched leading or trailing whitespace
ta: கோப்புகள் பொருந்தாத முன்னணி அல்லது பின்தங்கிய இடைவெளியைக் கொண்டிருந்தன

source: This comparison found some files that differed only in leading or trailing whitespace. Their names appear as:
ta: இந்த ஒப்பீடு சில கோப்புகளைக் கண்டறிந்தது, அவை இடைவெளியை வழிநடத்துவதில் அல்லது பின்தங்கிய நிலையில் மட்டுமே வேறுபடுகின்றன. அவர்களின் பெயர்கள் இவ்வாறு தோன்றும்:

source: “{first_file}” hidden by “{second_file}”
ta: “{second_file}” ஆல் மறைக்கப்பட்ட “{first_file}”

source: Replace folder “%s”?
ta: “%s” கோப்புறையை மாற்றவா?

source: Another folder with the same name already exists in “%s”. If you replace the existing folder, all files in it will be lost.
ta: அதே பெயருடன் கூடிய மற்றொரு கோப்புறை ஏற்கனவே “%s” இல் உள்ளது. இருக்கும் கோப்புறையை நீங்கள் மாற்றினால், அதில் உள்ள அனைத்து கோப்புகளும் இழக்கப்படும்.

source: Error copying file
ta: கோப்பை நகலெடுப்பதில் பிழை

source: Couldn’t copy {source} to {dest}. {error}
ta: {மூலத்தை நகலெடுக்க முடியவில்லை to {source}. {dest}

source: Error deleting {}
ta: {} நீக்குவதில் பிழை

source: No folder
ta: கோப்புறை இல்லை

source: Folder comparison:
ta: கோப்புறை ஒப்பீடு:

source: Comparison results will be inaccurate
ta: ஒப்பீட்டு முடிவுகள் துல்லியமாக இருக்கும்

source: A filter changed the number of lines in the file, which is unsupported. The comparison will not be accurate.
ta: ஒரு வடிகட்டி கோப்பில் உள்ள வரிகளின் எண்ணிக்கையை மாற்றியது, இது ஆதரிக்கப்படவில்லை. ஒப்பீடு துல்லியமாக இருக்காது.

source: Mark conflict as resolved?
ta: மோதல் தீர்க்கப்பட்டதாகக் குறிக்கிறதா?

source: If the conflict was resolved successfully, you may mark it as resolved now.
ta: மோதல் வெற்றிகரமாக தீர்க்கப்பட்டால், நீங்கள் அதை இப்போது தீர்க்கப்பட்டதாகக் குறிக்கலாம்.

source: Cancel
ta: ரத்துசெய்

source: Mark _Resolved
ta: குறி _ தீர்வு

source: Add Synchronization Point
ta: ஒத்திசைவு புள்ளியைச் சேர்க்கவும்

source: Remove Synchronization Point
ta: ஒத்திசைவு புள்ளியை அகற்று

source: Move Synchronization Point
ta: ஒத்திசைவு புள்ளியை நகர்த்தவும்

source: Match Synchronization Point
ta: ஒத்திசைவு புள்ளி பொருந்தவும்

source: Clear Synchronization Points
ta: ஒத்திசைவு புள்ளிகளை அழிக்கவும்

source: File comparison:
ta: கோப்பு ஒப்பீடு:

source: There was a problem opening the file “%s”.
ta: “%s” கோப்பைத் திறப்பதில் சிக்கல் ஏற்பட்டது.

source: File %s appears to be a binary file.
ta: கோப்பு %s பைனரி கோப்பாகத் தோன்றுகின்றன.

source: Do you want to open the file using the default application?
ta: இயல்புநிலை பயன்பாட்டைப் பயன்படுத்தி கோப்பைத் திறக்க விரும்புகிறீர்களா?

source: Open
ta: திற

source: [%s] Merging files
ta: [%s] கோப்புகளை ஒன்றிணைத்தல்

source: [%s] Computing differences
ta: [%s] கணினி வேறுபாடுகள்

source: File %s has changed on disk
ta: கோப்பு %s வட்டில் மாறிவிட்டன

source: Do you want to reload the file?
ta: கோப்பை மீண்டும் ஏற்ற விரும்புகிறீர்களா?

source: _Reload
ta: மறுஏற்றம் (_r)

source: File {} is being compared to itself
ta: கோப்பு {the தன்னுடன் ஒப்பிடப்படுகிறது

source: Files are identical
ta: கோப்புகள் ஒரே மாதிரியானவை

source: Text filters are being used, and may be masking differences between files. Would you like to compare the unfiltered files?
ta: உரை வடிப்பான்கள் பயன்படுத்தப்படுகின்றன, மேலும் கோப்புகளுக்கு இடையிலான வேறுபாடுகளை மறைக்கும். வடிகட்டப்படாத கோப்புகளை ஒப்பிட விரும்புகிறீர்களா?

source: Files differ in line endings only
ta: கோப்புகள் வரி முடிவுகளில் மட்டுமே வேறுபடுகின்றன

source: Files are identical except for differing line endings: %s
ta: மாறுபட்ட வரி முடிவுகளைத் தவிர கோப்புகள் ஒரே மாதிரியானவை: %s

source: Show without filters
ta: வடிப்பான்கள் இல்லாமல் காட்டு

source: Change highlighting incomplete
ta: சிறப்பம்சமாக சிறப்பம்சமாக மாற்றவும்

source: Some changes were not highlighted because they were too large. You can force Meld to take longer to highlight larger changes, though this may be slow.
ta: சில மாற்றங்கள் மிகப் பெரியவை என்பதால் அவை முன்னிலைப்படுத்தப்படவில்லை. இது மெதுவாக இருக்கலாம் என்றாலும், பெரிய மாற்றங்களை முன்னிலைப்படுத்த அதிக நேரம் எடுக்க மெல்டை கட்டாயப்படுத்தலாம்.

source: Keep highlighting
ta: சிறப்பம்சமாக

source: _Keep highlighting
ta: _ கீப் சிறப்பம்சமாக

source: Saving failed
ta: சேமிப்பு தோல்வியடைந்தது

source: Please consider copying any critical changes to another program or file to avoid data loss.
ta: தரவு இழப்பைத் தவிர்க்க மற்றொரு நிரல் அல்லது கோப்பில் ஏதேனும் முக்கியமான மாற்றங்களை நகலெடுப்பதைக் கவனியுங்கள்.

source: Save Left Pane As
ta: இடது பலகத்தை சேமிக்கவும்

source: Save Middle Pane As
ta: நடுத்தர பலகத்தை சேமிக்கவும்

source: Save Right Pane As
ta: வலது பலகத்தை சேமிக்கவும்

source: File %s has changed on disk since it was opened
ta: கோப்பு %திறந்ததிலிருந்து வட்டில் மாறிவிட்டது

source: If you save it, any external changes will be lost.
ta: நீங்கள் அதை சேமித்தால், எந்த வெளிப்புற மாற்றங்களும் இழக்கப்படும்.

source: Save Anyway
ta: எப்படியும் சேமிக்கவும்

source: Don’t Save
ta: சேமிக்க வேண்டாம்

source: File “{}” contains characters that can’t be encoded using its current encoding “{}”.
ta: “{}” கோப்பில் அதன் தற்போதைய குறியாக்கம் “{}” ஐப் பயன்படுத்தி குறியாக்கம் செய்ய முடியாத எழுத்துக்கள் உள்ளன.

source: Couldn’t save file due to: %s
ta: இதன் காரணமாக கோப்பைச் சேமிக்க முடியவில்லை: %s

source: Could not save file %s.
ta: கோப்பு %s ஐ சேமிக்க முடியவில்லை.

source: Live comparison updating disabled
ta: நேரடி ஒப்பீடு புதுப்பித்தல் முடக்கப்பட்டது

source: Live updating of comparisons is disabled when synchronization points are active. You can still manually refresh the comparison, and live updates will resume when synchronization points are cleared.
ta: ஒத்திசைவு புள்ளிகள் செயலில் இருக்கும்போது ஒப்பீடுகளின் நேரடி புதுப்பித்தல் முடக்கப்படுகிறது. ஒப்பீட்டை நீங்கள் இன்னும் கைமுறையாக புதுப்பிக்க முடியும், மேலும் ஒத்திசைவு புள்ளிகள் அழிக்கப்படும் போது நேரடி புதுப்பிப்புகள் மீண்டும் தொடங்கும்.

source: Can't swap unsaved files
ta: சேமிக்கப்படாத கோப்புகளை இடமாற்றம் செய்ய முடியாது

source: Files must be saved to disk before swapping panes.
ta: பேன்களை மாற்றுவதற்கு முன் கோப்புகளை வட்டில் சேமிக்க வேண்டும்.

source: Can't swap version control comparisons
ta: பதிப்பு கட்டுப்பாட்டு ஒப்பீடுகளை மாற்ற முடியாது

source: Swapping panes is not supported in version control mode.
ta: பதிப்பு கட்டுப்பாட்டு பயன்முறையில் இடமாற்றம் பேன்களை ஆதரிக்கவில்லை.

source: Deleting remote folders is not supported
ta: தொலை கோப்புறைகளை நீக்குவது ஆதரிக்கப்படவில்லை

source: Not a file or directory
ta: ஒரு கோப்பு அல்லது அடைவு அல்ல

source: “{}” can’t be put in the trash. Do you want to delete it immediately?
ta: “{}” குப்பையில் வைக்க முடியாது. உடனடியாக அதை நீக்க விரும்புகிறீர்களா?

source: This remote location does not support sending items to the trash.
ta: இந்த தொலைநிலை இருப்பிடம் குப்பைக்கு பொருட்களை அனுப்புவதை ஆதரிக்காது.

source: _Delete Permanently
ta: _ நிரந்தரமாக

source: Replace file “%s”?
ta: “%s” கோப்பை மாற்றவா?

source: A file with this name already exists in “%s”. If you replace the existing file, its contents will be lost.
ta: இந்த பெயரைக் கொண்ட ஒரு கோப்பு ஏற்கனவே “%s” இல் உள்ளது. தற்போதுள்ள கோப்பை மாற்றினால், அதன் உள்ளடக்கங்கள் இழக்கப்படும்.

source: wrong number of arguments supplied to --diff
ta: தவறான வாதங்களின் எண்ணிக்கை

source: Start with an empty window
ta: வெற்று சாளரத்துடன் தொடங்கவும்

source: file
ta: கோப்பு

source: folder
ta: கோப்புறை

source: Start a version control comparison
ta: பதிப்பு கட்டுப்பாட்டு ஒப்பீட்டைத் தொடங்கவும்

source: Start a 2- or 3-way file comparison
ta: 2- அல்லது 3-வழி கோப்பு ஒப்பீட்டைத் தொடங்கவும்

source: Start a 2- or 3-way folder comparison
ta: 2- அல்லது 3-வழி கோப்புறை ஒப்பீட்டைத் தொடங்கவும்

source: For file comparisons, the special argument @blank may be used instead of a <file> argument to create a blank pane.
ta: கோப்பு ஒப்பீடுகளுக்கு, அதற்கு பதிலாக சிறப்பு உரையாடல் @blank பயன்படுத்தப்படலாம் ஒரு வெற்று பலகத்தை உருவாக்க ஒரு <கோப்பு> உரையாடல்.

source: Error: %s
ta: பிழை: %s

source: Meld is a file and directory comparison tool.
ta: மெல்ட் ஒரு கோப்பு மற்றும் அடைவு ஒப்பீட்டு கருவி.

source: Set label to use instead of file name
ta: கோப்பு பெயருக்கு பதிலாக பயன்படுத்த லேபிளை அமைக்கவும்

source: Open a new tab in an already running instance
ta: ஏற்கனவே இயங்கும் நிகழ்வில் புதிய தாவலைத் திறக்கவும்

source: Automatically compare all differing files on startup
ta: தொடக்கத்தில் உள்ள அனைத்து மாறுபட்ட கோப்புகளையும் தானாக ஒப்பிடுங்கள்

source: Ignored for compatibility
ta: பொருந்தக்கூடிய தன்மைக்கு புறக்கணிக்கப்படுகிறது

source: Set the target file for saving a merge result
ta: ஒன்றிணைக்கும் முடிவைச் சேமிக்க இலக்கு கோப்பை அமைக்கவும்

source: Automatically merge files
ta: கோப்புகளை தானாக ஒன்றிணைக்கவும்

source: Load a saved comparison from a Meld comparison file
ta: ஒரு மெல்ட் ஒப்பீட்டு கோப்பிலிருந்து சேமித்த ஒப்பீட்டை ஏற்றவும்

source: Create a diff tab for the supplied files or folders
ta: வழங்கப்பட்ட கோப்புகள் அல்லது கோப்புறைகளுக்கான வேறுபாடு தாவலை உருவாக்கவும்

source: too many arguments (wanted 0-3, got %d)
ta: பல வாதங்கள் (0-3 தேவை, கிடைத்தது %d)

source: can’t auto-merge less than 3 files
ta: 3 கோப்புகளுக்கு குறைவாக தானாக தயாரிக்க முடியாது

source: can’t auto-merge directories
ta: தானாக கழித்து கோப்பகங்கள் முடியாது

source: Error reading saved comparison file
ta: சேமித்த ஒப்பீட்டு கோப்பை வாசிப்பது பிழை

source: invalid path or URI “%s”
ta: தவறான பாதை அல்லது யூரி “%s”

source: remote folder “{}” not supported
ta: தொலைநிலை கோப்புறை “{}” ஆதரிக்கப்படவில்லை

source: <unnamed>
ta: <பெயரிடப்படாதது>

source: untitled
ta: தலைப்பிடப்படாத

source: Filename
ta: கோப்புப்பெயர்

source: Need three files to auto-merge, got: %r
ta: தானாக இயந்திரத்திற்கு மூன்று கோப்புகள் தேவை, கிடைத்தது: %r

source: Cannot compare a mixture of files and directories
ta: கோப்புகள் மற்றும் கோப்பகங்களின் கலவையை ஒப்பிட முடியாது

source: {} Meld encountered a critical error while running: <tt>{}</tt>
ta: {} இயங்கும் போது மெல்ட் ஒரு முக்கியமான பிழையை சந்தித்தார்: <tt> {} </tt>

source: [None]
ta: [எதுவுமில்லை]

source: label
ta: சிட்டை

source: pattern
ta: முறை

source: Version control:
ta: பதிப்பு கட்டுப்பாடு:

source: Couldn’t find color scheme details for {}; this is a bad install
ta: {for க்கான வண்ணத் திட்ட விவரங்களை கண்டுபிடிக்க முடியவில்லை; இது ஒரு மோசமான நிறுவல்

source: Plain Text
ta: சாதாரண எழுத்து

source: Unnamed file
ta: பெயரிடப்படாத கோப்பு

source: Line you want to move the cursor to
ta: நீங்கள் கர்சரை நகர்த்த விரும்பும் வரி

source: No files will be committed
ta: கோப்புகள் எதுவும் செய்யப்படாது

source: {unpushed_commits} in {unpushed_branches}
ta: {unpushed_commits} {unpushed_branches}

source: %d unpushed commit
ta: %d unusted commit

source: %d branch
ta: %d கிளை

source: Mode changed from {old_mode} to {new_mode}
ta: பயன்முறை {old_mode} இலிருந்து {new_mode} ஆக மாற்றப்பட்டது

source: Partially staged
ta: ஓரளவு அரங்கேற்றப்பட்டது

source: Staged
ta: அரங்கேற்றப்பட்டது

source: None
ta: எதுவுமில்லை

source: Rev %s
ta: ரெவ் %s

source: Merged
ta: ஒன்றிணைந்தது

source: Base
ta: காரம்

source: Local
ta: உள்ளக

source: Remote
ta: தொலைநிலை

source: Error
ta: பிழை

source: Newly added
ta: புதிதாக சேர்க்கப்பட்டது

source: Renamed
ta: மறுபெயரிடப்பட்டது

source: Conflict
ta: மோதல்

source: Removed
ta: அகற்றப்பட்டது

source: Missing
ta: இல்லை

source: Not present
ta: இல்லை

source: Scanning…
ta: ச்கேனிங்…

source: %(name)s (not found)
ta: %(name)s (காணப்படவில்லை)

source: %(name)s (%(cmd)s not installed)
ta: %(name)s (%(cmd)s நிறுவப்படவில்லை)

source: %(name)s (invalid repository)
ta: %(name)s (தவறான களஞ்சியம்)

source: No valid version control system found in this folder
ta: இந்த கோப்புறையில் செல்லுபடியாகும் பதிப்பு கட்டுப்பாட்டு அமைப்பு இல்லை

source: Choose which version control system to use
ta: எந்த பதிப்பு கட்டுப்பாட்டு அமைப்பைப் பயன்படுத்த வேண்டும் என்பதைத் தேர்வுசெய்க

source: {vc} comparison:
ta: {vc} ஒப்பீடு:

source: Scanning repository
ta: களஞ்சியத்தை ச்கேன் செய்தல்

source: Scanning %s
ta: ச்கேனிங் %s

source: (Empty)
ta: (காலியாக)

source: %s — local
ta: %s - உள்ளக

source: %s — remote
ta: %s - தொலைநிலை

source: %s (local, merge, remote)
ta: %s (உள்ளூர், ஒன்றிணைத்தல், தொலைநிலை)

source: %s (remote, merge, local)
ta: %s (தொலைநிலை, ஒன்றிணைத்தல், உள்ளூர்)

source: %s — repository
ta: %s - களஞ்சியம்

source: %s (working, repository)
ta: %s (வேலை, களஞ்சியம்)

source: %s (repository, working)
ta: %s (களஞ்சியம், வேலை)

source: Remove folder and all its files?
ta: கோப்புறை மற்றும் அதன் அனைத்து கோப்புகளையும் அகற்றவா?

source: This will remove all selected files and folders, and all files within any selected folders, from version control.
ta: இது தேர்ந்தெடுக்கப்பட்ட அனைத்து கோப்புகள் மற்றும் கோப்புறைகளையும், தேர்ந்தெடுக்கப்பட்ட கோப்புறைகளுக்குள் உள்ள அனைத்து கோப்புகளையும் பதிப்பு கட்டுப்பாட்டிலிருந்து அகற்றும்.

source: Clear
ta: தெளிவான
