Repository: 247i/TACETr
Catalog: உரை/தானி/meld.main.*.po
Languages: ta

source: Meld
ta: கூட்டு

source: Diff Viewer
ta: வேறுபட்ட பார்வையாளர்

source: Compare and merge your files
ta: உங்கள் கோப்புகளை ஒப்பிட்டு ஒன்றிணைக்கவும்

source: diff;merge;
ta: வேறுபாடு; ஒன்றிணைத்தல்;

source: Meld is a visual diff and merge tool targeted at developers. Meld helps you compare files, directories, and version controlled projects. It provides two- and three-way comparison of both files and directories, and supports many version control systems including Git, Mercurial, Bazaar and Subversion.
ta: மெல்ட் என்பது ஒரு காட்சி வேறுபாடு மற்றும் டெவலப்பர்களை இலக்காகக் கொண்ட ஒன்றிணைக்கும் கருவியாகும். கோப்புகள், கோப்பகங்கள் மற்றும் பதிப்பு கட்டுப்படுத்தப்பட்ட திட்டங்களை ஒப்பிட்டுப் பார்க்க மெல்ட் உங்களுக்கு உதவுகிறது. இது கோப்புகள் மற்றும் கோப்பகங்களின் இரண்டு மற்றும் மூன்று வழி ஒப்பீட்டை வழங்குகிறது, மேலும் அறிவிலி, மெர்குரியல், கடைவீதி மற்றும் சப்வர்சன் உள்ளிட்ட பல பதிப்பு கட்டுப்பாட்டு அமைப்புகளை ஆதரிக்கிறது.

source: Meld helps you review code changes, understand patches, and makes enormous merge conflicts slightly less painful.
ta: குறியீடு மாற்றங்களை மறுபரிசீலனை செய்யவும், திட்டுகளைப் புரிந்துகொள்ளவும், மகத்தான ஒன்றிணைக்கும் மோதல்களை சற்று குறைவான வேதனையாக மாற்றவும் மெல்ட் உங்களுக்கு உதவுகிறது.

source: Kai Willadsen
ta: கை வில்லட்சன்

source: Meld comparison description
ta: ஒப்பீட்டு விளக்கத்தை இணைக்கவும்

source: Default window width
ta: இயல்புநிலை சாளர அகலம்

source: Default window height
ta: இயல்புநிலை சாளர உயரம்

source: Default window maximized state
ta: இயல்புநிலை சாளர அதிகபட்ச நிலை

source: Prefer application-wide dark theme
ta: பயன்பாட்டு-அளவிலான இருண்ட கருப்பொருள் ஆகியவற்றை விரும்புங்கள்

source: If true, the GTK dark theme variant will be used, if available. Note that this is separate from the syntax highlighting scheme.
ta: உண்மை என்றால், கிடைத்தால், சி.டி.கே டார்க் கருப்பொருள் மாறுபாடு பயன்படுத்தப்படும். இது தொடரியல் சிறப்பம்சமாக திட்டத்திலிருந்து தனித்தனியாக உள்ளது என்பதை நினைவில் கொள்க.

source: Additional automatically detected text encodings
ta: கூடுதல் தானாக கண்டறியப்பட்ட உரை குறியாக்கங்கள்

source: Meld will use these text encodings to try to decode loaded text files before trying any other encodings. In addition to the encodings in this list, UTF-8 and the current locale-default encoding will always be used; other encodings may also be tried, depending on the user’s locale.
ta: வேறு எந்த குறியாக்கங்களையும் முயற்சிக்கும் முன் ஏற்றப்பட்ட உரை கோப்புகளை டிகோட் செய்ய முயற்சிக்க மெல்ட் இந்த உரை குறியாக்கங்களைப் பயன்படுத்தும். இந்த பட்டியலில் உள்ள குறியாக்கங்களுக்கு கூடுதலாக, யுடிஎஃப் -8 மற்றும் தற்போதைய லோகேல்-டெஃபால்ட் குறியாக்கம் எப்போதும் பயன்படுத்தப்படும்; பயனரின் இருப்பிடத்தைப் பொறுத்து பிற குறியாக்கங்களும் முயற்சிக்கப்படலாம்.

source: Width of an indentation step
ta: உள்தள்ளல் படியின் அகலம்

source: The number of spaces to use for a single indent step
ta: ஒற்றை உள்தள்ளல் படிக்கு பயன்படுத்த வேண்டிய இடங்களின் எண்ணிக்கை

source: Whether to indent using spaces or tabs
ta: இடைவெளிகள் அல்லது தாவல்களைப் பயன்படுத்தி உள்தள்ள வேண்டுமா

source: If true, any new indentation will use spaces instead of tabs.
ta: உண்மை என்றால், எந்த புதிய உள்தள்ளலும் தாவல்களுக்கு பதிலாக இடைவெளிகளைப் பயன்படுத்தும்.

source: Show line numbers
ta: வரி எண்களைக் காட்டு

source: If true, line numbers will be shown in the gutter of file comparisons.
ta: உண்மை என்றால், கோப்பு ஒப்பீடுகளின் குழியில் வரி எண்கள் காண்பிக்கப்படும்.

source: Highlight syntax
ta: தொடரியல் முன்னிலைப்படுத்தவும்

source: Whether to highlight syntax in comparisons. Because of Meld’s own color highlighting, this is off by default.
ta: ஒப்பீடுகளில் தொடரியல் முன்னிலைப்படுத்த வேண்டுமா. மெல்டின் சொந்த வண்ண சிறப்பம்சத்தின் காரணமாக, இது இயல்பாகவே முடக்கப்பட்டுள்ளது.

source: Color scheme to use for syntax highlighting
ta: தொடரியல் சிறப்பம்சத்திற்கு பயன்படுத்த வண்ணத் திட்டம்

source: Used by GtkSourceView to determine colors for syntax highlighting
ta: தொடரியல் சிறப்பம்சத்திற்கான வண்ணங்களைத் தீர்மானிக்க gtksourceview ஆல் பயன்படுத்தப்படுகிறது

source: Draw whitespace
ta: வைட்ச்பேசை வரையவும்

source: If true, whitespace characters will be drawn in comparisons even if they are not in a changed area.
ta: உண்மை என்றால், மாற்றப்பட்ட பகுதியில் இல்லாவிட்டாலும் ஒப்பீடுகளில் வைட்ச்பேச் எழுத்துக்கள் வரையப்படும்.

source: Wrap mode
ta: மடக்கு பயன்முறை

source: Lines in file comparisons will be wrapped according to this setting, either not at all ('none'), at any character ('char') or only at the end of words ('word').
ta: கோப்பு ஒப்பீடுகளில் உள்ள கோடுகள் இந்த அமைப்பின் படி மூடப்பட்டிருக்கும், அவை இல்லை ('எதுவுமில்லை'), எந்தவொரு கதாபாத்திரத்திலும் ('கரி') அல்லது சொற்களின் முடிவில் ('சொல்') மட்டுமே.

source: Highlight current line
ta: தற்போதைய வரியை முன்னிலைப்படுத்தவும்

source: If true, the line containing the cursor will be highlighted in file comparisons.
ta: உண்மை என்றால், கர்சரைக் கொண்ட வரி கோப்பு ஒப்பீடுகளில் முன்னிலைப்படுத்தப்படும்.

source: Use the system default monospace font
ta: கணினி இயல்புநிலை மோனோச்பேச் எழுத்துருவைப் பயன்படுத்தவும்

source: If false, custom-font will be used instead of the system monospace font.
ta: தவறு என்றால், கணினி மோனோச்பேச் எழுத்துருவுக்கு பதிலாக தனிப்பயன்-எழுத்து பயன்படுத்தப்படும்.

source: Custom font
ta: தனிப்பயன் எழுத்துரு

source: The custom font to use, stored as a string and parsed as a Pango font description.
ta: பயன்படுத்த தனிப்பயன் எழுத்துரு, ஒரு சரமாக சேமிக்கப்பட்டு பாங்கோ எழுத்துரு விளக்கமாக பாகுபடுத்தப்படுகிறது.

source: Show overview source map
ta: கண்ணோட்டம் மூல வரைபடத்தைக் காட்டு

source: If true, file comparisons will have paired source maps for compared files.
ta: உண்மை என்றால், கோப்பு ஒப்பீடுகள் ஒப்பீட்டு கோப்புகளுக்கான மூல வரைபடங்களைக் கொண்டிருக்கும்.

source: Style of overview map
ta: கண்ணோட்டம் வரைபடத்தின் நடை

source: Style options for how the overview map is displayed.
ta: கண்ணோட்டம் வரைபடம் எவ்வாறு காட்டப்படும் என்பதற்கான பாணி விருப்பங்கள்.

source: Ignore blank lines when comparing files
ta: கோப்புகளை ஒப்பிடும் போது வெற்று வரிகளை புறக்கணிக்கவும்

source: If true, blank lines will be trimmed when highlighting changes between files.
ta: உண்மை என்றால், கோப்புகளுக்கு இடையிலான மாற்றங்களை முன்னிலைப்படுத்தும்போது வெற்று கோடுகள் ஒழுங்கமைக்கப்படும்.

source: Use the system default editor
ta: கணினி இயல்புநிலை எடிட்டரைப் பயன்படுத்தவும்

source: If false, custom-editor-command will be used instead of the system editor when opening files externally.
ta: பொய்யானது என்றால், வெளிப்புறமாக கோப்புகளைத் திறக்கும்போது கணினி எடிட்டருக்கு பதிலாக தனிப்பயன்-ஆசிரியர்-கட்டளை பயன்படுத்தப்படும்.

source: The custom editor launch command
ta: தனிப்பயன் எடிட்டர் வெளியீட்டு கட்டளை

source: The command used to launch a custom editor. Some limited templating is supported here; at the moment '{file}' and '{line}' are recognised tokens.
ta: தனிப்பயன் எடிட்டரைத் தொடங்க கட்டளை பயன்படுத்தப்படுகிறது. சில வரையறுக்கப்பட்ட வார்ப்புரு இங்கே ஆதரிக்கப்படுகிறது; இந்த நேரத்தில் '{file}' மற்றும் '{line}' ஆகியவை டோக்கன்கள் அங்கீகரிக்கப்பட்டுள்ளன.

source: Columns to display
ta: காண்பிக்க நெடுவரிசைகள்

source: List of column names in folder comparison and whether they should be displayed.
ta: கோப்புறை ஒப்பீட்டில் நெடுவரிசை பெயர்களின் பட்டியல் மற்றும் அவை காட்டப்பட வேண்டுமா.

source: Ignore symbolic links
ta: குறியீட்டு இணைப்புகளை புறக்கணிக்கவும்

source: If true, folder comparisons do not follow symbolic links when traversing the folder tree.
ta: உண்மை என்றால், கோப்புறை மரத்தை பயணிக்கும்போது கோப்புறை ஒப்பீடுகள் குறியீட்டு இணைப்புகளைப் பின்பற்றாது.

source: Use shallow comparison
ta: ஆழமற்ற ஒப்பீட்டைப் பயன்படுத்துங்கள்

source: If true, folder comparisons compare files based solely on size and mtime, considering files to be identical if their size and mtime match, and different otherwise.
ta: உண்மை என்றால், கோப்புறை ஒப்பீடுகள் அளவு மற்றும் mtime ஐ அடிப்படையாகக் கொண்ட கோப்புகளை ஒப்பிட்டுப் பார்க்கின்றன, கோப்புகள் அவற்றின் அளவு மற்றும் mtime பொருந்தினால் ஒரே மாதிரியாக இருக்க வேண்டும், இல்லையெனில் வேறுபட்டவை.

source: File timestamp resolution
ta: கோப்பு நேர முத்திரை தீர்மானம்

source: When comparing based on mtime, this is the minimum difference in nanoseconds between two files before they’re considered to have different mtimes. This is useful when comparing files between filesystems with different timestamp resolution.
ta: mtime ஐ அடிப்படையாகக் கொண்டு ஒப்பிடும்போது, வெவ்வேறு mtimes ஐக் கருதுவதற்கு முன்பு இரண்டு கோப்புகளுக்கு இடையில் நானோ விநாடிகளில் குறைந்தபட்ச வேறுபாடு இதுவாகும். கோப்பு முறைமைகளுக்கு இடையிலான கோப்புகளை வெவ்வேறு நேர முத்திரை தெளிவுத்திறனுடன் ஒப்பிடும்போது இது பயனுள்ளதாக இருக்கும்.

source: Apply text filters during folder comparisons
ta: கோப்புறை ஒப்பீட்டின் போது உரை வடிகட்டியைப் பயன்படுத்துங்கள்

source: If true, folder comparisons that compare file contents also apply active text filters and the blank line trimming option, and ignore newline differences.
ta: உண்மை என்றால், கோப்பு உள்ளடக்கங்களை ஒப்பிடும் கோப்புறை ஒப்பீடுகள் செயலில் உள்ள உரை வடிப்பான்கள் மற்றும் வெற்று வரி ஒழுங்கமைத்தல் விருப்பத்தையும் பயன்படுத்துகின்றன, மேலும் புதிய வேறுபாடுகளை புறக்கணிக்கின்றன.

source: File status filters
ta: கோப்பு நிலை வடிப்பான்கள்

source: List of statuses used to filter visible files in folder comparison.
ta: கோப்புறை ஒப்பீட்டில் புலப்படும் கோப்புகளை வடிகட்ட பயன்படுத்தப்படும் நிலைகளின் பட்டியல்.

source: Show the version control console output
ta: பதிப்பு கட்டுப்பாட்டு கன்சோல் வெளியீட்டைக் காட்டு

source: If true, a console output section will be shown in version control views, showing the commands run for version control operations.
ta: உண்மை என்றால், பதிப்பு கட்டுப்பாட்டு காட்சிகளில் ஒரு கன்சோல் வெளியீட்டு பிரிவு காண்பிக்கப்படும், பதிப்பு கட்டுப்பாட்டு செயல்பாடுகளுக்கு இயக்கப்படும் கட்டளைகளைக் காட்டுகிறது.

source: Version control pane position
ta: பதிப்பு கட்டுப்பாட்டு பலக நிலை

source: This is the height of the main version control tree when the console pane is shown.
ta: கன்சோல் பலகம் காட்டப்படும் போது இது முதன்மையான பதிப்பு கட்டுப்பாட்டு மரத்தின் உயரம்.

source: Present version comparisons as left-local/right-remote
ta: தற்போதைய பதிப்பு ஒப்பீடுகள் இடது-உள்ளூர்/வலது-ரிமோட்

source: If true, version control comparisons will use a left-is-local, right-is-remote scheme to determine what order to present files in panes. Otherwise, a left-is-theirs, right-is-mine scheme is used.
ta: உண்மை என்றால், பதிப்பு கட்டுப்பாட்டு ஒப்பீடுகள் பேன்களில் எந்த வரிசையை வழங்க வேண்டும் என்பதை தீர்மானிக்க இடது-உள்ளூர், வலது-ரீமோட் திட்டத்தைப் பயன்படுத்தும். இல்லையெனில், ஒரு இடது-அவற்றின், வலது-சுரங்கத் திட்டம் பயன்படுத்தப்படுகிறது.

source: Order for files in three-way version control merge comparisons
ta: மூன்று வழி பதிப்பு கட்டுப்பாட்டு இணைப்புகளில் கோப்புகளுக்கான ஆர்டர்

source: Choices for file order are remote/merged/local and local/merged/remote. This preference only affects three-way comparisons launched from the version control view, so is used solely for merges/conflict resolution within Meld.
ta: கோப்பு வரிசைக்கான தேர்வுகள் தொலைநிலை/இணைக்கப்பட்ட/உள்ளூர் மற்றும் உள்ளூர்/இணைக்கப்பட்ட/தொலைநிலை. இந்த விருப்பம் பதிப்பு கட்டுப்பாட்டு பார்வையில் இருந்து தொடங்கப்பட்ட மூன்று வழி ஒப்பீடுகளை மட்டுமே பாதிக்கிறது, எனவே மெல்டுக்குள் ஒன்றிணைப்பு/மோதல் தீர்மானத்திற்கு மட்டுமே பயன்படுத்தப்படுகிறது.

source: Show margin in commit message editor
ta: கமிட் செய்தி எடிட்டரில் விளிம்பைக் காட்டு

source: If true, a guide will be displayed to show what column the margin is at in the version control commit message editor.
ta: உண்மை என்றால், பதிப்பு கட்டுப்பாட்டு செய்தியில் செய்தி எடிட்டரில் எந்த நெடுவரிசை உள்ளது என்பதைக் காட்ட வழிகாட்டி காண்பிக்கப்படும்.

source: Margin column in commit message editor
ta: கமிட் செய்தி எடிட்டரில் விளிம்பு நெடுவரிசை

source: The column at which to show the margin in the version control commit message editor.
ta: பதிப்பு கட்டுப்பாட்டில் விளிம்பைக் காட்ட வேண்டிய நெடுவரிசை செய்தி எடிட்டரை உறுதிப்படுத்துகிறது.

source: Automatically hard-wrap commit messages
ta: தானாகவே கடின மடக்கு செய்திகளைச் செய்யுங்கள்

source: If true, the version control commit message editor will hard-wrap (i.e., insert line breaks) at the commit margin before commit.
ta: உண்மை என்றால், பதிப்பு கட்டுப்பாட்டு கமிட் செய்தி எடிட்டர் கமிட் மோசினில் கமிட் மோசினில் கடின-மடக்குதல் (அதாவது வரி இடைவெளிகளைச் செருகும்).

source: Version control status filters
ta: பதிப்பு கட்டுப்பாட்டு நிலை வடிப்பான்கள்

source: List of statuses used to filter visible files in version control comparison.
ta: பதிப்பு கட்டுப்பாட்டு ஒப்பீட்டில் புலப்படும் கோப்புகளை வடிகட்ட பயன்படுத்தப்படும் நிலைகளின் பட்டியல்.

source: [ ("Backups", true, "#*# .#* ~* *~ *.{orig,bak,swp}"), ("OS-Specific Metadata", true, ".DS_Store ._* .Spotlight-V100 .Trashes Thumbs.db Desktop.ini"), ("Version Control", true, "_MTN .bzr .svn .svn .hg .fslckout _FOSSIL_ .fos CVS _darcs .git .svn .osc"), ("Binaries", true, "*.{pyc,a,obj,o,so,la,lib,dll,exe}"), ("Media", false, "*.{jpg,gif,png,bmp,wav,mp3,ogg,flac,avi,mpg,xcf,xpm}") ]
ta: [[ ("காப்புப்பிரதிகள்", உண்மை, "#*#.#*~**~*. . . . . ]]

source: Filename-based filters
ta: கோப்பு பெயர் சார்ந்த வடிப்பான்கள்

source: List of predefined filename-based filters that, if active, will remove matching files from a folder comparison.
ta: முன் வரையறுக்கப்பட்ட கோப்பு பெயர் அடிப்படையிலான வடிப்பான்களின் பட்டியல், செயலில் இருந்தால், பொருந்தக்கூடிய கோப்புகளை கோப்புறை ஒப்பீட்டிலிருந்து அகற்றும்.

source: [ ("CVS/SVN Keywords", false, "\\$\\w+(:[^\\n$]+)?\\$"), ("C++ Comment", false, "//.*"), ("C Comment", false, "/\\*.*?\\*/"), ("All Whitespace", false, "[ \\t\\r\\f\\v]*"), ("Leading Whitespace", false, "^[ \\t\\r\\f\\v]*"), ("Trailing Whitespace", false, "[ \\t\\r\\f\\v]*$"), ("Script Comment", false, "#.*") ]
ta: [[ . ("சி ++ கருத்து", பொய், "//.*"), . . ("முன்னணி இடைவெளி", தவறு, " . ("ச்கிரிப்ட் கருத்து", பொய், "#.*") ]]

source: Text-based filters
ta: உரை அடிப்படையிலான வடிப்பான்கள்

source: List of predefined text-based regex filters that, if active, will remove text from being used in a file comparison. The text will still be displayed, but won’t contribute to the comparison itself.
ta: முன் வரையறுக்கப்பட்ட உரை அடிப்படையிலான ரீசெக்ச் வடிப்பான்களின் பட்டியல், செயலில் இருந்தால், உரையை ஒரு கோப்பு ஒப்பீட்டில் பயன்படுத்துவதிலிருந்து அகற்றும். உரை இன்னும் காண்பிக்கப்படும், ஆனால் ஒப்பீட்டுக்கு பங்களிக்காது.

source: Classic (Meld)
ta: கிளாசிக் (கூட்டு)

source: Base color scheme for Meld highlighting
ta: மெல்ட் சிறப்பம்சத்திற்கான அடிப்படை வண்ணத் திட்டம்

source: Meld dark scheme
ta: இருண்ட திட்டத்தை இணைக்கவும்

source: Dark color scheme for Meld highlighting
ta: மெல்ட் சிறப்பம்சத்திற்கான இருண்ட வண்ணத் திட்டம்

# shortcut window
source: Windows and Tabs
ta: சாளரங்கள் மற்றும் தாவல்கள்

# shortcut window
source: New comparison
ta: புதிய ஒப்பீடு

# shortcut window
source: Close a comparison
ta: ஒரு ஒப்பீட்டை மூடு

# shortcut window
source: Quit Meld
ta: வெளியேறு

# shortcut window
source: General
ta: பொது

# shortcut window
source: Show help
ta: உதவியைக் காட்டு

# shortcut window
source: Show preferences
ta: விருப்பங்களைக் காட்டு

# shortcut window
source: Keyboard shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

# shortcut window
source: Open menu
ta: திறந்த பட்டியல்

# shortcut window
source: Fullscreen
ta: முழு திரை

# shortcut window
source: Common Actions
ta: பொதுவான செயல்கள்

# shortcut window
source: Stop the current action
ta: தற்போதைய செயலை நிறுத்துங்கள்

# shortcut window
source: Refresh comparison
ta: ஒப்பீடு புதுப்பிக்கவும்

# shortcut window
source: Open externally
ta: வெளிப்புறமாக திறக்கவும்

# shortcut window
source: Panes
ta: பேன்கள்

# shortcut window
source: Previous comparison pane
ta: முந்தைய ஒப்பீட்டு பலகம்

# shortcut window
source: Next comparison pane
ta: அடுத்த ஒப்பீட்டு பலகம்

# shortcut window
source: Swap left and right panes
ta: இடது மற்றும் வலது பேன்களை மாற்றவும்

# shortcut window
source: Changes
ta: மாற்றங்கள்

# shortcut window
source: Go to previous change
ta: முந்தைய மாற்றத்திற்குச் செல்லுங்கள்

# shortcut window
source: Go to next change
ta: அடுத்த மாற்றத்திற்குச் செல்லுங்கள்

# shortcut window
source: Tabs
ta: தாவல்கள்

# shortcut window
source: Go to previous tab
ta: முந்தைய தாவலுக்குச் செல்லவும்

# shortcut window
source: Go to next tab
ta: அடுத்த தாவலுக்குச் செல்லவும்

# shortcut window
source: Switch to tab
ta: தாவலுக்கு மாறவும்

# shortcut window
source: Move tab left
ta: தாவலை நகர்த்தவும்

# shortcut window
source: Move tab right
ta: தாவலை சரியாக நகர்த்தவும்

# shortcut window
source: Editing
ta: திருத்துதல்

# shortcut window
source: Undo
ta: செயல்தவிர்

# shortcut window
source: Redo
ta: மீண்டும்செய்

# shortcut window
source: Cut
ta: வெட்டு

# shortcut window
source: Copy
ta: நகலெடு

# shortcut window
source: Paste
ta: ஒட்டு

# shortcut window
source: Find
ta: கண்டுபிடி

# shortcut window
source: Find Next
ta: அடுத்ததை தேடு

# shortcut window
source: Find Previous
ta: முந்தையதைக் கண்டறியவும்

# shortcut window
source: Replace
ta: மாற்றவும்

# shortcut window
source: Go to line
ta: வரிக்குச் செல்லுங்கள்

# shortcut window
source: File comparison
ta: கோப்பு ஒப்பீடு

# shortcut window
source: Save current file
ta: தற்போதைய கோப்பை சேமிக்கவும்

# shortcut window
source: Save current file to new path
ta: தற்போதைய கோப்பை புதிய பாதையில் சேமிக்கவும்

# shortcut window
source: Save all files in comparison
ta: ஒப்பிடுகையில் எல்லா கோப்புகளையும் சேமிக்கவும்

# shortcut window
source: Previous conflict
ta: முந்தைய மோதல்

# shortcut window
source: Next conflict
ta: அடுத்த மோதல்

# shortcut window
source: Push change to left
ta: மாற்றத்தை இடதுபுறமாக தள்ளுங்கள்

# shortcut window
source: Push change to right
ta: மாற்றத்தை வலதுபுறமாக தள்ளுங்கள்

# shortcut window
source: Pull change from left
ta: இடமிருந்து மாற்றத்தை இழுக்கவும்

# shortcut window
source: Pull change from right
ta: வலதுபுறத்திலிருந்து மாற்றத்தை இழுக்கவும்

# shortcut window
source: Copy change above left
ta: இடதுபுறம் மேலே மாற்றத்தை நகலெடுக்கவும்

# shortcut window
source: Copy change below left
ta: இடதுபுறத்தில் மாற்றத்தை நகலெடுக்கவும்

# shortcut window
source: Copy change above right
ta: மாற்றத்தை வலதுபுறமாக நகலெடுக்கவும்

# shortcut window
source: Copy change below right
ta: மாற்றத்தை வலது கீழே நகலெடுக்கவும்

# shortcut window
source: Delete change
ta: மாற்றத்தை நீக்கு

# shortcut window
source: Show overview map
ta: கண்ணோட்டம் வரைபடத்தைக் காட்டு

# shortcut window
source: Folder comparison
ta: கோப்புறை ஒப்பீடு

# shortcut window
source: Copy to left
ta: இடதுபுறமாக நகலெடுக்கவும்

# shortcut window
source: Copy to right
ta: வலதுபுறம் நகலெடுக்கவும்

# shortcut window
source: Expand the current folder
ta: தற்போதைய கோப்புறையை விரிவாக்குங்கள்

# shortcut window
source: Collapse the current folder
ta: தற்போதைய கோப்புறையை உடைக்கவும்

# shortcut window
source: Version control comparison
ta: பதிப்பு கட்டுப்பாட்டு ஒப்பீடு

# shortcut window
source: Commit to version control
ta: பதிப்பு கட்டுப்பாட்டுக்கு உறுதியளிக்கவும்

# shortcut window
source: Show/hide console output
ta: கன்சோல் வெளியீட்டைக் காட்டவும்/மறைக்கவும்

source: Save As…
ta: சேமிக்கவும்…

source: Save A_ll
ta: a_ll ஐ சேமிக்கவும்

source: Revert Files…
ta: கோப்புகளை மாற்றவும்…

source: _Open Externally
ta: _ வெளிப்புறமாக திறக்கவும்

source: Refresh Comparison
ta: ஒப்பீடு புதுப்பிக்கவும்

source: _Find…
ta: _ ஃபைண்ட்…

source: _Replace…
ta: _ மறுசீரமைப்பு…

source: _View
ta: காட்சி (_v)

source: Fullscreen
ta: முழு திரை

source: Overview Map
ta: கண்ணோட்டம் வரைபடம்

source: Version Control Console
ta: பதிப்பு கட்டுப்பாட்டு கன்சோல்

source: Lock Scrolling
ta: பூட்டு ச்க்ரோலிங்

source: Swap Left and Right Panes
ta: இடது மற்றும் வலது பேன்களை மாற்றவும்

source: _Comparison
ta: _ தொடர்பு

source: _Stop
ta: _ச்டாப்

source: Merge All from _Left
ta: அனைத்தையும் _left இலிருந்து ஒன்றிணைக்கவும்

source: Merge All from _Right
ta: அனைத்தையும் _ ரைட் ஒன்றிலிருந்து ஒன்றிணைக்கவும்

source: Merge _All
ta: ஒன்றிணைக்க _all

source: Format as _Patch…
ta: _patch என வடிவம்…

source: _Preferences
ta: விருப்பத்தேர்வுகள்

source: Keyboard Shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

source: _Help
ta: உதவி (_h)

source: File Status
ta: கோப்பு நிலை

source: Same
ta: அதே

source: New
ta: புதிய

source: Modified
ta: மாற்றியமைக்கப்பட்ட

source: Ignore Filename Case
ta: கோப்பு பெயர் வழக்கை புறக்கணிக்கவும்

source: Normalize Unicode Paths
ta: யூனிகோட் பாதைகளை இயல்பாக்குங்கள்

source: Normal
ta: சாதாரண

source: Unversioned
ta: மாற்றப்பட்ட

source: Ignored
ta: புறக்கணிக்கப்பட்டது

source: Flatten Folders
ta: தட்டையான கோப்புறைகள்

source: Copyright © 2002-2009 Stephen Kennedy Copyright © 2009-2022 Kai Willadsen
ta: பதிப்புரிமை © 2002-2009 ச்டீபன் கென்னடி பதிப்புரிமை © 2009-2022 கை வில்லாட்சன்

source: translator-credits
ta: மொழிபெயர்ப்பாளர்-வரவு

source: Start a new comparison
ta: புதிய ஒப்பீட்டைத் தொடங்கவும்

source: Open a recent comparison
ta: அண்மைக் கால ஒப்பீட்டைத் திறக்கவும்

source: Go to the previous change
ta: முந்தைய மாற்றத்திற்குச் செல்லுங்கள்

source: Go to the next change
ta: அடுத்த மாற்றத்திற்குச் செல்லுங்கள்

source: Go to the previous conflict
ta: முந்தைய மோதலுக்குச் செல்லுங்கள்

source: Go to the next conflict
ta: அடுத்த மோதலுக்குச் செல்லுங்கள்

source: Version Filters
ta: பதிப்பு வடிப்பான்கள்

source: File Filters
ta: கோப்பு வடிப்பான்கள்

source: Text Filters
ta: உரை வடிப்பான்கள்

source: Active
ta: செயலில்

source: Column Name
ta: நெடுவரிசை பெயர்

source: Move item up
ta: உருப்படியை நகர்த்தவும்

source: Move _Up
ta: மேலே நகர்த்து

source: Move item down
ta: உருப்படியை கீழே நகர்த்தவும்

source: Move _Down
ta: கீழே இறங்கு

source: Commit
ta: கமிட்

source: Commit Files
ta: கோப்புகளைச் செய்யுங்கள்

source: Log Message
ta: பதிவு செய்தி

source: Previous logs:
ta: முந்தைய பதிவுகள்:

source: Copy to left
ta: இடதுபுறமாக நகலெடுக்கவும்

source: Copy to right
ta: வலதுபுறம் நகலெடுக்கவும்

source: Delete selected
ta: தேர்ந்தெடுத்ததை அழி

source: _Compare Selected Files
ta: _ தேர்ந்தெடுக்கப்பட்ட கோப்புகளை இணைக்கவும்

source: _Mark Selected File
ta: _ தேர்ந்தெடுக்கப்பட்ட கோப்பை குறிக்கவும்

source: Compare _with Marked File
ta: குறிக்கப்பட்ட கோப்புடன் ஒப்பிடுக

source: Copy to _Left
ta: _left க்கு நகலெடுக்கவும்

source: Copy to _Right
ta: வலதுபுறம் நகலெடுக்கவும்

source: _Delete Selected
ta: _தேர்ந்தெடுத்ததை அழி

source: Collapse Recursively
ta: மீண்டும் வீழ்ச்சியடைகிறது

source: Expand Recursively
ta: மீண்டும் விரிவாக்குங்கள்

source: _Copy File Paths
ta: _ கோபி கோப்பு பாதைகள்

source: Select Folder
ta: கோப்புறையைத் தேர்ந்தெடு

source: Select folder to open in this pane
ta: இந்த பலகத்தில் திறக்க கோப்புறையைத் தேர்ந்தெடுக்கவும்

source: Folder 1
ta: கோப்புறை 1

source: Folder 2
ta: கோப்புறை 2

source: Folder 3
ta: கோப்புறை 3

source: Search text encoding…
ta: உரை குறியாக்கத்தைத் தேடுங்கள்…

source: Push current change to the left
ta: தற்போதைய மாற்றத்தை இடதுபுறமாக தள்ளுங்கள்

source: Push current change to the right
ta: தற்போதைய மாற்றத்தை வலதுபுறமாக தள்ளுங்கள்

source: Copy chunks
ta: நகல்களை நகலெடு

source: Delete change
ta: மாற்றத்தை நீக்கு

source: Copy change above the left chunk
ta: இடது துண்டுக்கு மேலே மாற்றத்தை நகலெடுக்கவும்

source: Copy change below the left chunk
ta: இடது துண்டுக்கு கீழே மாற்றத்தை நகலெடுக்கவும்

source: Copy change above the right chunk
ta: வலது துண்டுக்கு மேலே மாற்றத்தை நகலெடுக்கவும்

source: Copy change below the right chunk
ta: வலது துண்டுக்கு கீழே மாற்றத்தை நகலெடுக்கவும்

source: _Redo
ta: _ ரெடோ

source: _Copy
ta: _ கோபி

source: _Paste
ta: _ பேச்ட்

source: Open Containing Folder
ta: கோப்புறை கொண்ட திறந்த

source: Copy Full Path
ta: முழு பாதையை நகலெடுக்கவும்

source: This file can not be written to. You may click here to unlock this file and make changes anyway, but these changes must be saved to a new file.
ta: இந்த கோப்பை எழுத முடியாது. இந்த கோப்பைத் திறக்க நீங்கள் இங்கே சொடுக்கு செய்து எப்படியும் மாற்றங்களைச் செய்யலாம், ஆனால் இந்த மாற்றங்கள் புதிய கோப்பில் சேமிக்கப்பட வேண்டும்.

source: Save file in this pane
ta: இந்த பலகத்தில் கோப்பைச் சேமிக்கவும்

source: Open file in this pane
ta: இந்த பலகத்தில் கோப்பைத் திறக்கவும்

source: File 3
ta: கோப்பு 3

source: File 2
ta: கோப்பு 2

source: File 1
ta: கோப்பு 1

source: Name
ta: பெயர்
