Repository: 247i/TACETr
Catalog: உரை/தானி/microg-play-services-nearby-core-strings-*.po
Languages: ta

# exposure_notify_off_title
source: Exposure Notifications inactive
ta: வெளிப்பாடு அறிவிப்புகள் செயலற்றவை

# exposure_notify_off_bluetooth
source: Bluetooth needs to be enabled to receive Exposure Notifications.
ta: வெளிப்பாடு அறிவிப்புகளைப் பெற ஊடலை இயக்கப்பட வேண்டும்.

# exposure_notify_off_location
source: Location access is required to receive Exposure Notifications.
ta: வெளிப்பாடு அறிவிப்புகளைப் பெற இருப்பிட அணுகல் தேவை.

# exposure_notify_off_bluetooth_location
source: Bluetooth and Location access need to be enabled to receive Exposure Notifications.
ta: வெளிப்பாடு அறிவிப்புகளைப் பெற ஊடலை மற்றும் இருப்பிட அணுகல் இயக்கப்பட வேண்டும்.

# exposure_notify_off_nearby
source: Exposure Notifications require additional permissions to work
ta: வெளிப்பாடு அறிவிப்புகளுக்கு வேலை செய்ய கூடுதல் அனுமதிகள் தேவை

# service_name_exposure
source: Exposure Notifications
ta: வெளிப்பாடு அறிவிப்புகள்

# pref_exposure_enable_info_summary
source: To enable Exposure Notifications, open any app supporting it.
ta: வெளிப்பாடு அறிவிப்புகளை இயக்க, அதை ஆதரிக்கும் எந்த பயன்பாட்டையும் திறக்கவும்.

# pref_exposure_error_bluetooth_off_title
source: Enable Bluetooth
ta: புளூடூத்தை இயக்கவும்

# pref_exposure_error_location_off_title
source: Open Location settings
ta: இருப்பிட அமைப்புகளைத் திறக்கவும்

# pref_exposure_error_bluetooth_unsupported_summary
source: Unfortunately, your device is not compatible with Exposure Notifications.
ta: துரதிர்ச்டவசமாக, உங்கள் சாதனம் வெளிப்பாடு அறிவிப்புகளுடன் பொருந்தாது.

# pref_exposure_error_bluetooth_no_advertise_summary
source: Unfortunately, your device is only partially compatible with Exposure Notifications. You can be notified for risk contacts but won't be able to notify others.
ta: துரதிர்ச்டவசமாக, உங்கள் சாதனம் வெளிப்பாடு அறிவிப்புகளுடன் ஓரளவு மட்டுமே இணக்கமானது. இடர் தொடர்புகளுக்கு உங்களுக்கு அறிவிக்கப்படலாம், ஆனால் மற்றவர்களுக்கு அறிவிக்க முடியாது.

# prefcat_exposure_apps_title
source: Apps using Exposure Notifications
ta: வெளிப்பாடு அறிவிப்புகளைப் பயன்படுத்தும் பயன்பாடுகள்

# pref_exposure_collected_rpis_title
source: Collected IDs
ta: சேகரிக்கப்பட்ட ஐடிஎச்

# pref_exposure_collected_rpis_summary
source: <xliff:g example="63">%1$d</xliff:g> IDs in last hour
ta: <xliff: g எடுத்துக்காட்டு = "63">%1$d </xliff: g> ஐடிஎச் கடைசி மணி நேரத்தில்

# pref_exposure_advertising_id_title
source: Currently broadcasted ID
ta: தற்போது ஒளிபரப்பப்பட்ட ஐடி

# prefcat_exposure_app_report_title
source: Reported exposures
ta: அறிவிக்கப்பட்ட வெளிப்பாடுகள்

# pref_exposure_app_report_updated_title
source: Updated: <xliff:g example="Today, 14:02">%1$s</xliff:g>
ta: புதுப்பிக்கப்பட்டது: <xliff: g எடுத்துக்காட்டு = "இன்று, 14:02">%1$s </xliff: g>

# pref_exposure_app_report_entry_time_short
source: Less than 5 minutes
ta: 5 நிமிடங்களுக்கும் குறைவாக

# pref_exposure_app_report_entry_time_about
source: About <xliff:g example="13">%1$d</xliff:g> minutes
ta: <Xliff: g எடுத்துக்காட்டு = "13">%1$d </xliff: g> நிமிடங்கள்

# pref_exposure_app_report_entry_distance_close
source: nearby exposure
ta: அருகிலுள்ள வெளிப்பாடு

# pref_exposure_app_report_entry_distance_far
source: distant exposure
ta: தொலைதூர வெளிப்பாடு

# pref_exposure_app_report_entry_combined
source: <xliff:g example="About 12 minutes">%1$s</xliff:g>, <xliff:g example="distant exposure">%2$s</xliff:g>
ta: <xliff: g எடுத்துக்காட்டு = "சுமார் 12 நிமிடங்கள்">%1$s </xliff: g>, <xliff: g எடுத்துக்காட்டு = "தொலைதூர வெளிப்பாடு">%2$s </xliff: g>

# pref_exposure_app_last_report_summary_diagnosis_keys
source: Processed <xliff:g example="121031">%1$d</xliff:g> diagnosis keys.
ta: செயலாக்கப்பட்ட <xliff: g எடுத்துக்காட்டு = "121031">%1$d </xliff: g> நோயறிதல் விசைகள்.

# pref_exposure_app_last_report_summary_encounters_no
source: No exposure encounters reported.
ta: வெளிப்பாடு சந்திப்புகள் எதுவும் தெரிவிக்கப்படவில்லை.

# pref_exposure_app_last_report_summary_encounters_prefix
source: Reported <xliff:g example="3">%1$d</xliff:g> exposure encounters:
ta: அறிவிக்கப்பட்ட <xliff: g எடுத்துக்காட்டு = "3">%1$d </xliff: g> வெளிப்பாடு சந்திப்புகள்:

# pref_exposure_app_last_report_summary_encounters_line
source: <xliff:g example="Yesterday, 12:00 - 14:00">%1$s</xliff:g>, risk score <xliff:g example="99">%2$d</xliff:g>
ta: <xliff: g எடுத்துக்காட்டு = "நேற்று, 12:00 - 14:00">%1$s </xliff: g>, இடர் மதிப்பெண் <xliff: g எடுத்துக்காட்டு = "99">%2$d </xliff: g>

# pref_exposure_app_last_report_summary_encounters_suffix
source: Note: The risk score is defined by the app. High numbers can refer to low risk or vice-versa.
ta: குறிப்பு: இடர் மதிப்பெண் பயன்பாட்டால் வரையறுக்கப்படுகிறது. அதிக எண்கள் குறைந்த ஆபத்தை குறிக்கலாம் அல்லது நேர்மாறாக இருக்கலாம்.

# pref_exposure_app_api_usage_title
source: API usage in the last 14 days
ta: கடந்த 14 நாட்களில் பநிஇ பயன்பாடு

# pref_exposure_app_api_usage_summary_line
source: <xliff:g example="12">%1$d</xliff:g> calls to <xliff:g example="provideDiagnosisKeys">%2$s</xliff:g>
ta: <XLIFF: g எடுத்துக்காட்டு = "12">%1$d </xliff: g> <xliff: g எடுத்துக்காட்டு = "pandiagnosiskeys">%2$s </xliff: g>

# prefcat_exposure_rpis_histogram_title
source: <xliff:g example="230">%1$d</xliff:g> IDs collected
ta: <xliff: g எடுத்துக்காட்டு = "230">%1$d </xliff: g> ஐடிகள் சேகரிக்கப்பட்டன

# pref_exposure_rpis_histogram_legend_no_records
source: No records
ta: பதிவுகள் இல்லை

# pref_exposure_rpis_histogram_legend_records
source: <xliff:g example="0 - 50">%1$s</xliff:g> IDs per hour
ta: <xliff: g எடுத்துக்காட்டு = "0 - 50">%1$s </xliff: g> ஒரு மணி நேரத்திற்கு ஐடிஎச்

# pref_exposure_rpi_delete_all_title
source: Delete
ta: நீக்கு

# pref_exposure_rpi_delete_all_summary
source: Delete all collected IDs
ta: சேகரிக்கப்பட்ட அனைத்து ஐடிகளையும் நீக்கு

# pref_exposure_rpi_delete_all_warning
source: Deleting collected IDs will make it impossible to notify you in case any of your contacts of the last 14 days is diagnosed.
ta: சேகரிக்கப்பட்ட ஐடிகளை நீக்குவது கடந்த 14 நாட்களில் உங்கள் தொடர்புகள் ஏதேனும் கண்டறியப்பட்டால் உங்களுக்குத் தெரிவிக்க இயலாது.

# pref_exposure_rpi_delete_all_warning_confirm_button
source: Delete anyways
ta: எப்படியும் நீக்கு

# pref_exposure_rpi_export_title
source: Export
ta: ஏற்றுமதி

# pref_exposure_rpi_export_summary
source: Export collected IDs for extended analysis with another app.
ta: மற்றொரு பயன்பாட்டுடன் நீட்டிக்கப்பட்ட பகுப்பாய்விற்கு சேகரிக்கப்பட்ட ஐடிகளை ஏற்றுமதி செய்யுங்கள்.

# pref_exposure_info_summary
source: Exposure Notifications API allows apps to notify you if you were exposed to someone who reported to be diagnosed positive. The date, duration, and signal strength associated with an exposure will be shared with the corresponding app.
ta: வெளிப்பாடு அறிவிப்புகள் பநிஇ நேர்மறையாக கண்டறியப்பட்டதாகக் கூறப்படும் ஒருவரை நீங்கள் வெளிப்படுத்தியிருந்தால் பயன்பாடுகள் உங்களுக்குத் தெரிவிக்க அனுமதிக்கிறது. வெளிப்பாட்டுடன் தொடர்புடைய தேதி, காலம் மற்றும் சமிக்ஞை வலிமை ஆகியவை தொடர்புடைய பயன்பாட்டுடன் பகிரப்படும்.

# pref_exposure_rpis_details_summary
source: While Exposure Notification API is enabled, your device passively collects IDs (called Rolling Proximity Identifiers, or RPIs) from nearby devices. When device owners report to be diagnosed positive, their IDs can be shared. Your device checks if any of the known diagnosed IDs matches any of the collected IDs and calculates your infection risk.
ta: வெளிப்பாடு அறிவிப்பு பநிஇ இயக்கப்பட்டிருந்தாலும், அருகிலுள்ள சாதனங்களிலிருந்து உங்கள் சாதனம் செயலற்ற முறையில் ஐடிஎச் (ரோலிங் ப்ராக்சிமிட்டி அடையாளங்காட்டிகள் அல்லது ஆர்.பி.ஐ.எச்) சேகரிக்கிறது. சாதன உரிமையாளர்கள் நேர்மறையாக கண்டறியப்படுவதாக புகாரளிக்கும் போது, அவர்களின் ஐடிகளை பகிரலாம். அறியப்பட்ட கண்டறியப்பட்ட ஐடிஎச் ஏதேனும் சேகரிக்கப்பட்ட ஐடிகளுடன் பொருந்தக்கூடியது மற்றும் உங்கள் தொற்று அபாயத்தை கணக்கிடுகிறது என்றால் உங்கள் சாதனம் சரிபார்க்கிறது.

# exposure_enable_switch
source: Use Exposure Notifications
ta: வெளிப்பாடு அறிவிப்புகளைப் பயன்படுத்துங்கள்

# exposure_confirm_start_title
source: Turn on Exposure Notifications?
ta: வெளிப்பாடு அறிவிப்புகளை இயக்கவா?

# exposure_confirm_start_summary
source: Your phone needs to use Bluetooth to securely collect and share IDs with other phones that are nearby. <xliff:g example="Corona-Warn">%1$s</xliff:g> can notify you if you were exposed to someone who reported to be diagnosed positive. The date, duration, and signal strength associated with an exposure will be shared with the app."
ta: உங்கள் தொலைபேசி புளூடூத்தை பாதுகாப்பாக சேகரிக்கவும், அருகிலுள்ள பிற தொலைபேசிகளுடன் ஐடிகளைப் பகிரவும் வேண்டும். <xliff: g எடுத்துக்காட்டு = "கொரோனா-வார்ன்">%1$s </xliff: g> நேர்மறை கண்டறியப்பட்டதாக அறிவித்த ஒருவருக்கு நீங்கள் வெளிப்பட்டால் உங்களுக்கு அறிவிக்க முடியும். வெளிப்பாட்டுடன் தொடர்புடைய தேதி, காலம் மற்றும் சமிக்ஞை வலிமை பயன்பாட்டுடன் பகிரப்படும். "

# exposure_confirm_start_button
source: Turn on
ta: இயக்கவும்

# exposure_confirm_stop_title
source: Turn off Exposure Notifications?
ta: வெளிப்பாடு அறிவிப்புகளை அணைக்கவா?

# exposure_confirm_stop_summary
source: After disabling Exposure Notifications, you will no longer be notified when you were exposed to someone who reported to be diagnosed positive.
ta: வெளிப்பாடு அறிவிப்புகளை முடக்கிய பிறகு, நேர்மறையானதாகக் கண்டறியப்பட்டதாகக் கூறப்படும் ஒருவருக்கு நீங்கள் வெளிப்படும் போது உங்களுக்கு இனி அறிவிக்கப்படாது.

# exposure_confirm_stop_button
source: Turn off
ta: அணைக்கவும்

# exposure_confirm_keys_title
source: Share your IDs with <xliff:g example="Corona-Warn">%1$s</xliff:g>?
ta: உங்கள் ஐடிகளை <xliff: g எடுத்துக்காட்டு = "கொரோனா-வார்ன்">%1$s </xliff: g> உடன் பகிர்ந்து கொள்ளுங்கள்?

# exposure_confirm_keys_summary
source: Your IDs from the last 14 days will be used to help notify others that you've been near about potential exposure. Your identity or test result won't be shared with other people.
ta: கடந்த 14 நாட்களிலிருந்து உங்கள் ஐடிகள் சாத்தியமான வெளிப்பாடு குறித்து நீங்கள் இருந்ததாக மற்றவர்களுக்கு அறிவிக்க உதவும். உங்கள் அடையாளம் அல்லது சோதனை முடிவு மற்றவர்களுடன் பகிரப்படாது.

# exposure_confirm_keys_button
source: Share
ta: பங்கு

# exposure_confirm_permission_description
source: <xliff:g example="microG Services">%1$s</xliff:g> needs additional permissions.
ta: <xliff: g எடுத்துக்காட்டு = "மைக்ரோக் சேவைகள்">%1$s </xliff: g> கூடுதல் அனுமதிகள் தேவை.

# exposure_confirm_permission_button
source: Grant
ta: மானியம்

# exposure_confirm_bluetooth_description
source: Bluetooth needs to be enabled.
ta: ஊடலை இயக்கப்பட வேண்டும்.

# exposure_confirm_location_description
source: Location access is required.
ta: இருப்பிட அணுகல் தேவை.

# exposure_confirm_button
source: Enable
ta: இயக்கு

# pref_exposure_error_nearby_not_granted_title
source: New Permissions required
ta: புதிய அனுமதிகள் தேவை

# pref_exposure_error_nearby_not_granted_description
source: Tap to grant required permissions to Exposure Notifications
ta: வெளிப்பாடு அறிவிப்புகளுக்கு தேவையான அனுமதிகளை வழங்க தட்டவும்

# exposure_grant_background_location_description
source: Almost there! You will need to enable background location access by selecting the 'Allow all the time' option on the next screen. Then press back.
ta: கிட்டத்தட்ட அங்கே! அடுத்த திரையில் 'எல்லா நேரத்தையும் அனுமதிக்கவும்' விருப்பத்தைத் தேர்ந்தெடுப்பதன் மூலம் பின்னணி இருப்பிட அணுகலை நீங்கள் இயக்க வேண்டும். பின்னர் மீண்டும் அழுத்தவும்.

# exposure_grant_background_location_button
source: Update Settings
ta: அமைப்புகளை புதுப்பிக்கவும்
