Repository: 247i/TACETr
Catalog: உரை/தானி/mikbot-deppgpt-*.po
Languages: ta

# commands.new_gpt_channel.arguments.channel.name
source: channel
ta: வாய்க்கால்

# commands.new_gpt_channel.arguments.channel.description
source: The channel to start the conversation in
ta: உரையாடலைத் தொடங்க சேனல்

# commands.new_gpt_channel.name
source: new-gpt-channel
ta: புதிய-சிபிடி-சேனல்

# commands.new_gpt_channel.description
source: Creates a new DeppGPT channel
ta: புதிய டெப்சிப்ட் சேனலை உருவாக்குகிறது

# commands.start_thread.arguments.name.name
source: name
ta: பெயர்

# commands.start_thread.arguments.name.description
source: The name of the GPT thread
ta: சிபிடி நூலின் பெயர்

# commands.start_thread.name
source: start-thread
ta: தொடக்க-நூல்

# commands.start_thread.description
source: Starts a new Thread with DeppGPT
ta: DEPGPT உடன் புதிய நூலைத் தொடங்குகிறது

# commands.start_thread_action.name
source: Start DeppGPT Thread
ta: டெப்சிப்ட் நூலைத் தொடங்கவும்

# gdpr.description
source: The GPT features will process and store all messages sent into a GPT-enabled channel or Thread this data will be deleted by after 7 days
ta: சிபிடி நற்பொருத்தங்கள் சிபிடி-இயக்கப்பட்ட சேனலில் அனுப்பப்படும் அனைத்து செய்திகளையும் செயலாக்கி சேமிக்கும் அல்லது இந்த தரவு 7 நாட்களுக்குப் பிறகு நீக்கப்படும்

# gdpr.sharing.description
source: In order to provide the GPT features, all messages will be shared with the DeppGPT service which is operated by `Steckenpferd Enterprises UG (haftungsbeschränkt)`, you can find there privacy policy [here](https://www.der-postillon.com/p/blog-page_9.html)
ta: சிபிடி அம்சங்களை வழங்குவதற்காக, அனைத்து செய்திகளும் `ச்டெக்கன்பெர்ட் எண்டர்பிரைசச் யுசி (ஆஃப்டங்ச்பெச்ரெங்க்ட்) by ஆல் இயக்கப்படும் டெப்சிபிடி சேவையுடன் பகிரப்படும், நீங்கள் அங்கு தனியுரிமைக் கொள்கையை [இங்கே] காணலாம் (https: //www.der-postillon. com/p/blog-page_9.html)

# commands.add_successful
source: Successfully started GPT conversation in {0}.
ta: {0} இல் சிபிடி உரையாடலை வெற்றிகரமாக தொடங்கியது.
