Repository: 247i/TACETr
Catalog: உரை/தானி/mikbot-tic_tac_toe-*.po
Languages: ta

source: TicTacToe - Lobby
ta: Tictactoe - லாபி

# tic_tac_toe.leaderboard
source: TicTacToe Leaderboard - Page {0}/{1}
ta: Tictactoe லீடர்போர்டு - பக்கம் {0}/{1}

# tic_tac_toe.controls.joined
source: You are `{0}`
ta: நீங்கள் `{0}`

# gdpr.stats.name
source: TicTacToe statistics
ta: Tictactoe புள்ளிவிவரங்கள்

# gdpr.stats.description
source: The TicTacToe feature stores your total amount of games, amount of won games, amount of lost games and ratio between won and lost games.
ta: டிக்டாக்டோ நற்பொருத்தம் உங்கள் மொத்த விளையாட்டுகளின் அளவு, வென்ற விளையாட்டுகளின் அளவு, இழந்த விளையாட்டுகளின் அளவு மற்றும் வென்ற மற்றும் இழந்த விளையாட்டுகளுக்கு இடையிலான விகிதம் ஆகியவற்றை சேமிக்கிறது.

# gdpr.processed_data.description
source: The TicTacToe feature stores your current turns until the game is over.
ta: விளையாட்டு முடியும் வரை உங்கள் தற்போதைய திருப்பங்களை டிக்டாக்டோ நற்பொருத்தம் சேமிக்கிறது.

# commands.start.arguments.size.name
source: size
ta: அளவு

# commands.start.arguments.size.description
source: How large the game board is (note that a 4x4 game also requires 4 and not 3 items in a row)
ta: கேம் போர்டு எவ்வளவு பெரியது (4x4 விளையாட்டுக்கும் 4 மற்றும் ஒரு வரிசையில் 3 உருப்படிகள் தேவை என்பதை நினைவில் கொள்க)

# commands.start.name
source: start
ta: தொடங்கு

# commands.start.description
source: Starts a new game of TicTacToe
ta: TIC TAC TOE இன் புதிய விளையாட்டைத் தொடங்கவும்
