Repository: 247i/TACETr
Catalog: உரை/தானி/mikbot-answering_machine-*.po
Languages: ta

# commands.add_answering_machine.arguments.pattern.name
source: pattern
ta: முறை

# commands.add_answering_machine.arguments.pattern.description
source: A regular expression which a message should match to reply
ta: பதிலளிக்க ஒரு செய்தி பொருந்தக்கூடிய ஒரு வழக்கமான வெளிப்பாடு

# commands.add_answering_machine.arguments.replacement.name
source: replacement
ta: மாற்று

# commands.add_answering_machine.arguments.replacement.description
source: How to answer to the message (Supports RegEx groups)
ta: செய்திக்கு எவ்வாறு பதிலளிப்பது (ரீசெக்ச் குழுக்களை ஆதரிக்கிறது)

# commands.add_answering_machine.arguments.delete.name
source: delete
ta: நீக்கு

# commands.add_answering_machine.arguments.delete.description
source: Whether to delete the original message
ta: அசல் செய்தியை நீக்க வேண்டுமா

# commands.add_answering_machine.confirmation.title
source: Try your answering machine
ta: உங்கள் பதிலளிக்கும் இயந்திரத்தை முயற்சிக்கவும்

# commands.add_answering_machine.confirmation.inputs.test_input.title
source: Test input
ta: சோதனை உள்ளீடு

# commands.add_answering_machine.arguments.ignore_case.name
source: ignore-case
ta: புறக்கணிப்பு-வழக்கு

# commands.add_answering_machine.arguments.ignore_case.description
source: Whether to ignore the messages case
ta: செய்திகளை புறக்கணிக்க வேண்டுமா

# commands.delete_answering_machine.arguments.machine.name
source: machine
ta: இயந்திரம்

# commands.delete_answering_machine.arguments.machine.description
source: The answering machine to delete
ta: நீக்க பதிலளிக்கும் இயந்திரம்

# commands.add_answering_machine.name
source: add-answering-machine
ta: கூடுதல் பதில் இயந்திரம்

# commands.add_answering_machine.description
source: Creates a new answering machine
ta: புதிய பதில் இயந்திரத்தை உருவாக்குகிறது

# commands.add_answering_machine.confirmation.received
source: THe bot's reply to this message would look like `{0}` is that what you want?
ta: இந்த செய்திக்கு போட் அளித்த பதில் `{0}` இது உங்களுக்கு என்ன வேண்டுமா?

# commands.add_answering_machine.confirmation.confirm
source: Yes, save that!
ta: ஆம், அதை சேமிக்கவும்!

# commands.add_answering_machine.created
source: Successfully created answering machine
ta: வெற்றிகரமாக பதிலளிக்கும் இயந்திரத்தை உருவாக்கியது

# commands.add_answering_machine.confirmation.decline
source: Hell no!
ta: நரகத்தில் இல்லை!

# commands.add_answering_machine.declined
source: Okay then, try running the command again, you can test your expression [here](https://regex101.com)
ta: சரி, கட்டளையை மீண்டும் இயக்க முயற்சிக்கவும், உங்கள் வெளிப்பாட்டை [இங்கே] சோதிக்கலாம் (https://regex101.com)

# commands.delete_answering_machine.name
source: delete-answering-machine
ta: நீக்கு-பதில் இயந்திரம்

# commands.delete_answering_machine.description
source: Deletes an answering machine
ta: பதிலளிக்கும் இயந்திரத்தை நீக்குகிறது

# commands.delete_answering_machine.success
source: Successfully deleted answering machine
ta: பதில் இயந்திரம் வெற்றிகரமாக நீக்கப்பட்டது

# commands.add_answering_machine.modals.test.tile
source: Test your input
ta: உங்கள் உள்ளீட்டை சோதிக்கவும்

# commands.add_answering_machine.modals.test.fields.text.label
source: Test Message
ta: சோதனை செய்தி
