Repository: 247i/TACETr
Catalog: உரை/தானி/mikbot-googolplex-*.po
Languages: ta

source: Googolplex - Lobby
ta: கூகோல்ப்ளெக்ச் - லாபி

# googolplex.controls.request_initial
source: Please enter {0} symbols to select your phrase.
ta: உங்கள் சொற்றொடரைத் தேர்ந்தெடுக்க {0} சின்னங்களை உள்ளிடவும்.

# googolplex.controls.request_guess
source: Please select {0} items to enter a guess!
ta: Please தேர்ந்தெடு {0} items பெறுநர் enter a guess!

# googolplex.stats.title
source: Googolplex Statistics - Page {0}/{1}
ta: கூகோல்ப்ளெக்ச் புள்ளிவிவரங்கள் - பக்கம் {0}/{1}

# game.controls.wait_for_cycle
source: Waiting for next game cycle ...
ta: அடுத்த விளையாட்டு சுழற்சிக்காக காத்திருக்கிறது ...

# game.io.guesses_heading
source: **Guesses:**
ta: ** யூகங்கள்: **

# game.ui.legend.title
source: Legend
ta: புராணக்கதை

# game.ui.legend
source: {0} means that there is a correct item in the sequence {1} means that there is a correct item in the sequence at the correct position {1} will always be after {0}, so the order of the hints, doesn't necessarily reflect the order in the sequence
ta: {0} என்பது வரிசையில் சரியான உருப்படி உள்ளது என்று பொருள் {1} என்பது சரியான நிலையில் வரிசையில் சரியான உருப்படி உள்ளது {1} எப்போதும் {0 afly க்குப் பிறகு இருக்கும், எனவே குறிப்புகளின் வரிசை, வரிசையில் வரிசையை பிரதிபலிக்காது

# commands.start.arguments.length.name
source: length
ta: நீளம்

# commands.start.arguments.length.description
source: The length of the sequence to guess
ta: யூகிக்க வரிசையின் நீளம்

# commands.start.arguments.max_tries.description
source: The amount of tries, the guesser has
ta: முயற்சிகளின் அளவு, உய்த்துணர் உள்ளது

# commands.start.name
source: start
ta: தொடங்கு

# commands.start.description
source: Starts a new game of Googolplex
ta: கூகோல்ப்ளெக்சின் புதிய விளையாட்டைத் தொடங்குகிறது
