Repository: 247i/TACETr
Catalog: உரை/தானி/mikbot-birthdays-*.po
Languages: ta

# commands.birthday.name
source: birthdays
ta: பிறந்த நாள்

# commands.birthday.get.arguments.member.name
source: member
ta: உறுப்பினர்

# commands.birthday.get.arguments.member.description
source: The member whose birthday you want to know
ta: நீங்கள் தெரிந்து கொள்ள விரும்பும் உறுப்பினர்

# commands.birthday.get.name
source: get
ta: பெறுங்கள்

# commands.birthday.get.description
source: Retrieves the birthday of a member
ta: ஒரு உறுப்பினரின் பிறந்தநாளை மீட்டெடுக்கிறது

# commands.birthday.get.info
source: {0}'s {1}th birthday is in {2} days, on {3} :candle:
ta: {0} 's {1} வது பிறந்த நாள் {2} நாட்களில், {3}: மெழுகுவர்த்தி:

# commands.birthday.get.unknown
source: Sadly that user is a privacy freak and didn't tell me their birthday
ta: துரதிர்ச்டவசமாக அந்த பயனர் ஒரு தனியுரிமை குறும்பு மற்றும் அவர்களின் பிறந்தநாளை என்னிடம் சொல்லவில்லை

# commands.birthday.list.name
source: list
ta: பட்டியல்

# commands.birthday.list.description
source: Lists all users birthdays
ta: அனைத்து பயனர்களின் பிறந்தநாளையும் பட்டியலிடுகிறது

# commands.birthday.list.title
source: Birthday list - Page {0}/{1}
ta: பிறந்தநாள் பட்டியல் - பக்கம் {0}/{1}

# commands.birthday.set.name
source: set
ta: கணம்

# commands.birthday.set.description
source: Sets your own birthday
ta: உங்கள் சொந்த பிறந்தநாளை அமைக்கிறது

# commands.birthday.set.timezone.title
source: Time zone detection
ta: நேர மண்டல கண்டறிதல்

# commands.birthday.set.timezone.description
source: Since we need to assume that also Apple users will use this command, we cannot assume you know what a timezone is or what timezone you are in, therefore we created a tool to detect your timezone, in order to do that, click [here]({0})
ta: ஆப்பிள் பயனர்களும் இந்த கட்டளையைப் பயன்படுத்துவார்கள் என்று நாங்கள் கருத வேண்டும் என்பதால், நேர மண்டலம் என்றால் என்ன அல்லது நீங்கள் எந்த நேர மண்டலத்தில் இருக்கிறீர்கள் என்று உங்களுக்குத் தெரியும் என்று நாங்கள் கருத முடியாது, எனவே உங்கள் நேர மண்டலத்தைக் கண்டறிய ஒரு கருவியை உருவாக்கியுள்ளோம், அதைச் செய்ய, [இங்கே] சொடுக்கு செய்க [இங்கே] ({0})

# commands.birthday.set.arguments.birthday.name
source: birthday
ta: பிறந்த நாள்

# commands.birthday.set.arguments.birthday.description
source: The date of your birthday
ta: உங்கள் பிறந்தநாளின் தேதி

# commands.birthday.set.success
source: Your birthday was successfully set to {0}.
ta: உங்கள் பிறந்த நாள் வெற்றிகரமாக {0 பெறுநர் ஆக அமைக்கப்பட்டது.

# commands.birthday.set.invalid_date
source: Please specify the date in a valid format MM/DD/YYYY
ta: சரியான வடிவத்தில் உள்ள தேதியை MM/DD/YYYY இல் குறிப்பிடவும்

# gdpr.title
source: Birthday
ta: பிறந்த நாள்

# gdpr.description
source: The birthdays feature will store your birthdate until you delete it.
ta: பிறந்தநாள் நற்பொருத்தம் உங்கள் பிறந்த தேதியை நீக்கும் வரை சேமிக்கும்.

# gdpr.sharing.description
source: Your birthdate will be available to all other users of the bot
ta: உங்கள் பிறந்த தேதி போட் மற்ற அனைத்து பயனர்களுக்கும் கிடைக்கும்

# commands.birthday.set.timeout
source: You took too long
ta: நீங்கள் அதிக நேரம் எடுத்தீர்கள்

# commands.birthday.delete
source: You successfully deleted your birthday.
ta: உங்கள் பிறந்தநாளை வெற்றிகரமாக நீக்கிவிட்டீர்கள்.

# commands.settings.name
source: birthday-settings
ta: பிறந்தநாள் தீர்வு

# commands.settings.description
source: Configures your birthday settings
ta: உங்கள் பிறந்தநாள் அமைப்புகளை உள்ளமைக்கிறது

# commands.settings.arguments.channel.name
source: channel
ta: வாய்க்கால்

# commands.settings.arguments.channel.description
source: The channel to send messages in
ta: செய்திகளை அனுப்ப சேனல்

# commands.settings.arguments.message.name
source: message
ta: செய்தி

# commands.settings.arguments.message.description
source: The message to send on someone's birthday (you can use the placeholders %age% and %user%)
ta: ஒருவரின் பிறந்தநாளை அனுப்புவதற்கான செய்தி (நீங்கள் பிளேச்ஓல்டர்களைப் பயன்படுத்தலாம் %வயது %மற்றும் %பயனர் %)

# commands.settings.success
source: Settings were successfully updated
ta: அமைப்புகள் வெற்றிகரமாக புதுப்பிக்கப்பட்டன
