Repository: 247i/TACETr
Catalog: உரை/தானி/mindful-attention-awareness-scale-app-main-*.po
Languages: ta

# app_name
source: Mindful Attention Awareness Scale
ta: மனம் கவனம் விழிப்புணர்வு அளவு

# description
source: The MAAS is a 15-item scale designed to assess a core characteristic of dispositional mindfulness, namely, open or receptive awareness of and attention to what is taking place in the present. The scale shows strong psychometric properties and has been validated with college, community, and cancer patient samples. Correlational, quasi-experimental, and laboratory studies have shown that the MAAS taps a unique quality of consciousness that is related to, and predictive of, a variety of self-regulation and well-being constructs. The measure takes 10 minutes or less to complete.
ta: MAAS என்பது 15-உருப்படி அளவுகோலாகும், இது மனநிலை நினைவாற்றலின் முக்கிய பண்புகளை மதிப்பிடுவதற்காக வடிவமைக்கப்பட்டுள்ளது, அதாவது திறந்த அல்லது ஏற்றுக்கொள்ளும் விழிப்புணர்வு மற்றும் தற்போது என்ன நடக்கிறது என்பதில் கவனம் செலுத்துதல். இந்த அளவு வலுவான சைக்கோமெட்ரிக் பண்புகளைக் காட்டுகிறது மற்றும் கல்லூரி, சமூகம் மற்றும் புற்றுநோய் நோயாளி மாதிரிகள் மூலம் சரிபார்க்கப்பட்டது. தொடர்பு, அரை-சோதனை மற்றும் ஆய்வக ஆய்வுகள், பலவிதமான தன்வய கட்டுப்பாடு மற்றும் நல்வாழ்வு கட்டுமானங்களுடன் தொடர்புடைய மற்றும் முன்னறிவிக்கும் நனவின் தனித்துவமான தரத்தைத் தட்டுகின்றன என்பதைக் காட்டுகின்றன. இந்த நடவடிக்கை முடிக்க 10 நிமிடங்கள் அல்லது அதற்கும் குறைவாக ஆகும்.

# button_start_pretest
source: Measure your level of mindfulness
ta: உங்கள் நினைவாற்றல் அளவை அளவிடவும்

# pretest_title
source: Day-to-Day Experiences
ta: அன்றாட அனுபவங்கள்

# pretest_description
source: A collection of statements about your everyday experience follows. Using the 1–6 scale below, please indicate how frequently or infrequently you currently have each experience. Please answer according to what really reflects your experience rather than what you think your experience should be. Please treat each item separately from every other item.
ta: உங்கள் அன்றாட அனுபவத்தைப் பற்றிய அறிக்கைகளின் தொகுப்பு பின்வருமாறு. கீழே உள்ள 1–6 அளவைப் பயன்படுத்தி, தற்போது ஒவ்வொரு அனுபவமும் எவ்வளவு அடிக்கடி அல்லது அரிதாகவே உள்ளது என்பதைக் குறிக்கவும். உங்கள் பட்டறிவு இருக்க வேண்டும் என்று நீங்கள் நினைப்பதை விட உங்கள் அனுபவத்தை உண்மையில் பிரதிபலிப்பதற்கு ஏற்ப பதிலளிக்கவும். ஒவ்வொரு உருப்படியையும் மற்ற எல்லா பொருள்களிலிருந்தும் தனித்தனியாக நடத்துங்கள்.

# button_start_test
source: Start
ta: தொடங்கு

# statement01
source: I could be experiencing some emotion and not be conscious of it until some time later.
ta: நான் சில உணர்ச்சிகளை அனுபவிக்க முடியும், சிறிது நேரம் கழித்து அதை அறிந்திருக்கவில்லை.

# statement02
source: I break or spill things because of carelessness, not paying attention, or thinking of something else.
ta: கவனக்குறைவு, கவனம் செலுத்தாமல், அல்லது வேறு எதையாவது நினைப்பதால் நான் விசயங்களை உடைக்கிறேன் அல்லது கொட்டுகிறேன்.

# statement03
source: I find it difficult to stay focused on what’s happening in the present.
ta: தற்போது என்ன நடக்கிறது என்பதில் கவனம் செலுத்துவது கடினம்.

# statement04
source: I tend to walk quickly to get where I’m going without paying attention to what I experience along the way.
ta: வழியில் நான் அனுபவிப்பதில் கவனம் செலுத்தாமல் நான் எங்கு செல்கிறேன் என்பதைப் பெற விரைவாக நடக்க முனைகிறேன்.

# statement05
source: I tend not to notice feelings of physical tension or discomfort until they really grab my attention.
ta: அவர்கள் என் கவனத்தை ஈர்க்கும் வரை உடல் பதற்றம் அல்லது அச om கரியம் போன்ற உணர்வுகளை நான் கவனிக்கவில்லை.

# statement06
source: I forget a person’s name almost as soon as I’ve been told it for the first time.
ta: ஒரு நபரின் பெயரை நான் முதல் முறையாகச் சொன்னவுடன் மறந்துவிட்டேன்.

# statement07
source: It seems I am “running on automatic,” without much awareness of what I’m doing.
ta: நான் என்ன செய்கிறேன் என்பது குறித்த விழிப்புணர்வு இல்லாமல் நான் “தானியங்கி முறையில் இயங்குகிறேன்” என்று தெரிகிறது.

# statement08
source: I rush through activities without being really attentive to them.
ta: நான் அவர்களுக்கு உண்மையிலேயே கவனம் செலுத்தாமல் நடவடிக்கைகளை விரைகிறேன்.

# statement09
source: I get so focused on the goal I want to achieve that I lose touch with what I’m doing right now to get there.
ta: நான் அடைய விரும்பும் இலக்கில் நான் மிகவும் கவனம் செலுத்துகிறேன், அங்கு செல்வதற்கு நான் இப்போது என்ன செய்கிறேன் என்பதோடு தொடர்பை இழக்கிறேன்.

# statement10
source: I do jobs or tasks automatically, without being aware of what I’m doing.
ta: நான் என்ன செய்கிறேன் என்பதை அறியாமல், நான் தானாகவே வேலைகள் அல்லது பணிகளைச் செய்கிறேன்.

# statement11
source: I find myself listening to someone with one ear, doing something else at the same time.
ta: ஒரு காதுடன் ஒருவரைக் கேட்பது, ஒரே நேரத்தில் வேறு ஏதாவது செய்கிறேன்.

# statement12
source: I drive places on ‘automatic pilot’ and then wonder why I went there.
ta: நான் ‘தானியங்கி பைலட்டில்’ இடங்களை ஓட்டுகிறேன், பின்னர் நான் ஏன் அங்கு சென்றேன் என்று ஆச்சரியப்படுகிறேன்.

# statement13
source: I find myself preoccupied with the future or the past.
ta: எதிர்காலம் அல்லது கடந்த காலங்களில் நான் ஆர்வமாக இருப்பதைக் காண்கிறேன்.

# statement14
source: I find myself doing things without paying attention.
ta: கவனம் செலுத்தாமல் நான் விசயங்களைச் செய்கிறேன்.

# statement15
source: I snack without being aware that I’m eating.
ta: நான் சாப்பிடுகிறேன் என்பதை அறியாமல் சிற்றுண்டி.

# radio1
source: Almost always
ta: கிட்டத்தட்ட எப்போதும்

# radio2
source: Very frequently
ta: மிக அடிக்கடி

# radio3
source: Somewhat frequently
ta: ஓரளவு அடிக்கடி

# radio4
source: Somewhat infrequently
ta: சற்றே அரிதாக

# radio5
source: Very infrequently
ta: மிகவும் அரிதாக

# radio6
source: Almost never
ta: கிட்டத்தட்ட ஒருபோதும் இல்லை

source: Back
ta: பின்

source: Next
ta: அடுத்தது

# score_text
source: Your score is:
ta: உங்கள் மதிப்பெண்:

# about_score
source: About the score
ta: மதிப்பெண் பற்றி

# retake_test
source: Retake the test
ta: சோதனையை மீண்டும் பெறுங்கள்

# become_more_mindfull
source: Become more mindful. Install our app with free meditation audio guides.
ta: மேலும் கவனத்துடன் இருங்கள். இலவச தியான ஆடியோ வழிகாட்டிகளுடன் எங்கள் பயன்பாட்டை நிறுவவும்.

source: Learn more
ta: மேலும் அறிக
