Repository: 247i/TACETr
Catalog: உரை/தானி/mixxxdj_mixxx2-5_*.po
Languages: ta

source: Send
ta: அனுப்பு

source: How much of the signal to send into the delay buffer
ta: தாமத இடையகத்திற்கு எவ்வளவு சிக்னல் அனுப்ப வேண்டும்

source: Feedback
ta: பின்னூட்டம்

source: Stores the input signal in a temporary buffer and outputs it after a short time
ta: உள்ளீட்டு சிக்னலை ஒரு தற்காலிக இடையகத்தில் சேமித்து, சிறிது நேரத்திற்குப் பிறகு அதை வெளியிடுகிறது

source: Delay time 1/8 - 2 beats if tempo is detected 1/8 - 2 seconds if no tempo is detected
ta: தாமத நேரம் டெம்போ கண்டறியப்பட்டால் 1/8 - 2 துடிக்கிறது டெம்போ கண்டறியப்படவில்லை என்றால் 1/8 - 2 வினாடிகள்

source: Amount the echo fades each time it loops
ta: ஒவ்வொரு முறை லூப் செய்யும் போதும் எதிரொலி மங்கிவிடும்

source: How much the echoed sound bounces between the left and right sides of the stereo field
ta: ச்டீரியோ புலத்தின் இடது மற்றும் வலது பக்கங்களுக்கு இடையில் எதிரொலிக்கப்பட்ட ஒலி எவ்வளவு துள்ளுகிறது

# QObject#59
source: Quantize
ta: அளவிடு

source: Round the Time parameter to the nearest 1/4 beat.
ta: நேர அளவுருவை அருகிலுள்ள 1/4 துடிப்புக்குச் சுற்றவும்.

source: Triplets
ta: மும்மூர்த்திகள்

source: When the Quantize parameter is enabled, divide rounded 1/4 beats of Time parameter by 3.
ta: Quantize அளவுரு இயக்கப்பட்டால், வட்டமான 1/4 துடிப்பு நேர அளவுருவை 3 ஆல் வகுக்கவும்.

source: Filter
ta: வடிப்பி

source: Allows only high or low frequencies to play.
ta: அதிக அல்லது குறைந்த அதிர்வெண்களை மட்டுமே இயக்க அனுமதிக்கிறது.

source: Low Pass Filter Cutoff
ta: குறைந்த பாச் வடிகட்டி கட்ஆஃப்

source: LPF
ta: எல்பிஎஃப்

source: Corner frequency ratio of the low pass filter
ta: குறைந்த பாச் வடிகட்டியின் மூலை அதிர்வெண் விகிதம்

source: Q
ta: கே

source: Resonance of the filters Default: flat top
ta: வடிகட்டிகளின் அதிர்வு இயல்புநிலை: பிளாட் டாப்

source: High Pass Filter Cutoff
ta: உயர் பாச் வடிகட்டி கட்ஆஃப்

source: Corner frequency ratio of the high pass filter
ta: உயர் பாச் வடிகட்டியின் மூலை அதிர்வெண் விகிதம்

source: Depth
ta: ஆழம்

source: Flanger
ta: விளிம்புகள்

# QObject#75
source: Speed
ta: வேகம்

source: Manual
ta: கையேடு

source: Mixes the input with a delayed, pitch modulated copy of itself to create comb filtering
ta: சீப்பு வடிகட்டலை உருவாக்க, உள்ளீட்டை தாமதமான, பிட்ச் மாடுலேட்டட் நகலுடன் கலக்கிறது

source: Speed of the LFO (low frequency oscillator) 32 - 1/4 beats rounded to 1/2 beat per LFO cycle if tempo is detected 1/32 - 4 Hz if no tempo is detected
ta: LFO இன் விரைவு (குறைந்த அதிர்வெண் ஆசிலேட்டர்) டெம்போ கண்டறியப்பட்டால் 32 - 1/4 துடிப்புகள் ஒரு LFO சுழற்சிக்கு 1/2 பீட் வரை வட்டமிடப்படும் டெம்போ கண்டறியப்படவில்லை என்றால் 1/32 - 4 எர்ட்ச்

source: Delay amplitude of the LFO (low frequency oscillator)
ta: LFO இன் தாமத வீச்சு (குறைந்த அதிர்வெண் ஆசிலேட்டர்)

source: Delay offset of the LFO (low frequency oscillator). With width at zero, this allows for manually sweeping over the entire delay range.
ta: LFO (குறைந்த அதிர்வெண் ஆசிலேட்டர்) ஆஃப்செட் நேரந்தவறுகை. பூச்சியத்தில் அகலத்துடன், இது முழு தாமத வரம்பையும் கைமுறையாக ச்வீப் செய்ய அனுமதிக்கிறது.

source: Regeneration
ta: மீளுருவாக்கம்

source: Regen
ta: ரீசென்

source: How much of the delay output is feed back into the input
ta: தாமத வெளியீடு எவ்வளவு என்பது உள்ளீட்டில் திருப்பி அனுப்பப்படுகிறது

source: Intensity of the effect
ta: விளைவின் தீவிரம்

source: Divide rounded 1/2 beats of the Period parameter by 3.
ta: கால அளவுருவின் வட்டமான 1/2 துடிப்புகளை 3 ஆல் வகுக்கவும்.

# QObject#86
source: Mix
ta: கலக்கவும்

source: Width
ta: அகலம்

source: Metronome
ta: மெட்ரோனோம்

source: Adds a metronome click sound to the stream
ta: ச்ட்ரீமில் மெட்ரோனோம் சொடுக்கு ஒலியைச் சேர்க்கிறது

# QObject#90
source: BPM
ta: பிபிஎம்

source: Set the beats per minute value of the click sound
ta: சொடுக்கு ஒலியின் நிமிடத்திற்கு துடிப்பு மதிப்பை அமைக்கவும்

# QObject#92
source: Sync
ta: ஒத்திசை

source: Synchronizes the BPM with the track if it can be retrieved
ta: BPMஐ மீட்டெடுக்க முடிந்தால், டிராக்குடன் ஒத்திசைக்கிறது

source: Period
ta: காலசுழற்சி

source: Autopan
ta: ஆட்டோ பான்

source: Bounce the sound left and right across the stereo field
ta: ச்டீரியோ புலம் முழுவதும் ஒலியை இடது மற்றும் வலதுபுறமாகத் தள்ளுங்கள்

source: How fast the sound goes from one side to another 1/4 - 4 beats rounded to 1/2 beat if tempo is detected 1/4 - 4 seconds if no tempo is detected
ta: ஒலி ஒரு பக்கத்திலிருந்து மற்றொரு பக்கத்திற்கு எவ்வளவு வேகமாக செல்கிறது டெம்போ கண்டறியப்பட்டால் 1/4 - 4 துடிப்புகள் 1/2 துடிப்பாக வட்டமிடப்படும் டெம்போ கண்டறியப்படவில்லை என்றால் 1/4 - 4 வினாடிகள்

source: Smoothing
ta: மென்மையாக்கும்

source: Smooth
ta: மென்மையானது

source: How smoothly the signal goes from one side to the other
ta: சிக்னல் ஒரு பக்கத்திலிருந்து மறுபுறம் எவ்வளவு சீராக செல்கிறது

source: How far the signal goes to each side
ta: ஒவ்வொரு பக்கத்திற்கும் சமிக்ஞை எவ்வளவு தூரம் செல்கிறது

# QObject#102
source: Reverb
ta: பழமொழி

source: Emulates the sound of the signal bouncing off the walls of a room
ta: அறையின் சுவர்களில் இருந்து துள்ளிக் குதிக்கும் சிக்னலின் ஒலியைப் பின்பற்றுகிறது

source: Decay
ta: சிதைவு

source: Lower decay values cause reverberations to fade out more quickly.
ta: குறைந்த சிதைவு மதிப்புகள் அதிர்வுகளை விரைவாக மங்கச் செய்யும்.

source: Bandwidth of the low pass filter at the input. Higher values result in less attenuation of high frequencies.
ta: உள்ளீட்டில் குறைந்த பாச் வடிகட்டியின் அலைவரிசை. அதிக மதிப்புகள் அதிக அதிர்வெண்களின் குறைந்த தணிவை ஏற்படுத்துகின்றன.

source: How much of the signal to send in to the effect
ta: விளைவுக்கு எவ்வளவு சிக்னல் அனுப்ப வேண்டும்

source: Bandwidth
ta: பட்டை அகலம்

source: Damping
ta: ஒடுக்கல்

source: Higher damping values cause high frequencies to decay more quickly than low frequencies.
ta: அதிக தணிப்பு மதிப்புகள் குறைந்த அதிர்வெண்களை விட அதிக அதிர்வெண்கள் விரைவாக சிதைவதற்கு காரணமாகின்றன.

# QObject#112
source: Low
ta: குறைந்த

source: Gain for Low Filter
ta: குறைந்த வடிகட்டிக்கான ஆதாயம்

source: Kill Low
ta: லோ கில்

source: Kill the Low Filter
ta: குறைந்த வடிகட்டியைக் கொல்லுங்கள்

source: Mid
ta: நடு

source: Bessel4 LV-Mix Isolator
ta: பெசெல்4 எல்வி-மிக்ச் ஐசோலேட்டர்

source: Bessel4 ISO
ta: பெசெல்4 ஐஎச்ஓ

source: A Bessel 4th-order filter isolator with Lipshitz and Vanderkooy mix (bit perfect unity, roll-off -24 dB/octave).
ta: லிப்சிட்ச் மற்றும் வாண்டர்கூய் கலவையுடன் கூடிய பெச்சல் 4வது வரிசை வடிகட்டி ஐசோலேட்டர் (பிட் பெர்ஃபெக்ட் யூனிட்டி, ரோல்-ஆஃப் -24 டிபி/ஆக்டேவ்).

source: Gain for Mid Filter
ta: மிட் ஃபில்டருக்கு ஆதாயம்

source: Kill Mid
ta: கில் மிட்

source: Kill the Mid Filter
ta: மிட் ஃபில்டரைக் கொல்லுங்கள்

# QObject#123
source: High
ta: உயர்

source: Gain for High Filter
ta: உயர் வடிகட்டிக்கான ஆதாயம்

source: Kill High
ta: உயர் கொலை

source: Kill the High Filter
ta: உயர் வடிகட்டியைக் கொல்லுங்கள்

source: To adjust frequency shelves, go to Preferences -> Mixer.
ta: அதிர்வெண் அலமாரிகளை சரிசெய்ய, விருப்பத்தேர்வுகள் -> கலவைக்குச் செல்லவும்.

source: Graphic Equalizer
ta: கிராஃபிக் ஈக்வலைசர்

source: Graphic EQ
ta: கிராஃபிக் ஈக்யூ

source: An 8-band graphic equalizer based on biquad filters
ta: பைக்வாட் ஃபில்டர்களை அடிப்படையாகக் கொண்ட 8-பேண்ட் கிராஃபிக் ஈக்வலைசர்

source: Gain for Band Filter %1
ta: பேண்ட் வடிகட்டி% 1க்கான ஆதாயம்

source: Moog Ladder 4 Filter
ta: மூக் லேடர் 4 வடிகட்டி

source: Moog Filter
ta: மூக் வடிகட்டி

source: A 4-pole Moog ladder filter, based on Antti Houvilainen's non linear digital implementation
ta: 4-துருவ மூக் ஏணி வடிப்பான், ஆண்டி ஊவிலைனனின் நேரியல் அல்லாத டிசிட்டல் செயலாக்கத்தின் அடிப்படையில்

source: Res
ta: ரெச்

source: Resonance
ta: ஒத்திசை

source: Resonance of the filters. 4 = self oscillating
ta: வடிகட்டிகளின் அதிர்வு. 4 = தன்வய ஊசலாட்டம்

source: Gain for Low Filter (neutral at 1.0)
ta: குறைந்த வடிகட்டிக்கான ஆதாயம் (நடுநிலை 1.0)

source: Network stream
ta: பிணையம் ச்ட்ரீம்

source: Phaser
ta: பேசர்

# QObject#141
source: Stereo
ta: ச்டீரியோ

source: Stages
ta: நிலைகள்

source: Mixes the input signal with a copy passed through a series of all-pass filters to create comb filtering
ta: சீப்பு வடிகட்டலை உருவாக்க, ஆல்-பாச் வடிப்பான்களின் தொடர் வழியாக அனுப்பப்பட்ட நகலுடன் உள்ளீட்டு சிக்னலைக் கலக்கிறது

source: Period of the LFO (low frequency oscillator) 1/4 - 4 beats rounded to 1/2 beat if tempo is detected 1/4 - 4 seconds if no tempo is detected
ta: LFO இன் காலம் (குறைந்த அதிர்வெண் ஆசிலேட்டர்) டெம்போ கண்டறியப்பட்டால் 1/4 - 4 துடிப்புகள் 1/2 துடிப்பாக வட்டமிடப்படும் டெம்போ கண்டறியப்படவில்லை என்றால் 1/4 - 4 வினாடிகள்

source: Controls how much of the output signal is looped
ta: வெளியீட்டு சமிக்ஞை எவ்வளவு வளையப்படுகிறது என்பதைக் கட்டுப்படுத்துகிறது

source: Range
ta: வீச்சு

source: Controls the frequency range across which the notches sweep.
ta: குறிப்புகள் துடைக்கும் அதிர்வெண் வரம்பைக் கட்டுப்படுத்துகிறது.

source: Number of stages
ta: நிலைகளின் எண்ணிக்கை

source: Sets the LFOs (low frequency oscillators) for the left and right channels out of phase with each others
ta: இடது மற்றும் வலது சேனல்களுக்கு எல்எஃப்ஓக்களை (குறைந்த அதிர்வெண் ஆசிலேட்டர்கள்) அமைக்கிறது.

source: %1 minutes
ta: % 1 நிமிடங்கள்

source: Bessel8 LV-Mix Isolator
ta: பெசெல்8 எல்வி-மிக்ச் ஐசோலேட்டர்

source: Bessel8 ISO
ta: பெசெல்8 ஐஎச்ஓ

source: A Bessel 8th-order filter isolator with Lipshitz and Vanderkooy mix (bit perfect unity, roll-off -48 dB/octave).
ta: லிப்சிட்ச் மற்றும் வாண்டர்கூய் கலவையுடன் கூடிய பெசல் 8வது வரிசை வடிகட்டி தனிமைப்படுத்தி (பிட் பெர்ஃபெக்ட் யூனிட்டி, ரோல்-ஆஃப் -48 டிபி/ஆக்டேவ்).

source: LinkwitzRiley8 Isolator
ta: Linkwitz Riley 8 ஐசோலேட்டர்

source: LR8 ISO
ta: LR8 அப்படி

source: A Linkwitz-Riley 8th-order filter isolator (optimized crossover, constant phase shift, roll-off -48 dB/octave).
ta: ஒரு Linkwitz-Riley 8வது-வரிசை வடிகட்டி தனிமைப்படுத்தி (உகந்த கிராச்ஓவர், நிலையான கட்ட மாற்றம், ரோல்-ஆஃப் -48 dB/ஆக்டேவ்).

source: A 3-band Equalizer with two biquad bell filters, a shelving high pass and kill switches.
ta: இரண்டு பைக்வாட் பெல் ஃபில்டர்களுடன் கூடிய 3-பேண்ட் ஈக்வலைசர், ஒரு செல்விங் ஐ பாச் மற்றும் கில் சுவிட்சுகள்.

source: Device not found
ta: சாதனம் கிடைக்கவில்லை

source: A 3-band Equalizer that combines an Equalizer and an Isolator circuit to offer gentle slopes and full kill.
ta: ஒரு 3-பேண்ட் ஈக்வலைசர், இது ஒரு ஈக்வலைசர் மற்றும் ஐசோலேட்டர் சர்க்யூட்டை இணைத்து மென்மையான சரிவுகளையும் முழு கில்களையும் வழங்குகிறது.

source: Loudness Contour
ta: உரத்த விளிம்பு

source: Loudness
ta: ஒலி

source: Amplifies low and high frequencies at low volumes to compensate for reduced sensitivity of the human ear.
ta: மனித காதுகளின் உணர்திறனைக் குறைக்க, குறைந்த அளவுகளில் குறைந்த மற்றும் அதிக அதிர்வெண்களைப் பெருக்கும்.

source: Set the gain of the applied loudness contour
ta: பயன்படுத்தப்பட்ட உரத்த விளிம்பின் ஆதாயத்தை அமைக்கவும்

source: Use Gain
ta: ஆதாயத்தைப் பயன்படுத்தவும்

source: Follow Gain Knob
ta: பெருக்கம் குமிழ் ஐப் பின்தொடரவும்

source: This stream is online for testing purposes!
ta: சோதனை நோக்கங்களுக்காக இந்த ச்ட்ரீம் ஆன்லைனில் உள்ளது!

source: Live Mix
ta: நேரடி கலவை

source: 16 bits
ta: 16 பிட்கள்

source: 24 bits
ta: 24 பிட்கள்

source: Bit depth
ta: பிட் ஆழம்

source: Bitrate Mode
ta: பிட்ரேட் பயன்முறை

source: 32 bits float
ta: 32 பிட்கள் மிதக்கும்

# QObject#186
source: Balance
ta: இருப்பு

source: Adjust the left/right balance and stereo width
ta: இடது/வலது சமநிலை மற்றும் ச்டீரியோ அகலத்தை சரிசெய்யவும்

source: Adjust balance between left and right channels
ta: இடது மற்றும் வலது சேனல்களுக்கு இடையில் சமநிலையை சரிசெய்யவும்

source: Mid/Side
ta: நடு/பக்க

source: Bypass Fr.
ta: பைபாச் Frp.

source: Bypass Frequency
ta: பைபாச் அதிர்வெண்

source: Stereo Balance
ta: ச்டீரியோ இருப்பு

source: Adjust stereo width by changing balance between middle and side of the signal. Fully left: mono Fully right: only side ambiance Center: does not change the original signal.
ta: சிக்னலின் நடுவிற்கும் பக்கத்திற்கும் இடையில் சமநிலையை மாற்றுவதன் மூலம் ச்டீரியோ அகலத்தை சரிசெய்யவும். முழுமையாக இடது: மோனோ முழுவதுமாக வலதுபுறம்: பக்க சூழல் மட்டுமே மையம்: அசல் சமிக்ஞையை மாற்றாது.

source: Frequencies below this cutoff are not adjusted in the stereo field
ta: இந்த வெட்டுக்கு கீழே உள்ள அதிர்வெண்கள் ச்டீரியோ புலத்தில் சரிசெய்யப்படவில்லை

source: Parametric Equalizer
ta: பாராமெட்ரிக் ஈக்வலைசர்

source: Param EQ
ta: பரம் ஈக்யூ

source: A gentle 2-band parametric equalizer based on biquad filters. It is designed as a complement to the steep mixing equalizers.
ta: பிகுவாட் ஃபில்டர்களை அடிப்படையாகக் கொண்ட மென்மையான 2-பேண்ட் அளவுரு சமநிலைப்படுத்தி. இது செங்குத்தான கலவை சமநிலைகளுக்கு ஒரு நிரப்பியாக வடிவமைக்கப்பட்டுள்ளது.

source: Gain 1
ta: ஆதாயம் 1

source: Gain for Filter 1
ta: வடிகட்டி 1 க்கான ஆதாயம்

source: Q 1
ta: கே 1

source: Controls the bandwidth of Filter 1. A lower Q affects a wider band of frequencies, a higher Q affects a narrower band of frequencies.
ta: வடிகட்டி 1 இன் அலைவரிசையைக் கட்டுப்படுத்துகிறது. குறைந்த Q ஆனது பரந்த அலைவரிசைகளை பாதிக்கிறது, அதிக Q ஆனது குறுகலான அலைவரிசையை பாதிக்கிறது.

source: Center 1
ta: நடுவண் 1

source: Center frequency for Filter 1, from 100 Hz to 14 kHz
ta: வடிகட்டி 1க்கான மைய அதிர்வெண், 100 எர்ட்ச் முதல் 14 கிலோஎர்ட்ச் வரை

source: Gain 2
ta: ஆதாயம் 2

source: Gain for Filter 2
ta: வடிகட்டி 2 க்கான ஆதாயம்

source: Q 2
ta: கே 2

source: Controls the bandwidth of Filter 2. A lower Q affects a wider band of frequencies, a higher Q affects a narrower band of frequencies.
ta: வடிகட்டி 2 இன் அலைவரிசையைக் கட்டுப்படுத்துகிறது. குறைந்த Q ஆனது பரந்த அலைவரிசைகளை பாதிக்கிறது, அதிக Q ஆனது குறுகலான அலைவரிசையை பாதிக்கிறது.

source: Center 2
ta: நடுவண் 2

source: Center frequency for Filter 2, from 100 Hz to 14 kHz
ta: வடிகட்டி 2க்கான மைய அதிர்வெண், 100 எர்ட்ச் முதல் 14 கிலோஎர்ட்ச் வரை

source: Tremolo
ta: ட்ரெமோலோ

source: Cycles the volume up and down
ta: ஒலியளவை மேலும் கீழும் சுழற்சி செய்கிறது

source: How much the effect changes the volume
ta: விளைவு எவ்வளவு ஒலியளவை மாற்றுகிறது

source: Rate
ta: மதிப்பிடவும்

source: Rate of the volume changes 4 beats - 1/8 beat if tempo is detected 1/4 Hz - 8 Hz if no tempo is detected
ta: ஒலி அளவு மாறுகிறது 4 துடிப்புகள் - டெம்போ கண்டறியப்பட்டால் 1/8 துடிப்பு டெம்போ கண்டறியப்படவில்லை என்றால் 1/4 எர்ட்ச் - 8 எர்ட்ச்

source: Width of the volume peak 10% - 90% of the effect period
ta: தொகுதி உச்சத்தின் அகலம் விளைவு காலத்தின் 10% - 90%

source: Shape of the volume modulation wave Fully left: Square wave Fully right: Sine wave
ta: தொகுதி மாடுலேசன் அலையின் வடிவம் முழுமையாக இடது: சதுர அலை முற்றிலும் சரி: சைன் அலை

source: When the Quantize parameter is enabled, divide the effect period by 3.
ta: Quantize அளவுரு இயக்கப்பட்டால், விளைவு காலத்தை 3 ஆல் வகுக்கவும்.

# QObject#218
source: Waveform
ta: அலைவடிவம், அலைப்படம்

source: Phase
ta: கட்டம்

source: Shifts the position of the volume peak within the period Fully left: beginning of the effect period Fully right: end of the effect period
ta: காலத்திற்குள் வால்யூம் உச்சத்தின் நிலையை மாற்றுகிறது முழுமையாக இடது: விளைவு காலத்தின் துவக்கம் முற்றிலும் சரி: விளைவு காலத்தின் முடிவு

source: Round the Rate parameter to the nearest whole division of a beat.
ta: விகித அளவுருவை ஒரு துடிப்பின் அருகிலுள்ள முழுப் பிரிவிற்குச் சுழற்று.

source: Triplet
ta: மும்மடங்கு

source: Queen Mary University London
ta: குயின் மேரி பல்கலைக்கழகம் லண்டன்

source: Queen Mary Tempo and Beat Tracker
ta: குயின் மேரி டெம்போ மற்றும் பீட் டிராக்கர்

source: Queen Mary Key Detector
ta: குயின் மேரி கீ டிடெக்டர்

source: SoundTouch BPM Detector (Legacy)
ta: சவுண்ட்டச் பிபிஎம் டிடெக்டர் (மரபு)

source: Constrained VBR
ta: கட்டுப்படுத்தப்பட்ட VBR

source: Full VBR (bitrate ignored)
ta: முழு VBR (பிட்ரேட் புறக்கணிக்கப்பட்டது)

source: White Noise
ta: வெண்ணிறைச்சல்

source: Mix white noise with the input signal
ta: உள்ளீட்டு சமிக்ஞையுடன் வெள்ளை இரைச்சலை கலக்கவும்

# QObject#232
source: Dry/Wet
ta: உலர்/ஈரமான

source: Crossfade the noise with the dry signal
ta: உலர் சிக்னலைக் கொண்டு சத்தத்தை கடக்கவும்

source: <html>Mixxx cannot record or stream in AAC or HE-AAC without the FDK-AAC encoder. In order to record or stream in AAC or AAC+, you need to download <b>libfdk-aac</b> and install it on your system.
ta: <html>FDK-AAC குறியாக்கி இல்லாமல் AAC அல்லது HE-AAC இல் Mixxx பதிவு செய்யவோ அல்லது ச்ட்ரீம் செய்யவோ முடியாது. AAC அல்லது AAC+ இல் பதிவு செய்ய அல்லது ச்ட்ரீம் செய்ய, நீங்கள் <b>libfdk-aac</b> ஐ பதிவிறக்கம் செய்து உங்கள் கணினியில் நிறுவ வேண்டும்.

source: The installed AAC encoding library does not support HE-AAC, only plain AAC. Configure a different encoding format in the preferences.
ta: நிறுவப்பட்ட AAC குறியாக்க நூலகம் HE-AAC ஐ ஆதரிக்காது, எளிய AAC மட்டுமே. விருப்பத்தேர்வுகளில் வேறுபட்ட குறியாக்க வடிவமைப்பை உள்ளமைக்கவும்.

source: MP3 encoding is not supported. Lame could not be initialized
ta: MP3 குறியாக்கம் ஆதரிக்கப்படவில்லை. நொண்டியை துவக்க முடியவில்லை

source: OGG recording is not supported. OGG/Vorbis library could not be initialized.
ta: OGG பதிவு ஆதரிக்கப்படவில்லை. OGG/Vorbis நூலகத்தை துவக்க முடியவில்லை.

source: encoder failure
ta: குறியாக்கி தோல்வி

source: Failed to apply the selected settings.
ta: தேர்ந்தெடுக்கப்பட்ட அமைப்புகளைப் பயன்படுத்துவதில் தோல்வி.

# QObject#240
source: Deck %1
ta: தளம்% 1

# QObject#241
source: Location
ta: இடம்

source: Playlist Export Failed
ta: பிளேலிச்ட் ஏற்றுமதி தோல்வி

source: Could not create file
ta: கோப்பை உருவாக்க முடியவில்லை

source: Readable text Export Failed
ta: படிக்கக்கூடிய உரை ஏற்றுமதி தோல்வியடைந்தது

source: Playlist Export Has Special Characters
ta: பிளேலிச்ட் ஏற்றுமதி சிறப்பு எழுத்துக்களைக் கொண்டுள்ளது

source: Some file paths in the playlist have special characters. These file paths will be encoded as absolute path URLs. Please select the m3u8 format for better and lossless exporting.
ta: பிளேலிச்ட்டில் உள்ள சில கோப்பு பாதைகள் சிறப்பு எழுத்துக்களைக் கொண்டுள்ளன. இந்த கோப்பு பாதைகள் முழுமையான பாதை URLகளாக குறியாக்கம் செய்யப்படும். சிறந்த மற்றும் இழப்பற்ற ஏற்றுமதிக்கு m3u8 வடிவமைப்பைத் தேர்ந்தெடுக்கவும்.

source: Pitch Shift
ta: பிட்ச் சிப்ட்

source: Raises or lowers the original pitch of a sound.
ta: ஒலியின் அசல் சுருதியை உயர்த்துகிறது அல்லது குறைக்கிறது.

source: Pitch
ta: குனிவு

source: The pitch shift applied to the sound.
ta: ஒலிக்கு சுருதி மாற்றம் பயன்படுத்தப்பட்டது.

source: The range of the Pitch knob (0 - 2 octaves).
ta: பிட்ச் குமிழியின் வரம்பு (0 - 2 ஆக்டேவ்கள்).

source: Semitones
ta: செமிடோன்கள்

source: Change the pitch in semitone steps instead of continuously.
ta: பிட்சை தொடர்ச்சியாக மாற்றுவதற்கு பதிலாக செமிடோன் படிகளில் மாற்றவும்.

source: Formant
ta: வடிவம்

source: Preserve the resonant frequencies (formants) of the human vocal tract and other instruments. Hint: compensates "chipmunk" or "growling" voices
ta: மனித குரல் பாதை மற்றும் பிற கருவிகளின் அதிர்வு அதிர்வெண்களை (வடிவமைப்பாளர்கள்) பாதுகாக்கவும். குறிப்பு: "சிப்மங்க்" அல்லது "குரல்" குரல்களை ஈடுசெய்கிறது

source: Distortion
ta: திரித்தல்

source: Hard Clip
ta: கடினமான கிளிப்

source: Hard
ta: கடினமான

source: Switches between soft saturation and hard clipping.
ta: மென்மையான செறிவு மற்றும் கடினமான கிளிப்பிங் இடையே மாறுகிறது.

source: Soft Clipping
ta: மென்மையான கிளிப்பிங்

source: Hard Clipping
ta: கடினமான கிளிப்பிங்

source: Drive
ta: ஓட்டு

source: The amount of amplification applied to the audio signal. At higher levels the audio will be more distored.
ta: ஆடியோ சிக்னலுக்குப் பயன்படுத்தப்படும் பெருக்கத்தின் அளவு. உயர் மட்டங்களில் ஆடியோ மிகவும் சிதைந்துவிடும்.

# QObject#264
source: Passthrough
ta: பாச்த்ரூ

source: Glitch
ta: தடுமாற்றம்

source: Periodically samples and repeats a small portion of audio to create a glitchy metallic sound.
ta: ஒரு தடுமாற்றமான உலோக ஒலியை உருவாக்க, அவ்வப்போது மாதிரிகள் மற்றும் ஆடியோவின் ஒரு சிறிய பகுதியை மீண்டும் செய்யவும்.

source: Round the Time parameter to the nearest 1/8 beat.
ta: நேர அளவுருவை அருகிலுள்ள 1/8 துடிப்புக்குச் சுற்றவும்.

source: When the Quantize parameter is enabled, divide rounded 1/8 beats of Time parameter by 3.
ta: Quantize அளவுரு இயக்கப்பட்டால், வட்டமான 1/8 துடிப்பு நேர அளவுருவை 3 ஆல் வகுக்கவும்.

source: (empty)
ta: (காலி)

# QObject#270
source: Sampler %1
ta: மாதிரி% 1

source: Compressor
ta: காற்றமுக்கி

source: Auto Makeup Gain
ta: ஆட்டோ மேக்கப் ஆதாயம்

source: Makeup
ta: ஒப்பனை

source: The Auto Makeup button enables automatic gain adjustment to keep the input signal and the processed output signal as close as possible in perceived loudness
ta: தானியங்கு ஒப்பனை பொத்தான் உள்ளீட்டு சிக்னலை வைத்திருக்க தானியங்கி ஆதாய சரிசெய்தலை செயல்படுத்துகிறது மற்றும் உணரப்பட்ட சத்தத்தில் முடிந்தவரை நெருக்கமாக செயலாக்கப்பட்ட வெளியீடு சமிக்ஞை

# QObject#275
source: Off
ta: அணை

source: On
ta: அன்று

source: Threshold (dBFS)
ta: வரம்பு (dBFS)

source: Threshold
ta: வாசல்

source: The Threshold knob adjusts the level above which the compressor starts attenuating the input signal
ta: த்ரெசோல்ட் குமிழ் கம்ப்ரசர் உள்ளீட்டு சிக்னலைக் குறைக்கத் தொடங்கும் அளவைச் சரிசெய்கிறது.

source: Ratio (:1)
ta: விகிதம் (:1)

source: Ratio
ta: விகிதம்

source: The Ratio knob determines how much the signal is attenuated above the chosen threshold. For a ratio of 4:1, one dB remains for every four dB of input signal above the threshold. At a ratio of 1:1 no compression is happening, as the input is exactly the output.
ta: விகித குமிழ் தேர்ந்தெடுக்கப்பட்ட வாசலுக்கு மேலே சமிக்ஞை எவ்வளவு குறைக்கப்படுகிறது என்பதை தீர்மானிக்கிறது. 4:1 என்ற விகிதத்தில், வாசலுக்கு மேலே உள்ள ஒவ்வொரு நான்கு dB உள்ளீட்டு சமிக்ஞைக்கும் ஒரு dB இருக்கும். 1:1 என்ற விகிதத்தில் எந்த சுருக்கமும் நடக்காது, ஏனெனில் உள்ளீடு சரியாக வெளியீடாகும்.

source: Knee (dBFS)
ta: முழங்கால் (dBFS)

source: Knee
ta: முழங்கால்

source: The Knee knob is used to achieve a rounder compression curve
ta: முழங்கால் குமிழ் ஒரு சுற்று சுருக்க வளைவை அடைய பயன்படுத்தப்படுகிறது

source: Attack (ms)
ta: தாக்குதல் (மிசி)

source: Attack
ta: தாக்குதல்

source: The Attack knob sets the time that determines how fast the compression will set in once the signal exceeds the threshold
ta: அட்டாக் குமிழ் எவ்வளவு விரைவாக சுருக்கத்தை தீர்மானிக்கிறது என்பதை தீர்மானிக்கிறது சமிக்ஞை வரம்பை மீறியதும் அமைக்கப்படும்

source: Release (ms)
ta: வெளியீடு (மிசி)

source: Release
ta: வெளியீடு

source: The Release knob sets the time that determines how fast the compressor will recover from the gain reduction once the signal falls under the threshold. Depending on the input signal, short release times may introduce a 'pumping' effect and/or distortion.
ta: வெளியீட்டு குமிழ் கம்ப்ரசர் எவ்வளவு விரைவாக ஆதாயத்திலிருந்து மீளும் என்பதை தீர்மானிக்கும் நேரத்தை அமைக்கிறது சமிக்ஞை வாசலின் கீழ் விழுந்தவுடன் குறைப்பு. உள்ளீட்டு சமிக்ஞையைப் பொறுத்து, குறுகிய வெளியீட்டு நேரங்கள் ஒரு 'பம்ப்' விளைவு மற்றும்/அல்லது சிதைவை அறிமுகப்படுத்தலாம்.

source: Level
ta: நிலை

source: The Level knob adjusts the level of the output signal after the compression was applied
ta: சுருக்கத்தைப் பயன்படுத்திய பிறகு, வெளியீட்டு சமிக்ஞையின் அளவை நிலை குமிழ் சரிசெய்கிறது

source: various
ta: பல்வேறு

# QtHSVWaveformWidget#1
source: HSV
ta: எச்.எச்.வி

# QtSimpleWaveformWidget#1
source: Simple
ta: எளிமையானது

# QtWaveformWidget#1
source: Filtered
ta: வடிகட்டப்பட்டது

# RecordingFeature#1
source: Recordings
ta: பதிவுகள்

source: Low Disk Space Warning
ta: குறைந்த வட்டு இடம் முன்னறிவிப்பு

source: There is less than 1 GiB of usable space in the recording folder
ta: ரெக்கார்டிங் கோப்புறையில் 1 சிபிக்கும் குறைவான பயன்படுத்தக்கூடிய இடம் உள்ளது

# RecordingManager#3
source: Recording
ta: பதிவு செய்தல்

source: Could not create audio file for recording!
ta: பதிவு செய்ய ஆடியோ கோப்பை உருவாக்க முடியவில்லை!

source: Ensure there is enough free disk space and you have write permission for the Recordings folder.
ta: போதுமான இலவச வட்டு இடம் இருப்பதையும், ரெக்கார்டிங்ச் கோப்புறைக்கு எழுத இசைவு இருப்பதையும் உறுதிப்படுத்தவும்.

source: You can change the location of the Recordings folder in Preferences -> Recording.
ta: விருப்பத்தேர்வுகள் -> ரெக்கார்டிங் என்பதில் பதிவுகள் கோப்புறையின் இருப்பிடத்தை மாற்றலாம்.

source: Rekordbox
ta: பதிவு பெட்டி

# RekordboxFeature#2
source: Playlists
ta: பிளேலிச்ட்கள்

source: Folders
ta: கோப்புறைகள்
