Repository: 247i/TACETr
Catalog: உரை/தானி/mixxxdj_mixxx2-5_*.po
Languages: ta

source: Microphone On/Off
ta: மைக்ரோஃபோன் ஆன்/ஆஃப்

source: Microphone on/off
ta: மைக்ரோஃபோன் ஆன்/ஆஃப்

source: Toggle microphone ducking mode (OFF, AUTO, MANUAL)
ta: மைக்ரோஃபோன் டக்கிங் பயன்முறையை நிலைமாற்று (ஆஃப், ஆட்டோ, மேனுவல்)

source: Auxiliary On/Off
ta: துணை ஆன்/ஆஃப்

source: Auxiliary on/off
ta: துணை ஆன்/ஆஃப்

# ControlPickerMenu#455
source: Auto DJ
ta: ஆட்டோ டி.சே

source: Auto DJ Shuffle
ta: ஆட்டோ டிசே சஃபிள்

source: Auto DJ Skip Next
ta: ஆட்டோ டிசே ச்கிப் நெக்ச்ட்

source: Auto DJ Add Random Track
ta: ஆட்டோ டிசே ரேண்டம் டிராக்கைச் சேர்க்கவும்

source: Add a random track to the Auto DJ queue
ta: ஆட்டோ டிசே வரிசையில் ரேண்டம் டிராக்கைச் சேர்க்கவும்

source: Auto DJ Fade To Next
ta: ஆட்டோ டிசே ஃபேட் டு நெக்ச்ட்

source: Trigger the transition to the next track
ta: அடுத்த பாதைக்கு மாற்றத்தை தூண்டவும்

source: User Interface
ta: பயனர் இடைமுகம்

source: Samplers Show/Hide
ta: மாதிரிகள் காட்டு/மறை

source: Show/hide the sampler section
ta: மாதிரிப் பகுதியைக் காட்டு/மறை

source: Microphone && Auxiliary Show/Hide
ta: மைக்ரோஃபோன் && துணைக் காட்சி/மறை

source: Waveform Zoom Reset To Default
ta: அலைவடிவம் பெரிதாக்கு இயல்புநிலைக்கு மீட்டமைக்கவும்

source: Reset the waveform zoom level to the default value selected in Preferences -> Waveforms
ta: விருப்பத்தேர்வுகள் -> அலைவடிவங்களில் தேர்ந்தெடுக்கப்பட்ட இயல்புநிலை மதிப்புக்கு அலைவடிவ சூம் அளவை மீட்டமைக்கவும்

source: Select the next color in the color palette for the loaded track.
ta: ஏற்றப்பட்ட பாதைக்கு வண்ணத் தட்டில் அடுத்த வண்ணத்தைத் தேர்ந்தெடுக்கவும்.

source: Select previous color in the color palette for the loaded track.
ta: ஏற்றப்பட்ட பாதைக்கு வண்ணத் தட்டுகளில் முந்தைய வண்ணத்தைத் தேர்ந்தெடுக்கவும்.

source: Navigate Through Track Colors
ta: ட்ராக் வண்ணங்கள் வழியாக செல்லவும்

source: Select either next or previous color in the palette for the loaded track.
ta: ஏற்றப்பட்ட பாதையில் தட்டில் அடுத்த அல்லது முந்தைய வண்ணத்தைத் தேர்ந்தெடுக்கவும்.

source: Start/Stop Live Broadcasting
ta: நேரடி ஒளிபரப்பைத் தொடங்கவும்/நிறுத்தவும்

# ControlPickerMenu#473
source: Stream your mix over the Internet.
ta: இணையத்தில் உங்கள் கலவையை ச்ட்ரீம் செய்யவும்.

source: Start/stop recording your mix.
ta: உங்கள் கலவையைப் பதிவுசெய்யத் தொடங்கவும்/நிறுத்தவும்.

source: Samplers
ta: மாதிரிகள்

source: Vinyl Control Show/Hide
ta: வினைல் கட்டுப்பாடு காட்சி/மறை

source: Show/hide the vinyl control section
ta: வினைல் கட்டுப்பாட்டுப் பிரிவைக் காட்டு/மறை

source: Preview Deck Show/Hide
ta: முன்னோட்ட டெக் சோ/மறை

source: Show/hide the preview deck
ta: முன்னோட்ட டெக்கைக் காட்டு/மறை

# ControlPickerMenu#480
source: Toggle 4 Decks
ta: 4 அடுக்குகளை மாற்றவும்

# ControlPickerMenu#481
source: Switches between showing 2 decks and 4 decks.
ta: 2 டெக்குகள் மற்றும் 4 டெக்குகளைக் காட்டும் இடையே மாறுகிறது.

source: Cover Art Show/Hide (Decks)
ta: கவர் ஆர்ட் சோ/மறை (டெக்கள்)

source: Show/hide cover art in the main decks
ta: முக்கிய தளங்களில் கவர் கலையைக் காட்டு/மறை

source: Vinyl Spinner Show/Hide
ta: வினைல் ச்பின்னர் சோ/மறை

source: Show/hide spinning vinyl widget
ta: சுழலும் வினைல் விட்செட்டைக் காட்டு/மறை

source: Vinyl Spinners Show/Hide (All Decks)
ta: வினைல் ச்பின்னர்கள் காட்சி/மறை (அனைத்து தளங்களும்)

source: Show/Hide all spinnies
ta: அனைத்து ச்பின்னிகளையும் காட்டு/மறை

source: Toggle Waveforms
ta: அலைவடிவங்களை நிலைமாற்று

source: Show/hide the scrolling waveforms.
ta: ச்க்ரோலிங் அலைவடிவங்களைக் காட்டு/மறை.

source: Waveform zoom
ta: அலைவடிவம் பெரிதாக்குதல்

# ControlPickerMenu#491
source: Waveform Zoom
ta: அலைவடிவம் பெரிதாக்கு

source: Zoom waveform in
ta: அலைவடிவத்தை பெரிதாக்கவும்

# ControlPickerMenu#493
source: Waveform Zoom In
ta: அலைவடிவம் பெரிதாக்கவும்

source: Zoom waveform out
ta: அலைவடிவத்தை பெரிதாக்கவும்

source: Star Rating Up
ta: ச்டார் ரேட்டிங் அப்

source: Increase the track rating by one star
ta: டிராக் மதிப்பீட்டை ஒரு நட்சத்திரத்தால் அதிகரிக்கவும்

source: Star Rating Down
ta: நட்சத்திர மதிப்பீடு குறைவு

source: Decrease the track rating by one star
ta: டிராக் மதிப்பீட்டை ஒரு நட்சத்திரத்தால் குறைக்கவும்

# ControllerInputMappingTableModel#1
source: Channel
ta: வாய்க்கால்

# ControllerInputMappingTableModel#2
source: Opcode
ta: ஆப்கோட்

# ControllerInputMappingTableModel#3
source: Control
ta: கட்டுப்பாடு

source: Options
ta: விருப்பங்கள்

# ControllerInputMappingTableModel#5
source: Action
ta: செயல்

# ControllerInputMappingTableModel#6
source: Comment
ta: கருத்து

# ControllerOutputMappingTableModel#1
source: Channel
ta: வாய்க்கால்

# ControllerOutputMappingTableModel#2
source: Opcode
ta: ஆப்கோட்

# ControllerOutputMappingTableModel#3
source: Control
ta: கட்டுப்பாடு

source: On Value
ta: மதிப்பில்

source: Off Value
ta: இனிய மதிப்பு

# ControllerOutputMappingTableModel#6
source: Action
ta: செயல்

source: On Range Min
ta: குறைந்தபட்ச வரம்பில்

source: On Range Max
ta: அதிகபட்ச வரம்பில்

# ControllerOutputMappingTableModel#9
source: Comment
ta: கருத்து

# ControllerScriptEngineBase#1
source: The functionality provided by this controller mapping will be disabled until the issue has been resolved.
ta: இந்த கன்ட்ரோலர் மேப்பிங்கால் வழங்கப்படும் செயல்பாடு, சிக்கல் தீர்க்கப்படும் வரை முடக்கப்படும்.

source: You can ignore this error for this session but you may experience erratic behavior.
ta: இந்த அமர்வில் இந்தப் பிழையை நீங்கள் புறக்கணிக்கலாம், ஆனால் நீங்கள் ஒழுங்கற்ற நடத்தையை அனுபவிக்கலாம்.

source: Try to recover by resetting your controller.
ta: உங்கள் கட்டுப்படுத்தியை மீட்டமைப்பதன் மூலம் மீட்டெடுக்க முயற்சிக்கவும்.

source: Controller Mapping Error
ta: கன்ட்ரோலர் மேப்பிங் பிழை

source: The mapping for your controller "%1" is not working properly.
ta: உங்கள் கட்டுப்படுத்தி "% 1"க்கான மேப்பிங் சரியாக வேலை செய்யவில்லை.

source: The script code needs to be fixed.
ta: ச்கிரிப்ட் குறியீடு சரிசெய்யப்பட வேண்டும்.

source: Controller Mapping File Problem
ta: கன்ட்ரோலர் மேப்பிங் கோப்பு சிக்கல்

source: The mapping for controller "%1" cannot be opened.
ta: கட்டுப்படுத்தி "% 1"க்கான மேப்பிங்கை திறக்க முடியாது.

# ControllerScriptEngineLegacy#3
source: The functionality provided by this controller mapping will be disabled until the issue has been resolved.
ta: இந்த கன்ட்ரோலர் மேப்பிங்கால் வழங்கப்படும் செயல்பாடு, சிக்கல் தீர்க்கப்படும் வரை முடக்கப்படும்.

source: File:
ta: கோப்பு:

source: Error:
ta: பிழை:

source: Error while copying the cover art to: %1
ta: அட்டைப்படத்தை நகலெடுப்பதில் பிழை: % 1

# CrateFeature#1
source: Remove
ta: நீக்குக

# CrateFeature#2
source: Create New Crate
ta: புதிய கூட்டை உருவாக்கவும்

# CrateFeature#3
source: Rename
ta: மறுபெயரிடுக

# CrateFeature#4
source: Lock
ta: பூட்டு

source: Export Crate as Playlist
ta: க்ரேட்டை பிளேலிச்ட்டாக ஏற்றுமதி செய்யவும்

# CrateFeature#6
source: Export Track Files
ta: ட்ராக் கோப்புகளை ஏற்றுமதி செய்யவும்

# CrateFeature#7
source: Duplicate
ta: நகல்

source: Analyze entire Crate
ta: முழு கிரேட்டையும் பகுப்பாய்வு செய்யுங்கள்

source: Auto DJ Track Source
ta: ஆட்டோ டிசே ட்ராக் சான்று

source: Enter new name for crate:
ta: கூட்டிற்கு புதிய பெயரை உள்ளிடவும்:

# CrateFeature#11
source: Crates
ta: கிரேட்ச்

source: Import Crate
ta: இறக்குமதி க்ரேட்

source: Export Crate
ta: ஏற்றுமதி கிரேட்

# CrateFeature#14
source: Unlock
ta: திறக்கவும்

# CrateFeature#15
source: An unknown error occurred while creating crate:
ta: க்ரேட்டை உருவாக்கும் போது அறியப்படாத பிழை ஏற்பட்டது:

source: Rename Crate
ta: Crate என மறுபெயரிடவும்

source: Make a crate for your next gig, for your favorite electrohouse tracks, or for your most requested tracks.
ta: உங்கள் அடுத்த கிக், உங்களுக்குப் பிடித்த எலக்ட்ரோஅவுச் டிராக்குகள் அல்லது நீங்கள் அதிகம் கோரப்பட்ட டிராக்குகளுக்கு ஒரு கூட்டை உருவாக்கவும்.

# CrateFeature#18
source: Confirm Deletion
ta: நீக்குதலை உறுதிப்படுத்தவும்

source: Renaming Crate Failed
ta: பெட்டியை மறுபெயரிடுவதில் தோல்வி

# CrateFeature#20
source: Crate Creation Failed
ta: க்ரேட் உருவாக்கம் தோல்வியடைந்தது

# CrateFeature#21
source: M3U Playlist (*.m3u);;M3U8 Playlist (*.m3u8);;PLS Playlist (*.pls);;Text CSV (*.csv);;Readable Text (*.txt)
ta: M3U பிளேலிச்ட் (*.m3u);;M3U8 பிளேலிச்ட் (*.m3u8);;PLS பிளேலிச்ட் (*.pls);;உரை காபிம (*.csv);; படிக்கக்கூடிய உரை (*.txt)

# CrateFeature#22
source: M3U Playlist (*.m3u)
ta: M3U பிளேலிச்ட் (*.m3u)

source: Crates are a great way to help organize the music you want to DJ with.
ta: நீங்கள் DJ செய்ய விரும்பும் இசையை ஒழுங்கமைக்க உதவும் கிரேட்கள் ஒரு சிறந்த வழியாகும்.

# CrateFeature#24
source: Export to Engine DJ
ta: இன்சின் DJ க்கு ஏற்றுமதி செய்யவும்

source: Crates let you organize your music however you'd like!
ta: நீங்கள் விரும்பியபடி உங்கள் இசையை ஒழுங்கமைக்க கிரேட்ச் உங்களை அனுமதிக்கிறது!

source: Do you really want to delete crate <b>%1</b>?
ta: க்ரேட் <b>%1</b>ஐ நீக்க வேண்டுமா?

# CrateFeature#27
source: A crate cannot have a blank name.
ta: ஒரு பெட்டிக்கு வெற்று பெயர் இருக்கக்கூடாது.

# CrateFeature#28
source: A crate by that name already exists.
ta: அந்தப் பெயரில் ஒரு பெட்டி ஏற்கனவே உள்ளது.

source: New Crate
ta: புதிய கிரேட்

# CrateFeatureHelper#2
source: Create New Crate
ta: புதிய கூட்டை உருவாக்கவும்

source: Enter name for new crate:
ta: புதிய பெட்டிக்கான பெயரை உள்ளிடவும்:

source: Creating Crate Failed
ta: கூட்டை உருவாக்குவது தோல்வியடைந்தது

# CrateFeatureHelper#5
source: A crate cannot have a blank name.
ta: ஒரு பெட்டிக்கு வெற்று பெயர் இருக்கக்கூடாது.

# CrateFeatureHelper#6
source: A crate by that name already exists.
ta: அந்தப் பெயரில் ஒரு பெட்டி ஏற்கனவே உள்ளது.

# CrateFeatureHelper#7
source: An unknown error occurred while creating crate:
ta: க்ரேட்டை உருவாக்கும் போது அறியப்படாத பிழை ஏற்பட்டது:

# //:
source: copy
ta: நகலெடு

source: Duplicate Crate
ta: டூப்ளிகேட் க்ரேட்

source: Duplicating Crate Failed
ta: நகல் உருவாக்கம் தோல்வியடைந்தது

source: Mixxx %1.%2 Development Team
ta: Mixxx % 1.% 2 மேம்பாட்டுக் குழு

source: With contributions from:
ta: பங்களிப்புகளுடன்:

source: And special thanks to:
ta: மற்றும் சிறப்பு நன்றி:

source: Past Developers
ta: கடந்த உருவாக்குபவர்கள்

source: Past Contributors
ta: கடந்தகால பங்களிப்பாளர்கள்

source: Official Website
ta: அதிகாரப்பூர்வ இணையதளம்

source: Donate
ta: நன்கொடை

source: About Mixxx
ta: Mixxx பற்றி

# DlgAboutDlg#2
source: Unknown
ta: தெரியவில்லை

source: Date:
ta: தேதி:

source: Git Version:
ta: Git பதிப்பு:

source: Qt Version:
ta: கியுடி பதிப்பு:

source: Platform:
ta: மேடை:

source: Credits
ta: வரவு

source: License
ta: உரிமம்

# DlgAnalysis#1
source: Analyze
ta: பகுப்பாய்வு செய்யவும்

source: Shows tracks added to the library within the last 7 days.
ta: கடந்த 7 நாட்களுக்குள் நூலகத்தில் சேர்க்கப்பட்ட தடங்களைக் காட்டுகிறது.

source: New
ta: புதிய

source: Shows all tracks in the library.
ta: நூலகத்தில் உள்ள அனைத்து தடங்களையும் காட்டுகிறது.

# DlgAnalysis#5
source: All
ta: அனைத்தும்

source: Progress
ta: முன்னேற்றம்

# DlgAnalysis#7
source: Selects all tracks in the table below.
ta: கீழே உள்ள அட்டவணையில் உள்ள அனைத்து தடங்களையும் தேர்ந்தெடுக்கிறது.

# DlgAnalysis#8
source: Select All
ta: அனைத்தையும் தெரிவுசெய்

source: Runs beatgrid, key, and ReplayGain detection on the selected tracks. Does not generate waveforms for the selected tracks to save disk space.
ta: தேர்ந்தெடுக்கப்பட்ட டிராக்குகளில் பீட்கிரிட், கீ மற்றும் ரீப்ளேகெய்ன் கண்டறிதலை இயக்குகிறது. வட்டு இடத்தை சேமிக்க தேர்ந்தெடுக்கப்பட்ட தடங்களுக்கு அலைவடிவங்களை உருவாக்காது.

source: Stop Analysis
ta: பகுப்பாய்வை நிறுத்து

source: Analyzing %1% %2/%3
ta: பகுப்பாய்வு % 1% % 2/% 3

source: Analyzing %1/%2
ta: % 1/%2 ஐ பகுப்பாய்வு செய்கிறது

source: Skip
ta: தவிர்

source: Random
ta: சீரற்ற

source: Fade
ta: மங்காது

source: Enable Auto DJ Shortcut: Shift+F12
ta: ஆட்டோ டிசேயை இயக்கு குறுக்குவழி: Shift+F12

source: Disable Auto DJ Shortcut: Shift+F12
ta: ஆட்டோ டிசேயை முடக்கு குறுக்குவழி: Shift+F12

source: Trigger the transition to the next track Shortcut: Shift+F11
ta: அடுத்த பாதைக்கு மாற்றத்தை தூண்டவும் குறுக்குவழி: Shift+F11

source: Skip the next track in the Auto DJ queue Shortcut: Shift+F10
ta: ஆட்டோ டிசே வரிசையில் அடுத்த ட்ராக்கைத் தவிர்க்கவும் குறுக்குவழி: Shift+F10

source: Shuffle the content of the Auto DJ queue Shortcut: Shift+F9
ta: ஆட்டோ டிசே வரிசையின் உள்ளடக்கத்தை கலக்கவும் குறுக்குவழி: Shift+F9

source: Repeat the playlist
ta: பிளேலிச்ட்டை மீண்டும் செய்யவும்

source: Determines the duration of the transition
ta: மாற்றத்தின் காலத்தை தீர்மானிக்கிறது

source: Seconds
ta: நொடிகள்

source: Full Intro + Outro
ta: முழு அறிமுகம் + அவுட்ரோ

source: Fade At Outro Start
ta: அவுட்ரோ தொடக்கத்தில் மங்காது

source: Full Track
ta: முழு ட்ராக்

source: Skip Silence
ta: அமைதி தவிர்க்கவும்

source: Decks not used for Auto DJ must be stopped to enable Auto DJ mode.
ta: ஆட்டோ டிசே பயன்முறையை இயக்க, ஆட்டோ டிசேக்கு பயன்படுத்தப்படாத டெக்குகள் நிறுத்தப்பட வேண்டும்.

source: Auto DJ Fade Modes Full Intro + Outro: Play the full intro and outro. Use the intro or outro length as the crossfade time, whichever is shorter. If no intro or outro are marked, use the selected crossfade time. Fade At Outro Start: Start crossfading at the outro start. If the outro is longer than the intro, cut off the end of the outro. Use the intro or outro length as the crossfade time, whichever is shorter. If no intro or outro are marked, use the selected crossfade time. Full Track: Play the whole track. Begin crossfading from the selected number of seconds before the end of the track. A negative crossfade time adds silence between tracks. Skip Silence: Play the whole track except for silence at the beginning and end. Begin crossfading from the selected number of seconds before the last sound.
ta: ஆட்டோ டிசே ஃபேட் முறைகள் முழு அறிமுகம் + அவுட்ரோ: முழு அறிமுகத்தையும் அவுட்ரோவையும் விளையாடுங்கள். அறிமுகம் அல்லது வெளி நீளத்தை பயன்படுத்தவும் குறுக்குவழி நேரம், எது குறைவாக இருந்தாலும். அறிமுகம் அல்லது வெளியீடு எதுவும் குறிக்கப்படவில்லை என்றால், தேர்ந்தெடுக்கப்பட்ட குறுக்குவழி நேரத்தை பயன்படுத்தவும். அவுட்ரோ தொடக்கத்தில் மங்குதல்: வெளிப்புற தொடக்கத்தில் குறுக்குவழியைத் தொடங்கவும். அவுட்ரோவை விட நீளமாக இருந்தால் அறிமுகம், அவுட்ரோவின் முடிவை துண்டிக்கவும். அறிமுகம் அல்லது வெளி நீளத்தை இவ்வாறு பயன்படுத்தவும் குறுக்குவழி நேரம், எது குறைவாக இருந்தாலும். அறிமுகமோ வெளியோ இல்லை என்றால் குறிக்கப்பட்டது, தேர்ந்தெடுக்கப்பட்ட கிராச்ஃபேட் நேரத்தைப் பயன்படுத்தவும். முழு ட்ராக்: முழு டிராக்கையும் விளையாடுங்கள். தேர்ந்தெடுக்கப்பட்ட எண்ணிலிருந்து குறுக்குவழியைத் தொடங்குங்கள் பாதை முடிவதற்கு சில வினாடிகளுக்கு முன். எதிர்மறை குறுக்குவழி நேரம் சேர்க்கிறது தடங்களுக்கு இடையே அமைதி. மௌனத்தைத் தவிர்: துவக்கம் மற்றும் முடிவில் பேசாமை தவிர்த்து முழு ட்ராக்கையும் இயக்கவும். க்கு முன் தேர்ந்தெடுக்கப்பட்ட வினாடிகளின் எண்ணிக்கையிலிருந்து குறுக்குவழியைத் தொடங்குங்கள் கடைசி ஒலி.

# DlgAutoDJ#18
source: Repeat
ta: மீண்டும் செய்யவும்

source: Auto DJ requires two decks assigned to opposite sides of the crossfader.
ta: ஆட்டோ டிசேக்கு கிராச்ஃபேடரின் எதிர் பக்கங்களில் இரண்டு அடுக்குகள் ஒதுக்கப்பட வேண்டும்.

source: One deck must be stopped to enable Auto DJ mode.
ta: ஆட்டோ டிசே பயன்முறையை இயக்க ஒரு டெக் நிறுத்தப்பட வேண்டும்.

source: Enable
ta: இயக்கு

source: Disable
ta: முடக்கு

source: Displays the duration and number of selected tracks.
ta: தேர்ந்தெடுக்கப்பட்ட டிராக்குகளின் கால அளவு மற்றும் எண்ணிக்கையைக் காட்டுகிறது.

# DlgAutoDJ#24
source: Auto DJ
ta: ஆட்டோ டி.சே

source: Shuffle
ta: கலக்கு

source: Adds a random track from track sources (crates) to the Auto DJ queue. If no track sources are configured, the track is added from the library instead.
ta: ட்ராக் மூலங்களிலிருந்து (கிரேட்ச்) ஆட்டோ டிசே வரிசையில் ஒரு சீரற்ற டிராக்கைச் சேர்க்கிறது. டிராக் ஆதாரங்கள் எதுவும் கட்டமைக்கப்படவில்லை என்றால், அதற்குப் பதிலாக லைப்ரரியில் இருந்து டிராக் சேர்க்கப்படும்.

source: sec.
ta: நொடி

source: Enable BPM and Beat Detection
ta: பிபிஎம் மற்றும் பீட் கண்டறிதலை இயக்கவும்

source: Choose between different algorithms to detect beats.
ta: துடிப்புகளைக் கண்டறிய வெவ்வேறு அல்காரிதம்களுக்கு இடையே தேர்வு செய்யவும்.

source: Beat Detection Preferences
ta: பீட் கண்டறிதல் விருப்பத்தேர்வுகள்

source: When beat detection is enabled, Mixxx detects the beats per minute and beats of your tracks, automatically shows a beat-grid for them, and allows you to synchronize tracks using their beat information.
ta: பீட் கண்டறிதல் இயக்கப்பட்டால், மிக்ச்எக்ச் நிமிடத்திற்கான துடிப்புகளையும் உங்கள் டிராக்குகளின் துடிப்புகளையும் கண்டறியும், தானாக அவர்களுக்கான பீட்-கிரிட்டைக் காட்டுகிறது, மேலும் அவற்றின் பீட் தகவலைப் பயன்படுத்தி டிராக்குகளை ஒத்திசைக்க உங்களை அனுமதிக்கிறது.

source: Enable fast beat detection. If activated Mixxx only analyzes the first minute of a track for beat information. This can speed up beat detection on slower computers but may result in lower quality beatgrids.
ta: வேகமான துடிப்பு கண்டறிதலை இயக்கு. செயல்படுத்தப்பட்டால் Mixxx ஒரு தடத்தின் முதல் நிமிடத்தை மட்டுமே பீட் தகவலுக்காக பகுப்பாய்வு செய்யும். இது மெதுவான கணினிகளில் பீட் கண்டறிதலை விரைவுபடுத்தலாம் ஆனால் தகுதி குறைந்த பீட்கிரிட்களை ஏற்படுத்தலாம்.

# DlgBeatsDlg#6
source: Converts beats detected by the analyzer into a fixed-tempo beatgrid. Use this setting if your tracks have a constant tempo (e.g. most electronic music). Often results in higher quality beatgrids, but will not do well on tracks that have tempo shifts.
ta: பகுப்பாய்வியால் கண்டறியப்பட்ட துடிப்புகளை நிலையான-டெம்போ பீட்கிரிட்டாக மாற்றுகிறது. உங்கள் ட்ராக்குகளில் நிலையான டெம்போ இருந்தால் (எ.கா. பெரும்பாலான மின்னணு இசை) இந்த அமைப்பைப் பயன்படுத்தவும். பெரும்பாலும் உயர்தர பீட்கிரிட்களில் விளைகிறது, ஆனால் டெம்போ சிப்ட்களைக் கொண்ட டிராக்குகளில் சிறப்பாக செயல்படாது.

source: Re-analyze beatgrids imported from other DJ software
ta: மற்ற DJ மென்பொருளிலிருந்து இறக்குமதி செய்யப்பட்ட பீட்கிரிட்களை மீண்டும் பகுப்பாய்வு செய்யவும்

# DlgBeatsDlg#8
source: Choose Analyzer
ta: பகுப்பாய்வியைத் தேர்ந்தெடுக்கவும்

# DlgBeatsDlg#9
source: Analyzer Settings
ta: பகுப்பாய்வி அமைப்புகள்

# DlgBeatsDlg#10
source: Enable Fast Analysis (For slow computers, may be less accurate)
ta: வேகமான பகுப்பாய்வை இயக்கு (மெதுவான கணினிகளுக்கு, குறைவான துல்லியமாக இருக்கலாம்)

source: Assume constant tempo (Recommended)
ta: நிலையான டெம்போவை எடுத்துக் கொள்ளுங்கள் (பரிந்துரைக்கப்படுகிறது)

source: e.g. from 3rd-party programs or Mixxx versions before 1.11. (Not checked: Analyze only, if no beats exist.)
ta: எ.கா. 1.11க்கு முன் மூன்றாம் தரப்பு திட்டங்கள் அல்லது Mixxx பதிப்புகளில் இருந்து. (சரிபார்க்கப்படவில்லை: துடிப்புகள் இல்லை என்றால் மட்டும் பகுப்பாய்வு செய்யவும்.)

source: Re-analyze beats when settings change or beat detection data is outdated
ta: அமைப்புகள் மாறும்போது துடிப்புகளை மீண்டும் பகுப்பாய்வு செய்யுங்கள் அல்லது கண்டறியும் தரவு காலாவதியானது

source: Controller Learning Wizard
ta: கட்டுப்படுத்தி கற்றல் வழிகாட்டி

source: Learn
ta: கற்றுக்கொள்ளுங்கள்

# DlgControllerLearning#3
source: Close
ta: மூடு

source: Choose Control...
ta: கட்டுப்பாட்டைத் தேர்வுசெய்க...

source: Hints: If you're mapping a button or switch, only press or flip it once. For knobs and sliders, move the control in both directions for best results. Make sure to touch one control at a time.
ta: குறிப்புகள்: நீங்கள் ஒரு பட்டன் அல்லது சுவிட்சை வரைபடமாக்கினால், அதை ஒரு முறை அழுத்தவும் அல்லது புரட்டவும். கைப்பிடிகள் மற்றும் ச்லைடர்களுக்கு, சிறந்த முடிவுகளுக்கு கட்டுப்பாட்டை இரு திசைகளிலும் நகர்த்தவும். ஒரு நேரத்தில் ஒரு கட்டுப்பாட்டைத் தொடுவதை உறுதிசெய்யவும்.

# DlgControllerLearning#6
source: Cancel
ta: ரத்துசெய்

source: Advanced MIDI Options
ta: மேம்பட்ட MIDI விருப்பங்கள்

source: Switch mode interprets all messages for the control as button presses.
ta: சுவிட்ச் பயன்முறையானது கட்டுப்பாட்டுக்கான அனைத்து செய்திகளையும் பொத்தானை அழுத்தும்போது விளக்குகிறது.

source: Switch Mode
ta: ச்விட்ச் பயன்முறை

source: Ignores slider or knob movements until they are close to the internal value. This helps prevent unwanted extreme changes while mixing but can accidentally ignore intentional rapid movements.
ta: ச்லைடர் அல்லது குமிழ் அசைவுகள் அக மதிப்புக்கு அருகில் இருக்கும் வரை புறக்கணிக்கிறது. இது கலக்கும் போது தேவையற்ற தீவிர மாற்றங்களைத் தடுக்க உதவுகிறது ஆனால் தற்செயலாக வேண்டுமென்றே விரைவான இயக்கங்களை புறக்கணிக்கலாம்.

source: Soft Takeover
ta: மென்மையான கையகப்படுத்தல்

source: Reverses the direction of the control.
ta: கட்டுப்பாட்டின் திசையை மாற்றுகிறது.

# DlgControllerLearning#13
source: Invert
ta: தலைகீழாக மாற்றவும்

source: For jog wheels or infinite-scroll knobs. Interprets incoming messages in two's complement.
ta: சாக் வீல்கள் அல்லது எல்லையற்ற உருள் கைப்பிடிகளுக்கு. உள்வரும் செய்திகளை இருவரின் நிரப்புதலில் விளக்குகிறது.

source: Jog Wheel / Select Knob
ta: சாக் வீல் / தேர்ந்தெடு குமிழ்

# DlgControllerLearning#16
source: Retry
ta: மீண்டும் முயற்சிக்கவும்

source: Learn Another
ta: மற்றொன்றைக் கற்றுக்கொள்ளுங்கள்

source: Done
ta: முடிந்தது

source: Click anywhere in Mixxx or choose a control to learn
ta: Mixxx இல் எங்கும் சொடுக்கு செய்யவும் அல்லது கற்றுக்கொள்ள ஒரு கட்டுப்பாட்டைத் தேர்வு செய்யவும்

source: You can click on any button, slider, or knob in Mixxx to teach it that control. You can also type in the box to search for a control by name, or click the Choose Control button to select from a list.
ta: நீங்கள் Mixxx இல் உள்ள எந்த பட்டன், ச்லைடர் அல்லது குமிழ் மீதும் சொடுக்கு செய்து அதைக் கட்டுப்படுத்தலாம். பெயரின்படி கட்டுப்பாட்டைத் தேட, பெட்டியில் தட்டச்சு செய்யலாம் அல்லது பட்டியலிலிருந்து தேர்ந்தெடுக்க கட்டுப்பாட்டைத் தேர்ந்தெடு பொத்தானைக் சொடுக்கு செய்யவும்.

source: Now test it out!
ta: இப்போது அதை சோதிக்கவும்!

source: If you manipulate the control, you should see the Mixxx user interface respond the way you expect.
ta: நீங்கள் கட்டுப்பாட்டைக் கையாளினால், Mixxx பயனர் இடைமுகம் நீங்கள் எதிர்பார்க்கும் விதத்தில் பதிலளிப்பதைக் காண வேண்டும்.

source: Not quite right?
ta: சரியாக இல்லையா?

source: If the mapping is not working try enabling an advanced option below and then try the control again. Or click Retry to redetect the midi control.
ta: மேப்பிங் வேலை செய்யவில்லை என்றால், கீழே ஒரு மேம்பட்ட விருப்பத்தை இயக்க முயற்சிக்கவும், பின்னர் கட்டுப்பாட்டை மீண்டும் முயற்சிக்கவும். அல்லது மிடி கட்டுப்பாட்டை மீட்டெடுக்க மீண்டும் முயற்சிக்கவும் என்பதைக் சொடுக்கு செய்யவும்.

source: Didn't get any midi messages. Please try again.
ta: மிடி செய்திகள் எதுவும் வரவில்லை. மீண்டும் முயற்சிக்கவும்.

source: Unable to detect a mapping -- please try again. Be sure to only touch one control at once.
ta: மேப்பிங்கைக் கண்டறிய முடியவில்லை -- மீண்டும் முயற்சிக்கவும். ஒரே ஒரு கட்டுப்பாட்டை மட்டும் தொடுவதை உறுதி செய்யவும்.

source: Successfully mapped control:
ta: வெற்றிகரமாக வரைபடக் கட்டுப்பாடு:

source: <i>Ready to learn %1</i>
ta: <i>%1ஐ அறியத் தயார்</i>

source: Learning: %1. Now move a control on your controller.
ta: கற்றல்:% 1. இப்போது உங்கள் கட்டுப்படுத்தியில் ஒரு கட்டுப்பாட்டை நகர்த்தவும்.

source: The selected control does not exist.<br>This likely a bug. Please report it on the Mixxx bug tracker.<br><a href='https://github.com/mixxxdj/mixxx/issues'>https://github.com/mixxxdj/mixxx/issues</a><br><br>You tried to learn: %1,%2
ta: தேர்ந்தெடுக்கப்பட்ட கட்டுப்பாடு இல்லை.<br>இது பிழையாக இருக்கலாம். Mixxx பிழை டிராக்கரில் புகாரளிக்கவும்.<br><a href='https://github.com/mixxxdj/mixxx/issues'>https://github.com/mixxxdj/mixxx/issues</a><br><br>கற்றுக்கொள்ள முயற்சித்தீர்கள்: %1,%2

source: The control you clicked in Mixxx is not learnable. This could be because you are either using an old skin and this control is no longer supported, or you clicked a control that provides visual feedback and can only be mapped to outputs like LEDs via scripts. You tried to learn: %1,%2
ta: Mixxx இல் நீங்கள் சொடுக்கு செய்த கட்டுப்பாடு கற்றுக்கொள்ள முடியாது. நீங்கள் பழைய தோலைப் பயன்படுத்துவதால், இந்தக் கட்டுப்பாடு இனி ஆதரிக்கப்படாமல் இருக்கலாம் அல்லது காட்சிப் பின்னூட்டத்தை வழங்கும் கட்டுப்பாட்டைக் சொடுக்கு செய்திருக்கலாம், மேலும் ச்கிரிப்ட்கள் வழியாக LED போன்ற வெளியீடுகளுக்கு மட்டுமே மேப் செய்ய முடியும். நீங்கள் கற்றுக்கொள்ள முயற்சித்தீர்கள்: % 1,%2

source: Fetched Cover Art
ta: கவர் ஆர்ட் பெறப்பட்டது

source: Developer Tools
ta: உருவாக்குபவர் கருவிகள்

source: Controls
ta: கட்டுப்பாடுகள்
