Repository: 247i/TACETr
Catalog: உரை/தானி/mixxxdj_mixxx2-5_*.po
Languages: ta

source: Normalization Preferences
ta: இயல்பாக்குதல் விருப்பத்தேர்வுகள்

source: ReplayGain Loudness Normalization
ta: ReplayGain சத்தத்தை இயல்பாக்குதல்

source: Apply loudness normalization to loaded tracks.
ta: ஏற்றப்பட்ட டிராக்குகளுக்கு ஒலியை இயல்பாக்குவதைப் பயன்படுத்தவும்.

source: Apply ReplayGain
ta: ReplayGain ஐப் பயன்படுத்தவும்

source: When ReplayGain is enabled, adjust tracks lacking ReplayGain information by this amount.
ta: ReplayGain இயக்கப்பட்டிருக்கும் போது, ​​ReplayGain செய்தி இல்லாத டிராக்குகளை இந்த அளவு மூலம் சரிசெய்யவும்.

source: Initial boost without ReplayGain data
ta: ReplayGain தரவு இல்லாமல் ஆரம்ப பூச்ட்

source: ReplayGain targets a reference loudness of -18 LUFS (Loudness Units relative to Full Scale). You may increase it if you find Mixxx is too quiet or reduce it if you find that your tracks are clipping. You may also want to decrease the volume of unanalyzed tracks if you find they are often louder than ReplayGained tracks. For podcasting a loudness of -16 LUFS is recommended. The loudness target is approximate and assumes track pregain and main output level are unchanged.
ta: ReplayGain -18 LUFS (முழு அளவுகோலுடன் தொடர்புடைய உரத்த அலகுகள்) குறிப்பு ஒலியை குறிவைக்கிறது. Mixxx மிகவும் அமைதியாக இருப்பதைக் கண்டால் அதை அதிகரிக்கலாம் அல்லது உங்கள் டிராக்குகள் கிளிப்பிங் செய்வதைக் கண்டால் அதைக் குறைக்கலாம். ரீப்ளே கெய்ன்ட் டிராக்குகளை விட அவை பெரும்பாலும் சத்தமாக இருப்பதைக் கண்டால், பகுப்பாய்வு செய்யப்படாத டிராக்குகளின் அளவைக் குறைக்கவும் நீங்கள் விரும்பலாம். போட்காச்டிங்கிற்கு -16 LUFS என்ற ஒலி பரிந்துரைக்கப்படுகிறது. உரத்த இலக்கு தோராயமானது மற்றும் ட்ராக் ப்ரீகெய்ன் மற்றும் முக்கிய வெளியீட்டு நிலை மாறாமல் இருக்கும் என்று கருதுகிறது.

source: For tracks with ReplayGain, adjust the target loudness to this LUFS value (Loudness Units relative to Full Scale).
ta: ReplayGain கொண்ட டிராக்குகளுக்கு, இந்த LUFS மதிப்புக்கு (முழு அளவுகோலுடன் தொடர்புடைய லவுட்னச் யூனிட்கள்) இலக்கு ஒலியை சரிசெய்யவும்.

source: Target loudness
ta: இலக்கு ஒலி

source: -12 dB
ta: -12 டி.பி

source: Analysis
ta: பகுப்பாய்வு

# DlgPrefReplayGainDlg#16
source: Disabled
ta: முடக்கப்பட்டது

source: Re-analyze and override an existing value
ta: ஏற்கனவே உள்ள மதிப்பை மீண்டும் பகுப்பாய்வு செய்து மேலெழுதவும்

source: When an unanalyzed track is playing, Mixxx will avoid an abrupt volume change by not applying a newly calculated ReplayGain value.
ta: பகுப்பாய்வு செய்யப்படாத டிராக் இயங்கும் போது, ​​புதிதாகக் கணக்கிடப்பட்ட ReplayGain மதிப்பைப் பயன்படுத்தாமல் திடீரென ஒலியளவு மாற்றத்தை Mixxx தவிர்க்கும்.

# DlgPrefReplayGainDlg#20
source: Hints
ta: குறிப்புகள்

source: %1 Hz
ta: % 1 எர்ட்ச்

source: Default (long delay)
ta: இயல்புநிலை (நீண்ட தாமதம்)

source: Experimental (no delay)
ta: ஆய்வு (தாமதம் இல்லை)

source: Disabled (short delay)
ta: முடக்கப்பட்டது (குறுகிய தாமதம்)

source: Soundcard Clock
ta: ஒலி அட்டை கடிகாரம்

source: Network Clock
ta: பிணையம் கடிகாரம்

source: Direct monitor (recording and broadcasting only)
ta: நேரடி கண்காணிப்பு (பதிவு மற்றும் ஒளிபரப்பு மட்டும்)

# DlgPrefSound#8
source: Disabled
ta: முடக்கப்பட்டது

# DlgPrefSound#9
source: Enabled
ta: இயக்கப்பட்டது

# DlgPrefSound#10
source: Stereo
ta: ச்டீரியோ

# DlgPrefSound#11
source: Mono
ta: மோனோ

source: To enable Realtime scheduling (currently disabled), see the %1.
ta: நிகழ்நேர திட்டமிடலை இயக்க (தற்போது முடக்கப்பட்டுள்ளது), % 1 ஐப் பார்க்கவும்.

source: The %1 lists sound cards and controllers you may want to consider for using Mixxx.
ta: Mixxx ஐப் பயன்படுத்துவதற்கு நீங்கள் கருத்தில் கொள்ள விரும்பும் ஒலி அட்டைகள் மற்றும் கட்டுப்படுத்திகளை %1 பட்டியலிடுகிறது.

# DlgPrefSound#14
source: Mixxx DJ Hardware Guide
ta: Mixxx DJ வன்பொருள் வழிகாட்டி

source: Find details in the Mixxx user manual
ta: Mixxx பயனர் கையேட்டில் விவரங்களைக் கண்டறியவும்

source: auto (<= 1024 frames/period)
ta: தானியங்கு (<= 1024 பிரேம்கள்/காலம்)

source: 2048 frames/period
ta: 2048 பிரேம்கள்/காலம்

source: 4096 frames/period
ta: 4096 பிரேம்கள்/காலம்

source: Microphone inputs are out of time in the record & broadcast signal compared to what you hear.
ta: மைக்ரோஃபோன் உள்ளீடுகள் நீங்கள் கேட்பதை ஒப்பிடும்போது பதிவு மற்றும் ஒளிபரப்பு சிக்னலில் நேரம் இல்லை.

source: Measure round trip latency and enter it above for Microphone Latency Compensation to align microphone timing.
ta: ரவுண்ட் ட்ரிப் தாமதத்தை அளந்து, மைக்ரோஃபோன் நேரத்தைச் சீரமைக்க மைக்ரோஃபோன் லேட்டன்சி இழப்பீட்டிற்கு மேலே உள்ளிடவும்.

source: Refer to the Mixxx User Manual for details.
ta: விவரங்களுக்கு Mixxx பயனர் கையேட்டைப் பார்க்கவும்.

source: Configured latency has changed.
ta: கட்டமைக்கப்பட்ட நேரந்தவறுகை மாறிவிட்டது.

source: Remeasure round trip latency and enter it above for Microphone Latency Compensation to align microphone timing.
ta: மைக்ரோஃபோன் நேரத்தைச் சீரமைக்க, ரவுண்ட் ட்ரிப் தாமதத்தை அளந்து, மைக்ரோஃபோன் லேட்டன்சி இழப்பீட்டிற்கு மேலே உள்ளிடவும்.

source: Realtime scheduling is enabled.
ta: நிகழ்நேர திட்டமிடல் இயக்கப்பட்டது.

source: Main output only
ta: முக்கிய வெளியீடு மட்டுமே

source: Main and booth outputs
ta: முக்கிய மற்றும் சாவடி வெளியீடுகள்

source: Configuration error
ta: கட்டமைப்பு பிழை

source: Sound Hardware Preferences
ta: ஒலி வன்பொருள் விருப்பத்தேர்வுகள்

source: Sound API
ta: ஒலி பநிஇ

source: Sample Rate
ta: மாதிரி விகிதம்

source: Audio Buffer
ta: ஆடியோ பஃபர்

source: Engine Clock
ta: எஞ்சின் கடிகாரம்

source: Use soundcard clock for live audience setups and lowest latency.<br>Use network clock for broadcasting without a live audience.
ta: நேரலை பார்வையாளர்கள் அமைப்புகளுக்கும் குறைந்த தாமதத்திற்கும் சவுண்ட்கார்டு கடிகாரத்தைப் பயன்படுத்தவும்.<br>நேரலை பார்வையாளர்கள் இல்லாமல் ஒளிபரப்ப பிணையம் கடிகாரத்தைப் பயன்படுத்தவும்.

source: Main Mix
ta: முக்கிய கலவை

source: Main Output Mode
ta: முக்கிய வெளியீட்டு முறை

source: Microphone Monitor Mode
ta: மைக்ரோஃபோன் மானிட்டர் பயன்முறை

source: Microphone Latency Compensation
ta: மைக்ரோஃபோன் தாமத இழப்பீடு

source: Deck and Bus outputs are for external mixers. They are post-fader and include effects and crossfader (for Auto DJ). For external mixing, make sure all Mixxx faders and EQ knobs are set to their default position (right- or double-click).
ta: டெக் மற்றும் பச் வெளியீடுகள் வெளிப்புற கலவைகளுக்கானது. அவை போச்ட் ஃபேடர் மற்றும் விளைவுகள் மற்றும் கிராச்ஃபேடர் (ஆட்டோ டிசேக்கு) ஆகியவை அடங்கும். வெளிப்புற கலவைக்கு, அனைத்து Mixxx ஃபேடர்கள் மற்றும் EQ கைப்பிடிகள் அவற்றின் இயல்பு நிலைக்கு அமைக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்தவும் (வலது அல்லது இருமுறை சொடுக்கு செய்யவும்).

source: 20 ms
ta: 20 எம்.எச்

source: Buffer Underflow Count
ta: பஃபர் அண்டர்ஃப்ளோ எண்ணிக்கை

source: Keylock/Pitch-Bending Engine
ta: கீலாக்/பிட்ச்-வளைக்கும் இயந்திரம்

source: Multi-Soundcard Synchronization
ta: பல ஒலி அட்டை ஒத்திசைவு

source: Output
ta: வெளியீடு

# DlgPrefSoundDlg#19
source: Input
ta: உள்ளீடு

source: System Reported Latency
ta: கணினி அறிக்கை நேரந்தவறுகை

source: Enlarge your audio buffer if the underflow counter is increasing or you hear pops during playback.
ta: அண்டர்ஃப்ளோ கவுண்டர் அதிகமாகினாலோ அல்லது பிளேபேக்கின் போது பாப்ச் கேட்டாலோ உங்கள் ஆடியோ பஃபரை பெரிதாக்கவும்.

# DlgPrefSoundDlg#22
source: Main Output Delay
ta: முக்கிய வெளியீடு நேரந்தவறுகை

source: Headphone Output Delay
ta: எட்ஃபோன் வெளியீடு நேரந்தவறுகை

source: Booth Output Delay
ta: பூத் வெளியீடு நேரந்தவறுகை

source: Hints and Diagnostics
ta: குறிப்புகள் மற்றும் நோய் கண்டறிதல்

source: Downsize your audio buffer to improve Mixxx's responsiveness.
ta: Mixxx இன் வினைத்திறனை மேம்படுத்த, உங்கள் ஆடியோ பஃப்பரைக் குறைக்கவும்.

source: Query Devices
ta: வினவல் சாதனங்கள்

source: Channel %1
ta: சேனல்% 1

source: Channels %1 - %2
ta: சேனல்கள்% 1 -% 2

source: Sound Item Preferences
ta: ஒலி பொருள் விருப்பத்தேர்வுகள்

source: Type (#)
ta: வகை (#)

# DlgPrefVinylDlg#1
source: Input
ta: உள்ளீடு

source: Vinyl Configuration
ta: வினைல் கட்டமைப்பு

source: Show Signal Quality in Skin
ta: தோலில் சிக்னல் தரத்தைக் காட்டு

source: Vinyl Control Preferences
ta: வினைல் கட்டுப்பாடு விருப்பத்தேர்வுகள்

source: Turntable Input Signal Boost
ta: டர்ன்டபிள் உள்ளீடு சிக்னல் பூச்ட்

source: Vinyl Type
ta: வினைல் வகை

source: Lead-In
ta: முன்னணி-இன்

source: Pitch estimator
ta: சுருதி மதிப்பீட்டாளர்

source: Deck 1
ta: தளம் 1

source: Deck 2
ta: தளம் 2

source: Deck 3
ta: தளம் 3

source: Deck 4
ta: தளம் 4

source: Signal Quality
ta: சிக்னல் தகுதி

source: Powered by xwax
ta: xwax மூலம் இயக்கப்படுகிறது

# DlgPrefVinylDlg#18
source: Hints
ta: குறிப்புகள்

source: Select sound devices for Vinyl Control in the Sound Hardware pane.
ta: ஒலி வன்பொருள் பலகத்தில் வினைல் கட்டுப்பாட்டுக்கான ஒலி சாதனங்களைத் தேர்ந்தெடுக்கவும்.

# DlgPrefWaveform#1
source: Filtered
ta: வடிகட்டப்பட்டது

# DlgPrefWaveform#2
source: HSV
ta: எச்.எச்.வி

source: Top
ta: மேலே

source: Center
ta: நடுவண்

source: Bottom
ta: கீழே

source: 1/3rd of waveform viewer
ta: அலைவடிவ பார்வையாளரின் 1/3 பங்கு

source: Full waveform viewer height
ta: முழு அலைவடிவ பார்வையாளர் உயரம்

source: OpenGL not available
ta: OpenGL கிடைக்கவில்லை

source: dropped frames
ta: கைவிடப்பட்ட பிரேம்கள்

source: Cached waveforms occupy %1 MiB on disk.
ta: தற்காலிக சேமிப்பு அலைவடிவங்கள் வட்டில் % 1 MiB ஆக்கிரமித்துள்ளன.

source: Waveform Preferences
ta: அலைவடிவ விருப்பத்தேர்வுகள்

source: Frame rate
ta: பிரேம் வீதம்

source: Displays which OpenGL version is supported by the current platform.
ta: தற்போதைய இயங்குதளத்தால் எந்த OpenGL பதிப்பு ஆதரிக்கப்படுகிறது என்பதைக் காட்டுகிறது.

source: Normalize waveform overview
ta: அலைவடிவ மேலோட்டத்தை இயல்பாக்குங்கள்

source: Average frame rate
ta: சராசரி பிரேம் வீதம்

source: Visual gain
ta: காட்சி ஆதாயம்

source: Default zoom level
ta: இயல்புநிலை சூம் நிலை

source: Displays the actual frame rate.
ta: உண்மையான பிரேம் வீதத்தைக் காட்டுகிறது.

source: Visual gain of the middle frequencies
ta: நடுத்தர அதிர்வெண்களின் காட்சி ஆதாயம்

source: End of track warning
ta: பாதையின் முடிவு முன்னறிவிப்பு

source: OpenGL status
ta: OpenGL நிலை

source: Highlight the waveforms when the last seconds of a track remains.
ta: டிராக்கின் கடைசி வினாடிகள் இருக்கும் போது அலைவடிவங்களை முன்னிலைப்படுத்தவும்.

# DlgPrefWaveformDlg#13
source: seconds
ta: வினாடிகள்

# DlgPrefWaveformDlg#14
source: Low
ta: குறைந்த

source: Middle
ta: நடுத்தர

source: Global
ta: உலகளாவிய

source: Visual gain of the high frequencies
ta: அதிக அதிர்வெண்களின் காட்சி ஆதாயம்

source: Visual gain of the low frequencies
ta: குறைந்த அதிர்வெண்களின் காட்சி ஆதாயம்

# DlgPrefWaveformDlg#19
source: High
ta: உயர்

source: Waveform type
ta: அலைவடிவ வகை

source: Global visual gain
ta: உலகளாவிய காட்சி ஆதாயம்

source: The waveform overview shows the waveform envelope of the entire track. Select from different types of displays for the waveform overview, which differ primarily in the level of detail shown in the waveform.
ta: அலைவடிவ மேலோட்டம் முழு பாதையின் அலைவடிவ உறையையும் காட்டுகிறது. அலைவடிவ மேலோட்டத்திற்கான பல்வேறு வகையான காட்சிகளில் இருந்து தேர்ந்தெடுக்கவும், இது அலைவடிவத்தில் காட்டப்படும் விவரங்களின் மட்டத்தில் முதன்மையாக வேறுபடுகிறது.

source: The waveform shows the waveform envelope of the track near the current playback position. Select from different types of displays for the waveform, which differ primarily in the level of detail shown in the waveform.
ta: அலைவடிவம் தற்போதைய பின்னணி நிலைக்கு அருகில் பாதையின் அலைவடிவ உறையைக் காட்டுகிறது. அலைவடிவத்திற்கான பல்வேறு வகையான காட்சிகளில் இருந்து தேர்ந்தெடுக்கவும், இது அலைவடிவத்தில் காட்டப்படும் விவரங்களின் மட்டத்தில் முதன்மையாக வேறுபடுகிறது.

source: Waveform overview type
ta: அலைவடிவ மேலோட்ட வகை

source: Synchronize zoom level across all waveform displays.
ta: அனைத்து அலைவடிவ காட்சிகளிலும் சூம் அளவை ஒத்திசைக்கவும்.

source: Synchronize zoom level across all waveforms
ta: அனைத்து அலைவடிவங்களிலும் சூம் அளவை ஒத்திசைக்கவும்

source: Play marker hints
ta: மார்க்கர் குறிப்புகளை இயக்கவும்

source: Beats until next marker
ta: அடுத்த மார்க்கர் வரை துடிக்கிறது

source: Preferred font size
ta: விருப்பமான எழுத்துரு அளவு

source: Text height limit
ta: உரை உயர வரம்பு

source: Time until next marker
ta: அடுத்த மார்க்கர் வரை நேரம்

source: Placement
ta: இடவமைவு

source: This functionality requires a waveform type marked "(GLSL)".
ta: This செயல்கூறு requires a அலைவடிவம், அலைப்படம் வகை marked "(GLSL)".

source: Caching
ta: கேச்சிங்

source: Mixxx caches the waveforms of your tracks on disk the first time you load a track. This reduces CPU usage when you are playing live but requires extra disk space.
ta: மிக்ச்எக்ச்எக்ச் உங்கள் டிராக்குகளின் அலைவடிவங்களை முதல்முறையாக நீங்கள் டிராக்கை ஏற்றும்போது வட்டில் சேமிக்கிறது. நீங்கள் நேரலையில் விளையாடும்போது இது சிபியு பயன்பாட்டைக் குறைக்கிறது ஆனால் கூடுதல் வட்டு இடம் தேவைப்படுகிறது.

source: Enable waveform caching
ta: அலைவடிவ தேக்ககத்தை இயக்கு

source: Generate waveforms when analyzing library
ta: நூலகத்தை பகுப்பாய்வு செய்யும் போது அலைவடிவங்களை உருவாக்கவும்

source: Beat grid opacity
ta: கிரிட் ஒளிபுகாநிலையை வெல்லுங்கள்

source: Set amount of opacity on beat grid lines.
ta: பீட் கிரிட் கோடுகளில் ஒளிபுகாநிலையின் அளவை அமைக்கவும்.

source: Play marker position
ta: ப்ளே மார்க்கர் நிலை

source: Moves the play marker position on the waveforms to the left, right or center (default).
ta: அலைவடிவங்களில் பிளே மார்க்கர் நிலையை இடது, வலது அல்லது மையத்திற்கு (இயல்புநிலை) நகர்த்துகிறது.

source: Clear Cached Waveforms
ta: தேக்ககப்படுத்தப்பட்ட அலைவடிவங்களை அழிக்கவும்

source: Sound Hardware
ta: ஒலி வன்பொருள்

# DlgPreferences#2
source: Controllers
ta: கட்டுப்படுத்திகள்

# DlgPreferences#3
source: Library
ta: நூலகம்

source: Interface
ta: இடைமுகம்

source: Waveforms
ta: அலைவடிவங்கள்

# DlgPreferences#6
source: Mixer
ta: கலப்பி

# DlgPreferences#7
source: Auto DJ
ta: ஆட்டோ டி.சே

source: Decks
ta: அடுக்குகள்

source: Colors
ta: நிறங்கள்

# DlgPreferences#10
source: &Help
ta: உதவி (&h)

source: &Restore Defaults
ta: &இயல்புநிலைகளை மீட்டமை

# DlgPreferences#12
source: &Apply
ta: &விண்ணப்பிக்கவும்

# DlgPreferences#13
source: &Cancel
ta: ரத்துசெய் (&c)

source: &Ok
ta: சரி (&o)

# DlgPreferences#15
source: Effects
ta: விளைவுகள்

# DlgPreferences#16
source: Recording
ta: பதிவு செய்தல்

source: Beat Detection
ta: பீட் கண்டறிதல்

source: Key Detection
ta: முக்கிய கண்டறிதல்

source: Normalization
ta: இயல்பாக்குதல்

source: <font color='#BB0000'><b>Some preferences pages have errors. To apply the changes please first fix the issues.</b></font>
ta: <font color='#BB0000'><b>சில விருப்பத்தேர்வுகள் பக்கங்களில் பிழைகள் உள்ளன. மாற்றங்களைப் பயன்படுத்த, முதலில் சிக்கல்களைச் சரிசெய்யவும்.</b></font>

# DlgPreferences#21
source: Vinyl Control
ta: வினைல் கட்டுப்பாடு

source: Live Broadcasting
ta: நேரடி ஒளிபரப்பு

source: Modplug Decoder
ta: மோட்ப்ளக் டிகோடர்

source: Preferences
ta: விருப்பத்தேர்வுகள்

source: TextLabel
ta: உரை சிட்டை

# DlgRecording#1
source: Recordings
ta: பதிவுகள்

source: Start Recording
ta: பதிவைத் தொடங்கவும்

source: Recording to file:
ta: கோப்பில் பதிவு செய்தல்:

source: Stop Recording
ta: பதிவு செய்வதை நிறுத்து

source: %1 MiB written in %2
ta: %1 MiB %2 இல் எழுதப்பட்டது

source: Replace Hotcue Color
ta: Hotcue நிறத்தை மாற்றவும்

source: Replace cue color if …
ta: க்யூ நிறத்தை மாற்றினால்…

source: Hotcue index
ta: Hotcue இன்டெக்ச்

source: is
ta: உள்ளது

source: is not
ta: இல்லை

source: Current cue color
ta: தற்போதைய குறி நிறம்

source: If you don't specify any conditions, the colors of all cues in the library will be replaced.
ta: நீங்கள் எந்த நிபந்தனைகளையும் குறிப்பிடவில்லை என்றால், நூலகத்தில் உள்ள அனைத்து குறிப்புகளின் வண்ணங்களும் மாற்றப்படும்.

source: … by:
ta: … மூலம்:

source: New cue color
ta: புதிய குறி நிறம்

source: Selecting database rows...
ta: தரவுத்தள வரிசைகளைத் தேர்ந்தெடுக்கிறது...

source: No colors changed!
ta: நிறங்கள் மாறவில்லை!

source: No cues matched the specified criteria.
ta: குறிப்பிட்ட அளவுகோல்களுடன் எந்த குறிப்பும் பொருந்தவில்லை.

source: Confirm Color Replacement
ta: வண்ண மாற்றத்தை உறுதிப்படுத்தவும்

source: The colors of %1 cues in %2 tracks will be replaced. This change cannot be undone! Are you sure?
ta: % 2 தடங்களில் உள்ள % 1 குறிப்புகளின் வண்ணங்கள் மாற்றப்படும். இந்த மாற்றத்தை செயல்தவிர்க்க முடியாது! நீங்கள் உறுதியாக இருக்கிறீர்களா?

source: MusicBrainz
ta: இசை பிரைன்ச்

source: Select best possible match
ta: சிறந்த பொருத்தத்தைத் தேர்ந்தெடுக்கவும்

source: Track
ta: மின்தடம்

# DlgTagFetcher#4
source: Year
ta: ஆண்டு

# DlgTagFetcher#5
source: Title
ta: தலைப்பு

# DlgTagFetcher#6
source: Artist
ta: கலைஞர்

# DlgTagFetcher#7
source: Album
ta: ஆல்பம்

# DlgTagFetcher#8
source: Album Artist
ta: ஆல்பம் கலைஞர்

source: Fetching track data from the MusicBrainz database
ta: MusicBrainz தரவுத்தளத்திலிருந்து ட்ராக் தரவைப் பெறுகிறது

source: Get API-Key
ta: API-விசையைப் பெறவும்

# Submits audio fingerprints to the MusicBrainz database.
source: Submit
ta: சமர்ப்பிக்கவும்

source: New Column
ta: புதிய நெடுவரிசை

source: New Item
ta: புதிய பொருள்

source: Current Cover Art
ta: தற்போதைய அட்டைப்படம்

source: Found Cover Art
ta: கவர் ஆர்ட் கிடைத்தது

source: The results are ready to be applied.
ta: முடிவுகள் பயன்படுத்த தயாராக உள்ளன.

# DlgTagFetcher#17
source: Retry
ta: மீண்டும் முயற்சிக்கவும்

# DlgTagFetcher#18
source: &Previous
ta: &முந்தைய

# DlgTagFetcher#19
source: &Next
ta: &அடுத்து

# DlgTagFetcher#20
source: Tags
ta: குறிச்சொற்கள்

source: Cover
ta: கவர்

# DlgTagFetcher#22
source: &Apply
ta: &விண்ணப்பிக்கவும்

# DlgTagFetcher#23
source: &Close
ta: மூடு (&c)

source: Original tags
ta: அசல் குறிச்சொற்கள்

source: Metadata applied
ta: மேனிலை தரவு பயன்படுத்தப்பட்டது

source: Suggested tags
ta: பரிந்துரைக்கப்பட்ட குறிச்சொற்கள்

source: The results are ready to be applied
ta: முடிவுகள் பயன்படுத்த தயாராக உள்ளன

source: Can't connect to %1: %2
ta: % 1: %2 உடன் இணைக்க முடியவில்லை

source: Looking for cover art
ta: அட்டைப்படத்தைத் தேடுகிறேன்

source: Cover art found, receiving image.
ta: கவர் ஆர்ட் கிடைத்தது, படம் பெறுகிறது.

source: Cover Art is not available for selected metadata
ta: தேர்ந்தெடுக்கப்பட்ட மெட்டாடேட்டாவிற்கு கவர் ஆர்ட் கிடைக்கவில்லை

source: Metadata & Cover Art applied
ta: மேனிலை தரவு & கவர் ஆர்ட் பயன்படுத்தப்பட்டது

source: Selected cover art applied
ta: தேர்ந்தெடுக்கப்பட்ட கவர் ஆர்ட் பயன்படுத்தப்பட்டது

# DlgTagFetcher#35
source: Cover Art File Already Exists
ta: கவர் ஆர்ட் கோப்பு ஏற்கனவே உள்ளது

# DlgTagFetcher#36
source: File: %1 Folder: %2 Override existing file? This can not be undone!
ta: கோப்பு: % 1 கோப்புறை:% 2 ஏற்கனவே உள்ள கோப்பை மேலெழுதவா? இதை செயல்தவிர்க்க முடியாது!

source: Export Tracks
ta: ஏற்றுமதி தடங்கள்

source: Exporting Tracks
ta: தடங்களை ஏற்றுமதி செய்கிறது

source: (status text)
ta: (நிலை உரை)

# DlgTrackExport#4
source: &Cancel
ta: ரத்துசெய் (&c)

# DlgTrackInfo#1
source: Track Editor
ta: ட்ராக் எடிட்டர்

source: Summary
ta: சுருக்கம்

# DlgTrackInfo#3
source: Filetype:
ta: கோப்பு வகை:

# DlgTrackInfo#4
source: BPM:
ta: பிபிஎம்:

# DlgTrackInfo#5
source: Location:
ta: இடம்:

# DlgTrackInfo#6
source: Bitrate:
ta: பிட்ரேட்:

# DlgTrackInfo#7
source: Comments
ta: கருத்துகள்

# DlgTrackInfo#8
source: BPM
ta: பிபிஎம்

source: Sets the BPM to 75% of the current value.
ta: BPMஐ தற்போதைய மதிப்பில் 75% ஆக அமைக்கிறது.

# DlgTrackInfo#10
source: 3/4 BPM
ta: 3/4 பிபிஎம்

source: Sets the BPM to 50% of the current value.
ta: BPMஐ தற்போதைய மதிப்பில் 50% ஆக அமைக்கிறது.

source: Displays the BPM of the selected track.
ta: தேர்ந்தெடுக்கப்பட்ட பாதையின் BPM ஐக் காட்டுகிறது.

# DlgTrackInfo#13
source: Track #
ta: தடம் #

# DlgTrackInfo#14
source: Album Artist
ta: ஆல்பம் கலைஞர்

# DlgTrackInfo#15
source: Composer
ta: இசையமைப்பாளர்

# DlgTrackInfo#16
source: Title
ta: தலைப்பு

# DlgTrackInfo#17
source: Grouping
ta: குழுவாக்கம்

# DlgTrackInfo#18
source: Key
ta: முக்கிய

# DlgTrackInfo#19
source: Year
ta: ஆண்டு

# DlgTrackInfo#20
source: Artist
ta: கலைஞர்

# DlgTrackInfo#21
source: Album
ta: ஆல்பம்

# DlgTrackInfo#22
source: Genre
ta: வகை

source: ReplayGain:
ta: ரீப்ளே ஆதாயம்:

source: Sets the BPM to 200% of the current value.
ta: BPMஐ தற்போதைய மதிப்பில் 200% ஆக அமைக்கிறது.

# DlgTrackInfo#25
source: Double BPM
ta: இரட்டை பிபிஎம்

# DlgTrackInfo#26
source: Halve BPM
ta: பாதி பிபிஎம்

# DlgTrackInfo#27
source: Clear BPM and Beatgrid
ta: BPM மற்றும் Beatgrid ஐ அழிக்கவும்

source: Move to the previous item.
ta: முந்தைய உருப்படிக்குச் செல்லவும்.

# DlgTrackInfo#29
source: &Previous
ta: &முந்தைய

source: Move to the next item.
ta: அடுத்த உருப்படிக்குச் செல்லவும்.

# DlgTrackInfo#31
source: &Next
ta: &அடுத்து

# DlgTrackInfo#32
source: Duration:
ta: காலம்:

source: Import Metadata from MusicBrainz
ta: MusicBrainz இலிருந்து மெட்டாடேட்டாவை இறக்குமதி செய்யவும்

source: Re-Import Metadata from file
ta: கோப்பிலிருந்து மெட்டாடேட்டாவை மீண்டும் இறக்குமதி செய்யவும்

# DlgTrackInfo#35
source: Color
ta: நிறம்

source: Date added:
ta: சேர்க்கப்பட்ட தேதி:

# DlgTrackInfo#37
source: Open in File Browser
ta: கோப்பு உலாவியில் திறக்கவும்

# DlgTrackInfo#38
source: Samplerate:
ta: மாதிரி:

source: Track BPM:
ta: BPM ஐக் கண்காணிக்கவும்:

# DlgTrackInfo#40
source: Converts beats detected by the analyzer into a fixed-tempo beatgrid. Use this setting if your tracks have a constant tempo (e.g. most electronic music). Often results in higher quality beatgrids, but will not do well on tracks that have tempo shifts.
ta: பகுப்பாய்வியால் கண்டறியப்பட்ட துடிப்புகளை நிலையான-டெம்போ பீட்கிரிட்டாக மாற்றுகிறது. உங்கள் ட்ராக்குகளில் நிலையான டெம்போ இருந்தால் (எ.கா. பெரும்பாலான மின்னணு இசை) இந்த அமைப்பைப் பயன்படுத்தவும். பெரும்பாலும் உயர்தர பீட்கிரிட்களில் விளைகிறது, ஆனால் டெம்போ சிப்ட்களைக் கொண்ட டிராக்குகளில் சிறப்பாக செயல்படாது.

source: Assume constant tempo
ta: நிலையான டெம்போவைக் கருதுங்கள்

source: Sets the BPM to 66% of the current value.
ta: BPMஐ தற்போதைய மதிப்பில் 66% ஆக அமைக்கிறது.

# DlgTrackInfo#43
source: 2/3 BPM
ta: 2/3 பிபிஎம்

source: Sets the BPM to 150% of the current value.
ta: BPMஐ தற்போதைய மதிப்பில் 150% ஆக அமைக்கிறது.

# DlgTrackInfo#45
source: 3/2 BPM
ta: 3/2 பிபிஎம்

source: Sets the BPM to 133% of the current value.
ta: BPMஐ தற்போதைய மதிப்பில் 133% ஆக அமைக்கிறது.

# DlgTrackInfo#47
source: 4/3 BPM
ta: 4/3 பிபிஎம்

source: Tap with the beat to set the BPM to the speed you are tapping.
ta: நீங்கள் தட்டுகின்ற வேகத்திற்கு BPM ஐ அமைக்க பீட் மூலம் தட்டவும்.

source: Tap to Beat
ta: அடிக்க தட்டவும்

source: Hint: Use the Library Analyze view to run BPM detection.
ta: குறிப்பு: BPM கண்டறிதலை இயக்க, நூலகப் பகுப்பாய்வுக் காட்சியைப் பயன்படுத்தவும்.

# DlgTrackInfo#51
source: Save changes and close the window.
ta: மாற்றங்களைச் சேமித்து சாளரத்தை மூடு.

# DlgTrackInfo#52
source: &OK
ta: சரி (&o)

# DlgTrackInfo#53
source: Discard changes and close the window.
ta: மாற்றங்களை நிராகரித்து சாளரத்தை மூடு.

# DlgTrackInfo#54
source: Save changes and keep the window open.
ta: மாற்றங்களைச் சேமித்து சாளரத்தைத் திறந்து வைக்கவும்.

# DlgTrackInfo#55
source: &Apply
ta: &விண்ணப்பிக்கவும்

# DlgTrackInfo#56
source: &Cancel
ta: ரத்துசெய் (&c)

# DlgTrackInfo#57
source: (no color)
ta: (நிறம் இல்லை)

# DlgTrackInfoMulti#1
source: Track Editor
ta: ட்ராக் எடிட்டர்

# DlgTrackInfoMulti#2
source: Title
ta: தலைப்பு

# DlgTrackInfoMulti#3
source: Artist
ta: கலைஞர்

# DlgTrackInfoMulti#4
source: Album
ta: ஆல்பம்

# DlgTrackInfoMulti#5
source: Album Artist
ta: ஆல்பம் கலைஞர்

# DlgTrackInfoMulti#6
source: Composer
ta: இசையமைப்பாளர்

# DlgTrackInfoMulti#7
source: Year
ta: ஆண்டு

# DlgTrackInfoMulti#8
source: Genre
ta: வகை

# DlgTrackInfoMulti#9
source: Key
ta: முக்கிய

# DlgTrackInfoMulti#10
source: Grouping
ta: குழுவாக்கம்

# DlgTrackInfoMulti#11
source: Track #
ta: தடம் #

# DlgTrackInfoMulti#12
source: Comments
ta: கருத்துகள்

source: Re-Import Metadata from files
ta: கோப்புகளிலிருந்து மெட்டாடேட்டாவை மீண்டும் இறக்குமதி செய்யவும்

# DlgTrackInfoMulti#14
source: Color
ta: நிறம்

# DlgTrackInfoMulti#15
source: Duration:
ta: காலம்:

# DlgTrackInfoMulti#16
source: Filetype:
ta: கோப்பு வகை:

# DlgTrackInfoMulti#17
source: BPM:
ta: பிபிஎம்:

# DlgTrackInfoMulti#18
source: Bitrate:
ta: பிட்ரேட்:

# DlgTrackInfoMulti#19
source: Samplerate:
ta: மாதிரி:

# DlgTrackInfoMulti#20
source: Location:
ta: இடம்:
