Repository: 247i/TACETr
Catalog: உரை/தானி/mixxxdj_mixxx2-5_*.po
Languages: ta

# DlgTrackInfoMulti#21
source: Open in File Browser
ta: கோப்பு உலாவியில் திறக்கவும்

source: Discard changes and reload saved values.
ta: மாற்றங்களை நிராகரித்து, சேமித்த மதிப்புகளை மீண்டும் ஏற்றவும்.

source: &Reset
ta: &மீட்டமை

# DlgTrackInfoMulti#24
source: Discard changes and close the window.
ta: மாற்றங்களை நிராகரித்து சாளரத்தை மூடு.

# DlgTrackInfoMulti#25
source: &Cancel
ta: ரத்துசெய் (&c)

# DlgTrackInfoMulti#26
source: Save changes and keep the window open.
ta: மாற்றங்களைச் சேமித்து சாளரத்தைத் திறந்து வைக்கவும்.

# DlgTrackInfoMulti#27
source: &Apply
ta: &விண்ணப்பிக்கவும்

# DlgTrackInfoMulti#28
source: Save changes and close the window.
ta: மாற்றங்களைச் சேமித்து சாளரத்தை மூடு.

# DlgTrackInfoMulti#29
source: &OK
ta: சரி (&o)

# DlgTrackInfoMulti#30
source: (no color)
ta: (நிறம் இல்லை)

source: Import effect chain preset
ta: இறக்குமதி விளைவு சங்கிலி முன்னமைவு

source: Mixxx Effect Chain Presets
ta: Mixxx விளைவு சங்கிலி முன்னமைவுகள்

source: Error importing effect chain preset
ta: விளைவு சங்கிலி முன்னமைவை இறக்குமதி செய்வதில் பிழை

source: Error importing effect chain preset "%1"
ta: விளைவு சங்கிலி முன்னமைக்கப்பட்ட "% 1" இறக்குமதி செய்வதில் பிழை

source: imported
ta: இறக்குமதி செய்யப்பட்டது

source: duplicate
ta: நகல்

source: The effect chain imported from "%1" contains an effect that is not available:
ta: "% 1" இலிருந்து இறக்குமதி செய்யப்பட்ட விளைவு சங்கிலியானது கிடைக்காத விளைவைக் கொண்டுள்ளது:

source: If you load this chain preset, the unsupported effect will not be loaded with it.
ta: இந்த சங்கிலி முன்னமைவை ஏற்றினால், ஆதரிக்கப்படாத விளைவு அதனுடன் ஏற்றப்படாது.

source: Export effect chain preset
ta: ஏற்றுமதி விளைவு சங்கிலி முன்னமைவு

source: Error exporting effect chain preset
ta: விளைவு சங்கிலி முன்னமைவை ஏற்றுமதி செய்வதில் பிழை

source: Could not save effect chain preset "%1" to file "%2".
ta: விளைவு சங்கிலி முன்னமைக்கப்பட்ட "%1" ஐ "%2" கோப்புக்கு சேமிக்க முடியவில்லை.

source: Effect chain preset can not be renamed
ta: விளைவு சங்கிலி முன்னமைவை மறுபெயரிட முடியாது

source: Effect chain preset "%1" is read-only and can not be renamed.
ta: விளைவு சங்கிலி முன்னமைக்கப்பட்ட "% 1" படிக்க மட்டுமே மற்றும் மறுபெயரிட முடியாது.

source: Rename effect chain preset
ta: விளைவு சங்கிலி முன்னமைவை மறுபெயரிடவும்

source: New name for effect chain preset
ta: விளைவு சங்கிலி முன்னமைவுக்கான புதிய பெயர்

source: Effect chain preset name must not be empty.
ta: விளைவு சங்கிலி முன்னமைக்கப்பட்ட பெயர் காலியாக இருக்கக்கூடாது.

source: Invalid name "%1"
ta: தவறான பெயர் "% 1"

source: An effect chain preset named "%1" already exists.
ta: "%1" என்ற பெயரிடப்பட்ட விளைவு சங்கிலி முன்னமைவு ஏற்கனவே உள்ளது.

source: Error removing old effect chain preset
ta: பழைய விளைவு சங்கிலி முன்னமைவை அகற்றுவதில் பிழை

source: Could not remove old effect chain preset "%1"
ta: பழைய விளைவு சங்கிலி முன்னமைக்கப்பட்ட "% 1" ஐ அகற்ற முடியவில்லை

source: Effect chain preset can not be deleted
ta: எஃபெக்ட் செயின் முன்னமைவை நீக்க முடியாது

source: Effect chain preset "%1" is read-only and can not be deleted.
ta: விளைவு சங்கிலி முன்னமைக்கப்பட்ட "% 1" படிக்க மட்டுமே மற்றும் நீக்க முடியாது.

source: Remove effect chain preset
ta: விளைவு சங்கிலி முன்னமைவை அகற்று

source: Are you sure you want to delete the effect chain preset "%1"?
ta: "% 1" முன்னமைக்கப்பட்ட விளைவு சங்கிலியை நிச்சயமாக நீக்க விரும்புகிறீர்களா?

source: Error deleting effect chain preset
ta: விளைவு சங்கிலி முன்னமைவை நீக்குவதில் பிழை

source: Could not delete effect chain preset "%1"
ta: விளைவு சங்கிலி முன்னமைக்கப்பட்ட "% 1" ஐ நீக்க முடியவில்லை

source: Save preset for effect chain
ta: விளைவு சங்கிலிக்கு முன்னமைவைச் சேமிக்கவும்

source: Name for new effect chain preset:
ta: புதிய விளைவு சங்கிலி முன்னமைவுக்கான பெயர்:

source: Error saving effect chain preset
ta: விளைவு சங்கிலி முன்னமைவைச் சேமிப்பதில் பிழை

source: Could not save effect chain preset "%1"
ta: விளைவு சங்கிலி முன்னமைக்கப்பட்ட "% 1" ஐ சேமிக்க முடியவில்லை

# EffectManifestTableModel#1
source: Type
ta: வகை

# EffectManifestTableModel#2
source: Name
ta: பெயர்

# EffectParameterSlotBase#1
source: No effect loaded.
ta: எந்த விளைவும் ஏற்றப்படவில்லை.

source: Built-In
ta: உள்ளமைக்கப்பட்ட

# EffectsBackend#2
source: Unknown
ta: தெரியவில்லை

source: Empty
ta: காலி

source: Soundtouch (faster)
ta: சவுண்ட்டச் (வேகமாக)

source: Rubberband (better)
ta: ரப்பர்பேண்ட் (சிறந்தது)

source: Rubberband R3 (near-hi-fi quality)
ta: ரப்பர்பேண்ட் R3 (ஐ-ஃபை தரத்திற்கு அருகில்)

source: Unknown, using Rubberband (better)
ta: தெரியவில்லை, ரப்பர்பேண்டைப் பயன்படுத்துதல் (சிறந்தது)

source: Unknown, using Soundtouch
ta: தெரியவில்லை, சவுண்ட்டச் பயன்படுத்துகிறது

source: Fatal error
ta: கொடிய பிழை

source: Critical error
ta: முக்கியமான பிழை

source: Warning
ta: எச்சரிக்கை

# ErrorDialogHandler#4
source: Information
ta: தகவல்

source: Question
ta: கேள்வி

# FindOnWebMenuDiscogs#1
source: Artist
ta: கலைஞர்

# FindOnWebMenuDiscogs#2
source: Artist + Title
ta: கலைஞர் + தலைப்பு

# FindOnWebMenuDiscogs#3
source: Title
ta: தலைப்பு

# FindOnWebMenuDiscogs#4
source: Artist + Album
ta: கலைஞர் + ஆல்பம்

# FindOnWebMenuDiscogs#5
source: Album
ta: ஆல்பம்

# FindOnWebMenuLastfm#1
source: Artist
ta: கலைஞர்

# FindOnWebMenuLastfm#2
source: Artist + Title
ta: கலைஞர் + தலைப்பு

# FindOnWebMenuLastfm#3
source: Title
ta: தலைப்பு

# FindOnWebMenuLastfm#4
source: Artist + Album
ta: கலைஞர் + ஆல்பம்

# FindOnWebMenuLastfm#5
source: Album
ta: ஆல்பம்

# FindOnWebMenuSoundcloud#1
source: Artist
ta: கலைஞர்

# FindOnWebMenuSoundcloud#2
source: Artist + Title
ta: கலைஞர் + தலைப்பு

# FindOnWebMenuSoundcloud#3
source: Title
ta: தலைப்பு

# FindOnWebMenuSoundcloud#4
source: Artist + Album
ta: கலைஞர் + ஆல்பம்

# FindOnWebMenuSoundcloud#5
source: Album
ta: ஆல்பம்

# GLSLFilteredWaveformWidget#1
source: Filtered
ta: வடிகட்டப்பட்டது

# GLSLRGBStackedWaveformWidget#1
source: RGB Stacked
ta: RGB அடுக்கப்பட்டது

# GLSimpleWaveformWidget#1
source: Simple
ta: எளிமையானது

# GLWaveformWidget#1
source: Filtered
ta: வடிகட்டப்பட்டது

# HSVWaveformWidget#1
source: HSV
ta: எச்.எச்.வி

source: iTunes
ta: ஐடியூன்ச்

source: Select your iTunes library
ta: உங்கள் iTunes நூலகத்தைத் தேர்ந்தெடுக்கவும்

source: (loading) iTunes
ta: (ஏற்றுதல்) ஐடியூன்ச்

source: Use Default Library
ta: இயல்புநிலை நூலகத்தைப் பயன்படுத்தவும்

source: Choose Library...
ta: நூலகத்தைத் தேர்வுசெய்க...

source: Error Loading iTunes Library
ta: ஐடியூன்ச் நூலகத்தை ஏற்றுவதில் பிழை

source: There was an error loading your iTunes library. Check the logs for details.
ta: உங்கள் iTunes நூலகத்தை ஏற்றுவதில் பிழை. விவரங்களுக்கு பதிவுகளைப் பார்க்கவும்.

source: Safe Mode Enabled
ta: பாதுகாப்பான பயன்முறை இயக்கப்பட்டது

source: No OpenGL support.
ta: OpenGL இல்லை உதவி.

source: activate
ta: செயல்படுத்து

source: toggle
ta: மாற்று

source: right
ta: வலது

source: left
ta: இடது

source: right small
ta: சரியான சிறிய

source: left small
ta: சிறிய விட்டு

source: up
ta: மேலே

source: down
ta: கீழே

source: up small
ta: சிறியது

source: down small
ta: கீழே சிறியது

# LegacySkinParser#13
source: Shortcut
ta: குறுக்குவழி

source: This or a parent directory is already in your library.
ta: இது அல்லது பெற்றோர் கோப்பகம் ஏற்கனவே உங்கள் நூலகத்தில் உள்ளது.

source: This or a listed directory does not exist or is inaccessible. Aborting the operation to avoid library inconsistencies
ta: இது அல்லது பட்டியலிடப்பட்ட கோப்பகம் இல்லை அல்லது அணுக முடியாதது. நூலக முரண்பாடுகளைத் தவிர்க்க செயல்பாட்டை நிறுத்துதல்

source: This directory can not be read.
ta: இந்தக் கோப்பகத்தைப் படிக்க முடியாது.

source: An unknown error occurred. Aborting the operation to avoid library inconsistencies
ta: அறியப்படாத பிழை ஏற்பட்டது. நூலக முரண்பாடுகளைத் தவிர்க்க செயல்பாட்டை நிறுத்துதல்

source: Can't add Directory to Library
ta: நூலகத்தில் கோப்பகத்தைச் சேர்க்க முடியவில்லை

source: Could not add <b>%1</b> to your library. %2
ta: உங்கள் நூலகத்தில் <b>%1</b> ஐச் சேர்க்க முடியவில்லை. % 2

source: Can't remove Directory from Library
ta: நூலகத்திலிருந்து கோப்பகத்தை அகற்ற முடியாது

source: An unknown error occurred.
ta: அறியப்படாத பிழை ஏற்பட்டது.

source: This directory does not exist or is inaccessible.
ta: இந்த அடைவு இல்லை அல்லது அணுக முடியாதது.

source: Relink Directory
ta: கோப்பகத்தை மீண்டும் இணைக்கவும்

source: Could not relink <b>%1</b> to <b>%2</b>. %3
ta: <b>%1</b> ஐ <b>%2</b> உடன் மீண்டும் இணைக்க முடியவில்லை. % 3

# LibraryFeature#1
source: Import Playlist
ta: இசைப்பட்டியல் இறக்குமதி செய்

source: Playlist Files (*.m3u *.m3u8 *.pls *.csv)
ta: பிளேலிச்ட் கோப்புகள் (*.m3u *.m3u8 *.pls *.csv)

source: Overwrite File?
ta: கோப்பை மேலெழுதவா?

source: A playlist file with the name "%1" already exists. The default "m3u" extension was added because none was specified. Do you really want to overwrite it?
ta: "%1" என்ற பெயரில் ஒரு பிளேலிச்ட் கோப்பு ஏற்கனவே உள்ளது. எதுவும் குறிப்பிடப்படாததால் இயல்புநிலை "m3u" நீட்டிப்பு சேர்க்கப்பட்டது. நீங்கள் உண்மையில் அதை மேலெழுத விரும்புகிறீர்களா?

source: Library Scanner
ta: நூலக ச்கேனர்

source: It's taking Mixxx a minute to scan your music library, please wait...
ta: உங்கள் இசை நூலகத்தை வருடு செய்ய Mixxxக்கு ஒரு மணித்துளி ஆகும், தயவுசெய்து காத்திருக்கவும்...

# LibraryScannerDlg#3
source: Cancel
ta: ரத்துசெய்

source: Scanning:
ta: ச்கேனிங்:

source: Scanning cover art (safe to cancel)
ta: ச்கேனிங் கவர் ஆர்ட் (ரத்து செய்ய பாதுகாப்பானது)

source: Sort items randomly
ta: பொருட்களை சீரற்ற முறையில் வரிசைப்படுத்தவும்

source: MIDI Controller
ta: MIDI கட்டுப்படுத்தி

source: MixxxControl(s) not found
ta: MixxxControl(கள்) காணப்படவில்லை

source: One or more MixxxControls specified in the outputs section of the loaded mapping were invalid.
ta: ஏற்றப்பட்ட மேப்பிங்கின் வெளியீடுகள் பிரிவில் குறிப்பிடப்பட்ட ஒன்று அல்லது அதற்கு மேற்பட்ட MixxxControls தவறானது.

source: * Make sure the MixxxControls in question actually exist. Visit the manual for a complete list:
ta: * கேள்விக்குரிய MixxxControls உண்மையில் இருப்பதை உறுதிசெய்யவும். முழுமையான பட்டியலுக்கு கையேட்டைப் பார்வையிடவும்:

source: Some LEDs or other feedback may not work correctly.
ta: சில LED கள் அல்லது பிற கருத்துகள் சரியாக வேலை செய்யாமல் போகலாம்.

source: * Check to see that the MixxxControl names are spelled correctly in the mapping file (.xml)
ta: * மேப்பிங் கோப்பில் (.xml) MixxxControl பெயர்கள் சரியாக உச்சரிக்கப்பட்டுள்ளதா என்பதைச் சரிபார்க்கவும்.

source: Unset all
ta: அனைத்தையும் அமைக்கவும்

source: Click OK to exit.
ta: வெளியேற சரி என்பதைக் சொடுக்கு செய்யவும்.

source: Cannot upgrade database schema
ta: தரவுத்தள திட்டத்தை மேம்படுத்த முடியாது

source: Unable to upgrade your database schema to version %1
ta: உங்கள் தரவுத்தள ச்கீமாவை பதிப்பு %1க்கு மேம்படுத்த முடியவில்லை

source: For help with database issues consult:
ta: தரவுத்தளச் சிக்கல்களுக்கான உதவிக்கு, பார்க்கவும்:

source: Your mixxxdb.sqlite file may be corrupt.
ta: உங்கள் mixxxdb.sqlite கோப்பு சிதைந்திருக்கலாம்.

source: Try renaming it and restarting Mixxx.
ta: அதை மறுபெயரிட்டு Mixxx ஐ மறுதொடக்கம் செய்ய முயற்சிக்கவும்.

source: Your mixxxdb.sqlite file was created by a newer version of Mixxx and is incompatible.
ta: உங்கள் mixxxdb.sqlite கோப்பு Mixxx இன் புதிய பதிப்பால் உருவாக்கப்பட்டது மற்றும் பொருந்தாது.

source: The database schema file is invalid.
ta: தரவுத்தள திட்டக் கோப்பு தவறானது.

# MixxxLibraryFeature#1
source: Missing Tracks
ta: தடங்கள் காணவில்லை

# MixxxLibraryFeature#2
source: Hidden Tracks
ta: மறைக்கப்பட்ட தடங்கள்

# MixxxLibraryFeature#3
source: Export to Engine DJ
ta: இன்சின் DJ க்கு ஏற்றுமதி செய்யவும்

# MixxxLibraryFeature#4
source: Tracks
ta: தடங்கள்

source: Sound Device Busy
ta: ஒலி சாதனம் பிசி

source: <b>Retry</b> after closing the other application or reconnecting a sound device
ta: மற்ற பயன்பாட்டை மூடிய பிறகு அல்லது ஒலி சாதனத்தை மீண்டும் இணைத்த பிறகு <b>மீண்டும் முயற்சிக்கவும்</b>

source: <b>Reconfigure</b> Mixxx's sound device settings.
ta: Mixxx இன் ஒலி சாதன அமைப்புகளை <b>மறுகட்டமைக்கவும்</b>.

source: Get <b>Help</b> from the Mixxx Wiki.
ta: Mixxx விக்கியில் இருந்து <b>உதவி</b> பெறவும்.

source: <b>Exit</b> Mixxx.
ta: <b>வெளியேறு</b> Mixxx.

# MixxxMainWindow#6
source: Retry
ta: மீண்டும் முயற்சிக்கவும்

source: skin
ta: தோல்

source: Allow Mixxx to hide the menu bar?
ta: பட்டியல் பட்டியை மறைக்க Mixxx ஐ அனுமதிக்கவா?

source: Hide
ta: மறை

source: Always show
ta: எப்போதும் காட்டு

source: The Mixxx menu bar is hidden and can be toggled with a single press of the <b>Alt</b> key.<br><br>Click <b>%1</b> to agree.<br><br>Click <b>%2</b> to disable that, for example if you don't use Mixxx with a keyboard.<br><br>You can change this setting any time in Preferences -> Interface.<br>
ta: Mixxx பட்டியல் பட்டி மறைக்கப்பட்டுள்ளது மற்றும் <b>Alt</b> விசையை ஒருமுறை அழுத்துவதன் மூலம் மாற்றலாம்.<br><br>ஒப்புக்கொள்ள <b>%1</b> ஐ சொடுக்கு செய்யவும்.<br><br>அதை முடக்க <b>%2</b> ஐ சொடுக்கு செய்யவும், எடுத்துக்காட்டாக, நீங்கள் Mixxx விசைப்பலகையைப் பயன்படுத்தவில்லை என்றால்.<br><br>இன்டர்ஃபேச் அமைப்பை நீங்கள் எப்போது வேண்டுமானாலும் மாற்றலாம்<br>

source: Ask me again
ta: மீண்டும் என்னிடம் கேள்

source: Reconfigure
ta: மறுகட்டமைக்கவும்

source: Help
ta: உதவி

source: Exit
ta: வெளியேறு

source: Mixxx was unable to open all the configured sound devices.
ta: Mixxx ஆல் உள்ளமைக்கப்பட்ட அனைத்து ஒலி சாதனங்களையும் திறக்க முடியவில்லை.

source: Sound Device Error
ta: ஒலி சாதனப் பிழை

source: <b>Retry</b> after fixing an issue
ta: சிக்கலைச் சரிசெய்த பிறகு <b>மீண்டும் முயற்சிக்கவும்</b>

source: No Output Devices
ta: வெளியீடு சாதனங்கள் இல்லை

source: Mixxx was configured without any output sound devices. Audio processing will be disabled without a configured output device.
ta: Mixxx எந்த வெளியீட்டு ஒலி சாதனங்களும் இல்லாமல் கட்டமைக்கப்பட்டது. உள்ளமைக்கப்பட்ட வெளியீட்டு சாதனம் இல்லாமல் ஆடியோ செயலாக்கம் முடக்கப்படும்.

source: <b>Continue</b> without any outputs.
ta: எந்த வெளியீடுகளும் இல்லாமல் <b>தொடரவும்</b>.

source: Continue
ta: தொடரவும்

source: Load track to Deck %1
ta: டெக்% 1க்கு தடத்தை ஏற்றவும்

source: Deck %1 is currently playing a track.
ta: Deck% 1 தற்போது ஒரு தடத்தை இயக்குகிறது.

source: Are you sure you want to load a new track?
ta: நிச்சயமாக புதிய டிராக்கை ஏற்ற விரும்புகிறீர்களா?

source: There is no input device selected for this vinyl control. Please select an input device in the sound hardware preferences first.
ta: இந்த வினைல் கட்டுப்பாட்டிற்கு உள்ளீட்டு சாதனம் எதுவும் தேர்ந்தெடுக்கப்படவில்லை. முதலில் ஒலி வன்பொருள் விருப்பத்தேர்வுகளில் உள்ளீட்டு சாதனத்தைத் தேர்ந்தெடுக்கவும்.

source: There is no input device selected for this passthrough control. Please select an input device in the sound hardware preferences first.
ta: இந்த பாச்த்ரூ கட்டுப்பாட்டிற்கு உள்ளீட்டு சாதனம் எதுவும் தேர்ந்தெடுக்கப்படவில்லை. முதலில் ஒலி வன்பொருள் விருப்பத்தேர்வுகளில் உள்ளீட்டு சாதனத்தைத் தேர்ந்தெடுக்கவும்.

source: There is no input device selected for this microphone. Do you want to select an input device?
ta: இந்த மைக்ரோஃபோனுக்கு உள்ளீட்டு சாதனம் எதுவும் தேர்ந்தெடுக்கப்படவில்லை. உள்ளீட்டு சாதனத்தைத் தேர்ந்தெடுக்க விரும்புகிறீர்களா?

source: There is no input device selected for this auxiliary. Do you want to select an input device?
ta: இந்த துணைக்கு உள்ளீட்டு சாதனம் எதுவும் தேர்ந்தெடுக்கப்படவில்லை. உள்ளீட்டு சாதனத்தைத் தேர்ந்தெடுக்க விரும்புகிறீர்களா?

source: Error in skin file
ta: தோல் கோப்பில் பிழை

source: The selected skin cannot be loaded.
ta: தேர்ந்தெடுக்கப்பட்ட தோலை ஏற்ற முடியாது.

source: OpenGL Direct Rendering
ta: OpenGL நேரடி வழங்குதல்

source: Direct rendering is not enabled on your machine.<br><br>This means that the waveform displays will be very<br><b>slow and may tax your CPU heavily</b>. Either update your<br>configuration to enable direct rendering, or disable<br>the waveform displays in the Mixxx preferences by selecting<br>"Empty" as the waveform display in the 'Interface' section.
ta: உங்கள் கணினியில் நேரடி வழங்குதல் இயக்கப்படவில்லை.<br><br>அதாவது அலைவடிவக் காட்சிகள் மிகவும்<br><b>மெதுவாக இருக்கும் மற்றும் உங்கள் சிபியு க்கு அதிக வரி விதிக்கலாம்</b>. நேரடி ரெண்டரிங்கை இயக்குவதற்கு உங்கள்<br>உள்ளமைப்பைப் புதுப்பிக்கவும் அல்லது 'இடைமுகம்' பிரிவில் அலைவடிவக் காட்சியாக<br>"காலி" என்பதைத் தேர்ந்தெடுத்து Mixxx விருப்பங்களில் அலைவடிவக் காட்சிகளை முடக்கவும்.

source: Confirm Exit
ta: வெளியேறுவதை உறுதிப்படுத்தவும்

source: A deck is currently playing. Exit Mixxx?
ta: ஒரு டெக் தற்போது விளையாடுகிறது. Mixxx லிருந்து வெளியேறவா?

source: A sampler is currently playing. Exit Mixxx?
ta: ஒரு மாதிரி தற்போது விளையாடுகிறது. Mixxx லிருந்து வெளியேறவா?

source: The preferences window is still open.
ta: விருப்பத்தேர்வுகள் சாளரம் இன்னும் திறந்தே உள்ளது.

source: Discard any changes and exit Mixxx?
ta: ஏதேனும் மாற்றங்களை நிராகரித்து Mixxx ஐ விட்டு வெளியேறவா?

source: Operation canceled
ta: செயல்பாடு ரத்து செய்யப்பட்டது

# PlaylistFeature#1
source: Lock
ta: பூட்டு

# PlaylistFeature#2
source: Playlists
ta: பிளேலிச்ட்கள்

source: Shuffle Playlist
ta: பிளேலிச்ட்டை கலக்கவும்

# PlaylistFeature#4
source: Unlock
ta: திறக்கவும்

source: Playlists are ordered lists of tracks that allow you to plan your DJ sets.
ta: பிளேலிச்ட்கள் என்பது உங்கள் டிசே செட்களைத் திட்டமிட அனுமதிக்கும் டிராக்குகளின் வரிசைப்படுத்தப்பட்ட பட்டியல்கள்.

source: It may be necessary to skip some tracks in your prepared playlist or add some different tracks in order to maintain the energy of your audience.
ta: உங்கள் பார்வையாளர்களின் ஆற்றலைத் தக்கவைக்க, நீங்கள் தயாரித்த பிளேலிச்ட்டில் சில டிராக்குகளைத் தவிர்க்க வேண்டும் அல்லது வேறு சில டிராக்குகளைச் சேர்க்க வேண்டியிருக்கலாம்.

source: Some DJs construct playlists before they perform live, but others prefer to build them on-the-fly.
ta: சில டிசேக்கள் பிளேலிச்ட்களை நேரலையில் நிகழ்த்துவதற்கு முன் உருவாக்குகிறார்கள், ஆனால் மற்றவர்கள் அவற்றை பறக்கும்போது உருவாக்க விரும்புகிறார்கள்.

source: When using a playlist during a live DJ set, remember to always pay close attention to how your audience reacts to the music you've chosen to play.
ta: லைவ் டிசே தொகுப்பின் போது பிளேலிச்ட்டைப் பயன்படுத்தும் போது, ​​நீங்கள் விளையாடத் தேர்ந்தெடுத்த இசைக்கு உங்கள் பார்வையாளர்கள் எவ்வாறு எதிர்வினையாற்றுகிறார்கள் என்பதை எப்போதும் உன்னிப்பாகக் கவனிக்க வேண்டும்.

# PlaylistFeature#9
source: Create New Playlist
ta: புதிய பிளேலிச்ட்டை உருவாக்கவும்

source: Upgrading Mixxx
ta: Mixxxஐ மேம்படுத்துகிறது

source: Mixxx now supports displaying cover art. Do you want to scan your library for cover files now?
ta: Mixxx இப்போது கவர் ஆர்ட் காட்டுவதை ஆதரிக்கிறது. இப்போது உங்கள் லைப்ரரியில் கவர் கோப்புகளை வருடு செய்ய விரும்புகிறீர்களா?

# QMessageBox#3
source: Scan
ta: வருடு செய்யவும்

source: Later
ta: பின்னர்

source: Upgrading Mixxx from v1.9.x/1.10.x.
ta: v1.9.x/1.10.x இலிருந்து Mixxx ஐ மேம்படுத்துகிறது.

source: Mixxx has a new and improved beat detector.
ta: Mixxx ஒரு புதிய மற்றும் மேம்படுத்தப்பட்ட பீட் டிடெக்டரைக் கொண்டுள்ளது.

source: When you load tracks, Mixxx can re-analyze them and generate new, more accurate beatgrids. This will make automatic beatsync and looping more reliable.
ta: நீங்கள் டிராக்குகளை ஏற்றும் போது, ​​Mixxx அவற்றை மீண்டும் பகுப்பாய்வு செய்து புதிய, மிகவும் துல்லியமான பீட்கிரிட்களை உருவாக்க முடியும். இது தானியங்கி பீட்சின்க் மற்றும் லூப்பிங்கை மிகவும் நம்பகமானதாக மாற்றும்.

source: This does not affect saved cues, hotcues, playlists, or crates.
ta: இது சேமிக்கப்பட்ட குறிப்புகள், ஆட்குகள், பிளேலிச்ட்கள் அல்லது கிரேட்சைப் பாதிக்காது.

source: If you do not want Mixxx to re-analyze your tracks, choose "Keep Current Beatgrids". You can change this setting at any time from the "Beat Detection" section of the Preferences.
ta: Mixxx உங்கள் டிராக்குகளை மீண்டும் பகுப்பாய்வு செய்ய விரும்பவில்லை என்றால், "தற்போதைய பீட்கிரிட்களை வைத்திருங்கள்" என்பதைத் தேர்ந்தெடுக்கவும். விருப்பத்தேர்வுகளின் "பீட் கண்டறிதல்" பிரிவில் இருந்து எந்த நேரத்திலும் இந்த அமைப்பை நீங்கள் மாற்றலாம்.

source: Keep Current Beatgrids
ta: தற்போதைய பீட்கிரிட்களை வைத்திருங்கள்

source: Generate New Beatgrids
ta: புதிய பீட்கிரிட்களை உருவாக்கவும்

source: Invalid
ta: செல்லுபடியாகாத

source: Note On
ta: குறிப்பு

source: Note Off
ta: குறிப்பு ஆஃப்

source: CC
ta: சிசி

source: Pitch Bend
ta: சுருதி வளைவு

source: Unknown (0x%1)
ta: தெரியவில்லை (0x%1)

source: Normal
ta: இயல்பானது

# QObject#8
source: Invert
ta: தலைகீழாக மாற்றவும்

source: Diff
ta: வேறுபாடு

source: Button
ta: பொத்தான்

source: Switch
ta: ஆளி, நிலைமாறி

source: Spread64
ta: பரவல்64

source: HercJog
ta: எர்ட்ச் சாக்

source: SelectKnob
ta: தேர்ந்தெடுக்கவும்

source: SoftTakeover
ta: மென்மையான கையகப்படுத்தல்

source: Script
ta: ச்கிரிப்ட்

source: 14-bit (LSB)
ta: 14-பிட் (LSB)

source: 14-bit (MSB)
ta: 14-பிட் (MSB)

source: Main
ta: முக்கிய

source: Booth
ta: சாவடி

source: Headphones
ta: எட்ஃபோன்கள்

source: Left Bus
ta: புறப்பட்ட பச்

source: Center Bus
ta: சென்டர் பச்

source: Right Bus
ta: வலது பேருந்து

source: Invalid Bus
ta: செல்லாத பேருந்து

# QObject#29
source: Deck
ta: தளம்

source: Record/Broadcast
ta: பதிவு/ஒளிபரப்பு

# QObject#31
source: Vinyl Control
ta: வினைல் கட்டுப்பாடு

# QObject#32
source: Microphone
ta: ஒலிவாங்கி

source: Auxiliary
ta: துணை

source: Unknown path type %1
ta: அறியப்படாத பாதை வகை% 1

source: Using Opus at samplerates other than 48 kHz is not supported by the Opus encoder. Please use 48000 Hz in "Sound Hardware" preferences or switch to a different encoding.
ta: 48 kHz ஐத் தவிர மற்ற மாதிரிகளில் ஓபசைப் பயன்படுத்துவது ஓபச் குறியாக்கியால் ஆதரிக்கப்படாது. "ஒலி வன்பொருள்" விருப்பத்தேர்வுகளில் 48000 எர்ட்ச் பயன்படுத்தவும் அல்லது வேறு குறியாக்கத்திற்கு மாறவும்.

source: Encoder
ta: குறியாக்கி

source: Mixxx Needs Access to: %1
ta: Mixxx க்கு அணுகல் தேவை: % 1

source: Your permission is required to access the following location: %1 After clicking OK, you will see a file picker. Please select '%2' to proceed or click Cancel if you don't want to grant Mixxx access and abort this action.
ta: பின்வரும் இருப்பிடத்தை அணுக உங்கள் இசைவு தேவை: % 1 சரி என்பதைக் சொடுக்கு செய்த பிறகு, நீங்கள் ஒரு கோப்புத் தேர்வைக் காண்பீர்கள். தொடர, '%2' என்பதைத் தேர்ந்தெடுக்கவும் அல்லது Mixxx அணுகலை வழங்கவும், இந்தச் செயலை நிறுத்தவும் விரும்பவில்லை என்றால் நீக்கறல் என்பதைக் சொடுக்கு செய்யவும்.

source: You selected the wrong file. To grant Mixxx access, please select the file '%1'. If you do not want to continue, press Cancel.
ta: தவறான கோப்பைத் தேர்ந்தெடுத்துள்ளீர்கள். Mixxx அணுகலை வழங்க, '% 1' கோப்பைத் தேர்ந்தெடுக்கவும். நீங்கள் தொடர விரும்பவில்லை என்றால், நீக்கறல் என்பதை அழுத்தவும்.

source: Upgrading old Mixxx settings
ta: பழைய Mixxx அமைப்புகளை மேம்படுத்துகிறது

source: Due to macOS sandboxing, Mixxx needs your permission to access your music library and settings from Mixxx versions before 2.3.0. After clicking OK, you will see a file selection dialog. To allow Mixxx to use your old library and settings, click the Open button in the file selection dialog. Mixxx will then move your old settings into the sandbox. This only needs to be done once. If you do not want to grant Mixxx access, click Cancel on the file picker. Mixxx will create a new music library and use default settings.
ta: MacOS சாண்ட்பாக்சிங் காரணமாக, 2.3.0க்கு முன் Mixxx பதிப்புகளில் இருந்து உங்கள் இசை நூலகம் மற்றும் அமைப்புகளை அணுக Mixxxக்கு உங்கள் இசைவு தேவை. சரி என்பதைக் சொடுக்கு செய்த பிறகு, கோப்பு தேர்வு உரையாடலைக் காண்பீர்கள். உங்கள் பழைய நூலகம் மற்றும் அமைப்புகளைப் பயன்படுத்த Mixxx ஐ அனுமதிக்க, கோப்பு தேர்வு உரையாடலில் உள்ள திற பொத்தானைக் சொடுக்கு செய்யவும். Mixxx உங்கள் பழைய அமைப்புகளை சாண்ட்பாக்சில் நகர்த்தும். இதை ஒரு முறை மட்டுமே செய்ய வேண்டும். நீங்கள் Mixxx அணுகலை வழங்க விரும்பவில்லை என்றால், கோப்பு தேர்வியில் நீக்கறல் என்பதைக் சொடுக்கு செய்யவும். Mixxx ஒரு புதிய இசை நூலகத்தை உருவாக்கி இயல்புநிலை அமைப்புகளைப் பயன்படுத்தும்.

source: Bit Depth
ta: பிட் ஆழம்

source: Bitcrusher
ta: பிட்கிரசர்

source: Adds noise by the reducing the bit depth and sample rate
ta: பிட் ஆழம் மற்றும் மாதிரி விகிதத்தை குறைப்பதன் மூலம் சத்தத்தை சேர்க்கிறது

source: The bit depth of the samples
ta: மாதிரிகளின் பிட் ஆழம்

source: Downsampling
ta: டவுன்சாம்ப்ளிங்

source: Down
ta: கீழே

source: The sample rate to which the signal is downsampled
ta: சிக்னல் குறைக்கப்பட்ட மாதிரி விகிதம்

source: Echo
ta: எதிரொலி

source: Time
ta: நேரம்

source: Ping Pong
ta: பிங் பாங்
