Repository: 247i/TACETr
Catalog: உரை/தானி/mixxxdj_mixxx2-5_*.po
Languages: ta

source: Sampler Volume Meter
ta: மாதிரி வால்யூம் மீட்டர்

source: Shows the current sampler volume.
ta: தற்போதைய மாதிரி அளவைக் காட்டுகிறது.

source: Sampler Peak Indicator
ta: மாதிரி உச்சநிலை காட்டி

source: Indicates when the signal on the sampler is clipping,
ta: மாதிரியில் சிக்னல் கிளிப்பிங் செய்யும் போது குறிக்கிறது,

source: Preview Deck Volume Meter
ta: டெக் வால்யூம் மீட்டர் முன்னோட்டம்

source: Shows the current Preview Deck volume.
ta: தற்போதைய முன்னோட்ட டெக் தொகுதியைக் காட்டுகிறது.

source: Preview Deck Peak Indicator
ta: டெக் பீக் காட்டி முன்னோட்டம்

source: Indicates when the signal on the Preview Deck is clipping,
ta: முன்னோட்ட டெக்கில் சிக்னல் எப்போது கிளிப்பிங் செய்யப்படுகிறது என்பதைக் குறிக்கிறது,

# Tooltips#379
source: Maximize Library
ta: நூலகத்தை பெரிதாக்கவும்

source: Microphone Talkover Ducking Strength
ta: மைக்ரோஃபோன் டாக்ஓவர் டக்கிங் வலிமை

source: Prevents the pitch from changing when the rate changes.
ta: வீதம் மாறும்போது பிட்ச் மாறுவதைத் தடுக்கிறது.

source: Changes the number of hotcue buttons displayed in the deck
ta: டெக்கில் காட்டப்படும் ஆட்கியூ பட்டன்களின் எண்ணிக்கையை மாற்றுகிறது

source: Starts playing from the beginning of the track.
ta: பாதையின் தொடக்கத்திலிருந்து விளையாடத் தொடங்குகிறது.

source: Jumps to the beginning of the track and stops.
ta: பாதையின் தொடக்கத்தில் தாவி நிற்கிறது.

source: Plays or pauses the track.
ta: டிராக்கை இயக்குகிறது அல்லது இடைநிறுத்துகிறது.

source: (while playing)
ta: (விளையாடும்போது)

source: Opens the track properties editor
ta: டிராக் பண்புகள் எடிட்டரைத் திறக்கிறது

source: Opens the track context menu.
ta: டிராக் சூழல் மெனுவைத் திறக்கும்.

source: Main Channel R Volume Meter
ta: முதன்மை சேனல் R வால்யூம் மீட்டர்

source: (while stopped)
ta: (நிறுத்தப்பட்ட போது)

# Tooltips#391
source: Cue
ta: குறி

# Tooltips#392
source: Headphone
ta: எட்ஃபோன்

# Tooltips#393
source: Mute
ta: முடக்கு

source: Old Synchronize
ta: பழைய ஒத்திசைவு

source: Syncs to the first deck (in numerical order) that is playing a track and has a BPM.
ta: டிராக்கை இயக்கும் மற்றும் பிபிஎம் கொண்ட முதல் டெக்குடன் (எண் வரிசையில்) ஒத்திசைக்கிறது.

source: If no deck is playing, syncs to the first deck that has a BPM.
ta: எந்த தளமும் இயங்கவில்லை என்றால், BPM உள்ள முதல் டெக்குடன் ஒத்திசைக்கப்படும்.

source: Decks can't sync to samplers and samplers can only sync to decks.
ta: டெக்குகளை மாதிரிகளுடன் ஒத்திசைக்க முடியாது மற்றும் மாதிரிகள் டெக்குகளுடன் மட்டுமே ஒத்திசைக்க முடியும்.

source: Hold for at least a second to enable sync lock for this deck.
ta: இந்த டெக்கிற்கான ஒத்திசைவு பூட்டை இயக்க, குறைந்தது ஒரு வினாடியாவது காத்திருக்கவும்.

source: Decks with sync locked will all play at the same tempo, and decks that also have quantize enabled will always have their beats lined up.
ta: ஒத்திசைவு பூட்டப்பட்ட தளங்கள் அனைத்தும் ஒரே டெம்போவில் இயங்கும், மேலும் அளவு செயல்படுத்தப்பட்ட தளங்கள் எப்போதும் அவற்றின் பீட்களை வரிசையாக வைத்திருக்கும்.

source: Resets the key to the original track key.
ta: விசையை அசல் டிராக் கீக்கு மீட்டமைக்கிறது.

source: Speed Control
ta: வேகக் கட்டுப்பாடு

source: Changes the track pitch independent of the tempo.
ta: டெம்போவைச் சாராமல் டிராக் சுருதியை மாற்றுகிறது.

source: Increases the pitch by 10 cents.
ta: ஆடுகளத்தை 10 சென்ட்கள் அதிகரிக்கிறது.

source: Decreases the pitch by 10 cents.
ta: ஆடுகளத்தை 10 சென்ட்கள் குறைக்கிறது.

# Tooltips#405
source: Pitch Adjust
ta: சுருதி சரி

source: Adjust the pitch in addition to the speed slider pitch.
ta: வேக ச்லைடர் சுருதிக்கு கூடுதலாக சுருதியை சரிசெய்யவும்.

source: Opens a menu to clear hotcues or edit their labels and colors.
ta: ஆட்குகளை அழிக்க அல்லது அவற்றின் லேபிள்களையும் வண்ணங்களையும் திருத்த மெனுவைத் திறக்கும்.

# Tooltips#408
source: Record Mix
ta: பதிவு கலவை

source: Toggle mix recording.
ta: கலவை பதிவை நிலைமாற்று.

source: Enable Live Broadcasting
ta: நேரடி ஒளிபரப்பை இயக்கு

# Tooltips#411
source: Stream your mix over the Internet.
ta: இணையத்தில் உங்கள் கலவையை ச்ட்ரீம் செய்யவும்.

source: Provides visual feedback for Live Broadcasting status:
ta: நேரடி ஒளிபரப்பு நிலைக்கான காட்சிப் பின்னூட்டத்தை வழங்குகிறது:

source: disabled, connecting, connected, failure.
ta: முடக்கப்பட்ட, இணைக்கும், இணைக்கப்பட்ட, தோல்வி.

source: When enabled, the deck directly plays the audio arriving on the vinyl input.
ta: இயக்கப்பட்டால், வினைல் உள்ளீட்டில் வரும் ஆடியோவை டெக் நேரடியாக இயக்குகிறது.

source: Playback will resume where the track would have been if it had not entered the loop.
ta: லூப்பில் நுழையாமல் இருந்திருந்தால், டிராக் இருந்த இடத்தில் பிளேபேக் மீண்டும் தொடங்கும்.

# Tooltips#416
source: Loop Exit
ta: லூப் வெளியேறு

source: Turns the current loop off.
ta: தற்போதைய சுழற்சியை அணைக்கிறது.

# Tooltips#418
source: Slip Mode
ta: ச்லிப் பயன்முறை

source: When active, the playback continues muted in the background during a loop, reverse, scratch etc.
ta: செயலில் இருக்கும்போது, ​​லூப், ரிவர்ச், ச்கிராட்ச் போன்றவற்றின் போது பின்னணியில் பிளேபேக் தொடர்ந்து ஒலியடக்கப்படும்.

source: Once disabled, the audible playback will resume where the track would have been.
ta: முடக்கப்பட்டதும், ட்ராக் இருந்த இடத்தில் கேட்கக்கூடிய பிளேபேக் மீண்டும் தொடங்கும்.

source: Track Key
ta: தட விசை

source: Displays the musical key of the loaded track.
ta: ஏற்றப்பட்ட பாதையின் இசை விசையைக் காட்டுகிறது.

source: Clock
ta: கடிகை

source: Displays the current time.
ta: தற்போதைய நேரத்தைக் காட்டுகிறது.

source: Audio Latency Usage Meter
ta: ஆடியோ லேட்டன்சி பயன்பாட்டு மீட்டர்

source: Displays the fraction of latency used for audio processing.
ta: ஆடியோ செயலாக்கத்திற்குப் பயன்படுத்தப்படும் தாமதத்தின் பகுதியைக் காட்டுகிறது.

source: A high value indicates that audible glitches are likely.
ta: அதிக மதிப்பு, கேட்கக்கூடிய குறைபாடுகள் நிகழக்கூடிய என்பதைக் குறிக்கிறது.

source: Do not enable keylock, effects or additional decks in this situation.
ta: இந்தச் சூழ்நிலையில் கீலாக், எஃபெக்ட்ச் அல்லது கூடுதல் டெக்குகளை இயக்க வேண்டாம்.

source: Audio Latency Overload Indicator
ta: ஆடியோ லேட்டன்சி ஓவர்லோட் காட்டி

source: If Vinyl control is enabled, displays time-coded vinyl signal quality (see Preferences -> Vinyl Control).
ta: வினைல் கட்டுப்பாடு இயக்கப்பட்டால், நேர-குறியிடப்பட்ட வினைல் சிக்னல் தரத்தைக் காட்டுகிறது (விருப்பங்கள் -> வினைல் கட்டுப்பாடு பார்க்கவும்).

source: Drop tracks from library, external file manager, or other decks/samplers here.
ta: நூலகம், வெளிப்புற கோப்பு மேலாளர் அல்லது பிற தளங்கள்/மாதிரிகளில் இருந்து டிராக்குகளை இங்கே விடுங்கள்.

source: Change the crossfader curve in Preferences -> Crossfader
ta: முன்னுரிமைகள் -> கிராச்ஃபேடரில் கிராச்ஃபேடர் வளைவை மாற்றவும்

source: Crossfader Orientation
ta: கிராச்ஃபேடர் நோக்குநிலை

source: Set the channel's crossfader orientation.
ta: சேனலின் கிராச்ஃபேடர் நோக்குநிலையை அமைக்கவும்.

source: Either to the left side of crossfader, to the right side or to the center (unaffected by crossfader)
ta: கிராச்ஃபேடரின் இடது பக்கமாகவோ, வலது பக்கமாகவோ அல்லது மையமாகவோ (கிராச்ஃபேடரால் பாதிக்கப்படாது)

source: Activate Vinyl Control from the Menu -> Options.
ta: பட்டியல் -> விருப்பங்களிலிருந்து வினைல் கட்டுப்பாட்டை செயல்படுத்தவும்.

source: Displays the current musical key of the loaded track after pitch shifting.
ta: சுருதி மாற்றத்திற்குப் பிறகு ஏற்றப்பட்ட டிராக்கின் தற்போதைய இசை விசையைக் காட்டுகிறது.

# Tooltips#438
source: Fast Rewind
ta: ஃபாச்ட் ரிவைண்ட்

source: Fast rewind through the track.
ta: பாதையில் வேகமாக முன்னாடி.

# Tooltips#440
source: Fast Forward
ta: வேகமாக முன்னோக்கி

source: Fast forward through the track.
ta: பாதை வழியாக வேகமாக முன்னேறுங்கள்.

source: Jumps to the end of the track.
ta: பாதையின் முடிவில் தாவுகிறது.

source: Sets the pitch to a key that allows a harmonic transition from the other track. Requires a detected key on both involved decks.
ta: சுருதியை மற்ற டிராக்கிலிருந்து ஆர்மோனிக் மாற்றத்தை அனுமதிக்கும் விசைக்கு அமைக்கிறது. சம்பந்தப்பட்ட இரண்டு தளங்களிலும் கண்டறியப்பட்ட விசை தேவை.

source: Pitch Control
ta: சுருதி கட்டுப்பாடு

source: Pitch Rate
ta: பிட்ச் வீதம்

source: Displays the current playback rate of the track.
ta: டிராக்கின் தற்போதைய பிளேபேக் வீதத்தைக் காட்டுகிறது.

# Tooltips#447
source: Repeat
ta: மீண்டும் செய்யவும்

source: When active the track will repeat if you go past the end or reverse before the start.
ta: செயலில் இருக்கும்போது, ​​நீங்கள் முடிவைக் கடந்தால் அல்லது தொடக்கத்திற்கு முன் தலைகீழாகச் சென்றால், தடம் மறுநிகழ்வு வரும்.

# Tooltips#449
source: Eject
ta: வெளியேற்று

source: Ejects track from the player.
ta: பிளேயரில் இருந்து டிராக்கை வெளியேற்றுகிறது.

source: Hotcue
ta: ஆட்க்யூ

source: If hotcue is set, jumps to the hotcue.
ta: ஆட்கியூ அமைக்கப்பட்டால், ஆட்கியூவுக்குத் தாவுகிறது.

source: If hotcue is not set, sets the hotcue to the current play position.
ta: ஆட்கியூ அமைக்கப்படவில்லை என்றால், ஆட்கியூவை தற்போதைய பிளே நிலைக்கு அமைக்கும்.

# Tooltips#454
source: Vinyl Control Mode
ta: வினைல் கட்டுப்பாட்டு முறை

source: Absolute mode - track position equals needle position and speed.
ta: முழுமையான பயன்முறை - டிராக் நிலை ஊசி நிலை மற்றும் வேகத்திற்கு சமம்.

source: Relative mode - track speed equals needle speed regardless of needle position.
ta: தொடர்புடைய முறை - ட்ராக் விரைவு ஊசியின் நிலையைப் பொருட்படுத்தாமல் ஊசி வேகத்திற்கு சமம்.

source: Constant mode - track speed equals last known-steady speed regardless of needle input.
ta: நிலையான பயன்முறை - டிராக் விரைவு ஊசி உள்ளீட்டைப் பொருட்படுத்தாமல் கடைசியாக அறியப்பட்ட-நிலையான வேகத்திற்கு சமம்.

source: Vinyl Status
ta: வினைல் நிலை

source: Provides visual feedback for vinyl control status:
ta: வினைல் கட்டுப்பாட்டு நிலைக்கு காட்சி பின்னூட்டத்தை வழங்குகிறது:

source: Green for control enabled.
ta: கட்டுப்பாடு இயக்கப்பட்ட பச்சை.

source: Blinking yellow for when the needle reaches the end of the record.
ta: பதிவின் முடிவை ஊசி அடையும் போது மஞ்சள் ஒளிரும்.

source: Loop-In Marker
ta: லூப்-இன் மார்க்கர்

source: Loop-Out Marker
ta: லூப்-அவுட் மார்க்கர்

# Tooltips#464
source: Loop Halve
ta: லூப் பாதி

source: Halves the current loop's length by moving the end marker.
ta: இறுதி மார்க்கரை நகர்த்துவதன் மூலம் தற்போதைய சுழற்சியின் நீளத்தை பாதியாக குறைக்கவும்.

source: Deck immediately loops if past the new endpoint.
ta: புதிய முனைப்புள்ளியை கடந்தால் டெக் உடனடியாக சுழலும்.

# Tooltips#467
source: Loop Double
ta: லூப் டபுள்

source: Doubles the current loop's length by moving the end marker.
ta: இறுதி மார்க்கரை நகர்த்துவதன் மூலம் தற்போதைய சுழற்சியின் நீளத்தை இரட்டிப்பாக்குகிறது.

source: Beatloop
ta: பீட்லூப்

source: Toggles the current loop on or off.
ta: தற்போதைய சுழற்சியை ஆன் அல்லது ஆஃப் செய்யும்.

source: Works only if Loop-In and Loop-Out marker are set.
ta: லூப்-இன் மற்றும் லூப்-அவுட் மார்க்கர் அமைக்கப்பட்டால் மட்டுமே வேலை செய்யும்.

source: Hint: Change the default cue mode in Preferences -> Interface.
ta: குறிப்பு: விருப்பத்தேர்வுகள் -> இடைமுகத்தில் இயல்புநிலை க்யூ பயன்முறையை மாற்றவும்.

source: Vinyl Cueing Mode
ta: வினைல் கியூயிங் பயன்முறை

source: Determines how cue points are treated in vinyl control Relative mode:
ta: வினைல் கன்ட்ரோல் ரிலேடிவ் பயன்முறையில் க்யூ புள்ளிகள் எவ்வாறு கையாளப்படுகின்றன என்பதைத் தீர்மானிக்கிறது:

source: Off - Cue points ignored.
ta: ஆஃப் - கியூ புள்ளிகள் புறக்கணிக்கப்பட்டது.

source: One Cue - If needle is dropped after the cue point, track will seek to that cue point.
ta: ஒன் கியூ - க்யூ பாயிண்டிற்குப் பிறகு ஊசி கைவிடப்பட்டால், டிராக் அந்த க்யூ பாயிண்டைத் தேடும்.

source: Track Time
ta: டிராக் நேரம்

source: Track Duration
ta: ட்ராக் காலம்

source: Displays the duration of the loaded track.
ta: ஏற்றப்பட்ட பாதையின் கால அளவைக் காட்டுகிறது.

source: Information is loaded from the track's metadata tags.
ta: டிராக்கின் மேனிலை தரவு குறிச்சொற்களில் இருந்து செய்தி ஏற்றப்படுகிறது.

source: Track Artist
ta: தடக் கலைஞர்

source: Displays the artist of the loaded track.
ta: ஏற்றப்பட்ட பாதையின் கலைஞரைக் காட்டுகிறது.

source: Track Title
ta: ட்ராக் தலைப்பு

source: Displays the title of the loaded track.
ta: ஏற்றப்பட்ட பாதையின் தலைப்பைக் காட்டுகிறது.

source: Track Album
ta: டிராக் ஆல்பம்

source: Displays the album name of the loaded track.
ta: ஏற்றப்பட்ட டிராக்கின் ஆல்பத்தின் பெயரைக் காட்டுகிறது.

source: Track Artist/Title
ta: பாடல் கலைஞர்/தலைப்பு

source: Displays the artist and title of the loaded track.
ta: ஏற்றப்பட்ட பாதையின் கலைஞர் மற்றும் தலைப்பைக் காட்டுகிறது.

source: Hiding tracks
ta: தடங்களை மறைக்கிறது

source: The selected tracks are in the following playlists:%1Hiding them will remove them from these playlists. Continue?
ta: தேர்ந்தெடுக்கப்பட்ட ட்ராக்குகள் பின்வரும் பிளேலிச்ட்களில் உள்ளன:% 1அவற்றை மறைப்பது இந்த பிளேலிச்ட்களில் இருந்து நீக்கப்படும். தொடரவா?

source: Export finished
ta: ஏற்றுமதி முடிந்தது

source: Exporting %1
ta: ஏற்றுமதி செய்கிறது% 1

source: Overwrite Existing File?
ta: ஏற்கனவே உள்ள கோப்பை மேலெழுதவா?

source: "%1" already exists, overwrite?
ta: "% 1" ஏற்கனவே உள்ளது, மேலெழுதவா?

source: &Overwrite
ta: &மேலெழுதவும்

source: Over&write All
ta: அனைத்தையும் மேல்&எழுது

source: &Skip
ta: &தவிர்

source: Skip &All
ta: &அனைத்தையும் தவிர்

source: Export Error
ta: ஏற்றுமதி பிழை

source: Export Track Files To
ta: ட்ராக் கோப்புகளை ஏற்றுமதி செய்யவும்

source: Export process was canceled
ta: ஏற்றுமதி செயல்முறை ரத்து செய்யப்பட்டது

source: Error removing file %1: %2. Stopping.
ta: கோப்பை அகற்றுவதில் பிழை % 1:% 2. நிறுத்துதல்.

source: Error exporting track %1 to %2: %3. Stopping.
ta: டிராக்% 1 முதல்% 2 வரை ஏற்றுமதி செய்வதில் பிழை:% 3. நிறுத்துதல்.

source: Error exporting tracks
ta: தடங்களை ஏற்றுமதி செய்வதில் பிழை

source: Traktor
ta: டிராக்டர்

source: (loading) Traktor
ta: (ஏற்றுதல்) டிராக்டர்

source: Error Loading Traktor Library
ta: டிராக்டர் நூலகத்தை ஏற்றுவதில் பிழை

source: There was an error loading your Traktor library. Some of your Traktor tracks or playlists may not have loaded.
ta: உங்கள் டிராக்டர் நூலகத்தை ஏற்றுவதில் பிழை. உங்களின் சில டிராக்டர் டிராக்குகள் அல்லது பிளேலிச்ட்கள் ஏற்றப்படாமல் இருக்கலாம்.

source: Timer (Fallback)
ta: நேரங்குறிகருவி (ஃபால்பேக்)

source: Wait for Video sync
ta: வீடியோ ஒத்திசைவுக்காக காத்திருங்கள்

source: Sync Control
ta: ஒத்திசைவு கட்டுப்பாடு

source: Free + 1 ms (for benchmark only)
ta: இலவசம் + 1 எம்எச் (பெஞ்ச்மார்க்கிற்கு மட்டும்)

source: frameSwapped-signal driven phase locked loop
ta: frameSwapped-சிக்னல் இயக்கப்படும் கட்டம் பூட்டப்பட்ட வளையம்

source: Time until charged: %1
ta: சார்ச் ஆகும் வரை நேரம்:% 1

source: Time left: %1
ta: மீதமுள்ள நேரம்:% 1

source: Battery fully charged.
ta: பேட்டரி முழுமையாக சார்ச் செய்யப்பட்டுள்ளது.

source: No color
ta: நிறம் இல்லை

source: Custom color
ta: விருப்ப நிறம்

# change cover art location
source: Choose new cover
ta: புதிய கவர் தேர்வு செய்யவும்

# clears the set cover art -- does not touch files on disk
source: Clear cover
ta: தெளிவான கவர்

# reload cover art from file metadata or folder
source: Reload from file/folder
ta: கோப்பு/கோப்புறையிலிருந்து மீண்டும் ஏற்றவும்

source: Image Files
ta: பட கோப்புகள்

source: Change Cover Art
ta: கவர் கலையை மாற்றவும்

# WCoverArtMenu#6
source: Cover Art File Already Exists
ta: கவர் ஆர்ட் கோப்பு ஏற்கனவே உள்ளது

# WCoverArtMenu#7
source: File: %1 Folder: %2 Override existing file? This can not be undone!
ta: கோப்பு: % 1 கோப்புறை:% 2 ஏற்கனவே உள்ள கோப்பை மேலெழுதவா? இதை செயல்தவிர்க்க முடியாது!

source: Cue number
ta: குறி எண்

source: Cue position
ta: குறி நிலை

source: Edit cue label
ta: க்யூ லேபிளைத் திருத்தவும்

source: Label...
ta: லேபிள்...

source: Delete this cue
ta: இந்த குறிப்பை நீக்கவும்

source: Toggle this cue type between normal cue and saved loop
ta: இந்த க்யூ வகையை சாதாரண குறி மற்றும் சேமித்த லூப் இடையே மாற்றவும்

source: Left-click: Use the old size or the current beatloop size as the loop size
ta: இடது கிளிக்: பழைய அளவு அல்லது தற்போதைய பீட்லூப் அளவை லூப் அளவாகப் பயன்படுத்தவும்

source: Right-click: Use the current play position as loop end if it is after the cue
ta: Right-click: Use the மின்னோட்ட்ம், ஓட்டம் play position அச் loop end if it is after the cue

source: Hotcue #%1
ta: ஆட்கியூ #% 1

source: Update Preset
ta: முன்னமைவைப் புதுப்பிக்கவும்

source: Rename Preset
ta: முன்னமைவை மறுபெயரிடவும்

source: Save As New Preset...
ta: புதிய முன்னமைவாக சேமி...

source: Save snapshot
ta: ச்னாப்சாட்டைச் சேமிக்கவும்

# WEffectName#2
source: No effect loaded.
ta: எந்த விளைவும் ஏற்றப்படவில்லை.

# WEffectParameterNameBase#1
source: No effect loaded.
ta: எந்த விளைவும் ஏற்றப்படவில்லை.

# WEffectSelector#1
source: No effect loaded.
ta: எந்த விளைவும் ஏற்றப்படவில்லை.

source: Find on Web
ta: இணையத்தில் கண்டுபிடிக்கவும்

source: &File
ta: கோப்பு (&f)

source: Load Track to Deck &%1
ta: ட்ராக்கை டெக்கில் ஏற்றவும் &% 1

source: Loads a track in deck %1
ta: டெக்% 1 இல் ஒரு தடத்தை ஏற்றுகிறது

source: Open
ta: திற

source: &Exit
ta: &வெளியேறு

source: Quits Mixxx
ta: Mixxx ஐ விட்டு வெளியேறுகிறது

source: &Library
ta: &நூலகம்

source: &Rescan Library
ta: &நூலகத்தை மீண்டும் வருடு செய்யவும்

source: Rescans library folders for changes to tracks.
ta: டிராக்குகளில் மாற்றங்களுக்கு லைப்ரரி கோப்புறைகளை மீண்டும் வருடு செய்கிறது.

source: Create &New Playlist
ta: புதிய பிளேலிச்ட்டை உருவாக்கவும்

source: Create a new playlist
ta: புதிய பிளேலிச்ட்டை உருவாக்கவும்

source: Create New &Crate
ta: புதிய &Crate உருவாக்கவும்

source: Create a new crate
ta: புதிய பெட்டியை உருவாக்கவும்

source: &View
ta: காண்க (&v)

source: Auto-hide menu bar
ta: பட்டியல் பட்டியை தானாக மறை

source: Auto-hide the main menu bar when it's not used.
ta: முதன்மையான பட்டியல் பட்டியைப் பயன்படுத்தாதபோது தானாக மறை.

source: May not be supported on all skins.
ta: அனைத்து தோல்களிலும் ஆதரிக்கப்படாமல் இருக்கலாம்.

source: Show Skin Settings Menu
ta: தோல் அமைப்புகள் மெனுவைக் காட்டு

source: Show the Skin Settings Menu of the currently selected Skin
ta: தற்போது தேர்ந்தெடுக்கப்பட்ட தோலின் தோல் அமைப்புகள் மெனுவைக் காட்டு

source: Show Microphone Section
ta: மைக்ரோஃபோன் பிரிவைக் காட்டு

source: Show the microphone section of the Mixxx interface.
ta: Mixxx இடைமுகத்தின் மைக்ரோஃபோன் பகுதியைக் காட்டு.

source: Show Vinyl Control Section
ta: வினைல் கட்டுப்பாட்டு பிரிவைக் காட்டு

source: Show the vinyl control section of the Mixxx interface.
ta: Mixxx இடைமுகத்தின் வினைல் கட்டுப்பாட்டுப் பகுதியைக் காட்டு.

source: Show Preview Deck
ta: முன்னோட்ட டெக்கைக் காட்டு

source: Show the preview deck in the Mixxx interface.
ta: Mixxx இடைமுகத்தில் முன்னோட்ட டெக்கைக் காட்டு.

source: Show Cover Art
ta: அட்டைப்படத்தைக் காட்டு

source: Show cover art in the Mixxx interface.
ta: Mixxx இடைமுகத்தில் கவர் கலையைக் காட்டு.

# WMainMenuBar#37
source: Maximize Library
ta: நூலகத்தை பெரிதாக்கவும்

# WMainMenuBar#38
source: Maximize the track library to take up all the available screen space.
ta: கிடைக்கக்கூடிய அனைத்து திரை இடத்தையும் எடுத்துக்கொள்ள, டிராக் லைப்ரரியை அதிகரிக்கவும்.

# Menubar|View|Maximize Library
source: Space
ta: இடைவெளி

source: &Full Screen
ta: முழுத்திரை

source: Display Mixxx using the full screen
ta: முழுத் திரையைப் பயன்படுத்தி Mixxxஐக் காட்டவும்

source: &Options
ta: &விருப்பங்கள்

source: &Vinyl Control
ta: &வினைல் கட்டுப்பாடு

source: Use timecoded vinyls on external turntables to control Mixxx
ta: Mixxx ஐக் கட்டுப்படுத்த வெளிப்புற டர்ன்டேபிள்களில் நேரக் குறியீடு வினைலைப் பயன்படுத்தவும்

source: Enable Vinyl Control &%1
ta: வினைல் கட்டுப்பாட்டை இயக்கு &% 1

source: &Record Mix
ta: &பதிவு கலவை

source: Record your mix to a file
ta: உங்கள் கலவையை ஒரு கோப்பில் பதிவு செய்யவும்

source: Enable Live &Broadcasting
ta: நேரலை &ஒளிபரப்பை இயக்கு

source: Stream your mixes to a shoutcast or icecast server
ta: உங்கள் கலவைகளை சவுட்காச்ட் அல்லது ஐச்காச்ட் சர்வரில் ச்ட்ரீம் செய்யவும்

source: Enable &Keyboard Shortcuts
ta: &விசைப்பலகை குறுக்குவழிகளை இயக்கு

source: Toggles keyboard shortcuts on or off
ta: விசைப்பலகை குறுக்குவழிகளை ஆன் அல்லது ஆஃப் செய்யும்

source: &Preferences
ta: &விருப்பத்தேர்வுகள்

source: Change Mixxx settings (e.g. playback, MIDI, controls)
ta: Mixxx அமைப்புகளை மாற்றவும் (எ.கா. பிளேபேக், MIDI, கட்டுப்பாடுகள்)

source: &Developer
ta: &டெவலப்பர்

source: &Reload Skin
ta: &தோலை மீண்டும் ஏற்றவும்

source: Reload the skin
ta: தோலை மீண்டும் ஏற்றவும்

source: Developer &Tools
ta: உருவாக்குபவர் கருவிகள்

source: Opens the developer tools dialog
ta: உருவாக்குபவர் கருவிகள் உரையாடலைத் திறக்கிறது

source: Stats: &Experiment Bucket
ta: புள்ளிவிவரங்கள்: &பரிசோதனை பக்கெட்

source: Enables experiment mode. Collects stats in the EXPERIMENT tracking bucket.
ta: ஆய்வு பயன்முறையை இயக்குகிறது. ஆய்வு கண்காணிப்பு வாளியில் புள்ளிவிவரங்களைச் சேகரிக்கிறது.

source: Stats: &Base Bucket
ta: புள்ளிவிவரங்கள்: &பேச் பக்கெட்

source: Enables base mode. Collects stats in the BASE tracking bucket.
ta: அடிப்படை பயன்முறையை இயக்குகிறது. காரம் கண்காணிப்பு வாளியில் புள்ளிவிவரங்களைச் சேகரிக்கிறது.

source: Deb&ugger Enabled
ta: Deb&ugger இயக்கப்பட்டது

source: Enables the debugger during skin parsing
ta: தோல் பாகுபடுத்தலின் போது பிழைத்திருத்தியை இயக்குகிறது

# WMainMenuBar#73
source: &Help
ta: உதவி (&h)

source: Show Keywheel
ta: கீவீலைக் காட்டு

source: E&xport Library to Engine DJ
ta: இன்சின் DJ க்கு நூலகத்தை ஏற்றுமதி&ஏற்றுமதி

source: Export the library to the Engine DJ format
ta: என்சின் டிசே வடிவமைப்பிற்கு நூலகத்தை ஏற்றுமதி செய்யவும்

source: Show keywheel
ta: திறவுகோல் சக்கரத்தைக் காட்டு

source: &Community Support
ta: &சமூக உதவி

source: Get help with Mixxx
ta: Mixxx உடன் உதவி பெறவும்

source: &User Manual
ta: &பயனர் கையேடு

source: Read the Mixxx user manual.
ta: Mixxx பயனர் கையேட்டைப் படிக்கவும்.

source: &Keyboard Shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

source: Speed up your workflow with keyboard shortcuts.
ta: விசைப்பலகை குறுக்குவழிகள் மூலம் உங்கள் பணிப்பாய்வுகளை விரைவுபடுத்துங்கள்.

source: &Settings directory
ta: &அமைப்புகள் அடைவு

source: Open the Mixxx user settings directory.
ta: Mixxx பயனர் அமைப்புகள் கோப்பகத்தைத் திறக்கவும்.

source: &Translate This Application
ta: &இந்த பயன்பாட்டை மொழிபெயர்க்கவும்

source: Help translate this application into your language.
ta: இந்தப் பயன்பாட்டை உங்கள் மொழியில் மொழிபெயர்க்க உதவவும்.

source: &About
ta: &பற்றி

source: About the application
ta: விண்ணப்பத்தைப் பற்றி

# WOverview#1
source: Passthrough
ta: பாச்த்ரூ

source: Ready to play, analyzing...
ta: விளையாடத் ஆயத்தம், பகுப்பாய்வு...

source: Loading track...
ta: ட்ராக்கை ஏற்றுகிறது...

source: Finalizing...
ta: இறுதி செய்கிறது...

# Clear the search bar input field
source: Clear input
ta: தெளிவான உள்ளீடு

# noun
source: Search
ta: தேடல்

source: Clear input
ta: தெளிவான உள்ளீடு

source: Search...
ta: தேடு...

source: Clear the search bar input field
ta: தேடல் பட்டி உள்ளீட்டு புலத்தை அழிக்கவும்

source: Enter a string to search for
ta: தேட ஒரு சரத்தை உள்ளிடவும்

source: Use operators like bpm:115-128, artist:BooFar, -year:1990
ta: bpm:115-128, artist:BooFar, -year:1990 போன்ற ஆபரேட்டர்களைப் பயன்படுத்தவும்

source: For more information see User Manual > Mixxx Library
ta: மேலும் தகவலுக்கு பயனர் கையேடு > Mixxx நூலகம் பார்க்கவும்

# WSearchLineEdit#10
source: Shortcut
ta: குறுக்குவழி

# Give search bar input focus
source: Focus
ta: குவி

source: Shortcuts
ta: குறுக்குவழிகள்

source: Return
ta: திரும்பு

source: Trigger search before search-as-you-type timeout orjump to tracks view afterwards
ta: தேடலைத் தொடங்குவதற்கு முன் தேடலைத் தூண்டவும்

# Shows/hides the search history entries
source: Toggle search history
ta: தேடல் வரலாற்றை நிலைமாற்று

source: Delete or Backspace
ta: நீக்கு அல்லது பேக்ச்பேச்

source: Delete query from history
ta: வரலாற்றிலிருந்து வினவலை நீக்கு

source: Esc
ta: தப்பி

# Exit search bar and leave focus
source: Exit search
ta: தேடலில் இருந்து வெளியேறு

source: Search related Tracks
ta: தொடர்புடைய தடங்களைத் தேடுங்கள்

# WSearchRelatedTracksMenu#2
source: Key
ta: முக்கிய

source: harmonic with %1
ta: % 1 உடன் இணக்கமானது

# WSearchRelatedTracksMenu#4
source: BPM
ta: பிபிஎம்

source: between %1 and %2
ta: % 1 மற்றும்% 2 இடையே

# WSearchRelatedTracksMenu#6
source: Artist
ta: கலைஞர்

# WSearchRelatedTracksMenu#7
source: Album Artist
ta: ஆல்பம் கலைஞர்

# WSearchRelatedTracksMenu#8
source: Composer
ta: இசையமைப்பாளர்

# WSearchRelatedTracksMenu#9
source: Title
ta: தலைப்பு
