Repository: 247i/TACETr
Catalog: உரை/தானி/mixxxdj_mixxx2-5_*.po
Languages: ta

source: Reads databases exported for Pioneer CDJ / XDJ players using the Rekordbox Export mode.<br/>Rekordbox can only export to USB or SD devices with a FAT or HFS file system.<br/>Mixxx can read a database from any device that contains the database folders (<tt>PIONEER</tt> and <tt>Contents</tt>).<br/>Not supported are Rekordbox databases that have been moved to an external device via<br/><i>Preferences > Advanced > Database management</i>.<br/><br/>The following data is read:
ta: Rekordbox ஏற்றுமதி பயன்முறையைப் பயன்படுத்தி Pioneer CDJ / XDJ பிளேயர்களுக்கு ஏற்றுமதி செய்யப்பட்ட தரவுத்தளங்களைப் படிக்கிறது.<br/>FAT அல்லது HFS கோப்பு முறைமையுடன் கூடிய USB அல்லது SD சாதனங்களுக்கு மட்டுமே Rekordbox ஏற்றுமதி செய்ய முடியும்.<br/>Mixxx தரவுத்தள கோப்புறைகள் (<tt>PIONEER>></tt> ஆதரிக்கும் தரவுத்தளக் கோப்புறைகளைக் கொண்ட எந்தச் சாதனத்திலிருந்தும் தரவுத்தளத்தைப் படிக்க முடியும்).<br/> Rekordbox தரவுத்தளங்கள்<br/><i>விருப்பத்தேர்வுகள் > மேம்பட்ட > தரவுத்தள மேலாண்மை</i> வழியாக வெளிப்புற சாதனத்திற்கு நகர்த்தப்பட்டன.<br/><br/>பின்வரும் தரவு படிக்கப்படுகிறது:

source: Hot cues
ta: சூடான குறிப்புகள்

source: Loops (only the first loop is currently usable in Mixxx)
ta: லூப்கள் (முதல் லூப் மட்டுமே தற்போது Mixxx இல் பயன்படுத்தப்படுகிறது)

source: Check for attached Rekordbox USB / SD devices (refresh)
ta: இணைக்கப்பட்ட Rekordbox USB / SD சாதனங்களைச் சரிபார்க்கவும் (புதுப்பித்தல்)

source: Beatgrids
ta: பீட்கிரிட்ச்

source: Memory cues
ta: நினைவக குறிப்புகள்

source: (loading) Rekordbox
ta: (ஏற்றுதல்) பதிவு பெட்டி

source: Rhythmbox
ta: ரிதம்பாக்ச்

source: Mixxx Sampler Banks (*.xml)
ta: Mixxx மாதிரி வங்கிகள் (*.xml)

# SamplerBank#2
source: Save Sampler Bank
ta: மாதிரி வங்கியைச் சேமிக்கவும்

source: Error Saving Sampler Bank
ta: மாதிரி வங்கியைச் சேமிப்பதில் பிழை

source: Could not write the sampler bank to '%1'.
ta: மாதிரி வங்கியை '%1'க்கு எழுத முடியவில்லை.

# SamplerBank#5
source: Load Sampler Bank
ta: ஏற்ற மாதிரி வங்கி

source: Error Reading Sampler Bank
ta: மாதிரி வங்கியைப் படிப்பதில் பிழை

source: Could not open the sampler bank file '%1'.
ta: மாதிரி வங்கிக் கோப்பை '% 1' திறக்க முடியவில்லை.

source: Serato
ta: மாலை

source: Reads the following from the Serato Music directory and removable devices:
ta: Serato இசை அடைவு மற்றும் நீக்கக்கூடிய சாதனங்களிலிருந்து பின்வருவனவற்றைப் படிக்கிறது:

# SeratoFeature#3
source: Tracks
ta: தடங்கள்

# SeratoFeature#4
source: Crates
ta: கிரேட்ச்

source: Check for Serato databases (refresh)
ta: செரட்டோ தரவுத்தளங்களைச் சரிபார்க்கவும் (புதுப்பித்தல்)

source: (loading) Serato
ta: (ஏற்றுதல்) செரட்டோ

source: Join with previous (below)
ta: முந்தைய (கீழே) உடன் சேரவும்

source: Mark all tracks played
ta: விளையாடிய எல்லா டிராக்குகளையும் குறிக்கவும்

source: Finish current and start new
ta: மின்னோட்டத்தை முடித்து புதியதைத் தொடங்கவும்

source: Lock all child playlists
ta: அனைத்து குழந்தை பிளேலிச்ட்களையும் பூட்டு

source: Unlock all child playlists
ta: அனைத்து குழந்தை பிளேலிச்ட்களையும் திறக்கவும்

source: Delete all unlocked child playlists
ta: திறக்கப்பட்ட அனைத்து குழந்தை பிளேலிச்ட்களையும் நீக்கவும்

source: History
ta: வரலாறு

# SetlogFeature#8
source: Unlock
ta: திறக்கவும்

# SetlogFeature#9
source: Lock
ta: பூட்டு

# SetlogFeature#10
source: Confirm Deletion
ta: நீக்குதலை உறுதிப்படுத்தவும்

source: Do you really want to delete all unlocked playlist from <b>%1</b>?<br><br>
ta: <b>%1</b> இலிருந்து அனைத்து திறக்கப்பட்ட பிளேலிச்ட்டையும் நீக்க விரும்புகிறீர்களா?<br><br>

source: Deleting %1 playlists from <b>%2</b>.<br><br>
ta: <b>%2</b> இலிருந்து %1 பிளேலிச்ட்களை நீக்குகிறது.<br><br>

source: Mixxx encountered a problem
ta: Mixxx ஒரு சிக்கலை எதிர்கொண்டது

source: Could not allocate shout_t
ta: shout_t ஐ ஒதுக்க முடியவில்லை

source: Could not allocate shout_metadata_t
ta: shout_metadata_t ஐ ஒதுக்க முடியவில்லை

source: Error setting non-blocking mode:
ta: தடுக்காத பயன்முறையை அமைப்பதில் பிழை:

source: Error setting tls mode:
ta: tls பயன்முறையை அமைப்பதில் பிழை:

source: Error setting hostname!
ta: ஓச்ட்பெயரை அமைப்பதில் பிழை!

source: Error setting port!
ta: போர்ட்டை அமைப்பதில் பிழை!

source: Error setting password!
ta: கடவுச்சொல்லை அமைப்பதில் பிழை!

source: Error setting mount!
ta: மவுண்ட் அமைப்பதில் பிழை!

source: Error setting username!
ta: பயனர்பெயரை அமைப்பதில் பிழை!

source: Error setting stream name!
ta: ச்ட்ரீம் பெயரை அமைப்பதில் பிழை!

source: Error setting stream description!
ta: ச்ட்ரீம் விளக்கத்தை அமைப்பதில் பிழை!

source: Error setting stream genre!
ta: ச்ட்ரீம் வகையை அமைப்பதில் பிழை!

source: Error setting stream url!
ta: ச்ட்ரீம் முகவரி அமைப்பதில் பிழை!

source: Error setting stream IRC!
ta: ச்ட்ரீம் IRC ஐ அமைப்பதில் பிழை!

source: Error setting stream AIM!
ta: ச்ட்ரீம் AIM ஐ அமைப்பதில் பிழை!

source: Error setting stream ICQ!
ta: ச்ட்ரீம் ICQ ஐ அமைப்பதில் பிழை!

source: Error setting stream public!
ta: ச்ட்ரீம் பொதுவை அமைப்பதில் பிழை!

source: Unknown stream encoding format!
ta: அறியப்படாத ச்ட்ரீம் என்கோடிங் வடிவம்!

source: Use a libshout version with %1 enabled
ta: %1 இயக்கப்பட்ட லிப்சவுட் பதிப்பைப் பயன்படுத்தவும்

source: Error setting stream encoding format!
ta: ச்ட்ரீம் குறியாக்க வடிவமைப்பை அமைப்பதில் பிழை!

source: Broadcasting at 96 kHz with Ogg Vorbis is not currently supported. Please try a different sample rate or switch to a different encoding.
ta: Ogg Vorbis உடன் 96 kHz இல் ஒளிபரப்பு தற்போது ஆதரிக்கப்படவில்லை. வேறு மாதிரி விகிதத்தை முயற்சிக்கவும் அல்லது வேறு குறியாக்கத்திற்கு மாறவும்.

source: See https://github.com/mixxxdj/mixxx/issues/5701 for more information.
ta: மேலும் தகவலுக்கு https://github.com/mixxxdj/mixxx/issues/5701 ஐப் பார்க்கவும்.

source: Unsupported sample rate
ta: ஆதரிக்கப்படாத மாதிரி விகிதம்

source: Error setting bitrate
ta: பிட்ரேட்டை அமைப்பதில் பிழை

source: Error: unknown server protocol!
ta: பிழை: அறியப்படாத சர்வர் நெறிமுறை!

source: Error: Shoutcast only supports MP3 and AAC encoders
ta: பிழை: Shoutcast MP3 மற்றும் AAC குறியாக்கிகளை மட்டுமே ஆதரிக்கிறது

source: Error setting protocol!
ta: நெறிமுறை அமைப்பதில் பிழை!

source: Network cache overflow
ta: பிணையம் கேச் நிரம்பி வழிகிறது

source: Connection error
ta: இணைப்பு பிழை

source: One of the Live Broadcasting connections raised this error:<br><b>Error with connection '%1':</b><br>
ta: நேரடி ஒளிபரப்பு இணைப்புகளில் ஒன்று இந்தப் பிழையை எழுப்பியுள்ளது:<br><b>'%1' இணைப்பில் பிழை:</b><br>

source: Connection message
ta: இணைப்பு செய்தி

source: <b>Message from Live Broadcasting connection '%1':</b><br>
ta: <b>நேரடி ஒளிபரப்பு இணைப்பு '%1' இலிருந்து செய்தி:</b><br>

source: Lost connection to streaming server and %1 attempts to reconnect have failed.
ta: ச்ட்ரீமிங் சேவையகத்திற்கான இணைப்பு இழந்தது மற்றும் மீண்டும் இணைக்க % 1 முயற்சிகள் தோல்வியடைந்தன.

source: Lost connection to streaming server.
ta: ச்ட்ரீமிங் சேவையகத்திற்கான இணைப்பு துண்டிக்கப்பட்டது.

source: Please check your connection to the Internet.
ta: உங்கள் இணைய இணைப்பைச் சரிபார்க்கவும்.

source: Can't connect to streaming server
ta: ச்ட்ரீமிங் சர்வருடன் இணைக்க முடியவில்லை

source: Please check your connection to the Internet and verify that your username and password are correct.
ta: இணையத்துடனான உங்கள் இணைப்பைச் சரிபார்த்து, உங்கள் பயனர்பெயர் மற்றும் கடவுச்சொல் சரியானதா என்பதைச் சரிபார்க்கவும்.

# SoftwareWaveformWidget#1
source: Filtered
ta: வடிகட்டப்பட்டது

source: a device
ta: ஒரு சாதனம்

source: An unknown error occurred
ta: அறியப்படாத பிழை ஏற்பட்டது

source: Two outputs cannot share channels on "%1"
ta: இரண்டு வெளியீடுகள் "% 1" இல் சேனல்களைப் பகிர முடியாது

source: Error opening "%1"
ta: "% 1" திறப்பதில் பிழை

# StatModel#1
source: Name
ta: பெயர்

source: Count
ta: எண்ணுங்கள்

# StatModel#3
source: Type
ta: வகை

source: Units
ta: அலகுகள்

source: Sum
ta: தொகை

source: Min
ta: குறைந்தபட்சம்

source: Max
ta: அதிகபட்சம்

source: Mean
ta: இடை, சராசரி

source: Variance
ta: மாறுபாட்டெண்

source: Standard Deviation
ta: திட்டவிலக்கல், நியம விலகல்

source: Fingerprinting track
ta: கைரேகை தடம்

source: Reading track for fingerprinting failed.
ta: கைரேகையைப் படிப்பதில் தோல்வி.

source: Identifying track through AcoustID
ta: AcousID மூலம் தடத்தை அடையாளம் காணுதல்

source: Could not identify track through AcoustID.
ta: AcousID மூலம் தடத்தை அடையாளம் காண முடியவில்லை.

source: Could not find this track in the MusicBrainz database.
ta: MusicBrainz தரவுத்தளத்தில் இந்த டிராக்கைக் கண்டுபிடிக்க முடியவில்லை.

source: Retrieving metadata from MusicBrainz
ta: MusicBrainz இலிருந்து மெட்டாடேட்டாவை மீட்டெடுக்கிறது

source: Reset to default value.
ta: இயல்புநிலை மதிப்பிற்கு மீட்டமைக்கவும்.

source: Left-click
ta: இடது சொடுக்கு செய்யவும்

source: Right-click
ta: வலது சொடுக்கு செய்யவும்

source: Double-click
ta: இருமுறை சொடுக்கு செய்யவும்

source: Scroll-wheel
ta: சுருள்-சக்கரம்

source: Shift-key
ta: சிப்ட்-விசை

source: loop active
ta: சுழற்சி செயலில்

source: loop inactive
ta: லூப் செயலற்றது

source: Effects within the chain must be enabled to hear them.
ta: சங்கிலியில் உள்ள விளைவுகள் அவற்றைக் கேட்கும் வகையில் செயல்படுத்தப்பட வேண்டும்.

source: Waveform Overview
ta: அலைவடிவ மேலோட்டம்

source: Use the mouse to scratch, spin-back or throw tracks.
ta: தடங்களை கீற, ச்பின்-பேக் அல்லது எறிவதற்கு சுட்டியைப் பயன்படுத்தவும்.

source: Waveform Display
ta: அலைவடிவ காட்சி

source: Shows the loaded track's waveform near the playback position.
ta: பிளேபேக் நிலைக்கு அருகில் ஏற்றப்பட்ட டிராக்கின் அலைவடிவத்தைக் காட்டுகிறது.

source: Drag with mouse to make temporary pitch adjustments.
ta: தற்காலிக சுருதி மாற்றங்களைச் செய்ய மவுசைக் கொண்டு இழுக்கவும்.

source: Scroll to change the waveform zoom level.
ta: அலைவடிவ சூம் அளவை மாற்ற உருட்டவும்.

# Tooltips#16
source: Waveform Zoom Out
ta: அலைவடிவம் பெரிதாக்கு

# Tooltips#17
source: Waveform Zoom In
ta: அலைவடிவம் பெரிதாக்கவும்

# Tooltips#18
source: Waveform Zoom
ta: அலைவடிவம் பெரிதாக்கு

source: Spinning Vinyl
ta: சுழலும் வினைல்

source: Rotates during playback and shows the position of a track.
ta: பிளேபேக்கின் போது சுழலும் மற்றும் டிராக்கின் நிலையைக் காட்டுகிறது.

source: Right click to show cover art of loaded track.
ta: ஏற்றப்பட்ட டிராக்கின் அட்டைப்படத்தைக் காட்ட வலது சொடுக்கு செய்யவும்.

# Tooltips#22
source: Gain
ta: பெருக்கம்

source: Adjusts the pre-fader gain of the track (to avoid clipping).
ta: டிராக்கின் மங்கலுக்கு முந்தைய ஆதாயத்தைச் சரிசெய்கிறது (கிளிப்பிங்கைத் தவிர்க்க).

source: (too loud for the hardware and is being distorted).
ta: (வன்பொருளுக்கு மிகவும் சத்தமாக உள்ளது மற்றும் சிதைக்கப்படுகிறது).

source: Indicates when the signal on the channel is clipping,
ta: சேனலில் சிக்னல் கிளிப்பிங் செய்யும் போது குறிக்கிறது,

source: Channel Volume Meter
ta: சேனல் வால்யூம் மீட்டர்

source: Shows the current channel volume.
ta: தற்போதைய சேனல் அளவைக் காட்டுகிறது.

source: Microphone Volume Meter
ta: மைக்ரோஃபோன் வால்யூம் மீட்டர்

source: Shows the current microphone volume.
ta: தற்போதைய மைக்ரோஃபோன் ஒலியளவைக் காட்டுகிறது.

source: Auxiliary Volume Meter
ta: துணை வால்யூம் மீட்டர்

source: Shows the current auxiliary volume.
ta: தற்போதைய துணை ஒலியளவைக் காட்டுகிறது.

source: Auxiliary Peak Indicator
ta: துணை உச்சநிலை காட்டி

source: Indicates when the signal on the auxiliary is clipping,
ta: துணை சிக்னல் கிளிப்பிங் செய்யும் போது குறிக்கிறது,

source: Volume Control
ta: தொகுதி கட்டுப்பாடு

source: Adjusts the volume of the selected channel.
ta: தேர்ந்தெடுக்கப்பட்ட சேனலின் ஒலியளவைச் சரிசெய்கிறது.

source: Booth Gain
ta: பூத் ஆதாயம்

source: Adjusts the booth output gain.
ta: பூத் வெளியீட்டு ஆதாயத்தை சரிசெய்கிறது.

# Tooltips#38
source: Crossfader
ta: கிராச்ஃபேடர்

# Tooltips#39
source: Balance
ta: இருப்பு

source: Headphone Volume
ta: எட்ஃபோன் வால்யூம்

source: Adjusts the headphone output volume.
ta: தலையணி வெளியீட்டு அளவைச் சரிசெய்கிறது.

# Tooltips#42
source: Headphone Gain
ta: எட்ஃபோன் ஆதாயம்

source: Adjusts the headphone output gain.
ta: எட்ஃபோன் வெளியீட்டு ஆதாயத்தை சரிசெய்கிறது.

# Tooltips#44
source: Headphone Mix
ta: எட்ஃபோன் கலவை

# Tooltips#45
source: Headphone Split Cue
ta: எட்ஃபோன் ச்பிளிட் கியூ

source: Adjust the Headphone Mix so in the left channel is not the pure cueing signal.
ta: எட்ஃபோன் கலவையை சரிசெய்யவும், எனவே இடது சேனலில் தூய க்யூயிங் சிக்னல் இல்லை.

# Tooltips#47
source: Microphone
ta: ஒலிவாங்கி

source: Show/hide the Microphone section.
ta: மைக்ரோஃபோன் பகுதியைக் காட்டு/மறை.

# Tooltips#49
source: Sampler
ta: மாதிரி

source: Show/hide the Sampler section.
ta: மாதிரிப் பகுதியைக் காட்டு/மறை.

# Tooltips#51
source: Vinyl Control
ta: வினைல் கட்டுப்பாடு

source: Show/hide the Vinyl Control section.
ta: வினைல் கட்டுப்பாடு பிரிவைக் காட்டு/மறை.

# Tooltips#53
source: Preview Deck
ta: முன்னோட்ட தளம்

source: Show/hide the Preview deck.
ta: முன்னோட்ட டெக்கைக் காட்டு/மறை.

# Tooltips#55
source: Cover Art
ta: கவர் கலை

source: Show/hide Cover Art.
ta: கவர் ஆர்ட்டைக் காட்டு/மறை.

# Tooltips#57
source: Toggle 4 Decks
ta: 4 அடுக்குகளை மாற்றவும்

# Tooltips#58
source: Switches between showing 2 decks and 4 decks.
ta: 2 டெக்குகள் மற்றும் 4 டெக்குகளைக் காட்டும் இடையே மாறுகிறது.

source: Show Library
ta: நூலகத்தைக் காட்டு

source: Show or hide the track library.
ta: டிராக் லைப்ரரியைக் காட்டு அல்லது மறை.

source: Show Effects
ta: விளைவுகளைக் காட்டு

source: Show or hide the effects.
ta: விளைவுகளைக் காட்டு அல்லது மறை.

source: Toggle Mixer
ta: மிக்சரை மாற்று

# Tooltips#64
source: Show or hide the mixer.
ta: கலவையைக் காட்டு அல்லது மறைக்கவும்.

source: Show/hide volume meters for channels and main output.
ta: சேனல்கள் மற்றும் முக்கிய வெளியீட்டிற்கான வால்யூம் மீட்டர்களைக் காட்டு/மறை.

source: Microphone Volume
ta: மைக்ரோஃபோன் வால்யூம்

source: Adjusts the microphone volume.
ta: மைக்ரோஃபோன் ஒலியளவை சரிசெய்கிறது.

source: Microphone Gain
ta: மைக்ரோஃபோன் ஆதாயம்

source: Adjusts the pre-fader microphone gain.
ta: மங்கலுக்கு முந்தைய மைக்ரோஃபோன் ஆதாயத்தைச் சரிசெய்கிறது.

source: Auxiliary Gain
ta: துணை ஆதாயம்

source: Adjusts the pre-fader auxiliary gain.
ta: மங்கலுக்கு முந்தைய துணை ஆதாயத்தை சரிசெய்கிறது.

source: Microphone Talk-Over
ta: மைக்ரோஃபோன் பேச்சு-ஓவர்

source: Hold-to-talk or short click for latching to
ta: பேசுவதற்கு அழுத்திப் பிடிக்கவும் அல்லது சுருக்க சொடுக்கு செய்யவும்

source: Microphone Talkover Mode
ta: மைக்ரோஃபோன் பேச்சுப் பயன்முறை

source: Off: Do not reduce music volume
ta: ஆஃப்: இசையின் அளவைக் குறைக்க வேண்டாம்

source: Manual: Reduce music volume by a fixed amount set by the Strength knob.
ta: கையேடு: வலிமை குமிழ் மூலம் நிர்ணயிக்கப்பட்ட அளவு இசையின் அளவைக் குறைக்கவும்.

source: Behavior depends on Microphone Talkover Mode:
ta: நடத்தை மைக்ரோஃபோன் பேச்சு பயன்முறையைப் பொறுத்தது:

source: Off: Does nothing
ta: ஆஃப்: எதுவும் செய்யாது

source: Change the step-size in the Preferences -> Decks menu.
ta: விருப்பத்தேர்வுகள் -> டெக்ச் பட்டியலில் படி அளவை மாற்றவும்.

# Tooltips#80
source: Low EQ
ta: குறைந்த ஈக்யூ

source: Adjusts the gain of the low EQ filter.
ta: குறைந்த ஈக்யூ வடிப்பானின் ஆதாயத்தைச் சரிசெய்கிறது.

# Tooltips#82
source: Mid EQ
ta: நடு EQ

source: Adjusts the gain of the mid EQ filter.
ta: மிட் ஈக்யூ வடிப்பானின் ஆதாயத்தைச் சரிசெய்கிறது.

# Tooltips#84
source: High EQ
ta: உயர் ஈக்யூ

source: Adjusts the gain of the high EQ filter.
ta: உயர் ஈக்யூ வடிப்பானின் ஆதாயத்தைச் சரிசெய்கிறது.

source: Hold-to-kill or short click for latching.
ta: பிடுங்குவதற்குப் பிடிக்கவும் அல்லது தாழ்த்தலுக்கு குறுகிய சொடுக்கு செய்யவும்.

source: High EQ Kill
ta: உயர் EQ கில்

source: Holds the gain of the high EQ to zero while active.
ta: செயலில் இருக்கும்போது அதிக ஈக்யூவின் ஆதாயத்தை பூச்சியமாக வைத்திருக்கும்.

source: Mid EQ Kill
ta: மிட் ஈக்யூ கில்

source: Holds the gain of the mid EQ to zero while active.
ta: செயலில் இருக்கும்போது நடு ஈக்யூவின் ஆதாயத்தை பூச்சியமாக வைத்திருக்கும்.

source: Low EQ Kill
ta: குறைந்த ஈக்யூ கில்

source: Holds the gain of the low EQ to zero while active.
ta: செயலில் இருக்கும்போது குறைந்த ஈக்யூவின் ஆதாயத்தை பூச்சியமாக வைத்திருக்கும்.

source: Displays the tempo of the loaded track in BPM (beats per minute).
ta: ஏற்றப்பட்ட டிராக்கின் டெம்போவை பிபிஎம்மில் (நிமிடத்திற்கு துடிக்கிறது) காட்டுகிறது.

source: Tempo
ta: டெம்போ

# Tooltips#95
source: Key
ta: முக்கிய

# Tooltips#96
source: BPM Tap
ta: பிபிஎம் தட்டு

source: When tapped repeatedly, adjusts the BPM to match the tapped BPM.
ta: மறுநிகழ்வு தட்டும்போது, ​​தட்டப்பட்ட BPM உடன் பொருந்துமாறு BPM ஐ சரிசெய்கிறது.

source: Adjust BPM Down
ta: BPM குறைப்பைச் சரிசெய்யவும்

source: When tapped, adjusts the average BPM down by a small amount.
ta: தட்டும்போது, ​​சராசரி BPMஐ சிறிய அளவில் சரிசெய்கிறது.

source: Adjust BPM Up
ta: BPM ஐ சரிசெய்யவும்

source: When tapped, adjusts the average BPM up by a small amount.
ta: தட்டும்போது, ​​சராசரி BPMஐச் சிறிய அளவில் சரிசெய்கிறது.

source: Adjust Beats Earlier
ta: முன்னதாக பீட்சை சரிசெய்யவும்

source: When tapped, moves the beatgrid left by a small amount.
ta: தட்டும்போது, ​​பீட்கிரிட்டை ஒரு சிறிய அளவு விட்டு நகர்த்துகிறது.

source: Adjust Beats Later
ta: பின்னர் பீட்சை சரிசெய்யவும்

source: When tapped, moves the beatgrid right by a small amount.
ta: தட்டும்போது, ​​பீட்கிரிட்டை ஒரு சிறிய அளவு வலதுபுறமாக நகர்த்துகிறது.

source: Tempo and BPM Tap
ta: டெம்போ மற்றும் பிபிஎம் தட்டு

source: Show/hide the spinning vinyl section.
ta: சுழலும் வினைல் பகுதியைக் காட்டு/மறை.

# Tooltips#108
source: Keylock
ta: கீலாக்

source: Toggling keylock during playback may result in a momentary audio glitch.
ta: பிளேபேக்கின் போது கீலாக்கை மாற்றுவது தற்காலிக ஆடியோ தடுமாற்றத்தை ஏற்படுத்தலாம்.

source: Toggle visibility of Loop Controls
ta: லூப் கட்டுப்பாடுகளின் தெரிவுநிலையை நிலைமாற்று

source: Toggle visibility of Beatjump Controls
ta: பீட்சம்ப் கட்டுப்பாடுகளின் தெரிவுநிலையை நிலைமாற்று

source: Toggle visibility of Rate Control
ta: விகிதக் கட்டுப்பாட்டின் தெரிவுநிலையை நிலைமாற்று

source: Toggle visibility of Key Controls
ta: முக்கிய கட்டுப்பாடுகளின் தெரிவுநிலையை நிலைமாற்று

source: (while previewing)
ta: (முன்னோட்டம் செய்யும் போது)

source: Places a cue point at the current position on the waveform.
ta: அலைவடிவத்தின் தற்போதைய நிலையில் ஒரு குறிப் புள்ளியை வைக்கிறது.

source: Stops track at cue point, OR go to cue point and play after release (CUP mode).
ta: க்யூ பாயிண்டில் டிராக்கை நிறுத்துகிறது, அல்லது கியூ பாயிண்டிற்குச் சென்று வெளியீட்டிற்குப் பிறகு விளையாடுங்கள் (CUP பயன்முறை).

source: Set cue point (Pioneer/Mixxx/Numark mode), set cue point and play after release (CUP mode) OR preview from it (Denon mode).
ta: க்யூ பாயிண்ட் (Pioneer/Mixxx/Numark பயன்முறை) அமைக்கவும், க்யூ பாயிண்ட்டை அமைத்து, வெளியான பிறகு விளையாடவும் (CUP பயன்முறை) அல்லது அதிலிருந்து முன்னோட்டம் (Denon mode).

source: Is latching the playing state.
ta: விளையாடும் நிலையை அடைகிறது.

source: Seeks the track to the cue point and stops.
ta: க்யூ பாயின்ட் வரை பாதையை தேடி நின்று விடுகிறது.

# Tooltips#120
source: Play
ta: விளையாடு

source: Plays track from the cue point.
ta: க்யூ பாயிண்டிலிருந்து டிராக் விளையாடுகிறது.

source: Sends the selected channel's audio to the headphone output, selected in Preferences -> Sound Hardware.
ta: தேர்ந்தெடுக்கப்பட்ட சேனலின் ஆடியோவை எட்ஃபோன் வெளியீட்டிற்கு அனுப்புகிறது, விருப்பத்தேர்வுகள் -> சவுண்ட் ஆர்டுவேரில் தேர்ந்தெடுக்கப்பட்டது.

source: (This skin should be updated to use Sync Lock!)
ta: (ஒத்திசைவு பூட்டைப் பயன்படுத்த இந்த தோல் புதுப்பிக்கப்பட வேண்டும்!)

source: Enable Sync Lock
ta: ஒத்திசைவு பூட்டை இயக்கு

source: Tap to sync the tempo to other playing tracks or the sync leader.
ta: டெம்போவை மற்ற பிளேயிங் டிராக்குகள் அல்லது ஒத்திசைவு தலைவருடன் ஒத்திசைக்க தட்டவும்.

source: Enable Sync Leader
ta: ஒத்திசைவு தலைவரை இயக்கு

source: When enabled, this device will serve as the sync leader for all other decks.
ta: இயக்கப்பட்டால், இந்தச் சாதனம் மற்ற எல்லா தளங்களுக்கும் ஒத்திசைவுத் தலைவராகச் செயல்படும்.

source: This is relevant when a dynamic tempo track is loaded to a sync leader deck.In that case, other synced devices will adopt the changing tempo.
ta: மாறும் டெம்போ டிராக் ஒரு ஒத்திசைவு லீடர் டெக்கில் ஏற்றப்படும் போது இது பொருத்தமானது. அப்படியானால், மற்ற ஒத்திசைக்கப்பட்ட சாதனங்கள் மாறும் டெம்போவை ஏற்றுக்கொள்ளும்.

source: Changes the track playback speed (affects both the tempo and the pitch). If keylock is enabled, only the tempo is affected.
ta: டிராக் பிளேபேக் வேகத்தை மாற்றுகிறது (டெம்போ மற்றும் பிட்ச் இரண்டையும் பாதிக்கிறது). கீலாக் இயக்கப்பட்டிருந்தால், டெம்போ மட்டுமே பாதிக்கப்படும்.

source: Tempo Range Display
ta: டெம்போ ரேஞ்ச் டிச்ப்ளே

source: Displays the current range of the tempo slider.
ta: டெம்போ ச்லைடரின் தற்போதைய வரம்பைக் காட்டுகிறது.

source: Un-ejects when no track is loaded, i.e. reloads the track that was ejected last (of any deck).
ta: எந்த தடமும் ஏற்றப்படாத போது வெளியேற்றுகிறது, அதாவது கடைசியாக வெளியேற்றப்பட்ட டிராக்கை மீண்டும் ஏற்றுகிறது (எந்த டெக்கிலும்).

source: Delete selected hotcue.
ta: தேர்ந்தெடுக்கப்பட்ட ஆட்கியூவை நீக்கு.

source: Track Comment
ta: கருத்தைத் தடமறிக

source: Displays the comment tag of the loaded track.
ta: ஏற்றப்பட்ட பாதையின் கருத்து குறிச்சொல்லைக் காட்டுகிறது.

source: Opens separate artwork viewer.
ta: தனி கலைப் பார்வையாளரைத் திறக்கும்.

source: Effect Chain Preset Settings
ta: விளைவு சங்கிலி முன்னமைக்கப்பட்ட அமைப்புகள்

source: Show the effect chain settings menu for this unit.
ta: இந்த அலகுக்கான விளைவு சங்கிலி அமைப்புகள் மெனுவைக் காட்டு.

source: Select and configure a hardware device for this input
ta: இந்த உள்ளீட்டிற்கான வன்பொருள் சாதனத்தைத் தேர்ந்தெடுத்து உள்ளமைக்கவும்

source: Recording Duration
ta: பதிவு செய்யும் காலம்

source: Select and click: Show inline value editor
ta: தேர்ந்தெடுத்து சொடுக்கு செய்யவும்: இன்லைன் மதிப்பு எடிட்டரைக் காட்டு

source: Left click and hold allows to preview the position where the play head will jump to on release. Dragging can be aborted with right click.
ta: இடது சொடுக்கு செய்து, ப்ளே எட் வெளியீட்டின் போது குதிக்கும் நிலையை முன்னோட்டமிட அனுமதிக்கிறது. வலது சொடுக்கு மூலம் இழுப்பதை நிறுத்தலாம்.

source: Big Spinny/Cover Art
ta: பெரிய ச்பின்னி/கவர் ஆர்ட்

source: Show a big version of the Spinny or track cover art if enabled.
ta: ச்பின்னியின் பெரிய பதிப்பைக் காட்டு அல்லது இயக்கப்பட்டிருந்தால் கவர் ஆர்ட்டை டிராக் செய்யவும்.

source: Main Output Peak Indicator
ta: முதன்மை வெளியீடு உச்சநிலை காட்டி

source: Indicates when the signal on the main output is clipping,
ta: முதன்மையான வெளியீட்டில் சிக்னல் கிளிப்பிங் செய்யும் போது குறிக்கிறது,

source: Main Output L Peak Indicator
ta: முதன்மை வெளியீடு L உச்சநிலை காட்டி

source: Indicates when the left signal on the main output is clipping,
ta: முதன்மையான வெளியீட்டில் இடது சமிக்ஞை கிளிப்பிங் செய்யும் போது குறிக்கிறது,

source: Main Output R Peak Indicator
ta: முதன்மை வெளியீடு R உச்சநிலை காட்டி

source: Indicates when the right signal on the main output is clipping,
ta: முக்கிய வெளியீட்டில் சரியான சமிக்ஞை கிளிப்பிங் ஆகும் போது குறிக்கிறது,

source: Main Channel L Volume Meter
ta: முதன்மை சேனல் எல் வால்யூம் மீட்டர்

source: Shows the current volume for the left channel of the main output.
ta: முதன்மையான வெளியீட்டின் இடது சேனலுக்கான தற்போதைய அளவைக் காட்டுகிறது.

source: Shows the current volume for the right channel of the main output.
ta: முக்கிய வெளியீட்டின் வலது சேனலுக்கான தற்போதைய அளவைக் காட்டுகிறது.

# Tooltips#154
source: Main Output Gain
ta: முக்கிய வெளியீடு ஆதாயம்

source: Adjusts the main output gain.
ta: முக்கிய வெளியீட்டு ஆதாயத்தை சரிசெய்கிறது.

source: Determines the main output by fading between the left and right channels.
ta: இடது மற்றும் வலது சேனல்களுக்கு இடையில் மங்குவதன் மூலம் முக்கிய வெளியீட்டைத் தீர்மானிக்கிறது.

source: Adjusts the left/right channel balance on the main output.
ta: முதன்மையான வெளியீட்டில் இடது/வலது சேனல் சமநிலையை சரிசெய்கிறது.

source: Crossfades the headphone output between the main mix and cueing (PFL or Pre-Fader Listening) signal.
ta: முதன்மையான கலவை மற்றும் க்யூயிங் (PFL அல்லது ப்ரீ-ஃபேடர் லிச்டனிங்) சிக்னலுக்கு இடையில் எட்ஃபோன் வெளியீட்டை கிராச்ஃபேட் செய்கிறது.

source: If activated, the main mix signal plays in the right channel, while the cueing signal plays in the left channel.
ta: செயல்படுத்தப்பட்டால், முக்கிய மிக்ச் சிக்னல் வலது சேனலிலும், க்யூயிங் சிக்னல் இடது சேனலிலும் இயங்கும்.
