Repository: 247i/TACETr
Catalog: உரை/தானி/mixxxdj_mixxx2-5_*.po
Languages: ta

# WSearchRelatedTracksMenu#10
source: Album
ta: ஆல்பம்

# WSearchRelatedTracksMenu#11
source: Grouping
ta: குழுவாக்கம்

# WSearchRelatedTracksMenu#12
source: Year
ta: ஆண்டு

# WSearchRelatedTracksMenu#13
source: Genre
ta: வகை

source: Directory
ta: அடைவு

source: &Search selected
ta: &தேடல் தேர்ந்தெடுக்கப்பட்டது

source: Load to
ta: ஏற்றவும்

# WTrackMenu#2
source: Deck
ta: தளம்

# WTrackMenu#3
source: Sampler
ta: மாதிரி

source: Add to Playlist
ta: பிளேலிச்ட்டில் சேர்

# WTrackMenu#5
source: Crates
ta: கிரேட்ச்

# WTrackMenu#6
source: Metadata
ta: மேனிலை தரவு

source: Update external collections
ta: வெளிப்புற சேகரிப்புகளைப் புதுப்பிக்கவும்

# WTrackMenu#8
source: Cover Art
ta: கவர் கலை

source: Adjust BPM
ta: BPM ஐ சரிசெய்யவும்

source: Select Color
ta: வண்ணத்தைத் தேர்ந்தெடுக்கவும்

# WTrackMenu#11
source: Analyze
ta: பகுப்பாய்வு செய்யவும்

source: Delete Track Files
ta: ட்ராக் கோப்புகளை நீக்கு

# WTrackMenu#13
source: Add to Auto DJ Queue (bottom)
ta: ஆட்டோ DJ வரிசையில் சேர் (கீழே)

# WTrackMenu#14
source: Add to Auto DJ Queue (top)
ta: ஆட்டோ DJ வரிசையில் சேர் (மேல்)

# WTrackMenu#15
source: Add to Auto DJ Queue (replace)
ta: ஆட்டோ டிசே வரிசையில் சேர் (மாற்று)

# WTrackMenu#16
source: Preview Deck
ta: முன்னோட்ட தளம்

# WTrackMenu#17
source: Remove
ta: நீக்குக

source: Remove from Playlist
ta: பிளேலிச்ட்டில் இருந்து அகற்று

source: Remove from Crate
ta: க்ரேட்டிலிருந்து அகற்று

source: Hide from Library
ta: நூலகத்திலிருந்து மறை

source: Unhide from Library
ta: நூலகத்தில் இருந்து மறை

source: Purge from Library
ta: நூலகத்திலிருந்து அகற்றவும்

source: Move Track File(s) to Trash
ta: டிராக் கோப்பு(களை) குப்பைக்கு நகர்த்தவும்

source: Delete Files from Disk
ta: வட்டில் இருந்து கோப்புகளை நீக்கு

source: Properties
ta: பண்புகள்

# WTrackMenu#26
source: Open in File Browser
ta: கோப்பு உலாவியில் திறக்கவும்

source: Select in Library
ta: நூலகத்தில் தேர்ந்தெடுக்கவும்

source: Import From File Tags
ta: கோப்பு குறிச்சொற்களிலிருந்து இறக்குமதி செய்யவும்

source: Import From MusicBrainz
ta: MusicBrainz இலிருந்து இறக்குமதி செய்யவும்

source: Export To File Tags
ta: கோப்பு குறிச்சொற்களுக்கு ஏற்றுமதி செய்யவும்

source: BPM and Beatgrid
ta: பிபிஎம் மற்றும் பீட்கிரிட்

source: Play Count
ta: விளையாட எண்ணிக்கை

# WTrackMenu#33
source: Rating
ta: செயல்வரம்பு

source: Cue Point
ta: கியூ பாயிண்ட்

# WTrackMenu#35
source: Hotcues
ta: ஆட்குச்

source: Intro
ta: அறிமுகம்

source: Outro
ta: மற்றவை

# WTrackMenu#38
source: Key
ta: முக்கிய

# WTrackMenu#39
source: ReplayGain
ta: மீண்டும் விளையாடு

# WTrackMenu#40
source: Waveform
ta: அலைவடிவம், அலைப்படம்

# WTrackMenu#41
source: Comment
ta: கருத்து

# WTrackMenu#42
source: All
ta: அனைத்தும்

source: Lock BPM
ta: பிபிஎம் பூட்டு

source: Unlock BPM
ta: BPM ஐ திறக்கவும்

# WTrackMenu#45
source: Double BPM
ta: இரட்டை பிபிஎம்

# WTrackMenu#46
source: Halve BPM
ta: பாதி பிபிஎம்

# WTrackMenu#47
source: 2/3 BPM
ta: 2/3 பிபிஎம்

# WTrackMenu#48
source: 3/4 BPM
ta: 3/4 பிபிஎம்

# WTrackMenu#49
source: 4/3 BPM
ta: 4/3 பிபிஎம்

# WTrackMenu#50
source: 3/2 BPM
ta: 3/2 பிபிஎம்

source: Reanalyze
ta: மறு ஆய்வு

source: Reanalyze (constant BPM)
ta: மறு ஆய்வு (நிலையான பிபிஎம்)

source: Reanalyze (variable BPM)
ta: மறு ஆய்வு (மாறி BPM)

source: Update ReplayGain from Deck Gain
ta: Deck பெருக்கம் இலிருந்து ReplayGain ஐப் புதுப்பிக்கவும்

# WTrackMenu#55
source: Deck %1
ta: தளம்% 1

source: Importing metadata of %n track(s) from file tags
ta: கோப்பு குறிச்சொற்களில் இருந்து %n டிராக்(களின்) மெட்டாடேட்டாவை இறக்குமதி செய்கிறது

source: Marking metadata of %n track(s) to be exported into file tags
ta: கோப்பு குறிச்சொற்களில் ஏற்றுமதி செய்யப்பட வேண்டிய %n டிராக்(கள்) மெட்டாடேட்டாவைக் குறிக்கும்

# WTrackMenu#58
source: Create New Playlist
ta: புதிய பிளேலிச்ட்டை உருவாக்கவும்

# WTrackMenu#59
source: Enter name for new playlist:
ta: புதிய பிளேலிச்ட்டுக்கான பெயரை உள்ளிடவும்:

# WTrackMenu#60
source: New Playlist
ta: புதிய இசைப்பட்டியல்

# WTrackMenu#61
source: Playlist Creation Failed
ta: பிளேலிச்ட் உருவாக்கம் தோல்வியடைந்தது

# WTrackMenu#62
source: A playlist by that name already exists.
ta: அந்த பெயரில் ஒரு பிளேலிச்ட் ஏற்கனவே உள்ளது.

# WTrackMenu#63
source: A playlist cannot have a blank name.
ta: பிளேலிச்ட்டில் வெற்றுப் பெயர் இருக்கக்கூடாது.

# WTrackMenu#64
source: An unknown error occurred while creating playlist:
ta: பிளேலிச்ட்டை உருவாக்கும் போது அறியப்படாத பிழை ஏற்பட்டது:

source: Add to New Crate
ta: புதிய கிரேட்டில் சேர்க்கவும்

source: Scaling BPM of %n track(s)
ta: %n டிராக்(கள்) இன் பிபிஎம் அளவிடுதல்

source: Undo BPM/beats change of %n track(s)
ta: %n டிராக்(களின்) BPM/beats மாற்றத்தை செயல்தவிர்

source: Locking BPM of %n track(s)
ta: %n டிராக்(களின்) பிபிஎம் பூட்டுதல்

source: Unlocking BPM of %n track(s)
ta: %n டிராக்(களின்) BPMஐத் திறக்கிறது

source: Setting rating of %n track(s)
ta: %n ட்ராக்(கள்) மதிப்பீட்டை அமைத்தல்

source: Setting color of %n track(s)
ta: %n டிராக்(களின்) நிறத்தை அமைத்தல்

source: Resetting play count of %n track(s)
ta: %n டிராக்(களின்) எண்ணிக்கையை மீட்டமைக்கிறது

source: Resetting beats of %n track(s)
ta: %n டிராக்(களின்) பீட்களை மீட்டமைக்கிறது

source: Clearing rating of %n track(s)
ta: %n டிராக்(கள்) மதிப்பீட்டை அழிக்கிறது

source: Clearing comment of %n track(s)
ta: %n டிராக்(களின்) கருத்தை அழிக்கிறது

source: Removing main cue from %n track(s)
ta: %n டிராக்(களில்) இருந்து முக்கிய குறியை நீக்குகிறது

source: Removing outro cue from %n track(s)
ta: %n டிராக்(கள்) இலிருந்து அவுட்ரோ க்யூவை நீக்குகிறது

source: Removing intro cue from %n track(s)
ta: %n டிராக்(களில்) இருந்து அறிமுக குறிப்பை நீக்குகிறது

source: Removing loop cues from %n track(s)
ta: %n டிராக்(களில்) இருந்து லூப் குறிப்புகளை நீக்குகிறது

source: Removing hot cues from %n track(s)
ta: %n டிராக்(களில்) இருந்து சூடான குறிப்புகளை நீக்குகிறது

source: Resetting keys of %n track(s)
ta: %n டிராக்(களின்) விசைகளை மீட்டமைக்கிறது

source: Resetting replay gain of %n track(s)
ta: %n டிராக்(கள்) இன் ரீப்ளே ஆதாயத்தை மீட்டமைக்கிறது

source: Resetting waveform of %n track(s)
ta: %n டிராக்(களின்) அலைவடிவத்தை மீட்டமைக்கிறது

source: Resetting all performance metadata of %n track(s)
ta: %n டிராக்(கள்) இன் அனைத்து செயல்திறன் மெட்டாடேட்டாவையும் மீட்டமைக்கிறது

source: Move these files to the trash bin?
ta: இந்தக் கோப்புகளை குப்பைத் தொட்டிக்கு நகர்த்தவா?

source: Permanently delete these files from disk?
ta: வட்டில் இருந்து இந்தக் கோப்புகளை நிரந்தரமாக நீக்கவா?

source: This can not be undone!
ta: இதை செயல்தவிர்க்க முடியாது!

# WTrackMenu#88
source: Cancel
ta: ரத்துசெய்

source: Delete Files
ta: கோப்புகளை நீக்கு

source: Okay
ta: சரி

source: Move Track File(s) to Trash?
ta: டிராக் கோப்பு(களை) குப்பைக்கு நகர்த்தவா?

source: Track Files Deleted
ta: ட்ராக் கோப்புகள் நீக்கப்பட்டன

source: Track Files Moved To Trash
ta: டிராக் கோப்புகள் குப்பைக்கு நகர்த்தப்பட்டன

source: %1 track files were moved to trash and purged from the Mixxx database.
ta: %1 டிராக் கோப்புகள் குப்பைக்கு நகர்த்தப்பட்டு Mixxx தரவுத்தளத்தில் இருந்து நீக்கப்பட்டது.

source: %1 track files were deleted from disk and purged from the Mixxx database.
ta: %1 டிராக் கோப்புகள் வட்டில் இருந்து நீக்கப்பட்டு Mixxx தரவுத்தளத்தில் இருந்து நீக்கப்பட்டன.

source: Track File Deleted
ta: டிராக் கோப்பு நீக்கப்பட்டது

source: Track file was deleted from disk and purged from the Mixxx database.
ta: ட்ராக் கோப்பு வட்டில் இருந்து நீக்கப்பட்டது மற்றும் Mixxx தரவுத்தளத்திலிருந்து நீக்கப்பட்டது.

source: The following %1 file(s) could not be deleted from disk
ta: பின்வரும் %1 கோப்பை(களை) வட்டில் இருந்து நீக்க முடியவில்லை

source: This track file could not be deleted from disk
ta: இந்த டிராக் கோப்பை வட்டில் இருந்து நீக்க முடியவில்லை

source: Remaining Track File(s)
ta: மீதமுள்ள டிராக் கோப்பு(கள்)

# WTrackMenu#101
source: Close
ta: மூடு

# WTrackMenu#102
source: Clear
ta: தெளிவு

source: Loops
ta: வளையங்கள்

# WTrackMenu#104
source: Clear BPM and Beatgrid
ta: BPM மற்றும் Beatgrid ஐ அழிக்கவும்

source: Undo last BPM/beats change
ta: கடைசி பிபிஎம்/பீட்ச் மாற்றத்தை செயல்தவிர்க்கவும்

source: Move this track file to the trash bin?
ta: இந்த டிராக் கோப்பை குப்பைத் தொட்டிக்கு நகர்த்தவா?

source: Permanently delete this track file from disk?
ta: இந்த டிராக் கோப்பை வட்டில் இருந்து நிரந்தரமாக நீக்கவா?

source: All decks where these tracks are loaded will be stopped and the tracks will be ejected.
ta: இந்த தடங்கள் ஏற்றப்பட்ட அனைத்து தளங்களும் நிறுத்தப்பட்டு, தடங்கள் வெளியேற்றப்படும்.

source: All decks where this track is loaded will be stopped and the track will be ejected.
ta: இந்த டிராக் ஏற்றப்பட்ட அனைத்து தளங்களும் நிறுத்தப்பட்டு, பாதை வெளியேற்றப்படும்.

source: Removing %n track file(s) from disk...
ta: வட்டில் இருந்து %n டிராக் கோப்பு(களை) நீக்குகிறது...

source: Note: if you are in the Computer or Recording view you need to click the current view again to see changes.
ta: குறிப்பு: நீங்கள் கணினி அல்லது ரெக்கார்டிங் பார்வையில் இருந்தால், மாற்றங்களைக் காண தற்போதைய காட்சியை மீண்டும் சொடுக்கு செய்ய வேண்டும்.

source: Track File Moved To Trash
ta: டிராக் கோப்பு குப்பைக்கு நகர்த்தப்பட்டது

source: Track file was moved to trash and purged from the Mixxx database.
ta: ட்ராக் கோப்பு குப்பைக்கு நகர்த்தப்பட்டு Mixxx தரவுத்தளத்திலிருந்து அகற்றப்பட்டது.

source: The following %1 file(s) could not be moved to trash
ta: பின்வரும் %1 கோப்பை(களை) குப்பைக்கு நகர்த்த முடியவில்லை

source: This track file could not be moved to trash
ta: இந்த டிராக் கோப்பை குப்பைக்கு நகர்த்த முடியவில்லை

source: Setting cover art of %n track(s)
ta: %n டிராக்(களின்) கவர் ஆர்ட்டை அமைத்தல்

source: Reloading cover art of %n track(s)
ta: %n டிராக்(களின்) கவர் ஆர்ட்டை மீண்டும் ஏற்றுகிறது

source: title
ta: தலைப்பு

source: Confirm track hide
ta: தட மறைவை உறுதிப்படுத்தவும்

source: Are you sure you want to hide the selected tracks?
ta: தேர்ந்தெடுத்த டிராக்குகளை நிச்சயமாக மறைக்க விரும்புகிறீர்களா?

source: Are you sure you want to remove the selected tracks from AutoDJ queue?
ta: AutoDJ வரிசையில் இருந்து தேர்ந்தெடுத்த டிராக்குகளை நிச்சயமாக அகற்ற விரும்புகிறீர்களா?

source: Are you sure you want to remove the selected tracks from this crate?
ta: தேர்ந்தெடுக்கப்பட்ட டிராக்குகளை இந்தப் பெட்டியிலிருந்து நிச்சயமாக அகற்ற விரும்புகிறீர்களா?

source: Are you sure you want to remove the selected tracks from this playlist?
ta: இந்த பிளேலிச்ட்டில் இருந்து தேர்ந்தெடுத்த டிராக்குகளை நிச்சயமாக அகற்ற விரும்புகிறீர்களா?

source: Don't ask again during this session
ta: இந்த அமர்வின் போது மீண்டும் கேட்க வேண்டாம்

source: Confirm track removal
ta: தடத்தை அகற்றுவதை உறுதிப்படுத்தவும்

source: Show or hide columns.
ta: நெடுவரிசைகளைக் காட்டு அல்லது மறை.

source: legacy
ta: மரபு

# allshader::FilteredWaveformWidget#1
source: Filtered
ta: வடிகட்டப்பட்டது

# allshader::HSVWaveformWidget#1
source: HSV
ta: எச்.எச்.வி

# allshader::RGBStackedWaveformWidget#1
source: RGB Stacked
ta: RGB அடுக்கப்பட்டது

# allshader::SimpleWaveformWidget#1
source: Simple
ta: எளிமையானது

# allshader::WaveformWidgetTexturedFiltered#1
source: Filtered
ta: வடிகட்டப்பட்டது

# allshader::WaveformWidgetTexturedStacked#1
source: RGB Stacked
ta: RGB அடுக்கப்பட்டது

source: fonts
ta: எழுத்துருக்கள்

source: database
ta: தரவுத்தளம்

source: effects
ta: விளைவுகள்

source: audio interface
ta: ஆடியோ இடைமுகம்

source: decks
ta: அடுக்குகள்

source: library
ta: நூலகம்

source: Choose music library directory
ta: இசை நூலக கோப்பகத்தைத் தேர்ந்தெடுக்கவும்

source: controllers
ta: கட்டுப்படுத்திகள்

source: Cannot open database
ta: தரவுத்தளத்தைத் திறக்க முடியாது

source: Unable to establish a database connection. Mixxx requires QT with SQLite support. Please read the Qt SQL driver documentation for information on how to build it. Click OK to exit.
ta: தரவுத்தள இணைப்பை நிறுவ முடியவில்லை. Mixxxக்கு SQLite ஆதரவுடன் கியுடி தேவை. கியுடி கவிமொ இயக்கி ஆவணங்களை எவ்வாறு உருவாக்குவது என்பது பற்றிய தகவலுக்கு தயவுசெய்து படிக்கவும். வெளியேற சரி என்பதைக் சொடுக்கு செய்யவும்.

source: Entire music library
ta: முழு இசை நூலகம்

source: Selected crates
ta: தேர்ந்தெடுக்கப்பட்ட பெட்டிகள்

source: Browse
ta: உலாவவும்

source: Export directory
ta: ஏற்றுமதி அடைவு

source: Database version
ta: தரவுத்தள பதிப்பு

# mixxx::DlgLibraryExport#6
source: Export
ta: ஏற்றுமதி

# mixxx::DlgLibraryExport#7
source: Cancel
ta: ரத்துசெய்

source: Export Library to Engine DJ
ta: எஞ்சின் DJ க்கு நூலகத்தை ஏற்றுமதி செய்யவும்

source: Export Library To
ta: நூலகத்திற்கு ஏற்றுமதி செய்யவும்

source: No Export Directory Chosen
ta: ஏற்றுமதி கோப்பகம் எதுவும் தேர்ந்தெடுக்கப்படவில்லை

source: No export directory was chosen. Please choose a directory in order to export the music library.
ta: எந்த ஏற்றுமதி கோப்பகமும் தேர்ந்தெடுக்கப்படவில்லை. இசை நூலகத்தை ஏற்றுமதி செய்ய ஒரு கோப்பகத்தைத் தேர்ந்தெடுக்கவும்.

source: A database already exists in the chosen directory. Exported tracks will be added into this database.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பகத்தில் ஏற்கனவே ஒரு தரவுத்தளம் உள்ளது. ஏற்றுமதி செய்யப்பட்ட தடங்கள் இந்தத் தரவுத்தளத்தில் சேர்க்கப்படும்.

source: A database already exists in the chosen directory, but there was a problem loading it. Export is not guaranteed to succeed in this situation.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பகத்தில் ஏற்கனவே ஒரு தரவுத்தளம் உள்ளது, ஆனால் அதை ஏற்றுவதில் சிக்கல் உள்ளது. இந்த சூழ்நிலையில் ஏற்றுமதி வெற்றிபெற பொறுப்பு இல்லை.

source: Export Modified Track Metadata
ta: மாற்றியமைக்கப்பட்ட டிராக் மெட்டாடேட்டாவை ஏற்றுமதி செய்யவும்

source: Mixxx may wait to modify files until they are not loaded to any decks or samplers. If you do not see changed metadata in other programs immediately, eject the track from all decks and samplers or shutdown Mixxx.
ta: மிக்ச்எக்ச்எக்ச் கோப்புகளை எந்த தளங்களிலும் அல்லது மாதிரிகளிலும் ஏற்றாத வரை அவற்றை மாற்ற காத்திருக்கலாம். மற்ற நிரல்களில் மாற்றப்பட்ட மெட்டாடேட்டாவை நீங்கள் உடனடியாகக் காணவில்லை எனில், அனைத்து தளங்கள் மற்றும் மாதிரிகளிலிருந்து டிராக்கை வெளியேற்றவும் அல்லது Mixxx ஐ நிறுத்தவும்.

source: Failed to export track %1 - %2: %3
ta: % 1 - % 2 தடத்தை ஏற்றுமதி செய்வதில் தோல்வி: % 3

source: Export Completed
ta: ஏற்றுமதி முடிந்தது

source: Exported %1 track(s) and %2 crate(s).
ta: %1 டிராக்(கள்) மற்றும் %2 க்ரேட்(கள்) ஏற்றுமதி செய்யப்பட்டது.

source: Export Failed
ta: ஏற்றுமதி தோல்வியடைந்தது

source: Exporting to Engine DJ...
ta: இன்சின் DJக்கு ஏற்றுமதி செய்கிறது...

source: Abort
ta: கைவிடு

source: HID Interface %1:
ta: HID இடைமுகம்% 1:

source: Generic HID Pointer
ta: பொதுவான HID சுட்டி

source: Generic HID Mouse
ta: பொதுவான HID மவுச்

source: Generic HID Joystick
ta: பொதுவான HID சாய்ச்டிக்

source: Generic HID Game Pad
ta: பொதுவான HID கேம் பேட்

source: Generic HID Keyboard
ta: பொதுவான HID விசைப்பலகை

source: Generic HID Keypad
ta: பொதுவான HID விசைப்பலகை

source: Generic HID Multi-axis Controller
ta: பொதுவான HID மல்டி-ஆக்சிச் கன்ட்ரோலர்

source: Unknown HID Desktop Device:
ta: தெரியாத HID டெச்க்டாப் சாதனம்:

source: Apple HID Infrared Control
ta: ஆப்பிள் HID அகச்சிவப்பு கட்டுப்பாடு

source: Unknown Apple HID Device:
ta: அறியப்படாத அரத்திப்பழம், குமளிப்பழம் HID சாதனம்:

source: Unknown HID Device:
ta: தெரியாத HID சாதனம்:

source: No network access
ta: பிணையம் அணுகல் இல்லை

source: The Network request has not been started
ta: பிணையம் கோரிக்கை தொடங்கப்படவில்லை

# mixxx::qml::QmlVisibleEffectsModel#1
source: No effect loaded.
ta: எந்த விளைவும் ஏற்றப்படவில்லை.
