Repository: 247i/TACETr
Catalog: உரை/தானி/mixxxdj_mixxx2-5_*.po
Languages: ta

source: Temporary rate change when left-clicking
ta: இடது சொடுக்கு செய்யும் போது தற்காலிக விகிதம் மாற்றம்

source: Speed/Tempo
ta: வேகம்/டெம்போ

source: Key/Pitch
ta: கீ/பிட்ச்

source: Adjustment buttons:
ta: சரிசெய்தல் பொத்தான்கள்:

source: Apply tempo changes from a soft-leading track (usually the leaving track in a transition) to the follower tracks. After the transition, the follower track will continue with the previous leader's very last tempo. Changes from explicit selected leaders are always applied.
ta: ஒரு மென்மையான-முன்னணி பாதையில் இருந்து டெம்போ மாற்றங்களை (பொதுவாக மாற்றத்தில் வெளியேறும் பாதை) பின்தொடர்பவர் தடங்களுக்குப் பயன்படுத்தவும். மாற்றத்திற்குப் பிறகு, பின்தொடர்பவர் தடமானது முந்தைய தலைவரின் கடைசி டெம்போவுடன் தொடரும். வெளிப்படையான தேர்ந்தெடுக்கப்பட்ட தலைவர்களின் மாற்றங்கள் எப்போதும் பயன்படுத்தப்படும்.

source: Follow soft leader's tempo
ta: மென்மையான தலைவரின் டெம்போவைப் பின்பற்றுங்கள்

source: Coarse
ta: கரடுமுரடான

source: Fine
ta: நன்றாக

source: Make the speed sliders work like those on DJ turntables and CDJs where moving downward increases the speed
ta: வேக ச்லைடர்களை DJ டர்ன்டேபிள்கள் மற்றும் CDJ களில் உள்ளதைப் போல வேலை செய்யும், அங்கு கீழ்நோக்கி நகரும் விரைவு அதிகரிக்கும்

source: Down increases speed
ta: கீழே விரைவு அதிகரிக்கிறது

source: Slider range
ta: ச்லைடர் வரம்பு

source: Adjusts the range of the speed (Vinyl "Pitch") slider.
ta: வேகத்தின் (வினைல் "பிட்ச்") ச்லைடரின் வரம்பை சரிசெய்கிறது.

source: Abrupt jump
ta: திடீர் சம்ப்

source: Smoothly adjusts deck speed when temporary change buttons are held down
ta: தற்காலிக மாற்ற பொத்தான்கள் அழுத்தப்பட்டிருக்கும் போது, ​​டெக் வேகத்தை மென்மையாக சரிசெய்கிறது

source: Smooth ramping
ta: மென்மையான வளைவு

source: Keyunlock mode
ta: கீயுன்லாக் பயன்முறை

source: Reset key
ta: மீட்டமை விசை

source: Keep key
ta: சாவியை வைத்திருங்கள்

source: The tempo of a previous soft leader track at the beginning of the transition is kept steady. After the transition, the follower track will maintain this original tempo. This technique serves as a workaround to avoid dynamic tempo changes, as seen during the outro of rubato-style tracks. For instance, it prevents the follower track from continuing with a slowed-down tempo of the soft leader. This corresponds to the behavior before Mixxx 2.4. Changes from explicit selected leaders are always applied.
ta: மாற்றத்தின் தொடக்கத்தில் முந்தைய சாஃப்ட் லீடர் டிராக்கின் டெம்போ சீராக வைக்கப்படுகிறது. மாற்றத்திற்குப் பிறகு, பின்தொடர்பவர் இந்த அசல் டெம்போவைப் பராமரிக்கும். இந்த நுட்பம், ருபாடோ-பாணி டிராக்குகளின் வெளிப்பாட்டின் போது காணப்படுவது போல, மாறும் டெம்போ மாற்றங்களைத் தவிர்ப்பதற்கான ஒரு தீர்வாக செயல்படுகிறது. எடுத்துக்காட்டாக, மென்மையான தலைவரின் விரைவு குறைவதில் பின்தொடர்பவர் தடம் தொடர்வதை இது தடுக்கிறது. இது Mixxx 2.4க்கு முந்தைய நடத்தைக்கு ஒத்திருக்கிறது. வெளிப்படையான தேர்ந்தெடுக்கப்பட்ட தலைவர்களின் மாற்றங்கள் எப்போதும் பயன்படுத்தப்படும்.

source: Use steady tempo
ta: நிலையான டெம்போவைப் பயன்படுத்தவும்

source: Effects Preferences
ta: விளைவுகள் விருப்பத்தேர்வுகள்

source: Effect Chain Presets
ta: விளைவு சங்கிலி முன்னமைவுகள்

source: Drag and drop to rearrange lists and copy chains between lists. Create and edit chain presets in the effect units in the main window. Please refer the manual for further details.
ta: பட்டியல்களை மறுசீரமைக்க இழுத்து விடுங்கள் மற்றும் பட்டியல்களுக்கு இடையில் சங்கிலிகளை நகலெடுக்கவும். முதன்மையான சாளரத்தில் உள்ள விளைவு அலகுகளில் சங்கிலி முன்னமைவுகளை உருவாக்கி திருத்தவும். மேலும் விவரங்களுக்கு கையேட்டைப் பார்க்கவும்.

source: Chain presets from these lists will be selectable in the given order in the main window and from controllers (depending on the controller mapping).
ta: இந்த பட்டியல்களில் இருந்து செயின் முன்னமைவுகள் முதன்மையான சாளரத்தில் கொடுக்கப்பட்ட வரிசையில் தேர்ந்தெடுக்கப்படும் மற்றும் கட்டுப்படுத்திகளிலிருந்து (கட்டுப்படுத்தி மேப்பிங்கைப் பொறுத்து).

source: Effects in this chain preset:
ta: இந்த சங்கிலி முன்னமைவில் உள்ள விளைவுகள்:

source: effect 1 name
ta: விளைவு 1 பெயர்

source: effect 2 name
ta: விளைவு 2 பெயர்

source: effect 3 name
ta: விளைவு 3 பெயர்

source: Import
ta: இறக்குமதி

# DlgPrefEffectsDlg#10
source: Rename
ta: மறுபெயரிடுக

# DlgPrefEffectsDlg#11
source: Export
ta: ஏற்றுமதி

source: Delete
ta: நீக்கு

source: Quick Effect Chain Presets
ta: விரைவு விளைவு சங்கிலி முன்னமைவுகள்

source: Visible Effects
ta: காணக்கூடிய விளைவுகள்

source: Drag and drop to rearrange lists and show or hide effects.
ta: பட்டியல்களை மறுசீரமைக்க மற்றும் விளைவுகளைக் காட்ட அல்லது மறைக்க இழுத்து விடுங்கள்.

source: Hidden Effects
ta: மறைக்கப்பட்ட விளைவுகள்

source: Effect load behavior
ta: விளைவு சுமை நடத்தை

source: Keep metaknob position
ta: மெட்டாக்னாப் நிலையை வைத்திருங்கள்

source: Reset metaknob to effect default
ta: மெட்டாக்னாப்பை இயல்புநிலைக்கு மீட்டமைக்கவும்

source: Effect Info
ta: விளைவு செய்தி

source: Version:
ta: பதிப்பு:

# DlgPrefEffectsDlg#24
source: Description:
ta: விளக்கம்:

# DlgPrefEffectsDlg#25
source: Author:
ta: ஆசிரியர்:

# DlgPrefEffectsDlg#26
source: Name:
ta: பெயர்:

source: Type:
ta: தட்டச்சு:

source: The minimum size of the selected skin is bigger than your screen resolution.
ta: தேர்ந்தெடுக்கப்பட்ட தோலின் குறைந்தபட்ச அளவு உங்கள் திரை தெளிவுத்திறனை விட பெரியது.

source: Allow screensaver to run
ta: ச்கிரீன்சேவரை இயக்க அனுமதிக்கவும்

source: Prevent screensaver from running
ta: ச்கிரீன்சேவர் இயங்குவதைத் தடுக்கவும்

source: Prevent screensaver while playing
ta: விளையாடும்போது ச்கிரீன்சேவரைத் தடுக்கவும்

# DlgPrefInterface#5
source: Disabled
ta: முடக்கப்பட்டது

source: 2x MSAA
ta: ஃச் PM

source: This skin does not support color schemes
ta: இந்த தோல் வண்ணத் திட்டங்களை ஆதரிக்காது

# DlgPrefInterface#11
source: Information
ta: தகவல்

source: Mixxx must be restarted before the new locale, scaling or multi-sampling settings will take effect.
ta: புதிய மொழி, அளவிடுதல் அல்லது பல மாதிரி அமைப்புகள் நடைமுறைக்கு வரும் முன் Mixxx மீண்டும் தொடங்கப்பட வேண்டும்.

source: Key Notation Format Settings
ta: முக்கிய குறிப்பு வடிவமைப்பு அமைப்புகள்

source: When key detection is enabled, Mixxx detects the musical key of your tracks and allows you to pitch adjust them for harmonic mixing.
ta: விசை கண்டறிதல் இயக்கப்பட்டால், Mixxx உங்கள் டிராக்குகளின் இசை விசையைக் கண்டறியும் ஆர்மோனிக் கலவைக்காக அவற்றை சரிசெய்ய உங்களை அனுமதிக்கிறது.

source: Enable Key Detection
ta: முக்கிய கண்டறிதலை இயக்கு

# DlgPrefKeyDlg#4
source: Choose Analyzer
ta: பகுப்பாய்வியைத் தேர்ந்தெடுக்கவும்

source: Choose between different algorithms to detect keys.
ta: விசைகளைக் கண்டறிய வெவ்வேறு அல்காரிதங்களுக்கு இடையே தேர்வு செய்யவும்.

# DlgPrefKeyDlg#6
source: Analyzer Settings
ta: பகுப்பாய்வி அமைப்புகள்

# DlgPrefKeyDlg#7
source: Enable Fast Analysis (For slow computers, may be less accurate)
ta: வேகமான பகுப்பாய்வை இயக்கு (மெதுவான கணினிகளுக்கு, குறைவான துல்லியமாக இருக்கலாம்)

source: Re-analyze keys when settings change or 3rd-party keys are present
ta: அமைப்புகள் மாறும்போது அல்லது மூன்றாம் தரப்பு விசைகள் இருக்கும்போது விசைகளை மீண்டும் பகுப்பாய்வு செய்யவும்

source: Key Notation
ta: முக்கிய குறிப்பு

source: Lancelot
ta: லான்சலாட்

source: Lancelot/Traditional
ta: லான்சலாட்/பாரம்பரியமானது

source: OpenKey/Traditional
ta: OpenKey/பாரம்பரியமானது

source: Traditional
ta: பாரம்பரியமானது

source: Custom
ta: தனிப்பயன்

source: A
ta: ஏ

source: Bb
ta: பிபி

source: B
ta: பி

source: C
ta: சி

source: D
ta: டி

source: Eb
ta: எப்

source: E
ta: இ

source: F
ta: எஃப்

source: G
ta: ஐயா

source: Ab
ta: ஏபி

source: Am
ta: ஆம்

source: Bbm
ta: பிபிஎம்

source: Bm
ta: பிஎம்

source: Cm
ta: செ.மீ

source: Em
ta: எம்

source: G#m
ta: சி#எம்

source: See the manual for details
ta: விவரங்களுக்கு கையேட்டைப் பார்க்கவும்

# DlgPrefLibrary#2
source: Music Directory Added
ta: இசை அடைவு சேர்க்கப்பட்டது

# DlgPrefLibrary#3
source: You added one or more music directories. The tracks in these directories won't be available until you rescan your library. Would you like to rescan now?
ta: ஒன்று அல்லது அதற்கு மேற்பட்ட இசை கோப்பகங்களைச் சேர்த்துள்ளீர்கள். உங்கள் லைப்ரரியை மீண்டும் வருடு செய்யும் வரை இந்த கோப்பகங்களில் உள்ள டிராக்குகள் கிடைக்காது. இப்போது மீண்டும் வருடு செய்ய விரும்புகிறீர்களா?

# DlgPrefLibrary#4
source: Scan
ta: வருடு செய்யவும்

source: Item is not a directory or directory is missing
ta: உருப்படி ஒரு கோப்பகம் அல்ல அல்லது அடைவு இல்லை

source: Choose a music directory
ta: இசை கோப்பகத்தைத் தேர்ந்தெடுக்கவும்

source: Confirm Directory Removal
ta: கோப்பகத்தை அகற்றுவதை உறுதிப்படுத்தவும்

source: Mixxx will no longer watch this directory for new tracks. What would you like to do with the tracks from this directory and subdirectories?<ul><li>Hide all tracks from this directory and subdirectories.</li><li>Delete all metadata for these tracks from Mixxx permanently.</li><li>Leave the tracks unchanged in your library.</li></ul>Hiding tracks saves their metadata in case you re-add them in the future.
ta: Mixxx இனி புதிய டிராக்குகளுக்காக இந்தக் கோப்பகத்தைப் பார்க்காது. இந்தக் கோப்பகம் மற்றும் துணை அடைவுகளில் உள்ள ட்ராக்குகளை நீங்கள் என்ன செய்ய விரும்புகிறீர்கள்?<ul><li>இந்த கோப்பகம் மற்றும் துணை அடைவுகளில் இருந்து அனைத்து ட்ராக்குகளையும் மறைக்கவும்.</li><li>Mixxx இலிருந்து இந்த டிராக்குகளுக்கான அனைத்து மெட்டாடேட்டாவையும் நிரந்தரமாக நீக்கவும்.</li><li>டிராக்குகளை உங்கள் நூலகத்தில் மாற்றாமல் விடவும்.</li></ul>எதிர்காலத்தில் அவற்றை மீட்-டேட்டாவை மறைப்பது அவற்றின் மீட்-டாட்டாவைச் சேமிக்கும்.

source: Metadata means all track details (artist, title, playcount, etc.) as well as beatgrids, hotcues, and loops. This choice only affects the Mixxx library. No files on disk will be changed or deleted.
ta: மேனிலை தரவு என்பது அனைத்து டிராக் விவரங்கள் (கலைஞர், தலைப்பு, பிளேகவுண்ட், முதலியன) அத்துடன் பீட்கிரிட்கள், ஆட்குகள் மற்றும் லூப்கள். இந்த தேர்வு Mixxx நூலகத்தை மட்டுமே பாதிக்கும். வட்டில் உள்ள கோப்புகள் எதுவும் மாற்றப்படாது அல்லது நீக்கப்படாது.

source: Hide Tracks
ta: தடங்களை மறை

source: Delete Track Metadata
ta: ட்ராக் மெட்டாடேட்டாவை நீக்கு

source: Leave Tracks Unchanged
ta: தடங்களை மாற்றாமல் விடுங்கள்

source: Relink music directory to new location
ta: புதிய இடத்திற்கு இசை கோப்பகத்தை மீண்டும் இணைக்கவும்

source: Black
ta: கருப்பு

source: Bold
ta: தடிமான

source: SemiBold
ta: அரை தடித்த

source: Medium
ta: சராசரி

source: Light
ta: ஒளி

source: Select Library Font
ta: நூலக எழுத்துருவைத் தேர்ந்தெடுக்கவும்

source: If removed, Mixxx will no longer watch this directory and its subdirectories for new tracks.
ta: அகற்றப்பட்டால், Mixxx இந்த கோப்பகத்தையும் அதன் துணை அடைவுகளையும் புதிய டிராக்குகளுக்காக இனி பார்க்காது.

# DlgPrefLibraryDlg#2
source: Remove
ta: நீக்குக

source: Add a directory where your music is stored. Mixxx will watch this directory and its subdirectories for new tracks.
ta: உங்கள் இசை சேமிக்கப்பட்ட கோப்பகத்தைச் சேர்க்கவும். Mixxx இந்த கோப்பகத்தையும் அதன் துணை அடைவுகளையும் புதிய டிராக்குகளுக்காக பார்க்கும்.

source: Music Directories
ta: இசை அடைவுகள்

# DlgPrefLibraryDlg#5
source: Add
ta: கூட்டு

source: If an existing music directory is moved, Mixxx doesn't know where to find the audio files in it. Choose Relink to select the music directory in its new location. <br/> This will re-establish the links to the audio files in the Mixxx library.
ta: ஏற்கனவே உள்ள இசை அடைவு நகர்த்தப்பட்டால், அதில் உள்ள ஆடியோ கோப்புகளை எங்கு கண்டுபிடிப்பது என்பது Mixxxக்கு தெரியாது. புதிய இடத்தில் உள்ள இசைக் கோப்பகத்தைத் தேர்ந்தெடுக்க, மீண்டும் இணைப்பைத் தேர்ந்தெடுக்கவும். <br/> இது Mixxx நூலகத்தில் உள்ள ஆடியோ கோப்புகளுக்கான இணைப்புகளை மீண்டும் நிறுவும்.

source: Relink
ta: மீண்டும் இணைக்கவும்

source: Rescan directories on start-up
ta: தொடக்கத்தில் கோப்பகங்களை மீண்டும் வருடு செய்யவும்

source: Audio File Formats
ta: ஆடியோ கோப்பு வடிவங்கள்

source: Track Table View
ta: அட்டவணைக் காட்சியைக் கண்காணிக்கவும்

source: Track Double-Click Action:
ta: டபுள் சொடுக்கு செயலைக் கண்காணிக்கவும்:

source: BPM display precision:
ta: BPM காட்சி துல்லியம்:

source: Session History
ta: அமர்வு வரலாறு

source: Track duplicate distance
ta: நகல் தூரத்தைக் கண்காணிக்கவும்

source: When playing a track again log it to the session history only if more than N other tracks have been played in the meantime
ta: ஒரு டிராக்கை மீண்டும் இயக்கும்போது, ​​இதற்கிடையில் N க்கும் அதிகமான டிராக்குகள் இயக்கப்பட்டிருந்தால் மட்டுமே அதை அமர்வு வரலாற்றில் பதிவு செய்யவும்

source: History playlist with less than N tracks will be deleted<br/><br/>Note: the cleanup will be performed during startup and shutdown of Mixxx.
ta: N க்குக் குறைவான தடங்களைக் கொண்ட வரலாறு பிளேலிச்ட் நீக்கப்படும்<br/><br/>குறிப்பு: Mixxx இன் ச்டார்ட்அப் மற்றும் சட் பேரூர் போது தூய்மை செய்யப்படும்.

source: Delete history playlist with less than N tracks
ta: N ட்ராக்குகளை விட குறைவான வரலாற்று பிளேலிச்ட்டை நீக்கவும்

source: Library Font:
ta: நூலக எழுத்துரு:

source: Grey out played tracks
ta: கிரே அவுட் விளையாடிய டிராக்குகள்

source: Track Search
ta: ட்ராக் தேடு

source: Enable search completions
ta: தேடல் நிறைவுகளை இயக்கு

source: Enable search history keyboard shortcuts
ta: தேடல் வரலாறு விசைப்பலகை குறுக்குவழிகளை இயக்கு

source: Percentage of pitch slider range for 'fuzzy' BPM search:
ta: 'தெளிவில்லாத' BPM தேடலுக்கான பிட்ச் ச்லைடர் வரம்பின் சதவீதம்:

source: This range will be used for the 'fuzzy' BPM search (~bpm:) via the search box, as well as for BPM search in Track context menu > Search related Tracks
ta: இந்த வரம்பு தேடல் பெட்டி வழியாக 'தெளிவில்லாத' BPM தேடலுக்கு (~bpm:) பயன்படுத்தப்படும், அதே போல் ட்ராக் சூழல் பட்டியல் > தேடல் தொடர்பான தடங்களில் BPM தேடலுக்கும் பயன்படுத்தப்படும்.

source: Preferred Cover Art Fetcher Resolution
ta: விருப்பமான கவர் ஆர்ட் பெறுதல் தீர்மானம்

source: Fetch cover art from coverartarchive.com by using Import Metadata From Musicbrainz.
ta: Musicbrainz இலிருந்து மெட்டாடேட்டாவை இறக்குமதி செய்வதன் மூலம் coverartarchive.com இலிருந்து அட்டைப்படத்தைப் பெறவும்.

source: Note: ">1200 px" can fetch up to very large cover arts.
ta: குறிப்பு: ">1200 px" மிகப் பெரிய கவர் ஆர்ட்ச் வரை பெறலாம்.

source: >1200 px (if available)
ta: >1200 px (கிடைத்தால்)

source: 1200 px (if available)
ta: 1200 px (கிடைத்தால்)

source: Settings Directory
ta: அமைப்புகள் அடைவு

source: The Mixxx settings directory contains the library database, various configuration files, log files, track analysis data, as well as custom controller mappings.
ta: Mixxx அமைப்புகளின் கோப்பகத்தில் நூலக தரவுத்தளம், பல்வேறு கட்டமைப்பு கோப்புகள், பதிவு கோப்புகள், ட்ராக் பகுப்பாய்வு தரவு மற்றும் தனிப்பயன் கட்டுப்படுத்தி மேப்பிங்குகள் உள்ளன.

source: Edit those files only if you know what you are doing and only while Mixxx is not running.
ta: நீங்கள் என்ன செய்கிறீர்கள் என்பது உங்களுக்குத் தெரிந்தால் மட்டுமே அந்தக் கோப்புகளைத் திருத்தவும் மற்றும் Mixxx இயங்காதபோது மட்டுமே.

source: Open Mixxx Settings Folder
ta: Mixxx அமைப்புகள் கோப்புறையைத் திறக்கவும்

source: Library Row Height:
ta: நூலகத்தின் வரிசை உயரம்:

source: Use relative paths for playlist export if possible
ta: முடிந்தால் பிளேலிச்ட் ஏற்றுமதிக்கு தொடர்புடைய பாதைகளைப் பயன்படுத்தவும்

source: Synchronize library track metadata from/to file tags
ta: லைப்ரரி டிராக் மெட்டாடேட்டாவை கோப்பு குறிச்சொற்களில் இருந்து ஒத்திசைக்கவும்

source: Automatically write modified track metadata from the library into file tags and reimport metadata from updated file tags into the library
ta: லைப்ரரியில் இருந்து மாற்றியமைக்கப்பட்ட டிராக் மெட்டாடேட்டாவை கோப்பு குறிச்சொற்களில் தானாக எழுதவும் மற்றும் புதுப்பிக்கப்பட்ட கோப்பு குறிச்சொற்களில் இருந்து மெட்டாடேட்டாவை நூலகத்தில் மீண்டும் இறக்குமதி செய்யவும்

source: Synchronize Serato track metadata from/to file tags (experimental)
ta: செரட்டோ டிராக் மெட்டாடேட்டாவை கோப்பு குறிச்சொற்களில் இருந்து ஒத்திசைக்கவும் (பரிசோதனை)

source: Keeps track color, beat grid, bpm lock, cue points, and loops synchronized with SERATO_MARKERS/MARKERS2 file tags.<br/><br/>WARNING: Enabling this option also enables the reimport of Serato metadata after files have been modified outside of Mixxx. On reimport existing metadata in Mixxx is replaced with the metadata found in file tags. Custom metadata not included in file tags like loop colors is lost.
ta: ட்ராக் கலர், பீட் கிரிட், பிபிஎம் லாக், கியூ பாயிண்ட்கள் மற்றும் லூப்கள் SERATO_MARKERS/MARKERS2 கோப்பு குறிச்சொற்களுடன் ஒத்திசைக்கப்படும்.<br/><br/>எச்சரிக்கை: இந்த விருப்பத்தை இயக்குவது, Mixxx க்கு வெளியே கோப்புகள் மாற்றியமைக்கப்பட்ட பிறகு, Serato மெட்டாடேட்டாவை மீண்டும் இறக்குமதி செய்வதையும் செயல்படுத்துகிறது. Mixxx இல் இருக்கும் மெட்டாடேட்டாவை மீண்டும் இறக்குமதி செய்யும் போது கோப்பு குறிச்சொற்களில் காணப்படும் மெட்டாடேட்டாவுடன் மாற்றப்படும். லூப் நிறங்கள் தொலைந்துவிட்டன போன்ற கோப்பு குறிச்சொற்களில் தனிப்பயன் மேனிலை தரவு சேர்க்கப்படவில்லை.

source: Edit metadata after clicking selected track
ta: தேர்ந்தெடுக்கப்பட்ட டிராக்கைக் சொடுக்கு செய்த பிறகு மெட்டாடேட்டாவைத் திருத்தவும்

source: Search-as-you-type timeout:
ta: நீங்கள் வகையாகத் தேடும் நேரம் முடிந்தது:

source: Load track to next available deck
ta: கிடைக்கக்கூடிய அடுத்த தளத்திற்கு டிராக்கை ஏற்றவும்

source: External Libraries
ta: வெளிப்புற நூலகங்கள்

source: You will need to restart Mixxx for these settings to take effect.
ta: இந்த அமைப்புகள் செயல்பட நீங்கள் Mixxx ஐ மறுதொடக்கம் செய்ய வேண்டும்.

source: Show Rhythmbox Library
ta: ரிதம்பாக்ச் நூலகத்தைக் காட்டு

source: Track Metadata Synchronization / Playlists
ta: மேனிலை தரவு ஒத்திசைவு / பிளேலிச்ட்களைக் கண்காணிக்கவும்

source: Add track to Auto DJ queue (bottom)
ta: ஆட்டோ டிசே வரிசையில் டிராக்கைச் சேர்க்கவும் (கீழே)

source: Add track to Auto DJ queue (top)
ta: ஆட்டோ டிசே வரிசையில் டிராக்கைச் சேர்க்கவும் (மேல்)

source: Ignore
ta: புறக்கணிக்கவும்

source: Show Banshee Library
ta: பன்சீ நூலகத்தைக் காட்டு

source: Show iTunes Library
ta: ஐடியூன்ச் நூலகத்தைக் காட்டு

source: Show Traktor Library
ta: டிராக்டர் நூலகத்தைக் காட்டு

source: Show Rekordbox Library
ta: Rekordbox நூலகத்தைக் காட்டு

source: Show Serato Library
ta: செராட்டோ நூலகத்தைக் காட்டு

source: All external libraries shown are write protected.
ta: காட்டப்படும் அனைத்து வெளிப்புற நூலகங்களும் எழுதப் பாதுகாக்கப்படுகின்றன.

source: Crossfader Preferences
ta: கிராச்ஃபேடர் விருப்பத்தேர்வுகள்

source: Crossfader Curve
ta: கிராச்ஃபேடர் வளைவு

source: Slow fade/Fast cut (additive)
ta: ச்லோ ஃபேட்/ஃபாச்ட் கட் (சேர்க்கை)

source: Constant power
ta: நிலையான ஆற்றல்

source: Mixing
ta: கலக்கும்

source: Scratching
ta: அரிப்பு

source: Linear
ta: நேரியல்

source: Logarithmic
ta: மடக்கை

source: Reverse crossfader (Hamster Style)
ta: தலைகீழ் கிராச்ஃபேடர் (வெள்ளெலி உடை)

source: Deck Equalizers
ta: டெக் ஈக்வலைசர்கள்

source: Only allow EQ knobs to control EQ-specific effects
ta: EQ-குறிப்பிட்ட விளைவுகளைக் கட்டுப்படுத்த EQ கைப்பிடிகளை மட்டும் அனுமதிக்கவும்

source: Uncheck to allow any effect to be loaded into the EQ knobs.
ta: EQ கைப்பிடிகளில் எந்த விளைவையும் ஏற்ற அனுமதிக்க, தேர்வுநீக்கவும்.

source: Use the same EQ filter for all decks
ta: அனைத்து தளங்களுக்கும் ஒரே ஈக்யூ வடிப்பானைப் பயன்படுத்தவும்

source: Uncheck to allow different decks to use different EQ effects.
ta: வெவ்வேறு ஈக்யூ விளைவுகளைப் பயன்படுத்த வெவ்வேறு தளங்களை அனுமதிக்க தேர்வுநீக்கவும்.

source: Equalizer Plugin
ta: ஈக்வலைசர் செருகுநிரல்

# DlgPrefMixerDlg#16
source: Quick Effect
ta: விரைவான விளைவு

source: Bypass EQ effect processing
ta: பைபாச் EQ விளைவு செயலாக்கம்

source: When checked, EQs are not processed, improving performance on slower computers.
ta: சரிபார்க்கும் போது, ​​EQ கள் செயலாக்கப்படவில்லை, மெதுவான கணினிகளில் செயல்திறனை மேம்படுத்துகிறது.

source: Resets the equalizers to their default values when loading a track.
ta: டிராக்கை ஏற்றும்போது சமநிலையை அவற்றின் இயல்புநிலை மதிப்புகளுக்கு மீட்டமைக்கவும்.

source: Reset equalizers on track load
ta: டிராக் லோடில் சமநிலைகளை மீட்டமைக்கவும்

source: Resets the deck gain to unity when loading a track.
ta: ட்ராக்கை ஏற்றும்போது டெக் ஆதாயத்தை ஒற்றுமைக்கு மீட்டமைக்கிறது.

source: Reset gain on track load
ta: ட்ராக் லோடில் ஆதாயத்தை மீட்டமைக்கவும்

source: Equalizer frequency Shelves
ta: சமநிலை அதிர்வெண் அலமாரிகள்

# DlgPrefMixerDlg#24
source: High EQ
ta: உயர் ஈக்யூ

source: 16 Hz
ta: 16 எர்ட்ச்

# DlgPrefMixerDlg#27
source: Low EQ
ta: குறைந்த ஈக்யூ

source: Main EQ
ta: முக்கிய ஈக்யூ

source: Reset Parameter
ta: அளவுருவை மீட்டமைக்கவும்

source: Modplug Preferences
ta: Modplug விருப்பத்தேர்வுகள்

source: Maximum Number of Mixing Channels:
ta: கலக்கும் சேனல்களின் அதிகபட்ச எண்ணிக்கை:

source: Show Advanced Settings
ta: மேம்பட்ட அமைப்புகளைக் காட்டு

# DlgPrefModplug#4
source: Low
ta: குறைந்த

source: Reverb Delay:
ta: ரிவெர்ப் தாமதம்:

# DlgPrefModplug#6
source: High
ta: உயர்

# DlgPrefModplug#7
source: None
ta: எதுவுமில்லை

source: Bass Expansion
ta: பாச் விரிவாக்கம்

source: Bass Range:
ta: பாச் வரம்பு:

source: Front/Rear Delay:
ta: முன்/பின் தாமதம்:

source: Pro-Logic Surround
ta: சார்பு லாசிக் சரவுண்ட்

source: Full
ta: முழு

# DlgPrefModplug#14
source: Reverb
ta: பழமொழி

source: Stereo separation
ta: ச்டீரியோ பிரிப்பு

source: 10Hz
ta: 10 எர்ட்ச்

source: 10ms
ta: 10எம்எச்

source: 5ms
ta: 5மி.வி

source: 250ms
ta: 250எம்எச்

source: 50ms
ta: 50எம்எச்

source: Noise reduction
ta: ஒலி குறைப்பு

# DlgPrefModplug#24
source: Hints
ta: குறிப்புகள்

source: Module files are decoded at once and kept in RAM to allow for seeking and smooth operation in Mixxx. About 10MB of RAM are required for 1 minute of audio.
ta: தொகுதி கோப்புகள் ஒரே நேரத்தில் டிகோட் செய்யப்பட்டு ரேமில் சேமிக்கப்பட்டு Mixxx இல் தேடுதல் மற்றும் சீரான செயல்பாட்டை அனுமதிக்கும். 1 நிமிட ஆடியோவிற்கு 10MB ரேம் தேவை.

source: Decoding options for libmodplug, a software library for loading and rendering module files (MOD music, tracker music).
ta: libmodplug க்கான டிகோடிங் விருப்பங்கள், தொகுதி கோப்புகளை ஏற்றுவதற்கும் வழங்குதல் செய்வதற்கும் ஒரு மென்பொருள் நூலகம் (MOD இசை, டிராக்கர் இசை).

source: Decoding Options
ta: டிகோடிங் விருப்பங்கள்

source: Resampling mode (interpolation)
ta: மறு மாதிரி முறை (இடைக்கணிப்பு)

source: Enable oversampling
ta: மிகை மாதிரியை இயக்கவும்

source: Nearest (very fast, extremely bad quality)
ta: அருகில் (மிக வேகமாக, மிக மோசமான தரம்)

source: Linear (fast, good quality)
ta: நேரியல் (வேகமான, நல்ல தரம்)

source: Cubic Spline (high quality)
ta: க்யூபிக் ச்ப்லைன் (உயர் தரம்)

source: 8-tap FIR (extremely high quality)
ta: 8-தட்டுதல் FIR (மிகவும் உயர்தரம்)

source: Memory limit for single track (MB)
ta: ஒற்றை டிராக்கிற்கான நினைவக வரம்பு (MB)

source: All settings take effect on next track load. Currently loaded tracks are not affected. For an explanation of these settings, see the %1
ta: அனைத்து அமைப்புகளும் அடுத்த டிராக் லோடில் செயல்படும். தற்போது ஏற்றப்பட்ட தடங்கள் பாதிக்கப்படவில்லை. இந்த அமைப்புகளின் விளக்கத்திற்கு, % 1 ஐப் பார்க்கவும்

source: Choose recordings directory
ta: பதிவுகள் கோப்பகத்தைத் தேர்ந்தெடுக்கவும்

source: Recordings directory invalid
ta: பதிவுகளின் அடைவு தவறானது

source: Recordings directory must be set to an existing directory.
ta: ரெக்கார்டிங் கோப்பகத்தை ஏற்கனவே உள்ள கோப்பகத்தில் அமைக்க வேண்டும்.

source: Recordings directory must be set to a directory.
ta: ரெக்கார்டிங் கோப்பகம் ஒரு கோப்பகமாக அமைக்கப்பட வேண்டும்.

source: Recordings directory not writable
ta: பதிவுகள் கோப்பகம் எழுத முடியாதது

source: You do not have write access to %1. Choose a recordings directory you have write access to.
ta: %1க்கு எழுதும் அணுகல் உங்களிடம் இல்லை. உங்களுக்கு எழுதும் அணுகல் உள்ள ரெக்கார்டிங் கோப்பகத்தைத் தேர்வு செய்யவும்.

source: Recording Preferences
ta: பதிவு விருப்பங்கள்

source: Browse...
ta: உலாவுக...

source: Quality
ta: தகுதி

# DlgPrefRecordDlg#4
source: Tags
ta: குறிச்சொற்கள்

# DlgPrefRecordDlg#5
source: Title
ta: தலைப்பு

source: Author
ta: நூலாசிரியர்

# DlgPrefRecordDlg#7
source: Album
ta: ஆல்பம்

source: Output File Format
ta: வெளியீட்டு கோப்பு வடிவம்

source: Compression
ta: சுருக்கம்

source: Lossy
ta: இழப்பு

source: Recording Files
ta: பதிவு கோப்புகள்

source: Directory:
ta: அடைவு:

source: Compression Level
ta: சுருக்க நிலை

source: Lossless
ta: இழப்பற்றது

source: Create a CUE file
ta: CUE கோப்பை உருவாக்கவும்

source: Split recordings at
ta: இல் பதிவுகளைப் பிரிக்கவும்

source: %1 LUFS (adjust by %2 dB)
ta: %1 LUFS (%2 dB ஆல் சரிசெய்க)
