Repository: 247i/TACETr
Catalog: உரை/தானி/mixxxdj_mixxx2-5_*.po
Languages: ta

source: Dumps all ControlObject values to a csv-file saved in the settings path (e.g. ~/.mixxx)
ta: அமைப்புகள் பாதையில் சேமிக்கப்பட்ட csv-கோப்பில் அனைத்து ControlObject மதிப்புகளையும் டம்ப் செய்கிறது (எ.கா. ~/.mixxx)

source: Dump to csv
ta: காபிம க்கு டம்ப்

source: Log
ta: பதிவு

# DlgDeveloperTools#6
source: Search
ta: தேடல்

source: Stats
ta: புள்ளிவிவரங்கள்

# DlgHidden#1
source: Hidden Tracks
ta: மறைக்கப்பட்ட தடங்கள்

# DlgHidden#2
source: Selects all tracks in the table below.
ta: கீழே உள்ள அட்டவணையில் உள்ள அனைத்து தடங்களையும் தேர்ந்தெடுக்கிறது.

# DlgHidden#3
source: Select All
ta: அனைத்தையும் தெரிவுசெய்

# DlgHidden#4
source: Purge selected tracks from the library.
ta: நூலகத்திலிருந்து தேர்ந்தெடுக்கப்பட்ட தடங்களை அகற்றவும்.

# DlgHidden#5
source: Purge
ta: சுத்தப்படுத்து

source: Unhide selected tracks from the library.
ta: நூலகத்திலிருந்து தேர்ந்தெடுக்கப்பட்ட தடங்களை மறைக்கவும்.

source: Unhide
ta: மறைக்க

source: Purge selected tracks from the library and delete files from disk.
ta: நூலகத்திலிருந்து தேர்ந்தெடுக்கப்பட்ட டிராக்குகளை அகற்றி, வட்டில் இருந்து கோப்புகளை நீக்கவும்.

source: Purge And Delete Files
ta: கோப்புகளை நீக்கவும் மற்றும் நீக்கவும்

source: Keywheel
ta: கீவீல்

# DlgKeywheel#2
source: &Close
ta: மூடு (&c)

# DlgMissing#1
source: Missing Tracks
ta: தடங்கள் காணவில்லை

# DlgMissing#2
source: Selects all tracks in the table below.
ta: கீழே உள்ள அட்டவணையில் உள்ள அனைத்து தடங்களையும் தேர்ந்தெடுக்கிறது.

# DlgMissing#3
source: Select All
ta: அனைத்தையும் தெரிவுசெய்

# DlgMissing#4
source: Purge selected tracks from the library.
ta: நூலகத்திலிருந்து தேர்ந்தெடுக்கப்பட்ட தடங்களை அகற்றவும்.

# DlgMissing#5
source: Purge
ta: சுத்தப்படுத்து

source: Duration after which a track is eligible for selection by Auto DJ again
ta: ஆட்டோ டிசே மூலம் மீண்டும் ஒரு ட்ராக் தேர்வு செய்யத் தகுதிபெறும் காலம்

source: Minimum available tracks in Track Source
ta: ட்ராக் மூலத்தில் கிடைக்கக்கூடிய குறைந்தபட்ச டிராக்குகள்

source: Auto DJ Preferences
ta: ஆட்டோ DJ விருப்பத்தேர்வுகள்

source: Re-queue Tracks
ta: மீண்டும் வரிசை தடங்கள்

source: This percentage of tracks are always available for selecting, regardless of when they were last played.
ta: இந்த சதவீத டிராக்குகள் எப்பொழுது கடைசியாக விளையாடப்பட்டது என்பதைப் பொருட்படுத்தாமல், தேர்ந்தெடுப்பதற்கு எப்போதும் கிடைக்கும்.

source: Uncheck, to ignore all played tracks.
ta: விளையாடிய எல்லா டிராக்குகளையும் புறக்கணிக்க, தேர்வுநீக்கவும்.

source: Suspend track in Track Source from re-queue
ta: மறு வரிசையில் இருந்து ட்ராக் மூலத்தில் தடத்தை இடைநிறுத்தவும்

source: Suspension period for track selection
ta: டிராக் தேர்வுக்கான இடைநீக்க காலம்

source: Add Random Tracks
ta: ரேண்டம் டிராக்குகளைச் சேர்க்கவும்

source: Enable random track addition to queue
ta: வரிசையில் ரேண்டம் டிராக் சேர்ப்பை இயக்கவும்

source: Add random tracks from Track Source if the specified minimum tracks remain
ta: குறிப்பிட்ட குறைந்தபட்ச டிராக்குகள் இருந்தால், ட்ராக் மூலத்திலிருந்து சீரற்ற டிராக்குகளைச் சேர்க்கவும்

source: Minimum allowed tracks before addition
ta: சேர்க்கும் முன் அனுமதிக்கப்பட்ட குறைந்தபட்ச தடங்கள்

source: Minimum number of tracks after which random tracks may be added
ta: ரேண்டம் டிராக்குகள் சேர்க்கப்படும் குறைந்தபட்ச டிராக்குகளின் எண்ணிக்கை

source: Icecast 2
ta: ஐச்காச்ட் 2

source: Shoutcast 1
ta: சவுட்காச்ட் 1

source: Icecast 1
ta: ஐச்காச்ட் 1

source: MP3
ta: விற்கப்பட்டது

source: Ogg Vorbis
ta: ஓக் வோர்பிச்

source: Opus
ta: ஓபச்

source: Automatic
ta: தானியங்கி

# DlgPrefBroadcast#11
source: Mono
ta: மோனோ

# DlgPrefBroadcast#12
source: Stereo
ta: ச்டீரியோ

source: Saving settings failed
ta: அமைப்புகளைச் சேமிக்க முடியவில்லை

source: The password for '%1' contains invalid characters. Please enter it again. Note: This can for example be invisible linebreaks when using copy/paste.
ta: '% 1'க்கான கடவுச்சொல் தவறான எழுத்துகளைக் கொண்டுள்ளது. தயவுசெய்து அதை மீண்டும் உள்ளிடவும். குறிப்பு: எடுத்துக்காட்டாக, நகல்/பேச்ட் பயன்படுத்தும் போது இது கண்ணுக்குத் தெரியாத லைன்பிரேக்களாக இருக்கலாம்.

# DlgPrefBroadcast#15
source: Action failed
ta: செயல் தோல்வியடைந்தது

source: You can't create more than %1 source connections.
ta: நீங்கள் %1க்கு மேல் மூல இணைப்புகளை உருவாக்க முடியாது.

source: Source connection %1
ta: மூல இணைப்பு% 1

# DlgPrefBroadcast#18
source: Settings for %1
ta: % 1க்கான அமைப்புகள்

source: At least one source connection is required.
ta: குறைந்தபட்சம் ஒரு மூல இணைப்பு தேவை.

source: Are you sure you want to disconnect every active source connection?
ta: செயலில் உள்ள ஒவ்வொரு மூல இணைப்பையும் நிச்சயமாக துண்டிக்க விரும்புகிறீர்களா?

source: Confirmation required
ta: உறுதிப்படுத்தல் தேவை

source: '%1' has the same Icecast mountpoint as '%2'. Two source connections to the same server that have the same mountpoint can not be enabled simultaneously.
ta: '%2' ஐப் போலவே '%1' ஐச்காச்ட் மவுண்ட்பாயிண்ட்டையும் கொண்டுள்ளது. ஒரே மவுண்ட்பாயிண்ட் கொண்ட ஒரே சர்வரில் இரண்டு மூல இணைப்புகளை ஒரே நேரத்தில் இயக்க முடியாது.

source: Are you sure you want to delete '%1'?
ta: '% 1' ஐ நிச்சயமாக நீக்க வேண்டுமா?

source: Renaming '%1'
ta: '% 1' மறுபெயரிடுகிறது

source: New name for '%1':
ta: '% 1'க்கான புதிய பெயர்:

source: Can't rename '%1' to '%2': name already in use
ta: '%1' ஐ '%2' ஆக மறுபெயரிட முடியாது: பெயர் ஏற்கனவே பயன்பாட்டில் உள்ளது

source: Live Broadcasting Preferences
ta: நேரடி ஒளிபரப்பு விருப்பத்தேர்வுகள்

source: Mixxx Icecast Testing
ta: Mixxx ஐச்காச்ட் சோதனை

source: Public stream
ta: பொது ச்ட்ரீம்

source: Stream name
ta: ச்ட்ரீம் பெயர்

source: Due to flaws in some streaming clients, updating Ogg Vorbis metadata dynamically can cause listener glitches and disconnections. Check this box to update the metadata anyway.
ta: சில ச்ட்ரீமிங் கிளையண்டுகளில் உள்ள குறைபாடுகள் காரணமாக, Ogg Vorbis மெட்டாடேட்டாவை மாறும் வகையில் புதுப்பிப்பது கேட்பவர் குறைபாடுகள் மற்றும் துண்டிப்புகளை ஏற்படுத்தலாம். எப்படியும் மெட்டாடேட்டாவைப் புதுப்பிக்க இந்தப் பெட்டியைத் தேர்வு செய்யவும்.

source: Live Broadcasting source connections
ta: நேரடி ஒளிபரப்பு மூல இணைப்புகள்

source: Delete selected
ta: தேர்ந்தெடுக்கப்பட்டதை நீக்கு

source: Create new connection
ta: புதிய இணைப்பை உருவாக்கவும்

source: Rename selected
ta: மறுபெயரிடு தேர்ந்தெடுக்கப்பட்டது

source: Disconnect all
ta: அனைத்தையும் துண்டிக்கவும்

source: Turn on Live Broadcasting when applying these settings
ta: இந்த அமைப்புகளைப் பயன்படுத்தும்போது நேரடி ஒளிபரப்பை இயக்கவும்

# DlgPrefBroadcastDlg#13
source: Settings for %1
ta: % 1க்கான அமைப்புகள்

source: Dynamically update Ogg Vorbis metadata.
ta: Ogg Vorbis மெட்டாடேட்டாவை மாறும் வகையில் புதுப்பிக்கவும்.

source: Website
ta: இணையதளம்

source: Live mix
ta: நேரடி கலவை

source: IRC
ta: ஐஆர்சி

source: Select a source connection above to edit its settings here
ta: அதன் அமைப்புகளை இங்கே திருத்த, மேலே உள்ள மூல இணைப்பைத் தேர்ந்தெடுக்கவும்

source: Password storage
ta: கடவுச்சொல் சேமிப்பு

source: Plain text
ta: சாதாரண எழுத்து

source: Secure storage (OS keychain)
ta: பாதுகாப்பான சேமிப்பு (OS கீசெயின்)

# DlgPrefBroadcastDlg#24
source: Genre
ta: வகை

source: Use UTF-8 encoding for metadata.
ta: மெட்டாடேட்டாவிற்கு UTF-8 குறியாக்கத்தைப் பயன்படுத்தவும்.

# DlgPrefBroadcastDlg#26
source: Description
ta: விவரம்

source: Encoding
ta: குறியாக்கம்

# DlgPrefBroadcastDlg#28
source: Bitrate
ta: பிட்ரேட்

source: Format
ta: வடிவம்

# DlgPrefBroadcastDlg#30
source: Channels
ta: சேனல்கள்

source: Server connection
ta: சேவையக இணைப்பு

# DlgPrefBroadcastDlg#32
source: Type
ta: வகை

source: Host
ta: விருந்தோம்பி

source: Login
ta: புகுபதிவு

source: Mount
ta: மவுண்ட்

source: Port
ta: துறைமுகம்

source: Password
ta: கடவுச்சொல்

source: Stream info
ta: ச்ட்ரீம் செய்தி

# DlgPrefBroadcastDlg#39
source: Metadata
ta: மேனிலை தரவு

source: Use static artist and title.
ta: நிலையான கலைஞர் மற்றும் தலைப்பைப் பயன்படுத்தவும்.

source: Static title
ta: நிலையான தலைப்பு

source: Static artist
ta: நிலையான கலைஞர்

source: Automatic reconnect
ta: தானாக மீண்டும் இணைக்கவும்

source: Time to wait before the first reconnection attempt is made.
ta: முதல் மறுஇணைப்பு முயற்சிக்கு முன் காத்திருக்க வேண்டிய நேரம்.

# DlgPrefBroadcastDlg#45
source: seconds
ta: வினாடிகள்

source: Wait until first attempt
ta: முதல் முயற்சி வரை காத்திருங்கள்

source: Reconnect period
ta: மீண்டும் இணைக்கும் காலம்

source: Time to wait between two reconnection attempts.
ta: இரண்டு மறு இணைப்பு முயற்சிகளுக்கு இடையில் காத்திருக்க வேண்டிய நேரம்.

source: Limit number of reconnection attempts
ta: மீண்டும் இணைக்கும் முயற்சிகளின் எண்ணிக்கையை வரம்பிடவும்

source: Maximum retries
ta: அதிகபட்ச முயற்சிகள்

source: Reconnect if the connection to the streaming server is lost.
ta: ச்ட்ரீமிங் சேவையகத்திற்கான இணைப்பு தொலைந்துவிட்டால் மீண்டும் இணைக்கவும்.

source: Enable automatic reconnect
ta: தானாக மீண்டும் இணைப்பதை இயக்கு

source: By hotcue number
ta: ஆட்கியூ எண் மூலம்

# DlgPrefColors#2
source: Color
ta: நிறம்

source: Color Preferences
ta: வண்ண விருப்பத்தேர்வுகள்

source: Edit…
ta: திருத்து…

source: Track palette
ta: தட தட்டு

source: Loop default color
ta: லூப் இயல்புநிலை நிறம்

source: Hotcue palette
ta: ஆட்கியூ தட்டு

source: Hotcue default color
ta: Hotcue இயல்புநிலை நிறம்

source: Replace…
ta: மாற்று…

source: Apply device settings?
ta: சாதன அமைப்புகளைப் பயன்படுத்தவா?

source: Your settings must be applied before starting the learning wizard. Apply settings and continue?
ta: கற்றல் வழிகாட்டியைத் தொடங்குவதற்கு முன் உங்கள் அமைப்புகளைப் பயன்படுத்த வேண்டும். அமைப்புகளைப் பயன்படுத்தி தொடரவா?

# DlgPrefController#3
source: None
ta: எதுவுமில்லை

source: %1 by %2
ta: % 1 ஆல்% 2

source: No Name
ta: பெயர் இல்லை

source: No Description
ta: விளக்கம் இல்லை

source: No Author
ta: ஆசிரியர் இல்லை

source: Mapping has been edited
ta: மேப்பிங் திருத்தப்பட்டது

source: Always overwrite during this session
ta: இந்த அமர்வின் போது எப்போதும் மேலெழுதவும்

source: Save As
ta: என சேமி

source: Overwrite
ta: மேலெழுதவும்

source: Save user mapping
ta: பயனர் மேப்பிங்கைச் சேமிக்கவும்

source: Enter the name for saving the mapping to the user folder.
ta: பயனர் கோப்புறையில் மேப்பிங்கைச் சேமிப்பதற்கான பெயரை உள்ளிடவும்.

source: Saving mapping failed
ta: மேப்பிங்கைச் சேமிப்பதில் தோல்வி

source: A mapping cannot have a blank name and may not contain special characters.
ta: மேப்பிங்கில் வெற்றுப் பெயர் இருக்கக்கூடாது மற்றும் சிறப்பு எழுத்துகள் இருக்கக்கூடாது.

source: A mapping file with that name already exists.
ta: அந்தப் பெயரைக் கொண்ட மேப்பிங் கோப்பு ஏற்கனவே உள்ளது.

source: missing
ta: காணவில்லை

source: built-in
ta: உள்ளமைக்கப்பட்ட

source: Do you want to save the changes?
ta: மாற்றங்களைச் சேமிக்க விரும்புகிறீர்களா?

source: Troubleshooting
ta: சரிசெய்தல்

source: <font color='#BB0000'><b>If you use this mapping your controller may not work correctly. Please select another mapping or disable the controller.</b></font><br><br>This mapping was designed for a newer Mixxx Controller Engine and cannot be used on your current Mixxx installation.<br>Your Mixxx installation has Controller Engine version %1. This mapping requires a Controller Engine version >= %2.<br><br>For more information visit the wiki page on <a href='https://mixxx.org/wiki/doku.php/controller_engine_versions'>Controller Engine Versions</a>.
ta: <font color='#BB0000'><b>இந்த மேப்பிங்கை நீங்கள் பயன்படுத்தினால், உங்கள் கன்ட்ரோலர் சரியாக வேலை செய்யாமல் போகலாம். தயவு செய்து வேறொரு மேப்பிங்கைத் தேர்ந்தெடுக்கவும் அல்லது கட்டுப்படுத்தியை முடக்கவும்.</b></font><br><br>இந்த மேப்பிங் புதிய Mixxx கன்ட்ரோலர் எஞ்சினுக்காக வடிவமைக்கப்பட்டுள்ளது மற்றும் உங்கள் தற்போதைய Mixxx நிறுவலில் பயன்படுத்த முடியாது.<br>உங்கள் Mixxx நிறுவலில் கன்ட்ரோலர் எஞ்சின் பதிப்பு %1 உள்ளது. இந்த மேப்பிங்கிற்கு கன்ட்ரோலர் எஞ்சின் பதிப்பு >= %2 தேவைப்படுகிறது.<br><br>மேலும் தகவலுக்கு <a href='https://mixxx.org/wiki/doku.php/controller_engine_versions'>கண்ட்ரோலர் எஞ்சின் பதிப்புகள்</a> இல் உள்ள விக்கி பக்கத்தைப் பார்வையிடவும்.

source: Mapping already exists.
ta: மேப்பிங் ஏற்கனவே உள்ளது.

source: <b>%1</b> already exists in user mapping folder.<br>Overwrite or save with a new name?
ta: பயனர் மேப்பிங் கோப்புறையில் <b>%1</b> ஏற்கனவே உள்ளது.<br>மேலெழுத அல்லது புதிய பெயரில் சேமிக்கவா?

source: Clear Input Mappings
ta: உள்ளீட்டு வரைபடங்களை அழிக்கவும்

source: Are you sure you want to clear all input mappings?
ta: அனைத்து உள்ளீட்டு மேப்பிங்குகளையும் நிச்சயமாக அழிக்க விரும்புகிறீர்களா?

source: Clear Output Mappings
ta: வெளியீட்டு வரைபடங்களை அழிக்கவும்

source: Are you sure you want to clear all output mappings?
ta: எல்லா வெளியீட்டு மேப்பிங்குகளையும் நிச்சயமாக அழிக்க விரும்புகிறீர்களா?

source: (device category goes here)
ta: (சாதன வகை இங்கே செல்கிறது)

source: Controller Name
ta: கட்டுப்படுத்தி பெயர்

# DlgPrefControllerDlg#3
source: Enabled
ta: இயக்கப்பட்டது

# DlgPrefControllerDlg#4
source: Description:
ta: விளக்கம்:

source: Support:
ta: ஆதரவு:

source: Mapping settings
ta: மேப்பிங் அமைப்புகள்

source: Input Mappings
ta: உள்ளீட்டு வரைபடங்கள்

# DlgPrefControllerDlg#8
source: Search
ta: தேடல்

# DlgPrefControllerDlg#9
source: Add
ta: கூட்டு

# DlgPrefControllerDlg#10
source: Remove
ta: நீக்குக

source: Click to start the Controller Learning wizard.
ta: கன்ட்ரோலர் கற்றல் வழிகாட்டியைத் தொடங்க சொடுக்கு செய்யவும்.

# DlgPrefControllerDlg#12
source: Controller Preferences
ta: கட்டுப்படுத்தி விருப்பத்தேர்வுகள்

source: Controller Setup
ta: கட்டுப்படுத்தி அமைப்பு

source: Load Mapping:
ta: ஏற்ற மேப்பிங்:

source: Mapping Info
ta: மேப்பிங் செய்தி

# DlgPrefControllerDlg#16
source: Author:
ta: ஆசிரியர்:

# DlgPrefControllerDlg#17
source: Name:
ta: பெயர்:

source: Learning Wizard (MIDI Only)
ta: கற்றல் வழிகாட்டி (MIDI மட்டும்)

source: Mapping Files:
ta: மேப்பிங் கோப்புகள்:

source: Clear All
ta: அனைத்தையும் அழி

source: Output Mappings
ta: வெளியீட்டு வரைபடங்கள்

source: Mixxx uses "mappings" to connect messages from your controller to controls in Mixxx. If you do not see a mapping for your controller in the "Load Mapping" menu when you click on your controller on the left sidebar, you may be able to download one online from the %1. Place the XML (.xml) and Javascript (.js) file(s) in the "User Mapping Folder" then restart Mixxx. If you download a mapping in a ZIP file, extract the XML and Javascript file(s) from the ZIP file to your "User Mapping Folder" then restart Mixxx.
ta: Mixxx உங்கள் கட்டுப்படுத்தியிலிருந்து வரும் செய்திகளை Mixxx இல் உள்ள கட்டுப்பாடுகளுடன் இணைக்க "மேப்பிங்ச்" ஐப் பயன்படுத்துகிறது. இடது பக்கப்பட்டியில் உள்ள உங்கள் கன்ட்ரோலரை சொடுக்கு செய்யும் போது "லோட் மேப்பிங்" பட்டியலில் உங்கள் கன்ட்ரோலருக்கான மேப்பிங்கை நீங்கள் காணவில்லை என்றால், நீங்கள் %1 இலிருந்து ஆன்லைனில் பதிவிறக்கம் செய்யலாம். நீகுமொ (.xml) மற்றும் சாவாகைஉரை (.js) கோப்பை (களை) "பயனர் மேப்பிங் கோப்புறையில்" வைக்கவும், பின்னர் Mixxx ஐ மறுதொடக்கம் செய்யவும். நீங்கள் ஒரு சிப் கோப்பில் மேப்பிங்கைப் பதிவிறக்கினால், சிப் கோப்பிலிருந்து எக்ச்எம்எல் மற்றும் சாவாச்கிரிப்ட் கோப்பு(களை) உங்கள் "பயனர் மேப்பிங் கோப்புறையில்" பிரித்தெடுத்து, பின்னர் Mixxxஐ மறுதொடக்கம் செய்யுங்கள்.

# DlgPrefControllers#2
source: Mixxx DJ Hardware Guide
ta: Mixxx DJ வன்பொருள் வழிகாட்டி

source: MIDI Mapping File Format
ta: MIDI மேப்பிங் கோப்பு வடிவம்

source: MIDI Scripting with Javascript
ta: சாவாகைஉரை உடன் MIDI ச்கிரிப்டிங்

# DlgPrefControllersDlg#1
source: Controller Preferences
ta: கட்டுப்படுத்தி விருப்பத்தேர்வுகள்

# DlgPrefControllersDlg#2
source: Controllers
ta: கட்டுப்படுத்திகள்

source: Mixxx did not detect any controllers. If you connected the controller while Mixxx was running you must restart Mixxx first.
ta: Mixxx எந்த கன்ட்ரோலர்களையும் கண்டறியவில்லை. Mixxx இயங்கும் போது நீங்கள் கட்டுப்படுத்தியை இணைத்திருந்தால், முதலில் Mixxx ஐ மறுதொடக்கம் செய்ய வேண்டும்.

source: Mappings
ta: வரைபடங்கள்

source: Open User Mapping Folder
ta: பயனர் மேப்பிங் கோப்புறையைத் திறக்கவும்

source: Resources
ta: வளங்கள்

source: Controllers are physical devices that send MIDI or HID signals to your computer over a USB connection. These allow you to control Mixxx in a more hands-on way than a keyboard and mouse. Attached controllers that Mixxx recognizes are shown in the "Controllers" section in the sidebar.
ta: கன்ட்ரோலர்கள் என்பது USB இணைப்பு மூலம் உங்கள் கணினிக்கு MIDI அல்லது HID சிக்னல்களை அனுப்பும் இயற்பியல் சாதனங்கள். விசைப்பலகை மற்றும் மவுசைக் காட்டிலும், Mixxx-ஐக் கட்டுப்படுத்த இவை உங்களை அனுமதிக்கின்றன. Mixxx அங்கீகரிக்கும் இணைக்கப்பட்ட கட்டுப்படுத்திகள் பக்கப்பட்டியில் உள்ள "கட்டுப்படுத்திகள்" பிரிவில் காட்டப்பட்டுள்ளன.

source: You can create your own mapping by using the MIDI Learning Wizard when you select your controller in the sidebar. You can edit mappings by selecting the "Input Mappings" and "Output Mappings" tabs in the preference page for your controller. See the Resources below for more details on making mappings.
ta: பக்கப்பட்டியில் உங்கள் கட்டுப்படுத்தியைத் தேர்ந்தெடுக்கும்போது MIDI கற்றல் வழிகாட்டியைப் பயன்படுத்தி உங்கள் சொந்த மேப்பிங்கை உருவாக்கலாம். உங்கள் கட்டுப்படுத்திக்கான முன்னுரிமைப் பக்கத்தில் உள்ள "உள்ளீட்டு மேப்பிங்ச்" மற்றும் "அவுட்புட் மேப்பிங்ச்" தாவல்களைத் தேர்ந்தெடுப்பதன் மூலம் மேப்பிங்கைத் திருத்தலாம். வரைபடங்களை உருவாக்குவது பற்றிய கூடுதல் விவரங்களுக்கு கீழே உள்ள ஆதாரங்களைப் பார்க்கவும்.

# DlgPrefControlsDlg#1
source: Skin
ta: தோல்

source: Tool tips
ta: கருவி குறிப்புகள்

source: Select from different color schemes of a skin if available.
ta: ஒரு தோலின் வெவ்வேறு வண்ணத் திட்டங்கள் இருந்தால் தேர்ந்தெடுக்கவும்.

source: Color scheme
ta: வண்ணத் திட்டம்

source: Locales determine country and language specific settings.
ta: நாடு மற்றும் மொழி குறிப்பிட்ட அமைப்புகளை உள்ளூர்கள் தீர்மானிக்கின்றன.

source: Locale
ta: மொழி

source: Interface Preferences
ta: இடைமுக விருப்பத்தேர்வுகள்

source: Skin selector
ta: தோல் தேர்வாளர்

source: Miscellaneous
ta: மற்றவை

source: HiDPI / Retina scaling
ta: HiDPI / விழித்திரை அளவிடுதல்

source: Change the size of text, buttons, and other items.
ta: உரை, பொத்தான்கள் மற்றும் பிற உருப்படிகளின் அளவை மாற்றவும்.

source: Menu bar
ta: பார் பட்டியல்

source: Auto-hide the menu bar, toggle it with a single Alt key press
ta: பட்டியல் பட்டியை தானாக மறைத்து, ஒற்றை மாற்று விசையை அழுத்துவதன் மூலம் அதை மாற்றவும்

source: Screen saver
ta: திரை சேமிப்பான்

source: Multi-Sampling
ta: பல மாதிரி

source: Start in full-screen mode
ta: முழுத்திரை பயன்முறையில் தொடங்கவும்

source: Full-screen mode
ta: முழுத்திரை முறை

# DlgPrefControlsDlg#18
source: Off
ta: அணை

source: Library only
ta: நூலகம் மட்டுமே

source: Library and Skin
ta: நூலகம் மற்றும் தோல்

source: Mixxx mode
ta: Mixxx பயன்முறை

source: Mixxx mode (no blinking)
ta: Mixxx பயன்முறை (இமைக்காமல்)

source: Pioneer mode
ta: முன்னோடி ஃபேசன்

source: Denon mode
ta: டெனான் பயன்முறை

source: Numark mode
ta: நுமார்க் பயன்முறை

source: CUP mode
ta: கப் பயன்முறை

source: mm:ss%1zz - Traditional
ta: mm:ss%1zz - பாரம்பரியமானது

source: mm:ss - Traditional (Coarse)
ta: mm:ss - பாரம்பரியம் (கரடுமுரடான)

source: s%1zz - Seconds
ta: s% 1zz - வினாடிகள்

source: sss%1zz - Seconds (Long)
ta: sss%1zz - வினாடிகள் (நீண்ட)

source: s%1sss%2zz - Kiloseconds
ta: s% 1sss%2zz - கிலோ விநாடிகள்

# DlgPrefDeck#12
source: Intro start
ta: அறிமுக துவக்கம்

source: Main cue
ta: முக்கிய குறிப்பு

source: First hotcue
ta: முதல் ஆட்கியூ

source: First sound (skip silence)
ta: முதல் ஒலி (மௌனத்தை தவிர்க்கவும்)

source: Beginning of track
ta: பாதையின் துவக்கம்

source: Reject
ta: நிராகரிக்கவும்

source: Allow, but stop deck
ta: அனுமதிக்கவும், ஆனால் டெக் நிறுத்தவும்

source: Allow, play from load point
ta: அனுமதிக்கவும், சுமை புள்ளியில் இருந்து விளையாடவும்

source: 6% (semitone)
ta: 6% (செமிடோன்)

source: 8% (Technics SL-1210)
ta: 8% (டெக்னிக்ச் SL-1210)

source: Deck Preferences
ta: டெக் விருப்பத்தேர்வுகள்

source: Deck options
ta: டெக் விருப்பங்கள்

source: Cue mode
ta: க்யூ ஃபேசன்

source: Mixxx mode: - Cue button while pause at cue point = preview - Cue button while pause not at cue point = set cue point - Cue button while playing = pause at cue point Mixxx mode (no blinking): - Same as Mixxx mode but with no blinking indicators Pioneer mode: - Same as Mixxx mode with a flashing play button Denon mode: - Cue button at cue point = preview - Cue button not at cue point = pause at cue point - Play = set cue point Numark mode: - Same as Denon mode, but without a flashing play button CUP mode: - Cue button while pause at cue point = play after release - Cue button while pause not at cue point = set cue point and play after release - Cue button while playing = go to cue point and play after release
ta: Mixxx பயன்முறை: - க்யூ பாயின்ட்டில் இடைநிறுத்தப்படும் போது க்யூ பொத்தான் = முன்னோட்டம் - க்யூ பாயிண்டில் இல்லாமல் இடைநிறுத்தப்படும் போது க்யூ பொத்தான் = செட் க்யூ பாயின்ட் - விளையாடும் போது க்யூ பொத்தான் = கியூ புள்ளியில் இடைநிறுத்தம் Mixxx பயன்முறை (இமைக்காமல்): - Mixxx பயன்முறையைப் போன்றது ஆனால் ஒளிரும் குறிகாட்டிகள் இல்லை முன்னோடி பயன்முறை: - மிக்ச்எக்ச் பயன்முறையைப் போலவே ஒளிரும் ப்ளே பொத்தானும் உள்ளது டெனான் பயன்முறை: - க்யூ பாயின்ட்டில் க்யூ பட்டன் = முன்னோட்டம் - க்யூ பொத்தான் க்யூ பாயிண்டில் இல்லை = கியூ பாயிண்டில் இடைநிறுத்தம் - விளையாடு = செட் க்யூ பாயிண்ட் நுமார்க் பயன்முறை: - டெனான் பயன்முறையைப் போன்றது, ஆனால் ஒளிரும் பிளே பொத்தான் இல்லாமல் கப் பயன்முறை: - க்யூ பாயின்ட்டில் இடைநிறுத்தப்படும் போது க்யூ பொத்தான் = வெளியான பிறகு விளையாடவும் - க்யூ பாயின்ட்டில் இடைநிறுத்தப்படும் போது க்யூ பொத்தான் = கியூ பாயிண்டை அமைத்து, வெளியான பிறகு விளையாடவும் - விளையாடும்போது க்யூ பொத்தான் = கியூ பாயிண்டிற்குச் சென்று வெளியீட்டிற்குப் பிறகு விளையாடவும்

source: Track time display
ta: நேரக் காட்சியைக் கண்காணிக்கவும்

source: Elapsed
ta: கழிந்தது

source: Remaining
ta: மீதமுள்ளவை

source: Elapsed and Remaining
ta: கழிந்தது மற்றும் மீதமுள்ளது

source: Time Format
ta: நேர வடிவம்

# DlgPrefDeckDlg#10
source: Intro start
ta: அறிமுக துவக்கம்

source: When the analyzer places the intro start point automatically, it will place it at the main cue point if the main cue point has been set previously. This may be helpful for upgrading to Mixxx 2.3 from earlier versions. If this option is disabled, the intro start point is automatically placed at the first sound.
ta: பகுப்பாய்வி தானாகவே அறிமுக தொடக்க புள்ளியை வைக்கும் போது, முதன்மைக் குறிப் புள்ளி முன்பு அமைக்கப்பட்டிருந்தால், அது முக்கியக் குறிப் புள்ளியில் வைக்கும். முந்தைய பதிப்புகளிலிருந்து Mixxx 2.3 க்கு மேம்படுத்த இது உதவியாக இருக்கும். இந்த விருப்பம் முடக்கப்பட்டால், அறிமுக தொடக்க புள்ளி தானாகவே முதல் ஒலியில் வைக்கப்படும்.

source: Set intro start to main cue when analyzing tracks
ta: டிராக்குகளை பகுப்பாய்வு செய்யும் போது அறிமுக தொடக்கத்தை முக்கிய குறியாக அமைக்கவும்

source: Track load point
ta: சுமை புள்ளியைக் கண்காணிக்கவும்

source: Clone deck
ta: நகலி டெக்

source: Loading a track, when deck is playing
ta: டெக் விளையாடும் போது, ​​ஒரு டிராக்கை ஏற்றுகிறது

source: Create a playing clone of the first playing deck by double-tapping a Load button on a controller or keyboard. You can always drag-and-drop tracks on screen to clone a deck.
ta: கன்ட்ரோலர் அல்லது கீபோர்டில் உள்ள லோட் பட்டனை இருமுறை தட்டுவதன் மூலம் முதல் ப்ளேயிங் டெக்கின் விளையாடும் நகலியை உருவாக்கவும். டெக்கை நகலி செய்ய நீங்கள் எப்போதும் டிராக்குகளை திரையில் இழுத்து விடலாம்.

source: Double-press Load button to clone playing track
ta: பிளேயிங் டிராக்கை நகலி செய்ய, சுமை பொத்தானை இருமுறை அழுத்தவும்

source: Speed (Tempo) and Key (Pitch) options
ta: விரைவு (டெம்போ) மற்றும் கீ (பிட்ச்) விருப்பங்கள்

source: Permanent rate change when left-clicking
ta: இடது சொடுக்கு செய்யும் போது நிரந்தர விகிதம் மாற்றம்

source: Permanent rate change when right-clicking
ta: வலது சொடுக்கு செய்யும் போது நிரந்தர விகிதம் மாற்றம்

source: Reset on track load
ta: ட்ராக் லோடில் மீட்டமைக்கவும்

source: Current key
ta: தற்போதைய விசை

source: Temporary rate change when right-clicking
ta: வலது சொடுக்கு செய்யும் போது தற்காலிக விகிதம் மாற்றம்

source: Permanent
ta: நிரந்தரமானது

source: Temporary
ta: தற்காலிகமானது

source: Sync mode (Dynamic tempo tracks)
ta: ஒத்திசைவு முறை (டைனமிக் டெம்போ டிராக்குகள்)

source: Keylock mode
ta: கீலாக் பயன்முறை

source: Ramping sensitivity
ta: ரேம்பிங் உணர்திறன்

source: Pitch bend behavior
ta: சுருதி வளைவு நடத்தை

source: Original key
ta: அசல் விசை
