Repository: 247i/TACETr
Catalog: உரை/தானி/mixxxdj_mixxx2-5_*.po
Languages: ta

source: Show/hide Cover Art of the selected track in the library.
ta: நூலகத்தில் தேர்ந்தெடுக்கப்பட்ட டிராக்கின் அட்டைப்படத்தைக் காட்டு/மறை.

source: Show/hide the scrolling waveforms
ta: ச்க்ரோலிங் அலைவடிவங்களைக் காட்டு/மறை

source: Show/hide the beatgrid controls section
ta: பீட்கிரிட் கட்டுப்பாடுகள் பகுதியைக் காட்டு/மறை

source: Hide all skin sections except the decks to have more screen space for the track library.
ta: ட்ராக் லைப்ரரிக்கு அதிக திரை இடத்தைப் பெற, அடுக்குகளைத் தவிர அனைத்து தோல் பிரிவுகளையும் மறைக்கவும்.

source: Volume Meters
ta: வால்யூம் மீட்டர்கள்

source: mix microphone input into the main output.
ta: மைக்ரோஃபோன் உள்ளீட்டை முதன்மையான வெளியீட்டில் கலக்கவும்.

source: Auto: Automatically reduce music volume when microphone volume rises above threshold.
ta: தானியங்கு: மைக்ரோஃபோன் ஒலி அளவு வாசலுக்கு மேல் உயரும் போது தானாகவே இசையின் அளவைக் குறைக்கவும்.

source: Adjust the amount the music volume is reduced with the Strength knob.
ta: வலிமை குமிழ் மூலம் இசையின் அளவு குறைக்கப்பட்ட அளவை சரிசெய்யவும்.

source: Auto: Sets how much to reduce the music volume when the volume of active microphones rises above threshold.
ta: தானியங்கு: செயலில் உள்ள மைக்ரோஃபோன்களின் ஒலி அளவு வரம்புக்கு மேல் உயரும்போது இசையின் ஒலியளவை எவ்வளவு குறைக்க வேண்டும் என்பதை அமைக்கிறது.

source: Manual: Sets how much to reduce the music volume, when talkover is activated regardless of volume of microphone inputs.
ta: கையேடு: ஒலிவாங்கி உள்ளீடுகளின் அளவைப் பொருட்படுத்தாமல் பேச்சு இயக்கப்படும் போது, ​​இசையின் ஒலியளவை எவ்வளவு குறைக்க வேண்டும் என்பதை அமைக்கிறது.

source: If keylock is disabled, pitch is also affected.
ta: கீலாக் முடக்கப்பட்டிருந்தால், சுருதியும் பாதிக்கப்படும்.

source: Speed Up
ta: வேகப்படுத்து

source: Raises the track playback speed (tempo).
ta: டிராக் பிளேபேக் வேகத்தை (டெம்போ) உயர்த்துகிறது.

source: Raises playback speed in small steps.
ta: சிறிய படிகளில் பின்னணி வேகத்தை அதிகரிக்கிறது.

source: Slow Down
ta: மெதுவாக

source: Lowers the track playback speed (tempo).
ta: டிராக் பிளேபேக் வேகத்தைக் குறைக்கிறது (டெம்போ).

source: Lowers playback speed in small steps.
ta: சிறிய படிகளில் பிளேபேக் வேகத்தைக் குறைக்கிறது.

source: Speed Up Temporarily (Nudge)
ta: தற்காலிகமாக வேகப்படுத்து (நட்ச்)

source: Holds playback speed higher while active (tempo).
ta: செயலில் இருக்கும்போது (டெம்போ) பின்னணி வேகத்தை அதிகமாக வைத்திருக்கிறது.

source: Holds playback speed higher (small amount) while active.
ta: செயலில் இருக்கும்போது பிளேபேக் வேகத்தை அதிகமாக (சிறிய அளவு) வைத்திருக்கும்.

source: Slow Down Temporarily (Nudge)
ta: தற்காலிகமாக மெதுவாக (நட்ச்)

source: Holds playback speed lower while active (tempo).
ta: செயலில் இருக்கும் போது (டெம்போ) பின்னணி வேகத்தை குறைவாக வைத்திருக்கிறது.

source: Holds playback speed lower (small amount) while active.
ta: செயலில் இருக்கும்போது பிளேபேக் வேகத்தை குறைவாக (சிறிய அளவு) வைத்திருக்கும்.

source: When tapped repeatedly, adjusts the tempo to match the tapped BPM.
ta: மறுநிகழ்வு தட்டும்போது, ​​தட்டப்பட்ட பிபிஎம்முடன் பொருத்த டெம்போவை சரிசெய்கிறது.

# Tooltips#184
source: Tempo Tap
ta: டெம்போ இழப்பு

source: Rate Tap and BPM Tap
ta: தட்டவும் பிபிஎம் தட்டவும் மதிப்பிடவும்

# Tooltips#186
source: Revert last BPM/Beatgrid Change
ta: கடைசி BPM/Beatgrid மாற்றத்தை மாற்றியமைக்கவும்

# Tooltips#187
source: Revert last BPM/Beatgrid Change of the loaded track.
ta: ஏற்றப்பட்ட பாதையின் கடைசி BPM/Beatgrid மாற்றத்தை மாற்றியமைக்கவும்.

# Tooltips#188
source: Toggle the BPM/beatgrid lock
ta: BPM/beatgrid பூட்டை நிலைமாற்று

source: Tempo and Rate Tap
ta: டெம்போ மற்றும் ரேட் தட்டவும்

source: Tempo, Rate Tap and BPM Tap
ta: டெம்போ, ரேட் டேப் மற்றும் பிபிஎம் டேப்

source: Shift cues earlier
ta: குறிப்புகளை முன்னதாகவே மாற்றவும்

source: Shift cues imported from Serato or Rekordbox if they are slightly off time.
ta: Serato அல்லது Rekordbox இலிருந்து இறக்குமதி செய்யப்பட்ட குறிப்புகள் சிறிது நேரம் குறைவாக இருந்தால் அவற்றை மாற்றவும்.

source: Left click: shift 10 milliseconds earlier
ta: இடது கிளிக்: 10 மில்லி விநாடிகளுக்கு முன்பு மாற்றவும்

source: Right click: shift 1 millisecond earlier
ta: வலது கிளிக்: 1 மில்லி நொடிக்கு முன்னதாக மாற்றவும்

source: Shift cues later
ta: குறிப்புகளை பின்னர் மாற்றவும்

source: Left click: shift 10 milliseconds later
ta: இடது கிளிக்: 10 மில்லி விநாடிகள் கழித்து மாற்றவும்

source: Right click: shift 1 millisecond later
ta: வலது கிளிக்: 1 மில்லி விநாடிக்குப் பிறகு மாற்றவும்

source: Mutes the selected channel's audio in the main output.
ta: முதன்மையான வெளியீட்டில் தேர்ந்தெடுக்கப்பட்ட சேனலின் ஆடியோவை முடக்குகிறது.

source: Main mix enable
ta: முக்கிய கலவையை இயக்கவும்

source: Hold or short click for latching to mix this input into the main output.
ta: முக்கிய வெளியீட்டில் இந்த உள்ளீட்டைக் கலக்க, லாட்ச்சிங் செய்ய அழுத்திப் பிடிக்கவும் அல்லது குறுகிய சொடுக்கு செய்யவும்.

source: Reloads the last replaced track. If no track is loaded reloads the second-last ejected track.
ta: கடைசியாக மாற்றப்பட்ட டிராக்கை மீண்டும் ஏற்றுகிறது. எந்த டிராக்கும் ஏற்றப்படவில்லை என்றால், இரண்டாவது கடைசியாக வெளியேற்றப்பட்ட டிராக்கை மீண்டும் ஏற்றுகிறது.

source: If hotcue is a loop cue, toggles the loop and jumps to if the loop is behind the play position.
ta: ஆட்க்யூ என்பது லூப் குறியாக இருந்தால், லூப்பை மாற்றி, லூப் பிளே பொசிசனுக்குப் பின்னால் இருந்தால் தாவிச் செல்லும்.

source: If the play position is inside an active loop, stores the loop as loop cue.
ta: விளையாட்டு நிலை செயலில் உள்ள வளையத்திற்குள் இருந்தால், லூப்பை லூப் க்யூவாக சேமிக்கும்.

source: Expand/Collapse Samplers
ta: சாம்ப்லர்களை விரிவாக்கு/சுருக்கவும்

source: Toggle expanded samplers view.
ta: விரிவாக்கப்பட்ட மாதிரிகள் காட்சியை நிலைமாற்று.

source: Displays the duration of the running recording.
ta: இயங்கும் பதிவின் கால அளவைக் காட்டுகிறது.

source: Auto DJ is active
ta: ஆட்டோ டிசே செயலில் உள்ளது

source: Red for when needle skip has been detected.
ta: ஊசி ச்கிப் கண்டறியப்பட்டபோது சிவப்பு.

source: Hot Cue - Track will seek to nearest previous hotcue point.
ta: ஆட் கியூ - ட்ராக் அருகிலுள்ள முந்தைய ஆட்கியூ பாயிண்ட்டைத் தேடும்.

source: Sets the track Loop-In Marker to the current play position.
ta: டிராக் லூப்-இன் மார்க்கரை தற்போதைய பிளே நிலைக்கு அமைக்கிறது.

source: Press and hold to move Loop-In Marker.
ta: லூப்-இன் மார்க்கரை நகர்த்த அழுத்திப் பிடிக்கவும்.

source: Jump to Loop-In Marker.
ta: லூப்-இன் மார்க்கருக்குச் செல்லவும்.

source: Sets the track Loop-Out Marker to the current play position.
ta: டிராக் லூப்-அவுட் மார்க்கரை தற்போதைய பிளே நிலைக்கு அமைக்கிறது.

source: Press and hold to move Loop-Out Marker.
ta: லூப்-அவுட் மார்க்கரை நகர்த்த அழுத்திப் பிடிக்கவும்.

source: Jump to Loop-Out Marker.
ta: லூப்-அவுட் மார்க்கருக்குச் செல்லவும்.

source: If the track has no beats the unit is seconds.
ta: பாதையில் துடிப்புகள் இல்லை என்றால் அலகு வினாடிகள் ஆகும்.

source: Beatloop Size
ta: பீட்லூப் அளவு

source: Select the size of the loop in beats to set with the Beatloop button.
ta: பீட்லூப் பொத்தானைக் கொண்டு அமைக்க, பீட்சில் லூப்பின் அளவைத் தேர்ந்தெடுக்கவும்.

source: Changing this resizes the loop if the loop already matches this size.
ta: லூப் ஏற்கனவே இந்த அளவோடு பொருந்தினால், இதை மாற்றுவது லூப்பின் அளவை மாற்றும்.

source: Halve the size of an existing beatloop, or halve the size of the next beatloop set with the Beatloop button.
ta: ஏற்கனவே உள்ள பீட்லூப்பின் அளவை பாதியாகக் குறைக்கவும் அல்லது பீட்லூப் பட்டனைக் கொண்டு அடுத்த பீட்லூப்பின் அளவை பாதியாகக் குறைக்கவும்.

source: Double the size of an existing beatloop, or double the size of the next beatloop set with the Beatloop button.
ta: ஏற்கனவே உள்ள பீட்லூப்பின் அளவை இரட்டிப்பாக்கவும் அல்லது பீட்லூப் பட்டனைக் கொண்டு அடுத்த பீட்லூப்பின் அளவை இரட்டிப்பாக்கவும்.

source: Start a loop over the set number of beats.
ta: பீட்களின் தொகுப்பு எண்ணிக்கையில் ஒரு சுழற்சியைத் தொடங்கவும்.

source: Temporarily enable a rolling loop over the set number of beats.
ta: பீட்களின் செட் எண்ணிக்கையில் ரோலிங் லூப்பை தற்காலிகமாக இயக்கவும்.

source: Beatloop Anchor
ta: பீட்லூப் ஆங்கர்

source: Define whether the loop is created and adjusted from its staring point or ending point.
ta: லூப் உருவாக்கப்பட்டு அதன் தொடக்கப் புள்ளி அல்லது முடிவுப் புள்ளியில் இருந்து சரிசெய்யப்பட்டதா என்பதை வரையறுக்கவும்.

source: Beatjump/Loop Move Size
ta: பீட்சம்ப்/லூப் மூவ் அளவு

source: Select the number of beats to jump or move the loop with the Beatjump Forward/Backward buttons.
ta: Beatjump Forward/Backward பொத்தான்கள் மூலம் லூப்பை நகர்த்த அல்லது குதிப்பதற்கான துடிப்புகளின் எண்ணிக்கையைத் தேர்ந்தெடுக்கவும்.

source: Beatjump Forward
ta: பீட்சம்ப் ஃபார்வர்டு

source: Jump forward by the set number of beats.
ta: துடிக்கும் எண்ணிக்கையால் முன்னோக்கி செல்லவும்.

source: Move the loop forward by the set number of beats.
ta: பீட்களின் தொகுப்பு எண்ணிக்கையால் வளையத்தை முன்னோக்கி நகர்த்தவும்.

source: Jump forward by 1 beat.
ta: 1 பீட் மூலம் முன்னோக்கி செல்லவும்.

source: Move the loop forward by 1 beat.
ta: 1 பீட் மூலம் வளையத்தை முன்னோக்கி நகர்த்தவும்.

source: Beatjump Backward
ta: பீட்சம்ப் பின்னோக்கி

source: Jump backward by the set number of beats.
ta: அடிகளின் தொகுப்பு எண்ணிக்கையால் பின்னோக்கி செல்லவும்.

source: Move the loop backward by the set number of beats.
ta: அடிகளின் தொகுப்பு எண்ணிக்கையால் வளையத்தை பின்னோக்கி நகர்த்தவும்.

source: Jump backward by 1 beat.
ta: 1 அடியால் பின்னோக்கிச் செல்லவும்.

source: Move the loop backward by 1 beat.
ta: 1 பீட் மூலம் வளையத்தை பின்னோக்கி நகர்த்தவும்.

source: Reloop
ta: ரீலூப்

source: If the loop is ahead of the current position, looping will start when the loop is reached.
ta: லூப் தற்போதைய நிலைக்கு முன்னால் இருந்தால், லூப்பை அடைந்ததும் லூப்பிங் தொடங்கும்.

source: Works only if Loop-In and Loop-Out Marker are set.
ta: லூப்-இன் மற்றும் லூப்-அவுட் மார்க்கர் அமைக்கப்பட்டால் மட்டுமே வேலை செய்யும்.

source: Enable loop, jump to Loop-In Marker, and stop playback.
ta: லூப்பை இயக்கவும், லூப்-இன் மார்க்கருக்குச் சென்று, பிளேபேக்கை நிறுத்தவும்.

source: Displays the elapsed and/or remaining time of the track loaded.
ta: ஏற்றப்பட்ட பாதையின் கடந்த மற்றும்/அல்லது மீதமுள்ள நேரத்தைக் காட்டுகிறது.

source: Click to toggle between time elapsed/remaining time/both.
ta: கழிந்த நேரம்/மீதமுள்ள நேரம்/இரண்டிற்கும் இடையே மாற சொடுக்கு செய்யவும்.

source: Hint: Change the time format in Preferences -> Decks.
ta: குறிப்பு: விருப்பங்கள் -> அடுக்குகளில் நேர வடிவமைப்பை மாற்றவும்.

source: Show/hide intro & outro markers and associated buttons.
ta: அறிமுகம் & அவுட்ரோ குறிப்பான்கள் மற்றும் தொடர்புடைய பொத்தான்களைக் காட்டு/மறை.

# Tooltips#246
source: Intro Start Marker
ta: அறிமுக தொடக்க குறிப்பான்

source: If marker is set, jumps to the marker.
ta: மார்க்கர் அமைக்கப்பட்டால், மார்க்கருக்குத் தாவுகிறது.

source: If marker is not set, sets the marker to the current play position.
ta: மார்க்கர் அமைக்கப்படவில்லை என்றால், மார்க்கரை தற்போதைய பிளே நிலைக்கு அமைக்கும்.

source: If marker is set, clears the marker.
ta: மார்க்கர் அமைக்கப்பட்டால், மார்க்கரை அழிக்கும்.

# Tooltips#250
source: Intro End Marker
ta: அறிமுக முடிவு குறிப்பான்

# Tooltips#251
source: Outro Start Marker
ta: அவுட்ரோ ச்டார்ட் மார்க்கர்

# Tooltips#252
source: Outro End Marker
ta: மற்றொரு முடிவு குறிப்பான்

# Tooltips#253
source: Mix
ta: கலக்கவும்

source: Adjust the mixing of the dry (input) signal with the wet (output) signal of the effect unit
ta: விளைவு அலகு ஈரமான (வெளியீடு) சமிக்ஞையுடன் உலர் (உள்ளீடு) சமிக்ஞையின் கலவையை சரிசெய்யவும்

source: D/W mode: Crossfade between dry and wet
ta: D/W பயன்முறை: உலர்ந்த மற்றும் ஈரமான இடையே குறுக்குவழி

source: D+W mode: Add wet to dry
ta: D+W பயன்முறை: ஈரத்தை உலரச் சேர்க்கவும்

source: Mix Mode
ta: கலவை முறை

source: Adjust how the dry (input) signal is mixed with the wet (output) signal of the effect unit
ta: விளைவு அலகு ஈரமான (வெளியீடு) சமிக்ஞையுடன் உலர் (உள்ளீடு) சமிக்ஞை எவ்வாறு கலக்கப்படுகிறது என்பதைச் சரிசெய்யவும்

source: Dry/Wet mode (crossed lines): Mix knob crossfades between dry and wet Use this to change the sound of the track with EQ and filter effects.
ta: உலர்/ஈரமான பயன்முறை (குறைந்த கோடுகள்): உலர்ந்த மற்றும் ஈரமான இடையே குமிழ் குறுக்குவழிகளை கலக்கவும் EQ மற்றும் வடிகட்டி விளைவுகளுடன் டிராக்கின் ஒலியை மாற்ற இதைப் பயன்படுத்தவும்.

source: Dry+Wet mode (flat dry line): Mix knob adds wet to dry Use this to change only the effected (wet) signal with EQ and filter effects.
ta: உலர்+ஈரமான முறை (பிளாட் ட்ரை லைன்): மிக்ச் குமிழ் ஈரத்தை உலர வைக்கிறது EQ மற்றும் வடிகட்டி விளைவுகளுடன் கூடிய (ஈரமான) சமிக்ஞையை மட்டும் மாற்ற இதைப் பயன்படுத்தவும்.

source: Route the main mix through this effect unit.
ta: இந்த எஃபெக்ட் யூனிட் மூலம் முதன்மையான கலவையை வழிசெலுத்தவும்.

source: Route the left crossfader bus through this effect unit.
ta: இந்த எஃபெக்ட் யூனிட் வழியாக இடதுபுற கிராச்பேடர் பச்சை இயக்கவும்.

source: Route the right crossfader bus through this effect unit.
ta: இந்த எஃபெக்ட் யூனிட் வழியாக சரியான கிராச்ஃபேடர் பச்சை இயக்கவும்.

source: Right side active: parameter moves with right half of Meta Knob turn
ta: வலது பக்கம் செயலில்: அளவுரு மேவு நாப் திருப்பத்தின் வலது பாதியுடன் நகர்கிறது

source: Skin Settings Menu
ta: தோல் அமைப்புகள் பட்டியல்

source: Show/hide skin settings menu
ta: தோல் அமைப்புகள் மெனுவைக் காட்டு/மறை

# Tooltips#267
source: Save Sampler Bank
ta: மாதிரி வங்கியைச் சேமிக்கவும்

source: Save the collection of samples loaded in the samplers.
ta: மாதிரிகளில் ஏற்றப்பட்ட மாதிரிகளின் சேகரிப்பைச் சேமிக்கவும்.

# Tooltips#269
source: Load Sampler Bank
ta: ஏற்ற மாதிரி வங்கி

source: Load a previously saved collection of samples into the samplers.
ta: முன்பு சேமித்த மாதிரிகளின் தொகுப்பை மாதிரிகளில் ஏற்றவும்.

# Tooltips#271
source: Show Effect Parameters
ta: விளைவு அளவுருக்களைக் காட்டு

source: Enable Effect
ta: விளைவை இயக்கு

source: Meta Knob Link
ta: மேவு குமிழ் இணைப்பு

source: Set how this parameter is linked to the effect's Meta Knob.
ta: எஃபெக்ட்டின் மேவு நாப் உடன் இந்த அளவுரு எவ்வாறு இணைக்கப்பட்டுள்ளது என்பதை அமைக்கவும்.

source: Meta Knob Link Inversion
ta: மேவு குமிழ் இணைப்பு தலைகீழ்

source: Inverts the direction this parameter moves when turning the effect's Meta Knob.
ta: விளைவின் மேவு குமிழியைத் திருப்பும்போது இந்த அளவுரு நகரும் திசையைத் தலைகீழாக மாற்றுகிறது.

# Tooltips#277
source: Super Knob
ta: சூப்பர் நாப்

# Tooltips#278
source: Next Chain
ta: அடுத்த சங்கிலி

# Tooltips#279
source: Previous Chain
ta: முந்தைய சங்கிலி

# Tooltips#280
source: Next/Previous Chain
ta: அடுத்த/முந்தைய சங்கிலி

# Tooltips#281
source: Clear
ta: தெளிவு

source: Clear the current effect.
ta: தற்போதைய விளைவை அழிக்கவும்.

# Tooltips#283
source: Toggle
ta: நிலைமாற்று

source: Toggle the current effect.
ta: தற்போதைய விளைவை மாற்றவும்.

# Tooltips#285
source: Next
ta: அடுத்தது

# Tooltips#286
source: Clear Unit
ta: தெளிவான அலகு

source: Clear effect unit.
ta: தெளிவான விளைவு அலகு.

source: Show/hide parameters for effects in this unit.
ta: இந்த யூனிட்டில் விளைவுகளுக்கான அளவுருக்களைக் காட்டு/மறை.

# Tooltips#289
source: Toggle Unit
ta: மாற்று அலகு

source: Enable or disable this whole effect unit.
ta: இந்த முழு விளைவு அலகு இயக்கவும் அல்லது முடக்கவும்.

source: Controls the Meta Knob of all effects in this unit together.
ta: இந்த யூனிட்டில் உள்ள அனைத்து விளைவுகளின் மேவு குமிழ் ஐ ஒன்றாகக் கட்டுப்படுத்துகிறது.

source: Load next effect chain preset into this effect unit.
ta: இந்த விளைவு அலகுக்கு முன்னமைக்கப்பட்ட அடுத்த விளைவு சங்கிலியை ஏற்றவும்.

source: Load previous effect chain preset into this effect unit.
ta: இந்த விளைவு அலகுக்கு முந்தைய விளைவு சங்கிலி முன்னமைவை ஏற்றவும்.

source: Load next or previous effect chain preset into this effect unit.
ta: இந்த விளைவு அலகுக்கு முன்னமைக்கப்பட்ட அடுத்த அல்லது முந்தைய விளைவு சங்கிலியை ஏற்றவும்.

source: Assign Effect Unit
ta: விளைவு அலகு ஒதுக்கவும்

source: Assign this effect unit to the channel output.
ta: சேனல் வெளியீட்டிற்கு இந்த விளைவு அலகு ஒதுக்கவும்.

source: Route the headphone channel through this effect unit.
ta: எட்ஃபோன் சேனலை இந்த எஃபெக்ட் யூனிட் மூலம் இயக்கவும்.

source: Route this deck through the indicated effect unit.
ta: சுட்டிக்காட்டப்பட்ட விளைவு அலகு வழியாக இந்த டெக்கை வழிநடத்தவும்.

source: Route this sampler through the indicated effect unit.
ta: சுட்டிக்காட்டப்பட்ட விளைவு அலகு வழியாக இந்த மாதிரியை இயக்கவும்.

source: Route this microphone through the indicated effect unit.
ta: சுட்டிக்காட்டப்பட்ட விளைவு அலகு வழியாக இந்த மைக்ரோஃபோனை இயக்கவும்.

source: Route this auxiliary input through the indicated effect unit.
ta: இந்த துணை உள்ளீட்டை சுட்டிக்காட்டப்பட்ட விளைவு அலகு மூலம் வழிசெலுத்தவும்.

source: The effect unit must also be assigned to a deck or other sound source to hear the effect.
ta: விளைவைக் கேட்க, டெக் அல்லது பிற ஒலி மூலத்திற்கு விளைவு அலகு ஒதுக்கப்பட வேண்டும்.

source: Switch to the next effect.
ta: அடுத்த விளைவுக்கு மாறவும்.

# Tooltips#304
source: Previous
ta: முந்தைய

source: Switch to the previous effect.
ta: முந்தைய விளைவுக்கு மாறவும்.

# Tooltips#306
source: Next or Previous
ta: அடுத்தது அல்லது முந்தையது

source: Switch to either the next or previous effect.
ta: அடுத்த அல்லது முந்தைய விளைவுக்கு மாறவும்.

# Tooltips#308
source: Meta Knob
ta: மேவு குமிழ்

source: Controls linked parameters of this effect
ta: இந்த விளைவின் இணைக்கப்பட்ட அளவுருக்களைக் கட்டுப்படுத்துகிறது

source: Effect Focus Button
ta: எஃபெக்ட் கவனம் பட்டன்

source: Focuses this effect.
ta: இந்த விளைவை மையப்படுத்துகிறது.

source: Unfocuses this effect.
ta: இந்த விளைவை மையப்படுத்துகிறது.

source: Refer to the web page on the Mixxx wiki for your controller for more information.
ta: மேலும் தகவலுக்கு உங்கள் கட்டுப்படுத்திக்கு Mixxx விக்கியில் உள்ள வலைப்பக்கத்தைப் பார்க்கவும்.

source: Effect Parameter
ta: விளைவு அளவுரு

source: Adjusts a parameter of the effect.
ta: விளைவின் அளவுருவை சரிசெய்கிறது.

source: Inactive: parameter not linked
ta: செயலற்றது: அளவுரு இணைக்கப்படவில்லை

source: Active: parameter moves with Meta Knob
ta: செயலில்: அளவுரு மேவு நாப் மூலம் நகரும்

source: Left side active: parameter moves with left half of Meta Knob turn
ta: இடது பக்கம் செயலில் உள்ளது: மேவு நாப் திருப்பத்தின் இடது பாதியுடன் அளவுரு நகர்கிறது

source: Left and right side active: parameter moves across range with half of Meta Knob turn and back with the other half
ta: இடது மற்றும் வலது பக்கம் செயலில் உள்ளது: அளவுரு மேவு குமிழ் திருப்பத்தின் பாதியுடன் வரம்பில் நகர்கிறது மற்றும் மறு பாதியுடன் பின்வாங்குகிறது

source: Equalizer Parameter Kill
ta: ஈக்வலைசர் அளவுரு கில்

source: Holds the gain of the EQ to zero while active.
ta: செயலில் இருக்கும்போது ஈக்யூவின் ஆதாயத்தை பூச்சியமாக வைத்திருக்கும்.

source: Quick Effect Super Knob
ta: விரைவு விளைவு சூப்பர் நாப்

source: Quick Effect Super Knob (control linked effect parameters).
ta: விரைவு விளைவு சூப்பர் நாப் (கட்டுப்பாட்டு இணைக்கப்பட்ட விளைவு அளவுருக்கள்).

source: Hint: Change the default Quick Effect mode in Preferences -> Equalizers.
ta: குறிப்பு: விருப்பத்தேர்வுகள் -> ஈக்வலைசர்களில் இயல்புநிலை விரைவு விளைவு பயன்முறையை மாற்றவும்.

source: Equalizer Parameter
ta: சமநிலை அளவுரு

source: Adjusts the gain of the EQ filter.
ta: EQ வடிப்பானின் ஆதாயத்தை சரிசெய்கிறது.

source: Hint: Change the default EQ mode in Preferences -> Equalizers.
ta: குறிப்பு: விருப்பத்தேர்வுகள் -> ஈக்வலைசர்களில் இயல்புநிலை ஈக்யூ பயன்முறையை மாற்றவும்.

# Tooltips#328
source: Adjust Beatgrid
ta: Beatgrid ஐ சரிசெய்யவும்

source: Adjust beatgrid so the closest beat is aligned with the current play position.
ta: பீட்கிரிட்டைச் சரிசெய்யவும், அதனால் மிக நெருக்கமான பீட் தற்போதைய விளையாட்டு நிலையுடன் சீரமைக்கப்படும்.

# Tooltips#330
source: Adjust beatgrid to match another playing deck.
ta: மற்றொரு விளையாடும் தளத்துடன் பொருந்துமாறு பீட்கிரிட்டைச் சரிசெய்யவும்.

source: If quantize is enabled, snaps to the nearest beat.
ta: அளவுப்படுத்தல் இயக்கப்பட்டால், அருகிலுள்ள துடிப்புக்கு ச்னாப்ச்.

# Tooltips#332
source: Quantize
ta: அளவிடு

source: Toggles quantization.
ta: அளவுப்படுத்தலை மாற்றுகிறது.

source: Loops and cues snap to the nearest beat when quantization is enabled.
ta: அளவீடு இயக்கப்பட்டால், சுழல்கள் மற்றும் குறிப்புகள் அருகிலுள்ள துடிப்புக்கு ச்னாப் ஆகும்.

source: Reverse
ta: தலைகீழ்

source: Reverses track playback during regular playback.
ta: வழக்கமான பிளேபேக்கின் போது ட்ராக் பிளேபேக்கை மாற்றுகிறது.

source: Puts a track into reverse while being held (Censor).
ta: வைத்திருக்கும் போது ஒரு தடத்தை தலைகீழாக வைக்கிறது (தணிக்கை).

source: Playback continues where the track would have been if it had not been temporarily reversed.
ta: ட்ராக் தற்காலிகமாக மாற்றியமைக்கப்படாமல் இருந்திருந்தால், அது இருந்த இடத்தில் பிளேபேக் தொடர்கிறது.

source: Play/Pause
ta: விளையாடு/இடைநிறுத்தம்

source: Jumps to the beginning of the track.
ta: பாதையின் தொடக்கத்திற்கு தாவுகிறது.

source: Syncs the tempo (BPM) and phase to that of the other track, if BPM is detected on both.
ta: இரண்டிலும் பிபிஎம் கண்டறியப்பட்டால், டெம்போ (பிபிஎம்) மற்றும் கட்டத்தை மற்ற டிராக்குடன் ஒத்திசைக்கிறது.

source: Syncs the tempo (BPM) to that of the other track, if BPM is detected on both.
ta: இரண்டிலும் பிபிஎம் கண்டறியப்பட்டால், டெம்போவை (பிபிஎம்) மற்ற டிராக்குடன் ஒத்திசைக்கிறது.

source: Sync and Reset Key
ta: விசையை ஒத்திசைத்து மீட்டமைக்கவும்

source: Increases the pitch by one semitone.
ta: ஒரு செமிடோன் மூலம் பிட்சை அதிகரிக்கிறது.

source: Decreases the pitch by one semitone.
ta: பிட்சை ஒரு செமிடோன் குறைக்கிறது.

source: Enable Vinyl Control
ta: வினைல் கட்டுப்பாட்டை இயக்கவும்

source: When disabled, the track is controlled by Mixxx playback controls.
ta: முடக்கப்பட்டால், மிக்ச்எக்ச் பிளேபேக் கட்டுப்பாடுகளால் டிராக் கட்டுப்படுத்தப்படும்.

source: When enabled, the track responds to external vinyl control.
ta: இயக்கப்பட்டால், வெளிப்புற வினைல் கட்டுப்பாட்டுக்கு டிராக் பதிலளிக்கிறது.

source: Enable Passthrough
ta: பாச்த்ரூவை இயக்கு

source: Indicates that the audio buffer is too small to do all audio processing.
ta: அனைத்து ஆடியோ செயலாக்கத்தையும் செய்ய ஆடியோ பஃபர் மிகவும் சிறியதாக இருப்பதைக் குறிக்கிறது.

source: Displays cover artwork of the loaded track.
ta: ஏற்றப்பட்ட பாதையின் கவர் கலைப்படைப்பைக் காட்டுகிறது.

source: Displays options for editing cover artwork.
ta: அட்டைப் படைப்புகளைத் திருத்துவதற்கான விருப்பங்களைக் காட்டுகிறது.

source: Star Rating
ta: நட்சத்திர மதிப்பீடு

source: Assign ratings to individual tracks by clicking the stars.
ta: நட்சத்திரங்களைக் சொடுக்கு செய்வதன் மூலம் தனிப்பட்ட டிராக்குகளுக்கு மதிப்பீடுகளை ஒதுக்கவும்.

source: Channel Peak Indicator
ta: சேனல் பீக் இன்டிகேட்டர்

source: Drag this item to other decks/samplers, to crates and playlist or to external file manager.
ta: இந்த உருப்படியை மற்ற தளங்கள்/மாதிரிகள், கிரேட்கள் மற்றும் பிளேலிச்ட்டுக்கு அல்லது வெளிப்புற கோப்பு மேலாளருக்கு இழுக்கவும்.

source: Shows information about the track currently loaded in this deck.
ta: இந்த டெக்கில் தற்போது ஏற்றப்பட்ட டிராக் பற்றிய தகவலைக் காட்டுகிறது.

source: Left click to jump around in the track.
ta: பாதையில் குதிக்க இடது சொடுக்கு செய்யவும்.

source: Right click hotcues to edit their labels and colors.
ta: அவற்றின் லேபிள்கள் மற்றும் வண்ணங்களைத் திருத்த, ஆட்குகளில் வலது சொடுக்கு செய்யவும்.

source: Right click anywhere else to show the time at that point.
ta: அந்த நேரத்தில் நேரத்தைக் காட்ட வேறு எங்கும் வலது சொடுக்கு செய்யவும்.

source: Channel L Peak Indicator
ta: சேனல் எல் உச்சநிலை காட்டி

source: Indicates when the left signal on the channel is clipping,
ta: சேனலில் இடது சமிக்ஞை கிளிப்பிங் செய்யும் போது குறிக்கிறது,

source: Channel R Peak Indicator
ta: சேனல் ஆர் பீக் இன்டிகேட்டர்

source: Indicates when the right signal on the channel is clipping,
ta: சேனலில் சரியான சிக்னல் கிளிப்பிங் செய்யும் போது குறிக்கிறது,

source: Channel L Volume Meter
ta: சேனல் எல் வால்யூம் மீட்டர்

source: Shows the current channel volume for the left channel.
ta: இடது சேனலுக்கான தற்போதைய சேனல் அளவைக் காட்டுகிறது.

source: Channel R Volume Meter
ta: சேனல் ஆர் வால்யூம் மீட்டர்

source: Shows the current channel volume for the right channel.
ta: சரியான சேனலுக்கான தற்போதைய சேனல் அளவைக் காட்டுகிறது.

source: Microphone Peak Indicator
ta: மைக்ரோஃபோன் உச்சநிலை காட்டி

source: Indicates when the signal on the microphone is clipping,
ta: மைக்ரோஃபோனில் சிக்னல் கிளிப்பிங் செய்யும் போது குறிக்கிறது,
