Repository: 247i/TACETr
Catalog: உரை/தானி/mixxxdj_mixxx2-5_*.po
Languages: ta

source: Vinyl Control Passthrough
ta: வினைல் கண்ட்ரோல் பாச்த்ரூ

source: Vinyl Control Next Deck
ta: வினைல் கட்டுப்பாடு அடுத்த டெக்

source: Single deck mode - Switch vinyl control to next deck
ta: ஒற்றை அடுக்கு முறை - வினைல் கட்டுப்பாட்டை அடுத்த டெக்கிற்கு மாற்றவும்

# ControlPickerMenu#161
source: Cue
ta: குறி

source: Set Cue
ta: குறியை அமைக்கவும்

source: Go-To Cue
ta: கோ-டு கியூ

source: Go-To Cue And Play
ta: கோ-டு க்யூ மற்றும் ப்ளே

source: Go-To Cue And Stop
ta: கோ-டு மற்றும் ச்டாப்

source: Preview Cue
ta: முன்னோட்டம் குறி

source: Cue (CDJ Mode)
ta: Cue (CDJ பயன்முறை)

source: Stutter Cue
ta: தடுமாறி கியூ

source: Go to cue point and play after release
ta: கியூ பாயிண்டிற்குச் சென்று, வெளியான பிறகு விளையாடுங்கள்

source: Clear Hotcue %1
ta: Hotcue% 1ஐ அழிக்கவும்

source: Set Hotcue %1
ta: Hotcue% 1ஐ அமைக்கவும்

source: Jump To Hotcue %1
ta: ஆட்கியூ % 1க்கு செல்லவும்

source: Jump To Hotcue %1 And Stop
ta: Hotcue % 1 க்குச் சென்று நிறுத்தவும்

source: Jump To Hotcue %1 And Play
ta: Hotcue % 1 க்குச் சென்று விளையாடவும்

source: Preview Hotcue %1
ta: முன்னோட்டம் Hotcue% 1

source: Loop In
ta: லூப் இன்

source: Loop Out
ta: லூப் அவுட்

# ControlPickerMenu#178
source: Loop Exit
ta: லூப் வெளியேறு

source: Reloop/Exit Loop
ta: லூப் / வெளியேறு லூப்

# ControlPickerMenu#180
source: Loop Halve
ta: லூப் பாதி

# ControlPickerMenu#181
source: Loop Double
ta: லூப் டபுள்

source: Move Loop +%1 Beats
ta: மூவ் லூப் +% 1 பீட்ச்

source: Move Loop -%1 Beats
ta: மூவ் லூப் -% 1 பீட்ச்

source: Loop %1 Beats
ta: லூப்% 1 பீட்ச்

source: Loop Roll %1 Beats
ta: லூப் ரோல்% 1 பீட்ச்

# ControlPickerMenu#190
source: Add to Auto DJ Queue (bottom)
ta: ஆட்டோ DJ வரிசையில் சேர் (கீழே)

source: Append the selected track to the Auto DJ Queue
ta: தேர்ந்தெடுக்கப்பட்ட டிராக்கை ஆட்டோ டிசே வரிசையில் இணைக்கவும்

# ControlPickerMenu#192
source: Add to Auto DJ Queue (top)
ta: ஆட்டோ DJ வரிசையில் சேர் (மேல்)

source: Prepend selected track to the Auto DJ Queue
ta: தேர்ந்தெடுக்கப்பட்ட ட்ராக்கை ஆட்டோ டிசே வரிசைக்கு முன்வைக்கவும்

source: Load Track
ta: ட்ராக்கை ஏற்றவும்

source: Load selected track
ta: தேர்ந்தெடுக்கப்பட்ட ட்ராக்கை ஏற்றவும்

source: Load selected track and play
ta: தேர்ந்தெடுத்த டிராக்கை ஏற்றி விளையாடு

# ControlPickerMenu#197
source: Record Mix
ta: பதிவு கலவை

source: Toggle mix recording
ta: கலவை பதிவை நிலைமாற்று

# ControlPickerMenu#199
source: Effects
ta: விளைவுகள்

source: Quick Effects
ta: விரைவான விளைவுகள்

source: Deck %1 Quick Effect Super Knob
ta: டெக் % 1 விரைவு விளைவு சூப்பர் நாப்

source: Quick Effect Super Knob (control linked effect parameters)
ta: விரைவு விளைவு சூப்பர் நாப் (கட்டுப்பாட்டு இணைக்கப்பட்ட விளைவு அளவுருக்கள்)

# ControlPickerMenu#203
source: Quick Effect
ta: விரைவான விளைவு

# ControlPickerMenu#204
source: Clear Unit
ta: தெளிவான அலகு

source: Clear effect unit
ta: தெளிவான விளைவு அலகு

# ControlPickerMenu#206
source: Toggle Unit
ta: மாற்று அலகு

# ControlPickerMenu#207
source: Dry/Wet
ta: உலர்/ஈரமான

source: Adjust the balance between the original (dry) and processed (wet) signal.
ta: அசல் (உலர்ந்த) மற்றும் பதப்படுத்தப்பட்ட (ஈரமான) சமிக்ஞைக்கு இடையே உள்ள சமநிலையை சரிசெய்யவும்.

# ControlPickerMenu#209
source: Super Knob
ta: சூப்பர் நாப்

# ControlPickerMenu#210
source: Next Chain
ta: அடுத்த சங்கிலி

source: Assign
ta: ஒதுக்கு

# ControlPickerMenu#212
source: Clear
ta: தெளிவு

source: Clear the current effect
ta: தற்போதைய விளைவை அழிக்கவும்

# ControlPickerMenu#214
source: Toggle
ta: நிலைமாற்று

source: Toggle the current effect
ta: தற்போதைய விளைவை மாற்றவும்

# ControlPickerMenu#216
source: Next
ta: அடுத்தது

source: Switch to next effect
ta: அடுத்த விளைவுக்கு மாறவும்

# ControlPickerMenu#218
source: Previous
ta: முந்தைய

source: Switch to the previous effect
ta: முந்தைய விளைவுக்கு மாறவும்

# ControlPickerMenu#220
source: Next or Previous
ta: அடுத்தது அல்லது முந்தையது

source: Switch to either next or previous effect
ta: அடுத்த அல்லது முந்தைய விளைவுக்கு மாறவும்

source: Parameter Value
ta: அளவுரு மதிப்பு

source: Microphone Ducking Strength
ta: மைக்ரோஃபோன் டக்கிங் வலிமை

source: Microphone Ducking Mode
ta: மைக்ரோஃபோன் டக்கிங் பயன்முறை

# ControlPickerMenu#225
source: Gain
ta: பெருக்கம்

source: Gain knob
ta: குமிழ் பெறவும்

source: Shuffle the content of the Auto DJ queue
ta: ஆட்டோ டிசே வரிசையின் உள்ளடக்கத்தை கலக்கவும்

source: Skip the next track in the Auto DJ queue
ta: ஆட்டோ டிசே வரிசையில் அடுத்த ட்ராக்கைத் தவிர்க்கவும்

source: Auto DJ Toggle
ta: ஆட்டோ டிசே நிலைமாற்று

source: Toggle Auto DJ On/Off
ta: ஆட்டோ DJ ஆன்/ஆஃப்

source: Show/hide the microphone & auxiliary section
ta: மைக்ரோஃபோன் & துணைப் பிரிவைக் காட்டு/மறை

source: 4 Effect Units Show/Hide
ta: 4 விளைவு அலகுகள் காட்டு/மறை

source: Switches between showing 2 and 4 effect units
ta: 2 மற்றும் 4 விளைவு அலகுகளைக் காண்பிக்கும் இடையே மாறுகிறது

source: Mixer Show/Hide
ta: மிக்சர் காட்டு/மறை

# ControlPickerMenu#235
source: Show or hide the mixer.
ta: கலவையைக் காட்டு அல்லது மறைக்கவும்.

source: Cover Art Show/Hide (Library)
ta: கவர் ஆர்ட் சோ/மறை (நூலகம்)

source: Show/hide cover art in the library
ta: நூலகத்தில் அட்டைப்படத்தை காட்டு/மறை

source: Library Maximize/Restore
ta: நூலகத்தை பெரிதாக்கு/மீட்டமை

# ControlPickerMenu#239
source: Maximize the track library to take up all the available screen space.
ta: கிடைக்கக்கூடிய அனைத்து திரை இடத்தையும் எடுத்துக்கொள்ள, டிராக் லைப்ரரியை அதிகரிக்கவும்.

source: Effect Rack Show/Hide
ta: விளைவு ரேக் சோ/மறை

source: Show/hide the effect rack
ta: விளைவு ரேக்கைக் காட்டு/மறை

# ControlPickerMenu#242
source: Waveform Zoom Out
ta: அலைவடிவம் பெரிதாக்கு

# ControlPickerMenu#243
source: Headphone Gain
ta: எட்ஃபோன் ஆதாயம்

source: Headphone gain
ta: எட்ஃபோன் லாபம்

source: Tap to sync tempo (and phase with quantize enabled), hold to enable permanent sync
ta: டெம்போவை ஒத்திசைக்க தட்டவும் (மற்றும் அளவு செயல்படுத்தப்பட்ட நிலையில்), நிரந்தர ஒத்திசைவை இயக்க அழுத்திப் பிடிக்கவும்

source: One-time beat sync tempo (and phase with quantize enabled)
ta: ஒரு முறை பீட் ஒத்திசைவு டெம்போ (மற்றும் அளவு செயல்படுத்தப்பட்ட கட்டம்)

source: Playback Speed
ta: பின்னணி விரைவு

source: Playback speed control (Vinyl "Pitch" slider)
ta: பின்னணி வேகக் கட்டுப்பாடு (வினைல் "பிட்ச்" ச்லைடர்)

source: Pitch (Musical key)
ta: பிட்ச் (இசை விசை)

source: Increase Speed
ta: வேகத்தை அதிகரிக்கவும்

source: Adjust speed faster (coarse)
ta: வேகத்தை வேகமாக சரிசெய்யவும் (கரடுமுரடான)

source: Increase Speed (Fine)
ta: வேகத்தை அதிகரிக்கவும் (நன்றாக)

source: Adjust speed faster (fine)
ta: வேகத்தை வேகமாக சரிசெய்யவும் (நன்றாக)

source: Decrease Speed
ta: வேகத்தைக் குறைக்கவும்

source: Adjust speed slower (coarse)
ta: வேகத்தை மெதுவாக (கரடுமுரடான) சரிசெய்யவும்

source: Adjust speed slower (fine)
ta: வேகத்தை மெதுவாக சரிசெய்யவும் (நன்றாக)

source: Temporarily Increase Speed
ta: தற்காலிகமாக வேகத்தை அதிகரிக்கவும்

source: Temporarily increase speed (coarse)
ta: வேகத்தை தற்காலிகமாக அதிகரிக்கவும் (கரடுமுரடான)

source: Temporarily Increase Speed (Fine)
ta: தற்காலிகமாக வேகத்தை அதிகரிக்கவும் (நன்றாக)

source: Temporarily increase speed (fine)
ta: வேகத்தை தற்காலிகமாக அதிகரிக்கவும் (நன்றாக)

source: Temporarily Decrease Speed
ta: வேகத்தை தற்காலிகமாக குறைக்கவும்

source: Temporarily decrease speed (coarse)
ta: வேகத்தை தற்காலிகமாக குறைக்கவும் (கரடுமுரடான)

source: Temporarily Decrease Speed (Fine)
ta: வேகத்தை தற்காலிகமாக குறைக்கவும் (நன்றாக)

source: Temporarily decrease speed (fine)
ta: வேகத்தை தற்காலிகமாக குறைக்கவும் (நன்றாக)

source: Adjust %1
ta: % 1ஐ சரிசெய்யவும்

source: Effect Unit %1
ta: விளைவு அலகு% 1

source: Button Parameter %1
ta: பொத்தான் அளவுரு% 1

# ControlPickerMenu#268
source: Skin
ta: தோல்

source: Controller
ta: கட்டுப்படுத்தி

source: Crossfader / Orientation
ta: கிராச்ஃபேடர் / நோக்குநிலை

source: Main Output gain
ta: முக்கிய வெளியீடு ஆதாயம்

source: Main Output balance
ta: முக்கிய வெளியீடு இருப்பு

source: Main Output delay
ta: முக்கிய வெளியீடு நேரந்தவறுகை

# ControlPickerMenu#274
source: Headphone
ta: எட்ஃபோன்

source: Kill %1
ta: கொல்லவும்% 1

source: Eject or un-eject track, i.e. reload the last-ejected track (of any deck)<br>Double-press to reload the last replaced track. In empty decks it reloads the second-last ejected track.
ta: டிராக்கை வெளியேற்று அல்லது வெளியேற்று வெற்று டெக்குகளில் இது இரண்டாவது கடைசியாக வெளியேற்றப்பட்ட பாதையை மீண்டும் ஏற்றுகிறது.

source: BPM / Beatgrid
ta: பிபிஎம் / பீட்கிரிட்

# ControlPickerMenu#278
source: Halve BPM
ta: பாதி பிபிஎம்

source: Multiply current BPM by 0.5
ta: தற்போதைய BPM ஐ 0.5 ஆல் பெருக்கவும்

# ControlPickerMenu#280
source: 2/3 BPM
ta: 2/3 பிபிஎம்

source: Multiply current BPM by 0.666
ta: தற்போதைய BPM ஐ 0.666 ஆல் பெருக்கவும்

# ControlPickerMenu#282
source: 3/4 BPM
ta: 3/4 பிபிஎம்

source: Multiply current BPM by 0.75
ta: தற்போதைய BPM ஐ 0.75 ஆல் பெருக்கவும்

# ControlPickerMenu#284
source: 4/3 BPM
ta: 4/3 பிபிஎம்

source: Multiply current BPM by 1.333
ta: தற்போதைய BPM ஐ 1.333 ஆல் பெருக்கவும்

# ControlPickerMenu#286
source: 3/2 BPM
ta: 3/2 பிபிஎம்

source: Multiply current BPM by 1.5
ta: தற்போதைய BPM ஐ 1.5 ஆல் பெருக்கவும்

# ControlPickerMenu#288
source: Double BPM
ta: இரட்டை பிபிஎம்

source: Multiply current BPM by 2
ta: தற்போதைய BPM ஐ 2 ஆல் பெருக்கவும்

# ControlPickerMenu#290
source: Tempo Tap
ta: டெம்போ இழப்பு

source: Tempo tap button
ta: டெம்போ தட்டு பொத்தான்

source: Move Beatgrid
ta: பீட்கிரிட்டை நகர்த்தவும்

source: Adjust the beatgrid to the left or right
ta: பீட்கிரிட்டை இடது அல்லது வலது பக்கம் சரிசெய்யவும்

# ControlPickerMenu#294
source: Toggle the BPM/beatgrid lock
ta: BPM/beatgrid பூட்டை நிலைமாற்று

# ControlPickerMenu#295
source: Revert last BPM/Beatgrid Change
ta: கடைசி BPM/Beatgrid மாற்றத்தை மாற்றியமைக்கவும்

# ControlPickerMenu#296
source: Revert last BPM/Beatgrid Change of the loaded track.
ta: ஏற்றப்பட்ட பாதையின் கடைசி BPM/Beatgrid மாற்றத்தை மாற்றியமைக்கவும்.

source: Sync / Sync Lock
ta: ஒத்திசைவு / ஒத்திசைவு பூட்டு

source: Internal Sync Leader
ta: உள் ஒத்திசைவு தலைவர்

source: Toggle Internal Sync Leader
ta: உள் ஒத்திசைவு தலைவரை நிலைமாற்று

source: Internal Leader BPM
ta: உள் தலைவர் பிபிஎம்

source: Internal Leader BPM +1
ta: உள் தலைவர் BPM +1

source: Increase internal Leader BPM by 1
ta: உள் தலைவர் BPM ஐ 1 ஆல் அதிகரிக்கவும்

source: Internal Leader BPM -1
ta: உள் தலைவர் பிபிஎம் -1

source: Decrease internal Leader BPM by 1
ta: உள் தலைவர் BPM ஐ 1 ஆல் குறைக்கவும்

source: Internal Leader BPM +0.1
ta: உள் தலைவர் BPM +0.1

source: Increase internal Leader BPM by 0.1
ta: உள் தலைவர் BPM ஐ 0.1 ஆல் அதிகரிக்கவும்

source: Internal Leader BPM -0.1
ta: உள் தலைவர் பிபிஎம் -0.1

source: Decrease internal Leader BPM by 0.1
ta: உள் தலைவர் BPM ஐ 0.1 ஆல் குறைக்கவும்

source: Sync Leader
ta: ஒத்திசைவு தலைவர்

source: Sync mode 3-state toggle / indicator (Off, Soft Leader, Explicit Leader)
ta: ஒத்திசைவு முறை 3-நிலை நிலைமாற்றம் / காட்டி (ஆஃப், சாஃப்ட் லீடர், வெளிப்படையான தலைவர்)

# ControlPickerMenu#311
source: Speed
ta: வேகம்

source: Decrease Speed (Fine)
ta: வேகத்தைக் குறைத்தல் (நன்றாக)

source: Pitch (Musical Key)
ta: பிட்ச் (இசை விசை)

source: Increase Pitch
ta: சுருதியை அதிகரிக்கவும்

source: Increases the pitch by one semitone
ta: ஒரு செமிடோன் மூலம் பிட்சை அதிகரிக்கிறது

source: Increase Pitch (Fine)
ta: சுருதியை அதிகரிக்கவும் (நன்றாக)

source: Increases the pitch by 10 cents
ta: ஆடுகளத்தை 10 சென்ட்கள் அதிகரிக்கிறது

source: Decrease Pitch
ta: சுருதியைக் குறைக்கவும்

source: Decreases the pitch by one semitone
ta: பிட்சை ஒரு செமிடோன் குறைக்கிறது

source: Decrease Pitch (Fine)
ta: சுருதியைக் குறைத்தல் (நன்றாக)

source: Decreases the pitch by 10 cents
ta: ஆடுகளத்தை 10 சென்ட்கள் குறைக்கிறது

# ControlPickerMenu#322
source: Keylock
ta: கீலாக்

source: CUP (Cue + Play)
ta: கப் (கியூ + ப்ளே)

source: Shift cue points earlier
ta: முன்குறிப்பு புள்ளிகளை மாற்றவும்

source: Shift cue points 10 milliseconds earlier
ta: 10 மில்லி விநாடிகளுக்கு முன் சிஃப்ட் கியூ பாயிண்ட்ச்

source: Shift cue points earlier (fine)
ta: சிஃப்ட் க்யூ பாயிண்ட்டை முன்னதாக (நன்றாக)

source: Shift cue points 1 millisecond earlier
ta: 1 மில்லி நொடிக்கு முன் சிஃப்ட் கியூ பாயிண்ட்ச்

source: Shift cue points later
ta: குறிப்பு புள்ளிகளை பின்னர் மாற்றவும்

source: Shift cue points 10 milliseconds later
ta: 10 மில்லி விநாடிகள் கழித்து க்யூ புள்ளிகளை மாற்றவும்

source: Shift cue points later (fine)
ta: க்யூ புள்ளிகளை பின்னர் மாற்றவும் (நன்றாக)

source: Shift cue points 1 millisecond later
ta: 1 மில்லி விநாடிகள் கழித்து க்யூ புள்ளிகளை மாற்றவும்

source: Intro / Outro Markers
ta: அறிமுகம்/வெளிப்புற குறிப்பான்கள்

# ControlPickerMenu#334
source: Intro Start Marker
ta: அறிமுக தொடக்க குறிப்பான்

# ControlPickerMenu#335
source: Intro End Marker
ta: அறிமுக முடிவு குறிப்பான்

# ControlPickerMenu#336
source: Outro Start Marker
ta: அவுட்ரோ ச்டார்ட் மார்க்கர்

# ControlPickerMenu#337
source: Outro End Marker
ta: மற்றொரு முடிவு குறிப்பான்

source: intro start marker
ta: அறிமுக தொடக்க குறிப்பான்

source: intro end marker
ta: அறிமுக முடிவு குறிப்பான்

source: outro start marker
ta: வெளிப்புற தொடக்க குறிப்பான்கள்

source: outro end marker
ta: மற்றொரு முடிவு குறிப்பான்

# [intro/outro marker
source: Activate %1
ta: % 1ஐ செயல்படுத்தவும்

# [intro/outro marker
source: Jump to or set the %1
ta: செல்லவும் அல்லது % 1 ஐ அமைக்கவும்

# [intro/outro marker
source: Set %1
ta: % 1ஐ அமை

# [intro/outro marker
source: Set or jump to the %1
ta: அமைக்கவும் அல்லது % 1 க்கு செல்லவும்

# [intro/outro marker
source: Clear %1
ta: % 1ஐ அழி

# [intro/outro marker
source: Clear the %1
ta: % 1ஐ அழிக்கவும்

source: if the track has no beats the unit is seconds
ta: பாதையில் துடிப்பு இல்லை என்றால் அலகு வினாடிகள்

source: Loop Selected Beats
ta: லூப் தேர்ந்தெடுக்கப்பட்ட பீட்ச்

source: Create a beat loop of selected beat size
ta: தேர்ந்தெடுக்கப்பட்ட பீட் அளவின் பீட் லூப்பை உருவாக்கவும்

source: Loop Roll Selected Beats
ta: லூப் ரோல் தேர்ந்தெடுக்கப்பட்ட பீட்ச்

source: Create a rolling beat loop of selected beat size
ta: தேர்ந்தெடுக்கப்பட்ட பீட் அளவிலான ரோலிங் பீட் லூப்பை உருவாக்கவும்

source: Loop %1 Beats set from its end point
ta: லூப்% 1 பீட்ச் அதன் இறுதிப் புள்ளியில் இருந்து அமைக்கப்பட்டது

source: Loop Roll %1 Beats set from its end point
ta: லூப் ரோல் % 1 பீட்ச் அதன் இறுதிப் புள்ளியிலிருந்து அமைக்கப்பட்டது

source: Create %1-beat loop with the current play position as loop end
ta: %1-பீட் லூப்பை லூப் என்ட் ஆக தற்போதைய விளையாட்டு நிலையை உருவாக்கவும்

source: Create temporary %1-beat loop roll with the current play position as loop end
ta: தற்காலிக %1-பீட் லூப் ரோலை லூப் எண்டாக தற்போதைய பிளே பொசிசனுடன் உருவாக்கவும்

source: Loop Beats
ta: லூப் பீட்ச்

source: Loop Roll Beats
ta: லூப் ரோல் பீட்ச்

source: Go To Loop In
ta: Loop Inக்குச் செல்லவும்

source: Go to Loop In button
ta: லூப் இன் பொத்தானுக்குச் செல்லவும்

source: Go To Loop Out
ta: லூப் அவுட்டுக்குச் செல்லவும்

source: Go to Loop Out button
ta: லூப் அவுட் பொத்தானுக்குச் செல்லவும்

source: Toggle loop on/off and jump to Loop In point if loop is behind play position
ta: லூப்பை ஆன்/ஆஃப் செய்து, லூப் பிளே நிலைக்குப் பின்னால் இருந்தால், லூப் இன் பாயிண்டிற்குச் செல்லவும்

source: Reloop And Stop
ta: ரீலூப் மற்றும் ச்டாப்

source: Enable loop, jump to Loop In point, and stop
ta: லூப்பை இயக்கவும், லூப் இன் பாயிண்டிற்குச் சென்று நிறுத்தவும்

source: Halve the loop length
ta: வளைய நீளத்தை பாதியாக குறைக்கவும்

source: Double the loop length
ta: வளைய நீளத்தை இரட்டிப்பாக்கு

source: Beat Jump / Loop Move
ta: சம்ப் / லூப் மூவ் அடிக்கவும்

source: Jump / Move Loop Forward %1 Beats
ta: சம்ப் / மூவ் லூப் % 1 பீட்ச்

source: Jump / Move Loop Backward %1 Beats
ta: சம்ப் / மூவ் லூப் பின்னோக்கி % 1 பீட்ச்

source: Jump forward by %1 beats, or if a loop is enabled, move the loop forward %1 beats
ta: % 1 துடிப்புகளால் முன்னோக்கி செல்லவும் அல்லது லூப் இயக்கப்பட்டிருந்தால், வளையத்தை முன்னோக்கி நகர்த்தவும்

source: Jump backward by %1 beats, or if a loop is enabled, move the loop backward %1 beats
ta: % 1 துடிப்புகளால் பின்னோக்கி செல்லவும் அல்லது ஒரு வளையம் இயக்கப்பட்டிருந்தால், வளையத்தை % 1 துடிப்புகளால் பின்னோக்கி நகர்த்தவும்

source: Beat Jump / Loop Move Forward Selected Beats
ta: பீட் சம்ப் / லூப் தேர்ந்தெடுக்கப்பட்ட பீட்களை முன்னோக்கி நகர்த்தவும்

source: Jump forward by the selected number of beats, or if a loop is enabled, move the loop forward by the selected number of beats
ta: தேர்ந்தெடுக்கப்பட்ட துடிப்புகளின் எண்ணிக்கையால் முன்னோக்கி செல்லவும் அல்லது ஒரு லூப் இயக்கப்பட்டிருந்தால், தேர்ந்தெடுக்கப்பட்ட துடிப்புகளின் எண்ணிக்கையால் வளையத்தை முன்னோக்கி நகர்த்தவும்

source: Beat Jump / Loop Move Backward Selected Beats
ta: பீட் சம்ப் / லூப் பின்னோக்கி நகர்த்த தேர்ந்தெடுக்கப்பட்ட பீட்ச்

source: Jump backward by the selected number of beats, or if a loop is enabled, move the loop backward by the selected number of beats
ta: தேர்ந்தெடுக்கப்பட்ட துடிப்புகளின் எண்ணிக்கையால் பின்னோக்கி செல்லவும் அல்லது ஒரு லூப் இயக்கப்பட்டிருந்தால், தேர்ந்தெடுக்கப்பட்ட துடிப்புகளின் எண்ணிக்கையால் வளையத்தை பின்னோக்கி நகர்த்தவும்

source: Beat Jump
ta: சம்ப் அடிக்கவும்

source: Indicate which loop marker remain static when adjusting the size or is inherited from the current position
ta: அளவை சரிசெய்யும்போது எந்த லூப் மார்க்கர் நிலையானதாக இருக்கும் அல்லது தற்போதைய நிலையில் இருந்து மரபுரிமையாக உள்ளது என்பதைக் குறிப்பிடவும்

source: Beat Jump / Loop Move Forward
ta: பீட் சம்ப் / லூப் முன்னோக்கி நகர்த்தவும்

source: Beat Jump / Loop Move Backward
ta: பீட் சம்ப் / லூப் பின்னோக்கி நகர்த்தவும்

source: Loop Move Forward
ta: லூப் முன்னோக்கி நகர்த்தவும்

source: Loop Move Backward
ta: லூப் பின்னோக்கி நகர்த்தவும்

source: Remove Temporary Loop
ta: தற்காலிக சுழற்சியை அகற்று

source: Remove the temporary loop
ta: தற்காலிக வளையத்தை அகற்றவும்

source: Navigation
ta: வானோடல்

source: Move up
ta: மேலே செல்லவும்

source: Equivalent to pressing the UP key on the keyboard
ta: விசைப்பலகையில் மேலே விசையை அழுத்துவதற்குச் சமம்

source: Move down
ta: கீழே நகர்த்தவும்

source: Equivalent to pressing the DOWN key on the keyboard
ta: விசைப்பலகையில் பேரூர் கீயை அழுத்துவதற்குச் சமம்

source: Move up/down
ta: மேலே/கீழே நகர்த்தவும்

source: Move vertically in either direction using a knob, as if pressing UP/DOWN keys
ta: மேல்/கீழ் விசைகளை அழுத்துவது போல, ஒரு குமிழியைப் பயன்படுத்தி இரு திசைகளிலும் செங்குத்தாக நகர்த்தவும்

source: Scroll Up
ta: மேலே உருட்டவும்

source: Equivalent to pressing the PAGE UP key on the keyboard
ta: விசைப்பலகையில் PAGE மேலே விசையை அழுத்துவதற்குச் சமம்

source: Scroll Down
ta: கீழே உருட்டவும்

source: Equivalent to pressing the PAGE DOWN key on the keyboard
ta: விசைப்பலகையில் PAGE DOWN விசையை அழுத்துவதற்குச் சமம்

source: Scroll up/down
ta: மேலே/கீழே உருட்டவும்

source: Scroll vertically in either direction using a knob, as if pressing PGUP/PGDOWN keys
ta: PGUP/PGDOWN விசைகளை அழுத்துவது போல், குமிழியைப் பயன்படுத்தி இரு திசைகளிலும் செங்குத்தாக உருட்டவும்

source: Move left
ta: இடதுபுறம் நகர்த்தவும்

source: Equivalent to pressing the LEFT key on the keyboard
ta: விசைப்பலகையில் இடது விசையை அழுத்துவதற்குச் சமம்

source: Move right
ta: வலதுபுறம் நகர்த்தவும்

source: Equivalent to pressing the RIGHT key on the keyboard
ta: விசைப்பலகையில் வலது விசையை அழுத்துவதற்குச் சமம்

source: Move left/right
ta: இடது/வலதுமாக நகர்த்தவும்

source: Move horizontally in either direction using a knob, as if pressing LEFT/RIGHT keys
ta: இடது/வலது விசைகளை அழுத்துவது போல், ஒரு குமிழியைப் பயன்படுத்தி இரு திசைகளிலும் கிடைமட்டமாக நகர்த்தவும்

source: Move focus to right pane
ta: ஃபோகசை வலது பலகத்திற்கு நகர்த்தவும்

source: Equivalent to pressing the TAB key on the keyboard
ta: விசைப்பலகையில் தாவல் விசையை அழுத்துவதற்குச் சமம்

source: Move focus to left pane
ta: கவனத்தை இடது பலகத்திற்கு நகர்த்தவும்

source: Equivalent to pressing the SHIFT+TAB key on the keyboard
ta: விசைப்பலகையில் SHIFT+TAB விசையை அழுத்துவதற்குச் சமம்

source: Move focus to right/left pane
ta: ஃபோகசை வலது/இடது பலகத்திற்கு நகர்த்தவும்

source: Move focus one pane to right or left using a knob, as if pressing TAB/SHIFT+TAB keys
ta: TAB/SHIFT+TAB விசைகளை அழுத்துவது போல், ஒரு குமிழியைப் பயன்படுத்தி ஒரு பலகத்தை வலது அல்லது இடதுபுறமாக கவனம் செய்யவும்

source: Sort focused column
ta: கவனம் செலுத்திய நெடுவரிசையை வரிசைப்படுத்தவும்

source: Sort the column of the cell that is currently focused, equivalent to clicking on its header
ta: தற்போது கவனம் செலுத்திய கலத்தின் நெடுவரிசையை அதன் தலைப்பைக் சொடுக்கு செய்வதற்குச் சமமாக வரிசைப்படுத்தவும்

source: Go to the currently selected item
ta: தற்போது தேர்ந்தெடுக்கப்பட்ட உருப்படிக்குச் செல்லவும்

source: Choose the currently selected item and advance forward one pane if appropriate
ta: தற்போது தேர்ந்தெடுக்கப்பட்ட உருப்படியைத் தேர்ந்தெடுத்து, பொருத்தமானதாக இருந்தால் ஒரு பலகத்தை முன்னோக்கி நகர்த்தவும்

source: Load Track and Play
ta: ட்ராக் மற்றும் ப்ளே ஏற்றவும்

# ControlPickerMenu#415
source: Add to Auto DJ Queue (replace)
ta: ஆட்டோ டிசே வரிசையில் சேர் (மாற்று)

source: Replace Auto DJ Queue with selected tracks
ta: தேர்ந்தெடுக்கப்பட்ட டிராக்குகளுடன் ஆட்டோ டிசே வரிசையை மாற்றவும்

source: Select next search history
ta: அடுத்த தேடல் வரலாற்றைத் தேர்ந்தெடுக்கவும்

source: Selects the next search history entry
ta: அடுத்த தேடல் வரலாறு உள்ளீட்டைத் தேர்ந்தெடுக்கிறது

source: Select previous search history
ta: முந்தைய தேடல் வரலாற்றைத் தேர்ந்தெடுக்கவும்

source: Selects the previous search history entry
ta: முந்தைய தேடல் வரலாறு உள்ளீட்டைத் தேர்ந்தெடுக்கிறது

source: Move selected search entry
ta: தேர்ந்தெடுக்கப்பட்ட தேடல் உள்ளீட்டை நகர்த்தவும்

source: Moves the selected search history item into given direction and steps
ta: தேர்ந்தெடுக்கப்பட்ட தேடல் வரலாற்று உருப்படியை கொடுக்கப்பட்ட திசை மற்றும் படிகளுக்கு நகர்த்துகிறது

source: Clear search
ta: தேடலை அழி

source: Clears the search query
ta: தேடல் வினவலை அழிக்கிறது

source: Select Next Color Available
ta: அடுத்த வண்ணம் கிடைக்கும் என்பதைத் தேர்ந்தெடுக்கவும்

source: Select the next color in the color palette for the first selected track
ta: முதலில் தேர்ந்தெடுக்கப்பட்ட ட்ராக்கிற்கான வண்ணத் தட்டில் அடுத்த வண்ணத்தைத் தேர்ந்தெடுக்கவும்

source: Select Previous Color Available
ta: கிடைக்கக்கூடிய முந்தைய வண்ணத்தைத் தேர்ந்தெடுக்கவும்

source: Select the previous color in the color palette for the first selected track
ta: முதலில் தேர்ந்தெடுக்கப்பட்ட டிராக்கிற்கான வண்ணத் தட்டுகளில் முந்தைய நிறத்தைத் தேர்ந்தெடுக்கவும்

source: Deck %1 Quick Effect Enable Button
ta: தளம் % 1 விரைவு விளைவு இயக்கு பொத்தான்

source: Quick Effect Enable Button
ta: விரைவு விளைவு இயக்கு பொத்தான்

source: Enable or disable effect processing
ta: விளைவு செயலாக்கத்தை இயக்கவும் அல்லது முடக்கவும்

source: Super Knob (control effects' Meta Knobs)
ta: சூப்பர் நாப் (கட்டுப்பாட்டு விளைவுகளின் மேவு குமிழ்கள்)

source: Mix Mode Toggle
ta: கலவை பயன்முறையை மாற்றவும்

source: Toggle effect unit between D/W and D+W modes
ta: டி/டபிள்யூ மற்றும் டி+டபிள்யூ முறைகளுக்கு இடையே எஃபெக்ட் யூனிட்டை மாற்றவும்

source: Next chain preset
ta: அடுத்த சங்கிலி முன்னமைவு

# ControlPickerMenu#436
source: Previous Chain
ta: முந்தைய சங்கிலி

source: Previous chain preset
ta: முந்தைய சங்கிலி முன்னமைவு

# ControlPickerMenu#438
source: Next/Previous Chain
ta: அடுத்த/முந்தைய சங்கிலி

source: Next or previous chain preset
ta: அடுத்த அல்லது முந்தைய சங்கிலி முன்னமைவு

# ControlPickerMenu#440
source: Show Effect Parameters
ta: விளைவு அளவுருக்களைக் காட்டு

source: Effect Unit Assignment
ta: விளைவு அலகு ஒதுக்கீடு

# ControlPickerMenu#442
source: Meta Knob
ta: மேவு குமிழ்

source: Effect Meta Knob (control linked effect parameters)
ta: விளைவு மேவு நாப் (கட்டுப்பாட்டு இணைக்கப்பட்ட விளைவு அளவுருக்கள்)

source: Meta Knob Mode
ta: மேவு குமிழ் பயன்முறை

source: Set how linked effect parameters change when turning the Meta Knob.
ta: மேவு குமிழ் ஐ திருப்பும்போது இணைக்கப்பட்ட விளைவு அளவுருக்கள் எவ்வாறு மாறுகின்றன என்பதை அமைக்கவும்.

source: Meta Knob Mode Invert
ta: மேவு குமிழ் பயன்முறை தலைகீழ்

source: Invert how linked effect parameters change when turning the Meta Knob.
ta: மேவு குமிழ் ஐ திருப்பும்போது இணைக்கப்பட்ட விளைவு அளவுருக்கள் எவ்வாறு மாறுகின்றன என்பதை மாற்றவும்.

source: Button Parameter Value
ta: பொத்தான் அளவுரு மதிப்பு

source: Microphone / Auxiliary
ta: ஒலிவாங்கி / துணை
