Repository: 247i/TACETr
Catalog: உரை/தானி/mixxxdj_mixxx2-5_*.po
Languages: ta

# AnalysisFeature#1
source: Analyze
ta: பகுப்பாய்வு செய்யவும்

# AutoDJFeature#1
source: Crates
ta: கிரேட்ச்

source: Clear Auto DJ Queue
ta: ஆட்டோ DJ வரிசையை அழிக்கவும்

source: Remove Crate as Track Source
ta: ட்ராக் மூலமாக க்ரேட்டை அகற்று

# AutoDJFeature#4
source: Auto DJ
ta: ஆட்டோ டி.சே

source: Confirmation Clear
ta: உறுதிப்படுத்தல் தெளிவானது

source: Do you really want to remove all tracks from the Auto DJ queue?
ta: தானி DJ வரிசையில் இருந்து அனைத்து டிராக்குகளையும் அகற்ற விரும்புகிறீர்களா?

source: This can not be undone.
ta: இதை செயல்தவிர்க்க முடியாது.

source: Add Crate as Track Source
ta: ட்ராக் மூலமாக க்ரேட்டைச் சேர்க்கவும்

source: Banshee
ta: பன்சீ

source: Error loading Banshee database
ta: பன்சீ தரவுத்தளத்தை ஏற்றுவதில் பிழை

source: Banshee database file not found at
ta: பன்சீ தரவுத்தள கோப்பு இங்கு காணப்படவில்லை

source: There was an error loading your Banshee database at
ta: உங்கள் Banshee தரவுத்தளத்தை ஏற்றுவதில் பிழை ஏற்பட்டது

# BaseExternalLibraryFeature#1
source: Add to Auto DJ Queue (bottom)
ta: ஆட்டோ DJ வரிசையில் சேர் (கீழே)

# BaseExternalLibraryFeature#2
source: Add to Auto DJ Queue (top)
ta: ஆட்டோ DJ வரிசையில் சேர் (மேல்)

# BaseExternalLibraryFeature#3
source: Add to Auto DJ Queue (replace)
ta: ஆட்டோ டிசே வரிசையில் சேர் (மாற்று)

source: Import as Playlist
ta: பிளேலிச்ட்டாக இறக்குமதி செய்யவும்

source: Import as Crate
ta: Crate ஆக இறக்குமதி செய்யவும்

# BaseExternalLibraryFeature#6
source: Crate Creation Failed
ta: க்ரேட் உருவாக்கம் தோல்வியடைந்தது

source: Could not create crate, it most likely already exists:
ta: கூட்டை உருவாக்க முடியவில்லை, இது ஏற்கனவே உள்ளது:

# BaseExternalLibraryFeature#8
source: Playlist Creation Failed
ta: பிளேலிச்ட் உருவாக்கம் தோல்வியடைந்தது

# BaseExternalLibraryFeature#9
source: An unknown error occurred while creating playlist:
ta: பிளேலிச்ட்டை உருவாக்கும் போது அறியப்படாத பிழை ஏற்பட்டது:

# BasePlaylistFeature#1
source: New Playlist
ta: புதிய இசைப்பட்டியல்

# BasePlaylistFeature#2
source: Add to Auto DJ Queue (bottom)
ta: ஆட்டோ DJ வரிசையில் சேர் (கீழே)

# BasePlaylistFeature#3
source: Create New Playlist
ta: புதிய பிளேலிச்ட்டை உருவாக்கவும்

# BasePlaylistFeature#4
source: Add to Auto DJ Queue (top)
ta: ஆட்டோ DJ வரிசையில் சேர் (மேல்)

# BasePlaylistFeature#5
source: Remove
ta: நீக்குக

# BasePlaylistFeature#6
source: Rename
ta: மறுபெயரிடுக

# BasePlaylistFeature#7
source: Lock
ta: பூட்டு

# BasePlaylistFeature#8
source: Duplicate
ta: நகல்

# BasePlaylistFeature#9
source: Import Playlist
ta: இசைப்பட்டியல் இறக்குமதி செய்

# BasePlaylistFeature#10
source: Export Track Files
ta: ட்ராக் கோப்புகளை ஏற்றுமதி செய்யவும்

source: Analyze entire Playlist
ta: முழு பிளேலிச்ட்டையும் பகுப்பாய்வு செய்யுங்கள்

source: Enter new name for playlist:
ta: பிளேலிச்ட்டுக்கான புதிய பெயரை உள்ளிடவும்:

source: Duplicate Playlist
ta: நகல் பிளேலிச்ட்

# BasePlaylistFeature#14
source: Enter name for new playlist:
ta: புதிய பிளேலிச்ட்டுக்கான பெயரை உள்ளிடவும்:

source: Export Playlist
ta: இசைப்பட்டியல் ஏற்றுமதி செய்

# BasePlaylistFeature#16
source: Add to Auto DJ Queue (replace)
ta: ஆட்டோ டிசே வரிசையில் சேர் (மாற்று)

source: Rename Playlist
ta: இசைப்பட்டியலை மறுபெயரிடு

source: Renaming Playlist Failed
ta: பிளேலிச்ட்டை மறுபெயரிடுவதில் தோல்வி

# BasePlaylistFeature#19
source: A playlist by that name already exists.
ta: அந்த பெயரில் ஒரு பிளேலிச்ட் ஏற்கனவே உள்ளது.

# BasePlaylistFeature#20
source: A playlist cannot have a blank name.
ta: பிளேலிச்ட்டில் வெற்றுப் பெயர் இருக்கக்கூடாது.

# //:
source: _copy
ta: _நகல்

# BasePlaylistFeature#22
source: Playlist Creation Failed
ta: பிளேலிச்ட் உருவாக்கம் தோல்வியடைந்தது

# BasePlaylistFeature#23
source: An unknown error occurred while creating playlist:
ta: பிளேலிச்ட்டை உருவாக்கும் போது அறியப்படாத பிழை ஏற்பட்டது:

# BasePlaylistFeature#24
source: Confirm Deletion
ta: நீக்குதலை உறுதிப்படுத்தவும்

source: Do you really want to delete playlist <b>%1</b>?
ta: பிளேலிச்ட்டை <b>%1</b> நீக்க வேண்டுமா?

# BasePlaylistFeature#26
source: M3U Playlist (*.m3u)
ta: M3U பிளேலிச்ட் (*.m3u)

# BasePlaylistFeature#27
source: M3U Playlist (*.m3u);;M3U8 Playlist (*.m3u8);;PLS Playlist (*.pls);;Text CSV (*.csv);;Readable Text (*.txt)
ta: M3U பிளேலிச்ட் (*.m3u);;M3U8 பிளேலிச்ட் (*.m3u8);;PLS பிளேலிச்ட் (*.pls);;உரை காபிம (*.csv);; படிக்கக்கூடிய உரை (*.txt)

source: Timestamp
ta: நேர முத்திரை

source: Couldn't load track.
ta: டிராக்கை ஏற்ற முடியவில்லை.

# BaseTrackTableModel#1
source: Album
ta: ஆல்பம்

# BaseTrackTableModel#2
source: Album Artist
ta: ஆல்பம் கலைஞர்

# BaseTrackTableModel#3
source: Artist
ta: கலைஞர்

# BaseTrackTableModel#4
source: Bitrate
ta: பிட்ரேட்

# BaseTrackTableModel#5
source: BPM
ta: பிபிஎம்

# BaseTrackTableModel#6
source: Channels
ta: சேனல்கள்

# BaseTrackTableModel#7
source: Color
ta: நிறம்

# BaseTrackTableModel#8
source: Comment
ta: கருத்து

# BaseTrackTableModel#9
source: Composer
ta: இசையமைப்பாளர்

# BaseTrackTableModel#10
source: Cover Art
ta: கவர் கலை

source: Date Added
ta: தேதி சேர்க்கப்பட்டது

source: Last Played
ta: கடைசியாக விளையாடியது

# BaseTrackTableModel#13
source: Duration
ta: கால அளவு

# BaseTrackTableModel#14
source: Type
ta: வகை

# BaseTrackTableModel#15
source: Genre
ta: வகை

# BaseTrackTableModel#16
source: Grouping
ta: குழுவாக்கம்

# BaseTrackTableModel#17
source: Key
ta: முக்கிய

# BaseTrackTableModel#18
source: Location
ta: இடம்

# BaseTrackTableModel#19
source: Preview
ta: முன்னோட்டம்

# BaseTrackTableModel#20
source: Rating
ta: செயல்வரம்பு

# BaseTrackTableModel#21
source: ReplayGain
ta: மீண்டும் விளையாடு

source: Samplerate
ta: மாதிரி

source: Played
ta: விளையாடியது

# BaseTrackTableModel#24
source: Title
ta: தலைப்பு

# BaseTrackTableModel#25
source: Track #
ta: தடம் #

# BaseTrackTableModel#26
source: Year
ta: ஆண்டு

source: Fetching image ...
ta: படத்தை எடுக்கிறது...

# BroadcastManager#1
source: Action failed
ta: செயல் தோல்வியடைந்தது

source: Please enable at least one connection to use Live Broadcasting.
ta: நேரடி ஒளிபரப்பைப் பயன்படுத்த குறைந்தபட்சம் ஒரு இணைப்பை இயக்கவும்.

source: Can't use secure password storage: keychain access failed.
ta: பாதுகாப்பான கடவுச்சொல் சேமிப்பகத்தைப் பயன்படுத்த முடியாது: சாவிக்கொத்தை அணுகல் தோல்வியடைந்தது.

source: Secure password retrieval unsuccessful: keychain access failed.
ta: பாதுகாப்பான கடவுச்சொல் மீட்டெடுப்பு தோல்வியடைந்தது: சாவிக்கொத்தை அணுகல் தோல்வியடைந்தது.

source: Settings error
ta: அமைப்புகளில் பிழை

source: <b>Error with settings for '%1':</b><br>
ta: <b>'%1'க்கான அமைப்புகளில் பிழை:</b><br>

# BroadcastSettingsModel#1
source: Enabled
ta: இயக்கப்பட்டது

# BroadcastSettingsModel#2
source: Name
ta: பெயர்

source: Status
ta: நிலை

source: Disconnected
ta: துண்டிக்கப்பட்டது

source: Connecting...
ta: இணைக்கிறது...

source: Connected
ta: இணைக்கப்பட்டது

source: Failed
ta: தோல்வியடைந்தது

# BroadcastSettingsModel#8
source: Unknown
ta: தெரியவில்லை

source: Add to Quick Links
ta: விரைவு இணைப்புகளில் சேர்க்கவும்

source: Remove from Quick Links
ta: விரைவு இணைப்புகளிலிருந்து அகற்று

source: Add to Library
ta: நூலகத்தில் சேர்

source: Refresh directory tree
ta: அடைவு மரத்தைப் புதுப்பிக்கவும்

source: Quick Links
ta: விரைவு இணைப்புகள்

source: Devices
ta: சாதனங்கள்

source: Removable Devices
ta: நீக்கக்கூடிய சாதனங்கள்

source: Computer
ta: கணிப்பொறி, கணிணி

# BrowseFeature#9
source: Music Directory Added
ta: இசை அடைவு சேர்க்கப்பட்டது

# BrowseFeature#10
source: You added one or more music directories. The tracks in these directories won't be available until you rescan your library. Would you like to rescan now?
ta: ஒன்று அல்லது அதற்கு மேற்பட்ட இசை கோப்பகங்களைச் சேர்த்துள்ளீர்கள். உங்கள் லைப்ரரியை மீண்டும் வருடு செய்யும் வரை இந்த கோப்பகங்களில் உள்ள டிராக்குகள் கிடைக்காது. இப்போது மீண்டும் வருடு செய்ய விரும்புகிறீர்களா?

# BrowseFeature#11
source: Scan
ta: வருடு செய்யவும்

source: "Computer" lets you navigate, view, and load tracks from folders on your hard disk and external devices.
ta: "கணினி" உங்கள் ஆர்ட் டிச்க் மற்றும் வெளிப்புற சாதனங்களில் உள்ள கோப்புறைகளிலிருந்து டிராக்குகளை வழிநடத்தவும், பார்க்கவும் மற்றும் ஏற்றவும் உங்களை அனுமதிக்கிறது.

# BrowseTableModel#1
source: Preview
ta: முன்னோட்டம்

source: Filename
ta: கோப்புப்பெயர்

# BrowseTableModel#3
source: Artist
ta: கலைஞர்

# BrowseTableModel#4
source: Title
ta: தலைப்பு

# BrowseTableModel#5
source: Album
ta: ஆல்பம்

# BrowseTableModel#6
source: Track #
ta: தடம் #

# BrowseTableModel#7
source: Year
ta: ஆண்டு

# BrowseTableModel#8
source: Genre
ta: வகை

# BrowseTableModel#9
source: Composer
ta: இசையமைப்பாளர்

# BrowseTableModel#10
source: Comment
ta: கருத்து

# BrowseTableModel#11
source: Duration
ta: கால அளவு

# BrowseTableModel#12
source: BPM
ta: பிபிஎம்

# BrowseTableModel#13
source: Key
ta: முக்கிய

# BrowseTableModel#14
source: Type
ta: வகை

# BrowseTableModel#15
source: Bitrate
ta: பிட்ரேட்

# BrowseTableModel#16
source: ReplayGain
ta: மீண்டும் விளையாடு

# BrowseTableModel#17
source: Location
ta: இடம்

# BrowseTableModel#18
source: Album Artist
ta: ஆல்பம் கலைஞர்

# BrowseTableModel#19
source: Grouping
ta: குழுவாக்கம்

source: File Modified
ta: கோப்பு மாற்றப்பட்டது

source: File Created
ta: கோப்பு உருவாக்கப்பட்டது

source: Mixxx Library
ta: Mixxx நூலகம்

source: Could not load the following file because it is in use by Mixxx or another application.
ta: Mixxx அல்லது வேறொரு பயன்பாட்டினால் பின்வரும் கோப்பை ஏற்ற முடியவில்லை.

source: USB Controller
ta: USB கட்டுப்படுத்தி

source: The file '%1' could not be found.
ta: '% 1' கோப்பைக் கண்டுபிடிக்க முடியவில்லை.

source: The file '%1' could not be loaded.
ta: '% 1' கோப்பை ஏற்ற முடியவில்லை.

source: The file '%1' is empty and could not be loaded.
ta: '% 1' கோப்பு காலியாக உள்ளது மற்றும் ஏற்ற முடியவில்லை.

source: Mixxx is an open source DJ software. For more information, see:
ta: Mixxx ஒரு திறந்த மூல DJ மென்பொருள். மேலும் தகவலுக்கு, பார்க்கவும்:

source: Starts Mixxx in full-screen mode
ta: முழுத்திரை பயன்முறையில் Mixxxஐத் தொடங்குகிறது

source: Use a custom locale for loading translations. (e.g 'fr')
ta: மொழிபெயர்ப்புகளை ஏற்றுவதற்கு தனிப்பயன் மொழியைப் பயன்படுத்தவும். (எ.கா. 'fr')

source: Top-level directory where Mixxx should look for its resource files such as MIDI mappings, overriding the default installation location.
ta: மிக்ச்எக்ச் அதன் ஆதாரக் கோப்புகளான எம்ஐடிஐ மேப்பிங்ச், இயல்புநிலை நிறுவல் இருப்பிடத்தை மீறும் உயர்நிலை கோப்பகம்.

source: Path the debug statistics time line is written to
ta: பிழைத்திருத்த புள்ளியியல் நேரக் கோடு எழுதப்பட்ட பாதை

source: Causes Mixxx to display/log all of the controller data it receives and script functions it loads
ta: Mixxx ஆனது அது பெறும் அனைத்து கட்டுப்படுத்தி தரவுகளையும் அது ஏற்றும் ச்கிரிப்ட் செயல்பாடுகளையும் காண்பிக்க/பதிவு செய்ய காரணமாகிறது

source: The controller mapping will issue more aggressive warnings and errors when detecting misuse of controller APIs. New Controller Mappings should be developed with this option enabled!
ta: கன்ட்ரோலர் மேப்பிங், கன்ட்ரோலர் ஏபிஐகளின் தவறான பயன்பாட்டைக் கண்டறியும் போது மிகவும் தீவிரமான எச்சரிக்கைகள் மற்றும் பிழைகளை வழங்கும். இந்த விருப்பத்தை இயக்கி புதிய கன்ட்ரோலர் மேப்பிங்ச் உருவாக்கப்பட வேண்டும்!

source: Enables developer-mode. Includes extra log info, stats on performance, and a Developer tools menu.
ta: உருவாக்குபவர் பயன்முறையை இயக்குகிறது. கூடுதல் பதிவுத் செய்தி, செயல்திறன் பற்றிய புள்ளிவிவரங்கள் மற்றும் உருவாக்குபவர் கருவிகள் பட்டியல் ஆகியவை அடங்கும்.

source: Top-level directory where Mixxx should look for settings. Default is:
ta: Mixxx அமைப்புகளைத் தேட வேண்டிய உயர்மட்ட கோப்பகம். இயல்புநிலை:

source: Starts Auto DJ when Mixxx is launched.
ta: Mixxx தொடங்கப்படும் போது தானி DJ ஐத் தொடங்குகிறது.

source: Use legacy vu meter
ta: மரபு வூ மீட்டரைப் பயன்படுத்தவும்

source: Use legacy spinny
ta: பாரம்பரிய ச்பின்னியைப் பயன்படுத்தவும்

source: Loads experimental QML GUI instead of legacy QWidget skin
ta: பாரம்பரிய QWidget தோலுக்குப் பதிலாக சோதனை QML GUI ஐ ஏற்றுகிறது

source: Enables safe-mode. Disables OpenGL waveforms, and spinning vinyl widgets. Try this option if Mixxx is crashing on startup.
ta: பாதுகாப்பான பயன்முறையை இயக்குகிறது. OpenGL அலைவடிவங்கள் மற்றும் சுழலும் வினைல் விட்செட்களை முடக்குகிறது. தொடக்கத்தில் Mixxx செயலிழந்தால் இந்த விருப்பத்தை முயற்சிக்கவும்.

source: [auto|always|never] Use colors on the console output.
ta: [தானியங்கு|எப்போதும்|ஒருபோதும்] கன்சோல் வெளியீட்டில் வண்ணங்களைப் பயன்படுத்தவும்.

source: Sets the verbosity of command line logging. critical - Critical/Fatal only warning - Above + Warnings info - Above + Informational messages debug - Above + Debug/Developer messages trace - Above + Profiling messages
ta: கட்டளை வரி லாக்கிங்கின் verbosity ஐ அமைக்கிறது. முக்கியமான - முக்கியமான/அபாயகரமானது மட்டுமே முன்னறிவிப்பு - மேலே + எச்சரிக்கைகள் செய்தி - மேலே + செய்தி செய்திகள் பிழைத்திருத்தம் - மேலே + பிழைத்திருத்தம்/டெவலப்பர் செய்திகள் ட்ரேச் - மேலே + விவரக்குறிப்பு செய்திகள்

source: Sets the the logging level at which the log buffer is flushed to mixxx.log. <level> is one of the values defined at --log-level above.
ta: பதிவு இடையகமானது mixxx.log க்கு ஃப்ளச் செய்யப்பட்ட லாக்கிங் அளவை அமைக்கிறது. <level> என்பது மேலே --log-level இல் வரையறுக்கப்பட்ட மதிப்புகளில் ஒன்றாகும்.

source: Sets the maximum file size of the mixxx.log file in bytes. Use -1 for unlimited. The default is 100 MB as 1e5 or 100000000.
ta: mixxx.log கோப்பின் அதிகபட்ச கோப்பு அளவை பைட்டுகளில் அமைக்கிறது. வரம்பற்றதாக -1 பயன்படுத்தவும். இயல்புநிலை 100 எம்பி 1e5 அல்லது 100000000 ஆக உள்ளது.

source: Breaks (SIGINT) Mixxx, if a DEBUG_ASSERT evaluates to false. Under a debugger you can continue afterwards.
ta: முறிவுகள் (SIGINT) Mixxx, ஒரு DEBUG_ASSERT தவறாக மதிப்பிட்டால். பிழைத்திருத்தியின் கீழ் நீங்கள் அதன் பிறகு தொடரலாம்.

source: Overrides the default application GUI style. Possible values: %1
ta: இயல்புநிலை பயன்பாட்டு GUI பாணியை மீறுகிறது. சாத்தியமான மதிப்புகள்:% 1

source: Load the specified music file(s) at start-up. Each file you specify will be loaded into the next virtual deck.
ta: தொடக்கத்தில் குறிப்பிட்ட இசைக் கோப்பை(களை) ஏற்றவும். நீங்கள் குறிப்பிடும் ஒவ்வொரு கோப்பும் அடுத்த விர்ச்சுவல் டெக்கில் ஏற்றப்படும்.

source: Remove Color
ta: நிறத்தை அகற்று

source: Add Color
ta: வண்ணத்தைச் சேர்க்கவும்

# ColorPaletteEditor#3
source: Name
ta: பெயர்

source: Remove Palette
ta: தட்டு அகற்று

# ColorPaletteEditor#5
source: Color
ta: நிறம்

source: Assign to Hotcue Number
ta: Hotcue எண்ணுக்கு ஒதுக்கவும்

source: Edited
ta: திருத்தப்பட்டது

source: Do you really want to remove the palette permanently?
ta: நீங்கள் உண்மையில் தட்டுகளை நிரந்தரமாக அகற்ற விரும்புகிறீர்களா?

source: No control chosen.
ta: எந்த கட்டுப்பாடும் தேர்ந்தெடுக்கப்படவில்லை.

source: Group
ta: குழு

source: Item
ta: பொருள்

source: Value
ta: மதிப்பு

source: Parameter
ta: கூறளவு

# ControlModel#5
source: Title
ta: தலைப்பு

# ControlModel#6
source: Description
ta: விவரம்

source: Headphone Output
ta: தலையணி வெளியீடு

# ControlPickerMenu#2
source: Deck %1
ta: தளம்% 1

# ControlPickerMenu#3
source: Sampler %1
ta: மாதிரி% 1

source: Preview Deck %1
ta: டெக்% 1 முன்னோட்டம்

source: Microphone %1
ta: மைக்ரோஃபோன்% 1

source: Auxiliary %1
ta: துணை% 1

source: Reset to default
ta: இயல்புநிலைக்கு மீட்டமைக்கவும்

source: Effect Rack %1
ta: விளைவு ரேக்% 1

source: Parameter %1
ta: அளவுரு% 1

# ControlPickerMenu#10
source: Mixer
ta: கலப்பி

# ControlPickerMenu#11
source: Crossfader
ta: கிராச்ஃபேடர்

source: Headphone mix (pre/main)
ta: எட்ஃபோன் கலவை (முன்/முதன்மை)

source: Toggle headphone split cueing
ta: எட்ஃபோன் ச்பிலிட் க்யூயிங்கை நிலைமாற்று

source: Headphone delay
ta: எட்ஃபோன் நேரந்தவறுகை

source: Transport
ta: போக்குவரத்து

source: Strip-search through track
ta: டிராக் மூலம் ச்ட்ரிப்-தேடல்

source: Play button
ta: பிளே பட்டன்

source: Set to full volume
ta: முழு ஒலியளவிற்கு அமைக்கவும்

source: Set to zero volume
ta: சுழிய தொகுதிக்கு அமைக்கவும்

source: Stop button
ta: நிறுத்து பொத்தான்

source: Jump to start of track and play
ta: தடத்தின் தொடக்கத்திற்குச் சென்று விளையாடுங்கள்

source: Jump to end of track
ta: பாதையின் இறுதிக்குச் செல்லவும்

source: Reverse roll (Censor) button
ta: தலைகீழ் ரோல் (சென்சார்) பொத்தான்

source: Headphone listen button
ta: எட்ஃபோன் கேட்கும் பொத்தான்

source: Mute button
ta: முடக்கு பொத்தான்

source: Toggle repeat mode
ta: திரும்ப திரும்ப பயன்முறையை நிலைமாற்று

source: Mix orientation (e.g. left, right, center)
ta: கலவை நோக்குநிலை (எ.கா. இடது, வலது, மையம்)

source: Set mix orientation to left
ta: கலவை நோக்குநிலையை இடதுபுறமாக அமைக்கவும்

source: Set mix orientation to center
ta: கலவை நோக்குநிலையை மையமாக அமைக்கவும்

source: Set mix orientation to right
ta: கலவை நோக்குநிலையை வலதுபுறமாக அமைக்கவும்

source: Toggle slip mode
ta: ச்லிப் பயன்முறையை நிலைமாற்று

# ControlPickerMenu#32
source: BPM
ta: பிபிஎம்

source: Increase BPM by 1
ta: BPM ஐ 1 ஆல் அதிகரிக்கவும்

source: Decrease BPM by 1
ta: BPM ஐ 1 ஆல் குறைக்கவும்

source: Increase BPM by 0.1
ta: BPM ஐ 0.1 ஆல் அதிகரிக்கவும்

source: Decrease BPM by 0.1
ta: BPM ஐ 0.1 ஆல் குறைக்கவும்

source: BPM tap button
ta: BPM தட்டு பட்டன்

source: Toggle quantize mode
ta: அளவு பயன்முறையை நிலைமாற்று

source: One-time beat sync (tempo only)
ta: ஒரு முறை பீட் ஒத்திசைவு (டெம்போ மட்டும்)

source: One-time beat sync (phase only)
ta: ஒரு முறை பீட் ஒத்திசைவு (கட்டம் மட்டும்)

source: Toggle keylock mode
ta: கீலாக் பயன்முறையை நிலைமாற்று

source: Equalizers
ta: சமநிலைப்படுத்திகள்

# ControlPickerMenu#43
source: Vinyl Control
ta: வினைல் கட்டுப்பாடு

source: Toggle vinyl-control cueing mode (OFF/ONE/HOT)
ta: வினைல்-கட்டுப்பாட்டு கியூயிங் பயன்முறையை நிலைமாற்று (ஆஃப்/ஒன்/ஆட்)

source: Toggle vinyl-control mode (ABS/REL/CONST)
ta: வினைல்-கட்டுப்பாட்டு பயன்முறையை நிலைமாற்று (ABS/REL/CONST)

source: Pass through external audio into the internal mixer
ta: வெளிப்புற ஆடியோ மூலம் உள் கலவையில் அனுப்பவும்

source: Cues
ta: குறிப்புகள்

source: Cue button
ta: குறி பொத்தான்

source: Set cue point
ta: குறிப் புள்ளியை அமைக்கவும்

source: Go to cue point
ta: குறிப் புள்ளிக்குச் செல்லவும்

source: Go to cue point and play
ta: க்யூ பாயிண்டிற்குச் சென்று விளையாடுங்கள்

source: Go to cue point and stop
ta: க்யூ பாயிண்டிற்குச் சென்று நிறுத்துங்கள்

source: Preview from cue point
ta: க்யூ பாயிண்டிலிருந்து முன்னோட்டம்

source: Cue button (CDJ mode)
ta: க்யூ பொத்தான் (CDJ பயன்முறை)

source: Stutter cue
ta: திணறல் குறி

# ControlPickerMenu#56
source: Hotcues
ta: ஆட்குச்

source: Set, preview from or jump to hotcue %1
ta: ஆட்கியூ % 1 இலிருந்து அமை, முன்னோட்டம் அல்லது தாவி

source: Clear hotcue %1
ta: ஆட்கியூ % 1ஐ அழிக்கவும்

source: Set hotcue %1
ta: ஆட்கியூ % 1ஐ அமைக்கவும்

source: Jump to hotcue %1
ta: ஆட்கியூ % 1க்கு செல்லவும்

source: Jump to hotcue %1 and stop
ta: ஆட்கியூ % 1 க்குச் சென்று நிறுத்தவும்

source: Jump to hotcue %1 and play
ta: ஆட்கியூ % 1க்கு சென்று விளையாடவும்

source: Preview from hotcue %1
ta: ஆட்கியூ% 1 இலிருந்து முன்னோட்டம்

source: Hotcue %1
ta: ஆட்கியூ% 1

source: Looping
ta: லூப்பிங்

source: Loop In button
ta: லூப் இன் பொத்தான்

source: Loop Out button
ta: லூப் அவுட் பொத்தான்

source: Loop Exit button
ta: லூப் வெளியேறு பொத்தான்

source: Move loop forward by %1 beats
ta: லூப்பை முன்னோக்கி % 1 பீட்ச் மூலம் நகர்த்தவும்

source: Move loop backward by %1 beats
ta: லூப்பை % 1 அடிகளால் பின்னோக்கி நகர்த்தவும்

source: Create %1-beat loop
ta: % 1-பீட் லூப்பை உருவாக்கவும்

source: Create temporary %1-beat loop roll
ta: தற்காலிக %1-பீட் லூப் ரோலை உருவாக்கவும்

# ControlPickerMenu#81
source: Library
ta: நூலகம்

source: Slot %1
ta: ச்லாட்% 1

# ControlPickerMenu#83
source: Headphone Mix
ta: எட்ஃபோன் கலவை

# ControlPickerMenu#84
source: Headphone Split Cue
ta: எட்ஃபோன் ச்பிளிட் கியூ

source: Headphone Delay
ta: எட்ஃபோன் நேரந்தவறுகை

# ControlPickerMenu#86
source: Play
ta: விளையாடு

# ControlPickerMenu#87
source: Fast Rewind
ta: ஃபாச்ட் ரிவைண்ட்

source: Fast Rewind button
ta: ஃபாச்ட் ரிவைண்ட் பொத்தான்

# ControlPickerMenu#89
source: Fast Forward
ta: வேகமாக முன்னோக்கி

source: Fast Forward button
ta: வேகமாக முன்னோக்கி பொத்தான்

source: Strip Search
ta: துண்டு தேடல்

source: Play Reverse
ta: தலைகீழாக விளையாடு

source: Play Reverse button
ta: ப்ளே ரிவர்ச் பட்டன்

source: Reverse Roll (Censor)
ta: ரிவர்ச் ரோல் (சென்சார்)

source: Jump To Start
ta: தொடங்க குதிக்கவும்

source: Jumps to start of track
ta: பாதையின் தொடக்கத்திற்கு தாவுகிறது

source: Play From Start
ta: தொடக்கத்தில் இருந்து விளையாடு

source: Stop
ta: நிறுத்து

source: Stop And Jump To Start
ta: தொடங்குவதற்கு நிறுத்தவும் மற்றும் குதிக்கவும்

source: Stop playback and jump to start of track
ta: பிளேபேக்கை நிறுத்திவிட்டு, பாதையின் தொடக்கத்திற்குச் செல்லவும்

source: Jump To End
ta: முடிவுக்கு தாவி

source: Volume
ta: தொகுதி

source: Volume Fader
ta: வால்யூம் ஃபேடர்

source: Full Volume
ta: முழு தொகுதி

source: Zero Volume
ta: சீரோ வால்யூம்

source: Track Gain
ta: ட்ராக் ஆதாயம்

source: Track Gain knob
ta: ட்ராக் கெயின் குமிழ்

# ControlPickerMenu#108
source: Mute
ta: முடக்கு

# ControlPickerMenu#109
source: Eject
ta: வெளியேற்று

source: Headphone Listen
ta: எட்ஃபோன் கேள்

source: Headphone listen (pfl) button
ta: எட்ஃபோன் கேட்பது (pfl) பொத்தான்

source: Repeat Mode
ta: ரிபீட் பயன்முறை

# ControlPickerMenu#113
source: Slip Mode
ta: ச்லிப் பயன்முறை

source: Orientation
ta: நோக்குநிலை

source: Orient Left
ta: ஓரியண்ட் இடது

source: Orient Center
ta: ஓரியண்ட் நடுவண்

source: Orient Right
ta: ஓரியண்ட் ரைட்

source: BPM +1
ta: பிபிஎம் +1

source: BPM -1
ta: பிபிஎம் -1

source: BPM +0.1
ta: பிபிஎம் +0.1

source: BPM -0.1
ta: பிபிஎம் -0.1

# ControlPickerMenu#122
source: BPM Tap
ta: பிபிஎம் தட்டு

source: Adjust Beatgrid Faster +.01
ta: Beatgrid வேகமாக +.01 ஐ சரிசெய்யவும்

source: Increase track's average BPM by 0.01
ta: டிராக்கின் சராசரி BPM ஐ 0.01 ஆல் அதிகரிக்கவும்

source: Adjust Beatgrid Slower -.01
ta: Beatgrid Slower -.01ஐ சரிசெய்யவும்

source: Decrease track's average BPM by 0.01
ta: டிராக்கின் சராசரி BPM ஐ 0.01 ஆல் குறைக்கவும்

source: Move Beatgrid Earlier
ta: முன்னதாக பீட்கிரிட்டை நகர்த்தவும்

source: Adjust the beatgrid to the left
ta: பீட்கிரிட்டை இடதுபுறமாக சரிசெய்யவும்

source: Move Beatgrid Later
ta: பீட்கிரிட்டை பின்னர் நகர்த்தவும்

source: Adjust the beatgrid to the right
ta: பீட்கிரிட்டை வலதுபுறமாக சரிசெய்யவும்

# ControlPickerMenu#131
source: Adjust Beatgrid
ta: Beatgrid ஐ சரிசெய்யவும்

source: Align beatgrid to current position
ta: பீட்கிரிட்டை தற்போதைய நிலைக்கு சீரமைக்கவும்

source: Adjust Beatgrid - Match Alignment
ta: Beatgrid - பொருத்த சீரமைப்பு

# ControlPickerMenu#134
source: Adjust beatgrid to match another playing deck.
ta: மற்றொரு விளையாடும் தளத்துடன் பொருந்துமாறு பீட்கிரிட்டைச் சரிசெய்யவும்.

source: Quantize Mode
ta: அளவீட்டு முறை

# ControlPickerMenu#136
source: Sync
ta: ஒத்திசை

source: Beat Sync One-Shot
ta: பீட் சின்க் ஒன் காட்சி

source: Sync Tempo One-Shot
ta: டெம்போ ஒன்-சாட்டை ஒத்திசைக்கவும்

source: Sync Phase One-Shot
ta: கட்டம் ஒன்று-சாட்டை ஒத்திசைக்கவும்

source: Pitch control (does not affect tempo), center is original pitch
ta: சுருதி கட்டுப்பாடு (டெம்போவை பாதிக்காது), நடுவண் அசல் சுருதி

# ControlPickerMenu#141
source: Pitch Adjust
ta: சுருதி சரி

source: Adjust pitch from speed slider pitch
ta: வேக ச்லைடர் சுருதியிலிருந்து சுருதியை சரிசெய்யவும்

source: Match musical key
ta: இசை விசையை பொருத்து

source: Match Key
ta: போட்டி விசை

source: Reset Key
ta: மீட்டமை விசை

source: Resets key to original
ta: விசையை அசலுக்கு மீட்டமைக்கிறது

# ControlPickerMenu#147
source: High EQ
ta: உயர் ஈக்யூ

# ControlPickerMenu#148
source: Mid EQ
ta: நடு EQ

source: Main Output
ta: முக்கிய வெளியீடு

source: Main Output Balance
ta: முக்கிய வெளியீடு இருப்பு

# ControlPickerMenu#151
source: Main Output Delay
ta: முக்கிய வெளியீடு நேரந்தவறுகை

# ControlPickerMenu#152
source: Main Output Gain
ta: முக்கிய வெளியீடு ஆதாயம்

# ControlPickerMenu#153
source: Low EQ
ta: குறைந்த ஈக்யூ

source: Toggle Vinyl Control
ta: வினைல் கட்டுப்பாட்டை மாற்றவும்

source: Toggle Vinyl Control (ON/OFF)
ta: வினைல் கட்டுப்பாட்டை நிலைமாற்று (ஆன்/ஆஃப்)

# ControlPickerMenu#156
source: Vinyl Control Mode
ta: வினைல் கட்டுப்பாட்டு முறை

source: Vinyl Control Cueing Mode
ta: வினைல் கண்ட்ரோல் கியூயிங் பயன்முறை
