Repository: 247i/TACETr
Catalog: உரை/தானி/moonlight-moonlight-android-*.po
Languages: ta

# scut_deleted_pc
source: PC deleted
ta: பிசி நீக்கப்பட்டது

# scut_not_paired
source: PC not paired
ta: பிசி சோடியாக இல்லை

# scut_pc_not_found
source: PC not found
ta: பிசி கிடைக்கவில்லை

# scut_invalid_uuid
source: Provided PC is not valid
ta: வழங்கப்பட்ட பிசி செல்லுபடியாகாது

# scut_invalid_app_id
source: Provided App is not valid
ta: வழங்கப்பட்ட பயன்பாடு செல்லுபடியாகாது

# help_loading_title
source: Help Viewer
ta: பார்வையாளருக்கு உதவுங்கள்

# help_loading_msg
source: Loading help page…
ta: உதவி பக்கத்தை ஏற்றுகிறது…

# pcview_menu_header_online
source: Online
ta: ஆன்லைனில்

# pcview_menu_header_offline
source: Offline
ta: இணையமில்லாமல்

# pcview_menu_header_unknown
source: Refreshing
ta: புத்துணர்ச்சி

# pcview_menu_app_list
source: View All Apps
ta: எல்லா பயன்பாடுகளையும் காண்க

# pcview_menu_pair_pc
source: Pair with PC
ta: பிசியுடன் இணை

# pcview_menu_unpair_pc
source: Unpair
ta: அவிழ்த்து விடுங்கள்

# pcview_menu_send_wol
source: Send Wake-On-LAN request
ta: வேக்-ஆன்-லான் கோரிக்கையை அனுப்பவும்

# pcview_menu_delete_pc
source: Delete PC
ta: பிசி நீக்கு

# pcview_menu_test_network
source: Test Network Connection
ta: பிணைய இணைப்பை சோதிக்கவும்

# pcview_menu_details
source: View Details
ta: விவரங்களைக் காண்க

# pcview_menu_eol
source: NVIDIA GameStream End-of-Service
ta: என்விடியா கேம்ச்ட்ரீம் சேவையின் இறுதி

# nettest_title_waiting
source: Testing Network Connection
ta: பிணைய இணைப்பை சோதித்தல்

# nettest_text_waiting
source: Moonlight is testing your network connection to determine if any required ports are blocked. This may take a few seconds…
ta: தேவையான துறைமுகங்கள் தடுக்கப்பட்டுள்ளதா என்பதை தீர்மானிக்க மூன்லைட் உங்கள் பிணைய இணைப்பை சோதிக்கிறது. இதற்கு சில வினாடிகள் ஆகலாம்…

# nettest_title_done
source: Network Test Complete
ta: பிணைய சோதனை முடிந்தது

# nettest_text_success
source: Your network does not appear to be blocking Moonlight. If you still have trouble connecting, check your PC's firewall settings. If you are trying to stream over the Internet, install the Moonlight Internet Hosting Tool on your PC and run the included Internet Streaming Tester to check your PC's Internet connection.
ta: உங்கள் பிணையம் நிலவொளியைத் தடுப்பதாகத் தெரியவில்லை. இணைப்பதில் உங்களுக்கு இன்னும் சிக்கல் இருந்தால், உங்கள் கணினியின் ஃபயர்வால் அமைப்புகளை சரிபார்க்கவும். நீங்கள் இணையத்தில் ச்ட்ரீம் செய்ய முயற்சிக்கிறீர்கள் என்றால், உங்கள் கணினியில் மூன்லைட் இணைய ஓச்டிங் கருவியை நிறுவி, உங்கள் கணினியின் இணைய இணைப்பை சரிபார்க்க சேர்க்கப்பட்ட இணைய ச்ட்ரீமிங் சோதனையாளரை இயக்கவும்.

# nettest_text_inconclusive
source: The network test could not be performed because none of Moonlight's connection testing servers were reachable. Check your Internet connection or try again later.
ta: பிணையம் சோதனையை செய்ய முடியவில்லை, ஏனெனில் மூன்லைட்டின் இணைப்பு சோதனை சேவையகங்கள் எதுவும் அடையப்படவில்லை. உங்கள் இணைய இணைப்பைச் சரிபார்க்கவும் அல்லது பின்னர் மீண்டும் முயற்சிக்கவும்.

# nettest_text_failure
source: Your device's current network connection seems to be blocking Moonlight. Streaming over the Internet may not work while connected to this network. The following network ports were blocked:
ta: உங்கள் சாதனத்தின் தற்போதைய பிணைய இணைப்பு நிலவொளியைத் தடுப்பதாகத் தெரிகிறது. இந்த பிணையத்துடன் இணைக்கப்படும்போது இணையத்தில் ச்ட்ரீமிங் வேலை செய்யாது. பின்வரும் பிணைய துறைமுகங்கள் தடுக்கப்பட்டன:

# nettest_text_blocked
source: Your device's current network connection is blocking Moonlight. Streaming over the Internet may not work while connected to this network.
ta: உங்கள் சாதனத்தின் தற்போதைய பிணைய இணைப்பு நிலவொளியைத் தடுக்கிறது. இந்த பிணையத்துடன் இணைக்கப்படும்போது இணையத்தில் ச்ட்ரீமிங் வேலை செய்யாது.

source: Pairing…
ta: இணைத்தல்…

# pair_pc_offline
source: Computer is offline
ta: கணினி ஆஃப்லைனில் உள்ளது

# pair_pc_ingame
source: Computer is currently in a game. You must close the game before pairing.
ta: கணினி தற்போது ஒரு விளையாட்டில் உள்ளது. இணைப்பதற்கு முன் நீங்கள் விளையாட்டை மூட வேண்டும்.

# pair_pairing_title
source: Pairing
ta: இணைத்தல்

# pair_pairing_msg
source: Please enter the following PIN on the target PC:
ta: இலக்கு கணினியில் பின்வரும் முள் உள்ளிடவும்:

# pair_pairing_help
source: If your host PC is running Sunshine, navigate to the Sunshine web UI to enter the PIN.
ta: உங்கள் புரவலன் பிசி சன்சைனை இயக்குகிறது என்றால், முள் நுழைய சன்சைன் வலை இடைமுகம் க்கு செல்லவும்.

# pair_incorrect_pin
source: Incorrect PIN
ta: தவறான முள்

# pair_fail
source: Pairing failed
ta: இணைத்தல் தோல்வியுற்றது

# pair_already_in_progress
source: Pairing already in progress
ta: இணைத்தல் ஏற்கனவே செயலில் உள்ளது

# wol_pc_online
source: Computer is online
ta: கணினி ஆன்லைனில் உள்ளது

# wol_no_mac
source: Unable to wake PC because there is no stored MAC address
ta: சேமிக்கப்பட்ட MAC முகவரி இல்லாததால் கணினியை எழுப்ப முடியவில்லை

# wol_waking_pc
source: Waking PC…
ta: விழித்திருக்கும் பிசி…

# wol_waking_msg
source: It may take a few seconds for your PC to wake up. If it doesn't, make sure it's configured properly for Wake-On-LAN.
ta: உங்கள் பிசி எழுந்திருக்க சில வினாடிகள் ஆகலாம். அவ்வாறு இல்லையென்றால், அது வேக்-ஆன்-லானுக்கு சரியாக கட்டமைக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# wol_fail
source: Failed to send Wake-On-LAN packets
ta: வேக்-ஆன்-லான் பாக்கெட்டுகளை அனுப்புவதில் தோல்வி

source: Unpairing…
ta: அவிழ்த்து விடுங்கள்…

# unpair_success
source: Unpaired successfully
ta: வெற்றிகரமாக இணைக்கப்படாதது

# unpair_fail
source: Failed to unpair
ta: அவிழ்க்கத் தவறிவிட்டது

# unpair_error
source: Device was not paired
ta: சாதனம் இணைக்கப்படவில்லை

# error_pc_offline
source: Computer is offline
ta: கணினி ஆஃப்லைனில் உள்ளது

# error_manager_not_running
source: The ComputerManager service is not running. Please wait a few seconds or restart the app.
ta: கம்ப்யூட்டர்மேனேசர் பணி இயங்கவில்லை. தயவுசெய்து சில வினாடிகள் காத்திருங்கள் அல்லது பயன்பாட்டை மறுதொடக்கம் செய்யுங்கள்.

# error_unknown_host
source: Failed to resolve host
ta: ஓச்டைத் தீர்க்கத் தவறிவிட்டது

# error_404
source: GFE returned an HTTP 404 error. Make sure your PC is running a supported GPU. Using remote desktop software can also cause this error. Try rebooting your machine or reinstalling GFE.
ta: GFE ஒரு HTTP 404 பிழையை வழங்கியது. உங்கள் பிசி ஆதரிக்கப்பட்ட சி.பீ.யுவை இயக்குகிறது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். தொலைநிலை டெச்க்டாப் மென்பொருளைப் பயன்படுத்துவதும் இந்த பிழையை ஏற்படுத்தும். உங்கள் இயந்திரத்தை மறுதொடக்கம் செய்ய முயற்சிக்கவும் அல்லது GFE ஐ மீண்டும் நிறுவவும் முயற்சிக்கவும்.

# title_decoding_error
source: Video Decoder Crashed
ta: வீடியோ டிகோடர் செயலிழந்தது

# message_decoding_error
source: Moonlight has crashed due to an incompatibility with this device's video decoder. Try adjusting the streaming settings if the crashes continue.
ta: இந்த சாதனத்தின் வீடியோ டிகோடருடன் பொருந்தாத தன்மை காரணமாக மூன்லைட் செயலிழந்துள்ளது. செயலிழப்புகள் தொடர்ந்தால் ச்ட்ரீமிங் அமைப்புகளை சரிசெய்ய முயற்சிக்கவும்.

# title_decoding_reset
source: Video Settings Reset
ta: வீடியோ அமைப்புகள் மீட்டமைக்கப்படுகின்றன

# message_decoding_reset
source: Your device's video decoder continues to crash at your selected streaming settings. Your streaming settings have been reset to default.
ta: உங்கள் சாதனத்தின் வீடியோ டிகோடர் நீங்கள் தேர்ந்தெடுத்த ச்ட்ரீமிங் அமைப்புகளில் தொடர்ந்து செயலிழந்து வருகிறது. உங்கள் ச்ட்ரீமிங் அமைப்புகள் இயல்புநிலைக்கு மீட்டமைக்கப்பட்டுள்ளன.

# error_usb_prohibited
source: USB access is prohibited by your device administrator. Check your Knox or MDM settings.
ta: உங்கள் சாதன நிர்வாகியால் யூ.எச்.பி அணுகல் தடைசெய்யப்பட்டுள்ளது. உங்கள் நாக்ச் அல்லது எம்.டி.எம் அமைப்புகளை சரிபார்க்கவும்.

# unable_to_pin_shortcut
source: Your current launcher does not allow for creating pinned shortcuts.
ta: உங்கள் தற்போதைய துவக்கி பின் செய்யப்பட்ட குறுக்குவழிகளை உருவாக்க அனுமதிக்காது.

# video_decoder_init_failed
source: Video decoder failed to initialize. Your device may not support the selected resolution or frame rate.
ta: வீடியோ டிகோடர் துவக்கத் தவறிவிட்டது. தேர்ந்தெடுக்கப்பட்ட தீர்மானம் அல்லது பிரேம் வீதத்தை உங்கள் சாதனம் ஆதரிக்காது.

# no_video_received_error
source: No video received from host.
ta: ஓச்டிலிருந்து எந்த வீடியோவும் பெறப்படவில்லை.

# no_frame_received_error
source: Your network connection isn't performing well. Reduce your video bitrate setting or try a faster connection.
ta: உங்கள் பிணைய இணைப்பு சிறப்பாக செயல்படவில்லை. உங்கள் வீடியோ பிட்ரேட் அமைப்பைக் குறைக்கவும் அல்லது வேகமான இணைப்பை முயற்சிக்கவும்.

# early_termination_error
source: Something went wrong on your host PC when starting the stream. Make sure you don't have any DRM-protected content open on your host PC. You can also try restarting your host PC.
ta: ச்ட்ரீமைத் தொடங்கும்போது உங்கள் புரவலன் கணினியில் ஏதோ தவறு ஏற்பட்டது. உங்கள் புரவலன் கணினியில் டி.ஆர்.எம்-பாதுகாக்கப்பட்ட உள்ளடக்கம் திறக்கப்படவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். உங்கள் புரவலன் கணினியை மறுதொடக்கம் செய்ய முயற்சி செய்யலாம்.

# frame_conversion_error
source: The host PC reported a fatal video encoding error. Try disabling HDR mode, changing the streaming resolution, or changing your host PC's display resolution.
ta: புரவலன் பிசி ஒரு அபாயகரமான வீடியோ குறியாக்க பிழையை அறிவித்தது. எச்டிஆர் பயன்முறையை முடக்க முயற்சிக்கவும், ச்ட்ரீமிங் தீர்மானத்தை மாற்றவும் அல்லது உங்கள் புரவலன் கணினியின் காட்சி தெளிவுத்திறனை மாற்றவும் முயற்சிக்கவும்.

# check_ports_msg
source: Check your firewall and port forwarding rules for port(s):
ta: துறைமுகம் (கள்) க்கான உங்கள் ஃபயர்வால் மற்றும் துறைமுகம் பகிர்தல் விதிகளை சரிபார்க்கவும்:

# conn_establishing_title
source: Establishing Connection
ta: இணைப்பை நிறுவுதல்

# conn_establishing_msg
source: Starting connection
ta: இணைப்பு தொடக்க

# conn_metered
source: Warning: Your active network connection is metered!
ta: எச்சரிக்கை: உங்கள் செயலில் உள்ள பிணைய இணைப்பு அளவிடப்படுகிறது!

# conn_client_latency
source: Average frame decoding latency:
ta: சராசரி பிரேம் டிகோடிங் தாமதம்:

# conn_client_latency_hw
source: hardware decoder latency:
ta: வன்பொருள் டிகோடர் தாமதம்:

# conn_hardware_latency
source: Average hardware decoding latency:
ta: சராசரி வன்பொருள் டிகோடிங் தாமதம்:

# conn_starting
source: Starting
ta: தொடங்குகிறது

# conn_error_title
source: Connection Error
ta: இணைப்பு பிழை

# conn_error_msg
source: Failed to start
ta: தொடங்கத் தவறிவிட்டது

# conn_terminated_title
source: Connection Terminated
ta: இணைப்பு நிறுத்தப்பட்டது

# conn_terminated_msg
source: The connection was terminated.
ta: இணைப்பு நிறுத்தப்பட்டது.

# error_code_prefix
source: Error code:
ta: பிழைக் குறியீடு:

# ip_hint
source: IP address of host PC
ta: புரவலன் பிசியின் ஐபி முகவரி

# searching_pc
source: Searching for host PCs on your local network… Ensure Sunshine is running on your host PC or GameStream is enabled in the GeForce Experience SHIELD settings.
ta: உங்கள் உள்ளக நெட்வொர்க்கில் புரவலன் பிசிக்களைத் தேடுகிறது… உங்கள் புரவலன் கணினியில் சன்சைன் இயங்குகிறது என்பதை உறுதிப்படுத்தவும்

source: Yes
ta: ஆம்

source: No
ta: இல்லை

# lost_connection
source: Lost connection to PC
ta: பிசி உடனான இணைப்பு இழந்தது

# title_details
source: Details
ta: விவரங்கள்

source: Help
ta: உதவி

# delete_pc_msg
source: Are you sure you want to delete this PC?
ta: இந்த கணினியை நீக்க விரும்புகிறீர்களா?

# slow_connection_msg
source: Slow connection to PC Reduce your bitrate
ta: பிசிக்கு மெதுவான இணைப்பு உங்கள் பிட்ரேட்டைக் குறைக்கவும்

# poor_connection_msg
source: Poor connection to PC
ta: பிசிக்கு மோசமான இணைப்பு

# perf_overlay_streamdetails
source: Video stream: %1$s %2$.2f FPS
ta: வீடியோ ச்ட்ரீம்: %1$s %2 $ .2F FPS

# perf_overlay_decoder
source: Decoder: %1$s
ta: டிகோடர்: %1$s

# perf_overlay_incomingfps
source: Incoming frame rate from network: %1$.2f FPS
ta: நெட்வொர்க்கிலிருந்து உள்வரும் பிரேம் வீதம்: %1 $ .2F FPS

# perf_overlay_renderingfps
source: Rendering frame rate: %1$.2f FPS
ta: பிரேம் வீதத்தை வழங்குதல் செய்தல்: %1 $ .2F FPS

# perf_overlay_hostprocessinglatency
source: Host processing latency min/max/average: %1$.1f/%2$.1f/%3$.1f ms
ta: புரவலன் செயலாக்க நேரந்தவறுகை நிமிடம்/அதிகபட்சம்/சராசரி:%1 $ .1f/%2 $ .1f/%3 $ .1f MS

# perf_overlay_netdrops
source: Frames dropped by your network connection: %1$.2f%%
ta: உங்கள் பிணைய இணைப்பால் பிரிக்கப்பட்ட பிரேம்கள்:%1 $ .2f %%

# perf_overlay_netlatency
source: Average network latency: %1$d ms (variance: %2$d ms)
ta: சராசரி பிணையம் தாமதம்: %1$d MS (மாறுபாடு: %2$d MS)

# perf_overlay_dectime
source: Average decoding time: %1$.2f ms
ta: சராசரி டிகோடிங் நேரம்: %1 $ .2f எம்.எச்

# applist_connect_msg
source: Connecting to PC…
ta: பிசியுடன் இணைக்கிறது…

# applist_menu_resume
source: Resume Session
ta: அமர்வு மீண்டும் தொடங்குங்கள்

# applist_menu_quit
source: Quit Session
ta: அமர்விலிருந்து வெளியேறுதல்

# applist_menu_quit_and_start
source: Quit Current Game and Start
ta: தற்போதைய விளையாட்டை விட்டுவிட்டு தொடங்குங்கள்

# applist_menu_cancel
source: Cancel
ta: ரத்துசெய்

# applist_menu_details
source: View Details
ta: விவரங்களைக் காண்க

# applist_menu_scut
source: Create Shortcut
ta: குறுக்குவழியை உருவாக்கவும்

# applist_menu_tv_channel
source: Add to Channel
ta: சேனலில் சேர்க்கவும்

# applist_menu_hide_app
source: Hide App
ta: பயன்பாட்டை மறைக்கவும்

# applist_refresh_title
source: App List
ta: பயன்பாட்டு பட்டியல்

# applist_refresh_msg
source: Refreshing apps…
ta: புத்துணர்ச்சியூட்டும் பயன்பாடுகள்…

# applist_refresh_error_title
source: Error
ta: பிழை

# applist_refresh_error_msg
source: Failed to get app list
ta: பயன்பாட்டு பட்டியலைப் பெறுவதில் தோல்வி

# applist_quit_app
source: Quitting
ta: வெளியேறுதல்

# applist_quit_success
source: Successfully quit
ta: வெற்றிகரமாக விலகுங்கள்

# applist_quit_fail
source: Failed to quit
ta: வெளியேறத் தவறிவிட்டது

# applist_quit_confirmation
source: Are you sure you want to quit the running app? All unsaved data will be lost.
ta: இயங்கும் பயன்பாட்டை விட்டு வெளியேற விரும்புகிறீர்களா? சேமிக்கப்படாத அனைத்து தரவும் இழக்கப்படும்.

# applist_details_id
source: App ID:
ta: பயன்பாட்டு ஐடி:

# title_add_pc
source: Add PC Manually
ta: பிசி கைமுறையாக சேர்க்கவும்

# msg_add_pc
source: Connecting to the PC…
ta: கணினியுடன் இணைக்கிறது…

# addpc_fail
source: Unable to connect to the specified computer. Make sure the required ports are allowed through the firewall.
ta: குறிப்பிட்ட கணினியுடன் இணைக்க முடியவில்லை. தேவையான துறைமுகங்கள் ஃபயர்வால் மூலம் அனுமதிக்கப்படுவதை உறுதிசெய்க.

# addpc_success
source: Successfully added computer
ta: வெற்றிகரமாக கணினி சேர்க்கப்பட்டது

# addpc_unknown_host
source: Unable to resolve PC address. Make sure you didn't make a typo in the address.
ta: பிசி முகவரியை தீர்க்க முடியவில்லை. முகவரியில் நீங்கள் எழுத்துப்பிழை செய்யவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# addpc_enter_ip
source: You must enter an IP address
ta: நீங்கள் ஒரு ஐபி முகவரியை உள்ளிட வேண்டும்

# addpc_wrong_sitelocal
source: That address doesn't look right. You must use your router's public IP address for streaming over the Internet.
ta: அந்த முகவரி சரியாகத் தெரியவில்லை. இணையத்தில் ச்ட்ரீமிங் செய்ய உங்கள் திசைவியின் பொது ஐபி முகவரியைப் பயன்படுத்த வேண்டும்.

# category_basic_settings
source: Basic Settings
ta: அடிப்படை அமைப்புகள்

# title_resolution_list
source: Video resolution
ta: வீடியோ தீர்மானம்

# summary_resolution_list
source: Increase to improve image clarity. Decrease for better performance on lower end devices and slower networks.
ta: பட தெளிவை மேம்படுத்த அதிகரிக்கவும். குறைந்த இறுதி சாதனங்கள் மற்றும் மெதுவான நெட்வொர்க்குகளில் சிறந்த செயல்திறனுக்கான குறைவு.

# title_native_res_dialog
source: Native Resolution Warning
ta: சொந்த தீர்மான எச்சரிக்கை

# text_native_res_dialog
source: Native resolution and/or FPS may not be supported by the streaming server. You will probably need to configure a matching custom display mode for the host PC manually. If you choose to create a custom resolution in NVIDIA Control Panel to match your screen settings, please ensure you have read and understood NVIDIA's warning regarding possible monitor damage, PC instability, and other potential problems. We are not responsible for any problems resulting from creating a custom resolution on your PC. It may be that your monitor does not support a necessary display configuration. If so, you may try to set up a virtual monitor. Finally, if your device or host PC does not support streaming at a specific resolution or refresh rate, you're out of luck unfortunately.
ta: நேட்டிவ் தீர்மானம் மற்றும்/அல்லது எஃப்.பி.எச் ச்ட்ரீமிங் சேவையகத்தால் ஆதரிக்கப்படாது. புரவலன் பிசிக்கு கைமுறையாக பொருந்தக்கூடிய தனிப்பயன் காட்சி பயன்முறையை நீங்கள் கட்டமைக்க வேண்டும். உங்கள் திரை அமைப்புகளுடன் பொருந்த என்விடியா கண்ட்ரோல் பேனலில் தனிப்பயன் தீர்மானத்தை உருவாக்க நீங்கள் தேர்வுசெய்தால், தயவுசெய்து மானிட்டர் சேதம், பிசி உறுதியற்ற தன்மை மற்றும் பிற சாத்தியமான சிக்கல்களைப் பற்றி என்விடியாவின் எச்சரிக்கையைப் படித்து புரிந்துகொண்டுள்ளீர்கள் என்பதை உறுதிப்படுத்தவும். உங்கள் கணினியில் தனிப்பயன் தீர்மானத்தை உருவாக்குவதன் விளைவாக ஏற்படும் எந்தவொரு சிக்கலுக்கும் நாங்கள் பொறுப்பல்ல. தேவையான காட்சி உள்ளமைவை உங்கள் மானிட்டர் ஆதரிக்கவில்லை. அப்படியானால், நீங்கள் ஒரு மெய்நிகர் மானிட்டரை அமைக்க முயற்சி செய்யலாம். இறுதியாக, உங்கள் சாதனம் அல்லது புரவலன் பிசி ஒரு குறிப்பிட்ட தீர்மானம் அல்லது புதுப்பிப்பு வீதத்தில் ச்ட்ரீமிங்கை ஆதரிக்கவில்லை என்றால், துரதிர்ச்டவசமாக நீங்கள் அதிர்ச்டம் இல்லை.

# title_fps_list
source: Video frame rate
ta: வீடியோ பிரேம் வீதம்

# summary_fps_list
source: Increase for a smoother video stream. Decrease for better performance on lower end devices.
ta: மென்மையான வீடியோ ச்ட்ரீமுக்கு அதிகரிப்பு. கீழ் இறுதியில் சாதனங்களில் சிறந்த செயல்திறனைக் குறைத்தல்.

# title_seekbar_bitrate
source: Video bitrate
ta: வீடியோ பிட்ரேட்

# summary_seekbar_bitrate
source: Increase for better image quality. Decrease to improve performance on slower connections.
ta: சிறந்த பட தரத்திற்கு அதிகரிக்கவும். மெதுவான இணைப்புகளில் செயல்திறனை மேம்படுத்த குறைவு.

# suffix_seekbar_bitrate_mbps
source: Mbps
ta: எம்.பி.பி.எச்

# title_checkbox_stretch_video
source: Stretch video to full-screen
ta: வீடியோவை முழுத் திரையில் நீட்டவும்

# resolution_prefix_native
source: Native
ta: பழமை

# resolution_prefix_native_fullscreen
source: Native Full-Screen
ta: சொந்த முழு திரை

# resolution_prefix_native_landscape
source: (Landscape)
ta: (நிலப்பரப்பு)

# resolution_prefix_native_portrait
source: (Portrait)
ta: (உருவப்படம்)

# title_native_fps_dialog
source: Native FPS Warning
ta: சொந்த எஃப்.பி.எச் எச்சரிக்கை

# category_audio_settings
source: Audio Settings
ta: ஆடியோ அமைப்புகள்

# title_audio_config_list
source: Surround sound configuration
ta: ஒலி உள்ளமைவை சரவுண்ட் செய்யுங்கள்

# summary_audio_config_list
source: Enable 5.1 or 7.1 surround sound for home-theater systems
ta: வீட்டு-தியேட்டர் அமைப்புகளுக்கு 5.1 அல்லது 7.1 சரவுண்ட் ஒலியை இயக்கவும்

# title_checkbox_enable_audiofx
source: Enable system equalizer support
ta: கணினி சமநிலை ஆதரவை இயக்கவும்

# summary_checkbox_enable_audiofx
source: Allows audio effects to function while streaming, but may increase audio latency
ta: ச்ட்ரீமிங்கின் போது ஆடியோ விளைவுகளை செயல்படுத்த அனுமதிக்கிறது, ஆனால் ஆடியோ தாமதத்தை அதிகரிக்கக்கூடும்

# category_gamepad_settings
source: Gamepad Settings
ta: கேம்பேட் அமைப்புகள்

# title_checkbox_multi_controller
source: Automatic gamepad presence detection
ta: தானியங்கி கேம்பேட் இருப்பு கண்டறிதல்

# summary_checkbox_multi_controller
source: Unchecking this option forces a gamepad to always be present
ta: இந்த விருப்பத்தைத் தேர்வுசெய்வது ஒரு கேம்பேட் எப்போதும் இருக்கும்படி கட்டாயப்படுத்துகிறது

# title_checkbox_vibrate_fallback
source: Emulate rumble support with vibration
ta: அதிர்வுடன் ரம்பிள் ஆதரவைப் பின்பற்றுங்கள்

# summary_checkbox_vibrate_fallback
source: Vibrates your device to emulate rumble if your gamepad does not support it
ta: உங்கள் கேம்பேட் அதை ஆதரிக்கவில்லை என்றால் ரம்பிளைப் பின்பற்ற உங்கள் சாதனத்தை அதிர்வுறும்

# title_seekbar_vibrate_fallback_strength
source: Adjust emulated rumble intensity
ta: முன்மாதிரியான ரம்பிள் தீவிரத்தை சரிசெய்யவும்

# summary_seekbar_vibrate_fallback_strength
source: Amplify or reduce the vibration intensity on your device
ta: உங்கள் சாதனத்தில் அதிர்வு தீவிரத்தை பெருக்கவும் அல்லது குறைக்கவும்

# title_seekbar_deadzone
source: Adjust analog stick deadzone
ta: அனலாக் ச்டிக் டெட்சோனை சரிசெய்யவும்

# summary_seekbar_deadzone
source: Note: Some games can enforce a larger deadzone than what Moonlight is configured to use.
ta: குறிப்பு: சில விளையாட்டுகள் மூன்லைட் பயன்படுத்த கட்டமைக்கப்பட்டதை விட பெரிய டெட் சோனை செயல்படுத்த முடியும்.

# title_checkbox_xb1_driver
source: Xbox 360/One USB gamepad driver
ta: எக்ச்பாக்ச் 360/ஒரு யூ.எச்.பி கேம்பேட் இயக்கி

# summary_checkbox_xb1_driver
source: Enables a built-in USB driver for devices without native Xbox controller support
ta: சொந்த எக்ச்பாக்ச் கட்டுப்படுத்தி உதவி இல்லாத சாதனங்களுக்கான உள்ளமைக்கப்பட்ட யூ.எச்.பி டிரைவரை இயக்குகிறது

# title_checkbox_usb_bind_all
source: Override native Xbox gamepad support
ta: சொந்த எக்ச்பாக்ச் கேம்பேட் ஆதரவை மேலெழுதவும்

# summary_checkbox_usb_bind_all
source: Use Moonlight's USB driver for all supported gamepads, even if native Xbox controller support is present
ta: சொந்த எக்ச்பாக்ச் கட்டுப்படுத்தி உதவி இருந்தாலும், அனைத்து ஆதரிக்கப்பட்ட கேம்பேட்களுக்கும் மூன்லைட்டின் யூ.எச்.பி டிரைவரைப் பயன்படுத்தவும்

# title_checkbox_mouse_emulation
source: Mouse emulation via gamepad
ta: கேம்பேட் வழியாக சுட்டி எமுலேசன்

# summary_checkbox_mouse_emulation
source: Long pressing the Start button will switch the gamepad into mouse mode
ta: தொடக்க பொத்தானை நீண்ட நேரம் அழுத்துவது கேம்பேட்டை சுட்டி பயன்முறையில் மாற்றும்

# title_checkbox_flip_face_buttons
source: Flip face buttons
ta: முகம் பொத்தான்களை புரட்டவும்

# summary_checkbox_flip_face_buttons
source: Switches the face buttons A/B and X/Y for gamepads and the on-screen controls
ta: கேம்பேடுகள் மற்றும் திரையில் கட்டுப்பாடுகளுக்கு முக பொத்தான்கள் A/B மற்றும் X/y ஐ மாற்றுகின்றன

# title_checkbox_gamepad_touchpad_as_mouse
source: Always control mouse with touchpad
ta: டச்பேட் மூலம் எப்போதும் சுட்டியைக் கட்டுப்படுத்தவும்

# summary_checkbox_gamepad_touchpad_as_mouse
source: Forces gamepad touchpad input to control the host mouse, even when emulating a gamepad with a touchpad.
ta: ஒரு கேம்பேட்டை ஒரு டச்பேட் மூலம் பின்பற்றும்போது கூட, புரவலன் சுட்டியைக் கட்டுப்படுத்த கேம்பேட் டச்பேட் உள்ளீட்டை கட்டாயப்படுத்துகிறது.

# title_checkbox_gamepad_motion_sensors
source: Allow use of gamepad motion sensors
ta: கேம்பேட் மோசன் சென்சார்களைப் பயன்படுத்த அனுமதிக்கவும்

# summary_checkbox_gamepad_motion_sensors
source: Enables supported hosts to request motion sensor data when emulating a gamepad with motion sensors. Disabling may slightly reduce power and network usage if motion sensors are not being used in game.
ta: இயக்க சென்சார்களுடன் ஒரு கேம்பேட்டை பின்பற்றும்போது இயக்க சென்சார் தரவைக் கோர உதவி ஓச்ட்களை இயக்குகிறது. இயக்க சென்சார்கள் விளையாட்டில் பயன்படுத்தப்படாவிட்டால், முடக்குவது ஆற்றல் மற்றும் பிணைய பயன்பாட்டை சற்று குறைக்கலாம்.

# title_checkbox_gamepad_motion_fallback
source: Emulate gamepad motion sensor support
ta: கேம்பேட் மோசன் சென்சார் ஆதரவைப் பின்பற்றுங்கள்

# summary_checkbox_gamepad_motion_fallback
source: Uses your device's built-in motion sensors if gamepad sensors are not supported by your connected gamepad or your Android version. Note: Enabling this option may cause your gamepad to appear as a PlayStation controller on the host.
ta: உங்கள் இணைக்கப்பட்ட கேம்பேட் அல்லது உங்கள் ஆண்ட்ராய்டு பதிப்பால் கேம்பேட் சென்சார்கள் ஆதரிக்கப்படாவிட்டால் உங்கள் சாதனத்தின் உள்ளமைக்கப்பட்ட இயக்க சென்சார்களைப் பயன்படுத்துகிறது. குறிப்பு: இந்த விருப்பத்தை இயக்குவது உங்கள் கேம்பேட் ஓச்டில் பிளேச்டேசன் கன்ட்ரோலராக தோன்றக்கூடும்.

# category_input_settings
source: Input Settings
ta: உள்ளீட்டு அமைப்புகள்

# title_checkbox_touchscreen_trackpad
source: Use the touchscreen as a trackpad
ta: தொடுதிரையை டிராக்பேடாகப் பயன்படுத்தவும்
