Repository: 247i/TACETr
Catalog: உரை/தானி/moonlight-moonlight-android-*.po
Languages: ta

# summary_checkbox_touchscreen_trackpad
source: If enabled, the touchscreen acts like a trackpad. If disabled, the touchscreen directly controls the mouse cursor.
ta: இயக்கப்பட்டால், தொடுதிரை டிராக்பேட் போல செயல்படுகிறது. முடக்கப்பட்டால், தொடுதிரை மவுச் கர்சரை நேரடியாக கட்டுப்படுத்துகிறது.

# title_checkbox_absolute_mouse_mode
source: Remote desktop mouse mode
ta: தொலைநிலை டெச்க்டாப் மவுச் பயன்முறை

# summary_checkbox_absolute_mouse_mode
source: This can make mouse acceleration behave more naturally for remote desktop usage, but it is incompatible with many games.
ta: இது தொலைநிலை டெச்க்டாப் பயன்பாட்டிற்கு சுட்டி முடுக்கம் இயற்கையாகவே செயல்படக்கூடும், ஆனால் இது பல விளையாட்டுகளுடன் பொருந்தாது.

# title_checkbox_mouse_nav_buttons
source: Enable back and forward mouse buttons
ta: பின் மற்றும் முன்னோக்கி சுட்டி பொத்தான்களை இயக்கவும்

# summary_checkbox_mouse_nav_buttons
source: Enabling this option may break right clicking on some buggy devices
ta: இந்த விருப்பத்தை இயக்குவது சில தரமற்ற சாதனங்களில் வலது சொடுக்கு செய்வதை உடைக்கக்கூடும்

# category_on_screen_controls_settings
source: On-screen Controls Settings
ta: ஆன்-ச்கிரீன் அமைப்புகளை கட்டுப்படுத்துகிறது

# title_checkbox_show_onscreen_controls
source: Show on-screen controls
ta: திரை கட்டுப்பாடுகளைக் காட்டுங்கள்

# summary_checkbox_show_onscreen_controls
source: Show virtual controller overlay on touchscreen
ta: தொடுதிரையில் மெய்நிகர் கட்டுப்படுத்தி மேலடுக்கைக் காட்டு

# title_checkbox_vibrate_osc
source: Enable vibration
ta: அதிர்வுகளை இயக்கவும்

# summary_checkbox_vibrate_osc
source: Vibrates your device to emulate rumble for the on-screen controls
ta: திரையில் கட்டுப்பாடுகளுக்கு ரம்பிளைப் பின்பற்ற உங்கள் சாதனத்தை அதிர்வுறும்

# title_only_l3r3
source: Only show L3 and R3
ta: L3 மற்றும் R3 ஐ மட்டுமே காட்டு

# summary_only_l3r3
source: Hide all virtual buttons except L3 and R3
ta: L3 மற்றும் R3 தவிர அனைத்து மெய்நிகர் பொத்தான்களையும் மறைக்கவும்

# title_reset_osc
source: Clear saved on-screen controls layout
ta: தெளிவான சேமிக்கப்பட்ட திரை கட்டுப்பாடுகள் தளவமைப்பு

# summary_reset_osc
source: Resets all on-screen controls to their default size and position
ta: அனைத்து திரை கட்டுப்பாடுகளையும் அவற்றின் இயல்புநிலை அளவு மற்றும் நிலைக்கு மீட்டமைக்கிறது

# dialog_title_reset_osc
source: Reset Layout
ta: தளவமைப்பை மீட்டமைக்கவும்

# dialog_text_reset_osc
source: Are you sure you want to delete your saved on-screen controls layout?
ta: நீங்கள் சேமித்த திரை கட்டுப்பாட்டு தளவமைப்பை நீக்க விரும்புகிறீர்களா?

# toast_reset_osc_success
source: On-screen controls reset to default
ta: ஆன்-ச்கிரீன் கட்டுப்பாடுகள் இயல்புநிலைக்கு மீட்டமைக்கின்றன

# title_osc_opacity
source: Change opacity of on-screen controls
ta: திரை கட்டுப்பாடுகளின் ஒளிபுகாநிலையை மாற்றவும்

# summary_osc_opacity
source: Make the on-screen controls more/less transparent
ta: ஆன்-ச்கிரீன் கட்டுப்பாடுகளை மேலும்/குறைவாக வெளிப்படையானதாக ஆக்குங்கள்

# dialog_title_osc_opacity
source: Change opacity
ta: ஒளிபுகாநிலையை மாற்றவும்

# category_ui_settings
source: UI Settings
ta: இடைமுகம் அமைப்புகள்

# title_checkbox_enable_pip
source: Enable Picture-in-Picture observer mode
ta: படம்-இன்-பட பார்வையாளர் பயன்முறையை இயக்கவும்

# summary_checkbox_enable_pip
source: Allows the stream to be viewed (but not controlled) while multitasking
ta: பல்பணி செய்யும் போது ச்ட்ரீமை பார்க்க அனுமதிக்கிறது (ஆனால் கட்டுப்படுத்தப்படவில்லை)

# title_language_list
source: Language
ta: மொழி

# summary_language_list
source: Language to use for Moonlight
ta: நிலவொளிக்கு பயன்படுத்த மொழி

# title_checkbox_small_icon_mode
source: Use small box art
ta: சிறிய பெட்டி கலையைப் பயன்படுத்தவும்

# summary_checkbox_small_icon_mode
source: Smaller box art in the app grid allows more apps to be visible on screen
ta: பயன்பாட்டு கட்டத்தில் உள்ள சிறிய பெட்டி கலை மேலும் பயன்பாடுகள் திரையில் காண அனுமதிக்கிறது

# category_host_settings
source: Host Settings
ta: புரவலன் அமைப்புகள்

# title_checkbox_enable_sops
source: Optimize game settings
ta: விளையாட்டு அமைப்புகளை மேம்படுத்தவும்

# summary_checkbox_enable_sops
source: Allow GFE to modify game settings for optimal streaming
ta: உகந்த ச்ட்ரீமிங்கிற்கான விளையாட்டு அமைப்புகளை மாற்ற GFE ஐ அனுமதிக்கவும்

# title_checkbox_host_audio
source: Play audio on PC
ta: கணினியில் ஆடியோ இயக்கவும்

# summary_checkbox_host_audio
source: Play audio from the computer and this device
ta: கணினி மற்றும் இந்த சாதனத்திலிருந்து ஆடியோவை இயக்கவும்

# category_advanced_settings
source: Advanced Settings
ta: மேம்பட்ட அமைப்புகள்

# title_unlock_fps
source: Unlock all possible frame rates
ta: சாத்தியமான அனைத்து பிரேம் விகிதங்களையும் திறக்கவும்

# summary_unlock_fps
source: Streaming at 90 or 120 FPS may reduce latency on high-end devices but can cause lag or instability on devices that can't support it
ta: 90 அல்லது 120 FPS இல் ச்ட்ரீமிங் செய்வது உயர்நிலை சாதனங்களில் தாமதத்தைக் குறைக்கலாம், ஆனால் அதை ஆதரிக்க முடியாத சாதனங்களில் பின்னடைவு அல்லது உறுதியற்ற தன்மையை ஏற்படுத்தும்

# title_checkbox_reduce_refresh_rate
source: Allow refresh rate reduction
ta: புதுப்பிப்பு வீதக் குறைப்பை அனுமதிக்கவும்

# summary_checkbox_reduce_refresh_rate
source: Lower display refresh rates can save power at the expense of some additional video latency
ta: குறைந்த காட்சி புதுப்பிப்பு விகிதங்கள் சில கூடுதல் வீடியோ தாமதத்தின் இழப்பில் சக்தியை மிச்சப்படுத்தும்

# title_checkbox_disable_warnings
source: Disable warning messages
ta: எச்சரிக்கை செய்திகளை முடக்கு

# summary_checkbox_disable_warnings
source: Disable on-screen connection warning messages while streaming
ta: ச்ட்ரீமிங் செய்யும் போது திரை இணைப்பு எச்சரிக்கை செய்திகளை முடக்கு

# title_disable_frame_drop
source: Never drop frames
ta: ஒருபோதும் பிரேம்களை கைவிட வேண்டாம்

# summary_disable_frame_drop
source: May reduce micro-stuttering on some devices, but can increase latency
ta: சில சாதனங்களில் மைக்ரோ-ச்டட்டரைக் குறைக்கலாம், ஆனால் தாமதத்தை அதிகரிக்கும்

# title_video_format
source: Change codec settings
ta: கோடெக் அமைப்புகளை மாற்றவும்

# summary_video_format
source: Newer codecs can lower video bandwidth requirements if your device supports them. Codec selections may be ignored if not supported by the host software or GPU.
ta: உங்கள் சாதனம் ஆதரித்தால் புதிய கோடெக்குகள் வீடியோ அலைவரிசை தேவைகளை குறைக்கலாம். புரவலன் மென்பொருள் அல்லது சி.பீ.யால் ஆதரிக்கப்படாவிட்டால் கோடெக் தேர்வுகள் புறக்கணிக்கப்படலாம்.

# title_enable_hdr
source: Enable HDR (Experimental)
ta: HDR ஐ இயக்கவும் (சோதனை)

# summary_enable_hdr
source: Stream HDR when the game and PC GPU support it. HDR requires a GPU with HEVC Main 10 encoding support.
ta: விளையாட்டு மற்றும் பிசி சி.பீ.யூ அதை ஆதரிக்கும் போது ச்ட்ரீம் எச்டிஆர். எச்.டி.ஆருக்கு எச்.வி.சி முதன்மையான 10 குறியாக்க ஆதரவுடன் சி.பீ.யூ தேவைப்படுகிறது.

# title_full_range
source: Force full range video (Experimental)
ta: முழு வீச்சு வீடியோவை (சோதனை) கட்டாயப்படுத்துங்கள்

# summary_full_range
source: This will cause loss of detail in light and dark areas if your device doesn't properly display full range video content.
ta: உங்கள் சாதனம் முழு அளவிலான வீடியோ உள்ளடக்கத்தை சரியாகக் காட்டாவிட்டால் இது ஒளி மற்றும் இருண்ட பகுதிகளில் விவரங்களை இழக்க நேரிடும்.

# title_enable_perf_overlay
source: Show performance stats while streaming
ta: ச்ட்ரீமிங் செய்யும் போது செயல்திறன் புள்ளிவிவரங்களைக் காட்டு

# summary_enable_perf_overlay
source: Display real-time stream performance information while streaming
ta: ச்ட்ரீமிங் செய்யும் போது நிகழ்நேர ச்ட்ரீம் செயல்திறன் தகவலைக் காண்பி

# title_enable_post_stream_toast
source: Show latency message after streaming
ta: ச்ட்ரீமிங்கிற்குப் பிறகு நேரந்தவறுகை செய்தியைக் காட்டு

# summary_enable_post_stream_toast
source: Display a latency information message after the stream ends
ta: ச்ட்ரீம் முடிந்ததும் ஒரு தாமத செய்தி செய்தியைக் காண்பி

# category_help
source: Help
ta: உதவி

# title_setup_guide
source: Setup guide
ta: அமைவு வழிகாட்டி

# summary_setup_guide
source: View instructions on how to set up your gaming PC for streaming
ta: ச்ட்ரீமிங்கிற்காக உங்கள் கேமிங் கணினியை எவ்வாறு அமைப்பது என்பதற்கான வழிமுறைகளைக் காண்க

# title_troubleshooting
source: Troubleshooting guide
ta: சரிசெய்தல் வழிகாட்டி

# summary_troubleshooting
source: View tips for diagnosing and fixing common streaming issues
ta: பொதுவான ச்ட்ரீமிங் சிக்கல்களைக் கண்டறிந்து சரிசெய்வதற்கான உதவிக்குறிப்புகளைக் காண்க

# title_privacy_policy
source: Privacy policy
ta: தனியுரிமைக் கொள்கை

# summary_privacy_policy
source: View Moonlight's privacy policy
ta: மூன்லைட்டின் தனியுரிமைக் கொள்கையைக் காண்க

# toast_controller_type_changed
source: Gamepad type may be changed due to motion sensor emulation
ta: இயக்க சென்சார் எமுலேசன் காரணமாக கேம்பேட் வகை மாற்றப்படலாம்

# resolution_360p
source: 360p
ta: 360 ப

# resolution_480p
source: 480p
ta: 480 ப

# resolution_720p
source: 720p
ta: 720 ஆ

# resolution_1080p
source: 1080p
ta: 1080 ப

# resolution_1440p
source: 1440p
ta: 1440 ப

# resolution_4k
source: 4K
ta: எச்.சி.

# fps_30
source: 30 FPS
ta: 30 எஃப்.பி.எச்

# fps_60
source: 60 FPS
ta: 60 எஃப்.பி.எச்

# fps_90
source: 90 FPS
ta: 90 எஃப்.பி.எச்

# fps_120
source: 120 FPS
ta: 120 எஃப்.பி.எச்

# audioconf_stereo
source: Stereo
ta: ச்டீரியோ

# audioconf_51surround
source: 5.1 Surround Sound
ta: 5.1 ஒலி ஒலி

# audioconf_71surround
source: 7.1 Surround Sound
ta: 7.1 சரவுண்ட் ஒலி

# videoformat_auto
source: Automatic (Recommended)
ta: தானியங்கி (பரிந்துரைக்கப்படுகிறது)

# videoformat_av1always
source: Prefer AV1 (Experimental)
ta: AV1 ஐ விரும்புங்கள் (சோதனை)

# videoformat_hevcalways
source: Prefer HEVC
ta: HEVC ஐ விரும்புங்கள்

# videoformat_h264always
source: Prefer H.264
ta: H.264 ஐ விரும்புங்கள்

# title_frame_pacing
source: Video frame pacing
ta: வீடியோ பிரேம் வேகக்கட்டுப்பாடு

# summary_frame_pacing
source: Specify how to balance video latency and smoothness
ta: வீடியோ நேரந்தவறுகை மற்றும் மென்மையை எவ்வாறு சமநிலைப்படுத்துவது என்பதைக் குறிப்பிடவும்

# pacing_latency
source: Prefer lowest latency
ta: குறைந்த தாமதத்தை விரும்புங்கள்

# pacing_balanced
source: Balanced
ta: சமநிலையானது

# pacing_balanced_alt
source: Balanced with FPS limit
ta: FPS வரம்புடன் சமநிலையானது

# pacing_smoothness
source: Prefer smoothest video (may significantly increase latency)
ta: மென்மையான வீடியோவை விரும்புங்கள் (தாமதத்தை கணிசமாக அதிகரிக்கக்கூடும்)

# title_analog_scrolling
source: Use an analog stick to scroll
ta: உருட்ட ஒரு அனலாக் குச்சியைப் பயன்படுத்தவும்

# summary_analog_scrolling
source: Select an analog stick to scroll when in mouse emulation mode
ta: சுட்டி எமுலேசன் பயன்முறையில் இருக்கும்போது உருட்ட ஒரு அனலாக் குச்சியைத் தேர்ந்தெடுக்கவும்

# analogscroll_none
source: None (both sticks move the mouse)
ta: எதுவுமில்லை (இரண்டு குச்சிகளும் சுட்டியை நகர்த்துகின்றன)

# analogscroll_right
source: Right analog stick
ta: வலது அனலாக் குச்சி

# analogscroll_left
source: Left analog stick
ta: இடது அனலாக் குச்சி
