Repository: 247i/TACETr
Catalog: உரை/தானி/motioneye-project-motioneye-python-texts-*.po
Languages: ta

source: Ebligu manaj kaptoj
ta: கையேடு பிடிப்புகளை இயக்கவும்

source: Kiam ĉi tio estas enŝaltita, butono sur la kameraa kadro permesos al vi permane preni kaptojn.
ta: இது இயக்கப்படும் போது, ​​கேமரா சட்டகத்தின் ஒரு பொத்தானை கைமுறையாக கைப்பற்ற அனுமதிக்கும்.

source: ebligu ĉi tion, se vi volas registri filmojn
ta: நீங்கள் திரைப்படங்களை பதிவு செய்ய விரும்பினால் இதை இயக்கவும்

source: Filmoj
ta: திரைப்படங்கள்

source: Filma Dosiernomo
ta: திரைப்பட கோப்பு பெயர்

source: Difinas la nomon ŝablonon por por la filmdosieroj; la sekvaj specialaj tokensoj estas akceptitaj:%%Y = jaro,%%m = monato,%%d = tago,%%H = horo,%%M = minuto,%%S = sekundo,%%q = kadro numero,%%v = evento numero, / = subdosierujo.
ta: மூவி கோப்புகளுக்கான பெயர் வார்ப்புருவை வரையறுக்கிறது; பின்வரும் சிறப்பு டோக்கன்கள் ஏற்றுக்கொள்ளப்படுகின்றன: %% ஒய் = ஆண்டு, %% m = மாதம், %%d = நாள், %% H = மணிநேரம், %% m = மணித்துளி, %% S = இரண்டாவது, %% Q = பிரேம் எண், %% V = நிகழ்வு எண், / = துணை அடைவு.

source: Rekta kopia filmeto
ta: நேரடி நகல் வீடியோ

source: Kreu filmojn rekte de la kamerao. Ĉi tiu opcio devus redukti CPU-uzadon sed pliigi memorpostulojn. Neniu bilda prilaborado estas farita, do tekstoj interkovras, privatecaj maskoj ktp. ne estos sur la rezulta video.
ta: கேமராவிலிருந்து நேரடியாக திரைப்படங்களை உருவாக்கவும். இந்த விருப்பம் சிபியு பயன்பாட்டைக் குறைக்க வேண்டும், ஆனால் நினைவக தேவைகளை அதிகரிக்க வேண்டும். பட செயலாக்கம் எதுவும் செய்யப்படவில்லை, எனவே நூல்கள் ஒன்றுடன் ஒன்று, தனியுரிமை முகமூடிகள் போன்றவை. இதன் விளைவாக வரும் வீடியோவில் இருக்காது.

source: Filmformato
ta: திரைப்பட வடிவம்

source: Agordas la filmdosieron; ne ĉiuj formatoj garantias funkcii en ĉiuj sistemoj; se vi dubas, testu ĉiun formaton kaj elektu tiun, kiu plej bone funkcias per via filmetilo.
ta: படக் கோப்பை அமைக்கவும்; எல்லா அமைப்புகளிலும் வேலை செய்வதற்கு எல்லா வடிவங்களும் பொறுப்பு அளிக்காது; நீங்கள் சந்தேகித்தால், ஒவ்வொரு வடிவமைப்பையும் சோதித்து, உங்கள் வீடியோவுடன் சிறப்பாக செயல்படும் ஒன்றைத் தேர்ந்தெடுக்கவும்.

source: Filma Kvalito
ta: திரைப்பட தகுதி

source: Agordas la MPEG-video-kvaliton (pli altaj valoroj produktas pli bonan videokvaliton sed postulas pli da stokado).
ta: சுங்க MPEG வீடியோ தகுதி (அதிக மதிப்புகள் சிறந்த வீடியோ தரத்தை உருவாக்குகின்றன, ஆனால் அதிக சேமிப்பு தேவைப்படுகிறது).

source: Rekorda reĝimo
ta: பதிவு முறை

source: Kontinua registrado
ta: தொடர்ச்சியான பதிவு

source: Agordas la registradreĝimon: Moviĝa deĉenigo = nova filmo kreita kiam ajn moviĝo estas detektita, Kontinua Registrado = unu granda filma dosiero.
ta: பதிவு பயன்முறையைத் தனிப்பயனாக்குகிறது: இயக்கம் தூண்டுதல் = இயக்கம் கண்டறியப்படும்போதெல்லாம் உருவாக்கப்பட்ட புதிய திரைப்படம், தொடர்ச்சியான பதிவு = ஒரு பெரிய திரைப்பட கோப்பு.

source: Maksimuma filma daŭro
ta: அதிகபட்ச திரைப்பட காலம்

source: Agordas la maksimuman longon de filmoj en sekundoj; se la movada evento daŭras pli longe, nova filmdosiero estas kreita; uzu 0 por senlima longo.
ta: திரைப்படங்களின் அதிகபட்ச நீளத்தை நொடிகளில் அமைக்கிறது; இயக்கம் நிகழ்வு நீண்ட காலம் நீடித்தால், ஒரு புதிய படக் கோப்பு உருவாக்கப்படுகிறது; வரம்பற்ற நீளத்திற்கு 0 ஐப் பயன்படுத்தவும்.

source: Konservi filmojn
ta: திரைப்படங்களை வைத்திருக்க

source: Filmoj pli aĝaj ol la difinita daŭro estas aŭtomate forigitaj por liberigi stokadon.
ta: வரையறுக்கப்பட்ட காலத்தை விட பழைய படங்கள் சேமிப்பகத்தை வெளியிட தானாகவே அகற்றப்படும்.

source: Filmoj Vivdaŭro
ta: திரைப்படங்கள் வாழ்நாள்

source: tagoj
ta: நாட்கள்

source: Agordas la nombron da tagoj post kiuj la filmoj estos forigitaj aŭtomate.
ta: படங்கள் தானாக அகற்றப்படும் நாட்களின் எண்ணிக்கையை அமைக்கவும்.

source: Aktivigu ĉi tion, por uzi kaj agordi la mekanismon por detekti movadon.
ta: இதை செயல்படுத்தவும், பயன்படுத்தவும், இயக்கத்தைக் கண்டறியவும்.

source: Movado-Detekto
ta: இயக்கம் கண்டறிதல்

source: Kadra ŝanĝo sojlo
ta: பிரேம் மாற்ற வாசல்

source: Indikas la minimuman procenton de la bildo, kiu devas ŝanĝi inter du pluaj kadroj por detekti movadon (pli malgrandaj valoroj donas pli sentivan detekton, sed inklinas al falsaj pozitivoj).
ta: படத்தின் குறைந்தபட்ச சதவீதத்தைக் குறிக்கிறது, இது இயக்கத்தைக் கண்டறிய மேலும் இரண்டு பிரேம்களுக்கு இடையில் மாற வேண்டும் (சிறிய மதிப்புகள் அதிக உணர்திறன் கண்டறிதலைக் கொடுக்கும், ஆனால் தவறான நேர்மறைகளுக்கு முனைகின்றன).

source: Maksimuma ŝanĝo sojlo
ta: அதிகபட்ச மாற்ற வாசல்

source: Starigas la nombron da rastrumeroj ŝanĝitaj inter kadroj super kiuj movo ne plu ekigas (0 malŝaltas la limon).
ta: பிரேம்களுக்கு இடையில் மாற்றப்பட்ட பிக்சல்களின் எண்ணிக்கையை அமைக்கிறது, இதன் மீது நகரும் இனி தூண்டாது (0 வரம்பை அணைக்கிறது).

source: Aŭtomata sojla agordo
ta: தானியங்கி வாசல் உள்ளமைவு

source: Ebligu tion aŭtomate ĝustigi la sojlon.
ta: வாசலை தானாக சரிசெய்ய இதை இயக்கவும்.

source: Aŭtomata bruo-detekto
ta: தானியங்கி ஒலி கண்டறிதல்

source: Ebligu tion por aŭtomate ĝustigi la nivelon de bruo.
ta: சத்தத்தின் அளவை தானாக சரிசெய்ய இதை இயக்கவும்.

source: Bruo-nivelo
ta: இரைச்சல் நிலை

source: Permane agordas la bruan nivelon al fiksita valoro.
ta: இரைச்சல் அளவை ஒரு நிலையான மதிப்புக்கு கைமுறையாக மாற்றுகிறது.

source: Detekto de lumaj ŝanĝoj
ta: ஒளி மாற்றங்களைக் கண்டறிதல்

source: Difinas la procenton de la bildo, kiu bezonas ŝanĝi, por ke la evento estu traktata kiel subita luma ŝanĝo anstataŭ moviĝo (0%% malebligas la funkcion).
ta: மாற்ற வேண்டிய படத்தின் சதவீதத்தை வரையறுக்கிறது, இதனால் நிகழ்வு இயக்கத்திற்கு பதிலாக திடீர் ஒளி மாற்றமாக கருதப்படுகிறது (0 %% செயல்பாட்டைத் தடுக்கிறது).

source: Makula filtrilo
ta: ச்பாட் வடிகட்டி

source: Ebligu tion apliki makulan filtrilon al kadroj antaŭ ol detekti movadon.
ta: இயக்கத்தைக் கண்டறிவதற்கு முன் பிரேம்களுக்கு ச்பாட் வடிப்பானைப் பயன்படுத்துவதற்கு இதை இயக்கவும்.

source: Senmovada daŭro
ta: அசையாத காலம்

source: Agordas la nombron da sekundoj da silento (t.e. neniu moviĝo), kiuj markas la finon de movada okazaĵo.
ta: ஒரு இயக்க நிகழ்வின் முடிவைக் குறிக்கும் ம silence னத்தின் எண்ணிக்கையை (அதாவது இயக்கம் இல்லை) அமைக்கவும்.

source: Kaptita Antaŭe
ta: முன்பு பிடிபட்டது

source: kadroj
ta: பிரேம்கள்

source: Starigas la nombron de kadroj kaptitaj (kaj inkluzivitaj en la filmo) antaŭ ol moviĝokazaĵo estas detektita.
ta: ஒரு இயக்க நிகழ்வு கண்டறியப்படுவதற்கு முன்பு கைப்பற்றப்பட்ட பிரேம்களின் எண்ணிக்கையை (மற்றும் படத்தில் சேர்க்கப்பட்டுள்ளது) அமைக்கிறது.

source: Kaptita Post
ta: பின்னர் பிடிபட்டது

source: Starigas la nombron de kadroj kaptotaj (kaj inkluzivitaj en la filmo) post la fino de movada evento.
ta: ஒரு இயக்கம் நிகழ்வின் முடிவிற்குப் பிறகு கைப்பற்றப்பட வேண்டிய பிரேம்களின் எண்ணிக்கையை அமைக்கிறது (மற்றும் படத்தில் சேர்க்கப்பட்டுள்ளது).

source: Minimumaj movaj kadroj
ta: குறைந்தபட்ச நகரும் பிரேம்கள்

source: Fiksas la minimuman nombron da pluaj movaj kadroj necesaj por komenci moviĝan eventon.
ta: நகரும் நிகழ்வைத் தொடங்க தேவையான மேலும் நகரும் பிரேம்களின் குறைந்தபட்ச எண்ணிக்கையை அமைக்கிறது.

source: Masko
ta: முகமூடி

source: Ebligas bildigan maskeradon por pli selektema kaj preciza moviĝo-detekto.
ta: மிகவும் தேர்ந்தெடுக்கப்பட்ட மற்றும் துல்லியமான இயக்கக் கண்டறிதலுக்கான இமேசிங் முகமூடியை செயல்படுத்துகிறது.

source: Tipo de masko
ta: மாச்கோ வகை

source: Inteligenta
ta: நுண்ணறிவு

source: Redaktebla
ta: திருத்தக்கூடிய

source: La Inteligenta opcio aŭtomate detektas regionojn per regula movado kaj dinamike kreas internan maskon, dum la Redaktebla opcio permesas permane konstrui ĝin mem.
ta: அறிவுள்ள விருப்பம் தானாகவே வழக்கமான இயக்கத்தின் பிராந்தியங்களைக் கண்டறிந்து, உள் முகமூடியை மாறும் வகையில் உருவாக்குகிறது, அதே நேரத்தில் திருத்தக்கூடிய விருப்பம் அதை கைமுறையாக உருவாக்க உங்களை அனுமதிக்கிறது.

source: Inteligenta-maska Malrapideco
ta: ச்மார்ட்-மாச்க் மந்தநிலை

source: Pli altaj valoroj donas pli daŭran maskon kun pli malrapida konstruprocezo.
ta: அதிக மதிப்புகள் மெதுவான கட்டுமான செயல்முறையுடன் மிகவும் நீடித்த முகமூடியைக் கொடுக்கும்.

source: Alklaku ĉi tiun butonon por ebligi/malebligi la maskan redaktilon.
ta: முகமூடி எடிட்டரை இயக்க/முடக்க இந்த பொத்தானைக் சொடுக்கு செய்க.

source: Purigi maskon
ta: ஒரு முகமூடியை தூய்மை செய்ய

source: Alklaku ĉi tiun butonon por malplenigi la nunan maskon.
ta: தற்போதைய முகமூடியை வெறுமை செய்ய இந்த பொத்தானைக் சொடுக்கு செய்க.

source: Montri Kadro-Ŝanĝojn
ta: சட்ட மாற்றங்களைக் காட்டு

source: Se ĉi tio estas aktiva, la bilda ŝanĝojn (nombro de pikseloj kaj la modifita areo) estas montritaj en la video; provizore ebligigu ĉi tion por ĝustigi agordojn de moviĝo-detekto.
ta: இது செயலில் இருந்தால், பட மாற்றங்கள் (பிக்சல்களின் எண்ணிக்கை மற்றும் மாற்றியமைக்கப்பட்ட பகுதி) வீடியோவில் காட்டப்பட்டுள்ளன; இயக்க கண்டறிதல் அமைப்புகளை சரிசெய்ய தற்காலிகமாக இதை இயக்கவும்.

source: Krei debug media files
ta: க்ரீ பிழைத்திருத்த மீடியா கோப்புகள்

source: Kiam ebligite, kreas specialajn filmojn kaj bildojn, kiuj helpas elpurigi problemojn de moviĝo-detekto.
ta: இயக்கப்பட்டால், இயக்க கண்டறிதல் சிக்கல்களை பிழைத்திருத்த உதவும் சிறப்பு திரைப்படங்கள் மற்றும் படங்களை உருவாக்குகிறது.

source: Ebligu tion se vi volas esti sciigita kiam moviĝo estas detektita.
ta: இயக்கம் கண்டறியப்படும்போது உங்களுக்கு அறிவிக்கப்பட விரும்பினால் இதை இயக்கவும்.

source: Moviĝaj sciigoj
ta: இயக்க அறிவிப்புகள்

source: Sendi retpoŝton
ta: மின்னஞ்சல் அனுப்ப

source: Aktivigu ĉi tiun opcion, se vi volas ricevi retpoŝton ĉiufoje kiam moviĝokazaĵo estas detektita.
ta: ஒவ்வொரு முறையும் ஒரு இயக்க நிகழ்வு கண்டறியப்படும் போது நீங்கள் ஒரு மின்னஞ்சலைப் பெற விரும்பினால் இந்த விருப்பத்தை செயல்படுத்தவும்.

source: Retpoŝtadresoj
ta: மின்னஞ்சல் முகவரிகள்

source: retpoŝtadresoj…
ta: மின்னஞ்சல் முகவரிகள் ...

source: Retpoŝtadresoj (apartigitaj per komo) aldonitaj ĉi tie ricevos sciigojn kiam ajn moviĝokazaĵo estas detektita.
ta: இங்கே சேர்க்கப்பட்ட மின்னஞ்சல் முகவரிகள் (கமாவால் பிரிக்கப்பட்டவை) ஒரு இயக்க நிகழ்வு கண்டறியப்படும்போதெல்லாம் அறிவிப்புகளைப் பெறும்.

source: ekz. smtp.gmail.com
ta: எ.கா. Smtp.gmail.com

source: Enigu la hostname aŭ IP-adreson de via SMTP-servilo (por uzado de Gmail smtp.gmail.com).
ta: உங்கள் SMTP சேவையகத்தின் ஓச்ட்பெயர் அல்லது ஐபி முகவரியை உள்ளிடவும் (gmail smtp.gmail.com ஐப் பயன்படுத்துவதற்கு).

source: SMTP Haveno
ta: SMTP ஏவன்

source: ekz. 587
ta: எ.கா. 587

source: Eniru la havenon uzatan de via SMTP-servilo (kutime 465 por ne-TLS-ligoj kaj 587 por TLS-ligoj).
ta: உங்கள் SMTP சேவையகத்தால் பயன்படுத்தப்படும் போர்ட்டை உள்ளிடவும் (வழக்கமாக TLS அல்லாத இணைப்புகளுக்கு 465 மற்றும் TLS இணைப்புகளுக்கு 587).

source: SMTP-Konto
ta: SMTP கணக்கு

source: Enigu vian SMTPan konton (kutime via retpoŝta adreso).
ta: உங்கள் SMTP கணக்கை உள்ளிடவும் (பொதுவாக உங்கள் மின்னஞ்சல் முகவரி).

source: SMTP Pasvorto
ta: SMTP கடவுச்சொல்

source: Enigu vian SMTPan pasvorton (por Gmail uzu vian Google-pasvorton aŭ app-specifan generitan pasvorton).
ta: உங்கள் SMTP கடவுச்சொல்லை உள்ளிடவும் (Gmail க்கு உங்கள் Google கடவுச்சொல் அல்லது பயன்பாடு சார்ந்த உருவாக்கப்பட்ட கடவுச்சொல்லைப் பயன்படுத்தவும்).

source: De adreso
ta: முகவரி

source: retpoŝta adreso…
ta: மின்னஞ்சல் முகவரி ...

source: Agordi kutimon De adreso, se via SMTP-servo postulas unu (la unua destina retpoŝta adreso estos uzata se lasita malplena).
ta: உங்கள் SMTP சேவைக்கு ஒன்று தேவைப்பட்டால் முகவரியின் வழக்கத்தை உள்ளமைப்பது (காலியாக விட்டால் முதல் இலக்கு மின்னஞ்சல் முகவரி பயன்படுத்தப்படும்).

source: Uzi TLS
ta: உசி டி.எல்.எச்

source: Ebligu tion, se via SMTP-servilo postulas TLS (Gmail bezonas ĉi tion por ebligi).
ta: உங்கள் SMTP சேவையகத்திற்கு TLS தேவைப்பட்டால் இதை இயக்கவும் (Gmail ஐ இயக்க இது தேவை).

source: Aldonitaj bildoj tempo-intervalo
ta: படங்கள் நேர வரம்பு சேர்க்கப்பட்டது

source: Difinas la tempo-serĉan intervalon por uzi dum kreado de retpoŝtaj ligiloj (pli altaj valoroj generas retpoŝtojn kun pli da bildoj koste de pliigita prokrasta sciigo); agordi al 0 por malebligi aldonitabildojn; vi ankaŭ devas rajtigi «Kaptitaj bildoj» por ke ĉi tio funkciu.
ta: மின்னஞ்சல் இணைப்புகளை உருவாக்கும்போது பயன்படுத்த வேண்டிய நேர தேடல் வரம்பை வரையறுக்கிறது (அதிகரித்த தாமத அறிவிப்பின் இழப்பில் அதிக மதிப்புகள் அதிக படங்களுடன் மின்னஞ்சல்களை உருவாக்குகின்றன); சேர்க்கப்பட்ட படங்களைத் தடுக்க 0 என அமைக்கவும்; இது செயல்பட "கைப்பற்றப்பட்ட படங்களை" அங்கீகரிக்க வேண்டும்.

source: Testi retpoŝto
ta: மின்னஞ்சல் சோதனை

source: Alklaku ĉi tiun butonon por testi retpoŝtajn sciigojn post kiam vi plenigis la postulatajn detalojn.
ta: தேவையான விவரங்களை நீங்கள் நிரப்பிய பிறகு மின்னஞ்சல் அறிவிப்புகளை சோதிக்க இந்த பொத்தானைக் சொடுக்கு செய்க.

source: Sendu Telegraman Sciigon
ta: தந்தி அறிவிப்பை அனுப்பவும்

source: ebligu tion se vi volas ricevi telegraman mesaĝon kiam ajn moviĝa evento estas detektita
ta: ஒரு மோசன் நிகழ்வு கண்டறியப்படும்போதெல்லாம் நீங்கள் ஒரு தந்தி செய்தியைப் பெற விரும்பினால் இதை இயக்கவும்

source: HTTP API ĵetono
ta: HTP II என்பது பநிஇ இன் SIS க்கு SIS ஆகும்

source: Ekzemplo: 93847672:AACdSn843hsjJsh32bSmdN3sHsh2bsh0xRs_32dbcr1W
ta: எடுத்துக்காட்டு: 93847672: AACDSN843HSJSH32BSMDN3SHSSH2BSH0XRS_32DBCR1W

source: Kreante la telegram-bot-babilejon, vi ricevos API-ĵetonon, kiun vi devas enigi ĉi tie. Alklaku la API-butonon sube por paŝo-post-paŝa gvidilo pri kiel akiri vian API-ĵetonon. Ankaŭ nepre babili kun via lastatempe kreita «bot» post kiam via ŝlosilo estas generita, por certigi, ke vi ricevas mesaĝojn.
ta: டெலிகிராம்-போட் அரட்டையை உருவாக்குவதன் மூலம், நீங்கள் இங்கே நுழைய வேண்டிய பநிஇ டோக்கன்களைப் பெறுவீர்கள். உங்கள் பநிஇ டோக்கன்களை எவ்வாறு பெறுவது என்பது குறித்த படிப்படியான வழிகாட்டிக்கு கீழே உள்ள பநிஇ பொத்தானைக் சொடுக்கு செய்க. உங்கள் திறவுகோல் உருவாக்கப்பட்ட பிறகு, நீங்கள் செய்திகளைப் பெறுவதை உறுதிசெய்ய, புதிதாக உருவாக்கப்பட்ட "போட்" உடன் அரட்டையடிக்கவும்.

source: Babileja ID
ta: பாபிலியா ஐடி

source: Ekzemplo: 938272312
ta: எடுத்துக்காட்டு: 938272312

source: Kreu novan babilejon al id_chatbot (@id_chatbot) kaj elektu starti. La babilejo redonos la necesan numeron por ĉi tiu kampo.
ta: ID_CHATBOT (@ID_CHATBOT) க்கு புதிய அரட்டையை உருவாக்கி தொடக்கத்தைத் தேர்ந்தெடுக்கவும். அரட்டை இந்த புலத்திற்கு தேவையான எண்ணைத் தரும்.

source: Alkroĉitaj Bildoj Tempo
ta: இணைக்கப்பட்ட படங்கள் நேரம்

source: difinas la bildan serĉtempan intervalon por krei telegramajn aldonojn (pli altaj valoroj generas pli da bildoj koste de pliigita sciiga prokrasto); agordi al 0 por malebligi bildajn aldonaĵojn; vi devas ankaŭ ebligi Senmovajn Bildojn por ke ĉi tio funkciu; vi volos ludi per ĉi tiu numero ĝis bildo estos sendita. Bona komenca numero estas 30 se vi agordas senmovajn bildojn al unu bildmoviĝo ekigita. Por norma movado ekigita, starigu ĉi tion multe pli malalte.
ta: தந்தி சேர்த்தல்களை உருவாக்க பட தேடல் -நேர இடைவெளியை வரையறுக்கிறது (அதிகரித்த அறிவிப்பு தாமதத்தின் இழப்பில் அதிக மதிப்புகள் அதிக படங்களை உருவாக்குகின்றன); பட சேர்க்கைத் தடுக்க 0 என அமைக்கவும்; இது வேலை செய்ய நிலையான படங்களை நீங்கள் இயக்க வேண்டும்; ஒரு படம் அனுப்பப்படும் வரை நீங்கள் இந்த எண்ணுடன் விளையாட விரும்புவீர்கள். ஒரு பட இயக்கத்திற்கு நிலையான படங்களை அமைத்தால் ஒரு நல்ல தொடக்க எண் 30 ஆகும். தூண்டப்பட்ட ஒரு நிலையான இயக்கத்திற்கு, இதை மிகக் குறைவாக அமைக்கவும்.

source: API-Informoj
ta: பநிஇ செய்தி

source: Testo
ta: உரை

source: Alvoki URL
ta: முகவரி ஐ அழைக்கவும்

source: Ebligu ĉi tion, se vi volas, ke URL estu petata kiam ajn moviĝokazaĵo estas detektita.
ta: ஒரு இயக்க நிகழ்வு கண்டறியப்படும்போதெல்லாம் ஒரு முகவரி கோரப்பட விரும்பினால் இதை இயக்கவும்.

source: ekz. http://ekzemplo.com/sciigi/
ta: எ.கா. http://ekzemplo.com/sciigi/

source: URL por esti petita kiam moviĝo estas detektita; la sekvaj specialaj ŝparvojoj estas akceptitaj: %%Y = jaro, %%m = monato, %%d = tago, %%H = horo, %%M = minuto, %%S = sekundo, %%q = kadro-numero, %%v = okaza numero
ta: இயக்கம் கண்டறியப்படும்போது முகவரி கோரப்பட வேண்டும்; பின்வரும் சிறப்பு குறுக்குவழிகள் ஏற்றுக்கொள்ளப்படுகின்றன: %% ஒய் = ஆண்டு, %% m = மாதம், %%d = நாள், %% H = மணிநேரம், %% m = மணித்துளி, %% S = இரண்டாவது, %% Q = பிரேம் எண், %% V = அவ்வப்போது எண்

source: La HTTP-metodo por uzi kiam vi petas URL (la donitaj URL-parametroj estos transdonitaj kiel indikite ĉi tie).
ta: நீங்கள் முகவரி க்கு விண்ணப்பிக்கும்போது பயன்படுத்த வேண்டிய HTTP முறை (கொடுக்கப்பட்ட முகவரி அளவுருக்கள் இங்கே சுட்டிக்காட்டப்பட்டுள்ளபடி வழங்கப்படும்).

source: Lanĉi komando
ta: துவக்க கட்டளை

source: Ebligu ĉi tion, se vi volas lanĉi komandon ĉiufoje kiam moviĝokazaĵo estas detektita.
ta: ஒவ்வொரு முறையும் ஒரு இயக்க நிகழ்வு கண்டறியப்படும் போது நீங்கள் ஒரு கட்டளையைத் தொடங்க விரும்பினால் இதை இயக்கவும்.

source: Komando
ta: கட்டளை

source: komando…
ta: கட்டளை…

source: Komando por esti lanĉa kiam moviĝo estas detektita; multnombraj komandoj povas esti apartigitaj per dupunkto; ne uzu punktokomojn per komandoj; la sekvaj specialaj tokensoj estas akceptitaj: %%Y = jaro, %%m = monato, %%d = tago, %%H = horo, %%M = minuto, %%S = sekundo, %%q = kadro-numero, %%v = okaza numero
ta: இயக்கம் கண்டறியப்படும்போது தொடங்கப்பட வேண்டும்; பல கட்டளைகளை ஒரு பெருங்குடலால் பிரிக்கலாம்; கட்டளைகளுடன் அரைக்காற்புள்ளிகளைப் பயன்படுத்த வேண்டாம்; பின்வரும் சிறப்பு டோக்கன்கள் ஏற்றுக்கொள்ளப்படுகின்றன: %% ஒய் = ஆண்டு, %% m = மாதம், %%d = நாள், %% H = மணிநேரம், %% m = மணித்துளி, %% S = இரண்டாவது, %% Q = பிரேம் எண், %% V = அவ்வப்போது எண்

source: Ebligu ĉi tion, se vi volas lanĉi komandon ĉiufoje kiam movada evento finiĝos.
ta: ஒவ்வொரு முறையும் ஒரு இயக்கம் நிகழ்வு முடிந்ததும் ஒரு கட்டளையைத் தொடங்க விரும்பினால் இதை இயக்கவும்.

source: Komando por esti lanĉa kiam moviĝokazaĵo finiĝas; multnombraj komandoj povas esti apartigitaj per dupunkto; ne uzu punktokompojn per komandoj; la sekvaj specialaj tokensoj estas akceptitaj: %%Y = jaro, %%m = monato, %%d = dato, %%H = horo, %%M = minuto, %%S = sekundo, %%q = kadra nombro.
ta: ஒரு மோசன் நிகழ்வு முடிவடையும் போது தொடங்கப்பட வேண்டும்; பல கட்டளைகளை ஒரு பெருங்குடலால் பிரிக்கலாம்; கட்டளைகளுடன் புள்ளி கலவைகளைப் பயன்படுத்த வேண்டாம்; பின்வரும் சிறப்பு டோக்கன்கள் ஏற்றுக்கொள்ளப்படுகின்றன: %% ஒய் = ஆண்டு, %% M = மாதம், %%d = தேதி, %% H = மணிநேரம், %% M = மணித்துளி, %% S = இரண்டாவது, %% Q = பிரேம் எண்.

source: Ebligu ĉi tion, se vi volas difini ĉiusemajnan horaron por detekto de moviĝo.
ta: இயக்கக் கண்டறிதலுக்கான வாராந்திர அட்டவணையை வரையறுக்க விரும்பினால் இதை இயக்கவும்.

source: Laboranta horaro
ta: வேலை அட்டவணை

source: Lundo
ta: திங்கள்

source: de
ta: of

source: ĝis
ta: வரை

source: Fiksas la labortagan tempintervalon por lundoj.
ta: திங்கள் கிழமைகளுக்கான வேலை நாள் வரம்பை சரிசெய்கிறது.

source: Mardo
ta: செவ்வாய்க்கிழமை

source: Fiksas la labortagan tempintervalon por mardoj.
ta: செவ்வாய் கிழமைகளுக்கான வேலை நாள் வரம்பை சரிசெய்கிறது.

source: Merkredo
ta: புதன்கிழமை

source: Fiksas la labortagan tempintervalon por merkredoj.
ta: புதன்கிழமைகளுக்கு வேலை நாள் வரம்பை அமைக்கிறது.

source: Ĵaŭdo
ta: வியாழக்கிழமை

source: Fiksas la labortagan tempintervalon por ĵaŭdoj.
ta: வியாழக்கிழமைகளுக்கான வேலை நாள் வரம்பை அமைக்கிறது.

source: Vendredo
ta: வெள்ளிக்கிழமை

source: Fiksas la labortagan tempintervalon por vendredoj.
ta: வெள்ளிக்கிழமைகளுக்கான வேலை நாள் வரம்பை அமைக்கிறது.

source: Sabato
ta: காரிக்கிழமை

source: Fiksas la labortagan tempintervalon por sabatoj.
ta: சனிக்கிழமைகளுக்கான வேலை நாள் வரம்பை அமைக்கிறது.

source: Dimanĉo
ta: ஞாயிற்றுக்கிழமை

source: Fiksas la labortagan tempintervalon por dimanĉoj.
ta: ஞாயிற்றுக்கிழமைகளுக்கான வேலை நாள் வரம்பை அமைக்கிறது.

source: Detekti movadon
ta: இயக்கத்தைக் கண்டறிய

source: Dum laborista horaro
ta: வேலை அட்டவணையின் போது

source: Ekster laborista horaro
ta: வேலை அட்டவணைக்கு வெளியே

source: Difinas, ĉu moviĝodetekto devas esti aktiva dum aŭ ekster la laborista horaro.
ta: வேலை அட்டவணையின் போது அல்லது வெளியே இயக்கக் கண்டறிதல் செயலில் இருக்க வேண்டுமா என்பதை வரையறுக்கிறது.

source: neniam
ta: ஒருபோதும்

source: tago
ta: கலந்து கொள்ளுங்கள்

source: semajno
ta: ஒரு வாரம்

source: monato
ta: மாதம்

source: jaro
ta: ஆண்டு

source: horo
ta: ஓரோ

source: horoj
ta: மணி

source: minuto
ta: நிமிடங்கள்

source: minutoj
ta: நிமிடங்கள்

source: sekundo
ta: ஒரு இரண்டாவது

source: minus
ta: கழித்தல்
