Repository: 247i/TACETr
Catalog: உரை/தானி/motioneye-project-motioneye-python-texts-*.po
Languages: ta

source: interrompa signalo ricevita, fermanta …
ta: ஒரு குறுக்கீடு சமிக்ஞை பெறப்பட்டது, மூடுவது ...

source: smb-akcioj postulas radikajn privilegiojn
ta: SMB பங்குகளுக்கு ரூட் சலுகைகள் தேவை

source: bonvolu instali tornado version 3.1 aŭ pli
ta: தயவுசெய்து டொர்னாடோ பதிப்பு 3.1 அல்லது அதற்கு மேற்பட்டவற்றை நிறுவவும்

source: bonvolu instali jinja2
ta: சின்சா 2 ஐ நிறுவவும்

source: bonvolu instali pillow aŭ PIL
ta: தயவுசெய்து தலையணை அல்லது பில் நிறுவவும்

source: bonvolu instali pycurl
ta: தயவுசெய்து பைகர்லை நிறுவவும்

source: saluton! ĉi tio estas motionEye-servilo
ta: வணக்கம்! இது ஒரு இயக்க சேவையகம்

source: purigado komenciĝis
ta: துப்புரவு தொடங்கியது

source: wsswitch komenciĝis
ta: WSSWITCH தொடங்கியது

source: taskoj komenciĝis
ta: பணிகள் தொடங்கின

source: mjpg klienta rubo-kolektanto komenciĝis
ta: எம்.சே.பி.சி வாடிக்கையாளர் குப்பை சேகரிப்பான் தொடங்கியது

source: servilo komenciĝis
ta: சேவையகம் தொடங்கியது

source: servilo haltis
ta: சேவையகம் நிறுத்தப்பட்டது

source: taskoj haltis
ta: பணிகள் நிறுத்தப்பட்டன

source: motion haltis
ta: இயக்கம் நிறுத்தப்பட்டது

source: adiaŭ!
ta: குட்பை!

source: agordojn
ta: அமைப்புகள்

source: ŝanĝi uzanton
ta: பயனரை மாற்றவும்

source: forigi kameraon
ta: ஒரு கேமராவை அகற்றவும்

source: Apliki
ta: விண்ணப்பிக்கவும்

source: preferoj de uzanto
ta: பயனர் விருப்பத்தேர்வுகள்

source: Preferoj
ta: விருப்பத்தேர்வுகள்

source: Aranĝo Kolumnoj
ta: தளவமைப்பு நெடுவரிசைகள்

source: agordas la nombron da kolumnoj uzataj por aranĝi la fotilojn
ta: கேமராக்களை ஏற்பாடு செய்ய பயன்படுத்தப்படும் நெடுவரிசைகளின் எண்ணிக்கையை அமைக்கவும்

source: Fiksi Kadrojn Vertikale
ta: பிரேம்களை செங்குத்தாக அமைத்தல்

source: kontrolas ĉu framfojoj povas esti reduktitaj por vertikale konveni al la fenestro aŭ ne
ta: சாளரத்திற்கு செங்குத்தாக பொருந்துமா இல்லையா என்பதை பிரேம் நேரங்களைக் குறைக்க முடியுமா என்று சரிபார்க்கவும்

source: Aranĝo linioj
ta: தளவமைப்பு கோடுகள்

source: agordas la nombron da linioj uzataj por aranĝi la fotilojn
ta: கேமராக்களை ஏற்பாடு செய்ய பயன்படுத்தப்படும் வரிகளின் எண்ணிக்கையை உருவாக்குகிறது

source: kadro-variatoro
ta: பிரேம் மாறுபாடு

source: reduktas framfrekvencon por ŝpari retan larĝan bandon kaj trafikon (ne funkcias kun simplaj MJPEG-fotiloj)
ta: நிகழ்நிலை பரந்த இசைக்குழு மற்றும் போக்குவரத்தை சேமிக்க பிரேம் வீதத்தைக் குறைக்கிறது (எளிய MJPEG கேமராக்களுடன் வேலை செய்யவில்லை)

source: Rezolucio-variatoro
ta: தெளிவுத்திறன் வகை

source: reduktas la efektivan rezolucion de ĉiuj fotiloj por ŝpari retan larĝan bandon kaj trafikon (ne funkcias en simplaj MJPEG-fotiloj)
ta: நிகழ்நிலை பரந்த இசைக்குழு மற்றும் போக்குவரத்தை சேமிக்க அனைத்து கேமராக்களின் உண்மையான தீர்மானத்தையும் குறைக்கிறது (எளிய MJPEG கேமராக்களில் வேலை செய்யவில்லை)

source: ĝeneralaj parametroj, komunaj al ĉiuj fotiloj
ta: பொது அளவுருக்கள், அனைத்து கேமராக்களுக்கும் பொதுவானவை

source: Ĝeneralaj Agordoj
ta: பொது அமைப்புகள்

source: Lingvo
ta: மொழி

source: la lingvo de la interfaco (du literoj)
ta: இடைமுகத்தின் மொழி (இரண்டு எழுத்துக்கள்)

source: Administranto
ta: நிர்வாகி

source: la uzantnomo uzata por agordi la sistemon
ta: கணினியை அமைக்க பயனர்பெயர் பயன்படுத்தப்படுகிறது

source: Pasvorto
ta: கடவுச்சொல்

source: pasvorto de administranto
ta: நிர்வாகி கடவுச்சொல்

source: Observanto
ta: பார்வையாளர்

source: la uzantnomo por uzi por la monitorado
ta: கண்காணிப்புக்கு பயன்படுத்த பயனர்பெயர்

source: la pasvorto de la uzanto de monitorado (lasu blankan por monitorado sen pasvorto)
ta: கண்காணிப்பு பயனரின் கடவுச்சொல் (கடவுச்சொல் இல்லாமல் கண்காணிக்க வெள்ளை விடுங்கள்)

source: motionEye Versio
ta: இயக்க பதிப்பு

source: Motion Versio
ta: இயக்க பதிப்பு

source: Operaciumo Versio
ta: இயக்க முறைமை பதிப்பு

source: Programara Ĝisdatigo
ta: மென்பொருள் புதுப்பிப்பு

source: kontrolas novajn versiojn kaj plenumas ĝisdatigojn
ta: புதிய பதிப்புகளைக் கட்டுப்படுத்துகிறது மற்றும் புதுப்பிப்புகளை செய்கிறது

source: Nutro
ta: நெட்ரோ

source: Fermu
ta: நிலையான

source: malŝaltas la sistemon
ta: கணினியை முடக்குகிறது

source: Rekomencu
ta: மறுதொடக்கம் செய்யுங்கள்

source: rekomencas la sistemon
ta: கணினியை மீண்டும் தொடங்குங்கள்

source: Agordo
ta: உள்ளமைவு

source: Sekurkopio
ta: காப்புப்பிரதி

source: kreas dosieron kun la nuna agordo por ke vi konservu ĝin surloke
ta: தற்போதைய உள்ளமைவுடன் ஒரு கோப்பை உருவாக்குகிறது

source: Restaŭri
ta: மீட்டமை

source: restarigas la agordon el antaŭe konservita rezerva dosiero
ta: முன்னர் சேமிக்கப்பட்ட காப்பு கோப்பிலிருந்து அமைப்பை மீட்டமைக்கவும்

source: aktivigu ĉi tion, se vi volas uzi ĉi tiun kameraon
ta: இந்த கேமராவைப் பயன்படுத்த விரும்பினால் இதைச் செயல்படுத்தவும்

source: Video-Aparato
ta: வீடியோ-தடை

source: Kamerao Nomo
ta: கேமரா பெயர்

source: kameraa nomo…
ta: கேமரா நோமோ…

source: alias pri ĉi tiu kamera aparato
ta: இந்த கேமரா சாதனம் பற்றிய மாற்றுப்பெயர்

source: Kamerao ID
ta: கேமரா ஐடி

source: la kamerao identiga numero
ta: கேமரா அடையாள எண்

source: Kamerao aparato
ta: கேமரா சாதனம்

source: Eniga aparato (ekz. : /dev/video) or URL (ekz. : rtsp://192.168.1.1/stream)
ta: ரிகா கருவி (எ.கா.:/dev/video) அல்லது ஏர்ல் (எ.கா.

source: Kamerao Tipo
ta: கேமரா வகை

source: Aŭtomata Brilo
ta: தானியங்கி ஒளி

source: ebligas aŭtomatan brilon de programaro (rekomendita nur por kameraoj sen aŭtomata brilo)
ta: தானியங்கி மென்பொருள் பிரகாசத்தை இயக்குகிறது (தானியங்கி ஒளி இல்லாமல் கேமராக்களுக்கு மட்டுமே பரிந்துரைக்கப்படுகிறது)

source: Video-rezolucio
ta: வீடியோ தீர்மானம்

source: la video-rezolucio (pli grandaj valoroj produktas pli bonan kvaliton, sed postulas pli da CPU-potenco, pli granda stokado kaj larĝa de bando)
ta: வீடியோ தீர்மானம் (பெரிய மதிப்புகள் சிறந்த தரத்தை உருவாக்குகின்றன, ஆனால் அதிக சிபியு ஆற்றல், பெரிய சேமிப்பு மற்றும் அலைவரிசை தேவை)

source: Larĝeco
ta: அகலம்

source: enigu kutiman rezolucian larĝon
ta: தனிப்பயன் தீர்மான அகலத்தை உள்ளிடவும்

source: Alteco
ta: உயரம்

source: enigu kutiman rezolucian altecon
ta: வழக்கமான தெளிவுத்திறன் உயரத்தை உள்ளிடவும்

source: Video-Rotacio
ta: வீடியோ சுழற்சி

source: uzu ĉi tion por turni la kaptitan bildon, se via kamerao ne estas poziciigita ĝuste
ta: உங்கள் கேமரா சரியாக நிலைநிறுத்தப்படாவிட்டால் கைப்பற்றப்பட்ட படத்தைத் திருப்ப இதைப் பயன்படுத்தவும்

source: Kadrofrekvenco
ta: கேட்ரோஃப்ரெக்வென்சிங்

source: agordas la nombron de kadroj kaptitaj de la kamerao ĉiun sekundon (pli altaj valoroj produktas pli mildajn filmetojn sed postulas pli da CPU-potenco, pli grandan stokadon kaj larĝan bandon)
ta: ஒவ்வொரு நொடியும் கேமராவால் கைப்பற்றப்பட்ட பிரேம்களின் எண்ணிக்கை (அதிக மதிப்புகள் மென்மையான வீடியோக்களை உருவாக்குகின்றன, ஆனால் அதிக சிபியு ஆற்றல், பெரிய சேமிப்பு மற்றும் பரந்த இசைக்குழு தேவைப்படுகிறது)

source: Privateca masko
ta: தனியுரிமை முகமூடி

source: ebligas maskeradon de bildoj por eviti registradon de iuj bildaj areoj por protekti privatecon
ta: தனியுரிமையைப் பாதுகாக்க எந்த படப் பகுதிகளையும் பதிவு செய்வதைத் தவிர்க்க படங்களை முகமூடி அணிந்துகொள்வது

source: Redakti maskon
ta: முகமூடியைத் திருத்து

source: Konservi maskon
ta: முகமூடி வைத்திருங்கள்

source: alklaku ĉi tiun butonon por ebligi/malebligi la maskan redaktilon
ta: முகமூடி எடிட்டரை இயக்க/முடக்க இந்த பொத்தானைக் சொடுக்கு செய்க

source: Ekstraj Elektoj
ta: கூடுதல் தேர்வுகள்

source: vi povas aldoni iujn ajn pliajn opciojn ĉi tie por la «motion» demono (uzu la «nomo valoro» formaton, unu opcion por linio)
ta: "மோசன்" அரக்கனுக்கு கூடுதல் விருப்பங்களை இங்கே சேர்க்கலாம் ("பெயர் மதிப்பு" வடிவமைப்பைப் பயன்படுத்தவும், ஒரு வரிக்கு ஒரு விருப்பம்)

source: elektu kie kaj kiel viaj amaskomunikiloj estas konservitaj
ta: உங்கள் ஊடகங்கள் எங்கு, எப்படி சேமிக்கப்படுகின்றன என்பதைத் தேர்வுசெய்க

source: Stokado de dosieroj
ta: கோப்பு சேமிப்பு

source: Stokada Aparato
ta: சேமிப்பக சாதனம்

source: indikas la stokan aparaton, kie la bildo kaj video-dosieroj estos konservitaj
ta: படம் மற்றும் வீடியோ கோப்புகள் சேமிக்கப்படும் சேமிப்பக சாதனத்தைக் குறிக்கிறது

source: Retservilo
ta: வலை சேவையகம்

source: la adreso de la retservilo (IP-adreso aŭ nomo)
ta: வலை சேவையகத்தின் முகவரி (ஐபி முகவரி அல்லது பெயர்)

source: SMB Protokolo-Versio
ta: SMB நெறிமுறை பதிப்பு

source: elektu la SMB-version, kiun vi povas uzi (testu la malsamajn eblojn kaj vidu, kiu funkcias plej bone kun via NAS)
ta: நீங்கள் பயன்படுத்தக்கூடிய SMB பதிப்பைத் தேர்ந்தெடுக்கவும் (வெவ்வேறு விருப்பங்களைச் சோதித்து, உங்கள் NAS உடன் எது சிறப்பாக செயல்படுகிறது என்பதைப் பாருங்கள்)

source: Kunhava nomo
ta: பகிரப்பட்ட பெயர்

source: la nomo de la interŝanĝa reto
ta: பரிமாற்ற வலையமைப்பின் பெயர்

source: Uzantnomo
ta: பயனர்பெயர்

source: la uzantnomo kiu estu provizita kiam vi aliras la reton dosierujon (lasu malplena se neniu uzantnomo estas bezonata)
ta: நீங்கள் பிணையம் கோப்பகத்தை அணுகும்போது வழங்கப்படும் பயனர்பெயர் (பயனர்பெயர் தேவையில்லை என்றால் காலியாக விடவும்)

source: Pasvorton
ta: கடவுச்சொல்

source: la pasvorto bezonata de la reto dosierujo (lasi malplena se neniu pasvorto estas bezonata)
ta: பிணைய கோப்பகத்திற்கு தேவையான கடவுச்சொல் (கடவுச்சொல் தேவையில்லை என்றால் காலியாக விடவும்)

source: Radika dosierujo
ta: ரூட் அடைவு

source: la radika vojo (sur la elektita stokada aparato), kie la dosieroj estos konservitaj
ta: கோப்புகள் சேமிக்கப்படும் ரூட் பாதை (தேர்ந்தெடுக்கப்பட்ட சேமிப்பக சாதனத்தில்)

source: Testi la reton dosierujon
ta: பிணைய கோப்புறையை சோதிக்கவும்

source: alklaku ĉi tiun butonon por testi la retan kunlokon post kiam vi plenigis la postulatajn detalojn
ta: தேவையான விவரங்களை நீங்கள் நிரப்பிய பிறகு நிகழ்நிலை கோ -செயல்பாட்டை சோதிக்க இந்த பொத்தானைக் சொடுக்கு செய்க

source: Uzado de Disko
ta: வட்டைப் பயன்படுத்துதல்

source: la uzata/tuta grandeco de la disko, kie loĝas la radika dosierujo
ta: ரூட் அடைவு வாழும் வட்டின் பயன்படுத்தப்பட்ட/மொத்த அளவு

source: Alŝutu Mediajn Dosierojn
ta: சுற்றுச்சூழல் கோப்புகளைப் பதிவேற்றவும்

source: aktivigu ĉi tiun opcion, se vi volas, ke viaj amaskomunikiloj estu alŝutitaj al ekstera servo
ta: உங்கள் மீடியா வெளிப்புற சேவையில் பதிவேற்றப்பட வேண்டும் என்று நீங்கள் விரும்பினால் இந்த விருப்பத்தை செயல்படுத்தவும்

source: Alŝutu Bildojn
ta: படங்களை பதிவேற்றவும்

source: aktivigu ĉi tiun opcion, se vi volas, ke la bildoj elŝutiĝu al ekstera servo
ta: படங்கள் வெளிப்புற சேவைக்கு பதிவிறக்கம் செய்ய விரும்பினால் இந்த விருப்பத்தை செயல்படுத்தவும்

source: Alŝutu Filmojn
ta: திரைப்படங்களைப் பதிவேற்றவும்

source: ebligu ĉi tion, se vi volas, ke filmetoj estu alŝutitaj al ekstera servo
ta: வீடியோக்களை வெளிப்புற சேவையில் பதிவேற்ற விரும்பினால் இதை இயக்கவும்

source: Alŝuta Servo
ta: சேவையைப் பதிவேற்றவும்

source: Servilo FTP
ta: FTP சேவையகம்

source: elektu servon, al kiu la mediadosieroj estu alŝutitaj
ta: மீடியா கோப்புகளை பதிவேற்ற வேண்டிய சேவையைத் தேர்வுசெய்க

source: Servila Adreso
ta: சேவையக முகவரி

source: la domajna nomo aŭ IP-adreso de la servilo (ekz. ftp.example.com aŭ 192.168.1.3)
ta: சேவையகத்தின் டொமைன் பெயர் அல்லது ஐபி முகவரி (எ.கா. ftp.example.com அல்லது 192.168.1.3)

source: Servila haveno
ta: சேவையக துறைமுகம்

source: la haveno por uzi konekti al la servo (lasu ĉi tiun kampon malplena por uzi la defaŭltan valoron)
ta: சேவையுடன் இணைக்க பயன்படுத்த வேண்டிய துறைமுகம் (இயல்புநிலை மதிப்பைப் பயன்படுத்த இந்த புலத்தை காலியாக விடவும்)

source: Metodo
ta: முறை

source: la HTTP-metodo uzi por alŝuti dosierojn
ta: கோப்புகளை பதிவேற்ற பயன்படுத்த HTTP முறை

source: Finpunkto URL
ta: எண்ட்பாயிண்ட் முகவரி

source: La kompleta URL al la alŝuta servila finpunkto:
ta: பதிவேற்ற சேவையக இறுதிப்புள்ளிக்கு முழுமையான URL:

source: Por S3: ekz. http://my.minio:9000. Lasu ĝin malplena por AWS!
ta: S3 க்கு: எ.கா. http: //my.minio: 9000. AWS க்கு காலியாக விடுங்கள்!

source: Por WebDAV: ekz. https://my.cloud/remote.php/dav/files/Me/
ta: வழங்கியவர் வெப்டாவ்: ஈ.கே.இசட். https://my.cloud/remote.php/dav/files/me/

source: Loko
ta: லோகோ

source: la loko (radika vojo) kie amaskomunikiloj devas esti alŝutitaj (ekz. /files/cam1/)
ta: மீடியா பதிவேற்றப்பட வேண்டிய இடம் (ரூட் பாதை) (எ.கா./கோப்புகள்/கேம் 1/)

source: Inkluzivi Subdosierujojn
ta: துணை அடைவுகளைச் சேர்க்கவும்

source: Aktivigu tion por elŝuti plurmediajn dosierojn kun siaj subdosierujoj, anstataŭ meti ilin rekte en la radikan lokon
ta: மல்டிமீடியா கோப்புகளை அவற்றின் துணை அடைவுகளுடன் பதிவிறக்கம் செய்ய இதைச் செயல்படுத்தவும், அவற்றை நேரடியாக ரூட் இருப்பிடத்திற்குள் வைப்பதற்குப் பதிலாக

source: Purigi la nubon
ta: மேகத்தை தூய்மை செய்ய

source: ebligu ĉi tion forigi amaskomunikilaĵojn dosierojn alŝutitajn al la nubo ankaŭ kiam loka amaskomunikilaro estas forigita konforme al la agordo de persistemo de dosieroj. Nuntempe ĉi tiu opcio nur haveblas por gdrivo.
ta: கோப்பு தீர்மானத்தின் உள்ளமைவுக்கு ஏற்ப உள்ளக ஊடகங்கள் நீக்கப்படும் போது மேகக்கட்டத்தில் பதிவேற்றப்பட்ட மீடியா கோப்புகளை நீக்க இதை இயக்கவும். தற்போது இந்த விருப்பம் GDRIV க்கு மட்டுமே கிடைக்கிறது.

source: la uzantnomo por la alŝuta servo-konto
ta: பதிவேற்றும் பணி கணக்கிற்கான பயனர்பெயர்

source: la pasvorto por la alŝuta servo-konto
ta: பதிவேற்றும் பணி கணக்கிற்கான கடவுச்சொல்

source: Rajtiga ŝlosilo
ta: அங்கீகார விசை

source: la ŝlosilo uzata por aŭtentiĝi kun la alŝuta servo (kutime bezonata nur dum agordo)
ta: பதிவேற்ற சேவையுடன் அங்கீகரிக்கப் பயன்படுத்தப்படும் விசை (பொதுவாக உள்ளமைவின் போது மட்டுமே தேவைப்படுகிறது)

source: Akiri ŝlosilon
ta: ஒரு சாவியைப் பெறுங்கள்

source: alklaku ĉi tie por akiri la ŝlosilan rajtigan servon
ta: முக்கிய அங்கீகார சேவையைப் பெற இங்கே சொடுக்கு செய்க

source: Access Key
ta: அணுகல் விசை

source: The AWS access key used to authenticate with the upload service
ta: பதிவேற்ற சேவையுடன் அங்கீகரிக்கப் பயன்படுத்தப்படும் AWS அணுகல் விசை

source: Sekreta Alira Ŝlosilo
ta: ரகசிய அணுகல் விசை

source: la AWS-sekreta alira ŝlosilo uzata por aŭtentiĝi kun la alŝuta servo (kutime bezonata nur dum agordo)
ta: பதிவேற்ற சேவையுடன் அங்கீகரிக்கப் பயன்படுத்தப்படும் AWS ரகசிய அணுகல் விசை (பொதுவாக உள்ளமைவின் போது மட்டுமே தேவைப்படுகிறது)

source: Sitelo
ta: வாளி

source: la nomo S3-sitelo por la alŝuta servo (kutime bezonata nur dum agordo)
ta: பதிவேற்ற சேவைக்கான S3 SELLE என்ற பெயர் (பொதுவாக உள்ளமைவின் போது மட்டுமே தேவைப்படுகிறது)

source: Testi la servon
ta: சேவையை சோதிக்கவும்

source: alklaku ĉi tiun butonon por provi la alŝutan servon post kiam vi plenigis la postulatajn detalojn
ta: தேவையான விவரங்களை நீங்கள் நிரப்பிய பிறகு பதிவேற்ற சேவையைச் சோதிக்க இந்த பொத்தானைக் சொடுக்கு செய்க

source: alvoki URL
ta: முகவரி ஐ அழைக்கவும்

source: ebligu ĉi tion, se vi volas, ke URL estu petata post kreado de amaskomunikila dosiero
ta: மீடியா கோப்பை உருவாக்கிய பிறகு முகவரி ஐ கோர விரும்பினால் இதை இயக்கவும்

source: Reteja URL
ta: வலைத்தள முகவரி

source: ekz. http://example.com/notify/
ta: எ.கா. http://example.com/notify/

source: URL por transdoni kiam moviĝo estas detektita; la sekvaj specialaj ŝparvojoj estas akceptitaj:%%Y = jaro,%%m = monato,%%d = tago,%%H = horo,%%M = minuto,%%S = sekundo,%%q = kadro numero,%%v = evento numero,%%f = dosiera vojo
ta: இயக்கம் கண்டறியப்படும்போது மாற்ற URL; பின்வரும் சிறப்பு குறுக்குவழிகள் ஏற்றுக்கொள்ளப்படுகின்றன: %% ஒய் = ஆண்டு, %% m = மாதம், %%d = நாள், %% H = மணிநேரம், %% m = மணித்துளி, %% S = இரண்டாவது, %% Q = பிரேம் எண், %% v = நிகழ்வு எண், %% f = கோப்பு வழி

source: Metodo HTTP
ta: மெட்டோடோ http

source: la HTTP-metodo por uzi kiam vi petas retan hoko-URL (la donitaj URL-koditaj parametroj fakte estos transdonitaj kiel indikite ĉi tie)
ta: நிகழ்நிலை ஊக்-யுஆர்எல்-க்கு நீங்கள் விண்ணப்பிக்கும்போது பயன்படுத்த HTTP முறை (கொடுக்கப்பட்ட முகவரி குறியிடப்பட்ட அளவுருக்கள் உண்மையில் இங்கே சுட்டிக்காட்டப்பட்டுள்ளபடி வழங்கப்படும்)

source: Kuri Komando
ta: கச்கொட்டை கட்டளை

source: ebligu ĉi tion, se vi volas ekzekuti komandon post kiam media dosiero estas kreita
ta: சுற்றுச்சூழல் கோப்பு உருவாக்கப்பட்ட பிறகு நீங்கள் ஒரு கட்டளையை இயக்க விரும்பினால் இதை இயக்கவும்

source: Ordono
ta: ஒழுங்கு

source: ordono…
ta: ஒழுங்கு ...

source: Komando por esti plenumita post la kreo de plurmedia dosiero. Pluraj komandoj povas esti apartigitaj per punktoknomo; ne uzu punktoknomo en komandojn; la sekvaj specialaj tokensoj estas akceptitaj: %%Y = jaro, %%m = monato, %%d = tago, %%H = horo, %%M = minuto, %%S = sekundo, %%q = kadra numero , %%v = okaza numero, %%f = dosiera vojo
ta: மல்டிமீடியா கோப்பை உருவாக்கிய பிறகு நிறைவு செய்ய கட்டளை. பல கட்டளைகளை ஒரு புள்ளி பெயரால் பிரிக்கலாம்; ஒரு புள்ளி பெயரை கட்டளைகளில் பயன்படுத்த வேண்டாம்; பின்வரும் சிறப்பு டோக்கன்கள் ஏற்றுக்கொள்ளப்படுகின்றன: %% ஒய் = ஆண்டு, %% m = மாதம், %%d = நாள், %% H = மணிநேரம், %% m = மணித்துளி, %% S = இரண்டாவது, %% Q = பிரேம் எண், %% V = அவ்வப்போது எண், %% f = கோப்பு வழி

source: elektu kiajn informojn montras sur la kaptitaj kadroj
ta: சிக்கிய பிரேம்களில் செய்தி காண்பிப்பதைத் தேர்ந்தெடுக்கவும்

source: Teksto Superkovrita
ta: உரை ஒன்றுடன் ஒன்று

source: Maldekstra Teksto
ta: இடது உரை

source: Tempostampo
ta: தற்காலிக

source: Propra Teksto
ta: தனிப்பயன் உரை

source: Malebligita
ta: முடக்கப்பட்டது

source: Fiksas la tekston montritan sur la filmoj kaj bildoj, sur la malsupra maldekstra angulo
ta: திரைப்படங்கள் மற்றும் படங்களில் காட்டப்பட்டுள்ள உரையை கீழ் இடது மூலையில் அமைக்கவும்

source: propra teksto…
ta: தனிப்பயன் உரை ...

source: Difinas kutimon maldekstran tekston; la sekvaj specialaj tokensoj estas akceptitaj:%%Y = jaro,%%m = monato,%%d = tago,%%H = horo,%%M = minuto,%%S = sekundo,%%q = kadro numero,%%v = evento numero,%%T = HH:MM:SS, \n = nova linio
ta: தனிப்பயன் இடது உரையை வரையறுக்கிறது; பின்வரும் சிறப்பு டோக்கன்கள் ஏற்றுக்கொள்ளப்படுகின்றன: %% ஒய் = ஆண்டு, %% m = மாதம், %%d = நாள், %% H = மணிநேரம், %% m = மணித்துளி, %% S = இரண்டாவது, %% Q = பிரேம் எண், %% V = நிகழ்வு எண், %% T = HH: MM: SS, \ n = புதிய வரி

source: Dekstra Teksto
ta: சரியான உரை

source: Fiksas la tekston montritan sur la filmoj kaj bildoj, sur la malsupra dekstra angulo
ta: திரைப்படங்கள் மற்றும் படங்களில் காட்டப்பட்டுள்ள உரையை கீழ் வலது மூலையில் அமைக்கவும்

source: Difinas kutimon dekstran tekston; la sekvaj specialaj tokensoj estas akceptitaj:%%Y = jaro,%%m = monato,%%d = tago,%%H = horo,%%M = minuto,%%S = sekundo,%%q = kadro numero,%%v = evento numero,%%T = HH:MM:SS, \n = nova linio
ta: தனிப்பயன் சரியான உரையை வரையறுக்கிறது; பின்வரும் சிறப்பு டோக்கன்கள் ஏற்றுக்கொள்ளப்படுகின்றன: %% ஒய் = ஆண்டு, %% m = மாதம், %%d = நாள், %% H = மணிநேரம், %% m = மணித்துளி, %% S = இரண்டாவது, %% Q = பிரேம் எண், %% V = நிகழ்வு எண், %% T = HH: MM: SS, \ n = புதிய வரி

source: Teksta Skalo
ta: உரை துவைக்கப்பட்டது

source: Difinas la grandecon de la superkovrita teksto
ta: ஒன்றுடன் ஒன்று உரையின் அளவை வரையறுக்கிறது

source: Ebligu ĉi tion, se vi volas videofluon por ĉi tiu fotilo
ta: இந்த கேமராவுக்கு வீடியோ ச்ட்ரீம் விரும்பினால் இதை இயக்கவும்

source: Videofluo
ta: வீடியோஃப்ளூ

source: Framo frekvencon
ta: சட்ட அதிர்வெண்

source: Fiksas la nombron de kadroj transdonitaj ĉiun sekundon en la viva fluo.
ta: நேரடி ஓட்டத்தில் ஒவ்வொரு நொடியும் வழங்கப்பட்ட பிரேம்களின் எண்ணிக்கையை சரிசெய்யவும்.

source: Flua Kvalito
ta: சரளமான தகுதி

source: Agordas la vivan fluan kvaliton (pli altaj valoroj produktas pli bonan videokvaliton sed postulas pli da larĝa bando).
ta: சுங்க நேரடி ஓட்ட தகுதி (அதிக மதிப்புகள் சிறந்த வீடியோ தரத்தை உருவாக்குகின்றன, ஆனால் அதிக பிராட்பேண்ட் தேவைப்படுகிறது).

source: Bilda Redimensionado
ta: பில்டா மறுவடிவமைப்பு

source: Kiam ĉi tio estas enŝaltita, la bildoj estas regrandigitaj antaŭ ol ili estas senditaj al la retumilo (malebligu dum funkciado sur malrapida CPU).
ta: இது இயக்கப்படும் போது, ​​படங்கள் உலாவிக்கு அனுப்பப்படுவதற்கு முன்பு அவை மறுஅளவிடப்படுகின்றன (மெதுவான சிபியு இல் இயங்கும் போது தடுக்கவும்).

source: Flua rezolucio
ta: சரளமான தீர்மானம்

source: la rezolucio donita kiel procento de la rezolucio de la video-aparato (pli altaj valoroj produktas pli bonan videan kvaliton sed postulas pli da larĝa de bando)
ta: வீடியோ சாதனத்தின் தீர்மானத்தின் சதவீதமாக வழங்கப்பட்ட தீர்மானம் (அதிக மதிப்புகள் சிறந்த வீடியோ தரத்தை உருவாக்குகின்றன, ஆனால் அதிக அலைவரிசை தேவைப்படுகிறது)

source: Flua haveno
ta: சரளமாக துறைமுகம்

source: starigas la TCP-havenon, sur kiu aŭskultas la ret-servila ret-servo
ta: வலை சேவையகம் கேட்கும் TCP போர்ட்டை அமைக்கிறது

source: Aŭtentiga reĝimo
ta: அங்கீகார முறை

source: la aŭtentiga metodo uzata de la rivereto (elektu 'Bazic' anstataŭ 'Digest' se vi renkontas problemojn kun triaj programoj); akreditoj kontroloj estos uzataj
ta: ச்ட்ரீம் பயன்படுத்தும் அங்கீகார முறை (மூன்றாவது -பார்ட்டி நிரல்களில் சிக்கல்களை எதிர்கொண்டால் 'டைசச்ட்' என்பதற்கு பதிலாக 'பாசிக்' என்பதைத் தேர்ந்தெடுக்கவும்); அங்கீகாரக் கட்டுப்பாடுகள் பயன்படுத்தப்படும்

source: Movado-Optimigo
ta: இயக்கம் தேர்வுமுறை

source: ebligu ĉi tion, se vi volas pli malaltan kadran indicon por la livera fluo kiam neniu movo estas detektita
ta: எந்த நகர்வும் கண்டறியப்படாதபோது விநியோக ஓட்டத்திற்கு குறைந்த பிரேம் வீதத்தை நீங்கள் விரும்பினால் இதை இயக்கவும்

source: Utilaj URLoj
ta: பயனுள்ள முகவரி கள்

source: Instantara URL
ta: முகவரி நிறுவுதல்

source: URL kiu provizas JPEG-bildon kun la plej freŝa kaptaĵo de la kamerao
ta: கேமராவின் மிக அண்மைக் கால பிடிப்புடன் JPEG படத்தை வழங்கும் முகவரி

source: Flua URL
ta: முகவரி ஐ பறக்க

source: URL kiu provizas MJPEG-fluon de la kamerao
ta: கேமராவிலிருந்து MJPEG ஓட்டத்தை வழங்கும் முகவரி

source: Enigita URL
ta: உட்பொதிக்கப்பட்ட முகவரி

source: URL kiu provizas minimuman HTML-dokumenton enhavantan la kameraan kadron, preta por esti enigita
ta: கேமரா கட்டமைப்பைக் கொண்ட குறைந்தபட்ச உஉகுமொ ஆவணத்தை வழங்கும் முகவரி, உட்பொதிக்க தயாராக உள்ளது

source: Ebligu ĉi tion, se vi volas kapti statika bildojn.
ta: நீங்கள் நிலையான படங்களை பிடிக்க விரும்பினால் இதை இயக்கவும்.

source: Kaptitaj Bildoj
ta: கைப்பற்றப்பட்ட படங்கள்

source: Nomo Bildo-Dosiero
ta: படக் கோப்பை பெயர்

source: dosiernomo ŝablono…
ta: கோப்பு பெயர் வார்ப்புரு ...

source: Difinas la nomon ŝablonon por bilddosieroj (JPEG); la sekvaj specialaj tokensoj estas akceptitaj:%%Y = jaro,%%m = monato,%%d = tago,%%H = horo,%%M = minuto,%%S = sekundo,%%q = kadro numero,%%v = evento numero, / = subdosierujo.
ta: படக் கோப்புகளுக்கான பெயர் வார்ப்புருவை வரையறுக்கிறது (JPEG); பின்வரும் சிறப்பு டோக்கன்கள் ஏற்றுக்கொள்ளப்படுகின்றன: %% ஒய் = ஆண்டு, %% m = மாதம், %%d = நாள், %% H = மணிநேரம், %% m = மணித்துளி, %% S = இரண்டாவது, %% Q = பிரேம் எண், %% V = நிகழ்வு எண், / = துணை அடைவு.

source: Bildkvalito
ta: பட தகுதி

source: agordas la JPEG-bildkvaliton (pli altaj valoroj produktas pli bonan bildan kvaliton sed postulas pli da stokado)
ta: சுங்க JPEG பண தகுதி (அதிக மதிப்புகள் சிறந்த பட தரத்தை உருவாக்குகின்றன, ஆனால் அதிக சேமிப்பு தேவை)

source: Kaptila reĝimo
ta: பொறி முறை

source: Moviĝa deĉenigo
ta: நகரும் தூண்டுதல்

source: Moviĝa deĉenigo (Unu bildo)
ta: நகரும் தூண்டுதல் (ஒரு படம்)

source: Intertempe
ta: இதற்கிடையில்

source: Ĉiuj bildoj
ta: அனைத்து படங்கள்

source: Mane
ta: மானே

source: Difinas la kapta reĝimon:
ta: பிடிப்பு பயன்முறையை வரையறுக்கிறது:

source: Moviĝa deĉenigo = bildo kaptita ĉiufoje kiam moviĝo estas detektita,
ta: இயக்க தூண்டுதல் = ஒவ்வொரு முறையும் இயக்கம் கண்டறியப்படும் போது கைப்பற்றப்பட்ட படம்,

source: Intertempe = bildo kaptita ĉiun x sekundojn,
ta: இதற்கிடையில் = ஒவ்வொரு ஃச் விநாடிகளிலும் படம் பிடித்தது,

source: Ĉiuj bildoj = konservas ĉiun kadron en bildodosiero,
ta: எல்லா படங்களும் = ஒவ்வொரு சட்டத்தையும் ஒரு படக் கோப்பில் வைத்திருங்கள்,

source: Mane = mana kapto kun dediĉita butono.
ta: Mane = பிரத்யேக பொத்தானைக் கொண்டு கை பிடிப்பு.

source: Interkapto-Intervalo
ta: இடைமறிப்பு இடைவெளி

source: sekundoj
ta: விநாடிகள்

source: agordas la intervalon (en sekundoj) por la kaptiloj
ta: பொறிகளுக்கு இடைவெளியை (நொடிகளில்) அமைக்கவும்

source: Konservi bildojn
ta: படங்களை வைத்திருக்க

source: Dum unu tago
ta: ஒரு நாள்

source: Dum unu semajno
ta: ஒரு வாரம்

source: Dum unu monato
ta: ஒரு மாதத்திற்கு

source: Dum unu jaro
ta: ஒரு வருடம்

source: Porĉiame
ta: என்றென்றும்

source: Propra
ta: சொந்தமானது

source: Bildoj pli aĝaj ol la difinita daŭro estas aŭtomate forigitaj por liberigi stokadan spacon.
ta: சேமிப்பக இடத்தை வெளியிடுவதற்கு வரையறுக்கப்பட்ட காலத்தை விட பழைய படங்கள் தானாக அகற்றப்படும்.

source: Bildaj Vivdaŭro
ta: பட வாழ்நாள்

source: Difinas la nombron da tagoj post kiuj la bildoj estos forigitaj aŭtomate.
ta: படங்கள் தானாக நீக்கப்படும் நாட்களின் எண்ணிக்கையை வரையறுக்கிறது.
