Repository: 247i/TACETr
Catalog: உரை/தானி/newpipe-strings-*.po
Languages: ta

# invalid_file
source: The file doesn't exist or permission to read or write to it is lacking
ta: கோப்பு இல்லை அ அதனை எழுதபடிக்கும் அனுமதி குறைகிறது

# file_name_empty_error
source: Filename cannot be empty
ta: கோப்பு பெயர் காலியாக இருக்க முடியாது

# error_occurred_detail
source: An error occurred: %1$s
ta: ஒரு பிழை நிகழ்ந்தது: %1$s

# no_streams_available_download
source: No streams available to download
ta: பதிவிறக்கா எப்பாய்வும் கிடைக்கவில்லை

# saved_tabs_invalid_json
source: Could not read saved tabs, so using default ones
ta: சேமித்த தாவல்களை வாசிக்க முடியவில்லை, ஆக இயல்பிருப்புகளைப் பயன்படுத்துகிறது

source: Restore defaults
ta: இயல்பிருப்புகளை மீட்டெடு

# restore_defaults_confirmation
source: Do you want to restore defaults?
ta: இயல்பிருப்புகளை மீட்டெடுக்க வேண்டுமா?

# permission_display_over_apps
source: Give permission to display over other apps
ta: பிற செயலிகள் மீது காட்டும் அனுமதி கொடு

# error_report_notification_title
source: NewPipe encountered an error, tap to report
ta: NewPipe பிழையைச் எதிர்கொண்டது, புகாரளிக்க தட்டு

# error_report_notification_toast
source: An error occurred, see the notification
ta: பிழை ஏற்பட்டது, அறிவிப்பைப் பார்

# sorry_string
source: Sorry, that should not have happened.
ta: மன்னிக்கவும்.

# error_report_button_text
source: Report via e-mail
ta: மின்னஞ்சல் வழியாக அறிக்கை

# copy_for_github
source: Copy formatted report
ta: வடிவமைக்கப்பட்ட அறிக்கையை நகலெடு

# error_report_open_issue_button_text
source: Report on GitHub
ta: GitHub இல் புகாரளி

# error_report_open_github_notice
source: Please check whether an issue discussing your crash already exists. When creating duplicate tickets, you take time from us which we could spend with fixing the actual bug.
ta: உங்கள் விபத்து பற்றி விவாதிக்கும் சிக்கல் ஏற்கனவே இருக்கிறதா என்று சரிபார்க்கவும். நகல் டிக்கெட்டுகளை உருவாக்கும்போது, ​​உண்மையான பிழையை சரிசெய்ய நாங்கள் செலவழிக்கக்கூடிய எங்களிடமிருந்து நீங்கள் நேரத்தை எடுத்துக்கொள்கிறீர்கள்.

# error_snackbar_message
source: Sorry, something went wrong.
ta: மன்னிக்கவும், ஏதோ தவறாகிற்று.

# error_snackbar_action
source: Report
ta: புகாரளி

# what_device_headline
source: Info:
ta: தகவல்:

# what_happened_headline
source: What happened:
ta: என்ன நடந்தது:

# info_labels
source: What:\nRequest:\nContent Language:\nContent Country:\nApp Language:\nService:\nGMT Time:\nPackage:\nVersion:\nOS version:
ta: என்ன:\nகோரிக்கை:\nஉள்ளடக்க மொழி:\nஉள்ளடக்க நாடு:\nசெயலி மொழி:\nசேவை:\nGMT நேரம்:\nசிப்பம்:\nபதிப்பு:\nOS பதிப்பு:

# your_comment
source: Your comment (in English):
ta: உங்கள் கருத்து:

# error_details_headline
source: Details:
ta: விவரங்கள்:

# detail_thumbnail_view_description
source: Play video, duration:
ta: காணொளியை இயக்கு, காலவளவு:

# detail_uploader_thumbnail_view_description
source: Uploader's avatar thumbnail
ta: பதிவேற்றியவரின் அவதார் சிறுபடம்

# detail_likes_img_view_description
source: Likes
ta: விருப்பங்கள்

# detail_dislikes_img_view_description
source: Dislikes
ta: வெறுப்புகள்

# comments_tab_description
source: Comments
ta: கருத்தளிப்புகள்

# related_items_tab_description
source: Related items
ta: உறவுடைய உருப்படிகள்

# description_tab_description
source: Description
ta: விவரிப்பு

# search_no_results
source: No results
ta: முடிவுகள் இல்லை

# empty_list_subtitle
source: Nothing here but crickets
ta: எந்த முடிவுகளும் இல்லை

# import_subscriptions_hint
source: Import or export subscriptions from the 3-dot menu
ta: 3-டாட் மெனுவிலிருந்து சந்தாக்களை இறக்குமதி செய்யுங்கள் அல்லது ஏற்றுமதி செய்யுங்கள்

# detail_drag_description
source: Drag to reorder
ta: இழுத்து வரிசைமாற்று

source: Video
ta: காணொலி

source: Audio
ta: ஒலி

source: Retry
ta: மீண்டும் முயற்சி

# short_thousand
source: k
ta: ஆ

# short_million
source: M
ta: ப.ல

# short_billion
source: B
ta: நி

# drawer_header_description
source: Toggle service, currently selected:
ta: சேவையை மாற்றி, தற்போது தேர்ந்தெடுக்கப்பட்டது:

source: No subscribers
ta: பின் தொடர்பவர்கள் இல்லை

# subscribers
source: %s subscriber
ta: %s பின் தொடர்பவர்

# subscribers_count_not_available
source: Subscriber count unavailable
ta: சந்தாதாரர் எண்ணிக்கை கிடைக்கவில்லை

source: No views
ta: யாரும் பார்க்கவில்லை

# views
source: %s view
ta: %s பார்வை

# no_one_watching
source: No one is watching
ta: யாரும் பார்க்கவில்லை

# watching
source: %s watching
ta: %s பார்க்கிறார்

# no_one_listening
source: No one is listening
ta: யாரும் கேட்கவில்லை

# listening
source: %s listener
ta: %s கேட்பவர்

source: No videos
ta: வீடியோக்கள் இல்லை

# more_than_100_videos
source: 100+ videos
ta: 100+ வீடியோக்கள்

# infinite_videos
source: ∞ videos
ta: வீடியோக்கள்

# videos
source: %s video
ta: %sகாணொளிகள்

source: No comments
ta: கருத்துகள் இல்லை

source: Comments are disabled
ta: கருத்துகள் முடக்கப்பட்டுள்ளன

source: No streams
ta: நீரோடைகள் இல்லை

source: No live streams
ta: நேரடி நீரோடைகள் இல்லை

# new_streams
source: %s new stream
ta: %புதிய ச்ட்ரீம்

source: Start
ta: தொடங்கு

source: Pause
ta: இடைநிறுத்தம்

source: Create
ta: உருவாக்கு

source: Delete
ta: நீக்கு

source: Checksum
ta: செக்சம்

source: Dismiss
ta: தள்ளுபடி

source: Rename
ta: மறுபெயரிடுங்கள்

# msg_name
source: Filename
ta: கோப்புப்பெயர்

# msg_threads
source: Threads
ta: நூல்கள்

# msg_error
source: Error
ta: பிழை

# msg_running
source: NewPipe Downloading
ta: நியூபைப் பதிவிறக்குதல்

# msg_running_detail
source: Tap for details
ta: விவரங்களுக்கு தட்டவும்

# msg_calculating_hash
source: Calculating hash
ta: ஆச் கணக்கிடுதல்

# msg_wait
source: Please wait…
ta: தயவுசெய்து காத்திருங்கள்…

# msg_copied
source: Copied to clipboard
ta: நகலகத்திற்கு நகலெடுக்கபட்டது

# msg_failed_to_copy
source: Failed to copy to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுப்பதில் தோல்வி

# no_available_dir
source: Please define a download folder later in settings
ta: பின்னர் பதிவிறக்க அடைவை அமைவில் வரையறுக்கவும்

# no_dir_yet
source: No download folder set yet, choose the default download folder now
ta: பதிவிறக்க அடைவு இன்னும் அமைக்கப்படவில்லை, இப்போதைக்கு இயல்பிருப்பு பதிவிறக்க அடைவைத் தெரிவுசெய்

# msg_popup_permission
source: This permission is needed to open in popup mode
ta: இந்த இசைவு தேவை பாப்அப் பயன்முறையில் திறக்கவும்

# one_item_deleted
source: 1 item deleted.
ta: ஒரு உருப்படி நீக்கப்பட்டது.

# title_activity_recaptcha
source: reCAPTCHA challenge
ta: ரெக்காப்ட்சா அறைகூவல்

# subtitle_activity_recaptcha
source: Press "Done" when solved
ta: தீர்க்கும்போது "முடிந்தது" என்பதை அழுத்தவும்

# recaptcha_request_toast
source: reCAPTCHA challenge requested
ta: ரெக்காப்ட்சா அறைகூவல் கோரப்பட்டது

# recaptcha_solve
source: Solve
ta: தீர்க்க

source: Done
ta: முடிந்தது

# settings_category_downloads_title
source: Download
ta: பதிவிறக்கம்

# settings_file_charset_title
source: Allowed characters in filenames
ta: கோப்புப்பெயர்களில் அனுமதிக்கப்பட்ட வரியுருக்கள்

# settings_file_replacement_character_summary
source: Invalid characters are replaced with this value
ta: செல்லா வரியுருக்கள் இம்மதிப்புடன் மாற்றீடுசெய்யப்படும்

# settings_file_replacement_character_title
source: Replacement character
ta: மாற்றீடு வரியுரு

# charset_letters_and_digits
source: Letters and digits
ta: கடிதங்கள் மற்றும் இலக்கங்கள்

# charset_most_special_characters
source: Most special characters
ta: மிகவும் சிறப்பு எழுத்துக்கள்

# title_activity_about
source: About NewPipe
ta: நியூபைப் பற்றி

# title_licenses
source: Third-party Licenses
ta: மூன்றாம் தரப்பு உரிமங்கள்

# copyright
source: © %1$s by %2$s under %3$s
ta: © %1$s %2$s க்கு கீழ் %3$s க்கு கீழ்

# tab_about
source: About & FAQ
ta: பற்றி & கேள்விகள்

# tab_licenses
source: Licenses
ta: உரிமங்கள்

# app_description
source: Libre lightweight streaming on Android.
ta: ஆண்ட்ராய்டு இல் லிப்ரே லைட்வெயிட் ச்ட்ரீமிங்.

# contribution_title
source: Contribute
ta: பங்களிப்பு

# contribution_encouragement
source: Whether you have ideas of; translation, design changes, code cleaning, or real heavy code changes—help is always welcome. The more is done the better it gets!
ta: உங்களிடம் சிந்தனைகள் உள்ளதா; மொழிபெயர்ப்பு, வடிவமைப்பு மாற்றங்கள், குறியீடு தூய்மை அல்லது உண்மையான கனமான குறியீடு மாற்றங்கள் - உதவி எப்போதும் வரவேற்கத்தக்கது. மேலும் சிறப்பாகச் செய்யப்படுகிறது!

source: View on GitHub
ta: கிட்அப்பில் காண்க

# donation_title
source: Donate
ta: நன்கொடை

# donation_encouragement
source: NewPipe is developed by volunteers spending their free time bringing you the best user experience. Give back to help developers make NewPipe even better while they enjoy a cup of coffee.
ta: புதிய பயனர் அனுபவத்தை கொண்டு வரும் தன்னார்வலர்கள் தங்கள் இலவச நேரத்தை செலவழிப்பதன் மூலம் புதிய பாடத்தை உருவாக்கியுள்ளனர். உருவாக்குபவர்கள் ஒரு கப் காபியை அனுபவிக்கும் போது புதிய பக்கத்தை இன்னும் சிறப்பாக செய்ய உதவ உதவுகின்றன.

source: Give back
ta: திருப்பித் தரவும்

# website_title
source: Website
ta: வலைத்தளம்

# website_encouragement
source: Visit the NewPipe Website for more info and news.
ta: மேலும் செய்தி மற்றும் செய்திகளுக்கு நியூபைப் வலைத்தளத்தைப் பார்வையிடவும்.

# privacy_policy_title
source: NewPipe's Privacy Policy
ta: நியூபைப்பின் தனியுரிமைக் கொள்கை

# privacy_policy_encouragement
source: The NewPipe project takes your privacy very seriously. Therefore, the app does not collect any data without your consent. NewPipe's privacy policy explains in detail what data is sent and stored when you send a crash report.
ta: நியூபைப் திட்டம் உங்கள் தனியுரிமையை மிகவும் தீவிரமாக எடுத்துக்கொள்கிறது. எனவே, பயன்பாடு உங்கள் அனுமதியின்றி எந்த தரவையும் சேகரிக்காது. நீங்கள் ஒரு செயலிழப்பு அறிக்கையை அனுப்பும்போது என்ன தரவு அனுப்பப்படுகிறது மற்றும் சேமிக்கப்படுகிறது என்பதை நியூபிப்பின் தனியுரிமைக் கொள்கை விரிவாக விளக்குகிறது.

source: Read privacy policy
ta: தனியுரிமைக் கொள்கையைப் படியுங்கள்

# app_license_title
source: NewPipe's License
ta: நியூபைப்பின் உரிமம்

# app_license
source: NewPipe is copyleft libre software: You can use, study, share, and improve it at will. Specifically you can redistribute and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
ta: நியூபைப் என்பது நகலெடுக்கப்பட்ட லிப்ரே மென்பொருள்: நீங்கள் அதைப் பயன்படுத்தலாம், படிக்கலாம், பகிரலாம் மற்றும் மேம்படுத்தலாம். குறிப்பாக நீங்கள் இலவச மென்பொருள் அறக்கட்டளையால் வெளியிடப்பட்ட குனு பொது பொது உரிமத்தின் விதிமுறைகளின் கீழ் மறுபகிர்வு மற்றும்/அல்லது மாற்றியமைக்கலாம், உரிமத்தின் பதிப்பு 3 அல்லது (உங்கள் விருப்பத்தில்) பின்னர் எந்த பதிப்பையும் மாற்றலாம்.

# read_full_license
source: Read license
ta: உரிமத்தைப் படியுங்கள்

# faq_title
source: Frequently asked questions
ta: அடிக்கடி கேட்கப்படும் கேள்விகள்

# faq_description
source: If you are having trouble using the app, be sure to check out these answers to common questions!
ta: பயன்பாட்டைப் பயன்படுத்துவதில் சிக்கல் இருந்தால், பொதுவான கேள்விகளுக்கு இந்த பதில்களைப் பார்க்கவும்!

# faq
source: View on website
ta: இணையதளத்தில் காண்க

# title_activity_history
source: History
ta: வரலாறு

# action_history
source: History
ta: வரலாறு

# delete_item_search_history
source: Do you want to delete this item from search history?
ta: தேடல் வரலாற்றிலிருந்து இந்த உருப்படியை நீக்கவா?

# title_last_played
source: Last Played
ta: கடைசியாக விளையாடியது

# title_most_played
source: Most Played
ta: அதிகம் விளையாடியது

# main_page_content
source: Content of main page
ta: முகப்புப்பக்க உள்ளடக்கம்

# main_page_content_summary
source: What tabs are shown on the main page
ta: என்ன தாவல்கள் முதன்மையான பக்கத்தில் காட்டப்பட்டுள்ளன

# main_page_content_swipe_remove
source: Swipe items to remove them
ta: உருப்படிகளை அகற்ற அவற்றைத் தேய்

# blank_page_summary
source: Blank Page
ta: வெற்று பக்கம்

# kiosk_page_summary
source: Kiosk Page
ta: கியோச்க் பக்கம்

# default_kiosk_page_summary
source: Default Kiosk
ta: இயல்புநிலை கியோச்க்

# channel_page_summary
source: Channel Page
ta: சேனல் பக்கம்

source: Select a channel
ta: ஒரு சேனலைத் தேர்ந்தெடுக்கவும்

# no_channel_subscribed_yet
source: No channel subscriptions yet
ta: எப்பதிவுத்தட சந்தாக்களுமில்லை

source: Select a playlist
ta: ஒளிச்சரத்தைத் தேர்ந்தெடு

# no_playlist_bookmarked_yet
source: No playlist bookmarks yet
ta: ஒளிச்சர நூற்குறிகள் இன்னுமில

source: Select a kiosk
ta: ஒரு கியோச்கைத் தேர்ந்தெடுக்கவும்

# export_complete_toast
source: Exported
ta: ஏற்றுமதி

# import_complete_toast
source: Imported
ta: இறக்குமதி செய்யப்பட்டது

source: No valid ZIP file
ta: செல்லுபடியாகும் சிப் கோப்பு இல்லை

# could_not_import_all_files
source: Warning: Could not import all files.
ta: எச்சரிக்கை: எல்லா கோப்புகளையும் இறக்குமதி செய்ய முடியவில்லை.

# override_current_data
source: This will override your current setup.
ta: இது உங்கள் தற்போதைய அமைப்பை மேலெழுதும்.

# import_settings
source: Do you want to also import settings?
ta: அமைவையும் இறக்குமதி செய்யவா?

# error_unable_to_load_comments
source: Could not load comments
ta: கருத்துகளை ஏற்ற முடியவில்லை

# localization_changes_requires_app_restart
source: The language will change once the app is restarted
ta: பயன்பாடு மறுதொடக்கம் செய்யப்பட்டவுடன் மொழி மாறும்

source: Trending
ta: நடப்பு

source: Top 50
ta: முதல் 50

source: New and hot
ta: புதிய மற்றும் சூடான

source: Local
ta: உள்ளக

source: Recently added
ta: அண்மைக் காலத்தில் சேர்க்கப்பட்டது

source: Most liked
ta: மிகவும் பிடித்தது

source: Conferences
ta: மாநாடுகள்

# title_activity_play_queue
source: Play queue
ta: வரிசை விளையாடுங்கள்

# play_queue_remove
source: Remove
ta: அகற்று

# play_queue_stream_detail
source: Details
ta: விவரங்கள்

# play_queue_audio_settings
source: Audio Settings
ta: ஒலியமைவு

# play_queue_audio_track
source: Audio: %s
ta: ஆடியோ: %s

source: Audio track
ta: ஆடியோ டிராக்

# hold_to_append
source: Hold to enqueue
ta: சாரைபடுத்த நீண்டழுத்து

source: Show channel details
ta: பதிவுத்தட விவரங்களைக் காட்டு

# enqueue_stream
source: Enqueue
ta: சாரைபடுத்து

source: Enqueued
ta: சாரைபடுத்தப்பட்டது

# enqueue_next_stream
source: Enqueue next
ta: அடுத்தைச் சாரைபடுத்து

source: Enqueued next
ta: அடுத்தது சாரைபடுத்தப்பட்டது

# start_here_on_background
source: Start playing in the background
ta: பின்னணியில் இயங்கத் துவங்கு

# start_here_on_popup
source: Start playing in a popup
ta: பாப்அப்பில் இயங்கத் துவங்கு

source: Loading stream details…
ta: ச்ட்ரீம் விவரங்களை ஏற்றுகிறது…

# drawer_open
source: Open Drawer
ta: திறந்த அலமாரியை

# drawer_close
source: Close Drawer
ta: மூடு டிராயர்

# preferred_open_action_settings_title
source: Preferred 'open' action
ta: நயமான 'திற' செயல்

# preferred_open_action_settings_summary
source: Default action when opening content — %s
ta: உள்ளடக்கத்தைத் திறக்கும்போது இயல்புநிலை செயல் - %s

source: Video player
ta: வீடியோ பிளேயர்

source: Background player
ta: பின்னணி பிளேயர்

source: Popup player
ta: பாப்அப் பிளேயர்

# always_ask_open_action
source: Always ask
ta: எப்போதும் கேளுங்கள்

# preferred_player_fetcher_notification_title
source: Getting info…
ta: தகவலைப் பெறுகிறது…

# preferred_player_fetcher_notification_message
source: Loading requested content
ta: கோரிய உள்ளடக்கத்தை ஏற்றுகிறது

# create_playlist
source: New Playlist
ta: புதிய ஒளிச்சரம்

# duplicate_in_playlist
source: The playlists that are grayed out already contain this item.
ta: சாம்பல் நிறமாக இருக்கும் பிளேலிச்ட்களில் ஏற்கனவே இந்த உருப்படி உள்ளது.

# rename_playlist
source: Rename
ta: மறுபெயரிடு

source: Name
ta: பெயர்

source: Add to playlist
ta: ஒளிச்சரத்தில் சேர்

source: Processing… May take a moment
ta: செயலாக்கம்… ஒரு கணம் ஆகலாம்

source: Mute
ta: முடக்கு

source: Unmute
ta: ஊன்

source: Set as playlist thumbnail
ta: ஒளிச்சர சிறுபடமாக அமை

# unset_playlist_thumbnail
source: Unset permanent thumbnail
ta: நிரந்தர சிறுபடம்

source: Bookmark Playlist
ta: ஒளிச்சரத்தை நூற்குறி

# unbookmark_playlist
source: Remove Bookmark
ta: நூற்குறியை நீக்கு

# delete_playlist_prompt
source: Delete this playlist?
ta: இந்த ஒளிச்சரத்தை அழிக்கவா?

# playlist_creation_success
source: Playlist created
ta: ஒளிச்சரம் படைக்கப்பட்டது

# playlist_add_stream_success
source: Playlisted
ta: ஒளிச்சரமிடப்பட்டது

# playlist_add_stream_success_duplicate
source: Duplicate added %d time(s)
ta: நகல் சேர்க்கப்பட்ட %d நேரம் (கள்)

# playlist_thumbnail_change_success
source: Playlist thumbnail changed.
ta: ஒளிச்சர சிறுபடம் மாறியது.

# playlist_no_uploader
source: Auto-generated (no uploader found)
ta: தானாக-உண்டான (பதிவேற்றி எதுவுமில்லை)

# caption_none
source: No Captions
ta: தலைப்புகள் இல்லை

# resize_fit
source: Fit
ta: பொருத்தம்

# resize_fill
source: Fill
ta: நிரப்பவும்

# resize_zoom
source: Zoom
ta: பெரிதாக்கு

# caption_auto_generated
source: Auto-generated
ta: தானாக உருவாக்கிய

# caption_setting_title
source: Captions
ta: தலைப்புகள்

# caption_setting_description
source: Modify player caption text scale and background styles. Requires app restart to take effect
ta: பிளேயர் தலைப்பு உரை அளவு மற்றும் பின்னணி பாணிகளை மாற்றவும். நடைமுறைக்கு வர பயன்பாட்டு மறுதொடக்கம் தேவை

# leak_canary_not_available
source: LeakCanary is not available
ta: கசிவு கிடைக்கவில்லை

# enable_leak_canary_summary
source: Memory leak monitoring may cause the app to become unresponsive when heap dumping
ta: நினைவக கசிவு கண்காணிப்பு குவியல் கொட்டும்போது பயன்பாடு பதிலளிக்காமல் இருக்கக்கூடும்

source: Show memory leaks
ta: நினைவக கசிவுகளைக் காட்டு

# enable_disposed_exceptions_title
source: Report out-of-lifecycle errors
ta: வாழ்நாள் முழுவதும் பிழைகள் புகாரளிக்கவும்

# enable_disposed_exceptions_summary
source: Force reporting of undeliverable Rx exceptions outside of fragment or activity lifecycle after disposal
ta: அகற்றப்பட்ட பிறகு துண்டு அல்லது செயல்பாட்டு வாழ்க்கைச் சுழற்சிக்கு வெளியே வழங்க முடியாத ஆர்எக்ச் விதிவிலக்குகளை கட்டாயப்படுத்துதல்

# show_original_time_ago_title
source: Show original time ago on items
ta: அசல் நேரத்திற்கு முன்பு உருப்படிகளில் காட்டு

# show_original_time_ago_summary
source: Original texts from services will be visible in stream items
ta: சேவைகளிலிருந்து அசல் நூல்கள் ச்ட்ரீம் உருப்படிகளில் காணப்படும்

# disable_media_tunneling_title
source: Disable media tunneling
ta: மீடியா சுரங்கப்பாதையை முடக்கு

# disable_media_tunneling_summary
source: Disable media tunneling if you experience a black screen or stuttering on video playback.
ta: நீங்கள் ஒரு கருப்பு திரை அனுபவித்தால் அல்லது வீடியோ பிளேபேக்கில் திணறினால் மீடியா சுரங்கப்பாதையை முடக்கு.

# disable_media_tunneling_automatic_info
source: Media tunneling was disabled by default on your device because your device model is known to not support it.
ta: உங்கள் சாதனத்தில் முன்னிருப்பாக மீடியா சுரங்கப்பாதை முடக்கப்பட்டது, ஏனெனில் உங்கள் சாதன மாதிரி அதை ஆதரிக்காது என்று அறியப்படுகிறது.

# show_image_indicators_title
source: Show image indicators
ta: பட குறிகாட்டிகளைக் காட்டு

# show_image_indicators_summary
source: Show Picasso colored ribbons on top of images indicating their source: red for network, blue for disk and green for memory
ta: அவற்றின் மூலத்தைக் குறிக்கும் படங்களின் மேல் பிக்காசோ வண்ண ரிப்பன்களைக் காட்டு: நெட்வொர்க்கிற்கு சிவப்பு, வட்டுக்கு நீலம் மற்றும் நினைவகத்திற்கு பச்சை

# show_crash_the_player_title
source: Show "Crash the player"
ta: "வீரரை செயலிழக்க" காட்டு

# show_crash_the_player_summary
source: Shows a crash option when using the player
ta: பிளேயரைப் பயன்படுத்தும் போது செயலிழப்பு விருப்பத்தைக் காட்டுகிறது

# check_new_streams
source: Run check for new streams
ta: புதிய நீரோடைகளுக்கு காசோலை இயக்கவும்

source: Crash the app
ta: பயன்பாட்டை செயலிழக்கச் செய்யுங்கள்

# show_error_snackbar
source: Show an error snackbar
ta: பிழை சிற்றுண்டியைக் காட்டு

# create_error_notification
source: Create an error notification
ta: பிழை அறிவிப்பைப் படை

# import_title
source: Import
ta: இறக்குமதி

source: Import from
ta: இருந்து இறக்குமதி

source: Export to
ta: ஏற்றுமதி

# import_ongoing
source: Importing…
ta: இறக்குமதி…

# export_ongoing
source: Exporting…
ta: ஏற்றுமதி செய்கிறது…

# import_file_title
source: Import file
ta: கோப்பு இறக்குமதி

source: Previous export
ta: முந்தைய ஏற்றுமதி

# subscriptions_import_unsuccessful
source: Could not import subscriptions
ta: சந்தாக்களை இறக்குமதி செய்ய முடியவில்லை

# subscriptions_export_unsuccessful
source: Could not export subscriptions
ta: சந்தாக்களை ஏற்றுமதி செய்ய முடியவில்லை

# import_youtube_instructions
source: Import YouTube subscriptions from Google takeout: 1. Go to this URL: %1$s 2. Log in when asked 3. Click on "All data included", then on "Deselect all", then select only "subscriptions" and click "OK" 4. Click on "Next step" and then on "Create export" 5. Click on the "Download" button after it appears 6. Click on IMPORT FILE below and select the downloaded .zip file 7. [If the .zip import fails] Extract the .csv file (usually under "YouTube and YouTube Music/subscriptions/subscriptions.csv"), click on IMPORT FILE below and select the extracted csv file
ta: கூகிள் டேக்அவுட்டிலிருந்து YouTube சந்தாக்களை இறக்குமதி செய்க: 1. இந்த முகவரி க்குச் செல்லுங்கள்: %1$s 2. கேட்டபோது உள்நுழைக 3. "அனைத்து தரவுகளும் சேர்க்கப்பட்டுள்ளன" என்பதைக் சொடுக்கு செய்க, பின்னர் "அனைத்தையும் தேர்வு செய்யுங்கள்", பின்னர் "சந்தாக்கள்" மட்டுமே தேர்ந்தெடுத்து "சரி" என்பதைக் சொடுக்கு செய்க 4. "அடுத்த படி" என்பதைக் சொடுக்கு செய்து, பின்னர் "ஏற்றுமதி உருவாக்கு" 5. "பதிவிறக்கு" பொத்தானைக் சொடுக்கு செய்த பிறகு சொடுக்கு செய்க 6. கீழே உள்ள இறக்குமதி கோப்பைக் சொடுக்கு செய்து பதிவிறக்கம் செய்யப்பட்ட .zip கோப்பைத் தேர்ந்தெடுக்கவும் 7.

# import_soundcloud_instructions
source: Import a SoundCloud profile by typing either the URL or your ID: 1. Enable "desktop mode" in a web-browser (the site is not available for mobile devices) 2. Go to this URL: %1$s 3. Log in when asked 4. Copy the profile URL you were redirected to.
ta: முகவரி அல்லது உங்கள் ஐடியை தட்டச்சு செய்வதன் மூலம் சவுண்ட்க்ளூட் சுயவிவரத்தை இறக்குமதி செய்க: 1. வலை உலாவியில் "டெச்க்டாப் பயன்முறையை" இயக்கவும் (மொபைல் சாதனங்களுக்கு தளம் கிடைக்கவில்லை) 2. இந்த முகவரி க்குச் செல்லுங்கள்: %1$s 3. கேட்டபோது உள்நுழைக 4. நீங்கள் திருப்பி விடப்பட்ட சுயவிவர முகவரி ஐ நகலெடுக்கவும்.

# import_network_expensive_warning
source: Keep in mind this operation can be network expensive. Do you want to continue?
ta: இந்த செயல்பாடு பிணையம் விலை உயர்ந்ததாக இருக்கும் என்பதை நினைவில் கொள்ளுங்கள். நீங்கள் தொடர விரும்புகிறீர்களா?

# playback_speed_control
source: Playback Speed Controls
ta: பின்னணி வேக கட்டுப்பாடுகள்

# playback_tempo
source: Tempo
ta: டெம்போ

# playback_pitch
source: Pitch
ta: குனிவு

# unhook_checkbox
source: Unhook (may cause distortion)
ta: அவலூக் (விலகலை ஏற்படுத்தக்கூடும்)

# skip_silence_checkbox
source: Fast-forward during silence
ta: ம .னத்தின் போது வேகமாக முன்னோக்கி

# playback_step
source: Step
ta: படி

# playback_reset
source: Reset
ta: மீட்டமை

source: Percent
ta: விழுக்காடு

source: Semitone
ta: செமிடோன்

# start_accept_privacy_policy
source: In order to comply with the European General Data Protection Regulation (GDPR), we hereby draw your attention to NewPipe's privacy policy. Please read it carefully. You must accept it to send us the bug report.
ta: ஐரோப்பிய பொது தரவு பாதுகாப்பு ஒழுங்குமுறை (சிடிபிஆர்) உடன் இணங்குவதற்காக, நியூபைப்பின் தனியுரிமைக் கொள்கைக்கு இதன்மூலம் உங்கள் கவனத்தை ஈர்க்கிறோம். தயவுசெய்து அதை கவனமாகப் படியுங்கள். பிழை அறிக்கையை எங்களுக்கு அனுப்ப நீங்கள் அதை ஏற்றுக்கொள்ள வேண்டும்.

source: Accept
ta: ஏற்றுக்கொள்

source: Decline
ta: வீழ்ச்சி

# limit_data_usage_none_description
source: No limit
ta: வரம்பற்ற

# limit_mobile_data_usage_title
source: Limit resolution when using mobile data
ta: மொபைல் தரவைப் பயன்படுத்தும் போது வீடியோ தரத்தைக் கட்டுப்படுத்துங்கள்

# enable_streams_notifications_title
source: New streams notifications
ta: புதிய ச்ட்ரீம்கள் அறிவிப்புகள்

# enable_streams_notifications_summary
source: Notify about new streams from subscriptions
ta: சந்தாக்களிலிருந்து புதிய ச்ட்ரீம்கள் பற்றி அறிவிக்கவும்

# streams_notifications_interval_title
source: Checking frequency
ta: அதிர்வெண் சரிபார்க்கிறது

# streams_notifications_network_title
source: Required network connection
ta: தேவையான பிணைய இணைப்பு

source: Any network
ta: எந்த பிணையமும்

# updates_setting_title
source: Updates
ta: புதுப்பிப்புகள்
