Repository: 247i/TACETr
Catalog: உரை/தானி/newpipe-strings-*.po
Languages: ta

# updates_setting_description
source: Show a notification to prompt app update when a new version is available
ta: புதிய பதிப்பு கிடைத்தால் செயலி புதுப்பிப்பு பற்றி நினைப்பூட்ட ஓர் அறிவிப்பைக் காட்டு

source: Check for updates
ta: புதுப்பிப்புகளை சரிபார்க்கவும்

# auto_update_check_description
source: NewPipe can automatically check for new versions from time to time and notify you once they are available. Do you want to enable this?
ta: நியூபைப் தானாகவே புதிய பதிப்புகள் அவ்வப்போது சரிபார்க்கலாம் மற்றும் அவை கிடைத்தவுடன் உங்களுக்குத் தெரிவிக்கலாம். இதை இயக்க விரும்புகிறீர்களா?

# manual_update_title
source: @string/check_for_updates
ta: @சரம்/check_for_updates

# manual_update_description
source: Manually check for new versions
ta: புதிய பதிப்புகளை கைமுறையாக சரிபார்க்கவும்

# minimize_on_exit_title
source: Minimize on app switch
ta: பயன்பாட்டு சுவிட்சில் குறைக்கவும்

# minimize_on_exit_summary
source: Action when switching to other app from main video player — %s
ta: முதன்மையான வீடியோ பிளேயரிடமிருந்து பிற பயன்பாட்டிற்கு மாறும்போது செயல் - %s

# minimize_on_exit_none_description
source: None
ta: எதுவுமில்லை

# minimize_on_exit_background_description
source: Minimize to background player
ta: பின்னணி பிளேயருக்குக் குறைக்கவும்

# minimize_on_exit_popup_description
source: Minimize to popup player
ta: பாப்அப் பிளேயருக்குக் குறைக்கவும்

# autoplay_summary
source: Start playback automatically — %s
ta: பிளேபேக்கை தானாகத் தொடங்குங்கள் - %s

# wifi_only
source: Only on Wi-Fi
ta: அருகலையில் மட்டும்

source: Never
ta: ஒருபோதுமில்லை

source: List view mode
ta: பட்டியல் பார்வை முறை

source: List
ta: பட்டியல்

source: Grid
ta: வலைவாய்

source: Card
ta: அட்டை

source: Auto
ta: தானாக

# seekbar_preview_thumbnail_title
source: Seekbar thumbnail preview
ta: சீக்பர் சிறுபடம் முன்னோட்டம்

source: High quality (larger)
ta: உயர் தகுதி (பெரியது)

source: Low quality (smaller)
ta: குறைந்த தரம்

source: Don't show
ta: காட்ட வேண்டாம்

# app_update_unavailable_toast
source: You are running the latest version of NewPipe
ta: நீங்கள் நியூபைப்பின் அண்மைக் கால பதிப்பை இயக்குகிறீர்கள்

# app_update_available_notification_title
source: NewPipe update is available!
ta: NewPipe புதுப்பிப்பு கிடைக்கிறது!

# app_update_available_notification_text
source: Tap to download %s
ta: %s பதிவிறக்க தட்டவும்

# missions_header_finished
source: Finished
ta: முடிந்தது

# missions_header_pending
source: Pending
ta: நிலுவையில் உள்ளது

source: paused
ta: இடைநிறுத்தப்பட்டது

source: queued
ta: வரிசையில்

source: post-processing
ta: பிந்தைய செயலாக்கம்

source: recovering
ta: மீண்டு

source: Enqueue
ta: சாரைபடுத்து

# permission_denied
source: Action denied by the system
ta: கணினி மறுத்த நடவடிக்கை

# checking_updates_toast
source: Checking for updates…
ta: புதுப்பிப்புகளைச் சரிபார்க்கிறது…

source: Download failed
ta: பதிவிறக்கம் தோல்வியடைந்தது

# download_finished_notification
source: Download finished
ta: பதிவிறக்கம் முடிந்தது

# reset_settings_title
source: Reset settings
ta: அமைப்புகளை மீட்டமைக்கவும்

# reset_settings_summary
source: Reset all settings to their default values
ta: எல்லா அமைப்புகளையும் அவற்றின் இயல்புநிலை மதிப்புகளுக்கு மீட்டமைக்கவும்

# reset_all_settings
source: Resetting all settings will discard all of your preferred settings and restarts the app. Are you sure you want to proceed?
ta: எல்லா அமைப்புகளையும் மீட்டமைப்பது உங்களுக்கு விருப்பமான அமைப்புகள் அனைத்தையும் நிராகரித்து பயன்பாட்டை மறுதொடக்கம் செய்யும். நீங்கள் தொடர விரும்புகிறீர்களா?

source: Generate unique name
ta: தனித்துவமான பெயரை உருவாக்குங்கள்

source: Overwrite
ta: மேலெழுதும்

# overwrite_unrelated_warning
source: A file with this name already exists
ta: இந்த பெயருடன் ஒரு கோப்பு ஏற்கனவே உள்ளது

# overwrite_finished_warning
source: A downloaded file with this name already exists
ta: இப்பெயருடன் ஏற்கனவே ஒரு பதிவிறக்கிய கோப்பு உள்ளது

# overwrite_failed
source: cannot overwrite the file
ta: கோப்பை மேலெழுத முடியாது

# download_already_running
source: There is a download in progress with this name
ta: இப்பெயருடன் ஒரு பதிவிறக்கம் நடைபெறுகிறது

# download_already_pending
source: There is a pending download with this name
ta: இப்பெயருடன் ஒரு பதிவிறக்கம் நிலுவையிலுள்ளது

source: Show error
ta: பிழையைக் காட்டு

# error_file_creation
source: The file cannot be created
ta: கோப்பை உருவாக்க முடியாது

# error_path_creation
source: The destination folder cannot be created
ta: இலக்கு கோப்புறையை உருவாக்க முடியாது

# error_ssl_exception
source: Could not establish a secure connection
ta: பாதுகாப்பான இணைப்பை நிறுவ முடியவில்லை

# error_unknown_host
source: Could not find the server
ta: சேவையகத்தைக் கண்டுபிடிக்க முடியவில்லை

# error_connect_host
source: Cannot connect to the server
ta: சேவையகத்துடன் இணைக்க முடியாது

# error_http_no_content
source: The server does not send data
ta: சேவையகம் தரவை அனுப்பாது

# error_http_unsupported_range
source: The server does not accept multi-threaded downloads, retry with @string/msg_threads = 1
ta: சேவையகம் பல திரிக்கப்பட்ட பதிவிறக்கங்களை ஏற்காது, @சரம்/msg_threads = 1 உடன் மீண்டும் முயற்சிக்கவும்

# error_http_not_found
source: Not found
ta: கண்டுபிடிக்கப்படவில்லை

# error_postprocessing_failed
source: Post-processing failed
ta: பிந்தைய செயலாக்கம் தோல்வியடைந்தது

# error_postprocessing_stopped
source: NewPipe was closed while working on the file
ta: கோப்பில் பணிபுரியும் போது நியூபைப் மூடப்பட்டது

# error_insufficient_storage
source: Not enough free space on device
ta: சாதனத்தில் போதுமான இலவச இடம் இல்லை

# error_insufficient_storage_left
source: No space left on device
ta: சாதனத்தில் எந்த இடமும் இல்லை

# error_progress_lost
source: Progress lost, because the file was deleted
ta: முன்னேற்றம் இழந்தது, ஏனெனில் கோப்பு நீக்கப்பட்டது

# error_timeout
source: Connection timeout
ta: இணைப்பு நேரம் முடிந்தது

# error_download_resource_gone
source: Cannot recover this download
ta: இப்பதிவிறக்கத்தை மீட்டெடுக்க முடியவில்லை

source: Clear download history
ta: பதிவிறக்க வரலாற்றை அழி

# confirm_prompt
source: Do you want to clear your download history or delete all downloaded files?
ta: உங்கள் பதிவிறக்க வரலாற்றை அழிக்க வேண்டுமா அ எல்லா பதிவிறக்கிய கோப்புகளையும் நீக்க வேண்டுமா?

source: Delete downloaded files
ta: பதிவிறக்கிய கோப்புகளை நீக்கு

# delete_downloaded_files_confirm
source: Erase all downloaded files from disk?
ta: வட்டில் இருக்கும் பதிவிறக்கம் செய்யப்பட்ட அனைத்து கோப்புகளையும் அழிக்கவா?

# deleted_downloads_toast
source: Deleted %1$s download
ta: %1$s பதிவிறக்கம் அழிக்கபட்டது

source: Stop
ta: நிறுத்து

# max_retry_msg
source: Maximum retries
ta: அதிகபட்ச முயற்சிகள்

# max_retry_desc
source: Maximum number of attempts before canceling the download
ta: பதிவிறக்கத்தை ரத்துசெய்வதற்கு முன் செய்யவேண்டிய அதிகபட்ச முயற்சிகள்

# pause_downloads_on_mobile
source: Interrupt on metered networks
ta: மீட்டர் நெட்வொர்க்குகளில் குறுக்கீடு

# pause_downloads_on_mobile_desc
source: Useful when switching to mobile data, although some downloads cannot be suspended
ta: மொபைல் தரவுக்கு மாறும்போது பயனுள்ளதாக இருக்கும், இருப்பினும் சில பதிவிறக்கங்களை இடைநிறுத்த முடியாது

source: Close
ta: மூடு

# enable_queue_limit
source: Limit download queue
ta: பதிவிறக்க வரிசையை கட்டுப்படுத்துங்கள்

# enable_queue_limit_desc
source: One download will run at the same time
ta: ஒரு பதிவிறக்கம் ஒரே நேரத்தில் இயங்கும்

source: Start downloads
ta: பதிவிறக்கங்களைத் தொடங்குங்கள்

source: Pause downloads
ta: பதிவிறக்கங்களை இடைநிறுத்தவும்

# downloads_storage_ask_title
source: Ask where to download
ta: எங்கு பதிவிறக்கம் செய்வது என்று கேளுங்கள்

# downloads_storage_ask_summary
source: You will be asked where to save each download. Enable the system folder picker (SAF) if you want to download to an external SD card
ta: ஒவ்வொரு பதிவிறக்கத்தையும் எங்கு சேமிப்பது என்று கேட்கப்படும். வெளிப்புற எச்டி கார்டில் பதிவிறக்கம் செய்ய விரும்பினால் கணினி கோப்புறை பிக்கர் (SAF) ஐ இயக்கவும்

# downloads_storage_ask_summary_no_saf_notice
source: You will be asked where to save each download
ta: ஒவ்வொரு பதிவிறக்கத்தையும் எங்கு சேமிப்பது என்று கேட்கப்படும்

# downloads_storage_use_saf_title
source: Use system folder picker (SAF)
ta: கணினி கோப்புறை பிக்கர் (SAF) ஐப் பயன்படுத்தவும்

# downloads_storage_use_saf_summary
source: The 'Storage Access Framework' allows downloads to an external SD card
ta: 'சேமிப்பக அணுகல் கட்டமைப்பு' வெளிப்புற எச்டி கார்டுக்கு பதிவிறக்கங்களை அனுமதிக்கிறது

# downloads_storage_use_saf_summary_api_29
source: Starting from Android 10 only 'Storage Access Framework' is supported
ta: ஆண்ட்ராய்டு 10 இலிருந்து தொடங்கி 'சேமிப்பக அணுகல் கட்டமைப்பு' மட்டுமே ஆதரிக்கப்படுகிறது

# choose_instance_prompt
source: Choose an instance
ta: ஒரு நிகழ்வைத் தேர்வுசெய்க

# app_language_title
source: App language
ta: செயலியின் மொழி

# systems_language
source: System default
ta: இயங்குதள இயல்பிருப்பு

source: Remove watched
ta: பார்த்ததை அகற்று

# remove_watched_popup_title
source: Remove watched videos?
ta: பார்த்த வீடியோக்களை அகற்றவா?

source: Remove duplicates
ta: நகல்களை அகற்று

# remove_duplicates_title
source: Remove duplicates?
ta: நகல்களை அகற்றவா?

# remove_duplicates_message
source: Do you want to remove all duplicate streams in this playlist?
ta: இந்த பிளேலிச்ட்டில் உள்ள அனைத்து நகல் நீரோடைகளையும் அகற்ற விரும்புகிறீர்களா?

# remove_watched_popup_warning
source: Videos that have been watched before and after being added to the playlist will be removed. Are you sure? This cannot be undone!
ta: பிளேலிச்ட்டில் சேர்க்கப்படுவதற்கு முன்னும் பின்னும் பார்க்கப்பட்ட வீடியோக்கள் அகற்றப்படும். நீங்கள் உறுதியாக இருக்கிறீர்களா? இதை செயல்தவிர்க்க முடியாது!

# remove_watched_popup_yes_and_partially_watched_videos
source: Yes, and partially watched videos
ta: ஆம், மற்றும் ஓரளவு பார்த்த வீடியோக்கள்

# new_seek_duration_toast
source: Due to ExoPlayer constraints the seek duration was set to %d seconds
ta: எக்சோப்ளேயர் கட்டுப்பாடுகள் காரணமாக தேடல் காலம் %d விநாடிகளுக்கு அமைக்கப்பட்டது

# seconds
source: %d second
ta: %d இரண்டாவது

# minutes
source: %d minute
ta: %d மணித்துளி

# hours
source: %d hour
ta: %d மணி

# days
source: %d day
ta: %d நாள்

# fragment_feed_title
source: What's New
ta: புதிதாக

# feed_groups_header_title
source: Channel groups
ta: சேனல் குழுக்கள்

# feed_oldest_subscription_update
source: Feed last updated: %s
ta: கடைசியாக புதுப்பிக்கப்பட்டது: %s

# feed_subscription_not_loaded_count
source: Not loaded: %d
ta: ஏற்றப்படவில்லை: %d

# feed_notification_loading
source: Loading feed…
ta: ஏற்றுதல் தீவனம்…

# feed_processing_message
source: Processing feed…
ta: செயலாக்க ஊட்டம்…

# feed_new_items
source: New feed items
ta: புதிய தீவன உருப்படிகள்

# feed_group_dialog_select_subscriptions
source: Select subscriptions
ta: சந்தாக்களைத் தேர்ந்தெடு

# feed_group_dialog_empty_selection
source: No subscription selected
ta: சந்தா எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# feed_group_dialog_selection_count
source: %d selected
ta: %d தேர்ந்தெடுக்கப்பட்டது

# feed_group_dialog_empty_name
source: Empty group name
ta: வெற்று குழு பெயர்

# feed_group_dialog_delete_message
source: Do you want to delete this group?
ta: இந்தக் குழுவை நீக்க வேண்டுமா?

# feed_create_new_group_button_title
source: New
ta: புதிய

# feed_group_show_only_ungrouped_subscriptions
source: Show only ungrouped subscriptions
ta: ஒன்றிணைக்கா சந்தாக்களை மட்டும் காட்டு

# settings_category_feed_title
source: Feed
ta: தீவனம்

# feed_update_threshold_title
source: Feed update threshold
ta: உணவுப் புதுப்பிப்பு வாசல்

# feed_update_threshold_summary
source: Time after last update before a subscription is considered outdated — %s
ta: சந்தா காலாவதியானதாகக் கருதப்படுவதற்கு முன் கடைசி புதுப்பிப்புக்குப் பிறகு நேரம் - %s

# feed_update_threshold_option_always_update
source: Always update
ta: எப்போதும் புதுப்பிக்கவும்

# feed_load_error
source: Error loading feed
ta: ஊட்டத்தை ஏற்றுதல்

# feed_load_error_account_info
source: Could not load feed for '%s'.
ta: '%s' க்கு ஊட்டத்தை ஏற்ற முடியவில்லை.

# feed_load_error_terminated
source: The author's account has been terminated. NewPipe will not be able to load this feed in the future. Do you want to unsubscribe from this channel?
ta: ஆசிரியரின் கணக்கு நிறுத்தப்பட்டுள்ளது. நியூபைப் எதிர்காலத்தில் இந்த ஊட்டத்தை ஏற்ற முடியாது. இந்த சேனலில் இருந்து குழுவிலக விரும்புகிறீர்களா?

# feed_load_error_fast_unknown
source: The fast feed mode does not provide more info on this.
ta: ஃபாச்ட் ஃபீட் பயன்முறை இது குறித்த கூடுதல் தகவலை வழங்காது.

# feed_use_dedicated_fetch_method_title
source: Fetch from dedicated feed when available
ta: கிடைக்கும்போது பிரத்யேக ஊட்டத்திலிருந்து பெறுங்கள்

# feed_use_dedicated_fetch_method_summary
source: Available in some services, it is usually much faster but may return a limited amount of items and often incomplete information (e.g. no duration, item type, no live status)
ta: சில சேவைகளில் கிடைக்கிறது, இது பொதுவாக மிக வேகமாக இருக்கும், ஆனால் ஒரு குறிப்பிட்ட அளவு உருப்படிகள் மற்றும் பெரும்பாலும் முழுமையற்ற தகவல்களைத் தரக்கூடும் (எ.கா. காலம், உருப்படி வகை, நேரடி நிலை இல்லை)

# feed_use_dedicated_fetch_method_enable_button
source: Enable fast mode
ta: வேகமான பயன்முறையை இயக்கவும்

# feed_use_dedicated_fetch_method_disable_button
source: Disable fast mode
ta: வேகமான பயன்முறையை முடக்கு

# feed_use_dedicated_fetch_method_help_text
source: Do you think feed loading is too slow? If so, try enabling fast loading (you can change it in settings or by pressing the button below). NewPipe offers two feed loading strategies: • Fetching the whole subscription channel, which is slow but complete. • Using a dedicated service endpoint, which is fast but usually not complete. The difference between the two is that the fast one usually lacks some information, like the item's duration or type (can't distinguish between live videos and normal ones) and it may return less items. YouTube is an example of a service that offers this fast method with its RSS feed. So the choice boils down to what you prefer: speed or precise information.
ta: தீவன ஏற்றுதல் மிகவும் மெதுவாக இருப்பதாக நீங்கள் நினைக்கிறீர்களா? அப்படியானால், வேகமாக ஏற்றுவதை இயக்க முயற்சிக்கவும் (நீங்கள் அதை அமைப்புகளில் மாற்றலாம் அல்லது கீழே உள்ள பொத்தானை அழுத்துவதன் மூலம்). நியூபைப் இரண்டு தீவன ஏற்றுதல் உத்திகளை வழங்குகிறது: சந்தா சேனலைப் பெறுதல், இது மெதுவாக ஆனால் முழுமையானது. பணி ஒரு பிரத்யேக பணி இறுதிப் புள்ளியைப் பயன்படுத்துதல், இது வேகமானது ஆனால் பொதுவாக முழுமையடையாது. இரண்டிற்கும் இடையிலான வேறுபாடு என்னவென்றால், வேகமானவருக்கு வழக்கமாக உருப்படியின் காலம் அல்லது வகை போன்ற சில தகவல்கள் இல்லை (நேரடி வீடியோக்களுக்கும் சாதாரணமானவற்றுக்கும் இடையில் வேறுபடுத்த முடியாது) மற்றும் அது குறைவான உருப்படிகளைத் தரக்கூடும். இந்த வேகமான முறையை அதன் ஆர்எச்எச் ஊட்டத்துடன் வழங்கும் சேவைக்கு யூடியூப் ஒரு எடுத்துக்காட்டு. எனவே தேர்வு நீங்கள் விரும்புவதைக் குறைக்கிறது: விரைவு அல்லது துல்லியமான செய்தி.

# feed_hide_streams_title
source: Show the following streams
ta: பின்வரும் நீரோடைகளைக் காட்டு

# feed_show_hide_streams
source: Show/Hide streams
ta: ச்ட்ரீம்களைக் காட்டு/மறைக்க

# feed_fetch_channel_tabs
source: Fetch channel tabs
ta: சேனல் தாவல்களைப் பெறுங்கள்

# feed_fetch_channel_tabs_summary
source: Tabs to fetch when updating the feed. This option has no effect if a channel is updated using fast mode.
ta: ஊட்டத்தை புதுப்பிக்கும்போது பெற தாவல்கள். வேகமான பயன்முறையைப் பயன்படுத்தி ஒரு சேனல் புதுப்பிக்கப்பட்டால் இந்த விருப்பம் எந்த விளைவையும் ஏற்படுத்தாது.

# content_not_supported
source: This content is not yet supported by NewPipe. It will hopefully be supported in a future version.
ta: இந்த உள்ளடக்கத்தை இன்னும் நியூபைப் ஆதரிக்கவில்லை. இது எதிர்கால பதிப்பில் ஆதரிக்கப்படும்.

# detail_sub_channel_thumbnail_view_description
source: Channel's avatar thumbnail
ta: சேனலின் அவதார் சிறுபடம்

# channel_created_by
source: Created by %s
ta: %s ஆல் உருவாக்கப்பட்டது

# video_detail_by
source: By %s
ta: மூலம் %s

# playlist_page_summary
source: Playlist page
ta: ஒளிச்சரப் பக்கம்

# show_thumbnail_title
source: Show thumbnail
ta: சிறுபடங்காட்டு

# show_thumbnail_summary
source: Use thumbnail for both lock screen background and notifications
ta: பூட்டுத்திரைப் பின்புலத்திற்கும் அறிவிப்புகளுக்கும் சிறுபடத்தைப் பயன்படுத்து

source: Recent
ta: அண்மைக் கால

source: Chapters
ta: பாடங்கள்

# no_app_to_open_intent
source: No app on your device can open this
ta: உங்கள் சாதனத்தில் எந்த பயன்பாடும் இதைத் திறக்க முடியாது

# no_appropriate_file_manager_message
source: No appropriate file manager was found for this action. Please install a file manager or try to disable '%s' in the download settings
ta: இந்த செயலுக்கு பொருத்தமான கோப்பு மேலாளர் எதுவும் கிடைக்கவில்லை. தயவுசெய்து ஒரு கோப்பு மேலாளரை நிறுவவும் அல்லது பதிவிறக்க அமைப்புகளில் '%s' ஐ முடக்க முயற்சிக்கவும்

# no_appropriate_file_manager_message_android_10
source: No appropriate file manager was found for this action. Please install a Storage Access Framework compatible file manager
ta: இந்த செயலுக்கு பொருத்தமான கோப்பு மேலாளர் எதுவும் கிடைக்கவில்லை. சேமிப்பக அணுகல் கட்டமைப்பு இணக்கமான கோப்பு மேலாளரை நிறுவவும்

# georestricted_content
source: This content is not available in your country.
ta: இந்த உள்ளடக்கம் உங்கள் நாட்டில் கிடைக்கவில்லை.

# soundcloud_go_plus_content
source: This is a SoundCloud Go+ track, at least in your country, so it cannot be streamed or downloaded by NewPipe.
ta: இது ஒரு சவுண்ட்க்ளூட் கோ+ டிராக் ஆகும், குறைந்தபட்சம் உங்கள் நாட்டில், எனவே இதை நியூபைப் மூலம் ச்ட்ரீம் செய்யவோ பதிவிறக்கம் செய்யவோ முடியாது.

# private_content
source: This content is private, so it cannot be streamed or downloaded by NewPipe.
ta: இந்த உள்ளடக்கம் தனிப்பட்டது, எனவே இதை நியூபைப் மூலம் ச்ட்ரீம் செய்யவோ பதிவிறக்கம் செய்யவோ முடியாது.

# youtube_music_premium_content
source: This video is available only to YouTube Music Premium members, so it cannot be streamed or downloaded by NewPipe.
ta: இந்த வீடியோ யூடியூப் மியூசிக் காப்பீடு உறுப்பினர்களுக்கு மட்டுமே கிடைக்கிறது, எனவே இதை நியூபைப்பால் ச்ட்ரீம் செய்யவோ பதிவிறக்கம் செய்யவோ முடியாது.

source: Account terminated
ta: கணக்கு நிறுத்தப்பட்டது

# service_provides_reason
source: %s provides this reason:
ta: %s இந்த காரணத்தை வழங்குகிறது:

# paid_content
source: This content is only available to users who have paid, so it cannot be streamed or downloaded by NewPipe.
ta: இந்த உள்ளடக்கம் பணம் செலுத்திய பயனர்களுக்கு மட்டுமே கிடைக்கிறது, எனவே இதை நியூபைப் மூலம் ச்ட்ரீம் செய்யவோ பதிவிறக்கம் செய்யவோ முடியாது.

source: Featured
ta: இடம்பெற்றது

source: Radio
ta: வானொலி

# auto_device_theme_title
source: Automatic (device theme)
ta: தானியங்கி (சாதன தோற்றம்)

# night_theme_summary
source: Select your favorite night theme — %s
ta: உம் அபிமான இருண்ட தோற்றத்தைத் தேர்ந்தெடு — %s

# select_night_theme_toast
source: You can select your favorite night theme below
ta: உம் அபிமான இருண்ட தோற்றத்தைக் கீழே தேர்ந்தெடுக்கலாம்

# night_theme_available
source: This option is only available if %s is selected for Theme
ta: கருப்பொருளுக்கு %s தேர்ந்தெடுக்கப்பட்டால் மட்டுமே இந்த விருப்பம் கிடைக்கும்

source: Download has started
ta: பதிவிறக்கம் தொடங்கியது

# description_select_note
source: You can now select text inside the description. Note that the page may flicker and links may not be clickable while in selection mode.
ta: நீங்கள் இப்போது விளக்கத்திற்குள் உரையைத் தேர்ந்தெடுக்கலாம். தேர்வு பயன்முறையில் இருக்கும்போது பக்கம் ஃப்ளிக்கர் மற்றும் இணைப்புகள் சொடுக்கு செய்யப்படாமல் இருக்கலாம் என்பதை நினைவில் கொள்க.

# description_select_enable
source: Enable selecting text in the description
ta: விளக்கத்தில் உரையைத் தேர்ந்தெடுப்பதை இயக்கவும்

# description_select_disable
source: Disable selecting text in the description
ta: விளக்கத்தில் உரையைத் தேர்ந்தெடுப்பதை முடக்கு

# metadata_category
source: Category
ta: வகை

# metadata_tags
source: Tags
ta: குறிச்சொற்கள்

# metadata_licence
source: Licence
ta: உரிமம்

# metadata_privacy
source: Privacy
ta: தனியுரிமை

# metadata_age_limit
source: Age limit
ta: அகவை வரம்பு

# metadata_language
source: Language
ta: மொழி

# metadata_support
source: Support
ta: உதவி

# metadata_host
source: Host
ta: விருந்தோம்பி

# metadata_thumbnails
source: Thumbnails
ta: சிறு உருவங்கள்

# metadata_uploader_avatars
source: Uploader avatars
ta: பதிவேற்றும் அவதாரங்கள்

# metadata_subchannel_avatars
source: Sub-channel avatars
ta: துணை சேனல் அவதாரங்கள்

# metadata_avatars
source: Avatars
ta: அவதாரங்கள்

# metadata_banners
source: Banners
ta: பதாகைகள்

# metadata_privacy_public
source: Public
ta: பொது

# metadata_privacy_unlisted
source: Unlisted
ta: பட்டியலிடப்படாதது

# metadata_privacy_private
source: Private
ta: தனிப்பட்ட

# metadata_privacy_internal
source: Internal
ta: உள்

# metadata_subscribers
source: Subscribers
ta: சந்தாதாரர்கள்

# detail_pinned_comment_view_description
source: Pinned comment
ta: பின்னப்பட்ட கருத்து

# detail_heart_img_view_description
source: Hearted by creator
ta: படைப்பாளரால் மனம்

# open_website_license
source: Open website
ta: திறந்த வலைத்தளம்

# tablet_mode_title
source: Tablet mode
ta: டேப்லெட் பயன்முறை

source: On
ta: ஆன்

source: Off
ta: அணை

# progressive_load_interval_exoplayer_default
source: ExoPlayer default
ta: எக்சோப்ளேயர் இயல்புநிலை

# notifications_disabled
source: Notifications are disabled
ta: அறிவிப்புகள் முடக்கப்பட்டுள்ளன

source: Get notified
ta: அறிவிக்க

# you_successfully_subscribed
source: You now subscribed to this channel
ta: நீங்கள் இப்போது இந்த சேனலுக்கு குழுசேர்ந்தீர்கள்

source: Toggle all
ta: அனைத்தையும் மாற்று

# streams_not_yet_supported_removed
source: Streams which are not yet supported by the downloader are not shown
ta: பதிவிறக்கத்தால் இன்னும் ஆதரிக்கப்படாத நீரோடைகள் காட்டப்படவில்லை

# audio_track_present_in_video
source: An audio track should be already present in this stream
ta: இந்த ச்ட்ரீமில் ஏற்கனவே ஆடியோ டிராக் இருக்க வேண்டும்

# selected_stream_external_player_not_supported
source: The selected stream is not supported by external players
ta: தேர்ந்தெடுக்கப்பட்ட ச்ட்ரீம் வெளிப்புற வீரர்களால் ஆதரிக்கப்படவில்லை

# no_audio_streams_available_for_external_players
source: No audio streams are available for external players
ta: வெளிப்புற வீரர்களுக்கு ஆடியோ ச்ட்ரீம்கள் எதுவும் கிடைக்கவில்லை

# no_video_streams_available_for_external_players
source: No video streams are available for external players
ta: வெளிப்புற வீரர்களுக்கு வீடியோ ச்ட்ரீம்கள் எதுவும் கிடைக்கவில்லை

# select_quality_external_players
source: Select quality for external players
ta: வெளிப்புற வீரர்களுக்கான தரத்தைத் தேர்ந்தெடுக்கவும்

# select_audio_track_external_players
source: Select audio track for external players
ta: வெளிப்புற பிளேயர்களுக்கான ஆடியோ டிராக்கைத் தேர்ந்தெடுக்கவும்

source: Unknown format
ta: தெரியாத வடிவம்

source: Unknown quality
ta: அறியப்படாத தகுதி

# unknown_audio_track
source: Unknown
ta: தெரியவில்லை

# feed_show_watched
source: Fully watched
ta: முழுமையாகப் பார்த்தேன்

# feed_show_partially_watched
source: Partially watched
ta: ஓரளவு பார்த்தேன்

# feed_show_upcoming
source: Upcoming
ta: வரவிருக்கும்

source: Sort
ta: வரிசைப்படுத்து

# settings_category_exoplayer_title
source: ExoPlayer settings
ta: எக்சோப்ளேயர் அமைப்புகள்

# settings_category_exoplayer_summary
source: Manage some ExoPlayer settings. These changes require a player restart to take effect
ta: சில எக்சோப்ளேயர் அமைப்புகளை நிர்வகிக்கவும். இந்த மாற்றங்கள் நடைமுறைக்கு வர ஒரு வீரர் மறுதொடக்கம் தேவை

# use_exoplayer_decoder_fallback_title
source: Use ExoPlayer's decoder fallback feature
ta: எக்சோப்ளேயரின் டிகோடர் குறைவடையும் அம்சத்தைப் பயன்படுத்தவும்

# use_exoplayer_decoder_fallback_summary
source: Enable this option if you have decoder initialization issues, which falls back to lower-priority decoders if primary decoders initialization fail. This may result in poor playback performance than when using primary decoders
ta: உங்களிடம் டிகோடர் துவக்க சிக்கல்கள் இருந்தால் இந்த விருப்பத்தை இயக்கவும், இது முதன்மை டிகோடர்கள் துவக்கம் தோல்வியுற்றால் குறைந்த முன்னுரிமை டிகோடர்களுக்குத் திரும்பும். முதன்மை டிகோடர்களைப் பயன்படுத்துவதை விட இது மோசமான பின்னணி செயல்திறனை ஏற்படுத்தக்கூடும்
