Repository: 247i/TACETr
Catalog: உரை/தானி/newpipe-strings-*.po
Languages: ta

# main_bg_subtitle
source: Tap the magnifying glass to get started.
ta: ஆரம்பிக்க பூதக்கண்ணாடியைத் தட்டு.

# upload_date_text
source: Published on %1$s
ta: %1$s அன்று வெளியிடப்பட்டது

# no_player_found
source: No stream player found. Install VLC?
ta: நிகழ்பட ஓட்டி இல்லை. VLCஐ நிறுவவா?

# no_player_found_toast
source: No stream player found (you can install VLC to play it).
ta: நிகழ்பட ஓட்டி இல்லை (இதை இயக்க VLC-ஐப் பயன்படுத்தலாம்).

source: Install
ta: நிறுவு

source: Cancel
ta: ரத்துசெய்

source: OK
ta: சரி

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Open in browser
ta: உலாவியில் திற

source: Mark as watched
ta: பார்த்ததாகக் குறி

source: Open in popup mode
ta: திரைமேல் நிலையில் காட்டு

source: Open with
ta: இதனுடன் திற

source: Share
ta: பகிர்

source: Download
ta: பதிவிறக்கம்

# controls_download_desc
source: Download stream file
ta: நிகழ்பட கோப்பைப் பதிவிறக்கு

source: Search
ta: தேடு

source: Settings
ta: அமைவு

# did_you_mean
source: Did you mean "%1$s"?
ta: "%1$s" என்றீர்களா?

# search_showing_result_for
source: Showing results for: %s
ta: %s :க்கான முடிவுகளைக் காட்டுகிறது

# share_dialog_title
source: Share with
ta: இதனுடன் பகிர்

# use_external_video_player_title
source: Use external video player
ta: வேறு நிகழ்பட ஓட்டியைப் பயன்படுத்து

# use_external_video_player_summary
source: Removes audio at some resolutions
ta: சில பிரிதிறன்களில் ஒலியை நீக்கும்

# use_external_audio_player_title
source: Use external audio player
ta: வேறு ஒலி இயக்கியைப் பயன்படுத்து

# subscribe_button_title
source: Subscribe
ta: சந்தாசேர்

# subscribed_button_title
source: Subscribed
ta: சந்தாசேர்ந்தாயிற்று

source: Unsubscribe
ta: சந்தாநீக்கு

source: Channel unsubscribed
ta: சேனல் சந்தாநீக்கப்பட்டது

# subscription_change_failed
source: Could not change subscription
ta: சந்தாவை மாற்ற முடியவில்லை

# subscription_update_failed
source: Could not update subscription
ta: சந்தாவைப் புதுப்பிக்க முடியவில்லை

source: Show info
ta: தகவல் காண்பி

# tab_subscriptions
source: Subscriptions
ta: சந்தாக்கள்

# tab_bookmarks
source: Bookmarked Playlists
ta: நூற்குறித்த ஒளிச்சரங்கள்

# tab_choose
source: Choose Tab
ta: பக்கத்தை தேர்வு செய்

# controls_background_title
source: Background
ta: பின்புலம்

# controls_popup_title
source: Popup
ta: திரைமேல்

# controls_add_to_playlist_title
source: Add To
ta: இதற்கு சேர்

# download_path_title
source: Video download folder
ta: காணொளி பதிவிறக்க அடைவு

# download_path_summary
source: Downloaded video files are stored here
ta: பதிவிறங்கிய காணொளி கோப்புகள் இங்கே தேங்கும்

# download_path_dialog_title
source: Choose download folder for video files
ta: காணொளியின் பதிவிறக்க அடைவை தேர்வு செய்

# download_path_audio_title
source: Audio download folder
ta: ஒலி பதிவிறக்க அடைவு

# download_path_audio_summary
source: Downloaded audio files are stored here
ta: பதிவிறங்கிய ஒலி கோப்புகள் இங்கே தேங்கும்

# download_path_audio_dialog_title
source: Choose download folder for audio files
ta: ஒலி கோப்புகளுக்கான பதிவிறக்கப் அடைவை தேர்வு செய்

# default_resolution_title
source: Default resolution
ta: இயல்பிருப்பு பிரிதிறன்

# default_popup_resolution_title
source: Default popup resolution
ta: இயல்பிருப்பு திரைமேல் நிலை பிரிதிறன்

# show_higher_resolutions_title
source: Show higher resolutions
ta: உயரிய பிரிதிறன்களைக் காட்டு

# show_higher_resolutions_summary
source: Only some devices can play 2K/4K videos
ta: சில சாதனங்கள் மட்டுமே 2k/4k காணொளிகளை இயக்கமுடியும்

# play_with_kodi_title
source: Play with Kodi
ta: Kodiயுடன் இயக்கு

# kore_not_found
source: Install missing Kore app?
ta: இல்லாத Kore செயலியை நிறுவவா?

# show_play_with_kodi_title
source: Show "Play with Kodi" option
ta: "Kodiயுடன் இயக்கு" இடப்பைக் காட்டு

# show_play_with_kodi_summary
source: Display an option to play a video via Kodi media center
ta: காணொளிகளை Kodi media centerஉடன் இயக்கும் இடப்பைக் காட்டு

source: Crash the player
ta: இயக்கியைச் சிதை

# notification_scale_to_square_image_title
source: Crop thumbnail to 1:1 aspect ratio
ta: அட்டைப் படத்தை 1:1 விகிதத்தில் செதுக்கவும்

# notification_scale_to_square_image_summary
source: Crop the video thumbnail shown in the notification from 16:9 to 1:1 aspect ratio
ta: அறிவிப்பில் தெரியும் காணொளி முகப்புபடத்தை 16: 9 முதல் 1: 1 அம்ச விகிதம் வரை அளவிட்டு பிரித்து எது

# notification_action_0_title
source: First action button
ta: முதல் செயல் பொத்தான்

# notification_action_1_title
source: Second action button
ta: இரண்டாம் செயல் பொத்தான்

# notification_action_2_title
source: Third action button
ta: மூன்றாம் செயல் பொத்தான்

# notification_action_3_title
source: Fourth action button
ta: நான்காம் செயல் பொத்தான்

# notification_action_4_title
source: Fifth action button
ta: ஐந்தாம் செயல் பொத்தான்

# notification_actions_summary
source: Edit each notification action below by tapping on it. Select up to three of them to be shown in the compact notification by using the checkboxes on the right.
ta: ஒவ்வொரு அறிவிப்பு செயலையும் தட்டுவதன் மூலம் அதைத் தட்டவும். வலதுபுறத்தில் உள்ள தேர்வுப்பெட்டிகளைப் பயன்படுத்தி சிறிய அறிவிப்பில் காட்டப்படுவதற்கு அவற்றில் மூன்று வரை தேர்ந்தெடுக்கவும்.

# notification_actions_summary_android13
source: Edit each notification action below by tapping on it. The first three actions (play/pause, previous and next) are set by the system and cannot be customized.
ta: ஒவ்வொரு அறிவிப்பு செயலையும் தட்டுவதன் மூலம் அதைத் தட்டவும். முதல் மூன்று செயல்கள் (நாடகம்/இடைநிறுத்தம், முந்தைய மற்றும் அடுத்தவை) கணினியால் அமைக்கப்பட்டன, மேலும் அவை தனிப்பயனாக்க முடியாது.

# notification_actions_at_most_three
source: You can select at most three actions to show in the compact notification!
ta: சுருக்க அறிவிப்பில் காட்ட அதிகபட்சம் மூன்று செயல்களை நீங்கள் தேர்ந்தெடுக்கலாம்!

# notification_action_repeat
source: Repeat
ta: மீண்டும்

# notification_action_shuffle
source: Shuffle
ta: கலக்கு

# notification_action_buffering
source: Buffering
ta: இடையகப்படுத்துகிறது

# notification_action_nothing
source: Nothing
ta: ஏதுமில்லை

# notification_colorize_title
source: Colorize notification
ta: அறிவிப்பை வண்ணமயமாக்கு

# notification_colorize_summary
source: Have Android customize the notification's color according to the main color in the thumbnail (note that this is not available on all devices)
ta: சிறுபடத்திலுள்ள முதன்மை நிறத்திற்கேற்ப அறிவிப்பின் நிறத்தை Androidஐ தனிப்பயனாக்கச் செய் (இது எல்லா சாதனங்களிலும் கிடைக்காதென்பதை குறித்துக்கொள்)

# play_audio
source: Audio
ta: ஒலி

# default_audio_format_title
source: Default audio format
ta: இயல்பிருப்பு ஒலி வடிவம்

# default_video_format_title
source: Default video format
ta: இயல்பிருப்பு காணொளி வடிவம்

# theme_title
source: Theme
ta: தோற்றம்

# night_theme_title
source: Night theme
ta: இரவுத் தோற்றம்

# light_theme_title
source: Light
ta: வெளிர்ந்த

# dark_theme_title
source: Dark
ta: இருண்ட

# black_theme_title
source: Black
ta: கருமை

# popup_remember_size_pos_title
source: Remember popup properties
ta: திரைமேல் பண்புகளை நினைவுகொள்

# popup_remember_size_pos_summary
source: Remember last size and position of popup
ta: திரைமேல் நிலையின் கடைசி அளவையும் இடத்தையும் நினைவுகொள்

# use_inexact_seek_title
source: Use fast inexact seek
ta: வேகமான பொருத்தமற்ற தேடலை பயன்படுத்து

# use_inexact_seek_summary
source: Inexact seek allows the player to seek to positions faster with reduced precision. Seeking for 5, 15 or 25 seconds doesn't work with this
ta: துல்லியமற்ற நாடல் குறைந்த துல்லியத்துடன் விரைவாக நாட இயக்கியை அனுமதிக்கிறது. 5, 15 அ 25 நொடிகள் நாடுவது இதனுடன் செயல்படாது

# seek_duration_title
source: Fast-forward/-rewind seek duration
ta: வேகமாக முன்னோக்கி / திரும்பத் தேடும் காலம்

# progressive_load_interval_title
source: Playback load interval size
ta: பின்னணி சுழற்சியின் கால அளவு

# progressive_load_interval_summary
source: Change the load interval size on progressive contents (currently %s). A lower value may speed up their initial loading
ta: முற்போக்கான உள்ளடக்கங்களில் (தற்போது %s) சுமை இடைவெளி அளவை மாற்றவும். குறைந்த மதிப்பு அவற்றின் ஆரம்ப ஏற்றுதலை விரைவுபடுத்தக்கூடும்

# clear_queue_confirmation_title
source: Ask for confirmation before clearing a queue
ta: வரிசையை அழிக்கும் முன் உறுதிப்படுத்தலைக் கேள்

# clear_queue_confirmation_summary
source: Switching from one player to another may replace your queue
ta: ஒரு இயக்கி விட்டு மறு இயக்கி மாறுதல் உங்கள் வரிசையை மாற்றக்கூடும்

# clear_queue_confirmation_description
source: The active player queue will be replaced
ta: செயலிலுள்ள இயக்கி வரிசை மாற்றப்படும்

# ignore_hardware_media_buttons_title
source: Ignore hardware media button events
ta: வன்பொருள் மீடியா பொத்தான் நிகழ்வுகளை புறக்கணிக்கவும்

# ignore_hardware_media_buttons_summary
source: Useful, for instance, if you are using a headset with broken physical buttons
ta: உதாரணமாக, நீங்கள் உடைந்த உடல் பொத்தான்களுடன் எட்செட் பயன்படுத்துகிறீர்கள் என்றால் பயனுள்ளதாக இருக்கும்

# show_comments_title
source: Show comments
ta: கருத்துக்களைக் காண்பி

# show_comments_summary
source: Turn off to hide comments
ta: கருத்துக்களை மறைக்க அணை

# show_next_and_similar_title
source: Show 'Next' and 'Similar' videos
ta: 'அடுத்து' மற்றும் 'ஒப்பான' காணொளிகளைக் காட்டு

# show_description_title
source: Show description
ta: விளக்கத்தைக் காட்டு

# show_description_summary
source: Turn off to hide video description and additional information
ta: காணொளி விளக்கம் மற்றும் கூடுதல் தகவல்களை மறைக்க அணை

# show_meta_info_title
source: Show meta info
ta: மேனிலை தகவல் காட்டு

# show_meta_info_summary
source: Turn off to hide meta info boxes with additional information about the stream creator, stream content or a search request
ta: பாய்வு உருவாக்குநர், பாய்வு உள்ளடக்கம் அ தேடல் கோரிக்கை குறித்த கூடுதல் தகவலையுடைய மேனிலைத் தகவட்பெட்டிகளை மறைக்க அணை

# prefer_original_audio_title
source: Prefer original audio
ta: அசல் ஆடியோவை விரும்புங்கள்

# prefer_original_audio_summary
source: Select the original audio track regardless of the language
ta: மொழியைப் பொருட்படுத்தாமல் அசல் ஆடியோ டிராக்கைத் தேர்ந்தெடுக்கவும்

# prefer_descriptive_audio_title
source: Prefer descriptive audio
ta: விளக்க ஆடியோவை விரும்புங்கள்

# prefer_descriptive_audio_summary
source: Select an audio track with descriptions for visually impaired people if available
ta: கிடைத்தால் பார்வையற்றவர்களுக்கு விளக்கங்களுடன் ஆடியோ டிராக்கைத் தேர்ந்தெடுக்கவும்

# thumbnail_cache_wipe_complete_notice
source: Image cache wiped
ta: பட பதுக்ககம் அழிக்கப்பட்டது

# metadata_cache_wipe_title
source: Wipe cached metadata
ta: மேல்நிலைத்தரவின் பதுக்ககம் அழிக்கப்பட்டது

# metadata_cache_wipe_summary
source: Remove all cached webpage data
ta: பதுக்ககப்படுத்திய வலைப்பக்கத் தரவை நீக்கு

# metadata_cache_wipe_complete_notice
source: Metadata cache wiped
ta: மேல்நிலைத் தரவு பதுக்ககம் அழிக்கப்பட்டது

# auto_queue_title
source: Auto-enqueue next stream
ta: அடுத்த பாய்வில் தானாக-தாரைபடுத்து

# auto_queue_summary
source: Continue ending (non-repeating) playback queue by appending a related stream
ta: தொடர்புடைய ஸ்ட்ரீமைச் சேர்ப்பதன் மூலம் (மீண்டும் நிகழாத) பிளேபேக் வரிசையைத் தொடரவும்

# auto_queue_toggle
source: Auto-enqueuing
ta: தானாக-தாரைபடுத்தல்

# left_gesture_control_summary
source: Choose gesture for left half of player screen
ta: பிளேயர் திரையின் இடது பாதிக்கு சைகையைத் தேர்வுசெய்க

# left_gesture_control_title
source: Left gesture action
ta: இடது சைகை நடவடிக்கை

# right_gesture_control_summary
source: Choose gesture for right half of player screen
ta: பிளேயர் திரையின் வலது பாதிக்கு சைகையைத் தேர்வுசெய்க

# right_gesture_control_title
source: Right gesture action
ta: சரியான சைகை நடவடிக்கை

source: Brightness
ta: ஒளி

source: Volume
ta: தொகுதி

source: None
ta: எதுவுமில்லை

# show_search_suggestions_title
source: Search suggestions
ta: பரிந்துரைகளைத் தேடு

# show_search_suggestions_summary
source: Choose the suggestions to show when searching
ta: தேடும்போது காட்ட, பரிந்துரைகளைத் தெரிவுசெய்

source: Local search suggestions
ta: உள்ளூர் தேடல் பரிந்துரைகள்

source: Remote search suggestions
ta: தொலைதேடல் பரிந்துரைகள்

# enable_search_history_title
source: Search history
ta: தேடல் வரலாறு

# enable_search_history_summary
source: Store search queries locally
ta: தேடல் வாக்கியத்தை அமைவிடத்தில் தேக்கு

# enable_watch_history_title
source: Watch history
ta: பார்த்த வரலாறு

# enable_playback_resume_title
source: Resume playback
ta: திரையிடலை தொடங்கு

# enable_playback_resume_summary
source: Restore last playback position
ta: கடைசியாக மீட்பொலித்த இருப்பிடத்தை மீட்டெடு

# enable_playback_state_lists_title
source: Positions in lists
ta: பட்டியலில் இடங்கள்

# enable_playback_state_lists_summary
source: Show playback position indicators in lists
ta: பட்டியல்களில் இயக்கக குறியட நிலைகாட்டிகளைக் காட்டு

# settings_category_clear_data_title
source: Clear data
ta: தரவை அழி

# enable_watch_history_summary
source: Keep track of watched videos
ta: பார்த்த காணொளிகளை குறிப்பிடு

# resume_on_audio_focus_gain_title
source: Resume playing
ta: இயக்குதலைத் மறுதொடர்

# resume_on_audio_focus_gain_summary
source: Continue playing after interruptions (e.g. phonecalls)
ta: தொலைபேசி அழைப்பு போன்ற குறுக்கீடுகளுக்கு பிறகு தொடரவும்

# download_dialog_title
source: Download
ta: பதிவிறக்கு

# start_main_player_fullscreen_title
source: Start main player in fullscreen
ta: முதன்மை இயக்கியை முழுதிரையில் துவக்கு

# start_main_player_fullscreen_summary
source: Do not start videos in the mini player, but turn to fullscreen mode directly, if auto rotation is locked. You can still access the mini player by exiting fullscreen
ta: துணையியக்கியில் காணொளிகளை துவக்காதே, ஆனால் தானாக சுழற்றல் பூட்டப்பட்டிருந்தால் நேரடியாக முழுதிரைக்குத் திரும்பு. முழுதிரையை வெளியேறி நீங்கள் இன்னும் துணையியக்கியை அணுகலாம்

# autoplay_title
source: Autoplay
ta: தானாக ஓட்டு

# show_hold_to_append_title
source: Show "Hold to enqueue" tip
ta: "சாரைபடுத்த நீண்டழுத்து" துணுக்குதவியைக் காட்டு

# show_hold_to_append_summary
source: Show tip when pressing the background or the popup button in video "Details:"
ta: "விவரங்கள்:" வீடியோவில் பின்னணி அல்லது பாப்அப் பட்டனை அழுத்தும் போது உதவிக்குறிப்பைக் காட்டு

source: Unsupported URL
ta: ஆதரிக்கப்படாத உரலி

# unsupported_url_dialog_message
source: Could not recognize the URL. Open with another app?
ta: உரலியை அங்கீகரக்க முடியவில்லை. மற்றொரு செயலியில் திறக்கவா?

# default_content_country_title
source: Default content country
ta: உள்ளடக்க இயல்பிருப்பு நாடு

# content_language_title
source: Default content language
ta: உள்ளடக்க இயல்பிருப்பு மொழி

# peertube_instance_url_title
source: PeerTube instances
ta: பியர்டியூப் நிகழ்வுகள்

# peertube_instance_url_summary
source: Select your favorite PeerTube instances
ta: உம் அபிமான பியர்டியூப் நிகழ்வுகளைத் தேர்ந்தெடு

# peertube_instance_url_help
source: Find the instances you like on %s
ta: உமக்குப் பிடித்த நிகழ்வை கண்டுபிடி இங்கு %s

# peertube_instance_add_title
source: Add instance
ta: நிகழ்வைச் சேர்

# peertube_instance_add_help
source: Enter instance URL
ta: நிகழ்வு உரலியை உள்ளிடு

# peertube_instance_add_fail
source: Could not validate instance
ta: நிகழ்வை செல்லுபடுயாக்க முடியவில்லை

# peertube_instance_add_https_only
source: Only HTTPS URLs are supported
ta: HTTPS உரலிகள் மட்டுமே ஆதரிக்கப்படுகின்றன

# peertube_instance_add_exists
source: Instance already exists
ta: நிகழ்வு ஏற்கனவே உள்ளது

# settings_category_player_title
source: Player
ta: இயக்கி

# settings_category_player_behavior_title
source: Behavior
ta: பண்பு

# settings_category_video_audio_title
source: Video and audio
ta: காணொளியும் ஒலியும்

# settings_category_history_title
source: History and cache
ta: வரலாறும் பதுக்ககமும்

# settings_category_appearance_title
source: Appearance
ta: தோற்றம்

# settings_category_debug_title
source: Debug
ta: வழுநீக்கு

# settings_category_updates_title
source: Updates
ta: புதுப்பித்தல்கள்

# settings_category_player_notification_title
source: Player notification
ta: பிளேயர் அறிவிப்பு

# settings_category_player_notification_summary
source: Configure current playing stream notification
ta: தற்போதைய இயங்கும் ஸ்ட்ரீம் அறிவிப்பை உள்ளமைக்கவும்

# settings_category_backup_restore_title
source: Backup and restore
ta: காப்புப்பிரதி மற்றும் மீட்டமை

# background_player_playing_toast
source: Playing in background
ta: பிண்ணணியில் ஓடுகிறது

# popup_playing_toast
source: Playing in popup mode
ta: திரைமேல் நிலையில் ஓடுகிறது

source: Content
ta: உள்ளடக்கம்

# show_age_restricted_content_title
source: Show age restricted content
ta: வயது வரம்புக்குட்பட்ட உள்ளடக்கத்தைக் காட்டு

# show_age_restricted_content_summary
source: Show content possibly unsuitable for children because it has an age limit (like 18+)
ta: வயது வரம்பு (18+ போன்ற) இருப்பதால், குழந்தைகளுக்குப் பொருத்தமற்ற உள்ளடக்கத்தைக் காட்டு

# youtube_restricted_mode_enabled_title
source: Turn on YouTube's "Restricted Mode"
ta: யூடியூபின் "கட்டுப்பாடு பயன்முறை"ஐ இயக்கு

# youtube_restricted_mode_enabled_summary
source: YouTube provides a "Restricted Mode" which hides potentially mature content
ta: YouTube "கட்டுப்படுத்தப்பட்ட பயன்முறையை" வழங்குகிறது, இது முதிர்ந்த உள்ளடக்கத்தை மறைக்கிறது

# restricted_video
source: This video is age restricted. Turn on "%1$s" in the settings if you want to see it.
ta: இக்காணொளி வயது வரம்புக்குட்டபட்டது. இதைக் காண வேண்டுமெனில் அமைவில் "%1$s"ஐ இயக்கு.

# restricted_video_no_stream
source: This video is age-restricted. Due to new YouTube policies with age-restricted videos, NewPipe cannot access any of its video streams and thus is unable to play it.
ta: இந்த வீடியோ வயது வரம்புக்குட்பட்டது. வயது வரம்புக்குட்பட்ட வீடியோக்கள் கொண்ட புதிய YouTube கொள்கைகள் காரணமாக, NewPipe ஆல் அதன் எந்த வீடியோ ஸ்ட்ரீம்களையும் அணுக முடியாது, இதனால் அதை இயக்க முடியவில்லை.

# duration_live
source: Live
ta: நேரலை

source: Downloads
ta: பதிவிறக்கங்கள்

# downloads_title
source: Downloads
ta: பதிவிறக்கங்கள்

# loading_metadata_title
source: Loading Metadata…
ta: மெட்டாடேட்டாவை ஏற்றுகிறது…

# error_report_title
source: Error report
ta: பிழை அறிக்கை

source: All
ta: அனைத்தும்

source: Channels
ta: சேனல்கள்

source: Playlists
ta: ஒளிச்சரங்கள்

# videos_string
source: Videos
ta: காணொளிகள்

source: Tracks
ta: காணொளிக் கோப்புகள்

source: Users
ta: பயனர்கள்

source: Events
ta: நிகழ்வுகள்

source: Songs
ta: பாடல்கள்

source: Albums
ta: தொகுப்புகள்

source: Artists
ta: கலைஞர்கள்

source: Disabled
ta: செயலிழக்கச் செய்யப்பட்டுள்ளது

source: Clear
ta: அழி

source: Best resolution
ta: சிறந்த திரைத் தெளிவுத்திறன்

source: Undo
ta: முந்தய நிலைக்குச் செல்

source: File deleted
ta: கோப்பு அழிக்கப்பட்டது

source: Play All
ta: அனைத்தையும் இயக்கு

source: Always
ta: எப்பொழுதும்

source: Just Once
ta: ஒரு முறை

source: File
ta: கோப்பு

source: Notifications
ta: அறிவிப்புகள்

# notification_channel_name
source: NewPipe notification
ta: NewPipe அறிவிப்பு

# notification_channel_description
source: Notifications for NewPipe's player
ta: NewPipe இயக்கிக்கான அறிவிப்புகள்

# app_update_notification_channel_name
source: App update notification
ta: செயலி புதுப்பித்தல் அறிவிப்பு

# app_update_notification_channel_description
source: Notifications for new NewPipe versions
ta: புதிய NewPipe பதிப்புக்கான அறிவிப்புகள்

# hash_channel_name
source: Video hash notification
ta: வீடியோ ஹாஷ் அறிவிப்பு

# hash_channel_description
source: Notifications for video hashing progress
ta: வீடியோ ஹேஷிங் முன்னேற்றத்திற்கான அறிவிப்புகள்

# streams_notification_channel_name
source: New streams
ta: புதிய நீரோடைகள்

# streams_notification_channel_description
source: Notifications about new streams for subscriptions
ta: சந்தாவுக்கான புதிய ஸ்ட்ரீம்கள் பற்றிய அறிவிப்புகள்

# error_report_channel_name
source: Error report notification
ta: பிழையறிக்கை அறிவிப்பு

# error_report_channel_description
source: Notifications to report errors
ta: பிழைகளைப் புகாரளிக்க அறிவிப்புகள்

# unknown_content
source: [Unknown]
ta: [அறியப்படவில்லை]

source: Switch to Background
ta: பின்னனிக்கு மாறு

source: Switch to Popup
ta: பாப்அப் இயக்கிக்கு மாறு

source: Switch to Main
ta: முதற்பக்கத்துக்கு மாற்று

# import_data_title
source: Import database
ta: தகவல்கலை இறக்குமதி செய்

# export_data_title
source: Export database
ta: தகவல்கலை ஏற்றுமதி செய்

# clear_cookie_title
source: Clear reCAPTCHA cookies
ta: reCAPTCHA நினைவிகளைத் துடை

# recaptcha_cookies_cleared
source: reCAPTCHA cookies have been cleared
ta: reCAPTCHA நினைவிகள் துடைக்கப்பட்டன

# import_data_summary
source: Overrides your current history, subscriptions, playlists and (optionally) settings
ta: தற்போதைய வரலாறு, சந்தாக்கள், ஒளிச்சரங்கள் மற்றும் (விரும்பினால்) அமைவை மீறும்

# export_data_summary
source: Export history, subscriptions, playlists and settings
ta: வரலாறு, சந்தாக்கள், ஒளிச்சரங்கள் மற்றும் அமைவை ஏற்றுமதி செய்

# clear_cookie_summary
source: Clear cookies that NewPipe stores when you solve a reCAPTCHA
ta: reCAPTCHAஐ தீர்க்கையில் NewPipe சேமிக்கும் நினைவிகளைத் துடை

# clear_views_history_title
source: Clear watch history
ta: பார்த்த வரலாற்றை அழி

# clear_views_history_summary
source: Deletes the history of played streams and the playback positions
ta: இயக்கிய பாய்வுகள் மற்றும் இயக்கக குறியிடங்களின் வரலாற்றை அழிக்கும்

# delete_view_history_alert
source: Delete entire watch history?
ta: பார்த்த வரலாறு முழுவதையும் அழி?

source: Watch history deleted
ta: பார்த்த வரலாறு அழிக்கப்பட்டது

# clear_playback_states_title
source: Delete playback positions
ta: இயக்கக குறியிடங்களை அழி

# clear_playback_states_summary
source: Deletes all playback positions
ta: எல்லா இயக்கக குறியிடங்களையும் அழிக்கும்

# delete_playback_states_alert
source: Delete all playback positions?
ta: எல்லா இயக்கக குறியிடங்களையும் அழிக்கவா?

# watch_history_states_deleted
source: Playback positions deleted
ta: இயக்கக குறியிடங்கள் அழிக்கப்பட்டன

# clear_search_history_title
source: Clear search history
ta: தேடல் வரலாற்றை அழி

# clear_search_history_summary
source: Deletes history of search keywords
ta: தேடப்பட்ட வார்த்தைகளின் வரலாற்றை அழி

# delete_search_history_alert
source: Delete entire search history?
ta: தேடல் வரலாறு முழுவதையும் அழி?

source: Search history deleted
ta: தேடல் வரலாறு அழிக்கப்பட்டது

source: Fast mode
ta: வேகமான பயன்முறை

# main_tabs_position_summary
source: Move main tab selector to the bottom
ta: முதன்மையான தாவல் தேர்வாளரை கீழே நகர்த்தவும்

# main_tabs_position_title
source: Main tabs position
ta: முதன்மையான தாவல்கள் நிலை

# general_error
source: Error
ta: பிழை

# download_to_sdcard_error_title
source: External storage unavailable
ta: வெளி சேமிப்பு இயலாது

# download_to_sdcard_error_message
source: Downloading to external SD card not possible. Reset download folder location?
ta: புற SD அட்டைக்குப் பதிவிறக்குதல் சாத்தியமில்லை. பதிவிறக்க அடைவிடத்தை அகரமாக்கவா?

source: Network error
ta: நெட்வொர்க் பிழை

# could_not_load_thumbnails
source: Could not load all thumbnails
ta: எல்லா சிறுபடங்களையும் ஏற்ற முடியவில்லை

# parsing_error
source: Could not parse website
ta: வலைத்தளத்தைப் பாகுபடுத்த முடியவில்லை

# content_not_available
source: Content unavailable
ta: உள்ளடக்கம் கிடைக்கவில்லை

source: Could not set up download menu
ta: பதிவிறக்கச்சிறுபட்டியை அமைக்க முடியவில்லை

# app_ui_crash
source: App/UI crashed
ta: செயலி நிறுத்தப்பட்டது

# player_stream_failure
source: Could not play this stream
ta: இப்பாய்வினை இயக்க முடியவில்லை

# player_unrecoverable_failure
source: Unrecoverable player error occurred
ta: மீட்கவியலாத இயக்கி பிழை ஏற்பட்டது

# player_recoverable_failure
source: Recovering from player error
ta: இயக்கி பிழையிலிருந்து மீளப்பெறுகிறது

# external_player_unsupported_link_type
source: External players don't support these types of links
ta: இவ்வகை தொடுப்புகளைப் புற இயக்கிகள் ஆதரக்கா

# video_streams_empty
source: No video streams found
ta: எந்த காணொலியும் இல்லை

# audio_streams_empty
source: No audio streams found
ta: எந்த ஒலியோடையும் இல்லை

# missing_file
source: File moved or deleted
ta: கோப்பு மாற்ற அல்லது நீக்கப்பட்டது

# invalid_directory
source: No such folder
ta: அப்படியொரு அடைவுகள் இல்லை

# invalid_source
source: No such file/content source
ta: அப்படியொரு கோப்பு இல்லை
