Repository: 247i/TACETr
Catalog: உரை/தானி/newpipe-strings-*.po
Languages: ta

# always_use_exoplayer_set_output_surface_workaround_title
source: Always use ExoPlayer's video output surface setting workaround
ta: எப்போதும் எக்சோப்ளேயரின் வீடியோ வெளியீட்டு மேற்பரப்பு அமைப்பு பணித்தொகுப்பைப் பயன்படுத்துங்கள்

# always_use_exoplayer_set_output_surface_workaround_summary
source: This workaround releases and re-instantiates video codecs when a surface change occurs, instead of setting the surface to the codec directly. Already used by ExoPlayer on some devices with this issue, this setting has only an effect on Android 6 and higher Enabling this option may prevent playback errors when switching the current video player or switching to fullscreen
ta: இந்த பணித்தொகுப்பு ஒரு மேற்பரப்பு மாற்றம் நிகழும்போது வீடியோ கோடெக்குகளை வெளியிட்டு மீண்டும் நிறுவுகிறது, அதற்கு பதிலாக கோடெக்கிற்கு நேரடியாக மேற்பரப்பை அமைப்பதற்கு பதிலாக. இந்த சிக்கலுடன் சில சாதனங்களில் ஏற்கனவே எக்சோப்ளேயரால் பயன்படுத்தப்படுகிறது, இந்த அமைப்பு ஆண்ட்ராய்டு 6 மற்றும் அதற்கு மேற்பட்டவற்றில் மட்டுமே தாக்கத்தை ஏற்படுத்துகிறது இந்த விருப்பத்தை இயக்குவது தற்போதைய வீடியோ பிளேயரை மாற்றும்போது அல்லது முழுத்திரைக்கு மாறும்போது பிளேபேக் பிழைகளைத் தடுக்கலாம்

# audio_track_type_original
source: original
ta: அசல்

# audio_track_type_dubbed
source: dubbed
ta: டப்பிங்

# audio_track_type_descriptive
source: descriptive
ta: விளக்கமான

# audio_track_type_secondary
source: secondary
ta: இரண்டாம் நிலை

# channel_tab_videos
source: Videos
ta: வீடியோக்கள்

# channel_tab_tracks
source: Tracks
ta: தடங்கள்

# channel_tab_shorts
source: Shorts
ta: குறுக்குகள்

# channel_tab_livestreams
source: Live
ta: வாழ

# channel_tab_channels
source: Channels
ta: சேனல்கள்

# channel_tab_playlists
source: Playlists
ta: பிளேலிச்ட்கள்

# channel_tab_albums
source: Albums
ta: ஆல்பம்

# channel_tab_about
source: About
ta: பற்றி

# show_channel_tabs
source: Channel tabs
ta: சேனல் தாவல்கள்

# show_channel_tabs_summary
source: What tabs are shown on the channel pages
ta: சேனல் பக்கங்களில் என்ன தாவல்கள் காட்டப்பட்டுள்ளன

source: Open play queue
ta: திறந்த விளையாட்டு வரிசை

source: Toggle fullscreen
ta: மாற்று முழுத்திரை

source: Toggle screen orientation
ta: திரை நோக்குநிலையை மாற்றவும்

source: Previous stream
ta: முந்தைய ச்ட்ரீம்

source: Next stream
ta: அடுத்த ச்ட்ரீம்

source: Play
ta: விளையாடுங்கள்

source: Replay
ta: மீண்டும்

source: More options
ta: மேலும் விருப்பங்கள்

source: Duration
ta: காலம்

source: Rewind
ta: முன்னாடி

source: Forward
ta: முன்னோக்கி

# image_quality_title
source: Image quality
ta: பட தகுதி

# image_quality_summary
source: Choose the quality of images and whether to load images at all, to reduce data and memory usage. Changes clear both in-memory and on-disk image cache — %s
ta: தரவு மற்றும் நினைவக பயன்பாட்டைக் குறைக்க, படங்களின் தகுதி மற்றும் படங்களை ஏற்ற வேண்டுமா என்பதைத் தேர்வுசெய்க. மாற்றங்கள் நினைவகம் மற்றும் ஆன்-வட்டு பட தற்காலிக சேமிப்பு இரண்டையும் அழிக்கின்றன- %s

# image_quality_none
source: Do not load images
ta: படங்களை ஏற்ற வேண்டாம்

# image_quality_low
source: Low quality
ta: குறைந்த தகுதி

# image_quality_medium
source: Medium quality
ta: நடுத்தர தகுதி

# image_quality_high
source: High quality
ta: உயர் தகுதி

source: Share Playlist
ta: பிளேலிச்ட்டைப் பகிரவும்

# share_playlist_with_titles_message
source: Share playlist with details such as playlist name and video titles or as a simple list of video URLs
ta: பிளேலிச்ட் பெயர் மற்றும் வீடியோ தலைப்புகள் போன்ற விவரங்களுடன் அல்லது வீடியோ முகவரி களின் எளிய பட்டியலாக பிளேலிச்ட்டைப் பகிரவும்

# share_playlist_with_titles
source: Share with Titles
ta: தலைப்புகளுடன் பகிர்ந்து கொள்ளுங்கள்

# share_playlist_with_list
source: Share URL list
ta: முகவரி பட்டியலைப் பகிரவும்

# replies
source: %s reply
ta: %s பதில்

source: Show more
ta: மேலும் காட்டு

source: Show less
ta: குறைவாகக் காட்டு

# import_settings_vulnerable_format
source: The settings in the export being imported use a vulnerable format that was deprecated since NewPipe 0.27.0. Make sure the export being imported is from a trusted source, and prefer using only exports obtained from NewPipe 0.27.0 or newer in the future. Support for importing settings in this vulnerable format will soon be removed completely, and then old versions of NewPipe will not be able to import settings of exports from new versions anymore.
ta: ஏற்றுமதியில் இறக்குமதி செய்யப்படும் அமைப்புகள் பாதிக்கப்படக்கூடிய வடிவமைப்பைப் பயன்படுத்துகின்றன, இது நியூபைப் 0.27.0 முதல் நீக்கப்பட்டது. இறக்குமதி செய்யப்படும் ஏற்றுமதி நம்பகமான மூலத்திலிருந்து வந்தது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், மேலும் நியூபைப் 0.27.0 அல்லது எதிர்காலத்தில் புதியதாக பெறப்பட்ட ஏற்றுமதியை மட்டுமே பயன்படுத்த விரும்புகிறது. இந்த பாதிக்கப்படக்கூடிய வடிவத்தில் அமைப்புகளை இறக்குமதி செய்வதற்கான உதவி விரைவில் முழுமையாக அகற்றப்படும், பின்னர் நியூபைப்பின் பழைய பதிப்புகள் புதிய பதிப்புகளிலிருந்து ஏற்றுமதியின் அமைப்புகளை இனி இறக்குமதி செய்ய முடியாது.
