Repository: 247i/TACETr
Catalog: உரை/தானி/newquiz-android-strings-*.po
Languages: ta

# app_name
source: NewQuiz
ta: நியூக்விச்

source: Quick Quiz
ta: விரைவான நொடி வினா

source: Back
ta: பின்

source: More options
ta: மேலும் விருப்பங்கள்

source: Saved questions
ta: சேமித்த கேள்விகள்

source: Wordle
ta: வேர்டில்

source: Wordle infinite
ta: வேர்டில் எல்லையற்றது

# wordle_daily
source: Daily wordle
ta: நாள்தோறும் வேர்டில்

source: Verify
ta: சரிபார்க்கவும்

source: Play again
ta: மீண்டும் விளையாடுங்கள்

source: Close
ta: மூடு

source: Game Over
ta: விளையாட்டு ஓவர்

source: Item empty
ta: உருப்படி காலியாக உள்ளது

# item_i_none
source: Item %1$s none
ta: பொருள் %1$s எதுவுமில்லை

# item_i_present
source: Item %1$s present
ta: பொருள் %1$s உள்ளன

# item_i_correct
source: Item %1$s correct
ta: பொருள் %1$s சரியானவை

# four_letters
source: 4 Letters
ta: 4 கடிதங்கள்

# five_letters
source: 5 Letters
ta: 5 கடிதங்கள்

# six_letters
source: 6 Letters
ta: 6 கடிதங்கள்

source: Back month
ta: பின் மாதம்

source: Next month
ta: அடுத்த மாதம்

source: Settings
ta: அமைப்புகள்

source: General
ta: பொது

source: Quiz
ta: நொடி வினா

source: Quiz language
ta: நொடி வினா மொழி

source: English
ta: ஆங்கிலம்

source: Portuguese
ta: போர்த்துகீசியம்

source: Spanish
ta: ச்பானிச்

source: French
ta: பிரஞ்சு

source: Color blind mode
ta: வண்ண குருட்டு முறை

source: High contrast colors
ta: அதிக மாறுபட்ட வண்ணங்கள்

source: Info
ta: தகவல்

source: Letter hints
ta: கடிதம் குறிப்புகள்

source: Hint above the letter that it appears twice or more in the hidden word
ta: மறைக்கப்பட்ட வார்த்தையில் இரண்டு அல்லது அதற்கு மேற்பட்டதாகத் தோன்றும் கடிதத்திற்கு மேலே குறிக்கவும்

source: Hard mode
ta: ஆர்ட் பயன்முறை

# any_revealed_hints_must_be_used_in_subsequest_guesses
source: Any revealed hints must be used in subsequent guesses
ta: வெளிப்படுத்தப்பட்ட குறிப்புகள் அடுத்தடுத்த யூகங்களில் பயன்படுத்தப்பட வேண்டும்

source: Rows limited
ta: வரிசைகள் லிமிடெட்

source: Wordle infinite row limited.
ta: வேர்டில் எல்லையற்ற வரிசை லிமிடெட்.

source: Wordle infinite row limit value.
ta: வேர்டில் எல்லையற்ற வரிசை வரம்பு மதிப்பு.

source: Clean calendar data
ta: காலண்டர் தரவு தூய்மையான

# clean_saved_calendar_wins_losses
source: Cleans all saved calendar wins/losses.
ta: சேமித்த அனைத்து காலண்டர் வெற்றிகளையும்/இழப்புகளையும் சுத்தப்படுத்துகிறது.

# clear_settings
source: Clear Preferences
ta: தெளிவான விருப்பத்தேர்வுகள்

source: Remove all saved settings
ta: சேமித்த அனைத்து அமைப்புகளையும் அகற்றவும்

source: Home
ta: வீடு

source: Today game
ta: இன்று விளையாட்டு

source: Today random game
ta: இன்று சீரற்ற விளையாட்டு

source: Multi choice quiz
ta: மல்டி சாய்ச் நொடி வினா

source: Flag quiz
ta: கொடி நொடி வினா

source: Logo quiz
ta: லோகோ நொடி வினா

source: Other
ta: மற்றொன்று

source: General knowledge
ta: பொது அறிவு

# entertainment_books
source: Books
ta: புத்தகங்கள்

# entertainment_film
source: Film
ta: படம்

# entertainment_music
source: Music
ta: இசை

# entertainment_musicals_and_theatres
source: Musicals & Theatres
ta: இசைக்கலைஞர்கள் & தியேட்டர்கள்

# entertainment_television
source: Television
ta: தொலைக்காட்சி

# entertainment_video_games
source: Video Games
ta: வீடியோ கேம்கள்

# entertainment_board_games
source: Board Games
ta: பலகை விளையாட்டுகள்

# science_and_nature
source: Science & Nature
ta: அறிவியல் & இயற்கை

# science_computers
source: Computers
ta: கணினிகள்

# science_mathematics
source: Mathematics
ta: கணிதம்

source: Mythology
ta: புராணம்

source: Sports
ta: விளையாட்டு

source: Geography
ta: புவியியல்

source: History
ta: வரலாறு

source: Politics
ta: அரசியல்

source: Art
ta: கலை

source: Celebrities
ta: பிரபலங்கள்

source: Animals
ta: விலங்குகள்

source: Vehicles
ta: வாகனங்கள்

# entertainment_comics
source: Comics
ta: காமிக்ச்

# science_gadgets
source: Gadgets
ta: கேசெட்டுகள்

# entertainment_japanese_anime_and_manga
source: Japanese Anime & Manga
ta: சப்பானிய அனிம் & மங்கா

# entertainment_cartoon_and_animations
source: Cartoon & Animations
ta: கார்ட்டூன் & அனிமேசன்கள்

source: Categories
ta: வகைகள்

# n_questions_available
source: %1$s question available
ta: %1$s கேள்வி கிடைக்கிறது

source: See all
ta: அனைத்தையும் காண்க

source: Difficulty
ta: தொல்லை

# is_not_in_the_target_word_wordle
source: is not in the target word.
ta: இலக்கு வார்த்தையில் இல்லை.

# is_in_the_word_but_in_the_wrong_spot_wordle
source: is in the word but in the wrong spot.
ta: வார்த்தையில் உள்ளது, ஆனால் தவறான இடத்தில்.

# is_in_the_word_and_in_the_correct_spot_wordle
source: is in the word and in the correct spot.
ta: வார்த்தையில் மற்றும் சரியான இடத்தில் உள்ளது.

source: Results screen
ta: முடிவுகள் திரை

# n_correct_questions
source: %1$s correct questions
ta: %1$s சரியான கேள்விகள்

source: Quiz question size
ta: நொடி வினா கேள்வி அளவு

source: Translation
ta: மொழிபெயர்ப்பு

source: Translation enabled
ta: மொழிபெயர்ப்பு இயக்கப்பட்டது

source: Download translation model
ta: மொழிபெயர்ப்பு மாதிரியைப் பதிவிறக்கவும்

# download_translation_model_description
source: Download translation model for on device translation.
ta: சாதன மொழிபெயர்ப்பில் மொழிபெயர்ப்பு மாதிரியைப் பதிவிறக்கவும்.

source: Downloading translation model
ta: மொழிபெயர்ப்பு மாதிரியைப் பதிவிறக்குகிறது

# downloading_translation_model_description
source: Downloading translation model, this may take a while.
ta: மொழிபெயர்ப்பு மாதிரியைப் பதிவிறக்குகிறது, இதற்கு சிறிது நேரம் ஆகலாம்.

source: Delete translation model
ta: மொழிபெயர்ப்பு மாதிரியை நீக்கு

source: Online
ta: ஆன்லைனில்

source: Profile
ta: சுயவிவரம்

source: Correct answers
ta: சரியான பதில்கள்

source: Total questions
ta: மொத்த கேள்விகள்

source: Last quiz times
ta: கடைசி நொடி வினா நேரங்கள்

source: Time
ta: நேரம்

source: Last questions
ta: கடைசி கேள்விகள்

source: Correct words
ta: சரியான சொற்கள்

source: Total words
ta: மொத்த சொற்கள்

source: User XP
ta: பயனர் எக்ச்பி

source: Level
ta: நிலை

source: Current XP
ta: தற்போதைய எக்ச்பி

source: Required xp to next level
ta: எக்ச்பி அடுத்த நிலைக்கு தேவை

# photo_of_s
source: Photo of %1$s
ta: %1$s புகைப்படம்

source: Good morning
ta: காலை வணக்கம்

source: Good afternoon
ta: நல்ல மதியம்

source: Good evening
ta: நல்ல மாலை

source: Good night
ta: நல்ல இரவு

source: No diamonds
ta: வைரங்கள் இல்லை

# skip_question_q
source: Skip question?
ta: கேள்வியைத் தவிர்க்கவா?

# you_have_n_diamonds_skip_question_q
source: You have one diamond, do you want to use the diamond to skip this question?
ta: உங்களிடம் ஒரு வைரம் உள்ளது, இந்த கேள்வியைத் தவிர்க்க வைரத்தைப் பயன்படுத்த விரும்புகிறீர்களா?

# no_diamonds_to_skip_question_description
source: You don't have diamonds to skip this question!
ta: இந்த கேள்வியைத் தவிர்க்க உங்களுக்கு வைரங்கள் இல்லை!

source: Skip
ta: தவிர்

source: Save
ta: சேமி

source: Dismiss
ta: தள்ளுபடி

source: Guess the Word
ta: வார்த்தையை யூகிக்கவும்

source: Guess the Number
ta: எண்ணை யூகிக்கவும்

source: Guess math formula
ta: கணித சூத்திரத்தை யூகிக்கவும்

source: Guess solution
ta: தீர்வு யூகிக்கவும்

source: Math quiz
ta: கணித நொடி வினா

source: Maze
ta: பிரமை

source: Easy
ta: எளிதானது

source: Medium
ta: சராசரி

source: Hard
ta: கடினமானது

source: Open drawer
ta: திறந்த அலமாரியை

source: Copy maze seed
ta: பிரமை விதை நகலெடுக்கவும்

source: Restart maze
ta: பிரமை மறுதொடக்கம் செய்யுங்கள்

source: Generate maze
ta: பிரமை உருவாக்குங்கள்

source: Maze completed!
ta: பிரமை முடிந்தது!

source: Generate offline maze
ta: இணைப்பில்லாத பிரமை உருவாக்குங்கள்

# generate_offline_maze_description
source: Generate maze with all game modes that don't need internet connection.
ta: இணைய இணைப்பு தேவையில்லாத அனைத்து விளையாட்டு முறைகளுடனும் பிரமை உருவாக்குங்கள்.

source: Random maze
ta: சீரற்ற பிரமை

# generate_maze_with_random_items
source: Generate maze with random questions, all game modes will be included.
ta: சீரற்ற கேள்விகளுடன் பிரமை உருவாக்குங்கள், அனைத்து விளையாட்டு முறைகளும் சேர்க்கப்படும்.

source: Custom maze
ta: தனிப்பயன் பிரமை

source: Generate maze with custom options
ta: தனிப்பயன் விருப்பங்களுடன் பிரமை உருவாக்குங்கள்

source: Expand custom options
ta: தனிப்பயன் விருப்பங்களை விரிவாக்குங்கள்

# custom_maze_multi_choice_warning
source: When using custom seed, multi choice questions will not be random generated by this seed.
ta: தனிப்பயன் விதை பயன்படுத்தும் போது, ​​மல்டி சாய்ச் கேள்விகள் இந்த விதை மூலம் சீரற்றதாக இருக்காது.

source: Generate
ta: உருவாக்கு

source: Seed
ta: விதை

source: User
ta: பயனர்

source: Number trivia
ta: எண் அற்பம்

source: About and Help
ta: பற்றி மற்றும் உதவி

source: Animations
ta: அனிமேசன்கள்

source: Animations Enabled
ta: அனிமேசன்கள் இயக்கப்பட்டன

source: Global animations enabled
ta: உலகளாவிய அனிமேசன்கள் இயக்கப்பட்டன

source: Wordle animations enabled
ta: வேர்டில் அனிமேசன்கள் இயக்கப்பட்டன

# wordle_animations_enabled_description
source: Enable animations for wordle game mode.
ta: வேர்டல் கேம் பயன்முறைக்கான அனிமேசன்களை இயக்கவும்.

source: Multi choice animations enabled
ta: மல்டி சாய்ச் அனிமேசன்கள் இயக்கப்பட்டன

# multi_choice_animations_enabled_description
source: Enable animations for multi choice game mode.
ta: மல்டி சாய்ச் கேம் பயன்முறையில் அனிமேசன்களை இயக்கவும்.

source: Sort questions
ta: கேள்விகளை வரிசைப்படுத்துங்கள்

# play_with_random_saved_questions
source: Play quiz with random saved questions
ta: சீரற்ற சேமித்த கேள்விகளுடன் நொடி வினா விளையாடுங்கள்

source: Play
ta: விளையாடுங்கள்

source: Play with selected questions
ta: தேர்ந்தெடுக்கப்பட்ட கேள்விகளுடன் விளையாடுங்கள்

source: Unselect All
ta: அனைத்தையும் தேர்வு செய்யுங்கள்

source: Select All
ta: அனைத்தையும் தெரிவுசெய்

source: Delete Selected
ta: தேர்ந்தெடுக்கப்பட்டதை நீக்கு

source: Download questions
ta: கேள்விகளைப் பதிவிறக்கவும்

source: Sort by Default
ta: இயல்பாக வரிசைப்படுத்தவும்

source: Sort by Description
ta: விளக்கத்தால் வரிசைப்படுத்துங்கள்

source: Sort by Category
ta: வகை அடிப்படையில் வரிசைப்படுத்துங்கள்

source: Country capital flags
ta: நாட்டின் மூலதனக் கொடிகள்

source: Comparison quiz
ta: ஒப்பீட்டு நொடி வினா

source: or
ta: அல்லது

# position_n
source: Position: %1$d
ta: நிலை: %1$d

# highest_n
source: Highest: %1$d
ta: அதிகபட்சம்: %1$d

source: Your score
ta: உங்கள் மதிப்பெண்

source: Highest score
ta: அதிக மதிப்பெண்

source: Select a comparison mode for the first item
ta: முதல் உருப்படிக்கு ஒப்பீட்டு பயன்முறையைத் தேர்ந்தெடுக்கவும்

# image_category_of_s
source: Image category of %1$s
ta: பட வகை %1$s

# icon_of_s
source: Icon of %1$s
ta: %1$s படவுரு

source: Greater
ta: பெரிய

source: Lesser
ta: குறைவான

source: Email
ta: மின்னஞ்சல்

source: Password
ta: கடவுச்சொல்

source: Name
ta: பெயர்

source: Next
ta: அடுத்தது

source: Random Quiz
ta: சீரற்ற நொடி வினா

source: Random
ta: சீரற்ற

source: Quiz with random categories
ta: சீரற்ற வகைகளுடன் நொடி வினா

source: See all categories
ta: அனைத்து வகைகளையும் காண்க

source: See less categories
ta: குறைவான வகைகளைக் காண்க

source: Clear recent categories
ta: அண்மைக் கால வகைகளை அழிக்கவும்

# clear_recent_categories_description
source: Remove all recent categories from the list screen
ta: பட்டியல் திரையில் இருந்து அனைத்து அண்மைக் கால வகைகளையும் அகற்று

source: Loading questions…
ta: கேள்விகளை ஏற்றுகிறது…

# quiz_steps_row_container
source: Quiz steps container
ta: நொடி வினா படிகள் கொள்கலன்

# question_n_correct
source: Question %1$d - Correct
ta: கேள்வி %1$d - சரியானது

# question_n_incorrect
source: Question %1$d - Incorrect
ta: கேள்வி %1$d - தவறானது

source: Analytics
ta: பகுப்பாய்வு

source: Analytics collection enabled
ta: பகுப்பாய்வு சேகரிப்பு இயக்கப்பட்டது

source: Data Collection Consent
ta: தரவு சேகரிப்பு ஒப்புதல்

# data_collection_consent_description
source: Thank you for using NewQuiz! To help us improve the app and fix any issues that may arise, we collect certain data from your device. The data we collect includes: • Analytics data: This includes information about how you use the app, such as which features you use most frequently, how long you spend on each page, and which quizzes you complete. • Crash data: If the app crashes while you're using it, we collect data about the crash to help us identify and fix the issue. • Performance data: We collect information about how the app performs on your device, such as how quickly pages load and how long it takes to complete quizzes. We take your privacy seriously and only use this data for app improvement purposes. Your data will never be sold or shared with third parties for marketing purposes. By using the NewQuiz, you consent to the collection of this data. If you ever change your mind, you can disable data collection in the app settings. Thank you for your understanding and support!
ta: நிய்விசைப் பயன்படுத்தியதற்கு நன்றி! பயன்பாட்டை மேம்படுத்தவும், எழக்கூடிய ஏதேனும் சிக்கல்களை சரிசெய்யவும் எங்களுக்கு உதவ, உங்கள் சாதனத்திலிருந்து சில தரவுகளை நாங்கள் சேகரிக்கிறோம். நாங்கள் சேகரிக்கும் தரவு பின்வருமாறு: • அனலிட்டிக்ச் தரவு: நீங்கள் பயன்பாட்டை எவ்வாறு பயன்படுத்துகிறீர்கள், அதாவது எந்த அம்சங்களை நீங்கள் அடிக்கடி பயன்படுத்துகிறீர்கள், ஒவ்வொரு பக்கத்திலும் எவ்வளவு நேரம் செலவிடுகிறீர்கள், எந்த நொடி வினாக்களை முடிக்கிறீர்கள் என்பது பற்றிய தகவல்கள் இதில் அடங்கும். தகவல்கள் தரவு செயலிழப்பு: நீங்கள் அதைப் பயன்படுத்தும் போது பயன்பாடு செயலிழந்தால், சிக்கலை அடையாளம் காணவும் சரிசெய்யவும் எங்களுக்கு உதவ விபத்து பற்றிய தரவை நாங்கள் சேகரிக்கிறோம். • செயல்திறன் தரவு: உங்கள் சாதனத்தில் பயன்பாடு எவ்வாறு செயல்படுகிறது என்பது பற்றிய தகவல்களை நாங்கள் சேகரிக்கிறோம், அதாவது பக்கங்கள் எவ்வளவு விரைவாக ஏற்றப்படுகின்றன, நொடி வினாக்களை முடிக்க எவ்வளவு நேரம் ஆகும். நாங்கள் உங்கள் தனியுரிமையை தீவிரமாக எடுத்துக்கொள்கிறோம், பயன்பாட்டு மேம்பாட்டு நோக்கங்களுக்காக இந்தத் தரவை மட்டுமே பயன்படுத்துகிறோம். சந்தைப்படுத்தல் நோக்கங்களுக்காக உங்கள் தரவு ஒருபோதும் மூன்றாம் தரப்பினருடன் விற்கப்படாது அல்லது பகிரப்படாது. நியூக்விசைப் பயன்படுத்துவதன் மூலம், இந்தத் தரவின் சேகரிப்புக்கு நீங்கள் ஒப்புக்கொள்கிறீர்கள். நீங்கள் எப்போதாவது உங்கள் எண்ணத்தை மாற்றினால், பயன்பாட்டு அமைப்புகளில் தரவு சேகரிப்பை முடக்கலாம். உங்கள் புரிதலுக்கும் ஆதரவிற்கும் நன்றி!

# data_collection_consent_agree
source: Yes, I consent
ta: ஆம், நான் சம்மதிக்கிறேன்

# data_collection_consent_disagree
source: No, I do not consent
ta: இல்லை, நான் சம்மதிக்கவில்லை

source: General analytics enabled
ta: பொது பகுப்பாய்வு இயக்கப்பட்டது

# general_analytics_description_enabled
source: Enables general analytics such as events, example: game starts, etc.
ta: நிகழ்வுகள், எடுத்துக்காட்டு போன்ற பொதுவான பகுப்பாய்வுகளை செயல்படுத்துகிறது: விளையாட்டு தொடங்குகிறது.

source: Crash analytics enabled
ta: செயலிழப்பு பகுப்பாய்வு இயக்கப்பட்டது

# crash_analytics_description_enabled
source: Enables crash data analytics such as app crashes and exceptions.
ta: பயன்பாட்டு செயலிழப்புகள் மற்றும் விதிவிலக்குகள் போன்ற செயலிழப்பு தரவு பகுப்பாய்வுகளை செயல்படுத்துகிறது.

source: Performance monitoring enabled
ta: செயல்திறன் கண்காணிப்பு இயக்கப்பட்டது

# performance_monitoring_description_enabled
source: Enables performance monitoring such as app startup time and other performance metrics.
ta: பயன்பாட்டு தொடக்க நேரம் மற்றும் பிற செயல்திறன் அளவீடுகள் போன்ற செயல்திறன் கண்காணிப்பை செயல்படுத்துகிறது.

source: Daily Challenge
ta: நாள்தோறும் அறைகூவல்

# play_random_multi_choice_quiz_game
source: Play one random multi choice quiz game.
ta: ஒரு சீரற்ற மல்டி சாய்ச் நொடி வினா விளையாட்டை விளையாடுங்கள்.

# end_multi_choice_quiz_game
source: End one multi choice quiz game.
ta: ஒரு மல்டி சாய்ச் நொடி வினா விளையாட்டை முடிக்கவும்.

# play_multi_choice_quiz_questions
source: Answer one question in multi choice quiz game.
ta: மல்டி சாய்ச் நொடி வினா விளையாட்டில் ஒரு கேள்விக்கு பதிலளிக்கவும்.

# get_multi_choice_quiz_answer_correct
source: Get one answer correct in multi choice quiz game.
ta: மல்டி சாய்ச் நொடி வினா விளையாட்டில் ஒரு பதிலை சரியாகப் பெறுங்கள்.

# play_multi_choice_quiz_game_in_category
source: Play one game with category of %2$s in multi choice quiz.
ta: மல்டி சாய்ச் நொடி வினாவில் %2$s வகையுடன் ஒரு விளையாட்டை விளையாடுங்கள்.

# get_wordle_word_correct
source: Get one word correct in wordle game.
ta: வேர்டல் விளையாட்டில் ஒரு வார்த்தையை சரியாகப் பெறுங்கள்.

# play_wordle_game_in_category
source: Play one game with category of %2$s in wordle game.
ta: வேர்டல் விளையாட்டில் %2$s வகையுடன் ஒரு விளையாட்டை விளையாடுங்கள்.

# play_comparison_quiz_game_in_category
source: Play one game with category of %2$s in comparison quiz.
ta: ஒப்பீட்டு நொடி வினாவில் %2$s வகையுடன் ஒரு விளையாட்டை விளையாடுங்கள்.

# play_comparison_quiz_game_and_get_score
source: Play one game and get a score of %2$d in comparison quiz.
ta: ஒரு விளையாட்டை விளையாடுங்கள் மற்றும் ஒப்பீட்டு நொடி வினாவில் %2$d மதிப்பெண்ணைப் பெறுங்கள்.

# play_comparison_quiz_game_in_comparison_mode
source: Play one game with %2$s mode in comparison quiz.
ta: ஒப்பீட்டு நொடி வினாவில் %2$s பயன்முறையுடன் ஒரு விளையாட்டை விளையாடுங்கள்.

source: Hide online categories
ta: நிகழ்நிலை வகைகளை மறைக்கவும்

# hide_online_categories_description
source: Hide categories that require internet connection, when device is offline.
ta: சாதனம் ஆஃப்லைனில் இருக்கும்போது இணைய இணைப்பு தேவைப்படும் வகைகளை மறைக்கவும்.

source: No categories available
ta: வகைகள் எதுவும் கிடைக்கவில்லை

source: Target Language
ta: இலக்கு மொழி

# target_language_description
source: Select the language you want to translate to
ta: நீங்கள் மொழிபெயர்க்க விரும்பும் மொழியைத் தேர்ந்தெடுக்கவும்

source: Download Settings
ta: அமைப்புகளை பதிவிறக்கவும்

source: Require Wi-Fi
ta: வைஃபை தேவை

# translation_require_wifi_description
source: Only download the translation model when connected to WiFi.
ta: WIFI உடன் இணைக்கப்படும்போது மட்டுமே மொழிபெயர்ப்பு மாதிரியை பதிவிறக்கவும்.

source: Require Charging
ta: கட்டணம் வசூலிக்க வேண்டும்

# translation_require_charging_description
source: Only download the translation model when the device is charging.
ta: சாதனம் சார்ச் செய்யும் போது மட்டுமே மொழிபெயர்ப்பு மாதிரியை பதிவிறக்கவும்.

source: Confirm
ta: உறுதிப்படுத்தவும்

source: Others
ta: மற்றவர்கள்

# require_internet_connection
source: Requires internet connection
ta: இணைய இணைப்பு தேவை

source: Don't require internet connection
ta: இணைய இணைப்பு தேவையில்லை

source: None
ta: எதுவுமில்லை

source: Both
ta: இரண்டும்

source: Show category connection info
ta: வகை இணைப்பு தகவலைக் காட்டு

source: XP
ta: எக்ச்பி

source: Total XP
ta: மொத்த எக்ச்பி

source: Today
ta: இன்று

source: This Week
ta: இந்த வாரம்

# general_settings_summary
source: Categories, Animations
ta: வகைகள், அனிமேசன்கள்

# multi_choice_settings_summary
source: Question count
ta: கேள்வி எண்ணிக்கை

# wordle_settings_summary
source: Hard mode, Quiz language, Letter hints
ta: கடின பயன்முறை, நொடி வினா மொழி, கடிதம் குறிப்புகள்

# translation_settings_summary
source: Translation language
ta: மொழிபெயர்ப்பு மொழி

# about_and_help_settings_summary
source: Version, Contact, Open source licences
ta: பதிப்பு, தொடர்பு, திறந்த மூல உரிமங்கள்

source: Select only Offline
ta: ஆஃப்லைனில் மட்டும் தேர்ந்தெடுக்கவும்

# maze_settings_auto_scroll_title
source: Auto scroll to current question
ta: தற்போதைய கேள்விக்கு ஆட்டோ ச்க்ரோல்

# maze_settings_auto_scroll_summary
source: Automatically scroll to current question when playing maze.
ta: பிரமை விளையாடும்போது தற்போதைய கேள்விக்கு தானாக உருட்டவும்.

# remaining_time
source: Remaining: %1$s
ta: மீதமுள்ள: %1$s

# claim_n_diamonds
source: Claim %1$d 💎
ta: உரிமைகோரல் %1$d

source: Regional Preferences
ta: பிராந்திய விருப்பத்தேர்வுகள்

source: Temperature Unit
ta: வெப்பநிலை அலகு

source: System Default
ta: கணினி இயல்புநிலை

source: Celsius
ta: செல்சியச்

source: Fahrenheit
ta: பாரன்ஈட்

source: Distance Unit
ta: தூர அலகு

source: Metric
ta: மெட்ரிக்

source: Imperial
ta: ஏகாதிபத்திய

source: No data
ta: தரவு இல்லை

source: No questions saved yet!
ta: இதுவரை எந்த கேள்வியும் சேமிக்கப்படவில்லை!

# no_questions_saved_description
source: Save or download questions to start playing offline.
ta: ஆஃப்லைனில் விளையாடத் தொடங்க கேள்விகளைச் சேமிக்கவும் அல்லது பதிவிறக்கவும்.

source: Level completed!
ta: நிலை முடிந்தது!

source: Next Level
ta: அடுத்த நிலை

source: Main Menu
ta: பட்டியல் விளையாடுங்கள்

source: Try Again
ta: மீண்டும் முயற்சிக்கவும்

source: Level failed!
ta: நிலை தோல்வியடைந்தது!

# level_failed_description
source: Don't give up! Try again to beat this level.
ta: விட்டுவிடாதீர்கள்! இந்த நிலையை வெல்ல மீண்டும் முயற்சிக்கவும்.

source: Error verifying word!
ta: சொல் சரிபார்ப்பது!

# need_to_use_all_hints_error
source: You need to use all hints from last row!
ta: கடைசி வரிசையில் இருந்து அனைத்து குறிப்புகளையும் நீங்கள் பயன்படுத்த வேண்டும்!

source: Empty word
ta: வெற்று சொல்

# word_not_only_letters_error
source: The word must contain only letters
ta: வார்த்தையில் எழுத்துக்கள் மட்டுமே இருக்க வேண்டும்

# word_not_only_digits_error
source: The word must contain only digits
ta: வார்த்தையில் இலக்கங்கள் மட்டுமே இருக்க வேண்டும்

# word_invalid_math_formula_error
source: Left formula is not equal to right solution
ta: இடது தேற்றம் வலது தீர்வுக்கு சமமானதல்ல

source: Invalid questions
ta: தவறான கேள்விகள்

# invalid_questions_description
source: There are %1$d questions with invalid categories. Remove the questions to continue playing or restart the maze.
ta: தவறான வகைகளுடன் %1$d கேள்விகள் உள்ளன. தொடர்ந்து விளையாடுவதற்கு கேள்விகளை அகற்றவும் அல்லது பிரமை மறுதொடக்கம் செய்யவும்.

source: Remove them
ta: அவற்றை அகற்றவும்

source: Category information
ta: வகை செய்தி

source: Cancel
ta: ரத்துசெய்

source: Restart
ta: மறுதொடக்கம்

# restart_maze_dialog_description
source: Are you sure you want to restart the maze?
ta: நீங்கள் பிரமை மறுதொடக்கம் செய்ய விரும்புகிறீர்களா?
