Repository: 247i/TACETr
Catalog: உரை/தானி/newsflash-news_flash_gtk-*.po
Languages: ta

source: NewsFlash
ta: நியூச்ஃப்ளாச்

source: Keep up with your feeds
ta: உங்கள் ஊட்டங்களைத் தொடருங்கள்

source: NewsFlash is a program designed to complement an already existing web-based RSS reader account.
ta: நியூச்ஃப்ளாச் என்பது ஏற்கனவே இருக்கும் வலை அடிப்படையிலான ஆர்எச்எச் ரீடர் கணக்கை நிறைவு செய்ய வடிவமைக்கப்பட்ட ஒரு நிரலாகும்.

source: It combines all the advantages of web based services like syncing across all your devices with everything you expect from a modern desktop program: Desktop notifications, fast search and filtering, tagging, handy keyboard shortcuts and having access to all your articles for as long as you like.
ta: நவீன டெச்க்டாப் நிரலிலிருந்து நீங்கள் எதிர்பார்க்கும் எல்லாவற்றையும் உங்கள் எல்லா சாதனங்களிலும் ஒத்திசைப்பது போன்ற வலை அடிப்படையிலான சேவைகளின் அனைத்து நன்மைகளையும் இது ஒருங்கிணைக்கிறது: டெச்க்டாப் அறிவிப்புகள், விரைவான தேடல் மற்றும் வடிகட்டுதல், குறிச்சொல், எளிமையான விசைப்பலகை குறுக்குவழிகள் மற்றும் உங்கள் அனைத்து கட்டுரைகளையும் அணுகலாம் போன்ற.

source: Main Window
ta: முதன்மை சாளரம்

source: Main Window Dark
ta: முதன்மையான சாளர இருண்ட

source: Preferences
ta: விருப்பத்தேர்வுகள்

source: Adaptive Main Window
ta: தகவமைப்பு முதன்மையான சாளரம்

source: Newsflash
ta: நியூச்ஃப்ளாச்

source: RSS Reader
ta: ஆர்எச்எச் ரீடர்

source: Faster than flash to deliver you the latest news from your subscribed feeds
ta: உங்கள் சந்தா ஊட்டங்களிலிருந்து அண்மைக் கால செய்திகளை உங்களுக்கு வழங்க ஃபிளாச் விட வேகமாக

source: Add a Category
ta: ஒரு வகையைச் சேர்க்கவும்

source: Enter the Title of the new Category
ta: புதிய வகையின் தலைப்பை உள்ளிடவும்

source: Category Title
ta: வகை தலைப்பு

source: Add
ta: கூட்டு

source: Try Again
ta: மீண்டும் முயற்சிக்கவும்

source: Parse URL
ta: முகவரி ஐ பாகுபடுத்துங்கள்

source: Select Feed
ta: ஊட்டத்தைத் தேர்ந்தெடுக்கவும்

source: Add Feed
ta: ஊட்டத்தைச் சேர்க்கவும்

source: Error
ta: பிழை

source: Edit the title of the feed and set its category
ta: ஊட்டத்தின் தலைப்பைத் திருத்தி அதன் வகையை அமைக்கவும்

source: Feed Title
ta: தீவன தலைப்பு

source: Category
ta: வகை

source: Add a Feed
ta: ஒரு ஊட்டத்தைச் சேர்க்கவும்

source: Enter the URL of a feed or website
ta: ஒரு ஊட்டம் அல்லது வலைத்தளத்தின் முகவரி ஐ உள்ளிடவும்

source: Website or Feed URL
ta: வலைத்தளம் அல்லது முகவரி க்கு உணவளிக்கவும்

source: Parse
ta: பாகுபடுத்தல்

source: Multiple Feeds Found
ta: பல ஊட்டங்கள் காணப்பட்டன

source: Select one of the listed feeds below
ta: கீழே பட்டியலிடப்பட்ட ஊட்டங்களில் ஒன்றைத் தேர்ந்தெடுக்கவும்

source: Select
ta: தேர்ந்தெடு

source: Add a Tag
ta: ஒரு குறிச்சொல்லைச் சேர்க்கவும்

source: Enter the Title of the new Tag
ta: புதிய குறிச்சொல்லின் தலைப்பை உள்ளிடவும்

source: Tag Title
ta: குறிச்சொல் தலைப்பு

source: Refresh Content
ta: உள்ளடக்கத்தைப் புதுப்பிக்கவும்

source: Search Articles
ta: கட்டுரைகளைத் தேடுங்கள்

source: Mark List as Read
ta: படிக்க மார்க் பட்டியல்

source: All
ta: அனைத்தும்

source: Unread
ta: படிக்காதது

source: Starred
ta: நடித்தார்

source: No Articles
ta: கட்டுரைகள் இல்லை

source: feed
ta: தீவனம்

source: date
ta: திகதி

source: title
ta: தலைப்பு

source: No Summary
ta: சுருக்கம் இல்லை

source: Toggle Starred
ta: டோகல் நடித்தார்

source: unmarked
ta: குறிக்கப்படாதது

source: marked
ta: குறிக்கப்பட்டுள்ளது

source: Toggle Read
ta: படிக்கவும்

source: read
ta: படிக்க

source: unread
ta: படிக்காதது

source: Article Menu
ta: கட்டுரை பட்டியல்

source: Try to Show Full Content
ta: முழு உள்ளடக்கத்தைக் காட்ட முயற்சிக்கவும்

source: Tag Article
ta: குறிச்சொல் கட்டுரை

source: Share To
ta: பகிர்ந்து கொள்ளுங்கள்

source: URL
ta: முகவரி

source: crash
ta: செயலிழப்பு

source: WebKit Crashed
ta: வெப்கிட் செயலிழந்தது

source: empty
ta: காலி

source: Select an Article
ta: ஒரு கட்டுரையைத் தேர்ந்தெடுக்கவும்

source: article
ta: கட்டுரை

source: Discover
ta: கண்டுபிடி

source: Search the feedly.com library
ta: Feedly.com நூலகத்தைத் தேடுங்கள்

source: Search by #topic, Website or RSS Link
ta: #Topic, வலைத்தளம் அல்லது RSS இணைப்பு மூலம் தேடுங்கள்

source: page0
ta: பக்கம் 0

source: Featured Topics
ta: சிறப்பு தலைப்புகள்

source: #News
ta: #நியூச்

source: #Culture
ta: #கலாச்சாரம்

source: #Media
ta: #மீடியா

source: #Open source
ta: #திறந்த மூல

source: page1
ta: பக்கம் 1

source: Search Results
ta: தேடல் முடிவுகள்

source: No Results
ta: முடிவுகள் இல்லை

source: Title
ta: தலைப்பு

source: Description
ta: விவரம்

source: Edit Category
ta: வகையைத் திருத்து

source: Category Name
ta: வகை பெயர்

source: Edit Feed
ta: ஊட்டத்தைத் திருத்து

source: Feed Name
ta: உணவுப் பெயர்

source: Feed URL
ta: முகவரி க்கு உணவளிக்கவும்

source: Content
ta: உள்ளடக்கம்

source: Inline Math delimiter
ta: இன்லைன் கணித டிலிமிட்டர்

source: Scrape Content
ta: உள்ளடக்கத்தைத் துடைக்கவும்

source: Try to fetch content for articles after syncing
ta: ஒத்திசைத்த பிறகு கட்டுரைகளுக்கான உள்ளடக்கத்தைப் பெற முயற்சிக்கவும்

source: Edit Tag
ta: குறிச்சொல்லைத் திருத்து

source: Tag Name
ta: குறிச்சொல் பெயர்

source: Color
ta: நிறம்

source: Open Attachment
ta: திறந்த இணைப்பு

source: Show Attachments
ta: இணைப்புகளைக் காட்டு

source: Error Details
ta: பிழை விவரங்கள்

source: Copy to Clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கவும்

source: Custom API Secret
ta: தனிப்பயன் பநிஇ மறைபொருள்

source: Client ID
ta: வாங்கி ஐடி

source: Client Secret
ta: வாங்கி மறைபொருள்

source: Use Your Own Secret
ta: உங்கள் சொந்த ரகசியத்தைப் பயன்படுத்துங்கள்

source: Use NewsFlash Secret
ta: நியூச்ஃப்ளாச் ரகசியத்தைப் பயன்படுத்தவும்

source: Headline
ta: தலைப்பு

source: Server URL
ta: சேவையக முகவரி

source: Login with
ta: உடன் உள்நுழைக

source: Username / Password
ta: பயனர்பெயர் / கடவுச்சொல்

source: Token
ta: கிள்ளாக்கு

source: Username
ta: பயனர்பெயர்

source: Password
ta: கடவுச்சொல்

source: HTTP Basic Auth
ta: Http அடிப்படை ஏற்பு

source: Log In
ta: புகுபதிகை

source: Service Name
ta: பணி பெயர்

source: Add RSS Service
ta: RSS சேவையைச் சேர்க்கவும்

source: This Device
ta: இந்த சாதனம்

source: Sync Account
ta: கணக்கை ஒத்திசைக்கவும்

source: Reset
ta: மீட்டமை

source: Video
ta: ஒளிதோற்றம்

source: Logout?
ta: புறப்படும்?

source: Logging out leads to all local data being lost
ta: வெளியேறுவது அனைத்து உள்ளக தரவுகளும் இழக்கப்படுவதற்கு வழிவகுக்கிறது

source: Logout
ta: வெளியேற்றம்

source: App
ta: பயன்பாடு

source: Application
ta: பயன்பாடு

source: Run in Background
ta: பின்னணியில் இயக்கவும்

source: Fetch updates while the app is closed
ta: பயன்பாடு மூடப்படும் போது புதுப்பிப்புகளைப் பெறுங்கள்

source: Autostart
ta: ஆட்டோச்டார்ட்

source: Start App on login
ta: உள்நுழைவில் பயன்பாட்டைத் தொடங்கவும்

source: Sync on Startup
ta: தொடக்கத்தில் ஒத்திசைக்கவும்

source: Fetch updates when the App is launched
ta: பயன்பாடு தொடங்கப்படும் போது புதுப்பிப்புகளைப் பெறுங்கள்

source: Sync on Metered Connection
ta: மீட்டர் இணைப்பில் ஒத்திசைக்கவும்

source: Fetch updates on mobile connections in the background
ta: பின்னணியில் மொபைல் இணைப்புகள் குறித்த புதுப்பிப்புகளைப் பெறுங்கள்

source: Update Interval
ta: இடைவெளி புதுப்பிக்கவும்

source: Manual
ta: கையேடு

source: No automatic synchronization
ta: தானியங்கி ஒத்திசைவு இல்லை

source: Sync Every
ta: ஒவ்வொரு ஒத்திசைவு

source: Custom
ta: தனிப்பயன்

source: hh:mm:ss
ta: HH: மிமீ: எச்.எச்

source: Data
ta: தகவல்கள்

source: User Data
ta: பயனர் தரவு

source: Keep Articles
ta: கட்டுரைகளை வைத்திருங்கள்

source: Refers to the time of sync
ta: ஒத்திசைவின் நேரத்தைக் குறிக்கிறது

source: Database
ta: தரவுத்தளம்

source: Delete old data &amp; rewrite file
ta: பழைய தரவை நீக்கு &amp; கோப்பை மீண்டும் எழுதவும்

source: Clean
ta: தூய்மையான

source: Cache
ta: கேச்

source: Webview
ta: வெப்வியூ

source: Clear
ta: தெளிவான

source: Enter New Keybinding
ta: புதிய கீபிண்டிங் உள்ளிடவும்

source: STUFF
ta: பொருள்

source: Press ESC to cancel or Backspace to disable the keybinding
ta: ரத்து செய்ய தப்பி ஐ அழுத்தவும் அல்லது கீபிண்டிங் முடக்க பேக்ச்பேச்

source: SHORTCUT
ta: குறுக்குவழி

source: Set
ta: கணம்

source: Sharing
ta: பகிர்வு

source: Services
ta: சேவைகள்

source: Pocket
ta: பாக்கெட்

source: Instapaper
ta: இன்ச்டாபேப்பர்

source: Twitter
ta: ட்விட்டர்

source: Mastodon
ta: மாச்டோடன்

source: Reddit
ta: ரெடிட்

source: Telegram
ta: தந்தி

source: Clipboard
ta: இடைநிலைப் பலகை

source: Add your own share link. ${url} and ${title} will be replaced with the url and title respectively.
ta: உங்கள் சொந்த பங்கு இணைப்பைச் சேர்க்கவும். $ {url} மற்றும் $ {title} முறையே முகவரி மற்றும் தலைப்புடன் மாற்றப்படும்.

source: Enabled
ta: இயக்கப்பட்டது

source: Name
ta: பெயர்

source: Keybindings
ta: விசைப்பலகைகள்

source: Article List
ta: கட்டுரை பட்டியல்

source: Next Article
ta: அடுத்த கட்டுரை

source: Previous Article
ta: முந்தைய கட்டுரை

source: Open URL
ta: திறந்த முகவரி

source: Copy URL
ta: முகவரி ஐ நகலெடுக்கவும்

source: Feed List
ta: தீவன பட்டியல்

source: Next Item
ta: அடுத்த உருப்படி

source: Previous Item
ta: முந்தைய உருப்படி

source: Expand / Collapse
ta: விரிவாக்கு / சரிவு

source: Mark Selected Read
ta: தேர்வு தேர்ந்தெடுக்கப்பட்ட வாசிப்பு

source: General
ta: பொது

source: Refresh
ta: புதுப்பிப்பு

source: Search
ta: தேடல்

source: Quit
ta: வெளியேறு

source: All Articles
ta: அனைத்து கட்டுரைகளும்

source: Only Unread
ta: படிக்க மட்டுமே

source: Only Starred
ta: மட்டுமே நடித்தார்

source: Article View
ta: கட்டுரை பார்வை

source: Scroll Up
ta: மேலே உருட்டவும்

source: Scroll Down
ta: கீழே உருட்டவும்

source: Scrape Article Content
ta: கட்டுரை உள்ளடக்கத்தைத் துடைக்கவும்

source: Fullscreen Article
ta: முழுத்திரை கட்டுரை

source: Close Article
ta: கட்டுரை மூடு

source: Default
ta: இயல்புநிலை

source: Spring
ta: வேனில்

source: Midnight
ta: நள்ளிரவு

source: Parchment
ta: காகிதத்தோல்

source: Gruvbox
ta: சுரங்க பெட்டி

source: Zorin
ta: சோரின்

source: Views
ta: காட்சிகள்

source: Order
ta: ஒழுங்கு

source: Only Show Relevant Items
ta: தொடர்புடைய உருப்படிகளை மட்டுமே காண்பி

source: Hide feeds and categories without unread/unstarred items
ta: படிக்காத/தடையற்ற உருப்படிகள் இல்லாமல் ஊட்டங்கள் மற்றும் வகைகளை மறைக்கவும்

source: Show Thumbnails
ta: சிறு உருவங்களைக் காட்டு

source: Only if available
ta: கிடைத்தால் மட்டுமே

source: Hide Future Articles
ta: எதிர்கால கட்டுரைகளை மறைக்கவும்

source: Hide Articles dated in the Future
ta: எதிர்காலத்தில் தேதியிட்ட கட்டுரைகளை மறைக்கவும்

source: Theme
ta: கருப்பொருள்

source: Content Width
ta: உள்ளடக்க அகலம்

source: Width of the Article in Characters
ta: கதாபாத்திரங்களில் கட்டுரையின் அகலம்

source: Line Height
ta: வரி உயரம்

source: Line Height in Characters
ta: எழுத்துக்களில் வரி உயரம்

source: Use System Font
ta: கணினி எழுத்துருவைப் பயன்படுத்தவும்

source: Font
ta: எழுத்துரு

source: label
ta: சிட்டை

source: Account
ta: கணக்கு

source: Main Menu
ta: பட்டியல் விளையாடுங்கள்

source: Add Feed/Category/Tag
ta: ஊட்டம்/வகை/குறிச்சொல்லைச் சேர்க்கவும்

source: Subscriptions
ta: சந்தாக்கள்

source: Tags
ta: குறிச்சொற்கள்

source: Set Read
ta: படிக்க

source: Add Tags
ta: குறிச்சொற்களைச் சேர்க்கவும்

source: Type to create a new Tag
ta: புதிய குறிச்சொல்லை உருவாக்க தட்டச்சு செய்க

source: Create Tag
ta: குறிச்சொல்லை உருவாக்கவும்

source: Tag the Article
ta: கட்டுரையை குறிக்கவும்

source: Press enter to assign a Tag or ctrl + enter to create a new Tag
ta: புதிய குறிச்சொல்லை உருவாக்க ஒரு குறிச்சொல் அல்லது கட்டுப்பாடு + Enter ஐ ஒதுக்க Enter ஐ அழுத்தவும்

source: Search and Create Tags
ta: குறிச்சொற்களைத் தேடி உருவாக்கவும்

source: Edit Account
ta: கணக்கைத் திருத்து

source: Failed to sync
ta: ஒத்திசைக்கத் தவறிவிட்டது

source: New Articles
ta: புதிய கட்டுரைகள்

source: There is 1 new article ({} unread)
ta: 1 புதிய கட்டுரை உள்ளது ({} படிக்காதது)

source: There are {} new articles ({} unread)
ta: {} புதிய கட்டுரைகள் உள்ளன ({} படிக்காமல்)

source: Failed to mark article read: '{}'
ta: கட்டுரையைக் குறிக்கத் தவறிவிட்டது: '{}'

source: Failed to star article: '{}'
ta: கட்டுரையைத் தொடங்குவதில் தோல்வி: '{}'

source: Failed to mark all read
ta: எல்லா வாசிப்பையும் குறிக்கத் தவறிவிட்டது

source: Failed to mark feed read
ta: ஊட்ட வாசிப்பைக் குறிக்கத் தவறிவிட்டது

source: Failed to mark category read
ta: வகை வாசிப்பைக் குறிக்கத் தவறிவிட்டது

source: Failed to mark tag read
ta: குறிச்சொல் வாசிப்பைக் குறிக்கத் தவறிவிட்டது

source: Failed to mark multiple article ids read
ta: பல கட்டுரை ஐடிகளைக் குறிக்கத் தவறிவிட்டது

source: Failed to fetch feed
ta: தீவனத்தைப் பெறுவதில் தோல்வி

source: Failed to add feed
ta: ஊட்டத்தைச் சேர்க்கத் தவறிவிட்டது

source: Failed to add category
ta: வகையைச் சேர்க்கத் தவறிவிட்டது

source: Failed to add tag
ta: குறிச்சொல்லைச் சேர்க்கத் தவறிவிட்டது

source: Failed to rename feed
ta: தீவனத்தை மறுபெயரிடுவதில் தோல்வி

source: Failed to rename category
ta: வகையை மறுபெயரிடுவதில் தோல்வி

source: Failed to tag article
ta: கட்டுரையைக் குறிக்கத் தவறிவிட்டது

source: Failed to set feed list order to manual
ta: தீவன பட்டியல் வரிசையை கையேடுக்கு அமைக்கத் தவறிவிட்டது

source: Failed to move feed
ta: ஊட்டத்தை நகர்த்துவதில் தோல்வி

source: Failed to move category
ta: வகையை நகர்த்துவதில் தோல்வி

source: Failed to delete feed
ta: தீவனத்தை நீக்கத் தவறிவிட்டது

source: Failed to delete category
ta: வகையை நீக்குவதில் தோல்வி

source: Failed to delete tag
ta: குறிச்சொல்லை நீக்குவதில் தோல்வி

source: Failed to untag article
ta: கட்டுரையை அவிழ்ப்பதில் தோல்வி

source: _Save
ta: _சேவ்

source: Export Article
ta: ஏற்றுமதி கட்டுரை

source: No file set: {}
ta: கோப்பு தொகுப்பு இல்லை: {}

source: Failed to download images
ta: படங்களை பதிவிறக்குவதில் தோல்வி

source: Import OPML
ta: OPML ஐ இறக்குமதி செய்க

source: Failed read OPML string: {}
ta: தோல்வியுற்றது OPML சரம்: {}

source: Failed to import OPML
ta: OPML ஐ இறக்குமதி செய்யத் தவறிவிட்டது

source: Export OPML
ta: OPML ஏற்றுமதி

source: No file set.
ta: கோப்பு தொகுப்பு இல்லை.

source: Failed to get OPML data
ta: OPML தரவைப் பெறுவதில் தோல்வி

source: Failed to write OPML data to disc
ta: OPML தரவை வட்டுக்கு எழுதுவதில் தோல்வி

source: Failed to parse OPML data for formatting
ta: வடிவமைப்பிற்காக OPML தரவை அலசத் தவறிவிட்டது

source: Save Image
ta: படத்தை சேமிக்கவும்

source: No file set
ta: கோப்பு தொகுப்பு இல்லை

source: Failed to download image {}
ta: படத்தைப் பதிவிறக்குவதில் தோல்வி {}

source: NewsFlash is offline
ta: நியூச்ஃப்ளாச் ஆஃப்லைனில் உள்ளது

source: NewsFlash is online
ta: நியூச்ஃப்ளாச் ஆன்லைனில் உள்ளது

source: Failed to set offline
ta: ஆஃப்லைனில் அமைக்கத் தவறிவிட்டது

source: Failed to apply changes made while offline
ta: இணைப்பில்லாத போது செய்யப்பட்ட மாற்றங்களைப் பயன்படுத்துவதில் தோல்வி

source: Failed open URL: {}
ta: தோல்வியுற்ற திறந்த URL: {}

source: None
ta: எதுவுமில்லை

source: Watch Youtube Video
ta: யூடியூப் வீடியோவைப் பாருங்கள்

source: Open Attached Image
ta: இணைக்கப்பட்ட படத்தைத் திறக்கவும்

source: Open Attached Video
ta: இணைக்கப்பட்ட வீடியோவைத் திறக்கவும்

source: Failed to decode image '{}'
ta: படத்தை டிகோட் செய்வதில் தோல்வி '{}'

source: Failed to download image
ta: படத்தைப் பதிவிறக்குவதில் தோல்வி

source: Could not decode image
ta: படத்தை டிகோட் செய்ய முடியவில்லை

source: Failed to reset account
ta: கணக்கை மீட்டமைப்பதில் தோல்வி

source: details
ta: விவரங்கள்

source: Failed to add feed: No valid url
ta: ஊட்டத்தைச் சேர்க்கத் தவறிவிட்டது: செல்லுபடியாகும் முகவரி இல்லை

source: Not a valid URL
ta: செல்லுபடியாகும் முகவரி அல்ல

source: No Feed found
ta: எந்த ஊட்டமும் கிடைக்கவில்லை

source: Can't parse Feed
ta: தீவனத்தை அலச முடியாது

source: Toggle Star
ta: நட்சத்திரத்தை மாற்றவும்

source: Open in Browser
ta: உலாவியில் திற

source: No articles that fit "{}"
ta: "{}" க்கு பொருந்தக்கூடிய கட்டுரைகள் இல்லை

source: No unread articles that fit "{}"
ta: "{}" க்கு பொருந்தக்கூடிய படிக்காத கட்டுரைகள் எதுவும் இல்லை

source: No Unread Articles
ta: படிக்காத கட்டுரைகள் இல்லை

source: No starred articles that fit "{}"
ta: "{}" க்கு பொருந்தக்கூடிய நட்சத்திர கட்டுரைகள் எதுவும் இல்லை

source: No Starred Articles
ta: நட்சத்திரமிட்ட கட்டுரைகள் இல்லை

source: No articles that fit "{}" in {} "{}"
ta: {} "{}" இல் "{}" பொருந்தக்கூடிய கட்டுரைகள் இல்லை

source: No articles in {} "{}"
ta: }} "{}" இல் கட்டுரைகள் இல்லை

source: No unread articles that fit "{}" in {} "{}"
ta: {} "{}" இல் "{}" க்கு பொருந்தக்கூடிய படிக்காத கட்டுரைகள் இல்லை

source: No unread articles in {} "{}"
ta: }} "{}" இல் படிக்காத கட்டுரைகள் இல்லை

source: No starred articles that fit "{}" in {} "{}"
ta: {} "{}" இல் "{}" க்கு பொருந்தக்கூடிய நட்சத்திர கட்டுரைகள் இல்லை

source: No starred articles in {} "{}"
ta: }} "{}" இல் நட்சத்திரமிட்ட கட்டுரைகள் இல்லை

source: No articles that fit "{}" in tag "{}"
ta: குறிச்சொல்லில் "{}" பொருந்தக்கூடிய கட்டுரைகள் இல்லை "{}"

source: No articles in tag "{}"
ta: குறிச்சொல்லில் "{}"

source: No unread articles that fit "{}" in tag "{}"
ta: குறிச்சொல்லில் "{}" பொருந்தக்கூடிய படிக்காத கட்டுரைகள் இல்லை "{}"

source: No unread articles in tag "{}"
ta: குறிச்சொல்லில் படிக்காத கட்டுரைகள் இல்லை "{}"

source: No starred articles that fit "{}" in tag "{}"
ta: குறிச்சொல்லில் "{}" பொருந்தக்கூடிய நட்சத்திர கட்டுரைகள் இல்லை "{}"

source: No starred articles in tag "{}"
ta: குறிச்சொல் "{}"

source: Toggle Fullscreen
ta: மாற்று முழுத்திரை

source: Deleted Category '{}'
ta: நீக்கப்பட்ட வகை '{}'

source: Deleted Feed '{}'
ta: நீக்கப்பட்ட ஊட்டம் '{}'

source: Deleted Tag '{}'
ta: நீக்கப்பட்ட குறிச்சொல் '{}'

source: undo
ta: செயல்தவிர்

source: Mark all read
ta: எல்லா வாசிப்பையும் குறிக்கவும்

source: Failed to set service logo
ta: பணி லோகோவை அமைப்பதில் தோல்வி

source: Failed to update sidebar: '{}'
ta: பக்கப்பட்டியைப் புதுப்பிப்பதில் தோல்வி: '{}'

source: Keyboard Shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

source: About NewsFlash
ta: நியூச்ஃப்ளாச் பற்றி

source: Discover Feeds
ta: ஊட்டங்களைக் கண்டறியவும்

source: Feed
ta: தீவனம்

source: Tag
ta: குறிச்சொல்

source: Log into {}
ta: {} இல் உள்நுழைக

source: Unauthorized
ta: அங்கீகரிக்கப்படாதது

source: No valid CA certificate available
ta: செல்லுபடியாகும் CA சான்றிதழ் எதுவும் கிடைக்கவில்லை

source: ignore future TLS errors
ta: எதிர்கால TLS பிழைகளை புறக்கணிக்கவும்

source: Network Error
ta: பிணைய பிழை

source: Could not log in
ta: உள்நுழைய முடியவில்லை

source: Unknown error
ta: தெரியாத பிழை

source: API Limit Reached
ta: பநிஇ வரம்பு அடைந்தது

source: Failed to log in
ta: உள்நுழையத் தவறிவிட்டது

source: Failed to set setting 'keep running'
ta: அமைப்பை அமைப்பதில் தோல்வி 'தொடர்ந்து இயங்குகிறது'

source: Failed to set setting 'sync on startup'
ta: 'தொடக்கத்தில் ஒத்திசைவு' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'sync on metered'
ta: 'மீட்டர்' என்ற அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'limit articles duration'
ta: 'வரம்பு கட்டுரைகளின் காலம்' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'sync interval'
ta: 'ஒத்திசைவு இடைவெளி' அமைப்பை அமைப்பதில் தோல்வி

source: Disable Keybinding
ta: கீபிண்டிங் முடக்கு

source: Illegal Keybinding
ta: சட்டவிரோத விசைப்பிடித்தல்

source: Failed to set setting 'pocket enabled'
ta: 'பாக்கெட் இயக்கப்பட்ட' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'instapaper enabled'
ta: 'இன்ச்டாபேப்பர் இயக்கப்பட்ட' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'twitter enabled'
ta: 'ட்விட்டர் இயக்கப்பட்ட' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'mastodon enabled'
ta: அமைப்பை அமைப்பதில் தோல்வி 'மாச்டோடன் இயக்கப்பட்டது'

source: Failed to set setting 'reddit enabled'
ta: 'ரெடிட் செயல்படுத்தப்பட்ட' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'telegram enabled'
ta: 'டெலிகிராம் இயக்கப்பட்ட' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'clipboard enabled'
ta: 'இடைநிலைப்பலகை இயக்கப்பட்ட' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'custom share enabled'
ta: 'தனிப்பயன் பங்கு இயக்கப்பட்டது' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'custom share name'
ta: 'தனிப்பயன் பகிர்வு பெயர்' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'custom share url'
ta: 'தனிப்பயன் பங்கு முகவரி' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to write keybinding
ta: கீபிங் எழுதத் தவறிவிட்டது

source: Newest First
ta: புதிய முதல்

source: Oldest First
ta: முதலில் பழமையானது

source: Failed to set setting 'show relevant feeds'
ta: அமைப்பை அமைப்பதில் தோல்வி 'தொடர்புடைய ஊட்டங்களைக் காட்டு'

source: Failed to set setting 'article order'
ta: 'கட்டுரை ஒழுங்கு' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'show thumbnails'
ta: அமைப்பை அமைப்பதில் தோல்வி 'சிறுபடங்களைக் காட்டு'

source: Failed to set article theme
ta: கட்டுரை கருப்பொருளை அமைப்பதில் தோல்வி

source: Failed to set setting 'content width'
ta: 'உள்ளடக்க அகலம்' அமைப்பதில் தோல்வி

source: Failed to set setting 'line height'
ta: 'வரி உயரம்' அமைப்பதில் தோல்வி

source: Failed to set setting 'article font'
ta: 'கட்டுரை எழுத்துரு' அமைப்பை அமைப்பதில் தோல்வி

source: Failed to set setting 'use system font'
ta: அமைப்பை அமைப்பதில் தோல்வி 'கணினி எழுத்துருவைப் பயன்படுத்துங்கள்'

source: Alphabetical
ta: அகரவரிசை

source: 15 Minutes
ta: 15 நிமிடங்கள்

source: 30 Minutes
ta: 30 நிமிடங்கள்

source: 1 Hour
ta: 1 மணி நேரம்

source: 2 Hours
ta: 2 மணி நேரம்

source: Forever
ta: என்றென்றும்

source: One Year
ta: ஒரு வருடம்

source: 6 Months
ta: 6 மாதங்கள்

source: One Month
ta: ஒரு மாதம்

source: One Week
ta: ஒரு வாரம்

source: No article selected
ta: எந்த கட்டுரையும் தேர்ந்தெடுக்கப்படவில்லை

source: Article does not have URL
ta: கட்டுரையில் முகவரி இல்லை

source: Article shared with {}
ta: கட்டுரை {} உடன் பகிரப்பட்டது

source: Edit
ta: தொகு

source: Delete
ta: நீக்கு

source: Today
ta: இன்று

source: Yesterday
ta: நேற்று
