Repository: 247i/TACETr
Catalog: உரை/தானி/next-player-android-strings-core-*.po
Languages: ta

# app_name
source: Next Player
ta: அடுத்த வீரர்

# about_description
source: Version, credits
ta: பதிப்பு, வரவு

# about_name
source: About
ta: பற்றி

# appearance_description
source: Adjust the app to your liking
ta: உங்கள் விருப்பப்படி பயன்பாட்டை சரிசெய்யவும்

# appearance_name
source: Appearance
ta: தோற்றம்

source: Ascending
ta: ஏறுவரிசை

source: Cancel
ta: ரத்துசெய்

source: Descending
ta: இறங்குவரிசை

source: Disable
ta: முடக்கு

source: Done
ta: முடிந்தது

# double_tap
source: Double tap gesture
ta: இரட்டை குழாய் சைகை

# double_tap_description
source: Select double tap gesture action
ta: இரட்டை தட்டு சைகை செயலைத் தேர்ந்தெடுக்கவும்

# error_playing_video
source: Error: Can't play video
ta: பிழை: காணொலியை இயக்க முடியவில்லை

# fast_seek
source: Fast seeking
ta: வேகமாக தேடுவது

# fast_seek_description
source: Seek to nearest key frame instead of exact one.
ta: சரியான ஒன்றுக்கு பதிலாக அருகிலுள்ள விசை சட்டகத்தைத் தேடுங்கள்.

source: Grant Permission
ta: அனுமதி வழங்கவும்

# group_videos
source: Group videos by folder
ta: கோப்புறை மூலம் குழு வீடியோக்கள்

source: Duration
ta: கால அளவு

source: Location
ta: இடம்

source: Menu
ta: பட்டியல்

source: Navigate up
ta: மேலே செல்லவும்

source: No videos found
ta: வீடியோக்கள் எதுவும் கிடைக்கவில்லை

source: Open Settings
ta: திறந்த அமைப்புகள்

# permission_info
source: The Next Player app needs "%1$s" permission to access and play media. Without it, media access and playback won't work. To use the app fully, grant the permission.
ta: அடுத்த பிளேயர் பயன்பாட்டிற்கு மீடியாவை அணுகவும் விளையாடவும் "%1$s" இசைவு தேவை. இது இல்லாமல், ஊடக அணுகல் மற்றும் பின்னணி வேலை செய்யாது. பயன்பாட்டை முழுமையாகப் பயன்படுத்த, இசைவு வழங்கவும்.

source: Permission Not Granted
ta: அனுமதி வழங்கப்படவில்லை

source: Permission Request
ta: அனுமதி கோரிக்கை

# permission_settings
source: The Next Player app needs "%1$s" permission to access and play media. Without it, media access and playback won't work. To use the app fully, grant the permission from settings since it was permanently denied.
ta: அடுத்த பிளேயர் பயன்பாட்டிற்கு மீடியாவை அணுகவும் விளையாடவும் "%1$s" இசைவு தேவை. இது இல்லாமல், ஊடக அணுகல் மற்றும் பின்னணி வேலை செய்யாது. பயன்பாட்டை முழுமையாகப் பயன்படுத்த, அமைப்புகளின் இசைவு நிரந்தரமாக மறுக்கப்பட்டதால் அதை வழங்கவும்.

# player_controls_exit
source: Navigate up
ta: மேலே செல்லவும்

# player_controls_next
source: Player next
ta: அடுத்து வீரர்

# player_controls_play_pause
source: Player play pause
ta: பிளேயர் பிளே இடைநிறுத்தம்

# player_controls_previous
source: Player previous
ta: முந்தைய வீரர்

# player_controls_progress
source: Player progress bar
ta: பிளேயர் முன்னேற்றப் பட்டி

# player_description
source: Player appearance, playback controls
ta: பிளேயர் தோற்றம், பின்னணி கட்டுப்பாடுகள்

# player_name
source: Player
ta: வீரர்

source: Quick Settings
ta: விரைவான அமைப்புகள்

# autoplay_settings
source: Autoplay
ta: ஆட்டோபிளே

# autoplay_settings_description
source: Automatically play the next video in the current folder
ta: தற்போதைய கோப்புறையில் அடுத்த வீடியோவை தானாக இயக்கவும்

# pip_settings
source: Picture in Picture Mode
ta: பட பயன்முறையில் படம்

# pip_settings_description
source: Automatically switch to miniature player when tapping Home Button
ta: முகப்பு பொத்தானைத் தட்டும்போது தானாகவே மினியேச்சர் பிளேயருக்கு மாறவும்

source: Remember brightness level
ta: ஒளி அளவை நினைவில் கொள்ளுங்கள்

# remember_brightness_level_description
source: Remember brightness level between playback sessions
ta: பிளேபேக் அமர்வுகளுக்கு இடையில் ஒளி அளவை நினைவில் கொள்ளுங்கள்

source: Remember selections
ta: தேர்வுகளை நினைவில் கொள்க

# remember_selections_description
source: Remember selections for each file like audio track, subtitle track, etc
ta: ஆடியோ டிராக், வசன கண்காணிப்பு டிராக் போன்ற ஒவ்வொரு கோப்பிற்கும் தேர்வுகளை நினைவில் கொள்க

source: Resume
ta: மீண்டும் தொடங்குங்கள்

# resume_description
source: Select whether to resume played videos from the point where you stopped
ta: நீங்கள் நிறுத்திய இடத்திலிருந்து மீண்டும் விளையாடிய வீடியோக்களை மீண்டும் தொடங்கலாமா என்பதைத் தேர்ந்தெடுக்கவும்

source: Seek gesture
ta: சைகையைத் தேடுங்கள்

# seek_gesture_description
source: Swipe horizontally to seek forwards or backwards
ta: முன்னோக்கி அல்லது பின்னோக்கி தேட கிடைமட்டமாக ச்வைப் செய்யவும்

source: Select audio track
ta: ஆடியோ டிராக்கைத் தேர்ந்தெடுக்கவும்

source: Select subtitle track
ta: வசனத் தடத்தைத் தேர்ந்தெடுக்கவும்

source: Settings
ta: அமைப்புகள்

source: Size
ta: உருவளவு

source: Sort
ta: வகைப்படுத்து

source: Swipe gesture
ta: சைகை ச்வைப்

# swipe_gesture_description
source: Swipe vertically to adjust the brightness and volume
ta: பிரகாசத்தையும் அளவையும் சரிசெய்ய செங்குத்தாக ச்வைப் செய்யவும்

source: Title
ta: தலைப்பு

# title_activity_player
source: Next Player Activity
ta: அடுத்த பிளேயர் செயல்பாடு

# unknown_error
source: An unknown error has occurred
ta: தெரியாத பிழை ஏற்பட்டது

source: Playback
ta: பின்னணி

# interface_name
source: Interface
ta: இடைமுகம்

source: A-Z
ta: அ-ஒள

source: Z-A
ta: ஒள-அ

source: Shortest
ta: குறுகிய

source: Longest
ta: நீளமானது

source: Smallest
ta: சிறியது

source: Largest
ta: பெரிய

source: Dark theme
ta: இருள் திணை

source: Video zoom
ta: வீடியோ சூம்

# dynamic_theme
source: Dynamic color theme
ta: மாறும் வண்ண கருப்பொருள்

# dynamic_theme_description
source: Apply colors from system wallpaper to the application theme
ta: கணினி வால்பேப்பரிலிருந்து பயன்பாட்டு கருப்பொருளுக்கு வண்ணங்களைப் பயன்படுத்துங்கள்

# controls_lock
source: Lock controls
ta: பூட்டு கட்டுப்பாடுகள்

# controls_unlock
source: Unlock controls
ta: கட்டுப்பாடுகள் திறக்க

source: Select playback speed
ta: பிளேபேக் வேகத்தைத் தேர்ந்தெடுக்கவும்

source: Audio
ta: கேட்பொலி

# preferred_audio_lang
source: Preferred audio language
ta: விருப்பமான கேட்பொலி மொழி

# preferred_audio_lang_description
source: Language of the audio track you want to use by default
ta: நீங்கள் இயல்பாக பயன்படுத்த விரும்பும் கேட்போலித் தடத்தின் மொழி

source: Subtitle
ta: துணை மொழி

# preferred_subtitle_lang
source: Preferred subtitle language
ta: விருப்பமான துணை மொழி

# preferred_subtitle_lang_description
source: Language of the subtitle track you want to use by default
ta: நீங்கள் இயல்பாக பயன்படுத்த விரும்பும் துணை வரியின் மொழி

source: System Default
ta: கணினி இயல்புநிலை

source: Off
ta: அணை

source: On
ta: ஆன்

source: Play/Pause
ta: விளையாடு/இடைநிறுத்தம்

# ff_rewind
source: Fast forward/Rewind
ta: வேகமாக முன்னோக்கி/முன்னாடி

# play_pause_ff_rewind
source: Play/Pause and Fast forward/Rewind
ta: விளையாடு/இடைநிறுத்தம் மற்றும் வேகமாக முன்னோக்கி/முன்னாடி

source: None
ta: எதுவுமில்லை

source: Auto
ta: தானி

source: Enable
ta: இயக்கு

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Scan
ta: ச்கேன்

source: Media library
ta: ஊடக நூலகம்

source: Force rescan storage
ta: கட்டாய சேமிப்பகத்தை கட்டாயப்படுத்துங்கள்

# force_rescan_storage_desc
source: Caution: Initiating a full storage rescan may cause increased resource usage on your device
ta: எச்சரிக்கை: முழு சேமிப்பக மீட்டமைப்பைத் தொடங்குவது உங்கள் சாதனத்தில் அதிகரித்த வள பயன்பாட்டை ஏற்படுத்தக்கூடும்

# media_library_description
source: Scan and manage media library
ta: மீடியா நூலகத்தை ச்கேன் செய்து நிர்வகிக்கவும்

source: Scanning storage…
ta: சேமிப்பக ச்கேனிங்…

source: Manage folders
ta: கோப்புறைகளை நிர்வகிக்கவும்

# manage_folders_desc
source: Select folders to be excluded in the media library
ta: ஊடக நூலகத்தில் விலக்கப்பட வேண்டிய கோப்புறைகளைத் தேர்ந்தெடுக்கவும்

source: Video
ta: காணொளி

source: Videos
ta: காணொளிகள்

source: Screen Rotation
ta: திரை சுழற்சி

source: Player screen orientation
ta: பிளேயர் திரை நோக்குநிலை

# automatic
source: Automatic (sensor)
ta: தானியங்கி (சென்சார்)

source: Landscape
ta: நிலப்பரப்பு

source: Landscape reverse
ta: இயற்கை தலைகீழ்

# landscape_auto
source: Landscape (sensor)
ta: நிலப்பரப்பு (சென்சார்)

source: Portrait
ta: உருவப்படம்

source: Video Orientation
ta: வீடியோ நோக்குநிலை

source: Newest
ta: புதியது

source: Oldest
ta: பழமையானது

source: Date
ta: தேதி

source: Default playback speed
ta: இயல்புநிலை பின்னணி விரைவு

source: Enter a network URL:
ta: பிணைய முகவரி ஐ உள்ளிடவும்:

source: Network Stream
ta: பிணையம் ச்ட்ரீம்

# play_file
source: Open video file to play
ta: விளையாட வீடியோ கோப்பைத் திறக்கவும்

# play_url
source: Enter video url to play
ta: விளையாட வீடியோ முகவரி ஐ உள்ளிடவும்

# default_name
source: Default
ta: இயல்புநிலை

source: Monospace
ta: மினிவேன்

source: Sans Serif
ta: செரிஃப் இல்லாமல்

source: Serif
ta: செரிஃப்

source: Subtitle font
ta: துனைமொழி எழுத்துரு

# subtitle_text_bold
source: Bold subtitle text
ta: தைரியமான வசன உரை

# subtitle_text_bold_desc
source: Use bold text for subtitle
ta: வசனத்திற்கு தைரியமான உரையைப் பயன்படுத்தவும்

source: Subtitle text size
ta: வசன உரை அளவு

# subtitle_desc
source: Subtitle appearance, playback options
ta: வசன தோற்றம், பின்னணி விருப்பங்கள்

source: Subtitle background
ta: வசன பின்னணி

# subtitle_background_desc
source: Enable background to subtitle text
ta: வசன வரிக்கு பின்னணியை இயக்கவும்

source: Decoder
ta: டிகோடர்

# decoder_desc
source: Decoder priority, playback decoder options
ta: டிகோடர் முன்னுரிமை, பின்னணி டிகோடர் விருப்பங்கள்

# video_software_decoders
source: Software video decoders
ta: மென்பொருள் வீடியோ டிகோடர்கள்

# video_software_decoders_desc
source: Use application software video decoders (experimental)
ta: பயன்பாட்டு மென்பொருள் வீடியோ டிகோடர்களைப் பயன்படுத்தவும் (சோதனை)

source: Decoder priority
ta: டிகோடர் முன்னுரிமை

source: Prefer device decoders
ta: சாதன டிகோடர்களை விரும்புங்கள்

source: Prefer app decoders
ta: பயன்பாட்டு டிகோடர்களை விரும்புங்கள்

source: Device decoders only
ta: சாதன டிகோடர்கள் மட்டுமே

source: Embedded styles
ta: உட்பொதிக்கப்பட்ட பாணிகள்

# embedded_styles_desc
source: Apply the embedded styles that are present in subtitle files, such as ASS and so on
ta: கழுதை போன்ற வசன கோப்புகளில் இருக்கும் உட்பொதிக்கப்பட்ட பாணிகளைப் பயன்படுத்துங்கள்

source: Controller timeout
ta: கட்டுப்படுத்தி நேரம் முடிந்தது

source: Seek increment
ta: அதிகரிப்பு தேடுங்கள்

# seconds
source: %1$s seconds
ta: %1$s வினாடிகள்

source: Share
ta: பங்கு

source: Delete
ta: நீக்கு

# delete_file
source: The following file will be deleted permanently
ta: பின்வரும் கோப்பு நிரந்தரமாக நீக்கப்படும்

source: Subtitle text encoding
ta: வசன உரை குறியாக்கம்

# delete_folder
source: All video files in the following folder will be deleted permanently.
ta: பின்வரும் கோப்புறையில் உள்ள அனைத்து வீடியோ கோப்புகளும் நிரந்தரமாக நீக்கப்படும்.

# fast_playback_speed
source: %.1fx speed
ta: %.1fx விரைவு

source: Long press gesture
ta: நீண்ட செய்தித் தாள் சைகை

# long_press_gesture_desc
source: Long press to play at %.1fx speed
ta: %.1fx வேகத்தில் விளையாட நீண்ட அழுத்தவும்

source: Best fit
ta: சிறந்த பொருத்தம்

source: Stretch
ta: நீட்டிக்க

source: Crop
ta: பயிர்

source: Zoom gesture
ta: பெரிதாக்க சைகை

# zoom_gesture_description
source: Pinch to zoom the video
ta: வீடியோவை பெரிதாக்க பிஞ்ச்

source: High contrast dark theme
ta: உயர் மாறுபட்ட இருண்ட கருப்பொருள்

# high_contrast_dark_theme_desc
source: Use pure black background for dark theme
ta: இருண்ட கருப்பொருளுக்கு தூய கருப்பு பின்னணியைப் பயன்படுத்தவும்

# audio_desc
source: Audio playback options
ta: ஆடியோ பிளேபேக் விருப்பங்கள்

# pause_on_headset_disconnect
source: Pause on disconnect
ta: துண்டிக்க இடைநிறுத்தம்

# pause_on_headset_disconnect_desc
source: Pause playback when headset disconnected from the device
ta: சாதனத்திலிருந்து எட்செட் துண்டிக்கும்போது பின்னணி நிறுத்து

source: System volume panel
ta: கணினி தொகுதி குழு

# system_volume_panel_desc
source: Show system volume panel while adjusting volume with headset on
ta: எட்செட் ஆன் மூலம் அளவை சரிசெய்யும்போது கணினி தொகுதி பேனலைக் காட்டு

source: System caption style
ta: கணினி தலைப்பு பாணி

# system_caption_style_desc
source: Click to open system captioning preferences
ta: கணினி தலைப்பு விருப்பங்களை திறக்க சொடுக்கு செய்க

source: Fields
ta: புலங்கள்

source: Extension
ta: நீட்டிப்பு

source: Path
ta: பாதை

source: Resolution
ta: தெளிவுத்திறன்

source: Thumbnail
ta: சிறுபடம்

source: Require audio focus
ta: ஆடியோ கவனம் தேவை

# require_audio_focus_desc
source: Pause other players while this player is playing videos, and vice versa.
ta: இந்த வீரர் வீடியோக்களை விளையாடும்போது மற்ற வீரர்களை இடைநிறுத்துங்கள், நேர்மாறாகவும்.

source: File
ta: கோப்பு

source: Format
ta: வடிவம்

source: Video Track
ta: வீடியோ டிராக்

source: Audio Track
ta: ஆடியோ டிராக்

source: Subtitle Track
ta: வசன கண்காணிப்பு

source: Codec
ta: புரிப்பு

source: Sample rate
ta: மாதிரி வீதம்

source: Sample format
ta: மாதிரி வடிவம்

source: Bitrate
ta: பிட்ரேட்

source: Channels
ta: சேனல்கள்

source: Language
ta: மொழி

source: Frame rate
ta: பிரேம் வீதம்

source: Okay
ta: சரி

source: Properties
ta: பண்புகள்

source: Volume boost
ta: தொகுதி ஊக்க

# volume_boost_desc
source: Boost audio volume up to 200%
ta: ஆடியோ அளவை 200% வரை அதிகரிக்கும்

# open_subtitle
source: Open local subtitle
ta: உள்ளக வசனத் திறந்த

# no_subtitle_tracks_found
source: Subtitle tracks for this video are either unavailable or not supported.
ta: இந்த வீடியோவிற்கான வசனத் தடங்கள் கிடைக்கவில்லை அல்லது ஆதரிக்கப்படவில்லை.

# no_audio_tracks_found
source: Audio tracks for this video are either unavailable or not supported.
ta: இந்த வீடியோவுக்கான ஆடியோ தடங்கள் கிடைக்கவில்லை அல்லது ஆதரிக்கப்படவில்லை.

source: Rename
ta: மறுபெயரிடு

source: Rename to
ta: மறுபெயரிடுங்கள்

source: Floating play button
ta: மிதக்கும் விளையாட்டு பொத்தான்

# floating_play_button_desc
source: Show floating button to play last played media.
ta: கடைசியாக விளையாடிய மீடியாவை விளையாட மிதக்கும் பொத்தானைக் காட்டு.

source: Mark last played media
ta: மார்க் கடைசியாக ஊடகங்களில் நடித்தார்

# mark_last_played_media_desc
source: Mark last played media in home and in each folder
ta: மார்க் கடைசியாக வீட்டிலும் ஒவ்வொரு கோப்புறையிலும் ஊடகங்களில் விளையாடினார்

source: Open local video
ta: உள்ளக வீடியோவைத் திறக்கவும்

source: Open network stream
ta: பிணையம் ச்ட்ரீம் திறந்த

source: Exit
ta: வெளியேறு

source: Play next video
ta: அடுத்த வீடியோவை இயக்கவும்

source: Skip silence
ta: ம .னத்தைத் தவிர்க்கவும்

source: Folder
ta: கோப்புறை

source: Folders
ta: கோப்புறைகள்

source: Tree
ta: மரம்

source: Played progress
ta: முன்னேற்றம் விளையாடியது

source: Media view mode
ta: மீடியா பார்வை பயன்முறை

# enable_pip_from_settings
source: Picture-in-Picture is disabled. Enable it in Settings to use this feature.
ta: படம்-படம் முடக்கப்பட்டுள்ளது. இந்த அம்சத்தைப் பயன்படுத்த அமைப்புகளில் அதை இயக்கவும்.

# control_buttons_alignment_left
source: Left
ta: இடது

# control_buttons_alignment_right
source: Right
ta: வலது

source: Control buttons alignment
ta: கட்டுப்பாட்டு பொத்தான்கள் சீரமைப்பு

source: Stop player session
ta: பிளேயர் அமர்வை நிறுத்துங்கள்

source: Background play
ta: பின்னணி நாடகம்

# background_play_description
source: Play in background when tapped on home or screen is locked.
ta: வீட்டில் அல்லது திரையில் தட்டும்போது பின்னணியில் விளையாடுங்கள்.

source: Loop mode
ta: லூப் பயன்முறை

# loop_mode_off
source: Loop: Off
ta: லூப்: ஆஃப்

# loop_mode_one
source: Loop: One
ta: லூப்: ஒன்று

# loop_mode_all
source: Loop: All
ta: லூப்: அனைத்தும்

# app_developer
source: anilbeesetti
ta: அனில்பெசெட்

# by
source: by %1$s
ta: %1$s மூலம்

source: Libraries
ta: நூலகங்கள்

source: Github
ta: கிரப்

source: Donate
ta: நன்கொடை

# error_opening_link
source: No app found to handle this link
ta: இந்த இணைப்பைக் கையாள எந்த பயன்பாடும் கிடைக்கவில்லை

# support_the_developer_on
source: Support the developer on %1$s
ta: டெவலப்பரை %1$s இல் ஆதரிக்கவும்

source: Ko-fi
ta: காபி

source: PayPal
ta: பேபால்

source: UPI
ta: யுபிஐ

source: Media Layout
ta: மீடியா தளவமைப்பு

source: List
ta: பட்டியல்

source: Grid
ta: வலைவாய்
