Repository: 247i/TACETr
Catalog: உரை/தானி/nextcloud-cookbook-fastlane-*.po
Languages: ta

# title.txt:1
source: Nextcloud Cookbook
ta: நெக்ச்ட் முகில் சமையல் நூல்

# short_description.txt:1
source: View all your recipes stored in your Nextcloud instance.
ta: உங்கள் நெக்ச்ட் முகில் நிகழ்வில் சேமிக்கப்பட்டுள்ள உங்கள் எல்லா சமையல் குறிப்புகளையும் காண்க.

# full_description.txt:1
source: View all your recipes stored in your Nextcloud instance. The source code can be found on GitHub at https://github.com/lneugebauer/nextcloud-cookbook/. Report bugs, enhancement proposals and feature requests there. Current: - List all recipes - List all recipes by category - View recipe - Stay awake on recipe screen - Settings - Edit recipe - Add recipe - Import recipe via URL Planned: - Offline usage - Single sign-on through the Nextcloud Files app - Login via QR-code A publicly accessible Nextcloud server with the latest cookbook app is required to use this app.
ta: உங்கள் நெக்ச்ட் முகில் நிகழ்வில் சேமிக்கப்பட்டுள்ள உங்கள் எல்லா சமையல் குறிப்புகளையும் காண்க. மூலக் குறியீட்டை github இல் https://github.com/lneugebauer/nextcloud-cookbook/ இல் காணலாம். பிழைகள், மேம்பாட்டு திட்டங்கள் மற்றும் அம்ச கோரிக்கைகளை அங்கு புகாரளிக்கவும். நடப்பு: - அனைத்து சமையல் குறிப்புகளையும் பட்டியலிடுங்கள் - அனைத்து சமையல் குறிப்புகளையும் வகை அடிப்படையில் பட்டியலிடுங்கள் - செய்முறையைக் காண்க - செய்முறை திரையில் விழித்திருங்கள் - அமைப்புகள் - செய்முறையைத் திருத்தவும் - செய்முறையைச் சேர்க்கவும் - முகவரி வழியாக செய்முறையை இறக்குமதி செய்யுங்கள் திட்டமிடப்பட்டது: - இணைப்பில்லாத பயன்பாடு - நெக்ச்ட் முகில் கோப்புகள் பயன்பாட்டின் மூலம் ஒற்றை உள்நுழைவு - QR-குறியீடு வழியாக உள்நுழைக இந்த பயன்பாட்டைப் பயன்படுத்த அண்மைக் கால சமையல் புத்தக பயன்பாட்டுடன் பொதுவில் அணுகக்கூடிய நெக்ச்ட் முகில் சேவையகம் தேவை.

# changelogs/14.txt:1
source: - Added monochrome icon - Improved recipe share text - Fixed login issue
ta: - மோனோக்ரோம் படவுரு சேர்க்கப்பட்டது - மேம்படுத்தப்பட்ட செய்முறை பங்கு உரை - நிலையான உள்நுழைவு சிக்கல்

# changelogs/15.txt:1
source: - Added cook time to create and edit form - Added Czech translations – Thanks @ceskyDJ - Added missing login screen translations
ta: - படிவத்தை உருவாக்க மற்றும் திருத்த சமையல்காரர் நேரம் சேர்க்கப்பட்டது - செக் மொழிபெயர்ப்புகளைச் சேர்த்தது - நன்றி @ceskydj - காணாமல் போன உள்நுழைவு திரை மொழிபெயர்ப்புகள் சேர்க்கப்பட்டன

# changelogs/16.txt:1
source: - Added cook time to create and edit form - Added Czech translations – Thanks @ceskyDJ - Added missing login screen translations
ta: - படிவத்தை உருவாக்க மற்றும் திருத்த சமையல்காரர் நேரம் சேர்க்கப்பட்டது - செக் மொழிபெயர்ப்புகளைச் சேர்த்தது - நன்றி @ceskydj - காணாமல் போன உள்நுழைவு திரை மொழிபெயர்ப்புகள் சேர்க்கப்பட்டன

# changelogs/17.txt:1
source: - Added search bar to recipe list screen
ta: - செய்முறை பட்டியல் திரையில் தேடல் பட்டியைச் சேர்த்தது

# changelogs/18.txt:1
source: - Added search bar to recipe list screen
ta: - செய்முறை பட்டியல் திரையில் தேடல் பட்டியைச் சேர்த்தது

# changelogs/19.txt:1
source: - Fix login issue
ta: - உள்நுழைவு சிக்கலை சரிசெய்யவும்

# changelogs/20.txt:1
source: - Fix API implementation
ta: - பநிஇ செயல்படுத்தலை சரிசெய்யவும்

# changelogs/21.txt:1
source: - Add category to recipe views - Fix image URL - Fix persisted data after logout
ta: - செய்முறை காட்சிகளுக்கு வகையைச் சேர்க்கவும் - பட முகவரி ஐ சரிசெய்யவும் - வெளியேறிய பிறகு தொடர்ந்து தரவை சரிசெய்யவும்

# changelogs/22.txt:1
source: - Unify icon styles - Fix settings visuals - Fix create screen category suggestion
ta: - படவுரு பாணிகளை ஒன்றிணைக்கவும் - அமைப்புகள் காட்சிகளை சரிசெய்யவும் - திரை வகை ஆலோசனையை உருவாக்குங்கள்

# changelogs/23.txt:1
source: - Update Czech translation - Fix landscape status bar color - Fix startup crash related to recipe of the day
ta: - செக் மொழிபெயர்ப்பைப் புதுப்பிக்கவும் - இயற்கை நிலை பட்டியை சரிசெய்யவும் - அன்றைய செய்முறை தொடர்பான தொடக்க விபத்தை சரிசெய்யவும்

# changelogs/24.txt:1
source: - Fix crash after login
ta: - உள்நுழைந்த பிறகு செயலிழப்பை சரிசெய்யவும்

# changelogs/25.txt:1
source: - Prepare F-Droid release
ta: - எஃப்-டிராய்டு வெளியீட்டைத் தயாரிக்கவும்

# changelogs/26.txt:1
source: - Add open source licenses - Add self signed certificate support - Update Czech translation - Fix crash with old recipes
ta: - திறந்த மூல உரிமங்களைச் சேர்க்கவும் - தன்வய கையொப்பமிடப்பட்ட சான்றிதழ் ஆதரவைச் சேர்க்கவும் - செக் மொழிபெயர்ப்பைப் புதுப்பிக்கவும் - பழைய சமையல் குறிப்புகளுடன் செயலிழப்பை சரிசெய்யவும்

# changelogs/27.txt:1
source: - Disallow cleartext traffic - Replace Chips - Replace libraries screen
ta: - தெளிவான போக்குவரத்தை அனுமதிக்காதீர்கள் - சில்லுகளை மாற்றவும் - நூலகங்களின் திரையை மாற்றவும்

# changelogs/28.txt:1
source: - Enhance Czech translation - Improve time field behaviour - Change category icon - Fix uncategorized recipes list - Add keywords support
ta: - செக் மொழிபெயர்ப்பை மேம்படுத்தவும் - நேர புல நடத்தை மேம்படுத்தவும் - வகை ஐகானை மாற்றவும் - வகைப்படுத்தப்படாத சமையல் பட்டியலை சரிசெய்யவும் - முக்கிய வார்த்தைகளைச் சேர்க்கவும்

# changelogs/29.txt:1
source: - Add crash reporting - Add Norwegian translation - Enhance Czech translation - Enhance bottom bar behaviour
ta: - செயலிழப்பு அறிக்கையைச் சேர்க்கவும் - நோர்வே மொழிபெயர்ப்பைச் சேர்க்கவும் - செக் மொழிபெயர்ப்பை மேம்படுத்தவும் - கீழ் பட்டியை மேம்படுத்தவும்

# changelogs/30.txt:1
source: - Enhance Czech translation - Fix startup crash
ta: - செக் மொழிபெயர்ப்பை மேம்படுத்தவும் - தொடக்க விபத்தை சரிசெய்யவும்

# changelogs/31.txt:1
source: - Fix crash on recipe detail screen
ta: - செய்முறை விவரம் திரையில் செயலிழப்பை சரிசெய்யவும்

# changelogs/32.txt:1
source: - Add polish translation - Fix crash in some languages
ta: - போலந்து மொழிபெயர்ப்பைச் சேர்க்கவும் - சில மொழிகளில் செயலிழப்பை சரிசெய்யவும்

# changelogs/33.txt:1
source: - Fix crash on login
ta: - உள்நுழைவில் செயலிழப்பை சரிசெய்யவும்

# changelogs/34.txt:1
source: - Add Russian translation - Update Norwegian translation - Fix search focus behaviour - Fix splash screen dismiss behaviour - Fix scrolling issues on login
ta: - ரச்ய மொழிபெயர்ப்பைச் சேர்க்கவும் - நோர்வே மொழிபெயர்ப்பைப் புதுப்பிக்கவும் - தேடல் கவனம் நடத்தை சரிசெய்யவும் - ச்பிளாச் திரை நிரலை சரிசெய்யவும் - உள்நுழைவில் ச்க்ரோலிங் சிக்கல்களை சரிசெய்யவும்

# changelogs/35.txt:1
source: - Update Russian translation - Fix home screen crash - Improve login handling
ta: - ரச்ய மொழிபெயர்ப்பைப் புதுப்பிக்கவும் - முகப்பு திரை செயலிழப்பை சரிசெய்யவும் - உள்நுழைவு கையாளுதலை மேம்படுத்தவும்

# changelogs/36.txt:1
source: - Update Russian translation - Fix home screen crash - Improve login handling
ta: - ரச்ய மொழிபெயர்ப்பைப் புதுப்பிக்கவும் - முகப்பு திரை செயலிழப்பை சரிசெய்யவும் - உள்நுழைவு கையாளுதலை மேம்படுத்தவும்

# changelogs/37.txt:1
source: - Add nutrition information - Update Czech translation - Update Polish translation - Update Russian translation
ta: - ஊட்டச்சத்து தகவல்களைச் சேர்க்கவும் - செக் மொழிபெயர்ப்பைப் புதுப்பிக்கவும் - போலந்து மொழிபெயர்ப்பைப் புதுப்பிக்கவும் - ரச்ய மொழிபெயர்ப்பைப் புதுப்பிக்கவும்

# changelogs/38.txt:1
source: - Add Spanish translation - Add Ukrainian translation - Fix instruction numbers
ta: - ச்பானிச் மொழிபெயர்ப்பைச் சேர்க்கவும் - உக்ரேனிய மொழிபெயர்ப்பைச் சேர்க்கவும் - அறிவுறுத்தல் எண்களை சரிசெய்யவும்

# changelogs/39.txt:1
source: - Add support for Markdown
ta: - மார்க் டவுனுக்கு ஆதரவைச் சேர்க்கவும்

# changelogs/40.txt:1
source: - Add contribute translations button - Add Galician translation - Add servings calculator - Update Czech translation
ta: - பங்களிப்பு மொழிபெயர்ப்பு பொத்தானைச் சேர்க்கவும் - காலிசியன் மொழிபெயர்ப்பைச் சேர்க்கவும் - பணி கால்குலேட்டரைச் சேர்க்கவும் - செக் மொழிபெயர்ப்பைப் புதுப்பிக்கவும்

# changelogs/41.txt:1
source: - Add copy button for ingredients - Add Turkish translation - Improve back navigation - Update Czech translation - Update Russian translation - Update Spanish translation - Update Ukrainian translation - Update Galician translation - Fix servings calculation for amounts separated by dash
ta: - பொருட்களுக்கு நகல் பொத்தானைச் சேர்க்கவும் - துருக்கிய மொழிபெயர்ப்பைச் சேர்க்கவும் - பின் வழிசெலுத்தலை மேம்படுத்தவும் - செக் மொழிபெயர்ப்பைப் புதுப்பிக்கவும் - ரச்ய மொழிபெயர்ப்பைப் புதுப்பிக்கவும் - ச்பானிச் மொழிபெயர்ப்பைப் புதுப்பிக்கவும் - உக்ரேனிய மொழிபெயர்ப்பைப் புதுப்பிக்கவும் - காலிசியன் மொழிபெயர்ப்பைப் புதுப்பிக்கவும் - கோடு மூலம் பிரிக்கப்பட்ட தொகைகளுக்கான பணி கணக்கீட்டை சரிசெய்யவும்

# changelogs/42.txt:1
source: - Add recipe import
ta: - செய்முறை இறக்குமதியைச் சேர்க்கவும்

# changelogs/43.txt:1
source: - Add recipe import
ta: - செய்முறை இறக்குமதியைச் சேர்க்கவும்
