Repository: 247i/TACETr
Catalog: உரை/தானி/nezha-admin-frontend-*.po
Languages: ta

# nezha
source: Nezha Monitoring
ta: கண்காணிப்பு

# theme.light
source: Light
ta: ஒளி

# theme.dark
source: Dark
ta: இருண்ட

# theme.system
source: Follow System
ta: அமைப்பைப் பின்தொடரவும்

source: Username
ta: பயனர்பெயர்

source: Password
ta: கடவுச்சொல்

# LoginFirst
source: Please Log in first
ta: முதலில் உள்நுழைக

source: Current Time
ta: தற்போதைய நேரம்

# Results.UsernameMin
source: Username must be at least {{number}} characters.
ta: பயனர்பெயர் குறைந்தபட்சம் {{number}} எழுத்துக்களாக இருக்க வேண்டும்.

# Results.PasswordRequired
source: Password cannot be empty.
ta: கடவுச்சொல் காலியாக இருக்க முடியாது.

# Results.ErrorFetchingResource
source: Error Fetching Resource : {{error}}
ta: வளத்தைப் பெறுவதில் பிழை: {{error}}

# Results.SelectAtLeastOneServer
source: Please select at least one server.
ta: குறைந்தது ஒரு சேவையகத்தைத் தேர்ந்தெடுக்கவும்.

# Results.UnExpectedError
source: Unexpected error, Please see the console for details.
ta: எதிர்பாராத பிழை, விவரங்களுக்கு கன்சோலைப் பார்க்கவும்.

# Results.ForceUpdate
source: Forced upgrade:
ta: கட்டாய மேம்படுத்தல்:

# Results.NoRowsAreSelected
source: No rows are selected
ta: வரிசைகள் எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# Results.ThisOperationIsUnrecoverable
source: This operation cannot be undone!
ta: இந்த செயல்பாட்டை செயல்தவிர்க்க முடியாது!

# Results.TaskTriggeredSuccessfully
source: The task triggered successfully
ta: பணி வெற்றிகரமாக தூண்டப்பட்டது

# Results.TheServerDoesNotOnline
source: The server does not exist or has not been connected yet
ta: சேவையகம் இல்லை அல்லது இன்னும் இணைக்கப்படவில்லை

# Results.InstallHostRequired
source: The Agent docking address has not been filled in in the settings.
ta: அமைப்புகளில் முகவர் நறுக்குதல் முகவரி நிரப்பப்படவில்லை.

# Results.UnknownIdentifier
source: Unknown identifier
ta: தெரியாத அடையாளங்காட்டி

source: Log in
ta: புகுபதிகை

source: Server
ta: சேவையகம்

source: Service
ta: பணி

source: Task
ta: பணி

source: Notification
ta: அறிவிப்பு

# DDNS
source: Dynamic DNS
ta: மாறும் டி.என்.எச்

# NATT
source: NAT Traversal
ta: நாட் டிராவர்சல்

source: Group
ta: குழு

source: Profile
ta: சுயவிவரம்

# Settings
source: System settings
ta: கணினி அமைப்புகள்

source: Back to Home
ta: வீட்டிற்கு திரும்பவும்

source: Log out
ta: விடுபதிகை

source: Navigate to
ta: செல்லவும்

# SelectAPageToNavigateTo
source: Choose a page to jump to
ta: செல்ல ஒரு பக்கத்தைத் தேர்வுசெய்க

source: Close
ta: மூடு

source: Error
ta: பிழை

source: Name
ta: பெயர்

source: Version
ta: பதிப்பு

source: unknown
ta: தெரியவில்லை

source: Enable
ta: இயக்கு

# HideForGuest
source: Hidden from Visitors
ta: பார்வையாளர்களிடமிருந்து மறைக்கப்பட்டுள்ளது

# InstallCommands
source: Installation command
ta: நிறுவல் கட்டளை

source: Note
ta: குறிப்பு

source: Success
ta: செய்

# Done
source: Finish
ta: முடிக்க

source: Offline
ta: இணையமில்லாமல்

# Failure
source: Fail
ta: தோல்வி

source: Loading
ta: ஏற்றுகிறது

source: No results
ta: முடிவுகள் இல்லை

source: Actions
ta: செயல்கள்

source: Edit Server
ta: சேவையகத்தைத் திருத்து

# Weight
source: Weight (the larger the number, the higher it is displayed)
ta: எடை (பெரிய எண், அதிக அளவில் காட்டப்படும்)

# DDNSProfiles
source: DDNS Profile IDs
ta: டி.டி.என்.எச் சுயவிவர ஐடிகள்

source: (Separate with comma)
ta: (கமாவுடன் பிரிக்கவும்)

source: Public
ta: பொது

source: Private
ta: தனிப்பட்ட

source: Submit
ta: சமர்ப்பிக்கவும்

source: Target
ta: இலக்கு

source: Coverage
ta: பாதுகாப்பு

source: Cover All
ta: அனைத்தையும் மறைக்கவும்

source: Ignore All
ta: அனைத்தையும் புறக்கணிக்கவும்

# OnAlert
source: Alarmed Servers
ta: எச்சரிக்கை சேவையகங்கள்

# SpecificServers
source: Specific server
ta: குறிப்பிட்ட சேவையகம்

source: Type
ta: வகை

source: Interval
ta: இடைவேளை

source: Notifier Group ID
ta: குழு ஐடியை அறிவிக்கவும்

# Trigger
source: On Trigger
ta: தூண்டுதலில்

# TasksToTriggerOnAlert
source: Tasks to be triggered on alert
ta: எச்சரிக்கையில் தூண்டப்பட வேண்டிய பணிகள்

# TasksToTriggerAfterRecovery
source: Tasks to be triggered after recovery
ta: மீட்கப்பட்ட பிறகு தூண்டப்பட வேண்டிய பணிகள்

source: Confirm
ta: உறுதிப்படுத்தவும்

source: Confirm Deletion?
ta: நீக்குதலை உறுதிப்படுத்தவா?

source: Services
ta: சேவைகள்

source: Show in Service
ta: சேவையில் காட்டு

# Coverages.Excludes
source: Excludes Specific Servers
ta: குறிப்பிட்ட சேவையகங்களை விலக்குகிறது

# Coverages.Only
source: Only Specific Servers
ta: குறிப்பிட்ட சேவையகங்கள் மட்டுமே

# Coverages.Alarmed
source: Executed on the server that triggered the alarm
ta: அலாரத்தைத் தூண்டிய சேவையகத்தில் செயல்படுத்தப்பட்டது

source: Enable Failure Notification
ta: தோல்வி அறிவிப்பை இயக்கவும்

# MaximumLatency
source: Maximum Delay (ms)
ta: அதிகபட்ச நேரந்தவறுகை (எம்.எச்)

# MinimumLatency
source: Minimum Delay (milliseconds)
ta: குறைந்தபட்ச நேரந்தவறுகை (மில்லி விநாடிகள்)

source: Enable Latency Notification
ta: தாமத அறிவிப்பை இயக்கவும்

source: Enable Trigger Task
ta: தூண்டுதல் பணியை இயக்கவும்

source: Cron Expression
ta: க்ரோன் வெளிப்பாடு

source: Command
ta: கட்டளை

source: Notifier Group
ta: குழுவிற்கு அறிவிக்கவும்

source: Send Success Notification
ta: செய் அறிவிப்பை அனுப்புங்கள்

source: Last Execution
ta: கடைசி சாவுஒறுப்பு

source: Result
ta: முடிவு

# Scheduled
source: Scheduled Tasks
ta: திட்டமிடப்பட்ட பணிகள்

source: Notifier
ta: அறிவிக்கவும்

# AlertRule
source: Alert rules
ta: எச்சரிக்கை விதிகள்

source: Verify TLS
ta: TLS ஐ சரிபார்க்கவும்

source: Trigger Mode
ta: தூண்டுதல் பயன்முறை

source: Rules
ta: விதிகள்

source: Request Method
ta: கோரிக்கை முறை

source: Request Header
ta: கோரிக்கை தலைப்பு

source: Do Not Send Test Message
ta: சோதனை செய்தியை அனுப்ப வேண்டாம்

source: Always
ta: எப்போதும்

source: Once
ta: ஒருமுறை

source: Provider
ta: வழங்குநர்

source: Domains
ta: களங்கள்

# MaximumRetryAttempts
source: Maximum time for retry attempts
ta: மீண்டும் முயற்சிக்கும் முயற்சிகளுக்கு அதிகபட்ச நேரம்

source: Refresh
ta: புதுப்பிப்பு

source: Copy path
ta: நகல் பாதை

source: Go to
ta: செல்

source: Update Profile
ta: சுயவிவரத்தைப் புதுப்பிக்கவும்

source: New Username
ta: புதிய பயனர்பெயர்

source: Original Password
ta: அசல் கடவுச்சொல்

source: New Password
ta: புதிய கடவுச்சொல்

source: Edit DDNS
ta: DDNS ஐத் திருத்து

source: Create DDNS
ta: DDNS ஐ உருவாக்கவும்

source: Credential
ta: நற்சான்றிதழ்

source: Request Type
ta: கோரிக்கை வகை

source: Request Body
ta: கோரிக்கை அமைப்பு

# FileManager
source: Pseudo File Manager
ta: போலி கோப்பு மேலாளர்

source: Downloading
ta: பதிவிறக்குகிறது

source: Uploading
ta: பதிவேற்றம்

# EditNAT
source: Edit NAT Configuration
ta: NAT உள்ளமைவைத் திருத்து

# CreateNAT
source: Create NAT Configuration
ta: NAT உள்ளமைவை உருவாக்கவும்

source: Local Service
ta: உள்ளக பணி

# BindHostname
source: Bind Domain Name
ta: டொமைன் பெயரை பிணைக்கவும்

source: Edit Server Group
ta: சேவையக குழுவைத் திருத்து

source: Create Server Group
ta: சேவையக குழுவை உருவாக்கவும்

source: User
ta: பயனர்

# WAF
source: Web Application Firewall
ta: வலை பயன்பாடு ஃபயர்வால்

source: Site Name
ta: தளத்தின் பெயர்

# DashboardOriginalHost
source: Agent connecting address [domain name/IP:port]
ta: முகவரியை இணைக்கும் முகவரி [டொமைன் பெயர்/ஐபி: போர்ட்]

# ConfigTLS
source: Use TLS to connect Agent
ta: முகவரை இணைக்க TLS ஐப் பயன்படுத்தவும்

source: Login Failed
ta: உள்நுழைவு தோல்வியடைந்தது

source: Brute Force Attacking Token
ta: மிருகத்தனமான ஆற்றல் டோக்கனைத் தாக்குகிறது

source: Brute Force Attacking Agent Secret
ta: மிருகத்தனமான படை தாக்குதல் முகவர் மறைபொருள்

source: Language
ta: மொழி

# CustomCodes
source: Custom Codes (Style and Script)
ta: தனிப்பயன் குறியீடுகள் (நடை மற்றும் ச்கிரிப்ட்)

# CustomCodesDashboard
source: Custom Codes for Dashboard
ta: டாச்போர்டுக்கான தனிப்பயன் குறியீடுகள்

source: Custom Public DNS Nameservers for DDNS
ta: டி.டி.என்.எச்சிற்கான தனிப்பயன் பொது டி.என்.எச் பெயர்செர்வர்ச்

# RealIPHeader
source: Real IP request header
ta: உண்மையான ஐபி கோரிக்கை தலைப்பு

# UseDirectConnectingIP
source: Use direct connection IP
ta: நேரடி இணைப்பு ஐபி பயன்படுத்தவும்

source: IP Change Notification
ta: ஐபி மாற்ற அறிவிப்பு

# FullIPNotification
source: Show Full IP Address in Notification Messages
ta: அறிவிப்பு செய்திகளில் முழு ஐபி முகவரியைக் காட்டுங்கள்

source: Edit Service
ta: சேவையைத் திருத்து

source: Create Service
ta: சேவையை உருவாக்கவும்

source: Edit Task
ta: பணியைத் திருத்து

source: Create Task
ta: பணியை உருவாக்கவும்

source: Create Notifier
ta: அறிவிப்பை உருவாக்கவும்

source: Edit Notifier
ta: அறிவிப்பு திருத்து

# EditAlertRule
source: Edit Alert Rules
ta: எச்சரிக்கை விதிகளைத் திருத்தவும்

# CreateAlertRule
source: Create Alert Rules
ta: எச்சரிக்கை விதிகளை உருவாக்கவும்

source: Edit Notifier Group
ta: குழுவைத் திருத்து

source: Create Notifier Group
ta: அறிவிப்பு குழுவை உருவாக்கவும்

source: New User
ta: புதிய பயனர்

source: Count
ta: எண்ணுங்கள்

source: Last Block Reason
ta: கடைசி தொகுதி காரணம்

# LastBlockTime
source: Last ban time
ta: கடைசி தடை நேரம்

source: Theme
ta: கருப்பொருள்

source: Author
ta: நூலாசிரியர்

source: Repository
ta: களஞ்சியம்

source: Community
ta: சமூகம்

source: Official
ta: அதிகாரி

# CommunityThemeWarning
source: You are using a community theme
ta: நீங்கள் ஒரு சமூக கருப்பொருளைப் பயன்படுத்துகிறீர்கள்

# CommunityThemeDescription
source: This theme is provided by the community, use at your own risk
ta: இந்த கருப்பொருள் சமூகத்தால் வழங்கப்படுகிறது, உங்கள் சொந்த ஆபத்தில் பயன்படுத்தவும்

source: Cancel
ta: ரத்துசெய்

source: Enable DDNS
ta: DDNS ஐ இயக்கவும்

# PushSuccessful
source: Push if Successful
ta: வெற்றிகரமாக இருந்தால் தள்ளுங்கள்

# GrpcAuthFailed
source: gRPC authentication failed
ta: சிஆர்பிசி ஏற்பு தோல்வியடைந்தது

# APITokenInvalid
source: API token is invalid
ta: பநிஇ கிள்ளாக்கு தவறானது

# UserInvalid
source: User is invalid
ta: பயனர் தவறானது

# BlockByUser
source: Blocked by admin
ta: நிர்வாகியால் தடுக்கப்பட்டது

source: Block identifier
ta: தொகுதி அடையாளங்காட்டி

source: User ID
ta: பயனர் ஐடி

source: Connected at
ta: இணைக்கப்பட்டுள்ளது

source: Online User
ta: நிகழ்நிலை பயனர்

source: Total
ta: மொத்தம்

source: Confirm Block
ta: தொகுதி உறுதிப்படுத்தவும்

# RejectPassword
source: Reject Password Login
ta: கடவுச்சொல் உள்நுழைவை நிராகரிக்கவும்

# EmptyText
source: Text is empty
ta: உரை காலியாக உள்ளது

# EmptyNote
source: You didn't have any note.
ta: உங்களிடம் எந்த குறிப்பும் இல்லை.
