Repository: 247i/TACETr
Catalog: உரை/தானி/noe-fields-builder-*.po
Languages: ta

# addAFreeContent
source: Ajouter du contenu libre
ta: இலவச உள்ளடக்கத்தைச் சேர்க்கவும்

# addAPanel
source: Ajouter un groupe de questions
ta: கேள்விகளின் குழுவைச் சேர்க்கவும்

# addAQuestion
source: Ajouter une question
ta: ஒரு கேள்வியைச் சேர்க்கவும்

# defaultPlaceholders->multiSelect
source: Sélectionnez une ou plusieurs options…
ta: ஒன்று அல்லது அதற்கு மேற்பட்ட விருப்பங்களைத் தேர்ந்தெடுக்கவும் ...

# defaultPlaceholders->select
source: Sélectionnez une option…
ta: ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்…

# defaultPlaceholders->text
source: Votre réponse…
ta: உங்கள் பதில் ...

# displayConditionsHelp->advancedConditions->text
source: <p> Si la question dont dépend votre condition est un champ complexe (cases à cocher, choix multiple, select, multi-select), vous allez sûrement vouloir utiliser des conditions avancées. </p> <p> Pour ces champs, utilisez les valeurs exactes des clés associées aux réponses voulues. Elles se trouvent dans le champ "Clé en BDD" des options de la question concernée. <br /> <exampleText> ex: <i>jeSuisMajeur_s4d</i> pour sélectionner la réponse <i>Je suis majeur</i>. </exampleText> </p> <p> Vous pouvez ensuite assembler plusieurs réponses ensembles, avec nos opérateurs <i>OU</i> et <i>ET</i> : </p> <p> <strong>Séparateur <i>OU</i> :</strong> Vous pouvez utiliser l'opérateur <i>;</i> pour activer la condition si une ou plusieurs valeurs sont sélectionnées. <br /> <exampleText> ex: <i>jeSuisMajeur_s4d;jeSuisAccompagne_3ka</i> pour activer la condition si <i>Je suis majeur</i> <strong>ou</strong> <i>Je suis accompagné</i> est sélectionné. </exampleText> </p> <p> <strong>Séparateur <i>ET</i> :</strong> Vous pouvez utiliser le opérateur <i>AND</i> pour activer la condition si toutes les valeurs demandées sont sélectionnées. <br /> <exampleText> ex: <i>dispoLe28_8sd AND dispoLe29_la6</i> pour activer la condition si <i>Dispo le 28</i> <strong>et</strong> <i>Dispo le 29</i> sont tous les deux sélectionnés. </exampleText> </p> <p> <strong>Utilisez <i>OU</i> et <i>ET</i> en même temps :</strong> Vous pouvez utiliser les deux opérateurs en même temps. <br /> <exampleText> ex: <i>dispoLe28_8sd;dispoLe29_la6 AND dispoLe31_nk1</i> pour activer la condition si <i>Dispo le 28</i> <strong>ou</strong> <i>Dispo le 29</i> est sélectionné <strong>et</strong> si <i>Dispo le 31</i> est sélectionné. </exampleText> </p> <p>Les opérateurs sont disponibles pour les composants suivants </p> <ul> <li>Opérateur <i>OU</i> : dispo sur Select, Multi-select, Choix multiples et Checkboxes</li> <li>Opérateur <i>ET</i> : dispo sur Checkboxes et Multi-select</li> </ul>
ta: <p> உங்கள் நிலை சார்ந்து இருக்கும் கேள்வி ஒரு சிக்கலான புலம் என்றால் (சரிபார்க்கவும் பெட்டிகள், தேர்வு பல, தேர்ந்தெடு, பல தேர்ந்தெடுக்கப்பட்டவை), நீங்கள் நிச்சயமாக நிபந்தனைகளைப் பயன்படுத்த விரும்புவீர்கள் மேம்பட்டது. </p> <p> இந்த துறைகளுக்கு, விரும்பிய பதில்களுடன் தொடர்புடைய விசைகளின் சரியான மதிப்புகளைப் பயன்படுத்தவும். அவர்கள் சம்பந்தப்பட்ட கேள்வியின் விருப்பங்களின் "பி.டி.டி விசை" துறையில் உள்ளன. <Br /> <exeadext> எ.கா: <i> பதிலைத் தேர்ந்தெடுக்க jesuismajuer_s4d </i> <i> நான் அகவை வந்தவன் </i>. </exampleText> </p> <p> எங்கள் ஆபரேட்டர்கள் <i> அல்லது </i> மற்றும் <i> மற்றும் </i> உடன் நீங்கள் பல பதில்களை ஒன்றிணைக்கலாம்: </p> <p> <strong> பிரிப்பான் <i> அல்லது </i>: </strong> நீங்கள் செயல்படுத்தலாம் </i>; ஒன்று அல்லது அதற்கு மேற்பட்ட மதிப்புகள் தேர்ந்தெடுக்கப்பட்டால் நிபந்தனை. <Br /> <exeadext> எ.கா: <i> சேசுச்சூர்_எச் 4 டி; <strong> அல்லது </strong> <i> நான் உடன் இருக்கிறேன் </i> தேர்ந்தெடுக்கப்பட்டது. </exampleText> </p> <p> <strong> பிரிப்பான் <i> மற்றும் </i>: </strong> நீங்கள் செயல்பாட்டுக்கு ஆபரேட்டரைப் பயன்படுத்தலாம் கோரப்பட்ட அனைத்து மதிப்புகளும் தேர்ந்தெடுக்கப்பட்டால் நிபந்தனை. <Br /> <exeadext> எ.கா: <i> dispole28_8sd மற்றும் dispole29_la6 </i> 28 </i> இல் <i> கிடைத்தால் நிபந்தனையை செயல்படுத்த <strong> மற்றும் </strong> <i> 29 </i> இல் கிடைக்கிறது. </exampleText> </p> <p> <strong> <i> அல்லது </i> மற்றும் <i> மற்றும் </i> ஒரே நேரத்தில்: </strong> நீங்கள் இரண்டையும் பயன்படுத்தலாம் ஒரே நேரத்தில் ஆபரேட்டர்கள். <Br /> <exeadext> Ex: <i> dispole28_8sd; 28 </i> <strong> அல்லது </strong> <i> 29 </i> இல் கிடைக்கிறது <strong> மற்றும் </strong> <i> 31 இல் கிடைத்தால் </i> தேர்ந்தெடுக்கப்பட்டது. </exampleText> </p> <p> ஆபரேட்டர்கள் பின்வரும் கூறுகளுக்கு கிடைக்கின்றன </p> <ul> <li> ஆபரேட்டர் <i> அல்லது </i>: தேர்ந்தெடுக்கப்பட்ட, மல்டி-தேர்ந்தெடுக்கப்பட்ட, பல தேர்வு மற்றும் தேர்வுப்பெட்டிகளில் கிடைக்கிறது </li> <li> ஆபரேட்டர் <i> மற்றும் </i>: தேர்வுப்பெட்டிகள் மற்றும் மல்டி-தேர்ந்தெடுக்கப்பட்டவற்றில் கிடைக்கிறது </li> </ul>

# displayConditionsHelp->advancedConditions->title
source: Conditions avancées
ta: மேம்பட்ட நிலைமைகள்

# displayConditionsHelp->notice
source: Apprenez à écrire le texte de conditions avec nos conseils et exemples.
ta: எங்கள் அறிவுரை மற்றும் எடுத்துக்காட்டுகளுடன் நிபந்தனைகளின் நிபந்தனைகளை எழுத கற்றுக்கொள்ளுங்கள்.

# displayConditionsHelp->simpleConditions->text
source: <p> Si la question dont dépend votre condition est un champ simple (texte, nombre, checkbox), vous pouvez renseigner directement la valeur exacte à obtenir pour la condition réussisse. </p> <p>Voici nos conseils pour chaque type de champ :</p> <ul> <li> Texte court, Texte long, Email, URL, Téléphone : la valeur exacte à obtenir <exampleText> (ex: <i>je suis une licorne !</i>, <i>+33 6 12 12 12 12</i>, <i>https://sesame-ouvre-toi.com</i>) </exampleText> </li> <li> Checkbox : <i>true</i> pour coché, <i>false</i> pour non-coché <exampleText>(ex: <i>true</i>, <i>false</i>)</exampleText> </li> <li> Number : utilisez le point pour rentrer un chiffre décimal <exampleText>(ex: <i>4</i> ou <i>5.6</i>)</exampleText> </li> </ul>
ta: <p> உங்கள் நிலை சார்ந்து இருக்கும் கேள்வி ஒரு எளிய புலம் (உரை, எண், தேர்வுப்பெட்டி), வெற்றிகரமான நிலைக்கு பெற வேண்டிய சரியான மதிப்பை நீங்கள் நேரடியாக தெரிவிக்கலாம். </p> <p> ஒவ்வொரு வகை புலத்திற்கும் எங்கள் உதவிக்குறிப்புகள் இங்கே: </p> <ul> <li> குறுகிய உரை, நீண்ட உரை, மின்னஞ்சல், முகவரி, தொலைபேசி: பெற சரியான மதிப்பு <exaltextext> . >) </exampleText> </li> <li> தேர்வுப்பெட்டி: <i> உண்மை </i> சரிபார்க்க, <i> பொய்யானது </i> கோச் அல்லாத <extpleText> (எ.கா /ExampleText> </li> <li> எண்: ஒரு தசம உருவத்தை உள்ளிட புள்ளியைப் பயன்படுத்தவும் <ectaltextext> (எ.கா. </li> </ul>

# displayConditionsHelp->simpleConditions->title
source: Conditions simples
ta: நிபந்தனைகள் எளிமையானவை

# move->down
source: Descendre
ta: கீழே வர

# move->up
source: Monter
ta: மேலே செல்ல

# newFieldContentComp
source: Nouveau contenu libre
ta: புதிய இலவச உள்ளடக்கம்

# newFieldInputComp
source: Nouvelle question
ta: புதிய கேள்வி

# newFieldPanelComp
source: Nouveau groupe
ta: புதிய குழு

# schema->conditional->conditions
source: conditions
ta: நிபந்தனைகள்

# schema->conditional->doNotShow
source: Ne pas montrer
ta: காட்ட வேண்டாம்

# schema->conditional->helpForDisplayConditions
source: Aide sur les champs conditionnels
ta: நிபந்தனை புலங்களில் உதவுங்கள்

# schema->conditional->isEqualTo
source: est égale à
ta: சமம்

# schema->conditional->question
source: question
ta: கேள்வி

# schema->conditional->show
source: Montrer
ta: காட்ட

# schema->conditional->showPlaceholder
source: Montrer / Ne pas montrer
ta: காட்டு / காட்ட வேண்டாம்

# schema->conditional->whenQuestion
source: quand la question
ta: கேள்வி போது

# schema->content->label
source: Contenu
ta: உள்ளடக்கம்

# schema->content->placeholder
source: tapez ici le contenu libre que vous souhaitez
ta: நீங்கள் விரும்பும் இலவச உள்ளடக்கத்தை இங்கே தட்டச்சு செய்க

# schema->description->label
source: Description
ta: விவரம்

# schema->description->placeholder
source: description
ta: விவரம்

# schema->disabled->label
source: Désactivé
ta: முடக்கப்பட்டது

# schema->displayName->label
source: Nom d'affichage
ta: காட்சி பெயர்

# schema->displayName->placeholder
source: nom d'affichage
ta: காட்சி பெயர்

# schema->displayOptions->label
source: Montrer dans…
ta: காட்டு ...

# schema->displayOptions->options->inListView
source: La vue liste orga
ta: வ்யூ பட்டியல் ஓர்கா

# schema->displayOptions->options->inOrgaFilters
source: Les filtres orga
ta: கரிம வடிப்பான்கள்

# schema->displayOptions->options->inParticipantFilters
source: Les filtres participant·es
ta: பங்கேற்கும் வடிப்பான்கள்

# schema->displayOptions->options->inParticipantSessionView
source: La vue pleine page des sessions participant·es
ta: பங்கேற்கும் அமர்வுகளின் முழு பக்க பார்வை

# schema->displayOptions->options->inPdfExport
source: Les exports PDF
ta: LES ஏற்றுமதி PDF

# schema->displayOptions->options->inSessionsCards
source: La miniature des sessions participant·es
ta: பங்கேற்கும் அமர்வுகளின் மினியேச்சர்

# schema->hidden->label
source: Caché pour les participant·es
ta: பங்கேற்பாளர்களுக்கு மறைக்கப்பட்டுள்ளது

# schema->key->label
source: Clé en base de données
ta: தரவுத்தள விசை

# schema->key->placeholder
source: clé
ta: விசை

# schema->label->label
source: Question
ta: கேள்வி

# schema->label->placeholder
source: question
ta: கேள்வி

# schema->minMax->labelNumber
source: Valeurs mini/maxi
ta: மினி/அதிகபட்ச மதிப்புகள்

# schema->minMax->labelSelectedCount
source: Nombre mini/maxi de réponses
ta: மினி/அதிகபட்ச பதில்கள்

# schema->minMax->minDisabledIfNotRequired
source: Vous devez rendre cette question obligatoire pour spécifier un minimum.
ta: குறைந்தபட்சம் குறிப்பிட இந்த கேள்வியை நீங்கள் கட்டாயப்படுத்த வேண்டும்.

# schema->minMax->placeholderMax
source: max
ta: அதிகபட்சம்

# schema->minMax->placeholderMin
source: min
ta: மணித்துளி

# schema->options->addOption
source: Ajouter une option
ta: ஒரு விருப்பத்தைச் சேர்க்கவும்

# schema->options->atLeastOneOptionNeeded
source: Au moins une option est requise.
ta: குறைந்தது ஒரு விருப்பம் தேவை.

# schema->options->label
source: Options
ta: விருப்பங்கள்

# schema->options->optionKey
source: Clé en BDD :
ta: பி.டி.டி விசை:

# schema->options->optionLabel
source: nom de l'option
ta: விருப்பத்தின் பெயர்

# schema->required->label
source: Obligatoire
ta: கட்டாய

# schema->title->label
source: Titre
ta: டைட்ரே

# schema->title->placeholder
source: titre
ta: டைட்ரே

# schema->type->label
source: Type de question
ta: கேள்வி வகை

# schema->type->placeholder
source: type
ta: வகை

# schema->type->typesAreIncompatible
source: Seuls les types similaires sont permis car la question a déjà été créée.
ta: கேள்வி ஏற்கனவே உருவாக்கப்பட்டுள்ளதால் இதே போன்ற வகைகள் மட்டுமே அனுமதிக்கப்படுகின்றன.

# tabs->advanced
source: Avancé
ta: முன்கூட்டியே

# tabs->displayConditions
source: Conditions d'affichage
ta: காட்சி நிலைமைகள்

# tabs->general
source: Général
ta: பொது

# types->checkbox
source: Checkbox / validation
ta: தேர்வுப்பெட்டி / சரிபார்ப்பு

# types->checkboxGroup
source: Checkboxes (plusieurs choix possibles)
ta: தேர்வுப்பெட்டிகள் (பல சாத்தியமான தேர்வுகள்)

# types->content
source: Contenu libre
ta: இலவச உள்ளடக்கம்

# types->datetime
source: Date et heure
ta: தேதி மற்றும் நேரம்

# types->day
source: Jour
ta: சர்

# types->email
source: Email
ta: மின்னஞ்சல்

# types->longText
source: Paragraphe
ta: பத்தி

# types->multiSelect
source: Multi-select (plusieurs choix possibles)
ta: பல-தேர்ந்தெடுக்கப்பட்ட (பல சாத்தியமான தேர்வுகள்)

# types->number
source: Nombre
ta: பெயர்

# types->panel
source: Groupe de questions
ta: கேள்விக் குழு

# types->phoneNumber
source: Téléphone
ta: தொலைபேசி

# types->radioGroup
source: Choix multiples (un choix possible)
ta: பல தேர்வு (சாத்தியமான தேர்வு)

# types->select
source: Select (un choix possible)
ta: தேர்ந்தெடுக்கவும் (ஒரு தேர்வு சாத்தியம்)

# types->text
source: Texte court
ta: குறுகிய உரை

# types->url
source: URL
ta: முகவரி
