Repository: 247i/TACETr
Catalog: உரை/தானி/noe-dynamic-server-*.po
Languages: ta

# inscription.common.default.description
source: Trouvez votre événement sur NOÉ, l'application des événements participatifs.
ta: பங்கேற்பு நிகழ்வுகளின் பயன்பாடான நோவாவில் உங்கள் நிகழ்வைக் கண்டறியவும்.

# inscription.common.default.title
source: NOÉ
ta: நோவா

# inscription.common.element.description
source: Inscrivez-vous à {{projectName}} sur NOÉ, l'application des événements participatifs.
ta: பங்கேற்பு நிகழ்வுகளின் பயன்பாடான நோவாவில் {{projectName} க்கு க்கு பதிவு செய்யுங்கள்.

# inscription.common.element.title
source: {{elementName}} - {{projectName}} | NOÉ
ta: {{elementName}} - {{projectName}} | நோ

# inscription.common.project.description
source: Inscrivez-vous à {{projectName}} sur NOÉ, l'application des événements participatifs.
ta: பங்கேற்பு நிகழ்வுகளின் பயன்பாடான நோவாவில் {{projectName} க்கு க்கு பதிவு செய்யுங்கள்.

# inscription.common.project.title
source: {{projectName}} | NOÉ
ta: {{projectName}} | நோவா

# orga.common.default.description
source: Votre nouveau QG événementiel.
ta: உங்கள் புதிய நிகழ்வு தலைமையகம்.

# orga.common.default.title
source: NOÉ ORGA
ta: நோவா ஆர்கா

# orga.common.element.description
source: Le nouveau QG événementiel de votre événement {{projectName}}.
ta: உங்கள் நிகழ்வின் புதிய நிகழ்வு தலைமையகம் {{projectName}}.

# orga.common.element.title
source: {{elementName}} | {{projectName}} - NOÉ ORGA
ta: {{elementName}} | {{projectName}} - நோவா ஆர்கா

# orga.common.project.description
source: Le nouveau QG événementiel de votre événement {{projectName}}.
ta: உங்கள் நிகழ்வின் புதிய நிகழ்வு தலைமையகம் {{projectName}}.

# orga.common.project.title
source: {{projectName}} | NOÉ ORGA
ta: {{projectName}} | நோவா ஆர்கா
