Repository: 247i/TACETr
Catalog: உரை/தானி/noe-places-*.po
Languages: ta

# label
source: Espace
ta: இடம்

# label_clone
source: Cloner des espaces
ta: நகலி இடங்கள்

# label_create
source: Créer un espace
ta: ஒரு இடத்தை உருவாக்கவும்

# label_createNew
source: Créer un nouvel espace
ta: புதிய இடத்தை உருவாக்கவும்

# label_edit
source: Modifier un espace
ta: ஒரு இடத்தை மாற்றவும்

# label_groupEdit
source: Édition groupée d'espaces
ta: இடைவெளிகளின் குழு பதிப்பு

# label_other
source: Espaces
ta: இடங்கள்

# schema->availabilitySlots->label
source: Disponibilités
ta: கிடைக்கும் தன்மை

# schema->maxNumberOfParticipants->jaugeOfX
source: jauge de {{count}}
ta: {{count} of இன் பாதை

# schema->maxNumberOfParticipants->label
source: Jauge maximale de personnes
ta: மக்களின் அதிகபட்ச பாதை

# schema->maxNumberOfParticipants->labelShort
source: Jauge max.
ta: அதிகபட்ச பாதை.

# schema->maxNumberOfParticipants->noMaxNumber
source: pas de jauge max.
ta: அதிகபட்சம் இல்லை.

# schema->maxNumberOfParticipants->placeholder
source: jauge
ta: பாதை

# schema->name->label
source: Nom de l'espace
ta: விண்வெளி பெயர்

# schema->summary->label
source: Informations
ta: தகவல்கள்

# schema->summary->placeholder
source: informations
ta: தகவல்கள்
