Repository: 247i/TACETr
Catalog: உரை/தானி/ns8-webserver-*.po
Languages: ta

# common.required
source: Required
ta: தேவை

# common.work_in_progress
source: Work in progress
ta: வேலை முன்னேற்றத்தில் உள்ளது

# common.processing
source: Processing...
ta: செயலாக்கம் ...

# common.enabled
source: Enabled
ta: இயக்கப்பட்டது

# common.disabled
source: Disabled
ta: முடக்கப்பட்டது

# common.eg_value
source: E.g. {value}
ta: எ.கா. {value}

# status.title
source: Status
ta: நிலை

# status.app_instance
source: App instance
ta: பயன்பாட்டு நிகழ்வு

# status.services
source: Service | Services
ta: பணி | சேவைகள்

# status.app_images
source: App image | App images
ta: பயன்பாட்டு படம் | பயன்பாட்டு படங்கள்

# status.app_volumes
source: App volume | App volumes
ta: பயன்பாட்டு தொகுதி | பயன்பாட்டு தொகுதிகள்

# status.installation_node
source: Installation node
ta: நிறுவல் முனை

# status.node
source: Node
ta: கணு

# status.name
source: Name
ta: பெயர்

# status.size
source: Size
ta: அளவு

# status.created
source: Created
ta: உருவாக்கப்பட்டது

# status.mount
source: Mount
ta: மவுண்ட்

# status.no_services
source: No services
ta: சேவைகள் இல்லை

# status.no_images
source: No images
ta: படங்கள் இல்லை

# status.no_volumes
source: No volumes
ta: தொகுதிகள் இல்லை

# status.open_web_admin_page
source: Open SFTPGo WebAdmin
ta: SFTPGO Webadmin ஐத் திறக்கவும்

# status.default_credentials
source: Default credentials
ta: இயல்புநிலை நற்சான்றிதழ்கள்

# status.open_web_client_page
source: Open SFTPGo WebClient
ta: SFTPGO WebClient ஐத் திறக்கவும்

# status.External_sftp_tcp_port
source: External SFTP TCP port
ta: வெளிப்புற SFTP TCP துறைமுகம்

# status.sftpgo_admin_login_tips
source: The default login:password is admin:admin, you must change it at the first login
ta: இயல்புநிலை உள்நுழைவு: கடவுச்சொல் நிர்வாகி: நிர்வாகி, நீங்கள் அதை முதல் உள்நுழைவில் மாற்ற வேண்டும்

# status.sftpgo_user_login_tips
source: The credentials can be found in the virtualhost page
ta: நற்சான்றிதழ்களை மெய்நிகர் புரவலன் பக்கத்தில் காணலாம்

# status.sftp_tcp_port_tips
source: Use SFTPGo or connect a sftp client: sftp -P {port} user@hostname
ta: SFTPGO ஐப் பயன்படுத்தவும் அல்லது ஒரு SFTP கிளையண்டை இணைக்கவும்: SFTP -P {port} பயனர்@ஓச்ட்பெயர்

# status.sftpgo_upload_website
source: Upload your websites
ta: உங்கள் வலைத்தளங்களைப் பதிவேற்றவும்

# status.sftpgo_not_running
source: SFTPGo is not configured
ta: SFTPGO கட்டமைக்கப்படவில்லை

# status.configure_sftpgo
source: Configure SFTPGo
ta: SFTPGO ஐ உள்ளமைக்கவும்

# virtualhosts.advanced
source: Advanced settings
ta: மேம்பட்ட அமைப்புகள்

# virtualhosts.Create_Virtualhosts
source: Create a virtual host
ta: மெய்நிகர் ஓச்டை உருவாக்கவும்

# virtualhosts.ServerNames
source: Virtual host names (FQDN)
ta: மெய்நிகர் புரவலன் பெயர்கள் (FQDN)

# virtualhosts.Write_DomainNames
source: Only allowed [A-Wa-w0-9-.]
ta: [A-WA-W0-9-.] மட்டுமே அனுமதிக்கப்படுகிறது.

# virtualhosts.lets_encrypt
source: Request for a Let's Encrypt certificate
ta: லெட்ச் குறியாக்க சான்றிதழுக்கான கோரிக்கை

# virtualhosts.http_to_https
source: Require SSL encrypted connection
ta: SSL மறைகுறியாக்கப்பட்ட இணைப்பு தேவை

# virtualhosts.enabled
source: Enabled
ta: இயக்கப்பட்டது

# virtualhosts.disabled
source: Disabled
ta: முடக்கப்பட்டது

# virtualhosts.PHP_none
source: PHP is disabled
ta: பிஎச்பி முடக்கப்பட்டுள்ளது

# virtualhosts.PHP_74
source: PHP 7.4
ta: பிஎச்பி 7.4

# virtualhosts.PHP_80
source: PHP 8.0
ta: பிஎச்பி 8.0

# virtualhosts.PHP_81
source: PHP 8.1
ta: பிஎச்பி 8.1

# virtualhosts.PHP_82
source: PHP 8.2
ta: பிஎச்பி 8.2

# virtualhosts.PHP_83
source: PHP 8.3
ta: பிஎச்பி 8.3

# virtualhosts.container_version_will_be_installed
source: Changing PHP version will install a new PHP container: configuration might take a while
ta: பிஎச்பி பதிப்பை மாற்றுவது புதிய பிஎச்பி கொள்கலனை நிறுவும்: உள்ளமைவு சிறிது நேரம் ஆகலாம்

# virtualhosts.select_php_version
source: Version of PHP
ta: பிஎச்பி இன் பதிப்பு

# virtualhosts.AllowUrlfOpen
source: URL-aware fopen wrappers
ta: URL- விழிப்புணர்வு ஃபோபன் ரேப்பர்கள்

# virtualhosts.Indexes
source: Root directory file listings
ta: ரூட் அடைவு கோப்பு பட்டியல்கள்

# virtualhosts.select_php_memory_limit
source: Script memory limit (MB)
ta: ச்கிரிப்ட் நினைவக வரம்பு (எம்பி)

# virtualhosts.select_php_post_max_file_size_limit
source: Maximum POST requests size (MB)
ta: அதிகபட்ச இடுகை கோரிக்கைகள் அளவு (எம்பி)

# virtualhosts.select_php_upload_max_file_limit
source: Maximum file size (MB)
ta: அதிகபட்ச கோப்பு அளவு (எம்பி)

# virtualhosts.select_php_max_execution_time_limit
source: Maximum execution time in seconds (0 is unlimited)
ta: விநாடிகளில் அதிகபட்ச சாவுஒறுப்பு நேரம் (0 வரம்பற்றது)

# virtualhosts.select_php_max_file_upload_limit
source: Maximum file upload number
ta: அதிகபட்ச கோப்பு பதிவேற்ற எண்

# virtualhosts.Min
source: min
ta: மணித்துளி

# virtualhosts.Max
source: max
ta: அதிகபட்சம்

# virtualhosts.save
source: Save
ta: சேமி

# virtualhosts.cancel
source: Cancel
ta: ரத்துசெய்

# virtualhosts.no_virtualhost_configured
source: There is no virtual host configured
ta: மெய்நிகர் புரவலன் கட்டமைக்கப்படவில்லை

# virtualhosts.empty_state_virtualhost_description
source: You have to create a virtual host by clicking the button below
ta: கீழே உள்ள பொத்தானைக் சொடுக்கு செய்வதன் மூலம் நீங்கள் ஒரு மெய்நிகர் ஓச்டை உருவாக்க வேண்டும்

# virtualhosts.create_virtualhost
source: Create a virtual host
ta: மெய்நிகர் ஓச்டை உருவாக்கவும்

# virtualhosts.instance_configuration
source: Applying virtual host settings
ta: மெய்நிகர் புரவலன் அமைப்புகளைப் பயன்படுத்துதல்

# virtualhosts.Disable_virtual_Host
source: Disabling virtual host
ta: மெய்நிகர் ஓச்டை முடக்குதல்

# virtualhosts.configuring
source: Configuring...
ta: உள்ளமைத்தல் ...

# virtualhosts.write_one_domain_per_line
source: One valid domain name per line
ta: ஒரு வரிக்கு ஒரு செல்லுபடியாகும் டொமைன் பெயர்

# virtualhosts.edit
source: Edit
ta: தொகு

# virtualhosts.delete
source: Remove virtual host
ta: மெய்நிகர் ஓச்டை அகற்று

# virtualhosts.please_read_carefully
source: Please read carefully
ta: தயவுசெய்து கவனமாகப் படியுங்கள்

# virtualhosts.disable_virtualhost
source: Disable virtual host
ta: மெய்நிகர் ஓச்டை முடக்கு

# virtualhosts.enable_virtualhost
source: Enable virtual host
ta: மெய்நிகர் ஓச்டை இயக்கவும்

# virtualhosts.Edit_Virtualhosts
source: Edit virtual host {name}
ta: மெய்நிகர் ஓச்டைத் திருத்தவும் {name}

# virtualhosts.title
source: Virtual hosts
ta: மெய்நிகர் ஓச்ட்கள்

# virtualhosts.ServerNames_format
source: Domain name not allowed : {error}
ta: டொமைன் பெயர் அனுமதிக்கப்படவில்லை: {error}

# virtualhosts.ServerNames_pattern
source: Must be a valid fully qualified domain name: {error}
ta: செல்லுபடியாகும் முழு தகுதி வாய்ந்த டொமைன் பெயராக இருக்க வேண்டும்: {error}

# virtualhosts.type_to_confirm
source: Type '{name}' to confirm deletion
ta: நீக்குதலை உறுதிப்படுத்த '{name}' என தட்டச்சு செய்க

# virtualhosts.delete_virtualhosts_confirm
source: Delete virtual host '{name}'? All data will be deleted. This action is NOT reversible
ta: மெய்நிகர் ஓச்டை நீக்கு '{name}'? எல்லா தரவுகளும் நீக்கப்படும். இந்த நடவடிக்கை மீளமுடியாது

# virtualhosts.sftpgo_login_tips
source: The default login:password is {user}:{user}, you must change it at the first login
ta: இயல்புநிலை உள்நுழைவு: கடவுச்சொல் {user}: {user}, நீங்கள் அதை முதல் உள்நுழைவில் மாற்ற வேண்டும்

# virtualhosts.domain_already_used_in_traefik
source: Domain name already used: {error}
ta: ஏற்கனவே பயன்படுத்தப்பட்ட டொமைன் பெயர்: {error}

# virtualhosts.cannot_use_fqdn_of_server
source: Domain name already used by the server FQDN: {error}
ta: சேவையகத்தால் ஏற்கனவே பயன்படுத்தப்படும் டொமைன் பெயர் FQDN: {error}

# virtualhosts.configure_sftpgo
source: Configure SFTPGo
ta: SFTPGO ஐ உள்ளமைக்கவும்

# virtualhosts.sftpgo_is_not_running_description
source: SFTPGo is not running you must configure it by clicking the button below
ta: SFTPGO இயங்கவில்லை, கீழே உள்ள பொத்தானைக் சொடுக்கு செய்வதன் மூலம் அதை உள்ளமைக்க வேண்டும்

# settings.title
source: Settings
ta: அமைப்புகள்

# settings.sftpgo_path
source: SFTPGo web application path
ta: SFTPGO வலை பயன்பாட்டு பாதை

# settings.path_pattern
source: Web path for the web application, like '/sftpgo'
ta: '/SFTPGO' போன்ற வலை பயன்பாட்டிற்கான வலை பாதை

# settings.webpath_already_used_in_traefik
source: This web path is already used by another application in the web proxy.
ta: இந்த வலை பாதை ஏற்கனவே வலை ப்ராக்சியில் மற்றொரு பயன்பாட்டால் பயன்படுத்தப்படுகிறது.

# settings.sftp_tcp_port
source: External sftp TCP port
ta: வெளிப்புற SFTP TCP துறைமுகம்

# settings.sftp_tcp_port_tips
source: This port is needed to connect a sftp client to the sftp server: sftp -P {port} user@hostname
ta: SFTP கிளையண்டை SFTP சேவையகத்துடன் இணைக்க இந்த துறைமுகம் தேவை: SFTP -P {port} பயனர்@ஓச்ட்பெயர்

# settings.save
source: Save
ta: சேமி

# settings.lets_encrypt
source: Let's Encrypt
ta: குறியாக்கம் செய்வோம்

# settings.http_to_https
source: HTTP to HTTPS
ta: Http பெறுநர் https

# settings.enabled
source: Enabled
ta: இயக்கப்பட்டது

# settings.disabled
source: Disabled
ta: முடக்கப்பட்டது

# settings.instance_configuration
source: {instance} configuration
ta: {instance} உள்ளமைவு

# settings.configuring
source: Configuring...
ta: உள்ளமைத்தல் ...

# settings.sftpgo_url
source: Sftpgo web application
ta: SFTPGO வலை பயன்பாடு

# settings.link
source: Link
ta: இணைப்பு

# settings.sftpgo_login_tips
source: The default login:password is admin:admin, you must change it at the first login
ta: இயல்புநிலை உள்நுழைவு: கடவுச்சொல் நிர்வாகி: நிர்வாகி, நீங்கள் அதை முதல் உள்நுழைவில் மாற்ற வேண்டும்

# settings.sftp_tcp_port_number_gte
source: The TCP port must be greater or equal than 1024
ta: TCP துறைமுகம் 1024 ஐ விட அதிகமாகவோ அல்லது சமமாகவோ இருக்க வேண்டும்

# settings.sftp_tcp_port_number_lte
source: The TCP port must be lower or equal than 65535
ta: TCP துறைமுகம் 65535 ஐ விட குறைவாக அல்லது சமமாக இருக்க வேண்டும்

# settings.sftp_tcp_port_invalid_type
source: The TCP port is not valid, it must be an integer in the range 1024-65535
ta: TCP துறைமுகம் செல்லுபடியாகாது, இது 1024-65535 வரம்பில் ஒரு முழு எண்ணாக இருக்க வேண்டும்

# settings.tcp_port_already_used
source: The TCP port is already used by another service
ta: TCP துறைமுகம் ஏற்கனவே மற்றொரு சேவையால் பயன்படுத்தப்படுகிறது

# settings.sftpgo_restrict_port_access
source: SFTPGo external access
ta: SFTPGO வெளிப்புற அணுகல்

# settings.sftpgo_explanation_tooltips
source: SFTPGo provides a user interface and a SFTP service for uploading your websites
ta: SFTPGO உங்கள் வலைத்தளங்களை பதிவேற்ற ஒரு பயனர் இடைமுகத்தையும் SFTP சேவையையும் வழங்குகிறது

# settings.sftpgo_path_tips
source: Enter a unique HTTP path, for example '/sftpgo'
ta: ஒரு தனித்துவமான HTTP பாதையை உள்ளிடவும், எடுத்துக்காட்டாக '/SFTPGO'

# about.title
source: About
ta: பற்றி

# task.cannot_create_task
source: Cannot create task {action}
ta: பணியை உருவாக்க முடியாது {action}

# action.get-status
source: Get status
ta: அந்தச்தைப் பெறுங்கள்

# action.get-configuration
source: Get configuration
ta: உள்ளமைவைப் பெறுங்கள்

# action.configure-module
source: Configure module
ta: தொகுதியை உள்ளமைக்கவும்

# action.get-module-info
source: Get module info
ta: தொகுதி தகவலைப் பெறுங்கள்

# action.get-name
source: Get name
ta: பெயரைப் பெறுங்கள்

# action.list-backup-repositories
source: List backup repositories
ta: காப்புப்பிரதி களஞ்சியங்களை பட்டியலிடுங்கள்

# action.list-backups
source: List backups
ta: காப்புப்பிரதிகளை பட்டியலிடுங்கள்

# action.list-installed-modules
source: List installed modules
ta: நிறுவப்பட்ட தொகுதிகள் பட்டியல்

# action.destroy-vhost
source: Removing virtual host
ta: மெய்நிகர் ஓச்டை நீக்குதல்

# error.error
source: Error
ta: பிழை

# error.generic_error
source: Something went wrong
ta: ஏதோ தவறு நடந்தது

# error.validation_error
source: Validation error
ta: சரிபார்ப்பு பிழை

# error.network_error
source: Network error
ta: பிணைய பிழை

# error.network_timeout
source: Network timeout
ta: பிணைய நேரம் முடிந்தது

# error.401
source: Invalid authentication
ta: தவறான ஏற்பு

# error.403
source: Operation not authorized
ta: செயல்பாடு அங்கீகரிக்கப்படவில்லை

# error.404
source: Resource not found
ta: சான்று கிடைக்கவில்லை

# error.cannot_retrieve_module_info
source: Cannot retrieve module info
ta: தொகுதி தகவலை மீட்டெடுக்க முடியாது

# error.cannot_retrieve_installed_modules
source: Cannot retrieve installed modules
ta: நிறுவப்பட்ட தொகுதிகளை மீட்டெடுக்க முடியாது
