Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: In the modality pages of the OpenREM web interface, if you are in the ``pidgroup`` you will have a filter for patient name and patient ID available:
ta: OpenRem வலை இடைமுகத்தின் முறை பக்கங்களில், நீங்கள் `` pidgroup`` இல் இருந்தால், நோயாளியின் பெயர் மற்றும் நோயாளி ஐடியுக்கு உங்களுக்கு ஒரு வடிகட்டி இருக்கும்:

source: Patient name and ID in search filter
ta: தேடல் வடிகட்டியில் நோயாளியின் பெயர் மற்றும் ஐடி

source: If the values in the database are *not* encrypted, then partial search terms can be used as a case-insensitive 'contains' query will be applied.
ta: தரவுத்தளத்தில் உள்ள மதிப்புகள் * குறியாக்கம் செய்யப்படவில்லை என்றால், பகுதி தேடல் சொற்கள் ஒரு வழக்கு-உணர்வற்றதாக பயன்படுத்தப்படலாம் 'வினவல் பயன்படுத்தப்படும்.

source: If the values are encrypted, then only the entire string, with exactly the same case, spacing and punctuation will match. This is more likely to be successful with patient ID than with patient name.
ta: மதிப்புகள் குறியாக்கம் செய்யப்பட்டால், முழு சரம் மட்டுமே, அதே வழக்குடன், இடைவெளி மற்றும் நிறுத்தற்குறி பொருந்தும். நோயாளியின் பெயரை விட நோயாளியின் ஐடியுடன் இது வெற்றிபெற அதிக வாய்ப்புள்ளது.

source: Study export with patient identifiers
ta: நோயாளி அடையாளங்காட்டிகளுடன் ஏற்றுமதி செய்யுங்கள்

source: Users in the ``pidgroup`` will have extra export buttons available in the modality pages:
ta: `` PIDGroup`` இல் உள்ள பயனர்கள் முறை பக்கங்களில் கூடுதல் ஏற்றுமதி பொத்தான்களைக் கொண்டிருப்பார்கள்:

source: Export buttons for pidgroup users
ta: பிட் குழும பயனர்களுக்கான பொத்தான்கள்

source: If the IDs or names are encrypted, then these columns will contain the hash rather than the original values. However, it will be possible to see if more than one study belongs to one patient as the values should be the same for both. Due to the nature of the algorithm however, a single change in the name or ID - such as an upper case letter instead of a lower case one - will be recorded as a completely different hash value.
ta: ஐடிகள் அல்லது பெயர்கள் குறியாக்கம் செய்யப்பட்டால், இந்த நெடுவரிசைகளில் அசல் மதிப்புகளை விட ஆச் இருக்கும். இருப்பினும், ஒன்றுக்கு மேற்பட்ட ஆய்வுகள் ஒரு நோயாளிக்கு சொந்தமானதா என்பதைப் பார்க்க முடியும், ஏனெனில் மதிப்புகள் இருவருக்கும் ஒரே மாதிரியாக இருக்க வேண்டும். இருப்பினும், வழிமுறையின் தன்மை காரணமாக, பெயர் அல்லது ஐடியில் ஒரு மாற்றம் - ஒரு சிறிய வழக்குக்கு பதிலாக மேல் வழக்கு கடிதம் போன்றவை - முற்றிலும் மாறுபட்ட ஆச் மதிப்பாக பதிவு செய்யப்படும்.

source: Any exports with either patient name or patient ID included will also have a date of birth column.
ta: நோயாளியின் பெயர் அல்லது நோயாளி ஐடி கொண்ட எந்த ஏற்றுமதியும் பிறப்பு நெடுவரிசை தேதி இருக்கும்.

source: OpenREM Release Notes version 0.10.0
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.10.0

source: Headline changes
ta: தலைப்பு மாற்றங்கள்

source: Database: new summary fields introduced to improve the responsiveness of the interface - requires additional migration step
ta: தரவுத்தளம்: இடைமுகத்தின் மறுமொழியை மேம்படுத்த அறிமுகப்படுத்தப்பட்ட புதிய சுருக்கம் புலங்கள் - கூடுதல் இடம்பெயர்வு படி தேவை

source: Imports: enabled import of GE Elite Mini View C-arm, Opera Swing R/F and Philips BigBore CT RDSRs that have issues
ta: இறக்குமதிகள்: சி.இ எலைட் மினி வியூ சி-ஆர்ம், ஓபரா ச்விங் ஆர்/எஃப் மற்றும் பிலிப்ச் பிக்போர் சி.டி ஆர்.டி.எச்.ஆர்.எச்

source: Imports: updated event level laterality to import from new location after DICOM standard change proposal CP1676_
ta: இறக்குமதி: DICOM நிலையான மாற்ற முன்மொழிவுக்குப் பிறகு புதிய இடத்திலிருந்து இறக்குமதி செய்ய நிகழ்வு நிலை பக்கவாட்டு புதுப்பிக்கப்பட்டது CP1676_

source: Interface: highlight row when dose alert exceeded
ta: இடைமுகம்: டோச் எச்சரிக்கை மீறும்போது வரிசையை முன்னிலைப்படுத்தவும்

source: Exports: added fluoroscopy and radiography exports tailored for UK PHE dose survey
ta: ஏற்றுமதி: யுகே PHE டோச் கணக்கெடுப்புக்கு ஏற்றவாறு ஃப்ளோரோச்கோபி மற்றும் ரேடியோகிராஃபி ஏற்றுமதிகள் சேர்க்கப்பட்டன

source: General: Lots of fixes to imports, interface, charts etc
ta: பொது: இறக்குமதி, இடைமுகம், விளக்கப்படங்கள் போன்றவற்றுக்கு நிறைய திருத்தங்கள்

source: Upgrade to current version
ta: தற்போதைய பதிப்பிற்கு மேம்படுத்தவும்

source: :doc:`upgrade_previous_0.10.0` and then upgrade to 1.0.
ta: : டாக்: `மேம்படுத்தல்_பிரெவியச்_0.10.0` பின்னர் 1.0 ஆக மேம்படுத்தவும்.

source: Original upgrade instructions
ta: அசல் மேம்படுத்தல் வழிமுறைகள்

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.10.0.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்க்க கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.10.0.html>` _

source: OpenREM Release Notes version 0.4.0
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.4.0

source: User authentication has been added
ta: பயனர் ஏற்பு சேர்க்கப்பட்டுள்ளது

source: Studies can be deleted from the web interface
ta: வலை இடைமுகத்திலிருந்து ஆய்வுகளை நீக்க முடியும்

source: Import scripts can now be passed a list of files, eg ``python openrem_rdsr.py *.dcm``
ta: இறக்குமதி ச்கிரிப்ட்களை இப்போது கோப்புகளின் பட்டியலில் அனுப்பலாம், எ.கா.

source: Date of birth no longer retained for mammography (bug fix - correct behaviour already existed for other imports)
ta: பிறப்பு தேதி இனி மேமோகிராஃபிக்கு தக்கவைக்கப்படாது (பிழை பிழைத்திருத்தம் - பிற இறக்குமதிகளுக்கு சரியான நடத்தை ஏற்கனவே இருந்தது)

source: General bug fixes to enable import from wider range of sources
ta: பரந்த அளவிலான மூலங்களிலிருந்து இறக்குமதி செய்ய பொது பிழை திருத்தங்கள்

source: Improved user documentation
ta: மேம்படுத்தப்பட்ட பயனர் ஆவணங்கள்

source: Specific upgrade instructions
ta: குறிப்பிட்ட மேம்படுத்தல் வழிமுறைகள்

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.4.0.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்க்க கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.4.0.html>` _

source: OpenREM Release Notes version 0.4.1
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.4.1

source: This release is exacly the same as 0.4.1 bar some documentation corrections
ta: இந்த வெளியீடு 0.4.1 பட்டி சில ஆவணப்படுத்தல் திருத்தங்களுக்கு சமம்

source: **Please use the 0.4.0 release notes for upgrades from 0.3.9**
ta: ** 0.3.9 ** இலிருந்து மேம்படுத்தலுக்கான 0.4.0 வெளியீட்டுக் குறிப்புகளைப் பயன்படுத்தவும் **

source: :doc:`release-0.4.0`
ta: : டாக்: `வெளியீடு -0.4.0`

source: OpenREM Release Notes version 0.4.2
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.4.2

source: This release fixes a major bug introduced in 0.4.0 regarding the import scripts.
ta: இந்த வெளியீடு இறக்குமதி ச்கிரிப்ட்கள் தொடர்பாக 0.4.0 இல் அறிமுகப்படுத்தப்பட்ட ஒரு பெரிய பிழையை சரிசெய்கிறது.

source: Upgrading from 0.3.9 or earlier
ta: 0.3.9 அல்லது அதற்கு முன்னர் மேம்படுத்தும்

source: Follow the instructions in :doc:`release-0.4.0`
ta: இதில் வழிமுறைகளைப் பின்பற்றவும்: DOC: `வெளியீடு -0.4.0`

source: Upgrading from 0.4.0 or above
ta: 0.4.0 அல்லது அதற்கு மேல் இருந்து மேம்படுத்தும்

source: Move straight to version 0.4.3 and follow the instructions in :doc:`release-0.4.3`
ta: பதிப்பு 0.4.3 க்கு நேராக நகர்ந்து இதில் வழிமுறைகளைப் பின்பற்றவும்: டாக்: `வெளியீடு -0.4.3`

source: OpenREM Release Notes version 0.4.3
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.4.3

source: Export of study information is now handled by a task queue - no more export time-outs.
ta: ஆய்வுத் தகவல்களின் ஏற்றுமதி இப்போது ஒரு பணி வரிசையால் கையாளப்படுகிறது - அதிக ஏற்றுமதி நேரங்கள் இல்லை.

source: Patient size information in csv files can now be uploaded and imported via a web interface.
ta: சி.எச்.வி கோப்புகளில் உள்ள நோயாளியின் அளவு தகவல்களை இப்போது பதிவு செய்து வலை இடைமுகம் வழியாக இறக்குமதி செய்யலாம்.

source: Proprietary projection image object created by Hologic tomography units can now be interrogated for details of the tomosynthesis exam.
ta: ஓலோசிக் டோமோகிராஃபி அலகுகளால் உருவாக்கப்பட்ட தனியுரிம திட்ட பட பொருள் இப்போது டோமோசைன்டெசிச் தேர்வின் விவரங்களுக்கு விசாரிக்கப்படலாம்.

source: Settings.py now ships with its proper name, this will overwrite important local settings if upgrade is from 0.3.9 or earlier.
ta: Settings.py இப்போது அதன் சரியான பெயருடன் அனுப்பப்படுகிறது, மேம்படுத்தல் 0.3.9 அல்லது அதற்கு முந்தையதாக இருந்தால் இது முக்கியமான உள்ளக அமைப்புகளை மேலெழுதும்.

source: Time since last study is no longer wrong just because of daylight saving time!
ta: பகல் சேமிப்பு நேரத்தின் காரணமாக கடைசி ஆய்வுக்குப் பின்னர் நேரம் தவறாக இல்லை!

source: Django release set to 1.6; OpenREM isn't ready for Django 1.7 yet
ta: சாங்கோ வெளியீடு 1.6 ஆக அமைக்கப்பட்டுள்ளது; சாங்கோ 1.7 க்கு ஓபன்ரெம் தயாராக இல்லை

source: The inner ``openrem`` Django project folder is now called ``openremproject`` to avoid import conflicts with Celery on Windows
ta: சாளரங்களில் செலரியுடன் இறக்குமதி மோதல்களைத் தவிர்க்க உள் `` OpenRem` `சாங்கோ திட்ட கோப்புறை இப்போது` `OpenRemproject`` என்று அழைக்கப்படுகிறது

source: DEBUG mode now defaults to False
ta: பிழைத்திருத்த பயன்முறை இப்போது பொய்யுக்கு இயல்புநிலையாகிறது

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.4.3.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்க்க கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.4.3.html>` _

source: OpenREM Release Notes version 0.5.0
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.5.0

source: Import, display and export of CR/DX data from image headers
ta: பட தலைப்புகளிலிருந்து CR/DX தரவை இறக்குமதி செய்தல், காண்பித்தல் மற்றும் ஏற்றுமதி செய்தல்

source: Export of study data from fluoroscopy to xlsx files
ta: ஃப்ளோரோச்கோபியிலிருந்து எக்ச்எல்எச்எக்ச் கோப்புகளுக்கு ஆய்வு தரவை ஏற்றுமதி செய்யுங்கள்

source: Importing data from Windows using ``*.dcm`` style wildcards
ta: ``*.Dcm`` பாணி ​​வைல்டு கார்டுகளைப் பயன்படுத்தி விண்டோசிலிருந்து தரவை இறக்குமதி செய்தல்

source: Hologic tomography projection images are no longer excluded if part of a Combo exposure
ta: காம்போ வெளிப்பாட்டின் ஒரு பகுதியாக இருந்தால் ஓலோசிக் டோமோகிராஃபி ப்ரொசெக்சன் படங்கள் இனி விலக்கப்படாது

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.5.0.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்ப்பதற்கான கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.5.0.html>` _

source: OpenREM Release Notes version 0.5.1
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.5.1

source: Major database modification to remove table name length errors
ta: அட்டவணை பெயர் நீள பிழைகளை அகற்ற முக்கிய தரவுத்தள மாற்றம்

source: Extended the field value lengths to better incorporate all possible values and decimal places
ta: சாத்தியமான அனைத்து மதிப்புகளையும் தசம இடங்களையும் சிறப்பாக இணைக்க புல மதிப்பு நீளங்களை நீட்டித்தது

source: Improved import of grid and filter information from DX images
ta: டிஎக்ச் படங்களிலிருந்து கட்டம் மற்றும் வடிகட்டி தகவல்களின் மேம்பட்ட இறக்குமதி

source: Improved DX summary and detail web pages
ta: மேம்படுத்தப்பட்ட டிஎக்ச் சுருக்கம் மற்றும் விவரம் வலைப்பக்கங்கள்

source: Any item in a row can now be clicked to move between the home and filtered pages
ta: ஒரு வரிசையில் உள்ள எந்தவொரு பொருளும் இப்போது வீடு மற்றும் வடிகட்டப்பட்ட பக்கங்களுக்கு இடையில் செல்ல சொடுக்கு செய்யலாம்

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.5.1.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்க்க கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.5.1.html>` _

source: OpenREM Release Notes version 0.6.0
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.6.0

source: Preview of DICOM Store SCP functionality
ta: DICOM STOR SCP செயல்பாட்டின் முன்னோட்டம்

source: Exports available to import into `openSkin`_
ta: `ஓபன்ச்கின்`_ க்கு இறக்குமதி செய்ய ஏற்றுமதி கிடைக்கிறது

source: Modalities with no data are hidden in the user interface
ta: தரவு இல்லாத முறைகள் பயனர் இடைமுகத்தில் மறைக்கப்படுகின்றன

source: Mammography import compression force behaviour changed
ta: மேமோகிராஃபி இறக்குமதி சுருக்க ஆற்றல் நடத்தை மாற்றப்பட்டது

source: Import of Toshiba planar RDSRs fixed
ta: தோசிபா பிளானர் ஆர்.டி.எச்.ஆர்களின் இறக்குமதி சரி செய்யப்பட்டது

source: Changes for 0.6.2
ta: 0.6.2 க்கான மாற்றங்கள்

source: Minor update due prevent new installs from installing a non-compatible version of ``django-filter``. The link to `openSkin`_ has also been updated in the fluoroscopy detail page.
ta: சிறிய புதுப்பிப்பு காரணமாக புதிய நிறுவல்கள் `` சாங்கோ-வடிகட்டி`` இன் இணக்கமற்ற பதிப்பை நிறுவுவதைத் தடுக்கின்றன. `ஓபன்ச்கின்`_ க்கான இணைப்பு ஃப்ளோரோச்கோபி விவரம் பக்கத்திலும் புதுப்பிக்கப்பட்டுள்ளது.

source: **There is no advantage to updating to this version over 0.6.0**
ta: ** இந்த பதிப்பிற்கு 0.6.0 ** க்கு மேல் புதுப்பிக்க எந்த நன்மையும் இல்லை **

source: Release 0.6.1 was just a documentation only change to update the link to `openSkin`_.
ta: வெளியீடு 0.6.1 என்பது `ஓபன்ச்கின்`_ இணைப்பைப் புதுப்பிக்க மட்டுமே ஒரு ஆவணமாக்கல் மாற்றமாகும்.

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.6.0.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்ப்பதற்கான கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.6.0.html>` _

source: Summary of new features
ta: புதிய அம்சங்களின் சுருக்கம்

source: Release 0.6.0 has a range of charting options available for CT and radiographic data. These charts allow visualisation of trends and frequencies to inform surveys and monitor performance. For more information, please see :doc:`charts`.
ta: வெளியீடு 0.6.0 சி.டி மற்றும் ரேடியோகிராஃபிக் தரவுகளுக்கு தரவரிசை விருப்பங்களின் வரம்பைக் கொண்டுள்ளது. இந்த விளக்கப்படங்கள் போக்குகள் மற்றும் அதிர்வெண்களின் காட்சிப்படுத்தலை ஆய்வுகள் மற்றும் செயல்திறனைக் கண்காணிக்க அனுமதிக்கின்றன. மேலும் தகவலுக்கு, தயவுசெய்து பார்க்கவும்: DOC: `விளக்கப்படங்கள்`.

source: DICOM Store Service Class Provider
ta: டிகாம் கடை பணி வகுப்பு வழங்குநர்

source: OpenREM can now act as the DICOM Store service, allowing direct sending of DICOM objects from modalities to OpenREM without needing to use Conquest or any other DICOM Store SCP. This feature is a preview as it hasn't been extensively tested, but it is expected to work. For more information, please see :ref:`directfrommodalities`.
ta: ஓபன்ரெம் இப்போது டிகாம் கடை சேவையாக செயல்பட முடியும், இது செய் அல்லது வேறு எந்த டிகாம் கடை எச்.சி.பி. இந்த நற்பொருத்தம் ஒரு முன்னோட்டமாகும், ஏனெனில் இது விரிவாக சோதிக்கப்படவில்லை, ஆனால் அது வேலை செய்யும் என்று எதிர்பார்க்கப்படுகிறது. மேலும் தகவலுக்கு, தயவுசெய்து பார்க்கவும்: ref: `டைரக்ட்ஃபிரூமோடாலிட்டீச்`.

source: Exports for openSkin
ta: ஓபன்ச்கின் ஏற்றுமதி

source: Fluoroscopy studies can now be exported in a format suitable for importing into Jonathan Cole's openSkin software. The export link is on the fluoroscopy study detail page. The software for creating the exposure incidence map can be downloaded from https://bitbucket.org/openskin/openskin/downloads (choose the zip file), and information about the project can be found on the `openSkin wiki`_. The software allows the user to choose between a 2D phantom that would represent the dose to a film laying on the couch surface, or a simple 3D phantom made up of a cuboid and two semi-cylinders (these can be seen on the `Phantom design`_ section of the wiki). For both options the output is an image of the dose distribution in 2D, along with calculated peak skin dose information.
ta: ஃப்ளோரோச்கோபி ஆய்வுகள் இப்போது சொனாதன் கோலின் ஓபன்ச்கின் மென்பொருளில் இறக்குமதி செய்வதற்கு ஏற்ற வடிவத்தில் ஏற்றுமதி செய்யப்படலாம். ஏற்றுமதி இணைப்பு ஃப்ளோரோச்கோபி ஆய்வு விவரம் பக்கத்தில் உள்ளது. வெளிப்பாடு நிகழ்வு வரைபடத்தை உருவாக்குவதற்கான மென்பொருளை https://bitbucket.org/openskin/openskin/downloads (சிப் கோப்பைத் தேர்வுசெய்க) இருந்து பதிவிறக்கம் செய்யலாம், மேலும் திட்டத்தைப் பற்றிய தகவல்களை `ஓபன்ச்கின் விக்கி`_ இல் காணலாம். படுக்கை மேற்பரப்பில் இடும் படத்திற்கு டோசைக் குறிக்கும் 2 டி பாண்டம் அல்லது ஒரு க்யூபாய்டு மற்றும் இரண்டு அரை சிலிண்டர்களால் ஆன எளிய 3 டி பாண்டம் ஆகியவற்றைக் குறிக்கும் 2 டி பாண்டம் இடையே தேர்வு செய்ய மென்பொருள் அனுமதிக்கிறது (இவற்றை `பாண்டம் வடிவமைப்பில் காணலாம் `_ விக்கியின் பிரிவு). இரண்டு விருப்பங்களுக்கும் வெளியீடு என்பது 2D இல் உள்ள டோச் விநியோகத்தின் ஒரு படமாகும், மேலும் கணக்கிடப்பட்ட உச்ச தோல் டோச் தகவலுடன்.

source: Automatic hiding of unused modality types
ta: பயன்படுத்தப்படாத முறை வகைகளை தானாக மறைத்தல்

source: A fresh install of OpenREM will no longer show any of the four modality types in the tables or in the navigation bar at the top. As DICOM objects are ingested, the appropriate tables and navigation links are created.
ta: ஓபன்ரெமின் புதிய நிறுவல் இனி அட்டவணையில் அல்லது மேலே உள்ள வழிசெலுத்தல் பட்டியில் நான்கு முறை வகைகளில் எதையும் காட்டாது. DICOM பொருள்கள் உட்கொள்ளப்படுவதால், பொருத்தமான அட்டவணைகள் மற்றும் வழிசெலுத்தல் இணைப்புகள் உருவாக்கப்படுகின்றன.

source: Therefore a site that has no mammography for example will no longer have that table or navigation link in their interface.
ta: எனவே மேமோகிராஃபி இல்லாத ஒரு தளத்திற்கு இனி அந்த அட்டவணை அல்லது வழிசெலுத்தல் இணைப்பு இருக்காது.

source: Mammography import compression force change
ta: மேமோகிராஃபி இறக்குமதி சுருக்க ஆற்றல் மாற்றம்

source: Prior to version 0.6, the compression force extracted from the mammography image header was divided by ten before being stored in the database. This was because the primary author only had access to GE Senograph DS units, which store the compression force in dN, despite claiming using Newtons in the DICOM conformance statement.
ta: பதிப்பு 0.6 க்கு முன்னர், மேமோகிராஃபி பட தலைப்பிலிருந்து பிரித்தெடுக்கப்பட்ட சுருக்க ஆற்றல் தரவுத்தளத்தில் சேமிக்கப்படுவதற்கு முன்பு பத்து மூலம் பிரிக்கப்பட்டது. ஏனென்றால், முதன்மை எழுத்தாளருக்கு சி.இ. செனோகிராஃப் டி.எச் அலகுகளுக்கு மட்டுமே அணுகல் இருந்தது, இது டி.என்.

source: The code now checks for the term *senograph ds* contained in the model name. If it matches, then the value is divided by ten. Otherwise, the value is stored without any further change. We know that later GE units, the GE Senograph Essential for example, and other manufacturer's units store this value in N. If you have a case that acts like the Senograph DS, please let us know and we'll try and cater for that.
ta: மாதிரி பெயரில் உள்ள * செனோகிராஃப் டிஎச் * என்ற வார்த்தையை இப்போது குறியீடு சரிபார்க்கிறது. அது பொருந்தினால், மதிப்பு பத்து ஆல் வகுக்கப்படுகிறது. இல்லையெனில், மதிப்பு மேலும் எந்த மாற்றமும் இல்லாமல் சேமிக்கப்படுகிறது. பின்னர் சி.இ.

source: If you have existing non-GE Senograph mammography data in your database, the compression force field for those studies is likely to be incorrect by a factor of ten (it will be too small). Studies imported after the upgrade will be correct. If this is a problem for you, please let us know and we'll see about writing a script to correct the existing data.
ta: உங்கள் தரவுத்தளத்தில் ஏற்கனவே சி.இ. அல்லாத செனோகிராஃப் மேமோகிராஃபி தரவு இருந்தால், அந்த ஆய்வுகளுக்கான சுருக்க ஆற்றல் புலம் பத்து காரணிகளால் தவறாக இருக்கக்கூடும் (இது மிகவும் சிறியதாக இருக்கும்). மேம்படுத்தலுக்குப் பிறகு இறக்குமதி செய்யப்பட்ட ஆய்வுகள் சரியாக இருக்கும். இது உங்களுக்கு ஒரு பிரச்சினையாக இருந்தால், தயவுசெய்து எங்களுக்குத் தெரியப்படுத்துங்கள், ஏற்கனவே உள்ள தரவை சரிசெய்ய ஒரு ச்கிரிப்டை எழுதுவது பற்றி பார்ப்போம்.

source: Import of Toshiba Planar RDSRs fixed
ta: தோசிபா பிளானர் ஆர்.டி.எச்.ஆர்களின் இறக்குமதி சரி செய்யப்பட்டது

source: Toshiba include Patient Orientation and Patient Orientation Modifier information in their cath lab RDSRs. The extractor code was deficient for this as the RDSRs previously used didn't have this information. This has now been fixed. There might however be an issue with Station Name not being provided - it is not yet clear if this is a configuration issue.
ta: தோசிபாவில் நோயாளி நோக்குநிலை மற்றும் நோயாளி நோக்குநிலை மாற்றியமைக்கும் தகவல்கள் அவற்றின் கேத் லேப் ஆர்.டி.எச்.ஆர்.எச். முன்னர் பயன்படுத்தப்பட்ட ஆர்.டி.எச்.ஆர்.எச் இந்த செய்தி இல்லாததால் பிரித்தெடுத்தல் குறியீடு இதற்கு குறைபாடுடையது. இது இப்போது சரி செய்யப்பட்டது. இருப்பினும் நிலைய பெயர் வழங்கப்படாத நிலையில் ஒரு சிக்கல் இருக்கலாம் - இது ஒரு உள்ளமைவு சிக்கலா என்பது இன்னும் தெளிவாகத் தெரியவில்லை.

source: OpenREM Release Notes version 0.7.1
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.7.1

source: System
ta: மண்டலம்

source: Django upgraded to version 1.8
ta: சாங்கோ பதிப்பு 1.8 க்கு மேம்படுத்தப்பட்டது

source: Median function added to the database if using PostgreSQL
ta: Postgresql ஐப் பயன்படுத்தினால் தரவுத்தளத்தில் சராசரி செயல்பாடு சேர்க்கப்பட்டது

source: New user-defined display name for each unique system so that rooms with the same DICOM station name are displayed separately
ta: ஒவ்வொரு தனித்துவமான அமைப்பிற்கும் புதிய பயனர் வரையறுக்கப்பட்ட காட்சி பெயர், இதனால் ஒரே டிகாம் நிலைய பெயர் கொண்ட அறைகள் தனித்தனியாக காட்டப்படும்

source: Patient name and ID can optionally be stored in system, available for searching and export, but not displayed
ta: நோயாளியின் பெயர் மற்றும் ஐடி விருப்பமாக கணினியில் சேமிக்கப்படலாம், தேடுவதற்கும் ஏற்றுமதி செய்வதற்கும் கிடைக்கின்றன, ஆனால் காட்டப்படாது

source: Patient name, ID and accession number can be stored as a one-way hash, and remain searchable
ta: நோயாளியின் பெயர், ஐடி மற்றும் அணுகல் எண்ணை ஒரு வழி ஆசாக சேமித்து, தேடக்கூடியதாக இருக்கும்

source: Permission system has become more granular
ta: இசைவு அமைப்பு மேலும் சிறுமணி ஆகிவிட்டது

source: System can now accept non-ASCII characters in protocol names etc
ta: நெறிமுறை பெயர்கள் போன்றவற்றில் கணினி இப்போது ASCII அல்லாத எழுத்துக்களை ஏற்க முடியும்

source: Menus have been tidied up
ta: மெனுக்கள் நேர்த்தியாக உள்ளன

source: Settings file has been updated
ta: அமைப்புகள் கோப்பு புதுப்பிக்கப்பட்டுள்ளது

source: Charts and interface
ta: விளக்கப்படங்கள் மற்றும் இடைமுகம்

source: Bar chart data points sorted by frequency, value or name in ascending or descending order
ta: பட்டி விளக்கப்படம் தரவு புள்ளிகள் அதிர்வெண், மதிப்பு அல்லது பெயர் ஏறுவரிசை அல்லது இறங்கு வரிசையில் வரிசைப்படுத்தப்படுகின்றன

source: CT chart of DLP per requested procedure type
ta: கோரப்பட்ட செயல்முறை வகைக்கு டி.எல்.பியின் சி.டி விளக்கப்படம்

source: CT chart of requested procedure frequency
ta: கோரப்பட்ட செயல்முறை அதிர்வெண்ணின் CT விளக்கப்படம்

source: CT chart of CTDIvol per study description
ta: ஒரு ஆய்வு விளக்கத்திற்கு CTDIVOL இன் CT விளக்கப்படம்

source: Chart data returned using AJAX to make pages more responsive
ta: பக்கங்களை மேலும் பதிலளிக்க அசாக்சைப் பயன்படுத்தி விளக்கப்படத் தரவு திரும்பியது

source: Chart plotting options available via Config menu
ta: விளக்கப்பட சூழ்ச்சி விருப்பங்கள் கட்டமைப்பு பட்டியல் வழியாக கிடைக்கின்றன

source: Charts can now be made full-screen
ta: விளக்கப்படங்களை இப்போது முழுத் திரையில் மாற்றலாம்

source: CTDIw phantom size is displayed with the CTDIvol measurement on the CT study detail page
ta: CTDIW பாண்டம் அளவு CT ஆய்வு விவரம் பக்கத்தில் CTDIVOL அளவீட்டுடன் காட்டப்படும்

source: Charts show a series called "Blank" when the series name is ``None``
ta: தொடரின் பெயர் `` எதுவுமில்லை`` இருக்கும்போது "வெற்று" என்ற தொடரை விளக்கப்படங்கள் காண்பிக்கின்றன

source: Queries for chart data now faster in most situations
ta: விளக்கப்பட தரவுகளுக்கான வினவல்கள் இப்போது பெரும்பாலான சூழ்நிலைகளில் வேகமாக

source: Histograms can be disabled or enabled for bar charts
ta: இச்டோகிராம்களை முடக்கலாம் அல்லது பார் விளக்கப்படங்களுக்கு இயக்கலாம்

source: User-specified number of histogram bins from 2 to 40
ta: 2 முதல் 40 வரையிலான இச்டோகிராம் தொட்டிகளின் பயனர் குறிப்பிட்ட எண்ணிக்கை

source: Mammography chart of average glandular dose vs. compressed thickness
ta: சராசரி சுரப்பி டோச் மற்றும் சுருக்கப்பட்ட தடிமன் மேமோகிராஃபி விளக்கப்படம்
