Repository: 247i/TACETr
Catalog: உரை/தானி/openorienteering-mapper-*.po
Languages: ta

# OpenOrienteering::TemplateListWidget
source: Don't scale
ta: அளவிட வேண்டாம்

# OpenOrienteering::TemplateListWidget
source: Scale by nominal map scale ratio (%1 %)
ta: பெயரளவு வரைபட அளவிலான விகிதத்தால் ( %1 %) அளவுகோல்

# OpenOrienteering::TemplateListWidget
source: Georeferenced
ta: புவிநூல்

# OpenOrienteering::TemplateListWidget
source: Cannot open template %1: %2
ta: வார்ப்புருவைத் திறக்க முடியாது %1: %2

# OpenOrienteering::TemplateListWidget
source: File format not recognized.
ta: கோப்பு வடிவம் அங்கீகரிக்கப்படவில்லை.

# OpenOrienteering::TemplateListWidget
source: Vectorize lines
ta: திசையன் கோடுகள்

# OpenOrienteering::TemplateListWidget
source: Failed to load template. Does the file exist and is it valid?
ta: வார்ப்புருவை ஏற்றுவதில் தோல்வி. கோப்பு இருக்கிறதா, அது செல்லுபடியாகும்?

# OpenOrienteering::TemplateListWidget
source: Cannot load map file, aborting.
ta: வரைபடக் கோப்பை ஏற்ற முடியாது, கருக்கலைப்பு.

# OpenOrienteering::TemplateListWidget
source: Warning
ta: எச்சரிக்கை

# OpenOrienteering::TemplateListWidget
source: The map import generated warnings.
ta: வரைபட இறக்குமதி எச்சரிக்கைகளை உருவாக்கியது.

# OpenOrienteering::TemplateListWidget
source: Scale by current template scaling (%1 %)
ta: தற்போதைய வார்ப்புரு அளவிடுதல் ( %1 %) மூலம் அளவுகோல்

# OpenOrienteering::TemplateListWidget
source: Template import
ta: வார்ப்புரு இறக்குமதி

# OpenOrienteering::TemplateListWidget
source: How shall the symbols of the imported template map be scaled?
ta: இறக்குமதி செய்யப்பட்ட வார்ப்புரு வரைபடத்தின் சின்னங்கள் எவ்வாறு அளவிடப்படும்?

# OpenOrienteering::TemplateListWidget
source: The template will be invisible in the overprinting simulation. Switch to normal view?
ta: அதிகப்படியான அச்சிடுதலில் வார்ப்புரு கண்ணுக்கு தெரியாததாக இருக்கும். சாதாரண பார்வைக்கு மாறவா?

# OpenOrienteering::TemplateListWidget
source: Cannot change the georeferencing state.
ta: புவிசார் நிலையை மாற்ற முடியாது.

# OpenOrienteering::TemplateListWidget
source: - Map -
ta: - வரைபடம் -

# OpenOrienteering::TemplateMap
source: Failed to transform the coordinates.
ta: ஆயங்களை மாற்றுவதில் தோல்வி.

# OpenOrienteering::TemplateMap
source: Cannot load map file, aborting.
ta: வரைபடக் கோப்பை ஏற்ற முடியாது, கருக்கலைப்பு.

# OpenOrienteering::TemplateMoveTool
source: <b>Drag</b> to move the current template
ta: <b> இழுத்து </b> தற்போதைய வார்ப்புருவை நகர்த்த

# OpenOrienteering::TemplatePlaceholder
source: Unknown file format
ta: தெரியாத கோப்பு வடிவம்

# OpenOrienteering::TemplatePositionDockWidget
source: Positioning
ta: பொருத்துதல்

# OpenOrienteering::TemplatePositionDockWidget
source: Y:
ta: ஒய்:

# OpenOrienteering::TemplatePositionDockWidget
source: X-Scale:
ta: ஃச் அளவிலான:

# OpenOrienteering::TemplatePositionDockWidget
source: Y-Scale:
ta: Y- அளவிலான:

# OpenOrienteering::TemplatePositionDockWidget
source: Rotation:
ta: சுழற்சி:

# OpenOrienteering::TemplatePositionDockWidget
source: Shear:
ta: வெட்டு:

# OpenOrienteering::TemplatePositioningDialog
source: Track scaling and positioning
ta: கண்காணிப்பு மற்றும் பொருத்துதல்

# OpenOrienteering::TemplatePositioningDialog
source: Coordinate system
ta: ஒருங்கிணைப்பு அமைப்பு

# OpenOrienteering::TemplatePositioningDialog
source: Real
ta: உண்மையான

# OpenOrienteering::TemplatePositioningDialog
source: Map
ta: வரைபடம்

# OpenOrienteering::TemplatePositioningDialog meters
source: m
ta: மீ

# OpenOrienteering::TemplatePositioningDialog
source: One coordinate unit equals:
ta: ஒரு ஒருங்கிணைப்பு அலகு சமம்:

# OpenOrienteering::TemplatePositioningDialog
source: Position track at given coordinates
ta: கொடுக்கப்பட்ட ஆயத்தொகுதிகளில் நிலை பாதை

# OpenOrienteering::TemplatePositioningDialog
source: Position track at view center
ta: பார்வை மையத்தில் நிலை தடம்

# OpenOrienteering::TemplateTrack
source: Track
ta: மின்தடம்

# OpenOrienteering::TemplateTrack
source: Route
ta: பாதை

# OpenOrienteering::TemplateTrack
source: Waypoint
ta: பாதைப்புள்ளி

# OpenOrienteering::TemplateTrack
source: This template must be loaded with GDAL/OGR.
ta: இந்த வார்ப்புரு GDAL/OGR உடன் ஏற்றப்பட வேண்டும்.

# OpenOrienteering::TemplateTrack
source: Opening track ...
ta: திறக்கும் பாதையில் ...

# OpenOrienteering::TemplateTrack
source: Load the track in georeferenced or non-georeferenced mode?
ta: புவிசார் அல்லது புவிசார் அல்லாத பயன்முறையில் பாதையை ஏற்றவா?

# OpenOrienteering::TemplateTrack
source: Positions the track according to the map's georeferencing settings.
ta: வரைபடத்தின் புவிசார் அமைப்புகளின் படி பாதையை நிலைநிறுத்துகிறது.

# OpenOrienteering::TemplateTrack
source: These are not configured yet, so they will be shown as the next step.
ta: இவை இன்னும் கட்டமைக்கப்படவில்லை, எனவே அவை அடுத்த கட்டமாகக் காண்பிக்கப்படும்.

# OpenOrienteering::TemplateTrack
source: Georeferenced
ta: புவிநூல்

# OpenOrienteering::TemplateTrack
source: Non-georeferenced
ta: அழகற்றது

# OpenOrienteering::TemplateTrack
source: Projects the track using an orthographic projection with center at the track's coordinate average. Allows adjustment of the transformation and setting the map georeferencing using the adjusted track position.
ta: டிராக்கின் ஒருங்கிணைப்பு சராசரியில் மையத்துடன் ஒரு ஆர்த்தோகிராஃபிக் திட்டத்தைப் பயன்படுத்தி பாதையை திட்டமிடுகிறது. மாற்றத்தை சரிசெய்ய அனுமதிக்கிறது மற்றும் சரிசெய்யப்பட்ட பாதையின் நிலையைப் பயன்படுத்தி வரைபட சியோர்ஃபெரென்சிங்கை அமைப்பது.

# OpenOrienteering::TemplateTrack
source: Error
ta: பிழை

# OpenOrienteering::TemplateTrack
source: The path is empty, there is nothing to import!
ta: பாதை காலியாக உள்ளது, இறக்குமதி செய்ய எதுவும் இல்லை!

# OpenOrienteering::TemplateTrack
source: Question
ta: கேள்வி

# OpenOrienteering::TemplateTrack
source: Should the waypoints be imported as a line going through all points?
ta: எல்லா புள்ளிகளிலும் செல்லும் ஒரு வரியாக வழிப்பாதைகள் இறக்குமதி செய்ய வேண்டுமா?

# OpenOrienteering::TemplateTrack
source: Import problems
ta: இறக்குமதி சிக்கல்கள்

# OpenOrienteering::TemplateTrack
source: %n path object could not be imported (reason: missing coordinates).
ta: %n பாதை பொருளை இறக்குமதி செய்ய முடியவில்லை (காரணம்: ஆயத்தங்களைக் காணவில்லை).

# OpenOrienteering::TextObjectAlignmentDockWidget
source: Alignment
ta: இருப்புவழி

# OpenOrienteering::TextObjectAlignmentDockWidget
source: Left
ta: இடது

# OpenOrienteering::TextObjectAlignmentDockWidget
source: Center
ta: நடுவண்

# OpenOrienteering::TextObjectAlignmentDockWidget
source: Right
ta: வலது

# OpenOrienteering::TextObjectAlignmentDockWidget
source: Top
ta: மேலே

# OpenOrienteering::TextObjectAlignmentDockWidget
source: Baseline
ta: அடிப்படை

# OpenOrienteering::TextObjectAlignmentDockWidget
source: Bottom
ta: கீழே

# OpenOrienteering::TextSymbolSettings
source: Text settings
ta: உரை அமைப்புகள்

# OpenOrienteering::TextSymbolSettings
source: Font family:
ta: எழுத்துரு குடும்பம்:

# OpenOrienteering::TextSymbolSettings
source: Font size:
ta: எழுத்துரு அளவு:

# OpenOrienteering::TextSymbolSettings
source: mm
ta: மிமீ

# OpenOrienteering::TextSymbolSettings
source: pt
ta: பக்

# OpenOrienteering::TextSymbolSettings
source: Text color:
ta: உரை நிறம்:

# OpenOrienteering::TextSymbolSettings
source: bold
ta: தடிமான

# OpenOrienteering::TextSymbolSettings
source: italic
ta: சாய்வு

# OpenOrienteering::TextSymbolSettings
source: underlined
ta: அடிக்கோடிட்டு

# OpenOrienteering::TextSymbolSettings
source: Text style:
ta: உரை நடை:

# OpenOrienteering::TextSymbolSettings
source: Line spacing:
ta: வரி இடைவெளி:

# OpenOrienteering::TextSymbolSettings
source: Paragraph spacing:
ta: பத்தி இடைவெளி:

# OpenOrienteering::TextSymbolSettings
source: Character spacing:
ta: எழுத்து இடைவெளி:

# OpenOrienteering::TextSymbolSettings
source: Kerning
ta: கெர்னிங்

# OpenOrienteering::TextSymbolSettings
source: Symbol icon text:
ta: அடையாளம் படவுரு உரை:

# OpenOrienteering::TextSymbolSettings
source: Framing
ta: ஃப்ரேமிங்

# OpenOrienteering::TextSymbolSettings
source: OCAD compatibility settings
ta: OCAD பொருந்தக்கூடிய அமைப்புகள்

# OpenOrienteering::TextSymbolSettings
source: Framing color:
ta: ஃப்ரேமிங் நிறம்:

# OpenOrienteering::TextSymbolSettings
source: Line framing
ta: வரி ஃப்ரேமிங்

# OpenOrienteering::TextSymbolSettings
source: Width:
ta: அகலம்:

# OpenOrienteering::TextSymbolSettings
source: Shadow framing
ta: நிழல் ஃப்ரேமிங்

# OpenOrienteering::TextSymbolSettings
source: Left/Right Offset:
ta: இடது/வலது ஆஃப்செட்:

# OpenOrienteering::TextSymbolSettings
source: Top/Down Offset:
ta: மேல்/கீழ் ஈடுசெய்ய:

# OpenOrienteering::TextSymbolSettings
source: OCAD compatibility
ta: OCAD பொருந்தக்கூடிய தன்மை

# OpenOrienteering::TextSymbolSettings
source: enabled
ta: இயக்கப்பட்டது

# OpenOrienteering::TextSymbolSettings
source: Line width:
ta: வரி அகலம்:

# OpenOrienteering::TextSymbolSettings
source: Line color:
ta: வரி நிறம்:

# OpenOrienteering::TextSymbolSettings
source: Position:
ta: நிலை:

# OpenOrienteering::TextSymbolSettings
source: Line below paragraphs
ta: பத்திகளுக்கு கீழே வரி

# OpenOrienteering::TextSymbolSettings
source: Distance from baseline:
ta: அடிப்படையிலிருந்து தூரம்:

# OpenOrienteering::TextSymbolSettings
source: Custom tabulator positions
ta: தனிப்பயன் தாவல் நிலைகள்

# OpenOrienteering::TextSymbolSettings
source: Add custom tabulator
ta: தனிப்பயன் தாவலைச் சேர்க்கவும்

# OpenOrienteering::UTMZoneEdit
source: Calculate
ta: கணக்கிடுங்கள்

# OpenOrienteering::UndoManager
source: Error
ta: பிழை

# OpenOrienteering::UndoManager
source: Cannot undo because the last undo step became invalid. This can for example happen if you change the symbol of an object to another and then delete the old symbol.
ta: கடைசியாக செயல்தவிர் படி செல்லாதது என்பதால் செயல்தவிர்க்க முடியாது. நீங்கள் ஒரு பொருளின் சின்னத்தை இன்னொருவருக்கு மாற்றி பழைய சின்னத்தை நீக்கினால் இது நிகழும்.

# OpenOrienteering::UndoManager
source: Confirmation
ta: உறுதிப்படுத்தல்

# OpenOrienteering::UndoManager
source: Undoing this step will go beyond the point where the file was loaded. Are you sure?
ta: இந்த படிநிலையை செயல்தவிர்க்கச் செய்வது கோப்பு ஏற்றப்பட்ட இடத்திற்கு அப்பால் செல்லும். நீங்கள் உறுதியாக இருக்கிறீர்களா?

# OpenOrienteering::UndoManager
source: Cannot redo because the first redo step became invalid. This can for example happen if you delete the symbol of an object you have drawn.
ta: முதல் மீண்டும் படி செல்லாதது என்பதால் மீண்டும் செய்ய முடியாது. நீங்கள் வரைந்த ஒரு பொருளின் சின்னத்தை நீக்கியால் இது நிகழும்.

# OpenOrienteering::UnitOfMeasurement meter
source: %1 m
ta: %1 மீ

# OpenOrienteering::UnitOfMeasurement millimeters
source: mm
ta: மிமீ

# OpenOrienteering::UnitOfMeasurement meters
source: m
ta: மீ

# OpenOrienteering::Util
source: Error
ta: பிழை

# OpenOrienteering::Util
source: Failed to locate the help files.
ta: உதவி கோப்புகளைக் கண்டுபிடிப்பதில் தோல்வி.

# OpenOrienteering::Util
source: Failed to locate the help browser ("Qt Assistant").
ta: உதவி உலாவி ("QT உதவியாளர்") கண்டுபிடிக்கத் தவறிவிட்டது.

# OpenOrienteering::Util
source: Failed to launch the help browser ("Qt Assistant").
ta: உதவி உலாவி ("QT உதவியாளர்") தொடங்குவதில் தோல்வி.

# OpenOrienteering::Util
source: See more...
ta: மேலும் காண்க ...

# OpenOrienteering::Util
source: Internal error detected! Please report this issue. Version: %1 Location: %2
ta: உள் பிழை கண்டறியப்பட்டது! இந்த சிக்கலைப் புகாரளிக்கவும். பதிப்பு: %1 இடம்: %2

# OpenOrienteering::XMLFileExporter
source: Older versions of Mapper do not support multiple map parts. To save the map in compatibility mode, you must first merge all map parts.
ta: மேப்பரின் பழைய பதிப்புகள் பல வரைபட பகுதிகளை ஆதரிக்கவில்லை. பொருந்தக்கூடிய பயன்முறையில் வரைபடத்தை சேமிக்க, நீங்கள் முதலில் அனைத்து வரைபட பகுதிகளையும் ஒன்றிணைக்க வேண்டும்.

# OpenOrienteering::XMLFileImporter
source: Unsupported element: %1 (line %2 column %3)
ta: ஆதரிக்கப்படாத உறுப்பு: %1 (வரி %2 நெடுவரிசை %3)

# OpenOrienteering::XMLFileImporter
source: Some coordinates were out of bounds for printing. Map content was adjusted.
ta: சில ஆயத்தொகுப்புகள் அச்சிடுவதற்கான எல்லைக்கு அப்பாற்பட்டவை. வரைபட உள்ளடக்கம் சரிசெய்யப்பட்டது.

# OpenOrienteering::XMLFileImporter
source: unknown
ta: தெரியவில்லை

# OpenOrienteering::XMLFileImporter
source: Parts of this file cannot be read by this version of Mapper. Minimum required version: %1
ta: இந்த கோப்பின் பகுதிகளை மேப்பரின் இந்த பதிப்பால் படிக்க முடியாது. குறைந்தபட்ச தேவையான பதிப்பு: %1

# OpenOrienteering::XMLFileImporter
source: Error at line %1 column %2: %3
ta: வரி %1 நெடுவரிசை %2: %3 இல் பிழை

# OpenOrienteering::XMLFileImporter
source: Some invalid characters had to be removed.
ta: சில தவறான எழுத்துக்கள் அகற்றப்பட வேண்டியிருந்தது.

# OpenOrienteering::XMLFileImporter
source: Unknown error
ta: தெரியாத பிழை

# OpenOrienteering::XMLFileImporter
source: Unsupported or invalid georeferencing specification '%1': %2
ta: ஆதரிக்கப்படாத அல்லது தவறான புவிசார் விவரக்குறிப்பு விவரக்குறிப்பு ' %1': %2

# OpenOrienteering::XMLFileImporter
source: Inconsistent declination/grivation detected. Resolved by automatic adjustment of the declination to %1°.
ta: சீரற்ற சரிவு/பேரழிவு கண்டறியப்பட்டது. %1 பெறுநர் க்கு சரிவின் தானியங்கி சரிசெய்தல் மூலம் தீர்க்கப்படுகிறது.

# OpenOrienteering::XMLFileImporter
source: Could not set knockout property of color '%1'.
ta: '%1' வண்ணத்தின் நாக் அவுட் சொத்தை அமைக்க முடியவில்லை.

# OpenOrienteering::XMLFileImporter
source: Expected %1 colors, found %2.
ta: எதிர்பார்க்கப்படும் %1 வண்ணங்கள், %2 காணப்படுகிறது.

# OpenOrienteering::XMLFileImporter
source: Spot color %1 not found while processing %2 (%3).
ta: %2 ( %3) செயலாக்கும்போது ச்பாட் கலர் %1 காணப்படவில்லை.

# OpenOrienteering::XMLFileImporter
source: Expected %1 symbols, found %2.
ta: எதிர்பார்க்கப்படும் %1 சின்னங்கள், %2 காணப்படுகிறது.

# OpenOrienteering::XMLFileImporter
source: Expected %1 map parts, found %2.
ta: எதிர்பார்க்கப்படும் %1 வரைபட பாகங்கள், %2 காணப்பட்டது.
