Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: string containing the DataFrame column containing the values to be averaged
ta: சராசரியாக இருக்க வேண்டிய மதிப்புகளைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசையைக் கொண்ட சரம்

source: string containing the DataFrame column containing the dates
ta: தேதிகளைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசையைக் கொண்ட சரம்

source: list of strings containing one or both of "mean" and "median"
ta: ஒன்று அல்லது இரண்டையும் "சராசரி" மற்றும் "சராசரி" கொண்ட சரங்களின் பட்டியல்

source: boolean flag to set whether to group by physician
ta: மருத்துவரால் குழுவாக இருக்க வேண்டுமா என்று அமைக்க பூலியன் கொடி

source: Pandas DataFrame containing the time series of average values grouped by system and name
ta: கணினி மற்றும் பெயரால் தொகுக்கப்பட்ட சராசரி மதிப்புகளின் நேரத் தொடரைக் கொண்ட பாண்டாச் டேட்டாஃப்ரேம்

source: Creates a Pandas DataFrame of the number of events in each day of the week, and in hour of that day.
ta: வாரத்தின் ஒவ்வொரு நாளிலும், அந்த நாளின் மணிநேரத்திலும் நிகழ்வுகளின் எண்ணிக்கையின் பாண்டாச் டேட்டாஃப்ரேமை உருவாக்குகிறது.

source: Pandas DataFrame containing the raw data; it must have a "study_time" and "x_ray_system_name" column
ta: மூல தரவுகளைக் கொண்ட பாண்டாச் டேட்டாஃப்ரேம்; இது "STATIG_TIME" மற்றும் "x_ray_system_name" நெடுவரிசையைக் கொண்டிருக்க வேண்டும்

source: string containing the df column name to group the results by
ta: முடிவுகளை தொகுக்க டி.எஃப் நெடுவரிசை பெயரைக் கொண்ட சரம்

source: string containing the df column name containing dates
ta: தேதிகளைக் கொண்ட டி.எஃப் நெடுவரிசை பெயரைக் கொண்ட சரம்

source: Pandas DataFrame containing the number of studies per day and hour grouped by name
ta: பாண்டாச் டேட்டாஃப்ரேம் ஒரு நாளைக்கு ஆய்வுகளின் எண்ணிக்கை மற்றும் பெயரால் தொகுக்கப்பட்ட மணிநேரம்

source: Create a sorted list of categories for frequency charts. Makes use of Pandas DataFrame sort_values (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html).
ta: அதிர்வெண் விளக்கப்படங்களுக்கான வகைகளின் வரிசைப்படுத்தப்பட்ட பட்டியலை உருவாக்கவும். பாண்டாச் டேட்டாஃப்ரேம் சோர்_வலூசைப் பயன்படுத்துகிறது (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.dataframe.sort_values.html).

source: sorting[0] sets sort direction
ta: வரிசைப்படுத்துதல் [0] வரிசை திசையை அமைக்கிறது

source: sorting[1] used to determine field to sort on: "name" sorts by df_name_col; otherwise sorted by "x_ray_system_name"
ta: வரிசைப்படுத்துதல் [1] வரிசைப்படுத்த புலத்தை தீர்மானிக்கப் பயன்படுகிறது: "பெயர்" வகைகள் df_name_col; இல்லையெனில் "x_ray_system_name" ஆல் வரிசைப்படுத்தப்பட்டது

source: DataFrame column containing the category names
ta: வகை பெயர்களைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை

source: 2-element list. [0] sets sort direction, [1] used to determine which field to sort on
ta: 2-உறுப்பு பட்டியல். [0] வரிசையை வரிசைப்படுத்துகிறது, [1] எந்த புலத்தை வரிசைப்படுத்த வேண்டும் என்பதை தீர்மானிக்கப் பயன்படுகிறது

source: dictionary with key df_name_col and a list of sorted categories as the value
ta: முக்கிய DF_NAME_COL உடன் அகராதி மற்றும் மதிப்பாக வரிசைப்படுத்தப்பட்ட வகைகளின் பட்டியல்

source: Create a sorted list of categories for scatter and over-time charts. The data is grouped by df_name_col and the mean and count calculated for each. The grouped DataFrame is then sorted according to the provided sorting. Makes use of Pandas DataFrame sort_values (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html).
ta: சிதறல் மற்றும் அதிக நேர விளக்கப்படங்களுக்கான வகைகளின் வரிசைப்படுத்தப்பட்ட பட்டியலை உருவாக்கவும். தரவு df_name_col ஆல் தொகுக்கப்பட்டுள்ளது மற்றும் ஒவ்வொன்றிற்கும் சராசரி மற்றும் எண்ணிக்கை கணக்கிடப்படுகிறது. தொகுக்கப்பட்ட டேட்டாஃப்ரேம் பின்னர் வழங்கப்பட்ட வரிசையாக்கத்தின் படி வரிசைப்படுத்தப்படுகிறது. பாண்டாச் டேட்டாஃப்ரேம் சோர்_வலூசைப் பயன்படுத்துகிறது (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.dataframe.sort_values.html).

source: sorting[1] used to determine sort order: "name" sorts by df_name_col; otherwise sorted by "x_ray_system_name"
ta: வரிசைப்படுத்துதல் [1] வரிசை வரிசையை தீர்மானிக்கப் பயன்படுகிறது: DF_NAME_COL ஆல் "பெயர்" வகைகள்; இல்லையெனில் "x_ray_system_name" ஆல் வரிசைப்படுத்தப்பட்டது

source: DataFrame column containing the category names. Used to group the data
ta: வகை பெயர்களைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை. தரவை தொகுக்கப் பயன்படுகிறது

source: DataFrame column containing values to count and calculate the mean
ta: சராசரியைக் கணக்கிடவும் கணக்கிடவும் மதிப்புகளைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை

source: Calculates a Pandas DataFrame containing chart data to be used for csv download
ta: காபிம பதிவிறக்கத்திற்கு பயன்படுத்தப்பட வேண்டிய விளக்கப்பட தரவைக் கொண்ட பாண்டாச் டேட்டாஃப்ரேமை கணக்கிடுகிறது

source: Plotly figure containing the data to extract
ta: பிரித்தெடுப்பதற்கான தரவைக் கொண்ட சூழ்ச்சி

source: a dictionary of parameters
ta: அளவுருக்களின் அகராதி

source: (string) title for the name data
ta: (சரம்) பெயர் தரவுக்கான தலைப்பு

source: (string) title for the value data
ta: (சரம்) மதிப்பு தரவுகளுக்கான தலைப்பு

source: (string) DataFrame column used to split data into subgroups
ta: (சரம்) தரவுகளை துணைக்குழுக்களாகப் பிரிக்கப் பயன்படுத்தப்படும் டேட்டாஃப்ரேம் நெடுவரிசை

source: DataFrame containing the data for download
ta: பதிவிறக்கத்திற்கான தரவைக் கொண்ட டேட்டாஃப்ரேம்

source: a dictionary of parameters; must include "x_axis_title"
ta: அளவுருக்களின் அகராதி; "x_axis_title" ஐ சேர்க்க வேண்டும்

source: Adapted from: https://discuss.streamlit.io/t/heres-a-download-function-that-works-for-dataframes-and-txt/4052
ta: இதிலிருந்து தழுவி: https://discuss.streamlit.io/t/heres-a-download-function-that-works-for-dataframes-and-txt/4052

source: Generates a link to download the given object_to_download.
ta: கொடுக்கப்பட்ட பொருளைப் பதிவிறக்க ஒரு இணைப்பை உருவாக்குகிறது.

source: object_to_download (str, pd.DataFrame): The object to be downloaded. download_filename (str): filename and extension of file. e.g. mydata.csv, some_txt_output.txt download_link_text (str): Text to display for download link.
ta: object_to_download (str, pd.dataframe): பதிவிறக்கம் செய்ய வேண்டிய பொருள். Download_filename (str): கோப்பின் கோப்பு பெயர் மற்றும் நீட்டிப்பு. எ.கா. mydata.csv, some_txt_output.txt download_link_text (str): பதிவிறக்க இணைப்பைக் காண்பிக்க உரை.

source: Examples:
ta: எடுத்துக்காட்டுகள்:

source: ``download_link(YOUR_DF, 'YOUR_DF.csv', 'Click here to download data!')``
ta: `` Download_link (your_df, 'your_df.csv', 'தரவைப் பதிவிறக்க இங்கே சொடுக்கு செய்க!') ``

source: ``download_link(YOUR_STRING, 'YOUR_STRING.txt', 'Click here to download your text!')``
ta: `` Download_link (your_string, 'your_string.txt', 'உங்கள் உரையைப் பதிவிறக்க இங்கே சொடுக்கு செய்க!') ``

source: Returns a string containing an HTML DIV with a message warning that the DataFrame is empty
ta: டேட்டாஃப்ரேம் காலியாக இருப்பதாக எச்சரிக்கையுடன் ஒரு உஉகுமொ DIV கொண்ட ஒரு சரத்தை வழங்குகிறது

source: parameters which may contain a custom_msg_line
ta: Custom_msg_line ஐக் கொண்டிருக்கக்கூடிய அளவுருக்கள்

source: string containing an html div with the empty DataFrame message
ta: வெற்று டேட்டாஃப்ரேம் செய்தியுடன் உஉகுமொ DIV கொண்ட சரம்

source: Returns a string containing an HTML DIV with a failed chart message
ta: தோல்வியுற்ற விளக்கப்பட செய்தியுடன் உஉகுமொ DIV கொண்ட ஒரு சரத்தை வழங்குகிறது

source: string containing a custom line to add to the message
ta: செய்தியைச் சேர்க்க தனிப்பயன் வரியைக் கொண்ட சரம்

source: Python error object
ta: பைதான் பிழை பொருள்

source: string containing the message in an HTML DIV
ta: ஒரு உஉகுமொ DIV இல் செய்தியைக் கொண்ட சரம்

source: Creates a Plotly global configuration dictionary. The parameters all relate to the chart bitmap that can be saved by the user.
ta: ஒரு சூழ்ச்சி உலகளாவிய உள்ளமைவு அகராதியை உருவாக்குகிறது. அளவுருக்கள் அனைத்தும் பயனரால் சேமிக்கக்கூடிய விளக்கப்படம் பிட்மேப்புடன் தொடர்புடையவை.

source: string containing the file name to use if the user saves the chart as a graphic file
ta: பயனர் விளக்கப்படத்தை கிராஃபிக் கோப்பாக சேமித்தால் பயன்படுத்த கோப்பு பெயரைக் கொண்ட சரம்

source: floating point value used to scale the chart height
ta: விளக்கப்பட உயரத்தை அளவிட பயன்படுத்தப்படும் மிதக்கும் புள்ளி மதிப்பு

source: int value for the height of the chart graphic file
ta: விளக்கப்படம் கிராஃபிக் கோப்பின் உயரத்திற்கான எண்ணாக

source: int value for the width of the chart graphic file
ta: விளக்கப்பட கிராஃபிக் கோப்பின் அகலத்திற்கான எண்ணாக

source: a dictionary of Plotly options
ta: சூழ்ச்சி விருப்பங்களின் அகராதி

source: Create a plotly bar chart
ta: ஒரு சூழ்ச்சி பட்டி விளக்கப்படத்தை உருவாக்கவும்

source: (string) DataFrame column containing values ("mean" or "median")
ta: (சரம்) மதிப்புகளைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை ("சராசரி" அல்லது "சராசரி")

source: (string) x-axis title
ta: (சரம்) எக்ச்-அச்சு தலைப்பு

source: (string) DataFrame column used to create subplots
ta: (சரம்) துணைப்பிரிவுகளை உருவாக்க பயன்படுத்தப்படும் டேட்டாஃப்ரேம் நெடுவரிசை

source: (string) default filename to use for plot csv export
ta: (சரம்) சூழ்ச்சி காபிம ஏற்றுமதிக்கு பயன்படுத்த இயல்புநிலை கோப்பு பெயர்

source: Plotly figure embedded in an HTML DIV; or Plotly figure as a dictionary (if params["return_as_dict"] is True); or an error message embedded in an HTML DIV if there was a ValueError when calculating the figure
ta: ஒரு உஉகுமொ DIV இல் பதிக்கப்பட்ட படம்; அல்லது சூழ்ச்சி ஒரு அகராதியாக (அளவுருக்கள் ["return_as_dict"] உண்மை என்றால்); அல்லது ஒரு உஉகுமொ DIV இல் உட்பொதிக்கப்பட்ட பிழை செய்தி உருவத்தை கணக்கிடும்போது ஒரு மதிப்புரர் இருந்தால்

source: Create a plotly bar chart of event workload
ta: நிகழ்வு பணிச்சுமையின் சூழ்ச்சி பட்டி விளக்கப்படத்தை உருவாக்கவும்

source: Plotly figure embedded in an HTML DIV; or Plotly figure as a dictionary (if "return_as_dict" is True); or an error message embedded in an HTML DIV if there was a ValueError when calculating the figure
ta: ஒரு உஉகுமொ DIV இல் பதிக்கப்பட்ட படம்; அல்லது சூழ்ச்சி ஒரு அகராதியாக ("return_as_dict" உண்மை என்றால்); அல்லது ஒரு உஉகுமொ DIV இல் உட்பொதிக்கப்பட்ட பிழை செய்தி உருவத்தை கணக்கிடும்போது ஒரு மதிப்புரர் இருந்தால்

source: Create a plotly binned statistic bar chart
ta: சூழ்ச்சி பின் செய்யப்பட்ட புள்ளிவிவரப் பட்டி விளக்கப்படத்தை உருவாக்கவும்

source: (string) Subplot title
ta: (சரம்) சப்ளாட் தலைப்பு

source: list of ints containing bin edges for binning
ta: பின்னிங்கிற்கான பின் விளிம்புகளைக் கொண்ட ints இன் பட்டியல்

source: (string) DataFrame column containing x data
ta: (சரம்) ஃச் தரவைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை

source: (string) DataFrame column containing y data
ta: (சரம்) ஒய் தரவைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை

source: (string) Title for x-axis
ta: (சரம்) எக்ச்-அச்சுக்கான தலைப்பு

source: (string) Title for y-axis
ta: (சரம்) Y- அச்சுக்கான தலைப்பு

source: (string) "mean" or "median"
ta: (சரம்) "சராசரி" அல்லது "சராசரி"

source: Produce a plotly boxplot
ta: ஒரு சூழ்ச்சி பாக்ச் பிளாட்டை உருவாக்குங்கள்

source: Create a plotly bar chart of event frequency
ta: நிகழ்வு அதிர்வெண்ணின் சூழ்ச்சி பட்டி விளக்கப்படத்தை உருவாக்கவும்

source: list of strings with DataFrame columns to group data by
ta: குழு தரவுகளுக்கு டேட்டாஃப்ரேம் நெடுவரிசைகளுடன் கூடிய சரங்களின் பட்டியல்

source: (string) legend title
ta: (சரம்) புராண தலைப்பு

source: Create a plotly histogram bar chart
ta: ஒரு சூழ்ச்சி இச்டோகிராம் பார் விளக்கப்படத்தை உருவாக்கவும்

source: string list of each category name
ta: ஒவ்வொரு வகை பெயரின் சரம் பட்டியல்

source: (int) number of hisgogram bins to use
ta: (int) பயன்படுத்த இச்டோகிராம் பின்களின் எண்ணிக்கை

source: (boolean) flag to calculate global max and min or per-subplot max and min
ta: (boolean) flag பெறுநர் calculate உலகளாவிய max and min or per-subplot max and min

source: Create a plotly scatter chart
ta: சூழ்ச்சி சிதறல் விளக்கப்படத்தை உருவாக்கவும்

source: (string) DataFrame column containing x values
ta: (சரம்) ஃச் மதிப்புகளைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை

source: (string) DataFrame column containing y values
ta: (சரம்) ஒய் மதிப்புகளைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை

source: A short method to set the plotly chart theme
ta: சூழ்ச்சி விளக்கப்படம் கருப்பொருளை அமைக்க ஒரு குறுகிய முறை

source: the name of the theme
ta: கருப்பொருளின் பெயர்

source: Create a plotly line chart of data over time
ta: காலப்போக்கில் தரவின் சூழ்ச்சி வரி விளக்கப்படத்தை உருவாக்கவும்

source: (string) DataFrame column containing frequency data
ta: (சரம்) அதிர்வெண் தரவைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை

source: Saves the Plotly figure as an HTML file containing a single DIV. The file is saved on the OpenREM server in MEDIA_ROOT\charts\yyyy\mm\dd\. Viewing the saved file requires an active internet connection as the Plotly JavaScript library is not included in the file.
ta: சூழ்ச்சி உருவத்தை ஒற்றை டிவ் கொண்ட உஉகுமொ கோப்பாக சேமிக்கிறது. கோப்பு மீடியா_ரூட் \ விளக்கப்படங்கள் \ yyyy \ மிமீ \ dd on இல் OpenREM சேவையகத்தில் சேமிக்கப்படுகிறது. சேமிக்கப்பட்ட கோப்பைப் பார்க்க ஒரு செயலில் இணைய இணைப்பு தேவைப்படுகிறது, ஏனெனில் சூழ்ச்சி சாவாச்கிரிப்ட் நூலகம் கோப்பில் சேர்க்கப்படவில்லை.

source: This method is not currently accessible to an OpenREM user or administrator - it is present to assist developers when producing example charts for the OpenREM documentation. It must be manually activated by setting active=True in the method definition.
ta: இந்த முறை தற்போது ஒரு ஓபன்ரெம் பயனர் அல்லது நிர்வாகிக்கு அணுக முடியாது - ஓபன்ரெம் ஆவணங்களுக்கான எடுத்துக்காட்டு விளக்கப்படங்களை உருவாக்கும்போது டெவலப்பர்களுக்கு உதவ இது உள்ளது. முறை வரையறையில் செயலில் = உண்மையை அமைப்பதன் மூலம் இது கைமுறையாக செயல்படுத்தப்பட வேண்டும்.

source: a Plotly figure
ta: ஒரு சூழ்ச்சி உருவம்

source: (string )the filename to use
ta: (சரம்) பயன்படுத்த கோப்பு பெயர்

source: (boolean) to set whether to save the figure
ta: (பூலியன்) உருவத்தை சேமிக்கலாமா என்பதை அமைக்க

source: Creating a development environment
ta: மேம்பாட்டு சூழலை உருவாக்குதல்

source: Install Python 3.6+, preferably Python 3.8: check your Linux distribution docs to see how to install a particular version; for Windows go to https://www.python.org/downloads/. Check "Add Python 3.8 to PATH" during installation.
ta: பைதான் 3.6+, முன்னுரிமை பைதான் 3.8: ஒரு குறிப்பிட்ட பதிப்பை எவ்வாறு நிறுவுவது என்பதைப் பார்க்க உங்கள் லினக்ச் விநியோக ஆவணங்களைச் சரிபார்க்கவும்; சாளரங்கள் https://www.python.org/downloads/ க்குச் செல்லவும். நிறுவலின் போது "பாதையில் பைதான் 3.8 ஐச் சேர்க்கவும்" என்று சரிபார்க்கவும்.

source: Install git: ``sudo apt install git`` or equivalent on Linux; for Windows go to https://git-scm.com/download/win
ta: Git ஐ நிறுவவும்: `` sudo apt install git`` அல்லது அதற்கு சமமான லினக்சில்; சாளரங்கள் https://git-scm.com/download/win க்குச் செல்லவும்

source: *Recommended* - install an integrated development environment such as `PyCharm <https://www.jetbrains.com/pycharm/>`_ or `Visual Studio Code <https://code.visualstudio.com/>`_ (many others are available).
ta: . மற்றவை கிடைக்கின்றன).

source: Check out git repo
ta: அறிவிலி ரெப்போவைப் பாருங்கள்

source: Either clone the main OpenREM repository, or fork it first and then clone that (adapt the command accordingly):
ta: முதன்மையான ஓபன்ரெம் களஞ்சியத்தை நகலி செய்யுங்கள், அல்லது முதலில் அதை முடக்கு, பின்னர் நகலி செய்யுங்கள் (அதற்கேற்ப கட்டளையை மாற்றியமைக்கவும்):

source: The OpenREM source code will now be in a folder called openrem. If you wish to specify the folder, you could do this by adding the folder name to the clone command.
ta: ஓபன்ரெம் மூலக் குறியீடு இப்போது ஓபன்ரெம் என்ற கோப்புறையில் இருக்கும். நீங்கள் கோப்புறையைக் குறிப்பிட விரும்பினால், நகலி கட்டளையில் கோப்புறை பெயரைச் சேர்ப்பதன் மூலம் இதைச் செய்யலாம்.

source: Create Python virtual environment
ta: பைதான் மெய்நிகர் சூழலை உருவாக்கவும்

source: Linux - install the Python package ``venv`` using ``pip`` (Windows users, ``venv`` should have been installed with Python automatically):
ta: லினக்ச் - `` பிப்`` ஐப் பயன்படுத்தி பைதான் தொகுப்பை `` வெவி`` நிறுவவும்

source: Then create the Python virtual environment in a folder called ``openrem-venv`` (change as required):
ta: `` OpenRem-venv`` (தேவைக்கேற்ப மாற்றவும்) என்ற கோப்புறையில் பைதான் மெய்நிகர் சூழலை உருவாக்கவும்:

source: Linux:
ta: லினக்ச்:

source: Windows PowerShell (for ``cmd.exe`` substitute ``Activate.ps1`` with ``activate.bat``)
ta: சாளரங்கள் பவர்செல் (`` cmd.exe`` என்பதற்கு `` activate.ps1` உடன் `` actayate.bat`` உடன்)

source: For users of VS Code, it can be useful to create the virtual environment in a folder called ``.venv`` within your project folder (where you checked out the git repo), then VS Code will find it automatically. If you are using PyCharm you can click on the Python interpreter at the bottom right and click 'Add Interpreter'.
ta: VS குறியீட்டைப் பயன்படுத்துபவர்களுக்கு, உங்கள் திட்டக் கோப்புறையில் `` .venv`` எனப்படும் கோப்புறையில் மெய்நிகர் சூழலை உருவாக்குவது பயனுள்ளதாக இருக்கும் (நீங்கள் அறிவிலி ரெப்போவைப் பார்த்தீர்கள்), பின்னர் VS குறியீடு தானாகவே கண்டுபிடிக்கும். நீங்கள் பைக்கார்மைப் பயன்படுத்துகிறீர்கள் என்றால், கீழே வலதுபுறத்தில் உள்ள பைதான் மொழிபெயர்ப்பாளரைக் சொடுக்கு செய்து 'மொழிபெயர்ப்பாளரைச் சேர்' என்பதைக் சொடுக்கு செய்யலாம்.

source: Install the Python libraries
ta: பைதான் நூலகங்களை நிறுவவும்

source: Assumes:
ta: கருதுகிறது:

source: git repository is in a sub-folder called ``openrem`` - change as necessary
ta: அறிவிலி களஞ்சியம் `` ஓபன்ரெம்`` என்று அழைக்கப்படும் துணை நட்பில் உள்ளது - தேவையானதை மாற்றவும்

source: venv is activated
ta: VEV செயல்படுத்தப்படுகிறது

source: Setup OpenREM
ta: அமைத்தல் OpenRem

source: You'll need a basic configuration of OpenREM to run any code locally - copy the ``openremproject/local_settings.py.example`` to ``openremproject/local_settings.py`` and set a path for a SQLite database etc.
ta: எந்தவொரு குறியீட்டையும் உள்நாட்டில் இயக்க ஓபன்ரெமின் அடிப்படை உள்ளமைவு உங்களுக்குத் தேவைப்படும் - `` OpenRemproject/local_settings.py.py.py.py.py.cample` `` OpenRemProject/local_settings.py`` க்கு நகலெடுத்து SQLITE தரவுத்தளத்திற்கான பாதையை அமைக்கவும்.

source: To use PosgreSQL instead of SQLite3, set up a user in pgAdmin 4 on Windows, and an empty database with the same user as owner, or use the :ref:`Linux-DB` instructions on Linux.
ta: SQLITE3 க்கு பதிலாக PostgresQL ஐப் பயன்படுத்த, சாளரங்களில் PGADMIN 4 இல் ஒரு பயனரை அமைக்கவும், உரிமையாளரின் அதே பயனருடன் வெற்று தரவுத்தளத்தையும் அல்லது லினக்சில் `லினக்ச்-டிபி` வழிமுறைகளைப் பயன்படுத்தவும்.

source: Run test webserver
ta: சோதனை வெப்சர்வரை இயக்கவும்

source: To see the changes you have made with the web interface, you can use the built-in Django webserver:
ta: வலை இடைமுகத்துடன் நீங்கள் செய்த மாற்றங்களைக் காண, நீங்கள் உள்ளமைக்கப்பட்ட சாங்கோ வெப்சர்வரைப் பயன்படுத்தலாம்:

source: In a web browser on the same computer, go to http://localhost:8000/ - you should now see the message about creating users.
ta: அதே கணினியில் ஒரு வலை உலாவியில், http: // localhost: 8000/ - க்குச் செல்லவும், பயனர்களை உருவாக்குவது பற்றிய செய்தியை இப்போது நீங்கள் காண வேண்டும்.

source: Get coding
ta: குறியீட்டு முறையைப் பெறுங்கள்

source: Create a branch in the git repository, and start making your changes, adding your features etc!
ta: அறிவிலி களஞ்சியத்தில் ஒரு கிளையை உருவாக்கி, உங்கள் மாற்றங்களைச் செய்யத் தொடங்குங்கள், உங்கள் அம்சங்களைச் சேர்க்கவும்!

source: When you are done, push it back to Bitbucket and send in a pull request! Ideally, try and use the ``refs #123`` syntax in commit messages to reference the issue on Bitbucket you are working on.
ta: நீங்கள் முடிந்ததும், அதை மீண்டும் பிட்பக்கெட்டுக்கு தள்ளி, இழுக்கும் கோரிக்கையை அனுப்புங்கள்! வெறுமனே, நீங்கள் பணிபுரியும் பிட்பக்கெட்டில் சிக்கலைக் குறிக்க செய்திகளில் `` Refs #123`` தொடரியல் முயற்சிக்கவும் பயன்படுத்தவும்.

source: DICOM import modules
ta: DICOM இறக்குமதி தொகுதிகள்

source: RDSR module
ta: ஆர்.டி.எச்.ஆர் தொகுதி

source: Ultimately this should be the only module required as it deals with all Radiation Dose Structured Reports. This is used for CT, fluoroscopy, mammography, digital radiography and nuclear medicine.
ta: இறுதியில் இது அனைத்து கதிர்வீச்சு டோச் கட்டமைக்கப்பட்ட அறிக்கைகளையும் கையாள்வதால் தேவைப்படும் ஒரே தொகுதியாக இருக்க வேண்டும். இது சி.டி, ஃப்ளோரோச்கோபி, மேமோகிராபி, டிசிட்டல் ரேடியோகிராபி மற்றும் அணு மருத்துவம் ஆகியவற்றிற்கு பயன்படுத்தப்படுகிறது.

source: Extract radiation dose related data from DICOM Radiation SR objects.
ta: DICOM கதிர்வீச்சு SR பொருள்களிலிருந்து கதிர்வீச்சு டோச் தொடர்பான தரவைப் பிரித்தெடுக்கவும்.

source: relative or absolute path to Radiation Dose Structured Report.
ta: கதிர்வீச்சு டோச் கட்டமைக்கப்பட்ட அறிக்கைக்கான உறவினர் அல்லது முழுமையான பாதை.

source: Mammography module
ta: மேமோகிராஃபி தொகுதி

source: Mammography is interesting in that all the information required for dose audit is contained in the image header, including patient 'size', ie thickness. However the disadvantage over an RSDR is the requirement to process each individual image rather than a single report for the study, which would also capture any rejected images.
ta: டோச் தணிக்கைக்குத் தேவையான அனைத்து தகவல்களும் நோயாளியின் 'அளவு', அதாவது தடிமன் உள்ளிட்ட படத் தலைப்பில் உள்ளன. எவ்வாறாயினும், ஒரு ஆர்.எச்.டி.ஆரின் குறைபாடு என்பது ஆய்வுக்கான ஒரு அறிக்கையை விட ஒவ்வொரு தனிப்பட்ட படத்தையும் செயலாக்குவதற்கான தேவை, இது நிராகரிக்கப்பட்ட எந்த படங்களையும் கைப்பற்றும்.

source: Extract radiation dose structured report related data from mammography images
ta: மேமோகிராஃபி படங்களிலிருந்து கதிர்வீச்சு டோச் கட்டமைக்கப்பட்ட அறிக்கை தொடர்பான தரவைப் பிரித்தெடுக்கவும்

source: relative or absolute path to mammography DICOM image file.
ta: மேமோகிராஃபி டிகாம் படக் கோப்பிற்கான உறவினர் அல்லது முழுமையான பாதை.

source: CR and DR module
ta: சி.ஆர் மற்றும் டி.ஆர் தொகுதி

source: In practice this is only useful for DR modalities, but most of them use the CR IOD instead of the DX one, so both are catered for. This module makes use of the image headers much like the mammography module.
ta: நடைமுறையில் இது டிஆர் முறைகளுக்கு மட்டுமே பயனுள்ளதாக இருக்கும், ஆனால் அவற்றில் பெரும்பாலானவை டிஎக்ச் ஒன்றுக்கு பதிலாக சிஆர் அயோலைப் பயன்படுத்துகின்றன, எனவே இரண்டும் வழங்கப்படுகின்றன. இந்த தொகுதி மேமோகிராஃபி தொகுதி போன்ற படத் தலைப்புகளைப் பயன்படுத்துகிறது.

source: Extract radiation dose structured report related data from DX radiographic images
ta: டிஎக்ச் ரேடியோகிராஃபிக் படங்களிலிருந்து கதிர்வீச்சு டோச் கட்டமைக்கப்பட்ட அறிக்கை தொடர்பான தரவைப் பிரித்தெடுக்கவும்

source: relative or absolute path to DICOM DX radiographic image file.
ta: DICOM DX ரேடியோகிராஃபிக் படக் கோப்பிற்கான உறவினர் அல்லது முழுமையான பாதை.

source: NM Image module
ta: என்எம் பட தொகுதி

source: This has the abilty to read information from the DICOM Headers of PET and NM images. In contrast to the other import modules this may actually complement the data read from an RRDSR, because not all relevant data is included there.
ta: PET மற்றும் NM படங்களின் DICOM தலைப்புகளிலிருந்து தகவல்களைப் படிக்க இது உதவுகிறது. மற்ற இறக்குமதி தொகுதிகளுக்கு மாறாக, இது உண்மையில் ஒரு RRDSR இலிருந்து படித்த தரவை நிறைவு செய்யலாம், ஏனெனில் அனைத்து தொடர்புடைய தரவுகளும் அங்கு சேர்க்கப்படவில்லை.

source: Extract radiation dose related data from DICOM PET/NM-Image.
ta: DICOM PET/NM-image இலிருந்து கதிர்வீச்சு டோச் தொடர்பான தரவைப் பிரித்தெடுக்கவும்.

source: relative or absolute path to PET/NM-Image.
ta: PET/NM-image க்கு உறவினர் அல்லது முழுமையான பாதை.

source: CT non-standard modules
ta: சி.டி அல்லாத தரமற்ற தொகுதிகள்

source: Philips CT dose info reports
ta: பிலிப்ச் சி.டி டோச் செய்தி அறிக்கைகள்

source: These have all the information that could be derived from the images also held in the DICOM header information, making harvesting relatively easy. Used where RDSR is not available from older Philips systems.
ta: டிகாம் தலைப்பு தகவல்களில் வைக்கப்பட்டுள்ள படங்களிலிருந்து பெறக்கூடிய அனைத்து தகவல்களும் இவை உள்ளன, இது அறுவடை ஒப்பீட்டளவில் எளிதானது. பழைய பிலிப்ச் அமைப்புகளிலிருந்து ஆர்.டி.எச்.ஆர் கிடைக்காத இடத்தில் பயன்படுத்தப்படுகிறது.

source: Extract radiation dose structured report related data from Philips CT dose report images
ta: கதிர்வீச்சு டோச் கட்டமைக்கப்பட்ட அறிக்கை பிலிப்ச் சி.டி டோச் அறிக்கை படங்களிலிருந்து தொடர்புடைய தரவைப் பிரித்தெடுக்கவும்
