Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: Depending on your web server setup, your web interface to OpenREM will usually be at http://yourserver/openrem or if you are using the test web server then it might be at http://localhost:8000/openrem.
ta: உங்கள் வலை சேவையக அமைப்பைப் பொறுத்து, OpenRem க்கான உங்கள் வலை இடைமுகம் வழக்கமாக http: // yournerver/openrem இல் இருக்கும் அல்லது நீங்கள் சோதனை வலை சேவையகத்தைப் பயன்படுத்துகிறீர்கள் என்றால் அது http: // localhost: 8000/openrem இல் இருக்கலாம்.

source: The home page for OpenREM should look something like this when it is populated with studies:
ta: ஓபன்ரெமுக்கான முகப்பு பக்கம் ஆய்வுகள் வசிக்கும்போது இதுபோன்றதாக இருக்க வேண்டும்:

source: OpenREM homepage screenshot
ta: ஓபன்ரெம் முகப்புப்பக்க திரை காட்சி

source: By selecting the links in the navigation bar at the top, you can view all of the CT, fluoroscopy, mammography, radiographic or nuclear medicine studies. Alternatively, click on any row to filter by that system.
ta: மேலே உள்ள வழிசெலுத்தல் பட்டியில் உள்ள இணைப்புகளைத் தேர்ந்தெடுப்பதன் மூலம், நீங்கள் சி.டி, ஃப்ளோரோச்கோபி, மேமோகிராபி, ரேடியோகிராஃபிக் அல்லது அணு மருத்துவ ஆய்வுகள் அனைத்தையும் காணலாம். மாற்றாக, அந்த அமைப்பால் வடிகட்ட எந்த வரிசையிலும் சொடுக்கு செய்க.

source: The modality tables can be sorted by any of the columns by clicking on the column header that you wish to sort by.
ta: நீங்கள் வரிசைப்படுத்த விரும்பும் நெடுவரிசை தலைப்பைக் சொடுக்கு செய்வதன் மூலம் எந்தவொரு நெடுவரிசைகளாலும் முறை அட்டவணைகள் வரிசைப்படுத்தப்படலாம்.

source: If you are not logged in, clicking any of the links will bring up the log in page.
ta: நீங்கள் உள்நுழையவில்லை என்றால், எந்த இணைப்புகளையும் சொடுக்கு செய்வதன் மூலம் உள்நுழைவு பக்கத்தில் கொண்டு வரும்.

source: Filtering for specific studies
ta: குறிப்பிட்ட ஆய்வுகளுக்கு வடிகட்டுதல்

source: This image shows the CT studies view, available to any logged in user, filtered by entering terms in the boxes on the right hand side to show just the studies where the modality manufacturer name includes the term 'Siemens':
ta: இந்த படம் சி.டி. ஆய்வுகள் பார்வையைக் காட்டுகிறது, பயனரில் உள்நுழைந்த எந்தவொரு நபருக்கும் கிடைக்கிறது, வலது புறத்தில் உள்ள பெட்டிகளில் சொற்களை உள்ளிட்டு வடிகட்டப்படுகிறது, இது 'சீமென்ச்' என்ற சொல்லைக் கொண்ட ஆய்வுகளைக் காண்பிக்கும்:

source: Filtering CT studies
ta: சி.டி ஆய்வுகளை வடிகட்டுதல்

source: The search fields can all be used on their own or together, and they are all case insensitive 'contains' searches. The exception is the date field, where both from and to have to be filled in (if either are), and the format must be ``yyyy-mm-dd``. There currently isn't any more complex filtering available, but it does exist as `issue 17 <https://bitbucket.org/openrem/openrem/issue/17/>`_ for a future release.
ta: தேடல் புலங்கள் அனைத்தும் அவற்றின் சொந்தமாகவோ அல்லது ஒன்றாகவோ பயன்படுத்தப்படலாம், மேலும் அவை அனைத்தும் உணர்வற்றவை 'தேடல்களைக் கொண்டுள்ளன. விதிவிலக்கு தேதி புலம், எங்கிருந்து நிரப்பப்பட வேண்டும் (ஒன்று இருந்தால்), மற்றும் வடிவம் `` yyyyy-Mm-dd`` இருக்க வேண்டும். தற்போது இன்னும் சிக்கலான வடிகட்டுதல் எதுவும் கிடைக்கவில்லை, ஆனால் இது `வெளியீடு 17 <https://bitbucket.org/openrem/openrem/issue/17/>` _ _ எதிர்கால வெளியீட்டிற்கு உள்ளது.

source: The last box below the filtering search boxes is the ordering preference.
ta: வடிகட்டுதல் தேடல் பெட்டிகளுக்கு கீழே உள்ள கடைசி பெட்டி வரிசைப்படுத்தும் விருப்பம்.

source: CT: specifying number of event types
ta: சி.டி: நிகழ்வு வகைகளின் எண்ணிக்கையைக் குறிப்பிடுவது

source: It is possible to filter for studies that have specific numbers of each acquisition type, or to only include studies have at least some (>0), or to include only studies that have zero acquisitions of a specific type.
ta: ஒவ்வொரு கையகப்படுத்தல் வகையின் குறிப்பிட்ட எண்ணிக்கையைக் கொண்ட ஆய்வுகளுக்கு வடிகட்ட முடியும், அல்லது ஆய்வுகள் மட்டுமே குறைந்தது சில (> 0) அல்லது ஒரு குறிப்பிட்ட வகையின் சுழிய கையகப்படுத்துதல்களைக் கொண்ட ஆய்வுகளை மட்டுமே சேர்க்கலாம்.

source: For example, if the standard ``CT Abdomen`` on a particular scanner has two localisers and one spiral scan, then to filter for all the studies that followed this without deviation (an extra localiser or an extra series) the filters might be set to the particular Display Name and Requested Procedure, and Num. spiral events set to one and Num. localisers set to two. This can be useful for exporting a clean set of data to process for a dose audit.
ta: எடுத்துக்காட்டாக, ஒரு குறிப்பிட்ட ச்கேனரில் நிலையான `` சி.டி அடிவயிற்று`` இரண்டு உள்ளக மற்றும் ஒரு சுழல் ச்கேன் இருந்தால், விலகல் இல்லாமல் (கூடுதல் உள்ளூர்மயமாக்கல் அல்லது கூடுதல் தொடர்) இதைத் தொடர்ந்து வந்த அனைத்து ஆய்வுகளுக்கும் வடிகட்டலாம் குறிப்பிட்ட காட்சி பெயர் மற்றும் கோரப்பட்ட செயல்முறை மற்றும் எண். சுழல் நிகழ்வுகள் ஒன்று மற்றும் எண்ணாக அமைக்கப்பட்டன. உள்ளூராக்கிகள் இரண்டாக அமைக்கப்பட்டனர். டோச் தணிக்கைக்கு செயலாக்க ஒரு தூய்மையான தரவை ஏற்றுமதி செய்ய இது பயனுள்ளதாக இருக்கும்.

source: Setting the number of studies displayed per page
ta: ஒரு பக்கத்திற்கு காட்டப்படும் ஆய்வுகளின் எண்ணிக்கையை அமைத்தல்

source: The number of studies displayed per page can be controlled by changing the value selected in the ``Items per page`` drop down box, located beneath the chart options:
ta: ஒரு பக்கத்திற்கு காட்டப்படும் ஆய்வுகளின் எண்ணிக்கையை கட்டுப்படுத்தலாம் `` ஒரு பக்கத்திற்கு உருப்படிகள்` `` கீழ்தோன்றும் பெட்டியில், விளக்கப்படம் விருப்பங்களுக்கு அடியில் அமைந்துள்ளது:

source: Setting the number of studies per page
ta: ஒரு பக்கத்திற்கு ஆய்வுகளின் எண்ணிக்கையை அமைத்தல்

source: Viewing study details
ta: ஆய்வு விவரங்களைப் பார்க்கிறது

source: By clicking on the study description link (in blue), you can see more details for an individual study:
ta: ஆய்வு விளக்க இணைப்பைக் சொடுக்கு செய்வதன் மூலம் (நீல நிறத்தில்), ஒரு தனிப்பட்ட ஆய்வுக்கான கூடுதல் விவரங்களைக் காணலாம்:

source: Individual CT study
ta: தனிப்பட்ட சி.டி ஆய்வு

source: Not all the details stored for any one study are displayed, just those thought to be most useful. If there are others you'd like to see, add an issue to the tracker.
ta: எந்தவொரு ஆய்விற்கும் சேமிக்கப்பட்ட அனைத்து விவரங்களும் காட்டப்படுவதில்லை, மிகவும் பயனுள்ளதாக இருக்கும் என்று கருதப்படுபவர்கள். நீங்கள் பார்க்க விரும்பும் மற்றவர்கள் இருந்தால், டிராக்கரில் ஒரு சிக்கலைச் சேர்க்கவும்.

source: The final field in the summary at the top is called 'Test patient indicators?' When studies are imported the ID and patient name fields are both ignored, but they are parsed to check if they have 'phy', 'test' or 'qa' in them to help exclude them from the data analysis. If they do, then this information is added to the field and is displayed both in the web interface as a Test patient indicator and in the Excel export. The name and ID themselves are not reproduced, simply the presence of one of the key words. Therefore a patient named 'Phyliss' would trigger this, but only 'Phy' would be reproduced in this field. Other fields will also help to confirm whether a study is for a real patient such as the lack of an Accession Number and an unusual patient age.
ta: மேலே உள்ள சுருக்கத்தின் இறுதி புலம் 'சோதனை நோயாளி குறிகாட்டிகள்?' ஆய்வுகள் இறக்குமதி செய்யப்படும்போது, ​​ஐடி மற்றும் நோயாளியின் பெயர் புலங்கள் இரண்டும் புறக்கணிக்கப்படுகின்றன, ஆனால் அவை தரவு பகுப்பாய்விலிருந்து விலக்க உதவும் வகையில் அவற்றில் 'பை', 'சோதனை' அல்லது 'QA' இருக்கிறதா என்று சோதிக்க அவை பாகுபடுத்தப்படுகின்றன. அவர்கள் அவ்வாறு செய்தால், இந்த செய்தி புலத்தில் சேர்க்கப்பட்டு வலை இடைமுகத்தில் ஒரு சோதனை நோயாளி குறிகாட்டியாகவும் எக்செல் ஏற்றுமதியிலும் காட்டப்படும். பெயர் மற்றும் ஐடி தானாகவே இனப்பெருக்கம் செய்யப்படவில்லை, வெறுமனே முக்கிய சொற்களில் ஒன்றின் இருப்பு. எனவே 'பைலிச்' என்ற நோயாளி இதைத் தூண்டும், ஆனால் இந்த துறையில் 'பை' மட்டுமே இனப்பெருக்கம் செய்யப்படும். அணுகல் எண் இல்லாதது மற்றும் அசாதாரண நோயாளி அகவை போன்ற உண்மையான நோயாளிக்கு ஒரு ஆய்வு இருக்கிறதா என்பதை உறுதிப்படுத்த மற்ற துறைகள் உதவும்.

source: For fluoroscopy the table showing details of each exposure can be sorted by clicking on the table headings.
ta: ஃப்ளோரோச்கோபிக்கு ஒவ்வொரு வெளிப்பாட்டின் விவரங்களையும் காட்டும் அட்டவணையை அட்டவணை தலைப்புகளில் சொடுக்கு செய்வதன் மூலம் வரிசைப்படுத்தலாம்.

source: A note on time data for fluoroscopy studies
ta: ஃப்ளோரோச்கோபி ஆய்வுகளுக்கான நேர தரவு பற்றிய குறிப்பு

source: On the page showing a specific fluoroscopy study there is a table that shows the details of each irradiation event in the study. This table includes a column labelled as::
ta: ஒரு குறிப்பிட்ட ஃப்ளோரோச்கோபி ஆய்வைக் காட்டும் பக்கத்தில், ஆய்வில் ஒவ்வொரு கதிர்வீச்சு நிகழ்வின் விவரங்களையும் காண்பிக்கும் ஒரு அட்டவணை உள்ளது. இந்த அட்டவணையில் :: என பெயரிடப்பட்ட நெடுவரிசை உள்ளது

source: The ``Duration`` value is the amount of time that the exposure switch or pedal was pressed (technically, this should be the time from the loading of the first x-ray pulse to the time of the trailing edge of the final pulse for that irradiation event). The ``Exposure time`` value is different: this is the total time that the x-ray beam was actually switched on for during the irradiation event. So for pulsed fluoroscopy the ``Exposure time`` will be (much) shorter than the ``Duration``.
ta: `` காலம்`` மதிப்பு என்பது வெளிப்பாடு சுவிட்ச் அல்லது மிதி அழுத்தப்பட்ட நேரமாகும் (தொழில்நுட்ப ரீதியாக, இது முதல் எக்ச்-ரே துடிப்பை ஏற்றுவதிலிருந்து இறுதி துடிப்பின் பின்தங்கிய விளிம்பின் நேரம் வரை இருக்க வேண்டும் அந்த கதிர்வீச்சு நிகழ்வு). `` வெளிப்பாடு நேரம்`` மதிப்பு வேறுபட்டது: கதிர்வீச்சு நிகழ்வின் போது எக்ச்ரே கற்றை உண்மையில் மாற்றப்பட்ட மொத்த நேரம் இது. எனவே துடிப்புள்ள ஃப்ளோரோச்கோபியைப் பொறுத்தவரை `` வெளிப்பாடு நேரம்`` `` கால அளவு`` ஐ விட (அதிகம்) குறைவாக இருக்கும்.

source: Near the top of each fluoroscopy study in the detail view is a table summarising the DAP, dose at reference point and duration for each irradiation type used in the study. Totals are also shown. The ``Total duration`` values in this table show the amount of time that the exposure switch or pedal was pressed.
ta: விரிவான பார்வையில் ஒவ்வொரு ஃப்ளோரோச்கோபி ஆய்வின் மேற்புறத்திற்கு அருகில் டிஏபி, குறிப்பு புள்ளியில் டோச் மற்றும் ஆய்வில் பயன்படுத்தப்படும் ஒவ்வொரு கதிர்வீச்சு வகைக்கும் கால அளவு. மொத்தங்களும் காட்டப்பட்டுள்ளன. இந்த அட்டவணையில் உள்ள `` மொத்த காலம்`` மதிப்புகள் வெளிப்பாடு சுவிட்ச் அல்லது மிதி அழுத்தப்பட்ட நேரத்தைக் காட்டுகின்றன.

source: Not-patient indicator settings
ta: நோயாளி காட்டி அமைப்புகள் அல்ல

source: The standard configuration for OpenREM is to not store any patient identifiable information. Therefore it can be difficult to distinguish between real patients and test or quality assurance exposures.
ta: OpenREM க்கான நிலையான உள்ளமைவு எந்தவொரு நோயாளியின் அடையாளம் காணக்கூடிய தகவலையும் சேமிக்கக்கூடாது. எனவே உண்மையான நோயாளிகளை வேறுபடுத்துவது மற்றும் சோதனை அல்லது தர உத்தரவாத வெளிப்பாடுகளை வேறுபடுத்துவது கடினம்.

source: *Changed in 0.8.0*
ta: *0.8.0 இல் மாற்றப்பட்டது*

source: To aid identification of non-patient exposures, the patient name and the patient ID are checked against a set of patterns, and if a match is found then the pattern is recorded in the database before the patient name and ID are deleted or converted to a hash (see :doc:`patientid` for details).
ta: நோயாளி அல்லாத வெளிப்பாடுகளை அடையாளம் காண உதவ, நோயாளியின் பெயர் மற்றும் நோயாளி ஐடி ஒரு வடிவங்களுக்கு எதிராக சரிபார்க்கப்படுகின்றன, மேலும் ஒரு போட்டி கண்டுபிடிக்கப்பட்டால், நோயாளியின் பெயர் மற்றும் ஐடி நீக்கப்படுவதற்கு முன்பு அல்லது a க்கு மாற்றப்படுவதற்கு முன்பு தரவுத்தளத்தில் பதிவு செய்யப்படுகிறது ஆச் (காண்க: டாக்: `நோயாளி ஐடி` விவரங்களுக்கு).

source: Setting the patterns to identify non-patient studies
ta: நோயாளி அல்லாத ஆய்வுகளை அடையாளம் காண வடிவங்களை அமைத்தல்

source: Use the ``Config`` menu and select ``Not-patient indicators``:
ta: `` Config`` மெனுவைப் பயன்படுத்தி `` அல்லாத நோயாளி குறிகாட்டிகள்`:

source: The patient name and the ID are matched against the patterns you configure. The patterns make use of wildcards as per the following table, and are case insensitive:
ta: நோயாளியின் பெயர் மற்றும் ஐடி நீங்கள் கட்டமைக்கும் வடிவங்களுக்கு எதிராக பொருந்துகின்றன. வடிவங்கள் பின்வரும் அட்டவணையின் படி வைல்டு கார்டுகளைப் பயன்படுத்துகின்றன, மேலும் அவை உணர்வற்றவை:

source: Pattern
ta: முறை

source: Meaning
ta: பொருள்

source: matches everything
ta: எல்லாவற்றையும் பொருத்துகிறது

source: matches any single character
ta: எந்த ஒற்றை எழுத்துக்கும் பொருந்துகிறது

source: matches any character in seq
ta: SEQ இல் எந்த கதாபாத்திரமும் பொருந்துகிறது

source: matches any character not in seq
ta: SEQ இல் இல்லாத எந்தவொரு கதாபாத்திரத்திற்கும் பொருந்துகிறது

source: To match all studies where the patient name begins with ``physics``, the pattern should be set to ``physics*``. This would match ``Physics^RoutIQ`` but not match ``Testing^Physics``. The patient name in DICOM is normally formatted ``Family name^Given name^Middle name^Prefix^Suffix``. Therefore to match any studies where the first name is ``Test``, you would set the pattern to be ``*^test*``.
ta: நோயாளியின் பெயர் `` இயற்பியல்`` உடன் தொடங்கும் அனைத்து ஆய்வுகளையும் பொருத்த, வடிவத்தை `` இயற்பியல்*`` என அமைக்க வேண்டும். இது `` இயற்பியல்^ரூட்டிக்`` உடன் பொருந்தாது, ஆனால் `` சோதனை^இயற்பியல்`` உடன் பொருந்தாது. டிகாமில் உள்ள நோயாளியின் பெயர் பொதுவாக வடிவமைக்கப்பட்டுள்ளது `` குடும்ப பெயர்^கொடுக்கப்பட்ட பெயர்^நடுத்தர பெயர்^முன்னொட்டு^பின்னொட்டு``. ஆகவே, முதல் பெயர் `` சோதனை`` இருக்கும் எந்தவொரு ஆய்வையும் பொருத்த, நீங்கள் வடிவத்தை ``*^சோதனை*`` ஆக அமைப்பீர்கள்.

source: If your test patient name always starts with ``PHY`` and then a number, you might use this pattern: ``phy[0-9]*``. Here we have used a range for the sequence to match any number, but it will only match one character per sequence, so a ``*`` is required to match all the characters after the first number. This pattern will match ``Phy12345`` and ``PHY6test`` but not ``Phyliss``.
ta: உங்கள் சோதனை நோயாளியின் பெயர் எப்போதுமே `` பை`` உடன் தொடங்கினால், நீங்கள் இந்த முறையைப் பயன்படுத்தலாம்: `` பை [0-9]*``. எந்தவொரு எண்ணையும் பொருத்த வரிசைக்கு ஒரு வரம்பைப் பயன்படுத்தினோம், ஆனால் இது ஒரு வரிசைக்கு ஒரு எழுத்துடன் மட்டுமே பொருந்தும், எனவே முதல் எண்ணுக்குப் பிறகு அனைத்து எழுத்துக்களையும் பொருத்த ஒரு ``*`` தேவை. இந்த முறை `` phy12345`` மற்றும் `` phy6test`` உடன் பொருந்தும், ஆனால் `` ஃபைலிச்`` அல்ல.

source: The pattern list for patient name and the list for patient ID are separate, so both need to be populated to meet your requirements.
ta: நோயாளியின் பெயருக்கான முறை பட்டியல் மற்றும் நோயாளியின் ஐடியுக்கான பட்டியல் தனித்தனியாக உள்ளன, எனவே உங்கள் தேவைகளைப் நிறைவு செய்ய இருவரும் மக்கள்தொகை பெற வேண்டும்.

source: Creating new patterns
ta: புதிய வடிவங்களை உருவாக்குதல்

source: Click on ``Add ID patterns`` or ``Add name patterns`` in the panel title bar and follow the instructions.
ta: குழு தலைப்பு பட்டியில் `` ஐடி வடிவங்களைச் சேர்க்கவும் `` `பெயர் வடிவங்களைச் சேர்க்கவும்` என்பதைக் சொடுக்கு செய்து வழிமுறைகளைப் பின்பற்றவும்.

source: Modifying patterns
ta: மாற்றும் வடிவங்கள்

source: Click the ``Modify`` link in the row of the pattern you wish to modify.
ta: நீங்கள் மாற்ற விரும்பும் வடிவத்தின் வரிசையில் `` மாற்றியமைத்தல்`` இணைப்பைக் சொடுக்கு செய்க.

source: Deleting patterns
ta: வடிவங்களை நீக்குதல்

source: Click the ``Delete`` link in the row of the pattern you wish to delete. You will be asked to confirm the deletion.
ta: நீங்கள் நீக்க விரும்பும் வடிவத்தின் வரிசையில் `` நீக்கு`` இணைப்பைக் சொடுக்கு செய்க. நீக்குதலை உறுதிப்படுத்த நீங்கள் கேட்கப்படுவீர்கள்.

source: Replicating behaviour of release 0.7.4 and earlier
ta: வெளியீட்டின் நடத்தை 0.7.4 மற்றும் அதற்கு முந்தையது

source: OpenREM releases before 0.8 had the not-patient identification patterns hard-coded. From release 0.8.0 the patterns are (admin) user configurable, but will start with no patterns in place. To add the patterns that would maintain the behaviour of previous releases, use the link at the bottom of the config page, or the link in the add/modify pages.
ta: 0.8 க்கு முன்னர் ஓபன்ரெம் வெளியீடுகள் நோயாளி அல்லாத அடையாள முறைகள் கடின குறியீட்டைக் கொண்டிருந்தன. வெளியீட்டிலிருந்து 0.8.0 வடிவங்கள் (நிர்வாகி) பயனர் உள்ளமைக்கக்கூடியவை, ஆனால் எந்த வடிவங்களும் இல்லாமல் தொடங்கும். முந்தைய வெளியீடுகளின் நடத்தையை பராமரிக்கும் வடிவங்களைச் சேர்க்க, உள்ளமைவு பக்கத்தின் கீழே உள்ள இணைப்பைப் பயன்படுத்தவும் அல்லது பக்கங்களில் சேர்/மாற்றியமைக்கவும் இணைப்பைப் பயன்படுத்தவும்.

source: Adding patient size information from csv using the web interface
ta: வலை இடைமுகத்தைப் பயன்படுத்தி காபிம இலிருந்து நோயாளியின் அளவு தகவல்களைச் சேர்ப்பது

source: Uploading patient size data
ta: நோயாளியின் அளவு தரவைப் பதிவேற்றுகிறது

source: If you log in as a user that is in the ``admingroup``, then a menu is available at the right hand end of the navigation bar:
ta: `` அட்மிங்ரூப்`` இல் இருக்கும் பயனராக நீங்கள் உள்நுழைந்தால், வழிசெலுத்தல் பட்டியின் வலது கை முடிவில் ஒரு பட்டியல் கிடைக்கிறது:

source: Admin import patient size data menu
ta: நிர்வாகி நோயாளியின் அளவு தரவு பட்டியல் இறக்குமதி செய்யுங்கள்

source: The first option takes you to a page where you can upload a csv file containing details of the patient height and weight, plus either the accession number or the Study Instance UID.
ta: முதல் விருப்பம் உங்களை ஒரு பக்கத்திற்கு அழைத்துச் செல்கிறது, அங்கு நோயாளியின் உயரம் மற்றும் எடை பற்றிய விவரங்களைக் கொண்ட ஒரு காபிம கோப்பை பதிவேற்றலாம், மேலும் அணுகல் எண் அல்லது ஆய்வு நிகழ்வு UID.

source: Uploading CSV files containing patient size information
ta: நோயாளியின் அளவு தகவல்களைக் கொண்ட காபிம கோப்புகளை பதிவேற்றுதல்

source: Upload patient size csv file button
ta: நோயாளியின் அளவு காபிம கோப்பு பொத்தானை பதிவேற்றவும்

source: The csv file needs to have at least the required columns. Additional columns will be ignored. If your source of patient size data does not have either the height or the weight column, simply add a new empty column with just the title in the first row.
ta: காபிம கோப்பில் குறைந்தபட்சம் தேவையான நெடுவரிசைகள் இருக்க வேண்டும். கூடுதல் நெடுவரிசைகள் புறக்கணிக்கப்படும். உங்கள் நோயாளியின் அளவு தரவின் மூலத்தில் உயரம் அல்லது எடை நெடுவரிசை இல்லை என்றால், முதல் வரிசையில் தலைப்புடன் புதிய வெற்று நெடுவரிசையைச் சேர்க்கவும்.

source: When you have selected the csv file, press the button to upload it.
ta: நீங்கள் காபிம கோப்பைத் தேர்ந்தெடுத்தால், அதைப் பதிவேற்ற பொத்தானை அழுத்தவும்.

source: Importing the size data to the database
ta: அளவு தரவை தரவுத்தளத்திற்கு இறக்குமதி செய்தல்

source: On the next page select the column header that corresponds to each of the head, weight and ID fields. Also select whether the ID field is an Accession number or a Study UID:
ta: அடுத்த பக்கத்தில் ஒவ்வொரு தலை, எடை மற்றும் ஐடி புலங்களுக்கு ஒத்த நெடுவரிசை தலைப்பைத் தேர்ந்தெடுக்கவும். ஐடி புலம் ஒரு அணுகல் எண் அல்லது ஒரு ஆய்வு UID என்பதைத் தேர்ந்தெடுக்கவும்:

source: When the column headers are selected, click the 'Process the data' button.
ta: நெடுவரிசை தலைப்புகள் தேர்ந்தெடுக்கப்பட்டால், 'தரவைச் செயலாக்கு' பொத்தானைக் சொடுக்கு செய்க.

source: Selecting header information
ta: தலைப்பு தகவல்களைத் தேர்ந்தெடுப்பது

source: The progress of the import is then reported on the patient size imports page:
ta: இறக்குமதியின் முன்னேற்றம் பின்னர் நோயாளியின் அளவு இறக்குமதி பக்கத்தில் தெரிவிக்கப்படுகிறது:

source: Patient size importing
ta: நோயாளியின் அளவு இறக்குமதி

source: During the import, it is possible to abort the process by clicking the button seen in the image above. The log file is available from the completed table whether it completed or not - there is no indication that the import was aborted.
ta: இறக்குமதியின் போது, ​​மேலே உள்ள படத்தில் காணப்படும் பொத்தானைக் சொடுக்கு செய்வதன் மூலம் செயல்முறையை நிறுத்த முடியும். பதிவு கோப்பு நிறைவு செய்யப்பட்டதா இல்லையா என்பதை நிறைவு செய்த அட்டவணையில் இருந்து கிடைக்கிறது - இறக்குமதி கைவிடப்பட்டது என்பதற்கான அறிகுறி எதுவும் இல்லை.

source: As soon as the import is complete, the source csv file is deleted from the server.
ta: இறக்குமதி முடிந்தவுடன், மூல காபிம கோப்பு சேவையகத்திலிருந்து நீக்கப்படும்.

source: Reviewing previous imports
ta: முந்தைய இறக்குமதியை மதிப்பாய்வு செய்தல்

source: After an import is complete, it is listed in the completed import tasks table. You can also get to this page from the Admin menu:
ta: இறக்குமதி முடிந்ததும், இது நிறைவு செய்யப்பட்ட இறக்குமதி பணிகள் அட்டவணையில் பட்டியலிடப்பட்டுள்ளது. நிர்வாக மெனுவிலிருந்து இந்தப் பக்கத்தையும் நீங்கள் பெறலாம்:

source: Imports link
ta: இறக்குமதி இணைப்பு

source: For each import, there is a link to the logfile, which looks something like this. With this import accession numbers weren't available so the patient size information was matched to the study instance UID:
ta: ஒவ்வொரு இறக்குமதிக்கும், லாக்ஃபைலுக்கு ஒரு இணைப்பு உள்ளது, இது இதுபோன்றதாகத் தெரிகிறது. இந்த இறக்குமதி அணுகல் எண்கள் கிடைக்கவில்லை, எனவே நோயாளியின் அளவு செய்தி UID ஆய்வு நிகழ்வோடு பொருந்தியது:

source: Size import logs
ta: அளவு இறக்குமதி பதிவுகள்

source: Deleting import logs
ta: இறக்குமதி பதிவுகளை நீக்குகிறது

source: The completed import tasks table also has a delete check box against each record and a delete button at the bottom. The csv file originally imported has already been deleted - this delete function is to remove the record of the import and the log file associated with it from the database/disk.
ta: நிறைவு செய்யப்பட்ட இறக்குமதி பணிகள் அட்டவணையில் ஒவ்வொரு பதிவிற்கும் எதிராக நீக்குதல் தேர்வுப்பெட்டியும் கீழே உள்ள நீக்குதல் பொத்தானும் உள்ளது. முதலில் இறக்குமதி செய்யப்பட்ட காபிம கோப்பு ஏற்கனவே நீக்கப்பட்டது - இந்த நீக்குதல் செயல்பாடு இறக்குமதியின் பதிவு மற்றும் அதனுடன் தொடர்புடைய பதிவு கோப்பை தரவுத்தளம்/வட்டில் இருந்து அகற்றுவதாகும்.

source: Adding patient size information from csv using the command line
ta: கட்டளை வரியைப் பயன்படுத்தி காபிம இலிருந்து நோயாளியின் அளவு தகவல்களைச் சேர்ப்பது

source: Usage:
ta: பயன்பாடு:

source: ``-h, --help``
ta: `` -h,--எல்ப்``

source: Print the help text.
ta: உதவி உரையை அச்சிடுக.

source: Use Study Instance UID instead of Accession Number.
ta: அணுகல் எண்ணுக்கு பதிலாக ஆய்வு நிகழ்வு UID ஐப் பயன்படுத்தவும்.

source: Print to the standard output the success or otherwise of inserting each value.
ta: ஒவ்வொரு மதிப்பையும் செருகுவதன் வெற்றியை அல்லது இல்லையெனில் நிலையான வெளியீட்டிற்கு அச்சிடுக.

source: csv file containing the height and/or weight information and study identifier. Other columns will be ignored. Use quotes if the filepath has spaces.
ta: உயரம் மற்றும்/அல்லது எடை செய்தி மற்றும் ஆய்வு அடையாளங்காட்டியைக் கொண்ட காபிம கோப்பு. மற்ற நெடுவரிசைகள் புறக்கணிக்கப்படும். ஃபில்பாத்தில் இடங்கள் இருந்தால் மேற்கோள்களைப் பயன்படுத்தவும்.

source: ``id``
ta: `` ஐடி``

source: Column title for the accession number or study instance UID. Use quotes if the title has spaces.
ta: அணுகல் எண் அல்லது ஆய்வு நிகழ்வு UID க்கான நெடுவரிசை தலைப்பு. தலைப்பில் இடங்கள் இருந்தால் மேற்கோள்களைப் பயன்படுத்தவும்.

source: ``height``
ta: `` உயரம்``

source: Column title for the patient height (DICOM size) - if this information is missing simply add a blank column with a suitable title. Use quotes if the title has spaces.
ta: நோயாளியின் உயரத்திற்கான நெடுவரிசை தலைப்பு (DICOM அளவு) - இந்த செய்தி காணவில்லை என்றால் பொருத்தமான தலைப்புடன் ஒரு வெற்று நெடுவரிசையைச் சேர்க்கவும். தலைப்பில் இடங்கள் இருந்தால் மேற்கோள்களைப் பயன்படுத்தவும்.

source: ``weight``
ta: `` எடை`

source: Column title for the patient weight - if this information is missing simply add a blank column with a suitable title. Use quotes if the title has spaces.
ta: நோயாளியின் எடைக்கான நெடுவரிசை தலைப்பு - இந்த செய்தி காணவில்லை என்றால் பொருத்தமான தலைப்புடன் ஒரு வெற்று நெடுவரிசையைச் சேர்க்கவும். தலைப்பில் இடங்கள் இருந்தால் மேற்கோள்களைப் பயன்படுத்தவும்.

source: Importing data to OpenREM
ta: OpenREM க்கு தரவை இறக்குமதி செய்தல்

source: From local DICOM files
ta: உள்ளக DICOM கோப்புகளிலிருந்து

source: If you have RDSRs or RRDSRs, DX, MG, PET or NM images or Philips CT Dose Info images, you can import them directly into OpenREM:
ta: உங்களிடம் ஆர்.டி.எச்.ஆர்.எச் அல்லது ஆர்.ஆர்.டி.எச்.ஆர்.எச், டி.எக்ச், எம்.சி, பி.இ.டி அல்லது என்.எம் படங்கள் அல்லது பிலிப்ச் சி.டி டோச் செய்தி படங்கள் இருந்தால், அவற்றை நேரடியாக ஓபன்ரெமில் இறக்குமதி செய்யலாம்:
