Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: The export can then be started and monitored in the normal way by clicking on the 'PHE 2019 survey' button. The resulting export will be in xlsx format, with one header row. The data from row 2 onwards can be copied and pasted directly into row 150 (152 for paed survey) onwards of the Patient and Protocol sheet of the adult PHE data collection spreadsheet. The adult survey starts in column A, the paediatric survey starts in column B. Column AL (AM for paed survey) is for patient comments, and OpenREM uses this cell to record the series types that have been exported for each study. This can therefore be used to double check the data is as you expect it to be. If the protocol has more than four series excluding localisers, the data is continued in the same format from column AM (AN for paed) onwards.
ta: 'PHE 2019 கணக்கெடுப்பு' பொத்தானைக் சொடுக்கு செய்வதன் மூலம் ஏற்றுமதியைத் தொடங்கி சாதாரண வழியில் கண்காணிக்க முடியும். இதன் விளைவாக ஏற்றுமதி எக்ச்எல்எச்எக்ச் வடிவத்தில், ஒரு தலைப்பு வரிசையில் இருக்கும். வரிசை 2 முதல் தரவுகளை நகலெடுத்து நேரடியாக 150 வது வரிசையில் (பேய்ட் கணக்கெடுப்புக்கு 152) மற்றும் அகவை வந்தோருக்கான PHE தரவு சேகரிப்பு விரிதாளின் நெறிமுறை தாள் வரை ஒட்டலாம். அகவை வந்தோர் கணக்கெடுப்பு A நெடுவரிசையில் தொடங்குகிறது, குழந்தை கணக்கெடுப்பு நெடுவரிசை A இல் தொடங்குகிறது. நெடுவரிசை AL (AM PADED கணக்கெடுப்புக்கு AM) நோயாளியின் கருத்துக்களுக்காக, மற்றும் ஒவ்வொரு ஆய்விற்கும் ஏற்றுமதி செய்யப்பட்ட தொடர் வகைகளை பதிவு செய்ய ஓபன்ரெம் இந்த கலத்தைப் பயன்படுத்துகிறது. எனவே தரவை நீங்கள் எதிர்பார்ப்பது போல இருமுறை சரிபார்க்க இது பயன்படுத்தப்படலாம். நெறிமுறையில் உள்ளூர்மயமாக்காரர்களைத் தவிர்த்து நான்கு தொடர்களுக்கு மேல் இருந்தால், தரவு AM (AN பேய்ட்) முதல் அதே வடிவத்தில் தொடரப்படுகிறது.

source: PHE 2019 X-ray, fluoroscopy and interventional radiology survey
ta: PHE 2019 எக்ச்ரே, ஃப்ளோரோச்கோபி மற்றும் தலையீட்டு கதிரியக்கவியல் ஆய்வு

source: As with the PHE and IPEM CT surveys, the PHE exports on the radiography and fluoroscopy modality filter pages are designed to paste directly into templates provided by PHE via the Medical-Physics-Engineering JiscMail e-mail list or available directly from PHE.
ta: PHE மற்றும் IPEM CT கணக்கெடுப்புகளைப் போலவே, ரேடியோகிராஃபி மற்றும் ஃப்ளோரோச்கோபி மோடலிட்டி வடிகட்டி பக்கங்களில் உள்ள PHE ஏற்றுமதிகள் மருத்துவ-இயற்பியல்-பொறியியல் JISCMAIL மின்னஞ்சல் பட்டியல் வழியாக அல்லது PHE இலிருந்து நேரடியாகக் கிடைக்கின்றன.

source: The spreadsheets provided are:
ta: வழங்கப்பட்ட விரிதாள்கள்:

source: Planar Radiography Survey:
ta: பிளானர் ரேடியோகிராஃபி ஆய்வு:

source: ``PHE_Dose_PR_Patient_xxxxx.xlsx`` Individual patient records - OpenREM export is designed for this
ta: `` Phe_dose_pr_patient_xxxxx.xlsx`` தனிப்பட்ட நோயாளி பதிவுகள் - ஓபன்ரெம் ஏற்றுமதி இதற்கு வடிவமைக்கப்பட்டுள்ளது

source: ``PHE_Dose_PR_Patient_X26_xxxxx.xlsx`` Individual patient records, specifically for skeletal surveys
ta: `` Phe_dose_pr_patient_x26_xxxx.xlsx`` தனிப்பட்ட நோயாளி பதிவுகள், குறிப்பாக எலும்பு ஆய்வுகளுக்கு

source: ``PHE_Dose_PR_System_xxxxx.xlsx`` System mean and median - OpenREM does not support this summary format directly
ta: `` Phe_dose_pr_system_xxxxx.xlsx`` கணினி சராசரி மற்றும் சராசரி - ஓபன்ரெம் இந்த சுருக்க வடிவமைப்பை நேரடியாக ஆதரிக்கவில்லை

source: IR and Fluoroscopy Survey:
ta: ஐஆர் மற்றும் ஃப்ளோரோச்கோபி ஆய்வு:

source: ``PHE_Dose_IR_Fluoro_Patient_xxxxx.xlsx`` Individual patient records - OpenREM export is designed for this
ta: `` Phe_dose_ir_fluoro_patient_xxxx.xlsx`` தனிப்பட்ட நோயாளி பதிவுகள் - ஓபன்ரெம் ஏற்றுமதி இதற்கு வடிவமைக்கப்பட்டுள்ளது

source: ``PHE_Dose_IR_Fluoro_System_xxxxx.xlsx`` System mean and median - OpenREM does not support this summary format directly
ta: `` Phe_dose_ir_fluoro_system_xxxxx.xlsx`` கணினி சராசரி மற்றும் சராசரி - இந்த சுருக்க வடிவமைப்பை நேரடியாக ஆதரிக்கவில்லை

source: As with the CT surveys, care should be taken to read and fill in the instructions and questions asked in the templates.
ta: சி.டி கணக்கெடுப்புகளைப் போலவே, வார்ப்புருக்களில் கேட்கப்படும் அறிவுறுத்தல்கள் மற்றும் கேள்விகளைப் படித்து நிரப்ப கவனமாக இருக்க வேண்டும்.

source: For the **radiography survey**, there are two types of studies asked for:
ta: ** ரேடியோகிராஃபி கணக்கெடுப்பு ** க்கு, இரண்டு வகையான ஆய்வுகள் கேட்கப்படுகின்றன:

source: Single-projection studies - for example the sheet ``Abdomen_AP_DAP_by_record``
ta: ஒற்றை -திட்ட ஆய்வுகள் - எடுத்துக்காட்டாக தாள் `` அடிவயிற்று_ஏபி_டாப்_பி_ரெகார்ட்``

source: Multi-projection studies - for example the sheet ``Abdomen_exam_DAP_by_record``
ta: பல திட்ட ஆய்வுகள் - எடுத்துக்காட்டாக தாள் `` அடிவயிற்று_எக்ச்ஏஎம்_டாப்_பி_ரெகார்ட்``

source: For studies in the former category, select your data as appropriate on the Radiography filter page, making use of the 'Num. events total' filter to ensure all selected studies have just one exposure. Then use the 'PHE 2019 Survey: Projection' button to export the data. If any exams do have more than one exposure, the export will continue with a warning, and only include the first exposure of each study in the export.
ta: முந்தைய பிரிவில் உள்ள ஆய்வுகளுக்கு, ரேடியோகிராஃபி வடிகட்டி பக்கத்தில் உங்கள் தரவைத் தேர்ந்தெடுத்து, 'எண்ணைப் பயன்படுத்துங்கள். தேர்ந்தெடுக்கப்பட்ட அனைத்து ஆய்வுகளும் ஒரு வெளிப்பாடு மட்டுமே என்பதை உறுதிப்படுத்த நிகழ்வுகள் மொத்த 'வடிகட்டி. தரவை ஏற்றுமதி செய்ய 'PHE 2019 கணக்கெடுப்பு: ப்ரொசெக்சன்' பொத்தானைப் பயன்படுத்தவும். எந்தவொரு தேர்வுகளிலும் ஒன்றுக்கு மேற்பட்ட வெளிப்பாடுகள் இருந்தால், ஏற்றுமதி ஒரு எச்சரிக்கையுடன் தொடரும், மேலும் ஏற்றுமதியில் ஒவ்வொரு ஆய்வின் முதல் வெளிப்பாட்டையும் மட்டுமே உள்ளடக்கும்.

source: For multi-projection studies, filter as before, setting the 'Num. events total' filter if the exam normally has a specific number of views, and export using the 'PHE 2019 Survey: Study' button. If any of the studies have more than six exposures, the export will automatically format the data to suit the template designed for skeletal studies. This allows for up to 20 exposures. However, you will need to request the 'bespoke' template from PHE as it was not distributed in the original email!
ta: பல திட்ட ஆய்வுகளுக்கு, முன்பு போலவே வடிகட்டவும், 'எண்ணை அமைக்கவும். நிகழ்வுகள் மொத்தம் 'தேர்வு பொதுவாக ஒரு குறிப்பிட்ட எண்ணிக்கையிலான பார்வைகளைக் கொண்டிருந்தால் வடிகட்டி,' PHE 2019 கணக்கெடுப்பு: ஆய்வு 'பொத்தானைப் பயன்படுத்தி ஏற்றுமதி செய்யுங்கள். எந்தவொரு ஆய்விலும் ஆறு வெளிப்பாடுகள் இருந்தால், ஏற்றுமதி தானாகவே எலும்பு ஆய்வுகளுக்காக வடிவமைக்கப்பட்ட வார்ப்புருவுக்கு ஏற்றவாறு தரவை வடிவமைக்கும். இது 20 வெளிப்பாடுகள் வரை அனுமதிக்கிறது. இருப்பினும், அசல் மின்னஞ்சலில் விநியோகிக்கப்படாததால், PHE இலிருந்து 'பெச்போக்' வார்ப்புருவை நீங்கள் கோர வேண்டும்!

source: The exported spreadsheet has a header row at the top. Copy from the second row onward and paste into the relevant sheet in the PHE template in row ``7``.
ta: ஏற்றுமதி செய்யப்பட்ட விரிதாள் மேலே ஒரு தலைப்பு வரிசையைக் கொண்டுள்ளது. இரண்டாவது வரிசையில் இருந்து நகலெடுத்து, `` 7`` வரிசையில் PHE வார்ப்புருவில் தொடர்புடைய தாளில் ஒட்டவும்.

source: For The **fluoroscopy survey**, select the studies as appropriate and use the 'PHE 2019 Survey' button to export the data. The resulting data should be copied into the ``PHE_Dose_IR_Fluoro_Patient_xxxxx.xlsx`` as follows:
ta: ** ஃப்ளோரோச்கோபி கணக்கெடுப்பு ** க்கு, ஆய்வுகள் பொருத்தமானவை என்பதைத் தேர்ந்தெடுத்து தரவை ஏற்றுமதி செய்ய 'PHE 2019 கணக்கெடுப்பு' பொத்தானைப் பயன்படுத்தவும். இதன் விளைவாக தரவை `` phe_dose_ir_fluoro_patient_xxxx.xlsx`` இல் நகலெடுக்க வேண்டும்:

source: Select the exported data from column ``A`` through to column ``AQ``, row ``1`` though to the last row of the exported data
ta: ஏற்றுமதி செய்யப்பட்ட தரவின் கடைசி வரிசையில் இருந்தாலும் `` aq`` நெடுவரிசை `` aq`` நெடுவரிசை `` aq`` நெடுவரிசை வரை ஏற்றுமதி செய்யப்பட்ட தரவைத் தேர்ந்தெடுக்கவும்

source: Select the cell ``A1`` and choose the full Paste Special menu - ``Ctrl+Alt+V`` or right-click Paste Special -> Paste Special. Then select Paste 'Formulas' and 'Skip Blanks'.
ta: கலத்தைத் தேர்ந்தெடுத்து முழு பேச்ட் சிறப்பு மெனுவைத் தேர்வுசெய்க -`` ctrl+alt+v`` அல்லது வலது சொடுக்கு பேச்ட் சிறப்பு -> பேச்ட் சிறப்பு. பின்னர் 'சூத்திரங்கள்' மற்றும் 'வெற்றிடங்களைத் தவிர்' என்பதைத் தேர்ந்தெடுக்கவும்.

source: This will paste the correct DAP and time units into row ``4`` along with the exported data into row ``7`` onwards. The DAP units exported using the radiography exports (cGy·cm²) and fluoroscopy (Gy·m²) may not correspond to the units normally used on your system, but the exported values will be correct for the units stated.
ta: இது சரியான டிஏபி மற்றும் நேர அலகுகளை `4`` வரிசையில் ஏற்றுமதி செய்யும். ரேடியோகிராஃபி ஏற்றுமதிகள் (சி.சி.ஒய் · செ.மீ²) மற்றும் ஃப்ளோரோச்கோபி (சி.ஒய் · எம்²) ஆகியவற்றைப் பயன்படுத்தி ஏற்றுமதி செய்யப்படும் டிஏபி அலகுகள் உங்கள் கணினியில் பொதுவாகப் பயன்படுத்தப்படும் அலகுகளுடன் ஒத்திருக்காது, ஆனால் ஏற்றுமதி செய்யப்பட்ட மதிப்புகள் கூறப்பட்ட அலகுகளுக்கு சரியாக இருக்கும்.

source: Opening csv exports in Excel
ta: எக்செல் இல் சி.எச்.வி ஏற்றுமதியைத் திறக்கிறது

source: If the export contains non-ASCII characters, then Microsoft Excel is unlikely to display them correctly by default. This issue does not occur with Libre Office which defaults to UTF-8 -- behaviour with other applications will vary.
ta: ஏற்றுமதியில் ASCII அல்லாத எழுத்துக்கள் இருந்தால், நுண்மென் எக்செல் இயல்புநிலையாக அவற்றை சரியாகக் காண்பிக்க வாய்ப்பில்லை. யுடிஎஃப் -8 க்கு இயல்புநிலையாக இருக்கும் லிப்ரே அலுவலகத்துடன் இந்த சிக்கல் ஏற்படாது-பிற பயன்பாடுகளுடன் நடத்தை மாறுபடும்.

source: To correctly render characters in csv files with Excel, you will need to follow the following procedure:
ta: எக்செல் மூலம் காபிம கோப்புகளில் எழுத்துக்களை சரியாக வழங்க, நீங்கள் பின்வரும் நடைமுறையைப் பின்பற்ற வேண்டும்:

source: Open Excel.
ta: எக்செல் திறந்த.

source: On the ``Data`` tab of the ribbon interface, select ``From Text`` in the ``Get External Data`` section.
ta: ரிப்பன் இடைமுகத்தின் `` தரவு`` தாவலில், `` வெளிப்புற தரவைப் பெறுங்கள்` பிரிவில் `` என்பதைத் தேர்ந்தெடுக்கவும்.

source: Select your exported csv file and click ``Import``
ta: உங்கள் ஏற்றுமதி செய்யப்பட்ட காபிம கோப்பைத் தேர்ந்தெடுத்து `` இறக்குமதி`` என்பதைக் சொடுக்கு செய்க

source: Ensure that Data Type ``Delimited`` is selected.
ta: தரவு வகை `` பிரிக்கப்பட்ட`` தேர்ந்தெடுக்கப்பட்டிருப்பதை உறுதிசெய்க.

source: Change the ``File origin`` from to ``65001 : Unicode (UTF-8)`` -- the easiest way to find it is to scroll right to the bottom of the list, then move up one.
ta: `` கோப்பு தோற்றம்`` இலிருந்து `` 65001 க்கு மாற்றவும்: யூனிகோட் (யுடிஎஃப் -8) ``-அதைக் கண்டுபிடிப்பதற்கான எளிதான வழி, பட்டியலின் அடிப்பகுதியில் வலதுபுறமாக உருட்டுவதே, பின்னர் ஒன்றை நகர்த்தவும்.

source: Click ``Next >``
ta: `` அடுத்து> `` என்பதைக் சொடுக்கு செய்க

source: Change the delimiter to just ``Comma``
ta: டிலிமிட்டரை `` கமா`` ஆக மாற்றவும்

source: Either click ``Finish`` or ``Next >`` if you want to further customise the import.
ta: இறக்குமதியை மேலும் தனிப்பயனாக்க விரும்பினால் `` முடிக்கவும் `` `அடுத்து>` `என்பதைக் சொடுக்கு செய்க.

source: Fluroscopy high dose alerts
ta: ஃப்ளோரோச்கோபி உயர் டோச் எச்சரிக்கைகள்

source: Alert level configuration
ta: எச்சரிக்கை நிலை உள்ளமைவு

source: Config options
ta: கட்டமைப்பு விருப்பங்கள்

source: Figure 1: The ``Config`` menu (user and admin)
ta: படம் 1: `` config`` பட்டியல் (பயனர் மற்றும் நிர்வாகி)

source: The system highlights fluoroscopy studies that have exceeded defined levels of DAP, total dose at reference point and peak skin dose. These alert levels can be configured by an OpenREM administrator via the `Fluoro alert levels` option in the ``Config`` menu (figure 1).
ta: இந்த அமைப்பு ஃப்ளோரோச்கோபி ஆய்வுகளை எடுத்துக்காட்டுகிறது, அவை வரையறுக்கப்பட்ட அளவிலான டிஏபி, குறிப்பு புள்ளியில் மொத்த டோச் மற்றும் உச்ச தோல் டோச் ஆகியவற்றை மீறுகின்றன. இந்த எச்சரிக்கை நிலைகளை `` உள்ளமைவு`` பட்டியலில் (படம் 1) `ஃப்ளோரோ எச்சரிக்கை நிலைகள்` விருப்பம் வழியாக ஓபன்ரெம் நிர்வாகியால் கட்டமைக்க முடியும்.

source: The default alert levels are 20000 cGy.cm\ :sup:`2` DAP, 2 Gy total dose at reference point and 2 Gy peak skin dose(figure 2).
ta: இயல்புநிலை எச்சரிக்கை நிலைகள் 20000 cgy.cm \: sup: `2` dap, 2 gy மொத்த அளவு குறிப்பு புள்ளியில் மற்றும் 2 Gy உச்ச தோல் டோச் (படம் 2).

source: Fluoroscopy high dose alert settings
ta: ஃப்ளோரோச்கோபி உயர் டோச் எச்சரிக்கை அமைப்புகள்

source: Figure 2: Fluoroscopy high dose alert settings
ta: படம் 2: ஃப்ளோரோச்கோபி உயர் டோச் எச்சரிக்கை அமைப்புகள்

source: Figures 3 and 4 illustrate how studies that exceed an alert level are highlighted in the filtered and detailed fluoroscopy views.
ta: வடிகட்டப்பட்ட மற்றும் விரிவான ஃப்ளோரோச்கோபி காட்சிகளில் எச்சரிக்கை நிலையை மீறும் ஆய்வுகள் எவ்வாறு முன்னிலைப்படுத்தப்படுகின்றன என்பதை புள்ளிவிவரங்கள் 3 மற்றும் 4 விளக்குகின்றன.

source: Filtered view showing the highlighting of some high dose studies
ta: சில உயர் டோச் ஆய்வுகளின் சிறப்பம்சத்தைக் காட்டும் வடிகட்டப்பட்ட பார்வை

source: Figure 3: Filtered view showing the highlighting of some high dose studies
ta: படம் 3: சில உயர் டோச் ஆய்வுகளின் சிறப்பம்சத்தைக் காட்டும் வடிகட்டப்பட்ட பார்வை

source: Detailed view showing high-dose highlighting
ta: உயர்-டோச் சிறப்பம்சத்தைக் காட்டும் விரிவான பார்வை

source: Figure 4: Detailed view showing high-dose highlighting
ta: படம் 4: உயர்-டோச் சிறப்பம்சத்தைக் காட்டும் விரிவான பார்வை

source: Alerts for cumulative dose over a period of time
ta: ஒரு குறிப்பிட்ட காலப்பகுதியில் ஒட்டுமொத்த அளவுக்கான விழிப்பூட்டல்கள்

source: As well as alerting to individual studies that exceed alert levels the system can be configured to calculate cumulative dose over a defined number of weeks for studies with matching patient IDs. When this is activated, for each study OpenREM looks for earlier fluoroscopy studies that have taken place that share the same patient ID, or encrypted patient ID, and sums the study DAP and total dose at reference point values. The time period that is used is configured by an OpenREM administrator, and defaults to 12 weeks (figure 2). This feature has not yet been implemented for the skin dose.
ta: எச்சரிக்கை நிலைகளை மீறும் தனிப்பட்ட ஆய்வுகளுக்கு எச்சரிக்கை செய்வதோடு, பொருந்தக்கூடிய நோயாளி ஐடிகளுடன் ஆய்வுகளுக்கான வரையறுக்கப்பட்ட எண்ணிக்கையிலான வாரங்களில் ஒட்டுமொத்த அளவைக் கணக்கிட கணினியை கட்டமைக்க முடியும். இது செயல்படுத்தப்படும் போது, ​​ஒவ்வொரு ஆய்விற்கும் ஓபன்ரெம் ஒரே நோயாளி ஐடியைப் பகிர்ந்து கொள்ளும் முந்தைய ஃப்ளோரோச்கோபி ஆய்வுகளைத் தேடுகிறது, அல்லது நோயாளி ஐடியை மறைகுறியாக்கியது, மேலும் ஆய்வு புள்ளி மதிப்புகளில் ஆய்வு டிஏபி மற்றும் மொத்த அளவைக் கொண்டுள்ளது. பயன்படுத்தப்படும் காலம் ஒரு ஓபன்ரெம் நிர்வாகியால் கட்டமைக்கப்படுகிறது, மேலும் இயல்புநிலை 12 வாரங்களுக்கு (படம் 2). இந்த நற்பொருத்தம் தோல் டோசுக்கு இன்னும் செயல்படுத்தப்படவில்லை.

source: For this feature to work the storage of patient ID or encrypted patient ID must be enabled (see the :doc:`patientid` documentation).
ta: இந்த நற்பொருத்தம் வேலை செய்ய நோயாளி ஐடி அல்லது மறைகுறியாக்கப்பட்ட நோயாளி ஐடியை சேமித்து வைக்க வேண்டும் (பார்க்க: டாக்: `நோயாளியின் ஆவணங்கள்).

source: The configuration settings for this feature are (figure 2):
ta: இந்த அம்சத்திற்கான உள்ளமைவு அமைப்புகள் (படம் 2):

source: The number of previous weeks over which to sum DAP and dose at RP for studies with matching patient ID is defined in the options
ta: நோயாளியின் ஐடியுடன் பொருந்தக்கூடிய ஆய்வுகளுக்காக ஆர்.பி.

source: The display of summed DAP and dose at RP values in the fluoroscopy filtered and detailed views, and in e-mail notifications
ta: ஃப்ளோரோச்கோபி வடிகட்டப்பட்ட மற்றும் விரிவான காட்சிகள் மற்றும் மின்னஞ்சல் அறிவிப்புகளில் ஆர்.பி மதிப்புகளில் சுருக்கமான டிஏபி மற்றும் டோசின் காட்சி

source: The automatic calculation of summed DAP and dose at RP for new studies imported into OpenREM
ta: OpenREM இல் இறக்குமதி செய்யப்பட்ட புதிய ஆய்வுகளுக்காக RP இல் சுருக்கமான DAP மற்றும் டோசின் தானியங்கி கணக்கீடு

source: An example of a study where there is another study with matching patient ID is shown below in figure 5. In this example neither of the two individual studies had doses that exceeded an alert level, but when summed together the total dose at RP does exceed the corresponding alert.
ta: பொருந்தக்கூடிய நோயாளி ஐடியுடன் மற்றொரு ஆய்வு இருக்கும் ஒரு ஆய்வின் எடுத்துக்காட்டு படம் 5 இல் கீழே காட்டப்பட்டுள்ளது. இந்த எடுத்துக்காட்டில் இரண்டு தனிப்பட்ட ஆய்வுகள் ஒரு எச்சரிக்கை நிலையை மீறும் அளவைக் கொண்டிருக்கவில்லை, ஆனால் ஒன்றாகச் சுருக்கமாகக் கூறும்போது ஆர்.பி. தொடர்புடைய எச்சரிக்கை.

source: Detailed view showing associated studies over a time period
ta: தொடர்புடைய ஆய்வுகளை ஒரு காலப்பகுதியில் காண்பிக்கும் விரிவான பார்வை

source: Figure 5: Detailed view showing associated studies over a time period
ta: படம் 5: ஒரு காலப்பகுதியில் தொடர்புடைய ஆய்வுகளைக் காட்டும் விரிவான பார்வை

source: Recalculation of summed data
ta: சுருக்கமான தரவை மீண்டும் கணக்கிடுதல்

source: After upgrading from a version of OpenREM prior to 0.8.2, or after changing the alert levels or number of weeks to look for matching data, the summed dose values must be recalculated. The user is prompted to do this via the display of an orange button, as shown in figure 6 below. If settings have changed an information message is also displayed at the top of the screen.
ta: 0.8.2 க்கு முன்னர் ஓபன்ரெமின் பதிப்பிலிருந்து மேம்படுத்தப்பட்ட பிறகு, அல்லது பொருந்தக்கூடிய தரவைக் காண எச்சரிக்கை நிலைகள் அல்லது வாரங்களின் எண்ணிக்கையை மாற்றிய பின், சுருக்கமான டோச் மதிப்புகள் மீண்டும் கணக்கிடப்பட வேண்டும். கீழே உள்ள படம் 6 இல் காட்டப்பட்டுள்ளபடி, ஆரஞ்சு பொத்தானைக் காண்பிப்பதன் மூலம் இதைச் செய்ய பயனர் கேட்கப்படுகிறார். அமைப்புகள் மாற்றப்பட்டிருந்தால், ஒரு செய்தி செய்தியும் திரையின் மேற்புறத்தில் காட்டப்படும்.

source: Prompt to recalculate the summed dose values
ta: சுருக்கமான டோச் மதிப்புகளை மீண்டும் கணக்கிட தூண்டுதல்

source: Figure 6: Prompt to recalculate the summed dose values
ta: படம் 6: சுருக்கமான டோச் மதிப்புகளை மீண்டும் கணக்கிட தூண்டுதல்

source: Recalculation of the summed data is likely to take several minutes. During this time the form buttons are faded out and disabled, and a spinning icon is shown in the middle of the page (figure 7). The user must remain on this page until the calculations are complete.
ta: சுருக்கமான தரவை மறுபரிசீலனை செய்வது பல நிமிடங்கள் ஆகும். இந்த நேரத்தில் படிவ பொத்தான்கள் மங்கிப்போய் முடக்கப்பட்டு, பக்கத்தின் நடுவில் ஒரு சுழல் படவுரு காட்டப்பட்டுள்ளது (படம் 7). கணக்கீடுகள் முடியும் வரை பயனர் இந்த பக்கத்தில் இருக்க வேண்டும்.

source: Recalculating the summed dose values
ta: சுருக்கமான டோச் மதிப்புகளை மறுபரிசீலனை செய்தல்

source: Figure 7: Prompt to recalculate the summed dose values
ta: படம் 7: சுருக்கமான டோச் மதிப்புகளை மீண்டும் கணக்கிட தூண்டுதல்

source: Once all summed data has been recalculated the orange recalculate button is hidden, the other form buttons are reactivated and the user is shown a success message at the top of the screen (figure 8, below).
ta: அனைத்து சுருக்கமான தரவுகளும் மீண்டும் கணக்கிடப்பட்டவுடன் ஆரஞ்சு மறுசீரமைப்பு பொத்தானை மறைக்கப்பட்டுள்ளது, மற்ற படிவ பொத்தான்கள் மீண்டும் இயக்கப்படுகின்றன மற்றும் பயனருக்கு திரையின் மேற்புறத்தில் ஒரு செய் செய்தி காண்பிக்கப்படுகிறது (படம் 8, கீழே).

source: Figure 8: Message on successful recalculation
ta: படம் 8: வெற்றிகரமான மறுசீரமைப்பு பற்றிய செய்தி

source: E-mail notifications of high dose alerts
ta: உயர் டோச் விழிப்பூட்டல்களின் மின்னஞ்சல் அறிவிப்புகள்

source: For this feature to function the e-mail section in ``local_settings.py`` must be correctly completed (see the : ref :`email_configuration` documentation) and the e-mail server must allow sending of messages that originate from the OpenREM server, or from the authenticated user specified in the e-mail settings.
ta: இந்த நற்பொருத்தம் `` local_settings.py`` இல் உள்ள மின்னஞ்சல் பிரிவை சரியாக முடிக்க வேண்டும் (பார்க்க: ref: `மின்னஞ்சல்_கான்ஃபிகேசன்` ஆவணங்கள்) மற்றும் ஓபன்ரெம் சேவையகத்திலிருந்து உருவாகும் செய்திகளை அனுப்ப மின்னஞ்சல் சேவையகம் அனுமதிக்க வேண்டும் , அல்லது மின்னஞ்சல் அமைப்புகளில் குறிப்பிடப்பட்டுள்ள அங்கீகரிக்கப்பட்ட பயனரிடமிருந்து.

source: OpenREM users can be automatically sent e-mail notifications of studies that have exceeded a high dose alert level. This feature can be enabled or disabled by an OpenREM administrator on the `High dose alerts` configuration page as shown in figure 2 above.
ta: ஓபன்ரெம் பயனர்கள் அதிக அளவு எச்சரிக்கை அளவைத் தாண்டிய ஆய்வுகளின் மின்னஞ்சல் அறிவிப்புகளை தானாக அனுப்ப முடியும். மேலே உள்ள படம் 2 இல் காட்டப்பட்டுள்ளபடி `உயர் டோச் எச்சரிக்கைகள்` உள்ளமைவு பக்கத்தில் ஓபன்ரெம் நிர்வாகியால் இந்த அம்சத்தை இயக்கலாம் அல்லது முடக்கலாம்.

source: Alert recipients users are chosen by navigating to the `Fluoro alert notifcation` page via the `Config` menu. Figure 9 shows an example of the notification page.
ta: எச்சரிக்கை பெறுநர்கள் பயனர்கள் `ஃப்ளோரோ எச்சரிக்கை அறிவிப்பு` பக்கத்திற்கு` கட்டமைப்பு` பட்டியல் வழியாக செல்லுவதன் மூலம் தேர்வு செய்யப்படுகிறார்கள். படம் 9 அறிவிப்பு பக்கத்தின் உதாரணத்தைக் காட்டுகிறது.

source: It should be noted that any OpenREM user selected to receive high dose alerts must have an e-mail address entered in their user profile.
ta: அதிக டோச் விழிப்பூட்டல்களைப் பெற தேர்ந்தெடுக்கப்பட்ட எந்தவொரு ஓபன்ரெம் பயனரும் தங்கள் பயனர் சுயவிவரத்தில் ஒரு மின்னஞ்சல் முகவரியை உள்ளிட வேண்டும் என்பதை கவனத்தில் கொள்ள வேண்டும்.

source: E-mail user-notification of high-dose alerts
ta: உயர்-டோச் விழிப்பூட்டல்களின் பயனர்-அறிவிப்பு மின்னஞ்சல்

source: Figure 9: E-mail user-notification of high-dose alerts
ta: படம் 9: உயர்-டோச் விழிப்பூட்டல்களின் மின்னஞ்சல் பயனர் அறிவிப்பு

source: Home page options
ta: முகப்பு பக்க விருப்பங்கள்

source: Display of workload information
ta: பணிச்சுமை தகவல்களின் காட்சி

source: The home page can be configured to show the number of studies carried out in the past 7 (default) and 28 (default) days for each system. These default values can be changed by logging in, clicking on the ``Config`` menu at the right-hand end of the navigation bar, and then selecting the ``Home page options`` entry under ``User level config`` shown in the upper section of figure 1. This takes the user to a page where the two time periods can be viewed and updated (figure 2).
ta: ஒவ்வொரு கணினிக்கும் கடந்த 7 (இயல்புநிலை) மற்றும் 28 (இயல்புநிலை) நாட்களில் மேற்கொள்ளப்பட்ட ஆய்வுகளின் எண்ணிக்கையைக் காட்ட முகப்பு பக்கத்தை கட்டமைக்க முடியும். இந்த இயல்புநிலை மதிப்புகளை உள்நுழைவதன் மூலம் மாற்றலாம், வழிசெலுத்தல் பட்டியின் வலது கை முடிவில் உள்ள `` கட்டமைப்பு`` மெனுவைக் சொடுக்கு செய்து, பின்னர் `` முகப்பு பக்க விருப்பங்கள்`` இன் கீழ் `` பயனர் நிலை உள்ளமைவு`` இன் கீழ் தேர்வு செய்ய முடியும் படம் 1 இன் மேல் பிரிவில் காட்டப்பட்டுள்ளது. இது பயனரை இரண்டு கால அவகாசங்களைக் காணும் மற்றும் புதுப்பிக்கக்கூடிய ஒரு பக்கத்திற்கு அழைத்துச் செல்கிறது (படம் 2).

source: The home page options form
ta: முகப்பு பக்க விருப்பங்கள் படிவம்

source: Figure 2: The home page options form
ta: படம் 2: முகப்பு பக்க விருப்பங்கள் படிவம்

source: By default the display of workload information is disabled; this can be changed by an OpenREM administrator via the ``Home page options``. When an OpenREM administrator views the home page options a tick box is included that enables or disables the display of workload data on the home page (figure 3).
ta: இயல்பாகவே பணிச்சுமை தகவலின் காட்சி முடக்கப்பட்டுள்ளது; இதை ஒரு ஓபன்ரெம் நிர்வாகி `` முகப்பு பக்க விருப்பங்கள்`` வழியாக மாற்றலாம். ஒரு ஓபன்ரெம் நிர்வாகி முகப்பு பக்க விருப்பங்களைப் பார்க்கும்போது, ​​முகப்பு பக்கத்தில் பணிச்சுமை தரவின் காட்சியை இயக்கும் அல்லது முடக்கும் ஒரு டிக் பெட்டி சேர்க்கப்பட்டுள்ளது (படம் 3).

source: The home page options admin form
ta: முகப்பு பக்க விருப்பங்கள் நிர்வாக படிவம்

source: Figure 3: The home page options admin form
ta: படம் 3: முகப்பு பக்க விருப்பங்கள் நிர்வாக படிவம்

source: When workload information is displayed, the link to the system data is modified in the workload cells to filter the studies to the same date range.
ta: பணிச்சுமை செய்தி காண்பிக்கப்படும் போது, ​​ஆய்வுகளை ஒரே தேதி வரம்பிற்கு வடிகட்ட கணினி தரவுகளுக்கான இணைப்பு பணிச்சுமை கலங்களில் மாற்றியமைக்கப்படுகிறது.

source: Navigating, filtering and study details
ta: வழிசெலுத்தல், வடிகட்டுதல் மற்றும் ஆய்வு விவரங்கள்

source: Navigating the OpenREM web interface
ta: OpenREM வலை இடைமுகத்திற்கு செல்லவும்
