Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: :issue:`518` Importing: fixed imports where CT Target Region isn't specified
ta: : வெளியீடு: `518` இறக்குமதி: சி.டி இலக்கு பகுதி குறிப்பிடப்படாத நிலையான இறக்குமதிகள்

source: :issue:`517` Interface: operator name is now displayed on the detail page for each modality, along with physician for CT and fluoro
ta: : வெளியீடு: `517` இடைமுகம்: சி.டி மற்றும் ஃப்ளோரோவுக்கான மருத்துவருடன் சேர்ந்து ஒவ்வொரு முறைக்கும் விவரம் பக்கத்தில் ஆபரேட்டர் பெயர் இப்போது காட்டப்பட்டுள்ளது

source: :issue:`516` Imports: MultiValue person names are now stored as a decoded string, not a list
ta: :issue:`516` Imports: MultiValue ஆள் names அரே now stored அச் a decoded string, not a பட்டியல்

source: :issue:`511` Testing: develop and other branches can now be deployed to dev.openrem.org and testing.openrem.org automatically
ta: :issue:`511` Testing: உருவாக்கு and மற்றொன்று branches can now be deployed பெறுநர் dev.openrem.org and testing.openrem.org automatically

source: :issue:`510` Imports: 'not-patient-indicators' can now be configured in the interface
ta: :issue:`510` Imports: 'not-patient-indicators' can now be configured in the இடைமுகம்

source: :issue:`509` Skin dose maps: now recalculated on view if recorded height or weight has changed since last calculation
ta: : வெளியீடு: `509` தோல் டோச் வரைபடங்கள்: கடந்த கணக்கீட்டிலிருந்து பதிவுசெய்யப்பட்ட உயரம் அல்லது எடை மாறிவிட்டால் இப்போது பார்வையில் மீண்டும் கணக்கிடப்படுகிறது

source: :issue:`508` Testing: DX sample files are now tested
ta: : வெளியீடு: `508` சோதனை: டிஎக்ச் மாதிரி கோப்புகள் இப்போது சோதிக்கப்படுகின்றன

source: :issue:`507` Interface: Mammo now filterable by study description, procedure, requested procedure and acquisition protocol
ta: : வெளியீடு: `507` இடைமுகம்: மம்மோ இப்போது ஆய்வு விளக்கம், செயல்முறை, கோரப்பட்ட செயல்முறை மற்றும் கையகப்படுத்தல் நெறிமுறை ஆகியவற்றால் வடிகட்டக்கூடியது

source: :issue:`506` Documentation: updated query-retrieve docs
ta: : வெளியீடு: `506` ஆவணங்கள்: புதுப்பிக்கப்பட்ட வினவல்-மறுசீரமைப்பு ஆவணங்கள்

source: :issue:`505` Charts: n is now displayed on charts
ta: : வெளியீடு: `505` விளக்கப்படங்கள்: N இப்போது விளக்கப்படங்களில் காட்டப்பட்டுள்ளது

source: :issue:`504` Charts: Fixed issue with null values
ta: : வெளியீடு: `504` விளக்கப்படங்கள்: சுழிய மதிப்புகளுடன் நிலையான சிக்கல்

source: :issue:`503` Internationalisation: more robust decoding and use of unicode throughout
ta: : வெளியீடு: `503` சர்வதேசமயமாக்கல்: மிகவும் வலுவான டிகோடிங் மற்றும் யூனிகோடின் பயன்பாடு முழுவதும்

source: :issue:`502` Testing: tests now work with SQLite3 and PostgreSQL databases
ta: : வெளியீடு: `502` சோதனை: சோதனைகள் இப்போது SQLITE3 மற்றும் PostgreSQL தரவுத்தளங்களுடன் செயல்படுகின்றன

source: :issue:`501` Imports: Changed field type for CodeValue from 16 chars to text, allows for illegal long values
ta: :issue:`501` Imports: Changed புலம் வகை க்கு CodeValue இருந்து 16 chars பெறுநர் text, allows க்கு illegal long values

source: :issue:`500` Imports: Philips SC Dose Info with missing time stamps now import
ta: : வெளியீடு: `500` இறக்குமதிகள்: காணாமல் போன நேர முத்திரைகள் இப்போது இறக்குமதி செய்யும் பிலிப்ச் எச்சி டோச் செய்தி

source: :issue:`499` Imports: Now aborts gracefully with error log if no template in RDSR
ta: :issue:`499` Imports: Now aborts gracefully with பிழை log if இல்லை template in RDSR

source: :issue:`498` Exports: Missing units added to header fields
ta: : வெளியீடு: `498` ஏற்றுமதி: தலைப்பு புலங்களில் காணாமல் போன அலகுகள் சேர்க்கப்பட்டன

source: :issue:`497` Interface: Detailed fluoro study view: added irradiation type, pulse rate, dose to ref. point, secondary angle, total DAP and ref. point dose from each irradition type
ta: : வெளியீடு: `497` இடைமுகம்: விரிவான ஃப்ளோரோ ஆய்வு பார்வை: சேர்க்கப்பட்ட கதிர்வீச்சு வகை, துடிப்பு வீதம், டோச் டு ரெஃப். புள்ளி, இரண்டாம் நிலை கோணம், மொத்த DAP மற்றும் Ref. ஒவ்வொரு கதிரியக்க வகையிலிருந்தும் புள்ளி டோச்

source: :issue:`495` Charts: Reduced time taken to render scatter plots with multiple series
ta: : வெளியீடு: `495` விளக்கப்படங்கள்: பல தொடர்களுடன் சிதறல் அடுக்குகளை வழங்குவதற்கு எடுக்கப்பட்ட நேரம் குறைக்கப்பட்டுள்ளது

source: :issue:`494` Charts: Charts now ignore blank and zero-value data when calculating mean, median and number of events
ta: :issue:`494` Charts: விளக்கப்படங்கள் now ignore blank and zero-value தகவல்கள் when calculating mean, இடைநடு and எண் of நிகழ்வுகள்

source: :issue:`493` Charts: Added user option to made chart categories all lower case
ta: : வெளியீடு: `493` விளக்கப்படங்கள்: விளக்கப்பட வகைகளை உருவாக்கிய பயனர் விருப்பம் அனைத்து சிறிய வழக்குகளும்

source: :issue:`492` Exports: Each view is now unique for NHSBSP mammo exports as required by the NCCPM database
ta: : வெளியீடு: `492` ஏற்றுமதி: ஒவ்வொரு பார்வையும் இப்போது NCCPM தரவுத்தளத்தின் படி NHSBSP மம்மோ ஏற்றுமதிக்கு தனித்துவமானது

source: :issue:`491` Imports, Interface and Exports: CT Dose Check alerts and notifications are now extracted, displayed and exported
ta: : வெளியீடு: `491` இறக்குமதி, இடைமுகம் மற்றும் ஏற்றுமதி: சி.டி டோச் காசோலை எச்சரிக்கைகள் மற்றும் அறிவிப்புகள் இப்போது பிரித்தெடுக்கப்பட்டு, காண்பிக்கப்படுகின்றன மற்றும் ஏற்றுமதி செய்யப்படுகின்றன

source: :issue:`490` Exports: Response object included for messages - removed as now asynchronous
ta: : வெளியீடு: `490` ஏற்றுமதி: செய்திகளுக்காக மறுமொழி பொருள் சேர்க்கப்பட்டுள்ளது - இப்போது ஒத்திசைவற்றதாக அகற்றப்பட்டது

source: :issue:`489` Exports: NHSBSP mammo exports deals with all views, excludes biopsies and specimens
ta: :issue:`489` Exports: NHSBSP mammo exports deals with அனைத்தும் views, excludes biopsies and specimens

source: :issue:`488` Exports: All exports now include study time
ta: : வெளியீடு: `488` ஏற்றுமதி: எல்லா ஏற்றுமதியிலும் இப்போது ஆய்வு நேரம் அடங்கும்

source: :issue:`487` Imports: CT RDSR now imports 'procedure context' correctly
ta: : வெளியீடு: `487` இறக்குமதி: சி.டி ஆர்.டி.எச்.ஆர் இப்போது 'செயல்முறை சூழலை' சரியாக இறக்குமதி செய்கிறது

source: :issue:`486` Imports: CT RDSR now imports 'NameOfPhysiciansReadingStudy' correctly
ta: :issue:`486` Imports: CT RDSR now இறக்குமதிகள் 'NameOfPhysiciansReadingStudy' correctly

source: :issue:`485` Imports: CT RDSR now imports 'target region' correctly
ta: : வெளியீடு: `485` இறக்குமதி: சி.டி ஆர்.டி.எச்.ஆர் இப்போது 'இலக்கு பகுதியை' சரியாக இறக்குமதி செய்கிறது

source: :issue:`484` Exports and Interface: Exports and interface page views are now more efficient and (much) faster
ta: :issue:`484` Exports and Interface: Exports and இடைமுகம் page காட்சிகள் அரே now more efficient and (much) faster

source: :issue:`482` Imports: DX extractor now extracts acquisition protocol, requested procedure name and study name for Fuji Go mobile; extracts acquisition protocol for Toshiba Radrex equipment; extracts requested procedure name from Carestream DRX-Revolution mobiles
ta: . தோசிபா ராட்ரெக்ச் கருவிகளுக்கான கையகப்படுத்தல் நெறிமுறை பிரித்தெடுக்கிறது; கேர்ச்ட்ரீம் டி.ஆர்.எக்ச்-புரட்சிகர மொபைல்களிலிருந்து கோரப்பட்ட நடைமுறை பெயரைப் பிரித்தெடுக்கிறது

source: :issue:`480` Imports: Code and instructions to create and import an RDSR from Toshiba CT dose summary images and studies
ta: : வெளியீடு: `480` இறக்குமதி: தோசிபா சி.டி டோச் சுருக்கம் படங்கள் மற்றும் ஆய்வுகளிலிருந்து ஒரு ஆர்.டி.எச்.ஆரை உருவாக்கி இறக்குமதி செய்வதற்கான குறியீடு மற்றும் வழிமுறைகள்

source: :issue:`476` Imports: Mixed latin-1 and UTF8 characters now imported, but need to be handled better if possible
ta: : வெளியீடு: `476` இறக்குமதி: கலப்பு லத்தீன் -1 மற்றும் யுடிஎஃப் 8 எழுத்துக்கள் இப்போது இறக்குமதி செய்யப்பட்டுள்ளன, ஆனால் முடிந்தால் சிறப்பாக கையாளப்பட வேண்டும்

source: :issue:`475` Query Retrieve: Made -sr a stand-alone option - it has a very niche use-case!
ta: :issue:`475` Query Retrieve: Made -sr a stand-alone சூதம் - it has a very niche use-case!

source: :issue:`474` Logging: Changing to DEBUG logging level in ``local_settings.py`` will now be respected
ta: :issue:`474` Logging: Changing பெறுநர் DEBUG logging நிலை in ``local_settings.py`` will now be respected

source: :issue:`473` Query Retrieve: Added tests
ta: : வெளியீடு: `473` வினவல் மீட்டெடு: சேர்க்கப்பட்ட சோதனைகள்

source: :issue:`472` Query Retrieve: Overhauled the query retrieve routines
ta: : வெளியீடு: `472` வினவல் மீட்டெடு: வினவலை மாற்றியமைத்தது நடைமுறைகளை மீட்டெடுக்கிறது

source: :issue:`471` Internationalisation: added configuration and docs to set the timezone
ta: : வெளியீடு: `471` சர்வதேசமயமாக்கல்: நேர மண்டலத்தை அமைக்க உள்ளமைவு மற்றும் ஆவணங்கள் சேர்க்கப்பட்டன

source: :issue:`470` Query Retrieve: Optimised CT filtering
ta: : வெளியீடு: `470` வினவல் மீட்டெடு: உகந்த சி.டி வடிகட்டுதல்

source: :issue:`468` Query Retrieve: Station names can now be used for filtering if returned
ta: :issue:`468` Query Retrieve: Station names can now be used க்கு filtering if returned

source: :issue:`467` Testing: Added tests for mammography RDSR imports
ta: : வெளியீடு: `467` சோதனை: மேமோகிராஃபி ஆர்.டி.எச்.ஆர் இறக்குமதிக்கான சோதனைகள் சேர்க்கப்பட்டன

source: :issue:`466` Query Retrieve: RDSR now retrieved in preference to images for MG and DX/CR
ta: :issue:`466` Query Retrieve: RDSR now retrieved in preference பெறுநர் படங்கள் க்கு MG and DX/CR

source: :issue:`465` Added newer SSDE and water equivalent diameter fields to database
ta: : வெளியீடு: `465` புதிய எச்.எச்.டி.இ மற்றும் தண்ணீருக்கு சமமான விட்டம் கொண்ட புலங்களை தரவுத்தளத்தில் சேர்த்தது

source: :issue:`464` Imports: DX RDSR now imported properly
ta: : வெளியீடு: `464` இறக்குமதி: டிஎக்ச் ஆர்.டி.எச்.ஆர் இப்போது சரியாக இறக்குமதி செய்யப்படுகிறது

source: :issue:`463` Imports: Properly checks that Enhanced SR are GE dose reports before importing
ta: :issue:`463` Imports: Properly checks that Enhanced SR அரே கீ dose reports before importing

source: :issue:`460` Interface: Display names table now sortable
ta: : வெளியீடு: `460` இடைமுகம்: காட்சி பெயர்கள் அட்டவணை இப்போது வரிசைப்படுத்தக்கூடியது

source: :issue:`458` Exports: Filter thicknesses are rounded to max 4 significant figures on export
ta: : வெளியீடு: `458` ஏற்றுமதி: வடிகட்டி தடிமன் ஏற்றுமதி குறித்த அதிகபட்சம் 4 குறிப்பிடத்தக்க புள்ளிவிவரங்களுக்கு வட்டமானது

source: :issue:`454` Exports: Mean filter thickness now reported in exports
ta: : வெளியீடு: `454` ஏற்றுமதி: சராசரி வடிகட்டி தடிமன் இப்போது ஏற்றுமதியில் தெரிவிக்கப்பட்டுள்ளது

source: :issue:`453` Imports: DX with min filter thickness greater than max have values switched on import
ta: : வெளியீடு: `453` இறக்குமதி: அதிகபட்சத்தை விட மின் வடிகட்டி தடிமன் கொண்ட டிஎக்ச்

source: :issue:`452` Exports: Added CTDIw phantom size to CT exports
ta: : வெளியீடு: `452` ஏற்றுமதி: சி.டி.டி.ஐ.டபிள்யூ பாண்டம் அளவு சி.டி ஏற்றுமதியில் சேர்க்கப்பட்டது

source: :issue:`451` Skin dose maps: fixed issue with filters being referenced before being defined
ta: : வெளியீடு: `451` தோல் டோச் வரைபடங்கள்: வரையறுக்கப்படுவதற்கு முன்னர் வடிப்பான்கள் குறிப்பிடப்படுவதால் நிலையான சிக்கல்

source: :issue:`450` Imports: DX imports with filter thickness of 0.00 are now recorded as such
ta: :issue:`450` Imports: DX இறக்குமதிகள் with வடிப்பி thickness of 0.00 அரே now recorded அச் such

source: :issue:`449` Exports: Fixed a bug that prevented fluoro exports if protocol names had non-ASCII characters
ta: : வெளியீடு: `449` ஏற்றுமதி: நெறிமுறை பெயர்களில் அசி அல்லாத எழுத்துக்கள் இருந்தால் ஃப்ளோரோ ஏற்றுமதியைத் தடுக்கும் பிழை சரி செய்யப்பட்டது

source: :issue:`448` Documentation: Added a diagram showing the relationship between the OpenREM system components
ta: : வெளியீடு: `448` ஆவணம்: ஓபன்ரெம் சிச்டம் கூறுகளுக்கு இடையிலான உறவைக் காட்டும் வரைபடத்தைச் சேர்த்தது

source: :issue:`447` Imports: Modified rdsr and ctdetail template to import and display data from Pixelmed generated Toshiba RDSR
ta: :issue:`447` Imports: மாற்றியமைக்கப்பட்ட rdsr and ctdetail template பெறுநர் இறக்குமதி and காட்சி தகவல்கள் இருந்து Pixelmed generated Toshiba RDSR

source: :issue:`446` Import: Extract additional Philips private information for Allura Xper systems, create workaround for missing end angles for rotational acquisitions
ta: :issue:`446` Import: Extract additional Philips தனிப்பட்ட செய்தி க்கு Allura Xper systems, create workaround க்கு missing end angles க்கு rotational acquisitions

source: :issue:`445` Interface: Added function for user to determine between DX and fluoro for ambiguous modalities
ta: : வெளியீடு: `445` இடைமுகம்: தெளிவற்ற முறைகளுக்கு டிஎக்ச் மற்றும் ஃப்ளோரோவுக்கு இடையில் தீர்மானிக்க பயனருக்கு சேர்க்கப்பட்டது

source: :issue:`443` Exports: Accession number and ID are now exported to XLSX as text. Thanks to `@LuukO`_
ta: : வெளியீடு: `443` ஏற்றுமதி: அணுகல் எண் மற்றும் ஐடி இப்போது எக்ச்எல்எச்எக்ச் உரையாக ஏற்றுமதி செய்யப்படுகின்றன. `@Luuko`_ க்கு நன்றி

source: :issue:`442` Exports: Fixed RF exports with multiple filters, added tests. Thanks to `@LuukO`_
ta: : வெளியீடு: `442` ஏற்றுமதி: பல வடிப்பான்களுடன் நிலையான வானலை ஏற்றுமதி, சேர்க்கப்பட்ட சோதனைகள். `@Luuko`_ க்கு நன்றி

source: :issue:`441` Charts: Fixed a bug that broke chart links containing non-ASCII characters
ta: : வெளியீடு: `441` விளக்கப்படங்கள்: ASCII அல்லாத எழுத்துக்களைக் கொண்ட விளக்கப்பட இணைப்புகளை உடைத்த பிழை சரி செய்யப்பட்டது

source: :issue:`440` Charts: Fixed a bug in sorting.js so that undefined strings are handled correctly
ta: : வெளியீடு: `440` விளக்கப்படங்கள்: வரிசையாக்கத்தில் ஒரு பிழை சரி செய்யப்பட்டது.

source: :issue:`439` Charts: Added controls for plotting a series per system and calculation histogram data to each filtered view
ta: :issue:`439` Charts: Added controls க்கு plotting a series per மண்டலம் and calculation செவ்வகப்படம் தகவல்கள் பெறுநர் each filtered பார்வை

source: :issue:`438` Skin dose maps: skin dose maps successfully calculated from existing studies; indication of assumed or extracted data shown
ta: : வெளியீடு: `438` தோல் டோச் வரைபடங்கள்: தற்போதுள்ள ஆய்வுகளிலிருந்து வெற்றிகரமாக கணக்கிடப்பட்ட தோல் டோச் வரைபடங்கள்; காட்டப்பட்ட அல்லது பிரித்தெடுக்கப்பட்ட தரவுகளின் அறிகுறி

source: :issue:`434` Internationalisation: added passing char_set throughout the extractor functions (since largely made redundant again!)
ta: :issue:`434` Internationalisation: added passing char_set throughout the extractor செயல்பாடுகள் (since largely made redundant again!)

source: :issue:`432` Imports: RDSR import function now looks in comment field for `patient_table_relationship` data
ta: :issue:`432` Imports: RDSR இறக்குமதி சார்பு now looks in கருத்து புலம் க்கு `patient_table_relationship` தகவல்கள்

source: :issue:`431` Imports: fixed DX imports with MultiValue filter values (Cu+Al) again!
ta: :issue:`431` Imports: fixed DX இறக்குமதிகள் with MultiValue வடிப்பி values (Cu+Al) again!

source: :issue:`430` Exports: fixed DX exports with multiple filters again, added tests
ta: : வெளியீடு: `430` ஏற்றுமதி: பல வடிப்பான்களுடன் நிலையான டிஎக்ச் ஏற்றுமதி மீண்டும், சோதனைகள் சேர்க்கப்பட்டன

source: :issue:`429` Charts: added new mammo scatter plots. Thanks to `@rijkhorst`_
ta: : வெளியீடு: `429` விளக்கப்படங்கள்: புதிய மம்மோ சிதறல் அடுக்குகளைச் சேர்த்தது. `@Rijkhorst`_ க்கு நன்றி

source: :issue:`427` Testing: added a large number of tests that are automatically run on commit to bitbucket
ta: :issue:`427` Testing: added a large எண் of தேர்வுகள் that அரே automatically ஓடு on commit பெறுநர் bitbucket

source: :issue:`414` Reduced use of JavaScript global variables and improved JavaScript objects
ta: : வெளியீடு: `414` சாவாச்கிரிப்ட் உலகளாவிய மாறிகள் மற்றும் மேம்பட்ட சாவாச்கிரிப்ட் பொருள்களின் பயன்பாடு குறைக்கப்பட்டுள்ளது

source: :issue:`411` Imports: fixed laterality and accumulated AGD failure for Hologic DBT proprietary projection images
ta: :issue:`411` Imports: fixed laterality and accumulated AGD failure க்கு Hologic DBT proprietary projection படங்கள்

source: :issue:`323` Documentation: code autodocumentation largely now working again
ta: : வெளியீடு: `323` ஆவணம்: குறியீடு தன்னியக்கவியல் பெரும்பாலும் இப்போது மீண்டும் செயல்படுகிறது

source: :issue:`318` Database management: Display names view can be used to review and delete all studies from one source
ta: : வெளியீடு: `318` தரவுத்தள மேலாண்மை: காட்சி பெயர்கள் ஒரு மூலத்திலிருந்து அனைத்து ஆய்வுகளையும் மதிப்பாய்வு செய்து நீக்க பயன்படுத்தலாம்

source: :issue:`114` Imports: Subsequent RDSRs of the same study will now replace existing study in database
ta: : வெளியீடு: `114` இறக்குமதி: அதே ஆய்வின் அடுத்தடுத்த RDSR கள் இப்போது தரவுத்தளத்தில் இருக்கும் ஆய்வை மாற்றும்

source: :issue:`61` Skin dose maps: These have been re-enabled, and currently work for Siemens systems
ta: : வெளியீடு: `61` தோல் டோச் வரைபடங்கள்: இவை மீண்டும் இயக்கப்பட்டுள்ளன, தற்போது சீமென்ச் அமைப்புகளுக்கு வேலை செய்கின்றன

source: :issue:`431` Imports: fixed DX imports with MultiValue filter values (Cu+Al)
ta: :issue:`431` Imports: fixed DX இறக்குமதிகள் with MultiValue வடிப்பி values (Cu+Al)

source: :issue:`430` Exports: fixed DX exports with multiple filters (Cu + Al)
ta: : வெளியீடு: `430` ஏற்றுமதி: பல வடிப்பான்களுடன் நிலையான டிஎக்ச் ஏற்றுமதி (Cu + AL)

source: :issue:`426` Charts: added css so that wide chart data tables are displayed above the filter form div
ta: :issue:`426` Charts: added சிஎச்எச் so that அகலமான chart தகவல்கள் அட்டவணைகள் அரே displayed above the வடிப்பி form div

source: :issue:`425` Exports: fixed error with non-ASCII characters being exported to csv
ta: : வெளியீடு: `425` ஏற்றுமதி: சி.எச்.வி.க்கு ஏற்றுமதி செய்யப்படும் ASCII அல்லாத எழுத்துக்களுடன் நிலையான பிழை

source: :issue:`424` Charts: fixed error where png or svg export of chart would show incorrect x-axis labels
ta: : வெளியீடு: `424` விளக்கப்படங்கள்: விளக்கப்படத்தின் பி.என்.சி அல்லது எச்.வி.சி ஏற்றுமதி தவறான எக்ச்-அச்சு லேபிள்களைக் காண்பிக்கும் நிலையான பிழை

source: :issue:`423` Charts: fixed error where some chart plotting options were not updated after being changed by the user
ta: : வெளியீடு: `423` விளக்கப்படங்கள்: பயனரால் மாற்றப்பட்ட பின்னர் சில விளக்கப்பட சூழ்ச்சி விருப்பங்கள் புதுப்பிக்கப்படாத நிலையான பிழை

source: :issue:`422` Charts: added a button below each chart to toggle the display of the data table
ta: : வெளியீடு: `422` விளக்கப்படங்கள்: தரவு அட்டவணையின் காட்சியை மாற்ற ஒவ்வொரு விளக்கப்படத்திற்கும் கீழே ஒரு பொத்தானைச் சேர்த்தது

source: :issue:`421` Charts: fixed error where only some scatter plot data was being exported to csv or xls files
ta: : வெளியீடு: `421` விளக்கப்படங்கள்: சில சிதறல் சூழ்ச்சி தரவு மட்டுமே சி.எச்.வி அல்லது எக்ச்எல்எச் கோப்புகளுக்கு ஏற்றுமதி செய்யப்படும் நிலையான பிழை

source: :issue:`420` Charts: fixed error where frequency pie charts were only showing data from the first system
ta: : வெளியீடு: `420` விளக்கப்படங்கள்: அதிர்வெண் பை விளக்கப்படங்கள் முதல் அமைப்பிலிருந்து மட்டுமே தரவைக் காண்பிக்கும் நிலையான பிழை

source: :issue:`419` Interface: fixed error where "Cancel" was ignored when deleting study in Firefox browser
ta: : வெளியீடு: `419` இடைமுகம்: பயர்பாக்ச் உலாவியில் ஆய்வை நீக்கும்போது" ரத்துசெய் "புறக்கணிக்கப்பட்ட நிலையான பிழை

source: :issue:`418` Exports: fixed error when exporting fluoroscopy study with missing xray_filter_material
ta: :issue:`418` Exports: fixed பிழை when exporting fluoroscopy study with missing xray_filter_material

source: :issue:`416` Charts: improved efficiency of JavaScript
ta: : வெளியீடு: `416` விளக்கப்படங்கள்: சாவாச்கிரிப்டின் மேம்பட்ட செயல்திறன்

source: :issue:`415` Database: migration for 0.6 upgraded installs to fix acquisition_device_type failures
ta: : வெளியீடு: `415` தரவுத்தளம்: 0.6 மேம்படுத்தலுக்கான இடம்பெயர்வு கையகப்படுத்தல் சாதனம்_ வகை தோல்விகளை சரிசெய்ய நிறுவவும்

source: :issue:`413` Documentation: removed erroneous reference to store queue in stop celery command
ta: : வெளியீடு: `413` ஆவணம்: நிறுத்தப்பட்ட செலரி கட்டளையில் வரிசையை சேமிக்க தவறான குறிப்பு

source: :issue:`410` Charts: fixed display of bar charts containing only one data point
ta: : வெளியீடு: `410` விளக்கப்படங்கள்: ஒரே ஒரு தரவு புள்ளியைக் கொண்ட பார் விளக்கப்படங்களின் நிலையான காட்சி

source: :issue:`408` Charts: Increased number of items that can be shown on some Highcharts plots
ta: : வெளியீடு: `408` விளக்கப்படங்கள்: சில ஐகார்ட்டுகள் அடுக்குகளில் காட்டக்கூடிய பொருட்களின் எண்ணிக்கை அதிகரித்தது

source: :issue:`407` Fixed issue where skin dose map data was not being calculated on import
ta: : வெளியீடு: இறக்குமதியில் தோல் டோச் வரைபட தரவு கணக்கிடப்படாத `407` நிலையான சிக்கல்

source: :issue:`406` Replaced Math.log10 JavaScript function with alternative function to fix IE11 skin dose map error
ta: : வெளியீடு: `406` கணிதத்தை மாற்றியமைத்தது.

source: :issue:`405` Altered multi-line cell links in filtered pages so they work with IE8
ta: : வெளியீடு: வடிகட்டப்பட்ட பக்கங்களில் `405` மாற்றப்பட்ட மல்டி-லைன் செல் இணைப்புகள், எனவே அவை IE8 உடன் வேலை செய்கின்றன

source: :issue:`403` Now deals with PersonName fields with latin-1 extended characters correctly
ta: : வெளியீடு: `403` இப்போது லத்தீன் -1 நீட்டிக்கப்பட்ட எழுத்துக்களைக் கொண்ட நபர் பெயர் புலங்களை சரியாகக் கையாள்கிறது

source: :issue:`402` Skin dose map data pickle files saved using gzip compression to save space
ta: : வெளியீடு: `402` தோல் டோச் வரைபட தரவு இடத்தை சேமிக்க GZIP சுருக்கத்தைப் பயன்படுத்தி சேமிக்கப்பட்டது

source: :issue:`401` Updated skin dose map documentation to say it won't be in this release
ta: : வெளியீடு: இந்த வெளியீட்டில் இருக்காது என்று சொல்ல `401` புதுப்பிக்கப்பட்ட தோல் டோச் வரைபட ஆவணங்கள்

source: :issue:`400` Strings are encoded as UTF-8 before being hashed to prevent errors with non-ASCII characters
ta: : வெளியீடு: `400` சரங்கள் யுடிஎஃப் -8 என குறியாக்கம் செய்யப்படுகின்றன

source: :issue:`399` Migration file brought up to date for 0.6 to 0.7 upgrades
ta: : வெளியீடு: `399` இடம்பெயர்வு கோப்பு 0.6 முதல் 0.7 மேம்படுத்தல்களுக்கு புதுப்பிக்கப்பட்டுள்ளது

source: :issue:`398` Skin exposure maps are now stored in folders (feature postponed for future release)
ta: : வெளியீடு: `398` தோல் வெளிப்பாடு வரைபடங்கள் இப்போது கோப்புறைகளில் சேமிக்கப்பட்டுள்ளன (எதிர்கால வெளியீட்டிற்கு நற்பொருத்தம் ஒத்திவைக்கப்படுகிறது)

source: :issue:`397` Skin exposure maps no longer available until orientation errors are fixed
ta: : வெளியீடு: `397` தோல் வெளிப்பாடு வரைபடங்கள் நோக்குநிலை பிழைகள் சரி செய்யப்படும் வரை இனி கிடைக்காது

source: :issue:`396` Charts: zooming on bar charts of average value vs. category now works
ta: :issue:`396` Charts: zooming on மதுக்கூடம் விளக்கப்படங்கள் of average மதிப்பு vs. category now works

source: :issue:`395` Docs: offline Windows install instructions created, plus offline upgrade instructions
ta: : வெளியீடு: `395` டாக்ச்: இணைப்பில்லாத சாளரங்கள் நிறுவப்பட்ட வழிமுறைகள் மற்றும் இணைப்பில்லாத மேம்படுத்தல் வழிமுறைகள்

source: :issue:`394` Charts: made charts resize to fit containing div when browser is resized
ta: :issue:`394` Charts: made விளக்கப்படங்கள் resize பெறுநர் fit containing div when browser is resized

source: :issue:`392` Charts: normalised histogram tooltip now correctly reports frequency
ta: : வெளியீடு: `392` விளக்கப்படங்கள்: இயல்பாக்கப்பட்ட இச்டோகிராம் உதவிக்குறிப்பு இப்போது அதிர்வெண்ணை சரியாக தெரிவிக்கிறது

source: :issue:`391` Basic troubleshooting is now documented
ta: : வெளியீடு: `391` அடிப்படை சரிசெய்தல் இப்போது ஆவணப்படுத்தப்பட்டுள்ளது

source: :issue:`390` Charts: mammography and fluoroscopy charts added
ta: : வெளியீடு: `390` விளக்கப்படங்கள்: மேமோகிராபி மற்றும் ஃப்ளோரோச்கோபி விளக்கப்படங்கள் சேர்க்கப்பட்டன

source: :issue:`389` Charts: series without a name are now plotted under the name of `Blank` rather than not being plotted at all
ta: : வெளியீடு: `389` விளக்கப்படங்கள்: பெயர் இல்லாத தொடர் இப்போது திட்டமிடப்படாததை விட` வெற்று` என்ற பெயரில் திட்டமிடப்பட்டுள்ளது

source: :issue:`387` Added laterality to mammography exports
ta: : வெளியீடு: `387` மேமோகிராஃபி ஏற்றுமதிக்கு பக்கவாட்டுத்தன்மை சேர்க்கப்பட்டது

source: :issue:`385` Fixed issue with non-ASCII letters in RDSR sequence TextValue fields
ta: : வெளியீடு: `385` ஆர்.டி.எச்.ஆர் வரிசை உரை மதிப்பு புலங்களில் அசி அல்லாத எழுத்துக்களுடன் நிலையான சிக்கல்

source: :issue:`384` Fluoro exports for OpenSkin only consider copper filters now
ta: : வெளியீடு: ஓபன்ச்கினுக்கான `384` ஃப்ளோரோ ஏற்றுமதி இப்போது செப்பு வடிப்பான்களை மட்டுமே கவனியுங்கள்
