Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: Existing installations of OpenREM 0.10 can be upgraded, but this release requires a different version of Python to the older releases, and some services that were previously required are no longer needed. Full upgrade instructions are provided, based on an Ubuntu Server installation.
ta: ஓபன்ரெம் 0.10 இன் தற்போதைய நிறுவல்களை மேம்படுத்தலாம், ஆனால் இந்த வெளியீட்டில் பழைய வெளியீடுகளுக்கு பைத்தானின் வேறுபட்ட பதிப்பு தேவைப்படுகிறது, மேலும் முன்னர் தேவைப்பட்ட சில சேவைகள் இனி தேவையில்லை. உபுண்டு சேவையக நிறுவலின் அடிப்படையில் முழு மேம்படுத்தல் வழிமுறைகள் வழங்கப்படுகின்றன.

source: A native installation on Windows Server requires Python, a database (ideally PostgreSQL) and a DICOM server (ideally Orthanc) to be installed, with OpenREM and all the other dependencies being installed via Pip. IIS is the recommended webserver to use on Windows.
ta: சாளரங்கள் சேவையகத்தில் ஒரு சொந்த நிறுவலுக்கு பைதான், ஒரு தரவுத்தளம் (வெறுமனே போச்ட்கிரெச்க்யூல்) மற்றும் ஒரு டிகாம் சேவையகம் (வெறுமனே ஆர்த்தாங்க்) நிறுவப்பட வேண்டும், ஓபன்ரெம் மற்றும் பிற அனைத்து சார்புகளும் பிஐபி வழியாக நிறுவப்படுகின்றன. சாளரங்களில் பயன்படுத்த பரிந்துரைக்கப்பட்ட வெப்சர்வர் ஐ.ஐ.எச்.

source: This installation process can be used with Windows 10 (and probably 11), but this is not advised for production use as Windows 10 and 11 are not designed to be servers.
ta: இந்த நிறுவல் செயல்முறையை சாளரங்கள் 10 (மற்றும் அநேகமாக 11) உடன் பயன்படுத்தலாம், ஆனால் சாளரங்கள் 10 மற்றும் 11 சேவையகங்களாக வடிவமைக்கப்படாததால் இது விளைவாக்கம் பயன்பாட்டிற்கு அறிவுறுத்தப்படவில்லை.

source: As for native Linux installs, existing installations of OpenREM 0.10 can be upgraded, but this release requires a different version of Python to the older releases, and some services that were previously required are no longer needed. Full upgrade instructions are provided, based on a Windows Server 2019 installation.
ta: சொந்த லினக்ச் நிறுவல்களைப் பொறுத்தவரை, ஓபன்ரெம் 0.10 இன் தற்போதைய நிறுவல்களை மேம்படுத்தலாம், ஆனால் இந்த வெளியீட்டில் பழைய வெளியீடுகளுக்கு பைத்தானின் வேறுபட்ட பதிப்பு தேவைப்படுகிறது, மேலும் முன்னர் தேவைப்படும் சில சேவைகள் இனி தேவையில்லை. சாளரங்கள் சர்வர் 2019 நிறுவலின் அடிப்படையில் முழு மேம்படுத்தல் வழிமுறைகள் வழங்கப்படுகின்றன.

source: Databases
ta: தரவுத்தளங்கள்

source: Advanced server configuration
ta: மேம்பட்ட சேவையக உள்ளமைவு

source: DICOM Network Configuration
ta: DICOM பிணையம் உள்ளமைவு

source: Configuring DICOM store nodes in OpenREM
ta: OpenRem இல் DICOM STORE முனைகளை கட்டமைத்தல்

source: You need to configure details of the DICOM store node to enable the query-retrieve functionality. You will also need to have installed Orthanc or an alternative:
ta: வினவல்-மறுபயன்பாட்டு செயல்பாட்டை செயல்படுத்த நீங்கள் DICOM STORE முனையின் விவரங்களை உள்ளமைக்க வேண்டும். நீங்கள் ஆர்த்தாங்க் அல்லது மாற்றீட்டை நிறுவ வேண்டும்:

source: Orthanc enabled by default in Docker
ta: ஆர்த்தாங்க் இயல்புநிலையாக டோக்கரில் இயக்கப்பட்டது

source: Installed in the Linux instructions and configured at :ref:`dicom_store_scp_linux`
ta: லினக்ச் வழிமுறைகளில் நிறுவப்பட்டு கட்டமைக்கப்பட்டுள்ளது: ref: `dicom_store_scp_linux`

source: Installed in the Windows instructions and configured at *to be written*
ta: சாளரங்கள் வழிமுறைகளில் நிறுவப்பட்டு *எழுதப்பட வேண்டும் *

source: To configure a DICOM Store SCP, on the ``Config`` menu select ``DICOM networking``, then click ``Add new Store`` and fill in the details (see figure 1):
ta: ஒரு DICOM கடை SCP ஐ உள்ளமைக்க, `` config`` பட்டியலில் `` டிகாம் நெட்வொர்க்கிங்`` என்பதைத் தேர்ந்தெடுத்து, `` புதிய கடையைச் சேர்க்கவும்`` என்பதைக் சொடுக்கு செய்து விவரங்களை நிரப்பவும் (படம் 1 ஐப் பார்க்கவும்):

source: DICOM Store SCP configuration
ta: DICOM STOR SCP உள்ளமைவு

source: Figure 1: DICOM Store SCP configuration
ta: படம் 1: DICOM STOR SCP உள்ளமைவு

source: Name of local store node: This is the *friendly name*, such as ``OpenREM store``
ta: உள்ளக கடை முனையின் பெயர்: இது *நட்பு பெயர் *, அதாவது `` ஓபன்ரெம் ச்டோர்`` போன்றவை

source: Application Entity Title of the node: This is the DICOM name for the store, and must be letters or numbers only, no spaces, and a maximum of 16 characters
ta: பயன்பாட்டு நிறுவனத்தின் தலைப்பு: இது கடையின் DICOM பெயர், மேலும் கடிதங்கள் அல்லது எண்கள் மட்டுமே இருக்க வேண்டும், இடைவெளிகள் இல்லை, அதிகபட்சம் 16 எழுத்துக்கள்

source: Port for store node: Port 104 is the reserved DICOM port, but it is common to use *high* ports such as 8104, partly because ports up to 1024 usually need more privileges than for the high ports. However, if there is a firewall between the remote nodes (modalities, PACS) and the OpenREM server, then you need to make sure that the firewall is configured to allow the port you choose here
ta: கடை முனைக்கான போர்ட்: துறைமுகம் 104 என்பது முன்பதிவு செய்யப்பட்ட டிகாம் துறைமுகம் ஆகும், ஆனால் 8104 போன்ற * உயர் * துறைமுகங்களைப் பயன்படுத்துவது பொதுவானது, ஏனென்றால் 1024 வரையிலான துறைமுகங்களுக்கு பொதுவாக அதிக துறைமுகங்களை விட அதிக சலுகைகள் தேவைப்படுகின்றன. இருப்பினும், தொலை முனைகள் (முறைகள், பிஏசிக்கள்) மற்றும் ஓபன்ரெம் சேவையகத்திற்கு இடையில் ஒரு ஃபயர்வால் இருந்தால், நீங்கள் இங்கே தேர்வு செய்யும் துறைமுகத்தை அனுமதிக்க ஃபயர்வால் கட்டமைக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்த வேண்டும்

source: Status of DICOM Store SCP nodes
ta: DICOM STOR SCP முனைகளின் நிலை

source: DICOM Store SCP advanced configuration
ta: DICOM STOR SCP மேம்பட்ட உள்ளமைவு

source: DICOM Store SCP status "Alive"
ta: DICOM STORE SCP நிலை "உயிருடன்"

source: DICOM Store SCP status "Association fail"
ta: DICOM STORE SCP நிலை "சங்கம் தோல்வி"

source: Figure 3: DICOM Store SCP status - Alive and Association failed
ta: படம் 3: DICOM STORE SCP நிலை - உயிருடன் மற்றும் சங்கம் தோல்வியடைந்தது

source: DICOM Store SCP nodes that have been configured are listed in the left column of the DICOM network configuration page. For each server, the basic details are displayed, including the Database ID which is required for command line/scripted use of the query-retrieve function.
ta: DICOM பிணையம் உள்ளமைவு பக்கத்தின் இடது நெடுவரிசையில் கட்டமைக்கப்பட்ட DICOM STOR SCP முனைகள் பட்டியலிடப்பட்டுள்ளன. ஒவ்வொரு சேவையகத்திற்கும், அடிப்படை விவரங்கள் காண்பிக்கப்படுகின்றன, இதில் கட்டளை வரி/வினவல்-மறுபயன்பாட்டு செயல்பாட்டின் ச்கிரிப்ட் பயன்பாட்டிற்கு தேவைப்படும் தரவுத்தள ஐடி உட்பட.

source: In the title row of the Store SCP config panel, the status will be reported either as 'Server is alive' or 'Error: Association fail - server not running?' - see figure 3
ta: கடை எச்சிபி கட்டமைப்பு பேனலின் தலைப்பு வரிசையில், 'சேவையகம் உயிருடன்' அல்லது 'பிழை: சங்கம் தோல்வி - சேவையகம் இயங்கவில்லையா?' - படம் 3 ஐக் காண்க

source: Query retrieve of third-party system, such as a PACS or modality
ta: பிஏசிஎச் அல்லது முறை போன்ற மூன்றாம் தரப்பு அமைப்பின் வினவல் மீட்டெடுப்பு

source: To Query-Retrieve a remote host, you will need to configure both a local Store SCP and the remote host.
ta: தொலைநிலை ஓச்டை வினவுவதற்கு, நீங்கள் ஒரு உள்ளக கடை SCP மற்றும் ரிமோட் புரவலன் இரண்டையும் கட்டமைக்க வேண்டும்.

source: To configure a remote query retrieve SCP, on the ``Config`` menu select ``DICOM networking``, then click ``Add new QR Node`` and fill in the details:
ta: தொலைநிலை வினவலை மீட்டெடுக்க SCP ஐ உள்ளமைக்க, `` config`` பட்டியலில் `` டிகாம் நெட்வொர்க்கிங்`` என்பதைத் தேர்ந்தெடுத்து, `` புதிய QR முனையைச் சேர்க்கவும்`` என்பதைக் சொடுக்கு செய்து விவரங்களை நிரப்பவும்:

source: Name of QR node: This is the *friendly name*, such as ``PACS QR``
ta: QR முனையின் பெயர்: இது *நட்பு பெயர் *, அதாவது `` pacs qr`` போன்றவை

source: AE Title of the remote node: This is the DICOM name of the remote node, 16 or fewer letters and numbers, no spaces
ta: தொலை முனையின் AE தலைப்பு: இது தொலை முனையின் டிகாம் பெயர், 16 அல்லது குறைவான கடிதங்கள் மற்றும் எண்கள், இடைவெளிகள் இல்லை

source: AE Title this server: This is the DICOM name that the query (DICOM C-Find) will come from. This may be important if the remote node filters access based on *calling aet*. Normal rules of 16 or fewer letters and numbers, no spaces
ta: AE தலைப்பு இந்த சேவையகம்: இது வினவல் (DICOM C-FIND) இலிருந்து வரும் DICOM பெயர். AET *அழைப்பு *அடிப்படையில் ரிமோட் முனை வடிப்பான்கள் அணுகினால் இது முக்கியமானதாக இருக்கலாம். 16 அல்லது குறைவான கடிதங்கள் மற்றும் எண்களின் இயல்பான விதிகள், இடைவெளிகள் இல்லை

source: Remote port: Enter the port the remote node is using (eg 104)
ta: தொலைநிலை போர்ட்: போர்ட்டை உள்ளிடவும் தொலை முனை பயன்படுத்துகிறது (எ.கா. 104)

source: Remote IP address: The IP address of the remote node, for example ``192.168.1.100``
ta: தொலை ஐபி முகவரி: தொலை முனையின் ஐபி முகவரி, எடுத்துக்காட்டாக `` 192.168.1.100```

source: Remote hostname: Alternatively, if your network has a DNS server that can resolve the hostnames, you can enter the hostname instead. If the hostname is entered, it will be used in preference to the IP address, so only enter it if you know it will be resolved.
ta: தொலை ஓச்ட்பெயர்: மாற்றாக, உங்கள் நெட்வொர்க்கில் ஓச்ட்பெயர்களைத் தீர்க்கக்கூடிய டிஎன்எச் சேவையகம் இருந்தால், அதற்கு பதிலாக ஓச்ட்பெயரை உள்ளிடலாம். ஓச்ட்பெயர் உள்ளிட்டால், அது ஐபி முகவரிக்கு முன்னுரிமை அளிக்கும், எனவே அது தீர்க்கப்படும் என்று உங்களுக்குத் தெரிந்தால் மட்டுமே அதை உள்ளிடவும்.

source: Now go to the :doc:`netdicom-qr` documentation to learn how to use it.
ta: இப்போது அதை எவ்வாறு பயன்படுத்துவது என்பதை அறிய `netdicom-qr` ஆவணங்களுக்கு: Doc:` netdicom-qr` ஆவணங்களுக்குச் செல்லுங்கள்.

source: Troubleshooting: openrem_store.log
ta: சரிசெய்தல்: OpenRem_store.log

source: If the default logging settings haven't been changed then there will be a log files to refer to. The default location is within your ``MEDIAROOT`` folder:
ta: இயல்புநிலை பதிவு அமைப்புகள் மாற்றப்படவில்லை என்றால், குறிப்பிட ஒரு பதிவு கோப்புகள் இருக்கும். இயல்புநிலை இருப்பிடம் உங்கள் `` மீடியூட்` கோப்புறையில் உள்ளது:

source: This file contains information about each echo and association that is made against the store node, and any objects that are sent to it.
ta: இந்த கோப்பில் கடை முனைக்கு எதிராக தயாரிக்கப்படும் ஒவ்வொரு எதிரொலி மற்றும் சங்கம் பற்றிய தகவல்களும், அதற்கு அனுப்பப்படும் எந்தவொரு பொருளும் உள்ளன.

source: The following is an example of the log for a Philips *dose info* image being received:
ta: ஒரு பிலிப்ச் * டோச் செய்தி * படம் பெறப்படுவதற்கான பதிவுக்கு பின்வருபவை ஒரு எடுத்துக்காட்டு:

source: DICOM Query Retrieve Service
ta: டிகாம் வினவல் சேவையை மீட்டெடுக்கவும்

source: To query retrieve dose related objects from a remote server, you need to review the :doc:`netdicom-nodes` documents first to make sure you have created a DICOM Store node installed and configured which will import objects to OpenREM.
ta: தொலைநிலை சேவையகத்திலிருந்து டோச் தொடர்பான பொருள்களை மீட்டெடுக்க வினவுவதற்கு, நீங்கள் மறுபரிசீலனை செய்ய வேண்டும்: டாக்: `நெட் டிகாம்-நோட்ச்` ஆவணங்கள் முதலில் நீங்கள் ஒரு டிகாம் கடை முனையை நிறுவி கட்டமைக்கப்பட்டுள்ளீர்கள் என்பதை உறுதிப்படுத்தவும், அவை ஓபன்ரெமுக்கு பொருள்களை இறக்குமதி செய்யும்.

source: You will also need to set up the remote server to allow you to query-retrieve using it - the remote server will need to be configured with details of the store node that you have configured.
ta: அதைப் பயன்படுத்துவதை வினவுவதற்கு உங்களை அனுமதிக்க தொலை சேவையகத்தை அமைக்க வேண்டும் - தொலைநிலை சேவையகம் நீங்கள் உள்ளமைத்த கடை முனையின் விவரங்களுடன் கட்டமைக்கப்பட வேண்டும்.

source: Query-retrieve using the web interface
ta: வலை இடைமுகத்தைப் பயன்படுத்தி வினவல்-மறுசீரமைப்பு

source: Import Query-Retrieve menu
ta: இறக்குமதி வினவல்-மறுபரிசீலனை பட்டியல்

source: Figure 1: Import Query-Retrieve menu
ta: படம் 1: இறக்குமதி வினவல்-மறுபரிசீலனை பட்டியல்

source: On the Imports menu, select ``Query remote server`` - see figure 1. If the menu isn't there, you need to check your user permissions -- see :ref:`user-settings` for details.
ta: இறக்குமதி பட்டியலில், `` வினவல் ரிமோட் சர்வர்` `என்பதைத் தேர்ந்தெடுக்கவும் - படம் 1 ஐப் பார்க்கவும். பட்டியல் இல்லை என்றால், உங்கள் பயனர் அனுமதிகளை நீங்கள் சரிபார்க்க வேண்டும் - காண்க: குறிப்பு:` பயனர் -அமைப்புகள்` விவரங்களுக்கு.

source: Each configured query-retrieve node and each local store node is automatically tested to make sure they respond to a DICOM echo - the results are presented at the top of the page. See figure 2 for an example.
ta: ஒவ்வொரு கட்டமைக்கப்பட்ட வினவல் -மறுபயன்பாட்டு முனை மற்றும் ஒவ்வொரு உள்ளக கடை முனையும் தானாகவே சோதிக்கப்படும், அவை DICOM எதிரொலிக்கு பதிலளிப்பதை உறுதிசெய்யும் - முடிவுகள் பக்கத்தின் மேலே வழங்கப்படுகின்றன. ஒரு எடுத்துக்காட்டுக்கு படம் 2 ஐப் பார்க்கவும்.

source: local and remote QR statuses
ta: உள்ளக மற்றும் தொலைநிலை QR நிலைகள்

source: Figure 2: Local and remote QR statuses
ta: படம் 2: உள்ளக மற்றும் தொலைநிலை QR நிலைகள்

source: Select the desired **remote host**, ie the PACS or modality you wish to query.
ta: விரும்பிய ** ரிமோட் புரவலன் **, அதாவது நீங்கள் வினவ விரும்பும் PAC கள் அல்லது முறை.

source: Select the local **store node** you want to retrieve to.
ta: உள்ளக ** கடை முனையைத் தேர்ந்தெடுக்கவும் ** நீங்கள் மீட்டெடுக்க விரும்புகிறீர்கள்.

source: Select **which modalities** you want to query for - at least one must be ticked.
ta: ** எந்த முறைகள் ** நீங்கள் வினவ வேண்டும் என்பதைத் தேர்ந்தெடுக்கவும் - குறைந்தது ஒரு தேர்வு செய்யப்பட வேண்டும்.

source: Select a **date range** - the wider this is, the more stress the query will place on the remote server, and the higher the likelyhood of the query being returned with zero results (a common configuration on the remote host to prevent large database queries affecting other services). Defaults to 'from yesterday'.
ta: ஒரு ** தேதி வரம்பு ** என்பதைத் தேர்ந்தெடுக்கவும் - இது பரவலாக, வினவல் தொலை சேவையகத்தில் வைக்கும், மேலும் வினவலின் சுழிய முடிவுகளுடன் திருப்பித் தரும் சாத்தியக்கூறுகள் (தொலைதூர ஓச்டில் ஒரு பொதுவான உள்ளமைவு பெரியது பிற சேவைகளை பாதிக்கும் தரவுத்தள வினவல்கள்). இயல்புநிலை 'நேற்றிலிருந்து'.

source: If you wish to **exclude studies** based on their study description, enter the text here. Add several terms by separating them with a comma. One example would be to exclude any studies with ``imported`` in the study description, if your institution modifies this field on import. The matching is case-insensitive.
ta: அவர்களின் ஆய்வு விளக்கத்தின் அடிப்படையில் ** ஆய்வுகளை விலக்க ** விரும்பினால், உரையை இங்கே உள்ளிடவும். கமாவுடன் பிரிப்பதன் மூலம் பல சொற்களைச் சேர்க்கவும். உங்கள் நிறுவனம் இறக்குமதியில் இந்த துறையை மாற்றியமைத்தால், ஆய்வு விளக்கத்தில் `` இறக்குமதி செய்யப்பட்டவர்` உடன் எந்தவொரு ஆய்வையும் விலக்குவது ஒரு எடுத்துக்காட்டு. பொருத்தம் வழக்கு-உணர்வற்றது.

source: Alternatively, you might want to only **keep studies** with particular terms in the study description. If so, enter them in the next box, comma separated.
ta: மாற்றாக, ஆய்வு விளக்கத்தில் குறிப்பிட்ட சொற்களுடன் ** ஆய்வுகளை ** மட்டுமே வைத்திருக்க விரும்பலாம். அப்படியானால், அவற்றை அடுத்த பெட்டியில் உள்ளிடவும், கமா பிரிந்தது.

source: You can also **exclude studies by station name**, or only keep them if they match the station name. This is only effective if the remote system (the PACS) supports sending back station name information. By default, this is only checked against series level responses *(changed in OpenREM 1.0)*.
ta: நீங்கள் ** ச்டேசன் பெயர் ** மூலம் படிப்புகளை விலக்கலாம் அல்லது நிலைய பெயருடன் பொருந்தினால் மட்டுமே அவற்றை வைத்திருங்கள். தொலைநிலை அமைப்பு (பிஏசிஎச்) நிலைய பெயர் தகவல்களை திருப்பி அனுப்புவதை ஆதரித்தால் மட்டுமே இது பயனுள்ளதாக இருக்கும். இயல்பாக, இது தொடர் நிலை பதில்களுக்கு எதிராக மட்டுமே சரிபார்க்கப்படுகிறது *(ஓபன்ரெம் 1.0 இல் மாற்றப்பட்டது) *.

source: Advanced query options
ta: மேம்பட்ட வினவல் விருப்பங்கள்

source: **Attempt to get Toshiba dose images** *default not ticked*: If you have done the extra installation and configuration required for creating RDSRs from older Toshiba scanners, then you can tick this box for `CT` searches to get the images needed for this process. See the logic description below for details.
ta: . இந்த செயல்முறைக்கு. விவரங்களுக்கு கீழே உள்ள வழக்கு விளக்கத்தைப் பார்க்கவும்.

source: **Ignore studies already in the database** *default ticked*: By default OpenREM will attempt to avoid downloading any DICOM objects (RDSRs or images) that have already been imported into the database. Untick this box to override that behaviour and download all suitable objects. See the logic description below for details.
ta: . அந்த நடத்தையை மேலெழுத இந்த பெட்டியை அவிழ்த்து, பொருத்தமான அனைத்து பொருட்களையும் பதிவிறக்கவும். விவரங்களுக்கு கீழே உள்ள வழக்கு விளக்கத்தைப் பார்க்கவும்.

source: **Include SR only studies** *default not ticked*: If you have a DICOM store with only the radiation dose structured reports (RDSR) in, or a mix of whole studies and RDSRs without the corresponding study, then tick this box. Any studies with images and RDSRS will be ignored (they can be found without this option). If this box is ticked any modality choices will be ignored.
ta: . படங்கள் மற்றும் ஆர்.டி.எச்.ஆர்களைக் கொண்ட எந்தவொரு ஆய்வும் புறக்கணிக்கப்படும் (அவை இந்த விருப்பம் இல்லாமல் காணப்படுகின்றன). இந்த பெட்டியைத் தேர்வுசெய்தால் ஏதேனும் முறை தேர்வுகள் புறக்கணிக்கப்படும்.

source: **Get SR series that return nothing at image level query** *default not ticked*: If you have a DICOM store with SR series that you know contain RDSR objects, but when queried your store says they are empty, then check this box. If this behaviour is found, a message will be added to the ``openrem_qr.log`` at ``INFO`` level with the phrase ``Try '-emptysr' option?``. With the box checked the query will assume any SR series found contains an RDSR. Warning: with this behavior, any non-RDSR structured report series (such as a radiologists report encoded as a structured report) will be retrieved instead of images that could actually be used (for example with mammography and digital radiographs). Therefore this option should be used with caution!
ta: . . இந்த நடத்தை கண்டறிந்தால், `` தகவல்`` -எம்ப்ட்ச்ர் 'விருப்பத்துடன் `` தகவல்``-`` என்ற சொற்றொடருடன் `` OpenRem_qr.log`` இல் ஒரு செய்தி சேர்க்கப்படும். பெட்டி சரிபார்க்கப்பட்டால், வினவல் எந்த எச்.ஆர் தொடரில் ஒரு ஆர்.டி.எச்.ஆர் உள்ளது என்று கருதுகிறது. எச்சரிக்கை: இந்த நடத்தை மூலம், எந்தவொரு ஆர்.டி.எச்.ஆர் அல்லாத கட்டமைக்கப்பட்ட அறிக்கைத் தொடரும் (ஒரு கதிரியக்கவியலாளர்கள் அறிக்கை ஒரு கட்டமைக்கப்பட்ட அறிக்கையாக குறியிடப்பட்டிருப்பது போன்றவை) உண்மையில் பயன்படுத்தக்கூடிய படங்களுக்கு பதிலாக மீட்டெடுக்கப்படும் (எடுத்துக்காட்டாக மேமோகிராபி மற்றும் டிசிட்டல் ரேடியோகிராஃப்களுடன்). எனவே இந்த விருப்பத்தை எச்சரிக்கையுடன் பயன்படுத்த வேண்டும்!

source: **Check station name include/exclude at study level** *default not ticked*: Change this setting to enable checking of station name include/exclude at study level instead of series level. This addresses issue :issue:`772` as some studies will have different station name information at study level than at series level - if both levels are checked it is impossible to get the desired response.
ta: . இது விளக்குகிறது: வெளியீடு: `772` சில ஆய்வுகள் தொடர் மட்டத்தை விட ஆய்வு மட்டத்தில் வெவ்வேறு நிலைய பெயர் தகவல்களைக் கொண்டிருப்பதால் - இரு நிலைகளும் சரிபார்க்கப்பட்டால் விரும்பிய பதிலைப் பெறுவது சாத்தியமில்லை.

source: When you have finished the query parameters, click ``Submit``
ta: வினவல் அளவுருக்களை நீங்கள் முடித்ததும், `` சமர்ப்பிக்கவும்` என்பதைக் சொடுக்கு செய்க

source: Review and retrieve
ta: மதிப்பாய்வு செய்து மீட்டெடுக்கவும்

source: Once all the responses have been purged of unwanted modalities, study descriptions or study UIDs, the number of studies of each type will be displayed and a button appears. Click ``Retrieve`` to request the remote server send the selected objects to your selected Store node. This will be based on your original selection - changing the node on the left hand side at this stage will have no effect.
ta: அனைத்து பதில்களும் தேவையற்ற முறைகள், ஆய்வு விளக்கங்கள் அல்லது யுஐடிகளைப் படித்தால், ஒவ்வொரு வகையின் ஆய்வுகளின் எண்ணிக்கையும் காண்பிக்கப்படும் மற்றும் ஒரு பொத்தான் தோன்றும். தொலைநிலை சேவையகத்தைக் கோர `` மீட்டெடு`` என்பதைக் சொடுக்கு செய்க. தேர்ந்தெடுக்கப்பட்ட பொருட்களை நீங்கள் தேர்ந்தெடுத்த கடை முனைக்கு அனுப்பவும். இது உங்கள் அசல் தேர்வின் அடிப்படையில் இருக்கும் - இந்த கட்டத்தில் இடது புறத்தில் உள்ள முனையை மாற்றுவது எந்த விளைவையும் ஏற்படுத்தாது.

source: The progress of the retrieve is displayed in the same place until the retrieve is complete. You can also see the query and start the ``Retrieve`` in the :ref:`qrquerysummary`.
ta: மீட்டெடுப்பதன் முன்னேற்றம் மீட்டெடுப்பு முடியும் வரை அதே இடத்தில் காட்டப்படும். நீங்கள் வினவலைக் காணலாம் மற்றும் `` மீட்டெடுப்பு`` ஐத் தொடங்கலாம்: ref: `qrquerysummary`.

source: Query-retrieve using the command line interface
ta: கட்டளை வரி இடைமுகத்தைப் பயன்படுத்தி வினவல்-மறுசீரமைப்பு

source: Running the command in different environments
ta: வெவ்வேறு சூழல்களில் கட்டளையை இயக்குதல்

source: **Docker:** In a command window/shell, navigate to the folder containing ``docker-compose.yml`` etc. Then precede the command with ``docker-compose exec openrem``:
ta: **Docker:** In a கட்டளை window/shell, navigate பெறுநர் the folder containing ``docker-compose.yml`` etc. Then precede the கட்டளை with ``docker-compose exec openrem``:

source: **Linux:** Activate the virtualenv - assuming default Ubuntu install:
ta: **Linux:** செயல்படுத்து the virtualenv - assuming இயல்புநிலை Ubuntu install:

source: **Windows:** Activate the virtualenv - **docs to be written** - and command might need the full path?:
ta: ** விண்டோச்: ** மெய்நிகர் - ** டாக்ச் எழுதப்பட வேண்டும் ** - மற்றும் கட்டளைக்கு முழு பாதை தேவைப்படலாம் ?:

source: As an example, if you wanted to query the PACS for DX images on the 5th and 6th April 2010 with any study descriptions containing ``imported`` excluded, first you need to know the database IDs of the remote node and the local node you want the images sent to. To find these, go to the :doc:`netdicom-nodes` page where the database ID is listed among the other details for each node.
ta: உதாரணமாக, டிஎக்ச் படங்களுக்கான பிஏசிகளை 5 மற்றும் 6 ஏப்ரல் 2010 அன்று வினவ விரும்பினால், `` இறக்குமதி செய்யப்பட்ட`` விலக்கப்பட்ட எந்தவொரு ஆய்வு விளக்கங்களுடனும், முதலில் தொலைநிலை முனையின் தரவுத்தள ஐடிகளையும் உள்ளக முனையையும் அறிந்து கொள்ள வேண்டும் அனுப்பப்பட்ட படங்கள் வேண்டும். இவற்றைக் கண்டுபிடிக்க, ஒவ்வொரு முனைக்கும் மற்ற விவரங்களில் தரவுத்தள ஐடி பட்டியலிடப்பட்டுள்ள: doc: `netdicom-nodes` பக்கத்திற்குச் செல்லவும்.

source: Assuming the PACS database ID is 2, and the store node ID is 1, the command would look something like:
ta: பிஏசிஎச் தரவுத்தள ஐடி 2, மற்றும் கடை முனை ஐடி 1 என்று கருதினால், கட்டளை இதுபோன்றதாக இருக்கும்:

source: If you want to do this regularly to catch new studies, you might like to use a script something like this on Linux - make sure you comment out or delete one of the options, and amend as necessary!
ta: புதிய படிப்பைப் பிடிக்க நீங்கள் இதை தவறாமல் செய்ய விரும்பினால், நீங்கள் லினக்சில் இதுபோன்ற ச்கிரிப்டைப் பயன்படுத்த விரும்பலாம் - நீங்கள் ஒரு விருப்பத்தை கருத்தில் கொண்டு அல்லது நீக்குவதை உறுதிசெய்து, தேவையானதைத் திருத்துங்கள்!

source: This script could be run once an hour using a cron job. By asking for the date an hour ago, you shouldn't miss exams taking place in the last hour of the day. As the script won't run from the folder containing ``docker-compose.yml`` the location of that file needs to be passed to ``docker-compose`` with the ``-f`` option. You can check the path to ``docker-compose`` on your system using ``which docker-compose``.
ta: இந்த ச்கிரிப்டை ஒரு கிரான் வேலையைப் பயன்படுத்தி ஒரு மணி நேரத்திற்கு ஒரு முறை இயக்க முடியும். ஒரு மணி நேரத்திற்கு முன்பு தேதியைக் கேட்பதன் மூலம், நாளின் கடைசி மணி நேரத்தில் நடைபெறும் தேர்வுகளை நீங்கள் தவறவிடக்கூடாது. `` Docker-compose.yml`` கொண்ட கோப்புறையிலிருந்து ச்கிரிப்ட் இயங்காது என்பதால், அந்த கோப்பின் இருப்பிடத்தை `` -f` விருப்பத்துடன் `` டோக்கர்-சமநிலை`` க்கு அனுப்ப வேண்டும். உங்கள் கணினியில் `` எந்த டோக்கர்-சமநிலை`` ஐப் பயன்படுத்தி `` டோக்கர்-கம்ப்யூச்` க்கான பாதையை நீங்கள் சரிபார்க்கலாம்.
