Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: Upgrading a native Linux install
ta: ஒரு சொந்த லினக்ச் நிறுவலை மேம்படுத்துதல்

source: These instructions assume a configuration similar to the 'One page complete Ubuntu install' provided with release 0.8.1 and later. If you are running an older distribution, consider upgrading the operating system or migrating the service to a new host. The test system for these upgrade instructions was upgraded from 18.04 to 20.04 and then 22.04 before the OpenREM upgrade was started. If you are using a different distribution or have set up your system differently, it might be better to start afresh following or adapting the :doc:`upgrade_linux_new_server` docs instead.
ta: இந்த வழிமுறைகள் வெளியீடு 0.8.1 மற்றும் அதற்குப் பிறகு வழங்கப்பட்ட 'ஒரு பக்கம் முழுமையான உபுண்டு நிறுவல்' போன்ற ஒரு உள்ளமைவைக் கருதுகின்றன. நீங்கள் பழைய விநியோகத்தை இயக்குகிறீர்கள் என்றால், இயக்க முறைமையை மேம்படுத்துவது அல்லது சேவையை புதிய ஓச்டுக்கு மாற்றுவது ஆகியவற்றைக் கவனியுங்கள். இந்த மேம்படுத்தல் வழிமுறைகளுக்கான சோதனை முறை 18.04 முதல் 20.04 ஆகவும், பின்னர் 22.04 ஆகவும் ஓபன்ரெம் மேம்படுத்தல் தொடங்கப்படுவதற்கு முன்பு மேம்படுத்தப்பட்டது. நீங்கள் வேறு விநியோகத்தைப் பயன்படுத்துகிறீர்கள் அல்லது உங்கள் கணினியை வித்தியாசமாக அமைத்திருந்தால், பின்வரும் அல்லது மாற்றியமைப்பதைத் தொடங்குவது நல்லது: டாக்: `மேம்படுத்தல்_லினக்ச்_நியூ_சர்வர்` டாக்சைத் தழுவுவது.

source: If upgrading to a new host, follow the :doc:`upgrade_linux_new_server` docs.
ta: புதிய ஓச்டுக்கு மேம்படுத்தினால், பின்வருமாறு: டாக்: `UPGRADE_LINUX_NEW_SERVER` டாக்ச்.

source: This release will run on Python 3.8 or 3.9, but Python 3.10 is recommended. If a different release of Python is being used, substitute 3.10 for that version where necessary below.
ta: இந்த வெளியீடு பைதான் 3.8 அல்லது 3.9 இல் இயங்கும், ஆனால் பைதான் 3.10 பரிந்துரைக்கப்படுகிறது. பைத்தானின் வேறுபட்ட வெளியீடு பயன்படுத்தப்பட்டால், கீழே தேவையான இடங்களில் அந்த பதிப்பிற்கு 3.10 ஐ மாற்றவும்.

source: If you are upgrading OpenREM on a Linux server with limited internet access, go to the :doc:`install_offline` docs.
ta: வரையறுக்கப்பட்ட இணைய அணுகலுடன் லினக்ச் சேவையகத்தில் ஓபன்ரெமை மேம்படுத்தினால்,: DOC: `Install_offline` டாக்சுக்குச் செல்லவும்.

source: **Upgrades from 0.9.1 or earlier should review** :doc:`upgrade_previous_0.10.0` first. Upgrading to 1.0 is only possible from 0.10.0.
ta: ** 0.9.1 அல்லது அதற்கு முந்தைய மேம்படுத்தல்கள் மதிப்பாய்வு செய்ய வேண்டும் **: டாக்: `மேம்படுத்தல்_பிரெவியச்_0.10.0` முதலில். 1.0 ஆக மேம்படுத்துவது 0.10.0 இலிருந்து மட்டுமே சாத்தியமாகும்.

source: Back up the database - you will need the password for ``openremuser`` that will be in your ``local_settings.py`` file. You'll need this file again later so open it in a different window:
ta: தரவுத்தளத்தை காப்புப் பிரதி எடுக்கவும் - உங்கள் `` local_settings.py`` கோப்பில் இருக்கும் `` OpenReMuser`` க்கான கடவுச்சொல் உங்களுக்குத் தேவைப்படும். இந்த கோப்பு மீண்டும் பின்னர் தேவைப்படும், எனவே வேறு சாளரத்தில் திறக்கவும்:

source: Backup the database, in the main window:
ta: முதன்மையான சாளரத்தில் தரவுத்தளத்தை காப்புப் பிரதி எடுக்கவும்:

source: Stop any Celery workers, Flower, RabbitMQ, Gunicorn, NGINX, and Orthanc (OpenREM service names will be reversed if they weren't changed with the 0.9.1 upgrade):
ta: எந்தவொரு செலரி தொழிலாளர்கள், மலர், முயல்ம்க்யூ, குனிகார்ன், என்சின்க்ச் மற்றும் ஆர்த்தாங்கை நிறுத்துங்கள் (0.9.1 மேம்படுத்தலுடன் மாற்றப்படாவிட்டால் ஓபன்ரெம் பணி பெயர்கள் மாற்றப்படும்):

source: Update apt and install any updates:
ta: பொருத்தமாக புதுப்பித்து எந்த புதுப்பிப்புகளையும் நிறுவவும்:

source: Install Python 3.10 and other packages:
ta: பைதான் 3.10 மற்றும் பிற தொகுப்புகளை நிறுவவும்:

source: Reset the permissions for the ``/var/dose`` folder:
ta: ``/Var/டோச்` கோப்புறைக்கான அனுமதிகளை மீட்டமைக்கவும்:

source: Now find the ``uid`` of your user and the ``gid`` of the ``openrem`` group:
ta: இப்போது உங்கள் பயனரின் `` uid`` மற்றும் `OpenRem`` குழுவின்` `gid`` ஐக் கண்டறியவும்:

source: What are we doing with the permissions?
ta: அனுமதிகளை நாங்கள் என்ன செய்கிறோம்?

source: These settings enable the web server user ``www-data``, the DICOM server user ``orthanc`` and the OpenREM server users (you and your colleagues) to all read, write and execute the OpenREM files. The ``setfacl`` command relies on Access Control Lists being available on your system - they are usually enabled on ext4 and can be enabled on others. See :ref:`add_linux_user` for adding colleagues access to the Linux folders.
ta: இந்த அமைப்புகள் வலை சேவையக பயனர் `` www-data``, DICOM சேவையக பயனர் `` ஆர்த்தாங்க்`` மற்றும் ஓபன்ரெம் சேவையக பயனர்கள் (நீங்களும் உங்கள் சகாக்களும்) அனைவரையும் ஓபன்ரெம் கோப்புகளைப் படிக்கவும், எழுதவும் செயல்படுத்தவும் செயல்படுத்துகின்றன. `` Setfacl`` கட்டளை உங்கள் கணினியில் கிடைக்கக்கூடிய அணுகல் கட்டுப்பாட்டு பட்டியல்களை நம்பியுள்ளது - அவை வழக்கமாக EXT4 இல் இயக்கப்பட்டிருக்கும், மற்றவர்களுக்கு இயக்கப்படலாம். காண்க: குறிப்பு: லினக்ச் கோப்புறைகளுக்கு தம ஊழியர்களை அணுகுவதற்கு `add_linux_user`.

source: Create a new Python virtual environment:
ta: புதிய பைதான் மெய்நிகர் சூழலை உருவாக்கவும்:

source: Activate the virtualenv:
ta: மெய்நிகர்இ.வி.யை செயல்படுத்தவும்:

source: Install the new version of OpenREM
ta: OpenREM இன் புதிய பதிப்பை நிறுவவும்

source: Ensure the new virtualenv is active — prompt will look like
ta: புதிய மெய்நிகர்என்வி செயலில் இருப்பதை உறுதிசெய்க - வரியில் இருக்கும்

source: Upgrade Pip and install OpenREM
ta: PIP ஐ மேம்படுத்தி OPENREM ஐ நிறுவவும்

source: Configure the local_settings.py file
ta: Local_settings.py கோப்பை உள்ளமைக்கவும்

source: Review the old ``local_settings.py`` file that was opened earlier - see the first part of the Preparation section. Edit the new ``local_settings.py`` as needed - make sure you update the database ``NAME``, ``USER`` and ``PASSWORD``, the ``ALLOWED_HOSTS`` list and the ``EMAIL`` configuration and check all the other settings. Change the ``SECRET_KEY`` from the default:
ta: முன்னர் திறக்கப்பட்ட பழைய `` local_settings.py`` கோப்பை மதிப்பாய்வு செய்யவும் - தயாரிப்பு பிரிவின் முதல் பகுதியைப் பார்க்கவும். தேவைக்கேற்ப புதிய `` local_settings.py`` ஐத் திருத்தவும் - `` பெயர்``, `` பயனர்`` மற்றும் `` கடவுச்சொல்``, `` அனுமதிக்கப்பட்ட_ஓச்ட்ச்`` பட்டியல் மற்றும் `` மின்னஞ்சல்` `உள்ளமைவு மற்றும் மற்ற எல்லா அமைப்புகளையும் சரிபார்க்கவும். இயல்புநிலையிலிருந்து `` சீக்ரெட்_கே`` ஐ மாற்றவும்:

source: Migrate the database
ta: தரவுத்தளத்தை நகர்த்தவும்

source: In a shell/command window, move into the ``openrem`` folder:
ta: ஒரு செல்/கட்டளை சாளரத்தில், `` ஓபன்ரெம்` கோப்புறையில் செல்லுங்கள்:

source: Prepare the migrations folder:
ta: இடம்பெயர்வு கோப்புறையைத் தயாரிக்கவும்:

source: Rename ``0001_initial.py.1-0-upgrade`` to ``0001_initial.py``
ta: `` 0001_Initial.py.1-0-மேம்படுத்தல்`` `` 0001_initial.py`` க்கு மறுபெயரிடுங்கள்

source: Rename questions
ta: கேள்விகளை மறுபெயரிடுங்கள்

source: There will be some questions about fields being renamed - answer ``N`` to all of them.
ta: புலங்கள் மறுபெயரிடப்படுவது குறித்து சில கேள்விகள் இருக்கும் - அவை அனைவருக்கும் `` n`` பதில்.

source: Update static files and translations
ta: நிலையான கோப்புகள் மற்றும் மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும்

source: Warning about deleting all files
ta: எல்லா கோப்புகளையும் நீக்குவது பற்றி எச்சரிக்கை

source: You will get a warning about all files in the static files location being deleted. As long as the folder is correct, type ``yes`` to continue.
ta: நிலையான கோப்புகள் இருப்பிடத்தில் நீக்கப்படும் அனைத்து கோப்புகளையும் பற்றி உங்களுக்கு எச்சரிக்கை கிடைக்கும். கோப்புறை சரியாக இருக்கும் வரை, தொடர `` ஆம்`` என தட்டச்சு செய்க.

source: Virtual directory users
ta: மெய்நிகர் அடைவு பயனர்கள்

source: If you are running your website in a virtual directory, you also have to update the reverse.js file. To get the file in the correct path, take care that you insert just after the declaration of ``STATIC_ROOT`` the following line in your ``local_settings.py`` (see also the sample ``local_settings.py.example``):
ta: உங்கள் வலைத்தளத்தை மெய்நிகர் கோப்பகத்தில் இயக்குகிறீர்கள் என்றால், நீங்கள் Revers.js கோப்பையும் புதுப்பிக்க வேண்டும். கோப்பை சரியான பாதையில் பெற, `` static_root`` இன் அறிவிப்புக்குப் பிறகு நீங்கள் செருகுவதை கவனித்துக் கொள்ளுங்கள் `` local_settings.py`` ):

source: To update the reverse.js file execute the following command:
ta: Revers.js கோப்பைப் புதுப்பிக்க பின்வரும் கட்டளையை இயக்கவும்:

source: See :doc:`virtual_directory` for more details.
ta: காண்க: DOC: மேலும் விவரங்களுக்கு `மெய்நிகர்_டிகரி`.

source: Update all the services configurations
ta: அனைத்து பணி உள்ளமைவுகளையும் புதுப்பிக்கவும்

source: Edit the Gunicorn systemd file ``WorkingDirectory`` and ``ExecStart``:
ta: Kunicorn systemd கோப்பைத் திருத்தவும் `` WorkingDirectory`` மற்றும் `` ExectStart``:

source: Celery, Flower and RabbitMQ are no longer required for this release, so their Systemd control files can be disabled, and RabbitMQ can be removed (assuming it is not in use for any other services on this server):
ta: இந்த வெளியீட்டிற்கு செலரி, மலர் மற்றும் ராபிட்எம்யூ இனி தேவையில்லை, எனவே அவற்றின் கணினி கட்டுப்பாட்டு கோப்புகளை முடக்கலாம், மேலும் முயல் MQ ஐ அகற்றலாம் (இந்த சேவையகத்தில் வேறு எந்த சேவைகளுக்கும் இது பயன்பாட்டில் இல்லை என்று வைத்துக் கொள்ளுங்கள்):

source: Reload systemd and restart the services
ta: SystemD ஐ மீண்டும் ஏற்றவும், சேவைகளை மறுதொடக்கம் செய்யவும்

source: Start and check Gunicorn:
ta: தொடங்கி KUNICORN ஐ சரிபார்க்கவும்:

source: Start and check NGINX:
ta: தொடங்கி சரிபார்க்கவும்:

source: Start and check Orthanc:
ta: ஆர்த்தாங்கைத் தொடங்கி சரிபார்க்கவும்:

source: Registered Users error
ta: பதிவுசெய்யப்பட்ட பயனர்களின் பிழை

source: If Orthanc fails to start, check the Orthanc log file:
ta: ஆர்த்தாங்க் தொடங்கத் தவறினால், ஆர்த்தாங்க் பதிவு கோப்பை சரிபார்க்கவும்:

source: If there is an error: ``Bad file format: The configuration section "RegisteredUsers" is defined in 2 different configuration files`` this might be due to changes in the installed version of Orthanc.
ta: பிழை இருந்தால்: `` மோசமான கோப்பு வடிவம்: உள்ளமைவு பிரிவு "பதிவுசெய்யப்பட்ட பயனர்கள்" 2 வெவ்வேறு உள்ளமைவு கோப்புகளில் வரையறுக்கப்படுகிறது`` இது ஆர்த்தாங்கின் நிறுவப்பட்ட பதிப்பில் ஏற்படும் மாற்றங்கள் காரணமாக இருக்கலாம்.

source: Edit the main Orthanc configuration file to remove the setting, as it is now in a ``credentials.json`` configuration file.
ta: அமைப்பை அகற்ற முதன்மையான ஆர்த்தாங்க் உள்ளமைவு கோப்பைத் திருத்தவும், அது இப்போது `` நற்சான்றிதழ்கள். Json`` உள்ளமைவு கோப்பில் உள்ளது.

source: Remove the ``RegisteredUsers`` setting and try again:
ta: `` பதிவுசெய்யப்பட்ட பயனர்கள்`` அமைப்பை அகற்றி மீண்டும் முயற்சிக்கவும்:

source: If there is still an issue, check the log again. If the problem this time is due to the ``TCP port of the DICOM server``, you might need to give it permission again:
ta: இன்னும் ஒரு சிக்கல் இருந்தால், மீண்டும் பதிவை சரிபார்க்கவும். இந்த நேரத்தில் சிக்கல் DICOM சேவையகத்தின் `` TCP துறைமுகம் காரணமாக இருந்தால், நீங்கள் அதை மீண்டும் இசைவு வழங்க வேண்டியிருக்கும்:

source: And restart Orthanc once more.
ta: ஆர்த்தாங்கை மீண்டும் ஒரு முறை மறுதொடக்கம் செய்யுங்கள்.

source: You should now be able to browse to the web interface of your upgraded OpenREM system and have a look around.
ta: நீங்கள் இப்போது மேம்படுத்தப்பட்ட ஓபன்ரெம் அமைப்பின் வலை இடைமுகத்திற்கு உலாவவும், சுற்றிப் பார்க்கவும் முடியும்.

source: Update the DICOM Store settings
ta: DICOM கடை அமைப்புகளைப் புதுப்பிக்கவும்

source: Log in to the web interface, and navigate to ``Config``, ``DICOM networking``.
ta: வலை இடைமுகத்தில் உள்நுழைந்து, `` config``, `` டிகாம் நெட்வொர்க்கிங்`` க்கு செல்லவும்.

source: The remote nodes should be correct from the old system, but the DICOM Store SCP settings will need updating. Modify the store, and add the hostname ``localhost``.
ta: தொலைநிலை முனைகள் பழைய கணினியிலிருந்து சரியாக இருக்க வேண்டும், ஆனால் DICOM STORE SCP அமைப்புகளுக்கு புதுப்பித்தல் தேவைப்படும். கடையை மாற்றியமைத்து, `` உள்ளக ஓச்ட்`` ஓச்ட்பெயரைச் சேர்க்கவும்.

source: After you have clicked ``Submit``, the status page should show the server is alive. If it isn't, go and check the status of Orthanc again (we may have checked it too quickly before).
ta: நீங்கள் `` சமர்ப்பி`` என்பதைக் சொடுக்கு செய்த பிறகு, நிலை பக்கம் சேவையகம் உயிருடன் இருப்பதைக் காட்ட வேண்டும். If it isn't, go and சரிபார் the நிலை of Orthanc again (we சி-வைகாசி have checked it too quickly before).

source: Upgrading to a new Linux server
ta: புதிய லினக்ச் சேவையகத்திற்கு மேம்படுத்துகிறது

source: If OpenREM has been running on an older Linux distribution, or you wish to move to Linux to host OpenREM and don't want to use Docker, these instructions will guide you through upgrading an existing database to a new server.
ta: ஓபன்ரெம் பழைய லினக்ச் விநியோகத்தில் இயங்கினால், அல்லது ஓபன்ரெம் புரவலன் செய்ய லினக்சுக்கு செல்ல விரும்பினால், டோக்கரைப் பயன்படுத்த விரும்பவில்லை என்றால், இந்த வழிமுறைகள் ஏற்கனவே உள்ள தரவுத்தளத்தை புதிய சேவையகத்திற்கு மேம்படுத்துவதன் மூலம் உங்களுக்கு வழிகாட்டும்.

source: Get the local_settings.py file
ta: Local_settings.py கோப்பைப் பெறுங்கள்

source: Get ``local_settings.py`` file from the old server - it should be in one of these locations:
ta: பழைய சேவையகத்திலிருந்து `` local_settings.py`` கோப்பைப் பெறுங்கள் - இது இந்த இடங்களில் ஒன்றில் இருக்க வேண்டும்:

source: Ubuntu 'One page install': ``/var/dose/veopenrem/lib/python2.7/site-packages/openrem/openremproject/local_settings.py``
ta: உபுண்டு 'ஒரு பக்கம் நிறுவு': ``/var/dose/veopenrem/lib/python2.7/தள-பேக்கேச்கள்/OpenRem/OpenRemProject/local_settings.py``

source: Export the old database on the old server - you will need the password for ``openremuser`` that will be in your ``local_settings.py`` file, and you might need to change the ``openremuser`` database username and the ``openremdb`` name of the database:
ta: பழைய சேவையகத்தில் பழைய தரவுத்தளத்தை ஏற்றுமதி செய்யவும் - உங்கள் `` லோக்கல்_செட்டிங்ச்.பி`` கோப்பில் இருக்கும் `` ஓபன்ரெமுசர்` `க்கான கடவுச்சொல் உங்களுக்குத் தேவைப்படும், மேலும் நீங்கள்` `ஓபன்ரெமுசர்`` தரவுத்தள பயனர்பெயரை மாற்ற வேண்டும் மற்றும் அதை மாற்ற வேண்டும் `` OpenRemdB`` தரவுத்தளத்தின் பெயர்:

source: Transfer the files
ta: கோப்புகளை மாற்றவும்

source: Copy these two files to your new server.
ta: இந்த இரண்டு கோப்புகளையும் உங்கள் புதிய சேவையகத்திற்கு நகலெடுக்கவும்.

source: Continue on the new server
ta: புதிய சேவையகத்தில் தொடரவும்

source: Now follow the :doc:`install_linux` instructions looking out for the additional steps for upgrading to a new Linux server.
ta: இப்போது பின்வருமாறு: DOC: `Install_linux` வழிமுறைகள் புதிய லினக்ச் சேவையகத்திற்கு மேம்படுத்த கூடுதல் படிகளைத் தேடும்.

source: Upgrade to OpenREM 0.10.0 from 0.7.3 or later
ta: 0.7.3 அல்லது அதற்குப் பிறகு OpenREM 0.10.0 க்கு மேம்படுத்தவும்

source: Upgrades to OpenREM 1.0 can only be made from version 0.10.0. Installations earlier than that need to be updated to version 0.10.0 before updating to version 1.0.
ta: ஓபன்ரெம் 1.0 க்கான மேம்படுத்தல்களை பதிப்பு 0.10.0 இலிருந்து மட்டுமே செய்ய முடியும். பதிப்பு 1.0 க்கு புதுப்பிப்பதற்கு முன் பதிப்பு 0.10.0 க்கு புதுப்பிக்கப்பட வேண்டியதை விட முந்தைய நிறுவல்கள்.

source: These instructions can be used to upgrade any database from version 0.7.3 or later. 0.7.3 was released in August 2016. For upgrades from versions earlier than that, please review the upgrade instructions for that version in the `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.7.3.html>`_.
ta: பதிப்பு 0.7.3 அல்லது அதற்குப் பிறகு எந்த தரவுத்தளத்தையும் மேம்படுத்த இந்த வழிமுறைகள் பயன்படுத்தப்படலாம். 0.7.3 ஆகச்ட் 2016 இல் வெளியிடப்பட்டது. அதைவிட முந்தைய பதிப்புகளிலிருந்து மேம்படுத்தப்பட்டதற்காக, அந்த பதிப்பிற்கான மேம்படுத்தல் வழிமுறைகளை `0.10.0-docs <https://docs.openrem.org/en/0.10.0- இல் மதிப்பாய்வு செய்யவும் டாக்ச்/வெளியீடு -0.7.3.html> `_.

source: Upgrade preparation
ta: தயாரிப்பை மேம்படுத்தவும்

source: Python 2.7.9 or later must be installed, but it must still be Python 2.7 and not any of the Python 3 releases.
ta: பைதான் 2.7.9 அல்லது அதற்குப் பிறகு நிறுவப்பட வேண்டும், ஆனால் அது இன்னும் பைதான் 2.7 ஆக இருக்க வேண்டும், ஆனால் பைதான் 3 வெளியீடுகள் எதுவும் இல்லை.

source: To check the Python version, activate the virtualenv if you are using one, then:
ta: பைதான் பதிப்பைச் சரிபார்க்க, நீங்கள் ஒன்றைப் பயன்படுத்துகிறீர்கள் என்றால் மெய்நிகர் ஈன்வை செயல்படுத்தவும், பின்னர்:

source: If the version is earlier than ``2.7.9``, then an upgrade is needed. If the version is ``3.x``, then Python 2.7 must be installed.
ta: பதிப்பு `` 2.7.9`` ஐ விட முந்தையதாக இருந்தால், மேம்படுத்தல் தேவை. பதிப்பு `` 3.x`` என்றால், பைதான் 2.7 நிறுவப்பட வேண்டும்.

source: **Ubuntu Linux**
ta: ** உபுண்டு லினக்ச் **

source: Check which version of Ubuntu is installed (``lsb_release -a``)
ta: உபுண்டுவின் எந்த பதிப்பு நிறுவப்பட்டுள்ளது என்பதைச் சரிபார்க்கவும் (`` lsb_release -a``)

source: If it is 14.04 LTS (Trusty), then an operating system upgrade or migration to a new server is required. If migrating, ensure the version of OpenREM installed on the new server is the same as the one on the old server, then :ref:`restore-psql-linux` following the instructions and when up and running again perform the upgrade on the new server
ta: இது 14.04 எல்.டி.எச் (நம்பகமான) என்றால், ஒரு இயக்க முறைமை மேம்படுத்தல் அல்லது புதிய சேவையகத்திற்கு இடம்பெயர்வு தேவை. இடம்பெயர்ந்தால், புதிய சேவையகத்தில் நிறுவப்பட்ட ஓபன்ரெமின் பதிப்பு பழைய சேவையகத்தில் உள்ளதைப் போலவே இருப்பதை உறுதிசெய்க, பின்னர்: குறிப்பு: `அறிவுறுத்தல்களைப் பின்பற்றி மீண்டும் இயங்கும் போது மீண்டும் இயங்கும் போது மேம்படுத்தவும் சேவையகம்

source: 16.04 LTS (Xenial) or later should have 2.7.11 or later available.
ta: 16.04 எல்.டி.எச் (சீனியல்) அல்லது அதற்குப் பிறகு 2.7.11 அல்லது அதற்குப் பிறகு கிடைக்க வேண்டும்.

source: For other Linux distributions check in their archives for which versions are available.
ta: பிற லினக்ச் விநியோகங்கள் அவற்றின் காப்பகங்களில் எந்த பதிப்புகள் கிடைக்கின்றன என்பதை சரிபார்க்கவும்.

source: **Windows**
ta: ** சாளரங்கள் **

source: A newer version of Python 2.7 can be downloaded from `python.org <https://www.python.org/downloads>`_ and installed over the current version.
ta: பைதான் 2.7 இன் புதிய பதிப்பை `python.org <https://www.python.org/downloads> _ _ இலிருந்து பதிவிறக்கம் செய்து தற்போதைய பதிப்பில் நிறுவலாம்.

source: **Linux and Windows**
ta: ** லினக்ச் மற்றும் சாளரங்கள் **

source: With a version of Python 2.7.9 or later, setuptools can be updated (activate virtualenv if using one):
ta: பைதான் 2.7.9 அல்லது அதற்குப் பிறகு, செட்டுப்டூல்சைப் புதுப்பிக்க முடியும் (ஒன்றைப் பயன்படுத்தினால் மெய்நிகர் ஈன்வை செயல்படுத்தவும்):

source: Upgrade
ta: மேம்படுத்தல்

source: Back up your database
ta: உங்கள் தரவுத்தளத்தை காப்புப் பிரதி எடுக்கவும்

source: For PostgreSQL on linux you can refer to :ref:`backup-psql-db`
ta: லினக்சில் Postgresql க்கு நீங்கள் குறிப்பிடலாம்: ref: `காப்பு-PSQL-DB`

source: For PostgreSQL on Windows you can refer to :ref:`database-windows`
ta: சாளரங்களில் postgresql க்கு நீங்கள் குறிப்பிடலாம்: குறிப்பு: `தரவுத்தள-சாளரங்கள்`

source: For a non-production SQLite3 database, simply make a copy of the database file
ta: விளைவாக்கம் செய்யாத SQLITE3 தரவுத்தளத்திற்கு, தரவுத்தள கோப்பின் நகலை உருவாக்கவும்

source: Stop any Celery workers
ta: எந்த செலரி தொழிலாளர்களையும் நிறுத்துங்கள்

source: Consider temporarily disabling your DICOM Store SCP, or redirecting the data to be processed later
ta: உங்கள் DICOM கடை SCP ஐ தற்காலிகமாக முடக்குவதைக் கவனியுங்கள், அல்லது பின்னர் செயலாக்க வேண்டிய தரவை திருப்பிவிடுங்கள்

source: If you are using a virtualenv, activate it
ta: நீங்கள் ஒரு மெய்நிகர் ஈவியைப் பயன்படுத்துகிறீர்கள் என்றால், அதை செயல்படுத்தவும்

source: Install specific versions of some packages that are needed:
ta: தேவைப்படும் சில தொகுப்புகளின் குறிப்பிட்ட பதிப்புகளை நிறுவவும்:

source: Install specific version of Celery:
ta: செலரியின் குறிப்பிட்ட பதிப்பை நிறுவவும்:

source: **Linux server:**
ta: ** லினக்ச் சேவையகம்: **

source: **Windows server:**
ta: ** சாளரங்கள் சேவையகம்: **

source: Install the new version of OpenREM:
ta: OpenREM இன் புதிய பதிப்பை நிறுவவும்:

source: Update the configuration
ta: உள்ளமைவைப் புதுப்பிக்கவும்

source: Add additional log file configuration - changed with 0.8
ta: கூடுதல் பதிவு கோப்பு உள்ளமைவைச் சேர்க்கவும் - 0.8 உடன் மாற்றப்பட்டது

source: Add the new extractor log file configuration to the ``local_settings.py`` - you can copy the 'Logging configuration' section here if you haven't made any changes. The addition that needs to be inserted are the lines relating to the ``extractor`` log file. This is only for upgrading the database - the ``local_settings.py`` file will be updated again for the upgrade to 1.0:
ta: புதிய பிரித்தெடுத்தல் பதிவு கோப்பு உள்ளமைவை `` local_settings.py`` இல் சேர்க்கவும் - நீங்கள் எந்த மாற்றங்களையும் செய்யவில்லை என்றால் இங்கே 'உள்நுழைவு உள்ளமைவு' பகுதியை இங்கே நகலெடுக்கலாம். செருகப்பட வேண்டிய கூடுதலாக `` பிரித்தெடுத்தல்`` பதிவு கோப்பு தொடர்பான கோடுகள் உள்ளன. இது தரவுத்தளத்தை மேம்படுத்துவதற்காக மட்டுமே - `` local_settings.py`` கோப்பு மீண்டும் 1.0 ஆக மேம்படுத்தப்படும்:

source: Linux virtualenv: ``vitualenvfolder/lib/python2.7/site-packages/openrem/``
ta: லினக்ச் மெய்நிகர்இன்வ்: `` valialenvfolder/lib/python2.7/site-packages/openrem/``

source: Windows virtualenv: ``virtualenvfolder\Lib\site-packages\openrem\``
ta: சாளரங்கள் மெய்நிகர்இன்வ்: `` மெய்நிகர்என்.விஃபோல்டர் \ லிப் \ தள-பேக்கேச்கள் \ ஓபன்ரெம் \ ``

source: Systemd service names in Ubuntu installs
ta: உபுண்டு நிறுவல்களில் SystemD பணி பெயர்கள்

source: Systemd service files were renamed in the the 0.9.1 docs to use *openrem-function* rather than *function-openrem*. To update the service files accordingly, follow the following steps. **This is optional**, but will make finding them easier (e.g. ``sudo systemctl status openrem-[tab][tab]`` will list them) and these names are assumed for the :doc:`upgrade_docker` and :doc:`upgrade_linux` docs. However, only the ``gunicorn`` service remains after the upgrade to 1.0, so you may find it easier just to remember the only service names, or just rename that one.
ta: *செயல்பாடு-ஓபன்ரெம் *ஐ விட *ஓபன்ரெம்-செயல்பாடு *பயன்படுத்த 0.9.1 டாக்சில் சிச்டம் டி பணி கோப்புகள் மறுபெயரிடப்பட்டன. அதற்கேற்ப பணி கோப்புகளைப் புதுப்பிக்க, பின்வரும் படிகளைப் பின்பற்றவும். ** இது விருப்பமானது **, ஆனால் அவற்றைக் கண்டுபிடிப்பதை எளிதாக்கும் (எ.கா. `` sudo systemctl நிலை openrem- [தாவல்] [தாவல்] [தாவல்] `` அவற்றை பட்டியலிடும்) மேலும் இந்த பெயர்கள் கருதப்படுகின்றன: doc: `UPGRADE_DOCKER` மற்றும்: டாக்: `மேம்படுத்தல்_லினக்ச்` டாக்ச். இருப்பினும், `` கன்னிகார்ன்`` பணி மட்டுமே 1.0 ஆக மேம்படுத்தப்பட்ட பின்னர் உள்ளது, எனவே ஒரே பணி பெயர்களை நினைவில் கொள்வது அல்லது அதை மறுபெயரிடுவதை நீங்கள் எளிதாகக் காணலாம்.

source: Upgrade to 1.0
ta: 1.0 ஆக மேம்படுத்தவும்

source: Now return to :doc:`installation` instructions to follow the instructions to 1.0 for your preferred server solution.
ta: இப்போது திரும்பவும்: DOC: `நிறுவல்` உங்கள் விருப்பமான சேவையக தீர்வுக்கு 1.0 க்கு வழிமுறைகளைப் பின்பற்ற வழிமுறைகள்.

source: After upgrading to version 1.0, there will be automatic tasks that are created to populate the summary fields introduced in version 0.10.
ta: பதிப்பு 1.0 க்கு மேம்படுத்தப்பட்ட பிறகு, பதிப்பு 0.10 இல் அறிமுகப்படுத்தப்பட்ட சுருக்கம் புலங்களை விரிவுபடுத்துவதற்காக தானியங்கி பணிகள் உருவாக்கப்படும்.

source: 0.10 upgrade panel before log in
ta: உள்நுழைய முன் 0.10 குழுவை மேம்படுத்தவும்
