Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: relative or absolute path to Philips CT dose report DICOM image file.
ta: பிலிப்ச் சி.டி டோச் அறிக்கை டிகாம் படக் கோப்பிற்கான உறவினர் அல்லது முழுமையான பாதை.

source: Tested with:
ta: இதனுடன் சோதிக்கப்பட்டது:

source: Philips Gemini TF PET-CT v2.3.0
ta: பிலிப்ச் செமினி டி.எஃப் பெட்-சி.டி வி 2.3.0

source: Brilliance BigBore v3.5.4.17001.
ta: பிரில்லியன்ச் பிக்போர் வி 3.5.4.17001.

source: Toshiba dose summary and images
ta: தோசிபா டோச் சுருக்கம் மற்றும் படங்கள்

source: OpenREM can harvest information from older Toshiba CT systems that create dose summary images but cannot create RDSR objects by using a combination of tools to create an RDSR that can then be imported in the normal manner. This extractor requires that the Offis DICOM toolkit, java.exe and pixelmed.jar are available to the system.
ta: ஓபன்ரெம் பழைய தோசிபா சி.டி அமைப்புகளிலிருந்து தகவல்களை அறுவடை செய்யலாம், அவை டோச் சுருக்கம் படங்களை உருவாக்குகின்றன, ஆனால் ஆர்.டி.எச்.ஆர் பொருள்களை உருவாக்க முடியாது, பின்னர் ஒரு ஆர்.டி.எச்.ஆரை உருவாக்க கருவிகளின் கலவையைப் பயன்படுத்தி சாதாரண முறையில் இறக்குமதி செய்ய முடியும். இந்த பிரித்தெடுத்தல் ஆஃபிச் டிகாம் கருவித்தொகுப்பு, java.exe மற்றும் பிக்சல்மெட்.சார் ஆகியவை கணினிக்கு கிடைக்க வேண்டும்.

source: Function to create radiation dose structured reports from a folder of dose images.
ta: டோச் படங்களின் கோப்புறையிலிருந்து கதிர்வீச்சு டோச் கட்டமைக்கப்பட்ட அறிக்கைகளை உருவாக்க செயல்பாடு.

source: Path to folder containing Toshiba DICOM objects - dose summary and images
ta: தோசிபா டிகாம் பொருள்களைக் கொண்ட கோப்புறைக்கான பாதை - டோச் சுருக்கம் மற்றும் படங்கள்

source: Export from database
ta: தரவுத்தளத்திலிருந்து ஏற்றுமதி

source: Multi-sheet Microsoft Excel XLSX exports
ta: மல்டி-சீட் நுண்மென் எக்செல் எக்ச்எல்எச்எக்ச் ஏற்றுமதி

source: This export has a summary sheet of all the requested and performed protocols and the series protocols. The next sheet has all studies on, one study per line, with the series stretching off to the right. The remaining sheets are specific to each series protocol, in alphabetical order, with one series per line. If one study has three series with the same protocol name, each one has a line of its own. For NM this is not true as protocol names do not exist, sheets are generated by study description instead.
ta: இந்த ஏற்றுமதி கோரப்பட்ட மற்றும் நிகழ்த்தப்பட்ட அனைத்து நெறிமுறைகள் மற்றும் தொடர் நெறிமுறைகளின் சுருக்க தாளைக் கொண்டுள்ளது. அடுத்த தாளில் அனைத்து ஆய்வுகளும் உள்ளன, ஒரு வரிக்கு ஒரு ஆய்வு, தொடர் வலதுபுறம் நீண்டுள்ளது. மீதமுள்ள தாள்கள் ஒவ்வொரு தொடர் நெறிமுறைக்கும், அகர வரிசைப்படி, ஒரு வரிக்கு ஒரு தொடர். ஒரு ஆய்வில் ஒரே நெறிமுறை பெயருடன் மூன்று தொடர்கள் இருந்தால், ஒவ்வொன்றும் அதன் சொந்த வரியைக் கொண்டுள்ளன. நெறிமுறை பெயர்கள் இல்லாததால் இது உண்மையல்ல, அதற்கு பதிலாக ஆய்வு விளக்கத்தால் தாள்கள் உருவாக்கப்படுகின்றன.

source: Export filtered RF database data to multi-sheet Microsoft XSLX files.
ta: மல்டி-ச்டீட் நுண்மென் எக்ச்எச்எல்எக்ச் கோப்புகளுக்கு வடிகட்டப்பட்ட ஆர்எஃப் தரவுத்தள தரவை ஏற்றுமதி செய்யுங்கள்.

source: Queryset of studies to export
ta: ஏற்றுமதி செய்வதற்கான ஆய்வுகளின் வினவல்

source: does the user have patient identifiable data permission
ta: பயனருக்கு நோயாளி அடையாளம் காணக்கூடிய தரவு இசைவு உள்ளதா?

source: has patient name been selected for export
ta: ஏற்றுமதிக்கு நோயாளியின் பெயர் தேர்வு செய்யப்பட்டுள்ளதா?

source: has patient ID been selected for export
ta: ஏற்றுமதிக்கு நோயாளி ஐடி தேர்ந்தெடுக்கப்பட்டதா?

source: User that has started the export
ta: ஏற்றுமதியைத் தொடங்கிய பயனர்

source: Saves xlsx file into Media directory for user to download
ta: பயனர் பதிவிறக்க எக்ச்எல்எச்எக்ச் கோப்பை மீடியா கோப்பகத்தில் சேமிக்கிறது

source: Export filtered CT database data to multi-sheet Microsoft XSLX files
ta: மல்டி-ச்டீட் நுண்மென் எக்ச்எச்எல்எக்ச் கோப்புகளுக்கு வடிகட்டப்பட்ட சி.டி தரவுத்தள தரவை ஏற்றுமதி செய்யுங்கள்

source: Export filtered DX and CR database data to multi-sheet Microsoft XSLX files.
ta: மல்டி-ச்டீட் நுண்மென் எக்ச்எச்எல்எக்ச் கோப்புகளுக்கு வடிகட்டப்பட்ட டிஎக்ச் மற்றும் சிஆர் தரவுத்தள தரவை ஏற்றுமதி செய்யுங்கள்.

source: Export filtered mammography database data to a single-sheet CSV file or a multi sheet xlsx file.
ta: வடிகட்டப்பட்ட மேமோகிராஃபி தரவுத்தள தரவை ஒற்றை-தாள் சி.எச்.வி கோப்பு அல்லது பல தாள் எக்ச்எல்எச்எக்ச் கோப்பிற்கு ஏற்றுமதி செய்யுங்கள்.

source: Whether to export a single sheet csv or a multi sheet xlsx
ta: ஒரு தாள் காபிம அல்லது பல தாள் XLSX ஐ ஏற்றுமதி செய்ய வேண்டுமா?

source: Saves csv file into Media directory for user to download
ta: காபிம கோப்பை பயனர் பதிவிறக்கம் செய்ய மீடியா கோப்பகத்தில் சேமிக்கிறது

source: Single sheet CSV exports
ta: ஒற்றை தாள் காபிம ஏற்றுமதி

source: Export filtered fluoro database data to a single-sheet CSV file.
ta: வடிகட்டப்பட்ட ஃப்ளோரோ தரவுத்தள தரவை ஒற்றை-தாள் காபிம கோப்பில் ஏற்றுமதி செய்யுங்கள்.

source: Export filtered CT database data to a single-sheet CSV file.
ta: வடிகட்டப்பட்ட CT தரவுத்தள தரவை ஒற்றை-தாள் காபிம கோப்பில் ஏற்றுமதி செய்யுங்கள்.

source: Export filtered DX database data to a single-sheet CSV file.
ta: வடிகட்டப்பட்ட டிஎக்ச் தரவுத்தள தரவை ஒற்றை-தாள் சி.எச்.வி கோப்பில் ஏற்றுமதி செய்யுங்கள்.

source: Saves csv file Media directory for user to download
ta: பயனருக்கு பதிவிறக்கம் செய்ய காபிம கோப்பு மீடியா கோப்பகத்தை சேமிக்கிறது

source: Specialised csv exports - NHSBSP formatted mammography export
ta: சிறப்பு சி.எச்.வி ஏற்றுமதி - என்.எச்.எச்.பி.எச்.பி வடிவமைக்கப்பட்ட மேமோகிராபி ஏற்றுமதி

source: Export filtered mammography database data to a NHSBSP formatted single-sheet CSV file.
ta: வடிகட்டப்பட்ட மேமோகிராஃபி தரவுத்தள தரவை ஒரு NHSBSP வடிவமைக்கப்பட்ட ஒற்றை-தாள் காபிம கோப்புக்கு ஏற்றுமதி செய்யுங்கள்.

source: Dictionary of query parameters from the mammo filtered page URL.
ta: மம்மோ வடிகட்டப்பட்ட பக்க முகவரி இலிருந்து வினவல் அளவுருக்களின் அகராதி.

source: None - file is saved to disk and location is stored in database
ta: எதுவுமில்லை - கோப்பு வட்டில் சேமிக்கப்படுகிறது மற்றும் இருப்பிடம் தரவுத்தளத்தில் சேமிக்கப்படுகிறது

source: Export Views
ta: ஏற்றுமதி காட்சிகள்

source: View to launch task to export CT studies to xlsx file in PHE 2019 CT survey format
ta: PHE 2019 CT கணக்கெடுப்பு வடிவத்தில் CT ஆய்வுகளை XLSX கோப்பிற்கு ஏற்றுமதி செய்வதற்கான பணியைத் தொடங்க பார்க்கவும்

source: Contains the database filtering parameters and user details.
ta: தரவுத்தள வடிகட்டுதல் அளவுருக்கள் மற்றும் பயனர் விவரங்கள் உள்ளன.

source: View to launch task to export CT studies to csv file
ta: CT ஆய்வுகளை காபிம கோப்பிற்கு ஏற்றுமதி செய்வதற்கான பணியைத் தொடங்க பார்க்கவும்

source: Contains the database filtering parameters. Also used to get user group.
ta: தரவுத்தள வடிகட்டுதல் அளவுருக்கள் உள்ளன. பயனர் குழுவைப் பெறவும் பயன்படுத்தப்படுகிறது.

source: string, 0 or 1 from URL indicating if names should be exported
ta: முகவரி இலிருந்து சரம், 0 அல்லது 1 பெயர்கள் ஏற்றுமதி செய்யப்பட வேண்டுமா என்பதைக் குறிக்கிறது

source: string, 0 or 1 from URL indicating if patient ID should be exported
ta: நோயாளி ஐடி ஏற்றுமதி செய்யப்பட வேண்டுமா என்பதைக் குறிக்கும் முகவரி இலிருந்து சரம், 0 அல்லது 1

source: View to launch task to export CT studies to xlsx file
ta: எக்ச்எல்எச்எக்ச் கோப்பில் சி.டி ஆய்வுகளை ஏற்றுமதி செய்வதற்கான பணியைத் தொடங்க பார்க்கவும்

source: View to delete export files from the server
ta: சேவையகத்திலிருந்து ஏற்றுமதி கோப்புகளை நீக்க பார்க்கவும்

source: Contains the task ID
ta: பணி ஐடியைக் கொண்டுள்ளது

source: View to handle downloads of files from the server
ta: சேவையகத்திலிருந்து கோப்புகளின் பதிவிறக்கங்களைக் கையாள

source: Originally used for download of the export spreadsheets, now also used for downloading the patient size import logfiles.
ta: ஏற்றுமதி விரிதாள்களைப் பதிவிறக்குவதற்கு முதலில் பயன்படுத்தப்பட்டது, இப்போது நோயாளியின் அளவு இறக்குமதி லாக்ஃபைல்களை பதிவிறக்கவும் பயன்படுத்தப்படுகிறது.

source: Used to get user group.
ta: பயனர் குழுவைப் பெற பயன்படுகிறது.

source: ID of the export or logfile
ta: ஏற்றுமதி அல்லது பதிவு கோப்பின் ஐடி

source: View to launch task to export DX studies to xlsx file in PHE 2019 DX survey format
ta: PHE 2019 டிஎக்ச் கணக்கெடுப்பு வடிவத்தில் எக்ச்எல்எச்எக்ச் கோப்பிற்கு டிஎக்ச் ஆய்வுகளை ஏற்றுமதி செய்வதற்கான பணியைத் தொடங்க பார்க்கவும்

source: string, 'projection' or 'exam'
ta: சரம், 'திட்டம்' அல்லது 'தேர்வு'

source: View to launch task to export DX and CR studies to csv file
ta: சி.எச்.வி கோப்பிற்கு டி.எக்ச் மற்றும் சி.ஆர் ஆய்வுகளை ஏற்றுமதி செய்வதற்கான பணியைத் தொடங்குவதைக் காண்க

source: View to launch task to export DX and CR studies to xlsx file
ta: எக்ச்எல்எச்எக்ச் கோப்பிற்கு டிஎக்ச் மற்றும் சிஆர் ஆய்வுகளை ஏற்றுமதி செய்வதற்கான பணியைத் தொடங்க பார்க்கவும்

source: View to list current and completed exports to track progress, download and delete
ta: முன்னேற்றத்தைக் கண்காணிக்கவும், பதிவிறக்கம் செய்யவும், நீக்கவும் தற்போதைய மற்றும் நிறைவு செய்யப்பட்ட ஏற்றுமதியை பட்டியலிடக் காண்க

source: View to abort current export job
ta: தற்போதைய ஏற்றுமதி வேலையை நிறுத்துவதைக் காண்க

source: Contains the task primary key
ta: பணி முதன்மை விசையை கொண்டுள்ளது

source: Function to remove export task from queue
ta: ஏற்றுமதி பணியை வரிசையில் இருந்து அகற்ற செயல்பாடு

source: UUID of task in question
ta: கேள்விக்குரிய பணியின் uuid

source: View to launch task to export fluoroscopy studies to csv file
ta: சி.எச்.வி கோப்பிற்கு ஃப்ளோரோச்கோபி ஆய்வுகளை ஏற்றுமதி செய்வதற்கான பணியைத் தொடங்குவதைக் காண்க

source: Check if user is allowed to export PID, then check if they have asked to. :param request: request so we can determine the user and therefore groups :param name: string, 0 or 1 from URL indicating if names should be exported :param pat_id: string, 0 or 1 from URL indicating if patient ID should be exported :return: dict, with pidgroup, include_names and include_pat_id as bools
ta: PID ஐ ஏற்றுமதி செய்ய பயனர் அனுமதிக்கப்படுகிறாரா என்று சரிபார்க்கவும், பின்னர் அவர்கள் கேட்டிருக்கிறார்களா என்று சரிபார்க்கவும். . திரும்ப: டிக்ட், பிட் கிரூப்புடன், அடங்கும்_அனேச் மற்றும் அடங்கும்_பாட்_ஐடி பூல்சாக

source: Launches export of mammo data to CSV :param request: Contains the database filtering parameters. Also used to get user group. :param name: string, 0 or 1 from URL indicating if names should be exported :param pat_id: string, 0 or 1 from URL indicating if patient ID should be exported :return:
ta: சி.எச்.வி -க்கு மம்மோ தரவை ஏற்றுமதி தொடங்குகிறது: பரம் கோரிக்கை: தரவுத்தள வடிகட்டுதல் அளவுருக்களைக் கொண்டுள்ளது. பயனர் குழுவைப் பெறவும் பயன்படுத்தப்படுகிறது. .

source: View to launch task to export mammography studies to csv file using a NHSBSP template
ta: என்.எச்.எச்.பி.எச்.பி வார்ப்புருவைப் பயன்படுத்தி சி.எச்.வி கோப்பிற்கு மேமோகிராஃபி ஆய்வுகளை ஏற்றுமதி செய்வதற்கான பணியைத் தொடங்குவதைக் காண்க

source: Launches export of mammo data to xlsx :param request: Contains the database filtering parameters. Also used to get user group. :param name: string, 0 or 1 from URL indicating if names should be exported :param pat_id: string, 0 or 1 from URL indicating if patient ID should be exported :return:
ta: மம்மோ தரவை எக்ச்எல்எச்எக்ச் ஏற்றுமதி தொடங்குகிறது: பரம் கோரிக்கை: தரவுத்தள வடிகட்டுதல் அளவுருக்கள் உள்ளன. பயனர் குழுவைப் பெறவும் பயன்படுத்தப்படுகிறது. .

source: View to launch task to export NM studies to csv file
ta: சி.எச்.வி கோப்பிற்கு என்.எம் ஆய்வுகளை ஏற்றுமதி செய்வதற்கான பணியைத் தொடங்க பார்க்கவும்

source: View to launch celery task to export NM studies to excel file
ta: எக்செல் கோப்புக்கு என்எம் ஆய்வுகளை ஏற்றுமதி செய்ய செலரி பணியைத் தொடங்க பார்க்கவும்

source: View to launch task to export fluoro studies to xlsx file in PHE 2019 IR/fluoro survey format
ta: ஃப்ளோரோ ஆய்வுகளை XLSX கோப்புக்கு PHE 2019 IR/fluro கணக்கெடுப்பு வடிவத்தில் ஏற்றுமதி செய்வதற்கான பணியைத் தொடங்குவதைக் காண்க

source: Create csv export suitable for import to standalone openSkin :param request: request object :param pk: primary key of study in GeneralStudyModuleAttr table
ta: தனித்தனி ஓபன்ச்கின் இறக்குமதிக்கு ஏற்ற சி.எச்.வி ஏற்றுமதியை உருவாக்கவும்: பரம் கோரிக்கை: கோரிக்கை பொருள்: பரம் பி.கே: செனரல்ச்டுடிமோடூல் டிஆர் அட்டவணையில் ஆய்வின் முதன்மை விசை

source: View to launch task to export fluoroscopy studies to xlsx file
ta: XLSX கோப்புக்கு ஃப்ளோரோச்கோபி ஆய்வுகளை ஏற்றுமதி செய்வதற்கான பணியைத் தொடங்க பார்க்கவும்

source: AJAX function to return active exports
ta: செயலில் ஏற்றுமதியை வழங்க அசாக்ச் செயல்பாடு

source: Request object
ta: கோரிக்கை

source: HTML table of active exports
ta: செயலில் ஏற்றுமதியின் உஉகுமொ அட்டவணை

source: AJAX function to return recently completed exports
ta: அசாக்ச் அண்மைக் காலத்தில் முடிக்கப்பட்ட ஏற்றுமதியை திரும்பப் பெறுவதற்கான செயல்பாடு

source: Request object, including pk of latest complete export at initial page load
ta: ஆரம்ப பக்க சுமையில் அண்மைக் கால முழுமையான ஏற்றுமதியின் பி.கே உட்பட கோரிக்கை பொருள்

source: HTML table of completed exports
ta: நிறைவு செய்யப்பட்ட ஏற்றுமதியின் உஉகுமொ அட்டவணை

source: AJAX function to return exports in error state
ta: பிழை நிலையில் ஏற்றுமதியை வழங்க அசாக்ச் செயல்பாடு

source: HTML table of exports in error state
ta: பிழை நிலையில் ஏற்றுமதியின் உஉகுமொ அட்டவணை

source: AJAX function to return queued exports
ta: வரிசைப்படுத்தப்பட்ட ஏற்றுமதியை வழங்க அசாக்ச் செயல்பாடு

source: Filtering code
ta: வடிகட்டுதல் குறியீடு

source: Adding patient name and ID to filter if permissions allow
ta: அனுமதிகள் அனுமதித்தால் வடிகட்ட நோயாளியின் பெயர் மற்றும் ஐடியைச் சேர்ப்பது

source: Adding standard name fields
ta: நிலையான பெயர் புலங்களைச் சேர்ப்பது

source: Filter for CT studies to display in web interface.
ta: வலை இடைமுகத்தில் காண்பிக்க CT ஆய்வுகளுக்கு வடிகட்டி.

source: Lists fields and order-by information for django-filter filtering
ta: சாங்கோ-வடிகட்டி வடிகட்டலுக்கான புலங்கள் மற்றும் ஆர்டர்-பை தகவல்களை பட்டியலிடுகிறது

source: Filter for DX studies to display in web interface.
ta: வலை இடைமுகத்தில் காண்பிக்க டிஎக்ச் ஆய்வுகளுக்கு வடிகட்டி.

source: Custom filter to order by date and time as they are two seperate fields
ta: இரண்டு தனித்தனி புலங்களாக இருப்பதால் தேதி மற்றும் நேரத்தால் ஆர்டர் செய்ய தனிப்பயன் வடிகட்டி

source: Sets order_by to date then time and returns queryset
ta: இன்றுவரை ஆர்டர்_பியை அமைக்கிறது மற்றும் நேரத்தை வழங்குகிறது

source: list containing ordering type as string
ta: வரிசையாக வரிசைப்படுத்தும் பட்டியல் சரம்

source: ordered queryset
ta: ஆர்டர் செய்யப்பட்ட Queryset

source: Filter for mammography studies to display in web interface.
ta: வலை இடைமுகத்தில் காண்பிக்க மேமோகிராஃபி ஆய்வுகளுக்கான வடிகட்டி.

source: Filter for NM studies to display in web interface.
ta: வலை இடைமுகத்தில் காண்பிக்க என்எம் ஆய்வுகளுக்கு வடிகட்டி.

source: Filter for fluoroscopy studies to display in web interface.
ta: வலை இடைமுகத்தில் காண்பிக்க ஃப்ளோரோச்கோபி ஆய்வுகளுக்கு வடிகட்டி.

source: Search for ID as plain text and encrypted
ta: ஐடியை எளிய உரையாகத் தேடுங்கள் மற்றும் குறியாக்கம் செய்யப்பட்டது

source: Search for name as plain text and encrypted
ta: பெயரை வெற்று உரை மற்றும் குறியாக்கம் என தேடுங்கள்

source: Forms
ta: படிவங்கள்

source: Form for configuring the maximum number of rows in the BackgroundTask table
ta: பின்னணி டாச்க் அட்டவணையில் அதிகபட்ச வரிசைகளை உள்ளமைப்பதற்கான படிவம்

source: Return all media required to render the widgets on this form.
ta: இந்த படிவத்தில் விட்செட்களை வழங்க தேவையான அனைத்து ஊடகங்களையும் திருப்பி விடுங்கள்.

source: Form for CT chart display options
ta: CT விளக்கப்படம் காட்சி விருப்பங்களுக்கான படிவம்

source: Form for CT chart options
ta: CT விளக்கப்படம் விருப்பங்களுக்கான படிவம்

source: Form for DX chart display options
ta: டிஎக்ச் விளக்கப்பட காட்சி விருப்பங்களுக்கான படிவம்

source: Form for DX chart options
ta: டிஎக்ச் விளக்கப்பட விருப்பங்களுக்கான படிவம்

source: Form for configuring whether DICOM objects are stored or deleted once processed
ta: DICOM பொருள்கள் செயலாக்கப்பட்டவுடன் சேமிக்கப்படுகிறதா அல்லது நீக்கப்பட்டதா என்பதை உள்ளமைப்பதற்கான படிவம்

source: Form for configuring remote Query Retrieve nodes
ta: தொலைநிலை வினவலை உள்ளமைப்பதற்கான படிவம் முனைகளை மீட்டெடுக்கும்

source: Form for launching DICOM Query
ta: டிகாம் வினவலைத் தொடங்குவதற்கான படிவம்

source: Validate the form data to clear modality selections if sr_only is selected. :return: Form with modalities _or_ sr_only selected
ta: SR_ONLY தேர்ந்தெடுக்கப்பட்டால், மாதிரி தேர்வுகளை அழிக்க படிவத் தரவை சரிபார்க்கவும். : திரும்ப: முறைகள் கொண்ட படிவம் _or_ sr_only தேர்ந்தெடுக்கப்பட்டது

source: date(year, month, day) --> date object
ta: தேதி (ஆண்டு, மாதம், நாள்) -> தேதி பொருள்

source: Return ctime() style string.
ta: CTIME () பாணி சரம் திரும்பவும்.

source: int, int, int -> Construct a date from the ISO year, week number and weekday.
ta: Int, int, int -> ஐஎச்ஓ ஆண்டு, வார எண் மற்றும் வார நாளிலிருந்து ஒரு தேதியை உருவாக்குங்கள்.

source: This is the inverse of the date.isocalendar() function
ta: இது தேதியின் தலைகீழ். ஐசோகாலெண்டர் () செயல்பாடு

source: str -> Construct a date from the output of date.isoformat()
ta: str -> தேதியின் வெளியீட்டிலிருந்து ஒரு தேதியை உருவாக்குங்கள். ஐசோஃபார்மாட் ()

source: int -> date corresponding to a proleptic Gregorian ordinal.
ta: int -> ஒரு புரோலெப்டிக் கிரிகோரியன் ஆர்டினலுடன் தொடர்புடைய தேதி.

source: Create a date from a POSIX timestamp.
ta: POSIX நேர முத்திரையிலிருந்து ஒரு தேதியை உருவாக்கவும்.

source: The timestamp is a number, e.g. created via time.time(), that is interpreted as local time.
ta: நேர முத்திரை ஒரு எண், எ.கா. நேரம். நேரம் () வழியாக உருவாக்கப்பட்டது, இது உள்ளக நேரமாக விளக்கப்படுகிறது.

source: Return a named tuple containing ISO year, week number, and weekday.
ta: ஐஎச்ஓ ஆண்டு, வார எண் மற்றும் வார நாள் கொண்ட பெயரிடப்பட்ட டப்பிள் திரும்பவும்.

source: Return string in ISO 8601 format, YYYY-MM-DD.
ta: ஐஎச்ஓ 8601 வடிவத்தில் சரம் திரும்பவும், yyyy-mm-dd.

source: Return the day of the week represented by the date. Monday == 1 ... Sunday == 7
ta: தேதியால் குறிப்பிடப்படும் வாரத்தின் நாளைத் திரும்புக. திங்கள் == 1 ... ஞாயிறு == 7

source: Return date with new specified fields.
ta: புதிய குறிப்பிட்ட புலங்களுடன் திரும்ப தேதி.

source: format -> strftime() style string.
ta: வடிவம் -> strftime () பாணி சரம்.

source: Return time tuple, compatible with time.localtime().
ta: நேர டப்பிள், நேரத்துடன் இணக்கமானது.

source: Current date or datetime: same as self.__class__.fromtimestamp(time.time()).
ta: தற்போதைய தேதி அல்லது தேதிநேரம்: சுயத்தைப் போன்றது .__ வகுப்பு __.

source: Return proleptic Gregorian ordinal. January 1 of year 1 is day 1.
ta: ரிட்டர்ன் புரோலெப்டிக் கிரிகோரியன் ஆர்டினல். ஆண்டு 1 இன் சனவரி 1 நாள் 1.

source: Return the day of the week represented by the date. Monday == 0 ... Sunday == 6
ta: தேதியால் குறிப்பிடப்படும் வாரத்தின் நாளைத் திரும்புக. திங்கள் == 0 ... ஞாயிறு == 6

source: Form for configuring local Store nodes
ta: உள்ளக கடை முனைகளை உள்ளமைப்பதற்கான படிவம்

source: Form for general chart display options
ta: பொது விளக்கப்பட காட்சி விருப்பங்களுக்கான படிவம்

source: Form for displaying and changing the home page options
ta: முகப்பு பக்க விருப்பங்களைக் காண்பிப்பதற்கும் மாற்றுவதற்கும் படிவம்

source: Form for MG chart display options
ta: Mg விளக்கப்பட காட்சி விருப்பங்களுக்கான படிவம்

source: Form for MG chart options
ta: எம்சி விளக்கப்பட விருப்பங்களுக்கான படிவம்

source: Form for displaying and changing the option for merging on Device Observer UID
ta: சாதன பார்வையாளரின் UID இல் இணைப்பதற்கான விருப்பத்தை காண்பிப்பதற்கும் மாற்றுவதற்கும் படிவம்

source: Form for NM chart display options
ta: என்எம் விளக்கப்பட காட்சி விருப்பங்களுக்கான படிவம்

source: Form for NM chart options
ta: என்எம் விளக்கப்பட விருப்பங்களுக்கான படிவம்

source: Form for configuring not-patient ID patterns
ta: நோயாளி ஐடி வடிவங்களை உள்ளமைப்பதற்கான வடிவம்

source: Form for configuring not-patient name patterns
ta: நோயாளி பெயர் வடிவங்களை உள்ளமைப்பதற்கான படிவம்

source: Form for RF chart display options
ta: வானலை விளக்கப்படம் காட்சி விருப்பங்களுக்கான படிவம்

source: Form for RF chart options
ta: வானலை விளக்கப்பட விருப்பங்களுக்கான படிவம்

source: Form for displaying and changing fluoroscopy high dose alert settings
ta: ஃப்ளோரோச்கோபி உயர் டோச் எச்சரிக்கை அமைப்புகளைக் காண்பிப்பதற்கும் மாற்றுவதற்கும் படிவம்

source: Form for csv column header patient size imports through the web interface
ta: சி.எச்.வி நெடுவரிசை தலைப்பு நோயாளியின் அளவு வலை இடைமுகத்தின் மூலம் இறக்குமதி செய்யப்படுவது

source: Form for patient size csv file upload
ta: நோயாளியின் அளவு காபிம கோப்பு பதிவேற்றத்திற்கான படிவம்

source: Form for configuring whether skin dose maps are shown / calculated
ta: தோல் டோச் வரைபடங்கள் காட்டப்பட்டுள்ளதா / கணக்கிடப்படுகிறதா என்பதை உள்ளமைப்பதற்கான வடிவம்

source: Form for adding/updating/removing system from openSkin safe list
ta: ஓபன்ச்கின் பாதுகாப்பான பட்டியலிலிருந்து கணினியைச் சேர்ப்பது/புதுப்பித்தல்/அகற்றுவதற்கான படிவம்

source: For configuring standard names for study description, requested procedure, procedure and acquisition name.
ta: ஆய்வு விளக்கத்திற்கான நிலையான பெயர்களை உள்ளமைக்க, கோரப்பட்ட நடைமுறை, செயல்முறை மற்றும் கையகப்படுத்தல் பெயர்.

source: Form for configuring standard names for study description, requested procedure, procedure and acquisition name
ta: ஆய்வு விளக்கம், கோரப்பட்ட செயல்முறை, செயல்முறை மற்றும் கையகப்படுத்தல் பெயர் ஆகியவற்றிற்கான நிலையான பெயர்களை உள்ளமைப்பதற்கான படிவம்

source: Form for configuring whether standard names are shown / used
ta: நிலையான பெயர்கள் காட்டப்பட்டுள்ளதா / பயன்படுத்தப்படுகிறதா என்பதை உள்ளமைப்பதற்கான படிவம்

source: Models
ta: மாதிரிகள்

source: Accumulated Cassette-based Projection Radiography Dose TID 10006
ta: திரட்டப்பட்ட கேசட் அடிப்படையிலான ப்ரொசெக்சன் ரேடியோகிராஃபி டோச் TID 10006

source: From DICOM Part 16 Correction Proposal CP-1077:
ta: DICOM பகுதி 16 திருத்தம் திட்டத்திலிருந்து CP-1077:

source: This template provides information on Projection Radiography dose values accumulated on Cassette- based systems over one or more irradiation events (typically a study or a performed procedure step) from the same equipment.
ta: இந்த வார்ப்புரு ஒரே சாதனங்களிலிருந்து ஒன்று அல்லது அதற்கு மேற்பட்ட கதிர்வீச்சு நிகழ்வுகளில் (பொதுவாக ஒரு ஆய்வு அல்லது நிகழ்த்தப்பட்ட செயல்முறை படி) கேசட் அடிப்படையிலான அமைப்புகளில் திரட்டப்பட்ட திட்ட ரேடியோகிராஃபி டோச் மதிப்புகள் பற்றிய தகவல்களை வழங்குகிறது.

source: Accumulated Integrated Projection Radiography Dose TID 10007
ta: திரட்டப்பட்ட ஒருங்கிணைந்த திட்ட ரேடியோகிராஃபி டோச் TID 10007

source: This template provides information on Projection Radiography dose values accumulated on Integrated systems over one or more irradiation events (typically a study or a performed procedure step) from the same equipment.
ta: இந்த வார்ப்புரு ஒரே சாதனங்களிலிருந்து ஒன்று அல்லது அதற்கு மேற்பட்ட கதிர்வீச்சு நிகழ்வுகளில் (பொதுவாக ஒரு ஆய்வு அல்லது நிகழ்த்தப்பட்ட செயல்முறை படி) ஒருங்கிணைந்த அமைப்புகளில் திரட்டப்பட்ட திட்ட ரேடியோகிராஃபி டோச் மதிப்புகள் பற்றிய தகவல்களை வழங்குகிறது.

source: Converts Gy.m2 to cGy.cm2 for display in web interface
ta: வலை இடைமுகத்தில் காட்சிக்கு Gy.m2 ஐ CGY.CM2 ஆக மாற்றுகிறது

source: Converts total DAP over delta days from Gy.m2 to cGy.cm2 for display in web interface
ta: வலை இடைமுகத்தில் காட்சிக்கு Gy.M2 இலிருந்து CGY.CM2 ஆக டெல்டா நாட்களில் மொத்த DAP ஐ மாற்றுகிறது

source: Accumulated Mammography X-Ray Dose TID 10005
ta: திரட்டப்பட்ட மேமோகிராஃபி எக்ச்-ரே டோச் டிஐடி 10005

source: From DICOM Part 16:
ta: டிகாம் பகுதி 16 இலிருந்து:

source: This modality specific template provides detailed information on mammography X-Ray dose value accumulations over several irradiation events from the same equipment (typically a study or a performed procedure step).
ta: இந்த முறை குறிப்பிட்ட வார்ப்புரு மேமோகிராஃபி எக்ச்-ரே டோச் மதிப்பு திரட்டல்கள் பற்றிய விரிவான தகவல்களை ஒரே சாதனங்களிலிருந்து பல கதிர்வீச்சு நிகழ்வுகளில் (பொதுவாக ஒரு ஆய்வு அல்லது நிகழ்த்தப்பட்ட செயல்முறை படி) வழங்குகிறது.

source: Accumulated Fluoroscopy and Acquisition Projection X-Ray Dose TID 10004
ta: திரட்டப்பட்ட ஃப்ளோரோச்கோபி மற்றும் கையகப்படுத்தல் திட்டம் எக்ச்-ரே டோச் டிஐடி 10004
