Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: This general template provides detailed information on projection X-Ray dose value accumulations over several irradiation events from the same equipment (typically a study or a performed procedure step).
ta: இந்த பொது வார்ப்புரு அதே உபகரணங்களிலிருந்து பல கதிர்வீச்சு நிகழ்வுகளில் (பொதுவாக ஒரு ஆய்வு அல்லது நிகழ்த்தப்பட்ட செயல்முறை படி) ப்ரொசெக்சன் எக்ச்-ரே டோச் மதிப்பு திரட்டல்கள் பற்றிய விரிவான தகவல்களை வழங்குகிறது.

source: Converts acquisition DAP total from Gy.m2 to cGy.cm2 for display in web interface
ta: வலை இடைமுகத்தில் காட்சிக்கு GY.M2 இலிருந்து CGY.CM2 ஆக கையகப்படுத்தல் DAP மொத்த மாற்றுகிறது

source: Converts fluoroscopy DAP total from Gy.m2 to cGy.cm2 for display in web interface
ta: வலை இடைமுகத்தில் காட்சிக்கு gy.m2 இலிருந்து CGY.CM2 ஆக ஃப்ளோரோச்கோபி DAP ஐ மாற்றுகிறது

source: Accumulated X-Ray Dose TID 10002
ta: திரட்டப்பட்ட எக்ச்ரே டோச் TID 10002

source: Record if admin tasks have been dealt with
ta: நிர்வாக பணிகள் தீர்க்கப்பட்டிருந்தால் பதிவு செய்யுங்கள்

source: Table to store the maximum number of rows allowed in the BackgroundTask table
ta: பின்னணி டாச்க் அட்டவணையில் அனுமதிக்கப்பட்ட அதிகபட்ச வரிசைகளை சேமிக்க அட்டவணை

source: Table to hold the calibration information
ta: அளவுத்திருத்த தகவல்களை வைத்திருக்க அட்டவணை

source: Container in TID 10002 Accumulated X-ray dose
ta: TID 10002 இல் கொள்கலன் திரட்டப்பட்ட எக்ச்ரே டோச்

source: Table to hold all the context ID code values and code meanings.
ta: அனைத்து சூழல் ஐடி குறியீடு மதிப்புகள் மற்றும் குறியீடு அர்த்தங்களையும் வைத்திருக்க அட்டவணை.

source: Could be prefilled from the tables in DICOM 3.16, but is actually populated as the codes occur. This assumes they are used correctly.
ta: DICOM 3.16 இல் உள்ள அட்டவணைகளிலிருந்து முன்கூட்டியே நிரப்பப்படலாம், ஆனால் குறியீடுகள் நிகழும்போது உண்மையில் மக்கள் தொகை கொண்டது. அவை சரியாகப் பயன்படுத்தப்படுகின்றன என்று இது கருதுகிறது.

source: CT Accumulated Dose Data
ta: CT திரட்டப்பட்ட டோச் தரவு

source: This general template provides detailed information on CT X-Ray dose value accumulations over several irradiation events from the same equipment and over the scope of accumulation specified for the report (typically a Study or a Performed Procedure Step).
ta: இந்த பொது வார்ப்புரு சி.டி எக்ச்-ரே டோச் மதிப்பு குவிப்பு பற்றிய விரிவான தகவல்களை ஒரே உபகரணங்களிலிருந்து பல கதிர்வீச்சு நிகழ்வுகள் மற்றும் அறிக்கைக்கு குறிப்பிடப்பட்ட திரட்சியின் நோக்கம் (பொதுவாக ஒரு ஆய்வு அல்லது நிகழ்த்தப்பட்ட செயல்முறை படி) ஆகியவற்றை வழங்குகிறது.

source: CT Dose Check Details TID 10015
ta: சி.டி டோச் காசோலை விவரங்கள் 10015

source: This template records details related to the use of the NEMA Dose Check Standard (NEMA XR-25-2010).
ta: இந்த வார்ப்புரு நேமா டோச் காசோலை தரநிலையின் பயன்பாடு தொடர்பான விவரங்களை பதிவு செய்கிறது (NEMA XR-25-2010).

source: CT Irradiation Event Data TID 10013
ta: சி.டி கதிர்வீச்சு நிகழ்வு தரவு 10013

source: This template conveys the dose and equipment parameters of a single irradiation event.
ta: இந்த வார்ப்புரு ஒற்றை கதிர்வீச்சு நிகழ்வின் டோச் மற்றும் உபகரண அளவுருக்களை தெரிவிக்கிறது.

source: Additional to the template:
ta: வார்ப்புருவுக்கு கூடுதல்:

source: series_description
ta: தொடர்_ விளக்கப்படம்

source: CT Radiation Dose TID 10011
ta: சி.டி கதிர்வீச்சு டோச் நேரம் 10011

source: This template defines a container (the root) with subsidiary content items, each of which corresponds to a single CT X-Ray irradiation event entry. There is a defined recording observer (the system or person responsible for recording the log, generally the system). Accumulated values shall be kept for a whole Study or at least a part of a Study, if the Study is divided in the workflow of the examination, or a performed procedure step. Multiple CT Radiation Dose objects may be created for one Study.
ta: இந்த வார்ப்புரு துணை உள்ளடக்க உருப்படிகளுடன் ஒரு கொள்கலனை (ரூட்) வரையறுக்கிறது, அவை ஒவ்வொன்றும் ஒற்றை சி.டி எக்ச்-ரே கதிர்வீச்சு நிகழ்வு நுழைவுக்கு ஒத்திருக்கும். வரையறுக்கப்பட்ட பதிவு பார்வையாளர் உள்ளது (பதிவைப் பதிவுசெய்யும் அமைப்பு அல்லது நபர், பொதுவாக கணினி). பரிசோதனையின் பணிப்பாய்வுகளில் அல்லது நிகழ்த்தப்பட்ட நடைமுறை நடவடிக்கையில் ஆய்வு பிரிக்கப்பட்டால், ஒரு முழு ஆய்வுக்கு அல்லது குறைந்தபட்சம் ஒரு ஆய்வின் ஒரு பகுதியையாவது திரட்டப்பட்ட மதிப்புகள் வைக்கப்படும். ஒரு ஆய்வுக்கு பல சி.டி கதிர்வீச்சு டோச் பொருள்கள் உருவாக்கப்படலாம்.

source: Container in TID 10013 to hold CT reconstruction methods
ta: சி.டி. புனரமைப்பு முறைகளை வைத்திருக்க 10013 இல் கொள்கலன்

source: Container in TID 10013 to hold CT x-ray source parameters
ta: சி.டி எக்ச்-ரே மூல அளவுருக்களை வைத்திருக்க 10013 இல் கொள்கலன்

source: Device Participant TID 1021
ta: சாதன பங்கேற்பாளர் 1021

source: This template describes a device participating in an activity as other than an observer or subject. E.g. for a dose report documenting an irradiating procedure, participants include the irradiating device.
ta: இந்த வார்ப்புரு ஒரு பார்வையாளர் அல்லது பொருள் தவிர ஒரு செயல்பாட்டில் பங்கேற்கும் சாதனத்தை விவரிக்கிறது. எ.கா. கதிர்வீச்சு நடைமுறையை ஆவணப்படுத்தும் டோச் அறிக்கைக்கு, பங்கேற்பாளர்கள் கதிரியக்க சாதனம் அடங்கும்.

source: Table to store DICOM deletion settings
ta: DICOM நீக்குதல் அமைப்புகளை சேமிக்க அட்டவணை

source: Table to store DICOM query settings
ta: டிகாம் வினவல் அமைப்புகளை சேமிக்க அட்டவணை

source: Table to store DICOM remote QR settings
ta: DICOM ரிமோட் QR அமைப்புகளை சேமிக்க அட்டவணை

source: Table to store DICOM store settings
ta: டிகாம் கடை அமைப்புகளை சேமிக்க அட்டவணை

source: Dose Related Distance Measurements Context ID 10008
ta: டோச் தொடர்பான தூர அளவீடுகள் சூழல் ஐடி 10008

source: Called from TID 10003c
ta: TID 10003C இலிருந்து அழைக்கப்படுகிறது

source: Table to hold the export status and filenames
ta: ஏற்றுமதி நிலை மற்றும் கோப்பு பெயர்களை வைத்திருக்க அட்டவணை

source: In TID 10003b. Code value 113736 (uA.s)
ta: TID 10003B இல். குறியீடு மதிப்பு 113736 (UA.S)

source: Converts uAs to mAs for display in web interface
ta: வலை இடைமுகத்தில் காட்சிக்கு ஐ.ஏ.எச்

source: General Equipment Module C.7.5.1
ta: பொது உபகரணங்கள் தொகுதி C.7.5.1

source: From DICOM Part 3: Information Object Definitions Table C.7-8:
ta: DICOM பகுதி 3 இலிருந்து: செய்தி பொருள் வரையறைகள் அட்டவணை C.7-8:

source: Specifies the Attributes that identify and describe the piece of equipment that produced a Series of Composite Instances.
ta: தொடர்ச்சியான கலப்பு நிகழ்வுகளை உருவாக்கிய உபகரணங்களை அடையாளம் கண்டு விவரிக்கும் பண்புகளை குறிப்பிடுகிறது.

source: General Study Module C.7.2.1
ta: பொது ஆய்வு தொகுதி C.7.2.1

source: Specifies the Attributes that describe and identify the Study performed upon the Patient. From DICOM Part 3: Information Object Definitions Table C.7-3
ta: நோயாளியின் மீது நிகழ்த்தப்பட்ட ஆய்வை விவரிக்கும் மற்றும் அடையாளம் காணும் பண்புகளை குறிப்பிடுகிறது. DICOM பகுதி 3 இலிருந்து: செய்தி பொருள் வரையறைகள் அட்டவணை C.7-3

source: Additional to the module definition:
ta: தொகுதி வரையறைக்கு கூடுதல்:

source: performing_physician_name
ta: செயல்திறன்_பிசீசியன்_பேம்

source: operator_name
ta: ஆபரேட்டர்_பெயர்

source: modality_type
ta: முறை_ வகை

source: procedure_code_value_and_meaning
ta: process_code_value_and_meaning

source: requested_procedure_code_value_and_meaning
ta: கோரப்பட்டது_பிராசர்_கோட்_வல்யூ_ஆன்ட்_மீனிங்

source: Converts DAP A to cGy.cm2 from Gy.m2 for display or export
ta: காட்சி அல்லது ஏற்றுமதிக்கு Gy.m2 இலிருந்து DAP ஐ CGY.CM2 ஆக மாற்றுகிறது

source: Converts DAP B to cGy.cm2 from Gy.m2 for display or export
ta: காட்சி அல்லது ஏற்றுமதிக்காக Gy.m2 இலிருந்து DAP B ஐ CGY.CM2 ஆக மாற்றுகிறது

source: Converts DAP delta weeks to cGy.cm2 from Gy.m2 for display
ta: டிஏபி டெல்டா வாரங்களை காட்சிக்கு Gy.m2 இலிருந்து CGY.CM2 ஆக மாற்றுகிறது

source: Converts DAP A+B to cGy.cm2 from Gy.m2 for display or export
ta: காட்சி அல்லது ஏற்றுமதிக்கு Gy.m2 இலிருந்து DAP A+B ஐ CGY.CM2 ஆக மாற்றுகிறது

source: Table to store whether users should receive high dose fluoroscopy alerts
ta: பயனர்கள் அதிக அளவு ஃப்ளோரோச்கோபி எச்சரிக்கைகளைப் பெற வேண்டுமா என்பதை சேமிக்க அட்டவணை

source: Table to store high dose fluoroscopy alert settings
ta: அதிக அளவு ஃப்ளோரோச்கோபி எச்சரிக்கை அமைப்புகளை சேமிக்க அட்டவணை

source: Table to store home page settings
ta: முகப்பு பக்க அமைப்புகளை சேமிக்க அட்டவணை

source: Table to hold image view modifiers for the irradiation event x-ray data table
ta: கதிர்வீச்சு நிகழ்வு எக்ச்ரே தரவு அட்டவணைக்கான படக் காட்சி மாற்றிகளை வைத்திருக்க அட்டவணை

source: From DICOM Part 16 Annex D DICOM controlled Terminology Definitions
ta: டிகாம் பகுதி 16 இணைப்பு டி டிகாம் கட்டுப்படுத்தப்பட்ட சொற்களஞ்சிய வரையறைகள்

source: Code Value 111032
ta: குறியீடு மதிப்பு 111032

source: Code Meaning Image View Modifier
ta: குறியீடு பொருள் படக் காட்சி மாற்றியமைப்பாளர்

source: Code Definition Modifier for image view
ta: படக் காட்சிக்கான குறியீடு வரையறை மாற்றி

source: Irradiation Event X-Ray Data TID 10003
ta: கதிர்வீச்சு நிகழ்வு எக்ச்ரே தரவு TID 10003

source: From DICOM part 16:
ta: டிகாம் பகுதி 16 இலிருந்து:

source: Irradiation Event X-Ray Detector Data TID 10003a
ta: கதிர்வீச்சு நிகழ்வு எக்ச்ரே டிடெக்டர் தரவு TID 10003A

source: This template contains data which is expected to be available to the X-ray detector or plate reader component of the equipment.
ta: இந்த வார்ப்புருவில் எக்ச்ரே டிடெக்டர் அல்லது பிளேட் ரீடர் கூறுக்கு கிடைக்கும் என்று எதிர்பார்க்கப்படும் தரவு உள்ளது.

source: Irradiation Event X-Ray Mechanical Data TID 10003c
ta: கதிர்வீச்சு நிகழ்வு எக்ச்ரே மெக்கானிக்கல் டேட்டா டிஐடி 10003 சி

source: This template contains data which is expected to be available to the gantry or mechanical component of the equipment.
ta: இந்த வார்ப்புருவில் தரவு உள்ளது, இது உபகரணங்களின் கேன்ட்ரி அல்லது இயந்திர கூறுகளுக்கு கிடைக்கும் என்று எதிர்பார்க்கப்படுகிறது.

source: compression_force
ta: சுருக்க_ஃபோர்ச்

source: magnification_factor
ta: உருப்பெருக்கம்_பாக்டர்

source: Irradiation Event X-Ray Source Data TID 10003b
ta: கதிர்வீச்சு நிகழ்வு எக்ச்ரே மூல தரவு 10003 பி

source: This template contains data which is expected to be available to the X-ray source component of the equipment.
ta: இந்த வார்ப்புருவில் தரவு உள்ளது, இது சாதனங்களின் எக்ச்ரே மூல கூறுக்கு கிடைக்கும் என்று எதிர்பார்க்கப்படுகிறது.

source: exposure_control_mode
ta: exporse_control_mode

source: grid information over and above grid type
ta: கட்டம் வகைக்கு மேல் மற்றும் அதற்கு மேல் கட்டம் செய்தி

source: Converts Gy to mGy for display in web interface
ta: வலை இடைமுகத்தில் காட்சிக்கு Gy ஐ MGY ஆக மாற்றுகிறது

source: In TID 10003b. Code value 113733 (kV)
ta: TID 10003B இல். குறியீடு மதிப்பு 113733 (கே.வி)

source: Table to store setting(s) for autmoatic setting of Display Name and Modality type based on same Device observer UID
ta: ஒரே சாதன பார்வையாளரின் அடிப்படையில் காட்சி பெயர் மற்றும் முறை வகையின் தானியங்கி அமைப்பிற்கான அமைப்பை (களை) சேமிக்க அட்டவணை

source: Table to record strings that indicate a patient ID is really a test or QA ID
ta: நோயாளியின் ஐடியைக் குறிக்கும் சரங்களை பதிவு செய்வதற்கான அட்டவணை உண்மையில் ஒரு சோதனை அல்லது QA ஐடி

source: Table to record strings that indicate a patient name is really a test or QA name
ta: நோயாளியின் பெயரைக் குறிக்கும் சரங்களை பதிவு செய்வதற்கான அட்டவணை உண்மையில் ஒரு சோதனை அல்லது QA பெயர்

source: Table to hold the SOP Instance UIDs of the objects that have been processed against this study to enable duplicate sorting.
ta: நகல் வரிசையாக்கத்தை செயல்படுத்த இந்த ஆய்வுக்கு எதிராக செயலாக்கப்பட்ட பொருள்களின் சோப் நிகழ்வு UID களை வைத்திருக்க அட்டவணை.

source: Observer Context TID 1002
ta: பார்வையாளர் சூழல் நேரம் 1002

source: The observer (person or device) that created the Content Items to which this context applies.
ta: இந்த சூழல் பொருந்தும் உள்ளடக்க உருப்படிகளை உருவாக்கிய பார்வையாளர் (நபர் அல்லது சாதனம்).

source: Table to store systems names and software versions that are suitable for OpenSkin
ta: ஓபன்ச்கினுக்கு ஏற்ற அமைப்புகளின் பெயர்கள் மற்றும் மென்பொருள் பதிப்புகளை சேமிக்க அட்டவணை

source: Table to hold foreign keys of all studies that fall within the delta weeks of each RF study.
ta: ஒவ்வொரு வானலை ஆய்வின் டெல்டா வாரங்களுக்குள் வரும் அனைத்து ஆய்வுகளின் வெளிநாட்டு விசைகளை வைத்திருக்க அட்டவணை.

source: Table to store patient ID settings
ta: நோயாளி ஐடி அமைப்புகளை சேமிக்க அட்டவணை

source: Patient Module C.7.1.1
ta: நோயாளி தொகுதி C.7.1.1

source: From DICOM Part 3: Information Object Definitions Table C.7-1:
ta: DICOM பகுதி 3 இலிருந்து: செய்தி பொருள் வரையறைகள் அட்டவணை C.7-1:

source: Specifies the Attributes of the Patient that describe and identify the Patient who is the subject of a diagnostic Study. This Module contains Attributes of the patient that are needed for diagnostic interpretation of the Image and are common for all studies performed on the patient. It contains Attributes that are also included in the Patient Modules in Section C.2.
ta: நோயறிதல் ஆய்வுக்கு உட்பட்ட நோயாளியை விவரிக்கும் மற்றும் அடையாளம் காணும் நோயாளியின் பண்புகளை குறிப்பிடுகிறது. இந்த தொகுதிக்கு நோயாளியின் பண்புக்கூறுகள் உள்ளன, அவை படத்தின் கண்டறியும் விளக்கத்திற்கு தேவைப்படுகின்றன மற்றும் நோயாளியின் மீது நிகழ்த்தப்படும் அனைத்து ஆய்வுகளுக்கும் பொதுவானவை. பிரிவு C.2 இல் நோயாளியின் தொகுதிகளிலும் சேர்க்கப்பட்டுள்ள பண்புகளை இது கொண்டுள்ளது.

source: Patient Study Module C.7.2.2
ta: நோயாளி ஆய்வு தொகுதி C.7.2.2

source: From DICOM Part 3: Information Object Definitions Table C.7-4a:
ta: DICOM பகுதி 3 இலிருந்து: செய்தி பொருள் வரையறைகள் அட்டவணை C.7-4A:

source: Defines Attributes that provide information about the Patient at the time the Study started.
ta: ஆய்வு தொடங்கிய நேரத்தில் நோயாளியைப் பற்றிய தகவல்களை வழங்கும் பண்புகளை வரையறுக்கிறது.

source: Person Participant TID 1020
ta: நபர் பங்கேற்பாளர் 1020

source: This template describes a person participating in an activity as other than an observer or subject. E.g. for a dose report documenting an irradiating procedure, participants include the person administering the irradiation and the person authorizing the irradiation.
ta: இந்த வார்ப்புரு ஒரு நபரை ஒரு பார்வையாளர் அல்லது பொருள் தவிர வேறு ஒரு செயலில் பங்கேற்கும் நபரை விவரிக்கிறது. எ.கா. கதிர்வீச்சு நடைமுறையை ஆவணப்படுத்தும் ஒரு டோச் அறிக்கைக்கு, பங்கேற்பாளர்கள் கதிர்வீச்சை நிர்வகிக்கும் நபரும் கதிர்வீச்சுக்கு ஏற்பு வழங்கும் நபரும் அடங்கும்.

source: Projection X-Ray Radiation Dose template TID 10001
ta: ப்ரொசெக்சன் எக்ச்ரே கதிர்வீச்சு டோச் வார்ப்புரு TID 10001

source: This template defines a container (the root) with subsidiary content items, each of which represents a single projection X-Ray irradiation event entry or plane-specific dose accumulations. There is a defined recording observer (the system or person responsible for recording the log, generally the system). A Biplane irradiation event will be recorded as two individual events, one for each plane. Accumulated values will be kept separate for each plane.
ta: இந்த வார்ப்புரு துணை உள்ளடக்க உருப்படிகளுடன் ஒரு கொள்கலனை (ரூட்) வரையறுக்கிறது, அவை ஒவ்வொன்றும் ஒற்றை திட்ட எக்ச்ரே கதிர்வீச்சு நிகழ்வு நுழைவு அல்லது வானூர்தி சார்ந்த டோச் குவிப்புகளைக் குறிக்கின்றன. வரையறுக்கப்பட்ட பதிவு பார்வையாளர் உள்ளது (பதிவைப் பதிவுசெய்யும் அமைப்பு அல்லது நபர், பொதுவாக கணினி). ஒரு பிப்ளேன் கதிர்வீச்சு நிகழ்வு இரண்டு தனிப்பட்ட நிகழ்வுகளாக பதிவு செய்யப்படும், ஒவ்வொரு விமானத்திற்கும் ஒன்று. திரட்டப்பட்ட மதிப்புகள் ஒவ்வொரு விமானத்திற்கும் தனித்தனியாக வைக்கப்படும்.

source: In TID 10003b. Code value 113793 (ms)
ta: TID 10003B இல். குறியீடு மதிப்பு 113793 (எம்.எச்)

source: Radiopharmaceutical Radiation Dose TID 10021
ta: ரேடியோஃபார்மாசூட்டிகல் கதிர்வீச்சு டோச் 10021

source: This Template defines a container (the root) with subsidiary Content Items, each of which corresponds to a single Radiopharmaceutical Administration Dose event entry. There is a defined recording observer (the system and/or person responsible for recording the assay of the radiopharmaceutical, and the person administered the radiopharmaceutical). Multiple Radiopharmaceutical Radiation Dose objects may be created for one study. Radiopharmaceutical Start DateTime in TID 10022 “Radiopharmaceutical Administration Event Data” will convey the order of administrations.
ta: இந்த வார்ப்புரு துணை உள்ளடக்க உருப்படிகளுடன் ஒரு கொள்கலனை (ரூட்) வரையறுக்கிறது, அவை ஒவ்வொன்றும் ஒற்றை ரேடியோஃபார்மாசூட்டிகல் நிர்வாக டோச் நிகழ்வு நுழைவுக்கு ஒத்திருக்கும். வரையறுக்கப்பட்ட பதிவு பார்வையாளர் (ரேடியோஃபார்மாசூட்டிகல் மதிப்பீட்டைப் பதிவு செய்வதற்கு பொறுப்பான அமைப்பு மற்றும்/அல்லது நபர், மற்றும் ரேடியோஃபார்மாசூட்டிகலை நிர்வகித்த நபர்) உள்ளது. ஒரு ஆய்வுக்கு பல ரேடியோஃபார்மாசூட்டிகல் கதிர்வீச்சு டோச் பொருள்கள் உருவாக்கப்படலாம். TID 10022 இல் ரேடியோஃபார்மாசூட்டிகல் ச்டார்ட் டைம் “ரேடியோஃபார்மாசூட்டிகல் நிர்வாக நிகழ்வு தரவு” நிர்வாகங்களின் வரிசையை தெரிவிக்கும்.

source: Scanning Length TID 10014
ta: ச்கேனிங் நீளம் 10014

source: No description
ta: விளக்கம் இல்லை

source: Container in TID 10013 to hold size specific dose estimation details
ta: அளவு குறிப்பிட்ட டோச் மதிப்பீட்டு விவரங்களை வைத்திருக்க 10013 இல் கொள்கலன்

source: Table to store patient size information
ta: நோயாளியின் அளவு தகவல்களை சேமிக்க அட்டவணை

source: Table to store skin dose map calculation settings
ta: தோல் டோச் வரைபடக் கணக்கீட்டு அமைப்புகளை சேமிக்க அட்டவணை

source: Table to hold the results from OpenSkin
ta: ஓபன்ச்கின் முடிவுகளை வைத்திருக்க அட்டவணை

source: Source of CT Dose Information
ta: CT டோச் தகவல்களின் சான்று

source: Table to store standard name mapping settings
ta: நிலையான பெயர் மேப்பிங் அமைப்புகளை சேமிக்க அட்டவணை

source: Table to store standard study description, requested procedure, procedure or acquisition names
ta: நிலையான ஆய்வு விளக்கம், கோரப்பட்ட செயல்முறை, செயல்முறை அல்லது கையகப்படுத்தல் பெயர்களை சேமிக்க அட்டவணை

source: Status and progress of populating the summary fields in GeneralStudyModuleAttr
ta: செனரல்ச்டுடிமோடூலீட்டில் சுருக்கம் புலங்களை விரிவுபடுத்துவதன் நிலை மற்றும் முன்னேற்றம்

source: Table to unique equipment name information
ta: தனித்துவமான உபகரணங்கள் பெயர் தகவலுக்கு அட்டவணை

source: Record upgrade status activity
ta: மேம்படுத்தல் நிலை செயல்பாட்டை பதிவு செய்யுங்கள்

source: Table to store user profile settings
ta: பயனர் சுயவிவர அமைப்புகளை சேமிக்க அட்டவணை

source: From TID 10013 Series or Instance used for Water Equivalent Diameter estimation
ta: TID 10013 தொடர் அல்லது நீர் சமமான விட்டம் மதிப்பீட்டிற்கு பயன்படுத்தப்படும் நிகழ்விலிருந்து

source: Container in TID 10003b. Code value 113771
ta: TID 10003B இல் கொள்கலன். குறியீடு மதிப்பு 113771

source: Content ID 10017 X-Ray Grid
ta: உள்ளடக்க ஐடி 10017 எக்ச்ரே கட்டம்

source: From DICOM Part 16
ta: டிகாம் பகுதி 16 இலிருந்து

source: In TID 10003b. Code value 113734 (mA)
ta: TID 10003B இல். குறியீடு மதிப்பு 113734 (எம்.ஏ)

source: Function to create or save fluoroscopy high dose alert recipient settings
ta: ஃப்ளோரோச்கோபி உயர் டோச் எச்சரிக்கை பெறுநர் அமைப்புகளை உருவாக்க அல்லது சேமிக்க செயல்பாடு

source: Method to limit the number of rows in the BackgroundTask table. This method is triggered by a post_save signal associated with the BackgroundTask table.
ta: பின்னணி டாச்க் அட்டவணையில் வரிசைகளின் எண்ணிக்கையை கட்டுப்படுத்தும் முறை. இந்த முறை பின்னணி டாச்க் அட்டவணையுடன் தொடர்புடைய POST_SAVE சமிக்ஞையால் தூண்டப்படுகிறது.

source: DICOM networking modules
ta: DICOM நெட்வொர்க்கிங் தொகுதிகள்

source: Query-retrieve module
ta: வினவல்-மறுசீரமைப்பு தொகுதி

source: Query function
ta: வினவல் செயல்பாடு

source: Query retrieve service class user function
ta: வினவல் பணி வகுப்பு பயனர் செயல்பாட்டை மீட்டெடுக்கவும்

source: Queries a pre-configured remote query retrieve service class provider for dose metric related objects, making use of the filter parameters provided. Can automatically trigger a c-move (retrieve) operation.
ta: வினவல்கள் ஒரு முன் கட்டமைக்கப்பட்ட தொலை வினவல் டோச் மெட்ரிக் தொடர்பான பொருள்களுக்கான பணி வகுப்பு வழங்குநரை மீட்டெடுக்கவும், வழங்கப்பட்ட வடிகட்டி அளவுருக்களைப் பயன்படுத்துகிறது. சி-மூவ் (மீட்டெடு) செயல்பாட்டை தானாகவே தூண்டலாம்.

source: Database ID/pk of the remote QR SCP (Default value = None)
ta: தொலைநிலை QR SCP இன் தரவுத்தள ஐடி/பி.கே (இயல்புநிலை மதிப்பு = எதுவுமில்லை)

source: Database ID/pk of the local store SCP (Default value = None)
ta: உள்ளக கடையின் தரவுத்தள ஐடி/பி.கே (இயல்புநிலை மதிப்பு = எதுவுமில்லை)

source: Prefer implicit transfer syntax (preference possibly not implemented) (Default value = False)
ta: மறைமுக பரிமாற்ற தொடரியல் (விருப்பம் செயல்படுத்தப்படவில்லை) (இயல்புநிலை மதிப்பு = பொய்)

source: Prefer explicit transfer syntax (preference possibly not implemented) (Default value = False)
ta: வெளிப்படையான பரிமாற்ற தொடரியல் (விருப்பம் செயல்படுத்தப்படவில்லை) (இயல்புநிலை மதிப்பு = பொய்)

source: Automatically trigger move request when query is complete (Default value = False)
ta: வினவல் முடிந்ததும் தானாகவே நகரும் கோரிக்கையைத் தூண்டும் (இயல்புநிலை மதிப்பு = பொய்)

source: UID of query if generated by web interface (Default value = None)
ta: வலை இடைமுகத்தால் உருவாக்கப்பட்டால் வினவலின் UID (இயல்புநிலை மதிப்பு = எதுவுமில்லை)

source: Date to search from, format yyyy-mm-dd (Default value = None)
ta: தேட வேண்டிய தேதி, YYYY-MM-DD ஐ வடிவமைத்தல் (இயல்புநிலை மதிப்பு = எதுவுமில்லை)

source: Date to search until, format yyyy-mm-dd (Default value = None)
ta: தேட வேண்டிய தேதி, YYYY-MM-DD (இயல்புநிலை மதிப்பு = எதுவுமில்லை)

source: search only on date_from, allows time_from/time_until (Default value = False)
ta: Date_from இல் மட்டும் தேடுங்கள், நேரம்_பிராம்/நேர_ஆண்டில் (இயல்புநிலை மதிப்பு = பொய்) அனுமதிக்கிறது

source: Time of day to search from, format hhmm 24 hour clock, single date only (Default value = None)
ta: தேடுவதற்கான நாள் நேரம், HHMM 24 மணிநேர கடிகாரத்தை வடிவமைக்கவும், ஒற்றை தேதி மட்டும் (இயல்புநிலை மதிப்பு = எதுவுமில்லை)

source: Time of day to search until, format hhmm 24 hour clock, single date only (Default value = None)
ta: தேடுவதற்கான நாள் நேரம், HHMM 24 மணிநேர கடிகாரத்தை வடிவமைக்கவும், ஒற்றை தேதி மட்டும் (இயல்புநிலை மதிப்பு = எதுவுமில்லை)

source: Modalities to search for, options are CT, MG, DX and FL (Default value = None)
ta: தேடுவதற்கான முறைகள், விருப்பங்கள் CT, Mg, DX மற்றும் FL (இயல்புநிலை மதிப்பு = எதுவுமில்லை)

source: Only include studies that only have structured reports in (unknown modality) (Default value = False)
ta: (அறியப்படாத முறை) (இயல்புநிலை மதிப்பு = பொய்) இல் கட்டமைக்கப்பட்ட அறிக்கைகளை மட்டுமே கொண்ட ஆய்வுகளை மட்டுமே சேர்க்கவும்

source: If True, studies that already exist in the database are removed from the query results (Default value = True)
ta: உண்மை என்றால், தரவுத்தளத்தில் ஏற்கனவே இருக்கும் ஆய்வுகள் வினவல் முடிவுகளிலிருந்து அகற்றப்படுகின்றன (இயல்புநிலை மதிப்பு = உண்மை)

source: lowercase include and exclude lists for StationName and StudyDescription (Default value = None)
ta: ச்டேசன் பெயர் மற்றும் ச்டடெச்டெச்கிரிப்சனுக்கான பட்டியல்களை சிறிய எழுத்துக்கள் உள்ளடக்கியது மற்றும் விலக்கு (இயல்புநிலை மதிப்பு = எதுவுமில்லை)

source: Whether to try to get Toshiba dose summary images
ta: தோசிபா டோச் சுருக்கம் படங்களைப் பெற முயற்சிக்கலாமா

source: Whether to get SR series that return nothing at image level
ta: பட மட்டத்தில் எதையும் திருப்பித் தரும் எச்ஆர் தொடர்களைப் பெறலாமா?

source: Series Instance UIDs are stored as rows in the database to be used by a move request. Move request is optionally triggered automatically.
ta: தொடர் நிகழ்வு UID கள் ஒரு நகர்வு கோரிக்கையால் பயன்படுத்த தரவுத்தளத்தில் வரிசைகளாக சேமிக்கப்படுகின்றன. நகரும் கோரிக்கை விருப்பமாக தானாகவே தூண்டப்படுகிறது.

source: Move function
ta: செயல்பாட்டை நகர்த்தவும்

source: C-Move request element of query-retrieve service class user :param query_id: ID of query in the DicomQuery table :return: None
ta: வினவல்-மறுதொடக்கம் பணி வகுப்பு பயனர்: பரம் வினவல்_ஐடி: டிகோம்குவரி அட்டவணையில் வினவலின் ஐடி: திரும்ப: திரும்ப: எதுவுமில்லை

source: openrem_qr.py script
ta: OpenRem_qr.py ச்கிரிப்ட்

source: NetDICOM common functions
ta: நெட் டிகாம் பொதுவான செயல்பாடுகள்
