Repository: 247i/TACETr
Catalog: உரை/தானி/openorienteering-mapper-*.po
Languages: ta

# OpenOrienteering::OcdFileExport
source: In line symbol "%1", cannot represent cap/join combination.
ta: வரி சின்னத்தில் "%1", தொப்பி/சேர கலவையை குறிக்க முடியாது.

# OpenOrienteering::OcdFileExport
source: In line symbol "%1", neglecting the dash grouping.
ta: வரி சின்னத்தில் "%1", கோடு குழுவை புறக்கணிக்கிறது.

# OpenOrienteering::OcdFileExport
source: In line symbol "%1", the number of dashes in a group has been reduced to 2.
ta: வரி சின்னத்தில் "%1", ஒரு குழுவில் உள்ள கோடுகளின் எண்ணிக்கை 2 ஆகக் குறைக்கப்பட்டுள்ளது.

# OpenOrienteering::OcdFileExport
source: In line symbol "%1", cannot export the borders correctly.
ta: வரி சின்னத்தில் "%1", எல்லைகளை சரியாக ஏற்றுமதி செய்ய முடியாது.

# OpenOrienteering::OcdFileExport
source: In text symbol %1: custom character spacing is set,its implementation does not match OCAD's behavior yet
ta: உரை சின்னத்தில் %1: தனிப்பயன் எழுத்து இடைவெளி அமைக்கப்பட்டுள்ளது, அதன் செயல்படுத்தல் OCAD இன் நடத்தைக்கு இன்னும் பொருந்தவில்லை

# OpenOrienteering::OcdFileExport
source: In text symbol %1: ignoring underlining
ta: உரை சின்னத்தில் %1: அடிக்கோடிட்டுக் காட்டுவதை புறக்கணித்தல்

# OpenOrienteering::OcdFileExport
source: In text symbol %1: ignoring kerning
ta: உரை சின்னத்தில் %1: கெர்னிங்கை புறக்கணித்தல்

# OpenOrienteering::OcdFileExport
source: In text symbol %1: exporting only %2 custom tabulator positions
ta: உரை சின்னத்தில் %1: %2 தனிப்பயன் டேபுலேட்டர் நிலைகளை மட்டுமே ஏற்றுமதி செய்கிறது

# OpenOrienteering::OcdFileExport
source: In combined symbol %1: Unsupported subsymbol at index %2.
ta: ஒருங்கிணைந்த சின்னத்தில் %1: குறியீட்டு %2 இல் ஆதரிக்கப்படாத துணை.

# OpenOrienteering::OcdFileExport
source: Unable to export fill pattern shift for an area object
ta: ஒரு பகுதி பொருளுக்கு நிரப்பு முறை மாற்றத்தை ஏற்றுமதி செய்ய முடியவில்லை

# OpenOrienteering::OcdFileExport
source: Unable to save correct position of missing template: "%1"
ta: காணாமல் போன வார்ப்புருவின் சரியான நிலையை சேமிக்க முடியவில்லை: "%1"

# OpenOrienteering::OcdFileExport
source: Unable to export template: file type of "%1" is not supported yet
ta: வார்ப்புருவை ஏற்றுமதி செய்ய முடியவில்லை: "%1" இன் கோப்பு வகை இன்னும் ஆதரிக்கப்படவில்லை

# OpenOrienteering::OcdFileExport
source: Cannot save custom positioning of template '%1'.
ta: '%1' வார்ப்புருவின் தனிப்பயன் நிலைப்பாட்டை சேமிக்க முடியாது.

# OpenOrienteering::OcdFileExport
source: Text truncated at '|'): %1
ta: உரை '|' இல் துண்டிக்கப்பட்டது): %1

# OpenOrienteering::OcdFileExport
source: Could not translate coordinate reference system '%1:%2'.
ta: ஒருங்கிணைப்பு குறிப்பு அமைப்பை '%1:%2' மொழிபெயர்க்க முடியவில்லை.

# OpenOrienteering::OcdFileImport
source: In line symbol %1 '%2': %3
ta: வரி சின்னத்தில் %1 ' %2': %3

# OpenOrienteering::OcdFileImport
source: In text symbol %1 '%2': %3
ta: உரை சின்னத்தில் %1 ' %2': %3

# OpenOrienteering::OcdFileImport
source: Could not load the coordinate reference system '%1'.
ta: ஒருங்கிணைப்பு குறிப்பு அமைப்பை '%1' ஏற்ற முடியவில்லை.

# OpenOrienteering::OcdFileImport
source: Unable to import symbol %1.%2 "%3": %4
ta: குறியீடை இறக்குமதி செய்ய முடியவில்லை %1. %2 " %3": %4

# OpenOrienteering::OcdFileImport
source: Unsupported type "%1".
ta: ஆதரிக்கப்படாத வகை "%1".

# OpenOrienteering::OcdFileImport
source: Unsupported line style '%1'.
ta: ஆதரிக்கப்படாத வரி பாணி '%1'.

# OpenOrienteering::OcdFileImport
source: The dash pattern cannot be imported correctly.
ta: கோடு வடிவத்தை சரியாக இறக்குமதி செய்ய முடியாது.

# OpenOrienteering::OcdFileImport
source: The dash pattern's end length (%1 mm) cannot be imported correctly. Using %2 mm.
ta: கோடு வடிவத்தின் இறுதி நீளம் (%1 மிமீ) சரியாக இறக்குமதி செய்ய முடியாது. %2 மிமீ பயன்படுத்துதல்.

# OpenOrienteering::OcdFileImport
source: The dash pattern's end gap (%1 mm) cannot be imported correctly. Using %2 mm.
ta: கோடு வடிவத்தின் இறுதி இடைவெளி (%1 மிமீ) சரியாக இறக்குமதி செய்ய முடியாது. %2 மிமீ பயன்படுத்துதல்.

# OpenOrienteering::OcdFileImport
source: Unsupported framing line style '%1'.
ta: ஆதரிக்கப்படாத ஃப்ரேமிங் லைன் பாணி ​​'%1'.

# OpenOrienteering::OcdFileImport
source: Skipped secondary point symbol.
ta: இரண்டாம் நிலை புள்ளி சின்னத்தைத் தவிர்த்தது.

# OpenOrienteering::OcdFileImport
source: Suppressing dash symbol at line ends.
ta: வரி முனைகளில் கோடு சின்னத்தை அடக்குதல்.

# OpenOrienteering::OcdFileImport
source: Justified alignment is not supported.
ta: நியாயமான சீரமைப்பு ஆதரிக்கப்படவில்லை.

# OpenOrienteering::OcdFileImport
source: Vertical alignment '%1' is not supported.
ta: செங்குத்து சீரமைப்பு '%1' ஆதரிக்கப்படவில்லை.

# OpenOrienteering::OcdFileImport
source: Ignoring custom weight (%1).
ta: தனிப்பயன் எடையை புறக்கணித்தல் (%1).

# OpenOrienteering::OcdFileImport
source: Custom character spacing may be incorrect.
ta: தனிப்பயன் எழுத்து இடைவெளி தவறாக இருக்கலாம்.

# OpenOrienteering::OcdFileImport
source: Ignoring custom word spacing (%1 %).
ta: தனிப்பயன் சொல் இடைவெளியை புறக்கணித்தல் ( %1 %).

# OpenOrienteering::OcdFileImport
source: Ignoring custom indents (%1/%2).
ta: தனிப்பயன் உள்தள்ளல்களைப் புறக்கணித்தல் (%1/%2).

# OpenOrienteering::OcdFileImport
source: Ignoring text framing (mode %1).
ta: உரை ஃப்ரேமிங் புறக்கணித்தல் (பயன்முறை %1).

# OpenOrienteering::OcdFileImport
source: Line text symbols are not yet supported. Marking the symbol as hidden.
ta: வரி உரை சின்னங்கள் இன்னும் ஆதரிக்கப்படவில்லை. குறியீட்டை மறைத்து வைத்திருக்கும்.

# OpenOrienteering::OcdFileImport
source: Encoding '%1' is not available. Check the settings.
ta: '%1' குறியாக்கம் கிடைக்கவில்லை. அமைப்புகளை சரிபார்க்கவும்.

# OpenOrienteering::OcdFileImport
source: In area symbol %1 '%2': %3
ta: பகுதி சின்னத்தில் %1 ' %2': %3

# OpenOrienteering::OcdFileImport
source: Color "%1" is imported as special color "Registration black".
ta: வண்ணம் "%1" சிறப்பு வண்ண "பதிவு கருப்பு" ஆக இறக்குமதி செய்யப்படுகிறது.

# OpenOrienteering::OcdFileImport
source: - main line
ta: - முதன்மையான வரி

# OpenOrienteering::OcdFileImport
source: - double line
ta: - இரட்டை வரி

# OpenOrienteering::OcdFileImport
source: - framing
ta: - ஃப்ரேமிங்

# OpenOrienteering::OcdFileImport
source: The border of this symbol could not be loaded.
ta: இந்த சின்னத்தின் எல்லையை ஏற்ற முடியவில்லை.

# OpenOrienteering::OcdFileImport
source: Skipping unsupported reference to point symbol '%1.%2'.
ta: புள்ளி சின்னத்திற்கு ஆதரிக்கப்படாத குறிப்பைத் தவிர்ப்பது '%1.%2'.

# OpenOrienteering::OcdFileImport
source: Unable to load object
ta: பொருளை ஏற்ற முடியவில்லை

# OpenOrienteering::OcdFileImport
source: Unable to import rectangle object
ta: செவ்வக பொருளை இறக்குமதி செய்ய முடியவில்லை

# OpenOrienteering::OcdFileImport
source: Not importing text symbol, couldn't figure out path' (npts=%1): %2
ta: உரை சின்னத்தை இறக்குமதி செய்யாமல், பாதையை கண்டுபிடிக்க முடியவில்லை '(npts = %1): %2

# OpenOrienteering::OcdFileImport
source: Trying to import a text object with unknown coordinate format
ta: அறியப்படாத ஒருங்கிணைப்பு வடிவத்துடன் உரை பொருளை இறக்குமதி செய்ய முயற்சிக்கிறது

# OpenOrienteering::OcdFileImport
source: Invalid data.
ta: தவறான தரவு.

# OpenOrienteering::OcdFileImport
source: Support for OCD version %1 files is experimental.
ta: ஒ.சி.டி பதிப்பு %1 கோப்புகளுக்கான உதவி சோதனை.

# OpenOrienteering::OcdFileImport
source: OCD files of version %1 are not supported!
ta: பதிப்பு %1 இன் ஒ.சி.டி கோப்புகள் ஆதரிக்கப்படவில்லை!

# OpenOrienteering::OcdFileImport
source: Color id not found: %1, ignoring this color
ta: வண்ண ஐடி காணப்படவில்லை: %1, இந்த நிறத்தை புறக்கணித்து

# OpenOrienteering::OgrFileExport
source: Failed to create dataset: %1
ta: தரவுத்தொகுப்பை உருவாக்குவதில் தோல்வி: %1

# OpenOrienteering::OgrFileExport
source: Failed to create layer: %2
ta: அடுக்கு உருவாக்கத் தவறிவிட்டது: %2

# OpenOrienteering::OgrFileExport
source: The map is not georeferenced. Local georeferencing only.
ta: வரைபடம் புவிசார் அல்ல. உள்ளக புவிசார்மயமாக்கல் மட்டுமே.

# OpenOrienteering::OgrFileExport
source: Failed to properly export the georeferencing info. Local georeferencing only.
ta: புவிசார் தகவல்களை சரியாக ஏற்றுமதி செய்வதில் தோல்வி. உள்ளக புவிசார்மயமாக்கல் மட்டுமே.

# OpenOrienteering::OgrFileExport
source: The %1 driver requires valid georefencing info.
ta: %1 இயக்கிக்கு செல்லுபடியாகும் உலகம் செய்தி தேவை.

# OpenOrienteering::OgrFileExport
source: Failed to create feature in layer: %1
ta: அடுக்கில் அம்சத்தை உருவாக்கத் தவறிவிட்டது: %1

# OpenOrienteering::OgrFileExport
source: Failed to create layer %1: %2
ta: அடுக்கு %1: %2 ஐ உருவாக்கத் தவறிவிட்டது

# OpenOrienteering::OgrFileExport
source: Failed to create name field: %1
ta: பெயர் புலத்தை உருவாக்குவதில் தோல்வி: %1

# OpenOrienteering::OgrFileImport
source: Unable to setup "%1" SRS for GDAL: %2
ta: GDAL க்கு " %1" SRS ஐ அமைக்க முடியவில்லை: %2

# OpenOrienteering::OgrFileImport
source: Point
ta: புள்ளியம்

# OpenOrienteering::OgrFileImport
source: Line
ta: வரி

# OpenOrienteering::OgrFileImport
source: Area
ta: பகுதி

# OpenOrienteering::OgrFileImport
source: Text
ta: உரை

# OpenOrienteering::OgrFileImport
source: Unable to load layer %1.
ta: அடுக்கு %1 ஐ ஏற்ற முடியவில்லை.

# OpenOrienteering::OgrFileImport
source: Unable to load %n objects, reason: %1
ta: %N பொருள்களை ஏற்ற முடியவில்லை, காரணம்: %1

# OpenOrienteering::OgrFileImport
source: Empty geometry.
ta: வெற்று வடிவியல்.

# OpenOrienteering::OgrFileImport
source: Can't determine the coordinate transformation: %1
ta: ஒருங்கிணைப்பு மாற்றத்தை தீர்மானிக்க முடியாது: %1

# OpenOrienteering::OgrFileImport
source: Failed to transform the coordinates.
ta: ஆயங்களை மாற்றுவதில் தோல்வி.

# OpenOrienteering::OgrFileImport
source: Unknown or unsupported geometry type.
ta: அறியப்படாத அல்லது ஆதரிக்கப்படாத வடிவியல் வகை.

# OpenOrienteering::OgrFileImport
source: Not enough coordinates.
ta: போதுமான ஒருங்கிணைப்புகள் இல்லை.

# OpenOrienteering::OgrFileImport
source: Cannot use this spatial reference: %1
ta: இந்த இடஞ்சார்ந்த குறிப்பைப் பயன்படுத்த முடியாது: %1

# OpenOrienteering::OgrFileImport
source: The geospatial data has no suitable spatial reference.
ta: புவியியல் தரவுகளுக்கு பொருத்தமான இடஞ்சார்ந்த குறிப்பு இல்லை.

# OpenOrienteering::OgrTemplate
source: Invalid template configuration.
ta: தவறான வார்ப்புரு உள்ளமைவு.

# OpenOrienteering::PaintOnTemplateFeature
source: Template file exists: '%1'
ta: வார்ப்புரு கோப்பு உள்ளது: '%1'

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Traditional
ta: பாரம்பரிய

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Confetti Hybrid
ta: கான்ஃபெட்டி கலப்பின

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Guacamole Full
ta: குவாக்காமோல் முழு

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Add color...
ta: வண்ணத்தைச் சேர்க்கவும் ...

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Remove
ta: அகற்று

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Move Up
ta: மேலே செல்லுங்கள்

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Move Down
ta: கீழே செல்லுங்கள்

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Available palette presets
ta: கிடைக்கும் தட்டு முன்னமைவுகள்

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Custom string
ta: தனிப்பயன் சரம்

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Activate preset
ta: முன்னமைவை செயல்படுத்தவும்

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Copy
ta: நகலெடு

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Paste
ta: ஒட்டு

# OpenOrienteering::PaintOnTemplateSettingsPage
source: Paint on template
ta: வார்ப்புருவில் வண்ணம் தீட்டவும்

# OpenOrienteering::PaintOnTemplateTool
source: <b>Click and drag</b>: Paint. <b>Right click and drag</b>: Erase.
ta: <b> சொடுக்கு செய்து இழுக்கவும் </b>: பெயிண்ட். <b> வலது சொடுக்கு செய்து இழுக்கவும் </b>: அழிக்கவும்.

# OpenOrienteering::PaintOnTemplateTool
source: Color selection
ta: வண்ண தேர்வு

# OpenOrienteering::PaintOnTemplateTool
source: Erase
ta: அழிக்கவும்

# OpenOrienteering::PaintOnTemplateTool
source: Filled area
ta: நிரப்பப்பட்ட பகுதி

# OpenOrienteering::PaintOnTemplateTool
source: Solid
ta: திடமான

# OpenOrienteering::PaintOnTemplateTool
source: Pattern
ta: முறை

# OpenOrienteering::PanTool
source: <b>Drag</b>: Move the map.
ta: <b> இழுத்து </b>: வரைபடத்தை நகர்த்தவும்.

# OpenOrienteering::PointSymbolEditorTool
source: <b>Click</b>: Add a coordinate. <b>%1+Click</b>: Change the selected coordinate.
ta: <b> சொடுக்கு </b>: ஒரு ஒருங்கிணைப்பைச் சேர்க்கவும். <b>%1+கிளிக் </b>: தேர்ந்தெடுக்கப்பட்ட ஒருங்கிணைப்பை மாற்றவும்.

# OpenOrienteering::PointSymbolEditorWidget
source: Always oriented to north (not rotatable)
ta: எப்போதும் வடக்கே நோக்குநிலை (சுழற்ற முடியாதது)

# OpenOrienteering::PointSymbolEditorWidget
source: Elements
ta: கூறுகள்

# OpenOrienteering::PointSymbolEditorWidget
source: Point
ta: புள்ளியம்

# OpenOrienteering::PointSymbolEditorWidget
source: Line
ta: வரி

# OpenOrienteering::PointSymbolEditorWidget
source: Area
ta: பகுதி

# OpenOrienteering::PointSymbolEditorWidget
source: Center all elements
ta: அனைத்து கூறுகளையும் நடுவண்

# OpenOrienteering::PointSymbolEditorWidget
source: Current element
ta: தற்போதைய உறுப்பு

# OpenOrienteering::PointSymbolEditorWidget
source: Diameter <b>a</b>:
ta: விட்டம் <b> அ </b>:

# OpenOrienteering::PointSymbolEditorWidget
source: mm
ta: மிமீ

# OpenOrienteering::PointSymbolEditorWidget
source: Inner color:
ta: உள் நிறம்:

# OpenOrienteering::PointSymbolEditorWidget
source: Outer width <b>b</b>:
ta: வெளிப்புற அகலம் <b> பி </b>:

# OpenOrienteering::PointSymbolEditorWidget
source: Outer color:
ta: வெளிப்புற நிறம்:

# OpenOrienteering::PointSymbolEditorWidget
source: Line width:
ta: வரி அகலம்:

# OpenOrienteering::PointSymbolEditorWidget
source: Line color:
ta: வரி நிறம்:

# OpenOrienteering::PointSymbolEditorWidget
source: Line cap:
ta: வரி தொப்பி:

# OpenOrienteering::PointSymbolEditorWidget
source: flat
ta: கிடைவளைவு

# OpenOrienteering::PointSymbolEditorWidget
source: round
ta: சுற்று

# OpenOrienteering::PointSymbolEditorWidget
source: square
ta: நாற்கை

# OpenOrienteering::PointSymbolEditorWidget
source: Line join:
ta: வரி சேர:

# OpenOrienteering::PointSymbolEditorWidget
source: miter
ta: மைட்டர்

# OpenOrienteering::PointSymbolEditorWidget
source: bevel
ta: பெவல்

# OpenOrienteering::PointSymbolEditorWidget
source: Line closed
ta: வரி மூடப்பட்டது

# OpenOrienteering::PointSymbolEditorWidget
source: Area color:
ta: பகுதி நிறம்:

# OpenOrienteering::PointSymbolEditorWidget
source: Coordinates:
ta: ஒருங்கிணைப்புகள்:

# OpenOrienteering::PointSymbolEditorWidget
source: X
ta: ஃச்

# OpenOrienteering::PointSymbolEditorWidget
source: Y
ta: ஒய்

# OpenOrienteering::PointSymbolEditorWidget
source: Curve start
ta: வளைவு தொடக்க

# OpenOrienteering::PointSymbolEditorWidget
source: Center by coordinate average
ta: ஒருங்கிணைப்பு சராசரியால் நடுவண்

# OpenOrienteering::PointSymbolEditorWidget
source: [Midpoint]
ta: [மிட்பாயிண்ட்]

# OpenOrienteering::PointSymbolEditorWidget
source: Unknown
ta: தெரியவில்லை

# OpenOrienteering::PointSymbolSettings
source: Point symbol
ta: புள்ளி அடையாளம்

# OpenOrienteering::PrintProgressDialog PrintWidget
source: Printing
ta: அச்சிடுதல்

# OpenOrienteering::PrintProgressDialog PrintWidget
source: An error occurred during processing.
ta: செயலாக்கத்தின் போது பிழை ஏற்பட்டது.

# OpenOrienteering::PrintTool
source: <b>Drag</b>: Move the map, the print area or the area's borders.
ta: <b> இழுத்து </b>: வரைபடம், அச்சு பகுதி அல்லது பகுதியின் எல்லைகளை நகர்த்தவும்.

# OpenOrienteering::PrintTool
source: <b>Drag</b>: Move the print area.
ta: <b> இழுத்து </b>: அச்சு பகுதியை நகர்த்தவும்.

# OpenOrienteering::PrintTool
source: <b>Drag</b>: Move the map.
ta: <b> இழுத்து </b>: வரைபடத்தை நகர்த்தவும்.

# OpenOrienteering::PrintTool
source: <b>Drag</b>: Move the print area's border.
ta: <b> இழுத்து </b>: அச்சுப் பகுதியின் எல்லையை நகர்த்தவும்.

# OpenOrienteering::PrintTool
source: <b>Drag</b>: Move the print area's borders.
ta: <b> இழுத்து </b>: அச்சுப் பகுதியின் எல்லைகளை நகர்த்தவும்.

# OpenOrienteering::PrintWidget
source: Show templates
ta: வார்ப்புருக்களைக் காட்டு

# OpenOrienteering::PrintWidget
source: Show grid
ta: கட்டத்தைக் காட்டு

# OpenOrienteering::PrintWidget
source: Page orientation:
ta: பக்க நோக்குநிலை:

# OpenOrienteering::PrintWidget
source: Printer:
ta: அச்சுப்பொறி:

# OpenOrienteering::PrintWidget
source: Portrait
ta: உருவப்படம்

# OpenOrienteering::PrintWidget
source: Landscape
ta: நிலப்பரப்பு

# OpenOrienteering::PrintWidget
source: Page format:
ta: பக்க வடிவம்:

# OpenOrienteering::PrintWidget
source: Copies:
ta: நகல்கள்:

# OpenOrienteering::PrintWidget
source: Left:
ta: இடது:

# OpenOrienteering::PrintWidget
source: Top:
ta: மேலே:

# OpenOrienteering::PrintWidget
source: Width:
ta: அகலம்:

# OpenOrienteering::PrintWidget
source: Height:
ta: உயரம்:

# OpenOrienteering::PrintWidget
source: Preview...
ta: முன்னோட்டம் ...

# OpenOrienteering::PrintWidget
source: Single page
ta: ஒற்றை பக்கம்

# OpenOrienteering::PrintWidget
source: Custom area
ta: தனிப்பயன் பகுதி

# OpenOrienteering::PrintWidget
source: Map area:
ta: வரைபட பகுதி:

# OpenOrienteering::PrintWidget
source: Center print area
ta: மைய அச்சு பகுதி

# OpenOrienteering::PrintWidget
source: mm
ta: மிமீ

# OpenOrienteering::PrintWidget
source: Properties
ta: பண்புகள்

# OpenOrienteering::PrintWidget
source: Page overlap:
ta: பக்கம் ஒன்றுடன் ஒன்று:

# OpenOrienteering::PrintWidget
source: Options
ta: விருப்பங்கள்

# OpenOrienteering::PrintWidget
source: Resolution:
ta: தீர்மானம்:

# OpenOrienteering::PrintWidget
source: Print in different scale:
ta: வெவ்வேறு அளவில் அச்சிடுக:

# OpenOrienteering::PrintWidget
source: Template appearance may differ.
ta: வார்ப்புரு தோற்றம் வேறுபடலாம்.

# OpenOrienteering::PrintWidget
source: Simulate overprinting
ta: அதிகப்படியான அச்சிடலை உருவகப்படுத்துங்கள்

# OpenOrienteering::PrintWidget
source: Save world file
ta: உலகக் கோப்பை சேமிக்கவும்

# OpenOrienteering::PrintWidget
source: Default
ta: இயல்புநிலை

# OpenOrienteering::PrintWidget
source: Device CMYK
ta: சாதனம் CMYK

# OpenOrienteering::PrintWidget
source: Color mode:
ta: வண்ண பயன்முறை:

# OpenOrienteering::PrintWidget
source: Print
ta: அச்சிடுக

# OpenOrienteering::PrintWidget
source: Export...
ta: ஏற்றுமதி ...

# OpenOrienteering::PrintWidget
source: PDF export
ta: PDF ஏற்றுமதி

# OpenOrienteering::PrintWidget
source: Image export
ta: பட ஏற்றுமதி

# OpenOrienteering::PrintWidget
source: Save to PDF
ta: PDF இல் சேமிக்கவும்

# OpenOrienteering::PrintWidget
source: dpi
ta: டிபிஐ

# OpenOrienteering::PrintWidget
source: No tiles
ta: ஓடுகள் இல்லை

# OpenOrienteering::PrintWidget
source: 256x256 pixel
ta: 256x256 படப்புள்ளி

# OpenOrienteering::PrintWidget
source: 512x512 pixel
ta: 512x512 படப்புள்ளி

# OpenOrienteering::PrintWidget
source: Tiles:
ta: ஓடுகள்:

# OpenOrienteering::PrintWidget
source: KMZ export
ta: KMZ ஏற்றுமதி

# OpenOrienteering::PrintWidget
source: The map contains transparent elements which require the raster mode.
ta: வரைபடத்தில் ராச்டர் பயன்முறை தேவைப்படும் வெளிப்படையான கூறுகள் உள்ளன.

# OpenOrienteering::PrintWidget
source: Not supported on Android.
ta: ஆண்ட்ராய்டு இல் ஆதரிக்கப்படவில்லை.

# OpenOrienteering::PrintWidget
source: Failed to prepare the preview.
ta: முன்னோட்டத்தைத் தயாரிக்கத் தவறிவிட்டது.

# OpenOrienteering::PrintWidget
source: Print Preview Progress
ta: முன்னோட்ட முன்னேற்றத்தை அச்சிடுக

# OpenOrienteering::PrintWidget
source: Warning
ta: எச்சரிக்கை

# OpenOrienteering::PrintWidget
source: A non-standard view mode is activated. Are you sure to print / export the map like this?
ta: தரமற்ற பார்வை முறை செயல்படுத்தப்படுகிறது. இதுபோன்ற வரைபடத்தை அச்சிட / ஏற்றுமதி செய்வது உறுதி?

# OpenOrienteering::PrintWidget
source: Failed to save the image: %1
ta: படத்தை சேமிப்பதில் தோல்வி: %1

# OpenOrienteering::PrintWidget
source: PNG
ta: பி.என்.சி.

# OpenOrienteering::PrintWidget
source: BMP
ta: பி.எம்.பி.

# OpenOrienteering::PrintWidget
source: TIFF
ta: டிஃப்

# OpenOrienteering::PrintWidget
source: Failed to prepare the PDF export.
ta: PDF ஏற்றுமதியைத் தயாரிக்கத் தவறிவிட்டது.

# OpenOrienteering::PrintWidget
source: PDF
ta: பி.டி.எஃப்

# OpenOrienteering::PrintWidget
source: An error occurred during printing.
ta: அச்சிடும் போது பிழை ஏற்பட்டது.

# OpenOrienteering::PrintWidget
source: Export map ...
ta: ஏற்றுமதி வரைபடம் ...

# OpenOrienteering::PrintWidget
source: All files (*.*)
ta: எல்லா கோப்புகளும் (*.*)

# OpenOrienteering::PrintWidget
source: Failed to prepare the printing.
ta: அச்சிடலைத் தயாரிக்கத் தவறிவிட்டது.

# OpenOrienteering::PrintWidget
source: Printing Progress
ta: முன்னேற்றம் அச்சிடும்

# OpenOrienteering::PrintWidget
source: Error
ta: பிழை

# OpenOrienteering::PrintWidget
source: Vector graphics
ta: திசையன் கிராபிக்ச்

# OpenOrienteering::PrintWidget
source: Raster graphics
ta: ராச்டர் கிராபிக்ச்

# OpenOrienteering::PrintWidget
source: Color separations
ta: நிறம் பிரிவினைகள்

# OpenOrienteering::PrintWidget
source: Mode:
ta: பயன்முறை:

# OpenOrienteering::PrintWidget
source: Failed to prepare the image. Not enough memory.
ta: படத்தைத் தயாரிக்கத் தவறிவிட்டது. போதுமான நினைவகம் இல்லை.

# OpenOrienteering::PrintWidget
source: Failed to save the image. Does the path exist? Do you have sufficient rights?
ta: படத்தை சேமிப்பதில் தோல்வி. பாதை இருக்கிறதா? உங்களுக்கு போதுமான உரிமைகள் உள்ளதா?

# OpenOrienteering::PrintWidget
source: Exported successfully to %1
ta: %1 க்கு வெற்றிகரமாக ஏற்றுமதி செய்யப்பட்டது

# OpenOrienteering::PrintWidget
source: Failed to finish the PDF export.
ta: PDF ஏற்றுமதியை முடிக்கத் தவறிவிட்டது.

# OpenOrienteering::PrintWidget
source: Canceled.
ta: ரத்து செய்யப்பட்டது.

# OpenOrienteering::PrintWidget
source: The print job could not be stopped.
ta: அச்சு வேலையை நிறுத்த முடியவில்லை.

# OpenOrienteering::PrintWidget
source: Successfully created print job
ta: அச்சு வேலை வெற்றிகரமாக உருவாக்கப்பட்டது

# OpenOrienteering::PrintWidget
source: The map area is empty. Output canceled.
ta: வரைபட பகுதி காலியாக உள்ளது. வெளியீடு ரத்து செய்யப்பட்டது.

# OpenOrienteering::ReopenTemplateDialog
source: Reopen template
ta: வார்ப்புருவை மீண்டும் திறக்கவும்

# OpenOrienteering::ReopenTemplateDialog
source: Drag items from the left list to the desired spot in the right list to reload them.
ta: உருப்படிகளை மீண்டும் ஏற்ற வலது பட்டியலில் இடது பட்டியலிலிருந்து விரும்பிய இடத்திற்கு இழுக்கவும்.

# OpenOrienteering::ReopenTemplateDialog
source: Closed templates:
ta: மூடிய வார்ப்புருக்கள்:

# OpenOrienteering::ReopenTemplateDialog
source: Clear list
ta: தெளிவான பட்டியல்

# OpenOrienteering::ReopenTemplateDialog
source: Active templates:
ta: செயலில் வார்ப்புருக்கள்:

# OpenOrienteering::ReopenTemplateDialog
source: - Map -
ta: - வரைபடம் -

# OpenOrienteering::RotateMapDialog
source: Rotate map
ta: வரைபடத்தை சுழற்றுங்கள்

# OpenOrienteering::RotateMapDialog
source: Angle (counter-clockwise):
ta: கோணம் (எதிர்-கடிகார திசையில்):

# OpenOrienteering::RotateMapDialog
source: Rotation parameters
ta: சுழற்சி அளவுருக்கள்

# OpenOrienteering::RotateMapDialog
source: Rotate around:
ta: சுற்றி சுழற்றுங்கள்:

# OpenOrienteering::RotateMapDialog
source: Map coordinate system origin
ta: வரைபட ஒருங்கிணைப்பு கணினி தோற்றம்

# OpenOrienteering::RotateMapDialog
source: Georeferencing reference point
ta: புவிசார் குறிப்பு புள்ளி

# OpenOrienteering::RotateMapDialog
source: Other point,
ta: மற்ற புள்ளி,

# OpenOrienteering::RotateMapDialog
source: Y:
ta: ஒய்:

# OpenOrienteering::RotateMapDialog
source: Options
ta: விருப்பங்கள்

# OpenOrienteering::RotateMapDialog
source: Adjust georeferencing reference point
ta: உலகம் பெரென்சிங் குறிப்பு புள்ளியை சரிசெய்யவும்

# OpenOrienteering::RotateMapDialog
source: Adjust georeferencing declination
ta: புவிசார் வீழ்ச்சியை சரிசெய்யவும்

# OpenOrienteering::RotateMapDialog
source: Rotate non-georeferenced templates
ta: உலகம் அல்லாத வார்ப்புருக்களை சுழற்றுங்கள்

# OpenOrienteering::RotatePatternTool
source: <b>Angle:</b> %1°
ta: <b> கோணம்: </b> %1 °

# OpenOrienteering::RotatePatternTool
source: <b>%1</b>: Fixed angles.
ta: <b>%1 </b>: நிலையான கோணங்கள்.
