Repository: 247i/TACETr
Catalog: உரை/தானி/open-infrastructure-map-web-frontend-*.po
Languages: ta

# edit.edit
source: Edit
ta: தொகு

# edit.remote
source: Edit with remote control (JOSM, etc)
ta: ரிமோட் கண்ட்ரோல் (சோச்ம், முதலியன) உடன் திருத்தவும்

# edit.browser
source: Edit in browser (iD)
ta: உலாவியில் திருத்து (ஐடி)

# edit.error
source: Unable to load remote editor - make sure it's running and has remote control enabled. Error:
ta: தொலை எடிட்டரை ஏற்ற முடியவில்லை - இது இயங்குகிறது மற்றும் ரிமோட் கண்ட்ரோல் இயக்கப்பட்டதா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். பிழை:

# names.power.transformer
source: Transformer
ta: மின்மாற்றி

# names.power.tower
source: Power tower
ta: ஆற்றல் கோபுரம்

# names.power.pole
source: Power pole
ta: ஆற்றல் கம்பம்

# names.power.generator
source: Generator
ta: மின்னியற்றி

# names.power.generator-solar
source: Solar generator
ta: சூரிய செனரேட்டர்

# names.power.wind-turbine
source: Wind turbine
ta: காற்று விசையாழி

# names.power.substation
source: Substation
ta: துணை மின்நிலையம்

# names.power.switch
source: Switch
ta: ஆளி, நிலைமாறி

# names.power.compensator
source: Compensator
ta: இழப்பீட்டி

# names.power.converter
source: DC converter substation
ta: டி.சி மாற்றி துணை மின்நிலையம்

# names.power.cable
source: Power cable
ta: மின் கேபிள்

# names.power.line
source: Power line
ta: ஆற்றல் வரி

# names.power.solar-panel
source: Solar panel
ta: சோலார் பேனல்

# names.power.plant
source: Power plant
ta: மின் நிலையம்

# names.power.hvdc
source: HVDC
ta: எச்.வி.டி.சி

# names.power.line-reference
source: Line reference
ta: வரி குறிப்பு

# names.power.solar-panel-node
source: Solar panel (node)
ta: சூரியக் குழு (முனை)

# names.power.other-generator
source: Other generator
ta: பிற செனரேட்டர்

# names.power.tower-pylon
source: Tower/Pylon
ta: கோபுரம்/பைலான்

# names.power.tower-transition
source: Transition tower
ta: மாற்றம் கோபுரம்

# names.power.pole-transition
source: Transition pole
ta: மாற்றம் கம்பம்

# names.power.transformer-3
source: Transformer (3 windings)
ta: மின்மாற்றி (3 முறுக்குகள்)

# names.power.switch-disconnector
source: Disconnector
ta: துண்டிப்பு

# names.power.switch-breaker
source: Circuit breaker
ta: (சுற்றமைப்புப்) பிரிகலன்

# names.power.switch-other
source: Other switch
ta: மற்ற சுவிட்ச்

# names.power.reactor-series
source: Series reactor
ta: தொடர் உலை

# names.power.reactor-shunt
source: Shunt reactor
ta: சன்ட் உலை

# names.power.capacitor-series
source: Series capacitor
ta: தொடர் மின்தேக்கி

# names.power.capacitor-shunt
source: Shunt capacitor
ta: சன்ட் மின்தேக்கி

# names.power.statcom
source: Static VAR compensator
ta: நிலையான வர் ஈடுசெய்யும்

# names.power.synchronous-condenser
source: Synchronous condenser
ta: ஒத்திசைவான மின்தேக்கி

# names.power.filter
source: Filter
ta: வடிப்பி

# names.power.compensator-other
source: Other compensator
ta: மற்ற ஈடுசெய்யும்

# names.power.current-transformer
source: Current transformer
ta: தற்போதைய மின்மாற்றி

# names.power.potential-transformer
source: Potential transformer
ta: சாத்தியமான மின்மாற்றி

# names.telecoms.communication-line
source: Telecoms line
ta: தொலைத் தொடர்பு வரி

# names.telecoms.data-center
source: Telecoms building
ta: தொலைத் தொடர்பு கட்டிடம்

# names.telecoms.exchange
source: Telephone exchange
ta: தொலைபேசி பரிமாற்றம்

# names.telecoms.cabinet
source: Telecoms cabinet
ta: தொலைத் தொடர்பு அமைச்சரவை

# names.pipeline
source: Pipeline
ta: குழாய்

# names.petroleum.well
source: Well
ta: நன்றாக

# names.petroleum.facility
source: Petroleum facility
ta: பெட்ரோலிய வசதி

# names.gas.pipeline.transmission
source: Transmission
ta: பரவும் முறை

# names.gas.pipeline.distribution
source: Distribution
ta: பரவல்

# names.gas.pipeline.pressure.high
source: High Pressure
ta: உயர் அழுத்தம்

# names.gas.pipeline.pressure.intermediate
source: Intermediate Pressure
ta: இடைநிலை அழுத்தம்

# names.gas.pipeline.pressure.low
source: Low Pressure
ta: குறைந்த அழுத்தம்

# names.water.pipeline
source: Water pipeline
ta: நீர் குழாய்

# names.water.sewage-treatment-plant
source: Sewage treatment plant
ta: கழிவுநீர் சுத்திகரிப்பு நிலையம்

# names.water.treatment-plant
source: Water treatment plant
ta: நீர் சுத்திகரிப்பு ஆலை

# names.water.pumping-station
source: Pumping station
ta: உந்தி நிலையம்

# names.water.well
source: Water well
ta: நீர் கிணறு

# names.water.reservoir
source: Water reservoir
ta: நீர் நீர்த்தேக்கம்

# names.water.water-pumping-station
source: Water pumping station
ta: நீர் உந்தி நிலையம்

# names.water.sewage-pumping-station
source: Sewage pumping station
ta: கழிவுநீர் உந்தி நிலையம்

# names.cable
source: Cable
ta: வடம்

# names.telecom.tower-mast
source: Tower/Mast
ta: கோபுரம்/மாச்ட்

# names.telecom.datacenter
source: Datacenter
ta: டேட்டாசென்டர்

# names.cabinet
source: Cabinet
ta: அமைச்சரவை

# names.substance.oil
source: Oil
ta: எண்ணெய்

# names.substance.gas
source: Gas
ta: வளிமம்

# names.substance.petroleum-intermediate
source: Petroleum intermediate
ta: பெட்ரோலிய இடைநிலை

# names.substance.fuel
source: Fuel
ta: எரிபொருள்

# names.substance.hydrogen
source: Hydrogen
ta: நீரகம்

# names.substance.nitrogen
source: Nitrogen
ta: தழைச்சத்து

# names.substance.oxygen
source: Oxygen
ta: உயிரகம், உயிர்வளி

# names.substance.beer
source: Beer
ta: பீர்

# names.substance.co2
source: CO<sub>2</sub>
ta: சிஒ<sub>2</sub>

# names.substance.fresh-water
source: Fresh water
ta: புதிய நீர்

# names.substance.hot-water
source: Hot water
ta: சூடான நீர்

# names.substance.steam
source: Steam
ta: நீராவி

# names.substance.wastewater
source: Wastewater
ta: கழிவு நீர்

# names.substance.rainwater
source: Rainwater
ta: மழைநீர்

# names.method.fission
source: Fission
ta: பிளவு

# names.method.fusion
source: Fusion
ta: இணைவு

# names.method.wind-turbine
source: Wind turbine
ta: காற்று விசையாழி

# names.method.water-storage
source: Water storage
ta: நீர் சேமிப்பு

# names.method.water-pumped-storage
source: Pumped storage
ta: பம்ப் செய்யப்பட்ட சேமிப்பு

# names.method.water-run-of-river
source: Run-of-river
ta: ரன்-ஆஃப்-ரிவர்

# names.method.tidal-barrage
source: Barrage
ta: சரமாரியாக

# names.method.tidal-stream
source: Stream
ta: ச்ட்ரீம்

# names.method.solar-thermal
source: Thermal
ta: வெப்ப

# names.method.solar-photovoltaic
source: Photovoltaic
ta: ஒளிமின்னழுத்த

# names.method.combustion
source: Combustion
ta: எரிப்பு

# names.method.gasification
source: Gasification
ta: வாயுவாக்கம்

# names.method.anaerobic-digestion
source: Anaerobic digestion
ta: காற்றில்லா செரிமானம்

# names.other-pumping-station
source: Other pumping station
ta: பிற உந்தி நிலையம்

# names.place
source: Place
ta: இடம்

# info.name
source: Name
ta: பெயர்

# info.operator
source: Operator
ta: ஆபரேட்டர்

# info.output
source: Power
ta: ஆற்றல்

# info.source
source: Source
ta: மூலம்

# info.start-date
source: Start date
ta: தொடக்க தேதி

# info.generation-method
source: Generation method
ta: தலைமுறை முறை

# info.substation-type
source: Substation type
ta: துணை மின் வகை

# info.reference
source: Reference
ta: குறிப்பு

# info.circuits
source: Circuits
ta: சுற்றுகள்

# info.type
source: Type
ta: வகை

# info.website
source: Website
ta: வலைத்தளம்

# info.view-openstreetmap
source: View on OpenStreetMap
ta: OpenStreetMap இல் காண்க

# info.substance
source: Substance
ta: பொருள்

# info.usage
source: Usage
ta: பயன்பாடு

# info.location
source: Location
ta: இடம்

# info.design
source: Design
ta: வடிவமைப்பு

# info.material
source: Material
ta: பொருள்

# info.line-attachment
source: Line attachment
ta: வரி இணைப்பு

# info.line-management
source: Line management
ta: வரி மேலாண்மை

# info.transformer-type
source: Transformer type
ta: மின்மாற்றி வகை

# nav.about
source: about
ta: பற்றி

# nav.stats
source: stats
ta: புள்ளிவிவரங்கள்

# nav.exports
source: exports
ta: ஏற்றுமதி

# units.kV
source: kV
ta: கே.வி.

# units.MW
source: MW
ta: மெகாவாட்

# units.DC
source: DC
ta: நேர்மின்னழுத்தம்

# units.below_10kv
source: < 10 kV
ta: <10 கிவோ

# units.kW
source: kW
ta: கிலோவாட்

source: More info
ta: மேலும் செய்தி

source: Wikipedia
ta: விக்கிபீடியா

source: Wikimedia Commons
ta: விக்கிமீடியா காமன்ச்

source: Wikidata
ta: விக்கிடிட்

# key.name
source: Key
ta: விசை

# key.power-lines
source: Power Lines
ta: மின் இணைப்புகள்

# key.power-plants
source: Power Plants
ta: மின் விளைவாக்கம் நிலையங்கள்

# key.power-generators
source: Power Generators
ta: ஆற்றல் செனரேட்டர்கள்

# key.power-line-supports
source: Power Line Supports
ta: மின் வரி ஆதரிக்கிறது

# key.switchgear
source: Switchgear
ta: சுவிட்ச் கியர்

# key.telecoms
source: Telecoms
ta: தொலைத் தொடர்பு

# key.gas
source: Gas
ta: வளிமம்

# key.petroleum
source: Petroleum
ta: பாறையெண்ணை, பாறைநெய்

# key.water
source: Water
ta: நீர்

# key.traction
source: Traction (< 50 Hz)
ta: இழுவை (<50 எர்ட்ச்)

# location.underground
source: Underground
ta: நிலத்தடி

# location.underwater
source: Underwater
ta: நீருக்கடியில்

# location.overhead
source: Overhead
ta: மேற்செலவு

# location.roof
source: Roof
ta: கூரை

# location.surface
source: Surface
ta: மேற்பரப்பு

# location.outdoor
source: Outdoor
ta: வெளிப்புறம்

# location.indoor
source: Indoor
ta: உட்புறம்

# power.source.coal
source: Coal
ta: நிலக்கரி

# power.source.geothermal
source: Geothermal
ta: உலகம் வெப்பம்

# power.source.hydro
source: Hydroelectric
ta: நீர் மின்

# power.source.nuclear
source: Nuclear
ta: அணு

# power.source.oil-gas
source: Oil/Gas
ta: எண்ணெய்/எரிவாயு

# power.source.gas
source: Gas
ta: வளிமம்

# power.source.solar
source: Solar
ta: சூரிய

# power.source.wind
source: Wind
ta: காற்று

# power.source.biomass
source: Biomass
ta: உயிரி

# power.source.waste
source: Waste
ta: கழிவு

# power.source.battery
source: Battery
ta: மின்கலம்

# power.substation-type.transmission
source: Transmission
ta: பரவும் முறை

# power.substation-type.distribution
source: Distribution
ta: பரவல்

# power.substation-type.traction
source: Traction
ta: இழுவை

# power.substation-type.converter
source: DC Converter
ta: டி.சி மாற்றி

source: Other
ta: மற்றொன்று

source: Warning
ta: எச்சரிக்கை

# warnings.webgl
source: <p>Your browser may have performance or functionality issues with Open Infrastructure Map.</p><p><a href="http://webglreport.com">WebGL</a> with hardware acceleration is required for this site to perform well.</p><p>If your browser supports WebGL, you may need to disable browser fingerprinting protection for this site.</p>
ta: <p> உங்கள் உலாவியில் திறந்த உள்கட்டமைப்பு வரைபடத்துடன் செயல்திறன் அல்லது செயல்பாட்டு சிக்கல்கள் இருக்கலாம். சிறப்பாக செயல்பட.</p>

# layers.background
source: Background
ta: பின்னணி

# layers.heatmaps
source: Heatmaps
ta: வெப்ப வரைபடங்கள்

# layers.overlays
source: Overlays
ta: மேலடுக்குகள்

# layers.infrastructure
source: Infrastructure
ta: உள்கட்டமைப்பு

# layers.validation
source: Validation
ta: சரிபார்ப்பு

# layers.nighttime-lights
source: Nighttime Lights
ta: இரவு நேர விளக்குகள்

# layers.power
source: Power
ta: ஆற்றல்

# layers.solar-generation
source: Solar Generation
ta: சூரிய தலைமுறை

# layers.telecoms
source: Telecoms
ta: தொலைத் தொடர்பு

# layers.petroleum
source: Oil & Natural Gas
ta: எண்ணெய் & இயற்கை எரிவாயு

# layers.water
source: Water
ta: நீர்

# layers.borders
source: Borders
ta: எல்லைகள்

# layers.labels
source: Labels
ta: சிட்டைகள்

# layers.title
source: Layers
ta: அடுக்குகள்

# layers.other-pipelines
source: Other Pipelines
ta: பிற குழாய்கள்

# layers.osmose-power
source: Osmose (Power)
ta: ஆச்மோச் (சக்தி)

# construction
source: under construction
ta: கட்டுமானத்தின் கீழ்

source: disused
ta: பயன்படுத்தப்பட்டது

source: Coordinates
ta: ஒருங்கிணைப்புகள்

# search.clear
source: Clear search
ta: தேடலை அழி

# search.no-results
source: No results found
ta: முடிவுகள் எதுவும் கிடைக்கவில்லை

source: OpenStreetMap
ta: ஓபன்ச்ட்ரீட் வரைபடம்
