Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: Double click on ``FastCGI Settings``
ta: `` Fastcgi அமைப்புகள்`` இல் இருமுறை சொடுக்கு செய்க

source: In the ``Actions`` pane on the right, click ``Add Application``
ta: வலதுபுறத்தில் உள்ள `` செயல்கள்`` பலகத்தில், `` பயன்பாட்டைச் சேர்`` என்பதைக் சொடுக்கு செய்க

source: In the ``Full Path:`` box type or browse to ``E:\venv\Scripts\python.exe``
ta: `` முழு பாதையில்: `` பெட்டி வகை அல்லது உலாவுக

source: In the ``Arguments`` box type the path to wfastcgi.py: ``E:\venv\Lib\site-packages\wfastcgi.py``
ta: `` வாதங்கள்`` பெட்டியில் wfastcgi.py க்கான பாதையைத் தட்டச்சு செய்க: `` e: \ vev \ லிப் \ தள-பேக்கேச்கள் \ wfastcgi.py``

source: Under FastCGI properties, click on ``(Collection)`` next to ``Environment Variables`` and click on the grey ``…`` box
ta: FastCGI பண்புகளின் கீழ், `` (சேகரிப்பு) `` `` சுற்றுச்சூழல் மாறிகள்`` க்கு அடுத்ததாக சொடுக்கு செய்து சாம்பல் ``… `` பெட்டியைக் சொடுக்கு செய்க

source: In the EnvironmentVariables Collection Editor click ``Add``
ta: சுற்றுச்சூழல்கள் சேகரிப்பு எடிட்டரில் `` சேர்`` என்பதைக் சொடுக்கு செய்க

source: Change the value of ``Name`` to ``DJANGO_SETTINGS_MODULE`` (must be upper-case)
ta: `` பெயர்`` இன் மதிப்பை `` jango_settings_module`` க்கு மாற்றவும் (மேல்-வழக்கமாக இருக்க வேண்டும்)

source: Set the ``Value`` to ``openremproject.settings``
ta: `` மதிப்பு`` ஐ `` OpenRemproject.settings`` க்கு அமைக்கவும்

source: Click ``Add`` again and add the variable name ``PYTHONPATH`` with the value ``E:\venv\Lib\site-packages\openrem``
ta: `` `மீண்டும் ஒன்றைச் சேர் என்பதைக் சொடுக்கு செய்து,` `e: \ vev \ லிப் \ தள-தொகுப்புகள் \ openrem`` மதிப்புடன்` `பைதன்பாத்`` மாறி பெயரைச் சேர்க்கவும்

source: Click ``Add`` again and add the variable name ``WSGI_HANDLER`` with the value ``django.core.wsgi.get_wsgi_application()``
ta: `` `மீண்டும் ஒன்றைச் சேர் என்பதைக் சொடுக்கு செய்து,` `django.core.wsgi.get_wsgi_application ()` `மதிப்புடன்` `wsgi_handler`` ஆகியவற்றைச் சேர்க்கவும்

source: Click ``OK``
ta: `` சரி`` என்பதைக் சொடுக்கு செய்க

source: Environment Variables Collection
ta: சுற்றுச்சூழல் மாறிகள் சேகரிப்பு

source: Figure 7: Environment Variables Collection Editor
ta: படம் 7: சுற்றுச்சூழல் மாறிகள் சேகரிப்பு எடிட்டர்

source: Under FastCGI Properties -> Process Model click on the ``Activity Timeout`` value and change it to ``1200``
ta: FastCGI பண்புகளின் கீழ் -> செயல்முறை மாதிரி `` செயல்பாட்டு நேரம் முடிந்தது`` மதிப்பைக் சொடுக்கு செய்து `` 1200`` ஆக மாற்றவும்

source: Activity Timeout on slow running systems
ta: மெதுவாக இயங்கும் அமைப்புகளில் செயல்பாட்டு நேரம் முடிந்தது

source: If you encounter issues with long-running requests failing on slow running systems, you might try increasing the value of the ``Activity Timeout`` further.
ta: மெதுவாக இயங்கும் அமைப்புகளில் நீண்டகால கோரிக்கைகள் தோல்வியுற்றால் சிக்கல்களை நீங்கள் சந்தித்தால், `` செயல்பாட்டு நேரம் முடிந்தது`` இன் மதிப்பை மேலும் அதிகரிக்க முயற்சி செய்யலாம்.

source: Add FastCGI Application settings
ta: FastCGI பயன்பாட்டு அமைப்புகளைச் சேர்க்கவும்

source: Figure 8: Add FastCGI Application settings
ta: படம் 8: FASTCGI பயன்பாட்டு அமைப்புகளைச் சேர்க்கவும்

source: Click ``OK`` to close the dialogue box
ta: உரையாடல் பெட்டியை மூட `` சரி`` என்பதைக் சொடுக்கு செய்க

source: Create a new website
ta: புதிய வலைத்தளத்தை உருவாக்கவும்

source: In the ``Connections`` pane expand the tree under server name
ta: `` இணைப்புகள்`` பலகத்தில் சேவையக பெயரின் கீழ் மரத்தை விரிவாக்குங்கள்

source: Expand the Sites folder, right click on ``Default Website`` and click ``Remove``
ta: தளங்கள் கோப்புறையை விரிவுபடுத்தி, `` இயல்புநிலை வலைத்தளம்`` இல் வலது சொடுக்கு செய்து `` அகற்று`` என்பதைக் சொடுக்கு செய்க

source: Click ``Yes``
ta: `` ஆம்`` என்பதைக் சொடுக்கு செய்க

source: Right click on ``Sites`` and click ``Add Website…``
ta: `` தளங்கள்`` இல் வலது சொடுக்கு செய்து `` வலைத்தளத்தைச் சேர்… `` என்பதைக் சொடுக்கு செய்க

source: Enter Site name as ``OpenREM``
ta: தளத்தின் பெயரை `` OpenRem`` ஆக உள்ளிடவும்

source: Under Content Directory Physical path enter or browse to ``E:\venv\Lib\site-packages\openrem``
ta: உள்ளடக்க அடைவின் கீழ் இயற்பியல் பாதையின் கீழ் `` e: \ vev \ லிப் \ தள-பேக்கேச்கள் \ OpenRem``

source: Configure the new website
ta: புதிய வலைத்தளத்தை உள்ளமைக்கவும்

source: Click on the ``OpenREM`` site under ``Connections`` in the left pane
ta: இடது பலகத்தில் `` இணைப்புகள்` இன் கீழ் `` OpenRem`` தளத்தைக் சொடுக்கு செய்க

source: Double click on ``Handler Mappings``
ta: `` ஏண்ட்லர் மேப்பிங்ச்`` இல் இருமுறை சொடுக்கு செய்க

source: In the right pane, under ``Actions`` click ``Add Module Mapping…``
ta: வலது பலகத்தில், `` செயல்கள்` இன் கீழ் `` தொகுதி மேப்பிங்கைச் சேர்க்கவும்… `` என்பதைக் சொடுக்கு செய்க

source: In the ``Request Path`` box enter an asterix (``*``)
ta: `` கோரிக்கை பாதையில்` பெட்டியில் ஒரு ஆச்டெரிக்சை உள்ளிடவும் (``*``)

source: In the Module box select ``FastCgiModule`` (*not the CgiModule*)
ta: தொகுதி பெட்டியில் `` fastcgimodule`` ஐத் தேர்ந்தெடுக்கவும் (*cgimodule*)

source: In the ``Executable`` box enter ``E:\venv\Scripts\python.exe|E:\venv\Lib\site-packages\wfastcgi.py``
ta: `` இயங்கக்கூடிய`` பெட்டியில் `` e: \ vev \ ச்கிரிப்டுகள் \ python.exe | e: \ vev \ லிப் \ தள-தொகுப்புகள் \ wfastcgi.py``

source: In ``Name`` type ``OpenREM CGI handler`` (value of name is not important)
ta: `` பெயர்`` வகை `` ஓபன்ரெம் சிசிஐ ஏண்ட்லர்`` (பெயரின் மதிப்பு முக்கியமல்ல)

source: Click ``Request Restrictions`` and untick the ``Invoke handler only if request is mapped to:`` checkbox
ta: `` கோரிக்கை கட்டுப்பாடுகள்` என்பதைக் சொடுக்கு செய்து, கோரிக்கை வரைபடமாக்கப்பட்டால் மட்டுமே `` ஐக் கையாளுங்கள்: `` தேர்வுப்பெட்டி

source: Click ``OK`` twice to close the Request Restrictions dialog and the Add Module Mapping dialogue
ta: கோரிக்கை கட்டுப்பாடுகள் உரையாடல் மற்றும் தொகுதி மேப்பிங் உரையாடலை மூடுவதற்கு `` சரி`` இரண்டு முறை சொடுக்கு செய்க

source: When prompted ``Do you want to create a FastCGI application for this executable?`` click ``No``
ta: கேட்கும்போது `` இந்த இயங்கக்கூடிய ஒரு ஃபாச்ட் சிசி பயன்பாட்டை உருவாக்க விரும்புகிறீர்களா? `` என்பதைக் சொடுக்கு செய்க `இல்லை``

source: Quick test!
ta: விரைவான சோதனை!

source: You can now browse on the server to http://localhost/ and you should see an "ugly" version of the website. It will look better after we have configured the static files, next!
ta: நீங்கள் இப்போது சேவையகத்தில் http: // localhost/க்கு உலாவலாம், மேலும் வலைத்தளத்தின் "அசிங்கமான" பதிப்பைக் காண வேண்டும். நிலையான கோப்புகளை நாங்கள் கட்டமைத்த பிறகு இது நன்றாக இருக்கும், அடுத்தது!

source: Configure IIS to server the static files
ta: நிலையான கோப்புகளை சேவையகத்தில் IIS ஐ உள்ளமைக்கவும்

source: Right click on the ``OpenREM`` site under ``Connections`` in the left pane
ta: இடது பலகத்தில் `` இணைப்புகள்`` இன் கீழ் `` OpenRem`` தளத்தை வலது சொடுக்கு செய்யவும்

source: Click ``Add Virtual Directory``
ta: `` மெய்நிகர் கோப்பகத்தைச் சேர்க்கவும்` என்பதைக் சொடுக்கு செய்க

source: Enter ``static`` as the Alias
ta: மாற்றுப்பெயராக `` நிலையான`` உள்ளிடவும்

source: Enter or browse to ``E:\static`` as the Physical path
ta: இயற்பியல் பாதையாக `` e: \ static`` க்கு உள்ளிடவும் அல்லது உலாவவும்

source: Double click on ``Handler Mappings`` in the middle pane
ta: நடுத்தர பலகத்தில் `` ஏண்ட்லர் மேப்பிங்ச்`` இல் இருமுறை சொடுக்கு செய்க

source: Click on ``View Ordered List...`` in the right pane
ta: `` ஆர்டர் செய்யப்பட்ட பட்டியலைக் காண்க ... `` சரியான பலகத்தில்

source: Select ``StaticFile``
ta: `` Staticfile`` என்பதைத் தேர்ந்தெடுக்கவும்

source: Click ``Move Up`` in the ``Action`` pane on the right until ``StaticFile`` is at the top
ta: `` Staticfile`` மேலே இருக்கும் வரை `` அதிரடி`` பலகத்தில் `` மேலே நகர்த்தவும்` என்பதைக் சொடுக்கு செய்க

source: There will be a warning about the list order being changed - click ``Yes`` to continue
ta: பட்டியல் ஆர்டர் மாற்றப்படுவது குறித்து ஒரு எச்சரிக்கை இருக்கும் - தொடர `` ஆம்`` என்பதைக் சொடுக்கு செய்க

source: Browse to http://localhost/ on the server, or browse to the servername in a browser on another machine, and you should be able to see the new OpenREM web service.
ta: சேவையகத்தில் http: // localhost/க்கு உலாவவும், அல்லது மற்றொரு கணினியில் உலாவியில் சேவையகத்திற்கு உலாவவும், மேலும் புதிய OpenRem வலை சேவையை நீங்கள் காண முடியும்.

source: Task queue
ta: பணி வரிசை

source: Running OpenREM on Windows 10 or Windows 11?
ta: சாளரங்கள் 10 அல்லது சாளரங்கள் 11 இல் ஓபன்ரெம் இயங்குகிறீர்களா?

source: For non-server environments, where task executors don't need to be persistent across system restarts, there is a shortcut for starting workers. You can start a single worker in a new console as follows:
ta: கணினி மறுதொடக்கங்கள் முழுவதும் பணி நிறைவேற்றுபவர்கள் தொடர்ந்து இருக்க வேண்டிய அவசியமில்லை, சேவையக அல்லாத சூழல்களுக்கு, தொழிலாளர்களைத் தொடங்குவதற்கான குறுக்குவழி உள்ளது. நீங்கள் ஒரு புதிய கன்சோலில் ஒரு தொழிலாளியைத் தொடங்கலாம்:

source: If you want more than one worker to run tasks in parallel, you will need to repeat the previous steps for each additional worker in a new console.
ta: ஒன்றுக்கு மேற்பட்ட தொழிலாளர்கள் இணையாக பணிகளை இயக்க விரும்பினால், ஒவ்வொரு கூடுதல் தொழிலாளிக்கும் முந்தைய படிகளை புதிய கன்சோலில் மீண்டும் செய்ய வேண்டும்.

source: You can stop a worker by pressing ``Ctrl`` + ``C`` in the appropriate console
ta: பொருத்தமான கன்சோலில் `` ctrl`` + `c`` ஐ அழுத்துவதன் மூலம் நீங்கள் ஒரு தொழிலாளியை நிறுத்தலாம்

source: If you cannot start a worker or you are getting error messages, please make sure that your current user has read and write permissions in the ``E:\task_queue`` directory.
ta: நீங்கள் ஒரு தொழிலாளியைத் தொடங்க முடியாவிட்டால் அல்லது பிழை செய்திகளைப் பெறுகிறீர்கள் என்றால், உங்கள் தற்போதைய பயனர் `` e: \ task_queue`` கோப்பகத்தில் அனுமதிகளைப் படித்து எழுதியுள்ளார் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: OpenREM uses a task queue to run its background tasks. Therefore, we need additional Windows services that allow us to run these tasks separately from the web application.
ta: ஓபன்ரெம் அதன் பின்னணி பணிகளை இயக்க ஒரு பணி வரிசையைப் பயன்படுத்துகிறது. எனவே, வலை பயன்பாட்டிலிருந்து தனித்தனியாக இந்த பணிகளை இயக்க அனுமதிக்கும் கூடுதல் சாளரங்கள் சேவைகள் எங்களுக்குத் தேவை.

source: To accomplish that we need to do the following:
ta: நாம் பின்வருவனவற்றைச் செய்ய வேண்டும் என்பதை நிறைவேற்ற:

source: Create local service account
ta: உள்ளக பணி கணக்கை உருவாக்கவும்

source: First we need to create an account that will allow the IIS worker to control the task workers. Most importantly, to kill a task if necessary.
ta: முதலில் நாம் ஒரு கணக்கை உருவாக்க வேண்டும், இது ஐ.ஐ.எச் தொழிலாளி பணித் தொழிலாளர்களைக் கட்டுப்படுத்த அனுமதிக்கும். மிக முக்கியமாக, தேவைப்பட்டால் ஒரு பணியைக் கொல்ல.

source: There is a difference if you are connected to an Active Directory or not. Whatever suits your setup, follow the guide ``A`` if you are not in an Active Directory or ``B`` if you are.
ta: நீங்கள் செயலில் உள்ள கோப்பகத்துடன் இணைக்கப்பட்டிருந்தால் வேறுபாடு உள்ளது. உங்கள் அமைப்பிற்கு எது பொருத்தமானது என்றாலும், நீங்கள் செயலில் உள்ள கோப்பகத்தில் இல்லாவிட்டால் அல்லது நீங்கள் இருந்தால் `` b`` வழிகாட்டியைப் பின்பற்றுங்கள்.

source: Guide A
ta: வழிகாட்டி a

source: For a Windows instance which is not associated to an Active Directory, it suffices to create a local user account:
ta: செயலில் உள்ள கோப்பகத்துடன் தொடர்புடைய சாளரங்கள் நிகழ்வுக்கு, உள்ளக பயனர் கணக்கை உருவாக்க இது போதுமானது:

source: Open the ``Search Tab``
ta: `` தேடல் தாவல்`` திறக்கவும்

source: Search for ``Add, edit, or remove other users``
ta: `` மற்ற பயனர்களைச் சேர்க்கவும், திருத்தவும் அல்லது அகற்றவும்

source: In the menu, click ``Add someone else to this PC``
ta: பட்டியலில், `` இந்த பிசியில் வேறொருவரைச் சேர்க்கவும்` என்பதைக் சொடுக்கு செய்க

source: In the left pane right click on ``Users``
ta: இடது பலகத்தில் `` பயனர்கள்`` இல் வலது சொடுக்கு செய்க

source: Click ``New User...``
ta: `` புதிய பயனர் ... `` என்பதைக் சொடுக்கு செய்க

source: Fill in all fields with the data of a new user account (see image)
ta: புதிய பயனர் கணக்கின் தரவைக் கொண்டு அனைத்து புலங்களையும் நிரப்பவும் (படத்தைப் பார்க்கவும்)

source: Untick ``User must change password at next login``
ta: Undick `` பயனர் அடுத்த உள்நுழைவில் கடவுச்சொல்லை மாற்ற வேண்டும்``

source: Click ``Create``
ta: `` உருவாக்கு`` என்பதைக் சொடுக்கு செய்க

source: In the left pane click on ``Groups``
ta: இடது பலகத்தில் `` குழுக்கள்`` என்பதைக் சொடுக்கு செய்க

source: Right click on ``IIS_IUSRS``
ta: `` Iis_iusrs`` இல் வலது சொடுக்கு செய்யவும்

source: Click ``Add to Group...``
ta: குழுவில் சேர் ... `` என்பதைக் சொடுக்கு செய்க

source: Click on the ``Add`` button
ta: `` சேர்` பொத்தானைக் சொடுக்கு செய்க

source: In the textfield, enter the username of the previously created account
ta: உரைஃபீல்டில், முன்னர் உருவாக்கப்பட்ட கணக்கின் பயனர்பெயரை உள்ளிடவும்

source: Click ``Ok`` twice
ta: `` சரி`` இரண்டு முறை சொடுக்கு செய்க

source: Guide B
ta: வழிகாட்டி ஆ

source: For a Windows instance that is connected to an Active Directory, or even a controller of one, follow this guide:
ta: செயலில் உள்ள கோப்பகத்துடன் இணைக்கப்பட்டுள்ள ஒரு சாளரங்கள் நிகழ்வுக்கு அல்லது ஒன்றின் கட்டுப்படுத்தி கூட இந்த வழிகாட்டியைப் பின்பற்றுங்கள்:

source: Open the ``Server Manager``
ta: `` சேவையக மேலாளர்`` திறக்கவும்

source: In the navigation bar, click on ``Tools``
ta: வழிசெலுத்தல் பட்டியில், `` கருவிகள்`` என்பதைக் சொடுக்கு செய்க

source: Click ``Active Directory Users and Computers``
ta: `` செயலில் உள்ள அடைவு பயனர்கள் மற்றும் கணினிகள்` என்பதைக் சொடுக்கு செய்க

source: In the left pane, expand your domain
ta: இடது பலகத்தில், உங்கள் களத்தை விரிவாக்குங்கள்

source: Right click on ``Users``
ta: `` பயனர்கள்`` இல் வலது சொடுக்கு செய்க

source: Hove over ``New``
ta: `` புதிய`` மீது வட்டமிடுங்கள்

source: Click on ``User``
ta: `` பயனர்`` என்பதைக் சொடுக்கு செய்க

source: Fill in all required fields with the data of a new user account
ta: புதிய பயனர் கணக்கின் தரவுடன் தேவையான அனைத்து புலங்களையும் நிரப்பவும்

source: Click ``Next``
ta: `` அடுத்து`` என்பதைக் சொடுக்கு செய்க

source: Enter the new user password twice and untick ``User must change password at next login``
ta: புதிய பயனர் கடவுச்சொல்லை இரண்டு முறை உள்ளிட்டு, `` பயனர் அடுத்த உள்நுழைவில் கடவுச்சொல்லை மாற்ற வேண்டும்``

source: Click ``Next`` and then ``Finish`` to create the service account
ta: பணி கணக்கை உருவாக்க `` அடுத்து`` என்பதைக் சொடுக்கு செய்து `` முடிக்கவும்`

source: Creating worker services
ta: தொழிலாளர் சேவைகளை உருவாக்குதல்

source: Copy the file from
ta: கோப்பை நகலெடுக்கவும்

source: ``E:\venv\Lib\site-packages\openrem\sample-config\queue-init.bat`` to
ta: ``E:\venv\Lib\site-packages\openrem\sample-config\queue-init.bat`` பெறுநர்

source: Make sure that the previously downloaded and renamed ``WinSW.exe`` file is in the same folder (``E:\winsw\``).
ta: முன்பு பதிவிறக்கம் செய்யப்பட்ட மற்றும் மறுபெயரிடப்பட்ட `` winsw.exe`` கோப்பு ஒரே கோப்புறையில் இருப்பதை உறுதிசெய்க (`` e: \ winsw \ ``).

source: Double click the ``queue-init.bat`` file
ta: `` வரிசை-init.bat`` கோப்பை இருமுறை சொடுக்கு செய்க

source: Enter your Domain name or leave empty if not applicable
ta: உங்கள் டொமைன் பெயரை உள்ளிடவும் அல்லது பொருந்தவில்லை என்றால் காலியாக விடவும்

source: Enter the username of the previously created account
ta: முன்னர் உருவாக்கிய கணக்கின் பயனர்பெயரை உள்ளிடவும்

source: Enter the associated password
ta: தொடர்புடைய கடவுச்சொல்லை உள்ளிடவும்

source: Enter the number of workers you would like to spawn, this number should no exceed the number of CPU cores available to your system
ta: நீங்கள் ச்பான் செய்ய விரும்பும் தொழிலாளர்களின் எண்ணிக்கையை உள்ளிடவும், இந்த எண் உங்கள் கணினிக்கு கிடைக்கக்கூடிய சிபியு கோர்களின் எண்ணிக்கையை விட அதிகமாக இருக்கக்கூடாது

source: Wait for the services to get registered and started up (Notice: many windows may appear and disappear quickly)
ta: சேவைகள் பதிவுசெய்யப்பட்டு தொடங்கும் வரை காத்திருங்கள் (அறிவிப்பு: பல சாளரங்கள் தோன்றி விரைவாக மறைந்துவிடும்)

source: Adjusting IIS Application Pool Identity
ta: ஐஐஎச் பயன்பாட்டு பூல் அடையாளத்தை சரிசெய்தல்

source: Click on ``Application Pools``
ta: `` பயன்பாட்டு குளங்கள்`` என்பதைக் சொடுக்கு செய்க

source: Right click on ``OpenREM`` in the middle pane
ta: நடுத்தர பலகத்தில் `` OpenRem`` இல் வலது சொடுக்கு செய்யவும்

source: Click ``Advanced Settings...``
ta: `` மேம்பட்ட அமைப்புகள் ... `` என்பதைக் சொடுக்கு செய்க

source: Under ``Process Model`` click on ``Identity`` and then on the grey ``…`` box
ta: `` செயல்முறை மாதிரி`` இன் கீழ் `` அடையாளம்`` என்பதைக் சொடுக்கு செய்து, பின்னர் சாம்பல் ``… `` பெட்டி

source: Select the ``Custom account:`` radio button
ta: `` தனிப்பயன் கணக்கு: `` ரேடியோ பொத்தானைத் தேர்ந்தெடுக்கவும்

source: Click on ``Set...``
ta: `` அமை ... `` என்பதைக் சொடுக்கு செய்க

source: Enter the credentials of the preivously created account. If you are in an Active Directory prefix ther usernmae with ``<YOUR-DOMAIN>\``
ta: முன்னுரிமையாக உருவாக்கப்பட்ட கணக்கின் நற்சான்றிதழ்களை உள்ளிடவும். நீங்கள் ஒரு செயலில் உள்ள அடைவு முன்னொட்டில் இருந்தால் `` <உங்கள்-டொமைன்> \ `` `

source: Click ``OK`` three times
ta: `` சரி`` மூன்று முறை சொடுக்கு செய்க

source: ``E:\venv\Lib\site-packages\openrem\sample-config\openrem_orthanc_config_windows.lua`` to
ta: ``E:\venv\Lib\site-packages\openrem\sample-config\openrem_orthanc_config_windows.lua`` பெறுநர்

source: ``E:\orthanc\``
ta: `ஆம்: \ ஆர்த்த்சி

source: Edit the Orthanc Lua configuration options - right click on the file you just copied ``Edit with Notepad++``
ta: ஆர்த்தாங்க் லுவா உள்ளமைவு விருப்பங்களைத் திருத்தவும் - நீங்கள் `` நோட்பேட் ++ `` உடன் நகலெடுத்த கோப்பில் வலது சொடுக்கு செய்யவும்

source: Set ``use_physics_filtering`` to true if you want Orthanc to keep physics test studies, and have it put them in the ``E:\orthanc\dicom\`` folder. Set it to ``false`` to disable this feature. Add names or IDs to ``physics_to_keep`` as a comma separated list.
ta: இயற்பியல் சோதனை ஆய்வுகளை வைத்திருக்க ஆர்த்தாங்க் விரும்பினால், `` e: \ orthanc \ dicom \ `` கோப்புறையில் வைக்க விரும்பினால் `` use_physics_filtering`` ஐ உண்மை என அமைக்கவும். இந்த அம்சத்தை முடக்க அதை `` FALSE`` என அமைக்கவும். கமாவைப் பிரிக்கப்பட்ட பட்டியலாக `` இயற்பியல்_டோ_கீப்` இல் பெயர்கள் அல்லது ஐடிகளைச் சேர்க்கவும்.

source: Save any changes.
ta: எந்த மாற்றங்களையும் சேமிக்கவும்.

source: Edit the Orthanc configuration. Navigate to ``C:\Program Files\Orthanc Server\Configuration`` and right click on ``orthanc.json`` and click ``Edit with Notepad++``:
ta: ஆர்த்தாங்க் உள்ளமைவைத் திருத்தவும். `` சி: \ நிரல் கோப்புகள் \ ஆர்த்தாங்க் சேவையகம் \ உள்ளமைவு`` க்கு செல்லவும், வலது `` ஆர்த்தாங்க்.சான்`` என்பதைக் சொடுக்கு செய்து `` நோட்பேட் ++ `` உடன் திருத்து என்பதைக் சொடுக்கு செய்க

source: You will also need to open the firewall for port 8042.
ta: துறைமுகம் 8042 க்கான ஃபயர்வாலையும் நீங்கள் திறக்க வேண்டும்.

source: Allow DICOM traffic through the firewall
ta: ஃபயர்வால் வழியாக டிகாம் போக்குவரத்தை அனுமதிக்கவும்

source: Type ``windows firewall`` in the Start menu to open ``Windows Defender Firewall``
ta: `` சாளரங்கள் டிஃபென்டர் ஃபயர்வால்`` திறக்க தொடக்க பட்டியலில் `` சாளரங்கள் ஃபயர்வால்`` என தட்டச்சு செய்க

source: Click ``Advanced settings`` in the left hand pane to open ``Windows Defender Firewall with Advanced Security``
ta: மேம்பட்ட பாதுகாப்புடன் `` சாளரங்கள் டிஃபென்டர் ஃபயர்வால் திறக்க இடது கை பலகத்தில் `` மேம்பட்ட அமைப்புகள்`` என்பதைக் சொடுக்கு செய்க

source: Click ``Inbound Rules`` in the left hand pane
ta: இடது கை பலகத்தில் `` உள்வரும் விதிகள்`` என்பதைக் சொடுக்கு செய்க

source: Click ``New Rule...`` in the right hand pane
ta: வலது கை பலகத்தில் `` புதிய விதி ... `` என்பதைக் சொடுக்கு செய்க

source: Click ``Port`` and ``Next >``
ta: `` போர்ட்`` மற்றும் `` அடுத்து> `` என்பதைக் சொடுக்கு செய்க

source: Leave as ``TCP`` and specify port ``104`` and click ``Next >``
ta: `` Tcp`` ஆக விட்டுவிட்டு துறைமுகம் `` 104`` ஐக் குறிப்பிடவும், `` அடுத்து> `` என்பதைக் சொடுக்கு செய்யவும்

source: ``Allow the connection``, ``Next >``
ta: `` இணைப்பை அனுமதிக்கவும்``, `` அடுத்து> ``

source: Leave the boxes ticked for ``When does this rule apply`` if that is appropriate, ``Next >``
ta: `` இந்த விதி எப்போது பொருந்தும் `` எப்போது பொருந்தினால், `` அடுத்து> ``

source: Name ``Orthanc DICOM port``
ta: பெயர் `` ஆர்த்தாங்க் டிகாம் போர்ட்``

source: Launch ``Services`` from the start menu
ta: தொடக்க மெனுவிலிருந்து `` சேவைகள்`` ஐத் தொடங்கவும்

source: Find ``Orthanc`` on the list and click ``Restart``
ta: பட்டியலில் `` ஆர்த்தாங்க்`` கண்டுபிடித்து `` மறுதொடக்கம்`` என்பதைக் சொடுக்கு செய்க

source: Orthanc logs can be reviewed at ``C:\Program Files\Orthanc Server\Logs`` - the current log file will have the latest date and time in the filename - right click ``Edit with Notepad++``
ta: ஆர்த்தாங்க் பதிவுகளை `` சி: \ நிரல் கோப்புகள் \ ஆர்த்தாங்க் சேவையகம் \ பதிவுகள்`` இல் மதிப்பாய்வு செய்யலாம் - தற்போதைய பதிவு கோப்பில் கோப்பு பெயரில் அண்மைக் கால தேதி மற்றும் நேரம் இருக்கும் - வலது சொடுக்கு `` நோட்பேட் ++ `` உடன் திருத்து

source: You can check if the port is running and allowed through the firewall using the ``Network`` tab of Resource Monitor.
ta: வள மானிட்டரின் `` நெட்வொர்க்` தாவலைப் பயன்படுத்தி துறைமுகம் இயங்குகிறதா மற்றும் ஃபயர்வால் வழியாக அனுமதிக்கப்படுகிறதா என்பதை நீங்கள் சரிபார்க்கலாம்.

source: Installation options
ta: நிறுவல் விருப்பங்கள்

source: There are three supported installation options for OpenREM v1.0:
ta: OpenREM V1.0 க்கு மூன்று உதவி நிறுவல் விருப்பங்கள் உள்ளன:

source: Docker
ta: கப்பல்துறை

source: Native install on Linux
ta: லினக்சில் சொந்த நிறுவல்

source: Native install on Windows
ta: சாளரங்களில் சொந்த நிறுவல்

source: This is the quickest and easiest way of installing a fully functioning OpenREM instance, complete with database, web server and DICOM server, on any operating system that supports Docker with Linux containers. This includes Windows 10 with Docker Desktop, but currently excludes Windows Server, though this may change with availability of WSL2 for Windows Server 2022.
ta: லினக்ச் கொள்கலன்களுடன் டோக்கரை ஆதரிக்கும் எந்தவொரு இயக்க முறைமையிலும் தரவுத்தளம், வலை சேவையகம் மற்றும் டிகாம் சேவையகத்துடன் முழுமையான செயல்படும் ஓபன்ரெம் நிகழ்வை நிறுவுவதற்கான விரைவான மற்றும் எளிதான வழி இது. இது கப்பல்துறை டெச்க்டாப்புடன் சாளரங்கள் 10 ஐ உள்ளடக்கியது, ஆனால் தற்போது சாளரங்கள் சேவையகத்தை விலக்குகிறது, இருப்பினும் இது சாளரங்கள் சர்வர் 2022 க்கான WSL2 கிடைப்பதன் மூலம் மாறக்கூடும்.

source: The Docker installation has mostly been tested with Ubuntu server, but has also been used successfully with Podman on Redhat Enterprise Linux and other distributions.
ta: கப்பல்துறை நிறுவல் பெரும்பாலும் உபுண்டு சேவையகத்துடன் சோதிக்கப்பட்டுள்ளது, ஆனால் ரெட்ஆட் எண்டர்பிரைச் லினக்ச் மற்றும் பிற விநியோகங்களில் போட்மேனுடன் வெற்றிகரமாக பயன்படுத்தப்பட்டுள்ளது.

source: Existing Windows or Linux installations of OpenREM 0.10 can be upgraded to run in a Docker installation.
ta: ஓபன்ரெம் 0.10 இன் தற்போதுள்ள சாளரங்கள் அல்லது லினக்ச் நிறுவல்களை கப்பல்துறை நிறுவலில் இயக்க மேம்படுத்தலாம்.

source: It is advisable that the server OpenREM is installed on has access to the internet to get images from Docker and security updates for the operating system. However, if this is not possible the Docker images can be obtained on a computer that does have access to the internet and transferred to the 'offline' server for installation.
ta: சேவையக ஓபன்ரெம் நிறுவப்பட்டிருப்பது டோக்கரிடமிருந்து படங்களைப் பெற இணையத்தை அணுகுவதையும் இயக்க முறைமைக்கான பாதுகாப்பு புதுப்பிப்புகளையும் பெறுவது நல்லது. இருப்பினும், இது சாத்தியமில்லை என்றால், கப்பல்துறை படங்களை இணையத்தில் அணுகக்கூடிய கணினியில் பெறலாம் மற்றும் நிறுவலுக்காக 'இணைப்பில்லாத' சேவையகத்திற்கு மாற்றலாம்.

source: A native installation on Linux requires Python, a webserver (eg Nginx) a database (ideally PostgreSQL) and a DICOM server (ideally Orthanc) to be installed, with OpenREM and all the other dependencies being installed via Pip.
ta: லினக்ச் மீது ஒரு சொந்த நிறுவலுக்கு பைதான், ஒரு வெப்சர்வர் (எ.கா.
