Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: A similar script could be created as a batch file or PowerShell script on Windows and run using the scheduler. An example PowerShell script is shown below:
ta: இதேபோன்ற ச்கிரிப்டை சாளரங்களில் ஒரு தொகுதி கோப்பு அல்லது பவர்செல் ச்கிரிப்டாக உருவாக்கி திட்டமிடுபவரைப் பயன்படுத்தி இயக்கலாம். பவர்செல் ச்கிரிப்ட் ஒரு எடுத்துக்காட்டு கீழே காட்டப்பட்டுள்ளது:

source: The above PowerShell script could be run on a regular basis by adding a task to the Windows ``Task Scheduler`` that executes the ``powershell`` program with an argument of ``-file C:\path\to\script.ps1``.
ta: `` பவர்செல்`` திட்டத்தை `` -பைல் சி: \ பாதை \ முதல் \ ச்கிரிப்ட் வரை செயல்படுத்தும் சாளரங்களில் ஒரு பணியைச் சேர்ப்பதன் மூலம் மேலே உள்ள பவர்செல் ச்கிரிப்டை வழக்கமான அடிப்படையில் இயக்க முடியும். ps1``.

source: Querying with time range
ta: நேர வரம்பில் வினவல்

source: It is now possible to query for studies in a time window when using query-retrieve from the command line (web interface version will be introduced later). This can be particularly useful where PACS query responses are limited or null if the query matches too many studies.
ta: கட்டளை வரியிலிருந்து வினவல்-மறுசீரமைப்பைப் பயன்படுத்தும் போது நேர சாளரத்தில் ஆய்வுகளுக்கு வினவ முடியும் (வலை இடைமுக பதிப்பு பின்னர் அறிமுகப்படுத்தப்படும்). வினவல் பல ஆய்வுகளுடன் பொருந்தினால் பிஏசிஎச் வினவல் பதில்கள் குறைவாகவோ அல்லது பூச்யமாகவோ இருக்கும் இடத்தில் இது மிகவும் பயனுள்ளதாக இருக்கும்.

source: Using the ``--tfrom``/``-tf`` and/or the ``--tuntil``/``-tt`` arguments are only allowed if ``--single_date``/``-sd`` argument is used.
ta: ``--tfrom``/`-tf`` மற்றும்/அல்லது` `--ஒத்திசைவு` -tt`` வாதங்கள் பயன்படுத்தப்படுவார்கள் ``--cingle_date`/``- Sd`` உரையாடல் பயன்படுத்தப்படுகிறது.

source: Note: ``-sd 2018-03-19`` is the same as using ``-f 2018-03-19 -t 2018-03-19``, and can be used without the time arguments.
ta: குறிப்பு: `` -SD 2018-03-19`` `` -f 2018-03-19 -T 2018-03-19`` ஐப் பயன்படுத்துவதைப் போன்றது, மேலும் நேர வாதங்கள் இல்லாமல் பயன்படுத்தலாம்.

source: ``-tf`` used without ``-tt`` will search from ``tf`` until 23.59 that day.
ta: `` -tt`` இல்லாமல் பயன்படுத்தப்படும் `` -tf`` அன்று 23.59 வரை `` tf`` இலிருந்து தேடும்.

source: ``-tt`` used without ``-tf`` will search from 00.00 to ``tt`` that day.
ta: `` -tf` இல்லாமல் பயன்படுத்தப்படும் `` -tt`` 00.00 முதல் `tt`` வரை தேடும்.

source: ``-tf`` and ``-tt`` used together will search from ``tf`` to ``tt``.
ta: `` -tf`` மற்றும் `` -tt`` ஒன்றாகப் பயன்படுத்தப்படுகின்றன `` tf`` இலிருந்து `` tt`` வரை தேடும்.

source: For example, to search for CT from 12 noon to 3pm on 19th March 2018, using remote QR node database ID 2 and local store database ID 1:
ta: எடுத்துக்காட்டாக, தொலைநிலை QR முனை தரவுத்தள ஐடி 2 மற்றும் உள்ளக கடை தரவுத்தள ஐடி 1 ஐப் பயன்படுத்தி, மார்ச் 19, 2018 அன்று மதியம் 12 முதல் மதியம் 3 மணி வரை CT ஐத் தேட::

source: Query filtering logic
ta: வினவல் வடிகட்டுதல் வழக்கு

source: Study level query response processing
ta: ஆய்வு நிலை வினவல் மறுமொழி செயலாக்கம்

source: First we query for each modality chosen in turn to get matching responses at study level.
ta: முதலில் தேர்வு செய்யப்பட்ட ஒவ்வொரு முறைக்கும் வினவுகிறோம்.

source: If the optional ``ModalitiesInStudy`` has been populated in the response, and if you have ticked ``Include SR only studies``, then any studies with anything other than just ``SR`` studies is removed from the response list.
ta: விருப்பமான `` MOGHTALITIONSINSTUDY`` பதிலில் மக்கள்தொகை பெற்றிருந்தால், நீங்கள் `` SR ஐ மட்டுமே ஆய்வுகளைச் சேர்த்துக் கொண்டீர்கள் `` `` sr`` ஆய்வுகள் மறுமொழி பட்டியலிலிருந்து அகற்றப்படும்.

source: If any study description filters have been added, and if the ``StudyDescription`` tags are returned by the remote server, the study response list is filtered accordingly. The same applies to the station name filter *if* the option to check station names at study level has been selected.
ta: ஏதேனும் ஆய்வு விளக்க வடிப்பான்கள் சேர்க்கப்பட்டிருந்தால், `` ச்டடெச்டெச்ட்ரிப்சன்`` குறிச்சொற்கள் தொலை சேவையகத்தால் திருப்பித் தரப்பட்டால், ஆய்வு மறுமொழி பட்டியல் அதற்கேற்ப வடிகட்டப்படுகிறது. ச்டேசன் பெயர் வடிப்பானுக்கும் இது பொருந்தும் * என்றால் * நிலைய பெயர்களை ஆய்வு மட்டத்தில் சரிபார்க்க விருப்பம் தேர்ந்தெடுக்கப்பட்டால்.

source: For the remaining study level responses, each series is queried.
ta: மீதமுள்ள ஆய்வு நிலை பதில்களுக்கு, ஒவ்வொரு தொடரும் வினவப்படுகிறது.

source: If ``ModalitiesInStudy`` was not returned, it is now built from the series level responses.
ta: `` MOGHTALITIONINSTUDY`` திருப்பித் தரப்படவில்லை என்றால், அது இப்போது தொடர் நிலை பதில்களிலிருந்து கட்டப்பட்டுள்ளது.

source: If the remote server returned everything rather than just the modalities we asked for, the study level responses are now filtered against the modalities selected.
ta: நாங்கள் கேட்ட முறைகளை விட தொலைநிலை சேவையகம் எல்லாவற்றையும் திருப்பித் தந்தால், ஆய்வு நிலை பதில்கள் இப்போது தேர்ந்தெடுக்கப்பட்ட முறைகளுக்கு எதிராக வடிகட்டப்படுகின்றன.

source: Series level query processing
ta: தொடர் நிலை வினவல் செயலாக்கம்

source: If station name filters have been added, and if the ``StationName`` tags are returned by the remote server, the series list is filtered accordingly — unless the option to check station names at study level has been selected.
ta: நிலைய பெயர் வடிப்பான்கள் சேர்க்கப்பட்டிருந்தால், `` ச்டேசன் பெயர்`` குறிச்சொற்கள் தொலை சேவையகத்தால் திருப்பித் தரப்பட்டால், தொடர் பட்டியல் அதற்கேற்ப வடிகட்டப்படும் - ஆய்வு மட்டத்தில் நிலைய பெயர்களை சரிபார்க்க விருப்பம் தேர்ந்தெடுக்கப்படாவிட்டால்.

source: If **mammography** exams were requested, and a study has ``MG`` in:
ta: ** மேமோகிராபி ** தேர்வுகள் கோரப்பட்டால், ஒரு ஆய்வில் `` mg`` உள்ளது:

source: If one of the series is of type ``SR``, an image level query is done to see if it is an RDSR. If it is, all the other series responses are deleted (i.e. when the move request/'retrieve' is sent only the RDSR is requested not the images.
ta: தொடரில் ஒன்று `` sr`` வகை என்றால், இது ஒரு RDSR ஆக இருக்கிறதா என்று ஒரு பட நிலை வினவல் செய்யப்படுகிறது. அது இருந்தால், மற்ற அனைத்து தொடர் பதில்களும் நீக்கப்படும் (அதாவது நகர்வு கோரிக்கை/மீட்டெடு 'அனுப்பப்படும் போது ஆர்.டி.எச்.ஆர் மட்டுமே படங்கள் அல்ல என்று கோரப்படுகிறது.

source: Otherwise the ``SR`` series responses are deleted and all the image series are requested.
ta: இல்லையெனில் `` Sr`` தொடர் பதில்கள் நீக்கப்பட்டு அனைத்து படத் தொடர்களும் கோரப்படுகின்றன.

source: If **planar radiographic** exams were requested, and a study has ``DX`` or ``CR`` in:
ta: ** பிளானர் ரேடியோகிராஃபிக் ** தேர்வுகள் கோரப்பட்டால், ஒரு ஆய்வில் `` dx`` அல்லது `` cr`` இல் இருந்தால்:

source: Any ``SR`` series are checked at 'image' level to see if they are RDSRs. If they are, the other series level responses for that study are deleted.
ta: எந்தவொரு `` sr`` தொடரும் 'பட' மட்டத்தில் சரிபார்க்கப்படுகின்றன, அவை RDSRS ஆக இருக்கிறதா என்று பார்க்க. அவை இருந்தால், அந்த ஆய்வுக்கான மற்ற தொடர் நிலை பதில்கள் நீக்கப்படுகின்றன.

source: If **fluoroscopy** exams were requested, and a study has ``RF`` or ``XA`` in:
ta: ** ஃப்ளோரோச்கோபி ** தேர்வுகள் கோரப்பட்டால், ஒரு ஆய்வில் `` rf`` அல்லது `` xa`` இல் இருந்தால்:

source: Any ``SR`` series are checked at 'image' level to see if they are RDSRs or ESRs (Enhanced Structured Reports - not currently used but will be in the future). Any other ``SR`` series responses are deleted.
ta: எந்தவொரு `` sr`` தொடரும் 'பட' மட்டத்தில் சரிபார்க்கப்படுகின்றன, அவை RDSRS அல்லது ESR கள் (மேம்பட்ட கட்டமைக்கப்பட்ட அறிக்கைகள் - தற்போது பயன்படுத்தப்படவில்லை, ஆனால் எதிர்காலத்தில் இருக்கும்). வேறு எந்த `` Sr`` தொடர் பதில்களும் நீக்கப்படுகின்றன.

source: All non-``SR`` series responses are deleted.
ta: `'எச்ஆர்`` தொடர் பதில்கள் அனைத்தும் நீக்கப்படுகின்றன.

source: If **CT** exams were requested, and a study has ``CT`` in:
ta: ** ct ** தேர்வுகள் கோரப்பட்டால், ஒரு ஆய்வில் `` ct`` இல் இருந்தால்:

source: Any ``SR`` series are checked at 'image' level to see if they are RDSRs. If they are, all other SR and image series responses are deleted. Otherwise, if it has an ESR series, again all other SR and image series responses are deleted.
ta: எந்தவொரு `` sr`` தொடரும் 'பட' மட்டத்தில் சரிபார்க்கப்படுகின்றன, அவை RDSRS ஆக இருக்கிறதா என்று பார்க்க. அவை இருந்தால், மற்ற அனைத்து எச்.ஆர் மற்றும் படத் தொடர் பதில்கள் நீக்கப்படும். இல்லையெனில், இது ஒரு ஈ.எச்.ஆர் தொடரைக் கொண்டிருந்தால், மீண்டும் மற்ற அனைத்து எச்.ஆர் மற்றும் படத் தொடர் பதில்களும் நீக்கப்படும்.

source: If there are no RDSR or ESR series, the other series are checked to see if they are Philips 'Dose info' series. If there are, other series responses are deleted.
ta: ஆர்.டி.எச்.ஆர் அல்லது ஈ.எச்.ஆர் தொடர் இல்லை என்றால், மற்ற தொடர்கள் பிலிப்சின் டோச் செய்தி 'தொடரா என்று சோதிக்கப்படுகிறது. இருந்தால், பிற தொடர் பதில்கள் நீக்கப்படும்.

source: If there are no RDSR, ESR or 'Dose info' series and the option to get Toshiba images has been selected, then an image level query is performed for the first image in each series. If the image is not a secondary capture, all but the first image are deleted from the image level responses and the image_level_move flag is set. If the image is a secondary capture, the whole series response is kept.
ta: ஆர்.டி.எச்.ஆர், ஈ.எச்.ஆர் அல்லது 'டோச் செய்தி' தொடர் இல்லை மற்றும் தோசிபா படங்களைப் பெறுவதற்கான விருப்பம் தேர்ந்தெடுக்கப்பட்டால், ஒவ்வொரு தொடரின் முதல் படத்திற்கும் பட நிலை வினவல் செய்யப்படுகிறது. படம் இரண்டாம் நிலை பிடிப்பு இல்லையென்றால், முதல் படத்தைத் தவிர மற்ற அனைத்தும் பட நிலை பதில்களிலிருந்து நீக்கப்பட்டு, படம்_லெவல்_மோவ் கொடி அமைக்கப்படுகிறது. படம் இரண்டாம் நிலை பிடிப்பு என்றால், முழு தொடர் பதில் வைக்கப்படுகிறது.

source: If there are no RDSR or ESR, series descriptions aren't returned and the Toshiba option has been set, the image level query is performed as per the previous point. This process will keep the responses that might have Philips 'Dose info' series.
ta: ஆர்.டி.எச்.ஆர் அல்லது ஈ.எச்.ஆர் இல்லை என்றால், தொடர் விளக்கங்கள் திரும்பப் பெறப்படவில்லை மற்றும் தோசிபா விருப்பம் அமைக்கப்பட்டுள்ளது, முந்தைய புள்ளியின் படி பட நிலை வினவல் செய்யப்படுகிறது. இந்த செயல்முறை பிலிப்சின் டோச் செய்தி 'தொடரைக் கொண்டிருக்கும் பதில்களை வைத்திருக்கும்.

source: If there are no RDSR, ESR, series descriptions aren't returned and the Toshiba option has not been set, each series with more than five images in is deleted from the series response list - the remaining ones might be Philips 'Dose info' series.
ta: ஆர்.டி.எச்.ஆர், ஈ.எச்.ஆர், தொடர் விளக்கங்கள் திரும்பவில்லை மற்றும் தோசிபா விருப்பம் அமைக்கப்படவில்லை என்றால், ஐந்து படங்களுக்கு மேல் உள்ள ஒவ்வொரு தொடரும் தொடர் மறுமொழி பட்டியலிலிருந்து நீக்கப்படும் - மீதமுள்ளவை பிலிப்சின் டோச் செய்தி 'தொடராக இருக்கலாம் .

source: If **SR only studies** were requested:
ta: ** எச்ஆர் மட்டுமே ஆய்வுகள் ** கோரப்பட்டால்:

source: Each series response is checked at 'image' level to see which type of SR it is. If is not RDSR or ESR, the study response is deleted.
ta: ஒவ்வொரு தொடர் பதிலும் எந்த வகை எச்.ஆர் என்பதைக் காண 'பட' மட்டத்தில் சரிபார்க்கப்படுகிறது. ஆர்.டி.எச்.ஆர் அல்லது ஈ.எச்.ஆர் இல்லையென்றால், ஆய்வு பதில் நீக்கப்படும்.

source: If **Get SR series that return nothing at image level query** were requested:
ta: பட நிலை வினவலில் எதையும் திருப்பித் தரும் ** எச்ஆர் தொடரைப் பெற்றால் ** கோரப்பட்டது:

source: It is assumed that any ``SR`` series that appears to be empty actually contains an RDSR, and the other series are dealt with as above for when an RDSR is found. If at the image level query the full data requested is returned, then the series will be processed the same whether this option is selected or not.
ta: காலியாகத் தோன்றும் எந்த `` sr`` தொடரும் உண்மையில் ஒரு RDSR ஐக் கொண்டுள்ளது என்று கருதப்படுகிறது, மற்ற தொடர்கள் ஒரு RDSR கண்டுபிடிக்கப்படும்போது மேலே கையாளப்படுகின்றன. பட மட்டத்தில் வினவப்பட்டால், கோரப்பட்ட முழு தரவு திரும்பப் பெறப்பட்டால், இந்த விருப்பம் தேர்ந்தெடுக்கப்பட்டாலும் இல்லாவிட்டாலும் தொடர் செயலாக்கப்படும்.

source: Duplicates processing
ta: நகல் செயலாக்கம்

source: For each remaining study in the query response, the Study Instance UID is checked against the studies already in the OpenREM database.
ta: வினவல் பதிலில் மீதமுள்ள ஒவ்வொரு ஆய்விற்கும், ஏற்கனவே ஓபன்ரெம் தரவுத்தளத்தில் உள்ள ஆய்வுகளுக்கு எதிராக ஆய்வு நிகழ்வு UID சரிபார்க்கப்படுகிறது.

source: If there is a match and the series level modality is **SR** (from a CT, or RF etc):
ta: ஒரு போட்டி இருந்தால் மற்றும் தொடர் நிலை முறை ** sr ** (ஒரு CT, அல்லது வானலை போன்றவற்றிலிருந்து) என்றால்:

source: The image level response will have the SOP Instance UID - this is checked against the SOP Instance UIDs recorded with the matching study. If a match is found, the 'image' level response is deleted.
ta: பட நிலை பதிலில் சோப் நிகழ்வு UID இருக்கும் - இது பொருந்தக்கூடிய ஆய்வில் பதிவுசெய்யப்பட்ட சோப் நிகழ்வு UID களை எதிர்த்து சரிபார்க்கப்படுகிறது. ஒரு போட்டி காணப்பட்டால், 'படம்' நிலை பதில் நீக்கப்படும்.

source: If there is a match and the series level modality is **MG**, **DX** or **CR**:
ta: ஒரு போட்டி இருந்தால் மற்றும் தொடர் நிலை முறை ** mg **, ** dx ** அல்லது ** சிஆர் **:

source: An image level query is made which will populate the image level responses with SOP Instance UIDs
ta: ஒரு பட நிலை வினவல் செய்யப்படுகிறது, இது பட நிலை மறுமொழிகளை சோப் நிகழ்வு UIDS உடன் விரிவுபடுத்தும்

source: Each image level response is then processed and the SOP Instance UID is checked against the SOP Instance UIDs recorded with the matching study. If a match is found, the 'image' level response is deleted.
ta: ஒவ்வொரு பட நிலை பதிலும் பின்னர் செயலாக்கப்படுகிறது மற்றும் சோப் நிகழ்வு UID பொருந்தக்கூடிய ஆய்வில் பதிவுசெய்யப்பட்ட சோப் நிகழ்வு UID களுக்கு எதிராக சரிபார்க்கப்படுகிறது. ஒரு போட்டி காணப்பட்டால், 'படம்' நிலை பதில் நீக்கப்படும்.

source: Once each series level response is processed:
ta: ஒவ்வொரு தொடர் நிலை பதிலும் செயலாக்கப்பட்டதும்:

source: If the series no longer has any image level responses the series level response is deleted.
ta: தொடரில் இனி பட நிலை பதில்கள் இல்லையென்றால் தொடர் நிலை பதில் நீக்கப்படும்.

source: If the study no longer has any series level responses the study level response is deleted.
ta: ஆய்வில் இனி எந்த தொடர் நிலை பதில்களும் இல்லை என்றால், ஆய்வு நிலை பதில் நீக்கப்படும்.

source: DICOM query summary
ta: டிகாம் வினவல் சுருக்கம்

source: Go to query summary
ta: வினவல் சுருக்கத்திற்குச் செல்லுங்கள்

source: Figure 3: Go to query summary
ta: படம் 3: வினவல் சுருக்கத்திற்குச் செல்லுங்கள்

source: Either by clicking on the "Go to query details page" when executing a query or by going to Config > DICOM query summary you can review the current and older queries, check which files were found on the remote, which studies/files were ignored and why, and review the result of importing files which were retrieved.
ta: வினவலை இயக்கும் போது "வினவல் விவரங்கள் பக்கத்திற்குச் செல்லுங்கள்" என்பதைக் சொடுக்கு செய்வதன் மூலம் அல்லது கட்டமைப்பிற்குச் செல்வதன் மூலம்> டிகாம் வினவல் சுருக்கம் நீங்கள் தற்போதைய மற்றும் பழைய வினவல்களை மதிப்பாய்வு செய்யலாம், தொலைதூரத்தில் எந்த கோப்புகள் காணப்பட்டன, எந்த ஆய்வுகள்/கோப்புகள் புறக்கணிக்கப்பட்டன என்பதை சரிபார்க்கவும் ஏன், மற்றும் மீட்டெடுக்கப்பட்ட கோப்புகளை இறக்குமதி செய்ததன் முடிவை மதிப்பாய்வு செய்யவும்.

source: The query details page
ta: வினவல் விவரங்கள் பக்கம்

source: Figure 4: The query details page
ta: படம் 4: வினவல் விவரங்கள் பக்கம்

source: By clicking on the studies of a query you can review the discovered DICOM series as well as to some extent the individual files that are part of those series. If no import tasks are shown, even though the study is marked for downloading, that probably means that the query has not been retrieved, i.e. was aborted before completion. In the example below the query was run with the setting to not ignore duplicates, therefore the study was still downloaded but then thrown away by the import.
ta: ஒரு வினவலின் ஆய்வுகளைக் சொடுக்கு செய்வதன் மூலம் நீங்கள் கண்டுபிடிக்கப்பட்ட DICOM தொடர்களையும், அந்தத் தொடரின் ஒரு பகுதியாக இருக்கும் தனிப்பட்ட கோப்புகளையும் ஓரளவிற்கு மதிப்பாய்வு செய்யலாம். இறக்குமதி பணிகள் எதுவும் காட்டப்படாவிட்டால், பதிவிறக்கம் செய்வதற்காக ஆய்வு குறிக்கப்பட்டிருந்தாலும், வினவல் மீட்டெடுக்கப்படவில்லை என்று பொருள், அதாவது நிறைவடைவதற்கு முன்பு கைவிடப்பட்டது. வினவலுக்கு கீழே உள்ள எடுத்துக்காட்டில் நகல்களைப் புறக்கணிக்காத அமைப்புடன் இயக்கப்பட்டது, எனவே ஆய்வு இன்னும் பதிவிறக்கம் செய்யப்பட்டது, ஆனால் பின்னர் இறக்குமதியால் தூக்கி எறியப்பட்டது.

source: The query study details page
ta: வினவல் ஆய்வு விவரங்கள் பக்கம்

source: Figure 5: The query study details page
ta: படம் 5: வினவல் ஆய்வு விவரங்கள் பக்கம்

source: Troubleshooting: openrem_qr.log
ta: சரிசெய்தல்: OpenRem_qr.log

source: Note that if a query does not work as expected the first location to check should be the :ref:`qrquerysummary` and the :doc:`task-management`. However if that does not clarify the issue looking at the logs will be a good idea.
ta: ஒரு வினவல் எதிர்பார்த்தபடி செயல்படவில்லை என்றால், சரிபார்க்க முதல் இடம் இருக்க வேண்டும்: ref: `qrquerysummary` மற்றும் தி: டாக்:` பணி-மேலாண்மை`. இருப்பினும் அது பதிவுகளைப் பார்க்கும் சிக்கலை தெளிவுபடுத்தவில்லை என்றால் நல்ல யோசனையாக இருக்கும்.

source: If the default logging settings haven't been changed then there will be a log files to refer to. The default location is within your ``logs`` folder:
ta: இயல்புநிலை பதிவு அமைப்புகள் மாற்றப்படவில்லை என்றால், குறிப்பிட ஒரு பதிவு கோப்புகள் இருக்கும். இயல்புநிலை இருப்பிடம் உங்கள் `` பதிவுகள்` கோப்புறையில் உள்ளது:

source: This file contains information about the query, the status of the remote node, the C-Find response, the analysis of the response, and the individual C-Move requests.
ta: இந்த கோப்பில் வினவல், தொலை முனையின் நிலை, சி-கண்டுபிடிப்பு பதில், பதிலின் பகுப்பாய்வு மற்றும் தனிப்பட்ட சி-மூவ் கோரிக்கைகள் பற்றிய தகவல்கள் உள்ளன.

source: The following is an example of the start of the log for the following query which is run once an hour (ie some responses will already have been imported):
ta: ஒரு மணி நேரத்திற்கு ஒரு முறை இயக்கப்படும் பின்வரும் வினவலுக்கான பதிவின் தொடக்கத்திற்கு பின்வருபவை ஒரு எடுத்துக்காட்டு (அதாவது சில பதில்கள் ஏற்கனவே இறக்குமதி செய்யப்பட்டிருக்கும்):

source: Configuration required for query-retrieve
ta: வினவல்-மறுசீரமைப்பிற்கு உள்ளமைவு தேவை

source: You need a DICOM store service set up - see :doc:`import` for details.
ta: உங்களுக்கு ஒரு டிகாம் கடை பணி அமைக்க வேண்டும் - காண்க: டாக்: விவரங்களுக்கு `இறக்குமதி.

source: If you are using a third party DICOM Store server, then you will need to add the details as per :doc:`netdicom-nodes` but do not use the 'advanced' section.
ta: நீங்கள் மூன்றாம் தரப்பு DICOM STORE சேவையகத்தைப் பயன்படுத்துகிறீர்கள் என்றால், நீங்கள் விவரங்களைச் சேர்க்க வேண்டும்: DOC: `NetDicom-Nodes` ஆனால் 'மேம்பட்ட' பகுதியைப் பயன்படுத்த வேண்டாம்.

source: Use Modality in Study Query: Some PACS systems (like Impax 6.6) need modality at study level for correct filtering. if this option is checked, the modality tag is inserted in the study level request.
ta: ஆய்வு வினவலில் முறையைப் பயன்படுத்துங்கள்: சில பிஏசிஎச் அமைப்புகள் (இம்பாக்ச் 6.6 போன்றவை) சரியான வடிகட்டலுக்கான ஆய்வு மட்டத்தில் முறை தேவை. இந்த விருப்பம் சரிபார்க்கப்பட்டால், ஆய்வு நிலை கோரிக்கையில் மாதிரி குறிச்சொல் செருகப்படுகிறது.

source: Modality is not a valid tag in a study level request (Modalities In Study is available instead). However, some PACS systems require it for proper function, others will ignore it, and some will return zero results if the tag is present.
ta: முறை என்பது ஒரு ஆய்வு நிலை கோரிக்கையில் சரியான குறிச்சொல் அல்ல (அதற்கு பதிலாக ஆய்வில் முறைகள் கிடைக்கின்றன). இருப்பினும், சில பிஏசிஎச் அமைப்புகளுக்கு சரியான செயல்பாட்டிற்கு இது தேவைப்படுகிறது, மற்றவர்கள் அதைப் புறக்கணிப்பார்கள், மேலும் குறிச்சொல் இருந்தால் சில சுழிய முடிவுகளைத் தரும்.

source: Patient identifiable data
ta: நோயாளி அடையாளம் காணக்கூடிய தரவு

source: Prior to version 0.7, no data that is generally considered to be patient identifiable was stored in the OpenREM database.
ta: பதிப்பு 0.7 க்கு முன்னர், பொதுவாக நோயாளியாக அடையாளம் காணக்கூடியதாகக் கருதப்படும் தரவு எதுவும் ஓபன்ரெம் தரவுத்தளத்தில் சேமிக்கப்படவில்லை.

source: The following patient descriptors have always been recorded if they were available:
ta: பின்வரும் நோயாளி விளக்கங்கள் கிடைத்திருந்தால் எப்போதும் பதிவு செய்யப்படுகின்றன:

source: Patient age at the time of the study, but not date of birth (though this could be calculated from age)
ta: ஆய்வின் போது நோயாளியின் அகவை, ஆனால் பிறந்த தேதி அல்ல (இது வயதிலிருந்து கணக்கிடப்படலாம் என்றாலும்)

source: Patient sex
ta: நோயாளி செக்ச்

source: Patient height
ta: நோயாளியின் உயரம்

source: Patient weight
ta: நோயாளியின் எடை

source: In addition, a key identifier for the exam that is normally not considered patient identifiable was stored:
ta: கூடுதலாக, பொதுவாக நோயாளி அடையாளம் காணக்கூடியதாகக் கருதப்படாத தேர்வுக்கான முக்கிய அடையாளங்காட்டி சேமிக்கப்பட்டது:

source: Study accession number
ta: அணுகல் எண் ஆய்வு

source: It has become apparent that there are reasons where people need to store patient identifiable data to make the most of OpenREM, so this is now configurable from version 0.7 onwards.
ta: ஓபன்ரெம் அதிகம் பயன்படுத்த நோயாளிகள் அடையாளம் காணக்கூடிய தரவை மக்கள் சேமிக்க வேண்டிய காரணங்கள் உள்ளன என்பது தெளிவாகத் தெரிகிறது, எனவே இது இப்போது பதிப்பு 0.7 முதல் கட்டமைக்கப்படுகிறது.

source: Configure what is stored
ta: சேமிக்கப்பட்டதை உள்ளமைக்கவும்

source: Configuration menu
ta: உள்ளமைவு பட்டியல்

source: On the Config menu, select ``Patient ID``:
ta: கட்டமைப்பு பட்டியலில், `` நோயாளி ஐடி`` என்பதைத் தேர்ந்தெடுக்கவும்:

source: The initial settings are as follows:
ta: ஆரம்ப அமைப்புகள் பின்வருமாறு:

source: Modify patient identifiable data settings
ta: நோயாளியின் அடையாளம் காணக்கூடிய தரவு அமைப்புகளை மாற்றவும்

source: The default for patient name, ID and date of birth is to not store them. There isn't an option currently to not store the accession number, though OpenREM continues to work if it is missing.
ta: நோயாளியின் பெயர், ஐடி மற்றும் பிறந்த தேதிக்கான இயல்புநிலை அவற்றை சேமிக்கக்கூடாது. அணுகல் எண்ணை சேமிக்காததற்கு தற்போது ஒரு வழி இல்லை, இருப்பினும் ஓபன்ரெம் காணவில்லை என்றால் தொடர்ந்து வேலை செய்கிறது.

source: To store patient identifiable data from now on, select the relevant box and press ``Submit``. If you change the setting again later, then data already stored will remain in the database.
ta: இப்போதிலிருந்து நோயாளி அடையாளம் காணக்கூடிய தரவைச் சேமிக்க, தொடர்புடைய பெட்டியைத் தேர்ந்தெடுத்து `` சமர்ப்பி`` ஐ அழுத்தவும். நீங்கள் பின்னர் அமைப்பை மாற்றினால், ஏற்கனவே சேமிக்கப்பட்ட தரவு தரவுத்தளத்தில் இருக்கும்.

source: Store encrypted data only
ta: மறைகுறியாக்கப்பட்ட தரவை மட்டுமே சேமிக்கவும்

source: If you wish to have the patient name and/or ID available for finding studies relating to a specific patient, but do not need to identify who that patient is, then it is possible to create an 'encrypted' version of the ID or name. In this case, a one-way SHA 256 hash is generated and the hash value is stored instead.
ta: ஒரு குறிப்பிட்ட நோயாளி தொடர்பான ஆய்வுகளைக் கண்டுபிடிப்பதற்கு நோயாளியின் பெயர் மற்றும்/அல்லது ஐடியை நீங்கள் பெற விரும்பினால், ஆனால் அந்த நோயாளி யார் என்பதை அடையாளம் காண தேவையில்லை, பின்னர் ஐடி அல்லது பெயரின் 'மறைகுறியாக்கப்பட்ட' பதிப்பை உருவாக்க முடியும். இந்த வழக்கில், ஒரு வழி சா 256 ஆச் உருவாக்கப்பட்டு, அதற்கு பதிலாக ஆச் மதிப்பு சேமிக்கப்படுகிறது.

source: If *exactly* the same name or ID (including spelling, spacing, case etc) occurs more than once, then the same hash will be generated.
ta: * சரியாக * அதே பெயர் அல்லது ஐடி (எழுத்துப்பிழை, இடைவெளி, வழக்கு போன்றவை உட்பட) ஒன்றுக்கு மேற்பட்ட முறை ஏற்பட்டால், அதே ஆச் உருவாக்கப்படும்.

source: The same applies to accession numbers if the option to encrypt the accession number is selected.
ta: அணுகல் எண்ணை குறியாக்க விருப்பம் தேர்ந்தெடுக்கப்பட்டால், அணுகல் எண்களுக்கும் இது பொருந்தும்.

source: Using patient identifiable data
ta: நோயாளி அடையாளம் காணக்கூடிய தரவைப் பயன்படுத்துதல்

source: Querying for patient studies
ta: நோயாளியின் ஆய்வுக்கான வினவல்
