Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: If you want some examples, you can find the DICOM files that we use for the automated testing in the ``openrem/remapp/tests/test_files`` folder in your OpenREM installation.
ta: நீங்கள் சில எடுத்துக்காட்டுகளை விரும்பினால், உங்கள் ஓபன்ரெம் நிறுவலில் `` OpenRem/Remapp/Tests/test_files` கோப்புறையில் தானியங்கு சோதனைக்கு நாங்கள் பயன்படுத்தும் DICOM கோப்புகளை நீங்கள் காணலாம்.

source: Direct from modalities
ta: முறைகளிலிருந்து நேரடியாக

source: For production use, you will either need the modalities to send the RDSR or images directly to your OpenREM server using DICOM, or you will need to use query-retrieve to fetch the DICOM objects from the PACS or the modalities. In either of these situations, you will need to run a DICOM Store service on your OpenREM server.
ta: விளைவாக்கம் பயன்பாட்டிற்கு, RDSR அல்லது படங்களை நேரடியாக உங்கள் OpenREM சேவையகத்திற்கு DICOM ஐப் பயன்படுத்தி அனுப்புவதற்கான முறைகள் உங்களுக்குத் தேவைப்படும், அல்லது PACS அல்லது முறைகளிலிருந்து DICOM பொருள்களைப் பெற வினவல்-மறுமலர்ச்சியைப் பயன்படுத்த வேண்டும். இந்த இரண்டு சூழ்நிலைகளிலும், உங்கள் OpenREM சேவையகத்தில் DICOM STORE சேவையை இயக்க வேண்டும்.

source: DICOM Store
ta: டிகாம் கடை

source: The Orthanc DICOM server is recommended; another store can be used instead but documentation is not provided. Docker installs have the Orthanc server build-in. For non-Docker installs, instructions are included in the main installation documentation:
ta: ஆர்த்தாங்க் டிகாம் சேவையகம் பரிந்துரைக்கப்படுகிறது; அதற்கு பதிலாக மற்றொரு கடையைப் பயன்படுத்தலாம், ஆனால் ஆவணங்கள் வழங்கப்படவில்லை. கப்பல்துறை நிறுவல்களில் ஆர்த்தாங்க் சேவையக உருவாக்கம் உள்ளது. கப்பல்துறை அல்லாத நிறுவல்களுக்கு, முக்கிய நிறுவல் ஆவணத்தில் வழிமுறைகள் சேர்க்கப்பட்டுள்ளன:

source: Linux: :ref:`dicom_store_scp_linux`
ta: லினக்ச் :: குறிப்பு: `dicom_store_scp_linux`

source: Windows: *to be written*
ta: விண்டோச்: *எழுதப்பட வேண்டும் *

source: Query-retrieve from a PACS or similar
ta: ஒரு PACS அல்லது ஒத்ததாக வினவல்-மறுசீரமைப்பு

source: Before you can query-retrieve objects from a remote PACS, you need to do the following:
ta: தொலைநிலை PAC களில் இருந்து பொருள்களை வினவுவதற்கு முன், நீங்கள் பின்வருவனவற்றை செய்ய வேண்டும்:

source: Create a DICOM Store service to receive the DICOM objects - see :ref:`directfrommodalities` above.
ta: DICOM பொருள்களைப் பெற ஒரு DICOM STORE சேவையை உருவாக்கவும் - காண்க: Ref: `ADIrectFrommodalities` மேலே.

source: Configure OpenREM with the settings for the remote query-retrieve server:
ta: தொலைநிலை வினவல்-மறுவடிவமைப்பு சேவையகத்திற்கான அமைப்புகளுடன் OpenRem ஐ உள்ளமைக்கவும்:

source: Configure the settings of your DICOM store service on the PACS
ta: உங்கள் DICOM STORE சேவையின் அமைப்புகளை PAC களில் உள்ளமைக்கவும்

source: Learn how to use it:
ta: அதை எவ்வாறு பயன்படுத்துவது என்பதை அறிக:

source: Importing from DICOM files
ta: DICOM கோப்புகளிலிருந்து இறக்குமதி செய்கிறது

source: If you are using linux, or for Windows if you have put ``C:\Python27\;C:\Python27\Lib\site-packages;C:\Python27\Scripts`` onto your system path, you should be able to import from the command line:
ta: நீங்கள் லினக்சைப் பயன்படுத்துகிறீர்கள் என்றால், அல்லது விண்டோசுக்காக நீங்கள் `சி: \ பைதான் 27 \; சி: \ பைதான் 27 \ லிப் \ தள-தொகுப்புகள்; சி: \ பைதான் 27 \ ச்கிரிப்ட்கள்`` உங்கள் கணினி பாதையில் கட்டளை வரியிலிருந்து இறக்குமதி:

source: Radiation Dose Structured Reports
ta: கதிர்வீச்சு டோச் கட்டமைக்கப்பட்ட அறிக்கைகள்

source: You can use wildcards to process a number of files at once, ie::
ta: ஒரே நேரத்தில் பல கோப்புகளை செயலாக்க நீங்கள் வைல்டு கார்டுகளைப் பயன்படுத்தலாம், அதாவது ::

source: Radiopharmaceutical Radiation Dose Structured Reports
ta: ரேடியோஃபார்மாசூட்டிகல் கதிர்வீச்சு டோச் கட்டமைக்கப்பட்ட அறிக்கைகள்

source: You can use the same import script as for Radiation Dose Structured Reports.
ta: கதிர்வீச்சு டோச் கட்டமைக்கப்பட்ட அறிக்கைகளுக்கு நீங்கள் அதே இறக்குமதி ச்கிரிப்டைப் பயன்படுத்தலாம்.

source: For mammography DICOM images
ta: மேமோகிராஃபி டிகாம் படங்கள்

source: The facility for extracting dose information from mammography DICOM images has been designed and tested with images created with the GE Senographe DS. It has now also been used with the images generated by the following systems:
ta: மேமோகிராஃபி டிகாம் படங்களிலிருந்து டோச் தகவல்களைப் பிரித்தெடுப்பதற்கான வசதி கீ செனோகிராஃப் டி.எச் உடன் உருவாக்கப்பட்ட படங்களுடன் வடிவமைக்கப்பட்டு சோதிக்கப்பட்டுள்ளது. இது இப்போது பின்வரும் அமைப்புகளால் உருவாக்கப்பட்ட படங்களுடனும் பயன்படுத்தப்பட்டுள்ளது:

source: GE Senographe Essential
ta: கீ செனோகிராஃப் அத்தியாவசியமானது

source: Hologic Selenia
ta: ஓலாசிக் செலினியா

source: Siemens Inspiration
ta: சீமென்ச் ஊக்கம்

source: For radiographic DICOM images
ta: ரேடியோகிராஃபிக் டிகாம் படங்களுக்கு

source: For PET/NM DICOM images
ta: PET/NM DICOM படங்களுக்கு

source: Note that more complete information can be loaded from the RRDSRs if available. For PET images the PET series information can be added to the RRDSR data.
ta: கிடைத்தால் மேலும் முழுமையான தகவல்களை RRDSRS இலிருந்து ஏற்ற முடியும் என்பதை நினைவில் கொள்க. PET படங்களுக்கு PET தொடர் தகவல்களை RRDSR தரவுகளில் சேர்க்கலாம்.

source: For CT dose summary files from Philips CT scanners
ta: பிலிப்ச் சி.டி ச்கேனர்களிடமிருந்து சி.டி டோச் சுருக்க கோப்புகளுக்கு

source: This extractor makes use of the information stored in the header data of the Philips Secondary Capture object with a series description of 'Dose Info'. The value inserted into 'Study description' in the OpenREM database is actually taken from the Protocol field. The value in Study description is inserted into the study level comment field in the database, along with the protocol file name and any 'comments on radiation dose'.
ta: இந்த பிரித்தெடுத்தல் பிலிப்ச் இரண்டாம் நிலை பிடிப்பு பொருளின் தலைப்பு தரவுகளில் சேமிக்கப்பட்டுள்ள தகவல்களை 'டோச் செய்தி' என்ற தொடர் விளக்கத்துடன் பயன்படுத்துகிறது. ஓபன்ரெம் தரவுத்தளத்தில் 'ஆய்வு விளக்கம்' இல் செருகப்பட்ட மதிப்பு உண்மையில் நெறிமுறை புலத்திலிருந்து எடுக்கப்பட்டது. ஆய்வு விளக்கத்தில் உள்ள மதிப்பு தரவுத்தளத்தில் உள்ள ஆய்வு நிலை கருத்துத் துறையில், நெறிமுறை கோப்பு பெயர் மற்றும் கதிர்வீச்சு டோச் குறித்த 'கருத்துகள்' ஆகியவற்றுடன் செருகப்படுகிறது.

source: For CT dose summary files from older Toshiba CT scanners
ta: பழைய தோசிபா சி.டி ச்கேனர்களிடமிருந்து சி.டி டோச் சுருக்க கோப்புகளுக்கு

source: This extractor is designed to create a DICOM radiation dose structured report from the information contained in secondary capture dose summary images, supplemented by data stored in image tags. It requires a folder of DICOM objects as input (suitable data can be retrieved from a DICOM node using the ``qrscu.py`` command with the ``-toshiba`` switch - see :ref:`qrcommandlineinterface`). It creates an initial RDSR from the secondary capture dose summary, and then tries to enrich this with additional information contained in image tags. The routine attempts to extract the following information from the image tags and insert it into the initial RDSR:
ta: இந்த பிரித்தெடுத்தல் இரண்டாம் நிலை பிடிப்பு டோச் சுருக்கம் படங்களில் உள்ள தகவல்களிலிருந்து ஒரு DICOM கதிர்வீச்சு டோச் கட்டமைக்கப்பட்ட அறிக்கையை உருவாக்க வடிவமைக்கப்பட்டுள்ளது, இது படக் குறிச்சொற்களில் சேமிக்கப்பட்ட தரவுகளால் கூடுதலாக உள்ளது. இதற்கு DICOM பொருள்களின் கோப்புறை தேவைப்படுகிறது (`` -toshiba`` சுவிட்சுடன் `` qrscu.py`` கட்டளையைப் பயன்படுத்தி ஒரு DICOM முனையிலிருந்து பொருத்தமான தரவை மீட்டெடுக்க முடியும் - பார்க்க: குறிப்பு: `qrcommandlineinterface`). இது இரண்டாம் நிலை பிடிப்பு டோச் சுருக்கத்திலிருந்து ஆரம்ப ஆர்.டி.எச்.ஆரை உருவாக்குகிறது, பின்னர் படக் குறிச்சொற்களில் உள்ள கூடுதல் தகவல்களுடன் இதை வளப்படுத்த முயற்சிக்கிறது. படக் குறிச்சொற்களிலிருந்து பின்வரும் தகவல்களைப் பிரித்தெடுத்து ஆரம்ப RDSR இல் செருகுவதற்கான வழக்கமான முயற்சிகள்:

source: Study-level information
ta: ஆய்வு-நிலை செய்தி

source: Study description
ta: ஆய்வு விளக்கம்

source: Requested procedure description
ta: கோரப்பட்ட நடைமுறை விளக்கம்

source: Software versions
ta: மென்பொருள் பதிப்புகள்

source: Device serial number
ta: சாதன வரிசை எண்

source: Series-level information
ta: தொடர்-நிலை செய்தி

source: Protocol name
ta: நெறிமுறை பெயர்

source: Exposure time (per rotation)
ta: வெளிப்பாடு நேரம் (சுழற்சிக்கு)

source: kVp
ta: கே.வி.பி.

source: Spiral pitch factor
ta: சுழல் சுருதி காரணி

source: Nominal total collimation width
ta: பெயரளவு மொத்த மோதல் அகலம்

source: Nominal single collimation width
ta: பெயரளவு ஒற்றை மோதல் அகலம்

source: Exposure modulation type
ta: வெளிப்பாடு பண்பேற்றம் வகை

source: The routine was developed for older Toshiba CT scanners that cannot create RDSR objects themselves. It is known to work with:
ta: ஆர்.டி.எச்.ஆர் பொருள்களை உருவாக்க முடியாத பழைய தோசிபா சி.டி ச்கேனர்களுக்கு இந்த வழக்கம் உருவாக்கப்பட்டது. இது வேலை செய்வதாக அறியப்படுகிறது:

source: Toshiba CX, software version V4.40ER011
ta: தோசிபா சிஎக்ச், மென்பொருள் பதிப்பு V4.40ER011

source: Toshiba CXL, software version V4.51ER014
ta: தோசிபா சிசிஎல், மென்பொருள் பதிப்பு அங்குலம் .51er014

source: Toshiba CXL, software version V4.86ER008 (this software version can produce RDSR objects directly, but may not populate some fields, such as requested procedure name and study description)
ta: தோசிபா சி.எக்ச்.எல், மென்பொருள் பதிப்பு V4.86ER008 (இந்த மென்பொருள் பதிப்பு RDSR பொருள்களை நேரடியாக உருவாக்க முடியும், ஆனால் கோரப்பட்ட செயல்முறை பெயர் மற்றும் ஆய்வு விளக்கம் போன்ற சில துறைகளை விரிவுபடுத்தக்கூடாது)

source: This extractor has also been used successfully on images from a GE LightSpeed Plus scanner, although in this case no supplementary data is extracted from image tags.
ta: கீ லைட்ச்பீட் பிளச் ச்கேனரிடமிருந்து படங்களிலும் இந்த பிரித்தெடுத்தல் வெற்றிகரமாக பயன்படுத்தப்பட்டுள்ளது, இருப்பினும் இந்த விசயத்தில் படக் குறிச்சொற்களிலிருந்து துணை தரவு எதுவும் பிரித்தெடுக்கப்படவில்லை.

source: Cumulative and continued study RDSRs
ta: ஒட்டுமொத்த மற்றும் தொடர்ச்சியான ஆய்வு RDSRS

source: Background
ta: பின்னணி

source: Cumulative RDSRs
ta: ஒட்டுமொத்த RDSRS

source: Some modalities are configured to send an RDSR after every exposure, with each new RDSR containing a complete record of the examination up to that point. For example, this is what the current version of the Siemens CT scanner software does.
ta: ஒவ்வொரு வெளிப்பாட்டிற்கும் பிறகு ஒரு ஆர்.டி.எச்.ஆரை அனுப்ப சில முறைகள் கட்டமைக்கப்பட்டுள்ளன, ஒவ்வொரு புதிய ஆர்.டி.எச்.ஆரும் தேர்வின் முழுமையான பதிவைக் கொண்டுள்ளது. எடுத்துக்காட்டாக, சீமென்ச் சி.டி ச்கேனர் மென்பொருளின் தற்போதைய பதிப்பு இதைத்தான் செய்கிறது.

source: Continued study RDSRs
ta: தொடர்ச்சியான ஆய்வு RDSRS

source: On most systems the RDSR is sent when the study is completed. If the study is then restarted, the system must create a new RDSR. On a Siemens CT system, this new RDSR will have the same Study Instance UID and the same accession number, but the content will only refer to the continued study, not the original study.
ta: ஆய்வு முடிந்ததும் பெரும்பாலான அமைப்புகளில் ஆர்.டி.எச்.ஆர் அனுப்பப்படுகிறது. ஆய்வு மறுதொடக்கம் செய்யப்பட்டால், கணினி ஒரு புதிய RDSR ஐ உருவாக்க வேண்டும். ஒரு சீமென்ச் சி.டி அமைப்பில், இந்த புதிய ஆர்.டி.எச்.ஆருக்கு அதே ஆய்வு நிகழ்வு யுஐடி மற்றும் அதே அணுகல் எண்ணைக் கொண்டிருக்கும், ஆனால் உள்ளடக்கம் தொடர்ச்சியான ஆய்வை மட்டுமே குறிக்கும், அசல் ஆய்வு அல்ல.

source: Pre-0.8.0 OpenREM behaviour
ta: முன் -0.8.0 ஓபன்ரெம் நடத்தை

source: Prior to release 0.8.0, OpenREM would check the Study Instance UID on import and check the value against the existing studies in the database. If a match was found, then the new RDSR was rejected on the basis that it must be a duplicate.
ta: 0.8.0 ஐ வெளியிடுவதற்கு முன்பு, ஓபன்ரெம் இறக்குமதியில் ஆய்வு நிகழ்வை சரிபார்த்து, தரவுத்தளத்தில் இருக்கும் ஆய்வுகளுக்கு எதிரான மதிப்பை சரிபார்க்கும். ஒரு போட்டி கண்டுபிடிக்கப்பட்டால், புதிய ஆர்.டி.எச்.ஆர் அது ஒரு நகலாக இருக்க வேண்டும் என்ற அடிப்படையில் நிராகரிக்கப்பட்டது.

source: This would therefore ignore both cumulative and continued study RDSRs which means your database might be filled with single event studies, and you won't have details of any continued studies.
ta: எனவே இது ஒட்டுமொத்த மற்றும் தொடர்ச்சியான ஆய்வு RDSRS இரண்டையும் புறக்கணிக்கும், அதாவது உங்கள் தரவுத்தளம் ஒற்றை நிகழ்வு ஆய்வுகளால் நிரப்பப்படலாம், மேலும் தொடர்ச்சியான ஆய்வுகள் உங்களுக்கு விவரங்கள் இருக்காது.

source: Current OpenREM behaviour
ta: தற்போதைய ஓபன்ரெம் நடத்தை

source: New imports
ta: புதிய இறக்குமதி

source: On import of the first RDSR in a study, the SOP Instance UID of the RDSR is recorded with the study. This is an ID that is unique to that RDSR object - any further RDSRs might have the same Study Instance UID, but will always have a different SOP Instance UID.
ta: ஒரு ஆய்வில் முதல் ஆர்.டி.எச்.ஆரின் இறக்குமதியில், ஆர்.டி.எச்.ஆரின் சோப் நிகழ்வு UID ஆய்வில் பதிவு செய்யப்பட்டுள்ளது. இது அந்த RDSR பொருளுக்கு தனித்துவமான ஒரு ஐடி - மேலும் எந்தவொரு RDSR களும் ஒரே ஆய்வு நிகழ்வைக் கொண்டிருக்கலாம், ஆனால் எப்போதும் வேறுபட்ட சோப் நிகழ்வு UID இருக்கும்.

source: When the second RDSR is imported, the duplicate StudyInstanceUID will trigger OpenREM to check the SOP Instance UID of the new RDSR against the one(s) stored with that study. If there is a match, the new RDSR is ignored as it has already been processed. If it does not match, then the Irradiation Event UID of each exposure in the new RDSR is compared to the Irradiation Event UIDs already in the database for that study, to establish if the new RDSR carries new information that should be imported.
ta: இரண்டாவது ஆர்.டி.எச்.ஆர் இறக்குமதி செய்யப்படும்போது, ​​அந்த ஆய்வில் சேமிக்கப்பட்ட ஒரு (கள்) க்கு எதிராக புதிய ஆர்.டி.எச்.ஆரின் எச்ஓபி நிகழ்வு யுஐடியை சரிபார்க்க நகல் ச்டடீசின்டான்சுயிட் ஓபன்ரெமைத் தூண்டும். ஒரு போட்டி இருந்தால், புதிய ஆர்.டி.எச்.ஆர் ஏற்கனவே செயலாக்கப்பட்டதால் புறக்கணிக்கப்படுகிறது. இது பொருந்தவில்லை என்றால், புதிய ஆர்.டி.எச்.ஆரில் உள்ள ஒவ்வொரு வெளிப்பாட்டின் கதிர்வீச்சு நிகழ்வு யுஐடி, அந்த ஆய்வுக்காக ஏற்கனவே தரவுத்தளத்தில் உள்ள கதிர்வீச்சு நிகழ்வு யுஐடிஎச் உடன் ஒப்பிடப்படுகிறது, புதிய ஆர்.டி.எச்.ஆர் இறக்குமதி செய்யப்பட வேண்டிய புதிய தகவல்களைக் கொண்டிருக்கிறதா என்பதை நிறுவ.

source: In the case of a cumulative RDSR that is sent after each event, the original study is deleted from the database and is replaced by the newer one if it has additional events.
ta: ஒவ்வொரு நிகழ்விற்கும் பிறகு அனுப்பப்படும் ஒரு ஒட்டுமொத்த ஆர்.டி.எச்.ஆரின் விசயத்தில், அசல் ஆய்வு தரவுத்தளத்திலிருந்து நீக்கப்பட்டு, கூடுதல் நிகழ்வுகள் இருந்தால் புதியது மாற்றப்படும்.

source: In the case of a continued study RDSR which has a completely different set of events, the new RDSR is imported alongside the existing one.
ta: முற்றிலும் மாறுபட்ட நிகழ்வுகளைக் கொண்ட தொடர்ச்சியான ஆய்வு ஆர்.டி.எச்.ஆரின் விசயத்தில், புதிய ஆர்.டி.எச்.ஆர் தற்போதுள்ள ஒன்றோடு இறக்குமதி செய்யப்படுகிறது.

source: Existing studies imported before 0.8.0
ta: தற்போதுள்ள ஆய்வுகள் 0.8.0 க்கு முன் இறக்குமதி செய்யப்பட்டுள்ளன

source: RDSRs imported before upgrading to 0.8.0 will not have the SOP Instance UID recorded in the database and so the new RDSR will be compared at event level with the existing study before making an import decision, as with new studies.
ta: 0.8.0 க்கு மேம்படுத்தப்படுவதற்கு முன்னர் இறக்குமதி செய்யப்படும் ஆர்.டி.எச்.ஆர்.எச் தரவுத்தளத்தில் பதிவுசெய்யப்பட்ட சோப் நிகழ்வு UID ஐக் கொண்டிருக்காது, எனவே புதிய RDSR புதிய ஆய்வுகளைப் போலவே இறக்குமதி முடிவை எடுப்பதற்கு முன் நிகழ்வு மட்டத்தில் இருக்கும் ஆய்வுடன் ஒப்பிடப்படும்.

source: Fixing existing studies
ta: இருக்கும் ஆய்வுகளை சரிசெய்தல்

source: Importing from file
ta: கோப்பிலிருந்து இறக்குமதி

source: If you are have a store of the RDSRs that were previously rejected, import them all again and this time they should be processed properly.
ta: முன்னர் நிராகரிக்கப்பட்ட ஆர்.டி.எச்.ஆர்களின் கடை உங்களிடம் இருந்தால், அவை அனைத்தையும் மீண்டும் இறக்குமதி செய்கின்றன, இந்த நேரத்தில் அவை சரியாக செயலாக்கப்பட வேண்டும்.

source: For example on my system, using linux, each scanner started sending per-exposure RDSRs from the date they were upgraded. I found the RDSRs from that date to the date I upgraded OpenREM and imported them:
ta: எடுத்துக்காட்டாக, எனது கணினியில், லினக்சைப் பயன்படுத்தி, ஒவ்வொரு ச்கேனரும் அவை மேம்படுத்தப்பட்ட தேதியிலிருந்து ஒரு வெளிப்பாடு RDSR களை அனுப்பத் தொடங்கின. அந்த தேதியிலிருந்து நான் OpenRem ஐ மேம்படுத்தி இறக்குமதி செய்த தேதி வரை RDSRS ஐக் கண்டேன்:

source: Importing via query-retrieve
ta: வினவல்-மறுபயன்பாடு வழியாக இறக்குமதி செய்தல்

source: The query-retrieve duplicates processing has been updated to compare SOP Instance UIDs returned by the remote node (the PACS) with the SOP Instance UIDs stored with each study in OpenREM. Therefore, after an initial import of each RDSR in your search, any subsequent query should drop any RDSRs that have previously been processed and not move them a second time.
ta: வினவல்-மறுபயன்பாட்டு நகல் செயலாக்கம் ரிமோட் முனையால் (பிஏசிஎச்) திரும்பிய எச்ஓபி நிகழ்வு யுஐடிகளை ஒப்பிட்டுப் பார்க்க புதுப்பிக்கப்பட்டுள்ளது. ஆகையால், உங்கள் தேடலில் ஒவ்வொரு ஆர்.டி.எச்.ஆரின் ஆரம்ப இறக்குமதிக்குப் பிறகு, எந்தவொரு அடுத்தடுத்த வினவலும் முன்னர் செயலாக்கப்பட்ட எந்த ஆர்.டி.எச்.ஆர்களையும் கைவிட வேண்டும், அவற்றை இரண்டாவது முறையாக நகர்த்தக்கூடாது.

source: Welcome to OpenREM's documentation
ta: ஓபன்ரெமின் ஆவணங்களுக்கு வருக

source: OpenREM logo
ta: பொது ஒன்ட்

source: OpenREM is a free, open source application for patient radiation dose monitoring. The software is capable of importing and displaying data from a wide variety of x-ray dose related sources with filtering, charts and analysis. The software also enables easy export of the data in a form that is suitable for further analysis by suitably qualified medical physics personnel.
ta: ஓபன்ரெம் என்பது நோயாளியின் கதிர்வீச்சு டோச் கண்காணிப்புக்கான இலவச, திறந்த மூல பயன்பாடாகும். இந்த மென்பொருள் வடிகட்டுதல், விளக்கப்படங்கள் மற்றும் பகுப்பாய்வு ஆகியவற்றுடன் பல்வேறு வகையான எக்ச்ரே டோச் தொடர்பான மூலங்களிலிருந்து தரவை இறக்குமதி செய்து காண்பிக்கும் திறன் கொண்டது. பொருத்தமான தகுதி வாய்ந்த மருத்துவ இயற்பியல் பணியாளர்களால் மேலதிக பகுப்பாய்விற்கு ஏற்ற வடிவத்தில் தரவை எளிதாக ஏற்றுமதி செய்ய மென்பொருள் உதவுகிறது.

source: Please see `openrem.org <https://openrem.org>`_ for more details.
ta: மேலும் விவரங்களுக்கு `OpenRem.org <https://openrem.org> _ _ ஐப் பார்க்கவும்.

source: These docs are for the version of OpenREM currently in development. For the current release version, see https://docs.openrem.org/
ta: இந்த டாக்ச் தற்போது வளர்ச்சியில் உள்ள ஓபன்ரெமின் பதிப்பிற்காக உள்ளது. தற்போதைய வெளியீட்டு பதிப்பிற்கு, https://docs.openrem.org/ ஐப் பார்க்கவும்

source: These docs are in British English - if you want to help translate them into other languages please get in touch: `@_OpenREM <https://twitter.com/_OpenREM>`_, `Bitbucket <https://bitbucket.org/openrem/openrem/issues/855/add-other-languages-as-people-volunteer>`_, `Google Groups <mailto:openrem@googlegroups.com>`_ or head over to `Weblate <https://hosted.weblate.org/projects/openrem/>`_ to get started. More details: :doc:`translations`.
ta: இந்த ஆவணங்கள் பிரிட்டிச் ஆங்கிலத்தில் உள்ளன - அவற்றை பிற மொழிகளில் மொழிபெயர்க்க உதவ விரும்பினால் தயவுசெய்து தொடர்பு கொள்ளவும்: `@_openrem <https://twitter.com/_openrem>` _, `பிட்பக்கெட் <https://bitbucket.org/ OpenRem/OpenRem/சிக்கல்கள்/855/add-amporangages- people-volunteer> `_,` கூகிள் குழுக்கள் <அஞ்சல்: openrem@googlegroups.com> `_ அல்லது` வலைபெயர்ப்பு <https: // ஓச்டுக்குச் செல்லுங்கள். தொடங்குவதற்கு weblate.org/projects/openrem/>`_. மேலும் விவரங்கள் :: டாக்: `மொழிபெயர்ப்புகள்`.

source: Docker install
ta: கப்பல்துறை நிறுவல்

source: Install Docker and Docker Compose (may be installed automatically with Docker)
ta: கப்பல்துறை மற்றும் கப்பல்துறை இசையமைப்பை நிறுவவும் (டோக்கருடன் தானாக நிறுவப்படலாம்)

source: Download https://bitbucket.org/openrem/docker/get/develop.zip
ta: Https://bitbucket.org/openrem/docker/get/develop.zip ஐப் பதிவிறக்கவும்

source: Install
ta: நிறுவவும்

source: Extract the ZIP file and open a shell (command prompt) in the new folder
ta: சிப் கோப்பைப் பிரித்தெடுத்து புதிய கோப்புறையில் செல் (கட்டளை வரியில்) திறக்கவும்

source: Customise variables in the following two files:
ta: பின்வரும் இரண்டு கோப்புகளில் தனிப்பயன் மாறிகள்:

source: the ``orthanc_1`` section of ``docker-compose.yml``
ta: `` docker-compose.yml`` இன் `` ஆர்த்தாங்க்_1`` பிரிவு

source: If you are using SELinux, you will also need to edit the nginx and orthanc bind mounts in ``docker-compose.yml``
ta: நீங்கள் செலினக்ச் பயன்படுத்துகிறீர்கள் என்றால், நீங்கள் nginx மற்றும் ஆர்த்தாங்க் பிணைப்பு ஏற்றங்களை `` டோக்கர்-கம்ப்.ஒய்எம்எல்`` இல் திருத்த வேண்டும்

source: A full description of the options are found in:
ta: விருப்பங்களின் முழு விளக்கம் இதில் காணப்படுகிறது:

source: Start the containers with:
ta: இதனுடன் கொள்கலன்களைத் தொடங்கவும்:

source: Get the database and translations ready:
ta: தரவுத்தளத்தையும் மொழிபெயர்ப்புகளையும் ஆயத்தம் செய்யுங்கள்:

source: Open a web browser and go to http://localhost/
ta: ஒரு வலை உலாவியைத் திறந்து http: // localhost/க்குச் செல்லவும்

source: If you want to run the OpenREM in a virtual directory (like http://server/dms/) there is further configuration to be done - go to :doc:`virtual_directory`.
ta: நீங்கள் ஒரு மெய்நிகர் கோப்பகத்தில் ஓபன்ரெமை இயக்க விரும்பினால் (http: // server/dms/போன்றவை) மேலும் உள்ளமைவு செய்யப்பட வேண்டும் - இதற்குச் செல்லுங்கள்: doc: `virtual_directory`.

source: Native Linux install
ta: சொந்த லினக்ச் நிறுவல்

source: **Document not ready for translation**
ta: ** ஆவணம் மொழிபெயர்ப்புக்கு தயாராக இல்லை **

source: This install is based on Ubuntu 22.04 using:
ta: இந்த நிறுவல் உபுண்டு 22.04 ஐப் பயன்படுத்துகிறது:

source: Python 3.10 running in a virtualenv
ta: பைதான் 3.10 ஒரு மெய்நிகர்இன்வில் இயங்குகிறது

source: Database: PostgreSQL
ta: தரவுத்தளம்: postgresql

source: DICOM Store SCP: Orthanc running on port 104
ta: DICOM STOR SCP: துறைமுகம் 104 இல் ஆர்த்தாங்க் இயங்குகிறது

source: Webserver: NGINX with Gunicorn
ta: வெப்சர்வர்: கன்னிகார்னுடன் nginx

source: All OpenREM files in ``/var/dose/`` with group owner of ``openrem``
ta: ``/Var/dose/`` இல் உள்ள அனைத்து OpenRem கோப்புகளும் `` OpenRem`` இன் குழு உரிமையாளருடன்

source: Collects any Physics (QA) images and zips them
ta: எந்த இயற்பியல் (QA) படங்களையும் சேகரித்து அவற்றை சிப் செய்கிறது

source: The instructions should work for Ubuntu 20.04 too, references to jammy will be focal instead.
ta: அறிவுறுத்தல்கள் உபுண்டு 20.04 க்கும் வேலை செய்ய வேண்டும், அதற்கு பதிலாக சம்மி பற்றிய குறிப்புகள் குவியலாக இருக்கும்.

source: There are various commands and paths that reference the Python version 3.10 in these instructions. If you are using Python 3.8 or Python 3.9 then these will need to be modified accordingly.
ta: இந்த வழிமுறைகளில் பைதான் பதிப்பு 3.10 ஐக் குறிக்கும் பல்வேறு கட்டளைகள் மற்றும் பாதைகள் உள்ளன. நீங்கள் பைதான் 3.8 அல்லது பைதான் 3.9 ஐப் பயன்படுத்துகிறீர்கள் என்றால், இவை அதற்கேற்ப மாற்றப்பட வேண்டும்.

source: If you are upgrading an existing installation to a new Linux server, go to the :doc:`upgrade_linux_new_server` docs first.
ta: நீங்கள் ஏற்கனவே உள்ள நிறுவலை புதிய லினக்ச் சேவையகத்திற்கு மேம்படுத்தினால், TOC: `UPGRADE_LINUX_NEW_SERVER` டாக்சுக்குச் செல்லவும்.

source: If you are installing OpenREM on a Linux server with limited internet access, go to the :doc:`install_offline` docs.
ta: வரையறுக்கப்பட்ட இணைய அணுகலுடன் லினக்ச் சேவையகத்தில் ஓபன்ரெமை நிறுவுகிறீர்கள் என்றால், TOC: `Install_offline` டாக்சுக்குச் செல்லவும்.

source: If you are installing on a different Linux OS you can adapt these instructions or consider using a :doc:`install_docker` instead.
ta: நீங்கள் வேறு லினக்ச் ஓஎச்சில் நிறுவினால், இந்த வழிமுறைகளை மாற்றியமைக்கலாம் அல்லது ஒரு: டாக்: `நிறுவல்_டோகர்` ஐப் பயன்படுத்தலாம்.

source: Initial prep
ta: தொடக்க தயாரிப்பு

source: Install apt packages
ta: APT தொகுப்புகளை நிறுவவும்

source: **Apt sources**
ta: ** பொருத்தமான ஆதாரங்கள் **

source: We will need the ``universe`` repository enabled. Check first:
ta: எங்களுக்கு `` யுனிவர்ச்` `களஞ்சியம் தேவைப்படும். முதலில் சரிபார்க்கவும்:

source: Look for::
ta: பாருங்கள் ::
