Repository: 247i/TACETr
Catalog: உரை/தானி/opentracks-opentracks-src-main-res-values-strings-xml-main-*.po
Languages: ta

# sensor_could_not_scan
source: Could not scan for Bluetooth devices (error %1$i).
ta: ஊடலை சாதனங்களுக்கு ச்கேன் செய்ய முடியவில்லை (பிழை %1$i).

# bluetooth_disabled
source: Please enable Bluetooth.
ta: ப்ளூடூத்தை இயக்கவும்.

# settings_defaults_title
source: Default Units and Activity
ta: இயல்புநிலை அலகுகள் மற்றும் செயல்பாடு

# settings_defaults_summary
source: Preferred Units, Default Activity, Track Default Name
ta: விருப்பமான அலகுகள், இயல்புநிலை செயல்பாடு, இயல்புநிலை பெயரைக் கண்காணிக்கவும்

# settings_ui_title
source: User Interface
ta: பயனர் இடைமுகம்

# settings_ui_summary
source: Appearance, Recording Layout, Theme
ta: தோற்றம், பதிவு செய்யும் தளவமைப்பு, கருப்பொருள்

# settings_gps_sensor
source: GPS
ta: உலக இடம் காட்டும் அமைப்பு

# settings_gps_summary
source: Time interval, Distance interval, Max Distance, Accuracy
ta: நேர இடைவெளி, தூர இடைவெளி, அதிகபட்ச தூரம், துல்லியம்

# settings_sensors_title
source: Sensors
ta: சென்சார்கள்

# settings_sensors_summary
source: Cycling Sensors, Wheel Circumference, Running Sensors
ta: சைக்கிள் ஓட்டுதல் சென்சார்கள், சக்கர சுற்றளவு, இயங்கும் சென்சார்கள்

# settings_announcements_idle_category_title
source: Idle Announcements
ta: செயலற்ற அறிவிப்புகள்

# settings_announcements_idle_title
source: Idle
ta: நிலையிக்கம்

# settings_announcements_statistics_title
source: Statistics Announcements
ta: புள்ளிவிவர அறிவிப்புகள்

# settings_announcements_summary
source: Time, Distance, Voice Speed
ta: நேரம், தூரம், குரல் விரைவு

# settings_import_export_title
source: Import and Export
ta: இறக்குமதி மற்றும் ஏற்றுமதி

# settings_import_export_summary
source: Import, Export, Auto Export
ta: இறக்குமதி, ஏற்றுமதி, ஆட்டோ ஏற்றுமதி

# settings_units_category
source: Units
ta: அலகுகள்

# settings_activity_defaults_category
source: Activity's Defaults
ta: செயல்பாட்டின் இயல்புநிலை

# settings_reset_summary
source: Reset Settings to Default Values
ta: இயல்புநிலை மதிப்புகளுக்கு அமைப்புகளை மீட்டமைக்கவும்

# settings_advanced
source: Advanced
ta: மேம்பட்ட

# settings_default_trackfileformat
source: Export/sharing file format
ta: கோப்பு வடிவம் ஏற்றுமதி/பகிர்வு

# settings_export_filename_title
source: Format of the filename
ta: கோப்பு பெயரின் வடிவம்

# settings_chart_by_distance
source: By distance
ta: தூரம் மூலம்

# settings_chart_by_time
source: By time
ta: நேரம் மூலம்

# settings_charts_title
source: Charts
ta: விளக்கப்படங்கள்

# settings_chart_display_elevation_title
source: Display elevation
ta: றிந்த உயரத்தைக் காண்பி

# settings_chart_display_pace_or_speed_title
source: Display pace or speed
ta: விரைவு அல்லது வேகத்தைக் காண்பி

# settings_chart_display_heart_rate_title
source: Display heart rate
ta: இதய துடிப்பைக் காண்பி

# settings_recording_title
source: Recording
ta: பதிவு

# settings_theme_switch_restart
source: Theme changes may require a manual restart.
ta: கருப்பொருள் மாற்றங்களுக்கு கையேடு மறுதொடக்கம் தேவைப்படலாம்.

# settings_ui_dynamic_colors_title
source: Dynamic Colors
ta: மாறும் வண்ணங்கள்

# settings_ui_dynamic_colors_summary
source: Use user-defined Dynamic Colors (Android 12+ only; requires a manual restart)
ta: பயனர் வரையறுக்கப்பட்ட மாறும் வண்ணங்களைப் பயன்படுத்தவும் (Android 12+ மட்டும்; கையேடு மறுதொடக்கம் தேவை)

# settings_recording_customize_layout_title
source: Customize your recording layout
ta: உங்கள் பதிவு தளவமைப்பைத் தனிப்பயனாக்குங்கள்

# settings_recording_customize_layout_select_columns
source: Data fields per row
ta: ஒரு வரிசையில் தரவு புலங்கள்

# settings_recording_show_on_lockscreen_while_recording_title
source: Show statistics on lockscreen
ta: பூட்டு திரையில் புள்ளிவிவரங்களைக் காட்டு

# settings_recording_show_on_lockscreen_while_recording_summary
source: While recording, show statistics without unlocking the device.
ta: பதிவு செய்யும் போது, சாதனத்தைத் திறக்காமல் புள்ளிவிவரங்களைக் காட்டுங்கள்.

# settings_recording_keep_screen_on_while_recording_title
source: Keep screen on
ta: திரையை தொடர்ந்து வைத்திருங்கள்

# settings_recording_keep_screen_on_while_recording_summary
source: While recording, keep the screen on.
ta: பதிவு செய்யும் போது, திரையை வைத்திருங்கள்.

# settings_recording_fullscreen_on_while_recording_title
source: Fullscreen
ta: முழு திரை

# settings_recording_fullscreen_on_while_recording_summary
source: While recording, present in fullscreen.
ta: பதிவு செய்யும் போது, முழுத்திரையில் இருக்கும்.

# settings_recording_show_gps_disabled_warning_title
source: GPS disabled warning
ta: சி.பி.எச் முடக்கப்பட்ட முன்னறிவிப்பு

# settings_recording_show_gps_disabled_warning_summary
source: While recording, show a warning if GPS is disabled.
ta: பதிவு செய்யும் போது, ​​சி.பி.எச் முடக்கப்பட்டிருந்தால் ஒரு எச்சரிக்கையைக் காட்டுங்கள்.

# settings_recording_default_activity_title
source: Default activity type
ta: இயல்புநிலை செயல்பாட்டு வகை

# settings_recording_location_frequency_summary
source: %1$s between location checks
ta: இருப்பிட சோதனைகளுக்கு இடையில் %1$s

# settings_recording_max_recording_distance_summary
source: A new segment is created if the distance between two locations is greater than %1$s
ta: இரண்டு இடங்களுக்கு இடையிலான தூரம் %1$s ஐ விட அதிகமாக இருந்தால் ஒரு புதிய பிரிவு உருவாக்கப்படுகிறது

# settings_recording_max_recording_distance_title
source: Max distance
ta: அதிகபட்ச தூரம்

# settings_recording_min_recording_distance_title
source: Recording distance interval
ta: தூர இடைவெளி பதிவு

# settings_recording_min_recording_interval_title
source: Recording time interval
ta: நேர இடைவெளி பதிவு

# settings_recording_min_required_accuracy_summary
source: Location is ignored if its accuracy is greater than %1$s
ta: அதன் துல்லியம் %1$s ஐ விட அதிகமாக இருந்தால் இடம் புறக்கணிக்கப்படுகிறது

# settings_recording_min_required_accuracy_title
source: GPS accuracy
ta: சி.பி.எச் துல்லியம்

# settings_recording_track_name_date_iso_8601_option
source: Date (ISO 8601)
ta: தேதி (ஐஎச்ஓ 8601)

# settings_recording_track_name_date_local_option
source: Date (local)
ta: தேதி (உள்ளூர்)

# settings_recording_track_name_number_option
source: Number
ta: எண்

# settings_recording_track_name_title
source: Default track name
ta: இயல்புநிலை பாடல் பெயர்

# settings_recording_idle_timeout_title
source: Idle threshold
ta: செயலற்ற வாசல்

# settings_locale_title
source: Language
ta: மொழி

# settings_locale_system_default
source: System default
ta: கணினி இயல்புநிலை

# settings_night_mode_title
source: UI Theme
ta: இடைமுகம் கருப்பொருள்

# settings_night_mode_option_system
source: System
ta: மண்டலம்

# settings_night_mode_option_day
source: Day
ta: நாள்

# settings_night_mode_option_night
source: Night
ta: இரவு

# settings_night_mode_option_night_oled
source: Night (OLED friendly)
ta: இரவு (OLED நட்பு)

# settings_announcements_totaltime_frequency
source: Time interval
ta: நேர இடைவெளி

# settings_announcements_distance_frequency
source: Lap length
ta: மடியில் நீளம்

# settings_announcements_average_heart_rate
source: Average heart rate
ta: சராசரி இதய துடிப்பு

# settings_announcements_lap_heart_rate
source: Lap heart rate
ta: மடியில் இதய துடிப்பு

# settings_announcements_average_speed_pace
source: Average speed/pace
ta: சராசரி வேகம்/வேகம்

# settings_announcements_lap_speed_pace
source: Lap speed/pace
ta: மடியில் வேகம்/வேகம்

# settings_announcements_unit
source: Distance/speed unit
ta: தூரம்/வேக அலகு

# custom_layout_list_title
source: Layouts
ta: தளவமைப்புகள்

# custom_layout_list_edit_name
source: Type layout's name to add
ta: சேர்க்க தளவமைப்பின் பெயரைத் தட்டச்சு செய்க

# custom_layout_list_edit_already_exists
source: Layout's name already exists
ta: தளவமைப்பின் பெயர் ஏற்கனவே உள்ளது

# custom_layout_list_layout_removed
source: Layout was removed
ta: தளவமைப்பு அகற்றப்பட்டது

# custom_layout_select_layout
source: Select Layout
ta: தளவமைப்பு என்பதைத் தேர்ந்தெடுக்கவும்

# stats_custom_layout_default_layout
source: Default Layout
ta: இயல்புநிலை தளவமைப்பு

# settings_layout_reset
source: Reset Custom Layout
ta: தனிப்பயன் தளவமைப்பை மீட்டமைக்கவும்

# settings_layout_reset_confirm_message
source: All layout settings will be reverted to the default values. This will not delete any tracks on the device.
ta: அனைத்து தளவமைப்பு அமைப்புகளும் இயல்புநிலை மதிப்புகளுக்கு மாற்றப்படும். இது சாதனத்தில் எந்த தடங்களையும் நீக்காது.

# settings_layout_reset_confirm_title
source: Reset your layouts?
ta: உங்கள் தளவமைப்புகளை மீட்டமைக்கவா?

# settings_layout_reset_done
source: All layout settings have been reverted to the default values
ta: அனைத்து தளவமைப்பு அமைப்புகளும் இயல்புநிலை மதிப்புகளுக்கு மாற்றப்பட்டுள்ளன

# settings_all_reset
source: Reset
ta: மீட்டமை

# settings_reset_confirm_message
source: All settings will be reverted to the default values. This will not delete any tracks on the device.
ta: அனைத்து அமைப்புகளும் இயல்புநிலை மதிப்புகளுக்கு மாற்றப்படும். இது சாதனத்தில் எந்த தடங்களையும் நீக்காது.

# settings_reset_confirm_title
source: Reset now?
ta: இப்போது மீட்டமைக்கவா?

# settings_reset_done
source: All settings have been reverted to the default values
ta: அனைத்து அமைப்புகளும் இயல்புநிலை மதிப்புகளுக்கு மாற்றப்பட்டுள்ளன

# settings_generic_sensor
source: Generic
ta: பொதுவான

# settings_cycling_sensor
source: Cycling
ta: சைக்கிள் ஓட்டுதல்

# settings_running_sensor
source: Running
ta: இயங்கும்

# settings_sensor_cycling_distance_speed
source: Distance and Speed
ta: தூரம் மற்றும் விரைவு

# settings_sensor_cycling_cadence
source: Cadence
ta: காடென்ச்

# settings_sensor_running_speed_and_cadence
source: Distance, Speed, and Cadence
ta: தூரம், விரைவு மற்றும் கேடென்ச்

# settings_sensor_wheel_circumference
source: Wheel Circumference (mm)
ta: சக்கரம் சுற்றளவு (மிமீ)

# settings_sensor_bluetooth_service_filter_title
source: Filter Bluetooth Devices
ta: ஊடலை சாதனங்களை வடிகட்டவும்

# settings_sensor_bluetooth_service_filter_on
source: Only show Bluetooth devices that announce required services
ta: தேவையான சேவைகளை அறிவிக்கும் ஊடலை சாதனங்களை மட்டுமே காட்டு

# settings_sensor_bluetooth_service_filter_off
source: Show all discoverable Bluetooth devices
ta: கண்டறியக்கூடிய அனைத்து ஊடலை சாதனங்களையும் காட்டு

# settings_sensor_heart_rate_max
source: Zones: maximum Heart rate (bpm)
ta: மண்டலங்கள்: அதிகபட்ச இதய துடிப்பு (பிபிஎம்)

# settings_stats_rate_title
source: Preferred rate
ta: விருப்பமான வீதம்

# settings_stats_units_imperial
source: Imperial (mi, ft)
ta: இம்பீரியல் (எம்ஐ, அடி)

# settings_stats_units_imperial_meter
source: Imperial (mi, m)
ta: இம்பீரியல் (மி, மீ)

# settings_stats_units_metric
source: Metric (km, m)
ta: மெட்ரிக் (கிமீ, மீ)

# settings_stats_units_nautical
source: Nautical (NM, ft)
ta: கடல் (என்.எம், அடி)

# settings_stats_units_title
source: Preferred units
ta: விருப்பமான அலகுகள்

# settings_api_title
source: Public API
ta: பொது பநிஇ

# settings_api_summary
source: Remote control and statistics API for other apps
ta: மற்ற பயன்பாடுகளுக்கான தொலை கட்டுப்பாடு மற்றும் புள்ளிவிவர பநிஇ

# settings_public_api_package_title
source: Package name for Public API
ta: பொது பநிஇ க்கான தொகுப்பு பெயர்

# settings_public_api_enabled_title
source: Public API
ta: பொது பநிஇ

# settings_public_api_enabled_summary_on
source: Other installed applications can start or stop recordings.
ta: நிறுவப்பட்ட பிற பயன்பாடுகள் பதிவுகளைத் தொடங்கலாம் அல்லது நிறுத்தலாம்.

# settings_public_api_enabled_summary_off
source: Only OpenTracks can start and stop recordings.
ta: ஓபன்ட்ராக்ச் மட்டுமே பதிவுகளைத் தொடங்கலாம் மற்றும் நிறுத்த முடியும்.

# settings_public_api_disabled_toast
source: OpenTracks Public API is disabled: it can be enabled in the settings.
ta: Opentracks பொது பநிஇ முடக்கப்பட்டுள்ளது: இதை அமைப்புகளில் இயக்க முடியும்.

# settings_public_api_dashboard_enabled_title
source: Automatic data transfer
ta: தானியங்கி தரவு பரிமாற்றம்

# settings_public_api_dashboard_enabled_summary_on
source: An application that started a recording can also access the recorded data.
ta: பதிவைத் தொடங்கிய பயன்பாடு பதிவு செய்யப்பட்ட தரவையும் அணுகலாம்.

# settings_public_api_dashboard_enabled_summary_off
source: Recorded data will not be shared automatically with other applications.
ta: பதிவுசெய்யப்பட்ட தரவு மற்ற பயன்பாடுகளுடன் தானாக பகிரப்படாது.

# settings_import_section
source: Import
ta: இறக்குமதி

# settings_export_section
source: Export
ta: ஏற்றுமதி

# settings_prevent_reimport_tracks_title
source: Prevent re-import of tracks
ta: தடங்களை மீண்டும் இறக்குமதி செய்வதைத் தடுக்கவும்

# share_track_share_file_body
source: I think you might be interested in this track. %1$s
ta: இந்த பாதையில் நீங்கள் ஆர்வமாக இருக்கலாம் என்று நினைக்கிறேன். %1$s

# share_track_subject
source: I would like to share a track with you
ta: நான் உங்களுடன் ஒரு பாதையைப் பகிர்ந்து கொள்ள விரும்புகிறேன்

# stats_average_moving_pace
source: Avg moving pace
ta: ஏ.வி.சி நகரும் விரைவு

# stats_average_moving_speed
source: Avg moving speed
ta: ஏ.வி.சி நகரும் விரைவு

# stats_average_pace
source: Avg pace
ta: ஏ.வி.சி விரைவு

# stats_average_speed
source: Avg speed
ta: ஏ.வி.சி விரைவு

# stats_altitude
source: Elevation
ta: உயர்வு ரேகை

# stats_fastest_pace
source: Fastest pace
ta: வேகமான விரைவு

# stats_gain
source: Gain
ta: பெருக்கம்

# stats_loss
source: Loss
ta: இழப்பு

# stats_gain_loss
source: Gain & Loss
ta: ஆதாயம் & இழப்பு

# stats_coordinates
source: Latitude/Longitude
ta: அட்சரேகை/தீர்க்கரேகை

# stats_latitude
source: Latitude
ta: அகலாங்கு

# stats_longitude
source: Longitude
ta: நெட்டாங்கு

# stats_max_speed
source: Max speed
ta: அதிகபட்ச விரைவு

# stats_moving_time
source: Moving time
ta: நகரும் நேரம்

# stats_pace
source: Pace
ta: விரைவு

# stats_speed
source: Speed
ta: வேகம்

# stats_distance
source: Distance
ta: தூரம்

# stats_total_time
source: Total time
ta: மொத்த நேரம்

# stats_split_interval
source: Split interval
ta: பிளவு இடைவெளி

# stats_sensors_heart_rate
source: Heart rate
ta: இதய துடிப்பு

# stats_sensors_cadence
source: Cadence
ta: காடென்ச்

# stats_sensors_power
source: Power
ta: விசை

# stats_clock
source: Clock
ta: கடிகை

# track_name_format
source: Track %1$d
ta: ட்ராக் %1$d

# track_recording_notification_accuracy
source: Location accuracy: %1$s
ta: இருப்பிட துல்லியம்: %1$s

# track_distance_notification
source: Distance: %1$s
ta: தூரம்: %1$s

# track_speed_notification
source: Speed: %1$s
ta: வேகம்: %1$s

# track_pace_notification
source: Pace: %1$s
ta: வேகம்: %1$s

# track_markers
source: %1$s Markers
ta: %1$s குறிப்பான்கள்

# track_delete_one_confirm_message
source: The track and its markers will be permanently deleted from the device.
ta: தடமும் அதன் குறிப்பான்களும் சாதனத்திலிருந்து நிரந்தரமாக நீக்கப்படும்.

# track_delete_one_confirm_title
source: Delete track?
ta: தடத்தை நீக்கவா?

# track_delete_multiple_confirm_message
source: The selected tracks and their markers will be permanently deleted from the device.
ta: தேர்ந்தெடுக்கப்பட்ட தடங்கள் மற்றும் அவற்றின் குறிப்பான்கள் சாதனத்திலிருந்து நிரந்தரமாக நீக்கப்படும்.

# track_delete_progress_message
source: Deleting…
ta: நீக்குதல்…

# track_delete_number_of_tracks
source: %1$d tracks
ta: %1$d தடங்கள்

# track_delete_not_recording
source: This track cannot be deleted as it is currently recorded.
ta: தற்போது பதிவு செய்யப்பட்டுள்ளதால் இந்த பாதையை நீக்க முடியாது.

# track_discarding
source: Discarding Track
ta: பாதையை நிராகரித்தல்

# track_detail_stats_tab
source: Stats
ta: புள்ளிவிவரங்கள்

# track_detail_intervals_tab
source: Intervals
ta: இடைவெளிகள்

# track_edit_activity_type
source: Activity type (e.g. hiking)
ta: செயல்பாட்டு வகை (எ.கா. ஐகிங்)

# track_edit_activity_type_hint
source: Activity type
ta: செயல்பாட்டு வகை

# track_list_empty_message
source: Start recording your next adventure here
ta: உங்கள் அடுத்த சாகசத்தை இங்கே பதிவு செய்யத் தொடங்குங்கள்

# aggregated_stats_empty_message
source: Record your first track to see aggregated statistics
ta: ஒருங்கிணைந்த புள்ளிவிவரங்களைக் காண உங்கள் முதல் பாதையை பதிவு செய்யுங்கள்

# aggregated_stats_filter_no_results
source: There are not activities for the specified filter
ta: குறிப்பிட்ட வடிப்பானுக்கு நடவடிக்கைகள் இல்லை

# interval_list_empty_message
source: There are not any interval yet
ta: இதுவரை எந்த இடைவெளியும் இல்லை

# unit_feet
source: ft
ta: அடி

# unit_kilometer
source: km
ta: கி.மீ.

# unit_kilometer_per_hour
source: km/h
ta: கிமீ/மணி

# unit_meter
source: m
ta: மீ

# unit_mile
source: mi
ta: மி

# unit_mile_per_hour
source: mph
ta: எம்.பி.எச்

# unit_nautical_mile
source: NM
ta: என்.எம்

# unit_minute_per_kilometer
source: min/km
ta: நிமையம்/கி.மீ

# unit_minute_per_nautical_mile
source: min/NM
ta: நிமிடம்/என்.எம்

# value_integer_feet_excellent_gps
source: %1$d ft (excellent GPS)
ta: %1$d அடி (சிறந்த சி.பி.எச்)

# value_integer_feet_recommended
source: %1$d ft (recommended)
ta: %1$d அடி (பரிந்துரைக்கப்படுகிறது)

# value_integer_kilometer_hour
source: %1$d km/h
ta: %1$d கிமீ/மணி

# value_float_kilometer_hour
source: %1$.1f km/h
ta: %1$.1f கிமீ/மணி

# value_float_kilometer_hour_recommended
source: %1$.1f km/h (recommended)
ta: %1 $ .1f கிமீ/மணி (பரிந்துரைக்கப்படுகிறது)

# value_integer_meter_excellent_gps
source: %1$d m (excellent GPS)
ta: %1$d மீ (சிறந்த சி.பி.எச்)

# value_integer_meter_poor_gps
source: %1$d m (poor GPS)
ta: %1$d மீ (மோசமான சி.பி.எச்)

# value_integer_meter_recommended
source: %1$d m (recommended)
ta: %1$d மீ (பரிந்துரைக்கப்படுகிறது)

# value_integer_knots
source: %1$d knots
ta: %1$d முடிச்சுகள்

# value_float_knots
source: %1$.1f knots
ta: %1$.1f முடிச்சுகள்

# value_float_mile_hour_recommended
source: %1$.1f mi/h (recommended)
ta: %1$.1f Mi/h (பரிந்துரைக்கப்படுகிறது)

# value_float_knots_recommended
source: %1$.1f knots (recommended)
ta: %1$.1f முடிச்சுகள் (பரிந்துரைக்கப்படுகிறது)

# value_integer_minute
source: %1$d min
ta: %1$d மணித்துளி

# value_integer_second
source: %1$d s
ta: %1$d கள்

# value_none
source: None
ta: எதுவுமில்லை

# value_off
source: Off
ta: அணை

# value_internal_sensor
source: Internal sensor
ta: உள் சென்சார்

# value_smallest_recommended
source: Smallest (recommended)
ta: சிறியது (பரிந்துரைக்கப்படுகிறது)

# value_int_seconds
source: %1$d s (recommended)
ta: %1$d கள் (பரிந்துரைக்கப்படுகிறது)

# voiceIdle
source: Becoming idle.
ta: சும்மா ஆக.

# voiceHoursPlural
source: {n, plural, =1 {1 hour} other {{n,number} hours} }
ta: {n, plural, = 1 {1 hour} other {{n,number} மணிநேரம்}}

# voiceMinutesPlural
source: {n, plural, =1 {1 minute} other {{n,number} minutes} }
ta: {n, plural, = 1 {1 minute} other {{n,number} நிமிடங்கள்}}

# voiceSecondsPlural
source: {n, plural, =1 {1 second} other {{n,number} seconds} }
ta: {n, plural, = 1 {1 second} other {{n,number} விநாடிகள்}}

# voiceSpeedKilometersPerHourPlural
source: {n, plural, =1 {1 kilometer per hour} other {{n,number,#.0} kilometers per hour} }
ta: {n, plural, = 1 {1 kilometer per hour} other {{n,number,#. 0} ஒரு மணி நேரத்திற்கு கிலோமீட்டர்}}

# voiceSpeedMilesPerHourPlural
source: {n, plural, =1 {1 mile per hour} other {{n,number,#.0} miles per hour} }
ta: {n, plural, = 1 {1 mile per hour} other {{n,number,#. 0} ஒரு மணி நேரத்திற்கு மைல்கள்}}

# voiceSpeedMKnotsPlural
source: {n, plural, =1 {1 knot} other {{n,number,#.0} knots} }
ta: {n, plural, = 1 {1 knot} other {{n,number,#. 0} முடிச்சுகள்}}

# voice_on_device_speaker_title
source: Use the device's speaker
ta: சாதனத்தின் ச்பீக்கரைப் பயன்படுத்தவும்

# voice_per_kilometer
source: per kilometer
ta: ஒரு கிலோமீட்டருக்கு

# voice_per_mile
source: per mile
ta: மைலுக்கு

# voice_per_nautical_mile
source: per nautical mile
ta: ஒரு கடல் மைலுக்கு

source: Lap time
ta: மடியில் நேரம்

source: Pace
ta: விரைவு

source: Lap speed
ta: மடியில் விரைவு

# speed
source: Average moving speed
ta: சராசரி நகரும் விரைவு

source: Total distance
ta: மொத்த தூரம்

# voiceDistanceKilometersPlural
source: {n, plural, =1 {1 kilometer} other {{n,number,#.0} kilometers} }
ta: {n, plural, = 1 {1 kilometer} other {{n,number,#. 0} கிலோமீட்டர்}}

# voiceDistanceMilesPlural
source: {n, plural, =1 {1 mile} other {{n,number,#.0} miles} }
ta: {n, plural, = 1 {1 mile} other {{n,number,#. 0} மைல்கள்}}

# voiceDistanceNauticalMilesPlural
source: {n, plural, =1 {1 nautical mile} other {{n,number,#.0} nautical miles} }
ta: {n, plural, = 1 {1 nautical mile} other {{n,number,#. 0} கடல் மைல்கள்}}

source: Average heart rate
ta: சராசரி இதய துடிப்பு

source: Current heart rate
ta: தற்போதைய இதய துடிப்பு

source: Lap heart rate
ta: மடியில் இதய துடிப்பு

# waypoint_type_atm
source: ATM
ta: ஏடிஎம்

# waypoint_type_bank
source: bank
ta: வைப்பகம்

# waypoint_type_bar
source: bar
ta: மதுக்கூடம்

# waypoint_type_barbecue
source: barbecue
ta: பார்பிக்யூ

# waypoint_type_building
source: building
ta: கட்டிடம்

# waypoint_type_bus_stop
source: bus stop
ta: பச் நிறுத்தம்

# waypoint_type_cafe
source: cafe
ta: கஃபே

# waypoint_type_campfire
source: campfire
ta: கேம்ப்ஃபயர்

# waypoint_type_campground
source: campground
ta: முகாம்

# waypoint_type_church
source: church
ta: தேவாலயம்

# waypoint_type_coffee_house
source: coffee house
ta: காபி அவுச்

# waypoint_type_convenience_store
source: convenience store
ta: வசதியான கடை

# waypoint_type_drinking_water
source: drinking water
ta: குடிநீர்

# waypoint_type_falling_rocks
source: falling rocks
ta: வீழ்ச்சியடைந்த பாறைகள்

# waypoint_type_ferry
source: ferry
ta: படகு

# waypoint_type_fire_place
source: fire place
ta: தீ இடம்

# waypoint_type_fire_station
source: fire station
ta: தீயணைப்பு நிலையம்

# waypoint_type_fishing
source: fishing
ta: மீன்பிடித்தல்

# waypoint_type_gas_station
source: gas station
ta: எரிவாயு நிலையம்

# waypoint_type_golf_course
source: golf course
ta: கோல்ஃப் மைதானம்

# waypoint_type_grocery_store
source: grocery store
ta: மளிகை கடை

# waypoint_type_hair_dresser
source: hair dresser
ta: ஏர் டிரச்சர்

# waypoint_type_harbor
source: harbor
ta: துறைமுகம்

# waypoint_type_hiking_path
source: hiking path
ta: ஐக்கிங் பாதை

# waypoint_type_hotel
source: hotel
ta: ஓட்டல்

# waypoint_type_house
source: house
ta: வீடு

# waypoint_type_information
source: information
ta: தகவல்

# waypoint_type_intersection
source: intersection
ta: குறுக்குவெட்டு

# waypoint_type_mail_box
source: mail box
ta: அஞ்சல் பெட்டி

# waypoint_type_market
source: market
ta: சந்தை

# waypoint_type_meeting_point
source: meeting point
ta: சந்திப்பு இடம்

# waypoint_type_opera
source: opera
ta: ஓபரா

# waypoint_type_parking
source: parking
ta: பார்க்கிங்

# waypoint_type_police_station
source: police station
ta: காவல் நிலையம்

# waypoint_type_post_office
source: post office
ta: தபால் அலுவலகம்

# waypoint_type_pothole
source: pothole
ta: குழி

# waypoint_type_railway_crossing
source: railway crossing
ta: ரயில்வே கடத்தல்

# waypoint_type_restaurant
source: restaurant
ta: உணவகம்

# waypoint_type_shopping
source: shopping
ta: சாப்பிங்

# waypoint_type_sight
source: sight
ta: பார்வை

# waypoint_type_store
source: store
ta: கடை

# waypoint_type_swimming_pool
source: swimming pool
ta: நீச்சல் குளம்

# waypoint_type_telephone
source: telephone
ta: தொலைபேசி

# waypoint_type_theater
source: theater
ta: தியேட்டர்

# waypoint_type_toilet
source: toilet
ta: கழிப்பறை

# waypoint_type_tourist_information
source: tourist information
ta: சுற்றுலா செய்தி

# waypoint_type_tree
source: tree
ta: மரம்

# waypoint_type_tunnel
source: tunnel
ta: சுரங்கப்பாதை

# waypoint_type_waterfall
source: waterfall
ta: நீர்வீழ்ச்சி

# waypoint_type_water_fountain
source: water fountain
ta: நீர் நீரூற்று

# waypoint_type_waypoint
source: waypoint
ta: பாதைப்புள்ளி

# share_image_subject
source: I would like to share an image with you
ta: ஒரு படத்தை உங்களுடன் பகிர்ந்து கொள்ள விரும்புகிறேன்

# share_image_body
source: I think you might be interested in this image.
ta: இந்த படத்தில் நீங்கள் ஆர்வமாக இருக்கலாம் என்று நினைக்கிறேன்.

source: Hold to stop
ta: நிறுத்த பிடிக்கவும்

# instant_export_enabled_summary
source: Export track to storage after recording is finished
ta: பதிவு முடிந்ததும் சேமிப்பிற்கான ஏற்றுமதி பாதை

# instant_export_enabled_title
source: Instant post-workout export
ta: உடனடி பிந்தைய வொர்க்அவுட் ஏற்றுமதி
