Repository: 247i/TACETr
Catalog: உரை/தானி/openorienteering-mapper-*.po
Languages: ta

# OpenOrienteering::EditTool
source: <b>Coordinate offset:</b> %1, %2 mm <b>Distance:</b> %3 m
ta: <b> ஒருங்கிணைப்பு ஆஃப்செட்: </b> %1, %2 மிமீ <b> தூரம்: </b> %3 மீ

# OpenOrienteering::EditTool
source: <b>%1</b>: Fixed angles.
ta: <b>%1 </b>: நிலையான கோணங்கள்.

# OpenOrienteering::EditTool
source: <b>%1</b>: Snap to existing objects.
ta: <b>%1 </b>: இருக்கும் பொருள்களுக்கு ஒடுக்கவும்.

# OpenOrienteering::EditTool
source: <b>Click</b>: Select a single object. <b>Drag</b>: Select multiple objects. <b>%1+Click</b>: Toggle selection.
ta: <b> சொடுக்கு </b>: ஒரு பொருளைத் தேர்ந்தெடுக்கவும். <b> இழுத்தல் </b>: பல பொருள்களைத் தேர்ந்தெடுக்கவும். <b>%1+கிளிக் </b>: தேர்வை மாற்றவும்.

# OpenOrienteering::EditTool
source: <b>%1</b>: Delete selected objects.
ta: <b>%1 </b>: தேர்ந்தெடுக்கப்பட்ட பொருள்களை நீக்கு.

# OpenOrienteering::EditorSettingsPage
source: High quality map display (antialiasing)
ta: உயர்தர வரைபட காட்சி (ஆன்டிலியாசிங்)

# OpenOrienteering::EditorSettingsPage
source: Antialiasing makes the map look much better, but also slows down the map display
ta: ஆன்டிலிசிங் வரைபடத்தை மிகவும் சிறப்பாகக் காட்டுகிறது, ஆனால் வரைபடக் காட்சியை மெதுவாக்குகிறது

# OpenOrienteering::EditorSettingsPage
source: High quality text display in map (antialiasing), slow
ta: வரைபடத்தில் உயர் தரமான உரை காட்சி (ஆன்டிலியாசிங்), மெதுவாக

# OpenOrienteering::EditorSettingsPage
source: Click tolerance:
ta: சகிப்புத்தன்மையைக் சொடுக்கு செய்க:

# OpenOrienteering::EditorSettingsPage millimeters
source: mm
ta: மிமீ

# OpenOrienteering::EditorSettingsPage
source: Snap distance (%1):
ta: ச்னாப் தூரம் (%1):

# OpenOrienteering::EditorSettingsPage
source: Stepping of fixed angle mode (%1):
ta: நிலையான கோண பயன்முறையின் படி (%1):

# OpenOrienteering::EditorSettingsPage
source: Symbol icon size:
ta: அடையாளம் படவுரு அளவு:

# OpenOrienteering::EditorSettingsPage
source: Action button size:
ta: செயல் பொத்தான் அளவு:

# OpenOrienteering::EditorSettingsPage
source: When selecting an object, automatically select its symbol, too
ta: ஒரு பொருளைத் தேர்ந்தெடுக்கும்போது, ​​தானாகவே அதன் சின்னத்தையும் தேர்ந்தெடுக்கவும்

# OpenOrienteering::EditorSettingsPage
source: Zoom away from cursor when zooming out
ta: பெரிதாக்கும்போது கர்சரிலிருந்து பெரிதாக்கவும்

# OpenOrienteering::EditorSettingsPage
source: Drawing tools: set last point on finishing with right click
ta: வரைதல் கருவிகள்: வலது சொடுக்கு மூலம் முடிக்க கடைசி புள்ளியை அமைக்கவும்

# OpenOrienteering::EditorSettingsPage
source: Templates: keep settings of closed templates
ta: வார்ப்புருக்கள்: மூடிய வார்ப்புருக்களின் அமைப்புகளை வைத்திருங்கள்

# OpenOrienteering::EditorSettingsPage
source: User input: Ignore display touch
ta: பயனர் உள்ளீடு: காட்சி தொடுதலை புறக்கணிக்கவும்

# OpenOrienteering::EditorSettingsPage
source: Edit tool:
ta: கருவி திருத்து:

# OpenOrienteering::EditorSettingsPage
source: Retain old shape
ta: பழைய வடிவத்தைத் தக்க வைத்துக் கொள்ளுங்கள்

# OpenOrienteering::EditorSettingsPage
source: Reset outer curve handles
ta: வெளிப்புற வளைவு கைப்பிடிகளை மீட்டமைக்கவும்

# OpenOrienteering::EditorSettingsPage
source: Keep outer curve handles
ta: வெளிப்புற வளைவு கைப்பிடிகளை வைத்திருங்கள்

# OpenOrienteering::EditorSettingsPage
source: Action on deleting a curve point with %1:
ta: %1 உடன் வளைவு புள்ளியை நீக்குவதற்கான நடவடிக்கை:

# OpenOrienteering::EditorSettingsPage
source: Rectangle tool:
ta: செவ்வக கருவி:

# OpenOrienteering::EditorSettingsPage
source: Radius of helper cross:
ta: உதவி சிலுவையின் ஆரம்:

# OpenOrienteering::EditorSettingsPage
source: Preview the width of lines with helper cross
ta: உதவி சிலுவையுடன் வரிகளின் அகலத்தை முன்னோட்டமிடுங்கள்

# OpenOrienteering::EditorSettingsPage
source: Editor
ta: திருத்தி

# OpenOrienteering::Exporter
source: Could not write file: %1
ta: கோப்பை எழுத முடியவில்லை: %1

# OpenOrienteering::Exporter
source: Cannot save file %1: %2
ta: கோப்பைச் சேமிக்க முடியாது %1: %2

# OpenOrienteering::FillTool
source: Warning
ta: எச்சரிக்கை

# OpenOrienteering::FillTool
source: The map area is large. Use of the fill tool may be very slow. Do you want to use it anyway?
ta: வரைபட பகுதி பெரியது. நிரப்பு கருவியின் பயன்பாடு மிகவும் மெதுவாக இருக்கலாம். எப்படியும் இதைப் பயன்படுத்த விரும்புகிறீர்களா?

# OpenOrienteering::FillTool
source: Error
ta: பிழை

# OpenOrienteering::FillTool
source: The clicked area is not bounded by lines or areas, cannot fill this area.
ta: சொடுக்கு செய்யப்பட்ட பகுதி கோடுகள் அல்லது பகுதிகளால் கட்டுப்படுத்தப்படவில்லை, இந்த பகுதியை நிரப்ப முடியாது.

# OpenOrienteering::FillTool
source: The clicked position is not free, cannot use the fill tool there.
ta: சொடுக்கு செய்யப்பட்ட நிலை இலவசம் அல்ல, அங்கு நிரப்பு கருவியைப் பயன்படுத்த முடியாது.

# OpenOrienteering::FillTool
source: Failed to create the fill object.
ta: நிரப்பு பொருளை உருவாக்குவதில் தோல்வி.

# OpenOrienteering::FillTool
source: <b>Click</b>: Fill area with active symbol. The area to be filled must be bounded by lines or areas, other symbols are not taken into account.
ta: <b> சொடுக்கு </b>: செயலில் உள்ள சின்னத்துடன் பகுதியை நிரப்பவும். நிரப்பப்பட வேண்டிய பகுதி கோடுகள் அல்லது பகுதிகளால் கட்டுப்படுத்தப்பட வேண்டும், பிற சின்னங்கள் கணக்கில் எடுத்துக்கொள்ளப்படவில்லை.

# OpenOrienteering::GPSDisplay
source: GPS is disabled in the device settings. Open settings now?
ta: சாதன அமைப்புகளில் சி.பி.எச் முடக்கப்பட்டுள்ளது. இப்போது அமைப்புகளைத் திறக்கவா?

# OpenOrienteering::GPSDisplay
source: Yes
ta: ஆம்

# OpenOrienteering::GPSDisplay
source: No
ta: இல்லை

# OpenOrienteering::GdalImageReader
source: Failed to read image data: %1
ta: பட தரவைப் படிக்கத் தவறிவிட்டது: %1

# OpenOrienteering::GdalImageReader
source: Unsupported raster data: %1
ta: ஆதரிக்கப்படாத ராச்டர் தரவு: %1

# OpenOrienteering::GdalSettingsPage
source: Import Options
ta: இறக்குமதி விருப்பங்கள்

# OpenOrienteering::GdalSettingsPage
source: Import with GDAL/OGR:
ta: GDAL/OGR உடன் இறக்குமதி:

# OpenOrienteering::GdalSettingsPage
source: Clip layers
ta: கிளிப் அடுக்குகள்

# OpenOrienteering::GdalSettingsPage
source: Use GDAL for GPX
ta: GPX க்கு GDAL ஐப் பயன்படுத்தவும்

# OpenOrienteering::GdalSettingsPage
source: GPX
ta: சி.பி.எக்ச்

# OpenOrienteering::GdalSettingsPage
source: Templates
ta: வார்ப்புருக்கள்

# OpenOrienteering::GdalSettingsPage
source: Hatch areas
ta: அட்ச் பகுதிகள்

# OpenOrienteering::GdalSettingsPage
source: Baseline view
ta: அடிப்படை பார்வை

# OpenOrienteering::GdalSettingsPage
source: Export Options
ta: ஏற்றுமதி விருப்பங்கள்

# OpenOrienteering::GdalSettingsPage
source: Create a layer for each symbol
ta: ஒவ்வொரு சின்னத்திற்கும் ஒரு அடுக்கை உருவாக்கவும்

# OpenOrienteering::GdalSettingsPage
source: Configuration
ta: உள்ளமைவு

# OpenOrienteering::GdalSettingsPage
source: Parameter
ta: கூறளவு

# OpenOrienteering::GdalSettingsPage
source: Value
ta: மதிப்பு

# OpenOrienteering::GeneralSettingsPage
source: Appearance
ta: தோற்றம்

# OpenOrienteering::GeneralSettingsPage
source: Language:
ta: மொழி:

# OpenOrienteering::GeneralSettingsPage
source: Screen
ta: திரை

# OpenOrienteering::GeneralSettingsPage
source: Pixels per inch:
ta: ஒரு அங்குலத்திற்கு பிக்சல்கள்:

# OpenOrienteering::GeneralSettingsPage
source: Program start
ta: நிரல் தொடக்க

# OpenOrienteering::GeneralSettingsPage
source: Saving files
ta: கோப்புகளைச் சேமிக்கிறது

# OpenOrienteering::GeneralSettingsPage
source: Retain compatibility with Mapper %1
ta: மேப்பர் %1 உடன் பொருந்தக்கூடிய தன்மையைத் தக்க வைத்துக் கொள்ளுங்கள்

# OpenOrienteering::GeneralSettingsPage
source: Save information for automatic recovery
ta: தானியங்கி மீட்புக்கான தகவல்களைச் சேமிக்கவும்

# OpenOrienteering::GeneralSettingsPage
source: Recovery information saving interval:
ta: மீட்பு செய்தி சேமிப்பு இடைவெளி:

# OpenOrienteering::GeneralSettingsPage unit minutes
source: min
ta: மணித்துளி

# OpenOrienteering::GeneralSettingsPage
source: File import and export
ta: கோப்பு இறக்குமதி மற்றும் ஏற்றுமதி

# OpenOrienteering::GeneralSettingsPage
source: 8-bit encoding:
ta: 8-பிட் குறியாக்கம்:

# OpenOrienteering::GeneralSettingsPage
source: More...
ta: மேலும் ...

# OpenOrienteering::GeneralSettingsPage
source: Save undo/redo history
ta: செயல்தவிர்/மீண்டும் வரலாற்றைச் சேமிக்கவும்

# OpenOrienteering::GeneralSettingsPage
source: Default
ta: இயல்புநிலை

# OpenOrienteering::GeneralSettingsPage
source: General
ta: பொது

# OpenOrienteering::GeneralSettingsPage
source: Notice
ta: அறிவிப்பு

# OpenOrienteering::GeneralSettingsPage
source: The program must be restarted for the language change to take effect!
ta: மொழி மாற்றம் நடைமுறைக்கு வர நிரல் மறுதொடக்கம் செய்யப்பட வேண்டும்!

# OpenOrienteering::GeneralSettingsPage
source: Open translation
ta: திறந்த மொழிபெயர்ப்பு

# OpenOrienteering::GeneralSettingsPage
source: Translation files (*.qm)
ta: மொழிபெயர்ப்பு கோப்புகள் (*.qm)

# OpenOrienteering::GeneralSettingsPage
source: The selected file is not a valid translation.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பு சரியான மொழிபெயர்ப்பு அல்ல.

# OpenOrienteering::GeneralSettingsPage
source: %1 x %2
ta: %1 ஃச் %2

# OpenOrienteering::GeneralSettingsPage
source: Primary screen resolution in pixels:
ta: பிக்சல்களில் முதன்மை திரை தெளிவுத்திறன்:

# OpenOrienteering::GeneralSettingsPage
source: Primary screen size in inches (diagonal):
ta: முதன்மை திரை அளவு அங்குலங்களில் (மூலைவிட்ட):

# OpenOrienteering::Georeferencing
source: UTM coordinates
ta: UTM ஆயத்தொகுப்புகள்

# OpenOrienteering::Georeferencing
source: UTM Zone (number north/south)
ta: யுடிஎம் மண்டலம் (எண் வடக்கு/தெற்கு)

# OpenOrienteering::Georeferencing Gauss-Krueger coordinate reference system
source: Gauss-Krueger, datum: Potsdam
ta: காச்-க்ரூகர், தேதி: போட்ச்டாம்

# OpenOrienteering::Georeferencing
source: Gauss-Krueger coordinates
ta: காச்-க்ரூகர் ஆயத்தொகுப்புகள்

# OpenOrienteering::Georeferencing Zone number for Gauss-Krueger coordinates
source: Zone number (1 to 119)
ta: மண்டல எண் (1 முதல் 119 வரை)

# OpenOrienteering::Georeferencing as in: The CRS is specified by EPSG code
source: by EPSG code
ta: EPSG குறியீடு மூலம்

# OpenOrienteering::Georeferencing
source: EPSG @code@ coordinates
ta: EPSG @ குறியீடு @ ஒருங்கிணைப்புகள்

# OpenOrienteering::Georeferencing
source: Local coordinates
ta: உள்ளக ஆயத்தொகுப்புகள்

# OpenOrienteering::Georeferencing
source: EPSG code
ta: EPSG குறியீடு

# OpenOrienteering::Georeferencing PROJ.4 specification
source: Custom PROJ.4
ta: தனிப்பயன் புரோச் .4

# OpenOrienteering::Georeferencing PROJ.4 specification
source: Specification
ta: விவரக்குறிப்பு

# OpenOrienteering::Georeferencing
source: Map scale specification invalid or missing.
ta: வரைபட அளவிலான விவரக்குறிப்பு தவறானது அல்லது காணவில்லை.

# OpenOrienteering::Georeferencing
source: Invalid grid scale factor: %1
ta: தவறான கட்டம் அளவிலான காரணி: %1

# OpenOrienteering::Georeferencing
source: Invalid auxiliary scale factor: %1
ta: தவறான துணை அளவிலான காரணி: %1

# OpenOrienteering::Georeferencing
source: Unknown CRS specification language: %1
ta: அறியப்படாத சிஆர்எச் விவரக்குறிப்பு மொழி: %1

# OpenOrienteering::Georeferencing
source: Unsupported geographic CRS specification: %1
ta: ஆதரிக்கப்படாத புவியியல் சிஆர்எச் விவரக்குறிப்பு: %1

# OpenOrienteering::Georeferencing
source: Local
ta: உள்ளக

# OpenOrienteering::GeoreferencingDialog
source: Map Georeferencing
ta: வரைபடம் உலகம் பெரென்சிங்

# OpenOrienteering::GeoreferencingDialog
source: Lookup...
ta: தேடல் ...

# OpenOrienteering::GeoreferencingDialog
source: m
ta: மீ

# OpenOrienteering::GeoreferencingDialog
source: Declination:
ta: வீழ்ச்சி:

# OpenOrienteering::GeoreferencingDialog
source: Projected coordinates
ta: திட்டமிடப்பட்ட ஆயத்தொலைவுகள்

# OpenOrienteering::GeoreferencingDialog
source: Status:
ta: நிலை:

# OpenOrienteering::GeoreferencingDialog
source: Geographic coordinates
ta: புவியியல் ஆயத்தொலைவுகள்

# OpenOrienteering::GeoreferencingDialog
source: Show reference point in:
ta: குறிப்பு புள்ளியைக் காட்டு:

# OpenOrienteering::GeoreferencingDialog
source: valid
ta: செல்லுபடியாகும்

# OpenOrienteering::GeoreferencingDialog
source: <a href="%1">OpenStreetMap</a> | <a href="%2">World of O Maps</a>
ta: <a href = "%1"> openstreetmap </a> | <a href = "%2"> ஓ வரைபடங்களின் உலகம் </a>

# OpenOrienteering::GeoreferencingDialog
source: Online declination lookup
ta: நிகழ்நிலை சரிவு தேடல்

# OpenOrienteering::GeoreferencingDialog
source: Map coordinate reference system
ta: வரைபட ஒருங்கிணைப்பு குறிப்பு அமைப்பு

# OpenOrienteering::GeoreferencingDialog
source: - local -
ta: - உள்ளக -

# OpenOrienteering::GeoreferencingDialog
source: Reference point
ta: குறிப்பு புள்ளி

# OpenOrienteering::GeoreferencingDialog
source: &Pick on map
ta: & வரைபடத்தில் தேர்வு செய்யுங்கள்

# OpenOrienteering::GeoreferencingDialog
source: (Datum: WGS84)
ta: (தேதி: WGS84)

# OpenOrienteering::GeoreferencingDialog
source: mm
ta: மிமீ

# OpenOrienteering::GeoreferencingDialog x coordinate
source: X
ta: ஃச்

# OpenOrienteering::GeoreferencingDialog y coordinate
source: Y
ta: ஒய்

# OpenOrienteering::GeoreferencingDialog west / east
source: E
ta: இ

# OpenOrienteering::GeoreferencingDialog east
source: E
ta: இ

# OpenOrienteering::GeoreferencingDialog
source: Map north
ta: வரைபடம் வடக்கு

# OpenOrienteering::GeoreferencingDialog
source: Show scale factors
ta: அளவிலான காரணிகளைக் காட்டு

# OpenOrienteering::GeoreferencingDialog
source: Scale compensation
ta: அளவிலான இழப்பீடு

# OpenOrienteering::GeoreferencingDialog
source: Combined scale factor:
ta: ஒருங்கிணைந்த அளவிலான காரணி:

# OpenOrienteering::GeoreferencingDialog
source: Auxiliary scale factor:
ta: துணை அளவிலான காரணி:

# OpenOrienteering::GeoreferencingDialog
source: &Coordinate reference system:
ta: & குறிப்பு முறையை ஒருங்கிணைத்தல்:

# OpenOrienteering::GeoreferencingDialog
source: Map coordinates:
ta: வரைபட ஒருங்கிணைப்புகள்:

# OpenOrienteering::GeoreferencingDialog
source: Geographic coordinates:
ta: புவியியல் ஆயத்தொலைவுகள்:

# OpenOrienteering::GeoreferencingDialog
source: On CRS changes, keep:
ta: சிஆர்எச் மாற்றங்களில், வைத்திருங்கள்:

# OpenOrienteering::GeoreferencingDialog
source: Grivation:
ta: கிருபை:

# OpenOrienteering::GeoreferencingDialog
source: The magnetic declination for the reference point %1° %2° will now be retrieved from <a href="%3">%3</a>. Do you want to continue?
ta: குறிப்பு புள்ளி %1 ° %2 க்கு க்கான காந்த சரிவு இப்போது <a href = " %3"> %3 </a> இலிருந்து மீட்டெடுக்கப்படும். நீங்கள் தொடர விரும்புகிறீர்களா?

# OpenOrienteering::GeoreferencingDialog
source: Declination change
ta: வீழ்ச்சி மாற்றம்

# OpenOrienteering::GeoreferencingDialog
source: The declination has been changed. Do you want to rotate the map content accordingly, too?
ta: சரிவு மாற்றப்பட்டுள்ளது. வரைபட உள்ளடக்கத்தை அதற்கு ஏற்ப சுழற்ற விரும்புகிறீர்களா?

# OpenOrienteering::GeoreferencingDialog
source: Scale factor change
ta: அளவிலான காரணி மாற்றம்

# OpenOrienteering::GeoreferencingDialog
source: The scale factor has been changed. Do you want to stretch/shrink the map content accordingly, too?
ta: அளவிலான காரணி மாற்றப்பட்டுள்ளது. அதற்கேற்ப வரைபட உள்ளடக்கத்தை நீட்டவும்/சுருக்கவும் விரும்புகிறீர்களா?

# OpenOrienteering::GeoreferencingDialog
source: Local coordinates:
ta: உள்ளக ஆயத்தொகுப்புகள்:

# OpenOrienteering::GeoreferencingDialog
source: Loading...
ta: ஏற்றுகிறது ...

# OpenOrienteering::GeoreferencingDialog
source: locked
ta: பூட்டப்பட்டுள்ளது

# OpenOrienteering::GeoreferencingDialog
source: Could not parse data.
ta: தரவை அலச முடியவில்லை.

# OpenOrienteering::GeoreferencingDialog
source: Declination value not found.
ta: வீழ்ச்சி மதிப்பு காணப்படவில்லை.

# OpenOrienteering::GeoreferencingDialog
source: The online declination lookup failed: %1
ta: நிகழ்நிலை சரிவு தேடல் தோல்வியடைந்தது: %1

# OpenOrienteering::GeoreferencingTool
source: <b>Click</b>: Set the reference point. <b>Right click</b>: Cancel.
ta: <b> சொடுக்கு </b>: குறிப்பு புள்ளியை அமைக்கவும். <b> வலது சொடுக்கு </b>: ரத்துசெய்.

# OpenOrienteering::HomeScreenController
source: Welcome to OpenOrienteering Mapper!
ta: Openorienteering மேப்பருக்கு வருக!

# OpenOrienteering::HomeScreenWidgetDesktop
source: Activities
ta: நடவடிக்கைகள்

# OpenOrienteering::HomeScreenWidgetDesktop
source: Create a new map ...
ta: புதிய வரைபடத்தை உருவாக்கவும் ...

# OpenOrienteering::HomeScreenWidgetDesktop
source: Open map ...
ta: திறந்த வரைபடம் ...

# OpenOrienteering::HomeScreenWidgetDesktop
source: Touch mode
ta: தொடு முறை

# OpenOrienteering::HomeScreenWidgetDesktop
source: Settings
ta: அமைப்புகள்

# OpenOrienteering::HomeScreenWidgetDesktop As in 'About OpenOrienteering Mapper'
source: About %1
ta: சுமார் %1

# OpenOrienteering::HomeScreenWidgetDesktop
source: Help
ta: உதவி

# OpenOrienteering::HomeScreenWidgetDesktop
source: Exit
ta: வெளியேறு

# OpenOrienteering::HomeScreenWidgetDesktop
source: Recent maps
ta: அண்மைக் கால வரைபடங்கள்

# OpenOrienteering::HomeScreenWidgetDesktop
source: Open most recently used file on start
ta: தொடக்கத்தில் மிக அண்மைக் காலத்தில் பயன்படுத்தப்பட்ட கோப்பைத் திறக்கவும்

# OpenOrienteering::HomeScreenWidgetDesktop
source: Clear list
ta: தெளிவான பட்டியல்

# OpenOrienteering::HomeScreenWidgetDesktop
source: Tip of the day
ta: அன்றைய உதவிக்குறிப்பு

# OpenOrienteering::HomeScreenWidgetDesktop
source: Show tip of the day
ta: அன்றைய உதவிக்குறிப்பைக் காட்டு

# OpenOrienteering::HomeScreenWidgetDesktop
source: Previous
ta: முந்தைய

# OpenOrienteering::HomeScreenWidgetDesktop
source: Next
ta: அடுத்தது

# OpenOrienteering::HomeScreenWidgetMobile
source: Help
ta: உதவி

# OpenOrienteering::HomeScreenWidgetMobile
source: Examples
ta: எடுத்துக்காட்டுகள்

# OpenOrienteering::HomeScreenWidgetMobile
source: About Mapper
ta: மேப்பர் பற்றி

# OpenOrienteering::IconPropertiesWidget
source: PNG
ta: பி.என்.சி.

# OpenOrienteering::IconPropertiesWidget
source: All files (*.*)
ta: எல்லா கோப்புகளும் (*.*)

# OpenOrienteering::IconPropertiesWidget
source: Default icon
ta: இயல்புநிலை படவுரு

# OpenOrienteering::IconPropertiesWidget
source: px
ta: பி.எக்ச்

# OpenOrienteering::IconPropertiesWidget
source: Preview width:
ta: முன்னோட்டம் அகலம்:

# OpenOrienteering::IconPropertiesWidget
source: Save...
ta: சேமி ...

# OpenOrienteering::IconPropertiesWidget
source: Copy to custom icon
ta: தனிப்பயன் ஐகானுக்கு நகலெடுக்கவும்

# OpenOrienteering::IconPropertiesWidget
source: Custom icon
ta: தனிப்பயன் படவுரு

# OpenOrienteering::IconPropertiesWidget
source: Width:
ta: அகலம்:

# OpenOrienteering::IconPropertiesWidget
source: Load...
ta: ஏற்றுங்கள் ...

# OpenOrienteering::IconPropertiesWidget
source: Clear
ta: தெளிவான

# OpenOrienteering::IconPropertiesWidget
source: %1 px
ta: %1 பிஎக்ச்

# OpenOrienteering::IconPropertiesWidget
source: Save symbol icon ...
ta: குறியீட்டு ஐகானைச் சேமிக்கவும் ...

# OpenOrienteering::IconPropertiesWidget
source: Error
ta: பிழை

# OpenOrienteering::IconPropertiesWidget
source: Failed to save the image: %1
ta: படத்தை சேமிப்பதில் தோல்வி: %1

# OpenOrienteering::IconPropertiesWidget
source: Load symbol icon ...
ta: சுமை சின்ன படவுரு ...

# OpenOrienteering::IconPropertiesWidget
source: Cannot open file: %1 %2
ta: கோப்பைத் திறக்க முடியாது: %1 %2

# OpenOrienteering::ImportExport
source: Error while loading a symbol of type %1 at line %2 column %3.
ta: வரி %2 நெடுவரிசை %3 இல் வகை %1 இன் சின்னத்தை ஏற்றும்போது பிழை.

# OpenOrienteering::ImportExport
source: Symbol ID '%1' not unique at line %2 column %3.
ta: குறியீட்டு ஐடி ' %1' வரி %2 நெடுவரிசை %3 இல் தனித்துவமானது அல்ல.

# OpenOrienteering::ImportExport
source: Error while loading a symbol of type %1 at line %2 column %3: %4
ta: வரி %1 இன் குறியீட்டின் குறியீட்டை ஏற்றும்போது பிழை %2 நெடுவரிசை %3: %4

# OpenOrienteering::ImportExport
source: Error while loading an object of type %1.
ta: வகை %1 இன் பொருளை ஏற்றும்போது பிழை.

# OpenOrienteering::ImportExport
source: Malformed symbol ID '%1' at line %2 column %3.
ta: வரி %2 நெடுவரிசை %3 இல் தவறாக குறியீட்டு ஐடி ' %1'.

# OpenOrienteering::ImportExport
source: Error while loading an object of type %1 at %2:%3: %4
ta: %1 வகை %2: %3: %4 இல் ஒரு பொருளை ஏற்றும்போது பிழை

# OpenOrienteering::ImportExport
source: Unable to find symbol for object at %1:%2.
ta: %1: %2 இல் பொருளின் சின்னத்தைக் கண்டுபிடிக்க முடியவில்லை.

# OpenOrienteering::ImportExport
source: OCAD
ta: டோகாட்

# OpenOrienteering::ImportExport
source: OCAD version %1
ta: OCAD பதிப்பு %1

# OpenOrienteering::ImportExport
source: Could not parse the coordinates.
ta: ஆயங்களை அலச முடியவில்லை.

# OpenOrienteering::ImportExport
source: Expected %1 coordinates, found %2.
ta: எதிர்பார்க்கப்படும் %1 ஆயத்தொகுப்புகள், %2 காணப்படுகின்றன.

# OpenOrienteering::ImportExport
source: Error while loading the printing configuration at %1:%2: %3
ta: அச்சிடும் உள்ளமைவை %1: %2: %3 இல் ஏற்றும்போது பிழை

# OpenOrienteering::ImportExport
source: Error while loading the undo/redo steps at %1:%2: %3
ta: செயல்தவிர்/மீண்டும் படிகளை %1: %2: %3 இல் ஏற்றும்போது பிழை

# OpenOrienteering::ImportExport No such import / export option
source: No such option: %1
ta: அத்தகைய விருப்பம் இல்லை: %1

# OpenOrienteering::ImportExport
source: Geospatial vector data
ta: புவியியல் திசையன் தரவு

# OpenOrienteering::ImportExport
source: Cannot find a vector data export driver named '%1'
ta: '%1' என்ற திசையன் தரவு ஏற்றுமதி இயக்கியைக் கண்டுபிடிக்க முடியவில்லை

# OpenOrienteering::ImportExport
source: IOF Data Standard 3.0
ta: IOF தரவு தரநிலை 3.0

# OpenOrienteering::Importer
source: Cannot open file %1: %2
ta: கோப்பைத் திறக்க முடியாது %1: %2

# OpenOrienteering::Importer
source: Found an object without symbol.
ta: அடையாளம் இல்லாமல் ஒரு பொருளைக் கண்டுபிடித்தார்.

# OpenOrienteering::Importer
source: Dropped %n irregular object.
ta: கைவிடப்பட்ட %n ஒழுங்கற்ற பொருள்.

# OpenOrienteering::Importer
source: Error during symbol post-processing.
ta: குறியீட்டு பிந்தைய செயலாக்கத்தின் போது பிழை.

# OpenOrienteering::Importer
source: Template "%1" has been loaded from the map's directory instead of the relative location to the map file where it was previously.
ta: உறவினர் இருப்பிடத்திற்கு பதிலாக வரைபடத்தின் கோப்பகத்திலிருந்து முன்னர் இருந்த வரைபடக் கோப்பில் "%1" வார்ப்புரு ஏற்றப்பட்டுள்ளது.

# OpenOrienteering::Importer
source: Failed to load template '%1', reason: %2
ta: ' %1' வார்ப்புருவை ஏற்றுவதில் தோல்வி, காரணம்: %2

# OpenOrienteering::Importer
source: Georeferencing mismatch:
ta: புவிசார் பொருந்தாத தன்மை:

# OpenOrienteering::Importer
source: Warnings when loading template '%1': %2
ta: '%1' வார்ப்புருவை ஏற்றும்போது எச்சரிக்கைகள்: %2

# OpenOrienteering::Importer
source: At least one template file could not be found.
ta: குறைந்தது ஒரு வார்ப்புரு கோப்பைக் கண்டுபிடிக்க முடியவில்லை.

# OpenOrienteering::Importer
source: Click the red template name(s) in the Templates -> Template setup window to locate the template file name(s).
ta: வார்ப்புரு கோப்பு பெயர் (களை) கண்டுபிடிக்க வார்ப்புருக்கள் -> வார்ப்புரு அமைவு சாளரத்தில் சிவப்பு வார்ப்புரு பெயர் (கள்) என்பதைக் சொடுக்கு செய்க.

# OpenOrienteering::Importer
source: Unsupported obsolete file format version. Please use program version v%1 or older to load and update the file.
ta: ஆதரிக்கப்படாத வழக்கற்றுப்போன கோப்பு வடிவமைப்பு பதிப்பு. கோப்பை ஏற்றவும் புதுப்பிக்கவும் நிரல் பதிப்பு V%1 அல்லது அதற்கு மேற்பட்டதைப் பயன்படுத்தவும்.

# OpenOrienteering::Importer
source: Invalid file format version.
ta: தவறான கோப்பு வடிவமைப்பு பதிப்பு.

# OpenOrienteering::Importer
source: Unsupported old file format version. Please use an older program version to load and update the file.
ta: ஆதரிக்கப்படாத பழைய கோப்பு வடிவமைப்பு பதிப்பு. கோப்பை ஏற்றவும் புதுப்பிக்கவும் பழைய நிரல் பதிப்பைப் பயன்படுத்தவும்.

# OpenOrienteering::Importer
source: Unsupported file format.
ta: ஆதரிக்கப்படாத கோப்பு வடிவம்.

# OpenOrienteering::Importer
source: Unsupported new file format version. Some map features will not be loaded or saved by this version of the program.
ta: ஆதரிக்கப்படாத புதிய கோப்பு வடிவமைப்பு பதிப்பு. நிரலின் இந்த பதிப்பால் சில வரைபட நற்பொருத்தங்கள் ஏற்றப்படாது அல்லது சேமிக்கப்படாது.
