Repository: 247i/TACETr
Catalog: உரை/தானி/opentracks-app-store-metadata-files-*.po
Languages: ta

# changelogs/4448.txt:1
source: v3.20.2: OpenTracks Changes: - Elevation gain and loss are integers instead of floats - Ask for permission before using Bluetooth by a Toast message Bugfix: - Set FLAG_IMMUTABLE for PendingIntents to avoid crash on Android 12 - Cadence sensor returns 0 instead of None when user is not pedaling - Speed sensor returns 0 instead of the last speed when it's stopped - With sensors, moving time stops when is not moving
ta: v3.20.2: ஓபன்ட்ராக்ச் மாற்றங்கள்: - மிதவைகளுக்குப் பதிலாக உயரத்தை ஆதாயம் மற்றும் இழப்பு என்பது எண்கள் - ஒரு சிற்றுண்டி செய்தியால் புளூடூத்தை பயன்படுத்துவதற்கு முன் இசைவு கேளுங்கள் பிழைத்திருத்த: - ஆண்ட்ராய்டு 12 இல் செயலிழப்பதைத் தவிர்ப்பதற்கு நிலுவைத் தொகைக்கு கொடி_இம் செய்யக்கூடியதாக அமைக்கவும் - பயனர் பெடலிங் செய்யாதபோது எதற்கும் பதிலாகக் காடென்ச் சென்சார் 0 ஐ வழங்குகிறது - வேக சென்சார் நிறுத்தப்படும்போது கடைசி வேகத்திற்கு பதிலாக 0 ஐ வழங்குகிறது - சென்சார்களுடன், நகரும் நேரம் நகரும்போது நிறுத்தப்படும்

# changelogs/4496.txt:1
source: v3.21.0: OpenTracks Changes: - While recording: remove idle/non-idle creation of TrackPoints - Settings are now in separate folders - Opening OpenTracks from notification (while recording) and pressing back opens track list - GPX compatibilty: support <speed> for import Bugfixes: - Altitude and distance (from BlE sensor): only reset counters if data was actually stored - Import without speed, requires computing speed - BLE running sensor not connected, should not be reported as present - BLE running sensor: show data while recording - Activity type icon was not updated while changing activity Developer: - SharedPrefences via static reference - Tests are executed against in-memory database - TrackRecordingManager keeps last TrackPoint in memory
ta: v3.21.0: Opentracks மாற்றங்கள்: - பதிவு செய்யும்போது: டிராக் பாயிண்டுகளின் செயலற்ற அல்லாத உருவாக்கத்தை அகற்று - அமைப்புகள் இப்போது தனி கோப்புறைகளில் உள்ளன - அறிவிப்பிலிருந்து OpenTracks ஐத் திறந்து (பதிவு செய்யும்போது) மீண்டும் அழுத்தினால் டிராக் பட்டியல் திறக்கும். - GPX compatibilty: support <speed> க்கு import பிழைத்திருத்தங்கள்: - உயரம் மற்றும் தூரம் (பி.எல்.இ சென்சாரிலிருந்து): தரவு உண்மையில் சேமிக்கப்பட்டிருந்தால் மட்டுமே கவுண்டர்களை மீட்டமைக்கவும் - விரைவு இல்லாமல் இறக்குமதி செய்ய, கணினி விரைவு தேவை - ப்ளூ இயங்கும் சென்சார் இணைக்கப்படவில்லை, தற்போது போலப் புகாரளிக்கக் கூடாது - BLE இயங்கும் சென்சார்: பதிவு செய்யும்போது தரவைக் காட்டு - செயல்பாட்டை மாற்றும்போது செயல்பாட்டு வகை படவுரு புதுப்பிக்கப்படவில்லை டெவலப்பர்: - நிலையான குறிப்பு வழியாகப் பகிரப்பட்டவை - நினைவக தரவுத்தளத்திற்கு எதிராகச் சோதனைகள் செயல்படுத்தப்படுகின்றன - ட்ராக் ரெக்கார்டிங்மேனேசர் கடைசி ட்ராக் பாயிண்ட்டை நினைவகத்தில் வைத்திருக்கிறது

# changelogs/4519.txt:1
source: v3.22.0: OpenTracks Changes: - Locations are only stored if traveled distance > recording distance interval (removed left over functionality from idle/non-idle detection) - UI can be configured to show a clock - Idle speed is now configurable Bugfix: - Intervals: crash when gain but not loss was stored - While recording: prevent crash when disabling voice announcements
ta: V3.22.0: Opentracks மாற்றங்கள்: - பயணம் செய்தால் மட்டுமே இடங்கள் சேமிக்கப்படும்> தூர இடைவெளியைப் பதிவுசெய்க (செயலற்ற கண்டறிதலிலிருந்து செயல்பாட்டுக்கு மேல் அகற்றப்பட்டது) - ஒரு கடிகாரத்தைக் காட்ட இடைமுகம் ஐ கட்டமைக்க முடியும் - செயலற்ற விரைவு இப்போது கட்டமைக்கப்படுகிறது பிழைத்திருத்த: - இடைவெளிகள்: லாபம் ஆனால் இழப்பு சேமிக்கப்படாதபோது செயலிழப்பு - பதிவு செய்யும்போது: குரல் அறிவிப்புகளை முடக்கும்போது செயலிழப்பைத் தடுக்கவும்

# changelogs/4580.txt:1
source: v3.23.0: OpenTracks Changes: - Added UI profiles - Aggregated statistics for selected tracks - Re-implemented idle/non-idle TrackPoints as moving time stopped working (introduced in v3.22.0) Bugfixes: - BLE sensors: clear data on disconnect - Automatic export needs to persist permission
ta: v3.23.0: Opentracks மாற்றங்கள்: - இடைமுகம் சுயவிவரங்கள் சேர்க்கப்பட்டன - தேர்ந்தெடுக்கப்பட்ட தடங்களுக்கான ஒருங்கிணைந்த புள்ளிவிவரங்கள் -நகரும் நேரம் வேலை செய்வதை நிறுத்துவதால் மீண்டும் செயல்படுத்தப்பட்ட செயலற்ற டிராக் பாயிண்ட்ச் (V3.22.0 இல் அறிமுகப்படுத்தப்பட்டது) பிழைத்திருத்தங்கள்: - பி.எல்.இ சென்சார்கள்: துண்டிக்கப்படுவதற்கான தரவை அழிக்கவும் - தானியங்கி ஏற்றுமதி தொடர்ந்து அனுமதிக்க வேண்டும்

# changelogs/4646.txt:1
source: v3.24.0: OpenTracks Changes: - GPS is optional (also for indoor use): if using a BLE sensors that provide distance are used - Settings: option to disable BLE filtering of devices - Charts: altitude starts at minimal value instead of 0m. - UI supports showing stored timezone information Bugfix: - Re-added workaround for crash due to clock traveling back in time (workaround was removed in v3.23.0) - Removed unecessary workaround for BLE cycling sensor (RTFM) - GPX importer did not handle missing data properly Developer: - BLE sensors report data event-driven than pull-based - Reworked and added integration tests for recording
ta: v3.24.0: Opentracks மாற்றங்கள்: - சி.பி.எச் விருப்பமானது (உட்புற பயன்பாட்டிற்கும்): தூரத்தை வழங்கும் பி.எல்.இ சென்சார்களைப் பயன்படுத்தினால் பயன்படுத்தப்பட்டால் - அமைப்புகள்: சாதனங்களின் BLE வடிகட்டலை முடக்க விருப்பம் - விளக்கப்படங்கள்: உயரம் 0M க்கு பதிலாகக் குறைந்தபட்ச மதிப்பில் தொடங்குகிறது. - சேமிக்கப்பட்ட நேர மண்டல தகவல்களைக் காண்பிப்பதை இடைமுகம் ஆதரிக்கிறது பிழைத்திருத்த: - கடிகாரம் சரியான நேரத்தில் பயணித்ததால் விபத்துக்கான மறு சேர்க்கப்பட்ட பணித்தொகுப்பு (V3.23.0 இல் பணித்தொகுப்பு அகற்றப்பட்டது) - பி.எல்.இ சைக்கிள் ஓட்டுதல் சென்சார் (ஆர்.டி.எஃப்.எம்) க்கான தேவையற்ற பணித்தொகுப்பு அகற்றப்பட்டது - காணாமல் போன தரவை சிபிஎக்ச் இறக்குமதியாளர் சரியாகக் கையாளவில்லை டெவலப்பர்: -BLE சென்சார்கள் புல் அடிப்படையிலானதை விடத் தரவு நிகழ்வு-இயக்கப்படும் என்று தெரிவிக்கின்றன - பதிவு செய்வதற்கான ஒருங்கிணைப்பு சோதனைகளை மறுவேலை செய்து சேர்த்தது

# changelogs/4692.txt:1
source: v3.24.1: OpenTracks Changes: - Added API for starting recordings from other applications (disabled by default) - Shortened ISO8601 track names - BLE distance sensors: store GPS-locations based upon previous GPS-locations Bugfix: - While recording: fixed crash when opening charts - TrackDataHub should end processing after stop() - Prevent rare crash while deleting tracks Developer: - Refactored package structure - Monotonic clock - Value objects for heartrate, cadence, and power
ta: v3.24.1: Opentracks மாற்றங்கள்: - பிற பயன்பாடுகளிலிருந்து பதிவுகளைத் தொடங்க பநிஇ சேர்க்கப்பட்டது (இயல்பாக முடக்கப்பட்டுள்ளது) - சுருக்கப்பட்ட ISO8601 ட்ராக் பெயர்கள் -பிளே தூர சென்சார்கள்: முந்தைய சி.பி.எச்-இடங்களின் அடிப்படையில் சி.பி.எச்-இடங்களை சேமிக்கவும் பிழைத்திருத்த: - பதிவு செய்யும்போது: விளக்கப்படங்களைத் திறக்கும்போது நிலையான செயலிழப்பு - ட்ராக்டாடாஅப் நிறுத்தத்திற்குப் பிறகு செயலாக்கத்தை முடிக்க வேண்டும் () - தடங்களை நீக்கும்போது அரிதான செயலிழப்பைத் தடுக்கவும் டெவலப்பர்: - மறுசீரமைக்கப்பட்ட தொகுப்பு அமைப்பு - மோனோடோனிக் கடிகாரம் - ஆர்ட்ரேட், கேடென்ச் மற்றும் சக்திக்கான மதிப்பு

# changelogs/4752.txt:1
source: v3.25.0: OpenTracks Changes: - GPS is now optional incl. GPS disabled warning - PublicAPI: other applications can now receive recorded data if they start a recording (implemented for Gadgetbridge) - New activities: swimming, swimming open, and workout - Removed share pic functionality Bugfix: - UI: speed/elevation where jumping between 0.0 and the actual value - Tracks with emojis can be exported
ta: v3.25.0: ஓபன்ட்ராக்ச் மாற்றங்கள்: - சி.பி.எச் இப்போது விருப்பத்தேர்வு உள்ளிட்டுள்ளது. சி.பி.எச் முடக்கப்பட்ட எச்சரிக்கை . - புதிய செயல்பாடுகள்: நீச்சல், நீச்சல் திறந்த மற்றும் பயிற்சி - அகற்றப்பட்ட பங்கு படம் செயல்பாடு பிழைத்திருத்த: - UI: 0.0 மற்றும் உண்மையான மதிப்புக்கு இடையில் குதிக்கும் வேகம்/உயரம் - ஈமோசிகளுடன் தடங்களை ஏற்றுமதி செய்யலாம்

# changelogs/4755.txt:1
source: v3.25.1: OpenTracks Bugfix: - Automatic export: hopefully prevent silent failures - Automatic export: prevent crash
ta: v3.25.1: ஓபன்ட்ராக்ச் பிழைத்திருத்த: - தானியங்கி ஏற்றுமதி: அமைதியான தோல்விகளைத் தடுக்கும் - தானியங்கி ஏற்றுமதி: செயலிழப்பதைத் தடுக்கவும்

# changelogs/4773.txt:1
source: v3.26.0: OpenTracks Changes: - Voice announcements are configurable - Voice announcements of heart rate Bugfix: - Crash due to race condition
ta: V3.26.0: Opentracks மாற்றங்கள்: - குரல் அறிவிப்புகள் உள்ளமைக்கக்கூடியவை - இதய துடிப்பு குரல் அறிவிப்புகள் பிழைத்திருத்த: - பந்தய நிலை காரணமாக செயலிழப்பு

# changelogs/4775.txt:1
source: v3.26.1: OpenTracks Bugfix: - Contextual action bar didn't overlap toolbar in night theme.
ta: v3.26.1: Opentracks பிழைத்திருத்த: - சூழல் அதிரடி பட்டி இரவு கருப்பொருளில் கருவிப்பட்டியை ஒன்றுடன் ஒன்று சேர்க்கவில்லை.

# changelogs/4816.txt:1
source: v3.27.0: OpenTracks Changes: - Voice annoucements: add 100m, 200m, and 500m - Interval: add 100m and 500m - Clock shows now also seconds - GPX, KML, KMZ: export and import horizontal accuracy - GPX: export cumulative distance via clustrust extension - CSV: basic export (TrackPoints only; not for backup) - Workaround for Tickr X as it reports SPM instead of RPM Bugfixes: - Adhere to recording distance interval; TrackPoints were recorded although they were too close - Prevent crash on stop recording (race condition) - Prevent crash when using multiple sensors (race condition) - Prevent crash when opening OpenTracks via notification
ta: V3.27.0: Opentracks மாற்றங்கள்: - குரல் அன்னியூசென்ச்: 100 மீ, 200 மீ மற்றும் 500 மீ - இடைவெளி: 100 மீ மற்றும் 500 மீ சேர்க்கவும் - கடிகாரம் இப்போது விநாடிகளையும் காட்டுகிறது - சி.பி.எக்ச், கே.எம்.எல், கே.எம்.இசட்: கிடைமட்ட துல்லியத்தை ஏற்றுமதி செய்து இறக்குமதி செய்க - சி.பி.எக்ச்: கிளச்ட்ரச்ட் நீட்டிப்பு வழியாக ஒட்டுமொத்த தூரத்தை ஏற்றுமதி செய்யுங்கள் - சி.எச்.வி: அடிப்படை ஏற்றுமதி (டிராக் பாயிண்ட்ச் மட்டும்; காப்புப்பிரதிக்கு அல்ல) - ஆர்.பி.எம் -க்கு பதிலாக எச்.பி.எம் பிழைத்திருத்தங்கள்: - தூர இடைவெளியைப் பதிவுசெய்வது; ட்ராக் பாயிண்டுகள் மிக நெருக்கமாக இருந்தபோதிலும் பதிவு செய்யப்பட்டன - ச்டாப் ரெக்கார்டிங் (ரேச் நிலை) இல் செயலிழப்பதைத் தடுக்கவும் - பல சென்சார்களைப் பயன்படுத்தும்போது செயலிழப்பைத் தடுக்கவும் (ரேச் நிலை) - அறிவிப்பு வழியாக ஓபன்ட்ராக்சைத் திறக்கும்போது செயலிழப்பைத் தடுக்கவும்

# changelogs/4829.txt:1
source: v3.28.0: OpenTracks Changes: - Configurable filename for export/sharing (default: {starttime}_{name}.{suffix}) - Vertical GPS accuracy is now stored and can be exported/imported (API level >= 26).
ta: v3.28.0: Opentracks மாற்றங்கள்: - ஏற்றுமதி/பகிர்வுக்கான கட்டமைக்கக்கூடிய கோப்பு பெயர் (இயல்புநிலை: {starttime} _ {name}. {suffix}) - செங்குத்து சி.பி.எச் துல்லியம் இப்போது சேமிக்கப்பட்டு ஏற்றுமதி செய்யலாம்/இறக்குமதி செய்யப்படலாம் (ஏபிஐ நிலை> = 26).

# changelogs/4874.txt:1
source: v4.0.0: OpenTracks Changes: - UI refactoring with a Bottom App Bar. - Public API: implemented STOP properly. - Cleanup: use explicit preference identifiers for TrackFileFormat. - Improvements on BLE handler. - Add exception handler and show error activity so users can send reports about bugs. - Android 13: launcher icon, provide a themed icon. - Change track title capitalization to sentences. - Translations updated. Bugfix: - Sharing track added file suffix twice. - Unit system not loaded correctly. - File format template was not loaded (NPE). - Public API: respect post-workout export. Developer: - Move to androix.constraintlayout. - UI tests slightly more robust. - Refactor permission request. - Upgrade to gradlew 7.4.2 - Bump material from 1.5.0 to 1.6.0
ta: v4.0.0: Opentracks மாற்றங்கள்: - கீழ் பயன்பாட்டு பட்டியுடன் இடைமுகம் மறுசீரமைப்பு. - பொது ஏபிஐ: சரியாகச் செயல்படுத்தப்பட்டது. - தூய்மைப்படுத்துதல்: ட்ராக்ஃபைல்ஃபார்மட்டுக்கு வெளிப்படையான விருப்பத்தேர்வுகளைப் பயன்படுத்தவும். - BLE ஏண்ட்லரில் மேம்பாடுகள். - விதிவிலக்கு கையாளுபவரைச் சேர்த்து பிழை செயல்பாட்டைக் காட்டுங்கள், இதனால் பயனர்கள் பிழைகள்பற்றிய அறிக்கைகளை அனுப்ப முடியும். - ஆண்ட்ராய்டு 13: துவக்கி படவுரு, ஒரு கருப்பொருள் ஐகானை வழங்கவும். - டிராக் தலைப்பு மூலதனத்தை வாக்கியங்களுக்கு மாற்றவும். - மொழிபெயர்ப்புகள் புதுப்பிக்கப்பட்டன. பிழைத்திருத்த: - டிராக் சேர்க்கப்பட்ட கோப்பு பின்னொட்டை இரண்டு முறை பகிர்வது. - அலகு அமைப்பு சரியாக ஏற்றப்படவில்லை. - கோப்பு வடிவமைப்பு வார்ப்புரு ஏற்றப்படவில்லை (NPE). - பொது ஏபிஐ: வொர்க்அவுட்டுக்கு பிந்தைய ஏற்றுமதியை மதிக்கவும். டெவலப்பர்: - androix.constraintlayout க்கு நகர்த்தவும். - இடைமுகம் சற்று வலுவான சோதனைகள். - மறுசீரமைப்பு இசைவு கோரிக்கை. - கிரேட்லேவுக்கு மேம்படுத்தவும் 7.4.2 - பம்ப் பொருள் 1.5.0 முதல் 1.6.0 வரை

# changelogs/4926.txt:1
source: v4.0.1: OpenTracks Changes: - Voice announcements are now configurable - Fullscreen mode now also hides Android's navigation bar - Connection to BLE sensors should now be faster - Allow to reset settings while recording - Allow to change import/export settings while recording - KML/KMZ: do not use icons to be loaded from Google Bugfix: - TrackStoppedActivity now works on smaller screens - Requests permissions on track list
ta: V4.0.1: Opentracks மாற்றங்கள்: - குரல் அறிவிப்புகள் இப்போது கட்டமைக்கப்படுகின்றன - முழுத்திரை பயன்முறை இப்போது ஆண்ட்ராய்டு இன் வழிசெலுத்தல் பட்டையும் மறைக்கிறது - பி.எல்.இ சென்சார்களுக்கான இணைப்பு இப்போது வேகமாக இருக்க வேண்டும் - பதிவு செய்யும்போது அமைப்புகளை மீட்டமைக்க அனுமதிக்கவும் - பதிவு செய்யும்போது இறக்குமதி/ஏற்றுமதி அமைப்புகளை மாற்ற அனுமதிக்கவும் - KML/KMZ: Google இலிருந்து ஏற்ற ஐகான்களைப் பயன்படுத்த வேண்டாம் பிழைத்திருத்த: - ட்ராக்ச்டாப்டாக்டிவிட்டி இப்போது சிறிய திரைகளில் வேலை செய்கிறது - தட பட்டியலில் கோரிக்கைகள் அனுமதிகள்

# changelogs/4938.txt:1
source: v4.0.2: OpenTracks Changes: - Add nautical miles - Settings can be reset while recording Bugfix: - Voice announcement rounding - Chart: elevation was weirdly smoothed - Export was not checking if file exists
ta: V4.0.2: Opentracks மாற்றங்கள்: - கடல் மைல்கள் சேர்க்கவும் - பதிவு செய்யும் போது அமைப்புகளை மீட்டமைக்க முடியும் பிழைத்திருத்த: - குரல் அறிவிப்பு ரவுண்டிங் - விளக்கப்படம்: உயரம் வித்தியாசமாக மென்மையாக்கப்பட்டது - கோப்பு இருக்கிறதா என்று ஏற்றுமதி சரிபார்க்கவில்லை

# changelogs/4951.txt:1
source: v4.0.3: OpenTracks Changes: - Max. speed as reported by sensor (GPS or BLE) Bugfix: - Prevent crash if OSM Dashboard is not installed - GPX track export: do not export empty track segments
ta: V4.0.3: Opentracks மாற்றங்கள்: - அதிகபட்சம். சென்சார் (சி.பி.எச் அல்லது பி.எல்.இ) அறிவித்த வேகம் பிழைத்திருத்த: - ஓஎச்எம் டாச்போர்டு நிறுவப்படவில்லை என்றால் செயலிழப்பைத் தடுக்கவும் - சிபிஎக்ச் டிராக் ஏற்றுமதி: வெற்று தட பிரிவுகளை ஏற்றுமதி செய்ய வேண்டாம்

# changelogs/4981.txt:1
source: v4.0.4: OpenTracks Changes: - Store BLE sensor data even without distance (every 10s) - Public API: allows setting name, category, and description Bugfix: - Crash when taking a picture and rotating the phone - Developer: - Target SDK 33 - Barometer uses interval of 5s
ta: V4.0.4: Opentracks மாற்றங்கள்: - தூரமின்றி கூட (ஒவ்வொரு 10 களும்) BLE சென்சார் தரவை சேமிக்கவும் - பொது ஏபிஐ: பெயர், வகை மற்றும் விளக்கத்தை அமைக்க அனுமதிக்கிறது பிழைத்திருத்த: - ஒரு படத்தை எடுத்து தொலைபேசியை சுழற்றும்போது செயலிழப்பு - டெவலப்பர்: - இலக்கு SDK 33 - காற்றழுத்தமானி 5 களின் இடைவெளியைப் பயன்படுத்துகிறது

# changelogs/4986.txt:1
source: v4.0.5: OpenTracks Changes: - PlayStore relase get's another logo Bugfix: - Interval list shows "-" if gain/loss is not present
ta: V4.0.5: Opentracks மாற்றங்கள்: - பிளேச்டோர் ரிலேச் கெட் மற்றொரு லோகோ பிழைத்திருத்த: - இடைவெளி பட்டியல் "-" ஐ ஆதாயம்/இழப்பு இல்லை என்றால் காட்டுகிறது

# changelogs/4993.txt:1
source: v4.0.6: OpenTracks Bugfix: - EGM2008 offset computed wrong for negative longitudes - PublicAPI crashed if OpenTracks was in background (API26+)
ta: V4.0.6: Opentracks பிழைத்திருத்த: - EGM2008 ஆஃப்செட் எதிர்மறையான நீளத்திற்கு தவறு கணக்கிடப்பட்டது - ஓபன்ட்ராக்ச் பின்னணியில் இருந்தால் பப்ளேபி செயலிழந்தது (API26+)

# changelogs/5004.txt:1
source: v4.0.7: OpenTracks Changes: - GPS signal lost timeout: 30s - Android13: request permission to show notifications - Faster deletion of tracks (vacuum database only if needed) Bugfix: - PublicAPI stop command resulted in crash (introduced in v4.0.6) - Permissions: request all permissions during on startup
ta: V4.0.7: Opentracks மாற்றங்கள்: - சி.பி.எச் சிக்னல் இழந்த நேரம் முடிந்தது: 30 கள் - Android13: அறிவிப்புகளைக் காட்ட இசைவு கோருங்கள் - தடங்களை வேகமாக நீக்குதல் (தேவைப்பட்டால் மட்டுமே வெற்றிட தரவுத்தளம்) பிழைத்திருத்த: - பப்ளாபி ச்டாப் கட்டளை விபத்துக்குள்ளானது (V4.0.6 இல் அறிமுகப்படுத்தப்பட்டது) - அனுமதிகள்: தொடக்கத்தில் அனைத்து அனுமதிகளையும் கோருங்கள்

# changelogs/5017.txt:1
source: v4.0.8: OpenTracks Changes: - Altitude always shown in m/ft - Show track timezone if different than device timezone - PublicAPI: support setting the track icon explicitly Developer: - Introduced DistanceFormatter - Upgrade to AGP 7.3/desugar for Duration.class - Android12+: do splashscreen via Androidx
ta: V4.0.8: Opentracks மாற்றங்கள்: - உயரம் எப்போதும் m/ft இல் காட்டப்பட்டுள்ளது - சாதன நேர மண்டலத்தை விட வித்தியாசமாக இருந்தால் ட்ராக் டைம் மண்டலத்தைக் காட்டு - பப்ளேபிஐ: ட்ராக் ஐகானை வெளிப்படையாக அமைப்பதை ஆதரிக்கவும் டெவலப்பர்: - அறிமுகப்படுத்தப்பட்ட டிச்டம்ஃபார்மேட்டர் - காலத்திற்கு AGP 7.3/Desugar க்கு மேம்படுத்தவும் - Android12+: Androidx வழியாக ச்பிளாச்ச்கிரீன் செய்யுங்கள்

# changelogs/5042.txt:1
source: v4.1.0: OpenTracks Changes: - Export KML/KMZ version 2.3 only (was 2.2) - For crank-based powermeters: fetch cadence Bugfix: - Workaround for crash on "import all"
ta: V4.1.0: Opentracks மாற்றங்கள்: - KML/KMZ பதிப்பு 2.3 மட்டுமே ஏற்றுமதி செய்யுங்கள் (இருந்தது 2.2) - கிராங்க் அடிப்படையிலான பவர்மீட்டர்களுக்கு: காடென்சைப் பெறுங்கள் பிழைத்திருத்த: - "அனைத்தையும் இறக்குமதி" செய்வதில் செயலிழப்பதற்கான பணித்தொகுப்பு

# changelogs/5051.txt:1
source: v4.1.1: OpenTracks Changes: - Add introduction screen (show once) Bugfix: - Do not crash if no GPS device is present
ta: V4.1.1: Opentracks மாற்றங்கள்: - அறிமுகத் திரையைச் சேர்க்கவும் (ஒரு முறை காட்டு) பிழைத்திருத்த: - சி.பி.எச் சாதனம் இல்லை என்றால் செயலிழக்க வேண்டாம்

# changelogs/5080.txt:1
source: v4.1.2: OpenTracks Changes: - Voice announcements only use on decimal for distance Bugfix: - Crash when stopping (race condition) Developer: - Github actions: disabled instrumentation testing (too slow) - Tests are done with only fake GPS data
ta: V4.1.2: Opentracks மாற்றங்கள்: - குரல் அறிவிப்புகள் தூரத்திற்கு தசமத்தில் மட்டுமே பயன்படுத்துகின்றன பிழைத்திருத்த: - நிறுத்தும்போது செயலிழப்பு (பந்தய நிலை) டெவலப்பர்: - அறிவிலிமையம் செயல்கள்: முடக்கப்பட்ட கருவி சோதனை (மிகவும் மெதுவாக) - போலி சி.பி.எச் தரவுகளுடன் மட்டுமே சோதனைகள் செய்யப்படுகின்றன

# changelogs/5119.txt:1
source: v4.2.0: OpenTracks Changes: - Show heartrate zone information Developer: - Migrated to hosted.weblate.org - Recording UI uses Views directly
ta: v4.2.0: Opentracks மாற்றங்கள்: - ஆர்ட்ரேட் மண்டல தகவல்களைக் காட்டு டெவலப்பர்: - ஓச்டட்.வ்லேட்.ஆர்சுக்கு இடம்பெயர்ந்தது - இடைமுகம் ஐ பதிவுசெய்தல் பார்வைகளை நேரடியாகப் பயன்படுத்துகிறது

# changelogs/5132.txt:1
source: v4.2.1: OpenTracks Changes: - Speed sensor: acceptable wheel diameter is 100mm-4000mm Bugfix: - Reconnect to a sensor if connection is lost
ta: V4.2.1: Opentracks மாற்றங்கள்: - வேக சென்சார்: ஏற்றுக்கொள்ளக்கூடிய சக்கர விட்டம் 100 மிமீ -4000 மிமீ ஆகும் பிழைத்திருத்த: - இணைப்பு இழந்தால் சென்சாருடன் மீண்டும் இணைக்கவும்

# changelogs/5141.txt:1
source: v4.2.2: OpenTracks Bugfix: - Track icon wrongly shown in dialog - Textcolor for heartrate zone 1 was ignoring theme - Not all activityTypes were shown in dropdownlist - Crash due to color not found
ta: V4.2.2: Opentracks பிழைத்திருத்த: - ஐகானைக் கண்காணிக்கவும் உரையாடலில் தவறாக காட்டப்பட்டுள்ளது - ஆர்ட்ரேட் மண்டலம் 1 க்கான டெக்ச்டோலர் கருப்பொருளைப் புறக்கணித்தது - அனைத்து செயல்பாட்டு வகைகளும் கீழ்தோன்றல் பட்டியலில் காட்டப்படவில்லை - வண்ணம் கிடைக்காததால் செயலிழப்பு

# changelogs/5151.txt:1
source: v4.3.0: OpenTracks Changes: - Allow backups (incl. encrypted to the Google) - Android 13: allow app-specific language settings
ta: v4.3.0: Opentracks மாற்றங்கள்: - காப்புப்பிரதிகளை அனுமதிக்கவும் (கூகிளில் குறியாக்கம் செய்யப்பட்டுள்ளது) - ஆண்ட்ராய்டு 13: பயன்பாட்டு-குறிப்பிட்ட மொழி அமைப்புகளை அனுமதிக்கவும்

# changelogs/5168.txt:1
source: v4.3.1: OpenTracks Changes: - Setting to skip voice announcements on device speaker Bugfix: - GPS disabled warning was falsely shown
ta: V4.3.1: Opentracks மாற்றங்கள்: - சாதன பேச்சாளரில் குரல் அறிவிப்புகளைத் தவிர்க்க அமைத்தல் பிழைத்திருத்த: - சி.பி.எச் முடக்கப்பட்ட எச்சரிக்கை பொய்யாக காட்டப்பட்டது

# changelogs/5189.txt:1
source: v4.3.2: OpenTracks Bugfix: - KML header was misformed (#1522) Developer: - Use Java 17 (multi-line text, switch) - API33: locale config is generated
ta: V4.3.2: Opentracks பிழைத்திருத்த: - கே.எம்.எல் தலைப்பு தவறாக வடிவமைக்கப்பட்டது (#1522) டெவலப்பர்: - சாவா 17 ஐப் பயன்படுத்தவும் (மல்டி-லைன் உரை, சுவிட்ச்) - API33: லோகேல் கட்டமைப்பு உருவாக்கப்படுகிறது

# changelogs/5194.txt:1
source: v4.3.3: OpenTracks Bugfixes: - Hidden fields were shown (introduced in v4.2.0) - Speed was shown instead of pace (introduced in v4.2.0)
ta: V4.3.3: Opentracks பிழைத்திருத்தங்கள்: - மறைக்கப்பட்ட புலங்கள் காட்டப்பட்டன (V4.2.0 இல் அறிமுகப்படுத்தப்பட்டது) - வேகத்திற்கு பதிலாக விரைவு காட்டப்பட்டது (V4.2.0 இல் அறிமுகப்படுத்தப்பட்டது)

# changelogs/5196.txt:1
source: v4.3.4: OpenTracks Bugfix: - Android 13: regional locales could not be selected (introduced in v4.3.0)
ta: V4.3.4: Opentracks பிழைத்திருத்த: - ஆண்ட்ராய்டு 13: பிராந்திய இடங்களைத் தேர்ந்தெடுக்க முடியவில்லை (V4.3.0 இல் அறிமுகப்படுத்தப்பட்டது)

# changelogs/5211.txt:1
source: v4.3.5: OpenTracks Bugfix: - Sensor parsing had a overflow one off bug (#1559) - Insert marker: don't crash if no camera app is installed (#1561)
ta: V4.3.5: Opentracks பிழைத்திருத்த: - சென்சார் பாகுபடுத்தல் ஒரு வழிதல் ஒரு ஆஃப் பிழை (#1559) - மார்க்கரைச் செருகவும்: கேமரா பயன்பாடு எதுவும் நிறுவப்படவில்லை என்றால் செயலிழக்க வேண்டாம் (#1561)

# changelogs/5222.txt:1
source: v4.4.0: OpenTracks Changes: - Export all tracks as one file
ta: V4.4.0: Opentracks மாற்றங்கள்: - அனைத்து தடங்களையும் ஒரு கோப்பாக ஏற்றுமதி செய்யுங்கள்

# changelogs/5262.txt:1
source: v4.5.0: OpenTracks Changes: - Material3 - App shortcut for aggregated statistics - New Unit: miles with meters Bugfix: - GPS disabled warnings shown repeatedly (#1429) Developer: - Use Java Records - Target API34 - Refactor sensor handling
ta: V4.5.0: Opentracks மாற்றங்கள்: - பொருள் 3 - ஒருங்கிணைந்த புள்ளிவிவரங்களுக்கான பயன்பாட்டு குறுக்குவழி - புதிய அலகு: மீட்டர் கொண்ட மைல்கள் பிழைத்திருத்த: - சி.பி.எச் முடக்கப்பட்ட எச்சரிக்கைகள் மறுநிகழ்வுகள் காட்டப்பட்டுள்ளன (#1429) டெவலப்பர்: - சாவா பதிவுகளைப் பயன்படுத்தவும் - இலக்கு API34 - ரெஃபாக்டர் சென்சார் கையாளுதல்

# changelogs/5286.txt:1
source: v4.6.0: OpenTracks Changes: - Voice announcements use ICU plural format (en, es, pt, zh, dr, de) due to fractional quanitites #1584 - Requires Android 7.0 / SDK24+ due to ICU plurals - On Android 14+: use Android's AltitudeConverter instead of internal EGM2008 Bugfix: - Android 13 couldn't select images from gallery Developer: - Split ActivityType and ActivityIcon
ta: V4.6.0: Opentracks மாற்றங்கள்: . - ஐ.சி.யு பன்மை காரணமாக ஆண்ட்ராய்டு 7.0 / SDK24+ தேவை . பிழைத்திருத்த: - ஆண்ட்ராய்டு 13 கேலரியிலிருந்து படங்களைத் தேர்ந்தெடுக்க முடியவில்லை டெவலப்பர்: - பிளவு செயல்பாட்டு வகை மற்றும் செயல்பாடு

# changelogs/5289.txt:1
source: v4.6.1: OpenTracks Bugfix: - Re-added aggregated statistics per selected tracks
ta: V4.6.1: Opentracks பிழைத்திருத்த: - தேர்ந்தெடுக்கப்பட்ட தடங்களுக்கு மீண்டும் கூட்டப்பட்ட புள்ளிவிவரங்கள்

# changelogs/5305.txt:1
source: v4.6.2: OpenTracks Bugfix: - Crash on voice annoucement for imperial+meter - Crash on settings for imperial+meter - Fixed clipping of charts (Material3 upgrade) - Bluetooth settings handle missing permission - Aggregated stats didn't show imperial units for avg speed
ta: V4.6.2: Opentracks பிழைத்திருத்த: - இம்பீரியல்+மீட்டருக்கான குரல் அறிவிப்பில் செயலிழப்பு - இம்பீரியல்+மீட்டருக்கான அமைப்புகளில் செயலிழப்பு - விளக்கப்படங்களின் நிலையான கிளிப்பிங் (பொருள் 3 மேம்படுத்தல்) - ஊடலை அமைப்புகள் காணாமல் போன அனுமதியைக் கையாளுகின்றன - ஒருங்கிணைந்த புள்ளிவிவரங்கள் ஏ.வி.சி வேகத்திற்கு ஏகாதிபத்திய அலகுகளைக் காட்டவில்லை
