Repository: 247i/TACETr
Catalog: உரை/தானி/opentracks-app-store-metadata-files-*.po
Languages: ta

# changelogs/5313.txt:1
source: v4.7.0: OpenTracks Changes: - Statistics: distance, total time, and moving time are included between automatic segments (created due to distance too previous location too long) - Recorded tracks show sensor statistics again Bugfix: - GPX exporter: for automatic segments their might be no location - CSV exporter: distance didn't use decimal grouping
ta: v4.7.0: ஓபன்ட்ராக்ச் மாற்றங்கள்: . - பதிவுசெய்யப்பட்ட தடங்கள் மீண்டும் சென்சார் புள்ளிவிவரங்களைக் காட்டுகின்றன பிழைத்திருத்த: - சி.பி.எக்ச் ஏற்றுமதியாளர்: தானியங்கி பிரிவுகளுக்கு அவை இடமாக இருக்காது - சி.எச்.வி ஏற்றுமதியாளர்: தூரம் தசம குழுவை பயன்படுத்தவில்லை

# changelogs/5326.txt:1
source: v4.7.1: OpenTracks Bugfixes: - Android 14: crash on recording start (missing permissions) - Android 14: crash on track deletion (ForegroundService without reason) Developer: - AggregatedStats is now a RecyclerView
ta: v4.7.1: Opentracks பிழைத்திருத்தங்கள்: - ஆண்ட்ராய்டு 14: பதிவு தொடக்கத்தில் செயலிழப்பு (காணாமல் போன அனுமதிகள்) - ஆண்ட்ராய்டு 14: ட்ராக் நீக்குதலில் செயலிழப்பு (காரணமின்றி முன்புறம் சேவை) டெவலப்பர்: - திரட்டப்பட்டச்டாட்ச் இப்போது மறுசுழற்சி பார்வை

# changelogs/5361.txt:1
source: v4.8.0: OpenTracks Changes: - Permission: ACCESS_BACKGROUND_LOCATION is required due to API - Preparation for time-based idle detection - Drop distinguishing the source (GPS vs BLE sensors) for stored data Developer: - removed race condition workarounds (TrackRecordingService and GpsStatusManager) - TrackRecordingServiceConnection handles service shutdown
ta: V4.8.0: Opentracks மாற்றங்கள்: - அனுமதி: பநிஇ காரணமாக Access_background_location தேவை - நேர அடிப்படையிலான செயலற்ற கண்டறிதலுக்கான தயாரிப்பு - சேமிக்கப்பட்ட தரவுகளுக்கான மூலத்தை (சி.பி.எச் vs பி.எல்.இ சென்சார்கள்) வேறுபடுத்துகிறது டெவலப்பர்: . - TrackRecordingServiceConnection கையாளுகிறது பணி shutdown

# changelogs/5366.txt:1
source: v4.8.1: OpenTracks Bugfix: - Location permission was not granted due to ACCESS_LOCATION_BACKGROUND (removed)
ta: V4.8.1: Opentracks பிழைத்திருத்த: - அணுகல்_லோகேசன்_பேக் மைதானம் காரணமாக இருப்பிட இசைவு வழங்கப்படவில்லை (அகற்றப்பட்டது)

# changelogs/5382.txt:1
source: v4.8.2: OpenTracks Changes: - After recording export: show error message if unsuccessful
ta: V4.8.2: Opentracks மாற்றங்கள்: - ஏற்றுமதியைப் பதிவுசெய்த பிறகு: தோல்வியுற்றால் பிழை செய்தியைக் காட்டு

# changelogs/5389.txt:1
source: v4.8.3: OpenTracks Bugfix: - Android 14: prevent crash due to malformed UUID (example for filename template) Developer: - Marker list is now a RecyclerView
ta: V4.8.3: Opentracks பிழைத்திருத்த: - ஆண்ட்ராய்டு 14: தவறான UUID காரணமாக செயலிழப்பதைத் தடுக்கவும் (கோப்பு பெயர் வார்ப்புருவுக்கு எடுத்துக்காட்டு) டெவலப்பர்: - மார்க்கர் பட்டியல் இப்போது மறுசுழற்சி பார்வை

# changelogs/5399.txt:1
source: v4.8.4: OpenTracks Changes: - Show max power for recorded tracks Developer: - TrackList now uses RecyclerView
ta: V4.8.4: Opentracks மாற்றங்கள்: - பதிவுசெய்யப்பட்ட தடங்களுக்கு அதிகபட்ச சக்தியைக் காட்டு டெவலப்பர்: - டிராக்லிச்ட் இப்போது மறுசுழற்சி பார்வையைப் பயன்படுத்துகிறது

# changelogs/5428.txt:1
source: v4.9.0: OpenTracks NOTE: BREAKING CHANGE This release changes how OpenTracks determines moving and not moving. Until now, the speed (GPS or sensor) was used by a applying a threshold (e.g., less than 0.3 m/s). However, this may be very noise. From now on, a timeout duration is used (i.e., no significant change of position in the last X seconds). This duration is user configurable. The events of becoming idle are stored in the database incl. a timestamp, so statistics can be re-computed. A downgrade from this version is not implemented. Please backup all before upgrading. Changes: - Idle detection uses "no movement" duration rather than speed too low - Added scooter activity Bugfix: - While recording, TrackList showed all tracks as recording Developer: - Re-enabled Github action executing tests
ta: V4.9.0: Opentracks குறிப்பு: மாற்றத்தை உடைத்தல் இந்த வெளியீடு ஓபன்ட்ராக்ச் நகர்த்துவதையும் நகர்த்தப்படுவதையும் எவ்வாறு தீர்மானிக்கிறது என்பதை மாற்றுகிறது. இப்போது வரை, விரைவு (சி.பி.எச் அல்லது சென்சார்) ஒரு வாசலைப் பயன்படுத்துவதன் மூலம் பயன்படுத்தப்பட்டது (எ.கா., 0.3 மீ/வி க்கும் குறைவாக). இருப்பினும், இது மிகவும் சத்தமாக இருக்கலாம். இனிமேல், ஒரு காலக்கெடு காலம் பயன்படுத்தப்படுகிறது (அதாவது, கடைசி ஃச் விநாடிகளில் குறிப்பிடத் தக்க நிலை மாற்றம் இல்லை). இந்தக் காலம் பயனர் கட்டமைக்கக்கூடியது. சும்மா ஆகும் நிகழ்வுகள் தரவுத்தள உள்ளிட்டவற்றில் சேமிக்கப்படுகின்றன. ஒரு நேர முத்திரை, எனவே புள்ளிவிவரங்களை மீண்டும் கணக்கிட முடியும். இந்தப் பதிப்பிலிருந்து தரமிறக்குதல் செயல்படுத்தப்படவில்லை. மேம்படுத்துவதற்கு முன் அனைத்தையும் காப்புப் பிரதி எடுக்கவும். மாற்றங்கள்: - செயலற்ற கண்டறிதல் வேகத்தைவிட "இயக்கம் இல்லை" காலத்தைப் பயன்படுத்துகிறது - ச்கூட்டர் செயல்பாடு சேர்க்கப்பட்டது பிழைத்திருத்த: - பதிவு செய்யும்போது, ட்ராக்லிச்ட் அனைத்து தடங்களையும் பதிவாகக் காட்டியது டெவலப்பர்: - மீண்டும் இயக்கப்பட்ட அறிவிலிமையம் நடவடிக்கை சோதனைகளை இயக்கும்

# changelogs/5447.txt:1
source: v4.9.1: OpenTracks Bugfix: - Crash when doing multi select in track list
ta: V4.9.1: Opentracks பிழைத்திருத்த: - ட்ராக் பட்டியலில் மல்டி தேர்ந்தெடுக்கப்பட்டபோது செயலிழப்பு

# changelogs/5465.txt:1
source: v4.9.2: OpenTracks Changes: - Option to use Android 12's Dynamic Color (Material Design) - Android 14's Predictive Back for some activities Bugfix: - Settings for total distance voice announcement was accidentially removed
ta: V4.9.2: Opentracks மாற்றங்கள்: - ஆண்ட்ராய்டு 12 இன் மாறும் வண்ணத்தைப் பயன்படுத்த விருப்பம் (பொருள் வடிவமைப்பு) - சில செயல்களுக்கு ஆண்ட்ராய்டு 14 இன் முன்கணிப்பு பிழைத்திருத்த: - மொத்த தொலைதூர குரல் அறிவிப்புக்கான அமைப்புகள் விபத்து முறையில் அகற்றப்பட்டன

# changelogs/5491.txt:1
source: v4.9.3: OpenTracks Bugfix: - Prevent crash as toList() is not always available
ta: V4.9.3: Opentracks பிழைத்திருத்த: - டோலிச்ட் () எப்போதும் கிடைக்காததால் செயலிழப்பைத் தடுக்கவும்

# changelogs/5506.txt:1
source: v4.9.4: OpenTracks Bugfix: - Crash on Android 14 if permissions were not granted
ta: V4.9.4: Opentracks பிழைத்திருத்த: - அனுமதிகள் வழங்கப்படாவிட்டால் ஆண்ட்ராய்டு 14 இல் செயலிழப்பு

# changelogs/5527.txt:1
source: v4.9.5: OpenTracks Bugfix: - idle announcement setting is working again
ta: V4.9.5: Opentracks பிழைத்திருத்த: - செயலற்ற அறிவிப்பு அமைப்பு மீண்டும் செயல்படுகிறது

# changelogs/5554.txt:1
source: v4.9.6: OpenTracks Bugfix: - Export: existing files is now completely overwriting Developer: - Refactored barometric data processing
ta: V4.9.6: Opentracks பிழைத்திருத்த: - ஏற்றுமதி: இருக்கும் கோப்புகள் இப்போது முற்றிலும் மேலெழுதும் டெவலப்பர்: - மறுசீரமைக்கப்பட்ட பாரோமெட்ரிக் தரவு செயலாக்கம்

# changelogs/5559.txt:1
source: v4.9.7: OpenTracks Bugfix: - prevent crash when stopping a recording(introduced in v4.9.6)
ta: V4.9.7: Opentracks பிழைத்திருத்த: - ஒரு பதிவை நிறுத்தும்போது செயலிழப்பைத் தடுக்கவும் (V4.9.6 இல் அறிமுகப்படுத்தப்பட்டது)

# changelogs/5563.txt:1
source: v4.9.8: OpenTracks Bugfix: - Cycling cadence sensor works again (introduced in v4.9.6)
ta: V4.9.8: Opentracks பிழைத்திருத்த: - சைக்கிள் ஓட்டுதல் சென்சார் மீண்டும் செயல்படுகிறது (V4.9.6 இல் அறிமுகப்படுத்தப்பட்டது)

# changelogs/5573.txt:1
source: v4.9.9: OpenTracks Bugfix: - Crash when using a BLE sensor on recording end (race condition) Reason: sensor subsystem was started twice and only the 2nd one was shutdown. - While recording, BLE sensor names are shown again
ta: V4.9.9: Opentracks பிழைத்திருத்த: - ரெக்கார்டிங் எண்டில் பி.எல்.இ சென்சார் பயன்படுத்தும் போது செயலிழப்பு (ரேச் நிலை) காரணம்: சென்சார் துணை அமைப்பு இரண்டு முறை தொடங்கப்பட்டது, 2 வது ஒன்று மட்டுமே பணிநிறுத்தம் செய்யப்பட்டது. - பதிவு செய்யும் போது, பி.எல்.இ சென்சார் பெயர்கள் மீண்டும் காட்டப்படுகின்றன

# changelogs/5602.txt:1
source: v4.10.0: OpenTracks Changes: - Support gain/loss via BLE Environmental Sensing (barometer) - Internal barometer can be turned off (e.g., if broken) - Material3 for preference switches - SplashScreen supports day/night mode - Bluetooth sensor settings: show selected sensor name (if cached by Android) Bugfix: - Interval UI was misaligned Developer: - Cleanup TrackRecordingServiceConnection - TrackRecordingService always starts as ForegroundService
ta: V4.10.0: Opentracks மாற்றங்கள்: - BLE சுற்றுச்சூழல் உணர்திறன் (காற்றழுத்தமானி) வழியாக உதவி ஆதாயம்/இழப்பு - உள் காற்றழுத்தமானியை அணைக்கலாம் (எ.கா., உடைந்தால்) - முன்னுரிமை சுவிட்சுகளுக்கான பொருள் 3 - ச்பிளாச்ச்கிரீன் பகல்/இரவு பயன்முறையை ஆதரிக்கிறது - ஊடலை சென்சார் அமைப்புகள்: தேர்ந்தெடுக்கப்பட்ட சென்சார் பெயரைக் காட்டு (Android ஆல் சேமிக்கப்பட்டால்) பிழைத்திருத்த: - இடைவெளி இடைமுகம் தவறாக வடிவமைக்கப்பட்டது டெவலப்பர்: - Cleanup TrackRecordingServiceConnection - ட்ராக் ரெக்கார்டிங் பணி எப்போதும் முன்புற சேவையாகத் தொடங்குகிறது

# changelogs/5611.txt:1
source: v4.10.1: OpenTracks Changes: - Android 14: crash on recording start if permissions are not granted - Chart titles are more compact Bugfix: - BLE sensor re-connect resulted in crash (introduced in v4.9.6) - Cycling power was not processed (introduced in v4.9.6) - Cycling cadence as well as distance allow for repeated data - BLE barometer data was not processed correctly
ta: v4.10.1: ஓபன்ட்ராக்ச் மாற்றங்கள்: - ஆண்ட்ராய்டு 14: அனுமதிகள் வழங்கப்படாவிட்டால் பதிவு தொடக்கத்தில் செயலிழப்பு - விளக்கப்பட தலைப்புகள் மிகவும் கச்சிதமானவை பிழைத்திருத்த: - பி.எல்.இ சென்சார் மறு இணைப்பு விபத்துக்குள்ளானது (V4.9.6 இல் அறிமுகப்படுத்தப்பட்டது) - சைக்கிள் ஓட்டுதல் ஆற்றல் செயலாக்கப்படவில்லை (V4.9.6 இல் அறிமுகப்படுத்தப்பட்டது) - சைக்கிள் ஓட்டுதல் மற்றும் தூரம் மறுநிகழ்வு தரவை அனுமதிக்கிறது - BLE காற்றழுத்தமானி தரவு சரியாகச் செயலாக்கப்படவில்லை

# changelogs/5641.txt:1
source: v4.11.0: OpenTracks Changes: - Location for Markers is taken opening add dialog (was save) - Charts: use less sprace for axes - Charts: do not fill when showing more than two lines - Voice announcements improved (skip decimal if .0)
ta: v4.11.0: Opentracks மாற்றங்கள்: - குறிப்பான்களுக்கான இருப்பிடம் கூட்டு உரையாடலைத் திறக்கிறது (சேமிக்கப்பட்டது) - விளக்கப்படங்கள்: அச்சுகளுக்கு குறைந்த ச்ப்ரசைப் பயன்படுத்தவும் - விளக்கப்படங்கள்: இரண்டு வரிகளுக்கு மேல் காட்டும்போது நிரப்ப வேண்டாம் - குரல் அறிவிப்புகள் மேம்படுத்தப்பட்டன (என்றால் தசமத்தைத் தவிர்க்கவும் .0)

# changelogs/5679.txt:1
source: v4.11.1: OpenTracks Bugfix: - PublicAPI crashed when stopping
ta: v4.11.1: Opentracks பிழைத்திருத்த: - நிறுத்தும்போது பப்ளாபி செயலிழந்தது

# changelogs/5683.txt:1
source: v4.11.2: OpenTracks Bugfix: - Recording stopped when screen turned of (introduced in v4.11.1) (reverting da3dd29b8e44624a8222caea9067955f252ef5f8)
ta: v4.11.2: ஓபன்ட்ராக்ச் பிழைத்திருத்த: - திரை திரும்பும்போது பதிவு நிறுத்தப்பட்டது (V4.11.1 இல் அறிமுகப்படுத்தப்பட்டது) . (மாற்றியமைத்தல் da3dd29b8e44624a8222caea9067955f252ef5f8)

# changelogs/5705.txt:1
source: v4.11.3: OpenTracks Changes: - New sticker design! - New screenshots! - KMZ importer supports any KML file inside a KMZ Bugfix: - Marker list back button works - Public API stop shouldn't start foreground service (2nd try)
ta: v4.11.3: Opentracks மாற்றங்கள்: - புதிய ச்டிக்கர் வடிவமைப்பு! - புதிய திரை சாட்கள்! - KMZ இறக்குமதியாளர் ஒரு KMZ க்குள் எந்த KML கோப்பையும் ஆதரிக்கிறார் பிழைத்திருத்த: - மார்க்கர் பட்டியல் பின் பொத்தான் வேலை செய்கிறது - பொது பநிஇ நிறுத்தம் முன்புற சேவையைத் தொடங்கக்கூடாது (2 வது முயற்சி)

# changelogs/5725.txt:1
source: v4.12.0: OpenTracks Changes: - OLED friendly dark theme (requires manual restart) - Re-order settings (GPS is a sensor) Developer: - Added scripts for Fastlane to PlayStore upload (translations)
ta: v4.12.0: ஓபன்ட்ராக்ச் மாற்றங்கள்: - OLED நட்பு இருண்ட கருப்பொருள் (கையேடு மறுதொடக்கம் தேவை) - மறு-ஆர்டர் அமைப்புகள் (சி.பி.எச் ஒரு சென்சார்) டெவலப்பர்: - பிளேச்டோர் பதிவேற்றத்திற்கு ஃபாச்ட்லேனுக்கான ச்கிரிப்ட்கள் சேர்க்கப்பட்டன (மொழிபெயர்ப்பு)

# changelogs/5730.txt:1
source: v4.12.1: OpenTracks Bugfix: - Android 14: report missing permissions (instead of forced chrash with stacktrace) - POST_NOTIFICATION is optional
ta: v4.12.1: ஓபன்ட்ராக்ச் பிழைத்திருத்த: . - post_notification விருப்பமானது

# changelogs/5749.txt:1
source: v4.12.2.: OpenTracks Bugfix: - Allow to start sensors before recording
ta: v4.12.2.: ஓபன்ட்ராக்ச் பிழைத்திருத்த: - பதிவு செய்வதற்கு முன் சென்சார்களைத் தொடங்க அனுமதிக்கவும்

# changelogs/5753.txt:1
source: v4.12.3: OpenTracks Bugfix: - Using GPS and IDLE functionality stored coordinates 0.0/0.0 and thus overestimating all statistics (distance >10.000 km). (Introduced in v4.12.0) - Idle: also trigger if only one location was received. Regarding the overestimating distance bug: the stored data will not be fixed within OpenTracks. Recommendation: export the as KML/KMZ and replace the invalid coordinates.
ta: V4.12.3: Opentracks பிழைத்திருத்த: . (V4.12.0 இல் அறிமுகப்படுத்தப்பட்டது) - செயலற்றது: ஒரு இடம் மட்டுமே பெறப்பட்டால் தூண்டவும். மிகைப்படுத்தும் தூரப் பிழையைப் பொறுத்தவரை: சேமிக்கப்பட்ட தரவு ஓபன்ட்ராக்சுக்குள் சரி செய்யப்படாது. பரிந்துரை: அச் KML/KMZ ஐ ஏற்றுமதி செய்து தவறான ஆயங்களை மாற்றவும்.

# changelogs/5788.txt:1
source: v4.12.4: OpenTracks Changes: - Announcements: units can be omitted - Announcements: added lap cycling power Bugfix: - Delete markers from list crashed
ta: V4.12.4: Opentracks மாற்றங்கள்: - அறிவிப்புகள்: அலகுகள் தவிர்க்கப்படலாம் - அறிவிப்புகள்: சேர்க்கப்பட்ட மடியில் சைக்கிள் ஓட்டுதல் சக்தி பிழைத்திருத்த: - பட்டியலில் இருந்து குறிப்பான்களை நீக்கவும்

# changelogs/5814.txt:1
source: v4.12.5: OpenTracks Bugfix: - Moving is now computed correctly again. Was broken since v4.9.0 due to the introduction of idle functionality. See #1756. Changes: - Support for Predictive Back
ta: v4.12.5: ஓபன்ட்ராக்ச் பிழைத்திருத்த: - நகரும் இப்போது மீண்டும் சரியாக கணக்கிடப்படுகிறது. செயலற்ற செயல்பாட்டை அறிமுகப்படுத்தியதால் V4.9.0 முதல் உடைக்கப்பட்டது. #1756 ஐக் காண்க. மாற்றங்கள்: - முன்கணிப்பு பின்புறத்திற்கான உதவி

# changelogs/5837.txt:1
source: v4.13.0: OpenTracks Changes: - Markers can be created via Public API This allows to create Markers at any location and after recording. Drawback: Markers are not shown in diagrams anymore. NOTE: OSMDashboard supports this API after version: v4.1.0 Bugfix: - Default activity setting should have been a dropdown - Back arrow not working in settings - Label for off trail hiking now shows "off trail hiking" Developer: - Use Position instead of Android's Location
ta: v4.13.0: ஓபன்ட்ராக்ச் மாற்றங்கள்: - பொது பநிஇ வழியாகக் குறிப்பான்களை உருவாக்க முடியும் இது எந்த இடத்திலும் பதிவுசெய்த பிறகு குறிப்பான்களை உருவாக்க அனுமதிக்கிறது. குறைபாடு: குறிப்பான்கள் இனி வரைபடங்களில் காட்டப்படவில்லை. குறிப்பு: பதிப்பிற்குப் பிறகு இந்த பநிஇ ஐ ஆதரிக்கிறது: v4.1.0 பிழைத்திருத்த: - இயல்புநிலை செயல்பாட்டு அமைப்பு ஒரு கீழ்தோன்றும் இருந்திருக்க வேண்டும் - பின் அம்பு அமைப்புகளில் வேலை செய்யவில்லை - டிரெயில் ஐகிங்கிற்கான சிட்டை இப்போது "ஆஃப் டிரெயில் ஐக்கிங்" என்பதைக் காட்டுகிறது டெவலப்பர்: - ஆண்ட்ராய்டு இன் இருப்பிடத்திற்கு பதிலாக நிலையைப் பயன்படுத்தவும்

# changelogs/5870.txt:1
source: v4.13.1: OpenTracks Changes: - Aggregated stats calender' uses regional preferences (Android 14+) Bugfix: - KML 2.3: use standardized field name for heartrate - Track list: recording status was not updated correctly - Material3 related UI fixes
ta: v4.13.1: ஓபன்ட்ராக்ச் மாற்றங்கள்: - ஒருங்கிணைந்த புள்ளிவிவரங்கள் காலெண்டர் 'பிராந்திய விருப்பங்களைப் பயன்படுத்துகிறது (Android 14+) பிழைத்திருத்த: - KML 2.3: ஆர்ட்ரேட்டுக்கு தரப்படுத்தப்பட்ட புலப் பெயரைப் பயன்படுத்தவும் - ட்ராக் பட்டியல்: பதிவு நிலை சரியாக புதுப்பிக்கப்படவில்லை - பொருள் 3 தொடர்புடைய இடைமுகம் திருத்தங்கள்

# changelogs/5889.txt:1
source: v4.14.0: OpenTracks Changes: - Use Androidx' EGM2008 data (instead of bundling our custom solution). Developer: - Target Android15/ SDK35
ta: v4.14.0: ஓபன்ட்ராக்ச் மாற்றங்கள்: - Androidx 'EGM2008 தரவைப் பயன்படுத்தவும் (எங்கள் தனிப்பயன் தீர்வை தொகுப்பதற்கு பதிலாக). டெவலப்பர்: - இலக்கு Android15/ SDK35

# changelogs/5909.txt:1
source: v4.14.1: OpenTracks Changes: - Idle detection can be disabled Bugfix: - UI for adding pictures to markers was hidden
ta: v4.14.1: ஓபன்ட்ராக்ச் மாற்றங்கள்: - செயலற்ற கண்டறிதல் முடக்கப்படலாம் பிழைத்திருத்த: - குறிப்பான்களில் படங்களைச் சேர்ப்பதற்கான இடைமுகம் மறைக்கப்பட்டது

# changelogs/5917.txt:1
source: v4.14.2: OpenTracks Bugfix: - Android 15: UI is not overflowing anymore (edge-to-edge)
ta: v4.14.2: ஓபன்ட்ராக்ச் பிழைத்திருத்த: -Android 15: இடைமுகம் இனி நிரம்பி வழிகிறது (விளிம்பு-க்கு-விளிம்பு)

# changelogs/5938.txt:1
source: v4.15.0: OpenTracks Changes: - In-app language selector (Android 14 or later) - Show-on-map-feature only supports OSM Dashboard (removed KML/KMZ or GPX) Developer: - Github actions now uses Ubuntu
ta: v4.15.0: ஓபன்ட்ராக்ச் மாற்றங்கள்: - பயன்பாட்டு மொழி தேர்வாளர் (ஆண்ட்ராய்டு 14 அல்லது அதற்குப் பிறகு) . டெவலப்பர்: - அறிவிலிமையம் செயல்கள் இப்போது உபுண்டுவைப் பயன்படுத்துகின்றன

# changelogs/5941.txt:1
source: v4.16.0: OpenTracks Bugfix: - PublicAPI: starting a recording didn't record no data
ta: v4.16.0: ஓபன்ட்ராக்ச் பிழைத்திருத்த: - பப்ளேபிஐ: ஒரு பதிவைத் தொடங்குவது எந்த தரவையும் பதிவு செய்யவில்லை

# changelogs/5945.txt:1
source: v4.16.1: OpenTracks Changes: - In-app language selector now available for all Android versions (due to some popular demand) Developer: - Github actions: checkout was not fetching tags (nightly)
ta: v4.16.1: ஓபன்ட்ராக்ச் மாற்றங்கள்: - பயன்பாட்டில் உள்ள மொழி தேர்வாளர் இப்போது அனைத்து ஆண்ட்ராய்டு பதிப்புகளுக்கும் கிடைக்கிறது (சில பிரபலமான தேவை காரணமாக) டெவலப்பர்: - அறிவிலிமையம் செயல்கள்: புதுப்பித்து குறிச்சொற்களைப் பெறவில்லை (இரவு)

# changelogs/5975.txt:1
source: v4.17.0: OpenTracks Changes: - Public API to create markers (while recording) Bugfix: - Sensors: on idle, set movement-based sensor data to 0
ta: v4.17.0: ஓபன்ட்ராக்ச் மாற்றங்கள்: - குறிப்பான்களை உருவாக்க பொது பநிஇ (பதிவு செய்யும் போது) பிழைத்திருத்த: - சென்சார்கள்: செயலற்ற நிலையில், இயக்கம் அடிப்படையிலான சென்சார் தரவை 0 ஆக அமைக்கவும்

# changelogs/5978.txt:1
source: v4.17.1: OpenTracks Changes: - Reproducible build: let's see if it works. The PlayStore variant will be submitted to F-Droid, verified and published them.
ta: v4.17.1: ஓபன்ட்ராக்ச் மாற்றங்கள்: - இனப்பெருக்கம் உருவாக்க: இது செயல்படுகிறதா என்று பார்ப்போம். பிளேச்டோர் மாறுபாடு எஃப்-டிராய்டுக்கு சமர்ப்பிக்கப்பட்டு, அவற்றை சரிபார்க்கும் மற்றும் வெளியிடப்படும்.

# changelogs/5980.txt:1
source: v4.17.2: OpenTracks Changes: - Reproducible build: let's see if it works. The PlayStore variant will be submitted to F-Droid, verified and published them. Developer: - F-Droid requires to use Product Flavors (instead of Build Types)
ta: v4.17.2: ஓபன்ட்ராக்ச் மாற்றங்கள்: - இனப்பெருக்கம் உருவாக்க: இது செயல்படுகிறதா என்று பார்ப்போம். பிளேச்டோர் மாறுபாடு எஃப்-டிராய்டுக்கு சமர்ப்பிக்கப்பட்டு, அவற்றை சரிபார்க்கும் மற்றும் வெளியிடப்படும். டெவலப்பர்: - எஃப்-டிராய்டுக்கு தயாரிப்பு சுவைகளைப் பயன்படுத்த வேண்டும் (உருவாக்க வகைகளுக்கு பதிலாக)

# changelogs/5983.txt:1
source: v4.17.3: OpenTracks Changes: - Reproducible build: let's see if it works. Developer: - Just trying to get the APK filename, right...
ta: v4.17.3: ஓபன்ட்ராக்ச் மாற்றங்கள்: - இனப்பெருக்கம் உருவாக்க: இது செயல்படுகிறதா என்று பார்ப்போம். டெவலப்பர்: - APK கோப்பு பெயரைப் பெற முயற்சிக்கிறேன், சரி ...

# changelogs/5985.txt:1
source: v4.17.4: OpenTracks Changes: - Reproducible build: let's see if it works. Developer: - Removing DependencyInfo.
ta: v4.17.4: ஓபன்ட்ராக்ச் மாற்றங்கள்: - இனப்பெருக்கம் உருவாக்க: இது செயல்படுகிறதா என்று பார்ப்போம். டெவலப்பர்: - DependencyInfo ஐ நீக்குதல்.

# changelogs/5989.txt:1
source: v4.17.5: OpenTracks Changes: - Reproducible build: let's see if it works. Bugfix: - Reproducible build uses PlayStore icon. Developer: - Added RELEASE_BUILD.sh
ta: v4.17.5: ஓபன்ட்ராக்ச் மாற்றங்கள்: - இனப்பெருக்கம் உருவாக்க: இது செயல்படுகிறதா என்று பார்ப்போம். பிழைத்திருத்த: - இனப்பெருக்கம் உருவாக்குதல் பிளேச்டோர் ஐகானைப் பயன்படுத்துகிறது. டெவலப்பர்: - வெளியீடு_பியூல்ட்

# changelogs/6022.txt:1
source: v4.17.6: OpenTracks Bugfix: - UI: GPS data may be not shown regularly (does not affect recorded data) Introduced in v4.17.0
ta: v4.17.6: ஓபன்ட்ராக்ச் பிழைத்திருத்த: - UI: சி.பி.எச் தரவு தவறாமல் காட்டப்படாது (பதிவுசெய்யப்பட்ட தரவை பாதிக்காது) V4.17.0 இல் அறிமுகப்படுத்தப்பட்டது

# changelogs/6028.txt:1
source: v4.17.7: OpenTracks Release for reproducible build.
ta: v4.17.7: ஓபன்ட்ராக்ச் இனப்பெருக்கம் செய்ய வெளியீடு.

# changelogs/6030.txt:1
source: v4.17.8: OpenTracks Changes: - Charts: shown data can be configured
ta: V4.17.8: Opentracks மாற்றங்கள்: - விளக்கப்படங்கள்: காட்டப்பட்ட தரவை உள்ளமைக்க முடியும்

# changelogs/6095.txt:1
source: v4.18.0: OpenTracks Changes: - GPS disabled warning can be disabled Bugfix: - BottomAppBar overlapped content Developer: - Use record Position instead of Android location - Refactored sensor aggregators
ta: v4.18.0: ஓபன்ட்ராக்ச் மாற்றங்கள்: - சி.பி.எச் முடக்கப்பட்ட எச்சரிக்கையை முடக்கலாம் பிழைத்திருத்த: - பாட்டம்அப்ப்பார் உள்ளடக்கத்தை ஒன்றுடன் ஒன்று டெவலப்பர்: - ஆண்ட்ராய்டு இருப்பிடத்திற்கு பதிலாக பதிவு நிலையைப் பயன்படுத்தவும் - மறுசீரமைக்கப்பட்ட சென்சார் திரட்டிகள்

# changelogs/6102.txt:1
source: v4.19.0: OpenTracks Changes: - GPX export was not compliant (TrackPointExtension order and content) Bugfix: - pre-v4.18.0 markers without pictures could not be deleted
ta: V4.19.0: Opentracks மாற்றங்கள்: - சிபிஎக்ச் ஏற்றுமதி இணக்கமாக இல்லை (டிராக் பாயிண்ட் எக்ச்டென்சன் ஆர்டர் மற்றும் உள்ளடக்கம்) பிழைத்திருத்த: - முன்-V4.18.0 படங்கள் இல்லாத குறிப்பான்களை நீக்க முடியவில்லை

# changelogs/6120.txt:1
source: v4.19.1: OpenTracks Bugfix: - Exported GPX files missed one schemaLocation
ta: V4.19.1: Opentracks பிழைத்திருத்த: - ஏற்றுமதி செய்யப்பட்ட சிபிஎக்ச் கோப்புகள் ஒரு திட்டத்தை தவறவிட்டன

# changelogs/6124.txt:1
source: v4.19.2: OpenTracks Bugfix: - Fix crash due to faulty translations
ta: V4.19.2: Opentracks பிழைத்திருத்த: - தவறான மொழிபெயர்ப்புகள் காரணமாக விபத்தை சரிசெய்யவும்

# changelogs/6130.txt:1
source: v4.19.3: OpenTracks Bugfix: - Fix CSV export for altitude (was cut at 1000m)
ta: V4.19.3: Opentracks பிழைத்திருத்த: - உயரத்திற்கு காபிம ஏற்றுமதியை சரிசெய்யவும் (1000 மீட்டரில் வெட்டப்பட்டது)

# changelogs/6170.txt:1
source: v4.19.4: OpenTracks Bugfix: - Edge-to-edge (SDK35): applied to all version of Android (some progress, but still work in progress) - KMZ with pictures could not be exported (heading not computable; feature removed)
ta: V4.19.4: Opentracks பிழைத்திருத்த: -எட்ச்-டு-எட்ச் (SDK35): ஆண்ட்ராய்டு இன் அனைத்து பதிப்பிற்கும் பயன்படுத்தப்பட்டது (சில முன்னேற்றம், ஆனால் இன்னும் முன்னேற்றத்தில் உள்ளது) - படங்களுடன் KMZ ஏற்றுமதி செய்ய முடியவில்லை (தலைப்பு கணக்கிட முடியாதது; நற்பொருத்தம் அகற்றப்பட்டது)

# changelogs/6180.txt:1
source: v4.19.5: OpenTracks Bugfix: - Launcher icon was sometimes shown too small - Track icon on detail page using localized activity type
ta: v4.19.5: OpenTracks பிழைத்திருத்தம்: - துவக்கி ஐகான் சில நேரங்களில் மிகச் சிறியதாகக் காட்டப்பட்டது - உள்ளூர்மயமாக்கப்பட்ட செயல்பாட்டு வகையைப் பயன்படுத்தி விவரப் பக்கத்தில் டிராக் ஐகான்

# changelogs/6187.txt:1
source: v4.19.6: OpenTracks Changes: - Edge-2-edge should now be working on all Android versions
ta: v4.19.6: OpenTracks மாற்றங்கள்: - Edge-2-edge இப்போது அனைத்து Android பதிப்புகளிலும் வேலை செய்ய வேண்டும்

# changelogs/6217.txt:1
source: v4.20.0: OpenTracks Changes: - Allow to change timezone offset of tracks - Simplified Marker UI Bugfix: - Edge-2-edge: react to virtual keyboard
ta: v4.20.0: OpenTracks மாற்றங்கள்: - டிராக்குகளின் நேர மண்டல ஆஃப்செட்டை மாற்ற அனுமதிக்கவும் - எளிமைப்படுத்தப்பட்ட மார்க்கர் UI பிழைத்திருத்தம்: - எட்ஜ்-2-எட்ஜ்: மெய்நிகர் விசைப்பலகைக்கு எதிர்வினையாற்று

# changelogs/6233.txt:1
source: v4.21.0: OpenTracks Changes: - Track list supports swipe-to-delete - Re-implemented themes (for DynamicColor and OLED)
ta: v4.21.0: OpenTracks மாற்றங்கள்: - டிராக் பட்டியல் ஸ்வைப்-டு-டிலீட்டை ஆதரிக்கிறது - மீண்டும் செயல்படுத்தப்பட்ட தீம்கள் (டைனமிக் கலர் மற்றும் OLED க்கு)
