Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: OpenREM version history
ta: ஓபன்ரெம் பதிப்பு வரலாறு

source: 1.0.0b1 (2023-03-29)
ta: 1.0.0 பி 1 (2023-03-29)

source: :issue:`988` Imports: fixing hard-written DX text in MG import messages
ta: : வெளியீடு: `988` இறக்குமதி: எம்.சி இறக்குமதி செய்திகளில் கடினமாக எழுதப்பட்ட டிஎக்ச் உரையை சரிசெய்தல்

source: :issue:`987` Tasks: configuring Windows WinSW log files to roll over to ensure their size is restricted
ta: :issue:`987` Tasks: configuring சாளரங்கள் WinSW log கோப்புகள் பெறுநர் உருளம் வீச்சலகு பெறுநர் ensure their அளவு is restricted

source: :issue:`986` SkinDose: fixed bug where a zero study dap causes a divide by zero error
ta: : வெளியீடு: `986` ச்கிண்டோச்: நிலையான பிழை சுழிய ஆய்வு டிஏபி சுழிய பிழையால் பிளவுகளை ஏற்படுத்துகிறது

source: :issue:`984` Interface: improved performance of home page
ta: : வெளியீடு: `984` இடைமுகம்: முகப்பு பக்கத்தின் மேம்பட்ட செயல்திறன்

source: :issue:`980` Interface: improved standard name form layout
ta: : வெளியீடு: `980` இடைமுகம்: மேம்படுத்தப்பட்ட நிலையான பெயர் படிவம் தளவமைப்பு

source: :issue:`977` Documentation: fix issues preventing translations to be built
ta: : வெளியீடு: `977` ஆவணங்கள்: மொழிபெயர்ப்புகளை உருவாக்கத் தடுக்கும் சிக்கல்களை சரிசெய்யவும்

source: :issue:`976` NM charts: Fixed bug where graphs were not displayed correctly for some chart options
ta: : வெளியீடு: `976` என்எம் விளக்கப்படங்கள்: சில விளக்கப்பட விருப்பங்களுக்கு வரைபடங்கள் சரியாக காட்டப்படாத நிலையான பிழை

source: :issue:`972` DICOM Networking: better analysis of SR series with multiple SOP Class UIDs
ta: : வெளியீடு: `972` டிகாம் நெட்வொர்க்கிங்: பல சோப் வகுப்பு UIDS உடன் SR தொடரின் சிறந்த பகுப்பாய்வு

source: :issue:`971` Imports: fixing NM image index error
ta: : வெளியீடு: `971` இறக்குமதி: என்எம் பட குறியீட்டு பிழையை சரிசெய்தல்

source: :issue:`970` Emails: fixed formatting of high fluoro dose alert emails and included peak skin dose for each study in time delta
ta: :issue:`970` Emails: fixed formatting of high fluoro dose alert emails and included peak skin dose க்கு each study in time டெல்டா

source: :issue:`967` Imports: made total DLP optional for Philips CT imports
ta: : வெளியீடு: `967` இறக்குமதி: பிலிப்ச் சி.டி இறக்குமதிக்கு மொத்த டி.எல்.பி விருப்பமாக மாற்றப்பட்டது

source: :issue:`965` SkinDose: fixed bug where a zero study dap causes a divide by zero error
ta: : வெளியீடு: `965` ச்கிண்டோச்: நிலையான பிழை சுழிய ஆய்வு டிஏபி சுழிய பிழையால் பிளவுகளை ஏற்படுத்துகிறது

source: :issue:`964` Tasks: restricted default task history to 2000 stored entries; enabled admin users to configure this value
ta: : வெளியீடு: `964` பணிகள்: 2000 சேமிக்கப்பட்ட உள்ளீடுகளுக்கு தடைசெய்யப்பட்ட இயல்புநிலை பணி வரலாறு; இந்த மதிப்பை உள்ளமைக்க நிர்வாக பயனர்களுக்கு உதவியது

source: :issue:`962` Documentation: updated packages to make bullet points work again
ta: : வெளியீடு: `962` ஆவணங்கள்: புல்லட் புள்ளிகளை மீண்டும் செயல்பட புதுப்பித்த தொகுப்புகள்

source: :issue:`960` SkinDose: fixed bug where multiple entries in the openskin safelist table with different software versions caused an error
ta: :issue:`960` SkinDose: fixed பிழை where multiple entries in the openskin safelist table with different software versions caused an பிழை

source: :issue:`959` Installation: upgraded packages to latest versions
ta: : வெளியீடு: `959` நிறுவல்: தொகுப்பை அண்மைக் கால பதிப்பிற்கு மேம்படுத்தவும்

source: :issue:`958` Interface: fixed task table sorting for Started column
ta: : வெளியீடு: `958` இடைமுகம்: தொடங்கிய நெடுவரிசைக்கு நிலையான பணி அட்டவணை வரிசையாக்கம்

source: :issue:`957` Imports: fixed DX extractor total_number_of_radiographic_frames is NoneType error
ta: :issue:`957` Imports: fixed DX extractor total_number_of_radiographic_frames is NoneType பிழை

source: :issue:`956` Interface: enable updating of standard name database links
ta: : வெளியீடு: `956` இடைமுகம்: நிலையான பெயர் தரவுத்தள இணைப்புகளை புதுப்பிக்க இயக்கவும்

source: :issue:`955` Imports: fixed error when importing RDSR with empty DAP measured value sequence
ta: : வெளியீடு: `955` இறக்குமதி: வெற்று டிஏபி அளவிடப்பட்ட மதிப்பு வரிசையுடன் ஆர்.டி.எச்.ஆரை இறக்குமதி செய்யும் போது நிலையான பிழை

source: :issue:`953` Interface: updated "DX and CR" to "Radiography", and "Radiographic" to "Radiography"
ta: :issue:`953` Interface: updated "DX and CR" பெறுநர் "Radiography", and "Radiographic" பெறுநர் "Radiography"

source: :issue:`950` Documentation: removed (outdated) instructions for Conquest
ta: : வெளியீடு: `950` ஆவணங்கள்: வெற்றிக்கான அகற்றப்பட்ட (காலாவதியான) வழிமுறைகள்

source: :issue:`949` Documentation: updated the upgrade instructions from older versions
ta: : வெளியீடு: `949` ஆவணம்: பழைய பதிப்புகளிலிருந்து மேம்படுத்தல் வழிமுறைகளைப் புதுப்பித்தது

source: :issue:`947` Tests: enforce ordering within fluoro exposure sets and specify row by time in test
ta: : வெளியீடு: `947` சோதனைகள்: ஃப்ளோரோ வெளிப்பாடு தொகுப்புகளுக்குள் வரிசைப்படுத்துதல் மற்றும் சோதனையில் நேரத்தால் வரிசையைக் குறிப்பிடவும்

source: :issue:`945` Exports: order by plane when populating fluoro data
ta: : வெளியீடு: `945` ஏற்றுமதி: ஃப்ளோரோ தரவை விரிவுபடுத்தும்போது வானூர்தி மூலம் ஆர்டர்

source: :issue:`942` SkinDose: try to calculate number of frames using exposure time / pulse width if number of frames not available
ta: : வெளியீடு: `942` ச்கிண்டோச்: பிரேம்களின் எண்ணிக்கை கிடைக்கவில்லை என்றால் வெளிப்பாடு நேரம் / துடிப்பு அகலத்தைப் பயன்படுத்தி பிரேம்களின் எண்ணிக்கையை கணக்கிட முயற்சிக்கவும்

source: :issue:`941` Interface: the filtering submit button now updates chart options for fluoroscopy and mammography
ta: :issue:`941` Interface: the filtering submit button now updates chart விருப்பங்கள் க்கு fluoroscopy and mammography

source: :issue:`940` Installation: upgraded Django to 3.2, packages to latest versions
ta: : வெளியீடு: `940` நிறுவல்: சாங்கோவை 3.2 ஆக மேம்படுத்தியது, அண்மைக் கால பதிப்புகளுக்கு தொகுப்புகள்

source: :issue:`937` Interface: correcting bottom row of exports table
ta: : வெளியீடு: `937` இடைமுகம்: ஏற்றுமதி அட்டவணையின் கீழ் வரிசையை சரிசெய்தல்

source: :issue:`936` Tasks: added make_skin_map to background tasks on RF RDSR import
ta: :issue:`936` Tasks: added make_skin_map பெறுநர் பின்னணி பணிகள் on வானலை RDSR இறக்குமதி

source: :issue:`935` SkinDose: fixed bug which applied 5x5 cm backscatter factor regardless of field size at skin
ta: : வெளியீடு: `935` ச்கிண்டோச்: தோலில் புலம் அளவைப் பொருட்படுத்தாமல் 5x5 செ.மீ பேக்ச்கேட்டர் காரணி பயன்படுத்திய நிலையான பிழை

source: :issue:`934` DICOM Networking: QR queries are now logged and can be analysed through the web interface
ta: :issue:`934` DICOM Networking: QR queries அரே now logged and can be analysed through the விரலிடைத் தோல் இடைமுகம்

source: :issue:`933` SkinDose: bug fixed that caused incorrect field size at skin for exposures with a non-zero secondary angle (caudocranial)
ta: :issue:`933` SkinDose: பிழை fixed that caused incorrect புலம் அளவு at skin க்கு exposures with a non-zero secondary angle (caudocranial)

source: :issue:`931` Exports: export RF DAP as float instead of text
ta: : வெளியீடு: `931` ஏற்றுமதி: உரைக்கு பதிலாக வானலை DAP ஐ மிதவையாக ஏற்றுமதி செய்யுங்கள்

source: :issue:`928` Documentation: added restriction in postgres version for earlier OpenREM releases
ta: : வெளியீடு: `928` ஆவணம்: முந்தைய ஓபன்ரெம் வெளியீடுகளுக்கான போச்ட்கிரெச் பதிப்பில் சேர்க்கப்பட்ட கட்டுப்பாடு

source: :issue:`925` Docker: docs and config file for enabling bind mounts with SELinux
ta: : வெளியீடு: `925` டோக்கர்: செலினக்ச் உடன் பிணைப்பு ஏற்றங்களை இயக்குவதற்கான டாக்ச் மற்றும் கட்டமைப்பு கோப்பு

source: :issue:`923` Docker: docs and config for virtual directory install
ta: : வெளியீடு: `923` டோக்கர்: மெய்நிகர் அடைவு நிறுவலுக்கான டாக்ச் மற்றும் கட்டமைப்பு

source: :issue:`922` Database: optimise indexes and duplicate queries
ta: : வெளியீடு: `922` தரவுத்தளம்: குறியீடுகள் மற்றும் நகல் வினவல்களை மேம்படுத்தவும்

source: :issue:`919` Interface: fixed bug preventing home page listing if study had no date
ta: : வெளியீடு: `919` இடைமுகம்: படிப்புக்கு தேதி இல்லை என்றால் முகப்பு பக்க பட்டியலைத் தடுக்கும் நிலையான பிழை

source: :issue:`917` Interface: added horizontal lines between chart option groups and shaded chart option CheckboxSelectMultiple items
ta: :issue:`917` Interface: added horizontal வரிகள் between chart சூதம் groups and shaded chart சூதம் CheckboxSelectMultiple items

source: :issue:`915` Interface and exports: expose mammo view modifier in interface and exports
ta: : வெளியீடு: `915` இடைமுகம் மற்றும் ஏற்றுமதி: இடைமுகம் மற்றும் ஏற்றுமதியில் மம்மோ பார்வை மாற்றியமைப்பை அம்பலப்படுத்துங்கள்

source: :issue:`914` Imports: added compression force, pressure, contact area for mammo RDSR
ta: : வெளியீடு: `914` இறக்குமதிகள்: சுருக்க ஆற்றல், அழுத்தம், மம்மோ ஆர்.டி.எச்.ஆருக்கான தொடர்பு பகுதி சேர்க்கப்பட்டது

source: :issue:`913` SkinDose: made 2d skin dose map overlay visible by default
ta: : வெளியீடு: `913` ச்கிண்டோச்: 2 டி தோல் டோச் வரைபட மேலடுக்கு இயல்பாகவே தெரியும்

source: :issue:`911` Charts: fixed issue with chart data sorting and added label wrap option
ta: : வெளியீடு: `911` விளக்கப்படங்கள்: விளக்கப்படம் தரவு வரிசையாக்கத்துடன் நிலையான சிக்கல் மற்றும் சேர்க்கப்பட்ட சிட்டை மடக்கு விருப்பம்

source: :issue:`910` SkinDose: fixed rendering of 2d skin dose map with head
ta: : வெளியீடு: `910` ச்கிண்டோச்: தலையுடன் 2 டி தோல் டோச் வரைபடத்தின் நிலையான வழங்குதல்

source: :issue:`909` Code quality: all model imports absolute
ta: : வெளியீடு: `909` குறியீடு தரம்: அனைத்து மாதிரி இறக்குமதியும் முழுமையானது

source: :issue:`908` Imports: enabled Device Observer UID to be ignored for specific equipment models when creating display name data during RDSR import
ta: :issue:`908` Imports: இயக்கப்பட்டது Device நோக்காளன் UID பெறுநர் be ignored க்கு specific equipment models when creating காட்சி பெயர் தகவல்கள் during RDSR இறக்குமதி

source: :issue:`906` Charts: upgraded Plotly library to latest version
ta: : வெளியீடு: `906` விளக்கப்படங்கள்: சூழ்ச்சி நூலகத்தை அண்மைக் கால பதிப்பிற்கு மேம்படுத்தியது

source: :issue:`905` Imports: fixed filter extraction code not working for Siemens Multix DX
ta: : வெளியீடு: `905` இறக்குமதி: நிலையான வடிகட்டி பிரித்தெடுத்தல் குறியீடு சீமென்ச் மல்டிக்ச் டி.எக்ச்.

source: :issue:`904` Testing: bumped Python image from 3.6 to 3.8
ta: : வெளியீடு: `904` சோதனை: பைதான் படத்தை 3.6 முதல் 3.8 வரை மோதியது

source: :issue:`903` Interface: added patient weight filters to the CT, RF and DX summary pages
ta: : வெளியீடு: `903` இடைமுகம்: நோயாளியின் எடை வடிப்பான்கள் CT, வானலை மற்றும் DX சுருக்கம் பக்கங்களில் சேர்க்கப்பட்டன

source: :issue:`901` Charts: fixed issue where mammography mAs values were displayed 1000x too high on scatter plot
ta: :issue:`901` Charts: fixed சிக்கல் where mammography mAs values were displayed 1000x too high on scatter plot

source: :issue:`897` Docker: fixed permissions for PixelMed - now using root throughout
ta: : வெளியீடு: `897` டோக்கர்: பிக்சல்மீட்டிற்கான நிலையான அனுமதிகள் - இப்போது முழுவதும் ரூட்டைப் பயன்படுத்துகிறது

source: :issue:`896` Imports: enabling import of DX with text string in PatientSize field
ta: :issue:`896` Imports: enabling இறக்குமதி of DX with உரை சரம் in PatientSize புலம்

source: :issue:`893` Charts: fixed issue with over-time charts with many sub-plots failing to plot correctly
ta: :issue:`893` Charts: fixed சிக்கல் with over-time விளக்கப்படங்கள் with many sub-plots failing பெறுநர் plot correctly

source: :issue:`892` Documentation: Removing references to native DICOM store and log
ta: : வெளியீடு: `892` ஆவணம்: சொந்த டிகாம் கடை மற்றும் பதிவு பற்றிய குறிப்புகளை நீக்குதல்

source: :issue:`888` SkinDose: added option to support skin dose calculations for listed systems only
ta: : வெளியீடு: `888` ச்கிண்டோச்: பட்டியலிடப்பட்ட அமைப்புகளுக்கு மட்டுமே தோல் டோச் கணக்கீடுகளை ஆதரிக்க விருப்பம் சேர்க்கப்பட்டது

source: :issue:`886` Code quality: addressed some SonarCloud issues
ta: : வெளியீடு: `886` குறியீடு தரம்: சில சோனர்க்ளவுட் சிக்கல்களை எதிர்கொண்டது

source: :issue:`882` SkinDose: added percentage of exposures that interact with phantom
ta: : வெளியீடு: `882` ச்கிண்டோச்: பாண்டம் உடன் தொடர்பு கொள்ளும் வெளிப்பாடுகளின் விழுக்காடு கூடுதல் விழுக்காடு

source: :issue:`881` Charts: add option to remove multiple and trailing whitespace in category names
ta: : வெளியீடு: `881` விளக்கப்படங்கள்: வகை பெயர்களில் பல மற்றும் பின்தங்கிய இடைவெளியை அகற்ற விருப்பத்தைச் சேர்க்கவும்

source: :issue:`880` Orthanc: added XA and RF to allowed modalities to enable physics QA images to be kept
ta: :issue:`880` Orthanc: added XA and வானலை பெறுநர் allowed modalities பெறுநர் enable physics QA படங்கள் பெறுநர் be kept

source: :issue:`879` Charts: fixed sorting of fluoroscopy charts when split by physician
ta: : வெளியீடு: `879` விளக்கப்படங்கள்: மருத்துவரால் பிரிக்கும்போது ஃப்ளோரோச்கோபி விளக்கப்படங்களின் நிலையான வரிசையாக்கம்

source: :issue:`877` Charts: added acquisition type restrictions to acquisition-level CT charts
ta: : வெளியீடு: `877` விளக்கப்படங்கள்: கையகப்படுத்தல்-நிலை சி.டி விளக்கப்படங்களுக்கு கையகப்படுத்தல் வகை கட்டுப்பாடுகள் சேர்க்கப்பட்டன

source: :issue:`874` Documentation: updating DICOM query-retrieve documentation
ta: : வெளியீடு: `874` ஆவணம்: டிகாம் வினவல்-மறுசீரமைப்பு ஆவணங்களை புதுப்பித்தல்

source: :issue:`872` Charts: added ability to split fluoroscopy over-time and histogram charts by physician
ta: : வெளியீடு: `872` விளக்கப்படங்கள்: மருத்துவரால் ஃப்ளோரோச்கோபியை அதிக நேரம் மற்றும் இச்டோகிராம் விளக்கப்படங்களை பிரிக்கும் திறன் சேர்க்கப்பட்டது

source: :issue:`871` Charts: corrected RF chart x-axis labels
ta: : வெளியீடு: `871` விளக்கப்படங்கள்: சரிசெய்யப்பட்ட வானலை விளக்கப்படம் எக்ச்-அச்சு லேபிள்கள்

source: :issue:`870` Charts: reduced memory footprint of Pandas DataFrame creation
ta: : வெளியீடு: `870` விளக்கப்படங்கள்: பாண்டாச் டேட்டாஃப்ரேம் உருவாக்கத்தின் குறைக்கப்பட்ட நினைவக தடம்

source: :issue:`869` Charts: added doc strings to new chart code
ta: : வெளியீடு: `869` விளக்கப்படங்கள்: புதிய விளக்கப்படக் குறியீட்டில் ஆவணங்களைச் சேர்க்கவும்

source: :issue:`868` Docker: fixed Python version at 3.8
ta: : வெளியீடு: `868` டோக்கர்: நிலையான பைதான் பதிப்பு 3.8 இல்

source: :issue:`867` Documentation: updated chart documentation
ta: : வெளியீடு: `867` ஆவணம்: புதுப்பிக்கப்பட்ட விளக்கப்பட ஆவணங்கள்

source: :issue:`866` Simplified code for different character sets, enabled MultiValue SpecificCharacterSet
ta: :issue:`866` Simplified குறியீடு க்கு different எழுத்து sets, இயக்கப்பட்டது MultiValue SpecificCharacterSet

source: :issue:`865` Imports: enabled workaround to import Spectrum Dynamics RDSR
ta: :issue:`865` Imports: இயக்கப்பட்டது workaround பெறுநர் இறக்குமதி நிறமாலை Dynamics RDSR

source: :issue:`864` Tasks: updated Celery settings for Celery 6.
ta: : வெளியீடு: `864` பணிகள்: செலரி 6 க்கான புதுப்பிக்கப்பட்ட செலரி அமைப்புகள்.

source: :issue:`863` Interface: removed height and weight from CT study delete
ta: : வெளியீடு: `863` இடைமுகம்: சி.டி. ஆய்வு நீக்கு

source: :issue:`862` Interface: allow mapping of request, study and acquisition names to standard versions
ta: : வெளியீடு: `862` இடைமுகம்: கோரிக்கை, படிப்பு மற்றும் கையகப்படுத்தல் பெயர்களின் வரைபடத்தை நிலையான பதிப்புகளுக்கு அனுமதிக்கவும்

source: :issue:`861` Interface: added ability to filter mammography on view code, compressed breast thickness and exposure control mode
ta: : வெளியீடு: `861` இடைமுகம்: பார்வைக் குறியீடு, சுருக்கப்பட்ட மார்பக தடிமன் மற்றும் வெளிப்பாடு கட்டுப்பாட்டு முறை ஆகியவற்றில் மேமோகிராஃபி வடிகட்டும் திறன் சேர்க்கப்பட்டது

source: :issue:`860` DICOM Networking: removed built-in DICOM Store SCP functionality
ta: : வெளியீடு: `860` டிகாம் நெட்வொர்க்கிங்: அகற்றப்பட்ட உள்ளமைக்கப்பட்ட டிகாம் கடை எச்.சி.பி செயல்பாடு

source: :issue:`858` DICOM Networking: query-retrieve logging, filtering and error handling improved
ta: :issue:`858` DICOM Networking: query-retrieve logging, filtering and பிழை handling improved

source: :issue:`857` Documentation: resolved documentation build errors
ta: : வெளியீடு: `857` ஆவணம்: தீர்க்கப்பட்ட ஆவணங்கள் பிழைகள்

source: :issue:`856` Interface: removed CT acquisition type restriction tick boxes
ta: : வெளியீடு: `856` இடைமுகம்: அகற்றப்பட்ட சி.டி கையகப்படுத்தல் வகை கட்டுப்பாடு டிக் பெட்டிகள்

source: :issue:`854` Interface: added date constraints to links on homepage
ta: : வெளியீடு: `854` இடைமுகம்: முகப்புப்பக்கத்தில் உள்ள இணைப்புகளுக்கு தேதி தடைகள் சேர்க்கப்பட்டன

source: :issue:`853` Testing: reduced Bitbucket pipeline minutes usage
ta: : வெளியீடு: `853` சோதனை: குறைக்கப்பட்ட பிட்பக்கெட் பைப்லைன் நிமிட பயன்பாடு

source: :issue:`852` Code quality: skin dose code formatted with Black
ta: : வெளியீடு: `852` குறியீடு தரம்: தோல் டோச் குறியீடு கருப்பு நிறத்துடன் வடிவமைக்கப்பட்டுள்ளது

source: :issue:`850` Emails: added oldest study accession number to high fluoro dose alert email subject
ta: : வெளியீடு: `850` மின்னஞ்சல்கள்: உயர் ஃப்ளோரோ டோச் எச்சரிக்கை மின்னஞ்சல் விசயத்தில் பழமையான ஆய்வு அணுகல் எண் சேர்க்கப்பட்டது

source: :issue:`849` Docker: make docker URL an env variable
ta: : வெளியீடு: `849` டோக்கர்: கப்பல்துறை முகவரி ஐ ஒரு ENV மாறியாக மாற்றவும்

source: :issue:`847` Documentation: added copy button to commands, added prompts where appropriate
ta: : வெளியீடு: `847` ஆவணம்: கட்டளைகளில் நகல் பொத்தானைச் சேர்த்தது, பொருத்தமான இடங்களில் கேட்கும் தூண்டுதல்கள்

source: :issue:`845` Docker: moved Nginx config to bind folder
ta: : வெளியீடு: `845` டோக்கர்: கோப்புறையை பிணைக்க nginx கட்டமைப்பை நகர்த்தியது

source: :issue:`844` Code quality: getting the pipelines right
ta: : வெளியீடு: `844` குறியீடு தரம்: குழாய்களை சரியாகப் பெறுதல்

source: :issue:`843` Code quality: closing target _blank phishing vulnerability
ta: : வெளியீடு: `843` குறியீடு தரம்: இறுதி இலக்கு _ பிளாங்க் ஃபிசிங் பாதிப்பு

source: :issue:`841` Code quality: format code with Black
ta: : வெளியீடு: `841` குறியீடு தரம்: கறுப்புடன் வடிவமைப்பு குறியீடு

source: :issue:`840` Exports: added performing physician to fluoroscopy standard exports
ta: : வெளியீடு: `840` ஏற்றுமதி: ஃப்ளோரோச்கோபி தர ஏற்றுமதியில் செயல்படும் மருத்துவர் சேர்க்கப்பட்டார்

source: :issue:`839` Documentation: removed redundant troubleshooting docs
ta: : வெளியீடு: `839` ஆவணம்: தேவையற்ற சரிசெய்தல் ஆவணங்களை அகற்றியது

source: :issue:`838` Imports: fixed issues with changed PersonName behaviour in pydicom 2.0
ta: : வெளியீடு: `838` இறக்குமதி: பைடிகாம் 2.0 இல் மாற்றப்பட்ட ஆளுமைப் நடத்தை கொண்ட நிலையான சிக்கல்கள்

source: :issue:`836` Installation: updated requirements, Docker and docs for pynetdicom 1.5, pydicom 2.0
ta: : வெளியீடு: `836` நிறுவல்: புதுப்பிக்கப்பட்ட தேவைகள், கப்பல்துறை மற்றும் பைனெடிகாம் 1.5, பைடிகாம் 2.0 க்கான டாக்ச்

source: :issue:`835` Docker: fixed timeout issue with slow pagination
ta: : வெளியீடு: `835` டோக்கர்: மெதுவான மோகத்துடன் நிலையான காலக்கெடு சிக்கல்

source: :issue:`830` Charts: fixed incorrect histogram data in charts
ta: : வெளியீடு: `830` விளக்கப்படங்கள்: விளக்கப்படங்களில் நிலையான தவறான இச்டோகிராம் தரவு

source: :issue:`829` Installation: added docs for Docker install on computer without internet access
ta: : வெளியீடு: `829` நிறுவல்: இணைய அணுகல் இல்லாமல் கணினியில் கப்பல்துறை நிறுவலுக்கான டாக்ச் சேர்க்கப்பட்டது

source: :issue:`828` Docker: enabled email configuration to work
ta: : வெளியீடு: `828` டோக்கர்: வேலை செய்ய மின்னஞ்சல் உள்ளமைவு

source: :issue:`827` SkinDose: made SkinDose results available in OpenREM and made alert triggering possible
ta: : வெளியீடு: `827` ச்கிண்டோச்: ச்கின்டோச் முடிவுகளை ஓபன்ரெமில் கிடைக்கிறது மற்றும் எச்சரிக்கை தூண்டுதல்

source: :issue:`826` Code quality: split views to make more manageable and testable
ta: : வெளியீடு: `826` குறியீடு தரம்: மேலும் நிர்வகிக்கக்கூடிய மற்றும் சோதனை செய்யக்கூடிய காட்சிகளைப் பிரிக்கவும்

source: :issue:`824` DICOM Networking: enabled declaration and testing of Orthanc Store SCP in Docker
ta: : வெளியீடு: `824` டிகாம் நெட்வொர்க்கிங்: டோக்கரில் ஆர்த்தாங்க் கடை எச்.சி.பி.

source: :issue:`822` Code quality: removed remaining future references
ta: : வெளியீடு: `822` குறியீடு தரம்: மீதமுள்ள எதிர்கால குறிப்புகளை நீக்கியது

source: :issue:`821` Code quality: fixed literal comparisons Docker was complaining about
ta: : வெளியீடு: `821` குறியீடு தரம்: நிலையான நேரடி ஒப்பீடுகள் கப்பல்துறை குற்றச்சாட்டு அளித்தது

source: :issue:`820` Documentation: converted changes to use sphinx-issues
ta: : வெளியீடு: `820` ஆவணங்கள்: SPHINX- சிக்கல்களைப் பயன்படுத்த மாற்றப்பட்ட மாற்றங்கள்

source: :issue:`819` Removed colons from commands in documentation as they don't format correctly in PDF
ta: : வெளியீடு: `819` ஆவணங்களில் கட்டளைகளிலிருந்து அகற்றப்பட்டது, ஏனெனில் அவை PDF இல் சரியாக வடிவமைக்கவில்லை

source: :issue:`818` Interface: refactored event number filtering
ta: : வெளியீடு: `818` இடைமுகம்: மறுசீரமைக்கப்பட்ட நிகழ்வு எண் வடிகட்டுதல்

source: :issue:`817` SkinDose: fixed PEP8 and Codacy issues for skinDose
ta: : வெளியீடு: `817` ச்கிண்டோச்: நிலையான PEP8 மற்றும் ச்கிண்டோசிற்கான குறியீட்டு சிக்கல்கள்

source: :issue:`816` Interface: fixed password change error
ta: : வெளியீடு: `816` இடைமுகம்: நிலையான கடவுச்சொல் மாற்ற பிழை

source: :issue:`815` Interface: fixed patient name filtering
ta: : வெளியீடு: `815` ​​இடைமுகம்: நிலையான நோயாளியின் பெயர் வடிகட்டுதல்

source: :issue:`814` Deployment: automated deployment to dev.openrem.org and testing.openrem.org reintroduced
ta: :issue:`814` Deployment: automated deployment பெறுநர் dev.openrem.org and testing.openrem.org reintroduced

source: :issue:`812` DICOM Networking: separated abort from timeout in move request failure message
ta: :issue:`812` DICOM Networking: separated abort இருந்து timeout in move request failure செய்தி

source: :issue:`808` Imports: caters for illegal use of mGy units in RDSR for dose at RP values
ta: : வெளியீடு: `808` இறக்குமதி: ஆர்.பி.

source: :issue:`807` Exports: fixed errors in PHE fluoro export when values are None
ta: : வெளியீடு: `807` ஏற்றுமதி: மதிப்புகள் எதுவும் இல்லாதபோது Phe floro ஏற்றுமதியில் நிலையான பிழைகள்

source: :issue:`805` DICOM Networking: fix errors on "association release" and "move complete"
ta: : வெளியீடு: `805` டிகாம் நெட்வொர்க்கிங்:" அசோசியேசன் வெளியீடு "மற்றும்" நகரும் முழுமையானது "ஆகியவற்றில் பிழைகளை சரிசெய்யவும்

source: :issue:`800` Tasks: import and export tasks and DICOM queries and moves now listed with more information
ta: : வெளியீடு: `800` பணிகள்: கூடுதல் தகவல்களுடன் இப்போது பட்டியலிடப்பட்டுள்ள பணிகள் மற்றும் டிகாம் வினவல்கள் மற்றும் நகர்வுகள் இறக்குமதி மற்றும் ஏற்றுமதி

source: :issue:`799` DICOM Networking: workaround for stationnames > 16 characters
ta: : வெளியீடு: `799` டிகாம் நெட்வொர்க்கிங்: ச்டேசன் பெயர்களுக்கான பணித்தொகுப்பு> 16 எழுத்துக்கள்

source: :issue:`798` Exports: prevented error in export view if task_id is missing
ta: : வெளியீடு: `798` ஏற்றுமதி: பணி_ஐடி காணவில்லை என்றால் ஏற்றுமதி பார்வையில் பிழை தடுக்கப்பட்டது

source: :issue:`797` Exports: fixed string/byte issues with csv exports
ta: : வெளியீடு: `797` ஏற்றுமதி: சி.எச்.வி ஏற்றுமதியுடன் நிலையான சரம்/பைட் சிக்கல்கள்

source: :issue:`796` Exports: replaced file() with open() for Python 3.x compatibility
ta: : வெளியீடு: `796` ஏற்றுமதி: பைதான் 3.x பொருந்தக்கூடிய திறந்த () உடன் கோப்பை ()

source: :issue:`795` Exports: included acquisition name in PHE radiographic projection export
ta: : வெளியீடு: `795` ஏற்றுமதி: PHE ரேடியோகிராஃபிக் ப்ரொசெக்சன் ஏற்றுமதியில் கையகப்படுத்தல் பெயர் சேர்க்கப்பட்டுள்ளது

source: :issue:`793` Installation: added Docker installation
ta: : வெளியீடு: `793` நிறுவல்: கப்பல்துறை நிறுவல் சேர்க்கப்பட்டது

source: :issue:`791` Exports: prevented error when trying to export DX data that has no filter information
ta: : வெளியீடு: `791` ஏற்றுமதி: வடிகட்டி செய்தி இல்லாத டிஎக்ச் தரவை ஏற்றுமதி செய்ய முயற்சிக்கும்போது பிழையைத் தடுத்தது

source: :issue:`790` Python 3: remove basestring type
ta: : வெளியீடு: `790` பைதான் 3: பேச்ச்ட்ரிங் வகையை அகற்று

source: :issue:`789` Python 3: Median function aggregation code simplified; works with Python 3.7
ta: : வெளியீடு: `789` பைதான் 3: சராசரி செயல்பாடு திரட்டல் குறியீடு எளிமைப்படுத்தப்பட்டது; பைதான் 3.7 உடன் வேலை செய்கிறது
