Repository: 247i/TACETr
Catalog: உரை/தானி/openorienteering-mapper-*.po
Languages: ta

# OpenOrienteering::KmzGroundOverlayExport
source: For KML/KMZ export, the map must be georeferenced.
ta: KML/KMZ ஏற்றுமதியைப் பொறுத்தவரை, வரைபடம் உலகம் வழங்கப்பட வேண்டும்.

# OpenOrienteering::KmzGroundOverlayExport
source: Unknown error
ta: தெரியாத பிழை

# OpenOrienteering::KmzGroundOverlayExport
source: %1 already exists.
ta: %1 ஏற்கனவே உள்ளது.

# OpenOrienteering::LineSymbolSettings
source: Line settings
ta: வரி அமைப்புகள்

# OpenOrienteering::LineSymbolSettings
source: Line width:
ta: வரி அகலம்:

# OpenOrienteering::LineSymbolSettings
source: mm
ta: மிமீ

# OpenOrienteering::LineSymbolSettings
source: Line color:
ta: வரி நிறம்:

# OpenOrienteering::LineSymbolSettings
source: Minimum line length:
ta: குறைந்தபட்ச வரி நீளம்:

# OpenOrienteering::LineSymbolSettings
source: Line cap:
ta: வரி தொப்பி:

# OpenOrienteering::LineSymbolSettings
source: flat
ta: கிடைவளைவு

# OpenOrienteering::LineSymbolSettings
source: round
ta: சுற்று

# OpenOrienteering::LineSymbolSettings
source: square
ta: நாற்கை

# OpenOrienteering::LineSymbolSettings
source: pointed
ta: சுட்டிக்காட்டப்பட்டது

# OpenOrienteering::LineSymbolSettings
source: Line join:
ta: வரி சேர:

# OpenOrienteering::LineSymbolSettings
source: miter
ta: மைட்டர்

# OpenOrienteering::LineSymbolSettings
source: bevel
ta: பெவல்

# OpenOrienteering::LineSymbolSettings
source: Line is dashed
ta: வரி கோடு

# OpenOrienteering::LineSymbolSettings
source: Show at least one mid symbol
ta: குறைந்தது ஒரு நடுத்தர சின்னத்தைக் காட்டுங்கள்

# OpenOrienteering::LineSymbolSettings
source: Minimum mid symbol count:
ta: குறைந்தபட்ச மிட் சிம்பல் எண்ணிக்கை:

# OpenOrienteering::LineSymbolSettings
source: Minimum mid symbol count when closed:
ta: மூடப்படும் போது குறைந்தபட்ச இடைப்பட்ட குறியீட்டு எண்ணிக்கை:

# OpenOrienteering::LineSymbolSettings
source: Dash length:
ta: கோடு நீளம்:

# OpenOrienteering::LineSymbolSettings
source: Dashed line
ta: கோடு வரி

# OpenOrienteering::LineSymbolSettings
source: Break length:
ta: இடைவெளி நீளம்:

# OpenOrienteering::LineSymbolSettings
source: Dashes grouped together:
ta: கோடுகள் ஒன்றாக தொகுக்கப்பட்டுள்ளன:

# OpenOrienteering::LineSymbolSettings
source: none
ta: எதுவுமில்லை

# OpenOrienteering::LineSymbolSettings
source: In-group break length:
ta: குழு இடைவெளி நீளம்:

# OpenOrienteering::LineSymbolSettings
source: Half length of first and last dash
ta: முதல் மற்றும் கடைசி கோடு அரை நீளம்

# OpenOrienteering::LineSymbolSettings
source: Mid symbols placement:
ta: மிட் சின்னங்கள் வேலைவாய்ப்பு:

# OpenOrienteering::LineSymbolSettings
source: Center of dashes
ta: கோடுகளின் நடுவண்

# OpenOrienteering::LineSymbolSettings
source: Center of dash groups
ta: கோடு குழுக்களின் நடுவண்

# OpenOrienteering::LineSymbolSettings
source: Center of gaps
ta: இடைவெளிகளின் நடுவண்

# OpenOrienteering::LineSymbolSettings
source: Mid symbols
ta: மிட் சின்னங்கள்

# OpenOrienteering::LineSymbolSettings
source: Mid symbols per spot:
ta: ஒரு இடத்திற்கு நடுப்பகுதி:

# OpenOrienteering::LineSymbolSettings
source: Mid symbol distance:
ta: மிட் சிம்பல் தூரம்:

# OpenOrienteering::LineSymbolSettings
source: Borders
ta: எல்லைகள்

# OpenOrienteering::LineSymbolSettings
source: Different borders on left and right sides
ta: இடது மற்றும் வலது பக்கங்களில் வெவ்வேறு எல்லைகள்

# OpenOrienteering::LineSymbolSettings
source: Left border:
ta: இடது எல்லை:

# OpenOrienteering::LineSymbolSettings
source: Right border:
ta: வலது எல்லை:

# OpenOrienteering::LineSymbolSettings
source: Cap length at start:
ta: தொடக்கத்தில் தொப்பி நீளம்:

# OpenOrienteering::LineSymbolSettings
source: Cap length at end:
ta: முடிவில் தொப்பி நீளம்:

# OpenOrienteering::LineSymbolSettings
source: Offset at start:
ta: தொடக்கத்தில் ஈடுசெய்ய:

# OpenOrienteering::LineSymbolSettings
source: Offset at end:
ta: முடிவில் ஈடுசெய்ய:

# OpenOrienteering::LineSymbolSettings
source: Start symbol
ta: குறியீடைத் தொடங்கவும்

# OpenOrienteering::LineSymbolSettings
source: Mid symbol
ta: மிட் அடையாளம்

# OpenOrienteering::LineSymbolSettings
source: End symbol
ta: இறுதி அடையாளம்

# OpenOrienteering::LineSymbolSettings
source: Dash symbol
ta: கோடு அடையாளம்

# OpenOrienteering::LineSymbolSettings
source: Enable border lines
ta: எல்லை கோடுகளை இயக்கவும்

# OpenOrienteering::LineSymbolSettings
source: Distance between spots:
ta: புள்ளிகளுக்கு இடையிலான தூரம்:

# OpenOrienteering::LineSymbolSettings
source: Distance from line end:
ta: வரி முடிவிலிருந்து தூரம்:

# OpenOrienteering::LineSymbolSettings
source: Suppress the dash symbol at line start and line end
ta: வரி தொடக்க மற்றும் வரி முடிவில் கோடு சின்னத்தை அடக்கவும்

# OpenOrienteering::LineSymbolSettings
source: Scale the dash symbol at corners
ta: கோடு சின்னத்தை மூலைகளில் அளவிடவும்

# OpenOrienteering::LineSymbolSettings
source: Border width:
ta: எல்லை அகலம்:

# OpenOrienteering::LineSymbolSettings
source: Border color:
ta: எல்லை நிறம்:

# OpenOrienteering::LineSymbolSettings
source: Border shift:
ta: பார்டர் சிப்ட்:

# OpenOrienteering::LineSymbolSettings
source: Border is dashed
ta: எல்லை கோடு

# OpenOrienteering::LineSymbolSettings
source: Border dash length:
ta: எல்லை கோடு நீளம்:

# OpenOrienteering::LineSymbolSettings
source: Border break length:
ta: எல்லை இடைவெளி நீளம்:

# OpenOrienteering::MainWindow
source: Cannot open file: %1 %2
ta: கோப்பைத் திறக்க முடியாது: %1 %2

# OpenOrienteering::MainWindow
source: Invalid file type.
ta: தவறான கோப்பு வகை.

# OpenOrienteering::MainWindow
source: &New
ta: &புதிய

# OpenOrienteering::MainWindow
source: Information
ta: தகவல்

# OpenOrienteering::MainWindow
source: When you select the "OK" button, the editor will ignore touch input.
ta: நீங்கள் "சரி" பொத்தானைத் தேர்ந்தெடுக்கும்போது, ​​டச் உள்ளீட்டை ஆசிரியர் புறக்கணிப்பார்.

# OpenOrienteering::MainWindow
source: Continue with touch input
ta: தொடு உள்ளீட்டுடன் தொடரவும்

# OpenOrienteering::MainWindow
source: Create a new map
ta: புதிய வரைபடத்தை உருவாக்கவும்

# OpenOrienteering::MainWindow
source: &Open...
ta: & திறந்த ...

# OpenOrienteering::MainWindow
source: Open an existing file
ta: ஏற்கனவே உள்ள கோப்பைத் திற

# OpenOrienteering::MainWindow
source: Open &recent
ta: திறந்த & அண்மைக் கால

# OpenOrienteering::MainWindow
source: &Save
ta: சேமி (&s)

# OpenOrienteering::MainWindow
source: Save &as...
ta: என சேமி... (&a)

# OpenOrienteering::MainWindow
source: Settings...
ta: அமைப்புகள் ...

# OpenOrienteering::MainWindow
source: Close
ta: மூடு

# OpenOrienteering::MainWindow
source: Close this file
ta: இந்த கோப்பை மூடு

# OpenOrienteering::MainWindow
source: E&xit
ta: வெளியேறு (&x)

# OpenOrienteering::MainWindow
source: Exit the application
ta: பயன்பாட்டிலிருந்து வெளியேறவும்

# OpenOrienteering::MainWindow
source: &File
ta: கோப்பு (&f)

# OpenOrienteering::MainWindow
source: General
ta: பொது

# OpenOrienteering::MainWindow
source: Open &Manual
ta: திறந்த & கையேடு

# OpenOrienteering::MainWindow
source: Show the help file for this application
ta: இந்த பயன்பாட்டிற்கான உதவி கோப்பைக் காட்டு

# OpenOrienteering::MainWindow
source: &About %1
ta: & சுமார் %1

# OpenOrienteering::MainWindow
source: Show information about this application
ta: இந்த பயன்பாடு பற்றிய தகவல்களைக் காட்டு

# OpenOrienteering::MainWindow
source: About &Qt
ta: பற்றி & கியுடி

# OpenOrienteering::MainWindow
source: Show information about Qt
ta: கியுடி பற்றிய தகவல்களைக் காட்டு

# OpenOrienteering::MainWindow
source: &Help
ta: உதவி (&h)

# OpenOrienteering::MainWindow
source: Do you want to remove the autosaved version?
ta: ஆட்டோசாவ் பதிப்பை அகற்ற விரும்புகிறீர்களா?

# OpenOrienteering::MainWindow
source: The file has been modified. Do you want to save your changes?
ta: கோப்பு மாற்றியமைக்கப்பட்டுள்ளது. உங்கள் மாற்றங்களைச் சேமிக்க விரும்புகிறீர்களா?

# OpenOrienteering::MainWindow
source: When you want to have touch input disabled, you must use another pointing device to select the "OK" button.
ta: நீங்கள் தொடு உள்ளீடு முடக்கப்பட விரும்பினால், "சரி" பொத்தானைத் தேர்ந்தெடுக்க மற்றொரு சுட்டிக்காட்டி சாதனத்தைப் பயன்படுத்த வேண்டும்.

# OpenOrienteering::MainWindow
source: Unsaved file
ta: சேமிக்கப்படாத கோப்பு

# OpenOrienteering::MainWindow
source: Warning
ta: எச்சரிக்கை

# OpenOrienteering::MainWindow
source: The symbol set import generated warnings.
ta: குறியீட்டு தொகுப்பு இறக்குமதி உருவாக்கப்பட்ட எச்சரிக்கைகளை உருவாக்கியது.

# OpenOrienteering::MainWindow
source: The selected map scale is 1:%1, but the chosen symbol set has a nominal scale of 1:%2. Do you want to scale the symbols to the selected scale?
ta: தேர்ந்தெடுக்கப்பட்ட வரைபட அளவுகோல் 1:%1, ஆனால் தேர்ந்தெடுக்கப்பட்ட குறியீட்டு தொகுப்பு 1:%2 என்ற பெயரளவு அளவைக் கொண்டுள்ளது. தேர்ந்தெடுக்கப்பட்ட அளவிற்கு சின்னங்களை அளவிட விரும்புகிறீர்களா?

# OpenOrienteering::MainWindow
source: Crash warning
ta: செயலிழப்பு எச்சரிக்கை

# OpenOrienteering::MainWindow
source: It seems that %1 crashed the last time this file was opened:<br /><tt>%2</tt><br /><br />Really retry to open it?
ta: இந்த கோப்பு திறக்கப்பட்ட கடைசி நேரத்தில் %1 செயலிழந்ததாகத் தெரிகிறது: <br /> <tt> %2 </tt> <br /> <br /> உண்மையில் அதைத் திறக்க மீண்டும் முயற்சிக்கிறதா?

# OpenOrienteering::MainWindow
source: Autosaving...
ta: ஆட்டோசேவிங் ...

# OpenOrienteering::MainWindow
source: Autosaving failed!
ta: ஆட்டோசேவிங் தோல்வியடைந்தது!

# OpenOrienteering::MainWindow
source: All maps
ta: அனைத்து வரைபடங்களும்

# OpenOrienteering::MainWindow
source: All files
ta: அனைத்து கோப்புகள்

# OpenOrienteering::MainWindow
source: Open file
ta: கோப்பை திற

# OpenOrienteering::MainWindow
source: You must close the current file before you can open another one.
ta: நீங்கள் இன்னொன்றைத் திறப்பதற்கு முன்பு தற்போதைய கோப்பை மூட வேண்டும்.

# OpenOrienteering::MainWindow
source: Opening %1
ta: திறந்த %1

# OpenOrienteering::MainWindow
source: Error
ta: பிழை

# OpenOrienteering::MainWindow
source: Cannot open file: %1 File format not recognized.
ta: கோப்பைத் திறக்க முடியாது: %1 கோப்பு வடிவம் அங்கீகரிக்கப்படவில்லை.

# OpenOrienteering::MainWindow
source: The file has been modified. Do you want to discard your changes?
ta: கோப்பு மாற்றியமைக்கப்பட்டுள்ளது. உங்கள் மாற்றங்களை நிராகரிக்க விரும்புகிறீர்களா?

# OpenOrienteering::MainWindow
source: This map is being saved as a "%1" file. Information may be lost. Press Yes to save in this format. Press No to choose a different format.
ta: இந்த வரைபடம் "%1" கோப்பாக சேமிக்கப்படுகிறது. செய்தி இழக்கப்படலாம். இந்த வடிவத்தில் சேமிக்க ஆம் என்பதை அழுத்தவும். வேறு வடிவமைப்பைத் தேர்வு செய்ய வேண்டாம் என்பதை அழுத்தவும்.

# OpenOrienteering::MainWindow
source: Save file
ta: கோப்பை சேமி

# OpenOrienteering::MainWindow
source: File could not be saved:
ta: கோப்பை சேமிக்க முடியவில்லை:

# OpenOrienteering::MainWindow
source: There was a problem in determining the file format.
ta: கோப்பு வடிவமைப்பை தீர்மானிப்பதில் சிக்கல் இருந்தது.

# OpenOrienteering::MainWindow
source: Please report this as a bug.
ta: இதை ஒரு பிழையாக புகாரளிக்கவும்.

# OpenOrienteering::MainWindowController
source: Error
ta: பிழை

# OpenOrienteering::MainWindowController
source: Cannot export the map as "%1" because the format is unknown.
ta: வரைபடத்தை ஏற்றுமதி செய்ய முடியாது "%1" ஏனெனில் வடிவம் தெரியவில்லை.

# OpenOrienteering::MainWindowController
source: Cannot export the map as "%1" because saving as %2 (.%3) is not supported.
ta: வரைபடத்தை ஏற்றுமதி செய்ய முடியாது "%1" ஏனெனில் %2 (. %3) என சேமிப்பது ஆதரிக்கப்படவில்லை.

# OpenOrienteering::Map
source: Question
ta: கேள்வி

# OpenOrienteering::Map
source: The scale of the imported data is 1:%1 which is different from this map's scale of 1:%2. Rescale the imported data?
ta: இறக்குமதி செய்யப்பட்ட தரவின் அளவு 1:%1 ஆகும், இது இந்த வரைபடத்தின் அளவின் 1:%2 இலிருந்து வேறுபட்டது. இறக்குமதி செய்யப்பட்ட தரவை மீட்டெடுக்கவா?

# OpenOrienteering::Map
source: Error
ta: பிழை

# OpenOrienteering::Map
source: default part
ta: இயல்புநிலை பகுதி

# OpenOrienteering::Map
source: New color
ta: புதிய நிறம்

# OpenOrienteering::Map
source: Import...
ta: இறக்குமதி ...

# OpenOrienteering::Map
source: Symbol replacement was canceled. Import the data anyway?
ta: குறியீட்டு மாற்று ரத்து செய்யப்பட்டது. எப்படியும் தரவை இறக்குமதி செய்யவா?

# OpenOrienteering::MapColor
source: Registration black (all printed colors)
ta: பதிவு கருப்பு (அனைத்து அச்சிடப்பட்ட வண்ணங்களும்)

# OpenOrienteering::MapCoord
source: Coordinates are out-of-bounds.
ta: ஆயத்தொகுப்புகள் எல்லைக்கு அப்பாற்பட்டவை.

# OpenOrienteering::MapEditorController
source: Undo
ta: செயல்தவிர்

# OpenOrienteering::MapEditorController
source: Undo the last step
ta: கடைசி படியை செயல்தவிர்க்கவும்

# OpenOrienteering::MapEditorController
source: Redo
ta: மீண்டும்செய்

# OpenOrienteering::MapEditorController
source: Redo the last step
ta: கடைசி கட்டத்தை மீண்டும் செய்யுங்கள்

# OpenOrienteering::MapEditorController
source: Cu&t
ta: வெட்டு (&t)

# OpenOrienteering::MapEditorController
source: C&opy
ta: சி & திறந்த

# OpenOrienteering::MapEditorController
source: &Paste
ta: ஒட்டு (&p)

# OpenOrienteering::MapEditorController
source: Zoom in
ta: பெரிதாக்கு

# OpenOrienteering::MapEditorController
source: Zoom out
ta: சிறிதாக்கு

# OpenOrienteering::MapEditorController
source: Toggle fullscreen mode
ta: முழுத்திரை பயன்முறையை மாற்றவும்

# OpenOrienteering::MapEditorController
source: Set custom zoom factor...
ta: தனிப்பயன் சூம் காரணி அமைக்கவும் ...

# OpenOrienteering::MapEditorController
source: Symbol window
ta: அடையாளம் சாளரம்

# OpenOrienteering::MapEditorController
source: Show/Hide the symbol window
ta: குறியீட்டு சாளரத்தைக் காட்டவும்/மறைக்கவும்

# OpenOrienteering::MapEditorController
source: Color window
ta: வண்ண சாளரம்

# OpenOrienteering::MapEditorController
source: Show/Hide the color window
ta: வண்ண சாளரத்தைக் காட்டவும்/மறைக்கவும்

# OpenOrienteering::MapEditorController
source: Replace the symbols with those from another map file
ta: சின்னங்களை மற்றொரு வரைபடக் கோப்பிலிருந்து மாற்றவும்

# OpenOrienteering::MapEditorController
source: Scale all symbols...
ta: அனைத்து சின்னங்களையும் அளவிடவும் ...

# OpenOrienteering::MapEditorController
source: Scale the whole symbol set
ta: முழு குறியீட்டு தொகுப்பை அளவிடவும்

# OpenOrienteering::MapEditorController
source: Change map scale...
ta: வரைபட அளவை மாற்றவும் ...

# OpenOrienteering::MapEditorController
source: Change the map scale and adjust map objects and symbol sizes
ta: வரைபட அளவை மாற்றி, வரைபட பொருள்கள் மற்றும் குறியீட்டு அளவுகளை சரிசெய்யவும்

# OpenOrienteering::MapEditorController
source: Map notes...
ta: வரைபட குறிப்புகள் ...

# OpenOrienteering::MapEditorController
source: Template setup window
ta: வார்ப்புரு அமைவு சாளரம்

# OpenOrienteering::MapEditorController
source: Show/Hide the template window
ta: வார்ப்புரு சாளரத்தைக் காட்டவும்/மறைக்கவும்

# OpenOrienteering::MapEditorController
source: Open template...
ta: திறந்த வார்ப்புரு ...

# OpenOrienteering::MapEditorController
source: Show whole map
ta: முழு வரைபடத்தையும் காட்டு

# OpenOrienteering::MapEditorController
source: Edit objects
ta: பொருள்களைத் திருத்தவும்

# OpenOrienteering::MapEditorController
source: Set point objects
ta: புள்ளி பொருள்களை அமைக்கவும்

# OpenOrienteering::MapEditorController
source: Draw paths
ta: பாதைகளை வரையவும்

# OpenOrienteering::MapEditorController
source: Draw circles and ellipses
ta: வட்டங்கள் மற்றும் நீள்வட்டங்களை வரையவும்

# OpenOrienteering::MapEditorController
source: Write text
ta: உரையை எழுதுங்கள்

# OpenOrienteering::MapEditorController
source: Duplicate
ta: நகல்

# OpenOrienteering::MapEditorController
source: Switch symbol
ta: சுவிட்ச் அடையாளம்

# OpenOrienteering::MapEditorController
source: Fill / Create border
ta: எல்லையை நிரப்பவும் / உருவாக்கவும்

# OpenOrienteering::MapEditorController
source: Switch dash direction
ta: கோடு திசையை மாற்றவும்

# OpenOrienteering::MapEditorController
source: Connect paths
ta: பாதைகளை இணைக்கவும்

# OpenOrienteering::MapEditorController
source: Cut object
ta: வெட்டு பொருள்

# OpenOrienteering::MapEditorController
source: Measure lengths and areas
ta: நீளம் மற்றும் பகுதிகளை அளவிடவும்

# OpenOrienteering::MapEditorController
source: Cut away from area
ta: பகுதியிலிருந்து வெட்டுங்கள்

# OpenOrienteering::MapEditorController
source: Merge area holes
ta: பகுதி துளைகளை ஒன்றிணைக்கவும்

# OpenOrienteering::MapEditorController
source: Enable touch cursor
ta: டச் கர்சரை இயக்கவும்

# OpenOrienteering::MapEditorController
source: Enable GPS display
ta: சி.பி.எச் காட்சியை இயக்கவும்

# OpenOrienteering::MapEditorController
source: Enable GPS distance rings
ta: சி.பி.எச் தூர மோதிரங்களை இயக்கவும்

# OpenOrienteering::MapEditorController
source: Set point object at GPS position
ta: சி.பி.எச் நிலையில் புள்ளி பொருளை அமைக்கவும்

# OpenOrienteering::MapEditorController
source: Set temporary marker at GPS position
ta: சி.பி.எச் நிலையில் தற்காலிக மார்க்கரை அமைக்கவும்

# OpenOrienteering::MapEditorController
source: Create temporary path at GPS position
ta: சி.பி.எச் நிலையில் தற்காலிக பாதையை உருவாக்கவும்

# OpenOrienteering::MapEditorController
source: Clear temporary GPS markers
ta: தற்காலிக சி.பி.எச் குறிப்பான்களை அழிக்கவும்

# OpenOrienteering::MapEditorController
source: Enable compass display
ta: திசைகாட்டி காட்சியை இயக்கவும்

# OpenOrienteering::MapEditorController
source: Align map with north
ta: வரைபடத்தை வடக்கே சீரமைக்கவும்

# OpenOrienteering::MapEditorController
source: Add new part...
ta: புதிய பகுதியைச் சேர்க்கவும் ...

# OpenOrienteering::MapEditorController
source: Rename current part...
ta: தற்போதைய பகுதியை மறுபெயரிடுங்கள் ...

# OpenOrienteering::MapEditorController
source: Remove current part
ta: தற்போதைய பகுதியை அகற்று

# OpenOrienteering::MapEditorController
source: Merge all parts
ta: அனைத்து பகுதிகளையும் ஒன்றிணைக்கவும்

# OpenOrienteering::MapEditorController
source: Import...
ta: இறக்குமதி ...

# OpenOrienteering::MapEditorController
source: &Edit
ta: திருத்து (&e)

# OpenOrienteering::MapEditorController
source: &View
ta: காண்க (&v)

# OpenOrienteering::MapEditorController
source: &Tools
ta: கருவிகள் (&t)

# OpenOrienteering::MapEditorController
source: Sy&mbols
ta: மற்றும் & Mbols

# OpenOrienteering::MapEditorController
source: M&ap
ta: எம் & ஏபி

# OpenOrienteering::MapEditorController
source: &Templates
ta: & வார்ப்புருக்கள்

# OpenOrienteering::MapEditorController
source: Drawing
ta: வரைதல்

# OpenOrienteering::MapEditorController
source: Paint on template
ta: வார்ப்புருவில் வண்ணம் தீட்டவும்

# OpenOrienteering::MapEditorController
source: Editing in progress
ta: திருத்துதல் முன்னேற்றத்தில் உள்ளது

# OpenOrienteering::MapEditorController
source: The map is currently being edited. Please finish the edit operation before saving.
ta: வரைபடம் தற்போது திருத்தப்பட்டு வருகிறது. சேமிப்பதற்கு முன் திருத்து செயல்பாட்டை முடிக்கவும்.

# OpenOrienteering::MapEditorController
source: Map saved
ta: வரைபடம் சேமிக்கப்பட்டது

# OpenOrienteering::MapEditorController
source: Show grid
ta: கட்டத்தைக் காட்டு

# OpenOrienteering::MapEditorController
source: Configure grid...
ta: கட்டத்தை உள்ளமைக்கவும் ...

# OpenOrienteering::MapEditorController
source: Hatch areas
ta: அட்ச் பகுதிகள்

# OpenOrienteering::MapEditorController
source: Baseline view
ta: அடிப்படை பார்வை

# OpenOrienteering::MapEditorController
source: Hide all templates
ta: எல்லா வார்ப்புருக்களையும் மறைக்கவும்

# OpenOrienteering::MapEditorController
source: Replace symbol set...
ta: குறியீட்டு தொகுப்பை மாற்றவும் ...

# OpenOrienteering::MapEditorController
source: Georeferencing...
ta: சியோஃபெரென்சிங் ...

# OpenOrienteering::MapEditorController
source: Rotate map...
ta: வரைபடத்தை சுழற்றுங்கள் ...

# OpenOrienteering::MapEditorController
source: Rotate the whole map
ta: முழு வரைபடத்தையும் சுழற்றுங்கள்

# OpenOrienteering::MapEditorController
source: Reopen template...
ta: வார்ப்புருவை மீண்டும் திறக்கவும் ...

# OpenOrienteering::MapEditorController
source: Tag editor
ta: குறிச்சொல் ஆசிரியர்

# OpenOrienteering::MapEditorController
source: Show/Hide the tag editor window
ta: டேக் எடிட்டர் சாளரத்தைக் காட்டவும்/மறைக்கவும்

# OpenOrienteering::MapEditorController
source: Draw rectangles
ta: செவ்வகங்களை வரையவும்

# OpenOrienteering::MapEditorController
source: Draw free-handedly
ta: இலவசமாக வரையவும்

# OpenOrienteering::MapEditorController
source: Fill bounded areas
ta: எல்லைக்குட்பட்ட பகுதிகளை நிரப்பவும்

# OpenOrienteering::MapEditorController
source: Delete
ta: நீக்கு

# OpenOrienteering::MapEditorController
source: Cut free form hole
ta: இலவச படிவ துளை வெட்டு

# OpenOrienteering::MapEditorController
source: Cut round hole
ta: சுற்று துளை வெட்டு

# OpenOrienteering::MapEditorController
source: Cut rectangular hole
ta: செவ்வக துளை வெட்டு

# OpenOrienteering::MapEditorController
source: Rotate pattern
ta: சுழற்சி முறை

# OpenOrienteering::MapEditorController
source: Unify areas
ta: பகுதிகளை ஒன்றிணைக்கவும்

# OpenOrienteering::MapEditorController
source: Intersect areas
ta: வெட்டும் பகுதிகள்

# OpenOrienteering::MapEditorController
source: Area XOr
ta: பகுதி Xor

# OpenOrienteering::MapEditorController
source: Distribute points along path
ta: பாதையில் புள்ளிகளை விநியோகிக்கவும்

# OpenOrienteering::MapEditorController
source: Map coordinates
ta: வரைபட ஒருங்கிணைப்புகள்

# OpenOrienteering::MapEditorController
source: Projected coordinates
ta: திட்டமிடப்பட்ட ஆயத்தொலைவுகள்

# OpenOrienteering::MapEditorController
source: Latitude/Longitude (Dec)
ta: அட்சரேகை/தீர்க்கரேகை (டிசம்பர்)

# OpenOrienteering::MapEditorController
source: Latitude/Longitude (DMS)
ta: அட்சரேகை (டி.எம்.எச்)

# OpenOrienteering::MapEditorController
source: Display coordinates as...
ta: ஒருங்கிணைப்புகளைக் காண்பி ...

# OpenOrienteering::MapEditorController
source: Cut hole
ta: துளை வெட்டு

# OpenOrienteering::MapEditorController
source: E
ta: இ

# OpenOrienteering::MapEditorController
source: L
ta: எல்

# OpenOrienteering::MapEditorController
source: S
ta: கள்

# OpenOrienteering::MapEditorController
source: P
ta: ப

# OpenOrienteering::MapEditorController
source: O
ta: ஓ

# OpenOrienteering::MapEditorController
source: T
ta: டி

# OpenOrienteering::MapEditorController
source: D
ta: டி

# OpenOrienteering::MapEditorController
source: Z
ta: சட்

# OpenOrienteering::MapEditorController
source: K
ta: கே

# OpenOrienteering::MapEditorController
source: H
ta: ம

# OpenOrienteering::MapEditorController
source: M
ta: மீ

# OpenOrienteering::MapEditorController
source: U
ta: உ

# OpenOrienteering::MapEditorController
source: Simple &course
ta: எளிய & பாடநெறி

# OpenOrienteering::MapEditorController
source: Select all
ta: அனைத்தையும் தெரிவுசெய்

# OpenOrienteering::MapEditorController
source: Select nothing
ta: எதையும் தேர்ந்தெடுக்கவும்

# OpenOrienteering::MapEditorController
source: Invert selection
ta: தலைகீழ் தேர்வு

# OpenOrienteering::MapEditorController
source: Move to my location
ta: எனது இருப்பிடத்திற்கு செல்லுங்கள்

# OpenOrienteering::MapEditorController
source: Symbol set ID...
ta: அடையாளம் தொகுப்பு ஐடி ...

# OpenOrienteering::MapEditorController
source: Edit the symbol set ID
ta: குறியீட்டு தொகுப்பு ஐடியைத் திருத்தவும்

# OpenOrienteering::MapEditorController
source: Load CRT file...
ta: CRT கோப்பை ஏற்றவும் ...

# OpenOrienteering::MapEditorController
source: Assign new symbols by cross-reference table
ta: குறுக்கு-குறிப்பு அட்டவணை மூலம் புதிய சின்னங்களை ஒதுக்குங்கள்

# OpenOrienteering::MapEditorController
source: Copy position
ta: நகல் நிலை

# OpenOrienteering::MapEditorController
source: Copy position to clipboard.
ta: இடைநிலைப்பலகைக்கு நிலையை நகலெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: View
ta: பார்வை

# OpenOrienteering::MapEditorController
source: Map parts
ta: வரைபட பாகங்கள்

# OpenOrienteering::MapEditorController
source: Editing
ta: திருத்துதல்

# OpenOrienteering::MapEditorController
source: Advanced editing
ta: மேம்பட்ட திருத்துதல்

# OpenOrienteering::MapEditorController
source: Select symbol
ta: சின்னத்தைத் தேர்ந்தெடுக்கவும்

# OpenOrienteering::MapEditorController
source: Hide top bar
ta: மேல் பட்டியை மறைக்கவும்

# OpenOrienteering::MapEditorController
source: Show top bar
ta: மேல் பட்டியைக் காட்டு
