Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: Function to check if built-in Store SCP or remote Query-Retrieve SCP returns a DICOM echo :param scp_pk: Primary key if either Store or QR SCP in database :param store_scp: True if checking Store SCP :param qr_scp: True if checking QR SCP :return: 'AssocFail', Success or ?
ta: உள்ளமைக்கப்பட்ட கடை SCP அல்லது ரிமோட் வினவல்-மறுமலர்ச்சி SCP ஒரு DICOM எக்கோவை வழங்குகிறது என்பதை சரிபார்க்க செயல்பாடு: PARAM SCP_PK: முதன்மை விசை தரவுத்தளத்தில் கடை அல்லது QR SCP: PARAM STORE_SCP: உண்மை SCP: PARAM QR_SCP: உண்மை QR ஐ சரிபார்த்தால் உண்மை SCP: திரும்ப: 'அசோக்ஃபெயில்', செய் அல்லது?

source: Non-DICOM import modules
ta: டிகாம் அல்லாத இறக்குமதி தொகுதிகள்

source: Patient height and weight csv import module
ta: நோயாளியின் உயரம் மற்றும் எடை காபிம இறக்குமதி தொகுதி

source: This module enables a csv file to be parsed and the height and weight information extracted and added to existing studies in the OpenREM database. An example may be a csv extract from a RIS or EPR system.
ta: இந்த தொகுதி ஒரு காபிம கோப்பை பாகுபடுத்தி, உயரம் மற்றும் எடை தகவல்கள் பிரித்தெடுக்கப்பட்டு OpenREM தரவுத்தளத்தில் இருக்கும் ஆய்வுகளில் சேர்க்கப்பட்டுள்ளது. ஒரு எடுத்துக்காட்டு ஒரு RIS அல்லது EPR அமைப்பிலிருந்து காபிம சாறு இருக்கலாம்.

source: There needs to be a common unique identifier for the exam - currently this is limited to accession number or study instance UID.
ta: தேர்வுக்கு ஒரு பொதுவான தனித்துவமான அடையாளங்காட்டி இருக்க வேண்டும் - தற்போது இது அணுகல் எண் அல்லது ஆய்வு நிகழ்வு UID க்கு மட்டுப்படுத்தப்பட்டுள்ளது.

source: Import patient height and weight data from csv RIS exports. Called from ``openrem_ptsizecsv.py`` script
ta: காபிம RIS ஏற்றுமதியிலிருந்து நோயாளியின் உயரம் மற்றும் எடை தரவை இறக்குமதி செய்க. `` OpenRem_ptsizecsv.py`` ச்கிரிப்டிலிருந்து அழைக்கப்படுகிறது

source: sys.argv from the command line call
ta: கட்டளை வரி அழைப்பிலிருந்து sys.argv

source: Example::
ta: எடுத்துக்காட்டு ::

source: Task to import patient size data from the OpenREM web interface.
ta: ஓபன்ரெம் வலை இடைமுகத்திலிருந்து நோயாளியின் அளவு தரவை இறக்குமதி செய்வதற்கான பணி.

source: Database index key for the import record, containing the path to the import csv file and the field header details.
ta: இறக்குமதி பதிவுக்கான தரவுத்தள குறியீட்டு விசை, இறக்குமதி காபிம கோப்பிற்கான பாதை மற்றும் புல தலைப்பு விவரங்களைக் கொண்டுள்ளது.

source: Running the test suite
ta: சோதனை தொகுப்பை இயக்குகிறது

source: **TODO: Update for Python 3, OpenREM 1.0**
ta: ** டோடோ: பைதான் 3 க்கான புதுப்பிப்பு, ஓபன்ரெம் 1.0 **

source: Code formatting and tests
ta: குறியீடு வடிவமைப்பு மற்றும் சோதனைகள்

source: Steps before pushing to Bitbucket. Commands assume you are in the root directory of the git repository, at the same level as README.rst and requirements.txt etc, and that you have activated a virtualenv with the project requirements installed (``pip install -e .``) plus Black (``pip install black``)
ta: பிட்பக்கெட்டுக்கு தள்ளும் முன் படிகள். நீங்கள் அறிவிலி களஞ்சியத்தின் ரூட் கோப்பகத்தில், ReadMe.rst மற்றும் தேவைகள். TXT போன்றவற்றின் அதே மட்டத்தில் இருப்பதாக கட்டளைகள் கருதுகின்றன, மேலும் நிறுவப்பட்ட திட்டத் தேவைகளுடன் நீங்கள் ஒரு மெய்நிகர்இன்வியை செயல்படுத்தியுள்ளீர்கள் (`` பிஐபி நிறுவல் -இ .``) பிளச் கருப்பு (`` பிஐபி நிறுவல் கருப்பு``)

source: Run black against the code:
ta: குறியீட்டிற்கு எதிராக கருப்பு இயக்கவும்:

source: Check the changes made, edit where necessary. Black is an opinionated Python formatter and in general OpenREM code should be subjected to it. The flake8 tests are tuned to agree with Black.
ta: செய்யப்பட்ட மாற்றங்களைச் சரிபார்க்கவும், தேவையான இடங்களில் திருத்தவும். பிளாக் என்பது ஒரு கருத்து பைதான் வடிவமாகும், பொதுவாக ஓபன்ரெம் குறியீடு அதற்கு உட்படுத்தப்பட வேண்டும். பிளேக் 8 சோதனைகள் பிளாக் உடன் உடன்படுகின்றன.

source: Run the Django tests:
ta: சாங்கோ சோதனைகளை இயக்கவும்:

source: **old stuff to be updated**
ta: ** புதுப்பிக்கப்பட வேண்டிய பழைய விசயங்கள் **

source: Preparation
ta: தயாரிப்பு

source: Install the dependencies and OpenREM
ta: சார்புநிலைகள் மற்றும் ஓபன்ரெம் நிறுவவும்

source: OpenREM is a Django application, and therefore we use Django's test-execution framework to test OpenREM.
ta: ஓபன்ரெம் ஒரு சாங்கோ பயன்பாடு, எனவே ஓபன்ரெமை சோதிக்க சாங்கோவின் சோதனை-நிர்வாக கட்டமைப்பைப் பயன்படுத்துகிறோம்.

source: The first thing to do is to create a local copy of the git repository, then install all of OpenREM's dependencies in a virtualenv.
ta: முதலில் செய்ய வேண்டிய சேதி என்னவென்றால், அறிவிலி களஞ்சியத்தின் உள்ளக நகலை உருவாக்குவது, பின்னர் ஓபன்ரெமின் அனைத்து சார்புகளையும் ஒரு மெய்நிகர் ஈன்வியில் நிறுவவும்.

source: You will need ``python``, ``pip``, ``git`` and ``virtualenv`` installed - see the links on the : doc : `install-prep` docs for the latter, but you might try ``pip install virtualenv``.
ta: உங்களுக்கு `` பைதான்``, `` பிப்``, `கிட்`` மற்றும்` `மெய்நிகர்என்வ்`` நிறுவப்பட்டிருக்கும் - இணைப்புகளைப் பார்க்கவும்: டிஓசி:` நிறுவல் -தயாரித்தல்` டாக்ச்கள் பிந்தையவருக்கு, ஆனால் நீங்கள் முயற்சி செய்யலாம் `` பிஐபி நிறுவு மெய்நிகர்இன்வ்``.

source: Now create the virtualenv:
ta: இப்போது மெய்நிகர் ஈவ் உருவாக்கவும்:

source: At this stage there should be a ``(veOpenREM)`` prefix to our prompt telling us the virtualenv is activated.
ta: இந்த கட்டத்தில் `` (VEOPENREM) `` மெய்நிகர்இன்வி செயல்படுத்தப்பட்டதாக நமக்குக் கூறும் எங்கள் வரியில் முன்னொட்டு இருக்க வேண்டும்.

source: Now install the dependencies:
ta: இப்போது சார்புகளை நிறுவவும்:

source: In the future it might be necessary to install numpy too for testing.
ta: எதிர்காலத்தில் சோதனைக்கு நம்பியையும் நிறுவ வேண்டியது தேவை.

source: Configure OpenREM
ta: OpenRem ஐ உள்ளமைக்கவும்

source: Rename and configure ``openremproject/local_settings.py.example`` and ``openremproject/wsgi.py.example`` as per the : doc :`install` docs.
ta: `` OpenRemproject/local_settings.py.py.py.py.py.py.py.py.py.py.py.py.py.py.py.py.pey.py.py.py.example`` ஐ மறுபெயரிட்டு உள்ளமைக்கவும்: DOC: `நிறுவு` ஆவணங்கள்.

source: Create a database following the same : doc :`install` instructions.
ta: அதைப் பின்பற்றி ஒரு தரவுத்தளத்தை உருவாக்கவும்: DOC: `நிறுவல்` வழிமுறைகள்.

source: Run the tests!
ta: சோதனைகளை இயக்கவும்!

source: Making sure the virtualenv is activated, move to ``openremrepo/openrem`` and run:
ta: மெய்நிகர்இன்வி செயல்படுத்தப்படுவதை உறுதிசெய்து, `` OpenRemrepo/OpenRem`` க்குச் சென்று இயக்கவும்:

source: All the tests that exit in ``openrem/remapp/tests/`` will now be run.
ta: `` OpenRem/Remapp/tests/`` இல் வெளியேறும் அனைத்து சோதனைகளும் இப்போது இயக்கப்படும்.

source: Related tools
ta: தொடர்புடைய கருவிகள்

source: Enabling django-debug-toolbar
ta: சாங்கோ-டெபக்-டூல்பரை இயக்குகிறது

source: See :doc:`enabling_debug_toolbar`
ta: காண்க: DOC: `பிழைத்திருத்த_டூல்பாரை இயக்குதல்`

source: Creating test versions of production systems
ta: விளைவாக்கம் அமைப்புகளின் சோதனை பதிப்புகளை உருவாக்குதல்

source: If you wish to create a duplicate install to test upgrades etc, refer to :ref:`restore-psql-linux` and the preceding text regarding making backups.
ta: மேம்படுத்தல்கள் போன்றவற்றை சோதிக்க நகல் நிறுவலை உருவாக்க விரும்பினால், பார்க்கவும்: குறிப்பு: `மீட்டமை-PSQL-LINUX` மற்றும் காப்புப்பிரதிகளை உருவாக்குவது தொடர்பான முந்தைய உரையை.

source: Tools and helper modules
ta: கருவிகள் மற்றும் உதவி தொகுதிகள்

source: Get values
ta: மதிப்புகளைப் பெறுங்கள்

source: Tiny modules to reduce repetition in the main code when extracting information from DICOM headers using pydicom.
ta: பைடிகோமைப் பயன்படுத்தி DICOM தலைப்புகளிலிருந்து தகவல்களைப் பிரித்தெடுக்கும் போது முதன்மையான குறியீட்டில் மறுபடியும் மறுபடியும் குறைக்க சிறிய தொகுதிகள்.

source: Get a list of keys from a dictionary which have the given value :param dict_of_elements: a dictionary of elements :param value_to_find: the value to look for in the dictionary :return: list of key names matching the given value
ta: கொடுக்கப்பட்ட மதிப்பைக் கொண்ட ஒரு அகராதியிலிருந்து விசைகளின் பட்டியலைப் பெறுங்கள்: param dict_of_elements: உறுப்புகளின் அகராதி: param value_to_find: அகராதியில் பார்க்க வேண்டிய மதிப்பு: திரும்ப: கொடுக்கப்பட்ட மதிப்புடன் பொருந்தக்கூடிய முக்கிய பெயர்களின் பட்டியல்

source: Create a code_value code_meaning pair entry in the ContextID table if it doesn't already exist.
ta: CODE_VALUE CODE_MEANING இணை உள்ளீட்டை CONTEXID அட்டவணையில் ஏற்கனவே இல்லை என்றால் அதை உருவாக்கவும்.

source: Code value as defined in the DICOM standard part 16
ta: குறியீடு மதிப்பு DICOM தரநிலை பகுதி 16 இல் வரையறுக்கப்பட்டுள்ளது

source: Code meaning as defined in the DICOM standard part 16
ta: குறியீடு பொருள் DICOM தரநிலை பகுதி 16 இல் வரையறுக்கப்பட்டுள்ளது

source: ContextID entry for code value passed
ta: குறியீடு மதிப்புக்கான சூழல் ஈடி நுழைவு

source: From a DICOM sequence, get the code meaning.
ta: ஒரு DICOM வரிசையில் இருந்து, குறியீடு பொருளைப் பெறுங்கள்.

source: DICOM sequence name.
ta: DICOM வரிசை பெயர்.

source: The DICOM dataset containing the sequence.
ta: வரிசையைக் கொண்ட DICOM தரவுத்தொகுப்பு.

source: str. -- code meaning
ta: str. - குறியீடு பொருள்

source: From a DICOM sequence, get the code value.
ta: ஒரு DICOM வரிசையில் இருந்து, குறியீடு மதிப்பைப் பெறுங்கள்.

source: int. -- code value
ta: int. - குறியீடு மதிப்பு

source: Get DICOM value by keyword reference.
ta: முக்கிய குறிப்பு மூலம் DICOM மதிப்பைப் பெறுங்கள்.

source: DICOM keyword, no spaces or plural as per dictionary.
ta: டிகாம் முக்கிய சொல், அகராதியின் படி இடைவெளிகள் அல்லது பன்மை இல்லை.

source: The DICOM dataset containing the tag.
ta: குறிச்சொல்லைக் கொண்ட DICOM தரவுத்தொகுப்பு.

source: str. -- value
ta: str. - மதிப்பு

source: Get DICOM value by tag group and element number.
ta: குறிச்சொல் குழு மற்றும் உறுப்பு எண் மூலம் DICOM மதிப்பைப் பெறுங்கள்.

source: Always use get_value_kw by preference for readability. This module can be required when reading private elements.
ta: வாசிப்புக்கான விருப்பத்தால் எப்போதும் Get_Value_KW ஐப் பயன்படுத்தவும். தனியார் கூறுகளைப் படிக்கும்போது இந்த தொகுதி தேவைப்படலாம்.

source: DICOM group and element number as a single hexadecimal number (prefix 0x).
ta: ஒற்றை எக்சாடெசிமல் எண்ணாக டிகாம் குழு மற்றும் உறுப்பு எண் (முன்னொட்டு 0x).

source: Turn multivalue names into a single string for correct encoding and pretty reproduction :param dicom_value: returned DICOM value, usually a name field. Might be single (string) or multivalue (list) :return: string of name(s)
ta: சரியான குறியாக்கம் மற்றும் அழகான இனப்பெருக்கம் செய்வதற்கான பன்முக பெயர்களை ஒற்றை சரமாக மாற்றவும்: பரம் DICOM_VALUE: திரும்பிய DICOM மதிப்பு, பொதுவாக ஒரு பெயர் புலம். ஒற்றை (சரம்) அல்லது மல்டிவல் (பட்டியல்) ஆக இருக்கலாம்: திரும்ப: பெயர் (கள்) சரம்

source: Prevent errors due to missing data in models :param model: database table :param field: database field :return: value or None
ta: மாதிரிகளில் தரவைக் காணவில்லை என்பதால் பிழைகளைத் தடுக்கவும்: பரம் மாதிரி: தரவுத்தள அட்டவணை: பரம் புலம்: தரவுத்தள புலம்: திரும்ப: மதிப்பு அல்லது எதுவுமில்லை

source: Tests if string can be converted to a float. If it can, return it :param string_number: string to test if is a number :return: string if number, nothing otherwise
ta: சோதனைகள் சரத்தை மிதவையாக மாற்ற முடியும். முடிந்தால், அதைத் தரவும்: பரம் சரம்_நம்பர்: ஒரு எண் என்றால் சோதிக்க சரம்: திரும்ப: சரம் எண் என்றால், வேறு எதுவும் இல்லை

source: Tests if string can be converted to a float. If yes returns it as decimal. :param string_number: string to test if a number :return: Decimal if convertable, None otherwise
ta: சோதனைகள் சரத்தை மிதவையாக மாற்ற முடியும். ஆம் என்றால் அதை தசமமாக வழங்குகிறது. .

source: Check if UID exists
ta: UID இருக்கிறதா என்று சரிபார்க்கவும்

source: Small module to check if UID already exists in the database.
ta: யுஐடி ஏற்கனவே தரவுத்தளத்தில் இருக்கிறதா என்று சரிபார்க்க சிறிய தொகுதி.

source: Check if UID already exists in database.
ta: UID ஏற்கனவே தரவுத்தளத்தில் இருக்கிறதா என்று சரிபார்க்கவும்.

source: Study UID.
ta: Uid படிக்கவும்.

source: 1 if it does exist, 0 otherwise
ta: 1 அது இருந்தால், 0 இல்லையெனில்

source: Record the object's SOP Instance UID so we can ignore it next time. If an object does need to be imported again, the original one needs to be deleted first.
ta: பொருளின் சோப் நிகழ்வு UID ஐ பதிவுசெய்க, எனவே அடுத்த முறை அதை புறக்கணிக்க முடியும். ஒரு பொருளை மீண்டும் இறக்குமதி செய்ய வேண்டியிருந்தால், அசல் ஒன்றை முதலில் நீக்க வேண்டும்.

source: GeneralStudyModuleAttr database object
ta: செனரல்ச்டுடிமோடூல்ஆட்டர் தரவுத்தள பொருள்

source: SOP Instance UID of object being imported
ta: இறக்குமதி செய்யப்படும் பொருளின் சோப் நிகழ்வு

source: DICOM time and date values
ta: DICOM நேரம் மற்றும் தேதி மதிப்புகள்

source: Module to convert betweeen DICOM and Python dates and times.
ta: பெட்வீன் டிகாம் மற்றும் பைதான் தேதிகள் மற்றும் நேரங்களை மாற்றுவதற்கான தொகுதி.

source: Get DICOM date string and return Python date.
ta: DICOM தேதி சரம் பெற்று பைதான் தேதியை திரும்பவும்.

source: Python date value
ta: பைதான் தேதி மதிப்பு

source: Get DICOM date time string and return Python date time.
ta: DICOM தேதி நேர சரம் பெற்று பைதான் தேதி நேரத்தைத் தரவும்.

source: Python date time value
ta: பைதான் தேதி நேர மதிப்பு

source: Get DICOM time string and return Python time.
ta: டிகாம் நேர சரம் பெற்று பைதான் நேரத்தை திரும்பவும்.

source: python time value
ta: பைதான் நேர மதிப்பு

source: Given a DICOM date, return a Python date.
ta: ஒரு டிகாம் தேதி கொடுக்கப்பட்டால், பைதான் தேதியைத் திருப்பித் தரவும்.

source: DICOM style date.
ta: டிகாம் பாணி தேதி.

source: Given a DICOM date time, return a Python date time.
ta: ஒரு DICOM தேதி நேரம் கொடுக்கப்பட்டால், ஒரு பைதான் தேதி நேரத்தைத் தரவும்.

source: DICOM style date time.
ta: டிகாம் பாணி தேதி நேரம்.

source: Given a Python date, return a DICOM date :param pythondate: Date :type pythondate: Python date object :returns: DICOM date as string
ta: ஒரு பைதான் தேதி கொடுக்கப்பட்டால், ஒரு டிகாம் தேதியைத் தரவும்: பரம் பைதாண்டேட்: தேதி: பைதாண்டேட் வகை: பைத்தான் தேதி பொருள்: வருமானம்: டிகாம் தேதி சரமாக

source: Given one or two dates of the form yyyy-mm-dd, return a DICOM date range.
ta: YYYY-MM-DD வடிவத்தின் ஒன்று அல்லது இரண்டு தேதிகள் கொடுக்கப்பட்டால், ஒரு DICOM தேதி வரம்பைத் தரவும்.

source: Date from, string, yyyy-mm-dd, 1900-01-01 if None or badly formatted
ta: தேதி, சரம், yyyy-mm-dd, 1900-01-01 எதுவுமில்லை அல்லது மோசமாக வடிவமைக்கப்பட்டால்

source: Date until, string, yyyy-mm-dd, today if None or badly formatted
ta: தேதி, சரம், yyyy-mm-dd, இன்று எதுவுமில்லை அல்லது மோசமாக வடிவமைக்கப்பட்டிருந்தால்

source: Single date range, bool, default False
ta: ஒற்றை தேதி வரம்பு, பூல், இயல்புநிலை பொய்

source: DICOM formatted date range or single date
ta: DICOM வடிவமைக்கப்பட்ட தேதி வரம்பு அல்லது ஒற்றை தேதி

source: Return DICOM formatted time without seconds from python time
ta: பைதான் நேரத்திலிருந்து விநாடிகள் இல்லாமல் டிகாம் வடிவமைக்கப்பட்ட நேரத்தை திரும்பவும்

source: Python datetime.time object
ta: பைதான் தேதிநேரம். நேர பொருள்

source: string, %H%M
ta: சரம், %h %மீ

source: Given one or two times of the format 0123, return DICOM formatted time range (without seconds)
ta: வடிவமைப்பின் ஒன்று அல்லது இரண்டு முறை 0123 கொடுக்கப்பட்டால், டிகாம் வடிவமைக்கப்பட்ட நேர வரம்பை (விநாடிகள் இல்லாமல்) திரும்பவும்

source: time, format 0123, 0000 if None
ta: நேரம், வடிவம் 0123, 0000 இல்லை என்றால்

source: time, format 0123, 2359 if None
ta: நேரம், வடிவம் 0123, 2359 இல்லை என்றால்

source: time range, string, format 0123-1234
ta: நேர வரம்பு, சரம், வடிவம் 0123-1234

source: Given a DICOM time, return a Python time.
ta: ஒரு டிகாம் நேரம் கொடுக்கப்பட்டால், ஒரு பைதான் நேரத்தை திருப்பித் தரவும்.

source: DICOM style time.
ta: டிகாம் பாணி ​​நேரம்.

source: Python time value
ta: பைதான் நேர மதிப்பு

source: Test for QA or other non-patient related studies
ta: QA அல்லது பிற நோயாளி அல்லாத ஆய்வுகளுக்கான சோதனை

source: Looks for indications that a study might be a test or QA study.
ta: ஒரு ஆய்வு ஒரு சோதனை அல்லது QA ஆய்வாக இருக்கலாம் என்பதற்கான அறிகுறிகளைத் தேடுகிறது.

source: Some values that might indicate a study was for QA or similar purposes are not recorded in the database, for example patient name. Therefore this module attempts to find such indications and creates an xml style string that can be recorded in the database on study import.
ta: ஒரு ஆய்வைக் குறிக்கும் சில மதிப்புகள் QA அல்லது ஒத்த நோக்கங்களுக்காக தரவுத்தளத்தில் பதிவு செய்யப்படவில்லை, எடுத்துக்காட்டாக நோயாளியின் பெயர். எனவே இந்த தொகுதி அத்தகைய அறிகுறிகளைக் கண்டுபிடிக்க முயற்சிக்கிறது மற்றும் ஆய்வு இறக்குமதியில் தரவுத்தளத்தில் பதிவு செய்யக்கூடிய எக்ச்எம்எல் பாணி சரத்தை உருவாக்குகிறது.

source: The DICOM dataset.
ta: டிகாம் தரவுத்தொகுப்பு.

source: str. -- xml style string if any trigger values are found.
ta: str. - எக்ச்எம்எல் பாணி ​​சரம் ஏதேனும் தூண்டுதல் மதிப்புகள் காணப்பட்டால்.

source: Views
ta: காட்சிகள்

source: Detail view for a CT study.
ta: சி.டி ஆய்வுக்கான விரிவான பார்வை.

source: Obtain data for CT summary view.
ta: CT சுருக்கம் பார்வைக்கு தரவைப் பெறுங்கள்.

source: Detail view for a DX study.
ta: டிஎக்ச் ஆய்வுக்கான விரிவான பார்வை.

source: Obtain data for radiographic summary view.
ta: ரேடியோகிராஃபிக் சுருக்கம் பார்வைக்கான தரவைப் பெறுங்கள்.

source: Log users out and re-direct them to the main page.
ta: பயனர்களை பதிவுசெய்து அவற்றை முதன்மையான பக்கத்திற்கு மீண்டும் இயக்கவும்.

source: Mammography data for summary view.
ta: சுருக்கமான பார்வைக்கு மேமோகிராஃபி தரவு.

source: Return multiplication within Django templates
ta: சாங்கோ வார்ப்புருக்களுக்குள் பெருக்கல்

source: the value to multiply
ta: பெருகுவதற்கான மதிப்பு

source: the second value to multiply
ta: பெருக்க இரண்டாவது மதிப்பு

source: the multiplication
ta: பெருக்கல்

source: Detail view for a NM study.
ta: ஒரு என்எம் ஆய்வுக்கான விரிவான பார்வை.

source: Obtain data for NM summary view.
ta: என்.எம் சுருக்கம் பார்வைக்கு தரவைப் பெறுங்கள்.

source: Detail view for an RF study.
ta: ஒரு வானலை ஆய்வுக்கான விரிவான பார்வை.

source: View to calculate a skin dose map. Currently just a copy of rf_detail_view.
ta: தோல் டோச் வரைபடத்தைக் கணக்கிட. தற்போது RF_DETAIL_VIEW இன் நகல்.

source: Obtain the system-level enable_standard_names setting.
ta: கணினி-நிலை enable_standard_names அமைப்பைப் பெறுங்கள்.

source: AJAX function to calculate the latest studies for each display name for a particular modality.
ta: ஒரு குறிப்பிட்ட முறைக்கு ஒவ்வொரு காட்சி பெயருக்கும் அண்மைக் கால ஆய்வுகளைக் கணக்கிட அசாக்ச் செயல்பாடு.

source: HTML table of modalities
ta: உஉகுமொ முறைகளின் அட்டவணை

source: openSkin related views
ta: ஓபன்ச்கின் தொடர்பான காட்சிகள்

source: openSkin related views.
ta: ஓபன்ச்கின் தொடர்பான காட்சிகள்.

source: Update skin dose map calculation settings.
ta: தோல் டோச் வரைபடக் கணக்கீட்டு அமைப்புகளைப் புதுப்பிக்கவும்.

source: If the form is valid, save the associated model.
ta: படிவம் செல்லுபடியாகும் என்றால், தொடர்புடைய மாதிரியைச் சேமிக்கவும்.

source: Insert the form into the context dict.
ta: படிவத்தை சூழல் கட்டளையில் செருகவும்.

source: Enable skin map calculations by adding model, or model and software version to `OpenSkinSafeList`.
ta: மாதிரி அல்லது மாதிரி மற்றும் மென்பொருள் பதிப்பை `Openskinsafelist` இல் சேர்ப்பதன் மூலம் தோல் வரைபடக் கணக்கீடுகளை இயக்கவும்.

source: Disable skin map calculations for particular model or model and software version.
ta: குறிப்பிட்ட மாதிரி அல்லது மாதிரி மற்றும் மென்பொருள் பதிப்பிற்கான தோல் வரைபட கணக்கீடுகளை முடக்கு.

source: Call the delete() method on the fetched object and then redirect to the success URL.
ta: பெறப்பட்ட பொருளில் நீக்கு () முறையை அழைத்து, பின்னர் செய் முகவரி க்கு திருப்பி விடுங்கள்.

source: Insert the single object into the context dict.
ta: ஒற்றை பொருளை சூழல் கட்டளைக்குள் செருகவும்.

source: Add or remove the software version restriction.
ta: மென்பொருள் பதிப்பு கட்டுப்பாட்டைச் சேர்க்கவும் அல்லது அகற்றவும்.

source: Check if device matches on manufacturer and model without version restriction.
ta: பதிப்பு கட்டுப்பாடு இல்லாமல் சாதனம் உற்பத்தியாளர் மற்றும் மாதிரியில் பொருந்துமா என்பதை சரிபார்க்கவும்.

source: openSkin safe list `OpenSkinSafeList` is checked against manufacturer and model. This function is then used to check if there are any entries on the list where `software_version` is blank.
ta: ஓபன்ச்கின் பாதுகாப்பான பட்டியல் `ஓபன்ச்கின்சாஃபெலிச்ட்` உற்பத்தியாளர் மற்றும் மாதிரிக்கு எதிராக சரிபார்க்கப்படுகிறது. இந்த செயல்பாடு பின்னர் `மென்பொருள்_்வெர்சன்` காலியாக இருக்கும் பட்டியலில் ஏதேனும் உள்ளீடுகள் உள்ளதா என்பதைச் சரிபார்க்கப் பயன்படுகிறது.

source: Queryset of safe list entries matching manufacturer and model
ta: பாதுகாப்பான பட்டியல் உள்ளீடுகளின் வினவல் உற்பத்தியாளர் மற்றும் மாதிரியுடன் பொருந்துகிறது

source: * **safe_list_model_pk** (*int or None*) -- Primary key of entry if match found, ``None`` otherwise * **model_enabled** (*bool*) -- ``True`` if match found with blank `software_version`, otherwise ``False``
ta: *. வெற்று `மென்பொருள்_்வெர்சன்` உடன், இல்லையெனில்` `தவறு``

source: **safe_list_model_pk** (*int or None*) -- Primary key of entry if match found, ``None`` otherwise
ta: **safe_list_model_pk** (*int or None*) -- Primary key of நுழைவு if match found, ``None`` otherwise

source: AJAX view to display if skin map calculations are enabled and links to change the configuration.
ta: தோல் வரைபடக் கணக்கீடுகள் இயக்கப்பட்டிருந்தால் மற்றும் உள்ளமைவை மாற்ற இணைப்புகள் காண்பிக்க அசாக்ச் பார்வை.

source: Get queryset of unique equipment names that match the manufacturer and model name being reviewed.
ta: உற்பத்தியாளர் மற்றும் மாதிரி பெயருடன் மதிப்பாய்வு செய்யப்படும் தனித்துவமான உபகரணப் பெயர்களின் வினவலைப் பெறுங்கள்.

source: Filters the `UniqueEquipmentNames` table for fluoroscopy entries (or dual fluoro + radiography) that match the manufacturer and model that has been selected.
ta: ஃப்ளோரோச்கோபி உள்ளீடுகளுக்கு (அல்லது இரட்டை ஃப்ளோரோ + ரேடியோகிராபி) `தனித்துவமான` அட்டவணையை வடிகட்டுகிறது, அவை தேர்ந்தெடுக்கப்பட்ட உற்பத்தியாளர் மற்றும் மாதிரியுடன் பொருந்துகின்றன.

source: Name of manufacturer from `UniqueEquipmentNames` table
ta: `UniqueequipmentNames` அட்டவணையில் இருந்து உற்பத்தியாளரின் பெயர்

source: Model name from `UniqueEquipmentNames` table
ta: `UniqueequipmentNames` அட்டவணையில் இருந்து மாதிரி பெயர்

source: Queryset filtered for fluoro systems matching the manufacturer and model name
ta: உற்பத்தியாளர் மற்றும் மாதிரி பெயருடன் பொருந்தக்கூடிய ஃப்ளோரோ அமைப்புகளுக்கு QUERYSET வடிகட்டப்படுகிறது

source: Return type
ta: திரும்ப வகை

source: Configuration and administration
ta: உள்ளமைவு மற்றும் நிர்வாகம்

source: Database administration
ta: தரவுத்தள நிர்வாகம்

source: Docker installations
ta: கப்பல்துறை நிறுவல்கள்

source: Database backup
ta: தரவுத்தள காப்புப்பிரதி

source: Open a shell (command prompt) in the Docker folder
ta: கப்பல்துறை கோப்புறையில் செல் (கட்டளை வரியில்) திறக்கவும்

source: To automate a regular backup (**recommended**) adapt the following command in a bash script:
ta: வழக்கமான காப்புப்பிரதியை தானியக்கமாக்குவதற்கு (** பரிந்துரைக்கப்படுகிறது **) பின்வரும் கட்டளையை பாச் ச்கிரிப்டில் மாற்றியமைக்கவும்:

source: or powershell script:
ta: அல்லது பவர்செல் ச்கிரிப்ட்:

source: You will need to ensure the backups are either regularly deleted/moved, or overwritten so that the backups don't fill the disk.
ta: காப்புப்பிரதிகள் தவறாமல் நீக்கப்பட்ட/நகர்த்தப்படுவதை உறுதிசெய்ய வேண்டும், அல்லது மேலெழுதப்பட வேண்டும், இதனால் காப்புப்பிரதிகள் வட்டை நிரப்பாது.

source: Database restore
ta: தரவுத்தள மீட்டமை

source: To restore a database backup to a new Docker container, install using the :doc:`installation` instructions and bring the containers up, but don't run the database commands. These instructions can also be used to create a duplicate server on a different system for testing or other purposes.
ta: ஒரு புதிய கப்பல்துறை கொள்கலனுக்கு தரவுத்தள காப்புப்பிரதியை மீட்டெடுக்க,: டாக்: `நிறுவல்` வழிமுறைகளைப் பயன்படுத்தி நிறுவவும், கொள்கலன்களை மேலே கொண்டு வரவும், ஆனால் தரவுத்தள கட்டளைகளை இயக்க வேண்டாம். சோதனை அல்லது பிற நோக்கங்களுக்காக வேறு கணினியில் நகல் சேவையகத்தை உருவாக்க இந்த வழிமுறைகள் பயன்படுத்தப்படலாம்.

source: Requires exactly the same version of OpenREM to be installed as the database was exported from
ta: தரவுத்தளம் ஏற்றுமதி செய்யப்படுவதால் OpenREM இன் அதே பதிப்பு நிறுவப்பட வேண்டும்
