Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: :issue:`383` Refreshed settings.py to django 1.8 including updating template settings and TEMPLATE_CONTEXT_PROCESSORS
ta: : வெளியீடு: `383` புதுப்பிக்கப்பட்ட அமைப்புகள்.

source: :issue:`380` Tube current now extracted from Siemens Intevo RDSR despite non-conformance
ta: : வெளியீடு: `380` குழாய் மின்னோட்டம் இப்போது சீமென்ச் இன்டெவோ ஆர்.டி.எச்.ஆரிடமிருந்து பிரித்தெடுக்கப்பட்டுள்ளது

source: :issue:`379` Exposure time now populated for fluoro if not supplied by RDSR
ta: : வெளியீடு: `379` வெளிப்பாடு நேரம் இப்போது rdsr ஆல் வழங்கப்படாவிட்டால் ஃப்ளோரோவுக்கு மக்கள் தொகை

source: :issue:`378` The display name of multiple systems can now be updated together using a single new name
ta: : வெளியீடு: `378` பல அமைப்புகளின் காட்சி பெயரை இப்போது ஒரு புதிய பெயரைப் பயன்படுத்தி ஒன்றாக புதுப்பிக்க முடியும்

source: :issue:`376` Corrected an ill-advised model change
ta: : வெளியீடு: `376` தவறான அறிவுறுத்தப்பட்ட மாதிரி மாற்றத்தை சரிசெய்தது

source: :issue:`374` CTDIw phantom size now displayed in CT detail view
ta: : வெளியீடு: `374` CTDIW பாண்டம் அளவு இப்போது CT விவரம் பார்வையில் காட்டப்பட்டுள்ளது

source: :issue:`373` Charts in some releases used GT rather than greater than or equal to for start date, now fixed
ta: : வெளியீடு: `373` விளக்கப்படங்கள் சில வெளியீடுகளில் சி.டி.

source: :issue:`372` Mammography studies now record an accumulated AGD per breast. Existing joint accumulated AGD values won't be changed. Ordering by Accumulated AGD now creates an entry per accumulated AGD, one per breast
ta: : வெளியீடு: `372` மேமோகிராஃபி ஆய்வுகள் இப்போது ஒரு மார்பகத்திற்கு திரட்டப்பட்ட ஏசிடியை பதிவு செய்கின்றன. தற்போதுள்ள கூட்டு திரட்டப்பட்ட AGD மதிப்புகள் மாற்றப்படாது. திரட்டப்பட்ட AGD ஆல் வரிசைப்படுத்துவது இப்போது திரட்டப்பட்ட AGD க்கு ஒரு நுழைவை உருவாக்குகிறது, ஒரு மார்பகத்திற்கு ஒன்று

source: :issue:`371` Mammo RDSR generates average mA where not recorded, mammo image populates mA
ta: : வெளியீடு: `371` மம்மோ ஆர்.டி.எச்.ஆர் பதிவு செய்யப்படாத இடத்தில் சராசரி எம்.ஏ.

source: :issue:`370` Added study description to mammography export
ta: : வெளியீடு: `370` மேமோகிராஃபி ஏற்றுமதியில் ஆய்வு விளக்கம் சேர்க்கப்பட்டது

source: :issue:`369` Bi-plane fluoroscopy studies now export correctly
ta: : வெளியீடு: `369` இரு விமான ஃப்ளோரோச்கோபி ஆய்வுகள் இப்போது சரியாக ஏற்றுமதி செய்கின்றன

source: :issue:`368` Mammo RDSR now imports correctly
ta: : வெளியீடு: `368` மம்மோ ஆர்.டி.எச்.ஆர் இப்போது சரியாக இறக்குமதி செய்கிறது

source: :issue:`365` Tube filtration is now displayed in the RF detail view
ta: : வெளியீடு: `365` குழாய் வடிகட்டுதல் இப்போது வானலை விவரம் பார்வையில் காட்டப்பட்டுள்ளது

source: :issue:`364` Philips Allura fluorscopy RDSRs now import correctly
ta: : வெளியீடு: `364` பிலிப்ச் அல்லூரா ஃப்ளோர்ச்கோபி ஆர்.டி.எச்.ஆர்.எச் இப்போது சரியாக இறக்குமதி செய்கிறது

source: :issue:`362` Display of RF where bi-plane RDSRs have been imported no longer crash the interface
ta: : வெளியீடு: `362` வானலை இன் காட்சி, அங்கு இரு-விமான RDSR கள் இறக்குமதி செய்யப்பட்டுள்ளன

source: :issue:`360` Charts: saving data from average data charts as csv or xls now includes frequency values
ta: : வெளியீடு: `360` விளக்கப்படங்கள்: சி.எச்.வி அல்லது எக்ச்எல்எச் என சராசரி தரவு விளக்கப்படங்களிலிருந்து தரவைச் சேமிப்பது இப்போது அதிர்வெண் மதிப்புகளை உள்ளடக்கியது

source: :issue:`359` Added missing 'y' to query retrieve command line help
ta: : வெளியீடு: கட்டளை வரி உதவியை மீட்டெடுக்க `359` காணாமல் போன 'ஒய்' சேர்க்கப்பட்டது

source: :issue:`357` Charts: button to return from histogram now displays the name of the main chart
ta: : வெளியீடு: `357` விளக்கப்படங்கள்: இச்டோகிராமில் இருந்து திரும்புவதற்கான பொத்தான் இப்போது முதன்மையான விளக்கப்படத்தின் பெயரைக் காட்டுகிறது

source: :issue:`356` Charts: histogram normalise button appears for all appropriate charts
ta: : வெளியீடு: `356` விளக்கப்படங்கள்: இச்டோகிராம் இயல்பாக்குதல் பொத்தான் அனைத்து பொருத்தமான விளக்கப்படங்களுக்கும் தோன்றும்

source: :issue:`355` Charts: sorting now works as expected for plots with a series per system
ta: :issue:`355` Charts: sorting now works அச் expected க்கு plots with a series per மண்டலம்

source: :issue:`352` Fixed CT xlsx exports that had complete study data in each series protocol sheet (from earlier beta)
ta: : வெளியீடு: ஒவ்வொரு தொடர் நெறிமுறை தாளிலும் (முந்தைய பீட்டாவிலிருந்து) முழுமையான ஆய்வுத் தரவைக் கொண்ட `352` நிலையான சி.டி எக்ச்எல்எச்எக்ச் ஏற்றுமதிகள் (முந்தைய பீட்டாவிலிருந்து)

source: :issue:`351` Charts: simplified chart JavaScript and Python code
ta: : வெளியீடு: `351` விளக்கப்படங்கள்: எளிமைப்படுத்தப்பட்ட விளக்கப்படம் சாவாச்கிரிப்ட் மற்றும் பைதான் குறியீடு

source: :issue:`350` DICOM networking documented for use with 3rd party store and advanced use with native
ta: : வெளியீடு: `350` டிகாம் நெட்வொர்க்கிங் 3 வது தரப்பு கடையுடன் பயன்படுத்த ஆவணப்படுத்தப்பட்டுள்ளது மற்றும் நேட்டிவ் உடன் மேம்பட்ட பயன்பாடு

source: :issue:`348` Study delete confirmation page now displays total DAP for DX or CR radiographic studies
ta: :issue:`348` Study நீக்கு confirmation page now displays total DAP க்கு DX or சிஆர் radiographic studies

source: :issue:`346` Charts: exporting a chart as an image no longer requires an internet connection
ta: : வெளியீடு: `346` விளக்கப்படங்கள்: ஒரு படமாக விளக்கப்படத்தை ஏற்றுமதி செய்வதற்கு இனி இணைய இணைப்பு தேவையில்லை

source: :issue:`345` CSV size imports in cm are now stored as m in the database. Interface display of size corrected.
ta: : வெளியீடு: முதல்வரில் `345` சி.எச்.வி அளவு இறக்குமதி இப்போது தரவுத்தளத்தில் எம் ஆக சேமிக்கப்படுகிறது. அளவின் இடைமுக காட்சி சரி செய்யப்பட்டது.

source: :issue:`343` Charts: user can now specify number of histogram bins in the range of 2 to 40
ta: : வெளியீடு: `343` விளக்கப்படங்கள்: பயனர் இப்போது 2 முதல் 40 வரம்பில் இச்டோகிராம் தொட்டிகளின் எண்ணிக்கையைக் குறிப்பிடலாம்

source: :issue:`342` Charts: improved the colours used for plotting chart data
ta: : வெளியீடு: `342` விளக்கப்படங்கள்: விளக்கப்படத் தரவைத் திட்டமிடுவதற்குப் பயன்படுத்தப்படும் வண்ணங்களை மேம்படுத்தியது

source: :issue:`340` Fixed store failure to save due to illegal values in Philips private tags, improved exception code
ta: :issue:`340` Fixed store failure பெறுநர் சேமி due பெறுநர் illegal values in Philips தனிப்பட்ட tags, improved exception குறியீடு

source: :issue:`339` Improved extraction of requested procedure information for radiographic studies
ta: : வெளியீடு: `339` ரேடியோகிராஃபிக் ஆய்வுகளுக்கான கோரப்பட்ட நடைமுறை தகவல்களின் மேம்பட்ட பிரித்தெடுத்தல்

source: :issue:`338` Fix Kodak illegally using comma in filter thickness values
ta: : வெளியீடு: `338` வடிகட்டி தடிமன் மதிப்புகளில் கமாவைப் பயன்படுத்தி கோடக் சட்டவிரோதமாக சரிசெய்யவும்

source: :issue:`335` DICOM Store keep_alive and echo_scu functions now log correctly
ta: :issue:`335` DICOM Store keep_alive and echo_scu செயல்பாடுகள் now log correctly

source: :issue:`334` Fixed issue with tasks needing to be explicitly named
ta: : வெளியீடு: `334` பணிகளுக்கு வெளிப்படையாக பெயரிடப்பட வேண்டிய நிலையான சிக்கல்

source: :issue:`333` Fixed StoreSCP not starting in beta 11 error
ta: : வெளியீடு: `333` நிலையான ச்டோர்ச்கெப் பீட்டா 11 பிழையில் தொடங்கவில்லை

source: :issue:`332` Charts: some charts can now be plotted with a series per x-ray system
ta: : வெளியீடு: `332` விளக்கப்படங்கள்: சில விளக்கப்படங்களை இப்போது எக்ச்ரே அமைப்புக்கு ஒரு தொடருடன் திட்டமிடலாம்

source: :issue:`331` Keep_alive tasks are now discarded if not executed, so don't pile up
ta: : வெளியீடு: `331` கீப்_அலிவ் பணிகள் இப்போது செயல்படுத்தப்படாவிட்டால் நிராகரிக்கப்படுகின்றன, எனவே குவிய வேண்டாம்

source: :issue:`329` All existing logging is now done via the same log files
ta: : வெளியீடு: `329` தற்போதுள்ள அனைத்து பதிவுகளும் இப்போது ஒரே பதிவு கோப்புகள் வழியாக செய்யப்படுகின்றன

source: :issue:`328` Store SCP no longer uses Celery tasks
ta: : வெளியீடு: `328` கடை எச்சிபி இனி செலரி பணிகளைப் பயன்படுத்துவதில்லை

source: :issue:`327` Celery workers now only take one task at a time
ta: : வெளியீடு: `327` செலரி தொழிலாளர்கள் இப்போது ஒரு நேரத்தில் ஒரு பணியை மட்டுமே எடுத்துக் கொள்ளுங்கள்

source: :issue:`325` Charts: switching charts off now leaves the user on the same page, rather than going to the home page
ta: :issue:`325` Charts: switching விளக்கப்படங்கள் அணை now leaves the பயனர் on the same page, rather than going பெறுநர் the வீடு page

source: :issue:`324` Charts: forced chart tooltip background to be opaque to make reading the text easier
ta: : வெளியீடு: `324` விளக்கப்படங்கள்: கட்டாய விளக்கப்படம் உதவிக்குறிப்பு பின்னணி உரையை எளிதாக்குவதற்கு ஒளிபுகா

source: :issue:`320` The week now begins on Monday rather than Sunday on date form fields
ta: :issue:`320` The week now begins on Monday rather than Sunday on திகதி form புலங்கள்

source: :issue:`316` Query retrieve function can now exclude and include based on strings entered
ta: : வெளியீடு: `316` வினவல் மீட்டெடுக்கும் செயல்பாட்டை இப்போது விலக்கி, உள்ளிட்ட சரங்களின் அடிப்படையில் சேர்க்கலாம்

source: :issue:`315` Charts: made size of exported chart graphics follow the browser window size
ta: : வெளியீடு: `315` விளக்கப்படங்கள்: ஏற்றுமதி செய்யப்பட்ட விளக்கப்படம் கிராபிக்ச் அளவு உலாவி சாளர அளவைப் பின்பற்றுங்கள்

source: :issue:`314` One version number declaration now used for distribute, docs and interface
ta: : வெளியீடு: `314` ஒரு பதிப்பு எண் அறிவிப்பு இப்போது விநியோகித்தல், டாக்ச் மற்றும் இடைமுகத்திற்கு பயன்படுத்தப்படுகிறது

source: :issue:`313` Replaced non-working function with code to extract SeriesDescription etc in query response message
ta: :issue:`313` Replaced non-working சார்பு with குறியீடு பெறுநர் extract SeriesDescription போறவை in query response செய்தி

source: :issue:`312` Display names are now grouped by modality
ta: : வெளியீடு: `312` காட்சி பெயர்கள் இப்போது முறையால் தொகுக்கப்பட்டுள்ளன

source: :issue:`311` Queries are deleted from database after a successful C-Move
ta: : வெளியீடு: `311` வினவல்கள் வெற்றிகரமான சி-மூடியத்திற்குப் பிறகு தரவுத்தளத்திலிருந்து நீக்கப்படுகின்றன

source: :issue:`310` Series level QR feedback now presented. Any further would require improvements in pynetdicom
ta: : வெளியீடு: `310` தொடர் நிலை QR கருத்து இப்போது வழங்கப்பட்டுள்ளது. மேலும் எந்தவொரு பைனெட்டிகாமில் மேம்பாடுகளும் தேவைப்படும்

source: :issue:`309` StoreSCP now deals safely with incoming files with additional transfer syntax tag
ta: : வெளியீடு: `309` STORESCP இப்போது கூடுதல் பரிமாற்ற தொடரியல் குறிச்சொல்லுடன் உள்வரும் கோப்புகளுடன் பாதுகாப்பாக கையாள்கிறது

source: :issue:`308` Secondary capture images that don't have the manufacturer field no longer crash the StoreSCP function
ta: : வெளியீடு: `308` உற்பத்தியாளர் புலம் இல்லாத இரண்டாம் நிலை பிடிப்பு படங்கள் இனி STORESCP செயல்பாட்டை செயலிழக்காது

source: :issue:`306` Charts: added a button to each chart to toggle full-screen display
ta: : வெளியீடு: `306` விளக்கப்படங்கள்: முழு திரை காட்சியை மாற்ற ஒவ்வொரு விளக்கப்படத்திற்கும் ஒரு பொத்தானைச் சேர்த்தது

source: :issue:`305` Added links to documentation throughout the web interface
ta: : வெளியீடு: `305` வலை இடைமுகம் முழுவதும் ஆவணங்களுக்கான இணைப்புகளைச் சேர்த்தது

source: :issue:`304` Date of birth is now included in all exports that have either patient name or ID included
ta: : வெளியீடு: `304` பிறந்த தேதி இப்போது நோயாளியின் பெயர் அல்லது ஐடி சேர்க்கப்பட்ட அனைத்து ஏற்றுமதியிலும் சேர்க்கப்பட்டுள்ளது

source: :issue:`303` Fixed a typo in 0.6.0 documents relating to the storescp command
ta: : வெளியீடு: `303` STORESCP கட்டளை தொடர்பான 0.6.0 ஆவணங்களில் ஒரு எழுத்துப்பிழை சரி செய்யப்பட்டது

source: :issue:`302` Improved handling of Philips Dose Info objects when series information sequence has UN value representation
ta: : வெளியீடு: `302` பிலிப்ச் டோச் செய்தி பொருள்களின் மேம்பட்ட கையாளுதல் தொடர் செய்தி வரிசையில் ஐ.நா. மதிப்பு பிரதிநிதித்துவம் இருக்கும்போது

source: :issue:`301` Charts: fixed bug that could stop average kVp and mAs radiographic plots from working
ta: : வெளியீடு: `301` விளக்கப்படங்கள்: சராசரி கே.வி.பி மற்றும் எம்ஏஎச் ரேடியோகிராஃபிக் அடுக்குகளை வேலை செய்வதை நிறுத்தக்கூடிய நிலையான பிழை

source: :issue:`300` Calling AE Title for Query Retrieve SCU is now configured not hardcoded
ta: :issue:`300` Calling AE Title க்கு Query Retrieve SCU is now configured not hardcoded

source: :issue:`299` Hash of MultiValued DICOM elements now works
ta: : வெளியீடு: `299` பன்முகப்படுத்தப்பட்ட டிகாம் கூறுகளின் ஆச் இப்போது செயல்படுகிறது

source: :issue:`298` Added ordering by accumulated AGD for mammographic studies
ta: : வெளியீடு: `298` மேமோகிராஃபிக் ஆய்வுகளுக்காக திரட்டப்பட்ட ஏ.சி.டி.

source: :issue:`297` Fixed ordering by Total DAP for radiographic studies
ta: : வெளியீடு: `297` ரேடியோகிராஃபிக் ஆய்வுகளுக்கான மொத்த டிஏபி மூலம் நிலையான வரிசைப்படுத்துதல்

source: :issue:`296` StoreSCP now logs an error message and continues if incoming file has problems
ta: : வெளியீடு: `296` STORESCP இப்போது ஒரு பிழை செய்தியை பதிவுசெய்கிறது மற்றும் உள்வரும் கோப்பில் சிக்கல்கள் இருந்தால் தொடர்கிறது

source: :issue:`295` Charts: fixed bug that arose on non-PostgreSQL databases
ta: : வெளியீடு: `295` விளக்கப்படங்கள்: போச்ட்கிரெச் அல்லாத தரவுத்தளங்களில் எழுந்த நிலையான பிழை

source: :issue:`294` Harmonised time display between filter list and detail view, both to HH:mm
ta: :issue:`294` Harmonised time காட்சி between வடிப்பி பட்டியல் and detail view, both பெறுநர் HH:mm

source: :issue:`292` Added keep-alive and auto-start to DICOM stores
ta: : வெளியீடு: `292` டிகாம் கடைகளில் வைத்திருக்கும் மற்றும் தானாகத் தொடங்கும்

source: :issue:`291` Charts: fixed issue with CTDI and DLP not showing correct drilldown data
ta: : வெளியீடு: `291` விளக்கப்படங்கள்: சி.டி.டி.ஐ மற்றும் டி.எல்.பி உடன் நிலையான சிக்கல் சரியான துரப்பணம் தரவைக் காட்டவில்லை

source: :issue:`290` Added new tables and fields to migration file, uses :issue:`288` and median code from :issue:`241`
ta: :issue:`290` Added புதிய அட்டவணைகள் and புலங்கள் பெறுநர் குடிபெயர்வு file, uses :issue:`288` and இடைநடு குறியீடு இருந்து :issue:`241`

source: :issue:`289` Crispy forms added into the requires file
ta: : வெளியீடு: `289` மிருதுவான வடிவங்கள் தேவை கோப்பில் சேர்க்கப்படுகின்றன

source: :issue:`288` Added device name hashes to migration file
ta: : வெளியீடு: `288` இடம்பெயர்வு கோப்பில் சாதனத்தின் பெயர் ஆச்களைச் சேர்த்தது

source: :issue:`286` Increased granularity of permission groups
ta: : வெளியீடு: `286` இசைவு குழுக்களின் அதிகரித்த கிரானுலாரிட்டி

source: :issue:`285` Tidied up Options and Admin menus
ta: : வெளியீடு: `285` நேர்த்தியான விருப்பங்கள் மற்றும் நிர்வாக மெனுக்கள்

source: :issue:`282` Missing javascript file required for IE8 and below added
ta: : வெளியீடு: `282` காணாமல் போன சாவாச்கிரிப்ட் கோப்பு IE8 மற்றும் கீழே சேர்க்கப்பட்டுள்ளது

source: :issue:`281` Added check to import function to prevent extract failure
ta: : வெளியீடு: பிரித்தெடுத்தல் தோல்வியைத் தடுக்க இறக்குமதி செயல்பாட்டிற்கு `281` சேர்க்கப்பட்டது

source: :issue:`280` Fixed typo in mammography export
ta: : வெளியீடு: மேமோகிராஃபி ஏற்றுமதியில் `280` நிலையான எழுத்துப்பிழை

source: :issue:`279` Charts: Fixed issue with median CTDI series from appearing
ta: : வெளியீடு: `279` விளக்கப்படங்கள்: சராசரி சி.டி.டி.ஐ தொடருடன் நிலையான சிக்கல் தோன்றுவதிலிருந்து

source: :issue:`278` Charts: Fixed javascript namespace pollution that caused links to fail
ta: : வெளியீடு: `278` விளக்கப்படங்கள்: நிலையான சாவாச்கிரிப்ட் பெயர்வெளி மாசுபாடு இணைப்புகள் தோல்வியடையும்

source: :issue:`277` Overhaul of acquisition level filters to get tooltip generated filters to follow through to export
ta: :issue:`277` Overhaul of acquisition நிலை filters பெறுநர் get tooltip generated filters பெறுநர் follow through பெறுநர் ஏற்றுமதி

source: :issue:`276` Unique fields cannot have unlimited length in MySQL - replaced with hash
ta: : வெளியீடு: `276` தனித்துவமான புலங்கள் MySQL இல் வரம்பற்ற நீளத்தைக் கொண்டிருக்க முடியாது - ஆசுடன் மாற்றப்பட்டது

source: :issue:`274` Charts: Fixed legend display issue
ta: : வெளியீடு: `274` விளக்கப்படங்கள்: நிலையான புராணக் காட்சி சிக்கல்

source: :issue:`273` Charts: Added plots of average kVp and mAs over time for DX
ta: :issue:`273` Charts: Added plots of average kVp and mAs வீச்சலகு time க்கு DX

source: :issue:`272` Tweak to display of exam description for DX
ta: : வெளியீடு: `272` டி.எக்ச் -க்கு தேர்வு விளக்கத்தைக் காண்பிக்க மாற்றங்கள்

source: :issue:`271` Fixed DX import failure where ``AcquisitionDate`` or ``AcquisitionTime`` are ``None``
ta: :issue:`271` Fixed DX இறக்குமதி failure where ``AcquisitionDate`` or ``AcquisitionTime`` அரே ``None``

source: :issue:`270` Django 1.8 Admin site has a 'view site' link. Pointed it back to OpenREM
ta: : வெளியீடு: `270` சாங்கோ 1.8 நிர்வாக தளத்திற்கு 'பார்வை தளம்' இணைப்பு உள்ளது. அதை மீண்டும் ஓபன்ரெமுக்கு சுட்டிக்காட்டினார்

source: :issue:`268` Improved population of procedure_code_meaning for DX imports
ta: : வெளியீடு: `268` டிஎக்ச் இறக்குமதிக்கான நடைமுறையின் மேம்பட்ட மக்கள் தொகை_கோட்_மீனிங்

source: :issue:`266` DICOM C-Store script added back in - largely redundant with web interface
ta: : வெளியீடு: `266` டிகாம் சி -ச்டோர் ச்கிரிப்ட் மீண்டும் சேர்க்கப்பட்டது - பெரும்பாலும் வலை இடைமுகத்துடன் தேவையற்றது

source: :issue:`265` DICOM Store and Query Retrieve services documented
ta: : வெளியீடு: `265` DICOM STORE மற்றும் வினவல் ஆவணப்படுத்தப்பட்ட சேவைகளை மீட்டெடுக்கவும்

source: :issue:`263` Settings for keeping or deleting files once processed moved to database and web interface
ta: : வெளியீடு: செயலாக்கப்பட்டதும் கோப்புகளை வைத்திருப்பது அல்லது நீக்குவதற்கான அமைப்புகள் தரவுத்தளம் மற்றும் வலை இடைமுகத்திற்கு நகர்த்தப்பட்டன

source: :issue:`262` Dealt with issue where two exposures from the same study would race on import
ta: : வெளியீடு: `262` ஒரே ஆய்வின் இரண்டு வெளிப்பாடுகள் இறக்குமதியில் போட்டியிடும் சிக்கலைக் கையாண்டன

source: :issue:`260` Fixed issue where import and export jobs would get stuck behind StoreSCP task in queue
ta: :issue:`260` Fixed சிக்கல் where இறக்குமதி and ஏற்றுமதி jobs would get stuck behind StoreSCP task in queue

source: :issue:`259` Link to manage users added to Admin menu
ta: : வெளியீடு: நிர்வாக பட்டியலில் சேர்க்கப்பட்ட பயனர்களை நிர்வகிப்பதற்கான `259` இணைப்பு

source: :issue:`258` Fixed DX import error where manufacturer or model name was not provided
ta: : வெளியீடு: உற்பத்தியாளர் அல்லது மாதிரி பெயர் வழங்கப்படாத இடத்தில் `258` நிலையான டிஎக்ச் இறக்குமதி பிழை

source: :issue:`257` Documentation update
ta: : வெளியீடு: `257` ஆவணங்கள் புதுப்பிப்பு

source: :issue:`256` Fixed errors with non-ASCII characters in imports and query-retrieve
ta: : வெளியீடு: இறக்குமதியில் ASCII அல்லாத எழுத்துக்களுடன் `256` நிலையான பிழைகள்

source: :issue:`255` Charts: Small y-axis values on histograms are more visible when viewing full-screen
ta: : வெளியீடு: `255` விளக்கப்படங்கள்: முழு திரையைப் பார்க்கும்போது இச்டோகிராம்களில் சிறிய Y- அச்சு மதிப்புகள் அதிகம் தெரியும்

source: :issue:`254` Charts: Simplified chart data processing in the templates
ta: : வெளியீடு: `254` விளக்கப்படங்கள்: வார்ப்புருக்களில் எளிமைப்படுத்தப்பட்ட விளக்கப்படம் தரவு செயலாக்கம்

source: :issue:`253` Charts: AJAX used to make pages responsive with large datasets when charts enabled
ta: : வெளியீடு: `253` விளக்கப்படங்கள்: விளக்கப்படங்கள் இயக்கப்படும்போது பெரிய தரவுத்தொகுப்புகளுடன் பக்கங்களை பதிலளிக்க அசாக்ச் பயன்படுத்தப்படுகிறது

source: :issue:`252` Fixed duplicate entries in DX filtered data for studies with multiple exposures
ta: : வெளியீடு: பல வெளிப்பாடுகளுடன் கூடிய ஆய்வுகளுக்கான டிஎக்ச் வடிகட்டப்பட்ட தரவுகளில் `252` நிலையான நகல் உள்ளீடுகள்

source: :issue:`248` Charts: can now be ordered by frequency or alphabetically
ta: : வெளியீடு: `248` விளக்கப்படங்கள்: இப்போது அதிர்வெண் அல்லது அகர வரிசைப்படி ஆர்டர் செய்யலாம்

source: :issue:`247` Fixed incorrect reference to manufacturer_model_name
ta: : வெளியீடு: `247` உற்பத்தியாளர்_மாடல்_பேமுக்கு தவறான தவறான குறிப்பு

source: :issue:`246` Charts: Added median data for PostgreSQL users
ta: : வெளியீடு: `246` விளக்கப்படங்கள்: PostgresQL பயனர்களுக்கான சராசரி தரவு சேர்க்கப்பட்டது

source: :issue:`245` Fixed error in csv DX export
ta: : வெளியீடு: சி.எச்.வி டிஎக்ச் ஏற்றுமதியில் `245` நிலையான பிழை

source: :issue:`244` Fixed issue where scripts wouldn't function after upgrade to Django 1.8
ta: : வெளியீடு: `244` சாங்கோ 1.8 க்கு மேம்படுத்தப்பட்ட பிறகு ச்கிரிப்ட்கள் செயல்படாத நிலையான சிக்கல்

source: :issue:`243` Added distance related data to DX exports
ta: : வெளியீடு: `243` டிஎக்ச் ஏற்றுமதியில் தூரம் தொடர்பான தரவு சேர்க்கப்பட்டது

source: :issue:`242` Distance source to patient now extracted from DX images
ta: : வெளியீடு: `242` நோயாளிக்கு இப்போது டிஎக்ச் படங்களிலிருந்து பிரித்தெடுக்கப்பட்ட நோயாளிக்கு தூர மூலமானது

source: :issue:`241` Charts: Median values can be plotted for PostgreSQL users
ta: : வெளியீடு: `241` விளக்கப்படங்கள்: போச்ட்கிரெச்க்யூல் பயனர்களுக்கு சராசரி மதிப்புகள் திட்டமிடப்படலாம்

source: :issue:`240` Charts: Improved DAP over time calculations
ta: : வெளியீடு: `240` விளக்கப்படங்கள்: நேர கணக்கீடுகளில் மேம்பட்ட டிஏபி

source: :issue:`239` Configurable equipment names to fix multiple sources with the same station name
ta: : வெளியீடு: `239` ஒரே நிலைய பெயருடன் பல ஆதாரங்களை சரிசெய்ய கட்டமைக்கக்கூடிய உபகரணங்கள் பெயர்கள்

source: :issue:`237` Charts: Tidied up plot data calculations in ``views.py``
ta: :issue:`237` Charts: Tidied மேலே plot தகவல்கள் calculations in ``views.py``

source: :issue:`235` Added patient sex to each of the exports
ta: : வெளியீடு: `235` ஒவ்வொரு ஏற்றுமதியிலும் நோயாளி உடலுறவைச் சேர்த்தது

source: :issue:`234` Charts: Fixed error with datetime combine
ta: : வெளியீடு: `234` விளக்கப்படங்கள்: தேதிநேர இணைப்புடன் நிலையான பிழை

source: :issue:`232` Charts: on or off displayed on the home page
ta: : வெளியீடு: `232` விளக்கப்படங்கள்: முகப்பு பக்கத்தில் காண்பிக்கப்படுகிறது

source: :issue:`231` Charts: made links from requested procedure frequency plot respect the other filters
ta: : வெளியீடு: `231` விளக்கப்படங்கள்: கோரப்பட்ட நடைமுறை அதிர்வெண் சூழ்ச்சி மற்ற வடிப்பான்களை மதிக்க வேண்டும்

source: :issue:`230` Fixed error in OperatorsName field in DICOM extraction
ta: : வெளியீடு: DICOM பிரித்தெடுப்பதில் ஆபரேட்டர்ச் பெயர் புலத்தில் `230` நிலையான பிழை

source: :issue:`229` Charts: Added chart of DLP per requested procedure
ta: : வெளியீடு: `229` விளக்கப்படங்கள்: கோரப்பட்ட நடைமுறைக்கு டி.எல்.பியின் விளக்கப்படம் சேர்க்கப்பட்டது

source: :issue:`223` Charts: speed improvement for weekday charts
ta: : வெளியீடு: `223` விளக்கப்படங்கள்: வார நாள் விளக்கப்படங்களுக்கான வேக மேம்பாடு

source: :issue:`217` Charts: Further code optimisation to speed up calculation time
ta: : வெளியீடு: `217` விளக்கப்படங்கள்: கணக்கீட்டு நேரத்தை விரைவுபடுத்துவதற்கு மேலும் குறியீடு உகப்பாக்கம்

source: :issue:`207` DICOM QR SCU now available from web interface
ta: : வெளியீடு: `207` DICOM QR SCU இப்போது வலை இடைமுகத்திலிருந்து கிடைக்கிறது

source: :issue:`206` DICOM Store SCP configuration now available from web interface
ta: : வெளியீடு: `206` DICOM STORE SCP உள்ளமைவு இப்போது வலை இடைமுகத்திலிருந்து கிடைக்கிறது

source: :issue:`183` Added options to store patient name and ID, and options to hash name, ID and accession number
ta: : வெளியீடு: `183` நோயாளியின் பெயர் மற்றும் ஐடியை சேமிப்பதற்கான விருப்பங்கள், மற்றும் ஆச் பெயர், ஐடி மற்றும் அணுகல் எண்ணுக்கு விருப்பங்கள்

source: :issue:`171` Root URL now resolves so ``/openrem`` is not necessary
ta: : வெளியீடு: `171` ரூட் முகவரி இப்போது தீர்க்கிறது, எனவே` `/ஓபன்ரெம்`` தேவையில்லை

source: :issue:`151` Suspected non-patient studies can now be filtered out
ta: : வெளியீடு: `151` சந்தேகத்திற்குரிய நோயாளி அல்லாத ஆய்வுகள் இப்போது வடிகட்டப்படலாம்

source: :issue:`135` GE Senographe DS now correctly records compression force in Newtons for new imports
ta: : வெளியீடு: `135` சீ செனோகிராஃப் டி.எச் இப்போது புதிய இறக்குமதிக்காக நியூட்டனில் சுருக்க சக்தியை சரியாக பதிவு செய்கிறது

source: :issue:`120` Improved testing of data existing for exports
ta: : வெளியீடு: `120` ஏற்றுமதிக்கு இருக்கும் தரவின் மேம்பட்ட சோதனை

source: :issue:`118` Upgraded to Django 1.8
ta: : வெளியீடு: `118` சாங்கோவுக்கு மேம்படுத்தப்பட்டது 1.8

source: :issue:`70` User is returned to the filtered view after deleting a study
ta: : வெளியீடு: `70` ஒரு ஆய்வை நீக்கிய பிறகு பயனர் வடிகட்டப்பட்ட பார்வைக்குத் திரும்புவார்
