Repository: 247i/TACETr
Catalog: உரை/தானி/openorienteering-mapper-*.po
Languages: ta

# OpenOrienteering
source: Orienteering map
ta: ஓரியண்டரிங் வரைபடம்

# OpenOrienteering
source: Software for drawing orienteering maps
ta: ஓரியண்டரிங் வரைபடங்களை வரைவதற்கான மென்பொருள்

# OpenOrienteering::AboutDialog
source: About %1
ta: சுமார் %1

# OpenOrienteering::AboutDialog
source: <a %1>All about licenses, copyright notices, conditions and disclaimers.</a>
ta: <A %1> உரிமங்கள், பதிப்புரிமை அறிவிப்புகள், நிபந்தனைகள் மற்றும் மறுப்புகள் பற்றி. </a>

# OpenOrienteering::AboutDialog
source: The OpenOrienteering developers in alphabetical order:
ta: அகர வரிசைப்படி ஓபனோரியண்டரிங் டெவலப்பர்கள்:

# OpenOrienteering::AboutDialog
source: (project initiator)
ta: (திட்ட துவக்கி)

# OpenOrienteering::AboutDialog
source: A free software for drawing orienteering maps
ta: ஓரியண்டரிங் வரைபடங்களை வரைவதற்கான இலவச மென்பொருள்

# OpenOrienteering::AboutDialog
source: This program is free software: you can redistribute it and/or modify it under the terms of the <a %1>GNU General Public License (GPL), version&nbsp;3</a>, as published by the Free Software Foundation.
ta: இந்த நிரல் இலவச மென்பொருள்: இலவச மென்பொருள் அறக்கட்டளை வெளியிட்டுள்ளபடி, நீங்கள் அதை மறுபகிர்வு செய்யலாம் மற்றும்/அல்லது மாற்றலாம் <a %1> குனு பொது பொது உரிமம் (சிபிஎல்), பதிப்பு & nbsp; 3 </a>.

# OpenOrienteering::AboutDialog
source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License (GPL), version&nbsp;3, for <a %1>more details</a>.
ta: இந்த திட்டம் பயனுள்ளதாக இருக்கும் என்ற நம்பிக்கையில் விநியோகிக்கப்படுகிறது, ஆனால் எந்த உத்தரவாதமும் இல்லாமல்; ஒரு குறிப்பிட்ட நோக்கத்திற்காக வணிகத்தன்மை அல்லது உடற்தகுதி ஆகியவற்றின் மறைமுக பொறுப்பு கூட இல்லாமல். <a %1> மேலும் விவரங்களுக்கு குனு பொது பொது உரிமம் (சிபிஎல்), பதிப்பு & nbsp; 3 ஐப் பார்க்கவும் </a>.

# OpenOrienteering::AboutDialog
source: For contributions, thanks to:
ta: பங்களிப்புகளுக்கு, இதற்கு நன்றி:

# OpenOrienteering::AbstractHomeScreenWidget
source: Open most recently used file
ta: மிக அண்மைக் காலத்தில் பயன்படுத்தப்பட்ட கோப்பைத் திறக்கவும்

# OpenOrienteering::AbstractHomeScreenWidget
source: Show tip of the day
ta: அன்றைய உதவிக்குறிப்பைக் காட்டு

# OpenOrienteering::ActionGridBar
source: Show remaining items
ta: மீதமுள்ள பொருட்களைக் காட்டு

# OpenOrienteering::AreaSymbolSettings
source: Minimum size:
ta: குறைந்தபட்ச அளவு:

# OpenOrienteering::AreaSymbolSettings
source: Fills
ta: நிரப்புகிறது

# OpenOrienteering::AreaSymbolSettings
source: Line fill
ta: வரி நிரப்பு

# OpenOrienteering::AreaSymbolSettings
source: Pattern fill
ta: முறை நிரப்பு

# OpenOrienteering::AreaSymbolSettings
source: mm
ta: மிமீ

# OpenOrienteering::AreaSymbolSettings
source: Single line
ta: ஒற்றை இருப்புப்பாதை

# OpenOrienteering::AreaSymbolSettings
source: Parallel lines
ta: இணை கோடுகள்

# OpenOrienteering::AreaSymbolSettings
source: Line spacing:
ta: வரி இடைவெளி:

# OpenOrienteering::AreaSymbolSettings
source: Single row
ta: ஒற்றை வரிசை

# OpenOrienteering::AreaSymbolSettings
source: Pattern interval:
ta: முறை இடைவெளி:

# OpenOrienteering::AreaSymbolSettings
source: Pattern offset:
ta: முறை ஆஃப்செட்:

# OpenOrienteering::AreaSymbolSettings
source: Row offset:
ta: வரிசை ஆஃப்செட்:

# OpenOrienteering::AreaSymbolSettings
source: Parallel rows
ta: இணை வரிசைகள்

# OpenOrienteering::AreaSymbolSettings
source: Row spacing:
ta: வரிசை இடைவெளி:

# OpenOrienteering::AreaSymbolSettings
source: Fill rotation
ta: சுழற்சியை நிரப்பவும்

# OpenOrienteering::AreaSymbolSettings
source: Angle:
ta: கோணம்:

# OpenOrienteering::AreaSymbolSettings
source: adjustable per object
ta: ஒரு பொருளுக்கு சரிசெய்யக்கூடியது

# OpenOrienteering::AreaSymbolSettings
source: Element drawing at boundary
ta: எல்லையில் உறுப்பு வரைதல்

# OpenOrienteering::AreaSymbolSettings
source: Clip elements at the boundary.
ta: எல்லையில் உள்ள கூறுகளை கிளிப் செய்யுங்கள்.

# OpenOrienteering::AreaSymbolSettings
source: Draw elements if the center is inside the boundary.
ta: நடுவண் எல்லைக்குள் இருந்தால் கூறுகளை வரையவும்.

# OpenOrienteering::AreaSymbolSettings
source: Draw elements if any point is inside the boundary.
ta: எந்த புள்ளியும் எல்லைக்குள் இருந்தால் கூறுகளை வரையவும்.

# OpenOrienteering::AreaSymbolSettings
source: Draw elements if all points are inside the boundary.
ta: எல்லா புள்ளிகளும் எல்லைக்குள் இருந்தால் கூறுகளை வரையவும்.

# OpenOrienteering::AreaSymbolSettings
source: Area settings
ta: பகுதி அமைப்புகள்

# OpenOrienteering::AreaSymbolSettings
source: Pattern fill %1
ta: முறை நிரப்பு %1

# OpenOrienteering::AreaSymbolSettings
source: Line fill %1
ta: வரி நிரப்பு %1

# OpenOrienteering::AreaSymbolSettings
source: No fill selected
ta: நிரப்பு எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# OpenOrienteering::AreaSymbolSettings
source: Area color:
ta: பகுதி நிறம்:

# OpenOrienteering::AreaSymbolSettings
source: Line offset:
ta: வரி ஆஃப்செட்:

# OpenOrienteering::AreaSymbolSettings
source: Line color:
ta: வரி நிறம்:

# OpenOrienteering::AreaSymbolSettings
source: Line width:
ta: வரி அகலம்:

# OpenOrienteering::AutosaveDialog
source: Autosaved file
ta: தன்னியக்க கோப்பு

# OpenOrienteering::AutosaveDialog
source: %n bytes
ta: %n பைட்டுகள்

# OpenOrienteering::AutosaveDialog
source: File saved by the user
ta: கோப்பு பயனரால் சேமிக்கப்பட்டது

# OpenOrienteering::AutosaveDialog
source: File recovery
ta: கோப்பு மீட்பு

# OpenOrienteering::AutosaveDialog
source: File %1 was not properly closed. At the moment, there are two versions:
ta: கோப்பு %1 சரியாக மூடப்படவில்லை. இந்த நேரத்தில், இரண்டு பதிப்புகள் உள்ளன:

# OpenOrienteering::AutosaveDialog
source: Save the active file to remove the conflicting version.
ta: முரண்பட்ட பதிப்பை அகற்ற செயலில் உள்ள கோப்பை சேமிக்கவும்.

# OpenOrienteering::ColorDialog
source: Edit map color
ta: வரைபட நிறத்தைத் திருத்து

# OpenOrienteering::ColorDialog
source: Edit
ta: தொகு

# OpenOrienteering::ColorDialog
source: Spot color printing
ta: ச்பாட் வண்ண அச்சிடுதல்

# OpenOrienteering::ColorDialog
source: Defines a spot color:
ta: ச்பாட் நிறத்தை வரையறுக்கிறது:

# OpenOrienteering::ColorDialog
source: Screen frequency:
ta: திரை அதிர்வெண்:

# OpenOrienteering::ColorDialog
source: lpi
ta: எல்பிஐ

# OpenOrienteering::ColorDialog
source: Undefined
ta: வரையறுக்கப்படவில்லை

# OpenOrienteering::ColorDialog
source: Screen angle:
ta: திரை கோணம்:

# OpenOrienteering::ColorDialog
source: Mixture of spot colors (screens and overprint):
ta: ச்பாட் வண்ணங்களின் கலவை (திரைகள் மற்றும் ஓவர் பிரிண்ட்):

# OpenOrienteering::ColorDialog
source: Knockout: erases lower colors
ta: நாக் அவுட்: குறைந்த வண்ணங்களை அழிக்கிறது

# OpenOrienteering::ColorDialog
source: Calculate from spot colors
ta: ச்பாட் வண்ணங்களிலிருந்து கணக்கிடுங்கள்

# OpenOrienteering::ColorDialog
source: Calculate from RGB color
ta: RGB வண்ணத்திலிருந்து கணக்கிடுங்கள்

# OpenOrienteering::ColorDialog
source: Custom process color:
ta: தனிப்பயன் செயல்முறை நிறம்:

# OpenOrienteering::ColorDialog
source: Cyan
ta: சியான்

# OpenOrienteering::ColorDialog
source: Magenta
ta: மெசந்தா

# OpenOrienteering::ColorDialog
source: Yellow
ta: மஞ்சள்

# OpenOrienteering::ColorDialog
source: Black
ta: கருப்பு

# OpenOrienteering::ColorDialog
source: RGB
ta: ஆர்சிபி

# OpenOrienteering::ColorDialog
source: Calculate from CMYK color
ta: CMYK வண்ணத்திலிருந்து கணக்கிடுங்கள்

# OpenOrienteering::ColorDialog
source: Custom RGB color:
ta: தனிப்பயன் RGB நிறம்:

# OpenOrienteering::ColorDialog
source: Red
ta: சிவப்பு

# OpenOrienteering::ColorDialog
source: Green
ta: பச்சை

# OpenOrienteering::ColorDialog
source: Blue
ta: நீலம்

# OpenOrienteering::ColorDialog
source: #RRGGBB
ta: #RRGBB

# OpenOrienteering::ColorDialog
source: Color usage in symbols
ta: சின்னங்களில் வண்ண பயன்பாடு

# OpenOrienteering::ColorDialog
source: Desktop
ta: டெச்க்டாப்

# OpenOrienteering::ColorDialog
source: Professional printing
ta: தொழில்முறை அச்சிடுதல்

# OpenOrienteering::ColorDialog
source: Color usage
ta: வண்ண பயன்பாடு

# OpenOrienteering::ColorDialog
source: Name
ta: பெயர்

# OpenOrienteering::ColorDialog
source: - unnamed -
ta: - பெயரிடப்படாத -

# OpenOrienteering::ColorDialog
source: Warning
ta: எச்சரிக்கை

# OpenOrienteering::ColorDropDown
source: - none -
ta: - எதுவுமில்லை -

# OpenOrienteering::ColorListWidget
source: Name
ta: பெயர்

# OpenOrienteering::ColorListWidget
source: Opacity
ta: ஒளிபுகாநிலை

# OpenOrienteering::ColorListWidget
source: Spot color
ta: ச்பாட் நிறம்

# OpenOrienteering::ColorListWidget
source: RGB
ta: ஆர்சிபி

# OpenOrienteering::ColorListWidget
source: K.o.
ta: கே.ஓ.

# OpenOrienteering::ColorListWidget
source: New
ta: புதிய

# OpenOrienteering::ColorListWidget
source: Delete
ta: நீக்கு

# OpenOrienteering::ColorListWidget
source: Duplicate
ta: நகல்

# OpenOrienteering::ColorListWidget
source: Move Up
ta: மேலே செல்லுங்கள்

# OpenOrienteering::ColorListWidget
source: Move Down
ta: கீழே செல்லுங்கள்

# OpenOrienteering::ColorListWidget
source: Help
ta: உதவி

# OpenOrienteering::ColorListWidget
source: Double-click a color value to open a dialog.
ta: உரையாடலைத் திறக்க வண்ண மதிப்பை இருமுறை சொடுக்கு செய்யவும்.

# OpenOrienteering::ColorListWidget
source: Confirmation
ta: உறுதிப்படுத்தல்

# OpenOrienteering::ColorListWidget
source: The map contains symbols with this color. Deleting it will remove the color from these objects! Do you really want to do that?
ta: வரைபடத்தில் இந்த நிறத்துடன் சின்னங்கள் உள்ளன. அதை நீக்குவது இந்த பொருட்களிலிருந்து நிறத்தை அகற்றும்! நீங்கள் உண்மையில் அதை செய்ய விரும்புகிறீர்களா?

# OpenOrienteering::ColorListWidget
source: %1 (duplicate)
ta: %1 (நகல்)

# OpenOrienteering::ColorListWidget
source: (Duplicate)
ta: (நகல்)

# OpenOrienteering::ColorListWidget
source: Double click to define the color
ta: வண்ணத்தை வரையறுக்க இரட்டை சொடுக்கு செய்க

# OpenOrienteering::ColorListWidget
source: Click to select the name and click again to edit.
ta: பெயரைத் தேர்ந்தெடுக்க சொடுக்கு செய்து திருத்த மீண்டும் சொடுக்கு செய்க.

# OpenOrienteering::ColorListWidget
source: %1 (%2°, %3 lpi)
ta: %1 ( %2 °, %3 எல்பிஐ)

# OpenOrienteering::ColorWheelDialog
source: Select
ta: தேர்ந்தெடு

# OpenOrienteering::CombinedSymbolSettings
source: &Number of parts:
ta: பகுதிகளின் எண்ணிக்கை:

# OpenOrienteering::CombinedSymbolSettings
source: - Private line symbol -
ta: - தனியார் வரி அடையாளம் -

# OpenOrienteering::CombinedSymbolSettings
source: - Private area symbol -
ta: - தனியார் பகுதி அடையாளம் -

# OpenOrienteering::CombinedSymbolSettings
source: Edit private symbol...
ta: தனிப்பட்ட சின்னத்தைத் திருத்தவும் ...

# OpenOrienteering::CombinedSymbolSettings
source: Combination settings
ta: கூட்டு அமைப்புகள்

# OpenOrienteering::CombinedSymbolSettings
source: Change from public to private symbol
ta: பொதுவில் இருந்து தனியார் சின்னத்திற்கு மாற்றம்

# OpenOrienteering::CombinedSymbolSettings
source: Take the old symbol as template for the private symbol?
ta: பழைய சின்னத்தை தனியார் சின்னத்திற்கான வார்ப்புருவாக எடுத்துக் கொள்ளலாமா?

# OpenOrienteering::CombinedSymbolSettings
source: Symbol %1:
ta: அடையாளம் %1:

# OpenOrienteering::ConfigureGridDialog
source: Configure grid
ta: கட்டத்தை உள்ளமைக்கவும்

# OpenOrienteering::ConfigureGridDialog
source: Show grid
ta: கட்டத்தைக் காட்டு

# OpenOrienteering::ConfigureGridDialog
source: Snap to grid
ta: கட்டத்திற்கு ச்னாப்

# OpenOrienteering::ConfigureGridDialog
source: Choose...
ta: தேர்வு ...

# OpenOrienteering::ConfigureGridDialog
source: All lines
ta: அனைத்து வரிகளும்

# OpenOrienteering::ConfigureGridDialog
source: Horizontal lines
ta: கிடைமட்ட கோடுகள்

# OpenOrienteering::ConfigureGridDialog
source: Vertical lines
ta: செங்குத்து கோடுகள்

# OpenOrienteering::ConfigureGridDialog
source: Alignment
ta: இருப்புவழி

# OpenOrienteering::ConfigureGridDialog
source: Align with magnetic north
ta: காந்த வடக்கோடு சீரமைக்கவும்

# OpenOrienteering::ConfigureGridDialog
source: Align with grid north
ta: கட்டம் வடக்கோடு சீரமைக்கவும்

# OpenOrienteering::ConfigureGridDialog
source: Align with true north
ta: உண்மையான வடக்கோடு சீரமைக்கவும்

# OpenOrienteering::ConfigureGridDialog
source: Additional rotation (counter-clockwise):
ta: கூடுதல் சுழற்சி (எதிர்-கடிகார திசையில்):

# OpenOrienteering::ConfigureGridDialog
source: Positioning
ta: பொருத்துதல்

# OpenOrienteering::ConfigureGridDialog
source: meters in terrain
ta: நிலப்பரப்பில் மீட்டர்

# OpenOrienteering::ConfigureGridDialog
source: millimeters on map
ta: வரைபடத்தில் மில்லிமீட்டர்

# OpenOrienteering::ConfigureGridDialog
source: Horizontal spacing:
ta: கிடைமட்ட இடைவெளி:

# OpenOrienteering::ConfigureGridDialog
source: Vertical spacing:
ta: செங்குத்து இடைவெளி:

# OpenOrienteering::ConfigureGridDialog
source: Horizontal offset:
ta: கிடைமட்ட ஆஃப்செட்:

# OpenOrienteering::ConfigureGridDialog
source: Vertical offset:
ta: செங்குத்து ஆஃப்செட்:

# OpenOrienteering::ConfigureGridDialog measurement unit
source: Unit:
ta: அலகு:

# OpenOrienteering::ConfigureGridDialog
source: Line color:
ta: வரி நிறம்:

# OpenOrienteering::ConfigureGridDialog
source: Display:
ta: காட்சி:

# OpenOrienteering::ConfigureGridDialog
source: Choose grid line color
ta: கட்டம் வரி வண்ணத்தைத் தேர்வுசெய்க

# OpenOrienteering::ConfigureGridDialog meters
source: m
ta: மீ

# OpenOrienteering::ConfigureGridDialog millimeters
source: mm
ta: மிமீ

# OpenOrienteering::ConfigureGridDialog
source: Origin at: %1
ta: தோற்றம்: %1

# OpenOrienteering::ConfigureGridDialog
source: paper coordinates origin
ta: காகித ஒருங்கிணைப்பு தோற்றம்

# OpenOrienteering::ConfigureGridDialog
source: projected coordinates origin
ta: திட்டமிடப்பட்ட ஒருங்கிணைப்புகள் தோற்றம்

# OpenOrienteering::CutHoleTool
source: <b>Click or drag</b>: Start drawing the hole.
ta: <b> சொடுக்கு செய்யவும் அல்லது இழுக்கவும் </b>: துளை வரையத் தொடங்குங்கள்.

# OpenOrienteering::CutTool
source: Error
ta: பிழை

# OpenOrienteering::CutTool
source: The split line must end on the area boundary!
ta: பிளவு வரி பகுதி எல்லையில் முடிவடைய வேண்டும்!

# OpenOrienteering::CutTool
source: Start and end of the split line are at different parts of the object!
ta: பிளவு கோட்டின் தொடக்க மற்றும் முடிவு பொருளின் வெவ்வேறு பகுதிகளில் உள்ளது!

# OpenOrienteering::CutTool
source: Start and end of the split line are at the same position!
ta: பிளவு கோட்டின் தொடக்கமும் முடிவும் ஒரே நிலையில் உள்ளன!

# OpenOrienteering::CutTool
source: <b>Click</b> on a line: Split it into two. <b>Drag</b> along a line: Remove this line part. <b>Click or Drag</b> at an area boundary: Start a split line.
ta: <b> சொடுக்கு </b> ஒரு வரியில்: அதை இரண்டாகப் பிரிக்கவும். <b> இழுத்து </b> ஒரு வரியுடன்: இந்த வரி பகுதியை அகற்று. <b> சொடுக்கு அல்லது இழுக்கவும் </b> ஒரு பகுதி எல்லையில்: பிளவு வரியைத் தொடங்கவும்.

# OpenOrienteering::CutTool
source: Splitting holes of area objects is not supported yet!
ta: பகுதி பொருள்களின் துளைகளைப் பிரிப்பது இன்னும் ஆதரிக்கப்படவில்லை!

# OpenOrienteering::CutoutTool
source: <b>%1</b>: Clip the whole map.
ta: <b>%1 </b>: முழு வரைபடத்தையும் கிளிப் செய்யுங்கள்.

# OpenOrienteering::CutoutTool
source: <b>%1+Click or drag</b>: Select the objects to be clipped.
ta: <b>%1+கிளிக் செய்யவும் அல்லது இழுக்கவும் </b>: கிளிப் செய்ய வேண்டிய பொருள்களைத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::CutoutTool
source: <b>%1</b>: Clip the selected objects.
ta: <b>%1 </b>: தேர்ந்தெடுக்கப்பட்ட பொருள்களை கிளிப் செய்யுங்கள்.

# OpenOrienteering::DetermineFontSizeDialog
source: Letter:
ta: கடிதம்:

# OpenOrienteering::DetermineFontSizeDialog
source: Height:
ta: உயரம்:

# OpenOrienteering::DistributePointsSettingsDialog
source: Distribute points evenly along path
ta: புள்ளிகளை பாதையில் சமமாக விநியோகிக்கவும்

# OpenOrienteering::DistributePointsSettingsDialog
source: Number of points per path:
ta: பாதைக்கு புள்ளிகளின் எண்ணிக்கை:

# OpenOrienteering::DistributePointsSettingsDialog
source: Also place objects at line end points
ta: வரி இறுதி புள்ளிகளில் பொருட்களையும் வைக்கவும்

# OpenOrienteering::DistributePointsSettingsDialog
source: Rotation settings
ta: சுழற்சி அமைப்புகள்

# OpenOrienteering::DistributePointsSettingsDialog
source: Align points with direction of line
ta: வரியின் திசையுடன் புள்ளிகளை சீரமைக்கவும்

# OpenOrienteering::DistributePointsSettingsDialog
source: Additional rotation angle (counter-clockwise):
ta: கூடுதல் சுழற்சி கோணம் (எதிர்-கடிகார திசையில்):

# OpenOrienteering::DrawCircleTool Draw circle starting from center
source: From center
ta: மையத்திலிருந்து

# OpenOrienteering::DrawCircleTool
source: <b>Click</b>: Start a circle or ellipse.
ta: <b> சொடுக்கு </b>: ஒரு வட்டம் அல்லது நீள்வட்டத்தைத் தொடங்குங்கள்.

# OpenOrienteering::DrawCircleTool
source: <b>Drag</b>: Draw a circle.
ta: <b> இழுத்து </b>: ஒரு வட்டத்தை வரையவும்.

# OpenOrienteering::DrawCircleTool
source: Hold %1 to start drawing from the center.
ta: மையத்திலிருந்து வரையத் தொடங்க %1 ஐ வைத்திருங்கள்.

# OpenOrienteering::DrawCircleTool
source: <b>Click</b>: Finish the circle.
ta: <b> சொடுக்கு </b>: வட்டத்தை முடிக்கவும்.

# OpenOrienteering::DrawCircleTool
source: <b>Drag</b>: Draw an ellipse.
ta: <b> இழுத்து </b>: ஒரு நீள்வட்டத்தை வரையவும்.

# OpenOrienteering::DrawFreehandTool
source: <b>Drag</b>: Draw a path.
ta: <b> இழுத்து </b>: ஒரு பாதையை வரையவும்.

# OpenOrienteering::DrawLineAndAreaTool
source: <b>Dash points on.</b>
ta: <b> கோடு புள்ளிகள். </b>

# OpenOrienteering::DrawLineAndAreaTool
source: <b>%1+Click</b>: Snap or append to existing objects.
ta: <b>%1+கிளிக் </b>: ஏற்கனவே இருக்கும் பொருள்களை ஒடுக்கவும் அல்லது சேர்க்கவும்.

# OpenOrienteering::DrawLineAndAreaTool
source: <b>%1+Click</b>: Pick direction from existing objects.
ta: <b>%1+கிளிக் </b>: இருக்கும் பொருள்களிலிருந்து திசையைத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::DrawLineAndAreaTool
source: <b>%1+%2</b>: Segment azimuth and length.
ta: <b>%1+%2 </b>: பிரிவு அசிமுத் மற்றும் நீளம்.

# OpenOrienteering::DrawLineAndAreaTool
source: <b>%1+Click</b>: Snap to existing objects.
ta: <b>%1+கிளிக் </b>: இருக்கும் பொருள்களுக்கு ஒடுக்கவும்.

# OpenOrienteering::DrawLineAndAreaTool
source: <b>%1</b>: Fixed angles.
ta: <b>%1 </b>: நிலையான கோணங்கள்.

# OpenOrienteering::DrawLineAndAreaTool
source: <b>%1</b>: Undo last point.
ta: <b>%1 </b>: கடைசி புள்ளியை செயல்தவிர்க்கவும்.

# OpenOrienteering::DrawPathTool
source: Finish
ta: முடிக்க

# OpenOrienteering::DrawPathTool
source: Close
ta: மூடு

# OpenOrienteering::DrawPathTool Snap to existing objects
source: Snap
ta: ச்னாப்

# OpenOrienteering::DrawPathTool Using constrained angles
source: Angle
ta: கோணம்

# OpenOrienteering::DrawPathTool Show segment azimuth and length
source: Info
ta: தகவல்

# OpenOrienteering::DrawPathTool Drawing dash points
source: Dash
ta: கோடு

# OpenOrienteering::DrawPathTool
source: Undo
ta: செயல்தவிர்

# OpenOrienteering::DrawPathTool
source: Abort
ta: கருக்கலைப்பு

# OpenOrienteering::DrawPathTool
source: <b>Length:</b> %1 m
ta: <b> நீளம்: </b> %1 மீ

# OpenOrienteering::DrawPathTool
source: <b>Click</b>: Start a straight line. <b>Drag</b>: Start a curve.
ta: <b> சொடுக்கு </b>: ஒரு நேர் கோட்டைத் தொடங்கவும். <b> இழுத்து </b>: ஒரு வளைவைத் தொடங்கவும்.

# OpenOrienteering::DrawPathTool
source: <b>%1+Drag</b>: Follow existing objects.
ta: <b>%1+இழுத்தல் </b>: இருக்கும் பொருள்களைப் பின்பற்றுங்கள்.

# OpenOrienteering::DrawPathTool
source: <b>Click</b>: Draw a straight line. <b>Drag</b>: Draw a curve. <b>Right or double click</b>: Finish the path. <b>%1</b>: Close the path.
ta: <b> சொடுக்கு </b>: ஒரு நேர் கோட்டை வரையவும். <b> இழுத்து </b>: ஒரு வளைவை வரையவும். <b> வலது அல்லது இரட்டை சொடுக்கு </b>: பாதையை முடிக்கவும். <b>%1 </b>: பாதையை மூடு.

# OpenOrienteering::DrawPointGPSTool
source: Touch the map to finish averaging
ta: சராசரியை முடிக்க வரைபடத்தைத் தொடவும்

# OpenOrienteering::DrawPointGPSTool
source: <b>Click</b>: Finish setting the object.
ta: <b> சொடுக்கு </b>: பொருளை அமைப்பதை முடிக்கவும்.

# OpenOrienteering::DrawPointTool Snap to existing objects
source: Snap
ta: ச்னாப்

# OpenOrienteering::DrawPointTool Using constrained angles
source: Angle
ta: கோணம்

# OpenOrienteering::DrawPointTool Reset rotation
source: Reset
ta: மீட்டமை

# OpenOrienteering::DrawPointTool
source: <b>Angle:</b> %1°
ta: <b> கோணம்: </b> %1 °

# OpenOrienteering::DrawPointTool
source: <b>%1</b>: Fixed angles.
ta: <b>%1 </b>: நிலையான கோணங்கள்.

# OpenOrienteering::DrawPointTool
source: <b>Click</b>: Create a point object.
ta: <b> சொடுக்கு </b>: ஒரு புள்ளி பொருளை உருவாக்கவும்.

# OpenOrienteering::DrawPointTool
source: <b>Drag</b>: Create an object and set its orientation.
ta: <b> இழுத்து </b>: ஒரு பொருளை உருவாக்கி அதன் நோக்குநிலையை அமைக்கவும்.

# OpenOrienteering::DrawPointTool
source: <b>%1, 0</b>: Reset rotation.
ta: <b>%1, 0 </b>: சுழற்சியை மீட்டமை.

# OpenOrienteering::DrawRectangleTool
source: Finish
ta: முடிக்க

# OpenOrienteering::DrawRectangleTool Snap to existing objects
source: Snap
ta: ச்னாப்

# OpenOrienteering::DrawRectangleTool Snap to previous lines
source: Line snap
ta: வரி ச்னாப்

# OpenOrienteering::DrawRectangleTool Drawing dash points
source: Dash
ta: கோடு

# OpenOrienteering::DrawRectangleTool
source: Undo
ta: செயல்தவிர்

# OpenOrienteering::DrawRectangleTool
source: Abort
ta: கருக்கலைப்பு

# OpenOrienteering::DrawRectangleTool
source: <b>Click or Drag</b>: Start drawing a rectangle.
ta: <b> சொடுக்கு செய்யவும் அல்லது இழுக்கவும் </b>: ஒரு செவ்வகத்தை வரையத் தொடங்குங்கள்.

# OpenOrienteering::DrawRectangleTool
source: <b>%1</b>: Snap to previous lines.
ta: <b>%1 </b>: முந்தைய வரிகளுக்கு ஒடுங்கள்.

# OpenOrienteering::DrawRectangleTool
source: <b>Click</b>: Set a corner point. <b>Right or double click</b>: Finish the rectangle.
ta: <b> சொடுக்கு </b>: ஒரு மூலையில் புள்ளியை அமைக்கவும். <b> வலது அல்லது இரட்டை சொடுக்கு </b>: செவ்வகத்தை முடிக்கவும்.

# OpenOrienteering::DrawTextTool
source: Snap
ta: ச்னாப்

# OpenOrienteering::DrawTextTool
source: <b>%1</b>: Finish editing.
ta: <b>%1 </b>: திருத்துதல் முடிக்கவும்.

# OpenOrienteering::DrawTextTool
source: <b>%1+%2</b>: Cancel editing.
ta: <b>%1+%2 </b>: திருத்துதல் ரத்துசெய்.

# OpenOrienteering::DrawTextTool
source: <b>Click</b>: Create a text object with a single anchor. <b>Drag</b>: Create a text box.
ta: <b> சொடுக்கு </b>: ஒற்றை நங்கூரத்துடன் உரை பொருளை உருவாக்கவும். <b> இழுத்து </b>: உரை பெட்டியை உருவாக்கவும்.

# OpenOrienteering::EditLineTool Snap to existing objects
source: Snap
ta: ச்னாப்

# OpenOrienteering::EditLineTool Toggle between curved and flat segment
source: Toggle curve
ta: வளைவை மாற்றவும்

# OpenOrienteering::EditLineTool
source: <b>%1</b>: Free movement.
ta: <b>%1 </b>: இலவச இயக்கம்.

# OpenOrienteering::EditLineTool
source: <b>%1+Click</b> on segment: Toggle between straight and curved.
ta: <b>%1+கிளிக் </b> பிரிவில்: நேராக மற்றும் வளைந்த இடையே மாற்றவும்.

# OpenOrienteering::EditPointTool Snap to existing objects
source: Snap
ta: ச்னாப்

# OpenOrienteering::EditPointTool Modify points or use constrained angles
source: Point / Angle
ta: புள்ளி / கோணம்

# OpenOrienteering::EditPointTool Toggle dash points
source: Toggle dash
ta: கோடு மாற்று

# OpenOrienteering::EditPointTool
source: <b>%1</b>: Finish editing.
ta: <b>%1 </b>: திருத்துதல் முடிக்கவும்.

# OpenOrienteering::EditPointTool
source: <b>%1</b>: Keep opposite handle positions.
ta: <b>%1 </b>: எதிர் கைப்பிடி நிலைகளை வைத்திருங்கள்.

# OpenOrienteering::EditPointTool
source: <b>%1+Click</b> on point: Delete it; on path: Add a new dash point; with <b>%2</b>: Add a normal point.
ta: <b>%1+கிளிக் </b> புள்ளியில்: அதை நீக்கு; பாதையில்: புதிய கோடு புள்ளியைச் சேர்க்கவும்; <b>%2 </b> உடன்: ஒரு சாதாரண புள்ளியைச் சேர்க்கவும்.

# OpenOrienteering::EditPointTool
source: <b>%1+Click</b> on point: Delete it; on path: Add a new point; with <b>%2</b>: Add a dash point.
ta: <b>%1+கிளிக் </b> புள்ளியில்: அதை நீக்கு; பாதையில்: ஒரு புதிய புள்ளியைச் சேர்க்கவும்; <b>%2 </b> உடன்: ஒரு கோடு புள்ளியைச் சேர்க்கவும்.

# OpenOrienteering::EditPointTool
source: <b>%1+Click</b> on point to switch between dash and normal point.
ta: <b>%1+கிளிக் </b> கோடு மற்றும் சாதாரண புள்ளிகளுக்கு இடையில் மாற புள்ளியில்.
