Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: extra code to calculate the data for the new charts if they are switched on (``views.py``)
ta: புதிய விளக்கப்படங்களுக்கான தரவைக் கணக்கிட கூடுதல் குறியீடு அவற்றை இயக்கினால் (`` views.py``)

source: a section of html and JavaScript to contain the charts (``xxfiltered.html``)
ta: விளக்கப்படங்களைக் கொண்டிருக்க உஉகுமொ மற்றும் சாவாச்கிரிப்டின் ஒரு பகுதி (`` xxfiltered.html``)

source: a section of JavaScript to pass the data calculated by ``views.py`` to ``xxfiltered.html``
ta: `` views.py`` ஆல் கணக்கிடப்பட்ட தரவை `` xxfiltered.html`` க்கு அனுப்ப சாவாச்கிரிப்டின் ஒரு பகுதி.

source: The process is probably best illustrated with an example. What follows is a description of how to add a new chart that displays study workload for fluoroscopy, and a pie chart of study description frequency.
ta: செயல்முறை ஒரு எடுத்துக்காட்டுடன் சிறப்பாக விளக்கப்பட்டுள்ளது. ஃப்ளோரோச்கோபிற்கான ஆய்வு பணிச்சுமையைக் காண்பிக்கும் புதிய விளக்கப்படம் மற்றும் ஆய்வு விளக்க அதிர்வெண்ணின் பை விளக்கப்படம் ஆகியவற்றை எவ்வாறு சேர்ப்பது என்பதற்கான விளக்கமாகும்.

source: Additions to ``models.py``
ta: `` Models.py`` க்கு சேர்த்தல்

source: A field per chart needs to be added to the ``UserProfile`` section in ``models.py`` to control whether the new charts should be plotted. There is a section of this file that looks like the following:
ta: புதிய விளக்கப்படங்கள் திட்டமிடப்பட வேண்டுமா என்பதைக் கட்டுப்படுத்த `` Models.py`` இல் உள்ள `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` பிரிவில் ஒரு புலம் சேர்க்கப்பட வேண்டும். இந்த கோப்பின் ஒரு பகுதி பின்வருமாறு தெரிகிறது:

source: Two new lines needs to be added to this section, using appropriate names such as:
ta: இந்த பிரிவில் இரண்டு புதிய வரிகளைச் சேர்க்க வேண்டும், இது போன்ற பொருத்தமான பெயர்களைப் பயன்படுத்தி:

source: Adding new fields to ``models.py`` requires that a database migration is carried out to add the fields to the database. This is done via the command line::
ta: புதிய புலங்களை `` Models.py`` உடன் சேர்ப்பது தரவுத்தளத்தில் புலங்களைச் சேர்க்க தரவுத்தள இடம்பெயர்வு மேற்கொள்ளப்பட வேண்டும். இது கட்டளை வரி :: வழியாக செய்யப்படுகிறது

source: The first command should result in a response similar to::
ta: முதல் கட்டளை :: போன்ற பதிலை ஏற்படுத்த வேண்டும் ::

source: The second command should result in a response similar to::
ta: இரண்டாவது கட்டளை :: போன்ற பதிலை ஏற்படுத்த வேண்டும் ::

source: That's the end of the changes required in ``models.py``
ta: `` Models.py`` இல் தேவைப்படும் மாற்றங்களின் முடிவு அது

source: Additions to ``forms.py``
ta: `` `படிவங்கள்

source: Two additional lines need to be added to the ``XXChartOptionsForm`` and ``XXChartOptionsDisplayForm`` methods in ``forms.py``, where ``XX`` is one of ``CT``, ``DX``, ``MG`` or ``RF``.
ta: `` Xxchartoptionsform`` மற்றும் `` xxchartoptionssdisplayform` முறைகளில் `` `xx`` இல் இரண்டு கூடுதல் வரிகளைச் சேர்க்க வேண்டும், அங்கு` `xx``,` `dx`` dx``` dx`` , `` Mg`` அல்லது `` rf``.

source: For our new charts the following lines needs to be added to both ``RFChartOptionsForm`` and ``RFChartOptionsDisplayForm``:
ta: எங்கள் புதிய விளக்கப்படங்களுக்கு பின்வரும் வரிகளை `` rfchartoptionsform`` மற்றும் `` rfchartoptionsdisplayform`` ஆகிய இரண்டிலும் சேர்க்க வேண்டும்:

source: In addition, a new method needs to be added so that the RF chart options are shown when the user goes to Config -> Chart options:
ta: கூடுதலாக, ஒரு புதிய முறையைச் சேர்க்க வேண்டும், இதனால் பயனர் கட்டமைப்பிற்குச் செல்லும்போது வானலை விளக்கப்பட விருப்பங்கள் காண்பிக்கப்படும் -> விளக்கப்படம் விருப்பங்கள்:

source: That's the end of the changes required in ``forms.py``
ta: `` `படிவங்கள்.பீ`` இல் தேவைப்படும் மாற்றங்களின் முடிவு அது

source: Additions to ``views.py``
ta: `` Views.py`` க்கு சேர்த்தல்

source: Four methods in this file need to be updated.
ta: இந்த கோப்பில் நான்கு முறைகள் புதுப்பிக்கப்பட வேண்டும்.

source: ``xx_summary_list_filter`` additions
ta: `` xx_summary_list_filter`` சேர்த்தல்

source: Some additions need to be made to the ``xx_summary_list_filter`` method in ``views.py``, where ``xx`` is one of ``ct``, ``dx``, ``mg`` or ``rf``. As we're adding new RF charts, we need to edit ``rf_summary_list_filter``.
ta: `` `Views.py`` இல்` `xx_summary_list_filter`` முறைக்கு சில சேர்த்தல்கள் செய்யப்பட வேண்டும், அங்கு `` xx``, `` ct`, `` dx``, `` mg``` `` rf``. நாங்கள் புதிய வானலை விளக்கப்படங்களைச் சேர்ப்பதால், `` rf_summary_list_filter`` ஐ திருத்த வேண்டும்.

source: A section of this method examines the user's chart plotting preferences. Code must be added to include the new chart in these checks. An abbreviated version of the section is shown below.
ta: இந்த முறையின் ஒரு பகுதி பயனரின் விளக்கப்படம் சூழ்ச்சி விருப்பங்களை ஆராய்கிறது. இந்த காசோலைகளில் புதிய விளக்கப்படத்தை சேர்க்க குறியீடு சேர்க்கப்பட வேண்டும். பிரிவின் சுருக்கமான பதிப்பு கீழே காட்டப்பட்டுள்ளது.

source: Two new lines needs to be inserted into the ``if`` and ``else`` sections for the new chart:
ta: புதிய விளக்கப்படத்திற்கான `` if`` மற்றும் `` வேறு`` பிரிவுகளில் இரண்டு புதிய வரிகளைச் செருக வேண்டும்:

source: ``xx_summary_chart_data`` additions
ta: `` xx_summary_chart_data`` சேர்த்தல்

source: The ``return_structure`` variable needs the new user_profile fields adding.
ta: `` திரும்பும் கட்டமைப்பு` `மாறிக்கு புதிய பயனர் சுயவிவர புலங்கள் சேர்க்க வேண்டும்.

source: Before:
ta: முன்:

source: After:
ta: பிறகு:

source: ``xx_plot_calculations`` additions
ta: `` xx_plot_calculations`` சேர்த்தல்

source: Two items needs to be added to this method's parameters.
ta: இந்த முறையின் அளவுருக்களில் இரண்டு உருப்படிகளைச் சேர்க்க வேண்டும்.

source: Our new charts makes use of ``study_events`` (rather than ``acquisition_events`` or ``request_events``). We therefore need to ensure that ``study_events`` are available if the user has chosen to show the new chart.
ta: எங்கள் புதிய விளக்கப்படங்கள் `` stative_events`` ஐ (`` கையகப்படுத்தல்_வென்ட்ச்` அல்லது `` கோரிக்கை_இவென்ட்ச்`` ஐ விட) பயன்படுத்துகின்றன. எனவே புதிய விளக்கப்படத்தைக் காட்ட பயனர் தேர்ந்தெடுத்திருந்தால் `` Stative_events`` கிடைக்கிறது என்பதை நாங்கள் உறுதிப்படுத்த வேண்டும்.

source: After additions:
ta: சேர்த்தலுக்குப் பிறகு:

source: We now need to add code that will calculate the data for the new charts. This uses one of the methods in the ``chart_functions.py`` file, located in the ``interface`` folder of the OpenREM project.
ta: புதிய விளக்கப்படங்களுக்கான தரவைக் கணக்கிடும் குறியீட்டை இப்போது சேர்க்க வேண்டும். இது ஓபன்ரெம் திட்டத்தின் `` இடைமுகம்` கோப்புறையில் அமைந்துள்ள `` சார்ட்_ஃபங்க்ச்.பி`` கோப்பில் உள்ள முறைகளில் ஒன்றைப் பயன்படுத்துகிறது.

source: The data in ``return_structure`` will now be available to the browser via JavaScript, and can be used to populate the charts themselves.
ta: `` Return_structure`` இல் உள்ள தரவு இப்போது சாவாச்கிரிப்ட் வழியாக உலாவிக்கு கிடைக்கும், மேலும் விளக்கப்படங்களை அவர்களே விரிவுபடுத்த பயன்படுத்தலாம்.

source: ``chart_options_view`` additions
ta: `` Chart_options_view`` சேர்த்தல்

source: The RF options form need to be imported
ta: வானலை விருப்பங்கள் படிவத்தை இறக்குமதி செய்ய வேண்டும்

source: The RF form items need to be included
ta: வானலை படிவ உருப்படிகள் சேர்க்கப்பட வேண்டும்

source: Before (abbreviated):
ta: முன் (சுருக்கமாக):

source: After (abbreviated):
ta: பிறகு (சுருக்கமாக):

source: Additions to ``displaychartoptions.html``
ta: `` Displaychartoptions.html`` க்கு சேர்த்தல்

source: A new div needs to be added for the fluoroscopy chart options:
ta: ஃப்ளோரோச்கோபி விளக்கப்பட விருப்பங்களுக்கு ஒரு புதிய டி.ஐ.வி சேர்க்கப்பட வேண்டும்:

source: Additions to ``rffiltered.html``
ta: `` Rffiltered.html`` க்கு சேர்த்தல்

source: A section of this file sets a JavaScript variable per chart. Two new ones needs to be added.
ta: இந்த கோப்பின் ஒரு பகுதி ஒரு விளக்கப்படத்திற்கு சாவாச்கிரிப்ட் மாறியை அமைக்கிறது. இரண்டு புதியவற்றைச் சேர்க்க வேண்டும்.

source: Additions:
ta: சேர்த்தல்:

source: A second section of code needs to be added to ``rffiltered.html`` to include a DIV for the new charts:
ta: புதிய விளக்கப்படங்களுக்கு ஒரு டிவி சேர்க்க குறியீட்டின் இரண்டாவது பகுதியை `` rffiltered.html`` இல் சேர்க்க வேண்டும்:

source: Additions to ``rfChartAjax.js``
ta: `` Rfchartajax.js`` க்கு சேர்த்தல்

source: This file needs to update the skeleton chart with the data that has been provided by ``views.py``. It does this via the appropriate routines contained in the ``chartUpdateData.js`` file. In this case, ``updateWorkloadChart`` and ``updateFrequencyChart``:
ta: இந்த கோப்பு `` views.py`` ஆல் வழங்கப்பட்ட தரவுகளுடன் எலும்புக்கூடு விளக்கப்படத்தை புதுப்பிக்க வேண்டும். `` Patatupdatedata.js`` கோப்பில் உள்ள பொருத்தமான நடைமுறைகள் வழியாக இது செய்கிறது. இந்த வழக்கில், `` புதுப்பிப்பு வேலை ஏற்றம்`` மற்றும் `` புதுப்பிப்பு FrequencyChart``:

source: That's it - you should now have two new charts visible in the fluoroscopy filtered page.
ta: அவ்வளவுதான் - ஃப்ளோரோச்கோபி வடிகட்டப்பட்ட பக்கத்தில் இப்போது இரண்டு புதிய விளக்கப்படங்கள் தெரியும்.

source: BackgroundTask
ta: பின்னணி டாச்க்

source: Contains functions for running tasks in the background.
ta: பின்னணியில் பணிகளை இயக்குவதற்கான செயல்பாடுகளைக் கொண்டுள்ளது.

source: Returns
ta: வருமானம்

source: The associated BackgroundTask object when called in a task. If this is not executed in a background Task None will be returned.
ta: ஒரு பணியில் அழைக்கப்படும் போது தொடர்புடைய பின்னணி டாச்க் பொருள். இது ஒரு பின்னணி பணியில் செயல்படுத்தப்படாவிட்டால் எதுவும் திருப்பித் தரப்படாது.

source: If called from within a task the task id, else a generated uuid
ta: ஒரு பணிக்குள் இருந்து பணி ஐடியை அழைத்தால், இல்லையெனில் உருவாக்கப்பட்ட UUID

source: Returns all task which are currently waiting for execution
ta: தற்போது மரணதண்டனைக்காக காத்திருக்கும் அனைத்து பணிகளையும் வழங்குகிறது

source: Parameters
ta: அளவுருக்கள்

source: Optionally filter by task type
ta: பணி வகை மூலம் விருப்பமாக வடிகட்டவும்

source: List of queued tasks
ta: வரிசைப்படுத்தப்பட்ட பணிகளின் பட்டியல்

source: Small helper that checks if we are in a task and assuming we are records error_msg as well as setting the completed_successfully to false and completed to True. Note that get_current_task will return None after a call to this.
ta: நாங்கள் ஒரு பணியில் இருக்கிறோமா என்பதை சரிபார்க்கும் சிறிய உதவியாளர், நாங்கள் பதிவுசெய்துள்ளோம் என்று கருதுகிறோம் error_msg, அத்துடன் நிறைவு செய்யப்பட்ட_சிகளை பொய்யாக அமைத்து உண்மைக்கு முடிக்கப்பட்டது. Get_current_task இதற்கு அழைப்பிற்குப் பிறகு எதுவும் திரும்பாது என்பதை நினைவில் கொள்க.

source: Small helper that checks if we are in a task and assuming we are records info_msg as info.
ta: நாங்கள் ஒரு பணியில் இருக்கிறோமா என்பதை சரிபார்க்கும் சிறிய உதவியாளர், நாங்கள் தகவல்_எம்எச்சி பதிவுகள் என்று கருதுகிறோம்.

source: Tries to find the related DicomQRRspStudy object given a study instance uid and if this is running in a task will record it to the query object. This is used to later find the import tasks that were run as part of a query. Since this actually just takes the latest query if the user runs imports manually via script it may in principle wrongly associate.
ta: ஒரு ஆய்வு நிகழ்வு UID கொடுக்கப்பட்ட தொடர்புடைய DICOMQRRSPSTUDY பொருளைக் கண்டுபிடிக்க முயற்சிக்கிறது, இது ஒரு பணியில் இயங்கினால் அதை வினவல் பொருளுக்கு பதிவு செய்யும். வினவலின் ஒரு பகுதியாக இயக்கப்பட்ட இறக்குமதி பணிகளை பின்னர் கண்டுபிடிக்க இது பயன்படுத்தப்படுகிறது. பயனர் ச்கிரிப்ட் வழியாக கைமுறையாக இறக்குமதியை இயக்கினால் இது அண்மைக் கால வினவலை எடுக்கும் என்பதால், அது கொள்கையளவில் தவறாக இணைக்கப்படலாம்.

source: Removes task from queue.
ta: வரிசையில் இருந்து பணியை நீக்குகிறது.

source: task id of the task in question
ta: கேள்விக்குரிய பணியின் பணி ஐடி

source: Syntactic sugar around run_in_background_with_limits.
ta: RUN_IN_BACKGROUND_WITH_LIMITS ஐச் சுற்றியுள்ள தொடரியல் சர்க்கரை.

source: Arguments correspond to run_in_background_with_limits. Will always run the passed function as fast as possible. This function should always be used for functions triggered from the webinterface.
ta: வாதங்கள் run_in_background_with_limits உடன் ஒத்திருக்கும். கடந்து சென்ற செயல்பாட்டை எப்போதும் முடிந்தவரை வேகமாக இயக்கும். இந்த செயல்பாடு எப்போதும் வெபின்சேஃபேசிலிருந்து தூண்டப்பட்ட செயல்பாடுகளுக்கு பயன்படுத்தப்பட வேண்டும்.

source: Runs func as background Process.
ta: செயல்பாட்டை பின்னணி செயல்முறையாக இயக்கவும்.

source: This method will create a new task which will be scheduled to be run by the Huey consumer with the specified priority (defaults to 0). The priority can be passed via a keyword argument
ta: இந்த முறை ஒரு புதிய பணியை உருவாக்கும், இது குறிப்பிட்ட முன்னுரிமையுடன் (இயல்புநிலைகள் 0 வரை) ஊய் நுகர்வோர் இயக்க திட்டமிடப்படும். முன்னுரிமையை ஒரு முக்கிய உரையாடல் வழியாக அனுப்ப முடியும்

source: Internally the Huey consumer spawns a new process, which then creates a BackgroundTask object. This can be obtained via get_current_task() inside the calling process. Note that BackgroundTask objects will not be deleted onto completion - instead the complete flag will be set to True.
ta: உள்நாட்டில் ஊய் நுகர்வோர் ஒரு புதிய செயல்முறையை உருவாக்குகிறார், பின்னர் இது ஒரு பின்னணி டாச்க் பொருளை உருவாக்குகிறது. அழைப்பு செயல்முறைக்குள் Get_current_task () வழியாக இதைப் பெறலாம். பின்னணி டாச்க் பொருள்கள் நிறைவு செய்யப்படாது என்பதை நினைவில் கொள்க - அதற்கு பதிலாக முழுமையான கொடி உண்மை என அமைக்கப்படும்.

source: num_proc and num_of_task_type can be used to give conditions on the start.
ta: தொடக்கத்தில் நிபந்தனைகளை வழங்க Num_Proc மற்றும் num_of_task_type ஐப் பயன்படுத்தலாம்.

source: The function to run. Note that you should set the status of the task yourself and mark as completed when exiting yourself e.g. via sys.exit(). Assuming the function returns normally on success or returns with an exception on error, the status of the BackgroundTask object will be set correctly.
ta: இயக்க செயல்பாடு. நீங்களே பணியின் நிலையை நீங்களே அமைக்க வேண்டும் என்பதை நினைவில் கொள்க, உங்களை விட்டு வெளியேறும்போது முடிந்தவரை குறிக்க வேண்டும் எ.கா. Sys.exit () வழியாக. செயல்பாடு பொதுவாக வெற்றியைப் பெறுகிறது அல்லது பிழையின் விதிவிலக்குடன் திரும்பும் என்று கருதினால், பின்னணி டாச்க் பொருளின் நிலை சரியாக அமைக்கப்படும்.

source: One of the strings declared in BackgroundTask.task_type. Indicates which kind of background process this is supposed to be. (E.g. move, query, ...)
ta: பின்னணி டாச்கில் அறிவிக்கப்பட்ட சரங்களில் ஒன்று. இது எந்த வகையான பின்னணி செயல்முறையாக இருக்க வேண்டும் என்பதைக் குறிக்கிறது. (எ.கா. நகர்த்து, வினவல், ...)

source: Will wait with execution until there are less than num_proc active tasks. If num_proc == 0 will run directly
ta: Num_proc செயலில் உள்ள பணிகளை விட குறைவாக இருக்கும் வரை மரணதண்டனையுடன் காத்திருக்கும். Num_proc == 0 நேரடியாக இயங்கும் என்றால்

source: A dictionary from str to int, where key should be some used task_type. Will wait until there are less active tasks of task_type than specified in the value of the dict for that key.
ta: STR இலிருந்து INT வரை ஒரு அகராதி, அங்கு விசை பயன்படுத்தப்பட்ட சில பணிகள்_ வகை இருக்க வேண்டும். அந்த விசைக்கான டிக்டின் மதிப்பில் குறிப்பிடப்பட்டுள்ளதை விட டாச்க்_ டைப்பின் குறைவான செயலில் உள்ள பணிகள் இருக்கும் வரை காத்திருக்கும்.

source: Positional arguments. Passed to func.
ta: நிலை வாதங்கள். FUNC க்கு அனுப்பப்பட்டது.

source: Keywords arguments. Passed to func.
ta: முக்கிய வாதங்கள். செயல்பாட்டுக்கு அனுப்பப்பட்டது.

source: The BackgroundTask object.
ta: பின்னணி டாச்க் பொருள்.

source: Terminate a background task by force. Sets complete=True on the task object.
ta: பின்னணி பணியை பலத்தால் நிறுத்தவும். பணி பொருளில் முழுமையான = உண்மை.

source: Wait until the task has completed
ta: பணி முடியும் வரை காத்திருங்கள்

source: Calculates the required total chart height and the number of facet rows. Each row has a hard-coded height of 500 pixels.
ta: தேவையான மொத்த விளக்கப்பட உயரம் மற்றும் முக வரிசைகளின் எண்ணிக்கையை கணக்கிடுகிறது. ஒவ்வொரு வரிசையிலும் 500 படப்புள்ளிகள் கடின குறியிடப்பட்ட உயரம் உள்ளது.

source: Pandas DataFrame containing the data
ta: தரவைக் கொண்ட பாண்டாச் டேட்டாஃப்ரேம்

source: string containing the DataFrame column name containing the facet names
ta: முகப் பெயர்களைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை பெயரைக் கொண்ட சரம்

source: int representing the number of subplots to have on each row
ta: ஒவ்வொரு வரிசையிலும் இருக்க வேண்டிய சப்ளாட்களின் எண்ணிக்கையைக் குறிக்கும் INT

source: two-element list containing the chart height in pixels (int) and the number of facet rows (int)
ta: பிக்சல்களில் (எண்ணாக) விளக்கப்பட உயரம் மற்றும் முக வரிசைகளின் எண்ணிக்கை (இன்ட்) கொண்ட இரண்டு-உறுப்பு பட்டியல்

source: Calculates histogram bin label text, bin boundaries and bin mid-points
ta: இச்டோகிராம் பின் சிட்டை உரை, பின் எல்லைகள் மற்றும் பின் நடுப்பகுதிகளைக் கணக்கிடுகிறது

source: the Pandas DataFrame containing the data
ta: தரவைக் கொண்ட பாண்டாச் டேட்டாஃப்ரேம்

source: (string )name of the DataFrame column that contains the values
ta: (சரம்) மதிப்புகளைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசையின் பெயர்

source: (int) the number of bins to use
ta: (int) பயன்படுத்த வேண்டிய தொட்டிகளின் எண்ணிக்கை

source: a three element list containing the bin labels, bin boundaries and bin mid-points
ta: பின் லேபிள்கள், பின் எல்லைகள் மற்றும் பின் நடுப்பகுதிகள் கொண்ட மூன்று உறுப்பு பட்டியல்

source: Calculates a sequence of n_colours from the matplotlib colourmap scale_name
ta: Matplotlib colourmap scale_name இலிருந்து N_Colours இன் வரிசையை கணக்கிடுகிறது

source: string containing the name of the matplotlib colour scale to use
ta: பயன்படுத்த மேட்ப்ளோட்லிப் வண்ண அளவின் பெயரைக் கொண்ட சரம்

source: int representing the number of colours required
ta: தேவையான வண்ணங்களின் எண்ணிக்கையைக் குறிக்கும்

source: list of hexadecimal colours from a matplotlib colormap
ta: ஒரு மேட்ப்ளோட்லிப் கோலார்மாப்பிலிருந்து எக்சாடெசிமல் வண்ணங்களின் பட்டியல்

source: Construct a Plotly line chart of average values over time, optionally grouped by performing physician name. For "boxplot" a plotly boxplot of values over time is returned instead of an plotly line chart.
ta: காலப்போக்கில் சராசரி மதிப்புகளின் சூழ்ச்சி வரி விளக்கப்படத்தை உருவாக்குங்கள், மருத்துவர் பெயரைச் செய்வதன் மூலம் விருப்பமாக தொகுக்கப்பட்டுள்ளன. "பாக்ச் பிளாட்" க்கு, காலப்போக்கில் மதிப்புகளின் சூழ்ச்சி பாக்ச் பிளாட் ஒரு சூழ்ச்சி வரி விளக்கப்படத்திற்கு பதிலாக திருப்பித் தரப்படுகிறது.

source: a dictionary of processing parameters
ta: செயலாக்க அளவுருக்களின் அகராதி

source: (string) DataFrame column containing categories
ta: (சரம்) வகைகளைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை

source: (string) name title
ta: (சரம்) பெயர் தலைப்பு

source: (string) DataFrame column containing values
ta: (சரம்) மதிப்புகளைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை

source: (string) y-axis title
ta: (சரம்) y- அச்சு தலைப்பு

source: (string) DataFrame column containing dates
ta: (சரம்) தேதிகளைக் கொண்ட டேட்டாஃப்ரேம் நெடுவரிசை

source: (string) date title
ta: (சரம்) தேதி தலைப்பு

source: (string) subplot title
ta: (சரம்) சப்ளாட் தலைப்பு

source: 2-element list. [0] sets sort direction, [1] used to determine which field to sort
ta: 2-உறுப்பு பட்டியல். [0] வரிசைப்படுத்தல் திசையை அமைக்கிறது, [1] எந்த புலத்தை வரிசைப்படுத்த வேண்டும் என்பதை தீர்மானிக்கப் பயன்படுகிறது

source: list of strings containing requred averages ("mean", "median", "boxplot")
ta: மறுசீரமைப்பு சராசரிகளைக் கொண்ட சரங்களின் பட்டியல் ("சராசரி", "சராசரி", "பாக்ச் பிளாட்")

source: string containing the time period to average over; "A" (years), "Q" (quarters), "M" (months), "W" (weeks), "D" (days)
ta: சராசரியாக கால காலநீடிப்பு கொண்ட சரம்; "ஒரு" (ஆண்டுகள்), "கியூ" (காலாண்டுகள்), "எம்" (மாதங்கள்), "டபிள்யூ" (வாரங்கள்), "டி" (நாட்கள்)

source: (string) "series" or "system"
ta: (சரம்) "தொடர்" அல்லது "அமைப்பு"

source: (string) colourmap to use
ta: (சரம்) பயன்படுத்த வண்ணம்

source: (string) default filename to use for plot bitmap export
ta: (சரம்) சூழ்ச்சி பிட்மேப் ஏற்றுமதிக்கு பயன்படுத்த இயல்புநிலை கோப்பு பெயர்

source: (int) number of subplots per row
ta: (int) ஒரு வரிசையில் சப்ளாட்களின் எண்ணிக்கை

source: (boolean) flag to trigger return as a dictionary rather than a HTML DIV
ta: (பூலியன்) ஒரு உஉகுமொ DIV ஐ விட அகராதியாக வருவாயைத் தூண்டுவதற்கு கொடி

source: boolean flag to set whether to group by physician name
ta: மருத்துவர் பெயரால் குழுவாக இருக்க வேண்டுமா என்று அமைக்க பூலியன் கொடி

source: a dictionary containing a combination of ["mean"], ["median"] and ["boxplot"] entries, each of which contains a Plotly figure embedded in an HTML DIV; or Plotly figure as a dictionary (if params["return_as_dict"] is True); or an error message embedded in an HTML DIV if there was a ValueError when calculating the figure
ta: . அல்லது சூழ்ச்சி ஒரு அகராதியாக (அளவுருக்கள் ["return_as_dict"] உண்மை என்றால்); அல்லது ஒரு உஉகுமொ DIV இல் உட்பொதிக்கப்பட்ட பிழை செய்தி உருவத்தை கணக்கிடும்போது ஒரு மதிப்புரர் இருந்தால்

source: Creates a Pandas DataFrame from the supplied database records. names fields are made categorical to save system memory Any missing (na) values in names fields are set to Blank
ta: வழங்கப்பட்ட தரவுத்தள பதிவுகளிலிருந்து பாண்டாச் டேட்டாஃப்ரேமை உருவாக்குகிறது. கணினி நினைவகத்தை சேமிக்க பெயர்கள் புலங்கள் வகைப்படுத்தப்படுகின்றன

source: the database events
ta: தரவுத்தள நிகழ்வுகள்

source: a dictionary of lists, each containing database field names to include in the DataFrame. The dictionary should include "names", "values", "dates", "times" and optionally "system" items
ta: பட்டியல்களின் அகராதி, ஒவ்வொன்றும் டேட்டாஃப்ரேமில் சேர்க்க தரவுத்தள புல பெயர்களைக் கொண்டுள்ளன. அகராதியில் "பெயர்கள்", "மதிப்புகள்", "தேதிகள்", "டைம்ச்" மற்றும் விருப்பமாக "கணினி" உருப்படிகள் இருக்க வேண்டும்

source: boolean flag to determine whether to make all "names" field values lower case
ta: அனைத்து "பெயர்கள்" புலம் மதிப்புகள் சிறிய வழக்கை உருவாக்கலாமா என்பதை தீர்மானிக்க பூலியன் கொடி

source: boolean flag to determine whether to strip whitespace
ta: இடைவெளியை அகற்றலாமா என்பதை தீர்மானிக்க பூலியன் கொடி

source: list of float valuse to multiply each "values" field value by
ta: ஒவ்வொரு "மதிப்புகள்" புல மதிப்பைப் பெருக்க மிதவை வாலுசின் பட்டியல்

source: string containing database field name which contains a unique identifier for each record
ta: ஒவ்வொரு பதிவுக்கும் ஒரு தனிப்பட்ட அடையாளங்காட்டியைக் கொண்ட தரவுத்தள புல பெயரைக் கொண்ட சரம்

source: a Pandas DataFrame with a column per required field
ta: தேவையான புலத்திற்கு ஒரு நெடுவரிசையுடன் ஒரு பாண்டாச் டேட்டாஃப்ரேம்

source: Creates a Pandas DataFrame with the specified statistics (mean, median, count, for example) grouped by x-ray system name and by the list of provided df_name_cols.
ta: எக்ச்ரே கணினி பெயரால் தொகுக்கப்பட்ட குறிப்பிட்ட புள்ளிவிவரங்களுடன் (சராசரி, சராசரி, எண்ணிக்கை, எடுத்துக்காட்டாக) ஒரு பாண்டாச் டேட்டாஃப்ரேமை உருவாக்குகிறது மற்றும் வழங்கப்பட்ட df_name_cols பட்டியலால்.

source: Pandas DataFrame containing the raw data; it must have an "x_ray_system_name" column
ta: மூல தரவுகளைக் கொண்ட பாண்டாச் டேட்டாஃப்ரேம்; இது "x_ray_system_name" நெடுவரிசையைக் கொண்டிருக்க வேண்டும்

source: list of strings representing the DataFrame column names to group by
ta: டேட்டாஃப்ரேம் நெடுவரிசை பெயர்களைக் குறிக்கும் சரங்களின் பட்டியல் குழுவிற்கு

source: string containing the DataFrame column over which to calculate the statistics
ta: புள்ளிவிவரங்களைக் கணக்கிடுவதற்கு டேட்டாஃப்ரேம் நெடுவரிசையைக் கொண்ட சரம்

source: list of strings containing the statistics to calculate, such as "mean", "median", "count"
ta: "சராசரி", "சராசரி", "எண்ணிக்கை" போன்ற கணக்கிட புள்ளிவிவரங்களைக் கொண்ட சரங்களின் பட்டியல்

source: Pandas DataFrame containing the grouped aggregate data
ta: தொகுக்கப்பட்ட மொத்த தரவைக் கொண்ட பாண்டாச் டேட்டாஃப்ரேம்

source: Creates a Pandas DataFrame time series of average values grouped by x_ray_system_name and df_name_col
ta: X_ray_system_name மற்றும் df_name_col ஆல் தொகுக்கப்பட்ட சராசரி மதிப்புகளின் பாண்டாச் டேட்டாஃப்ரேம் நேரத் தொடரை உருவாக்குகிறது

source: the Pandas DataFrame containing the raw data
ta: மூல தரவுகளைக் கொண்ட பாண்டாச் டேட்டாஃப்ரேம்

source: string containing the DataFrame columnn name used to group the data
ta: தரவைக் குழுவுக்கு பயன்படுத்தப்படும் டேட்டாஃப்ரேம் நெடுவரிசை பெயரைக் கொண்ட சரம்
