Repository: 247i/TACETr
Catalog: உரை/தானி/opentracks-app-store-metadata-files-*.po
Languages: ta

# changelogs/6237.txt:1
source: v4.21.1: OpenTracks Bugfix: - Fixed crash on export/import UI (introduced in v4.21.0)
ta: v4.21.1: OpenTracks பிழைத்திருத்தம்: - ஏற்றுமதி/இறக்குமதி UI இல் ஏற்பட்ட செயலிழப்பு சரி செய்யப்பட்டது (v4.21.0 இல் அறிமுகப்படுத்தப்பட்டது)

# changelogs/6284.txt:1
source: v4.22.0: OpenTracks Changes: - Migration to https://codeberg.org/OpenTracksApp/OpenTracks
ta: v4.22.0: OpenTracks மாற்றங்கள்: - https://codeberg.org/OpenTracksApp/OpenTracks க்கு இடம்பெயர்தல்

# changelogs/6291.txt:1
source: v4.22.1: OpenTracks Changes: - First release via Codeberg
ta: v4.22.1: OpenTracks மாற்றங்கள்: - கோட்பெர்க் வழியாக முதல் வெளியீடு

# changelogs/6294.txt:1
source: v4.22.2: OpenTracks Bugfix: - Voice annoucements setting for time and unit were linked
ta: v4.22.2: OpenTracks பிழைத்திருத்தம்: - நேரம் மற்றும் அலகுக்கான குரல் அறிவிப்பு அமைப்பு இணைக்கப்பட்டது

# changelogs/6338.txt:1
source: v4.23.0: OpenTracks Changes: - UI: added average pace of current segment (currently only available in new layouts) - Clicking on notification opens actual recording UI Developer: - Deprecated JobIntentService replaced with WorkManager - Use .isEmpty() except for CharSequence and Stream.toList()
ta: v4.23.0: OpenTracks மாற்றங்கள்: - UI: தற்போதைய பிரிவின் சராசரி வேகத்தைச் சேர்த்தது (தற்போது புதிய தளவமைப்புகளில் மட்டுமே கிடைக்கிறது) - அறிவிப்பைக் சொடுக்கு செய்வதன் மூலம் உண்மையான பதிவு இடைமுகம் திறக்கும் டெவலப்பர்: - நிராகரிக்கப்பட்ட JobIntentService, WorkManager உடன் மாற்றப்பட்டது - CharSequence மற்றும் Stream.toList() தவிர .isEmpty() ஐப் பயன்படுத்தவும்

# changelogs/6353.txt:1
source: v4.23.1: OpenTracks Changes: - New UI component to show elapsed time in the current segment Bugfix: - Instant post-workout export crashed (introduced in v4.23.0)
ta: v4.23.1: OpenTracks மாற்றங்கள்: - தற்போதைய பிரிவில் கழிந்த நேரத்தைக் காட்ட புதிய இடைமுகம் கூறு பிழைத்திருத்தம்: - உடற்பயிற்சிக்குப் பிந்தைய உடனடி ஏற்றுமதி செயலிழந்தது (v4.23.0 இல் அறிமுகப்படுத்தப்பட்டது)

# changelogs/6407.txt:1
source: v4.23.2: OpenTracks Changes: - Predictive back works completely Bugfix: - Fixed in crash related to the track filename in the settings Developer: - Introduced data class for Statistics
ta: v4.23.2: OpenTracks மாற்றங்கள்: - முன்கணிப்பு முற்றிலும் வேலை செய்கிறது பிழைத்திருத்தம்: - அமைப்புகளில் டிராக் கோப்புப் பெயருடன் தொடர்புடைய செயலிழப்பில் சரி செய்யப்பட்டது டெவலப்பர்: - புள்ளிவிவரங்களுக்கான தரவு வகுப்பு அறிமுகப்படுத்தப்பட்டது

# changelogs/next_release.txt:1
source: (versionName): OpenTracks Changes: - Bugfix: - Developer: -
ta: (பதிப்பு பெயர்): ஓபன்ட்ராக்ச் மாற்றங்கள்: - பிழைத்திருத்த: - டெவலப்பர்: -
