Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: If the e-mail server is set to only allow authenticated users to send messages then a suitable user and password must be entered in the ``EMAIL_HOST_USER`` and ``EMAIL_HOST_PASSWORD`` fields. If this approach is used then it may be useful to request that an e-mail account be created specifically for sending these OpenREM alert messages.
ta: அங்கீகரிக்கப்பட்ட பயனர்களை செய்திகளை அனுப்ப மட்டுமே அனுமதிக்க மின்னஞ்சல் சேவையகம் அமைக்கப்பட்டால், பொருத்தமான பயனர் மற்றும் கடவுச்சொல் `` மின்னஞ்சல்_host_user`` மற்றும் `` மின்னஞ்சல்_host_password`` புலங்களில் உள்ளிட வேண்டும். இந்த அணுகுமுறை பயன்படுத்தப்பட்டால், இந்த ஓபன்ரெம் எச்சரிக்கை செய்திகளை அனுப்புவதற்கு குறிப்பாக ஒரு மின்னஞ்சல் கணக்கை உருவாக்க வேண்டும் என்று கோருவது பயனுள்ளதாக இருக்கும்.

source: It may be possible to configure the e-mail server to allow sending of messages that originate from the OpenREM server without authentication, in which case the user and password settings should not be required.
ta: ஏற்பு இல்லாமல் ஓபன்ரெம் சேவையகத்திலிருந்து உருவாகும் செய்திகளை அனுப்ப அனுமதிக்க மின்னஞ்சல் சேவையகத்தை உள்ளமைக்க முடியும், இந்த விசயத்தில் பயனர் மற்றும் கடவுச்சொல் அமைப்புகள் தேவையில்லை.

source: The ``EMAIL_USE_TLS`` and ``EMAIL_USE_SSL`` options should be configured to match the encryption requirements of the e-mail server. Use ``0`` for False (default) and ``1`` for True. Only one of these options should be set to ``1``.
ta: `` மின்னஞ்சல்_யூச்_.டி.எல்.எச்`` மற்றும் `` மின்னஞ்சல்_யூச்_.எச்.எல்`` விருப்பங்கள் மின்னஞ்சல் சேவையகத்தின் குறியாக்கத் தேவைகளுக்கு பொருந்தும்படி கட்டமைக்கப்பட வேண்டும். தவறான (இயல்புநிலை) மற்றும் உண்மைக்கு `0`` ஐப் பயன்படுத்தவும். இந்த விருப்பங்களில் ஒன்று மட்டுமே `` 1`` என அமைக்கப்பட வேண்டும்.

source: The ``EMAIL_DOSE_ALERT_SENDER`` should contain the e-mail address that you want to use as the sender address.
ta: `` மின்னஞ்சல்_dose_alert_sender`` இன் அனுப்புநர் முகவரியாக நீங்கள் பயன்படுத்த விரும்பும் மின்னஞ்சல் முகவரியைக் கொண்டிருக்க வேண்டும்.

source: The ``EMAIL_OPENREM_URL`` must contain the URL of your OpenREM installation in order for hyperlinks in the e-mail alert messages to function correctly.
ta: மின்னஞ்சல் எச்சரிக்கை செய்திகளில் ஐப்பர்லிங்க்கள் சரியாக செயல்படுவதற்காக `` மின்னஞ்சல்_openrem_url`` உங்கள் ஓபன்ரெம் நிறுவலின் முகவரி ஐக் கொண்டிருக்க வேண்டும்.

source: Regionalisation
ta: பிராந்தியமயமாக்கல்

source: Local time zone for this installation. Choices can be found here: http://en.wikipedia.org/wiki/List_of_tz_zones_by_name although not all choices may be available on all operating systems:
ta: இந்த நிறுவலுக்கான உள்ளக நேர மண்டலம். தேர்வுகளை இங்கே காணலாம்: http://en.wikipedia.org/wiki/list_of_tz_zones_by_name எல்லா இயக்க அமைப்புகளிலும் எல்லா தேர்வுகளும் கிடைக்கவில்லை என்றாலும்:

source: Language code for this installation. All choices can be found here: http://www.i18nguy.com/unicode/language-identifiers.html
ta: இந்த நிறுவலுக்கான மொழி குறியீடு. எல்லா தேர்வுகளையும் இங்கே காணலாம்: http://www.i18nguy.com/unicode/language-idelifiers.html

source: If you set this to False, Django will make some optimizations so as not to load the internationalization machinery:
ta: இதை நீங்கள் பொய்யாக அமைத்தால், பன்னாட்டுமயமாக்கல் இயந்திரங்களை ஏற்றக்கூடாது என்பதற்காக சாங்கோ சில மேம்படுத்தல்களைச் செய்வார்:

source: If you set this to False, Django will not format dates, numbers and calendars according to the current locale:
ta: இதை நீங்கள் பொய்யாக அமைத்தால், தற்போதைய இடத்தின்படி சாங்கோ தேதிகள், எண்கள் மற்றும் காலெண்டர்களை வடிவமைக்காது:

source: If you set this to False (default), Django will not use timezone-aware datetimes:
ta: இதை நீங்கள் தவறான (இயல்புநிலை) என அமைத்தால், சாங்கோ நேர மண்டல-விழிப்புணர்வு தேதி நேரங்களைப் பயன்படுத்தாது:

source: XLSX date and time settings for exports:
ta: எக்ச்எல்எச்எக்ச் ஏற்றுமதிக்கான தேதி மற்றும் நேர அமைப்புகள்:

source: Virtual directory settings
ta: மெய்நிகர் அடைவு அமைப்புகள்

source: See :doc:`virtual_directory` for details of these variables - normally these can be left commented out.
ta: காண்க: DOC: `மெய்நிகர்_டிகோரி` இந்த மாறிகள் விவரங்களுக்கு - பொதுவாக இவை கருத்துத் தெரிவிக்கலாம்.

source: Device Observer UID settings
ta: சாதன பார்வையாளர் UID அமைப்புகள்

source: OpenREM users have found one x-ray system which incorrectly sets the Device Observer UID to be equal to the Study Instance UID. In this situation a new entry is created in the display name settings for every new exam that arrives in OpenREM, making the display name table fill with many duplicate entries for the same system. To avoid this problem a list of models can be specified using the variable below - OpenREM will ignore the Device Observer UID value when creating new display names for any model in this list. The model name text must exactly match what is contained in the system's Manufacturer's Model Name DICOM tag (0008,1090).
ta: ஓபன்ரெம் பயனர்கள் ஒரு எக்ச்ரே அமைப்பைக் கண்டறிந்துள்ளனர், இது சாதன பார்வையாளரை யுஐடியை தவறாக அமைக்கிறது, இது ஆய்வு நிகழ்வுக்கு சமமாக இருக்கும். இந்த சூழ்நிலையில், ஓபன்ரெமில் வரும் ஒவ்வொரு புதிய தேர்வுக்கும் காட்சி பெயர் அமைப்புகளில் ஒரு புதிய நுழைவு உருவாக்கப்படுகிறது, இதனால் காட்சி பெயர் அட்டவணை ஒரே அமைப்பிற்கான பல நகல் உள்ளீடுகளை நிரப்புகிறது. இந்த சிக்கலைத் தவிர்க்க, கீழே உள்ள மாறியைப் பயன்படுத்தி மாதிரிகளின் பட்டியலைக் குறிப்பிடலாம் - இந்த பட்டியலில் உள்ள எந்தவொரு மாதிரிக்கும் புதிய காட்சி பெயர்களை உருவாக்கும்போது OpenRem சாதன பார்வையாளரின் UID மதிப்பை புறக்கணிக்கும். மாதிரி பெயர் உரை கணினியின் உற்பத்தியாளரின் மாதிரி பெயர் DICOM TAG (0008,1090) இல் உள்ளதை சரியாக பொருத்த வேண்டும்.

source: Variables that should only be changed if you know what you are doing
ta: நீங்கள் என்ன செய்கிறீர்கள் என்று உங்களுக்குத் தெரிந்தால் மட்டுமே மாற்றப்பட வேண்டிய மாறிகள்

source: Variables that shouldn't be changed
ta: மாற்றக்கூடாது என்று மாறிகள்

source: Changing this will mean some OpenREM functions will fail
ta: இதை மாற்றுவது சில ஓபன்ரெம் செயல்பாடுகள் தோல்வியடையும் என்று பொருள்

source: Delete objects configuration
ta: பொருள்களின் உள்ளமைவை நீக்கு

source: OpenREM is able to automatically delete DICOM objects if they can't be used by OpenREM or if they have been processed. This has the following advantages:
ta: ஓபன்ரெம் பயன்படுத்த முடியாவிட்டால் அல்லது அவை செயலாக்கப்பட்டிருந்தால் அவற்றை தானாகவே நீக்க முடியும். இது பின்வரும் நன்மைகளைக் கொண்டுள்ளது:

source: The server doesn't need to have much storage space
ta: சேவையகத்திற்கு அதிக சேமிப்பு இடம் தேவையில்லை

source: It can help with information governance if the database is set to not store patient identifiable data (see :doc:`patientid`)
ta: நோயாளியின் அடையாளம் காணக்கூடிய தரவைச் சேமிக்காதபடி தரவுத்தளம் அமைக்கப்பட்டால் செய்தி நிர்வாகத்திற்கு இது உதவக்கூடும் (பார்க்க: டாக்: `நோயாளி ID`)

source: If OpenREM is set to delete objects and you pass a local file to OpenREM using the command line, the source file will be deleted (as long as the filesystem permissions allow).
ta: OpenREM பொருள்களை நீக்க அமைக்கப்பட்டால், நீங்கள் ஒரு உள்ளக கோப்பை கட்டளை வரியைப் பயன்படுத்தி OpenRem க்கு அனுப்பினால், மூல கோப்பு நீக்கப்படும் (கோப்பு முறைமை அனுமதிகள் அனுமதிக்கும் வரை).

source: Configure what is deleted
ta: நீக்கப்பட்டதை உள்ளமைக்கவும்

source: Config menu
ta: கட்டமைப்பு பட்டியல்

source: The ``Config`` menu
ta: `` Config`` பட்டியல்

source: Use the ``Config`` menu and select ``DICOM object deletion``:
ta: `` Config`` மெனுவைப் பயன்படுத்தி `` டிகாம் பொருள் நீக்குதல்`` என்பதைத் தேர்ந்தெடுக்கவும்:

source: This will open the configuration page:
ta: இது உள்ளமைவு பக்கத்தைத் திறக்கும்:

source: Modify DICOM object delete settings
ta: அமைப்புகளை நீக்கு DICOM பொருள் நீக்கவும்

source: Modify DICOM object deletion policy
ta: DICOM பொருள் நீக்குதல் கொள்கையை மாற்றவும்

source: The initial settings are to not delete anything. However, you are likely to want to delete objects that don't match any import filters, and also to delete images such as mammo, DX and Philips CT, as these will take up space much more quickly than the radiation dose structured reports.
ta: ஆரம்ப அமைப்புகள் எதையும் நீக்கக்கூடாது. இருப்பினும், எந்தவொரு இறக்குமதி வடிப்பான்களுக்கும் பொருந்தாத பொருள்களை நீக்கவும், மம்மோ, டிஎக்ச் மற்றும் பிலிப்ச் சி.டி போன்ற படங்களை நீக்கவும் நீங்கள் விரும்பலாம், ஏனெனில் இவை கதிர்வீச்சு டோச் கட்டமைக்கப்பட்ட அறிக்கைகளை விட மிக விரைவாக இடத்தை எடுக்கும்.

source: Reviewing the settings
ta: அமைப்புகளை மதிப்பாய்வு செய்தல்

source: When you have set your preferences, you will be redirected to the DICOM network configuration page, where at the bottom you can review the current settings:
ta: உங்கள் விருப்பங்களை நீங்கள் அமைக்கும் போது, ​​நீங்கள் DICOM பிணையம் உள்ளமைவு பக்கத்திற்கு திருப்பி விடப்படுவீர்கள், அங்கு கீழே தற்போதைய அமைப்புகளை மதிப்பாய்வு செய்யலாம்:

source: DICOM object deletion poligy review on DICOM config page
ta: DICOM பொருள் நீக்குதல் DICOM கட்டமைப்பு பக்கத்தில் பாலிகி மதிப்பாய்வு

source: Deletion policies can be reviewed on the DICOM network configuration page
ta: நீக்குதல் கொள்கைகளை DICOM பிணையம் உள்ளமைவு பக்கத்தில் மதிப்பாய்வு செய்யலாம்

source: More information about the DICOM network configuration can be found on the :ref:`directfrommodalities` page.
ta: DICOM பிணையம் உள்ளமைவு பற்றிய கூடுதல் தகவல்களை: ref: `DirectFrommodalities` பக்கத்தில் காணலாம்.

source: Deleting studies
ta: ஆய்வுகளை நீக்குதல்

source: Individual studies
ta: தனிப்பட்ட ஆய்வுகள்

source: If you log in as a user that is in the ``admingroup``, then an extra column is appended in the filtered view tables to allow studies to be deleted:
ta: `` அட்மிங்ரூப்`` இல் உள்ள ஒரு பயனராக நீங்கள் உள்நுழைந்தால், ஆய்வுகள் நீக்க அனுமதிக்க வடிகட்டப்பட்ட பார்வை அட்டவணையில் கூடுதல் நெடுவரிசை சேர்க்கப்பட்டுள்ளது:

source: Clicking on delete takes you to a confirmation page before the delete takes place.
ta: நீக்கு என்பதைக் சொடுக்கு செய்வது நீக்குதல் நடைபெறுவதற்கு முன்பு உங்களை உறுதிப்படுத்தும் பக்கத்திற்கு அழைத்துச் செல்கிறது.

source: All studies from one source
ta: ஒரு மூலத்திலிருந்து அனைத்து ஆய்வுகள்

source: Admin menu
ta: நிர்வாக பட்டியல்

source: The ``Config`` menu (admin)
ta: `` Config`` பட்டியல் (நிர்வாகி)

source: If you log in as a user that is in the ``admingroup``, on the ``Config`` menu select ``Display names & modality`` to get to a list of all the X-ray systems with data in OpenREM. More information about :doc:`i_displaynames`.
ta: நீங்கள் `` அட்மிங்ரூப்`` இல் உள்ள ஒரு பயனராக உள்நுழைந்தால், `` உள்ளமைவு`` பட்டியலில், ஓபன்ரெமில் தரவைக் கொண்ட அனைத்து எக்ச்ரே அமைப்புகளின் பட்டியலைப் பெற `` பெயர்களைக் காண்பி மற்றும் முறை` காட்சியைக் காண்பி என்பதைத் தேர்ந்தெடுக்கவும் . பற்றிய கூடுதல் தகவல்கள்: DOC: `i_displaynames`.

source: Each row is a unique combination of all the column headers, so if a modality has a software update for example this will usually mean a new row is started.
ta: ஒவ்வொரு வரிசையும் அனைத்து நெடுவரிசை தலைப்புகளின் தனித்துவமான கலவையாகும், எனவே ஒரு முறை ஒரு மென்பொருள் புதுப்பிப்பைக் கொண்டிருந்தால், இது பொதுவாக ஒரு புதிய வரிசை தொடங்கப்படும் என்று பொருள்.

source: In the last column is a link to ``Review`` the studies from that source. This can be useful for troubleshooting a particular source, or you can use it to delete all the studies from one source in one go.
ta: கடைசி நெடுவரிசையில் அந்த மூலத்திலிருந்து வரும் ஆய்வுகள் `` மதிப்பாய்வு`. ஒரு குறிப்பிட்ட மூலத்தை சரிசெய்ய இது பயனுள்ளதாக இருக்கும், அல்லது ஒரே மூலத்திலிருந்து ஒரு மூலத்திலிருந்து அனைத்து ஆய்வுகளையும் நீக்க இதைப் பயன்படுத்தலாம்.

source: Source study review
ta: மூல ஆய்வு ஆய்வு

source: Source equipment review page with study delete options
ta: ஆய்வு நீக்குதல் விருப்பங்களுடன் மூல உபகரணங்கள் மறுஆய்வு பக்கம்

source: The details for that source are displayed, along with a table showing which sort of data is contained in each study. Above the 'Study deletion options' panel the following two numbers are indicated:
ta: ஒவ்வொரு ஆய்விலும் எந்த வகையான தரவு உள்ளது என்பதைக் காட்டும் அட்டவணையுடன் அந்த மூலத்திற்கான விவரங்கள் காட்டப்படும். 'ஆய்வு நீக்குதல் விருப்பங்கள்' பேனலுக்கு மேலே பின்வரும் இரண்டு எண்கள் சுட்டிக்காட்டப்பட்டுள்ளன:

source: The number of studies associated with this equipment
ta: இந்த கருவியுடன் தொடர்புடைய ஆய்வுகளின் எண்ணிக்கை

source: The number of studies associated with this equipment after being filtered by the indicated modality type
ta: சுட்டிக்காட்டப்பட்ட முறை வகையால் வடிகட்டப்பட்ட பின்னர் இந்த கருவியுடன் தொடர்புடைய ஆய்வுகளின் எண்ணிக்கை

source: If the second number is smaller than the first, this will indicate that some of the studies from the equipment have been labelled with a different modality type. There will therefore be an entry in one of the other tables on the equipment display name page.
ta: இரண்டாவது எண் முதல் விட சிறியதாக இருந்தால், உபகரணங்களிலிருந்து சில ஆய்வுகள் வேறுபட்ட முறை வகையுடன் பெயரிடப்பட்டுள்ளன என்பதை இது குறிக்கும். எனவே உபகரணங்கள் காட்சி பெயர் பக்கத்தில் மற்ற அட்டவணைகளில் ஒன்றில் ஒரு நுழைவு இருக்கும்.

source: Delete studies and table entry
ta: ஆய்வுகள் மற்றும் அட்டவணை நுழைவை நீக்கு

source: Use this button if you want to delete all the studies and remove the entry that has been made in the Unique Equipment Names table. Otherwise, the entry would remain but with zero studies associated with it. The deletion takes a second confirmation step.
ta: எல்லா ஆய்வுகளையும் நீக்கி, தனித்துவமான உபகரணங்கள் பெயர்கள் அட்டவணையில் செய்யப்பட்டுள்ள நுழைவை அகற்ற விரும்பினால் இந்த பொத்தானைப் பயன்படுத்தவும். இல்லையெனில், நுழைவு இருக்கும், ஆனால் அதனுடன் தொடர்புடைய சுழிய ஆய்வுகள். நீக்குதல் இரண்டாவது உறுதிப்படுத்தல் படி எடுக்கும்.

source: If there are studies associated with this equipment that are listed with a modality type different to the one shown, those studies will not be deleted and the table entry will not be removed.
ta: இந்த கருவியுடன் தொடர்புடைய ஆய்வுகள் இருந்தால், அவை காட்டப்பட்டுள்ளவற்றுக்கு வேறுபட்ட ஒரு முறை வகையுடன் பட்டியலிடப்பட்டுள்ளன, அந்த ஆய்வுகள் நீக்கப்படாது, அட்டவணை நுழைவு அகற்றப்படாது.

source: Delete studies
ta: ஆய்வுகளை நீக்கு

source: If you have associated this table entry with a ``Display name`` and you want any future studies to fall under the same name, you can leave the entry in the Unique Equipment Names table. You might want to do this for example if you have a Display name of 'CR' or 'Imported'. Again, there is a confirmation step.
ta: இந்த அட்டவணை உள்ளீட்டை `` காட்சி பெயர்`` உடன் தொடர்புபடுத்தியிருந்தால், எதிர்கால ஆய்வுகள் ஒரே பெயரில் வர விரும்பினால், நீங்கள் நுழைவை தனித்துவமான உபகரணங்கள் பெயர்கள் அட்டவணையில் விட்டுவிடலாம். உங்களிடம் 'CR' அல்லது 'இறக்குமதி செய்யப்பட்ட' காட்சி பெயர் இருந்தால் இதைச் செய்ய விரும்பலாம். மீண்டும், உறுதிப்படுத்தல் படி உள்ளது.

source: Again, only the studies associated with this equipment that have the same modality type as shown will be deleted.
ta: மீண்டும், காட்டப்பட்டுள்ள அதே முறை வகையைக் கொண்ட இந்த கருவியுடன் தொடர்புடைய ஆய்வுகள் மட்டுமே நீக்கப்படும்.

source: Failed import studies
ta: தோல்வியுற்ற இறக்குமதி ஆய்வுகள்

source: At the bottom of the ``Display names & modality`` page is a table listing the number of studies that are in the database, but do not have an entry in the ``unique_equipment_name`` table. This usually indicates a study that has failed early in the import process.
ta: `` காட்சி பெயர்கள் மற்றும் முறை` `பக்கத்தின் கீழே தரவுத்தளத்தில் உள்ள ஆய்வுகளின் எண்ணிக்கையை பட்டியலிடும் அட்டவணை உள்ளது, ஆனால்` `` `` `` `` `` `` `` `` `` `` `` `gunal_equipment_name`` அட்டவணையில் இல்லை. இது வழக்கமாக இறக்குமதி செயல்பாட்டின் ஆரம்பத்தில் தோல்வியுற்ற ஒரு ஆய்வைக் குறிக்கிறது.

source: Users in the ``admingroup`` are able to click on the links to review the studies on a per-modality basis. This will list the information that is available, which might indicate which system they came from, what times, dates and accession numbers.
ta: `` அட்மிங்ரூப்`` இல் உள்ள பயனர்கள், ஒவ்வொரு மாடலிக் அடிப்படையில் ஆய்வுகளை மதிப்பாய்வு செய்ய இணைப்புகளைக் சொடுக்கு செய்ய முடியும். இது கிடைக்கக்கூடிய தகவல்களை பட்டியலிடும், இது எந்த அமைப்பிலிருந்து வந்தது, எந்த நேரங்கள், தேதிகள் மற்றும் அணுகல் எண்களைக் குறிக்கும்.

source: The user is then able to delete all the failed import studies in the list.
ta: பயனர் பின்னர் பட்டியலில் தோல்வியுற்ற அனைத்து இறக்குமதி ஆய்வுகளையும் நீக்க முடியும்.

source: Before release 0.8.2, these studies would appear in the homepage listing as *Error has occurred - import probably unsuccessful*. This has now changed to a link to the review page for that modality with the text *Failed import - review here* for users in the ``admingroup`` and *Failed import - ask an administrator to review* for other users.
ta: வெளியீடு 0.8.2 க்கு முன், இந்த ஆய்வுகள் முகப்புப்பக்க பட்டியலில் *பிழை ஏற்பட்டதால் தோன்றும் - இறக்குமதி தோல்வியுற்றது *. இது இப்போது `` அட்மிங்ரூப்`` மற்றும் * தோல்வியுற்ற இறக்குமதியில் உள்ள பயனர்களுக்கு * தோல்வியுற்ற இறக்குமதி - தோல்வியுற்ற இறக்குமதி - இங்கே மதிப்பாய்வு செய்யுங்கள் - பிற பயனர்களுக்காக மதிப்பாய்வு செய்ய *.

source: Display names and user-defined modalities
ta: பெயர்கள் மற்றும் பயனர் வரையறுக்கப்பட்ட முறைகளைக் காண்பி

source: Contents
ta: உள்ளடக்கங்கள்

source: The display name field
ta: காட்சி பெயர் புலம்

source: Previous versions of OpenREM used each X-ray system's DICOM ``station name`` as the identifier for each X-ray system. The front page showed a summary of the number of studies for each unique ``station name`` stored in the system. This led to a problem if multiple X-ray systems used the same station name: the OpenREM home page would only show one station name entry for these systems, with the number of studies corresponding to the total from all the rooms. The name shown alongside the total was that of the system that had most recently sent data to the system.
ta: ஓபன்ரெமின் முந்தைய பதிப்புகள் ஒவ்வொரு எக்ச்ரே அமைப்பின் டிகாம் `` நிலைய பெயர்`` ஒவ்வொரு எக்ச்ரே அமைப்பிற்கும் அடையாளங்காட்டியாகப் பயன்படுத்தின. கணினியில் சேமிக்கப்பட்ட ஒவ்வொரு தனித்துவமான `` நிலைய பெயர்`` க்கும் ஆய்வுகளின் எண்ணிக்கையின் சுருக்கத்தை முதல் பக்கம் காட்டியது. பல எக்ச்ரே அமைப்புகள் ஒரே நிலைய பெயரைப் பயன்படுத்தினால் இது ஒரு சிக்கலுக்கு வழிவகுத்தது: ஓபன்ரெம் முகப்பு பக்கம் இந்த அமைப்புகளுக்கான ஒரு நிலைய பெயர் நுழைவை மட்டுமே காண்பிக்கும், அனைத்து அறைகளிலிருந்தும் மொத்தத்துடன் தொடர்புடைய ஆய்வுகளின் எண்ணிக்கை. மொத்தத்துடன் காட்டப்பட்டுள்ள பெயர், மிக அண்மைக் காலத்தில் கணினிக்கு தரவை அனுப்பிய அமைப்பின் பெயர்.

source: This issue has been resolved by introducing a new field called ``display name``. This is unique to each piece of X-ray equipment, based on the combination of the following eight fields:
ta: `` காட்சி பெயர்`` என்ற புதிய துறையை அறிமுகப்படுத்துவதன் மூலம் இந்த சிக்கல் தீர்க்கப்பட்டுள்ளது. பின்வரும் எட்டு புலங்களின் கலவையின் அடிப்படையில் ஒவ்வொரு எக்ச்ரே சாதனங்களுக்கும் இது தனித்துவமானது:

source: manufacturer
ta: உற்பத்தியாளர்

source: institution name
ta: நிறுவனத்தின் பெயர்

source: station name
ta: நிலைய பெயர்

source: department name
ta: துறை பெயர்

source: model name
ta: மாதிரி பெயர்

source: device serial number
ta: சாதன வரிசை எண்

source: software version
ta: மென்பொருள் பதிப்பு

source: gantry id
ta: கேன்ட்ரி ஐடி

source: The default text for ``display name`` is set to a combination of ``institution name`` and ``station name``. The default display name text can be changed by a user in the ``admingroup`` — see :ref:`changing_display_names`
ta: `` காட்சி பெயர்` க்கான இயல்புநிலை உரை `` நிறுவனத்தின் பெயர்`` மற்றும் `` நிலைய பெயர்`` ஆகியவற்றின் கலவையாக அமைக்கப்பட்டுள்ளது. இயல்புநிலை காட்சி பெயர் உரையை ஒரு பயனரால் `` admingroup`` இல் மாற்றலாம் - காண்க: ref: `vancial_display_names`

source: User defined modality field
ta: பயனர் வரையறுக்கப்பட்ட மாதிரி புலம்

source: OpenREM determines the modality type of a system based on the information in the DICOM radiation dose structured report. However sometimes this mechanism fails because vendors use templates meant for RF also for DX systems. Therefore it is possible from version 0.8.0 to set a modality type for each system manually. A manually set modality type overrides the automatically determined value.
ta: DICOM கதிர்வீச்சு டோச் கட்டமைக்கப்பட்ட அறிக்கையில் உள்ள தகவல்களின் அடிப்படையில் ஒரு அமைப்பின் முறை வகையை ஓபன்ரெம் தீர்மானிக்கிறது. இருப்பினும் சில நேரங்களில் இந்த வழிமுறை தோல்வியடைகிறது, ஏனெனில் விற்பனையாளர்கள் ஆர்.எஃப் -க்கு டிஎக்ச் அமைப்புகளுக்கும் வார்ப்புருக்களைப் பயன்படுத்துகிறார்கள். எனவே ஒவ்வொரு கணினிக்கும் கைமுறையாக ஒரு முறை வகையை அமைக்க பதிப்பு 0.8.0 இலிருந்து சாத்தியமாகும். கைமுறையாக அமைக்கப்பட்ட முறை வகை தானாக நிர்ணயிக்கப்பட்ட மதிப்பை மீறுகிறது.

source: Viewing X-ray system display names and user defined modality
ta: எக்ச்ரே கணினி காட்சி பெயர்கள் மற்றும் பயனர் வரையறுக்கப்பட்ட முறை ஆகியவற்றைப் பார்க்கிறது

source: User options menu
ta: பயனர் விருப்பங்கள் பட்டியல்

source: The ``Config`` menu (user)
ta: `` Config`` பட்டியல் (பயனர்)

source: If you log in as a normal user then the ``Config`` menu becomes available at the right-hand end of the navigation bar at the top of the screen.
ta: நீங்கள் ஒரு சாதாரண பயனராக உள்நுழைந்தால், `` கட்டமைப்பு`` பட்டியல் திரையின் மேற்புறத்தில் உள்ள வழிசெலுத்தல் பட்டியின் வலது கை முடிவில் கிடைக்கும்.

source: The third option, ``View display names & modality``, takes you to a page where you can view the list of X-ray systems with data in OpenREM together with their current display name and user defined modality. If the user defined modality is not set, the value contains ``None``. The X-ray systems are grouped into modalities and displayed in five tables: CT; mammography; DX and CR; fluoroscopy; and other.
ta: மூன்றாவது விருப்பம், `` காட்சி பெயர்கள் மற்றும் முறை ஆகியவற்றைக் காண்க, உங்களை ஒரு பக்கத்திற்கு அழைத்துச் செல்கிறது, அங்கு ஓபன்ரெமில் தரவைக் கொண்ட எக்ச்ரே அமைப்புகளின் பட்டியலை அவற்றின் தற்போதைய காட்சி பெயர் மற்றும் பயனர் வரையறுக்கப்பட்ட முறைமையுடன் பார்க்கலாம். பயனர் வரையறுக்கப்பட்ட முறை அமைக்கப்படவில்லை என்றால், மதிப்பில் `` எதுவுமில்லை`` உள்ளது. எக்ச்ரே அமைப்புகள் முறைகளாக தொகுக்கப்பட்டு ஐந்து அட்டவணைகளில் காட்டப்படுகின்றன: சி.டி; மேமோகிராபி; டி.எக்ச் மற்றும் சி.ஆர்; ஃப்ளோரோச்கோபி; மற்றும் பிற.

source: List of current display names
ta: தற்போதைய காட்சி பெயர்களின் பட்டியல்

source: Example list of display names
ta: காட்சி பெயர்களின் எடுத்துக்காட்டு பட்டியல்

source: Setting display name automatically for known devices
ta: அறியப்பட்ட சாதனங்களுக்கு தானாக காட்சி பெயரை அமைத்தல்

source: If you are a member of the ``admingroup`` you can set an option to automatically set the display name of already known devices even if one of the above mentioned ``fields`` changed. A device can send its Device Observer UID (especially in rdsr-objects). This is a unique ID for the device. If this UID is received by OpenREM it can set the display name and modality type the same as an already known device with the same Device Observer UID. This option can be useful if other parameters that OpenREM looks at frequently change. If you want to see if one of the other parameters changed (like software version), don't tick this option.
ta: நீங்கள் `` அட்மிங்ரூப்`` உறுப்பினராக இருந்தால், மேலே குறிப்பிட்டுள்ள `` புலங்கள்`` மாற்றப்பட்டாலும், ஏற்கனவே அறியப்பட்ட சாதனங்களின் காட்சி பெயரை தானாக அமைக்க ஒரு விருப்பத்தை அமைக்கலாம். ஒரு சாதனம் அதன் சாதன பார்வையாளரை UID (குறிப்பாக RDSR-Objects இல்) அனுப்ப முடியும். இது சாதனத்திற்கான தனித்துவமான ஐடி. இந்த UID OPENREM ஆல் பெறப்பட்டால், அது காட்சி பெயர் மற்றும் முறை வகையை ஏற்கனவே அறியப்பட்ட சாதனத்தைப் போலவே அமைக்கலாம். ஓபன்ரெம் அடிக்கடி மாறினால் பிற அளவுருக்கள் பயனுள்ளதாக இருந்தால் இந்த விருப்பம் பயனுள்ளதாக இருக்கும். மற்ற அளவுருக்களில் ஒன்று மாற்றப்பட்டதா (மென்பொருள் பதிப்பு போன்றவை) நீங்கள் பார்க்க விரும்பினால், இந்த விருப்பத்தை டிக் செய்ய வேண்டாம்.

source: Changing X-ray system display names and user defined modality
ta: எக்ச்ரே கணினி காட்சி பெயர்கள் மற்றும் பயனர் வரையறுக்கப்பட்ட முறை மாற்றுதல்
