Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: :issue:`61` Skin dose maps for fluoroscopy systems can now be calculated and displayed
ta: : வெளியீடு: `61` ஃப்ளோரோச்கோபி அமைப்புகளுக்கான தோல் டோச் வரைபடங்கள் இப்போது கணக்கிடப்பட்டு காட்டப்படலாம்

source: :issue:`347` Django-filter v0.12 has minimum Django version of 1.8, fixed OpenREM 0.6.2 to max django-filter 0.11
ta: :issue:`347` Django-filter v0.12 has சிறுமம் சாங்கோ version of 1.8, fixed OpenREM 0.6.2 பெறுநர் max django-filter 0.11

source: :issue:`341` Changed references to the OpenSkin repository for 0.6 series.
ta: : வெளியீடு: `341` 0.6 தொடருக்கான ஓபன்ச்கின் களஞ்சியத்திற்கான குறிப்புகளை மாற்றியது.

source: :issue:`303` Corrected name of Store SCP command in docs
ta: : வெளியீடு: `303` டாக்சில் கடை எச்.சி.பி கட்டளையின் சரிசெய்யப்பட்ட பெயர்

source: :issue:`227` Fixed import of RDSRs from Toshiba Cath Labs
ta: : வெளியீடு: தோசிபா கேத் லேப்சிலிருந்து RDSRS இன் நிலையான இறக்குமதி `227`

source: :issue:`226` Charts: Updated Highcharts code and partially fixed issues with CTDIvol and DLP combined chart
ta: :issue:`226` Charts: Updated Highcharts குறியீடு and partially fixed issues with CTDIvol and DLP combined chart

source: :issue:`225` Charts: Added link from mAs and kVp histograms to associated data
ta: : வெளியீடு: `225` விளக்கப்படங்கள்: MAS மற்றும் KVP இச்டோகிராம்களிலிருந்து தொடர்புடைய தரவுகளுக்கு இணைப்பு சேர்க்கப்பட்டது

source: :issue:`224` Charts: Added link from CTDIvol histograms to associated data
ta: :issue:`224` Charts: Added இணைப்பு இருந்து CTDIvol histograms பெறுநர் associated தகவல்கள்

source: :issue:`221` Charts: Fixed issue where filters at acquisition event level were not adequately restricting the chart data
ta: : வெளியீடு: `221` விளக்கப்படங்கள்: கையகப்படுத்தல் நிகழ்வு மட்டத்தில் வடிப்பான்கள் விளக்கப்படத் தரவை போதுமான அளவு கட்டுப்படுத்தவில்லை என்பதை நிலையான சிக்கல்

source: :issue:`219` Charts: Fixed issue where some charts showed data beyond the current filter
ta: : வெளியீடு: `219` விளக்கப்படம்: தற்போதைய வடிப்பானுக்கு அப்பால் தரவைக் காட்டும் சில விளக்கப்படங்கள் சிக்கலை சரிசெய்யவும்

source: :issue:`217` Charts: Code optimised to speed up calculation time
ta: : வெளியீடு: `217` விளக்கப்படங்கள்: கணக்கீட்டு நேரத்தை விரைவுபடுத்த குறியீடு உகந்ததாகும்

source: :issue:`216` Fixed typo that prevented import of RSDR when DICOM store settings not present
ta: : வெளியீடு: `216` டிகாம் கடை அமைப்புகள் இல்லாதபோது ஆர்.எச்.டி.ஆர் இறக்குமதி செய்யும் நிலையான எழுத்துப்பிழை

source: :issue:`215` Charts: Fixed x-axis labels for mean dose over time charts
ta: : வெளியீடு: `215` விளக்கப்படங்கள்: நேர விளக்கப்படங்களில் சராசரி டோசிற்கான நிலையான எக்ச்-அச்சு லேபிள்கள்

source: :issue:`214` Charts: Improved consistency of axis labels
ta: : வெளியீடு: `214` விளக்கப்படங்கள்: அச்சு லேபிள்களின் மேம்பட்ட நிலைத்தன்மை

source: :issue:`213` Fixed admin menu not working
ta: : வெளியீடு: `213` நிலையான நிர்வாக பட்டியல் வேலை செய்யவில்லை

source: :issue:`212` Charts: Created off-switch for charts
ta: : வெளியீடு: `212` விளக்கப்படங்கள்: விளக்கப்படங்களுக்கான ஆஃப்-சுவிட்ச் உருவாக்கப்பட்டது

source: :issue:`210` OpenSkin exports documented
ta: : வெளியீடு: `210` ஓபன்ச்கின் ஏற்றுமதி ஆவணப்படுத்தப்பட்டுள்ளது

source: :issue:`209` Charts: Fixed server error when CT plots switched off and filter form submitted
ta: :issue:`209` Charts: Fixed சேவையகம் பிழை when CT plots switched அணை and வடிப்பி form submitted

source: :issue:`208` Charts: Fixed blank chart plotting options when clicking on histogram tooltip link
ta: : வெளியீடு: `208` விளக்கப்படங்கள்: இச்டோகிராம் டூல் டிப் இணைப்பைக் சொடுக்கு செய்யும் போது நிலையான வெற்று விளக்கப்படம் சூழ்ச்சி விருப்பங்கள்

source: :issue:`205` Charts: Fixed issue of histogram tooltip links to data not working
ta: :issue:`205` Charts: Fixed சிக்கல் of செவ்வகப்படம் tooltip links பெறுநர் தகவல்கள் not working

source: :issue:`204` Charts: Fixed issue of not being able to export with the charts features added
ta: : வெளியீடு: `204` விளக்கப்படங்கள்: விளக்கப்படங்கள் அம்சங்களுடன் ஏற்றுமதி செய்ய முடியாத நிலையான சிக்கல் சேர்க்கப்பட்டது சேர்க்கப்பட்டது

source: :issue:`203` Charts: Fixed display of HTML in plots issue
ta: : வெளியீடு: `203` விளக்கப்படங்கள்: அடுக்கு சிக்கலில் உஉகுமொ இன் நிலையான காட்சி

source: :issue:`202` Charts: Added mean CTDIvol to charts
ta: : வெளியீடு: `202` விளக்கப்படங்கள்: விளக்கப்படங்களுக்கு சராசரி CTDIVOL சேர்க்கப்பட்டது

source: :issue:`200` Charts: Now exclude Philips Ingenuity SPRs from plots
ta: : வெளியீடு: `200` விளக்கப்படங்கள்: இப்போது பிலிப்ச் அறிவு கூர்மை எச்.பி.ஆர்களை அடுக்குகளிலிருந்து விலக்குங்கள்

source: :issue:`196` Added comments and entrance exposure data to DX export
ta: : வெளியீடு: `196` டிஎக்ச் ஏற்றுமதியில் கருத்துகள் மற்றும் நுழைவு வெளிப்பாடு தரவுகளைச் சேர்த்தது

source: :issue:`195` Fixed error with no users on fresh install
ta: : வெளியீடு: புதிய நிறுவலில் பயனர்கள் இல்லாத `195` நிலையான பிழை

source: :issue:`194` Added more robust extraction of series description from DX
ta: : வெளியீடு: `194` டி.எக்ச் -ல் இருந்து தொடர் விளக்கத்தின் வலுவான பிரித்தெடுத்தலைச் சேர்த்தது

source: :issue:`193` Charts: Fixed reset of filters when moving between pages
ta: : வெளியீடு: `193` விளக்கப்படங்கள்: பக்கங்களுக்கு இடையில் நகரும் போது வடிப்பான்களின் நிலையான மீட்டமைப்பு

source: :issue:`192` Created RF export for OpenSkin
ta: : வெளியீடு: `192` ஓபன்ச்கினுக்கு வானலை ஏற்றுமதியை உருவாக்கியது

source: :issue:`191` Charts: Factored out the javascript from the filtered.html files
ta: :issue:`191` Charts: Factored out the சாவாகைஉரை இருந்து the filtered.html கோப்புகள்

source: :issue:`190` Charts: Added time period configuration to dose over time plots
ta: :issue:`190` Charts: Added time காலசுழற்சி உள்ளமைவு பெறுநர் dose வீச்சலகு time plots

source: :issue:`189` Charts: Fixed plotting of mean doses over time when frequency not plotted
ta: : வெளியீடு: `189` விளக்கப்படங்கள்: அதிர்வெண் திட்டமிடப்படாதபோது காலப்போக்கில் சராசரி அளவுகளின் நிலையான சூழ்ச்சி

source: :issue:`187` Charts: Merged the charts work into the main develop branch
ta: : வெளியீடு: `187` விளக்கப்படங்கள்: விளக்கப்படங்களை முதன்மையான மேம்பாட்டு கிளையில் இணைக்கவும்

source: :issue:`186` Fixed duplicate data in DX exports
ta: : வெளியீடு: டிஎக்ச் ஏற்றுமதியில் `186` நிலையான நகல் தரவு

source: :issue:`179` Charts: Added kVp and mAs plots for DX
ta: : வெளியீடு: `179` விளக்கப்படங்கள்: டி.எக்ச்

source: :issue:`177` Charts: Fixed issue with date ranges for DX mean dose over time charts
ta: :issue:`177` Charts: Fixed சிக்கல் with திகதி ranges க்கு DX இடை, சராசரி dose வீச்சலகு time விளக்கப்படங்கள்

source: :issue:`176` Charts: Added link to filtered dataset from mean dose over time charts
ta: : வெளியீடு: `176` விளக்கப்படங்கள்: நேர விளக்கப்படங்களில் சராசரி அளவிலிருந்து வடிகட்டப்பட்ட தரவுத்தொகுப்புக்கான இணைப்பு சேர்க்கப்பட்டது

source: :issue:`175` Charts: Allowed configuration of the time period for mean dose trend charts to improve performance
ta: : வெளியீடு: `175` விளக்கப்படங்கள்: செயல்திறனை மேம்படுத்த சராசரி டோச் போக்கு விளக்கப்படங்களுக்கான காலத்தின் கட்டமைப்பு அனுமதிக்கப்பட்டுள்ளது

source: :issue:`174` Charts: Fixed number of decimal places for mean DLP values
ta: : வெளியீடு: `174` விளக்கப்படங்கள்: சராசரி டி.எல்.பி மதிப்புகளுக்கான தசம இடங்களின் நிலையான எண்ணிக்கை

source: :issue:`173` Charts: Fixed plot of mean DLP over time y-axis issue
ta: : வெளியீடு: `173` விளக்கப்படங்கள்: காலப்போக்கில் சராசரி டி.எல்.பியின் நிலையான சூழ்ச்சி y- அச்சு சிக்கல்

source: :issue:`170` Charts: Added plot of mean dose over time
ta: : வெளியீடு: `170` விளக்கப்படங்கள்: காலப்போக்கில் சராசரி டோசின் சூழ்ச்சி சேர்க்கப்பட்டது

source: :issue:`169` Charts: Improved chart colours
ta: : வெளியீடு: `169` விளக்கப்படங்கள்: மேம்பட்ட விளக்கப்பட வண்ணங்கள்

source: :issue:`157` Charts: Added chart showing number of studies per day of the week, then hour in the day
ta: : வெளியீடு: `157` விளக்கப்படங்கள்: வாரத்தின் ஒரு நாளைக்கு ஆய்வுகளின் எண்ணிக்கையைக் காட்டும் விளக்கப்படம், பின்னர் நாளில் மணிநேரம்

source: :issue:`156` Charts: Fixed issue with some protocols not being displayed
ta: : வெளியீடு: `156` விளக்கப்படங்கள்: சில நெறிமுறைகளுடன் நிலையான சிக்கல் காட்டப்படவில்லை

source: :issue:`155` Charts: Added chart showing relative frequency of protocols and study types
ta: : வெளியீடு: `155` விளக்கப்படங்கள்: நெறிமுறைகள் மற்றும் ஆய்வு வகைகளின் ஒப்பீட்டு அதிர்வெண்ணைக் காட்டும் விளக்கப்படம் சேர்க்கப்பட்டது

source: :issue:`140` Charts: Added configuration options
ta: : வெளியீடு: `140` விளக்கப்படங்கள்: சேர்க்கப்பட்ட உள்ளமைவு விருப்பங்கள்

source: :issue:`139` Charts: Link to filtered dataset from histogram chart
ta: : வெளியீடு: `139` விளக்கப்படங்கள்: இச்டோகிராம் விளக்கப்படத்திலிருந்து வடிகட்டப்பட்ட தரவுத்தொகுப்புக்கான இணைப்பு

source: :issue:`138` Charts: Number of datapoints displayed on tooltip
ta: : வெளியீடு: `138` விளக்கப்படங்கள்: உதவிக்குறிப்பில் காட்டப்படும் தரவுத்தொகுப்புகளின் எண்ணிக்கை

source: :issue:`135` Mammography compression force now only divides by 10 if model contains *senograph ds* **Change in behaviour**
ta: :issue:`135` Mammography compression force now only divides by 10 if மாதிரியுரு contains *senograph ds* **Change in behaviour**

source: :issue:`133` Documented installation of NumPy, initially for charts
ta: : வெளியீடு: `133` நம்பி நிறுவுதல், ஆரம்பத்தில் விளக்கப்படங்களுக்கு

source: :issue:`41` Preview of DICOM Store SCP now available
ta: : வெளியீடு: `41` DICOM கடை SCP இன் முன்னோட்டம் இப்போது கிடைக்கிறது

source: :issue:`20` Modality sections are now suppressed until populated
ta: : வெளியீடு: `20` முறைமைப் பிரிவுகள் இப்போது மக்கள் தொகை வரை அடக்கப்படுகின்றன

source: :issue:`184` Documentation for 0.5.1
ta: : வெளியீடு: 0.5.1 க்கான `184` ஆவணங்கள்

source: :issue:`180` Rename all reverse lookups as a result of :issue:`62`
ta: : வெளியீடு: `180` இதன் விளைவாக அனைத்து தலைகீழ் தேடல்களையும் மறுபெயரிடுங்கள்: வெளியீடு:` 62`

source: :issue:`178` Added documentation regarding backing up and restoring PostgreSQL OpenREM databases
ta: :issue:`178` Added ஆவணப்படுத்துதல் regarding backing மேலே and restoring PostgreSQL OpenREM databases

source: :issue:`172` Revert all changes made to database so :issue:`62` could take place first
ta: : வெளியீடு: `172` தரவுத்தளத்தில் செய்யப்பட்ட அனைத்து மாற்றங்களையும் மாற்றவும்: வெளியீடு:` 62` முதலில் நடைபெறலாம்

source: :issue:`165` Extract height and weight from DX, height from RDSR, all if available
ta: :issue:`165` Extract height and weight இருந்து DX, height இருந்து RDSR, அனைத்தும் if available

source: :issue:`161` Views and exports now look for accumulated data in the right table after changes in :issue:`159` and :issue:`160`
ta: :issue:`161` காட்சிகள் and exports now look க்கு accumulated தகவல்கள் in the வலது table after changes in :issue:`159` and :issue:`160`

source: :issue:`160` Created the data migration to move all the DX accumulated data from TID 10004 to TID 10007
ta: : வெளியீடு: `160` அனைத்து டிஎக்ச் திரட்டப்பட்ட தரவுகளையும் TID 10004 இலிருந்து TID 10007 க்கு நகர்த்த தரவு இடம்பெயர்வுகளை உருவாக்கியது

source: :issue:`159` Modified the DX import to populate TID 10007 rather than TID 10004. RDSR RF already populates both
ta: : வெளியீடு: `159` டிஎக்ச் இறக்குமதியை டிஐடி 10004 ஐ விட டிஐடி 10007 ஐ மாற்றியமைத்தது. ஆர்.டி.எச்.ஆர் ஆர்.எஃப் ஏற்கனவே இரண்டையும் கொண்டுள்ளது

source: :issue:`158` Demo website created by DJ Platten: http://demo.openrem.org/openrem
ta: : வெளியீடு: `158` டெமோ வலைத்தளம் டி.சே.

source: :issue:`154` Various decimal fields are defined with too few decimal places - all have now been extended.
ta: : வெளியீடு: `154` பல்வேறு தசம புலங்கள் மிகக் குறைவான தசம இடங்களுடன் வரையறுக்கப்பட்டுள்ளன - அனைத்தும் இப்போது நீட்டிக்கப்பட்டுள்ளன.

source: :issue:`153` Changed home page and modality pages to have whole row clickable and highlighted
ta: : வெளியீடு: `153` முழு வரிசையையும் சொடுக்கு செய்து சிறப்பம்சமாக்க முகப்பு பக்கம் மற்றும் முறை பக்கங்கள்

source: :issue:`150` DJ Platten has added Conquest configuration information
ta: : வெளியீடு: `150` டி.சே பிளாட்டன் செய் உள்ளமைவு தகவல்களைச் சேர்த்தது

source: :issue:`137` Carestream DX multiple filter thickness values in a DS VR now extracted correctly
ta: :issue:`137` Carestream DX multiple வடிப்பி thickness values in a DS VR now extracted correctly

source: :issue:`113` Fixed and improved recording of grid information for mammo and DX and RDSR import routines
ta: : வெளியீடு: `113` மம்மோ மற்றும் டிஎக்ச் மற்றும் ஆர்.டி.எச்.ஆர் இறக்குமதி நடைமுறைகளுக்கான கட்டம் தகவல்களின் நிலையான மற்றும் மேம்பட்ட பதிவு

source: :issue:`62` Refactored all model names to be less than 39 characters and be in CamelCase to allow database migrations and to come into line with PEP 8 naming conventions for classes.
ta: :issue:`62` Refactored அனைத்தும் மாதிரியுரு names பெறுநர் be less than 39 எழுத்துக்கள் and be in CamelCase பெறுநர் allow database migrations and பெறுநர் come into வரி with PEP 8 naming conventions க்கு classes.

source: Pull request from DJ Platten: Improved display of DX data and improved export of DX data
ta: டி.சே. பிளேட்டனிடமிருந்து கோரிக்கையை இழுக்கவும்: டிஎக்ச் தரவின் மேம்பட்ட காட்சி மற்றும் டிஎக்ச் தரவின் மேம்பட்ட ஏற்றுமதி

source: :issue:`132` Fixed mammo export error that slipped in before the first beta
ta: : வெளியீடு: முதல் பீட்டாவுக்கு முன் நழுவிய `132` நிலையான மம்மோ ஏற்றுமதி பிழை

source: :issue:`130` Only creates ExposureInuAs from Exposure if Exposure exists now
ta: : வெளியீடு: `130` வெளிப்பாடு இப்போது இருந்தால் மட்டுமே வெளிப்பாட்டிலிருந்து வெளிப்பாட்டை உருவாக்குகிறது

source: :issue:`128` Updated some non-core documentation that didn't have the new local_settings.py reference or the new openremproject folder name
ta: :issue:`128` Updated some non-core ஆவணப்படுத்துதல் that didn't have the புதிய local_settings.py குறிப்பு or the புதிய openremproject folder பெயர்

source: :issue:`127` DX IOD studies with image view populated failed to export due to lack of conversion to string
ta: : வெளியீடு: `127` டிஎக்ச் ஐஓடி ஆய்வுகள் படக் காட்சியுடன் மக்கள்தொகை

source: :issue:`126` Documentation created for the radiographic functionality
ta: : வெளியீடு: ரேடியோகிராஃபிக் செயல்பாட்டிற்காக உருவாக்கப்பட்ட `126` ஆவணங்கள்

source: :issue:`125` Fixes issue where Hologic tomo projection objects were dropped as they have the same event time as the 2D element
ta: :issue:`125` Fixes சிக்கல் where Hologic tomo projection objects were dropped அச் they have the same event time அச் the 2D தனிமம்

source: :issue:`123` Fixed issue where filters came through on export as lists rather than strings on some installs
ta: : வெளியீடு: `123` நிலையான சிக்கல் சில நிறுவல்களில் சரங்களை விட பட்டியல்களாக ஏற்றுமதியில் வடிப்பான்கள் வந்தன

source: :issue:`122` Exports of RF data should now be more useful when exporting to xlsx. Will need refinement in the future
ta: : வெளியீடு: எக்ச்எல்எச்எக்ச் ஏற்றுமதி செய்யும் போது `122` ஆர்எஃப் தரவின் ஏற்றுமதி இப்போது மிகவும் பயனுள்ளதாக இருக்க வேண்டும். எதிர்காலத்தில் சுத்திகரிப்பு தேவைப்படும்

source: :issue:`26` Extractors created for radiographic DICOM images. Contributed by DJ Platten
ta: : வெளியீடு: ரேடியோகிராஃபிக் டிகாம் படங்களுக்காக உருவாக்கப்பட்ட `26` பிரித்தெடுத்தல். டி.சே. பிளாட்டன் பங்களித்தார்

source: :issue:`25` Views and templates added for radiographic exposures - either from RDSRs or from images - see :issue:`26`. Contributed by DJ Platten
ta: . டி.சே. பிளாட்டன் பங்களித்தார்

source: :issue:`9` Import of \*.dcm should now be available from Windows and Linux alike
ta: : வெளியீடு: `9` \*இன் இறக்குமதி. டி.சி.எம் இப்போது சாளரங்கள் மற்றும் லினக்சிலிருந்து கிடைக்க வேண்டும்

source: :issue:`119` Fixed issue where Celery didn't work on Windows. Django project folder is now called openremproject instead of openrem
ta: : வெளியீடு: சாளரங்களில் செலரி வேலை செய்யாத `119` நிலையான சிக்கல். சாங்கோ திட்ட கோப்புறை இப்போது OpenRem க்கு பதிலாக OpenRemProject என்று அழைக்கப்படுகிறது

source: :issue:`117` Added Windows line endings to patient size import logs
ta: : வெளியீடு: நோயாளியின் அளவு இறக்குமதி பதிவுகளுக்கு `117` சாளரங்கள் வரி முடிவுகளைச் சேர்த்தது

source: :issue:`113` Fixed units spelling error in patient size import logs
ta: : வெளியீடு: நோயாளியின் அளவு இறக்குமதி பதிவுகளில் `113` நிலையான அலகுகள் எழுத்துப்பிழை பிழை

source: :issue:`112` File system errors during imports and exports are now handled properly with tasks listed in error states on the summary pages
ta: : வெளியீடு: இறக்குமதி மற்றும் ஏற்றுமதியின் போது `112` கோப்பு முறைமை பிழைகள் இப்போது சுருக்கமான பக்கங்களில் பிழை நிலைகளில் பட்டியலிடப்பட்டுள்ள பணிகளுடன் சரியாக கையாளப்படுகின்றன

source: :issue:`111` Added abort function to patient size imports and study exports
ta: : வெளியீடு: நோயாளியின் அளவு இறக்குமதி மற்றும் படிப்பு ஏற்றுமதிக்கு `111` சேர்க்கப்பட்டது

source: :issue:`110` Converted exports to use the FileField handling for storage and access, plus modified folder structure.
ta: :issue:`110` Converted exports பெறுநர் use the FileField handling க்கு storage and access, plus மாற்றியமைக்கப்பட்ட folder structure.

source: :issue:`109` Added example ``MEDIA_ROOT`` path for Windows to the install docs
ta: : வெளியீடு: `109` சேர்க்கப்பட்ட உதாரணம்` `மீடியா_ரூட்`` விண்டோசிற்கான பாதை நிறுவல் ஆவணங்களுக்கு

source: :issue:`108` Documented ownership issues between the webserver and Celery
ta: : வெளியீடு: `108` வெப்சர்வர் மற்றும் செலரி இடையே உரிமையாளர் சிக்கல்களை ஆவணப்படுத்தியது

source: :issue:`107` Documented process for upgrading to 0.4.2 before 0.4.3 for versions 0.3.9 or earlier
ta: : வெளியீடு: 0.3.9 அல்லது அதற்கு முந்தைய பதிப்புகளுக்கு 0.4.3 க்கு முன் 0.4.2 ஆக மேம்படுத்துவதற்கான ஆவணப்படுத்தப்பட்ட செயல்முறை

source: :issue:`106` Added the duration of export time to the exports table. Also added template formatting tag to convert seconds to natural time
ta: : வெளியீடு: `106` ஏற்றுமதி நேரத்தின் காலத்தை ஏற்றுமதி அட்டவணையில் சேர்த்தது. விநாடிகளை இயற்கையான நேரமாக மாற்ற வார்ப்புரு வடிவமைத்தல் குறிச்சொல்லையும் சேர்க்கப்பட்டது

source: :issue:`105` Fixed bug in Philips CT import where :py:class:`decimal.Decimal` was not imported before being used in the age calculation
ta: :issue:`105` Fixed பிழை in Philips CT இறக்குமதி where :py:class:`decimal.Decimal` was not imported before being used in the age calculation

source: :issue:`104` Added documentation for the additional study export functions as a result of using Celery tasks in task :issue:`19` as well as documentation for the code
ta: :issue:`104` Added ஆவணப்படுத்துதல் க்கு the additional study ஏற்றுமதி செயல்பாடுகள் அச் a result of using சிவரிக்கீரை பணிகள் in task :issue:`19` அச் well அச் ஆவணப்படுத்துதல் க்கு the குறியீடு

source: :issue:`103` Added documentation for using the web import of patient size information as well as the new code
ta: : வெளியீடு: `103` நோயாளியின் அளவு தகவல்களின் வலை இறக்குமதியைப் பயன்படுத்துவதற்கான ஆவணங்கள் மற்றும் புதிய குறியீடு

source: :issue:`102` Improved handling of attempts to process patient size files that have been deleted for when users go back in the browser after the process is finished
ta: : வெளியீடு: `102` செயல்முறை முடிந்ததும் பயனர்கள் உலாவியில் திரும்பிச் செல்லும்போது நீக்கப்பட்ட நோயாளியின் அளவு கோப்புகளை செயலாக்குவதற்கான முயற்சிகளின் மேம்பட்ட கையாளுதல்

source: :issue:`101` Set the security of the new patient size imports to prevent users below admin level from using it
ta: : வெளியீடு: `101` புதிய நோயாளி அளவு இறக்குமதியின் பாதுகாப்பை நிர்வாக மட்டத்திற்கு கீழே உள்ள பயனர்களைப் பயன்படுத்துவதைத் தடுக்க அமைக்கவும்

source: :issue:`100` Logging information for patient size imports was being written to the database - changed to write to file
ta: : வெளியீடு: நோயாளியின் அளவு இறக்குமதிக்கான `100` உள்நுழைவு செய்தி தரவுத்தளத்திற்கு எழுதப்பட்டது - கோப்புக்கு எழுத மாற்றப்பட்டது

source: :issue:`99` Method for importing remapp from scripts and for setting the `DJANGO_SETTINGS_MODULE` made more robust so that it should work out of the box on Windows, debian derivatives and virtualenvs
ta: :issue:`99` Method க்கு importing remapp இருந்து scripts and க்கு setting the `DJANGO_SETTINGS_MODULE` made more robust so that it should வேலை out of the box on Windows, debian derivatives and virtualenvs

source: :issue:`98` Versions 0.4.0 to 0.4.2 had a settings.py.new file to avoid overwriting settings files on upgrades; renaming this file was missing from the installation documentation for new installs
ta: : வெளியீடு: `98` பதிப்புகள் 0.4.0 முதல் 0.4.2 வரை ஒரு அமைப்புகள். புதிய நிறுவல்களுக்கான நிறுவல் ஆவணங்களிலிருந்து இந்த கோப்பை மறுபெயரிடுவது இல்லை

source: :issue:`97` Changed the name of the export views file from ajaxviews as ajax wasn't used in the end
ta: : வெளியீடு: `97` அசாக்ச்வியூசிலிருந்து ஏற்றுமதி காட்சிகள் கோப்பின் பெயரை மாற்றியது, ஏனெனில் அசாக்ச் இறுதியில் பயன்படுத்தப்படவில்லை

source: :issue:`96` Changed mammo and fluoro filters to use named fields to avoid needing to use the full database path
ta: :issue:`96` Changed mammo and fluoro filters பெறுநர் use named புலங்கள் பெறுநர் avoid needing பெறுநர் use the full database பாதை

source: :issue:`93` Set the security of the new exports to prevent users below export level from creating or downloading exports
ta: : வெளியீடு: `93` ஏற்றுமதி மட்டத்திற்குக் கீழே உள்ள பயனர்கள் ஏற்றுமதியை உருவாக்குவதிலிருந்து அல்லது பதிவிறக்குவதைத் தடுக்க புதிய ஏற்றுமதியின் பாதுகாப்பை அமைக்கவும்

source: :issue:`92` Add `NHSBSP specific mammography csv export` from Jonathan Cole - with Celery
ta: : வெளியீடு: `92` சொனாதன் கோலிடமிருந்து` என்.எச்.எச்.பி.எச்.பி குறிப்பிட்ட மேமோகிராபி சி.எச்.வி ஏற்றுமதி`

source: :issue:`91` Added documentation for Celery and RabbitMQ
ta: : வெளியீடு: `91` செலரி மற்றும் முயலுக்கான ஆவணங்கள் சேர்க்கப்பட்டன

source: :issue:`90` Added delete function for exports
ta: : வெளியீடு: `90` ஏற்றுமதிக்கான நீக்குதல் செயல்பாடு சேர்க்கப்பட்டது

source: :issue:`89` Added the Exports navigation item to all templates, limited to export or admin users
ta: : வெளியீடு: `89` ஏற்றுமதி அல்லது நிர்வாக பயனர்களுக்கு மட்டுப்படுத்தப்பட்ட அனைத்து வார்ப்புருக்களுக்கும் ஏற்றுமதி வழிசெலுத்தல் உருப்படியைச் சேர்த்தது

source: :issue:`88` Converted fluoroscopy objects to using the Celery task manager after starting with CT for :issue:`19`
ta: :issue:`88` Converted fluoroscopy objects பெறுநர் using the சிவரிக்கீரை task manager after starting with CT க்கு :issue:`19`

source: :issue:`87` Converted mammography objects to using the Celery task manager after starting with CT for :issue:`19`
ta: :issue:`87` Converted mammography objects பெறுநர் using the சிவரிக்கீரை task manager after starting with CT க்கு :issue:`19`

source: :issue:`86` Digital Breast Tomosynthesis systems have a projections object that for Hologic contains required dosimetry information
ta: :issue:`86` Digital Breast Tomosynthesis systems have a projections பொருள் that க்கு Hologic contains required dosimetry செய்தி

source: :issue:`85` Fix for bug introduced in :issue:`75` where adaption of ptsize import for procedure import broke ptsize imports
ta: :issue:`85` Fix க்கு பிழை introduced in :issue:`75` where adaption of ptsize இறக்குமதி க்கு procedure இறக்குமதி broke ptsize இறக்குமதிகள்

source: :issue:`74` 'Time since last study' is now correct when daylight saving time kicks in
ta: : வெளியீடு: கடைசி ஆய்விலிருந்து `74` 'நேரம்' பகல் சேமிப்பு நேரம் தொடங்கும் போது இப்போது சரியானது

source: :issue:`39` Debug mode now defaults to False
ta: : வெளியீடு: `39` பிழைத்திருத்த பயன்முறை இப்போது இயல்புநிலையாக உள்ளது

source: :issue:`21` Height and weight data can now be imported through forms in the web interface
ta: : வெளியீடு: `21` உயரம் மற்றும் எடை தரவு இப்போது வலை இடைமுகத்தில் உள்ள படிவங்கள் மூலம் இறக்குமதி செய்யப்படலாம்

source: :issue:`19` Exports are now sent to a task manager instead of locking up the web interface
ta: : வெளியீடு: `19` ஏற்றுமதி இப்போது வலை இடைமுகத்தைப் பூட்டுவதற்கு பதிலாக பணி மேலாளருக்கு அனுப்பப்பட்டுள்ளது

source: Reopened issue
ta: மீண்டும் திறக்கப்பட்டது
