Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: If you are installing on a server with no internet access, go to :doc:`install_offline` to download the packages.
ta: இணைய அணுகல் இல்லாத சேவையகத்தில் நீங்கள் நிறுவினால், அதற்குச் செல்லவும்: DOC: `ஆஃப்லைனை நிறுவவும்` தொகுப்புகளைப் பதிவிறக்க.

source: These instructions assume the following disk layout - there is more information about the reasoning in the box below:
ta: இந்த வழிமுறைகள் பின்வரும் வட்டு தளவமைப்பைக் கருதுகின்றன - கீழே உள்ள பெட்டியில் பகுத்தறிவு பற்றிய கூடுதல் தகவல்கள் உள்ளன:

source: ``C:`` OS disk
ta: `` சி: `` அமெரிக்க வட்டு

source: ``D:`` Database disk
ta: `` டி: `` தரவுத்தள வட்டு

source: ``E:`` Data disk
ta: `` E: `` தரவு வட்டு

source: Creating folders
ta: கோப்புறைகளை உருவாக்குதல்

source: Why D: and E: drives?
ta: ஏன் டி: மற்றும் ஈ: டிரைவ்கள்?

source: OpenREM data are stored on drive E: to keep the data away from the operating system drive so that it is easier for building/recreating the server and knowing what needs to be backed up.
ta: ஓபன்ரெம் தரவு இயக்கி இ இல் சேமிக்கப்படுகிறது: இயக்க முறைமை இயக்கத்திலிருந்து தரவை விலக்கி வைக்க, இதன்மூலம் சேவையகத்தை உருவாக்க/மீண்டும் உருவாக்குவதற்கும், காப்புப்பிரதி எடுக்க வேண்டியதை அறிந்து கொள்வதற்கும் எளிதானது.

source: For the same reason, we will install PostgreSQL so that the database data are store on drive D: - this makes it possible to provide a different configuration of disk for the database drive, with different backup policies.
ta: அதே காரணத்திற்காக, நாங்கள் postgresql ஐ நிறுவுவோம், இதன்மூலம் தரவுத்தள தரவு இயக்கி டி இல் சேமிக்கப்படுகிறது: - இது தரவுத்தள இயக்ககத்திற்கான வேறுபட்ட உள்ளமைவை வெவ்வேறு காப்புப் பிரதி கொள்கைகளுடன் வழங்குவதை சாத்தியமாக்குகிறது.

source: However, it is also possible to store all the data on the C: drive if that works better for your installation. In this case, it would be advisable to create a folder C:\\OpenREM\\ and create all the folders specified below into that folder.
ta: இருப்பினும், உங்கள் நிறுவலுக்கு சிறப்பாக செயல்பட்டால், எல்லா தரவையும் சி: இயக்கி ஆகியவற்றில் சேமிக்க முடியும். இந்த வழக்கில், சி: \\ ஓபன்ரெம் \\ ​​ஒரு கோப்புறையை உருவாக்கி, கீழே குறிப்பிடப்பட்டுள்ள அனைத்து கோப்புறைகளையும் அந்த கோப்புறையில் உருவாக்குவது நல்லது.

source: You can also use different drive letters if that works better for your installation. **In both cases paths will need to be modified in the instructions to suite**.
ta: உங்கள் நிறுவலுக்கு சிறப்பாக செயல்பட்டால் வெவ்வேறு இயக்கி எழுத்துக்களையும் பயன்படுத்தலாம். ** இரண்டு நிகழ்வுகளிலும் பாதைகள் தொகுப்புக்கான வழிமுறைகளில் மாற்றப்பட வேண்டும் **.

source: Windows install folder layout
ta: சாளரங்கள் நிறுவு கோப்புறை தளவமைப்பு

source: Figure 1: Windows install folder layout
ta: படம் 1: சாளரங்கள் நிறுவும் கோப்புறை தளவமைப்பு

source: Create the following folders. The instructions here are for a ``CMD`` window but they can be created in Windows Explorer instead:
ta: பின்வரும் கோப்புறைகளை உருவாக்கவும். இங்குள்ள வழிமுறைகள் `` cmd`` சாளரத்திற்கானவை, ஆனால் அவை சாளரங்கள் எக்ச்ப்ளோரரில் உருவாக்கப்படலாம்:

source: Set permissions
ta: அனுமதிகளை அமைக்கவும்

source: Right click on the ``E:\log`` folder and click ``Properties``
ta: `` E: \ log`` கோப்புறையில் வலது சொடுக்கு செய்து `` பண்புகள்`` என்பதைக் சொடுக்கு செய்க

source: In the ``Security`` tab click ``Edit...`` and ``Add...``
ta: `` பாதுகாப்பு`` தாவலில் `` திருத்து ... `` மற்றும் `` சேர் ... `` என்பதைக் சொடுக்கு செய்க

source: If the server is connected to a domain
ta: சேவையகம் ஒரு களத்துடன் இணைக்கப்பட்டிருந்தால்

source: If the server is connected to a domain, the ``From this location:`` will have the name of the domain. Click ``Locations...`` and choose the name of the server instead of the domain name.
ta: சேவையகம் ஒரு டொமைனுடன் இணைக்கப்பட்டிருந்தால், `` இந்த இடத்திலிருந்து: `` டொமைனின் பெயர் இருக்கும். `` இருப்பிடங்கள் ... `` என்பதைக் சொடுக்கு செய்து, டொமைன் பெயருக்கு பதிலாக சேவையகத்தின் பெயரைத் தேர்வுசெய்க.

source: Set account location
ta: கணக்கு இருப்பிடத்தை அமைக்கவும்

source: Figure 2: Set account location
ta: படம் 2: கணக்கு இருப்பிடத்தை அமைக்கவும்

source: Enter the object name ``IIS_IUSRS`` and click ``OK``
ta: பொருள் பெயரை `` iis_iusrs``` ஐ உள்ளிட்டு `` சரி`` என்பதைக் சொடுக்கு செய்க

source: Tick the ``Modify`` ``Allow`` to enable read and write permissions
ta: அனுமதிகளைப் படிக்கவும் எழுதவும் `` மாற்றவும்` `` அனுமதி`` ஐத் தேர்வுசெய்க

source: Click ``OK`` twice to close the dialogues
ta: உரையாடல்களை மூட இரண்டு முறை `` சரி`` என்பதைக் சொடுக்கு செய்க

source: Repeat for the ``E:\media`` and ``E:\task_queue`` folders
ta: `` E: \ மீடியா`` மற்றும் `` e: \ task_queue`` கோப்புறைகளுக்கு மீண்டும் செய்யவும்

source: Installing packages
ta: தொகுப்புகளை நிறுவுதல்

source: Download the latest version for Windows from https://www.python.org/downloads/ as long as it is in the 3.10 series. OpenREM v1.0 has not been tested with Python 3.11 yet.
ta: 3.10 தொடரில் இருக்கும் வரை https://www.python.org/downloads/ இலிருந்து விண்டோசிற்கான அண்மைக் கால பதிப்பைப் பதிவிறக்கவும். ஓபன்ரெம் வி 1.0 பைதான் 3.11 உடன் இன்னும் சோதிக்கப்படவில்லை.

source: Open the downloaded file to start the installation:
ta: நிறுவலைத் தொடங்க பதிவிறக்கம் செய்யப்பட்ட கோப்பைத் திறக்கவும்:

source: Customize installation
ta: நிறுவலைத் தனிப்பயனாக்குங்கள்

source: Leave all the Optional Features ticked, and click ``Next``
ta: அனைத்து விருப்ப அம்சங்களையும் விட்டுவிட்டு, `` அடுத்து`` என்பதைக் சொடுக்கு செய்க

source: Tick ``Install for all users`` - this will automatically tick ``Precompile standard library``
ta: டிக் `` அனைத்து பயனர்களுக்கும் நிறுவவும்` ` - இது தானாகவே` `முன் தரமான நூலகத்தை முன்கூட்டியே எண்ணும் ``

source: ``Install``
ta: `` நிறுவு`

source: Click to ``Disable path length limit`` - might not be necessary but might be useful!
ta: `` பாதை நீள வரம்பை முடக்கு என்பதைக் சொடுக்கு செய்க `` - தேவையில்லை, ஆனால் பயனுள்ளதாக இருக்கும்!

source: ``Close``
ta: `` மூடு``

source: Download the 64 bit version from https://www.orthanc-server.com/download-windows.php.
ta: 64 பிட் பதிப்பை https://www.orthance-server.com/download-windows.php இலிருந்து பதிவிறக்கவும்.

source: The download file might be blocked because it isn't a commonly downloaded executable. Click the ``...`` menu and select ``Keep``. Then click ``Show more`` and ``Keep anyway``.
ta: பதிவிறக்க கோப்பு தடுக்கப்படலாம், ஏனெனில் இது பொதுவாக பதிவிறக்கம் செய்யக்கூடியது அல்ல. `` ... `` மெனுவைக் சொடுக்கு செய்து `` வைத்திருங்கள்` என்பதைத் தேர்ந்தெடுக்கவும். பின்னர் `` மேலும் `என்பதைக் சொடுக்கு செய்து` `எப்படியும் வைத்திருங்கள்`` என்பதைக் சொடுக்கு செய்க.

source: Click ``Next >``, accept the agreement and ``Next >`` again.
ta: `` அடுத்து> `` என்பதைக் சொடுக்கு செய்க, ஒப்பந்தத்தை ஏற்றுக்கொண்டு `` அடுத்து> `` மீண்டும்.

source: Default install location, ``Next >``
ta: இயல்புநிலை நிறுவு இருப்பிடத்தை நிறுவவும், `` அடுத்து> ``

source: Select Orthanc storage directory - ``Browse...`` to ``E:\orthanc\storage``, ``OK`` and ``Next >``
ta: ஆர்த்தாங்க் சேமிப்பக கோப்பகத்தைத் தேர்ந்தெடுக்கவும் - `` உலாவுக ... `` முதல் `இ: \ ஆர்த்தாங்க் \ சேமிப்பு``,` `சரி`` மற்றும்` `அடுத்து>` `

source: Click ``Next >`` for a Full installation
ta: முழு நிறுவலுக்கு `` அடுத்து> `` என்பதைக் சொடுக்கு செய்க

source: Start Menu Folder ``Next >``
ta: பட்டியல் கோப்புறை `` அடுத்து> `` தொடங்கவும்

source: Ready to Install ``Install``
ta: `` நிறுவு`` நிறுவ தயாராக உள்ளது

source: ``Finish``
ta: `` முடிக்கவும்``

source: Download the latest version of PostgreSQL from https://www.enterprisedb.com/downloads/postgres-postgresql-downloads - choose the Windows x86-64 version. OpenREM v1.0 has been tested with PostgreSQL v14.5.
ta: PostgresQl இன் அண்மைக் கால பதிப்பை https://www.enterprisedb.com/downloads/postgres-postgresql-downloads இலிருந்து பதிவிறக்கவும்-விண்டோச் X86-64 பதிப்பைத் தேர்வுசெய்க. OpenRem V1.0 PostgresQL V14.5 உடன் சோதிக்கப்பட்டது.

source: Some Microsoft redistributables will install
ta: சில நுண்மென் மறுவிநியோகம் நிறுவும்

source: Click ``Next >`` to start
ta: தொடங்க `` அடுத்து> `` என்பதைக் சொடுக்கு செய்க

source: Default Installation Directory ``Next >``
ta: இயல்புநிலை நிறுவல் அடைவு `` அடுத்து> ``

source: All components ``Next >``
ta: அனைத்து கூறுகளும் `` அடுத்து> ``

source: Data Directory - browse to ``D:\database`` then ``Select folder`` and ``Next >``
ta: தரவு அடைவு - `` d: \ தரவுத்தளத்திற்கு` `பின்னர்` `கோப்புறையைத் தேர்ந்தெடுக்கவும்` `` அடுத்து> ``

source: Create a password for the ``postgres`` superuser - you will need this to setup the database with pgAdmin 4 later
ta: `` போச்ட்கிரெச்` `சூப்பர் யூசருக்கான கடவுச்சொல்லை உருவாக்கவும் - PGADMIN 4 உடன் தரவுத்தளத்தை அமைக்க உங்களுக்கு இது தேவைப்படும்

source: Enter it twice and ``Next >``
ta: அதை இரண்டு முறை உள்ளிட்டு `` அடுத்து> ``

source: Default port ``Next >``
ta: இயல்புநிலை துறைமுகம் `` அடுத்து> ``

source: Default Locale ``Next >``
ta: இயல்புநிலை இருப்பிடம் `` அடுத்து> ``

source: Pre Installation Summary ``Next >``
ta: முன் நிறுவல் சுருக்கம் `` அடுத்து> ``

source: Ready to Install ``Next >`` and the installation will begin
ta: `` அடுத்து> `` நிறுவ தயாராக உள்ளது மற்றும் நிறுவல் தொடங்கும்

source: Untick ``Launch Stack Builder at exit``
ta: `` வெளியேறு `` ஐ வெளியேறு `` தொடங்கவும்

source: Download the 64 bit static version of gettext 0.21 from https://mlocati.github.io/articles/gettext-iconv-windows.html. Use the ``.exe`` version (software install icon, not the zip icon)
ta: உரைபெறு 0.21 இன் 64 பிட் நிலையான பதிப்பை https://mlocati.github.io/articles/gettext-iconv-windows.html இலிருந்து பதிவிறக்கவும். `` .Exe`` பதிப்பைப் பயன்படுத்தவும் (மென்பொருள் நிறுவ படவுரு, சிப் படவுரு அல்ல)

source: gettext download page
ta: உரைபெறு பதிவிறக்க பக்கம்

source: Figure 3: gettext download page
ta: படம் 3: உரைபெறு பதிவிறக்க பக்கம்

source: Accept the agreement ``Next >``
ta: ஒப்பந்தத்தை ஏற்றுக்கொள் `` அடுத்து> ``

source: Default installation directory ``Next >``
ta: இயல்புநிலை நிறுவல் அடைவு `` அடுத்து> ``

source: Additional Tasks leave both boxes ticked ``Next >``
ta: கூடுதல் பணிகள் இரண்டு பெட்டிகளையும் `` அடுத்து> `` தேர்வு செய்தன

source: What is gettext for?
ta: உரைபெறு என்றால் என்ன?

source: The gettext binary enables the translations to be available to users of the web interface. It is not essential if you don't want the translations to be available.
ta: உரைபெறு பைனரி மொழிபெயர்ப்புகளை வலை இடைமுகத்தின் பயனர்களுக்கு கிடைக்க உதவுகிறது. மொழிபெயர்ப்புகள் கிடைக்க விரும்பவில்லை என்றால் அது அவசியமில்லை.

source: Download DoseUtility from from the page http://www.dclunie.com/pixelmed/software/webstart/DoseUtilityUsage.html - find ``How to install it (locally)`` near the bottom of the page and click the ``Windows executable that does not require Java to be installed`` link.
ta: பக்கத்திலிருந்து டோசூட்டிலிட்டியைப் பதிவிறக்குங்கள் http://www.dclunie.com/pixelmed/software/webstart/doseutilityusage.html - `` பக்கத்தின் கீழே அதை எவ்வாறு நிறுவுவது (உள்நாட்டில்) `` என்பதைக் சொடுக்கு செய்க சாவா நிறுவப்பட வேண்டியதில்லை `` இணைப்பு.

source: Pixelmed download page
ta: படப்புள்ளி பதிவிறக்க பக்கம்

source: Figure 4: Pixelmed download page
ta: படம் 4: படப்புள்ளி பதிவிறக்க பக்கம்

source: Open the downloaded zip file and open a new file browser at ``E:\pixelmed``
ta: பதிவிறக்கம் செய்யப்பட்ட சிப் கோப்பைத் திறந்து புதிய கோப்பு உலாவியை `` e: \ pixelmed`` இல் திறக்கவும்

source: Drag the contents of the zip file to the ``pixelmed`` folder
ta: சிப் கோப்பின் உள்ளடக்கங்களை `` பிக்சல்மெட்` கோப்புறையில் இழுக்கவும்

source: Download from https://dcmtk.org/dcmtk.php.en - look for the ``DCMTK executable binaries`` section, and download the 64 bit DLL build for Windows.
ta: Https://dcmtk.org/dcmtk.php.en இலிருந்து பதிவிறக்கவும் - `` dcmtk இயங்கக்கூடிய பைனரிகள்`` பிரிவைத் தேடுங்கள், மேலும் விண்டோசிற்கான 64 பிட் டி.எல்.எல்.

source: DCMTK download page
ta: DCMTK பதிவிறக்க பக்கம்

source: Figure 5: DCMTK download page
ta: படம் 5: DCMTK பதிவிறக்க பக்கம்

source: Open the downloaded zip file and open a new file browser at ``E:\dcmtk``
ta: பதிவிறக்கம் செய்யப்பட்ட சிப் கோப்பைத் திறந்து புதிய கோப்பு உலாவியை `` e: \ dcmtk`` இல் திறக்கவும்

source: Drag the contents of the dcmtk-3.x.x-win64-dynamic folder in the zip file to the ``dcmtk`` folder
ta: ZIP கோப்பில் DCMTK-3.X.X.X.-WIN64-டைனமிக் கோப்புறையின் உள்ளடக்கங்களை `` dcmtk`` கோப்புறையில் இழுக்கவும்

source: You should end up with ``E:\dcmtk\bin\`` etc
ta: நீங்கள் `` e: \ dcmtk \ bin \ `` போன்றவற்றுடன் முடிவடையும்

source: Download the 64-bit x64 exe file from https://www.7-zip.org/
ta: Https://www.7-zip.org/ இலிருந்து 64-பிட் x64 exe கோப்பைப் பதிவிறக்கவும்

source: Type, or click on the ``...`` to browse to ``E:\7-zip\``
ta: தட்டச்சு செய்க, அல்லது `` ... `` E: \ 7-zip \ ``

source: Download the 64-bit x64 exe file from https://github.com/winsw/winsw/releases/tag/v2.12.0
ta: Https://github.com/winsw/winsw/relaess/tag/v2.12.0 இலிருந்து 64-பிட் x64 exe கோப்பைப் பதிவிறக்கவும்

source: Open a new file browser at ``E:\winsw``
ta: புதிய கோப்பு உலாவியை `` e: \ winsw`` இல் திறக்கவும்

source: Drag the exe file to the ``winsw`` folder
ta: EXE கோப்பை `` winsw`` கோப்புறையில் இழுக்கவும்

source: Rename the exe file from ``WinSW-x64`` to ``WinSW``
ta: EXE கோப்பை `` winsw-x64`` இலிருந்து `` winsw`` க்கு மறுபெயரிடவும்

source: Download the latest version of Notepad++ from https://notepad-plus-plus.org/downloads/
ta: Https://notepad-plus-plus.org/downloads/ இலிருந்து நோட்பேட் ++ இன் அண்மைக் கால பதிப்பைப் பதிவிறக்கவும்

source: Select a language ``OK``
ta: ஒரு மொழியைத் தேர்ந்தெடுக்கவும் `` சரி``

source: Welcome ``Next >``
ta: வரவேற்கிறோம் `` அடுத்து> ``

source: License Agreement ``I Agree``
ta: உரிம ஒப்பந்தம் `` நான் ஒப்புக்கொள்கிறேன்``

source: Install Location ``Next >``
ta: இருப்பிடத்தை நிறுவவும் `` அடுத்து> ``

source: Choose Components ``Next >``
ta: `` அடுத்து> `` கூறுகளைத் தேர்வுசெய்க

source: ``Finish`` (you can untick the ``Run Notepad++`` option, we don't need it yet)
ta: `` முடிக்கவும்`` (நீங்கள் `` ரன் நோட்பேட் ++ `` விருப்பத்தை இணைக்க முடியும், எங்களுக்கு இது இன்னும் தேவையில்லை)

source: Open the Control Panel
ta: கட்டுப்பாட்டு குழுவைத் திறக்கவும்

source: Search for ``windows features``
ta: `` சாளரங்கள் அம்சங்கள்`` தேடுங்கள்

source: Select ``Turn Windows features on or off``
ta: `` சாளரங்கள் அம்சங்களை ஆன் அல்லது ஆஃப் `என்பதைத் தேர்ந்தெடுக்கவும்

source: Start the wizard ``Next >``
ta: வழிகாட்டி `` அடுத்து> `` தொடங்கவும்

source: Role-based or feature-based installation ``Next >``
ta: பங்கு அடிப்படையிலான அல்லது அம்ச அடிப்படையிலான நிறுவல் `` அடுத்து> ``

source: Leave the current server highlighted ``Next >``
ta: தற்போதைய சேவையகத்தை சிறப்பித்த `` அடுத்து> `` ஆகியவற்றை விடுங்கள்

source: Check the ``Web Server (IIS)`` box
ta: `` வலை சேவையகம் (IIS) `` பெட்டியை சரிபார்க்கவும்

source: In the pop-up dialogue for adding IIS Management Console, click ``Add Features``
ta: ஐஐஎச் மேனேச்மென்ட் கன்சோலைச் சேர்ப்பதற்கான பாப்-அப் உரையாடலில், `` அம்சங்களைச் சேர்`` என்பதைக் சொடுக்கு செய்க

source: ``Next >``
ta: `` அடுத்து> ``

source: Features, ``Next >``
ta: நற்பொருத்தங்கள், `` அடுத்து> ``

source: Web Server Role (IIS) ``Next >``
ta: வலை சேவையக பங்கு (IIS) `` அடுத்து> ``

source: Expand the ``Application Development`` section
ta: `` பயன்பாட்டு மேம்பாடு`` பகுதியை விரிவாக்குங்கள்

source: Check the ``CGI`` box, ``Next >``
ta: `` Cgi`` பெட்டியை, `` அடுத்து> `` சரிபார்க்கவும்

source: You can check the server is running by browsing to http://localhost/ on the server. You should see the default IIS Welcome page. It might not work immediately, check again in a few minutes.
ta: சேவையகத்தில் http: // localhost/க்கு உலாவுவதன் மூலம் சேவையகம் இயங்குவதை நீங்கள் சரிபார்க்கலாம். இயல்புநிலை IIS வரவேற்பு பக்கத்தை நீங்கள் காண வேண்டும். இது உடனடியாக வேலை செய்யாது, சில நிமிடங்களில் மீண்டும் சரிபார்க்கவும்.

source: Installing Python packages
ta: பைதான் தொகுப்புகளை நிறுவுதல்

source: Create and activate the virtualenv
ta: மெய்நிகர் ஈன்வை உருவாக்கி செயல்படுத்தவும்

source: Open a ``CMD`` window:
ta: `` Cmd`` சாளரத்தைத் திறக்கவும்:

source: Install OpenREM
ta: OpenRem ஐ நிறுவவும்

source: Installing on a server with no internet access
ta: இணைய அணுகல் இல்லாத சேவையகத்தில் நிறுவுகிறது

source: Make sure the virtualenv is activated (command line will have the name of the virtualenv as a prefix: ``(venv) E:\``), then navigate to where the ``openremfiles`` directory is that you copied from the computer *with* internet access, eg if it is in your desktop folder:
ta: மெய்நிகர்இன்வி செயல்படுத்தப்பட்டுள்ளதா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் (கட்டளை வரிக்கு மெய்நிகர் ஈவின் பெயரைக் கொண்டிருக்கும் முன்னொட்டு: `` (வென்வ்) இ: \ ``), பின்னர் நீங்கள் கணினியிலிருந்து நகலெடுத்தது `` ஓபன்ரெம்ஃபைல்கள்` `அடைவு இருக்கும் இடத்திற்கு செல்லவும் * இணைய அணுகலுடன், எ.கா. இது உங்கள் டெச்க்டாப் கோப்புறையில் இருந்தால்:

source: Now upgrade ``pip`` and install OpenREM and its dependencies:
ta: இப்போது `` பிப்`` மேம்படுத்தவும், ஓபன்ரெம் மற்றும் அதன் சார்புகளை நிறுவவும்:

source: OpenREM configuration and database creation
ta: ஓபன்ரெம் உள்ளமைவு மற்றும் தரவுத்தள உருவாக்கம்

source: PostgreSQL database creation
ta: Postgresql தரவுத்தள உருவாக்கம்

source: Start pgAdmin 4 - you will need the password you set when installing PostgreSQL
ta: PGADMIN 4 ஐத் தொடங்குங்கள் - Postgresql ஐ நிறுவும் போது நீங்கள் அமைத்த கடவுச்சொல் உங்களுக்குத் தேவைப்படும்

source: Create user
ta: பயனரை உருவாக்கு

source: Click on ``Servers`` to expand, enter the password again
ta: விரிவாக்க `` சேவையகங்கள்`` என்பதைக் சொடுக்கு செய்க, கடவுச்சொல்லை மீண்டும் உள்ளிடவும்

source: Right click ``Login/Group Roles``, ``Create``, ``Login/Group Role...``
ta: வலது சொடுக்கு `` உள்நுழைவு/குழு பாத்திரங்கள்``, `` உருவாக்கு``, `` உள்நுழைவு/குழு பாத்திரம் ... ``

source: Name: ``openremuser``
ta: பெயர்: `` OpenReMuser``

source: Definition, Password: add a password for the openremuser
ta: வரையறை, கடவுச்சொல்: OpenReMuser க்கு கடவுச்சொல்லைச் சேர்க்கவும்

source: Privileges: activate ``Can login?`` and ``Create database?``
ta: சலுகைகள்: `` உள்நுழைய முடியுமா? `` மற்றும் `` தரவுத்தளத்தை உருவாக்க முடியுமா? ``

source: ``Save``
ta: `` சேமிக்கவும்`

source: Create database
ta: தரவுத்தளத்தை உருவாக்கவும்

source: Right click ``Databases``, ``Create``, ``Database...``
ta: வலது சொடுக்கு `` தரவுத்தளங்கள்``, `` உருவாக்கு``, `` தரவுத்தளம் ... ``

source: Database: ``openremdb``
ta: தரவுத்தளம்: `` OpenRemdB``

source: Owner: ``openremuser``
ta: உரிமையாளர்: `` OpenReMuser``

source: Open the ``E:\venv\Lib\site-packages\openrem\openremproject`` folder and rename the example ``local_settings.py`` and ``wsgi.py`` files to remove the ``.windows`` and ``.example`` suffixes. Removing the file name extension will produce a warning to check if you are sure - ``Yes``:
ta: `` E: \ vev \ லிப் \ தள-தொகுப்புகள் \ OpenRem \ OpenRemProject` கோப்புறை `` `wsgi.py`` கோப்புகளை` `` wsgi.py`` கோப்புகளை மறுபெயரிடுங்கள் மற்றும் `. கோப்பு பெயர் நீட்டிப்பை நீக்குவது உங்களுக்கு உறுதியாக இருக்கிறதா என்று சரிபார்க்க ஒரு எச்சரிக்கையை உருவாக்கும் - `` ஆம்``:

source: openremproject folder
ta: திறந்த பிரேக் திட்ட கோப்புறை

source: Figure 6: openremproject folder
ta: படம் 6: OpenRemProject கோப்புறை

source: Edit ``local_settings.py`` as needed (right click ``Edit with Notepad++``) Make sure you change the ``PASSWORD``, the ``SECRET_KEY`` (to anything, just change it), the ``ALLOWED_HOSTS`` list, regionalisation settings and the ``EMAIL`` configuration. You can modify the email settings later if necessary. Some settings are not shown here but are documented in the settings file or elsewhere in the docs. For details on the final variable see :ref:`ignore-device-obs-uid`.
ta: தேவைக்கேற்ப `` local_settings.py`` ஐத் திருத்து (வலது சொடுக்கு `` நோட்பேட் ++ `` உடன் திருத்து) `` கடவுச்சொல்``, `` ரகசிய_கே`` (எதற்கும், அதை மாற்றவும்),, தி `` அனுமதிக்கப்பட்ட_ஓச்ட்ச்` பட்டியல், பிராந்தியமயமாக்கல் அமைப்புகள் மற்றும் `` மின்னஞ்சல்`` உள்ளமைவு. தேவைப்பட்டால் மின்னஞ்சல் அமைப்புகளை பின்னர் மாற்றலாம். சில அமைப்புகள் இங்கே காட்டப்படவில்லை, ஆனால் அவை அமைப்புகள் கோப்பில் அல்லது ஆவணங்களில் வேறு இடங்களில் ஆவணப்படுத்தப்பட்டுள்ளன. இறுதி மாறியின் விவரங்களுக்கு பார்க்க: ref: `புறக்கணிப்பு-DEVICE-OBS-IUID`.

source: If you are upgrading to a new Linux server, review the ``local_settings.py`` file from the old server to copy over the ``ALLOWED_HOSTS`` list and the ``EMAIL`` configuration, and check all the other settings. Change the ``SECRET_KEY`` from the default, but it doesn't have to match the one on the old server. The database ``NAME``, ``USER`` and ``PASSWORD`` will be the ones you created on the new server. For details on the final variable see :ref:`ignore-device-obs-uid`.
ta: நீங்கள் ஒரு புதிய லினக்ச் சேவையகத்திற்கு மேம்படுத்தினால், `` அனுமதிக்கப்பட்ட_ஓச்ட்ச்` பட்டியல் மற்றும் `` மின்னஞ்சல்`` உள்ளமைவு ஆகியவற்றின் மீது நகலெடுக்க பழைய சேவையகத்திலிருந்து `` லோக்கல்_செட்டிங்ச்.பி`` கோப்பை மதிப்பாய்வு செய்து, மற்ற எல்லா அமைப்புகளையும் சரிபார்க்கவும். இயல்புநிலையிலிருந்து `` சீக்ரெட்_கே`` ஐ மாற்றவும், ஆனால் இது பழைய சேவையகத்தில் பொருந்த வேண்டியதில்லை. புதிய சேவையகத்தில் நீங்கள் உருவாக்கிய தரவுத்தளம் `` பெயர்``, `` பயனர்`` மற்றும் `கடவுச்சொல்`` இருக்கும். இறுதி மாறியின் விவரங்களுக்கு பார்க்க: ref: `புறக்கணிப்பு-DEVICE-OBS-IUID`.

source: Populate OpenREM database and collate static files
ta: ஓபன்ரெம் தரவுத்தளத்தை விரிவுபடுத்தி நிலையான கோப்புகளை இணைக்கவும்

source: In a ``CMD`` window, move to the openrem Python folder and activate the virtualenv:
ta: ஒரு `` cmd`` சாளரத்தில், ஓபன்ரெம் பைதான் கோப்புறையில் சென்று மெய்நிகர் ஈன்வை செயல்படுத்தவும்:

source: If you are upgrading to a new Windows server, do these additional steps before continuing with those below:
ta: நீங்கள் ஒரு புதிய சாளரங்கள் சேவையகத்திற்கு மேம்படுத்தினால், கீழே உள்ளவர்களுடன் தொடர்வதற்கு முன் இந்த கூடுதல் படிகளைச் செய்யுங்கள்:

source: Rename ``E:\venv\Lib\site-packages\openrem\remapp\migrations\0001_initial.py.1-0-upgrade`` to ``0001_initial.py``
ta: `` E: \ vev \ லிப் \ தள-தொகுப்புகள் \ OpenRem \ remapp \ இடம்பெயர்வு \ 0001_Initial.py.1-0-bregade`` `` 0001_INITIAL.PY`` என மறுபெயரிடு

source: Import the database - update the path to the database backup file you copied from the old server. These steps can take a long time depending on the size of the database and the resources of the server:
ta: தரவுத்தளத்தை இறக்குமதி செய்யுங்கள் - பழைய சேவையகத்திலிருந்து நீங்கள் நகலெடுத்த தரவுத்தள காப்புப்பிரதி கோப்புக்கான பாதையை புதுப்பிக்கவும். இந்த படிகள் தரவுத்தளத்தின் அளவு மற்றும் சேவையகத்தின் வளங்களைப் பொறுத்து நீண்ட நேரம் ஆகலாம்:

source: Make sure you didn't get a ``RuntimeWarning`` when running the last command - scroll back up to the command and check you *don't* see the following:
ta: கடைசி கட்டளையை இயக்கும் போது உங்களுக்கு `` ரன் டைம் வார்னிங்` கிடைக்கவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் - கட்டளைக்கு மீண்டும் உருட்டவும், நீங்கள் சரிபார்க்கவும் * பின்வருவனவற்றைக் காண வேண்டாம்:

source: If you do, check the database name and password settings in the ``local_settings.py`` file. You will need to delete the file ``E:\venv\Lib\site-packages\openrem\remapp\migrations\0001_initial.py`` before trying again.
ta: நீங்கள் செய்தால், தரவுத்தள பெயர் மற்றும் கடவுச்சொல் அமைப்புகளை `` local_settings.py`` கோப்பில் சரிபார்க்கவும். மீண்டும் முயற்சிக்கும் முன் `` e: \ venv \ லிப் \ தள-தொகுப்புகள் \ OpenRem \ remapp \ இடம்பெயர்வு \ 0001_initial.py`` கோப்பை நீக்க வேண்டும்.

source: Create the translation files, assuming ``gettext`` was installed:
ta: `` GetText`` நிறுவப்பட்டதாகக் கருதி மொழிபெயர்ப்பு கோப்புகளை உருவாக்கவும்:

source: If this is a new install, not an upgrade, create the superuser account:
ta: இது ஒரு புதிய நிறுவலாக இருந்தால், மேம்படுத்தல் அல்ல, சூப்பர் யூசர் கணக்கை உருவாக்கவும்:

source: Configure IIS
ta: IIS ஐ உள்ளமைக்கவும்

source: Open ``Internet Information Services (IIS) Manager`` from the Start menu or the Administrative Tools.
ta: தொடக்க பட்டியல் அல்லது நிர்வாக கருவிகளிலிருந்து `` இணைய செய்தி சேவைகள் (IIS) மேலாளர்`` திறக்கவும்.

source: Click on the name of your server in the ``Connections`` pane on the left
ta: இடதுபுறத்தில் உள்ள `` இணைப்புகள்`` பலகத்தில் உங்கள் சேவையகத்தின் பெயரைக் சொடுக்கு செய்க
