Repository: 247i/TACETr
Catalog: உரை/தானி/openorienteering-mapper-*.po
Languages: ta

# OpenOrienteering::MapEditorController
source: 1x zoom
ta: 1x சூம்

# OpenOrienteering::MapEditorController
source: 2x zoom
ta: 2x சூம்

# OpenOrienteering::MapEditorController
source: Error
ta: பிழை

# OpenOrienteering::MapEditorController
source: Cannot export the map as "%1" because saving as %2 (.%3) is not supported.
ta: வரைபடத்தை ஏற்றுமதி செய்ய முடியாது "%1" ஏனெனில் %2 (. %3) என சேமிப்பது ஆதரிக்கப்படவில்லை.

# OpenOrienteering::MapEditorController
source: Cannot save file %1: %2
ta: கோப்பைச் சேமிக்க முடியாது %1: %2

# OpenOrienteering::MapEditorController
source: Warning
ta: எச்சரிக்கை

# OpenOrienteering::MapEditorController
source: The map export generated warnings.
ta: வரைபட ஏற்றுமதி எச்சரிக்கைகளை உருவாக்கியது.

# OpenOrienteering::MapEditorController
source: The map import generated warnings.
ta: வரைபட இறக்குமதி எச்சரிக்கைகளை உருவாக்கியது.

# OpenOrienteering::MapEditorController
source: X
ta: ஃச்

# OpenOrienteering::MapEditorController
source: Keep my location on screen
ta: எனது இருப்பிடத்தை திரையில் வைத்திருங்கள்

# OpenOrienteering::MapEditorController
source: Clip area
ta: கிளிப் பகுதி

# OpenOrienteering::MapEditorController
source: Erase area
ta: பகுதி அழிக்கவும்

# OpenOrienteering::MapEditorController
source: Toolbars
ta: கருவிப்பட்டிகள்

# OpenOrienteering::MapEditorController
source: Export
ta: ஏற்றுமதி

# OpenOrienteering::MapEditorController
source: Print / Export is not available in this program version!
ta: இந்த நிரல் பதிப்பில் அச்சு / ஏற்றுமதி கிடைக்கவில்லை!

# OpenOrienteering::MapEditorController
source: No undo steps available.
ta: செயல்தவிர் படிகள் எதுவும் கிடைக்கவில்லை.

# OpenOrienteering::MapEditorController
source: An internal error occurred, sorry!
ta: ஒரு உள் பிழை ஏற்பட்டது, மன்னிக்கவும்!

# OpenOrienteering::MapEditorController
source: There are no objects in clipboard which could be pasted!
ta: கிளிப்போர்டில் ஒட்டக்கூடிய பொருள்கள் எதுவும் இல்லை!

# OpenOrienteering::MapEditorController
source: Set custom zoom factor
ta: தனிப்பயன் சூம் காரணி அமைக்கவும்

# OpenOrienteering::MapEditorController
source: Zoom factor:
ta: சூம் காரணி:

# OpenOrienteering::MapEditorController
source: Symbols
ta: குறியிடுகள்

# OpenOrienteering::MapEditorController
source: Colors
ta: நிறங்கள்

# OpenOrienteering::MapEditorController
source: Symbol set ID
ta: அடையாளம் தொகுப்பு ஐடி

# OpenOrienteering::MapEditorController
source: Edit the symbol set ID:
ta: குறியீட்டு தொகுப்பு ஐடியைத் திருத்தவும்:

# OpenOrienteering::MapEditorController
source: Scale all symbols
ta: அனைத்து சின்னங்களையும் அளவிடவும்

# OpenOrienteering::MapEditorController
source: Scale to percentage:
ta: சதவீதத்திற்கு அளவு:

# OpenOrienteering::MapEditorController
source: Map notes
ta: வரைபட குறிப்புகள்

# OpenOrienteering::MapEditorController
source: Cancel
ta: ரத்துசெய்

# OpenOrienteering::MapEditorController
source: OK
ta: சரி

# OpenOrienteering::MapEditorController
source: Templates
ta: வார்ப்புருக்கள்

# OpenOrienteering::MapEditorController
source: Tag Editor
ta: குறிச்சொல் ஆசிரியர்

# OpenOrienteering::MapEditorController
source: No symbol selected
ta: இல்லை அடையாளம் தேர்ந்தெடுக்கப்பட்டது

# OpenOrienteering::MapEditorController
source: Multiple symbols selected
ta: நான்கு சின்னங்கள் தேர்ந்தெடுக்கப்பட்டது

# OpenOrienteering::MapEditorController
source: Place point objects on the map.
ta: வரைபடத்தில் புள்ளி பொருள்களை வைக்கவும்.

# OpenOrienteering::MapEditorController
source: Select a point symbol to be able to use this tool.
ta: இந்த கருவியைப் பயன்படுத்த ஒரு புள்ளி சின்னத்தைத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Draw polygonal and curved lines.
ta: பலகோண மற்றும் வளைந்த கோடுகளை வரையவும்.

# OpenOrienteering::MapEditorController
source: Select a line, area or combined symbol to be able to use this tool.
ta: இந்த கருவியைப் பயன்படுத்த ஒரு வரி, பகுதி அல்லது ஒருங்கிணைந்த சின்னத்தைத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Draw circles and ellipses.
ta: வட்டங்கள் மற்றும் நீள்வட்டங்களை வரையவும்.

# OpenOrienteering::MapEditorController
source: Draw paths free-handedly.
ta: பாதைகளை இலவசமாக வரையவும்.

# OpenOrienteering::MapEditorController
source: Fill bounded areas.
ta: எல்லைக்குட்பட்ட பகுதிகளை நிரப்பவும்.

# OpenOrienteering::MapEditorController
source: Set the direction of area fill patterns or point objects.
ta: பகுதி நிரப்பு வடிவங்கள் அல்லது புள்ளி பொருள்களின் திசையை அமைக்கவும்.

# OpenOrienteering::MapEditorController
source: Select an area object with rotatable fill pattern or a rotatable point object to activate this tool.
ta: இந்த கருவியை செயல்படுத்த சுழற்றக்கூடிய நிரப்பு முறை அல்லது சுழற்றக்கூடிய புள்ளி பொருளைக் கொண்ட ஒரு பகுதி பொருளைத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Resulting symbol: %1 %2.
ta: இதன் விளைவாக சின்னம்: %1 %2.

# OpenOrienteering::MapEditorController
source: Select at least two area or path objects activate this tool.
ta: குறைந்தது இரண்டு பகுதி அல்லது பாதை பொருள்கள் இந்த கருவியை செயல்படுத்தவும் என்பதைத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Unify overlapping objects.
ta: ஒன்றுடன் ஒன்று பொருள்களை ஒன்றிணைக்கவும்.

# OpenOrienteering::MapEditorController
source: Remove all parts which are not overlaps with the first selected object.
ta: முதல் தேர்ந்தெடுக்கப்பட்ட பொருளுடன் ஒன்றுடன் ஒன்று இல்லாத அனைத்து பகுதிகளையும் அகற்றவும்.

# OpenOrienteering::MapEditorController
source: Remove overlapped parts of the first selected object.
ta: முதலில் தேர்ந்தெடுக்கப்பட்ட பொருளின் ஒன்றுடன் ஒன்று பகுதிகளை அகற்று.

# OpenOrienteering::MapEditorController
source: Remove all parts which overlap the first selected object.
ta: முதல் தேர்ந்தெடுக்கப்பட்ட பொருளை ஒன்றுடன் ஒன்று சேர்க்கும் அனைத்து பகுதிகளையும் அகற்றவும்.

# OpenOrienteering::MapEditorController
source: Merge area holes together, or merge holes with the object boundary to cut out this part.
ta: பகுதி துளைகளை ஒன்றாக இணைக்கவும், அல்லது இந்த பகுதியை வெட்ட பொருள் எல்லையுடன் துளைகளை ஒன்றிணைக்கவும்.

# OpenOrienteering::MapEditorController
source: Select one area object with holes to activate this tool.
ta: இந்த கருவியை செயல்படுத்த துளைகளுடன் ஒரு பகுதி பொருளைத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Create a cutout of some objects or the whole map.
ta: சில பொருள்களின் கட்அவுட்டை அல்லது முழு வரைபடத்தையும் உருவாக்கவும்.

# OpenOrienteering::MapEditorController
source: Select a closed path object as cutout shape to activate this tool.
ta: இந்த கருவியை செயல்படுத்த ஒரு மூடிய பாதை பொருளை கட்அவுட் வடிவமாகத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Cut away some objects or everything in a limited area.
ta: சில பொருள்கள் அல்லது எல்லாவற்றையும் ஒரு வரையறுக்கப்பட்ட பகுதியில் வெட்டுங்கள்.

# OpenOrienteering::MapEditorController
source: Places evenly spaced point objects along an existing path object
ta: ஏற்கனவே உள்ள பாதை பொருளுடன் சமமாக இடைவெளி கொண்ட புள்ளி பொருள்களை இடங்கள்

# OpenOrienteering::MapEditorController
source: Select at least one path object and a single point symbol to activate this tool.
ta: இந்த கருவியை செயல்படுத்த குறைந்தது ஒரு பாதை பொருள் மற்றும் ஒற்றை புள்ளி சின்னத்தைத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Merging holes failed.
ta: துளைகளை ஒன்றிணைப்பது தோல்வியடைந்தது.

# OpenOrienteering::MapEditorController
source: Clear temporary markers
ta: தற்காலிக குறிப்பான்களை அழிக்கவும்

# OpenOrienteering::MapEditorController
source: Are you sure you want to delete all temporary GPS markers? This cannot be undone.
ta: எல்லா தற்காலிக சி.பி.எச் குறிப்பான்களையும் நீக்க விரும்புகிறீர்களா? இதை செயல்தவிர்க்க முடியாது.

# OpenOrienteering::MapEditorController
source: Merge this part with
ta: இந்த பகுதியை ஒன்றிணைக்கவும்

# OpenOrienteering::MapEditorController
source: Move selected objects to
ta: தேர்ந்தெடுக்கப்பட்ட பொருள்களை நகர்த்தவும்

# OpenOrienteering::MapEditorController
source: Enter the name of the map part:
ta: வரைபட பகுதியின் பெயரை உள்ளிடவும்:

# OpenOrienteering::MapEditorController
source: Switched to map part '%1'.
ta: '%1' என்ற வரைபடத்திற்கு மாறியது.

# OpenOrienteering::MapEditorController
source: Merge map parts
ta: வரைபட பாகங்களை ஒன்றிணைக்கவும்

# OpenOrienteering::MapEditorController
source: Do you want to move all objects from map part "%1" to "%2", and to remove "%1"?
ta: வரைபடப் பகுதியிலிருந்து "%1" இலிருந்து "%2" க்கு எல்லா பொருட்களையும் நகர்த்த விரும்புகிறீர்களா?

# OpenOrienteering::MapEditorController
source: Do you want to move all objects to map part "%1", and to remove all other map parts?
ta: பகுதி "%1" ஐ வரைபடமாக்கவும், மற்ற எல்லா வரைபட பகுதிகளையும் அகற்றவும் எல்லா பொருட்களையும் நகர்த்த விரும்புகிறீர்களா?

# OpenOrienteering::MapEditorController
source: Nothing to import.
ta: இறக்குமதி செய்ய எதுவும் இல்லை.

# OpenOrienteering::MapEditorController
source: Question
ta: கேள்வி

# OpenOrienteering::MapEditorController
source: The scale of the imported data is 1:%1 which is different from this map's scale of 1:%2. Rescale the imported data?
ta: இறக்குமதி செய்யப்பட்ட தரவின் அளவு 1:%1 ஆகும், இது இந்த வரைபடத்தின் அளவின் 1:%2 இலிருந்து வேறுபட்டது. இறக்குமதி செய்யப்பட்ட தரவை மீட்டெடுக்கவா?

# OpenOrienteering::MapEditorController
source: Draw rectangles.
ta: செவ்வகங்களை வரையவும்.

# OpenOrienteering::MapEditorController
source: Print...
ta: அச்சிடுக ...

# OpenOrienteering::MapEditorController
source: &Image
ta: & படம்

# OpenOrienteering::MapEditorController
source: &PDF
ta: பி.டி.எஃப்

# OpenOrienteering::MapEditorController
source: Clear undo / redo history
ta: செயல்தவிர் / மீண்டும் வரலாற்றை அழிக்கவும்

# OpenOrienteering::MapEditorController
source: Clear the undo / redo history to reduce map file size.
ta: வரைபட கோப்பு அளவைக் குறைக்க செயல்தவிர் / மீண்டும் வரலாற்றை அழிக்கவும்.

# OpenOrienteering::MapEditorController
source: Pan
ta: பான்

# OpenOrienteering::MapEditorController
source: Overprinting simulation
ta: அதிகப்படியான அச்சிடுதல் உருவகப்படுத்துதல்

# OpenOrienteering::MapEditorController
source: Edit lines
ta: வரிகளைத் திருத்து

# OpenOrienteering::MapEditorController
source: Convert to curves
ta: வளைவுகளுக்கு மாற்றவும்

# OpenOrienteering::MapEditorController
source: Simplify path
ta: பாதையை எளிதாக்குங்கள்

# OpenOrienteering::MapEditorController
source: &Export as...
ta: & ஏற்றுமதி ...

# OpenOrienteering::MapEditorController
source: Write text on the map.
ta: வரைபடத்தில் உரையை எழுதுங்கள்.

# OpenOrienteering::MapEditorController
source: Select a text symbol to be able to use this tool.
ta: இந்த கருவியைப் பயன்படுத்த ஒரு உரை சின்னத்தைத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Select at least one object to activate this tool.
ta: இந்த கருவியை செயல்படுத்த குறைந்தது ஒரு பொருளையாவது தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Switch the direction of symbols on line objects.
ta: வரி பொருள்களில் சின்னங்களின் திசையை மாற்றவும்.

# OpenOrienteering::MapEditorController
source: Select at least one line object to activate this tool.
ta: இந்த கருவியை செயல்படுத்த குறைந்தது ஒரு வரி பொருளையாவது தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Connect endpoints of paths which are close together.
ta: ஒன்றாக நெருக்கமான பாதைகளின் இறுதிப் புள்ளிகளை இணைக்கவும்.

# OpenOrienteering::MapEditorController
source: Select at least one line or area object to activate this tool.
ta: இந்த கருவியை செயல்படுத்த குறைந்தது ஒரு வரி அல்லது பகுதி பொருளையாவது தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Cut a hole into the selected area object.
ta: தேர்ந்தெடுக்கப்பட்ட பகுதி பொருளில் ஒரு துளை வெட்டுங்கள்.

# OpenOrienteering::MapEditorController
source: Select a single area object to activate this tool.
ta: இந்த கருவியை செயல்படுத்த ஒற்றை பகுதி பொருளைத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Turn paths made of straight segments into smooth bezier splines.
ta: நேரான பகுதிகளால் செய்யப்பட்ட பாதைகளை மென்மையான பெசியர் ச்ப்லைன்களாக மாற்றவும்.

# OpenOrienteering::MapEditorController
source: Select a path object to activate this tool.
ta: இந்த கருவியை செயல்படுத்த ஒரு பாதை பொருளைத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Reduce the number of points in path objects while trying to retain their shape.
ta: அவற்றின் வடிவத்தைத் தக்கவைக்க முயற்சிக்கும்போது பாதை பொருள்களின் புள்ளிகளின் எண்ணிக்கையைக் குறைக்கவும்.

# OpenOrienteering::MapEditorController
source: Select at least one object and a fitting, different symbol to activate this tool.
ta: இந்த கருவியை செயல்படுத்த குறைந்தது ஒரு பொருளையும் பொருத்தமான, வெவ்வேறு சின்னத்தையும் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Object selection
ta: பொருள் தேர்வு

# OpenOrienteering::MapEditorController
source: Measure
ta: அளவீடு

# OpenOrienteering::MapEditorController
source: Unification failed.
ta: ஒருங்கிணைப்பு தோல்வியடைந்தது.

# OpenOrienteering::MapEditorController
source: Intersection failed.
ta: குறுக்குவெட்டு தோல்வியடைந்தது.

# OpenOrienteering::MapEditorController
source: Difference failed.
ta: வேறுபாடு தோல்வியடைந்தது.

# OpenOrienteering::MapEditorController
source: XOr failed.
ta: Xor தோல்வியுற்றது.

# OpenOrienteering::MapEditorController
source: Do you want to remove map part "%1" and all its objects?
ta: வரைபட பகுதி "%1" மற்றும் அதன் அனைத்து பொருட்களையும் அகற்ற விரும்புகிறீர்களா?

# OpenOrienteering::MapEditorController
source: Importable files
ta: இறக்குமதி செய்யக்கூடிய கோப்புகள்

# OpenOrienteering::MapEditorController
source: All files
ta: அனைத்து கோப்புகள்

# OpenOrienteering::MapEditorController
source: Cannot import the selected file because its file format is not supported.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பை இறக்குமதி செய்ய முடியாது, ஏனெனில் அதன் கோப்பு வடிவம் ஆதரிக்கப்படவில்லை.

# OpenOrienteering::MapEditorController
source: Rotate objects
ta: பொருள்களை சுழற்றுங்கள்

# OpenOrienteering::MapEditorController
source: Scale objects
ta: அளவிலான பொருள்கள்

# OpenOrienteering::MapEditorController
source: Cut %n object
ta: வெட்டு %n பொருள்

# OpenOrienteering::MapEditorController
source: Copied %n object
ta: %N பொருள் நகலெடுக்கப்பட்டது

# OpenOrienteering::MapEditorController
source: Pasted %n object
ta: ஒட்டப்பட்ட %n பொருள்

# OpenOrienteering::MapEditorController
source: Deletes the selected objects.
ta: தேர்ந்தெடுக்கப்பட்ட பொருட்களை நீக்குகிறது.

# OpenOrienteering::MapEditorController
source: Duplicate the selected objects.
ta: தேர்ந்தெடுக்கப்பட்ட பொருட்களை நகலெடுக்கவும்.

# OpenOrienteering::MapEditorController
source: Rotate the selected objects.
ta: தேர்ந்தெடுக்கப்பட்ட பொருட்களை சுழற்றுங்கள்.

# OpenOrienteering::MapEditorController
source: Scale the selected objects.
ta: தேர்ந்தெடுக்கப்பட்ட பொருள்களை அளவிடவும்.

# OpenOrienteering::MapEditorController
source: Cut the selected objects into smaller parts.
ta: தேர்ந்தெடுக்கப்பட்ட பொருட்களை சிறிய பகுதிகளாக வெட்டுங்கள்.

# OpenOrienteering::MapEditorController
source: Switches the symbol of the selected objects to the selected symbol.
ta: தேர்ந்தெடுக்கப்பட்ட பொருள்களின் சின்னத்தை தேர்ந்தெடுக்கப்பட்ட சின்னத்திற்கு மாற்றுகிறது.

# OpenOrienteering::MapEditorController
source: Fill the selected lines or create a border for the selected areas.
ta: தேர்ந்தெடுக்கப்பட்ட வரிகளை நிரப்பவும் அல்லது தேர்ந்தெடுக்கப்பட்ட பகுதிகளுக்கு ஒரு எல்லையை உருவாக்கவும்.

# OpenOrienteering::MapEditorController
source: Duplicated %n object
ta: நகல் %n பொருள்

# OpenOrienteering::MapEditorController
source: No objects were selected because there are no objects with the selected symbols.
ta: தேர்ந்தெடுக்கப்பட்ட சின்னங்களுடன் பொருள்கள் இல்லாததால் எந்தவொரு பொருளும் தேர்ந்தெடுக்கப்படவில்லை.

# OpenOrienteering::MapEditorController
source: Background drawing
ta: பின்னணி வரைதல்

# OpenOrienteering::MapEditorTool
source: <b>%1</b>: Abort.
ta: <b>%1 </b>: கைவிடவும்.

# OpenOrienteering::MapEditorTool
source: More: %1, %2
ta: மேலும்: %1, %2

# OpenOrienteering::MapEditorTool
source: More: %1
ta: மேலும்: %1

# OpenOrienteering::MapEditorTool
source: More: %1, %2, %3
ta: மேலும்: %1, %2, %3

# OpenOrienteering::MapFindFeature
source: &Find...
ta: தேடு... (&f)

# OpenOrienteering::MapFindFeature
source: Find &next
ta: அடுத்ததை தேடு (&n)

# OpenOrienteering::MapFindFeature
source: Find objects
ta: பொருள்களைக் கண்டறியவும்

# OpenOrienteering::MapFindFeature
source: &Find next
ta: அடுத்து கண்டுபிடிக்கவும்

# OpenOrienteering::MapFindFeature
source: Find &all
ta: கண்டுபிடி & அனைத்தையும்

# OpenOrienteering::MapFindFeature
source: Query editor
ta: வினவல் ஆசிரியர்

# OpenOrienteering::MapPrinter
source: - Map -
ta: - வரைபடம் -

# OpenOrienteering::MapPrinter
source: Processing separations of page %1...
ta: பக்கம் %1 இன் பிரிப்புகளை செயலாக்குவது ...

# OpenOrienteering::MapPrinter
source: Processing page %1...
ta: செயலாக்க பக்கம் %1 ...

# OpenOrienteering::MapPrinter
source: Canceled
ta: ரத்து செய்யப்பட்டது

# OpenOrienteering::MapPrinter
source: Error
ta: பிழை

# OpenOrienteering::MapPrinter
source: Finished
ta: முடிந்தது

# OpenOrienteering::MapSymbolTranslation
source: Text source:
ta: உரை ஆதாரம்:

# OpenOrienteering::MapSymbolTranslation
source: Map (%1)
ta: வரைபடம் (%1)

# OpenOrienteering::MapSymbolTranslation
source: undefined language
ta: வரையறுக்கப்படாத மொழி

# OpenOrienteering::MapSymbolTranslation
source: Translation (%1)
ta: மொழிபெயர்ப்பு (%1)

# OpenOrienteering::MapSymbolTranslation
source: Before editing, the stored text will be replaced with the current translation. Do you want to continue?
ta: திருத்துவதற்கு முன், சேமிக்கப்பட்ட உரை தற்போதைய மொழிபெயர்ப்புடன் மாற்றப்படும். நீங்கள் தொடர விரும்புகிறீர்களா?

# OpenOrienteering::MapSymbolTranslation
source: After modifying the stored text, the translation may no longer be found. Do you want to continue?
ta: சேமிக்கப்பட்ட உரையை மாற்றியமைத்த பிறகு, மொழிபெயர்ப்பு இனி கண்டுபிடிக்க முடியாது. நீங்கள் தொடர விரும்புகிறீர்களா?

# OpenOrienteering::MapWidget millimeters
source: mm
ta: மிமீ

# OpenOrienteering::MapWidget meters
source: m
ta: மீ

# OpenOrienteering::MapWidget
source: Error
ta: பிழை

# OpenOrienteering::MapWidget
source: Empty map! Start by defining some colors: Select Symbols -> Color window to open the color dialog and define the colors there.
ta: வெற்று வரைபடம்! சில வண்ணங்களை வரையறுப்பதன் மூலம் தொடங்கவும்: சின்னங்கள் -> வண்ண சாளரம் என்பதைத் தேர்ந்தெடுக்கவும் வண்ண உரையாடலைத் திறக்கவும் அங்குள்ள வண்ணங்களை வரையறுக்கவும்.

# OpenOrienteering::MapWidget
source: No symbols! Now define some symbols: Right-click in the symbol bar and select "New symbol" to create one.
ta: சின்னங்கள் இல்லை! இப்போது சில சின்னங்களை வரையறுக்கவும்: குறியீட்டு பட்டியில் வலது சொடுக்கு செய்யவும் "புதிய அடையாளம்" என்பதைத் தேர்ந்தெடுக்கவும் ஒன்றை உருவாக்க.

# OpenOrienteering::MapWidget
source: Ready to draw! Start drawing or load a base map. To load a base map, click Templates -> Open template...
ta: வரைய தயாராக! ஒரு அடிப்படை வரைபடத்தை வரையத் தொடங்கவும் அல்லது ஏற்றவும். அடிப்படை வரைபடத்தை ஏற்ற, சொடுக்கு செய்க வார்ப்புருக்கள் -> திறந்த வார்ப்புரு ...

# OpenOrienteering::MapWidget
source: Hint: Hold the middle mouse button to drag the map, zoom using the mouse wheel, if available.
ta: குறிப்பு: வரைபடத்தை இழுக்க நடுத்தர சுட்டி பொத்தானைப் பிடித்துக் கொள்ளுங்கள், கிடைத்தால், சுட்டி சக்கரத்தைப் பயன்படுத்தி பெரிதாக்கவும்.

# OpenOrienteering::MeasureWidget
source: Boundary length:
ta: எல்லை நீளம்:

# OpenOrienteering::MeasureWidget
source: Length:
ta: நீளம்:

# OpenOrienteering::MeasureWidget
source: Area:
ta: பகுதி:

# OpenOrienteering::MeasureWidget
source: No object selected.
ta: எந்த பொருளும் தேர்ந்தெடுக்கப்படவில்லை.

# OpenOrienteering::MeasureWidget
source: %1 objects selected.
ta: %1 பொருள்கள் தேர்ந்தெடுக்கப்பட்டன.

# OpenOrienteering::MeasureWidget
source: The selected object is not a path.
ta: தேர்ந்தெடுக்கப்பட்ட பொருள் ஒரு பாதை அல்ல.

# OpenOrienteering::MeasureWidget millimeters
source: mm
ta: மிமீ

# OpenOrienteering::MeasureWidget meters
source: m
ta: மீ

# OpenOrienteering::MeasureWidget
source: This object is too small.
ta: இந்த பொருள் மிகவும் சிறியது.

# OpenOrienteering::MeasureWidget
source: The minimimum area is %1 %2.
ta: குறைந்தபட்ச பகுதி %1 %2 ஆகும்.

# OpenOrienteering::MeasureWidget
source: Note: Boundary length and area are correct only if there are no self-intersections and holes are used as such.
ta: குறிப்பு: தன்வய குறுக்கீடுகள் இல்லாவிட்டால் மட்டுமே எல்லை நீளம் மற்றும் பரப்பளவு சரியானது மற்றும் துளைகள் பயன்படுத்தப்படுகின்றன.

# OpenOrienteering::MeasureWidget
source: This line is too short.
ta: இந்த வரி மிகக் குறைவு.

# OpenOrienteering::MeasureWidget
source: The minimum length is %1 %2.
ta: குறைந்தபட்ச நீளம் %1 %2 ஆகும்.

# OpenOrienteering::MeasureWidget
source: mm
ta: மிமீ

# OpenOrienteering::NewMapDialog
source: Create new map
ta: புதிய வரைபடத்தை உருவாக்கவும்

# OpenOrienteering::NewMapDialog
source: Choose the scale and symbol set for the new map.
ta: புதிய வரைபடத்திற்கான அளவு மற்றும் அடையாளம் தொகுப்பைத் தேர்வுசெய்க.

# OpenOrienteering::NewMapDialog
source: Scale: 1 :
ta: அளவு: 1:

# OpenOrienteering::NewMapDialog
source: Symbol sets:
ta: அடையாளம் தொகுப்புகள்:

# OpenOrienteering::NewMapDialog
source: Only show symbol sets matching the selected scale
ta: தேர்ந்தெடுக்கப்பட்ட அளவோடு பொருந்தக்கூடிய குறியீட்டு தொகுப்புகளை மட்டுமே காட்டு

# OpenOrienteering::NewMapDialog
source: Create
ta: உருவாக்கு

# OpenOrienteering::NewMapDialog
source: Empty symbol set
ta: வெற்று அடையாளம் தொகுப்பு

# OpenOrienteering::NewMapDialog
source: Load symbol set from a file...
ta: ஒரு கோப்பிலிருந்து அமைக்கப்பட்ட சின்னத்தை ஏற்றவும் ...

# OpenOrienteering::NewMapDialog
source: All symbol set files
ta: அனைத்து குறியீட்டு கோப்புகளையும் அமைக்கவும்

# OpenOrienteering::NewMapDialog
source: All files
ta: அனைத்து கோப்புகள்

# OpenOrienteering::ObjectQuery
source: is
ta: என்பது

# OpenOrienteering::ObjectQuery
source: is not
ta: இல்லை

# OpenOrienteering::ObjectQuery
source: contains
ta: கொண்டுள்ளது

# OpenOrienteering::ObjectQuery
source: Search
ta: தேடல்

# OpenOrienteering::ObjectQuery
source: Text
ta: உரை

# OpenOrienteering::ObjectQuery
source: and
ta: மற்றும்

# OpenOrienteering::ObjectQuery
source: or
ta: அல்லது

# OpenOrienteering::ObjectQuery
source: not
ta: இல்லை

# OpenOrienteering::ObjectQuery
source: Symbol
ta: அடையாளம்

# OpenOrienteering::ObjectQuery
source: invalid
ta: செல்லுபடியாகாத

# OpenOrienteering::OcdFileExport
source: Encoding '%1' is not available. Check the settings.
ta: '%1' குறியாக்கம் கிடைக்கவில்லை. அமைப்புகளை சரிபார்க்கவும்.

# OpenOrienteering::OcdFileExport
source: OCD files of version %1 are not supported!
ta: பதிப்பு %1 இன் ஒ.சி.டி கோப்புகள் ஆதரிக்கப்படவில்லை!

# OpenOrienteering::OcdFileExport
source: Coordinates are adjusted to fit into the OCAD 8 drawing area (-2 m ... 2 m).
ta: OCAD 8 வரைதல் பகுதிக்கு (-2 மீ ... 2 மீ) பொருந்தும் வகையில் ஆயத்தொகுப்புகள் சரிசெய்யப்படுகின்றன.

# OpenOrienteering::OcdFileExport
source: Some coordinates remain outside of the OCAD 8 drawing area. They might be unreachable in OCAD.
ta: சில ஒருங்கிணைப்புகள் OCAD 8 வரைதல் பகுதிக்கு வெளியே உள்ளன. அவர்கள் OCAD இல் அணுக முடியாதவர்களாக இருக்கலாம்.

# OpenOrienteering::OcdFileExport
source: The georeferencing cannot be saved in OCD version 8.
ta: ஒ.சி.டி பதிப்பு 8 இல் புவிசார்மயமாக்கலை சேமிக்க முடியாது.

# OpenOrienteering::OcdFileExport
source: The map contains more than 24 spot colors which is not supported by OCD version 8.
ta: வரைபடத்தில் 24 க்கும் மேற்பட்ட ச்பாட் வண்ணங்கள் உள்ளன, இது ஒ.சி.டி பதிப்பு 8 ஆல் ஆதரிக்கப்படவில்லை.

# OpenOrienteering::OcdFileExport
source: The map contains more than 256 colors which is not supported by OCD version 8.
ta: வரைபடத்தில் 256 க்கும் மேற்பட்ட வண்ணங்கள் உள்ளன, அவை ஒ.சி.டி பதிப்பு 8 ஆல் ஆதரிக்கப்படவில்லை.

# OpenOrienteering::OcdFileExport
source: Invalid spot color.
ta: தவறான ச்பாட் நிறம்.

# OpenOrienteering::OcdFileExport
source: In area symbol "%1", skipping a fill pattern.
ta: பகுதி சின்னத்தில் "%1", நிரப்பு வடிவத்தைத் தவிர்க்கிறது.
