Repository: 247i/TACETr
Catalog: உரை/தானி/openstop-advanced-question-catalog-*.po
Languages: ta

# platformHeightName
source: Platform height
ta: இயங்குதள உயரம்

# platformHeightText
source: What is the height difference between the platform and the road respectively the top edge of the rail?
ta: ரயிலின் மேல் விளிம்பில் முறையே மேடைக்கும் சாலைக்கும் இடையிலான உயர வேறுபாடு என்ன?

# platformHeightDescription
source: If this height varies within a platform, the typical value for the usual entry point for wheelchair users should be determined.
ta: இந்த உயரம் ஒரு தளத்திற்குள் மாறுபட்டால், சக்கர நாற்காலி பயனர்களுக்கான வழக்கமான நுழைவு புள்ளிக்கான வழக்கமான மதிப்பு தீர்மானிக்கப்பட வேண்டும்.

# platformHeightPlaceholder
source: Platform height
ta: இயங்குதள உயரம்

# unitCentimeter
source: centimeter
ta: சென்டிமீட்டர்

# IFOPTStopName
source: Platform IFOPT
ta: இயங்குதளம் ifopt

# IFOPTStopText
source: What is the IFOPT for this platform?
ta: இந்த தளத்திற்கான IFOPT என்ன?

# IFOPTStopDescription
source: The IFOPT is a unique identifier for platforms.
ta: IFOPT என்பது தளங்களுக்கான தனித்துவமான அடையாளங்காட்டியாகும்.

# IFOPTStopAreaName
source: Stop area IFOPT
ta: பகுதி IFOPT ஐ நிறுத்துங்கள்

# IFOPTStopAreaText
source: What is the IFOPT for the entire stop?
ta: முழு நிறுத்தத்திற்கும் IFOPT என்ன?

# IFOPTStopAreaDescription
source: The IFOPT is a unique identifier for stop areas.
ta: IFOPT என்பது நிறுத்த பகுதிகளுக்கு ஒரு தனித்துவமான அடையாளங்காட்டியாகும்.

# platformNarrowsName
source: Narrows width
ta: குறுகல்கள் அகலம்

# platformNarrowsText
source: What is the width of the narrowest part of the platform?
ta: தளத்தின் குறுகிய பகுதியின் அகலம் என்ன?

# platformNarrowsDescription
source: The walls of shelters or the mast often create narrows. This value is important, among other things, so that wheelchair users know whether they can reach the entire platform.
ta: தங்குமிடங்களின் சுவர்கள் அல்லது மாச்ட் பெரும்பாலும் குறுகல்களை உருவாக்குகின்றன. இந்த மதிப்பு முக்கியமானது, மற்றவற்றுடன், சக்கர நாற்காலி பயனர்கள் முழு தளத்தையும் அடைய முடியுமா என்பதை அறிவார்கள்.

# platformNarrowsPlaceholder
source: Width
ta: அகலம்
