Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: If these two lines are not there or are commented out (line starts with a ``#``), add them in or remove the ``#`` (``sudo nano /etc/apt/sources.list``).
ta: இந்த இரண்டு வரிகளும் இல்லாவிட்டால் அல்லது கருத்து தெரிவிக்கப்பட்டால் (வரி ``#`` `), அவற்றைச் சேர்க்கவும் அல்லது` `#` `(` `சூடோ நானோ/முதலியன/apt/surdures.list. .

source: **Redis**
ta: ** ரெடிச் **

source: Redis is used to temporarily store the background tasks.
ta: பின்னணி பணிகளை தற்காலிகமாக சேமிக்க ரெடிச் பயன்படுத்தப்படுகிறது.

source: Folders and permissions
ta: கோப்புறைகள் மற்றும் அனுமதிகள்

source: **Groups**
ta: ** குழுக்கள் **

source: Now create new group ``openrem`` and add your user to it (``$USER`` will automatically substitute for the user you are running as):
ta: இப்போது புதிய குழுவை `` OpenRem`` உருவாக்கி, உங்கள் பயனரைச் சேர்க்கவும் (`` $ பயனர்`` நீங்கள் இயங்கும் பயனருக்கு தானாகவே மாற்றாக இருக்கும்):

source: Add orthanc and www-data users to openrem group:
ta: ஓபன்ரெம் குழுவில் ஆர்த்தாங்க் மற்றும் www-data பயனர்களைச் சேர்க்கவும்:

source: At a later stage, to add a second administrator just add them to the ``openrem`` group in the same way.
ta: பின்னர் கட்டத்தில், இரண்டாவது நிர்வாகியைச் சேர்க்க `` ஓபன்ரெம்`` குழுவில் அதே வழியில் சேர்க்கவும்.

source: **Folders**
ta: ** கோப்புறைகள் **

source: Create the folders we need, and set the permissions. The 'sticky' group setting and the access control list setting (``setfacl``) below will enable both ``orthanc`` user and ``www-data`` user as well as you and your colleagues to write to the logs and access the 'Physics' images etc:
ta: நமக்குத் தேவையான கோப்புறைகளை உருவாக்கி, அனுமதிகளை அமைக்கவும். கீழே உள்ள 'ஒட்டும்' குழு அமைப்பு மற்றும் அணுகல் கட்டுப்பாட்டு பட்டியல் அமைப்பு (`` setfacl``) `` ஆர்த்தாங்க்` பயனர் மற்றும் `` www-data`` பயனரும், உங்களுக்கும் உங்கள் சகாக்களும் பதிவுகளுக்கு எழுத உதவும் 'இயற்பியல்' படங்களை அணுகவும்:

source: Find the ``uid`` of your user and the ``gid`` of the ``openrem`` group:
ta: உங்கள் பயனரின் `` uid`` மற்றும் `` OpenRem`` குழுவின் `` gid`` ஐக் கண்டறியவும்:

source: Take note of the ``uid`` number and the ``gid`` in the third field of the group information and use it in the next command, replacing ``1001`` (user ``uid``) and ``1002`` (``openrem`` group ``gid``) as appropriate:
ta: குழு தகவலின் மூன்றாவது துறையில் `` uid`` எண் மற்றும் `` gid`` ஆகியவற்றைக் கவனியுங்கள், அதை அடுத்த கட்டளையில் பயன்படுத்தவும், `1001`` (பயனர்` uid``) மற்றும் `` 1002`` (`` OpenRem`` குழு `` gid``) பொருத்தமானது:

source: Pixelmed download
ta: படப்புள்ளி பதிவிறக்கம்

source: Create the virtualenv
ta: மெய்நிகர் ஈட்டி உருவாக்கவும்

source: Create a virtualenv (Python local environment) in the folder we created:
ta: நாங்கள் உருவாக்கிய கோப்புறையில் ஒரு மெய்நிகர் ஈவ் (பைதான் உள்ளக சூழல்) ஐ உருவாக்கவும்:

source: Activate the virtualenv
ta: மெய்நிகர் ஈசியை செயல்படுத்தவும்

source: Activate the virtualenv (note the ``.`` -- you can also use the word ``source``):
ta: மெய்நிகர்இன்வை செயல்படுத்தவும் (`` .`` ஐக் கவனியுங்கள் - நீங்கள் `` மூல`` என்ற வார்த்தையையும் பயன்படுத்தலாம்:

source: Install Python packages
ta: பைதான் தொகுப்புகளை நிறுவவும்

source: Database and OpenREM config
ta: தரவுத்தளம் மற்றும் ஓபன்ரெம் கட்டமைப்பு

source: Setup PostgreSQL database
ta: Postgresql தரவுத்தளத்தை அமைக்கவும்

source: Create a postgres user, and create the database. You will be asked to enter a new password (twice). This will be needed when configuring the ``local_settings.py`` file later:
ta: போச்ட்கிரெச் பயனரை உருவாக்கி, தரவுத்தளத்தை உருவாக்கவும். புதிய கடவுச்சொல்லை (இரண்டு முறை) உள்ளிடுமாறு கேட்கப்படுவீர்கள். `` Local_settings.py`` கோப்பை பின்னர் கட்டமைக்கும்போது இது தேவைப்படும்:

source: For upgrades use a different template
ta: மேம்படுத்தல்களுக்கு வேறு வார்ப்புருவைப் பயன்படுத்துங்கள்

source: If this is an upgrade to a new Linux server and not a new install, use ``template0`` instead:
ta: இது ஒரு புதிய லினக்ச் சேவையகத்திற்கான மேம்படுத்தல் மற்றும் புதிய நிறுவல் அல்ல என்றால், அதற்கு பதிலாக `` வார்ப்புரு 0`` ஐப் பயன்படுத்தவும்:

source: Update the PostgreSQL client authentication configuration. Add the following line anywhere near the bottom of the file, for example in the gap before ``# DO NOT DISABLE`` or anywhere in the table that follows. The number of spaces between each word is not important (one or more). If you are not using PostgreSQL 14 then substitute the version number in the file path.
ta: PostgresQL கிளையன்ட் அங்கீகார உள்ளமைவைப் புதுப்பிக்கவும். கோப்பின் அடிப்பகுதிக்கு அருகில் எங்கும் பின்வரும் வரியைச் சேர்க்கவும், எடுத்துக்காட்டாக ``# முடக்க வேண்டாம்`` அல்லது பின்வரும் அட்டவணையில் எங்கும் முன் இடைவெளியில். ஒவ்வொரு வார்த்தைக்கும் இடையிலான இடைவெளிகளின் எண்ணிக்கை முக்கியமல்ல (ஒன்று அல்லது அதற்கு மேற்பட்டவை). நீங்கள் postgresql 14 ஐப் பயன்படுத்தவில்லை என்றால், கோப்பு பாதையில் பதிப்பு எண்ணை மாற்றவும்.

source: Reload postgres:
ta: போச்ட்கிரெசை மீண்டும் ஏற்றவும்:

source: Navigate to the Python openrem folder and copy the example ``local_settings.py`` and ``wsgi.py`` files to remove the ``.linux`` and ``.example`` suffixes:
ta: பைதான் ஓபன்ரெம் கோப்புறையில் செல்லவும், `` `.linux``` மற்றும்` `.எக்சி மாதிரி` பின்னொட்டுகளை அகற்ற` `local_settings.py`` மற்றும்` `wsgi.py`` கோப்புகளை நகலெடுக்கவும்:

source: Edit ``local_settings.py`` as needed - make sure you change the ``PASSWORD``, the ``SECRET_KEY`` (to anything, just change it), the ``ALLOWED_HOSTS`` list, regionalisation settings and the ``EMAIL`` configuration. You can modify the email settings later if necessary. Some settings are not shown here but are documented in the settings file or elsewhere in the docs. For details on the final variable see :ref:`ignore-device-obs-uid`.
ta: தேவைக்கேற்ப `` local_settings.py`` ஐத் திருத்து - `` கடவுச்சொல்``, `` ரகசிய_கே`` (எதற்கும், அதை மாற்றவும்), `` அனுமதிக்கப்பட்ட_ஓச்ட்ச்`` பட்டியல், பிராந்தியமயமாக்கல் அமைப்புகள் மற்றும் ` `மின்னஞ்சல்` உள்ளமைவு. தேவைப்பட்டால் மின்னஞ்சல் அமைப்புகளை பின்னர் மாற்றலாம். சில அமைப்புகள் இங்கே காட்டப்படவில்லை, ஆனால் அவை அமைப்புகள் கோப்பில் அல்லது ஆவணங்களில் வேறு இடங்களில் ஆவணப்படுத்தப்பட்டுள்ளன. இறுதி மாறியின் விவரங்களுக்கு பார்க்க: ref: `புறக்கணிப்பு-DEVICE-OBS-IUID`.

source: Upgrading to a new server
ta: புதிய சேவையகத்திற்கு மேம்படுத்துதல்

source: If you are upgrading to a new Linux server, review the ``local_settings.py`` file from the old server to copy over the ``NAME``, ``USER`` and ``PASSWORD``, ``ALLOWED_HOSTS`` list and the ``EMAIL`` configuration, and check all the other settings. Change the ``SECRET_KEY`` from the default, but it doesn't have to match the one on the old server. For details on the final variable see :ref:`ignore-device-obs-uid`.
ta: நீங்கள் ஒரு புதிய லினக்ச் சேவையகத்திற்கு மேம்படுத்தினால், பழைய சேவையகத்திலிருந்து `` பெயர்``, `` பயனர்`` மற்றும் `` கடவுச்சொல்``, `` அனுமதிக்கப்பட்ட_ஓச்ட்ச்` `பட்டியல் மற்றும்` `மின்னஞ்சல்` உள்ளமைவு, மற்ற எல்லா அமைப்புகளையும் சரிபார்க்கவும். இயல்புநிலையிலிருந்து `` சீக்ரெட்_கே`` ஐ மாற்றவும், ஆனால் இது பழைய சேவையகத்தில் பொருந்த வேண்டியதில்லை. இறுதி மாறியின் விவரங்களுக்கு பார்க்க: ref: `புறக்கணிப்பு-DEVICE-OBS-IUID`.

source: Now create the database. Make sure you are still in the openrem python folder and the virtualenv is active — prompt will look like
ta: இப்போது தரவுத்தளத்தை உருவாக்கவும். நீங்கள் இன்னும் ஓபன்ரெம் பைதான் கோப்புறையில் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் மற்றும் மெய்நிகர்இன்வி செயலில் உள்ளது - உடனடி போல இருக்கும்

source: Otherwise see :ref:`activatevirtualenv` and navigate back to that folder.
ta: இல்லையெனில் காண்க: ref: `செயல்படுத்தவும், அந்த கோப்புறையில் மீண்டும் செல்லவும்.

source: If you are upgrading to a new Linux server, use these additional commands before continuing with those below:
ta: நீங்கள் ஒரு புதிய லினக்ச் சேவையகத்திற்கு மேம்படுத்தினால், கீழே உள்ளவர்களுடன் தொடரும் முன் இந்த கூடுதல் கட்டளைகளைப் பயன்படுத்தவும்:

source: Import the database - update the path to the database backup file you copied from the old server:
ta: தரவுத்தளத்தை இறக்குமதி செய்யுங்கள் - பழைய சேவையகத்திலிருந்து நீங்கள் நகலெடுத்த தரவுத்தள காப்புப்பிரதி கோப்புக்கான பாதையை புதுப்பிக்கவும்:

source: Migrate the database:
ta: தரவுத்தளத்தை நகர்த்தவும்:

source: Webserver
ta: வெப்சர்வர்

source: Configure NGINX and Gunicorn
ta: Nginx மற்றும் kunicorn ஐ உள்ளமைக்கவும்

source: Copy in the OpenREM site config file
ta: OpenREM தள கட்டமைப்பு கோப்பில் நகலெடுக்கவும்

source: Content of NGINX config file:
ta: Nginx கட்டமைப்பு கோப்பின் உள்ளடக்கம்:

source: Remove the default config and make ours active:
ta: இயல்புநிலை உள்ளமைவை அகற்றி, நம் செயலில் ஈடுபடுங்கள்:

source: Copy the Gunicorn systemd service file into place:
ta: Kunicorn Systemd பணி கோப்பை இடத்திற்கு நகலெடுக்கவும்:

source: Content of systemd file:
ta: SystemD கோப்பின் உள்ளடக்கம்:

source: Copy the task queue consumer systemd service file into place:
ta: பணி வரிசை நுகர்வோர் சிச்டம் பணி கோப்பை இடத்திற்கு நகலெடுக்கவும்:

source: Load the new systemd configurations:
ta: புதிய கணினி உள்ளமைவை ஏற்றவும்:

source: Set the new Gunicorn and consumer services to start on boot:
ta: துவக்கத் தொடங்க புதிய குனிகார்ன் மற்றும் நுகர்வோர் சேவைகளை அமைக்கவும்:

source: Start the Gunicorn and consumer services, and restart the NGINX service:
ta: கன்னிகார்ன் மற்றும் நுகர்வோர் சேவைகளைத் தொடங்கி, Nginx சேவையை மறுதொடக்கம் செய்யுங்கள்:

source: Test the webserver
ta: வெப்சர்வரை சோதிக்கவும்

source: You should now be able to browse to the OpenREM server from another PC.
ta: நீங்கள் இப்போது மற்றொரு கணினியிலிருந்து ஓபன்ரெம் சேவையகத்திற்கு உலவ முடியும்.

source: You can check that NGINX and Gunicorn are running with the following two commands:
ta: பின்வரும் இரண்டு கட்டளைகளுடன் Nginx மற்றும் Cunicorn ஆகியவை இயங்குகின்றனவா என்பதை நீங்கள் சரிபார்க்கலாம்:

source: DICOM Store SCP
ta: டிகாம் கடை எச்.சி.பி.

source: Copy the Lua file to the Orthanc folder. This will control how we process the incoming DICOM objects.
ta: லுவா கோப்பை ஆர்த்தாங்க் கோப்புறையில் நகலெடுக்கவும். உள்வரும் DICOM பொருள்களை நாங்கள் எவ்வாறு செயலாக்குகிறோம் என்பதை இது கட்டுப்படுத்தும்.

source: Edit the Orthanc Lua configuration options:
ta: ஆர்த்தாங்க் லுவா உள்ளமைவு விருப்பங்களைத் திருத்தவும்:

source: Set ``use_physics_filtering`` to true if you want Orthanc to keep physics test studies, and have it put them in the ``/var/dose/orthanc/physics/`` folder. Set it to ``false`` to disable this feature. Add names or IDs to ``physics_to_keep`` as a comma separated list.
ta: இயற்பியல் சோதனை ஆய்வுகளை வைத்திருக்க ஆர்த்தாங்க் விரும்பினால், ``/var/டோச்/ஆர்த்தாங்க்/இயற்பியல்/`` கோப்புறையில் வைக்க விரும்பினால் `` `use_physics_filtering`` ஐ உண்மையாக அமைக்கவும். இந்த அம்சத்தை முடக்க அதை `` FALSE`` என அமைக்கவும். கமாவைப் பிரித்த பட்டியலாக `` இயற்பியல்_டோ_கீப்` இல் பெயர்கள் அல்லது ஐடிகளைச் சேர்க்கவும்.

source: Lists of things to ignore. Orthanc will ignore anything matching the content of these comma separated lists; they will not be imported into OpenREM.
ta: புறக்கணிக்க வேண்டிய விசயங்களின் பட்டியல்கள். இந்த கமாவைப் பிரிக்கப்பட்ட பட்டியல்களின் உள்ளடக்கத்துடன் பொருந்தக்கூடிய எதையும் ஆர்த்தாங்க் புறக்கணிக்கும்; அவை ஓபன்ரெமில் இறக்குமதி செய்யப்படாது.

source: Edit the Orthanc configuration:
ta: ஆர்த்தாங்க் உள்ளமைவைத் திருத்தவும்:

source: Add the Lua script to the Orthanc config:
ta: ஆர்த்தாங்க் கட்டமைப்பில் லுவா ச்கிரிப்டைச் சேர்க்கவும்:

source: Set the AE Title and port:
ta: AE தலைப்பு மற்றும் துறைமுகத்தை அமைக்கவும்:

source: Optionally, you may also like to enable the HTTP server interface for Orthanc (although if the Lua script is removing all the objects as soon as they are processed, you won't see much!):
ta: விருப்பமாக, ஆர்த்தாங்கிற்கான HTTP சேவையக இடைமுகத்தை இயக்கவும் நீங்கள் விரும்பலாம் (LUA ச்கிரிப்ட் அனைத்து பொருள்களையும் செயலாக்கியவுடன் அகற்றினால், நீங்கள் அதிகம் பார்க்க மாட்டீர்கள்!):

source: To see the Orthanc web interface, go to http://openremserver:8042/ -- of course change the server name to that of your server!
ta: ஆர்த்தாங்க் வலை இடைமுகத்தைக் காண, http: // OpenRemServer க்குச் செல்லவும்: 8042/ - நிச்சயமாக சேவையக பெயரை உங்கள் சேவையகத்திற்கு மாற்றவும்!

source: Allow Orthanc to use DICOM port
ta: ஆர்த்தாங்கை டிகாம் போர்ட்டைப் பயன்படுத்த அனுமதிக்கவும்

source: By default, Orthanc uses port 4242. If you wish to use a lower port, specifically the DICOM port of 104, you will need to give the Orthanc binary special permission to do so:
ta: இயல்பாக, ஆர்த்தாங்க் துறைமுகம் 4242 ஐப் பயன்படுத்துகிறது. நீங்கள் குறைந்த துறைமுகத்தைப் பயன்படுத்த விரும்பினால், குறிப்பாக 104 இன் டிகாம் துறைமுகம், அவ்வாறு செய்ய நீங்கள் ஆர்த்தாங்க் பைனரி சிறப்பு இசைவு வழங்க வேண்டும்:

source: Finish off
ta: முடிக்கவும்

source: Restart Orthanc:
ta: ஆர்த்தங்கை மறுதொடக்கம் செய்யுங்கள்:

source: New users, and quick access to physics folder
ta: புதிய பயனர்கள், மற்றும் இயற்பியல் கோப்புறையில் விரைவான அணுகல்

source: This is for new Linux users; for new OpenREM users, refer to :ref:`user-settings`
ta: இது புதிய லினக்ச் பயனர்களுக்கானது; புதிய ஓபன்ரெம் பயனர்களுக்கு, பார்க்க: ref: `பயனர்-தீர்வு`

source: If you left ``local use_physics_filtering = true`` in the Orthanc configuration, you might like to give your colleagues a quick method of accessing the physics folder from their home folder. Then if they use a program like `WinSCP`_ it is easy to find and copy the QA images to another (Windows) computer on the network. WinSCP can also be run directly from a USB stick if you are unable to install software :-)
ta: ஆர்த்தாங்க் உள்ளமைவில் நீங்கள் `` உள்ளக பயன்பாடு_பிசிக்ச்_பில்டரிங் = உண்மை`` விட்டுவிட்டால், உங்கள் சகாக்கள் தங்கள் வீட்டு கோப்புறையிலிருந்து இயற்பியல் கோப்புறையை அணுகுவதற்கான விரைவான முறையை வழங்க விரும்பலாம். அவர்கள் `winscp`_ போன்ற ஒரு நிரலைப் பயன்படுத்தினால், QA படங்களை பிணையத்தில் மற்றொரு (விண்டோச்) கணினியில் கண்டுபிடித்து நகலெடுப்பது எளிது. நீங்கள் மென்பொருளை நிறுவ முடியாவிட்டால் winscp ஐ யூ.எச்.பி குச்சியிலிருந்து நேரடியாக இயக்க முடியும் :-)

source: Add the new user (replace ``newusername`` as appropriate):
ta: புதிய பயனரைச் சேர்க்கவும் (`` நியூச்நேம்`` ஐ பொருத்தமானதாக மாற்றவும்):

source: Then add the new user to the `openrem` group (again, replace the user name):
ta: புதிய பயனரை `OpenRem` குழுவில் சேர்க்கவும் (மீண்டும், பயனர் பெயரை மாற்றவும்):

source: Now add a 'sym-link' to the new users home directory (again, replace the user name):
ta: இப்போது புதிய பயனர்களின் வீட்டு கோப்பகத்தில் 'சிம்-லிங்க்' சேர்க்கவும் (மீண்டும், பயனர் பெயரை மாற்றவும்):

source: The new user should now be able to get to the physics folder by clicking on the ``physicsimages`` link when they log in, and should be able to browse, copy and delete the zip files and folders.
ta: புதிய பயனர் இப்போது இயற்பியல் கோப்புறையைப் பெற முடியும், அவை உள்நுழையும்போது `` இயற்பியல் படங்கள்`` இணைப்பைக் சொடுக்கு செய்வதன் மூலம், சிப் கோப்புகள் மற்றும் கோப்புறைகளை உலவவும், நகலெடுக்கவும், நீக்கவும் முடியும்.

source: Asciinema demo of this install
ta: இந்த நிறுவலின் அச்கினேமா டெமோ

source: Link to `asciinema <https://asciinema.org/a/8CqCcLMlUG5DlWj7NhrQV8b8L>`_ demo of this install
ta: `ASCIINEMA <https://asciinema.org/a/8cqccclmlug5dlwj7nhrqv8b8l>` _ இந்த நிறுவலின் டெமோ ஆகியவற்றுடன் இணைக்கவும்

source: Offline installation or upgrade
ta: இணைப்பில்லாத நிறுவல் அல்லது மேம்படுத்தல்

source: In order to install or upgrade OpenREM on a Windows server that does not have access to the internet you will need to download all the packages and dependencies on another computer and copy them across.
ta: இணையத்திற்கு அணுகல் இல்லாத சாளரங்கள் சேவையகத்தில் ஓபன்ரெமை நிறுவ அல்லது மேம்படுத்த நீங்கள் அனைத்து தொகுப்புகளையும் சார்புகளையும் மற்றொரு கணினியில் பதிவிறக்கம் செய்து அவற்றை நகலெடுக்க வேண்டும்.

source: If you have trouble when installing the Python packages on Windows due to incorrect architecture, you may need to either download on a Windows system similar to the server (matching 32-bit/64-bit), or to download the files from http://www.lfd.uci.edu/~gohlke/pythonlibs/ instead. Alternatively there are ways to tell ``pip`` to download binary packages for specific platforms.
ta: தவறான கட்டமைப்பு காரணமாக சாளரங்களில் பைதான் தொகுப்புகளை நிறுவும் போது உங்களுக்கு சிக்கல் இருந்தால், நீங்கள் சேவையகத்திற்கு ஒத்த சாளரங்கள் கணினியில் பதிவிறக்கம் செய்ய வேண்டியிருக்கலாம் (32-பிட்/64-பிட் பொருந்துகிறது), அல்லது கோப்புகளை http:/இலிருந்து பதிவிறக்கம் செய்ய வேண்டும் /www.lfd.uci.edu/~gohlke/pythonlibs/ அதற்கு பதிலாக. மாற்றாக குறிப்பிட்ட தளங்களுக்கு பைனரி தொகுப்புகளை பதிவிறக்கம் செய்ய `` பிப்`` சொல்ல வழிகள் உள்ளன.

source: It is expected and highly recommended that server operating systems have access to security updates even when other internet access is blocked.
ta: மற்ற இணைய அணுகல் தடுக்கப்படும்போது கூட சேவையக இயக்க முறைமைகள் பாதுகாப்பு புதுப்பிப்புகளை அணுக வேண்டும் என்று எதிர்பார்க்கப்படுகிறது மற்றும் பரிந்துரைக்கப்படுகிறது.

source: The instructions that follow are for a Windows server that doesn't have access to the internet. For Linux servers, it is recommended to allow access to the distribution's repositories to install and update the software. It is technically possible to use a local repository mirror/cache, or to download all the packages manually, but this is beyond the scope of these instructions.
ta: பின்பற்றும் வழிமுறைகள் இணையத்திற்கு அணுகல் இல்லாத சாளரங்கள் சேவையகத்திற்கான வழிமுறைகள். லினக்ச் சேவையகங்களுக்கு, மென்பொருளை நிறுவவும் புதுப்பிக்கவும் விநியோகத்தின் களஞ்சியங்களை அணுக அனுமதிக்க பரிந்துரைக்கப்படுகிறது. உள்ளக களஞ்சிய கண்ணாடி/தற்காலிக சேமிப்பைப் பயன்படுத்துவது அல்லது எல்லா தொகுப்புகளையும் கைமுறையாக பதிவிறக்கம் செய்வது தொழில்நுட்ப ரீதியாக சாத்தியமாகும், ஆனால் இது இந்த வழிமுறைகளின் எல்லைக்கு அப்பாற்பட்டது.

source: An :doc:`install_offline_docker` might be easier on an offline Linux server, once Docker and Docker Compose are installed.
ta: AN: DOC: `install_offline_docker` இணைப்பில்லாத லினக்ச் சேவையகத்தில் எளிதாக இருக்கலாம், ஒருமுறை கப்பல்துறை மற்றும் கப்பல்துறை இசைக்குழு நிறுவப்பட்டதும்.

source: On a computer with internet access
ta: இணைய அணுகல் கொண்ட கணினியில்

source: Download independent binaries
ta: சுயாதீன இருமங்களை பதிவிறக்கவும்

source: Download all the software in the :ref:`windows_install_packages` section except IIS:
ta: ஐ.ஐ.எச் தவிர: சிவப்பு: `விண்டோச் நிறுவல் தொகுப்புகளை நிறுவுங்கள்:

source: Python
ta: பைதான்

source: Orthanc
ta: Rantanc

source: gettext
ta: உரைபெறு

source: Pixelmed
ta: பிக்சல்மெட்

source: 7Zip
ta: கட்சி

source: Notepad++
ta: நோட்பேட் ++

source: WinSW
ta: வின்ச்வ்

source: Download Python packages from PyPI
ta: PYPI இலிருந்து பைதான் தொகுப்புகளைப் பதிவிறக்கவும்

source: In a console, navigate to a suitable place and create an empty directory to collect all the packages in, then use ``pip`` to download them all - Python 3 (including Pip) will need to be installed on the computer with internet access to download the packages, ideally Python 3.10:
ta: ஒரு கன்சோலில், பொருத்தமான இடத்திற்குச் சென்று அனைத்து தொகுப்புகளையும் சேகரிக்க ஒரு வெற்று கோப்பகத்தை உருவாக்கவும், பின்னர் அனைத்தையும் பதிவிறக்கம் செய்ய `` பிஐபி`` ஐப் பயன்படுத்தவும் - பைதான் 3 (பிஐபி உட்பட) இணைய அணுகலுடன் கணினியில் நிறுவப்பட வேண்டும் தொகுப்புகளைப் பதிவிறக்க, வெறுமனே பைதான் 3.10:

source: Copy everything to the Server
ta: எல்லாவற்றையும் சேவையகத்திற்கு நகலெடுக்கவும்

source: Copy this directory plus the binaries to the offline server.
ta: இந்த அடைவு மற்றும் பைனரிகளை இணைப்பில்லாத சேவையகத்திற்கு நகலெடுக்கவும்.

source: On the server without internet access
ta: இணைய அணுகல் இல்லாமல் சேவையகத்தில்

source: Follow the :doc:`install_windows`, :doc:`upgrade_windows_new_server`, or :doc:`upgrade_windows` instructions, installing the binary packages that were copied across as well as IIS. The **Install OpenREM** section has instructions on how to install OpenREM python packages from the folder you have copied across.
ta: பின்தொடரவும்: DOC: `install_windows`,: DOC:` UPGRADE_WINDOWS_NEW_SERVER`, அல்லது: DOC: `மேம்படுத்தல்_விண்டோச்` அறிவுறுத்தல்கள், மற்றும் ஐ.ஐ.எச் முழுவதும் நகலெடுக்கப்பட்ட பைனரி தொகுப்புகளை நிறுவுதல். நீங்கள் நகலெடுத்த கோப்புறையிலிருந்து ஓபன்ரெம் பைதான் தொகுப்புகளை எவ்வாறு நிறுவுவது என்பதற்கான வழிமுறைகள் ** OpenRem ** பிரிவில் உள்ளன.

source: Offline Docker installation
ta: இணைப்பில்லாத கப்பல்துறை நிறுவல்

source: OpenREM can be run on a server that is not connected to the internet if required, though access to https://hub.docker.com would make installation and upgrades much easier.
ta: தேவைப்பட்டால் இணையத்துடன் இணைக்கப்படாத சேவையகத்தில் ஓபன்ரெம் இயக்கப்படலாம், இருப்பினும் https://hub.docker.com க்கான அணுகல் நிறுவல் மற்றும் மேம்படுத்தல்களை மிகவும் எளிதாக்கும்.

source: The server will need to have Docker and Docker Compose installed.
ta: சேவையகத்தில் கப்பல்துறை மற்றும் கப்பல்துறை இசையமைப்பை நிறுவ வேண்டும்.

source: Collect installation files
ta: நிறுவல் கோப்புகளை சேகரிக்கவும்

source: On a computer with internet access:
ta: இணைய அணுகல் கொண்ட கணினியில்:

source: Install Docker - this is required to download the images
ta: டோக்கரை நிறுவவும் - இது படங்களை பதிவிறக்கம் செய்ய வேண்டும்

source: Download the Docker images:
ta: கப்பல்துறை படங்களைப் பதிவிறக்கவும்:

source: Now save them as tar files:
ta: இப்போது அவற்றை தார் கோப்புகளாக சேமிக்கவும்:

source: If both the computer with internet access and the target server are Linux or MacOS the images can be made smaller using gzip, for example:
ta: இணைய அணுகல் கொண்ட கணினி மற்றும் இலக்கு சேவையகம் இரண்டும் லினக்ச் அல்லது மேகோச் எனில், gzip ஐப் பயன்படுத்தி படங்களை சிறியதாக மாற்றலாம், எடுத்துக்காட்டாக:

source: Copy all the tar files and the zip file to the server where OpenREM is to be installed.
ta: OpenREM நிறுவப்பட வேண்டிய சேவையகத்திற்கு எல்லா தார் கோப்புகளையும் சிப் கோப்பையும் நகலெடுக்கவும்.

source: Load the docker images
ta: கப்பல்துறை படங்களை ஏற்றவும்

source: On the server where OpenREM is to be installed, in the folder containing the Docker images:
ta: ஓபன்ரெம் நிறுவப்பட வேண்டிய சேவையகத்தில், கப்பல்துறை படங்களைக் கொண்ட கோப்புறையில்:

source: If you have compressed the images with gzip the command is the same but with the ``.gz`` suffix, for example:
ta: நீங்கள் gzip உடன் படங்களை சுருக்கியிருந்தால் கட்டளை ஒன்றுதான், ஆனால் `` .gz`` பின்னொட்டுடன், எடுத்துக்காட்டாக:

source: Check that the images have been loaded:
ta: படங்கள் ஏற்றப்பட்டிருக்கிறதா என்று சரிபார்க்கவும்:

source: Continue to :ref:`dockerinstall`
ta: தொடர்ந்து: குறிப்பு: `டோக்கரின்ச்டால்`

source: Native Windows install
ta: சொந்த சாளரங்கள் நிறுவுதல்

source: This install is based on Windows Server 2022 using:
ta: இந்த நிறுவல் சாளரங்கள் சர்வர் 2022 ஐ அடிப்படையாகக் கொண்டது:

source: Webserver: Microsoft IIS running on port 80
ta: வெப்சர்வர்: மைக்ரோசாப்ட் ஐ.ஐ.எச் துறைமுகம் 80 இல் இயங்குகிறது

source: WinSW to run background tasks as services
ta: பின்னணி பணிகளை சேவைகளாக இயக்க வின்ச்வ்

source: Notepad++ for editing files
ta: கோப்புகளைத் திருத்துவதற்கு நோட்பேட் ++

source: Database files stored on D:
ta: டி இல் சேமிக்கப்பட்ட தரவுத்தள கோப்புகள்:

source: OpenREM files stored on E:
ta: இ இல் சேமிக்கப்பட்டுள்ள OpenRem கோப்புகள்:

source: With Physics (QA) images being collected and zipped for retrieval
ta: இயற்பியல் (கியூஏ) படங்கள் சேகரிக்கப்பட்டு மீட்டெடுப்பதற்காக சிப் செய்யப்பட்டன

source: The instructions should work for Windows Server 2016 and 2019; and will probably work with Windows 10/11 with some modification. Desktop editions of Windows are not recommended for a production OpenREM install.
ta: வழிமுறைகள் சாளரங்கள் சர்வர் 2016 மற்றும் 2019 க்கு வேலை செய்ய வேண்டும்; மற்றும் சாளரங்கள் 10/11 உடன் சில மாற்றங்களுடன் வேலை செய்யும். விளைவாக்கம் ஓபன்ரெம் நிறுவலுக்கு விண்டோசின் டெச்க்டாப் பதிப்புகள் பரிந்துரைக்கப்படவில்லை.

source: If you are upgrading an existing installation to a new Windows server, go to the :doc:`upgrade_windows_new_server` first.
ta: நீங்கள் ஏற்கனவே உள்ள நிறுவலை புதிய சாளரங்கள் சேவையகத்திற்கு மேம்படுத்தினால்,: டாக்: `மேம்படுத்தல்_விண்டோச்_நியூ_சர்வர்` முதலில்.

source: If you are upgrading an existing Windows Server installation in-place, go to :doc:`upgrade_windows` instead.
ta: நீங்கள் ஏற்கனவே இருக்கும் சாளரங்கள் சேவையக நிறுவலை மேம்படுத்தினால், அதற்குச் செல்லவும்: டாக்: `மேம்படுத்தல்_விண்டோச்` அதற்கு பதிலாக.
