Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: number of studies that took place in that hour on that weekday in that x-ray room
ta: அந்த எக்ச்ரே அறையில் அந்த வாரத்தில் அந்த நேரத்தில் நடந்த ஆய்வுகளின் எண்ணிக்கை

source: Line chart of average value over time
ta: காலப்போக்கில் சராசரி மதிப்பின் வரி விளக்கப்படம்

source: These can be configured to show mean or median data. Each datapoint represents the average over a user-specified time period. This can be a day, week, month, quarter or year.
ta: சராசரி அல்லது சராசரி தரவைக் காட்ட இவை கட்டமைக்கப்படலாம். ஒவ்வொரு தரவுத்தொகுப்பும் பயனர் குறிப்பிட்ட கால அவகாசத்தை விட சராசரியைக் குறிக்கிறது. இது ஒரு நாள், வாரம், மாதம், காலாண்டு அல்லது ஆண்டாக இருக்கலாம்.

source: The example below shows the median DAP for "Head" requests made in four CT scanners over the course of five years.
ta: கீழேயுள்ள எடுத்துக்காட்டு ஐந்து ஆண்டுகளில் நான்கு சி.டி ச்கேனர்களில் செய்யப்பட்ட "தலை" கோரிக்கைகளுக்கான சராசரி டிஏபி காட்டுகிறது.

source: With *Grouping choice* set to **Series item names** in the `Chart options on the modality pages`_ a sub-plot is created for each requested procedure name, each with a series per x-ray system as shown below. The *Number of charts per row* in the `Additional chart options on the Config page`_ was set to 2 for these example charts.
ta: ** குழு தேர்வு*** தொடர் உருப்படி பெயர்கள் ** என அமைக்கப்பட்டுள்ளது `முறை பக்கங்களில் உள்ள விளக்கப்படம் விருப்பங்கள் `_ ஒவ்வொரு கோரப்பட்ட நடைமுறை பெயருக்கும் ஒரு துணை சூழ்ச்சி உருவாக்கப்படுகிறது, ஒவ்வொன்றும் கீழே காட்டப்பட்டுள்ளபடி எக்ச்-ரே அமைப்புக்கு ஒரு தொடர். இந்த எடுத்துக்காட்டு விளக்கப்படங்களுக்கு கட்டமைப்பு பக்கத்தில் உள்ள `கூடுதல் விளக்கப்படம் விருப்பங்களில் * கூடுதல் விளக்கப்படம் விருப்பங்களில் * * கூடுதல் விளக்கப்பட விருப்பங்களில் * * விளக்கப்படங்களின் எண்ணிக்கை *.

source: scanner name
ta: ச்கேனர் பெயர்

source: date
ta: திகதி

source: average DLP value
ta: சராசரி டி.எல்.பி மதிப்பு

source: number of requests included in the sample
ta: மாதிரியில் சேர்க்கப்பட்ட கோரிக்கைகளின் எண்ணிக்கை

source: Setting *Grouping choice* to **System names** in the `Chart options on the modality pages`_ changes the grouping. Now a sub-plot is created for each x-ray system, each with a series per requested procedure name, as shown below:
ta: முறை பக்கங்களில் உள்ள `விளக்கப்பட விருப்பங்களில் ** கணினி பெயர்களுக்கு ** ** கணினி பெயர்களுக்கு ** குழுமம் ** என அமைத்தல் குழுமத்தை மாற்றுகிறது. இப்போது ஒவ்வொரு எக்ச்-ரே அமைப்பிற்கும் ஒரு துணை சூழ்ச்சி உருவாக்கப்பட்டுள்ளது, ஒவ்வொன்றும் கீழே காட்டப்பட்டுள்ளபடி, கோரப்பட்ட நடைமுறை பெயருக்கு ஒரு தொடர்:

source: Bar chart of average value against another binned value across categories
ta: வகைகளில் மற்றொரு பின் மதிப்புக்கு எதிராக சராசரி மதிப்பின் பார் விளக்கப்படம்

source: These can be configured to show mean or median data. The example below shows the median average glandular dose from "MAMMOGRAM" protocol exposures plotted against compressed breast thickness bins. The data is from two x-ray systems.
ta: சராசரி அல்லது சராசரி தரவைக் காட்ட இவை கட்டமைக்கப்படலாம். கீழே உள்ள எடுத்துக்காட்டு, "மேமோகிராம்" நெறிமுறை வெளிப்பாடுகளிலிருந்து சராசரி சுரப்பி அளவைக் காட்டுகிறது. தரவு இரண்டு எக்ச்ரே அமைப்புகளிலிருந்து வந்தது.

source: acquisition protocol
ta: கையகப்படுத்தல் நெறிமுறை

source: average AGD value
ta: சராசரி AGD மதிப்பு

source: number of acquisitions included in the sample
ta: மாதிரியில் சேர்க்கப்பட்ட கையகப்படுத்துதல்களின் எண்ணிக்கை

source: compressed breast thickness bin range
ta: சுருக்கப்பட்ட மார்பக தடிமன் பின் வரம்பு

source: Chart options on the modality pages
ta: மாதிரி பக்கங்களில் விளக்கப்பட விருப்பங்கள்

source: Name
ta: பெயர்

source: Configuration options
ta: உள்ளமைவு விருப்பங்கள்

source: Notes
ta: குறிப்புகள்

source: Average plots
ta: சராசரி அடுக்குகள்

source: Any combination of **mean**, |br| **median** or **boxplot**
ta: ** சராசரி **, | br | இன் எந்த கலவையும் ** சராசரி ** அல்லது ** பாக்ச் பிளாட் **

source: Time period
ta: காலம்

source: One of **day**, **week**, **month**, |br| **quarter** or **year**
ta: ** நாள் **, ** வாரம் **, ** மாதம் **, | br | ** காலாண்டு ** அல்லது ** ஆண்டு **

source: Applies to over-time charts
ta: அதிக நேர விளக்கப்படங்களுக்கு பொருந்தும்

source: Grouping choice
ta: தொகுத்தல் தேர்வு

source: **System names** or |br| **Series item names**
ta: ** கணினி பெயர்கள் ** அல்லது | br | ** தொடர் உருப்படி பெயர்கள் **

source: **System names** groups by x-ray system |br| **Series item names** groups by each category
ta: ** கணினி பெயர்கள் ** எக்ச்-ரே அமைப்பால் குழுக்கள் | br | ** தொடர் உருப்படி பெயர்கள் ** ஒவ்வொரு வகையிலும் குழுக்கள்

source: Plot a series per system
ta: ஒரு கணினிக்கு ஒரு தொடரைத் திட்டமிடுங்கள்

source: **On** or **off**
ta: ** on ** அல்லது ** ஆஃப் **

source: Splits the data by x-ray system
ta: எக்ச்-ரே அமைப்பால் தரவை பிரிக்கிறது

source: Calculate histogram data
ta: இச்டோகிராம் தரவைக் கணக்கிடுங்கள்

source: Calculate histograms for average bar charts
ta: சராசரி பார் விளக்கப்படங்களுக்கான இச்டோகிராம்களைக் கணக்கிடுங்கள்

source: Chart sorting
ta: விளக்கப்படம் வரிசையாக்கம்

source: One of **name**, **frequency** |br| or **value**
ta: ** பெயர் **, ** அதிர்வெண் ** | br | அல்லது ** மதிப்பு **

source: Sort the chart data according to the |br| selected choice
ta: | Br | இன் படி விளக்கப்படத் தரவை வரிசைப்படுத்தவும் தேர்ந்தெடுக்கப்பட்ட தேர்வு

source: Sorting direction
ta: வரிசைப்படுத்தும் திசை

source: **Ascending** or |br| **descending**
ta: ** ஏறுதல் ** அல்லது | br | ** இறங்கு **

source: Sets the sort direction
ta: வரிசை திசையை அமைக்கிறது

source: Split plots by physician
ta: மருத்துவரால் பிளவு

source: Calculate a series per physician |br| (*some fluoroscopy charts only*)
ta: ஒரு மருத்துவருக்கு ஒரு தொடரைக் கணக்கிடுங்கள் | br | (*சில ஃப்ளோரோச்கோபி விளக்கப்படங்கள் மட்டும்*)

source: Additional chart options on the Config page
ta: கட்டமைப்பு பக்கத்தில் கூடுதல் விளக்கப்பட விருப்பங்கள்

source: Number of histogram bins
ta: இச்டோகிராம் பின்களின் எண்ணிக்கை

source: Value in the range 2 - 40
ta: 2 - 40 வரம்பில் மதிப்பு

source: Default is 10
ta: இயல்புநிலை 10 ஆகும்

source: Fixed histogram bins across sub-plots
ta: துணை அடுக்குகள் முழுவதும் நிலையான இச்டோகிராம் பின்கள்

source: Forces all histogram sub-plots |br| to use the same bins
ta: அனைத்து இச்டோகிராம் துணை அடுக்குகளும் | br | அதே தொட்டிகளைப் பயன்படுத்த

source: Case-insensitive categories
ta: வழக்கு-உணர்வற்ற வகைகள்

source: Category names forced to lowercase |br| For example, "Chest PA" becomes "chest pa"
ta: வகை பெயர்கள் சிறிய எழுத்துக்கு கட்டாயப்படுத்தப்படுகின்றன | br | உதாரணமாக, "மார்பு பா" "மார்பு பா" ஆகிறது

source: Remove category whitespace padding
ta: வகை ஒயிட்ச்பேச் திணிப்பை அகற்று

source: Removes spaces at beginning and end of category |br| names, replaces multiple spaces with single spaces |br| For example, " Chest PA " becomes "Chest PA"
ta: வகையின் தொடக்கத்திலும் முடிவிலும் இடைவெளிகளை நீக்குகிறது | பி | பெயர், பல இடைவெளிகளை ஒற்றை இடங்களுடன் மாற்றவும் | br | உதாரணமாக, "மார்பு பா" "மார்பு பா" ஆகிறது

source: Colour map choice
ta: வண்ண வரைபட தேர்வு

source: One of the available |br| matplotlib colour maps
ta: கிடைக்கக்கூடிய ஒன்று | br | மேட்ப்ளோட்லிப் வண்ண வரைபடங்கள்

source: See the `available colourmaps`_ section
ta: `கிடைக்கக்கூடிய colourmaps`_ பகுதியைப் பார்க்கவும்

source: Chart theme
ta: விளக்கப்படம் கருப்பொருள்

source: One of **Plotly**, **Plotly white**, |br| **Plotly dark**, **presentation**, |br| **ggplot2**, **Seaborn** or |br| **simple white**
ta: ** சூழ்ச்சி **, ** சூழ்ச்சி வெள்ளை **, | br | ** சூழ்ச்சி இருண்ட **, ** விளக்கக்காட்சி **, | br | ** ggplot2 **, ** seaborn ** அல்லது | br | ** எளிய வெள்ளை **

source: Set the Plotly theme to use for the charts. |br| Some `example themed charts`_ are provided below. |br| Examples of all themes on the Plotly themes_ |br| page (external link).
ta: விளக்கப்படங்களுக்கு பயன்படுத்த சூழ்ச்சி கருப்பொருள் அமைக்கவும். | Br | சில `எடுத்துக்காட்டு கருப்பொருள் விளக்கப்படங்கள்`_ கீழே கொடுக்கப்பட்டுள்ளன. | Br | சூழ்ச்சி கருப்பொருளில் உள்ள அனைத்து கருப்பொருள்களின் எடுத்துக்காட்டுகள்_ | br | பக்கம் (வெளிப்புற இணைப்பு).

source: Number of charts per row
ta: ஒரு வரிசையில் விளக்கப்படங்களின் எண்ணிக்கை

source: Value in the range 1 - 10
ta: 1 - 10 வரம்பில் மதிப்பு

source: Sets the number of sub-plots in each row
ta: ஒவ்வொரு வரிசையிலும் துணை அடுக்குகளின் எண்ணிக்கையை அமைக்கிறது

source: Available colourmaps
ta: கிடைக்கும் வண்ணங்கள்

source: Swatch
ta: ச்வாட்ச்

source: Red yellow blue
ta: சிவப்பு மஞ்சள் நீலம்

source: Spectral
ta: நிறமாலை

source: Pink yellow green
ta: இளஞ்சிவப்பு மஞ்சள் பச்சை

source: Purple green
ta: ஊதா பச்சை

source: Brown green
ta: பழுப்பு பச்சை

source: Purple orange
ta: ஊதா ஆரஞ்சு

source: Red blue
ta: சிவப்பு நீலம்

source: Red grey
ta: சிவப்பு சாம்பல்

source: Yellow green blue
ta: மஞ்சள் பச்சை நீலம்

source: Yellow orange brown
ta: மஞ்சள் ஆரஞ்சு பழுப்பு

source: Hot
ta: சூடான

source: Inferno
ta: இன்ஃபெர்னோ

source: Magma
ta: கற்குழம்பு

source: Plasma
ta: மின்மம்

source: Viridis
ta: விரிடிச்

source: Cividis
ta: சிடிச்

source: Some available themes
ta: சில கிடைக்கக்கூடிய கருப்பொருள்கள்

source: The example `Chart types`_ at the top of this document use the default Plotly theme. Below are some examples of other available themes.
ta: இந்த ஆவணத்தின் மேலே உள்ள `விளக்கப்பட வகைகள்`_ எடுத்துக்காட்டு இயல்புநிலை சூழ்ச்சி கருப்பொருளைப் பயன்படுத்துகிறது. கிடைக்கக்கூடிய பிற கருப்பொருள்களின் சில எடுத்துக்காட்டுகள் கீழே.

source: Plotly dark
ta: சூழ்ச்சி இருண்ட

source: Presentation
ta: விளக்கக்காட்சி

source: Simple white
ta: எளிய வெள்ளை

source: Available CT charts
ta: CT விளக்கப்படங்கள் கிடைக்கும்

source: Chart name
ta: விளக்கப்படம் பெயர்

source: Chart type
ta: விளக்கப்பட வகை

source: Acquisition frequency
ta: கையகப்படுத்தல் அதிர்வெண்

source: Bar chart of acquisition protocol frequency
ta: கையகப்படுத்தல் நெறிமுறை அதிர்வெண்ணின் பார் விளக்கப்படம்

source: Acquisition DLP
ta: கையகப்படுத்தல் டி.எல்.பி.

source: Bar chart of average DLP per acquisition protocol |br| Boxplot with data point per acquisition protocol |br| Histograms also plotted if *Calculate histogram data* **on**
ta: கையகப்படுத்தல் நெறிமுறைக்கு சராசரி டி.எல்.பியின் பார் விளக்கப்படம் | பி.ஆர் | கையகப்படுத்தல் நெறிமுறைக்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Acquisition CTDI\ :sub:`vol`
ta: கையகப்படுத்தல் ctdi \: துணை: `vol`

source: Bar chart of average CTDI\ :sub:`vol` per acquisition protocol |br| Boxplot with data point per acquisition protocol |br| Histograms also plotted if *Calculate histogram data* **on**
ta: சராசரி CTDI இன் பார் விளக்கப்படம் \: துணை: `VOL` ஒரு கையகப்படுத்தல் நெறிமுறைக்கு | Br | கையகப்படுத்தல் நெறிமுறைக்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Acquisition DLP over time
ta: காலப்போக்கில் கையகப்படுத்தல் டி.எல்.பி.

source: Line chart of average DLP over time |br| for each acquisition protocol
ta: காலப்போக்கில் சராசரி டி.எல்.பியின் வரி விளக்கப்படம் | br | ஒவ்வொரு கையகப்படுத்தல் நெறிமுறைக்கும்

source: Acquisition CTDI\ :sub:`vol` over time
ta: கையகப்படுத்தல் ctdi \: துணை: `vol` காலப்போக்கில்

source: Line chart of average CTDI\ :sub:`vol` over time |br| for each acquisition protocol
ta: சராசரி CTDI இன் வரி விளக்கப்படம் \: துணை: `VOL` காலப்போக்கில் | br | ஒவ்வொரு கையகப்படுத்தல் நெறிமுறைக்கும்

source: Acquisition DLP vs mass
ta: கையகப்படுத்தல் டி.எல்.பி Vs மாச்

source: Scatter chart of DLP vs patient mass for each acquisition protocol
ta: ஒவ்வொரு கையகப்படுத்தல் நெறிமுறைக்கும் டி.எல்.பி மற்றும் நோயாளி வெகுசனத்தின் சிதறல் விளக்கப்படம்

source: Acquisition CTDI\ :sub:`vol` vs mass
ta: கையகப்படுத்தல் CTDI \: துணை: `vol` vs மாச்

source: Scatter chart of CTDI\ :sub:`vol` vs patient mass for each |br| acquisition protocol
ta: CTDI இன் சிதறல் விளக்கப்படம் \: துணை: `VOL` vs நோயாளி வெகுசனமானது | br | கையகப்படுத்தல் நெறிமுறை

source: Study frequency
ta: ஆய்வு அதிர்வெண்

source: Bar chart of study description frequency
ta: ஆய்வு விளக்க அதிர்வெண்ணின் பார் விளக்கப்படம்

source: Study DLP
ta: டி.எல்.பி.

source: Bar chart of average DLP per study description |br| Boxplot with data point per study description |br| Histograms also plotted if *Calculate histogram data* **on**
ta: ஒரு ஆய்வு விளக்கத்திற்கு சராசரி டி.எல்.பியின் பார் விளக்கப்படம் | br | ஒரு ஆய்வு விளக்கத்திற்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Study CTDI\ :sub:`vol`
ta: CTDI ஐப் படிக்கவும் \: துணை: `vol`

source: Bar chart of average CTDI\ :sub:`vol` per study description |br| Boxplot with data point per study description |br| Histograms also plotted if *Calculate histogram data* **on**
ta: சராசரி CTDI இன் பார் விளக்கப்படம் \: துணை: `VOL` ஒரு ஆய்வு விளக்கத்திற்கு | br | ஒரு ஆய்வு விளக்கத்திற்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Study events
ta: நிகழ்வுகள் ஆய்வு

source: Bar chart of average number of radiation events per study description |br| Boxplot with data point per study description |br| Histograms also plotted if *Calculate histogram data* **on**
ta: ஒரு ஆய்வு விளக்கத்திற்கு சராசரியாக கதிர்வீச்சு நிகழ்வுகளின் பார் விளக்கப்படம் | br | ஒரு ஆய்வு விளக்கத்திற்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Study DLP over time
ta: காலப்போக்கில் டி.எல்.பி.

source: Line chart of average DLP over time |br| for each study description
ta: காலப்போக்கில் சராசரி டி.எல்.பியின் வரி விளக்கப்படம் | br | ஒவ்வொரு ஆய்வு விளக்கத்திற்கும்

source: Study workload
ta: பணிச்சுமை ஆய்வு

source: Bar chart of number of studies carried out on each day of the |br| week, with each bar sub-divided into hours of the day
ta: | Br | இன் ஒவ்வொரு நாளிலும் மேற்கொள்ளப்பட்ட ஆய்வுகளின் எண்ணிக்கையின் பார் விளக்கப்படம் வாரம், ஒவ்வொரு பட்டையும் துணைப் பிரிக்கப்பட்டுள்ளது

source: Requested procedure frequency
ta: கோரப்பட்ட செயல்முறை அதிர்வெண்

source: Bar chart of requested procedure name frequency
ta: கோரப்பட்ட செயல்முறை பெயர் அதிர்வெண்ணின் பார் விளக்கப்படம்

source: Requested procedure DLP
ta: கோரப்பட்ட நடைமுறை டி.எல்.பி.

source: Bar chart of average DLP per requested procedure name |br| Boxplot with data point per study description |br| Histograms also plotted if *Calculate histogram data* **on**
ta: கோரப்பட்ட நடைமுறை பெயருக்கு சராசரி டி.எல்.பியின் பார் விளக்கப்படம் | பி.ஆர் | ஒரு ஆய்வு விளக்கத்திற்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Requested procedure events
ta: கோரப்பட்ட நடைமுறை நிகழ்வுகள்

source: Bar chart of average number of radiation events per requested procedure name |br| Boxplot with data point per study description |br| Histograms also plotted if *Calculate histogram data* **on**
ta: கோரப்பட்ட செயல்முறை பெயருக்கு சராசரி கதிர்வீச்சு நிகழ்வுகளின் எண்ணிக்கையின் பார் விளக்கப்படம் | br | ஒரு ஆய்வு விளக்கத்திற்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Requested procedure DLP over time
ta: காலப்போக்கில் கோரப்பட்ட நடைமுறை டி.எல்.பி.

source: Available radiographic charts
ta: கிடைக்கக்கூடிய ரேடியோகிராஃபிக் விளக்கப்படங்கள்

source: Acquisition DAP
ta: கையகப்படுத்தல் டிஏபி

source: Bar chart of average DAP per acquisition protocol |br| Boxplot with data point per acquisition protocol |br| Histograms also plotted if *Calculate histogram data* **on**
ta: கையகப்படுத்தல் நெறிமுறைக்கு சராசரி DAP இன் பார் விளக்கப்படம் | Br | கையகப்படுத்தல் நெறிமுறைக்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Acquisition mAs
ta: கையகப்படுத்தல் மாச்

source: Bar chart of average mAs per acquisition protocol |br| Boxplot with data point per acquisition protocol |br| Histograms also plotted if *Calculate histogram data* **on**
ta: கையகப்படுத்தல் நெறிமுறைக்கு சராசரி MAS இன் பார் விளக்கப்படம் | Br | கையகப்படுத்தல் நெறிமுறைக்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Acquisition kVp
ta: கையகப்படுத்தல் கே.வி.பி.

source: Bar chart of average kVp per acquisition protocol |br| Boxplot with data point per acquisition protocol |br| Histograms also plotted if *Calculate histogram data* **on**
ta: கையகப்படுத்தல் நெறிமுறைக்கு சராசரி KVP இன் பார் விளக்கப்படம் | Br | கையகப்படுத்தல் நெறிமுறைக்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Acquisition DAP over time
ta: காலப்போக்கில் கையகப்படுத்தல் DAP

source: Line chart of average DAP over time |br| for each acquisition protocol
ta: காலப்போக்கில் சராசரி DAP இன் வரி விளக்கப்படம் | br | ஒவ்வொரு கையகப்படுத்தல் நெறிமுறைக்கும்

source: Acquisition mAs over time
ta: காலப்போக்கில் கையகப்படுத்தல் மாச்

source: Line chart of average mAs over time |br| for each acquisition protocol
ta: காலப்போக்கில் சராசரி மாசின் வரி விளக்கப்படம் | br | ஒவ்வொரு கையகப்படுத்தல் நெறிமுறைக்கும்

source: Acquisition kVp over time
ta: காலப்போக்கில் KVP கையகப்படுத்தல்

source: Line chart of average kVp over time |br| for each acquisition protocol
ta: காலப்போக்கில் சராசரி KVP இன் வரி விளக்கப்படம் | br | ஒவ்வொரு கையகப்படுத்தல் நெறிமுறைக்கும்

source: Acquisition DAP vs mass
ta: கையகப்படுத்தல் DAP Vs மாச்

source: Scatter chart of DAP vs patient mass |br| for each acquisition protocol
ta: DAP Vs நோயாளி வெகுசனத்தின் சிதறல் விளக்கப்படம் | br | ஒவ்வொரு கையகப்படுத்தல் நெறிமுறைக்கும்

source: Study DAP
ta: ஆய்வு DAP

source: Bar chart of average DAP per study description |br| Boxplot with data point per study description |br| Histograms also plotted if *Calculate histogram data* **on**
ta: ஒரு ஆய்வு விளக்கத்திற்கு சராசரி DAP இன் பார் விளக்கப்படம் | br | ஒரு ஆய்வு விளக்கத்திற்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Study DAP vs mass
ta: ஆய்வு DAP Vs மாச்

source: Scatter chart of DAP vs patient mass for each study description
ta: ஒவ்வொரு ஆய்வு விளக்கத்திற்கும் டிஏபி மற்றும் நோயாளி வெகுசனத்தின் சிதறல் விளக்கப்படம்

source: Requested procedure DAP
ta: கோரப்பட்ட நடைமுறை DAP

source: Bar chart of average DAP per requested procedure name |br| Boxplot with data point per study description |br| Histograms also plotted if *Calculate histogram data* **on**
ta: கோரப்பட்ட நடைமுறை பெயருக்கு சராசரி DAP இன் பார் விளக்கப்படம் | br | ஒரு ஆய்வு விளக்கத்திற்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Requested procedure DAP vs mass
ta: கோரப்பட்ட நடைமுறை DAP Vs மாச்

source: Scatter chart of DAP vs patient mass |br| for each requested procedure name
ta: DAP Vs நோயாளி வெகுசனத்தின் சிதறல் விளக்கப்படம் | br | கோரப்பட்ட ஒவ்வொரு நடைமுறை பெயருக்கும்

source: Available fluoroscopy charts
ta: கிடைக்கும் ஃப்ளோரோச்கோபி விளக்கப்படங்கள்

source: Study DAP over time
ta: காலப்போக்கில் DAP ஐப் படிக்கவும்

source: Line chart of average DAP over time |br| for each study description
ta: காலப்போக்கில் சராசரி DAP இன் வரி விளக்கப்படம் | br | ஒவ்வொரு ஆய்வு விளக்கத்திற்கும்

source: Requested procedure DAP over time
ta: காலப்போக்கில் கோரப்பட்ட நடைமுறை DAP

source: Available mammography charts
ta: கிடைக்கும் மேமோகிராஃபி விளக்கப்படங்கள்

source: Acquisition AGD
ta: கையகப்படுத்தல் AGD

source: Bar chart of average AGDP per acquisition protocol |br| Boxplot with data point per acquisition protocol |br| Histograms also plotted if *Calculate histogram data* **on**
ta: கையகப்படுத்தல் நெறிமுறைக்கு சராசரி AGDP இன் பார் விளக்கப்படம் | Br | கையகப்படுத்தல் நெறிமுறைக்கு தரவு புள்ளியுடன் பாக்ச் பிளாட் | br | ** இல் இச்டோகிராம் தரவை*** கணக்கிட்டால் இச்டோகிராம்களும் திட்டமிடப்பட்டுள்ளன

source: Acquisition average AGD vs thickness
ta: கையகப்படுத்தல் சராசரி AGD Vs தடிமன்

source: Bar chart of average AGD for each of the following nine compressed |br| breast thickness bands: |br| min ≤ x < 20; 20 ≤ x < 30; 30 ≤ x < 40; 40 ≤ x < 50; 50 ≤ x < 60; |br| 60 ≤ x < 70; 70 ≤ x < 80; 80 ≤ x < 90; 90 ≤ x < max
ta: பின்வரும் ஒன்பது சுருக்கப்பட்ட ஒவ்வொன்றிற்கும் சராசரி AGD இன் பார் விளக்கப்படம் | Br | மார்பக தடிமன் பட்டைகள்: | br | மணித்துளி ≤ ஃச் <20; 20 ≤ ஃச் <30; 30 ≤ ஃச் <40; 40 ≤ ஃச் <50; 50 ≤ ஃச் <60; | Br | 60 ≤ ஃச் <70; 70 ≤ ஃச் <80; 80 ≤ ஃச் <90; 90 ≤ ஃச் <அதிகபட்சம்

source: Acquisition AGD over time
ta: காலப்போக்கில் கையகப்படுத்தல் AGD

source: Line chart of average AGD over time |br| for each acquisition protocol
ta: காலப்போக்கில் சராசரி AGD இன் வரி விளக்கப்படம் | br | ஒவ்வொரு கையகப்படுத்தல் நெறிமுறைக்கும்

source: Acquisition AGD vs thickness
ta: கையகப்படுத்தல் AGD Vs தடிமன்

source: Scatter chart of AGD vs compressed breast thickness |br| for each acquisition protocol
ta: AGD Vs சுருக்கப்பட்ட மார்பக தடிமன் சிதறல் விளக்கப்படம் | br | ஒவ்வொரு கையகப்படுத்தல் நெறிமுறைக்கும்

source: Acquisition mAs vs thickness
ta: கையகப்படுத்தல் MAS Vs தடிமன்

source: Scatter chart of mAs vs compressed breast thickness |br| for each acquisition protocol
ta: MAS Vs சுருக்கப்பட்ட மார்பக தடிமன் சிதறல் விளக்கப்படம் | br | ஒவ்வொரு கையகப்படுத்தல் நெறிமுறைக்கும்

source: Acquisition kVp vs thickness
ta: கையகப்படுத்தல் KVP Vs தடிமன்

source: Scatter chart of kVp vs compressed breast thickness |br| for each acquisition protocol
ta: KVP Vs சுருக்கப்பட்ட மார்பக தடிமன் சிதறல் விளக்கப்படம் | Br | ஒவ்வொரு கையகப்படுத்தல் நெறிமுறைக்கும்

source: Available nuclear medicine charts
ta: கிடைக்கக்கூடிய அணு மருத்துவ விளக்கப்படங்கள்

source: Study description workload
ta: ஆய்வு விவரம் பணிச்சுமை

source: Bar chart of number of studies carried out on each |br| day of the week, with each bar sub-divided |br| into hours of the day
ta: ஒவ்வொன்றிலும் மேற்கொள்ளப்பட்ட ஆய்வுகளின் எண்ணிக்கையின் பார் விளக்கப்படம் | br | வாரத்தின் நாள், ஒவ்வொரு பட்டையிலும் துணை பிரிக்கப்பட்ட | br | நாளின் மணிநேரங்களுக்குள்

source: Injected dose per study
ta: ஒரு ஆய்வுக்கு செலுத்தப்பட்ட டோச்

source: Bar chart or boxplot of average injected dose per |br| study description. If calculate histogram is |br| enabled creates a histogram of injected dose
ta: பார் விளக்கப்படம் அல்லது பாக்ச் பிளாட் ஒரு சராசரி உட்செலுத்தப்பட்ட டோச் | br | ஆய்வு விளக்கம். இச்டோகிராம் கணக்கிட்டால் | br | இயக்கப்பட்டவை செலுத்தப்பட்ட டோசின் இச்டோகிராம் உருவாக்குகிறது

source: Injected dose over time
ta: காலப்போக்கில் செலுத்தப்பட்ட டோச்

source: Bar chart or boxplot of injected dose per study |br| description over time
ta: பட்டி விளக்கப்படம் அல்லது ஒரு ஆய்வுக்கு செலுத்தப்பட்ட டோசின் பாக்ச் பிளாட் | br | காலப்போக்கில் விளக்கம்

source: Injected dose over weight
ta: எடைக்கு மேல் செலுத்தப்பட்ட டோச்

source: Show a scatter plot of injected dose versus |br| patient weight
ta: | Br | க்கு எதிராக செலுத்தப்பட்ட டோசின் சிதறல் சதித்திட்டத்தைக் காட்டு நோயாளியின் எடை

source: Developers
ta: உருவாக்குநர்கள்

source: Contents:
ta: பொருளடக்கம்:

source: Indices and tables
ta: குறியீடுகள் மற்றும் அட்டவணைகள்

source: :ref:`genindex`
ta: : ref: `செனின்டெக்ச்`

source: :ref:`search`
ta: : ref: `தேடல்`

source: Adding new charts
ta: புதிய விளக்கப்படங்களைச் சேர்ப்பது

source: To add a new chart several files need to be updated:
ta: புதிய விளக்கப்படத்தைச் சேர்க்க பல கோப்புகள் புதுப்பிக்கப்பட வேண்டும்:

source: ``forms.py``
ta: `` படிவங்கள்

source: Where xx is one of ``ct``, ``dx``, ``mg`` or ``rf``
ta: XX என்பது `` ct``, `` dx``, `` mg`` அல்லது `` rf``

source: The additions to the files add:
ta: கோப்புகளில் சேர்த்தல் சேர்க்கவும்:

source: database fields in the user profile to control whether the new charts are plotted (``models.py``)
ta: புதிய விளக்கப்படங்கள் திட்டமிடப்பட்டுள்ளதா என்பதைக் கட்டுப்படுத்த பயனர் சுயவிவரத்தில் தரவுத்தள புலங்கள் (`` model.py``)

source: new options on the chart plotting forms (``forms.py``, ``displaychartoptions.html``)
ta: விளக்கப்படம் சூழ்ச்சி படிவங்களில் புதிய விருப்பங்கள் (`` படிவங்கள்.
