Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: :issue:`9` Issue tracking import using \*.dcm style wildcards reopened as Windows ``cmd.exe`` shell doesn't do wildcard expansion, so this will need to be handled by OpenREM in a future version
ta: :issue:`9` சிக்கல் tracking இறக்குமதி using \*.dcm சூல் தண்டு wildcards reopened அச் சாளரங்கள் ``cmd.exe`` ஓடு doesn't do wildcard expansion, so this will need பெறுநர் be handled by OpenREM in a future version

source: :issue:`83` Fix for bug introduced in :issue:`73` that prevents the import scripts from working.
ta: :issue:`83` Fix க்கு பிழை introduced in :issue:`73` that prevents the இறக்குமதி scripts இருந்து working.

source: :issue:`82` Added instructions for adding users to the release notes
ta: : வெளியீடு: `82` வெளியீட்டுக் குறிப்புகளில் பயனர்களைச் சேர்ப்பதற்கான வழிமுறைகள் சேர்க்கப்பட்டுள்ளன

source: :issue:`65` includes changes to the settings file which **require settings information to be copied** and files moved/renamed - see `version 0.4.0 release notes <https://docs.openrem.org/page/release-0.4.0.html>`_
ta: . வெளியீடு -0.4.0.html> `_

source: :issue:`80` Added docs for installing Apache with auto-start on Windows Server 2012. Contributed by JA Cole
ta: :issue:`80` Added கோப்புகள் க்கு installing Apache with auto-start on சாளரங்கள் சேவையகம் 2012. Contributed by JA Cole

source: :issue:`79` Updated README.rst instructions
ta: : வெளியீடு: `79` புதுப்பிக்கப்பட்ட README.RST வழிமுறைகள்

source: :issue:`78` Moved upgrade documentation into the release notes page
ta: : வெளியீடு: `78` வெளியீட்டுக் குறிப்புகள் பக்கத்தில் ஆவணங்களை மேம்படுத்தியது

source: :issue:`77` Removed docs builds from repository
ta: : வெளியீடு: `77` அகற்றப்பட்ட ஆவணங்கள் களஞ்சியத்திலிருந்து உருவாக்கப்படுகின்றன

source: :issue:`76` Fixed crash if exporting from development environment
ta: : வெளியீடு: வளர்ச்சி சூழலில் இருந்து ஏற்றுமதி செய்தால் `76` நிலையான விபத்து

source: :issue:`75` Fixed bug where requested procedure wasn't being captured on one modality
ta: :issue:`75` Fixed பிழை where requested procedure wasn't being captured on one modality

source: :issue:`73` Made launch scripts and ptsizecsv2db more robust
ta: : வெளியீடு: `73` வெளியீட்டு ச்கிரிப்ட்கள் மற்றும் PTSIZECSV2DB இன்னும் வலுவானது

source: :issue:`72` Moved the secret key into the local documentation and added instructions to change it to release notes and install instructions
ta: : வெளியீடு: `72` ரகசிய விசையை உள்ளக ஆவணங்களுக்கு நகர்த்தியது மற்றும் குறிப்புகளை மாற்றுவதற்கும் வழிமுறைகளை நிறுவுவதற்கும் வழிமுறைகளைச் சேர்த்தது

source: :issue:`71` Added information about configuring users to the install documentation
ta: :issue:`71` Added செய்தி பற்றி configuring பயனர்கள் பெறுநர் the install ஆவணப்படுத்துதல்

source: :issue:`69` Added documentation about the new delete study function
ta: : வெளியீடு: `69` புதிய நீக்குதல் ஆய்வு செயல்பாடு குறித்த ஆவணங்கள் சேர்க்கப்பட்டன

source: :issue:`68` Now checks sequence code meaning and value exists before assigning them. Thanks to JA Cole
ta: : வெளியீடு: `68` இப்போது வரிசை குறியீடு அர்த்தத்தையும் மதிப்பையும் சரிபார்க்கிறது. சா கோலுக்கு நன்றி

source: :issue:`67` Added 'Contributing authors' section of documentation
ta: : வெளியீடு: `67` சேர்க்கப்பட்டது 'பங்களிப்பு ஆசிரியர்கள்' ஆவணத்தின் பிரிவு

source: :issue:`66` Added 'Release notes' section of documentation, incuding this file
ta: :issue:`66` Added 'Release notes' பிரிவு of documentation, incuding this கோப்பு

source: :issue:`65` Added new ``local_settings.py`` file for database settings and other local settings
ta: :issue:`65` Added புதிய ``local_settings.py`` கோப்பு க்கு database அமைப்புகள் and மற்றொன்று local அமைப்புகள்

source: :issue:`64` Fixed imports failing due to non-conforming strings that were too long
ta: : வெளியீடு: `64` இணங்காத சரங்கள் காரணமாக நிலையான இறக்குமதிகள் தோல்வியடைகின்றன

source: :issue:`63` The mammography import code stored the date of birth unnecessarily. Also now gets decimal_age from age field if necessary
ta: : வெளியீடு: `63` மேமோகிராஃபி இறக்குமதி குறியீடு பிறந்த தேதியை தேவையின்றி சேமித்தது. தேவைப்பட்டால் இப்போது வயதிலிருந்து தசம_சேச் பெறுகிறது

source: :issue:`60` Removed extraneous colon from interface data field
ta: : வெளியீடு: `60` இடைமுக தரவு புலத்திலிருந்து புறம்பான பெருங்குடல் அகற்றப்பட்டது

source: :issue:`18` Studies can now be deleted from the web interface with the correct login
ta: : வெளியீடு: `18` ஆய்வுகள் இப்போது வலை இடைமுகத்திலிருந்து சரியான உள்நுழைவுடன் நீக்கப்படலாம்

source: :issue:`16` Added user authentication with different levels of access
ta: : வெளியீடு: `16` வெவ்வேறு நிலை அணுகலுடன் பயனர் அங்கீகாரத்தை சேர்க்கப்பட்டது

source: :issue:`9` Enable import of ``*.dcm``
ta: : வெளியீடு: `9`` `*.dcm`` ஐ இறக்குமதி செய்யுங்கள்

source: :issue:`51` includes changes to the database schema -- make sure South is in use before upgrading. See https://docs.openrem.org/page/upgrade.html
ta: : வெளியீடு: `51` தரவுத்தளத் திட்டத்தில் மாற்றங்களை உள்ளடக்கியது - மேம்படுத்துவதற்கு முன்பு தெற்கு பயன்பாட்டில் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். Https://docs.openrem.org/page/upgrade.html ஐப் பார்க்கவும்

source: :issue:`59` CSS stylesheet referenced particular fonts that are not in the distribution -- references removed
ta: : வெளியீடு: `59` சிஎச்எச் ச்டைல்சீட் விநியோகத்தில் இல்லாத குறிப்பிட்ட எழுத்துருக்களைக் குறிப்பிடுகிறது - குறிப்புகள் அகற்றப்பட்டன

source: :issue:`58` Export to xlsx more robust - limitation of 31 characters for sheet names now enforced
ta: : வெளியீடு: `58` xlsx க்கு ஏற்றுமதி மேலும் வலுவானது - இப்போது செயல்படுத்தப்பட்ட தாள் பெயர்களுக்கு 31 எழுத்துக்களின் வரம்பு

source: :issue:`57` Modified the docs slightly to include notice to convert to South before upgrading
ta: : வெளியீடு: `57` மேம்படுத்துவதற்கு முன் தெற்கே மாற்றுவதற்கான அறிவிப்பைச் சேர்க்க டாக்சை சற்று மாற்றியமைத்தது

source: :issue:`56` Corrected the mammography target and filter options added for issue :issue:`44`
ta: :issue:`56` Corrected the mammography target and வடிப்பி விருப்பங்கள் added க்கு சிக்கல் :issue:`44`

source: :issue:`53` Dates can now be selected from a date picker widget for filtering studies
ta: : வெளியீடு: `53` தேதிகளை இப்போது வடிகட்டுதல் ஆய்வுகளுக்கான தேதி பிக்கர் விட்செட்டிலிருந்து தேர்ந்தெடுக்கலாம்

source: :issue:`52` Split the date field into two so either, both or neither can be specified
ta: : வெளியீடு: `52` தேதி புலத்தை இரண்டாகப் பிரிக்கவும், எனவே, இரண்டையும் அல்லது இரண்டையும் குறிப்பிட முடியாது

source: :issue:`51` Remove import modifications from issue :issue:`28` and :issue:`43` now that exports are filtered in a better way after :issue:`48` and :issue:`49` changes.
ta: :issue:`51` அகற்று இறக்குமதி modifications இருந்து சிக்கல் :issue:`28` and :issue:`43` now that exports அரே filtered in a better way after :issue:`48` and :issue:`49` changes.

source: :issue:`50` No longer necessary to apply a filter before exporting -- docs changed to reflect this
ta: : வெளியீடு: ஏற்றுமதி செய்வதற்கு முன் வடிப்பானைப் பயன்படுத்துவதற்கு `50` இனி தேவையில்லை - இதைப் பிரதிபலிக்கும் வகையில் டாக்ச் மாற்றப்பட்டது

source: :issue:`49` CSV exports changed to use the same filtering routine introduced for :issue:`48` to better handle missing attributes
ta: :issue:`49` காபிம exports changed பெறுநர் use the same filtering routine introduced க்கு :issue:`48` பெறுநர் better கைப்பிடி missing attributes

source: :issue:`48` New feature -- can now filter by patient age. Improved export to xlsx to better handle missing attributes
ta: : வெளியீடு: `48` புதிய நற்பொருத்தம் - இப்போது நோயாளியின் அகவை மூலம் வடிகட்டலாம். காணாமல் போன பண்புகளை சிறப்பாக கையாள எக்ச்எல்எச்எக்ச் -க்கு மேம்படுத்தப்பட்ட ஏற்றுமதி

source: :issue:`47` Install was failing on pydicom -- fixed upstream
ta: : வெளியீடு: `47` நிறுவல் பைடிகாமில் தோல்வியுற்றது - அப்ச்ட்ரீமில் சரி செய்யப்பட்டது

source: -- File layout modified to conform to norms
ta: - விதிமுறைகளுக்கு இணங்க கோப்பு தளவமைப்பு மாற்றப்பட்டது

source: :issue:`46` Updated documentation to reflect limited testing of mammo import on additional modalities
ta: : வெளியீடு: `46` கூடுதல் முறைகளில் மம்மோ இறக்குமதியின் வரையறுக்கப்பட்ட சோதனையை பிரதிபலிக்க புதுப்பிக்கப்பட்ட ஆவணங்கள்

source: :issue:`45` mam.py was missing the licence header - fixed
ta: : வெளியீடு: `45` MAM.Py உரிமத் தலைப்பைக் காணவில்லை - சரி செய்யப்பட்டது

source: :issue:`44` Added Tungsten, Silver and Aluminum to mammo target/filter strings to match -- thanks to DJ Platten for strings
ta: :issue:`44` Added Tungsten, வெள்ளி and Aluminum பெறுநர் mammo target/filter சரங்கள் பெறுநர் match -- thanks பெறுநர் DJ Platten க்கு சரங்கள்

source: :issue:`43` Mammography and Philips CT import and export now more robust for images with missing information such as accession number and collimated field size
ta: : வெளியீடு: `43` மேமோகிராபி மற்றும் பிலிப்ச் சி.டி.

source: :issue:`42` Documentation updated to reflect :issue:`37`
ta: : வெளியீடு: `42` ஆவணங்கள் பிரதிபலிக்க புதுப்பிக்கப்பட்டன: வெளியீடு:` 37`

source: :issue:`37` Studies now sort by time and date
ta: : வெளியீடு: `37` ஆய்வுகள் இப்போது நேரம் மற்றும் தேதியின்படி வரிசைப்படுத்துகின்றன

source: :issue:`40` Restyled the filter section in the web interface and added a title to that section
ta: : வெளியீடு: `40` வலை இடைமுகத்தில் வடிகட்டி பகுதியை மறுசீரமைத்து, அந்த பகுதிக்கு ஒரு தலைப்பை சேர்த்தது

source: :issue:`38` Column titles tidied up in Excel exports
ta: : வெளியீடு: `38` நெடுவரிசை தலைப்புகள் எக்செல் ஏற்றுமதியில் நேர்த்தியானவை

source: :issue:`36` openrem_ptsizecsv output of log now depends on verbose flag
ta: : வெளியீடு: `36` OpenRem_PTSIZECSV பதிவின் வெளியீடு இப்போது வாய்மொழி கொடியைப் பொறுத்தது

source: :issue:`35` Numbers no longer stored as text in Excel exports
ta: : வெளியீடு: `35` எண்கள் எக்செல் ஏற்றுமதியில் உரையாக சேமிக்கப்படாது

source: :issue:`34` Localised scripts that were on remote web servers in default Bootstrap code
ta: : வெளியீடு: இயல்புநிலை தொடக்கவார் குறியீட்டில் தொலை வலை சேவையகங்களில் இருந்த `34` உள்ளூர்மயமாக்கப்பட்ட ச்கிரிப்ட்கள்

source: :issue:`33` Documentation now exists for adding data via csv file
ta: : வெளியீடு: சி.எச்.வி கோப்பு வழியாக தரவைச் சேர்ப்பதற்கான `33` ஆவணங்கள் இப்போது உள்ளன

source: :issue:`24` Web interface has been upgraded to Bootstrap v3
ta: : வெளியீடு: `24` வலை இடைமுகம் தொடக்கவார் வி 3 க்கு மேம்படுத்தப்பட்டுள்ளது

source: :issue:`5` Web interface and export function now have some documentation with screenshots
ta: : வெளியீடு: `5` வலை இடைமுகம் மற்றும் ஏற்றுமதி செயல்பாடு இப்போது திரை சாட்களுடன் சில ஆவணங்களைக் கொண்டுள்ளது

source: 0.3.5-rc2 (2014-02-17)
ta: 0.3.5-CR2 (2014-02-17)

source: :issue:`32` Missing sys import bug prevented new patient size import from working
ta: : வெளியீடு: `32` காணாமல் போன SYS இறக்குமதி பிழை புதிய நோயாளி அளவு இறக்குமதியை வேலை செய்வதிலிருந்து தடுத்தது

source: -- Prettified this document!
ta: - இந்த ஆவணத்தை முன்னூட்டியது!

source: :issue:`31` Promoted patient size import from csv function to the scripts folder so it will install and can be called from the path
ta: :issue:`31` Promoted patient அளவு இறக்குமதி இருந்து காபிம சார்பு பெறுநர் the scripts folder so it will install and can be called இருந்து the பாதை

source: :issue:`30` Improved patient size import from csv to allow for arbitary column titles and study instance UID in addition to accession number.
ta: :issue:`30` Improved patient அளவு இறக்குமதி இருந்து காபிம பெறுநர் allow க்கு arbitary நெடுவரிசை titles and study instance UID in கூட்டல் பெறுநர் accession number.

source: :issue:`29` Corrected the docs URL in the readme
ta: : வெளியீடு: `29` README இல் உள்ள கோப்புகள் முகவரி ஐ சரிசெய்தது

source: 0.3.4-rc2 (2014-02-14)
ta: 0.3.4-CR2 (2014-02-14)

source: :issue:`28` XLSX export crashed if any of the filter fields were missing. Now fills on import with 'None'
ta: : வெளியீடு: வடிகட்டி புலங்கள் ஏதேனும் காணவில்லை என்றால் `28` எக்ச்எல்எச்எக்ச் ஏற்றுமதி செயலிழந்தது. இப்போது 'எதுவுமில்லை' மூலம் இறக்குமதியை நிரப்புகிறது

source: :issue:`27` Use requested procedure description if requested procedure code description is missing
ta: : வெளியீடு: `27` கோரப்பட்ட நடைமுறை விளக்கத்தைப் பயன்படுத்தவும் கோரப்பட்ட நடைமுறை குறியீடு விளக்கம் இல்லை என்றால்

source: -- General improvements and addition of logo to docs
ta: - பொதுவான மேம்பாடுகள் மற்றும் டாக்சில் லோகோவைச் சேர்ப்பது

source: :issue:`23` Added Windows XP MySQL backup guide to docs
ta: :issue:`23` Added சாளரங்கள் XP MySQL backup guide பெறுநர் கோப்புகள்

source: :issue:`22` Added running Conquest as a Windows XP service to docs
ta: : வெளியீடு: `22` டாக்சுக்கு சாளரங்கள் எக்ச்பி சேவையாக வெற்றியை இயக்கியது

source: :issue:`15` Added version number and copyright information to xlsx exports
ta: : வெளியீடு: `15` எக்ச்எல்எச்எக்ச் ஏற்றுமதியில் பதிப்பு எண் மற்றும் பதிப்புரிமை தகவல்களைச் சேர்த்தது

source: :issue:`14` Added version number to the web interface
ta: : வெளியீடு: `14` வலை இடைமுகத்தில் பதிப்பு எண்ணை சேர்க்கப்பட்டது

source: :issue:`13` Improve the docs with respect to South database migrations
ta: : வெளியீடு: `13` தெற்கு தரவுத்தள இடம்பெயர்வுகள் தொடர்பாக டாக்சை மேம்படுத்தவும்

source: :issue:`12` Added this version history
ta: : வெளியீடு: `12` இந்த பதிப்பு வரலாற்றைச் சேர்த்தது

source: :issue:`11` Documentation is no longer included in the tar.gz install file -- see http://openrem.trfd.org instead
ta: : வெளியீடு: `11` ஆவணங்கள் இனி tar.gz நிறுவல் கோப்பில் சேர்க்கப்படவில்லை - அதற்கு பதிலாக http://openrem.trfd.org ஐப் பார்க்கவும்

source: Installs of OpenREM earlier than 0.3.3 will break on upgrade if the scripts are called from other programs. For example openrem_rdsr is now called openrem_rdsr.py
ta: மற்ற நிரல்களிலிருந்து ச்கிரிப்ட்கள் அழைக்கப்பட்டால் 0.3.3 ஐ விட முன்னதாக ஓபன்ரெமின் நிறுவல்கள் மேம்படுத்தலில் உடைந்து விடும். எடுத்துக்காட்டாக OpenREM_RDSR இப்போது OpenRem_rdsr.py என்று அழைக்கப்படுகிறது

source: -- Added warning of upgrade breaking existing installs to docs
ta: - டாக்சில் ஏற்கனவே உள்ள நிறுவல்களை மேம்படுத்துவதற்கான எச்சரிக்கை சேர்க்கப்பட்டது

source: :issue:`10` Added .py suffix to the scripts to allow them to be executed on Windows (thanks to DJ Platten)
ta: : வெளியீடு: `10` சேர்க்கப்பட்டது. ச்கிரிப்ட்களுக்கு சாளரங்களில் செயல்படுத்த அனுமதிக்க.

source: :issue:`8` Removed superfluous '/' in base html file, harmless on linux, prevented Windows loading stylesheets (thanks to DJ Platten)
ta: :issue:`8` Removed superfluous '/' in காரம் உஉகுமொ file, harmless on linux, prevented சாளரங்கள் loading stylesheets (thanks பெறுநர் DJ Platten)

source: :issue:`7` Added windows and linux path examples for test SQLite database creation
ta: : வெளியீடு: `7` சோதனை SQLITE தரவுத்தள உருவாக்கத்திற்கான சாளரங்கள் மற்றும் லினக்ச் பாதை எடுத்துக்காட்டுகளைச் சேர்த்தது

source: :issue:`6` Corrected renaming of example files installation instruction (thanks to DJ Platten)
ta: : வெளியீடு: `6` சரிசெய்யப்பட்ட எடுத்துக்காட்டு கோப்புகள் நிறுவல் வழிமுறையை மறுபெயரிடுதல் (டி.சே.

source: :issue:`4` Added some text to the documentation relating to importing files to OpenREM
ta: : வெளியீடு: `4` ஓபன்ரெமுக்கு கோப்புகளை இறக்குமதி செய்வது தொடர்பான ஆவணங்களில் சில உரையைச் சேர்த்தது

source: :issue:`3` Corrected copyright notice in documentation
ta: : வெளியீடு: `3` ஆவணத்தில் பதிப்புரிமை அறிவிப்பை சரிசெய்தது

source: Initial version uploaded to bitbucket.org
ta: ஆரம்ப பதிப்பு Bitbucket.org இல் பதிவேற்றப்பட்டது

source: Charts
ta: விளக்கப்படங்கள்

source: From OpenREM version 1.0.0+ charts use the Plotly_ open source Python library.
ta: OpenRem பதிப்பு 1.0.0+ விளக்கப்படங்களிலிருந்து Platly_ திறந்த மூல பைதான் நூலகத்தைப் பயன்படுத்தவும்.

source: Chart types
ta: விளக்கப்பட வகைகள்

source: The charts below are examples of the types of chart included in OpenREM version 1.0.0+. The examples are fully interactive in the same way as the charts included in a live OpenREM system. The data contained in the example charts is synthetic.
ta: ஓபன்ரெம் பதிப்பு 1.0.0+ இல் சேர்க்கப்பட்டுள்ள விளக்கப்பட வகைகளின் எடுத்துக்காட்டுகள் கீழேயுள்ள விளக்கப்படங்கள். நேரடி ஓபன்ரெம் அமைப்பில் சேர்க்கப்பட்டுள்ள விளக்கப்படங்களைப் போலவே எடுத்துக்காட்டுகள் முழுமையாக ஊடாடும். எடுத்துக்காட்டு விளக்கப்படங்களில் உள்ள தரவு செயற்கை.

source: Single-clicking on a legend entry toggles the display of that series. Double-clicking on a legend entry hides all but that series; double-click again to show all series.
ta: ஒரு புராணக்கதையில் ஒற்றை சொடுக்கு செய்வது அந்தத் தொடரின் காட்சியை மாற்றுகிறது. ஒரு புராணக்கதை பதிவில் இருமுறை சொடுக்கு செய்வது அந்தத் தொடரைத் தவிர மற்ற அனைத்தையும் மறைக்கிறது; அனைத்து தொடர்களையும் காட்ட மீண்டும் இருமுறை சொடுக்கு செய்யவும்.

source: Hovering the cursor over a chart causes the chart menu to appear along the top right corner. From the menu you can:
ta: ஒரு விளக்கப்படத்தின் மீது கர்சரைச் சுற்றுவது விளக்கப்பட பட்டியல் மேல் வலது மூலையில் தோன்றும். மெனுவிலிருந்து உங்களால் முடியும்:

source: save a bitmap version of the chart
ta: விளக்கப்படத்தின் பிட்மேப் பதிப்பை சேமிக்கவும்

source: set zoom, pan and selection options
ta: சூம், பான் மற்றும் தேர்வு விருப்பங்களை அமைக்கவும்

source: autoscale the chart
ta: தன்னியக்க விளக்கப்படம்

source: reset the axes, and also reset the regions
ta: அச்சுகளை மீட்டமைக்கவும், பிராந்தியங்களையும் மீட்டமைக்கவும்

source: toggle spike lines to graphically illustrate x- and y-axis data values on hover
ta: ஓவரில் எக்ச்- மற்றும் ஒய்-அச்சு தரவு மதிப்புகளை வரைபடமாக விளக்குவதற்கு ச்பைக் வரிகளை மாற்றவும்

source: choose whether to show the closest data when hovering, or to compare data on hover
ta: வட்டமிடும் போது மிக நெருக்கமான தரவைக் காண்பிக்க வேண்டுமா, அல்லது ஓவரில் தரவை ஒப்பிட வேண்டுமா என்பதைத் தேர்வுசெய்க

source: Bar chart of average values across categories
ta: வகைகளில் சராசரி மதிப்புகளின் பார் விளக்கப்படம்

source: These can be configured to show mean or median data. The example below shows the median DAP for each requested procedure name containing the word "knee" across eight x-ray rooms.
ta: சராசரி அல்லது சராசரி தரவைக் காட்ட இவை கட்டமைக்கப்படலாம். எட்டு எக்ச்ரே அறைகள் முழுவதும் "முழங்கால்" என்ற வார்த்தையைக் கொண்ட ஒவ்வொரு கோரப்பட்ட செயல்முறை பெயருக்கும் சராசரி டிஏபி கீழே உள்ள எடுத்துக்காட்டு காட்டுகிறது.

source: When viewing a chart of this type in OpenREM, the chart data can be downloaded as a csv file by clicking the *Download csv* button displayed below the chart. This feature is not available for the example charts in this document.
ta: OpenREM இல் இந்த வகையின் விளக்கப்படத்தைப் பார்க்கும்போது, ​​விளக்கப்படத்திற்கு கீழே காட்டப்பட்டுள்ள * பதிவிறக்கம் காபிம * பொத்தானைக் சொடுக்கு செய்வதன் மூலம் விளக்கப்படத் தரவை காபிம கோப்பாக பதிவிறக்கம் செய்யலாம். இந்த ஆவணத்தில் எடுத்துக்காட்டு விளக்கப்படங்களுக்கு இந்த நற்பொருத்தம் கிடைக்கவில்லை.

source: Hovering the cursor over a bar shows the:
ta: கர்சரை ஒரு பட்டியின் மீது இழுப்பது காட்டுகிறது:

source: x-ray room name
ta: எக்ச்ரே அறை பெயர்

source: requested procedure name
ta: கோரப்பட்ட நடைமுறை பெயர்

source: median DAP for that room and procedure
ta: அந்த அறை மற்றும் நடைமுறைக்கு சராசரி டிஏபி

source: number of requests for that room and procedure
ta: அந்த அறை மற்றும் நடைமுறைக்கான கோரிக்கைகளின் எண்ணிக்கை

source: Boxplot of values across a number of categories
ta: பல வகைகளில் மதிப்புகளின் பாக்ச் பிளாட்

source: The example below shows the same data as for the bar chart above, but presented as a box plot.
ta: கீழேயுள்ள எடுத்துக்காட்டு மேலே உள்ள பார் விளக்கப்படத்திற்கான அதே தரவைக் காட்டுகிறது, ஆனால் பெட்டி சதித்திட்டமாக வழங்கப்படுகிறது.

source: Hovering the cursor over an outlier shows the:
ta: கர்சரை ஒரு வெளிநாட்டவர் மீது வட்டமிடுவது காட்டுகிறது:

source: DAP of the data point
ta: தரவு புள்ளியின் DAP

source: Hovering the cursor over the box shows the:
ta: கர்சரை பெட்டியின் மீது வட்டமிடுவது காட்டுகிறது:

source: maximum value
ta: அதிகபட்ச மதிப்பு

source: minimum value
ta: குறைந்தபட்ச மதிப்பு

source: median
ta: இடைநடு

source: 1st and 3rd quartiles
ta: 1 வது மற்றும் 3 வது காலாண்டுகள்

source: lower fence: 1rd quartile - (1.5 x interquartile range)
ta: கீழ் வேலி: 1 வது காலாண்டு - (1.5 ஃச் இடைநிலை வரம்பு)

source: upper fence: 3rd quartile + (1.5 x interquartile range)
ta: மேல் வேலி: 3 வது குவார்டைல் ​​+ (1.5 ஃச் இடைநிலை வரம்பு)

source: Histogram bar chart of values across categories
ta: வகைகளில் மதிப்புகளின் இச்டோகிராம் பார் விளக்கப்படம்

source: The example below shows the distribution of DAP values for the knee data used in the box and bar plots above. The number of bins used in the histograms can be configured in the `Additional chart options on the Config page`_.
ta: கீழேயுள்ள எடுத்துக்காட்டு பெட்டியில் பயன்படுத்தப்படும் முழங்கால் தரவுகளுக்கான DAP மதிப்புகளின் விநியோகத்தையும் மேலே உள்ள பார் அடுக்குகளுக்கும் காட்டுகிறது. இச்டோகிராம்களில் பயன்படுத்தப்படும் தொட்டிகளின் எண்ணிக்கையை `கட்டமைப்பு பக்கத்தில் உள்ள கூடுதல் விளக்கப்பட விருப்பங்களில் கட்டமைக்க முடியும்.

source: bin DAP range
ta: AM DAP வரம்பு

source: bin DAP mid-point value
ta: பின் டிஏபி மிட்-பாயிண்ட் மதிப்பு

source: bin frequency
ta: பின் அதிர்வெண்

source: Bar chart of category frequency
ta: வகை அதிர்வெண்ணின் பார் விளக்கப்படம்

source: The example below shows the frequency of the "knee" requested procedures for each x-ray room. The height of each bar is the total frequency for that requested procedure. Each bar is sub-divided into sections representing the number of requests for each x-ray room.
ta: கீழேயுள்ள எடுத்துக்காட்டு ஒவ்வொரு எக்ச்ரே அறைக்கும் "முழங்கால்" கோரப்பட்ட நடைமுறைகளின் அதிர்வெண்ணைக் காட்டுகிறது. ஒவ்வொரு பட்டியின் உயரம் அந்த கோரப்பட்ட நடைமுறைக்கான மொத்த அதிர்வெண் ஆகும். ஒவ்வொரு பட்டியும் ஒவ்வொரு எக்ச்ரே அறைக்கும் கோரிக்கைகளின் எண்ணிக்கையைக் குறிக்கும் பிரிவுகளாக பிரிக்கப்பட்டுள்ளது.

source: Hovering the cursor over a bar section shows the:
ta: ஒரு பார் பிரிவின் மீது கர்சரை வட்டமிடுவது காட்டுகிறது:

source: requested procedure frequency
ta: கோரப்பட்ட செயல்முறை அதிர்வெண்

source: Setting *Grouping choice* to **System names** in the `Chart options on the modality pages`_ groups the data by x-ray system name rather than requested procedure name, as shown below:
ta: கீழே காட்டப்பட்டுள்ளபடி, கோரப்பட்ட நடைமுறை பெயரை விட எக்ச்-ரே கணினி பெயரால் தரவை எக்ச்-ரே கணினி பெயரால் தரவை `_ குழுக்களில் ** ** கணினி பெயர்களுக்கு ** ** கணினி பெயர்களுக்கு ** என அமைத்தல் **: கீழே காட்டப்பட்டுள்ளபடி:

source: Scatter chart of x vs y values
ta: ஃச் மற்றும் ஒய் மதிப்புகளின் சிதறல் விளக்கப்படம்

source: The example below shows the average glandular dose plotted against compressed breast thickness for "MAMMOGRAM" acquisitions made on two x-ray systems.
ta: கீழேயுள்ள எடுத்துக்காட்டு, இரண்டு எக்ச்ரே அமைப்புகளில் செய்யப்பட்ட "மேமோகிராம்" கையகப்படுத்துதல்களுக்காக சுருக்கப்பட்ட மார்பக தடிமன் மீது திட்டமிடப்பட்ட சராசரி சுரப்பி டோச் காட்டுகிறது.

source: acquisition protocol name
ta: கையகப்படுத்தல் நெறிமுறை பெயர்

source: compressed breast thickness
ta: சுருக்கப்பட்ட மார்பக தடிமன்

source: average glandular dose
ta: சராசரி சுரப்பி டோச்

source: Bar chart of workload
ta: பணிச்சுமையின் பார் விளக்கப்படம்

source: These show the number of studies taking place per weekday, sub-divided into hours of the day.
ta: இவை வாரத்திற்கு வாரத்திற்கு நடைபெறும் ஆய்வுகளின் எண்ணிக்கையைக் காட்டுகின்றன, இது நாளின் மணிநேரங்களாக பிரிக்கப்பட்டுள்ளது.

source: There is a bar per weekday. The total height of this bar is the number of studies carried out on that weekday. Each bar is sub-divided into sections representing the number of studies carried out in each of the 24 hours of that day. Each section is colour-coded according to how many studies it represents.
ta: வாரத்திற்கு ஒரு பட்டி உள்ளது. இந்த பட்டியின் மொத்த உயரம் அந்த வார நாளில் மேற்கொள்ளப்பட்ட ஆய்வுகளின் எண்ணிக்கை. ஒவ்வொரு பட்டியும் அந்த நாளின் 24 மணி நேரத்திலும் மேற்கொள்ளப்பட்ட ஆய்வுகளின் எண்ணிக்கையைக் குறிக்கும் பிரிவுகளாக பிரிக்கப்பட்டுள்ளது. ஒவ்வொரு பகுதியும் எத்தனை ஆய்வுகளைக் குறிக்கிறது என்பதைப் பொறுத்து வண்ண-குறியிடப்படுகிறது.

source: Hovering the cursor over a section shows you the:
ta: கர்சரை ஒரு பிரிவின் மீது வட்டமிடுவது உங்களுக்குக் காட்டுகிறது:

source: day of the week that the section represents
ta: பிரிவு குறிக்கும் வாரத்தின் நாள்

source: hour of the day that the section represents
ta: பிரிவு குறிக்கும் நாள்
