Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: Create an account at https://hosted.weblate.org
ta: Https://hosted.weblate.org இல் ஒரு கணக்கை உருவாக்கவும்

source: The OpenREM project is at https://hosted.weblate.org/projects/openrem/
ta: OpenRem திட்டம் https://hosted.weblate.org/projects/openrem/ இல் உள்ளது

source: Each page in the Read The Docs documentation (https://docs.openrem.org) is a separate 'component' in Weblate, and they have been named 'RTD document name'. The web interface strings are all in one 'component'.
ta: வாசிப்பு டாக்ச் ஆவணத்தில் (https://docs.openrem.org) ஒரு தனி 'கூறு' என்பது வெப்லேட்டில் ஒரு தனி 'கூறு', மேலும் அவை 'ஆர்டிடி ஆவண பெயர்' என்று பெயரிடப்பட்டுள்ளன. வலை இடைமுக சரங்கள் அனைத்தும் ஒரே 'கூறுகளில்' உள்ளன.

source: Choose a component, and on the next page you can select one of the existing translations which you can review, edit and propose new translation strings.
ta: ஒரு கூறுகளைத் தேர்வுசெய்க, அடுத்த பக்கத்தில் புதிய மொழிபெயர்ப்பு சரங்களை மதிப்பாய்வு செய்ய, திருத்த மற்றும் முன்மொழியக்கூடிய தற்போதுள்ள மொழிபெயர்ப்புகளில் ஒன்றைத் தேர்ந்தெடுக்கலாம்.

source: Once approved, they will be merged in by developers
ta: ஒப்புதல் அளிக்கப்பட்டதும், அவை டெவலப்பர்களால் இணைக்கப்படும்

source: Creating new language translations
ta: புதிய மொழி மொழிபெயர்ப்புகளை உருவாக்குதல்

source: At the component level, you will see an option to create a new translation. This might need to be done for each component individually.
ta: கூறு மட்டத்தில், புதிய மொழிபெயர்ப்பை உருவாக்க ஒரு விருப்பத்தைக் காண்பீர்கள். ஒவ்வொரு கூறுக்கும் தனித்தனியாக இது செய்யப்பட வேண்டியிருக்கலாம்.

source: Code syntax in strings
ta: சரங்களில் குறியீடு தொடரியல்

source: Be careful not to edit code syntax within strings. For example, Python code might be:
ta: சரங்களுக்குள் குறியீடு தொடரியல் திருத்தாமல் கவனமாக இருங்கள். எடுத்துக்காட்டாக, பைதான் குறியீடு இருக்கலாம்:

source: This is translated into Norwegian Bokmål as:
ta: இது நோர்வே போக்மாலில் மொழிபெயர்க்கப்பட்டுள்ளது:

source: Notice that the ``{}`` and their contents is unchanged - but may be moved around within the sentence to produce the correct grammar for the language being used.
ta: `` {} `` மற்றும் அவற்றின் உள்ளடக்கங்கள் மாறாமல் இருப்பதைக் கவனியுங்கள் - ஆனால் பயன்படுத்தப்படும் மொழிக்கு சரியான இலக்கணத்தை உருவாக்க வாக்கியத்திற்குள் நகர்த்தப்படலாம்.

source: Similarly with Django HTML template strings:
ta: இதேபோல் சாங்கோ உஉகுமொ வார்ப்புரு சரங்களுடன்:

source: becomes:
ta: ஆகிறது:

source: It is essential that the ``%()s`` as well as the string inside the brackets stay intact.
ta: ``%() எச்`` அத்துடன் அடைப்புக்குறிக்குள் உள்ள சரம் அப்படியே இருப்பது தேவை.

source: For the RTD translations, there will be Sphinx codes that should be left untranslated, for example:
ta: ஆர்டிடி மொழிபெயர்ப்புகளுக்கு, ச்பின்க்ச் குறியீடுகள் இருக்க வேண்டும், அவை மொழிபெயர்க்கப்படாமல் இருக்க வேண்டும், எடுத்துக்காட்டாக:

source: Install pre-requisites
ta: முன்நிபந்தனைகளை நிறுவவும்

source: **gettext**
ta: ** உரைபெறு **

source: Linux: ``sudo apt install gettext`` or equivalent for your distribution. For Windows: download `a precompiled binary installer <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_
ta: லினக்ச்: `` sudo apt install getText`` அல்லது உங்கள் விநியோகத்திற்கு சமம். விண்டோசுக்கு: பதிவிறக்கம் `ஒரு முன்கூட்டிய பைனரி நிறுவி <https://mlocati.github.io/articles/gettext-iconv-windows.html>` _

source: Activate development environment - see :doc:`code_dev_env` for details - and add the sphinx packages:
ta: மேம்பாட்டு சூழலைச் செயல்படுத்தவும் - காண்க: DOC: `code_dev_env` விவரங்களுக்கு - மற்றும் சூரரிமாச்சிலை தொகுப்புகளைச் சேர்க்கவும்:

source: Update .pot and .po files
ta: புதுப்பிக்கவும் .pot மற்றும் .po கோப்புகள்

source: Activate the development environment and move to the root of the OpenREM repository - with the ``docs`` folder and ``openrem`` folder etc:
ta: மேம்பாட்டு சூழலைச் செயல்படுத்தி, ஓபன்ரெம் களஞ்சியத்தின் வேருக்குச் செல்லுங்கள் - `` டாக்ச்` `கோப்புறை மற்றும்` ஓபன்ரெம்` கோப்புறை போன்றவை:

source: Adding new interface strings for translation
ta: மொழிபெயர்ப்புக்கு புதிய இடைமுக சரங்களைச் சேர்ப்பது

source: Please refer to https://docs.djangoproject.com/en/2.2/topics/i18n/translation/ for instructions.
ta: அறிவுறுத்தல்களுக்கு https://docs.djangoproject.com/en/2.2/topics/i18n/translation/ ஐப் பார்க்கவும்.

source: In brief, the following will help get you started, but does not cover lazy translations, plurals and many other things!
ta: சுருக்கமாக, பின்வருபவை உங்களைத் தொடங்க உதவும், ஆனால் சோம்பேறி மொழிபெயர்ப்புகள், பன்மை மற்றும் பல விசயங்களை மறைக்காது!

source: All the Sphinx/Read The Docs strings are translatable - if a page does not appear in Weblate that is because it has not been configured as a component there yet.
ta: அனைத்து ச்பின்க்ச்/வாசிப்பு டாக்ச் சரங்கள் மொழிபெயர்க்கக்கூடியவை - வெப்லேட்டில் ஒரு பக்கம் தோன்றவில்லை என்றால், அது இன்னும் ஒரு அங்கமாக கட்டமைக்கப்படவில்லை என்பதால்.

source: Python code
ta: பைதான் குறியீடு

source: First, import ``gettext`` from Django:
ta: முதலில், சாங்கோவிலிருந்து `` getText`` ஐ இறக்குமதி செய்க:

source: Then wrap strings to be translated with ``_()`` so
ta: பின்னர் `` _ () `` உடன் மொழிபெயர்க்கப்பட வேண்டிய சரங்களை மடக்கு

source: becomes
ta: ஆகிறது

source: The same is done for strings that contain variables. Unfortunately ``gettext`` cannot work with f-strings so we are stuck with ``.format()`` instead. It is easier to understand how to translate the text though if we use named variables rather than position based ones, like this:
ta: மாறிகள் கொண்ட சரங்களுக்கும் இது செய்யப்படுகிறது. துரதிர்ச்டவசமாக `` getText`` f-சரங்களுடன் வேலை செய்ய முடியாது, எனவே நாங்கள் அதற்கு பதிலாக `` .format () `` உடன் சிக்கியுள்ளோம். இது போன்ற நிலை அடிப்படையிலானவற்றை விட பெயரிடப்பட்ட மாறிகள் பயன்படுத்தினால் உரையை எவ்வாறு மொழிபெயர்ப்பது என்பதைப் புரிந்துகொள்வது எளிது:

source: Remember we cannot assume the grammar of the translated string so try and pass the whole sentence or paragraph to be translated.
ta: மொழிபெயர்க்கப்பட்ட சரத்தின் இலக்கணத்தை நாம் கருத முடியாது என்பதை நினைவில் கொள்ளுங்கள், எனவே மொழிபெயர்க்கப்பட வேண்டிய முழு வாக்கியத்தையும் அல்லது பத்தியையும் முயற்சித்து அனுப்பவும்.

source: Template code
ta: வார்ப்புரு குறியீடு

source: Add the following at the top of the template file, just after any ``extends`` code:
ta: எந்தவொரு `` விரிவாக்கப்பட்ட பிறகு, வார்ப்புரு கோப்பின் மேலே பின்வருவனவற்றைச் சேர்க்கவும்:

source: This can be done with *inline* translations and *block* translations. For inline,
ta: இதை * இன்லைன் * மொழிபெயர்ப்புகள் மற்றும் * பிளாக் * மொழிபெயர்ப்புகளுடன் செய்யலாம். இன்லைன்,

source: If there are variables, a block translation is required, for example:
ta: மாறிகள் இருந்தால், ஒரு தொகுதி மொழிபெயர்ப்பு தேவை, எடுத்துக்காட்டாக:

source: Comments can be added to aid translators, for example:
ta: உதவி மொழிபெயர்ப்பாளர்களுக்கு கருத்துகளைச் சேர்க்கலாம், எடுத்துக்காட்டாக:

source: Making use of updated strings on local system
ta: உள்ளக கணினியில் புதுப்பிக்கப்பட்ட சரங்களைப் பயன்படுத்துதல்

source: Specify the language to build for Sphinx docs, eg for German:
ta: சூரரிமாச்சிலை டாக்சுக்காக உருவாக்க மொழியைக் குறிப்பிடவும், எ.கா. செர்மன்:

source: For Django strings:
ta: சாங்கோ சரங்களுக்கு:

source: Incorporating translations into main repo
ta: முதன்மையான ரெப்போவில் மொழிபெயர்ப்புகளை இணைத்தல்

source: In the git repository:
ta: அறிவிலி களஞ்சியத்தில்:

source: Checkout the ``weblate\develop`` branch as a new local branch
ta: புதிய உள்ளக கிளையாக `` வலைபெயர்ப்பு \ உருவாக்கு` கிளையை பாருங்கள்

source: Push the branch to Bitbucket
ta: கிளையை பிட்பக்கெட்டுக்கு தள்ளுங்கள்

source: Create a pull request to develop
ta: உருவாக்க ஒரு இழுப்பு கோரிக்கையை உருவாக்கவும்

source: Server 500 errors
ta: சேவையகம் 500 பிழைகள்

source: **Turn on debug mode**
ta: ** பிழைத்திருத்த பயன்முறையை இயக்கவும் **

source: This will render a debug report in the browser - usually revealing the problem.
ta: இது உலாவியில் பிழைத்திருத்த அறிக்கையை வழங்கும் - பொதுவாக சிக்கலை வெளிப்படுத்துகிறது.

source: Docker installs
ta: கப்பல்துறை நிறுவல்

source: Edit the ``.env.prod`` file. Find the following line and change it from ``0`` to ``1``:
ta: `` .Env.prod`` கோப்பைத் திருத்தவும். பின்வரும் வரியைக் கண்டுபிடித்து `` 0`` இலிருந்து `1`` ஆக மாற்றவும்:

source: Restart the containers using a command line in the folder containing your installation. This might be enough:
ta: உங்கள் நிறுவலைக் கொண்ட கோப்புறையில் ஒரு கட்டளை வரியைப் பயன்படுத்தி கொள்கலன்களை மறுதொடக்கம் செய்யுங்கள். இது போதுமானதாக இருக்கலாம்:

source: If the webserver fails, then restart all the containers:
ta: வெப்சர்வர் தோல்வியுற்றால், எல்லா கொள்கலன்களையும் மறுதொடக்கம் செய்யுங்கள்:

source: Non-Docker installs
ta: டிராக்கர் அல்லாத நிறுவல்கள்

source: Locate and edit your local_settings file
ta: உங்கள் லோக்கல்_செட்டிங் கோப்பைக் கண்டுபிடித்து திருத்தவும்

source: Find the following line and make it active:
ta: பின்வரும் வரியைக் கண்டுபிடித்து செயலில் செய்யுங்கள்:

source: Restart the web service:
ta: வலை சேவையை மறுதொடக்கம் செய்யுங்கள்:

source: Returning to normal mode
ta: சாதாரண பயன்முறைக்குத் திரும்புகிறது

source: You should always disable debug mode when you have fixed the error. If you leave debug mode in place, the system is likely to run out of memory as database queries are cached in this mode.
ta: நீங்கள் பிழையை சரிசெய்யும்போது எப்போதும் பிழைத்திருத்த பயன்முறையை முடக்க வேண்டும். நீங்கள் பிழைத்திருத்த பயன்முறையை விட்டுவிட்டால், தரவுத்தள வினவல்கள் இந்த பயன்முறையில் தற்காலிகமாக சேமிக்கப்படுவதால் கணினி நினைவகத்தை விட்டு வெளியேற வாய்ப்புள்ளது.

source: Docker:
ta: டோக்கர்:

source: Edit ``.env.prod`` to set ``DEBUG=0``
ta: `` பிழைத்திருத்த = 0`` ஐ அமைக்க `` .env.prod`` ஐத் திருத்தவும்

source: Restart ``docker-compose``
ta: `` டோக்கர்-சமநிலை`` ஐ மறுதொடக்கம் செய்யுங்கள்

source: Non-docker:
ta: நாய்க்குட்டி அல்லாதவர்:

source: Edit ``local_settings.py`` again to comment out the ``DEBUG`` line (add a ``#`` to the start) or set it to ``False``
ta: `` பிழைத்திருத்த`` வரியை மீண்டும் கருத்துத் தெரிவிக்க `` லோக்கல்_செட்டிங்ச்.பி`` மீண்டும் திருத்து

source: Reload the web service
ta: வலை சேவையை மீண்டும் ஏற்றவும்

source: Fixing accumulated AGD and laterality for Hologic DBT
ta: திரட்டப்பட்ட ஏசிடி மற்றும் ஓலோசிக் டிபிடிக்கான பக்கவாட்டுத்தன்மையை சரிசெய்தல்

source: The code for extracting dose related information from Hologic digital breast tomosynthesis proprietary projection images object used an incorrect tag to extract the laterality of the image in releases before 0.8.0 in June 2018. As a result the accumulated AGD code didn't work, so the accumulated AGD cell on the mammography summary sheets remained blank.
ta: ஓலோசிக் டிசிட்டல் மார்பக டோமோசைன்டெசிசிலிருந்து டோச் தொடர்பான தகவல்களைப் பிரித்தெடுப்பதற்கான குறியீடு, சூன் 2018 இல் 0.8.0 க்கு முன்னர் வெளியீடுகளில் படத்தின் பக்கவாட்டைப் பிரித்தெடுக்க தவறான குறிச்சொல்லைப் பயன்படுத்தியது. இதன் விளைவாக திரட்டப்பட்ட ஏசிடி குறியீடு வேலை செய்யவில்லை, எனவே மேமோகிராஃபி சுருக்கம் தாள்களில் திரட்டப்பட்ட ஏசிடி செல் காலியாக இருந்தது.

source: Releases between 0.8.0 and 0.10.0 had instructions on how to rectify this for existing studies in the database, but these instructions are not suitable for version 1.0 and later and therefore these instructions have been removed.
ta: 0.8.0 மற்றும் 0.10.0 க்கு இடையிலான வெளியீடுகள் தரவுத்தளத்தில் இருக்கும் ஆய்வுகளுக்கு இதை எவ்வாறு சரிசெய்வது என்பது குறித்த வழிமுறைகளைக் கொண்டிருந்தன, ஆனால் இந்த வழிமுறைகள் பதிப்பு 1.0 மற்றும் அதற்குப் பிறகு பொருந்தாது, எனவே இந்த வழிமுறைகள் அகற்றப்பட்டுள்ளன.

source: Troubleshooting
ta: சரிசெய்தல்

source: General Docker troubleshooting
ta: செனரல் கப்பல்துறை சரிசெய்தல்

source: All commands should be run from the folder where ``docker-compose.yml`` is.
ta: அனைத்து கட்டளைகளும் கோப்புறையிலிருந்து இயக்கப்பட வேண்டும், அங்கு `` docker-compose.yml``.

source: To list the active containers:
ta: செயலில் உள்ள கொள்கலன்களை பட்டியலிட:

source: To list active containers running anywhere on the system:
ta: கணினியில் எங்கும் இயங்கும் செயலில் உள்ள கொள்கலன்களை பட்டியலிட:

source: To start the containers and detach (so you get the command prompt back instead of seeing all the logging):
ta: கொள்கலன்களைத் தொடங்கவும் பிரிக்கவும் (எனவே அனைத்து பதிவுகளையும் பார்ப்பதற்கு பதிலாக கட்டளை வரியில் திரும்பப் பெறுவீர்கள்):

source: To stop the containers:
ta: கொள்கலன்களை நிறுத்த:

source: To see logs of all the containers in follow mode (``-f``) and with timestamps (``-t``):
ta: அனைத்து கொள்கலன்களின் பதிவுகளையும் பின்தொடர்தல் பயன்முறையில் (`` -f``) மற்றும் நேர முத்திரைகள் (`` -t``) காண::

source: To see logs of just one container in follow mode - use the service name from the ``docker-compose.yml`` file, choose from ``openrem``, ``db`` (PostgreSQL), ``nginx`` (web server), ``orthanc_1`` (DICOM server):
ta: பின்தொடர்தல் பயன்முறையில் ஒரு கொள்கலனின் பதிவுகளைக் காண - `` கப்பல்துறை -கம்ப்.ஒய்.எம்.எல்`` கோப்பிலிருந்து பணி பெயரைப் பயன்படுத்தவும், `` ஓபன்ரெம்``, `` டி.பி. (வலை சேவையகம்), `` ஆர்த்தாங்க்_1`` (டிகாம் சேவையகம்):

source: Other Docker errors
ta: பிற கப்பல்துறை பிழைகள்

source: OpenREM log files
ta: ஓபன்ரெம் பதிவு கோப்புகள்

source: Log file location, naming and verbosity were configured in the ``.env.prod`` configuration - see the :doc:`env_variables` configuration docs for details.
ta: விவரங்களுக்கு கோப்பு இருப்பிடம், பெயரிடுதல் மற்றும் சொற்களஞ்சியம் `` .env.prod`` உள்ளமைவில் கட்டமைக்கப்பட்டன - விவரங்களுக்கு: doc: `env_variables` உள்ளமைவு ஆவணங்கள்.

source: The ``openrem.log`` has general logging information, the other two are specific to the DICOM store and DICOM query-retrieve functions if you are making use of them.
ta: `` OpenRem.log`` பொதுவான பதிவு தகவல்களைக் கொண்டுள்ளது, மற்ற இரண்டு DICOM STORE மற்றும் DICOM வினவல்-மறுபயன்பாட்டு செயல்பாடுகளுக்கு நீங்கள் பயன்படுத்தினால் குறிப்பிட்டவை.

source: You can increase the verbosity of the log files by changing the log 'level' to ``DEBUG``, or you can decrease the verbosity to ``WARNING``, ``ERROR``, or ``CRITICAL``. The default is ``INFO``.
ta: பதிவு 'பிழைத்திருத்தத்தை' ஆக மாற்றுவதன் மூலம் பதிவு கோப்புகளின் சொற்களஞ்சியத்தை நீங்கள் அதிகரிக்கலாம் அல்லது நீங்கள் `` எச்சரிக்கை`, `` பிழை`` அல்லது `` விமர்சன`` என்ற சொற்களஞ்சியத்தை குறைக்கலாம். இயல்புநிலை `` தகவல்``.

source: To list the OpenREM log folder (with details, sorted with newest at the bottom, 'human' file sizes):
ta: ஓபன்ரெம் பதிவு கோப்புறையை பட்டியலிட (விவரங்களுடன், கீழே புதியது, 'மனித' கோப்பு அளவுகள்):

source: To review the ``openrem.log`` file for example:
ta: எடுத்துக்காட்டாக `` OpenRem.log`` கோப்பை மதிப்பாய்வு செய்ய:

source: Older stuff
ta: பழைய பொருள்

source: If you have a modality where every study has one event (usually CT), review
ta: ஒவ்வொரு ஆய்விலும் ஒரு நிகழ்வு (பொதுவாக சி.டி) இருக்கும் ஒரு முறை உங்களிடம் இருந்தால், மதிப்பாய்வு செய்யுங்கள்

source: If planar X-ray studies are appearing in fluoroscopy or vice-versa, review
ta: ஃப்ளோரோச்கோபி அல்லது நேர்மாறாக பிளானர் எக்ச்ரே ஆய்வுகள் தோன்றினால், மதிப்பாய்வு செய்யவும்

source: :doc:`i_displaynames`
ta: : டாக்: `i_displaynames`

source: For DICOM networking:
ta: DICOM நெட்வொர்க்கிங்:

source: :ref:`qrtroubleshooting` for query retrieve
ta: : ref: வினவலுக்கான `qrtroubleshooting`

source: :ref:`storetroubleshooting` for DICOM store
ta: : குறிப்பு: டிகாம் கடைக்கு `storetroubleshooting`

source: For task management:
ta: பணி நிர்வாகத்திற்கு:

source: :doc:`task-management`
ta: : டாக்: `பணி-மேலாண்மை`

source: Log files
ta: பதிவு கோப்புகள்

source: Starting again!
ta: மீண்டும் தொடங்குகிறது!

source: If for any reason you want to start again with the database, then this is how you might do it:
ta: எந்தவொரு காரணத்திற்காகவும் நீங்கள் தரவுத்தளத்துடன் மீண்டும் தொடங்க விரும்பினால், நீங்கள் இதை எப்படிச் செய்யலாம்:

source: SLQite3 database
ta: SQLITE3 தரவுத்தளம்

source: Delete or rename your existing database file (location will be described in your ``local_settings.py`` file)
ta: உங்கள் இருக்கும் தரவுத்தள கோப்பை நீக்கவும் அல்லது மறுபெயரிடவும் (இருப்பிடம் உங்கள் `` local_settings.py`` கோப்பில் விவரிக்கப்படும்)

source: *? ref to database creation here, if SQLite3 features anywhere?*
ta: *? SQLITE3 எங்கும் இடம்பெற்றால், தரவுத்தள உருவாக்கத்திற்கு இங்கே?*

source: Any database
ta: எந்த தரவுத்தளமும்

source: These instructions will also allow you to keep any user settings if you use an SQLite3 database.
ta: நீங்கள் ஒரு SQLITE3 தரவுத்தளத்தைப் பயன்படுத்தினால் எந்த பயனர் அமைப்புகளையும் வைத்திருக்க இந்த வழிமுறைகள் உங்களை அனுமதிக்கும்.

source: Ubuntu linux: ``cd /usr/local/lib/python2.7/dist-packages/openrem/``
ta: உபுண்டு லினக்ச்: `` சிடி/யுஎச்ஆர்/லோக்கல்/லிப்/பைதான் 2.7/மாவட்ட-பேக்கேச்கள்/ஓபன்ரெம்/``

source: Other linux: ``cd /usr/lib/python2.7/site-packages/openrem/``
ta: பிற லினக்ச்: `` சிடி/யுஎச்ஆர்/லிப்/பைதான் 2.7/தள-பேக்கேச்கள்/ஓபன்ரெம்/``

source: Linux virtualenv: ``cd virtualenvfolder/lib/python2.7/site-packages/openrem/``
ta: லினக்ச் மெய்நிகர்இன்வ்: `` சிடி மெய்நிகர்என்.விஃபோல்டர்/லிப்/பைதான் 2.7/தள-பேக்கேச்கள்/ஓபன்ரெம்/``

source: Windows: ``cd C:\Python27\Lib\site-packages\openrem\``
ta: விண்டோச்: `` சிடி சி: \ பைதான் 27 \ லிப் \ தள-பேக்கேச்கள் \ ஓபன்ரெம் \ ``

source: Windows virtualenv: ``cd virtualenvfolder\Lib\site-packages\openrem\``
ta: சாளரங்கள் மெய்நிகர்இன்வ்: `` குறுவட்டு மெய்நிகர்என்.விஃபோல்டர் \ லிப் \ தள-பேக்கேச்கள் \ ஓபன்ரெம் \ ``

source: Run the django python shell:
ta: சாங்கோ பைதான் செல்லை இயக்கவும்:

source: And if you are sure you want to delete all the studies...
ta: நீங்கள் உறுதியாக இருந்தால் எல்லா ஆய்வுகளையும் நீக்க விரும்புகிறீர்கள் ...

source: Upgrade to Docker
ta: டோக்கருக்கு மேம்படுத்தவும்

source: These instructions assume:
ta: இந்த வழிமுறைகள் கருதுகின்றன:

source: You are upgrading from 0.10.0.
ta: நீங்கள் 0.10.0 இலிருந்து மேம்படுத்தப்படுகிறீர்கள்.

source: You are using a PostgreSQL database in the existing installation.
ta: இருக்கும் நிறுவலில் நீங்கள் ஒரு PostgresQL தரவுத்தளத்தைப் பயன்படுத்துகிறீர்கள்.

source: That existing Linux installs followed the instructions in the previous releases, with the *openrem-function* format that changed in the 0.9.1 release (:ref:`service_name_change`).
ta: முந்தைய வெளியீடுகளில் உள்ள வழிமுறைகளைப் பின்பற்றிய லினக்ச் நிறுவல்கள், 0.9.1 வெளியீட்டில் மாற்றப்பட்ட * ஓபன்ரெம்-செயல்பாடு * வடிவத்துடன் (: ref: `service_name_change`).

source: If not you will need to adapt the instructions as necessary.
ta: இல்லையென்றால் நீங்கள் தேவையான வழிமுறைகளை மாற்றியமைக்க வேண்டும்.

source: **Upgrades from 0.9.1 or earlier should review** :doc:`upgrade_previous_0.10.0`. -- needs changing
ta: ** 0.9.1 அல்லது அதற்கு முந்தைய மேம்படுத்தல்கள் மதிப்பாய்வு செய்ய வேண்டும் **: டாக்: `மேம்படுத்தல்_பிரெவியச்_0.10.0`. - மாற்ற வேண்டும்

source: Upgrade process from a PostgresQL database
ta: PostgresQL தரவுத்தளத்திலிருந்து செயல்முறையை மேம்படுத்தவும்

source: Stop the existing services
ta: தற்போதுள்ள சேவைகளை நிறுத்துங்கள்

source: Windows: stop the following services
ta: விண்டோச்: பின்வரும் சேவைகளை நிறுத்துங்கள்

source: Orthanc or Conquest
ta: ஆர்த்தாங்க் அல்லது செய்

source: IIS OpenREM site or other webserver
ta: IIS OpenRem தளம் அல்லது பிற வெப்சர்வர்

source: Flower
ta: மலர்

source: Celery
ta: சிவரிக்கீரை

source: RabbitMQ
ta: முயல்ம்

source: Establish existing database details
ta: இருக்கும் தரவுத்தள விவரங்களை நிறுவவும்

source: Review the current ``local_settings.py`` for the database settings and location of the ``MEDIA_ROOT`` folder. The file is in:
ta: `` மீடியா_ரூட்`` கோப்புறையின் தரவுத்தள அமைப்புகள் மற்றும் இருப்பிடத்திற்கு தற்போதைய `` லோக்கல்_செட்டிங்ச்.பை`` ஐ மதிப்பாய்வு செய்யவும். கோப்பு உள்ளது:

source: Ubuntu linux: ``/usr/local/lib/python2.7/dist-packages/openrem/openremproject/local_settings.py``
ta: உபுண்டு லினக்ச்: ``/usr/local/lib/python2.7/dist-packages/openrem/openRemproject/local_settings.py``

source: Other linux: ``/usr/lib/python2.7/site-packages/openrem/openremproject/local_settings.py``
ta: பிற லினக்ச்: ``/usr/lib/python2.7/site-packages/openrem/openRemProject/local_settings.py``

source: Linux virtualenv: ``vitualenvfolder/lib/python2.7/site-packages/openrem/openremproject/local_settings.py``
ta: லினக்ச் மெய்நிகர்இன்வ்: `` vaitualenvfolder/lib/python2.7/site-packages/openrem/openRemProject/local_settings.py``

source: Windows: ``C:\Python27\Lib\site-packages\openrem\openremproject\local_settings.py``
ta: விண்டோச்: `` சி: \ பைதான் 27 \ லிப் \ தள-பேக்கேச்கள் \ ஓபன்ரெம் \ ஓபன்ரெம்ப்ரோசெக்ட் \ local_settings.py``

source: Windows virtualenv: ``virtualenvfolder\Lib\site-packages\openrem\openremproject\local_settings.py``
ta: சாளரங்கள் மெய்நிகர்இன்வ்: `` மெய்நிகர்என்.விஃபோல்டர் \ லிப் \ தள-பேக்கேச்கள் \ ஓபன்ரெம் \ ஓபன்ரெம்ப்ரோசெக்ட் \ local_settings.py``

source: Export the database
ta: தரவுத்தளத்தை ஏற்றுமதி செய்யுங்கள்

source: Open a command line window
ta: கட்டளை வரி சாளரத்தைத் திறக்கவும்

source: Windows: go to Postgres bin folder, for example:
ta: விண்டோச்: போச்ட்கிரெச் பின் கோப்புறைக்குச் செல்லுங்கள், எடுத்துக்காட்டாக:

source: Dump the database:
ta: தரவுத்தளத்தை கொட்டவும்:

source: Use the username (``-U openremuser``) and database name (``-d openremdb``) from ``local_settings.py``
ta: `` Local_settings.py`` இலிருந்து பயனர்பெயர் (`-U OpenReMuser````) மற்றும் தரவுத்தள பெயர் (` `-d openremdb``) ஐப் பயன்படுத்தவும்

source: Use the password from ``local_settings.py`` when prompted
ta: கேட்கும் போது `` local_settings.py`` இலிருந்து கடவுச்சொல்லைப் பயன்படுத்தவும்

source: For linux, the command is ``pg_dump`` (no ``.exe``)
ta: லினக்சைப் பொறுத்தவரை, கட்டளை `` pg_dump`` (இல்லை `` .exe``)

source: Set the path to somewhere suitable to dump the exported database file
ta: ஏற்றுமதி செய்யப்பட்ட தரவுத்தள கோப்பைக் கொட்டுவதற்கு ஏற்ற எங்காவது பாதையை அமைக்கவும்

source: Set up the new installation
ta: புதிய நிறுவலை அமைக்கவும்

source: Install Docker
ta: டோக்கரை நிறுவவும்

source: Download and extract https://bitbucket.org/openrem/docker/get/develop.zip and open a shell (command window) in the new folder
ta: புதிய கோப்புறையில் https://bitbucket.org/openrem/docker/get/develop.zip ஐத் திறந்து பிரித்தெடுக்கவும்

source: Customise variables in ``.env.prod``, the ``orthanc_1`` section in ``docker-compose.yml`` and in ``orthanc_1.json`` as necessary. A full description of the options are found in:
ta: `` .Env.prod``, `` ஆர்த்தாங்க்_1`` பிரிவில் `` டோக்கர்-கம்ப்யூச்.ஒய்.எம்.எல். விருப்பங்களின் முழு விளக்கம் இதில் காணப்படுகிறது:

source: Copy the database backup to the postgres docker container and import it. If you have changed the database variables, ensure that:
ta: தரவுத்தள காப்புப்பிரதியை போச்ட்கிரெச் கப்பல்துறை கொள்கலனுக்கு நகலெடுத்து இறக்குமதி செய்யுங்கள். நீங்கள் தரவுத்தள மாறிகளை மாற்றியிருந்தால், அதை உறுதிப்படுத்தவும்:

source: the database user (``-U openremuser``) matches ``POSTGRES_USER`` in ``.env.prod``
ta: தரவுத்தள பயனர் (`` -U OpenReMuser``) `` .env.prod`` இல் `` Postgres_user` உடன் பொருந்துகிறது

source: the database name (``-d openrem_prod``) matches ``POSTGRES_DB`` in ``.env.prod``
ta: தரவுத்தள பெயர் (`-d openrem_prod``)` `.env.prod`` இல்` `postgres_db`` உடன் பொருந்துகிறது

source: They don't have to match the old database settings. The filename in both commands (``openremdump.bak``) should match your backup filename.
ta: அவர்கள் பழைய தரவுத்தள அமைப்புகளுடன் பொருந்த வேண்டியதில்லை. இரண்டு கட்டளைகளிலும் உள்ள கோப்பு பெயர் (`` OpenRemdump.bak``) உங்கள் காப்பு கோப்பு பெயருடன் பொருந்த வேண்டும்.

source: It is normal to get an error about the public schema, for example:
ta: பொதுத் திட்டத்தைப் பற்றி பிழையைப் பெறுவது இயல்பு, எடுத்துக்காட்டாக:

source: Rename the 0.10 upgrade migration file, migrate the database (the steps and fakes are required as it is not a new database), and create the static files:
ta: 0.10 மேம்படுத்தல் இடம்பெயர்வு கோப்பை மறுபெயரிட்டு, தரவுத்தளத்தை இடம்பெயர்வு செய்யுங்கள் (இது புதிய தரவுத்தளம் இல்லாததால் படிகள் மற்றும் போலிகள் தேவைப்படுகின்றன), மற்றும் நிலையான கோப்புகளை உருவாக்கவும்:

source: Generate translation binary files
ta: மொழிபெயர்ப்பு பைனரி கோப்புகளை உருவாக்குங்கள்

source: The new OpenREM installation should now be ready to be used.
ta: புதிய ஓபன்ரெம் நிறுவல் இப்போது பயன்படுத்த தயாராக இருக்க வேண்டும்.
