Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: Log in as an administrator to start the migration process. If you have a large number of studies in your database this can take some time. A large database (several hundred studies) on slow disks might take a day or two, on faster disks or with a smaller database it could take from a few minutes to an hour or so. You will be able to monitor the progress on the home page as seen in the figure at the bottom of this page.
ta: இடம்பெயர்வு செயல்முறையைத் தொடங்க நிர்வாகியாக உள்நுழைக. உங்கள் தரவுத்தளத்தில் அதிக எண்ணிக்கையிலான ஆய்வுகள் இருந்தால், இதற்கு சிறிது நேரம் ஆகலாம். மெதுவான வட்டுகளில் ஒரு பெரிய தரவுத்தளம் (பல நூறு ஆய்வுகள்) ஒன்று அல்லது இரண்டு நாட்கள், வேகமான வட்டுகளில் அல்லது ஒரு சிறிய தரவுத்தளத்துடன் சில நிமிடங்கள் முதல் ஒரு மணி நேரம் வரை ஆகலாம். இந்த பக்கத்தின் கீழே உள்ள படத்தில் காணப்படுவது போல் முகப்பு பக்கத்தில் முன்னேற்றத்தை நீங்கள் கண்காணிக்க முடியும்.

source: 0.10 upgrade panel after log in as administrator
ta: 0.10 நிர்வாகியாக உள்நுழைந்த பிறகு குழு மேம்படுத்தவும்

source: One task per modality type (CT, fluoroscopy, mammography and radiography) is generated to create a task per study in each modality to populate the new fields for that study. If the number of workers is the same or less than the number of modality types in your database then the study level tasks will all be created before any of them are executed as all the workers will be busy. Therefore there might be a delay before the progress indicators on the OpenREM front page start to update. You can review the number of tasks being created on the ``Config -> Tasks`` page.
ta: ஒரு முறை வகைக்கு ஒரு பணி (சி.டி, ஃப்ளோரோச்கோபி, மேமோகிராபி மற்றும் ரேடியோகிராஃபி) அந்த ஆய்வுக்கான புதிய துறைகளை விரிவுபடுத்த ஒவ்வொரு முறையிலும் ஒரு ஆய்வுக்கு ஒரு பணியை உருவாக்க உருவாக்கப்படுகிறது. உங்கள் தரவுத்தளத்தில் உள்ள முறை வகைகளின் எண்ணிக்கையை விட தொழிலாளர்களின் எண்ணிக்கை ஒரே மாதிரியாகவோ அல்லது குறைவாகவோ இருந்தால், அனைத்து தொழிலாளர்களும் பிசியாக இருப்பதால் அவற்றில் ஏதேனும் செயல்படுத்தப்படுவதற்கு முன்பு ஆய்வு நிலை பணிகள் அனைத்தும் உருவாக்கப்படும். எனவே ஓபன்ரெம் முதல் பக்கத்தில் முன்னேற்ற குறிகாட்டிகள் புதுப்பிக்கத் தொடங்குவதற்கு முன்பு நேரந்தவறுகை ஏற்படலாம். `` கட்டமைப்பு -> பணிகள்`` பக்கத்தில் உருவாக்கப்படும் பணிகளின் எண்ணிக்கையை நீங்கள் மதிப்பாய்வு செய்யலாம்.

source: Before the migration is complete, some of the information on the modality pages of OpenREM will be missing, such as the dose information for example, but otherwise everything that doesn't rely on Celery workers will work as normal. Studies sent directly to be imported will carry on during the migration, but query-retrieve tasks will get stuck behind the migration tasks.
ta: இடம்பெயர்வு முடிவதற்குள், ஓபன்ரெமின் முறை பக்கங்கள் குறித்த சில தகவல்கள் காணாமல் போகும், எடுத்துக்காட்டாக டோச் செய்தி, ஆனால் இல்லையெனில் செலரி தொழிலாளர்களை நம்பாத அனைத்தும் இயல்பாகவே செயல்படும். நேரடியாக இறக்குமதி செய்ய அனுப்பப்பட்ட ஆய்வுகள் இடம்பெயர்வின் போது மேற்கொள்ளப்படும், ஆனால் வினவல்-மறுசீரமைப்பு பணிகள் இடம்பெயர்வு பணிகளுக்கு பின்னால் சிக்கிக்கொள்ளும்.

source: 0.10 upgrade panel, population of fields in progress
ta: 0.10 மேம்படுத்தல் குழு, புலங்களின் மக்கள் தொகை

source: When the process is complete the 'Summary data fields migration' panel will disappear and will not be seen again.
ta: செயல்முறை முடிந்ததும் 'சுருக்கம் தரவு புலங்கள் இடம்பெயர்வு' குழு மறைந்துவிடும், மீண்டும் காணப்படாது.

source: Upgrading a native Windows install
ta: சொந்த சாளரங்கள் நிறுவலை மேம்படுத்துதல்

source: Release 1.0 of OpenREM uses a newer version of Python and no longer uses RabbitMQ, Erlang and Celery. Instructions are only provided for Orthanc DICOM server, and no longer for Conquest. The built-in DICOM Store node has been removed.
ta: ஓபன்ரெமின் 1.0 வெளியீடு பைத்தானின் புதிய பதிப்பைப் பயன்படுத்துகிறது, மேலும் ராபிட்எம்யூ, எர்லாங் மற்றும் செலரி ஆகியவற்றைப் பயன்படுத்தாது. ஆர்த்தாங்க் டிகாம் சேவையகத்திற்கு மட்டுமே வழிமுறைகள் வழங்கப்படுகின்றன, இனி வெற்றிக்கு இல்லை. உள்ளமைக்கப்பட்ட டிகாம் கடை முனை அகற்றப்பட்டது.

source: Consider upgrading to a new Windows server instead of upgrading in place. Instructions for :doc:`upgrade_windows_new_server` are provided including exporting and importing the existing PostgreSQL database.
ta: இடத்தில் மேம்படுத்துவதற்கு பதிலாக புதிய சாளரங்கள் சேவையகத்திற்கு மேம்படுத்துவதைக் கவனியுங்கள். இதற்கான வழிமுறைகள்: DOC: `மேம்படுத்தல்_விண்டோச்_நியூ_சர்வர்` தற்போதுள்ள postgresql தரவுத்தளத்தை ஏற்றுமதி செய்தல் மற்றும் இறக்குமதி செய்தல் உள்ளிட்டவை வழங்கப்படுகின்றன.

source: something about a clean install, and/or not having old services that are no longer required
ta: தூய்மையான நிறுவல், மற்றும்/அல்லது இனி தேவையில்லாத பழைய சேவைகள் இல்லாதது பற்றி

source: something about being a standardised approach which will make upgrade docs and examples easier to follow
ta: ஒரு தரப்படுத்தப்பட்ட அணுகுமுறையாக இருப்பது பற்றி ஏதாவது மேம்படுத்தல் டாக்ச் மற்றும் எடுத்துக்காட்டுகளைப் பின்பற்றுவது எளிது

source: Then best effort upgrade docs... a lot of this can be copied from the :doc:`install_windows` instructions, or depending on what it ends up looking like, we might point there with a few admonitions to point out differences?
ta: பின்னர் சிறந்த முயற்சி டாக்சை மேம்படுத்தவும் ... இதில் நிறைய: டாக்: `நிறுவல்_விண்டோச்` அறிவுறுத்தல்களிலிருந்து நகலெடுக்கலாம், அல்லது அது எப்படி இருக்கும் என்பதைப் பொறுத்து, வேறுபாடுகளை சுட்டிக்காட்ட சில அறிவுரைகளை நாம் சுட்டிக்காட்டலாமா?

source: Export database for backup
ta: காப்புப்பிரதிக்கு தரவுத்தளத்தை ஏற்றுமதி செய்யுங்கள்

source: Stop all the services
ta: அனைத்து சேவைகளையும் நிறுத்துங்கள்

source: Install Python 3.10
ta: பைதான் 3.10 ஐ நிறுவவும்

source: Update PostgreSQL, Orthanc, DCMTK, Pixelmed
ta: Postgresql, orthanc, dcmtk, பிக்சல்மெட் புதுப்பிக்கவும்

source: Add/update as necessary gettext, 7Zip, Notepad++
ta: தேவையான உரைபெறு, 7ZIP, NOTEPAD ++ என சேர்க்கவும்/புதுப்பிக்கவும்

source: Install IIS if Apache/NGINX previously in use
ta: முன்பு பயன்பாட்டில் இருந்த அப்பாச்சி/nginx என்றால் IIS ஐ நிறுவவும்

source: Create virtualenv, activate
ta: மெய்நிகர்இன்வியை உருவாக்கவும், செயல்படுத்தவும்

source: Install new OpenREM, wfastcgi
ta: புதிய OpenRem, WFASTCGI ஐ நிறுவவும்

source: Configure OpenREM - use new local_settings.py.windows, adjust database name etc
ta: OpenRem ஐ உள்ளமைக்கவும் - புதிய local_settings.py.windows ஐப் பயன்படுத்தவும், தரவுத்தள பெயர் போன்றவற்றை சரிசெய்யவும்

source: Will database be available in new version of PostgreSQL? Or does it need to be imported?
ta: Postgresql இன் புதிய பதிப்பில் தரவுத்தளம் கிடைக்குமா? அல்லது அதை இறக்குமதி செய்ய வேண்டுமா?

source: Rename 0001_initial.py file
ta: 0001_initial.py கோப்பை மறுபெயரிடுங்கள்

source: Do the fake-initial etc stuff
ta: போலி-ஆரம்ப போன்ற விசயங்களைச் செய்யுங்கள்

source: Do the rest of the manage.py stuff
ta: மீதமுள்ள Manage.py விசயங்களைச் செய்யுங்கள்

source: Configure/reconfigure IIS
ta: IIS ஐ உள்ளமைக்க/மறுசீரமைக்கவும்

source: Configure/reconfigure Orthanc
ta: ஆர்த்தாங்கை உள்ளமைக்க/மறுசீரமைக்கவும்

source: Upgrading to a new Windows server
ta: புதிய சாளரங்கள் சேவையகத்திற்கு மேம்படுத்துதல்

source: If OpenREM has been running on an older Windows server version, or you wish to move to Windows Server to host OpenREM, these instructions will guide you through upgrading an existing database to a new server.
ta: பழைய சாளரங்கள் சர்வர் பதிப்பில் ஓபன்ரெம் இயங்கினால், அல்லது ஓபன்ரெம் புரவலன் செய்ய சாளரங்கள் சேவையகத்திற்கு செல்ல விரும்பினால், இந்த வழிமுறைகள் ஏற்கனவே உள்ள தரவுத்தளத்தை புதிய சேவையகத்திற்கு மேம்படுத்துவதன் மூலம் உங்களுக்கு வழிகாட்டும்.

source: This install is based on Windows Server 2022 - for details see the main :doc:`install_windows` docs.
ta: இந்த நிறுவல் சாளரங்கள் சர்வர் 2022 ஐ அடிப்படையாகக் கொண்டது - விவரங்களுக்கு முக்கியத்தைப் பார்க்கவும்: டாக்: `நிறுவல்_விண்டோச்` டாக்ச்.

source: Export the old database on the old server - get details from the ``local_settings.py`` file:
ta: பழைய சேவையகத்தில் பழைய தரவுத்தளத்தை ஏற்றுமதி செய்யுங்கள் - `` local_settings.py`` கோப்பிலிருந்து விவரங்களைப் பெறுங்கள்:

source: Now follow the :doc:`install_windows` instructions looking out for the additional steps for upgrading to a new server.
ta: இப்போது பின்தொடரவும்: DOC: `install_windows` வழிமுறைகள் புதிய சேவையகத்திற்கு மேம்படுத்துவதற்கான கூடுதல் படிகளைத் தேடும்.

source: Running the OpenREM website in a virtual directory
ta: ஓபன்ரெம் வலைத்தளத்தை ஒரு மெய்நிகர் கோப்பகத்தில் இயக்குகிறது

source: If you want to run the OpenREM in a virtual directory (like http://server/dms/) you need to configure this in your web server configuration as well as in the OpenREM configuration.
ta: நீங்கள் ஒரு மெய்நிகர் கோப்பகத்தில் ஓபன்ரெமை இயக்க விரும்பினால் (http: // server/dms/போன்றவை) இதை உங்கள் வலை சேவையக உள்ளமைவு மற்றும் ஓபன்ரெம் உள்ளமைவில் உள்ளமைக்க வேண்டும்.

source: The following steps are necessary:
ta: பின்வரும் படிகள் அவசியம்:

source: Configure virtual directory settings in the Docker ``.env.prod`` file
ta: `` .Env.prod`` கோப்பில் மெய்நிகர் அடைவு அமைப்புகளை உள்ளமைக்கவும்

source: Update Nginx webserver configuration
ta: Nginx வெப்சர்வர் உள்ளமைவைப் புதுப்பிக்கவும்

source: Update the ``reverse.js`` file
ta: `` Reverse.js`` கோப்பைப் புதுப்பிக்கவும்

source: Restart the containers
ta: கொள்கலன்களை மறுதொடக்கம் செய்யுங்கள்

source: Docker setup
ta: கப்பல்துறை அமைப்பு

source: Stop the containers if they are running before changing the configuration, using a shell (command prompt) in the Docker OpenREM installation folder
ta: உள்ளமைவை மாற்றுவதற்கு முன்பு அவை இயங்கினால், கப்பல்துறை ஓபன்ரெம் நிறுவல் கோப்புறையில் செல் (கட்டளை வரியில்) பயன்படுத்தி அவை இயங்குகின்றன என்றால் நிறுத்தவும்

source: Configure virtual directory settings in .env.prod
ta: .Env.prod இல் மெய்நிகர் அடைவு அமைப்புகளை உள்ளமைக்கவும்

source: Django needs to know the virtual directory name and which URLs the static and media files are served from.
ta: மெய்நிகர் அடைவு பெயர் மற்றும் நிலையான மற்றும் மீடியா கோப்புகள் வழங்கப்படும் முகவரி கள் சாங்கோ அறிந்து கொள்ள வேண்டும்.

source: Edit ``.env.prod``, uncomment the following lines (remove the ``#``) and set them as appropriate. The ``VIRTUAL_DIRECTORY`` setting must have a trailing ``/``. For example, to serve the website from a subfolder/virtual directory named ``dms``:
ta: `` .Env.prod`` ஐத் திருத்தவும், பின்வரும் வரிகளை அவிழ்த்து விடுங்கள் (``#``) அவற்றை அகற்றி அவற்றை பொருத்தமானதாக அமைக்கவும். `` மெய்நிகர்_டிகோரி`` அமைப்பில் ஒரு பின்னால் இருக்க வேண்டும் ``/``. எடுத்துக்காட்டாக, `` dms`` என்ற பெயரிடப்பட்ட ஒரு துணை கோப்புறை/மெய்நிகர் கோப்பகத்திலிருந்து வலைத்தளத்திற்கு பணி செய்ய:

source: Modify webserver configuration
ta: வெப்சர்வர் உள்ளமைவை மாற்றவும்

source: Edit ``nginx-conf/conf.d/openrem.conf`` to update the locations — again using the example virtual directory ``dms``:
ta: இருப்பிடங்களைப் புதுப்பிக்க `` nginx-conf/conf.d/openrem.conf`` ஐத் திருத்து-மீண்டும் எடுத்துக்காட்டு மெய்நிகர் அடைவு `` dms`` ஐப் பயன்படுத்துதல்:

source: Start the containers
ta: கொள்கலன்களைத் தொடங்கவும்

source: Update reverse.js
ta: Reverse.js ஐப் புதுப்பிக்கவும்

source: The static reverse.js file should be updated in order to change the URLs in the static javascript files.
ta: நிலையான சாவாச்கிரிப்ட் கோப்புகளில் உள்ள முகவரி களை மாற்றுவதற்கு நிலையான Revers.js கோப்பு புதுப்பிக்கப்பட வேண்டும்.

source: Open a shell (command prompt) and navigate to the Docker OpenREM installation folder
ta: ஒரு செல் (கட்டளை வரியில்) திறந்து கப்பல்துறை ஓபன்ரெம் நிறுவல் கோப்புறையில் செல்லவும்

source: Test!
ta: சோதனை!

source: You should now be able to reach the OpenREM interface using the virtual directory address.
ta: மெய்நிகர் அடைவு முகவரியைப் பயன்படுத்தி நீங்கள் இப்போது ஓபன்ரெம் இடைமுகத்தை அடைய முடியும்.

source: Non-Docker install
ta: டிராக்கர் அல்லாத நிறுவல்

source: Update local_settings.py
ta: Local_settings.py ஐப் புதுப்பிக்கவும்

source: Update ``local_settings.py`` with the same variables as in the ``.env.prod`` file. If the values aren't in your copy of the file just add them in:
ta: `` .Env.prod`` கோப்பில் உள்ள அதே மாறிகளுடன் `` local_settings.py`` ஐப் புதுப்பிக்கவும். மதிப்புகள் உங்கள் கோப்பின் நகலில் இல்லையென்றால் அவற்றைச் சேர்க்கவும்:

source: Restart the services
ta: சேவைகளை மறுதொடக்கம் செய்யுங்கள்

source: Webserver configuration
ta: வெப்சர்வர் உள்ளமைவு

source: Webserver timeout
ta: வெப்சர்வர் நேரம் முடிந்தது

source: Some long running actions can cause webserver errors if they take longer than the timeout setting in the webserver, particularly generating fluoroscopy :doc:`skindosemap`. The default setting is 300 seconds, or five minutes. To modify this, change the following two settings:
ta: வெப்சர்வரில் காலக்கெடு அமைப்பை விட அதிக நேரம் எடுத்தால், குறிப்பாக ஃப்ளோரோச்கோபியை உருவாக்கும் சில நீண்ட கால செயல்கள் வெப்சர்வர் பிழைகளை ஏற்படுத்தும்: டாக்: `ச்கின்டோசெமாப்`. இயல்புநிலை அமைப்பு 300 வினாடிகள் அல்லது ஐந்து நிமிடங்கள். இதை மாற்ற, பின்வரும் இரண்டு அமைப்புகளை மாற்றவும்:

source: Edit ``docker-compose.yml`` in the Docker OpenREM installation folder and change the timeout setting on the following line:
ta: கப்பல்துறை ஓபன்ரெம் நிறுவல் கோப்புறையில் `` docker-compose.yml`` ஐத் திருத்தி, பின்வரும் வரியில் காலக்கெடு அமைப்பை மாற்றவும்:

source: Edit ``nginx-conf/conf.d/openrem.conf`` and set the same timeout:
ta: `` Nginx-conf/conf.d/openrem.conf`` ஐத் திருத்தி, அதே நேரத்தை அமைக்கவும்:

source: Reload the containers:
ta: கொள்கலன்களை மீண்டும் ஏற்றவும்:

source: Change the same settings as for the Docker install above:
ta: மேலே உள்ள கப்பல்துறை நிறுவலுக்கான அதே அமைப்புகளை மாற்றவும்:

source: and
ta: மற்றும்

source: Adding an SSL certificate
ta: ஒரு SSL சான்றிதழை சேர்க்கிறது

source: It is advisable to add an SSL certificate to the web server even though it might only be accessible within an institution. There are several reasons for this, but one main one is that over time web browsers will give more and more warnings about entering passwords into non-HTTPS websites.
ta: ஒரு நிறுவனத்திற்குள் மட்டுமே அணுகக்கூடியதாக இருந்தாலும் வலை சேவையகத்தில் ஒரு SSL சான்றிதழை சேர்ப்பது நல்லது. இதற்கு பல காரணங்கள் உள்ளன, ஆனால் ஒரு முக்கிய சேதி என்னவென்றால், காலப்போக்கில் வலை உலாவிகள் HTTPS அல்லாத வலைத்தளங்களில் கடவுச்சொற்களை உள்ளிடுவது குறித்து மேலும் மேலும் எச்சரிக்கைகளை வழங்கும்.

source: It is likely that within your institution there will be a corporate trusted root certificate and a mechanism of getting certificates you generate for your servers signed by that root certificate. How to generate a certificate signing request (CSR) and private key are beyond the scope of these documents, but this blog post was helpful when we were learning how to do this at our institution: https://www.endpoint.com/blog/2014/10/30/openssl-csr-with-alternative-names-one
ta: உங்கள் நிறுவனத்திற்குள் ஒரு கார்ப்பரேட் நம்பகமான ரூட் சான்றிதழ் மற்றும் அந்த ரூட் சான்றிதழால் கையொப்பமிடப்பட்ட உங்கள் சேவையகங்களுக்கு நீங்கள் உருவாக்கும் சான்றிதழ்களைப் பெறுவதற்கான ஒரு வழிமுறை இருக்கும். சான்றிதழ் கையொப்பமிடும் கோரிக்கை (சி.எச்.ஆர்) மற்றும் தனியார் விசையை எவ்வாறு உருவாக்குவது இந்த ஆவணங்களின் எல்லைக்கு அப்பாற்பட்டது, ஆனால் எங்கள் நிறுவனத்தில் இதை எவ்வாறு செய்வது என்று நாங்கள் கற்றுக் கொள்ளும்போது இந்த வலைப்பதிவு இடுகை உதவியாக இருந்தது: https://www.endpoint.com/blog /2014/10/30/OpenSSL-CSR-with-மாற்று பெயர்கள்-ஒன்று

source: Once you have a signed certificate, place it and the key in ``nginx-conf/certs``, where it will be available in the Nginx container at ``/etc/ssl/private``.
ta: உங்களிடம் கையொப்பமிடப்பட்ட சான்றிதழ் கிடைத்ததும், அதையும் விசையையும் `` nginx-conf/certs`` இல் வைக்கவும், அங்கு இது nginx கொள்கலனில் ``/etc/ssl/private`` இல் கிடைக்கும்.

source: There are two conf files in ``nginx-conf/conf.d`` - the default one is ``openrem.conf``. There is an alternative one named ``openrem-secure.conf.example``. Edit the second file as required, then rename them both so the secure version is the only one to have a ``.conf`` ending.
ta: `` Nginx -conf/conf.d`` இல் இரண்டு கான்ஃப் கோப்புகள் உள்ளன - இயல்புநிலை ஒன்று `` OpenRem.conf``. `` OpenRem-concure.conf.example`` என்ற பெயரில் ஒரு மாற்று உள்ளது. இரண்டாவது கோப்பை தேவைக்கேற்ப திருத்தவும், பின்னர் அவை இரண்டையும் மறுபெயரிடுங்கள், எனவே பாதுகாப்பான பதிப்பு மட்டுமே `` .கான்ஃபி`` முடிவைக் கொண்டுள்ளது.

source: Ensure the the following lines are updated for the name of your server and the names of your signed certificate and key:
ta: உங்கள் சேவையகத்தின் பெயர் மற்றும் உங்கள் கையொப்பமிடப்பட்ட சான்றிதழ் மற்றும் விசையின் பெயர்கள் புதுப்பிக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்தவும்:
