Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: Mammography chart showing the number of studies carried out per weekday
ta: வாரத்திற்கு மேற்கொள்ளப்பட்ட ஆய்வுகளின் எண்ணிக்கையைக் காட்டும் மேமோகிராஃபி விளக்கப்படம்

source: Fluoroscopy chart of average DAP for each study description
ta: ஒவ்வொரு ஆய்வு விளக்கத்திற்கும் சராசரி DAP இன் ஃப்ளோரோச்கோபி விளக்கப்படம்

source: Fluoroscopy chart of the frequency of each study description
ta: ஒவ்வொரு ஆய்வு விளக்கத்தின் அதிர்வெண்ணின் ஃப்ளோரோச்கோபி விளக்கப்படம்

source: Fluoroscopy chart showing the number of studies carried out per weekday
ta: ஃப்ளோரோச்கோபி விளக்கப்படம் வாரத்திற்கு மேற்கொள்ளப்பட்ட ஆய்வுகளின் எண்ணிக்கையைக் காட்டுகிறது

source: Context specific documentation has been added to the Docs menu
ta: டாக்ச் பட்டியலில் சூழல் குறிப்பிட்ட ஆவணங்கள் சேர்க்கப்பட்டுள்ளன

source: DICOM Networking
ta: DICOM நெட்வொர்க்கிங்

source: Query retrieve function is now built in to query PACS systems or modalities via the Import menu
ta: வினவல் மீட்டெடுப்பு செயல்பாடு இப்போது இறக்குமதி பட்டியல் வழியாக PACS அமைப்புகள் அல்லது முறைகளை வினவுவதற்கு கட்டப்பட்டுள்ளது

source: Configuring and running DICOM Store SCP is available and managed in the web interface, but not recommended
ta: DICOM கடை SCP ஐ கட்டமைத்தல் மற்றும் இயக்குவது வலை இடைமுகத்தில் கிடைக்கிறது மற்றும் நிர்வகிக்கப்படுகிறது, ஆனால் பரிந்துரைக்கப்படவில்லை

source: Documentation improved
ta: ஆவணங்கள் மேம்படுத்தப்பட்டன

source: Imports
ta: இறக்குமதிகள்

source: Mammography RDSRs import correctly
ta: மேமோகிராஃபி ஆர்.டி.எச்.ஆர் கள் சரியாக இறக்குமதி செய்கின்றன

source: Mammography imports from images **now create an accumulated AGD value per breast**
ta: மேமோகிராஃபி படங்களிலிருந்து இறக்குமதி செய்யப்படுகிறது ** இப்போது ஒரு மார்பகத்திற்கு திரட்டப்பட்ட ஏசிடி மதிப்பை உருவாக்கவும் **

source: GE Senographe DS compression **now recorded correctly in Newtons** for new imports
ta: கீ SENOGRAPHE DS சுருக்கம் ** இப்போது புதிய இறக்குமதிக்காக நியூட்டன்களில் சரியாக பதிவு செய்யப்பட்டுள்ளது **

source: Philips Allura fluoroscopy RDSRs import correctly, including calculating the exposure time
ta: பிலிப்ச் அல்லூரா ஃப்ளோரோச்கோபி ஆர்.டி.எச்.ஆர் கள் சரியாக இறக்குமதி செய்கின்றன, இதில் வெளிப்பாடு நேரத்தைக் கணக்கிடுவது உட்பட

source: Bi-plane fluoroscopy imports can now be displayed in the web interface
ta: இரு வானூர்தி ஃப்ளோரோச்கோபி இறக்குமதிகள் இப்போது வலை இடைமுகத்தில் காட்டப்படலாம்

source: Patient height imports from csv **now convert from cm to m** - previously height was assumed to be cm and inserted into database without change. Existing height data will remain as cm value for csv imports, and m value for RDSR imports
ta: சி.எச்.வி ** இலிருந்து நோயாளியின் உயர இறக்குமதி இப்போது முதல்வரிலிருந்து எம் ** ஆக மாற்றப்படுகிறது - முன்பு உயரம் முதல்வர் என்று கருதப்பட்டு மாற்றமின்றி தரவுத்தளத்தில் செருகப்பட்டது. தற்போதுள்ள உயர தரவு காபிம இறக்குமதிக்கான CM மதிப்பாகவும், RDSR இறக்குமதிக்கான M மதிப்பு என்றும் இருக்கும்

source: Better handling of non-ASCII characters
ta: அசி அல்லாத எழுத்துக்களை சிறப்பாக கையாளுதல்

source: Tube current is now extracted from Siemens Intevo RDSRs
ta: குழாய் மின்னோட்டம் இப்போது சீமென்ச் இன்டெவோ ஆர்.டி.எச்.ஆர்களிடமிருந்து பிரித்தெடுக்கப்படுகிறது

source: Exports
ta: ஏற்றுமதி

source: Patient sex is included in all exports
ta: அனைத்து ஏற்றுமதியிலும் நோயாளி செக்ச் சேர்க்கப்பட்டுள்ளது

source: Filters generated by navigating through charts can now be used to filter export data
ta: ஏற்றுமதி தரவை வடிகட்ட இப்போது விளக்கப்படங்கள் வழியாக செல்லுவதன் மூலம் உருவாக்கப்படும் வடிப்பான்கள் பயன்படுத்தப்படலாம்

source: Study description and laterality are now included in mammography exports
ta: ஆய்வு விளக்கம் மற்றும் பக்கவாட்டு இப்போது மேமோகிராஃபி ஏற்றுமதியில் சேர்க்கப்பட்டுள்ளன

source: Bi-fluoroscopy studies can be exported
ta: இரு-ஃப்ளூரோச்கோபி ஆய்வுகள் ஏற்றுமதி செய்யப்படலாம்

source: Skin dose maps
ta: தோல் டோச் வரைபடங்கள்

source: Skin dose maps have been withdrawn from OpenREM version 0.7.0 due to incorrect orientation calculations that need to be fixed before openSkin can be reimplemented into OpenREM
ta: ஓபன்ச்கின் ஓபன்ரெமில் மறுசீரமைக்கப்படுவதற்கு முன்பு சரி செய்யப்பட வேண்டிய தவறான நோக்குநிலை கணக்கீடுகள் காரணமாக தோல் டோச் வரைபடங்கள் ஓபன்ரெம் பதிப்பு 0.7.0 இலிருந்து திரும்பப் பெறப்பட்டுள்ளன

source: Changes since 0.7.0
ta: 0.7.0 முதல் மாற்றங்கள்

source: Extremely minor change to the documenation links
ta: ஆவணப்படுத்தல் இணைப்பில் மிகச் சிறிய மாற்றங்கள்

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.7.0.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்க்க கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.7.0.html>` _

source: OpenREM Release Notes version 0.7.3
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.7.3

source: Database: New migration file for upgrades from 0.6 series databases
ta: தரவுத்தளம்: 0.6 தொடர் தரவுத்தளங்களிலிருந்து மேம்படுத்தலுக்கான புதிய இடம்பெயர்வு கோப்பு

source: Charts: Fixed display and export errors, improved layout and increased the number of data points that can be plotted
ta: விளக்கப்படங்கள்: நிலையான காட்சி மற்றும் ஏற்றுமதி பிழைகள், மேம்பட்ட தளவமைப்பு மற்றும் திட்டமிடக்கூடிய தரவு புள்ளிகளின் எண்ணிக்கையை அதிகரித்தல்

source: Interface: Fixed multi-line cells in tables so that the links work in IE8
ta: இடைமுகம்: அட்டவணையில் நிலையான மல்டி-லைன் செல்கள், இதனால் இணைப்புகள் IE8 இல் வேலை செய்கின்றன

source: Interface: Fixed delete cancel button in firefox
ta: இடைமுகம்: பயர்பாக்சில் நிலையான நீக்கு ரத்து பொத்தானை

source: Exports: Fixed export of non-ASCII characters to csv file
ta: ஏற்றுமதி: சி.எச்.வி கோப்புக்கு அசி அல்லாத எழுத்துக்களின் நிலையான ஏற்றுமதி

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.7.3.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்க்க கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.7.3.html>` _

source: OpenREM Release Notes version 0.7.4
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.7.4

source: Imports: DX images now import with multiple filters that are MultiValue as well as comma separated
ta: இறக்குமதி: டிஎக்ச் படங்கள் இப்போது பல வடிப்பான்களுடன் இறக்குமதி செய்கின்றன, அவை மல்டிவல்யூ மற்றும் கமாவைப் பிரிக்கின்றன

source: Exports: DX data now correctly exports to csv and xlsx if studies include multiple filters (eg Cu+Al)
ta: ஏற்றுமதி: டிஎக்ச் தரவு இப்போது சி.எச்.வி மற்றும் எக்ச்எல்எச்எக்ச் ஆகியவற்றிற்கு சரியாக ஏற்றுமதி செய்கிறது என்றால் ஆய்வுகள் பல வடிப்பான்கள் (எ.கா. கியூ+அல்)

source: Install: New release of dependency django-filter breaks OpenREM. Pegged at previous version for now
ta: நிறுவு: சார்புநிலையின் புதிய வெளியீடு சாங்கோ-வடிகட்டி ஓபன்ரெம் உடைக்கிறது. இப்போதைக்கு முந்தைய பதிப்பில் செல்லப்பட்டது

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.7.4.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்க்க கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.7.4.html>` _

source: OpenREM Release Notes version 0.8.0
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.8.0

source: This release has extensive automated testing for large parts of the codebase (for the first time)
ta: இந்த வெளியீடு கோட்பேசின் பெரிய பகுதிகளுக்கு விரிவான தானியங்கி சோதனையைக் கொண்டுள்ளது (முதல் முறையாக)

source: Code quality is much improved, reduced duplication, better documentation, many bugs fixed
ta: குறியீடு தகுதி மிகவும் மேம்பட்டது, குறைக்கப்பட்ட நகல், சிறந்த ஆவணங்கள், பல பிழைகள் சரி செய்யப்பட்டுள்ளன

source: Imports: RDSR from a wider range of systems now import properly
ta: இறக்குமதி: பரந்த அளவிலான அமைப்புகளிலிருந்து ஆர்.டி.எச்.ஆர் இப்போது சரியாக இறக்குமதி செய்கிறது

source: Imports: Better distinction and control over defining RDSR studies as RF or DX
ta: இறக்குமதி: ஆர்.டி.எச்.ஆர் ஆய்வுகளை ஆர்.எஃப் அல்லது டி.எக்ச் என வரையறுப்பதில் சிறந்த வேறுபாடு மற்றும் கட்டுப்பாடு

source: Imports: Code and instructions to generate and import RDSR from older Toshiba CT scanners
ta: இறக்குமதி: பழைய தோசிபா சி.டி ச்கேனர்களிடமிருந்து ஆர்.டி.எச்.ஆரை உருவாக்கி இறக்குமதி செய்வதற்கான குறியீடு மற்றும் வழிமுறைகள்

source: Imports: DICOM Query-Retrieve functionality has been overhauled
ta: இறக்குமதி: டிகாம் வினவல்-மறுபயன்பாட்டு செயல்பாடு மாற்றியமைக்கப்பட்டுள்ளது

source: Imports: Duplicate checking improved to allow cumulative and continued study RDSRs to import properly
ta: இறக்குமதி: ஒட்டுமொத்த மற்றும் தொடர்ச்சியான ஆய்வு RDSR களை சரியாக இறக்குமதி செய்ய அனுமதிக்க நகல் சோதனை மேம்பட்டது

source: Imports: indicators that a study is not a patient can now be configured in the web interface
ta: இறக்குமதி: ஒரு ஆய்வு ஒரு நோயாளி அல்ல என்பதற்கான குறிகாட்டிகள் இப்போது வலை இடைமுகத்தில் கட்டமைக்கப்படலாம்

source: Imports, display and export: Better handling of non-ASCII characters
ta: இறக்குமதி, காட்சி மற்றும் ஏற்றுமதி: ASCII அல்லாத எழுத்துக்களை சிறப்பாக கையாளுதல்

source: Interface: More detailed, consistent and faster rendering of the data in the web interface
ta: இடைமுகம்: வலை இடைமுகத்தில் தரவின் விரிவான, சீரான மற்றும் வேகமான வழங்குதல்

source: Interface: Maps of fluoroscopy radiation exposure incident on a phantom (Siemens RDSRs only)
ta: இடைமுகம்: ஒரு பாண்டமில் ஃப்ளோரோச்கோபி கதிர்வீச்சு வெளிப்பாடு சம்பவத்தின் வரைபடங்கள் (சீமென்ச் ஆர்.டி.எச்.ஆர்.எச் மட்டும்)

source: Interface: More and better charts, including scatter plots for mammography
ta: இடைமுகம்: மேமோகிராஃபிக்கான சிதறல் அடுக்குகள் உட்பட மேலும் மேலும் சிறந்த விளக்கப்படங்கள்

source: Interface: Display names dialogue has been extended to allow administration of all studies from each source
ta: இடைமுகம்: ஒவ்வொரு மூலத்திலிருந்தும் அனைத்து ஆய்வுகளின் நிர்வாகத்தை அனுமதிக்க காட்சி பெயர்கள் உரையாடல் நீட்டிக்கப்பட்டுள்ளது

source: Exports: Much faster, and more consistent
ta: ஏற்றுமதி: மிக வேகமான, மேலும் சீரான

source: Documentation: Extensive user documentation improvements
ta: ஆவணம்: விரிவான பயனர் ஆவணங்கள் மேம்பாடுகள்

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.8.0.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்ப்பதற்கான கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.8.0.html>` _

source: OpenREM Release Notes version 0.8.1
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.8.1

source: Documentation: improved docs and added one-page complete install on Ubuntu instructions
ta: ஆவணம்: மேம்படுத்தப்பட்ட டாக்ச் மற்றும் உபுண்டு வழிமுறைகளில் ஒரு பக்க முழுமையான நிறுவலைச் சேர்த்தது

source: Install: temporary fix for dependency error
ta: நிறுவு: சார்பு பிழைக்கான தற்காலிக பிழைத்திருத்தம்

source: Interface: added feature to allow users to change their own password
ta: இடைமுகம்: பயனர்கள் தங்கள் சொந்த கடவுச்சொல்லை மாற்ற அனுமதிக்க சேர்க்கப்பட்ட நற்பொருத்தம்

source: Charts: fixed problem where a blank category name may not be displayed correctly
ta: விளக்கப்படங்கள்: வெற்று வகை பெயர் சரியாக காட்டப்படாமல் இருக்கக்கூடிய நிலையான சிக்கல்

source: Imports: reduced list of scanners that work with the legacy Toshiba CT extractor
ta: இறக்குமதிகள்: டோசிபா சி.டி பிரித்தெடுத்தலுடன் பணிபுரியும் ச்கேனர்களின் பட்டியல் குறைக்கப்பட்டுள்ளது

source: Imports: improved handling of non-conformant DX images with text in filter thickness fields
ta: இறக்குமதி: வடிகட்டி தடிமன் புலங்களில் உரையுடன் இணக்கமற்ற டிஎக்ச் படங்களை மேம்படுத்துதல்

source: Query-Retrieve: added non-standard option to work-around bug in Impax C-FIND SCP
ta: வினவல்-மறுபரிசீலனை: IMPAX C-FIND SCP இல் வேலை செய்யும் பிழைக்கு தரமற்ற விருப்பம் சேர்க்கப்பட்டது

source: Exports: fixed bug in mammography NHSBSP exports that incorrectly reported the filter material in some circumstances
ta: ஏற்றுமதி: மேமோகிராஃபி என்.எச்.எச்.பி.எச்.பி ஏற்றுமதியில் நிலையான பிழை சில சூழ்நிலைகளில் வடிகட்டி பொருளை தவறாக அறிவித்தது

source: Exports: fixed bug where sorting by AGD would cause duplicate entries for bilateral studies
ta: ஏற்றுமதி: AGD ஆல் வரிசைப்படுத்துவது இருதரப்பு ஆய்வுகளுக்கு நகல் உள்ளீடுகளை ஏற்படுத்தும் நிலையான பிழை

source: Exports: fixed another non-ASCII bug
ta: ஏற்றுமதி: மற்றொரு அசி அல்லாத பிழை சரி செய்யப்பட்டது

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.8.1.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்க்க கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.8.1.html>` _

source: OpenREM Release Notes version 0.9.0
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.9.0

source: Interface: added feature to display workload stats in the home page modality tables
ta: இடைமுகம்: முகப்பு பக்க முறைமை அட்டவணையில் பணிச்சுமை புள்ளிவிவரங்களைக் காண்பிக்க நற்பொருத்தம் சேர்க்கப்பட்டது

source: Interface: added :doc:`i_fluoro_high_dose_alerts` feature
ta: இடைமுகம்: சேர்க்கப்பட்டது: டிஓசி: `i_fluoro_high_dose_alerts` நற்பொருத்தம்

source: Interface: dual-plane DX studies can now be handled in summary list and study detail pages
ta: இடைமுகம்: இரட்டை விமான டிஎக்ச் ஆய்வுகள் இப்போது சுருக்கமான பட்டியல் மற்றும் ஆய்வு விவரம் பக்கங்களில் கையாளப்படலாம்

source: Interface: new option to set display name when unique fields change based on device observer UID in RDSR
ta: இடைமுகம்: காட்சி பெயரை அமைக்க புதிய விருப்பம் RDSR இல் சாதன பார்வையாளரின் UID இன் அடிப்படையில் தனித்துவமான புலங்கள் மாறும்போது

source: Charts: added fluoroscopy charts of DAP and frequency per requested procedure, fixed bugs in links for others
ta: விளக்கப்படங்கள்: கோரப்பட்ட நடைமுறைக்கு டிஏபி மற்றும் அதிர்வெண் ஆகியவற்றின் ஃப்ளோரோச்கோபி விளக்கப்படங்கள் சேர்க்கப்பட்டன, மற்றவர்களுக்கான இணைப்புகளில் நிலையான பிழைகள்

source: Query-retrieve: handle non-return of ModalitiesInStudy correctly
ta: வினவல்-மறுபரிசீலனை: MALITALITIONSINSTUDY ஐ சரியாகக் கையாளாதது

source: Query-retrieve: increased query logging and summary feedback
ta: வினவல்-மறுபயன்பாடு: அதிகரித்த வினவல் பதிவு மற்றும் சுருக்கமான கருத்து

source: Query-retrieve: use time range in search (command line only)
ta: வினவல்-மறுபரிசீலனை: தேடலில் நேர வரம்பைப் பயன்படுத்தவும் (கட்டளை வரி மட்டும்)

source: Imports: fix for empty NumericValues in RDSR
ta: இறக்குமதி: RDSR இல் வெற்று எண் மதிப்பீடுகளை சரிசெய்யவும்

source: Imports: fix for Toshiba RDSR with incorrect multiple values in SD field for vHP
ta: இறக்குமதி: வி.எச்.பி.க்கு எச்டி புலத்தில் தவறான பல மதிப்புகளுடன் தோசிபா ஆர்.டி.எச்.ஆரை சரிசெய்யவும்

source: Imports: fix for Philips Azurion RDSR with incorrect AcquisitionDeviceType
ta: இறக்குமதிகள்: தவறான கையகப்படுத்தல் டிஇவிசெட்டிபேவுடன் பிலிப்ச் அசூரியன் ஆர்.டி.எச்.ஆரை சரிசெய்யவும்

source: Imports: fix for Varian RDSRs
ta: இறக்குமதி: மாறுபட்ட RDSRS க்கான சரிசெய்யவும்

source: Exports: made more robust for exporting malformed studies, fixed filtering bugs
ta: ஏற்றுமதி: தவறான ஆய்வுகள், நிலையான வடிகட்டுதல் பிழைகள் ஏற்றுமதி செய்வதற்கு மிகவும் வலுவானது

source: Administration: automatic e-mail alerts sent when fluoroscopy studies exceed a dose alert level
ta: நிர்வாகம்: ஃப்ளோரோச்கோபி ஆய்வுகள் ஒரு டோச் எச்சரிக்கை அளவை மீறும்போது தானியங்கி மின்னஞ்சல் எச்சரிக்கைகள் அனுப்பப்படுகின்றன

source: Administration: added facility to list and delete studies where the import failed
ta: நிர்வாகம்: இறக்குமதி தோல்வியுற்ற இடங்களில் பட்டியலிடவும் நீக்கவும் சேர்க்கப்பட்ட வசதி

source: Administration: added interface to RabbitMQ queues and Celery tasks
ta: நிர்வாகம்: ராபிட்எம்யூ வரிசைகள் மற்றும் செலரி பணிகளுக்கு இடைமுகம் சேர்க்கப்பட்டது

source: Administration: short-term fix for task performance and control on Windows
ta: நிர்வாகம்: பணி செயல்திறன் மற்றும் சாளரங்களில் கட்டுப்பாட்டுக்கான குறுகிய கால பிழைத்திருத்தம்

source: Documentation: further refinement of the linux one-page install
ta: ஆவணம்: லினக்ச் ஒரு பக்க நிறுவலின் மேலும் சுத்திகரிப்பு

source: Installation: :doc:`virtual_directory`
ta: நிறுவல் :: டிஓசி: `மெய்நிகர்_டிகரி`

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.9.0.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்க்க கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.9.0.html>` _

source: OpenREM Release Notes version 0.9.1
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 0.9.1

source: Imports: fixed imports for GE surgical flat panel c-arm with irregular value types and value meanings
ta: இறக்குமதி: ஒழுங்கற்ற மதிப்பு வகைகள் மற்றும் மதிப்பு அர்த்தங்களுடன் கீ அறுவை மருத்தீடு பிளாட் பேனல் சி-ஆர்ம் நிறுவனத்திற்கான நிலையான இறக்குமதி

source: Interface: added feature to filter by specific number of exposure types -- CT only
ta: இடைமுகம்: குறிப்பிட்ட எண்ணிக்கையிலான வெளிப்பாடு வகைகளால் வடிகட்ட நற்பொருத்தம் சேர்க்கப்பட்டது - CT மட்டும்

source: Query-retrieve: new option to get SR series when PACS returns empty series level response
ta: வினவல்-மறுபரிசீலனை: பிஏசிஎச் வெற்று தொடர் நிலை பதிலை வழங்கும்போது எச்ஆர் தொடரைப் பெற புதிய விருப்பம்

source: Query-retrieve: handle illegal missing instance number in image level response
ta: வினவல்-மறுபரிசீலனை: பட நிலை பதிலில் சட்டவிரோத காணாமல் போன நிகழ்வு எண்ணைக் கையாளவும்

source: Query-retrieve: improved logging
ta: வினவல்-மறுபயன்பாடு: மேம்படுத்தப்பட்ட பதிவு

source: Exports: added export to UK PHE 2019 CT survey format
ta: ஏற்றுமதி: யுகே PHE 2019 CT கணக்கெடுப்பு வடிவத்திற்கு ஏற்றுமதி சேர்க்கப்பட்டது

source: General documentation and interface improvements, bug fixes, and changes to prepare for Python 3
ta: பொது ஆவணங்கள் மற்றும் இடைமுக மேம்பாடுகள், பிழை திருத்தங்கள் மற்றும் பைதான் 3 க்குத் தயாராவதற்கான மாற்றங்கள்

source: For the original upgrade instructions, the last docs release to include them was `0.10.0-docs <https://docs.openrem.org/en/0.10.0-docs/release-0.9.1.html>`_
ta: அசல் மேம்படுத்தல் வழிமுறைகளுக்கு, அவற்றைச் சேர்ப்பதற்கான கடைசி டாக்ச் வெளியீடு `0.10.0-டாக்ச் <https://docs.openrem.org/en/0.10.0-docs/release-0.9.1.html>` _

source: OpenREM Release Notes version 1.0.0
ta: ஓபன்ரெம் வெளியீட்டுக் குறிப்புகள் பதிப்பு 1.0.0

source: Python 3
ta: பைதான் 3

source: Django 2.2
ta: சாங்கோ 2.2

source: Docker or direct install on Windows and Linux
ta: சாளரங்கள் மற்றும் லினக்சில் கப்பல்துறை அல்லது நேரடி நிறுவல்

source: Celery, Flower and RabbitMQ removed from requirements
ta: செலரி, மலர் மற்றும் முயல்எம்யூ தேவைகளிலிருந்து அகற்றப்பட்டது

source: Performing physician added to standard fluoroscopy exports (:issue:`840`)
ta: நிலையான ஃப்ளோரோச்கோபி ஏற்றுமதியில் சேர்க்கப்பட்ட மருத்துவர் (: வெளியீடு: `840`)

source: Station name checked at series level only, option to check at study level only instead (:issue:`772`)
ta: நிலையத்தின் பெயர் தொடர் மட்டத்தில் மட்டுமே சரிபார்க்கப்பட்டது, அதற்கு பதிலாக ஆய்வு மட்டத்தில் மட்டுமே சரிபார்க்க விருப்பம் (: வெளியீடு: `772`)

source: Upgrade from 0.10.0
ta: 0.10.0 இலிருந்து மேம்படுத்தவும்

source: Review the :doc:`installation` doc to find the upgrade options
ta: மேம்படுத்தல் விருப்பங்களைக் கண்டறிய: DOC: `நிறுவல்` ஆவணம்

source: Upgrade from an older version
ta: பழைய பதிப்பிலிருந்து மேம்படுத்தவும்

source: :doc:`upgrade_previous_0.10.0`
ta: : டாக்: `மேம்படுத்தல்_பிரெவியச்_0.10.0`

source: Release Notes and Change Log
ta: குறிப்புகளை வெளியிட்டு பதிவை மாற்றவும்

source: Version history change log
ta: பதிப்பு வரலாறு மாற்றத்தை மாற்றவும்

source: Release notes and upgrade instructions
ta: குறிப்புகளை வெளியிடுகிறது மற்றும் வழிமுறைகளை மேம்படுத்தவும்

source: Each release comes with specific upgrade instructions, so please follow the links below for the appropriate version.
ta: ஒவ்வொரு வெளியீடும் குறிப்பிட்ட மேம்படுத்தல் வழிமுறைகளுடன் வருகிறது, எனவே பொருத்தமான பதிப்பிற்கு கீழே உள்ள இணைப்புகளைப் பின்தொடரவும்.

source: Version specific information
ta: பதிப்பு குறிப்பிட்ட செய்தி

source: This release:
ta: இந்த வெளியீடு:

source: Previous releases:
ta: முந்தைய வெளியீடுகள்:

source: Contributing authors
ta: பங்களிப்பு ஆசிரியர்கள்

source: Many people have contributed to OpenREM - either with code, documentation, translations, bugs, examples or ideas, including:
ta: ஓபன்ரெமுக்கு பலர் பங்களித்துள்ளனர் - குறியீடு, ஆவணங்கள், மொழிபெயர்ப்புகள், பிழைகள், எடுத்துக்காட்டுகள் அல்லது சிந்தனைகள் உட்பட:

source: `Erlend Andersen <https://bitbuckeet.org/erlend_andersen/>`_
ta: `எர்லெண்ட் ஆண்டர்சன் <https://bitbuckeet.org/erlend_andersen/>` _

source: Elly Castellano
ta: எலி காச்டெல்லானோ

source: `Jonathan Cole <https://bitbucket.org/jacole/>`_
ta: `சொனாதன் கோல் <https://bitbucket.org/jacole/>` _

source: `Jamie Dormand <https://bitbucket.org/jamiedormand/>`_
ta: `சேமி டோர்மண்ட் <https://bitbucket.org/jamiedormand/>` _

source: `Ben Earner <https://bitbucket.org/bearner/>`_
ta: `பென் ஈடவர் <https://bitbucket.org/bearner/>` _

source: Louise Giansante Martins
ta: லூயிச் கியான்சாண்டே மார்டின்ச்

source: `Daniel Gordon <https://bitbucket.org/dan_gordon/>`_
ta: `டேனியல் கார்டன் <https://bitbucket.org/dan_gordon/>` _

source: `Hamid Khosravi <https://bitbucket.org/hrkhosravi/>`_
ta: `அமீத் கோச்ரவி <https://bitbucket.org/hrkhosravi/>` _

source: `Laurence King <https://bitbucket.org/LaurenceKing/>`_
ta: `லாரன்ச் கிங் <https://bitbucket.org/laurnessking/>` _

source: `Wens Kong <https://bitbucket.org/wens/>`_
ta: `விரும்புகிறேன் KONG <https://bitbucket.org/wens/>` _

source: `John Loveland <https://bitbucket.org/JLMPO/>`_
ta: `சான் லவ்லேண்ட் <https://bitbucket.org/jlmpo/>` _

source: `Paolo Marcheschi <https://hosted.weblate.org/user/paolo.marcheschi/>`_
ta: `பெய்னா மார்ட்க்சி <https://hosted.weblate.org/user/peolo.marchelli/>` _

source: `Ed McDonagh <https://bitbucket.org/edmcdonagh/>`_
ta: `எட் மெக்டோன்ச் <https: /bickbed.org/edmcdoine/>` _

source: `Richard Miles <https://bitbucket.org/r89m/>`_
ta: `ரிச்சர்ட் மைல்ச் <https://bitbucket.org/r89m/>` _

source: Allan Nordhøy
ta: ஆலன் நோர்தே

source: `David Platten <https://bitbucket.org/dplatten/>`_
ta: `டேவிட் பிளாட்டன் <https://bitbucket.org/dplatten/>` _

source: `Richard Raynor <https://bitbucket.org/RaynorR/>`_
ta: `ரிச்சர்ட் ரெய்னர் <https://bitbucket.org/raynorr/>` _

source: `Erik-Jan Rijkhorst <https://bitbucket.org/rijkhorst/>`_
ta: `எரிக்-சான் ரிச்கோர்ச்ட் <https://bitbucket.org/rijkhorst/> _

source: Kevin Schärer - Kantonsspital Aarau AG
ta: கெவின் சூரர் - கான்டன்ச்பிட்டல் ஆராவ் ஏ.சி.

source: `Arnold Schilham <https://bitbucket.org/asch99/>`_
ta: `அர்னால்ட் சில்ஆம் <https://bitbucket.org/asch99/>` _

source: `Marcelo Sosa <https://hosted.weblate.org/user/Msosa/>`_
ta: `மார்செலோ சோசா <https://hosted.weblate.org/user/msosa/>` _

source: `Georg Stamm <https://hosted.weblate.org/user/stamm.georg/>`_
ta: `சார்ச் ச்டாம் <https://hosted.weblate.org/user/stam.georg/>` _

source: Jannis Widmer - Kantonsspital Aarau AG
ta: சானிச் விட்மர் - கான்டன்ச்பிட்டல் ஆராவ் ஏ.சி.

source: `Tim de Wit <https://bitbucket.org/tcdewit/>`_
ta: வோர்ட்ச்சுடன் லா லேனர்,/பாபூக்டேட் ... டி

source: Daniel Wyatt
ta: டேனியல் வியாட்

source: Special thanks go to Gerd Lutters of `Kantonsspital Aarau AG <https://www.ksa.ch/zentren-kliniken/strahlenschutz-und-medizinphysik>`_ for providing ideas and and civil service computer science students to work on OpenREM (Jannis and Kevin).
ta: சிறப்பு நன்றி `கான்டன்ச்பிட்டல் ஆராவ் அக் <https://www. மற்றும் கெவின்).

source: Functionality that is available
ta: கிடைக்கும் செயல்பாடு

source: Skin dose map data is calculated to the surface of a simple geometric phantom using the in-built `openSkin`_ routines (3D phantom)
ta: தோல் டோச் வரைபட தரவு ஒரு எளிய வடிவியல் பாண்டத்தின் மேற்பரப்பில் கணக்கிடப்படுகிறது `ஓபன்ச்கின்`_ நடைமுறைகளை (3D பாண்டம்) பயன்படுத்துகிறது
