Repository: 247i/TACETr
Catalog: உரை/தானி/opentracks-opentracks-src-main-res-values-strings-xml-main-*.po
Languages: ta

# settings_default_export_uri_title
source: Track export directory
ta: ஏற்றுமதி கோப்பகத்தைக் கண்காணிக்கவும்

# field_set_primary
source: Primary
ta: முதன்மை

# field_set_secondary
source: Secondary
ta: இரண்டாம் நிலை

# field_remove_from_layout
source: Remove
ta: அகற்று

source: No compatible file manager installed
ta: இணக்கமான கோப்பு மேலாளர் எதுவும் நிறுவப்படவில்லை

# no_compatible_camera_installed
source: No compatible camera application installed
ta: இணக்கமான கேமரா பயன்பாடு எதுவும் நிறுவப்படவில்லை

# no_compatible_gallery_installed
source: No compatible image gallery application installed
ta: இணக்கமான பட கேலரி பயன்பாடு நிறுவப்படவில்லை

# error_crash_title
source: %1$s crashed
ta: %1$s செயலிழந்தன

source: Share crash report
ta: பங்கு விபத்து அறிக்கை

source: Report bug
ta: பிழையைப் புகாரளிக்கவும்

# show_on_dashboard
source: OpenTracks Dashboard API
ta: Opentracks முகப்புப்பெட்டி பநிஇ

# show_on_dashboard_not_installed
source: No application supporting OpenTracks Dashboard API installed.
ta: Opentracks டாச்போர்டு பநிஇ ஐ ஆதரிக்கும் எந்த பயன்பாடும் நிறுவப்படவில்லை.

source: Always
ta: எப்போதும்

# introduction_osm_dashboard
source: OpenTracks itself does not provide a map. Please install OSMDashboard to view your recordings on a map.
ta: ஓபன்ட்ராக்ச் ஒரு வரைபடத்தை வழங்காது. உங்கள் பதிவுகளை வரைபடத்தில் காண OSMDashboard ஐ நிறுவவும்.

# settings_recording_min_sampling_interval_title
source: Sampling time interval
ta: மாதிரி நேர இடைவெளி

# settings_recording_location_distance_summary
source: %1$s between recorded locations
ta: பதிவுசெய்யப்பட்ட இடங்களுக்கு இடையில் %1$s

# settings_announcements_lap_power
source: Lap power
ta: மடியில் ஆற்றல்

# power_x_watt
source: Power {x, plural, =1 {1 watt} other {# watts} }
ta: ஆற்றல் {x, plural, = 1 {1 watt} other {# வாட்ச்}}

source: Power
ta: விசை
