Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: A new standard name mapping can be created by an OpenREM administrator by clicking on the ``Add new XX entry`` button, where ``XX`` corresponds to a particular modality. This takes the administrator to a screen where the new standard name is set (figure 6), and where the administrator selects the ``study descriptions``, ``requested procedure names``, ``procedure names`` and ``acquisition protocol names`` that they want to be included in the new standard name definition. The available items are listed in the left-hand tables. The administrator can move a required item into the right-hand table by double-clicking on an entry, or selecting an entry and then clicking on the arrow pointing to the right.
ta: `` புதிய xx நுழைவு` பொத்தானைச் சேர் என்பதைக் சொடுக்கு செய்வதன் மூலம் ஒரு புதிய நிலையான பெயர் மேப்பிங்கை ஒரு ஓபன்ரெம் நிர்வாகியால் உருவாக்க முடியும், அங்கு `` xx`` ஒரு குறிப்பிட்ட முறைக்கு ஒத்திருக்கிறது. இது புதிய நிலையான பெயர் அமைக்கப்பட்டிருக்கும் ஒரு திரைக்கு நிர்வாகியை அழைத்துச் செல்கிறது (படம் 6), மற்றும் நிர்வாகி `` ஆய்வு விளக்கங்களை``, `` கோரப்பட்ட நடைமுறை பெயர்கள்``, `` நடைமுறை பெயர்கள்`` மற்றும் `கையகப்படுத்தல் நெறிமுறை பெயர்கள்`` அவர்கள் புதிய நிலையான பெயர் வரையறையில் சேர்க்க விரும்புகிறார்கள். கிடைக்கக்கூடிய உருப்படிகள் இடது கை அட்டவணையில் பட்டியலிடப்பட்டுள்ளன. நிர்வாகி ஒரு நுழைவை இருமுறை சொடுக்கு செய்வதன் மூலம் அல்லது ஒரு நுழைவைத் தேர்ந்தெடுத்து, வலதுபுறம் சுட்டிக்காட்டும் அம்புக்குறியைக் சொடுக்கு செய்வதன் மூலம் தேவையான உருப்படியை வலது கை அட்டவணையில் நகர்த்தலாம்.

source: Adding or modifying a standard name
ta: நிலையான பெயரைச் சேர்ப்பது அல்லது மாற்றியமைத்தல்

source: Figure 6: Adding or modifying a standard name
ta: படம் 6: நிலையான பெயரைச் சேர்ப்பது அல்லது மாற்றியமைத்தல்

source: The example in figure 7 shows that head-related ``study descriptions`` and ``requested procedure names`` have been chosen for a new standard name of ``Head``.
ta: படம் 7 இல் உள்ள எடுத்துக்காட்டு, தலை தொடர்பான `` ஆய்வு விளக்கங்கள்`` மற்றும் `` கோரப்பட்ட நடைமுறை பெயர்கள்`` ஒரு புதிய நிலையான பெயருக்கு `` தலை`` தேர்வு செய்யப்பட்டுள்ளன என்பதைக் காட்டுகிறது.

source: Once all relevant items have been transferred to the right-hand tables the ``Submit`` button at the bottom of the page must be clicked to confirm the new entry. Once a ``study description``, ``requested procedure name``, ``procedure name`` or ``acquisition protocol name`` has been assigned to a standard name it cannot be added to another standard name, and disappears as an option in the left-hand tables when configuring future new standard name entries.
ta: தொடர்புடைய அனைத்து பொருட்களும் வலது கை அட்டவணைகளுக்கு மாற்றப்பட்டவுடன், பக்கத்தின் கீழே உள்ள `` சமர்ப்பி`` பொத்தானை புதிய நுழைவை உறுதிப்படுத்த சொடுக்கு செய்ய வேண்டும். ஒரு `` ஆய்வு விளக்கம்``, `` கோரப்பட்ட நடைமுறை பெயர்``, `` நடைமுறை பெயர்`` அல்லது `` கையகப்படுத்தல் நெறிமுறை பெயர்`` ஒரு நிலையான பெயருக்கு ஒதுக்கப்பட்டுள்ளது, அதை வேறு நிலையான பெயரில் சேர்க்க முடியாது, மேலும் மறைந்துவிடும் எதிர்கால புதிய நிலையான பெயர் உள்ளீடுகளை உள்ளமைக்கும் போது இடது கை அட்டவணைகளில் ஒரு விருப்பம்.

source: Mapping a new standard name
ta: புதிய நிலையான பெயரை மேப்பிங் செய்தல்

source: Figure 7: Adding or modifying a standard name mapping
ta: படம் 7: ஒரு நிலையான பெயர் மேப்பிங்கைச் சேர்ப்பது அல்லது மாற்றியமைத்தல்

source: Modifying an existing standard name mapping
ta: ஏற்கனவே உள்ள நிலையான பெயர் மேப்பிங்கை மாற்றியமைத்தல்

source: An existing standard name mapping can be modified by clicking the ``Modify`` button on the right-hand side of an entry in the standard name mapping summary page (figure 5). This takes the administrator to the same screen as shown in figure 7, where the chosen ``study descriptions``, ``requested procedure names``, ``procedure names`` and ``acquisition protocol names`` can be amended. Clicking ``Submit`` confirms the changes.
ta: நிலையான பெயர் மேப்பிங் சுருக்கம் பக்கத்தில் (படம் 5) ஒரு நுழைவின் வலது புறத்தில் உள்ள `` மாற்றியமைத்தல்`` பொத்தானைக் சொடுக்கு செய்வதன் மூலம் ஏற்கனவே உள்ள நிலையான பெயர் மேப்பிங்கை மாற்றலாம். படம் 7 இல் காட்டப்பட்டுள்ள அதே திரைக்கு இது நிர்வாகியை அழைத்துச் செல்கிறது, அங்கு தேர்ந்தெடுக்கப்பட்ட `` ஆய்வு விளக்கங்கள்``, `` கோரப்பட்ட நடைமுறை பெயர்கள்``, `` நடைமுறை பெயர்கள்`` மற்றும் `` கையகப்படுத்தல் நெறிமுறை பெயர்கள்``. `` சமர்ப்பிக்கவும்` என்பதைக் சொடுக்கு செய்தால் மாற்றங்களை உறுதிப்படுத்துகிறது.

source: Charts of standard name data can be plotted in OpenREM. This can be helpful because at study-level it enables multiple ``study descriptions``, ``requested procedure names`` and ``procedure names`` to be combined into a single data point. At acquisition level, multiple ``acquisition protocol names`` can be combined into a single data point. For example, figure 8 below shows the median DLP for a range of ``study descriptions``. Three of the ``study descriptions`` relate to the head, and two of them relate to scans of the chest and abdomen. The three head-related descriptions have been mapped to a ``Head`` standard study name, and the two chest and abdomen descriptions have been mapped to a ``Chest + Abdomen`` standard study name, resulting in the chart shown in figure 9. The standard name mapping allows clearer visual comparison of the data per study for each hospital and piece of equipment.
ta: நிலையான பெயர் தரவுகளின் விளக்கப்படங்கள் ஓபன்ரெமில் திட்டமிடப்படலாம். இது உதவியாக இருக்கும், ஏனெனில் ஆய்வு மட்டத்தில் இது பல `` ஆய்வு விளக்கங்களை``, `` கோரப்பட்ட நடைமுறை பெயர்கள்`` மற்றும் `` நடைமுறை பெயர்கள்`` ஆகியவற்றை ஒற்றை தரவு புள்ளியாக இணைக்க உதவுகிறது. கையகப்படுத்தல் மட்டத்தில், பல `` கையகப்படுத்தல் நெறிமுறை பெயர்கள்`` ஒரு தரவு புள்ளியாக இணைக்கப்படலாம். எடுத்துக்காட்டாக, கீழே உள்ள படம் 8 `` ஆய்வு விளக்கங்கள்`` என்ற சராசரி டி.எல்.பி. `` ஆய்வு விளக்கங்கள்`` தலையுடன் தொடர்புடையது, அவற்றில் இரண்டு மார்பு மற்றும் அடிவயிற்றின் ச்கேன்களுடன் தொடர்புடையவை. மூன்று தலை தொடர்பான விளக்கங்கள் ஒரு `` தலை` தரமான ஆய்வுப் பெயருடன் வரைபடமாக்கப்பட்டுள்ளன, மேலும் இரண்டு மார்பு மற்றும் அடிவயிற்று விளக்கங்கள் `` மார்பு + அடிவயிற்று`` நிலையான ஆய்வுப் பெயருடன் வரைபடமாக்கப்பட்டுள்ளன, இதன் விளைவாக விளக்கப்படம் படத்தில் காட்டப்பட்டுள்ளது 9. நிலையான பெயர் மேப்பிங் ஒவ்வொரு மருத்துவமனைக்கும் ஒரு ஆய்வுக்கான தரவின் தெளிவான காட்சி ஒப்பீட்டை அனுமதிக்கிறது மற்றும் உபகரணங்கள்.

source: Chart of median DLP for each study description
ta: ஒவ்வொரு ஆய்வு விளக்கத்திற்கும் சராசரி டி.எல்.பியின் விளக்கப்படம்

source: Figure 8: Chart of median DLP for each study description
ta: படம் 8: ஒவ்வொரு ஆய்வு விளக்கத்திற்கும் சராசரி டி.எல்.பியின் விளக்கப்படம்

source: Chart of median DLP for each standard study name
ta: ஒவ்வொரு நிலையான ஆய்வு பெயருக்கும் சராசரி டி.எல்.பியின் விளக்கப்படம்

source: Figure 9: Chart of median DLP for each standard study name
ta: படம் 9: ஒவ்வொரு நிலையான ஆய்வு பெயருக்கும் சராசரி டி.எல்.பியின் விளக்கப்படம்

source: Start all the services
ta: அனைத்து சேவைகளையும் தொடங்கவும்

source: Test web server
ta: வலை சேவையகத்தை சோதிக்கவும்

source: In a shell/command window, move into the openrem folder:
ta: செல்/கட்டளை சாளரத்தில், ஓபன்ரெம் கோப்புறையில் செல்லுங்கள்:

source: Ubuntu linux: ``/usr/local/lib/python2.7/dist-packages/openrem/``
ta: உபுண்டு லினக்ச்: ``/usr/local/lib/python2.7/dist-packages/openrem/``

source: Other linux: ``/usr/lib/python2.7/site-packages/openrem/``
ta: பிற லினக்ச்: ``/usr/lib/python2.7/site-packages/openrem/``

source: Linux virtualenv: ``vitualenvfolder/lib/python2.7/site-packages/openrem/`` (remember to activate the virtualenv)
ta: லினக்ச் மெய்நிகர்இன்வ்: `` valialenvfolder/lib/python2.7/site-packages/openrem/`` (மெய்நிகர்இன்வை செயல்படுத்த நினைவில் கொள்ளுங்கள்)

source: Windows: ``C:\Python27\Lib\site-packages\openrem\``
ta: விண்டோச்: `` சி: \ பைதான் 27 \ லிப் \ தள-பேக்கேச்கள் \ ஓபன்ரெம் \ ``

source: Windows virtualenv: ``virtualenvfolder\Lib\site-packages\openrem\`` (remember to activate the virtualenv)
ta: சாளரங்கள் மெய்நிகர்இன்வ்: `` மெய்நிகர் ஈன்விஃபோல்டர் \ லிப் \ தள-பேக்கேச்கள் \ ஓபன்ரெம் \ `` (மெய்நிகர் ஈன்வை செயல்படுத்த நினைவில் கொள்ளுங்கள்)

source: Web access on OpenREM server only
ta: OpenREM சேவையகத்தில் வலை அணுகல் மட்டுமே

source: Run the built in web server:
ta: வலை சேவையகத்தில் கட்டப்பட்டதை இயக்கவும்:

source: Web access on other computers
ta: பிற கணினிகளில் வலை அணுகல்

source: The built-in webserver only provides a service on the computer OpenREM is installed on by default (it's only there really for testing). To view the OpenREM interface on another computer, you need to modify the ``runserver`` command:
ta: உள்ளமைக்கப்பட்ட வெப்சர்வர் கணினியில் ஒரு சேவையை மட்டுமே வழங்குகிறது ஓபன்ரெம் இயல்பாக நிறுவப்பட்டுள்ளது (இது உண்மையில் சோதனைக்கு மட்டுமே உள்ளது). மற்றொரு கணினியில் OpenREM இடைமுகத்தைக் காண, நீங்கள் `` Runserver`` கட்டளையை மாற்ற வேண்டும்:

source: This will enable the web service to be available from other computers on the network. If your server has several network cards and you want to restrict it to one, then you can use a real address rather than ``0.0.0.0``. Likewise you can specify the port (here it is ``8000``).
ta: இது வலை சேவையை பிணையத்தில் உள்ள பிற கணினிகளிலிருந்து கிடைக்க உதவும். உங்கள் சேவையகத்தில் பல பிணையம் கார்டுகள் இருந்தால், அதை ஒன்றுக்கு கட்டுப்படுத்த விரும்பினால், நீங்கள் `` 0.0.0.0`` ஐ விட உண்மையான முகவரியைப் பயன்படுத்தலாம். அதேபோல் நீங்கள் துறைமுகத்தைக் குறிப்பிடலாம் (இங்கே அது `` 8000``).

source: In a web browser on a different computer on the same network, go to http://192.168.1.10:8000/ (**changing the IP address** to the one you are running the server on) and you should see the OpenREM interface and the message about creating users.
ta: ஒரே நெட்வொர்க்கில் வேறு கணினியில் ஒரு வலை உலாவியில், http://192.168.1.10:8000/ (** ஐபி முகவரியை மாற்றுவது ** நீங்கள் சேவையகத்தை இயக்கும் ஒன்றுக்கு) பயனர்களை உருவாக்குவது பற்றிய இடைமுகம் மற்றும் செய்தி.

source: Why are we using the ``--insecure`` option? With ``DEBUG`` mode set to ``True`` the test web server would serve up the static files. In this release, ``DEBUG`` mode is set to ``False``, which prevents the test web server serving those files. The ``--insecure`` option allows them to be served again.
ta: நாம் ஏன் `` --insecure`` விருப்பத்தைப் பயன்படுத்துகிறோம்? `` பிழைத்திருத்த`` பயன்முறை `` உண்மை`` உடன் அமைக்கப்பட்டிருப்பதால், சோதனை வலை சேவையகம் நிலையான கோப்புகளை வழங்கும். இந்த வெளியீட்டில், `` பிழைத்திருத்த`` பயன்முறை `` FALSE`` ஆக அமைக்கப்பட்டுள்ளது, இது அந்தக் கோப்புகளை வழங்கும் சோதனை வலை சேவையகத்தைத் தடுக்கிறது. `` --Insecure`` விருப்பம் அவற்றை மீண்டும் வழங்க அனுமதிக்கிறது.

source: Configure the settings
ta: அமைப்புகளை உள்ளமைக்கவும்

source: Follow the link presented on the front page to get to the user and group administration.
ta: பயனர் மற்றும் குழு நிர்வாகத்தைப் பெற முதல் பக்கத்தில் வழங்கப்பட்ட இணைப்பைப் பின்தொடரவும்.

source: Initial home page with no users in groups
ta: குழுக்களில் பயனர்கள் இல்லாத ஆரம்ப முகப்பு பக்கம்

source: After the first users are configured, this link will no longer be presented and instead you can go to ``Config -> Users``.
ta: முதல் பயனர்கள் கட்டமைக்கப்பட்ட பிறகு, இந்த இணைப்பு இனி வழங்கப்படாது, அதற்கு பதிலாக நீங்கள் `` கட்டமைப்பு -> பயனர்கள்` க்கு செல்லலாம்.

source: You will need the superuser username and password you created just after creating the database. The groups are
ta: தரவுத்தளத்தை உருவாக்கிய பின் நீங்கள் உருவாக்கிய சூப்பர் யூசர் பயனர்பெயர் மற்றும் கடவுச்சொல் உங்களுக்குத் தேவைப்படும். குழுக்கள்

source: ``viewgroup`` can browse the data only
ta: `` ViewGroup`` தரவை மட்டுமே உலாவ முடியும்

source: ``importsizegroup`` can use the csv import facility to add patient height and weight information
ta: `` இறக்குமதிகள் குழு`` நோயாளியின் உயரம் மற்றும் எடை தகவல்களைச் சேர்க்க காபிம இறக்குமதி வசதியைப் பயன்படுத்தலாம்

source: ``importqrgroup`` can use the DICOM query-retrieve facility to pull in studies, as long as they are pre-configured
ta: `` இறக்குமதி QRGROUP`` DICOM வினவல்-மறுபயன்பாட்டு வசதியைப் பயன்படுத்தி ஆய்வுகளை இழுக்க, அவை முன் கட்டமைக்கப்பட்ட வரை இருக்கும் வரை

source: ``exportgroup`` can view and export data to a spreadsheet
ta: `` ஏற்றுமதி குழு`` ஒரு விரிதாளுக்கு தரவைக் காணலாம் மற்றும் ஏற்றுமதி செய்யலாம்

source: ``pidgroup`` can search using patient names and IDs depending on settings, and export with patient names and IDs if they are also a member of the ``exportgroup``
ta: `` PIDGroup`` அமைப்புகளைப் பொறுத்து நோயாளியின் பெயர்கள் மற்றும் ஐடிகளைப் பயன்படுத்தி தேடலாம், மேலும் நோயாளிகளின் பெயர்கள் மற்றும் ஐடிகளுடன் `` ஏற்றுமதி குழுவை`` இன் உறுப்பினராக இருந்தால் ஏற்றுமதி செய்யலாம்

source: ``admingroup`` can delete studies, configure DICOM Store/QR settings, configure DICOM keep or delete settings, configure patient ID settings, and abort and delete patient size import jobs. *Members of the admingroup no longer inherit the other groups permissions.*
ta: `` அட்மிங்ரூப்`` ஆய்வுகளை நீக்கலாம், DICOM STORE/QR அமைப்புகளை உள்ளமைக்கலாம், DICOM ஐ கட்டமைக்கலாம் அல்லது அமைப்புகளை நீக்கலாம், நோயாளியின் ஐடி அமைப்புகளை உள்ளமைக்கலாம் மற்றும் நோயாளியின் அளவு இறக்குமதி வேலைகளை நிறுத்தி நீக்கலாம். *அட்மிங்ரூப்பின் உறுப்பினர்கள் இனி மற்ற குழுக்கள் அனுமதிகளைப் பெறுவதில்லை.*

source: Selecting groups in Django user admin
ta: சாங்கோ பயனர் நிர்வாகியில் குழுக்களைத் தேர்ந்தெடுப்பது

source: In addition to adding users to these groups, you may like to grant a second user ``superuser`` and ``staff`` status so that there are at least two people who can manage the users
ta: இந்த குழுக்களில் பயனர்களைச் சேர்ப்பதோடு மட்டுமல்லாமல், இரண்டாவது பயனரை `` சூப்பர் யூசர்`` மற்றும் `` பணியாளர்கள்`` அந்தச்தை வழங்க விரும்பலாம், இதனால் பயனர்களை நிர்வகிக்கக்கூடிய இரண்டு நபர்கள் உள்ளனர்

source: Return to the OpenREM interface (click on ``View site`` at the top right)
ta: ஓபன்ரெம் இடைமுகத்திற்குத் திரும்புக (மேல் வலதுபுறத்தில் `` தளத்தைக் காண்க) என்பதைக் சொடுக்கு செய்க)

source: Link from Django user admin back to OpenREM
ta: சாங்கோ பயனர் நிர்வாகியிலிருந்து மீண்டும் ஓபன்ரெம் வரை இணைப்பு

source: Follow the link to see more information about how you want OpenREM to identify non-patient exposures, such as QA. See :doc:`i_not_patient_indicator`.
ta: QA போன்ற நோயாளி அல்லாத வெளிப்பாடுகளை ஓபன்ரெம் எவ்வாறு அடையாளம் காண விரும்புகிறீர்கள் என்பது பற்றிய கூடுதல் தகவலைக் காண இணைப்பைப் பின்பற்றவும். காண்க: DOC: `i_not_patient_indicator`.

source: Go to ``Config -> DICOM object delete settings`` and configure appropriately (see :doc:`i_deletesettings`)
ta: `` கட்டமைப்பு -> dicom பொருள் அமைப்புகளை நீக்கு `` க்குச் சென்று சரியான முறையில் உள்ளமைக்கவும் (பார்க்க: DOC: `i_deletesettings`)

source: Go to ``Config -> Patient ID settings`` and configure appropriately (see :doc:`patientid`)
ta: `` கட்டமைப்பு -> நோயாளி ஐடி அமைப்புகள்`` க்குச் சென்று சரியான முறையில் உள்ளமைக்கவும் (பார்க்க: டாக்: `நோயாளி ஐ)

source: If you want to use OpenREM as a DICOM store, or to use OpenREM to query remote systems, go to ``Config -> Dicom network configuration``. For more information go to :doc:`import`.
ta: நீங்கள் OpenRem ஐ DICOM கடையாகப் பயன்படுத்த விரும்பினால், அல்லது தொலைநிலை அமைப்புகளை வினவுவதற்கு OpenRem ஐப் பயன்படுத்த விரும்பினால், `` கட்டமைப்பு -> DICOM பிணையம் உள்ளமைவு`` க்குச் செல்லவும். மேலும் தகவலுக்கு: DOC: `இறக்குமதி`.

source: With data in the system, you will want to go to ``Config -> View and edit display names`` and customise the display names. An established system will have several entries for each device, from each time the software version, station name or other elements changes. See :doc:`i_displaynames` for more information
ta: கணினியில் தரவைக் கொண்டு, நீங்கள் `` கட்டமைப்பு -> காட்சி பெயர்களைக் காணவும் திருத்தவும் விரும்புவீர்கள் .` காட்சி பெயர்களைத் தனிப்பயனாக்கவும். ஒரு நிறுவப்பட்ட கணினி ஒவ்வொரு சாதனத்திற்கும் பல உள்ளீடுகளைக் கொண்டிருக்கும், ஒவ்வொரு முறையும் மென்பொருள் பதிப்பு, நிலைய பெயர் அல்லது பிற கூறுகள் மாற்றங்கள். காண்க: DOC: மேலும் தகவலுக்கு `i_displaynames`

source: Start using it - add some data!
ta: இதைப் பயன்படுத்தத் தொடங்குங்கள் - சில தரவைச் சேர்க்கவும்!

source: See :doc:`import`
ta: காண்க: டாக்: `இறக்குமதி`

source: Diagram of system components
ta: கணினி கூறுகளின் வரைபடம்

source: Alternatives
ta: மாற்று

source: 1: Web servers
ta: 1: வலை சேவையகங்கள்

source: The recommended web server for Windows is Microsoft IIS - see *to be written* docs for details. This has replaced the recommendation to use Apache due to difficulties in obtaining the required binary files, as described in the :ref:`webservers` section of the installation document.
ta: விண்டோசிற்கான பரிந்துரைக்கப்பட்ட வலை சேவையகம் மைக்ரோசாப்ட் ஐஐஎச் - விவரங்களுக்கு எழுத * எழுதப்பட வேண்டும் * டாக்ச். தேவையான பைனரி கோப்புகளைப் பெறுவதில் உள்ள சிரமங்கள் காரணமாக அப்பாச்சி பயன்படுத்துவதற்கான பரிந்துரையை இது மாற்றியுள்ளது, இதில் விவரிக்கப்பட்டுள்ளபடி: ref: நிறுவல் ஆவணத்தின் `வெப்சர்வர்ச்` பிரிவு.

source: The recommended web server for Linux is Gunicorn with NGINX - see :ref:`Install Linux webserver` for details.
ta: லினக்சிற்கான பரிந்துரைக்கப்பட்ட வலை சேவையகம் nginx உடன் KUNICORN ஆகும் - காண்க: Ref: `விவரங்களுக்கு` லினக்ச் வெப்சர்வரை நிறுவவும்.

source: Alternatively, a built-in web server is included that will suffice for testing purposes and getting started.
ta: மாற்றாக, ஒரு உள்ளமைக்கப்பட்ட வலை சேவையகம் சேர்க்கப்பட்டுள்ளது, இது சோதனை நோக்கங்களுக்காகவும் தொடங்கவும் போதுமானதாக இருக்கும்.

source: 2: DICOM Store node
ta: 2: டிகாம் கடை முனை

source: Any DICOM Store can be used, as long as it can be used to call the OpenREM import script. See :doc:`netdicom-nodes` for more details. Orthanc is the recommended DICOM Store services to use; it is installed by default in Docker, see :ref:`dicom_store_scp_linux` for Linux installation, *to be written* for Windows installation, and the :ref:`configure_third_party_DICOM` section for configuration help.
ta: ஓபன்ரெம் இறக்குமதி ச்கிரிப்டை அழைக்க எந்த டிகாம் கடையும் பயன்படுத்தலாம். காண்க: DOC: மேலும் விவரங்களுக்கு `NetDicom-nodes`. ஆர்த்தாங்க் என்பது பரிந்துரைக்கப்பட்ட டிகாம் கடை சேவைகள்; இது இயல்புநிலையாக டோக்கரில் நிறுவப்பட்டுள்ளது, காண்க: ref: `dicom_store_scp_linux` லினக்ச் நிறுவலுக்காக, * சாளரங்கள் நிறுவலுக்கு எழுதப்பட வேண்டும், மற்றும்: refigure_third_party_dicom` பிரிவு உள்ளமைவு உதவிக்கு.

source: 3: Database
ta: 3: தரவுத்தளம்

source: PostgreSQL is the recommended database to use with OpenREM. It is the only database that OpenREM will calculate median values for charts with. Other databases can be used with varying capabilities; see the `Django documentation <https://docs.djangoproject.com/en/1.8/ref/databases/>`_ for more details. For testing only, the built-in SQLite3 database can be used, but this is not suitable for later migration to a production database.
ta: OpenREM உடன் பயன்படுத்த பரிந்துரைக்கப்பட்ட தரவுத்தளமாக PostgresQL ஆகும். ஓபன்ரெம் விளக்கப்படங்களுக்கான சராசரி மதிப்புகளை கணக்கிடும் ஒரே தரவுத்தளம் இதுதான். பிற தரவுத்தளங்களை மாறுபட்ட திறன்களுடன் பயன்படுத்தலாம்; மேலும் விவரங்களுக்கு `சாங்கோ ஆவணங்கள் <https://docs.djangoproject.com/en/1.8/ref/databases/> _ _ ஐப் பார்க்கவும். சோதனைக்கு மட்டும், உள்ளமைக்கப்பட்ட SQLITE3 தரவுத்தளத்தைப் பயன்படுத்தலாம், ஆனால் இது ஒரு விளைவாக்கம் தரவுத்தளத்திற்கு பின்னர் இடம்பெயர்வதற்கு ஏற்றதல்ல.

source: Task management
ta: பணி மேலாண்மை

source: Viewing task and service statuses
ta: பணி மற்றும் பணி நிலைகளைப் பார்க்கிறது

source: Figure 1: The ``Tasks`` menu
ta: படம் 1: `` பணிகள்` `மெனு

source: Users who are logged in with admin rights can use the **Tasks** menu and choose **All tasks** to see the following:
ta: நிர்வாக உரிமைகளுடன் உள்நுழைந்திருக்கும் பயனர்கள் ** பணிகள் ** மெனுவைப் பயன்படுத்தி பின்வருவனவற்றைக் காண ** அனைத்து பணிகளையும் ** தேர்வு செய்யலாம்:

source: A list of the tasks currently being executed
ta: தற்போது செயல்படுத்தப்படும் பணிகளின் பட்டியல்

source: A list of previous tasks and their final status. If any errors occurred they will be displayed here.
ta: முந்தைய பணிகளின் பட்டியல் மற்றும் அவற்றின் இறுதி நிலை. ஏதேனும் பிழைகள் ஏற்பட்டால் அவை இங்கே காண்பிக்கப்படும்.

source: Task and service status
ta: பணி மற்றும் பணி நிலை

source: Figure 2: The task administration page
ta: படம் 2: பணி நிர்வாக பக்கம்

source: Terminating running tasks
ta: இயங்கும் பணிகளை நிறுத்துகிறது

source: It is possible to terminate any active tasks by clicking the red button. **There is no confirmation step**. Note that this immediately interrupts everything this process was doing so far, leading to things like partially imported studies. In general this should not be an issue (in case of aborted imports they should be completed when you start importing them again), but note that there is a certain risk in killing tasks and use this only as a last resort.
ta: சிவப்பு பொத்தானைக் சொடுக்கு செய்வதன் மூலம் எந்த செயலில் உள்ள பணிகளையும் நிறுத்த முடியும். ** உறுதிப்படுத்தல் படி இல்லை **. இந்த செயல்முறை இதுவரை செய்து கொண்டிருந்த அனைத்தையும் இது உடனடியாக குறுக்கிடுகிறது என்பதை நினைவில் கொள்க, இது ஓரளவு இறக்குமதி செய்யப்பட்ட ஆய்வுகள் போன்ற விசயங்களுக்கு வழிவகுக்கிறது. பொதுவாக இது ஒரு பிரச்சினையாக இருக்கக்கூடாது (கைவிடப்பட்ட இறக்குமதிகள் இருந்தால் அவற்றை மீண்டும் இறக்குமதி செய்யத் தொடங்கும் போது அவை முடிக்கப்பட வேண்டும்), ஆனால் பணிகளைக் கொல்வதில் ஒரு குறிப்பிட்ட இடர் உள்ளது என்பதை நினைவில் கொள்க, இதை கடைசி முயற்சியாக மட்டுமே பயன்படுத்துங்கள்.

source: A note on move: executing a move will create a task which then produces import tasks for all the studies it should import. This means if you intend to abort a move you should abort the task with Task type "move" and not the import tasks started by that process!
ta: நகர்வு குறித்த குறிப்பு: ஒரு நகர்வை செயல்படுத்துவது ஒரு பணியை உருவாக்கும், பின்னர் அது இறக்குமதி செய்ய வேண்டிய அனைத்து ஆய்வுகளுக்கும் இறக்குமதி பணிகளை உருவாக்குகிறது. இதன் பொருள் நீங்கள் ஒரு நகர்வை நிறுத்த விரும்பினால், நீங்கள் பணியை பணி வகை "நகர்த்து" மூலம் நிறுத்த வேண்டும், ஆனால் அந்த செயல்முறையால் தொடங்கப்பட்ட இறக்குமதி பணிகள் அல்ல!

source: Configuring the size of task history
ta: பணி வரலாற்றின் அளவை கட்டமைத்தல்

source: The status of 2000 active, recent and older tasks are stored in the OpenREM database. This limit can be altered by users who are logged in with admin rights by clicking on **Task settings** in the **Config** menu and changing the current value. If this limit is set to a very high value it can cause the web browser to run out of memory when trying to view the **Task** page due to the large number of rows in the tables.
ta: 2000 செயலில், அண்மைக் கால மற்றும் பழைய பணிகளின் நிலை ஓபன்ரெம் தரவுத்தளத்தில் சேமிக்கப்படுகிறது. ** பணி அமைப்புகள் ** ஐ ** கட்டமைப்பு ** பட்டியலில் சொடுக்கு செய்து தற்போதைய மதிப்பை மாற்றுவதன் மூலம் நிர்வாக உரிமைகளுடன் உள்நுழைந்த பயனர்களால் இந்த வரம்பை மாற்ற முடியும். இந்த வரம்பு மிக அதிக மதிப்புக்கு அமைக்கப்பட்டால், அட்டவணையில் அதிக எண்ணிக்கையிலான வரிசைகள் காரணமாக ** பணி ** பக்கத்தைக் காண முயற்சிக்கும்போது வலை உலாவி நினைவகத்தை விட்டு வெளியேறக்கூடும்.

source: Translating OpenREM strings
ta: ஓபன்ரெம் சரங்களை மொழிபெயர்க்கிறது

source: OpenREM's primary language is British English (en_GB). Users and developers with knowledge of other languages can create translations of the interface strings, export file strings and the documentation. These will then be exposed when the web browser language is set to match the new translation language (OpenREM interface) or when the language is selected for the documentation.
ta: ஓபன்ரெமின் முதன்மை மொழி பிரிட்டிச் ஆங்கிலம் (EN_GB). பயனர்கள் மற்றும் பிற மொழிகளைப் பற்றிய அறிவைக் கொண்ட உருவாக்குபவர்கள் இடைமுக சரங்கள், ஏற்றுமதி கோப்பு சரங்கள் மற்றும் ஆவணங்களின் மொழிபெயர்ப்புகளை உருவாக்க முடியும். புதிய மொழிபெயர்ப்பு மொழியை (ஓபன்ரெம் இடைமுகம்) பொருத்த வலை உலாவி மொழி அமைக்கப்படும்போது அல்லது ஆவணங்களுக்கு மொழி தேர்ந்தெடுக்கப்படும்போது இவை அம்பலப்படுத்தப்படும்.

source: A web-based service for managing translations has kindly been provided to OpenREM by Weblate. Their hosting is free to OpenREM, and they `welcome donations <https://weblate.org/en-gb/donate/>`_.
ta: மொழிபெயர்ப்புகளை நிர்வகிப்பதற்கான வலை அடிப்படையிலான பணி வலைபெயர்ப்பு மூலம் ஓபன்ரெமுக்கு வழங்கப்பட்டுள்ளது. அவர்களின் ஓச்டிங் ஓபன்ரெமுக்கு இலவசம், மேலும் அவை நன்கொடைகளை வரவேற்கின்றன <https://weblate.org/en-gb/donate/> `_.

source: Translators
ta: மொழிபெயர்ப்பாளர்கள்
