Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: The calculated doses include kVp-dependent backscatter factors and account for any copper filters using data from `this paper`_ for each irradiation event; aluminium or other filters are not considered. Where more than one kVp is stored for an irradiation event the mean kVp is calculated, excluding any zero values.
ta: கணக்கிடப்பட்ட அளவுகளில் KVP- சார்ந்த பேக்ச்கேட்டர் காரணிகள் மற்றும் ஒவ்வொரு கதிர்வீச்சு நிகழ்விற்கும் `இந்த காகித`_ இலிருந்து தரவைப் பயன்படுத்தி எந்த செப்பு வடிப்பான்களுக்கும் கணக்கு; அலுமினியம் அல்லது பிற வடிப்பான்கள் கருதப்படவில்லை. கதிர்வீச்சு நிகழ்வுக்காக ஒன்றுக்கு மேற்பட்ட கே.வி.பி சேமிக்கப்படும் இடத்தில், எந்த சுழிய மதிப்புகளையும் தவிர்த்து சராசரி கே.வி.பி கணக்கிடப்படுகிறது.

source: The phantom dimensions are calculated from the height and mass of the patient; defaults of 1.786 m and 73.2 kg are used when patient height and mass are not available
ta: பாண்டம் பரிமாணங்கள் நோயாளியின் உயரம் மற்றும் வெகுசனத்திலிருந்து கணக்கிடப்படுகின்றன; நோயாளியின் உயரம் மற்றும் நிறை கிடைக்காதபோது 1.786 மீ மற்றும் 73.2 கிலோ இயல்புநிலை பயன்படுத்தப்படுகிறது

source: Data can be calculated on import to OpenREM, or on demand when a study is viewed. Calculating the skin dose map can take several minutes.
ta: தரவுகளை ஓபன்ரெமுக்கு இறக்குமதி செய்வதில் அல்லது ஒரு ஆய்வு பார்க்கும்போது தேவைக்கேற்ப கணக்கிடலாம். தோல் டோச் வரைபடத்தை கணக்கிட பல நிமிடங்கள் ஆகலாம்.

source: Data is recalculated automatically if the patient height or mass stored in the database differs from the values stored in the skin dose map data file. This is useful when patient size information has been imported in to OpenREM after the initial skin dose map data has been calculated
ta: தரவுத்தளத்தில் சேமிக்கப்பட்ட நோயாளியின் உயரம் அல்லது வெகுசனமானது தோல் டோச் வரைபட தரவுக் கோப்பில் சேமிக்கப்பட்ட மதிப்புகளிலிருந்து வேறுபட்டால் தரவு தானாகவே மீண்டும் கணக்கிடப்படுகிறது. ஆரம்ப தோல் டோச் வரைபட தரவு கணக்கிடப்பட்ட பிறகு நோயாளியின் அளவு செய்தி ஓபன்ரெமுக்கு இறக்குமதி செய்யப்படும்போது இது பயனுள்ளதாக இருக்கும்

source: 3D skin dose map data is shown graphically as a 2D image and a 3D model
ta: 3D தோல் டோச் வரைபட தரவு 2 டி படம் மற்றும் 3D மாதிரியாக வரைபடமாக காட்டப்பட்டுள்ளது

source: The 3D model can be manipulated using a touch screen
ta: தொடுதிரை பயன்படுத்தி 3D மாடலை கையாளலாம்

source: The user can change the maximum and minimum displayed dose; alternatively, window level and width can be adjusted
ta: பயனர் அதிகபட்ச மற்றும் குறைந்தபட்ச காட்டப்பட்ட அளவை மாற்ற முடியும்; மாற்றாக, சாளர நிலை மற்றும் அகலத்தை சரிசெய்யலாம்

source: A colour dose scale is shown with a selection of colour schemes
ta: வண்ணத் திட்டங்களின் தேர்வு மூலம் வண்ண டோச் அளவு காட்டப்பட்டுள்ளது

source: The skin dose map section can be displayed full-screen
ta: தோல் டோச் வரைபடப் பகுதியை முழுத் திரையில் காட்டலாம்

source: The calculated peak skin dose, phantom dimensions, patient height, mass and orientation used for the calculations are shown in the top left hand corner of the skin dose map
ta: கணக்கிடப்பட்ட உச்ச தோல் டோச், பாண்டம் பரிமாணங்கள், நோயாளியின் உயரம், நிறை மற்றும் கணக்கீடுகளுக்கு பயன்படுத்தப்படும் நோக்குநிலை ஆகியவை தோல் டோச் வரைபடத்தின் மேல் இடது மூலையில் காட்டப்பட்டுள்ளன

source: Additionally the percentage of exposures that interact with the phantom and therefore contribute to the skin dose is shown as DAP percentage contributed, enhancing the interpretability of the skin dose calculation.
ta: கூடுதலாக, பாண்டமுடன் தொடர்பு கொள்ளும் வெளிப்பாடுகளின் விழுக்காடு, எனவே தோல் டோசுக்கு பங்களிக்கும் டிஏபி விழுக்காடு பங்களிப்பு எனக் காட்டப்படுகிறது, இது தோல் டோச் கணக்கீட்டின் விளக்கத்தை மேம்படுத்துகிறது.

source: If skin dose map display is disabled then fluoroscopy study data can be exported in a format suitable for the stand-alone openSkin routines
ta: தோல் டோச் வரைபட காட்சி முடக்கப்பட்டிருந்தால், ஃப்ளோரோச்கோபி ஆய்வு தரவை தனித்த ஓபன்ச்கின் நடைமுறைகளுக்கு ஏற்ற வடிவத்தில் ஏற்றுமதி செய்யலாம்

source: The phantom consists of a cuboid with one semi-cylinder on each side (see 3D phantom section of `phantom design`_ on the openSkin website for details).
ta: பாண்டம் ஒவ்வொரு பக்கத்திலும் ஒரு அரை சிலிண்டருடன் ஒரு க்யூபாய்டைக் கொண்டுள்ளது (விவரங்களுக்கு ஓபன்ச்கின் இணையதளத்தில் `பாண்டம் டிசைன்`_ இன் 3D பாண்டம் பிரிவு பார்க்கவும்).

source: 2D visualisation of the 3D data
ta: 3D தரவின் 2 டி காட்சிப்படுத்தல்

source: 2D visualisation of the 3D skin dose map data
ta: 3D தோல் டோச் வரைபட தரவின் 2 டி காட்சிப்படுத்தல்

source: Figure 1: 2D visualisation of the 3D data
ta: படம் 1: 3 டி தரவின் 2 டி காட்சிப்படுத்தல்

source: This is a 2D view of the whole surface of the 3D phantom, as though the phantom surface has been peeled off and laid out flat (figure 1). The 2D visualisation includes the following features:
ta: இது 3D பாண்டமின் முழு மேற்பரப்பின் 2 டி பார்வையாகும், பாண்டம் மேற்பரப்பு உரிக்கப்பட்டு தட்டையானது (படம் 1). 2 டி காட்சிப்படுத்தல் பின்வரும் அம்சங்களை உள்ளடக்கியது:

source: The skin dose at the mouse pointer is shown as a tool-tip
ta: மவுச் சுட்டிக்காட்டி தோல் டோச் ஒரு கருவி-முனை எனக் காட்டப்பட்டுள்ளது

source: Moving the mouse whilst holding down the left-hand mouse button changes the window level and width of the displayed skin dose map
ta: இடது கை சுட்டி பொத்தானை கீழே வைத்திருக்கும் போது சுட்டியை நகர்த்துவது சாளர நிலை மற்றும் காட்டப்படும் தோல் டோச் வரைபடத்தின் அகலத்தை மாற்றுகிறது

source: An overlay indicating the phantom regions and orientation can be toggled on and off. This indicates the phantom anterior, left, posterior and right sides, and also shows the superior and inferior ends (figure 2)
ta: பாண்டம் பகுதிகள் மற்றும் நோக்குநிலையைக் குறிக்கும் மேலடுக்கு ஆன் மற்றும் ஆஃப். இது பாண்டம் முன்புற, இடது, பின்புற மற்றும் வலது பக்கங்களைக் குறிக்கிறது, மேலும் உயர்ந்த மற்றும் தாழ்வான முனைகளையும் காட்டுகிறது (படம் 2)

source: 2D visualisation of the 3D skin dose map including phantom region overlay
ta: பாண்டம் பிராந்திய மேலடுக்கு உட்பட 3 டி தோல் டோச் வரைபடத்தின் 2 டி காட்சிப்படுத்தல்

source: Figure 2: Phantom region overlay
ta: படம் 2: பாண்டம் பிராந்திய மேலடுக்கு

source: The current view can be saved as a png file
ta: தற்போதைய பார்வையை பி.என்.சி கோப்பாக சேமிக்க முடியும்

source: 3D visualisation
ta: 3D காட்சிப்படுத்தல்

source: This is a 3D view of the phantom that was used for the calculations, with the skin dose map overlaid onto the surface. The 3D visualisation includes the following features:
ta: இது கணக்கீடுகளுக்குப் பயன்படுத்தப்பட்ட பாண்டமின் 3D பார்வையாகும், தோல் டோச் வரைபடம் மேற்பரப்பில் மூடப்பட்டிருக்கும். 3D காட்சிப்படுத்தல் பின்வரும் அம்சங்களை உள்ளடக்கியது:

source: Moving the mouse whilst holding down the left-hand mouse button rotates the 3D model
ta: இடது கை சுட்டி பொத்தானை கீழே வைத்திருக்கும் போது சுட்டியை நகர்த்துவது 3D மாதிரியை சுழற்றுங்கள்

source: Using the mouse wheel zooms in and out
ta: சுட்டி சக்கரத்தைப் பயன்படுத்தி உள்ளேயும் வெளியேயும் பெரிதாக்குகிறது

source: 3D visualisation of the skin dose map data
ta: தோல் டோச் வரைபட தரவின் 3D காட்சிப்படுத்தல்

source: Figure 3: 3D visualisation of the data
ta: படம் 3: தரவின் 3D காட்சிப்படுத்தல்

source: A simple 3D model of a person is displayed in the bottom left corner. This is to enable the viewer to orientate themselves when viewing the 3D skin dose map
ta: ஒரு நபரின் எளிய 3D மாதிரி கீழ் இடது மூலையில் காட்டப்படும். 3D தோல் டோச் வரைபடத்தைப் பார்க்கும்போது பார்வையாளருக்கு தங்களை நோக்குநிலைப்படுத்த இது உதவுகிறது

source: Skin dose map settings
ta: தோல் டோச் வரைபட அமைப்புகள்

source: There are two skin dose map options that can be set by an OpenREM administrator via the ``Skin dose map settings`` option in the ``Config menu``:
ta: `` கட்டமைப்பு மெனுவில்` `` தோல் டோச் வரைபட அமைப்புகள்` விருப்பத்தின் வழியாக ஓபன்ரெம் நிர்வாகியால் அமைக்கக்கூடிய இரண்டு தோல் டோச் வரைபட விருப்பங்கள் உள்ளன:

source: Enable skin dose maps
ta: தோல் டோச் வரைபடங்களை இயக்கவும்

source: Calculate skin dose maps on import
ta: இறக்குமதியில் தோல் டோச் வரைபடங்களைக் கணக்கிடுங்கள்

source: Ignore systems safelist
ta: அமைப்புகள் பாதுகாப்பானவாதியை புறக்கணிக்கவும்

source: The first of these sets whether skin dose map data is calculated, and also switches the display of skin dose maps on or off. The second option controls whether the skin dose map data is calculated at the point when a new study is imported into OpenREM, or calculated when a user first views the details of that particular study in the OpenREM interface. The third option allows the user to enables skin dose maps for systems that are not validated for OpenSkin.
ta: இவற்றில் முதலாவது தோல் டோச் வரைபடத் தரவு கணக்கிடப்பட்டதா என்பதை அமைக்கிறது, மேலும் தோல் டோச் வரைபடங்களின் காட்சியை ஆன் அல்லது ஆஃப் செய்கிறது. ஒரு புதிய ஆய்வு ஓபன்ரெமில் இறக்குமதி செய்யப்படும்போது அல்லது ஒரு பயனர் அந்த குறிப்பிட்ட ஆய்வின் விவரங்களை ஓபன்ரெம் இடைமுகத்தில் முதலில் பார்க்கும்போது கணக்கிடப்படும்போது தோல் டோச் வரைபடத் தரவு கணக்கிடப்படுகிறதா என்பதை இரண்டாவது விருப்பம் கட்டுப்படுத்துகிறது. மூன்றாவது விருப்பம் பயனருக்கு ஓபன்ச்கினுக்கு சரிபார்க்கப்படாத அமைப்புகளுக்கான தோல் டோச் வரைபடங்களை செயல்படுத்த அனுமதிக்கிறது.

source: When skin dose maps are enabled:
ta: தோல் டோச் வரைபடங்கள் இயக்கப்பட்டிருக்கும் போது:

source: When a user views the details of a fluoroscopy study OpenREM looks for a skin dose map pickle file on the OpenREM server in the ``skin_maps`` subfolder of ``MEDIA_ROOT`` that corresponds to the study being viewed. If found, the skin dose map data in the pickle file is loaded and displayed. The ``skin_maps`` folder is created if it does not exist
ta: ஒரு பயனர் ஒரு ஃப்ளோரோச்கோபி ஆய்வின் விவரங்களை ஓபன்ரெம் பார்க்கும்போது, ​​ஓபன்ரெம் சேவையகத்தில் ஒரு தோல் டோச் வரைபட ஊறுகாய் கோப்பை `` ச்கின்_மாப்ச்` `` மீடியா_ரூட்`` துணைக் கோப்புறையில் தேடும்போது, ​​அது பார்க்கப்படும் ஆய்வுக்கு ஒத்திருக்கிறது. கண்டுபிடிக்கப்பட்டால், ஊறுகாய் கோப்பில் உள்ள தோல் டோச் வரைபட தரவு ஏற்றப்பட்டு காட்டப்படும். `` ச்கின்_மாப்ச்` கோப்புறை இல்லை என்றால் அது உருவாக்கப்படுகிறது

source: If a pickle file is not found then OpenREM calculates skin dose map data. These calculations can take some time. They are carried out in the background: an animated graphic is shown during the calculations. On successful calculation of the data the skin dose map is displayed. A pickle file containing the data is saved in the server's ``skin_maps`` subfolder of ``MEDIA_ROOT``. The file name is of the form ``skin_map_XXXX.p``, where ``XXXX`` is the database primary key of the study
ta: ஒரு ஊறுகாய் கோப்பு கிடைக்கவில்லை என்றால், ஓபன்ரெம் தோல் டோச் வரைபட தரவைக் கணக்கிடுகிறது. இந்த கணக்கீடுகள் சிறிது நேரம் ஆகலாம். அவை பின்னணியில் மேற்கொள்ளப்படுகின்றன: கணக்கீடுகளின் போது அனிமேசன் கிராஃபிக் காட்டப்படுகிறது. தரவின் வெற்றிகரமான கணக்கீட்டில் தோல் டோச் வரைபடம் காட்டப்படும். தரவைக் கொண்ட ஒரு ஊறுகாய் கோப்பு `` மீடியா_ரூட்`` இன் `` ச்கின்_மாப்ச்` துணைக் கோப்புறையில் சேமிக்கப்படுகிறது. கோப்பு பெயர் `` skin_map_xxx.p`` வடிவத்தில் உள்ளது, அங்கு `` xxxx`` என்பது ஆய்வின் தரவுத்தள முதன்மை விசையாகும்

source: For subsequent views of the same study the data in the pickle file is loaded, rather than re-calculating the data, making the display of the skin dose map much quicker
ta: அதே ஆய்வின் அடுத்தடுத்த பார்வைகளுக்கு, ஊறுகாய் கோப்பில் உள்ள தரவு தரவை மீண்டும் கணக்கிடுவதை விட ஏற்றப்படுகிறது, இது தோல் டோச் வரைபடத்தின் காட்சியை மிக விரைவாக செய்கிறது

source: When calculation on import is enabled:
ta: இறக்குமதிக்கான கணக்கீடு இயக்கப்பட்டால்:

source: OpenREM calculates the skin dose map data for a fluoroscopy study as soon as it arrives in the system
ta: ஃப்ளோரோச்கோபி ஆய்வுக்கான தோல் டோச் வரைபடத் தரவை கணினியில் வந்தவுடன் ஓபன்ரெம் கணக்கிடுகிறது

source: A pickle file containing the data is saved in the ``skin_maps`` subfolder of ``MEDIA_ROOT``
ta: தரவைக் கொண்ட ஒரு ஊறுகாய் கோப்பு `` Media_root`` இன் `` ச்கின்_மாப்ச்` துணை கோப்புறையில் சேமிக்கப்படுகிறது

source: Users viewing the details of a study won't have to wait for the skin dose map data to be calculated
ta: ஒரு ஆய்வின் விவரங்களைப் பார்க்கும் பயனர்கள் தோல் டோச் வரைபடத் தரவு கணக்கிட காத்திருக்க வேண்டியதில்லை

source: Exporting data to openSkin
ta: ஓபன்ச்கினுக்கு தரவை ஏற்றுமதி செய்கிறது

source: If skin dose maps are disabled, and the user has export rights, the user is presented with the option of exporting the study data as a csv file that is formatted for use with a stand-alone installation of openSkin. The user must be in the detail view of the study they wish to create the exposure incidence map for, and then click on the link to create the OpenSkin export (figure 4).
ta: தோல் டோச் வரைபடங்கள் முடக்கப்பட்டிருந்தால், பயனருக்கு ஏற்றுமதி உரிமைகள் இருந்தால், பயனருக்கு சி.எச்.வி கோப்பாக ஆய்வுத் தரவை ஏற்றுமதி செய்யும் விருப்பத்துடன் வழங்கப்படுகிறது, இது ஓபன்ச்கின் தனித்த நிறுவலுடன் பயன்படுத்த வடிவமைக்கப்பட்டுள்ளது. பயனர் அவர்கள் வெளிப்பாடு நிகழ்வு வரைபடத்தை உருவாக்க விரும்பும் ஆய்வின் விரிவான பார்வையில் இருக்க வேண்டும், பின்னர் ஓபன்ச்கின் ஏற்றுமதியை உருவாக்க இணைப்பைக் சொடுக்கு செய்க (படம் 4).

source: Export from OpenREM to openSkin
ta: ஓபன்ரெமில் இருந்து ஓபன்ச்கினுக்கு ஏற்றுமதி

source: Figure 4: Export from OpenREM to openSkin
ta: படம் 4: ஓபன்ரெமில் இருந்து ஓபன்ச்கினுக்கு ஏற்றுமதி

source: Instructions for openSkin
ta: ஓபன்ச்கின் வழிமுறைகள்

source: Download the openSkin repository as a zip file from `openSkin downloads`_. To use openSkin as a stand-alone application you need python 2.x and the pypng python library.
ta: `ஓபன்ச்கின் பதிவிறக்கங்கள்`_ இலிருந்து சிப் கோப்பாக ஓபன்ச்கின் களஞ்சியத்தை பதிவிறக்கவும். ஓபன்ச்கின் தனித்த பயன்பாடாகப் பயன்படுத்த உங்களுக்கு பைதான் 2.x மற்றும் பிப்ங் பைதான் நூலகம் தேவை.

source: Extract the contents of the zip file into a folder on your computer and run `python main.py` from a command line and answer each question.
ta: சிப் கோப்பின் உள்ளடக்கங்களை உங்கள் கணினியில் ஒரு கோப்புறையில் பிரித்தெடுத்து, ஒரு கட்டளை வரியிலிருந்து `பைதான் மெயின்.பீ` இயக்கவும், ஒவ்வொரு கேள்விக்கும் பதிலளிக்கவும்.

source: See `phantom design`_ for details of the 2D and 3D phantoms.
ta: 2 டி மற்றும் 3 டி பாண்டம் விவரங்களுக்கு `பாண்டம் டிசைன்`_ ஐப் பார்க்கவும்.

source: When asked for the source csv file use the one exported from OpenREM
ta: மூல காபிம கோப்பைக் கேட்டபோது, ​​OpenRem இலிருந்து ஏற்றுமதி செய்யப்பட்ட ஒன்றைப் பயன்படுத்தவும்

source: Depending on the number of events in the export and the power of your computer the calculations can take a few minutes
ta: ஏற்றுமதியின் நிகழ்வுகளின் எண்ணிக்கை மற்றும் உங்கள் கணினியின் சக்தியைப் பொறுத்து கணக்கீடுகள் சில நிமிடங்கள் ஆகலாம்

source: Two files will be produced - a textfile called ``skin_dose_results.txt`` and a small image called ``skin_dose_map.png``
ta: இரண்டு கோப்புகள் தயாரிக்கப்படும் - `` skin_dose_results.txt`` எனப்படும் உரை கோப்பு மற்றும் `` skin_dose_map.png`` எனப்படும் சிறிய படம்

source: Results text file
ta: முடிவுகள் உரை கோப்பு

source: It should look something like this::
ta: இது இதுபோன்றதாக இருக்க வேண்டும் ::

source: The peak dose is the peak incident dose delivered to any one-cm-square area. If any of these 1 cm\ :sup:`2` areas (referred to as cells) are above 3 Gy, then the number of cells in this category, or the two higher dose categories, are listed in the table accordingly.
ta: உச்ச டோச் என்பது ஒரு செ.மீ-சதுர பகுதிக்கு வழங்கப்படும் உச்ச சம்பவ டோச் ஆகும். இந்த 1 செ.மீ \: sup: `2` பகுதிகள் (செல்கள் என குறிப்பிடப்படுகின்றன) 3 Gy க்கு மேல் இருந்தால், இந்த வகையின் கலங்களின் எண்ணிக்கை அல்லது இரண்டு உயர் டோச் வகைகள் அதற்கேற்ப அட்டவணையில் பட்டியலிடப்பட்டுள்ளன.

source: Incidence map image file
ta: நிகழ்வு வரைபட படக் கோப்பு

source: The image file will be a small 70x90 px PNG image if you used the 3D phantom, or 150 x 50 px PNG if you used the 2D phantom. With both, the head end of the table is on the left.
ta: நீங்கள் 3D பாண்டம் பயன்படுத்தினால் படக் கோப்பு ஒரு சிறிய 70x90 px png படமாக இருக்கும், அல்லது நீங்கள் 2D பாண்டம் பயன்படுத்தினால் 150 ஃச் 50 px png. இரண்டையும் கொண்டு, அட்டவணையின் தலை முனை இடதுபுறத்தில் உள்ளது.

source: The image is scaled so that black is 0 Gy and white is 10 Gy. For most studies, this results in an incidence map that is largely black. However, if you use `GIMP`_ or `ImageJ`_ or similar to increase the contrast, you will find that the required map is there.
ta: படம் அளவிடப்படுகிறது, இதனால் கருப்பு 0 Gy மற்றும் வெள்ளை 10 Gy ஆகும். பெரும்பாலான ஆய்வுகளுக்கு, இது பெரும்பாலும் கருப்பு நிறத்தில் இருக்கும் ஒரு நிகழ்வு வரைபடத்தில் விளைகிறது. இருப்பினும், நீங்கள் `GIMP`_ அல்லது` imageJ`_ அல்லது மாறுபாட்டை அதிகரிக்க ஒத்ததாக இருந்தால், தேவையான வரைபடம் இருப்பதைக் காண்பீர்கள்.

source: A native and 'colour equalised' version of the same export are shown below:
ta: ஒரே ஏற்றுமதியின் சொந்த மற்றும் 'வண்ண சமநிலைப்படுத்தப்பட்ட' பதிப்பு கீழே காட்டப்பட்டுள்ளது:

source: OpenSkin incidence map, unscaled
ta: ஓபன்ச்கின் நிகழ்வு வரைபடம், இணைக்கப்படாதது

source: OpenSkin incidence map, scaled
ta: ஓபன்ச்கின் நிகழ்வு வரைபடம், அளவிடப்பட்டது

source: Limitations
ta: வரம்புகள்

source: Skin dose map calculations do not currently work for all systems. Siemens Artis Zee data is known to work. If skin dose maps do not work for your systems then please let us know via the `OpenREM Google Group`_.
ta: தோல் டோச் வரைபடக் கணக்கீடுகள் தற்போது அனைத்து அமைப்புகளுக்கும் வேலை செய்யாது. சீமென்ச் ஆர்ட்டிச் சீ தரவு வேலை செய்யப்படுகிறது. உங்கள் கணினிகளுக்கு தோல் டோச் வரைபடங்கள் வேலை செய்யவில்லை என்றால், தயவுசெய்து `ஓபன்ரெம் கூகிள் குழு`_ வழியாக எங்களுக்குத் தெரியப்படுத்துங்கள்.

source: `openSkin`_ is yet to be validated independently - if this is something you want to do, please do go ahead and feed back your findings to Jonathan Cole at `jacole`_.
ta: `ஓபன்ச்கின்`_ இன்னும் சுயாதீனமாக சரிபார்க்கப்படவில்லை - இது நீங்கள் செய்ய விரும்பும் ஒன்று என்றால், தயவுசெய்து மேலே சென்று உங்கள் கண்டுபிடிப்புகளை` சாகோல்`_ இல் மீண்டும் உணவளிக்கவும்.

source: Standard name mapping
ta: நிலையான பெயர் மேப்பிங்

source: Introduction
ta: அறிமுகம்

source: The OpenREM config menu
ta: ஓபன்ரெம் கட்டமைப்பு பட்டியல்

source: Figure 1: The config menu
ta: படம் 1: கட்டமைப்பு பட்டியல்

source: The same type of examination can appear in OpenREM under a range of different ``requested procedure names``, ``study descriptions`` or ``procedure names``. Individual acquistions of the same type may appear under a range of different ``acquisition protocol names``. The standard name mapping feature allows a number of differently named exams or acquisitions to be grouped into a single standard name, allowing easier analysis of data for audits and diagnostic reference level (DRL) creation (see DRL definition on the IAEA_ website).
ta: ஒரே மாதிரியான தேர்வுகள் ஓபன்ரெமில் வேறுபட்ட `` கோரப்பட்ட நடைமுறை பெயர்கள்``, `` ஆய்வு விளக்கங்கள்`` அல்லது `` நடைமுறை பெயர்கள்`` ஆகியவற்றின் கீழ் தோன்றலாம். ஒரே வகையின் தனிப்பட்ட கையகப்படுத்துதல்கள் வெவ்வேறு `` கையகப்படுத்தல் நெறிமுறை பெயர்களின் `` இன் வரம்பின் கீழ் தோன்றக்கூடும். நிலையான பெயர் மேப்பிங் நற்பொருத்தம் வித்தியாசமாக பெயரிடப்பட்ட பல தேர்வுகள் அல்லது கையகப்படுத்துதல்களை ஒற்றை நிலையான பெயராக தொகுக்க அனுமதிக்கிறது, இது தணிக்கைகள் மற்றும் கண்டறியும் குறிப்பு நிலை (டிஆர்எல்) உருவாக்கத்திற்கான தரவை எளிதாக பகுப்பாய்வு செய்ய அனுமதிக்கிறது (IAEA_ இணையதளத்தில் DRL வரையறையைப் பார்க்கவும்).

source: If the logged in user is an OpenREM adminstrator the ``standard name settings`` option will be available on the ``Config`` drop down menu (figure 1). Clicking on this will take the administrator to the standard name mapping settings page (figure 2). From this page the administrator can enable or disable standard name mapping for the OpenREM installation. Enabling standard name mapping causes an additional column to be displayed in each modality summary page where any standard study-level names associated with each entry in the exam table are displayed (figure 3), and when viewing the details of an individual study any matching standard acquisition names are displayed in the appropriate table row (figure 4). Enabling standard name mapping also makes the standard study name and standard acquisition name charts available. The administrator can also use the ``standard name settings`` page to access the standard name internal database refresh links. Note that the use of these links is not expected to be necessary in normal OpenREM use.
ta: உள்நுழைந்த பயனர் ஒரு ஓபன்ரெம் அட்மின்ச்ட்ரேட்டராக இருந்தால், `` நிலையான பெயர் அமைப்புகள்`` விருப்பம் `` உள்ளமைவு`` கீழ்தோன்றும் பட்டியலில் (படம் 1) கிடைக்கும். இதைக் சொடுக்கு செய்தால் நிர்வாகியை நிலையான பெயர் மேப்பிங் அமைப்புகள் பக்கத்திற்கு அழைத்துச் செல்லும் (படம் 2). இந்த பக்கத்திலிருந்து நிர்வாகி ஓபன்ரெம் நிறுவலுக்கான நிலையான பெயர் மேப்பிங்கை இயக்கலாம் அல்லது முடக்கலாம். நிலையான பெயர் மேப்பிங்கை இயக்குவது ஒவ்வொரு முறை சுருக்கமான பக்கத்திலும் கூடுதல் நெடுவரிசையைக் காட்ட காரணமாகிறது, அங்கு தேர்வு அட்டவணையில் உள்ள ஒவ்வொரு நுழைவுடனும் தொடர்புடைய எந்தவொரு நிலையான ஆய்வு-நிலை பெயர்களும் காட்டப்படும் (படம் 3), மற்றும் ஒரு தனிப்பட்ட ஆய்வின் விவரங்களை எந்த பொருந்தக்கூடிய தரத்தைப் பார்க்கும்போது கையகப்படுத்தல் பெயர்கள் பொருத்தமான அட்டவணை வரிசையில் காட்டப்படும் (படம் 4). நிலையான பெயர் மேப்பிங்கை இயக்குவது நிலையான ஆய்வு பெயர் மற்றும் நிலையான கையகப்படுத்தல் பெயர் விளக்கப்படங்களை கிடைக்கச் செய்கிறது. நிலையான பெயர் உள் தரவுத்தள புதுப்பிப்பு இணைப்புகளை அணுக நிர்வாகி `` நிலையான பெயர் அமைப்புகள்` `பக்கத்தையும் பயன்படுத்தலாம். சாதாரண ஓபன்ரெம் பயன்பாட்டில் இந்த இணைப்புகளின் பயன்பாடு அவசியமில்லை என்று எதிர்பார்க்கப்படவில்லை என்பதை நினைவில் கொள்க.

source: The standard name mapping settings page
ta: நிலையான பெயர் மேப்பிங் அமைப்புகள் பக்கம்

source: Figure 2: The standard name mapping settings page
ta: படம் 2: நிலையான பெயர் மேப்பிங் அமைப்புகள் பக்கம்

source: Standard study names visible in the CT summary page
ta: CT சுருக்கம் பக்கத்தில் நிலையான ஆய்வு பெயர்கள் தெரியும்

source: Figure 3: Standard study names visible in the CT summary page
ta: படம் 3: CT சுருக்கம் பக்கத்தில் நிலையான ஆய்வு பெயர்கள் தெரியும்

source: Standard acquisition names visible in a study details page
ta: நிலையான கையகப்படுத்தல் பெயர்கள் ஒரு ஆய்வு விவரங்கள் பக்கத்தில் தெரியும்

source: Figure 4: Standard acquisition names visible in a study details page
ta: படம் 4: நிலையான கையகப்படுத்தல் பெயர்கள் ஒரு ஆய்வு விவரங்கள் பக்கத்தில் தெரியும்

source: Selecting the ``standard name mapping`` option within the ``Config`` drop down menu (figure 1) will take the user to the standard name mapping summary page(figure 5). This page shows any existing standard name mappings, which an OpenREM administrator is able to ``Modify`` or ``Delete`` using the buttons on the right hand side of each entry. A normal OpenREM user can only view standard name mappings.
ta: `` Config`` கீழ்தோன்றும் பட்டியலில் (படம் 1) `` நிலையான பெயர் மேப்பிங்`` விருப்பத்தைத் தேர்ந்தெடுப்பது பயனரை நிலையான பெயர் மேப்பிங் சுருக்கம் பக்கத்திற்கு அழைத்துச் செல்லும் (படம் 5). இந்த பக்கம் தற்போதுள்ள எந்தவொரு நிலையான பெயர் மேப்பிங்சையும் காட்டுகிறது, இது ஒரு ஓபன்ரெம் நிர்வாகி ஒவ்வொரு நுழைவின் வலது புறத்தில் உள்ள பொத்தான்களைப் பயன்படுத்தி `` மாற்றியமைக்கவும் அல்லது `நீக்கு`. ஒரு சாதாரண ஓபன்ரெம் பயனர் நிலையான பெயர் வரைபடங்களை மட்டுமே பார்க்க முடியும்.

source: The standard name mapping summary page
ta: நிலையான பெயர் மேப்பிங் சுருக்கம் பக்கம்

source: Figure 5: The standard name mapping summary page
ta: படம் 5: நிலையான பெயர் மேப்பிங் சுருக்கம் பக்கம்

source: Creating a new standard name mapping
ta: புதிய நிலையான பெயர் மேப்பிங்கை உருவாக்குதல்
