Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: Copy the database backup to the ``db_backup/`` folder of the new install (the name is assumed to be ``openremdump.bak``, change as necessary)
ta: தரவுத்தள காப்புப்பிரதியை புதிய நிறுவலின் `` db_backup/`` கோப்புறையில் நகலெடுக்கவும் (பெயர் `` OpenRemdump.bak``, தேவையானதை மாற்றவும் என்று கருதப்படுகிறது)

source: Open a shell (command prompt) in the new install folder (where ``docker-compose.yml`` is)
ta: புதிய நிறுவல் கோப்புறையில் செல் (கட்டளை வரியில்) திறக்கவும் (அங்கு `` டோக்கர்-கம்ப்.ஒய்.எம்.எல் .``)

source: You may get an error about the public schema, this is normal.
ta: பொதுத் திட்டத்தைப் பற்றி உங்களுக்கு பிழை ஏற்படலாம், இது சாதாரணமானது.

source: Get the database ready and set up Django:
ta: தரவுத்தளத்தை ஆயத்தம் செய்து சாங்கோவை அமைக்கவும்:

source: The OpenREM server should now be ready to use again.
ta: ஓபன்ரெம் சேவையகம் இப்போது மீண்டும் பயன்படுத்த தயாராக இருக்க வேண்டும்.

source: Advanced
ta: மேம்பட்ட

source: These methods should not be required in normal use; only do this if you know what you are doing!
ta: இந்த முறைகள் சாதாரண பயன்பாட்டில் தேவையில்லை; நீங்கள் என்ன செய்கிறீர்கள் என்று உங்களுக்குத் தெரிந்தால் மட்டுமே இதைச் செய்யுங்கள்!

source: Start the PostgreSQL console:
ta: Postgresql கன்சோலைத் தொடங்கவும்:

source: pgAdmin or other PostgreSQL connections
ta: PGADMIN அல்லது பிற postgresql இணைப்புகள்

source: To access the database directly by pgAdmin or other software, the ports must be exposed.
ta: PGADMIN அல்லது பிற மென்பொருளால் நேரடியாக தரவுத்தளத்தை அணுக, துறைமுகங்கள் அம்பலப்படுத்தப்பட வேண்டும்.

source: Edit ``docker-compose.yml`` to add the ports:
ta: துறைமுகங்களைச் சேர்க்க `` docker-compose.yml`` ஐத் திருத்தவும்:

source: If you have a database already running on the host machine, this port will prevent the container starting. In this case, change the first number in the pair to an alternative port.
ta: புரவலன் கணினியில் ஏற்கனவே இயங்கும் தரவுத்தளம் உங்களிடம் இருந்தால், இந்த துறைமுகம் கொள்கலன் தொடங்குவதைத் தடுக்கும். இந்த வழக்கில், சோடியின் முதல் எண்ணை மாற்று துறைமுகமாக மாற்றவும்.

source: The service will be accessible on the host machine after the containers are taken down and up again:
ta: கொள்கலன்களைக் கழற்றி மீண்டும் மேலே வந்த பிறகு புரவலன் கணினியில் சேவையை அணுக முடியும்:

source: Linux installations
ta: லினக்ச் நிறுவல்

source: Check the database username and change in the command below as necessary (``openremuser``)
ta: தரவுத்தள பயனர்பெயரை சரிபார்த்து, தேவையான கட்டளையில் மாற்றவும் (`` OpenReMuser``)

source: Check the database name and change in the command below as necessary (``openremdb``)
ta: தரவுத்தள பெயரைச் சரிபார்த்து, கீழே உள்ள கட்டளையில் மாற்றவும் (`` OpenRemDB``)

source: You will need the password for ``openremuser``
ta: `` OpenReMuser`` க்கான கடவுச்சொல் உங்களுக்குத் தேவைப்படும்

source: Ad hoc:
ta: இதற்கு:

source: Requires the same version of OpenREM to be installed as the database was exported from, unless you are :doc:`upgrade_linux` or :doc:`upgrade_linux_new_server`.
ta: நீங்கள் இல்லாவிட்டால், தரவுத்தளம் ஏற்றுமதி செய்யப்படுவதால் OpenREM இன் அதே பதிப்பு நிறுவப்பட வேண்டும்: DOC: `UPGRADE_LINUX` அல்லது: DOC:` UPGRADE_LINUX_NEW_SERVER`.

source: Username can be changed on restore by specifying the new user in the restore command. The user must exist in PostgreSQL though - ``sudo -u postgres createuser -P openremuser`` if required
ta: மீட்டெடுப்பு கட்டளையில் புதிய பயனரைக் குறிப்பிடுவதன் மூலம் மீட்டமைப்பில் பயனர்பெயரை மாற்றலாம். தேவைப்பட்டால் `` sudo -u postgres createUser -p openremuser``

source: ``openrem/remapp/migrations/`` should be empty except ``__init__.py``
ta: `` __init __. py`` தவிர `` OpenRem/remapp/இடம்பெயர்வு/`` காலியாக இருக்க வேண்டும்

source: Update the ``local_settings.py`` file with the new database details, as per :ref:`updatelinuxconfig`
ta: புதிய தரவுத்தள விவரங்களுடன் `` local_settings.py`` கோப்பைப் புதுப்பிக்கவும், இது: ref: `Updatelinuxconfig`

source: Set up the new database with Django/OpenREM after activating the virtualenv and moving to the ``site-packages/openrem`` folder:
ta: மெய்நிகர்இன்வியை செயல்படுத்திய பின் சாங்கோ/ஓபன்ரெம் உடன் புதிய தரவுத்தளத்தை அமைக்கவும், `` தள-பேக்கேச்கள்/ஓபன்ரெம்` `கோப்புறைக்கு நகர்த்தவும்:

source: Windows installations
ta: சாளரங்கள் நிறுவல்கள்

source: You will need to edit the command for the path to ``pg_dump.exe`` - the ``14`` is likely to be a lower number
ta: `` Pg_dump.exe`` க்கான பாதைக்கான கட்டளையை நீங்கள் திருத்த வேண்டும் - `` 14``

source: To automate a regular backup (**recommended**) adapt the following command in a bat script:
ta: வழக்கமான காப்புப்பிரதியை தானியக்கமாக்குவதற்கு (** பரிந்துரைக்கப்படுகிறது **) பின்வரும் கட்டளையை பேட் ச்கிரிப்டில் மாற்றியமைக்கவும்:

source: Content to be added!
ta: சேர்க்கப்பட வேண்டிய உள்ளடக்கம்!

source: Requires the same version of OpenREM to be installed as the database was exported from, unless you are :doc:`upgrade_windows` or :doc:`upgrade_windows_new_server`.
ta: நீங்கள் இல்லாவிட்டால், தரவுத்தளம் ஏற்றுமதி செய்யப்படுவதால் OpenREM இன் அதே பதிப்பு நிறுவப்பட வேண்டும்: DOC: `UPGRADE_WINDOWS` அல்லது: DOC:` UPGRADE_WINDOWS_NEW_SERVER`.

source: Username can be changed on restore by specifying the new user in the restore command. The user must exist in PostgreSQL though - create the user in pgAdmin if required
ta: மீட்டெடுப்பு கட்டளையில் புதிய பயனரைக் குறிப்பிடுவதன் மூலம் மீட்டமைப்பில் பயனர்பெயரை மாற்றலாம். பயனர் Postgresql இல் இருக்க வேண்டும் - தேவைப்பட்டால் PGADMIN இல் பயனரை உருவாக்கவும்

source: ``openrem\remapp\migrations\`` should be empty except ``__init__.py``
ta: `` __init __. py`` தவிர `` OpenRem \ remapp \ இடம்பெயர்வு `` தவிர காலியாக இருக்க வேண்டும்

source: Update the ``local_settings.py`` file with the new database details, as per :ref:`updatewindowsconfig`
ta: புதிய தரவுத்தள விவரங்களுடன் `` local_settings.py`` கோப்பைப் புதுப்பிக்கவும்: ref: `Updatewindowsconfig`

source: Set up the new database with Django/OpenREM after activating the virtualenv and moving to the ``site-packages\openrem`` folder:
ta: மெய்நிகர் ஈன்வை செயல்படுத்திய பின் சாங்கோ/ஓபன்ரெம் உடன் புதிய தரவுத்தளத்தை அமைக்கவும், `` தள-பேக்கேச்கள் \ ஓபன்ரெம்`` கோப்புறைக்கு நகர்த்தவும்:

source: DICOM store configuration (Orthanc)
ta: டிகாம் கடை உள்ளமைவு (ஆர்த்தாங்க்)

source: Orthanc provides the DICOM Store functionality to enable scanners to send directly to OpenREM, and for query-retrieve to function. Configuration is in the orthanc section of ``docker-compose.yml``
ta: ஆர்த்தாங்க் ச்கேனர்களை நேரடியாக ஓபன்ரெமுக்கு அனுப்பவும், வினவல்-மறுஉருவாக்கம் செயல்படவும் டிகாம் கடை செயல்பாட்டை வழங்குகிறது. உள்ளமைவு `` docker-compose.yml`` இன் ஆர்த்தாங்க் பிரிவில் உள்ளது

source: OpenREM Lua script configuration
ta: ஓபன்ரெம் லுவா ச்கிரிப்ட் உள்ளமைவு

source: This file is formatted as YAML:
ta: இந்த கோப்பு YAML என வடிவமைக்கப்பட்டுள்ளது:

source: Strings need to quoted or placed on a new line after a ``|``
ta: `` | `` க்குப் பிறகு சரங்கள் மேற்கோள் காட்ட வேண்டும் அல்லது புதிய வரியில் வைக்க வேண்டும்

source: A ``:`` and a space separate the variable name and the value, and spaces are used at the start of the line to create a hierarchy. See the examples below.
ta: ஒரு ``: `` மற்றும் ஒரு இடம் மாறி பெயரையும் மதிப்பையும் பிரிக்கவும், மற்றும் ஒரு படிநிலையை உருவாக்க வரியின் தொடக்கத்தில் இடைவெளிகள் பயன்படுத்தப்படுகின்றன. கீழே உள்ள எடுத்துக்காட்டுகளைக் காண்க.

source: Edit the ``docker-compose.yml`` file to make the changes. They will take effect next time ``docker-compose up -d`` is run.
ta: மாற்றங்களைச் செய்ய `` docker-compose.yml`` கோப்பைத் திருத்தவும். அடுத்த முறை `` கப்பல்துறை -கம்ப் அப் -d`` இயக்கப்படும் போது அவை நடைமுறைக்கு வரும்.

source: Find the ``orthanc_1`` definition near the end of the file.
ta: கோப்பின் முடிவில் `` ஆர்த்தாங்க்_1`` வரையறையைக் கண்டறியவும்.

source: Objects to be ignored
ta: புறக்கணிக்கப்பட வேண்டிய பொருள்கள்

source: Lists of things to ignore. Orthanc will ignore anything matching the content of these comma separated lists: they will not be imported into OpenREM. Some examples have been added below - note the formatting syntax. ``STATION_NAMES_TO_IGNORE`` has the value on a new line with a ``|`` instead of being quoted, to show this syntax option:
ta: புறக்கணிக்க வேண்டிய விசயங்களின் பட்டியல்கள். இந்த கமா பிரிக்கப்பட்ட பட்டியல்களின் உள்ளடக்கத்துடன் பொருந்தக்கூடிய எதையும் ஆர்த்தாங்க் புறக்கணிக்கும்: அவை ஓபன்ரெமில் இறக்குமதி செய்யப்படாது. சில எடுத்துக்காட்டுகள் கீழே சேர்க்கப்பட்டுள்ளன - வடிவமைப்பு தொடரியல் கவனியுங்கள். `` Station_names_to_ignore`` இந்த தொடரியல் விருப்பத்தைக் காட்ட, மேற்கோள் காட்டப்படுவதற்கு பதிலாக `` | `` ஒரு புதிய வரியில் மதிப்பைக் கொண்டுள்ளது:

source: Extractor for older Toshiba CT dose summary files
ta: பழைய தோசிபா சி.டி டோச் சுருக்க கோப்புகளுக்கான பிரித்தெடுத்தல்

source: Enable or disable additional functionality to extract dose information from older Toshiba and GE scanners, and specify which CT scanners should use this method. Each system should be listed as ``{'Manufacturer', 'Model name'}``, with systems in a comma separated list within curly brackets, as per the example below:
ta: பழைய தோசிபா மற்றும் சி.இ. ச்கேனர்களிடமிருந்து டோச் தகவல்களைப் பிரித்தெடுக்க கூடுதல் செயல்பாட்டை இயக்கவும் அல்லது முடக்கவும், மேலும் இந்த முறையை எந்த சி.டி ச்கேனர்கள் பயன்படுத்த வேண்டும் என்பதைக் குறிப்பிடவும். ஒவ்வொரு அமைப்பும் `` {'உற்பத்தியாளர்', 'மாதிரி பெயர்'} `` என பட்டியலிடப்பட வேண்டும், கமாவைப் பிரிக்கப்பட்ட பட்டியலில் சுருள் அடைப்புக்குறிக்குள், கீழே உள்ள எடுத்துக்காட்டு படி:

source: Physics Filtering
ta: இயற்பியல் வடிகட்டுதல்

source: Set this to true if you want Orthanc to keep physics test studies, and have it put them in the ``imports/physics/`` folder. Set it to ``"false"`` to disable this feature
ta: ஆர்த்தாங்க் இயற்பியல் சோதனை ஆய்வுகளை வைத்திருக்க விரும்பினால் இதை உண்மை என அமைக்கவும், அவற்றை `` இறக்குமதி/இயற்பியல்/`` கோப்புறையில் வைக்கவும். இந்த அம்சத்தை முடக்க `` "பொய்" `` என அமைக்கவும்

source: A list to check against patient name and ID to see if the images should be kept.
ta: நோயாளியின் பெயர் மற்றும் ஐடியுக்கு எதிராக சரிபார்க்க ஒரு பட்டியல் படங்களை வைக்க வேண்டுமா என்பதைப் பார்க்க.

source: Orthanc Configuration
ta: ஆர்த்தாங்க் உள்ளமைவு

source: This section is formatted as JSON. It can contain any configuration options that appear in the standard Orthanc ``orthanc.json`` file, but the ones that are needed for OpenREM are included as standard and described below.
ta: இந்த பிரிவு சாதொபொகு ஆக வடிவமைக்கப்பட்டுள்ளது. இது நிலையான ஆர்த்தாங்க் `` ஆர்த்தாங்க்.சோன்`` கோப்பில் தோன்றும் எந்த உள்ளமைவு விருப்பங்களையும் கொண்டிருக்கலாம், ஆனால் ஓபன்ரெமுக்குத் தேவையானவை தரமாக சேர்க்கப்பட்டு கீழே விவரிக்கப்பட்டுள்ளன.

source: Strings need to quoted with double quotes ``"``.
ta: சரங்களை இரட்டை மேற்கோள்களுடன் மேற்கோள் காட்ட வேண்டும் `` "` `.

source: DICOM Application Entity Title
ta: DICOM பயன்பாட்டு நிறுவன தலைப்பு

source: Application Entity Title of the Store Server. Should be up to 16 characters, no spaces. This server isn't fussy by default, so if remote nodes connect using a different AETitle that is ok.
ta: கடை சேவையகத்தின் பயன்பாட்டு நிறுவன தலைப்பு. 16 எழுத்துக்கள் வரை இருக்க வேண்டும், இடைவெளிகள் இல்லை. இந்த சேவையகம் இயல்புநிலையாக வம்பு இல்லை, எனவே தொலைநிலை முனைகள் வேறு ஏட்டிடலைப் பயன்படுத்தி இணைந்தால் சரி.

source: DICOM Port
ta: டிகாம் துறைமுகம்

source: The default port for DICOM store is set to ``104``.
ta: DICOM கடைக்கான இயல்புநிலை துறைமுகம் `` 104`` ஆக அமைக்கப்பட்டுள்ளது.

source: To use a different port, change the first number of the pair in ports. The first number is the port exposed outside of Docker, the second number is used internally by the Orthanc container.
ta: வேறு துறைமுகத்தைப் பயன்படுத்த, துறைமுகங்களில் உள்ள சோடியின் முதல் எண்ணை மாற்றவும். முதல் எண் டோக்கருக்கு வெளியே வெளிப்படும் துறைமுகமாகும், இரண்டாவது எண் ஆர்த்தாங்க் கொள்கலனால் உள்நாட்டில் பயன்படுத்தப்படுகிறது.

source: For example, to use port 8104:
ta: எடுத்துக்காட்டாக, துறைமுகம் 8104 ஐப் பயன்படுத்த:

source: Orthanc web interface
ta: ஆர்த்தாங்க் வலை இடைமுகம்

source: There will normally not be any studies in the Orthanc database once they have been processed, but if you want to enable the Orthanc web viewer, enable the port in and set ``RemoteAccessAllowed`` to ``true`` in the ``ORTHANC_JSON`` section. The first number in the port configuration can be changed if required:
ta: ஆர்த்தாங்க் தரவுத்தளத்தில் அவை செயலாக்கப்பட்டவுடன் பொதுவாக எந்த ஆய்வும் இருக்காது, ஆனால் நீங்கள் ஆர்த்தாங்க் வலை பார்வையாளரை இயக்க விரும்பினால், துறைமுகத்தை இயக்கவும் `` `உண்மை`` `` `ஆர்த்தாங்க்_ச்சன் `` பிரிவு. துறைமுகம் உள்ளமைவின் முதல் எண்ணை தேவைப்பட்டால் மாற்றலாம்:

source: Lua script path
ta: லுவா ச்கிரிப்ட் பாதை

source: The path within the Orthanc container for the OpenREM Lua script is specified here - this should not be changed (see below for advanced options).
ta: ஓபன்ரெம் லுவா ச்கிரிப்ட்டிற்கான ஆர்த்தாங்க் கொள்கலனுக்குள் உள்ள பாதை இங்கே குறிப்பிடப்பட்டுள்ளது - இதை மாற்றக்கூடாது (மேம்பட்ட விருப்பங்களுக்கு கீழே காண்க).

source: Advanced options
ta: மேம்பட்ட விருப்பங்கள்

source: Multiple stores
ta: பல கடைகள்

source: If you need more than one DICOM Store server, to listen on a different port for example, copy the whole ``orthanc_1`` section in ``docker-compose.yml`` and paste it after the ``orthanc_1`` block. Rename to ``orthanc_2``.
ta: உங்களுக்கு ஒன்றுக்கு மேற்பட்ட DICOM STORE சேவையகம் தேவைப்பட்டால், வேறு துறைமுகத்தில் கேட்க, `` டோக்கர்-கமோச்போச்.ஒய்.எம்.எல்`` இல் முழு `` ஆர்த்தாங்க்_1`` பகுதியையும் நகலெடுத்து `` ஆர்த்தாங்க்_1`` தொகுதிக்குப் பிறகு ஒட்டவும். `` ஆர்த்தாங்க்_2`` என மறுபெயரிடுங்கள்.

source: Next time ``docker-compose`` is started the additional Orthanc container will be started. ``docker-compose.yml`` is also used to stop the containers, so if you are removing the additional Orthanc container stop the containers first.
ta: அடுத்த முறை `` டோக்கர்-சமநிலை`` தொடங்கப்பட்டால் கூடுதல் ஆர்த்தாங்க் கொள்கலன் தொடங்கப்படும். கொள்கலன்களை நிறுத்த `` டோக்கர்-கம்ப்.ஒய்.எம்.எல்`` மேலும் பயன்படுத்தப்படுகிறது, எனவே நீங்கள் கூடுதல் ஆர்த்தாங்க் கொள்கலனை அகற்றினால் முதலில் கொள்கலன்களை நிறுத்துங்கள்.

source: Advanced Orthanc configuration
ta: மேம்பட்ட ஆர்த்தாங்க் உள்ளமைவு

source: Any of the Orthanc configuration settings can be set in the ``ORTHANC_JSON`` section. The default configuration can be seen `on the Orthanc Server webpages <https://hg.orthanc-server.com/orthanc/file/Orthanc-1.8.2/OrthancServer/Resources/Configuration.json>`_ including documentation as to how they are used.
ta: ஆர்த்தாங்க் உள்ளமைவு அமைப்புகளில் ஏதேனும் `` ஆர்த்தாங்க்_சோன்`` பிரிவில் அமைக்கப்படலாம். இயல்புநிலை உள்ளமைவை `ஆர்த்தாங்க் சேவையக வலைப்பக்கங்களில் காணலாம் <https://hg.orthanc-server.com/orthanc/file/orthanc-1.8.2 அவை பயன்படுத்தப்படுகின்றன.

source: A custom version of the ``openrem_orthanc_config_docker.lua`` script can be used if required. Copy the existing one and place the new one, with a new name, in the ``orthanc/`` folder, and set the ``LuaScripts`` value in ``ORTHANC_JSON`` to match.
ta: தேவைப்பட்டால் `` OpenRem_orthanc_config_docker.lua`` ச்கிரிப்டின் தனிப்பயன் பதிப்பைப் பயன்படுத்தலாம். தற்போதுள்ள ஒன்றை நகலெடுத்து, புதிய பெயரை புதிய பெயருடன், `` ஆர்த்தாங்க்/`` கோப்புறையில் வைக்கவும், மற்றும் `` ஆர்த்தாங்க்_சோன்`` இல் `` லுவாச்கிரிப்ட்ச்` `மதிப்பை அமைக்கவும்.

source: **Pay special attention to the first sections**, up to the ``ToAscii`` function, these sections have been changed for the Docker implementation.
ta: ** முதல் பிரிவுகளுக்கு சிறப்பு கவனம் செலுத்துங்கள் **, `` டோச்கி`` செயல்பாடு வரை, இந்த பிரிவுகள் கப்பல்துறை செயல்படுத்தலுக்காக மாற்றப்பட்டுள்ளன.

source: Docker SELinux configuration
ta: கப்பல்துறை செலினக்ச் உள்ளமைவு

source: SELinux will prevent bind mounts in Docker with the standard configuration, which will be seen because Orthanc fails to start. SELinux is commonly enabled on Red Hat, Fedora and associated distributions.
ta: நிலையான உள்ளமைவுடன் டோக்கரில் பிணைப்பு ஏற்றங்களை செலினக்ச் தடுக்கும், இது ஆர்த்தாங்க் தொடங்கத் தவறியதால் காணப்படும். சிலினக்ச் பொதுவாக சிவப்பு Hat, Fedora மற்றும் தொடர்புடைய விநியோகங்களில் இயக்கப்படுகிறது.

source: The ``docker-compose.yml`` file needs to be edited to fix this.
ta: இதை சரிசெய்ய `` docker-compose.yml`` கோப்பு திருத்தப்பட வேண்டும்.

source: Change nginx configuration
ta: Nginx உள்ளமைவை மாற்றவும்

source: Find the following section:
ta: பின்வரும் பகுதியைக் கண்டறியவும்:

source: Follow the instruction to edit the ``nginx-conf`` lines, like this:
ta: இது போன்ற `` nginx-conf`` வரிகளைத் திருத்த அறிவுறுத்தலைப் பின்பற்றவும்:

source: Change the Orthanc configuration
ta: ஆர்த்தாங்க் உள்ளமைவை மாற்றவும்

source: Follow the instruction to edit the ``orthanc_1`` line, like this:
ta: இது போன்ற `` ஆர்த்தாங்க் 1`` வரியைத் திருத்த வழிமுறைகளைப் பின்பற்றவும்:

source: Errors at docker-compose up
ta: டோக்கர்-கம்ப் அப் பிழைகள்

source: Cannot start service nginx
ta: சேவையைத் தொடங்க முடியாது nginx

source: Error message when running ``docker-compose up -d`` (example from Windows)::
ta: `` கப்பல்துறை -கம்ப் அப் -d`` (விண்டோசிலிருந்து எடுத்துக்காட்டு) :: :::

source: This error indicates port 80 is not available for Docker/OpenREM. Try:
ta: இந்த பிழை துறைமுகம் 80 டோக்கர்/ஓபன்ரெமுக்கு கிடைக்கவில்லை என்பதைக் குறிக்கிறது. முயற்சிக்கவும்:

source: Shutting down other web servers, such as IIS
ta: IIS போன்ற பிற வலை சேவையகங்களை மூடுகிறது

source: Using an alternative port temporarily for OpenREM:
ta: OpenREM க்கு தற்காலிகமாக மாற்று துறைமுகத்தைப் பயன்படுத்துதல்:

source: Edit the ``docker-compose.yml`` file
ta: `` Docker-compose.yml`` கோப்பைத் திருத்தவும்

source: Find the section that includes
ta: உள்ளடக்கிய பகுதியைக் கண்டறியவும்

source: Change the external facing port to a high number, for example:
ta: வெளிப்புற எதிர்கொள்ளும் துறைமுகத்தை அதிக எண்ணிக்கையில் மாற்றவும், எடுத்துக்காட்டாக:

source: Now stop and start the containers again:
ta: இப்போது நிறுத்தி கொள்கலன்களை மீண்டும் தொடங்கவும்:

source: If there are no errors, check that the containers are up and which ports are in use:
ta: பிழைகள் எதுவும் இல்லை என்றால், கொள்கலன்கள் மேலே உள்ளதா, எந்த துறைமுகங்கள் பயன்பாட்டில் உள்ளன என்பதை சரிபார்க்கவும்:

source: Connection was reset, Orthanc restarting
ta: இணைப்பு மீட்டமைக்கப்பட்டது, ஆர்த்தாங்க் மறுதொடக்கம்

source: After installation, browsing to the webservice reports "The connection was reset".
ta: நிறுவிய பிறகு, வலை சேவைக்கு உலாவுவது "இணைப்பு மீட்டமைக்கப்பட்டது".

source: ``docker-compose ps`` reports:
ta: `` டோக்கர்-சமநிலை பி.எச்`` அறிக்கைகள்:

source: Orthanc Docker logs include:
ta: ஆர்த்தாங்க் கப்பல்துறை பதிவுகள் பின்வருமாறு:

source: This might indicate that the bind mounts have not worked. This might be due to SELinux, particularly if you are using Red Hat or Fedora or related distributions.
ta: பிணைப்பு ஏற்றங்கள் வேலை செய்யவில்லை என்பதை இது குறிக்கலாம். இது செலினக்ச் காரணமாக இருக்கலாம், குறிப்பாக நீங்கள் சிவப்பு தொப்பி அல்லது ஃபெடோரா அல்லது தொடர்புடைய விநியோகங்களைப் பயன்படுத்துகிறீர்கள் என்றால்.

source: See :doc:`docker_selinux`
ta: காண்க: டாக்: `டோக்கர்_செலினக்ச்`

source: Enabling debug toolbar
ta: பிழைத்திருத்த கருவிப்பட்டியை இயக்குகிறது

source: Django Debug Toolbar can be very useful when troubleshooting or optimising the web interface, showing all the queries that have been run, the timings and lots more.
ta: வலை இடைமுகத்தை சரிசெய்யும்போது அல்லது மேம்படுத்தும்போது, ​​இயங்கும் அனைத்து கேள்விகளையும், நேரங்கள் மற்றும் பலவற்றையும் காண்பிக்கும் போது சாங்கோ பிழைத்திருத்த கருவிப்பட்டி மிகவும் பயனுள்ளதாக இருக்கும்.

source: More information about Django Debug Toolbar can be found at https://django-debug-toolbar.readthedocs.io
ta: சாங்கோ பிழைத்திருத்த கருவிப்பட்டியைப் பற்றிய கூடுதல் தகவல்களை https://django-debug-toolbar.readthedocs.io இல் காணலாம்

source: Installation
ta: நிறுவல்

source: Activate the virtualenv (assuming you are using one...)
ta: மெய்நிகர்இன்வை செயல்படுத்தவும் (நீங்கள் ஒன்றைப் பயன்படுத்துகிறீர்கள் என்று வைத்துக் கொள்ளுங்கள் ...)

source: Install from pip:
ta: PIP இலிருந்து நிறுவவும்:

source: Configuration
ta: உள்ளமைவு

source: Open ``openremproject/local_settings.py`` and add the lines:
ta: `` OpenRemProject/local_settings.py`` ஐத் திறந்து வரிகளைச் சேர்க்கவும்:

source: If you wish to make use of the debug toolbar on machines other than the one the code is running on, change the INTERNAL_IPS address list to include your client machine.
ta: குறியீடு இயங்கும் ஒன்றைத் தவிர வேறு இயந்திரங்களில் பிழைத்திருத்த கருவிப்பட்டியைப் பயன்படுத்த விரும்பினால், உங்கள் கிளையன்ட் இயந்திரத்தை சேர்க்க உள்_ஐபிஎச் முகவரி பட்டியலை மாற்றவும்.

source: Using Django Debug Toolbar
ta: சாங்கோ பிழைத்திருத்த கருவிப்பட்டியைப் பயன்படுத்துதல்

source: When ``DEBUG = True`` in ``openremproject/local_settings.py`` the toolbar should appear.
ta: `` OpenRemProject/local_settings.py`` இல் `` பிழைத்திருத்த = உண்மை`` போது கருவிப்பட்டி தோன்ற வேண்டும்.

source: Docker env configuration
ta: கப்பல்துறை என்வி உள்ளமைவு

source: Edit the ``.env.prod`` file to customise your installation. There should be no space between the variable name, the ``=`` and the value. Everything after the ``=`` until the end of the line is transferred as the value. These settings take effect when docker-compose is started or restarted.
ta: உங்கள் நிறுவலைத் தனிப்பயனாக்க `` .env.prod`` கோப்பைத் திருத்தவும். மாறி பெயர், `` = `` மற்றும் மதிப்பு ஆகியவற்றுக்கு இடையில் எந்த இடமும் இருக்கக்கூடாது. `` = `` க்குப் பிறகு அனைத்தும் வரியின் முடிவில் மதிப்பாக மாற்றப்படும் வரை. டோக்கர்-சமநிலை தொடங்கப்படும்போது அல்லது மறுதொடக்கம் செய்யப்படும்போது இந்த அமைப்புகள் நடைமுறைக்கு வரும்.

source: Variables that should always be changed
ta: எப்போதும் மாற்றப்பட வேண்டிய மாறிகள்

source: Set a new secret key. Create your own, or generate one by using a tool like http://www.miniwebtool.com/django-secret-key-generator/ for this:
ta: புதிய ரகசிய விசையை அமைக்கவும். இதற்காக http://www.miniwebtool.com/django-secret-key-generator/ போன்ற கருவியைப் பயன்படுத்தி ஒன்றை உருவாக்கவும் அல்லது ஒன்றை உருவாக்கவும்:

source: ``DJANGO_ALLOWED_HOSTS`` is a string of hostnames or IPs with a space between each:
ta: `` Jango_allowed_hosts`` என்பது ஒவ்வொன்றிற்கும் இடையில் ஒரு இடத்தைக் கொண்ட ஓச்ட்பெயர்கள் அல்லது ஐபிக்களின் சரம்:

source: ``nginx`` is required for internal use
ta: உள் பயன்பாட்டிற்கு `` nginx`` தேவை

source: ``localhost 127.0.0.1 [::]`` allows access on the server using the localhost name or IP (using IPv4 or IPv6)
ta: `` உள்ளக புரவலன் 127.0.0.1 [::] `` `` உள்ளக புரவலன் பெயர் அல்லது ஐபி பயன்படுத்தி சேவையகத்தில் அணுக அனுமதிக்கிறது (ஐபிவி 4 அல்லது ஐபிவி 6 ஐப் பயன்படுத்தி)

source: add the name and/or IP address of your server so it can be accessed from other computers on your network.
ta: உங்கள் சேவையகத்தின் பெயர் மற்றும்/அல்லது ஐபி முகவரியைச் சேர்க்கவும், எனவே இதை உங்கள் பிணையத்தில் உள்ள பிற கணினிகளிலிருந்து அணுகலாம்.

source: For example: ``DJANGO_ALLOWED_HOSTS=nginx localhost 127.0.0.1 [::1] myservername``
ta: எடுத்துக்காட்டாக: `` jango_allowed_hosts = nginx localhost 127.0.0.1 [:: 1] myservername``

source: Variables to help with debugging problems
ta: பிழைத்திருத்த சிக்கல்களுக்கு உதவும் மாறிகள்

source: Set to 1 to enable Django debugging mode.
ta: சாங்கோ பிழைத்திருத்த பயன்முறையை இயக்க 1 ஆக அமைக்கவும்.

source: Set the log level. Options are ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, and ``CRITICAL``, with progressively less logging.
ta: பதிவு அளவை அமைக்கவும். விருப்பங்கள் `` பிழைத்திருத்தம்``, `` தகவல்``, `` எச்சரிக்கை``, `` பிழை``, மற்றும் `` விமர்சன`` ஆகியவை படிப்படியாக குறைந்த உள்நுழைவுடன்.

source: Variables to be changed for your environment
ta: உங்கள் சூழலுக்காக மாற்றப்பட வேண்டிய மாறிகள்

source: E-mail server settings
ta: மின்னஞ்சல் சேவையக அமைப்புகள்

source: The host name and port of the e-mail server that you wish to use must be entered in the ``EMAIL_HOST`` and ``EMAIL_PORT`` fields. ``EMAIL_HOST`` might be your institution's Outlook/Exchange server.
ta: நீங்கள் பயன்படுத்த விரும்பும் மின்னஞ்சல் சேவையகத்தின் புரவலன் பெயர் மற்றும் துறைமுகம் `` மின்னஞ்சல்_ஓச்ட்`` மற்றும் `` மின்னஞ்சல்_போர்ட்`` புலங்களில் உள்ளிடப்பட வேண்டும். `` மின்னஞ்சல்_ஓச்ட்`` உங்கள் நிறுவனத்தின் அவுட்லுக்/எக்ச்சேஞ்ச் சேவையகமாக இருக்கலாம்.
