Repository: 247i/TACETr
Catalog: உரை/தானி/openaedmap-website-translation-*.po
Languages: ta

# access.yes
source: Publicly accessible
ta: பகிரங்கமாக அணுகக்கூடியது

# access.permit
source: Accessible with owner's permit
ta: உரிமையாளரின் அனுமதியுடன் அணுகலாம்

# access.private
source: Privately accessible
ta: தனிப்பட்ட முறையில் அணுகக்கூடியது

# access.customers
source: Accessible only for customers
ta: வாடிக்கையாளர்களுக்கு மட்டுமே அணுக முடியும்

# access.no
source: Unavailable
ta: கிடைக்கவில்லை

# access.unknown
source: Unknown access
ta: தெரியாத அணுகல்

# access.unknownTag
source: No access tag or not matching above
ta: அணுகல் குறிச்சொல் இல்லை அல்லது மேலே பொருந்தவில்லை

# access.permissive
source: Publicly available until further notice
ta: மேலும் அறிவிக்கும் வரை பொதுவில் கிடைக்கும்

# navbar.created_with_<3_by
source: created with ❤️ by
ta: by உடன் உருவாக்கப்பட்டது

# navbar.visit_github
source: Visit our GitHub repository
ta: எங்கள் அறிவிலிமையம் களஞ்சியத்தைப் பார்வையிடவும்

# navbar.visit_osmp_website
source: Visit OpenStreetMap Poland's website
ta: OpenStreetMap போலந்தின் வலைத்தளத்தைப் பார்வையிடவும்

# navbar.login
source: Log in using OSM account
ta: OSM கணக்கைப் பயன்படுத்தி உள்நுழைக

# navbar.logout
source: Log out
ta: விடுபதிகை

# navbar.about
source: About
ta: பற்றி

# navbar.hosted_by
source: hosted by
ta: வழங்கியவர்

# navbar.help_translating
source: Help translating
ta: மொழிபெயர்க்க உதவுங்கள்

# sidebar.close
source: Close sidebar
ta: பக்கப்பட்டியை மூடு

# sidebar.csv
source: CSV
ta: சிஎச்வி

# sidebar.download_title
source: Download AED data added to OSM
ta: OSM இல் சேர்க்கப்பட்ட AED தரவைப் பதிவிறக்கவும்

# sidebar.excel
source: Excel
ta: எக்செல்

# sidebar.geojson
source: GeoJSON
ta: சியோச்சன்

# sidebar.map_legend_title
source: Map legend
ta: வரைபட புராணக்கதை

# sidebar.no_data
source: No data
ta: தரவு இல்லை

# sidebar.indoor
source: Inside building
ta: உள்ளே கட்டிடம்

# sidebar.level
source: level
ta: நிலை

# sidebar.location
source: Location
ta: இடம்

# sidebar.opening_hours
source: Opening hours
ta: திறந்த நேரம்

# sidebar.description
source: Description
ta: விவரம்

# sidebar.contact_number
source: Contact number
ta: தொடர்பு எண்

# sidebar.operator
source: Operator
ta: ஆபரேட்டர்

# sidebar.note
source: Note
ta: குறிப்பு

# sidebar.edit
source: Edit
ta: தொகு

# sidebar.edit_in_osm
source: Edit in OSM
ta: OSM இல் திருத்து

# sidebar.view
source: View in OSM
ta: OSM இல் காண்க

# sidebar.copy_url
source: Copy URL
ta: முகவரி ஐ நகலெடுக்கவும்

# sidebar.add_defibrillator
source: Add defibrillator
ta: டிஃபிபிரிலேட்டரைச் சேர்க்கவும்

# sidebar.openstreetmap_navigation
source: OpenStreetMap Navigation
ta: OpenStreetMap வழிசெலுத்தல்

# sidebar.google_maps_navigation
source: Google Maps Navigation
ta: கூகிள் வரைபட வழிசெலுத்தல்

# sidebar.verification_date
source: Date of survey
ta: கணக்கெடுப்பு தேதி

# sidebar.edit_defibrillator
source: Edit defibrillator
ta: டிஃபிபிரிலேட்டரைத் திருத்து

# sidebar.world
source: World
ta: உலகம்

# sidebar.find_location
source: Find location
ta: இருப்பிடத்தைக் கண்டறியவும்

# form.optional_field
source: Field optional
ta: புலம் விருப்பமானது

# form.marker_popup_text
source: Move marker to AED location
ta: AED இருப்பிடத்திற்கு மார்க்கரை நகர்த்தவும்

# form.is_indoor
source: Is inside building?
ta: உள்ளே கட்டிடம் உள்ளதா?

# form.inside
source: Inside
ta: உள்ளே

# form.level
source: Level
ta: நிலை

# form.outside
source: Outside
ta: வெளியே

# form.accessibility
source: Accessibility
ta: அணுகல்

# form.location
source: Describe location
ta: இருப்பிடத்தை விவரிக்கவும்

# form.location_example
source: For example: On the wall near the entrance
ta: உதாரணமாக: நுழைவாயிலுக்கு அருகிலுள்ள சுவரில்

# footer.add
source: Add
ta: கூட்டு

# footer.add_aed
source: Add AED
ta: AED ஐச் சேர்க்கவும்

# footer.cancel
source: Cancel
ta: ரத்துசெய்

# footer.continue
source: Continue
ta: தொடரவும்

# footer.save_aed
source: Save AED
ta: AED ஐ சேமிக்கவும்

# footer.partners
source: Project's partners
ta: திட்டத்தின் கூட்டாளர்கள்

# opening_hours.open
source: Open
ta: திற

# opening_hours.closed
source: Closed
ta: மூடப்பட்டது

# indoor.yes
source: Yes
ta: ஆம்

# indoor.no
source: No
ta: இல்லை

# osmp
source: OpenStreetMap Poland
ta: OpenStreetMap போலந்து

# modal.aed_added_successfully
source: AED added successfully.
ta: AED வெற்றிகரமாக சேர்க்கப்பட்டது.

# modal.aed_updated_successfully
source: AED updated successfully.
ta: AED வெற்றிகரமாக புதுப்பிக்கப்பட்டது.

# modal.available_in_osm
source: Available in OpenStreetMap with the URL:
ta: முகவரி உடன் OpenStreetMap இல் கிடைக்கிறது:

# modal.should_appear_soon
source: Object should appear on the map within 60 minutes.
ta: பொருள் 60 நிமிடங்களுக்குள் வரைபடத்தில் தோன்ற வேண்டும்.

# modal.error_occurred
source: Error occurred
ta: பிழை ஏற்பட்டது

# modal.title
source: Information
ta: தகவல்

# modal.need_to_login
source: To add features you need to log in using OpenStreetMap account.
ta: அம்சங்களைச் சேர்க்க நீங்கள் ஓபன்ச்ட்ரீட்மேப் கணக்கைப் பயன்படுத்தி உள்நுழைய வேண்டும்.

# modal.click_login_button
source: Close this window and click login button at the top to log in.
ta: இந்த சாளரத்தை மூடி, உள்நுழைய மேலே உள்ள உள்நுழைவு பொத்தானைக் சொடுக்கு செய்க.

# modal.need_more_zoom
source: To add features you need to zoom in so the location that you provide is accurate.
ta: நீங்கள் பெரிதாக்க வேண்டிய அம்சங்களைச் சேர்க்க, நீங்கள் வழங்கும் இடம் துல்லியமானது.

# modal.current_zoom
source: Current zoom:
ta: தற்போதைய சூம்:

# modal.zoom_need_to_be
source: Zoom needs to be at level 15 minimum.
ta: சூம் குறைந்தபட்சம் 15 ஆம் மட்டத்தில் இருக்க வேண்டும்.

# modal.about_project
source: OpenAEDMap is an open-data project which shows all Automated External Defibrillators (AED) around the world. The website is based on data from OpenStreetMap and is the result of OpenStreetMap Poland's association efforts. It was created in 2022 after changing the Polish website AED Mapa to a new design.
ta: OpenAedMap என்பது ஒரு திறந்த-தரவு திட்டமாகும், இது உலகெங்கிலும் உள்ள அனைத்து தானியங்கி வெளிப்புற டிஃபிபிரிலேட்டர்களையும் (AED) காட்டுகிறது. வலைத்தளம் ஓபன்ச்ட்ரீட்மேப்பின் தரவை அடிப்படையாகக் கொண்டது மற்றும் இது ஓபன்ச்ட்ரீட்மேப் போலந்தின் சங்க முயற்சிகளின் விளைவாகும். இது 2022 ஆம் ஆண்டில் போலந்து வலைத்தளமான AED MAPA ஐ ஒரு புதிய வடிவமைப்பிற்கு மாற்றிய பின்னர் உருவாக்கப்பட்டது.

# modal.about_osm
source: OpenStreetMap (OSM) is like a Wikipedia for maps. It's available to use for everyone and anybody can add objects to the map. You can use your OSM account to add AED locations directly from this site using a simple form.
ta: ஓபன்ச்ட்ரீட்மேப் (ஓஎச்எம்) வரைபடங்களுக்கான விக்கிபீடியா போன்றது. அனைவருக்கும் பயன்படுத்த இது கிடைக்கிறது, மேலும் எவரும் வரைபடத்தில் பொருட்களைச் சேர்க்கலாம். எளிய படிவத்தைப் பயன்படுத்தி இந்த தளத்திலிருந்து நேரடியாக AED இருப்பிடங்களைச் சேர்க்க உங்கள் OSM கணக்கைப் பயன்படுத்தலாம்.

# modal.create_account
source: You can contribute too! Just create a free account on
ta: நீங்கள் பங்களிக்க முடியும்! ஒரு இலவச கணக்கை உருவாக்கவும்

# modal.become_openaedmap_partner
source: Do you want to become OpenAEDMap partner?
ta: நீங்கள் OpenAedMap கூட்டாளராக மாற விரும்புகிறீர்களா?

# modal.contact_us
source: Contact us
ta: எங்களை தொடர்புகொள்

# modal.thanks_for_photo
source: Thank you for uploading the photo. It should be visible soon.
ta: புகைப்படத்தை பதிவேற்றியதற்கு நன்றி. இது விரைவில் தெரியும்.

# modal.thanks_for_report
source: Thank you for sending a report. It will be reviewed by the site administrators.
ta: அறிக்கையை அனுப்பியதற்கு நன்றி. இதை தள நிர்வாகிகள் மதிப்பாய்வு செய்வார்கள்.

# partners.e_health_centre
source: e-Health Centre
ta: மின்-சுகாதார நடுவண்

# partners.honorary_patronage
source: Honorary patronage
ta: க orary ரவ உதவி

# partners.gugik
source: Head Office of Geodesy and Cartography in Poland
ta: போலந்தில் சியோடெசி மற்றும் வரைபடத்தின் தலைமை அலுவலகம்

# partners.acting
source: acting
ta: நடிப்பு

# partners.chief_geodesist
source: Chief Geodesist of Poland
ta: போலந்தின் தலைமை புவிசார்

# partners.main_scientific_partner
source: The Main Scientific Partner
ta: முக்கிய அறிவியல் கூட்டாளர்

# partners.warsaw_university_of_technology
source: Warsaw University of Technology
ta: வார்சா தொழில்நுட்ப பல்கலைக்கழகம்

# partners.wroclaw_medical_university
source: Wroclaw Medical University
ta: வ்ரோக்லா மருத்துவ பல்கலைக்கழகம்

# common.loading
source: Loading...
ta: ஏற்றுகிறது ...

# photo.upload
source: Upload photo
ta: புகைப்படத்தைப் பதிவேற்றவும்

# photo.remove
source: Remove photo
ta: புகைப்படத்தை அகற்று

# photo.report
source: Report photo
ta: புகைப்படத்தைப் புகாரளிக்கவும்

# photo.send_report
source: Send report
ta: அறிக்கை அனுப்பவும்

# photo.report_long_text
source: You can report the photo if it's bad quality, does not show the AED's location or is inappropriate in any way. Administrators of the site will review the report.
ta: புகைப்படத்தை மோசமான தகுதி என்றால், AED இன் இருப்பிடத்தைக் காட்டாது அல்லது எந்த வகையிலும் பொருத்தமற்றதாக இருந்தால் நீங்கள் புகாரளிக்கலாம். தளத்தின் நிர்வாகிகள் அறிக்கையை மதிப்பாய்வு செய்வார்கள்.

# photo.license
source: All AED photos are hosted by us and are licensed under Creative Commons Zero (CC0 v1.0). By uploading your photo you agree to this license terms.
ta: அனைத்து AED புகைப்படங்களும் எங்களால் வழங்கப்படுகின்றன, மேலும் அவை கிரியேட்டிவ் காமன்ச் சீரோ (CC0 V1.0) இன் கீழ் உரிமம் பெற்றவை. உங்கள் புகைப்படத்தை பதிவேற்றுவதன் மூலம் இந்த உரிம விதிமுறைகளுக்கு ஒப்புக்கொள்கிறீர்கள்.

# photo.license_short_description
source: In short this means that the photo can be used by anyone for any purpose. No attribution is necessary.
ta: சுருக்கமாக, புகைப்படத்தை எந்த நோக்கத்திற்காகவும் யாராலும் பயன்படுத்தலாம். பண்புக்கூறு தேவையில்லை.

# meta.website_title
source: OpenAEDMap - Map of Defibrillators
ta: OpenAedMap - டிஃபிபிரிலேட்டர்களின் வரைபடம்

# meta.meta_title
source: Open map of Automatic External Defibrillators (AEDs)
ta: தானியங்கி வெளிப்புற டிஃபிபிரிலேட்டர்களின் திறந்த வரைபடம் (AEDS)

# meta.meta_description
source: Map of AEDs (Automatic External Defibrillators) based on OpenStreetMap data. Our website makes it easy to find an AED defibrillator near you, which can be very helpful in life-threatening situations. AED defibrillators are devices that are used for cardiopulmonary resuscitation of people in cardiac arrest. With our map, anyone can quickly find the nearest defibrillator and help someone in need.
ta: OpenStreetMap தரவின் அடிப்படையில் AED களின் வரைபடம் (தானியங்கி வெளிப்புற டிஃபிபிரிலேட்டர்கள்). எங்கள் வலைத்தளம் உங்களுக்கு அருகிலுள்ள AED டிஃபிபிரிலேட்டரைக் கண்டுபிடிப்பதை எளிதாக்குகிறது, இது உயிருக்கு ஆபத்தான சூழ்நிலைகளில் மிகவும் உதவியாக இருக்கும். AED டிஃபிபிரிலேட்டர்கள் இருதயக் கைதில் உள்ளவர்களை இருதய நுரையீரல் புத்துயிர் பெறுவதற்குப் பயன்படுத்தப்படும் சாதனங்கள். எங்கள் வரைபடத்துடன், எவரும் விரைவாக அருகிலுள்ள டிஃபிபிரிலேட்டரைக் கண்டுபிடித்து தேவைப்படும் ஒருவருக்கு உதவலாம்.

# webgl.disabled_or_unsupported
source: WebGL is disabled or unsupported by your browser.
ta: வெப்சிஎல் உங்கள் உலாவியால் முடக்கப்பட்டுள்ளது அல்லது ஆதரிக்கப்படவில்லை.

# webgl.required_for_using_openaedmap
source: WebGL is required for using OpenAEDMap.
ta: OpenAedMap ஐப் பயன்படுத்த Webgl தேவை.

# webgl.please_check_instruction_at
source: Please check instruction for enabling WebGL at
ta: WEBGL ஐ இயக்குவதற்கான வழிமுறைகளை சரிபார்க்கவும்
