Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: :issue:`637` Administration: added facility to list and purge RabbitMQ queues
ta: : வெளியீடு: `637` நிர்வாகம்: முயல் வரிசைகளை பட்டியலிடவும் சுத்திகரிக்கவும் வசதி சேர்க்கப்பட்டது

source: :issue:`554` Query-retrieve: added time as matching argument for command line use
ta: : வெளியீடு: `554` வினவல்-மறுதொடக்கம்: கட்டளை வரி பயன்பாட்டிற்கான பொருந்தக்கூடிய வாதமாக நேரம் சேர்க்கப்பட்டது

source: :issue:`461` Web server: enable OpenREM to be hosted from a non-root folder/virtual-directory (via :issue:`667`)
ta: :issue:`461` விரலிடைத் தோல் server: enable OpenREM பெறுநர் be hosted இருந்து a non-root folder/virtual-directory (via :issue:`667`)

source: :issue:`479` Administration: added facility to list and delete failed import studies
ta: : வெளியீடு: `479` நிர்வாகம்: தோல்வியுற்ற இறக்குமதி ஆய்வுகளை பட்டியலிடவும் நீக்கவும் சேர்க்கப்பட்டது

source: :issue:`349` Task management: fixed issue with Windows tasks not being killed on request
ta: : வெளியீடு: `349` பணி மேலாண்மை: கோரிக்கையின் பேரில் சாளரங்கள் பணிகள் கொல்லப்படவில்லை என்பதில் நிலையான சிக்கல்

source: :issue:`663` Interface: updated column headings on home page
ta: : வெளியீடு: `663` இடைமுகம்: முகப்பு பக்கத்தில் புதுப்பிக்கப்பட்ட நெடுவரிசை தலைப்புகள்

source: :issue:`660` Documentation: corrected and improved Linux one-page install
ta: : வெளியீடு: `660` ஆவணம்: திருத்தப்பட்ட மற்றும் மேம்படுத்தப்பட்ட லினக்ச் ஒரு பக்க நிறுவல்

source: :issue:`659` Interface: made the summary tables on the home page sortable by clicking on headers
ta: : வெளியீடு: `659` இடைமுகம்: தலைப்புகளைக் சொடுக்கு செய்வதன் மூலம் முகப்பு பக்கத்தில் சுருக்க அட்டவணைகள் வரிசைப்படுத்தலாம்

source: :issue:`656` Install: pegged django-debug-toolbar to 1.9.1 until Django is upgraded
ta: : வெளியீடு: `656` நிறுவு: சாங்கோ மேம்படுத்தப்படும் வரை சாங்கோ-டெபக்-டூல்பார் 1.9.1 ஆக

source: :issue:`654` Documentation: supplemented the Orthanc Lua file config option docs
ta: : வெளியீடு: `654` ஆவணம்: ஆர்த்தாங்க் லுவா கோப்பு கட்டமைப்பு விருப்பத்தேர்வுகளுக்கு கூடுதலாக

source: :issue:`653` Docs: clarified notes to get link to Orthanc Lua file correct on release
ta: : வெளியீடு: `653` டாக்ச்: ஆர்த்தாங்க் லுவா கோப்பிற்கான இணைப்பைப் பெற தெளிவுபடுத்தப்பட்ட குறிப்புகள் வெளியீட்டில் சரியானவை

source: :issue:`652` Documentation: added docs showing Celery daemonisation in Linux
ta: :issue:`652` Documentation: added கோப்புகள் showing சிவரிக்கீரை daemonisation in Linux

source: :issue:`651` Documentation: added one-page full setup Ubuntu 18.04 install instructions
ta: : வெளியீடு: `651` ஆவணம்: ஒரு பக்க முழு அமைப்பைச் சேர்த்தது உபுண்டு 18.04 வழிமுறைகளை நிறுவவும்

source: :issue:`650` Documentation: modified quick install virtualenv docs
ta: : வெளியீடு: `650` ஆவணம்: மாற்றியமைக்கப்பட்ட விரைவான நிறுவல் மெய்நிகர் டாக்சை நிறுவவும்

source: :issue:`649` Documentation: instructions for updating hosts file for Ubuntu and RabbitMQ
ta: :issue:`649` Documentation: instructions க்கு updating hosts கோப்பு க்கு Ubuntu and RabbitMQ

source: :issue:`648` Documentation: clarified Toshiba options when not required
ta: : வெளியீடு: `648` ஆவணம்: தேவையில்லாதபோது தெளிவுபடுத்தப்பட்ட தோசிபா விருப்பங்கள்

source: :issue:`647` Documentation: updated link to pixelmed
ta: : வெளியீடு: `647` ஆவணம்: பிக்சல்மெட்டுக்கு புதுப்பிக்கப்பட்ட இணைப்பு

source: :issue:`646` Modified Celery import to avoid name clash in some circumstances
ta: : வெளியீடு: `646` சில சூழ்நிலைகளில் பெயர் மோதலைத் தவிர்க்க மாற்றியமைக்கப்பட்ட செலரி இறக்குமதி

source: :issue:`645` Imports: prevent import failure when text is used in filter thickness field in DX image
ta: : வெளியீடு: `645` இறக்குமதி: டிஎக்ச் படத்தில் வடிகட்டி தடிமன் புலத்தில் உரை பயன்படுத்தப்படும்போது இறக்குமதி தோல்வியைத் தடுக்கவும்

source: :issue:`644` Exports: fixed error in exporting non-ASCII CT protocol acquisition names
ta: : வெளியீடு: `644` ஏற்றுமதி: ASCII அல்லாத CT நெறிமுறை கையகப்படுத்தல் பெயர்களை ஏற்றுமதி செய்வதில் நிலையான பிழை

source: :issue:`643` Installation: updated docs to make use of pip binaries for Postgres connector and numpy, Windows and Linux
ta: :issue:`643` Installation: updated கோப்புகள் பெறுநர் make use of pip binaries க்கு Postgres இணைப்பி and numpy, சாளரங்கள் and Linux

source: :issue:`642` Skin dose maps: added catch for error when there are no events in the study
ta: : வெளியீடு: `642` தோல் டோச் வரைபடங்கள்: ஆய்வில் நிகழ்வுகள் இல்லாதபோது பிழைக்காக கேட்ச் சேர்க்கப்பட்டது

source: :issue:`641` Exports: mammography exports from filtered pages sorted by AGD no longer result in duplicate studies
ta: : வெளியீடு: `641` ஏற்றுமதி: ஏசிடியால் வரிசைப்படுத்தப்பட்ட வடிகட்டப்பட்ட பக்கங்களிலிருந்து மேமோகிராஃபி ஏற்றுமதி இனி நகல் ஆய்வுகள் ஏற்படாது

source: :issue:`640` Exports: error in filter listing for NHSBSP csv exports corrected
ta: : வெளியீடு: `640` ஏற்றுமதி: NHSBSP காபிம ஏற்றுமதிக்கான வடிகட்டி பட்டியலில் பிழை சரி செய்யப்பட்டது

source: :issue:`639` Charts: fixed problem where a blank category name may not be displayed correctly
ta: : வெளியீடு: `639` விளக்கப்படங்கள்: ஒரு வெற்று வகை பெயர் சரியாக காட்டப்படாமல் இருக்கக்கூடிய நிலையான சிக்கல்

source: :issue:`638` Skin dose maps: added a link to download data for stand-alone openSkin even when map displayed
ta: :issue:`638` Skin dose maps: added a இணைப்பு பெறுநர் பதிவிறக்கம் தகவல்கள் க்கு stand-alone openSkin இரட்டை when map displayed

source: :issue:`627` DICOM Networking: implemented workaround for query "bug" in Impax 6.6
ta: :issue:`627` DICOM Networking: implemented workaround க்கு query "bug" in Impax 6.6

source: :issue:`606` Interface: Made it possible for the user to change his/her password
ta: : வெளியீடு: `606` இடைமுகம்: பயனர் தனது/அவள் கடவுச்சொல்லை மாற்றுவதை சாத்தியமாக்கியது

source: :issue:`635` Documentation: added Orthanc as preferred third party DICOM Store service
ta: : வெளியீடு: `635` ஆவணம்: விருப்பமான மூன்றாம் தரப்பு டிகாம் கடை சேவையாக ஆர்த்தாங்க் சேர்க்கப்பட்டது

source: :issue:`634` Documentation: updated docs for import and query-retrieve duplicates processing
ta: : வெளியீடு: `634` ஆவணம்: இறக்குமதி மற்றும் வினவல்-மறுசீரமைப்பு நகல் செயலாக்கத்திற்கான புதுப்பிக்கப்பட்ட ஆவணங்கள்

source: :issue:`633` Charts: fixed issue where charts failed if bar chart series name was null
ta: : வெளியீடு: `633` விளக்கப்படங்கள்: பார் விளக்கப்படத் தொடர் பெயர் பூச்யமாக இருந்தால் விளக்கப்படங்கள் தோல்வியுற்ற நிலையான சிக்கல்

source: :issue:`632` DICOM: move requests for queries that don't exist now fail gracefully
ta: : வெளியீடு: `632` டிகாம்: இப்போது இல்லாத வினவல்களுக்கான கோரிக்கைகளை நகர்த்தவும்

source: :issue:`631` Skin dose maps: bug fixed that prevented message from displaying on screen when skin dose map cannot be calculated
ta: : வெளியீடு: `631` தோல் டோச் வரைபடங்கள்: தோல் டோச் வரைபடத்தை கணக்கிட முடியாதபோது செய்தியை திரையில் காண்பிப்பதைத் தடுக்கும் பிழை சரி செய்யப்பட்டது

source: :issue:`630` Documentation: improved installation instructions
ta: : வெளியீடு: `630` ஆவணம்: மேம்படுத்தப்பட்ட நிறுவல் வழிமுறைகள்

source: :issue:`628` Imports: fixed code for importing when there are duplicate DX or MG studies in the database
ta: : வெளியீடு: `628` இறக்குமதி: தரவுத்தளத்தில் நகல் டிஎக்ச் அல்லது எம்சி ஆய்வுகள் இருக்கும்போது இறக்குமதி செய்வதற்கான நிலையான குறியீடு

source: :issue:`626` DICOM: isolated the generate modalities in study function and added testing
ta: : வெளியீடு: `626` டிகாம்: ஆய்வு செயல்பாட்டில் முறைகளை உருவாக்கி தனிமைப்படுத்தப்பட்டு சோதனை சேர்க்கப்பட்டது

source: :issue:`625` Imports: now using event level UIDs to process continued, cumulative and duplicate RDSRs
ta: :issue:`625` Imports: now using event நிலை UIDs பெறுநர் process continued, cumulative and duplicate RDSRs

source: :issue:`624` Charts: removed filter link on number of events histogram as it was not functioning correctly
ta: : வெளியீடு: `624` விளக்கப்படங்கள்: நிகழ்வுகள் இச்டோகிராமின் எண்ணிக்கையில் அகற்றப்பட்ட வடிகட்டி இணைப்பு சரியாக செயல்படவில்லை என்பதால்

source: :issue:`623` Imports: changed name of Toshiba image based extractor routine
ta: : வெளியீடு: `623` இறக்குமதி: தோசிபா பட அடிப்படையிலான பிரித்தெடுத்தல் வழக்கத்தின் மாற்றப்பட்ட பெயர்

source: :issue:`621` Documentation: reversed install order of openrem and pynetdicom due to new pydicom release
ta: :issue:`621` Documentation: reversed install order of openrem and pynetdicom due பெறுநர் புதிய pydicom வெளியீடு

source: :issue:`619` Documentation: added workaround for outdated dictionary issues
ta: : வெளியீடு: `619` ஆவணங்கள்: காலாவதியான அகராதி சிக்கல்களுக்கான பணித்தொகுப்பு சேர்க்கப்பட்டது

source: :issue:`618` DICOM: fixed image level query that prevented RDSRs from being found
ta: : வெளியீடு: `618` டிகாம்: RDSR கள் காணப்படுவதைத் தடுத்த நிலையான பட நிலை வினவல்

source: :issue:`617` Imports: fixed issue with multi study exams crashing the Toshiba extractor
ta: : வெளியீடு: `617` இறக்குமதி: தோசிபா பிரித்தெடுத்தலை செயலிழக்க பல ஆய்வுத் தேர்வுகளில் நிலையான சிக்கல்

source: :issue:`616` Documentation: added information for pip download -d
ta: : வெளியீடு: `616` ஆவணம்: பிஐபி பதிவிறக்கத்திற்கான செய்தி சேர்க்கப்பட்டது -டி

source: :issue:`615` Exports: added Target Exposure Index and Deviation Index to radiographic exports
ta: : வெளியீடு: `615` ஏற்றுமதி: ரேடியோகிராஃபிக் ஏற்றுமதியில் இலக்கு வெளிப்பாடு குறியீடு மற்றும் விலகல் குறியீட்டை சேர்க்கப்பட்டது

source: :issue:`614` Exports: handle error when study is deleted during sheet creation for exports
ta: : வெளியீடு: `614` ஏற்றுமதி: ஏற்றுமதிக்கான தாள் உருவாக்கும் போது ஆய்வு நீக்கப்படும் போது பிழையைக் கையாளவும்

source: :issue:`613` Imports: fixed dual modality type imports after 'dual' designation from ref :issue:`580`
ta: :issue:`613` Imports: fixed இருமம் modality வகை இறக்குமதிகள் after 'dual' designation இருந்து ref :issue:`580`

source: :issue:`612` Imports: prevented crash when RDSR was imported with AcquisitionProtocol sequence with no TextValue
ta: :issue:`612` Imports: prevented crash when RDSR was imported with AcquisitionProtocol வரிசை with இல்லை TextValue

source: :issue:`610` DICOM: query-retrieve changed to work for duplicate RDSRs, ref :issue:`114`
ta: :issue:`610` DICOM: query-retrieve changed பெறுநர் வேலை க்கு duplicate RDSRs, ref :issue:`114`

source: :issue:`609` Interface: fixed the feature that toggles the selection when clicking anywhere on a display name table row
ta: : வெளியீடு: `609` இடைமுகம்: காட்சி பெயர் அட்டவணை வரிசையில் எங்கும் சொடுக்கு செய்யும் போது தேர்வை மாற்றியமைக்கும் அம்சத்தை சரி செய்தது

source: :issue:`608` Interface: fixed the broken sorting of display name table
ta: : வெளியீடு: `608` இடைமுகம்: காட்சி பெயர் அட்டவணையின் உடைந்த வரிசையாக்கம் சரி செய்யப்பட்டது

source: :issue:`603` Interface: fixed JavaScript error if there are any None values in fluoro detail irradiation type table
ta: :issue:`603` Interface: fixed சாவாகைஉரை பிழை if there அரே any எதுவுமில்லை values in fluoro detail irradiation வகை table

source: :issue:`602` Skin dose maps: fixed error when there are multiple kVp values for a single irradiation event
ta: : வெளியீடு: `602` தோல் டோச் வரைபடங்கள்: ஒரு கதிர்வீச்சு நிகழ்வுக்கு பல கே.வி.பி மதிப்புகள் இருக்கும்போது நிலையான பிழை

source: :issue:`599` Installation: postgres instructions now include note about differing security choices
ta: : வெளியீடு: `599` நிறுவல்: போச்ட்கிரெச் வழிமுறைகள் இப்போது மாறுபட்ட பாதுகாப்பு தேர்வுகள் பற்றிய குறிப்பை உள்ளடக்குகின்றன

source: :issue:`597` Skin dose maps: documented that using a production webserver the default timeout value must be increased
ta: :issue:`597` Skin dose maps: documented that using a production webserver the இயல்புநிலை timeout மதிப்பு must be increased

source: :issue:`596` Documentation: added docs for using Gunicorn and NGINX on linux
ta: : வெளியீடு: `596` ஆவணம்: லினக்சில் கன்னிகார்ன் மற்றும் என்சின்க்சைப் பயன்படுத்துவதற்கான டாக்ச் சேர்க்கப்பட்டது

source: :issue:`594` Display: corrected display of dual-plane DAP and RP dose in RF filtered view
ta: : வெளியீடு: `594` காட்சி: வானலை வடிகட்டப்பட்ட பார்வையில் இரட்டை வானூர்தி DAP மற்றும் RP டோசின் சரிசெய்யப்பட்ட காட்சி

source: :issue:`593` Imports: properly handles MultiValue filter material tags and permits aluminium spelling
ta: :issue:`593` Imports: properly கையாளுகிறது MultiValue வடிப்பி material குறிச்சொற்கள் and permits அளமியம் spelling

source: :issue:`592` Documentation: added docs for using IIS on Windows
ta: : வெளியீடு: `592` ஆவணம்: சாளரங்களில் ஐ.ஐ.எச் பயன்படுத்துவதற்கான டாக்சைச் சேர்க்கப்பட்டது

source: :issue:`589` Exports: now handles zero studies and studies deleted during exports sensibly
ta: : வெளியீடு: `589` ஏற்றுமதி: இப்போது ஏற்றுமதியின் போது நீக்கப்பட்ட சுழிய ஆய்வுகள் மற்றும் ஆய்வுகளை விவேகத்துடன் கையாளுகிறது

source: :issue:`587` Documentation: added instructions for Linux users to rotate logs
ta: : வெளியீடு: `587` ஆவணம்: லினக்ச் பயனர்களுக்கு பதிவுகளை சுழற்றுவதற்கான வழிமுறைகள் சேர்க்கப்பட்டன

source: :issue:`586` Documentation: updated exports and detailed how pulse level data is exported
ta: : வெளியீடு: `586` ஆவணம்: புதுப்பிக்கப்பட்ட ஏற்றுமதி மற்றும் துடிப்பு நிலை தரவு எவ்வாறு ஏற்றுமதி செய்யப்படுகிறது என்பதை விவரிக்கவும்

source: :issue:`585` Documentation: added information about multiple cumulative RDSRs
ta: : வெளியீடு: `585` ஆவணம்: பல ஒட்டுமொத்த RDSRS பற்றிய தகவல்களைச் சேர்க்கவும்

source: :issue:`584` Import, Interface, Export: RDSR with pulse level data now function
ta: : வெளியீடு: `584` இறக்குமதி, இடைமுகம், ஏற்றுமதி: துடிப்பு நிலை தரவுகளுடன் ஆர்.டி.எச்.ஆர் இப்போது செயல்படுகிறது

source: :issue:`583` Documentation: added information about dual mode modalities and deleting all from an X-ray unit
ta: : வெளியீடு: `583` ஆவணம்: இரட்டை பயன்முறை முறைகள் பற்றிய தகவல்களைச் சேர்த்தது மற்றும் அனைத்தையும் எக்ச்ரே அலகு இருந்து நீக்குதல்

source: :issue:`582` Celery: updated results backend as amqp deprecated and slow
ta: : வெளியீடு: `582` செலரி: புதுப்பிக்கப்பட்ட முடிவுகள் பின்தளத்தில் AMQP ஆனது மற்றும் மெதுவாக

source: :issue:`581` Import scripts: interpreter line now always first, functions imported specifically
ta: : வெளியீடு: `581` இறக்குமதி ச்கிரிப்ட்கள்: மொழிபெயர்ப்பாளர் வரி இப்போது எப்போதும் முதலில், குறிப்பாக இறக்குமதி செய்யப்படும் செயல்பாடுகள்

source: :issue:`580` Imports and Interface: one modality creating both DX and RF can now be handled appropriately
ta: : வெளியீடு: `580` இறக்குமதி மற்றும் இடைமுகம்: டிஎக்ச் மற்றும் ஆர்எஃப் இரண்டையும் உருவாக்கும் ஒரு முறை இப்போது சரியான முறையில் கையாளப்படலாம்

source: :issue:`579` Imports: dummy values for Toshiba CT import function now in settings.py, log file config in docs
ta: : வெளியீடு: `579` இறக்குமதி: தோசிபா சி.டி.

source: :issue:`578` Exports: fixed NHSBSP export that was excluding RDSR imported Hologic studies
ta: : வெளியீடு: `578` ஏற்றுமதி: RDSR இறக்குமதி செய்யப்பட்ட ஓலாசிக் ஆய்வுகளைத் தவிர்த்து நிலையான NHSBSP ஏற்றுமதி

source: :issue:`575` Exports: export page now updates using AJAX and has a select all button
ta: : வெளியீடு: `575` ஏற்றுமதி: ஏற்றுமதி பக்கம் இப்போது அசாக்சைப் பயன்படுத்தி புதுப்பிக்கிறது மற்றும் அனைத்து பொத்தானையும் தேர்ந்தெடுக்கவும்

source: :issue:`573` Exports: corrected and clarified exposure time and duration units, added number of pulses
ta: : வெளியீடு: `573` ஏற்றுமதி: சரிசெய்யப்பட்ட மற்றும் தெளிவுபடுத்தப்பட்ட வெளிப்பாடு நேரம் மற்றும் கால அலகுகள், பருப்பு வகைகளின் எண்ணிக்கை சேர்க்கப்பட்டது

source: :issue:`572` Interface: homepage now populates as AJAX to increase responsiveness
ta: : வெளியீடு: `572` இடைமுகம்: முகப்புப்பக்கம் இப்போது மறுமொழியை அதிகரிக்க அசாக்சாக மக்கள்

source: :issue:`570` Charts: simplified chart function code
ta: : வெளியீடு: `570` விளக்கப்படங்கள்: எளிமைப்படுத்தப்பட்ட விளக்கப்பட செயல்பாட்டுக் குறியீடு

source: :issue:`569` Charts: fixed frequency issue with mean averages selected
ta: : வெளியீடு: `569` விளக்கப்படங்கள்: தேர்ந்தெடுக்கப்பட்ட சராசரி சராசரிகளுடன் நிலையான அதிர்வெண் சிக்கல்

source: :issue:`568` Imports: missing DICOM date-time no longer causes an error
ta: : வெளியீடு: `568` இறக்குமதி: காணாமல் போன டிகாம் தேதி நேரம் இனி பிழையை ஏற்படுத்தாது

source: :issue:`567` Celery: fixed dual-namespace imports of tasks
ta: : வெளியீடு: `567` செலரி: பணிகளின் நிலையான இரட்டை-பெயர் இறக்குமதி

source: :issue:`566` Interface: correctly show "assumed patient mass" in case of set value of zero
ta: : வெளியீடு: `566` இடைமுகம்: பூச்சியத்தின் நிர்ணயிக்கப்பட்ட மதிப்பில்" நோயாளி வெகுசனத்தை "சரியாகக் காட்டுங்கள்

source: :issue:`565` Interface: correctly handle dose area product with zero value
ta: : வெளியீடு: `565` இடைமுகம்: சுழிய மதிப்புடன் டோச் பகுதி தயாரிப்பை சரியாக கையாளவும்

source: :issue:`564` Skin dose maps: text information on skin dose maps now embedded when saving the 2d or 3d map as a graphic
ta: :issue:`564` Skin dose maps: உரை செய்தி on skin dose maps now embedded when saving the 2d or 3d map அச் a graphic

source: :issue:`562` Skin dose maps: error message on calculation failure now more explicit
ta: : வெளியீடு: `562` தோல் டோச் வரைபடங்கள்: கணக்கீட்டு தோல்வியில் பிழை செய்தி இப்போது மிகவும் வெளிப்படையானது

source: :issue:`561` Imports: patient orientation modifier now correctly extracted from RDSR
ta: : வெளியீடு: `561` இறக்குமதி: நோயாளி நோக்குநிலை மாற்றி இப்போது RDSR இலிருந்து சரியாக பிரித்தெடுக்கப்பட்டுள்ளது

source: :issue:`560` Exports: added study level comments
ta: : வெளியீடு: `560` ஏற்றுமதி: கூடுதல் ஆய்வு நிலை கருத்துகள்

source: :issue:`559` Interface: date pickers inconsistent start day fixed
ta: : வெளியீடு: `559` இடைமுகம்: தேதி எடுப்பவர்கள் சீரற்ற தொடக்க நாள் சரி செய்யப்பட்டது

source: :issue:`558` Skin dose maps: set defaults instead of crashing if kV, dose, table or tube/detector position are missing
ta: : வெளியீடு: `558` தோல் டோச் வரைபடங்கள்: கே.வி.

source: :issue:`557` Skin dose maps: improved construction of patient orientation code
ta: : வெளியீடு: `557` தோல் டோச் வரைபடங்கள்: நோயாளி நோக்குநிலை குறியீட்டின் மேம்பட்ட கட்டுமானம்

source: :issue:`556` Exports: DX exports where TotalNumberOfRadiographicFrames is not populated now export
ta: :issue:`556` Exports: DX exports where TotalNumberOfRadiographicFrames is not populated now ஏற்றுமதி

source: :issue:`552` Documentation: documented extractor for older Toshiba CT scanners
ta: : வெளியீடு: `552` ஆவணம்: பழைய தோசிபா சி.டி ச்கேனர்களுக்கான ஆவணப்படுத்தப்பட்ட பிரித்தெடுத்தல்

source: :issue:`551` Documentation: added procedure for opening csv files in Excel with non-ASCII characters
ta: : வெளியீடு: `551` ஆவணம்: சி.எச்.வி கோப்புகளை எக்செல் அல்லாத எழுத்துக்களுடன் திறப்பதற்கான கூடுதல் செயல்முறை

source: :issue:`550` Documentation: added a note to describe exposure time and duration for fluoroscopy studies
ta: : வெளியீடு: `550` ஆவணங்கள்: ஃப்ளோரோச்கோபி ஆய்வுகளுக்கான வெளிப்பாடு நேரம் மற்றும் கால அளவை விவரிக்க ஒரு குறிப்பைச் சேர்த்தது

source: :issue:`549` Documentation: added procedure for fixing laterality on Hologic studies, ref :issue:`411`
ta: :issue:`549` Documentation: added procedure க்கு fixing laterality on Hologic studies, ref :issue:`411`

source: :issue:`547` Interface: improved handling of available time information for fluoro studies
ta: : வெளியீடு: `547` இடைமுகம்: ஃப்ளோரோ ஆய்வுகளுக்கான கிடைக்கக்கூடிய நேர தகவல்களை மேம்படுத்துதல்

source: :issue:`546` Query Retrieve: added flag and functionality to query for Toshiba images
ta: : வெளியீடு: `546` வினவல் மீட்டெடு: தோசிபா படங்களுக்கான வினவலுக்கு கொடி மற்றும் செயல்பாடு சேர்க்கப்பட்டது

source: :issue:`544` Interface: added procedure, requested procedure to summary listings and details and filtering
ta: : வெளியீடு: `544` இடைமுகம்: சேர்க்கப்பட்ட நடைமுறை, சுருக்கமான பட்டியல்கள் மற்றும் விவரங்கள் மற்றும் வடிகட்டுதலுக்கு கோரப்பட்ட நடைமுறை

source: :issue:`543` Interface: added drop-down box to choose how many studies are displayed on filtered pages
ta: : வெளியீடு: `543` இடைமுகம்: வடிகட்டப்பட்ட பக்கங்களில் எத்தனை ஆய்வுகள் காட்டப்படுகின்றன என்பதைத் தேர்வுசெய்ய கீழ்தோன்றும் பெட்டி சேர்க்கப்பட்டது

source: :issue:`542` Interface: added display name to all detailed html pages
ta: : வெளியீடு: `542` இடைமுகம்: அனைத்து விரிவான உஉகுமொ பக்கங்களுக்கும் காட்சி பெயர் சேர்க்கப்பட்டது

source: :issue:`541` Documentation: updated for celery on Windows
ta: : வெளியீடு: `541` ஆவணம்: சாளரங்களில் செலரிக்கு புதுப்பிக்கப்பட்டது

source: :issue:`540` Documentation: updated for current skinDose functionality
ta: : வெளியீடு: `540` ஆவணம்: தற்போதைய ச்கிண்டோச் செயல்பாட்டிற்கு புதுப்பிக்கப்பட்டது

source: :issue:`539` Documentation: updated chart document to include series toggle buttons
ta: : வெளியீடு: `539` ஆவணங்கள்: தொடர் மாற்று பொத்தான்களைச் சேர்க்க புதுப்பிக்கப்பட்ட விளக்கப்பட ஆவணம்

source: :issue:`537` Charts: hide series function added
ta: : வெளியீடு: `537` விளக்கப்படங்கள்: தொடர் செயல்பாடு சேர்க்கப்பட்டது

source: :issue:`536` Code quality: reduced javascript duplication and collected file groups into subfolders
ta: :issue:`536` குறியீடு quality: reduced சாவாகைஉரை படியீடு and collected கோப்பு groups into subfolders

source: :issue:`535` Interface: fixed problem where category names that included a plus symbol caused filtering and chart issues
ta: : வெளியீடு: `535` இடைமுகம்: பிளச் சின்னத்தை உள்ளடக்கிய வகை பெயர்கள் வடிகட்டுதல் மற்றும் விளக்கப்பட சிக்கல்களை ஏற்படுத்தும் நிலையான சிக்கல்

source: :issue:`534` Interface: chart drilldown reported as not working - was actually due to a user's database migrations
ta: :issue:`534` Interface: chart drilldown reported அச் not working - was actually due பெறுநர் a user's database migrations

source: :issue:`533` Query Retrieve: Reduced number of simultaneous associations to one, reused for everything
ta: : வெளியீடு: `533` வினவல் மீட்டெடு: ஒரே நேரத்தில் சங்கங்களின் எண்ணிக்கையை குறைத்து, எல்லாவற்றிற்கும் மீண்டும் பயன்படுத்தப்பட்டது

source: :issue:`532` DICOM: documented how to work-around missing encoding charsets due to old pydicom
ta: :issue:`532` DICOM: documented how பெறுநர் work-around missing encoding charsets due பெறுநர் old pydicom

source: :issue:`529` Charts: added CT charts of number of irradiation events per study description and requested procedure
ta: : வெளியீடு: `529` விளக்கப்படங்கள்: ஒரு ஆய்வு விளக்கத்திற்கு கதிர்வீச்சு நிகழ்வுகளின் எண்ணிக்கையின் சி.டி விளக்கப்படங்கள் சேர்க்கப்பட்டன மற்றும் கோரப்பட்ட செயல்முறை

source: :issue:`528` Query Retrieve: reduced number of simultaneous associations to one, reused for everything
ta: : வெளியீடு: `528` வினவல் மீட்டெடு: ஒரே நேரத்தில் ஒரே நேரத்தில் சங்கங்களின் எண்ணிக்கையை குறைத்து, எல்லாவற்றிற்கும் மீண்டும் பயன்படுத்தப்பட்டது

source: :issue:`526` Code quality: addressed some of the code quality/style issues raised by `Codacy`
ta: :issue:`526` குறியீடு quality: addressed some of the குறியீடு quality/style issues raised by `Codacy`

source: :issue:`525` Importing: improved mammo import by checking compression force before converting to float
ta: : வெளியீடு: `525` இறக்குமதி: மிதப்புக்கு மாற்றுவதற்கு முன் சுருக்க சக்தியைச் சரிபார்ப்பதன் மூலம் மேம்பட்ட மம்மோ இறக்குமதி

source: :issue:`524` Importing: improved mammo import by checking anode exists before converting to DICOM terms
ta: :issue:`524` Importing: improved mammo இறக்குமதி by checking நேர் மின்வாய் exists before converting பெறுநர் DICOM terms

source: :issue:`523` Importing: changed mammo import to use del_no_match instead of del_mg_im if not mammo
ta: :issue:`523` Importing: changed mammo இறக்குமதி பெறுநர் use del_no_match instead of del_mg_im if not mammo

source: :issue:`522` Documentation: made it clearer on offline-install docs that version numbers will change
ta: : வெளியீடு: `522` ஆவணம்: பதிப்பு எண்கள் மாறும் என்று ஆஃப்லைன்-இன்ச்டால் டாக்சில் அதை தெளிவுபடுத்தியது

source: :issue:`521` Testing: added tests for dual source CT imports
ta: : வெளியீடு: `521` சோதனை: இரட்டை மூல சி.டி இறக்குமதிக்கான சோதனைகள் சேர்க்கப்பட்டன

source: :issue:`520` Imports: removed XML styling from Philips legacy CT comment creation
ta: : வெளியீடு: `520` இறக்குமதி: பிலிப்ச் மரபு சி.டி கருத்து உருவாக்கத்திலிருந்து எக்ச்எம்எல் ச்டைலிங் அகற்றப்பட்டது

source: :issue:`519` Skin dose maps: fixed black on black text issue
ta: : வெளியீடு: `519` தோல் டோச் வரைபடங்கள்: கருப்பு உரை வெளியீட்டில் நிலையான கருப்பு
