Repository: 247i/TACETr
Catalog: உரை/தானி/opentracks-opentracks-src-main-res-values-strings-xml-main-*.po
Languages: ta

source: empty
ta: காலி

# about_preference_title
source: About
ta: பற்றி

# about_description
source: <i>OpenTracks</i> is a sport tracking application that completely respects your privacy.
ta: <i> ஓபன்ட்ராக்ச் </i> என்பது உங்கள் தனியுரிமையை முழுமையாக மதிக்கும் விளையாட்டு கண்காணிப்பு பயன்பாடாகும்.

# about_url
source: Project webpage: <a href="%1$s">%1$s</a>
ta: திட்ட வலைப்பக்கம்: <a href="%1$s">%1$s </a>

# about_version_name
source: Version name: %1$s
ta: பதிப்பு பெயர்: %1$s

# about_version_code
source: Version code: %1$d
ta: பதிப்பு குறியீடு: %1$d

# about_history
source: OpenTracks is a fork of <a href="https://code.google.com/archive/p/mytracks/"><i>Google's MyTracks</i></a> (discontinued in 2016).
ta: Opentracks என்பது <a href="https://code.google.com/archive/p/mytracks/"> <i> கூகிளின் மைட்ராக்ச் </i> </a> (2016 இல் நிறுத்தப்பட்டது).

# about_third_party_data
source: Third-party data
ta: மூன்றாம் தரப்பு தரவு

# about_libraries
source: Libraries
ta: நூலகங்கள்

# help_feature_title
source: OpenTracks has the following features:
ta: ஓபன்ட்ராக்ச் பின்வரும் அம்சங்களைக் கொண்டுள்ளது:

# help_feature_content
source: * create GPS tracks * use a heart rate sensor (Bluetooth LE only) * voice announcements (by time or distance) * create markers (incl. pictures) * works completely offline * show tracks on a map (see below)
ta: * சி.பி.எச் தடங்களை உருவாக்கவும் * இதய துடிப்பு சென்சார் பயன்படுத்தவும் (புளூடூத் லு மட்டும்) * குரல் அறிவிப்புகள் (நேரம் அல்லது தூரத்தின் அடிப்படையில்) * குறிப்பான்களை உருவாக்கு (படங்கள் உள்ளிட்டவை) * முற்றிலும் ஆஃப்லைனில் வேலை செய்கிறது * வரைபடத்தில் தடங்களைக் காண்பி (கீழே காண்க)

# help_track_map_title
source: How to show a track on a map?
ta: வரைபடத்தில் ஒரு பாதையை எவ்வாறு காண்பிப்பது?

# help_track_map_content
source: Use the small map icon. a) (live updates) Install <a href="https://github.com/OpenTracksApp/OSMDashboard">OSMDashboard</a>. It provides online or offline maps via <a href="https://www.openstreetmap.org">OpenStreetMap</a>. Actually, OSMDashboard is a separate app that only can access (temporarily) the data of track(s) that are going to be shown. b) Via a normal map application (e.g., <a href="http://osmand.net/">OsmAnd</a> and <a href="https://maps.me/">MAPS.ME</a>). These apps need to support the KMZ file format (only locations and timestamps). In fact, an app needs to support <i>ACTION_VIEW</i> with MIME <i>application/vnd.google-earth.kmz</i>.
ta: சிறிய வரைபட ஐகானைப் பயன்படுத்தவும். a) (நேரடி புதுப்பிப்புகள்) <a href = "https://github.com/opentracksapp/osmdashboard"> osmdashboard </a> ஐ நிறுவவும். இது <a href = "https://www.openstreetmap.org"> openstreetmap </a> வழியாக நிகழ்நிலை அல்லது இணைப்பில்லாத வரைபடங்களை வழங்குகிறது. உண்மையில், ஓஎச்எம்டாச்போர்டு என்பது ஒரு தனி பயன்பாடாகும், இது காட்டப்படப் போகும் பாதையின் (தற்காலிகமாக) மட்டுமே அணுக முடியும் (தற்காலிகமாக). b) ஒரு சாதாரண வரைபட பயன்பாடு வழியாக (எ.கா., <a href = "http://osmand.net/"> osmand </a> மற்றும் <a href = "https://maps.me/"> maps.me < /a>). இந்த பயன்பாடுகள் KMZ கோப்பு வடிவமைப்பை ஆதரிக்க வேண்டும் (இருப்பிடங்கள் மற்றும் நேர முத்திரைகள் மட்டுமே). உண்மையில்.

# help_storage_pictures_title
source: How does OpenTracks store pictures that were taken as markers?
ta: குறிப்பான்களாக எடுக்கப்பட்ட படங்களை ஓபன்ட்ராக்ச் எவ்வாறு சேமிக்கிறது?

# help_storage_pictures_content
source: These are stored in the app internal storage (i.e., only accessible within OpenTracks).
ta: இவை பயன்பாட்டு உள் சேமிப்பகத்தில் சேமிக்கப்படுகின்றன (அதாவது, ஓபன்ட்ராக்சுக்குள் மட்டுமே அணுக முடியும்).

# help_track_export_title
source: How can I export/share recorded tracks?
ta: பதிவுசெய்யப்பட்ட தடங்களை நான் எவ்வாறு ஏற்றுமதி செய்யலாம்/பகிர்ந்து கொள்ளலாம்?

# help_track_export_content
source: Tracks can be exported from the Settings as KMZ, KML, or GPX. KMZ/KML all data; GPX only locations. Tracks shared via the <i>share icon</i> are shared as KMZ.
ta: அமைப்புகளிலிருந்து KMZ, KML அல்லது GPX என தடங்களை ஏற்றுமதி செய்யலாம். KMZ/KML அனைத்து தரவுகளும்; சிபிஎக்ச் மட்டுமே இடங்கள். <i> பகிர்வு படவுரு </i> வழியாக பகிரப்பட்ட தடங்கள் KMZ என பகிரப்படுகின்றன.

# help_data_google_play_services_title
source: Does OpenTracks require/use Google Play Service?
ta: Opentracks க்கு Google Play சேவையை தேவையா/பயன்படுத்துமா?

# help_data_google_play_services_content
source: No
ta: இல்லை

# help_recording_title
source: How does OpenTracks record data?
ta: Opentracks தரவை எவ்வாறு பதிவு செய்கிறது?

# help_recording_content
source: OpenTracks uses the GPS sensor of the device to record the location continuously. If the GPS device reports inaccurate data (e.g., location, speed, elevation), OpenTracks cannot do anything about it.
ta: இருப்பிடத்தை தொடர்ந்து பதிவு செய்ய ஓபன்ட்ராக்ச் சாதனத்தின் சி.பி.எச் சென்சாரைப் பயன்படுத்துகிறது. சி.பி.எச் சாதனம் தவறான தரவைப் புகாரளித்தால் (எ.கா., இருப்பிடம், விரைவு, உயரம்), ஓபன்ட்ராக்ச் இதைப் பற்றி எதுவும் செய்ய முடியாது.

# help_data_storage_title
source: How does OpenTracks store sensor data?
ta: ஓபன்ட்ராக்ச் சென்சார் தரவை எவ்வாறு சேமிக்கிறது?

# help_data_storage_content
source: Sensor data is stored per recorded location. In terms of a heart rate sensor, this means that only <i>one</i> heart rate measurement is stored per location. If you are standing still or are indoors, no sensor data will be recorded (but it will be shown).
ta: பதிவுசெய்யப்பட்ட இடத்திற்கு சென்சார் தரவு சேமிக்கப்படுகிறது. இதய துடிப்பு சென்சாரைப் பொறுத்தவரை, இதன் பொருள் <i> ஒன்று </i> இதய துடிப்பு அளவீட்டு இடத்திற்கு சேமிக்கப்படுகிறது. நீங்கள் அசையாமல் இருந்தால் அல்லது வீட்டிற்குள் இருந்தால், சென்சார் தரவு எதுவும் பதிவு செய்யப்படாது (ஆனால் அது காண்பிக்கப்படும்).

# help_gps_troubleshooting_title
source: OpenTracks is not recording locations?
ta: ஓபன்ட்ராக்ச் இடங்களை பதிவு செய்யவில்லையா?

# help_gps_troubleshooting_content
source: What you can do: a) check if GPS is enabled, b) improve GPS reception (e.g., go outdoors), c) check with <a href="https://f-droid.org/en/packages/com.android.gpstest.osmdroid/">GPSTest</a> app, and d) disable power saving. If everything does not help please report a bug.
ta: நீங்கள் என்ன செய்ய முடியும்: a) சி.பி.எச் இயக்கப்பட்டதா என்பதை சரிபார்க்கவும், b) சி.பி.எச் வரவேற்பை மேம்படுத்தவும் (எ.கா., வெளியில் செல்லுங்கள்), c) <a href="https://f-droid.org/en/packages/com.android.gpstest.osmdroid/"> gpstest </a> பயன்பாடு, மற்றும் ஈ) ஆற்றல் சேமிப்பை முடக்கு. எல்லாம் உதவாவிட்டால் தயவுசெய்து ஒரு பிழையைப் புகாரளிக்கவும்.

# help_support_title
source: How can I support OpenTracks?
ta: ஓபன்ட்ராக்சை நான் எவ்வாறு ஆதரிக்க முடியும்?

# help_support_content
source: You can: a) spread the word about OpenTracks, b) <a href="https://github.com/OpenTracksApp/OpenTracks/issues">propose features</a>, c) <a href="https://github.com/OpenTracksApp/OpenTracks/issues">report bugs</a>, d) help in software development, e) buy in <a href="https://play.google.com/store/apps/details?id=de.dennisguse.opentracks.playstore">Google Play Store</a>, f) donate, and g) do whatever you think helps OpenTracks.
ta: உங்களால் முடியும்: அ) ஓபன்ட்ராக்சைப் பற்றி பரப்பவும், b) <a href = "https://github.com/opentracksapp/opentracks/issues"> அம்சங்களை முன்மொழிகிறது </a>,, c) <a href = "https://github.com/opentracksapp/opentracks/issues"> பிழைகள் </a>, d) மென்பொருள் மேம்பாட்டில் உதவி, e) <a href = "https://play.google.com/store/apps/details?id=de.dennisguse.opentracks.playstore" f) நன்கொடை, மற்றும் g) நீங்கள் நினைப்பதைச் செய்யுங்கள்.

# open_track_as_trackfileformat
source: Open as %1$s
ta: %1$s என திறந்திருக்கும்

# activity_type_airplane
source: airplane
ta: வானூர்தி

# activity_type_atv
source: ATV
ta: ஏடிவி

# activity_type_biking
source: biking
ta: பைக்கிங்

# activity_type_blimp
source: blimp
ta: பிளிம்ப்

# activity_type_boat
source: boat
ta: படகு

# activity_type_climbing
source: climbing
ta: ஏறுதல்

# activity_type_commercial_airplane
source: commercial airplane
ta: வணிக வானூர்தி

# activity_type_cross_country_skiing
source: cross-country skiing
ta: குறுக்கு நாடு பனிச்சறுக்கு

# activity_type_cycling
source: cycling
ta: சைக்கிள் ஓட்டுதல்

# activity_type_dirt_bike
source: dirt bike
ta: அழுக்கு பைக்

# activity_type_donkey_back_riding
source: donkey back riding
ta: கழுதை முதுகு சவாரி

# activity_type_driving
source: driving
ta: வண்டி ஓட்டுதல்

# activity_type_driving_bus
source: driving bus
ta: ஓட்டுநர் பச்

# activity_type_driving_car
source: driving car
ta: ஓட்டுநர் கார்

# activity_type_escooter
source: escooter
ta: எச்கூட்டர்

# activity_type_kickscooter
source: scooter
ta: ச்கூட்டர்

# activity_type_ferry
source: ferry
ta: படகு

# activity_type_frisbee
source: frisbee
ta: ஃபிரிச்பீ

# activity_type_gliding
source: gliding
ta: சறுக்குதல்

# activity_type_hang_gliding
source: hang gliding
ta: சறுக்கு தொங்கு

# activity_type_helicopter
source: helicopter
ta: உலங்கூர்தி

# activity_type_hiking
source: hiking
ta: ஐக்கிங்

# activity_type_horse_back_riding
source: horse back riding
ta: குதிரை சவாரி

# activity_type_hot_air_balloon
source: hot air balloon
ta: சூடான காற்று பலூன்

# activity_type_ice_sailing
source: ice sailing
ta: பனி படகோட்டம்

# activity_type_inline_skating
source: inline skating
ta: இன்லைன் ச்கேட்டிங்

# activity_type_kayaking
source: kayaking
ta: கயாக்கிங்

# activity_type_kite_surfing
source: kite surfing
ta: காத்தாடி சர்ஃபிங்

# activity_type_land_sailing
source: land sailing
ta: நிலப் பயணம்

# activity_type_mixed_type
source: mixed type
ta: கலப்பு வகை

# activity_type_motor_bike
source: motor bike
ta: மின்னோடி பைக்

# activity_type_motor_boating
source: motor boating
ta: மின்னோடி படகு சவாரி

# activity_type_mountain_biking
source: mountain biking
ta: மவுண்டன் பைக்கிங்

# activity_type_off_trail_hiking
source: off trail hiking
ta: டிரெயில் ஐக்கிங் ஆஃப்

# activity_type_other
source: other
ta: மற்றொன்று

# activity_type_paddling
source: paddling
ta: துடுப்பு

# activity_type_para_gliding
source: para gliding
ta: பாராகிளைடிங்

# activity_type_rc_airplane
source: RC airplane
ta: ஆர்.சி வானூர்தி

# activity_type_rc_boat
source: RC boat
ta: ஆர்.சி படகு

# activity_type_rc_helicopter
source: RC helicopter
ta: ஆர்.சி எலிகாப்டர்

# activity_type_riding
source: riding
ta: சவாரி

# activity_type_road_biking
source: road biking
ta: சாலை பைக்கிங்

# activity_type_roller_skiing
source: roller skiing
ta: ரோலர் பனிச்சறுக்கு

# activity_type_rowing
source: rowing
ta: ரோயிங்

# activity_type_running
source: running
ta: இயங்கும்

# activity_type_sailing
source: sailing
ta: படகோட்டம்

# activity_type_seaplane
source: seaplane
ta: சீப்ளேன்

# activity_type_skate_boarding
source: skate boarding
ta: ச்கேட் போர்டிங்

# activity_type_skating
source: skating
ta: ச்கேட்டிங்

# activity_type_skiing
source: skiing
ta: பனிச்சறுக்கு

# activity_type_sky_jumping
source: sky jumping
ta: வான சம்பிங்

# activity_type_sled
source: sled
ta: ச்லெட்

# activity_type_snow_boarding
source: snow boarding
ta: பனிச்சறுக்கு

# activity_type_snow_shoeing
source: snow shoeing
ta: ச்னோசூயிங்

# activity_type_speed_walking
source: speed walking
ta: வேக நடைபயிற்சி

# activity_type_street_running
source: street running
ta: தெரு ஓட்டம்

# activity_type_surfing
source: surfing
ta: சர்ஃபிங்

# activity_type_track_cycling
source: track cycling
ta: ட்ராக் சைக்கிள் ஓட்டுதல்

# activity_type_track_running
source: track running
ta: ட்ராக் இயங்கும்

# activity_type_trail_hiking
source: trail hiking
ta: டிரெயில் ஐக்கிங்

# activity_type_trail_running
source: trail running
ta: பாதை இயங்கும்

# activity_type_train
source: train
ta: ரயில்

# activity_type_ultimate_frisbee
source: ultimate frisbee
ta: அல்டிமேட் ஃபிரிச்பீ

# activity_type_unknown
source: unknown
ta: தெரியவில்லை

# activity_type_wakeboarding
source: wakeboarding
ta: வேக் போர்டிங்

# activity_type_walking
source: walking
ta: நடைபயிற்சி

# activity_type_water_skiing
source: water skiing
ta: நீர் பனிச்சறுக்கு

# activity_type_wind_surfing
source: wind surfing
ta: காற்று சர்ஃபிங்

# activity_type_swimming
source: swimming
ta: நீச்சல்

# activity_type_swimming_open
source: swimming in open water
ta: திறந்த நீரில் நீந்துகிறது

# activity_type_workout
source: workout
ta: பயிற்சி

# description_activity_type
source: Activity type: %1$s
ta: செயல்பாட்டு வகை: %1$s

# description_average_moving_pace_in_minute
source: Average moving pace: %1$s min/km (%2$s min/mi)
ta: சராசரி நகரும் வேகம்: %1$s min/km ( %2$s min/mi)

# description_average_moving_speed
source: Average moving speed: %1$.2f km/h (%2$.1f mi/h)
ta: சராசரி நகரும் வேகம்: %1$.2f கிமீ/மணி ( %2$.1f மைல்/எச்)

# description_average_pace_in_minute
source: Average pace: %1$s min/km (%2$s min/mi)
ta: சராசரி வேகம்: %1$s min/km ( %2$s min/mi)

# description_average_speed
source: Average speed: %1$.2f km/h (%2$.1f mi/h)
ta: சராசரி வேகம்: %1$.2f கிமீ/மணி ( %2$.1f Mi/h)

# description_altitude_gain
source: Elevation gain: %1$d m (%2$d ft)
ta: உயர்வு ஆதாயம்: %1$d மீ ( %2$d அடி)

# description_altitude_loss
source: Elevation loss: %1$d m (%2$d ft)
ta: உயர இழப்பு: %1$d மீ ( %2$d அடி)

# description_altitude_imperial
source: Elevation (ft)
ta: உயரம் (அடி)

# description_altitude_metric
source: Elevation (m)
ta: உயரம் (மீ)

# description_fastest_pace_in_minute
source: Fastest pace: %1$s min/km (%2$s min/mi)
ta: வேகமான வேகம்: %1$s min/km ( %2$s min/mi)

# description_max_altitude
source: Max elevation: %1$d m (%2$d ft)
ta: அதிகபட்ச உயர்வு: %1$d மீ ( %2$d அடி)

# description_max_speed
source: Max speed: %1$.2f km/h (%2$.1f mi/h)
ta: அதிகபட்ச வேகம்: %1$.2f கிமீ/மணி ( %2$.1f Mi/h)

# description_min_altitude
source: Min elevation: %1$d m (%2$d ft)
ta: மணித்துளி உயரம்: %1$d மீ ( %2$d அடி)

# description_moving_time
source: Moving time: %1$s
ta: நகரும் நேரம்: %1$s

# description_pace_imperial
source: Pace (min/mi)
ta: விரைவு (நிமிடம்/மை)

# description_pace_nautical
source: Pace (min/NM)
ta: விரைவு (நிமிடம்/என்.எம்)

# description_pace_metric
source: Pace (min/km)
ta: விரைவு (நிமிடம்/கிமீ)

# description_recorded_time
source: Recorded: %1$s
ta: பதிவுசெய்யப்பட்டது: %1$s

# description_speed_ms
source: Speed (m/s)
ta: விரைவு (மீ/வி)

# description_sensor_cadence
source: Cadence (rpm)
ta: கேடென்ச் (ஆர்.பி.எம்)

# description_sensor_heart_rate
source: Heart rate (bpm)
ta: இதய துடிப்பு (பிபிஎம்)

# description_sensor_power
source: Power (W)
ta: ஆற்றல் (W)

# description_default_speed_or_pace
source: By activity type
ta: செயல்பாட்டு வகை மூலம்

# description_speed_imperial
source: Speed (mi/hr)
ta: விரைவு (Mi/hr)

# description_speed_nautical
source: Speed (knots)
ta: விரைவு (முடிச்சுகள்)

# description_speed_metric
source: Speed (km/hr)
ta: விரைவு (கிமீ/மணிநேரம்)

# description_time
source: Time
ta: நேரம்

# description_total_distance
source: Total distance: %1$.2f km (%2$.1f mi)
ta: மொத்த தூரம்: %1$.2f கி.மீ ( %2$.1f மை)

# description_total_time
source: Total time: %1$s
ta: மொத்த நேரம்: %1$s

# description_speed_source_gps
source: GPS
ta: உலக இடம் காட்டும் அமைப்பு

# export_with_photos
source: with photos
ta: புகைப்படங்களுடன்

# export_without_photos
source: without photos
ta: புகைப்படங்கள் இல்லாமல்

# export_error_post_workout
source: Post-workout export failed, please check the export directory.
ta: வொர்க்அவுட்டுக்கு பிந்தைய ஏற்றுமதி தோல்வியடைந்தது, தயவுசெய்து ஏற்றுமதி கோப்பகத்தை சரிபார்க்கவும்.

# export_cannot_write_to_dir
source: Cannot write to export directory.
ta: ஏற்றுமதி கோப்பகத்திற்கு எழுத முடியாது.

# export_dir_not_writable
source: (not writable!)
ta: (எழுத முடியாதது அல்ல!)

# export_progress_message
source: Exporting to %1$s…
ta: %1$s க்கு ஏற்றுமதி…

# export_track_already_exists_msg
source: The file %1$s already exists at the destination directory.
ta: %1$s கோப்பு ஏற்கனவே இலக்கு கோப்பகத்தில் உள்ளது.

# export_all_do_it_for_all
source: do it for all conflicts
ta: எல்லா மோதல்களுக்கும் இதைச் செய்யுங்கள்

# export_track_errors
source: Files not exported
ta: கோப்புகள் ஏற்றுமதி செய்யப்படவில்லை

# export_progress_summary_new_msg
source: New files exported
ta: புதிய கோப்புகள் ஏற்றுமதி செய்யப்பட்டன

# export_progress_summary_overwrite_msg
source: Files overwritten
ta: கோப்புகள் மேலெழுதப்பட்டவை

# export_progress_summary_skip_msg
source: Files skipped
ta: கோப்புகள் தவிர்க்கப்பட்டன

# export_progress_summary_errors_msg
source: Errors
ta: பிழைகள்

# generic_add
source: Add
ta: கூட்டு

# generic_delete_selected_confirm_title
source: Delete selected?
ta: தேர்ந்தெடுக்கப்பட்டதை நீக்கு?

# generic_description
source: Description
ta: விவரம்

# generic_description_line
source: Description: %1$s
ta: விளக்கம்: %1$s

# generic_name
source: Name
ta: பெயர்

# generic_name_line
source: Name: %1$s
ta: பெயர்: %1$s

# generic_open_track
source: Open Track
ta: திறந்த பாதையில்

# generic_recording
source: Recording…
ta: பதிவு செய்தல்…

# generic_save
source: Save
ta: சேமி

# generic_tracks
source: Tracks
ta: தடங்கள்

# generic_overwrite
source: Overwrite
ta: மேலெழுதும்

# generic_skip
source: Skip
ta: தவிர்

# generic_show_errors
source: Show Errors
ta: பிழைகளைக் காட்டு

# generic_completed_with_errors
source: Completed with one error
ta: ஒரு பிழையுடன் முடிக்கப்பட்டது

# generic_completed
source: Completed
ta: முடிந்தது

# generic_click_twice_cancel
source: Click back again to cancel
ta: ரத்து செய்ய மீண்டும் சொடுக்கு செய்க

# generic_choose_an_option
source: Choose an option
ta: ஒரு விருப்பத்தைத் தேர்வுசெய்க

# generic_undo
source: Undo
ta: செயல்தவிர்

# generic_filter
source: Filter
ta: வடிப்பி

# generic_from
source: From
ta: இருந்து

# generic_to
source: To
ta: பெறுநர்

# generic_today
source: Today
ta: இன்று

# generic_yesterday
source: Yesterday
ta: நேற்று

# generic_dismiss
source: Dismiss
ta: தள்ளுபடி

# gps_starting
source: Starting GPS
ta: சி.பி.எச்

# gps_wait_for_better_signal
source: Waiting for a better GPS signal
ta: சிறந்த சி.பி.எச் சிக்னலுக்காக காத்திருக்கிறது

# gps_wait_for_signal
source: Waiting for GPS signal
ta: சி.பி.எச் சிக்னலுக்காக காத்திருக்கிறது

# gps_disabled_msg
source: GPS disabled
ta: சி.பி.எச் முடக்கப்பட்டது

source: GPS fixed and ready
ta: சி.பி.எச் நிலையான மற்றும் தயாராக உள்ளது

# gps_recording_without_signal
source: OpenTracks is recording without GPS data.
ta: சிபிஎச் தரவு இல்லாமல் ஓபென்ட்ராக்ச் பதிவு செய்கிறது.

# image_arrow
source: Arrow
ta: அம்பு

# image_marker_count
source: Marker count
ta: மார்க்கர் எண்ணிக்கை

# image_photo_marker
source: Photo marker
ta: புகைப்பட மார்க்கர்

# image_record
source: Record
ta: பதிவு

# image_stop
source: Stop
ta: நிறுத்து

# image_discard
source: Discard
ta: நிராகரிக்கவும்

# image_track
source: Track
ta: மின்தடம்

# import_thread_interrupted
source: Thread interrupted
ta: நூல் குறுக்கிட்டது

# import_unsupported_format
source: Unsupported file format
ta: ஆதரிக்கப்படாத கோப்பு வடிவம்

# import_parser_error
source: Parser error: %1$s
ta: பாகுபடுத்தி பிழை: %1$s

# import_unable_to_import_file
source: Unable to import file: %1$s
ta: கோப்பை இறக்குமதி செய்ய முடியவில்லை: %1$s

# import_no_kml_file_found
source: No kml file found in KMZ
ta: KMZ இல் KML கோப்பு இல்லை

# import_error_list_dialog_title
source: Files not imported
ta: கோப்புகள் இறக்குமதி செய்யப்படவில்லை

# import_file_imported
source: File %1$s imported
ta: கோப்பு %1$s இறக்குமதி செய்யப்பட்டது

# import_prevent_reimport
source: You have set prevent re-import track
ta: நீங்கள் மீண்டும் இறக்குமதி செய்யும் தடத்தைத் தடுக்கிறீர்கள்

# import_progress_message
source: Importing from %1$s…
ta: %1$s இலிருந்து இறக்குமதி செய்தல்…

# import_progress_summary_ok_msg
source: Files imported
ta: இறக்குமதி செய்யப்பட்ட கோப்புகள்

# import_progress_summary_exists_msg
source: Already exists
ta: ஏற்கனவே உள்ளது

# import_progress_summary_errors_msg
source: Errors
ta: பிழைகள்

# create_marker_error
source: Unable to create a marker. Try again.
ta: ஒரு மார்க்கரை உருவாக்க முடியவில்லை. மீண்டும் முயற்சிக்கவும்.

# marker_add_error
source: Unable to insert a marker. No GPS signal. Try again.
ta: ஒரு மார்க்கரை செருக முடியவில்லை. சி.பி.எச் சிக்னல் இல்லை. மீண்டும் முயற்சிக்கவும்.

# marker_add_success
source: A marker was inserted
ta: ஒரு மார்க்கர் செருகப்பட்டது

# marker_add_canceled
source: Canceled, no marker added
ta: ரத்து செய்யப்பட்டது, எந்த மார்க்கரும் சேர்க்கப்படவில்லை

# marker_add_photo_canceled
source: Canceled, no photo marker added
ta: ரத்து செய்யப்பட்டது, புகைப்பட மார்க்கர் எதுவும் சேர்க்கப்படவில்லை

# marker_delete_one_confirm_message
source: The marker will be permanently deleted from the device
ta: மார்க்கர் சாதனத்திலிருந்து நிரந்தரமாக நீக்கப்படும்

# marker_delete_one_confirm_title
source: Delete marker?
ta: மார்க்கரை நீக்கவா?

# marker_delete_multiple_confirm_message
source: The selected markers will be permanently deleted from the device
ta: தேர்ந்தெடுக்கப்பட்ட குறிப்பான்கள் சாதனத்திலிருந்து நிரந்தரமாக நீக்கப்படும்

# marker_name_format
source: Marker %1$d
ta: மார்க் %1$d

# marker_title
source: %1$d of %2$d
ta: %1$d %2$d

# marker_edit_marker_type
source: Marker type (e.g. waterfall)
ta: மார்க்கர் வகை (எ.கா. நீர்வீழ்ச்சி)

# marker_list_empty_message
source: You don't have any markers
ta: உங்களிடம் எந்த குறிப்பான்களும் இல்லை

# menu_aggregated_statistics
source: Aggregated stats
ta: ஒருங்கிணைந்த புள்ளிவிவரங்கள்

# menu_delete
source: Delete
ta: நீக்கு

# menu_edit
source: Edit
ta: தொகு

# menu_export_all
source: Export all (one file per track)
ta: அனைத்தையும் ஏற்றுமதி செய்யுங்கள் (ஒரு பாதைக்கு ஒரு கோப்பு)

# menu_export_all_one_file
source: Export all (one file for all tracks)
ta: அனைத்தையும் ஏற்றுமதி செய்யுங்கள் (அனைத்து தடங்களுக்கும் ஒரு கோப்பு)

# menu_help
source: Help
ta: உதவி

# menu_import_all
source: Import all
ta: அனைத்தையும் இறக்குமதி செய்யுங்கள்

# menu_insert_marker
source: Insert marker
ta: அடையாளத்தை செருகவும்

# menu_insert_photo
source: Insert photo
ta: புகைப்படத்தை செருகவும்

# menu_insert_gallery_img
source: Insert gallery image
ta: கேலரி படத்தை செருகவும்

# menu_markers
source: Markers
ta: குறிப்பான்கள்

# menu_search
source: Search
ta: தேடல்

# menu_select_all
source: Select all
ta: அனைத்தையும் தெரிவுசெய்

# menu_settings
source: Settings
ta: அமைப்புகள்

# menu_share
source: Share
ta: பங்கு

# menu_select_layout
source: Select Layout
ta: தளவமைப்பு என்பதைத் தேர்ந்தெடுக்கவும்

# menu_show_on_map
source: Show on map
ta: வரைபடத்தில் காட்டு

# menu_voice_rate
source: Voice speed
ta: குரல் விரைவு

# menu_resume_track
source: Resume track
ta: தடத்தை மீண்டும் தொடங்குங்கள்

# menu_add_custom_layout
source: New Layout
ta: புதிய தளவமைப்பு

# menu_filter
source: Filter
ta: வடிப்பி

source: Recording service
ta: பதிவு பணி

# permission_gps_failed
source: OpenTracks requires permission to use GPS.
ta: ஓபன்ட்ராக்சுக்கு சி.பி.எச் பயன்படுத்த இசைவு தேவை.

# permission_recording_failed
source: OpenTracks requires permission to access your location as well as nearby devices.
ta: உங்கள் இருப்பிடத்தையும் அருகிலுள்ள சாதனங்களையும் அணுக OPENTRACKS க்கு இசைவு தேவைப்படுகிறது.

# permission_bluetooth_failed
source: OpenTracks requires permission to use Bluetooth.
ta: ஊடலை பயன்படுத்த Opentracks க்கு இசைவு தேவை.

# permission_bluetooth_failed_rejected
source: You manually need to grant OpenTracks access to Nearby Devices in system settings.
ta: கணினி அமைப்புகளில் அருகிலுள்ள சாதனங்களுக்கான ஓபன்ட்ராக்சை நீங்கள் கைமுறையாக வழங்க வேண்டும்.

# sensor_state_cadence_avg
source: Avg Cadence
ta: ஏ.வி.சி கேடென்ச்

# sensor_state_cadence_max
source: Max Cadence
ta: அதிகபட்ச காடென்ச்

# sensor_state_cadence_unit
source: rpm
ta: ஆர்.பி.எம்

# sensor_state_heart_rate
source: Heart rate
ta: இதய துடிப்பு

# sensor_state_heart_rate_avg
source: Avg Heart rate
ta: ஏ.வி.சி இதய துடிப்பு

# sensor_state_heart_rate_max
source: Max Heart rate
ta: அதிகபட்ச இதய துடிப்பு

# sensor_state_heart_rate_unit
source: bpm
ta: பிபிஎம்

# sensor_state_heart_rate_value
source: %1$d bpm
ta: %1$d பிபிஎம்

# sensor_state_power
source: Power
ta: விசை

# sensor_state_pressure
source: Barometer
ta: காற்றழுத்தமானி

# sensor_state_power_avg
source: Avg Power
ta: ஏ.வி.சி ஆற்றல்

# sensor_state_power_max
source: Max Power
ta: அதிகபட்ச ஆற்றல்
