Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: :issue:`788` Tasks: Celery and RabbitMQ dropped, background task processing now managed within Python/OpenREM
ta: :issue:`788` Tasks: சிவரிக்கீரை and RabbitMQ dropped, பின்னணி task processing now managed within Python/OpenREM

source: :issue:`787` Interface: fixed login error
ta: : வெளியீடு: `787` இடைமுகம்: நிலையான உள்நுழைவு பிழை

source: :issue:`786` Installation: increased Windows IIS timeouts in docs
ta: : வெளியீடு: `786` நிறுவல்: டாக்சில் அதிகரித்த சாளரங்கள் ஐஐஎச் நேரம் முடிந்தது

source: :issue:`777` Updated OpenREM to use pydicom 1.3
ta: : வெளியீடு: `777` பைடிகாம் 1.3 ஐப் பயன்படுத்த ஓபன்ரெம் புதுப்பிக்கப்பட்டது

source: :issue:`772` DICOM Networking: check for station name at series level or study, not both
ta: : வெளியீடு: `772` டிகாம் நெட்வொர்க்கிங்: தொடர் மட்டத்தில் நிலைய பெயரைச் சரிபார்க்கவும்

source: :issue:`764` Imports: extractor functions log to extractor log instead of default
ta: : வெளியீடு: `764` இறக்குமதி: பிரித்தெடுக்கும் செயல்பாடுகள் இயல்புநிலைக்கு பதிலாக பிரித்தெடுத்தல் பதிவுக்கு உள்நுழைகின்றன

source: :issue:`744` Added overwrite mode to size import
ta: : வெளியீடு: `744` அளவு இறக்குமதிக்கு ஓவர்ரைட் பயன்முறையைச் சேர்க்கப்பட்டது

source: :issue:`678` Enabled import of PX modality panoramic exam data - they appear in the Radiographic section
ta: :issue:`678` இயக்கப்பட்டது இறக்குமதி of PX modality panoramic exam தகவல்கள் - they appear in the Radiographic பிரிவு

source: :issue:`664` Documentation: added sample config files to installation
ta: : வெளியீடு: `664` ஆவணம்: மாதிரி கட்டமைப்பு கோப்புகளை நிறுவலில் சேர்த்தது

source: :issue:`657` Documentation: split local_settings.py example into Windows and Linux versions
ta: :issue:`657` Documentation: split local_settings.py example into சாளரங்கள் and Linux versions

source: :issue:`530` Updated OpenREM to use pynetdicom 1.4
ta: :issue:`530` Updated OpenREM பெறுநர் use pynetdicom 1.4

source: :issue:`513` Internationalization: first translation strings added to documentation
ta: : வெளியீடு: `513` சர்வதேசமயமாக்கல்: முதல் மொழிபெயர்ப்பு சரங்கள் ஆவணங்களில் சேர்க்கப்பட்டன

source: :issue:`512` Internationalization: first translation strings added to interface
ta: : வெளியீடு: `512` சர்வதேசமயமாக்கல்: இடைமுகத்தில் முதல் மொழிபெயர்ப்பு சரங்கள் சேர்க்கப்பட்டன

source: :issue:`457` Updated OpenREM to use Django 2.2
ta: : வெளியீடு: `457` சாங்கோ 2.2 ஐப் பயன்படுத்த ஓபன்ரெம் புதுப்பிக்கப்பட்டது

source: :issue:`477` Charts: replaced HighCharts with open source Plotly library
ta: : வெளியீடு: `477` விளக்கப்படங்கள்: ஐகார்ட்டுகளை திறந்த மூல சூழ்ச்சி நூலகத்துடன் மாற்றியது

source: :issue:`437` Updated OpenREM to use django-filters v2
ta: : வெளியீடு: `437` சாங்கோ-வடிகட்டிகள் வி 2 ஐப் பயன்படுத்த ஓபன்ரெம் புதுப்பிக்கப்பட்டது

source: :issue:`433` Import: Siemens Arcadis Varic dose reports are now imported
ta: : வெளியீடு: `433` இறக்குமதி: சீமென்ச் ஆர்காடிச் வெரிக் டோச் அறிக்கைகள் இப்போது இறக்குமதி செய்யப்பட்டுள்ளன

source: :issue:`404` Ported OpenREM to Python 3
ta: : வெளியீடு: `404` பைதான் 3 க்கு ஓபன்ரெம்

source: :issue:`233` Charts: added charts of average CTDI and DLP over time
ta: : வெளியீடு: `233` விளக்கப்படங்கள்: காலப்போக்கில் சராசரி சி.டி.டி.ஐ மற்றும் டி.எல்.பியின் விளக்கப்படங்கள் சேர்க்கப்பட்டன

source: :issue:`94` Nuclear medicine: added nuclear medicine SPECT and PET functionality including RRSDR imports
ta: :issue:`94` Nuclear medicine: added nuclear medicine SPECT and PET செயல்கூறு including RRSDR இறக்குமதிகள்

source: :issue:`785` Interface: added study level comments to rfdetail.html
ta: : வெளியீடு: `785` இடைமுகம்: rfdetail.html இல் ஆய்வு நிலை கருத்துகளைச் சேர்த்தது

source: :issue:`784` Imports: added laterality under target region as per 2017 CP 1676 change
ta: : வெளியீடு: `784` இறக்குமதி: 2017 சிபி 1676 மாற்றத்தின் படி இலக்கு பிராந்தியத்தின் கீழ் பக்கவாட்டு சேர்க்கப்பட்டது

source: :issue:`783` Interface: replaced static links by dynamic versions in rfdetail.html
ta: : வெளியீடு: `783` இடைமுகம்: rfdetail.html இல் மாறும் பதிப்புகள் மூலம் நிலையான இணைப்புகளை மாற்றியது

source: :issue:`782` Exports: fixed RF export issue with studies containing multiple modalities
ta: : வெளியீடு: `782` ஏற்றுமதி: பல முறைகளைக் கொண்ட ஆய்வுகளுடன் நிலையான வானலை ஏற்றுமதி சிக்கல்

source: :issue:`781` Charts: fixed issue where charts were mis-labelled if "Case-insensitive categories" was unchecked
ta: : வெளியீடு: `781` விளக்கப்படங்கள்:" வழக்கு-உணர்வற்ற வகைகள் "தேர்வு செய்யப்படாவிட்டால் விளக்கப்படங்கள் தவறாக பெயரிடப்பட்ட நிலையான சிக்கல்

source: :issue:`780` Interface: changed mammography accumulated laterality to use code_value rather than code_meaning
ta: :issue:`780` Interface: changed mammography accumulated laterality பெறுநர் use code_value rather than code_meaning

source: :issue:`779` Installation: added restriction to django-qsstats-magic version
ta: : வெளியீடு: `779` நிறுவல்: சாங்கோ-கியூச்ச்டாட்ச்-மோனிக் பதிப்பிற்கு கட்டுப்பாடு சேர்க்கப்பட்டது

source: :issue:`778` Imports: added summary field population tests, fixed CT RDSR Total DLP import error
ta: :issue:`778` Imports: added summary புலம் population tests, fixed CT RDSR Total DLP இறக்குமதி பிழை

source: :issue:`776` Documentation: grammar and spelling correction for PHE exports
ta: : வெளியீடு: `776` ஆவணம்: PHE ஏற்றுமதிக்கான இலக்கணம் மற்றும் எழுத்துப்பிழை திருத்தம்

source: :issue:`775` Exports, documentation: fixed units issue and minor docs issue for PHE DX export
ta: : வெளியீடு: `775` ஏற்றுமதி, ஆவணங்கள்: நிலையான அலகுகள் வெளியீடு மற்றும் PHE DX ஏற்றுமதிக்கான சிறு டாக்ச் வெளியீடு

source: :issue:`774` Charts: fixed issue where charts were mis-labelled if "Plot a series per system" was unchecked
ta: :issue:`774` Charts: fixed சிக்கல் where விளக்கப்படங்கள் were mis-labelled if "Plot a series per system" was unchecked

source: :issue:`771` Interface: entire fluoro exam row now highlighted when dose alert exceeded
ta: : வெளியீடு: `771` இடைமுகம்: டோச் எச்சரிக்கை மீறும்போது முழு ஃப்ளோரோ தேர்வு வரிசை இப்போது முன்னிலைப்படுத்தப்பட்டுள்ளது

source: :issue:`770` Imports: fix to allow non-conformant Opera Swing to import
ta: : வெளியீடு: `770` இறக்குமதி: இணக்கமற்ற ஓபரா ச்விங்கை இறக்குமதி செய்ய அனுமதிக்க சரிசெய்யவும்

source: :issue:`769` Interface: modified to allow detail view display of Ziehm studies with missing summary data
ta: :issue:`769` Interface: மாற்றியமைக்கப்பட்ட பெறுநர் allow detail பார்வை காட்சி of Ziehm studies with missing summary தகவல்கள்

source: :issue:`768` Charts: study- and request-level charts now use study-level summary fields to improve performance
ta: : வெளியீடு: `768` விளக்கப்படங்கள்: ஆய்வு- மற்றும் கோரிக்கை-நிலை விளக்கப்படங்கள் இப்போது செயல்திறனை மேம்படுத்த ஆய்வு-நிலை சுருக்கம் புலங்களைப் பயன்படுத்துகின்றன

source: :issue:`765` Imports: updated error catching to allow Philips BigBore 4DCT RDSR to import
ta: : வெளியீடு: `765` இறக்குமதி: பிலிப்ச் பிக்போர் 4DCT RDSR ஐ இறக்குமதி செய்ய அனுமதிக்க புதுப்பிக்கப்பட்ட பிழை பிடிப்பு

source: :issue:`763` Imports: corrected delta week fluoro study counting for dual plane modalities
ta: : வெளியீடு: `763` இறக்குமதி: சரி செய்யப்பட்ட டெல்டா வார ஃப்ளோரோ ஆய்வு இரட்டை விமான முறைகளுக்கான எண்ணிக்கை

source: :issue:`762` Interface: fixed error when deleting dual plane radiography studies
ta: : வெளியீடு: `762` இடைமுகம்: இரட்டை விமான ரேடியோகிராஃபி ஆய்வுகளை நீக்கும்போது நிலையான பிழை

source: :issue:`761` Imports: fixed issue in high dose alert e-mail code where week_delta may be used before assignment
ta: :issue:`761` Imports: fixed சிக்கல் in high dose alert மின்னஞ்சல் குறியீடு where week_delta சி-வைகாசி be used before assignment

source: :issue:`759` Database: added study level summary fields and migration function
ta: : வெளியீடு: `759` தரவுத்தளம்: ஆய்வு நிலை சுருக்கம் புலங்கள் மற்றும் இடம்பெயர்வு செயல்பாடு சேர்க்கப்பட்டது

source: :issue:`758` Configuration: corrected issues with location of js_reverse static files
ta: : வெளியீடு: `758` உள்ளமைவு: JS_REVEXER நிலையான கோப்புகளின் இருப்பிடத்துடன் சரிசெய்யப்பட்ட சிக்கல்கள்

source: :issue:`750` Exports: added export tailored to the 2019 PHE DX dose survey
ta: : வெளியீடு: `750` ஏற்றுமதி: 2019 PHE DX டோச் கணக்கெடுப்புக்கு ஏற்ற ஏற்றுமதி சேர்க்கப்பட்டது

source: :issue:`746` Imports: enabled import of GE Elite Mini View C-arm RDSR with no template declaration
ta: :issue:`746` Imports: இயக்கப்பட்டது இறக்குமதி of கீ Elite Mini பார்வை C-arm RDSR with இல்லை template சாற்றுதல்

source: :issue:`181` Imports: corrected import of grid information from RDSRs
ta: : வெளியீடு: `181` இறக்குமதி: RDSRS இலிருந்து கட்டம் தகவல்களை இறக்குமதி செய்தல்

source: :issue:`766` Documentation: updated the Windows Celery documentation to reflect changes required to shutdown Celery 3.1.25
ta: : வெளியீடு: `766` ஆவணம்: செலரி பணிநிறுத்தம் செய்ய தேவையான மாற்றங்களை பிரதிபலிக்க சாளரங்கள் செலரி ஆவணங்களை புதுப்பித்தது 3.1.25

source: :issue:`755` Interface: fix more static URLs to allow virtual directory web server configurations
ta: : வெளியீடு: `755` இடைமுகம்: மெய்நிகர் அடைவு வலை சேவையக உள்ளமைவுகளை அனுமதிக்க மேலும் நிலையான முகவரி களை சரிசெய்யவும்

source: :issue:`754` Documentation and install: updated docs and minimum version for collectstatic_js_reverse
ta: : வெளியீடு: `754` ஆவணங்கள் மற்றும் நிறுவு: புதுப்பிக்கப்பட்ட ஆவணங்கள் மற்றும் சேகரிப்புக்கான குறைந்தபட்ச பதிப்பு

source: :issue:`753` Query-retrieve: removed patient age fields from study level C-FIND that were not used
ta: :issue:`753` Query-retrieve: removed patient age புலங்கள் இருந்து study நிலை C-FIND that were not used

source: :issue:`752` Exports: fixed missing weight field in PHE CT 2019 export
ta: : வெளியீடு: `752` ஏற்றுமதி: PHE CT 2019 ஏற்றுமதியில் நிலையான எடை புலம் இல்லை

source: :issue:`749` Documentation: updated the Linux quick install docs
ta: : வெளியீடு: `749` ஆவணம்: லினக்ச் விரைவான நிறுவல் டாக்சைப் புதுப்பித்தது

source: :issue:`748` Charts: fixed error that caused blank charts if series per system was selected
ta: : வெளியீடு: `748` விளக்கப்படம்: ஒரு கணினிக்கு தொடரின் வெற்று விளக்கப்படத்தை ஏற்படுத்திய பிழையை சரிசெய்யவும் தேர்ந்தெடுக்கப்பட்டது

source: :issue:`747` Installation: changed minimum Python version for current version of Flower
ta: : வெளியீடு: `747` நிறுவல்: பூவின் தற்போதைய பதிப்பிற்கான குறைந்தபட்ச பைதான் பதிப்பை மாற்றியது

source: :issue:`743` Testing: added configuration to enable testing with default logging
ta: : வெளியீடு: `743` சோதனை: இயல்புநிலை பதிவு மூலம் சோதனையை செயல்படுத்த உள்ளமைவு சேர்க்கப்பட்டது

source: :issue:`742` Interface: sorting of task tables now works in Internet Explorer 11
ta: : வெளியீடு: `742` இடைமுகம்: பணி அட்டவணைகளை வரிசைப்படுத்துதல் இப்போது இன்டர்நெட் எக்ச்ப்ளோரர் 11 இல் வேலை செய்கிறது

source: :issue:`740` Installation: fixed Celery version to avoid dependency on Django 1.11
ta: : வெளியீடு: `740` நிறுவல்: சாங்கோ 1.11 ஐ சார்புநிலையைத் தவிர்க்க நிலையான செலரி பதிப்பு

source: :issue:`739` Imports: fixed import errors for GE surgical fluoroscopy
ta: : வெளியீடு: `739` இறக்குமதி: கீ அறுவை மருத்தீடு ஃப்ளோரோச்கோபிக்கான நிலையான இறக்குமதி பிழைகள்

source: :issue:`738` Logging: added single_date query date to log, added tasks aborts to logs
ta: :issue:`738` Logging: added single_date query திகதி பெறுநர் log, added பணிகள் aborts பெறுநர் logs

source: :issue:`737` Interface and exports: specify number of events and export to PHE 2019 CT survey specification
ta: : வெளியீடு: `737` இடைமுகம் மற்றும் ஏற்றுமதி: நிகழ்வுகளின் எண்ணிக்கையைக் குறிப்பிடவும், PHE 2019 CT கணக்கெடுப்பு விவரக்குறிப்புக்கு ஏற்றுமதி செய்யவும்

source: :issue:`736` Query-retrieve: duplicate study level responses now removed from query
ta: :issue:`736` Query-retrieve: duplicate study நிலை responses now removed இருந்து query

source: :issue:`735` Imports: switched to more secure defusedxml for parsing XML in comments
ta: : வெளியீடு: `735` இறக்குமதி: கருத்துகளில் எக்ச்எம்எல்லை பாகுபடுத்துவதற்காக மிகவும் பாதுகாப்பான நீக்கப்பட்ட எக்ச்.எம்.எல்

source: :issue:`734` Query-retrieve: handle illegal image level response with no instance number
ta: : வெளியீடு: `734` வினவல்-மறுதொடக்கம்: சட்டவிரோத பட நிலை பதிலைக் கையாளுங்கள்.

source: :issue:`732` Query-retrieve: added advanced option to workaround empty series issue
ta: :issue:`732` Query-retrieve: added மேம்பட்ட சூதம் பெறுநர் workaround வெறுமை series சிக்கல்

source: :issue:`710` Interface: time-based columns in Celery and RabbitMQ tables now sorted correctly
ta: : வெளியீடு: `710` இடைமுகம்: செலரி மற்றும் முயல் அட்டவணைகளில் நேர அடிப்படையிலான நெடுவரிசைகள் இப்போது சரியாக வரிசைப்படுத்தப்பட்டுள்ளன

source: :issue:`404` Code quality: changes to lead toward Python 3 compliance
ta: : வெளியீடு: `404` குறியீடு தரம்: பைத்தான் 3 இணக்கத்தை நோக்கி வழிவகுக்கும் மாற்றங்கள்

source: :issue:`733` Documentation: post-release fixes for 0.9.0 docs
ta: : வெளியீடு: `733` ஆவணம்: 0.9.0 டாக்சிற்கான வெளியீட்டுக்குப் பிந்தைய திருத்தங்கள்

source: :issue:`731` Imports: fixed another issue with display names on upgrade to 0.9
ta: : வெளியீடு: `731` இறக்குமதி: 0.9 க்கு மேம்படுத்தப்பட்ட காட்சி பெயர்களுடன் மற்றொரு சிக்கல் சரி செய்யப்பட்டது

source: :issue:`729` Interface: replaced hard coded URLs in displaynameview.html and review_failed_imports.html with url names
ta: :issue:`729` Interface: replaced hard coded URLs in displaynameview.html and review_failed_imports.html with முகவரி names

source: :issue:`727` Imports: fixed issue with display names on upgrade to 0.9
ta: : வெளியீடு: `727` இறக்குமதி: 0.9 க்கு மேம்படுத்தப்பட்ட காட்சி பெயர்களுடன் நிலையான சிக்கல்

source: :issue:`726` Documentation: updated to include the new task management function
ta: : வெளியீடு: `726` ஆவணம்: புதிய பணி மேலாண்மை செயல்பாட்டைச் சேர்க்க புதுப்பிக்கப்பட்டது

source: :issue:`725` Charts: added fluoroscopy charts of DAP and frequency per requested procedure
ta: : வெளியீடு: `725` விளக்கப்படங்கள்: கோரப்பட்ட செயல்முறைக்கு டிஏபி மற்றும் அதிர்வெண் ஆகியவற்றின் ஃப்ளோரோச்கோபி விளக்கப்படங்கள் சேர்க்கப்பட்டன

source: :issue:`723` Task management: fixed issue with latest version of kombu and amqp on Windows
ta: : வெளியீடு: `723` பணி மேலாண்மை: சாளரங்களில் கொம்பு மற்றும் AMQP இன் அண்மைக் கால பதிப்பில் நிலையான சிக்கல்

source: :issue:`722` Interface: dual-plane DX studies are now displayed without error in filtered list and study detail page
ta: : வெளியீடு: `722` இடைமுகம்: இரட்டை விமான டிஎக்ச் ஆய்வுகள் இப்போது வடிகட்டப்பட்ட பட்டியல் மற்றும் ஆய்வு விவரம் பக்கத்தில் பிழை இல்லாமல் காட்டப்படுகின்றன

source: :issue:`721` Documentation: removed Django Debug Toolbar from default install and documented how to install and use it
ta: :issue:`721` Documentation: removed சாங்கோ Debug கருவிப்பட்டி இருந்து இயல்புநிலை install and documented how பெறுநர் install and use it

source: :issue:`720` Interface: fixed small overlap between skin dose map and irradiation type table
ta: : வெளியீடு: `720` இடைமுகம்: தோல் டோச் வரைபடம் மற்றும் கதிர்வீச்சு வகை அட்டவணை இடையே நிலையான சிறிய ஒன்றுடன் ஒன்று

source: :issue:`719` Interface: fixed hardcoded link in template rffiltered.html
ta: : வெளியீடு: `719` இடைமுகம்: வார்ப்புருவில் நிலையான ஆர்ட்கோட் செய்யப்பட்ட இணைப்பு rffiltered.html

source: :issue:`717` Query-retrieve: fixed problem where an error was thrown if association is None
ta: :issue:`717` Query-retrieve: fixed problem where an பிழை was thrown if association is எதுவுமில்லை

source: :issue:`716` Task manager: removed assumption of queue name from RabbitMQ management interface
ta: :issue:`716` Task manager: removed assumption of queue பெயர் இருந்து RabbitMQ management இடைமுகம்

source: :issue:`714` Documentation: add missing documentation about changing STATIC_URL if serving OpenREM in a virtual directory
ta: :issue:`714` Documentation: கூட்டு missing ஆவணப்படுத்துதல் பற்றி changing STATIC_URL if serving OpenREM in a virtual directory

source: :issue:`711` Query-retrieve: fixed problem for zero image series when using -toshiba flag
ta: :issue:`711` Query-retrieve: fixed problem க்கு சுழிமம் படம் series when using -toshiba flag

source: :issue:`710` Interface: Celery and RabbitMQ tables can now be sorted by clicking on column headings
ta: :issue:`710` Interface: சிவரிக்கீரை and RabbitMQ அட்டவணைகள் can now be sorted by clicking on நெடுவரிசை headings

source: :issue:`709` Query-retrieve: corrected query logic for multiple modalities using :issue:`627` Modality tag at study level fix
ta: :issue:`709` Query-retrieve: corrected query தருக்கம், ஏரணம் க்கு multiple modalities using :issue:`627` Modality tag at study நிலை fix

source: :issue:`708` Query-retrieve: fixed problem for empty Series Number
ta: : வெளியீடு: `708` வினவல்-மறுதொடக்கம்: வெற்று தொடர் எண்ணுக்கு நிலையான சிக்கல்

source: :issue:`707` Interface: fixed issue where sigdig returned an error if it was passed an empty string
ta: :issue:`707` Interface: fixed சிக்கல் where sigdig returned an பிழை if it was passed an வெறுமை சரம்

source: :issue:`706` Exports: fixed problem where filters were not respected for radiographic exports
ta: : வெளியீடு: `706` ஏற்றுமதி: ரேடியோகிராஃபிக் ஏற்றுமதிக்கு வடிப்பான்கள் மதிக்கப்படாத நிலையான சிக்கல்

source: :issue:`705` Task manager: added Flower to install and integrated to interface
ta: : வெளியீடு: `705` பணி மேலாளர்: நிறுவுவதற்கு மலர் சேர்க்கப்பட்டது மற்றும் இடைமுகத்துடன் ஒருங்கிணைக்கப்பட்டது

source: :issue:`704` Imports: caters for illegal use of dGy.cm2 units in RDSR for DAP values
ta: :issue:`704` Imports: caters க்கு illegal use of dGy.cm2 units in RDSR க்கு DAP values

source: :issue:`703` Interface: fixed URL lookup error for failed imports on homepage
ta: : வெளியீடு: `703` இடைமுகம்: முகப்புப்பக்கத்தில் தோல்வியுற்ற இறக்குமதிக்கான நிலையான முகவரி தேடல் பிழை

source: :issue:`702` Query-retrieve: fixed URLs in DICOM javascript files to allow virtual-directories
ta: :issue:`702` Query-retrieve: fixed URLs in DICOM சாவாகைஉரை கோப்புகள் பெறுநர் allow virtual-directories

source: :issue:`701` Interface: made the fluoroscopy exposure detail table sortable by clicking on headers
ta: : வெளியீடு: `701` இடைமுகம்: ஃப்ளோரோச்கோபி வெளிப்பாடு விவரம் அட்டவணையை தலைப்புகளில் சொடுக்கு செய்வதன் மூலம் வரிசைப்படுத்தலாம்

source: :issue:`698` Imports: allow for incorrect case in Procedure reported tag in RDSR
ta: : வெளியீடு: `698` இறக்குமதி: RDSR இல் நடைமுறையில் அறிக்கையிடப்பட்ட குறிச்சொல்லில் தவறான வழக்கை அனுமதிக்கவும்

source: :issue:`697` Testing: added tests for fluoroscopy high dose alerts (single-plane systems)
ta: : வெளியீடு: `697` சோதனை: ஃப்ளோரோச்கோபி உயர் டோச் விழிப்பூட்டல்களுக்கான சோதனைகள் (ஒற்றை விமான அமைப்புகள்)

source: :issue:`696` Interface: fixed broken Delete Studies and Entry button
ta: : வெளியீடு: `696` இடைமுகம்: நிலையான உடைந்த நீக்குதல் ஆய்வுகள் மற்றும் நுழைவு பொத்தான்

source: :issue:`695` Imports: added missing name attribute for size_abort url
ta: : வெளியீடு: `695` இறக்குமதி: அளவு_போர்ட் முகவரி க்கான காணாமல் போன பெயர் பண்புக்கூறு சேர்க்கப்பட்டது

source: :issue:`694` Query-retrieve: added extensive logging and summary to interface
ta: : வெளியீடு: `694` வினவல்-மறுதொடக்கம்: விரிவான பதிவு மற்றும் இடைமுகத்திற்கு சுருக்கம் சேர்க்கப்பட்டது

source: :issue:`693` Interface: fixed display of numbers with significant places settings and comma localisation
ta: : வெளியீடு: `693` இடைமுகம்: குறிப்பிடத்தக்க இடங்கள் அமைப்புகள் மற்றும் கமா உள்ளூராக்கல் கொண்ட எண்களின் நிலையான காட்சி

source: :issue:`691` Interface: fixed URL lookup error for Display Names page
ta: : வெளியீடு: `691` இடைமுகம்: காட்சி பெயர்களுக்கான நிலையான முகவரி தேடல் பிழை

source: :issue:`690` Interface: added workload stats user option entry back into config menu
ta: : வெளியீடு: `690` இடைமுகம்: பணிச்சுமை புள்ளிவிவரங்கள் பயனர் விருப்ப நுழைவு மீண்டும் கட்டமைப்பு பட்டியலில் நுழைவு

source: :issue:`689` Interface: fixed URL lookup error for DICOM summary page
ta: : வெளியீடு: `689` இடைமுகம்: DICOM சுருக்கம் பக்கத்திற்கான நிலையான முகவரி தேடல் பிழை

source: :issue:`688` Interface: Add possibility to apply known display name based on Device Observer UID (default: disabled)
ta: :issue:`688` Interface: கூட்டு possibility பெறுநர் இடு known காட்சி பெயர் based on Device நோக்காளன் UID (default: disabled)

source: :issue:`685` Charts: fixed link code that would otherwise cause DLP per acquisition protocol chart histogram links to fail
ta: : வெளியீடு: `685` விளக்கப்படங்கள்: நிலையான இணைப்புக் குறியீடு இல்லையெனில் கையகப்படுத்தல் நெறிமுறை விளக்கப்படம் இச்டோகிராம் இணைப்புகள் தோல்வியடையும்

source: :issue:`683` Installation: added VIRTUAL_DIRECTORY to the settings file to avoid updating local_settings file on upgrade
ta: :issue:`683` Installation: added VIRTUAL_DIRECTORY பெறுநர் the அமைப்புகள் கோப்பு பெறுநர் avoid updating local_settings கோப்பு on மேம்படுத்தல்

source: :issue:`682` Charts: fixed problem where links from histogram bars didn't filter correctly when case-insensitive categories selected
ta: :issue:`682` Charts: fixed problem where links இருந்து செவ்வகப்படம் bars didn't வடிப்பி correctly when case-insensitive categories தேர்ந்தெடுக்கப்பட்டது

source: :issue:`681` Imports: modified RDSR import to work with Varian RDSRs
ta: : வெளியீடு: `681` இறக்குமதி: மாறுபட்ட ஆர்.டி.எச்.ஆர்.எச் உடன் வேலை செய்ய மாற்றியமைக்கப்பட்ட ஆர்.டி.எச்.ஆர் இறக்குமதி

source: :issue:`679` Interface: added ability to filter CT studies on acquisition type
ta: : வெளியீடு: `679` இடைமுகம்: கையகப்படுத்தல் வகை குறித்த சி.டி ஆய்வுகளை வடிகட்டும் திறன் சேர்க்கப்பட்டது

source: :issue:`677` Interface: added additional filter materials to convert to abbreviations
ta: : வெளியீடு: `677` இடைமுகம்: சுருக்கங்களுக்கு மாற்ற கூடுதல் வடிகட்டி பொருட்களைச் சேர்த்தது

source: :issue:`676` Imports: improved error handling on patient size imports
ta: : வெளியீடு: `676` இறக்குமதி: நோயாளியின் அளவு இறக்குமதியில் மேம்பட்ட பிழை கையாளுதல்

source: :issue:`675` Exports: improved resilience when export includes malformed studies
ta: : வெளியீடு: `675` ஏற்றுமதி: ஏற்றுமதி செய்யும் போது மேம்பட்ட பின்னடைவு தவறான ஆய்வுகள் அடங்கும்

source: :issue:`674` Documentation: amended zip command in example Orthanc configuration to work with Linux and Windows
ta: :issue:`674` Documentation: amended zip கட்டளை in example Orthanc உள்ளமைவு பெறுநர் வேலை with Linux and சாளரங்கள்

source: :issue:`673` Imports: handle empty NumericValues and workaround for incorrect Philips Azurion AcquisitionDeviceType
ta: :issue:`673` Imports: கைப்பிடி வெறுமை NumericValues and workaround க்கு incorrect Philips Azurion AcquisitionDeviceType

source: :issue:`672` Documentation: improve and extend linux one-page install
ta: : வெளியீடு: `672` ஆவணம்: லினக்ச் ஒரு பக்க நிறுவலை மேம்படுத்தி நீட்டிக்கவும்

source: :issue:`670` Imports: handle illegal multi-value number in Toshiba RDSR with vHP
ta: : வெளியீடு: `670` இறக்குமதி: தோசிபா ஆர்.டி.எச்.ஆரில் சட்டவிரோத பல மதிப்பு எண்ணைக் கையாளவும் வி.எச்.பி.

source: :issue:`668` Code quality: library import and blank space cleanup
ta: : வெளியீடு: `668` குறியீடு தரம்: நூலக இறக்குமதி மற்றும் வெற்று விண்வெளி தூய்மைப்படுத்தல்

source: :issue:`667` Web server: enable OpenREM to be hosted from a non-root folder/virtual-directory
ta: :issue:`667` விரலிடைத் தோல் server: enable OpenREM பெறுநர் be hosted இருந்து a non-root folder/virtual-directory

source: :issue:`666` Query-retrieve: handle non-return of ModalitiesInStudy correctly
ta: :issue:`666` Query-retrieve: கைப்பிடி non-return of ModalitiesInStudy correctly

source: :issue:`665` Interface: added fluoroscopy high dose highlighting and e-mail alerts
ta: : வெளியீடு: `665` இடைமுகம்: கூடுதல் ஃப்ளோரோச்கோபி உயர் டோச் சிறப்பியல்பு மற்றும் மின்னஞ்சல் எச்சரிக்கைகள்

source: :issue:`662` Administration: added facility to list and purge RabbitMQ queues
ta: : வெளியீடு: `662` நிர்வாகம்: முயல் வரிசைகளை பட்டியலிடவும் சுத்திகரிக்கவும் சேர்க்கப்பட்டது

source: :issue:`659` Interface: made the latest study field in summary tables on the home page sort correctly
ta: : வெளியீடு: `659` இடைமுகம்: முகப்பு பக்கத்தில் சுருக்கமான அட்டவணையில் அண்மைக் கால ஆய்வுத் துறையை சரியாக உருவாக்கியது

source: :issue:`658` Interface: added display of workload stats in home page modality tables
ta: : வெளியீடு: `658` இடைமுகம்: முகப்பு பக்க மாதிரி அட்டவணைகளில் பணிச்சுமை புள்ளிவிவரங்களின் காட்சி சேர்க்கப்பட்டது
