Repository: 247i/TACETr
Catalog: உரை/தானி/openorienteering-mapper-*.po
Languages: ta

# OpenOrienteering::RotatePatternTool
source: <b>Drag</b>: Set the direction of area fill patterns or point objects.
ta: <b> இழுத்தல் </b>: பகுதி நிரப்பு வடிவங்கள் அல்லது புள்ளி பொருள்களின் திசையை அமைக்கவும்.

# OpenOrienteering::RotateTool
source: <b>Rotation:</b> %1°
ta: <b> சுழற்சி: </b> %1 °

# OpenOrienteering::RotateTool
source: <b>%1</b>: Fixed angles.
ta: <b>%1 </b>: நிலையான கோணங்கள்.

# OpenOrienteering::RotateTool
source: <b>Click</b>: Set the center of rotation.
ta: <b> சொடுக்கு </b>: சுழற்சி மையத்தை அமைக்கவும்.

# OpenOrienteering::RotateTool
source: <b>Drag</b>: Rotate the selected objects.
ta: <b> இழுத்து </b>: தேர்ந்தெடுக்கப்பட்ட பொருள்களை சுழற்றுங்கள்.

# OpenOrienteering::ScaleMapDialog
source: Change map scale
ta: வரைபட அளவை மாற்றவும்

# OpenOrienteering::ScaleMapDialog
source: Scaling parameters
ta: அளவிடுதல் அளவுருக்கள்

# OpenOrienteering::ScaleMapDialog
source: Scaling center:
ta: அளவிடுதல் மையம்:

# OpenOrienteering::ScaleMapDialog
source: New scale:
ta: புதிய அளவு:

# OpenOrienteering::ScaleMapDialog
source: Map coordinate system origin
ta: வரைபட ஒருங்கிணைப்பு கணினி தோற்றம்

# OpenOrienteering::ScaleMapDialog
source: Georeferencing reference point
ta: புவிசார் குறிப்பு புள்ளி

# OpenOrienteering::ScaleMapDialog
source: Other point,
ta: மற்ற புள்ளி,

# OpenOrienteering::ScaleMapDialog
source: Y:
ta: ஒய்:

# OpenOrienteering::ScaleMapDialog
source: Options
ta: விருப்பங்கள்

# OpenOrienteering::ScaleMapDialog
source: Scale symbol sizes
ta: அளவிலான குறியீட்டு அளவுகள்

# OpenOrienteering::ScaleMapDialog
source: Scale map object positions
ta: அளவிலான வரைபட பொருள் நிலைகள்

# OpenOrienteering::ScaleMapDialog
source: Adjust georeferencing reference point
ta: உலகம் பெரென்சிங் குறிப்பு புள்ளியை சரிசெய்யவும்

# OpenOrienteering::ScaleMapDialog
source: Scale non-georeferenced templates
ta: உலகம் அல்லாத வார்ப்புருக்கள்

# OpenOrienteering::ScaleTool
source: <b>Scaling:</b> %1%
ta: <b> அளவிடுதல்: </b> %1 %

# OpenOrienteering::ScaleTool
source: <b>Click</b>: Set the scaling center.
ta: <b> சொடுக்கு </b>: அளவிடுதல் மையத்தை அமைக்கவும்.

# OpenOrienteering::ScaleTool
source: <b>%1</b>: Switch to individual object scaling.
ta: <b>%1 </b>: தனிப்பட்ட பொருள் அளவீடுக்கு மாறவும்.

# OpenOrienteering::ScaleTool
source: <b>Drag</b>: Scale the selected objects.
ta: <b> இழுத்தல் </b>: தேர்ந்தெடுக்கப்பட்ட பொருள்களை அளவிடவும்.

# OpenOrienteering::SelectCRSDialog
source: Select coordinate reference system
ta: ஒருங்கிணைப்பு குறிப்பு முறையைத் தேர்ந்தெடுக்கவும்

# OpenOrienteering::SelectCRSDialog
source: Same as map
ta: வரைபடத்தைப் போலவே

# OpenOrienteering::SelectCRSDialog
source: Local
ta: உள்ளக

# OpenOrienteering::SelectCRSDialog
source: From template file
ta: வார்ப்புரு கோப்பிலிருந்து

# OpenOrienteering::SelectCRSDialog
source: Geographic coordinates (WGS84)
ta: புவியியல் ஆயத்தொலைவுகள் (WGS84)

# OpenOrienteering::SelectCRSDialog
source: Status:
ta: நிலை:

# OpenOrienteering::SelectCRSDialog
source: valid
ta: செல்லுபடியாகும்

# OpenOrienteering::SensorsSettingsPage
source: Location:
ta: இடம்:

# OpenOrienteering::SensorsSettingsPage
source: Source:
ta: ஆதாரம்:

# OpenOrienteering::SensorsSettingsPage
source: Serial port (NMEA):
ta: சீரியல் துறைமுகம் (NMEA):

# OpenOrienteering::SensorsSettingsPage
source: Sensors
ta: சென்சார்கள்

# OpenOrienteering::SensorsSettingsPage
source: Default
ta: இயல்புநிலை

# OpenOrienteering::SensorsSettingsPage
source: Windows
ta: சாளரங்கள்

# OpenOrienteering::SensorsSettingsPage
source: GeoClue
ta: சியோக்ளூ

# OpenOrienteering::SensorsSettingsPage
source: Core Location
ta: முக்கிய இடம்

# OpenOrienteering::SettingsDialog
source: Settings
ta: அமைப்புகள்

# OpenOrienteering::SimpleCourseDialog
source: Event and course details
ta: நிகழ்வு மற்றும் பாட விவரங்கள்

# OpenOrienteering::SimpleCourseDialog
source: Event name:
ta: நிகழ்வு பெயர்:

# OpenOrienteering::SimpleCourseDialog
source: Course name:
ta: பாடநெறி பெயர்:

# OpenOrienteering::SimpleCourseDialog
source: First code number:
ta: முதல் குறியீடு எண்:

# OpenOrienteering::SimpleCourseExport
source: Unnamed event
ta: பெயரிடப்படாத நிகழ்வு

# OpenOrienteering::SimpleCourseExport
source: Unnamed course
ta: பெயரிடப்படாத பாடநெறி

# OpenOrienteering::SimpleCourseExport
source: For this course export, a single line object must be selected.
ta: இந்த பாடநெறி ஏற்றுமதிக்கு, ஒற்றை வரி பொருள் தேர்ந்தெடுக்கப்பட வேண்டும்.

# OpenOrienteering::StorageLocation
source: '%1' is located in app storage. The files will be removed when uninstalling the app.
ta: பயன்பாட்டு சேமிப்பகத்தில் '%1' அமைந்துள்ளது. பயன்பாட்டை நிறுவல் நீக்கும்போது கோப்புகள் அகற்றப்படும்.

# OpenOrienteering::StorageLocation
source: '%1' is not writable. Changes cannot be saved.
ta: '%1' எழுதக்கூடியது அல்ல. மாற்றங்களைச் சேமிக்க முடியாது.

# OpenOrienteering::StorageLocation
source: Extra permissions are required to access '%1'.
ta: '%1' ஐ அணுக கூடுதல் அனுமதிகள் தேவை.

# OpenOrienteering::StorageLocation
source: '%1' is not a valid storage location.
ta: '%1' சரியான சேமிப்பக இடம் அல்ல.

# OpenOrienteering::StretchMapDialog
source: Change scale factor
ta: அளவிலான காரணியை மாற்றவும்

# OpenOrienteering::StretchMapDialog
source: Scaling parameters
ta: அளவிடுதல் அளவுருக்கள்

# OpenOrienteering::StretchMapDialog
source: Scaling center:
ta: அளவிடுதல் மையம்:

# OpenOrienteering::StretchMapDialog
source: Map coordinate system origin
ta: வரைபட ஒருங்கிணைப்பு கணினி தோற்றம்

# OpenOrienteering::StretchMapDialog
source: Georeferencing reference point
ta: புவிசார் குறிப்பு புள்ளி

# OpenOrienteering::StretchMapDialog
source: Other point,
ta: மற்ற புள்ளி,

# OpenOrienteering::StretchMapDialog
source: Y:
ta: ஒய்:

# OpenOrienteering::StretchMapDialog
source: Options
ta: விருப்பங்கள்

# OpenOrienteering::StretchMapDialog
source: Adjust georeferencing reference point
ta: உலகம் பெரென்சிங் குறிப்பு புள்ளியை சரிசெய்யவும்

# OpenOrienteering::StretchMapDialog
source: Scale non-georeferenced templates
ta: உலகம் அல்லாத வார்ப்புருக்கள்

# OpenOrienteering::SymbolDropDown
source: - none -
ta: - எதுவுமில்லை -

# OpenOrienteering::SymbolDropDownDelegate
source: - None -
ta: - எதுவுமில்லை -

# OpenOrienteering::SymbolPropertiesWidget
source: Number:
ta: எண்:

# OpenOrienteering::SymbolPropertiesWidget
source: Edit
ta: தொகு

# OpenOrienteering::SymbolPropertiesWidget
source: Name:
ta: பெயர்:

# OpenOrienteering::SymbolPropertiesWidget
source: Description:
ta: விளக்கம்:

# OpenOrienteering::SymbolPropertiesWidget
source: Helper symbol (not shown in finished map)
ta: உதவி அடையாளம் (முடிக்கப்பட்ட வரைபடத்தில் காட்டப்படவில்லை)

# OpenOrienteering::SymbolPropertiesWidget
source: General
ta: பொது

# OpenOrienteering::SymbolPropertiesWidget
source: Icon
ta: படவுரு

# OpenOrienteering::SymbolPropertiesWidget
source: Warning
ta: எச்சரிக்கை

# OpenOrienteering::SymbolPropertiesWidget
source: Description
ta: விவரம்

# OpenOrienteering::SymbolRenderWidget
source: For symbols with description, press F1 while the tooltip is visible to show it
ta: விளக்கத்துடன் கூடிய சின்னங்களுக்கு, F1 ஐ அழுத்தவும், அதைக் காட்ட உதவிக்குறிப்பு தெரியும்

# OpenOrienteering::SymbolRenderWidget
source: New symbol
ta: புதிய அடையாளம்

# OpenOrienteering::SymbolRenderWidget
source: Point
ta: புள்ளியம்

# OpenOrienteering::SymbolRenderWidget
source: Line
ta: வரி

# OpenOrienteering::SymbolRenderWidget
source: Area
ta: பகுதி

# OpenOrienteering::SymbolRenderWidget
source: Text
ta: உரை

# OpenOrienteering::SymbolRenderWidget
source: Combined
ta: இணைக்கப்பட்டது

# OpenOrienteering::SymbolRenderWidget
source: Edit
ta: தொகு

# OpenOrienteering::SymbolRenderWidget
source: Duplicate
ta: நகல்

# OpenOrienteering::SymbolRenderWidget
source: Delete
ta: நீக்கு

# OpenOrienteering::SymbolRenderWidget
source: Scale...
ta: அளவுகோல் ...

# OpenOrienteering::SymbolRenderWidget
source: Copy
ta: நகலெடு

# OpenOrienteering::SymbolRenderWidget
source: Paste
ta: ஒட்டு

# OpenOrienteering::SymbolRenderWidget
source: Show custom icons
ta: தனிப்பயன் சின்னங்களைக் காட்டு

# OpenOrienteering::SymbolRenderWidget
source: Select symbols
ta: சின்னங்களைத் தேர்ந்தெடுக்கவும்

# OpenOrienteering::SymbolRenderWidget
source: Enable drag and drop
ta: இழுத்து விடுங்கள்

# OpenOrienteering::SymbolRenderWidget
source: Error
ta: பிழை

# OpenOrienteering::SymbolRenderWidget
source: An internal error occurred, sorry!
ta: ஒரு உள் பிழை ஏற்பட்டது, மன்னிக்கவும்!

# OpenOrienteering::SymbolRenderWidget
source: There are no symbols in clipboard which could be pasted!
ta: கிளிப்போர்டில் எந்த சின்னங்களும் இல்லை, அவை ஒட்டப்படலாம்!

# OpenOrienteering::SymbolRenderWidget
source: Select all objects with this symbol
ta: இந்த சின்னத்துடன் அனைத்து பொருட்களையும் தேர்ந்தெடுக்கவும்

# OpenOrienteering::SymbolRenderWidget
source: Add all objects with this symbol to selection
ta: தேர்வில் இந்த சின்னத்துடன் அனைத்து பொருட்களையும் சேர்க்கவும்

# OpenOrienteering::SymbolRenderWidget
source: Remove all objects with this symbol from selection
ta: தேர்விலிருந்து இந்த சின்னத்துடன் அனைத்து பொருட்களையும் அகற்றவும்

# OpenOrienteering::SymbolRenderWidget
source: Hide objects with this symbol
ta: இந்த சின்னத்துடன் பொருட்களை மறைக்கவும்

# OpenOrienteering::SymbolRenderWidget
source: Protect objects with this symbol
ta: இந்த சின்னத்துடன் பொருட்களைப் பாதுகாக்கவும்

# OpenOrienteering::SymbolRenderWidget
source: Add all objects with selected symbols to selection
ta: தேர்ந்தெடுக்கப்பட்ட சின்னங்களுடன் அனைத்து பொருட்களையும் தேர்வில் சேர்க்கவும்

# OpenOrienteering::SymbolRenderWidget
source: Remove all objects with selected symbols from selection
ta: தேர்விலிருந்து தேர்ந்தெடுக்கப்பட்ட சின்னங்களுடன் அனைத்து பொருட்களையும் அகற்றவும்

# OpenOrienteering::SymbolRenderWidget
source: Hide objects with selected symbols
ta: தேர்ந்தெடுக்கப்பட்ட சின்னங்களுடன் பொருள்களை மறைக்கவும்

# OpenOrienteering::SymbolRenderWidget
source: Protect objects with selected symbols
ta: தேர்ந்தெடுக்கப்பட்ட சின்னங்களுடன் பொருட்களைப் பாதுகாக்கவும்

# OpenOrienteering::SymbolRenderWidget
source: Invert selection
ta: தலைகீழ் தேர்வு

source: F1
ta: எஃப் 1

# OpenOrienteering::SymbolRenderWidget
source: Select all
ta: அனைத்தையும் தெரிவுசெய்

# OpenOrienteering::SymbolRenderWidget
source: Select unused
ta: பயன்படுத்தப்படாததைத் தேர்ந்தெடுக்கவும்

# OpenOrienteering::SymbolRenderWidget
source: Sort symbols
ta: சின்னங்களை வரிசைப்படுத்துங்கள்

# OpenOrienteering::SymbolRenderWidget
source: Sort by number
ta: எண்ணால் வரிசைப்படுத்தவும்

# OpenOrienteering::SymbolRenderWidget
source: Sort by primary color
ta: முதன்மை வண்ணத்தால் வரிசைப்படுத்துங்கள்

# OpenOrienteering::SymbolRenderWidget
source: Sort by primary color priority
ta: முதன்மை வண்ண முன்னுரிமையால் வரிசைப்படுத்தவும்

# OpenOrienteering::SymbolRenderWidget
source: Scale to percentage:
ta: சதவீதத்திற்கு அளவு:

# OpenOrienteering::SymbolRenderWidget
source: Confirmation
ta: உறுதிப்படுத்தல்

# OpenOrienteering::SymbolRenderWidget
source: The map contains objects with the symbol "%1". Deleting it will delete those objects and clear the undo history! Do you really want to do that?
ta: வரைபடத்தில் "%1" குறியீட்டைக் கொண்ட பொருள்கள் உள்ளன. அதை நீக்குவது அந்த பொருட்களை நீக்கி, செயல்தவிர் வரலாற்றை அழிக்கும்! நீங்கள் உண்மையில் அதை செய்ய விரும்புகிறீர்களா?

# OpenOrienteering::SymbolRenderWidget
source: Select all objects with selected symbols
ta: தேர்ந்தெடுக்கப்பட்ட சின்னங்களுடன் அனைத்து பொருட்களையும் தேர்ந்தெடுக்கவும்

# OpenOrienteering::SymbolRenderWidget
source: Switch symbol of selected objects
ta: தேர்ந்தெடுக்கப்பட்ட பொருட்களின் சின்னத்தை மாற்றவும்

# OpenOrienteering::SymbolRenderWidget
source: Fill / Create border for selected objects
ta: தேர்ந்தெடுக்கப்பட்ட பொருள்களுக்கு எல்லையை நிரப்பவும் / உருவாக்கவும்

# OpenOrienteering::SymbolRenderWidget
source: Scale symbols
ta: அளவிலான சின்னங்கள்

# OpenOrienteering::SymbolReplacementDialog
source: Replace symbol set
ta: குறியீட்டு தொகுப்பை மாற்றவும்

# OpenOrienteering::SymbolReplacementDialog
source: Configure how the symbols should be replaced, and which.
ta: சின்னங்கள் எவ்வாறு மாற்றப்பட வேண்டும், எது என்பதை உள்ளமைக்கவும்.

# OpenOrienteering::SymbolReplacementDialog
source: Import all new symbols, even if not used as replacement
ta: மாற்றாக பயன்படுத்தப்படாவிட்டாலும் அனைத்து புதிய சின்னங்களையும் இறக்குமதி செய்க

# OpenOrienteering::SymbolReplacementDialog
source: Delete original symbols which are unused after the replacement
ta: மாற்றத்திற்குப் பிறகு பயன்படுத்தப்படாத அசல் சின்னங்களை நீக்கவும்

# OpenOrienteering::SymbolReplacementDialog
source: Delete unused colors after the replacement
ta: மாற்றப்பட்ட பிறகு பயன்படுத்தப்படாத வண்ணங்களை நீக்கவும்

# OpenOrienteering::SymbolReplacementDialog
source: Symbol mapping:
ta: அடையாளம் மேப்பிங்:

# OpenOrienteering::SymbolReplacementDialog
source: Keep the symbols' hidden / protected states of the old symbol set
ta: பழைய அடையாளம் தொகுப்பின் சின்னங்களின் மறைக்கப்பட்ட / பாதுகாக்கப்பட்ட நிலைகளை வைத்திருங்கள்

# OpenOrienteering::SymbolReplacementDialog
source: Match replacement symbols by symbol number
ta: குறியீட்டு எண் மூலம் மாற்று சின்னங்களை பொருத்தவும்

# OpenOrienteering::SymbolReplacementDialog
source: Original
ta: அசல்

# OpenOrienteering::SymbolReplacementDialog
source: Edit the symbol set ID:
ta: குறியீட்டு தொகுப்பு ஐடியைத் திருத்தவும்:

# OpenOrienteering::SymbolReplacementDialog
source: Replacement
ta: மாற்று

# OpenOrienteering::SymbolReplacementDialog
source: Match by symbol name
ta: குறியீட்டு பெயர் மூலம் பொருந்தவும்

# OpenOrienteering::SymbolReplacementDialog
source: Assign new symbols
ta: புதிய சின்னங்களை ஒதுக்குங்கள்

# OpenOrienteering::SymbolReplacementDialog
source: Pattern
ta: முறை

# OpenOrienteering::SymbolReplacementDialog
source: Clear replacements
ta: தெளிவான மாற்றீடுகள்

# OpenOrienteering::SymbolReplacementDialog
source: Open CRT file...
ta: CRT கோப்பு திறந்த ...

# OpenOrienteering::SymbolReplacementDialog
source: Save CRT file...
ta: CRT கோப்பைச் சேமி ...

# OpenOrienteering::SymbolReplacementDialog
source: Symbol mapping
ta: அடையாளம் மேப்பிங்

# OpenOrienteering::SymbolReplacementDialog
source: CRT file
ta: CRT கோப்பு

# OpenOrienteering::SymbolReplacementDialog
source: There are multiple replacements for symbol %1.
ta: குறியீடு %1 க்கு பல மாற்றீடுகள் உள்ளன.

# OpenOrienteering::SymbolReplacementDialog
source: Cannot open file: %1 %2
ta: கோப்பைத் திறக்க முடியாது: %1 %2

# OpenOrienteering::SymbolReplacementDialog
source: Cannot save file: %1 %2
ta: கோப்பைச் சேமிக்க முடியாது: %1 %2

# OpenOrienteering::SymbolReplacementDialog
source: The cross reference table has been modified. Do you want to save your changes?
ta: குறுக்கு குறிப்பு அட்டவணை மாற்றியமைக்கப்பட்டுள்ளது. உங்கள் மாற்றங்களைச் சேமிக்க விரும்புகிறீர்களா?

# OpenOrienteering::SymbolReplacementDialog
source: - None -
ta: - எதுவுமில்லை -

# OpenOrienteering::SymbolReplacementDialog
source: Choose map file to load symbols from
ta: சின்னங்களை ஏற்ற வரைபடக் கோப்பைத் தேர்வுசெய்க

# OpenOrienteering::SymbolReplacementDialog
source: Error
ta: பிழை

# OpenOrienteering::SymbolReplacementDialog
source: Cannot load symbol set, aborting.
ta: குறியீட்டு தொகுப்பை ஏற்ற முடியாது, கருக்கலைப்பு.

# OpenOrienteering::SymbolReplacementDialog
source: Warning
ta: எச்சரிக்கை

# OpenOrienteering::SymbolReplacementDialog
source: The symbol set import generated warnings.
ta: குறியீட்டு தொகுப்பு இறக்குமதி உருவாக்கப்பட்ட எச்சரிக்கைகளை உருவாக்கியது.

# OpenOrienteering::SymbolReplacementDialog
source: The chosen symbol set has a scale of 1:%1, while the map scale is 1:%2. Do you really want to choose this set?
ta: தேர்ந்தெடுக்கப்பட்ட குறியீட்டு தொகுப்பு 1:%1 அளவைக் கொண்டுள்ளது, அதே நேரத்தில் வரைபட அளவுகோல் 1:%2 ஆகும். இந்த தொகுப்பை நீங்கள் உண்மையில் தேர்வு செய்ய விரும்புகிறீர்களா?

# OpenOrienteering::SymbolSettingDialog
source: Symbol settings
ta: குறியீட்டு அமைப்புகள்

# OpenOrienteering::SymbolSettingDialog
source: Template:
ta: வார்ப்புரு:

# OpenOrienteering::SymbolSettingDialog
source: <b>Template:</b>
ta: <b> வார்ப்புரு: </b>

# OpenOrienteering::SymbolSettingDialog
source: (none)
ta: (எதுவுமில்லை)

# OpenOrienteering::SymbolSettingDialog
source: Open...
ta: திறந்த ...

# OpenOrienteering::SymbolSettingDialog
source: Center template...
ta: மைய வார்ப்புரு ...

# OpenOrienteering::SymbolSettingDialog
source: bounding box on origin
ta: தோற்றம் கொண்ட பெட்டி

# OpenOrienteering::SymbolSettingDialog
source: center of gravity on origin
ta: தோற்றத்தில் ஈர்ப்பு நடுவண்

# OpenOrienteering::SymbolSettingDialog
source: Select background color
ta: பின்னணி நிறத்தைத் தேர்ந்தெடுக்கவும்

# OpenOrienteering::SymbolSettingDialog
source: The quick brown fox takes the routechoice to jump over the lazy dog 1234567890
ta: விரைவான பழுப்பு நரி ரூல் எக்கைச் எடுக்கும் சோம்பேறி நாய் மீது குதிக்க 1234567890

# OpenOrienteering::SymbolSettingDialog
source: - unnamed -
ta: - பெயரிடப்படாத -

# OpenOrienteering::SymbolToolTip
source: No description!
ta: விளக்கம் இல்லை!

# OpenOrienteering::TagSelectWidget
source: Relation
ta: உறவு

# OpenOrienteering::TagSelectWidget
source: Key
ta: விசை

# OpenOrienteering::TagSelectWidget
source: Comparison
ta: ஒப்பீடு

# OpenOrienteering::TagSelectWidget
source: Value
ta: மதிப்பு

# OpenOrienteering::TagSelectWidget
source: Add Row
ta: வரிசையைச் சேர்க்கவும்

# OpenOrienteering::TagSelectWidget
source: Remove Row
ta: வரிசையை அகற்று

# OpenOrienteering::TagSelectWidget
source: Move Up
ta: மேலே செல்லுங்கள்

# OpenOrienteering::TagSelectWidget
source: Move Down
ta: கீழே செல்லுங்கள்

# OpenOrienteering::TagSelectWidget
source: %n object selected
ta: %n பொருள் தேர்ந்தெடுக்கப்பட்டது

# OpenOrienteering::TagSelectWidget
source: Invalid query
ta: தவறான வினவல்

# OpenOrienteering::TagsWidget
source: Key
ta: விசை

# OpenOrienteering::TagsWidget
source: Value
ta: மதிப்பு

# OpenOrienteering::TagsWidget
source: Help
ta: உதவி

# OpenOrienteering::TagsWidget
source: Key exists
ta: விசை உள்ளது

# OpenOrienteering::TagsWidget
source: The key "%1" already exists and must not be used twice.
ta: முக்கிய "%1" ஏற்கனவே உள்ளது மற்றும் இரண்டு முறை பயன்படுத்தக்கூடாது.

# OpenOrienteering::Template
source: Find the moved template file
ta: நகர்த்தப்பட்ட வார்ப்புரு கோப்பைக் கண்டறியவும்

# OpenOrienteering::Template
source: All files (*.*)
ta: எல்லா கோப்புகளும் (*.*)

# OpenOrienteering::Template
source: Error
ta: பிழை

# OpenOrienteering::Template
source: No such file.
ta: அத்தகைய கோப்பு இல்லை.

# OpenOrienteering::Template
source: Is the format of the file correct for this template type?
ta: இந்த வார்ப்புரு வகைக்கு கோப்பின் வடிவம் சரியானதா?

# OpenOrienteering::Template
source: Not enough free memory.
ta: போதுமான இலவச நினைவகம் இல்லை.

# OpenOrienteering::TemplateAdjustActivity
source: Template adjustment
ta: வார்ப்புரு சரிசெய்தல்

# OpenOrienteering::TemplateAdjustActivity
source: Error
ta: பிழை

# OpenOrienteering::TemplateAdjustActivity
source: Failed to calculate adjustment!
ta: சரிசெய்தலைக் கணக்கிடத் தவறிவிட்டது!

# OpenOrienteering::TemplateAdjustAddTool
source: <b>Click</b>: Set the template position of the pass point.
ta: <b> சொடுக்கு </b>: பாச் புள்ளியின் வார்ப்புரு நிலையை அமைக்கவும்.

# OpenOrienteering::TemplateAdjustAddTool
source: <b>Click</b>: Set the map position of the pass point.
ta: <b> சொடுக்கு </b>: பாச் புள்ளியின் வரைபட நிலையை அமைக்கவும்.

# OpenOrienteering::TemplateAdjustDeleteTool
source: <b>Click</b>: Delete pass points.
ta: <b> சொடுக்கு </b>: பாச் புள்ளிகளை நீக்கு.

# OpenOrienteering::TemplateAdjustMoveTool
source: <b>Drag</b>: Move pass points.
ta: <b> இழுத்தல் </b>: பாச் புள்ளிகளை நகர்த்தவும்.

# OpenOrienteering::TemplateAdjustWidget
source: Pass points:
ta: பாச் புள்ளிகள்:

# OpenOrienteering::TemplateAdjustWidget
source: New
ta: புதிய

# OpenOrienteering::TemplateAdjustWidget
source: Move
ta: நகர்த்தவும்

# OpenOrienteering::TemplateAdjustWidget
source: Delete
ta: நீக்கு

# OpenOrienteering::TemplateAdjustWidget
source: Template X
ta: வார்ப்புரு ஃச்

# OpenOrienteering::TemplateAdjustWidget
source: Template Y
ta: வார்ப்புரு மற்றும்

# OpenOrienteering::TemplateAdjustWidget
source: Map X
ta: வரைபடம் ஃச்

# OpenOrienteering::TemplateAdjustWidget
source: Map Y
ta: வரைபடம் ஒய்

# OpenOrienteering::TemplateAdjustWidget
source: Error
ta: பிழை

# OpenOrienteering::TemplateAdjustWidget
source: Apply pass points
ta: பாச் புள்ளிகளைப் பயன்படுத்துங்கள்

# OpenOrienteering::TemplateAdjustWidget
source: Help
ta: உதவி

# OpenOrienteering::TemplateAdjustWidget
source: Apply && clear all
ta: விண்ணப்பிக்கவும் && அனைத்தையும் அழிக்கவும்

# OpenOrienteering::TemplateAdjustWidget
source: Clear all
ta: அனைத்தையும் அழிக்கவும்

# OpenOrienteering::TemplateImage
source: Not enough free memory (image size: %1x%2 pixels)
ta: போதுமான இலவச நினைவகம் இல்லை (பட அளவு: %1x %2 பிக்சல்கள்)

# OpenOrienteering::TemplateImage
source: Georeferencing not found
ta: புவிநூழல் காணப்படவில்லை

# OpenOrienteering::TemplateImage
source: Format not supported
ta: வடிவம் ஆதரிக்கப்படவில்லை

# OpenOrienteering::TemplateImage
source: Select the coordinate reference system of the georeferenced image.
ta: புவிசார் படத்தின் ஒருங்கிணைப்பு குறிப்பு அமைப்பைத் தேர்ந்தெடுக்கவும்.

# OpenOrienteering::TemplateImage
source: Select the coordinate reference system of the coordinates in the world file
ta: உலக கோப்பில் உள்ள ஆயங்களின் ஒருங்கிணைப்பு குறிப்பு முறையைத் தேர்ந்தெடுக்கவும்

# OpenOrienteering::TemplateImageOpenDialog
source: Opening %1
ta: திறந்த %1

# OpenOrienteering::TemplateImageOpenDialog
source: Image size:
ta: பட அளவு:

# OpenOrienteering::TemplateImageOpenDialog
source: Specify how to position or scale the image:
ta: படத்தை எவ்வாறு நிலைநிறுத்துவது அல்லது அளவிடுவது என்பதைக் குறிப்பிடவும்:

# OpenOrienteering::TemplateImageOpenDialog
source: World file
ta: உலக கோப்பு

# OpenOrienteering::TemplateImageOpenDialog
source: GeoTIFF
ta: சியோடிஃப்

# OpenOrienteering::TemplateImageOpenDialog
source: no georeferencing information
ta: புவிசார் செய்தி இல்லை

# OpenOrienteering::TemplateImageOpenDialog
source: Georeferenced (%1)
ta: உலகம் (% 1)

# OpenOrienteering::TemplateImageOpenDialog
source: Meters per pixel:
ta: பிக்சலுக்கு மீட்டர்:

# OpenOrienteering::TemplateImageOpenDialog
source: Scanned with
ta: உடன் ச்கேன் செய்யப்பட்டது

# OpenOrienteering::TemplateImageOpenDialog
source: dpi
ta: டிபிஐ

# OpenOrienteering::TemplateImageOpenDialog
source: Template scale: 1 :
ta: வார்ப்புரு அளவு: 1:

# OpenOrienteering::TemplateImageOpenDialog
source: Cancel
ta: ரத்துசெய்

# OpenOrienteering::TemplateImageOpenDialog
source: Open
ta: திற

# OpenOrienteering::TemplateListWidget
source: Show
ta: காட்டு

# OpenOrienteering::TemplateListWidget
source: Opacity
ta: ஒளிபுகாநிலை

# OpenOrienteering::TemplateListWidget
source: Group
ta: குழு

# OpenOrienteering::TemplateListWidget
source: Filename
ta: கோப்புப்பெயர்

# OpenOrienteering::TemplateListWidget
source: Sketch
ta: ச்கெட்ச்

# OpenOrienteering::TemplateListWidget
source: GPS
ta: உலக இடம் காட்டும் அமைப்பு

# OpenOrienteering::TemplateListWidget
source: Open...
ta: திறந்த ...

# OpenOrienteering::TemplateListWidget
source: Duplicate
ta: நகல்

# OpenOrienteering::TemplateListWidget
source: Add template...
ta: வார்ப்புருவைச் சேர்க்கவும் ...

# OpenOrienteering::TemplateListWidget
source: Remove
ta: அகற்று

# OpenOrienteering::TemplateListWidget
source: Move Up
ta: மேலே செல்லுங்கள்

# OpenOrienteering::TemplateListWidget
source: Move Down
ta: கீழே செல்லுங்கள்

# OpenOrienteering::TemplateListWidget
source: Import and remove
ta: இறக்குமதி செய்து அகற்றவும்

# OpenOrienteering::TemplateListWidget
source: Help
ta: உதவி

# OpenOrienteering::TemplateListWidget
source: Move by hand
ta: கையால் நகர்த்தவும்

# OpenOrienteering::TemplateListWidget
source: Positioning...
ta: பொருத்துதல் ...

# OpenOrienteering::TemplateListWidget
source: Template files
ta: வார்ப்புரு கோப்புகள்

# OpenOrienteering::TemplateListWidget
source: All files
ta: அனைத்து கோப்புகள்

# OpenOrienteering::TemplateListWidget
source: Adjust...
ta: சரிசெய்யவும் ...

# OpenOrienteering::TemplateListWidget
source: Error
ta: பிழை
