Repository: 247i/TACETr
Catalog: உரை/தானி/openrem-read-the-docs-documentation-*.po
Languages: ta

source: If you wish to make changes to a display name or to the user defined modality then you must log in as a user that is in the ``admingroup``. You will then be able to use the ``Display names & modality`` item under the ``Config`` menu:
ta: காட்சி பெயர் அல்லது பயனர் வரையறுக்கப்பட்ட முறைக்கு மாற்றங்களைச் செய்ய நீங்கள் விரும்பினால், நீங்கள் `` அட்மிங்ரூப்`` இல் இருக்கும் பயனராக உள்நுழைய வேண்டும். `` Config`` மெனுவின் கீழ் `` காட்சி பெயர்கள் & முறை`` உருப்படியைப் பயன்படுத்த முடியும்:

source: This will take you to a page where you can view the list of X-ray systems with data in OpenREM. If you wish to change a display name or the user defined modality then click on the corresponding row. The resulting page will allow you to edit these parameters. Click on the ``Update`` button to confirm your changes:
ta: இது உங்களை ஓபன்ரெமில் தரவுகளுடன் எக்ச்ரே அமைப்புகளின் பட்டியலைக் காணக்கூடிய ஒரு பக்கத்திற்கு அழைத்துச் செல்லும். காட்சி பெயர் அல்லது பயனர் வரையறுக்கப்பட்ட முறையை மாற்ற விரும்பினால், தொடர்புடைய வரிசையில் சொடுக்கு செய்க. இதன் விளைவாக வரும் பக்கம் இந்த அளவுருக்களைத் திருத்த உங்களை அனுமதிக்கும். உங்கள் மாற்றங்களை உறுதிப்படுத்த `` UPDATE`` பொத்தானைக் சொடுக்கு செய்க:

source: Update a display name
ta: காட்சி பெயரைப் புதுப்பிக்கவும்

source: Example of the page for updating a display name and user defined modality
ta: காட்சி பெயர் மற்றும் பயனர் வரையறுக்கப்பட்ட முறையை புதுப்பிப்பதற்கான பக்கத்தின் எடுத்துக்காட்டு

source: You can change multiple rows at once. For display names you may wish to do this if a system has a software upgrade, for example, as this will generate a new default display name for studies carried out after the software upgrade has taken place. The studies from these will be grouped together as a single entry on the OpenREM homepage and individual modality pages.
ta: நீங்கள் ஒரே நேரத்தில் பல வரிசைகளை மாற்றலாம். காட்சி பெயர்களுக்கு நீங்கள் இதைச் செய்ய விரும்பலாம், ஒரு கணினியில் மென்பொருள் மேம்படுத்தல் இருந்தால், எடுத்துக்காட்டாக, இது மென்பொருள் மேம்படுத்தல் நடந்த பிறகு மேற்கொள்ளப்பட்ட ஆய்வுகளுக்கு புதிய இயல்புநிலை காட்சி பெயரை உருவாக்கும். இவற்றிலிருந்து வரும் ஆய்வுகள் ஓபன்ரெம் முகப்புப்பக்கம் மற்றும் தனிப்பட்ட முறை பக்கங்களில் ஒற்றை நுழைவாக ஒன்றிணைக்கப்படும்.

source: If you update the user defined modality, the modality type for already imported studies will also be set to the user defined modality type. Only changes from modality DX (planar X-ray) to RF (fluoroscopy) and vice versa are possible.
ta: பயனர் வரையறுக்கப்பட்ட முறையை நீங்கள் புதுப்பித்தால், ஏற்கனவே இறக்குமதி செய்யப்பட்ட ஆய்வுகளுக்கான முறை வகை பயனர் வரையறுக்கப்பட்ட முறை வகையிலும் அமைக்கப்படும். முறை டிஎக்ச் (பிளானர் எக்ச்-ரே) இலிருந்து ஆர்எஃப் (ஃப்ளோரோச்கோபி) மற்றும் நேர்மாறாக மாற்றங்கள் மட்டுமே சாத்தியமாகும்.

source: Dual modality systems
ta: இரட்டை முறை அமைப்புகள்

source: Some systems are dual purpose in that they can be used in both standard planar X-ray mode and in fluoroscopy mode. For these systems you can configure them as 'Dual' and OpenREM will attempt to reprocess all the studies related to the rows you have selected and assign them to DX or RF. The studies will then be displayed in the right sections in the web interface and will export correctly. New RDSRs relating to that X-ray system will be assigned a modality in the same way.
ta: சில அமைப்புகள் இரட்டை நோக்கத்தில் உள்ளன, அவை நிலையான பிளானர் எக்ச்ரே பயன்முறையிலும் ஃப்ளோரோச்கோபி பயன்முறையிலும் பயன்படுத்தப்படலாம். இந்த அமைப்புகளுக்கு நீங்கள் அவற்றை 'இரட்டை' என்று உள்ளமைக்கலாம் மற்றும் ஓபன்ரெம் நீங்கள் தேர்ந்தெடுத்த வரிசைகள் தொடர்பான அனைத்து ஆய்வுகளையும் மீண்டும் செயலாக்க முயற்சிக்கும் மற்றும் அவற்றை டிஎக்ச் அல்லது ஆர்.எஃப். பின்னர் ஆய்வுகள் வலை இடைமுகத்தில் சரியான பிரிவுகளில் காண்பிக்கப்படும் மற்றும் சரியாக ஏற்றுமதி செய்யும். அந்த எக்ச்-ரே அமைப்பு தொடர்பான புதிய ஆர்.டி.எச்.ஆர்கள் அதே வழியில் ஒரு முறையை ஒதுக்கும்.

source: After an X-ray system has been set to Dual you may wish to reprocess the studies to assign modality again. To do this you can use the 'reprocess' link in the 'User defined modality' cell:
ta: ஒரு எக்ச்ரே அமைப்பு இரட்டை என அமைக்கப்பட்ட பிறகு, மீண்டும் முறையை ஒதுக்க ஆய்வுகளை மீண்டும் செயலாக்க விரும்பலாம். இதைச் செய்ய, 'பயனர் வரையறுக்கப்பட்ட முறை' கலத்தில் 'மறு செயலாக்க' இணைப்பைப் பயன்படுத்தலாம்:

source: Reprocess Dual link
ta: மறுசீரமைப்பு இரட்டை இணைப்பு

source: Re-sort studies into planar X-ray and fluoroscopy
ta: பிளானர் எக்ச்ரே மற்றும் ஃப்ளோரோச்கோபியில் ஆய்வுகளை மீண்டும் வரிசைப்படுத்துங்கள்

source: Review of studies that failed to import
ta: இறக்குமதி செய்யத் தவறிய ஆய்வுகளின் ஆய்வு

source: Studies that have failed early in the import process might not have an entry in the ``unique_equipment_name`` table, and therefore will not appear in any of the other tables on this page. The table at the end allows the user to review these studies and delete them. See :ref:`failed_import_studies` for more details.
ta: இறக்குமதி செயல்முறையின் ஆரம்பத்தில் தோல்வியுற்ற ஆய்வுகள் `` `Knical_ecpipment_name`` அட்டவணையில் ஒரு நுழைவு இருக்காது, எனவே இந்த பக்கத்தில் உள்ள வேறு எந்த அட்டவணையிலும் தோன்றாது. முடிவில் உள்ள அட்டவணை பயனரை இந்த ஆய்வுகளை மதிப்பாய்வு செய்து அவற்றை நீக்க அனுமதிக்கிறது. காண்க: குறிப்பு: மேலும் விவரங்களுக்கு `தோல்வியுற்ற_IMPORT_STUDIES`.

source: Systems where Device Observer UID is not static
ta: சாதன பார்வையாளர் UID நிலையானதாக இல்லாத அமைப்புகள்

source: For Docker installations, this setting is in the :doc:`env_variables`.
ta: கப்பல்துறை நிறுவல்களுக்கு, இந்த அமைப்பு: doc: `env_variables`.

source: For Linux installations, see the :ref:`updatelinuxconfig` docs.
ta: லினக்ச் நிறுவலுக்கு, பார்க்க: குறிப்பு: `லினக்ச் கட்டமைப்பைப் புதுப்பிக்கவும்.

source: For Windows installations, see the :ref:`updatewindowsconfig` docs.
ta: சாளரங்கள் நிறுவலுக்கு, இதைக் காண்க: ref: `விண்டோச் கட்டமைப்பைப் புதுப்பிக்கவும்.

source: Exporting study information
ta: ஆய்வு தகவல்களை ஏற்றுமதி செய்தல்

source: Exporting to csv and xlsx sheets
ta: காபிம மற்றும் XLSX தாள்களுக்கு ஏற்றுமதி

source: If you are logged in as a user in the ``exportgroup`` or the ``admingroup``, the export links will be available near the top of the modality filter pages in the OpenREM interface.
ta: `` எக்ச்போர்ட் குழுமம்`` அல்லது `` அட்மிங்ரூப்`` இல் நீங்கள் ஒரு பயனராக உள்நுழைந்தால், ஏற்றுமதி இணைப்புகள் ஓபன்ரெம் இடைமுகத்தில் உள்ள மாதிரி வடிகட்டி பக்கங்களின் மேற்புறத்தில் கிடைக்கும்.

source: For each modality you can export to a single-sheet csv file or a multi-sheet xlsx file. In addition, there is an export tailored to the :ref:`NHSBSP_dose_audit` requirements.
ta: ஒவ்வொரு முறைக்கும் நீங்கள் ஒரு ஒற்றை-தாள் காபிம கோப்பு அல்லது மல்டி-சீட் எக்ச்எல்எச்எக்ச் கோப்பிற்கு ஏற்றுமதி செய்யலாம். கூடுதலாக, ஒரு ஏற்றுமதி உள்ளது: ref: `nhsbsp_dose_audit` தேவைகள்.

source: If you are logged in as a user in the ``pidgroup`` you will also have a choice of exporting with patient name and/or patient ID information included in the export (if any is recorded in the database). See :doc:`patientid` for more details.
ta: `` PIDGroup`` இல் நீங்கள் ஒரு பயனராக உள்நுழைந்துள்ளால், நோயாளியின் பெயர் மற்றும்/அல்லது ஏற்றுமதியில் சேர்க்கப்பட்டுள்ள நோயாளி ஐடி தகவலுடன் ஏற்றுமதி செய்வதற்கான தேர்வும் உங்களுக்கு இருக்கும் (தரவுத்தளத்தில் ஏதேனும் பதிவு செய்யப்பட்டால்). காண்க: டாக்: `நோயாளி ஐடி` மேலும் விவரங்களுக்கு.

source: The xlsx export has multiple sheets. The first sheet contains a summary of all the study descriptions, requested procedures and series protocol names contained in the export:
ta: எக்ச்எல்எச்எக்ச் ஏற்றுமதியில் பல தாள்கள் உள்ளன. முதல் தாளில் அனைத்து ஆய்வு விளக்கங்கள், கோரப்பட்ட நடைமுறைகள் மற்றும் ஏற்றுமதியில் உள்ள தொடர் நெறிமுறை பெயர்களின் சுருக்கம் உள்ளது:

source: CT export front sheet
ta: CT ஏற்றுமதி முன் தாள்

source: This information is useful for seeing what data is in the spreadsheet, and can also be used to prioritise which studies or protocols to analyse based on frequency.
ta: விரிதாளில் என்ன தரவு உள்ளது என்பதைப் பார்க்க இந்த செய்தி பயனுள்ளதாக இருக்கும், மேலும் அதிர்வெண்ணின் அடிப்படையில் எந்த ஆய்வுகள் அல்லது நெறிமுறைகள் பகுப்பாய்வு செய்ய வேண்டும் என்பதற்கு முன்னுரிமை அளிக்க பயன்படுத்தலாம்.

source: The second sheet of the exported file lists all the studies, with each study taking one line and each series in the study displayed in the columns to the right.
ta: ஏற்றுமதி செய்யப்பட்ட கோப்பின் இரண்டாவது தாள் அனைத்து ஆய்வுகளையும் பட்டியலிடுகிறது, ஒவ்வொரு ஆய்வும் ஒரு வரியையும், ஆய்வில் ஒவ்வொரு தொடரும் வலதுபுறம் நெடுவரிசைகளில் காட்டப்படும்.

source: CT export all data sheet
ta: CT அனைத்து தரவு தாளையும் ஏற்றுமதி செய்யுங்கள்

source: The remainder of the file has one sheet per series protocol name. Each series is listed one per line. If a single study has more than one series with the same protocol name, then the same study will appear on more than one line.
ta: கோப்பின் மீதமுள்ள ஒரு தொடர் நெறிமுறை பெயருக்கு ஒரு தாள் உள்ளது. ஒவ்வொரு தொடரும் ஒரு வரிக்கு ஒன்று பட்டியலிடப்பட்டுள்ளது. ஒரு ஆய்வில் ஒரே நெறிமுறை பெயருடன் ஒன்றுக்கு மேற்பட்ட தொடர்கள் இருந்தால், அதே ஆய்வு ஒன்றுக்கு மேற்பட்ட வரிகளில் தோன்றும்.

source: Fluoroscopy exports
ta: ஃப்ளோரோச்கோபி ஏற்றுமதி

source: Fluoroscopy csv exports only report study level information — this includes summary dose information for fluoroscopy exposures and acquisition exposures, but not information about individual exposures.
ta: ஃப்ளோரோச்கோபி சி.எச்.வி ஏற்றுமதி ஆய்வு ஆய்வு நிலை தகவல்களை மட்டுமே தெரிவிக்கிறது - இதில் ஃப்ளோரோச்கோபி வெளிப்பாடுகள் மற்றும் கையகப்படுத்தல் வெளிப்பாடுகளுக்கான சுருக்கமான டோச் தகவல்கள் அடங்கும், ஆனால் தனிப்பட்ட வெளிப்பாடுகள் பற்றிய தகவல்கள் அல்ல.

source: Fluoroscopy xlsx exports contain the following sheets:
ta: ஃப்ளோரோச்கோபி எக்ச்எல்எச்எக்ச் ஏற்றுமதியில் பின்வரும் தாள்கள் உள்ளன:

source: Summary sheet
ta: சுருக்கம் தாள்

source: All data sheet with groups of exposures
ta: வெளிப்பாடுகளின் குழுக்களுடன் அனைத்து தரவு தாளும்

source: One sheet per acquisition protocol with one row per exposure including all the details of that exposure.
ta: அந்த வெளிப்பாட்டின் அனைத்து விவரங்களும் உட்பட ஒரு வெளிப்பாட்டிற்கு ஒரு வரிசையுடன் கையகப்படுத்தல் நெறிமுறைக்கு ஒரு தாள்.

source: Exposures are considered similar and put in the same group if they are, relative to the first exposure of a group:
ta: வெளிப்பாடுகள் ஒத்ததாகக் கருதப்படுகின்றன, அவை ஒரு குழுவின் முதல் வெளிப்பாட்டுடன் ஒப்பிடும்போது ஒரே குழுவில் வைக்கப்படுகின்றன:

source: same plane (for bi-plane systems)
ta: அதே வானூர்தி (இரு விமான அமைப்புகளுக்கு)

source: same protocol
ta: அதே நெறிமுறை

source: same field size (mag, not collimation)
ta: அதே புல அளவு (மேக், மோதல் அல்ல)

source: same pulse rate
ta: அதே துடிப்பு வீதம்

source: same filter material and thickness
ta: அதே வடிகட்டி பொருள் மற்றும் தடிமன்

source: within 5° in both directions (primary and secondary)
ta: இரு திசைகளிலும் 5 பெறுநர் க்குள் (முதன்மை மற்றும் இரண்டாம் நிலை)

source: of the same 'event type' (Fluoroscopy, Stationary Acquisition, Stepping Acquisition, Rotational Acquisition)
ta: அதே 'நிகழ்வு வகை' (ஃப்ளோரோச்கோபி, நிலையான கையகப்படுத்தல், படி கையகப்படுத்தல், சுழற்சி கையகப்படுத்தல்)

source: The minimum, maximum and mean of all the remaining factors are presented for each group along with the common factors. Where a factor is not available in the source RDSR, that factor is not considered.
ta: ஒவ்வொரு குழுவிற்கும் பொதுவான காரணிகளுடன் மீதமுள்ள அனைத்து காரணிகளுக்கும் குறைந்தபட்ச, அதிகபட்சம் மற்றும் சராசரி வழங்கப்படுகின்றன. மூல RDSR இல் ஒரு காரணி கிடைக்காத இடத்தில், அந்த காரணி கருதப்படவில்லை.

source: The grouping process for the all data sheet takes a lot of time compared to the other exports. However, we hope that this is a useful way of comprehending the study. Other modalities have all the series for any one study detailed in full on one long row — this is not possible when one study might have 400 exposures!
ta: அனைத்து தரவுத் தாளுக்கும் குழு செயல்முறை மற்ற ஏற்றுமதியுடன் ஒப்பிடும்போது நிறைய நேரம் எடுக்கும். இருப்பினும், இது ஆய்வைப் புரிந்துகொள்வதற்கான ஒரு பயனுள்ள வழியாகும் என்று நாங்கள் நம்புகிறோம். மற்ற முறைகள் எந்தவொரு ஆய்விற்கும் அனைத்து தொடர்களையும் ஒரு நீண்ட வரிசையில் முழுமையாக விவரிக்கின்றன - ஒரு ஆய்வில் 400 வெளிப்பாடுகள் இருக்கும்போது இது சாத்தியமில்லை!

source: The majority of systems report kV, mA and pulse width information as a mean value per exposure. Some systems report this information on a per pulse basis instead. In this circumstance, in the web interface you will see the list of pulses, but in the export the mean value (after excluding any zero values) is calculated first and this value is then used.
ta: பெரும்பாலான அமைப்புகள் கே.வி, எம்.ஏ மற்றும் துடிப்பு அகல தகவல்களை ஒரு வெளிப்பாட்டிற்கு சராசரி மதிப்பாக தெரிவிக்கின்றன. சில அமைப்புகள் இந்த தகவலை ஒரு துடிப்பு அடிப்படையில் ஒரு துடிப்பு அடிப்படையில் தெரிவிக்கின்றன. இந்த சூழ்நிலையில், வலை இடைமுகத்தில் நீங்கள் பருப்பு வகைகளின் பட்டியலைக் காண்பீர்கள், ஆனால் ஏற்றுமதியில் சராசரி மதிப்பு (எந்த சுழிய மதிப்புகளைத் தவிர்த்த பிறகு) முதலில் கணக்கிடப்படுகிறது, பின்னர் இந்த மதிப்பு பயன்படுத்தப்படுகிறது.

source: Nuclear medicine exports
ta: அணு மருத்துவ ஏற்றுமதி

source: Nuclear medicine does not have a concept like different irradiation events. Therefore in contrast to the other modalities it the summary dose information does not show protocols, and the excel export has individual sheets per study description instead of per protocol names.
ta: அணு மருத்துவத்தில் வெவ்வேறு கதிர்வீச்சு நிகழ்வுகள் போன்ற ஒரு கருத்து இல்லை. எனவே மற்ற முறைகளுக்கு மாறாக இது சுருக்கமான டோச் செய்தி நெறிமுறைகளைக் காட்டாது, மேலும் எக்செல் ஏற்றுமதியில் ஒரு நெறிமுறை பெயர்களுக்கு பதிலாக ஒரு ஆய்வு விளக்கத்திற்கு தனிப்பட்ட தாள்கள் உள்ளன.

source: Exports page
ta: ஏற்றுமதி பக்கம்

source: Clicking the link for an export redirects you to the Exports page, which you can also get to using the link at the top right of the navigation bar:
ta: ஏற்றுமதிக்கான இணைப்பைக் சொடுக்கு செய்வது உங்களை ஏற்றுமதி பக்கத்திற்கு திருப்பி விடுகிறது, இது வழிசெலுத்தல் பட்டியின் மேல் வலதுபுறத்தில் உள்ள இணைப்பைப் பயன்படுத்தலாம்:

source: Exports list
ta: ஏற்றுமதி பட்டியல்

source: Whilst an export is being processed, it will be listed in the first table at the top. The current status is displayed to indicate export progress, and is updated every two seconds. You can stop an export early by using the abort button; you will not be able to download anything in this instance.
ta: ஏற்றுமதி செயலாக்கப்படுகையில், அது மேலே உள்ள முதல் அட்டவணையில் பட்டியலிடப்படும். ஏற்றுமதி முன்னேற்றத்தைக் குறிக்க தற்போதைய நிலை காட்டப்படும், மேலும் ஒவ்வொரு இரண்டு விநாடிகளிலும் புதுப்பிக்கப்படுகிறது. கருக்கலைப்பு பொத்தானைப் பயன்படுத்தி நீங்கள் ஒரு ஏற்றுமதியை ஆரம்பத்தில் நிறுத்தலாம்; இந்த நிகழ்வில் நீங்கள் எதையும் பதிவிறக்கம் செய்ய முடியாது.

source: Once a study is complete a new table of recently completed exams is created and you will be able to download the file.
ta: ஒரு ஆய்வு முடிந்ததும் அண்மைக் காலத்தில் நிறைவு செய்யப்பட்ட தேர்வுகளின் புதிய அட்டவணை உருவாக்கப்பட்டது, மேலும் நீங்கள் கோப்பைப் பதிவிறக்க முடியும்.

source: When the export is no longer needed, it can be deleted from the server by ticking the delete checkbox and clicking the delete button at the bottom:
ta: ஏற்றுமதி இனி தேவைப்படாதபோது, ​​நீக்குதல் தேர்வுப்பெட்டியைத் தட்டுவதன் மூலமும், கீழே உள்ள நீக்கு பொத்தானைக் சொடுக்கு செய்வதன் மூலமும் அதை சேவையகத்திலிருந்து நீக்கலாம்:

source: Deleting exports
ta: ஏற்றுமதியை நீக்குதல்

source: Specific modality export information
ta: குறிப்பிட்ட முறை ஏற்றுமதி செய்தி

source: NHSBSP dose audits
ta: NHSBSP டோச் தணிக்கைகள்

source: This export is specific to the UK NHS Breast Screening Programme and generates the source data in the format required for the dose audit database developed by the National Co-ordinating Centre for the Physics of Mammography.
ta: இந்த ஏற்றுமதி யுகே என்எச்எச் மார்பக ச்கிரீனிங் திட்டத்திற்கு குறிப்பிட்டது மற்றும் மேமோகிராஃபி இயற்பியலுக்கான தேசிய ஒருங்கிணைப்பு மையத்தால் உருவாக்கப்பட்ட டோச் தணிக்கை தரவுத்தளத்திற்கு தேவையான வடிவத்தில் மூல தரவை உருவாக்குகிறது.

source: It has been modified to clean up the data to remove exposures that are unlikely to be wanted in the submitted data, such as exposures with any of the following in the protocol name::
ta: சமர்ப்பிக்கப்பட்ட தரவுகளில் விரும்பாத வெளிப்பாடுகளை அகற்ற தரவை தூய்மை செய்வது மாற்றியமைக்கப்பட்டுள்ளது, அதாவது நெறிமுறை பெயரில் பின்வருவனவற்றில் ஏதேனும் வெளிப்பாடுகள் போன்றவை ::

source: The view codes have been modified to match the NCCPM convention, i.e. medio-lateral oblique is recorded as ``OB`` instead of ``MLO``. The other codes are mapped to the `ACR MQCM 1999 Equivalent code.`_
ta: NCCPM மாநாட்டுடன் பொருந்தக்கூடிய பார்வைக் குறியீடுகள் மாற்றியமைக்கப்பட்டுள்ளன, அதாவது `` mlo`` என்பதற்கு பதிலாக `` OB`` என மீடியோ-பக்கவாட்டு சாய்வாக பதிவு செய்யப்பட்டுள்ளது. மற்ற குறியீடுகள் `ACR MQCM 1999 சமமான குறியீட்டில் வரைபடமாக்கப்பட்டுள்ளன .`_

source: Each patient is numbered from starting from 1. Each view for any one patient has a unique view code, so if a second cranio-caudal exposure is made to the left breast the view codes will be LCC and LCC2.
ta: ஒவ்வொரு நோயாளியும் 1 முதல் தொடங்கப்படுவதிலிருந்து எண்ணப்படுகிறது. எந்தவொரு நோயாளிக்கும் ஒவ்வொரு பார்வைக்கும் ஒரு தனித்துவமான பார்வைக் குறியீடு உள்ளது, எனவே இடது மார்பகத்திற்கு இரண்டாவது கிரானியோ-க ud டல் வெளிப்பாடு செய்யப்பட்டால், பார்வை குறியீடுகள் எல்.சி.சி மற்றும் எல்.சி.சி 2 ஆக இருக்கும்.

source: The survey number is left as 1. This needs to be modified as appropriate. The easiest way to do this in Excel is to change the first two or three rows, select those cells that have been changed, then double click on the bottom-right corner of the selection box to copy-down the value to all the remaining cells below.
ta: கணக்கெடுப்பு எண் 1 ஆக விடப்பட்டுள்ளது. இது பொருத்தமானதாக மாற்றப்பட வேண்டும். எக்செல் இல் இதைச் செய்வதற்கான எளிதான வழி முதல் இரண்டு அல்லது மூன்று வரிசைகளை மாற்றுவது, மாற்றப்பட்ட அந்த கலங்களைத் தேர்ந்தெடுத்து, மீதமுள்ள அனைத்து கலங்களுக்கும் மதிப்பை நகலெடுக்க தேர்வு பெட்டியின் கீழ்-வலது மூலையில் இருமுறை சொடுக்கு செய்க கீழே.

source: The data can then be copied and pasted into the NCCPM database.
ta: தரவை பின்னர் நகலெடுத்து NCCPM தரவுத்தளத்தில் ஒட்டலாம்.

source: If there are a mixture of 2D and tomography exposures, providing you can separate them by virtue of the filter used, then you should further prepare the data as follows:
ta: 2 டி மற்றும் டோமோகிராஃபி வெளிப்பாடுகளின் கலவை இருந்தால், பயன்படுத்தப்பட்ட வடிப்பானின் மூலம் அவற்றை பிரிக்க முடியும், பின்னர் தரவை மேலும் பின்வருமாறு தயாரிக்க வேண்டும்:

source: Copy the sheet to a new sheet
ta: தாளை புதிய தாளில் நகலெடுக்கவும்

source: In the first sheet, filter for the target and filter combination used for used for the tomographic exposures and delete those rows.
ta: முதல் தாளில், டொமோகிராஃபிக் வெளிப்பாடுகளுக்குப் பயன்படுத்தப்படும் இலக்கு மற்றும் வடிகட்டி கலவையை வடிகட்டி அந்த வரிசைகளை நீக்கவும்.

source: In the second sheet, filter for the target and filter combinations used for 2D exposures and delete those rows.
ta: இரண்டாவது தாளில், 2 டி வெளிப்பாடுகளுக்குப் பயன்படுத்தப்படும் இலக்கு மற்றும் வடிகட்டி சேர்க்கைகளை வடிகட்டி அந்த வரிசைகளை நீக்கவும்.

source: Change the survey number on the 2D sheet and the the survey number on the tomographic sheet as appropriate, with the tomographic survey number bing one more than the 2D survey number.
ta: 2 டி தாளில் கணக்கெடுப்பு எண்ணையும், டோமோகிராஃபிக் தாளில் உள்ள கணக்கெடுப்பு எண்ணையும் பொருத்தமானதாக மாற்றவும், டோமோகிராஃபிக் சர்வே எண் பிங் 2 டி கணக்கெடுப்பு எண்ணை விட அதிகமாக உள்ளது.

source: Where patients have had both 2D and tomographic exposures in the same study, NCCPM will be able to match them up as they will have the same patient number in both surveys.
ta: ஒரே ஆய்வில் நோயாளிகள் 2 டி மற்றும் டோமோகிராஃபிக் வெளிப்பாடுகளைக் கொண்டிருந்தால், என்.சி.சி.பி.எம் இரண்டு கணக்கெடுப்புகளிலும் ஒரே நோயாளி எண்ணைக் கொண்டிருப்பதால் அவற்றைப் பொருத்த முடியும்.

source: PHE 2019 CT survey and IPEM/PHE 2019 paediatric CT survey
ta: PHE 2019 CT கணக்கெடுப்பு மற்றும் IPEM/PHE 2019 குழந்தை CT கணக்கெடுப்பு

source: This export is specific to the UK Public Health England (PHE) CT dose survey and exports the data in the correct format to copy and paste into the spreadsheet provided by PHE. More information about the survey and copies of the data collection spreadsheet can be found on the `CT User Group (CTUG) website`_. The same export function is also suitable for the UK Paediatric CT Dose Survey launched by the IPEM paediatric optimisation working party in collaboration with PHE. The spreadsheet and instructions for this survey can also be found on the CTUG website.
ta: இந்த ஏற்றுமதி இங்கிலாந்து பொது சுகாதார இங்கிலாந்து (PHE) CT டோச் கணக்கெடுப்புக்கு குறிப்பிட்டது மற்றும் PHE வழங்கிய விரிதாளில் நகலெடுத்து ஒட்டுவதற்கு தரவை சரியான வடிவத்தில் ஏற்றுமதி செய்கிறது. தரவு சேகரிப்பு விரிதாளின் கணக்கெடுப்பு மற்றும் நகல்கள் பற்றிய கூடுதல் தகவல்களை `CT பயனர் குழு (CTUG) வலைத்தளம்`_ இல் காணலாம். அதே ஏற்றுமதி செயல்பாடு, PHE உடன் இணைந்து ஐபிஎம் குழந்தை உகப்பாக்கம் பணிக்குழுவால் தொடங்கப்பட்ட இங்கிலாந்து குழந்தை சி.டி டோச் கணக்கெடுப்புக்கும் ஏற்றது. இந்த கணக்கெடுப்புக்கான விரிதாள் மற்றும் வழிமுறைகளையும் CTUG வலைத்தளத்திலும் காணலாம்.

source: The introduction and guidance tabs of the PHE data collection spreadsheet should be read and the 'Your details' sheet completed. Then the 'Patient and Protocol data 1' sheet should be copied and renamed appropriately for each protocol and scanner combination that you will be submitting. The first 142 rows of each sheet should be filled in manually with all the details for that protocol, though looking at study data in OpenREM may help to answer some of the questions.
ta: PHE தரவு சேகரிப்பு விரிதாளின் அறிமுகம் மற்றும் வழிகாட்டுதல் தாவல்கள் படிக்க வேண்டும் மற்றும் 'உங்கள் விவரங்கள்' தாள் முடிந்தது. நீங்கள் சமர்ப்பிக்கும் ஒவ்வொரு நெறிமுறை மற்றும் ச்கேனர் கலவைக்கும் 'நோயாளி மற்றும் நெறிமுறை தரவு 1' தாளை நகலெடுத்து சரியான முறையில் மறுபெயரிட வேண்டும். ஒவ்வொரு தாளின் முதல் 142 வரிசைகள் அந்த நெறிமுறைக்கான அனைத்து விவரங்களையும் கைமுறையாக நிரப்ப வேண்டும், இருப்பினும் ஓபன்ரெமில் ஆய்வுத் தரவைப் பார்ப்பது சில கேள்விகளுக்கு பதிலளிக்க உதவும்.

source: The CT studies should then be filtered in OpenREM; by date (ideally previous 12 months, no older than 2017), by scanner (each scanner and protocol combination should be a new sheet), by age of (minimum of 16 for the PHE adult survey), and by study description (or combination of factors to specify a particular protocol).
ta: சி.டி ஆய்வுகள் பின்னர் ஓபன்ரெமில் வடிகட்டப்பட வேண்டும்; தேதியின்படி (முந்தைய 12 மாதங்கள், 2017 ஐ விட பழையது அல்ல), ச்கேனர் மூலம் (ஒவ்வொரு ச்கேனர் மற்றும் நெறிமுறை சேர்க்கை ஒரு புதிய தாளாக இருக்க வேண்டும்), வயதிற்குள் (PHE அகவை வந்தோருக்கான கணக்கெடுப்புக்கு குறைந்தபட்சம் 16), மற்றும் ஆய்வு விளக்கத்தின் மூலம் (அல்லது சேர்க்கை ஒரு குறிப்பிட்ட நெறிமுறையைக் குறிப்பிடுவதற்கான காரணிகள்).

source: Finally the studies should be filtered to have exactly the right number of each type of acquisition for that protocol. This might be one spiral, one localiser and two stationary (bolus tracking) acquisitions for example. Localisers do not appear in the export so are less important to specify, but more localisers than usual might indicate a deviation from the standard protocol.
ta: இறுதியாக அந்த நெறிமுறைக்கான ஒவ்வொரு வகை கையகப்படுத்துதலுக்கும் சரியான எண்ணிக்கையை வைத்திருக்க ஆய்வுகள் வடிகட்டப்பட வேண்டும். இது ஒரு சுழல், ஒரு உள்ளக மற்றும் இரண்டு நிலையான (போலச் டிராக்கிங்) கையகப்படுத்துதல்களாக இருக்கலாம். ஏற்றுமதியில் உள்ளூராக்கிகள் தோன்றவில்லை, எனவே குறிப்பிடுவது குறைவான முக்கியத்துவம் வாய்ந்தது, ஆனால் வழக்கத்தை விட அதிகமான உள்ளூர்மயர்கள் நிலையான நெறிமுறையிலிருந்து விலகலைக் குறிக்கலாம்.
