Repository: 247i/TACETr
Catalog: உரை/தானி/opentracks-app-store-metadata-files-*.po
Languages: ta

# short_description.txt:1
source: A sport tracker buddy that respects your privacy.
ta: உங்கள் தனியுரிமையை மதிக்கும் விளையாட்டு டிராக்கர் நண்பர்.

# full_description.txt:1
source: A sport tracking buddy that respects your privacy. Sport and outdoor activities grants happiness, skill and confidence. Value your health by keeping track on your training. Records as you go running or walking, and gives you a bike computer with a bigger screen for cycling. Mark interesting locations along your way with pictures. Keep recorded statistics in great detail for analysis. Share only the data you want others to have. * Voice announcements. * Supports Bluetooth LE sensors: heart rate, speed and distance (cycling), cadence (cycling), and power meter (cycling). * Altitude gain and loss: via barometric sensor. * Altitude shown in EGM2008 (above mean sea level); exported as WGS84. * Export data as tracks either as KMZ (incl. photos), KML, or GPX. * No Internet access or extra permissions. * Dark and light theme, respecting system settings. * No ads. Libre software / Free Software / Open Source meaning you can use, study, change and share the source code. Licensed Apache 2.0
ta: உங்கள் தனியுரிமையை மதிக்கும் விளையாட்டு கண்காணிப்பு நண்பர். விளையாட்டு மற்றும் வெளிப்புற நடவடிக்கைகள் மகிழ்ச்சி, திறமை மற்றும் நம்பிக்கையை அளிக்கின்றன. உங்கள் பயிற்சியைக் கண்காணிப்பதன் மூலம் உங்கள் ஆரோக்கியத்தை மதிப்பிடுங்கள். நீங்கள் இயங்கும்போது அல்லது நடைபயிற்சி செய்யும்போது பதிவுகள், மற்றும் சைக்கிள் ஓட்டுதலுக்கான பெரிய திரை கொண்ட பைக் கணினியை உங்களுக்கு வழங்குகிறது. படங்களுடன் உங்கள் வழியில் சுவையான இடங்களைக் குறிக்கவும். பகுப்பாய்விற்கு பதிவுசெய்யப்பட்ட புள்ளிவிவரங்களை மிக விரிவாக வைத்திருங்கள். மற்றவர்கள் வைத்திருக்க விரும்பும் தரவை மட்டும் பகிரவும். * குரல் அறிவிப்புகள். * ஊடலை லே சென்சார்களை ஆதரிக்கிறது: இதய துடிப்பு, விரைவு மற்றும் தூரம் (சைக்கிள் ஓட்டுதல்), கேடென்ச் (சைக்கிள் ஓட்டுதல்) மற்றும் பவர் மீட்டர் (சைக்கிள் ஓட்டுதல்). * உயர ஆதாயம் மற்றும் இழப்பு: பாரோமெட்ரிக் சென்சார் வழியாக. * EGM2008 இல் காட்டப்பட்டுள்ள உயரம் (சராசரி கடல் மட்டத்திற்கு மேலே); WGS84 ஆக ஏற்றுமதி செய்யப்பட்டது. * தரவை KMZ (உள்ளிட்ட புகைப்படங்கள்), KML அல்லது GPX என தடங்களாக ஏற்றுமதி செய்யுங்கள். * இணைய அணுகல் அல்லது கூடுதல் அனுமதிகள் இல்லை. * இருண்ட மற்றும் ஒளி கருப்பொருள், கணினி அமைப்புகளை மதிக்கிறது. * விளம்பரங்கள் இல்லை. லிப்ரே மென்பொருள் / இலவச மென்பொருள் / திறந்த மூல மூலக் குறியீட்டை நீங்கள் பயன்படுத்தலாம், படிக்கலாம், மாற்றலாம் மற்றும் பகிரலாம். உரிமம் பெற்ற அப்பாச்சி 2.0

# changelogs/2916.txt:1
source: v3.0.0: OpenTracks First release of OpenTracks (i.e., hard fork from MyTracks) Changes: - Rebranded from MyTracks to OpenTracks - Added Bluetooth LE heart rate sensor - Removed all features requiring Internet access - Removed Google Maps integration - Removed use of Google Play services - Removed ANT+ sensors - Removed Bluetooth classic sensors - Removed Protobuf - Removed calorie estimation and activity estimation - Removed MyTracks Service API (i.e., no integration with other apps)
ta: v3.0.0: Opentracks ஓபன்ட்ராக்சின் முதல் வெளியீடு (அதாவது, மைட்ராக்சிலிருந்து ஆர்ட் ஃபோர்க்) மாற்றங்கள்: - மைட்ராக்சிலிருந்து ஓபன்ட்ராக்சுக்கு மறுபெயரிடப்பட்டது - ஊடலை லு இதய துடிப்பு சென்சார் சேர்க்கப்பட்டது - இணைய அணுகல் தேவைப்படும் அனைத்து அம்சங்களையும் அகற்றியது - Google வரைபட ஒருங்கிணைப்பை அகற்றியது - Google Play சேவைகளின் பயன்பாடு அகற்றப்பட்டது - அகற்றப்பட்ட எறும்பு+ சென்சார்கள் - அகற்றப்பட்ட ஊடலை கிளாசிக் சென்சார்கள் - புரோட்டோபுஃப் அகற்றப்பட்டது - கலோரி மதிப்பீடு மற்றும் செயல்பாட்டு மதிப்பீடு அகற்றப்பட்டது - அகற்றப்பட்ட MyTracks பணி பநிஇ (அதாவது, பிற பயன்பாடுகளுடன் ஒருங்கிணைப்பு இல்லை)

# changelogs/2947.txt:1
source: v3.0.1: OpenTracks Changes: - Share markers - Restructured settings - Removed actionbar back button - Export: removed photo size settings option - Export: KML as format is now selectable Bugfixes: - export directory is now /OpenTracks/ - landscape mode is not crashing - fixed KML/KMZ export Developer: - Test are executable (but many failing) - Enabled continuous integration with TravisCI (no tests)
ta: v3.0.1: Opentracks மாற்றங்கள்: - பகிர்வு குறிப்பான்கள் - மறுசீரமைக்கப்பட்ட அமைப்புகள் - அகற்றப்பட்ட அதிரடி பேக் பின் பொத்தான் - ஏற்றுமதி: அகற்றப்பட்ட புகைப்பட அளவு அமைப்புகள் விருப்பம் - ஏற்றுமதி: KML வடிவமாக இப்போது தேர்ந்தெடுக்கப்படுகிறது பிழைத்திருத்தங்கள்: - ஏற்றுமதி அடைவு இப்போது /ஓபன்ட்ராக்ச் / - இயற்கை முறை செயலிழக்கவில்லை - நிலையான KML/KMZ ஏற்றுமதி டெவலப்பர்: - சோதனை இயங்கக்கூடியது (ஆனால் பல தோல்வியுற்றன) - டிராவிசியுடன் தொடர்ச்சியான ஒருங்கிணைப்பு (சோதனைகள் இல்லை)

# changelogs/2991.txt:1
source: v3.1.0: OpenTracks Changes: - Added show track in map apps (tested with OsmAnd and Maps.ME) - Added while tracking, show track statistics without unlocking the device - Removed landscape mode for track detail view (was buggy) - Removed search suggestions history Bugfix: - Request storage permission for import all/export all Developer: - Upgrade to Gradle 5.6 - Do not minify release builds
ta: v3.1.0: Opentracks மாற்றங்கள்: - வரைபட பயன்பாடுகளில் சோ டிராக் சேர்க்கப்பட்டது (osmand மற்றும் maps.me உடன் சோதிக்கப்பட்டது) - கண்காணிக்கும் போது சேர்க்கப்பட்டது, சாதனத்தைத் திறக்காமல் தட புள்ளிவிவரங்களைக் காட்டு - டிராக் விவரம் பார்வைக்கு அகற்றப்பட்ட இயற்கை பயன்முறை (தரமற்றது) - தேடல் பரிந்துரைகள் வரலாறு பிழைத்திருத்த: - அனைத்தையும் இறக்குமதி செய்ய/ஏற்றுமதி செய்ய சேமிப்பக இசைவு கோருங்கள் டெவலப்பர்: - கிரேடில் 5.6 க்கு மேம்படுத்தவும் - வெளியீட்டு கட்டடங்களைக் குறைக்க வேண்டாம்

# changelogs/3054.txt:1
source: v3.2.0: OpenTracks Changes: - Removed Widget - Introduced material design icons - Removed snowboarding and skiing (need new icons) Bugfix: - Fixed search functionality Developer: - Fixed (some) test cases - Removed unused parcelable functionality - Major cleanup and reformatting - Do not use broadcast for app to widget communication - stats_content.xml does not include other files
ta: v3.2.0: OpenTracks Changes: - Removed Widget - Introduced material design icons - Removed snowboarding and skiing (need புதிய icons) Bugfix: - Fixed தேடல் functionality Developer: - Fixed (some) தேர்வு cases - Removed unused parcelable functionality - Major cleanup and reformatting - Do not use broadcast க்கு பயன்பாடு பெறுநர் widget communication - stats_content.xml does not include மற்றொன்று கோப்புகள்

# changelogs/3063.txt:1
source: v3.2.1: OpenTracks Changes: - Settings are now on a single page Developer: - Settings moved to Androidx compat (uses fragments)
ta: v3.2.1: Opentracks மாற்றங்கள்: - அமைப்புகள் இப்போது ஒரு பக்கத்தில் உள்ளன டெவலப்பர்: - அமைப்புகள் Androidx compat க்கு மாற்றப்பட்டன (துண்டுகளைப் பயன்படுத்துகின்றன)

# changelogs/3079.txt:1
source: v3.2.2: OpenTracks Changes: - Removed aggregated stats - Migrated to Material Design Bugfix: - Fixed export of sensor data - Fixed import of incomplete sensor data Developer: - Replaced actionbar with toolbar - Migrated to androidx appcompat (incl. Material Design)
ta: v3.2.2: Opentracks மாற்றங்கள்: - திரட்டப்பட்ட புள்ளிவிவரங்கள் அகற்றப்பட்டன - பொருள் வடிவமைப்பிற்கு இடம்பெயர்ந்தது பிழைத்திருத்த: - சென்சார் தரவின் நிலையான ஏற்றுமதி - முழுமையற்ற சென்சார் தரவின் நிலையான இறக்குமதி டெவலப்பர்: - கருவிப்பட்டியுடன் அதிரடி பட்டையை மாற்றியது - Androidx AppCompat க்கு இடம்பெயர்ந்தது (பொருள் வடிவமைப்பு)

# changelogs/3101.txt:1
source: v3.2.3: OpenTracks Changes: - Sharing: use Android Sharesheet - Sharing: share multiple tracks as individual files - Use Android ShareSheet - Heart rate sensor (Bluetooth LE): automatic reconnect Bugfix: - Heart rate sensor (Bluetooth LE): disconnect properly - Heart rate wasn't always shown while recording Developer: - Enabled TravisCI instrumentation tests
ta: v3.2.3: Opentracks மாற்றங்கள்: - பகிர்வு: ஆண்ட்ராய்டு ShareSheet ஐப் பயன்படுத்தவும் - பகிர்வு: பல தடங்களை தனிப்பட்ட கோப்புகளாகப் பகிரவும் - ஆண்ட்ராய்டு ShareSheet ஐப் பயன்படுத்தவும் - இதய துடிப்பு சென்சார் (புளூடூத் எல்.இ): தானியங்கி மீண்டும் இணைக்கவும் பிழைத்திருத்த: - இதய துடிப்பு சென்சார் (புளூடூத் லே): சரியாக துண்டிக்கவும் - பதிவு செய்யும் போது இதய துடிப்பு எப்போதும் காட்டப்படவில்லை டெவலப்பர்: - டிராவிசி இன்ச்ட்ரூமென்டேசன் சோதனைகள் இயக்கப்பட்டவை

# changelogs/3103.txt:1
source: v3.2.4: OpenTracks Bugfix: - Settings activity crashes Removed possibility to change voice/split frequency from the context menu
ta: v3.2.4: Opentracks பிழைத்திருத்த: - அமைப்புகள் செயல்பாடு செயலிழக்கிறது சூழல் மெனுவிலிருந்து குரல்/பிளவு அதிர்வெண்ணை மாற்றுவதற்கான சாத்தியம் நீக்கப்பட்டது

# changelogs/3123.txt:1
source: v3.2.5: OpenTracks Changes: - Disable activity change - Add permission for Android 10: recording location data Bugfix: - Fix reset settings Developer: - Preferences - if Settings cannot be loaded reset all preferences - moved access to preferences to PreferencesUtil - moved default of preferences from code to xml - use SummaryProvider
ta: v3.2.5: Opentracks மாற்றங்கள்: - செயல்பாட்டு மாற்றத்தை முடக்கு - ஆண்ட்ராய்டு 10 க்கு இசைவு சேர்க்கவும்: இருப்பிட தரவைப் பதிவு செய்தல் பிழைத்திருத்த: - அமைப்புகளை மீட்டமை சரிசெய்யவும் டெவலப்பர்: - விருப்பத்தேர்வுகள் - அமைப்புகளை ஏற்ற முடியாவிட்டால் எல்லா விருப்பங்களையும் மீட்டமைக்கவும் - விருப்பத்தேர்வுகளுக்கான அணுகலை விருப்பத்தேர்வுகளுக்கு நகர்த்தியது - குறியீட்டிலிருந்து எக்ச்எம்எல்லுக்கு விருப்பங்களின் இயல்புநிலையை நகர்த்தியது - சுருக்கம் முன்னேற்றத்தைப் பயன்படுத்தவும்

# changelogs/3137.txt:1
source: v3.2.6: OpenTracks Changes: - Heart rate monitor: scan for available devices - Remove shortcut to Bluetooth settings Developer: - Preferences: moved default of preferences from code to xml
ta: v3.2.6: Opentracks மாற்றங்கள்: - இதய துடிப்பு மானிட்டர்: கிடைக்கக்கூடிய சாதனங்களுக்கான ச்கேன் - ப்ளூடூத் அமைப்புகளுக்கு குறுக்குவழியை அகற்றவும் டெவலப்பர்: - விருப்பத்தேர்வுகள்: குறியீட்டிலிருந்து எக்ச்எம்எல் -க்கு விருப்பங்களின் இயல்புநிலை நகர்த்தப்பட்டது

# changelogs/3149.txt:1
source: v3.2.7: OpenTracks Changes: - Notification show GPS accuracy - Show heads-up notification if GPS accuracy drops beyond threshold - Always show chart by time as well as by distance - Added help (in Settings) Bugfix: - TrackDetailActivity: disabled non-working landscape mode (temporary)
ta: v3.2.7: Opentracks மாற்றங்கள்: - அறிவிப்பு சி.பி.எச் துல்லியத்தைக் காட்டுகிறது - சி.பி.எச் துல்லியம் வாசலுக்கு அப்பால் குறைந்துவிட்டால் எட்-அப் அறிவிப்பைக் காட்டு - எப்போதும் நேரத்திலும் தூரத்திலிருந்தும் விளக்கப்படத்தைக் காட்டுங்கள் - உதவி சேர்க்கப்பட்டது (அமைப்புகளில்) பிழைத்திருத்த: - ட்ராக் டெய்லாக்டிவிட்டி: முடக்கப்பட்ட வேலை செய்யாத இயற்கை முறை (தற்காலிக)

# changelogs/3162.txt:1
source: v3.2.8: OpenTracks Changes: - Chart: zoom via gestures Bugfixes: - Export via KMZ did not export picture filenames correctly - Sharing multiple tracks did not include KMZ files - MarkerDetailActivity's UI was not shown - Settings crashed if preference of heart rate was not initialized
ta: v3.2.8: Opentracks மாற்றங்கள்: - விளக்கப்படம்: சைகைகள் வழியாக பெரிதாக்கு பிழைத்திருத்தங்கள்: - KMZ வழியாக ஏற்றுமதி படம் கோப்பு பெயர்களை சரியாக ஏற்றுமதி செய்யவில்லை - பல தடங்களைப் பகிர்வதில் KMZ கோப்புகள் இல்லை - MarkerDetailactivity இன் இடைமுகம் காட்டப்படவில்லை - இதயத் துடிப்பின் விருப்பம் துவக்கப்படாவிட்டால் அமைப்புகள் செயலிழந்தன

# changelogs/3175.txt:1
source: v3.2.9: OpenTracks Changes: - Option to keep screen on while recording - Markers: removed split markers completely - Voice announcement now work without READ_PHONE_STATE permission Bugfixes: - Statistics: heart rate was not shown - Statistics: time was briefly reset to 0s
ta: v3.2.9: Opentracks மாற்றங்கள்: - பதிவு செய்யும் போது திரையை வைத்திருக்க விருப்பம் - குறிப்பான்கள்: பிளவு குறிப்பான்களை முழுவதுமாக அகற்றியது - குரல் அறிவிப்பு இப்போது read_phone_state அனுமதியின்றி வேலை செய்கிறது பிழைத்திருத்தங்கள்: - புள்ளிவிவரங்கள்: இதய துடிப்பு காட்டப்படவில்லை - புள்ளிவிவரங்கள்: நேரம் சுருக்கமாக 0S க்கு மீட்டமைக்கப்பட்டது

# changelogs/3195.txt:1
source: v3.2.10: OpenTracks Changes: - ChartView is not configurable anymore - After reboot: removed automatic restart of an unfinished recording Bugfix: - Speech announcements use MAY_DUCK (again) - ChartView shows markers (again) - Fixed landscape recordingLayout of TrackListActivity - Request legacy file API behavior (necessary for Android 10)
ta: v3.2.10: Opentracks மாற்றங்கள்: - சார்ட் வியூ இனி கட்டமைக்கப்படவில்லை - மறுதொடக்கத்திற்குப் பிறகு: முடிக்கப்படாத பதிவின் தானியங்கி மறுதொடக்கம் அகற்றப்பட்டது பிழைத்திருத்த: - பேச்சு அறிவிப்புகள் மே_டக் (மீண்டும்) பயன்படுத்தவும் - சார்ட்ட்வியூ குறிப்பான்களைக் காட்டுகிறது (மீண்டும்) - டிராக்லிச்டாக்டிவிட்டியின் நிலையான லேண்ட்ச்கேப் ரெக்கார்டிங் லேஅவுட் - கோரிக்கை மரபு கோப்பு பநிஇ நடத்தை (Android 10 க்கு அவசியம்)

# changelogs/3213.txt:1
source: v3.2.11: OpenTracks Bug: - Max speed is identical to avg speed Bugfix: - Crash on heart rate sensor selection Developer: - Replaced TabHost by TabsLayout - Removed special first waypoint - Removed duplicate translations
ta: v3.2.11: Opentracks பிழை: - அதிகபட்ச விரைவு சராசரி வேகத்திற்கு ஒத்ததாகும் பிழைத்திருத்த: - இதய துடிப்பு சென்சார் தேர்வில் செயலிழப்பு டெவலப்பர்: - Replaced TabHost by TabsLayout - சிறப்பு முதல் வழிப்பாதையை அகற்றியது - அகற்றப்பட்ட நகல் மொழிபெயர்ப்புகள்

# changelogs/3243.txt:1
source: v3.3.0: OpenTracks Breaking changes: - Pictures are now stored in app-private storage (do not show up other picture apps) NOTE: Pictures taking with previous version cannot be shown - Localization for Spanish (Latin America) only works on Android 7.0 or later Changes: - Import/Export via Storage Access Framework (avoids READ/WRITE_EXTERNAL_STORAGE permission) Developer: - Cleaned internal data structures - Use separate icons/app names for debug version
ta: v3.3.0: Opentracks மாற்றங்களை உடைத்தல்: - படங்கள் இப்போது பயன்பாட்டு-தனியார் சேமிப்பகத்தில் சேமிக்கப்பட்டுள்ளன (பிற பட பயன்பாடுகளைக் காட்ட வேண்டாம்) குறிப்பு: முந்தைய பதிப்பைக் கொண்டு எடுக்கும் படங்களை காட்ட முடியாது - ச்பானிச் (லத்தீன் அமெரிக்கா) க்கான உள்ளூர்மயமாக்கல் ஆண்ட்ராய்டு 7.0 அல்லது அதற்குப் பிறகு மட்டுமே வேலை செய்கிறது மாற்றங்கள்: . டெவலப்பர்: - தூய்மை செய்யப்பட்ட உள் தரவு கட்டமைப்புகள் - பிழைத்திருத்த பதிப்பிற்கு தனி சின்னங்கள்/பயன்பாட்டு பெயர்களைப் பயன்படுத்தவும்

# changelogs/3251.txt:1
source: v3.3.1: OpenTracks Changes: - Android 10: on uninstall allow to keep app data - Introduced Dashboard API: map icon can be used to open current track in external app (requires installation of another app like OSMDashboard) Bugfix: - App label was broken (introduced in v3.3.0) Developer: - Documentation for Dashboard API can be found in README_DEVELOPER.md
ta: v3.3.1: Opentracks மாற்றங்கள்: - ஆண்ட்ராய்டு 10: பயன்பாட்டின் தரவை வைத்திருக்க நிறுவல் நீக்க அனுமதிக்கவும் - அறிமுகப்படுத்தப்பட்ட டாச்போர்டு ஏபிஐ: வெளிப்புற பயன்பாட்டில் தற்போதைய தடத்தைத் திறக்க வரைபட படவுரு பயன்படுத்தப்படலாம் (ஓஎச்எம்டாச்போர்டு போன்ற மற்றொரு பயன்பாட்டை நிறுவ வேண்டும்) பிழைத்திருத்த: - பயன்பாட்டு சிட்டை உடைக்கப்பட்டது (V3.3.0 இல் அறிமுகப்படுத்தப்பட்டது) டெவலப்பர்: - டாச்போர்டு ஏபிஐக்கான ஆவணங்களை ReadMe_developer.md இல் காணலாம்

# changelogs/3272.txt:1
source: v3.3.2: OpenTracks Changes: - Export: overwrites files now Bugfix: - Always remove recording notification Developer: - On API 26+ java.time is used for parsing and writing dates - Refactoring of TrackRecordingService
ta: v3.3.2: Opentracks மாற்றங்கள்: - ஏற்றுமதி: கோப்புகளை இப்போது மேலெழுதும் பிழைத்திருத்த: - பதிவு அறிவிப்பை எப்போதும் அகற்றவும் டெவலப்பர்: . - ட்ராக் ரெக்கார்டிங் சர்வீசின் மறுசீரமைப்பு

# changelogs/3287.txt:1
source: v3.4.0: OpenTracks Changes: - Dashboard API: multiple tracks - Updated help Bugfix: - Fixed crash on fragment re-creation - When paused: prevent stopping app Developer: - Enable testing via CI (Github Actions and TravisCI)
ta: v3.4.0: Opentracks மாற்றங்கள்: - டாச்போர்டு ஏபிஐ: பல தடங்கள் - புதுப்பிக்கப்பட்ட உதவி பிழைத்திருத்த: - துண்டு மறு உருவாக்கம் குறித்த நிலையான விபத்து - இடைநிறுத்தப்படும்போது: பயன்பாட்டை நிறுத்துவதைத் தடுக்கவும் டெவலப்பர்: - தொஒ வழியாக சோதனையை இயக்கவும் (கிதுப் செயல்கள் மற்றும் டிராவிசி)

# changelogs/3305.txt:1
source: v3.5.0: OpenTracks Changes: - Marker: select pictures from gallery - Marker: share picture - Use track name as filename when sharing - Removed elevation min/max (was imprecise) Bugfix: - Charts use preferred units and rate Developer: - Database: remove unused columns - Database: add indices
ta: v3.5.0: Opentracks மாற்றங்கள்: - மார்க்கர்: கேலரியிலிருந்து படங்களைத் தேர்ந்தெடுக்கவும் - மார்க்கர்: படத்தைப் பகிரவும் - பகிரும் போது டிராக் பெயரை கோப்பு பெயராகப் பயன்படுத்தவும் - அகற்றப்பட்ட உயர்வு நிமிடம்/அதிகபட்சம் (துல்லியமற்றது) பிழைத்திருத்த: - விளக்கப்படங்கள் விருப்பமான அலகுகள் மற்றும் வீதத்தைப் பயன்படுத்துகின்றன டெவலப்பர்: - தரவுத்தளம்: பயன்படுத்தப்படாத நெடுவரிசைகளை அகற்று - தரவுத்தளம்: குறியீடுகளைச் சேர்க்கவும்

# changelogs/3330.txt:1
source: v3.6.0: OpenTracks Changes: - Stopped tracks can now be resumed Bugfix: - Import of KMZ did not process the photo URL correctly Developer: - Simplified data processing
ta: v3.6.0: Opentracks மாற்றங்கள்: - நிறுத்தப்பட்ட தடங்களை இப்போது மீண்டும் தொடங்கலாம் பிழைத்திருத்த: - KMZ இன் இறக்குமதி புகைப்பட முகவரி ஐ சரியாக செயலாக்கவில்லை டெவலப்பர்: - எளிமைப்படுத்தப்பட்ட தரவு செயலாக்கம்

# changelogs/3333.txt:1
source: v3.6.1: OpenTracks Bugfix: - KMZ import: store correct picture path
ta: v3.6.1: Opentracks பிழைத்திருத்த: - KMZ இறக்குமதி: சரியான பட பாதையை சேமிக்கவும்

# changelogs/3335.txt:1
source: v3.6.2: OpenTracks Bugfix: - Charts were not shown correctly (introduced in v3.6.0)
ta: v3.6.2: Opentracks பிழைத்திருத்த: - விளக்கப்படங்கள் சரியாகக் காட்டப்படவில்லை (V3.6.0 இல் அறிமுகப்படுத்தப்பட்டது)

# changelogs/3369.txt:1
source: v3.7.0: OpenTracks Changes: - Report speed/pace by activity type - Added workaround for GPS week rollover - (Experimental) Support for Bluetooth LE cycling sensors (cadence and speed) - KMZ/KML import enhanced Bugfix: - KMZ import: only import used images Developer: - Refactored TrackRecordingService
ta: v3.7.0: Opentracks மாற்றங்கள்: - செயல்பாட்டு வகை மூலம் வேகம்/வேகத்தைப் புகாரளிக்கவும் - சி.பி.எச் வீக் ரோல்ஓவருக்கான பணித்தொகுப்பு சேர்க்கப்பட்டது - (சோதனை) ஊடலை லே சைக்கிள் ஓட்டுதல் சென்சார்களுக்கான உதவி (கேடென்ச் மற்றும் வேகம்) - KMZ/KML இறக்குமதி மேம்படுத்தப்பட்டது பிழைத்திருத்த: - KMZ இறக்குமதி: பயன்படுத்தப்பட்ட படங்களை மட்டுமே இறக்குமதி செய்கிறது டெவலப்பர்: - மறுசீரமைக்கப்பட்ட டிராக் ரெக்கார்டிங் பணி

# changelogs/3372.txt:1
source: v3.7.1: OpenTracks Workaround: - Hide start GPS button Bugfix: - Fixed null pointer
ta: v3.7.1: Opentracks பணித்தொகுப்பு: - தொடக்க சி.பி.எச் பொத்தானை மறைக்கவும் பிழைத்திருத்த: - நிலையான சுழிய சுட்டிக்காட்டி

# changelogs/3381.txt:1
source: v3.7.2: OpenTracks Bugfix: - Re-added start GPS button - Track name is not overwritten at the end of a recording - Markers: removing a photo also deletes the file
ta: v3.7.2: Opentracks பிழைத்திருத்த: - மீண்டும் கூட்டப்பட்ட தொடக்க சி.பி.எச் பொத்தானை - ஒரு பதிவின் முடிவில் ட்ராக் பெயர் மேலெழுதப்படவில்லை - குறிப்பான்கள்: புகைப்படத்தை அகற்றுவதும் கோப்பை நீக்குகிறது

# changelogs/3386.txt:1
source: v3.7.3: OpenTracks Bugfix: - Fixed computation of cadence and speed (via Bluetooth LE sensor) Developer: - Removed unused translations
ta: v3.7.3: Opentracks பிழைத்திருத்த: - காடென்ச் மற்றும் வேகத்தின் நிலையான கணக்கீடு (புளூடூத் லெ சென்சார் வழியாக) டெவலப்பர்: - பயன்படுத்தப்படாத மொழிபெயர்ப்புகளை அகற்றியது

# changelogs/3396.txt:1
source: v3.7.4: OpenTracks Changes: - Sharing/export format configurable Bugfix: - Wheel diameter not stored correctly (for speed sensor) - Help: links are clickable Developer: - Split TrackDetailActivity - StatsFragement successor uses ConstraintLayout
ta: v3.7.4: Opentracks மாற்றங்கள்: - பகிர்வு/ஏற்றுமதி வடிவம் உள்ளமைக்கக்கூடியது பிழைத்திருத்த: - சக்கர விட்டம் சரியாக சேமிக்கப்படவில்லை (வேக சென்சாருக்கு) - உதவி: இணைப்புகள் சொடுக்கு செய்யக்கூடியவை டெவலப்பர்: - டிராக் டெய்லாக்டிவிட்டி பிளவு - StatsFragement successor uses ConstraintLayout

# changelogs/3427.txt:1
source: v3.7.5: OpenTracks Changes: - Added aggregated statistics summary (from main the screen's menu) - Dashboard API: pass "show on lock screen"- and "keep screen on"-setting - Updated translations - Import: be lenient with ISO8601 date format - Show track on map: file format can be selected and opening dashboard works on Android R (API 30+) Bugfix: - App icon now correctly implemented
ta: v3.7.5: Opentracks மாற்றங்கள்: - ஒருங்கிணைந்த புள்ளிவிவர சுருக்கம் சேர்க்கப்பட்டது (பிரதான திரையின் மெனுவிலிருந்து) - டாச்போர்டு ஏபிஐ: பாச் "பூட்டுத் திரையில் காட்டு"- மற்றும் "திரையை வைத்திருங்கள்" - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் - இறக்குமதி: ISO8601 தேதி வடிவத்துடன் மென்மையாக இருங்கள் . பிழைத்திருத்த: - பயன்பாட்டு படவுரு இப்போது சரியாக செயல்படுத்தப்பட்டுள்ளது

# changelogs/3449.txt:1
source: v3.7.6: OpenTracks Changes: - Landscape mode - Track deletion UI is now only a spinner - Speed is exported and imported (GPX/KML/KMZ) - Default export format is KMZ incl. all data and pictures Developer: - Replaced AsyncTasks with Threads - Synchronization: UUID is generated per track (not yet exported)
ta: v3.7.6: Opentracks மாற்றங்கள்: - இயற்கை முறை - ட்ராக் நீக்குதல் இடைமுகம் இப்போது ஒரு சுழற்பந்து வீச்சாளர் மட்டுமே - விரைவு ஏற்றுமதி செய்யப்பட்டு இறக்குமதி செய்யப்படுகிறது (gpx/kml/kmz) - இயல்புநிலை ஏற்றுமதி வடிவம் KMZ incl. அனைத்து தரவு மற்றும் படங்கள் டெவலப்பர்: - நூல்களுடன் ஒத்திசைவுகளை மாற்றியது - ஒத்திசைவு: ஒரு பாதையில் UUID உருவாக்கப்படுகிறது (இன்னும் ஏற்றுமதி செய்யப்படவில்லை)

# changelogs/3466.txt:1
source: v3.8.0: OpenTracks Breaking change: - GPX import/export speed, cadence, and heartrate via TrackPointExtension/v2 Changes: - Dashboard API: provide access to markers (incl. callback to show in OpenTracks) - New marker icon (orange push pin, SVG) - Files to import can be selected via file manager Bugfixes: - Aggregated stats UI respects preferred rate - Editing a marker failed on orientation change Developer: - Refactored TrackRecordingService
ta: v3.8.0: Opentracks மாற்றத்தை உடைத்தல்: - சிபிஎக்ச் இறக்குமதி/ஏற்றுமதி விரைவு, கேடென்ச் மற்றும் ஆர்ட்ரேட் டிராக் பாயிண்ட் எக்ச்டென்சன்/வி 2 வழியாக மாற்றங்கள்: - டாச்போர்டு ஏபிஐ: குறிப்பான்களுக்கான அணுகலை வழங்குதல் (ஓபன்ட்ராக்சில் காண்பிக்க திரும்பப்பெறுதல்) - புதிய மார்க்கர் படவுரு (ஆரஞ்சு புச் முள், எச்.வி.சி) - இறக்குமதிக்கான கோப்புகளை கோப்பு மேலாளர் வழியாக தேர்ந்தெடுக்கலாம் பிழைத்திருத்தங்கள்: - ஒருங்கிணைந்த புள்ளிவிவரங்கள் இடைமுகம் விருப்பமான விகிதத்தை மதிக்கிறது - ஒரு குறிப்பானைத் திருத்துவது நோக்குநிலை மாற்றத்தில் தோல்வியடைந்தது டெவலப்பர்: - மறுசீரமைக்கப்பட்ட டிராக் ரெக்கார்டிங் பணி

# changelogs/3474.txt:1
source: v3.8.1: OpenTracks Changes: - While recording: add option for fullscreen - Dashboard is started on the same task Bugfixes: - Intent filters for importing files were far too optimistic
ta: v3.8.1: Opentracks மாற்றங்கள்: - பதிவு செய்யும் போது: முழுத் திரையில் விருப்பத்தைச் சேர்க்கவும் - டாச்போர்டு அதே பணியில் தொடங்கப்படுகிறது பிழைத்திருத்தங்கள்: - கோப்புகளை இறக்குமதி செய்வதற்கான நோக்கம் வடிப்பான்கள் மிகவும் நம்பிக்கையுடன் இருந்தன

# changelogs/3522.txt:1
source: v3.9.0: OpenTracks Changes: - Export tracks with their UUID - Prevent import of already existing tracks by UUID (configurable; default yes) - Pause/stop button now require long press - GPS pre-start shows status of fix - Added new activity icons - Speed sensor: wheelsize now configurable in millimeter Bugfixes: - Fixed some rare crashes (NPE) - Pace formatting corrected - App icon in launcher repositioned
ta: v3.9.0: Opentracks மாற்றங்கள்: - தடங்களை அவற்றின் UUID உடன் ஏற்றுமதி செய்யுங்கள் - UUID ஆல் ஏற்கனவே இருக்கும் தடங்களை இறக்குமதி செய்வதைத் தடுக்கவும் (கட்டமைக்கக்கூடியது; இயல்புநிலை ஆம்) - இடைநிறுத்தம்/நிறுத்தம் பொத்தானை இப்போது நீண்ட அழுத்தவும் - சி.பி.எச் முன் தொடக்கமானது பிழைத்திருத்தத்தின் நிலையைக் காட்டுகிறது - புதிய செயல்பாட்டு சின்னங்களைச் சேர்த்தது - வேக சென்சார்: வீல்ச் இப்போது மில்லிமீட்டரில் கட்டமைக்கக்கூடியது பிழைத்திருத்தங்கள்: - சில அரிய விபத்துக்கள் (NPE) சரி செய்யப்பட்டது - வேக வடிவமைப்பு சரி செய்யப்பட்டது - துவக்கத்தில் பயன்பாட்டு படவுரு இடமாற்றம் செய்யப்பட்டது
