Repository: 247i/TACETr
Catalog: உரை/தானி/opentracks-app-store-metadata-files-*.po
Languages: ta

# changelogs/3530.txt:1
source: v3.9.1: OpenTracks Bugfixes: - GPS pre-start shows status of fix
ta: v3.9.1: Opentracks பிழைத்திருத்தங்கள்: - சி.பி.எச் முன் தொடக்கமானது பிழைத்திருத்தத்தின் நிலையைக் காட்டுகிறது

# changelogs/3541.txt:1
source: v3.9.2: OpenTracks Bugfixes: - Fixed force close on API<25 (due to an animation) - Reset recording state (on app startup) if crashed while recording
ta: v3.9.2: Opentracks பிழைத்திருத்தங்கள்: - பநிஇ <25 இல் நிலையான படை மூடு (அனிமேசன் காரணமாக) - பதிவு செய்யும் போது செயலிழந்தால் பதிவுசெய்யும் நிலையை மீட்டமை (பயன்பாட்டு தொடக்கத்தில்)

# changelogs/3544.txt:1
source: v3.9.3: OpenTracks Bugfixes: - Fixed export all tracks bug.
ta: v3.9.3: Opentracks பிழைத்திருத்தங்கள்: - நிலையான ஏற்றுமதி அனைத்து தடங்கள் பிழை.

# changelogs/3573.txt:1
source: v3.9.4: OpenTracks Changes: - Added interval computation - Voice announcements present last interval statistics - Settings: Bluetooth icon is animated Bugfix: - GPS was not turned off when stopping a recording - Show on map via KML/KMZ/GPX was broken due to refactoring
ta: v3.9.4: Opentracks மாற்றங்கள்: - இடைவெளி கணக்கீடு சேர்க்கப்பட்டது - குரல் அறிவிப்புகள் கடைசி இடைவெளி புள்ளிவிவரங்களை வழங்குகின்றன - அமைப்புகள்: ஊடலை படவுரு அனிமேசன் செய்யப்பட்டுள்ளது பிழைத்திருத்த: - ஒரு பதிவை நிறுத்தும்போது சி.பி.எச் அணைக்கப்படவில்லை - KML/KMZ/GPX வழியாக வரைபடத்தில் காண்பி மறுசீரமைப்பு காரணமாக உடைக்கப்பட்டது

# changelogs/3584.txt:1
source: v3.9.5: OpenTracks Changes: - UI shows speed only with one fractional digit Bugfix: - App crash in search (due to Track.Id refactoring) - Track list did now show if a recording was ongoing (due to Track.Id refactoring)
ta: v3.9.5: Opentracks மாற்றங்கள்: - இடைமுகம் ஒரு பகுதியளவு இலக்கத்துடன் மட்டுமே வேகத்தைக் காட்டுகிறது பிழைத்திருத்த: - தேடலில் பயன்பாட்டு செயலிழப்பு (ட்ராக்.ஐடி மறுசீரமைப்பு காரணமாக) - ட்ராக் பட்டியல் இப்போது ஒரு பதிவு நடந்து கொண்டிருக்கிறதா என்பதைக் காட்டியது (ட்ராக்.ஐடி மறுசீரமைப்பு காரணமாக)

# changelogs/3611.txt:1
source: v3.10.0: OpenTracks Changes: - Elevation gain via barometer - Add splash screen - Android 11/F-Droid: downgrade to targetSDK 29 (v1 signature) see https://gitlab.com/fdroid/fdroidserver/-/issues/827 Bugfix: - Several fixes due to trackId refactoring
ta: v3.10.0: Opentracks மாற்றங்கள்: - காற்றழுத்தமானி வழியாக உயர்வு ஆதாயம் - ச்பிளாச் திரை சேர்க்கவும் . https://gitlab.com/fdroid/fdroidserver/-/issues/827 ஐப் பார்க்கவும் பிழைத்திருத்த: - டிராக்கிட் மறுசீரமைப்பு காரணமாக பல திருத்தங்கள்

# changelogs/3656.txt:1
source: v3.11.0: OpenTracks Changes: - Theming: day/night mode (default: night) - Theming: use Material Design instead of custom element theming - Use targetSDK 30 again (F-Droid signs now with V2) Bugfix: - Android 11: export all crashed - TrackDetail not updated in UI after data was changed by user
ta: v3.11.0: Opentracks மாற்றங்கள்: - தீமிங்: பகல்/இரவு முறை (இயல்புநிலை: இரவு) - தீமிங்: தனிப்பயன் உறுப்பு கருப்பொருளுக்கு பதிலாக பொருள் வடிவமைப்பைப் பயன்படுத்துங்கள் . பிழைத்திருத்த: - ஆண்ட்ராய்டு 11: ஏற்றுமதி அனைத்தும் செயலிழந்தன - பயனரால் தரவு மாற்றப்பட்ட பிறகு இடைமுகம் இல் ட்ராக் டெயில் புதுப்பிக்கப்படவில்லை

# changelogs/3661.txt:1
source: v3.11.1: OpenTracks Bugfix: - Voice announcements reported wrong statistics
ta: v3.11.1: Opentracks பிழைத்திருத்த: - குரல் அறிவிப்புகள் தவறான புள்ளிவிவரங்களை அறிவித்தன

# changelogs/3704.txt:1
source: v3.12.0: OpenTracks Changes: - Bluetooth sensor addresses - Intervals: show elevation gain - Export: default export directory - Export: automatic export after finishing a track - Manual import/export: new user interface - Manual export: option to overwrite on manual export Faster: - Track lists loading - Deleting multiple tracks Bugfix: - Fixed intent filters for import - KMZ could not be parsed - Export: fix crash on Android 11 Developer: - Use ViewBindings - Database enforces foreign key and uses cascading deletes
ta: v3.12.0: ஓபன்ட்ராக்ச் மாற்றங்கள்: - ஊடலை சென்சார் முகவரிகள் - இடைவெளிகள்: உயர ஆதாயத்தைக் காட்டு - ஏற்றுமதி: இயல்புநிலை ஏற்றுமதி அடைவு - ஏற்றுமதி: ஒரு பாதையை முடித்தபிறகு தானியங்கி ஏற்றுமதி - கையேடு இறக்குமதி/ஏற்றுமதி: புதிய பயனர் இடைமுகம் - கையேடு ஏற்றுமதி: கையேடு ஏற்றுமதியில் மேலெழுத விருப்பம் வேகமாக: - டிராக் பட்டியல்கள் ஏற்றுதல் - பல தடங்களை நீக்குகிறது பிழைத்திருத்த: - இறக்குமதிக்கான நிலையான நோக்கம் வடிப்பான்கள் - KMZ ஐ பாகுபடுத்த முடியவில்லை - ஏற்றுமதி: ஆண்ட்ராய்டு 11 இல் செயலிழப்பை சரிசெய்யவும் டெவலப்பர்: - வியூ பிண்டிங்சைப் பயன்படுத்துங்கள் - தரவுத்தளம் வெளிநாட்டு விசையைச் செயல்படுத்துகிறது மற்றும் அடுக்கு நீக்குதல்களைப் பயன்படுத்துகிறது

# changelogs/3732.txt:1
source: v3.13.0: OpenTracks Changes: - Sensor: support for powermeter (BLE) - Search by track and marker (in lists) - Combined search removed Bugfix: - Import crashed in UI - Images of markers were not imported
ta: v3.13.0: Opentracks மாற்றங்கள்: - சென்சார்: பவர்மீட்டருக்கான உதவி (பி.எல்.இ) - டிராக் மற்றும் மார்க்கர் மூலம் தேடுங்கள் (பட்டியல்களில்) - ஒருங்கிணைந்த தேடல் அகற்றப்பட்டது பிழைத்திருத்த: - இடைமுகம் இல் இறக்குமதி செயலிழந்தது - குறிப்பான்களின் படங்கள் இறக்குமதி செய்யப்படவில்லை

# changelogs/3737.txt:1
source: v3.13.1: OpenTracks Bugfix: - Crash on record start: minify/shrink removed a drawable - Automatic export failed silently (mainly remote destinations)
ta: v3.13.1: Opentracks பிழைத்திருத்த: - பதிவு தொடக்கத்தில் செயலிழப்பு: குறைத்தல்/சுருக்கம் ஒரு வரையக்கூடியது - தானியங்கி ஏற்றுமதி அமைதியாக தோல்வியடைந்தது (முக்கியமாக தொலைநிலை இடங்கள்)

# changelogs/3740.txt:1
source: v3.13.2: OpenTracks Bugfix: - Crash in landscape mode
ta: v3.13.2: ஓபன்ட்ராக்ச் பிழைத்திருத்த: - இயற்கை பயன்முறையில் செயலிழப்பு

# changelogs/3761.txt:1
source: v3.14.0: OpenTracks Changes: - Properly support for right-to-left - Import: faster cleanup after import failure - Text in charts scales according to Android settings - Heart rate: support for Huami devices (requires Gadgetbridge) Developer: - Import is now handled in-memory
ta: v3.14.0: Opentracks மாற்றங்கள்: -வலதுபுறம் இடதுபுறத்திற்கு சரியாக உதவி - இறக்குமதி: இறக்குமதி தோல்விக்குப் பிறகு வேகமாக தூய்மை - ஆண்ட்ராய்டு அமைப்புகளின்படி விளக்கப்படம் அளவீடுகளில் உரை - இதய துடிப்பு: உவாமி சாதனங்களுக்கான உதவி (கேசெட் பிரிட்ச் தேவை) டெவலப்பர்: - இறக்குமதி இப்போது நினைவகத்தில் கையாளப்படுகிறது

# changelogs/3799.txt:1
source: v3.14.1: OpenTracks Changes: - Added elevation loss (via barometer) - Updated translations (cz, gl, it, nb, pl, pt, sp) - Markers can be shared from list - Actionbar icon (top left) to go back - Bugfix: - Potential crash on import Developer: - Implemented basic EspressoUI test - Reference resourceIds via if rather than switch/case
ta: v3.14.1: ஓபன்ட்ராக்ச் மாற்றங்கள்: - உயர இழப்பு சேர்க்கப்பட்டது (காற்றழுத்தமானி வழியாக) - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் (CZ, GL, IT, NB, PL, PT, SP) - குறிப்பான்கள் பட்டியலிலிருந்து பகிரப்படலாம் - திரும்பிச் செல்ல அதிரடி பார் படவுரு (மேல் இடது) - பிழைத்திருத்த: - இறக்குமதியில் சாத்தியமான செயலிழப்பு டெவலப்பர்: - அடிப்படை எச்பிரெசோய் சோதனை செயல்படுத்தப்பட்டது - சுவிட்ச்/வழக்கை விட IF வழியாக வளங்கள்

# changelogs/3821.txt:1
source: v3.14.2: OpenTracks Changes: - Downgrade database from upcoming release v3.15.0 - Import/Export UI improved - Import offers to show imported track - Marker list performance improved Developer: - Track.Id/Marker.Id: use null
ta: v3.14.2: ஓபன்ட்ராக்ச் மாற்றங்கள்: - வரவிருக்கும் வெளியீடு V3.15.0 இலிருந்து தரவுத்தளத்தை தரமிறக்கவும் - இறக்குமதி/ஏற்றுமதி இடைமுகம் மேம்படுத்தப்பட்டது - இறக்குமதி செய்யப்பட்ட பாதையைக் காண்பிக்க இறக்குமதி சலுகைகள் - மார்க்கர் பட்டியல் செயல்திறன் மேம்படுத்தப்பட்டது டெவலப்பர்: - ட்ராக்.ஐடி/மார்க்கர்

# changelogs/3823.txt:1
source: v3.14.3: OpenTracks Bugfix: - Downgrading database from upcoming release v3.15.0
ta: v3.14.3: Opentracks பிழைத்திருத்த: - வரவிருக்கும் வெளியீட்டிலிருந்து தரவுத்தளத்தை தரமிறக்குதல் V3.15.0

# changelogs/3855.txt:1
source: v3.15.0: OpenTracks WARNING: This release applies database changes that CANNOT BE REVERTED. As KMZ/KML export/import behaviour changes as well, it is recommended to (A) take a backup BEFORE upgrading and (B) afterwards. Recommended format: KMZ. BREAKING CHANGES: - Internal storage of track segments is changed (user generated events are now considered trackpoints without a location but with timestamp) - Device time instead of GPS time is stored (existing data is not modified) - Dashboard API v2 (please upgrade OSMDashboard 2.10.0) Changes: - KML/KMZ can used to backup and restore exactly (incl. statistics) Developer: - Reworked track segmentation and it's storage (formerly PAUSE/RESUME marker) - TrackStatistics are computed solely using TrackPoints - Replaced long with Instant/Duration
ta: v3.15.0: ஓபன்ட்ராக்ச் எச்சரிக்கை: இந்த வெளியீடு மாற்ற முடியாத தரவுத்தள மாற்றங்களைப் பயன்படுத்துகிறது. KMZ/KML ஏற்றுமதி/இறக்குமதி நடத்தை மாற்றப்படுவதால், (அ) மேம்படுத்துவதற்கு முன் காப்புப்பிரதி எடுக்கப் பரிந்துரைக்கப்படுகிறது, பின்னர் (ஆ). பரிந்துரைக்கப்பட்ட வடிவம்: KMZ. மாற்றங்களை உடைத்தல்: - டிராக் பிரிவுகளின் உள் சேமிப்பு மாற்றப்பட்டுள்ளது (பயனர் உருவாக்கிய நிகழ்வுகள் இப்போது இடம் இல்லாமல் டிராக் பாயிண்டுகளாகக் கருதப்படுகின்றன, ஆனால் நேர முத்திரையுடன்) - சி.பி.எச் நேரத்திற்கு பதிலாகச் சாதன நேரம் சேமிக்கப்படுகிறது (இருக்கும் தரவு மாற்றியமைக்கப்படவில்லை) - டாச்போர்டு பநிஇ வி 2 (தயவுசெய்து OSMDashboard 2.10.0 ஐ மேம்படுத்தவும்) மாற்றங்கள்: - KML/KMZ சரியாக காப்புப் பிரதி எடுக்கவும் மீட்டமைக்கவும் பயன்படுத்தலாம் (புள்ளிவிவரங்கள் உட்பட) டெவலப்பர்: - மறுவேலை செய்யப்பட்ட தட பிரிவு மற்றும் அது சேமிப்பு (முன்னர் இடைநிறுத்தம்/மீண்டும் மார்க்கர்) - ட்ராக்ச்டாடிச்டிக்ச் ட்ராக் பாயிண்டுகளைப் பயன்படுத்தி மட்டுமே கணக்கிடப்படுகிறது - உடனடி/கால அளவோடு நீண்ட நேரம் மாற்றப்பட்டது

# changelogs/3862.txt:1
source: v3.15.1: OpenTracks Changes: - After recording show sensor statistics (e.g., avg HR) Bugfix: - Crash on recording start with show latitude/longitude enabled
ta: v3.15.1: ஓபன்ட்ராக்ச் மாற்றங்கள்: - பதிவு செய்த பிறகு சென்சார் புள்ளிவிவரங்கள் (எ.கா., ஏ.வி.சி எச்.ஆர்) பிழைத்திருத்த: - பதிவு செய்வதில் செயலிழப்பு சோ அட்சரேகை/தீர்க்கரேகை இயக்கப்பட்டது

# changelogs/3875.txt:1
source: v3.15.2: OpenTracks Changes: - Updated translations Bugfix: - Crash on GPX export
ta: v3.15.2: ஓபன்ட்ராக்ச் மாற்றங்கள்: - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் பிழைத்திருத்த: - சிபிஎக்ச் ஏற்றுமதியில் செயலிழப்பு

# changelogs/3890.txt:1
source: v3.15.3: OpenTracks Changes: - Computation avg/max: heart rate, cadence, and power Bugfix: - KML/KMZ do not export #start/#end placemarks anymore - While recording: Speed/location was sometimes falsly shown as 0.
ta: v3.15.3: ஓபன்ட்ராக்ச் மாற்றங்கள்: - கணக்கீட்டு சராசரி/அதிகபட்சம்: இதய துடிப்பு, கேடென்ச் மற்றும் சக்தி பிழைத்திருத்த: - KML/KMZ இனி ஏற்றுமதி செய்ய வேண்டாம் #தொடக்க/ #முடிவு பிளேச்மார்க்ச் - பதிவு செய்யும் போது: வேகம்/இருப்பிடம் சில நேரங்களில் 0 எனக் காட்டப்பட்டது.

# changelogs/3892.txt:1
source: v3.15.4: OpenTracks Bugfix: - Voice annoucements interval should be in minutes (introduced in v3.15.0)
ta: v3.15.4: Opentracks பிழைத்திருத்த: - குரல் வருடாந்திர இடைவெளி நிமிடங்களில் இருக்க வேண்டும் (V3.15.0 இல் அறிமுகப்படுத்தப்பட்டது)

# changelogs/3941.txt:1
source: v3.16.0: OpenTracks Changes: - Cycling: get distance from BLE speed sensor - Reworked UI presented while recording - UI performance optimizations - Exported filenames: <First 32bits UUID>_<track's name>.<extension> - Import multiple files via Intent (e.g., from Gadgetbridge) - GPX: export power data - Updated translations Bugfix: - Voice announcement use minutes correctly
ta: v3.16.0: ஓபன்ட்ராக்ச் மாற்றங்கள்: - சைக்கிள் ஓட்டுதல்: பி.எல்.இ வேக சென்சாரிலிருந்து தூரத்தைப் பெறுங்கள் - பதிவு செய்யும்போது வழங்கப்பட்ட இடைமுகம் மறுவேலை - இடைமுகம் செயல்திறன் மேம்படுத்தல்கள் - ஏற்றுமதி செய்யப்பட்ட கோப்புப் பெயர்கள்: <முதல் 32bits uuid> _ <டிராக்கின் பெயர்> - பல கோப்புகளை நோக்கம் வழியாக இறக்குமதி செய்யுங்கள் (எ.கா., கேசெட் பிரிட்சிலிருந்து) - சி.பி.எக்ச்: ஏற்றுமதி ஆற்றல் தரவு - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் பிழைத்திருத்த: - குரல் அறிவிப்பு நிமிடங்களைச் சரியாகப் பயன்படுத்துங்கள்

# changelogs/3981.txt:1
source: v3.17.0: OpenTracks Changes: - Add icon for kayaking - Charts draw missing sensor data properly - Default: show coordinates while recording Bugfixes: - GPX schema corrected - GPX exported altitude loss as sensor distance - Statistics not computed correctly if using a speed/distance sensor Developer: - Distance/speed value objects - Replaced communication via SharedPreferences - Use non-static service binder - Use altitude in the code base (instead of elevation)
ta: v3.17.0: Opentracks மாற்றங்கள்: - கயாக்கிங்கிற்கு ஐகானைச் சேர்க்கவும் - விளக்கப்படங்கள் காணாமல் போன சென்சார் தரவைச் சரியாக வரையவும் - இயல்புநிலை: பதிவு செய்யும்போது ஆயத்தொலைவுகளைக் காட்டு பிழைத்திருத்தங்கள்: - சிபிஎக்ச் ச்கீமா சரி செய்யப்பட்டது - சிபிஎக்ச் உயரத்தை சென்சார் தூரமாக ஏற்றுமதி செய்தது - வேகம்/தூர சென்சார் பயன்படுத்தினால் புள்ளிவிவரங்கள் சரியாகக் கணக்கிடப்படவில்லை டெவலப்பர்: - தூரம்/வேக மதிப்புப் பொருள்கள் - பகிர்வு முன்னேற்றங்கள் வழியாகத் தகவல்தொடர்புகளை மாற்றியது - நிலையான அல்லாத பணி பைண்டரைப் பயன்படுத்தவும் - குறியீடு தளத்தில் உயரத்தைப் பயன்படுத்தவும் (உயரத்திற்கு பதிலாக)

# changelogs/3986.txt:1
source: v3.17.1: OpenTracks Bugfix: - Interval length in meters instead of kilometers (introduced in v3.17.0) - Elevation gain/loss not recorded (introduced in v3.17.0) - Announcements not working on Android 11
ta: v3.17.1: Opentracks பிழைத்திருத்த: - கிலோமீட்டருக்கு பதிலாக மீட்டரில் இடைவெளி நீளம் (V3.17.0 இல் அறிமுகப்படுத்தப்பட்டது) - உயர ஆதாயம்/இழப்பு பதிவு செய்யப்படவில்லை (V3.17.0 இல் அறிமுகப்படுத்தப்பட்டது) - ஆண்ட்ராய்டு 11 இல் அறிவிப்புகள் செயல்படவில்லை

# changelogs/3990.txt:1
source: v3.17.2: OpenTracks WARNING: The v3.17.0+ releases contain a memory leak. This issues is NOT FIXED by this release. It is recommended to not upgrade if you still use a release before v3.17.0 Bugfix: - Crash while using voice announcements
ta: v3.17.2: ஓபன்ட்ராக்ச் எச்சரிக்கை: V3.17.0+ வெளியீடுகளில் நினைவக கசிவு உள்ளது. இந்த வெளியீட்டால் இந்த சிக்கல்கள் சரி செய்யப்படவில்லை. V3.17.0 க்கு முன்பே நீங்கள் ஒரு வெளியீட்டைப் பயன்படுத்தினால் மேம்படுத்த வேண்டாம் என்று பரிந்துரைக்கப்படுகிறது பிழைத்திருத்த: - குரல் அறிவிப்புகளைப் பயன்படுத்தும் போது செயலிழப்பு

# changelogs/4009.txt:1
source: v3.17.3: OpenTracks WARNING: The v3.17.0+ releases contain a memory leak. This issues is NOT FIXED by this release. It is recommended to not upgrade if you still use a release before v3.17.0 Bugfix: - Crash if using pace for voice announcements (introduced in v3.17.0) - Statistics showed pace initially (introduced in v3.17.0) - Rare crash when deleting tracks
ta: v3.17.3: Opentracks எச்சரிக்கை: V3.17.0+ வெளியீடுகளில் நினைவக கசிவு உள்ளது. இந்த வெளியீட்டால் இந்த சிக்கல்கள் சரி செய்யப்படவில்லை. V3.17.0 க்கு முன்பே நீங்கள் ஒரு வெளியீட்டைப் பயன்படுத்தினால் மேம்படுத்த வேண்டாம் என்று பரிந்துரைக்கப்படுகிறது பிழைத்திருத்த: - குரல் அறிவிப்புகளுக்கு வேகத்தைப் பயன்படுத்தினால் செயலிழப்பு (V3.17.0 இல் அறிமுகப்படுத்தப்பட்டது) - புள்ளிவிவரங்கள் ஆரம்பத்தில் வேகத்தைக் காட்டின (V3.17.0 இல் அறிமுகப்படுத்தப்பட்டது) - தடங்களை நீக்கும்போது அரிதான செயலிழப்பு

# changelogs/4046.txt:1
source: v3.18.0: OpenTracks Changes: - Altitude is shown in EGM2008 (stored/exported as WGS84) Bugfix: - Fixed memory leak (introduced in v3.17.0) - Charts: altitude should be in M/FT (introduced in v3.17.1) - Charts: while recording was not correctly updated (introduced in v3.17.3) - TrackDataHub did not account for recordingDistanceInterval (introduced in v3.17.2) Developer: - Disable PNG crunching (reproducible build) - Refactored TrackImporter and optimized KMZ import - Use LiveData for TrackRecordingService to UI communication (removing memory leak)
ta: v3.18.0: ஓபன்ட்ராக்ச் மாற்றங்கள்: - உயரம் EGM2008 இல் காட்டப்பட்டுள்ளது (WGS84 எனச் சேமிக்கப்படுகிறது/ஏற்றுமதி செய்யப்படுகிறது) பிழைத்திருத்த: - நிலையான நினைவக கசிவு (V3.17.0 இல் அறிமுகப்படுத்தப்பட்டது) - விளக்கப்படங்கள்: உயரம் M/ft இல் இருக்க வேண்டும் (V3.17.1 இல் அறிமுகப்படுத்தப்பட்டது) - விளக்கப்படங்கள்: பதிவு சரியாகப் புதுப்பிக்கப்படவில்லை (V3.17.3 இல் அறிமுகப்படுத்தப்பட்டது) - TrackDataHub பதிவுசெய்தல் தொலைநிலை இடைவெளியைக் கணக்கில் எடுத்துக்கொள்ளவில்லை (v3.17.2 இல் அறிமுகப்படுத்தப்பட்டது) டெவலப்பர்: - பி.என்.சி க்ரஞ்சிங் முடக்கு (இனப்பெருக்கம் உருவாக்க) - மறுசீரமைக்கப்பட்ட டிராக்கிம்போர்ட்டர் மற்றும் உகந்த KMZ இறக்குமதி - இடைமுகம் தகவல்தொடர்புக்கு TrachRecordingService க்கு லைவெடியாட்டாவைப் பயன்படுத்தவும் (நினைவக கசிவை நீக்குதல்)

# changelogs/4092.txt:1
source: v3.18.1: OpenTracks Changes: - Deleting tracks is handled by a service - Uninstall deletes all data (i.e., hasFragileData=false) Bugfixes: - Race condition: crash while recording and switching OpenTracks into background - Search in track list was not working - Cycling speed sensor: distance computation was wrong (only affected statistics) Developer: - ControllerFragment replaces TrackController
ta: v3.18.1: Opentracks மாற்றங்கள்: - தடங்களை நீக்குவது ஒரு சேவையால் கையாளப்படுகிறது . பிழைத்திருத்தங்கள்: - ரேச் நிபந்தனை: ஓபன்ட்ராக்சை பின்னணியில் பதிவுசெய்து மாற்றும்போது செயலிழப்பு - தட பட்டியலில் தேடல் வேலை செய்யவில்லை - சைக்கிள் ஓட்டுதல் வேக சென்சார்: தொலைதூர கணக்கீடு தவறாக இருந்தது (பாதிக்கப்பட்ட புள்ளிவிவரங்கள் மட்டுமே) டெவலப்பர்: - கட்டுப்படுத்தி ஃபிராக்மென்ட் ட்ராக் கன்ட்ரோலரை மாற்றுகிறது

# changelogs/4098.txt:1
source: v3.18.2: OpenTracks Bugfix: - Crash while moving from charts to another activity/app #787 Developer: - TrackRecordingService pushes data to UI while recording
ta: v3.18.2: ஓபன்ட்ராக்ச் பிழைத்திருத்த: - விளக்கப்படங்களிலிருந்து மற்றொரு செயல்பாட்டிற்கு நகரும் போது செயலிழப்பு/பயன்பாடு #787 டெவலப்பர்: - ட்ராக் ரெக்கார்டிங் பணி பதிவு செய்யும் போது தரவை இடைமுகம் க்கு தள்ளுகிறது

# changelogs/4143.txt:1
source: v3.18.3: OpenTracks Changes: - KML parsing does not require order of when/gx:coords - Track importer: reorders locations by timestamp - Removed rendered launcher icons for Android < 8.0.0 (API 26) (might look slightly different, but avoid problems for reproducible builds) Bugfix: - Avoid crash in charts due to race condition Developer: - Split GPX and KML importer (removed common inheritance)
ta: v3.18.3: ஓபன்ட்ராக்ச் மாற்றங்கள்: - KML பாகுபடுத்தலுக்கு/GX: KOURS இன் ஆர்டர் தேவையில்லை - ட்ராக் இறக்குமதியாளர்: நேர முத்திரைமூலம் இருப்பிடங்களை மறுசீரமைக்கிறது - ஆண்ட்ராய்டு <8.0.0 (ஏபிஐ 26) க்கான அகற்றப்பட்ட லாஞ்சர் ஐகான்கள் அகற்றப்பட்டன (சற்று வித்தியாசமாகத் தோன்றலாம், ஆனால் இனப்பெருக்கம் செய்யக்கூடிய கட்டமைப்புகளுக்கான சிக்கல்களைத் தவிர்க்கவும்) பிழைத்திருத்த: - பந்தய நிலை காரணமாக விளக்கப்படங்களில் செயலிழப்பதைத் தவிர்க்கவும் டெவலப்பர்: - பிளவு சி.பி.எக்ச் மற்றும் கே.எம்.எல் இறக்குமதியாளர் (பொதுவான பரம்பரை அகற்றப்பட்டது)

# changelogs/4151.txt:1
source: v3.18.4: OpenTracks Changes: - Speed/distance are consistently formatted - Intervals tab is now faster Bugfix: - Cycling speed/distance sensor: - fixed parsing (UINT32) - transmit data to UI properly
ta: v3.18.4: Opentracks மாற்றங்கள்: - வேகம்/தூரம் தொடர்ந்து வடிவமைக்கப்பட்டுள்ளது - இடைவெளி தாவல் இப்போது வேகமாக உள்ளது பிழைத்திருத்த: - சைக்கிள் ஓட்டுதல் வேகம்/தூர சென்சார்: - நிலையான பாகுபடுத்தல் (UINT32) - தரவை இடைமுகம் க்கு சரியாக அனுப்பவும்

# changelogs/4176.txt:1
source: v3.18.5: OpenTracks Changes: - Voice announcement speed configurable - API <26: Launcher icon omits background Bugfixes: - Recording UI: show correct values - Recording UI: show (again) altitude in EGM2008 Developer: - Android12 permissions (BLUETOOTH_CONNECT)
ta: v3.18.5: Opentracks மாற்றங்கள்: - குரல் அறிவிப்பு விரைவு கட்டமைக்கக்கூடியது - பநிஇ <26: துவக்கி படவுரு பின்னணியைத் தவிர்க்கிறது பிழைத்திருத்தங்கள்: - இடைமுகம் ஐ பதிவு செய்தல்: சரியான மதிப்புகளைக் காட்டு - பதிவுசெய்தல் UI: EGM2008 இல் (மீண்டும்) உயரத்தைக் காட்டு டெவலப்பர்: - Android12 அனுமதிகள் (புளூடூத்_கோனெக்ட்)

# changelogs/4253.txt:1
source: v3.18.6: OpenTracks Changes: - "Show on map"-functionality via KML instead of KMZ - Voice announcement do not include app name - While recording: elevation gain/loss is updated every second - Store descriptions translated Bufixes: - Fixed invalid voice announcement translations Developer: - Android12 permissions (BLUETOOTH_SCAN) - Android12 permissions (ACCESS_COARSE_LOCATION) - Asserting for TrackPoints (testing) - Removed unused translations
ta: v3.18.6: Opentracks மாற்றங்கள்: - "வரைபடத்தில் காட்டு"- KMZ க்கு பதிலாக KML வழியாகச் செயல்பாடு - குரல் அறிவிப்பில் பயன்பாட்டு பெயர் இல்லை - பதிவு செய்யும்போது: ஒவ்வொரு நொடியும் உயர ஆதாயம்/இழப்பு புதுப்பிக்கப்படும் - கடை விளக்கங்கள் மொழிபெயர்க்கப்பட்டவை பஃபிக்ச்: - நிலையான தவறான குரல் அறிவிப்பு மொழிபெயர்ப்புகள் டெவலப்பர்: - Android12 அனுமதிகள் (புளூடூத்_ச்கான்) - Android12 அனுமதிகள் (அணுகல்_கார்ச்_லோகேசன்) - ட்ராக் பாயிண்டுகளுக்கு வலியுறுத்துதல் (சோதனை) - பயன்படுத்தப்படாத மொழிபெயர்ப்புகளை அகற்றியது

# changelogs/4358.txt:1
source: v3.19.0: OpenTracks Changes: - Support for Running Speed and Cadence (RCS) sensors implemented - When sharing a track: a share picture is created - No vibration when starting a recording - While recording: UI shows most recently received altitude, speed, and bearing (even if not stored) Bugfix: - Computation of total duration should not include paused durations (requires re-import) - (again) Use custom summaries if present Developer: - Upgrade to SDK31 and AGP7.0.0 (requires JDK11) - TrackRecordingService: extacted sensor fusion (TrackPointCreator) and TrackPoint storage (TrackRecordingManager) - ExportImportTest is now deterministics/ constant
ta: v3.19.0: Opentracks மாற்றங்கள்: - இயங்கும் விரைவு மற்றும் கேடென்ச் (ஆர்.சி.எச்) சென்சார்களுக்கான உதவி செயல்படுத்தப்பட்டது - ஒரு பாதையைப் பகிரும்போது: ஒரு பங்குப் படம் உருவாக்கப்பட்டது - பதிவைத் தொடங்கும்போது அதிர்வு இல்லை - பதிவு செய்யும்போது: இடைமுகம் மிக அண்மைக் காலத்தில் பெறப்பட்ட உயரம், விரைவு மற்றும் தாங்கி (சேமிக்கப்படாவிட்டாலும் கூட) காட்டுகிறது பிழைத்திருத்த: - மொத்த கால கணக்கீட்டில் இடைநிறுத்தப்பட்ட காலங்கள் இருக்கக் கூடாது (மறு இறக்குமதி தேவை) - (மீண்டும்) இருந்தால் தனிப்பயன் சுருக்கங்களைப் பயன்படுத்தவும் டெவலப்பர்: - SDK31 மற்றும் AGP7.0.0 க்கு மேம்படுத்தவும் (JDK11 தேவை) - டிராக் ரெக்கார்டிங் சேவை: எக்ஸ்டாக்டட் சென்சார் ஃப்யூஷன் (டிராக்பாயிண்ட் கிரியேட்டர்) மற்றும் டிராக்பாயிண்ட் ஸ்டோரேஜ் (டிராக் ரெக்கார்டிங் மேனேஜர்) - எக்ச்போர்ட்டிம்போர்ட்டெச்ட் இப்போது தீர்மானிக்கும்/ மாறிலி

# changelogs/4396.txt:1
source: v3.19.1: OpenTracks Changes: - Updated translations. Bugfix: - Export All Tracks bug fixed. - Resume Track bug fixed.
ta: v3.19.1: Opentracks மாற்றங்கள்: - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள். பிழைத்திருத்த: - அனைத்து தடங்கள் பிழையும் ஏற்றுமதி செய்யுங்கள். - ட்ராக் பிழை சரி செய்யப்பட்டது.

# changelogs/4410.txt:1
source: v3.20.0: OpenTracks Changes: - While recording: statistics UI is now configurable Bugfix: - Changing track name/ category while recording was ignored (introduced in v3.19.0)
ta: v3.20.0: ஓபன்ட்ராக்ச் மாற்றங்கள்: - பதிவு செய்யும் போது: புள்ளிவிவரங்கள் இடைமுகம் இப்போது கட்டமைக்கப்படுகிறது பிழைத்திருத்த: - பதிவு செய்யும் போது டிராக் பெயர்/ வகையை மாற்றுவது புறக்கணிக்கப்பட்டது (V3.19.0 இல் அறிமுகப்படுத்தப்பட்டது)

# changelogs/4441.txt:1
source: v3.20.1: OpenTracks Changes: - Announcements can now be used by both distance and time - Announcements beep if no Text-to-speech software is installed - Removed adaptive GPS location frequency
ta: v3.20.1: ஓபன்ட்ராக்ச் மாற்றங்கள்: - அறிவிப்புகளை இப்போது தூரம் மற்றும் நேரம் இரண்டிலும் பயன்படுத்தலாம் -உரை-க்கு-பேச்சு மென்பொருள் நிறுவப்படவில்லை என்றால் அறிவிப்புகள் பீப் - அகற்றப்பட்ட தகவமைப்பு சி.பி.எச் இருப்பிட அதிர்வெண்
