Repository: 247i/TACETr
Catalog: உரை/தானி/orion-viewer-help-*.po
Languages: ta

# zoom
source: Opens zoom dialog. Zero zoom value means zooming by width.
ta: சூம் உரையாடலைத் திறக்கிறது. சுழிய சூம் மதிப்பு என்பது அகலத்தால் பெரிதாக்குகிறது.

# rotation
source: Rotates document to the 90 degree clockwise. Long click rotates counterclockwise.
ta: ஆவணத்தை 90 டிகிரி கடிகார திசையில் சுழற்றுகிறது. நீண்ட சொடுக்கு எதிரெதிர் திசையில் சுழல்கிறது.

# crop
source: Opens borders crop dialog. Values defined relative to page size. Long click for plus or minus in this dialog changes crop value for 10%. Negative value add additional borders.
ta: எல்லைகள் பயிர் உரையாடலைத் திறக்கிறது. பக்க அளவோடு தொடர்புடைய மதிப்புகள் வரையறுக்கப்பட்டுள்ளன. இந்த உரையாடலில் பிளச் அல்லது மைனசுக்கு நீண்ட சொடுக்கு செய்யவும் 10%பயிர் மதிப்பை மாற்றுகிறது. எதிர்மறை மதிப்பு கூடுதல் எல்லைகளைச் சேர்க்கவும்.

# apply
source: Apply current options.
ta: தற்போதைய விருப்பங்களைப் பயன்படுத்துங்கள்.

# escape
source: Return/Escape.
ta: திரும்ப/தப்பித்தல்.

# general_usage
source: How to use:
ta: எவ்வாறு பயன்படுத்துவது:

# general_usage_step1
source: 1. Open document (zoom by width by default)
ta: 1. திறந்த ஆவணம் (இயல்பாக அகலத்தால் பெரிதாக்கு)

# general_usage_step2
source: 2. Select appropriate orientation: portrait or landscape
ta: 2. பொருத்தமான நோக்குநிலையைத் தேர்ந்தெடுக்கவும்: உருவப்படம் அல்லது நிலப்பரப்பு

# general_usage_step3
source: 3. Crop borders, text size will be changed accordingly to changing borders (if zoom by width specified)
ta: 3. பயிர் எல்லைகள், மாற்றும் எல்லைகளுக்கு ஏற்ப உரை அளவு மாற்றப்படும் (குறிப்பிடப்பட்ட அகலத்தால் பெரிதாக்க)

# general_usage_step4
source: 4. Enjoy reading!
ta: 4. வாசிப்பதை அனுபவிக்கவும்!

# option_help
source: Application parameters
ta: பயன்பாட்டு அளவுருக்கள்

# navigation_help
source: Opens page layout dialog. On reading comics or viewing books with images you could select appropriate page layout.
ta: பக்க தளவமைப்பு உரையாடலைத் திறக்கிறது. காமிக்ச் படிப்பதில் அல்லது படங்களுடன் புத்தகங்களைப் பார்ப்பது பொருத்தமான பக்க அமைப்பைத் தேர்ந்தெடுக்கலாம்.

# dictionary_help
source: Opens External Dictionary. Choose appropriate Dictionary application in Settings.
ta: வெளிப்புற அகராதியைத் திறக்கிறது. அமைப்புகளில் பொருத்தமான அகராதி பயன்பாட்டைத் தேர்வுசெய்க.

# tap_help
source: Tap zones allow user to link different parts of device screen to commonly used commands. There are 3x3 cells where user could define actions for short (top label) and long (bottom label) clicks.
ta: சாதனத் திரையின் வெவ்வேறு பகுதிகளை பொதுவாகப் பயன்படுத்தப்படும் கட்டளைகளுடன் இணைக்க பயனரைத் தட்டவும். குறுகிய (மேல் லேபிள்) மற்றும் நீண்ட (கீழ் லேபிள்) கிளிக்குகளுக்கான செயல்களை பயனர் வரையறுக்கக்கூடிய 3x3 செல்கள் உள்ளன.

# bookmarks_export_help
source: Allow user to export bookmarks (for all books or for current one). Bookmarks are exported to xml file with the name of opened book + [bookmarks.xml or all_bookmarks.xml] suffix. This option is available at Bookmarks screen menu.
ta: புக்மார்க்குகளை ஏற்றுமதி செய்ய பயனரை அனுமதிக்கவும் (எல்லா புத்தகங்களுக்கும் அல்லது தற்போதைய ஒன்றுக்கு). திறந்த புத்தகத்தின் பெயருடன் எக்ச்எம்எல் கோப்பிற்கு புக்மார்க்குகள் ஏற்றுமதி செய்யப்படுகின்றன + [புக்மார்க்ச்.எக்ச்எம்எல் அல்லது ஆல்_புக்மார்க்ச்.எக்ச்எம்எல்] பின்னொட்டு. இந்த விருப்பம் புக்மார்க்ச் திரை பட்டியலில் கிடைக்கிறது.
