Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_cuisine_czech
source: Czech
ta: செக்

# poi_cuisine_cuban
source: Cuban
ta: கியூபன்

# poi_cuisine_british
source: British
ta: பிரிட்டிச்

# poi_cuisine_latin_american
source: Latin American
ta: லத்தீன் அமெரிக்கன்

# poi_cuisine_nepalese
source: Nepalese
ta: நேபாள

# poi_cuisine_mongolian
source: Mongolian
ta: மங்கோலியன்

# poi_cuisine_middle_eastern
source: Middle eastern
ta: நடு கிழக்கு

# poi_cuisine_ukrainian
source: Ukrainian
ta: உக்ரேனிய

# poi_cuisine_afghan
source: Afghan
ta: ஆப்கான்

# poi_cuisine_belgian
source: Belgian
ta: பெல்சியன்

# poi_cuisine_basque
source: Basque
ta: பாச்க்

# poi_cuisine_swiss
source: Swiss
ta: சுவிச்

# poi_cuisine_cantonese
source: Cantonese
ta: கான்டோனீச்

# poi_cuisine_swedish
source: Swedish
ta: ச்வீடிச்

# poi_cuisine_jamaican
source: Jamaican
ta: சமைக்கா

# poi_cuisine_armenian
source: Armenian
ta: ஆர்மீனியன்

# poi_cuisine_hawaiian
source: Hawaiian
ta: அவாயியன்

# poi_cuisine_english
source: English
ta: ஆங்கிலம்

# poi_cuisine_pakistani
source: Pakistani
ta: பாகிச்தான்

# poi_cuisine_taiwanese
source: Taiwanese
ta: தைவானிய

# poi_cuisine_tex_mex
source: Tex-mex
ta: டெக்ச்-மெக்ச்

# poi_cuisine_dutch
source: Dutch
ta: டச்சு

# poi_cuisine_syrian
source: Syrian
ta: சிரிய

# poi_cuisine_australian
source: Australian
ta: ஆச்திரேலிய

# poi_cuisine_cajun
source: Cajun
ta: கசூன்

# poi_cuisine_egyptian
source: Egyptian
ta: எகிப்திய

# poi_cuisine_senegalese
source: Senegalese
ta: செனகல்

# poi_cuisine_jewish
source: Jewish
ta: யூத

# poi_cuisine_bulgarian
source: Bulgarian
ta: பல்கேரியன்

# poi_cuisine_tibetan
source: Tibetan
ta: திபெத்திய

# poi_feeding_place
source: Place for animal feeding
ta: விலங்குகளின் உணவுக்கான இடம்

# poi_party
source: Party supplies
ta: கட்சி பொருட்கள்

# poi_electrical
source: Electrical store
ta: மின் கடை

# poi_locksmith
source: Locksmith store
ta: பூட்டு தொழிலாளி கடை

# poi_lighting
source: Lighting fixtures
ta: லைட்டிங் சாதனங்கள்

# poi_lottery
source: Lottery tickets
ta: லாட்டரி டிக்கெட்

# poi_gambling
source: Gambling venue
ta: சூதாட்ட இடம்

# poi_gambling_type
source: Type
ta: வகை

# poi_gambling_lottery
source: Lottery
ta: லாட்டரி

# poi_gambling_pachinko
source: Pachinko
ta: பச்சின்கோ

# poi_gambling_slot_machines
source: Slot machines
ta: ச்லாட் இயந்திரங்கள்

# poi_gambling_betting
source: Betting
ta: பந்தயம்

# poi_gambling_bingo
source: Bingo
ta: பிங்கோ

# poi_e_cigarette
source: Electronic cigarettes store
ta: மின்னணு சிகரெட்டுகள் கடை

# poi_locomotive
source: Locomotive
ta: உந்துபொறி

# poi_nutrition_supplements
source: Nutrition supplements
ta: ஊட்டச்சத்து சப்ளிமெண்ட்ச்

# poi_photo_studio
source: Photo studio
ta: புகைப்பட ச்டுடியோ

# poi_cliff
source: Cliff
ta: குன்றின்

# poi_animal_keeping
source: Animal keeping
ta: விலங்கு வைத்திருத்தல்

# poi_animal_keeping_horse
source: Animal keeping: horse
ta: விலங்கு வைத்தல்: குதிரை

# poi_animal_keeping_sheep
source: Animal keeping: sheep
ta: விலங்கு வைத்தல்: செம்மறி

# poi_animal_keeping_type_paddock
source: Type: paddock
ta: வகை: பேடோக்

# poi_animal_keeping_type_open_stable
source: Type: open stable
ta: வகை: திறந்த நிலையானது

# poi_tower_construction_lattice
source: Construction: lattice
ta: கட்டுமானம்: லட்டு

# poi_tower_construction_freestanding
source: Construction: freestanding
ta: கட்டுமானம்: ஃப்ரீச்டாண்டிங்

# poi_tower_construction_dish
source: Construction: dish
ta: கட்டுமானம்: டிச்

# poi_tower_construction_dome
source: Construction: dome
ta: கட்டுமானம்: குவிமாடம்

# poi_tower_construction_concealed
source: Construction: concealed
ta: கட்டுமானம்: மறைக்கப்பட்டது

# poi_railway_yard
source: Freight station
ta: சரக்கு நிலையம்

# poi_coworking_space
source: Coworking space
ta: தம பணியாளர் இடம்

# poi_fast_food_cafeteria
source: Yes;Cafeteria
ta: ஆம்; சிற்றுண்டிச்சாலை

# poi_drink_wine_yes
source: Wine: yes
ta: மது: ஆம்

# poi_drink_wine_retail
source: Wine: retail
ta: மது: சில்லறை

# poi_drink_wine_served
source: Wine: served
ta: மது: பரிமாறப்பட்டது

# poi_energy_supplier
source: Energy supplier office
ta: ஆற்றல் சப்ளையர் அலுவலகம்

# poi_electronics_repair_computer
source: Electronics repair: computers
ta: எலக்ட்ரானிக்ச் பழுது: கணினிகள்

# poi_electronics_repair_appliance
source: Electronics repair: appliance
ta: எலக்ட்ரானிக்ச் பழுது: பயன்பாடு

# poi_electronics_repair_phone
source: Electronics repair: phone
ta: எலக்ட்ரானிக்ச் பழுது: தொலைபேசி

# poi_electronics_repair_tv
source: Electronics repair: tv
ta: எலக்ட்ரானிக்ச் பழுது: டிவி

# poi_resort_kids_camp
source: Kids camp
ta: குழந்தைகள் முகாம்

# poi_music_school
source: Music school
ta: இசை பள்ளி

# poi_language_school
source: Language school
ta: மொழி பள்ளி

# poi_life_ring
source: Life ring
ta: வாழ்க்கை வளையம்

# poi_zoo_petting_zoo
source: Petting zoo
ta: செல்லப்பிராணி மிருகக்காட்சிசாலை

# poi_zoo_wildlife_park
source: Wildlife park
ta: வனவிலங்கு பூங்கா

# poi_zoo_enclosure
source: Enclosure
ta: அடைப்பு

# poi_zoo_safari_park
source: Safari park
ta: சஃபாரி பூங்கா

# poi_zoo_birds
source: Birds
ta: பறவைகள்

# poi_zoo_aviary
source: Aviary
ta: ஏரியரி

# poi_zoo_falconry
source: Falconry
ta: பால்கன்ரி

# poi_zoo_reptile
source: Reptile
ta: ஊர்வன

# poi_stands
source: Stands
ta: நிற்கிறது

# poi_motorcycle_sales_yes
source: Sales
ta: விற்பனை

# poi_motorcycle_sales_no
source: Sales: no
ta: விற்பனை: இல்லை

# poi_motorcycle_sales_yes_used
source: Sales: yes, used
ta: விற்பனை: ஆம், பயன்படுத்தப்பட்டது

# poi_motorcycle_sales_used
source: Sales: used
ta: விற்பனை: பயன்படுத்தப்பட்டது

# poi_motorcycle_rental_yes
source: Rental
ta: வாடகை

# poi_motorcycle_rental_no
source: Rental: no
ta: வாடகை: இல்லை

# poi_motorcycle_repair_yes
source: Repair
ta: பழுது

# poi_motorcycle_repair_no
source: Repair: no
ta: பழுது: இல்லை

# poi_motorcycle_parts_yes
source: Parts
ta: பாகங்கள்

# poi_motorcycle_parts_no
source: Parts: no
ta: பாகங்கள்: இல்லை

# poi_motorcycle_tyres_yes
source: Tyres
ta: டயர்கள்

# poi_motorcycle_tyres_no
source: Tyres: no
ta: டயர்கள்: இல்லை

# poi_motorcycle_clothes_yes
source: Motorcycle clothes
ta: மின்னோடி சைக்கிள் உடைகள்

# poi_motorcycle_clothes_no
source: Motorcycle clothes: no
ta: மின்னோடி சைக்கிள் உடைகள்: இல்லை

# poi_motorcycle_type_scooter
source: Scooter
ta: ச்கூட்டர்

# poi_motorcycle_type_sportbike
source: Sportbike
ta: ச்போர்ட் பைக்

# poi_motorcycle_type_chopper
source: Chopper
ta: இடைநிலை

# poi_motorcycle_type_offroad
source: Offroad
ta: ஆஃப்ரோட்

# poi_motorcycle_type_dualsport
source: Dualsport
ta: டூய்போர்ட்

# poi_motorcycle_type_standard
source: Standard
ta: தரநிலை

# poi_owner
source: Owner
ta: உரிமையாளர்

# poi_animal_shelter_purpose_adoption_yes
source: Adoption: yes
ta: தத்தெடுப்பு: ஆம்

# poi_animal_shelter_purpose_adoption_no
source: Adoption: no
ta: தத்தெடுப்பு: இல்லை

# poi_animal_shelter_purpose_release_yes
source: Release: yes
ta: வெளியீடு: ஆம்

# poi_animal_shelter_purpose_release_no
source: Release: no
ta: வெளியீடு: இல்லை

# poi_spaceport
source: Spaceport
ta: ச்பேச்போர்ட்

# poi_direction_n
source: Direction: north
ta: திசை: வடக்கு

# poi_direction_nne
source: Direction: north-northeast
ta: திசை: வடக்கு-வடகிழக்கு

# poi_direction_ne
source: Direction: northeast
ta: திசை: வடகிழக்கு

# poi_direction_ene
source: Direction: east-northeast
ta: திசை: கிழக்கு-வடகிழக்கு

# poi_direction_e
source: Direction: east
ta: திசை: கிழக்கு

# poi_direction_ese
source: Direction: east-southeast
ta: திசை: கிழக்கு-தென்கிழக்கு

# poi_direction_se
source: Direction: southeast
ta: திசை: தென்கிழக்கு

# poi_direction_sse
source: Direction: south-southeast
ta: திசை: தென்கிழக்கு

# poi_direction_s
source: Direction: south
ta: திசை: தெற்கு

# poi_direction_ssw
source: Direction: south-southwest
ta: திசை: தெற்கு-தென்மேற்கு

# poi_direction_sw
source: Direction: southwest
ta: திசை: தென்மேற்கு

# poi_direction_wsw
source: Direction: west-southwest
ta: திசை: மேற்கு-தென்மேற்கு

# poi_direction_w
source: Direction: west
ta: திசை: மேற்கு

# poi_direction_wnw
source: Direction: west-northwest
ta: திசை: மேற்கு-வடமேற்கு

# poi_direction_nw
source: Direction: northwest
ta: திசை: வடமேற்கு

# poi_direction_nnw
source: Direction: north-northwest
ta: திசை: வடக்கு-வடமேற்கு

# poi_direction_forward
source: Direction: forward
ta: திசை: முன்னோக்கி

# poi_direction_backward
source: Direction: backward
ta: திசை: பின்தங்கிய

# poi_direction_clockwise
source: Direction: clockwise
ta: திசை: கடிகார திசையில்

# poi_direction_anticlockwise
source: Direction: anticlockwise
ta: திசை: எதிரெதிர் திசையில்

# poi_direction_up
source: Direction: up
ta: திசை: மேலே

# poi_direction_down
source: Direction: down
ta: திசை: கீழே

# poi_direction_entrance
source: Direction: entrance
ta: திசை: நுழைவு

# poi_direction_exit
source: Direction: exit
ta: திசை: வெளியேறு

# poi_direction_all
source: Direction: all
ta: திசை: அனைத்தும்

# poi_winter_room_yes
source: Winter room: yes
ta: குளிர்கால அறை: ஆம்

# poi_winter_room_no
source: Winter room: no
ta: குளிர்கால அறை: இல்லை

# poi_reservation_required
source: Required
ta: தேவை

# poi_reservation_recommended
source: Recommended
ta: பரிந்துரைக்கப்படுகிறது

# poi_reservation_yes
source: Yes
ta: ஆம்

# poi_reservation_no
source: No
ta: இல்லை

# poi_reservation_members_only
source: Members only
ta: உறுப்பினர்கள் மட்டுமே

# poi_beds
source: Beds
ta: படுக்கைகள்

# poi_boat_rental
source: Boat rental
ta: படகு வாடகை

# poi_boat_motorboat_rental_yes
source: Motorboats: yes
ta: மின்னோடி படகுகள்: ஆம்

# poi_boat_motorboat_rental_no
source: Motorboats: no
ta: மின்னோடி படகுகள்: இல்லை

# poi_boat_houseboat_rental_yes
source: Houseboats: yes
ta: அவுச் படகுகள்: ஆம்

# poi_boat_houseboat_rental_no
source: Houseboats: no
ta: அவுச் படகுகள்: இல்லை

# poi_boat_pedalboat_rental_yes
source: Pedalboats: yes
ta: பெடால்போட்ச்: ஆம்

# poi_boat_pedalboat_rental_no
source: Pedalboats: no
ta: பெடால்போட்ச்: இல்லை

# poi_boat_jetski_rental_yes
source: Jetskis: yes
ta: செட்ச்கிச்: ஆம்

# poi_boat_jetski_rental_no
source: Jetskis: no
ta: செட்ச்கிச்: இல்லை

# poi_boat_sailboat_rental_yes
source: Sailboats: yes
ta: படகோட்டிகள்: ஆம்

# poi_boat_sailboat_rental_no
source: Sailboats: no
ta: படகோட்டிகள்: இல்லை

# poi_boat_dinghy_rental_yes
source: Dinghy: yes
ta: டிங்கி: ஆம்

# poi_boat_dinghy_rental_no
source: Dinghy: no
ta: டிங்கி: இல்லை

# poi_boat_kayak_rental_yes
source: Kayaks: yes
ta: கயாக்ச்: ஆம்

# poi_boat_kayak_rental_no
source: Kayaks: no
ta: கயாக்ச்: இல்லை

# poi_boat_canoe_rental_yes
source: Canoe: yes
ta: கேனோ: ஆம்

# poi_boat_canoe_rental_no
source: Canoe: no
ta: கேனோ: இல்லை

# poi_network
source: Network
ta: பிணையம்

# poi_government_archive
source: Archive
ta: காப்பகம்

# poi_government_ministry
source: Ministry
ta: அமைச்சகம்

# poi_government_public_service
source: Public service
ta: பொது பணி

# poi_government_social_security
source: Social security
ta: சமூக பாதுகாப்பு

# poi_government_social_services
source: Social services
ta: சமூக சேவைகள்

# poi_government_treasury
source: Treasury
ta: கருவூலம்

# poi_government_transportation
source: Transport institution
ta: போக்குவரத்து நிறுவனம்

# poi_government_legislative
source: Legislative institution
ta: சட்டமன்ற நிறுவனம்

# poi_vhf
source: VHF channel
ta: வி.எச்.எஃப் சேனல்

# poi_gorge
source: Gorge
ta: சார்ச்

# poi_couloir
source: Couloir
ta: நடைபாதை

# poi_mountain_area
source: Mountain area
ta: மலை பகுதி

# poi_surface_clay
source: Clay
ta: களிமண்

# poi_surface_tartan
source: Tartan
ta: டார்டன்

# poi_surface_artificial_turf
source: Artificial turf
ta: செயற்கை தரை

# poi_surface_metal_grid
source: Metal grid
ta: உலோக கட்டம்

# poi_location_underground
source: Location: underground
ta: இடம்: நிலத்தடி

# poi_location_underwater
source: Location: underwater
ta: இடம்: நீருக்கடியில்

# poi_location_overground
source: Location: overground
ta: இடம்: ஓவர் கிரவுண்ட்

# poi_location_overhead
source: Location: overhead
ta: இடம்: மேல்நிலை

# poi_location_roof
source: Location: roof
ta: இடம்: கூரை

# poi_location_rooftop
source: Location: rooftop
ta: இடம்: கூரை

# poi_location_outdoor
source: Location: outdoor
ta: இடம்: வெளிப்புறம்

# poi_location_indoor
source: Location: indoor
ta: இடம்: உட்புற

# poi_location_platform
source: Location: platform
ta: இடம்: தளம்

# poi_location_kiosk
source: Location: kiosk
ta: இடம்: கியோச்க்

# poi_location_bridge
source: Location: bridge
ta: இடம்: பாலம்

# poi_location_wall
source: Location: wall
ta: இடம்: சுவர்

# poi_location_entrance
source: Location: entrance
ta: இடம்: நுழைவு

# poi_visibility_house
source: Visibility: house
ta: தெரிவுநிலை: வீடு

# poi_visibility_street
source: Visibility: street
ta: தெரிவுநிலை: தெரு

# poi_visibility_area
source: Visibility: area
ta: தெரிவுநிலை: பகுதி

# poi_operational_status_open
source: Open
ta: திற

# poi_operational_status_closed
source: Closed
ta: மூடப்பட்டது

# poi_operational_status_restricted
source: Restricted
ta: தடைசெய்யப்பட்டது

# poi_operational_status_broken
source: Broken
ta: உடைந்த

# poi_operational_status_needs_maintenance
source: Needs maintenance
ta: பராமரிப்பு தேவை

# poi_water_place_durability_durable
source: Water place durability: durable
ta: நீர் இடம் ஆயுள்: நீடித்த

# poi_water_place_durability_emergency
source: Water place durability: emergency
ta: நீர் இடம் ஆயுள்: அவசரநிலை

# poi_water_purification_none
source: None
ta: எதுவுமில்லை

# poi_water_purification_chlorine
source: Chlorine
ta: பாசிகம்

# poi_water_purification_reverse_osmosis
source: Reverse osmosis
ta: தலைகீழ் சவ்வூடுபரவல்

# poi_water_purification_aquatabs
source: Aquatabs
ta: அக்வாடாப்ச்

# poi_water_supply_water_well
source: Water well
ta: நீர் கிணறு

# poi_water_supply_pipeline
source: Pipeline
ta: குழாய்

# poi_water_supply_running_water
source: Running water
ta: ஓடும் நீர்

# poi_water_supply_pump
source: Pump
ta: இறைப்பி

# poi_water_supply_borehole
source: Borehole
ta: போர்ஓல்

# poi_water_supply_water_trucking
source: Water trucking
ta: நீர் டிரக்கிங்

# poi_water_supply_water_tank
source: Water tank
ta: நீர் தொட்டி

# poi_water_supply_bottled_water
source: Bottled water
ta: பாட்டில் தண்ணீர்

# poi_water_place_access_community
source: Community
ta: சமூகம்

# poi_water_place_access_family
source: Family
ta: குடும்பம்

# poi_water_place_access_multifamilies
source: Multifamilies
ta: மல்டிஃபாமிலிகள்

# poi_socket
source: Socket
ta: மாட்டி

# poi_socket_chademo_output_filter
source: CHAdeMO connector output
ta: சேடெமோ இணைப்பான் வெளியீடு

# poi_socket_chademo_voltage_filter
source: CHAdeMO connector voltage
ta: சேடெமோ இணைப்பான் மின்னழுத்தம்

# poi_socket_type2_output_filter
source: Type 2 connector output
ta: வகை 2 இணைப்பு வெளியீடு

# poi_socket_type2_voltage_filter
source: Type 2 connector voltage
ta: வகை 2 இணைப்பு மின்னழுத்தம்

# poi_socket_type2_combo_output_filter
source: Type 2 combo connector output
ta: வகை 2 காம்போ இணைப்பான் வெளியீடு

# poi_socket_type2_combo_voltage_filter
source: Type 2 combo connector voltage
ta: வகை 2 காம்போ இணைப்பான் மின்னழுத்தம்

# poi_socket_type2_cable_output_filter
source: Type 2 cable connector output
ta: வகை 2 கேபிள் இணைப்பான் வெளியீடு

# poi_socket_type2_cable_voltage_filter
source: Type 2 cable connector voltage
ta: வகை 2 கேபிள் இணைப்பான் மின்னழுத்தம்

# poi_socket_type3_output_filter
source: Type 3 connector output
ta: வகை 3 இணைப்பு வெளியீடு

# poi_socket_type3a_output_filter
source: Type 3a connector output
ta: வகை 3A இணைப்பு வெளியீடு

# poi_socket_type3a_voltage_filter
source: Type 3a connector voltage
ta: வகை 3A இணைப்பு மின்னழுத்தம்

# poi_socket_type3c_output_filter
source: Type 3c connector output
ta: வகை 3 சி இணைப்பு வெளியீடு

# poi_socket_type3c_voltage_filter
source: Type 3c connector voltage
ta: வகை 3 சி இணைப்பு மின்னழுத்தம்

# poi_socket_cee_blue_output_filter
source: CEE blue connector output
ta: CEE நீல இணைப்பு வெளியீடு

# poi_socket_cee_blue_voltage_filter
source: CEE blue connector voltage
ta: CEE நீல இணைப்பு மின்னழுத்தம்

# poi_socket_schuko_output_filter
source: Schuko connector output
ta: சுகோ இணைப்பான் வெளியீடு

# poi_socket_schuko_voltage_filter
source: Schuko connector voltage
ta: சுகோ இணைப்பான் மின்னழுத்தம்

# poi_socket_typee_voltage_filter
source: Type E connector voltage
ta: இ இணைப்பு மின்னழுத்தத்தைத் தட்டச்சு செய்க

# poi_socket_typee_output_filter
source: Type E connector output
ta: இ இணைப்பு வெளியீட்டை தட்டச்சு செய்க

# poi_socket_cee_blue
source: Socket: CEE blue
ta: சாக்கெட்: சீ ப்ளூ

# poi_socket_cee_blue_current
source: Socket: CEE blue: current
ta: சாக்கெட்: சீ ப்ளூ: நடப்பு

# poi_socket_cee_blue_output
source: Socket: CEE blue: output
ta: சாக்கெட்: சீ ப்ளூ: வெளியீடு

# poi_socket_cee_red_16a
source: Socket: CEE red 16A
ta: சாக்கெட்: CEE சிவப்பு 16A

# poi_socket_cee_red_16a_current
source: Socket: CEE red 16A: current
ta: சாக்கெட்: CEE சிவப்பு 16A: நடப்பு

# poi_socket_cee_red_16a_output
source: Socket: CEE red 16A: output
ta: சாக்கெட்: CEE சிவப்பு 16A: வெளியீடு

# poi_socket_cee_red_32a
source: Socket: CEE red 32A
ta: சாக்கெட்: CEE சிவப்பு 32A

# poi_socket_cee_red_32a_current
source: Socket: CEE red 32A: current
ta: சாக்கெட்: CEE சிவப்பு 32A: நடப்பு

# poi_socket_cee_red_32a_output
source: Socket: CEE red 32A: output
ta: சாக்கெட்: CEE சிவப்பு 32A: வெளியீடு

# poi_socket_cee_red_63a
source: Socket: CEE red 63A
ta: சாக்கெட்: சீ ரெட் 63 அ

# poi_socket_cee_red_63a_current
source: Socket: CEE red 63A: current
ta: சாக்கெட்: CEE சிவப்பு 63A: நடப்பு

# poi_socket_cee_red_63a_output
source: Socket: CEE red 63A: output
ta: சாக்கெட்: CEE சிவப்பு 63A: வெளியீடு

# poi_socket_cee_red_125a
source: Socket: CEE red 125A
ta: சாக்கெட்: சீ ரெட் 125 அ

# poi_socket_cee_red_125a_current
source: Socket: CEE red 125A: current
ta: சாக்கெட்: CEE சிவப்பு 125A: நடப்பு

# poi_socket_cee_red_125a_output
source: Socket: CEE red 125A: output
ta: சாக்கெட்: CEE சிவப்பு 125A: வெளியீடு

# poi_socket_type1
source: Socket: Type 1
ta: சாக்கெட்: வகை 1

# poi_socket_type1_current
source: Socket: Type 1: current
ta: சாக்கெட்: வகை 1: நடப்பு

# poi_socket_type1_output
source: Socket: Type 1: output
ta: சாக்கெட்: வகை 1: வெளியீடு

# poi_socket_type1_combo
source: Socket: Type 1 combo
ta: சாக்கெட்: வகை 1 காம்போ

# poi_socket_type1_combo_current
source: Socket: Type 1 combo: current
ta: சாக்கெட்: வகை 1 காம்போ: நடப்பு

# poi_socket_type1_combo_output
source: Socket: Type 1 combo: output
ta: சாக்கெட்: வகை 1 காம்போ: வெளியீடு

# poi_socket_type2
source: Socket: Type 2
ta: சாக்கெட்: வகை 2

# poi_socket_type2_current
source: Socket: Type 2: current
ta: சாக்கெட்: வகை 2: நடப்பு

# poi_socket_type2_output
source: Socket: Type 2: output
ta: சாக்கெட்: வகை 2: வெளியீடு

# poi_socket_type2_combo
source: Socket: Type 2 combo
ta: சாக்கெட்: வகை 2 காம்போ

# poi_socket_type2_combo_current
source: Socket: Type 2 combo: current
ta: சாக்கெட்: வகை 2 காம்போ: நடப்பு

# poi_socket_type2_combo_output
source: Socket: Type 2 combo: output
ta: சாக்கெட்: வகை 2 காம்போ: வெளியீடு

# poi_socket_type2_cable
source: Socket: Type 2 cable
ta: சாக்கெட்: வகை 2 கேபிள்

# poi_socket_type2_cable_current
source: Socket: Type 2 cable: current
ta: சாக்கெட்: வகை 2 கேபிள்: நடப்பு

# poi_socket_type2_cable_output
source: Socket: Type 2 cable: output
ta: சாக்கெட்: வகை 2 கேபிள்: வெளியீடு

# poi_socket_type3
source: Socket: Type 3
ta: சாக்கெட்: வகை 3

# poi_socket_type3_current
source: Socket: Type 3: current
ta: சாக்கெட்: வகை 3: நடப்பு

# poi_socket_type3_output
source: Socket: Type 3: output
ta: சாக்கெட்: வகை 3: வெளியீடு

# poi_socket_type3a_current
source: Socket: Type 3a: current
ta: சாக்கெட்: வகை 3A: நடப்பு

# poi_socket_type3a_output
source: Socket: Type 3a: output
ta: சாக்கெட்: வகை 3A: வெளியீடு

# poi_socket_type3c_current
source: Socket: Type 3c: current
ta: சாக்கெட்: வகை 3 சி: நடப்பு

# poi_socket_type3c_output
source: Socket: Type 3c: output
ta: சாக்கெட்: வகை 3 சி: வெளியீடு

# poi_socket_chademo
source: Socket: CHAdeMO
ta: சாக்கெட்: சேடெமோ

# poi_socket_chademo_current
source: Socket: CHAdeMO: current
ta: சாக்கெட்: சேடெமோ: நடப்பு

# poi_socket_chademo_output
source: Socket: CHAdeMO: output
ta: சாக்கெட்: சேடெமோ: வெளியீடு

# poi_socket_tesla_standard
source: Socket: Tesla standard
ta: சாக்கெட்: டெச்லா தரநிலை

# poi_socket_tesla_standard_current
source: Socket: Tesla standard: current
ta: சாக்கெட்: டெச்லா தரநிலை: நடப்பு

# poi_socket_tesla_standard_output
source: Socket: Tesla standard: output
ta: சாக்கெட்: டெச்லா தரநிலை: வெளியீடு

# poi_socket_tesla_supercharger
source: Socket: Tesla Supercharger
ta: சாக்கெட்: டெச்லா சூப்பர்சார்சர்

# poi_socket_tesla_supercharger_current
source: Socket: Tesla Supercharger: current
ta: சாக்கெட்: டெச்லா சூப்பர்சார்சர்: நடப்பு

# poi_socket_tesla_supercharger_output
source: Socket: Tesla Supercharger: output
ta: சாக்கெட்: டெச்லா சூப்பர்சார்சர்: வெளியீடு

# poi_socket_tesla_roadster
source: Socket: Tesla Roadster
ta: சாக்கெட்: டெச்லா ரோட்ச்டர்

# poi_socket_tesla_roadster_current
source: Socket: Tesla Roadster: current
ta: சாக்கெட்: டெச்லா ரோட்ச்டர்: நடப்பு

# poi_socket_tesla_roadster_output
source: Socket: Tesla Roadster: output
ta: சாக்கெட்: டெச்லா ரோட்ச்டர்: வெளியீடு

# poi_socket_nema_5_15
source: Socket: NEMA 5-15R
ta: சாக்கெட்: நேமா 5-15 ஆர்

# poi_socket_nema_5_15_current
source: Socket: NEMA 5-15R: current
ta: சாக்கெட்: நேமா 5-15R: நடப்பு

# poi_socket_nema_5_15_output
source: Socket: NEMA 5-15R: output
ta: சாக்கெட்: நேமா 5-15R: வெளியீடு

# poi_socket_nema_5_20
source: Socket: NEMA 5-20
ta: சாக்கெட்: நேமா 5-20

# poi_socket_nema_5_20_current
source: Socket: NEMA 5-20: current
ta: சாக்கெட்: நேமா 5-20: நடப்பு

# poi_socket_nema_5_20_output
source: Socket: NEMA 5-20: output
ta: சாக்கெட்: நேமா 5-20: வெளியீடு

# poi_socket_nema_14_30
source: Socket: NEMA 14-30
ta: சாக்கெட்: நேமா 14-30

# poi_socket_nema_14_30_current
source: Socket: NEMA 14-30: current
ta: சாக்கெட்: நேமா 14-30: நடப்பு

# poi_socket_nema_14_30_output
source: Socket: NEMA 14-30: output
ta: சாக்கெட்: நேமா 14-30: வெளியீடு

# poi_socket_nema_14_50
source: Socket: NEMA 14-50
ta: சாக்கெட்: நேமா 14-50

# poi_socket_nema_14_50_current
source: Socket: NEMA 14-50: current
ta: சாக்கெட்: நேமா 14-50: நடப்பு

# poi_socket_nema_14_50_output
source: Socket: NEMA 14-50: output
ta: சாக்கெட்: நேமா 14-50: வெளியீடு

# poi_socket_schuko
source: Socket: Schuko
ta: சாக்கெட்: சுகோ

# poi_socket_schuko_current
source: Socket: Schuko: current
ta: சாக்கெட்: சுகோ: நடப்பு

# poi_socket_schuko_output
source: Socket: Schuko: output
ta: சாக்கெட்: சுகோ: வெளியீடு

# poi_socket_bs1363
source: Socket: BS 1363
ta: சாக்கெட்: பிஎச் 1363

# poi_socket_bs1363_current
source: Socket: BS 1363: current
ta: சாக்கெட்: பிஎச் 1363: நடப்பு

# poi_socket_bs1363_output
source: Socket: BS 1363: output
ta: சாக்கெட்: பிஎச் 1363: வெளியீடு

# poi_socket_as3112
source: Socket: AS/NZS 3112
ta: சாக்கெட்: AS/NZS 3112

# poi_socket_as3112_current
source: Socket: AS/NZS 3112: current
ta: சாக்கெட்: AS/NZS 3112: நடப்பு

# poi_socket_as3112_output
source: Socket: AS/NZS 3112: output
ta: சாக்கெட்: AS/NZS 3112: வெளியீடு

# poi_socket_typee
source: Socket: Type E
ta: சாக்கெட்: வகை இ

# poi_socket_typee_current
source: Socket: Type E: current
ta: சாக்கெட்: வகை E: மின்னோட்டம்

# poi_socket_typee_output
source: Socket: Type E: output
ta: சாக்கெட்: வகை E: வெளியீடு

# poi_socket_typee_voltage
source: Socket: Type E: voltage
ta: சாக்கெட்: வகை E: மின்னழுத்தம்

# poi_socket_cee_blue_yes
source: CEE blue
ta: சீ நீலம்

# poi_socket_cee_red_16a_yes
source: CEE red 16A
ta: CEE சிவப்பு 16 அ

# poi_socket_cee_red_32a_yes
source: CEE red 32A
ta: CEE சிவப்பு 32A

# poi_socket_cee_red_63a_yes
source: CEE red 63A
ta: CEE சிவப்பு 63A

# poi_socket_cee_red_125a_yes
source: CEE red 125A
ta: CEE சிவப்பு 125A

# poi_socket_type1_yes
source: Type 1
ta: வகை 1

# poi_socket_type1_combo_yes
source: Type 1 combo
ta: வகை 1 காம்போ

# poi_socket_type2_yes
source: Type 2
ta: வகை 2

# poi_socket_type2_combo_yes
source: Type 2 combo
ta: வகை 2 காம்போ

# poi_socket_type3_yes
source: Type 3
ta: வகை 3

# poi_socket_typee_yes
source: Type E
ta: வகை இ

# poi_socket_chademo_yes
source: CHAdeMO
ta: சேடெமோ

# poi_socket_tesla_standard_yes
source: Tesla standard
ta: டெச்லா தரநிலை
