Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_attraction_summer_toboggan
source: Summer toboggan
ta: சம்மர் டோபோகன்

# poi_attraction_swing_carousel
source: Swing carousel
ta: ஊசலாடும் கொணர்வி

# poi_attraction_train
source: Train (attraction)
ta: ரயில் (ஈர்ப்பு)

# poi_attraction_water_slide
source: Water slide
ta: நீர் ச்லைடு

# poi_lodging
source: Lodging
ta: லாட்சிங்

# poi_hotel
source: Hotel
ta: ஓட்டல்

# poi_guest_house
source: Guest house
ta: விருந்தினர் மாளிகை

# poi_hostel
source: Hostel
ta: ஆச்டல்

# poi_motel
source: Motel
ta: மோட்டல்

# poi_alpine_hut
source: Alpine hut;Shelter
ta: ஆல்பைன் அட்; தங்குமிடம்

# poi_chalet
source: Chalet;Shelter
ta: சாலட்; தங்குமிடம்

# poi_apartment
source: Apartment
ta: அபார்ட்மென்ட்

# poi_wilderness_hut
source: Wilderness hut;Shelter
ta: வனப்பகுதி குடிசை; தங்குமிடம்

# poi_cabin
source: Cabin;Shelter
ta: கேபின்; தங்குமிடம்

# poi_lean_to
source: Lean-to;Shelter
ta: மெலிந்த; தங்குமிடம்

# poi_hunting_lodge
source: Hunting lodge;Shelter
ta: வேட்டை லாட்ச்; தங்குமிடம்

# poi_place_of_worship
source: Place of worship
ta: வழிபாட்டு இடம்

# poi_religion_christian
source: Christianity
ta: கிறித்துவம்

# poi_religion_jewish
source: Judaism
ta: யூத மதம்

# poi_religion_muslim
source: Islam
ta: இச்லாம்

# poi_religion_sikh
source: Sikhism
ta: சீக்கிய மதம்

# poi_religion_buddhist
source: Buddhism
ta: ப Buddhism த்தம்

# poi_religion_hindu
source: Hinduism
ta: இந்து மதம்

# poi_religion_shinto
source: Shinto
ta: சின்டோ

# poi_religion_taoist
source: Taoism
ta: தாவோயிசம்

# poi_religion_voodoo
source: Voodoo
ta: வூடூ

# poi_religion_unitarian_universalist
source: Unitarian universalism
ta: யூனிடேரியன் உலகளாவியவாதம்

# poi_religion_multifaith
source: Multifaith
ta: மல்டிஃபெத்

# poi_religion_jain
source: Jainism
ta: சமண மதம்

# poi_religion_spiritualist
source: Spiritualism
ta: இறைமை

# poi_religion_bahai
source: Bahaism
ta: பஇசம்

# poi_religion_scientologist
source: Scientologism
ta: அறிவியல்

# poi_religion_pagan
source: Paganism
ta: புறமதவாதம்

# poi_religion_tenrikyo
source: Tenrikyo
ta: டென்ரிக்யோ

# poi_religion_zoroastrian
source: Zoroastrism
ta: சோராச்ட்ரியனிசம்

# poi_denomination_catholic
source: Catholic
ta: கத்தோலிக்க

# poi_denomination_baptist
source: Baptist
ta: பாப்டிச்ட்

# poi_denomination_roman_catholic
source: Roman catholic
ta: ரோமன் கத்தோலிக்க

# poi_denomination_orthodox
source: Orthodox
ta: ஆச்சாரமான

# poi_denomination_lutheran
source: Lutheran
ta: லூத்தரன்

# poi_denomination_sunni
source: Sunni
ta: சுன்னி

# poi_denomination_protestant
source: Protestant
ta: புராட்டச்டன்ட்

# poi_denomination_methodist
source: Methodist
ta: மெதடிச்ட்

# poi_denomination_anglican
source: Anglican
ta: ஆங்கிலிகன்

# poi_denomination_presbyterian
source: Presbyterian
ta: பிரச்பைடிரியன்

# poi_denomination_evangelical
source: Evangelical
ta: சுவிசேசம்

# poi_denomination_russian_orthodox
source: Russian orthodox
ta: ரச்ய ஆர்த்தடாக்ச்

# poi_denomination_pentecostal
source: Pentecostal
ta: பெந்தேகோச்தே

# poi_denomination_mormon
source: Mormon
ta: மோர்மன்

# poi_denomination_jehovahs_witness
source: Jehovahs witness
ta: யெகோவாவின் சான்று

# poi_denomination_greek_orthodox
source: Greek orthodox
ta: கிரேக்க ஆர்த்தடாக்ச்

# poi_denomination_reformed
source: Reformed
ta: சீர்திருத்தப்பட்டது

# poi_denomination_seventh_day_adventist
source: Seventh day adventist
ta: ஏழாம் நாள் அட்வென்டிச்ட்

# poi_denomination_new_apostolic
source: New apostolic
ta: புதிய அப்போச்தலிக்

# poi_denomination_church_of_england
source: Church of England
ta: சர்ச் ஆஃப் இங்கிலாந்து

# poi_denomination_episcopal
source: Episcopal
ta: எபிச்கோபல்

# poi_denomination_shia
source: Shia
ta: சியா

# poi_denomination_united
source: United
ta: ஒன்றுபட்டது

# poi_denomination_greek_catholic
source: Greek catholic
ta: கிரேக்க கத்தோலிக்க

# poi_denomination_tibetan
source: Tibetan
ta: திபெத்திய

# poi_denomination_united_reformed
source: United reformed
ta: ஒன்றுபட்டது சீர்திருத்தப்பட்டது

# poi_denomination_church_of_scotland
source: Church of Scotland
ta: ச்காட்லாந்தின் சர்ச்

# poi_denomination_salvation_army
source: Salvation army
ta: சால்வேசன் ஆர்மி

# poi_denomination_iglesia_ni_cristo
source: Iglesia ni cristo
ta: கிறிச்துவின் சர்ச்

# poi_denomination_uniting
source: Uniting
ta: ஒன்றிணைத்தல்

# poi_denomination_mennonite
source: Mennonite
ta: மென்னோனைட்

# poi_denomination_quaker
source: Quaker
ta: குவாக்கர்

# poi_denomination_bulgarian_orthodox
source: Bulgarian orthodox
ta: பல்கேரிய ஆர்த்தடாக்ச்

# poi_denomination_assemblies_of_god
source: Assemblies of god
ta: கடவுளின் கூட்டங்கள்

# poi_denomination_adventist
source: Adventist
ta: அட்வென்டிச்ட்

# poi_denomination_nazarene
source: Nazarene
ta: நாசரேன்

# poi_denomination_united_methodist
source: United methodist
ta: ஒன்றுபட்டது மெதடிச்ட்

# poi_denomination_congregational
source: Congregational
ta: அவை

# poi_denomination_old_believers
source: Old believers
ta: பழைய விசுவாசிகள்

# poi_denomination_serbian_orthodox
source: Serbian orthodox
ta: செர்பிய ஆர்த்தடாக்ச்

# poi_denomination_spiritist
source: Spiritist
ta: ஆச்ட்ரிச்ட்

# poi_denomination_armenian_apostolic
source: Armenian apostolic
ta: ஆர்மீனிய அப்போச்தலிக்

# poi_denomination_dutch_reformed
source: Dutch reformed
ta: டச்சு சீர்திருத்தப்பட்டது

# poi_denomination_apostolic
source: Apostolic
ta: அப்போச்தலிக்

# poi_denomination_reform
source: Reform
ta: சீர்திருத்தம்

# poi_denomination_latter_day_saints
source: Latter day saints
ta: பிந்தைய நாள் புனிதர்கள்

# poi_denomination_church_of_christ
source: Church of christ
ta: கிறிச்துவின் சர்ச்

# poi_denomination_united_church_of_christ
source: United church of christ
ta: ஒன்றுபட்டது சர்ச் ஆஃப் கிறிச்து

# poi_denomination_georgian_orthodox
source: Georgian orthodox
ta: சார்சிய ஆர்த்தடாக்ச்

# poi_denomination_scientist
source: Scientist
ta: விஞ்ஞானி

# poi_denomination_romanian_orthodox
source: Romanian orthodox
ta: ருமேனிய ஆர்த்தடாக்ச்

# poi_denomination_ethiopian_orthodox_tewahedo
source: Ethiopian orthodox tewahedo
ta: எத்தியோப்பியன் ஆர்த்தடாக்ச் டெவாஎடோ

# poi_denomination_unitarian
source: Unitarian
ta: யூனிடேரியன்

# poi_denomination_coptic_orthodox
source: Coptic orthodox
ta: காப்டிக் ஆர்த்தடாக்ச்

# poi_denomination_wesleyan
source: Wesleyan
ta: வெச்லியன்

# poi_denomination_shaktism
source: Shaktism
ta: ஆற்றல்

# poi_denomination_shingon_shu
source: Shingon shu
ta: உண்மையான சொல்

# poi_denomination_maronite
source: Maronite
ta: மரோனைட்

# poi_denomination_mahayana
source: Mahayana
ta: மஅயானா

# poi_internet_access_wlan
source: Internet access: wlan
ta: இணைய அணுகல்: WLAN

# poi_internet_access_terminal
source: Internet access: terminal
ta: இணைய அணுகல்: முனையம்

# poi_internet_access_wired
source: Internet access: wired
ta: இணைய அணுகல்: கம்பி

# poi_internet_access_public
source: Internet access: public
ta: இணைய அணுகல்: பொது

# poi_internet_access_service
source: Internet access: service
ta: இணைய அணுகல்: பணி

# poi_internet_access_yes
source: Internet access: yes
ta: இணைய அணுகல்: ஆம்

# poi_internet_access_no
source: Internet access: no
ta: இணைய அணுகல்: இல்லை

# poi_internet_access_fee_yes
source: Internet access: fee charged
ta: இணைய அணுகல்: கட்டணம் வசூலிக்கப்படுகிறது

# poi_internet_access_fee_no
source: Internet access: no fee
ta: இணைய அணுகல்: கட்டணம் இல்லை

# poi_monastery
source: Monastery
ta: மடாலயம்

# poi_religious
source: Religious area
ta: மத பகுதி

# poi_wayside_cross
source: Wayside cross
ta: வேசைட் கிராச்

# poi_wayside_shrine
source: Wayside shrine
ta: வேசைட் சன்னதி

# poi_information
source: Information
ta: தகவல்

# poi_clock
source: Clock
ta: கடிகை

# poi_travel_agent
source: Travel agent
ta: பயண முகவர்

# poi_viewpoint
source: Viewpoint
ta: பார்வை

# poi_camp_site
source: Camp site
ta: முகாம் தளம்

# poi_caravan_site
source: Caravan site
ta: கேரவன் தளம்

# poi_picnic_site
source: Picnic site
ta: சுற்றுலா தளம்

# poi_picnic_table
source: Picnic table
ta: சுற்றுலா அட்டவணை

# poi_spring
source: Spring
ta: வேனில்

# poi_hot_spring
source: Hot spring
ta: சூடான வேனில்

# poi_geyser
source: Geyser
ta: கீசர்

# poi_cemetery
source: Cemetery
ta: கல்லறை

# poi_grave_yard
source: Graveyard
ta: கல்லறை

# poi_tomb
source: Tomb
ta: கல்லறை

# poi_shelter
source: Shelter
ta: தங்குமிடம்

# poi_funicular
source: Funicular
ta: ஃபனிகுலர்

# poi_resort
source: Resort
ta: ரிசார்ட்

# poi_hanami
source: Hanami
ta: அனாமி

# poi_wine_cellar
source: Wine cellar
ta: மது பாதாள அறை

# poi_craft_winery
source: Winery
ta: ஒயின் தயாரித்தல்

# poi_club_art
source: Art club
ta: கலை கிளப்

# poi_club_astronomy
source: Astronomy club
ta: வானியல் கிளப்

# poi_club_computer
source: Computer club
ta: கணினி கிளப்

# poi_club_board_games
source: Board games club
ta: போர்டு கேம்ச் கிளப்

# poi_club_motorcycle
source: Motorcycle club
ta: மின்னோடி சைக்கிள் கிளப்

# poi_club_sport
source: Sports club
ta: விளையாட்டு கிளப்

# poi_club_game
source: Game club
ta: விளையாட்டு கிளப்

# poi_club_automobile
source: Automobile club
ta: ஆட்டோமொபைல் கிளப்

# poi_club_chess
source: Chess club
ta: செச் கிளப்

# poi_club_cinema
source: Cinema club
ta: சினிமா கிளப்

# poi_club_fan
source: Fan club
ta: சுவைஞர் மன்றம்

# poi_club_fishing
source: Fishing club
ta: மீன்பிடி கிளப்

# poi_club_veterans
source: Veterans club
ta: படைவீரர் கிளப்

# poi_club_linux
source: Linux club
ta: லினக்ச் கிளப்

# poi_club_theatre
source: Theater club
ta: தியேட்டர் கிளப்

# poi_club_history
source: History club
ta: வரலாற்று கிளப்

# poi_club_music
source: Music club
ta: மியூசிக் கிளப்

# poi_club_ethnic
source: Ethnic club
ta: இனக் கிளப்

# poi_club_nature
source: Nature club
ta: இயற்கை கிளப்

# poi_club_photography
source: Photography club
ta: புகைப்படம் எடுத்தல் கிளப்

# poi_club_hunting
source: Hunting club
ta: அண்டிங் கிளப்

# poi_club_shooting
source: Shooting club
ta: படப்பிடிப்பு கிளப்

# poi_club_tourism
source: Tourism club
ta: சுற்றுலா கிளப்

# poi_club_charity
source: Charity club
ta: தொண்டு கிளப்

# poi_club_freemasonry
source: Masonic Lodge
ta: மேசோனிக் லாட்ச்

# poi_club_sailing
source: Sailing club
ta: படகோட்டம் கிளப்

# poi_club_scout
source: Scout club
ta: சாரணர் கிளப்

# poi_piste
source: Piste
ta: பிச்டே

# poi_piste_downhill
source: Downhill piste
ta: கீழ்நோக்கி பிச்டே

# poi_piste_nordic
source: Nordic piste
ta: நோர்டிக் பிச்டே

# poi_piste_skitour
source: Skitour piste
ta: ச்கை டூர்

# poi_piste_hike
source: Hike piste
ta: உயர்வு பிச்டே

# poi_piste_sleigh
source: Sleigh piste
ta: பனியில் சறுக்கி ஓடும் பிச்டே

# poi_piste_sled
source: Sled piste
ta: ச்லெட் பிச்ட்

# poi_piste_snow_park
source: Snow park
ta: பனி பூங்கா

# poi_piste_playground
source: Playground piste
ta: விளையாட்டு மைதானம் பிச்டே

# poi_piste_ice_skate
source: Ice skate
ta: பனி சறுக்கு

# poi_ski_rental
source: Ski rental
ta: ச்கை வாடகை

# poi_library
source: Library
ta: நூலகம்

# poi_arts_centre
source: Arts center
ta: கலை நடுவண்

# poi_cinema
source: Cinema
ta: சினிமா

# poi_casino
source: Casino
ta: கேசினோ

# poi_community_centre
source: Community center
ta: சமூக நடுவண்

# poi_social_centre
source: Social center
ta: சமூக நடுவண்

# poi_theatre
source: Theater
ta: தியேட்டர்

# poi_theatre_genre_circus
source: Circus
ta: சர்க்கச்

# poi_gallery
source: Art gallery
ta: கலைக்கூடம்

# poi_dance_floor
source: Dance floor
ta: நடன தளம்

# poi_nightclub
source: Nightclub;Disco;Disko
ta: நைட் கிளப்; டிச்கோ; டிச்கோ

# poi_stripclub
source: Stripclub
ta: உரி கிளப்

# poi_ski_resort
source: Ski resort
ta: ச்கை ரிசார்ட்

# poi_beach_resort
source: Beach resort
ta: கடற்கரை ரிசார்ட்

# poi_dog_park
source: Dog park
ta: நாய் பூங்கா

# poi_leisure_fishing
source: Fishing place
ta: மீன்பிடி இடம்

# poi_hunting_stand
source: Hunting stand
ta: வேட்டை நிலைப்பாடு

# poi_harbour
source: Harbor
ta: துறைமுகம்

# poi_marina
source: Marina
ta: மெரினா

# poi_miniature_golf
source: Miniature golf
ta: மினியேச்சர் கோல்ஃப்

# poi_playground
source: Playground
ta: விளையாட்டு மைதானம்

# poi_bench
source: Bench
ta: பென்ச்

# poi_swimming_pool
source: Swimming pool
ta: நீச்சல் குளம்

# poi_water_park
source: Water park
ta: நீர் பூங்கா

# poi_park
source: Park
ta: பூங்கா

# poi_recreation_ground
source: Recreation ground
ta: பொழுதுபோக்கு மைதானம்

# poi_village_green
source: Village green
ta: கிராம பச்சை

# poi_trail_riding_station
source: Trail riding station
ta: டிரெயில் ரைடிங் நிலையம்

# poi_cafe
source: Cafe
ta: கஃபே

# poi_biergarten
source: Biergarten
ta: பீர் தோட்டம்

# poi_restaurant
source: Restaurant
ta: உணவகம்

# poi_fast_food
source: Fast food
ta: துரித உணவு

# poi_bar
source: Bar
ta: மதுக்கூடம்

# poi_pub
source: Pub
ta: பப்

# poi_food_court
source: Food court
ta: உணவு அறமன்றம்

# poi_drinking_water
source: Drinking water
ta: குடிநீர்

# poi_barbecue
source: Barbecue
ta: பார்பிக்யூ

# poi_craft_agricultural_engines
source: Agricultural engines
ta: விவசாய இயந்திரங்கள்

# poi_craft_basket_maker
source: Basket maker
ta: கூடை தயாரிப்பாளர்

# poi_craft_beekeeper
source: Beekeeper
ta: தேனீ வளர்ப்பவர்

# poi_craft_blacksmith
source: Blacksmith
ta: கறுப்பான்

# poi_craft_brewery
source: Brewery
ta: மதுபானம்

# poi_craft_boatbuilder
source: Boatbuilder
ta: படகு பில்டர்

# poi_craft_bookbinder
source: Bookbinder
ta: புத்தகப் பைண்டர்

# poi_craft_carpenter
source: Carpenter
ta: தச்சு

# poi_craft_carpet_layer
source: Carpet layer
ta: தரைவிரல் அடுக்கு

# poi_craft_caterer
source: Caterer
ta: உணவு வழங்குநர்

# poi_craft_clockmaker
source: Clockmaker
ta: கடிகார தயாரிப்பாளர்

# poi_craft_dressmaker
source: Dressmaker
ta: டிரச்மேக்கர்

# poi_craft_electrician
source: Electrician
ta: மின்சார வல்லுநர்

# poi_craft_gardener
source: Gardener
ta: தோட்டக்காரர்

# poi_craft_glaziery
source: Glaziery craft
ta: கிளாசியரி கைவினை

# poi_craft_handicraft
source: Handicraft
ta: கைவினைப்பொருட்கள்

# poi_craft_hvac
source: Heating, ventilation, air conditioning
ta: வெப்பமாக்கல், காற்றோட்டம், ஏர் கண்டிசனிங்

# poi_craft_insulation
source: Insulation
ta: காப்பு

# poi_craft_jeweller
source: Jeweller
ta: சுவல்லர்

# poi_craft_locksmith
source: Locksmith
ta: பூட்டு தொழிலாளி

# poi_craft_key_cutter
source: Key cutter
ta: முக்கிய கட்டர்

# poi_craft_metal_construction
source: Metal construction craft
ta: உலோக கட்டுமான கைவினை

# poi_craft_optician
source: Optician
ta: ஒளியியல்

# poi_craft_painter
source: Painter
ta: ஓவியர்

# poi_craft_parquet_layer
source: Parquet layer
ta: பார்க்வெட் லேயர்

# poi_craft_photographer
source: Photographer
ta: புகைப்படக்காரர்

# poi_craft_photographic_laboratory
source: Photographic laboratory
ta: புகைப்பட ஆய்வகம்

# poi_craft_plasterer
source: Plasterer
ta: பிளாச்டரர்

# poi_craft_plumber
source: Plumber
ta: பிளம்பர்

# poi_craft_pottery
source: Pottery craft
ta: மட்பாண்ட கைவினை

# poi_craft_rigger
source: Rigger
ta: ரிகர்

# poi_craft_roofer
source: Roofer
ta: கூரை

# poi_craft_saddler
source: Saddler
ta: சாட்லர்

# poi_craft_sawmill
source: Sawmill
ta: மரத்தூள்

# poi_craft_scaffolder
source: Scaffolder
ta: சாரக்கட்டு

# poi_craft_sculptor
source: Sculptor
ta: சிற்பி

# poi_craft_shoemaker
source: Shoemaker
ta: சூமேக்கர்

# poi_craft_stand_builder
source: Stand builder
ta: ச்டாண்ட் பில்டர்

# poi_craft_stonemason
source: Stonemason
ta: ச்டோன்மேசன்

# poi_craft_sun_protection
source: Sun protection craft
ta: சூரிய பாதுகாப்பு கைவினை

# poi_craft_sweep
source: Sweep
ta: ச்வீப்

# poi_craft_tailor
source: Tailor
ta: தையல்காரர்

# poi_craft_tiler
source: Tiler
ta: எள்

# poi_craft_tinsmith
source: Tinsmith
ta: டின்ச்மித்

# poi_craft_upholsterer
source: Upholsterer
ta: அப்ஓல்ச்டரர்

# poi_craft_watchmaker
source: Watchmaker
ta: வாட்ச்மேக்கர்

# poi_craft_window_construction
source: Window construction
ta: சாளரம் கட்டுமானம்

# poi_funeral_directors
source: Funeral directors
ta: இறுதி இயக்குநர்கள்

# poi_craft_computer
source: Computer craft
ta: கணினி கைவினை

# poi_beauty
source: Beauty salon
ta: அழகு நிலையம்

# poi_beauty_salon_nails
source: Manicure
ta: நகங்களை

# poi_hairdresser
source: Hairdresser
ta: சிகையலங்கார வல்லுநர்

# poi_massage
source: Massage salon
ta: மசாச் வரவேற்புரை

# poi_tattoo
source: Tattoo salon
ta: டாட்டூ வரவேற்புரை

# poi_dry_cleaning
source: Dry cleaning
ta: உலர் தூய்மை

# poi_laundry
source: Laundry
ta: சலவை

# poi_car_rental
source: Car rental
ta: கார் வாடகை

# poi_car_sharing
source: Car sharing
ta: கார் பகிர்வு

# poi_car_pooling
source: Car pooling spot
ta: கார் பூலிங் ச்பாட்

# poi_boat_sharing
source: Boat sharing
ta: படகு பகிர்வு

# poi_dock
source: Dock
ta: கப்பல் கூடம்

# poi_cutline
source: Cutline
ta: கட்லின்

# poi_toilets
source: Restroom;Toilets
ta: ஓய்வறை; கழிப்பறைகள்

# poi_shower
source: Shower
ta: மழை

# poi_sauna
source: Sauna
ta: ச உனா னா

# poi_brothel
source: Brothel
ta: விபச்சார விடுதி

# poi_smoking_area
source: Smoking area
ta: புகைபிடிக்கும் பகுதி

# poi_mortuary
source: Mortuary
ta: சவக்கிடங்கு

# poi_crematorium
source: Crematorium
ta: தகனம்

# poi_internet_cafe
source: Internet cafe
ta: இணைய கஃபே

# poi_bank
source: Bank
ta: வைப்பகம்

# poi_atm
source: ATM
ta: ஏடிஎம்

# poi_payment_terminal
source: Payment terminal
ta: கட்டண முனையம்

# poi_money_lender
source: Money lender
ta: பண கடன் வழங்குபவர்

# poi_pawnbroker
source: Pawnbroker
ta: பான் ப்ரோக்கர்

# poi_bureau_de_change
source: Bureau de change
ta: பரிமாற்ற அலுவலகம்

# poi_accountant
source: Accountant
ta: கணக்காளர்

# poi_bitcoin_yes
source: Bitcoin payment
ta: பிட்காயின் கட்டணம்

# poi_cave_entrance
source: Cave entrance
ta: குகை நுழைவு

# poi_peak
source: Mountain peak
ta: மலை உச்சநிலை

# poi_saddle
source: Saddle
ta: சேணம்

# poi_volcano
source: Volcano
ta: எரிமலை

# poi_crater
source: Crater
ta: க்ரேட்டர்

# poi_ridge
source: Ridge
ta: ரிட்ச்

# poi_glacier
source: Glacier
ta: பனிப்பாறை

# poi_sinkhole
source: Sinkhole
ta: சிங்க்ஓல்

# poi_waterfall
source: Waterfall
ta: நீர்வீழ்ச்சி

# poi_river
source: River
ta: நதி

# poi_stream
source: Stream
ta: ச்ட்ரீம்

# poi_rapids
source: Rapids
ta: ரேபிட்ச்

# poi_stone
source: Remarkable stone
ta: குறிப்பிடத்தக்க கல்

# poi_cape
source: Cape
ta: கேப்

# poi_beach
source: Beach
ta: கடற்கரை

# poi_bay
source: Bay
ta: விரிகுடா

# poi_fjord
source: Fjord
ta: நுழைகழி

# poi_reef
source: Reef
ta: ரீஃப்

# poi_valley
source: Valley
ta: பள்ளத்தாக்கு

# poi_water
source: Water
ta: நீர்

# poi_wetland
source: Wetland
ta: ஈரநிலம்

# poi_wood
source: Wood
ta: மரம்

# poi_tree
source: Tree
ta: மரம்

# poi_nature_reserve
source: Nature reserve
ta: இயற்கை இருப்பு

# poi_strait
source: Strait
ta: சலசந்தி

# poi_island
source: Island
ta: தீவு

# poi_islet
source: Islet
ta: தீவு

# poi_anchorage
source: Anchorage
ta: நங்கூரம்

# poi_anchor_berth
source: Anchor berth
ta: நங்கூரம் பெர்த்

# poi_beacon
source: Beacon
ta: சுழலொளி

# poi_beacon_cardinal
source: Cardinal beacon
ta: கார்டினல் பெக்கன்

# poi_beacon_lateral
source: Lateral beacon
ta: பக்கவாட்டு கலங்கரை விளக்கம்

# poi_beacon_safe_water
source: Safe water beacon
ta: பாதுகாப்பான நீர் கலங்கரை விளக்கம்

# poi_beacon_special_purpose
source: Special purpose beacon
ta: சிறப்பு நோக்கம் பெக்கான்

# poi_berth
source: Berth
ta: அணைகரை

# poi_seamark_building
source: Seamark building
ta: சீமார்க் கட்டிடம்

# poi_seamark_bridge
source: Seamark bridge
ta: சீமார்க் பாலம்

# poi_buoy_cardinal
source: Cardinal buoy
ta: கார்டினல் மிதவை

# poi_buoy_installation
source: Installation buoy
ta: நிறுவல் மிதவை

# poi_buoy_isolated_danger
source: Buoy, isolated danger
ta: மிதவை, தனிமைப்படுத்தப்பட்ட இடர்

# poi_buoy_lateral
source: Lateral buoy
ta: பக்கவாட்டு மிதவை

# poi_buoy_safe_water
source: Safe water buoy
ta: பாதுகாப்பான நீர் மிதவை

# poi_buoy_special_purpose
source: Special purpose buoy
ta: சிறப்பு நோக்கம் கொண்ட மிதவை

# poi_daymark
source: Daymark
ta: பகல்நேரம்

# poi_distance_mark
source: Distance mark
ta: தூர குறி

# poi_dry_dock
source: Dry dock
ta: உலர்துறை

# poi_seamark_dyke
source: Seamark dyke
ta: சீமார்க் டைக்

# poi_floating_dock
source: Floating dock
ta: மிதக்கும் கப்பல்துறை

# poi_fog_signal
source: Fog signal
ta: மூடுபனி சமிக்ஞை

# poi_harbour_basin
source: Harbor basin
ta: ஆர்பர் பேசின்

# poi_seamark_harbour
source: Harbor
ta: துறைமுகம்

# poi_landmark
source: Landmark
ta: மைல்கல்

# poi_seamark_light
source: Light, seamark
ta: ஒளி, சீமார்க்

# poi_seamark_light_major
source: Major light, seamark
ta: முக்கிய ஒளி, சீமார்க்

# poi_seamark_light_minor
source: Minor light, seamark
ta: சிறிய ஒளி, சீமார்க்

# poi_seamark_light_float
source: Float light, seamark
ta: மிதவை ஒளி, சீமார்க்

# poi_seamark_light_vessel
source: Vessel light, seamark
ta: கப்பல் ஒளி, சீமார்க்

# poi_mooring
source: Mooring
ta: மூரிங்

# poi_lock_basin
source: Lock basin
ta: பூட்டு பேசின்

# poi_notice
source: Notice, seamark
ta: அறிவிப்பு, சீமார்க்

# poi_pile
source: Pile
ta: குவியல்

# poi_radar_transponder
source: Radar transponder, seamark
ta: ரேடார் டிரான்ச்பாண்டர், சீமார்க்

# poi_radio_station
source: Radio station, seamark
ta: வானொலி நிலையம், சீமார்க்

# poi_signal_station_traffic
source: Signal station, traffic
ta: சிக்னல் நிலையம், போக்குவரத்து

# poi_signal_station_warning
source: Signal station, warning
ta: சிக்னல் நிலையம், எச்சரிக்கை

# poi_small_craft_facility
source: Small craft facility
ta: சிறிய கைவினை வசதி

# poi_topmark
source: Topmark, seamark
ta: டாப்மார்க், சீமார்க்

# poi_seamark_rock
source: Rock, seamark
ta: ராக், சீமார்க்

# poi_seamark_wreck
source: Wreck, seamark
ta: சிதைவு, சீமார்க்

# poi_seamark_clearance_height
source: Clearance height
ta: இசைவு உயரம்

# poi_seamark_clearance_height_closed
source: Clearance height (closed)
ta: இசைவு உயரம் (மூடியது)

# poi_seamark_clearance_height_open
source: Clearance height (open)
ta: இசைவு உயரம் (திறந்த)

# poi_seamark_clearance_width
source: Clearance width
ta: இசைவு அகலம்

# poi_military_landuse
source: Military zone
ta: இராணுவ மண்டலம்

# poi_military_airfield
source: Military airfield
ta: இராணுவ விமானநிலையம்

# poi_military_bunker
source: Military bunker
ta: இராணுவ பதுங்கு குழி

# poi_military_barracks
source: Barracks
ta: பாராக்ச்

# poi_military_danger_area
source: Danger area
ta: இடர் பகுதி

# poi_military_range
source: Military range
ta: இராணுவ வீச்சு

# poi_military_office
source: Military office
ta: இராணுவ அலுவலகம்

# poi_military_naval_base
source: Military naval base
ta: இராணுவ கடற்படை தளம்

# poi_military_nuclear_explosion_site
source: Nuclear explosion site
ta: அணு வெடிப்பு தளம்

# poi_wiki_place
source: Wikipedia
ta: விக்கிபீடியா

# poi_wiki_lang_en
source: English wiki
ta: ஆங்கில விக்கி

# poi_wiki_lang_ar
source: Arabic wiki
ta: அரபு விக்கி

# poi_wiki_lang_be
source: Belarusian wiki
ta: பெலாரூசியன் விக்கி

# poi_wiki_lang_bg
source: Bulgarian wiki
ta: பல்கேரிய விக்கி

# poi_wiki_lang_ca
source: Catalan wiki
ta: புதைக்கப்பட்டது

# poi_wiki_lang_ceb
source: Cebuano wiki
ta: செபுவானோ விக்கி

# poi_wiki_lang_cs
source: Czech wiki
ta: செக் விக்கி

# poi_wiki_lang_da
source: Danish wiki
ta: டேனிச் விக்கி

# poi_wiki_lang_de
source: German wiki
ta: செர்மன் விக்கி

# poi_wiki_lang_el
source: Greek wiki
ta: கிரேக்க விக்கி

# poi_wiki_lang_et
source: Estonian wiki
ta: எச்டோனிய விக்கி

# poi_wiki_lang_es
source: Spanish wiki
ta: ச்பானிச் விக்கி

# poi_wiki_lang_fi
source: Finnish wiki
ta: ஃபின்னிச் விக்கி

# poi_wiki_lang_fr
source: French wiki
ta: பிரஞ்சு விக்கி

# poi_wiki_lang_gl
source: Galician wiki
ta: காலிசியன் விக்கி

# poi_wiki_lang_he
source: Hebrew wiki
ta: எபிரேய விக்கி

# poi_wiki_lang_hi
source: Hindi wiki
ta: விக்கி அல்ல

# poi_wiki_lang_hr
source: Croatian wiki
ta: குரோசிய விக்கி

# poi_wiki_lang_ht
source: Haitian wiki
ta: ஐட்டிய விக்கி

# poi_wiki_lang_hu
source: Hungarian wiki
ta: அங்கேரிய விக்கி

# poi_wiki_lang_id
source: Indonesian wiki
ta: இந்தோனேசிய விக்கி

# poi_wiki_lang_it
source: Italian wiki
ta: இத்தாலிய விக்கி

# poi_wiki_lang_ja
source: Japanese wiki
ta: சப்பானிய விக்கி

# poi_wiki_lang_ko
source: Korean wiki
ta: கொரிய விக்கி

# poi_wiki_lang_lt
source: Lithuanian wiki
ta: லிதுவேனியன் விக்கி

# poi_wiki_lang_lv
source: Latvian wiki
ta: லாட்வியன் விக்கி

# poi_wiki_lang_ms
source: Malay wiki
ta: மலாய் விக்கி

# poi_wiki_lang_new
source: Newar wiki
ta: கடை
