Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_group_only_yes
source: Group only: yes
ta: குழு மட்டும்: ஆம்

# poi_group_only_no
source: Group only: no
ta: குழு மட்டும்: இல்லை

# poi_washing_machine_yes
source: Yes;Washing machine
ta: ஆம்; சலவை இயந்திரம்

# poi_washing_machine_no
source: Washing machine: no
ta: சலவை இயந்திரம்: இல்லை

# poi_shower_filter_yes
source: Yes;Shower filter
ta: ஆம்; சவர் வடிகட்டி

# poi_shower_yes
source: Shower: yes
ta: மழை: ஆம்

# poi_shower_no
source: Shower: no
ta: மழை: இல்லை

# poi_shower_hot
source: Shower: hot
ta: மழை: சூடாக

# poi_shower_outdoor
source: Shower: outdoor
ta: மழை: வெளிப்புறம்

# poi_shower_cold
source: Shower: cold
ta: மழை: குளிர்

# poi_shower_indoor
source: Shower: indoor
ta: மழை: உட்புற

# poi_caravans_yes
source: Yes;Caravans
ta: ஆம்; வணிகர்கள்

# poi_caravans_no
source: Caravans: no
ta: வணிகர்கள்: இல்லை

# poi_impromptu_yes
source: Yes
ta: ஆம்

# poi_impromptu_no
source: No
ta: இல்லை

# poi_sanitary_dump_station_yes
source: Sanitary dump station: yes
ta: சானிட்டரி டம்ப் நிலையம்: ஆம்

# poi_sanitary_dump_station_no
source: Sanitary dump station: no
ta: சானிட்டரி டம்ப் நிலையம்: இல்லை

# poi_power_supply_yes
source: Yes;Power supply
ta: ஆம்; மின்சாரம்

# poi_power_supply_no
source: Power supply: no
ta: மின்சாரம்: இல்லை

# poi_power_supply_cee_17_blue
source: Power supply (socket): CEE 17 blue
ta: மின்சாரம் (சாக்கெட்): CEE 17 நீலம்

# poi_power_supply_cee_7_4
source: Power supply (socket): CEE 7/4
ta: மின்சாரம் (சாக்கெட்): CEE 7/4

# poi_power_supply_cee_7_5
source: Power supply (socket): CEE 7/5
ta: மின்சாரம் (சாக்கெட்): CEE 7/5

# poi_power_supply_nema_5_15
source: Power supply (socket): NEMA 5-15
ta: மின்சாரம் (சாக்கெட்): நேமா 5-15

# poi_capacity_tents
source: Maximum tents
ta: அதிகபட்ச கூடாரங்கள்

# poi_capacity_caravans
source: Maximum caravans
ta: அதிகபட்ச வணிகர்கள்

# poi_dog_yes
source: Dogs allowed
ta: நாய்கள் அனுமதிக்கப்படுகின்றன

# poi_dog_no
source: Dogs not allowed
ta: நாய்கள் அனுமதிக்கப்படவில்லை

# poi_refugee_yes
source: Amenities for refugees
ta: அகதிகளுக்கான வசதிகள்

# poi_refugee_no
source: Refugees: no
ta: அகதிகள்: இல்லை

# poi_social_facility_group_home
source: Group home
ta: குழு வீடு

# poi_social_facility_assisted_living
source: Assisted living
ta: உதவி வாழ்க்கை

# poi_social_facility_outreach
source: Outreach
ta: வெளிச்சம்

# poi_social_facility_food_bank
source: Food bank
ta: உணவு வங்கி

# poi_social_facility_shelter
source: Shelter
ta: தங்குமிடம்

# poi_social_facility_ambulatory_care
source: Ambulatory care
ta: ஆம்புலேட்டரி பராமரிப்பு

# poi_social_facility_workshop
source: Workshop
ta: பட்டறை

# poi_social_facility_day_care
source: Day care
ta: பகல்நேர பராமரிப்பு

# poi_social_facility_for_senior
source: Seniors
ta: மூத்தவர்கள்

# poi_social_facility_for_child
source: Children
ta: குழந்தைகள்

# poi_social_facility_for_orphan
source: Orphans
ta: அனாதைகள்

# poi_social_facility_for_disabled
source: Disabled
ta: முடக்கப்பட்டது

# poi_social_facility_for_mental_health
source: Patients with mental disorders
ta: மனநல கோளாறுகள் உள்ள நோயாளிகள்

# poi_social_facility_for_juvenile
source: Juvenile
ta: சிறார்

# poi_social_facility_for_homeless
source: Homeless
ta: வீடற்றவர்கள்

# poi_social_facility_for_migrant
source: Migrants
ta: குடியேறியவர்கள்

# poi_social_facility_for_underprivileged
source: Underprivileged
ta: வறிய

# poi_social_facility_for_drug_addicted
source: Drug addicted
ta: போதைக்கு அடிமையானவர்

# poi_social_facility_for_unemployed
source: Unemployed
ta: வேலையில்லாதவர்

# poi_social_facility_for_diseased
source: Diseased
ta: நோய்வாய்ப்பட்டது

# poi_social_facility_for_child_juvenile
source: Child juvenile
ta: குழந்தை சிறார்

# poi_theatre_genre_philharmonic
source: Philharmonic
ta: பில்ஆர்மோனிக்

# poi_theatre_genre_musical
source: Musical
ta: இசை

# poi_theatre_genre_drama
source: Drama
ta: நாடகம்

# poi_theatre_genre_opera
source: Opera
ta: ஓபரா

# poi_theatre_genre_cabaret
source: Cabaret
ta: காபரே

# poi_theatre_genre_puppet
source: Puppet
ta: பத்தான்

# poi_theatre_genre_comedy
source: Comedy
ta: நகைச்சுவை

# poi_theatre_genre_chamber_music
source: Chamber music
ta: அறை இசை

# poi_theatre_genre_marionette
source: Marionette
ta: மரியோனெட்

# poi_theatre_genre_ballet
source: Ballet
ta: பாலே

# poi_theatre_genre_shadow_play
source: Shadow play
ta: நிழல் விளையாட்டு

# poi_bandstand
source: Bandstand
ta: பேண்ட்ச்டாண்ட்

# poi_kiln
source: Kiln
ta: சூளை

# poi_product_brick
source: Product: brick
ta: தயாரிப்பு: செங்கல்

# poi_product_quicklime
source: Product: quicklime
ta: தயாரிப்பு: விரைவு

# poi_product_leather
source: Product: leather
ta: தயாரிப்பு: தோல்

# poi_product_lime
source: Product: lime
ta: தயாரிப்பு: சுண்ணாம்பு

# poi_product_beer
source: Product: beer
ta: தயாரிப்பு: பீர்

# poi_product_charcoal
source: Product: charcoal
ta: தயாரிப்பு: கரி

# poi_product_meat
source: Product: meat
ta: தயாரிப்பு: இறைச்சி

# poi_wheelchair_description
source: Description for wheelchair users
ta: சக்கர நாற்காலி பயனர்களுக்கான விளக்கம்

# poi_blind_description
source: Description for blind
ta: பார்வையற்றோருக்கான விளக்கம்

# poi_deaf_description
source: Description for deaf
ta: காது கேளாதவர்களுக்கு விளக்கம்

# poi_highway_steps
source: Stairs
ta: படிக்கட்டுகள்

# poi_handrail_yes
source: Handrail: yes
ta: ஏண்ட்ரெயில்: ஆம்

# poi_handrail_no
source: Handrail: no
ta: ஏண்ட்ரெயில்: இல்லை

# poi_ramp_yes
source: Ramp: yes
ta: வளைவு: ஆம்

# poi_ramp_no
source: Ramp: no
ta: வளைவு: இல்லை

# poi_ramp_wheelchair_yes
source: Ramp for wheelchairs: yes
ta: சக்கர நாற்காலிகளுக்கான வளைவு: ஆம்

# poi_ramp_wheelchair_no
source: Ramp for wheelchairs: no
ta: சக்கர நாற்காலிகளுக்கான வளைவு: இல்லை

# poi_ramp_stroller_yes
source: Ramp (stroller): yes
ta: வளைவு (இழுபெட்டி): ஆம்

# poi_ramp_stroller_no
source: Ramp (stroller): no
ta: வளைவு (இழுபெட்டி): இல்லை

# poi_ramp_bicycle_yes
source: Ramp for bicycles: yes
ta: சைக்கிள்களுக்கான வளைவு: ஆம்

# poi_ramp_bicycle_no
source: Ramp for bicycles: no
ta: சைக்கிள்களுக்கான வளைவு: இல்லை

# poi_ramp_luggage_yes
source: Ramp for luggage: yes
ta: சாமான்களுக்கான வளைவு: ஆம்

# poi_ramp_luggage_no
source: Ramp for luggage: no
ta: சாமான்களுக்கான வளைவு: இல்லை

# poi_step_count
source: Step count
ta: படி எண்ணிக்கை

# poi_step_condition_even
source: Step condition: even
ta: படி நிபந்தனை: கூட

# poi_step_condition_uneven
source: Step condition: uneven
ta: படி நிபந்தனை: சீரற்ற

# poi_step_condition_rough
source: Step condition: rough
ta: படி நிபந்தனை: தோராயமாக

# poi_cairn
source: Cairn
ta: கெய்ர்ன்

# poi_defibrillator
source: Defibrillator;AED
ta: டிஃபிபிரிலேட்டர்; aed

# poi_defibrillator_yes
source: Defibrillator: yes
ta: டிஃபிபிரிலேட்டர்: ஆம்

# poi_tomb_war_grave
source: Type: war grave
ta: வகை: போர் கல்லறை

# poi_tomb_tumulus
source: Type: tumulus
ta: வகை: டுமுலச்

# poi_tomb_rock_cut
source: Type: rock-cut
ta: வகை: ராக்-கட்

# poi_tomb_hypogeum
source: Type: hypogeum
ta: வகை: ஐபோகியம்

# poi_tomb_vault
source: Type: vault
ta: வகை: வால்ட்

# poi_tomb_columbarium
source: Type: columbarium
ta: வகை: கொலம்பேரியம்

# poi_tomb_mausoleum
source: Type: mausoleum
ta: வகை: கல்லறை

# poi_tomb_sarcophagus
source: Type: sarcophagus
ta: வகை: சர்கோபகச்

# poi_tomb_crypt
source: Type: crypt
ta: வகை: கிரிப்ட்

# poi_tomb_pyramid
source: Type: pyramid
ta: வகை: பிரமிட்

# poi_historic_civilization_ancient_roman
source: Civilization: ancient roman (753 BC – 284 AD)
ta: நாகரிகம்: பண்டைய ரோமன் (கிமு 753 - கி.பி 284)

# poi_historic_civilization_nuragic
source: Civilization: nuragic (18th c. BC – 2nd c. AD)
ta: நாகரிகம்: நூராகிக் (18 வது சி. கிமு - 2 வது சி. கி.பி.)

# poi_historic_civilization_etruscan
source: Civilization: etruscan (12th – 6th c. BC)
ta: நாகரிகம்: எட்ரூச்கான் (12 - 6 வது சி. கிமு)

# poi_historic_civilization_prehistoric
source: Civilization: prehistoric
ta: நாகரிகம்: வரலாற்றுக்கு முந்தைய

# poi_historic_civilization_ancient_greek
source: Civilization: ancient greek
ta: நாகரிகம்: பண்டைய கிரேக்கம்

# poi_historic_civilization_roman
source: Civilization: roman
ta: நாகரிகம்: ரோமன்

# poi_historic_civilization_byzantine
source: Civilization: byzantine (285 AD – 1453 AD)
ta: நாகரிகம்: பைசண்டைன் (கி.பி 285 - கி.பி 1453)

# poi_historic_civilization_imperial_chinese
source: Civilization: imperial chinese (221 BC – 1911 AD)
ta: நாகரிகம்: ஏகாதிபத்திய சீன (கிமு 221 - 1911 கி.பி.)

# poi_historic_civilization_ancient_egyptian
source: Civilization: ancient egyptian (until 332 BC)
ta: நாகரிகம்: பண்டைய எகிப்திய (கிமு 332 வரை)

# poi_historic_civilization_celtic
source: Civilization: celtic
ta: நாகரிகம்: செல்டிக்

# poi_historic_civilization_western_roman
source: Civilization: western roman (285 AD – 476 AD)
ta: நாகரிகம்: மேற்கு ரோமன் (கி.பி 285 - கி.பி 476)

# poi_historic_civilization_mycenaean
source: Civilization: mycenaean
ta: நாகரிகம்: மைசீனியன்

# poi_historic_civilization_dacian
source: Civilization: dacian
ta: நாகரிகம்: டேசியன்

# poi_historic_civilization_hernici
source: Civilization: hernici
ta: நாகரிகம்: எர்னிக்

# poi_historic_civilization_greek_egyptian
source: Civilization: greek egyptian (332 BC – 30 BC)
ta: நாகரிகம்: கிரேக்க எகிப்திய (கிமு 332 - கிமு 30)

# poi_historic_civilization_roman_and_byzantine_egyptian
source: Civilization: roman and byzantine egyptian
ta: நாகரிகம்: ரோமன் மற்றும் பைசண்டைன் எகிப்திய

# poi_historic_civilization_helladic
source: Civilization: helladic
ta: நாகரிகம்: எலாடிக்

# poi_historic_civilization_cycladic
source: Civilization: cycladic
ta: நாகரிகம்: சைக்ளாடிக்

# poi_historic_civilization_minoan
source: Civilization: minoan
ta: நாகரிகம்: மினோவான்

# poi_historic_civilization_tiahuanacota
source: Civilization: tiahuanacota
ta: நாகரிகம்: தியாஉவானகோ

# poi_animal_training
source: Animal training
ta: விலங்கு பயிற்சி

# poi_animal_training_dog
source: Dog
ta: நாய்

# poi_animal_training_horse
source: Horse
ta: குதிரை

# poi_animal_yes
source: Animals allowed
ta: விலங்குகள் அனுமதிக்கப்பட்டன

# poi_animal_no
source: Animals not allowed
ta: விலங்குகள் அனுமதிக்கப்படவில்லை

# poi_historic_period_nuragic
source: Historic period: nuragic
ta: வரலாற்று காலம்: நூராசிக்

# poi_historic_period_stone_bronze_undetermined
source: Historic period: stone-age / bronze-age (undetermined)
ta: வரலாற்று காலம்: கல் அகவை / வெண்கல அகவை (தீர்மானிக்கப்படாதது)

# poi_historic_period_bronze_age
source: Historic period: bronze age
ta: வரலாற்று காலம்: வெண்கல அகவை

# poi_historic_period_principate
source: Historic period: principate (27 BC – 284 AD)
ta: வரலாற்று காலம்: தலைவர் (கிமு 27 - கி.பி 284)

# poi_historic_period_classical_greece
source: Historic period: classical greece (5th – 4th c. BC)
ta: வரலாற்று காலம்: பாரம்பரிய கிரீச் (5 - 4 வது சி. கிமு)

# poi_historic_period_archaic_greece
source: Historic period: archaic greece
ta: வரலாற்று காலம்: தொன்மையான கிரீச்

# poi_historic_period_iron_age
source: Historic period: iron age
ta: வரலாற்று காலம்: இரும்பு அகவை

# poi_historic_period_roman_republic
source: Historic period: Roman republic (508 BC – 27 BC)
ta: வரலாற்று காலம்: ரோமன் குடியரசு (கிமு 508 - கிமு 27)

# poi_historic_period_hellenistic_greece
source: Historic period: hellenistic greece
ta: வரலாற்று காலம்: எலனிச்டிக் கிரீச்

# poi_historic_period_new_kingdom
source: Historic period: new kingdom (1550 – 1069 BC)
ta: வரலாற்று காலம்: புதிய நாடு (கிமு 1550 - 1069)

# poi_historic_period_middle_kingdom
source: Historic period: middle kingdom (2055 – 1650 BC)
ta: வரலாற்று காலம்: நடு நாடு (கிமு 2055 - 1650)

# poi_historic_period_predynastic_egypt
source: Historic period: predynastic egypt
ta: வரலாற்று காலம்: முன்கூட்டிய எகிப்து

# poi_historic_period_early_dynastic_period
source: Historic period: early dynastic period (3100 – 2686 BC)
ta: வரலாற்று காலம்: ஆரம்பகால வம்ச காலம் (கிமு 3100 - 2686)

# poi_historic_period_old_kingdom
source: Historic period: old kingdom (2686 – 2181 BC)
ta: வரலாற்று காலம்: பழைய நாடு (கிமு 2686 - 2181)

# poi_historic_period_first_intermediate_period
source: Historic period: first intermediate period (2181 – 2055 BC)
ta: வரலாற்று காலம்: முதல் இடைநிலை காலம் (கிமு 2181 - 2055)

# poi_historic_period_second_intermediate_period
source: Historic period: second intermediate period (1650 – 1550 BC)
ta: வரலாற்று காலம்: இரண்டாவது இடைநிலை காலம் (கிமு 1650 - 1550)

# poi_historic_period_third_intermediate_period
source: Historic period: third intermediate period (1069 – 664 BC)
ta: வரலாற்று காலம்: மூன்றாவது இடைநிலை காலம் (கிமு 1069 - 664)

# poi_historic_period_first_persian_period
source: Historic period: first persian period
ta: வரலாற்று காலம்: முதல் பாரசீக காலம்

# poi_historic_period_late_period
source: Historic period: late period (664 – 332 BC)
ta: வரலாற்று காலம்: தாமதமான காலம் (கிமு 664 - 332)

# poi_historic_period_second_persian_period
source: Historic period: second persian period
ta: வரலாற்று காலம்: இரண்டாவது பாரசீக காலம்

# poi_historic_period_alexander_the_great
source: Historic period: Alexander the Great
ta: வரலாற்று காலம்: அலெக்சாண்டர் தி கிரேட்

# poi_historic_period_ptolemaic_egypt
source: Historic period: ptolemaic egypt (305 BC – 30 BC)
ta: வரலாற்று காலம்: டோலமிக் எகிப்து (கிமு 305 கிமு 30)

# poi_historic_period_christian_egypt
source: Historic period: christian egypt
ta: வரலாற்று காலம்: கிறிச்தவ எகிப்து

# poi_historic_period_byzantine_egypt
source: Historic period: byzantine egypt (30 BC – 641 AD)
ta: வரலாற்று காலம்: பைசண்டைன் எகிப்து (கி.மு 30 - கி.பி 641)

# poi_historic_period_persian_occupation
source: Historic period: persian occupation
ta: வரலாற்று காலம்: பாரசீக தொழில்

# poi_historic_period_greek_dark_ages
source: Historic period: Greek Dark Ages (1100 – 800 BC)
ta: வரலாற்று காலம்: கிரேக்க இருண்ட அகவை (கிமு 1100 - 800)

# poi_historic_period_roman_greece
source: Historic period: Roman Greece (146 BC – 330 AD)
ta: வரலாற்று காலம்: ரோமன் கிரீச் (கிமு 146 - கி.பி 330)

# poi_historic_period_roman_kingdom
source: Historic period: Roman kingdom (753 BC – 509 BC)
ta: வரலாற்று காலம்: ரோமன் நாடு (கிமு 753 - கிமு 509)

# poi_historic_period_dominate
source: Historic period: dominate (285 AD – 476 AD)
ta: வரலாற்று காலம்: ஆதிக்கம் செலுத்துகிறது (கி.பி 285 - கி.பி 476)

# poi_historic_period_villager
source: Historic period: villager (epoch I, II, 1580 BC – 133 AD)
ta: வரலாற்று காலம்: கிராமவாசி (எபோச் I, II, கிமு 1580 - கி.பி 133)

# poi_historic_period_urban
source: Historic period: urban (epoch III, 133 AD – 374 AD)
ta: வரலாற்று காலம்: நகர்ப்புற (சகாப்தம் III, கி.பி. - 374 கி.பி.)

# poi_historic_period_classical
source: Historic period: classical (epoch IV, 374 AD – 900 AD)
ta: வரலாற்று காலம்: பாரம்பரிய (சகாப்தம் IV, கி.பி 374 - கி.பி 900)

# poi_historic_period_imperial
source: Historic period: imperial (epoch V, 900 AD – 1200 AD)
ta: வரலாற்று காலம்: இம்பீரியல் (சகாப்தம் வி, கி.பி 900 - 1200 கி.பி.)

# poi_historic_era_paleolithic
source: Historic era: paleolithic (2.6 million years – 10000 BP)
ta: வரலாற்று சகாப்தம்: பேலியோலிதிக் (2.6 மில்லியன் ஆண்டுகள் - 10000 பிபி)

# poi_historic_era_mesolithic
source: Historic era: mesolithic
ta: வரலாற்று சகாப்தம்: மெசோலிதிக்

# poi_historic_era_neolithic
source: Historic era: neolithic
ta: வரலாற்று சகாப்தம்: கற்காலம்

# poi_historic_era_chalcolithic
source: Historic era: chalcolithic (4th–3rd millennium BC)
ta: வரலாற்று சகாப்தம்: சால்கோலிதிக் (கிமு 4 -3 வது மில்லினியம்)

# poi_historic_stone
source: Historic stone
ta: வரலாற்று கல்

# poi_stone_type_conciliation_cross
source: Type: conciliation cross
ta: வகை: சமரச குறுக்கு

# poi_stone_type_coat_of_arms
source: Type: coat of arms
ta: வகை: கோட் ஆஃப் ஆர்ம்ச்

# poi_material_wood
source: Material: wood
ta: பொருள்: மரம்

# poi_material_metal
source: Material: metal
ta: பொருள்: உலோகம்

# poi_material_reinforced_concrete
source: Material: reinforced concrete
ta: பொருள்: வலுவூட்டப்பட்ட கான்கிரீட்

# poi_material_concrete
source: Material: concrete
ta: பொருள்: கான்கிரீட்

# poi_material_steel
source: Material: steel
ta: பொருள்: எஃகு

# poi_material_stone
source: Material: stone
ta: பொருள்: கல்

# poi_material_masonry
source: Material: masonry
ta: பொருள்: கொத்து

# poi_material_brick
source: Material: brick
ta: பொருள்: செங்கல்

# poi_material_plastic
source: Material: plastic
ta: பொருள்: பிளாச்டிக்

# poi_material_sandstone
source: Material: sandstone
ta: பொருள்: மணற்கல்

# poi_material_granite_stone
source: Material: granite stone
ta: பொருள்: கிரானைட் கல்

# poi_material_metal_wood
source: Material: metal, wood
ta: பொருள்: உலோகம், மரம்

# poi_material_glass
source: Material: glass
ta: பொருள்: கண்ணாடி

# poi_material_bronze
source: Material: bronze
ta: பொருள்: வெண்கலம்

# poi_material_earth
source: Material: earth
ta: பொருள்: பூமி

# poi_material_composite
source: Material: composite
ta: பொருள்: கலப்பு

# poi_material_limestone
source: Material: limestone
ta: பொருள்: சுண்ணாம்பு

# poi_material_marble
source: Material: marble
ta: பொருள்: பளிங்கு

# poi_material_aluminium
source: Material: aluminium
ta: பொருள்: அலுமினியம்

# poi_archaeological_site_megalith
source: Megalith
ta: மெகாலித்

# poi_archaeological_site_tumulus
source: Tumulus
ta: டுமுலச்

# poi_archaeological_site_fortification
source: Fortification
ta: வலுவூட்டல்

# poi_archaeological_site_settlement
source: Settlement
ta: தீர்வு

# poi_archaeological_site_city
source: City
ta: நகரம்

# poi_archaeological_site_hut_circle
source: Hut circle
ta: குடிசை வட்டம்

# poi_archaeological_site_necropolis
source: Necropolis
ta: நெக்ரோபோலிச்

# poi_archaeological_site_petroglyph
source: Petroglyph
ta: பெட்ரோகிளிஃப்

# poi_archaeological_site_earthwork
source: Earthwork
ta: பூமிக்குரிய வேலை

# poi_megalith_type_menhir
source: Megalith type: menhir
ta: மெகாலித் வகை: மென்இர்

# poi_megalith_type_dolmen
source: Megalith type: dolmen
ta: மெகாலித் வகை: டோல்மென்

# poi_megalith_type_nuraghe
source: Megalith type: nuraghe
ta: மெகாலித் வகை: நூராகே

# poi_megalith_type_stone_circle
source: Megalith type: stone circle
ta: மெகாலித் வகை: கல் வட்டம்

# poi_megalith_type_passage_grave
source: Megalith type: passage grave
ta: மெகாலித் வகை: பத்தியில் கல்லறை

# poi_fortification_type_hill_fort
source: Fortification type: hill fort
ta: வலுவூட்டல் வகை: இல் கோட்டை

# poi_fortification_type_limes
source: Fortification type: limes
ta: வலுவூட்டல் வகை: சுண்ணாம்பு

# poi_fortification_type_sconce
source: Fortification type: sconce
ta: வலுவூட்டல் வகை: ச்கோன்ச்

# poi_fortification_type_ring_ditch
source: Fortification type: ring ditch
ta: வலுவூட்டல் வகை: ரிங் பள்ளம்

# poi_pa
source: Pa (maori fortified settlement)
ta: பி.ஏ (ம ori ரி பலப்படுத்தப்பட்ட தீர்வு)

# poi_historic_farm
source: Historic farm
ta: வரலாற்று பண்ணை

# poi_historic_railway_station
source: Historic railroad station
ta: வரலாற்று இரயில் நிலையம்

# poi_historic_threshing_floor
source: Historic threshing floor
ta: வரலாற்று கதிர் தளம்

# poi_historic_gallows
source: Historic gallows
ta: வரலாற்று தூக்கு மேடை

# poi_historic_railway
source: Historic railroad
ta: வரலாற்று இரயில் பாதை

# poi_square
source: Square
ta: நாற்கை

# poi_artist_name
source: Artist
ta: கலைஞர்

# poi_sculptor
source: Sculptor
ta: சிற்பி

# poi_building_type_church
source: Building type: church
ta: கட்டிட வகை: சர்ச்

# poi_building_type_chapel
source: Building type: chapel
ta: கட்டிட வகை: சேப்பல்

# poi_building_type_mosque
source: Building type: mosque
ta: கட்டிட வகை: மசூதி

# poi_building_type_temple
source: Building type: temple
ta: கட்டிட வகை: கோயில்

# poi_building_type_cathedral
source: Building type: cathedral
ta: கட்டிட வகை: கதீட்ரல்

# poi_building_type_monastery
source: Building type: monastery
ta: கட்டிட வகை: மடாலயம்

# poi_building_type_basilica
source: Building type: basilica
ta: கட்டிட வகை: பசிலிக்கா

# poi_building_type_synagogue
source: Building type: synagogue
ta: கட்டிட வகை: செப ஆலயம்

# poi_building_type_shrine
source: Building type: shrine
ta: கட்டிட வகை: சன்னதி

# poi_cross
source: Cross
ta: குறுக்கு

# poi_summit_cross
source: Summit cross: yes
ta: உச்சிமாநாடு குறுக்கு: ஆம்

# poi_prison_camp
source: Former prison camp
ta: முன்னாள் சிறை முகாம்

# poi_concentration_camp
source: Type: concentration camp
ta: வகை: வதை முகாம்

# poi_pow_camp
source: Type: pow camp
ta: வகை: POW முகாம்

# poi_labor_camp
source: Type: labor camp
ta: வகை: தொழிலாளர் முகாம்

# poi_concentration_camp_nazism
source: Type: nazi
ta: வகை: நாசி

# poi_concentration_camp_gulag
source: Type: gulag
ta: வகை: குலாக்

# poi_temperature
source: Temperature
ta: வெப்பநிலை

# poi_bathing_yes
source: Bathing: yes
ta: குளியல்: ஆம்

# poi_bathing_no
source: Bathing: no
ta: குளியல்: இல்லை

# poi_boat_storage
source: Boat storage
ta: படகு சேமிப்பு

# poi_conveying_yes
source: Conveying: yes
ta: தெரிவித்தல்: ஆம்

# poi_bridge_ref
source: Bridge reference
ta: பாலம் குறிப்பு

# poi_tunnel_ref
source: Tunnel reference
ta: சுரங்கப்பாதை குறிப்பு

# poi_ref
source: Reference
ta: குறிப்பு

# poi_cargo_passengers
source: Passengers
ta: பயணிகள்

# poi_cargo_vehicle
source: Vehicles
ta: வாகனங்கள்

# poi_cargo_bicycle
source: Bicycles
ta: மிதிவண்டிகள்

# poi_cargo_container
source: Containers
ta: கொள்கலன்கள்

# poi_cargo_hgv
source: HGV
ta: எச்.சி.வி.

# poi_fitness_station
source: Fitness station
ta: உடற்பயிற்சி நிலையம்

# poi_hackerspace
source: Hackerspace
ta: ஏக்கர்ச்பேச்

# poi_craft_electronics_repair
source: Electronics repair
ta: மின்னணுவியல் பழுது

# poi_fireworks
source: Fireworks store
ta: பட்டாசு கடை

# poi_aerialway_length
source: Length
ta: நீளம்

# poi_healthcare_speciality_general
source: General practitioner
ta: பொது பயிற்சியாளர்

# poi_healthcare_speciality_ophthalmology
source: Ophthalmology
ta: கண் மருத்துவம்

# poi_healthcare_speciality_gynaecology
source: Gynaecology
ta: மகளிர் மருத்துவம்

# poi_healthcare_speciality_internal
source: Internal medicine
ta: உள் மருந்து

# poi_healthcare_speciality_orthopaedics
source: Orthopaedics
ta: எலும்பியல்

# poi_healthcare_speciality_otolaryngology
source: Otolaryngology
ta: ஓட்டோலரிஞ்சி

# poi_healthcare_speciality_paediatrics
source: Paediatrics
ta: குழந்தை மருத்துவம்

# poi_health_specialty_paediatrics_no
source: Health specialty: paediatrics: no
ta: சுகாதார சிறப்பு: குழந்தை மருத்துவம்: இல்லை

# poi_healthcare_speciality_dermatology
source: Dermatology
ta: தோல் மருத்துவம்

# poi_healthcare_speciality_urology
source: Urology
ta: சிறுநீரகவியல்

# poi_healthcare_speciality_surgery
source: General surgery
ta: பொது அறுவை மருத்தீடு

# poi_healthcare_speciality_radiology
source: Radiology
ta: கதிரியக்கவியல்

# poi_healthcare_speciality_radiotherapy
source: Radiotherapy
ta: கதிரியக்க மருத்தீடு

# poi_healthcare_speciality_psychiatry
source: Psychiatry
ta: மனநல மருத்துவம்

# poi_healthcare_speciality_neurology
source: Neurology
ta: நரம்பியல்

# poi_healthcare_speciality_dermatovenereology
source: Dermato-venereology
ta: டெர்மடோ-வெனியாலசி

# poi_healthcare_speciality_cardiology
source: Cardiology
ta: இருதயவியல்

# poi_healthcare_speciality_trauma
source: Traumatology
ta: அதிர்ச்சிகரமான மருத்துவம்

# poi_healthcare_speciality_biology
source: Clinical biology
ta: மருத்துவ உயிரியல்

# poi_healthcare_speciality_osteopathy
source: Osteopathy
ta: ஆச்டியோபதி

# poi_healthcare_speciality_anaesthetics
source: Anaesthetics
ta: மயக்க மருந்து

# poi_healthcare_speciality_pulmonology
source: Respiratory medicine
ta: சுவாச மருத்துவம்

# poi_healthcare_speciality_dental_oral_maxillo_facial_surgery
source: Dental, oral and maxillo-facial surgery
ta: பல், வாய்வழி மற்றும் மாக்சில்லோ-முக அறுவை மருத்தீடு

# poi_healthcare_speciality_maternity
source: Maternity
ta: மகப்பேறு

# poi_healthcare_speciality_emergency
source: Accident and emergency medicine
ta: விபத்து மற்றும் அவசர மருத்துவம்

# poi_health_specialty_emergency_medicine_no
source: Health specialty: accident and emergency medicine: no
ta: சுகாதார சிறப்பு: விபத்து மற்றும் அவசர மருத்துவம்: இல்லை

# poi_healthcare_speciality_plastic_surgery
source: Plastic surgery
ta: பிளாச்டிக் அறுவை மருத்தீடு

# poi_healthcare_speciality_orthodontics
source: Orthodontics
ta: ஆர்த்தோடான்டிக்ச்

# poi_healthcare_speciality_physiotherapy
source: Physiotherapy
ta: பிசியோதெரபி
