Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_aerialway_bubble_yes
source: Bubble
ta: குமிழி

# poi_aerialway_bubble_no
source: No bubble
ta: குமிழி இல்லை

# poi_aerialway_heating_yes
source: Yes;Heating
ta: ஆம்; வெப்பமாக்கல்

# poi_aerialway_heating_no
source: No heating
ta: வெப்பமாக்கல் இல்லை

# poi_aerialway_bicycle_yes
source: Allowed
ta: அனுமதிக்கப்படுகிறது

# poi_aerialway_bicycle_no
source: Bicycle: not allowed
ta: சைக்கிள்: அனுமதிக்கப்படவில்லை

# poi_aerialway_bicycle_summer
source: Allowed only in summer
ta: கோடையில் மட்டுமே அனுமதிக்கப்படுகிறது

# poi_aerialway_access_entry
source: Entry only
ta: நுழைவு மட்டும்

# poi_aerialway_access_exit
source: Exit only
ta: வெளியேற மட்டுமே

# poi_aerialway_access_both
source: Entry and exit
ta: நுழைவு மற்றும் வெளியேறுதல்

# poi_aerialway_summer_access_entry
source: Summer access: entry only
ta: கோடைகால அணுகல்: நுழைவு மட்டும்

# poi_aerialway_summer_access_exit
source: Summer access: exit only
ta: கோடைகால அணுகல்: வெளியேறவும்

# poi_aerialway_summer_access_both
source: Summer access: entry and exit
ta: கோடைகால அணுகல்: நுழைவு மற்றும் வெளியேறுதல்

# poi_stars_1
source: 1 (Tourist)
ta: 1 (சுற்றுலா)

# poi_stars_1s
source: 1S (Superior Tourist)
ta: 1 கள் (உயர்ந்த சுற்றுலா)

# poi_stars_2
source: 2 (Standard)
ta: 2 (தரநிலை)

# poi_stars_2s
source: 2S (Superior Standard)
ta: 2 கள் (உயர்ந்த தரநிலை)

# poi_stars_3
source: 3 (Comfort)
ta: 3 (ஆறுதல்)

# poi_stars_3s
source: 3S (Superior Comfort)
ta: 3 கள் (உயர்ந்த ஆறுதல்)

# poi_stars_4
source: 4 (First Class)
ta: 4 (முதல் வகுப்பு)

# poi_stars_4s
source: 4S (Superior First Class)
ta: 4 எச் (உயர்ந்த முதல் வகுப்பு)

# poi_stars_5
source: 5 (Luxury)
ta: 5 (ஆடம்பர)

# poi_stars_5s
source: 5S (Superior Luxury)
ta: 5 கள் (உயர்ந்த சொகுசு)

# poi_rooms
source: Rooms
ta: அறைகள்

# poi_love_hotel
source: Love hotel
ta: லவ் ஓட்டல்

# poi_payment_coins_yes
source: Coins
ta: நாணயங்கள்

# poi_payment_coins_no
source: Coins not accepted
ta: நாணயங்கள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_coins_0_5
source: $0.5 coins
ta: $ 0.5 நாணயங்கள்

# poi_payment_coins_50c12
source: 50c, 1€, and 2€ coins
ta: 50 சி, 1 €, மற்றும் 2 € நாணயங்கள்

# poi_payment_telephone_cards_yes
source: Telephone cards
ta: தொலைபேசி அட்டைகள்

# poi_payment_telephone_cards_no
source: Telephone cards not accepted
ta: தொலைபேசி அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_credit_cards_yes
source: Credit cards
ta: கடன் கார்டுகள்

# poi_payment_credit_cards_no
source: Credit cards not accepted
ta: கடன் கார்டுகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_notes_no
source: Banknotes not accepted
ta: ரூபாய் நோட்டுகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_electronic_purses_yes
source: Electronic purses
ta: மின்னணு பர்ச்கள்

# poi_payment_electronic_purses_no
source: Electronic purses not accepted
ta: மின்னணு பணப்பைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_cash_yes
source: Cash
ta: முழுத்தொகை

# poi_payment_cash_no
source: Cash not accepted
ta: பணம் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_debit_cards_yes
source: Debit cards
ta: டெபிட் கார்டுகள்

# poi_payment_debit_cards_no
source: Debit cards not accepted
ta: டெபிட் கார்டுகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_bitcoin_yes
source: Bitcoin
ta: பிட்காயின்

# poi_payment_bitcoin_no
source: Bitcoin not accepted
ta: பிட்காயின் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_visa_yes
source: Visa
ta: இசைவு

# poi_payment_visa_no
source: Visa cards not accepted
ta: விசா அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_mastercard_yes
source: MasterCard
ta: மாச்டர்கார்டு

# poi_payment_mastercard_no
source: MasterCard not accepted
ta: மாச்டர்கார்டு ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_account_cards_yes
source: Account cards
ta: கணக்கு அட்டைகள்

# poi_payment_account_cards_no
source: Account cards not accepted
ta: கணக்கு அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_maestro_yes
source: Maestro cards
ta: மேச்ட்ரோ கார்டுகள்

# poi_payment_maestro_no
source: Maestro cards not accepted
ta: மேச்ட்ரோ கார்டுகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_american_express_yes
source: American Express (AMEX)
ta: அமெரிக்கன் எக்ச்பிரச் (அமெக்ச்)

# poi_payment_american_express_no
source: American Express (AMEX) cards not accepted
ta: அமெரிக்கன் எக்ச்பிரச் (அமெக்ச்) அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_diners_club_yes
source: Diners Club
ta: டைனர்ச் கிளப்

# poi_payment_diners_club_no
source: Diners Club cards not accepted
ta: டைனர்ச் கிளப் அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_dkv_yes
source: DKV
ta: டி.கே.வி.

# poi_payment_dkv_no
source: DKV not accepted
ta: டி.கே.வி ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_uta_no
source: UTA cards not accepted
ta: யுடிஏ கார்டுகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_efectivo_yes
source: Efectivo
ta: முழுத்தொகை

# poi_payment_efectivo_no
source: Efectivo not accepted
ta: Efectivo ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_girocard_no
source: Girocard not accepted
ta: கிர் கார்கார்டை ஏற்றுக்கொள்ளவில்லை

# poi_payment_discover_card_yes
source: Discover Card
ta: அட்டையைக் கண்டறியவும்

# poi_payment_discover_card_no
source: Discover Card not accepted
ta: அட்டை ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_visa_electron_yes
source: Visa Electron
ta: விசா எலக்ட்ரான்

# poi_payment_visa_electron_no
source: Visa Electron cards not accepted
ta: விசா எலக்ட்ரான் அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_litecoin_yes
source: Litecoin
ta: லிட்காயின்

# poi_payment_litecoin_no
source: Litecoin not accepted
ta: லிட்காயின் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_cheque_yes
source: Checks
ta: காசோலைகள்

# poi_payment_cheque_no
source: Checks not accepted
ta: காசோலைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_pikepass_yes
source: PIKEPASS
ta: சிகரங்கள்

# poi_payment_pikepass_no
source: PIKEPASS not accepted
ta: பைகாச் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_pikepass_designated
source: PIKEPASS (designated)
ta: பைகாச் (நியமிக்கப்பட்ட)

# poi_payment_visa_debit_yes
source: Visa Debit cards
ta: விசா டெபிட் கார்டுகள்

# poi_payment_visa_debit_no
source: Visa Debit cards not accepted
ta: விசா டெபிட் கார்டுகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_cryptocurrencies_no
source: Cryptocurrencies not accepted
ta: கிரிப்டோகரன்ச்கள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_others_yes
source: Others
ta: மற்றவர்கள்

# poi_payment_others_no
source: Other payment methods not accepted
ta: பிற கட்டண முறைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_routex_yes
source: Routex
ta: ரூட்எக்ச்

# poi_payment_routex_no
source: Routex fuel cards not accepted
ta: ரூட்எக்ச் எரிபொருள் அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_bancomat_yes
source: Bancomat
ta: ஏடிஎம்

# poi_payment_bancomat_no
source: Bancomat not accepted
ta: பான்கோமாட் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_icsf_yes
source: IC Stored Fare
ta: ஐசி சேமிக்கப்பட்ட கட்டணம்

# poi_payment_icsf_no
source: IC Stored Fare cards not accepted
ta: ஐசி சேமிக்கப்பட்ட கட்டண அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_prepaid_ticket_yes
source: Prepaid tickets
ta: ப்ரீபெய்ட் டிக்கெட்

# poi_payment_jcb_yes
source: JCB
ta: சே.சி.பி.

# poi_payment_jcb_no
source: JCB cards not accepted
ta: சே.சி.பி கார்டுகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_laser_yes
source: Laser
ta: ஊடொளி

# poi_payment_laser_no
source: Laser cards not accepted
ta: லேசர் அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_ep_quick_yes
source: Quick
ta: விரைவான

# poi_payment_ep_quick_no
source: Quick cards not accepted
ta: விரைவான அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_eurowag_yes
source: Eurowag
ta: யூரோவாக்

# poi_payment_eurowag_no
source: Eurowag cards not accepted
ta: யூரோவாக் அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_e_zpass_yes
source: E‑ZPass
ta: மின்-சிக்

# poi_payment_e_zpass_no
source: E‑ZPass not accepted
ta: இ - ZPASS ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_euroshell_yes
source: Euroshell
ta: யூரோசெல்

# poi_payment_euroshell_no
source: Euroshell fuel cards not accepted
ta: யூரோசெல் எரிபொருள் அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_kitcard_yes
source: KITCard
ta: கிட்கார்ட்

# poi_payment_kitcard_no
source: KITCard not accepted
ta: கிட்கார்ட் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_westfalen_card_yes
source: Westfalen
ta: வெச்ட்பாலியா

# poi_payment_westfalen_card_no
source: Westfalen cards not accepted
ta: வெச்ட்ஃபாலன் அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_v_pay_yes
source: V PAY
ta: V ஊதியம்

# poi_payment_v_pay_no
source: V PAY cards not accepted
ta: V ஊதிய அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_dogecoin_yes
source: Dogecoin
ta: டாக் கோயின்

# poi_payment_dogecoin_no
source: Dogecoin not accepted
ta: டாக் கோயின் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_cibus_yes
source: Cibus
ta: உணவு

# poi_payment_cibus_no
source: Cibus cards not accepted
ta: சிபச் அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_wire_transfer_yes
source: Wire transfers
ta: கம்பி இடமாற்றங்கள்

# poi_payment_wire_transfer_no
source: Wire transfers not accepted
ta: கம்பி இடமாற்றங்கள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_ep_cash_yes
source: Cash card (Geldkarte)
ta: பண அட்டை (கெல்ட்கார்ட்டே)

# poi_payment_ep_cash_no
source: Cash card (Geldkarte) not accepted
ta: பண அட்டை (கெல்ட்கார்ட்டே) ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_ep_proton_yes
source: Proton
ta: நேர்முன்னி

# poi_payment_ep_proton_no
source: Proton cards not accepted
ta: புரோட்டான் அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_ep_avant_yes
source: AvantCard
ta: அவாண்ட்கார்டு

# poi_payment_ep_avant_no
source: AvantCard not accepted
ta: அவாண்ட்கார்டு ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_ep_mep_no
source: MEP not accepted
ta: MEP ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_ep_minipay_yes
source: Minipay
ta: மினிபே

# poi_payment_ep_minipay_no
source: Minipay not accepted
ta: மினிபே ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_ep_minicash_yes
source: MiniCash
ta: மினிகாச்

# poi_payment_ep_minicash_no
source: MiniCash not accepted
ta: மினிகாச் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_ep_moneo_yes
source: Moneo
ta: எச்சரிக்கை

# poi_payment_ep_moneo_no
source: Moneo not accepted
ta: மோனியோ ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_ep_monedero4b_yes
source: Monedero 4B
ta: Mnedero Bb

# poi_payment_ep_monedero4b_no
source: Monedero 4B not accepted
ta: மோனெடெரோ 4 பி ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_ep_monedero_yes
source: Monedero
ta: பர்ச்

# poi_payment_ep_monedero_no
source: Monedero not accepted
ta: மோனெடெரோ ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_bankaxess_yes
source: BankAxess
ta: பாங்க்ஆக்செச்

# poi_payment_bankaxess_no
source: BankAxess not accepted
ta: பாங்க்ஆக்செச் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_coinkite_yes
source: Coinkite
ta: வேலை

# poi_payment_coinkite_no
source: Coinkite not accepted
ta: COINKITE ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_roadrunner_yes
source: Roadrunner
ta: ரோட்ரன்னர்

# poi_payment_roadrunner_no
source: Roadrunner cards not accepted
ta: ரோட்ரன்னர் அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_svg_yes
source: SVG
ta: எச்.வி.சி.

# poi_payment_svg_no
source: SVG not accepted
ta: எச்.வி.சி ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_sms_yes
source: SMS payments
ta: எச்எம்எச் கொடுப்பனவுகள்

# poi_payment_sms_no
source: SMS payments not accepted
ta: எச்எம்எச் கொடுப்பனவுகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_ov_chipkaart_yes
source: OV-Chipkaart
ta: OV சிப் அட்டை

# poi_payment_ov_chipkaart_no
source: OV-Chipkaart not accepted
ta: OV சிப் அட்டை ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_oyster_yes
source: Oyster
ta: சிப்பி

# poi_payment_oyster_no
source: Oyster cards not accepted
ta: சிப்பி அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_sube_yes
source: SUBE
ta: மேலே செல்லுங்கள்

# poi_payment_sube_no
source: SUBE cards not accepted
ta: சப் கார்டுகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_via_verde_yes
source: Via Verde
ta: பச்சை

# poi_payment_via_verde_no
source: Via Verde not accepted
ta: வெர்டே வழியாக ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_meal_voucher_yes
source: Meal vouchers
ta: உணவு வவுச்சர்கள்

# poi_payment_meal_voucher_no
source: Meal vouchers not accepted
ta: உணவு வவுச்சர்கள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_paypal_yes
source: PayPal
ta: பேபால்

# poi_payment_paypal_no
source: PayPal not accepted
ta: பேபால் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_u_key_yes
source: U-Key
ta: யு-கீ

# poi_payment_u_key_no
source: U-Key not accepted
ta: யு-கீ ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_token_yes
source: Tokens
ta: டோக்கன்கள்

# poi_payment_token_no
source: Tokens not accepted
ta: டோக்கன்கள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_gift_card_yes
source: Gift cards
ta: பரிசு அட்டைகள்

# poi_payment_gift_card_no
source: Gift cards not accepted
ta: பரிசு அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_golden_crown_yes
source: Golden Crown
ta: தங்க கிரீடம்

# poi_payment_golden_crown_no
source: Golden Crown cards not accepted
ta: கோல்டன் கிரவுன் கார்டுகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_pro100_no
source: PRO100 cards not accepted
ta: Pro100 அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_union_card_yes
source: Union Card
ta: யூனியன் அட்டை

# poi_payment_union_card_no
source: Union Card not accepted
ta: யூனியன் அட்டை ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_mtsmoney_yes
source: MTS-Money
ta: MTS- பணம்

# poi_payment_mtsmoney_no
source: MTS-Money not accepted
ta: எம்.டி.எச்-பணம் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_yandexmoney_no
source: Yandex.Money not accepted
ta: Yandex.money ஏற்றுக்கொள்ளப்படவில்லை

# poi_description_payment
source: Payment description
ta: கட்டண விளக்கம்

# poi_events_venue
source: Events venue
ta: நிகழ்வுகள் இடம்

# poi_diet_vegetarian_filter_yes
source: Vegetarian
ta: மரக்கறி

# poi_diet_vegetarian_few
source: Vegetarian (few)
ta: மரக்கறி (சில)

# poi_diet_vegetarian_only
source: Vegetarian only
ta: மரக்கறி மட்டுமே

# poi_diet_vegetarian_yes
source: Vegetarian
ta: மரக்கறி

# poi_diet_vegetarian_no
source: Vegetarian diet: no
ta: சைவ உணவு: இல்லை

# poi_diet_vegan_filter_yes
source: Vegan
ta: சைவ உணவு

# poi_diet_vegan_only
source: Vegan only
ta: சைவ உணவு மட்டுமே

# poi_diet_vegan_yes
source: Vegan
ta: சைவ உணவு

# poi_diet_vegan_no
source: Vegan diet: no
ta: சைவ உணவு: இல்லை

# poi_diet_gluten_free_filter_yes
source: Gluten free
ta: பசையம் இல்லாதது

# poi_diet_gluten_free_only
source: Gluten-free only
ta: பசையம் இல்லாதது மட்டுமே

# poi_diet_gluten_free_yes
source: Gluten-free
ta: பசையம் இல்லாதது

# poi_diet_gluten_free_no
source: Gluten-free diet: no
ta: பசையம் இல்லாத உணவு: இல்லை

# poi_diet_kosher_filter_yes
source: Kosher
ta: கோசர்

# poi_diet_kosher_only
source: Kosher only
ta: கோசர் மட்டுமே

# poi_diet_kosher_yes
source: Kosher
ta: கோசர்

# poi_diet_kosher_no
source: Kosher diet: no
ta: கோசர் உணவு: இல்லை

# poi_diet_halal_filter_yes
source: Halal
ta: ஆலால்

# poi_diet_halal_only
source: Halal only
ta: அலால் மட்டும்

# poi_diet_halal_yes
source: Halal
ta: ஆலால்

# poi_diet_halal_no
source: Halal diet: no
ta: அலால் உணவு: இல்லை

# poi_diet_lactose_free_filter_yes
source: Lactose free
ta: லாக்டோச் இலவசம்

# poi_diet_lactose_free_only
source: Lactose-free only
ta: லாக்டோச் இல்லாதது மட்டுமே

# poi_diet_lactose_free_yes
source: Lactose-free
ta: லாக்டோச் இல்லாதது

# poi_diet_lactose_free_no
source: Lactose-free diet: no
ta: லாக்டோச் இல்லாத உணவு: இல்லை

# poi_diet_pescetarian_yes
source: Pescetarian
ta: பெசெட்டேரியன்

# poi_drive_in_yes
source: Yes;Drive-in
ta: ஆம்; டிரைவ்-இன்

# poi_drive_in_no
source: Drive-in: no
ta: டிரைவ்-இன்: இல்லை

# poi_drive_through_yes
source: Yes;Drive through
ta: ஆம்; ஓட்டுங்கள்

# poi_drive_through_no
source: Drive-through: no
ta: டிரைவ்-த்ரூ: இல்லை

# poi_brewery_additional
source: Brewery name
ta: மதுபானம் பெயர்

# poi_microbrewery_yes
source: Yes;Microbrewery
ta: ஆம்; மைக்ரோ ப்ரூரி

# poi_microbrewery_no
source: No microbrewery
ta: மைக்ரோ ப்ரூரி இல்லை

# poi_takeaway_filter_yes
source: Yes;Takeaway
ta: ஆம்; டேக்அவே

# poi_takeaway_yes
source: Takeaway
ta: டேக்அவே

# poi_takeaway_no
source: No takeaway
ta: இல்லை

# poi_takeaway_only
source: Takeaway only
ta: டேக்அவே மட்டுமே

# poi_delivery_filter_yes
source: Yes;Delivery
ta: ஆம்; மகப்பேறு

# poi_delivery_yes
source: Delivery
ta: வழங்கு

# poi_delivery_no
source: No delivery
ta: டெலிவரி இல்லை

# poi_delivery_only
source: Delivery only
ta: டெலிவரி மட்டுமே

# poi_outdoor_seating_filter_yes
source: Yes;Outdoor seating
ta: ஆம்; வெளிப்புற இருக்கை

# poi_outdoor_seating_yes
source: Outdoor seating: yes
ta: வெளிப்புற இருக்கை: ஆம்

# poi_outdoor_seating_no
source: No outdoor seating
ta: வெளிப்புற இருக்கை இல்லை

# poi_outdoor_seating_terrace
source: Outdoor seating: terrace
ta: வெளிப்புற இருக்கை: மொட்டை மாடி

# poi_outdoor_seating_sidewalk
source: Outdoor seating: sidewalk
ta: வெளிப்புற இருக்கை: நடைபாதை

# poi_outdoor_seating_pedestrian_zone
source: Outdoor seating: pedestrian zone
ta: வெளிப்புற இருக்கை: பாதசாரி மண்டலம்

# poi_outdoor_seating_garden
source: Outdoor seating: garden
ta: வெளிப்புற இருக்கை: தோட்டம்

# poi_outdoor_seating_patio
source: Outdoor seating: patio
ta: வெளிப்புற இருக்கை: உள் முற்றம்

# poi_indoor_seating_yes
source: Indoor seating: yes
ta: உட்புற இருக்கை: ஆம்

# poi_indoor_seating_no
source: No indoor seating
ta: உட்புற இருக்கை இல்லை

# poi_indoor_seating_bar_table
source: Indoor seating: bar table
ta: உட்புற இருக்கை: பார் அட்டவணை

# poi_cocktails_yes
source: Yes;Cocktails
ta: ஆம்; காக்டெய்ல்

# poi_second_hand_yes
source: Yes
ta: ஆம்

# poi_second_hand_no
source: No second-hand goods
ta: இரண்டாவது கை பொருட்கள் இல்லை

# poi_second_hand_only
source: Only
ta: மட்டும்

# poi_service_parts
source: Parts
ta: பாகங்கள்

# poi_service_dealer
source: Dealer
ta: வணிகர்

# poi_service_repair
source: Repair
ta: பழுது

# poi_service_repair_no
source: No repair
ta: பழுது இல்லை

# poi_service_electrical
source: Repair of electrical vehicles
ta: மின் வாகனங்களை சரிசெய்தல்

# poi_motorcycle_repair
source: Motorcycle repair
ta: மின்னோடி சைக்கிள் பழுது

# poi_self_service_yes
source: Yes;Self service
ta: ஆம்; தன்வய பணி

# poi_self_service_no
source: No;No self service
ta: இல்லை; தன்வய பணி இல்லை

# poi_automated_yes
source: Yes;Automated
ta: ஆம்; தானியங்கி

# poi_automated_no
source: Not automated
ta: தானியங்கி இல்லை

# poi_full_service_yes
source: Full service
ta: முழு பணி

# poi_brushless_yes
source: Yes;Brushless
ta: ஆம்; தூரிகை இல்லாதது

# poi_brushless_no
source: Brushless: no
ta: தூரிகை: இல்லை

# poi_car_wash_no
source: No;Car wash: no
ta: இல்லை; கார் கழுவுதல்: இல்லை

# poi_public_bath
source: Public bath
ta: பொது குளியல்

# poi_male_yes
source: Male
ta: ஆண்

# poi_male_no
source: Forbidden for men
ta: ஆண்களுக்கு தடைசெய்யப்பட்டுள்ளது

# poi_female_yes
source: Female
ta: பெண்

# poi_female_no
source: Forbidden for female
ta: பெண்ணுக்கு தடைசெய்யப்பட்டுள்ளது

# poi_indoor_yes
source: Indoor
ta: உட்புறம்

# poi_indoor_no
source: Outdoor
ta: வெளிப்புறம்

# poi_toilets_yes
source: Yes;Toilets
ta: ஆம்; கழிப்பறைகள்

# poi_toilets_no
source: Without toilets
ta: கழிப்பறைகள் இல்லாமல்

# poi_toilets_wheelchair_yes
source: Access to the toilets for wheelchairs: yes
ta: சக்கர நாற்காலிகளுக்கான கழிப்பறைகளுக்கான அணுகல்: ஆம்

# poi_toilets_wheelchair_no
source: Access to the toilets for wheelchairs: no
ta: சக்கர நாற்காலிகளுக்கான கழிப்பறைகளுக்கான அணுகல்: இல்லை

# poi_toilets_access_customers
source: Toilets access: customers
ta: கழிப்பறைகள் அணுகல்: வாடிக்கையாளர்கள்

# poi_toilets_access_permissive
source: Toilets access: permissive
ta: கழிப்பறைகள் அணுகல்: இசைவு

# poi_toilets_access_community
source: Toilets access: community
ta: கழிப்பறைகள் அணுகல்: சமூகம்

# poi_toilets_access_public
source: Toilets access: public
ta: கழிப்பறைகள் அணுகல்: பொது

# poi_diaper_table_count
source: Diaper table count
ta: டயபர் அட்டவணை எண்ணிக்கை

# poi_diaper_yes
source: Diaper changing table
ta: டயபர் மாற்றும் அட்டவணை

# poi_diaper_no
source: No diaper changing table
ta: டயபர் மாறும் அட்டவணை இல்லை

# poi_diaper_room
source: Diaper changing room
ta: டயபர் மாறும் அறை

# poi_maxstay
source: Parking time limit
ta: பார்க்கிங் நேர வரம்பு

# poi_vending_parking_tickets
source: Parking tickets
ta: பார்க்கிங் டிக்கெட்

# poi_vending_cigarettes
source: Cigarettes
ta: சிகரெட்டுகள்

# poi_vending_excrement_bags
source: Excrement bags
ta: வெளியேற்ற பைகள்

# poi_vending_public_transport_tickets
source: Public transport tickets
ta: பொது போக்குவரத்து டிக்கெட்

# poi_vending_drinks
source: Drinks
ta: பானங்கள்

# poi_vending_sweets
source: Sweets
ta: இனிப்புகள்

# poi_vending_parcel_pickup_mail_in
source: Parcel pickup and mail in
ta: பார்சல் இடும் மற்றும் அஞ்சல்

# poi_vending_condoms
source: Condoms
ta: ஆணுறைகள்

# poi_vending_stamps
source: Stamps
ta: முத்திரைகள்

# poi_vending_bicycle_tube
source: Bicycle tubes
ta: சைக்கிள் குழாய்கள்

# poi_vending_food
source: Food
ta: உணவு

# poi_vending_drinks_food
source: Drinks and food
ta: பானங்கள் மற்றும் உணவு

# poi_vending_fuel
source: Fuel vending
ta: எரிபொருள் விற்பனை

# poi_vending_parcel_pickup
source: Parcel pickup
ta: பார்சல் இடும்

# poi_vending_parcel_mail_in
source: Parcel mail-in
ta: பார்சல் மெயில்-இன்

# poi_vending_milk
source: Milk
ta: பால்

# poi_vending_elongated_coin
source: Elongated coin
ta: நீளமான நாணயம்

# poi_vending_bread
source: Bread
ta: ரொட்டி

# poi_vending_chewing_gums
source: Chewing gums
ta: மெல்லும் ஈறுகள்

# poi_vending_parking_tickets_public_transport_tickets
source: Parking tickets; public transport tickets
ta: பார்க்கிங் டிக்கெட்; பொது போக்குவரத்து டிக்கெட்

# poi_vending_coffee
source: Coffee
ta: காபி

# poi_vending_toll
source: Toll vending
ta: கட்டண விற்பனை

# poi_vending_tickets
source: Tickets vending
ta: டிக்கெட் விற்பனை

# poi_vending_water
source: Water vending
ta: நீர் விற்பனை

# poi_vending_telephone_vouchers
source: Telephone vouchers
ta: தொலைபேசி வவுச்சர்கள்

# poi_vending_animal_food
source: Animal food
ta: விலங்கு உணவு

# poi_vending_public_transport_plans
source: Public transport plans
ta: பொது போக்குவரத்து திட்டங்கள்

# poi_vending_drinks_sweets
source: Drinks and sweets
ta: பானங்கள் மற்றும் இனிப்புகள்

# poi_vending_vouchers
source: Vouchers
ta: வவுச்சர்கள்

# poi_vending_dvd
source: DVD
ta: டிவிடி

# poi_vending_candles
source: Candles
ta: மெழுகுவர்த்திகள்

# poi_vending_toys
source: Toys
ta: பொம்மைகள்

# poi_vending_ice_cream
source: Ice cream
ta: ஐச்கிரீம்

# poi_vending_sim_cards
source: SIM-cards
ta: சிம்-கார்டுகள்

# poi_branch
source: Branch
ta: கிளை

# poi_memorial_war
source: War memorial
ta: போர் நினைவு

# poi_memorial_plaque
source: Plaque
ta: தகடு

# poi_memorial_statue
source: Statue
ta: சிலை

# poi_memorial_stone
source: Stone
ta: கல்

# poi_memorial_stele
source: Stele
ta: ச்டீல்

# poi_memorial_bust
source: Bust
ta: மார்பளவு

# poi_memorial_koshinto
source: Koshinto
ta: ஏரி இதயத்துடன்

# poi_memorial_blue_plaque
source: Blue plaque
ta: நீல தகடு

# poi_memorial_jizo
source: Jizo
ta: சிசோ

# poi_memorial_cross
source: Cross-shape
ta: குறுக்கு வடிவம்

# poi_memorial_vehicle
source: Vehicle
ta: வண்டி

# poi_memorial_stolperstein
source: Stolperstein
ta: தடுமாறும்

# poi_memorial_obelisk
source: Obelisk
ta: ஒபெலிச்க்

# poi_memorial_column
source: Column
ta: நெடுவரிசை

# poi_memorial_stupa
source: Stupa
ta: ச்தூபம்

# poi_memorial_prasat
source: Prasat
ta: பன்றி

# poi_memorial_fassade_decoration
source: Facade decoration
ta: முகப்பில் ஒப்பனை

# poi_inscription
source: Inscription
ta: கல்வெட்டு

# poi_historic_quarry
source: Historic quarry
ta: வரலாற்று குவாரி

# poi_resource_aggregate
source: Aggregate
ta: மொத்தம்

# poi_resource_antimony
source: Antimony
ta: கருநிமிளை

# poi_resource_asbestos
source: Asbestos
ta: கல்நார்

# poi_resource_barite
source: Barite
ta: பிரைட்

# poi_resource_basalt
source: Basalt
ta: பாசால்ட்

# poi_resource_bauxite
source: Bauxite
ta: பாக்சைட்

# poi_resource_beryl
source: Beryl
ta: வருணப்பாறை

# poi_resource_bismuth
source: Bismuth
ta: நிமிளை

# poi_resource_chromite
source: Chromite
ta: குரோமைட்

# poi_resource_clay
source: Clay
ta: களிமண்

# poi_resource_coal
source: Coal
ta: நிலக்கரி

# poi_resource_copper
source: Copper
ta: செம்பு, செப்பு, தாமிரம்

# poi_resource_diamond
source: Diamond
ta: வைர

# poi_resource_dimension_stone
source: Dimension stone
ta: பரிமாண கல்

# poi_resource_dolomite
source: Dolomite
ta: டோலமைட்

# poi_resource_gas
source: Gas
ta: வளிமம்
