Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_southern_baptist_church
source: Southern baptist church
ta: தெற்கு பாப்டிச்ட் சர்ச்

# poi_congregational_church
source: Congregational church
ta: அவை தேவாலயம்

# poi_spiritist_church
source: Spiritist church
ta: ஆவி சர்ச்

# poi_christian_church
source: Christian church
ta: கிறிச்தவ தேவாலயம்

# poi_financial_advisor
source: Financial advisor
ta: பொருள் ஆலோசகர்

# poi_security
source: Security office
ta: பாதுகாப்பு அலுவலகம்

# poi_construction_company
source: Construction company
ta: கட்டுமான நிறுவனம்

# poi_union
source: Union office
ta: யூனியன் அலுவலகம்

# poi_office_charity
source: Charity office
ta: தொண்டு அலுவலகம்

# poi_courier
source: Courier office
ta: கூரியர் அலுவலகம்

# poi_moving_company
source: Moving company
ta: நகரும் நிறுவனம்

# poi_surveyor
source: Surveyor office
ta: சர்வேயர் அலுவலகம்

# poi_graphic_design
source: Graphic design office
ta: கிராஃபிக் வடிவமைப்பு அலுவலகம்

# poi_office_university
source: University office
ta: பல்கலைக்கழக அலுவலகம்

# poi_transport
source: Transport office
ta: போக்குவரத்து அலுவலகம்

# poi_harbour_master
source: Harbour master
ta: துறைமுக மாச்டர்

# poi_bail_bond_agent
source: Bail bond agent
ta: பிணை பத்திர முகவர்

# poi_translator
source: Translator
ta: மொழிபெயர்

# poi_private_investigator
source: Private investigator
ta: தனியார் புலனாய்வாளர்

# poi_visa
source: Visa
ta: இசைவு

# poi_interior_design
source: Interior design
ta: உள்துறை வடிவமைப்பு

# poi_chamber
source: Chamber
ta: அறை

# poi_tutoring
source: Tutoring
ta: பயிற்சி

# poi_politician
source: Politician office
ta: அரசியல்வாதி அலுவலகம்

# poi_adoption_agency
source: Adoption agency
ta: தத்தெடுப்பு நிறுவனம்

# poi_international_organization
source: International organization
ta: பன்னாட்டு அமைப்பு

# poi_airline
source: Airline office
ta: விமான அலுவலகம்

# poi_route_point_category
source: Travel category
ta: பயண வகை
