Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_socket_tesla_supercharger_yes
source: Tesla Supercharger
ta: டெச்லா சூப்பர்சார்சர்

# poi_socket_tesla_roadster_yes
source: Tesla Roadster
ta: டெச்லா ரோட்ச்டர்

# poi_socket_nema_5_15_yes
source: NEMA 5-15R
ta: இல்லை 5-15 ஆர்

# poi_socket_nema_5_20_yes
source: NEMA 5-20
ta: இல்லை 5-20

# poi_socket_nema_14_30_yes
source: NEMA 14-30
ta: இல்லை 14-30

# poi_socket_nema_14_50_yes
source: NEMA 14-50
ta: இல்லை 14-50

# poi_socket_schuko_yes
source: Schuko
ta: சுகோ

# poi_socket_bs1363_yes
source: BS 1363
ta: பிஎச் 1363

# poi_socket_chademo_output_high
source: High
ta: உயர்ந்த

# poi_socket_chademo_output_medium
source: Medium
ta: சராசரி

# poi_socket_chademo_output_low
source: Low
ta: குறைந்த

# poi_socket_type2_output_high
source: High
ta: உயர்ந்த

# poi_socket_type2_output_medium
source: Medium
ta: சராசரி

# poi_socket_type2_output_low
source: Low
ta: குறைந்த

# poi_socket_type2_combo_output_high
source: High
ta: உயர்ந்த

# poi_socket_type2_combo_output_medium
source: Medium
ta: சராசரி

# poi_socket_type2_combo_output_low
source: Low
ta: குறைந்த

# poi_socket_type3_output_high
source: High
ta: உயர்ந்த

# poi_socket_type3_output_medium
source: Medium
ta: சராசரி

# poi_socket_type3_output_low
source: Low
ta: குறைந்த

# poi_socket_cee_blue_output_high
source: High
ta: உயர்ந்த

# poi_socket_cee_blue_output_medium
source: Medium
ta: சராசரி

# poi_socket_cee_blue_output_low
source: Low
ta: குறைந்த

# poi_socket_schuko_output_high
source: High
ta: உயர்ந்த

# poi_socket_schuko_output_medium
source: Medium
ta: சராசரி

# poi_socket_schuko_output_low
source: Low
ta: குறைந்த

# poi_socket_type2_cable_output_high
source: High
ta: உயர்ந்த

# poi_socket_type2_cable_output_medium
source: Medium
ta: சராசரி

# poi_socket_type2_cable_output_low
source: Low
ta: குறைந்த

# poi_socket_type3a_output_high
source: High
ta: உயர்ந்த

# poi_socket_type3a_output_medium
source: Medium
ta: சராசரி

# poi_socket_type3a_output_low
source: Low
ta: குறைந்த

# poi_socket_type3c_output_high
source: High
ta: உயர்ந்த

# poi_socket_type3c_output_medium
source: Medium
ta: சராசரி

# poi_socket_type3c_output_low
source: Low
ta: குறைந்த

# poi_socket_typee_output_high
source: High
ta: உயர்ந்த

# poi_socket_typee_output_medium
source: Medium
ta: சராசரி

# poi_socket_typee_output_low
source: Low
ta: குறைந்த

# poi_socket_cee_blue_voltage
source: Socket: CEE blue: voltage
ta: சாக்கெட்: சீ நீலம்: மின்னழுத்தம்

# poi_socket_cee_red_16a_voltage
source: Socket: CEE red 16A: voltage
ta: சாக்கெட்: CEE சிவப்பு 16A: மின்னழுத்தம்

# poi_socket_cee_red_32a_voltage
source: Socket: CEE red 32A: voltage
ta: சாக்கெட்: CEE சிவப்பு 32A: மின்னழுத்தம்

# poi_socket_cee_red_63a_voltage
source: Socket: CEE red 63A: voltage
ta: சாக்கெட்: CEE சிவப்பு 63A: மின்னழுத்தம்

# poi_socket_cee_red_125a_voltage
source: Socket: CEE red 125A: voltage
ta: சாக்கெட்: CEE சிவப்பு 125A: மின்னழுத்தம்

# poi_socket_type1_voltage
source: Socket: Type 1: voltage
ta: சாக்கெட்: வகை 1: மின்னழுத்தம்

# poi_socket_type1_combo_voltage
source: Socket: Type 1 combo: voltage
ta: சாக்கெட்: வகை 1 காம்போ: மின்னழுத்தம்

# poi_socket_type2_voltage
source: Socket: Type 2: voltage
ta: சாக்கெட்: வகை 2: மின்னழுத்தம்

# poi_socket_type2_combo_voltage
source: Socket: Type 2 combo: voltage
ta: சாக்கெட்: வகை 2 காம்போ: மின்னழுத்தம்

# poi_socket_type3a_voltage
source: Socket: Type 3a: voltage
ta: சாக்கெட்: வகை 3A: மின்னழுத்தம்

# poi_socket_type3c_voltage
source: Socket: Type 3c: voltage
ta: சாக்கெட்: வகை 3 சி: மின்னழுத்தம்

# poi_socket_chademo_voltage
source: Socket: CHAdeMO: voltage
ta: சாக்கெட்: சேடெமோ: மின்னழுத்தம்

# poi_socket_tesla_standard_voltage
source: Socket: Tesla standard: voltage
ta: சாக்கெட்: டெச்லா தரநிலை: மின்னழுத்தம்

# poi_socket_tesla_supercharger_voltage
source: Socket: Tesla Supercharger: voltage
ta: சாக்கெட்: டெச்லா சூப்பர்சார்சர்: மின்னழுத்தம்

# poi_socket_tesla_roadster_voltage
source: Socket: Tesla Roadster: voltage
ta: சாக்கெட்: டெச்லா ரோட்ச்டர்: மின்னழுத்தம்

# poi_socket_nema_5_15_voltage
source: Socket: NEMA 5-15R: voltage
ta: சாக்கெட்: நேமா 5-15R: மின்னழுத்தம்

# poi_socket_nema_5_20_voltage
source: Socket: NEMA 5-20: voltage
ta: சாக்கெட்: நேமா 5-20: மின்னழுத்தம்

# poi_socket_nema_14_30_voltage
source: Socket: NEMA 14-30: voltage
ta: சாக்கெட்: நேமா 14-30: மின்னழுத்தம்

# poi_socket_nema_14_50_voltage
source: Socket: NEMA 14-50: voltage
ta: சாக்கெட்: நேமா 14-50: மின்னழுத்தம்

# poi_socket_schuko_voltage
source: Socket: Schuko: voltage
ta: சாக்கெட்: சுகோ: மின்னழுத்தம்

# poi_socket_bs1363_voltage
source: Socket: BS 1363: voltage
ta: சாக்கெட்: பிஎச் 1363: மின்னழுத்தம்

# poi_socket_as3112_voltage
source: Socket: AS/NZS 3112: voltage
ta: சாக்கெட்: AS/NZS 3112: மின்னழுத்தம்

# poi_socket_chademo_voltage_high
source: High
ta: உயர்ந்த

# poi_socket_chademo_voltage_medium
source: Medium
ta: சராசரி

# poi_socket_chademo_voltage_low
source: Low
ta: குறைந்த

# poi_socket_type2_voltage_high
source: High
ta: உயர்ந்த

# poi_socket_type2_voltage_medium
source: Medium
ta: சராசரி

# poi_socket_type2_voltage_low
source: Low
ta: குறைந்த

# poi_socket_type2_combo_voltage_high
source: High
ta: உயர்ந்த

# poi_socket_type2_combo_voltage_medium
source: Medium
ta: சராசரி

# poi_socket_type2_combo_voltage_low
source: Low
ta: குறைந்த

# poi_socket_type2_cable_voltage_high
source: High
ta: உயர்ந்த

# poi_socket_type2_cable_voltage_medium
source: Medium
ta: சராசரி

# poi_socket_type2_cable_voltage_low
source: Low
ta: குறைந்த

# poi_socket_type3a_voltage_high
source: High
ta: உயர்ந்த

# poi_socket_type3a_voltage_medium
source: Medium
ta: சராசரி

# poi_socket_type3a_voltage_low
source: Low
ta: குறைந்த

# poi_socket_type3c_voltage_high
source: High
ta: உயர்ந்த

# poi_socket_type3c_voltage_medium
source: Medium
ta: சராசரி

# poi_socket_type3c_voltage_low
source: Low
ta: குறைந்த

# poi_socket_cee_blue_voltage_high
source: High
ta: உயர்ந்த

# poi_socket_cee_blue_voltage_medium
source: Medium
ta: சராசரி

# poi_socket_cee_blue_voltage_low
source: Low
ta: குறைந்த

# poi_socket_schuko_voltage_high
source: High
ta: உயர்ந்த

# poi_socket_schuko_voltage_medium
source: Medium
ta: சராசரி

# poi_socket_schuko_voltage_low
source: Low
ta: குறைந்த

# poi_socket_typee_voltage_high
source: High
ta: உயர்ந்த

# poi_socket_typee_voltage_medium
source: Medium
ta: சராசரி

# poi_socket_typee_voltage_low
source: Low
ta: குறைந்த

# poi_car_no
source: Car: no
ta: கார்: இல்லை

# poi_bicycle_yes
source: Bicycle: yes
ta: சைக்கிள்: ஆம்

# poi_bicycle_no
source: Bicycle: no
ta: சைக்கிள்: இல்லை

# poi_scooter_yes
source: Scooter: yes
ta: ச்கூட்டர்: ஆம்

# poi_scooter_no
source: Scooter: no
ta: ச்கூட்டர்: இல்லை

# poi_truck_no
source: Truck: no
ta: டிரக்: இல்லை

# poi_parking_fee_yes
source: Yes
ta: ஆம்

# poi_parking_fee_no
source: No
ta: இல்லை

# poi_parking_fee
source: Parking fee
ta: பார்க்கிங் கட்டணம்

# poi_amperage
source: Amperage
ta: ஆம்பரேச்

# poi_charging_station_output
source: Сharging station output
ta: ச்டேசன் வெளியீடு

# poi_map_type_topo
source: Map type: topo
ta: வரைபட வகை: டோபோ

# poi_map_type_street
source: Map type: street
ta: வரைபட வகை: தெரு

# poi_map_type_scheme
source: Map type: scheme
ta: வரைபட வகை: திட்டம்

# poi_map_type_toposcope
source: Map type: toposcope
ta: வரைபட வகை: டோபோச்கோப்

# poi_map_size_site
source: Map size: site
ta: வரைபட அளவு: தளம்

# poi_map_size_city
source: Map size: city
ta: வரைபட அளவு: நகரம்

# poi_map_size_region
source: Map size: region
ta: வரைபட அளவு: பகுதி

# poi_charging_station
source: Charging station
ta: சார்சிங் நிலையம்

# poi_depot
source: Depot
ta: டிப்போ

# poi_letter_box
source: Letter box
ta: கடிதம் பெட்டி

# poi_post_street
source: Street
ta: தெரு

# poi_post_housenumber
source: Housenumber
ta: அவுச்நம்பர்

# poi_post_flats
source: Flat
ta: கிடைவளைவு

# poi_payment_centre
source: Payment centre
ta: கட்டண நடுவண்

# poi_money_transfer
source: Money transfer
ta: பணமாற்றல்

# poi_ref_post
source: Postcode
ta: அஞ்சல் குறியீடு

# poi_climbing_sport_yes
source: Sport: yes
ta: விளையாட்டு: ஆம்

# poi_climbing_sport_no
source: Sport: no
ta: விளையாட்டு: இல்லை

# poi_climbing_boulder_yes
source: Bouldering: yes
ta: கற்பாறை: ஆம்

# poi_climbing_boulder_no
source: Bouldering: no
ta: கற்பாறை: இல்லை

# poi_climbing_toprope_yes
source: Top rope: yes
ta: மேல் கயிறு: ஆம்

# poi_climbing_toprope_no
source: Top rope: no
ta: மேல் கயிறு: இல்லை

# poi_climbing_trad_yes
source: Traditional: yes
ta: பாரம்பரிய: ஆம்

# poi_climbing_trad_no
source: Traditional: no
ta: பாரம்பரிய: இல்லை

# poi_climbing_multipitch_yes
source: Multi-pitch routes: yes
ta: மல்டி பிட்ச் வழிகள்: ஆம்

# poi_climbing_multipitch_no
source: Multi-pitch routes: no
ta: மல்டி பிட்ச் வழிகள்: இல்லை

# poi_climbing_ice_yes
source: Ice: yes
ta: பனி: ஆம்

# poi_climbing_ice_no
source: Ice: no
ta: பனி: இல்லை

# poi_climbing_mixed_yes
source: Mixed: yes
ta: கலப்பு: ஆம்

# poi_climbing_mixed_no
source: Mixed: no
ta: கலப்பு: இல்லை

# poi_climbing_deepwater_yes
source: Deep-water soloing: yes
ta: ஆழமான நீர் தனிப்பாடல்: ஆம்

# poi_climbing_deepwater_no
source: Deep-water soloing: no
ta: ஆழமான நீர் தனிப்பாடல்: இல்லை

# poi_climbing_length
source: Climbing length
ta: ஏறும் நீளம்

# poi_climbing_length_min
source: Climbing min length
ta: ஏறும் குறைந்தபட்ச நீளம்

# poi_climbing_length_max
source: Climbing max length
ta: அதிகபட்ச நீளம் ஏறும்

# poi_climbing_rock_limestone
source: Climbing rock: limestone
ta: ஏறும் பாறை: சுண்ணாம்பு

# poi_climbing_rock_granite
source: Climbing rock: granite
ta: ஏறும் பாறை: கிரானைட்

# poi_climbing_rock_sandstone
source: Climbing rock: sandstone
ta: ஏறும் பாறை: மணற்கல்

# poi_climbing_rock_quartzite
source: Climbing rock: quartzite
ta: ஏறும் பாறை: குவார்ட்சைட்

# poi_climbing_rock_gneiss
source: Climbing rock: gneiss
ta: ஏறும் பாறை: கெய்ச்

# poi_climbing_rock_gritstone
source: Climbing rock: gritstone
ta: ஏறும் பாறை: கிரிட்ச்டோன்

# poi_climbing_rock_porphyry
source: Climbing rock: porphyry
ta: ஏறும் பாறை: போர்பிரி

# poi_climbing_rock_basalt
source: Climbing rock: basalt
ta: ஏறும் பாறை: பாசால்ட்

# poi_climbing_rock_conglomerate
source: Climbing rock: conglomerate
ta: ஏறும் பாறை: கூட்டு

# poi_climbing_quality_solid
source: Solid
ta: திடமான

# poi_climbing_quality_fragile
source: Fragile
ta: உடையக்கூடியது

# poi_climbing_bolted_yes
source: Fixed anchors: yes
ta: நிலையான நங்கூரங்கள்: ஆம்

# poi_climbing_bolted_no
source: Fixed anchors: no
ta: நிலையான நங்கூரங்கள்: இல்லை

# poi_climbing_orientation_n
source: Orientation of the wall: N
ta: சுவரின் நோக்குநிலை: n

# poi_climbing_orientation_ne
source: Orientation of the wall: NE
ta: சுவரின் நோக்குநிலை: NE

# poi_climbing_orientation_e
source: Orientation of the wall: E
ta: சுவரின் நோக்குநிலை: இ

# poi_climbing_orientation_se
source: Orientation of the wall: SE
ta: சுவரின் நோக்குநிலை: எச்.இ.

# poi_climbing_orientation_s
source: Orientation of the wall: S
ta: சுவரின் நோக்குநிலை: கள்

# poi_climbing_orientation_sw
source: Orientation of the wall: SW
ta: சுவரின் நோக்குநிலை: எச்.டபிள்யூ

# poi_climbing_orientation_w
source: Orientation of the wall: W
ta: சுவரின் நோக்குநிலை: டபிள்யூ

# poi_climbing_orientation_nw
source: Orientation of the wall: NW
ta: சுவரின் நோக்குநிலை: NW

# poi_climbing_summit_log_yes
source: Climbing summit log: yes
ta: ஏறும் உச்சி மாநாடு: ஆம்

# poi_climbing_summit_log_no
source: Climbing summit log: no
ta: ஏறும் உச்சி மாநாடு: இல்லை

# poi_climbing_routes
source: Climbing routes
ta: ஏறும் வழிகள்

# poi_climbing_grade_saxon_min
source: Easiest route (Saxon grade)
ta: எளிதான பாதை (சாக்சன் தரம்)

# poi_climbing_grade_french_min
source: Easiest route (French grade)
ta: எளிதான பாதை (பிரஞ்சு தரம்)

# poi_climbing_grade_uiaa_min
source: Easiest route (UIAA grade)
ta: எளிதான பாதை (UIAA தரம்)

# poi_circumference
source: Circumference
ta: பரிதி

# poi_diameter_crown
source: Diameter of the crown
ta: கிரீடத்தின் விட்டம்

# poi_meadow_agricultural
source: Type: agricultural
ta: வகை: விவசாய

# poi_meadow_perpetual
source: Type: perpetual
ta: வகை: நிரந்தர

# poi_meadow_transitional
source: Type: transitional
ta: வகை: இடைநிலை

# poi_meadow_pasture
source: Type: pasture
ta: வகை: மேய்ச்சல்

# poi_frozen_food
source: Frozen food
ta: உறைந்த உணவு

# poi_agrarian
source: Agricultural store
ta: விவசாய கடை

# poi_shop_fireplace
source: Fireplace store
ta: நெருப்பிடம் கடை

# poi_shop_boat
source: Boat store
ta: படகு கடை

# poi_cannabis
source: Cannabis store
ta: கஞ்சா கடை

# poi_flooring
source: Flooring store
ta: தரையையும் கடை

# poi_pottery
source: Pottery
ta: மட்பாண்டங்கள்

# poi_whitewater_rapid_name
source: Name of the river rapids
ta: ரேபிட்ச் ஆற்றின் பெயர்

# poi_outpost
source: Shop's delivery point
ta: கடையின் விநியோக புள்ளி

# poi_barbecue_grill
source: Barbecue grill: yes
ta: பார்பிக்யூ கிரில்: ஆம்

# poi_water_utility
source: Water utility office
ta: நீர் பயன்பாட்டு அலுவலகம்

# poi_amusement_arcade
source: Amusement arcade
ta: பொழுதுபோக்கு ஆர்கேட்

# poi_adult_gaming_centre
source: Adult gaming centre
ta: அகவை வந்தோர் கேமிங் நடுவண்

# poi_service_vehicle_car_repair_yes
source: Car repair
ta: கார் பழுது

# poi_service_vehicle_oil_change_yes
source: Oil change
ta: எண்ணெய் மாற்றம்

# poi_service_vehicle_used_car_sales_yes
source: Used car sales
ta: பயன்படுத்தப்பட்ட கார் விற்பனை

# poi_service_vehicle_brakes_yes
source: Brakes
ta: பிரேக்குகள்

# poi_service_vehicle_new_car_sales_yes
source: New car sales
ta: புதிய கார் விற்பனை

# poi_service_vehicle_diagnostics_yes
source: Diagnostics
ta: கண்டறிதல்

# poi_service_vehicle_car_parts_yes
source: Car parts
ta: கார் பாகங்கள்

# poi_service_vehicle_batteries_yes
source: Batteries
ta: பேட்டரிகள்

# poi_service_vehicle_air_conditioning_yes
source: Air conditioning
ta: ஏர் கண்டிசனிங்

# poi_service_vehicle_body_repair_yes
source: Body repair
ta: உடல் பழுது

# poi_service_vehicle_electrical_yes
source: Electrical
ta: மின்னியல்

# poi_service_vehicle_wheels_yes
source: Wheels
ta: சக்கரங்கள்

# poi_service_vehicle_glass_yes
source: Glass
ta: கண்ணாடி

# poi_service_vehicle_truck_repair_yes
source: Truck repair
ta: டிரக் பழுது

# poi_service_vehicle_muffler_yes
source: Muffler
ta: மஃப்லர்

# poi_service_vehicle_alignment_yes
source: Alignment
ta: இருப்புவழி

# poi_service_vehicle_transmission_repair_yes
source: Transmission repair
ta: பரிமாற்ற பழுது

# poi_service_vehicle_motor_yes
source: Motor
ta: மின்னோடி

# poi_service_vehicle_insurance_yes
source: Insurance
ta: காப்பீடு

# poi_service_vehicle_tyres_yes
source: Tyres
ta: டயர்கள்

# poi_aerialway_zip_line
source: Zip line
ta: சிப் வரி

# poi_climbing_adventure
source: Climbing adventure
ta: ஏறும் துணிவு

# poi_via_ferrata
source: Via ferrata
ta: ஃபெராட்டா வழியாக

# poi_cable_number
source: Cable number
ta: கேபிள் எண்

# poi_via_ferrata_scale
source: Difficulty
ta: தொல்லை

# poi_glacier_type_icefield
source: Icefield
ta: ஐச்ஃபீல்ட்

# poi_glacier_type_plateau
source: Plateau
ta: பீடபூமி

# poi_glacier_type_valley
source: Valley
ta: பள்ளத்தாக்கு

# poi_glacier_type_outlet
source: Outlet
ta: கடையின்

# poi_glacier_type_tidewater
source: Tidewater
ta: டைட்வாட்டர்

# poi_glacier_type_mountain
source: Mountain
ta: மலை

# poi_glacier_type_hanging
source: Hanging
ta: தொங்கும்

# poi_glacier_type_icefall
source: Icefall
ta: பனிப்பொழிவு

# poi_glacier_type_rock
source: Rock
ta: பாறை

# poi_glacier_type_shelf
source: Shelf
ta: அலமாரி

# poi_glacier_type_remnant
source: Remnant
ta: மீதமுள்ள

# poi_glacier_type_ice_tongue
source: Ice tongue
ta: பனி நாக்கு

# poi_glacier_ele_top
source: Highest point
ta: மிக உயர்ந்த புள்ளி

# poi_glacier_ele_bottom
source: Lowest point
ta: மிகக் குறைந்த புள்ளி

# poi_glacier_slope
source: Average slope
ta: சராசரி சாய்வு

# poi_checkpoint_hiking
source: Hiking checkpoint
ta: ஐக்கிங் சோதனைச் சாவடி

# poi_checkpoint_type_stamp
source: Stamping point
ta: ச்டாம்பிங் புள்ளி

# poi_checkpoint_type_code
source: Code
ta: குறியீடு

# poi_checkpoint_type_notebook
source: Notebook
ta: நோட்புக்

# poi_checkpoint_type_needler
source: Needler
ta: ஊசி

# poi_checkpoint_type_electronic
source: Electronic
ta: மின்னணு

# poi_course
source: Course
ta: பாடநெறி

# poi_rock
source: Rock
ta: பாறை

# poi_end_date
source: End date
ta: இறுதி தேதி

# poi_appliance
source: Appliance store
ta: பயன்பாட்டு கடை

# poi_outcrop
source: Outcrop
ta: வெளியீடு

# poi_payment_contactless_yes
source: Contactless
ta: தொடர்பு இல்லாதது

# poi_payment_contactless_no
source: Contactless not accepted
ta: தொடர்பு இல்லாதது ஏற்றுக்கொள்ளப்படவில்லை

# poi_hazard
source: Hazard
ta: இடர்

# poi_hazard_nuclear
source: Nuclear hazard
ta: அணு இடர்

# poi_hazard_erosion
source: Erosion hazard
ta: அரிப்பு இடர்

# poi_hazard_avalanche
source: Avalanche hazard
ta: பனிச்சரிவு இடர்

# poi_hazard_slippery_road
source: Slippery road
ta: வழுக்கும் சாலை

# poi_hazard_flood
source: Flood hazard
ta: வெள்ள இடர்

# poi_hazard_minefield
source: Minefield
ta: கண்ணிவெடி

# poi_ruins
source: Ruins
ta: இடிபாடுகள்

# poi_license_classes
source: License classes
ta: உரிம வகுப்புகள்

# poi_hill
source: Hill
ta: மலை

# poi_shoe_repair
source: Shoe repair
ta: சூ பழுதுபார்ப்பு

# poi_bulk_purchase_yes
source: Yes;Bulk purchase
ta: ஆம்; மொத்த கொள்முதல்

# poi_bulk_purchase_only
source: Only;Bulk purchase only
ta: மட்டும்; மொத்த கொள்முதல் மட்டும்

# poi_pipeline_substation
source: Pipeline substation
ta: பைப்லைன் துணை மின்நிலையம்

# poi_substation_transmission
source: Transmission
ta: பரவும் முறை

# poi_substation_distribution
source: Distribution
ta: பரவல்

# poi_substation_minor_distribution
source: Minor distribution
ta: சிறிய வழங்கல்

# poi_substation_industrial
source: Industrial
ta: தொழில்

# poi_substation_transition
source: Transition
ta: மாற்றம்

# poi_substation_traction
source: Traction
ta: இழுவை

# poi_substation_converter
source: Converter
ta: மாற்றி

# poi_substation_compensation
source: Compensation
ta: இழப்பீடு/ஈடாக்கம்

# poi_substation_compression
source: Compression
ta: சுருக்க

# poi_substation_measurement
source: Measurement
ta: அளவீட்டு

# poi_substation_valve
source: Valve
ta: ஓரதர்

# poi_substation_valve_group
source: Valve group
ta: வால்வு குழு

# poi_substation_inspection_gauge
source: Inspection gauge
ta: ஆய்வு பாதை

# poi_substation_field_gathering
source: Field gathering
ta: கள சேகரிப்பு

# poi_craft_confectionery
source: Confectionery production
ta: மிட்டாய் விளைவாக்கம்

# poi_shop_wholesale
source: Wholesale store
ta: மொத்த கடை

# poi_laboratory
source: Medical laboratory
ta: மருத்துவ ஆய்வகம்

# poi_blood_donation
source: Blood donation
ta: இரத்த தானம்

# poi_books_comic
source: Comic
ta: காமிக்

# poi_books_antiquarian
source: Antiquarian
ta: பழங்கால

# poi_books_religion
source: Religion
ta: மதம்

# poi_books_academic
source: Academic
ta: கல்வி

# poi_books_children
source: Children
ta: குழந்தைகள்

# poi_toll_gantry
source: Toll gantry
ta: டோல் கேன்ட்ரி

# poi_childcare
source: Childcare
ta: குழந்தை பராமரிப்பு

# poi_denotation_natural_monument
source: Natural monument
ta: இயற்கை நினைவுச்சின்னம்

# poi_denotation_landmark
source: Landmark
ta: மைல்கல்

# poi_park_ride_yes
source: Yes;Park ride
ta: ஆம்; பார்க் சவாரி

# poi_park_ride_train
source: Train
ta: ரயில்

# poi_park_ride_bus
source: Bus
ta: பச்

# poi_park_ride_metro
source: Subway
ta: சுரங்கப்பாதை

# poi_park_ride_hov
source: HOV
ta: ஓவ்

# poi_park_ride_tram
source: Tram
ta: டிராம்

# poi_park_ride_ferry
source: Ferry
ta: படகு

# poi_rtsa_scale_1a
source: 1A
ta: 1 அ

# poi_rtsa_scale_1b
source: 1B
ta: 1 பி

# poi_rtsa_scale_1b_asterisk
source: 1B*
ta: 1 பி *

# poi_rtsa_scale_2a
source: 2A
ta: ஏதேனும்

# poi_rtsa_scale_2a_asterisk
source: 2A*
ta: எந்த*

# poi_rtsa_scale_2b
source: 2B
ta: அப்பா

# poi_rtsa_scale_2b_asterisk
source: 2B*
ta: அப்பா*

# poi_rtsa_scale_3a
source: 3A
ta: க்கு

# poi_rtsa_scale_3a_asterisk
source: 3A*
ta: 3 அ

# poi_rtsa_scale_3b
source: 3B
ta: Zb

# poi_rtsa_scale_3b_asterisk
source: 3B*
ta: 3 பி

# poi_flare
source: Gas flare;Flare stack
ta: காற்று விரிவடைதல்; விரிவடைய அடுக்கு

# poi_change_delete
source: Deleted object
ta: நீக்கப்பட்ட பொருள்

# poi_rescue_box
source: Rescue box
ta: மீட்பு பெட்டி

# poi_hazard_additional_erosion
source: Hazard: erosion
ta: ஆபத்து: அரிப்பு

# poi_hazard_additional_falling_rocks
source: Hazard: rockfall
ta: ஆபத்து: ராக்ஃபால்

# poi_hazard_additional_nuclear
source: Hazard: nuclear
ta: ஆபத்து: அணு

# poi_hazard_additional_flood
source: Hazard: flood
ta: ஆபத்து: வெள்ளம்

# poi_hazard_additional_avalanche
source: Hazard: avalanche
ta: ஆபத்து: பனிச்சரிவு

# poi_hazard_additional_minefield
source: Hazard: minefield
ta: ஆபத்து: கண்ணிவெடி

# poi_hazard_additional_contamination
source: Hazard: contamination
ta: ஆபத்து: மாசு

# poi_defibrillator_location
source: Location
ta: இடம்

# poi_changing_table_yes
source: Yes;Changing table: yes
ta: ஆம்; அட்டவணையை மாற்றுதல்: ஆம்

# poi_changing_table_no
source: No;Changing table: no
ta: இல்லை; மாற்றும் அட்டவணை: இல்லை

# poi_changing_table_limited
source: Limited;Changing table: limited
ta: வரையறுக்கப்பட்ட; மாற்றும் அட்டவணை: வரையறுக்கப்பட்டுள்ளது

# poi_changing_table_location_room
source: Changing table location: room
ta: அட்டவணையை மாற்றும் இடம்: அறை

# poi_changing_table_location_male_toilet
source: Changing table location: male toilet
ta: அட்டவணையை மாற்றுதல் இடம்: ஆண் கழிப்பறை

# poi_changing_table_location_female_toilet
source: Changing table location: female toilet
ta: அட்டவணையை மாற்றுதல் இடம்: பெண் கழிப்பறை

# poi_changing_table_location_unisex_toilet
source: Changing table location: unisex toilet
ta: அட்டவணையை மாற்றுதல் இடம்: யுனிசெக்ச் கழிப்பறை

# poi_changing_table_count
source: Changing table count
ta: அட்டவணை எண்ணிக்கையை மாற்றுதல்

# poi_changing_table_fee_yes
source: Changing table fee: yes
ta: அட்டவணை கட்டணத்தை மாற்றுதல்: ஆம்

# poi_changing_table_fee_no
source: Changing table fee: no
ta: அட்டவணை கட்டணத்தை மாற்றுதல்: இல்லை

# poi_charcoal_pile
source: Charcoal pile
ta: கரி குவியல்

# poi_hookah_lounge
source: Hookah lounge
ta: ஊக்கா லவுஞ்ச்

# poi_taxi_office
source: Taxi office
ta: டாக்சி அலுவலகம்

# poi_vehicle_yes
source: Vehicle access: yes
ta: வாகன அணுகல்: ஆம்

# poi_vehicle_private
source: Vehicle access: private
ta: வாகன அணுகல்: தனியார்

# poi_vehicle_no
source: Vehicle access: no
ta: வாகன அணுகல்: இல்லை

# poi_vehicle_destination
source: Vehicle access: destination
ta: வாகன அணுகல்: இலக்கு

# poi_vehicle_permissive
source: Vehicle access: permissive
ta: வாகன அணுகல்: இசைவு

# poi_vehicle_customers
source: Vehicle access: customers
ta: வாகன அணுகல்: வாடிக்கையாளர்கள்

# poi_vehicle_military
source: Vehicle access: military
ta: வாகன அணுகல்: தரைப்படை

# poi_vehicle_delivery
source: Vehicle access: delivery
ta: வாகன அணுகல்: டெலிவரி

# poi_vehicle_forestry
source: Vehicle access: forestry
ta: வாகன அணுகல்: வனவியல்

# poi_motorcar_yes
source: Yes;Motorcar
ta: ஆம்; மின்னோடி கார்

# poi_motorcar_private
source: Motorcar access: private
ta: மின்னோடி கார் அணுகல்: தனியார்

# poi_motorcar_no
source: Motorcar access: no
ta: மின்னோடி கார் அணுகல்: இல்லை

# poi_motorcar_destination
source: Motorcar access: destination
ta: மின்னோடி கார் அணுகல்: இலக்கு

# poi_motorcar_permissive
source: Motorcar access: permissive
ta: மின்னோடி கார் அணுகல்: இசைவு

# poi_motorcar_customers
source: Motorcar access: customers
ta: மின்னோடி கார் அணுகல்: வாடிக்கையாளர்கள்

# poi_motorcar_forestry
source: Motorcar access: forestry
ta: மின்னோடி கார் அணுகல்: வனவியல்

# poi_motor_vehicle_yes
source: Motor vehicle access: yes
ta: மின்னோடி வாகன அணுகல்: ஆம்

# poi_motor_vehicle_private
source: Motor vehicle access: private
ta: மின்னோடி வாகன அணுகல்: தனியார்

# poi_motor_vehicle_no
source: Motor vehicle access: no
ta: மின்னோடி வாகன அணுகல்: இல்லை

# poi_motor_vehicle_destination
source: Motor vehicle access: destination
ta: மின்னோடி வாகன அணுகல்: இலக்கு

# poi_motor_vehicle_permissive
source: Motor vehicle access: permissive
ta: மின்னோடி வாகன அணுகல்: இசைவு

# poi_motor_vehicle_customers
source: Motor vehicle access: customers
ta: மின்னோடி வாகன அணுகல்: வாடிக்கையாளர்கள்
