Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_resource_gold
source: Gold
ta: தங்கம்

# poi_resource_graphite
source: Graphite
ta: காரீயம், எழுதுகரி

# poi_resource_gravel
source: Gravel
ta: சரளை

# poi_resource_gypsum
source: Gypsum
ta: சிப்சம்

# poi_resource_iron_ore
source: Iron ore
ta: இரும்பு தாது

# poi_resource_lead
source: Lead
ta: ஈயம்

# poi_resource_lignite
source: Lignite
ta: பழுப்பு நிலக்கரி

# poi_resource_limestone
source: Limestone
ta: சுண்ணாம்புக்கல்

# poi_resource_marble
source: Marble
ta: பளிங்கு

# poi_resource_mercury
source: Mercury
ta: அறிவன்

# poi_resource_mica
source: Mica
ta: மைக்கா

# poi_resource_mineral_oil
source: Mineral oil
ta: கனிம எண்ணெய்

# poi_resource_nickel
source: Nickel
ta: வன்வெள்ளி

# poi_resource_oil
source: Oil
ta: எண்ணெய்

# poi_resource_opal
source: Opal
ta: ஓபல்

# poi_resource_peat
source: Peat
ta: கரி

# poi_resource_platinum
source: Platinum
ta: வெண்தங்கம்

# poi_resource_radium
source: Radium
ta: கருகன்

# poi_resource_ruby
source: Ruby
ta: ரூபி

# poi_resource_salt
source: Salt
ta: உப்பு

# poi_resource_sand
source: Sand
ta: மணல்

# poi_resource_sandstone
source: Sandstone
ta: மணற்கல்

# poi_resource_silica
source: Silica
ta: மணல்மம்

# poi_resource_silver
source: Silver
ta: வெள்ளி

# poi_resource_slate_iron_ore_copper
source: Slate;iron ore;copper
ta: ச்லேட்; இரும்பு தாது; தாமிரம்

# poi_resource_slate
source: Slate
ta: ச்லேட்

# poi_resource_stone
source: Stone
ta: கல்

# poi_resource_tin
source: Tin
ta: வெள்ளீயம்

# poi_resource_tuff
source: Tuff
ta: டஃப்

# poi_resource_uranium
source: Uranium
ta: அடரியம்

# poi_resource_vanadium
source: Vanadium
ta: பழீயம்

# poi_resource_water
source: Water
ta: நீர்

# poi_resource_zinc
source: Zinc
ta: நாகம்

# poi_resource_zircon
source: Zircon
ta: சிர்கன்

# poi_wetland_wet_meadow
source: Wet meadow
ta: ஈரமான புல்வெளி

# poi_wetland_bog
source: Bog
ta: போக்

# poi_wetland_marsh
source: Marsh
ta: சேற்றுத்தரை

# poi_wetland_reedbed
source: Reedbed
ta: ரீடெட்

# poi_wetland_swamp
source: Swamp
ta: சதுப்பு நிலம்

# poi_wetland_saltern
source: Saltern
ta: குறைந்தபட்சம்

# poi_wetland_tidalflat
source: Tidal flat
ta: அலை பிளாட்

# poi_wetland_saltmarsh
source: Salt marsh
ta: உப்பு சதுப்பு நிலம்

# poi_wetland_mangrove
source: Mangrove
ta: சதுப்புநிலம்

# poi_wetland_string_bog
source: String bog
ta: சரம் போக்

# poi_wetland_fen
source: Fen
ta: ஃபென்

# poi_wetland_palsa_bog
source: Palsa bog
ta: பால்சா நூல்

# poi_wetland_mud
source: Mud
ta: மண்

# poi_beach_sand
source: Sand
ta: மணல்

# poi_beach_shingle
source: Shingle
ta: சிங்கிள்

# poi_beach_rocky
source: Rocky
ta: பாறை

# poi_chimney
source: Chimney
ta: புகைபோக்கி

# poi_palm
source: Palm
ta: பனை

# poi_cypress
source: Cypress
ta: சைப்ரச்

# poi_flagpole
source: Flagpole
ta: கொடிக் கம்பம்

# poi_bench_yes
source: Yes;Bench
ta: ஆம்; பெஞ்ச்

# poi_bench_no
source: Without bench
ta: பெஞ்ச் இல்லாமல்

# poi_bin_yes
source: With basket
ta: கூடை மூலம்

# poi_bin_no
source: Without basket
ta: கூடை இல்லாமல்

# poi_shelter_type_public_transport
source: Public transport
ta: பொது போக்குவரத்து

# poi_shelter_type_picnic_shelter
source: Picnic
ta: சுற்றுலா

# poi_shelter_type_weather_shelter
source: Weather
ta: வானிலை

# poi_shelter_type_lean_to
source: Lean-to
ta: மெலிந்த

# poi_shelter_type_basic_hut
source: Basic hut
ta: அடிப்படை குடிசை

# poi_shelter_type_building
source: Building
ta: கட்டிடம்

# poi_shelter_type_wildlife_hide
source: Wildlife hide
ta: வனவிலங்கு மறை

# poi_shelter_type_rock_shelter
source: Rock shelter
ta: ராக் தங்குமிடம்

# poi_shelter_type_sun_shelter
source: Sun shelter
ta: சூரிய தங்குமிடம்

# poi_shelter_type_field_shelter
source: Field shelter
ta: புலம் தங்குமிடம்

# poi_shelter_type_tent
source: Shelter type: tent
ta: தங்குமிடம் வகை: கூடாரம்

# poi_shelter_type_abandoned
source: Shelter type: abandoned
ta: தங்குமிடம் வகை: கைவிடப்பட்டது

# poi_internet_access_type_wlan
source: Wi-Fi
ta: இல்

# poi_internet_access_type_terminal
source: Terminal
ta: முனையத்தில்

# poi_internet_access_type_wired
source: Wired
ta: கம்பி

# poi_internet_access_type_public
source: Internet access type: public
ta: இணைய அணுகல் வகை: பொது

# poi_internet_access_type_service
source: Internet access type: service
ta: இணைய அணுகல் வகை: பணி

# poi_internet_access_type_no
source: No Internet access
ta: இணைய அணுகல் இல்லை

# poi_internet_access_type_yes
source: With Internet access
ta: இணைய அணுகலுடன்

# poi_maxwidth
source: Maximum width
ta: அதிகபட்ச அகலம்

# poi_iata
source: IATA code
ta: இங்கே குறியீடு

# poi_icao
source: ICAO code
ta: ICAO குறியீடு

# poi_faa
source: FAA code
ta: FAA குறியீடு

# poi_artwork_type_sculpture
source: Artwork type: sculpture
ta: கலைப்படைப்பு வகை: சிற்பம்

# poi_artwork_type_statue
source: Artwork type: statue
ta: கலைப்படைப்பு வகை: சிலை

# poi_artwork_type_mural
source: Artwork type: mural
ta: கலைப்படைப்பு வகை: சுவரோவியம்

# poi_artwork_type_architecture
source: Artwork type: architecture
ta: கலைப்படைப்பு வகை: கட்டிடக்கலை

# poi_artwork_type_painting
source: Artwork type: painting
ta: கலைப்படைப்பு வகை: ஓவியம்

# poi_artwork_type_stone
source: Artwork type: stone
ta: கலைப்படைப்பு வகை: கல்

# poi_artwork_type_bust
source: Artwork type: bust
ta: கலைப்படைப்பு வகை: மார்பளவு

# poi_artwork_type_installation
source: Artwork type: installation
ta: கலைப்படைப்பு வகை: நிறுவல்

# poi_artwork_type_mosaic
source: Artwork type: mosaic
ta: கலைப்படைப்பு வகை: மொசைக்

# poi_artwork_type_relief
source: Artwork type: relief
ta: கலைப்படைப்பு வகை: ஈடு

# poi_artwork_type_graffiti
source: Artwork type: graffiti
ta: கலைப்படைப்பு வகை: கிராஃபிட்டி

# poi_artwork_type_stele
source: Artwork type: stele
ta: கலைப்படைப்பு வகை: ச்டீல்

# poi_artwork_type_fountain
source: Artwork type: fountain
ta: கலைப்படைப்பு வகை: நீரூற்று

# poi_architect_name
source: Architect
ta: கட்டிடக் கலைஞர்

# poi_architecture_modern
source: Architecture: modern
ta: கட்டிடக்கலை: நவீன

# poi_architecture_stalinist_neoclassicism
source: Architecture: stalinist neoclassicism
ta: கட்டிடக்கலை: ச்ராலினிச்ட் நியோகிளாசிசம்

# poi_architecture_eclectic
source: Architecture: eclectic
ta: கட்டிடக்கலை: தேர்ந்தெடுக்கப்பட்ட

# poi_architecture_new_objectivity
source: Architecture: new objectivity
ta: கட்டிடக்கலை: புதிய புறநிலை

# poi_architecture_contemporary
source: Architecture: contemporary
ta: கட்டிடக்கலை: சமகால

# poi_architecture_constructivism
source: Architecture: constructivism
ta: கட்டிடக்கலை: ஆக்கபூர்வவாதம்

# poi_architecture_umgebinde
source: Architecture: umgebinde
ta: கட்டிடக்கலை: உம்செபிண்டே

# poi_architecture_timber_frame
source: Architecture: timber frame
ta: கட்டிடக்கலை: மர சட்டகம்

# poi_architecture_art_nouveau
source: Architecture: art nouveau
ta: கட்டிடக்கலை: ஆர்ட் நோவியோ

# poi_architecture_neoclassicism
source: Architecture: neoclassicism
ta: கட்டிடக்கலை: நியோகிளாசிசம்

# poi_architecture_victorian
source: Architecture: victorian
ta: கட்டிடக்கலை: விக்டோரியன்

# poi_architecture_brutalism
source: Architecture: brutalism
ta: கட்டிடக்கலை: மிருகத்தனம்

# poi_architecture_classicism
source: Architecture: classicism
ta: கட்டிடக்கலை: கிளாசிக்சம்

# poi_architecture_gothic
source: Architecture: gothic
ta: கட்டிடக்கலை: கோதிக்

# poi_architecture_oldrussian
source: Architecture: oldrussian
ta: கட்டிடக்கலை: ஓல்ட் ரச்யன்

# poi_architecture_baroque
source: Architecture: baroque
ta: கட்டிடக்கலை: பரோக்

# poi_architecture_postconstructivism
source: Architecture: postconstructivism
ta: கட்டிடக்கலை: பிந்தைய கான்ச்ட்ரக்டிவிசம்

# poi_architecture_wilhelminian_style
source: Architecture: wilhelminian style
ta: கட்டிடக்கலை: வில்எல்மினியன் பாணி

# poi_architecture_renaissance
source: Architecture: renaissance
ta: கட்டிடக்கலை: மறுமலர்ச்சி

# poi_architecture_romanesque
source: Architecture: romanesque
ta: கட்டிடக்கலை: ரோமானச்

# poi_tunnel_waterway
source: Water tunnel
ta: நீர் சுரங்கப்பாதை

# poi_tunnel_car
source: Road tunnel
ta: சாலை சுரங்கப்பாதை

# poi_tunnel_pedestrian
source: Pedestrian tunnel
ta: பாதசாரி சுரங்கப்பாதை

# poi_tunnel_railway
source: Railroad tunnel
ta: இரயில் பாதை சுரங்கப்பாதை

# poi_bridge_car
source: Road bridge
ta: சாலை பாலம்

# poi_bridge_pedestrian
source: Pedestrian bridge
ta: பாதசாரி பாலம்

# poi_bridge_bicycle
source: Bicycle bridge
ta: சைக்கிள் பாலம்

# poi_bridge_railway
source: Railroad bridge
ta: இரயில் பாதை பாலம்

# poi_bridge_waterway
source: Waterway bridge
ta: நீர்வழி பாலம்

# poi_bridge_structure_beam
source: Bridge structure: beam
ta: பாலம் அமைப்பு: பீம்

# poi_bridge_structure_simple_suspension
source: Bridge structure: simple suspension
ta: பாலம் அமைப்பு: எளிய இடைநீக்கம்

# poi_bridge_structure_suspension
source: Bridge structure: suspension
ta: பாலம் அமைப்பு: இடைநீக்கம்

# poi_bridge_structure_arch
source: Bridge structure: arch
ta: பாலம் அமைப்பு: வளைவு

# poi_bridge_structure_truss
source: Bridge structure: truss
ta: பாலம் அமைப்பு: டிரச்

# poi_bridge_structure_floating
source: Bridge structure: floating
ta: பாலம் அமைப்பு: மிதக்கும்

# poi_bridge_structure_humpback
source: Bridge structure: humpback
ta: பாலம் அமைப்பு: அம்ப்பேக்

# poi_bridge_structure_cable_stayed
source: Bridge structure: cable-stayed
ta: பாலம் அமைப்பு: கேபிள் தங்கியிருந்தது

# poi_bridge_structure_boardwalk
source: Bridge structure: boardwalk
ta: பாலம் அமைப்பு: போர்டுவாக்

# poi_bridge_structure_simple_wooden
source: Bridge structure: simple wooden
ta: பாலம் அமைப்பு: எளிய மர

# poi_bridge_structure_viaduct
source: Bridge structure: viaduct
ta: பாலம் அமைப்பு: வையாடக்ட்

# poi_bridge_structure_aqueduct
source: Bridge structure: aqueduct
ta: பாலம் அமைப்பு: நீர்வாழ்

# poi_bridge_structure_log
source: Bridge structure: log
ta: பாலம் அமைப்பு: பதிவு

# poi_bridge_type_movable
source: Bridge type: movable
ta: பாலம் வகை: நகரக்கூடியது

# poi_bridge_movable_bascule
source: Movable bridge type: bascule
ta: நகரக்கூடிய பாலம் வகை: பாச்குல்

# poi_bridge_movable_swing
source: Movable bridge type: swing
ta: நகரக்கூடிய பாலம் வகை: ச்விங்

# poi_bridge_movable_lift
source: Movable bridge type: lift
ta: நகரக்கூடிய பாலம் வகை: லிப்ட்

# poi_bridge_movable_drawbridge
source: Movable bridge type: drawbridge
ta: நகரக்கூடிய பாலம் வகை: டிராபிரிட்ச்

# poi_bridge_movable_submersible
source: Movable bridge type: submersible
ta: நகரக்கூடிய பாலம் வகை: நீரில் மூழ்கக்கூடியது

# poi_bridge_movable_transporter
source: Movable bridge type: transporter
ta: நகரக்கூடிய பாலம் வகை: டிரான்ச்போர்ட்டர்

# poi_bridge_movable_retractable
source: Movable bridge type: retractable
ta: நகரக்கூடிய பாலம் வகை: திரும்பப் பெறக்கூடியது

# poi_lit_yes
source: Lit: yes
ta: லிட்: ஆம்

# poi_lit_no
source: Lit: no
ta: லிட்: இல்லை

# poi_surface_unpaved
source: Surface: unpaved
ta: மேற்பரப்பு: செப்பனிடப்படாதது

# poi_surface_paved
source: Surface: paved
ta: மேற்பரப்பு: நடைபாதை

# poi_surface_asphalt
source: Surface: asphalt
ta: மேற்பரப்பு: நிலக்கீல்

# poi_surface_concrete
source: Surface: concrete
ta: மேற்பரப்பு: கான்கிரீட்

# poi_surface_sett
source: Surface: sett
ta: மேற்பரப்பு: குடியேறவும்

# poi_surface_cobblestone
source: Surface: cobblestone
ta: மேற்பரப்பு: கோப்ச்டோன்

# poi_surface_paving_stones
source: Surface: paving stones
ta: மேற்பரப்பு: கற்கள் நடைபாதை

# poi_surface_pebblestone
source: Surface: pebblestone
ta: மேற்பரப்பு: பெபில்ச்டோன்

# poi_surface_stone
source: Surface: stone
ta: மேற்பரப்பு: கல்

# poi_surface_metal
source: Surface: metal
ta: மேற்பரப்பு: உலோகம்

# poi_surface_wood
source: Surface: wood
ta: மேற்பரப்பு: மரம்

# poi_surface_gravel
source: Surface: gravel
ta: மேற்பரப்பு: சரளை

# poi_surface_fine_gravel
source: Surface: fine gravel
ta: மேற்பரப்பு: நன்றாக சரளை

# poi_surface_compacted
source: Surface: compacted
ta: மேற்பரப்பு: கச்சிதமான

# poi_surface_sand
source: Surface: sand
ta: மேற்பரப்பு: மணல்

# poi_surface_grass
source: Surface: grass
ta: மேற்பரப்பு: புல்

# poi_surface_grass_paver
source: Surface: grass paver
ta: மேற்பரப்பு: புல் பேவர்

# poi_surface_ground
source: Surface: ground
ta: மேற்பரப்பு: தரை

# poi_surface_dirt
source: Surface: dirt
ta: மேற்பரப்பு: அழுக்கு

# poi_surface_mud
source: Surface: mud
ta: மேற்பரப்பு: மண்

# poi_surface_ice
source: Surface: ice
ta: மேற்பரப்பு: பனி

# poi_surface_salt
source: Surface: salt
ta: மேற்பரப்பு: உப்பு

# poi_surface_snow
source: Surface: snow
ta: மேற்பரப்பு: பனி

# poi_route_bus_ref
source: Bus
ta: பச்

# poi_route_share_taxi_ref
source: Share taxi
ta: பங்கு டாக்சி

# poi_route_trolleybus_ref
source: Trolleybus
ta: டிராலிபச்

# poi_route_tram_ref
source: Tram
ta: டிராம்

# poi_route_train_ref
source: Train
ta: ரயில்

# poi_route_light_rail_ref
source: Light rail
ta: ஒளி ரயில்

# poi_route_monorail_ref
source: Monorail
ta: மோனோரெயில்

# poi_route_funicular_ref
source: Funicular
ta: ஃபனிகுலர்

# poi_route_ferry_ref
source: Ferry
ta: படகு

# poi_route_subway_ref
source: Subway
ta: சுரங்கப்பாதை

# poi_route_railway_ref
source: Route of a railroad
ta: ஒரு இரயில் பாதையின் பாதை

# poi_historic_yes
source: Historical object
ta: வரலாற்று பொருள்

# poi_surveillance_yes
source: Surveillance: yes
ta: கண்காணிப்பு: ஆம்

# poi_shop_additional_yes
source: With shop
ta: கடையுடன்

# poi_service_bicycle_retail_yes
source: Retail;Bicycle retail;Bike retail
ta: சில்லறை; சைக்கிள் சில்லறை; பைக் சில்லறை

# poi_service_bicycle_retail_no
source: Bicycle retail: no
ta: சைக்கிள் சில்லறை: இல்லை

# poi_service_bicycle_repair_yes
source: Repair;Bicycle repair;Bike repair
ta: பழுது; சைக்கிள் பழுது; பைக் பழுது

# poi_service_bicycle_repair_no
source: Bicycle repair: no
ta: சைக்கிள் பழுது: இல்லை

# poi_service_bicycle_rental_yes
source: Rental;Bicycle rental;Bike rental
ta: வாடகை; சைக்கிள் வாடகை; பைக் வாடகை

# poi_service_bicycle_rental_no
source: Bicycle rental: no
ta: சைக்கிள் வாடகை: இல்லை

# poi_service_bicycle_pump_yes
source: Pump;Bicycle pump;Bike pump
ta: பம்ப்; சைக்கிள் பம்ப்; பைக் பம்ப்

# poi_service_bicycle_pump_no
source: Bicycle pump: no
ta: சைக்கிள் பம்ப்: இல்லை

# poi_service_bicycle_diy_yes
source: Tools for DIY repair;Bike DIY tools;Bicycle DIY tools
ta: DIY பழுதுபார்க்கும் கருவிகள்; பைக் DIY கருவிகள்; சைக்கிள் DIY கருவிகள்

# poi_service_bicycle_diy_no
source: Bicycle tools for DIY repair: no
ta: DIY பழுதுபார்க்கும் சைக்கிள் கருவிகள்: இல்லை

# poi_service_bicycle_cleaning_yes
source: Cleaning;Bicycle cleaning;Bike cleaning
ta: சுத்தம்; சைக்கிள் சுத்தம்; பைக் தூய்மை

# poi_service_bicycle_cleaning_no
source: Bicycle cleaning: no
ta: சைக்கிள் சுத்தம்: இல்லை

# poi_service_bicycle_chaintool_yes
source: Chaintool;Bicycle chaintool;Bike chaintool
ta: சைக்கிள் சைண்டூல்;

# poi_service_bicycle_chaintool_no
source: Bicycle chaintool: no
ta: சைக்கிள் சைண்டூல்: இல்லை

# poi_service_bicycle_second_hand_yes
source: Retail sale of second-hand bicycles;Second hand bicycle;Second hand bike
ta: இரண்டாவது கை மிதிவண்டிகளின் சில்லறை விற்பனை; இரண்டாவது கை சைக்கிள்; இரண்டாவது கை பைக்

# poi_service_bicycle_second_hand_no
source: Retail sale of second-hand bicycles: no
ta: இரண்டாவது கை மிதிவண்டிகளின் சில்லறை விற்பனை: இல்லை

# poi_service_bicycle_charging_yes
source: Charging: yes;Bicycle charging;Bike charging;Electric bicycle charging;Electric bike charging
ta: சார்சிங்: ஆம்; சைக்கிள் சார்சிங்; பைக் சார்சிங்; மின்சார சைக்கிள் சார்சிங்; மின்சார பைக் சார்சிங்

# poi_service_bicycle_charging_no
source: Charging: no
ta: சார்சிங்: இல்லை

# poi_bicycle_repair_station
source: Bicycle repair station;Bicycle self-repair station;Bike repair station;Bike self-repair station
ta: சைக்கிள் பழுதுபார்க்கும் நிலையம்; சைக்கிள் தன்வய பழுதுபார்க்கும் நிலையம்; பைக் பழுதுபார்க்கும் நிலையம்; பைக் தன்வய பழுதுபார்ப்பு நிலையம்

# poi_wildlife_hide
source: Place to observe wildlife
ta: வனவிலங்குகளை அவதானிக்க இடம்

# poi_training_language
source: Training: language
ta: பயிற்சி: மொழி

# poi_training_music
source: Training: music
ta: பயிற்சி: இசை

# poi_training_dance
source: Training: dance
ta: பயிற்சி: நடனம்

# poi_training_sport
source: Training: sport
ta: பயிற்சி: விளையாட்டு

# poi_training_art
source: Training: art
ta: பயிற்சி: கலை

# poi_training_cooking
source: Training: cooking
ta: பயிற்சி: சமையல்

# poi_training_computer
source: Training: computer
ta: பயிற்சி: கணினி

# poi_training_yoga
source: Training: yoga
ta: பயிற்சி: யோகா

# poi_training_martial_art
source: Training: martial art
ta: பயிற்சி: தற்காப்பு கலை

# poi_training_aviation
source: Training: aviation
ta: பயிற்சி: விமான போக்குவரத்து

# poi_training_hairdressing
source: Training: hairdressing
ta: பயிற்சி: சிகையலங்கார வல்லுநர்

# poi_monument_yes
source: Monumental object
ta: நினைவுச்சின்ன பொருள்

# poi_industrial_oil
source: Type: oil industry
ta: வகை: எண்ணெய் தொழில்

# poi_industrial_wellsite
source: Type: wellsite
ta: வகை: வெல்சைட்

# poi_industrial_factory
source: Type: factory
ta: வகை: தொழிற்சாலை

# poi_industrial_gas
source: Type: gas industry
ta: வகை: எரிவாயு தொழில்

# poi_industrial_timber
source: Type: timber
ta: வகை: மரம்

# poi_industrial_refinery
source: Type: refinery
ta: வகை: சுத்திகரிப்பு நிலையம்

# poi_industrial_warehouse
source: Type: warehouse
ta: வகை: கிடங்கு

# poi_industrial_auto_wrecker
source: Type: auto wrecker
ta: வகை: ஆட்டோ ரெக்கர்

# poi_industrial_agriculture
source: Type: agriculture
ta: வகை: உழவு

# poi_industrial_brewery
source: Type: brewery
ta: வகை: மதுபானம்

# poi_industrial_brickyard
source: Type: brickyard
ta: வகை: பிரிக்யார்ட்

# poi_industrial_intermodal_freight_terminal
source: Type: intermodal freight terminal
ta: வகை: இடைநிலை சரக்கு முனையம்

# poi_industrial_sawmill
source: Type: sawmill
ta: வகை: மரக்கால் ஆலை

# poi_industrial_water_purification
source: Type: water purification
ta: வகை: நீர் சுத்திகரிப்பு

# poi_industrial_port
source: Type: port
ta: வகை: துறைமுகம்

# poi_industrial_depot
source: Type: depot
ta: வகை: டிப்போ

# poi_note
source: Note
ta: குறிப்பு

# poi_watering_place
source: Watering place
ta: நீர்ப்பாசன இடம்

# poi_animal_boarding
source: Animal boarding
ta: விலங்கு போர்டிங்

# poi_animal_boarding_dog
source: Boarding type: dog
ta: போர்டிங் வகை: நாய்

# poi_animal_boarding_cat
source: Boarding type: cat
ta: போர்டிங் வகை: பூனை

# poi_animal_boarding_dog_cat
source: Boarding type: dog, cat
ta: போர்டிங் வகை: நாய், பூனை

# poi_animal_boarding_horse
source: Boarding type: horse
ta: போர்டிங் வகை: குதிரை

# poi_elevator_yes
source: With elevator
ta: லிஃப்ட் உடன்

# poi_elevator_no
source: Without elevator
ta: லிஃப்ட் இல்லாமல்

# poi_technical_monument
source: Technical monument
ta: தொழில்நுட்ப நினைவுச்சின்னம்

# poi_office_camping
source: Camping office
ta: முகாம் அலுவலகம்

# poi_model_aerodrome
source: Model aerodrome
ta: மாதிரி ஏரோட்ரோம்

# poi_guide
source: Guide office
ta: வழிகாட்டி அலுவலகம்

# poi_quango
source: Quango
ta: குவாங்கோ

# poi_consulting
source: Consulting office
ta: அறிவுரை அலுவலகம்

# poi_cooperative
source: Cooperative office
ta: கூட்டுறவு அலுவலகம்

# poi_office_forestry
source: Forestry office
ta: வனவியல் அலுவலகம்

# poi_logistics
source: Logistics office
ta: தளவாட அலுவலகம்

# poi_parish
source: Parish office
ta: பாரிச் அலுவலகம்

# poi_publisher
source: Publishing office
ta: வெளியீட்டு அலுவலகம்

# poi_street_lamp
source: Street lamp
ta: தெரு விளக்கு

# poi_crop_rice
source: Crop: rice
ta: பயிர்: அரிசி

# poi_crop_grass
source: Crop: grass
ta: பயிர்: புல்

# poi_crop_corn
source: Crop: corn
ta: பயிர்: சோளம்

# poi_crop_cereal
source: Crop: cereal
ta: பயிர்: தானியங்கள்

# poi_crop_sugarcane
source: Crop: sugarcane
ta: பயிர்: கரும்பு

# poi_crop_wheat
source: Crop: wheat
ta: பயிர்: கோதுமை

# poi_crop_soy
source: Crop: soy
ta: பயிர்: நான்

# poi_crop_barley
source: Crop: barley
ta: பயிர்: பார்லி

# poi_crop_vegetables
source: Crop: vegetables
ta: பயிர்: காய்கறிகள்

# poi_crop_hop
source: Crop: hop
ta: பயிர்: ஆப்

# poi_crop_rape
source: Crop: rape
ta: பயிர்: கற்பழிப்பு

# poi_crop_beet
source: Crop: beet
ta: பயிர்: பீட்

# poi_crop_lavender
source: Crop: lavender
ta: பயிர்: லாவெண்டர்

# poi_crop_tea
source: Crop: tea
ta: பயிர்: தேநீர்

# poi_crop_coffee
source: Crop: coffee
ta: பயிர்: காபி

# poi_crop_poultry
source: Crop: poultry
ta: பயிர்: கோழி

# poi_crop_sunflower
source: Crop: sunflower
ta: பயிர்: சூரியகாந்தி

# poi_crop_raspberry
source: Crop: raspberry
ta: பயிர்: ராச்பெர்ரி

# poi_crop_tobacco
source: Crop: tobacco
ta: பயிர்: புகையிலை

# poi_crop_strawberry
source: Crop: strawberry
ta: பயிர்: ச்ட்ராபெரி

# poi_crop_vegetables_flowers
source: Crop: vegetables, flowers
ta: பயிர்: காய்கறிகள், பூக்கள்

# poi_crop_cassava
source: Crop: cassava
ta: பயிர்: கசவா

# poi_crop_cranberry
source: Crop: cranberry
ta: பயிர்: குருதிநெல்லி

# poi_crop_asparagus
source: Crop: asparagus
ta: பயிர்: அச்பாரகச்

# poi_crop_flowers
source: Crop: flowers
ta: பயிர்: மலர்கள்

# poi_surveillance_indoor
source: Surveillance: indoor
ta: கண்காணிப்பு: உட்புற

# poi_surveillance_outdoor
source: Surveillance: outdoor
ta: கண்காணிப்பு: வெளிப்புறம்

# poi_surveillance_public
source: Surveillance: public
ta: கண்காணிப்பு: பொது

# poi_clothes_women
source: Women
ta: பெண்கள்

# poi_clothes_underwear
source: Underwear
ta: உள்ளாடை

# poi_clothes_men
source: Men
ta: ஆண்கள்

# poi_clothes_wedding
source: Wedding dresses
ta: திருமண ஆடைகள்

# poi_clothes_sports
source: Sports
ta: விளையாட்டு

# poi_clothes_babies
source: Babies
ta: குழந்தைகள்

# poi_clothes_denim
source: Denim
ta: டெனிம்

# poi_clothes_workwear
source: Workwear
ta: வேலை உடைகள்

# poi_clothes_hats
source: Hats
ta: தொப்பிகள்

# poi_clothes_fur
source: Fur
ta: ஃப்யூர்

# poi_clothes_leather
source: Leather
ta: தோல்

# poi_clothes_costumes
source: Costumes
ta: உடைகள்

# poi_clothes_traditional
source: Traditional
ta: பாரம்பரிய

# poi_clothes_suits
source: Suits
ta: வழக்குகள்

# poi_clothes_maternity
source: Maternity
ta: மகப்பேறு

# poi_clothes_vintage
source: Vintage
ta: விண்டேச்

# poi_clothes_oversize
source: Oversize
ta: பெரிதாக்கவும்

# poi_clothes_schoolwear
source: School
ta: பள்ளி

# poi_clothes_swimwear
source: Swimwear
ta: நீச்சலுடை

# poi_clothes_socks
source: Socks
ta: சாக்ச்

# poi_clothes_shirts
source: Shirts
ta: சட்டைகள்

# poi_clothes_dance
source: Dancing
ta: நடனம்

# poi_clothes_military
source: Military
ta: தரைப்படை

# poi_historic_milestone
source: Historic milestone
ta: வரலாற்று மைல்கல்

# poi_shoes_children
source: Children
ta: குழந்தைகள்

# poi_shoes_women
source: Women
ta: பெண்கள்

# poi_shoes_sport
source: Sports
ta: விளையாட்டு

# poi_shoes_men
source: Men
ta: ஆண்கள்

# poi_shoes_orthopedic
source: Orthopedic
ta: எலும்பியல்

# poi_historic_manor
source: Historic manor
ta: வரலாற்று மேனர்

# poi_castle_type_stately
source: Castle type: stately
ta: கோட்டை வகை: கம்பீரமான

# poi_castle_type_defensive
source: Castle type: defensive
ta: கோட்டை வகை: தற்காப்பு

# poi_castle_type_fortress
source: Castle type: fortress
ta: கோட்டை வகை: கோட்டை

# poi_castle_type_palace
source: Castle type: palace
ta: கோட்டை வகை: அரண்மனை

# poi_castle_type_kremlin
source: Castle type: kremlin
ta: கோட்டை வகை: கிரெம்ளின்

# poi_castle_type_defensive_stately
source: Castle type: defensive, stately
ta: கோட்டை வகை: தற்காப்பு, கம்பீரமான

# poi_castle_type_castrum
source: Castle type: castrum
ta: கோட்டை வகை: காச்ட்ரம்

# poi_castle_type_shiro
source: Castle type: shiro
ta: கோட்டை வகை: சிரோ

# poi_massage_thai
source: Thai
ta: தாய்

# poi_massage_sexual
source: Sexual
ta: பாலியல்

# poi_massage_chinese
source: Chinese
ta: சீன

# poi_massage_therapeutic
source: Therapeutic
ta: மருத்தீடு

# poi_massage_yes
source: Massage services
ta: மசாச் சேவைகள்

# poi_sauna_yes
source: Sauna services
ta: ச உனா னா சேவைகள்

# poi_solarium_yes
source: Solarium services
ta: சோலாரியம் சேவைகள்

# poi_tents_yes
source: Allowed
ta: அனுமதிக்கப்படுகிறது

# poi_tents_no
source: Tents not allowed
ta: கூடாரங்கள் அனுமதிக்கப்படவில்லை

# poi_openfire_yes
source: Open-fire allowed
ta: திறந்தவெளி அனுமதிக்கப்படுகிறது

# poi_openfire_no
source: Open-fire not allowed
ta: திறந்த-தீ அனுமதிக்கப்படவில்லை

# poi_backcountry_yes
source: Yes;Backcountry
ta: ஆம்; பின்னணி

# poi_backcountry_no
source: No
ta: இல்லை

# poi_scout_yes
source: Yes;Scout
ta: ஆம்; சாரணர்

# poi_scout_no
source: Scout camp: no
ta: சாரணர் முகாம்: இல்லை
