Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_us_maps_recreation_area_activity_horse_riding_and_camping
source: Horse riding and camping
ta: குதிரை சவாரி மற்றும் முகாம்

# poi_us_maps_recreation_area_activity_hunting
source: Hunting
ta: வேட்டை

# poi_us_maps_recreation_area_activity_ice_fishing
source: Ice fishing
ta: பனி மீன்பிடித்தல்

# poi_us_maps_recreation_area_activity_ice_skating
source: Ice skating
ta: பனி சறுக்கு

# poi_us_maps_recreation_area_activity_interpretive_areas
source: Interpretive areas
ta: விளக்கப் பகுதிகள்

# poi_us_maps_recreation_area_activity_lake_and_pond_fishing
source: Lake and pond fishing
ta: ஏரி மற்றும் குளம் மீன்பிடித்தல்

# poi_us_maps_recreation_area_activity_metal_detecting
source: Metal detecting
ta: உலோகக் கண்டறிதல்

# poi_us_maps_recreation_area_activity_mountain_biking
source: Mountain biking
ta: மவுண்டன் பைக்கிங்

# poi_us_maps_recreation_area_activity_mountain_climbing
source: Mountain climbing
ta: மலை ஏறுதல்

# poi_us_maps_recreation_area_activity_mushing_skijoring
source: Mushing and skijoring
ta: காசறை மற்றும் ச்கைசோரிங்

# poi_us_maps_recreation_area_activity_nature_viewing
source: Nature viewing
ta: இயற்கை பார்வை

# poi_us_maps_recreation_area_activity_ohv_camping
source: OHV camping
ta: OHV முகாம்

# poi_us_maps_recreation_area_activity_ohv_open_area_riding
source: OHV open area riding
ta: OHV திறந்த பகுதி சவாரி

# poi_us_maps_recreation_area_activity_ohv_riding_and_camping
source: OHV riding and camping
ta: OHV சவாரி மற்றும் முகாம்

# poi_us_maps_recreation_area_activity_ohv_road_riding
source: OHV road riding
ta: OHV சாலை சவாரி

# poi_us_maps_recreation_area_activity_ohv_trail_riding
source: OHV trail riding
ta: OHV டிரெயில் சவாரி

# poi_us_maps_recreation_area_activity_other_activities
source: Other activities
ta: பிற நடவடிக்கைகள்

# poi_us_maps_recreation_area_activity_outdoor_learning
source: Outdoor learning
ta: வெளிப்புற கற்றல்

# poi_us_maps_recreation_area_activity_picnicking
source: Picnicking
ta: பிக்னிக்

# poi_us_maps_recreation_area_activity_river_and_stream_fishing
source: River and stream fishing
ta: நதி மற்றும் நீரோடை மீன்பிடித்தல்

# poi_us_maps_recreation_area_activity_road_cycling
source: Road cycling
ta: சாலை சைக்கிள் ஓட்டுதல்

# poi_us_maps_recreation_area_activity_rock_climbing
source: Rock climbing
ta: ராக் க்ளைம்பிங்

# poi_us_maps_recreation_area_activity_rockhounding
source: Rockhounding
ta: ராக்அவுண்டிங்

# poi_us_maps_recreation_area_activity_rocks_and_minerals
source: Rocks and minerals
ta: பாறைகள் மற்றும் தாதுக்கள்

# poi_us_maps_recreation_area_activity_rv_camping
source: RV camping
ta: ஆர்.வி முகாம்

# poi_us_maps_recreation_area_activity_salt_water_fishing
source: Salt water fishing
ta: உப்பு நீர் மீன்பிடித்தல்

# poi_us_maps_recreation_area_activity_sand_play
source: Sand play
ta: மணல் விளையாட்டு

# poi_us_maps_recreation_area_activity_scenic_driving
source: Scenic driving
ta: அழகிய வண்டி ஓட்டுதல்

# poi_us_maps_recreation_area_activity_scuba_diving
source: Scuba diving
ta: ச்கூபா டைவிங்

# poi_us_maps_recreation_area_activity_skiing_snowboarding
source: Skiing and snowboarding
ta: பனிச்சறுக்கு மற்றும் பனிச்சறுக்கு

# poi_us_maps_recreation_area_activity_sledding_tubing
source: Sledding tubing
ta: ச்லெடிங் குழாய்

# poi_us_maps_recreation_area_activity_small_game_hunting
source: Small game hunting
ta: சிறிய விளையாட்டு வேட்டை

# poi_us_maps_recreation_area_activity_snowmobiling
source: Snowmobiling
ta: ச்னோமொபைலிங்

# poi_us_maps_recreation_area_activity_surfing
source: Surfing
ta: சர்ஃபிங்

# poi_us_maps_recreation_area_activity_swimming
source: Swimming
ta: நீச்சல்

# poi_us_maps_recreation_area_activity_target_shooting
source: Target shooting
ta: இலக்கு படப்பிடிப்பு

# poi_us_maps_recreation_area_activity_tidepooling
source: Tidepooling
ta: டைட்பூலிங்

# poi_us_maps_recreation_area_activity_trapping
source: Trapping
ta: பொறி

# poi_us_maps_recreation_area_activity_tubing
source: Tubing
ta: குழாய்

# poi_us_maps_recreation_area_activity_viewing_plants
source: Viewing plants
ta: தாவரங்களைப் பார்ப்பது

# poi_us_maps_recreation_area_activity_viewing_scenery
source: Viewing scenery
ta: இயற்கைக்காட்சியைப் பார்க்கிறது

# poi_us_maps_recreation_area_activity_viewing_wildlife
source: Viewing wildlife
ta: வனவிலங்குகளைப் பார்ப்பது

# poi_us_maps_recreation_area_activity_visitor_centers
source: Visitor centers
ta: பார்வையாளர் மையங்கள்

# poi_us_maps_recreation_area_activity_visitor_programs
source: Visitor programs
ta: பார்வையாளர் திட்டங்கள்

# poi_us_maps_recreation_area_activity_water_activities
source: Water activities
ta: நீர் நடவடிக்கைகள்

# poi_us_maps_recreation_area_activity_waterskiing
source: Waterskiing
ta: வாட்டர்ச்கிங்

# poi_us_maps_recreation_area_activity_windsurfing
source: Windsurfing
ta: விண்ட்சர்ஃபிங்

# poi_us_maps_recreation_area_activity_winter_sports
source: Winter sports
ta: குளிர்கால விளையாட்டு

# poi_us_maps_recreation_area_activity_xc_skiing_snowshoeing
source: XC skiing and snowshoeing
ta: எக்ச்சி பனிச்சறுக்கு மற்றும் ச்னோசூயிங்

# poi_us_maps_recreation_area_open_status_open
source: Open
ta: திற

# poi_us_maps_recreation_area_open_status_closed
source: Closed
ta: மூடப்பட்டது

# poi_us_maps_recreation_area_open_status_temporarily_closed
source: Temporarily closed
ta: தற்காலிகமாக மூடப்பட்டது

# poi_us_maps_recreation_area_open_status_unreachable
source: Unreachable
ta: அணுக முடியாதது

# poi_us_maps_recreation_area_open_status_open_2
source: Recreation area access status (2): open
ta: பொழுதுபோக்கு பகுதி அணுகல் நிலை (2): திறந்திருக்கும்

# poi_us_maps_recreation_area_open_status_closed_2
source: Recreation area access status (2): closed
ta: பொழுதுபோக்கு பகுதி அணுகல் நிலை (2): மூடப்பட்டது

# poi_us_maps_recreation_area_open_status_temporarily_closed_2
source: Recreation area access status (2): temporarily closed
ta: பொழுதுபோக்கு பகுதி அணுகல் நிலை (2): தற்காலிகமாக மூடப்பட்டது

# poi_us_maps_recreation_area_open_status_unreachable_2
source: Recreation area access status (2): unreachable
ta: பொழுதுபோக்கு பகுதி அணுகல் நிலை (2): அணுக முடியாதது

# poi_us_maps_recreation_area_fee_description
source: Fee description
ta: கட்டணம் விளக்கம்

# poi_us_maps_recreation_area_open_season_start
source: Open season start
ta: திறந்த சீசன் தொடக்க

# poi_us_maps_recreation_area_open_season_end
source: Open season end
ta: திறந்த சீசன் முடிவு

# poi_us_maps_recreation_area_operational_hours
source: Operational hours
ta: செயல்பாட்டு நேரம்

# poi_us_maps_recreation_area_forest_name
source: Forest name
ta: வனப் பெயர்

# poi_us_maps_recreation_area_reservation_info
source: Reservation info
ta: முன்பதிவு செய்தி

# poi_us_maps_recreation_area_restrictions
source: Restrictions info
ta: கட்டுப்பாடுகள் செய்தி

# poi_us_maps_recreation_area_activity_description
source: Activity description
ta: செயல்பாட்டு விளக்கம்

# poi_us_maps_recreation_area_accessibility_info
source: Accessibility info
ta: அணுகல் செய்தி

# poi_us_maps_recreation_area_activity_poi
source: Point Of Interest
ta: ஆர்வத்தின் புள்ளி

# poi_us_maps_recreation_area_activity_scenic_overlook
source: Scenic overlook
ta: அழகிய பார்வை

# poi_us_maps_recreation_area_activity_day_use_site
source: Day use area;Day use site;Day-use area;Day-use site;Day-use recreation area;Day-use recreation site
ta: நாள் பயன்பாட்டு பகுதி; நாள் பயன்பாட்டு தளம்; பகல் பயன்பாட்டு பகுதி; பகல் பயன்பாட்டு தளம்; பகல் பயன்பாட்டு பொழுதுபோக்கு பகுதி; பகல் பயன்பாட்டு பொழுதுபோக்கு தளம்

# poi_us_maps_recreation_area_facility_cabin
source: Cabin
ta: கேபின்

# poi_us_maps_recreation_area_facility_airplane_landing_strip
source: Airplane landing strip
ta: விமான தரையிறங்கும் துண்டு

# poi_us_maps_recreation_area_facility_ranger_station_office
source: Ranger Station/Field Office
ta: ரேஞ்சர் நிலையம்/கள அலுவலகம்

# poi_us_maps_recreation_area_facility_boat_launch
source: Boat launch
ta: படகு ஏவுதல்

# poi_us_maps_recreation_area_facility_boat_ramp
source: Boat ramp
ta: படகு வளைவு

# poi_us_maps_recreation_area_facility_boat_takeout
source: Boat takeout
ta: படகு எடுத்துக்கொள்வது

# poi_us_maps_recreation_area_facility_fire_lookout
source: Fire lookout
ta: தீ தேடல்

# poi_us_maps_recreation_area_facility_group_shelter
source: Group shelter
ta: குழு தங்குமிடம்

# poi_us_maps_recreation_area_facility_horse_stanchion
source: Horse stanchion
ta: குதிரை ச்டான்சியன்

# poi_us_maps_recreation_area_facility_horse_corral
source: Horse corral
ta: குதிரை கோரல்

# poi_us_maps_recreation_area_facility_lighthouse
source: Lighthouse
ta: கலங்கரை விளக்கம்

# poi_us_maps_recreation_area_facility_natural_endangered_area
source: Natural/Endangered Area
ta: இயற்கை/ஆபத்தான பகுதி

# poi_us_maps_recreation_area_facility_rapid
source: Rapid
ta: விரைவான

# poi_us_maps_recreation_area_facility_rv_dump_station
source: RV dump station
ta: ஆர்.வி டம்ப் நிலையம்

# poi_us_maps_recreation_area_facility_warming_hut
source: Warming hut
ta: வெப்பமயமாதல் குடிசை

# poi_us_maps_recreation_area_facility_parking
source: Parking area
ta: பார்க்கிங் பகுதி

# poi_nfs_yes
source: Managed by United States Forest Service
ta: ஒன்றுபட்டது ச்டேட்ச் வன சேவையால் நிர்வகிக்கப்படுகிறது

# poi_blm_yes
source: Managed by Bureau Of Land Management
ta: நில மேலாண்மை பணியகத்தால் நிர்வகிக்கப்படுகிறது

# poi_property_management
source: Property management office
ta: சொத்து மேலாண்மை அலுவலகம்

# poi_mcdonalds
source: McDonald's
ta: மெக்டொனால்டு

# poi_engineer
source: Engineer office
ta: பொறியாளர் அலுவலகம்

# poi_cash_in_yes
source: Yes
ta: ஆம்

# poi_cash_in_no
source: No
ta: இல்லை

# poi_cash_in_customers
source: Customers
ta: வாடிக்கையாளர்கள்

# poi_diet_pescetarian_no
source: Pescetarian diet: no
ta: பெசெட்டரியன் உணவு: இல்லை

# poi_payment_parco_yes
source: Parco
ta: பூங்கா

# poi_payment_parco_no
source: Parco not accepted
ta: பார்கோ ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_parkster_yes
source: Parkster
ta: பார்க்ச்டர்

# poi_payment_parkster_no
source: Parkster not accepted
ta: பார்க்ச்டர் ஏற்றுக்கொள்ளப்படவில்லை

# poi_osmand_foot_prohibited_tunnel
source: Tunnel prohibited for pedestrians
ta: பாதசாரிகளுக்கு சுரங்கப்பாதை தடைசெய்யப்பட்டது

# poi_osmand_bicycle_prohibited_tunnel
source: Tunnel prohibited for cyclists
ta: சைக்கிள் ஓட்டுநர்களுக்கு சுரங்கப்பாதை தடைசெய்யப்பட்டது

# poi_route_article
source: Travel Articles
ta: பயணக் கட்டுரைகள்

# poi_route_article_point
source: Travel Points
ta: பயண புள்ளிகள்

# poi_route_track_point
source: Route points
ta: பாதை புள்ளிகள்

# poi_routes_driving
source: Driving
ta: வண்டி ஓட்டுதல்

# poi_routes_motorcycling
source: Motorcycling
ta: மின்னோடி சைக்கிள் ஓட்டுதல்

# poi_routes_foot
source: Foot
ta: கால்

# poi_routes_winter_sport
source: Winter sports
ta: குளிர்கால விளையாட்டு

# poi_routes_cycling
source: Cycling
ta: சைக்கிள் ஓட்டுதல்

# poi_routes_air_sports
source: Air Sports
ta: காற்று விளையாட்டு

# poi_routes_water_sport
source: Water sports
ta: நீர் விளையாட்டு

# poi_routes_other
source: Other routes
ta: பிற வழிகள்

# poi_route_activity_type_car
source: Car
ta: கார்

# poi_route_activity_type_off_road
source: Off-Road
ta: ஆஃப்-ரோட்

# poi_route_activity_type_all_terrain_vehicle
source: ATV (All-Terrain Vehicle)
ta: ஏடிவி (அனைத்து நிலப்பரப்பு வாகனம்)

# poi_route_activity_type_truck_hgv
source: Truck (HGV)
ta: டிரக் (எச்சிவி)

# poi_route_activity_type_karting
source: Karting
ta: கார்டிங்

# poi_route_activity_type_adventure_motorcycling
source: Adventure Motorcycling
ta: சாகச மின்னோடி சைக்கிள் ஓட்டுதல்

# poi_route_activity_type_enduro_motorcycling
source: Enduro Motorcycling
ta: எண்டிரோ மின்னோடி சைக்கிள்

# poi_route_activity_type_motocross
source: Motocross
ta: மோட்டோகிராச்

# poi_route_activity_type_off_road_motorcycling_dirt_biking
source: Off-Road Motorcycling (Dirt Biking)
ta: ஆஃப்-ரோட் மின்னோடி சைக்கிள் (அழுக்கு பைக்கிங்)

# poi_route_activity_type_road_motorcycling
source: Road Motorcycling
ta: சாலை மின்னோடி சைக்கிள் ஓட்டுதல்

# poi_route_activity_type_sport_motorcycling
source: Sport Motorcycling
ta: விளையாட்டு மின்னோடி சைக்கிள் ஓட்டுதல்

# poi_route_activity_type_touring_motorcycling
source: Touring Motorcycling
ta: சுற்றுலா மின்னோடி சைக்கிள்

# poi_route_activity_type_track_racing
source: Track Racing
ta: ட்ராக் ரேசிங்

# poi_route_activity_type_motor_scooter
source: Motor scooter
ta: மின்னோடி ச்கூட்டர்

# poi_route_activity_type_backpacking
source: Backpacking
ta: பேக் பேக்கிங்

# poi_route_activity_type_hiking
source: Hiking routes
ta: ஐக்கிங் வழிகள்

# poi_route_activity_type_hill_climbing
source: Hill climbing
ta: மலை ஏறுதல்

# poi_route_activity_type_road_running
source: Road Running
ta: சாலை ஓட்டம்

# poi_route_activity_type_trail_running
source: Trail Running
ta: பாதை இயங்கும்

# poi_route_activity_type_trekking
source: Trekking
ta: மலையேற்றம்

# poi_route_activity_type_walking
source: Walking routes
ta: நடைபயிற்சி வழிகள்

# poi_route_activity_type_cross_country_skiing
source: Cross-Country Skiing
ta: குறுக்கு நாடு பனிச்சறுக்கு

# poi_route_activity_type_ice_skating
source: Ice Skating
ta: பனி சறுக்கு

# poi_route_activity_type_ski_touring
source: Ski Touring
ta: ச்கை சுற்றுப்பயணம்

# poi_route_activity_type_skiing
source: Skiing routes
ta: பனிச்சறுக்கு வழிகள்

# poi_route_activity_type_snowboarding
source: Snowboarding
ta: பனிச்சறுக்கு

# poi_route_activity_type_snowmobiling
source: Snowmobiling
ta: ச்னோமொபைலிங்

# poi_route_activity_type_snowshoeing
source: Snowshoeing
ta: ச்னோசூயிங்

# poi_route_activity_type_e_biking
source: E-Biking
ta: மின் பைக்கிங்

# poi_route_activity_type_e_mountain_bike
source: E-mountain bike
ta: மின் மவுண்டன் பைக்

# poi_route_activity_type_gravel_biking
source: Gravel Biking
ta: சரளை பைக்கிங்

# poi_route_activity_type_mountain_biking
source: MTB routes (mountain bike)
ta: எம்டிபி வழிகள் (மலை பைக்)

# poi_route_activity_type_road_cycling
source: Road cycling routes
ta: சாலை சைக்கிள் ஓட்டுதல் வழிகள்

# poi_route_activity_type_touring
source: Touring
ta: சுற்றுப்பயணம்

# poi_route_activity_type_aviation
source: Aviation
ta: பறப்பியல்

# poi_route_activity_type_drone_flying
source: Drone Flying
ta: ட்ரோன் பறக்கும்

# poi_route_activity_type_gliding_sailplane
source: Gliding (Sailplane)
ta: சறுக்கு (படகோட்டம்)

# poi_route_activity_type_hang_gliding
source: Hang gliding
ta: சறுக்கு தொங்கு

# poi_route_activity_type_hot_air_ballooning
source: Hot Air Ballooning
ta: சூடான காற்று பலூனிங்

# poi_route_activity_type_parachuting_skydiving
source: Parachuting (Skydiving)
ta: பாராசூட்டிங் (ச்கைடிவிங்)

# poi_route_activity_type_paragliding
source: Paragliding
ta: பாராகிளைடிங்

# poi_route_activity_type_powered_paragliding_paramotoring
source: Powered Paragliding (Paramotoring)
ta: இயங்கும் பாராகிளைடிங் (அளவுருக்கள்)

# poi_route_activity_type_ultralight_aviation
source: Ultralight Aviation
ta: அல்ட்ராலைட் ஏவியேசன்

# poi_route_activity_type_canoe
source: Canoe
ta: கேனோ

# poi_route_activity_type_diving
source: Diving
ta: டைவிங்

# poi_route_activity_type_scuba_diving
source: Scuba diving
ta: ச்கூபா டைவிங்

# poi_route_activity_type_kayak
source: Kayak
ta: கயாக்

# poi_route_activity_type_surfing
source: Surfing
ta: சர்ஃபிங்

# poi_route_activity_type_swimming_outdoor
source: Swimming outdoor
ta: வெளிப்புற நீச்சல்

# poi_route_activity_type_waterskiing
source: Waterskiing
ta: வாட்டர்ச்கிங்

# poi_route_activity_type_windsurfing
source: Windsurfing
ta: விண்ட்சர்ஃபிங்

# poi_route_activity_type_motorboat
source: Motorboat
ta: மின்னோடி படகு

# poi_route_activity_type_rafting
source: Rafting
ta: ராஃப்டிங்

# poi_route_activity_type_horse_riding
source: Horse riding
ta: குதிரை சவாரி

# poi_route_activity_type_mushrooms_picking
source: Mushrooms picking
ta: காளான்கள் எடுக்கும்

# poi_route_activity_type_harvesting
source: Harvesting
ta: அறுவடை

# poi_route_activity_type_tree_climbing
source: Tree Climbing
ta: மரம் ஏறுதல்

# poi_route_activity_type_caving
source: Caving
ta: கேவிங்

# poi_route_activity_type_train_riding
source: Train Riding
ta: ரயில் சவாரி

# poi_route_activity_type_golfing
source: Golfing
ta: கோல்ஃப்

# poi_route_activity_type_fitness
source: Fitness
ta: உடற்பயிற்சி

# poi_route_activity_type_inline_skates
source: Inline skates
ta: இன்லைன் ச்கேட்

# poi_name_etymology
source: Name etymology
ta: பெயர் சொற்பிறப்பியல்

# poi_name_left
source: Name of the left side
ta: இடது பக்கத்தின் பெயர்

# poi_name_right
source: Name of the right side
ta: வலது பக்கத்தின் பெயர்

# poi_climbing_boulder
source: Climbing boulder
ta: ஏறும் கற்பாறை

# poi_camp_site_basic
source: Basic
ta: அடிப்படை

# poi_camp_site_standard
source: Standard
ta: தரநிலை

# poi_camp_site_serviced
source: Serviced
ta: பணி

# poi_camp_site_deluxe
source: Deluxe
ta: டீலக்ச்

# poi_climbing_area
source: Climbing area
ta: ஏறும் பகுதி

# poi_climbing_route
source: Climbing route
ta: ஏறும் பாதை

# poi_climbing_route_bottom
source: Climbing route bottom
ta: ஏறும் பாதை கீழே

# poi_cafe_yes
source: Yes
ta: ஆம்

# poi_sled_yes
source: Sled: yes
ta: ச்லெட்: ஆம்

# poi_sled_no
source: Sled: no
ta: ச்லெட்: இல்லை

# poi_dog_sled_yes
source: Dog sled: yes
ta: நாய் ச்லெட்: ஆம்

# poi_dog_sled_no
source: Dog sled: no
ta: நாய் ச்லெட்: இல்லை

# poi_atv_yes
source: ATV: yes
ta: ஏடிவி: ஆம்

# poi_atv_no
source: ATV: no
ta: ஒரு டிவி:

# poi_access_notes
source: Access notes
ta: குறிப்புகள் அணுகல்

# poi_contact_website
source: Website
ta: வலைத்தளம்

# poi_lit
source: Lighting
ta: லைட்டிங்

# poi_piste_type
source: Piste type
ta: வழக்கமான பாடல்

# poi_piste_oneway
source: Piste oneway
ta: பிச்டே ஒன் வே

# poi_network_iwn
source: International hiking routes (IWN)
ta: பன்னாட்டு ஐகிங் வழிகள் (IWN)

# poi_network_nwn
source: National hiking routes (NWN)
ta: தேசிய ஐகிங் வழிகள் (NWN)

# poi_network_rwn
source: Regional hiking routes (RWN)
ta: பிராந்திய ஐகிங் வழிகள் (RWN)

# poi_network_lwn
source: Local hiking routes (LWN)
ta: உள்ளக ஐகிங் வழிகள் (எல்.டபிள்யூ.என்)

# poi_network_icn
source: International cycling routes (ICN)
ta: பன்னாட்டு சைக்கிள் ஓட்டுதல் வழிகள் (ஐ.சி.என்)

# poi_network_ncn
source: National cycling routes (NCN)
ta: தேசிய சைக்கிள் ஓட்டுதல் வழிகள் (என்.சி.என்)

# poi_network_rcn
source: Regional cycling routes (RCN)
ta: பிராந்திய சைக்கிள் ஓட்டுதல் வழிகள் (ஆர்.சி.என்)

# poi_network_lcn
source: Local cycling routes (LCN)
ta: உள்ளக சைக்கிள் ஓட்டுதல் வழிகள் (எல்.சி.என்)

# poi_network_nhn
source: National horse network (NHN)
ta: தேசிய குதிரை பிணையம் (என்.எச்.என்)

# poi_network_rhn
source: Regional horse network (RHN)
ta: பிராந்திய குதிரை பிணையம் (ஆர்.எச்.என்)

# poi_network_lhn
source: Local horse network (LHN)
ta: உள்ளக குதிரை பிணையம் (எல்.எச்.என்)

# poi_mosque
source: Mosque
ta: மசூதி

# poi_buddhist_temple
source: Buddhist temple
ta: ப Buddhist த்த கோயில்

# poi_hindu_temple
source: Hindu temple
ta: இந்து கோயில்

# poi_shinto_shrine
source: Shinto shrine
ta: சின்டோ சன்னதி

# poi_synagogue
source: Synagogue
ta: செசக்

# poi_jehovahs_witness_kingdom_hall
source: Jehovahs Witness Kingdom Hall
ta: யெகோவாக்கள் இராச்சிய ஆல் சான்று

# poi_catholic_church
source: Catholic church
ta: கத்தோலிக்க திருச்சபை

# poi_roman_catholic_church
source: Roman catholic church
ta: ரோமன் கத்தோலிக்க திருச்சபை

# poi_baptist_church
source: Baptist church
ta: பாப்டிச்ட் சர்ச்

# poi_lutheran_church
source: Lutheran church
ta: லூத்தரன் சர்ச்

# poi_orthodox_church
source: Orthodox church
ta: ஆர்த்தடாக்ச் சர்ச்

# poi_protestant_church
source: Protestant church
ta: புராட்டச்டன்ட் சர்ச்

# poi_anglican_church
source: Anglican church
ta: ஆங்கிலிகன் சர்ச்

# poi_methodist_church
source: Methodist church
ta: மெதடிச்ட் சர்ச்

# poi_greek_orthodox_church
source: Greek orthodox church
ta: கிரேக்க ஆர்த்தடாக்ச் சர்ச்

# poi_russian_orthodox_church
source: Russian orthodox church
ta: ரச்ய ஆர்த்தடாக்ச் சர்ச்

# poi_pentecostal_church
source: Pentecostal church
ta: பெந்தேகோச்தே சர்ச்

# poi_evangelical_church
source: Evangelical church
ta: சுவிசேச தேவாலயம்

# poi_presbyterian_church
source: Presbyterian church
ta: பிரச்பைடிரியன் சர்ச்

# poi_access_main_tag
source: Access
ta: அணுகல்

# poi_aerodrome_type_airfield
source: Airfield
ta: விமானநிலையம்

# poi_consulate
source: Consulate
ta: தூதரகம்

# poi_hazard_additional_landslide
source: Hazard: landslide
ta: ஆபத்து: நிலச்சரிவு

# poi_hazard_additional_yes
source: Hazard
ta: இடர்

# poi_hazard_falling_rocks
source: Falling rocks
ta: வீழ்ச்சியடைந்த பாறைகள்

# poi_hazard_contamination
source: Contamination
ta: மாசுபாடு

# poi_hazard_yes
source: Hazard
ta: இடர்

# poi_hazard_additional_slippery_road
source: Slippery road
ta: வழுக்கும் சாலை

# poi_steps
source: Steps
ta: படிகள்

# poi_footway
source: Walkway
ta: நடைபாதை

# poi_area_highway
source: Mobility area
ta: இயக்கம் பகுதி

# poi_area_highway_steps
source: Stairway area
ta: படிக்கட்டு பகுதி

# poi_area_highway_footway
source: Walkable area
ta: நடக்கக்கூடிய பகுதி

# poi_travel_agency
source: Travel agency
ta: பயண நிறுவனம்

# poi_mormon_church
source: Mormon church
ta: மோர்மன் சர்ச்

# poi_seventh_day_adventist_church
source: Seventh day adventist church
ta: ஏழாம் நாள் அட்வென்டிச்ட் சர்ச்

# poi_reformed_church
source: Reformed church
ta: சீர்திருத்த தேவாலயம்

# poi_ethiopian_orthodox_church
source: Ethiopian orthodox church
ta: எத்தியோப்பியன் ஆர்த்தடாக்ச் சர்ச்

# poi_romanian_orthodox_church
source: Romanian orthodox church
ta: ருமேனிய ஆர்த்தடாக்ச் சர்ச்

# poi_serbian_orthodox_church
source: Serbian orthodox church
ta: செர்பிய ஆர்த்தடாக்ச் சர்ச்

# poi_greek_catholic_church
source: Greek catholic church
ta: கிரேக்க கத்தோலிக்க தேவாலயம்

# poi_united_methodist_church
source: United methodist church
ta: ஒன்றுபட்டது மெதடிச்ட் சர்ச்

# poi_ukrainian_greek_catholic_church
source: Ukrainian greek catholic church
ta: உக்ரேனிய கிரேக்க கத்தோலிக்க தேவாலயம்

# poi_episcopal_church
source: Episcopal church
ta: எபிச்கோபல் சர்ச்

# poi_iglesia_ni_cristo_church
source: Iglesia ni cristo church
ta: சர்ச் ஆஃப் கிறிச்டோ சர்ச்

# poi_nondenominational_church
source: Nondenominational church
ta: Nondenominational தேவாலயம்

# poi_georgian_orthodox_church
source: Georgian orthodox church
ta: சார்சிய ஆர்த்தடாக்ச் சர்ச்

# poi_new_apostolic_church
source: New apostolic church
ta: புதிய அப்போச்தலிக் தேவாலயம்

# poi_ukrainian_orthodox_church
source: Ukrainian orthodox church
ta: உக்ரேனிய ஆர்த்தடாக்ச் சர்ச்

# poi_united_church
source: United church
ta: ஒன்றுபட்டது சர்ச்

# poi_assemblies_of_god_church
source: Assemblies of god church
ta: கடவுளின் தேவாலயத்தின் கூட்டங்கள்

# poi_church_of_scotland
source: Church of scotland
ta: ச்காட்லாந்தின் சர்ச்

# poi_salvation_army_church
source: Salvation army church
ta: சால்வேசன் ஆர்மி சர்ச்

# poi_armenian_apostolic_church
source: Armenian apostolic church
ta: ஆர்மீனிய அப்போச்தலிக் சர்ச்

# poi_quaker_church
source: Quaker church
ta: குவாக்கர் சர்ச்

# poi_church_of_christ
source: Church of christ
ta: கிறிச்துவின் சர்ச்

# poi_neo_pentecostal_church
source: Neo-pentecostal church
ta: நவ-பெண்டிகோச்டல் சர்ச்

# poi_latter_day_saints_church
source: Latter day saints church
ta: பிந்தைய நாள் புனிதர்கள் சர்ச்

# poi_evangelical_lutheran_church
source: Evangelical lutheran church
ta: சுவிசேச லூத்தரன் சர்ச்

# poi_mennonite_church
source: Mennonite church
ta: மென்னோனைட் சர்ச்

# poi_landmark_church
source: Landmark church
ta: மைல்கல் சர்ச்

# poi_adventist_church
source: Adventist church
ta: அட்வென்டிச்ட் சர்ச்

# poi_uniting_church
source: Uniting church
ta: தேவாலயத்தை ஒன்றிணைத்தல்

# poi_apostolic_church
source: Apostolic church
ta: அப்போச்தலிக் சர்ச்

# poi_united_church_of_christ
source: United church of christ
ta: ஒன்றுபட்டது சர்ச் ஆஃப் கிறிச்து

# poi_united_reformed_church
source: United reformed church
ta: ஒன்றுபட்டது சீர்திருத்த தேவாலயம்

# poi_anabaptist_church
source: Anabaptist church
ta: அனபாப்டிச்ட் சர்ச்

# poi_bulgarian_orthodox_church
source: Bulgarian orthodox church
ta: பல்கேரிய ஆர்த்தடாக்ச் சர்ச்

# poi_african_methodist_episcopal_church
source: African methodist episcopal church
ta: ஆப்பிரிக்க மெதடிச்ட் எபிச்கோபல் சர்ச்

# poi_macedonian_orthodox_church
source: Macedonian orthodox church
ta: மாசிடோனிய ஆர்த்தடாக்ச் சர்ச்
