Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_wiki_lang_nl
source: Dutch wiki
ta: டச்சு விக்கி

# poi_wiki_lang_nn
source: Norwegian Nynorsk wiki
ta: நோர்வே

# poi_wiki_lang_no
source: Norwegian wiki
ta: நோர்வே விக்கி

# poi_wiki_lang_pl
source: Polish wiki
ta: போலந்து விக்கி

# poi_wiki_lang_pt
source: Portuguese wiki
ta: போர்த்துகீசிய விக்கி

# poi_wiki_lang_ro
source: Romanian wiki
ta: ருமேனிய விக்கி

# poi_wiki_lang_ru
source: Russian wiki
ta: ரச்ய விக்கி

# poi_wiki_lang_sk
source: Slovak wiki
ta: ச்லோவாக் விக்கி

# poi_wiki_lang_sl
source: Slovene wiki
ta: ச்லோவேன் விக்கி

# poi_wiki_lang_sr
source: Serbian wiki
ta: செர்பிய விக்கி

# poi_wiki_lang_sv
source: Swedish wiki
ta: ச்வீடிச் விக்கி

# poi_wiki_lang_sw
source: Swahili wiki
ta: ஆங்கில வாரம்

# poi_wiki_lang_te
source: Telugu wiki
ta: தெலுங்கு விக்கி

# poi_wiki_lang_th
source: Thai wiki
ta: தாய் விக்கி

# poi_wiki_lang_tr
source: Turkish wiki
ta: துருக்கிய விக்கி

# poi_wiki_lang_uk
source: Ukrainian wiki
ta: உக்ரேனிய விக்கி

# poi_wiki_lang_vi
source: Vietnamese wiki
ta: வியட்நாமிய விக்கி

# poi_wiki_lang_vo
source: Volapük wiki
ta: வோலாபக் விக்கி

# poi_wiki_lang_zh
source: Chinese wiki
ta: சீன விக்கி

# poi_wiki_lang_af
source: Africaans wiki
ta: ஆப்பிரிக்கா

# poi_wiki_lang_als
source: Alsatian wiki
ta: அல்சாட்டியன் விக்கி

# poi_wiki_lang_az
source: Azerbaijani wiki
ta: அசர்பைசான் விக்கி

# poi_wiki_lang_bn
source: Bengali wiki
ta: பெங்காலி விக்கி

# poi_wiki_lang_bpy
source: Bishnupriya wiki
ta: பிச்ணுப்யா விக்கி

# poi_wiki_lang_br
source: Breton wiki
ta: பிரெட்டன் விக்கி

# poi_wiki_lang_bs
source: Bosnian wiki
ta: போச்னிய விக்கி

# poi_wiki_lang_cy
source: Welsh wiki
ta: வெல்ச் விக்கி

# poi_wiki_lang_eo
source: Esperanto wiki
ta: எச்பெராண்டோ விக்கி

# poi_wiki_lang_eu
source: Basque wiki
ta: பாச்க் விக்கி

# poi_wiki_lang_fa
source: Farsi wiki
ta: ஃபார்சி விக்கி

# poi_wiki_lang_fy
source: Frysk wiki
ta: ஃபிரிசியன் விக்கி

# poi_wiki_lang_ga
source: Irish wiki
ta: ஐரிச் விக்கி

# poi_wiki_lang_hy
source: Armenian wiki
ta: ஆர்மீனிய விக்கி

# poi_wiki_lang_is
source: Icelandic wiki
ta: ஐச்லாந்திய விக்கி

# poi_wiki_lang_ka
source: Georgian wiki
ta: சார்சிய விக்கி

# poi_wiki_lang_ku
source: Kurdish wiki
ta: குர்திச் விக்கி

# poi_wiki_lang_la
source: Latin wiki
ta: லத்தீன் விக்கி

# poi_wiki_lang_lb
source: Luxembourgish wiki
ta: லக்சம்பர்கிச் விக்கி

# poi_wiki_lang_mk
source: Macedonian wiki
ta: மாசிடோனிய விக்கி

# poi_wiki_lang_ml
source: Malayalam wiki
ta: மலையாள விக்கி

# poi_wiki_lang_mr
source: Marathi wiki
ta: மராத்தி விக்கி

# poi_wiki_lang_nds
source: Low Saxon wiki
ta: குறைந்த சாக்சன் விக்கி

# poi_wiki_lang_nv
source: Navajo wiki
ta: நவாசோ விக்கி

# poi_wiki_lang_os
source: Ossetian wiki
ta: ஒசேசியன் வாரம்

# poi_wiki_lang_pms
source: Piedmontese wiki
ta: பீட்மண்டீச் விக்கி

# poi_wiki_lang_sc
source: Sardinian wiki
ta: சார்டினியன் விக்கி

# poi_wiki_lang_sh
source: Serbo-Croatian wiki
ta: செர்பிய-குரோசிய விக்கி

# poi_wiki_lang_sq
source: Albanian wiki
ta: அல்பேனிய விக்கி

# poi_wiki_lang_ta
source: Tamil wiki
ta: தமிழ் விக்கி

# poi_wiki_lang_tl
source: Filipino wiki
ta: பிலிப்பைன்ச் விக்கி

# poi_wiki_lang_war
source: Waray wiki
ta: வயதானவர்கள்

# poi_wiki_lang_min
source: Minangkabau wiki
ta: கிருமபகாவ் விக்கி

# poi_wiki_lang_kk
source: Kazakh wiki
ta: கசாக் விக்கி

# poi_wiki_lang_uz
source: Uzbek wiki
ta: உச்பெக்.

# poi_wiki_lang_ce
source: Chechen wiki
ta: செச்சென் விக்கி

# poi_wiki_lang_ur
source: Urdu wiki
ta: உருது விக்கி

# poi_wiki_lang_oc
source: Occitan wiki
ta: ஆக்சிடன் விக்கி

# poi_wiki_lang_zhminnan
source: Southern Min wiki
ta: தெற்கு மின் விக்கி

# poi_wiki_lang_mg
source: Malagasy wiki
ta: மலகாசி விக்கி

# poi_wiki_lang_tt
source: Tatar wiki
ta: விக்கி டார்டரே

# poi_wiki_lang_jv
source: Javanese wiki
ta: சாவானீச் விக்கி

# poi_wiki_lang_ky
source: Kyrgyz wiki
ta: விக்கி

# poi_wiki_lang_zhyue
source: Cantonese wiki
ta: கான்டோனீச் விக்கி

# poi_wiki_lang_ast
source: Astur-Leonese wiki
ta: அச்டூர்-லியோனீச் விக்கி

# poi_wiki_lang_tg
source: Tajik wiki
ta: விக்கி தாய்

# poi_wiki_lang_ba
source: Bashkir wiki
ta: பாச்கிர் விக்கி

# poi_wiki_lang_sco
source: Scots wiki
ta: ச்காட்ச் விக்கி

# poi_wiki_lang_pnb
source: Punjabi wiki
ta: பஞ்சாபி விக்கி

# poi_wiki_lang_cv
source: Chuvash wiki
ta: சுவாச் விக்கி

# poi_wiki_lang_lmo
source: Lombard wiki
ta: லோம்பார்ட் விக்கி

# poi_wiki_lang_my
source: Burmese wiki
ta: பர்மிய விக்கி

# poi_wiki_lang_yo
source: Yoruba wiki
ta: இடம் விக்கி

# poi_wiki_lang_an
source: Aragonese wiki
ta: அரகோசி விக்கி

# poi_wiki_lang_ne
source: Nepali wiki
ta: நேபாளி விக்கி

# poi_wiki_lang_gu
source: Gujarati wiki
ta: குசதி விக்கிடி

# poi_wiki_lang_scn
source: Sicilian wiki
ta: சிசிலியன் விக்கி

# poi_wiki_lang_bar
source: Bavarian wiki
ta: பவேரியன் விக்கி

# poi_wiki_lang_mn
source: Mongolian wiki
ta: மங்கோலிய விக்கி

# poi_wiki_lang_nap
source: Neapolitan wiki
ta: நியோபோலிடன் விக்கி

# poi_bollard
source: Bollard
ta: பொல்லார்ட்

# poi_cycle_barrier
source: Cycle barrier
ta: சுழற்சி தடை

# poi_motorcycle_barrier
source: Motorcycle barrier
ta: மின்னோடி சைக்கிள் தடை

# poi_block
source: Block
ta: தொகுதி

# poi_bus_trap
source: Bus trap
ta: பச் பொறி

# poi_cattle_grid
source: Cattle grid
ta: கால்நடை கட்டம்

# poi_full_height_turnstile
source: Full-height turnstile
ta: முழு-உயரமுள்ள திருப்புமுனை

# poi_bump_gate
source: Bump gate
ta: பம்ப் கேட்

# poi_general_barrier
source: General barrier
ta: பொது தடை

# poi_stile
source: Stile
ta: பாணி

# poi_debris
source: Debris
ta: குப்பைகள்

# poi_jersey_barrier
source: Jersey barrier
ta: செர்சி தடை

# poi_height_restrictor
source: Height restrictor
ta: உயரக் கட்டுப்பாட்டாளர்

# poi_horse_stile
source: Horse stile
ta: குதிரை பாணி

# poi_kissing_gate
source: Kissing gate
ta: முத்த வாயில்

# poi_sally_port
source: Sally port
ta: சாலி துறைமுகம்

# poi_swing_gate
source: Swing gate
ta: ச்விங் கேட்

# poi_turnstile
source: Turnstile
ta: டர்ன்ச்டைல்

# poi_kent_carriage_gap
source: Kent carriage gap
ta: கென்ட் வண்டி இடைவெளி

# poi_barrier_entrance
source: Passage in a wall or a fence
ta: ஒரு சுவர் அல்லது வேலியில் பாதை

# poi_entrance_main
source: Main entrance
ta: முதன்மையான நுழைவாயில்

# poi_entrance
source: Entrance
ta: நுழைவு

# poi_entrance_exit
source: Exit
ta: வெளியேறு

# poi_highway_crossing
source: Highway crossing
ta: நெடுஞ்சாலை கடத்தல்

# poi_icn_ref
source: International cycling network node
ta: பன்னாட்டு சைக்கிள் ஓட்டுதல் பிணையம் முனை

# poi_ncn_ref
source: National cycling network node
ta: தேசிய சைக்கிள் ஓட்டுதல் பிணையம் முனை

# poi_rcn_ref
source: Regional cycling network node
ta: பிராந்திய சைக்கிள் ஓட்டுதல் பிணையம் முனை

# poi_lcn_ref
source: Local cycling network node
ta: உள்ளக சைக்கிள் ஓட்டுதல் பிணையம் முனை

# poi_iwn_ref
source: International hiking network node
ta: பன்னாட்டு ஐகிங் பிணையம் முனை

# poi_nwn_ref
source: National hiking network node
ta: தேசிய ஐகிங் பிணையம் முனை

# poi_rwn_ref
source: Regional hiking network node
ta: பிராந்திய ஐக்கிங் பிணையம் முனை

# poi_lwn_ref
source: Local hiking network node
ta: உள்ளக ஐக்கிங் பிணையம் முனை

# poi_opening_hours
source: Opening hours
ta: திறந்த நேரம்

# poi_collection_times
source: Collection times
ta: சேகரிப்பு நேரம்

# poi_description
source: Description
ta: விவரம்

# poi_phone
source: Phone
ta: தொலைபேசி

# poi_website
source: Website
ta: வலைத்தளம்

# poi_email
source: Email
ta: மின்னஞ்சல்

# poi_fax
source: Fax
ta: தொலைநகல்

source: Facebook
ta: பேச்புக்

source: Reddit
ta: ரெடிட்

source: Twitter
ta: ட்விட்டர்

# poi_skype
source: Skype
ta: ச்கைப்

# poi_instagram
source: Instagram
ta: இன்ச்டாகிராம்

# poi_mobile
source: Mobile
ta: மொபைல்

# poi_service_times
source: Service times
ta: பணி நேரங்கள்

# poi_maxheight
source: Maximum height
ta: அதிகபட்ச உயரம்

# poi_maxweight
source: Maximum weight
ta: அதிகபட்ச எடை

# poi_height
source: Height
ta: உயரம்

# poi_width
source: Width
ta: அகலம்

# poi_ele
source: Elevation above sea level
ta: கடல் மட்டத்திற்கு மேலே உயரம்

# poi_abandoned
source: Abandoned
ta: கைவிடப்பட்டது

# poi_abandoned_poi
source: Abandoned object
ta: கைவிடப்பட்ட பொருள்

# poi_disused
source: Disused
ta: பயன்படுத்தப்பட்டது

# poi_operator
source: Operator
ta: ஆபரேட்டர்

# poi_brand
source: Brand
ta: சூட்டுக்குறி

# poi_fee_yes
source: Yes;Fee
ta: ஆம்; கட்டணம்

# poi_fee_no
source: No
ta: இல்லை

# poi_drinking_water_yes
source: Yes;Drinking water
ta: ஆம்; குடிநீர்

# poi_drinking_water_no
source: No
ta: இல்லை

# poi_supervised_yes
source: Supervised
ta: மேற்பார்வை

# poi_supervised_no
source: Without supervision
ta: மேற்பார்வை இல்லாமல்

# poi_seasonal_yes
source: Yes;Seasonal
ta: ஆம்; பருவகால

# poi_seasonal_no
source: No
ta: இல்லை

# poi_seasonal_dry_season
source: Dry season
ta: வறண்ட காலம்

# poi_seasonal_wet_season
source: Wet season
ta: ஈரமான பருவம்

# poi_seasonal_spring
source: Spring
ta: வேனில்

# poi_seasonal_summer
source: Summer
ta: கோடை காலம்

# poi_seasonal_autumn
source: Fall
ta: வீழ்ச்சி

# poi_seasonal_winter
source: Winter
ta: குளிர்காலம்

# poi_crossing_traffic_signals
source: With stop lights
ta: நிறுத்த விளக்குகளுடன்

# poi_crossing_uncontrolled
source: Uncontrolled
ta: கட்டுப்பாடற்றது

# poi_crossing_unmarked
source: Unmarked
ta: குறிக்கப்படாதது

# poi_start_date
source: Start date
ta: தொடக்க தேதி

# poi_wheelchair_accessibility
source: Wheelchair accessibility
ta: சக்கர நாற்காலி அணுகல்

# poi_wheelchair_yes
source: Yes;Wheelchair
ta: ஆம்; சக்கர நாற்காலி

# poi_wheelchair_no
source: No
ta: இல்லை

# poi_wheelchair_limited
source: Limited
ta: வரையறுக்கப்பட்ட

# poi_wholesale
source: Wholesale
ta: மொத்தம்

# poi_access_yes
source: Access is allowed
ta: அணுகல் அனுமதிக்கப்படுகிறது

# poi_access_private
source: Private access
ta: தனிப்பட்ட அணுகல்

# poi_access_no
source: No access
ta: அணுகல் இல்லை

# poi_access_destination
source: Destination access
ta: இலக்கு அணுகல்

# poi_access_permissive
source: Permissive access
ta: அனுமதிக்கப்பட்ட அணுகல்

# poi_access_customers
source: Customer access
ta: வாடிக்கையாளர் அணுகல்

# poi_access_delivery
source: Delivery access
ta: விநியோக அணுகல்

# poi_access_agricultural
source: Agricultural access
ta: விவசாய அணுகல்

# poi_access_permit
source: Permit required
ta: தேவை தேவை

# poi_content_silage
source: Content: silage
ta: உள்ளடக்கம்: சிலேச்

# poi_content_water
source: Content: water
ta: உள்ளடக்கம்: நீர்

# poi_content_slurry
source: Content: slurry
ta: உள்ளடக்கம்: குழம்பு

# poi_content_oil
source: Content: oil
ta: உள்ளடக்கம்: எண்ணெய்

# poi_content_fuel
source: Content: fuel
ta: உள்ளடக்கம்: எரிபொருள்

# poi_content_manure
source: Content: manure
ta: உள்ளடக்கம்: உரம்

# poi_content_wine
source: Content: wine
ta: உள்ளடக்கம்: மது

# poi_content_sewage
source: Content: sewage
ta: உள்ளடக்கம்: கழிவுநீர்

# poi_content_gas
source: Content: gas
ta: உள்ளடக்கம்: காற்று

# poi_content_biomass
source: Content: biomass
ta: உள்ளடக்கம்: உயிரி

# poi_content_wastewater
source: Content: wastewater
ta: உள்ளடக்கம்: கழிவு நீர்

# poi_content_crop
source: Content: crop
ta: உள்ளடக்கம்: பயிர்

# poi_content_fodder
source: Content: fodder
ta: உள்ளடக்கம்: தீவனம்

# poi_content_beer
source: Content: beer
ta: உள்ளடக்கம்: பீர்

# poi_content_salt
source: Content: salt
ta: உள்ளடக்கம்: உப்பு

# poi_content_grain
source: Content: grain
ta: உள்ளடக்கம்: தானிய

# poi_nudism_yes
source: Allowed
ta: அனுமதிக்கப்படுகிறது

# poi_nudism_no
source: Prohibited
ta: தடைசெய்யப்பட்டது

# poi_nudism_obligatory
source: Obligatory
ta: கடமை

# poi_nudism_customary
source: Customary
ta: வழக்கம்

# poi_nudism_permissive
source: Permissive
ta: இசைவு

# poi_trade_building_supplies
source: Building supplies
ta: கட்டிட பொருட்கள்

# poi_trade_plumbing
source: Plumbing supplies
ta: பிளம்பிங் பொருட்கள்

# poi_trade_wood
source: Wood supplies
ta: மர பொருட்கள்

# poi_trade_agricultural_supplies
source: Agricultural supplies
ta: விவசாய பொருட்கள்

# poi_trade_tile
source: Tile supplies
ta: ஓடு பொருட்கள்

# poi_population
source: Population
ta: மக்கள் தொகை

# poi_parking_underground
source: Underground
ta: நிலத்தடி

# poi_parking_multi_storey
source: Multi-storey
ta: பல மாடி

# poi_bicycle_parking_anchors
source: Anchors
ta: நங்கூரர்கள்

# poi_bicycle_parking_stands
source: Stands
ta: நிற்கிறது

# poi_bicycle_parking_wall_loops
source: Wall loops
ta: சுவர் சுழல்கள்

# poi_bicycle_parking_rack
source: Rack
ta: பற்சிலி

# poi_bicycle_parking_building
source: Special building
ta: சிறப்பு கட்டிடம்

# poi_bicycle_parking_shed
source: Shed
ta: கொட்டகை

# poi_bicycle_parking_bollard
source: Bollard
ta: பொல்லார்ட்

# poi_bicycle_parking_informal
source: Informal
ta: முறைசாரா

# poi_leaf_type_broadleaved
source: Broadleaved
ta: அகலமான

# poi_leaf_type_needleleaved
source: Needleleaved
ta: ஊசி

# poi_leaf_type_mixed
source: Mixed
ta: கலப்பு

# poi_leaf_type_leafless
source: Leafless
ta: இலை இல்லாதது

# poi_species
source: Species
ta: இனங்கள்

# poi_genus
source: Genus
ta: வகை

# poi_taxon
source: Taxon
ta: டாக்சன்

# poi_trees_olive
source: Olive
ta: ஆலிவ்

# poi_trees_apple
source: Apple
ta: அரத்திப்பழம், குமளிப்பழம்

# poi_trees_oil
source: Palm oil
ta: பாமாயில்

# poi_trees_orange
source: Orange
ta: ஆரஞ்சு

# poi_trees_almond
source: Almond
ta: பாதாம்

# poi_trees_banana
source: Banana
ta: வாழைப்பழம்

# poi_trees_hazel
source: Hazel
ta: ஏசல்

# poi_trees_coconut
source: Coconut
ta: தேங்காய்

# poi_trees_persimmon
source: Persimmon
ta: சீமைப் பனிச்சை

# poi_trees_cherry
source: Cherry
ta: சேலா(ப்பழம்)

# poi_trees_walnut
source: Walnut
ta: வால்நட்

# poi_trees_plum
source: Plum
ta: பிளம்

# poi_trees_peach
source: Peach
ta: குழிப்பேரி

# poi_trees_tea
source: Tea
ta: தேநீர்

# poi_trees_coca
source: Coca
ta: கோகோ

# poi_trees_kiwi
source: Kiwi
ta: பசலிப்பழம்

# poi_trees_meadow_orchard
source: Meadow orchard
ta: புல்வெளி பழத்தோட்டம்

# poi_trees_nectorine
source: Nectarine
ta: தேன்

# poi_trees_mango
source: Mango
ta: மாம்பழம்

# poi_trees_rubber
source: Rubber
ta: மீள்மம்

# poi_trees_date
source: Date
ta: திகதி

# poi_trees_coffea
source: Coffee
ta: காபி

# poi_trees_pomegranate
source: Pomegranate
ta: மாதுளை

# poi_urban
source: Urban
ta: நகர்ப்புற

# poi_rural
source: Rural
ta: கிராமப்புற

# poi_enforcement_traffic_signals
source: Enforcement: stop lights
ta: அமலாக்கம்: விளக்குகளை நிறுத்து

# poi_enforcement_maxspeed
source: Enforcement: maxspeed
ta: அமலாக்கம்: மேக்ச்ச்பீட்

# poi_enforcement_maxheight
source: Enforcement: maxheight
ta: அமலாக்கம்: மேக்ச்ஐட்

# poi_enforcement_mindistance
source: Enforcement: mindistance
ta: அமலாக்கம்: மனம்

# poi_enforcement_check
source: Enforcement: check
ta: அமலாக்கம்: சரிபார்க்கவும்

# poi_enforcement_access
source: Enforcement: access
ta: அமலாக்கம்: அணுகல்

# poi_enforcement_toll
source: Enforcement: toll
ta: அமலாக்கம்: சுங்கச்சாவடி

# poi_animal_shelter
source: Animal shelter
ta: விலங்கு தங்குமிடம்

# poi_animal_shelter_dog
source: Dogs
ta: நாய்கள்

# poi_animal_shelter_cat
source: Cats
ta: பூனைகள்

# poi_animal_shelter_dog_cat
source: Dogs, cats
ta: நாய்கள், பூனைகள்

# poi_animal_shelter_bird
source: Birds
ta: பறவைகள்

# poi_animal_shelter_wildlife
source: Wildlife
ta: வனவிலங்குகள்

# poi_animal_shelter_horse
source: Horses
ta: குதிரைகள்

# poi_animal_shelter_mammal
source: Mammals
ta: பாலூட்டிகள்

# poi_animal_shelter_fish
source: Fishes
ta: மீன்கள்

# poi_seats
source: Seats
ta: இருக்கைகள்

# poi_backrest_yes
source: Backrest: yes
ta: பேக்ரெச்ட்: ஆம்

# poi_backrest_no
source: Backrest: no
ta: பேக்ரெச்ட்: இல்லை

# poi_intermittent
source: Intermittent
ta: இடைப்பட்ட

# poi_building
source: Building
ta: கட்டிடம்

# poi_deadlock
source: Deadlock
ta: முட்டுக்கட்டை

# poi_generator_source_coal
source: Energy source: coal
ta: ஆற்றல் மூல: நிலக்கரி

# poi_generator_source_gas
source: Energy source: gas
ta: ஆற்றல் மூல: காற்று

# poi_generator_source_nuclear
source: Energy source: nuclear
ta: ஆற்றல் மூல: அணு

# poi_generator_source_solar
source: Energy source: solar
ta: ஆற்றல் மூல: சூரிய

# poi_generator_source_hydro
source: Energy source: hydro
ta: ஆற்றல் மூல: ஐட்ரோ

# poi_generator_source_wind
source: Energy source: wind
ta: ஆற்றல் மூல: காற்று

# poi_generator_source_geothermal
source: Energy source: geothermal
ta: ஆற்றல் மூல: புவிவெப்ப

# poi_generator_source_oil
source: Energy source: oil
ta: ஆற்றல் மூல: எண்ணெய்

# poi_generator_source_diesel
source: Energy source: diesel
ta: ஆற்றல் மூல: டீசல்

# poi_generator_source_biomass
source: Energy source: biomass
ta: ஆற்றல் ஆதாரம்: உயிரி

# poi_int_name
source: International name
ta: பன்னாட்டு பெயர்

# poi_nat_name
source: National name
ta: தேசிய பெயர்

# poi_reg_name
source: Regional name
ta: பிராந்திய பெயர்

# poi_loc_name
source: Local name
ta: உள்ளக பெயர்

# poi_old_name
source: Old name
ta: பழைய பெயர்

# poi_alt_name
source: Alternative name
ta: மாற்று பெயர்

# poi_pump_manual
source: Manual
ta: கையேடு

# poi_pump_powered
source: Powered
ta: திறனளிப்பு/மின்னளிப்பு நிலை

# poi_pump_no
source: No pump
ta: பம்ப் இல்லை

# poi_pump_yes
source: Yes;Pump
ta: ஆம்; பம்ப்

# poi_water_characteristic_mineral
source: Mineral
ta: ஈனி

# poi_water_characteristic_mud
source: Mud
ta: மண்

# poi_water_characteristic_sulfuric
source: Sulfuric
ta: சல்பூரிக்

# poi_water_point
source: Water point
ta: நீர் புள்ளி

# poi_information_guidepost
source: Guidepost
ta: வழிகாட்டி போச்ட்

# poi_information_board
source: Board
ta: பலகை

# poi_information_map
source: Map
ta: வரைபடம்

# poi_information_office
source: Office
ta: அலுவலகம்

# poi_information_trail_blaze
source: Trail blaze
ta: டிரெயில் பிளேச்

# poi_information_terminal
source: Terminal
ta: முனையத்தில்

# poi_information_route_marker
source: Route marker
ta: பாதை மார்க்கர்

# poi_information_hikingmap
source: Hiking map
ta: ஐக்கிங் வரைபடம்

# poi_information_nature
source: Nature
ta: இயற்கை

# poi_information_history
source: History
ta: வரலாறு

# poi_information_sign
source: Sign
ta: அடையாளம்

# poi_information_audioguide
source: Audioguide
ta: ஆடியோ வழிகாட்டி

# poi_information_bicyclemap
source: Bicycle map
ta: சைக்கிள் வரைபடம்

# poi_information_tactile_model
source: Tactile model
ta: தொட்டுணரக்கூடிய மாதிரி

# poi_information_tactile_map
source: Tactile map
ta: தொட்டுணரக்கூடிய வரைபடம்

# poi_board_type_notice
source: Bulletin board
ta: புல்லட்டின் போர்டு

# poi_board_type_plants
source: Plants
ta: தாவரங்கள்

# poi_board_type_geology
source: Geology
ta: புவியியல்

# poi_board_type_public_transport
source: Public transport
ta: பொது போக்குவரத்து

# poi_board_type_technology
source: Technology
ta: தொழில்நுட்பம்

# poi_board_type_astronomy
source: Astronomy
ta: வானியல்

# poi_fireplace_yes
source: Yes;Fireplace
ta: ஆம்; நெருப்பிடம்

# poi_fireplace_no
source: No fireplace
ta: நெருப்பிடம் இல்லை

# poi_covered_yes
source: Yes;Covered
ta: ஆம்; மூடப்பட்டிருக்கும்

# poi_covered_no
source: Not covered
ta: மூடப்படவில்லை

# poi_smoking_no
source: Not allowed
ta: அனுமதிக்கப்படவில்லை

# poi_smoking_outside
source: Outside only
ta: வெளியே மட்டும்

# poi_smoking_yes
source: Allowed
ta: அனுமதிக்கப்படுகிறது

# poi_smoking_separated
source: In a separated room
ta: ஒரு பிரிக்கப்பட்ட அறையில்

# poi_smoking_isolated
source: In a isolated room
ta: ஒரு தனிமைப்படுத்தப்பட்ட அறையில்

# poi_smoking_dedicated
source: Dedicated to smokers
ta: புகைப்பிடிப்பவர்களுக்கு அர்ப்பணிக்கப்பட்டது

# poi_toll_yes
source: Toll
ta: எண்ணிக்கை

# poi_toll_no
source: No toll
ta: எண்ணிக்கை இல்லை

# poi_toll_hgv_yes
source: HGV toll
ta: எச்.சி.வி டோல்

# poi_tactile_paving_yes
source: Yes;Tactile paving
ta: ஆம்; தொட்டுணரக்கூடிய நடைபாதை

# poi_tactile_paving_no
source: Without tactile paving
ta: தொட்டுணரக்கூடிய நடைபாதை இல்லாமல்

# poi_traffic_signals_sound_yes
source: Yes;Traffic signals sound
ta: ஆம்; போக்குவரத்து சமிக்ஞைகள் ஒலி

# poi_traffic_signals_sound_no
source: Sound: no
ta: ஒலி: இல்லை

# poi_traffic_signals_sound_walk
source: Only when walking is allowed
ta: நடைபயிற்சி அனுமதிக்கப்படும் போது மட்டுமே

# poi_rescue_station
source: Rescue station
ta: மீட்பு நிலையம்

# poi_services
source: Service area
ta: பணி பகுதி

# poi_mini_roundabout
source: Mini roundabout
ta: மினி ரவுண்டானா

# poi_railway_crossing
source: Railroad crossing
ta: இரயில் பாதை கடத்தல்

# poi_railway_level_crossing
source: Level crossing
ta: இருப்புப்பாதைக் கடவை

# poi_bird_hide
source: Place to observe birds
ta: பறவைகளைக் கவனிக்க இடம்

# poi_horse_riding
source: Horse riding
ta: குதிரை சவாரி

# poi_leisure_common
source: Common leisure area
ta: பொதுவான ஓய்வு பகுதி

# poi_garden
source: Garden
ta: தோட்டம்

# poi_heath
source: Heath
ta: ஈத்

# poi_grass
source: Grass
ta: புல்

# poi_grassland
source: Grassland
ta: புல்வெளி

# poi_scrub
source: Scrub
ta: ச்க்ரப்

# poi_farmland
source: Farmland
ta: விவசாய நிலங்கள்

# poi_logging
source: Logging
ta: பதிவு

# poi_sand
source: Sand
ta: மணல்

# poi_windfall
source: Windfall
ta: வீழ்ச்சி

# poi_dead_wood
source: Dead wood
ta: இறந்த மரம்

# poi_passing_place
source: Passing place
ta: கடந்து செல்லும் இடம்

# poi_level
source: Level
ta: நிலை

# poi_rtsa_scale
source: RTSA scale
ta: RTSA அளவுகோல்

# poi_piste_difficulty_easy
source: Easy
ta: எளிதானது

# poi_piste_difficulty_intermediate
source: Intermediate
ta: இடைநிலை

# poi_piste_difficulty_advanced
source: Advanced
ta: மேம்பட்ட

# poi_piste_difficulty_novice
source: Novice
ta: புதியவர்

# poi_piste_difficulty_expert
source: Expert
ta: வல்லுநர்

# poi_piste_difficulty_freeride
source: Freeride
ta: ஃப்ரீரைடு

# poi_piste_grooming_classic
source: Classic
ta: கிளாசிக்

# poi_piste_grooming_classic_skating
source: Classic+skating
ta: கிளாசிக்+ச்கேட்டிங்

# poi_piste_grooming_backcountry
source: Backcountry
ta: பின்னணி

# poi_piste_grooming_scooter
source: Scooter
ta: ச்கூட்டர்

# poi_piste_grooming_skating
source: Skating
ta: ச்கேட்டிங்

# poi_piste_grooming_no
source: No
ta: இல்லை

# poi_piste_grooming_mogul
source: Mogul
ta: மொகுல்

# poi_garden_type_residential
source: Garden type: residential
ta: தோட்ட வகை: குடியிருப்பு

# poi_garden_type_community
source: Garden type: community
ta: தோட்ட வகை: சமூகம்

# poi_garden_type_private
source: Garden type: private
ta: தோட்ட வகை: தனியார்

# poi_garden_type_botanical
source: Garden type: botanical
ta: தோட்ட வகை: செடியியல்

# poi_garden_style_kitchen
source: Garden style: kitchen
ta: தோட்ட நடை: சமையலறை

# poi_garden_style_rosarium
source: Garden style: rosarium
ta: கார்டன் ச்டைல்: ரோசாரியம்

# poi_garden_style_french
source: Garden style: French
ta: தோட்ட நடை: பிரஞ்சு

# poi_garden_style_english
source: Garden style: English
ta: தோட்ட நடை: ஆங்கிலம்

# poi_garden_style_japanese
source: Garden style: Japanese
ta: தோட்ட நடை: சப்பானிய

# poi_capacity
source: Capacity
ta: திறன்

# poi_capacity_disabled_yes
source: Yes;Space for disabled
ta: ஆம்; ஊனமுற்றோருக்கான இடம்

# poi_capacity_disabled_no
source: No dedicated places for disabled
ta: ஊனமுற்றோருக்கு அர்ப்பணிப்பு இடங்கள் இல்லை

# poi_capacity_disabled
source: Dedicated places for disabled
ta: ஊனமுற்றோருக்கான அர்ப்பணிக்கப்பட்ட இடங்கள்

# poi_capacity_women_yes
source: Dedicated places for women
ta: பெண்களுக்கு அர்ப்பணிக்கப்பட்ட இடங்கள்

# poi_capacity_women_no
source: No dedicated places for women
ta: பெண்களுக்கு அர்ப்பணிப்பு இடங்கள் இல்லை

# poi_capacity_women
source: Dedicated places for women
ta: பெண்களுக்கு அர்ப்பணிக்கப்பட்ட இடங்கள்

# poi_capacity_pupils
source: Dedicated places for students
ta: மாணவர்களுக்கு அர்ப்பணிக்கப்பட்ட இடங்கள்

# poi_capacity_teachers
source: Dedicated places for teachers
ta: ஆசிரியர்களுக்கான அர்ப்பணிக்கப்பட்ட இடங்கள்

# poi_capacity_parent_yes
source: Dedicated places for parents
ta: பெற்றோருக்கான அர்ப்பணிக்கப்பட்ட இடங்கள்

# poi_capacity_parent_no
source: No dedicated places for parents
ta: பெற்றோருக்கு அர்ப்பணிப்பு இடங்கள் இல்லை

# poi_capacity_parent
source: Dedicated places for parents
ta: பெற்றோருக்கான அர்ப்பணிக்கப்பட்ட இடங்கள்

# poi_aerialway_occupancy
source: Cabin/chair/car capacity
ta: கேபின்/நாற்காலி/கார் திறன்

# poi_aerialway_capacity
source: Capacity per hour
ta: ஒரு மணி நேரத்திற்கு திறன்

# poi_aerialway_duration
source: Average travel time, minutes
ta: சராசரி பயண நேரம், நிமிடங்கள்
