Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_fuel
source: Gas station;Gasoline station;Filling station;Petrol station
ta: எரிவாயு நிலையம்; பெட்ரோல் நிலையம்; நிரப்புதல் நிலையம்; பெட்ரோல் நிலையம்

# poi_fuel_diesel
source: Diesel
ta: வளியெண்ணை

# poi_fuel_gtl_diesel
source: GTL diesel
ta: சி.டி.எல் டீசல்

# poi_fuel_hgv_diesel
source: HGV diesel
ta: எச்.சி.வி டீசல்

# poi_fuel_biodiesel
source: Bio diesel
ta: பயோ டீசல்

# poi_fuel_lpg
source: LPG
ta: எல்பிசி

# poi_fuel_octane_80
source: Octane 80
ta: ஆக்டேன் 80

# poi_fuel_octane_91
source: Octane 91
ta: ஆக்டேன் 91

# poi_fuel_octane_92
source: Octane 92
ta: ஆக்டேன் 92

# poi_fuel_octane_95
source: Octane 95
ta: ஆக்டேன் 95

# poi_fuel_octane_98
source: Octane 98
ta: ஆக்டேன் 98

# poi_fuel_octane_100
source: Octane 100
ta: ஆக்டேன் 100

# poi_fuel_cng
source: CNG
ta: சி.என்.சி.

# poi_fuel_1_25
source: 1:25 fuel
ta: 1:25 எரிபொருள்

# poi_fuel_1_50
source: 1:50 fuel
ta: 1:50 எரிபொருள்

# poi_fuel_ethanol
source: Ethanol
ta: எத்தனால்

# poi_fuel_methanol
source: Methanol
ta: மெத்தனால்

# poi_fuel_svo
source: SVO
ta: எனவே

# poi_fuel_biogas
source: Biogas
ta: பயோகாச்

# poi_fuel_lh2
source: Liquid hydrogen
ta: திரவ ஐட்ரசன்

# poi_fuel_91ul
source: 91UL fuel
ta: 91ul எரிபொருள்

# poi_fuel_100ll
source: 100LL fuel
ta: 100 எல்எல் எரிபொருள்

# poi_fuel_autogas
source: Autogas
ta: எல்பிசி

# poi_fuel_jeta1
source: Jet A-1 fuel
ta: செட் ஏ -1 எரிபொருள்

# poi_fuel_adblue
source: Diesel exhaust fluid
ta: டீசல் வெளியேற்ற திரவம்

# poi_fuel_electricity
source: Electricity
ta: மின்சாரம்

# poi_aeroway_fuel
source: Aircraft fuel station
ta: விமான எரிபொருள் நிலையம்

# poi_waterway_fuel
source: Gas station for boats
ta: படகுகளுக்கான எரிவாயு நிலையம்

# poi_electricity_combined_charging
source: Charging station;Electric vehicle charging station;EV charging station;Electric recharging point;Charge point;Electronic charging station;Electric vehicle supply equipment
ta: சார்சிங் நிலையம்; மின்சார வாகன சார்சிங் நிலையம்; ஈ.வி. சார்சிங் நிலையம்; மின்சார ரீசார்சிங் பாயிண்ட்; சார்ச் பாயிண்ட்; மின்னணு சார்சிங் நிலையம்; மின்சார வாகன விநியோக உபகரணங்கள்

# poi_fuel_wood
source: Fuel: wood
ta: எரிபொருள்: மரம்

# poi_fuel_charcoal
source: Fuel: charcoal
ta: எரிபொருள்: கரி

# poi_fuel_coal
source: Fuel: coal
ta: எரிபொருள்: நிலக்கரி

# poi_vehicle_ramp
source: Vehicle ramp
ta: வாகன வளைவு

# poi_compressed_air
source: Compressed air
ta: சுருக்கப்பட்ட காற்று

# poi_parking
source: Parking
ta: பார்க்கிங்

# poi_motorcycle_parking
source: Motorcycle parking
ta: மின்னோடி சைக்கிள் பார்க்கிங்

# poi_parking_entrance
source: Parking entrance
ta: பார்க்கிங் நுழைவு

# poi_garages
source: Garages
ta: கேரேச்கள்

# poi_public_transport_platform
source: Public transport stop
ta: பொது போக்குவரத்து நிறுத்தம்

# poi_public_transport_platform_bus
source: Bus stop
ta: பச் நிறுத்தம்

# poi_public_transport_platform_trolleybus
source: Trolleybus stop
ta: டிராலிபச் நிறுத்தம்

# poi_bus_stop
source: Bus stop
ta: பச் நிறுத்தம்

# poi_public_transport_stop_position
source: Public transport stop position
ta: பொது போக்குவரத்து நிறுத்த நிலை

# poi_public_transport_platform_tram
source: Tram stop
ta: டிராம் நிறுத்தம்

# poi_tram_stop
source: Tram stop
ta: டிராம் நிறுத்தம்

# poi_public_transport_station
source: Public transport station
ta: பொது போக்குவரத்து நிலையம்

# poi_bus_station
source: Bus station
ta: பச் நிலையம்

# poi_railway_station
source: Railroad station;Railway station;Train station
ta: ரயில் நிலையம்; ரயில் நிலையம்; ரயில் நிலையம்

# poi_railway_platform
source: Railroad platform;Train platform
ta: இரயில் பாதை தளம்; ரயில் தளம்

# poi_halt
source: Railroad stop;Train stop;Railroad station;Railway station;Train station;Station
ta: ரெயில்ரோட் ச்டாப்; ரயில் நிறுத்தம்; ரயில் நிலையம்; ரயில் நிலையம்; ரயில் நிலையம்; நிலையம்

# poi_subway_entrance
source: Subway entrance
ta: சுரங்கப்பாதை நுழைவு

# poi_subway_station
source: Yes;Subway station
ta: ஆம்; சுரங்கப்பாதை நிலையம்

# poi_railway_buffer_stop
source: Railroad buffer stop
ta: இரயில் பாதை இடையக நிறுத்தம்

# poi_taxi
source: Taxi stand
ta: டாக்சி ச்டாண்ட்

# poi_aerodrome
source: Airport;Aerodrome
ta: விமான நிலையம்; ஏரோட்ரோம்

# poi_helipad
source: Helipad
ta: எலிபாட்

# poi_runway
source: Runway
ta: ஓடுபாதை

# poi_aeroway_terminal
source: Aeroway terminal
ta: ஏரோவே முனையம்

# poi_aeroway_gate
source: Aeroway gate
ta: ஏரோவே கேட்

# poi_slipway
source: Slipway
ta: ச்லிப்வே

# poi_ferry_terminal
source: Ferry terminal
ta: படகு முனையம்

# poi_lighthouse
source: Lighthouse
ta: கலங்கரை விளக்கம்

# poi_bicycle_rental
source: Bicycle rental
ta: சைக்கிள் வாடகை

# poi_bicycle_parking
source: Bicycle parking
ta: சைக்கிள் பார்க்கிங்

# poi_aerialway_station
source: Aerialway station
ta: ஏரியல் பாதை நிலையம்

# poi_aerialway_cable_car
source: Cable car
ta: கேபிள் கார்

# poi_aerialway_gondola
source: Gondola
ta: கோண்டோலா

# poi_aerialway_chair_lift
source: Chair lift
ta: நாற்காலி லிப்ட்

# poi_aerialway_t_bar
source: T-bar lift
ta: டி-பார் லிப்ட்

# poi_aerialway_j_bar
source: J-bar lift
ta: சே-பார் லிப்ட்

# poi_aerialway_platter
source: Platter lift
ta: தட்டு லிப்ட்

# poi_aerialway_mixed_lift
source: Mixed lift
ta: கலப்பு லிப்ட்

# poi_aerialway_drag_lift
source: Drag lift
ta: இழுத்தல்

# poi_aerialway_rope_tow
source: Rope tow lift
ta: கயிறு கயிறு லிப்ட்

# poi_aerialway_goods
source: Goods lift
ta: பொருட்கள் லிப்ட்

# poi_aerialway_magic_carpet
source: Carpet lift
ta: கார்பெட் லிப்ட்

# poi_aerialway_pylon
source: Aerial lift pylon
ta: வான்வழி லிப்ட் பைலோன்

# poi_tunnel
source: Tunnel
ta: சுரங்கப்பாதை

# poi_bridge
source: Bridge
ta: பாலம்

# poi_speed_camera
source: Speed camera
ta: வேக கேமரா

# poi_turning_circle
source: Turning circle
ta: திருப்ப வட்டம்

# poi_motorway_junction
source: Motorway junction
ta: மின்னோடி பாதை சந்தி

# poi_junction
source: Junction
ta: சந்தி

# poi_rest_area
source: Rest area
ta: ஓய்வு பகுதி

# poi_escape_lane
source: Escape lane
ta: எச்கேப் லேன்

# poi_water_well
source: Water well
ta: நீர் கிணறு

# poi_standpipe
source: Standpipe
ta: ச்டாண்ட்பைப்

# poi_water_works
source: Water works
ta: நீர் வேலை செய்கிறது

# poi_boatyard
source: Boatyard
ta: படகு முற்றம்

# poi_wastewater_plant
source: Wastewater plant
ta: கழிவு நீர் ஆலை

# poi_water_tower
source: Water tower
ta: நீர் கோபுரம்

# poi_lock_gate
source: Lock gate
ta: பூட்டு வாயில்

# poi_waterway_turning_point
source: Waterway turning point
ta: நீர்வழி திருப்புமுனை

# poi_weir
source: Weir
ta: வீர்

# poi_dam
source: Dam
ta: அணை

# poi_watermill
source: Water mill
ta: நீர் ஆலை

# poi_breakwater
source: Breakwater
ta: பிரேக்வாட்டர்

# poi_groyne
source: Groyne
ta: க்ரோய்ன்

# poi_power_substation
source: Substation
ta: துணை மின்நிலையம்

# poi_power_transformer
source: Transformer
ta: மின்மாற்றி

# poi_power_plant
source: Power plant
ta: மின் நிலையம்

# poi_power_generator
source: Power generator
ta: ஆற்றல் செனரேட்டர்

# poi_power_tower
source: Power tower
ta: ஆற்றல் கோபுரம்

# poi_power_pole
source: Power pole
ta: ஆற்றல் கம்பம்

# poi_post_office
source: Post office
ta: தபால் அலுவலகம்

# poi_post_box
source: Post box
ta: இடுகை பெட்டி

# poi_telephone
source: Telephone
ta: தொலைபேசி

# poi_communication_tower
source: Communication tower
ta: தொடர்பு கோபுரம்

# poi_observation_tower
source: Observation tower
ta: கண்காணிப்பு கோபுரம்

# poi_bell_tower
source: Bell tower
ta: மணி கோபுரம்

# poi_cooling_tower
source: Cooling tower
ta: குளிரூட்டும் கோபுரம்

# poi_lighting_tower
source: Lighting tower
ta: லைட்டிங் டவர்

# poi_telephone_exchange
source: Telephone exchange
ta: தொலைபேசி பரிமாற்றம்

# poi_recycling
source: Recycling
ta: மறுசுழற்சி

# poi_recycling_centre
source: Recycling center
ta: மறுசுழற்சி நடுவண்

# poi_recycling_container
source: Container
ta: சரக்குப் பெட்டகம்

# poi_recycling_glass
source: Glass
ta: கண்ணாடி

# poi_recycling_paper
source: Paper
ta: காகிதம்

# poi_recycling_clothes
source: Clothes
ta: ஆடைகள்

# poi_recycling_cans
source: Cans
ta: கேன்கள்

# poi_recycling_glass_bottles
source: Glass bottles
ta: கண்ணாடி பாட்டில்கள்

# poi_recycling_plastic
source: Plastic
ta: நெகிழி

# poi_recycling_scrap_metal
source: Scrap metal
ta: ச்கிராப் மெட்டல்

# poi_recycling_batteries
source: Batteries
ta: பேட்டரிகள்

# poi_recycling_plastic_bottles
source: Plastic bottles
ta: பிளாச்டிக் பாட்டில்கள்

# poi_recycling_green_waste
source: Green waste
ta: பச்சை கழிவுகள்

# poi_recycling_waste
source: Waste (black bags)
ta: கழிவு (கருப்பு பைகள்)

# poi_recycling_plastic_packaging
source: Plastic packaging
ta: பிளாச்டிக் பேக்கேசிங்

# poi_recycling_newspaper
source: Newspaper
ta: செய்தித்தாள்

# poi_recycling_cartons
source: Cartons
ta: அட்டைப்பெட்டிகள்

# poi_recycling_cardboard
source: Cardboard
ta: அட்டை

# poi_recycling_magazines
source: Magazines
ta: பத்திரிகைகள்

# poi_recycling_paper_packaging
source: Paper packaging
ta: காகித பேக்கேசிங்

# poi_recycling_small_appliances
source: Small appliances
ta: சிறிய உபகரணங்கள்

# poi_recycling_small_electrical_appliances
source: Small electrical appliances
ta: சிறிய மின் உபகரணங்கள்

# poi_recycling_wood
source: Wood
ta: மரம்

# poi_recycling_books
source: Books
ta: புத்தகங்கள்

# poi_recycling_shoes
source: Shoes
ta: காலணிகள்

# poi_recycling_aluminium
source: Aluminium
ta: அளமியம்

# poi_recycling_organic
source: Organic
ta: ஆர்கானிக்

# poi_recycling_beverage_cartons
source: Beverage cartons
ta: பான அட்டைப்பெட்டிகள்

# poi_recycling_garden_waste
source: Garden waste
ta: தோட்டக் கழிவு

# poi_recycling_low_energy_bulbs
source: Low energy bulbs
ta: குறைந்த ஆற்றல் பல்புகள்

# poi_recycling_fluorescent_tubes
source: Fluorescent tubes
ta: ஃப்ளோரசன்ட் குழாய்கள்

# poi_recycling_metal
source: Metal
ta: மாழை

# poi_recycling_electrical_items
source: Electrical items
ta: மின் பொருட்கள்

# poi_recycling_white_goods
source: White goods
ta: வெள்ளை பொருட்கள்

# poi_recycling_cooking_oil
source: Cooking oil
ta: சமையல் எண்ணெய்

# poi_recycling_engine_oil
source: Engine oil
ta: எஞ்சின் எண்ணெய்

# poi_recycling_hazardous_waste
source: Hazardous waste
ta: அபாயகரமான கழிவு

# poi_recycling_mobile_phones
source: Mobile phones
ta: மொபைல் போன்கள்

# poi_recycling_hydrargyrum
source: Hydrargyrum
ta: ஐட்ர்கீரம்

# poi_recycling_computers
source: Computers
ta: கணினிகள்

# poi_recycling_tyres
source: Tires
ta: டயர்கள்

# poi_recycling_tv_monitor
source: TV, monitors
ta: டிவி, மானிட்டர்கள்

# poi_recycling_tetrapak
source: Tetrapak
ta: டெட்ராபக்

# poi_recycling_rubble
source: Rubble
ta: இடிபாடுகள்

# poi_recycling_cds
source: CDs
ta: குறுந்தகடுகள்

# poi_recycling_waste_oil
source: Waste oil
ta: கழிவு எண்ணெய்

# poi_recycling_bottles
source: Bottles
ta: பாட்டில்கள்

# poi_recycling_cork
source: Cork
ta: கார்க்

# poi_recycling_printer_cartridges
source: Printer cartridges
ta: அச்சுப்பொறி தோட்டாக்கள்

# poi_recycling_sheet_metal
source: Sheet metal
ta: தாள் உலோகம்

# poi_recycling_foil
source: Foil
ta: படலம்

# poi_recycling_paint
source: Paint
ta: வண்ணப்பூச்சு

# poi_recycling_styrofoam
source: Styrofoam
ta: மலக்கிய மெத்து

# poi_recycling_drugs
source: Drugs
ta: மருந்துகள்

# poi_recycling_compost
source: Compost
ta: குப்பையுரம், கழிவுப்பசளை, கழிவுரம்

# poi_recycling_hardcore
source: Hardcore
ta: ஆர்ட்கோர்

# poi_recycling_christmas_trees
source: Christmas trees
ta: கிறிச்துமச் மரங்கள்

# poi_recycling_light_bulbs
source: Light bulbs
ta: ஒளி விளக்குகள்

# poi_recycling_chipboard
source: Chipboard
ta: சிபோர்டு

# poi_recycling_polyester
source: Polyester
ta: பலபடியத்தர், பலமரிழை

# poi_recycling_plasterboard
source: Plasterboard
ta: பிளாச்டர்போர்டு

# poi_recycling_animal_waste
source: Animal waste
ta: விலங்கு கழிவுகள்

# poi_recycling_fridge_and_freezer
source: Fridge and freezer
ta: குளிர்சாதன பெட்டி மற்றும் உறைவிப்பான்

# poi_recycling_furniture
source: Furniture
ta: தளபாடங்கள்

# poi_recycling_diapers
source: Diapers
ta: டயப்பர்கள்

# poi_recycling_car_batteries
source: Car batteries
ta: கார் பேட்டரிகள்

# poi_recycling_cars
source: Cars
ta: கார்கள்

# poi_recycling_bicycles
source: Bicycles
ta: மிதிவண்டிகள்

# poi_recycling_pet_drink_bottles
source: PET beverage bottles
ta: செல்லப்பிராணி பான பாட்டில்கள்

# poi_landfill
source: Landfill
ta: நிலப்பரப்பு

# poi_landfill_waste_nuclear
source: Nuclear waste
ta: அணுக்கழிவுகள்

# poi_waste_disposal
source: Trash disposal
ta: குப்பை அகற்றுதல்

# poi_waste_basket
source: Trash can
ta: குப்பை முடியும்

# poi_residential
source: Residential area
ta: குடியிருப்பு பகுதி

# poi_industrial
source: Industrial area
ta: தொழில்துறை பகுதி

# poi_landuse_railway
source: Railroad area
ta: இரயில் பாதை

# poi_commercial
source: Commercial landuse
ta: வணிக லேண்டச்

# poi_retail
source: Retail landuse
ta: சில்லறை லேண்டச்

# poi_quarry
source: Quarry
ta: குவாரி

# poi_vineyard
source: Vineyard
ta: வினயார்ட்

# poi_orchard
source: Orchard
ta: பழத்தோட்டம்

# poi_allotments
source: Allotments
ta: ஒதுக்கீடுகள்

# poi_forest
source: Human maintained forest
ta: மனிதனாக பராமரிக்கப்படும் காடு

# poi_farmyard
source: Farmyard
ta: பண்ணை

# poi_meadow
source: Meadow
ta: புல்வெளி

# poi_basin
source: Basin
ta: பேசின்

# poi_canal
source: Canal
ta: கால்வாய்

# poi_pier
source: Pier
ta: பாந்து

# poi_surveillance
source: Surveillance
ta: கண்காணிப்பு

# poi_observatory
source: Observatory
ta: ஆய்வகம்

# poi_astronomical_observatory
source: Astronomical
ta: வானியல்

# poi_tower
source: Tower
ta: கோபுரம்

# poi_mast
source: Mast
ta: மாச்ட்

# poi_monitoring_station
source: Monitoring station
ta: கண்காணிப்பு நிலையம்

# poi_radar
source: Radar
ta: கதிரலைக் கும்பா

# poi_crane
source: Crane
ta: கிரேன்

# poi_construction
source: Construction
ta: கட்டுமானம்

# poi_brownfield
source: Brownfield
ta: பிரவுன்ஃபீல்ட்

# poi_greenfield
source: Greenfield
ta: கிரீன்ஃபீல்ட்

# poi_works
source: Works
ta: படைப்புகள்

# poi_petroleum_well
source: Petroleum well
ta: பெட்ரோலிய கிணறு

# poi_survey_point
source: Survey point
ta: கணக்கெடுப்பு புள்ளி

# poi_windmill
source: Windmill
ta: காற்றாலை

# poi_salt_pond
source: Salt pond
ta: உப்பு குளம்

# poi_reservoir
source: Reservoir
ta: நீர்த்தேக்கம்

# poi_cricket_nets
source: Cricket nets
ta: கிரிக்கெட் வலைகள்

# poi_gasometer
source: Gasometer
ta: கேசோமீட்டர்

# poi_silo
source: Silo
ta: சிலோ

# poi_bunker_silo
source: Bunker silo
ta: பங்கர் சிலோ

# poi_storage_tank
source: Storage tank
ta: சேமிப்பக தொட்டி

# poi_college
source: College
ta: கல்லூரி

# poi_driving_school
source: Driving school
ta: ஓட்டுநர் பள்ளி

# poi_kindergarten
source: Kindergarten
ta: மழலையர் பள்ளி

# poi_school
source: School
ta: பள்ளி

# poi_training
source: Training facility
ta: பயிற்சி வசதி

# poi_university
source: University
ta: பல்கலைக்கழகம்

# poi_social_facility
source: Social facility
ta: சமூக வசதி

# poi_courthouse
source: Courthouse
ta: அறமன்றம்

# poi_prison
source: Prison
ta: சிறை

# poi_register_office
source: Civil registry office
ta: குடிமை பதிவு அலுவலகம்

# poi_embassy
source: Embassy
ta: தூதரகம்

# poi_government
source: Government
ta: அரசாங்கம்

# poi_bailiff
source: Bailiff
ta: பிணை

# poi_prosecutor
source: Prosecutor
ta: வழக்கறிஞர்

# poi_pension_fund
source: Pension fund
ta: ஓய்வூதிய பொருள்

# poi_migration
source: Migration
ta: குடிபெயர்வு

# poi_tax_inspection
source: Tax inspection
ta: வரி ஆய்வு

# poi_customs
source: Customs
ta: சுங்கம், ஆயம்

# poi_country
source: Country
ta: நாடு

# poi_city
source: City
ta: நகரம்

# poi_capital
source: Yes;Capital
ta: ஆம்; மூலதனம்

# poi_town
source: Town
ta: நகரம்

# poi_village
source: Village
ta: சிற்றூர்

# poi_hamlet
source: Hamlet
ta: குக்கிராமம்

# poi_isolated_dwelling
source: Isolated dwelling
ta: தனிமைப்படுத்தப்பட்ட குடியிருப்பு

# poi_suburb
source: Suburb
ta: புறநகர்

# poi_quarter
source: Quarter
ta: கால்

# poi_neighbourhood
source: Neighbourhood
ta: அக்கம்

# poi_locality
source: Locality
ta: இடம்

# poi_place_allotments
source: Allotments
ta: ஒதுக்கீடுகள்

# poi_place_farm
source: Farm
ta: பண்ணை

# poi_pharmacy
source: Pharmacy
ta: மருந்தகம்

# poi_hospital
source: Hospital
ta: மருத்துவமனை

# poi_doctors
source: Doctors
ta: மருத்துவர்கள்

# poi_clinic
source: Clinic
ta: கிளினிக்

# poi_first_aid
source: First aid
ta: முதல் உதவி

# poi_dentist
source: Dentist
ta: பல் மருத்துவர்

# poi_nursing_home
source: Nursing home
ta: நர்சிங் ஓம்

# poi_baby_hatch
source: Baby hatch
ta: குழந்தை அட்ச்

# poi_veterinary
source: Veterinary
ta: கால்நடை

# poi_sanatorium
source: Sanatorium
ta: சானடோரியம்

# poi_healthcare_alternative
source: Alternative medicine
ta: மாற்று மருந்து

# poi_audiologist
source: Audiologist
ta: ஆடியோலசிச்ட்

# poi_blood_bank
source: Blood bank
ta: இரத்த வங்கி

# poi_midwife
source: Midwife
ta: மருத்துவச்சி

# poi_occupational_therapist
source: Occupational therapist
ta: தொழில்சார் சிகிச்சையாளர்

# poi_optometrist
source: Optometrist
ta: ஆப்டோமெட்ரிச்ட்

# poi_physiotherapist
source: Physiotherapist
ta: பிசியோதெரபிச்ட்

# poi_podiatrist
source: Podiatrist
ta: குழந்தை மருத்துவர்

# poi_psychotherapist
source: Psychotherapist
ta: உளவியல் வல்லுநர்

# poi_healthcare_rehabilitation
source: Rehabilitation
ta: மறுவாழ்வு

# poi_speech_therapist
source: Speech therapist
ta: பேச்சு சிகிச்சையாளர்

# poi_healthcare_yes
source: Medical facility
ta: மருத்துவ வசதி

# poi_paediatrics
source: Paediatrics
ta: குழந்தை மருத்துவம்

# poi_company
source: Company
ta: நிறுவனம்

# poi_insurance
source: Insurance
ta: காப்பீடு

# poi_estate_agent
source: Estate agent
ta: எச்டேட் முகவர்

# poi_lawyer
source: Lawyer
ta: வழக்கறிஞர்

# poi_office_telecommunication
source: Telecommunication office
ta: தொலைத்தொடர்பு அலுவலகம்

# poi_townhall
source: Town hall
ta: பேரூர் ஆல்

# poi_employment_agency
source: Employment office
ta: வேலைவாய்ப்பு அலுவலகம்

# poi_research
source: Research office
ta: ஆராய்ச்சி அலுவலகம்

# poi_it
source: IT office
ta: ஐடி அலுவலகம்

# poi_newspaper
source: Newspaper office
ta: செய்தித்தாள் அலுவலகம்

# poi_architect
source: Architect office
ta: கட்டிடக் கலைஞர் அலுவலகம்

# poi_advertising_agency
source: Advertising agency
ta: விளம்பர நிறுவனம்

# poi_educational_institution
source: Educational institution
ta: கல்வி நிறுவனம்

# poi_studio
source: Studio
ta: ச்டுடியோ

# poi_bookmaker
source: Bookmaker
ta: புத்தகத் தயாரிப்பாளர்

# poi_office_religion
source: Religious office
ta: மத அலுவலகம்

# poi_association
source: Association office
ta: சங்க அலுவலகம்

# poi_financial
source: Financial office
ta: பொருள் அலுவலகம்

# poi_political_party
source: Political party office
ta: அரசியல் கட்சி அலுவலகம்

# poi_notary
source: Notary
ta: நோட்டரி

# poi_foundation
source: Foundation office
ta: அறக்கட்டளை அலுவலகம்

# poi_tax_advisor
source: Tax advisor office
ta: வரி ஆலோசகர் அலுவலகம்

# poi_stadium
source: Stadium
ta: அரங்கம்

# poi_sports_centre
source: Sports center
ta: விளையாட்டு நடுவண்

# poi_golf_course
source: Golf course
ta: கோல்ஃப் மைதானம்

# poi_ice_rink
source: Ice rink
ta: பனி வளையம்

# poi_pitch
source: Pitch
ta: குனிவு

# poi_leisure_track
source: Sports track
ta: விளையாட்டு பாதை

# poi_running_track
source: Running track
ta: இயங்கும் டிராக்

# poi_bicycle_track
source: Bicycle track
ta: சைக்கிள் டிராக்

# poi_horse_track
source: Horse track
ta: குதிரை பாதை

# poi_raceway
source: Raceway
ta: ரேச்வே

# poi_9pin
source: Nine pin bowling
ta: ஒன்பது முள் பந்துவீச்சு

# poi_10pin
source: Ten pin bowling
ta: பத்து முள் பந்துவீச்சு

# poi_archery
source: Archery
ta: வில்வித்தை

# poi_athletics
source: Athletics
ta: தடகள

# poi_american_football
source: American football
ta: அமெரிக்க கால்பந்து

# poi_australian_football
source: Australian football
ta: ஆச்திரேலிய கால்பந்து

# poi_base
source: Base jumping
ta: அடிப்படை சம்பிங்

# poi_baseball
source: Baseball
ta: பேச்பால்

# poi_basketball
source: Basketball
ta: கூடைப்பந்து

# poi_beachvolleyball
source: Beach volleyball
ta: கடற்கரை கைப்பந்து

# poi_bmx
source: BMX
ta: பி.எம்.எக்ச்

# poi_boules
source: Boules
ta: பந்துகள்

# poi_bowls
source: Bowls
ta: கிண்ணங்கள்

# poi_canadian_football
source: Canadian football
ta: கனடிய கால்பந்து

# poi_canoe
source: Canoe
ta: கேனோ

# poi_chess
source: Chess
ta: சதுரங்கம்

# poi_climbing
source: Climbing
ta: ஏறுதல்

# poi_cricket
source: Cricket
ta: கிரிக்கெட்

# poi_croquet
source: Croquet
ta: குரோக்கெட்

# poi_cycling
source: Cycling
ta: சைக்கிள் ஓட்டுதல்

# poi_diving
source: Diving
ta: டைவிங்

# poi_scuba_diving
source: Scuba diving
ta: ச்கூபா டைவிங்

# poi_dog_racing
source: Dog racing
ta: நாய் பந்தயம்

# poi_equestrian
source: Equestrian
ta: குதிரையேற்றம்

# poi_field_hockey
source: Field hockey
ta: புலம் ஆக்கி

# poi_ice_hockey
source: Ice hockey
ta: ஐச் ஆக்கி

# poi_golf
source: Golf
ta: கோல்ஃப்

# poi_gymnastics
source: Gymnastics
ta: சிம்னாச்டிக்ச்

# poi_handball
source: Handball
ta: ஏண்ட்பால்

# poi_hockey
source: Hockey
ta: ஆக்கி

# poi_horse_racing
source: Horse racing
ta: குதிரை பந்தயம்

# poi_ice_skating
source: Ice skating
ta: பனி சறுக்கு

# poi_ice_stock
source: Ice stock
ta: பனி பங்கு

# poi_korfbal
source: Korfball
ta: கூடைப்பந்து

# poi_sport_motor
source: Motor sport
ta: மின்னோடி விளையாட்டு

# poi_sport_multi
source: Multi sport
ta: பல விளையாட்டு

# poi_orienteering
source: Orienteering
ta: ஓரியண்டரிங்

# poi_paddle_tennis
source: Paddle tennis
ta: துடுப்பு டென்னிச்

# poi_paragliding
source: Paragliding
ta: பாராகிளைடிங்

# poi_pelota
source: Pelota
ta: பந்து

# poi_racquet
source: Racquet
ta: ராக்கெட்

# poi_roller_skating
source: Roller skating
ta: ரோலர் ச்கேட்டிங்

# poi_rowing
source: Rowing
ta: ரோயிங்

# poi_rugby_union
source: Rugby union
ta: ரக்பி யூனியன்

# poi_rugby_league
source: Rugby league
ta: ரக்பி லீக்

# poi_sailing
source: Sailing
ta: படகோட்டம்

# poi_shooting
source: Shooting
ta: படப்பிடிப்பு

# poi_skating
source: Skating
ta: ச்கேட்டிங்

# poi_skateboard
source: Skateboard
ta: ச்கேட்போர்டு

# poi_skiing
source: Skiing
ta: பனிச்சறுக்கு

# poi_soccer
source: Soccer
ta: கால்பந்து

# poi_surfing
source: Surfing
ta: சர்ஃபிங்

# poi_swimming
source: Swimming
ta: நீச்சல்

# poi_table_tennis
source: Table tennis
ta: அட்டவணை டென்னிச்

# poi_tennis
source: Tennis
ta: டென்னிச்

# poi_toboggan
source: Toboggan
ta: டொபோகன்

# poi_volleyball
source: Volleyball
ta: கைப்பந்து

# poi_museum
source: Museum
ta: அருங்காட்சியகம்

# poi_memorial
source: Memorial
ta: நினைவு

# poi_artwork
source: Artwork
ta: ஒளிமறைப்பு

# poi_archaeological_site
source: Archaeological site
ta: தொல்பொருள் தளம்

# poi_battlefield
source: Battlefield
ta: போர்க்களம்

# poi_boundary_stone
source: Boundary stone
ta: எல்லைக் கல்

# poi_historic_aircraft
source: Historic aircraft
ta: வரலாற்று வானூர்தி

# poi_historic_cannon
source: Historic cannon
ta: வரலாற்று பீரங்கி

# poi_historic_tank
source: Historic tank
ta: வரலாற்று தொட்டி

# poi_castle
source: Castle
ta: கோட்டை

# poi_city_gate
source: City gate
ta: நகர வாயில்

# poi_fort
source: Fort
ta: கோட்டை

# poi_fountain
source: Fountain
ta: நீரூற்று

# poi_historic_ruins
source: Historic ruins
ta: வரலாற்று இடிபாடுகள்

# poi_rune_stone
source: Rune stone
ta: ரூன் கல்

# poi_wreck
source: Shipwreck
ta: கப்பல் விபத்து

# poi_historic_ship
source: Historic ship
ta: வரலாற்று கப்பல்

# poi_historic_mine
source: Historic mine
ta: வரலாற்று சுரங்கம்

# poi_monument
source: Monument
ta: நினைவுச்சின்னம்

# poi_zoo
source: Zoo
ta: மிருகக்காட்சிசாலை

# poi_aquarium
source: Aquarium
ta: மீன்வளம்

# poi_theme_park
source: Theme park
ta: கருப்பொருள் பார்க்

# poi_photo_booth
source: Photo booth
ta: புகைப்பட சாவடி

# poi_music_venue
source: Music venue
ta: இசை இடம்

# poi_attraction
source: Tourist attraction
ta: சுற்றுலா ஈர்ப்பு

# poi_tourism_yes
source: Touristic object
ta: சுற்றுலா பொருள்

# poi_attraction_amusement_ride
source: Amusement ride
ta: பொழுதுபோக்கு சவாரி

# poi_attraction_animal
source: Animal (attraction)
ta: விலங்கு (ஈர்ப்பு)

# poi_attraction_big_wheel
source: Ferris wheel
ta: பெர்ரிச் சக்கரம்

# poi_attraction_carousel
source: Carousel
ta: கொணர்வி

# poi_attraction_maze
source: Maze
ta: பிரமை

# poi_attraction_roller_coaster
source: Roller coaster
ta: ரோலர் கோச்டர்

# poi_attraction_slide
source: Slide
ta: ச்லைடு
