Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_fuel_type
source: Fuel type
ta: எரிபொருள் வகை

# poi_fuel_avia_type
source: Fuel type (avia)
ta: எரிபொருள் வகை (அவியா)

# poi_payment_type
source: Payment type
ta: கட்டண வகை

# poi_payment_fuel_type
source: Fuel cards
ta: எரிபொருள் அட்டைகள்

# poi_additional_type
source: Additional
ta: கூடுதல்

# poi_internet_access_type
source: Internet access type
ta: இணைய அணுகல் வகை

# poi_vending_type
source: Vending type
ta: விற்பனை வகை

# poi_bicycle_service
source: Bicycle service
ta: சைக்கிள் பணி

# poi_clothes_type
source: Type
ta: வகை

# poi_shoes_type
source: Type
ta: வகை

# poi_fire_hydrant_type
source: Type
ta: வகை

# poi_fire_hydrant_position
source: Position
ta: நிலை

# poi_water_source
source: Water source
ta: நீர் சான்று

# poi_payment_toll_type
source: Payment type
ta: கட்டண வகை

# poi_traffic_signals_sound
source: Sound
ta: ஒலி

# poi_highway_crossing_type
source: Type
ta: வகை

# poi_tactile_paving
source: Tactile paving
ta: தொட்டுணரக்கூடிய நடைபாதை

# poi_service_general
source: Service
ta: பணி

# poi_brushless
source: Brushless
ta: தூரிகை

# poi_self_service
source: Self service
ta: தன்வய பணி

# poi_automated
source: Automated
ta: தானியங்கு

# poi_parking_type
source: Type
ta: வகை

# poi_covered
source: Covered
ta: மூடப்பட்ட

# poi_subway_station_filter
source: Subway station
ta: சுரங்கப்பாதை நிலையம்

# poi_ferry_terminal_cargo
source: Cargo
ta: சரக்கு

# poi_bicycle_parking_type
source: Type
ta: வகை

# poi_aerialway_bicycle
source: Bicycle transportation
ta: சைக்கிள் போக்குவரத்து

# poi_aerialway_heating
source: Heating
ta: வெப்பமாக்கல்

# poi_pump
source: Pump
ta: இறைப்பி

# poi_observatory_designation
source: Designation
ta: பதவி

# poi_telescope_type
source: Type
ta: வகை

# poi_animal_training_type
source: Type
ta: வகை

# poi_diplomatic_filter
source: Diplomatic institution
ta: இராசதந்திர நிறுவனம்

# poi_city_capital
source: Capital
ta: மூலதனம்

# poi_pharmacy_dispensing
source: Dispensing
ta: விநியோகித்தல்

# poi_healthcare_alternative_types
source: Specialty
ta: சிறப்பு

# poi_free_flying_characteristics
source: Characteristic
ta: சிறப்பியல்பு

# poi_archaeological_site_type
source: Type
ta: வகை

# poi_star_rating
source: Star rating
ta: நட்சத்திர மதிப்பீடு

# poi_religion_type
source: Religion
ta: மதம்

# poi_denomination
source: Denomination
ta: பிரிவு

# poi_information_type
source: Type
ta: வகை

# poi_information_contents
source: Contents
ta: உள்ளடக்கங்கள்

# poi_clock_option
source: Additional
ta: கூடுதல்

# poi_scout_camp
source: Scout camp
ta: சாரணர் முகாம்

# poi_backcountry
source: Backcountry
ta: பின்னணி

# poi_resort_type
source: Type
ta: வகை

# poi_piste_difficulty
source: Piste difficulty
ta: பிச்டே தொல்லை

# poi_piste_grooming
source: Piste grooming
ta: பிச்டே சீர்ப்படுத்தல்

# poi_theatre_genre
source: Genre
ta: வகை

# poi_outdoor_seating
source: Outdoor seating
ta: வெளிப்புற இருக்கை

# poi_fee
source: Fee
ta: கட்டணம்

# poi_smoking
source: Smoking
ta: புகைபிடித்தல்

# poi_delivery
source: Delivery
ta: வழங்கு

# poi_drive_in
source: Drive-in
ta: டிரைவ்-இன்

# poi_drive_through
source: Drive through
ta: வழியாக ஓட்டுங்கள்

# poi_takeaway
source: Takeaway
ta: டேக்அவே

# poi_cocktails
source: Cocktails
ta: காக்டெய்ல்

# poi_microbrewery
source: Microbrewery
ta: மைக்ரோ ப்ரூவர்

# poi_beauty_salon_service
source: Service
ta: பணி

# poi_recycling_type
source: Type
ta: வகை

# poi_recycling_accepted_waste
source: Accepted waste
ta: ஏற்றுக்கொள்ளப்பட்ட கழிவு

# poi_shelter_type
source: Type
ta: வகை

# poi_fireplace
source: Fireplace
ta: நெருப்பிடம்

# poi_seasonal
source: Seasonal
ta: பருவகால

# poi_water_characteristic
source: Water characteristic
ta: நீர் பண்பு

# poi_beach_surface_type
source: Surface
ta: மேற்பரப்பு

# poi_nudism
source: Nudism
ta: நிர்வாணம்

# poi_diet
source: Diet
ta: உணவு

# poi_healthcare_speciality
source: Healthcare speciality
ta: சுகாதார சிறப்பு

# poi_massage_type
source: Massage type
ta: மசாச் வகை

# poi_tents
source: Tents
ta: கூடாரங்கள்

# poi_washing_machine
source: Washing machine
ta: சலவை இயந்திரம்

# poi_caravans
source: Caravans
ta: வணிகர்கள்

# poi_power_supply
source: Power supply
ta: மின் வழங்கி

# poi_medical_system
source: Medical system
ta: மருத்துவ அமைப்பு

# poi_home_visit
source: Home visit
ta: வீட்டு வருகை

# poi_dish
source: Dish
ta: டிச்

# poi_payment_transport_type
source: Payment type (transport)
ta: கட்டண வகை (போக்குவரத்து)

# poi_social_facility_type
source: Type
ta: வகை

# poi_social_facility_for
source: Target group
ta: இலக்கு குழு

# poi_compressed_air_filter
source: Compressed air
ta: சுருக்கப்பட்ட காற்று

# poi_vacuum_cleaner_filter
source: Vacuum cleaner
ta: வெற்றிட கிளீனர்

# poi_free_flying_characteristic
source: Characteristic
ta: சிறப்பியல்பு

# poi_cafeteria
source: Cafeteria
ta: சிற்றுண்டிச்சாலை

# poi_zoo_type
source: Type
ta: வகை

# poi_motorcycle_services
source: Services
ta: சேவைகள்

# poi_motorcycle_type
source: Motorcycle type
ta: மின்னோடி சைக்கிள் வகை

# poi_animal_shelter_type
source: Animals accepted
ta: விலங்குகள் ஏற்றுக்கொள்ளப்பட்டன

# poi_animal_shelter_purpose
source: Purpose
ta: நோக்கம்

# poi_boat_rental_type
source: Rented boats
ta: வாடகை படகுகள்

# poi_operational_status
source: Operational status
ta: செயல்பாட்டு நிலை

# poi_water_supply_type
source: Water supply type
ta: நீர் வழங்கல் வகை

# poi_water_purification
source: Water purification
ta: நீர் சுத்திகரிப்பு

# poi_water_place_access
source: Water place access
ta: நீர் இடம் அணுகல்

# poi_climbing_style
source: Climbing style
ta: ஏறும் நடை

# poi_service_car
source: Car service
ta: கார் பணி

# poi_glacier_type
source: Glacier type
ta: பனிப்பாறை வகை

# poi_checkpoint_type
source: Checkpoint type
ta: சோதனைச் சாவடி வகை

# poi_bulk_purchase
source: Bulk purchase
ta: மொத்த கொள்முதல்

# poi_substation_type
source: Type
ta: வகை

# poi_books_type
source: Books
ta: புத்தகங்கள்

# poi_denotation
source: Denotation
ta: குறித்தல்

# poi_park_ride
source: Park and ride
ta: பூங்கா மற்றும் சவாரி

# poi_rtsa_scale_filter
source: Difficulty category
ta: தொல்லை வகை

# poi_climbing_crag_filter
source: Climbing crag
ta: ஏறும் நண்டு

# poi_snowmobile_filter
source: Snowmobile access
ta: ச்னோமொபைல் அணுகல்

# poi_access_bus
source: Bus access
ta: பச் அணுகல்

# poi_access_caravan
source: Caravan access
ta: கேரவன் அணுகல்

# poi_access_motorhome
source: Motorhome access
ta: மோட்டர்ஓம் அணுகல்

# poi_access_trailer
source: Trailer access
ta: டிரெய்லர் அணுகல்

# poi_access_motorcycle
source: Motorcycle access
ta: மின்னோடி சைக்கிள் அணுகல்

# poi_access_moped
source: Moped access
ta: மொபெட் அணுகல்

# poi_access_mofa
source: Mofa access
ta: MOFA அணுகல்

# poi_access_hgv
source: HGV access
ta: HGV அணுகல்

# poi_access_goods
source: Light goods vehicles access
ta: ஒளி பொருட்கள் வாகனங்கள் அணுகல்

# poi_access_disabled
source: Disabled access
ta: முடக்கப்பட்ட அணுகல்

# poi_cash_withdrawal_bank_card
source: Cash withdrawal
ta: பணம் திரும்பப் பெறுதல்

# poi_bath_type
source: Type
ta: வகை

# poi_bath_open_air
source: Open air
ta: திறந்த காற்று

# poi_volcano_type
source: Type
ta: வகை

# poi_volcano_status
source: Status
ta: நிலை

# poi_sms
source: SMS
ta: எச்.எம்.எச்

# poi_video_telephone
source: Video
ta: ஒளிதோற்றம்

# poi_fire_hydrant_pressure_filter
source: Pressure
ta: அழுத்தம்

# poi_traffic_signals_vibration
source: Vibration
ta: அதிர்வு

# poi_traffic_signals_arrow
source: Arrow
ta: அம்பு

# poi_drinking_water_refill
source: Drinking water refill
ta: குடிநீர் மறு நிரப்பல்

# poi_departures_board
source: Departures board
ta: புறப்படும் வாரியம்

# poi_embassy_filter
source: Embassy
ta: தூதரகம்

# poi_consulate_filter
source: Consulate
ta: தூதரகம்

# poi_liaison_filter
source: Liaison
ta: தொடர்பு

# poi_diplomatic_services_non_immigrant_visas_filter
source: Non-immigrant visas
ta: புலம்பெயர்ந்தோர் அல்லாத விசாக்கள்

# poi_diplomatic_services_immigrant_visas_filter
source: Immigrant visas
ta: புலம்பெயர்ந்த விசாக்கள்

# poi_diplomatic_services_citizen_services_filter
source: Citizen services
ta: குடிமக்கள் சேவைகள்

# poi_bay_filter
source: Bay type
ta: விரிகுடா வகை

# poi_access_general
source: General access
ta: பொது அணுகல்

# poi_access_motorcar
source: Motorcar access
ta: மின்னோடி கார் அணுகல்

# poi_access_bicycle
source: Bicycle access
ta: சைக்கிள் அணுகல்

# poi_access_scooter
source: Scooter access
ta: ச்கூட்டர் அணுகல்

# poi_authentication_contactless
source: Contactless auth
ta: தொடர்பு இல்லாத ஏற்பு

# poi_authentication_chip_card
source: Auth by chip card
ta: சிப் அட்டை மூலம் ஏற்பு

# poi_authentication_key
source: Auth by key
ta: விசை மூலம் ஏற்பு

# poi_authentication_app
source: Auth by app
ta: பயன்பாட்டின் மூலம் ஏற்பு

# poi_authentication_phone_call
source: Auth by phone call
ta: தொலைபேசி அழைப்பு மூலம் ஏற்பு

# poi_authentication_short_message
source: Auth by short message
ta: குறுகிய செய்தி மூலம் ஏற்பு

# poi_authentication_none
source: Auth not required
ta: ஏற்பு தேவையில்லை

# poi_permanent_camping
source: Permanent camping
ta: நிரந்தர முகாம்

# poi_shelter_filter
source: Shelter
ta: தங்குமிடம்

# poi_butcher_type
source: Primary meat type
ta: முதன்மை இறைச்சி வகை

# poi_coffee_filter
source: Coffee
ta: காபி

# poi_ice_cream_filter
source: Ice cream
ta: ஐச்கிரீம்

# poi_tobacco_filter
source: Tobacco
ta: புகையிலை

# poi_membership_filter
source: Membership required
ta: உறுப்பினர் தேவை

# poi_medical_supply_filter
source: Medical supply category
ta: மருத்துவ விநியோக வகை

# poi_agrarian_type
source: Agricultural inputs
ta: விவசாய உள்ளீடுகள்

# poi_service_fleurop_filter
source: Fleurop service
ta: Fleurop பணி

# poi_mattress_filter
source: Mattress
ta: மெத்தை

# poi_furniture_filter
source: Furniture
ta: தளபாடங்கள்

# poi_heating_filter
source: Heating
ta: வெப்பமாக்கல்

# poi_fridge_filter
source: Fridge
ta: குளிர்சாதன பெட்டி

# poi_faculty_filter
source: Faculty
ta: ஆசிரிய

# poi_computer_sales
source: Sale of computers
ta: கணினிகளின் விற்பனை

# poi_computer_repair
source: Computer repair
ta: கணினி பழுது

# poi_computer_parts
source: Parts for computers
ta: கணினிகளுக்கான பாகங்கள்

# poi_museum_type
source: Museum topic
ta: அருங்காட்சியக தலைப்பு

# poi_post_office_type
source: Type
ta: வகை

# poi_laundry_service_filter
source: Laundry service
ta: சலவை பணி

# poi_dry_cleaning_filter
source: Dry cleaning
ta: உலர் தூய்மை

# poi_dog
source: Dogs
ta: நாய்கள்

# poi_parking_fee_filter
source: Parking fee
ta: பார்க்கிங் கட்டணம்

# poi_climbing_grade_filter
source: Climbing grade
ta: ஏறும் தகுதி

# poi_climbing_bolt
source: Climbing bolt
ta: ஏறும் போல்ட்

# poi_climbing_bolts_filter
source: Climbing bolts
ta: ஏறும் போல்ட்

# poi_climbing_quality
source: Climbing quality
ta: ஏறும் தகுதி

# poi_hiking_filter
source: Suitable for hiking
ta: நடைபயணத்திற்கு ஏற்றது

# poi_self_checkout
source: Self checkout
ta: தன்வய புதுப்பிப்பு

# poi_waste_accepted
source: Accepted waste
ta: ஏற்றுக்கொள்ளப்பட்ட கழிவு

# poi_vending_machine_fuel_filter
source: Automatic fuel dispensers;Fuel vending machine
ta: தானியங்கி எரிபொருள் விநியோகிப்பாளர்கள்; எரிபொருள் வழங்கும் இயந்திரம்

# poi_second_hand_filter
source: Second hand goods
ta: இரண்டாவது கை பொருட்கள்

# poi_healthcare_speciality_clinic
source: Healthcare speciality: clinic
ta: எல்த்கேர் ச்பெசாலிட்டி: கிளினிக்

# poi_healthcare_speciality_psychotherapist
source: Healthcare speciality: psychotherapist
ta: எல்த்கேர் ச்பெசாலிட்டி: உளவியலாளர்

# poi_healthcare_speciality_laboratory
source: Healthcare speciality: laboratory
ta: சுகாதார சிறப்பு: ஆய்வகம்

# poi_us_maps_recreation_area_activity
source: Recreation area activity
ta: பொழுதுபோக்கு பகுதி செயல்பாடு

# poi_us_maps_recreation_area_open_status
source: Recreation area access status
ta: பொழுதுபோக்கு பகுதி அணுகல் நிலை

# poi_impromptu
source: Impromptu
ta: முன்கூட்டியே

# poi_reservation
source: Reservation
ta: முன்பதிவு

# poi_us_maps_recreation_area_facility
source: Recreation area facility
ta: பொழுதுபோக்கு பகுதி வசதி

# poi_live_music
source: Live music
ta: நேரடி இசை

# poi_cash_in
source: Cash deposit
ta: பண வைப்பு

# poi_camp_site_type
source: Camp site type
ta: முகாம் தள வகை

# poi_cafe_filter
source: Cafe
ta: கஃபே

# poi_network_foot
source: Routes network (hiking)
ta: வழித்தட பிணையம் (ஐகிங்)

# poi_network_cycling
source: Routes network (cycling)
ta: வழித்தட பிணையம் (சைக்கிள் ஓட்டுதல்)

# poi_shop
source: Store
ta: கடை

# poi_shop_general
source: General store
ta: பொது கடை

# poi_shop_food
source: Convenience store and supermarket
ta: வசதியான கடை மற்றும் பல்பொருள் அங்காடி

# poi_emergency
source: Emergency
ta: அவசரநிலை

# poi_emergency_infrastructure
source: Emergency infrastructure
ta: அவசர உள்கட்டமைப்பு

# poi_transportation
source: Transportation
ta: போக்குவரத்து

# poi_road_obstacle
source: Road obstacle
ta: சாலை தடையாக

# poi_filling_station
source: Filling station
ta: நிரப்புதல் நிலையம்

# poi_personal_transport
source: Personal transport
ta: தனிப்பட்ட போக்குவரத்து

# poi_public_transport
source: Public transport
ta: பொது போக்குவரத்து

# poi_air_transport
source: Air transport
ta: விமானப் போக்குவரத்து

# poi_water_transport
source: Water transport
ta: நீர் போக்குவரத்து

# poi_bicycle_transport
source: Bicycle transport
ta: சைக்கிள் போக்குவரத்து

# poi_aerialway_transport
source: Aerialway transport
ta: வான்வழி போக்குவரத்து

# poi_node_networks
source: Hiking/cycling network nodes
ta: ஐகிங்/சைக்கிள் ஓட்டுதல் பிணையம் முனைகள்

# poi_hiking_routes
source: Hiking routes
ta: ஐக்கிங் வழிகள்

# poi_traffic_enforcement
source: Traffic enforcement
ta: போக்குவரத்து அமலாக்கம்

# poi_man_made
source: Man made
ta: மனிதன் தயாரிக்கப்பட்டான்

# poi_transport_construction
source: Transport construction
ta: போக்குவரத்து கட்டுமானம்

# poi_water_supply
source: Water supply
ta: நீர் வழங்கல்

# poi_power
source: Power
ta: விசை

# poi_communication
source: Communication
ta: தொடர்பு

# poi_trash_disposal
source: Trash disposal
ta: குப்பை அகற்றுதல்

# poi_landuse
source: Landuse
ta: கவரும்

# poi_education
source: Education
ta: கல்வி

# poi_administrative
source: Administrative
ta: நிர்வாக

# poi_healthcare
source: Healthcare
ta: சுகாதாரம்

# poi_office
source: Office
ta: அலுவலகம்

# poi_sport
source: Sport
ta: விளையாட்டு

# poi_tourism
source: Tourism
ta: சுற்றுலா

# poi_sightseeing
source: Sightseeing
ta: பார்வையிடல்

# poi_accomodation
source: Accommodation
ta: தங்குமிடம்

# poi_internet_access
source: Internet access
ta: இணைய அணுகல்

# poi_entertainment
source: Leisure
ta: ஓய்வு

# poi_club
source: Club
ta: கிளப்

# poi_sustenance
source: Food
ta: உணவு

# poi_cafe_and_restaurant
source: Cafe and restaurant
ta: கஃபே மற்றும் உணவகம்

# poi_service
source: Service
ta: பணி

# poi_craft
source: Craft
ta: கைவினை

# poi_finance
source: Finance
ta: பொருள்

# poi_natural
source: Natural
ta: இயற்கை

# poi_seamark
source: Nautical
ta: கடல்

# poi_military
source: Military
ta: தரைப்படை

# poi_osmwiki
source: Popular places (Wikipedia)
ta: பிரபலமான இடங்கள் (விக்கிபீடியா)

# poi_water_filter
source: Water;Drinking water
ta: நீர்; குடிநீர்

# poi_user_defined_other
source: User defined
ta: பயனர் வரையறுக்கப்பட்டுள்ளது

# poi_palaeontological_site
source: Palaeontological site
ta: பழங்காலவியல் தளம்

# poi_bakery
source: Bakery
ta: பேக்கரி

# poi_alcohol
source: Liquor store
ta: மதுபான கடை

# poi_cheese
source: Cheese shop
ta: சீச் கடை

# poi_chocolate
source: Chocolate shop
ta: சாக்லேட் கடை

# poi_coffee
source: Coffee shop
ta: காபி கடை

# poi_convenience
source: Convenience store
ta: வசதியான கடை

# poi_mall
source: Mall
ta: மால்

# poi_beverages
source: Beverage store
ta: பான கடை

# poi_butcher
source: Meat market
ta: இறைச்சி சந்தை

# poi_deli
source: Deli
ta: டெலி

# poi_farm
source: Farm store
ta: பண்ணை கடை

# poi_greengrocer
source: Greengrocery
ta: கிரீன் கிராசரி

# poi_seafood
source: Seafood store
ta: கடல் உணவு கடை

# poi_confectionery
source: Confectionery store
ta: மிட்டாய் கடை

# poi_ice_cream
source: Ice cream parlor
ta: ஐச்கிரீம் பார்லர்

# poi_supermarket
source: Supermarket
ta: சூப்பர் மார்க்கெட்

# poi_tea
source: Tea shop
ta: தேயிலை கடை

# poi_pasta
source: Pasta shop
ta: பாச்தா கடை

# poi_pastry
source: Pastry shop
ta: பேச்ட்ரி கடை

# poi_dairy
source: Dairy shop
ta: பால் கடை

# poi_vending_machine
source: Vending machine
ta: விற்பனை இயந்திரம்

# poi_wine
source: Wine store
ta: ஒயின் கடை

# poi_books
source: Bookstore
ta: புத்தகக் கடை

# poi_bicycle
source: Bicycle store
ta: சைக்கிள் கடை

# poi_anime
source: Anime shop
ta: அனிம் கடை

# poi_antiques
source: Antiques store
ta: பழம்பொருட்கள் கடை

# poi_art
source: Art store
ta: கலை கடை

# poi_baby_goods
source: Baby goods
ta: குழந்தை பொருட்கள்

# poi_bag
source: Bag store
ta: பை கடை

# poi_bathroom_furnishing
source: Bathroom furnishings
ta: குளியலறை அலங்காரங்கள்

# poi_bed
source: Bedding store
ta: படுக்கை கடை

# poi_boutique
source: Fashion boutique
ta: ஃபேசன் பூட்டிக்

# poi_camera
source: Cameras and lenses
ta: கேமராக்கள் மற்றும் லென்ச்கள்

# poi_carpet
source: Carpet store
ta: தரைவிரிப்பு கடை

# poi_charity
source: Charity shop
ta: தொண்டு கடை

# poi_chemist
source: Drug store
ta: மருந்துக் கடை

# poi_clothes
source: Apparel store
ta: ஆடை கடை

# poi_clothes_children
source: Children's apparel
ta: குழந்தைகள் ஆடை

# poi_shoes
source: Shoe store
ta: சூ கடை

# poi_candles
source: Candles store
ta: மெழுகுவர்த்திகள் கடை

# poi_computer
source: Computer store
ta: கணினி கடை

# poi_copyshop
source: Copy shop
ta: நகல் கடை

# poi_curtain
source: Curtain store
ta: திரை கடை

# poi_fabric
source: Drapery store
ta: டிராபரி கடை

# poi_dive
source: Diving equipment
ta: டைவிங் உபகரணங்கள்

# poi_doityourself
source: Home improvement store
ta: வீட்டு மேம்பாட்டு கடை

# poi_doors
source: Doors
ta: கதவுகள்

# poi_erotic
source: Erotic store
ta: சிற்றின்ப கடை

# poi_fishing
source: Fishing tackle
ta: மீன்பிடி சமாளிப்பு

# poi_florist
source: Flower shop
ta: மலர் கடை

# poi_frame
source: Picture frame shop
ta: படச்சட்ட கடை

# poi_free_flying
source: Free flying goods store
ta: இலவச பறக்கும் பொருட்கள் கடை

# poi_furniture
source: Furniture store
ta: தளபாடங்கள் கடை

# poi_garden_centre
source: Garden center
ta: தோட்ட நடுவண்

# poi_garden_furniture
source: Garden furniture store
ta: தோட்ட தளபாடங்கள் கடை

# poi_gas
source: Liquid gas store
ta: திரவ காற்று கடை

# poi_shop_yes
source: Shop
ta: கடை

# poi_gift
source: Gift shop
ta: பரிசுக் கடை

# poi_glaziery
source: Glaziery
ta: கிளாசியரி

# poi_hardware
source: Hardware store
ta: வன்பொருள் கடை

# poi_hearing_aids
source: Hearing aids
ta: செவிப்புலன் எய்ட்ச்

# poi_herbalist
source: Herb store
ta: மூலிகை கடை

# poi_hifi
source: HiFi store
ta: ஐஃபி கடை

# poi_houseware
source: Household supply store
ta: வீட்டு விநியோக கடை

# poi_hunting
source: Hunting equipment
ta: வேட்டை உபகரணங்கள்

# poi_interior_decoration
source: Interior decoration store
ta: உள்துறை அலங்கார கடை

# poi_jewelry
source: Jewelry store
ta: நகை கடை

# poi_kiosk
source: Kiosk
ta: கியோச்க்

# poi_kitchen
source: Kitchen furnishings
ta: சமையலறை அலங்காரங்கள்

# poi_leather
source: Leather store
ta: தோல் கடை

# poi_medical_supply
source: Medical supply
ta: மருத்துவ வழங்கல்

# poi_mobile_phone
source: Cell phone store
ta: செல்போன் கடை

# poi_motorcycle
source: Motorcycle store
ta: மின்னோடி சைக்கிள் கடை

# poi_music
source: Music store
ta: இசை கடை

# poi_musical_instrument
source: Musical instruments
ta: இசைக்கருவிகள்

# poi_newsagent
source: Newsagent
ta: செய்தி மூலம்

# poi_optician
source: Optometrist
ta: ஆப்டோமெட்ரிச்ட்

# poi_organic
source: Organic products
ta: கரிம பொருட்கள்

# poi_outdoor
source: Outdoor store
ta: வெளிப்புற கடை

# poi_paint
source: Paint store
ta: வண்ணப்பூச்சு கடை

# poi_pet
source: Pet store
ta: செல்லப்பிராணி கடை

# poi_photo
source: Photo shop
ta: ஃபோட்டோசாப்

# poi_radiotechnics
source: Radiotechnics store
ta: ரேடியோடெக்னிக்ச் கடை

# poi_second_hand
source: Second hand store
ta: இரண்டாவது கை கடை

# poi_scuba_diving_shop
source: Scuba diving goods store
ta: ச்கூபா டைவிங் பொருட்கள் கடை

# poi_ship_chandler
source: Ship chandler
ta: கப்பல் சாண்ட்லர்

# poi_sports
source: Sporting goods
ta: விளையாட்டு பொருட்கள்

# poi_stationery
source: Stationery store
ta: எழுதுபொருள் கடை

# poi_ticket
source: Ticket sales
ta: டிக்கெட் விற்பனை

# poi_tobacco
source: Tobacco store
ta: புகையிலை கடை

# poi_toys
source: Toyshop
ta: டாய்சாப்

# poi_trade
source: Trading post
ta: வர்த்தக இடுகை

# poi_tyres
source: Tire store
ta: டயர் கடை

# poi_vacuum_cleaner
source: Vacuum cleaner store
ta: வெற்றிட கிளீனர் கடை

# poi_variety_store
source: Variety store
ta: வெரைட்டி கடை

# poi_video
source: Video store
ta: வீடியோ கடை

# poi_window_blind
source: Window blind store
ta: சாளர குருட்டு கடை

# poi_department_store
source: Department store
ta: டிபார்ட்மென்ட் கடை

# poi_electronics
source: Electronics store
ta: மின்னணுவியல் கடை

# poi_energy
source: Energy store
ta: ஆற்றல் கடை

# poi_car
source: Car dealer
ta: கார் வணிகர்

# poi_car_parts
source: Auto parts
ta: வாகன பாகங்கள்

# poi_atv
source: Quad store
ta: குவாட் கடை

# poi_cosmetics
source: Cosmetics
ta: அழகுசாதனப் பொருட்கள்

# poi_marketplace
source: Marketplace
ta: சந்தை

# poi_sewing
source: Dry goods store
ta: உலர் பொருட்கள் கடை

# poi_watches
source: Watches shop
ta: கடிகார கடை

# poi_swimming_pool_shop
source: Swimming pool goods store
ta: நீச்சல் குளம் பொருட்கள் கடை

# poi_games
source: Games
ta: விளையாட்டுகள்

# poi_model
source: Scale models
ta: அளவிலான மாதிரிகள்

# poi_trophy
source: Trophies, awards
ta: கோப்பைகள், விருதுகள்

# poi_video_games
source: Video games
ta: வீடியோ கேம்கள்

# poi_pyrotechnics
source: Pyrotechnics
ta: பைரோடெக்னிக்ச்

# poi_weapons
source: Weapons store
ta: ஆயுதக் கடை

# poi_perfumery
source: Perfume store
ta: வாசனை திரவிய கடை

# poi_spices
source: Spices store
ta: மசாலா கடை

# poi_shop_craft
source: Arts and crafts supply store
ta: கலை மற்றும் கைவினைப்பொருட்கள் கடை

# poi_honey
source: Honey store
ta: தேன் கடை

# poi_religion
source: Religious goods
ta: மத பொருட்கள்

# poi_police
source: Police
ta: போலீசார்

# poi_fire_station
source: Fire station
ta: தீயணைப்பு நிலையம்

# poi_emergency_phone
source: Emergency phone
ta: அவசர தொலைபேசி

# poi_fire_hydrant
source: Fire hydrant
ta: தீ ஐட்ரண்ட்

# poi_fire_extinguisher
source: Fire extinguisher
ta: தீயை அணைக்கும்

# poi_fire_flapper
source: Fire flapper
ta: ஃபயர் ஃபிளாப்பர்

# poi_fire_hose
source: Fire hose
ta: தீ குழாய்

# poi_fire_water_pond
source: Fire water pond
ta: தீ நீர் குளம்

# poi_grit_bin
source: Grit bin
ta: கிரிட் பின்

# poi_ambulance_station
source: Ambulance station
ta: ஆம்புலன்ச் நிலையம்

# poi_disaster_response
source: Disaster response station
ta: பேரழிவு மறுமொழி நிலையம்

# poi_emergency_access_point
source: Emergency access point
ta: அவசர அணுகல் புள்ளி

# poi_ford
source: Ford
ta: ஃபோர்டு

# poi_ford_stepping_stones
source: Step-stone bridge
ta: படி-கல் பாலம்

# poi_mountain_pass
source: Mountain pass
ta: மலை பாச்

# poi_gate
source: Gate
ta: வாயில்

# poi_city_wall
source: City wall
ta: நகர சுவர்

# poi_lift_gate
source: Lift gate
ta: லிப்ட் கேட்

# poi_toll_booth
source: Toll booth
ta: டோல் சாவடி

# poi_border_control
source: Border control
ta: எல்லை கட்டுப்பாடு

# poi_traffic_calming_bump
source: Speed Bump
ta: வேக பம்ப்

# poi_traffic_calming_hump
source: Speed Hump
ta: வேக அம்ப்

# poi_traffic_calming_cushion
source: Speed Cushion
ta: வேக குசன்

# poi_traffic_calming_chicane
source: Chicane
ta: சிக்கேன்

# poi_traffic_calming_rumble_strip
source: Rumble strip
ta: ரம்பிள் துண்டு

# poi_traffic_calming_table
source: Speed Table
ta: வேக அட்டவணை

# poi_traffic_calming_choker
source: Choker
ta: சொக்கர்

# poi_traffic_calming_island
source: Traffic island
ta: போக்குவரத்து தீவு

# poi_traffic_signals
source: Stop light
ta: ஒளியை நிறுத்து

# poi_car_repair
source: Car repair
ta: கார் பழுது

# poi_service_tyres
source: Tires
ta: டயர்கள்

# poi_vehicle_inspection
source: Vehicle inspection
ta: வாகன ஆய்வு

# poi_car_wash
source: Car wash
ta: கார் கழுவுதல்
