Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_healthcare_speciality_biochemistry
source: Biological chemistry
ta: உயிரியல் வேதியியல்

# poi_healthcare_speciality_occupational
source: Occupational therapy
ta: தொழில் மருத்தீடு

# poi_healthcare_speciality_child_psychiatry
source: Child psychiatry
ta: குழந்தை உளவியல்

# poi_healthcare_speciality_physiatry
source: Physical medicine and rehabilitation
ta: உடல் மருத்துவம் மற்றும் மறுவாழ்வு

# poi_healthcare_speciality_maxillofacial_surgery
source: Maxillo-facial surgery
ta: மாக்சில்லோ-முக அறுவை மருத்தீடு

# poi_healthcare_speciality_diagnostic_radiology
source: Diagnostic radiology
ta: கண்டறியும் கதிரியக்கவியல்

# poi_healthcare_speciality_gastroenterology
source: Gastroenterology
ta: இரைப்பை குடல்

# poi_healthcare_speciality_stomatology
source: Dentistry
ta: பல் மருத்துவம்

# poi_healthcare_speciality_nephrology
source: Nephrology (renal diseases)
ta: நெப்ராலசி (சிறுநீரக நோய்கள்)

# poi_healthcare_speciality_neurosurgery
source: Neurological surgery
ta: நரம்பியல் அறுவை மருத்தீடு

# poi_healthcare_speciality_neuropsychiatry
source: Neuropsychiatry
ta: நரம்பியல் மனநல மருத்துவம்

# poi_healthcare_speciality_endocrinology
source: Endocrinology
ta: உட்சுரப்பியல்

# poi_healthcare_speciality_nuclear
source: Nuclear medicine
ta: அணு மருத்துவம்

# poi_healthcare_speciality_pathology
source: Pathological anatomy
ta: நோயியல் உடற்கூறியல்

# poi_healthcare_speciality_oncology
source: Oncology
ta: ஆன்காலசி

# poi_healthcare_speciality_tropical_medicine
source: Tropical medicine
ta: வெப்பமண்டல மருத்துவம்

# poi_health_specialty_tropical_medicine_no
source: Health specialty: tropical medicine: no
ta: சுகாதார சிறப்பு: வெப்பமண்டல மருத்துவம்: இல்லை

# poi_healthcare_speciality_obstetrics_postnatal
source: Obstetrics (postnatal)
ta: மகப்பேறியல் (பிரசவத்திற்கு முந்தைய)

# poi_health_specialty_obstetrics_postnatal_no
source: Health specialty: obstetrics (postnatal): no
ta: சுகாதார சிறப்பு: மகப்பேறியல் (பிரசவத்திற்கு முந்தைய): இல்லை

# poi_healthcare_speciality_obstetrics_antenatal
source: Obstetrics (antenatal)
ta: மகப்பேறியல் (பிறப்புக்கு முந்தைய)

# poi_health_specialty_obstetrics_antenatal_no
source: Health specialty: obstetrics (antenatal): no
ta: சுகாதார சிறப்பு: மகப்பேறியல் (பிறப்புக்கு முந்தைய): இல்லை

# poi_healthcare_speciality_social_paediatrics
source: Social paediatrics
ta: சமூக குழந்தை மருத்துவம்

# poi_health_specialty_social_paediatrics_no
source: Health specialty: social paediatrics: no
ta: சுகாதார சிறப்பு: சமூக குழந்தை மருத்துவம்: இல்லை

# poi_healthcare_speciality_obstetrics_caesarean_section
source: Obstetrics (caesarean section)
ta: மகப்பேறியல் (சிசேரியன்)

# poi_health_specialty_obstetrics_caesarean_section_no
source: Health specialty: obstetrics (caesarean section): no
ta: சுகாதார சிறப்பு: மகப்பேறியல் (சிசேரியன்): இல்லை

# poi_healthcare_speciality_addiction
source: Addiction medicine
ta: மயக்கம் மருத்துவம்

# poi_healthcare_speciality_optometry
source: Optometry
ta: ஆப்டோமெட்ரி

# poi_healthcare_speciality_clinical_pathology
source: Clinical pathology
ta: மருத்துவ நோயியல்

# poi_healthcare_speciality_speech_therapy
source: Speech therapy
ta: பேச்சு மருத்தீடு

# poi_healthcare_speciality_manual_therapy
source: Manual therapy
ta: கையேடு மருத்தீடு

# poi_healthcare_speciality_sports
source: Sports medicine
ta: விளையாட்டு மருத்துவம்

# poi_healthcare_speciality_podiatry
source: Podiatry
ta: போடியாட்ரி

# poi_healthcare_speciality_adult_psychiatry
source: Adult psychiatry
ta: வயதுவந்த மனநல மருத்துவம்

# poi_healthcare_speciality_acupuncture
source: Acupuncture
ta: குத்தூசி மருத்துவம்

# poi_healthcare_speciality_homeopathy
source: Homeopathy
ta: ஓமியோபதி

# poi_healthcare_speciality_traditional_chinese_medicine
source: Traditional chinese medicine
ta: பாரம்பரிய சீன மருத்துவம்

# poi_healthcare_speciality_reiki
source: Reiki
ta: ரெய்கி

# poi_healthcare_speciality_herbalism
source: Herbalism
ta: மூலிகை

# poi_healthcare_speciality_chiropractic
source: Chiropractic
ta: சிரோபிராக்டிக்

# poi_healthcare_speciality_naturopathy
source: Naturopathy
ta: இயற்கை மருத்துவம்

# poi_healthcare_speciality_depth
source: Depth psychology
ta: ஆழ உளவியல்

# poi_healthcare_speciality_behavior
source: Behavior
ta: நடத்தை

# poi_healthcare_speciality_palliative_medicine
source: Palliative medicine
ta: நோய்த்தடுப்பு மருத்துவம்

# poi_building_type_pyramid
source: Building type: pyramid
ta: கட்டிட வகை: பிரமிட்

# poi_fitness_centre
source: Fitness center
ta: உடற்பயிற்சி நடுவண்

# poi_fitness
source: Fitness
ta: உடற்பயிற்சி

# poi_billiards
source: Billiards
ta: பில்லியர்ட்ச்

# poi_microwave_oven_yes
source: Microwave oven: yes
ta: மைக்ரோவேவ் அடுப்பு: ஆம்

# poi_microwave_oven_no
source: Microwave oven: no
ta: மைக்ரோவேவ் அடுப்பு: இல்லை

# poi_water_heater_yes
source: Water heater: yes
ta: வாட்டர் ஈட்டர்: ஆம்

# poi_water_heater_no
source: Water heater: no
ta: வாட்டர் ஈட்டர்: இல்லை

# poi_parking_surface
source: Type: surface
ta: வகை: மேற்பரப்பு

# poi_parking_garage_boxes
source: Garage boxes
ta: கேரேச் பெட்டிகள்

# poi_parking_carports
source: Carports
ta: கார்போர்ட்ச்

# poi_dojo
source: Dojo
ta: டோசோ

# poi_gaelic_games
source: Gaelic games
ta: கேலிக் விளையாட்டு

# poi_running
source: Running
ta: இயங்கும்

# poi_netball
source: Netball
ta: நெட்பால்

# poi_karting
source: Karting
ta: கார்டிங்

# poi_badminton
source: Badminton
ta: பேட்மிண்டன்

# poi_judo
source: Judo
ta: சூடோ

# poi_disc_golf
source: Disc golf
ta: வட்டு கோல்ஃப்

# poi_futsal
source: Futsal
ta: ஃபுட்சல்

# poi_rc_car
source: Radio-controlled car racing
ta: ரேடியோ கட்டுப்படுத்தப்பட்ட கார் பந்தயம்

# poi_squash
source: Squash
ta: ச்குவாச்

# poi_shuffleboard
source: Shuffleboard
ta: சஃபிள் போர்டு

# poi_lacrosse
source: Lacrosse
ta: லாக்ரோச்

# poi_boxing
source: Boxing
ta: குத்துச்சண்டை

# poi_official_name
source: Official name
ta: அதிகாரப்பூர்வ பெயர்

# poi_dyke
source: Dyke
ta: டைக்

# poi_dolphin
source: Dolphin
ta: டால்பின்

# poi_forestry_compartment
source: Signpost: forestry compartment
ta: சைன் போச்ட்: வனவியல் பெட்டி

# poi_forestry_allotment
source: Signpost: forestry allotment
ta: சைன் போச்ட்: வனவியல் ஒதுக்கீடு

# poi_inscription_n
source: Inscription:N
ta: பதிவு: என்

# poi_inscription_nw
source: Inscription:NW
ta: கல்வெட்டு: NW

# poi_inscription_w
source: Inscription:W
ta: கல்வெட்டு: டபிள்யூ

# poi_inscription_sw
source: Inscription:SW
ta: கல்வெட்டு: எச்.டபிள்யூ

# poi_inscription_s
source: Inscription:S
ta: கல்வெட்டு: கள்

# poi_inscription_se
source: Inscription:SE
ta: பதிவு: எச்.இ.

# poi_inscription_e
source: Inscription:E
ta: கல்வெட்டு: இ

# poi_inscription_ne
source: Inscription:NE
ta: பதிவு: NE

# poi_construction_yes
source: Under construction
ta: கட்டுமானத்தின் கீழ்

# poi_atm_yes
source: ATM: yes
ta: ஏடிஎம்: ஆம்

# poi_atm_no
source: ATM: no
ta: ஏடிஎம்: இல்லை

# poi_firepit
source: Firepit
ta: ஃபயர்பிட்

# poi_street_cabinet
source: Street cabinet
ta: தெரு அமைச்சரவை

# poi_fair_trade_yes
source: Fair trade: yes
ta: நியாயமான வர்த்தகம்: ஆம்

# poi_fair_trade_no
source: Fair trade: no
ta: நியாயமான வர்த்தகம்: இல்லை

# poi_fair_trade_only
source: Only fair trade products
ta: நியாயமான வர்த்தக தயாரிப்புகள் மட்டுமே

# poi_bandy
source: Bandy
ta: பாண்டி

# poi_protected_area
source: Protected area
ta: பாதுகாக்கப்பட்ட பகுதி

# poi_protection_title
source: Protection title
ta: பாதுகாப்பு தலைப்பு

# poi_protection_object_historic
source: Protection object: historic
ta: பாதுகாப்பு பொருள்: வரலாற்று

# poi_protection_object_nature
source: Protection object: nature
ta: பாதுகாப்பு பொருள்: இயற்கை

# poi_protection_object_habitat
source: Protection object: habitat
ta: பாதுகாப்பு பொருள்: வாழ்விடம்

# poi_protection_object_water
source: Protection object: water
ta: பாதுகாப்பு பொருள்: நீர்

# poi_nuclear_explosion_country
source: Explosion: country
ta: வெடிப்பு: நாடு

# poi_nuclear_explosion_site
source: Explosion: site
ta: வெடிப்பு: தளம்

# poi_nuclear_explosion_type_underground_shaft
source: Explosion type: underground, shaft
ta: வெடிப்பு வகை: நிலத்தடி, தண்டு

# poi_nuclear_explosion_type_underground_tunnel
source: Explosion type: underground, tunnel
ta: வெடிப்பு வகை: நிலத்தடி, சுரங்கப்பாதை

# poi_nuclear_explosion_type_atmospheric
source: Explosion type: atmospheric
ta: வெடிப்பு வகை: வளிமண்டல

# poi_nuclear_explosion_type_atmospheric_airdrop
source: Explosion type: atmospheric, airdrop
ta: வெடிப்பு வகை: வளிமண்டல, ஏர் டிராப்

# poi_nuclear_explosion_type_atmospheric_surface_tower
source: Explosion type: atmospheric, surface, tower
ta: வெடிப்பு வகை: வளிமண்டல, மேற்பரப்பு, கோபுரம்

# poi_nuclear_explosion_type_atmospheric_balloon
source: Explosion type: atmospheric, balloon
ta: வெடிப்பு வகை: வளிமண்டல, பலூன்

# poi_nuclear_explosion_type_atmospheric_atmospheric_surface
source: Explosion type: atmospheric, surface
ta: வெடிப்பு வகை: வளிமண்டல, மேற்பரப்பு

# poi_nuclear_explosion_type_atmospheric_water_surface_barge
source: Explosion type: atmospheric, water surface, barge
ta: வெடிப்பு வகை: வளிமண்டல, நீர் மேற்பரப்பு, பார்க்

# poi_nuclear_explosion_type_underground
source: Explosion type: underground
ta: வெடிப்பு வகை: நிலத்தடி

# poi_nuclear_explosion_type_cratering_burst
source: Explosion type: cratering burst (shallow subsurface)
ta: வெடிப்பு வகை: பள்ளம் வெடிப்பு (ஆழமற்ற மேற்பரப்பு)

# poi_nuclear_explosion_type_atmospheric_rocket_or_missile
source: Explosion type: atmospheric, rocket or missile
ta: வெடிப்பு வகை: வளிமண்டல, ராக்கெட் அல்லது ஏவுகணை

# poi_nuclear_explosion_type_space
source: Explosion type: space (altitude over 80 km)
ta: வெடிப்பு வகை: இடம் (80 கி.மீ.க்கு மேல் உயரம்)

# poi_nuclear_explosion_type_underwater
source: Explosion type: underwater
ta: வெடிப்பு வகை: நீருக்கடியில்

# poi_nuclear_explosion_date_utc
source: Explosion date (UTC)
ta: வெடிப்பு தேதி (UTC)

# poi_nuclear_explosion_shot_name_en
source: Shot name (en)
ta: காட்சி பெயர் (en)

# poi_nuclear_explosion_series
source: Explosion series
ta: வெடிப்பு தொடர்

# poi_nuclear_explosion_purpose_nuclear_weapons_related
source: Explosion purpose: nuclear weapons related
ta: வெடிப்பு நோக்கம்: அணு ஆயுதங்கள் தொடர்பான

# poi_nuclear_explosion_purpose_weapons_effects
source: Explosion purpose: weapons effects
ta: வெடிப்பு நோக்கம்: ஆயுத விளைவுகள்

# poi_nuclear_explosion_purpose_safety_experiment
source: Explosion purpose: safety experiment
ta: வெடிப்பு நோக்கம்: பாதுகாப்பு சோதனை

# poi_nuclear_explosion_purpose_research_for_peaceful_applications
source: Explosion purpose: research for peaceful applications
ta: வெடிப்பு நோக்கம்: அமைதியான பயன்பாடுகளுக்கான ஆராய்ச்சி

# poi_nuclear_explosion_purpose_fundamental_science
source: Explosion purpose: fundamental science
ta: வெடிப்பு நோக்கம்: அடிப்படை அறிவியல்

# poi_nuclear_explosion_purpose_industrial_application_cavity_excavation
source: Explosion purpose: industrial application, cavity excavation
ta: வெடிப்பு நோக்கம்: தொழில்துறை பயன்பாடு, குழி அகழ்வாராய்ச்சி

# poi_nuclear_explosion_purpose_industrial_application_seismic_sounding
source: Explosion purpose: industrial application, seismic sounding
ta: வெடிப்பு நோக்கம்: தொழில்துறை பயன்பாடு, நில அதிர்வு ஒலி

# poi_nuclear_explosion_purpose_industrial_application_oil_stimulation
source: Explosion purpose: industrial application, oil stimulation
ta: வெடிப்பு நோக்கம்: தொழில்துறை பயன்பாடு, எண்ணெய் தூண்டுதல்

# poi_nuclear_explosion_purpose_industrial_application
source: Explosion purpose: industrial application
ta: வெடிப்பு நோக்கம்: தொழில்துறை பயன்பாடு

# poi_nuclear_explosion_purpose_industrial_application_earth_moving
source: Explosion purpose: industrial application, earth-moving
ta: வெடிப்பு நோக்கம்: தொழில்துறை பயன்பாடு, பூமியை நகர்த்துதல்

# poi_nuclear_explosion_time_utc
source: Explosion time (UTC)
ta: வெடிப்பு நேரம் (UTC)

# poi_nuclear_explosion_yield
source: Explosion yield
ta: வெடிப்பு மகசூல்

# poi_nuclear_explosion_hole
source: Explosion hole
ta: வெடிப்பு துளை

# poi_nuclear_explosion_height_of_burst
source: Height of burst
ta: வெடிப்பின் உயரம்

# poi_nuclear_explosion_ground_zero_altitude
source: Ground zero altitude
ta: தரையில் சுழிய உயரம்

# poi_nuclear_explosion_body_wave_magnitude
source: Body wave magnitude
ta: உடல் அலை அளவு

# poi_nuclear_explosion_salvo_first_detonation
source: Explosion salvo: first detonation of a salvo test
ta: வெடிப்பு சால்வோ: சால்வோ சோதனையின் முதல் வெடிப்பு

# poi_nuclear_explosion_salvo_second_or_later_detonation
source: Explosion salvo: second or later detonation of a salvo test
ta: வெடிப்பு சால்வோ: சால்வோ சோதனையின் இரண்டாவது அல்லது பின்னர் வெடிக்கும்

# poi_nuclear_explosion_crater_diameter
source: Explosion: crater diameter
ta: வெடிப்பு: பள்ளம் விட்டம்

# poi_nuclear_explosion_warhead
source: Explosion: warhead
ta: வெடிப்பு: வார்எட்

# poi_nuclear_explosion_device
source: Explosion: device
ta: வெடிப்பு: சாதனம்

# poi_addr_housename
source: House name
ta: வீட்டின் பெயர்

# poi_plant_nursery
source: Plant nursery
ta: தாவர நர்சரி

# poi_compressed_air_yes
source: Yes;Compressed air
ta: ஆம்; சுருக்கப்பட்ட காற்று

# poi_compressed_air_no
source: Compressed air: no
ta: சுருக்கப்பட்ட காற்று: இல்லை

# poi_car_wash_yes
source: Yes;Car wash
ta: ஆம்; கார் கழுவுதல்

# poi_vacuum_cleaner_yes
source: Yes;Vacuum cleaner
ta: ஆம்; வெற்றிட கிளீனர்

# poi_vacuum_cleaner_no
source: Vacuum cleaner: no
ta: வெற்றிட கிளீனர்: இல்லை

# poi_amenity_vacuum_cleaner
source: Vacuum cleaner
ta: வெற்றிட கிளீனர்

# poi_sport_free_flying
source: Free flying (sport)
ta: இலவச பறக்கும் (விளையாட்டு)

# poi_water_tap
source: Water tap
ta: நீர் குழாய்

# poi_button_operated_yes
source: Button operated: yes
ta: பொத்தான் இயக்கப்படுகிறது: ஆம்

# poi_button_operated_no
source: Button operated: no
ta: பொத்தான் இயக்கப்படுகிறது: இல்லை

# poi_free_flying_site_takeoff
source: Takeoff
ta: புறப்படும்

# poi_free_flying_site_landing
source: Landing
ta: தரையிறக்கம்

# poi_free_flying_site_toplanding
source: Toplanding
ta: டாப்லேண்டிங்

# poi_free_flying_site_towing
source: Towing
ta: தோண்டும்

# poi_free_flying_site_training
source: Training
ta: பயிற்சி

# poi_free_flying_official_yes
source: Official: yes
ta: அதிகாரி: ஆம்

# poi_free_flying_official_no
source: Official: no
ta: அதிகாரி: இல்லை

# poi_free_flying_paragliding_yes
source: Paragliding
ta: பாராகிளைடிங்

# poi_free_flying_paragliding_no
source: Paragliding: no
ta: பாராகிளைடிங்: இல்லை

# poi_free_flying_hanggliding_yes
source: Hanggliding
ta: சறுக்கு தொங்கு

# poi_free_flying_hanggliding_no
source: Hanggliding: no
ta: ஏங்க்லிங்: இல்லை

# poi_free_flying_rigid_yes
source: Rigid
ta: கடினமான

# poi_free_flying_rigid_no
source: Free flying rigid: no
ta: இலவச பறக்கும் கடினமான: இல்லை

# poi_free_flying_site_orientation_n
source: Free flying site orientation: N
ta: இலவச பறக்கும் தள நோக்குநிலை: n

# poi_free_flying_site_orientation_ne
source: Free flying site orientation: NE
ta: இலவச பறக்கும் தள நோக்குநிலை: NE

# poi_free_flying_site_orientation_e
source: Free flying site orientation: E
ta: இலவச பறக்கும் தள நோக்குநிலை: இ

# poi_free_flying_site_orientation_se
source: Free flying site orientation: SE
ta: இலவச பறக்கும் தள நோக்குநிலை: எச்.இ.

# poi_free_flying_site_orientation_s
source: Free flying site orientation: S
ta: இலவச பறக்கும் தள நோக்குநிலை: கள்

# poi_free_flying_site_orientation_sw
source: Free flying site orientation: SW
ta: இலவச பறக்கும் தள நோக்குநிலை: SW

# poi_free_flying_site_orientation_w
source: Free flying site orientation: W
ta: இலவச பறக்கும் தள நோக்குநிலை: w

# poi_free_flying_site_orientation_nw
source: Free flying site orientation: NW
ta: இலவச பறக்கும் தள நோக்குநிலை: NW

# poi_free_flying_no_flight_time
source: No flight time (free flying)
ta: விமான நேரம் இல்லை (இலவச பறக்கும்)

# poi_free_flying_guest_guidelines_yes
source: Guest guidelines: yes
ta: விருந்தினர் வழிகாட்டுதல்கள்: ஆம்

# poi_free_flying_guest_guidelines_no
source: Guest guidelines: no
ta: விருந்தினர் வழிகாட்டுதல்கள்: இல்லை

# poi_tanning_salon
source: Solarium
ta: சோலாரியம்

# poi_sanitary_dump_station
source: Sanitary dump station
ta: சானிட்டரி டம்ப் நிலையம்

# poi_medical_system_western_yes
source: Western
ta: மேற்கு

# poi_medical_system_chinese_yes
source: Traditional Chinese
ta: பாரம்பரிய சீன

# poi_medical_system_ayurveeda_yes
source: Ayurveeda
ta: ஆயுர்வேதம்

# poi_medical_system_kampo_yes
source: Kampo
ta: புலம்

# poi_medical_system_mongolian_yes
source: Traditional Mongolian
ta: பாரம்பரிய மங்கோலியன்

# poi_medical_system_tibetan_yes
source: Traditional Tibetan
ta: பாரம்பரிய திபெத்திய

# poi_medical_system_sidda_yes
source: Sidda
ta: போன்ற

# poi_medical_system_unani_yes
source: Unani
ta: யுனானி

# poi_health_service_nursing_yes
source: Health service: nursing: yes
ta: சுகாதார சேவை: நர்சிங்: ஆம்

# poi_health_service_nursing_no
source: Health service: nursing: no
ta: சுகாதார சேவை: நர்சிங்: இல்லை

# poi_health_service_counselling_yes
source: Health service: counselling: yes
ta: சுகாதார சேவை: ஆலோசனை: ஆம்

# poi_health_service_counselling_no
source: Health service: counselling: no
ta: சுகாதார சேவை: ஆலோசனை: இல்லை

# poi_health_service_examination_yes
source: Health service: examination: yes
ta: சுகாதார சேவை: தேர்வு: ஆம்

# poi_health_service_examination_no
source: Health service: examination: no
ta: சுகாதார சேவை: தேர்வு: இல்லை

# poi_health_service_child_care_yes
source: Health service: child care: yes
ta: சுகாதார சேவை: குழந்தை பராமரிப்பு: ஆம்

# poi_health_service_child_care_no
source: Health service: child care: no
ta: சுகாதார சேவை: குழந்தை பராமரிப்பு: இல்லை

# poi_health_service_prevention_yes
source: Health service: prevention: yes
ta: சுகாதார சேவை: தடுப்பு: ஆம்

# poi_health_service_prevention_no
source: Health service: prevention: no
ta: சுகாதார சேவை: தடுப்பு: இல்லை

# poi_health_service_prevention_vaccination_yes
source: Health service: vaccination: yes
ta: சுகாதார சேவை: தடுப்பூசி: ஆம்

# poi_health_service_prevention_vaccination_no
source: Health service: vaccination: no
ta: சுகாதார சேவை: தடுப்பூசி: இல்லை

# poi_health_service_support_yes
source: Health service: support: yes
ta: சுகாதார சேவை: ஆதரவு: ஆம்

# poi_health_service_support_no
source: Health service: support: no
ta: சுகாதார சேவை: ஆதரவு: இல்லை

# poi_health_service_test_yes
source: Health service: test: yes
ta: சுகாதார சேவை: சோதனை: ஆம்

# poi_health_service_test_no
source: Health service: test: no
ta: சுகாதார சேவை: சோதனை: இல்லை

# poi_health_facility_type_office
source: Medical office
ta: மருத்துவ அலுவலகம்

# poi_health_facility_type_field_hospital
source: Health facility type: field hospital
ta: சுகாதார வசதி வகை: கள மருத்துவமனை

# poi_health_facility_type_counselling_centre
source: Health facility type: counselling center
ta: சுகாதார வசதி வகை: அறிவுரை நடுவண்

# poi_health_facility_type_laboratory
source: Health facility type: laboratory
ta: சுகாதார வசதி வகை: ஆய்வகம்

# poi_health_facility_type_therapy
source: Health facility type: therapy
ta: சுகாதார வசதி வகை: மருத்தீடு

# poi_health_facility_type_department
source: Health facility type: department
ta: சுகாதார வசதி வகை: துறை

# poi_health_facility_type_dispensary
source: Health facility type: dispensary
ta: சுகாதார வசதி வகை: மருந்தகம்

# poi_health_facility_type_first_aid
source: Health facility type: first aid
ta: சுகாதார வசதி வகை: முதலுதவி

# poi_health_facility_type_nursing_home
source: Health facility type: nursing home
ta: சுகாதார வசதி வகை: நர்சிங் ஓம்

# poi_health_facility_type_support_group_home
source: Health facility type: support group home
ta: சுகாதார வசதி வகை: உதவி குழு வீடு

# poi_suction_point
source: Suction point
ta: உறிஞ்சும் புள்ளி

# poi_fire_hydrant_type_underground
source: Underground
ta: நிலத்தடி

# poi_fire_hydrant_type_pillar
source: Pillar
ta: மாத்திரைகள்

# poi_fire_hydrant_type_dry_barrel
source: Dry barrel
ta: உலர் பீப்பாய்

# poi_fire_hydrant_type_pond
source: Pond
ta: குளம்

# poi_fire_hydrant_type_wall
source: Wall
ta: சுவர்

# poi_health_amenity_type_first_aid_kit
source: First aid kit
ta: முதலுதவி அறிவிலி

# poi_health_amenity_type_scales
source: Public scales
ta: பொது அளவுகள்

# poi_health_person_type_assistant
source: Role of health worker: assistant
ta: சுகாதார பணியாளரின் பங்கு: உதவியாளர்

# poi_health_person_type_healer
source: Role of health worker: healer
ta: சுகாதார பணியாளரின் பங்கு: குணப்படுத்துபவர்

# poi_health_person_type_midwife
source: Role of health worker: midwife
ta: சுகாதார பணியாளரின் பங்கு: மருத்துவச்சி

# poi_health_person_type_nurse
source: Role of health worker: nurse
ta: சுகாதார பணியாளரின் பங்கு: செவிலியர்

# poi_health_person_type_paramedic
source: Role of health worker: paramedic
ta: சுகாதார பணியாளரின் பங்கு: துணை மருத்துவம்

# poi_health_person_type_physician
source: Role of health worker: physician
ta: சுகாதார பணியாளரின் பங்கு: மருத்துவர்

# poi_health_person_type_podologist
source: Role of health worker: podologist
ta: சுகாதார பணியாளரின் பங்கு: போடாலசிச்ட்

# poi_health_person_type_psychologist
source: Role of health worker: psychologist
ta: சுகாதார பணியாளரின் பங்கு: உளவியலாளர்

# poi_health_person_type_therapist
source: Role of health worker: therapist
ta: சுகாதார பணியாளரின் பங்கு: சிகிச்சையாளர்

# poi_health_person_type_physician_assitant
source: Role of health worker: physician assistant
ta: சுகாதார பணியாளரின் பங்கு: மருத்துவர் உதவியாளர்

# poi_health_person_type_technician
source: Role of health worker: technician
ta: சுகாதார பணியாளரின் பங்கு: தொழில்நுட்ப வல்லுநர்

# poi_health_person_type_witchdoctor
source: Role of health worker: witchdoctor
ta: சுகாதார பணியாளரின் பங்கு: விட்ச்டோக்டர்

# poi_counselling_type_addiction_yes
source: Counseling (addiction): yes
ta: அறிவுரை (போதை): ஆம்

# poi_counselling_type_addiction_no
source: Counseling (addiction): no
ta: அறிவுரை (போதை): இல்லை

# poi_counselling_type_antenatal_yes
source: Counseling (antenatal): yes
ta: அறிவுரை (பிறப்புக்கு முந்தைய): ஆம்

# poi_counselling_type_antenatal_no
source: Counseling (antenatal): no
ta: அறிவுரை (பிறப்புக்கு முந்தைய): இல்லை

# poi_counselling_type_child_guidance_yes
source: Counseling (child guidance): yes
ta: அறிவுரை (குழந்தை வழிகாட்டுதல்): ஆம்

# poi_counselling_type_child_guidance_no
source: Counseling (child guidance): no
ta: அறிவுரை (குழந்தை வழிகாட்டுதல்): இல்லை

# poi_counselling_type_couple_yes
source: Counseling (couple): yes
ta: அறிவுரை (சோடி): ஆம்

# poi_counselling_type_couple_no
source: Counseling (couple): no
ta: அறிவுரை (சோடி): இல்லை

# poi_counselling_type_crisis_yes
source: Counseling (crisis): yes
ta: அறிவுரை (நெருக்கடி): ஆம்

# poi_counselling_type_crisis_no
source: Counseling (crisis): no
ta: அறிவுரை (நெருக்கடி): இல்லை

# poi_counselling_type_drugs_yes
source: Counseling (drugs): yes
ta: அறிவுரை (மருந்துகள்): ஆம்

# poi_counselling_type_drugs_no
source: Counseling (drugs): no
ta: அறிவுரை (மருந்துகள்): இல்லை

# poi_counselling_type_education_yes
source: Counseling (education): yes
ta: அறிவுரை (கல்வி): ஆம்

# poi_counselling_type_education_no
source: Counseling (education): no
ta: அறிவுரை (கல்வி): இல்லை

# poi_counselling_type_family_yes
source: Counseling (family): yes
ta: அறிவுரை (குடும்பம்): ஆம்

# poi_counselling_type_family_no
source: Counseling (family): no
ta: அறிவுரை (குடும்பம்): இல்லை

# poi_counselling_type_homeless_yes
source: Counseling (homeless): yes
ta: அறிவுரை (வீடற்றவர்கள்): ஆம்

# poi_counselling_type_homeless_no
source: Counseling (homeless): no
ta: அறிவுரை (வீடற்றவர்கள்): இல்லை

# poi_counselling_type_immigrant_yes
source: Counseling (immigrant): yes
ta: அறிவுரை (புலம்பெயர்ந்தோர்): ஆம்

# poi_counselling_type_immigrant_no
source: Counseling (immigrant): no
ta: அறிவுரை (புலம்பெயர்ந்தோர்): இல்லை

# poi_counselling_type_marriage_yes
source: Counseling (marriage): yes
ta: அறிவுரை (திருமணம்): ஆம்

# poi_counselling_type_marriage_no
source: Counseling (marriage): no
ta: அறிவுரை (திருமணம்): இல்லை

# poi_counselling_type_nutrition_yes
source: Counseling (nutrition): yes
ta: அறிவுரை (ஊட்டச்சத்து): ஆம்

# poi_counselling_type_nutrition_nfire_hydo
source: Counseling (nutrition): no
ta: அறிவுரை (ஊட்டச்சத்து): இல்லை

# poi_counselling_type_rehabilitation_yes
source: Counseling (rehabilitation): yes
ta: அறிவுரை (மறுவாழ்வு): ஆம்
