Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_counselling_type_rehabilitation_no
source: Counseling (rehabilitation): no
ta: அறிவுரை (மறுவாழ்வு): இல்லை

# poi_counselling_type_sexual_yes
source: Counseling (sexual): yes
ta: அறிவுரை (பாலியல்): ஆம்

# poi_counselling_type_sexual_no
source: Counseling (sexual): no
ta: அறிவுரை (பாலியல்): இல்லை

# poi_counselling_type_sexual_abuse_yes
source: Counseling (sexual abuse): yes
ta: அறிவுரை (பாலியல் துச்பிரயோகம்): ஆம்

# poi_counselling_type_sexual_abuse_no
source: Counseling (sexual abuse): no
ta: அறிவுரை (பாலியல் துச்பிரயோகம்): இல்லை

# poi_counselling_type_victim_yes
source: Counseling (victim): yes
ta: அறிவுரை (பாதிக்கப்பட்டவர்): ஆம்

# poi_counselling_type_victim_no
source: Counseling (victim): no
ta: அறிவுரை (பாதிக்கப்பட்டவர்): இல்லை

# poi_counselling_type_violence_yes
source: Counseling (violence): yes
ta: அறிவுரை (வன்முறை): ஆம்

# poi_counselling_type_violence_no
source: Counseling (violence): no
ta: அறிவுரை (வன்முறை): இல்லை

# poi_provided_for_infant_yes
source: Provided for infants: yes
ta: குழந்தைகளுக்கு வழங்கப்பட்டது: ஆம்

# poi_provided_for_infant_no
source: Provided for infants: no
ta: குழந்தைகளுக்கு வழங்கப்பட்டது: இல்லை

# poi_provided_for_toddler_yes
source: Provided for toddlers: yes
ta: குழந்தைகளுக்கு வழங்கப்பட்டது: ஆம்

# poi_provided_for_toddler_no
source: Provided for toddlers: no
ta: குழந்தைகளுக்கு வழங்கப்பட்டது: இல்லை

# poi_provided_for_child_yes
source: Provided for children: yes
ta: குழந்தைகளுக்கு வழங்கப்பட்டது: ஆம்

# poi_provided_for_child_no
source: Provided for children: no
ta: குழந்தைகளுக்கு வழங்கப்பட்டது: இல்லை

# poi_provided_for_adult_yes
source: Provided for adults: yes
ta: பெரியவர்களுக்கு வழங்கப்பட்டது: ஆம்

# poi_provided_for_adult_no
source: Provided for adults: no
ta: பெரியவர்களுக்கு வழங்கப்பட்டது: இல்லை

# poi_provided_for_woman_yes
source: Provided for women: yes
ta: பெண்களுக்கு வழங்கப்பட்டது: ஆம்

# poi_provided_for_woman_no
source: Provided for women: no
ta: பெண்களுக்கு வழங்கப்பட்டது: இல்லை

# poi_provided_for_senior_yes
source: Provided for seniors: yes
ta: மூத்தவர்களுக்கு வழங்கப்பட்டது: ஆம்

# poi_provided_for_senior_no
source: Provided for seniors: no
ta: மூத்தவர்களுக்கு வழங்கப்பட்டது: இல்லை

# poi_provided_for_girl_yes
source: Provided for girls: yes
ta: சிறுமிகளுக்கு வழங்கப்பட்டது: ஆம்

# poi_provided_for_girl_no
source: Provided for girls: no
ta: சிறுமிகளுக்கு வழங்கப்பட்டது: இல்லை

# poi_provided_for_man_yes
source: Provided for men: yes
ta: ஆண்களுக்கு வழங்கப்பட்டது: ஆம்

# poi_provided_for_man_no
source: Provided for men: no
ta: ஆண்களுக்கு வழங்கப்பட்டது: இல்லை

# poi_provided_for_boy_yes
source: Provided for boys: yes
ta: சிறுவர்களுக்கு வழங்கப்பட்டது: ஆம்

# poi_provided_for_boy_no
source: Provided for boys: no
ta: சிறுவர்களுக்கு வழங்கப்பட்டது: இல்லை

# poi_capacity_beds
source: Capacity (beds)
ta: திறன் (படுக்கைகள்)

# poi_treat_inpatient_yes
source: Inpatient services: yes
ta: உள்நோயாளிகள் சேவைகள்: ஆம்

# poi_treat_inpatient_no
source: Inpatient services: no
ta: உள்நோயாளிகள் சேவைகள்: இல்லை

# poi_treat_inpatient_only
source: Inpatient services: only
ta: உள்நோயாளிகள் சேவைகள்: மட்டும்

# poi_counselling_yes
source: Counseling: yes
ta: ஆலோசனை: ஆம்

# poi_counselling_no
source: Counseling: no
ta: ஆலோசனை: இல்லை

# poi_emergency_yes
source: Emergency: yes
ta: அவசரநிலை: ஆம்

# poi_emergency_no
source: Emergency: no
ta: அவசரநிலை: இல்லை

# poi_home_visit_yes
source: Yes;Home visit
ta: ஆம்; வீட்டு வருகை

# poi_home_visit_no
source: Home visit: no
ta: வீட்டு வருகை: இல்லை

# poi_disease_malaria_yes
source: Malaria: yes
ta: மலேரியா: ஆம்

# poi_disease_malaria_no
source: Malaria: no
ta: மலேரியா: இல்லை

# poi_disease_ebola_yes
source: Ebola: yes
ta: எபோலா: ஆம்

# poi_disease_ebola_no
source: Ebola: no
ta: எபோலா: இல்லை

# poi_disease_autism_yes
source: Autism: yes
ta: மன இறுக்கம்: ஆம்

# poi_disease_autism_no
source: Autism: no
ta: மன இறுக்கம்: இல்லை

# poi_disease_aids_yes
source: AIDS: yes
ta: எய்ட்ச்: ஆம்

# poi_disease_aids_no
source: AIDS: no
ta: எய்ட்ச்: இல்லை

# poi_office_physician
source: Physician office
ta: மருத்துவர் அலுவலகம்

# poi_office_therapist
source: Therapist office
ta: சிகிச்சையாளர் அலுவலகம்

# poi_office_podologist
source: Podologist office
ta: போடாலசிச்ட் அலுவலகம்

# poi_office_healer
source: Healer office
ta: குணப்படுத்தும் அலுவலகம்

# poi_office_psychologist
source: Psychologist office
ta: உளவியலாளர் அலுவலகம்

# poi_office_nursing_service
source: Nursing service
ta: நர்சிங் பணி

# poi_office_midwife
source: Midwife office
ta: மருத்துவச்சி அலுவலகம்

# poi_fire_hydrant_diameter
source: Hydrant diameter
ta: ஐட்ரான்ட் விட்டம்

# poi_fire_hydrant_pressure
source: Hydrant pressure
ta: ஐட்ரண்ட் அழுத்தம்

# poi_fire_hydrant_count
source: Hydrant count
ta: ஐட்ரண்ட் எண்ணிக்கை

# poi_fire_hydrant_flow_capacity
source: Hydrant flow capacity
ta: ஐட்ரண்ட் ஓட்ட திறன்

# poi_fire_hydrant_position_sidewalk
source: Sidewalk
ta: நடைபாதை

# poi_fire_hydrant_position_green
source: Green
ta: பச்சை

# poi_fire_hydrant_position_lane
source: Lane
ta: சந்து

# poi_fire_hydrant_position_parking_lot
source: Parking lot
ta: வாகன நிறுத்துமிடம்

# poi_fire_hydrant_position_street
source: Street
ta: தெரு

# poi_fire_hydrant_position_underground
source: Underground
ta: நிலத்தடி

# poi_fire_hydrant_style_wsh
source: Hydrant style: wsh
ta: ஐட்ரண்ட் ச்டைல்: WSH

# poi_water_source_main
source: Main
ta: முக்கிய

# poi_water_source_pond
source: Pond
ta: குளம்

# poi_water_source_stream
source: Stream
ta: ச்ட்ரீம்

# poi_in_service_yes
source: In service: yes
ta: சேவையில்: ஆம்

# poi_street_cabinet_power
source: Cabinet type: power
ta: அமைச்சரவை வகை: ஆற்றல்

# poi_street_cabinet_telecom
source: Cabinet type: telecom
ta: அமைச்சரவை வகை: தொலைத் தொடர்பு

# poi_street_cabinet_cable_tv
source: Cabinet type: cable tv
ta: அமைச்சரவை வகை: கேபிள் டிவி

# poi_street_cabinet_gas
source: Cabinet type: gas
ta: அமைச்சரவை வகை: காற்று

# poi_street_cabinet_postal_service
source: Cabinet type: postal service
ta: அமைச்சரவை வகை: அஞ்சல் பணி

# poi_street_cabinet_waste
source: Cabinet type: waste
ta: அமைச்சரவை வகை: கழிவு

# poi_street_cabinet_water_management
source: Cabinet type: water management
ta: அமைச்சரவை வகை: நீர் மேலாண்மை

# poi_street_cabinet_street_lighting
source: Cabinet type: street lighting
ta: அமைச்சரவை வகை: தெரு விளக்கு

# poi_military_checkpoint
source: Military checkpoint
ta: இராணுவ சோதனைச் சாவடி

# poi_bicycle_parking_lockers
source: Lockers
ta: லாக்கர்கள்

# poi_bicycle_parking_tree
source: Bicycle tree
ta: சைக்கிள் மரம்

# poi_bicycle_parking_streetpod
source: Streetpod
ta: ச்ட்ரீட்போட்

# poi_depth
source: Depth
ta: ஆழம்

# poi_salt_yes
source: Salt
ta: உப்பு

# poi_salt_no
source: Salt: no
ta: உப்பு: இல்லை

# poi_wheelchair_designated
source: Designated
ta: நியமிக்கப்பட்டுள்ளது

# poi_spoil_heap
source: Spoil heap
ta: குவியலைக் கெடுங்கள்

# poi_summer_camp
source: Summer camp
ta: கோடைக்கால முகாம்

# poi_recreation_center
source: Recreation center
ta: பொழுதுபோக்கு நடுவண்

# poi_crossing_activation_automatic
source: Crossing activation: automatic
ta: கடத்தல் செயல்படுத்தல்: தானியங்கி

# poi_crossing_activation_local
source: Crossing activation: local
ta: கடத்தல் செயல்படுத்தல்: உள்ளக

# poi_crossing_activation_remote
source: Crossing activation: remote
ta: கடத்தல் செயல்படுத்தல்: ரிமோட்

# poi_crossing_barrier_no
source: Crossing barrier: no
ta: கடக்கும் தடையாக: இல்லை

# poi_crossing_barrier_yes
source: Crossing barrier
ta: தடுப்பு தடையாகும்

# poi_crossing_barrier_full
source: Crossing barrier: full
ta: கடக்கும் தடை: முழு

# poi_crossing_barrier_half
source: Crossing barrier: half
ta: கடத்தல் தடை: பாதி

# poi_crossing_barrier_double_half
source: Crossing barrier: double half
ta: கடக்கும் தடை: இரட்டை பாதி

# poi_crossing_bell_yes
source: Crossing bell
ta: பெல் கடக்கிறது

# poi_crossing_bell_no
source: Crossing bell: no
ta: கடத்தல் பெல்: இல்லை

# poi_crossing_light_yes
source: Crossing light
ta: ஒளி கடத்தல்

# poi_crossing_light_no
source: Crossing light: no
ta: குறுக்கு ஒளி: இல்லை

# poi_crossing_on_demand_yes
source: Crossing on demand
ta: தேவைக்குக் கடத்தல்

# poi_crossing_on_demand_no
source: Crossing on demand: no
ta: தேவையை கடத்தல்: இல்லை

# poi_crossing_saltire_yes
source: Crossing saltire
ta: உப்பு கடத்தல்

# poi_crossing_saltire_no
source: Crossing saltire: no
ta: கிராசிங் உப்பு: இல்லை

# poi_crossing_supervision_yes
source: Crossing supervision
ta: கண்காணிக்கும் மேற்பார்வை

# poi_crossing_supervision_no
source: Crossing supervision: no
ta: கடக்கும் மேற்பார்வை: இல்லை

# poi_crossing_supervision_attendant
source: Crossing supervision: attendant
ta: கடத்தல் மேற்பார்வை: உதவியாளர்

# poi_crossing_supervision_camera
source: Crossing supervision: camera
ta: மேற்பார்வை கடத்தல்: கேமரா

# poi_dispensing_yes
source: Yes;Dispensing
ta: ஆம்; விநியோகித்தல்

# poi_dispensing_no
source: Dispensing: no
ta: விநியோகித்தல்: இல்லை

# poi_aerodrome_type_international
source: International
ta: பன்னாட்டு

# poi_aerodrome_type_regional
source: Regional
ta: பிராந்திய

# poi_aerodrome_type_public
source: Public
ta: பொது

# poi_aerodrome_type_military
source: Military
ta: தரைப்படை

# poi_aerodrome_type_military_public
source: Military/public
ta: இராணுவ/பொது

# poi_aerodrome_type_private
source: Private
ta: தனிப்பட்ட

# poi_valley_balka
source: Balka
ta: பந்து

# poi_ventilation_shaft
source: Ventilation shaft
ta: காற்றோட்டம் தண்டு

# poi_pump_type_beam_pump
source: Pump type: beam pump
ta: பம்ப் வகை: பீம் பம்ப்

# poi_pump_type_india_mk_2_3
source: Pump type: India Mk II or III>
ta: பம்ப் வகை: இந்தியா எம்.கே II அல்லது III>

# poi_pump_type_gravity
source: Pump type: gravity
ta: பம்ப் வகை: ஈர்ப்பு

# poi_pump_style_modern
source: Pump style: modern
ta: பம்ப் ச்டைல்: நவீன

# poi_pump_style_historic
source: Pump style: historic
ta: பம்ப் ச்டைல்: வரலாற்று

# poi_pump_status_ok
source: Pump status: ok
ta: பம்ப் நிலை: சரி

# poi_pump_status_broken
source: Pump status: broken
ta: பம்ப் நிலை: உடைந்தது

# poi_pump_status_locked
source: Pump status: locked
ta: பம்ப் நிலை: பூட்டப்பட்டுள்ளது

# poi_payment_troika_yes
source: Troika
ta: ட்ரொய்கா

# poi_payment_troika_no
source: Troika card not accepted
ta: ட்ரொய்கா அட்டை ஏற்றுக்கொள்ளப்படவில்லை

# poi_telescope
source: Telescope
ta: தொலைநோக்கி

# poi_telescope_type_optical
source: Optical
ta: ஆப்டிகல்

# poi_telescope_type_radio
source: Radio
ta: வானொலி

# poi_telescope_type_gamma
source: Gamma
ta: காமா

# poi_telescope_diameter
source: Diameter
ta: விட்டம்

# poi_telescope_spectrum
source: Spectrum
ta: நிறமாலை

# poi_telescope_usage_education
source: Usage: education
ta: பயன்பாடு: கல்வி

# poi_telescope_usage_espionage
source: Usage: espionage
ta: பயன்பாடு: உளவு

# poi_telescope_usage_research
source: Usage: research
ta: பயன்பாடு: ஆராய்ச்சி

# poi_observatory_type_espionage
source: Usage: espionage
ta: பயன்பாடு: உளவு

# poi_observatory_type_meteorological
source: Meteorological
ta: வானிலை ஆய்வு

# poi_observatory_type_gravitational
source: Gravitational
ta: ஈர்ப்பு

# poi_greenhouse_horticulture
source: Greenhouse horticulture
ta: கிரீன்அவுச் தோட்டக்கலை

# poi_voltage
source: Voltage
ta: மின்னழுத்தம்

# poi_generator_output_electricity
source: Output power
ta: வெளியீட்டு ஆற்றல்

# poi_generator_output_electricity_yes
source: Output: electricity
ta: வெளியீடு: மின்சாரம்

# poi_generator_output_electricity_no
source: Output (electricity): no
ta: வெளியீடு (மின்சாரம்): இல்லை

# poi_generator_output_hot_water
source: Output power of hot water
ta: சூடான நீரின் வெளியீட்டு ஆற்றல்

# poi_generator_output_hot_water_yes
source: Output: hot water
ta: வெளியீடு: சூடான நீர்

# poi_generator_output_steam_yes
source: Output: steam
ta: வெளியீடு: நீராவி

# poi_generator_output_hot_air_yes
source: Output: hot air
ta: வெளியீடு: சூடான காற்று

# poi_generator_output_cold_water_yes
source: Output: cold water
ta: வெளியீடு: குளிர்ந்த நீர்

# poi_generator_output_compressed_air
source: Output power of compressed air
ta: சுருக்கப்பட்ட காற்றின் வெளியீட்டு ஆற்றல்

# poi_generator_output_compressed_air_yes
source: Output: compressed air
ta: வெளியீடு: சுருக்கப்பட்ட காற்று

# poi_generator_output_vacuum_yes
source: Output: vacuum
ta: வெளியீடு: வெற்றிடம்

# poi_generator_output_biogas
source: Output power of biogas
ta: பயோகாசின் வெளியீட்டு ஆற்றல்

# poi_generator_output_biogas_yes
source: Output: biogas
ta: வெளியீடு: பயோகாச்

# poi_pumping_station
source: Pumping station
ta: உந்தி நிலையம்

# poi_display_yes
source: Display: yes
ta: காட்சி: ஆம்

# poi_display_no
source: Display: no
ta: காட்சி: இல்லை

# poi_display_analog_yes
source: Analog display
ta: அனலாக் காட்சி

# poi_display_digital_yes
source: Digital display
ta: டிசிட்டல் காட்சி

# poi_display_sundial_yes
source: Sundial
ta: சன்டியல்

# poi_barometer_yes
source: Barometer
ta: காற்றழுத்தமானி

# poi_barometer_no
source: Barometer: no
ta: காற்றழுத்தமானி: இல்லை

# poi_thermometer_yes
source: Thermometer
ta: வெப்பமானி

# poi_thermometer_no
source: Thermometer: no
ta: வெப்பமானி: இல்லை

# poi_hygrometer_yes
source: Hygrometer
ta: ஐட்ரோமீட்டர்

# poi_hygrometer_no
source: Hygrometer: no
ta: ஐக்ரோமீட்டர்: இல்லை

# poi_date_yes
source: Date display
ta: தேதி காட்சி

# poi_date_no
source: Date display: no
ta: தேதி காட்சி: இல்லை

# poi_support_pole
source: Support: pole
ta: ஆதரவு: துருவ

# poi_support_wall_mounted
source: Support: wall
ta: ஆதரவு: சுவர்

# poi_support_tree
source: Support: tree
ta: ஆதரவு: மரம்

# poi_support_pedestal
source: Support: pedestal
ta: ஆதரவு: பீடம்

# poi_support_ground
source: Support: ground
ta: ஆதரவு: தரை

# poi_support_billboard
source: Support: billboard
ta: ஆதரவு: விளம்பர பலகை

# poi_support_ceiling
source: Support: ceiling
ta: ஆதரவு: உச்சவரம்பு

# poi_support_suspended
source: Support: suspended
ta: ஆதரவு: இடைநீக்கம்

# poi_support_roof
source: Support: roof
ta: ஆதரவு: கூரை

# poi_support_tower
source: Support: tower
ta: ஆதரவு: கோபுரம்

# poi_passenger_information_display_yes
source: Passenger information display: yes
ta: பயணிகள் செய்தி காட்சி: ஆம்

# poi_passenger_information_display_no
source: Passenger information display: no
ta: பயணிகள் செய்தி காட்சி: இல்லை

# poi_aquaculture
source: Aquaculture
ta: மீன்வளர்ப்பு

# poi_aquaculture_shrimp
source: Aquaculture: shrimp
ta: மீன்வளர்ப்பு: இறால்

# poi_aquaculture_fish
source: Aquaculture: fish
ta: மீன்வளர்ப்பு: மீன்

# poi_aquaculture_mussels
source: Aquaculture: mussels
ta: மீன்வளர்ப்பு: மச்சல்ச்

# poi_min_age
source: Minimum age
ta: குறைந்தபட்ச அகவை

# poi_organic_yes
source: Yes;Organic
ta: ஆம்; ஆர்கானிக்

# poi_organic_no
source: No
ta: இல்லை

# poi_organic_only
source: Only;Organic only
ta: மட்டும்; ஆர்கானிக் மட்டும்

# poi_traffic_mirror
source: Traffic mirror
ta: போக்குவரத்து கண்ணாடி

# poi_diplomatic_consulate
source: Consulate
ta: தூதரகம்

# poi_diplomatic_consulate_general
source: Consulate general
ta: தூதரகம் செனரல்

# poi_diplomatic_honorary_consulate
source: Honorary consulate
ta: கெளரவ தூதரகம்

# poi_diplomatic_permanent_mission
source: Permanent mission
ta: நிரந்தர பணி

# poi_diplomatic_delegation
source: Delegation
ta: தூதுக்குழு

# poi_diplomatic_ambassadors_residence
source: Ambassador's residence
ta: தூதரின் குடியிருப்பு

# poi_diplomatic_high_commission
source: High commission
ta: உயர் ச்தானிகராலயம்

# poi_fire_operator
source: Fire operator
ta: தீ ஆபரேட்டர்

# poi_water_tank
source: Water tank
ta: நீர் தொட்டி

# poi_toilets_disposal_flush
source: Toilets disposal: flush
ta: கழிப்பறைகள் அகற்றல்: பறிப்பு

# poi_toilets_disposal_pitlatrine
source: Toilets disposal: pitlatrine
ta: கழிப்பறைகள் அகற்றல்: குழி கழிவறை

# poi_toilets_disposal_chemical
source: Toilets disposal: chemical
ta: கழிப்பறைகள் அகற்றல்: ரசாயனம்

# poi_toilets_disposal_bucket
source: Toilets disposal: bucket
ta: கழிப்பறைகள் அகற்றல்: வாளி

# poi_length
source: Length
ta: நீளம்

# poi_wiki_link
source: Wikipedia
ta: விக்கிபீடியா

# poi_xmas
source: Christmas
ta: கிறிச்துமச்

# poi_xmas_event
source: Christmas event
ta: கிறிச்துமச் நிகழ்வு

# poi_xmas_market
source: Christmas market
ta: கிறிச்துமச் சந்தை

# poi_xmas_pyramid
source: Christmas pyramid
ta: கிறிச்துமச் பிரமிட்

# poi_xmas_shop
source: Christmas shop
ta: கிறிச்துமச் கடை

# poi_xmas_shop_christmas_tree
source: Tree shop
ta: மரக் கடை

# poi_xmas_tree
source: Christmas tree
ta: கிறிச்துமச் மரம்

# poi_xmas_day_date
source: Xmas: period for the event
ta: கிறித்துமச்: நிகழ்வுக்கான காலம்

# poi_xmas_note
source: Xmas: note
ta: கிறித்துமச்: குறிப்பு

# poi_xmas_opening_hours
source: Xmas: opening hours
ta: கிறித்துமச்: திறக்கும் நேரம்

# poi_xmas_location
source: Xmas: location
ta: கிறித்துமச்: இடம்

# poi_xmas_url
source: Xmas: website
ta: கிறித்துமச்: வலைத்தளம்

# poi_public_bookcase
source: Public bookcase
ta: பொது புத்தக அலமாரி

# poi_public_bookcase_type_phone_box
source: Type: phone box
ta: வகை: தொலைபேசி பெட்டி

# poi_public_bookcase_type_reading_box
source: Type: reading box
ta: வகை: வாசிப்பு பெட்டி

# poi_public_bookcase_type_wooden_cabinet
source: Type: wooden cabinet
ta: வகை: மர அமைச்சரவை

# poi_public_bookcase_type_metal_cabinet
source: Type: metal cabinet
ta: வகை: உலோக அமைச்சரவை

# poi_public_bookcase_type_shelf
source: Type: shelf
ta: வகை: அலமாரி

# poi_cuisine
source: Cuisine
ta: உணவு

# poi_cuisine_pizza
source: Pizza
ta: பீச்சா

# poi_cuisine_burger
source: Burger
ta: பர்கர்

# poi_cuisine_coffee
source: Coffee
ta: காபி

# poi_cuisine_sandwich
source: Sandwich
ta: சாண்ட்விச்

# poi_cuisine_kebab
source: Kebab
ta: கபாப்

# poi_cuisine_doner
source: Doner kebab (shawarma)
ta: கபாப் (சாவர்மா) நன்கொடை அளிக்கவும்

# poi_cuisine_chicken
source: Chicken
ta: கோழி

# poi_cuisine_ice_cream
source: Ice cream
ta: ஐச்கிரீம்

# poi_cuisine_sushi
source: Sushi
ta: சுசி

# poi_cuisine_fish
source: Fish
ta: மீன்

# poi_cuisine_fish_and_chips
source: Fish and chips
ta: மீன் மற்றும் சில்லுகள்

# poi_cuisine_seafood
source: Seafood
ta: கடல் உணவு

# poi_cuisine_barbecue
source: Barbecue
ta: பார்பிக்யூ

# poi_cuisine_noodle
source: Noodle
ta: நூடுல்

# poi_cuisine_donut
source: Donut
ta: டோனட்

# poi_cuisine_ramen
source: Ramen
ta: ராமன்

# poi_cuisine_crepe
source: Crepe
ta: க்ரீப்

# poi_cuisine_breakfast
source: Breakfast
ta: காலை உணவு

# poi_cuisine_beef_bowl
source: Gyudon
ta: கியுடன்

# poi_cuisine_steak
source: Steak
ta: ஊன்

# poi_cuisine_tapas
source: Tapas
ta: தபாச்

# poi_cuisine_gastropub
source: Gastropub
ta: காச்ட்ரோபப்

# poi_cuisine_heuriger
source: Heuriger
ta: ஊரிகர்

# poi_cuisine_curry
source: Curry
ta: கறி

# poi_cuisine_buschenschank
source: Buschenschank
ta: புச்சென்சாங்க்

# poi_cuisine_grill
source: Grill
ta: கிரில்

# poi_cuisine_bagel
source: Bagel
ta: பேகல்

# poi_cuisine_diner
source: Diner
ta: உணவகம்

# poi_cuisine_sausage
source: Sausage
ta: தொத்திறைச்சி

# poi_cuisine_cake
source: Cake
ta: கேக்

# poi_cuisine_pancake
source: Pancake
ta: பான்கேக்

# poi_cuisine_pasta
source: Pasta
ta: பாச்தா

# poi_cuisine_fast_food
source: Fast food
ta: துரித உணவு

# poi_cuisine_juice
source: Juice
ta: சாறு

# poi_cuisine_soba
source: Soba
ta: சோபா

# poi_cuisine_fine_dining
source: Fine dining
ta: நல்ல உணவு

# poi_cuisine_tea
source: Tea
ta: தேநீர்

# poi_cuisine_tea_shop
source: Tea shop
ta: தேயிலை கடை

# poi_cuisine_soup
source: Soup
ta: சூப்

# poi_cuisine_pie
source: Pie
ta: பை

# poi_cuisine_hotdog
source: Hotdog
ta: ஆட் டாக்

# poi_cuisine_deli
source: Deli
ta: டெலி

# poi_cuisine_salad
source: Salad
ta: சாலட்

# poi_cuisine_frozen_yogurt
source: Frozen yogurt
ta: உறைந்த தயிர்

# poi_cuisine_fried_food
source: Fried food
ta: வறுத்த உணவு

# poi_cuisine_savory_pancakes
source: Savory pancakes
ta: சுவையான அப்பங்கள்

# poi_cuisine_bistro
source: Bistro
ta: பிச்ட்ரோ

# poi_cuisine_bakery
source: Bakery
ta: பேக்கரி

# poi_cuisine_couscous
source: Couscous
ta: கூச்கச்

# poi_cuisine_fried_chicken
source: Fried chicken
ta: வறுத்த கோழி

# poi_cuisine_dessert
source: Dessert
ta: இனிப்பு

# poi_cuisine_canteen
source: Canteen
ta: கேண்டீன்

# poi_cuisine_tacos
source: Tacos
ta: டகோச்

# poi_cuisine_piadina
source: Piadina
ta: பியாடினா

# poi_cuisine_falafel
source: Falafel
ta: சுவர்

# poi_cuisine_smoothie
source: Smoothie
ta: மிருதுவான

# poi_cuisine_souvlaki
source: Souvlaki
ta: ச v வ்லகி

# poi_cuisine_snack
source: Snack
ta: சிற்றுண்டி

# poi_cuisine_yogurt
source: Yogurt
ta: தயிர்

# poi_cuisine_gyros
source: Gyros
ta: கைரோச்

# poi_cuisine_empanada
source: Empanada
ta: எம்பனாடா

# poi_cuisine_crepes
source: Crepes
ta: க்ரீப்ச்

# poi_cuisine_yakiniku
source: Yakiniku
ta: யாகினிகு

# poi_cuisine_suki
source: Suki
ta: சுகி

# poi_cuisine_udon
source: Udon
ta: உடோன்

# poi_cuisine_brasserie
source: Brasserie
ta: பிரச்சரி

# poi_cuisine_bubble_tea
source: Bubble tea
ta: குமிழி தேநீர்

# poi_cuisine_yakitori
source: Yakitori
ta: யாகிட்டோரி

# poi_cuisine_sagardotegia
source: Sagardotegia
ta: சைடர் அவுச்

# poi_cuisine_meat
source: Meat
ta: இறைச்சி

# poi_cuisine_wings
source: Wings
ta: சிறகுகள்

# poi_cuisine_waffle
source: Waffle
ta: வாப்பிள்

# poi_cuisine_chocolate
source: Chocolate
ta: சாக்லேட்

# poi_cuisine_wine
source: Wine
ta: மது

# poi_cuisine_potato
source: Potato
ta: உருளைக்கிழங்கு

# poi_cuisine_brunch
source: Brunch
ta: புருன்சில்

# poi_cuisine_sub
source: Sub
ta: துணை

# poi_cuisine_pita
source: Pita
ta: பிடா

# poi_cuisine_fondue
source: Fondue
ta: ஃபாண்ட்யூ

# poi_cuisine_baguette
source: Baguette
ta: பேகூட்

# poi_cuisine_pastel
source: Pastel
ta: பாச்டல்

# poi_cuisine_burrito
source: Burrito
ta: பர்ரிட்டோ

# poi_cuisine_teriyaki
source: Teriyaki
ta: டெர்ரியாக்கி

# poi_cuisine_shawarma
source: Shawarma
ta: சாவர்மா

# poi_cuisine_regional
source: Regional
ta: பிராந்திய

# poi_cuisine_italian
source: Italian
ta: இத்தாலிய

# poi_cuisine_chinese
source: Chinese
ta: சீன

# poi_cuisine_mexican
source: Mexican
ta: மெக்சிகன்

# poi_cuisine_japanese
source: Japanese
ta: சப்பானியர்கள்

# poi_cuisine_german
source: German
ta: செர்மன்

# poi_cuisine_indian
source: Indian
ta: இந்தியன்

# poi_cuisine_american
source: American
ta: அமேரிகன்

# poi_cuisine_asian
source: Asian
ta: ஆசிய

# poi_cuisine_french
source: French
ta: பிரஞ்சு

# poi_cuisine_greek
source: Greek
ta: கிரேக்கம்

# poi_cuisine_thai
source: Thai
ta: தாய்

# poi_cuisine_international
source: International
ta: பன்னாட்டு

# poi_cuisine_turkish
source: Turkish
ta: துருக்கிய

# poi_cuisine_spanish
source: Spanish
ta: ச்பானிச்

# poi_cuisine_vietnamese
source: Vietnamese
ta: வியட்நாமிய

# poi_cuisine_korean
source: Korean
ta: கொரிய

# poi_cuisine_mediterranean
source: Mediterranean
ta: நடு தரைக்கடல்

# poi_cuisine_bavarian
source: Bavarian
ta: பவாரியன்

# poi_cuisine_lebanese
source: Lebanese
ta: லெபனான்

# poi_cuisine_russian
source: Russian
ta: ரச்ய

# poi_cuisine_filipino
source: Filipino
ta: ஃபிலிபினோ

# poi_cuisine_portuguese
source: Portuguese
ta: போர்த்துகீசியம்

# poi_cuisine_georgian
source: Georgian
ta: சார்சியன்

# poi_cuisine_polish
source: Polish
ta: போலீச்

# poi_cuisine_brazilian
source: Brazilian
ta: பிரேசிலிய

# poi_cuisine_arab
source: Arab
ta: அரபு

# poi_cuisine_danish
source: Danish
ta: டேனிச்

# poi_cuisine_indonesian
source: Indonesian
ta: இந்தோனேசிய

# poi_cuisine_african
source: African
ta: ஆப்பிரிக்கன்

# poi_cuisine_caribbean
source: Caribbean
ta: கரீபியன்

# poi_cuisine_argentinian
source: Argentinian
ta: அர்சென்டினா

# poi_cuisine_balkan
source: Balkan
ta: பால்கன்

# poi_cuisine_peruvian
source: Peruvian
ta: பெருவியன்

# poi_cuisine_croatian
source: Croatian
ta: குரோசியன்

# poi_cuisine_bolivian
source: Bolivian
ta: பொலிவியன்

# poi_cuisine_malagasy
source: Malagasy
ta: மலகாசி

# poi_cuisine_persian
source: Persian
ta: பெர்சியன்

# poi_cuisine_moroccan
source: Moroccan
ta: மொராக்கோ

# poi_cuisine_austrian
source: Austrian
ta: ஆச்திரிய

# poi_cuisine_malaysian
source: Malaysian
ta: மலேசியன்

# poi_cuisine_irish
source: Irish
ta: ஐரிச்

# poi_cuisine_ethiopian
source: Ethiopian
ta: எத்தியோப்பியன்

# poi_cuisine_hungarian
source: Hungarian
ta: அங்கேரியன்

# poi_cuisine_lao
source: Lao
ta: லாவோ

# poi_cuisine_european
source: European
ta: ஐரோப்பிய

# poi_cuisine_uzbek
source: Uzbek
ta: உச்பெக்
