Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_motor_vehicle_military
source: Motor vehicle access: military
ta: மின்னோடி வாகன அணுகல்: தரைப்படை

# poi_motor_vehicle_delivery
source: Motor vehicle access: delivery
ta: மின்னோடி வாகன அணுகல்: டெலிவரி

# poi_motor_vehicle_forestry
source: Motor vehicle access: forestry
ta: மின்னோடி வாகன அணுகல்: வனவியல்

# poi_motor_vehicle_agricultural
source: Motor vehicle access: agricultural
ta: மின்னோடி வாகன அணுகல்: உழவு

# poi_hgv_private
source: HGV access: private
ta: HGV அணுகல்: தனியார்

# poi_hgv_no
source: HGV access: no
ta: HGV அணுகல்: இல்லை

# poi_hgv_agricultural
source: HGV access: agricultural
ta: எச்.சி.வி அணுகல்: விவசாய

# poi_hgv_discouraged
source: HGV access: discouraged
ta: எச்.சி.வி அணுகல்: சோர்வுற்றது

# poi_hgv_unsuitable
source: HGV access: unsuitable
ta: எச்.சி.வி அணுகல்: பொருத்தமற்றது

# poi_goods_no
source: Light goods vehicles access: no
ta: ஒளி பொருட்கள் வாகன அணுகல்: இல்லை

# poi_motorcycle_private
source: Motorcycle access: private
ta: மின்னோடி சைக்கிள் அணுகல்: தனியார்

# poi_motorcycle_no
source: Motorcycle access: no
ta: மின்னோடி சைக்கிள் அணுகல்: இல்லை

# poi_moped_no
source: Moped access: no
ta: மொபெட் அணுகல்: இல்லை

# poi_mofa_no
source: Mofa access: no
ta: MOFA அணுகல்: இல்லை

# poi_bicycle_private
source: Bicycle access: private
ta: சைக்கிள் அணுகல்: தனியார்

# poi_bicycle_dismount
source: Bicycle access: dismount
ta: சைக்கிள் அணுகல்: இறக்குதல்

# poi_bicycle_destination
source: Bicycle access: destination
ta: சைக்கிள் அணுகல்: இலக்கு

# poi_bicycle_permissive
source: Bicycle access: permissive
ta: சைக்கிள் அணுகல்: இசைவு

# poi_bicycle_customers
source: Bicycle access: customers
ta: சைக்கிள் அணுகல்: வாடிக்கையாளர்கள்

# poi_horse_yes
source: Horses allowed
ta: குதிரைகள் அனுமதிக்கப்பட்டன

# poi_horse_no
source: Horses not allowed
ta: குதிரைகள் அனுமதிக்கப்படவில்லை

# poi_horse_private
source: Horse access: private
ta: குதிரை அணுகல்: தனியார்

# poi_horse_destination
source: Horse access: destination
ta: குதிரை அணுகல்: இலக்கு

# poi_horse_permissive
source: Horse access: permissive
ta: குதிரை அணுகல்: இசைவு

# poi_horse_forestry
source: Horse access: forestry
ta: குதிரை அணுகல்: வனவியல்

# poi_foot_yes
source: Pedestrian access: yes
ta: பாதசாரி அணுகல்: ஆம்

# poi_foot_private
source: Pedestrian access: private
ta: பாதசாரி அணுகல்: தனியார்

# poi_foot_no
source: Pedestrian access: no
ta: பாதசாரி அணுகல்: இல்லை

# poi_foot_destination
source: Pedestrian access: destination
ta: பாதசாரி அணுகல்: இலக்கு

# poi_foot_permissive
source: Pedestrian access: permissive
ta: பாதசாரி அணுகல்: இசைவு

# poi_foot_customers
source: Pedestrian access: customers
ta: பாதசாரி அணுகல்: வாடிக்கையாளர்கள்

# poi_caravan_no
source: Caravan access: no
ta: கேரவன் அணுகல்: இல்லை

# poi_motorhome_no
source: Motorhome access: no
ta: மோட்டர்ஓம் அணுகல்: இல்லை

# poi_trailer_no
source: Trailer access: no
ta: டிரெய்லர் அணுகல்: இல்லை

# poi_psv_yes
source: PSV access: yes
ta: பி.எச்.வி அணுகல்: ஆம்

# poi_psv_designated
source: PSV access: designated
ta: பி.எச்.வி அணுகல்: நியமிக்கப்பட்டுள்ளது

# poi_psv_no
source: PSV access: no
ta: பி.எச்.வி அணுகல்: இல்லை

# poi_bus_no
source: Bus access: no
ta: பச் அணுகல்: இல்லை

# poi_tourist_bus_yes
source: Tourist bus access: yes
ta: சுற்றுலா பச் அணுகல்: ஆம்

# poi_tourist_bus_designated
source: Tourist bus access: designated
ta: சுற்றுலா பச் அணுகல்: நியமிக்கப்பட்டுள்ளது

# poi_tourist_bus_no
source: Tourist bus access: no
ta: சுற்றுலா பச் அணுகல்: இல்லை

# poi_coach_yes
source: Coach access: yes
ta: பயிற்சியாளர் அணுகல்: ஆம்

# poi_coach_no
source: Coach access: no
ta: பயிற்சியாளர் அணுகல்: இல்லை

# poi_ski_yes
source: Ski access: yes
ta: ச்கை அணுகல்: ஆம்

# poi_ski_no
source: Ski access: no
ta: ச்கை அணுகல்: இல்லை

# poi_snowmobile_private
source: Snowmobile access: private
ta: ச்னோமொபைல் அணுகல்: தனியார்

# poi_snowmobile_no
source: Snowmobile access: no
ta: ச்னோமொபைல் அணுகல்: இல்லை

# poi_agricultural_yes
source: Agricultural vehicles access: yes
ta: விவசாய வாகனங்கள் அணுகல்: ஆம்

# poi_agricultural_no
source: Agricultural vehicles access: no
ta: விவசாய வாகனங்கள் அணுகல்: இல்லை

# poi_taxi_yes
source: Taxi access: yes
ta: டாக்சி அணுகல்: ஆம்

# poi_taxi_designated
source: Taxi access: designated
ta: டாக்சி அணுகல்: நியமிக்கப்பட்டுள்ளது

# poi_taxi_no
source: Taxi access: no
ta: டாக்சி அணுகல்: இல்லை

# poi_disabled_no
source: Access for disabled: no
ta: ஊனமுற்றோருக்கான அணுகல்: இல்லை

# poi_snowmobile_yes
source: Yes;Snowmobile
ta: ஆம்; ச்னோமொபைல்

# poi_snowmobile_designated
source: Designated;Designated for snowmobiles
ta: நியமிக்கப்பட்ட; ச்னோமொபைல்களுக்காக நியமிக்கப்பட்டுள்ளது

# poi_snowmobile_permissive
source: Permissive;Snowmobiles permissive access
ta: அனுமதி; ச்னோமொபைல்கள் இசைவு அணுகல்

# poi_bus_yes
source: Yes;Bus;Buses
ta: ஆம்; பச்; பேருந்துகள்

# poi_bus_designated
source: Designated;Designated for buses
ta: நியமிக்கப்பட்ட; பேருந்துகளுக்காக நியமிக்கப்பட்டுள்ளது

# poi_caravan_yes
source: Yes;Caravan
ta: ஆம்; கேரவன்

# poi_caravan_designated
source: Designated;Designated for caravans
ta: நியமிக்கப்பட்ட; கேரவன்களுக்காக நியமிக்கப்பட்டுள்ளது

# poi_motorhome_yes
source: Yes;Motorhome
ta: ஆம்; மோட்டர்ஓம்

# poi_motorhome_designated
source: Designated;Designated for motorhomes
ta: நியமிக்கப்பட்ட; மோட்டார்ஓம்களுக்காக நியமிக்கப்பட்டுள்ளது

# poi_trailer_yes
source: Yes;Trailer
ta: ஆம்; டிரெய்லர்

# poi_trailer_designated
source: Designated;Designated for trailers
ta: நியமிக்கப்பட்ட; டிரெய்லர்களுக்காக நியமிக்கப்பட்டுள்ளது

# poi_motorcycle_yes
source: Yes;Motorcycle
ta: ஆம்; மின்னோடி சைக்கிள்

# poi_motorcycle_permissive
source: Permissive;Motorcycles permissive access
ta: அனுமதி; மின்னோடி சைக்கிள்கள் அனுமதிக்கப்பட்ட அணுகல்

# poi_motorcycle_destination
source: Destination;Motorcycles destination access
ta: இலக்கு; மின்னோடி சைக்கிள்கள் இலக்கு அணுகல்

# poi_motorcycle_designated
source: Designated;Designated for motorcycles
ta: நியமிக்கப்பட்ட; மின்னோடி சைக்கிள்களுக்காக நியமிக்கப்பட்டுள்ளது

# poi_moped_yes
source: Yes;Moped
ta: ஆம்; மொபெட்

# poi_moped_designated
source: Designated;Designated for mopeds
ta: நியமிக்கப்பட்ட; மொபெட்களுக்காக நியமிக்கப்பட்டுள்ளது

# poi_mofa_yes
source: Yes;Mofa
ta: ஆம்; மோஃபா

# poi_mofa_designated
source: Designated;Designated for mofas
ta: நியமிக்கப்பட்ட; MOFAS க்காக நியமிக்கப்பட்டுள்ளது

# poi_hgv_yes
source: Yes;HGV;Truck;Trucks
ta: ஆம்; HGV; டிரக்; லாரிகள்

# poi_hgv_destination
source: Destination;Trucks destination access
ta: இலக்கு; லாரிகள் இலக்கு அணுகல்

# poi_hgv_permissive
source: Permissive;Trucks permissive access
ta: அனுமதி; லாரிகள் அனுமதிக்கப்பட்ட அணுகல்

# poi_hgv_designated
source: Designated;Trucks designated access
ta: நியமிக்கப்பட்ட; லாரிகள் நியமிக்கப்பட்ட அணுகல்

# poi_hgv_delivery
source: Delivery;Access for delivery trucks
ta: டெலிவரி; டெலிவரி லாரிகளுக்கான அணுகல்

# poi_goods_yes
source: Yes;Light commercial vehicles access
ta: ஆம்; ஒளி வணிக வாகனங்கள் அணுகல்

# poi_goods_designated
source: Designated;Light commercial vehicles designated access
ta: நியமிக்கப்பட்ட; லேசான வணிக வாகனங்கள் அணுகலை நியமித்தன

# poi_disabled_yes
source: Yes;Disabled
ta: ஆம்; முடக்கப்பட்டது

# poi_disabled_designated
source: Designated;Designated access for disabled
ta: நியமிக்கப்பட்ட; ஊனமுற்றோருக்கான நியமிக்கப்பட்ட அணுகல்

# poi_cellar_entrance
source: Cellar entrance
ta: பாதாள நுழைவாயில்

# poi_health_food
source: Health food
ta: சுகாதார உணவு

# poi_craft_builder
source: Builder
ta: பில்டர்

# poi_craft_distillery
source: Distillery
ta: டிச்டில்லரி

# poi_craft_joiner
source: Joiner
ta: சாய்னர்

# poi_craft_floorer
source: Floorer
ta: தரையில்

# poi_craft_bakery
source: Bakehouse
ta: பேக்அவுச்

# poi_craft_cabinet_maker
source: Cabinetmaker
ta: அமைச்சரவை தயாரிப்பாளர்

# poi_charge
source: Charge
ta: மின்னூட்டு

# poi_pet_grooming
source: Pet grooming
ta: செல்லப்பிராணி சீர்ப்படுத்தல்

# poi_cash_withdrawal_yes
source: Cash withdrawal: yes
ta: பணம் திரும்பப் பெறுதல்: ஆம்

# poi_cash_withdrawal
source: Cash withdrawal
ta: பணம் திரும்பப் பெறுதல்

# poi_cash_withdrawal_operator
source: Cash withdrawal operator
ta: பணம் திரும்பப் பெறும் ஆபரேட்டர்

# poi_cash_withdrawal_type_checkout
source: Cash withdrawal type: checkout
ta: பணம் திரும்பப் பெறுதல் வகை: புதுப்பித்து

# poi_cash_withdrawal_type_self_checkout
source: Cash withdrawal type: self checkout
ta: பணம் திரும்பப் பெறுதல் வகை: தன்வய புதுப்பிப்பு

# poi_cash_withdrawal_limit
source: Cash withdrawal limit
ta: பணம் திரும்பப் பெறுதல் வரம்பு

# poi_cash_withdrawal_currency
source: Cash withdrawal currency
ta: பணம் திரும்பப் பெறும் நாணயம்

# poi_cash_withdrawal_purchase_required_yes
source: Cash withdrawal: purchase required
ta: பணம் திரும்பப் பெறுதல்: கொள்முதல் தேவை

# poi_cash_withdrawal_purchase_required_no
source: Cash withdrawal: no purchase required
ta: பணம் திரும்பப் பெறுதல்: கொள்முதல் தேவையில்லை

# poi_cash_withdrawal_fee_yes
source: Cash withdrawal fee: yes
ta: பணம் திரும்பப் பெறும் கட்டணம்: ஆம்

# poi_cash_withdrawal_fee_no
source: Cash withdrawal fee: no
ta: பணம் திரும்பப் பெறும் கட்டணம்: இல்லை

# poi_cash_withdrawal_purchase_minimum
source: Cash withdrawal: minimum purchase
ta: பணம் திரும்பப் பெறுதல்: குறைந்தபட்ச கொள்முதல்

# poi_cash_withdrawal_foreign_cards
source: Cash withdrawal: foreign cards
ta: பணம் திரும்பப் பெறுதல்: வெளிநாட்டு அட்டைகள்

# poi_cash_withdrawal_postfinance_card
source: Postfinance card
ta: போச்ட்ஃபைனான்ச் அட்டை

# poi_cash_withdrawal_migros_bank
source: Migros bank
ta: இடம்பெயர்வு வங்கி

# poi_cash_withdrawal_postbank
source: Postbank
ta: போச்ட்பேங்க்

# poi_bath_type_hot_spring
source: Hot spring
ta: சூடான வேனில்

# poi_bath_type_onsen
source: Onsen
ta: ஒன்சென்

# poi_bath_type_hammam
source: Hammam
ta: அம்மம்

# poi_bath_type_thermal
source: Thermal
ta: வெப்ப

# poi_bath_type_river
source: River
ta: நதி

# poi_bath_type_lake
source: Lake
ta: ஏரி

# poi_bath_type_foot_bath
source: Foot bath
ta: கால் குளியல்

# poi_bath_open_air_yes
source: Yes;Open air bath
ta: ஆம்; திறந்தவெளி குளியல்

# poi_bath_open_air_no
source: No
ta: இல்லை

# poi_monastery_type_monastics
source: Monastery type: monastics
ta: மடாலயம் வகை: மொனாச்டிக்ச்

# poi_monastery_type_convent
source: Monastery type: convent
ta: மடாலயம் வகை: கான்வென்ட்

# poi_monastery_type_canonry
source: Monastery type: canonry
ta: மடாலயம் வகை: நியதி

# poi_monastery_type_hermitage
source: Monastery type: hermitage
ta: மடாலயம் வகை: எர்மிடேச்

# poi_monastery_type_clerks_regular
source: Monastery type: clerks regular
ta: மடாலயம் வகை: எழுத்தர்கள் வழக்கமான

# poi_tourist_camp
source: Tourist camp
ta: சுற்றுலா முகாம்

# poi_community_gender_female
source: Community gender: female
ta: சமூக பாலினம்: பெண்

# poi_community_gender_male
source: Community gender: male
ta: சமூக பாலினம்: ஆண்

# poi_community_gender_mixed
source: Community gender: mixed
ta: சமூக பாலினம்: கலப்பு

# poi_grave
source: Grave
ta: கல்லறை

# poi_parking_space
source: Parking space
ta: பார்க்கிங் இடம்

# poi_url
source: URL
ta: முகவரி

# poi_volcano_type_scoria
source: Scoria
ta: கசடு

# poi_volcano_type_stratovolcano
source: Stratovolcano
ta: ச்ட்ராடோவோல்கானோ

# poi_volcano_type_shield
source: Shield
ta: கவசம்

# poi_volcano_type_maar
source: Maar
ta: ஆனால்

# poi_volcano_type_caldera
source: Caldera
ta: கால்டெரா

# poi_volcano_type_lava_dome
source: Lava dome
ta: எரிமலை குவிமாடம்

# poi_volcano_type_mud
source: Mud
ta: மண்

# poi_volcano_last_eruption
source: Last eruption
ta: கடைசி வெடிப்பு

# poi_volcano_status_extinct
source: Extinct
ta: அழிந்துவிட்டது

# poi_volcano_status_dormant
source: Dormant
ta: செயலற்ற

# poi_volcano_status_active
source: Active
ta: செயலில்

# poi_volcano_status_inactive
source: Inactive
ta: செயலற்றது

# poi_volcano_number_of_eruptions
source: Number of eruptions
ta: வெடிப்புகளின் எண்ணிக்கை

# poi_memorial_ghost_bike
source: Ghost bike
ta: கோச்ட் பைக்

# poi_paintball
source: Paintball
ta: பெயிண்ட்பால்

# poi_mountain_rescue
source: Mountain rescue
ta: மலை மீட்பு

# poi_shop_security
source: Security store
ta: பாதுகாப்பு கடை

# poi_bowling_alley
source: Bowling center
ta: பந்துவீச்சு நடுவண்

# poi_piste_ref
source: Piste reference number
ta: பிச்டே குறிப்பு எண்

# poi_resort_hunting
source: Hunting base
ta: வேட்டை அடிப்படை

# poi_dive_centre
source: Scuba diving centre
ta: ச்கூபா டைவிங் நடுவண்

# poi_sms_yes
source: Yes;SMS
ta: ஆம்; எச்.எம்.எச்

# poi_sms_no
source: No
ta: இல்லை

# poi_covered_booth
source: Booth
ta: பூத்

# poi_booth
source: Booth type
ta: பூத் வகை

# poi_video_yes
source: Yes;Video
ta: ஆம்; வீடியோ

# poi_video_no
source: No
ta: இல்லை

# poi_internet_access_fee_customers
source: Internet access: customers
ta: இணைய அணுகல்: வாடிக்கையாளர்கள்

# poi_traffic_signals_sound_locate
source: Only to find the pole
ta: துருவத்தைக் கண்டுபிடிக்க மட்டுமே

# poi_tactile_paving_contrasted
source: Contrasted
ta: மாறாக

# poi_tactile_paving_primitive
source: Primitive
ta: தொடக்கநிலை

# poi_tactile_paving_incorrect
source: Incorrect
ta: தவறானது

# poi_seamark_water_level_part_submerged
source: Water level: part-submerged
ta: நீர் நிலை: பகுதி நீரில் மூழ்கியது

# poi_seamark_water_level_submerged
source: Water level: submerged
ta: நீர் நிலை: நீரில் மூழ்கியது

# poi_seamark_water_level_dry
source: Water level: dry
ta: நீர் நிலை: உலர்ந்த

# poi_seamark_water_level_covers
source: Water level: covers
ta: நீர் நிலை: கவர்கள்

# poi_seamark_water_level_awash
source: Water level: awash
ta: நீர் நிலை: அவாச்

# poi_seamark_water_level_floods
source: Water level: floods
ta: நீர் நிலை: வெள்ளம்

# poi_seamark_water_level_floating
source: Water level: floating
ta: நீர் நிலை: மிதக்கும்

# poi_seamark_water_level_above_mwl
source: Water level: above mean water level
ta: நீர் நிலை: மேலே சராசரி நீர் மட்டத்திற்கு மேலே

# poi_seamark_water_level_below_mwl
source: Water level: below mean water level
ta: நீர் நிலை: கீழே சராசரி நீர் மட்டத்திற்கு கீழே

# poi_seamark_obstruction
source: Obstruction
ta: தடை

# poi_drinking_water_refill_yes
source: Yes;Drinking water refill;Refill
ta: ஆம்; குடிநீர் மறு நிரப்பல்; மீண்டும் நிரப்பவும்

# poi_drinking_water_refill_no
source: Drinking water refill: no
ta: குடிநீர் மறு நிரப்பல்: இல்லை

# poi_drinking_water_refill_network
source: Drinking water refill network
ta: குடிநீர் மறு நிரப்பல் பிணையம்

# poi_fire_hydrant_type_pipe
source: Pipe
ta: புழம்பு

# poi_water_source_groundwater
source: Groundwater
ta: நிலத்தடி நீர்

# poi_fire_hydrant_pressure_pressurized
source: Pressurized
ta: அழுத்தம்

# poi_fire_hydrant_pressure_suction
source: Suction
ta: உறிஞ்சு

# poi_pump_status_missing_beam
source: Pump status: missing beam
ta: பம்ப் நிலை: காணாமல் போன பீம்

# poi_traffic_signals_vibration_no
source: Vibration: no
ta: அதிர்வு: இல்லை

# poi_traffic_signals_vibration_yes
source: Yes;Traffic signals vibration
ta: ஆம்; போக்குவரத்து அதிர்வு சமிக்ஞை

# poi_traffic_signals_arrow_yes
source: Yes;Traffic signals arrow
ta: ஆம்; போக்குவரத்து சமிக்ஞைகள் அம்பு

# poi_traffic_signals_arrow_no
source: Arrow: no
ta: அம்பு: இல்லை

# poi_give_box
source: Give box
ta: பெட்டி கொடுங்கள்

# poi_borough
source: Borough
ta: போரோ

# poi_city_block
source: City block
ta: நகர தொகுதி

# poi_elevator
source: Elevator
ta: உயர்வு

# poi_departures_board_no
source: Departures board: no
ta: புறப்படும் வாரியம்: இல்லை

# poi_departures_board_yes
source: Yes;Departures board
ta: ஆம்; புறப்படும் வாரியம்

# poi_departures_board_delay
source: Delay;Departures board
ta: தாமதம்; புறப்படும் வாரியம்

# poi_departures_board_realtime
source: Realtime;Departures board
ta: நிகழ்நேர; புறப்படும் வாரியம்

# poi_departures_board_timetable
source: Timetable;Departures board
ta: கால அட்டவணை; புறப்படும் வாரியம்

# poi_beehive
source: Beehive
ta: தேனீ

# poi_nuts
source: Nut store
ta: நட்டு கடை

# poi_gpx_point
source: GPX point
ta: சிபிஎக்ச் புள்ளி

# poi_parking_rooftop
source: Rooftop
ta: கூரை

# poi_parking_sheds
source: Sheds
ta: கொட்டகைகள்

# poi_parking_layby
source: Layby
ta: லேபி

# poi_radar_tower
source: Radar tower
ta: ராடார் கோபுரம்

# poi_diplomatic_embassy
source: Embassy
ta: தூதரகம்

# poi_diplomatic_liaison
source: Liaison
ta: தொடர்பு

# poi_embassy_yes
source: Headed by an ambassador
ta: ஒரு தூதர் தலைமையில்

# poi_embassy_branch_embassy
source: Branch
ta: கிளை

# poi_embassy_delegation
source: Delegation
ta: தூதுக்குழு

# poi_embassy_high_commission
source: High commission
ta: உயர் ச்தானிகராலயம்

# poi_embassy_interests_section
source: Interests section
ta: ஆர்வங்கள் பிரிவு

# poi_embassy_mission
source: Mission
ta: மிசன்

# poi_embassy_residence
source: Residence
ta: குடியிருப்பு

# poi_consulate_yes
source: Headed by a consul
ta: ஒரு தூதரகம் தலைமையில்

# poi_consulate_consular_agency
source: Consular agency
ta: தூதரக நிறுவனம்

# poi_consulate_consular_office
source: Consular office
ta: தூதரகம் அலுவலகம்

# poi_consulate_consulate_general
source: Consulate general
ta: தூதரகம் செனரல்

# poi_consulate_honorary_consul
source: Honorary consul
ta: கெளரவ தூதரகம்

# poi_liaison_liaison_office
source: Office
ta: அலுவலகம்

# poi_liaison_representative_office
source: Representative office
ta: சார்பாளர் அலுவலகம்

# poi_liaison_subnational
source: Subnational
ta: துணை தேசிய

# poi_diplomatic_services_non_immigrant_visas_yes
source: Yes
ta: ஆம்

# poi_diplomatic_services_non_immigrant_visas_no
source: No
ta: இல்லை

# poi_diplomatic_services_immigrant_visas_yes
source: Yes
ta: ஆம்

# poi_diplomatic_services_immigrant_visas_no
source: No
ta: இல்லை

# poi_diplomatic_services_citizen_services_yes
source: Yes
ta: ஆம்

# poi_diplomatic_services_citizen_services_no
source: No
ta: இல்லை

# poi_mobile_money_agent
source: Mobile money agent
ta: மொபைல் பணம் முகவர்

# poi_nurse
source: Nurse
ta: செவிலியர்

# poi_siren
source: Siren
ta: சைரன்

# poi_healthcare_speciality_vaccination
source: Vaccination
ta: தடுப்பூசி, தடுப்பு மருந்து

# poi_vaccination_covid19
source: Vaccination: COVID19
ta: தடுப்பூசி: கோவிட் 19

# poi_water_source_tube_well
source: Tube well
ta: குழாய் நன்றாக

# poi_water_source_water_works
source: Water works
ta: நீர் வேலை செய்கிறது

# poi_water_source_tap
source: Tap
ta: தட்டவும்

# poi_water_source_water_tank
source: Water tank
ta: நீர் தொட்டி

# poi_water_source_powered_pump
source: Powered pump
ta: இயங்கும் பம்ப்

# poi_water_source_well
source: Well
ta: நன்றாக

# poi_water_source_river
source: River
ta: நதி

# poi_water_source_lake
source: Lake
ta: ஏரி

# poi_ranger_station
source: Ranger station
ta: ரேஞ்சர் நிலையம்

# poi_weighbridge
source: Weighbridge;Truck scale
ta: வெயிட் பிரிட்ச்; டிரக் அளவுகோல்

# poi_waste_transfer_station
source: Waste transfer station
ta: கழிவு பரிமாற்ற நிலையம்

# poi_lavoir
source: Lavoir
ta: சலவை

# poi_swimming_area
source: Swimming area
ta: நீச்சல் பகுதி

# poi_wildlife_crossing
source: Wildlife crossing
ta: வனவிலங்கு கடத்தல்

# poi_wildlife_crossing_bat_bridge
source: Bat bridge
ta: பேட் பாலம்

# poi_wildlife_crossing_bat_tunnel
source: Bat tunnel
ta: பேட் டன்னல்

# poi_piste_ski_jump
source: Ski jump
ta: ச்கை சம்ப்

# poi_piste_name
source: Piste name
ta: பிச்டே பெயர்

# poi_gladed_yes
source: Gladed: yes
ta: மகிழ்ச்சி: ஆம்

# poi_patrolled_yes
source: Patrolled: yes
ta: ரோந்து: ஆம்

# poi_patrolled_no
source: Patrolled: no
ta: ரோந்து: இல்லை

# poi_piste_status_open
source: Piste status: open
ta: பிச்டே நிலை: திறந்த

# poi_piste_status_closed
source: Piste status: closed
ta: பிச்டே நிலை: மூடப்பட்டது

# poi_summit_register_yes
source: Summit register: yes
ta: உச்சி மாநாடு பதிவு: ஆம்

# poi_summit_register_no
source: Summit register: no
ta: உச்சி மாநாடு பதிவு: இல்லை

# poi_mobile_library
source: Mobile library stop position
ta: மொபைல் நூலக நிறுத்த நிலை

# poi_conference_centre
source: Conference centre
ta: மாநாட்டு நடுவண்

# poi_geodesist
source: Geodesist
ta: சியோடெசிச்ட்

# poi_local_ref
source: Local reference
ta: உள்ளக குறிப்பு

# poi_camp_pitch
source: Camp pitch
ta: முகாம் சுருதி

# poi_hoops
source: Hoops
ta: வளையங்கள்

# poi_karate
source: Karate
ta: கராத்தே

# poi_jiu_jitsu
source: Jiu-jitsu
ta: J iu-level வேக சரிசெய்தல்

# poi_pilates
source: Pilates
ta: பைலேட்ச்

# poi_shot_put
source: Shot put
ta: காட்சி புட்

# poi_snooker
source: Snooker
ta: ச்னூக்கர்

# poi_speedway
source: Speedway
ta: ச்பீட்வே

# poi_sumo
source: Sumo
ta: சுமோ

# poi_table_soccer
source: Table soccer
ta: அட்டவணை கால்பந்து

# poi_taekwondo
source: Taekwondo
ta: டேக்வாண்டோ

# poi_ultimate
source: Ultimate
ta: இறுதி

# poi_wakeboarding
source: Wakeboarding
ta: வேக் போர்டிங்

# poi_weightlifting
source: Weightlifting
ta: பளு தூக்குதல்

# poi_wrestling
source: Wrestling
ta: மற்போர்

# poi_zurkhaneh_sport
source: Zurkhaneh sport
ta: சுர்கனே விளையாட்டு

# poi_water_polo
source: Water polo
ta: நீர் போலோ

# poi_water_ski
source: Water ski
ta: நீர் ச்கை

# poi_aikido
source: Aikido
ta: Ikyokido

# poi_biathlon
source: Biathlon
ta: பயாத்லான்

# poi_bobsleigh
source: Bobsleigh
ta: பாப்ச்லீ

# poi_bullfighting
source: Bullfighting
ta: காளை சண்டை

# poi_cliff_diving
source: Cliff diving
ta: கிளிஃப் டைவிங்

# poi_cockfighting
source: Cockfighting
ta: சேவல் சண்டை

# poi_crossfit
source: Crossfit
ta: கிராச்ஃபிட்

# poi_curling
source: Curling
ta: கர்லிங்

# poi_cycle_polo
source: Cycle polo
ta: சுழற்சி போலோ

# poi_fencing
source: Fencing
ta: ஃபென்சிங்

# poi_horseshoes
source: Horseshoes
ta: குதிரைவாலிகள்

# poi_kickboxing
source: Kickboxing
ta: கிக் பாக்சிங்

# poi_office_diplomatic
source: Diplomatic office
ta: இராசதந்திர அலுவலகம்

# poi_plateau
source: Plateau
ta: பீடபூமி

# poi_club_social
source: Social club
ta: சமூக கிளப்

# poi_health_post
source: Health post
ta: சுகாதார இடுகை

# poi_telecom_exchange
source: Telephone exchange
ta: தொலைபேசி பரிமாற்றம்

# poi_telecom_medium_copper
source: Medium: copper
ta: நடுத்தர: தாமிரம்

# poi_telecom_medium_fibre
source: Medium: fibre
ta: நடுத்தர: ஃபைபர்

# poi_telecom_medium_coaxial
source: Medium: coaxial
ta: நடுத்தர: கோஆக்சியல்

# poi_pest_control
source: Pest control store
ta: பூச்சி கட்டுப்பாடு கடை

# poi_shop_water
source: Drinking water store
ta: குடிநீர் கடை

# poi_pillory
source: Pillory
ta: தலையணை

# poi_service_vehicle_inspection_yes
source: Vehicle inspection
ta: வாகன ஆய்வு

# poi_service_vehicle_rental_yes
source: Car rental
ta: கார் வாடகை

# poi_planetarium
source: Planetarium
ta: பிளானட்டேரியம்

# poi_trolley_bay
source: Trolley bay
ta: டிராலி பே

# poi_refugee_site
source: Refugee site
ta: ஏதிலி தளம்

# poi_windsock
source: Windsock
ta: விண்ட்சாக்

# poi_operator_type_public
source: Operator type: public
ta: ஆபரேட்டர் வகை: பொது

# poi_operator_type_private
source: Operator type: private
ta: ஆபரேட்டர் வகை: தனியார்

# poi_operator_type_government
source: Operator type: government
ta: ஆபரேட்டர் வகை: அரசு

# poi_operator_type_religious
source: Operator type: religious
ta: ஆபரேட்டர் வகை: மத

# poi_operator_type_ngo
source: Operator type: ngo
ta: ஆபரேட்டர் வகை: தன்னார்வ தொண்டு நிறுவனம்

# poi_operator_type_community
source: Operator type: community
ta: ஆபரேட்டர் வகை: சமூகம்

# poi_operator_type_consortium
source: Operator type: consortium
ta: ஆபரேட்டர் வகை: கூட்டமைப்பு

# poi_operator_type_cooperative
source: Operator type: cooperative
ta: ஆபரேட்டர் வகை: கூட்டுறவு

# poi_ultralight_aviation
source: Ultralight aviation
ta: அல்ட்ராலைட் ஏவியேசன்

# poi_dune
source: Dune
ta: மணல்மயமாக்கல்

# poi_shrub
source: Shrub
ta: குறுஞ்செடி

# poi_fruit
source: Fruit
ta: கனி

# poi_glacier_debris_cover_none
source: Debris cover: none
ta: குப்பைகள் கவர்: எதுவுமில்லை

# poi_glacier_debris_cover_partial
source: Debris cover: partial
ta: குப்பைகள் கவர்: பகுதி

# poi_glacier_debris_cover_scarce
source: Debris cover: scarce
ta: குப்பைகள் கவர்: பற்றாக்குறை

# poi_glacier_edge_grounding_line
source: Edge: grounding line
ta: விளிம்பு: கிரவுண்டிங் லைன்

# poi_glacier_edge_calving_line
source: Edge: calving line
ta: விளிம்பு: கன்று ஈன்ற வரி

# poi_glacier_status_retreat
source: Glacier status: retreat
ta: பனிப்பாறை நிலை: பின்வாங்குதல்

# poi_glacier_status_marked_retreat
source: Glacier status: marked retreat
ta: பனிப்பாறை நிலை: குறிக்கப்பட்ட பின்வாங்கல்
