Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_glacier_status_oscillating
source: Glacier status: oscillating
ta: பனிப்பாறை நிலை: ஊசலாடும்

# poi_power_terminal
source: Power terminal
ta: ஆற்றல் முனையம்

# poi_fuel_propane
source: Propane
ta: ஒருப்பிணை முக்கொள்ளியம்

# poi_picnic_table_yes
source: Picnic table: yes
ta: சுற்றுலா அட்டவணை: ஆம்

# poi_picnic_table_no
source: Picnic table: no
ta: சுற்றுலா அட்டவணை: இல்லை

# poi_memorial_subject
source: Subject
ta: பொருள்

# poi_power_portal
source: Power portal
ta: ஆற்றல் போர்ட்டல்

# poi_contact_linkedin
source: LinkedIn
ta: சென்டர்

# poi_contact_webcam
source: Webcam
ta: வெப்கேம்

# poi_contact_vhf
source: VHF
ta: வி.எச்.எஃப்

# poi_contact_xing
source: Xing
ta: சிங்

# poi_outdoor_seating_poi
source: Outdoor seating
ta: வெளிப்புற இருக்கை

# poi_share_taxi_yes
source: Share taxi: yes
ta: பங்கு டாக்சி: ஆம்

# poi_authentication_contactless_no
source: Contactless auth: no
ta: தொடர்பு இல்லாத அங்கீகாரம்: இல்லை

# poi_authentication_contactless_yes
source: Yes
ta: ஆம்

# poi_authentication_chip_card_no
source: Auth by chip card: no
ta: சிப் அட்டை மூலம் அங்கீகாரம்: இல்லை

# poi_authentication_chip_card_yes
source: Yes
ta: ஆம்

# poi_authentication_key_no
source: Auth by key: no
ta: விசை மூலம் அங்கீகாரம்: இல்லை

# poi_authentication_key_yes
source: Yes
ta: ஆம்

# poi_authentication_app_no
source: Auth by app: no
ta: பயன்பாட்டின் மூலம் அங்கீகாரம்: இல்லை

# poi_authentication_app_yes
source: Yes
ta: ஆம்

# poi_authentication_phone_call_no
source: Auth by phone call: no
ta: தொலைபேசி அழைப்பு மூலம் அங்கீகாரம்: இல்லை

# poi_authentication_phone_call_yes
source: Yes
ta: ஆம்

# poi_authentication_phone_call_number
source: Phone number used for auth
ta: அங்கீகாரத்திற்கு பயன்படுத்தப்படும் தொலைபேசி எண்

# poi_authentication_short_message_no
source: Auth by short message: no
ta: குறுகிய செய்தி மூலம் அங்கீகாரம்: இல்லை

# poi_authentication_short_message_yes
source: Yes
ta: ஆம்

# poi_authentication_short_message_number
source: Short message number used for auth
ta: அங்கீகாரத்திற்கு பயன்படுத்தப்படும் குறுகிய செய்தி எண்

# poi_authentication_short_message_text
source: Short message text used for auth
ta: அங்கீகாரத்திற்கு பயன்படுத்தப்படும் குறுகிய செய்தி உரை

# poi_authentication_none_no
source: Auth not required: no
ta: ஏற்பு தேவையில்லை: இல்லை

# poi_authentication_none_yes
source: Yes;No authentication
ta: ஆம்; ஏற்பு இல்லை

# poi_permanent_camping_yes
source: Yes;Permanent camping
ta: ஆம்; நிரந்தர முகாம்

# poi_permanent_camping_no
source: No
ta: இல்லை

# poi_permanent_camping_only
source: Only;Permanent camping only
ta: மட்டும்; நிரந்தர முகாம் மட்டுமே

# poi_destination
source: Destination
ta: இலக்கு

# poi_direction_north
source: North direction
ta: வடக்கு திசை

# poi_direction_east
source: East direction
ta: கிழக்கு திசை

# poi_direction_south
source: South direction
ta: தெற்கு திசை

# poi_direction_west
source: West direction
ta: மேற்கு திசை

# poi_direction_northeast
source: Northeast direction
ta: வடகிழக்கு திசை

# poi_direction_northwest
source: Northwest direction
ta: வடமேற்கு திசை

# poi_direction_southeast
source: Southeast direction
ta: தென்கிழக்கு திசை

# poi_direction_southwest
source: Southwest direction
ta: தென்மேற்கு திசை

# poi_lounger
source: Lounger
ta: லவுஞ்சர்

# poi_shelter_no
source: Shelter: no
ta: தங்குமிடம்: இல்லை

# poi_shelter_yes
source: Yes;Shelter
ta: ஆம்; தங்குமிடம்

# poi_arch
source: Arch
ta: மான்

# poi_manufacturer
source: Manufacturer
ta: உற்பத்தியாளர்

# poi_payment_calling_cards_no
source: Calling cards not accepted
ta: அழைப்பு அட்டைகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_reverse_charge_calls_no
source: Reverse charge calls: no
ta: தலைகீழ் கட்டண அழைப்புகள்: இல்லை

# poi_payment_calling_cards_yes
source: Calling cards accepted
ta: அழைப்பு அட்டைகள் ஏற்றுக்கொள்ளப்பட்டன

# poi_payment_reverse_charge_calls_yes
source: Reverse charge calls: yes
ta: தலைகீழ் கட்டண அழைப்புகள்: ஆம்

# poi_groundskeeping
source: Groundskeeping store
ta: கிராண்ட்ச்கீப்பிங் கடை

# poi_country_store
source: Country store
ta: நாட்டின் கடை

# poi_prep_school
source: Tutorial school
ta: டுடோரியல் பள்ளி

# poi_ticket_validator
source: Ticket validator
ta: டிக்கெட் வாலிடேட்டர்

# poi_geoglyph
source: Geoglyph
ta: சியோகிளிஃப்

# poi_satellite_dish
source: Satellite dish
ta: செயற்கைக்கோள் டிச்

# poi_trailhead
source: Trailhead
ta: டிரெயில்எட்

# poi_hampshire_gate
source: Hampshire gate
ta: ஆம்ப்சயர் கேட்

# poi_driver_training
source: Driver training place
ta: ஓட்டுநர் பயிற்சி இடம்

# poi_research_institute
source: Research institute
ta: ஆராய்ச்சி நிறுவனம்

# poi_sports_hall
source: Sports hall
ta: விளையாட்டு மண்டபம்

# poi_couplings
source: Couplings
ta: இணைப்புகள்

# poi_winery
source: Winery
ta: ஒயின்

# poi_wine_region
source: Wine region
ta: ஒயின் பகுதி

# poi_wine_grape
source: Grape
ta: கொடிமுந்திரி, திராட்சைப்பழம்

# poi_wine_vineyard
source: Vineyard
ta: வினயார்ட்

# poi_wine_type
source: Type;Wine type
ta: வகை; மது வகை

# poi_distillery
source: Distillery
ta: டிச்டில்லரி

# poi_reusable_packaging_accept_yes
source: Reusable packaging accept: yes
ta: மீண்டும் பயன்படுத்தக்கூடிய பேக்கேசிங் ஏற்றுக்கொள்ளுங்கள்: ஆம்

# poi_reusable_packaging_accept_no
source: Reusable packaging accept: no
ta: மீண்டும் பயன்படுத்தக்கூடிய பேக்கேசிங் ஏற்றுக்கொள்ளுங்கள்: இல்லை

# poi_reusable_packaging_accept_only
source: Reusable packaging accept: only
ta: மீண்டும் பயன்படுத்தக்கூடிய பேக்கேசிங் ஏற்றுக்கொள்ளுங்கள்: மட்டும்

# poi_reusable_packaging_offer_yes
source: Reusable packaging offer: yes
ta: மீண்டும் பயன்படுத்தக்கூடிய பேக்கேசிங் சலுகை: ஆம்

# poi_reusable_packaging_offer_no
source: Reusable packaging offer: no
ta: மீண்டும் பயன்படுத்தக்கூடிய பேக்கேசிங் சலுகை: இல்லை

# poi_reusable_packaging_offer_only
source: Reusable packaging offer: only
ta: மீண்டும் பயன்படுத்தக்கூடிய பேக்கேசிங் சலுகை: மட்டும்

# poi_zero_waste_yes
source: Zero waste: yes
ta: சுழிய கழிவு: ஆம்

# poi_zero_waste_no
source: Zero waste: no
ta: சுழிய கழிவு: இல்லை

# poi_zero_waste_only
source: Zero waste: only
ta: சுழிய கழிவு: மட்டும்

# poi_butcher_poultry
source: Poultry
ta: கோழி

# poi_butcher_beef
source: Beef
ta: மாட்டிறைச்சி

# poi_butcher_horse
source: Horse
ta: குதிரை

# poi_butcher_lamb
source: Lamb
ta: ஆட்டுக்குட்டி

# poi_butcher_pork
source: Pork
ta: பன்றி இறைச்சி

# poi_butcher_halal
source: Halal
ta: ஆலால்

# poi_coffee_yes
source: Yes;Coffee
ta: ஆம்; காபி

# poi_coffee_no
source: No
ta: இல்லை

# poi_ice_cream_yes
source: Yes;Ice cream
ta: ஆம்; ஐச்கிரீம்

# poi_origin
source: Origin
ta: தோற்றம்

# poi_tobacco_yes
source: Yes;Tobacco
ta: ஆம்; புகையிலை

# poi_membership_yes
source: Yes;Membership
ta: ஆம்; உறுப்பினர்

# poi_membership_no
source: No
ta: இல்லை

# poi_medical_supply_diabetic
source: Diabetic
ta: நீரிழிவு நோயாளி

# poi_medical_supply_orthopedic
source: Orthopedic
ta: எலும்பியல்

# poi_medical_supply_orthotics
source: Orthotics
ta: ஆர்த்தோடிக்ச்

# poi_medical_supply_mobility
source: Mobility
ta: நகர்கை

# poi_medical_supply_diagnostic
source: Diagnostic
ta: கண்டறியும்

# poi_medical_supply_respiratory
source: Respiratory
ta: சுவாச

# poi_medical_supply_home_care
source: Home care
ta: வீட்டு பராமரிப்பு

# poi_lgbtq_primary
source: LGBTQ: primary
ta: LGBTQ: முதன்மை

# poi_lgbtq_yes
source: LGBTQ allowed
ta: LGBTQ அனுமதிக்கப்பட்டது

# poi_lgbtq_only
source: LGBTQ only
ta: LGBTQ மட்டும்

# poi_lgbtq_no
source: LGBTQ not allowed
ta: LGBTQ அனுமதிக்கப்படவில்லை

# poi_beauty_salon_tanning
source: Tanning
ta: தோல் பதனிடுதல்

# poi_beauty_salon_cosmetics
source: Cosmetics
ta: அழகுசாதனப் பொருட்கள்

# poi_beauty_salon_spa
source: Spa
ta: ச்பா

# poi_beauty_salon_skin_care
source: Skin care
ta: தோல் பராமரிப்பு

# poi_beauty_salon_waxing
source: Waxing
ta: மெழுகு

# poi_beauty_salon_hair_removal
source: Hair removal
ta: முடி அகற்றுதல்

# poi_beauty_salon_aesthetic
source: Aesthetic
ta: அழகியல்

# poi_beauty_salon_massage
source: Massage
ta: மசாச்

# poi_beauty_salon_eyelash
source: Eyelash
ta: கண் இமை

# poi_beauty_salon_pedicure
source: Pedicure
ta: பாதத்தில் வரும் காழ்ப்புக்கான

# poi_massage_chiropractic
source: Chiropractic
ta: சிரோபிராக்டிக்

# poi_massage_shiatsu
source: Shiatsu
ta: சியாட்சு

# poi_agrarian_yes
source: Yes;Agrarian
ta: ஆம்; விவசாய

# poi_agrarian_pesticide
source: Pesticide
ta: பூச்சிக்கொல்லி

# poi_agrarian_fertilizer
source: Fertilizer
ta: உரம்

# poi_agrarian_seed
source: Seed
ta: விதை

# poi_agrarian_feed
source: Feed
ta: தீவனம்

# poi_agrarian_tools
source: Tools
ta: கருவிகள்

# poi_agrarian_machine_parts
source: Machine parts
ta: இயந்திர பாகங்கள்

# poi_agrarian_agricultural_machinery
source: Agricultural machinery
ta: விவசாய இயந்திரங்கள்

# poi_generator_source_tidal
source: Energy source: tidal
ta: ஆற்றல் மூல: அலை

# poi_generator_source_wave
source: Energy source: wave
ta: ஆற்றல் மூல: அலை

# poi_generator_source_biofuel
source: Energy source: biofuel
ta: ஆற்றல் மூல: உயிரி எரிபொருள்

# poi_generator_source_biogas
source: Energy source: biogas
ta: ஆற்றல் ஆதாரம்: பயோகாச்

# poi_generator_source_gasoline
source: Energy source: gasoline
ta: ஆற்றல் மூல: பெட்ரோல்

# poi_generator_source_waste
source: Energy source: waste
ta: ஆற்றல் மூல: கழிவு

# poi_generator_method_fission
source: Generator method: fission
ta: செனரேட்டர் முறை: பிளவு

# poi_generator_method_fusion
source: Generator method: fusion
ta: செனரேட்டர் முறை: இணைவு

# poi_generator_method_wind_turbine
source: Generator method: wind turbine
ta: செனரேட்டர் முறை: காற்று விசையாழி

# poi_generator_method_water_storage
source: Generator method: water storage
ta: செனரேட்டர் முறை: நீர் சேமிப்பு

# poi_generator_method_water_pumped_storage
source: Generator method: water pumped storage
ta: செனரேட்டர் முறை: நீர் உந்தப்பட்ட சேமிப்பு

# poi_generator_method_run_of_the_river
source: Generator method: run-of-the-river
ta: செனரேட்டர் முறை: ரன்-ஆஃப்-தி-ரிவர்

# poi_generator_method_barrage
source: Generator method: barrage
ta: செனரேட்டர் முறை: சரமாரியாக

# poi_generator_method_stream
source: Generator method: stream
ta: செனரேட்டர் முறை: ச்ட்ரீம்

# poi_generator_method_thermal
source: Generator method: thermal
ta: செனரேட்டர் முறை: வெப்ப

# poi_generator_method_photovoltaic
source: Generator method: photovoltaic
ta: செனரேட்டர் முறை: ஒளிமின்னழுத்த

# poi_generator_method_combustion
source: Generator method: combustion
ta: செனரேட்டர் முறை: எரிப்பு

# poi_generator_method_gasification
source: Generator method: gasification
ta: செனரேட்டர் முறை: காற்று

# poi_generator_method_anaerobic_digestion
source: Generator method: anaerobic digestion
ta: செனரேட்டர் முறை: காற்றில்லா செரிமானம்

# poi_generator_method_battery_storage
source: Generator method: battery storage
ta: செனரேட்டர் முறை: பேட்டரி சேமிப்பு

# poi_generator_type_pwr
source: Generator type: PWR
ta: செனரேட்டர் வகை: பி.டபிள்யூ.ஆர்

# poi_generator_type_bwr_1
source: Generator type: BWR-1
ta: செனரேட்டர் வகை: BWR-1

# poi_generator_type_bwr_2
source: Generator type: BWR-2
ta: செனரேட்டர் வகை: BWR-2

# poi_generator_type_bwr_3
source: Generator type: BWR-3
ta: செனரேட்டர் வகை: BWR-3

# poi_generator_type_bwr_4
source: Generator type: BWR-4
ta: செனரேட்டர் வகை: BWR-4

# poi_generator_type_bwr_5
source: Generator type: BWR-5
ta: செனரேட்டர் வகை: BWR-5

# poi_generator_type_bwr_6
source: Generator type: BWR-6
ta: செனரேட்டர் வகை: BWR-6

# poi_generator_type_phwr
source: Generator type: PHWR
ta: செனரேட்டர் வகை: PHWR

# poi_generator_type_gcr
source: Generator type: GCR
ta: செனரேட்டர் வகை: சி.சி.ஆர்

# poi_generator_type_fbr
source: Generator type: FBR
ta: செனரேட்டர் வகை: எஃப்.பி.ஆர்

# poi_generator_type_rbmk_1000
source: Generator type: RBMK-1000
ta: செனரேட்டர் வகை: RBMK-1000

# poi_generator_type_rbmk_1500
source: Generator type: RBMK-1500
ta: செனரேட்டர் வகை: RBMK-1500

# poi_generator_type_vver
source: Generator type: VVER
ta: செனரேட்டர் வகை: vver

# poi_generator_type_candu
source: Generator type: CANDU
ta: செனரேட்டர் வகை: காண்டு

# poi_generator_type_cpr_1000
source: Generator type: CPR-1000
ta: செனரேட்டர் வகை: சிபிஆர் -1000

# poi_generator_type_epr
source: Generator type: EPR
ta: செனரேட்டர் வகை: ஈபிஆர்

# poi_generator_type_tokamak
source: Generator type: tokamak
ta: செனரேட்டர் வகை: டோகாமக்

# poi_generator_type_stellarator
source: Generator type: stellarator
ta: செனரேட்டர் வகை: ச்டெல்லரேட்டர்

# poi_generator_type_icf
source: Generator type: ICF
ta: செனரேட்டர் வகை: ஐ.சி.எஃப்

# poi_generator_type_cold_fusion
source: Generator type: cold fusion
ta: செனரேட்டர் வகை: குளிர் இணைவு

# poi_generator_type_horizontal_axis
source: Generator type: horizontal axis
ta: செனரேட்டர் வகை: கிடைமட்ட அச்சு

# poi_generator_type_vertical_axis
source: Generator type: vertical axis
ta: செனரேட்டர் வகை: செங்குத்து அச்சு

# poi_generator_type_francis_turbine
source: Generator type: francis turbine
ta: செனரேட்டர் வகை: பிரான்சிச் டர்பைன்

# poi_generator_type_kaplan_turbine
source: Generator type: kaplan turbine
ta: செனரேட்டர் வகை: கபிலன் விசையாழி

# poi_generator_type_pelton_turbine
source: Generator type: pelton turbine
ta: செனரேட்டர் வகை: பெல்டன் டர்பைன்

# poi_generator_type_hydrodynamic_screw
source: Generator type: hydrodynamic screw
ta: செனரேட்டர் வகை: ஐட்ரோடினமிக் திருகு

# poi_generator_type_steam_turbine
source: Generator type: steam turbine
ta: செனரேட்டர் வகை: நீராவி விசையாழி

# poi_generator_type_heat_pump
source: Generator type: heat pump
ta: செனரேட்டர் வகை: வெப்ப பம்ப்

# poi_generator_type_solar_thermal_collector
source: Generator type: solar thermal collector
ta: செனரேட்டர் வகை: சூரிய வெப்ப சேகரிப்பாளர்

# poi_generator_type_solar_photovoltaic_panel
source: Generator type: solar photovoltaic panel
ta: செனரேட்டர் வகை: சூரிய ஒளிமின்னழுத்த பேனல்

# poi_generator_type_steam_generator
source: Generator type: steam generator
ta: செனரேட்டர் வகை: நீராவி செனரேட்டர்

# poi_generator_type_boiler
source: Generator type: boiler
ta: செனரேட்டர் வகை: கொதிகலன்

# poi_generator_type_gas_turbine
source: Generator type: gas turbine
ta: செனரேட்டர் வகை: எரிவாயு விசையாழி

# poi_generator_type_combined_cycle
source: Generator type: combined cycle
ta: செனரேட்டர் வகை: ஒருங்கிணைந்த சுழற்சி

# poi_generator_type_reciprocating_engine
source: Generator type: reciprocating engine
ta: செனரேட்டர் வகை: பரச்பர இயந்திரம்

# poi_generator_type_bioreactor
source: Generator type: bioreactor
ta: செனரேட்டர் வகை: உயிரியக்கவியல்

# poi_generator_type_lithium_ion
source: Generator type: lithium-ion
ta: செனரேட்டர் வகை: லித்தியம் அயன்

# poi_generator_type_lead_acid
source: Generator type: lead-acid
ta: செனரேட்டர் வகை: லீட்-அமிலம்

# poi_generator_type_nickel_cadmium
source: Generator type: nickel-cadmium
ta: செனரேட்டர் வகை: நிக்கல்-காட்மியம்

# poi_generator_type_redox_flow
source: Generator type: redox flow
ta: செனரேட்டர் வகை: ரெடாக்ச் ஓட்டம்

# poi_generator_type_molten_salt
source: Generator type: molten-salt
ta: செனரேட்டர் வகை: உருகிய-உப்பு

# poi_service_fleurop_yes
source: Yes;Fleurop
ta: ஆம்;

# poi_mattress_yes
source: Yes;Mattress
ta: ஆம்; மெத்தை

# poi_mattress_no
source: No
ta: இல்லை

# poi_furniture_used
source: Used;Used furniture
ta: பயன்படுத்தப்பட்டது; பயன்படுத்தப்பட்ட தளபாடங்கள்

# poi_furniture_office
source: Office;Office furniture
ta: அலுவலகம்; அலுவலக தளபாடங்கள்

# poi_furniture_living_room
source: Living room;Furniture for living room
ta: வாழ்க்கை அறை; வாழ்க்கை அறைக்கு தளபாடங்கள்

# poi_furniture_kitchen
source: Kitchen;Kitchen furniture
ta: சமையலறை; சமையலறை தளபாடங்கள்

# poi_furniture_bedroom
source: Bedroom;Bedroom furniture
ta: படுக்கையறை; படுக்கையறை தளபாடங்கள்

# poi_furniture_yes
source: Yes;Furniture
ta: ஆம்; தளபாடங்கள்

# poi_furniture_no
source: No
ta: இல்லை

# poi_furniture_bed
source: Bed;Furniture
ta: படுக்கை; தளபாடங்கள்

# poi_furniture_sofa
source: Sofa;Furniture
ta: சோபா; தளபாடங்கள்

# poi_heating_yes
source: Yes;Heating
ta: ஆம்; வெப்பமாக்கல்

# poi_heating_no
source: No
ta: இல்லை

# poi_heating_fireplace
source: Fireplace
ta: நெருப்பிடம்

# poi_heating_stove
source: Stove
ta: அடுப்பு

# poi_heating_district_heating
source: District heating
ta: மாவட்ட வெப்பமாக்கல்

# poi_heating_gas
source: Gas
ta: வளிமம்

# poi_heating_radiator
source: Radiator
ta: கதிர்வீசி

# poi_fridge_yes
source: Yes;Fridge
ta: ஆம்; குளிர்சாதன பெட்டி

# poi_fridge_no
source: No
ta: இல்லை

# poi_fumarole
source: Fumarole
ta: ஃப்ளூ

# poi_faculty_aerospace
source: Aerospace
ta: ஏரோச்பேச்

# poi_faculty_architecture
source: Architecture
ta: கட்டிடக்கலை

# poi_faculty_arts
source: Arts
ta: கலை

# poi_faculty_biology
source: Biology
ta: உயிரியல்

# poi_faculty_chemistry
source: Chemistry
ta: வேதியியல்

# poi_faculty_communication
source: Communication
ta: தொடர்பு

# poi_faculty_economics
source: Economics
ta: பொருளாதாரம்

# poi_faculty_education
source: Education
ta: கல்வி

# poi_faculty_engineering
source: Engineering
ta: பொறியியல்

# poi_faculty_geography
source: Geography
ta: புவியியல்

# poi_faculty_law
source: Law
ta: சட்டம்

# poi_faculty_mathematics
source: Mathematics
ta: கணிதம்

# poi_faculty_medicine
source: Medicine
ta: மருந்து

# poi_faculty_nursing
source: Nursing
ta: நர்சிங்

# poi_faculty_psychology
source: Psychology
ta: உளவியல்

# poi_tool_hire
source: Tool hire
ta: கருவி வாடகை

# poi_escape_game
source: Escape game
ta: தப்பிக்கும் விளையாட்டு

# poi_diet_vegan_limited
source: Vegan: limited
ta: சைவ உணவு: லிமிடெட்

# poi_computer_sales_yes
source: Yes;Computer sales
ta: ஆம்; கணினி விற்பனை

# poi_computer_sales_used
source: Used;Used computers
ta: பயன்படுத்தப்பட்டது; பயன்படுத்தப்பட்ட கணினிகள்

# poi_computer_repair_yes
source: Yes;Computer repair
ta: ஆம்; கணினி பழுது

# poi_computer_sales_no
source: Sale of computers: no
ta: கணினிகளின் விற்பனை: இல்லை

# poi_computer_repair_no
source: Computer repair: no
ta: கணினி பழுது: இல்லை

# poi_computer_parts_yes
source: Yes;Computer parts
ta: ஆம்; கணினி பாகங்கள்

# poi_computer_parts_no
source: Computer parts: no
ta: கணினி பாகங்கள்: இல்லை

# poi_climbing_crag
source: Climbing crag
ta: ஏறும் நண்டு

# poi_museum_art
source: Art
ta: கலை

# poi_museum_gallery
source: Gallery
ta: கேலரி

# poi_museum_transport
source: Transport
ta: போக்குவரத்து

# poi_museum_railway
source: Railway
ta: ரயில்வே

# poi_museum_aviation
source: Aviation
ta: பறப்பியல்

# poi_museum_aerospace
source: Aerospace
ta: ஏரோச்பேச்

# poi_museum_maritime
source: Maritime
ta: கடல்சார்

# poi_museum_science
source: Science
ta: அறிவியல்

# poi_museum_apis_mellifera
source: Honeybees
ta: தேனீக்கள்

# poi_museum_nature
source: Nature
ta: இயற்கை

# poi_museum_technology
source: Technology
ta: தொழில்நுட்பம்

# poi_museum_agriculture
source: Agriculture
ta: வேளாண்மை

# poi_museum_paleontology
source: Paleontology
ta: பேலியோண்டாலசி

# poi_museum_history
source: History
ta: வரலாறு

# poi_museum_living_history
source: Living history
ta: வாழ்க்கை வரலாறு

# poi_museum_military
source: Military
ta: தரைப்படை

# poi_museum_war
source: War
ta: போர்

# poi_museum_archaeological
source: Archaeological
ta: தொல்பொருள்

# poi_museum_open_air
source: Open air
ta: திறந்த காற்று

# poi_museum_local
source: Local
ta: உள்ளக

# poi_museum_children
source: Children
ta: குழந்தைகள்

# poi_museum_ethnography
source: Ethnography
ta: இனவியல்

# poi_museum_person
source: Person
ta: ஆள்

# poi_museum_language
source: Language
ta: மொழி

# poi_museum_health
source: Health
ta: உடல்நலம்

# poi_toilets_disposal_dry_toilet
source: Toilets disposal: dry toilet
ta: கழிப்பறைகள் அகற்றல்: உலர்ந்த கழிப்பறை

# poi_toilets_position_seated
source: Toilets position: seated
ta: கழிப்பறைகள் நிலை: அமர்ந்திருக்கும்

# poi_toilets_position_urinal
source: Toilets position: urinal
ta: கழிப்பறைகள் நிலை: சிறுநீர்

# poi_toilets_position_squat
source: Toilets position: squat
ta: கழிப்பறைகள் நிலை: குந்து

# poi_gender_segregated_yes
source: Gender segregated: yes
ta: பாலினம் பிரிக்கப்பட்டது: ஆம்

# poi_gender_segregated_no
source: Gender segregated: no
ta: பாலினம் பிரிக்கப்பட்டது: இல்லை

# poi_toilets_paper_supplied_yes
source: Paper supplied: yes
ta: காகிதம் வழங்கப்பட்டது: ஆம்

# poi_toilets_paper_supplied_no
source: Paper supplied: no
ta: வழங்கப்பட்ட காகிதம்: இல்லை

# poi_toilets_hands_drying_yes
source: Hands drying: yes
ta: கைகள் உலர்த்துதல்: ஆம்

# poi_toilets_hands_drying_no
source: Hands drying: no
ta: கைகள் உலர்த்துதல்: இல்லை

# poi_toilets_handwashing_yes
source: Handwashing: yes
ta: கை கழுவுதல்: ஆம்

# poi_toilets_handwashing_no
source: Handwashing: no
ta: கை கழுவுதல்: இல்லை

# poi_handwashing_soap_yes
source: Soap: yes
ta: சோப்பு: ஆம்

# poi_handwashing_soap_no
source: Soap: no
ta: சோப்பு: இல்லை

# poi_handwashing_hand_disinfection_yes
source: Hand disinfection: yes
ta: கை கிருமி நீக்கம்: ஆம்

# poi_handwashing_hand_disinfection_no
source: Hand disinfection: no
ta: கை கிருமிநாசினி: இல்லை

# poi_handwashing_hand_cleaning_paste_yes
source: Hand cleaning paste: yes
ta: கை தூய்மை பேச்ட்: ஆம்

# poi_handwashing_hand_cleaning_paste_no
source: Hand cleaning paste: no
ta: கை தூய்மை பேச்ட்: இல்லை

# poi_handwashing_creme_yes
source: Creme: yes
ta: க்ரீம்: ஆம்

# poi_handwashing_creme_no
source: Creme: no
ta: கிரீம்:

# poi_hot_water_yes
source: Hot water: yes
ta: சூடான நீர்: ஆம்

# poi_hot_water_no
source: Hot water: no
ta: சூடான நீர்: இல்லை

# poi_post_office_bureau
source: Bureau
ta: பணியகம்

# poi_post_office_post_annex
source: Post annex
ta: இடுகை இணைப்பு

# poi_post_office_post_partner
source: Post partner
ta: இடுகை கூட்டாளர்

# poi_post_office_service_provider
source: Post office service provider
ta: தபால் அலுவலக பணி வழங்குநர்

# poi_post_office_service_brand
source: Post office brand
ta: தபால் அலுவலக சூட்டுக்குறி

# poi_post_office_collection_times
source: Post office collection times
ta: தபால் அலுவலக சேகரிப்பு நேரம்

# poi_post_office_opening_hours
source: Post office opening hours
ta: தபால் அலுவலகம் திறக்கும் நேரம்

# poi_books_adults
source: Adults
ta: பெரியவர்கள்

# poi_collector
source: Collector
ta: சேகரிப்பான்

# poi_blowhole
source: Blowhole
ta: ப்ளோஓல்

# poi_skate
source: Skateshop
ta: ச்கேட்சாப்

# poi_hospice
source: Hospice
ta: விருந்தோம்பல்

# poi_telecommunication
source: Telecommunication
ta: தொலைத்தொடர்பு

# poi_avalanche_transceiver
source: Avalanche Victim Detector;AVD;Avalanche transceiver
ta: பனிச்சரிவு பாதிக்கப்பட்ட டிடெக்டர்; ஏ.வி.டி; பனிச்சரிவு டிரான்ச்சீவர்

# poi_avalanche_transceiver_training
source: Avalanche transceiver training
ta: பனிச்சரிவு டிரான்ச்சீவர் பயிற்சி

# poi_avalanche_transceiver_checkpoint
source: Avalanche transceiver checkpoint
ta: பனிச்சரிவு டிரான்ச்சீவர் சோதனைச் சாவடி

# poi_parcel_locker
source: Parcel locker
ta: பார்சல் லாக்கர்

# poi_tiles
source: Tiles store
ta: ஓடுகள் கடை

# poi_board_type_art
source: Art
ta: கலை

# poi_board_type_planet_walk
source: Planet walk
ta: பிளானட் வாக்

# poi_board_type_sight
source: Sight
ta: பார்வை

# poi_board_type_sport
source: Sport
ta: விளையாட்டு

# poi_board_type_welcome_sign
source: Welcome sign
ta: வரவேற்பு அடையாளம்

# poi_landuse_education
source: Educational area
ta: கல்வி பகுதி

# poi_greenery
source: Greenery
ta: பசுமை

# poi_hairdresser_supply
source: Hairdresser supply store
ta: சிகையலங்கார வல்லுநர் விநியோக கடை

# poi_changing_table_filter
source: Changing table
ta: அட்டவணையை மாற்றுதல்

# poi_shop_fuel
source: Fuel store
ta: எரிபொருள் கடை

# poi_printer_ink
source: Printer ink store
ta: அச்சுப்பொறி மை கடை

# poi_water_sports
source: Water sports store
ta: நீர் விளையாட்டு கடை

# poi_payment_american_express_contactless_yes
source: Contactless American Express (AMEX)
ta: தொடர்பு இல்லாத அமெரிக்கன் எக்ச்பிரச் (AMEX)

# poi_payment_girocard_contactless_yes
source: Contactless Girocard
ta: தொடர்பு இல்லாத கிர் கார்டை

# poi_payment_maestro_contactless_yes
source: Contactless Maestro
ta: தொடர்பு இல்லாத மேச்ட்ரோ

# poi_payment_mastercard_contactless_yes
source: Contactless MasterCard
ta: தொடர்பு இல்லாத மாச்டர்கார்டு

# poi_payment_visa_contactless_yes
source: Contactless Visa
ta: தொடர்பு இல்லாத விசா

# poi_payment_american_express_contactless_no
source: Contactless American Express (AMEX) not accepted
ta: தொடர்பு இல்லாத அமெரிக்கன் எக்ச்பிரச் (AMEX) ஏற்றுக்கொள்ளப்படவில்லை
