Repository: 247i/TACETr
Catalog: உரை/தானி/osmand-phrases-*.po
Languages: ta

# poi_payment_girocard_contactless_no
source: Contactless Girocard not accepted
ta: தொடர்பு இல்லாத கிர் கார்டை ஏற்றுக்கொள்ளவில்லை

# poi_payment_maestro_contactless_no
source: Contactless Maestro not accepted
ta: தொடர்பு இல்லாத மேச்ட்ரோ ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_mastercard_contactless_no
source: Contactless MasterCard not accepted
ta: தொடர்பு இல்லாத மாச்டர்கார்டு ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_visa_contactless_no
source: Contactless Visa not accepted
ta: தொடர்பு இல்லாத விசா ஏற்றுக்கொள்ளப்படவில்லை

# poi_rice
source: Rice shop
ta: அரிசி கடை

# poi_wool
source: Wool store
ta: கம்பளி கடை

# poi_birds_nest
source: Bird's nest
ta: பறவையின் கூடு

# poi_dovecote
source: Dovecote
ta: டோவ்கோட்

# poi_fish_pass
source: Fish pass
ta: மீன் பாச்

# poi_laundry_service_yes
source: Yes
ta: ஆம்

# poi_laundry_service_no
source: No
ta: இல்லை

# poi_dry_cleaning_yes
source: Yes
ta: ஆம்

# poi_dry_cleaning_no
source: No
ta: இல்லை

# poi_termite_mound
source: Termite mound
ta: டெர்மைட் மவுண்ட்

# poi_board_type_wildlife
source: Wildlife
ta: வனவிலங்குகள்

# poi_board_type_nature
source: Nature
ta: இயற்கை

# poi_food_no
source: Food: no
ta: உணவு: இல்லை

# poi_flow_rate
source: Flow rate
ta: ஓட்ட விகிதம்

# poi_golf_pin
source: Golf pin
ta: கோல்ஃப் முள்

# poi_payment_mir_no
source: Mir cards not accepted
ta: மிர் கார்டுகள் ஏற்றுக்கொள்ளப்படவில்லை

# poi_payment_mir_yes
source: Mir
ta: மிர்

# poi_club_youth_movement
source: Youth movement
ta: இளைஞர் இயக்கம்

# poi_club_amateur_radio
source: Amateur radio club
ta: அமெச்சூர் ரேடியோ கிளப்

# poi_club_religion
source: Religion club
ta: மத கிளப்

# poi_club_dog
source: Dog club
ta: நாய் கிளப்

# poi_board_title
source: Board title
ta: போர்டு தலைப்பு

# poi_short_name
source: Short name
ta: குறுகிய பெயர்

# poi_club_aviation
source: Aviation club
ta: விமான கிளப்

# poi_club_bicycle
source: Bicycle club
ta: சைக்கிள் கிளப்

# poi_club_doityourself
source: DIY club
ta: DIY கிளப்

# poi_first_aid_kit
source: First aid kit
ta: முதலுதவி அறிவிலி

# poi_dog_leashed
source: Dogs: leashed only
ta: நாய்கள்: சாய்ந்தன

# poi_dog_unleashed
source: Dogs: don't need to be leashed
ta: நாய்கள்: சசியாதபடி தேவையில்லை

# poi_dog_designated
source: Designated for dogs
ta: நாய்களுக்காக நியமிக்கப்பட்டுள்ளது

# poi_playground_structure
source: Structure
ta: கட்டமைப்பு

# poi_playground_slide
source: Slide
ta: ச்லைடு

# poi_playground_climbingframe
source: Climbing frame
ta: ஏறும் சட்டகம்

# poi_playground_climbingwall
source: Climbing wall
ta: ஏறும் சுவர்

# poi_playground_balancebeam
source: Balance beam
ta: சமநிலை கற்றை

# poi_playground_playhouse
source: Playhouse
ta: பிளேஅவுச்

# poi_playground_sandpit
source: Sandpit
ta: சாண்ட்பிட்

# poi_playground_hopscotch
source: Hopscotch court
ta: ஆப்ச்காட்ச் அறமன்றம்

# poi_playground_teenshelter
source: Teenshelter
ta: டீன்செல்டர்

# poi_playground_sledding
source: Sledding
ta: ச்லெடிங்

# poi_playground_youth_bench
source: Youth bench
ta: இளைஞர் பெஞ்ச்

# poi_playground_map
source: Map
ta: வரைபடம்

# poi_playground_bridge
source: Bridge
ta: பாலம்

# poi_playground_funnel_ball
source: Funnel ball
ta: புனல் பந்து

# poi_playground_tunnel_tube
source: Tunnel tube
ta: சுரங்கப்பாதை குழாய்

# poi_playground_speaking_tube
source: Speaking tube
ta: பேசும் குழாய்

# poi_playground_ball_pool
source: Ball pool
ta: பந்து குளம்

# poi_playground_swing
source: Swing
ta: ச்விங்

# poi_playground_spinning_circle
source: Spinning circle
ta: சுழல் வட்டம்

# poi_playground_basketswing
source: Basketswing
ta: கூடை

# poi_playground_basketrotator
source: Basket rotator
ta: கூடை ரோட்டேட்டர்

# poi_playground_aerialrotator
source: Aerial rotator
ta: வான்வழி ரோட்டேட்டர்

# poi_playground_seesaw
source: Seesaw
ta: சீசா

# poi_playground_springy
source: Springy
ta: ச்பிரிங்

# poi_playground_trampoline
source: Trampoline
ta: டிராம்போலைன்

# poi_playground_roundabout
source: Roundabout
ta: ரவுண்டானா

# poi_playground_cushion
source: Bouncy cushion
ta: பவுன்சி குசன்

# poi_playground_zipwire
source: Zipwire
ta: சிப்வைர்

# poi_playground_water
source: Water
ta: நீர்

# poi_playground_splash_pad
source: Splash pad
ta: ச்பிளாச் பேட்

# poi_playground_horizontal_bar
source: Horizontal bar
ta: கிடைமட்ட பட்டி

# poi_playground_activitypanel
source: Activity panel
ta: செயல்பாட்டு குழு

# poi_playground_exercise
source: Outdoor gym
ta: வெளிப்புற உடற்பயிற்சி கூடம்

# poi_climbing_speed_yes
source: Speed: yes
ta: வேகம்: ஆம்

# poi_climbing_grade_uiaa_max
source: Hardest route (UIAA grade)
ta: கடினமான பாதை (UIAA தரம்)

# poi_climbing_grade_uiaa_mean
source: Mean route (UIAA grade)
ta: சராசரி பாதை (அவிழ்க்கும்)

# poi_climbing_grade_french_max
source: Hardest route (French grade)
ta: கடினமான பாதை (பிரஞ்சு தரம்)

# poi_climbing_grade_french_mean
source: Mean route (French grade)
ta: சராசரி பாதை (பிரஞ்சு தரம்)

# poi_climbing_grade_saxon_max
source: Hardest route (Saxon grade)
ta: கடினமான பாதை (சாக்சன் தரம்)

# poi_climbing_grade_saxon_mean
source: Mean route (Saxon grade)
ta: சராசரி பாதை (சாக்சன் தரம்)

# poi_climbing_grade_uiaa
source: UIAA climbing grade
ta: Bmubing கோப்ரிங் கோட்

# poi_climbing_grade_french
source: French climbing grade
ta: பிரஞ்சு ஏறும் தகுதி

# poi_climbing_grade_saxon
source: Saxon climbing grade
ta: சாக்சன் ஏறும் தகுதி

# poi_climbing_grade_novice
source: Novice
ta: புதியவர்

# poi_climbing_grade_beginner
source: Beginner
ta: தொடக்க

# poi_climbing_grade_intermediate
source: Intermediate
ta: இடைநிலை

# poi_climbing_grade_advanced
source: Advanced
ta: மேம்பட்ட

# poi_climbing_grade_expert
source: Expert
ta: வல்லுநர்

# poi_climbing_grade_super_expert
source: Super expert
ta: சூப்பர் வல்லுநர்

# poi_climbing_grade_elite
source: Elite
ta: எலைட்

# poi_climbing_grade_super_elite
source: Super elite
ta: சூப்பர் எலைட்

# poi_climbing_grade_aliens
source: Aliens
ta: வேற்றுகிரகவாசிகள்

# poi_climbing_bolt_abseil
source: Abseil
ta: அப்சைலிங்

# poi_climbing_bolt_anchor
source: Anchor
ta: நங்கூரம்

# poi_climbing_bolts_yes
source: Yes
ta: ஆம்

# poi_climbing_bolts_no
source: No
ta: இல்லை

# poi_climbing_bolts
source: Climbing bolts
ta: ஏறும் போல்ட்

# poi_climbing_quality_medium
source: Medium
ta: சராசரி

# poi_trampoline_park
source: Trampoline park
ta: டிராம்போலைன் பார்க்

# poi_hiking_yes
source: Yes
ta: ஆம்

# poi_self_checkout_no
source: Self checkout: no
ta: தன்வய புதுப்பிப்பு: இல்லை

# poi_self_checkout_yes
source: Yes
ta: ஆம்

# poi_self_checkout_only
source: Only
ta: மட்டும்

# poi_lifeguard
source: Lifeguard
ta: லைஃப் கார்ட்

# poi_lifeguard_base
source: Lifeguard base
ta: லைஃப் கார்ட் அடிப்படை

# poi_lifeguard_tower
source: Lifeguard tower
ta: லைஃப் கார்ட் கோபுரம்

# poi_antenna
source: Antenna
ta: அலைக்கம்பம்

# poi_aboriginal_lands
source: Aboriginal lands
ta: பழங்குடி நிலங்கள்

# poi_recycling_plastic_bottle_caps
source: Plastic bottle caps
ta: பிளாச்டிக் பாட்டில் தொப்பிகள்

# poi_recycling_pens
source: Pens
ta: பேனாக்கள்

# poi_recycling_pet
source: PET
ta: செல்லப்பிள்ளை

# poi_recycling_aerosol_cans
source: Aerosol cans
ta: ஏரோசோல் கேன்கள்

# poi_recycling_aluminium_cans
source: Aluminium cans
ta: அலுமினிய கேன்கள்

# poi_recycling_asbestos
source: Asbestos
ta: கல்நார்

# poi_recycling_bags
source: Bags
ta: பைகள்

# poi_recycling_belts
source: Belts
ta: பெல்ட்கள்

# poi_recycling_boats
source: Boats
ta: படகுகள்

# poi_recycling_coffee_capsules
source: Coffee capsules
ta: காபி காப்ச்யூல்கள்

# poi_recycling_electrical_appliances
source: Electrical appliances
ta: மின் உபகரணங்கள்

# poi_recycling_electronics
source: Electronics
ta: மின்னணுவியல்

# poi_recycling_food
source: Food
ta: உணவு

# poi_recycling_gas_bottles
source: Gas bottles
ta: எரிவாயு பாட்டில்கள்

# poi_recycling_glass_bottles_colour
source: Coloured glass bottles
ta: வண்ண கண்ணாடி பாட்டில்கள்

# poi_recycling_glass_jars
source: Glass jars
ta: கண்ணாடி சாடிகள்

# poi_recycling_marine_waste
source: Marine waste
ta: கடல் கழிவு

# poi_recycling_metal_packaging
source: Metal packaging
ta: உலோக பேக்கேசிங்

# poi_recycling_oil
source: Oil
ta: எண்ணெய்

# poi_recycling_others
source: Others
ta: மற்றவர்கள்

# poi_recycling_pallets
source: Pallets
ta: தட்டுகள்

# poi_recycling_plastic_bottle_tops
source: Plastic bottle tops
ta: பிளாச்டிக் பாட்டில் டாப்ச்

# poi_recycling_plastic_bags
source: Plastic bags
ta: பிளாச்டிக் பைகள்

# poi_recycling_pmd
source: PMD
ta: பி.எம்.டி.

# poi_recycling_polystyrene_foam
source: Polystyrene foam
ta: பாலிச்டிரீன் நுரை

# poi_recycling_printer_inkjet_cartridges
source: Printer inkjet cartridges
ta: அச்சுப்பொறி இன்க்செட் தோட்டாக்கள்

# poi_recycling_printer_toner_cartridges
source: Printer toner cartridges
ta: அச்சுப்பொறி டோனர் தோட்டாக்கள்

# poi_recycling_refund_bottles
source: Refund bottles
ta: பாட்டில்களைத் திருப்பித் தரும்

# poi_recycling_second_hand
source: Second hand
ta: இரண்டாவது கை

# poi_recycling_small_metal
source: Small metal parts
ta: சிறிய உலோக பாகங்கள்

# poi_recycling_textiles
source: Textiles
ta: துணி

# poi_recycling_toys
source: Toys
ta: பொம்மைகள்

# poi_waste_trash
source: Trash
ta: குப்பை

# poi_waste_oil
source: Oil
ta: எண்ணெய்

# poi_waste_drugs
source: Drugs
ta: மருந்துகள்

# poi_waste_organic
source: Organic
ta: ஆர்கானிக்

# poi_waste_rubble
source: Rubble
ta: இடிபாடுகள்

# poi_waste_dog_excrement
source: Dog excrement
ta: நாய் வெளியேற்றம்

# poi_waste_cigarettes
source: Cigarettes
ta: சிகரெட்டுகள்

# poi_sinkhole_estavelle
source: Sinkhole: estavelle
ta: சிங்ஓல்: எச்டாவெல்லா

# poi_sinkhole_bluehole
source: Sinkhole: bluehole
ta: சிங்க்ஓல்: ப்ளூஓல்

# poi_sinkhole_doline
source: Sinkhole: doline
ta: சிங்க்ஓல்: பள்ளத்தாக்குகள்

# poi_sinkhole_ponor
source: Sinkhole: ponor
ta: சிங்கலே: பொனோர்

# poi_sinkhole_pit
source: Sinkhole: pit
ta: சி.என்.ஓல்: பானம்

# poi_barrier_coupure
source: Coupure barrier
ta: தடை வெட்டு

# poi_barrier_planter
source: Planter
ta: தோட்டக்காரர்

# poi_spikes
source: Spikes
ta: கூர்முனை

# poi_sump_buster
source: Sump buster
ta: சம்ப் பச்டர்

# poi_wedge
source: Wedge
ta: ஆப்பு

# poi_wicket_gate
source: Wicket gate
ta: விக்கெட் கேட்

# poi_barrier_bar
source: Barrier bar
ta: தடை பட்டி

# poi_barrier_board
source: Barrier board
ta: தடை வாரியம்

# poi_barrier_tyres
source: Tyres
ta: டயர்கள்

# poi_tank_trap
source: Tank trap
ta: தொட்டி பொறி

# poi_toy_library
source: Toy library
ta: பொம்மை நூலகம்

# poi_surface_chipseal
source: Chipseal
ta: சிப்சீல்

# poi_lock_name
source: Lock name
ta: பூட்டு பெயர்

# poi_draft
source: Fairway depth
ta: நியாயமான ஆழம்

# poi_maxlength
source: Maximum length
ta: அதிகபட்ச நீளம்

# poi_lock_ref
source: Reference of a lock
ta: ஒரு பூட்டின் குறிப்பு

# poi_lock_height
source: Height of a lock
ta: ஒரு பூட்டின் உயரம்

# poi_boat_private
source: Boat access: private
ta: படகு அணுகல்: தனியார்

# poi_boat_designated
source: Boat access: designated
ta: படகு அணுகல்: நியமிக்கப்பட்டுள்ளது

# poi_boat_destination
source: Boat access: destination
ta: படகு அணுகல்: இலக்கு

# poi_boat_permissive
source: Boat access: permissive
ta: படகு அணுகல்: இசைவு

# poi_boat_unknown
source: Boat access: unknown
ta: படகு அணுகல்: தெரியவில்லை

# poi_boat_yes
source: Boat access: yes
ta: படகு அணுகல்: ஆம்

# poi_boat_no
source: Boat access: no
ta: படகு அணுகல்: இல்லை

# poi_ship_private
source: Ship access: private
ta: கப்பல் அணுகல்: தனியார்

# poi_ship_designated
source: Ship access: designated
ta: கப்பல் அணுகல்: நியமிக்கப்பட்டுள்ளது

# poi_ship_destination
source: Ship access: destination
ta: கப்பல் அணுகல்: இலக்கு

# poi_ship_permissive
source: Ship access: permissive
ta: கப்பல் அணுகல்: இசைவு

# poi_ship_delivery
source: Ship access: delivery
ta: கப்பல் அணுகல்: டெலிவரி

# poi_ship_yes
source: Ship access: yes
ta: கப்பல் அணுகல்: ஆம்

# poi_ship_no
source: Ship access: no
ta: கப்பல் அணுகல்: இல்லை

# poi_cemt_va
source: Va
ta: வா

# poi_cemt_vb
source: Vb
ta: வி.பி.

# poi_cemt_via
source: VIa
ta: வழிமம்

# poi_cemt_vib
source: VIb
ta: விப்

# poi_cemt_vic
source: VIc
ta: விக்

# poi_sac_scale
source: SAC scale
ta: SAC அளவுகோல்

# poi_cai_scale
source: CAI scale
ta: குதிரைகளின் செதில்கள்

# poi_tunnel_name
source: Tunnel name
ta: சுரங்கப்பாதை பெயர்

# poi_bridge_name
source: Bridge name
ta: பாலம் பெயர்

# poi_vending_machine_fuel
source: Yes
ta: ஆம்

# poi_surface_acrylic
source: Surface: acrylic
ta: மேற்பரப்பு: அக்ரிலிக்

# poi_surface_carpet
source: Surface: carpet
ta: மேற்பரப்பு: கம்பளம்

# poi_surface_plastic
source: Surface: plastic
ta: மேற்பரப்பு: பிளாச்டிக்

# poi_surface_rubber
source: Surface: rubber
ta: மேற்பரப்பு: ரப்பர்

# poi_assembly_point
source: Assembly point
ta: பேரவை புள்ளி

# poi_not_pt_shelter_yes
source: Shelter (not for public transport)
ta: தங்குமிடம் (பொது போக்குவரத்துக்கு அல்ல)

# poi_bicycle_designated
source: Designated for bicycles
ta: சைக்கிள்களுக்காக நியமிக்கப்பட்டுள்ளது

# poi_horse_designated
source: Designated for horses
ta: குதிரைகளுக்காக நியமிக்கப்பட்டுள்ளது

# poi_foot_designated
source: Designated for pedestrians
ta: பாதசாரிகளுக்கு நியமிக்கப்பட்டுள்ளது

# poi_motor_vehicle_designated
source: Designated for motor vehicles
ta: மின்னோடி வாகனங்களுக்காக நியமிக்கப்பட்டுள்ளது

# poi_motorcar_designated
source: Designated for motorcars
ta: மின்னோடி கார்களுக்காக நியமிக்கப்பட்டுள்ளது

# poi_vehicle_designated
source: Designated for vehicles
ta: வாகனங்களுக்காக நியமிக்கப்பட்டுள்ளது

# poi_healthcare_speciality_allergology
source: Allergology
ta: ஒவ்வாமை

# poi_healthcare_speciality_cardiac_surgery
source: Cardiac surgery
ta: இதய அறுவை மருத்தீடு

# poi_healthcare_speciality_endodontics
source: Endodontics
ta: எண்டோடோன்டிக்ச்

# poi_healthcare_speciality_geriatrics
source: Geriatrics
ta: வயதான மருத்துவம்

# poi_healthcare_speciality_haematology
source: Haematology
ta: ஈமாட்டாலசி

# poi_healthcare_speciality_infectious_diseases
source: Infectious diseases
ta: தொற்று நோய்கள்

# poi_healthcare_speciality_paediatric_dentistry
source: Paediatric dentistry
ta: குழந்தை பல் மருத்துவம்

# poi_healthcare_speciality_paediatric_surgery
source: Paediatric surgery
ta: குழந்தை அறுவை மருத்தீடு

# poi_healthcare_speciality_periodontics
source: Periodontics
ta: பீரியண்டோன்டிக்ச்

# poi_healthcare_speciality_rheumatology
source: Rheumatology
ta: வாதவியல்

# poi_healthcare_speciality_community
source: Community
ta: சமூகம்

# poi_healthcare_speciality_dialysis
source: Dialysis
ta: டயாலிசிச்

# poi_healthcare_speciality_weight_loss
source: Weight loss
ta: எடை இழப்பு

# poi_healthcare_speciality_blood_check
source: Blood check
ta: இரத்த சோதனை

# poi_healthcare_speciality_intensive
source: Intensive
ta: தீவிரமான

# poi_healthcare_speciality_fertility
source: Fertility
ta: கருவுறுதல்

# poi_healthcare_speciality_massage_therapy
source: Massage therapy
ta: மசாச் மருத்தீடு

# poi_healthcare_speciality_vascular_surgery
source: Vascular surgery
ta: வாச்குலர் அறுவை மருத்தீடு

# poi_checkpoint_cycling
source: Cycling checkpoint
ta: சைக்கிள் ஓட்டுதல் சோதனைச் சாவடி

# poi_emergency_bay
source: Emergency bay
ta: அவசர விரிகுடா

# poi_dressing_room
source: Dressing room
ta: ஆடை அறை

# poi_osmand_access_main_tag
source: Access
ta: அணுகல்

# poi_healthcare_speciality_ayurveda
source: Ayurveda
ta: ஆயுர்வேதம்

# poi_healthcare_speciality_reflexology
source: Reflexology
ta: ரிஃப்ளெக்சாலசி

# poi_healthcare_speciality_anthroposophical
source: Anthroposophical
ta: மானுடவியல்

# poi_healthcare_speciality_applied_kinesiology
source: Applied kinesiology
ta: பயன்பாட்டு கினீசியாலசி

# poi_healthcare_speciality_aromatherapy
source: Aromatherapy
ta: அரோமதெரபி

# poi_healthcare_speciality_hydrotherapy
source: Hydrotherapy
ta: நீர் மருத்தீடு

# poi_healthcare_speciality_hypnosis
source: Hypnosis
ta: ரிப்னாசிச்

# poi_healthcare_speciality_shiatsu
source: Shiatsu
ta: சியாட்சு

# poi_healthcare_speciality_tuina
source: Tuina
ta: துயினா

# poi_healthcare_speciality_unani
source: Unani
ta: யுனானி

# poi_healthcare_speciality_neonatology
source: Neonatology
ta: நியோனாட்டாலசி

# poi_healthcare_speciality_family_medicine
source: Family medicine
ta: குடும்ப மருத்துவம்

# poi_healthcare_speciality_psychology
source: Psychology
ta: உளவியல்

# poi_healthcare_speciality_kinesitherapy
source: Kinesitherapy
ta: கின்சிதெரபி

# poi_healthcare_speciality_primary_care
source: Primary care
ta: முதன்மை கவனிப்பு

# poi_healthcare_speciality_otorhinolaryngology
source: Otorhinolaryngology
ta: ஓட்டோர்இனோலரிங்காலசி

# poi_healthcare_speciality_implantology
source: Implantology
ta: உள்வைப்பு

# poi_healthcare_speciality_rehabilitation
source: Rehabilitation
ta: மறுவாழ்வு

# poi_healthcare_speciality_nutrition
source: Nutrition
ta: ஊட்டம்

# poi_healthcare_speciality_obstetrics
source: Obstetrics
ta: மகப்பேறியல்

# poi_healthcare_speciality_humanistic
source: Humanistic psychology
ta: மனிதநேய உளவியல்

# poi_healthcare_speciality_body
source: Body oriented psychotherapy
ta: உடல் சார்ந்த உளவியல் மருத்தீடு

# poi_healthcare_speciality_systemic
source: Systemic therapy
ta: முறையான மருத்தீடு

# poi_healthcare_speciality_sophrologist
source: Sophrology
ta: சோஃபிராலசி

# poi_healthcare_speciality_abortion
source: Abortion
ta: கருச்சிதைவு

# poi_healthcare_speciality_travel_clinic
source: Travel clinic
ta: பயண மருத்துவமனை

# poi_healthcare_speciality_palliative
source: Palliative
ta: நோய்த்தடுப்பு

# poi_healthcare_speciality_denturist
source: Denturist
ta: டன்யூரிச்ட்

# poi_healthcare_speciality_pediatric
source: Pediatric
ta: குழந்தை

# poi_healthcare_speciality_diabetology
source: Diabetology
ta: நீரிழிவு

# poi_healthcare_speciality_pharmacology
source: Pharmacology
ta: மருந்தியல்

# poi_healthcare_speciality_cosmetic
source: Cosmetic
ta: ஒப்பனை

# poi_healthcare_speciality_pedorthist
source: Pedorthist
ta: பெடோர்திச்ட்

# poi_healthcare_speciality_pain_control
source: Pain control
ta: வலி கட்டுப்பாடு

# poi_healthcare_speciality_first_aid_training
source: First aid training
ta: முதலுதவி பயிற்சி

# poi_healthcare_speciality_sleep
source: Sleep
ta: தூங்கு

# poi_healthcare_speciality_proctology
source: Proctology
ta: புரோக்டாலசி

# poi_healthcare_speciality_audiology
source: Audiology
ta: ஆடியியல்

# poi_healthcare_speciality_autism
source: Autism
ta: மதியிறுக்கம்

# poi_healthcare_speciality_chronic
source: Chronic
ta: நாள்பட்ட

# poi_healthcare_speciality_physical_therapy
source: Physical therapy
ta: உடல் மருத்தீடு

# poi_healthcare_speciality_microbiology
source: Microbiology
ta: நுண்ணுயிரியல்

# poi_healthcare_speciality_venereology
source: Venereology
ta: பயன்படுத்த ve n மற்றும் eo பதிவு

# poi_from
source: From
ta: இருந்து

# poi_to
source: To
ta: பெறுநர்

# poi_via
source: Via
ta: வழிமம்

# poi_distance
source: Distance
ta: தூரம்

# poi_cycle_network
source: Cycle network
ta: சுழற்சி பிணையம்

# poi_state_proposed
source: State: proposed
ta: மாநிலம்: முன்மொழியப்பட்டது

# poi_state_alternate
source: State: alternate
ta: மாநிலம்: மாற்று

# poi_state_connection
source: State: connection
ta: மாநிலம்: இணைப்பு

# poi_state_inuse
source: State: in use
ta: மாநிலம்: பயன்பாட்டில்

# poi_state_recommended
source: State: recommended
ta: மாநிலம்: பரிந்துரைக்கப்படுகிறது

# poi_state_temporary
source: State: temporary
ta: மாநிலம்: தற்காலிக

# poi_state_disused
source: State: disused
ta: மாநிலம்: பயன்படுத்தப்படாதது

# poi_state_closed
source: State: closed
ta: மாநிலம்: மூடப்பட்டது

# poi_state_abandoned
source: State: abandoned
ta: மாநிலம்: கைவிடப்பட்டது

# poi_state_approved
source: State: approved
ta: மாநிலம்: அங்கீகரிக்கப்பட்டது

# poi_state_active
source: State: active
ta: மாநிலம்: செயலில்

# poi_state_under_construction
source: State: under construction
ta: மாநிலம்: கட்டுமானத்தின் கீழ்

# poi_state_main
source: State: main
ta: மாநிலம்: முதன்மை

# poi_state_suspended
source: State: suspended
ta: மாநிலம்: இடைநீக்கம்

# poi_state_detour
source: State: detour
ta: மாநிலம்: மாற்றுப்பாதை

# poi_ascent
source: Ascent
ta: ஏற்றம்

# poi_descent
source: Descent
ta: இறக்கம்

# poi_direction
source: Direction
ta: திசை

# poi_roundtrip_yes
source: Roundtrip: yes
ta: ரவுண்ட்ரிப்: ஆம்

# poi_roundtrip_no
source: Roundtrip: no
ta: ரவுண்ட்ரிப்: இல்லை

# poi_border_zone
source: Border zone
ta: எல்லை மண்டலம்

# poi_hang_gliding
source: Hang gliding
ta: சறுக்கு தொங்கு

# poi_live_music_yes
source: Yes
ta: ஆம்

# poi_padus_area
source: PAD-US area
ta: PAD-US பகுதி

# poi_padus_category_proclamation
source: Category: proclamation
ta: வகை: அறிவித்தல்

# poi_padus_category_fee
source: Category: fee
ta: வகை: கட்டணம்

# poi_padus_category_designation
source: Category: designation
ta: வகை: பதவி

# poi_padus_category_easement
source: Category: easement
ta: வகை: எளிதானது

# poi_padus_local_designation
source: Local designation
ta: உள்ளக பதவி

# poi_padus_local_manager
source: Local manager
ta: உள்ளக மேலாளர்

# poi_padus_owner_fullname
source: Owner
ta: உரிமையாளர்

# poi_padus_manager_type_fullname
source: Manager type
ta: மேலாளர் வகை

# poi_padus_manager_fullname
source: Manager
ta: மேலாளர்

# poi_padus_designation_type_fullname
source: Designation type
ta: பதவி வகை

# poi_padus_public_access_open
source: Access: open
ta: அணுகல்: திறந்திருக்கும்

# poi_padus_public_access_restricted
source: Access: restricted
ta: அணுகல்: தடைசெய்யப்பட்டுள்ளது

# poi_padus_public_access_unknown
source: Access: unknown
ta: அணுகல்: தெரியவில்லை

# poi_padus_public_access_closed
source: Access: closed
ta: அணுகல்: மூடப்பட்டது

# poi_us_maps_recreation_area_activity_backpacking
source: Backpacking
ta: பேக் பேக்கிங்

# poi_us_maps_recreation_area_activity_beachcombing
source: Beachcombing
ta: பீச் காம்பிங்

# poi_us_maps_recreation_area_activity_bicycling
source: Bicycling
ta: சைக்கிள் ஓட்டுதல்

# poi_us_maps_recreation_area_activity_big_game_hunting
source: Big Game Hunting
ta: பெரிய விளையாட்டு வேட்டை

# poi_us_maps_recreation_area_activity_boating_motorized
source: Motorized boating
ta: மின்னோடி பொருத்தப்பட்ட படகு சவாரி

# poi_us_maps_recreation_area_activity_boating_non_motorized
source: Non-motorized boating
ta: மின்னோடி அல்லாத படகு சவாரி

# poi_us_maps_recreation_area_facility_cabin_rentals
source: Cabin rentals
ta: கேபின் வாடகை

# poi_us_maps_recreation_area_activity_campground_camping
source: Campground camping
ta: முகாம் முகாம்

# poi_us_maps_recreation_area_activity_camping_and_cabins
source: Camping and cabins
ta: முகாம் மற்றும் அறைகள்

# poi_us_maps_recreation_area_activity_caving
source: Caving
ta: கேவிங்

# poi_us_maps_recreation_area_activity_climbing
source: Climbing
ta: ஏறுதல்

# poi_us_maps_recreation_area_activity_day_hiking
source: Day hiking
ta: நாள் நடைபயணம்

# poi_us_maps_recreation_area_activity_disc_golf
source: Disc golf
ta: வட்டு கோல்ஃப்

# poi_us_maps_recreation_area_activity_dispersed_camping
source: Dispersed camping
ta: சிதறடிக்கப்பட்ட முகாம்

# poi_us_maps_recreation_area_activity_dog_sledding
source: Dog sledding
ta: நாய் ச்லெடிங்

# poi_us_maps_recreation_area_activity_estuary_fishing
source: Estuary fishing
ta: தோட்ட மீன்பிடித்தல்

# poi_us_maps_recreation_area_activity_fishing
source: Fishing
ta: மீன்பிடித்தல்

# poi_us_maps_recreation_area_activity_fossil_collecting
source: Fossil collecting
ta: புதைபடிவ சேகரிப்பு

# poi_us_maps_recreation_area_activity_game_bird_waterfowl
source: Game bird waterfowl
ta: விளையாட்டு பறவை நீர்வீழ்ச்சி

# poi_us_maps_recreation_area_activity_geocaching_and_letterboxing
source: Geocaching and letterboxing
ta: சியோகாச்சிங் மற்றும் லெட்டர்பாக்சிங்

# poi_us_maps_recreation_area_activity_gold_panning
source: Gold panning
ta: தங்க பனிங்

# poi_us_maps_recreation_area_activity_group_camping
source: Group camping
ta: குழு முகாம்

# poi_us_maps_recreation_area_activity_group_picnicking
source: Group picnicking
ta: குழு பிக்னிக்

# poi_us_maps_recreation_area_activity_hang_gliding
source: Hang gliding
ta: சறுக்கு தொங்கு

# poi_us_maps_recreation_area_activity_hiking
source: Hiking
ta: ஐக்கிங்

# poi_us_maps_recreation_area_activity_horse_camping
source: Horse camping
ta: குதிரை முகாம்

# poi_us_maps_recreation_area_activity_horse_riding
source: Horse riding
ta: குதிரை சவாரி
