Repository: 247i/TACETr
Catalog: உரை/தானி/ospo-zone-ggi-54_activity_29-*.po
Languages: ta

source: Engage with open source projects
ta: திறந்த மூல திட்டங்களுடன் ஈடுபடுங்கள்

source: Activity ID: [GGI-A-29](https://gitlab.ow2.org/ggi/ggi/-/blob/main/handbook/content/54_activity_29.md).
ta: செயல்பாட்டு ஐடி: [GGI-A-29] (https://gitlab.ow2.org/ggi/ggi/-/blob/main/handbook/content/54_activity_29.md).

source: Description
ta: விவரம்

source: This activity is about committing significant contributions to some OSS projects that are important to you. Contributions are scaled up and committed at the organisation level (not personal level as in #26). They can take several forms, from direct funding to resources allocation (e.g. people, servers, infrastructure, communication, etc.), as long as they benefit the project or ecosystem sustainably and efficiently.
ta: இந்த செயல்பாடு உங்களுக்கு முக்கியமான சில OSS திட்டங்களுக்கு குறிப்பிடத்தக்க பங்களிப்புகளைச் செய்வது பற்றியது. பங்களிப்புகள் அளவிடப்பட்டு நிறுவன மட்டத்தில் உறுதியளிக்கப்படுகின்றன ( #26 இல் உள்ளதைப் போல தனிப்பட்ட நிலை அல்ல). நேரடி பொருள் முதல் வள ஒதுக்கீடு வரை (எ.கா. மக்கள், சேவையகங்கள், உள்கட்டமைப்பு, செய்தி தொடர்பு போன்றவை) பல வடிவங்களை எடுக்கலாம், அவை திட்டத்திற்கு அல்லது சுற்றுச்சூழல் அமைப்புக்கு நிலையான மற்றும் திறமையாக பயனளிக்கும் வரை.

source: This activity is a follow-up on activity #26 and brings open source projects' contributions to the level of the organisation, making them more visible, powerful, and beneficial. In this activity, the contributions are supposed to bring a substantial, long-term improvement to the OSS project: e.g., a developer or team who develops a much-wanted new feature, infrastructure assets, servers for a new service, take-over of the maintenance of a widely used branch.
ta: இந்த செயல்பாடு செயல்பாடு #26 ஐப் பின்தொடர்வது மற்றும் திறந்த மூல திட்டங்களின் பங்களிப்புகளை அமைப்பின் நிலைக்கு கொண்டு வருகிறது, அவை மேலும் காணக்கூடிய, சக்திவாய்ந்த மற்றும் நன்மை பயக்கும். இந்த செயல்பாட்டில், பங்களிப்புகள் OSS திட்டத்திற்கு கணிசமான, நீண்டகால முன்னேற்றத்தைக் கொண்டுவருவதாகும்: எ.கா., ஒரு உருவாக்குபவர் அல்லது குழு மிகவும் விரும்பப்பட்ட புதிய நற்பொருத்தம், உள்கட்டமைப்பு சொத்துக்கள், புதிய சேவைக்கான சேவையகங்கள் பரவலாகப் பயன்படுத்தப்படும் கிளையின் பராமரிப்பு.

source: The idea is to set aside a percentage of resources to sponsor open source developers that write and maintain libraries or projects that we use.
ta: நாங்கள் பயன்படுத்தும் நூலகங்கள் அல்லது திட்டங்களை எழுதி பராமரிக்கும் திறந்த மூல டெவலப்பர்களுக்கு நிதியுதவி செய்ய ஒரு சதவீத வளங்களை ஒதுக்குவதே இதன் சிந்தனை.

source: This activity implies to have a mapping of open source software used, and an evaluation of their criticality to decide which one to support.
ta: இந்த செயல்பாடு திறந்த மூல மென்பொருளின் மேப்பிங் பயன்படுத்தப்படுவதையும், எந்த ஒன்றை ஆதரிக்க வேண்டும் என்பதை தீர்மானிக்க அவற்றின் விமர்சனத்தின் மதிப்பீடு இருப்பதையும் குறிக்கிறது.

source: Opportunity Assessment
ta: வாய்ப்பு மதிப்பீடு

source: If every company using open source contributed at least a little, we would have a healthy ecosystem. <https://news.ycombinator.com/item?id=25432248>
ta: திறந்த மூலத்தைப் பயன்படுத்தும் ஒவ்வொரு நிறுவனமும் குறைந்தது கொஞ்சம் பங்களித்தால், எங்களுக்கு ஆரோக்கியமான சுற்றுச்சூழல் அமைப்பு இருக்கும். <https://news.ycombinator.com/item?id=25432248>

source: Supporting projects helps ensure their sustainability and provides access to information, even maybe help influence and prioritise some developments (although this should not be the main reason for supporting projects).
ta: திட்டங்களை ஆதரிப்பது அவர்களின் நிலைத்தன்மையை உறுதிப்படுத்த உதவுகிறது மற்றும் தகவல்களுக்கான அணுகலை வழங்குகிறது, சில முன்னேற்றங்களுக்கு செல்வாக்கு செலுத்துவதற்கும் முன்னுரிமை அளிப்பதற்கும் உதவக்கூடும் (இருப்பினும் இது திட்டங்களை ஆதரிப்பதற்கான முக்கிய காரணமாக இருக்கக்கூடாது).

source: Potential benefits of this activity: ensuring bug reports are prioritised and developments are integrated into the stable version. Possible costs associated with the activity: committing time to projects, cash commitment.
ta: இந்த செயல்பாட்டின் சாத்தியமான நன்மைகள்: பிழை அறிக்கைகள் முன்னுரிமை அளிக்கப்படுவதை உறுதி செய்வது மற்றும் முன்னேற்றங்கள் நிலையான பதிப்பில் ஒருங்கிணைக்கப்படுகின்றன. செயல்பாட்டுடன் தொடர்புடைய சாத்தியமான செலவுகள்: திட்டங்களுக்கு நேரத்தை வழங்குதல், பண அர்ப்பணிப்பு.

source: Progress Assessment
ta: முன்னேற்ற மதிப்பீடு

source: The following **verification points** demonstrate progress in this activity:
ta: பின்வரும் ** சரிபார்ப்பு புள்ளிகள் ** இந்த செயல்பாட்டின் முன்னேற்றத்தை நிரூபிக்கிறது:

source: Beneficiary project identified.
ta: பயனாளி திட்டம் அடையாளம் காணப்பட்டது.

source: Support option decided, such as direct monetary contribution or code contribution.
ta: நேரடி பண பங்களிப்பு அல்லது குறியீடு பங்களிப்பு போன்ற உதவி விருப்பம் தீர்மானிக்கப்பட்டது.

source: Task leader appointed.
ta: பணித் தலைவர் நியமிக்கப்பட்டார்.

source: Some contribution has happened.
ta: சில பங்களிப்புகள் நடந்துள்ளன.

source: Result of contribution has been evaluated.
ta: பங்களிப்பின் முடிவு மதிப்பீடு செய்யப்பட்டுள்ளது.

source: Verification points borrowed from OpenChain [self certification](https://certification.openchainproject.org/) questionnaire:
ta: OpenChain [சுய சான்றிதழ்] (https://certification.openchainproject.org/) கேள்வித்தாள்: கேள்வித்தாள்:

source: We have a policy for contribution to open source projects on behalf of the organisation.
ta: நிறுவனத்தின் சார்பாக திறந்த மூல திட்டங்களுக்கு பங்களிப்பதற்கான கொள்கை எங்களிடம் உள்ளது.

source: We have a documented procedure governing open source contributions.
ta: திறந்த மூல பங்களிப்புகளை நிர்வகிக்கும் ஆவணப்படுத்தப்பட்ட நடைமுறை எங்களிடம் உள்ளது.

source: We have a documented procedure for making all Software Staff aware of the open source contribution policy.
ta: அனைத்து மென்பொருள் ஊழியர்களும் திறந்த மூல பங்களிப்புக் கொள்கையைப் பற்றி அறிந்து கொள்வதற்கான ஆவணப்படுத்தப்பட்ட நடைமுறை எங்களிடம் உள்ளது.

source: Tools
ta: கருவிகள்

source: Some organisations offer mechanisms for funding open source projects (it could be convenient if your target project is in their portfolios).
ta: சில நிறுவனங்கள் திறந்த மூல திட்டங்களுக்கு நிதியளிப்பதற்கான வழிமுறைகளை வழங்குகின்றன (உங்கள் இலக்கு திட்டம் அவற்றின் இலாகாக்களில் இருந்தால் அது வசதியாக இருக்கும்).

source: [Open Collective](https://opencollective.com/).
ta: [திறந்த கூட்டு] (https://opencollective.com/).

source: [Software Freedom Conservancy](https://sfconservancy.org/).
ta: [மென்பொருள் சுதந்திர கன்சர்வேன்சி] (https://sfconservancy.org/).

source: [Tidelift](https://tidelift.com/).
ta: [Tidelift] (https://ctidelift.com/).

source: Recommendations
ta: பரிந்துரைகள்

source: Concentrate on projects that are critical for the organisation: these are the projects you most want to help with your contributions.
ta: நிறுவனத்திற்கு முக்கியமான திட்டங்களில் கவனம் செலுத்துங்கள்: உங்கள் பங்களிப்புகளுக்கு நீங்கள் உதவ விரும்பும் திட்டங்கள் இவை.

source: Target community projects.
ta: சமூக திட்டங்களை இலக்கு.

source: This activity requires a minimum familiarity with a target project.
ta: இந்த செயல்பாட்டிற்கு இலக்கு திட்டத்துடன் குறைந்தபட்ச பரிச்சயம் தேவைப்படுகிறது.

source: Resources
ta: வளங்கள்

source: [How to support open source projects now](https://sourceforge.net/blog/support-open-source-projects-now/): A short page with ideas on funding open source projects.
ta: [How பெறுநர் support திற மூலம் திட்டங்கள் now](https://sourceforge.net/blog/support-open-source-projects-now/): A குறுக்கு page with ideas on funding திற மூலம் projects.

source: [Sustain OSS: a space for conversations about sustaining open source](https://sustainoss.org)
ta: [Sustain OSS: a இடைவெளி க்கு conversations பற்றி sustaining திற source](https://sustainoss.org)

source: Proposed next activities
ta: முன்மொழியப்பட்ட அடுத்த நடவடிக்கைகள்

source: [GGI-A-26 - Contribute to open source projects](https://ospo-alliance.org/ggi/activities/contribute_to_open_source_vendors) The most natural way to engage with an open source initiative is by contributing directly to the project. You will in return collect valuable feedback on your contributions.
ta: . உங்கள் பங்களிப்புகள் குறித்து மதிப்புமிக்க கருத்துக்களை நீங்கள் சேகரிப்பீர்கள்.

source: [GGI-A-30 - Support open source communities](https://ospo-alliance.org/ggi/activities/support_open_source_communities) There are many ways to support the open source initiatives that are essential to your organisation. Getting engaged with the communities is a good way to discover and foster them.
ta: . சமூகங்களுடன் ஈடுபடுவது அவற்றைக் கண்டுபிடித்து வளர்ப்பதற்கான ஒரு சிறந்த வழியாகும்.
