Repository: 247i/TACETr
Catalog: உரை/தானி/ospo-zone-ggi-51_activity_42-*.po
Languages: ta

source: Manage open source skills and resources
ta: திறந்த மூல திறன்கள் மற்றும் வளங்களை நிர்வகிக்கவும்

source: Activity ID: [GGI-A-42](https://gitlab.ow2.org/ggi/ggi/-/blob/main/handbook/content/51_activity_42.md).
ta: செயல்பாட்டு ஐடி: [GGI-A-42] (https://gitlab.ow2.org/ggi/ggi/-/blob/main/handbook/content/51_activity_42.md).

source: Description
ta: விவரம்

source: This activity is focused on **software development** skills and resources. It includes the technologies and specific development skills of developers, as well as the overall development processes, methods and tools.
ta: இந்த செயல்பாடு ** மென்பொருள் மேம்பாடு ** திறன்கள் மற்றும் வளங்களில் கவனம் செலுத்துகிறது. இது டெவலப்பர்களின் தொழில்நுட்பங்கள் மற்றும் குறிப்பிட்ட மேம்பாட்டு திறன்களையும், ஒட்டுமொத்த வளர்ச்சி செயல்முறைகள், முறைகள் மற்றும் கருவிகளையும் உள்ளடக்கியது.

source: A vast amount of documentation, forums and discussions stemming from the ecosystem, and public resources is available for open source technologies. In order to fully benefit from their open source approach, one has to establish a roadmap of its current assets and desired targets to set up a consistent program for development skills, methods and tools within the teams.
ta: சுற்றுச்சூழல் அமைப்பிலிருந்து உருவான ஆவணங்கள், மன்றங்கள் மற்றும் விவாதங்கள் மற்றும் பொது வளங்கள் திறந்த மூல தொழில்நுட்பங்களுக்கு கிடைக்கின்றன. அவற்றின் திறந்த மூல அணுகுமுறையிலிருந்து முழுமையாக பயனடைய, ஒருவர் அதன் தற்போதைய சொத்துக்கள் மற்றும் அணிகளுக்குள் மேம்பாட்டு திறன்கள், முறைகள் மற்றும் கருவிகளுக்கான நிலையான திட்டத்தை அமைக்க விரும்பிய இலக்குகளின் வரைபடத்தை நிறுவ வேண்டும்.

source: **Domains of application**
ta: ** பயன்பாட்டின் களங்கள் **

source: One needs to establish the domains where the program will be applied, and how it will improve the quality and efficiency of code and practices. As an example, the program won't have the same benefits if there is only a single developer working on open source components, or if the whole development life cycle is optimised to include open source best practices.
ta: நிரல் பயன்படுத்தப்படும் களங்களை ஒருவர் நிறுவ வேண்டும், மேலும் இது குறியீடு மற்றும் நடைமுறைகளின் தகுதி மற்றும் செயல்திறனை எவ்வாறு மேம்படுத்தும். உதாரணமாக, திறந்த மூல கூறுகளில் ஒரு உருவாக்குபவர் மட்டுமே பணிபுரிந்தால், அல்லது திறந்த மூல சிறந்த நடைமுறைகளைச் சேர்க்க முழு வளர்ச்சி வாழ்க்கைச் சுழற்சியும் உகந்ததாக இருந்தால் நிரலுக்கு அதே நன்மைகள் இருக்காது.

source: One needs to define the scope to be embraced for open source development: technical components, applications, modernising or creating new development. Examples of development practices that can benefit from open source are:
ta: திறந்த மூல மேம்பாட்டிற்காக ஏற்றுக்கொள்ள வேண்டிய நோக்கத்தை ஒருவர் வரையறுக்க வேண்டும்: தொழில்நுட்ப கூறுகள், பயன்பாடுகள், நவீனமயமாக்கல் அல்லது புதிய வளர்ச்சியை உருவாக்குதல். திறந்த மூலத்திலிருந்து பயனடையக்கூடிய வளர்ச்சி நடைமுறைகளின் எடுத்துக்காட்டுகள்:

source: Cloud administration.
ta: முகில் நிர்வாகம்.

source: Cloud-native applications, how to innovate with these technologies.
ta: கிளவுட்-நேட்டிவ் பயன்பாடுகள், இந்த தொழில்நுட்பங்களுடன் எவ்வாறு புதுமைப்படுத்துவது.

source: DevOps, Continuous Integration / Continuous Delivery.
ta: டெவொப்ச், தொடர்ச்சியான ஒருங்கிணைப்பு / தொடர்ச்சியான வழங்கல்.

source: **Categories**
ta: ** பிரிவுகள் **

source: Skills and resources required to develop open source software: IP, licensing, practices.
ta: திறந்த மூல மென்பொருளை உருவாக்க தேவையான திறன்கள் மற்றும் வளங்கள்: ஐபி, உரிமம், நடைமுறைகள்.

source: Skills and resources required to develop software using open source components, languages, technologies.
ta: திறந்த மூல கூறுகள், மொழிகள், தொழில்நுட்பங்களைப் பயன்படுத்தி மென்பொருளை உருவாக்க தேவையான திறன்கள் மற்றும் வளங்கள்.

source: Skills and resources required to use open source methods and processes.
ta: திறந்த மூல முறைகள் மற்றும் செயல்முறைகளைப் பயன்படுத்த தேவையான திறன்கள் மற்றும் வளங்கள்.

source: Opportunity Assessment
ta: வாய்ப்பு மதிப்பீடு

source: Open source tools are increasingly popular among developers. This Activity addresses the need to avoid the proliferation of heterogeneous tools within a development team. It helps define a policy in this domain. It helps optimise training and experience building. A skills inventory is used for recruitment, training and succession planning in case a key employee leaves the company.
ta: டெவலப்பர்களிடையே திறந்த மூல கருவிகள் பெருகிய முறையில் பிரபலமாக உள்ளன. இந்த செயல்பாடு ஒரு மேம்பாட்டுக் குழுவிற்குள் பன்முக கருவிகளின் பெருக்கத்தைத் தவிர்க்க வேண்டிய அவசியத்தை குறிக்கிறது. இந்த களத்தில் ஒரு கொள்கையை வரையறுக்க இது உதவுகிறது. இது பயிற்சி மற்றும் அனுபவத்தை மேம்படுத்துவதற்கு உதவுகிறது. ஒரு முக்கிய ஊழியர் நிறுவனத்தை விட்டு வெளியேறினால் ஆட்சேர்ப்பு, பயிற்சி மற்றும் அடுத்தடுத்த திட்டமிடலுக்கு ஒரு திறன் சரக்கு பயன்படுத்தப்படுகிறது.

source: We would need a methodology to map open source software development skills.
ta: திறந்த மூல மென்பொருள் மேம்பாட்டு திறன்களை வரைபடமாக்க எங்களுக்கு ஒரு முறை தேவை.

source: Progress Assessment
ta: முன்னேற்ற மதிப்பீடு

source: The following **verification points** demonstrate progress in this Activity:
ta: பின்வரும் ** சரிபார்ப்பு புள்ளிகள் ** இந்த செயல்பாட்டின் முன்னேற்றத்தை நிரூபிக்கிறது:

source: There is a description of the open source production chain (the "software supply chain"),
ta: திறந்த மூல விளைவாக்கம் சங்கிலி ("மென்பொருள் விநியோக சங்கிலி") பற்றிய விளக்கம் உள்ளது,

source: There is a plan (or a wish list) for the rationalisation of development resources,
ta: வளர்ச்சி வளங்களை பகுத்தறிவுக்கு ஒரு திட்டம் (அல்லது விருப்ப பட்டியல்) உள்ளது,

source: There is a skills inventory summarising current developers' skills, education, and experience,
ta: தற்போதைய டெவலப்பர்களின் திறன்கள், கல்வி மற்றும் அனுபவத்தை சுருக்கமாகக் கூறும் திறன் சரக்கு உள்ளது,

source: There is a training wish list and program dealing with skills gaps,
ta: திறன் இடைவெளிகளைக் கையாளும் ஒரு பயிற்சி விருப்பப்பட்டியல் மற்றும் நிரல் உள்ளது,

source: There is a list of missing open source development best practices and a plan to apply them.
ta: காணாமல் போன திறந்த மூல மேம்பாட்டு சிறந்த நடைமுறைகள் மற்றும் அவற்றைப் பயன்படுத்துவதற்கான திட்டம் உள்ளது.

source: Recommendations
ta: பரிந்துரைகள்

source: Start simple, grow the analysis and roadmap steadily.
ta: எளிமையாகத் தொடங்குங்கள், பகுப்பாய்வு மற்றும் சாலை வரைபடத்தை சீராக வளர்க்கவும்.

source: When recruiting, set a strong emphasis on open source skills and experience. It's always easier when people already have an open source DNA than training and coaching people.
ta: ஆட்சேர்ப்பு செய்யும் போது, ​​திறந்த மூல திறன்கள் மற்றும் அனுபவத்திற்கு வலுவான முக்கியத்துவம் அளிக்கவும். மக்களுக்கு பயிற்சி மற்றும் பயிற்சி அளிப்பதை விட மக்கள் ஏற்கனவே திறந்த மூல டி.என்.ஏவைக் கொண்டிருக்கும்போது இது எப்போதும் எளிதானது.

source: Check training programs from software vendors and open source schools.
ta: மென்பொருள் விற்பனையாளர்கள் மற்றும் திறந்த மூலப் பள்ளிகளிலிருந்து பயிற்சி திட்டங்களை சரிபார்க்கவும்.

source: Resources
ta: வளங்கள்

source: More information:
ta: மேலும் தகவல்:

source: An introduction to [what is a Skills Inventory?](https://managementisajourney.com/management-toolbox-better-decision-making-with-a-skills-inventory) from Robert Tanner.
ta: ராபர்ட் டேனரிடமிருந்து [ஒரு திறன் சரக்கு என்றால் என்ன?] (Https://managementisajourney.com/management-toolbox-better-decision-gision-gision-ginaging--a-skills-inventory) ஒரு அறிமுகம்.

source: An article about open source skills: [5 Open Source Skills to Up Your Game and Your Resume](https://sourceforge.net/blog/5-open-source-skills-game-resume/)
ta: திறந்த மூல திறன்களைப் பற்றிய ஒரு கட்டுரை: [5 உங்கள் விளையாட்டு மற்றும் உங்கள் விண்ணப்பத்தை மேம்படுத்துவதற்கான திறந்த மூல திறன்கள்] (https://sourceforge.net/blog/5-open-source-skills-came-resume/)

source: This activity can include technical resources and skills such as:
ta: இந்த செயல்பாட்டில் தொழில்நுட்ப வளங்கள் மற்றும் திறன்கள் ஆகியவை அடங்கும்:

source: **Popular languages** (such as Java, PHP, Perl, Python).
ta: ** பிரபலமான மொழிகள் ** (சாவா, பி.எச்.பி, பெர்ல், பைதான் போன்றவை).

source: **Open source frameworks** (Spring, AngularJS, Symfony) and testing tools.
ta: ** திறந்த மூல கட்டமைப்புகள் ** (வசந்தம், கோணல், சிம்ஃபோனி) மற்றும் சோதனை கருவிகள்.

source: Agile, DevOps and open source **development methods and best practices**.
ta: சுறுசுறுப்பான, டெவொப்ச் மற்றும் திறந்த மூல ** மேம்பாட்டு முறைகள் மற்றும் சிறந்த நடைமுறைகள் **.

source: Proposed next activities
ta: முன்மொழியப்பட்ட அடுத்த நடவடிக்கைகள்

source: [GGI-A-28 - Human Resources perspective](https://ospo-alliance.org/ggi/activities/hr_perspective) Once open source resources have been identified internally to help with open source awareness, make the Human Resources department value them as well, for both existing and future employees.
ta: . அதேபோல், தற்போதுள்ள மற்றும் எதிர்கால ஊழியர்களுக்கும்.
