Repository: 247i/TACETr
Catalog: உரை/தானி/ospo-zone-ggi-54_activity_31-*.po
Languages: ta

source: Publicly assert use of open source
ta: திறந்த மூலத்தைப் பயன்படுத்துவதை பகிரங்கமாக உறுதிப்படுத்தவும்

source: Activity ID: [GGI-A-31](https://gitlab.ow2.org/ggi/ggi/-/blob/main/handbook/content/54_activity_31.md).
ta: செயல்பாட்டு ஐடி: [GGI-A-31] (https://gitlab.ow2.org/ggi/ggi/-/blob/main/handbook/content/54_activity_31.md).

source: Description
ta: விவரம்

source: This Activity is about acknowledging the use of OSS in an information system, in applications and in new products.
ta: இந்த செயல்பாடு ஒரு செய்தி அமைப்பு, பயன்பாடுகள் மற்றும் புதிய தயாரிப்புகளில் OSS ஐப் பயன்படுத்துவதை ஒப்புக்கொள்வது பற்றியது.

source: Providing success stories.
ta: வெற்றிக் கதைகளை வழங்குதல்.

source: Presenting at events.
ta: நிகழ்வுகளில் வழங்குதல்.

source: Funding participation to events.
ta: நிகழ்வுகளுக்கு பங்கேற்பு நிதியளித்தல்.

source: Opportunity Assessment
ta: வாய்ப்பு மதிப்பீடு

source: It is now generally accepted that most information systems run on OSS, and that new applications are for the most part made by reusing OSS.
ta: பெரும்பாலான செய்தி அமைப்புகள் OSS இல் இயங்குகின்றன என்பதும், புதிய பயன்பாடுகள் OSS ஐ மீண்டும் பயன்படுத்துவதன் மூலம் செய்யப்படும் என்பது இப்போது பொதுவாக ஏற்றுக்கொள்ளப்பட்டுள்ளது.

source: The main benefit of this activity is to create a level playing field between OSS and proprietary software, to make sure OSS is paid equal attention to and managed just as professionally as proprietary software.
ta: இந்தச் செயல்பாட்டின் முக்கிய நன்மை என்னவென்றால், OSS மற்றும் தனியுரிம மென்பொருளுக்கு இடையில் ஒரு நிலை விளையாட்டுத் துறையை உருவாக்குவது, OSS க்கு சமமான கவனம் செலுத்தப்படுவதையும், தனியுரிம மென்பொருளைப் போலவே தொழில் ரீதியாக நிர்வகிப்பதையும் உறுதிசெய்வது.

source: A side benefit is that it greatly helps raise the profile of the OSS ecosystem and, since OSS users are identified as "innovators" it also enhances the attractiveness of the organisation.
ta: ஒரு பக்க நன்மை என்னவென்றால், இது OSS சுற்றுச்சூழல் அமைப்பின் சுயவிவரத்தை உயர்த்த பெரிதும் உதவுகிறது, மேலும் OSS பயனர்கள் "கண்டுபிடிப்பாளர்கள்" என அடையாளம் காணப்படுவதால் இது நிறுவனத்தின் கவர்ச்சியையும் மேம்படுத்துகிறது.

source: Progress Assessment
ta: முன்னேற்ற மதிப்பீடு

source: The following **verification points** demonstrate progress in this activity:
ta: பின்வரும் ** சரிபார்ப்பு புள்ளிகள் ** இந்த செயல்பாட்டின் முன்னேற்றத்தை நிரூபிக்கிறது:

source: Commercial open source vendors are granted authorization to use the organisation's name as customer reference.
ta: வணிக திறந்த மூல விற்பனையாளர்களுக்கு நிறுவனத்தின் பெயரை வாடிக்கையாளர் குறிப்பாகப் பயன்படுத்த ஏற்பு வழங்கப்படுகிறது.

source: Contributors are allowed to do so and express themselves under the organisation's name.
ta: பங்களிப்பாளர்கள் அவ்வாறு செய்ய அனுமதிக்கப்படுகிறார்கள், மேலும் அமைப்பின் பெயரில் தங்களை வெளிப்படுத்துகிறார்கள்.

source: Use of OSS is openly mentioned in the IT department annual report.
ta: OSS இன் பயன்பாடு செய்தி தொழில்நுட்பத் துறை ஆண்டு அறிக்கையில் வெளிப்படையாகக் குறிப்பிடப்பட்டுள்ளது.

source: There is no obstacle to the organisation explaining their use of OSS in the media (interviews, OSS and industry events, etc.).
ta: ஊடகங்களில் OSS ஐப் பயன்படுத்துவதை விளக்கும் அமைப்புக்கு எந்த தடையும் இல்லை (நேர்காணல்கள், OSS மற்றும் தொழில் நிகழ்வுகள் போன்றவை).

source: Recommendations
ta: பரிந்துரைகள்

source: The objective of this activity is not for the organisation to become an OSS activism body, but to make sure there is no obstacle to the public recognising its use of OSS.
ta: இந்தச் செயல்பாட்டின் நோக்கம் அமைப்பு OSS ஆக்டிவிசம் அமைப்பாக மாறுவது அல்ல, ஆனால் OSS இன் பயன்பாட்டை அங்கீகரிப்பதில் பொதுமக்களுக்கு எந்த தடையும் இல்லை என்பதை உறுதிப்படுத்த வேண்டும்.

source: Resources
ta: வளங்கள்

source: Example of [CERN](https://superuser.openstack.org/articles/cern-openstack-update/) publicly asserting their use of OpenStack
ta: [CERN] இன் எடுத்துக்காட்டு (https://superuser.openstack.org/articles/cern-openstack-b-state/) ஓபன்ச்டேக்கைப் பயன்படுத்துவதை பகிரங்கமாக வலியுறுத்துகிறது
