Repository: 247i/TACETr
Catalog: உரை/தானி/ospo-zone-ggi-55_activity_34-*.po
Languages: ta

source: C-Level awareness
ta: சி-நிலை விழிப்புணர்வு

source: Activity ID: [GGI-A-34](https://gitlab.ow2.org/ggi/ggi/-/blob/main/handbook/content/55_activity_34.md).
ta: செயல்பாட்டு ஐடி: [GGI-A-34] (https://gitlab.ow2.org/ggi/ggi/-/blob/main/handbook/content/55_activity_34.md).

source: Description
ta: விவரம்

source: The open source initiative of the organisation will yield its strategic benefits only if it is enforced at its highest levels by integrating the open source DNA into the company's strategy and internal working. Such commitment cannot happen if higher-level executives and top management are not themselves a part of it. The training and open source mindset must also be extended to those who shape the policies, decisions and overall strategy, both inside and outside the company.
ta: நிறுவனத்தின் திறந்த மூல முன்முயற்சி திறந்த மூல டி.என்.ஏவை நிறுவனத்தின் மூலோபாயம் மற்றும் உள் வேலை ஆகியவற்றில் ஒருங்கிணைப்பதன் மூலம் அதன் மிக உயர்ந்த மட்டங்களில் செயல்படுத்தப்பட்டால் மட்டுமே அதன் மூலோபாய நன்மைகளை வழங்கும். உயர் மட்ட நிர்வாகிகள் மற்றும் உயர் நிர்வாகம் தங்களை ஒரு பகுதியாக இல்லாவிட்டால் இத்தகைய அர்ப்பணிப்பு நடக்காது. நிறுவனத்தின் உள்ளேயும் வெளியேயும் கொள்கைகள், முடிவுகள் மற்றும் ஒட்டுமொத்த மூலோபாயத்தை வடிவமைப்பவர்களுக்கும் பயிற்சி மற்றும் திறந்த மூல மனநிலையும் நீட்டிக்கப்பட வேண்டும்.

source: This commitment ensures that practical improvements, mindset changes and new initiatives are met with consistent, benevolent and sustainable support from the hierarchy, bringing in more fervent participation from workers. It shapes how external actors see the organisation, bringing in reputational and ecosystem benefits. It is also a means to establish the initiative and its benefits in the mid and long term.
ta: நடைமுறை மேம்பாடுகள், மனநிலை மாற்றங்கள் மற்றும் புதிய முயற்சிகள் வரிசைக்கு நிலையான, நல்ல மற்றும் நிலையான ஆதரவுடன் சந்திக்கப்படுவதை இந்த அர்ப்பணிப்பு உறுதி செய்கிறது, இது தொழிலாளர்களிடமிருந்து அதிக பங்கேற்பைக் கொண்டுவருகிறது. வெளிப்புற நடிகர்கள் அமைப்பை எவ்வாறு பார்க்கிறார்கள் என்பதை இது வடிவமைக்கிறது, புகழ்பெற்ற மற்றும் சுற்றுச்சூழல் அமைப்பு நன்மைகளைக் கொண்டுவருகிறது. இது நடுப்பகுதியிலும் நீண்ட காலத்திலும் முன்முயற்சி மற்றும் அதன் நன்மைகளை நிறுவுவதற்கான ஒரு வழியாகும்.

source: Opportunity Assessment
ta: வாய்ப்பு மதிப்பீடு

source: This activity becomes essential if/when:
ta: இந்த செயல்பாடு எப்போது/எப்போது:

source: The organisation has set global goals relevant to open source management, but struggles to achieve them. It is unlikely that the initiative can achieve anything without good knowledge and a clear commitment from higher-level executives.
ta: இந்த அமைப்பு உலகளாவிய இலக்குகளை திறந்த மூல நிர்வாகத்திற்கு பொருத்தமானதாக நிர்ணயித்துள்ளது, ஆனால் அவற்றை அடைய போராடுகிறது. நல்ல அறிவு இல்லாமல் இந்த முன்முயற்சி எதையும் அடைய முடியும் என்பது சாத்தியமில்லை, உயர் மட்ட நிர்வாகிகளிடமிருந்து தெளிவான அர்ப்பணிப்பு.

source: The initiative has already started and is making progress, but the higher levels of the hierarchy do not follow it up properly.
ta: முன்முயற்சி ஏற்கனவே தொடங்கி முன்னேறி வருகிறது, ஆனால் படிநிலையின் உயர் மட்டங்கள் அதை சரியாகப் பின்பற்றுவதில்லை.

source: Hopefully, it should become evident that anything but ad hoc usage of open source requires a consistent and well-thought approach, given the range of teams and cultural change it can bring.
ta: திறந்த மூலத்தின் தற்காலிக பயன்பாட்டைத் தவிர வேறு எதையும் ஒரு நிலையான மற்றும் நன்கு சிந்திக்கக்கூடிய அணுகுமுறை தேவைப்படுகிறது என்பது தெளிவாகத் தெரியும், இது அணிகள் மற்றும் கலாச்சார மாற்றங்களின் வரம்பைக் கொண்டு வர முடியும்.

source: Progress Assessment
ta: முன்னேற்ற மதிப்பீடு

source: The following **verification points** demonstrate progress in this Activity:
ta: பின்வரும் ** சரிபார்ப்பு புள்ளிகள் ** இந்த செயல்பாட்டின் முன்னேற்றத்தை நிரூபிக்கிறது:

source: There is a mandated governance office/officer empowered to set a uniform open source strategy across the company and ensure that the scope is clear.
ta: நிறுவனம் முழுவதும் ஒரு சீரான திறந்த மூல மூலோபாயத்தை நிர்ணயிக்கவும், நோக்கம் தெளிவாக இருப்பதை உறுதிசெய்யவும் ஒரு கட்டாய நிர்வாக அலுவலகம்/அதிகாரி அதிகாரம் பெற்றுள்ளார்.

source: There is a clear, binding commitment from the hierarchy to the OSS strategy.
ta: படிநிலையிலிருந்து OSS மூலோபாயத்திற்கு ஒரு தெளிவான, பிணைப்பு அர்ப்பணிப்பு உள்ளது.

source: There is transparent communication by the hierarchy about its commitment to the program.
ta: திட்டத்திற்கான அதன் அர்ப்பணிப்பு குறித்து படிநிலையால் வெளிப்படையான தொடர்பு உள்ளது.

source: The hierarchy is available to discuss open source software. It can be solicited and challenged on its promises.
ta: திறந்த மூல மென்பொருளைப் பற்றி விவாதிக்க படிநிலை கிடைக்கிறது. அதன் வாக்குறுதிகள் குறித்து அதை கோரலாம் மற்றும் அறைகூவல் செய்யலாம்.

source: There is an appropriate budget and funding for the initiative.
ta: முன்முயற்சிக்கு பொருத்தமான பட்செட் மற்றும் பொருள் உள்ளது.

source: Recommendations
ta: பரிந்துரைகள்

source: Examples of actions associated with this activity include:
ta: இந்த செயல்பாட்டுடன் தொடர்புடைய செயல்களின் எடுத்துக்காட்டுகள் பின்வருமாறு:

source: Conduct training to demystify OSS to C-level management.
ta: சி-லெவல் நிர்வாகத்திற்கு OSS ஐ மதிப்பிடுவதற்கு பயிற்சி நடத்துங்கள்.

source: Obtain explicit, practical endorsement for OSS usage and strategy.
ta: OSS பயன்பாடு மற்றும் மூலோபாயத்திற்கான வெளிப்படையான, நடைமுறை ஒப்புதலைப் பெறுங்கள்.

source: Explicitly mention and endorse the OSS program in internal communications.
ta: உள் தகவல்தொடர்புகளில் OSS திட்டத்தை வெளிப்படையாகக் குறிப்பிடவும் ஒப்புதல் அளிக்கவும்.

source: Explicitly mention and endorse the OSS program in public communications.
ta: பொது தகவல்தொடர்புகளில் OSS திட்டத்தை வெளிப்படையாகக் குறிப்பிடவும் ஒப்புதல் அளிக்கவும்.

source: Open source is a *strategic enabler* that embarks *enterprise culture*. What does this mean?
ta: திறந்த மூலமானது *நிறுவன கலாச்சாரத்தை *தொடங்கும் ஒரு *மூலோபாய செயல்படுத்துபவர் *. இதன் பொருள் என்ன?

source: Open source can be leveraged as a mechanism to disrupt suppliers and reduce software acquisition costs.
ta: சப்ளையர்களை சீர்குலைப்பதற்கும் மென்பொருள் கையகப்படுத்தும் செலவுகளைக் குறைப்பதற்கும் ஒரு பொறிமுறையாக திறந்த மூலத்தை மேம்படுத்தலாம்.

source: Should open source come under the purview of *Software Asset Managers* or *purchasing departments*?
ta: *மென்பொருள் சொத்து மேலாளர்கள் *அல்லது *வாங்கும் துறைகள் *இன் கீழ் திறந்த மூலமும் வர வேண்டுமா?

source: Open source licences enshrine the freedoms that deliver the benefits of open source, but they also carry *obligations*. If not met appropriately, responsibilities can create legal, commercial and image risks to an organisation.
ta: திறந்த மூல உரிமங்கள் திறந்த மூலத்தின் நன்மைகளை வழங்கும் சுதந்திரங்களை உள்ளடக்குகின்றன, ஆனால் அவை *கடமைகளையும் *கொண்டு செல்கின்றன. சரியான முறையில் நிறைவு செய்யப்படாவிட்டால், பொறுப்புகள் ஒரு நிறுவனத்திற்கு சட்ட, வணிக மற்றும் பட அபாயங்களை உருவாக்க முடியும்.

source: Will licence conditions grant visibility into resources that should remain confidential?
ta: ரகசியமாக இருக்க வேண்டிய வளங்களில் உரிம நிபந்தனைகள் தெரிவுநிலையை வழங்குமா?

source: Will it impact my organisation's patent portfolio?
ta: இது எனது நிறுவனத்தின் காப்புரிமை இலாகாவை பாதிக்குமா?

source: How should project teams be trained and supported on this subject?
ta: இந்த விசயத்தில் திட்ட அணிகளுக்கு எவ்வாறு பயிற்சி அளிக்கப்பட வேண்டும் மற்றும் ஆதரிக்கப்பட வேண்டும்?

source: Contributing back to external open source projects is where the biggest value of open source lies.
ta: வெளிப்புற திறந்த மூல திட்டங்களுக்கு மீண்டும் பங்களிப்பது என்பது திறந்த மூலத்தின் மிகப்பெரிய மதிப்பு உள்ளது.

source: How should my company encourage (and track) this?
ta: இதை எனது நிறுவனம் எவ்வாறு ஊக்குவிக்க வேண்டும் (கண்காணிக்க வேண்டும்)?

source: How should developers use GitHub, GitLab, Slack, Discord, Telegram, or any of the other tools open source projects habitually use?
ta: உருவாக்குபவர்கள் அறிவிலிமையம், அறிவிலிஆய்வு, ச்லாக், டிச்கார்ட், டெலிகிராம் அல்லது வேறு ஏதேனும் கருவிகள் திறந்த மூல திட்டங்கள் பழக்கமாகப் பயன்படுத்த வேண்டும்?

source: Can open source impact the company's HR policies?
ta: திறந்த மூலமானது நிறுவனத்தின் மனிதவள கொள்கைகளை பாதிக்க முடியுமா?

source: Of course, it's not all about contributing back, what about my own open source projects?
ta: நிச்சயமாக, இது பங்களிப்பதைப் பற்றி அல்ல, எனது சொந்த திறந்த மூல திட்டங்களைப் பற்றி என்ன?

source: Am I ready to do *open* innovation?
ta: * திறந்த * புதுமை செய்ய நான் தயாரா?

source: How will my projects manage *incoming* contributions?
ta: எனது திட்டங்கள் * உள்வரும் * பங்களிப்புகளை எவ்வாறு நிர்வகிக்கும்?

source: Should I spend the effort to nurture a community for a given project?
ta: கொடுக்கப்பட்ட திட்டத்திற்காக ஒரு சமூகத்தை வளர்ப்பதற்கான முயற்சியை நான் செலவிட வேண்டுமா?

source: How should I lead the community, what role should community members have?
ta: சமூகத்தை நான் எவ்வாறு வழிநடத்த வேண்டும், சமூக உறுப்பினர்களுக்கு என்ன பங்கு இருக்க வேண்டும்?

source: Am I ready to cede roadmap decisions to a community?
ta: சாலை வரைபட முடிவுகளை ஒரு சமூகத்திற்கு அனுப்ப நான் தயாரா?

source: Can open source be a valuable tool to reduce silo-isation between company teams?
ta: நிறுவன அணிகளுக்கு இடையில் சிலோ-மயமாக்கத்தைக் குறைக்க திறந்த மூலமாக ஒரு மதிப்புமிக்க கருவியாக இருக்க முடியுமா?

source: Do I need to handle open source transfer from one company entity to another?
ta: ஒரு நிறுவன நிறுவனத்திலிருந்து மற்றொரு நிறுவனத்திற்கு திறந்த மூல பரிமாற்றத்தை நான் கையாள வேண்டுமா?

source: Proposed next activities
ta: முன்மொழியப்பட்ட அடுத்த நடவடிக்கைகள்

source: [GGI-A-31 - Publicly assert use of open source](https://ospo-alliance.org/ggi/activities/publicly_assert_use_of_open_source) C-level executives are prominent representatives of an organisation. Make them communicate about the organisation's involvement in open source.
ta: . திறந்த மூலத்தில் நிறுவனத்தின் ஈடுபாட்டைப் பற்றி அவர்களைத் தொடர்பு கொள்ளுங்கள்.
