Repository: 247i/TACETr
Catalog: உரை/தானி/ospo-zone-ggi-53_activity_25-*.po
Languages: ta

source: Promote open source development best practices
ta: திறந்த மூல மேம்பாட்டு சிறந்த நடைமுறைகளை ஊக்குவிக்கவும்

source: Activity ID: [GGI-A-25](https://gitlab.ow2.org/ggi/ggi/-/blob/main/handbook/content/53_activity_25.md).
ta: செயல்பாட்டு ஐடி: [GGI-A-25] (https://gitlab.ow2.org/ggi/ggi/-/blob/main/handbook/content/53_activity_25.md).

source: Description
ta: விவரம்

source: This activity is about defining, actively promoting and implementing open source best practices within the development teams.
ta: இந்த செயல்பாடு மேம்பாட்டுக் குழுக்களுக்குள் திறந்த மூல சிறந்த நடைமுறைகளை வரையறுப்பது, தீவிரமாக ஊக்குவித்தல் மற்றும் செயல்படுத்துவது பற்றியது.

source: As a starting point the following topics might be considered for attention:
ta: ஒரு தொடக்க புள்ளியாக பின்வரும் தலைப்புகள் கவனத்திற்கு கருதப்படலாம்:

source: User and developer documentation.
ta: பயனர் மற்றும் உருவாக்குபவர் ஆவணங்கள்.

source: Proper organisation of the project on a publicly accessible repository.
ta: பொதுவில் அணுகக்கூடிய களஞ்சியத்தில் திட்டத்தின் சரியான அமைப்பு.

source: Promote and implement controlled reuse.
ta: கட்டுப்படுத்தப்பட்ட மறுபயன்பாட்டை ஊக்குவிக்கவும் செயல்படுத்தவும்.

source: Providing a complete and up-to-date product documentation.
ta: முழுமையான மற்றும் புதுப்பித்த தயாரிப்பு ஆவணங்களை வழங்குதல்.

source: Configuration Management: git workflows, collaborative patterns.
ta: உள்ளமைவு மேலாண்மை: அறிவிலி பணிப்பாய்வு, கூட்டு வடிவங்கள்.

source: Release management: release early & release often, stable vs development versions, etc.
ta: வெளியீட்டு மேலாண்மை: ஆரம்பத்தில் வெளியீடு மற்றும் வெளியீடு அடிக்கடி, நிலையான Vs மேம்பாட்டு பதிப்புகள் போன்றவை.

source: OSS projects have a special, [bazaar-like](http://www.catb.org/~esr/writings/cathedral-bazaar/) modus operandi. In order to allow and foster this collaboration and mindset, some practices are recommended that facilitate collaborative and decentralised development and contributions from third-party developers…
ta: OSS திட்டங்களுக்கு ஒரு சிறப்பு, [பசார் போன்ற] (http://www.catb.org/~esr/writings/cathedral-bazaar/) மோடச் ஓபராண்டி உள்ளது. இந்த ஒத்துழைப்பு மற்றும் மனநிலையை அனுமதிக்கவும் வளர்க்கவும், சில நடைமுறைகள் பரிந்துரைக்கப்படுகின்றன, அவை ஒத்துழைப்பு மற்றும் பரவலாக்கப்பட்ட வளர்ச்சி மற்றும் மூன்றாம் தரப்பு டெவலப்பர்களிடமிருந்து பங்களிப்புகளை எளிதாக்குகின்றன…

source: Community documents
ta: சமூக ஆவணங்கள்

source: Make sure that all projects within the company propose the following documents:
ta: நிறுவனத்திற்குள் உள்ள அனைத்து திட்டங்களும் பின்வரும் ஆவணங்களை முன்மொழிகின்றன என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்:

source: README -- quick description of the project, how to interact, links to resources.
ta: README - திட்டத்தின் விரைவான விளக்கம், எவ்வாறு தொடர்புகொள்வது, வளங்களுக்கான இணைப்புகள்.

source: Contributing -- introduction for people willing to contribute.
ta: பங்களிப்பு - பங்களிக்க விரும்பும் மக்களுக்கு அறிமுகம்.

source: Code Of Conduct -- What is acceptable -- or not -- as behaviour within the community.
ta: நடத்தை நெறிமுறை - ஏற்றுக்கொள்ளத்தக்கது - அல்லது இல்லை - சமூகத்திற்குள் நடத்தையாக.

source: LICENSE -- the default licence of the repository.
ta: உரிமம் - களஞ்சியத்தின் இயல்புநிலை உரிமம்.

source: REUSE best practices
ta: சிறந்த நடைமுறைகளை மீண்டும் பயன்படுத்துங்கள்

source: [REUSE](https://reuse.software) is an initiative from the [Free Software Foundation Europe](https://fsfe.org/) to improve reuse of software and streamline OSS and licence compliance.
ta: [REUSE](https://reuse.software) is an initiative இருந்து the [Free Software Foundation Europe](https://fsfe.org/) பெறுநர் improve reuse of software and streamline OSS and licence compliance.

source: Opportunity Assessment
ta: வாய்ப்பு மதிப்பீடு

source: Although it heavily depends on the OSS common-knowledge among the team, training people and creating processes that enforce these practices is always beneficial. It is even more important when:
ta: இது குழுவினரிடையே OSS பொதுவான அறிவைப் பொறுத்தது, மக்களுக்கு பயிற்சி அளிப்பது மற்றும் இந்த நடைமுறைகளைச் செயல்படுத்தும் செயல்முறைகளை உருவாக்குவது எப்போதும் நன்மை பயக்கும். இது இன்னும் முக்கியமானது:

source: potential users and contributors are not known,
ta: சாத்தியமான பயனர்கள் மற்றும் பங்களிப்பாளர்கள் அறியப்படவில்லை,

source: developers are not used to open source development.
ta: மூல வளர்ச்சியைத் திறக்க உருவாக்குபவர்கள் பயன்படுத்தப்படவில்லை.

source: Progress Assessment
ta: முன்னேற்ற மதிப்பீடு

source: The following **verification points** demonstrate progress in this Activity:
ta: பின்வரும் ** சரிபார்ப்பு புள்ளிகள் ** இந்த செயல்பாட்டின் முன்னேற்றத்தை நிரூபிக்கிறது:

source: Project sets a list of open source best practices to comply with.
ta: திட்டத்திற்கு இணங்க திறந்த மூல சிறந்த நடைமுறைகளின் பட்டியலை திட்டம் அமைக்கிறது.

source: Project monitors its alignment with best practices.
ta: திட்டம் சிறந்த நடைமுறைகளுடன் அதன் சீரமைப்பைக் கண்காணிக்கிறது.

source: Development team has built awareness about complying with OSS best practices.
ta: மேம்பாட்டுக் குழு OSS சிறந்த நடைமுறைகளுக்கு இணங்குவது குறித்து விழிப்புணர்வை ஏற்படுத்தியுள்ளது.

source: New best practices are regularly evaluated, and an effort is made to implement them.
ta: புதிய சிறந்த நடைமுறைகள் தொடர்ந்து மதிப்பீடு செய்யப்படுகின்றன, மேலும் அவற்றை செயல்படுத்த முயற்சி செய்யப்படுகிறது.

source: Tools
ta: கருவிகள்

source: The [REUSE helper tool](https://github.com/fsfe/reuse-tool) assists with making a repository conformant with the [REUSE](https://reuse.software) best practices. It can be included in many development processes to confirm the current status.
ta: [மறுபயன்பாட்டு எல்பர் கருவி] (https://github.com/fsfe/reuse-tool) [மறுபயன்பாடு] (https://reuse.software) சிறந்த நடைமுறைகளுடன் ஒரு களஞ்சியத்தை இணங்க உதவுகிறது. தற்போதைய நிலையை உறுதிப்படுத்த பல மேம்பாட்டு செயல்முறைகளில் இது சேர்க்கப்படலாம்.

source: [ScanCode](https://scancode-toolkit.readthedocs.io) has the ability to list all community and legal documents in the repository: see [feature description](https://scancode-toolkit.readthedocs.io/en/latest/cli-reference/scan-options-pre.html#classify).
ta: . சமீபத்திய/சி.எல்.ஐ-குறிப்பு/ச்கேன்-விருப்பங்கள்-PRE.HTML#வகைப்படுத்தவும்).

source: GitHub has a nice feature to [check for missing community documents](https://docs.github.com/articles/viewing-your-community-profile). It can be found in the Repository page > "Insights" > "Community".
ta: [காணாமல் போன சமூக ஆவணங்களை சரிபார்க்க] கிதுபுக்கு ஒரு நல்ல நற்பொருத்தம் உள்ளது (https://docs.github.com/articles/viewing-your-community-profile). இதை களஞ்சியம் பக்கம்> "நுண்ணறிவு"> "சமூகம்" இல் காணலாம்.

source: Recommendations
ta: பரிந்துரைகள்

source: The list of best practices depends on the context and domain of the program and should be re-evaluated regularly in a continuous improvement manner. Practices should be monitored and regularly assessed to track down progress.
ta: சிறந்த நடைமுறைகளின் பட்டியல் நிரலின் சூழல் மற்றும் களத்தைப் பொறுத்தது மற்றும் தொடர்ச்சியான முன்னேற்ற முறையில் தவறாமல் மறு மதிப்பீடு செய்யப்பட வேண்டும். முன்னேற்றத்தைக் கண்டறிய நடைமுறைகள் கண்காணிக்கப்பட்டு தொடர்ந்து மதிப்பிடப்பட வேண்டும்.

source: Train people about OSS reuse (as consumers) and ecosystems (as contributors).
ta: OSS மறுபயன்பாடு (நுகர்வோராக) மற்றும் சுற்றுச்சூழல் அமைப்புகள் (பங்களிப்பாளர்களாக) பற்றி மக்களுக்கு பயிற்சி அளிக்கவும்.

source: Implement REUSE.software as in activity #14.
ta: செயல்பாடு #14 இல் உள்ளதைப் போல மறுபயன்பாடு.சாஃப்ட்வேரை செயல்படுத்தவும்.

source: Set up a process to manage legal risks associated with reuse and contributions.
ta: மறுபயன்பாடு மற்றும் பங்களிப்புகளுடன் தொடர்புடைய சட்ட அபாயங்களை நிர்வகிக்க ஒரு செயல்முறையை அமைக்கவும்.

source: Explicitly encourage people to contribute to external projects.
ta: வெளிப்புற திட்டங்களுக்கு பங்களிக்க மக்களை வெளிப்படையாக ஊக்குவிக்கவும்.

source: Provide a template or official guidelines for project structure.
ta: திட்ட கட்டமைப்பிற்கான ஒரு வார்ப்புரு அல்லது அதிகாரப்பூர்வ வழிகாட்டுதல்களை வழங்கவும்.

source: Set up automated checks to make sure that all projects comply with the guidelines.
ta: அனைத்து திட்டங்களும் வழிகாட்டுதல்களுக்கு இணங்குகின்றன என்பதை உறுதிப்படுத்த தானியங்கி காசோலைகளை அமைக்கவும்.

source: Resources
ta: வளங்கள்

source: [OW2's list of open source best practices](https://www.ow2.org/view/MRL/Full_List_of_Best_Practices) from the Market Readiness Levels assessment methodology.
ta: [OW2's பட்டியல் of திற மூலம் best practices](https://www.ow2.org/view/MRL/Full_List_of_Best_Practices) இருந்து the Market Readiness Levels assessment methodology.

source: [REUSE's official website](https://reuse.software) with specification, tutorial, and FAQ.
ta: [மறுபயன்பாட்டின் அதிகாரப்பூர்வ வலைத்தளம்] (https://reuse.software) விவரக்குறிப்பு, பயிற்சி மற்றும் கேள்விகளுடன்.

source: [GitHub's community guidelines](https://opensource.guide/).
ta: [கிதுபின் சமூக வழிகாட்டுதல்கள்] (https://opensource.guide/).

source: An example of [configuration management best practices using GitHub](https://dev.to/datreeio/top-10-github-best-practices-3kl2).
ta: [Kithub ஐப் பயன்படுத்தி உள்ளமைவு மேலாண்மை சிறந்த நடைமுறைகள்] (https://dev.to/datreeio/top-10-github-best-practices-3kl2) இன் எடுத்துக்காட்டு.

source: Proposed next activities
ta: முன்மொழியப்பட்ட அடுத்த நடவடிக்கைகள்

source: [GGI-A-42 - Manage open source skills and resources](https://ospo-alliance.org/ggi/activities/manage_open_source_skills_and_resources) You can add the list of open source development best practices identified to the general training material.
ta: [GGI-A-42 - Manage திற மூலம் skills and resources](https://ospo-alliance.org/ggi/activities/manage_open_source_skills_and_resources) You can கூட்டு the பட்டியல் of திற மூலம் வளர்ச்சி best practices identified பெறுநர் the பொது training material.

source: [GGI-A-44 - Run code reviews](https://ospo-alliance.org/ggi/activities/run_code_reviews/) Code review is an essential element of development best practices.
ta: [GGI-A-44 - ஓடு குறியீடு reviews](https://ospo-alliance.org/ggi/activities/run_code_reviews/) குறியீடு சீராய்வு is an essential தனிமம் of வளர்ச்சி best practices.
