Repository: 247i/TACETr
Catalog: உரை/தானி/ospo-zone-ggi-53_activity_27-*.po
Languages: ta

source: Belong to the open source community
ta: திறந்த மூல சமூகத்தைச் சேர்ந்தவர்

source: Activity ID: [GGI-A-27](https://gitlab.ow2.org/ggi/ggi/-/blob/main/handbook/content/53_activity_27.md).
ta: செயல்பாட்டு ஐடி: [GGI-A-27] (https://gitlab.ow2.org/ggi/ggi/-/blob/main/handbook/content/53_activity_27.md).

source: Description
ta: விவரம்

source: This activity is about developing among developers a feeling of belonging to the greater open source community. As with every community, people and entities have to participate and contribute back to the whole. It reinforces the links between practitioners and brings sustainability and activity to the ecosystem. On a more technical side, it allows choosing the priorities and roadmap of projects, improves the level of general knowledge and technical awareness.
ta: இந்த செயல்பாடு டெவலப்பர்களிடையே அதிக திறந்த மூல சமூகத்தைச் சேர்ந்த உணர்வை வளர்ப்பது பற்றியது. ஒவ்வொரு சமூகத்தையும் போலவே, மக்களும் நிறுவனங்களும் ஒட்டுமொத்தமாக பங்கேற்க வேண்டும். இது பயிற்சியாளர்களுக்கிடையேயான தொடர்புகளை வலுப்படுத்துகிறது மற்றும் சுற்றுச்சூழல் அமைப்புக்கு நிலைத்தன்மையையும் செயல்பாட்டையும் கொண்டு வருகிறது. மிகவும் தொழில்நுட்ப பக்கத்தில், இது திட்டங்களின் முன்னுரிமைகள் மற்றும் பாதை வரைபடத்தைத் தேர்வுசெய்ய அனுமதிக்கிறது, பொது அறிவு மற்றும் தொழில்நுட்ப விழிப்புணர்வின் அளவை மேம்படுத்துகிறது.

source: This activity covers the following:
ta: இந்த செயல்பாடு பின்வருவனவற்றை உள்ளடக்கியது:

source: **Identify events** worth attending. Connecting people, learning about new technologies and building a network are key factors to get the full benefits of open-source.
ta: ** நிகழ்வுகளை அடையாளம் காணவும் ** கலந்துகொள்வது மதிப்பு. மக்களை இணைப்பது, புதிய தொழில்நுட்பங்களைப் பற்றி அறிந்து கொள்வது மற்றும் பிணையத்தை உருவாக்குவது ஆகியவை திறந்த மூலத்தின் முழு நன்மைகளைப் பெற முக்கிய காரணிகளாகும்.

source: Consider **foundation memberships**. Open-source foundations and organisations are a key component of the open-source ecosystem. They provide technical and organisational resources to projects, and are a good neutral place for sponsors to discuss common issues and solutions, or work on standards.
ta: ** அறக்கட்டளை உறுப்பினர்களைக் கவனியுங்கள் **. திறந்த மூல அடித்தளங்கள் மற்றும் நிறுவனங்கள் திறந்த மூல சுற்றுச்சூழல் அமைப்பின் முக்கிய அங்கமாகும். அவை திட்டங்களுக்கு தொழில்நுட்ப மற்றும் நிறுவன வளங்களை வழங்குகின்றன, மேலும் ச்பான்சர்களுக்கு பொதுவான பிரச்சினைகள் மற்றும் தீர்வுகள் பற்றி விவாதிக்க அல்லது தரங்களில் பணியாற்றுவதற்கான ஒரு நல்ல நடுநிலை இடமாகும்.

source: Watch **working groups**. Working groups are neutral collaborative workspaces where experts interact on a specific domain like IoT, modelling or science. They are a very efficient and cost-effective mechanism to tackle common, albeit domain-specific concerns together.
ta: வாட்ச் ** பணிக்குழுக்கள் **. பணிக்குழுக்கள் நடுநிலை கூட்டு பணியிடங்களாகும், அங்கு வல்லுநர்கள் ஐஓடி, மாடலிங் அல்லது அறிவியல் போன்ற ஒரு குறிப்பிட்ட களத்தில் தொடர்பு கொள்கிறார்கள். டொமைன்-குறிப்பிட்ட கவலைகள் ஒன்றாக இருந்தாலும் பொதுவானதைச் சமாளிக்க அவை மிகவும் திறமையான மற்றும் செலவு குறைந்த வழிமுறையாகும்.

source: **Budget participation**. At the end of the journey, money is the enabler. Plan required expenses, allow people paid time for these activities, anticipate next moves, so the program doesn't have to stop after a few months short of funding.
ta: ** பட்செட் பங்கேற்பு **. பயணத்தின் முடிவில், பணம் செயல்படுத்துபவர். தேவையான செலவினங்களைத் திட்டமிடுங்கள், இந்த நடவடிக்கைகளுக்கு மக்கள் செலுத்தும் நேரத்தை அனுமதிக்கவும், அடுத்த நகர்வுகளை எதிர்பார்க்கவும், எனவே சில மாதங்களுக்குப் பிறகு நிரல் நிறுத்தப்பட வேண்டியதில்லை.

source: Opportunity Assessment
ta: வாய்ப்பு மதிப்பீடு

source: Open source works best when done in relation with the open source community at large. It facilitates bug fixing, solution sharing, etc.
ta: திறந்த மூல சமூகம் தொடர்பாக செய்யும்போது திறந்த மூலமானது சிறப்பாக செயல்படுகிறது. இது பிழை சரிசெய்தல், தீர்வு பகிர்வு போன்றவற்றை எளிதாக்குகிறது.

source: It is also a good way for companies to show their support to open-source values. Communicating about the company's involvement is important both for the company's reputation and for the open-source ecosystem.
ta: திறந்த மூல மதிப்புகளுக்கு நிறுவனங்கள் தங்கள் ஆதரவைக் காண்பிப்பதற்கும் இது ஒரு சிறந்த வழியாகும். நிறுவனத்தின் ஈடுபாட்டைப் பற்றி தொடர்புகொள்வது நிறுவனத்தின் நற்பெயருக்கும் திறந்த மூல சுற்றுச்சூழல் அமைப்பிற்கும் முக்கியமானது.

source: Progress Assessment
ta: முன்னேற்ற மதிப்பீடு

source: The following **verification points** demonstrate progress in this Activity:
ta: பின்வரும் ** சரிபார்ப்பு புள்ளிகள் ** இந்த செயல்பாட்டின் முன்னேற்றத்தை நிரூபிக்கிறது:

source: A list of events people could attend is drafted.
ta: மக்கள் கலந்து கொள்ளக்கூடிய நிகழ்வுகளின் பட்டியல் வரைவு செய்யப்படுகிறது.

source: There is a monitoring of public talks given by team members.
ta: குழு உறுப்பினர்கள் வழங்கிய பொது பேச்சுவார்த்தைகளின் கண்காணிப்பு உள்ளது.

source: People can submit event participation requests.
ta: நிகழ்வு பங்கேற்பு கோரிக்கைகளை மக்கள் சமர்ப்பிக்கலாம்.

source: People can submit projects for sponsorship.
ta: மக்கள் ச்பான்சர்சிப்பிற்கான திட்டங்களை சமர்ப்பிக்கலாம்.

source: Recommendations
ta: பரிந்துரைகள்

source: Survey people to get to know what events they like or would be the most beneficial for their work.
ta: அவர்கள் விரும்பும் நிகழ்வுகள் என்ன அல்லது அவர்களின் வேலைக்கு மிகவும் பயனுள்ளதாக இருக்கும் என்பதை அறிந்து கொள்ள மக்கள் கணக்கெடுப்பு.

source: Set up in-house communications (newsletter, resource centre, invitations…) so people know about the initiatives and can participate.
ta: உள்ளக தகவல்தொடர்புகளை அமைக்கவும் (செய்திமடல், வள நடுவண், அழைப்பிதழ்கள்…) எனவே மக்கள் முயற்சிகளைப் பற்றி அறிந்திருக்கிறார்கள், பங்கேற்கலாம்.

source: Make sure that these initiatives can benefit various types of people (developers, administrators, support…), not only C-level executives.
ta: இந்த முயற்சிகள் பல்வேறு வகையான நபர்களுக்கு (டெவலப்பர்கள், நிர்வாகிகள், ஆதரவு…), சி-நிலை நிர்வாகிகள் மட்டுமல்ல என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: Resources
ta: வளங்கள்

source: [What motivates a developer to contribute to open source software?](https://clearcode.cc/blog/why-developers-contribute-open-source-software/) An article by Michael Sweeney on clearcode.cc.
ta: [What motivates a உருவாக்குநர் பெறுநர் பங்களிப்பு பெறுநர் திற மூலம் software?](https://clearcode.cc/blog/why-developers-contribute-open-source-software/) An article by Michael Sweeney on clearcode.cc.

source: [Why companies contribute to open source](https://blogs.vmware.com/opensource/2020/12/01/why-companies-contribute-to-open-source/) An article by Velichka Atanasova from VMWare.
ta: [Why companies பங்களிப்பு பெறுநர் திற source](https://blogs.vmware.com/opensource/2020/12/01/why-companies-contribute-to-open-source/) An article by Velichka Atanasova இருந்து VMWare.

source: [Why your employees should be contributing to open source](https://www.cloudbees.com/blog/why-your-employees-should-be-contributing-to-open-source/) A good read by Robert Kowalski from CloudBees.
ta: . முகில் பீச்.

source: [Events: the life force of open source](https://www.redhat.com/en/blog/events-life-force-open-source) An article by Donna Benjamin from RedHat.
ta: [Events: the life force of திற source](https://www.redhat.com/en/blog/events-life-force-open-source) An article by Donna Benjamin இருந்து RedHat.

source: Proposed next activities
ta: முன்மொழியப்பட்ட அடுத்த நடவடிக்கைகள்

source: [GGI-A-28 - HR perspective](https://ospo-alliance.org/ggi/activities/human_resources_perspective) If the organisation belongs to the OSS community, it is easier to attract skilled people, based on the community you are involved in.
ta: . சம்பந்தப்பட்ட.

source: [GGI-A-31 - Publicly assert use of open source](https://ospo-alliance.org/ggi/activities/publicly_assert_use_of_open_source) Now that you have become a part of the OSS community, make it known! It is good for your reputation, and it is good for the project in terms of health and dissemination.
ta: . இது உங்கள் நற்பெயருக்கு நல்லது, மேலும் இது உடல்நலம் மற்றும் பரவல் அடிப்படையில் திட்டத்திற்கு நல்லது.
