Repository: 247i/TACETr
Catalog: உரை/தானி/pairdrop-pairdrop-spa-*.po
Languages: ta

# header.about_title
source: About PairDrop
ta: இணை டிராப் பற்றி

# header.language-selector_title
source: Set Language
ta: மொழியை அமைக்கவும்

# header.about_aria-label
source: Open About PairDrop
ta: இணை ட்ராப் பற்றி திறந்திருக்கும்

# header.theme-auto_title
source: Adapt theme to system automatically
ta: தானாகவே கருப்பொருள் கணினிக்கு மாற்றியமைக்கவும்

# header.theme-light_title
source: Always use light theme
ta: எப்போதும் ஒளி கருப்பொருளைப் பயன்படுத்துங்கள்

# header.theme-dark_title
source: Always use dark theme
ta: எப்போதும் இருண்ட கருப்பொருளைப் பயன்படுத்துங்கள்

# header.notification_title
source: Enable notifications
ta: அறிவிப்புகளை இயக்கவும்

# header.install_title
source: Install PairDrop
ta: இணை டிராப்பை நிறுவவும்

# header.pair-device_title
source: Pair your devices permanently
ta: உங்கள் சாதனங்களை நிரந்தரமாக இணைக்கவும்

# header.edit-paired-devices_title
source: Edit paired devices
ta: இணை சாதனங்களைத் திருத்தவும்

# header.join-public-room_title
source: Join public room temporarily
ta: தற்காலிகமாக பொது அறையில் சேரவும்

# header.cancel-share-mode
source: Cancel
ta: ரத்துசெய்

# header.edit-share-mode
source: Edit
ta: தொகு

# header.expand_title
source: Expand header button row
ta: தலைப்பு பொத்தான் வரிசையை விரிவாக்குங்கள்

# instructions.no-peers_data-drop-bg
source: Release to select recipient
ta: பெறுநரைத் தேர்ந்தெடுக்க வெளியீடு

# instructions.no-peers-title
source: Open PairDrop on other devices to send files
ta: கோப்புகளை அனுப்ப பிற சாதனங்களில் இணை டிராப்பைத் திறக்கவும்

# instructions.no-peers-subtitle
source: Pair devices or enter a public room to be discoverable on other networks
ta: சாதனங்களை இணை செய்யுங்கள் அல்லது பிற நெட்வொர்க்குகளில் கண்டறிய ஒரு பொது அறையை உள்ளிடவும்

# instructions.x-instructions_desktop
source: Click to send files or right click to send a message
ta: கோப்புகளை அனுப்ப சொடுக்கு செய்யவும் அல்லது செய்தியை அனுப்ப வலது சொடுக்கு செய்யவும்

# instructions.x-instructions_mobile
source: Tap to send files or long tap to send a message
ta: கோப்புகளை அனுப்ப தட்டவும் அல்லது செய்தியை அனுப்ப நீண்ட தட்டவும்

# instructions.x-instructions_data-drop-peer
source: Release to send to peer
ta: பியருக்கு அனுப்ப வெளியீடு

# instructions.x-instructions_data-drop-bg
source: Release to select recipient
ta: பெறுநரைத் தேர்ந்தெடுக்க வெளியீடு

# instructions.x-instructions-share-mode_desktop
source: Click to send {{descriptor}}
ta: {{descriptor}} ஐ அனுப்ப சொடுக்கு செய்க

# instructions.x-instructions-share-mode_mobile
source: Tap to send {{descriptor}}
ta: {{descriptor}} அனுப்ப தட்டவும்

# instructions.activate-share-mode-base
source: Open PairDrop on other devices to send
ta: அனுப்ப மற்ற சாதனங்களில் இணைக்கவும்

# instructions.activate-share-mode-and-other-file
source: and 1 other file
ta: மற்றும் 1 பிற கோப்பு

# instructions.activate-share-mode-and-other-files-plural
source: and {{count}} other files
ta: மற்றும் {{count}} பிற கோப்புகள்

# instructions.activate-share-mode-shared-text
source: shared text
ta: பகிரப்பட்ட உரை

# instructions.activate-share-mode-shared-file
source: shared file
ta: பகிரப்பட்ட கோப்பு

# instructions.activate-share-mode-shared-files-plural
source: {{count}} shared files
ta: {{count}} பகிரப்பட்ட கோப்புகள்

# instructions.webrtc-requirement
source: To use this PairDrop instance, WebRTC must be enabled!
ta: இந்த இணை டிராப் நிகழ்வைப் பயன்படுத்த, WEBRTC இயக்கப்பட்டிருக்க வேண்டும்!

# footer.known-as
source: You are known as:
ta: நீங்கள் அறியப்படுகிறீர்கள்:

# footer.display-name_data-placeholder
source: Loading…
ta: ஏற்றுகிறது…

# footer.display-name_title
source: Edit your device name permanently
ta: உங்கள் சாதனத்தின் பெயரை நிரந்தரமாக திருத்தவும்

# footer.discovery
source: You can be discovered:
ta: நீங்கள் கண்டுபிடிக்கலாம்:

# footer.on-this-network
source: on this network
ta: இந்த நெட்வொர்க்கில்

# footer.on-this-network_title
source: You can be discovered by everyone on this network.
ta: இந்த நெட்வொர்க்கில் உள்ள அனைவராலும் நீங்கள் கண்டுபிடிக்க முடியும்.

# footer.paired-devices
source: by paired devices
ta: இணை சாதனங்கள் மூலம்

# footer.paired-devices_title
source: You can be discovered by paired devices at all times independent of the network.
ta: நெட்வொர்க்கிலிருந்து சுயாதீனமாக எல்லா நேரங்களிலும் இணை சாதனங்களால் நீங்கள் கண்டுபிடிக்கலாம்.

# footer.public-room-devices
source: in room {{roomId}}
ta: அறையில் {{roomId}}

# footer.public-room-devices_title
source: You can be discovered by devices in this public room independent of the network.
ta: நெட்வொர்க்கிலிருந்து சுயாதீனமான இந்த பொது அறையில் உள்ள சாதனங்களால் நீங்கள் கண்டுபிடிக்கலாம்.

# footer.traffic
source: Traffic is
ta: போக்குவரத்து

# footer.routed
source: routed through the server
ta: சேவையகம் வழியாக திசைதிருப்பப்பட்டது

# footer.webrtc
source: if WebRTC is not available.
ta: WEBRTC கிடைக்கவில்லை என்றால்.

# dialogs.pair-devices-title
source: Pair Devices Permanently
ta: இணை சாதனங்கள் நிரந்தரமாக

# dialogs.input-key-on-this-device
source: Input this key on another device
ta: இந்த விசையை மற்றொரு சாதனத்தில் உள்ளிடவும்

# dialogs.scan-qr-code
source: or scan the QR-code.
ta: அல்லது QR-குறியீட்டை ச்கேன் செய்யுங்கள்.

# dialogs.enter-key-from-another-device
source: Enter key from another device here.
ta: மற்றொரு சாதனத்திலிருந்து விசையை இங்கே உள்ளிடவும்.

# dialogs.temporary-public-room-title
source: Temporary Public Room
ta: தற்காலிக பொது அறை

# dialogs.input-room-id-on-another-device
source: Input this room ID on another device
ta: இந்த அறை ஐடியை மற்றொரு சாதனத்தில் உள்ளிடவும்

# dialogs.enter-room-id-from-another-device
source: Enter room ID from another device to join room.
ta: அறையில் சேர மற்றொரு சாதனத்திலிருந்து அறை ஐடியை உள்ளிடவும்.

# dialogs.hr-or
source: OR
ta: அல்லது

# dialogs.pair
source: Pair
ta: பேரிக்காய்

# dialogs.cancel
source: Cancel
ta: ரத்துசெய்

# dialogs.edit-paired-devices-title
source: Edit Paired Devices
ta: இணை சாதனங்களைத் திருத்தவும்

# dialogs.unpair
source: Unpair
ta: அவிழ்த்து விடுங்கள்

# dialogs.paired-device-removed
source: Paired device has been removed.
ta: இணை சாதனம் அகற்றப்பட்டது.

# dialogs.paired-devices-wrapper_data-empty
source: No paired devices.
ta: இணை சாதனங்கள் இல்லை.

# dialogs.auto-accept-instructions-1
source: Activate
ta: செயல்படுத்து

# dialogs.auto-accept
source: auto-accept
ta: தானாக ஏற்றுக்கொள்ளுங்கள்

# dialogs.auto-accept-instructions-2
source: to automatically accept all files sent from that device.
ta: அந்த சாதனத்திலிருந்து அனுப்பப்பட்ட அனைத்து கோப்புகளையும் தானாக ஏற்றுக்கொள்ள.

# dialogs.close
source: Close
ta: மூடு

# dialogs.join
source: Join
ta: சேர

# dialogs.leave
source: Leave
ta: விடுப்பு

# dialogs.would-like-to-share
source: would like to share
ta: பகிர்ந்து கொள்ள விரும்புகிறேன்

# dialogs.accept
source: Accept
ta: ஏற்றுக்கொள்

# dialogs.decline
source: Decline
ta: வீழ்ச்சி

# dialogs.has-sent
source: has sent:
ta: அனுப்பியுள்ளது:

# dialogs.share
source: Share
ta: பங்கு

# dialogs.download
source: Download
ta: பதிவிறக்கம்

# dialogs.send-message-title
source: Send Message
ta: செய்தி அனுப்பவும்

# dialogs.send-message-to
source: To:
ta: இதற்கு:

# dialogs.message_title
source: Insert message to send
ta: அனுப்ப செய்தியைச் செருகவும்

# dialogs.message_placeholder
source: Text
ta: உரை

# dialogs.send
source: Send
ta: அனுப்பு

# dialogs.receive-text-title
source: Message Received
ta: செய்தி பெறப்பட்டது

# dialogs.copy
source: Copy
ta: நகலெடு

# dialogs.base64-title-files
source: Share Files
ta: கோப்புகளைப் பகிரவும்

# dialogs.base64-title-text
source: Share Text
ta: உரையைப் பகிரவும்

# dialogs.base64-processing
source: Processing…
ta: செயலாக்கம்…

# dialogs.base64-tap-to-paste
source: Tap here to share {{type}}
ta: {{type}} பகிர இங்கே தட்டவும்

# dialogs.base64-paste-to-send
source: Paste clipboard here to share {{type}}
ta: {{type}} ஐப் பகிர இங்கே கிளிப்போர்டை ஒட்டவும்

# dialogs.base64-text
source: text
ta: உரை

# dialogs.base64-files
source: files
ta: கோப்புகள்

# dialogs.file-other-description-image
source: and 1 other image
ta: மற்றும் 1 பிற படம்

# dialogs.file-other-description-file
source: and 1 other file
ta: மற்றும் 1 பிற கோப்பு

# dialogs.file-other-description-image-plural
source: and {{count}} other images
ta: மற்றும் {{count}} பிற படங்கள்

# dialogs.file-other-description-file-plural
source: and {{count}} other files
ta: மற்றும் {{count}} பிற கோப்புகள்

# dialogs.title-image
source: Image
ta: படம்

# dialogs.title-file
source: File
ta: கோப்பு

# dialogs.title-image-plural
source: Images
ta: படங்கள்

# dialogs.title-file-plural
source: Files
ta: கோப்புகள்

# dialogs.receive-title
source: {{descriptor}} Received
ta: {{descriptor}} பெறப்பட்டது

# dialogs.download-again
source: Download again
ta: மீண்டும் பதிவிறக்கவும்

# dialogs.language-selector-title
source: Set Language
ta: மொழியை அமைக்கவும்

# dialogs.system-language
source: System Language
ta: கணினி மொழி

# dialogs.public-room-qr-code_title
source: Click to copy link to public room
ta: பொது அறைக்கு இணைப்பை நகலெடுக்க சொடுக்கு செய்க

# dialogs.pair-devices-qr-code_title
source: Click to copy link to pair this device
ta: இந்த சாதனத்தை இணைக்க இணைப்பை நகலெடுக்க சொடுக்கு செய்க

# dialogs.approve
source: approve
ta: ஒப்புதல்

# dialogs.share-text-title
source: Share Text Message
ta: உரை செய்தியைப் பகிரவும்

# dialogs.share-text-subtitle
source: Edit message before sending:
ta: அனுப்புவதற்கு முன் செய்தியைத் திருத்தவும்:

# dialogs.share-text-checkbox
source: Always show this dialog when sharing text
ta: உரையைப் பகிரும்போது எப்போதும் இந்த உரையாடலைக் காட்டுங்கள்

# dialogs.close-toast_title
source: Close notification
ta: அறிவிப்பை மூடு

# about.close-about_aria-label
source: Close About PairDrop
ta: இணை ட்ராப் பற்றி மூடு

# about.claim
source: The easiest way to transfer files across devices
ta: சாதனங்களில் கோப்புகளை மாற்ற எளிதான வழி

# about.github_title
source: PairDrop on GitHub
ta: கிட்அப்பில் இணை டிராப்

# about.buy-me-a-coffee_title
source: Buy me a coffee!
ta: எனக்கு ஒரு காபி வாங்க!

# about.tweet_title
source: Tweet about PairDrop
ta: இணை ட்ராப் பற்றி ட்வீட் செய்யுங்கள்

# about.mastodon_title
source: Write about PairDrop on Mastodon
ta: மாச்டோடனில் இணை ட்ராப் பற்றி எழுதுங்கள்

# about.bluesky_title
source: Follow us on BlueSky
ta: ப்ளூச்கியில் எங்களைப் பின்தொடரவும்

# about.custom_title
source: Follow us
ta: எங்களைப் பின்தொடரவும்

# about.privacypolicy_title
source: Open our privacy policy
ta: எங்கள் தனியுரிமைக் கொள்கையைத் திறக்கவும்

# about.faq_title
source: Frequently asked questions
ta: அடிக்கடி கேட்கப்படும் கேள்விகள்

# notifications.display-name-changed-permanently
source: Display name is changed permanently
ta: காட்சி பெயர் நிரந்தரமாக மாற்றப்பட்டுள்ளது

# notifications.display-name-changed-temporarily
source: Display name is changed for this session only
ta: இந்த அமர்வுக்கு மட்டுமே காட்சி பெயர் மாற்றப்பட்டுள்ளது

# notifications.display-name-random-again
source: Display name is randomly generated again
ta: காட்சி பெயர் தோராயமாக மீண்டும் உருவாக்கப்படுகிறது

# notifications.download-successful
source: {{descriptor}} downloaded
ta: {{descriptor}} பதிவிறக்கம் செய்யப்பட்டது

# notifications.pairing-tabs-error
source: Pairing two web browser tabs is impossible
ta: இரண்டு வலை உலாவி தாவல்களை இணைப்பது சாத்தியமற்றது

# notifications.pairing-success
source: Devices paired
ta: சாதனங்கள் இணை

# notifications.pairing-not-persistent
source: Paired devices are not persistent
ta: இணை சாதனங்கள் தொடர்ந்து இல்லை

# notifications.pairing-key-invalid
source: Invalid key
ta: தவறான விசை

# notifications.pairing-key-invalidated
source: Key {{key}} invalidated
ta: விசை {{key}} செல்லாதது

# notifications.pairing-cleared
source: All devices unpaired
ta: அனைத்து சாதனங்களும் இணைக்கப்படவில்லை

# notifications.public-room-id-invalid
source: Invalid room ID
ta: தவறான அறை ஐடி

# notifications.public-room-left
source: Left public room {{publicRoomId}}
ta: இடது பொது அறை {{publicRoomId}}}

# notifications.copied-to-clipboard
source: Copied to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது

# notifications.pair-url-copied-to-clipboard
source: Link to pair this device copied to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்ட இந்த சாதனத்தை இணைக்க இணைப்பு

# notifications.room-url-copied-to-clipboard
source: Link to public room copied to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்ட பொது அறைக்கான இணைப்பு

# notifications.copied-to-clipboard-error
source: Copying not possible. Copy manually.
ta: நகலெடுப்பது சாத்தியமில்லை. கைமுறையாக நகலெடுக்கவும்.

# notifications.text-content-incorrect
source: Text content is incorrect
ta: உரை உள்ளடக்கம் தவறானது

# notifications.file-content-incorrect
source: File content is incorrect
ta: கோப்பு உள்ளடக்கம் தவறானது

# notifications.clipboard-content-incorrect
source: Clipboard content is incorrect
ta: இடைநிலைப்பலகை உள்ளடக்கம் தவறானது

# notifications.notifications-enabled
source: Notifications enabled
ta: அறிவிப்புகள் இயக்கப்பட்டன

# notifications.notifications-permissions-error
source: Notifications permission has been blocked as the user has dismissed the permission prompt several times. This can be reset in Page Info which can be accessed by clicking the lock icon next to the URL bar.
ta: பயனர் இசைவு வரியை பல முறை நிராகரித்ததால் அறிவிப்புகள் இசைவு தடுக்கப்பட்டுள்ளது. முகவரி பட்டியின் அடுத்த பூட்டு ஐகானைக் சொடுக்கு செய்வதன் மூலம் அணுகக்கூடிய பக்கத் தகவலில் இதை மீட்டமைக்க முடியும்.

# notifications.link-received
source: Link received by {{name}} - Click to open
ta: இணைப்பு {{name}} - திறக்க சொடுக்கு செய்க

# notifications.message-received
source: Message received by {{name}} - Click to copy
ta: {{name} by ஆல் பெறப்பட்ட செய்தி - நகலெடுக்க சொடுக்கு செய்க

# notifications.click-to-download
source: Click to download
ta: பதிவிறக்க சொடுக்கு செய்க

# notifications.request-title
source: {{name}} would like to transfer {{count}} {{descriptor}}
ta: {{name}} {{count}} {{descriptor}} ஐ மாற்ற விரும்புகிறது

# notifications.click-to-show
source: Click to show
ta: காண்பிக்க சொடுக்கு செய்க

# notifications.copied-text
source: Copied text to clipboard
ta: இடைநிலைப்பலகைக்கு உரையை நகலெடுத்தது

# notifications.copied-text-error
source: Writing to clipboard failed. Copy manually!
ta: இடைநிலைப்பலகைக்கு எழுதுவது தோல்வியடைந்தது. கைமுறையாக நகலெடுக்கவும்!

# notifications.offline
source: You are offline
ta: நீங்கள் ஆஃப்லைனில் இருக்கிறீர்கள்

# notifications.online
source: You are back online
ta: நீங்கள் ஆன்லைனில் திரும்பி வந்துள்ளீர்கள்

# notifications.connected
source: Connected
ta: இணைக்கப்பட்டுள்ளது

# notifications.online-requirement-pairing
source: You need to be online to pair devices
ta: இணை சாதனங்களுக்கு நீங்கள் ஆன்லைனில் இருக்க வேண்டும்

# notifications.online-requirement-public-room
source: You need to be online to create a public room
ta: ஒரு பொது அறையை உருவாக்க நீங்கள் ஆன்லைனில் இருக்க வேண்டும்

# notifications.connecting
source: Connecting…
ta: இணைத்தல்…

# notifications.files-incorrect
source: Files are incorrect
ta: கோப்புகள் தவறானவை

# notifications.file-transfer-completed
source: File transfer completed
ta: கோப்பு பரிமாற்றம் முடிந்தது

# notifications.ios-memory-limit
source: Sending files to iOS is only possible up to 200 MB at once
ta: ஐஇமு க்கு கோப்புகளை அனுப்புவது ஒரே நேரத்தில் 200 எம்பி வரை மட்டுமே சாத்தியமாகும்

# notifications.message-transfer-completed
source: Message transfer completed
ta: செய்தி பரிமாற்றம் முடிந்தது

# notifications.unfinished-transfers-warning
source: There are unfinished transfers. Are you sure you want to close PairDrop?
ta: முடிக்கப்படாத இடமாற்றங்கள் உள்ளன. நீங்கள் நிச்சயமாக இணை டிராப்பை மூட விரும்புகிறீர்களா?

# notifications.rate-limit-join-key
source: Rate limit reached. Wait 10 seconds and try again.
ta: வீத வரம்பு எட்டப்பட்டது. 10 வினாடிகள் காத்திருந்து மீண்டும் முயற்சிக்கவும்.

# notifications.selected-peer-left
source: Selected peer left
ta: தேர்ந்தெடுக்கப்பட்ட பியர் இடது

# document-titles.file-received
source: File Received
ta: கோப்பு பெறப்பட்டது

# document-titles.file-received-plural
source: {{count}} Files Received
ta: {{count}} கோப்புகள் பெறப்பட்டன

# document-titles.file-transfer-requested
source: File Transfer Requested
ta: கோப்பு பரிமாற்றம் கோரப்பட்டது

# document-titles.image-transfer-requested
source: Image Transfer Requested
ta: பட பரிமாற்றம் கோரப்பட்டது

# document-titles.message-received
source: Message Received
ta: செய்தி பெறப்பட்டது

# document-titles.message-received-plural
source: {{count}} Messages Received
ta: {{count}} செய்திகள் பெறப்பட்டன

# peer-ui.click-to-send-share-mode
source: Click to send {{descriptor}}
ta: {{descriptor}} ஐ அனுப்ப சொடுக்கு செய்க

# peer-ui.click-to-send
source: Click to send files or right click to send a message
ta: கோப்புகளை அனுப்ப சொடுக்கு செய்யவும் அல்லது செய்தியை அனுப்ப வலது சொடுக்கு செய்யவும்

# peer-ui.connection-hash
source: To verify the security of the end-to-end encryption, compare this security number on both devices
ta: இறுதி முதல் இறுதி குறியாக்கத்தின் பாதுகாப்பை சரிபார்க்க, இந்த பாதுகாப்பு எண்ணை இரு சாதனங்களிலும் ஒப்பிடுக

# peer-ui.preparing
source: Preparing…
ta: தயாரித்தல்…

# peer-ui.waiting
source: Waiting…
ta: காத்திருக்கிறது…

# peer-ui.processing
source: Processing…
ta: செயலாக்கம்…

# peer-ui.transferring
source: Transferring…
ta: இடமாற்றம்…
