Repository: 247i/TACETr
Catalog: உரை/தானி/pcapdroid-app-*.po
Languages: ta

# export_ca_certificate
source: Export the PCAPdroid CA certificate, then open the Android "Encryption & Credentials" settings and choose install it as a "CA certificate"
ta: PCAPDroid CA சான்றிதழை ஏற்றுமதி செய்து, பின்னர் ஆண்ட்ராய்டு "குறியாக்க மற்றும் நற்சான்றிதழ்கள்" அமைப்புகளைத் திறந்து அதை "CA சான்றிதழ்" ஆக நிறுவவும் என்பதைத் தேர்வுசெய்க

# install_ca_certificate
source: Install the PCAPdroid CA certificate, choosing "VPN and apps". Android will ask for your lockscreen or password
ta: "VPN மற்றும் APPS" ஐத் தேர்ந்தெடுத்து PCAPDroid CA சான்றிதழை நிறுவவும். ஆண்ட்ராய்டு உங்கள் பூட்டு திரை அல்லது கடவுச்சொல்லைக் கேட்கும்

source: Checking the certificate…
ta: சான்றிதழை சரிபார்க்கிறது…

# ca_cert_export_failed
source: An error occurred while exporting the CA certificate If your device implements Autostart or similar software to limit background services execution, be sure to <a href="%1$s">whitelist PCAPdroid</a>
ta: CA சான்றிதழை ஏற்றுமதி செய்யும் போது பிழை ஏற்பட்டது பின்னணி சேவைகள் செயல்படுத்தலைக் கட்டுப்படுத்த உங்கள் சாதனம் ஆட்டோச்டார்ட் அல்லது ஒத்த மென்பொருளை செயல்படுத்தினால், <a href="%1$s"> வைட்லிச்ட் pcapdroid </a> ஐ உறுதிப்படுத்திக் கொள்ளுங்கள்

# cert_exported_now_installed
source: Certificate exported, now install it from the Android settings
ta: சான்றிதழ் ஏற்றுமதி செய்யப்பட்டது, இப்போது அதை ஆண்ட்ராய்டு அமைப்புகளிலிருந்து நிறுவவும்

# cert_installed_correctly
source: The CA certificate is installed
ta: CA சான்றிதழ் நிறுவப்பட்டுள்ளது

# cert_reinstall_required
source: The CA certificate is not installed, run the mitm setup wizard
ta: CA சான்றிதழ் நிறுவப்படவில்லை, MITM அமைவு வழிகாட்டியை இயக்கவும்

# mitm_addon_bad_version
source: Bad PCAPdroid mitm addon version. Please install version %1$s and retry
ta: மோசமான PCAPDROID MITM ADDON பதிப்பு. பதிப்பு %1$s ஐ நிறுவி மீண்டும் முயற்சிக்கவும்

source: Update available
ta: புதுப்பிப்பு கிடைக்கிறது

# mitm_addon_update_available
source: A new mitm addon update is available. Update to get the latest bug fixes
ta: புதிய MITM ADDON புதுப்பிப்பு கிடைக்கிறது. அண்மைக் கால பிழை திருத்தங்களைப் பெற புதுப்பிக்கவும்

# mitm_addon_new_version
source: The PCAPdroid mitm addon must be updated
ta: PCAPDroid MITM ADDON புதுப்பிக்கப்பட வேண்டும்

# update_action
source: Update
ta: புதுப்பிப்பு

source: Export failed
ta: ஏற்றுமதி தோல்வியடைந்தது

source: Not encrypted
ta: குறியாக்கம் செய்யப்படவில்லை

source: Request
ta: கோரிக்கை

source: Response
ta: பதில்

source: Overview
ta: கண்ணோட்டம்

# string_http_request
source: HTTP request
ta: HTTP கோரிக்கை

# string_http_response
source: HTTP response
ta: HTTP பதில்

# payload_truncated
source: Payload is truncated. To show it in full, stop the capture and enable "%1$s" from the PCAPdroid settings
ta: பேலோட் துண்டிக்கப்படுகிறது. அதை முழுமையாகக் காட்ட, பிடிப்பதை நிறுத்தி, பி.சி.ஏ.பி டிராய்டு அமைப்புகளிலிருந்து "%1$s" ஐ இயக்கவும்

source: WebSocket
ta: வெப்சாக்கெட்

source: Payload
ta: தாங்குசுமை

# rx_direction
source: RX
ta: ஆர்.எக்ச்

source: Full payload
ta: முழு பேலோட்

# full_payload_summary
source: Show the full connections payload (e.g. the full HTTP request and response). This requires a lot of memory, don't use in the long run
ta: முழு இணைப்புகள் பேலோடைக் காட்டு (எ.கா. முழு HTTP கோரிக்கை மற்றும் பதில்). இதற்கு நிறைய நினைவகம் தேவைப்படுகிறது, நீண்ட காலத்திற்கு பயன்படுத்த வேண்டாம்

source: Not decryptable
ta: மறைகுறியாக்க முடியாதது

source: Decrypted
ta: மறைகுறியாக்கப்பட்டது

source: Decryption
ta: மறைகுறியாக்கம்

# decryption_filter
source: Decryption: %1$s
ta: மறைகுறியாக்கம்: %1$s

# connection_start_not_seen
source: PCAPdroid has not seen the start of this connection. Some information may be missing
ta: இந்த இணைப்பின் தொடக்கத்தை pcapdroid பார்த்ததில்லை. சில தகவல்கள் காணவில்லை

# network_traffic
source: Traffic
ta: போக்குவரத்து

# warn_no_app_data
source: No application data has been exchanged
ta: பயன்பாட்டு தரவு எதுவும் பரிமாறப்படவில்லை

# waiting_application_data
source: Waiting data
ta: காத்திருக்கும் தரவு

source: Display as…
ta: காட்சி…

source: Printable text
ta: அச்சிடக்கூடிய உரை

source: Hexdump
ta: ஃச் டம்ப்

source: Geolocation
ta: உலகம் நீக்கம்

# geolocation_summary
source: Show country and ASN info by performing offline lookups
ta: இணைப்பில்லாத தேடல்களைச் செய்வதன் மூலம் நாடு மற்றும் ஏ.எச்.என் தகவலைக் காட்டு

source: Downloading…
ta: பதிவிறக்கம்…

# download_in_progress
source: Download in progress, please wait
ta: பதிவிறக்கம் முன்னேற்றம், தயவுசெய்து காத்திருங்கள்

# pcap_load_in_progress
source: Capture file loading in progress, please wait
ta: கோப்பு ஏற்றுதல் முன்னேற்றத்தில் உள்ளது, தயவுசெய்து காத்திருங்கள்

source: Download failed
ta: பதிவிறக்கம் தோல்வியடைந்தது

# geo_db_not_found
source: Database not found. Geolocation is disabled
ta: தரவுத்தளம் கிடைக்கவில்லை. புவிஇருப்பிடம் முடக்கப்பட்டுள்ளது

# geo_db_missing
source: Geolocation database missing
ta: புவிஇருப்பிட தரவுத்தளம் இல்லை

# country_rules_warning
source: To use country-based firewall rules, download the geolocation database from the PCAPdroid settings, otherwise country-based rules will be ineffective
ta: நாட்டை அடிப்படையாகக் கொண்ட ஃபயர்வால் விதிகளைப் பயன்படுத்த, பி.சி.ஏ.பி டிராய்டு அமைப்புகளிலிருந்து புவிஇருப்பிட தரவுத்தளத்தைப் பதிவிறக்குங்கள், இல்லையெனில் நாட்டை அடிப்படையாகக் கொண்ட விதிகள் பயனற்றதாக இருக்கும்

source: Database
ta: தரவுத்தளம்

# built_on
source: Built on: %1$s
ta: கட்டப்பட்டது: %1$s

# geo_db_download
source: Tap to download the latest database. New databases are available monthly
ta: அண்மைக் கால தரவுத்தளத்தைப் பதிவிறக்க தட்டவும். புதிய தரவுத்தளங்கள் மாதந்தோறும் கிடைக்கின்றன

# size_x
source: Size: %1$s
ta: அளவு: %1$s

# geo_db_delete
source: Tap to delete the database and save space
ta: தரவுத்தளத்தை நீக்க மற்றும் இடத்தை சேமிக்க தட்டவும்

source: Download
ta: பதிவிறக்கம்

# connection_blocked
source: This connection has been blocked by PCAPdroid
ta: இந்த இணைப்பு pcapdroid ஆல் தடுக்கப்பட்டுள்ளது

# import_action
source: Import
ta: இறக்குமதி

source: Import failed
ta: இறக்குமதி தோல்வியடைந்தது

# invalid_backup
source: Invalid backup format
ta: தவறான காப்புப்பிரதி வடிவம்

# rules_import_success
source: Imported %1$d rules
ta: இறக்குமதி செய்யப்பட்ட %1$d விதிகள்

source: No rules to export
ta: ஏற்றுமதி செய்ய விதிகள் இல்லை

# rules_merge_msg
source: Keep the existing rules?
ta: இருக்கும் விதிகளை வைத்திருக்கவா?

# keep_action
source: Keep
ta: வைத்திருங்கள்

# discard_action
source: Discard
ta: நிராகரிக்கவும்

# rules_delete_confirm
source: Delete the selected rules?
ta: தேர்ந்தெடுக்கப்பட்ட விதிகளை நீக்கவா?

source: Blocklist
ta: பிளாக்லிச்ட்

# num_configured_rules
source: Configured rules
ta: கட்டமைக்கப்பட்ட விதிகள்

source: Connections blocked
ta: இணைப்புகள் தடுக்கப்பட்டன

# last_firewall_block
source: Last block
ta: கடைசி தொகுதி

source: Firewall is disabled
ta: ஃபயர்வால் முடக்கப்பட்டுள்ளது

source: Firewall is enabled
ta: ஃபயர்வால் இயக்கப்பட்டது

source: App info
ta: பயன்பாட்டு செய்தி

# action_block
source: Block
ta: தொகுதி

# action_unblock
source: Unblock
ta: தடை

# netd_block_missed
source: This connection was initiated by netd so it could not be blocked
ta: இந்த இணைப்பு NETD ஆல் தொடங்கப்பட்டது, எனவே அதைத் தடுக்க முடியவில்லை

# firewall_summary
source: Block internet access to apps, configure rules for specific domains and IP addresses. Only works with the non-root capture
ta: பயன்பாடுகளுக்கான இணைய அணுகலைத் தடு, குறிப்பிட்ட களங்கள் மற்றும் ஐபி முகவரிகளுக்கான விதிகளை உள்ளமைக்கவும். ரூட் அல்லாத பிடிப்புடன் மட்டுமே வேலை செய்கிறது

source: No-root firewall
ta: ரூட் ஃபயர்வால் இல்லை

# block_quick
source: Block QUIC
ta: தொகுதி குவிக்

source: Block private DNS
ta: தனியார் டி.என்.எச்

# block_private_dns_summary
source: Detect and possibly block private DNS to inspect DNS traffic. Disabling this can hinder traffic analysis
ta: டி.என்.எச் போக்குவரத்தை ஆய்வு செய்ய தனியார் டி.என்.எச்சைக் கண்டறிந்து தடுக்கலாம். இதை முடக்குவது போக்குவரத்து பகுப்பாய்விற்கு இடையூறு விளைவிக்கும்

# mitm_setup_wizard_intro
source: This wizard will guide you through the installation of the PCAPdroid mitm addon and certification authority, which are needed to perform the <a href="%1$s">TLS decryption</a>
ta: இந்த வழிகாட்டி PCAPDroid MITM துணை நிரல் மற்றும் சான்றிதழ் ஆணையத்தை நிறுவுவதன் மூலம் உங்களுக்கு வழிகாட்டும், அவை <a href="%1$s"> TLS மறைகுறியாக்க </a> செய்ய வேண்டும்

# mitm_setup_wizard_done
source: PCAPdroid is now ready to decrypt the TLS traffic Check out the <a href="%1$s">user guide</a> to know more about the security measures which may prevent decryption and how to bypass them
ta: பி.சி.ஏ.பி டிராய்டு இப்போது டி.எல்.எச் போக்குவரத்தை மறைகுறியாக்க தயாராக உள்ளது மறைகுறியாக்கத்தைத் தடுக்கக்கூடிய பாதுகாப்பு நடவடிக்கைகள் மற்றும் அவற்றை எவ்வாறு புறக்கணிப்பது என்பதைப் பற்றி மேலும் அறிய <a href="%1$s"> பயனர் கையேடு </a> ஐப் பாருங்கள்

source: Welcome to PCAPdroid
ta: PCAPDROID க்கு வருக

# app_intro_next_button
source: Next
ta: அடுத்தது

# app_intro_skip_button
source: Skip
ta: தவிர்

# app_intro_back_button
source: Back
ta: பின்

# app_intro_done_button
source: Done
ta: முடிந்தது

# app_intro_welcome_msg
source: PCAPdroid is a privacy-friendly app which lets you track and analyze the connections made by the apps in your device Moreover, it allows you to export a PCAP dump of the traffic, extract metadata and much more!
ta: பி.சி.ஏ.பி டிராய்டு என்பது ஒரு தனியுரிமை நட்பு பயன்பாடாகும், இது உங்கள் சாதனத்தில் உள்ள பயன்பாடுகளால் செய்யப்பட்ட இணைப்புகளைக் கண்காணிக்கவும் பகுப்பாய்வு செய்யவும் உங்களை அனுமதிக்கிறது மேலும், போக்குவரத்தின் பி.சி.ஏ.பி டம்பை ஏற்றுமதி செய்ய, மேனிலை தரவு மற்றும் பலவற்றை ஏற்றுமதி செய்ய இது உங்களை அனுமதிக்கிறது!

source: Privacy first
ta: முதலில் தனியுரிமை

# app_intro_privacy_msg
source: The app does not employ any tracking, analytics or phoning-home anti-features How can you be sure? Check out its <a href="%1$s">privacy policy</a> and its <a href="%2$s">source code</a>
ta: பயன்பாடு எந்தவொரு கண்காணிப்பு, பகுப்பாய்வு அல்லது தொலைபேசியில்-வீட்டு-எதிர்ப்பு அம்சங்களைப் பயன்படுத்தாது நீங்கள் எப்படி உறுதியாக இருக்க முடியும்? அதன் <a href="%1$s"> தனியுரிமைக் கொள்கை </a> மற்றும் அதன் <a href="%2$s"> மூலக் குறியீடு </a> ஐப் பாருங்கள்

source: Country and ASN
ta: நாடு மற்றும் அச்ன்

# app_intro_geolocation_msg
source: PCAPdroid can query a local database to determine the country of a remote server You must first download the geolocation database from the app settings
ta: தொலைநிலை சேவையகத்தின் நாட்டைத் தீர்மானிக்க பி.சி.ஏ.பி டிராய்டு உள்ளக தரவுத்தளத்தை வினவலாம் நீங்கள் முதலில் பயன்பாட்டு அமைப்புகளிலிருந்து புவிஇருப்பிட தரவுத்தளத்தை பதிவிறக்கம் செய்ய வேண்டும்

# vpn_setup_msg
source: PCAPdroid simulates a VPN in order to capture the network traffic without root. To start the capture, you need to accept the VPN request in the next screen. <b>NOTE:</b> to proceed, disable any configured Always-on VPN from the Android settings
ta: ரூட் இல்லாமல் பிணைய போக்குவரத்தை கைப்பற்ற பி.சி.ஏ.பி டிராய்டு ஒரு வி.பி.என் உருவகப்படுத்துகிறது. பிடிப்பைத் தொடங்க, அடுத்த திரையில் VPN கோரிக்கையை நீங்கள் ஏற்க வேண்டும். <b> குறிப்பு: </b> தொடர, ஆண்ட்ராய்டு அமைப்புகளிலிருந்து எப்போதும் உள்ளமைக்கப்பட்ட VPN ஐ முடக்கு

# app_intro_traffic_inspection
source: Inspecting HTTP requests, responses and raw data is easy, thanks to the built-in decoders Got an encrypted connection? You can enable the <a href="%1$s">TLS decryption</a> to get the decrypted data
ta: HTTP கோரிக்கைகள், பதில்கள் மற்றும் மூல தரவுகளை ஆய்வு செய்வது எளிதானது, உள்ளமைக்கப்பட்ட டிகோடர்களுக்கு நன்றி மறைகுறியாக்கப்பட்ட இணைப்பு கிடைத்ததா? மறைகுறியாக்கப்பட்ட தரவைப் பெற நீங்கள் <a href="%1$s"> TLS மறைகுறியாக்கம் </a> ஐ இயக்கலாம்

# app_intro_firewall_msg
source: With the integrated <a href="%1$s">Firewall</a> you can easily block Internet access to individual apps, domains and countries Combine this with the built-in traffic visibility to get the ultimate tool to protect your privacy
ta: ஒருங்கிணைந்த <a href = "%1$s"> ஃபயர்வால் </a> மூலம் தனிப்பட்ட பயன்பாடுகள், களங்கள் மற்றும் நாடுகளுக்கான இணைய அணுகலை நீங்கள் எளிதாக தடுக்கலாம் உங்கள் தனியுரிமையைப் பாதுகாக்க இறுதி கருவியைப் பெற உள்ளமைக்கப்பட்ட போக்குவரத்து தெரிவுநிலையுடன் இதை இணைக்கவும்

# app_intro_malware_detection
source: Enhance the security of your device with the <a href="%1$s">malware detection</a> feature By using up-to-date blacklists, it can detect, block and alert malicious connections in real-time
ta: <A href = "%1$s"> தீம்பொருள் கண்டறிதல் </a> அம்சத்துடன் உங்கள் சாதனத்தின் பாதுகாப்பை மேம்படுத்தவும் புதுப்பித்த தடுப்புப்பட்டியல்களைப் பயன்படுத்துவதன் மூலம், இது நிகழ்நேரத்தில் தீங்கிழைக்கும் இணைப்புகளைக் கண்டறிந்து, தடுக்கலாம் மற்றும் எச்சரிக்கலாம்

# app_intro_traffic_dump
source: PCAPdroid provides <a href="%1$s">multiple ways</a> to dump the traffic in the standard PCAP format for further analysis Via the <a href="%2$s">PCAPdroid extensions option</a>, you can add app names to the packets and display them in Wireshark
ta: பி.சி.ஏ.பி டிராய்டு <a href = "%1$s"> பல வழிகளை </a> வழங்குகிறது <A href = "%2$s"> pcapdroid நீட்டிப்பு விருப்பம் </a> வழியாக, நீங்கள் பாக்கெட்டுகளில் பயன்பாட்டு பெயர்களைச் சேர்த்து அவற்றை வயர்சார்க்கில் காண்பிக்கலாம்

# permission_granted
source: %1$s permission was granted
ta: %1$s இசைவு வழங்கப்பட்டது

# permission_grant_fail
source: %1$s permission could not be granted
ta: %1$s இசைவு வழங்க முடியாது

# connection_not_found
source: Could not find the given connection
ta: கொடுக்கப்பட்ட இணைப்பைக் கண்டுபிடிக்க முடியவில்லை

source: Low memory
ta: குறைந்த நினைவகம்

# low_memory_info
source: The app is running out of memory, expect crashes
ta: பயன்பாடு நினைவகத்திற்கு வெளியே இயங்குகிறது, செயலிழப்புகளை எதிர்பார்க்கலாம்

# full_payload_disabled
source: The full payload option has been disabled
ta: முழு பேலோட் விருப்பம் முடக்கப்பட்டுள்ளது

# capture_stopped_low_memory
source: Capture has been stopped
ta: பிடிப்பு நிறுத்தப்பட்டுள்ளது

source: Heap usage
ta: குவியல் பயன்பாடு

source: Memory usage
ta: நினைவக பயன்பாடு

# vpn_lockdown_notice
source: To prevent apps from accessing the Internet when PCAPdroid is not running (e.g. after a reboot) you can set PCAPdroid as an always-on VPN in lockdown mode. Do you want to open the VPN settings now?
ta: PCAPDroid இயங்காதபோது பயன்பாடுகள் இணையத்தை அணுகுவதைத் தடுக்க (எ.கா. மறுதொடக்கத்திற்குப் பிறகு) நீங்கள் பூட்டப்பட்ட பயன்முறையில் எப்போதும் VPN ஆக PCAPDroid ஐ அமைக்கலாம். நீங்கள் இப்போது VPN அமைப்புகளைத் திறக்க விரும்புகிறீர்களா?

# ip_mode
source: VPN IP addresses
ta: VPN IP முகவரிகள்

source: IPv4 only
ta: IPv4 மட்டும்

source: IPv6 only
ta: IPv6 மட்டும்

# ip_both
source: IPv4 and IPv6
ta: ஐபிவி 4 மற்றும் ஐபிவி 6

# notifications_notice
source: The app uses notifications to send alerts in case of anomalous events. Grant it the permission to send notifications in the next screen
ta: ஒழுங்கற்ற நிகழ்வுகளின் போது விழிப்பூட்டல்களை அனுப்ப பயன்பாடு அறிவிப்புகளைப் பயன்படுத்துகிறது. அடுத்த திரையில் அறிவிப்புகளை அனுப்ப இசைவு வழங்கவும்

source: VPN exemptions
ta: VPN விலக்குகள்

# vpn_exemptions_summary
source: Exempt some apps from the VPN connection. Their traffic will not be monitored
ta: VPN இணைப்பிலிருந்து சில பயன்பாடுகளுக்கு விலக்கு. அவர்களின் போக்குவரத்து கண்காணிக்கப்படாது

# no_matches_found
source: No matches
ta: போட்டிகள் இல்லை

# cleartext_connection
source: Cleartext
ta: தெளிவான டெக்ச்ட்

source: Unblock permanently
ta: நிரந்தரமாக தடை செய்யுங்கள்

# unblock_for_n_hours
source: Unblock for %1$dh
ta: %1$dh க்கு தடை செய்யுங்கள்

# unblock_for_n_minutes
source: Unblock for %1$dm
ta: %1$dm க்கு தடை செய்யுங்கள்

# block_new_apps
source: Block newly installed apps
ta: புதிதாக நிறுவப்பட்ட பயன்பாடுகளைத் தடுக்கவும்

source: App blocked
ta: பயன்பாடு தடுக்கப்பட்டது

# app_blocked_info
source: The %1$s app has been blocked by the firewall
ta: %1$s பயன்பாடு ஃபயர்வால் தடுக்கப்பட்டுள்ளது

# app_unblocked
source: The %1$s app has been unblocked
ta: %1$s பயன்பாடு தடைசெய்யப்பட்டுள்ளது

# payload_scams_notice
source: This view may contain sensitive information, like your passwords and access tokens. Never give out this information to anyone, it may be a scam attempt
ta: இந்த பார்வையில் உங்கள் கடவுச்சொற்கள் மற்றும் அணுகல் டோக்கன்கள் போன்ற முக்கியமான தகவல்கள் இருக்கலாம். இந்த தகவலை ஒருபோதும் யாருக்கும் கொடுக்க வேண்டாம், இது ஒரு மோசடி முயற்சியாக இருக்கலாம்

# cancel_action
source: Cancel
ta: ரத்துசெய்

# show_data_action
source: Show data
ta: தரவைக் காட்டு

# remote_collector_notice
source: You have configured PCAPdroid to send traffic to a remote server. The server will be able to access your sensitive information. If someone asked you to do this, it is probably a scam attempt
ta: தொலைநிலை சேவையகத்திற்கு போக்குவரத்தை அனுப்ப PCAPDroid ஐ கட்டமைத்துள்ளீர்கள். சேவையகம் உங்கள் முக்கியமான தகவல்களை அணுக முடியும். இதைச் செய்ய யாராவது உங்களிடம் கேட்டால், அது ஒரு மோசடி முயற்சி

# remote_server_warning
source: For security reasons, sending traffic to the remote server "%1$s" is not allowed
ta: பாதுகாப்பு காரணங்களுக்காக, தொலை சேவையகத்திற்கு போக்குவரத்தை அனுப்புவது "%1$s" அனுமதிக்கப்படவில்லை

source: Warning
ta: எச்சரிக்கை

# paid_features_unlocked
source: Paid features unlocked. Restart the capture if running
ta: கட்டண நற்பொருத்தங்கள் திறக்கப்பட்டன. ஓடியால் பிடிப்பை மறுதொடக்கம் செய்யுங்கள்

source: Build info
ta: தகவலை உருவாக்குங்கள்

# tls_decryption_with_root_msg
source: The ability to run TLS decryption with root is an experimental feature. This is a list of known bugs: - in PCAPdroid you will see the traffic as it was generated from the mitm-addon app in place of the original app - when an app filter is set, decryption will only occur for the target app, but PCAPdroid will still show the other apps traffic - if the capture fails to start, ensure that you can actually run the iptables command as root (e.g. via termux) - this may not work on Android 12 and later - if a VPN app is running, you should either target a specific app for decryption or exclude the PCAPdroid mitm addon from the VPN, otherwise traffic will go in a loop
ta: ரூட் மூலம் டி.எல்.எச் மறைகுறியாக்கத்தை இயக்கும் திறன் ஒரு சோதனை அம்சமாகும். இது அறியப்பட்ட பிழைகளின் பட்டியல்: - pcapdroid இல், அசல் பயன்பாட்டிற்கு பதிலாக MITM- அடான் பயன்பாட்டிலிருந்து உருவாக்கப்பட்ட போக்குவரத்தை நீங்கள் காண்பீர்கள் - பயன்பாட்டு வடிகட்டி அமைக்கப்படும்போது, இலக்கு பயன்பாட்டிற்கு மட்டுமே மறைகுறியாக்கம் ஏற்படும், ஆனால் பி.சி.ஏ.பி டிராய்டு இன்னும் மற்ற பயன்பாடுகளின் போக்குவரத்தைக் காண்பிக்கும் - பிடிப்பு தொடங்கத் தவறினால், நீங்கள் உண்மையில் iptables கட்டளையை ரூட்டாக இயக்க முடியும் என்பதை உறுதிப்படுத்தவும் - இது ஆண்ட்ராய்டு 12 மற்றும் அதற்குப் பிறகு வேலை செய்யாது .

# unlock_token_summary
source: A token which can be used to unlock the paid features in non-Google-Play builds of the app (e.g. F-Droid/Github)
ta: பயன்பாட்டின் கூகிள் அல்லாத விளையாட்டு கட்டமைப்புகளில் கட்டண அம்சங்களைத் திறக்க பயன்படுத்தக்கூடிய ஒரு கிள்ளாக்கு (எ.கா. எஃப்-டிராய்டு/கிதுப்)

# unlock_token_error
source: Could not request unlock token [%1$d]: %2$s
ta: திறத்தல் கிள்ளாக்கை கோர முடியவில்லை [ %1$d]: %2$s

# access_paid_features_msg
source: Check out <a href="%1$s">the user guide</a> to learn how to access the paid features
ta: கட்டண அம்சங்களை எவ்வாறு அணுகுவது என்பதை அறிய பயனர் கையேடு </a> ஐ <a href = "%1$s"> ஐப் பாருங்கள்

# license_service_unavailable
source: The PCAPdroid license service is currently unavailable. Please retry in some minutes
ta: PCAPDroid உரிம பணி தற்போது கிடைக்கவில்லை. தயவுசெய்து சில நிமிடங்களில் மீண்டும் முயற்சிக்கவும்

# requesting_unlock_token
source: Requesting an unlock token, please wait
ta: திறத்தல் டோக்கனைக் கோருகிறது, தயவுசெய்து காத்திருங்கள்

# show_action
source: Show
ta: காட்டு

# unlock_token_msg1
source: This is your unlock token. Note it down as you will need it <a href="%1$s">to generate your license codes</a>
ta: இது உங்கள் திறத்தல் கிள்ளாக்கு. உங்கள் உரிமக் குறியீடுகளை உருவாக்க </a href = "%1$s"> உங்களுக்குத் தேவைப்படுவதால் அதைக் கவனியுங்கள் </a>

source: Paid feature
ta: கட்டண நற்பொருத்தம்

# firewall_purchase_msg
source: Buy the <i>%1$s</i> feature to start blocking connections
ta: இணைப்புகளைத் தடுக்கத் தொடங்க <i>%1$s </i> அம்சத்தை வாங்கவும்

# mitm_skip_notice
source: The mitm certificate does not seem to be installed. If you proceed, decryption may fail
ta: எம்ஐடிஎம் சான்றிதழ் நிறுவப்பட்டதாகத் தெரியவில்லை. நீங்கள் தொடர்ந்தால், மறைகுறியாக்கம் தோல்வியடையக்கூடும்

# mitm_wizard_description
source: Configure the device for the TLS decryption
ta: TLS மறைகுறியாக்கத்திற்கான சாதனத்தை உள்ளமைக்கவும்

# mitmproxy_opts
source: Additional mitmproxy options
ta: கூடுதல் MITMProxy விருப்பங்கள்

# mitmproxy_opts_description
source: Provide additional options for mitmproxy
ta: MITMProxy க்கு கூடுதல் விருப்பங்களை வழங்கவும்

# mitm_addon_error
source: Error while starting the mitm addon. Check the log for details
ta: MITM addon ஐத் தொடங்கும் போது பிழை. விவரங்களுக்கு பதிவைச் சரிபார்க்கவும்

source: Whitelist mode
ta: அனுமதிப்பட்டியல் பயன்முறை

# firewall_whitelist_notice
source: In this mode all the connections will be blocked, unless manually whitelisted. You may miss push notifications without a proper whitelist
ta: இந்த பயன்முறையில் அனைத்து இணைப்புகளும் தடுக்கப்படும், கைமுறையாக அனுமதிப்பட்டி செய்யப்படாவிட்டால். சரியான அனுமதிப்பட்டியலாளர் இல்லாமல் புச் அறிவிப்புகளை நீங்கள் இழக்க நேரிடும்

# firewall_whitelist_help
source: These rules specify which connections to allow. Blocklist rules have priority over whitelist rules
ta: இந்த விதிகள் எந்த இணைப்புகளை அனுமதிக்க வேண்டும் என்பதைக் குறிப்பிடுகின்றன. பிளாக்லிச்ட் விதிகளுக்கு அனுமதிப்பிடிப்பு விதிகளை விட முன்னுரிமை உள்ளது

# add_to_fw_whitelist
source: Add to firewall whitelist
ta: ஃபயர்வால் அனுமதிப்பட்டியலில் சேர்க்கவும்

# remove_from_fw_whitelist
source: Remove from firewall whitelist
ta: ஃபயர்வால் அனுமதிப்பட்டியிலிருந்து அகற்றவும்

# reset_stats_confirm
source: Do you really want to reset these stats?
ta: இந்த புள்ளிவிவரங்களை மீட்டமைக்க விரும்புகிறீர்களா?

source: Port mapping
ta: துறைமுகம் மேப்பிங்

# port_mapping_summary
source: Configure port mapping rules to redirect connections to a different host or port
ta: வேறு புரவலன் அல்லது துறைமுகத்திற்கு இணைப்புகளை திருப்பிவிட துறைமுகம் மேப்பிங் விதிகளை உள்ளமைக்கவும்

# add_action
source: Add
ta: கூட்டு

source: Redirect to:
ta: இதை திருப்பி விடுங்கள்:

source: Original port
ta: அசல் துறைமுகம்

source: required
ta: தேவை

# destination_ip
source: Destination IP address
ta: இலக்கு ஐபி முகவரி

source: Destination port
ta: இலக்கு துறைமுகம்

# port_mapping_exists
source: Port mapping already defined
ta: துறைமுகம் மேப்பிங் ஏற்கனவே வரையறுக்கப்பட்டுள்ளது

# items_delete_confirm
source: Delete the selected items?
ta: தேர்ந்தெடுக்கப்பட்ட பொருட்களை நீக்கவா?

source: IP address
ta: ஐபி முகவரி

# ip_address_or_cidr
source: IP address / CIDR
ta: ஐபி முகவரி / சிஐடிஆர்

# rule_exists
source: Rule already defined
ta: விதி ஏற்கனவே வரையறுக்கப்பட்டுள்ளது

source: DNS servers
ta: டிஎன்எச் சேவையகங்கள்

# dns_servers_summary
source: Configure the DNS servers to use during the capture
ta: பிடிப்பின் போது பயன்படுத்த டிஎன்எச் சேவையகங்களை உள்ளமைக்கவும்

source: IPv4 DNS server
ta: IPv4 DNS சேவையகம்

source: IPv6 DNS server
ta: IPv6 DNS சேவையகம்

source: Use system DNS
ta: சிச்டம் டி.என்.எச்

# use_system_dns_summary
source: Use the system DNS servers if possible
ta: முடிந்தால் கணினி டிஎன்எச் சேவையகங்களைப் பயன்படுத்தவும்

# external_storage_perm_required
source: The external storage permission is required
ta: வெளிப்புற சேமிப்பக இசைவு தேவை

# many_rules_warning
source: You are trying to import many rules, which could make the app unresponsive during some interactions. Do you really want to continue?
ta: நீங்கள் பல விதிகளை இறக்குமதி செய்ய முயற்சிக்கிறீர்கள், இது சில தொடர்புகளின் போது பயன்பாட்டை பதிலளிக்கவில்லை. நீங்கள் உண்மையில் தொடர விரும்புகிறீர்களா?

source: Pcapng format
ta: Pcapng வடிவம்

# pcapng_format_summary
source: Dump packets in the Pcapng dump format, which is more flexible and allows embedding TLS decryption secrets
ta: பி.சி.ஏ.பி.என்.

source: Sort by
ta: வரிசைப்படுத்தவும்

source: Total bytes
ta: மொத்த பைட்டுகள்
