Repository: 247i/TACETr
Catalog: உரை/தானி/pcapdroid-app-*.po
Languages: ta

# write_ext_storage_failed
source: Write to external storage failed. Check the app log for details
ta: வெளிப்புற சேமிப்பகத்திற்கு எழுதுதல் தோல்வியடைந்தது. விவரங்களுக்கு பயன்பாட்டு பதிவை சரிபார்க்கவும்

source: Username
ta: பயனர்பெயர்

source: Password
ta: கடவுச்சொல்

# mitm_addon_autostart_workaround
source: Connection to the mitm addon failed. As a workaround, you can try to open the mitm addon app and then go back to PCAPdroid without closing it. Do you want to open it now?
ta: எம்ஐடிஎம் துணை நிரலுக்கான இணைப்பு தோல்வியடைந்தது. ஒரு பணித்தொகுப்பாக, நீங்கள் MITM ADDON பயன்பாட்டைத் திறக்க முயற்சி செய்யலாம், பின்னர் அதை மூடாமல் pcapdroid க்குச் செல்லலாம். இப்போது அதைத் திறக்க விரும்புகிறீர்களா?

# qr_license_confirm
source: Do you want to generate a license for the "%1$s" device using the following unlock token?
ta: பின்வரும் திறத்தல் கிள்ளாக்கைப் பயன்படுத்தி "%1$s" சாதனத்திற்கான உரிமத்தை உருவாக்க விரும்புகிறீர்களா?

source: Invalid license
ta: தவறான உரிமம்

# connection_error
source: Connection error: %1$s
ta: இணைப்பு பிழை: %1$s

source: Activate via QR code
ta: QR குறியீடு வழியாக செயல்படுத்தவும்

# qr_code_expired
source: QR code expired. Generate a new QR code and retry
ta: QR குறியீடு காலாவதியானது. புதிய QR குறியீட்டை உருவாக்கி மீண்டும் முயற்சிக்கவும்

# qr_info_text
source: Install PCAPdroid from Google Play and scan this QR code
ta: Google Play இலிருந்து PCAPDroid ஐ நிறுவி இந்த QR குறியீட்டை ச்கேன் செய்யுங்கள்

# qr_purchase_required
source: Purchase an unlock token to proceed with the QR code activation
ta: QR குறியீடு செயல்படுத்தலுடன் தொடர திறத்தல் கிள்ளாக்கை வாங்கவும்

# license_limit_reached
source: You have reached the licenses limit for this unlock token. Buy a new token to generate more licenses
ta: இந்த திறத்தல் டோக்கனுக்கான உரிம வரம்பை நீங்கள் அடைந்துவிட்டீர்கள். அதிக உரிமங்களை உருவாக்க புதிய கிள்ளாக்கை வாங்கவும்

# license_error
source: License generation error [%1$d]: %2$s
ta: உரிமம் உருவாக்கும் பிழை [ %1$d]: %2$s

# requesting_license
source: Requesting a license code, please wait
ta: உரிமக் குறியீட்டைக் கோருகிறது, தயவுசெய்து காத்திருங்கள்

# license_activation_ok
source: License activation completed
ta: உரிமம் செயல்படுத்தல் முடிந்தது

# mitm_addon_starting
source: Mitm addon is starting…
ta: MITM addon தொடங்குகிறது…

# mitm_addon_running
source: Mitm addon is running
ta: MITM ADDON இயங்குகிறது

source: Decryption rules
ta: மறைகுறியாக்க விதிகள்

# decryption_rules_help
source: These rules specify which connections to decrypt. Host-based rules only work if a prior DNS reply is seen
ta: இந்த விதிகள் எந்த இணைப்புகளை மறைகுறியாக்குகின்றன என்பதைக் குறிப்பிடுகின்றன. முன் டிஎன்எச் பதில் காணப்பட்டால் மட்டுமே புரவலன் அடிப்படையிலான விதிகள் வேலை செய்கின்றன

# decrypt_action
source: Decrypt…
ta: டிக்ரிப்ட்…

# dont_decrypt_action
source: Don't decrypt…
ta: மறைகுறியாக்க வேண்டாம்…

# status_encrypted
source: Encrypted
ta: குறியாக்கப்பட்டது

source: Injected
ta: செலுத்தப்பட்டது

# open_pcap_file
source: Open PCAP/Pcapng file…
ta: PCAP/PCAPNG கோப்பைத் திறக்கவும்…

# pcap_load_success
source: Capture file loaded
ta: கைப்பற்றப்பட்ட கோப்பு ஏற்றப்பட்டது

# unsupported_pcap_file
source: Unsupported capture file format
ta: ஆதரிக்கப்படாத பிடிப்பு கோப்பு வடிவம்

# decrypt_pcap_file
source: Decrypt PCAP/Pcapng file…
ta: பிசிஏபி/பி.சி.ஏ.பி.என்.சி கோப்பை டிக்ரிப்ட் செய்யுங்கள்…

# invalid_pcap_file
source: Invalid capture file format
ta: தவறான பிடிப்பு கோப்பு வடிவம்

# capture_interface_open_error
source: Could not open the capture interface
ta: பிடிப்பு இடைமுகத்தைத் திறக்க முடியவில்லை

# unsupported_pcap_datalink
source: The file has an unsupported datalink
ta: கோப்பில் ஆதரிக்கப்படாத டேட்டாலிங்க் உள்ளது

# pcap_file_not_exists
source: The specified file does not exist
ta: குறிப்பிட்ட கோப்பு இல்லை

# root_capture_start_failed
source: Capture start failure. Ensure that the device is rooted with Magisk
ta: தொடக்க தோல்வி. சாதனம் மேகிசுடன் வேரூன்றியிருப்பதை உறுதிசெய்க

# root_capture_pcapd_start_failure
source: Capture start failure. Make sure you grant root access to PCAPdroid
ta: தொடக்க தோல்வி. PCAPDroid க்கு ரூட் அணுகலை வழங்குவதை உறுதிசெய்க

# pcap_read_error
source: Error reading the capture file. Check the log for details
ta: பிடிப்பு கோப்பைப் படிப்பதில் பிழை. விவரங்களுக்கு பதிவைச் சரிபார்க்கவும்

# keylog_read_error
source: SSL keylog read error
ta: SSL KEYLOG READ பிழை

# pcap_file_load_aborted
source: Capture file loading aborted
ta: கைப்பற்றப்பட்ட கோப்பு ஏற்றுதல் நிறுத்தப்பட்டது

# host_resolution_failed
source: Could not resolve host %1$s
ta: புரவலன் %1$s ஐ தீர்க்க முடியவில்லை

# pcapdroid_trailer_notice
source: To show the actual apps instead of "%1$s", be sure to enable the "%2$s" option before generating the dump
ta: "%1$s" க்கு பதிலாக உண்மையான பயன்பாடுகளைக் காட்ட, டம்பை உருவாக்குவதற்கு முன் "%2$s" விருப்பத்தை இயக்க மறக்காதீர்கள்

# decryption_info_no_rule
source: To decrypt this connection, create a decryption rule from the left drawer or from the contextual menu in the Connections list
ta: இந்த இணைப்பை மறைகுறியாக்க, இடது டிராயரில் இருந்து அல்லது இணைப்புகள் பட்டியலில் உள்ள சூழல் மெனுவிலிருந்து ஒரு மறைகுறியாக்க விதியை உருவாக்கவும்

# tls_decryption_no_rules_notice
source: TLS decryption is only applied to connections that match the configured rules. Do you want to create decryption rules now?
ta: கட்டமைக்கப்பட்ட விதிகளுடன் பொருந்தக்கூடிய இணைப்புகளுக்கு மட்டுமே டி.எல்.எச் மறைகுறியாக்கம் பயன்படுத்தப்படுகிறது. நீங்கள் இப்போது மறைகுறியாக்க விதிகளை உருவாக்க விரும்புகிறீர்களா?

source: Active VPN detected
ta: செயலில் VPN கண்டறியப்பட்டது

# mitm_doze_notice
source: Battery optimization may interfere with the mitm addon
ta: பேட்டரி உகப்பாக்கம் MITM துணை நிரலில் தலையிடக்கூடும்

source: redirected
ta: திருப்பி விடப்பட்டது

# connection_redirected_port_map
source: This connection has been redirected due to a port mapping rule
ta: துறைமுகம் மேப்பிங் விதி காரணமாக இந்த இணைப்பு திருப்பி விடப்பட்டுள்ளது

# dnscrypt_how_to
source: How to use DoH / DNSCrypt with PCAPdroid
ta: PCAPDroid உடன் DOH / DNSCRYPT ஐ எவ்வாறு பயன்படுத்துவது

source: Never
ta: ஒருபோதும்

source: Always
ta: எப்போதும்

# for_connections_to_decrypt
source: Only for connections to decrypt
ta: மறைகுறியாக்குவதற்கான இணைப்புகளுக்கு மட்டுமே

# decrypt_quic_notice
source: Decrypting QUIC is currently not supported. As a workaround, stop the capture and select the option to block QUIC in the PCAPdroid settings
ta: மறைகுறியாக்கல் தற்போது ஆதரிக்கப்படவில்லை. ஒரு பணித்தொகுப்பாக, பிடிப்பதை நிறுத்தி, பி.சி.ஏ.பி டிராய்டு அமைப்புகளில் Quic ஐத் தடுக்க விருப்பத்தைத் தேர்ந்தெடுக்கவும்

source: Target apps
ta: இலக்கு பயன்பாடுகள்

# target_apps_help
source: Select the applications to capture
ta: கைப்பற்ற பயன்பாடுகளைத் தேர்ந்தெடுக்கவும்

source: Headers
ta: தலைப்பிகளுக்கு

source: Body
ta: உடல்

source: Both
ta: இரண்டும்

source: What's new
ta: புதியது என்ன

source: Raw bytes
ta: மூல பைட்டுகள்

source: Restart on disconnection
ta: துண்டிக்கப்படுவதை மறுதொடக்கம் செய்யுங்கள்

# restart_on_disconnection_summary
source: Automatically restart the capture after being stopped by other VPN apps
ta: மற்ற VPN பயன்பாடுகளால் நிறுத்தப்பட்ட பின்னர் தானாகவே பிடிப்பை மறுதொடக்கம் செய்யுங்கள்

source: VPN reconnection
ta: VPN மறுதொடக்கம்

source: VPN reconnection aborted
ta: VPN இணைப்பு கைவிடப்பட்டது

# waiting_for_vpn_disconnect
source: Waiting for the active VPN to disconnect…
ta: செயலில் உள்ள வி.பி.என் துண்டிக்க காத்திருக்கிறது…

source: Bytes threshold
ta: பைட்டுகள் வாசல்

# select_the_pcap_file
source: Select the PCAP/Pcapng file
ta: PCAP/PCAPNG கோப்பைத் தேர்ந்தெடுக்கவும்

# select_the_keylog_file
source: Select the SSL keylog file
ta: SSL கீலாக் கோப்பைத் தேர்ந்தெடுக்கவும்

# error_code_with_text
source: %1$s (error %2$d)
ta: %1$s (பிழை %2$d)

# errno_epipe
source: Broken pipe
ta: உடைந்த குழாய்

# errno_epipe_msg
source: The server unexpectedly closed the connection during the data transfer
ta: தரவு பரிமாற்றத்தின் போது சேவையகம் எதிர்பாராத விதமாக இணைப்பை மூடியது

# errno_enetdown
source: Network is down
ta: பிணையம் கீழே உள்ளது

# errno_enetdown_msg
source: The network interface is down or it's unable to connect to the network
ta: பிணைய இடைமுகம் குறைந்துவிட்டது அல்லது பிணையத்துடன் இணைக்க முடியவில்லை

# errno_enetunreach
source: Network is unreachable
ta: பிணையம் அணுக முடியாதது

# errno_enetunreach_msg
source: The system cannot find a valid route to the destination network
ta: இலக்கு நெட்வொர்க்கிற்கு சரியான வழியை கணினியால் கண்டுபிடிக்க முடியவில்லை

# errno_enetreset
source: Network reset
ta: பிணையம் மீட்டமைப்பு

# errno_enetreset_msg
source: The network connection was reset by an intermediary device (e.g. router or mobile carrier)
ta: பிணைய இணைப்பு ஒரு இடைநிலை சாதனத்தால் மீட்டமைக்கப்பட்டது (எ.கா. திசைவி அல்லது மொபைல் கேரியர்)

# errno_econnaborted
source: Connection aborted
ta: இணைப்பு கைவிடப்பட்டது

# errno_econnaborted_msg
source: The connection was aborted, usually due to a network transition
ta: பொதுவாக பிணைய மாற்றம் காரணமாக இணைப்பு நிறுத்தப்பட்டது

# errno_econnreset
source: Connection reset by peer
ta: இணைப்பு மீட்டமை பியர்

# errno_econnreset_msg
source: The server abruptly closed the connection, usually due to a crash or ungraceful shutdown
ta: சேவையகம் திடீரென இணைப்பை மூடியது, பொதுவாக விபத்து அல்லது மோசமான பணிநிறுத்தம் காரணமாக

# errno_etimedout
source: Connection timed out
ta: இணைப்பு நேரம் முடிந்தது

# errno_etimedout_msg
source: The server took too long to respond, likely due to network delays or a busy server
ta: பிணையம் தாமதங்கள் அல்லது பிசியான சேவையகம் காரணமாக சேவையகம் பதிலளிக்க அதிக நேரம் எடுத்தது

# errno_econnrefused
source: Connection refused
ta: இணைப்பு மறுத்துவிட்டது

# errno_econnrefused_msg
source: The server rejected the connection, which may indicate a too busy or malfunctioning server
ta: சேவையகம் இணைப்பை நிராகரித்தது, இது மிகவும் பிசியான அல்லது செயலிழந்த சேவையகத்தைக் குறிக்கலாம்

# errno_ehostunreach
source: No route to host
ta: ஓச்டுக்கு பாதை இல்லை

# errno_ehostunreach_msg
source: The system cannot find a route to the destination host
ta: இலக்கு ஓச்டுக்கு ஒரு வழியை கணினியால் கண்டுபிடிக்க முடியவில்லை

# dns_conn_info
source: DNS translates a domain name into an IP address. The actual data is typically exchanged over subsequent HTTPS/TLS connections
ta: டி.என்.எச் ஒரு டொமைன் பெயரை ஐபி முகவரியாக மொழிபெயர்க்கிறது. உண்மையான தரவு பொதுவாக அடுத்தடுத்த HTTPS/TLS இணைப்புகளில் பரிமாறப்படுகிறது

# tls_conn_info
source: TLS/HTTPS traffic is encrypted. To inspect this traffic, you need to decrypt it. Check out the PCAPdroid <a href="%1$s">user guide</a> for details
ta: TLS/HTTPS போக்குவரத்து குறியாக்கம் செய்யப்படுகிறது. இந்த போக்குவரத்தை ஆய்வு செய்ய, நீங்கள் அதை மறைகுறியாக்க வேண்டும். விவரங்களுக்கு pcapdroid <a href = "%1$s"> பயனர் கையேடு </a> ஐப் பாருங்கள்
