Repository: 247i/TACETr
Catalog: உரை/தானி/pcapdroid-app-*.po
Languages: ta

source: SNI
ta: ச்னி

source: URL
ta: முகவரி

# whois_lookup
source: WHOIS
ta: யார்

source: Installation ID
ta: நிறுவல் அடையாளம்

source: License code
ta: உரிமக் குறியீடு

source: root
ta: மூலம்

# app_license
source: PCAPdroid is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the <a href="https://www.gnu.org/licenses/gpl-3.0-standalone.html">GNU General Public License or later</a> for more details
ta: பி.சி.ஏ.பி டிராய்டு இது பயனுள்ளதாக இருக்கும் என்ற நம்பிக்கையில் விநியோகிக்கப்படுகிறது, ஆனால் எந்த உத்தரவாதமும் இல்லாமல்; ஒரு குறிப்பிட்ட நோக்கத்திற்காக வணிகத்தன்மை அல்லது உடற்தகுதி ஆகியவற்றின் மறைமுக பொறுப்பு கூட இல்லாமல். <A href = "https://www.gnu.org/licenses/gpl-3.0-standalone.html"> குனு பொது பொது உரிமம் அல்லது பின்னர் </a> ஐப் பார்க்கவும்

# opensource_licenses
source: <b>Open Source Licenses:</b><br/> - zdtun: <a href="https://github.com/emanuele-f/zdtun/blob/master/COPYING">LGPL-3.0</a> - nDPI: <a href="https://github.com/ntop/nDPI/blob/dev/COPYING">LGPL-3.0</a> - CustomActivityOnCrash: <a href="https://github.com/Ereza/CustomActivityOnCrash/blob/master/LICENSE">Apache-2.0</a> - Gson: <a href="https://github.com/google/gson/blob/master/LICENSE">Apache-2.0</a> - Brotli decoder: <a href="https://github.com/google/brotli/blob/master/LICENSE">MIT</a> - mitmproxy: <a href="https://github.com/mitmproxy/mitmproxy/blob/main/LICENSE">MIT</a> - Chaquopy: <a href="https://github.com/chaquo/chaquopy/blob/master/LICENSE.txt">MIT</a> - MaxMind DB Reader: <a href="https://github.com/maxmind/MaxMind-DB-Reader-java/blob/main/LICENSE">Apache-2.0</a> - FlagKit: <a href="https://github.com/madebybowtie/FlagKit/blob/master/LICENSE">MIT</a> - IP Geolocation by <a href="https://db-ip.com">DB-IP</a> - AppIntro: <a href="https://github.com/AppIntro/AppIntro/blob/main/LICENSE">Apache-2.0</a> - QrGenerator: <a href="https://github.com/androidmads/QRGenerator/blob/master/LICENSE.md">MIT</a> - Sparsehash: <a href="https://github.com/sparsehash/sparsehash/blob/master/COPYING">BSD-3-Clause</a> - CIDRUtils: <a href="https://github.com/edazdarevic/CIDRUtils">MIT</a> - Font Awesome: <a href="https://fontawesome.com/license/free">Licenses</a> - App icon by <a href="https://www.freepik.com" title="Freepik">Freepik</a> from <a href="https://www.flaticon.com/" title="Flaticon">flaticon</a> - SourceCodePro font: <a href="https://github.com/adobe-fonts/source-code-pro/blob/release/LICENSE.md">OFL-1.1</a>
ta: <b> திறந்த மூல உரிமங்கள்: </b> <br/> - zdtun: <a href="https://github.com/emanuele-f/zdtun/blob/master/COPYING">LGPL-3.0</a> - nDPI: <a href="https://github.com/ntop/nDPI/blob/dev/COPYING">LGPL-3.0</a> - CustomActivityOnCrash: <a href="https://github.com/Ereza/CustomActivityOnCrash/blob/master/LICENSE">Apache-2.0</a> - Gson: <a href="https://github.com/google/gson/blob/master/LICENSE">Apache-2.0</a> - Brotli decoder: <a href="https://github.com/google/brotli/blob/master/LICENSE">MIT</a> - mitmproxy: <a href="https://github.com/mitmproxy/mitmproxy/blob/main/LICENSE">MIT</a> - Chaquopy: <a href="https://github.com/chaquo/chaquopy/blob/master/LICENSE.txt">MIT</a> - MaxMind DB Reader: <a href="https://github.com/maxmind/MaxMind-DB-Reader-java/blob/main/LICENSE">Apache-2.0</a> - FlagKit: <a href="https://github.com/madebybowtie/FlagKit/blob/master/LICENSE">MIT</a> - IP Geolocation by <a href="https://db-ip.com">DB-IP</a> - AppIntro: <a href="https://github.com/AppIntro/AppIntro/blob/main/LICENSE">Apache-2.0</a> - QrGenerator: <a href="https://github.com/androidmads/QRGenerator/blob/master/LICENSE.md">MIT</a> - Sparsehash: <a href="https://github.com/sparsehash/sparsehash/blob/master/COPYING">BSD-3-Clause</a> - CIDRUtils: <a href="https://github.com/edazdarevic/CIDRUtils">MIT</a> - Font Awesome: <a href="https://fontawesome.com/license/free">Licenses</a> . - SourceCodePro எழுத்துரு: <a href="https://github.com/adobe-fonts/source-code-pro/blob/release/LICENSE.md">OFL-1.1</a>

# wireshark_licenses
source: <b>PCAP Decryption:</b><br/> - Wireshark: <a href="hhttps://github.com/wireshark/wireshark/blob/master/COPYING">GPL-2.0</a> - ushark: <a href="https://github.com/altafinance/ushark">GPL-2.0</a> - libiconv: <a href="https://www.gnu.org/software/libiconv">LGPL-2.1</a> - glib: <a href="https://gitlab.gnome.org/GNOME/glib/-/blob/main/COPYING">LGPL-2.1</a> - gpgerror: <a href="https://github.com/gpg/libgpg-error/blob/master/COPYING">LGPL-2.1</a> - gcrypt: <a href="https://gnupg.org/software/libgcrypt/index.html">LGPL-2.1</a> - nghttp2: <a href="https://github.com/nghttp2/nghttp2/blob/master/COPYING">MIT</a>
ta: <b> PCAP மறைகுறியாக்கம்: </b> <br/> - Wireshark: <a href="hhttps://github.com/wireshark/wireshark/blob/master/COPYING">GPL-2.0</a> - ushark: <a href="https://github.com/altafinance/ushark">GPL-2.0</a> - libiconv: <a href="https://www.gnu.org/software/libiconv">LGPL-2.1</a> - glib: <a href="https://gitlab.gnome.org/GNOME/glib/-/blob/main/COPYING">LGPL-2.1</a> - gpgerror: <a href="https://github.com/gpg/libgpg-error/blob/master/COPYING">LGPL-2.1</a> - gcrypt: <a href="https://gnupg.org/software/libgcrypt/index.html">LGPL-2.1</a> - nghttp2: <a href="https://github.com/nghttp2/nghttp2/blob/master/COPYING">MIT</a>

# connections_csv_fields
source: IPProto,SrcIP,SrcPort,DstIp,DstPort,UID,App,PackageName,Proto,Status,Info,BytesSent,BytesRcvd,PktsSent,PktsRcvd,FirstSeen,LastSeen
ta: IPPROTO, SRCIP, SRCPORT, DSTIP, DSTPORT, UID, APP, Packagenam

source: Unlock token
ta: டோக்கனைத் திறக்கவும்

# start_button
source: Start
ta: தொடங்கு

# stop_button
source: Stop
ta: நிறுத்து

# title_activity_settings
source: Settings
ta: அமைப்புகள்

# collector_info
source: UDP collector: %1$s:%2$d
ta: யுடிபி கலெக்டர்: %1$s: %2$d

# tcp_collector_info
source: TCP collector: %1$s:%2$d
ta: TCP கலெக்டர்: %1$s: %2$d

# http_server_status
source: HTTP server: http://%1$s:%2$d
ta: Http சேவையகம்: http: //%1$s:%2$d

# rcvd_and_sent
source: %1$s received — %2$s sent
ta: %1$s பெறப்பட்டன - %2$s அனுப்பப்பட்டது

source: Query
ta: வினவல்

source: Host
ta: விருந்தோம்பி

source: Ready
ta: ஆயத்தம்

source: About
ta: பற்றி

source: Status
ta: நிலை

# connections_view
source: Connections
ta: இணைப்புகள்

source: No connections
ta: இணைப்புகள் இல்லை

source: Connection details
ta: இணைப்பு விவரங்கள்

source: App
ta: பயன்பாடு

source: Protocol
ta: நெறிமுறை

source: Source
ta: மூலம்

source: Destination
ta: இலக்கு

source: Packets
ta: பாக்கெட்டுகள்

source: Duration
ta: காலம்

source: HTTP server
ta: HTTP சேவையகம்

source: UDP exporter
ta: யுடிபி ஏற்றுமதியாளர்கள்

source: TCP exporter
ta: டி.சி.பி ஏற்றுமதியாளர்

source: TCP/UDP exporter
ta: TCP/UDP ஏற்றுமதியாளர்

source: No dump
ta: டம்ப் இல்லை

# no_dump_info
source: Traffic will not be dumped
ta: போக்குவரத்து கொட்டப்படாது

# http_server_info
source: Start an HTTP server for the PCAP download
ta: PCAP பதிவிறக்கத்திற்கு HTTP சேவையகத்தைத் தொடங்கவும்

# udp_exporter_info
source: Send the PCAP to a remote UDP receiver
ta: தொலைநிலை UDP ரிசீவருக்கு PCAP ஐ அனுப்பவும்

# tcp_exporter_info
source: Send the PCAP to a remote TCP receiver (pcap-over-ip)
ta: தொலைநிலை TCP ரிசீவருக்கு PCAP ஐ அனுப்பவும் (PCAP-OVER-IP)

source: HTTP server port
ta: HTTP சேவையக துறைமுகம்

# receiver_ip_address
source: Collector IP address
ta: கலெக்டர் ஐபி முகவரி

# receiver_port
source: Collector port
ta: கலெக்டர் துறைமுகம்

source: Traffic dump
ta: போக்குவரத்து டம்ப்

source: User guide
ta: பயனர் வழிகாட்டி

# open_telegram_group
source: Telegram group
ta: தந்தி குழு

source: Source code
ta: மூலக் குறியீடு

source: Yes
ta: ஆம்

source: No
ta: இல்லை

# vpn_setup_failed
source: Could not set up the VPN. Ensure that Always-on VPN is disabled
ta: VPN ஐ அமைக்க முடியவில்லை. எப்போதும் VPN முடக்கப்பட்டுள்ளது என்பதை உறுதிப்படுத்தவும்

# app_not_found
source: Could not find the %1$s app
ta: %1$s பயன்பாட்டைக் கண்டுபிடிக்க முடியவில்லை

source: Stats
ta: புள்ளிவிவரங்கள்

source: Active connections
ta: செயலில் உள்ள இணைப்புகள்

source: Dropped connections
ta: கைவிடப்பட்ட இணைப்புகள்

# tot_connections
source: Total connections
ta: மொத்த இணைப்புகள்

source: Open sockets
ta: திறந்த சாக்கெட்டுகள்

source: Bytes sent
ta: பைட்டுகள் அனுப்பப்பட்டன

# bytes_rcvd
source: Bytes received
ta: பைட்டுகள் பெறப்பட்டன

source: IPv6 bytes sent
ta: ஐபிவி 6 பைட்டுகள் அனுப்பப்பட்டன

# ipv6_bytes_rcvd
source: IPv6 bytes received
ta: ஐபிவி 6 பைட்டுகள் பெறப்பட்டன

source: IPv6 bytes percentage
ta: ஐபிவி 6 பைட்டுகள் விழுக்காடு

source: Packets sent
ta: பாக்கெட்டுகள் அனுப்பப்பட்டன

# packets_rcvd
source: Packets received
ta: பாக்கெட்டுகள் பெறப்பட்டன

source: DNS queries
ta: டி.என்.எச் வினவல்கள்

source: Search apps
ta: பயன்பாடுகளைத் தேடுங்கள்

source: No apps
ta: பயன்பாடுகள் இல்லை

source: DNS server
ta: டிஎன்எச் சேவையகம்

source: Apps
ta: பயன்பாடுகள்

source: PCAP file
ta: PCAP கோப்பு

# pcap_file_info
source: Create a PCAP/Pcapng file in the device storage
ta: சாதன சேமிப்பகத்தில் PCAP/PCAPNG கோப்பை உருவாக்கவும்

source: Cannot write file
ta: கோப்பை எழுத முடியாது

source: Share
ta: பங்கு

source: Delete
ta: நீக்கு

source: OK
ta: சரி

# pcap_file_action
source: Traffic saved to the "%1$s" file (%2$s)
ta: போக்குவரத்து "%1$s" கோப்பில் சேமிக்கப்பட்டது (%2$s)

# delete_error
source: Could not delete the file
ta: கோப்பை நீக்க முடியவில்லை

# copy_error
source: Could not write the file
ta: கோப்பை எழுத முடியவில்லை

source: Capture running
ta: இயங்கும் பிடிப்பு

# notification_msg
source: %1$s captured, %2$s connections
ta: %1$s கைப்பற்றப்பட்டன, %2$s இணைப்புகள்

# conn_status_active
source: Active
ta: செயலில்

source: First seen
ta: முதலில் பார்த்தேன்

source: Last seen
ta: கடைசியாக பார்த்தேன்

# conn_status_closed
source: Closed
ta: மூடப்பட்டது

# copy_to_clipboard
source: Copy
ta: நகலெடு

source: Save to file
ta: கோப்பில் சேமிக்கவும்

# older_connections_notice
source: %1$d older connections not shown
ta: %1$d பழைய இணைப்புகள் காட்டப்படவில்லை

# about_text
source: PCAPdroid is an open source network capture and monitoring tool which works without root privileges
ta: பி.சி.ஏ.பி டிராய்டு என்பது ஒரு திறந்த மூல பிணையம் பிடிப்பு மற்றும் கண்காணிப்பு கருவியாகும், இது ரூட் சலுகைகள் இல்லாமல் செயல்படுகிறது

# get_app
source: Get it:
ta: அதைப் பெறுங்கள்:

# unknown_app
source: Unknown
ta: தெரியவில்லை

# phone_app
source: Phone
ta: தொலைபேசி

source: Error
ta: பிழை

# conn_status_unreachable
source: Unreachable
ta: அணுக முடியாதது

# other_prefs
source: Other
ta: மற்றொன்று

source: App language
ta: பயன்பாட்டு மொழி

# lang_english
source: English
ta: ஆங்கிலம்

source: System default
ta: கணினி இயல்புநிலை

# no_activity_file_selection
source: No app found to handle file selection
ta: கோப்பு தேர்வைக் கையாள எந்த பயன்பாடும் கிடைக்கவில்லை

# file_saved_with_name
source: File saved as "%1$s"
ta: கோப்பு "%1$s" என சேமிக்கப்பட்டது

# socks5_proxy
source: SOCKS5
ta: சாக்ச் 5

source: SOCKS5 redirection
ta: SOCKS5 திருப்பிவிடுதல்

# socks5_summary
source: Configure the redirection to a SOCKS5 proxy
ta: ஒரு சாக்ச் 5 ப்ராக்சிக்கு திருப்பிவிடுவதை உள்ளமைக்கவும்

# enable_socks5_proxy_summary
source: Redirect all the TCP connections to a SOCKS5 proxy
ta: அனைத்து TCP இணைப்புகளையும் ஒரு SOCKS5 ப்ராக்சிக்கு திருப்பி விடுங்கள்

# socks5_info
source: SOCKS5 proxy: %1$s:%2$d
ta: SOCKS5 ப்ராக்சி: %1$s: %2$d

# socks5_auth
source: SOCKS5 authentication
ta: SOCKS5 ஏற்பு

# socks5_auth_summary
source: Authenticate to the proxy via username and password
ta: பயனர்பெயர் மற்றும் கடவுச்சொல் வழியாக ப்ராக்சிக்கு அங்கீகரிக்கவும்

source: Proxy host
ta: பதிலாள் புரவலன்

source: Proxy port
ta: பதிலாள் துறைமுகம்

# root_capture
source: Capture as root
ta: வேராகப் பிடிக்கவும்

# root_capture_summary
source: Allows PCAPdroid to run with other VPN apps
ta: பிற VPN பயன்பாடுகளுடன் இயங்க PCAPDroid ஐ அனுமதிக்கிறது

source: Donate
ta: நன்கொடை

# app_log
source: Log
ta: பதிவு

source: No data
ta: தரவு இல்லை

source: Search…
ta: தேடுங்கள்…

# app_val
source: App: %1$s
ta: பயன்பாடு: %1$s

# ip_address_val
source: IP address: %1$s
ta: ஐபி முகவரி: %1$s

# host_val
source: Host: %1$s
ta: ஓச்ட்: %1$s

# protocol_val
source: Protocol: %1$s
ta: நெறிமுறை: %1$s

# malware_whitelist_action
source: Whitelist (malware)…
ta: அனுமதிப்பட்டியல் (தீம்பொருள்)…

source: Hide…
ta: மறை…

# n_selected
source: %1$d selected
ta: %1$d தேர்ந்தெடுக்கப்பட்டது

source: Select all
ta: அனைத்தையும் தெரிவுசெய்

source: App details
ta: பயன்பாட்டு விவரங்கள்

source: Package name
ta: தொகுப்பு பெயர்

# app_name
source: Name
ta: பெயர்

source: Version
ta: பதிப்பு

source: Target SDK
ta: இலக்கு SDK

source: Installed on
ta: நிறுவப்பட்டுள்ளது

source: Last update
ta: கடைசி புதுப்பிப்பு

source: Permissions
ta: அனுமதிகள்

# root_app_info
source: System daemons running with maximum privileges
ta: சிச்டம் டீமன்கள் அதிகபட்ச சலுகைகளுடன் இயங்குகின்றன

# netd_app_info
source: The system daemon performing the DNS resolutions
ta: டிஎன்எச் தீர்மானங்களைச் செய்யும் கணினி டீமான்

# android_app_info
source: The Android system
ta: ஆண்ட்ராய்டு அமைப்பு

# phone_app_info
source: Telephony services
ta: தொலைபேசி சேவைகள்

# unknown_app_info
source: "Unknown" marks connections whose app could not be determined
ta: "தெரியாதது" பயன்பாட்டை தீர்மானிக்க முடியாத இணைப்புகளைக் குறிக்கிறது

source: Packets dropped
ta: பாக்கெட்டுகள் கைவிடப்பட்டன

# capture_prefs
source: Capture
ta: பிடிப்பு

# dump_extensions
source: PCAPdroid extensions
ta: Pcapdroid நீட்டிப்புகள்

# dump_extensions_summary
source: Extend the packet dump format with additional metadata, such as the app which sent/received a given packet
ta: கொடுக்கப்பட்ட பாக்கெட்டை அனுப்பிய/பெற்ற பயன்பாடு போன்ற கூடுதல் மெட்டாடேட்டாவுடன் பாக்கெட் டம்ப் வடிவமைப்பை நீட்டிக்கவும்

# dump_extensions_how_to
source: How to display the PCAPdroid dump extensions in Wireshark
ta: வயர்சார்க்கில் பி.சி.ஏ.பி டிராய்டு டம்ப் நீட்டிப்புகளை எவ்வாறு காண்பிப்பது

# pending_transaction
source: Please complete your transaction to redeem this feature
ta: இந்த அம்சத்தை மீட்டெடுக்க உங்கள் பரிவர்த்தனையை முடிக்கவும்

# ctrl_consent
source: An app wants to capture your device traffic. Deny it if you are not sure
ta: ஒரு பயன்பாடு உங்கள் சாதன போக்குவரத்தை கைப்பற்ற விரும்புகிறது. உங்களுக்கு உறுதியாக தெரியவில்லை என்றால் அதை மறுக்கவும்

source: Deny
ta: மறுக்கவும்

source: Allow
ta: இசைவு

# ctrl_consent_title
source: PCAPdroid control request
ta: Pcapdroid கட்டுப்பாட்டு கோரிக்கை

# ctrl_consent_denied
source: PCAPdroid: the control request was denied
ta: Pcapdroid: கட்டுப்பாட்டு கோரிக்கை மறுக்கப்பட்டது

# ctrl_consent_allowed
source: PCAPdroid: the control request was allowed
ta: Pcapdroid: கட்டுப்பாட்டு கோரிக்கை அனுமதிக்கப்பட்டது

source: Capture interface
ta: இடைமுகத்தைப் பிடிக்கவும்

source: Internet
ta: இணையம்

source: All interfaces
ta: அனைத்து இடைமுகங்களும்

# capturing_from
source: Capturing packets from "%1$s"
ta: "%1$s" இலிருந்து பாக்கெட்டுகளை கைப்பற்றுதல்

source: Edit filter
ta: வடிகட்டியைத் திருத்து

source: Edit list
ta: பட்டியலைத் திருத்து

source: Hidden connections rules
ta: மறைக்கப்பட்ட இணைப்புகள் விதிகள்

# list_is_empty
source: The list is empty
ta: பட்டியல் காலியாக உள்ளது

# show_only_malicious
source: Malicious connections
ta: தீங்கிழைக்கும் இணைப்புகள்

# show_only_cleartext
source: Cleartext connections
ta: ClearText இணைப்புகள்

source: Security
ta: பாதுகாப்பு

source: Malware detection
ta: தீம்பொருள் கண்டறிதல்

# malware_detection_summary
source: Detect connections to known malicious hosts via third-party blacklists
ta: மூன்றாம் தரப்பு தடுப்புப்பட்டியல் வழியாக அறியப்பட்ட தீங்கிழைக்கும் புரவலர்களுக்கான இணைப்பைக் கண்டறியவும்

source: Reset
ta: மீட்டமை

source: Malware whitelist rules
ta: தீம்பொருள் அனுமதிப்பட்டியல் விதிகள்

# feature_not_available
source: This feature is currently unavailable for your device
ta: இந்த நற்பொருத்தம் தற்போது உங்கள் சாதனத்திற்கு கிடைக்கவில்லை

# billing_connecting
source: The connection to Google Play is in progress, please retry in a while
ta: Google Play க்கான இணைப்பு நடந்து வருகிறது, தயவுசெய்து சிறிது நேரத்தில் மீண்டும் முயற்சிக்கவும்

# malware_whitelist_help
source: User-defined whitelist to inhibit malware detection. Long-press malicious connections to create rules unmarking them as malware
ta: தீம்பொருள் கண்டறிதலைத் தடுக்க பயனர் வரையறுக்கப்பட்ட அனுமதிப்பட்டியலாளர். தீங்கிழைக்கும் தீங்கிழைக்கும் இணைப்புகளை தீம்பொருள் எனக் குறைக்கும் விதிகளை உருவாக்க நீண்ட அழுத்தமாக இருக்கும்

# hidden_connections_help
source: List of rules to hide connection-list entries so you can focus on relevant ones
ta: இணைப்பு-பட்டியல் உள்ளீடுகளை மறைக்க விதிகளின் பட்டியல், எனவே நீங்கள் தொடர்புடையவற்றில் கவனம் செலுத்தலாம்

# malicious_connection_filter
source: Malicious
ta: தீங்கிழைக்கும்

# status_filter
source: Status: %1$s
ta: நிலை: %1$s

# not_hidden_filter
source: Not hidden
ta: மறைக்கப்படவில்லை

# copy_action
source: Copy…
ta: நகலெடு…

source: Show me
ta: என்னைக் காட்டு

source: Hint
ta: குறிப்பு

source: Once
ta: ஒருமுறை

source: Forever
ta: என்றென்றும்

source: Control permissions
ta: கட்டுப்பாட்டு அனுமதிகள்

# control_permissions_summary
source: Check which apps are allowed to control the PCAPdroid capture
ta: பி.சி.ஏ.பி டிராய்டு பிடிப்பைக் கட்டுப்படுத்த எந்த பயன்பாடுகள் அனுமதிக்கப்படுகின்றன என்பதைச் சரிபார்க்கவும்

# no_permissions_set_info
source: No permissions set. Invoke PCAPdroid via StartActivityForResult to show the permissions prompt
ta: அனுமதிகள் எதுவும் அமைக்கப்படவில்லை. அனுமதிகள் வரியில் காட்ட StartactivityForresult வழியாக PCAPDROID ஐ அழைக்கவும்

source: Generate API key
ta: பநிஇ விசையை உருவாக்குங்கள்

source: Show API key
ta: பநிஇ விசையை காட்டு

source: API key
ta: பநிஇ விசை

# api_key_discard_confirm
source: Do you really want to discard the current API key and generate a new one?
ta: தற்போதைய பநிஇ விசையை நிராகரித்து புதிய ஒன்றை உருவாக்க விரும்புகிறீர்களா?

source: Country
ta: நாடு

# country_val
source: Country: %1$s
ta: நாடு: %1$s

source: Send report
ta: அறிக்கை அனுப்பவும்

source: Start at boot
ta: துவக்கத்தில் தொடங்கவும்

# start_at_boot_summary
source: Auto-starts capture after boot
ta: துவக்கத்திற்குப் பிறகு ஆட்டோ-ச்டார்ட்ச் பிடிப்பு

# malware_status_ok
source: No malicious traffic detected
ta: தீங்கிழைக்கும் போக்குவரத்து எதுவும் கண்டறியப்படவில்லை

# malware_status_detected
source: Malicious connections detected
ta: தீங்கிழைக்கும் இணைப்புகள் கண்டறியப்பட்டன

source: Whitelist
ta: அனுமதிப்பட்டியலாளர்

source: Blacklists
ta: தடுப்புப்பட்டியல்

# status_outdated
source: Outdated
ta: காலாவதியான

# status_not_loaded
source: Not loaded
ta: ஏற்றப்படவில்லை

# status_uptodate
source: Up-to-date
ta: புதுப்பித்த

# blacklist_type
source: Type: %1$s
ta: வகை: %1$s

# blacklist_type_ip
source: IP blacklist
ta: ஐபி பிளாக்லிச்ட்

# blacklist_type_domain
source: Domain blacklist
ta: டொமைன் பிளாக்லிச்ட்

# n_rules
source: %1$s rules
ta: %1$s விதிகள்

# last_update_val
source: Last update: %1$s
ta: கடைசி புதுப்பிப்பு: %1$s

source: Malicious connections
ta: தீங்கிழைக்கும் இணைப்புகள்

# malicious_connection_description
source: A connection from app "%1$s" triggered a malware detection rule (%2$s)
ta: பயன்பாட்டின் "%1$s" இன் இணைப்பு தீம்பொருள் கண்டறிதல் விதியைத் தூண்டியது (%2$s)

# malicious_connections_notice
source: Blacklists may contain false positives. Be sure to double check the IP address/domain reputation online. You can exclude false positives via the malware whitelist
ta: தடுப்புப்பட்டியலில் தவறான நேர்மறைகள் இருக்கலாம். ஐபி முகவரி/டொமைன் நற்பெயரை ஆன்லைனில் இருமுறை சரிபார்க்கவும். தீம்பொருள் வைட்லிச்ட் வழியாக தவறான நேர்மறைகளை நீங்கள் விலக்கலாம்

source: Updated blacklists
ta: புதுப்பிக்கப்பட்ட தடுப்புப்பட்டிகள்

source: Connections checked
ta: இணைப்புகள் சரிபார்க்கப்பட்டன

# last_blacklists_update
source: Last update
ta: கடைசி புதுப்பிப்பு

source: Domain rules
ta: டொமைன் விதிகள்

source: IP rules
ta: ஐபி விதிகள்

# malware_status_update_failed
source: Some blacklists are outdated
ta: சில தடுப்புப்பட்டியல்கள் காலாவதியானவை

source: Update now
ta: இப்போது புதுப்பிக்கவும்

# status_updating
source: Updating…
ta: புதுப்பித்தல்…

# malware_detection_learn_more
source: Learn more about the malware detection feature
ta: தீம்பொருள் கண்டறிதல் அம்சத்தைப் பற்றி மேலும் அறிக

# private_dns_message_notice
source: Private DNS prevents PCAPdroid from inspecting the DNS traffic. You can turn it off from the Android network settings
ta: தனியார் டிஎன்எச் டிஎன்எச் போக்குவரத்தை ஆய்வு செய்வதிலிருந்து பி.சி.ஏ.பி டிராய்டைத் தடுக்கிறது. நீங்கள் அதை ஆண்ட்ராய்டு பிணையம் அமைப்புகளிலிருந்து அணைக்கலாம்

source: Private DNS hinders detection
ta: தனியார் டி.என்.எச் கண்டறிதலைத் தடுக்கிறது

# decryption_no_filter_warn
source: Select a target app when decrypting TLS to avoid losing your connection to the Internet
ta: இணையத்துடனான உங்கள் தொடர்பை இழப்பதைத் தவிர்க்க TLS ஐ மறைகுறியாக்கும்போது இலக்கு பயன்பாட்டைத் தேர்ந்தெடுக்கவும்

source: Block…
ta: தொகுதி…

source: Unblock…
ta: தடை செய்யுங்கள்…

source: Firewall
ta: ஃபயர்வால்

source: Firewall rules
ta: ஃபயர்வால் விதிகள்

# blocked_pkts
source: Blocked
ta: தடுக்கப்பட்டது

# blocked_connection_filter
source: Blocked
ta: தடுக்கப்பட்டது

# allowed_connection_filter
source: Allowed
ta: அனுமதிக்கப்படுகிறது

# firewall_filter
source: Firewall: %1$s
ta: ஃபயர்வால்: %1$s

source: Paid features
ta: கட்டண நற்பொருத்தங்கள்

source: Validate
ta: சரிபார்க்கவும்

source: Valid
ta: செல்லுபடியாகும்

source: Invalid
ta: செல்லுபடியாகாத

# no_intent_handler_found
source: No app found to perform this action
ta: இந்த செயலைச் செய்ய எந்த பயன்பாடும் கிடைக்கவில்லை

# network_interface
source: Interface
ta: இடைமுகம்

# interface_filter
source: Interface: %1$s
ta: இடைமுகம்: %1$s

source: Loading…
ta: ஏற்றுகிறது…

source: Purchased
ta: வாங்கப்பட்டது

# no_items_for_purchase
source: No items available for purchase
ta: வாங்குவதற்கு எந்த பொருட்களும் கிடைக்கவில்லை

# billing_failure
source: Could not connect to Google Play. Please retry in a while
ta: Google Play உடன் இணைக்க முடியவில்லை. சிறிது நேரத்தில் மீண்டும் முயற்சிக்கவும்

source: Learn more
ta: மேலும் அறிக

# buy_action
source: Buy
ta: வாங்க

# capture_not_running_status
source: The capture is not running
ta: பிடிப்பு இயங்கவில்லை

# start_capture_first
source: Start the capture first
ta: முதலில் பிடிப்பைத் தொடங்குங்கள்

source: Copied
ta: நகலெடுக்கப்பட்டது

# can_use_purchased_feature
source: You can now use the purchased feature
ta: நீங்கள் இப்போது வாங்கிய அம்சத்தைப் பயன்படுத்தலாம்

# disconnect_vpn_confirm
source: Continuing will disconnect the active VPN
ta: தொடர்வது செயலில் உள்ள VPN ஐ துண்டிக்கும்

source: Loading apps…
ta: பயன்பாடுகளை ஏற்றுகிறது…

# open_nav_drawer
source: Open drawer
ta: திறந்த அலமாரியை

# close_nav_drawer
source: Close drawer
ta: மூடு அலமாரியை மூடு

# capture_all_apps
source: Capture the traffic of all the apps
ta: அனைத்து பயன்பாடுகளின் போக்குவரத்தையும் கைப்பற்றவும்

# save_ok
source: Saved
ta: சேமிக்கப்பட்டது

source: TLS decryption
ta: டி.எல்.எச் மறைகுறியாக்கம்

# tls_decryption_summary
source: Decrypt the SSL/TLS traffic by performing mitm. This may now work with some apps, check out the user guide
ta: எம்ஐடிஎம் செய்வதன் மூலம் எச்எச்எல்/டிஎல்எச் போக்குவரத்தை டிக்ரிப்ட் செய்யுங்கள். இது இப்போது சில பயன்பாடுகளுடன் வேலை செய்யலாம், பயனர் வழிகாட்டியைப் பாருங்கள்

source: Traffic inspection
ta: போக்குவரத்து ஆய்வு

# mitm_start_failed
source: Could not start the mitm service. Try to open the mitm addon app manually and retry
ta: MITM சேவையைத் தொடங்க முடியவில்லை. MITM ADDON பயன்பாட்டை கைமுறையாக திறந்து மீண்டும் முயற்சிக்கவும்

source: Mitm setup wizard
ta: எம்ஐடிஎம் அமைவு வழிகாட்டி

# install_action
source: Install
ta: நிறுவவும்

# export_action
source: Export
ta: ஏற்றுமதி

# export_ellipsis
source: Export…
ta: ஏற்றுமதி…

# install_the_mitm_addon
source: Install the PCAPdroid <a href="%1$s">mitm addon</a>
ta: PCAPDroid <a href="%1$s"> MITM addon </a> ஐ நிறுவவும்
