Repository: 247i/TACETr
Catalog: உரை/தானி/pftpd-pftpd-*.po
Languages: ta

# app_name
source: primitive ftpd
ta: பழமையான FTPD

# ifacesLabel
source: Network Interface
ta: பிணைய இடைமுகம்

# ipAddrLabel
source: IP Address
ta: ஐபி முகவரி

# ifacesError
source: Error:
ta: பிழை:

# protocolLabel
source: Protocol
ta: நெறிமுறை

# portLabel
source: Port
ta: துறைமுகம்

# fingerprintsLabel
source: Key Fingerprints
ta: முக்கிய கைரேகைகள்

# allKeysFingerprintsLabel
source: Show fingerprints of all keys
ta: எல்லா விசைகளின் கைரேகைகளையும் காட்டு

# generateKeysMessage
source: Generate Keys?
ta: விசைகளை உருவாக்கவா?

# generatingKeysMessage
source: Generating Keys …
ta: விசைகளை உருவாக்கும்…

source: Generate
ta: உருவாக்கு

source: Cancel
ta: ரத்துசெய்

# pubkeyAuthKeysHeading
source: Keys for public key auth
ta: பொது விசை அங்கீகாரத்திற்கான விசைகள்

# addPubkeyForAuth
source: Add public key for auth
ta: அங்கீகாரத்திற்கு பொது விசையைச் சேர்க்கவும்

# pubkeyInvalid
source: Input is not a valid key, has been ignored.
ta: உள்ளீடு சரியான விசை அல்ல, புறக்கணிக்கப்பட்டுள்ளது.

source: No keys present.
ta: விசைகள் இல்லை.

source: State
ta: மாநிலம்

# serverStarted
source: Running …
ta: ஓடுகிறது…

# serverStopped
source: Stopped
ta: நிறுத்தப்பட்டது

# permissionRequired
source: "%1$s" permission is required for this app to work!
ta: இந்த பயன்பாடு வேலை செய்ய "%1$s" இசைவு தேவை!

# permissionNameStorage
source: Storage
ta: சேமிப்பு

# quickSettingsServerStarted
source: pFTPd Running …
ta: pftpd இயங்கும்…

# quickSettingsServerStopped
source: pFTPd Stopped
ta: PFTPD நிறுத்தப்பட்டது

source: Save as
ta: என சேமி

# startService
source: Start Server
ta: சேவையகத்தைத் தொடங்குங்கள்

# stopService
source: Stop Server
ta: சேவையகத்தை நிறுத்து

# toggleService
source: Toggle Server start/stop
ta: சேவையக தொடக்க/நிறுத்தம்

# notificationTitle
source: FTP Server
ta: FTP சேவையகம்

# haveToSetAuthMechanism
source: You have to set an authentication mechanism first
ta: நீங்கள் முதலில் ஒரு அங்கீகார பொறிமுறையை அமைக்க வேண்டும்

# serverRunning
source: FTP Server is running
ta: FTP சேவையகம் இயங்குகிறது

# serverCouldNotBeStarted
source: Server could not be started! Error message:
ta: சேவையகத்தைத் தொடங்க முடியவில்லை! பிழை செய்தி:

# portInvalid_v2
source: Port value is invalid. Must be between 1024 and 64000.
ta: துறைமுக மதிப்பு தவறானது. 1024 முதல் 64000 வரை இருக்க வேண்டும்.

# portsEqual_v2
source: Ports are equal. This cannot work.
ta: துறைமுகங்கள் சமம். இது வேலை செய்ய முடியாது.

# restartServer
source: Restart the server for your changes to take effect.
ta: உங்கள் மாற்றங்கள் நடைமுறைக்கு வர சேவையகத்தை மறுதொடக்கம் செய்யுங்கள்.

# couldNotReadKeyAuthKey
source: Public key for key authentication could not be read. Check logs.
ta: முக்கிய அங்கீகாரத்திற்கான பொது விசையைப் படிக்க முடியவில்லை. பதிவுகளை சரிபார்க்கவும்.

# ftpPassivePortsInvalid
source: Value of FTP Passive Ports is invalid.
ta: FTP செயலற்ற துறைமுகங்களின் மதிப்பு தவறானது.

# prefs
source: Preferences
ta: விருப்பத்தேர்வுகள்

# prefsCategoryTitleAuth
source: Authentification
ta: ஏற்பு

# prefsCategoryTitleConnectivity
source: Connectivity
ta: இணைப்பு

# prefsCategoryTitleUi
source: UI
ta: இடைமுகம்

# prefsCategoryTitleSystem
source: System
ta: மண்டலம்

# prefTitleUser
source: Username
ta: பயனர்பெயர்

# prefSummaryUser
source: FTP-server username
ta: FTP-SERVER பயனர்பெயர்

# prefTitlePassword
source: Password
ta: கடவுச்சொல்

# prefSummaryPassword
source: FTP server password
ta: FTP சேவையக கடவுச்சொல்

# prefTitlePort
source: Port
ta: துறைமுகம்

# prefSummaryPort
source: FTP server port
ta: FTP சேவையக துறைமுகம்

# prefTitlePortSecure
source: Secure Port
ta: பாதுகாப்பான துறைமுகம்

# prefSummaryPortSecure
source: FTP server port (encrypted)
ta: FTP சேவையக துறைமுகம் (குறியாக்கம் செய்யப்பட்டது)

# prefBindIp
source: IP to bind to
ta: பிணைக்க ஐபி

# prefSummaryBindIp
source: If you want servers to listen on one interface only.
ta: சேவையகங்கள் ஒரு இடைமுகத்தில் மட்டுமே கேட்க விரும்பினால்.

# prefTitleStartDir
source: Server Start Directory
ta: சேவையக தொடக்க அடைவு

# prefSummaryStartDir
source: First directory after login
ta: உள்நுழைந்த பிறகு முதல் அடைவு

# prefTitleAnnounce
source: Announce server in LAN
ta: LAN இல் சேவையகத்தை அறிவிக்கவும்

# prefSummaryAnnounce
source: Announces FTP server in LAN via DNS-SD (Bonjour). May cause crashes on some devices.
ta: டி.என்.எச்-எச்.டி (போன்சோர்) வழியாக LAN இல் FTP சேவையகத்தை அறிவிக்கிறது. சில சாதனங்களில் செயலிழப்பை ஏற்படுத்தக்கூடும்.

# prefTitleAnnounceName
source: Servername
ta: சேவையகம்

# prefSummaryAnnounceName
source: Name to announce server with.
ta: சேவையகத்தை அறிவிக்க பெயர்.

# prefTitleWakelock
source: Prevent Standby
ta: காத்திருப்பு தடுக்கவும்

# prefSummaryWakelock
source: Prevents Standby while server is running. Standby can cause uploads/downloads to abort.
ta: சேவையகம் இயங்கும்போது காத்திருப்பு தடுக்கிறது. காத்திருப்பு பதிவேற்றங்கள்/பதிவிறக்கங்களை நிறுத்தி வைக்கலாம்.

# prefTitleWhichServerToStart
source: Server(s) to be started
ta: சேவையகம் (கள்) தொடங்கப்பட வேண்டும்

# prefSummaryWhichServerToStart
source: Choose whether to start FTP server only, SFTP server only or both.
ta: FTP சேவையகத்தை மட்டும் தொடங்க வேண்டுமா என்பதைத் தேர்வுசெய்க, SFTP சேவையகம் மட்டும் அல்லது இரண்டையும்.

# prefTitleStartOnBoot
source: Start on boot
ta: துவக்கத்தில் தொடங்கவும்

# prefSummaryStartOnBoot
source: Start server on system boot.
ta: கணினி துவக்கத்தில் சேவையகத்தைத் தொடங்குங்கள்.

# prefShowTabNames
source: Show tab names
ta: தாவல் பெயர்களைக் காட்டு

# prefSummaryShowTabNames
source: Show names on tabs in main UI
ta: முதன்மையான இடைமுகம் இல் தாவல்களில் பெயர்களைக் காட்டு

# prefTitleStartOnOpen
source: Start on open
ta: திறந்த நிலையில் தொடங்கவும்

# prefSummaryStartOnOpen
source: Start server when app is opened.
ta: பயன்பாடு திறக்கப்படும் போது சேவையகத்தைத் தொடங்குங்கள்.

# prefTitleShowConnectionInfoInNotification
source: Show connection info in notification
ta: அறிவிப்பில் இணைப்பு தகவலைக் காட்டு

# prefSummaryShowConnectionInfoInNotification
source: Shows connection info like IP address in notification.
ta: அறிவிப்பில் ஐபி முகவரி போன்ற இணைப்பு தகவலைக் காட்டுகிறது.

# prefTitleSshowIpv4InNotification
source: Show IPv4 addresses in notification
ta: ஐபிவி 4 முகவரிகளை அறிவிப்பில் காட்டு

# prefSummaryShowIpv4InNotification
source: Shows IPv4 addresses in notification if connection info is turned on.
ta: இணைப்பு செய்தி இயக்கப்பட்டால் அறிவிப்பில் IPv4 முகவரிகளைக் காட்டுகிறது.

# prefTitleSshowIpv6InNotification
source: Show IPv6 addresses in notification
ta: ஐபிவி 6 முகவரிகளை அறிவிப்பில் காட்டு

# prefSummaryShowIpv6InNotification
source: Shows IPv6 addresses in notification if connection info is turned on.
ta: இணைப்பு செய்தி இயக்கப்பட்டால் அறிவிப்பில் ஐபிவி 6 முகவரிகளைக் காட்டுகிறது.

# prefTitleShowStartStopNotification
source: Show notification to start/stop server(s)
ta: சேவையக (களை) தொடங்க/நிறுத்த அறிவிப்பைக் காட்டு

# prefSummaryShowStartStopNotification
source: Shows a notification at all time to have another quick way to start/stop server(s).
ta: சேவையக (களை) தொடங்க/நிறுத்த மற்றொரு விரைவான வழியைக் கொண்டிருப்பதற்கான எல்லா நேரத்திலும் அறிவிப்பைக் காட்டுகிறது.

# prefTitlePubKeyAuth
source: Public Key Authentication
ta: பொது விசை ஏற்பு

# prefSummaryPubKeyAuth_v2
source: When enabled place your ssh2 public key in %s. It must be a file containing one key per line. SFTP only.
ta: இயக்கப்பட்டால் உங்கள் SSH2 பொது விசையை %s இல் வைக்கவும். இது ஒரு வரிக்கு ஒரு விசையைக் கொண்ட கோப்பாக இருக்க வேண்டும். SFTP மட்டும்.

# prefTitleAnonymousLogin
source: Anonymous Login
ta: அநாமதேய உள்நுழைவு

# prefSummaryAnonymousLogin
source: Set if anonymous login is allowed on the server.
ta: சேவையகத்தில் அநாமதேய உள்நுழைவு அனுமதிக்கப்பட்டால் அமைக்கவும்.

# prefTitleFtpPassivePorts
source: FTP Passive Ports
ta: FTP செயலற்ற துறைமுகங்கள்

# prefSummaryFtpPassivePorts
source: Ports for FTP passive data connection. May be a single port, a list or range of ports. E.g. 5678,5700-5710,5800,5900.
ta: FTP செயலற்ற தரவு இணைப்பிற்கான துறைமுகங்கள். ஒற்றை துறைமுகம், ஒரு பட்டியல் அல்லது துறைமுகங்களின் வரம்பாக இருக்கலாம். எ.கா. 5678,5700-5710,5800,5900.

# prefTitleIdleTimeout
source: Server Idle Timeout
ta: சேவையக செயலற்ற நேரம் முடிந்தது

# prefTitleIdleTimeoutServerStop
source: Idle timeout to stop server
ta: சேவையகத்தை நிறுத்த செயலற்ற நேரம்

# prefSummaryIdleTimeoutServerStop
source: Server(s) will be stopped after this time in minutes if no client activity takes place. Set to 0 to disable.
ta: கிளையன்ட் செயல்பாடு எதுவும் நடக்கவில்லை என்றால் இந்த நேரத்தில் இந்த நேரத்தில் சேவையகம் (கள்) நிறுத்தப்படும். முடக்க 0 என அமைக்கவும்.

# prefSummaryIdleTimeoutV2
source: Server will terminate idle connections after this time in seconds. Set to 0 to disable.
ta: சேவையகம் இந்த நேரத்திற்குப் பிறகு செயலற்ற இணைப்புகளை நொடிகளில் நிறுத்திவிடும். முடக்க 0 என அமைக்கவும்.

# prefTitleLogging
source: Log
ta: பதிவு

# prefSummaryLoggingV2
source: Log serves analyzing of errors. If the app does not work properly on your device you can send a log to developers. May require to restart the app. Text Logs are stored in %s.
ta: பதிவு பிழைகள் பகுப்பாய்வு செய்ய உதவுகிறது. உங்கள் சாதனத்தில் பயன்பாடு சரியாக வேலை செய்யவில்லை என்றால், நீங்கள் டெவலப்பர்களுக்கு ஒரு பதிவை அனுப்பலாம். பயன்பாட்டை மறுதொடக்கம் செய்ய வேண்டியிருக்கலாம். உரை பதிவுகள் %s இல் சேமிக்கப்படுகின்றன.

# prefAllowedIpsPattern
source: Allowed IPs pattern
ta: ஐபிஎச் முறை அனுமதிக்கப்பட்டுள்ளது

# prefSummaryAllowedIpsPattern
source: Pattern of allowed IP Addresses. Just one Wildcard (*) may be used, as last character only.
ta: அனுமதிக்கப்பட்ட ஐபி முகவரிகளின் முறை. ஒரு காடு அட்டை (*) கடைசி எழுத்தாக மட்டுமே பயன்படுத்தப்படலாம்.

# prefTitleQuickSettingsRequiresUnlock
source: Quick Settings Tile unlock requirement
ta: விரைவான அமைப்புகள் ஓடு திறத்தல் தேவை

# prefSummaryQuickSettingsRequiresUnlock
source: Clicking the quick settings tile requires the device to be unlocked to start/stop the server. When enabled, will prompt to unlock the device if it's locked.
ta: விரைவான அமைப்புகள் ஓடைக் சொடுக்கு செய்வதன் மூலம் சேவையகத்தைத் தொடங்க/நிறுத்த சாதனம் திறக்கப்பட வேண்டும். இயக்கப்பட்டால், சாதனம் பூட்டப்பட்டால் அதைத் திறக்கும்படி கேட்கும்.

# prefRootCopyFiles
source: Root: copy files to tmp dir for up-/download
ta: ரூட்: UP-/பதிவிறக்குவதற்காக கோப்புகளை TMP அடைவு க்கு நகலெடுக்கவும்

# prefSummaryRootCopyFiles
source: There are issues accessing files with dd on some devices. With this setting files are copied to tmp dir first and access with filesystem mechanisms. Should be disabled for large files.
ta: சில சாதனங்களில் டி.டி.யுடன் கோப்புகளை அணுகுவதில் சிக்கல்கள் உள்ளன. இந்த அமைப்பின் மூலம் கோப்புகள் முதலில் TMP அடைவு க்கு நகலெடுக்கப்பட்டு கோப்பு முறைமை வழிமுறைகளுடன் அணுகலாம். பெரிய கோப்புகளுக்கு முடக்கப்பட வேண்டும்.

# prefHostkeyAlgos
source: SFTP Hostkey algorithms
ta: SFTP ஓச்ட்கி வழிமுறைகள்

# prefSummaryHostkeyAlgos
source: Algorithms to generate SFTP server keys (hostkeys) for
ta: SFTP சேவையக விசைகள் (ஓச்ட்கீ) உருவாக்க வழிமுறைகள்

source: Licence
ta: உரிமம்

source: Reset
ta: மீட்டமை

# widgetTextStart
source: start (s)ftpd
ta: தொடக்க (கள்) ftpd

# widgetTextStop
source: stop (s)ftpd
ta: நிறுத்து (கள்) ftpd

# isAnonymous
source: Anonymous Login: %1$b
ta: அநாமதேய உள்நுழைவு: %1 $ b

# passwordPresent
source: Password present: %1$b
ta: கடவுச்சொல் தற்போது: %1 $ b

# pubKeyAuth
source: Public key auth: %1$b
ta: பொது விசை அங்கீகாரம்: %1 $ b

source: Select Server Action
ta: சேவையக செயலைத் தேர்ந்தெடுக்கவும்

source: Is server running?
ta: சேவையகம் இயங்குகிறதா?

source: Storage Type
ta: சேமிப்பக வகை

# storageTypePlainV2
source: Plain old filesystem Got read-only access? See our <a href="https://www.github.com/wolpi/prim-ftpd/">GitHub page</a>.
ta: பழைய பழைய கோப்பு முறைமை படிக்க மட்டும் அணுகல் கிடைத்ததா? எங்கள் <a href = "https://www.github.com/wolpi/prim-ftpd/"> அறிவிலிமையம் பக்கம் </a> ஐப் பார்க்கவும்.

# storageTypeRoot
source: Super user (device must be rooted)
ta: சூப்பர் பயனர் (சாதனம் வேரூன்ற வேண்டும்)

# storageTypeSaf
source: Android Storage Access Framework (SAF) (e.g. for external SD-card)
ta: ஆண்ட்ராய்டு சேமிப்பக அணுகல் கட்டமைப்பு (SAF) (எ.கா. வெளிப்புற எச்டி-கார்டுக்கு)

# storageTypeRoSaf
source: Read only SAF (faster !)
ta: SAF ஐ மட்டும் படிக்கவும் (வேகமாக!)

# storageTypeVirtual
source: Virtual Folders (provides all Storage Types)
ta: மெய்நிகர் கோப்புறைகள் (அனைத்து சேமிப்பக வகைகளையும் வழங்குகிறது)

# safExplainHeading
source: How SAF works
ta: SAF எவ்வாறு செயல்படுகிறது

# safExplainV2
source: Android will ask you to choose a directory. That will be available via server(s). Permission gets revoked and you have to re-select regularly? See our <a href="https://www.github.com/wolpi/prim-ftpd/">GitHub page</a>.
ta: ஆண்ட்ராய்டு ஒரு கோப்பகத்தைத் தேர்வு செய்யும்படி கேட்கும். அது சேவையகம் (கள்) வழியாக கிடைக்கும். இசைவு ரத்து செய்யப்படுகிறது, நீங்கள் தவறாமல் மீண்டும் தேர்ந்தெடுக்கப்பட வேண்டுமா? எங்கள் <a href = "https://www.github.com/wolpi/prim-ftpd/"> அறிவிலிமையம் பக்கம் </a> ஐப் பார்க்கவும்.

source: Selected SAF URI:
ta: தேர்ந்தெடுக்கப்பட்ட SAF URI:

# downloadOrSaveUrlToFile
source: Download or save URL to text file?
ta: உரை கோப்பில் முகவரி ஐ பதிவிறக்கம் செய்யலாமா அல்லது சேமிக்கவா?

source: Download
ta: பதிவிறக்கம்

source: Save to text file
ta: உரை கோப்பில் சேமிக்கவும்

source: Add
ta: கூட்டு

# filepickerCreateFolderError
source: Could not create folder
ta: கோப்புறையை உருவாக்க முடியவில்லை

# filepickerNewFolder
source: New folder
ta: புதிய கோப்புறை

# filepickerNewFolderOk
source: @android:string/ok
ta: @android: சரம்/சரி

# filepickerNewFolderCancel
source: @android:string/cancel
ta: @android: சரம்/ரத்துசெய்

# filepickerListOk
source: @android:string/ok
ta: @android: சரம்/சரி

# filepickerListCancel
source: @android:string/cancel
ta: @android: சரம்/ரத்துசெய்

# filepickerName
source: Name
ta: பெயர்

# filepickerFilename
source: Filename
ta: கோப்புப்பெயர்

# filepickerSelectSomethingFirst
source: Please select something first
ta: முதலில் ஏதாவது ஒன்றைத் தேர்ந்தெடுக்கவும்

source: Quick Share
ta: விரைவான பங்கு

# quickShareServerStarted
source: Server has been started sharing single file
ta: சேவையகம் ஒற்றை கோப்பைப் பகிரத் தொடங்கப்பட்டது

# quickShareInfoNotificationV2
source: QuickShare with %1d file(s)
ta: %1D கோப்பு (கள்) உடன் விரைவுசேர்

# quickShareInfoActivityV2
source: Running in QuickShare Mode for %1d file(s)
ta: %1d கோப்பு (கள்) க்கான குயிக்சேர் பயன்முறையில் இயங்குகிறது

# clientActionsLabel
source: Client Action Log
ta: கிளையன்ட் செயல் பதிவு

# statsLabel
source: Stats
ta: புள்ளிவிவரங்கள்

# statsTotalSent
source: Total Sent
ta: மொத்தம் அனுப்பப்பட்டது

# statsTotalReceived
source: Total Received
ta: மொத்தம் பெறப்பட்டது

# statsSentPerSec
source: Sent per second
ta: ஒரு நொடிக்கு அனுப்பப்பட்டது

# statsReceivedPerSec
source: Received per second
ta: ஒரு நொடிக்கு பெறப்பட்டது

# hasFullAccessToStorage
source: Has full access to storage: %1$b
ta: சேமிப்பகத்திற்கான முழு அணுகல் உள்ளது: %1 $ b

# hasNormalAccessToStorage
source: Has (normal) access to storage: %1$b
ta: சேமிப்பிற்கான (இயல்பான) அணுகல் உள்ளது: %1 $ b

# hasAccessToMediaLocation
source: Has access to media location (geo data): %1$b
ta: மீடியா இருப்பிடத்திற்கான அணுகல் உள்ளது (சியோ தரவு): %1 $ b

# hasNotificationPermission
source: Has permission to show notifications: %1$b
ta: அறிவிப்புகளைக் காட்ட இசைவு உள்ளது: %1 $ b

source: Request
ta: கோரிக்கை

source: QuickShare files:
ta: குயிக்சேர் கோப்புகள்:

source: Log files:
ta: பதிவு கோப்புகள்:

# rootTmpFiles
source: Temp files of root access:
ta: ரூட் அணுகலின் தற்காலிக கோப்புகள்:

source: Delete
ta: நீக்கு

# mobileUiShort
source: Mobile Mode
ta: மொபைல் பயன்முறை

# mobileUiLong
source: Mobile Device Mode
ta: மொபைல் சாதன முறை

# tvUiShort
source: TV Mode
ta: டிவி பயன்முறை

# tvUiLong
source: Television Mode
ta: தொலைக்காட்சி முறை

# iconKeysFingerprints
source: Keys Fingerprints
ta: விசைகள் கைரேகைகள்

# iconCleanSpace
source: Clean Space
ta: தூய்மையான இடம்

# iconAbout
source: About
ta: பற்றி

# qrFallback
source: no network interfaces, no IP addresses, no QR code
ta: பிணைய இடைமுகங்கள் இல்லை, ஐபி முகவரிகள் இல்லை, QR குறியீடு இல்லை
