Repository: 247i/TACETr
Catalog: உரை/தானி/photini-gui-*.po
Languages: ta

# AddressTab
source: Get address from lat, long
ta: லாட், லாங் முகவரியைப் பெறுங்கள்

# AddressTab
source: camera
ta: கேமரா

# AddressTab
source: Enter the details about a location where this image was created.
ta: இந்த படம் உருவாக்கப்பட்ட இடம் குறித்த விவரங்களை உள்ளிடவும்.

# AddressTab
source: Enter the details about a location which is shown in this image.
ta: இந்த படத்தில் காட்டப்பட்டுள்ள இடம் குறித்த விவரங்களை உள்ளிடவும்.

# AddressTab
source: Address lookup powered by OpenCage
ta: ஒப்சேச் மூலம் இயக்கப்படும் முகவரி தேடல்

# AddressTab
source: Geodata © OpenStreetMap contributors
ta: சியோடேட்டா © ஓபன்ச்ட்ரீட்மேப் பங்களிப்பாளர்கள்

# AddressTab
source: Enter a full name of the location.
ta: இருப்பிடத்தின் முழு பெயரை உள்ளிடவும்.

# AddressTab
source: Enter the name of the sublocation.
ta: துணைப்பிரிவின் பெயரை உள்ளிடவும்.

# AddressTab
source: Enter the name of the city.
ta: நகரத்தின் பெயரை உள்ளிடவும்.

# AddressTab
source: Enter the name of the province or state.
ta: மாகாணம் அல்லது மாநிலத்தின் பெயரை உள்ளிடவும்.

# AddressTab
source: Enter the name of the country.
ta: நாட்டின் பெயரை உள்ளிடவும்.

# AddressTab
source: Enter the 2 or 3 letter ISO 3166 country code of the country.
ta: 2 அல்லது 3 கடிதம் ஐஎச்ஓ 3166 நாட்டின் நாட்டுக் குறியீட்டை உள்ளிடவும்.

# AddressTab
source: Enter the name of the world region.
ta: உலக பிராந்தியத்தின் பெயரை உள்ளிடவும்.

# AddressTab
source: Enter globally unique identifier(s) of the location. Separate them with ";" characters.
ta: இருப்பிடத்தின் உலகளாவிய தனித்துவமான அடையாளங்காட்டி (களை) உள்ளிடவும். அவற்றை ""; " எழுத்துக்கள்.

# AddressTab
source: Name
ta: பெயர்

# AddressTab
source: Street
ta: தெரு

# AddressTab
source: City
ta: நகரம்

# AddressTab
source: Province
ta: மாகாணம்

# AddressTab
source: Country
ta: நாடு

# AddressTab
source: Region
ta: பகுதி

# AddressTab
source: Location ID
ta: இருப்பிட ஐடி

# AddressTab
source: All "{tab}" address data
ta: அனைத்து "{tab}" முகவரி தரவு

# AddressTab
source: All "subject" addresses
ta: அனைத்து "பொருள்" முகவரிகள்

# AddressTab Full name of tab shown as a tooltip
source: Location addresses
ta: இருப்பிட முகவரிகள்

# AddressTab Shortest possible name used as tab label
source: &Address
ta: & முகவரி

# AddressTab
source: subject {idx}
ta: பொருள் {idx}

# AltitudeDisplay metres altitude
source: m
ta: மீ

# AltitudeDisplay
source: Altitude of the location in metres.
ta: மீட்டரில் இருப்பிடத்தின் உயரம்.

# AltitudeDisplay
source: Altitude
ta: குத்துயரம்

# CLIHelp
source: Usage: %prog [options] [file_name, ...]
ta: பயன்பாடு: %prog [விருப்பங்கள்] [file_name, ...]

# CLIHelp
source: Photini photo metadata editor
ta: ஃபோட்டினி புகைப்பட மேனிலை தரவு எடிட்டர்

# CLIHelp
source: test new features or API versions
ta: புதிய நற்பொருத்தங்கள் அல்லது பநிஇ பதிப்புகளை சோதிக்கவும்

# CLIHelp
source: increase number of logging messages
ta: பதிவு செய்திகளின் எண்ணிக்கையை அதிகரிக்கவும்

# CLIHelp
source: restore config from a backup
ta: காப்புப்பிரதியிலிருந்து கட்டமைப்பை மீட்டெடுங்கள்

# DescriptiveTab
source: reject
ta: நிராகரிக்கவும்

# DescriptiveTab
source: <favourites>
ta: <பிடித்தவை>

# DescriptiveTab Full name of tab shown as a tooltip
source: Descriptive metadata
ta: விளக்க மேனிலை தரவு

# DescriptiveTab Shortest possible name used as tab label
source: &Descriptive
ta: & விளக்கமான

# DescriptiveTab
source: Enter a short verbal and human readable name for the image, this may be the file name.
ta: படத்திற்கு ஒரு குறுகிய வாய்மொழி மற்றும் மனித படிக்கக்கூடிய பெயரை உள்ளிடவும், இது கோப்பு பெயராக இருக்கலாம்.

# DescriptiveTab
source: Title / Object Name
ta: தலைப்பு / பொருள் பெயர்

# DescriptiveTab
source: Enter a brief publishable synopsis or summary of the contents of the image.
ta: படத்தின் உள்ளடக்கங்களின் சுருக்கமான வெளியிடக்கூடிய சுருக்கம் அல்லது சுருக்கத்தை உள்ளிடவும்.

# DescriptiveTab
source: Headline
ta: தலைப்புவரி

# DescriptiveTab
source: Description / Caption
ta: விளக்கம் / தலைப்பு

# DescriptiveTab
source: Enter the name(s) of the person(s) shown in this image. Separate them with ";" characters.
ta: இந்த படத்தில் காட்டப்பட்டுள்ள நபரின் (கள்) பெயர் (கள்) உள்ளிடவும். அவற்றை ""; " எழுத்துக்கள்.

# DescriptiveTab
source: Person(s) shown
ta: நபர் (கள்) காட்டப்பட்டுள்ளது

# DescriptiveTab
source: Keywords
ta: முக்கிய வார்த்தைகள்

# DescriptiveTab
source: Rating
ta: செயல்வரம்பு

# DescriptiveTab
source: Enter a "caption" describing the who, what, and why of what is happening in this image, this might include names of people, and/or their role in the action that is taking place within the image.
ta: இந்த படத்தில் யார், என்ன, ஏன் நடக்கிறது என்பதை விவரிக்கும் ஒரு "தலைப்பை" உள்ளிடவும், இதில் நபர்களின் பெயர்கள், மற்றும்/அல்லது படத்திற்குள் நடைபெறும் செயலில் அவர்களின் பங்கு இருக்கலாம்.

# DescriptiveTab
source: Enter any number of keywords, terms or phrases used to express the subject matter in the image. Separate them with ";" characters.
ta: படத்தில் உள்ள விசயத்தை வெளிப்படுத்த பயன்படுத்தப்படும் எந்தவொரு முக்கிய வார்த்தைகள், விதிமுறைகள் அல்லது சொற்றொடர்களை உள்ளிடவும். அவற்றை ""; " எழுத்துக்கள்.

# DescriptiveTab
source: Enter text describing the appearance of the image from a visual perspective, focusing on details that are relevant to the purpose and meaning of the image.
ta: படத்தின் தோற்றத்தை ஒரு காட்சி கண்ணோட்டத்தில் விவரிக்கும் உரையை உள்ளிடவும், படத்தின் நோக்கம் மற்றும் பொருளுக்கு பொருத்தமான விவரங்களில் கவனம் செலுத்துகிறது.

# DescriptiveTab
source: A more detailed textual description of the purpose and meaning of an image that elaborates on the information provided by the Alt Text (Accessibility) property. This property does not have a character limitation and is not required if the Alt Text (Accessibility) field sufficiently describes the image..
ta: மாற்று உரை (அணுகல்) சொத்து வழங்கிய தகவல்களை விரிவாகக் கூறும் படத்தின் நோக்கம் மற்றும் பொருள் பற்றிய விரிவான உரை விளக்கம். இந்த சொத்துக்கு எழுத்து வரம்பு இல்லை மற்றும் மாற்று உரை (அணுகல்) புலம் படத்தை போதுமான அளவு விவரித்தால் தேவையில்லை ..

# DescriptiveTab
source: Alt Text (Accessibility)
ta: மாற்று உரை (அணுகல்)

# DescriptiveTab
source: Extended Description (Accessibility)
ta: நீட்டிக்கப்பட்ட விளக்கம் (அணுகல்)

# EditSettings
source: Photini: settings
ta: ஃபோட்டினி: அமைப்புகள்

# EditSettings
source: Always write
ta: எப்போதும் எழுதுங்கள்

# EditSettings
source: IPTC-IIM metadata
ta: IPTC-IIM மேனிலை தரவு

# EditSettings
source: Write if exists
ta: இருந்தால் எழுதுங்கள்

# EditSettings
source: Always delete
ta: எப்போதும் நீக்கு

# EditSettings
source: Show IPTC-IIM length limits
ta: IPTC-IIM நீள வரம்புகளைக் காட்டு

# EditSettings
source: Always create
ta: எப்போதும் உருவாக்கு

# EditSettings
source: Sidecar files
ta: பக்கவாட்டு கோப்புகள்

# EditSettings
source: Create if necessary
ta: தேவைப்பட்டால் உருவாக்கவும்

# EditSettings
source: Delete when possible
ta: முடிந்தவரை நீக்கு

# EditSettings
source: (when possible)
ta: (முடிந்தால்)

# EditSettings
source: Write to image file
ta: படக் கோப்புக்கு எழுதுங்கள்

# EditSettings
source: Keep original
ta: அசல் வைத்திருங்கள்

# EditSettings
source: File timestamps
ta: நேர முத்திரைகள் கோப்பு

# EditSettings
source: Set to when photo was taken
ta: புகைப்படம் எடுக்கப்பட்டபோது அமைக்கவும்

# EditSettings
source: Set to when file is saved
ta: கோப்பு சேமிக்கப்படும் போது அமைக்கவும்

# EditSettings
source: set altitude
ta: உயரத்தை அமைக்கவும்

# EditSettings
source: GPX importer
ta: சிபிஎக்ச் இறக்குமதியாளர்

# EditSettings
source: location pin (selected)
ta: இருப்பிட முள் (தேர்ந்தெடுக்கப்பட்டது)

# EditSettings
source: Map icon colours
ta: வரைபட படவுரு வண்ணங்கள்

# EditSettings
source: location pin (unselected)
ta: இருப்பிட முள் (தேர்வு செய்யப்படாதது)

# EditSettings
source: GPS track point (selected)
ta: சி.பி.எச் டிராக் பாயிண்ட் (தேர்ந்தெடுக்கப்பட்டது)

# EditSettings
source: GPS track point (unselected)
ta: சி.பி.எச் டிராக் பாயிண்ட் (தேர்வு செய்யப்படாதது)

# EditSettings
source: Qt package
ta: கியுடி தொகுப்பு

# EditSettings
source: Photini: restart required
ta: ஃபோட்டினி: மறுதொடக்கம் தேவை

# EditSettings
source: Restart required.
ta: மறுதொடக்கம் தேவை.

# EditSettings
source: The change of Qt package will take effect when Photini is restarted.
ta: ஃபோட்டினி மறுதொடக்கம் செய்யப்படும்போது கியுடி தொகுப்பின் மாற்றம் நடைமுறைக்கு வரும்.

# EditSettings
source: Photini: map keys
ta: ஃபோட்டினி: வரைபட விசைகள்

# EditSettings
source: Azure map
ta: நீலமான வரைபடம்

# EditSettings
source: Google map
ta: கூகுள் மேப்

# EditSettings
source: Mapbox map
ta: மேப்பாக்ச் வரைபடம்

# EditSettings
source: Address lookup (OpenCage)
ta: முகவரி தேடுதல் (OpenCage)

# FlickrTab
source: Only you
ta: நீங்கள் மட்டும்

# FlickrTab
source: Friends & family
ta: நண்பர்கள் & குடும்பத்தினர்

# FlickrTab Full name of tab shown as a tooltip
source: Flickr upload
ta: பிளிக்கர் பதிவேற்றம்

# FlickrTab Shortest possible name used as tab label
source: &Flickr
ta: & பிளிக்கர்

# FlickrTab
source: People you follow
ta: நீங்கள் பின்பற்றும் நபர்கள்

# FlickrTab
source: Any Flickr member
ta: எந்த பிளிக்கர் உறுப்பினர்

# FlickrTab
source: Flickr
ta: பிளிக்கர்

# FlickrTab
source: Public
ta: பொது

# FlickrTab
source: Private
ta: தனிப்பட்ட

# FlickrTab
source: Friends
ta: நண்பர்கள்

# FlickrTab
source: Family
ta: குடும்பம்

# FlickrTab
source: Viewing privacy
ta: தனியுரிமையைப் பார்க்கிறது

# FlickrTab
source: Allow commenting
ta: கருத்து தெரிவிக்க அனுமதிக்கவும்

# FlickrTab
source: Allow tags and notes
ta: குறிச்சொற்கள் மற்றும் குறிப்புகளை அனுமதிக்கவும்

# FlickrTab
source: Licence
ta: உரிமம்

# FlickrTab
source: Safe
ta: பாதுகாப்பானது

# FlickrTab
source: Moderate
ta: மிதமான

# FlickrTab
source: Restricted
ta: தடைசெய்யப்பட்டது

# FlickrTab
source: Safety level
ta: பாதுகாப்பு நிலை

# FlickrTab
source: Hide from search
ta: தேடலில் இருந்து மறைக்கவும்

# FlickrTab
source: Photo
ta: புகைப்படம்

# FlickrTab
source: Screenshot
ta: திரைக்காட்சி

# FlickrTab
source: Art/Illustration
ta: கலை/விளக்கம்

# FlickrTab
source: Content type
ta: உள்ளடக்க வகை

# FlickrTab
source: Synchronise
ta: ஒத்திசைக்கவும்

# FlickrTab
source: New album
ta: புதிய ஆல்பம்

# FlickrTab
source: Replace metadata
ta: மெட்டாடா மாற்றவும்

# FlickrTab
source: Change viewing privacy
ta: தனியுரிமையைப் பார்ப்பதை மாற்றவும்

# FlickrTab
source: Change who can comment or tag (and viewing privacy)
ta: யார் கருத்து அல்லது குறிக்கலாம் (மற்றும் தனியுரிமையைப் பார்ப்பது)

# FlickrTab
source: Change safety level
ta: பாதுகாப்பு அளவை மாற்றவும்

# FlickrTab
source: Change hide from search
ta: தேடலில் இருந்து மறைவை மாற்றவும்

# FlickrTab
source: Change licence
ta: உரிமத்தை மாற்று

# FlickrTab
source: Change content type
ta: உள்ளடக்க வகையை மாற்றவும்

# FlickrTab
source: Change album membership
ta: ஆல்பம் உறுப்பினரை மாற்றவும்

# FlickrTab
source: Replace image region notes
ta: பட பிராந்திய குறிப்புகளை மாற்றவும்

# FlickrTab
source: Title
ta: தலைப்பு

# FlickrTab
source: Description
ta: விவரம்

# FlickrTab
source: Album will be created when photos are uploaded
ta: புகைப்படங்கள் பதிவேற்றப்படும்போது ஆல்பம் உருவாக்கப்படும்

# FlickrTab
source: Virtual Photography
ta: மெய்நிகர் புகைப்படம்

# GpxImporter
source: Import GPX file
ta: சிபிஎக்ச் கோப்பை இறக்குமதி செய்க

# GpxImporter
source: GPX files (*.gpx *.GPX *.Gpx);;All files (*)
ta: Gpx கோப்புகள் (*.gpx *.GPX *.Gpx) ;; அனைத்து கோப்புகளும் (*)

# ImageList
source: file name
ta: கோப்பு பெயர்

# ImageList
source: date taken
ta: எடுக்கப்பட்ட தேதி

# ImageList
source: Open files
ta: கோப்புகளைத் திறக்கவும்

# ImageList
source: Images ({0});;Videos ({1});;All files (*)
ta: படங்கள் ({0}) ;; வீடியோக்கள் ({1}) ;; அனைத்து கோப்புகளும் (*)

# ImageList
source: Save changes
ta: மாற்றங்களைச் சேமிக்கவும்

# ImageList
source: View changes
ta: மாற்றங்களைக் காண்க

# ImageList
source: Reload file
ta: கோப்பை மீண்டும் ஏற்று

# ImageList
source: Regenerate thumbnail
ta: சிறுபடத்தை மீண்டும் உருவாக்கவும்

# ImageList
source: Close file
ta: கோப்பை மூடு

# ImageList
source: new value
ta: புதிய மதிப்பு

# ImageList
source: undo
ta: செயல்தவிர்

# ImageList
source: old value
ta: பழைய மதிப்பு

# ImageList
source: Metadata differences: {file_name}
ta: மேனிலை தரவு வேறுபாடுகள்: {file_name}

# ImageList
source: Photini: unsaved data
ta: ஃபோட்டினி: சேமிக்கப்படாத தரவு

# ImageList
source: Some images have unsaved metadata.
ta: சில படங்களில் சேமிக்கப்படாத மேனிலை தரவு உள்ளது.

# ImageList
source: Do you want to save your changes?
ta: உங்கள் மாற்றங்களைச் சேமிக்க விரும்புகிறீர்களா?

# ImageList
source: No thumbnail in file
ta: கோப்பில் சிறுபடம் இல்லை

# ImageList
source: Sort by
ta: வரிசைப்படுத்தவும்

# ImageList
source: Thumbnail size
ta: சிறு அளவு

# ImporterTab
source: refresh
ta: புதுப்பிப்பு

# ImporterTab
source: Source
ta: மூலம்

# ImporterTab
source: Target format
ta: இலக்கு வடிவம்

# ImporterTab
source: Remove "{source_name}"
ta: "{source_name}" ஐ அகற்று

# ImporterTab
source: Select root folder
ta: ரூட் கோப்புறையைத் தேர்ந்தெடுக்கவும்

# ImporterTab
source: <select source>
ta: <மூலத்தைத் தேர்ந்தெடுக்கவும்>

# ImporterTab
source: <add a folder>
ta: <ஒரு கோப்புறையைச் சேர்க்கவும்>

# ImporterTab
source: Photini: import in progress
ta: ஃபோட்டினி: முன்னேற்றத்தில் இறக்குமதி

# ImporterTab
source: Importing photos has not finished.
ta: புகைப்படங்களை இறக்குமதி செய்வது முடிக்கப்படவில்லை.

# ImporterTab
source: Closing now will terminate the import.
ta: இப்போது மூடுவது இறக்குமதியை நிறுத்தும்.

# ImporterTab
source: Select all
ta: அனைத்தையும் தெரிவுசெய்

# ImporterTab
source: Select new
ta: புதியதைத் தேர்ந்தெடுக்கவும்

# ImporterTab
source: Move photos
ta: புகைப்படங்களை நகர்த்தவும்

# ImporterTab
source: Stop move
ta: நகர்வதை நிறுத்துங்கள்

# ImporterTab
source: Copy photos
ta: புகைப்படங்களை நகலெடுக்கவும்

# ImporterTab
source: Stop copy
ta: நகல் நிறுத்தவும்

# ImporterTab
source: camera: {camera_name}
ta: கேமரா: {camera_name}

# ImporterTab
source: folder: {folder_name}
ta: கோப்புறை: {folder_name}

# ImporterTab Full name of tab shown as a tooltip
source: Import photos
ta: புகைப்படங்களை இறக்குமதி செய்க

# ImporterTab Shortest possible name used as tab label
source: &Import
ta: & இறக்குமதி

# ImporterTab
source: %n file selected
ta: %n கோப்பு தேர்ந்தெடுக்கப்பட்டது

# IpernityTab
source: Only you
ta: நீங்கள் மட்டும்

# IpernityTab
source: Family & friends
ta: குடும்பம் & நண்பர்கள்

# IpernityTab
source: Contacts
ta: தொடர்புகள்

# IpernityTab
source: Everyone
ta: எல்லோரும்

# IpernityTab
source: Copyright (all rights reserved)
ta: பதிப்புரிமை (அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை)

# IpernityTab
source: Attribution
ta: பண்புக்கூறு

# IpernityTab
source: Attribution + non commercial
ta: பண்புக்கூறு + வணிகமற்றது

# IpernityTab
source: Attribution + no derivative
ta: பண்புக்கூறு + வழித்தோன்றல் இல்லை

# IpernityTab
source: Attribution + share alike
ta: பண்புக்கூறு + ஒரே மாதிரியாக பகிர்ந்து கொள்ளுங்கள்

# IpernityTab
source: Attribution + non commercial + no derivative
ta: பண்புக்கூறு + வணிகமற்றது + வழித்தோன்றல் இல்லை

# IpernityTab
source: Attribution + non commercial + share alike
ta: பண்புக்கூறு + வணிகமற்றது + ஒரே மாதிரியாக பகிர்ந்து கொள்ளுங்கள்

# IpernityTab
source: Free use (copyright surrendered, no licence)
ta: இலவச பயன்பாடு (பதிப்புரிமை சரணடைந்தது, உரிமம் இல்லை)

# IpernityTab
source: Ipernity
ta: ஐபர்னிட்டி

# IpernityTab Full name of tab shown as a tooltip
source: Ipernity upload
ta: Ipernity பதிவேற்றம்

# IpernityTab
source: Who can:
ta: யார் முடியும்:

# IpernityTab
source: Everyone (public)
ta: எல்லோரும் (பொது)

# IpernityTab
source: Only you (private)
ta: நீங்கள் மட்டும் (தனியார்)

# IpernityTab
source: Friends
ta: நண்பர்கள்

# IpernityTab
source: Family
ta: குடும்பம்

# IpernityTab
source: see the photo
ta: புகைப்படத்தைக் காண்க

# IpernityTab
source: post a comment
ta: ஒரு கருத்தை இடுங்கள்

# IpernityTab
source: add keywords, notes
ta: முக்கிய வார்த்தைகள், குறிப்புகளைச் சேர்க்கவும்

# IpernityTab
source: identify people
ta: மக்களை அடையாளம் காணவும்

# IpernityTab
source: Licence
ta: உரிமம்

# IpernityTab
source: Synchronise
ta: ஒத்திசைக்கவும்

# IpernityTab
source: New album
ta: புதிய ஆல்பம்

# IpernityTab
source: Replace metadata
ta: மெட்டாடேட்டாவை மாற்றவும்

# IpernityTab
source: Change who can see it
ta: அதை யார் பார்க்க முடியும் என்பதை மாற்றவும்

# IpernityTab
source: Change who can comment or tag
ta: யார் கருத்து அல்லது குறிக்கலாம் என்பதை மாற்றவும்

# IpernityTab
source: Change the licence
ta: உரிமத்தை மாற்றவும்

# IpernityTab
source: Change album membership
ta: ஆல்பம் உறுப்பினரை மாற்றவும்

# IpernityTab
source: Replace image region notes
ta: பட பிராந்திய குறிப்புகளை மாற்றவும்

# IpernityTab
source: Title
ta: தலைப்பு

# IpernityTab
source: Description
ta: விவரம்

# IpernityTab
source: Who can comment on album
ta: ஆல்பத்தில் யார் கருத்து தெரிவிக்க முடியும்

# KeywordsTab
source: One "word" in a keyword hierarchy. This word and its ancestors form a complete keyword.
ta: ஒரு முக்கிய வரிசைமுறையில் ஒரு "சொல்". இந்த வார்த்தையும் அதன் மூதாதையர்களும் ஒரு முழுமையான முக்கிய சொல்லை உருவாக்குகிறார்கள்.

# KeywordsTab
source: Tick this box to add this keyword to the selected photographs. Untick the box to remove it from the selected photographs.
ta: தேர்ந்தெடுக்கப்பட்ட புகைப்படங்களில் இந்த முக்கிய சொல்லைச் சேர்க்க இந்த பெட்டியைத் தட்டவும். தேர்ந்தெடுக்கப்பட்ட புகைப்படங்களிலிருந்து அதை அகற்ற பெட்டியை அவிழ்த்து விடுங்கள்.

# KeywordsTab
source: Tick this box to allow this keyword to be copied to or from the traditional "flat" keywords.
ta: பாரம்பரிய "தட்டையான" முக்கிய வார்த்தைகளிலிருந்து அல்லது இந்த முக்கிய சொல்லை நகலெடுக்க அனுமதிக்க இந்த பெட்டியைத் தேர்வுசெய்க.

# KeywordsTab
source: keyword
ta: முக்கிய சொல்

# KeywordsTab
source: in photo
ta: புகைப்படத்தில்

# KeywordsTab
source: copyable
ta: நகலெடுக்கக்கூடியது

# KeywordsTab
source: Edit keyword hierarchy
ta: முக்கிய வரிசைமுறையைத் திருத்தவும்

# KeywordsTab
source: Enter two or more letters to search the keyword tree. When there are few enough results a popup menu will be displayed.
ta: முக்கிய மரத்தைத் தேட இரண்டு அல்லது அதற்கு மேற்பட்ட எழுத்துக்களை உள்ளிடவும். போதுமான முடிவுகள் இருக்கும்போது பாப்அப் பட்டியல் காண்பிக்கப்படும்.

# KeywordsTab
source: Search
ta: தேடல்

# KeywordsTab
source: All hierarchical keywords
ta: அனைத்து படிநிலை முக்கிய வார்த்தைகள்

# KeywordsTab
source: Enter a hierarchy of keywords, terms or phrases used to express the subject matter in the image. Separate them with "|" or "/" characters.
ta: படத்தில் உள்ள விசயத்தை வெளிப்படுத்தப் பயன்படுத்தப்படும் முக்கிய வார்த்தைகள், விதிமுறைகள் அல்லது சொற்றொடர்களின் படிநிலையை உள்ளிடவும். அவற்றை "|" உடன் பிரிக்கவும் அல்லது "/" எழுத்துக்கள்.

# KeywordsTab Full name of tab shown as a tooltip
source: Keywords or tags
ta: முக்கிய வார்த்தைகள் அல்லது குறிச்சொற்கள்

# KeywordsTab Shortest possible name used as tab label
source: &Keywords
ta: & முக்கிய வார்த்தைகள்

# KeywordsTab
source: Hierarchical keywords
ta: படிநிலை முக்கிய வார்த்தைகள்

# KeywordsTab
source: Open tree view
ta: திறந்த மரக் காட்சி

# LangAltWidget
source: New language
ta: புதிய மொழி

# LangAltWidget
source: Language
ta: மொழி

# LangAltWidget Short abbreviation of "Language: "
source: Lang:
ta: லாங்:

# LangAltWidget
source: This language
ta: இந்த மொழி

# LangAltWidget
source: All languages
ta: அனைத்து மொழிகளும்

# LangAltWidget
source: Make "{language}" the default language.
ta: "{language}" ஐ இயல்பு மொழியாக மாற்றவும்.

# LangAltWidget
source: Change language to "{language}".
ta: மொழியை "{language}" ஆக மாற்றவும்.

# LangAltWidget
source: Change language to other.
ta: மொழியை மற்ற மொழிக்கு மாற்றவும்.

# LangAltWidget
source: What language would you like to changeto? Please enter an RFC3066 language tag.
ta: எந்த மொழியை மாற்ற விரும்புகிறீர்கள்? தயவுசெய்து RFC 3066 மொழிக் குறிச்சொல்லை உள்ளிடவும்.

# LangAltWidget
source: What language would you like to add? Please enter an RFC3066 language tag.
ta: நீங்கள் எந்த மொழியைச் சேர்க்க விரும்புகிறீர்கள்? தயவுசெய்து ஒரு RFC3066 மொழி குறிச்சொல்லை உள்ளிடவும்.

# LatLongDisplay
source: Latitude and longitude (in degrees) as two decimal numbers separated by a space.
ta: அட்சரேகை மற்றும் தீர்க்கரேகை (டிகிரிகளில்) ஒரு இடத்தால் பிரிக்கப்பட்ட இரண்டு தசம எண்களாக.

# LatLongDisplay Short abbreviation of "Latitude, longitude"
source: Lat, long
ta: Lat, பெறுநர்

# LoggerWindow
source: Photini error logging
ta: ஃபோட்டினி பிழை பதிவு

# LoggerWindow
source: Save log file
ta: பதிவு கோப்பை சேமிக்கவும்

# MapTabAzure
source: Search provided by Microsoft Azure
ta: நுண்மென் அசூர் வழங்கிய தேடல்

# MapTabAzure Full name of tab shown as a tooltip
source: Azure Map
ta: அசூர் வரைபடம்

# MapTabAzure Shortest possible name used as tab label
source: Map &A
ta: வரைபடம் & ஏ

# MapTabGoogle Do not translate "powered by Google"
source: Search and altitude lookup powered by Google
ta: கூகிள் மூலம் இயக்கப்படும் தேடல் மற்றும் உயர தேடல்

# MapTabGoogle Full name of tab shown as a tooltip
source: Google Map
ta: கூகிள் வரைபடம்

# MapTabGoogle Shortest possible name used as tab label
source: Map &G
ta: வரைபடம் & ஐயா

# MapTabMapbox
source: Search powered by Mapbox
ta: மேபாக்சால் இயக்கப்படும் தேடல்

# MapTabMapbox Full name of tab shown as a tooltip
source: Mapbox Map
ta: மேபாக்ச் வரைபடம்

# MapTabMapbox Shortest possible name used as tab label
source: Map &M
ta: வரைபடம் & மீ

# MenuBar
source: Photini photo metadata editor
ta: ஃபோட்டினி புகைப்பட மேனிலை தரவு எடிட்டர்

# MenuBar
source: File
ta: கோப்பு

# MenuBar
source: Open files
ta: கோப்புகளைத் திறக்கவும்

# MenuBar
source: Save changes
ta: மாற்றங்களைச் சேமிக்கவும்

# MenuBar
source: Fix missing thumbnails
ta: காணாமல் போன சிறுபடங்களை சரிசெய்யவும்

# MenuBar
source: Close all files
ta: எல்லா கோப்புகளையும் மூடு

# MenuBar
source: Quit
ta: வெளியேறு

# MenuBar
source: Options
ta: விருப்பங்கள்

# MenuBar
source: Settings
ta: அமைப்புகள்

# MenuBar
source: Map keys
ta: வரைபட விசைகள்

# MenuBar
source: Spelling
ta: எழுத்துப்பிழை

# MenuBar
source: Enable spell check
ta: எழுத்துப்பிழை சோதனையை இயக்கவும்

# MenuBar
source: Help
ta: உதவி

# MenuBar
source: About Photini
ta: ஃபோட்டினி பற்றி

# MenuBar
source: Check for update
ta: புதுப்பிப்புக்கு சரிபார்க்கவும்

# MenuBar
source: Photini documentation
ta: ஃபோட்டினி ஆவணங்கள்

# MenuBar
source: An easy to use digital photograph metadata (Exif, IPTC, XMP) editing application.
ta: டிசிட்டல் புகைப்பட மேனிலை தரவு (EXIF, IPTC, XMP) திருத்துதல் பயன்பாட்டைப் பயன்படுத்த எளிதானது.

# MenuBar
source: Open source package available from {url}.
ta: {Url இருந்து இலிருந்து கிடைக்கும் திறந்த மூல தொகுப்பு.

# MenuBar
source: This program is released with a GNU General Public License. For details click the "{details}" button.
ta: இந்தத் திட்டம் குனு பொது பொதுமக்கள் உரிமத்துடன் வெளியிடப்படுகிறது. விவரங்களுக்கு "{details}" பொத்தானைக் சொடுக்கு செய்க.

# MenuBar
source: You are currently running Photini version {version}. The latest release is {release}.
ta: நீங்கள் தற்போது ஃபோட்டினி பதிப்பு {version} ஐ இயக்குகிறீர்கள். அண்மைக் கால வெளியீடு {release}.

# MenuBar
source: Photini: about
ta: ஃபோட்டினி: பற்றி

# MenuBar
source: Photini: version check
ta: ஃபோட்டினி: பதிப்பு சோதனை

# MenuBar
source: Selected images
ta: தேர்ந்தெடுக்கப்பட்ட படங்கள்

# OwnerTab
source: Open link to "{licence}"
ta: "{licence}" க்கு இணைப்பைத் திறக்கவும்

# OwnerTab Full name of tab shown as a tooltip
source: Ownership metadata
ta: உரிமை மேனிலை தரவு

# OwnerTab Shortest possible name used as tab label
source: &Ownership
ta: & உரிமை

# OwnerTab
source: Enter the name of the person that created this image.
ta: இந்த படத்தை உருவாக்கிய நபரின் பெயரை உள்ளிடவும்.

# OwnerTab
source: Creator
ta: உருவாக்கியவர்

# OwnerTab
source: Enter the job title of the person listed in the Creator field.
ta: படைப்பாளி துறையில் பட்டியலிடப்பட்ட நபரின் வேலை தலைப்பை உள்ளிடவும்.

# OwnerTab
source: Creator's Jobtitle
ta: படைப்பாளரின் வேலை

# OwnerTab
source: Enter who should be credited when this image is published.
ta: இந்த படம் வெளியிடப்படும் போது யார் வரவு வைக்கப்பட வேண்டும் என்பதை உள்ளிடவும்.

# OwnerTab
source: Credit Line
ta: கடன் வரி

# OwnerTab
source: Copyright Notice
ta: பதிப்புரிமை அறிவிப்பு
