Repository: 247i/TACETr
Catalog: உரை/தானி/photini-gui-*.po
Languages: ta

# OwnerTab
source: Enter instructions on how this image can legally be used.
ta: இந்த படத்தை சட்டப்பூர்வமாக எவ்வாறு பயன்படுத்தலாம் என்பதற்கான வழிமுறைகளை உள்ளிடவும்.

# OwnerTab
source: Usage Terms
ta: பயன்பாட்டு விதிமுறைகள்

# OwnerTab
source: Web Statement
ta: வலை அறிக்கை

# OwnerTab
source: Rights
ta: உரிமைகள்

# OwnerTab
source: Enter information about embargoes, or other restrictions not covered by the Rights Usage Terms field.
ta: தடைகள் அல்லது உரிமைகள் பயன்பாட்டு விதிமுறைகள் புலத்தின் கீழ் இல்லாத பிற கட்டுப்பாடுகள் பற்றிய தகவல்களை உள்ளிடவும்.

# OwnerTab
source: Instructions
ta: வழிமுறைகள்

# OwnerTab
source: Email(s)
ta: மின்னஞ்சல் (கள்)

# OwnerTab
source: Web URL(s)
ta: வலை முகவரி (கள்)

# OwnerTab
source: Phone(s)
ta: தொலைபேசி (கள்)

# OwnerTab
source: Enter the city for the address of the person that created this image.
ta: இந்த படத்தை உருவாக்கிய நபரின் முகவரிக்கு நகரத்தை உள்ளிடவும்.

# OwnerTab
source: City
ta: நகரம்

# OwnerTab
source: Enter the postal code for the address of the person that created this image.
ta: இந்த படத்தை உருவாக்கிய நபரின் முகவரிக்கு அஞ்சல் குறியீட்டை உள்ளிடவும்.

# OwnerTab
source: Postal Code
ta: அஞ்சல் குறியீடு

# OwnerTab
source: Enter the state for the address of the person that created this image.
ta: இந்த படத்தை உருவாக்கிய நபரின் முகவரிக்கு மாநிலத்தை உள்ளிடவும்.

# OwnerTab
source: State/Province
ta: மாநில/மாகாணம்

# OwnerTab
source: Enter the country name for the address of the person that created this image.
ta: இந்த படத்தை உருவாக்கிய நபரின் முகவரிக்கு நாட்டின் பெயரை உள்ளிடவும்.

# OwnerTab
source: Country
ta: நாடு

# OwnerTab
source: Creator / Licensor Contact Information
ta: உருவாக்கியவர் / உரிமதாரர் தொடர்பு செய்தி

# OwnerTab
source: Photini: ownership template
ta: ஃபோட்டினி: உரிமையாளர் வார்ப்புரு

# OwnerTab
source: Use %Y to insert the year the photograph was taken.
ta: புகைப்படம் எடுக்கப்பட்ட ஆண்டை செருக %y ஐப் பயன்படுத்தவும்.

# OwnerTab
source: Initialise template
ta: வார்ப்புருவைத் தொடங்குதல்

# OwnerTab
source: All rights reserved
ta: அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை

# OwnerTab
source: Attribution 4.0 (CC BY 4.0)
ta: பண்புக்கூறு 4.0 (சி.சி ஆல் 4.0)

# OwnerTab
source: Attribution-ShareAlike 4.0 (CC BY-SA 4.0)
ta: பண்புக்கூறு-சேர்அலைக் 4.0 (சிசி முதல் 4.0 வரை)

# OwnerTab
source: Attribution-NonCommercial 4.0 (CC BY-NC 4.0)
ta: பண்புக்கூறு-வணிகரீதியான 4.0 (சிசி பை-என்.சி 4.0)

# OwnerTab
source: Attribution-NonCommercial-ShareAlike 4.0 (CC BY-NC-SA 4.0)
ta: பண்புக்கூறு-வர்த்தக-சேர்அலைக் 4.0 (சிசி பை-என்.சி-எச்ஏ 4.0)

# OwnerTab
source: Attribution-NoDerivatives 4.0 (CC BY-ND 4.0)
ta: பண்புக்கூறு-நோடரிவேடிவ்ச் 4.0 (சிசி பை-என்.டி 4.0)

# OwnerTab
source: Attribution-NonCommercial-NoDerivatives 4.0 (CC BY-NC-ND 4.0)
ta: பண்புக்கூறு-வர்த்தக-நோடரிவேடிவ்கள் 4.0 (சிசி பை-என்.சி-என்.டி 4.0)

# OwnerTab
source: CC0 1.0 Universal (CC0 1.0) Public Domain Dedication
ta: CC0 1.0 யுனிவர்சல் (CC0 1.0) பொது கள அர்ப்பணிப்பு

# OwnerTab
source: Public Domain Mark 1.0
ta: பொது டொமைன் குறி 1.0

# OwnerTab
source: Define new licence
ta: புதிய உரிமத்தை வரையறுக்கவும்

# OwnerTab
source: Name
ta: பெயர்

# OwnerTab
source: URL
ta: முகவரி

# OwnerTab
source: Edit template
ta: வார்ப்புருவைத் திருத்து

# OwnerTab
source: Apply template
ta: வார்ப்புருவைப் பயன்படுத்துங்கள்

# OwnerTab
source: Enter the work email address for the person that created this image, such as name@domain.com.
ta: Name@domain.com போன்ற இந்த படத்தை உருவாக்கிய நபருக்கான பணி மின்னஞ்சல் முகவரியை உள்ளிடவும்.

# OwnerTab
source: Enter the work Web URL for the person that created this image, such as http://www.domain.com/.
ta: Http://www.domain.com/ போன்ற இந்த படத்தை உருவாக்கிய நபருக்கான பணி வலை முகவரி ஐ உள்ளிடவும்.

# OwnerTab
source: Enter the work phone number for the person that created this image, using the international format, such as +1 (123) 456789.
ta: +1 (123) 456789 போன்ற பன்னாட்டு வடிவமைப்பைப் பயன்படுத்தி இந்த படத்தை உருவாக்கிய நபருக்கான பணி தொலைபேசி எண்ணை உள்ளிடவும்.

# OwnerTab
source: Enter address detail (e.g. flat number or room number) for the person that created this image.
ta: இந்த படத்தை உருவாக்கிய நபருக்கு முகவரி விவரங்களை (எ.கா. பிளாட் எண் அல்லது அறை எண்) உள்ளிடவும்.

# OwnerTab
source: Detail Address
ta: விவரம் முகவரி

# OwnerTab
source: Enter street address for the person that created this image.
ta: இந்த படத்தை உருவாக்கிய நபருக்கு தெரு முகவரியை உள்ளிடவும்.

# OwnerTab
source: Street Address
ta: தெரு முகவரி

# OwnerTab
source: Enter a notice on the current owner of the copyright for this image, such as "©2008 Jane Doe".
ta: "© 2008 சேன் டோ" போன்ற இந்த படத்திற்கான பதிப்புரிமை தற்போதைய உரிமையாளருக்கு அறிவிப்பை உள்ளிடவும்.

# PhotiniMap
source: Get altitude from map
ta: வரைபடத்திலிருந்து உயரத்தைப் பெறுங்கள்

# PhotiniMap
source: Search
ta: தேடல்

# PhotiniMap
source: <new search>
ta: <புதிய தேடல்>

# PhotiniMap
source: Load GPX file
ta: சிபிஎக்ச் கோப்பை ஏற்றவும்

# PhotiniMap
source: Set coords from GPX
ta: சி.பி.எக்ச் இலிருந்து ஒருங்கிணைப்புகளை அமைக்கவும்

# PhotiniMap
source: Remove GPX data
ta: சிபிஎக்ச் தரவை அகற்று

# PhotiniMap
source: All "GPS" data
ta: அனைத்து "GPS" தரவு

# PhotiniMap
source: <widen search>
ta: <தேடலை அகலப்படுத்துங்கள்>

# PhotiniMap
source: <repeat search>
ta: <தேடலை மீண்டும்>

# PhotiniMap
source: Map unavailable
ta: வரைபடம் கிடைக்கவில்லை

# PhotiniMap
source: The map could not be loaded. This might be a WebGL problem. You can test this by clicking on {}.
ta: வரைபடத்தை ஏற்ற முடியவில்லை. இது ஒரு வெப்சிஎல் சிக்கலாக இருக்கலாம். {} ஐக் சொடுக்கு செய்வதன் மூலம் இதைச் சோதிக்கலாம்.

# PixelfedTab
source: Photini: choose instance
ta: ஃபோட்டினி: உதாரணத்தைத் தேர்வுசெய்க

# PixelfedTab
source: Choose an instance
ta: ஒரு நிகழ்வைத் தேர்வுசெய்க

# PixelfedTab
source: Which Pixelfed instance hosts your account?
ta: எந்த பிக்செல்ஃப் நிகழ்வு உங்கள் கணக்கை வழங்குகிறது?

# PixelfedTab
source: Other
ta: மற்றொன்று

# PixelfedTab
source: Pixelfed
ta: பிக்செல்ஃப்

# PixelfedTab Full name of tab shown as a tooltip
source: Pixelfed upload
ta: பிக்செல்ஃப் பதிவேற்றம்

# PixelfedTab Shortest possible name used as tab label
source: &Pixelfed
ta: & பிக்செல்ஃப்

# PixelfedTab
source: Caption
ta: தலைப்பு

# PixelfedTab
source: Generate
ta: உருவாக்கு

# PixelfedTab
source: Spoiler
ta: இறக்கைத்தடை

# PixelfedTab
source: Public
ta: பொது

# PixelfedTab
source: Unlisted
ta: பட்டியலிடப்படாதது

# PixelfedTab
source: Followers only
ta: பின்தொடர்பவர்கள் மட்டுமே

# PixelfedTab
source: Post visibility
ta: இடுகை தெரிவுநிலை

# PixelfedTab
source: Sensitive post
ta: உணர்திறன் இடுகை

# PixelfedTab
source: Disable comments
ta: கருத்துகளை முடக்கு

# PixelfedTab
source: All Rights Reserved
ta: அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை

# PixelfedTab
source: Public Domain Work
ta: பொது டொமைன் வேலை

# PixelfedTab
source: Public Domain Dedication (CC0)
ta: பொது டொமைன் அர்ப்பணிப்பு (CC0)

# PixelfedTab
source: Attribution
ta: பண்புக்கூறு

# PixelfedTab
source: Attribution-ShareAlike
ta: பண்புக்கூறு-சேர்அலைக்

# PixelfedTab
source: Attribution-NonCommercial
ta: பண்புக்கூறு-வர்த்தகம்

# PixelfedTab
source: Attribution-NonCommercial-ShareAlike
ta: பண்புக்கூறு-வர்த்தக-சேர்அலைக்

# PixelfedTab
source: Attribution-NoDerivs
ta: பண்புக்கூறு-நோடரிவ்ச்

# PixelfedTab
source: Attribution-NonCommercial-NoDerivs
ta: பண்புக்கூறு-வர்த்தக-நோடரிவ்ச்

# PixelfedTab
source: Licence
ta: உரிமம்

# PixelfedTab
source: New collection
ta: புதிய சேகரிப்பு

# PixelfedTab
source: Add to collections
ta: சேகரிப்புகளில் சேர்க்கவும்

# PixelfedTab
source: Create new collection
ta: புதிய தொகுப்பை உருவாக்கவும்

# PixelfedTab
source: Title
ta: தலைப்பு

# PixelfedTab
source: Description
ta: விவரம்

# PixelfedTab
source: Draft
ta: வரைவு

# PixelfedTab
source: Collection visibility
ta: சேகரிப்பு தெரிவுநிலை

# PixelfedTab
source: Update remote
ta: தொலைதூரத்தைப் புதுப்பிக்கவும்

# PixelfedTab
source: Photini: alt text
ta: ஃபோட்டினி: ஆல்ட் உரை

# PixelfedTab
source: Missing alt text.
ta: மாற்று உரையைக் காணவில்லை.

# PixelfedTab
source: File "{file_name}" does not have any "alt text" for accessibility. Would you like to upload it anyway?
ta: கோப்பில் "{file_name}" அணுகலுக்கு "மாற்று உரை" இல்லை. எப்படியும் அதை பதிவேற்ற விரும்புகிறீர்களா?

# RegionsTab
source: Delete vertex
ta: வெர்டெக்சை நீக்கு

# RegionsTab
source: New vertex
ta: புதிய வெர்டெக்ச்

# RegionsTab
source: Unreadable image format
ta: படிக்க முடியாத பட வடிவம்

# RegionsTab
source: Photini: image size
ta: ஃபோட்டினி: பட அளவு

# RegionsTab
source: Image has been resized.
ta: படம் மறுஅளவிடப்பட்டது.

# RegionsTab
source: Image dimensions {w_im}x{h_im} do not match region definition {w_reg}x{h_reg}. The image regions may be incorrect.
ta: பட பரிமாணங்கள் {w_im} ஃச் {h_im} பிராந்திய வரையறையுடன் பொருந்தவில்லை {w_reg} ஃச் {h_reg}. பட பகுதிகள் தவறாக இருக்கலாம்.

# RegionsTab
source: pixel
ta: படப்புள்ளி

# RegionsTab
source: A pixel of a digital image setting an absolute value.
ta: ஒரு முழுமையான மதிப்பை அமைக்கும் டிசிட்டல் படத்தின் படப்புள்ளி.

# RegionsTab
source: relative
ta: உறவினர்

# RegionsTab
source: Relative part of the size of an image along the x- or the y-axis.
ta: எக்ச்- அல்லது ஒய்-அச்சுடன் ஒரு படத்தின் அளவின் உறவினர் பகுதி.

# RegionsTab
source: Free-text name of the region. Should be unique among all Region Names of an image.
ta: பிராந்தியத்தின் இலவச உரை பெயர். ஒரு படத்தின் அனைத்து பிராந்திய பெயர்களிடமும் தனித்துவமாக இருக்க வேண்டும்.

# RegionsTab
source: Identifier of the region. Must be unique among all Region Identifiers of an image. Does not have to be unique beyond the metadata of this image.
ta: பிராந்தியத்தின் அடையாளங்காட்டி. ஒரு படத்தின் அனைத்து பிராந்திய அடையாளங்காட்டிகளிடமும் தனித்துவமாக இருக்க வேண்டும். இந்த படத்தின் மெட்டாடேட்டாவுக்கு அப்பால் தனித்துவமாக இருக்க வேண்டியதில்லை.

# RegionsTab
source: Identifier
ta: அடையாளங்காட்டி

# RegionsTab
source: Unit used for measuring dimensions of the boundary of a region.
ta: ஒரு பிராந்தியத்தின் எல்லையின் பரிமாணங்களை அளவிடுவதற்குப் பயன்படுத்தப்படும் அலகு.

# RegionsTab
source: Boundary unit
ta: எல்லை அலகு

# RegionsTab
source: Role of this region among all regions of this image or of other images. The value SHOULD be taken from a Controlled Vocabulary.
ta: இந்த படத்தின் அனைத்து பிராந்தியங்களிலோ அல்லது பிற படங்களிலோ இந்த பிராந்தியத்தின் பங்கு. கட்டுப்படுத்தப்பட்ட சொற்களஞ்சியத்திலிருந்து மதிப்பு எடுக்கப்பட வேண்டும்.

# RegionsTab
source: Role
ta: பங்கு

# RegionsTab
source: The semantic type of what is shown inside the region. The value SHOULD be taken from a Controlled Vocabulary.
ta: பிராந்தியத்திற்குள் காட்டப்பட்டுள்ளவற்றின் சொற்பொருள் வகை. கட்டுப்படுத்தப்பட்ட சொற்களஞ்சியத்திலிருந்து மதிப்பு எடுக்கப்பட வேண்டும்.

# RegionsTab
source: Content type
ta: உள்ளடக்க வகை

# RegionsTab
source: Enter the names of people shown in this region. Separate multiple entries with ";" characters.
ta: இந்த பிராந்தியத்தில் காட்டப்பட்டுள்ளவர்களின் பெயர்களை உள்ளிடவும். பல உள்ளீடுகளை ""; " எழுத்துக்கள்.

# RegionsTab
source: Person shown
ta: காட்டப்பட்ட நபர்

# RegionsTab
source: Description
ta: விவரம்

# RegionsTab
source: Enter a "caption" describing the who, what, and why of what is happening in this region.
ta: இந்த பிராந்தியத்தில் என்ன நடக்கிறது, என்ன, ஏன், ஏன் என்பதை விவரிக்கும் ஒரு "தலைப்பு" உள்ளிடவும்.

# RegionsTab
source: All "region {}" data
ta: அனைத்து "பிராந்திய {}" தரவு

# RegionsTab
source: The Image Region Structure includes optionally any metadata property which is related to the region.
ta: பட பிராந்திய கட்டமைப்பில் பிராந்தியத்துடன் தொடர்புடைய எந்த மேனிலை தரவு சொத்தையும் விருப்பமாக உள்ளடக்கியது.

# RegionsTab
source: New rectangle
ta: புதிய செவ்வகம்

# RegionsTab
source: New circle
ta: புதிய வட்டம்

# RegionsTab
source: New point
ta: புதிய புள்ளி

# RegionsTab
source: New polygon
ta: புதிய பலகோணம்

# RegionsTab Full name of tab shown as a tooltip
source: Image regions
ta: பட பகுதிகள்

# RegionsTab Shortest possible name used as tab label
source: &Regions
ta: & பிராந்தியங்கள்

# RegionsTab
source: Region name
ta: பகுதி பெயர்

# TechnicalTab
source: Maker's name
ta: தயாரிப்பாளரின் பெயர்

# TechnicalTab
source: Model name
ta: மாதிரி பெயர்

# TechnicalTab
source: Serial number
ta: வரிசை எண்

# TechnicalTab
source: Photini: define camera
ta: ஃபோட்டினி: கேமராவை வரையறுக்கவும்

# TechnicalTab
source: Photini: define lens
ta: ஃபோட்டினி: லென்சை வரையறுக்கவும்

# TechnicalTab
source: Minimum focal length
ta: குறைந்தபட்ச குவிய நீளம்

# TechnicalTab
source: Aperture at min. focal length
ta: மணித்துளி துளை. குவிய நீளம்

# TechnicalTab
source: Maximum focal length
ta: அதிகபட்ச குவிய நீளம்

# TechnicalTab
source: Aperture at max. focal length
ta: அதிகபட்சம் துளை. குவிய நீளம்

# TechnicalTab
source: Set "crop factor"
ta: "பயிர் காரணி" அமைக்கவும்

# TechnicalTab
source: Crop factor
ta: பயிர் காரணி

# TechnicalTab Full name of tab shown as a tooltip
source: Technical metadata
ta: தொழில்நுட்ப மேனிலை தரவு

# TechnicalTab Shortest possible name used as tab label
source: &Technical
ta: & தொழில்நுட்ப

# TechnicalTab
source: Date and time
ta: தேதி மற்றும் நேரம்

# TechnicalTab
source: Link 'taken' and 'digitised'
ta: இணைப்பு 'எடுக்கப்பட்டது' மற்றும் 'டிசிட்டல் மயமாக்கப்பட்டது'

# TechnicalTab
source: Link 'digitised' and 'modified'
ta: 'டிசிட்டல் மயமாக்கப்பட்ட' மற்றும் 'மாற்றியமைக்கப்பட்ட' இணைப்பு

# TechnicalTab
source: Taken
ta: எடுக்கப்பட்டது

# TechnicalTab
source: Digitised
ta: டிசிட்டல் மயமாக்கப்பட்டது

# TechnicalTab
source: Modified
ta: மாற்றியமைக்கப்பட்ட

# TechnicalTab
source: Adjust times
ta: நேரங்களை சரிசெய்யவும்

# TechnicalTab
source: Other
ta: மற்றொன்று

# TechnicalTab
source: Orientation
ta: நோக்குநிலை

# TechnicalTab
source: Camera
ta: கேமரா

# TechnicalTab
source: Lens model
ta: லென்ச் மாதிரி

# TechnicalTab
source: Focal length
ta: குவிநீளம், குவியத் தொலைவு

# TechnicalTab
source: 35mm equiv
ta: 35 மிமீ சமம்

# TechnicalTab
source: Aperture
ta: துளை

# TechnicalTab
source: Photini: maker name change
ta: ஃபோட்டினி: மேக்கர் பெயர் மாற்றம்

# TechnicalTab
source: Changing maker name will invalidate Exif makernote information.
ta: தயாரிப்பாளரின் பெயரை மாற்றுவது Exif Makernote தகவல்களை செல்லாது.

# TechnicalTab
source: Do you want to delete the Exif makernote?
ta: Exif Makernote ஐ நீக்க விரும்புகிறீர்களா?

# TechnicalTab
source: min
ta: மணித்துளி

# TechnicalTab
source: max
ta: அதிகபட்சம்

# TechnicalTab
source: Max aperture
ta: அதிகபட்ச துளை

# TechnicalTab
source: Update aperture & focal length
ta: துளை மற்றும் குவிய நீளத்தைப் புதுப்பிக்கவும்

# TechnicalTab
source: Adjust image aperture and focal length to agree with lens specification?
ta: லென்ச் விவரக்குறிப்புடன் உடன்பட பட துளை மற்றும் குவிய நீளத்தை சரிசெய்யவா?

# TechnicalTab orientation dropdown, no transformation
source: normal
ta: சாதாரண

# TechnicalTab
source: Remove "{camera_or_lens}"
ta: "{camera_or_lens}" ஐ அகற்று

# TechnicalTab orientation dropdown, horizontal reflection
source: reflect left to right
ta: இடமிருந்து வலமாக பிரதிபலிக்கவும்

# TechnicalTab orientation dropdown, vertical reflection
source: reflect top to bottom
ta: மேலிருந்து கீழாக பிரதிபலிக்கவும்

# TechnicalTab orientation dropdown, diagonal reflection
source: reflect top right to bottom left
ta: மேல் வலதுபுறமாக கீழே இடதுபுறமாக பிரதிபலிக்கவும்

# TechnicalTab orientation dropdown, diagonal reflection
source: reflect top left to bottom right
ta: மேல் இடமிருந்து கீழ் வலதுபுறமாக பிரதிபலிக்கவும்

# TechnicalTab orientation dropdown
source: rotate -90°
ta: -90 ° ஐ சுழற்றுங்கள்

# TechnicalTab orientation dropdown
source: rotate +90°
ta: +90 ° சுழற்றுங்கள்

# TechnicalTab orientation dropdown
source: rotate 180°
ta: 180 ° சுழற்றுங்கள்

# TechnicalTab
source: Precision
ta: துல்லியம்

# TechnicalTab millimetres focal length
source: mm
ta: மிமீ

# TechnicalTab single letter abbreviation of "hours"
source: h
ta: ம

# TechnicalTab single letter abbreviation of "minutes"
source: m
ta: மீ

# TechnicalTab single letter abbreviation of "seconds"
source: s
ta: கள்

# UploaderTabsAll
source: Close window
ta: சாளரத்தை மூடு

# UploaderTabsAll
source: You may now close this browser window.
ta: நீங்கள் இப்போது இந்த உலாவி சாளரத்தை மூடலாம்.

# UploaderTabsAll
source: Log in
ta: புகுபதிகை

# UploaderTabsAll
source: Log out
ta: விடுபதிகை

# UploaderTabsAll
source: Add to albums
ta: ஆல்பங்களில் சேர்க்கவும்

# UploaderTabsAll
source: Start upload
ta: பதிவேற்றத் தொடங்குங்கள்

# UploaderTabsAll
source: Stop upload
ta: பதிவேற்றுவதை நிறுத்துங்கள்

# UploaderTabsAll
source: Photini: upload in progress
ta: ஃபோட்டினி: முன்னேற்றத்தில் பதிவேற்றவும்

# UploaderTabsAll
source: File "{file_name}" has {size} bytes and exceeds {service}'s limit of {max_size} bytes.
ta: "{file_name}" கோப்பு {size} பைட்டுகளைக் கொண்டுள்ளது மற்றும் {service} பைட்டுகள் இன் {சேவையின் வரம்பை மீறுகிறது.

# UploaderTabsAll
source: File "{file_name}" upload failed.
ta: கோப்பு "{file_name}" பதிவேற்றம் தோல்வியடைந்தது.

# UploaderTabsAll
source: File {file_name} has already been uploaded to {service}. How would you like to update it?
ta: கோப்பு {file_name} ஏற்கனவே {சேவை க்கு இல் பதிவேற்றப்பட்டுள்ளது. அதை எவ்வாறு புதுப்பிக்க விரும்புகிறீர்கள்?

# UploaderTabsAll
source: Which image file matches this picture on {service}?
ta: {சேவையில் இந்த படத்துடன் எந்த படக் கோப்பு பொருந்துகிறது?

# UploaderTabsAll
source: Closing now will terminate the upload.
ta: இப்போது மூடுவது பதிவேற்றத்தை நிறுத்தும்.

# UploaderTabsAll
source: Photini: incompatible type
ta: ஃபோட்டினி: பொருந்தாத வகை

# UploaderTabsAll
source: Skip
ta: தவிர்

# UploaderTabsAll
source: Upload to {service} has not finished.
ta: {சேவைக்கு பதிவேற்றவும் முடிக்கவில்லை.

# UploaderTabsAll
source: Logged in as {user} on {service}
ta: {சேவையில் {பயனராக உள்நுழைந்தது

# UploaderTabsAll
source: Not logged in to {service}
ta: {service}

# UploaderTabsAll
source: Photini: too large
ta: ஃபோட்டினி: மிகப் பெரியது

# UploaderTabsAll
source: File too large.
ta: கோப்பு மிகப் பெரியது.

# UploaderTabsAll
source: Would you like to resize it?
ta: அதை மறுஅளவிட விரும்புகிறீர்களா?

# UploaderTabsAll
source: Incompatible image type.
ta: பொருந்தாத பட வகை.

# UploaderTabsAll
source: Progress
ta: முன்னேற்றம்

# UploaderTabsAll
source: Photini: upload error
ta: ஃபோட்டினி: பிழையைப் பதிவேற்றவும்

# UploaderTabsAll
source: Photini: authorise
ta: ஃபோட்டினி: அதோரிச்

# UploaderTabsAll
source: Authorisation required
ta: ஏற்பு தேவை

# UploaderTabsAll
source: Please use your web browser to authorise Photini, and then close this dialog.
ta: ஃபோட்டினியை அங்கீகரிக்க உங்கள் வலை உலாவியைப் பயன்படுத்தவும், பின்னர் இந்த உரையாடலை மூடவும்.

# UploaderTabsAll
source: File "{file_name}" has {size} pixels and exceeds {service}'s limit of {max_size} pixels.
ta: "{file_name}" கோப்பு {size} படப்புள்ளிகள் மற்றும் {service} 'ஐ மீறுகிறது {max_size} பிக்சல்களின் வரம்பு.

# UploaderTabsAll
source: File "{file_name}" is of type "{file_type}", which {service} may not handle correctly.
ta: "{file_name}" கோப்பு "{file_type}" என்ற வகை, இது {service} சரியாக கையாளக்கூடாது.

# UploaderTabsAll
source: Would you like to convert it to JPEG?
ta: அதை JPEG ஆக மாற்ற விரும்புகிறீர்களா?

# UploaderTabsAll
source: Would you like to upload it anyway?
ta: எப்படியும் அதை பதிவேற்ற விரும்புகிறீர்களா?

# UploaderTabsAll
source: Replace photo
ta: புகைப்படத்தை மாற்றவும்

# UploaderTabsAll
source: Replace image
ta: படத்தை மாற்றவும்

# UploaderTabsAll
source: Upload as new photo
ta: புதிய புகைப்படமாக பதிவேற்றவும்

# UploaderTabsAll
source: No image upload
ta: பட பதிவேற்றம் இல்லை

# UploaderTabsAll
source: Select an image
ta: ஒரு படத்தைத் தேர்ந்தெடுக்கவும்

# UploaderTabsAll
source: No match
ta: பொருந்தவில்லை

# UploaderTabsAll
source: Create new album
ta: புதிய ஆல்பத்தை உருவாக்கவும்

# Widgets
source: <multiple>
ta: <ullower>

# Widgets
source: <multiple values>
ta: <பல மதிப்புகள்>

# Widgets
source: <new>
ta: <புதிய>

# Widgets
source: All "{tab_name}" data
ta: அனைத்து "{tab_name}" தரவு
