Repository: 247i/TACETr
Catalog: உரை/தானி/pianoli-android-strings-*.po
Languages: ta

# app_name
source: PianOli
ta: பியானோ

source: Quit app
ta: பயன்பாட்டை விட்டு

source: Settings
ta: அமைப்புகள்

# some_info_about_this_app_title
source: PianOli is open-source!
ta: பியானோலி திறந்த மூல!

# some_info_about_this_app
source: Send suggestions, feature requests and bug reports to the <a href="https://github.com/nicolasbrailo/PianOli">project website</a>.
ta: பரிந்துரைகள், அம்ச கோரிக்கைகள் மற்றும் பிழை அறிக்கைகளை <a href = "https://github.com/nicolasbrailo/pianoli"> திட்ட வலைத்தளம் </a> க்கு அனுப்பவும்.

# config_tooltip
source: Hold the first gear icon, then press the second for options.
ta: முதல் கியர் ஐகானைப் பிடிக்கவும், பின்னர் விருப்பங்களுக்கு இரண்டாவது அழுத்தவும்.

source: Sound set
ta: ஒலி தொகுப்பு

# soundset_guitar
source: Guitar
ta: கிட்டார்

# soundset_musicbox
source: Music Box
ta: இசை பெட்டி

# soundset_piano
source: Piano
ta: பியானோ

# soundset_piano2
source: Piano 2
ta: பியானோ 2

# soundset_sine
source: Sine Wave
ta: சைன் அலை

# soundset_vibraphone
source: Vibraphone
ta: வைப்ராஃபோன்

# pref_enable_melodies
source: Auto play melodies
ta: ஆட்டோ பிளே மெலடிகள்

# pref_enable_melodies_summary
source: Touching a key plays the next note in a melody, rather than the key's actual note.
ta: ஒரு விசையைத் தொடுவது விசையின் உண்மையான குறிப்பைக் காட்டிலும், மெல்லிசையில் அடுத்த குறிப்பை இயக்குகிறது.

# pref_selected_melodies
source: Available melodies
ta: கிடைக்கும் மெல்லிசைகள்

# pref_selected_melodies_summary
source: List of melodies to cycle through
ta: மூலம் சுழற்சிக்கு மெல்லிசைகளின் பட்டியல்

# melody_twinkle_twinkle_little_star
source: Twinkle, Twinkle, Little Star
ta: ட்விங்கிள், ட்விங்கிள், லிட்டில் ச்டார்

# melody_im_a_little_teapot
source: I'm a Little Teapot
ta: நான் கொஞ்சம் தேனீர்

# melody_insy_winsy_spider
source: Incy Winsy Spider
ta: இன்கி வின்சி ச்பைடர்

# melody_waltzing_matilda
source: Waltzing Matilda
ta: வால்ட்சிங் மாடில்டா

# melody_brother_john
source: Brother John
ta: சகோதரர் சான்

# theme
source: Key Colours
ta: முக்கிய வண்ணங்கள்

# theme_black_and_white
source: Black and white
ta: கருப்பு மற்றும் வெள்ளை

# theme_boomwhacker
source: Boomwhacker
ta: பூம்வாக்கர்

# theme_pastel
source: Pastel
ta: பாச்டல்

# theme_rainbow
source: Rainbow
ta: ரெயின்போ

source: Preferences
ta: விருப்பத்தேர்வுகள்
