Repository: 247i/TACETr
Catalog: உரை/தானி/playhex-app-*.po
Languages: ta

# lobby_title
source: Lobby
ta: லாபி

# lobby.no_waiting_games
source: No games available right now. Create a new one!
ta: இப்போது எந்த விளையாட்டுகளும் கிடைக்கவில்லை. புதிய ஒன்றை உருவாக்கவும்!

# lobby.watch_current_games
source: Watch current games
ta: தற்போதைய விளையாட்டுகளைப் பாருங்கள்

# lobby.join_a_game
source: Join a game
ta: ஒரு விளையாட்டில் சேரவும்

# lobby.no_playing_games
source: There are no games in progress right now.
ta: இப்போது எந்த விளையாட்டுகளும் முன்னேற்றத்தில் இல்லை.

# game.title
source: Game
ta: விளையாட்டு

# game.info
source: Info
ta: தகவல்

# game.opponent
source: Opponent
ta: எதிரி

# game.host
source: Host
ta: விருந்தோம்பி

# game.size
source: Size
ta: அளவு

source: Game board
ta: விளையாட்டு பலகை

# game.board_size
source: Board size
ta: போர்டு அளவு

# game.time_control
source: Time control
ta: நேரக் கட்டுப்பாடு

# game.rules
source: Rules
ta: விதிகள்

# game.created
source: Created
ta: உருவாக்கப்பட்டது

# game.accept
source: Accept
ta: ஏற்றுக்கொள்

# game.red
source: Red
ta: சிவப்பு

# game.blue
source: Blue
ta: நீலம்

# game.started
source: Started
ta: தொடங்கியது

# game.played
source: Played
ta: விளையாடியது

# game.finished
source: Finished
ta: முடிந்தது

# game.duration
source: Duration
ta: காலம்

# game.review
source: Review
ta: சீராய்வு

# game.won
source: Won
ta: வோன்

# game.outcome
source: Outcome
ta: விளைவு

# game.lost
source: Lost
ta: இழந்தது

# game.playing
source: Playing
ta: விளையாடுவது

# game.watch
source: Watch
ta: வாட்ச்

# game.title_your_turn
source: Your turn!
ta: உங்கள் முறை!

# game.title_waiting
source: Waiting for an opponent: hosted by
ta: ஒரு எதிரிக்காக காத்திருக்கிறது: புரவலன் செய்தது

# game_rules.normal
source: standard
ta: தரநிலை

# game_rules.host_plays_first
source: host plays first
ta: புரவலன் முதலில் விளையாடுகிறது

# game_rules.host_plays_second
source: host plays second
ta: புரவலன் இரண்டாவது விளையாடுகிறது

# game_rules.no_swap
source: no swap
ta: இடமாற்றம் இல்லை

# game_state.created
source: Created
ta: உருவாக்கப்பட்டது

# game_state.canceled
source: Canceled
ta: ரத்து செய்யப்பட்டது

# game_state.playing
source: Playing
ta: விளையாடுவது

# game_state.ended
source: Ended
ta: முடிந்தது

# create_game.custom_size
source: Custom
ta: தனிப்பயன்

# create_game.less_options
source: Less options
ta: குறைந்த விருப்பங்கள்

# create_game.more_options
source: More options
ta: மேலும் விருப்பங்கள்

# player_settings.title
source: Settings
ta: அமைப்புகள்

# background_theme.title
source: Theme
ta: கருப்பொருள்

# background_theme.dark
source: Dark
ta: இருண்ட

# background_theme.light
source: Light
ta: ஒளி

# time_control.custom
source: Custom
ta: தனிப்பயன்

# time_control.use
source: Use {{type}}
ta: {{type}} ஐப் பயன்படுத்தவும்

# time_control.byo_yomi
source: Byo-Yomi
ta: போ -ரீடிங்

# time_control.fischer
source: Fischer
ta: பிச்சர்

# time_control.fischer_capped
source: Capped Fischer
ta: மூடிய பிச்சர்

# time_control.capped_abbreviation
source: cap.
ta: தொப்பி.

# time_control.initial_time
source: Initial time
ta: ஆரம்ப நேரம்

# time_control.time_increment
source: Time increment
ta: நேர அதிகரிப்பு

# time_control.periods
source: Periods
ta: காலங்கள்

# time_control.periods_time
source: Periods time
ta: கால நேரம்

# time_control.fast
source: Fast
ta: வேகமாக

# time_control.normal
source: Normal
ta: சாதாரண

# time_control.long
source: Long
ta: நீண்ட

# i_play.title
source: I play
ta: நான் விளையாடுகிறேன்

# i_play.random
source: Random
ta: சீரற்ற

# i_play.first
source: First
ta: முதல்

# i_play.second
source: Second
ta: இரண்டாவது

source: Swap rule
ta: இடமாற்று விதி

source: Enable swap rule
ta: இடமாற்று விதியை இயக்கவும்

# toggle_coords
source: Toggle the display of coordinates
ta: ஆயங்களின் காட்சியை மாற்றவும்

# toggle_coords_short
source: Toggle coordinates
ta: ஆயங்களை மாற்றவும்

source: Share game
ta: விளையாட்டைப் பகிரவும்

source: Copied!
ta: நகலெடுக்கப்பட்டது!

# not_copied
source: Failed to copy, use right click or long tap
ta: நகலெடுக்கத் தவறிவிட்டது, வலது சொடுக்கு அல்லது நீண்ட தட்டவும்

# handicap.title
source: Handicap
ta: ஊனமுற்றோர்

# handicap.none
source: none
ta: எதுவுமில்லை

# handicap.handicap_for_player
source: {{n}} for {{player}}
ta: {{{n}} {{player}}}

source: Game created by {player}, {timeAgo}.
ta: விளையாட்டு {player}, {timeAgo} ஆல் உருவாக்கப்பட்டது.

source: Game was created by {player}, {timeAgo}.
ta: விளையாட்டு {player}, {டைமோகோ by ஆல் உருவாக்கப்பட்டது.

source: Log out
ta: விடுபதிகை

source: Log in
ta: புகுபதிகை

source: Sign up
ta: பதிவு செய்க

source: Feedback
ta: கருத்து

source: Hex links
ta: ஃச் இணைப்புகள்

source: Project under development
ta: வளர்ச்சியின் கீழ் திட்டம்

# last_change
source: Last change: {{date}}
ta: லாச்ட்சேஞ்ச்: {{date}}

source: Privacy policy
ta: தனியுரிமைக் கொள்கை

# license_agpl
source: License AGPL-3.0
ta: உரிமம் AGPL-3.0

# create_account
source: Create an account
ta: ஒரு கணக்கை உருவாக்கவும்

# already_have_account_login_instead
source: Already have an account? {login} instead
ta: ஏற்கனவே ஒரு கணக்கு இருக்கிறதா? {login} அதற்கு பதிலாக

# already_have_account_login_instead_link_label
source: Log in
ta: புகுபதிகை

source: No account? {signUp} instead
ta: கணக்கு இல்லையா? {signUp} அதற்கு பதிலாக

# no_account_sign_up_instead_link_label
source: Sign up
ta: பதிவு செய்க

# add_your_language
source: Your language is missing? {link}!
ta: உங்கள் மொழி காணவில்லை? {link}!

# add_your_language_link
source: Add it with Weblate
ta: வெப்லேட்டுடன் சேர்க்கவும்

# show_coords_by_default
source: Show coordinates by default
ta: முன்னிருப்பாக ஆயத்தொலைவுகளைக் காட்டு

source: Username
ta: பயனர்பெயர்

source: Password
ta: கடவுச்சொல்

# account_created_on
source: Account created on {{date}}
ta: {{date}} இல் உருவாக்கப்பட்ட கணக்கு

# player_current_games
source: Current games
ta: தற்போதைய விளையாட்டுகள்

# player_game_history
source: Game history
ta: விளையாட்டு வரலாறு

source: waiting…
ta: காத்திருக்கிறது…

source: Initializing game…
ta: விளையாட்டைத் தொடங்குதல்…

# game_finished_overlay.title
source: Game finished
ta: விளையாட்டு முடிந்தது

source: Game has been canceled.
ta: விளையாட்டு ரத்து செய்யப்பட்டுள்ளது.

source: Waiting for an opponent…
ta: ஒரு எதிரிக்காக காத்திருக்கிறது…

# confirm_overlay.confirmation
source: Confirmation
ta: உறுதிப்படுத்தல்

# confirm_overlay.are_you_sure?
source: Are you sure?
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா?

# workers.slow_worker
source: No fast worker is online right now. Only limited AI is available.
ta: வேகமான தொழிலாளி இப்போது ஆன்லைனில் இல்லை. வரையறுக்கப்பட்ட AI மட்டுமே கிடைக்கிறது.

# workers.no_worker
source: No worker can compute moves right now. Only random bots are available.
ta: எந்தவொரு தொழிலாளியும் இப்போது நகர்வுகளை கணக்கிட முடியாது. சீரற்ற போட்கள் மட்டுமே கிடைக்கின்றன.

# workers.see_how_to_spawn_a_worker
source: See how to compute AI moves for PlayHex from my computer
ta: எனது கணினியிலிருந்து பிளேஎக்சிற்கான AI நகர்வுகளை எவ்வாறு கணக்கிடுவது என்று பாருங்கள்

# game_analysis.game_analysis
source: AI game analysis
ta: AI விளையாட்டு பகுப்பாய்வு

# game_analysis.request_analysis
source: Request AI analysis
ta: AI பகுப்பாய்வைக் கோருங்கள்

# game_analysis.requested
source: Waiting for AI analysis…
ta: AI பகுப்பாய்விற்காக காத்திருக்கிறது…

# game_analysis.errored
source: AI analysis failed!
ta: AI பகுப்பாய்வு தோல்வியடைந்தது!

# game_analysis.best_move
source: best move
ta: சிறந்த நடவடிக்கை

# game_analysis.best
source: best:
ta: சிறந்தது:

# game_analysis.how_it_works
source: How it works
ta: இது எவ்வாறு இயங்குகிறது

source: Try again
ta: மீண்டும் முயற்சிக்கவும்

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Language
ta: மொழி

source: Cancel
ta: ரத்துசெய்

source: Pass
ta: கணவாய்

source: Explore
ta: ஆராயுங்கள்

source: Close
ta: மூடு

source: Ranked
ta: தரவரிசை

source: Friendly
ta: நட்பு

source: Any
ta: ஏதேனும்

# rating_n
source: Rating: {{rating}}
ta: மதிப்பீடு: {{rating}}

source: Rating
ta: செயல்வரம்பு

source: New game
ta: புதிய விளையாட்டு

source: Players
ta: வீரர்கள்

source: player
ta: வீரர்

source: Load more
ta: மேலும் ஏற்றவும்

# no_such_player
source: Looks like there is no such player.
ta: அத்தகைய வீரர் இல்லை என்று தெரிகிறது.

# n_online_players
source: Online ({{n}})
ta: நிகழ்நிலை ({{n}})

source: Guest
ta: விருந்தினர்

source: Finished games
ta: முடிக்கப்பட்ட விளையாட்டுகள்

source: 1v1
ta: 1 வி 1

# sort_date.asc
source: Chronological
ta: காலவரிசை

# sort_date.desc
source: Recent first
ta: அண்மைக் கால முதல்

# 1v1_ranked.title
source: 1v1
ta: 1 வி 1

# 1v1_ranked.create
source: Create 1v1
ta: 1v1 ஐ உருவாக்கவும்

# 1v1_friendly.title
source: Custom 1v1
ta: தனிப்பயன் 1 வி 1

# 1v1_friendly.create
source: Create custom 1v1
ta: தனிப்பயன் 1v1 ஐ உருவாக்கவும்

# 1vAI_ranked.title
source: Ranked vs AI
ta: தரவரிசை Vs AI

# 1vAI_ranked.create
source: Play ranked vs AI
ta: AI க்கு vs தரவரிசையில் விளையாடுங்கள்

# 1vAI_friendly.title
source: Play vs AI
ta: AI Vs vs

# 1vAI_friendly.create
source: Play vs AI
ta: AI Vs vs

# 1vAI_offline.title
source: Offline AI
ta: இணைப்பில்லாத AI

# 1vAI_offline.create
source: Play vs offline AI
ta: இணைப்பில்லாத AI ஐ விளையாடுங்கள்

# offline_game_explain
source: Offline games run on your device only, so that you can play without internet connection. The PlayHex server is not involved.
ta: இணைப்பில்லாத கேம்கள் உங்கள் சாதனத்தில் மட்டுமே இயங்கும், இதனால் நீங்கள் இணைய இணைப்பு இல்லாமல் விளையாட முடியும். பிளேஎக்ச் சேவையகம் சம்பந்தப்படவில்லை.

source: Loading game…
ta: விளையாட்டு ஏற்றுகிறது…

source: Tournament
ta: போட்டி

source: Now!
ta: இப்போது!

source: Register on Challonge
ta: சல்லோங் மீது பதிவு செய்யுங்கள்

source: See progression on Challonge
ta: சல்லோங் மீது முன்னேற்றத்தைக் காண்க

source: move
ta: நகர்த்தவும்

source: Moves
ta: நகர்வுகள்

# move_number
source: move {{n}}
ta: {{n}} ஐ நகர்த்தவும்

source: Chat
ta: அரட்டை

source: System
ta: மண்டலம்

# chat_message_placeholder
source: Message…
ta: செய்தி…

source: unread messages
ta: படிக்காத செய்திகள்

# send_chat_message
source: Send
ta: அனுப்பு

# n_characters
source: {{count}} character
ta: {{count}} எழுத்து

source: Landscape
ta: நிலப்பரப்பு

source: Portrait
ta: உருவப்படம்

# force_board_orientation_mode
source: Force displaying board in landscape or portrait for this screen
ta: இந்தத் திரைக்கான நிலப்பரப்பில் அல்லது உருவப்படத்தில் பலகையை காண்பிக்கும் ஆற்றல்

source: Resign
ta: ராசினாமா

source: Auto
ta: தானி

# board_orientation.title
source: Orientation
ta: நோக்குநிலை

# board_orientation.description
source: Your preferred board rotation for the portrait and landscape screen orientations.
ta: உருவப்படம் மற்றும் இயற்கை திரை நோக்குநிலைகளுக்கு நீங்கள் விரும்பும் பலகை சுழற்சி.

# board_orientation.flat
source: Flat
ta: கிடைவளைவு

# board_orientation.flat_2
source: Flat 2
ta: பிளாட் 2

# board_orientation.diamond
source: Diamond
ta: வைர

# shading_patterns.title
source: Shading pattern
ta: நிழல் முறை

# shading_patterns.visibility
source: Shading pattern visibility
ta: நிழல் முறை தெரிவுநிலை

# shading_patterns.types.null
source: None
ta: எதுவுமில்லை

# shading_patterns.types.tricolor_checkerboard
source: Tri-color checkerboard
ta: ட்ரை-கலர் செக்கர்போர்டு

# shading_patterns.types.concentrical_rings
source: Concentric rings (HexWorld)
ta: செறிவான மோதிரங்கள் (எக்ச்வொர்ல்ட்)

# shading_patterns.types.height_5_lines
source: Height 5 lines
ta: உயரம் 5 கோடுகள்

# shading_patterns.types.single_ring
source: Single ring
ta: ஒற்றை வளையம்

# shading_patterns.types.custom
source: Custom
ta: தனிப்பயன்

# shading_patterns.custom_expression
source: Custom expression
ta: தனிப்பயன் வெளிப்பாடு

# shading_patterns.help_custom
source: Math expression for the custom shading pattern.<br>The expression must evaluate to a number between 0 (no shading) and 1 (fully shaded) for a given cell (row, col). You can use e.g. 0.5 for tricolor shading patterns. <code>true</code> and <code>false</code> are the same as <code>1</code> and <code>0</code>.<br>The following variables are available:<br>- <code>row</code> and <code>col</code> (or <code>r</code> and <code>c</code>) for the row and column numbers, starting at 0.<br>- <code>size</code> (or <code>s</code>) for the board size.<br>- <code>distToSide</code> for the distance of the current cell to its nearest side.<br>See the list of available operators at https://github.com/silentmatt/expr-eval?tab=readme-ov-file#expression-syntax<br>Examples:<br>- Concentric rings: <code>distToSide % 2</code><br>- Tri-color checkerboard: <code>((size + row - col) % 3) / 2</code><br>- Disk with radius sqrt(20): <code>o = size / 2; (row - o) ^ 2 + (col - o) ^ 2 < 20</code><br>Open the JavaScript console (F12 or ⌥⌘I) to see errors from the execution of your expression.
ta: தனிப்பயன் நிழல் வடிவத்திற்கான கணித வெளிப்பாடு. நீங்கள் எ.கா. முக்கோண நிழல் வடிவங்களுக்கு 0.5. <code> உண்மை </code> மற்றும் <code> தவறான </code> <குறியீடு> 1 </code> மற்றும் <code> 0 </code> போன்றவை. <br> பின்வரும் மாறிகள் கிடைக்கின்றன: <br >. <br>- <code> அளவு </code> (அல்லது <code> கள் </code>) போர்டு அளவிற்கு. பக்க. குறியீடு> disttoside % 2 </code> <br>- ட்ரை-கலர் செக்கர்போர்டு: <code> ((அளவு + வரிசை- கோல்) % 3)/2 </code> <br>- ஆரம் SQRT (20) உடன் வட்டு: <குறியீடு> o = அளவு / 2; .

# show_44_dots
source: Show dots on 4-4 cells
ta: 4-4 கலங்களில் புள்ளிகளைக் காட்டு

source: Preview
ta: முன்னோட்டம்

source: Change password
ta: கடவுச்சொல்லை மாற்றவும்

source: Old password
ta: பழைய கடவுச்சொல்

source: New password
ta: புதிய கடவுச்சொல்

source: Confirm new password
ta: புதிய கடவுச்சொல்லை உறுதிப்படுத்தவும்

source: Update password
ta: கடவுச்சொல்லைப் புதுப்பிக்கவும்

source: Contribute
ta: பங்களிப்பு

source: Contributors
ta: பங்களிப்பாளர்கள்

# no_yet_data
source: Who knows!
ta: யாருக்குத் தெரியும்!

source: {{player}} made a move
ta: {{player}} ஒரு நகர்வு

source: Game with {{player}} has started
ta: {{player} with உடன் விளையாட்டு தொடங்கியது

source: Last move
ta: கடைசி நகர்வு

source: Total played games
ta: மொத்தம் விளையாடியது

source: Preferred board sizes
ta: விருப்பமான பலகை அளவுகள்

# ranked_games
source: Ranked
ta: தரவரிசை

# friendly_games
source: Friendlies
ta: நட்பு

source: Bot games
ta: போட் கேம்ச்

source: Browse all ended games
ta: அனைத்து முடிவடைந்த விளையாட்டுகளையும் உலாவுக

# n_total_games
source: 1 total game.
ta: 1 மொத்த விளையாட்டு.

source: Previous
ta: முந்தைய

source: Next
ta: அடுத்தது

# page_page_of_max
source: Page {{page}} / {{max}}
ta: பக்கம் {{page}} / {{max}}}

# undo.undo_move
source: Takeback
ta: தலைப்பு

# undo.accept
source: Accept undo
ta: செயல்தவிர்க்க ஏற்றுக்கொள்ளுங்கள்

# undo.reject
source: Reject
ta: நிராகரிக்கவும்

# ping.ping_ms
source: Ping: {{ms}}ms
ta: பிங்: {{ms}} எம்.எச்

# ping.date_shift_ms
source: Time shift: {{ms}}ms
ta: நேர மாற்றம்: {{ms}} ms

# time_cadency.blitz
source: Blitz
ta: பிளிட்ச்

# time_cadency.normal
source: Live
ta: வாழ

# time_cadency.correspondence
source: Correspondence
ta: கடித தொடர்பு

source: Overall
ta: ஒட்டுமொத்தமாக

# boardsize.small
source: Small
ta: சிறிய

# boardsize.medium
source: Medium
ta: சராசரி

# boardsize.large
source: Large
ta: பெரிய

# confirm_move.title
source: Confirm move
ta: நகர்வை உறுதிப்படுத்தவும்

# confirm_move.button_label
source: Confirm move
ta: நகர்வை உறுதிப்படுத்தவும்

# confirm_move.button_label_short
source: Confirm
ta: உறுதிப்படுத்தவும்

# confirm_move.send_immediately
source: Send immediately
ta: உடனடியாக அனுப்புங்கள்

# confirm_move.ask_confirmation
source: Ask confirmation
ta: உறுதிப்படுத்தல் கேளுங்கள்

# confirm_move.description
source: To prevent misclicks, you can require confirmation before submitting a move.
ta: தவறான கிளிக்குகளைத் தடுக்க, ஒரு நடவடிக்கையை சமர்ப்பிக்கும் முன் உறுதிப்படுத்தல் தேவைப்படலாம்.

# rematch.label
source: Rematch
ta: மறுபரிசீலனை

# rematch.accept
source: Accept rematch
ta: மறுபரிசீலனை செய்யுங்கள்

# rematch.view
source: View rematch
ta: மறுபரிசீலனை செய்யவும்

# short_time_unit.day
source: d
ta: டி

# short_time_unit.hour
source: h
ta: ம

# short_time_unit.minute
source: min
ta: மணித்துளி

# short_time_unit.second
source: s
ta: கள்

# outcome.win
source: win
ta: செய்

# outcome.loss
source: loss
ta: இழப்பு

# outcome.resign
source: resign
ta: ராசினாமா

# outcome.forfeit
source: forfeit
ta: பறிமுதல்

# outcome.time
source: timeout
ta: நேரம் முடிந்தது

# player_wins_by.default
source: {player} wins!
ta: {player} வெற்றி!

# player_wins_by.time
source: {player} wins on time!
ta: {பிளேயர் the சரியான நேரத்தில் வெற்றி!

# player_wins_by.resign
source: {player} wins!
ta: {player} வெற்றி!

source: {player} wins by forfeit!
ta: {player} பறிமுதல் மூலம் வெற்றி!

# player_loses_reason.default
source: {player} loses.
ta: {player} இழக்கிறது.

# player_loses_reason.time
source: {player} times out.
ta: {player} மடங்கு.

# player_loses_reason.resign
source: {player} resigns.
ta: {player} ராசினாமா செய்கிறார்.

# player_loses_reason.forfeit
source: {player} forfeits.
ta: {player} பறிமுதல்.
