Repository: 247i/TACETr
Catalog: உரை/தானி/podverse-podverse-rn-*.po
Languages: ta

# value_tag_info_streaming_sats_text_1
source: A queue of transactions to recipients of the creator's choosing.
ta: படைப்பாளரைத் தேர்ந்தெடுப்பவர்களுக்கான பரிவர்த்தனைகளின் வரிசை.

# value_tag_info_streaming_sats_text_2
source: Every minute of playback, each recipient gets their Sats once it adds up to 5.
ta: பிளேபேக்கின் ஒவ்வொரு நிமிடமும், ஒவ்வொரு பெறுநரும் 5 வரை சேர்த்தவுடன் தங்கள் SAT களைப் பெறுகிறார்கள்.

# value_tag_info_streaming_sats_text_3
source: (Closing and reopening the app clears the queue.)
ta: (பயன்பாட்டை மூடுவதும் மீண்டும் திறப்பதும் வரிசையை அழிக்கிறது.)

# value_tag_info_streaming_sats_title
source: Streaming Sats
ta: ச்ட்ரீமிங் காட்சி

# value_tag_streaming_sats
source: Streaming Sats
ta: ச்ட்ரீமிங் காட்சி

# V4V Providers connected explanation
source: Connected wallets.
ta: இணைக்கப்பட்ட பணப்பைகள்.

# V4V Providers setup explanation
source: Supported wallets.
ta: ஆதரிக்கப்பட்ட பணப்பைகள்.

# V4V set name helper text
source: The name is sent publicly with your boosts.
ta: உங்கள் ஊக்கங்களுடன் பெயர் பகிரங்கமாக அனுப்பப்படுகிறது.

# Value for Value
source: Value for value (V4V)
ta: மதிப்புக்கான மதிப்பு (v4v)

# Verify email title
source: E-mail verified
ta: மின்னஞ்சல் சரிபார்க்கப்பட்டது

# Verify email succeeded
source: You can now log in.
ta: நீங்கள் இப்போது உள்நுழையலாம்.

source: Verify Password
ta: கடவுச்சொல்லை சரிபார்க்கவும்

# Verify Your Email
source: Verify your e-mail address
ta: உங்கள் மின்னஞ்சல் முகவரியை சரிபார்க்கவும்

source: Video
ta: ஒளிதோற்றம்

source: Videos
ta: வீடியோக்கள்

source: Video playback
ta: வீடியோ பிளேபேக்

source: Wallet Admin-key
ta: பணப்பையை நிர்வாகி-விசை

# Wallet ID (For An Existing Wallet)
source: Wallet ID (to existing wallet)
ta: பணப்பை ஐடி (இருக்கும் பணப்பைக்கு)

source: Wallet Name (optional)
ta: பணப்பை பெயர் (விரும்பினால்)

source: Weak or no connection
ta: பலவீனமான அல்லது இணைப்பு இல்லை

# Would you like your previous downloads to be transfered or deleted?
source: Transfer or delete prior downloads?
ta: முன் பதிவிறக்கங்களை மாற்ற வேண்டுமா அல்லது நீக்கவா?

source: Yes
ta: ஆம்

source: Yes, allow data
ta: ஆம், தரவை அனுமதிக்கவும்

# Yes enable tracking
source: Yes, track me
ta: ஆம், என்னைக் கண்காணிக்கவும்

source: Yes, save them
ta: ஆம், அவற்றைக் காப்பாற்றுங்கள்

# Your premium membership is still valid
source: Your premium membership is still valid. If you would
ta: உங்கள் காப்பீடு உறுப்பினர் இன்னும் செல்லுபடியாகும். நீங்கள் விரும்பினால்

source: Open website in web browser?
ta: வலை உலாவியில் வலைத்தளத்தைத் திறக்கவா?

# You are not subscribed to any albums yet
source: You have no album subscriptions yet
ta: உங்களிடம் இதுவரை ஆல்பம் சந்தாக்கள் இல்லை

# You are not subscribed to any podcasts
source: You have no podcast subscriptions.
ta: உங்களிடம் போட்காச்ட் சந்தாக்கள் இல்லை.

# You are not subscribed to any podcasts yet
source: You have no podcast subscriptions yet
ta: உங்களிடம் இதுவரை போட்காச்ட் சந்தாக்கள் இல்லை

# You must be connected to the internet to
source: Connect to the Internet to
ta: இணையத்துடன் இணைக்கவும்

# You must be logged in to make clips
source: Log in to make clips.
ta: கிளிப்புகள் தயாரிக்க உள்நுழைக.

source: Verify your e-mail address to log in. Press "Send e-mail" and click it in your inbox.
ta: உள்நுழைய உங்கள் மின்னஞ்சல் முகவரியை சரிபார்க்கவும். "மின்னஞ்சல் அனுப்பு" என்பதை அழுத்தி உங்கள் இன்பாக்சில் சொடுக்கு செய்க.

# You need to login to make clips
source: Log in to make clips
ta: கிளிப்புகள் தயாரிக்க உள்நுழைக

# You should receive an email shortly The email may go to your Spam folder
source: You should receive an e-mail shortly. It may be in your spam.
ta: நீங்கள் விரைவில் ஒரு மின்னஞ்சலைப் பெற வேண்டும். இது உங்கள் ச்பேமில் இருக்கலாம்.

# Your free trial expired
source: Your Podverse Premium ended
ta: உங்கள் போட்வெர்ச் காப்பீடு முடிந்தது

# Your free trial expires
source: Your free period of Podverse Premium ends
ta: போட்வெர்ச் காப்பீடு உங்கள் இலவச காலம் முடிவடைகிறது

# Your membership expired
source: Your Podverse Premium ended
ta: உங்கள் போட்வெர்ச் காப்பீடு முடிந்தது

# Your membership is still valid
source: Your Podverse Premium is still valid, and can be extended for $18/year.
ta: உங்கள் போட்வெர்ச் காப்பீடு இன்னும் செல்லுபடியாகும், மேலும் ஆண்டுக்கு $ 18 க்கு நீட்டிக்கப்படலாம்.

# Your password was changed succesfully
source: You can now use your new password
ta: இப்போது உங்கள் புதிய கடவுச்சொல்லைப் பயன்படுத்தலாம்

# Your premium membership expires
source: Your Podverse Premium ends
ta: உங்கள் போட்வெர்ச் காப்பீடு முடிகிறது

# Your profile page is hidden
source: Profile hidden, but links to your clips and playlists always work for everyone.
ta: சுயவிவரம் மறைக்கப்பட்டுள்ளது, ஆனால் உங்கள் கிளிப்புகள் மற்றும் பிளேலிச்ட்களுக்கான இணைப்புகள் எப்போதும் அனைவருக்கும் வேலை செய்கின்றன.

# Your profile page is public
source: Your profile is public.
ta: உங்கள் சுயவிவரம் பொது.

# Your profile page will be hidden
source: Your profile will be hidden. Links to clips and playlists will work for everyone.
ta: உங்கள் சுயவிவரம் மறைக்கப்படும். கிளிப்புகள் மற்றும் பிளேலிச்ட்களுக்கான இணைப்புகள் அனைவருக்கும் வேலை செய்யும்.

# Your purchase was successful You may close this window
source: Thank you.
ta: நன்றி.

source: Your queue is empty
ta: உங்கள் வரிசை காலியாக உள்ளது

source: Your membership will not auto-renew
ta: உங்கள் உறுப்பினர் தானாக புதுப்பிக்கப்படாது

# You are not being charged during your free trial
source: You are not charged during or after the free trial.
ta: இலவச சோதனையின் போது அல்லது அதற்குப் பிறகு உங்களிடம் கட்டணம் வசூலிக்கப்படவில்லை.

# You will not be charged for signing up for your free trial
source: You are not charged for signing up or using your free trial. We hope you subscribe (manually) afterwards.
ta: உங்கள் இலவச சோதனையைப் பதிவுசெய்ததற்காக அல்லது பயன்படுத்தியதற்காக உங்களிடம் கட்டணம் வசூலிக்கப்படவில்லை. நீங்கள் பின்னர் குழுசேர்வீர்கள் என்று நம்புகிறோம் (கைமுறையாக).

# Android Auto Podcast Title
source: Podcast
ta: போட்காச்ட்

# Android Auto Queue Title
source: Queue
ta: வரிசை

# Android Auto History Title
source: History
ta: வரலாறு

# Android Auto Permission Title
source: Android AUTO Permission Request
ta: ஆண்ட்ராய்டு ஆட்டோ இசைவு கோரிக்கை

# Android Auto Permission Body
source: If you'd like to use Android Auto, please grant Podverse the 'Draw over other Apps' permission.
ta: நீங்கள் ஆண்ட்ராய்டு தானி ஐப் பயன்படுத்த விரும்பினால், தயவுசெய்து போட்வெர்சை 'பிற பயன்பாடுகளை வரையவும்' அனுமதியை வழங்கவும்.
