Repository: 247i/TACETr
Catalog: உரை/தானி/podverse-podverse-rn-*.po
Languages: ta

# No podcasts found
source: Could not find any podcasts
ta: எந்த பாட்காச்ட்களையும் கண்டுபிடிக்க முடியவில்லை

# No profiles found
source: Could not find any profiles
ta: எந்த சுயவிவரங்களையும் கண்டுபிடிக்க முடியவில்லை

source: No, remove them
ta: இல்லை, அவற்றை அகற்றவும்

source: No summary available.
ta: சுருக்கம் எதுவும் கிடைக்கவில்லை.

source: No thanks
ta: நன்றி இல்லை

source: No Thanks
ta: நன்றி இல்லை

# No music tracks found
source: No tracks found
ta: தடங்கள் எதுவும் கிடைக்கவில்லை

source: No Wi-Fi connection
ta: வைஃபை இணைப்பு இல்லை

source: No, Wi-Fi only
ta: இல்லை, வைஃபை மட்டும்

source: Notifications
ta: அறிவிப்புகள்

# Notifications UP help text
source: Install ntfy, turn off battery optimization for it, and select it here to not miss any notifications, UnifiedPush gives push notifications without leaking data.
ta: NTFY ஐ நிறுவவும், அதற்கான பேட்டரி தேர்வுமுறை அணைக்கவும், எந்தவொரு அறிவிப்புகளையும் தவறவிடாமல் இங்கே தேர்ந்தெடுக்கவும், யுனிஃபைட் புச் தரவு கசியாமல் புச் அறிவிப்புகளை வழங்குகிறது.

source: Now Playing
ta: இப்போது விளையாடுகிறது

source: Off
ta: அணை

# Official chat
source: Chat
ta: அரட்டை

# Official webpage
source: Webpage
ta: வலைப்பக்கம்

source: Offline mode
ta: இணைப்பில்லாத பயன்முறை

# Offline mode can save battery life and improve performance
source: Saves battery life and improves performance.
ta: பேட்டரி ஆயுளைச் சேமிக்கிறது மற்றும் செயல்திறனை மேம்படுத்துகிறது.

# OFFLINE MODE ENABLED
source: Offline mode on
ta: இணைப்பில்லாத பயன்முறை

source: OK
ta: சரி

source: OK
ta: சரி

source: Older
ta: பழைய

source: oldest
ta: பழமையானது

# Only allow downloading episodes when connected to Wifi
source: Only on Wi-Fi
ta: வைஃபை மட்டுமே

source: Only with link
ta: இணைப்புடன் மட்டுமே

# Only with Link means only people who
source: "Only with link" means it not in the "Public" list on Podverse and the clip's link is needed to play it. Create public clips with Podverse Premium.
ta: "இணைப்புடன் மட்டும்" என்பது போட்வீசில் உள்ள "பொது" பட்டியலில் இல்லை என்பதையும், அதை இயக்க கிளிப்பின் இணைப்பு தேவை. போட்வெர்ச் பிரீமியத்துடன் பொது கிளிப்களை உருவாக்கவும்.

source: OPML import and export
ta: OPML இறக்குமதி மற்றும் ஏற்றுமதி

# OPML import error message general
source: There was an issue with the opml file import.
ta: OPML கோப்பு இறக்குமதியில் சிக்கல் இருந்தது.

# OPML import error message wrong file type
source: File must have a .opml or .xml file extension.
ta: கோப்பில் ஒரு .opml அல்லது .xml கோப்பு நீட்டிப்பு இருக்க வேண்டும்.

source: optional
ta: விரும்பினால்

source: Other
ta: மற்றொன்று

source: Password
ta: கடவுச்சொல்

source: Password requirements:
ta: கடவுச்சொல் தேவைகள்:

# passwords match
source: — matching passwords
ta: - பொருந்தும் கடவுச்சொற்கள்

# paste RSS feed link here
source: Paste RSS link here…
ta: ஆர்எச்எச் இணைப்பை இங்கே ஒட்டவும்…

source: Pause
ta: இடைநிறுத்தம்

source: Paused
ta: இடைநிறுத்தப்பட்டது

# Payment disabled beta message
source: The payment processor cannot work in beta. To extend your membership, please use the official app version, or email us and we will help you out.
ta: கட்டண செயலி பீட்டாவில் வேலை செய்ய முடியாது. உங்கள் உறுப்பினரை நீட்டிக்க, தயவுசெய்து அதிகாரப்பூர்வ பயன்பாட்டு பதிப்பைப் பயன்படுத்தவும் அல்லது எங்களுக்கு மின்னஞ்சல் அனுப்புங்கள், நாங்கள் உங்களுக்கு உதவுவோம்.

# Payment disabled beta title
source: Not available in Beta
ta: பீட்டாவில் கிடைக்கவில்லை

source: Pending
ta: நிலுவையில் உள்ளது

# per minute
source: /min
ta: /நிமிடம்

source: Permission Denied
ta: இசைவு மறுக்கப்பட்டது

source: Play
ta: விளையாடுங்கள்

source: Player
ta: வீரர்

source: playlist
ta: பிளேலிச்ட்

source: Playlist
ta: பிளேலிச்ட்

# Playlist Not Found
source: Could not find the playlist
ta: பிளேலிச்ட்டைக் கண்டுபிடிக்க முடியவில்லை

source: Playlist title
ta: பிளேலிச்ட் தலைப்பு

source: playlists
ta: பிளேலிச்ட்கள்

source: Playlists
ta: பிளேலிச்ட்கள்

source: You should get an e-mail to reset your password shortly if you registered with this e-mail address.
ta: இந்த மின்னஞ்சல் முகவரியில் நீங்கள் பதிவுசெய்தால் விரைவில் உங்கள் கடவுச்சொல்லை மீட்டமைக்க ஒரு மின்னஞ்சல் பெற வேண்டும்.

# Please check your internet connection and try again later
source: Connect to the Internet and try again.
ta: இணையத்துடன் இணைத்து மீண்டும் முயற்சிக்கவும்.

# Please login to mark episodes as played
source: Log in to mark episodes as played.
ta: விளையாடியபடி அத்தியாயங்களைக் குறிக்க உள்நுழைக.

# Please renew your membership to continue using premium features
source: Please renew to keep using all features.
ta: எல்லா அம்சங்களையும் தொடர்ந்து புதுப்பிக்க புதுப்பிக்கவும்.

# Please retry processing or contact support
source: Retry processing (you won't be charged again), or contact support.
ta: செயலாக்கத்தை மீண்டும் முயற்சிக்கவும் (உங்களிடம் மீண்டும் கட்டணம் வசூலிக்கப்படாது), அல்லது தொடர்பு உதவி.

# Please verify your email address to login
source: Verify your e-mail address to log in.
ta: உள்நுழைய உங்கள் மின்னஞ்சல் முகவரியை சரிபார்க்கவும்.

# Please wait while your transaction completes
source: Completing transaction…
ta: பரிவர்த்தனை முடித்தல்…

source: Podcast
ta: போட்காச்ட்

# Podcast Clips
source: Clips
ta: கிளிப்புகள்

# Podcast Funding Links
source: Funding links
ta: பொருள் இணைப்புகள்

# Podcast Not Found
source: Could not find the podcast
ta: போட்காச்டைக் கண்டுபிடிக்க முடியவில்லை

source: Podcast request
ta: போட்காச்ட் கோரிக்கை

# Podcast supports value-for-value donations
source: Connect to a wallet in the app to support these creators.
ta: இந்த படைப்பாளர்களை ஆதரிக்க பயன்பாட்டில் ஒரு பணப்பையுடன் இணைக்கவும்.

# Podcaster
source: Creator
ta: உருவாக்கியவர்

source: Podcasting 2.0 chapters
ta: போட்காச்டிங் 2.0 அத்தியாயங்கள்

source: Podcasting 2.0 cross-app comments
ta: போட்காச்டிங் 2.0 குறுக்கு பயன்பாட்டு கருத்துகள்

source: Podcasting 2.0 transcripts
ta: போட்காச்டிங் 2.0 டிரான்ச்கிரிப்டுகள்

source: podcasts
ta: பாட்காச்ட்கள்

source: Podcasts
ta: பாட்காச்ட்கள்

# Podcasts clips and playlists are visible
source: Podcasts, clips, and playlists are visible on your profile
ta: உங்கள் சுயவிவரத்தில் பாட்காச்ட்கள், கிளிப்புகள் மற்றும் பிளேலிச்ட்கள் தெரியும்

# Podcasts clips and playlists will be visible
source: Podcasts, clips, and playlists will be visible on your profile
ta: உங்கள் சுயவிவரத்தில் பாட்காச்ட்கள், கிளிப்புகள் மற்றும் பிளேலிச்ட்கள் தெரியும்

# Podverse External Storage Permission
source: Podverse permission to external storage card
ta: வெளிப்புற சேமிப்பக அட்டைக்கு போட்வர்ச் இசைவு

# Podverse Mission Statement
source: Podverse creates free and open source software to expand what is possible in podcasting.
ta: போட்காச்டிங்கில் சாத்தியமானதை விரிவாக்க போட்வெர்வ்ச் இலவச மற்றும் திறந்த மூல மென்பொருளை உருவாக்குகிறது.

source: Grant permission to access your downloaded media.
ta: நீங்கள் பதிவிறக்கிய ஊடகத்தை அணுக இசைவு வழங்கவும்.

source: Grant permission to store downloaded media.
ta: பதிவிறக்கம் செய்யப்பட்ட மீடியாவை சேமிக்க இசைவு வழங்கவும்.

# Popularity Analytics
source: Popularity Tracking
ta: பிரபல கண்காணிப்பு

source: Premium
ta: காப்பீடு

# Premium Info
source: Info about Podverse Premium
ta: போட்வர்ச் காப்பீடு பற்றிய செய்தி

# Premium Membership Expired
source: Renew Podverse Premium first
ta: முதலில் போட்வெர்ச் பிரீமியத்தை புதுப்பிக்கவும்

# Premium Membership Required
source: Syncing required
ta: தேவை

source: Premium membership expiration date
ta: காப்பீடு உறுப்பினர் காலாவதி தேதி

# Preset podcast start time
source: Default start time
ta: இயல்புநிலை தொடக்க நேரம்

source: Preview End Time
ta: முன்னோட்ட இறுதி நேரம்

source: Preview Start Time
ta: தொடக்க நேரம் முன்னோட்டம்

source: Privacy
ta: தனியுரிமை

source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

source: Private
ta: தனிப்பட்ட

source: Processing…
ta: செயலாக்கம்…

source: profile
ta: சுயவிவரம்

source: Profile
ta: சுயவிவரம்

# Profile not found
source: Could not find the profile
ta: சுயவிவரத்தைக் கண்டுபிடிக்க முடியவில்லை

source: Profiles
ta: சுயவிவரங்கள்

source: Public
ta: பொது

source: Public API Key
ta: பொது பநிஇ விசை

source: Purchase cancelled. Please contact support if this is an error.
ta: கொள்முதல் ரத்து செய்யப்பட்டது. இது பிழை என்றால் ஆதரவைத் தொடர்பு கொள்ளவும்.

# Purchase is still pending
source: Purchase still pending…
ta: வாங்க இன்னும் நிலுவையில் உள்ளது…

source: Purchased
ta: வாங்கப்பட்டது

source: QR Code Error:
ta: QR குறியீடு பிழை:

source: QR Reader
ta: QR வாசகர்

source: Queue
ta: வரிசை

source: Queue: last
ta: வரிசை: கடைசியாக

source: Queue: next
ta: வரிசை: அடுத்து

source: random
ta: சீரற்ற

source: recent
ta: அண்மைக் கால

source: Recently Played
ta: அண்மைக் காலத்தில் விளையாடியது

# Refresh subscriptions on launch
source: Refresh subscriptions when starting the app
ta: பயன்பாட்டைத் தொடங்கும்போது சந்தாக்களைப் புதுப்பிக்கவும்

source: Remote
ta: தொலைநிலை

source: Remove
ta: அகற்று

source: Remove end time
ta: இறுதி நேரத்தை அகற்று

# Renew Membership
source: Renew
ta: புதுப்பித்தல்

# Replay Clip
source: Replay
ta: மீண்டும்

source: Report a content issue
ta: உள்ளடக்க சிக்கலைப் புகாரளிக்கவும்

source: Request Podcast
ta: போட்காச்ட் கோரிக்கை

source: requirement met
ta: தேவை சந்தித்தது

source: requirement not met
ta: தேவை நிறைவு செய்யப்படவில்லை

# Resend Verification Email
source: Resend
ta: மீண்டும்

source: Reset Password
ta: கடவுச்சொல்லை மீட்டமைக்கவும்

# Reset Password Failed
source: Could not reset your password
ta: உங்கள் கடவுச்சொல்லை மீட்டமைக்க முடியவில்லை

# Reset Password Sent
source: Sent
ta: அனுப்பப்பட்டது

source: Resume
ta: மீண்டும் தொடங்குங்கள்

# Return to beginning of episode
source: Return to beginning
ta: தொடக்கத்திற்குத் திரும்பு

source: RSS
ta: ஆர்.எச்.எச்

source: RSS Feed
ta: RSS ஊட்டம்

source: RSS-feed link
ta: RSS-FEED இணைப்பு

# satoshis
source: Sats
ta: காட்சிகள்

source: Sats
ta: காட்சிகள்

source: Sats/min
ta: Set/min

# Satoshi to fiat conversion by Alby API
source: Sats to fiat-currency conversion via the Alby API
ta: ஆல்பி பநிஇ வழியாக ஃபியட்-நாணய மாற்றத்திற்கு காட்சி

source: Save
ta: சேமி

source: Save Clip
ta: கிளிப்பை சேமிக்கவும்

source: Save Password
ta: கடவுச்சொல்லைச் சேமிக்கவும்

# Saving login credentials error
source: Could not save your login state. Reset the app storage to potentially fix this issue?
ta: உங்கள் உள்நுழைவு நிலையை சேமிக்க முடியவில்லை. இந்த சிக்கலை சரிசெய்ய பயன்பாட்டு சேமிப்பிடத்தை மீட்டமைக்கவா?

# Scan a valid QR code
source: Scan a QR code
ta: ஒரு QR குறியீட்டை ச்கேன் செய்யுங்கள்

source: Scan QR Code
ta: QR குறியீட்டை ச்கேன் செய்யுங்கள்

# Scan RSS Feed QR Code
source: Scan QR code of RSS feed
ta: RSS ஊட்டத்தின் QR குறியீட்டை ச்கேன் செய்யுங்கள்

source: Screen-reader accessibility
ta: திரை-வாசகர் அணுகல்

source: Search
ta: தேடல்

# search by podcast host
source: Find Host
ta: ஓச்டைக் கண்டுபிடி

# search by podcast title
source: Find Podcast
ta: போட்காச்டைக் கண்டுபிடி

# Search podcasts
source: Search…
ta: தேடுங்கள்…

source: Season
ta: சீசன்

source: second
ta: இரண்டாவது

source: seconds
ta: நொடிகள்

source: Select…
ta: தேர்ந்தெடுக்கவும்…

source: Select a distributor
ta: விநியோகச்தரைத் தேர்ந்தெடுக்கவும்

source: Select Multiple Episodes
ta: பல அத்தியாயங்களைத் தேர்ந்தெடுக்கவும்

source: Select episodes to mark as played
ta: விளையாடியது போல் அத்தியாயங்களைத் தேர்ந்தெடுக்கவும்

source: Send
ta: அனுப்பு

# Send Bitcoin donations and boostagrams
source: Send donations (boosts)
ta: நன்கொடைகளை அனுப்பவும் (ஊக்கங்கள்)

source: Send Boostagram
ta: Boostagram ஐ அனுப்புங்கள்

source: Send e-mail
ta: மின்னஞ்சல் அனுப்புங்கள்

# Send Password Reset
source: Send
ta: அனுப்பு

source: Send us an e-mail
ta: எங்களுக்கு ஒரு மின்னஞ்சல் அனுப்புங்கள்

source: Set up
ta: அமைக்கவும்

source: Settings
ta: அமைப்புகள்

# Settings - Queue - enable queue while music is playing
source: Enable queue while music is playing
ta: இசை விளையாடும்போது வரிசையை இயக்கவும்

# Setup Wallet
source: Set up
ta: அமைக்கவும்

source: Share
ta: பங்கு

source: Share Album
ta: ஆல்பம் பகிர்ந்து கொள்ளுங்கள்

source: Share Chapter
ta: பகிர்வு அத்தியாயம்

source: Share Clip
ta: கிளிப்பைப் பகிரவும்

source: Share Episode
ta: அத்தியாயம் பகிர்வு

source: Share Podcast
ta: பகிர்வு போட்காச்ட்

source: Share Track
ta: பகிர்வு டிராக்

# shared using brandName
source: — shared using Podverse
ta: - போட்வெர்சைப் பயன்படுத்தி பகிரப்பட்டது

source: Show your support
ta: உங்கள் ஆதரவைக் காட்டுங்கள்

source: Show Completed
ta: நிறைவு

source: Show less
ta: குறைவாகக் காட்டு

# Show lightning icons next to value for value enabled podcasts
source: Show Lightning icons next to value-for-value podcasts
ta: மதிப்புக்கான மதிப்புக்கு அடுத்ததாக மின்னல் ஐகான்களைக் காட்டு

source: Show more
ta: மேலும் காட்டு

source: Sign up
ta: பதிவு செய்க

# Sign Up Error
source: Could not register account
ta: கணக்கைப் பதிவு செய்ய முடியவில்லை

# Sign up for a premium membership to use this feature
source: Renew Podverse Premium to use this syncing feature, or log out to use Podverse in local mode.
ta: இந்த ஒத்திசைவு அம்சத்தைப் பயன்படுத்த போட்வர்ச் பிரீமியத்தை புதுப்பிக்கவும், அல்லது உள்ளக பயன்முறையில் போட்வெர்சைப் பயன்படுத்தவும்.

# Skip to next item in your queue
source: Skip to next in queue
ta: வரிசையில் அடுத்து செல்லவும்

# Skip track buttons are time jumps on lockscreen and bluetooth devices
source: Skip-track buttons jump time on headsets and the lockscreen.
ta: ச்கிப்-டிராக் பொத்தான் சம்ப் நேரம் எட்செட் மற்றும் பூட்டு திரையில்.

source: Sleep timer
ta: தூக்க நேரங்குறிகருவி

source: Sleep Timer
ta: தூக்க நேரங்குறிகருவி

# Social Media - Discord
source: Join our Discord server
ta: எங்கள் டிச்கார்ட் சேவையகத்தில் சேரவும்

# Social Media - GitHub
source: Source code on GitHub
ta: கிதுபில் மூலக் குறியீடு

# Social Media - Twitter
source: Follow us on Twitter
ta: ட்விட்டரில் எங்களைப் பின்தொடரவும்

# Something went wrong when resetting your password
source: Try to reset your password again.
ta: உங்கள் கடவுச்சொல்லை மீண்டும் மீட்டமைக்க முயற்சிக்கவும்.

source: Could not create a Podverse folder on external storage card:
ta: வெளிப்புற சேமிப்பக அட்டையில் ஒரு போட்வர்ச் கோப்புறையை உருவாக்க முடியவில்லை:

source: Sort
ta: வரிசைப்படுத்து

source: Source Code
ta: மூலக் குறியீடு

source: split
ta: பிளவு

source: start time
ta: தொடக்க நேரம்

source: Start time
ta: தொடக்க நேரம்

source: Start Timer
ta: டைமரைத் தொடங்குங்கள்

source: Status:
ta: நிலை:

source: Stop Timer
ta: டைமரை நிறுத்து

# Storage data exceeded message
source: Too much local data. Please cancel some subscriptions to continue.
ta: உள்ளக தரவு. தொடர சில சந்தாக்களை ரத்துசெய்.

source: Stream
ta: ச்ட்ரீம்

source: Stream Off
ta: ச்ட்ரீம் ஆஃப்

source: Stream On
ta: ச்ட்ரீம் ஆன்

source: Streaming
ta: ச்ட்ரீமிங்

# Streaming Amount
source: Per minute
ta: ஒரு நிமிடத்திற்கு

# Streaming Amount for this podcast
source: For this podcast
ta: இந்த போட்காச்டுக்கு

# Streaming splits per minute
source: Splits (per minute)
ta: பிளவுகள் (நிமிடத்திற்கு)

# Streaming Value Sent
source: Sent
ta: அனுப்பப்பட்டது

source: Submit
ta: சமர்ப்பிக்கவும்

source: Subscribe
ta: குழுசேர்

source: Subscribe to listener profiles
ta: கேட்பவரின் சுயவிவரங்களுக்கு குழுசேரவும்

source: Subscribe to podcast
ta: போட்காச்டுக்கு குழுசேரவும்

source: Subscribe to podcasts
ta: பாட்காச்ட்களுக்கு குழுசேரவும்

source: Subscribe to profile
ta: சுயவிவரத்திற்கு குழுசேரவும்

# subscribe to this podcast
source: subscribe to podcast
ta: போட்காச்டுக்கு குழுசேரவும்

source: Subscribed
ta: சந்தா

source: Subscribed Playlists
ta: சந்தா பிளேலிச்ட்கள்

source: Success
ta: செய்

source: Support
ta: உதவி

source: Support open source software
ta: திறந்த மூல மென்பொருளை ஆதரிக்கவும்

source: Sync podcasts
ta: பாட்காச்ட்களை ஒத்திசைக்கவும்

source: — Sync podcasts across devices
ta: - சாதனங்கள் முழுவதும் பாட்காச்ட்களை ஒத்திசைக்கவும்

source: Sync your subscriptions, queue, and history across all your devices
ta: உங்கள் எல்லா சாதனங்களிலும் உங்கள் சந்தாக்கள், வரிசை மற்றும் வரலாற்றை ஒத்திசைக்கவும்

# Tap the Start and End Time inputs to set them with the current track time
source: ▸ Tap the "Start time" and "End time" to set to current playback time.
ta: Play தற்போதைய பின்னணி நேரத்திற்கு அமைக்க "தொடக்க நேரம்" மற்றும் "இறுதி நேரம்" என்பதைத் தட்டவும்.

source: Terms of Service
ta: பணி விதிமுறைகள்

# TermsOfServiceScreenMatomoTrackingText1
source: Users can allow themselves to be tracked from the app. It determines popularity of content.
ta: பயன்பாட்டிலிருந்து தங்களைக் கண்காணிக்க பயனர்கள் அனுமதிக்கலாம். இது உள்ளடக்கத்தின் பிரபலத்தை தீர்மானிக்கிறது.

# TermsOfServiceScreenMatomoTrackingText2
source: The copylefted libre software Matomo is used for popularity tracking on Podverse servers. Identifiable data will never be shared or sold.
ta: போட்வெர்ச் சேவையகங்களில் பிரபலமான கண்காணிப்புக்கு நகலெடுக்கப்பட்ட லிப்ரே மென்பொருள் மாடோமோ பயன்படுத்தப்படுகிறது. அடையாளம் காணக்கூடிய தரவு ஒருபோதும் பகிரப்படாது அல்லது விற்கப்படாது.

# TermsOfServiceScreenMatomoTrackingText3
source: Popularity tracking has the IP address saved as for example 192.168.xxx.xxx.
ta: பிரபல கண்காணிப்பு ஐபி முகவரி சேமிக்கப்பட்டுள்ளது எடுத்துக்காட்டாக 192.168.xxx.xxx.

# TermsOfServiceScreenMatomoTrackingText4
source: No session IDs or cookies are used, because tracking users across visits is not OK.
ta: அமர்வு ஐடிகள் அல்லது குக்கீகள் பயன்படுத்தப்படவில்லை, ஏனெனில் வருகைகள் முழுவதும் பயனர்களைக் கண்காணிப்பது சரியில்லை.

# TermsOfServiceScreenMatomoTrackingText5
source: Keep in mind popularity may not be completely accurate.
ta: பிரபலமடைதல் முற்றிலும் துல்லியமாக இருக்காது.

# TermsOfServiceScreenMatomoTrackingTextFDroid
source: Podverse for F-Droid contains ***no tracking***, but the Podverse website and the iOS and Android versions (optionally) do.
ta: எஃப்-டிராய்டுக்கான போட்வர்ச் *** கண்காணிப்பு இல்லை ***, ஆனால் போட்வர்ச் வலைத்தளம் மற்றும் ஐஇமு மற்றும் ஆண்ட்ராய்டு பதிப்புகள் (விருப்பமாக) செய்கின்றன.

# TermsOfServiceScreenText1
source: Podverse will never sell or share private user data.
ta: போட்வர்ச் ஒருபோதும் தனிப்பட்ட பயனர் தரவை விற்கவோ பகிரவோாது.

# TermsOfServiceScreenText2
source: Podverse will never advertise next to or within a podcast's content without its permission.
ta: போட்காச்டின் அனுமதியின்றி போட்காச்டின் உள்ளடக்கத்திற்கு அடுத்ததாகவோ அல்லது உள்ளேவோ ஒருபோதும் விளம்பரம் செய்யாது.

# TermsOfServiceScreenText3
source: All audio and video files found on podverse.fm are stored and loaded from the creator's own public server, not Podverse.
ta: Podververs.fm இல் காணப்படும் அனைத்து ஆடியோ மற்றும் வீடியோ கோப்புகளும் சேமித்து வைக்கப்பட்டு படைப்பாளரின் சொந்த பொது சேவையகத்திலிருந்து ஏற்றப்படுகின்றன, போட்வெர்ச் அல்ல.

# TermsOfServiceScreenText4
source: All clips hosted on podverse.fm are crowd-sourced and unofficial, unless otherwise noted by the creator.
ta: போட்வர்ச்.

# TermsOfServiceScreenText5
source: Clips load within the full episode's media file, so users always have access to the full recording.
ta: முழு எபிசோடின் மீடியா கோப்பில் கிளிப்புகள் ஏற்றப்படுகின்றன, எனவே பயனர்கள் எப்போதும் முழு பதிவுக்கான அணுகலைக் கொண்டுள்ளனர்.

# TermsOfServiceScreenText6
source: Podverse has no responsibility for, but hosts funding links and content from third-party podcast feeds and sites with independent privacy policies.
ta: போட்வர்சுக்கு எந்தப் பொறுப்பும் இல்லை, ஆனால் மூன்றாம் தரப்பு போட்காச்ட் ஊட்டங்கள் மற்றும் சுயாதீன தனியுரிமைக் கொள்கைகளைக் கொண்ட தளங்களிலிருந்து பொருள் இணைப்புகள் மற்றும் உள்ளடக்கத்தை புரவலன் செய்கிறது.

# TermsOfServicesScreenText7
source: Podverse only stores and uses credentials for podcasts requiring authentication in the secure storage of the device.
ta: சாதனத்தின் பாதுகாப்பான சேமிப்பகத்தில் ஏற்பு தேவைப்படும் பாட்காச்ட்களுக்கான நற்சான்றிதழ்களை போட்வர்ச் மட்டுமே சேமித்து பயன்படுத்துகிறது.

# The device does not allow Podverse to access the external storage for downloads.
source: Podverse is denied access to external storage for downloads.
ta: பதிவிறக்கங்களுக்கான வெளிப்புற சேமிப்பகத்திற்கான அணுகல் போட்வர்ச் மறுக்கப்படுகிறது.

# The email may go to your Spam folder
source: The e-mail may be in your spam folder.
ta: மின்னஞ்சல் உங்கள் ச்பேம் கோப்புறையில் இருக்கலாம்.

# The start time must be before the end time
source: Start time must be before the end time.
ta: தொடக்க நேரம் இறுதி நேரத்திற்கு முன்பே இருக்க வேண்டும்.

# The start time must be greater than 0 if no end time is provided
source: Start time must be above 0 if no end time is provided.
ta: இறுதி நேரம் வழங்கப்படாவிட்டால் தொடக்க நேரம் 0 க்கு மேல் இருக்க வேண்டும்.

# Third Party Libraries
source: Libre Third-party Libraries
ta: மூன்றாம் தரப்பு நூலகங்கள்

source: This may take a while…
ta: இதற்கு சிறிது நேரம் ஆகலாம்…

source: Time range
ta: நேர வரம்பு

source: Time splits
ta: நேரம் பிளவு

# Tip: Titling your clips
source: Tip: Naming clips helps searchability and organization.
ta: உதவிக்குறிப்பு: கிளிப்புகள் பெயரிடுவது தேடல் மற்றும் அமைப்புக்கு உதவுகிறது.

source: title of playlist
ta: பிளேலிச்ட்டின் தலைப்பு

# To renew your membership please visit the Membership page
source: Renew Podverse Premium in "More → Premium".
ta: போட்வெர்ச் பிரீமியத்தை "மோர் → காப்பீடு" இல் புதுப்பிக்கவும்.

source: top — all time
ta: மேல் - எல்லா நேரமும்

# top – day
source: top — today
ta: மேல் - இன்று

# top – month
source: top — this month
ta: மேல் - இந்த மாதம்

# top – week
source: top — this week
ta: மேல் - இந்த வாரம்

# top – year
source: top — this year
ta: மேல் - இந்த ஆண்டு

source: total amount
ta: மொத்த தொகை

# Tracking
source: Popularity Tracking
ta: பிரபல கண்காணிப்பு

# trackingTermsText1
source: Turn on popularity tracking?
ta: பிரபல கண்காணிப்பை இயக்கவா?

# trackingTermsText2
source: Popularity rankings on Podverse are sorted by unique listeners.
ta: போட்வெர்சில் பிரபலமான தரவரிசை தனித்துவமான கேட்பவர்களால் வரிசைப்படுத்தப்படுகிறது.

# trackingTermsText3
source: Turn on popularity tracking to get counted in these rankings.
ta: இந்த தரவரிசையில் கணக்கிட பிரபலமான கண்காணிப்பை இயக்கவும்.

# trackingTermsText4
source: All tracked data is anonymized and hosted only on Podverse servers.
ta: கண்காணிக்கப்பட்ட அனைத்து தரவுகளும் அநாமதேயப்படுத்தப்பட்டு போட்வெர்ச் சேவையகங்களில் மட்டுமே புரவலன் செய்யப்படுகின்றன.

# trackingTermsText5
source: Podverse will never sell tracking data.
ta: போட்வர்ச் ஒருபோதும் கண்காணிப்பு தரவை விற்காது.

source: Trailer
ta: டிரெய்லர்

source: Transcript
ta: படியெடுத்தல்

source: Transcript search input
ta: டிரான்ச்கிரிப்ட் தேடல் உள்ளீடு

source: Transfer
ta: இடமாற்றம்

source: Translators
ta: மொழிபெயர்ப்பாளர்கள்

source: Tutorials
ta: பயிற்சிகள்

# Type DELETE in the input below to confirm
source: Type "Delete" below to confirm.
ta: உறுதிப்படுத்த கீழே "நீக்கு" என தட்டச்சு செய்க.

source: Unknown duration
ta: தெரியாத காலம்

source: Unplayed episode
ta: விளையாடப்படாத அத்தியாயம்

source: Unsubscribe
ta: குழுவிலகவும்

source: unsubscribe from podcast
ta: போட்காச்டிலிருந்து குழுவிலகவும்

source: unsubscribe from this profile
ta: இந்த சுயவிவரத்திலிருந்து குழுவிலகவும்

source: Untitled Chapter —
ta: பெயரிடப்படாத அத்தியாயம் -

source: Untitled Clip
ta: பெயரிடப்படாத கிளிப்

source: Untitled Episode
ta: பெயரிடப்படாத அத்தியாயம்

source: Untitled Playlist
ta: பெயரிடப்படாத பிளேலிச்ட்

source: Untitled Podcast
ta: பெயரிடப்படாத போட்காச்ட்

source: Untitled Track
ta: பெயரிடப்படாத தடம்

# Use custom API domain
source: Custom API domain
ta: தனிப்பயன் பநிஇ டொமைன்

# Use custom web domain
source: Custom web domain
ta: தனிப்பயன் வலை டொமைன்

# Use External Storage For Downloads
source: To external storage card
ta: வெளிப்புற சேமிப்பக அட்டைக்கு

source: Username
ta: பயனர்பெயர்

# value_tag_preview_boost
source: A boost sends a donation.
ta: ஒரு பூச்ட் ஒரு நன்கொடை அனுப்புகிறது.

# value_tag_preview_boostagram
source: A boostagram also adds a public message.
ta: ஒரு பூச்டாகிராம் ஒரு பொது செய்தியையும் சேர்க்கிறது.

# value_tag_preview_streaming
source: Stream sends a donation for every minuted listened.
ta: கேட்கப்பட்ட ஒவ்வொன்றிற்கும் ச்ட்ரீம் ஒரு நன்கொடை அனுப்புகிறது.

# value_tag_preview_title
source: Send Bitcoin to your favorite creators
ta: உங்களுக்கு பிடித்த படைப்பாளர்களுக்கு பிட்காயின் அனுப்பவும்
