Repository: 247i/TACETr
Catalog: உரை/தானி/podverse-podverse-rn-*.po
Languages: ta

# ARIA HINT - Type your password a second time to confirm with requirements
source: Type your password a second time to confirm. Requirements are stated below.
ta: உறுதிப்படுத்த உங்கள் கடவுச்சொல்லை இரண்டாவது முறையாக தட்டச்சு செய்க. தேவைகள் கீழே குறிப்பிடப்பட்டுள்ளன.

# ARIA HINT - Type your password with requirements
source: Type your password. Requirements are stated below.
ta: உங்கள் கடவுச்சொல்லைத் தட்டச்சு செய்க. தேவைகள் கீழே குறிப்பிடப்பட்டுள்ளன.

# ARIA HINT - Type your premium membership email address
source: Type your Podverse Premium e-mail address
ta: உங்கள் போட்வர்ச் காப்பீடு மின்னஞ்சல் முகவரியைத் தட்டச்சு செய்க

# ARIA HINT - You can optionally provide a title for your clip here
source: Optionally, title for your clip here for organization and searchability.
ta: விருப்பமாக, அமைப்பு மற்றும் தேடலுக்கு இங்கே உங்கள் கிளிப்பிற்கான தலைப்பு.

# ARIA LABEL - Queue Last
source: Enqueue Last
ta: Enqueue கடைசியாக

# ARIA LABEL - Queue Next
source: Enqueue as next
ta: அடுத்ததாக enqueue

# ARIA LABEL - repeat mode - off
source: Repeat mode is off
ta: மீண்டும் பயன்முறை முடக்கப்பட்டுள்ளது

# ARIA LABEL - repeat mode - queue
source: Repeat queue is on
ta: மீண்டும் வரிசை உள்ளது

# ARIA LABEL - repeat mode - track
source: Repeat track is on
ta: மீண்டும் பாதையில் உள்ளது

source: Audio
ta: ஆடியோ

source: Audio livestreams
ta: ஆடியோ லைவ்ச்ட்ரீம்கள்

# Auth invalid message
source: Your login session has expired. Please log in to continue using Premium features.
ta: உங்கள் உள்நுழைவு அமர்வு காலாவதியானது. காப்பீடு அம்சங்களைப் பயன்படுத்த தொடர்ந்து உள்நுழைக.

# Auth invalid title
source: Logged out
ta: வெளியேறியது

source: Auto
ta: தானி

# Auto download by default on subscribe
source: When subscribing
ta: சந்தா செலுத்தும் போது

# Auto download by default on subscribe - subtext off
source: Auto-download is off by default when subscribing to podcasts
ta: பாட்காச்ட்களுக்கு குழுசேரும்போது இயல்புநிலையாக ஆட்டோ-டவுன்லோட் முடக்கப்பட்டுள்ளது

# Auto download by default on subscribe - subtext on
source: Auto-download is on by default when subscribing to podcasts
ta: பாட்காச்ட்களுக்கு குழுசேரும்போது ஆட்டோ-டவுன்லோட் இயல்பாகவே இயங்கும்

source: Auto-downloading off
ta: ஆட்டோ-டவுனிங் ஆஃப்

source: Auto-downloading on
ta: ஆட்டோ-டவுன்லோடிங்

source: Auto-play episodes from podcast
ta: போட்காச்டிலிருந்து தானாக விளையாடும் அத்தியாயங்கள்

# Automatically add new episodes to queue
source: Auto-enqueue new episodes
ta: புதிய அத்தியாயங்களை தானாக மேம்படுத்துதல்

source: Auto-scroll off
ta: ஆட்டோ-ச்க்ரோல் ஆஃப்

source: Auto-scroll on
ta: ஆட்டோ-ச்க்ரோல் ஆன்

source: Available
ta: கிடைக்கிறது

source: Back
ta: பின்

source: Back To App
ta: பயன்பாட்டிற்குத் திரும்பு

source: Back To Login
ta: உள்நுழைவுக்குத் திரும்பு

source: Balance
ta: இருப்பு

source: Bitcoin wallet
ta: பிட்காயின் பணப்பையை

source: Bonus
ta: போனச்

source: Boost
ta: பூச்ட்

source: Boost amount
ta: தொகையை அதிகரிக்கும்

# Boost Amount for this Podcast
source: For this podcast
ta: இந்த போட்காச்டுக்கு

# Boost app explanation
source: Amount sent to Podverse each time you stream to or boost a creator.
ta: ஒவ்வொரு முறையும் நீங்கள் ஒரு படைப்பாளரை ச்ட்ரீம் செய்ய அல்லது அதிகரிக்கும் போது போட்வெர்சுக்கு அனுப்பப்படும் தொகை.

# Boost podcaster explanation
source: Amount sent to the creator.
ta: படைப்பாளருக்கு அனுப்பப்பட்ட தொகை.

source: Boost sent!
ta: அனுப்பப்பட்டது!

source: Boost splits
ta: பிளவுகளை அதிகரிக்கும்

# brandName chat is powered by
source: Podverse chat uses these libre libraries
ta: போட்வர்ச் அரட்டை இந்த லிப்ரே நூலகங்களைப் பயன்படுத்துகிறது

# Bug Report
source: Report a bug
ta: ஒரு பிழையைப் புகாரளிக்கவும்

# Buy a Podverse premium membership
source: Buy Podverse premium for yourself or others
ta: உங்களுக்கோ அல்லது மற்றவர்களுக்கோ போட்வெர்ச் காப்பீடு வாங்கவும்

source: by:
ta: வழங்கியவர்:

source: By:
ta: வழங்கியவர்:

source: cancel
ta: ரத்துசெய்

source: Cancel
ta: ரத்துசெய்

source: Cancelled
ta: ரத்து செய்யப்பட்டது

source: Category
ta: வகை

# Censor NSFW text
source: Censor text
ta: தணிக்கை உரை

source: Channel
ta: வாய்க்கால்

source: Channels
ta: சேனல்கள்

source: chapter
ta: பாடங்கள்

source: Chapter
ta: பாடங்கள்

source: Chapter Info
ta: அத்தியாயம் செய்தி

# chapter shared using brandName
source: — chapter shared using Podverse
ta: - போட்வெர்சைப் பயன்படுத்தி அத்தியாயம் பகிரப்பட்டது

source: Chapters
ta: பாடங்கள்

# Chapters are created by the podcaster
source: Chapters are created by creators
ta: அத்தியாயங்கள் படைப்பாளர்களால் உருவாக்கப்படுகின்றன

# Chapters Non-Table of Contents label
source: Display non-table of contents chapters
ta: பொருளடக்கம் இல்லாத அத்தியாயங்களைக் காண்பி

# Chapters Non-Table of Contents subtext
source: Non-table of contents chapters appear in the Player, but get skipped over when you press the skip or previous button.
ta: உள்ளடக்கங்கள் அல்லாத உள்ளடக்க அத்தியாயங்கள் பிளேயரில் தோன்றும், ஆனால் நீங்கள் ச்கிப் அல்லது முந்தைய பொத்தானை அழுத்தும்போது தவிர்க்கவும்.

source: Chat Room
ta: அரட்டை அறை

source: Chat with us on Discord
ta: முரண்பாட்டில் எங்களுடன் அரட்டையடிக்கவும்

source: Clear History
ta: வரலாற்றை அழிக்கவும்

source: Clear input
ta: உள்ளீட்டை அழிக்கவும்

source: clip
ta: கிளிப்

source: Clip
ta: கிளிப்

source: Clip Created
ta: கிளிப் உருவாக்கப்பட்டது

# clip created using brandName
source: — clip created using Podverse
ta: - போட்வெர்சைப் பயன்படுத்தி கிளிப் உருவாக்கப்பட்டது

source: Clip Error
ta: கிளிப் பிழை

source: Clip Info
ta: கிளிப் செய்தி

source: Clip Settings
ta: கிளிப் அமைப்புகள்

# clip shared using brandName
source: — clip shared using Podverse
ta: - போட்வெவர்சைப் பயன்படுத்தி கிளிப் பகிரப்பட்டது

source: Clip title
ta: கிளிப் தலைப்பு

source: Clip Updated
ta: கிளிப் புதுப்பிக்கப்பட்டது

source: clips
ta: கிளிப்புகள்

source: Clips
ta: கிளிப்புகள்

source: Close
ta: மூடு

source: Comments
ta: கருத்துகள்

# Comments are loading
source: Loading comments…
ta: கருத்துகளை ஏற்றுகிறது…

source: Confirm
ta: உறுதிப்படுத்தவும்

source: Connect to Wi-Fi to stream this episode.
ta: இந்த அத்தியாயத்தை ச்ட்ரீம் செய்ய வைஃபை உடன் இணைக்கவும்.

source: Connect to Wi-Fi to download this episode.
ta: இந்த அத்தியாயத்தைப் பதிவிறக்க வைஃபை உடன் இணைக்கவும்.

source: Connect Wallet
ta: பணப்பையை இணைக்கவும்

source: Connected
ta: இணைக்கப்பட்டுள்ளது

source: Contact
ta: தொடர்பு

# ContactXMPPChatRooms
source: XMPP chat-rooms
ta: எக்ச்எம்பிபி அரட்டை அறைகள்

# ContactXMPPText1
source: A libre universal chat platform anyone can create and host their part of.
ta: ஒரு லிப்ரே யுனிவர்சல் அரட்டை தளம் எவரும் தங்கள் பகுதியை உருவாக்கி புரவலன் செய்யலாம்.

source: Contribute
ta: பங்களிப்பு

source: Contributors
ta: பங்களிப்பாளர்கள்

source: Copyleft
ta: நகலெடுக்கும்

source: Create and share playlists
ta: பிளேலிச்ட்களை உருவாக்கி பகிர்ந்து கொள்ளுங்கள்

# Create and share podcast clips
source: Create and share clips
ta: கிளிப்களை உருவாக்கி பகிரவும்

source: Custom API domain
ta: தனிப்பயன் பநிஇ டொமைன்

source: Custom Feeds
ta: தனிப்பயன் ஊட்டங்கள்

# Custom RSS feeds to parse in parallel
source: RSS feeds to parse in parallel
ta: இணையாக அலசுவதற்கு ஆர்.எச்.எச்

# Custom RSS feeds to parse in parallel helper text
source: (More than three may cause issues.)
ta: (மூன்றுக்கும் மேற்பட்டவர்கள் சிக்கல்களை ஏற்படுத்தக்கூடும்.)

# Custom web domain
source: Web domain
ta: வலை டொமைன்

# Custom web domain subtext
source: Allows fetching app data from servers you pick.
ta: நீங்கள் எடுக்கும் சேவையகங்களிலிருந்து பயன்பாட்டு தரவைப் பெற அனுமதிக்கிறது.

# Dark Mode
source: Dark
ta: இருண்ட

source: Data Settings
ta: தரவு அமைப்புகள்

source: Debugging
ta: பிழைத்திருத்தம்

source: Delete
ta: நீக்கு

source: Delete
ta: நீக்கு

source: Delete account
ta: கணக்கை நீக்கு

# Delete All Downloaded Episodes
source: Delete library
ta: நூலகத்தை நீக்கு

source: Delete cache
ta: தற்காலிக சேமிப்பை நீக்கு

source: Delete Clip
ta: கிளிப்பை நீக்கு

# Delete Downloaded Episodes
source: Delete downloads
ta: பதிவிறக்கங்களை நீக்கு

# Delete downloaded episodes after end is reached
source: Delete when played
ta: விளையாடும்போது நீக்கு

source: Delete Episode
ta: அத்தியாயத்தை நீக்கு

# disabled clipping
source: Clipping disabled
ta: கிளிப்பிங் முடக்கப்பட்டது

# disabled add to playlist
source: Add to playlist disabled
ta: பிளேலிச்ட்டில் ஊனமுற்றோரில் சேர்க்கவும்

# Disable External Storage?
source: Turn off storage on external storage card?
ta: வெளிப்புற சேமிப்பக அட்டையில் சேமிப்பிடத்தை அணைக்கவா?

source: Disconnect Wallet
ta: பணப்பையை துண்டிக்கவும்

# Do you want to add this episode or clip
source: Add this episode or clip?
ta: இந்த அத்தியாயத்தைச் சேர்க்கவா அல்லது கிளிப்பைச் சேர்க்கவா?

# Do you want to resume
source: Resume:
ta: மீண்டும் தொடங்கு:

# Do you want to allow downloading episodes with your data plan
source: Allow using mobile data from your data plan to download episodes?
ta: அத்தியாயங்களைப் பதிவிறக்க உங்கள் தரவு திட்டத்திலிருந்து மொபைல் தரவைப் பயன்படுத்த அனுமதிக்கவா?

source: Update the download limit for all subscribed podcasts?
ta: சந்தா அனைத்து பாட்காச்ட்களுக்கும் பதிவிறக்க வரம்பைப் புதுப்பிக்கவா?

source: Done
ta: முடிந்தது

source: Download
ta: பதிவிறக்கம்

source: Download episodes
ta: அத்தியாயங்களைப் பதிவிறக்கவும்

# Download in progress
source: Downloading…
ta: பதிவிறக்கம்…

# Download my data
source: Download
ta: பதிவிறக்கம்

# Download my data explanation
source: Full copy of your data from our database.
ta: எங்கள் தரவுத்தளத்திலிருந்து உங்கள் தரவின் முழு நகல்.

source: Download limit
ta: பதிவிறக்க வரம்பு

source: Download limit off
ta: வரம்பை பதிவிறக்கவும்

source: Download limit on
ta: வரம்பைப் பதிவிறக்கவும்

source: downloaded
ta: பதிவிறக்கம்

source: Downloaded
ta: பதிவிறக்கம்

source: Downloading…
ta: பதிவிறக்கம்…

source: Downloading Episode…
ta: எபிசோட் பதிவிறக்குகிறது…

source: Downloads
ta: பதிவிறக்கங்கள்

source: Edit
ta: தொகு

source: Edit Clip
ta: கிளிப்பைத் திருத்து

source: — Edit clips and playlists
ta: - கிளிப்புகள் மற்றும் பிளேலிச்ட்களைத் திருத்தவும்

# Edit My Profile
source: Edit Profile
ta: சுயவிவரத்தைத் திருத்து

source: Edit Playlist
ta: பிளேலிச்ட்டைத் திருத்து

# Email
source: E-mail address
ta: மின்னஞ்சல் முகவரி

# Enable UnifiedPush notifications
source: Set up immediate notifications
ta: உடனடி அறிவிப்புகளை அமைக்கவும்

# Enable Lightning Pay switch description
source: Allows adding a Bitcoin wallet to support podcasts through streaming Sats and boosts.
ta: ச்ட்ரீமிங் காட்சி மற்றும் பூச்ட்கள் மூலம் பாட்காச்ட்களை ஆதரிக்க பிட்காயின் பணப்பையை சேர்க்க அனுமதிக்கிறது.

# Enable notifications in settings message
source: Turn on notifications in the device settings.
ta: சாதன அமைப்புகளில் அறிவிப்புகளை இயக்கவும்.

# End of results
source: No more results
ta: மேலும் முடிவுகள் இல்லை

source: End time
ta: இறுதி நேரம்

# End time cannot be equal to 0
source: End time cannot be "0".
ta: இறுதி நேரம் "0" ஆக இருக்க முடியாது.

source: Enjoy Podverse Premium
ta: போட்வெர்ச் பிரீமியத்தை அனுபவிக்கவும்

# Enjoy all Premium features by renewing for only
source: Enjoy all Premium features by renewing for only $18/year
ta: ஆண்டுக்கு $ 18 மட்டுமே புதுப்பிப்பதன் மூலம் அனைத்து காப்பீடு அம்சங்களையும் அனுபவிக்கவும்

source: episode
ta: அத்தியாயம்

source: Episode
ta: அத்தியாயம்

source: Episode Clips
ta: அத்தியாயம் கிளிப்புகள்

source: Episode funding links
ta: எபிசோட் பொருள் இணைப்புகள்

# Episode is loading
source: Loading episode…
ta: ஏற்றுகிறது அத்தியாயம்…

# Episode Not Found
source: Could not find the episode
ta: அத்தியாயத்தைக் கண்டுபிடிக்க முடியவில்லை

# Episode Summary
source: Summary
ta: சுருக்கம்

source: episodes
ta: அத்தியாயங்கள்

source: Episodes
ta: அத்தியாயங்கள்

# Episodes from this podcast will start playback from this time
source: Episodes skip ahead to this time
ta: அத்தியாயங்கள் இந்த நேரத்திற்கு முன்னேறுகின்றன

source: Error
ta: பிழை

source: Error reporting
ta: பிழை அறிக்கை

# Error Reporting subtext
source: Error reports are anonymous and help identify and fix bugs.
ta: பிழை அறிக்கைகள் அநாமதேயமானது மற்றும் பிழைகளை அடையாளம் காணவும் சரிசெய்யவும் உதவுங்கள்.

# Error Setting External Storage
source: Could not select external storage card
ta: வெளிப்புற சேமிப்பக அட்டையைத் தேர்ந்தெடுக்க முடியவில்லை

# error_boundary_description
source: Pardon this interruption. Feel free to listen on.
ta: குறுக்கீட்டிற்கு மன்னிப்பு. கேட்க தயங்க.

source: Expired
ta: காலாவதியான

source: Expires
ta: காலாவதியாகிறது

source: Export OPML
ta: OPML ஏற்றுமதி

source: Extend Membership
ta: உறுப்பினரை நீட்டிக்கவும்

# External Storage Enabled
source: External storage card on
ta: வெளிப்புற சேமிப்பக அட்டை

source: FAQ
ta: கேள்விகள்

source: Feature Demo
ta: அம்ச டெமோ

source: Feature request
ta: அம்ச கோரிக்கை

source: Feature unavailable for manually added feeds
ta: கைமுறையாக சேர்க்கப்பட்ட ஊட்டங்களுக்கு கிடைக்காத நற்பொருத்தம்

source: Features
ta: நற்பொருத்தங்கள்

source: Fees
ta: கட்டணம்

source: Filter
ta: வடிப்பி

source: Find
ta: கண்டுபிடி

source: Finished
ta: முடிந்தது

source: Finished episode
ta: முடிந்த அத்தியாயம்

# FOSS purchase alert text
source: To extend your Podverse membership, please visit our website. The "Renew" button will attempt to open https://podverse.fm/extend-membership in your default web browser.
ta: உங்கள் போட்வெர்ச் உறுப்பினரை நீட்டிக்க, தயவுசெய்து எங்கள் வலைத்தளத்தைப் பார்வையிடவும். "புதுப்பித்தல்" பொத்தானை உங்கள் இயல்புநிலை வலை உலாவியில் https://podverse.fm/extend-membership ஐ திறக்க முயற்சிக்கும்.

source: Free
ta: இலவசம்

# Free Trial Expired
source: Podverse Premium Expired
ta: போட்வர்ச் காப்பீடு காலாவதியானது

source: Free trial expiration date
ta: இலவச சோதனை காலாவதி தேதி

source: From
ta: இருந்து

source: From this episode
ta: இந்த அத்தியாயத்திலிருந்து

source: Full Episode
ta: முழு அத்தியாயம்

source: Funding
ta: பொருள்

source: General
ta: பொது

# Global Update
source: Update all
ta: அனைத்தையும் புதுப்பிக்கவும்

source: Go to Album
ta: ஆல்பத்திற்குச் செல்லுங்கள்

source: Go to Episode
ta: அத்தியாயத்திற்குச் செல்லுங்கள்

# Go to live podcast
source: Listen live?
ta: நேரலையில் கேளுங்கள்?

source: Go to Login
ta: உள்நுழையச் செல்லுங்கள்

# Go to next chapter
source: Next chapter
ta: அடுத்த அத்தியாயம்

source: Go to Podcast
ta: போட்காச்டுக்குச் செல்லுங்கள்

# Go to previous chapter
source: Previous chapter
ta: முந்தைய அத்தியாயம்

source: Go to Settings
ta: அமைப்புகளுக்குச் செல்லுங்கள்

source: Go to Track
ta: கண்காணிக்கச் செல்லுங்கள்

# Got It
source: OK
ta: சரி

source: Grid View
ta: கட்டம் பார்வை

# has lowercase
source: — one small letter
ta: - ஒரு சிறிய கடிதம்

# has number
source: — one number
ta: - ஒரு எண்

# has uppercase
source: — one big letter
ta: - ஒரு பெரிய கடிதம்

# Hide completed episodes by default
source: Hide completed episodes
ta: நிறைவு செய்யப்பட்ட அத்தியாயங்களை மறைக்கவும்

# Hide dividers in lists
source: No dividers in lists
ta: பட்டியல்களில் வகுப்பிகள் இல்லை

# Hide new episode count badges
source: Hide amount of new episodes
ta: புதிய அத்தியாயங்களின் அளவை மறைக்கவும்

# Hide playback speed button
source: Remove playback-speed button
ta: பிளேபேக்-வேக பொத்தானை அகற்று

source: Hide completed
ta: மறை முடிந்தது

source: History
ta: வரலாறு

source: Host
ta: விருந்தோம்பி

source: hour
ta: மணி

source: hours
ta: மணி

source: How To
ta: எப்படி

# I Accept
source: Accept
ta: ஏற்றுக்கொள்

# If a podcast inserts dynamic ads the clip start time may not stay accurate
source: ▸ Start time varies for clips with dynamic ads.
ta: ▸ தொடக்க நேரம் மாறும் விளம்பரங்களுடன் கிளிப்களுக்கு மாறுபடும்.

# If this is a password protected feed
source: If this is a password protected feed. Enter the username and password above before pressing the "Save".
ta: இது கடவுச்சொல் பாதுகாக்கப்பட்ட ஊட்டம் என்றால். "சேமி" என்பதை அழுத்துவதற்கு முன் மேலே உள்ள பயனர்பெயர் மற்றும் கடவுச்சொல்லை உள்ளிடவும்.

source: Import OPML
ta: OPML ஐ இறக்குமதி செய்க

source: Importing Feeds
ta: ஊட்டங்களை இறக்குமதி செய்தல்

source: Include username and password
ta: பயனர்பெயர் மற்றும் கடவுச்சொல் சேர்க்கவும்

source: Incomplete
ta: முழுமையற்ற

source: In progress
ta: முன்னேற்றத்தில் உள்ளது

# Internet connection required
source: Connect to the internet first
ta: முதலில் இணையத்துடன் இணைக்கவும்

source: Invalid or missing QR data
ta: தவறான அல்லது காணாமல் போன QR தரவு

# Invalid params in feed url
source: Invalid parameters in URL
ta: முகவரி இல் தவறான அளவுருக்கள்

# Invalid username or password
source: Wrong username or password
ta: தவறான பயனர்பெயர் அல்லது கடவுச்சொல்

# is at least 8 characters
source: — at least 8 characters
ta: - குறைந்தது 8 எழுத்துக்கள்

source: items:
ta: உருப்படிகள்:

# Join our Discord
source: Chat with us on Discord
ta: முரண்பாட்டில் எங்களுடன் அரட்டையடிக்கவும்

source: Join our Matrix space
ta: எங்கள் மேட்ரிக்ச் இடத்தில் சேரவும்

source: Join our XMPP server
ta: எங்கள் XMPP சேவையகத்தில் சேரவும்

source: Jump back
ta: பின்னால் செல்லவும்

# Jump backwards seconds
source: Seconds to rewind
ta: முன்னாடி வினாடிகள்

source: Jump forward
ta: முன்னோக்கி செல்லவும்

# Jump forwards seconds
source: Seconds to skip
ta: தவிர்க்க வினாடிகள்

# language - da
source: Danish
ta: டேனிச்

# language - de
source: German
ta: செர்மன்

# language - el
source: Greek
ta: கிரேக்கம்

# language - en
source: English
ta: ஆங்கிலம்

# language - es
source: Spanish
ta: ச்பானிச்

# language - fr
source: French
ta: பிரஞ்சு

# language - lt
source: Lithuanian
ta: லிதுவேனியன்

# language - nb
source: Norwegian Bokmål
ta: நார்வேசியன் பொக்மால்

# language - oc
source: Occitan
ta: ஒக்கிடன்

# language - pt
source: Portuguese
ta: போர்த்துகீசியம்

# language - ru
source: Russian
ta: ரச்ய

# language - sv
source: Swedish
ta: ச்வீடிச்

source: Last
ta: கடைசி

source: Latest
ta: அண்மைக் கால

source: Latest episode
ta: அண்மைக் கால அத்தியாயம்

# Launch screen
source: Main view
ta: முக்கிய பார்வை

# Leaving App
source: Leaving Podverse…
ta: போட்வெர்சை விட்டு வெளியேறுதல்…

# License
source: Copylefted libre license
ta: நகலெடுக்கப்பட்ட லிப்ரே உரிமம்

# Light Mode
source: Light
ta: ஒளி

source: Limit
ta: வரம்பு

# Limit the number of downloaded episodes for each podcast by default
source: Limit number of episodes to keep
ta: வைத்திருக்க அத்தியாயங்களின் எண்ணிக்கையைக் கட்டுப்படுத்துங்கள்

# Limit the number of downloaded epiosdes explanation
source: Deletes older episodes of this podcast to download new ones.
ta: புதியவற்றைப் பதிவிறக்க இந்த போட்காச்டின் பழைய அத்தியாயங்களை நீக்குகிறது.

source: List View
ta: பட்டியல் பார்வை

source: — Listen to episodes and clips
ta: - அத்தியாயங்கள் மற்றும் கிளிப்களைக் கேளுங்கள்

# Listen Tracking
source: Popularity tracking
ta: பிரபல கண்காணிப்பு

# Listen Tracking subtext
source: Popularity tracking counts you in the listening rankings.
ta: பிரபல கண்காணிப்பு கேட்கும் தரவரிசையில் உங்களை கணக்கிடுகிறது.

source: Live
ta: வாழ

source: Live chat
ta: நேரடி அரட்டை

# Livestream has ended
source: This livestream has ended.
ta: இந்த லைவ்ச்ட்ரீம் முடிந்தது.

source: Loading…
ta: ஏற்றுகிறது…

source: Local
ta: உள்ளக

source: Log out
ta: விடுபதிகை

source: Log in
ta: புகுபதிகை

# Login / Register
source: Log in or register
ta: உள்நுழைக அல்லது பதிவு செய்யுங்கள்

# Login Error
source: Could not log in
ta: உள்நுழைய முடியவில்லை

# Login Needed
source: Log in first
ta: முதலில் உள்நுழைக

# Login Status Not Saved
source: Login state not saved
ta: உள்நுழைவு நிலை சேமிக்கப்படவில்லை

source: Log in to:
ta: உள்நுழைக:

source: Log in to add to playlists
ta: பிளேலிச்ட்களில் சேர்க்க உள்நுழைக

# Login to Private Feed
source: Log in for private feed access
ta: தனியார் தீவன அணுகலுக்கு உள்நுழைக

source: Log in to view your clips
ta: உங்கள் கிளிப்களைக் காண உள்நுழைக

source: Log in to view your playlists
ta: உங்கள் பிளேலிச்ட்களைக் காண உள்நுழைக

source: Log in to view your profile
ta: உங்கள் சுயவிவரத்தைக் காண உள்நுழைக

# Login to enable podcast notifications
source: Log in to turn on podcast notifications
ta: போட்காச்ட் அறிவிப்புகளை இயக்க உள்நுழைக

source: Maintainers
ta: பராமரிப்பாளர்கள்

# Maintenance mode message
source: Our servers are down for maintenance. The app will only work in offline mode until the update is complete.
ta: எங்கள் சேவையகங்கள் பராமரிப்புக்காக கீழே உள்ளன. புதுப்பிப்பு முடியும் வரை மட்டுமே பயன்பாடு இணைப்பில்லாத பயன்முறையில் செயல்படும்.

# Maintenance mode title
source: Under maintenance
ta: பராமரிப்பின் கீழ்

# Maintenance scheduled message
source: Our servers will be offline for scheduled maintenance from {{startTime}} to {{endTime}}. The app will only be able to play downloaded episodes during the maintenance window.
ta: எங்கள் சேவையகங்கள் {{startTime}}} முதல் {{endTime}} வரை திட்டமிடப்பட்ட பராமரிப்புக்கு ஆஃப்லைனில் இருக்கும். பராமரிப்பு சாளரத்தின் போது பதிவிறக்கம் செய்யப்பட்ட அத்தியாயங்களை மட்டுமே பயன்பாடு இயக்க முடியும்.

# Maintenance scheduled title
source: Maintenance Scheduled
ta: பராமரிப்பு திட்டமிடப்பட்டுள்ளது

source: Make Clip
ta: கிளிப் செய்யுங்கள்

source: Mark All As Seen
ta: பார்த்தபடி அனைத்தையும் குறிக்கவும்

source: Mark as Played
ta: விளையாடியபடி குறி

# Mark as played loading text
source: This may take a while depending on the number of episodes for this podcast.
ta: இந்த போட்காச்டுக்கான அத்தியாயங்களின் எண்ணிக்கையைப் பொறுத்து இது சிறிது நேரம் ஆகலாம்.

source: Mark selected
ta: தேர்வு தேர்ந்தெடுக்கப்பட்டது

source: Mark as Seen
ta: பார்த்தபடி குறி

source: Mark as Unplayed
ta: விளையாடப்படாததைக் குறிக்கவும்

source: Mark episodes as played
ta: விளையாடிய எபிசோடுகளை குறிக்கவும்

source: Mark All Episodes As Played
ta: விளையாடிய அனைத்து அத்தியாயங்களையும் குறிக்கவும்

source: Mark episodes as seen
ta: பார்த்தபடி அத்தியாயங்களைக் குறிக்கவும்

source: Max playback speed
ta: அதிகபட்ச பிளேபேக் விரைவு

source: Media Type
ta: ஊடக வகை

source: Membership
ta: உறுப்பினர்

source: Message
ta: செய்தி

source: Message (optional)
ta: செய்தி (விரும்பினால்)

source: minute
ta: நிமிடங்கள்

source: minutes
ta: நிமிடங்கள்

source: Mode
ta: பயன்முறை

source: More
ta: மேலும்

source: More Info
ta: மேலும் செய்தி

source: More player options
ta: மேலும் பிளேயர் விருப்பங்கள்

# more-ellipsis
source: more…
ta: மேலும்…

source: Music
ta: இசை

# Music - Album
source: Album
ta: ஆல்பம்

# Music - Albums
source: Albums
ta: ஆல்பம்

# Music - Track
source: Track
ta: மின்தடம்

# Music - Tracks
source: Tracks
ta: தடங்கள்

# Music - Album not found
source: Could not find the album
ta: ஆல்பத்தைக் கண்டுபிடிக்க முடியவில்லை

# Music - Delete Track
source: Delete Track
ta: தடத்தை நீக்கு

source: My Clips
ta: என் கிளிப்புகள்

source: My Library
ta: எனது நூலகம்

source: My Playlists
ta: எனது பிளேலிச்ட்கள்

source: My Profile
ta: எனது சுயவிவரம்

source: Name
ta: பெயர்

source: Network error
ta: பிணைய பிழை

source: New
ta: புதிய

source: New episodes and livestream notifications
ta: புதிய அத்தியாயங்கள் மற்றும் லைவ்ச்ட்ரீம் அறிவிப்புகள்

source: New Password
ta: புதிய கடவுச்சொல்

source: New Playlist
ta: புதிய பிளேலிச்ட்

source: Newer
ta: புதியது

source: Next
ta: அடுத்தது

source: Next Up
ta: அடுத்து

source: No
ta: இல்லை

# No albums found
source: Could not find any albums
ta: எந்த ஆல்பங்களையும் கண்டுபிடிக்க முடியவில்லை

# No chapters found
source: Could not find any chapters
ta: எந்த அத்தியாயங்களையும் கண்டுபிடிக்க முடியவில்லை

# No clips found
source: Could not find any clips
ta: எந்த கிளிப்புகளையும் கண்டுபிடிக்க முடியவில்லை

# No comments found
source: No comments
ta: கருத்துகள் இல்லை

# No downloads in progress
source: Nothing is being downloaded
ta: எதுவும் பதிவிறக்கம் செய்யப்படவில்லை

# No episodes found
source: Could not find any episodes
ta: எந்த அத்தியாயங்களையும் கண்டுபிடிக்க முடியவில்லை

# No history items found
source: Could not find any history
ta: எந்த வரலாற்றையும் கண்டுபிடிக்க முடியவில்லை

# no info available
source: no available info
ta: கிடைக்கக்கூடிய செய்தி இல்லை

# No internet connection
source: No connection to the Internet
ta: இணையத்துடன் எந்த தொடர்பும் இல்லை

source: No login needed to:
ta: உள்நுழைவு தேவையில்லை:

# No playlist items found
source: Could not find any playlist items
ta: எந்த பிளேலிச்ட் உருப்படிகளையும் கண்டுபிடிக்க முடியவில்லை

# No playlists found
source: Could not find any playlists
ta: எந்த பிளேலிச்ட்களையும் கண்டுபிடிக்க முடியவில்லை
