Repository: 247i/TACETr
Catalog: உரை/தானி/podverse-podverse-rn-*.po
Languages: ta

# _translatorsFieldExample
source: Jane Doe<https://jane.doe.homepage>,Joe Bloggs,Juan Perez<https://some.socialmedia/juan>
ta: சேன் டோ <https: //jane.doe.homepage>, சோ வலைப்பதிவுகள், சுவான் பெரெச் <https: //some.socialmedia/juan>

# _moment.js date format
source: MMM Do YYYY
ta: எம்.எம்.எம்

source: 1 hour
ta: 1 மணி நேரம்

source: 1 hour 30 minutes
ta: 1 மணி 30 நிமிடங்கள்

source: 15 minutes
ta: 15 நிமிடங்கள்

# 18 per year after that
source: Renew for $18/year thereafter
ta: அதன்பிறகு ஆண்டுக்கு $ 18 க்கு புதுப்பிக்கவும்

source: 2 hours
ta: 2 மணி நேரம்

# 3 months free
source: 3 month free trial
ta: 3 மாத இலவச சோதனை

source: 30 minutes
ta: 30 நிமிடங்கள்

source: 45 minutes
ta: 45 நிமிடங்கள்

source: About
ta: பற்றி

# About Premium
source: About Podverse Premium
ta: போட்வர்ச் காப்பீடு பற்றி

source: Account
ta: கணக்கு

source: Active Downloads
ta: செயலில் பதிவிறக்கங்கள்

# Actual amount will be higher due to network fees
source: may be higher due to network fees
ta: பிணையம் கட்டணம் காரணமாக அதிகமாக இருக்கலாம்

# Add by RSS feature unavailable explanation
source: This feature is not supported for manually added feeds, as they may include paid or private feeds.
ta: இந்த நற்பொருத்தம் கைமுறையாக சேர்க்கப்பட்ட ஊட்டங்களுக்கு ஆதரிக்கப்படவில்லை, ஏனெனில் அவை கட்டண அல்லது தனிப்பட்ட ஊட்டங்களை உள்ளடக்கியிருக்கலாம்.

# Add current item next in queue when playing a new item
source: Add current item to queue when playing a new item
ta: புதிய உருப்படியை இயக்கும்போது தற்போதைய உருப்படியை வரிசையில் சேர்க்கவும்

# Add Custom RSS Feed
source: Add RSS feed
ta: RSS ஊட்டத்தைச் சேர்க்கவும்

# Add custom RSS feeds
source: Add RSS feeds
ta: RSS ஊட்டங்களைச் சேர்க்கவும்

source: Added by RSS
ta: RSS ஆல் சேர்க்கப்பட்டது

source: Add to Playlist
ta: பிளேலிச்ட்டில் சேர்க்கவும்

source: Add Wallet
ta: பணப்பையை சேர்க்கவும்

# AddPodcastByRSSScreenText1
source: Note: Clips, playlists, and sharing are not supported for feeds added here.
ta: குறிப்பு: இங்கே சேர்க்கப்பட்ட ஊட்டங்களுக்கு கிளிப்புகள், பிளேலிச்ட்கள் மற்றும் பகிர்வு ஆதரிக்கப்படவில்லை.

# AddPodcastByRSSScreenText2
source: Add a podcast with support for clips and playlists to our database.
ta: எங்கள் தரவுத்தளத்தில் கிளிப்புகள் மற்றும் பிளேலிச்ட்களுக்கான ஆதரவுடன் போட்காச்டைச் சேர்க்கவும்.

source: Advanced
ta: மேம்பட்ட

# Alby unauthorized timeout message
source: Resume using Alby by reconnecting to your wallet.
ta: உங்கள் பணப்பையுடன் மீண்டும் இணைப்பதன் மூலம் ஆல்பியைப் பயன்படுத்தி மீண்டும் தொடங்குங்கள்.

# Alby unauthorized timeout title
source: Alby disconnected
ta: ஆல்பி துண்டிக்கப்பட்டது

source: All
ta: அனைத்தும்

# All brandName software is provided free and open source under the AGPLv3 license
source: Copy, inspect, change and share — with all. All Podverse software is licensed AGPLv3+.
ta: அனைவருடனும் நகலெடுத்து, ஆய்வு, மாற்ற மற்றும் பகிர. அனைத்து போட்வர்ச் மென்பொருளும் உரிமம் பெற்ற AGPLV3+ஆகும்.

# All downloaded episodes will be deleted from External Storage.
source: All downloaded episode files will be deleted.
ta: பதிவிறக்கம் செய்யப்பட்ட அனைத்து எபிசோட் கோப்புகளும் நீக்கப்படும்.

source: All episodes in this podcast will be marked as played.
ta: இந்த போட்காச்டில் உள்ள அனைத்து அத்தியாயங்களும் விளையாடியபடி குறிக்கப்படும்.

source: All Channels
ta: அனைத்து சேனல்களும்

# All Episodes
source: All
ta: அனைத்தும்

# All Podcasts
source: All
ta: அனைத்தும்

source: amount paid
ta: செலுத்தப்பட்ட தொகை

# Analytics Tracking
source: Popularity Tracking
ta: பிரபல கண்காணிப்பு

source: Anonymous
ta: அநாமதேய

source: App
ta: பயன்பாடு

source: App Mode
ta: பயன்பாட்டு பயன்முறை

# App killed continue playback label
source: Keep app open unless manually closed
ta: கைமுறையாக மூடப்படாவிட்டால் பயன்பாட்டைத் திறந்து வைக்கவும்

# App killed continue playback subtext
source: If you find the app closes too quickly while paused in the background, or the app pauses when it returns to the foreground, you can enable this setting to ensure it stays open in the background. This may increase battery usage by the app.
ta: பின்னணியில் இடைநிறுத்தப்படும்போது பயன்பாடு மிக விரைவாக மூடப்படுவதை நீங்கள் கண்டால், அல்லது பயன்பாடு முன்புறத்திற்குத் திரும்பும்போது இடைநிறுத்தப்படுகிறது என்றால், இந்த அமைப்பை பின்னணியில் திறந்திருப்பதை உறுதிப்படுத்த நீங்கள் இயக்கலாம். இது பயன்பாட்டின் மூலம் பேட்டரி பயன்பாட்டை அதிகரிக்கக்கூடும்.

source: Approve
ta: ஒப்புதல்

# Are you sure
source: Sure?
ta: நிச்சயமாக?

# Are you sure you want to clear your history
source: Clear history?
ta: வரலாற்றை அழிக்கவா?

# Are you sure you want to delete the cache
source: Delete the cache?
ta: தற்காலிக சேமிப்பை நீக்கவா?

# Are you sure you want to delete all of your downloaded episodes
source: Delete all your downloaded episodes?
ta: நீங்கள் பதிவிறக்கம் செய்யப்பட்ட எல்லா அத்தியாயங்களையும் நீக்கவா?

source: Delete all downloaded episodes from this podcast?
ta: இந்த போட்காச்டிலிருந்து பதிவிறக்கம் செய்யப்பட்ட அனைத்து அத்தியாயங்களையும் நீக்கவா?

# Are you sure you want to delete your account
source: Delete your account?
ta: உங்கள் கணக்கை நீக்கவா?

# Ask to sync local podcasts with server
source: Save the local subscriptions to Podverse Premium so they are available on all devices?
ta: உள்ளக சந்தாக்களை போட்வர்ச் பிரீமியத்தில் சேமிக்கவும், அவை எல்லா சாதனங்களிலும் கிடைக்குமா?

source: Auto-enqueue downloaded episodes
ta: ஆட்டோ-என்க்யூ பதிவிறக்கம் செய்யப்பட்ட அத்தியாயங்கள்

# Auto queue new episodes position
source: Auto-enqueue episodes …
ta: ஆட்டோ-என்க்யூ எபிசோடுகள்…

# ARIA HINT - add a podcast by its RSS feed
source: Add a podcast by its RSS feed
ta: அதன் ஆர்எச்எச் ஊட்டத்தால் போட்காச்டைச் சேர்க்கவும்

# ARIA HINT - add this chapter last in your queue
source: Add this chapter to your queue
ta: இந்த அத்தியாயத்தை உங்கள் வரிசையில் சேர்க்கவும்

# ARIA HINT - add this chapter next in your queue
source: Play this chapter next
ta: இந்த அத்தியாயத்தை அடுத்து விளையாடுங்கள்

# ARIA HINT - add this chapter to a playlist
source: Add this chapter to a playlist
ta: இந்த அத்தியாயத்தை பிளேலிச்ட்டில் சேர்க்கவும்

# ARIA HINT - add this clip last in your queue
source: Add this clip to queue
ta: வரிசையில் இந்த கிளிப்பைச் சேர்க்கவும்

# ARIA HINT - add this clip next in your queue
source: Play this clip next
ta: இந்த கிளிப்பை அடுத்து விளையாடுங்கள்

# ARIA HINT - add this clip to a playlist
source: Add this clip to a playlist
ta: இந்த கிளிப்பை ஒரு பிளேலிச்ட்டில் சேர்க்கவும்

# ARIA HINT - add this episode last in your queue
source: Add this episode to queue
ta: வரிசையில் இந்த அத்தியாயத்தைச் சேர்க்கவும்

# ARIA HINT - add this episode next in your queue
source: Play this episode next
ta: இந்த அத்தியாயத்தை அடுத்து விளையாடுங்கள்

# ARIA HINT - add this episode to a playlist
source: Add this episode to a playlist
ta: இந்த அத்தியாயத்தை ஒரு பிளேலிச்ட்டில் சேர்க்கவும்

# ARIA HINT - add this item to a playlist
source: Add this item to a playlist
ta: இந்த உருப்படியை பிளேலிச்ட்டில் சேர்க்கவும்

# ARIA HINT - add this track last in your queue
source: Add this track to your queue
ta: இந்த பாதையை உங்கள் வரிசையில் சேர்க்கவும்

# ARIA HINT - add this track next in your queue
source: Play this track next
ta: இந்த பாதையை அடுத்து விளையாடுங்கள்

# ARIA HINT - add this track to a playlist
source: Add this track to a playlist
ta: இந்த பாதையை ஒரு பிளேலிச்ட்டில் சேர்க்கவும்

# ARIA HINT - auto download new episodes from this podcast when they are released
source: Auto-download new episodes from this podcast when released
ta: வெளியானபோது இந்த போட்காச்டிலிருந்து புதிய அத்தியாயங்களை தானாகவே ஏற்றவும்

# ARIA HINT - auto queue new episodes position
source: Auto-enqueue to the start or end of playlists?
ta: பிளேலிச்ட்களின் தொடக்க அல்லது முடிவுக்கு தானாக முன்னேற்றம்?

# ARIA HINT - change the colors of the user interface
source: Change the colours of the user interface
ta: பயனர் இடைமுகத்தின் வண்ணங்களை மாற்றவும்

# ARIA HINT - change the privacy setting for your clip
source: Require a link to view your clip, or make it public for anyone browsing the app.
ta: உங்கள் கிளிப்பைக் காண ஒரு இணைப்பு தேவை, அல்லது பயன்பாட்டை உலாவக்கூடிய எவருக்கும் இது பகிரங்கப்படுத்தவும்.

# ARIA HINT - clear the end time for this clip
source: Clear the end time for this clip
ta: இந்த கிளிப்பிற்கான இறுதி நேரத்தை அழிக்கவும்

# ARIA HINT - clear the new episode indicators for all podcasts
source: Clear indication of new episodes for all podcasts
ta: அனைத்து பாட்காச்ட்களுக்கும் புதிய அத்தியாயங்களின் தெளிவான அறிகுறி

# ARIA HINT - clear the new episode indicators for only this podcast
source: Clear indication of this episode being new
ta: இந்த அத்தியாயம் புதியது என்பதற்கான தெளிவான அறிகுறி

# ARIA HINT - continue to the Make Clip screen
source: Continue to "Make clip"
ta: "கிளிப்பை உருவாக்கு"

# ARIA HINT - create a new playlist
source: Create a new playlist
ta: புதிய பிளேலிச்ட்டை உருவாக்கவும்

# ARIA HINT - current playback speed
source: Change the playback speed.
ta: பிளேபேக் வேகத்தை மாற்றவும்.

# ARIA HINT - Current playback time
source: Current playback time
ta: தற்போதைய பின்னணி நேரம்

# ARIA HINT - Currently selected filter
source: Selected filter
ta: தேர்ந்தெடுக்கப்பட்ட வடிகட்டி

# ARIA HINT - delete all the episodes you have downloaded for this podcast
source: Delete all downloaded episodes of this podcast
ta: இந்த போட்காச்டின் பதிவிறக்கம் செய்யப்பட்ட அனைத்து அத்தியாயங்களையும் நீக்கு

# ARIA HINT - delete this downloaded episode
source: Delete this downloaded episode
ta: பதிவிறக்கம் செய்யப்பட்ட இந்த அத்தியாயத்தை நீக்கு

# ARIA HINT - delete this downloaded music track
source: Delete this downloaded track
ta: பதிவிறக்கம் செய்யப்பட்ட இந்த பாதையை நீக்கு

# ARIA HINT - disable the downloaded episode limit for this podcast
source: Remove download limit for this podcast
ta: இந்த போட்காச்டுக்கான பதிவிறக்க வரம்பை அகற்று

# ARIA HINT - dismiss this menu
source: Dismiss
ta: தள்ளுபடி

# ARIA HINT - dismiss this screen
source: Dismiss
ta: தள்ளுபடி

# ARIA HINT - download this album
source: Download album
ta: ஆல்பத்தைப் பதிவிறக்கவும்

# ARIA HINT - download this episode
source: Download episode
ta: அத்தியாயம் பதிவிறக்கவும்

# ARIA HINT - edit this playlist
source: Edit this playlist
ta: இந்த பிளேலிச்ட்டைத் திருத்தவும்

# ARIA HINT - edit this playlist title
source: Edit this playlist title
ta: இந்த பிளேலிச்ட் தலைப்பைத் திருத்தவும்

# ARIA HINT - episode duration
source: Episode duration
ta: அத்தியாயம் காலம்

# ARIA HINT - Error something went wrong with playing this item
source: Could not play this.
ta: இதை விளையாட முடியவில்லை.

# ARIA HINT - go back to the login screen
source: Go back to the login screen
ta: உள்நுழைவுத் திரைக்குச் செல்லவும்

# ARIA HINT - go to the Bitcoin wallet setup screen
source: Go to the setup for Bitcoin wallets
ta: பிட்காயின் பணப்பைகளுக்கான அமைப்பிற்குச் செல்லவும்

# ARIA HINT - go to the edit my profile screen
source: Go to the edit my profile screen
ta: எனது சுயவிவரத் திரையைத் திருத்துச் செல்லவும்

# ARIA HINT - go to the FAQ page
source: Go to the FAQ page
ta: கேள்விகள் பக்கத்திற்குச் செல்லவும்

# ARIA HINT - go to the funding information for this podcast
source: Go to the funding info for this podcast
ta: இந்த போட்காச்டுக்கான பொருள் தகவலுக்குச் செல்லவும்

# ARIA HINT - go to the login screen
source: Go to the login
ta: உள்நுழைவுக்குச் செல்லுங்கள்

# ARIA HINT - go to current livestream time
source: Go to current livestream time
ta: தற்போதைய லைவ்ச்ட்ரீம் நேரத்திற்குச் செல்லுங்கள்

# ARIA HINT - go to the search screen
source: Go to the search
ta: தேடலுக்குச் செல்லுங்கள்

# ARIA HINT - go to the sleep timer screen
source: Go to the sleep timer
ta: ச்லீப் டைமருக்குச் செல்லுங்கள்

# ARIA HINT - go to your queue
source: Go to queue
ta: வரிசைக்குச் செல்லுங்கள்

# ARIA HINT - Hide podcast settings
source: Hide podcast settings
ta: போட்காச்ட் அமைப்புகளை மறைக்கவும்

# ARIA HINT - learn more about premium memberships
source: More about Podverse Premium
ta: போட்வர்ச் காப்பீடு பற்றி மேலும்

source: Limit the number of saved episodes
ta: சேமித்த அத்தியாயங்களின் எண்ணிக்கையை கட்டுப்படுத்துங்கள்

# ARIA HINT - make a clip from this episode
source: Make a clip from this episode
ta: இந்த அத்தியாயத்திலிருந்து ஒரு கிளிப்பை உருவாக்கவும்

# ARIA HINT - Max playback speed
source: Max playback speed for your player
ta: உங்கள் பிளேயருக்கான அதிகபட்ச பிளேபேக் விரைவு

# ARIA HINT - Membership - Create and share clips
source: Create and share clips with Podverse Premium.
ta: போட்வெர்ச் பிரீமியத்துடன் கிளிப்களை உருவாக்கி பகிரவும்.

# ARIA HINT - Membership features header
source: Functionality, and Podverse Premium features.
ta: செயல்பாடு, மற்றும் போட்வர்ச் காப்பீடு நற்பொருத்தங்கள்.

# ARIA HINT - Now playing
source: Now playing
ta: இப்போது விளையாடுகிறது

source: Tap to hide settings, and to position episodes lower down.
ta: அமைப்புகளை மறைக்கத் தட்டவும், அத்தியாயங்களை குறைக்கவும்.

source: Tap to hide episodes, and to position settings lower down.
ta: அத்தியாயங்களை மறைக்கத் தட்டவும், அமைப்புகளை குறைக்கவும்.

# ARIA HINT - open the full player screen
source: Open the full player screen
ta: முழு பிளேயர் திரையைத் திறக்கவும்

# ARIA HINT - open your email client to request a podcast by email
source: Request a podcast by e-mail and open it in from your e-mail inbox
ta: மின்னஞ்சல் மூலம் போட்காச்டைக் கோருங்கள், அதை உங்கள் மின்னஞ்சல் இன்பாக்சிலிருந்து திறக்கவும்

# ARIA HINT - pause playback
source: Pause playback
ta: இடைநிறுத்தப்பட்ட பின்னணி

# ARIA HINT - remove this item
source: Remove this item
ta: இந்த உருப்படியை அகற்று

# ARIA HINT - renew your premium membership
source: Renew Podverse Premium
ta: போட்வெர்ச் பிரீமியத்தை புதுப்பிக்கவும்

# ARIA HINT - resume playing
source: Resume
ta: மீண்டும் தொடங்குங்கள்

# ARIA HINT - save these changes to your profile
source: Save these changes to your profile
ta: இந்த மாற்றங்களை உங்கள் சுயவிவரத்தில் சேமிக்கவும்

# ARIA HINT - Select a category from the list below
source: Select a category from the list. When a category is selected its subcategories appear below it.
ta: பட்டியலிலிருந்து ஒரு வகையைத் தேர்ந்தெடுக்கவும். ஒரு வகை தேர்ந்தெடுக்கப்பட்டால் அதன் துணைப்பிரிவுகள் அதற்குக் கீழே தோன்றும்.

# ARIA HINT - Select a primary filter from the list below
source: Select a primary filter from the list below.
ta: கீழே உள்ள பட்டியலிலிருந்து முதன்மை வடிப்பானைத் தேர்ந்தெடுக்கவும்.

# ARIA HINT - Select a sorting filter from the list below
source: Select a sorting filter from the list below.
ta: கீழே உள்ள பட்டியலிலிருந்து ஒரு வரிசையாக்க வடிப்பானைத் தேர்ந்தெடுக்கவும்.

# ARIA HINT - send a password reset link to your email address
source: Receive a password reset link in your e-mail inbox
ta: உங்கள் மின்னஞ்சல் இன்பாக்சில் கடவுச்சொல் மீட்டமைப்பு இணைப்பைப் பெறுங்கள்

# ARIA HINT - send us an email to request a podcast
source: E-mail us podcast requests
ta: எங்களுக்கு போட்காச்ட் கோரிக்கைகளை மின்னஞ்சல் அனுப்புங்கள்

source: Max episodes to save of each podcast
ta: ஒவ்வொரு போட்காச்டையும் சேமிக்க அதிகபட்ச அத்தியாயங்கள்

source: Max episodes of this podcast to save
ta: சேமிக்க இந்த போட்காச்டின் அதிகபட்ச அத்தியாயங்கள்

source: — Seconds to rewind when "Skip backwards" is pressed
ta: - "பின்னோக்கி ச்கிப்" அழுத்தும்போது முன்னாடி வைக்க வினாடிகள்

source: — Seconds to forward when "Skip ahead" is pressed
ta: - "முன்னால் தவிர்க்கவும்" அழுத்தும்போது முன்னோக்கிச் செல்ல வினாடிகள்

# ARIA HINT - set the time you want this episode to always start playing from
source: A time to always start this episode from
ta: இந்த அத்தியாயத்தை எப்போதும் தொடங்குவதற்கான நேரம்

# ARIA HINT - share this album
source: Share album
ta: ஆல்பம் பகிர்ந்து கொள்ளுங்கள்

# ARIA HINT - share this chapter
source: Share chapter
ta: பகிர்வு அத்தியாயம்

# ARIA HINT - share this clip
source: Share clip
ta: கிளிப்பைப் பகிரவும்

# ARIA HINT - share this episode
source: Share episode
ta: அத்தியாயம் பகிர்வு

# ARIA HINT - share this item
source: Share item
ta: உருப்படியைப் பகிரவும்

# ARIA HINT - share this playlist
source: Share playlist
ta: பிளேலிச்ட்டைப் பகிரவும்

# ARIA HINT - share this podcast
source: Share podcast
ta: பகிர்வு போட்காச்ட்

# ARIA HINT - share this profile
source: Share profile
ta: சுயவிவரத்தைப் பகிரவும்

# ARIA HINT - share this track
source: Share track
ta: பகிர்வு டிராக்

# ARIA HINT - show clips from this episode
source: Show clips from the episode
ta: அத்தியாயத்திலிருந்து கிளிப்களைக் காட்டு

# ARIA HINT - show how to information for the make clip screen
source: Show instructions for "Make clip"
ta: "கிளிப்பை உருவாக்கு" என்பதற்கான வழிமுறைகளைக் காட்டு

# ARIA HINT - show more info about this podcast
source: More info about podcast
ta: போட்காச்ட் பற்றிய கூடுதல் செய்தி

# ARIA HINT - show more options for this
source: More options
ta: மேலும் விருப்பங்கள்

# ARIA HINT - show more player screen options
source: More player options
ta: மேலும் பிளேயர் விருப்பங்கள்

# ARIA HINT - Show podcast settings
source: Show podcast settings
ta: போட்காச்ட் அமைப்புகளைக் காட்டு

# ARIA HINT - show the chapters for this episode
source: Chapters
ta: பாடங்கள்

# ARIA HINT - sign up for a premium membership
source: Get Podverse Premium
ta: போட்வெர்ச் பிரீமியத்தைப் பெறுங்கள்

# ARIA HINT - stop auto downloading new episodes from this podcast
source: Stop auto-downloading new episodes
ta: புதிய அத்தியாயங்களை தானாகவே ஏற்றுவதை நிறுத்துங்கள்

# ARIA HINT - stream this chapter
source: Stream chapter
ta: ச்ட்ரீம் அத்தியாயம்

# ARIA HINT - stream this clip
source: Stream clip
ta: ச்ட்ரீம் கிளிப்

# ARIA HINT - stream this episode
source: Stream episode
ta: ச்ட்ரீம் அத்தியாயம்

# ARIA HINT - stream this track
source: Stream track
ta: ச்ட்ரீம் டிராக்

# ARIA HINT - subscribe to this custom RSS feed
source: Subscribe to this custom RSS feed
ta: இந்த தனிப்பயன் RSS ஊட்டத்திற்கு குழுசேரவும்

# ARIA HINT - tap to add to this playlist
source: Tap to add to this playlist
ta: இந்த பிளேலிச்ட்டில் சேர்க்க தட்டவும்

# ARIA HINT - tap to go to this playlist
source: Tap to go to this playlist
ta: இந்த பிளேலிச்ட்டுக்கு செல்ல தட்டவும்

# ARIA HINT - tap to go to this profile
source: Tap to go to this profile
ta: இந்த சுயவிவரத்திற்கு செல்ல தட்டவும்

# ARIA HINT - tap to play this episode
source: Tap to play this episode
ta: இந்த அத்தியாயத்தை இயக்க தட்டவும்

# ARIA HINT - tap to play this track
source: Tap to play this track
ta: இந்த பாதையை இயக்க தட்டவும்

source: Tap to set the current playback position as the end time for this clip
ta: இந்த கிளிப்பின் இறுதி நேரமாக தற்போதைய பின்னணி நிலையை அமைக்க தட்டவும்

source: Tap to set the current playback position as the start time for this clip
ta: இந்த கிளிப்பின் தொடக்க நேரமாக தற்போதைய பின்னணி நிலையை அமைக்க தட்டவும்

# ARIA HINT - tap to show options for this episode
source: Tap to show options for this episode
ta: இந்த அத்தியாயத்திற்கான விருப்பங்களைக் காட்ட தட்டவும்

# ARIA HINT - tap to start removing items from this playlist
source: Tap to show a "Remove" button after each item on this playlist.
ta: இந்த பிளேலிச்ட்டில் உள்ள ஒவ்வொரு உருப்படிக்கும் பிறகு "அகற்று" பொத்தானைக் காட்ட தட்டவும்.

# ARIA HINT - tap to start removing items from your history
source: Tap to show a "Remove" button after each item in your history.
ta: உங்கள் வரலாற்றில் ஒவ்வொரு பொருளுக்கும் பிறகு "அகற்று" பொத்தானைக் காட்ட தட்டவும்.

# ARIA HINT - tap to start removing items from your queue
source: Tap to show a "Remove" button after each item in your queue.
ta: உங்கள் வரிசையில் உள்ள ஒவ்வொரு பொருளுக்கும் பிறகு "அகற்று" பொத்தானைக் காட்ட தட்டவும்.

# ARIA HINT - tap to stop removing items from your history
source: Tap to hide the "Remove" button after each item in your history.
ta: உங்கள் வரலாற்றில் உள்ள ஒவ்வொரு பொருளுக்கும் பிறகு "அகற்று" பொத்தானை மறைக்க தட்டவும்.

# ARIA HINT - tap to stop removing items from your queue
source: Tap to hide the "Remove" button after each item in your queue.
ta: உங்கள் வரிசையில் உள்ள ஒவ்வொரு பொருளுக்கும் பிறகு "அகற்று" பொத்தானை மறைக்க தட்டவும்.

# ARIA HINT - tap to switch between queue and history
source: Tap to switch between queue and history
ta: வரிசைக்கும் வரலாற்றிற்கும் இடையில் மாற தட்டவும்

source: ARIA HINT - toggle podcast screen display
ta: ஏரியா குறிப்பு - போட்காச்ட் திரை காட்சியை மாற்றவும்

# ARIA HINT - This is a list of clips created from this episode
source: List of clips created from this episode
ta: இந்த அத்தியாயத்திலிருந்து உருவாக்கப்பட்ட கிளிப்களின் பட்டியல்

# ARIA HINT - This is a list of the chapters for this episode
source: List of the chapters for this episode
ta: இந்த அத்தியாயத்திற்கான அத்தியாயங்களின் பட்டியல்

source: Renewal date for your Podverse Premium
ta: உங்கள் போட்வெர்ச் பிரீமியத்திற்கான புதுப்பித்தல் தேதி

# ARIA HINT - This is the episode publication date
source: Episode publication date
ta: அத்தியாயம் வெளியீட்டு தேதி

# ARIA HINT - This is the episode title
source: Episode title
ta: அத்தியாயம் தலைப்பு

# ARIA HINT - This is the membership status of your currently logged-in account
source: Podverse Premium availability for your logged-in account
ta: உங்கள் உள்நுழைந்த கணக்கிற்கான போட்வர்ச் காப்பீடு கிடைக்கும்

# ARIA HINT - This is the now playing chapter
source: — the playing chapter
ta: - விளையாடும் அத்தியாயம்

# ARIA HINT - This is the now playing chapter info
source: Info about the playing chapter
ta: விளையாடும் அத்தியாயத்தைப் பற்றிய செய்தி

# ARIA HINT - This is the now playing clip
source: The playing clip
ta: விளையாடும் கிளிப்

# ARIA HINT - This is the now playing clip info
source: Info about playing clip
ta: கிளிப் விளையாடுவது பற்றிய செய்தி

# ARIA HINT - This is the now playing episode
source: — the playing episode
ta: - விளையாடும் அத்தியாயம்

# ARIA HINT - This is the now playing info selector
source: Tap to change the "Now playing" info displayed below. Player controls are available on the bottom.
ta: கீழே காட்டப்பட்டுள்ள "இப்போது விளையாடும்" தகவலை மாற்ற தட்டவும். பிளேயர் கட்டுப்பாடுகள் கீழே கிடைக்கின்றன.

# ARIA HINT - This is the podcast title
source: Podcast title
ta: போட்காச்ட் தலைப்பு

# ARIA HINT - This is the profile name
source: Profile name
ta: சுயவிவர பெயர்

# ARIA HINT - This is the selected filter for this screen
source: Selected filter
ta: தேர்ந்தெடுக்கப்பட்ட வடிகட்டி

source: Select a different sorting filter.
ta: வேறு வரிசையாக்க வடிப்பானைத் தேர்ந்தெடுக்கவும்.

# ARIA HINT - This is your profile name
source: Your profile name
ta: உங்கள் சுயவிவர பெயர்

# ARIA HINT - This is your profile name edit
source: Your editable profile name.
ta: உங்கள் திருத்தக்கூடிய சுயவிவர பெயர்.

# ARIA HINT - This section contains links to ways you can support this podcast
source: Links for ways to support this podcast
ta: இந்த போட்காச்டை ஆதரிப்பதற்கான வழிகளுக்கான இணைப்புகள்

source: V4V info for this podcast
ta: இந்த போட்காச்டுக்கான V4V செய்தி

# ARIA HINT - type a username and password for this feed
source: Type a username and password for this feed
ta: இந்த ஊட்டத்திற்கு பயனர்பெயர் மற்றும் கடவுச்சொல்லை தட்டச்சு செய்க

source: Type a valid e-mail and matching password to get a "Sign up" button
ta: "பதிவுபெறு" பொத்தானைப் பெற சரியான மின்னஞ்சல் மற்றும் பொருந்தும் கடவுச்சொல்லைத் தட்டச்சு செய்க

# ARIA HINT - Type a valid email and password to enable the login button
source: Type a valid e-mail and password to get a "Log in" button
ta: "உள்நுழைவு" பொத்தானைப் பெற சரியான மின்னஞ்சல் மற்றும் கடவுச்சொல்லை தட்டச்சு செய்க

source: Type or paste your RSS URL here. Press "Save" when finished.
ta: உங்கள் RSS முகவரி ஐ இங்கே தட்டச்சு செய்யுங்கள் அல்லது ஒட்டவும். முடிந்ததும் "சேமி" என்பதை அழுத்தவும்.

# ARIA HINT - Type to show only the transcript text that includes this search term
source: Type something to find matching terms in this episode's transcript.
ta: இந்த எபிசோட் டிரான்ச்கிரிப்ட்டில் பொருந்தக்கூடிய சொற்களைக் கண்டறிய ஏதாவது தட்டச்சு செய்க.

# ARIA HINT - Type your email address in the previous input
source: Type your e-mail address in the previous field
ta: முந்தைய புலத்தில் உங்கள் மின்னஞ்சல் முகவரியைத் தட்டச்சு செய்க

# ARIA HINT - Type your password
source: Type your password
ta: உங்கள் கடவுச்சொல்லைத் தட்டச்சு செய்க
