Repository: 247i/TACETr
Catalog: உரை/தானி/pretendonetwork-juxtaposition-*.po
Languages: ta

# language
source: English
ta: ஆங்கிலம்

# global.user_page
source: User Page
ta: பயனர் பக்கம்

# global.activity_feed
source: Activity Feed
ta: செயல்பாட்டு ஊட்டம்

# global.communities
source: Communities
ta: சமூகங்கள்

# global.messages
source: Messages
ta: செய்திகள்

# global.notifications
source: Notifications
ta: அறிவிப்புகள்

# global.go_back
source: Go Back
ta: திரும்பிச் செல்லுங்கள்

# global.back
source: Back
ta: பின்

# global.yeahs
source: Yeahs
ta: ஆம்

# global.more
source: Load More Posts
ta: மேலும் இடுகைகளை ஏற்றவும்

# global.no_posts
source: No Posts
ta: பதிவுகள் இல்லை

# global.private
source: Private
ta: தனிப்பட்ட

# global.close
source: Close
ta: மூடு

# global.save
source: Save
ta: சேமி

# global.exit
source: Exit
ta: வெளியேறு

# global.next
source: Next
ta: அடுத்தது

# all_communities.text
source: All Communities
ta: அனைத்து சமூகங்களும்

# all_communities.announcements
source: Announcements
ta: அறிவிப்புகள்

# all_communities.ann_string
source: Click here to view recent announcements!
ta: அண்மைக் கால அறிவிப்புகளைக் காண இங்கே சொடுக்கு செய்க!

# all_communities.popular_places
source: Popular Places
ta: பிரபலமான இடங்கள்

# all_communities.new_communities
source: New Communities
ta: புதிய சமூகங்கள்

# all_communities.show_all
source: Show All
ta: அனைத்தையும் காட்டு

# all_communities.search
source: Search communities...
ta: சமூகங்களைத் தேடுங்கள் ...

# community.follow
source: Follow Community
ta: சமூகத்தைப் பின்பற்றுங்கள்

# community.following
source: Following
ta: பின்வருமாறு

# community.followers
source: Followers
ta: பின்தொடர்பவர்கள்

# community.posts
source: Posts
ta: இடுகைகள்

# community.tags
source: Tags
ta: குறிச்சொற்கள்

# community.recent
source: Recent Posts
ta: அண்மைக் கால இடுகைகள்

# community.popular
source: Popular Posts
ta: பிரபலமான இடுகைகள்

# community.verified
source: Verified Posts
ta: சரிபார்க்கப்பட்ட பதிவுகள்

# community.new
source: New Post
ta: புதிய இடுகை

# user_page.country
source: Country
ta: நாடு

# user_page.birthday
source: Birthday
ta: பிறந்த நாள்

# user_page.game_experience
source: Game Experience
ta: விளையாட்டு பட்டறிவு

# user_page.posts
source: Posts
ta: இடுகைகள்

# user_page.friends
source: Friends
ta: நண்பர்கள்

# user_page.following
source: Following
ta: பின்வருமாறு

# user_page.followers
source: Followers
ta: பின்தொடர்பவர்கள்

# user_page.follow_user
source: Follow
ta: பின்தொடர்

# user_page.following_user
source: Following
ta: பின்வருமாறு

# user_page.befriend
source: Befriend
ta: நட்பு

# user_page.pending
source: Pending
ta: நிலுவையில் உள்ளது

# user_page.unfriend
source: Unfriend
ta: நட்பு

# user_page.no_friends
source: No Friends
ta: நண்பர்கள் இல்லை

# user_page.no_following
source: Not Following Anyone
ta: யாரையும் பின்பற்றவில்லை

# user_page.no_followers
source: No Followers
ta: பின்தொடர்பவர்கள் இல்லை

# user_settings.profile_settings
source: Profile Settings
ta: சுயவிவர அமைப்புகள்

# user_settings.show_country
source: Show Country on Profile
ta: சுயவிவரத்தில் நாட்டைக் காட்டு

# user_settings.show_birthday
source: Show Birthday on Profile
ta: சுயவிவரத்தில் பிறந்தநாளைக் காட்டு

# user_settings.show_game
source: Show Game Experience on Profile
ta: சுயவிவரத்தில் விளையாட்டு அனுபவத்தைக் காட்டு

# user_settings.show_comment
source: Show Comment on Profile
ta: சுயவிவரத்தில் கருத்தைக் காட்டு

# user_settings.profile_comment
source: Profile Comment
ta: சுயவிவர கருத்து

# user_settings.swearing
source: Profile comment cannot contain explicit language.
ta: சுயவிவரக் கருத்தில் வெளிப்படையான மொழியைக் கொண்டிருக்க முடியாது.

# activity_feed.empty
source: It's empty here. Try following someone!
ta: இது இங்கே காலியாக உள்ளது. யாரையாவது பின்தொடர முயற்சிக்கவும்!

# notifications.none
source: No notifications.
ta: அறிவிப்புகள் இல்லை.

# notifications.new_follower
source: followed you!
ta: உங்களைப் பின்தொடர்ந்தார்!

# new_post.new_post_text
source: New Post
ta: புதிய இடுகை

# new_post.post_to
source: Post to
ta: இடுகை

# new_post.text_hint
source: Tap here to make a post.
ta: ஒரு இடுகையை உருவாக்க இங்கே தட்டவும்.

# new_post.swearing
source: Post cannot contain explicit language.
ta: இடுகையில் வெளிப்படையான மொழியைக் கொண்டிருக்க முடியாது.

# messages.coming_soon
source: Messages isn't ready yet. Check back soon!
ta: செய்திகள் இன்னும் தயாராக இல்லை. விரைவில் சரிபார்க்கவும்!

# setup.welcome
source: Welcome to Juxtaposition!
ta: சுருக்கத்திற்கு வருக!

# setup.welcome_text
source: Juxt is a gaming community that connects people from all over the world using Mii characters. Use Juxt to share your gaming experiences and meet people from around the world.
ta: MIIXT என்பது ஒரு கேமிங் சமூகம், இது உலகெங்கிலும் உள்ள மக்களை MII எழுத்துக்களைப் பயன்படுத்தி இணைக்கிறது. உங்கள் கேமிங் அனுபவங்களைப் பகிர்ந்து கொள்ளவும், உலகெங்கிலும் உள்ளவர்களைச் சந்திக்கவும் சாக்ச்டைப் பயன்படுத்தவும்.

# setup.beta
source: Beta Disclaimer
ta: பீட்டா மறுப்பு

# setup.beta_text.first
source: You are about to try out the first public beta of Juxt. This means that a lot is still up in the air, and a lot can change at any time.
ta: நீங்கள் முதல் பொது பீட்டாவை முயற்சிக்க உள்ளீர்கள். இதன் பொருள் நிறைய நிறைய காற்றில் உள்ளது, மேலும் எந்த நேரத்திலும் நிறைய மாறலாம்.

# setup.beta_text.second
source: This can and may include a total wipe of the database at the conclusion or during the beta period.
ta: இது முடிவில் அல்லது பீட்டா காலகட்டத்தில் தரவுத்தளத்தின் மொத்த துடைப்பைக் கொண்டிருக்கலாம்.

# setup.beta_text.third
source: The website, its software and all content found on it are provided on an “as is” and “as available” basis. The Pretendo Network does not give any warranties, whether express or implied, as to the suitability or usability of the website, its software or any of its content.
ta: வலைத்தளம், அதன் மென்பொருள் மற்றும் அதில் காணப்படும் அனைத்து உள்ளடக்கங்களும் “இருப்பது” மற்றும் “கிடைக்கக்கூடிய” அடிப்படையில் வழங்கப்படுகின்றன. வலைத்தளத்தின், அதன் மென்பொருள் அல்லது அதன் எந்தவொரு உள்ளடக்கத்தின் பொருந்தக்கூடிய தன்மை அல்லது பயன்பாட்டினைப் பொறுத்தவரை, எக்ச்பிரச் அல்லது மறைமுகமாக இருந்தாலும் ப்ரெடெண்டோ பிணையம் எந்த உத்தரவாதங்களையும் கொடுக்கவில்லை.

# setup.info
source: What is Juxtaposition?
ta: சுருக்கம் என்றால் என்ன?

# setup.info_text
source: Juxt is a user-driven gaming community where you can interact with people all over the world. You can write or draw posts in game communities or send messages directly to your friends.
ta: JUXT ஒரு பயனர் உந்துதல் கேமிங் சமூகமாகும், அங்கு நீங்கள் மக்களுடன் தொடர்பு கொள்ளலாம் உலகம் முழுவதும். நீங்கள் விளையாட்டு சமூகங்களில் இடுகைகளை எழுதலாம் அல்லது வரையலாம் அல்லது உங்கள் நண்பர்களுக்கு நேரடியாக செய்திகளை அனுப்பலாம்.

# setup.rules
source: Juxt Rules
ta: Ruxts விதிகள்

# setup.rules_text.first
source: The following are some important guidelines for making Juxt a fun and enjoyable experience for everyone. The Juxt Code of Conduct contains detailed information, so please read it carefully.
ta: அனைவருக்கும் வேடிக்கையான மற்றும் சுவையான அனுபவமாக மாற்றுவதற்கான சில முக்கியமான வழிகாட்டுதல்கள் பின்வருமாறு. நடத்தை நெறிமுறையில் விரிவான தகவல்கள் உள்ளன, எனவே தயவுசெய்து அதை கவனமாகப் படியுங்கள்.

# setup.rules_text.second
source: Posts Can Be Viewed Around the World
ta: இடுகைகளை உலகம் முழுவதும் காணலாம்

# setup.rules_text.third
source: Juxt contains many gaming communities where people from all over the world can share their thoughts. When you post in a community, remember that everyone can see it, so please express yourself in a way that everyone can enjoy. Use common sense, and think before you post. Juxt is a service that is also accessible from the Internet, so bear in mind that people who don't use Juxt may also see your posts. Additionally, any comments you make on your friends’ posts will be seen not by just your friends but by people around the world, too. Please keep this in mind.
ta: உலகெங்கிலும் உள்ள மக்கள் தங்கள் எண்ணங்களைப் பகிர்ந்து கொள்ளக்கூடிய பல கேமிங் சமூகங்கள் உள்ளன. நீங்கள் ஒரு சமூகத்தில் இடுகையிடும்போது, ​​எல்லோரும் அதைப் பார்க்க முடியும் என்பதை நினைவில் கொள்ளுங்கள், எனவே எல்லோரும் அனுபவிக்கக்கூடிய வகையில் உங்களை வெளிப்படுத்துங்கள். பொது அறிவைப் பயன்படுத்துங்கள், நீங்கள் இடுகையிடுவதற்கு முன் சிந்தியுங்கள். JUXT என்பது இணையத்திலிருந்து அணுகக்கூடிய ஒரு சேவையாகும், எனவே உங்கள் இடுகைகளைப் பயன்படுத்தாதவர்களும் பார்க்கக்கூடும் என்பதை நினைவில் கொள்ளுங்கள். கூடுதலாக, உங்கள் நண்பர்களின் இடுகைகளில் நீங்கள் செய்யும் எந்தவொரு கருத்துகளும் உங்கள் நண்பர்களால் மட்டுமல்ல, உலகெங்கிலும் உள்ளவர்களால் பார்க்கப்படும். இதை மனதில் கொள்ளுங்கள்.

# setup.rules_text.fourth
source: Be Nice to One Another
ta: ஒருவருக்கொருவர் நன்றாக இருங்கள்

# setup.rules_text.fifth
source: In order to keep Juxt a fun place for everyone, we ask that you be considerate to other users. Help us keep Juxt an enjoyable experience by not posting anything inappropriate or offensive.
ta: அனைவருக்கும் ஒரு வேடிக்கையான இடத்தை வைத்திருக்க, நீங்கள் மற்ற பயனர்களிடம் அக்கறை காட்டுமாறு கேட்டுக்கொள்கிறோம். பொருத்தமற்ற அல்லது தாக்குதல் எதையும் இடுகையிடாமல் ஒரு சுவையான அனுபவத்தை வைத்திருக்க எங்களுக்கு உதவுங்கள்.

# setup.rules_text.sixth
source: Do Not Post Personal Information—Yours or Others’
ta: தனிப்பட்ட தகவல்களை இடுகையிட வேண்டாம் - உங்கள் அல்லது பிறர் ’

# setup.rules_text.seventh
source: Remember, knowing someone in Juxt isn’t the same as knowing them in real life. Never share your e-mail address, home address, work or school name, or other personally identifying information with anyone on Juxt, and never share anyone else's information either. Additionally, if someone you meet in Juxt invites you to meet him or her in the real world, do not accept. Juxt is an online community and should not be used to arrange real-world meet-ups.
ta: நினைவில் கொள்ளுங்கள், ஒருவரைத் தெரிந்துகொள்வது நிச வாழ்க்கையில் அவர்களை அறிந்து கொள்வதற்கு சமமானதல்ல. உங்கள் மின்னஞ்சல் முகவரி, வீட்டு முகவரி, வேலை அல்லது பள்ளி பெயர் அல்லது பிற தனிப்பட்ட முறையில் அடையாளம் காணும் பிற தகவல்களை ஒருபோதும் பகிர வேண்டாம், வேறு யாருடைய தகவலையும் பகிர வேண்டாம். கூடுதலாக, நீங்கள் சந்திக்கும் ஒருவர் உண்மையான உலகில் அவரை அல்லது அவளை சந்திக்க உங்களை அழைத்தால், ஏற்றுக்கொள்ள வேண்டாம். JUXT என்பது ஒரு நிகழ்நிலை சமூகம் மற்றும் நிச உலக சந்திப்புகளை ஏற்பாடு செய்ய பயன்படுத்தக்கூடாது.

# setup.rules_text.eighth
source: Don’t Post Spoilers
ta: ச்பாய்லர்களை இடுகையிட வேண்டாம்

# setup.rules_text.ninth
source: Some people come to Juxt looking for tips and tricks for games, but others want to discover a game's secrets all on their own. Posts that reveal secrets of a game or its story are called "spoilers." If you're posting something about a game that might be a spoiler, be sure to check the Spoilers box before sending your post. This way, people who don't want to be spoiled won't see your post.
ta: சிலர் விளையாட்டுகளுக்கான உதவிக்குறிப்புகள் மற்றும் தந்திரங்களைத் தேடி வருகிறார்கள், ஆனால் மற்றவர்கள் ஒரு விளையாட்டின் ரகசியங்களை சொந்தமாக கண்டுபிடிக்க விரும்புகிறார்கள். ஒரு விளையாட்டின் ரகசியங்களை அல்லது அதன் கதையை வெளிப்படுத்தும் இடுகைகள் "ச்பாய்லர்கள்" என்று அழைக்கப்படுகின்றன. ச்பாய்லராக இருக்கும் ஒரு விளையாட்டைப் பற்றி நீங்கள் ஏதாவது இடுகையிடுகிறீர்கள் என்றால், உங்கள் இடுகையை அனுப்புவதற்கு முன்பு ச்பாய்லர்கள் பெட்டியை சரிபார்க்கவும். இந்த வழியில், கெட்டுப்போக விரும்பாதவர்கள் உங்கள் இடுகையைப் பார்க்க மாட்டார்கள்.

# setup.rules_text.tenth
source: Code of Conduct Violations
ta: நடத்தை விதிமுறை மீறல்கள்

# setup.rules_text.eleventh
source: Our goal is to keep Juxt fun and enjoyable for everyone. In the event that someone violates the Juxt Code of Conduct, we will take appropriate action, up to and including blocking the offending user or console.
ta: அனைவருக்கும் வேடிக்கையாகவும் சுவாரச்யமாகவும் இருப்பதே எங்கள் குறிக்கோள். யாரோ ஒருவர் நடத்தை விதிமுறைகளை மீறும் போது, ​​புண்படுத்தும் பயனர் அல்லது கன்சோலைத் தடுப்பது உட்பட, நாங்கள் தகுந்த நடவடிக்கை எடுப்போம்.

# setup.rules_text.twelfth
source: Have You Played That Game?
ta: நீங்கள் அந்த விளையாட்டை விளையாடியிருக்கிறீர்களா?

# setup.rules_text.thirteenth
source: If you're posting in the community for a game you've played, your posts will have an icon indicating that you've played it.
ta: நீங்கள் விளையாடிய ஒரு விளையாட்டுக்காக சமூகத்தில் இடுகையிடுகிறீர்கள் என்றால், உங்கள் இடுகைகளில் நீங்கள் அதை விளையாடியதைக் குறிக்கும் படவுரு இருக்கும்.

# setup.experience
source: Game Experience
ta: விளையாட்டு பட்டறிவு

# setup.experience_text.info
source: Please tell us how you would describe your level of experience with games. You can change this setting later.
ta: விளையாட்டுகளுடனான உங்கள் அனுபவத்தை நீங்கள் எவ்வாறு விவரிப்பீர்கள் என்பதை எங்களுக்குத் தெரிவிக்கவும். இந்த அமைப்பை நீங்கள் பின்னர் மாற்றலாம்.

# setup.experience_text.beginner
source: Beginner
ta: தொடக்க

# setup.experience_text.intermediate
source: Intermediate
ta: இடைநிலை

# setup.experience_text.expert
source: Expert
ta: வல்லுநர்

# setup.google
source: Google Analytics
ta: கூகிள் அனலிட்டிக்ச்

# setup.google_text
source: Juxtaposition uses Google Analytics in order to track how users are using our service. The data collected includes but is not limited to time of visit, pages visited, and time spent on the site. This data is not attached to you in any way, and is not used for advertisements by us or Google.
ta: பயனர்கள் எங்கள் சேவையை எவ்வாறு பயன்படுத்துகிறார்கள் என்பதைக் கண்டறிய Google Analytics ஐப் பயன்படுத்துகிறது. சேகரிக்கப்பட்ட தரவுகளில் வருகை நேரம், பார்வையிட்ட பக்கங்கள் மற்றும் தளத்தில் செலவழித்த நேரம் ஆகியவை அடங்கும். இந்தத் தரவு உங்களுடன் எந்த வகையிலும் இணைக்கப்படவில்லை, மேலும் இது அமெரிக்கா அல்லது கூகிள் விளம்பரங்களுக்குப் பயன்படுத்தப்படவில்லை.

# setup.ready
source: Ready to Start Using Juxt
ta: JUXT ஐப் பயன்படுத்தத் தயாராக உள்ளது

# setup.ready_text
source: First check out some communities and see what people from all over the world are posting about. Take this opportunity to familiarize yourself with Juxt. You might make some new discoveries along the way!
ta: முதலில் சில சமூகங்களைப் பார்த்து, உலகம் முழுவதிலுமிருந்து மக்கள் எதைப் பற்றி இடுகையிடுகிறார்கள் என்பதைப் பாருங்கள். இந்த வாய்ப்பை நீங்களே பழக்கப்படுத்திக்கொள்ள இந்த வாய்ப்பைப் பயன்படுத்துங்கள். நீங்கள் சில புதிய கண்டுபிடிப்புகளைச் செய்யலாம்!

# setup.done
source: Have fun in Juxt!
ta: வேடிக்கையாக இருங்கள்!

# setup.done_button
source: Let's Go!
ta: போகலாம்!

# setup.guest
source: Guest Mode
ta: விருந்தினர் பயன்முறை

# setup.guest_text
source: We can't verify your account at the moment, which likely means your are currently logging in with a Nintendo Network account. You will still be able to browse Juxt, but you will not be able to Yeah! posts or make posts of your own till you log in with a Pretendo Network account. For more information check the Discord server.
ta: இந்த நேரத்தில் உங்கள் கணக்கை எங்களால் சரிபார்க்க முடியாது, அதாவது நீங்கள் தற்போது ஒரு நிண்டெண்டோ பிணையம் கணக்கில் உள்நுழைகிறீர்கள். நீங்கள் இன்னும் சாக்ச்ட்டை உலாவ முடியும், ஆனால் நீங்கள் ஆம் என்று முடியாது! ப்ரெடெண்டோ பிணையம் கணக்கில் உள்நுழையும் வரை இடுகைகள் அல்லது உங்கள் சொந்த இடுகைகளை உருவாக்கவும். மேலும் தகவலுக்கு டிச்கார்ட் சேவையகத்தை சரிபார்க்கவும்.

# setup.guest_button
source: I Understand
ta: எனக்கு புரிகிறது
