Repository: 247i/TACETr
Catalog: உரை/தானி/proca-proca-admin-*.po
Languages: ta

# action.mail2target
source: Mail to target
ta: இலக்குக்கு அஞ்சல்

# action.register
source: Register
ta: பதிவு செய்யுங்கள்

# action.share
source: Share on social media
ta: சமூக ஊடகங்களில் பகிர்ந்து கொள்ளுங்கள்

# action.twitter_click
source: Tweet to target
ta: இலக்கு வைக்க ட்வீட்

# mineOnly
source: only from my organisation
ta: எனது அமைப்பிலிருந்து மட்டுமே

# unusedOnly
source: only unused widgets
ta: பயன்படுத்தப்படாத விட்செட்டுகள் மட்டுமே

# externalPartner
source: only external partners
ta: வெளிப்புற கூட்டாளர்கள் மட்டுமே

source: Customise
ta: தனிப்பயனாக்கு

source: Fields
ta: புலங்கள்

source: My organisation isn't on Twitter
ta: எனது அமைப்பு ட்விட்டரில் இல்லை

source: My organisation isn't on twitter
ta: எனது அமைப்பு ட்விட்டரில் இல்லை

source: Required
ta: தேவை

source: Show
ta: காட்டு

source: Switch to fill the details manually
ta: விவரங்களை கைமுறையாக நிரப்ப மாறவும்

source: Twitter Account
ta: ட்விட்டர் கணக்கு

source: Used to fill the details of your organisation
ta: உங்கள் நிறுவனத்தின் விவரங்களை நிரப்ப பயன்படுகிறது

source: Used to pre-fill name, description and logo of your organisation
ta: உங்கள் நிறுவனத்தின் முன் நிரப்பப்பட்ட பெயர், விளக்கம் மற்றும் லோகோவுக்கு பயன்படுத்தப்படுகிறது

source: View your widget for {{org}}
ta: {{org} க்கு க்கான உங்கள் விட்செட்டைக் காண்க

# You are also a member of {{org}}
source: 👋 Hey stop! You are the staffer of {{org}}, who runs this campaign! You cannot also join it as partner!
ta: 👋 ஏய் நிறுத்து! இந்த பிரச்சாரத்தை நடத்தும் {{org} of இன் பணியாளர் நீங்கள்! நீங்கள் அதை கூட்டாளராக சேர முடியாது!

source: You are one of the coordinators of that campaign
ta: அந்த பிரச்சாரத்தின் ஒருங்கிணைப்பாளர்களில் நீங்கள் ஒருவர்

source: You are registered for {{campaign}}
ta: நீங்கள் {{campaign} க்கு க்கு பதிவு செய்துள்ளீர்கள்

source: You can register an new organisation to join the coalition
ta: கூட்டணியில் சேர நீங்கள் ஒரு புதிய அமைப்பை பதிவு செய்யலாம்

source: You can update your organisation's details
ta: உங்கள் நிறுவனத்தின் விவரங்களை நீங்கள் புதுப்பிக்கலாம்

# createOrg.intro
source: The fastest is to start with the twitter account of your organisation (if you have several, pick one)
ta: உங்கள் நிறுவனத்தின் ட்விட்டர் கணக்கில் தொடங்குவதே வேகமானது (உங்களிடம் பல இருந்தால், ஒன்றைத் தேர்ந்தெடுங்கள்)

# createOrg.manual
source: Switch to fill the details manually
ta: விவரங்களை கைமுறையாக நிரப்ப மாறவும்

# invite.message
source: Hey, we need **you** for this campaign, could you join?
ta: ஏய், இந்த பிரச்சாரத்திற்கு எங்களுக்கு ** நீங்கள் ** தேவை, நீங்கள் சேர முடியுமா?

# join.goal
source: How many people do you expect will take action via your website?
ta: உங்கள் வலைத்தளம் வழியாக எத்தனை பேர் நடவடிக்கை எடுப்பார்கள் என்று எதிர்பார்க்கிறீர்கள்?

# join.goalHelper
source: This guess will only be seen by the coordinator… and we know it's hard to estimate
ta: இந்த உய்த்துணர்தல் ஒருங்கிணைப்பாளரால் மட்டுமே காணப்படும்… மேலும் மதிப்பிடுவது கடினம் என்று எங்களுக்குத் தெரியும்

# join.request
source: Do you plan dedicated mailing to your supporters? Are you also planning social media activities, including paid advertising
ta: உங்கள் ஆதரவாளர்களுக்கு அர்ப்பணிப்பு அஞ்சல் அனுப்ப திட்டமிட்டுள்ளீர்களா? கட்டண விளம்பரம் உள்ளிட்ட சமூக ஊடக நடவடிக்கைகளையும் நீங்கள் திட்டமிடுகிறீர்களா?

# join.requestHelper
source: to help us plan this campaign
ta: இந்த பிரச்சாரத்தைத் திட்டமிட எங்களுக்கு உதவ

# onboarding.done
source: You will receive a confirmation message by email. You can already embed a test version of the <1>widget on your website</1>
ta: மின்னஞ்சல் மூலம் உறுதிப்படுத்தல் செய்தியைப் பெறுவீர்கள். உங்கள் வலைத்தளத்தில் <1> விட்செட்டின் சோதனை பதிப்பை நீங்கள் ஏற்கனவே உட்பொதிக்கலாம் </1>

# onboarding.embargo
source: Embargo
ta: தடை

# onboarding.embargoHelper
source: I acknowledge that the campaign materials are strictly embargoed until further notice. I agree to NOT SHARING these materials with anyone outside of my organisation.
ta: மேலும் அறிவிப்பு வரை பிரச்சாரப் பொருட்கள் கண்டிப்பாக தடைசெய்யப்பட்டுள்ளன என்பதை நான் ஒப்புக்கொள்கிறேன். இந்த பொருட்களை எனது அமைப்புக்கு வெளியே யாருடனும் பகிர்ந்து கொள்ளாமல் ஒப்புக்கொள்கிறேன்.

# onboarding.intro
source: To increase our impact, we need a broad coalition and we tried to make it as simple as possible to let you join it.
ta: எங்கள் தாக்கத்தை அதிகரிக்க, எங்களுக்கு ஒரு பரந்த கூட்டணி தேவை, அதில் சேர அனுமதிக்க முடிந்தவரை எளிமையாக்க முயற்சித்தோம்.

# onboarding.login
source: Register as a user or login with your social media credentials or your email. It is your personal account, you will be able to set up your organisation after your register.
ta: பயனராக பதிவு செய்யுங்கள் அல்லது உங்கள் சமூக ஊடக சான்றுகள் அல்லது உங்கள் மின்னஞ்சலுடன் உள்நுழைக. இது உங்கள் தனிப்பட்ட கணக்கு, உங்கள் பதிவேட்டிற்குப் பிறகு உங்கள் நிறுவனத்தை அமைக்க முடியும்.

# onboarding.mailling
source: Mailing list
ta: அஞ்சல் பட்டியல்

# onboarding.maillingHelper
source: By submitting this form, I agree to be added to the {{campaign}} mailing list. I can unsubscribe at any time.
ta: இந்த படிவத்தை சமர்ப்பிப்பதன் மூலம், {{campaign}} அஞ்சல் பட்டியலில் சேர்க்க ஒப்புக்கொள்கிறேன். நான் எந்த நேரத்திலும் குழுவிலக முடியும்.

# onboarding.organisation.collectsEmail
source: You do not have a newsletter and don't want to collect email addresses? (You will be able to hide this feature yourself on your website) Tick this box:
ta: உங்களிடம் செய்திமடல் இல்லை, மின்னஞ்சல் முகவரிகளை சேகரிக்க விரும்பவில்லையா? (இந்த அம்சத்தை உங்கள் இணையதளத்தில் மறைக்க முடியும்) இந்த பெட்டியைத் தட்டவும்:

# onboarding.organisation.collectsEmailHelper
source: I don't have a newsletter. I am sure I don't want a newsletter tick-box which collects email addresses that we can use afterwards.
ta: என்னிடம் செய்திமடல் இல்லை. ஒரு செய்திமடல் டிக்-பெட்டியை நான் விரும்பவில்லை என்று நான் நம்புகிறேன், இது மின்னஞ்சல் முகவரிகளை சேகரிக்கிறது.

# onboarding.organisation.crm
source: What CRM software are you using?
ta: நீங்கள் என்ன சிஆர்எம் மென்பொருளைப் பயன்படுத்துகிறீர்கள்?

# onboarding.organisation.doubleOptIn
source: My supporters need to double opt in to receive newsletter
ta: எனது ஆதரவாளர்கள் செய்திமடலைப் பெற இரட்டிப்பாக்க வேண்டும்

# onboarding.organisation.network
source: My organisation is part of umbrella organisation...
ta: எனது அமைப்பு குடை அமைப்பின் ஒரு பகுதியாகும் ...

# onboarding.organisation.networkHelper
source: We welcome all organisations!
ta: எல்லா அமைப்புகளையும் நாங்கள் வரவேற்கிறோம்!

# onboarding.organisation.organisationHelper
source: From which part of the family are you? We welcome all organisations!
ta: குடும்பத்தின் எந்தப் பகுதியிலிருந்து நீங்கள்? எல்லா அமைப்புகளையும் நாங்கள் வரவேற்கிறோம்!

# onboarding.organisation.remarks
source: Any comments about the tool you want to tell us?
ta: நீங்கள் எங்களிடம் சொல்ல விரும்பும் கருவி பற்றி ஏதேனும் கருத்துகள் உள்ளதா?

# onboarding.organisation.sectionTitle
source: Organisation
ta: அமைப்பு

# onboarding.thanks
source: Thank you for joining this campaign
ta: இந்த பிரச்சாரத்தில் இணைந்ததற்கு நன்றி

# onboarding.title
source: Are you an organisation or social movement that wants to add this campaign on your site?
ta: இந்த பிரச்சாரத்தை உங்கள் தளத்தில் சேர்க்க விரும்பும் ஒரு அமைப்பு அல்லது சமூக இயக்கமா?

# onboarding.user.country
source: Your Country
ta: உங்கள் நாடு

# onboarding.user.emailAddress
source: Your email address
ta: உங்கள் மின்னஞ்சல் முகவரி

# onboarding.user.jobTitle
source: Job Title
ta: வேலை தலைப்பு

# onboarding.user.name
source: Your Name
ta: உங்கள் பெயர்

# onboarding.user.phoneNumber
source: Your phone number
ta: உங்கள் தொலைபேசி எண்

# onboarding.user.phoneNumberHelper
source: Including country code
ta: நாட்டின் குறியீடு உட்பட

# onboarding.user.sectionTitle
source: Your contact details
ta: உங்கள் தொடர்பு விவரங்கள்

# onboarding.user.socialAccount
source: Your social media
ta: உங்கள் சமூக ஊடகங்கள்

# onboarding.user.socialAccountHelper
source: On Twitter/Instagram/Linkedin
ta: ட்விட்டர்/இன்ச்டாகிராம்/சென்டர்

# onboarding.verify
source: Your email is not yet verified. Please check your email and click on the confirmation link to continue.
ta: உங்கள் மின்னஞ்சல் இன்னும் சரிபார்க்கப்படவில்லை. தொடர உங்கள் மின்னஞ்சலை சரிபார்த்து, தொடர உறுதிப்படுத்தல் இணைப்பைக் சொடுக்கு செய்க.

# onboarding.warning.is_partner
source: 👋 Hey stop! You are already a partner in this campaign! It does not make sense for you to join again!
ta: 👋 ஏய் நிறுத்து! இந்த பிரச்சாரத்தில் நீங்கள் ஏற்கனவே ஒரு பங்குதாரர்! நீங்கள் மீண்டும் சேருவது அர்த்தமல்ல!

# onboarding.welcome
source: Welcome to the partners' area for this campaign coordinated by {{coordinator}}
ta: {{coordinator} by ஆல் ஒருங்கிணைக்கப்பட்ட இந்த பிரச்சாரத்திற்கான கூட்டாளர்களின் பகுதிக்கு வருக

# step.configure_org
source: Your organisation
ta: உங்கள் அமைப்பு

# step.create_org
source: Create your organisation
ta: உங்கள் நிறுவனத்தை உருவாக்கவும்

# step.done
source: Take your widget
ta: உங்கள் விட்செட்டை எடுத்துக் கொள்ளுங்கள்

# step.join_campaign
source: Join the campaign
ta: பிரச்சாரத்தில் சேரவும்

# step.login
source: Your account
ta: உங்கள் கணக்கு

# step.verify
source: Verify your email
ta: உங்கள் மின்னஞ்சலை சரிபார்க்கவும்
