Repository: 247i/TACETr
Catalog: உரை/தானி/protonup-qt-protonup-qt-*.po
Languages: ta

# CtInstaller
source: Missing dependencies!
ta: சார்புகளைக் காணவில்லை!

# CtInstaller
source: Download Error!
ta: பிழையைப் பதிவிறக்குங்கள்!

# CtInstaller
source: Failed to download tool '{CT_NAME}'! Reason: {EXCEPTION}
ta: '{CT_NAME}' கருவியைப் பதிவிறக்குவதில் தோல்வி! காரணம்: {EXCEPTION}

# CtLoader
source: Error!
ta: பிழை!

# CtLoader
source: Couldn't load the following compatibility tool(s): {TOOL_LIST} If you believe this is an error, please report a bug on GitHub!
ta: பின்வரும் பொருந்தக்கூடிய கருவி (களை) ஏற்ற முடியவில்லை: {TOOL_LIST} இது பிழை என்று நீங்கள் நம்பினால், தயவுசெய்து கிட்அப்பில் ஒரு பிழையைப் புகாரளிக்கவும்!

# GitAccessTokenDialog
source: Configure Git access tokens
ta: GIT அணுகல் டோக்கன்களை உள்ளமைக்கவும்

# GitAccessTokenDialog
source: GitHub:
ta: கிதுபப்:

# GitAccessTokenDialog
source: Save
ta: சேமி

# GitAccessTokenDialog
source: Close
ta: மூடு

# GitAccessTokenDialog
source: GitLab:
ta: கிட்லாப்:

# GitAccessTokenDialog
source: This dialog allows you to configure access tokens for the GitHub/GitLab API to prevent the API rate limit warning.
ta: பநிஇ வீத வரம்பு எச்சரிக்கையைத் தடுக்க கிதுப்/கிட்லாப் ஏபிஐக்கான அணுகல் டோக்கன்களை உள்ளமைக்க இந்த உரையாடல் உங்களை அனுமதிக்கிறது.

# MainWindow
source: unused
ta: பயன்படுத்தப்படாதது

# MainWindow
source: global
ta: உலகளாவிய

# MainWindow
source: Unused: {unused_ctools}
ta: பயன்படுத்தப்படாதது: {unused_ctools}

# MainWindow
source: Fetching releases...
ta: வெளியீடுகளைப் பெறுதல் ...

# MainWindow
source: Download canceled.
ta: பதிவிறக்கம் ரத்து செய்யப்பட்டது.

# MainWindow
source: Could not install {current_compat_tool_name}...
ta: {current_compat_tool_name} ஐ நிறுவ முடியவில்லை ...

# MainWindow
source: Downloading {current_compat_tool_name}...
ta: பதிவிறக்கம் {current_compat_tool_name} ...

# MainWindow
source: Extracting {current_compat_tool_name}...
ta: பிரித்தெடுக்கும் {current_compat_tool_name} ...

# MainWindow
source: Installing {current_compat_tool_name}...
ta: {current_compat_tool_name} ...

# MainWindow
source: Installed {current_compat_tool_name}.
ta: நிறுவப்பட்டது {current_compat_tool_name}.

# MainWindow
source: Remove compatibility tools?
ta: பொருந்தக்கூடிய கருவிகளை அகற்றவா?

# MainWindow
source: You are trying to remove compatibility tools which are in use by {n} games. Continue?
ta: பொருந்தக்கூடிய கருவிகளை அகற்ற முயற்சிக்கிறீர்கள் அவை {n} விளையாட்டுகளால் பயன்பாட்டில் உள்ளன. தொடரவா?

# MainWindow
source: Removed selected versions.
ta: தேர்ந்தெடுக்கப்பட்ட பதிப்புகள் அகற்றப்பட்டன.

# MainWindow
source: Exit?
ta: வெளியேற?

# MainWindow
source: There are pending downloads. Cancel and exit anyway?
ta: பதிவிறக்கங்கள் நிலுவையில் உள்ளன. எப்படியும் ரத்து செய்து வெளியேறவா?

# MainWindow
source: Changed install directory to {install_dir}.
ta: மாற்றப்பட்ட கோப்பகத்தை {install_dir பெறுநர் க்கு நிறுவவும்.

# MainWindow
source: Install tool from Flathub
ta: பிளாட்டப்பிலிருந்து கருவியை நிறுவவும்

# MainWindow
source: Click to open your app store
ta: உங்கள் ஆப் ச்டோரைத் திறக்க சொடுக்கு செய்க

# MainWindow
source: ProtonUp-Qt - Wine/Proton Installer
ta: புரோட்டானப் -கியூடி - ஒயின்/புரோட்டான் நிறுவி

# MainWindow
source: Install for:
ta: இதற்கு நிறுவவும்:

# MainWindow
source: Active downloads:
ta: செயலில் பதிவிறக்கங்கள்:

# MainWindow
source: Add Custom Install Directory...
ta: தனிப்பயன் நிறுவல் கோப்பகத்தைச் சேர்க்கவும் ...

# MainWindow
source: Installed compatibility tools:
ta: நிறுவப்பட்ட பொருந்தக்கூடிய கருவிகள்:

# MainWindow
source: Add version
ta: பதிப்பைச் சேர்க்கவும்

# MainWindow
source: Remove selected
ta: தேர்ந்தெடுக்கப்பட்டதை அகற்று

# MainWindow
source: Show info
ta: தகவலைக் காட்டு

# MainWindow
source: Get tools from Flathub
ta: பிளாட்டப்பிலிருந்து கருவிகளைப் பெறுங்கள்

# MainWindow
source: Show game list
ta: விளையாட்டு பட்டியலைக் காட்டு

# MainWindow
source: About
ta: பற்றி

# MainWindow
source: Close
ta: மூடு

# PuiguiCustomInstallDirectoryDialog
source: Dialog
ta: உரையாடல்

# PuiguiCustomInstallDirectoryDialog
source: Specify a custom location for downloading and displaying a launcher's compatibility tools.
ta: துவக்கியின் பொருந்தக்கூடிய கருவிகளைப் பதிவிறக்கி காண்பிப்பதற்கான தனிப்பயன் இருப்பிடத்தைக் குறிப்பிடவும்.

# PuiguiCustomInstallDirectoryDialog
source: Directory:
ta: அடைவு:

# PuiguiCustomInstallDirectoryDialog
source: Launcher:
ta: துவக்கி:

# PuiguiCustomInstallDirectoryDialog
source: Reset the custom install directory back to default for this launcher
ta: தனிப்பயன் நிறுவல் கோப்பகத்தை இந்த துவக்கத்திற்கான இயல்புநிலைக்கு மீட்டமைக்கவும்

# PuiguiCustomInstallDirectoryDialog
source: Default
ta: இயல்புநிலை

# PuiguiCustomInstallDirectoryDialog
source: Save
ta: சேமி

# PuiguiCustomInstallDirectoryDialog
source: Batch Update
ta: தொகுதி புதுப்பிப்பு

# PuiguiCustomInstallDirectoryDialog
source: Migrate games using the current compatibility tool to the one specified below.
ta: தற்போதைய பொருந்தக்கூடிய கருவியைப் பயன்படுத்தி விளையாட்டுகளை கீழே குறிப்பிடப்பட்டுள்ளதாக மாற்றவும்.

# PuiguiCustomInstallDirectoryDialog
source: New Version:
ta: புதிய பதிப்பு:

# PuiguiCustomInstallDirectoryDialog
source: Old Version:
ta: பழைய பதிப்பு:

# PuiguiCustomInstallDirectoryDialog
source: Close
ta: மூடு

# PupguiAboutDialog
source: light
ta: ஒளி

# PupguiAboutDialog
source: dark
ta: இருண்ட

# PupguiAboutDialog
source: system (restart required)
ta: கணினி (மறுதொடக்கம் தேவை)

# PupguiAboutDialog
source: Update available
ta: புதுப்பிப்பு கிடைக்கிறது

# PupguiAboutDialog
source: There is a newer version available. You are running {APP_VERSION} but {newest_version} is available.
ta: புதிய பதிப்பு உள்ளது. நீங்கள் {APP_VERSION} ஐ இயக்குகிறீர்கள், ஆனால் {newest_version} கிடைக்கிறது.

# PupguiAboutDialog
source: Up to date
ta: புதுப்பித்த நிலையில்

# PupguiAboutDialog
source: You are running the newest version!
ta: நீங்கள் புதிய பதிப்பை இயக்குகிறீர்கள்!

# PupguiAboutDialog
source: Added shortcut!
ta: குறுக்குவழி சேர்க்கப்பட்டது!

# PupguiAboutDialog
source: Dialog
ta: உரையாடல்

# PupguiAboutDialog
source: <html><head/><body><p>GUI for installing/updating Wine- and Proton-based compatibility tools.<br/>Inspired by/partly based on AUNaseef's protonup.</p></body></html>
ta: <p> ஒயின் மற்றும் புரோட்டான் அடிப்படையிலான பொருந்தக்கூடிய கருவிகளை நிறுவ/புதுப்பிப்பதற்கான GUI. html&gt;</p>

# PupguiAboutDialog
source: Support development on GitHub
ta: கிதுபில் வளர்ச்சி

# PupguiAboutDialog
source: Color Theme:
ta: வண்ண தீம்:

# PupguiAboutDialog
source: Enable advanced mode (show git-builds for compatibility tools etc.)
ta: மேம்பட்ட பயன்முறையை இயக்கவும் (பொருந்தக்கூடிய கருவிகள் போன்றவற்றிற்கான GIT- கட்டமைப்புகளைக் காட்டு)

# PupguiAboutDialog
source: Edit Git access tokens
ta: அறிவிலி அணுகல் டோக்கன்களைத் திருத்தவும்

# PupguiAboutDialog
source: Check for updates
ta: புதுப்பிப்புகளை சரிபார்க்கவும்

# PupguiAboutDialog
source: Adds a shortcut to open ProtonUp-Qt from your Steam library. To remove the shortcut, open Steam and select "remove non-Steam game from your library".
ta: உங்கள் நீராவி நூலகத்திலிருந்து புரோட்டானப்-கியூடியைத் திறக்க குறுக்குவழியைச் சேர்க்கிறது. குறுக்குவழியை அகற்ற, நீராவியைத் திறந்து "உங்கள் நூலகத்திலிருந்து நீராவி அல்லாத விளையாட்டை அகற்று" என்பதைத் தேர்ந்தெடுக்கவும்.

# PupguiAboutDialog
source: Add Steam shortcut
ta: நீராவி குறுக்குவழியைச் சேர்க்கவும்

# PupguiAboutDialog
source: About Qt
ta: கியுடி பற்றி

# PupguiAboutDialog
source: Close
ta: மூடு

# PupguiCtBatchUpdateDialog
source: No supported compatibility tools found.
ta: உதவி பொருந்தக்கூடிய கருவிகள் எதுவும் கிடைக்கவில்லை.

# PupguiCtBatchUpdateDialog
source: Warning: Close the Steam Client beforehand.
ta: எச்சரிக்கை: நீராவி கிளையண்டை முன்பே மூடு.

# PupguiCtInfoDialog
source: About compatibility tool
ta: பொருந்தக்கூடிய கருவி பற்றி

# PupguiCtInfoDialog
source: Compatibility tool:
ta: பொருந்தக்கூடிய கருவி:

# PupguiCtInfoDialog
source: Game Launcher:
ta: விளையாட்டு துவக்கி:

# PupguiCtInfoDialog
source: Install directory:
ta: கோப்பகத்தை நிறுவவும்:

# PupguiCtInfoDialog
source: Games using compatibility tool:
ta: பொருந்தக்கூடிய கருவியைப் பயன்படுத்தும் விளையாட்டுகள்:

# PupguiCtInfoDialog
source: Refresh Games
ta: விளையாட்டுகளைப் புதுப்பிக்கவும்

# PupguiCtInfoDialog
source: Search games...
ta: விளையாட்டுகளைத் தேடுங்கள் ...

# PupguiCtInfoDialog
source: No games
ta: விளையாட்டுகள் இல்லை

# PupguiCtInfoDialog
source: Batch Update
ta: தொகுதி புதுப்பிப்பு

# PupguiCtInfoDialog
source: e.g. Half-Life 3
ta: எ.கா. அரை ஆயுள் 3

# PupguiCtInfoDialog
source: Search for a game...
ta: ஒரு விளையாட்டைத் தேடுங்கள் ...

# PupguiCtInfoDialog
source: Close
ta: மூடு

# PupguiCtInfoDialog
source: Name
ta: பெயர்

# PupguiCtInfoDialog
source: Slug
ta: குருட்டடி

# PupguiCtInfoDialog
source: Runner
ta: ஓட்டப்பந்தய வீரர்

# PupguiCtInfoDialog
source: Game
ta: விளையாட்டு

# PupguiCtInfoDialog
source: Tool is Global
ta: கருவி உலகளாவியதாகும்

# PupguiCtInfoDialog
source: e.g. {GAME_NAME}
ta: எ.கா. {GAME_NAME}

# PupguiCustomInstallDirectoryDialog
source: Custom Install Directory
ta: தனிப்பயன் நிறுவல் அடைவு

# PupguiCustomInstallDirectoryDialog
source: Select Custom Install Directory — ProtonUp-Qt
ta: தனிப்பயன் நிறுவல் கோப்பகத்தைத் தேர்ந்தெடுக்கவும்-புரோட்டானப்-கியூடி

# PupguiGameListDialog
source: Game
ta: விளையாட்டு

# PupguiGameListDialog
source: Compatibility Tool
ta: பொருந்தக்கூடிய கருவி

# PupguiGameListDialog
source: Deck Compatibility
ta: டெக் பொருந்தக்கூடிய தன்மை

# PupguiGameListDialog
source: Anticheat
ta: ஆன்டிச்சீட்

# PupguiGameListDialog
source: Runner
ta: ஓட்டப்பந்தய வீரர்

# PupguiGameListDialog
source: Install Location
ta: இருப்பிடத்தை நிறுவவும்

# PupguiGameListDialog
source: Installed Date
ta: நிறுவப்பட்ட தேதி

# PupguiGameListDialog
source: click
ta: சொடுக்கு செய்க

# PupguiGameListDialog
source: Unknown
ta: தெரியவில்லை

# PupguiGameListDialog
source: Installed at {DATE} ({TIME})
ta: {DATE} ({TIME}) இல் நிறுவப்பட்டுள்ளது

# PupguiGameListDialog
source: Name: {compat_item_text}
ta: பெயர்: {compat_item_text}

# PupguiGameListDialog
source: Path: {compat_tool_bin_path}
ta: பாதை: {compat_tool_bin_path}

# PupguiGameListDialog
source: Type: {wine_type}
ta: வகை: {wine_type}

# PupguiGameListDialog
source: Browser
ta: உலாவி

# PupguiGameListDialog
source: Native
ta: பழமை

# PupguiGameListDialog
source: Done
ta: முடிந்தது

# PupguiGameListDialog
source: Search
ta: தேடல்

# PupguiGameListDialog
source: Double click to browse...
ta: உலவ இரட்டை சொடுக்கவும் ...

# PupguiGameListDialog
source: Install location does not exist!
ta: இடம் நிறுவல் இல்லை!

# PupguiGameListDialog
source: Unsupported
ta: ஆதரிக்கப்படாதது

# PupguiGameListDialog
source: Playable
ta: விளையாடக்கூடியது

# PupguiGameListDialog
source: Native (playable)
ta: பழமை (விளையாடக்கூடியது)

# PupguiGameListDialog
source: Playable using {compat_tool}
ta: {Compat_tool below ஐப் பயன்படுத்தி இயக்கக்கூடியது

# PupguiGameListDialog
source: Verified
ta: சரிபார்க்கப்பட்டது

# PupguiGameListDialog
source: Native (verified)
ta: சொந்த (சரிபார்க்கப்பட்டது)

# PupguiGameListDialog
source: Verified for {compat_tool}
ta: {Compat_tool க்கு க்கு சரிபார்க்கப்பட்டது

# PupguiGameListDialog
source: Support was explicitly enabled / works out of the box
ta: உதவி வெளிப்படையாக இயக்கப்பட்டது / பெட்டியின் வெளியே வேலை

# PupguiGameListDialog
source: Game List for {LAUNCHER}
ta: {லாஞ்சர் க்கு க்கான விளையாட்டு பட்டியல்

# PupguiGameListDialog
source: Installed games: {NO_INSTALLED}
ta: நிறுவப்பட்ட விளையாட்டுகள்: {NO_INSTALLED}

# PupguiGameListDialog
source: Install Date is Unknown
ta: நிறுவப்பட்ட தேதி தெரியவில்லை

# PupguiGameListDialog
source: Type: {PLATFORM}
ta: வகை: {PLATFORM}

# PupguiGameListDialog
source: Double-click to open in browser
ta: உலாவியில் திறக்க இருமுறை சொடுக்கு செய்யவும்

# PupguiGameListDialog
source: e.g. {GAME_NAME}
ta: எ.கா. {GAME_NAME}

# PupguiGameListDialog
source: Game plans to support Proton/Wine
ta: புரோட்டான்/ஒயின் ஆதரிக்க விளையாட்டு திட்டமிட்டுள்ளது

# PupguiGameListDialog
source: No official statement but runs fine (may require tinkering)
ta: அதிகாரப்பூர்வ அறிக்கை இல்லை, ஆனால் நன்றாக இயங்குகிறது (டிங்கரிங் தேவைப்படலாம்)

# PupguiGameListDialog
source: Anti-Cheat stops game from running properly
ta: ஏமாற்ற எதிர்ப்பு விளையாட்டு சரியாக இயங்குவதை நிறுத்துகிறது

# PupguiGameListDialog
source: Linux support was explicitly denied
ta: லினக்ச் உதவி வெளிப்படையாக மறுக்கப்பட்டது

# PupguiGameListDialog
source: Anti-Cheat status unknown
ta: ஏமாற்ற எதிர்ப்பு நிலை தெரியவில்லை

# PupguiGameListDialog
source: Confidence: {confidence} Score: {score} Trending: {trending}
ta: நம்பிக்கை: {confidence} ச்கோர்: {score} டிரெண்டிங்: {trending}

# PupguiGameListDialog
source: Game List
ta: விளையாட்டு பட்டியல்

# PupguiGameListDialog
source: Warning: Close the Steam client beforehand so that the changes can be applied!
ta: எச்சரிக்கை: நீராவி கிளையண்டை முன்பே மூடு, இதனால் மாற்றங்களைப் பயன்படுத்தலாம்!

# PupguiGameListDialog
source: e.g. Team Fortress 2
ta: எ.கா. அணி கோட்டை 2

# PupguiGameListDialog
source: Search for a game...
ta: ஒரு விளையாட்டைத் தேடுங்கள் ...

# PupguiGameListDialog
source: Refresh Games
ta: விளையாட்டுகளைப் புதுப்பிக்கவும்

# PupguiGameListDialog
source: Shortcut Editor
ta: குறுக்குவழி ஆசிரியர்

# PupguiGameListDialog
source: Apply
ta: இடு

# PupguiGameListDialog
source: Close
ta: மூடு

# PupguiInstallDialog
source: Install Compatibility Tool
ta: பொருந்தக்கூடிய கருவியை நிறுவவும்

# PupguiInstallDialog
source: Info
ta: தகவல்

# PupguiInstallDialog
source: Install
ta: நிறுவவும்

# PupguiInstallDialog
source: Cancel
ta: ரத்துசெய்

# PupguiInstallDialog
source: Compatibility tool:
ta: பொருந்தக்கூடிய கருவி:

# PupguiInstallDialog
source: Version:
ta: பதிப்பு:

# PupguiInstallDialog
source: Description:
ta: விளக்கம்:

# PupguiInstallDialog
source: Load more...
ta: மேலும் ஏற்றவும் ...

# PupguiShortcutDialog
source: App Name
ta: பயன்பாட்டு பெயர்

# PupguiShortcutDialog
source: Executable
ta: இயங்கக்கூடிய

# PupguiShortcutDialog
source: Start Directory
ta: கோப்பகத்தைத் தொடங்கவும்

# PupguiShortcutDialog
source: Icon
ta: படவுரு

# PupguiShortcutDialog
source: Steam Shortcut Editor
ta: நீராவி குறுக்குவழி ஆசிரியர்

# PupguiShortcutDialog
source: Add a new shortcut
ta: புதிய குறுக்குவழியைச் சேர்க்கவும்

# PupguiShortcutDialog
source: Add new
ta: புதியதைச் சேர்க்கவும்

# PupguiShortcutDialog
source: Click on a row, then click here to remove a shortcut
ta: ஒரு வரிசையில் சொடுக்கு செய்து, குறுக்குவழியை அகற்ற இங்கே சொடுக்கு செய்க

# PupguiShortcutDialog
source: Remove selected
ta: தேர்ந்தெடுக்கப்பட்டதை அகற்று

# PupguiShortcutDialog
source: e.g. ProtonUp-Qt
ta: எ.கா. புரோட்டானப்

# PupguiShortcutDialog
source: Search for a game...
ta: ஒரு விளையாட்டைத் தேடுங்கள் ...

# PupguiShortcutDialog
source: Save changes and delete marked shortcuts
ta: மாற்றங்களைச் சேமித்து குறிக்கப்பட்ட குறுக்குவழிகளை நீக்கவும்

# PupguiShortcutDialog
source: Save
ta: சேமி

# PupguiShortcutDialog
source: Close without saving changes or deleting shortcuts
ta: மாற்றங்களைச் சேமிக்காமல் அல்லது குறுக்குவழிகளை நீக்காமல் மூடு

# PupguiShortcutDialog
source: Close
ta: மூடு

# ctmod_00protonge
source: Steam compatibility tool for running Windows games with improvements over Valve's default Proton.<br/><br/><b>Use this when you don't know what to choose.</b>
ta: வால்வின் இயல்புநிலை புரோட்டானில் மேம்பாடுகளுடன் சாளரங்கள் கேம்களை இயக்குவதற்கான நீராவி பொருந்தக்கூடிய கருவி.

# ctmod_boxtron
source: Steam Play compatibility tool to run DOS games using native Linux DOSBox.
ta: நேட்டிவ் லினக்ச் டோச்பாக்சைப் பயன்படுத்தி டோச் கேம்களை இயக்க நீராவி பிளே பொருந்தக்கூடிய கருவி.

# ctmod_kron4ekvanilla
source: Compatibility tool "Wine" to run Windows games on Linux. Official version from the WineHQ sources, compiled by Kron4ek.
ta: லினக்சில் சாளரங்கள் கேம்களை இயக்க "ஒயின்" பொருந்தக்கூடிய கருவி. KRON4EK ஆல் தொகுக்கப்பட்ட VONEHQ மூலங்களிலிருந்து அதிகாரப்பூர்வ பதிப்பு.

# ctmod_lutriswine
source: Compatibility tool "Wine" to run Windows games on Linux. Improved by Lutris to offer better compatibility or performance in certain games.
ta: லினக்சில் சாளரங்கள் கேம்களை இயக்க "ஒயின்" பொருந்தக்கூடிய கருவி. சில விளையாட்டுகளில் சிறந்த பொருந்தக்கூடிய தன்மை அல்லது செயல்திறனை வழங்க லூட்ரிசால் மேம்படுத்தப்பட்டது.

# ctmod_luxtorpeda
source: Luxtorpeda provides Linux-native game engines for specific Windows-only games.
ta: குறிப்பிட்ட சாளரங்கள் மட்டுமே விளையாட்டுகளுக்கு லினக்ச்-சொந்த விளையாட்டு இயந்திரங்களை லக்ச்டார்பிடா வழங்குகிறது.

# ctmod_northstarproton
source: Proton build based on TKG's proton-tkg to run the Northstar client + TitanFall 2. By cyrv6737.<br/><br/><b style="color:orange;">Read the following before proceeding</b>:<br/><a href="https://github.com/R2NorthstarTools/NorthstarProton">https://github.com/R2NorthstarTools/NorthstarProton</a>
ta: நார்த்ச்டார் கிளையன்ட் + டைட்டான்ஃபால் இயக்க டி.கே.சியின் புரோட்டான்-டி.கே.சி அடிப்படையில் புரோட்டான் உருவாக்கம். br/&gt; <a href="https://github.com/r2northstartools/northstarproton"> https://github.com/r2northstartools/northstarproton </a>

# ctmod_protoncachyos
source: Steam compatibility tool from the CachyOS Linux distribution for running Windows games with improvements over Valve's default Proton. Choose the one corresponding to your CPU. <br/><br/> * <b>x86_64</b>: Works on any x64_64 CPU <br/> * <b>x86_64_v3</b>: For CPUs that support AVX2 and up
ta: சாளரங்கள் கேம்களை இயக்குவதற்கான கேச்சியோச் லினக்ச் விநியோகத்திலிருந்து நீராவி பொருந்தக்கூடிய கருவி வால்வின் இயல்புநிலை புரோட்டானில் மேம்பாடுகளுடன். உங்கள் சிபியு உடன் தொடர்புடைய ஒன்றைத் தேர்வுசெய்க. <br/> <br/> * <b> x86_64 </b>: எந்த x64_64 சிபியு இல் வேலை செய்கிறது <br/> * <b> x86_64_V3 </b>: AVX2 மற்றும் மேலே ஐ ஆதரிக்கும் சிபியு களுக்கு

# ctmod_protontkg
source: Custom Proton build for running Windows games, built with the Wine-tkg build system.
ta: ஒயின்-டி.கே.சி பில்ட் சிச்டத்துடன் கட்டப்பட்ட சாளரங்கள் கேம்களை இயக்குவதற்கான தனிப்பயன் புரோட்டான் உருவாக்க.

# ctmod_protontkg_winemaster
source: Custom Proton build for running Windows games, built with the Wine-tkg build system. <br/> <br/> This build is based on <b>Wine Master</b>.
ta: ஒயின்-டி.கே.சி பில்ட் சிச்டத்துடன் கட்டப்பட்ட சாளரங்கள் கேம்களை இயக்குவதற்கான தனிப்பயன் புரோட்டான் உருவாக்க. <br> <br> இந்த உருவாக்கம் <b> வைன் மாச்டர் </b> ஐ அடிப்படையாகக் கொண்டது.

# ctmod_roberta
source: Steam Play compatibility tool to run adventure games using native Linux ScummVM.
ta: நேட்டிவ் லினக்ச் ச்கம்.வி.எம் ஐப் பயன்படுத்தி சாகச விளையாட்டுகளை இயக்க நீராவி பிளே பொருந்தக்கூடிய கருவி.

# ctmod_rtspgeproton
source: Fork of GE-Proton with enhanced Windows Media Foundation support.
ta: மேம்பட்ட சாளரங்கள் மீடியா அறக்கட்டளை ஆதரவுடன் சி.இ-புரோட்டனின் ஃபோர்க்.

# ctmod_steamplaynone
source: Run Linux games as is, even if Valve recommends Proton for a game.<br/>Created by Scrumplex.<br/><br/>Useful for Steam Deck.<br/><br/>Note: The internal name has been changed from <b>none</b> to <b>Steam-Play-None</b>!
ta: லினக்ச் கேம்களை ஒரு விளையாட்டுக்கு புரோட்டானை பரிந்துரைத்தாலும் கூட. <b> எதுவுமில்லை </b> இலிருந்து <b> நீராவி-விளையாட்டு-அல்ல-</b> ஆக மாற்றப்பட்டது!

# ctmod_steamtinkerlaunch
source: Linux wrapper tool for use with the Steam client which allows for easy graphical configuration of game tools for Proton and native Linux games. <br/><br/> On <b>Steam Deck</b>, relevant dependencies will be installed for you. If you are not on Steam Deck, <b>ensure you have the following dependencies installed</b>: <ul> <li>awk (or gawk)</li> <li>bash</li> <li>git</li> <li>pgrep</li> <li>unzip</li> <li>wget</li> <li>xdotool</li> <li>xprop</li> <li>xrandr</li> <li>xwininfo</li> <li>xxd</li> <li>Yad >= <b>v7.2</b></li> </ul> More information is available on the SteamTinkerLaunch Installation wiki page. <br/><br/> SteamTinkerLaunch has a number of <b>Optional Dependencies</b> which have to be installed separately for extra functionality. Please see the Optional Dependencies section of the SteamTinkerLaunch Installation guide on its GitHub page.
ta: புரோட்டான் மற்றும் சொந்த லினக்ச் கேம்களுக்கான விளையாட்டு கருவிகளின் எளிதான வரைகலை உள்ளமைவை அனுமதிக்கும் நீராவி கிளையண்டுடன் பயன்படுத்த லினக்ச் ரேப்பர் கருவி. <br> <br> <b> நீராவி டெக் </b> இல், தொடர்புடைய சார்புகள் உங்களுக்காக நிறுவப்படும். நீங்கள் நீராவி டெக்கில் இல்லை என்றால், <b> பின்வரும் சார்புகள் நிறுவப்பட்டுள்ளன என்பதை உறுதிப்படுத்தவும் </b>: <ul> <li> எடபல்யுகே (அல்லது gawk) </li> <li> பாச் </li> <li> அறிவிலி </li> <li> pgrep </li> <li> unzip </li> <li> wget </li> <li> xdotool </li> <li> XPROP </li> <li> xrandr </li> <li> XWININFO </li> <li> xxd </li> <li> yad&gt; = <b> v7.2 </b> </li> </ul> Steamtinkerlaunch நிறுவல் விக்கி பக்கத்தில் மேலும் தகவல்கள் கிடைக்கின்றன. <br> <br> SteamTinkerLaunch பல <b> விருப்பமான சார்புகள் </b> ஐக் கொண்டுள்ளது, அவை கூடுதல் செயல்பாட்டிற்காக தனித்தனியாக நிறுவப்பட வேண்டும். விருப்ப சார்பு பகுதியைப் பார்க்கவும் அதன் அறிவிலிமையம் பக்கத்தில் ச்டீம்டின்கெர்லாஞ்ச் நிறுவல் வழிகாட்டியின்.

# ctmod_steamtinkerlaunch
source: You have several unmet dependencies for SteamTinkerLaunch.
ta: ச்டீம்டின்கெர்லாஞ்ச் உங்களிடம் பல பொருத்தமற்ற சார்புநிலைகள் உள்ளன.

# ctmod_steamtinkerlaunch
source: Installation will be cancelled.
ta: நிறுவல் ரத்து செய்யப்படும்.

# ctmod_steamtinkerlaunch
source: Missing dependencies!
ta: சார்புகளைக் காணவில்லை!

# ctmod_steamtinkerlaunch
source: Existing SteamTinkerLaunch Installation
ta: தற்போதுள்ள ச்டீம்டின்கெர்லாஞ்ச் நிறுவல்

# ctmod_steamtinkerlaunch
source: It looks like you have an existing SteamTinkerLaunch installation at '{EXTERNAL_INSTALL_PATH}' that was not installed by ProtonUp-Qt. Reinstalling SteamTinkerLaunch with ProtonUp-Qt will move your installation folder to '{STL_INSTALL_PATH}'. You may also choose to remove your existing installation, if ProtonUp-Qt has write access to this folder. Do you want to continue installing SteamTinkerLaunch? (This will not affect any existing SteamTinkerLaunch configuration.)
ta: புரோட்டானப்-கியூடி நிறுவப்படாத '{EXTERNAL_INSTALL_PATH}' இல் ஏற்கனவே ச்டீம்டின்கெர்லாஞ்ச் நிறுவல் இருப்பது போல் தெரிகிறது. புரோட்டானப்-கியூடி மூலம் ச்டீம்டின்கெர்லாஞ்சை மீண்டும் நிறுவுவது உங்கள் நிறுவல் கோப்புறையை '{STL_INSTALL_PATH}' க்கு நகர்த்தும். புரோட்டானப்-கியூடி இந்த கோப்புறையில் எழுதும் அணுகலைக் கொண்டிருந்தால், உங்கள் இருக்கும் நிறுவலை அகற்றவும் நீங்கள் தேர்வு செய்யலாம். SteamTinkerLaunch ஐ தொடர்ந்து நிறுவ விரும்புகிறீர்களா? (இது தற்போதுள்ள எந்த ச்டீம்டின்கெர்லாஞ்ச் உள்ளமைவையும் பாதிக்காது.)

# ctmod_steamtinkerlaunch
source: Remove existing SteamTinkerLaunch installation
ta: இருக்கும் ச்டீம்டின்கெர்லாஞ்ச் நிறுவலை அகற்று

# ctmod_steamtinkerlaunch
source: Add SteamTinkerLaunch to PATH
ta: பாதையில் ச்டீம்டின்கெர்லாஞ்ச் சேர்க்கவும்

# ctmod_steamtinkerlaunch
source: By default, ProtonUp-Qt will add SteamTinkerLaunch to all available Shell paths. This makes it easier to use with native Linux games. It also enables SteamTinkerLaunch commands from anywhere in the command line. Some users may not want this functionality. Do you want to continue installing SteamTinkerLaunch?
ta: இயல்பாக, புரோட்டானப்-கியூடி கிடைக்கக்கூடிய அனைத்து செல் பாதைகளுக்கும் ச்டீம்டின்கெர்லாஞ்ச் சேர்க்கும். இது சொந்த லினக்ச் கேம்களுடன் பயன்படுத்த எளிதாக்குகிறது. இது கட்டளை வரியில் எங்கிருந்தும் ச்டீம்டின்கெர்லாஞ்ச் கட்டளைகளையும் செயல்படுத்துகிறது. சில பயனர்கள் இந்த செயல்பாட்டை விரும்பவில்லை. SteamTinkerLaunch ஐ தொடர்ந்து நிறுவ விரும்புகிறீர்களா?

# ctmod_steamtinkerlaunch
source: Allow PATH modification
ta: பாதை மாற்றத்தை அனுமதிக்கவும்
