Repository: 247i/TACETr
Catalog: உரை/தானி/protonup-qt-protonup-qt-*.po
Languages: ta

# ctmod_steamtinkerlaunch_git
source: <b>Git release - May be unstable</b> <br/><br/> Linux wrapper tool for use with the Steam client which allows for easy graphical configuration of game tools for Proton and native Linux games. <br/><br/> On <b>Steam Deck</b>, relevant dependencies will be installed for you. If you are not on Steam Deck, <b>ensure you have the following dependencies installed</b>: <ul> <li>awk (or gawk)</li> <li>bash</li> <li>git</li> <li>pgrep</li> <li>unzip</li> <li>wget</li> <li>xdotool</li> <li>xprop</li> <li>xrandr</li> <li>xwininfo</li> <li>xxd</li> <li>Yad >= <b>v7.2</b></li> </ul> More information is available on the SteamTinkerLaunch Installation wiki page. <br/><br/> SteamTinkerLaunch has a number of <b>Optional Dependencies</b> which have to be installed separately for extra functionality. Please see the Optional Dependencies section of the SteamTinkerLaunch Installation guide on its GitHub page.
ta: <b> அறிவிலி வெளியீடு - நிலையற்றதாக இருக்கலாம் </b> <br> <br> புரோட்டான் மற்றும் சொந்த லினக்ச் கேம்களுக்கான விளையாட்டு கருவிகளின் எளிதான வரைகலை உள்ளமைவை அனுமதிக்கும் நீராவி கிளையண்டுடன் பயன்படுத்த லினக்ச் ரேப்பர் கருவி. <br> <br> <b> நீராவி டெக் </b> இல், தொடர்புடைய சார்புகள் உங்களுக்காக நிறுவப்படும். நீங்கள் நீராவி டெக்கில் இல்லை என்றால், <b> பின்வரும் சார்புகள் நிறுவப்பட்டுள்ளன என்பதை உறுதிப்படுத்தவும் </b>: <ul> <li> எடபல்யுகே (அல்லது gawk) </li> <li> பாச் </li> <li> அறிவிலி </li> <li> pgrep </li> <li> unzip </li> <li> wget </li> <li> xdotool </li> <li> XPROP </li> <li> xrandr </li> <li> XWININFO </li> <li> xxd </li> <li> yad&gt; = <b> v7.2 </b> </li> </ul> Steamtinkerlaunch நிறுவல் விக்கி பக்கத்தில் மேலும் தகவல்கள் கிடைக்கின்றன. <br> <br> SteamTinkerLaunch பல <b> விருப்பமான சார்புகள் </b> ஐக் கொண்டுள்ளது, அவை கூடுதல் செயல்பாட்டிற்காக தனித்தனியாக நிறுவப்பட வேண்டும். விருப்ப சார்பு பகுதியைப் பார்க்கவும் அதன் அறிவிலிமையம் பக்கத்தில் ச்டீம்டின்கெர்லாஞ்ச் நிறுவல் வழிகாட்டியின்.

# ctmod_vkd3d-lutris
source: Fork of Wine's VKD3D which aims to implement the full Direct3D 12 API on top of Vulkan (Lutris Release).<br/><br/>https://github.com/lutris/docs/blob/master/HowToDXVK.md
ta: வல்கானின் மேல் (லூட்ரிச் வெளியீடு) மேல் முழு டைரக்ட் 3 டி 12 பநிஇ செயல்படுத்துவதை நோக்கமாகக் கொண்ட ஒயின் வி.கே.டி 3 டி.

# ctmod_vkd3d-proton
source: Fork of Wine's VKD3D which aims to implement the full Direct3D 12 API on top of Vulkan (Valve Release).<br/><br/>https://github.com/lutris/docs/blob/master/HowToDXVK.md
ta: வல்கானின் மேல் (வால்வு வெளியீடு) மேல் முழு டைரக்ட் 3 டி 12 பநிஇ செயல்படுத்துவதை நோக்கமாகக் கொண்ட ஒயின் வி.கே.டி 3 டி.

# ctmod_winetkg_valve_otherdistro
source: Custom Wine build for running Windows games, built with the Wine-tkg build system based on <b>Valve Wine bleeding_edge</b>.
ta: <b> வால்வு ஒயின் இரத்தப்போக்கு_இடி </b> ஐ அடிப்படையாகக் கொண்ட ஒயின்-டி.கே.சி பில்ட் சிச்டத்துடன் கட்டப்பட்ட சாளரங்கள் கேம்களை இயக்குவதற்கான தனிப்பயன் ஒயின் உருவாக்கம்.

# ctmod_winetkg_vanilla_ubuntu
source: Custom Wine build for running Windows games, built with the Wine-tkg build system (Ubuntu CI) based on <b>Wine Master</b>.
ta: <b> ஒயின் மாச்டர் </b> ஐ அடிப்படையாகக் கொண்ட ஒயின்-டி.கே.சி பில்ட் சிச்டம் (உபுண்டு சிஐ) உடன் கட்டப்பட்ட சாளரங்கள் கேம்களை இயக்குவதற்கான தனிப்பயன் ஒயின் உருவாக்கம்.

# ctmod_z0dxvk
source: Vulkan based implementation of Direct3D 8, 9, 10, and 11 for Linux/Wine.<br/><br/>https://github.com/lutris/docs/blob/master/HowToDXVK.md
ta: லினக்ச்/ஒயின் டைரக்ட் 3 டி 8, 9, 10, மற்றும் 11 இன் வல்கன் அடிப்படையிலான செயல்படுத்தல்.

# ctmod_z1dxvkasync
source: Vulkan based implementation of Direct3D 8, 9, 10, and 11 for Linux/Wine with gplasync patch by Ph42oN.<br/><br/><b>Warning: Use only with singleplayer games!</b>
ta: PH42ON க்குள் GPlasync பேட்சுடன் லினக்ச்/ஒயின் டைரக்ட் 3 டி 8, 9, 10, மற்றும் 11 ஐ வல்கன் அடிப்படையிலான செயல்படுத்தல். <br/> <br/> <b> எச்சரிக்கை: சிங்கிள் பிளேயர் கேம்களுடன் மட்டுமே பயன்படுத்தவும்!

# ctmod_z2dxvknightly
source: Nightly version of DXVK (master branch), a Vulkan based implementation of Direct3D 8, 9, 10 and 11 for Linux/Wine.<br/><br/><b>Warning: Nightly version is unstable, use with caution!</b>
ta: டி.எக்ச்.வி.கே (மாச்டர் கிளை) இன் இரவு பதிப்பு, லினக்ச்/ஒயின் டைரக்ட் 3 டி 8, 9, 10 மற்றும் 11 இன் வல்கன் அடிப்படையிலான செயல்படுத்தல். <br/> <br/> <b> எச்சரிக்கை: இரவு பதிப்பு நிலையற்றது, எச்சரிக்கையுடன் பயன்படுத்தவும்!

# steamutil.py
source: Unable to Remove SteamTinkerLaunch
ta: Steamtinkerlaunch ஐ அகற்ற முடியவில்லை

# steamutil.py
source: Access to SteamTinkerLaunch installation folder at '{STL_SYMLINK_PATH}' was denied, please remove this folder manually. The uninstallation will continue.
ta: '{STL_SYMLINK_PATH}' இல் உள்ள ச்டீம்டின்கெர்லாஞ்ச் நிறுவல் கோப்புறையின் அணுகல் மறுக்கப்பட்டது, தயவுசெய்து இந்த கோப்புறையை கைமுறையாக அகற்றவும். நிறுவல் நீக்குதல் தொடரும்.

# translator-text
source: Translated by DavidoTek
ta: டேவிடோடெக் மொழிபெயர்த்தார்

# util.py
source: Delete SteamTinkerLaunch configuration
ta: Steamtinkerlaunch உள்ளமைவை நீக்கு

# util.py
source: Uninstalling SteamTinkerLaunch
ta: Steamtinkerlaunch ஐ நிறுவல் நீக்குதல்

# util.py
source: SteamTinkerLaunch will be removed from your system. If this tool was installed with ProtonUp-Qt, this will also update your PATH to remove SteamTinkerLaunch. Do you want the configuration to be removed?
ta: உங்கள் கணினியிலிருந்து Steamtinkerlaunch அகற்றப்படும். இந்த கருவி புரோட்டானப்-கியூடி மூலம் நிறுவப்பட்டிருந்தால், இது ச்டீம்டின்கெர்லாஞ்சை அகற்ற உங்கள் பாதையையும் புதுப்பிக்கும். உள்ளமைவு அகற்றப்பட வேண்டுமா?

# util.py
source: Warning: GitHub API rate limit exceeded!
ta: எச்சரிக்கை: அறிவிலிமையம் பநிஇ வீத வரம்பு மீறியது!

# util.py
source: GitHub API rate limit exceeded. You may need to wait a while or specify a GitHub API key if you have one. See https://github.com/DavidoTek/ProtonUp-Qt/issues/161#issuecomment-1358200080 for details.
ta: அறிவிலிமையம் பநிஇ வீத வரம்பு மீறியது. உங்களிடம் சிறிது நேரம் காத்திருக்க வேண்டியிருக்கலாம் அல்லது உங்களிடம் ஒன்று இருந்தால் அறிவிலிமையம் பநிஇ விசையை குறிப்பிட வேண்டும். விவரங்களுக்கு https://github.com/davidotek/protonup-qt/issues/161#issuecomment-1358200080 ஐப் பார்க்கவும்.

# util.py
source: Warning: GitLab API rate limit exceeded!
ta: எச்சரிக்கை: அறிவிலிஆய்வு பநிஇ வீத வரம்பு மீறியது!

# util.py
source: GitLab API rate limite exceeded. You may want to wait a while or specify a GitLab API key generated for this GitLab instance if you have one.
ta: அறிவிலிஆய்வு பநிஇ வீத வரம்பு மீறியது. உங்களிடம் சிறிது நேரம் காத்திருக்க விரும்பலாம் அல்லது உங்களிடம் ஒன்று இருந்தால் இந்த அறிவிலிஆய்வு நிகழ்வுக்காக உருவாக்கப்பட்ட அறிவிலிஆய்வு பநிஇ விசையை குறிப்பிடலாம்.

# util.py
source: missing
ta: இல்லை

# util.py
source: found
ta: காணப்பட்டது

# util.py
source: You need following dependencies for {CT_NAME}: {DEP_ENUM} Will continue the installation anyway.
ta: {Ct_name க்கு க்கான பின்வரும் சார்புகள் உங்களுக்குத் தேவை: {CT_NAME} எப்படியும் நிறுவலைத் தொடரும்.
