Repository: 247i/TACETr
Catalog: உரை/தானி/pyrates-pyrates-*.po
Languages: ta

source: pirates’ island
ta: பைரேட்ச் தீவு

source: treasure island
ta: புதையல் தீவு

source: defunct distillery
ta: செயலிழந்த டிச்டில்லரி

source: town island
ta: பேரூர் தீவு

source: devil’s triangle
ta: பிசாசின் முக்கோணம்

source: trading outpost
ta: வர்த்தக புறக்காவல்

source: Z
ta: சட்

source: The famous pirate Captain Cofresí has passed away. Rumor has it that he left a memoir. Publishers will pay a handsome sum to anyone who will find it…
ta: பிரபலமான கொள்ளையர் கேப்டன் கோஃப்ரேசே காலமானார். அவர் வெளியேறினார் என்று புரளி உள்ளது ஒரு நினைவுக் குறிப்பு. அதைக் கண்டுபிடிக்கும் எவருக்கும் வெளியீட்டாளர்கள் ஒரு அழகான தொகையை செலுத்துவார்கள்…

source: Nearby islands:
ta: அருகிலுள்ள தீவுகள்:

source: {} is a {}.
ta: {} என்பது ஒரு {}.

source: ({} day away)
ta: ({} நாள் தொலைவில்)

source: [{exit}] exit game
ta: [{exit}] வெளியேறு விளையாட்டு

source: Where do you go?
ta: நீங்கள் எங்கு செல்கிறீர்கள்?

source: Huh…?
ta: ஊ…?

source: You don’t have enough food to reach {name}. Choose another destination:
ta: {பெயர் yout ஐ அடைய உங்களிடம் போதுமான உணவு இல்லை. மற்றொரு இலக்கைத் தேர்வுசெய்க:

source: Island
ta: தீவு

source: You have found all chapters of Captain Cofresí’s memoir! Your voyage lasted {} {}.
ta: கேப்டன் கோஃப்ரெசின் நினைவுக் குறிப்பின் அனைத்து அத்தியாயங்களையும் நீங்கள் கண்டறிந்துள்ளீர்கள்! உங்கள் பயணம் {} {} நீடித்தது.

source: day
ta: நாள்

source: [ENTER] game over
ta: [உள்ளிடவும்] விளையாட்டு ஓவர்

source: y
ta: ஒய்

source: x
ta: ஃச்

source: o
ta: ஓ

# talk
source: t
ta: டி

source: evening
ta: மாலை

source: afternoon
ta: பிற்பகல்

source: midday
ta: ஒன்று

source: morning
ta: காலை

# masculine pronoun
source: he
ta: அவர்

# feminine pronoun
source: she
ta: சீ

# neutral pronoun
source: they
ta: அவர்கள்

# person
source: pirate
ta: கொள்ளையர்

source: Mlg: {}
ta: எம்.எல்.சி: {}

source: Arith: {}/{}
ta: இல்லை: {}/{}

source: {}- {} {} of food
ta: {}- {} {} உணவு

source: can
ta: முடியும்

source: {}- {} {} of gold
ta: தங்கத்தின் {}- {} {}

source: piece
ta: துண்டு

source: {}- {} {} of rum
ta: {}- ரம்

source: bottle
ta: பாட்டில்

source: key
ta: விசை

source: arithmometer
ta: எண்கணிதமானி

source: chapter of Cofresí’s memoir
ta: கோஃப்ரெசின் நினைவுக் குறிப்பின் அத்தியாயம்

source: You get a chapter of Captain Cofresí’s memoir from the chest!
ta: கேப்டன் கோஃப்ரெசின் நினைவுக் குறிப்பின் அத்தியாயத்தை மார்பிலிருந்து பெறுவீர்கள்!

source: You get $gold $piece_form of gold from the chest.
ta: மார்பிலிருந்து $ தங்கம் $ துண்டு_ஃபார்மைப் பெறுவீர்கள்.

source: You get the map of nearby islands.
ta: அருகிலுள்ள தீவுகளின் வரைபடத்தைப் பெறுவீர்கள்.

source: The chest is empty.
ta: மார்பு காலியாக உள்ளது.

source: You find Cofresí’s message in a bottle; it contains misleading information:
ta: கோஃப்ரெசின் செய்தியை ஒரு பாட்டில் காணலாம்; இது தவறான தகவல்களைக் கொண்டுள்ளது:

source: Log book entry {:%B %d, %Y (%A) %H:%M:%S}
ta: பதிவு புத்தக நுழைவு {:%b%d,%y (%a)%h:%m:%s}

source: Neither {}, nor {} is a {}.
ta: {}, அல்லது {} ஒரு {} அல்ல.

source: {} and {} are the same kind of island.
ta: {} மற்றும் {} ஒரே மாதிரியான தீவு.

source: {} or {} is a {}.
ta: {} அல்லது {} என்பது ஒரு {}.

source: Either {}, or {} is a {}.
ta: ஒன்று {}, அல்லது {} என்பது {}.

source: {} and {} are different kinds of island.
ta: {} மற்றும் {} ஆகியவை வெவ்வேறு வகையான தீவு.

source: At least one island is a {}.
ta: குறைந்தது ஒரு தீவு ஒரு {}.

source: None of the islands is a {}.
ta: தீவுகள் எதுவும் {} அல்ல.

source: You find Cofresí’s message in a bottle with encrypted parts of island names:
ta: தீவு பெயர்களின் மறைகுறியாக்கப்பட்ட பகுதிகளைக் கொண்ட ஒரு பாட்டில் கோஃப்ரெசின் செய்தியை நீங்கள் காணலாம்:

# chest list
source: RUSTY
ta: ரச்டி

# chest found
source: RUSTY
ta: ரச்டி

# chest list
source: SHINY
ta: பளபளப்பான

# chest found
source: SHINY
ta: பளபளப்பான

# chest list
source: STURDY
ta: துணிவுமிக்க

# chest found
source: STURDY
ta: துணிவுமிக்க

# chest list
source: DUSTY
ta: தூசி நிறைந்த

# chest found
source: DUSTY
ta: தூசி நிறைந்த

# chest list
source: YELLOW
ta: மஞ்சள்

# chest found
source: YELLOW
ta: மஞ்சள்

# chest list
source: BLUE
ta: நீலம்

# chest found
source: BLUE
ta: நீலம்

# chest list
source: RED
ta: சிவப்பு

# chest found
source: RED
ta: சிவப்பு

# chest list
source: GREEN
ta: பச்சை

# chest found
source: GREEN
ta: பச்சை

# chest list
source: BROWN
ta: பழுப்பு

# chest found
source: BROWN
ta: பழுப்பு

# chest list
source: VIOLET
ta: கத்தரி

# chest found
source: VIOLET
ta: கத்தரி

# chest list
source: an IRON
ta: ஒரு இரும்பு

# chest found
source: an IRON
ta: ஒரு இரும்பு

# chest list
source: a STEEL
ta: ஒரு எஃகு

# chest found
source: a STEEL
ta: ஒரு எஃகு

# chest list
source: a COPPER
ta: ஒரு தாமிரம்

# chest found
source: a COPPER
ta: ஒரு தாமிரம்

# chest list
source: a BRASS
ta: ஒரு பித்தளை

# chest found
source: a BRASS
ta: ஒரு பித்தளை

source: A chest with a treasure has one distinctive characteristic. There is one chest per row and column.
ta: ஒரு புதையல் கொண்ட மார்பில் ஒரு தனித்துவமான பண்பு உள்ளது. ஒரு மார்பு உள்ளது ஒரு வரிசை மற்றும் நெடுவரிசைக்கு.

source: [{exit}] leave the island
ta: [{exit}] தீவை விட்டு வெளியேறவும்

source: It’s $daytime ($daypart/$allparts). Where do you go?
ta: இது $ பகல்நேரம் ($ daypart/$ allparts). நீங்கள் எங்கு செல்கிறீர்கள்?

source: You find an open chest.
ta: நீங்கள் ஒரு திறந்த மார்பைக் காணலாம்.

source: You find a {attribute} {color} chest with {padlock} padlock.
ta: {attribute} பேட்லாக் கொண்ட {பண்புக்கூறு {color} மார்பைக் காணலாம்.

source: [{open}] open the chest [{cancel}] keep scavenging
ta: [{open}] மார்பைத் திறக்கவும் [{cancel}] தோட்டி வைக்கவும்

source: What do you do?
ta: நீங்கள் என்ன செய்கிறீர்கள்?

source: You find a chest with:
ta: நீங்கள் ஒரு மார்பைக் காணலாம்:

source: {attribute} {color}, {padlock} padlock: loot
ta: {attribute} {color}, {padlock} பேட்லாக்: கொள்ளை

source: You find a broken arithmometer, but you don’t have any key, so you can’t fix it.
ta: உடைந்த எண்கணிதியைக் காணலாம், ஆனால் உங்களிடம் எந்த விசையும் இல்லை, எனவே அதை சரிசெய்ய முடியாது.

source: You find a broken arithmometer. Do you want to fix it? [{yes}/{no}]
ta: உடைந்த எண்கணிதியைக் காணலாம். அதை சரிசெய்ய விரும்புகிறீர்களா? [{yes}/{no}]

source: You find a chapter of Captain Cofresí’s memoir!
ta: கேப்டன் கோஃப்ரெசின் நினைவுக் குறிப்பின் அத்தியாயத்தை நீங்கள் காணலாம்!

source: {attribute} {color}, {padlock} padlock: empty
ta: {attribute} {color}, {padlock} பேட்லாக்: காலியாக

source: You starve to death.
ta: நீங்கள் பட்டினி கிடக்கிறீர்கள்.

source: You can’t open the chest, because you have no keys.
ta: உங்களிடம் சாவிகள் இல்லாததால் மார்பைத் திறக்க முடியாது.

source: You don’t find anything.
ta: நீங்கள் எதையும் கண்டுபிடிக்கவில்லை.

source: $name finds a chest with:
ta: $ பெயர் ஒரு மார்பைக் காண்கிறது:

source: You find an empty chest.
ta: நீங்கள் ஒரு வெற்று மார்பைக் காணலாம்.

source: $name finds an empty chest.
ta: $ பெயர் வெற்று மார்பைக் காண்கிறது.

source: There is one chest per row and column. You meet {}.
ta: ஒரு வரிசை மற்றும் நெடுவரிசைக்கு ஒரு மார்பு உள்ளது. நீங்கள் சந்திக்கிறீர்கள் {}.

source: {}: Let’s work together and share the loot! {}Agreed? [{}/{}]
ta: {}: ஒன்றாக வேலை செய்து கொள்ளையைப் பகிர்வோம்! {} ஒப்புக்கொண்டதா? [{}/{}]

source: The adventurer refuses to work with you.
ta: சாகசக்காரர் உங்களுடன் பணியாற்ற மறுக்கிறார்.

source: Shared loot:
ta: பகிரப்பட்ட கொள்ளை:

source: [{cancel}] steal the loot [{exit}] leave the island
ta: [{cancel}] கொள்ளையை திருடுங்கள் [{exit}] தீவை விட்டு வெளியேறவும்

source: Are you sure you want to steal the loot? [{yes}/{no}]
ta: நீங்கள் நிச்சயமாக கொள்ளையைத் திருட விரும்புகிறீர்களா? [{yes}/{no}]

source: You find a closed chest.
ta: நீங்கள் ஒரு மூடிய மார்பைக் காணலாம்.

source: {}Take {} of the shared loot. Agreed? [{}/{}]
ta: } பகிரப்பட்ட கொள்ளை}} ஐ எடுத்துக் கொள்ளுங்கள். ஒப்புக்கொண்டதா? [{}/{}]

source: $name sails away with the loot.
ta: $ பெயர் கொள்ளையடிப்பதன் மூலம் பெயர்.

source: $name sails away.
ta: $ பெயர் பயணம்.

source: NE
ta: அது

source: SE
ta: உடன்

source: You find a note: “{}.”
ta: நீங்கள் ஒரு குறிப்பைக் காணலாம்: “{}.”

source: “$note.”; found in $where
ta: “$ குறிப்பு.”; $ எங்கே காணப்படுகிறது

source: The dog is in the fog
ta: நாய் மூடுபனியில் உள்ளது

source: The cat is in the vat
ta: பூனை வாட்

source: The goat is in the boat
ta: ஆடு படகில் உள்ளது

source: The snail is on the sail
ta: நத்தை படகில் உள்ளது

source: On the island a pirate is trying to hide his treasure in one of his hideouts. When you visit each hideout, he tries to move the treasure to an adjacent quarter of the island and leaves a note with the codename of the new hideout.
ta: தீவில் ஒரு கொள்ளையர் தனது புதையலை தனது மறைவிடங்களில் மறைக்க முயற்சிக்கிறார். ஒவ்வொரு மறைவிடத்தையும் நீங்கள் பார்வையிடும்போது, ​​அவர் புதையலை அருகிலுள்ள இடத்திற்கு நகர்த்த முயற்சிக்கிறார் தீவின் கால் மற்றும் புதிய மறைவிடத்தின் குறியீட்டுடன் ஒரு குறிப்பை விட்டு விடுகிறது.

source: Do you want to leave the island? [{yes}/{no}]
ta: நீங்கள் தீவை விட்டு வெளியேற விரும்புகிறீர்களா? [{yes}/{no}]

source: [ENTER] leave the island
ta: [உள்ளிடவும்] தீவை விட்டு வெளியேறவும்

source: Set the middle switch to… [+/-]
ta: நடுத்தர சுவிட்சை அமைக்கவும்… [+/-]

source: You fixed the device.
ta: நீங்கள் சாதனத்தை சரிசெய்தீர்கள்.

source: The device doesn’t work.
ta: சாதனம் வேலை செய்யாது.

source: Adjust the switch number… [1-3]
ta: சுவிட்ச் எண்ணை சரிசெய்யவும்… [1-3]

source: Vat $numb has $count $setting_form.
ta: VAT $ NUMB க்கு $ எண்ணிக்கை $ settion_form உள்ளது.

source: correct setting
ta: சரியான அமைப்பு

source: $how_many other $vat_is of the same type as vat $numb.
ta: $ வேறு எத்தனை $ VAT $ எண்ணின் அதே வகை.

source: vat is
ta: வாட்

source: [{cancel}] quit
ta: [{cancel}] வெளியேறு

source: Adjust the rum vats and prevent them from exploding. Each vat works properly when 0, 1, or 2 valves are set to “+”.
ta: ரம் வாட்களை சரிசெய்து வெடிப்பதைத் தடுக்கவும். ஒவ்வொரு வாட் சரியாக வேலை செய்கிறது 0, 1, அல்லது 2 வால்வுகள் “+” ஆக அமைக்கப்படும் போது.

source: Vat
ta: வாட்

source: Fragments of maintenance documentation:
ta: பராமரிப்பு ஆவணங்களின் துண்டுகள்:

source: Press.
ta: அழுத்தவும்.

source: Adjust valves in vat number… [e.g. 1-+]
ta: வாட் எண்ணில் வால்வுகளை சரிசெய்யவும்… [எ.கா. 1-+]

source: You’ve fixed all the vats!
ta: நீங்கள் எல்லா வாட்சையும் சரி செய்துள்ளீர்கள்!

source: Vat number {} explodes! The distillery is ruined.
ta: வாட் எண்}} வெடிக்கிறது! டிச்டில்லரி பாழாகிறது.

source: Find sugarcane, fruit, and fresh water to make rum and canned food. The distillery and the ingredients are placed in different quarters of the island (north-western, north-eastern, south-western, and south-eastern).
ta: ரம் மற்றும் பதிவு செய்யப்பட்ட உணவை தயாரிக்க கரும்பு, பழம் மற்றும் புதிய நீரைக் கண்டுபிடி. டிச்டில்லரி மற்றும் பொருட்கள் வெவ்வேறு பகுதிகளில் வைக்கப்படுகின்றன தீவு (வடமேற்கு, வடகிழக்கு, தென்மேற்கு மற்றும் தென்கிழக்கு).

source: Since you don’t have any keys, you can’t operate the distillery.
ta: உங்களிடம் திறவுகோல் இல்லாததால், நீங்கள் டிச்டில்லரியை இயக்க முடியாது.

source: {} ingredient to the…
ta: {} மூலப்பொருள்…

source: {} distillery
ta: {} டிச்டில்லரி

source: You find FRUIT!
ta: நீங்கள் பழத்தைக் காணலாம்!

source: You find SUGARCANE!
ta: நீங்கள் கரும்பு காண்கிறீர்கள்!

source: You find FRESH WATER!
ta: நீங்கள் புதிய தண்ணீரைக் காணலாம்!

source: You make $count_rum $rum of rum and $count_food $food of fruit.
ta: நீங்கள் $ count_rum $ ரம் ஆஃப் ரம் மற்றும் $ count_food $ பழத்தின் உணவை உருவாக்குகிறீர்கள்.

source: Choose a place [{cancel}=quit]:
ta: ஒரு இடத்தைத் தேர்வுசெய்க [{cancel} = வெளியேறு]:

source: You can’t do this here.
ta: இதை இங்கே செய்ய முடியாது.

source: You meet {}. If you help to relaunch the distillery, {} promises to give you the contents of the treasure chest.
ta: நீங்கள் சந்திக்கிறீர்கள் {}. டிச்டில்லரியை மீண்டும் தொடங்க நீங்கள் உதவினால், {} புதையல் மார்பின் உள்ளடக்கங்களை உங்களுக்கு வழங்குவதாக உறுதியளிக்கிறது.

source: You meet {}. {} doesn’t want your help with the distillery…
ta: நீங்கள் சந்திக்கிறீர்கள் {}. {the டிச்டில்லரியுடன் உங்கள் உதவியை விரும்பவில்லை…

source: {} talk to {}
ta: {} {} உடன் பேசுங்கள்

source: $well relocate the well
ta: $ கிணற்றை இடமாற்றம் செய்யுங்கள்

source: $sugarcane$fruit plant sugarcane or fruit
ta: $ கரும்பு $ பழ ஆலை கரும்பு அல்லது பழம்

source: $dry_plant water sugarcane or fruit
ta: $ உலர்_பிளைந்த நீர் கரும்பு அல்லது பழம்

source: $distillery fix the pressure switch (press. $press/4)
ta: $ டிச்டில்லரி அழுத்த சுவிட்சை சரிசெய்யவும் (அழுத்தவும். $ அழுத்தவும்/4)

source: $shop upgrade the water pump (now: +$bonus)
ta: $ சாப் நீர் பம்பை மேம்படுத்தவும் (இப்போது: +$ போனச்)

source: {}: I still need your help with the crops…
ta: {}: பயிர்களுக்கு உங்கள் உதவி எனக்கு இன்னும் தேவை…

source: {}: Thank you for your help! Here’s your reward.
ta: {}: உங்கள் உதவிக்கு நன்றி! இங்கே உங்கள் வெகுமதி.

source: You goof around the island.
ta: நீங்கள் தீவைச் சுற்றி முட்டாள்தனம்.

source: {}: I don’t expect you want a reward for THAT…
ta: {}: அதற்கான வெகுமதி உங்களுக்கு வேண்டும் என்று நான் எதிர்பார்க்கவில்லை…

# pirate ship on map
source: P
ta: ப

source: $shop carpentry shop $ship pirate ship
ta: $ கடை தச்சு கடை $ கப்பல் கொள்ளையர் கப்பல்

source: $palm palm tree $chest treasure chest
ta: $ பனை பனை மரம் $ மார்பு புதையல் மார்பு

source: $rum rum pantry $food food pantry
ta: $ ரம் பேன்ட்ரி $ உணவு உணவு சரக்கறை

source: [{cancel}] steal a chest
ta: [{cancel}] ஒரு மார்பைத் திருடுங்கள்

source: Which chest do you want to steal? [{}/{}=cancel]
ta: எந்த மார்பு திருட விரும்புகிறீர்கள்? [{}/{} = ரத்துசெய்]

source: WATCHKEEPER: Oy! Leave da chest alone!
ta: கண்காணிப்பாளர்: ஆன்! விட்டுவிட்டு மார்பு தனியாக!

source: You meet the pirate and take {} {} and 1 key.
ta: நீங்கள் கொள்ளையரைச் சந்தித்து {} {} மற்றும் 1 விசையை எடுத்துக் கொள்ளுங்கள்.

source: You don’t meet the pirate.
ta: நீங்கள் கொள்ளையரை சந்திக்க வேண்டாம்.

source: north
ta: வடக்கு

source: south
ta: தெற்கு

source: west
ta: மேற்கு

source: east
ta: கிழக்கு

# how far from
source: the food pantry
ta: உணவு சரக்கறை

# how far from
source: the rum pantry
ta: ரம் சரக்கறை

# how far from
source: the carpentry shop
ta: தச்சு கடை

# how far from
source: the pirate ship
ta: கொள்ளையர் கப்பல்

# how far from
source: the treasure chest
ta: புதையல் மார்பு

source: {} next to {}.
ta: {}}} க்கு அடுத்ததாக.

source: {} close to {}.
ta: }} {for க்கு அருகில்.

source: {} far from {}.
ta: {} {} full.

source: {} very far from {}.
ta: }} full} இருந்து fund.

source: {} to the {} from {}.
ta: {}} for} from}.

source: $shop carpentry shop $ship pirate ship
ta: $ கடை தச்சு கடை $ கப்பல் கொள்ளையர் கப்பல்

source: $palm palm tree $chest treasure chest
ta: $ பனை பனை மரம் $ மார்பு புதையல் மார்பு

source: $rum rum pantry $food food pantry
ta: $ ரம் பேன்ட்ரி $ உணவு உணவு சரக்கறை

source: You find the keyring, get {} {} and {} {} from the pantry.
ta: நீங்கள் கீரிங்கைக் கண்டுபிடித்து, சரக்கறைக்கு {} {} மற்றும் {} {bete ஐப் பெறுங்கள்.

# adjective
source: apple
ta: அரத்திப்பழம், குமளிப்பழம்

# adjective
source: cherry
ta: சேலா(ப்பழம்)

# adjective
source: orange
ta: ஆரஞ்சு

# adjective
source: lemon
ta: எலுமிச்சை

# adjective
source: peach
ta: குழிப்பேரி

# adjective
source: apricot
ta: சர்க்கரை பாதாமி

# adjective
source: strawberry
ta: செம்புற்றுப்பழம்

# adjective
source: raspberry
ta: புற்றுப்பழம்

# adjective
source: blackcurrant
ta: பிளாக் கொரண்ட்

# adjective
source: lime
ta: சுண்ணாம்பு

# adjective
source: watermelon
ta: குமட்டிப்பழம், தர்பூசணி

# adjective
source: mango
ta: மாம்பழம்

# adjective
source: cranberry
ta: குருதிநெல்லி

# adjective
source: pear
ta: பியர்

source: {} rum {}!
ta: }} ரம் {}!

source: rulez
ta: பங்கு

source: foreva
ta: முன்னறிவிப்பு

source: our luv
ta: எங்கள் லவ்

source: {} is a pirate island! The pirates have this flag over their HQ:
ta: {} என்பது ஒரு கொள்ளையர் தீவு! கடற்கொள்ளையர்கள் இந்த கொடியை தங்கள் தலைமையகத்தின் மீது வைத்திருக்கிறார்கள்:

source: {}: Say, what kinda rum d’we fancy?
ta: {}: சொல்லுங்கள், நாங்கள் என்ன கின்டா ரம் டி விரும்புகிறோம்?

source: {}Aye! Never shoulda let my parrot make da flag…
ta: {} Aye! என் கிளி டா கொடியை உருவாக்க வேண்டாம்…

source: {}We’ll kindly relieve ye of yer rum…
ta: {You நீங்கள் தயவுசெய்து உங்கள் ரம் நிம்மதியாக இருப்போம்…

source: {}Nay! Pay fer yer mistake! We take:
ta: {} இல்லை! தவறாகப் பணம் செலுத்துங்கள்! நாங்கள் எடுத்துக்கொள்கிறோம்:

source: {}Hush! Gonna let ye go if ye help me get some rum ‘n’ food fer m’self.
ta: {} அச்! சில ரம் ‘மற்றும்’ உணவைப் பெற எனக்கு உதவினால் உங்களை விடுவிக்கப் போகிறீர்கள்.

source: {}Meet me at a pantry t’night…
ta: {The என்னை ஒரு சரக்கறை டி’நைட்டில் சந்திக்கவும்…

source: {}Find me da pantry keys unda a palmtree…
ta: {} ஒரு பனை மரத்தின் கீழ் ஒரு சரக்கறை விசைகளைக் கண்டுபிடி…

source: {}Ye’ve no food left. Ye’ll stay with us!
ta: You you நீங்கள் எந்த உணவை மீதமில்லை. நீங்கள் எங்களுடன் இருப்பீர்கள்!

source: {}: Arr! Ye’d make a good pirate! Fare well!
ta: {}: அர்! நீங்கள் ஒரு நல்ல கொள்ளையரை உருவாக்குகிறீர்கள்! நன்றாக கட்டணம்!

source: {}: My parrot coulda do better… Fare well!
ta: {}: எனது கிளி சிறப்பாகச் செய்ய முடியும்… பிரியாவிடை!

source: You find THE MAP!
ta: நீங்கள் வரைபடத்தைக் காணலாம்!

# how far from
source: fresh water
ta: புதிய நீர்

# how far from
source: the wreck of a pirate ship
ta: ஒரு கொள்ளையர் கப்பலின் சிதைவு

# how far from
source: the hut
ta: குடிசை

# how far from
source: the defunct distillery
ta: செயலிழந்த டிச்டில்லரி

source: You’ve sailed into a devil’s triangle. In order to leave, you need to find the map of the archipelago. You find fragments of adventurer’s diary:
ta: நீங்கள் ஒரு பிசாசின் முக்கோணத்தில் பயணம் செய்துள்ளீர்கள். வெளியேற, நீங்கள் கண்டுபிடிக்க வேண்டும் தீவுக்கூட்டத்தின் வரைபடம். சாகசக்காரரின் நாட்குறிப்பின் துண்டுகளை நீங்கள் காணலாம்:

source: Adventurer’s diary:
ta: சாகசக்காரரின் நாட்குறிப்பு:

source: [{cancel}] leave the triangle [{exit}] exit game
ta: [{cancel}] முக்கோணத்தை விட்டு விடுங்கள் [{exit}] வெளியேறும் விளையாட்டை விட்டு விடுங்கள்

# person
source: merchant
ta: வணிகர்

source: [{}/{}!] steal rum ({}) or food ({}) and leave
ta: [{}/{}!] ரம் ({}) அல்லது உணவு ({}) திருடி விடுங்கள்

source: [{cancel}] end day
ta: [{cancel}] இறுதி நாள்

source: [{buy rum}/{buy food}] buy rum/food
ta: [{buy rum}/{buy food}] ரம்/உணவை வாங்கவும்

source: You steal {} {} of rum.
ta: நீங்கள் ரம் {} {the st ஐ திருடுகிறீர்கள்.

source: You steal {} {} of food.
ta: நீங்கள் உணவைத் திருடுகிறீர்கள்.

source: MERCHANT: Trying to steal from me?! Off you go!
ta: வணிகர்: என்னிடமிருந்து திருட முயற்சிக்கிறீர்களா?! நீங்கள் செல்லுங்கள்!

source: That’s a nice rum you’ve got there.
ta: இது நீங்கள் அங்கு வந்த ஒரு நல்ல ரம்.

source: Just resting here before I move on.
ta: நான் செல்வதற்கு முன் இங்கே ஓய்வெடுக்கிறேன்.

source: On {:%b %d, %Y} I spent 3 months in devil’s triangle!
ta: {: %B %d, %y} நான் 3 மாதங்கள் பிசாசின் முக்கோணத்தில் கழித்தேன்!

source: Got any rum, friend?
ta: ஏதாவது ரம் கிடைத்தது, நண்பரா?

source: With no food left, you stay on the island to work as an outpost attendant.
ta: உணவு எதுவும் இல்லாமல், நீங்கள் ஒரு புறக்காவல் உதவியாளராக வேலை செய்ய தீவில் தங்கியிருக்கிறீர்கள்.

source: A {} is {} {} away.
ta: A {} என்பது {} {} தொலைவில் உள்ளது.

source: {} is not a {}.
ta: {} என்பது ஒரு {} அல்ல.

source: A {} isn’t {} {} away.
ta: A {} என்பது {} {} தொலைவில் இல்லை.

# visit harbor
source: z
ta: சட்

# visit tavern
source: t
ta: டி

source: l
ta: எல்

# visit shipyard
source: s
ta: கள்

source: h
ta: ம

source: locksmith
ta: பூட்டு தொழிலாளி

source: tavern keeper
ta: டேவர்ன் கீப்பர்

source: shipwright
ta: கப்பல் எழுதுதல்

source: alderman
ta: ஆல்டர்மேன்

source: mapmaker
ta: வரைபட தயாரிப்பாளர்

source: harbor master
ta: துறைமுக மாச்டர்

source: the shipyard
ta: கப்பல் தளம்

source: the harbor
ta: துறைமுகம்

source: locksmith’s shop
ta: பூட்டு தொழிலாளி கடை

source: the tavern
ta: உணவகம்

source: the town hall
ta: பேரூர் ஆல்

source: [{}] {} (leave the island)
ta: [{}] {} (தீவை விட்டு விடுங்கள்)

source: {} steals {} {} of your gold! You may get help in the town hall…
ta: Your உங்கள் தங்கத்தின் {} {the திருடுகிறது! நீங்கள் உதவி பெறலாம் பேரூர் ஆல்…

source: {}Look for the mapmaker in {} or {}.
ta: Map} map} அல்லது {in இல் வரைபடத் தயாரிப்பாளரைத் தேடுங்கள்.

source: {}Look for the thief in {} or {}.
ta: {} The திருடனை {} அல்லது {in இல் தேடுங்கள்.

source: You don’t have any food; you stay on the island.
ta: உங்களிடம் உணவு இல்லை; நீங்கள் தீவில் இருங்கள்.

source: {}: We’re collecting information about nearby pirate islands. {}Can we talk about the last pirate island you visited? [{}/{}]
ta: {}: அருகிலுள்ள கொள்ளையர் தீவுகள் பற்றிய தகவல்களை நாங்கள் சேகரிக்கிறோம். You நீங்கள் பார்வையிட்ட கடைசி கொள்ளையர் தீவைப் பற்றி பேசலாமா? [{}/{}]

source: pirate ships
ta: கொள்ளையர் கப்பல்கள்

source: palm trees
ta: பனை மரங்கள்

source: carpentry shops
ta: தச்சு கடைகள்

source: treasure chests
ta: புதையல் மார்பு

source: {}How many {} do the pirates have?
ta: {} பைரேட்ச் எத்தனை}} உள்ளது?

source: {}Thank you for the help! Enjoy your stay!
ta: {உதவிக்கு நன்றி! உங்கள் தங்குமிடத்தை அனுபவிக்கவும்!

source: {}Other adventurers disagree with you…
ta: {} பிற சாகசக்காரர்கள் உங்களுடன் உடன்படவில்லை…

source: {}Pity…
ta: {} பரிதாபம்…

source: {}: We don’t like folks like you around here…
ta: {}: உங்களைப் போன்றவர்களை இங்கே நாங்கள் விரும்பவில்லை…

source: {}: Enjoy the stay in our town!
ta: {}: எங்கள் ஊரில் தங்குவதை அனுபவிக்கவும்!

source: {}: Our distillery has broken down. Will you fix it for the map of nearby {}islands? [{}/{}]
ta: {}: எங்கள் டிச்டில்லரி உடைந்துவிட்டது. அருகிலுள்ள வரைபடத்திற்கு அதை சரிசெய்வீர்களா? {} தீவுகள்? [{}/{}]

source: {}Suit yourself!
ta: You you நீங்களே பொருத்தமாக!

source: {}: Our mapmaker is a real drunk. He might sell you a map for rum if you {}find him. Look for the mapmaker in {} or {}.
ta: {}: எங்கள் வரைபட தயாரிப்பாளர் ஒரு உண்மையான குடிபோதையில் இருக்கிறார். நீங்கள் இருந்தால் அவர் உங்களுக்கு ஒரு வரைபடத்தை விற்கலாம் {} அவரைக் கண்டுபிடி. வரைபட தயாரிப்பாளரை {} அல்லது {in இல் தேடுங்கள்.

source: [ENTER] continue
ta: [உள்ளிடவும்] தொடரவும்

source: {}: We’ve heard that you’ve been wronged and we’ll try to help you. {}Look for the thief in {} or {}.
ta: {}: உங்களுக்கு அநீதி இழைக்கப்பட்டுள்ளதாக நாங்கள் கேள்விப்பட்டிருக்கிறோம், நாங்கள் உங்களுக்கு உதவ முயற்சிப்போம். {} The திருடனை {} அல்லது {in இல் தேடுங்கள்.

source: {}: Have you found the mapmaker already?
ta: {}: நீங்கள் ஏற்கனவே வரைபட தயாரிப்பாளரைக் கண்டுபிடித்தீர்களா?

source: {}: Have you found the thief yet?
ta: {}: நீங்கள் இன்னும் திருடனைக் கண்டுபிடித்தீர்களா?

source: {}How many working ones do you want to sell?
ta: {You நீங்கள் எத்தனை வேலை செய்ய விரும்புகிறீர்கள்?

source: {}Tryina’ cheat me?! Off you go!
ta: {} Tryina ’என்னை ஏமாற்றுகிறதா?! நீங்கள் செல்லுங்கள்!

source: {}‘Twas a pleasure!
ta: {} ‘ஒரு இன்பம்!

source: {}: How many keys do you want to buy?
ta: {}: நீங்கள் எத்தனை விசைகளை வாங்க விரும்புகிறீர்கள்?

source: {}Say, I pay {} {} of gold for a broken arithmometer and {} for {}a working one. Wanna sell yours? [{}/{}]
ta: {} சொல்லுங்கள், நான் உடைந்த எண்கணிதமானி மற்றும் {} தங்கத்தை {} {} செலுத்துகிறேன் {} ஒரு வேலை. உங்களுடைய விற்க வேண்டுமா? [{}/{}]

source: {}How about {} {} for a broken one and {} for a working one? [{}/{}]
ta: {} உடைந்தவருக்கு {} {} மற்றும் வேலை செய்யும் ஒன்றுக்கு {} எப்படி? [{}/{}]

source: {}: Yer ship is in good shape.
ta: {}: உங்கள் கப்பல் நல்ல நிலையில் உள்ளது.

source: {}: I’ll fix yer ship for up to {} {} of gold.
ta: {}: தங்கத்தின் {} {to வரை உங்கள் கப்பலை சரிசெய்வேன்.

source: {}How much do you wanna pay?
ta: {You நீங்கள் எவ்வளவு செலுத்த விரும்புகிறீர்கள்?

source: {}Yer ship is good as new!
ta: {} Yer கப்பல் புதியது போல நல்லது!

source: {}How can I serve you? [{}/{}/{}]
ta: {You நான் உங்களுக்கு எப்படி பணி செய்ய முடியும்? [{}/{}/{}]

source: {}Have a safe journey!
ta: {The பாதுகாப்பான பயணம்!

source: {}How much food do you want to buy?
ta: {You நீங்கள் எவ்வளவு உணவை வாங்க விரும்புகிறீர்கள்?

source: {}How much rum do you want to buy?
ta: {You நீங்கள் எவ்வளவு ரம் வாங்க விரும்புகிறீர்கள்?
