Repository: 247i/TACETr
Catalog: உரை/தானி/pyrates-pyrates-*.po
Languages: ta

source: {}: I’ll give ye a map for yer rum. Whaddya say? [{}/{}]
ta: {}: நான் உங்கள் ரம் ஒரு வரைபடத்தை தருகிறேன். வாட்யா சொல்கிறீர்களா? [{}/{}]

source: {}: Pity you don’t have more rum…
ta: {}: பரிதாபம் உங்களிடம் அதிக ரம் இல்லை…

source: {}: Alright, take back the gold, you skinflint!
ta: {}: சரி, தங்கத்தை திரும்பப் பெறுங்கள், நீங்கள் ச்கின்ஃப்ளின்ட்!

source: MERCHANT SHIP
ta: வணிகக் கப்பல்

source: {}: Welcome, adventurer! Wanna buy some food? [{}/{}]
ta: {}: வரவேற்பு, சாகசக்காரர்! கொஞ்சம் உணவு வாங்க வேண்டுமா? [{}/{}]

source: [{}] slower escape route
ta: [{}] மெதுவாக தப்பிக்கும் பாதை

source: [{}] faster escape route
ta: [{}] வேகமாக தப்பிக்கும் பாதை

source: => wind direction
ta: => காற்றின் திசை

source: {} pirate ship
ta: {} பைரேட் கப்பல்

source: {} your ship
ta: Your your உங்கள் கப்பல்

source: You encounter a pirate ship!
ta: நீங்கள் ஒரு கொள்ளையர் கப்பலை எதிர்கொள்கிறீர்கள்!

source: The pirates go {} and they catch you!
ta: பைரேட்ச் செல்கிறது {} அவர்கள் உங்களைப் பிடிக்கிறார்கள்!

source: The pirates go {}; you have escaped.
ta: கடற்கொள்ளையர்கள் செல்கிறார்கள் {}; நீங்கள் தப்பித்தீர்கள்.

source: ocean
ta: கடல்

source: PIRATE SHIP
ta: கொள்ளையர் கப்பல்

source: {}Parley and we may letcha go…
ta: {} பார்லி மற்றும் நாங்கள் லெத்சா செல்லலாம்…

source: {}Where did ye meet {}? [1-4]
ta: {You நீங்கள் எங்கே சந்தித்தீர்கள் {}? [1-4]

source: {}What d’ya say? [1-4]
ta: D} என்ன டி யா சொல்கிறார்? [1-4]

source: {}‘Evn’t ya been on our island before? Tell us how many {} {}did we ‘ev and ye’ll pay less for yer freedom.
ta: {} ‘எவ் இதற்கு முன்பு எங்கள் தீவில் இல்லை? எத்தனை {} {} நாங்கள் ‘ஈவ் மற்றும் நீங்கள் உங்கள் சுதந்திரத்திற்காக குறைவாகவே பணம் செலுத்துவோம்.

source: Aye!
ta: ஆம்!

source: Nay!
ta: இல்லை!

source: {}{}Ye pay fer yer freedom:
ta: {} {} Ye ye fer yer சுதந்திரம்:

source: {}{}Keep yer lot. Fare well!
ta: {} {The your உங்கள் நிறைய வைத்திருங்கள். நன்றாக கட்டணம்!

source: {}You’ve no food left. Ye’ll stay with us!
ta: {You நீங்கள் உணவு எஞ்சியிருக்கவில்லை. நீங்கள் எங்களுடன் இருப்பீர்கள்!

source: {}Play paper rock scissors with us and we might letcha go…
ta: Paper} எங்களுடன் காகித ராக் கத்தரிக்கோல் விளையாடுங்கள், நாங்கள் லெட்சா செல்லலாம்…

source: [1] paper [2] rock [3] scissors
ta: [1] காகிதம் [2] பாறை [3] கத்தரிக்கோல்

source: Round {}/10 ({}:{}). Your move:
ta: சுற்று {}/10 ({}: {}). உங்கள் நடவடிக்கை:

source: PIRATE plays {}. Draw!
ta: கொள்ளையர் நாடகங்கள் {}. டிரா!

source: PIRATE plays {}. You win!
ta: கொள்ளையர் நாடகங்கள் {}. நீங்கள் வெல்வீர்கள்!

source: PIRATE plays {}. PIRATE wins!
ta: கொள்ளையர் நாடகங்கள் {}. கொள்ளையர் வெற்றி!

source: You see someone on a drifting raft. They are calling for help.
ta: நீங்கள் ஒரு சறுக்கல் படகில் பார்க்கிறீர்கள். அவர்கள் உதவிக்கு அழைப்பு விடுகிறார்கள்.

source: Do you pick them up? [{yes}/{no}]
ta: நீங்கள் அவற்றை அழைத்துச் செல்கிறீர்களா? [{yes}/{no}]

source: {}: May all gods of the sea reward you for your kindness!
ta: {}: கடலின் எல்லா கடவுள்களும் உங்கள் தயவுக்கு உங்களுக்கு வெகுமதி அளிக்கட்டும்!
