Repository: 247i/TACETr
Catalog: உரை/தானி/qooxdoo-playground-*.po
Languages: ta

source: %1 (modified)
ta: %1 (மாற்றியமைக்கப்பட்டது)

source: // Could not handle URL parameter! // %1
ta: // முகவரி அளவுருவைக் கையாள முடியவில்லை! // %1

source: // Your browser has a length restriction of the URL parameter which could have caused the problem.
ta: // உங்கள் உலாவியில் முகவரி அளவுருவின் நீள கட்டுப்பாடு உள்ளது, இது சிக்கலை ஏற்படுத்தக்கூடும்.

source: API Viewer
ta: பநிஇ பார்வையாளர்

source: Cannot append sample code to URL, as it is too long. Disable this warning in the future?
ta: மாதிரி குறியீட்டை முகவரி உடன் சேர்க்க முடியாது, ஏனெனில் இது மிக நீளமானது. எதிர்காலத்தில் இந்த எச்சரிக்கையை முடக்கவா?

source: CodePen
ta: கோடெபன்

source: Custom Code
ta: தனிப்பயன் குறியீடு

source: Delete
ta: நீக்கு

source: Demo Browser
ta: டெமோ உலாவி

source: Desktop
ta: டெச்க்டாப்

source: If you want to give qx.Website a try, please check out
ta: நீங்கள் qx.website ஐ முயற்சிக்க விரும்பினால், தயவுசெய்து பாருங்கள்

source: Log
ta: பதிவு

source: Manual
ta: கையேடு

source: Maximize
ta: அதிகரிக்க

source: Mobile
ta: மொபைல்

source: Mobile (Webkit only)
ta: மொபைல் (வெப்கிட் மட்டும்)

source: Open the qooxdoo API Viewer
ta: QOOXDOO பநிஇ பார்வையாளரைத் திறக்கவும்

source: Open the qooxdoo Demo Browser
ta: Qooxdoo டெமோ உலாவியைத் திறக்கவும்

source: Open the qooxdoo Manual
ta: Qooxdoo கையேட்டைத் திறக்கவும்

source: Playground
ta: விளையாட்டு மைதானம்

source: Please enter a name
ta: தயவுசெய்து ஒரு பெயரை உள்ளிடவும்

source: Rename
ta: மறுபெயரிடுங்கள்

source: Restore
ta: மீட்டமை

source: Run
ta: ஓடு

source: Run the source code
ta: மூலக் குறியீட்டை இயக்கவும்

source: Sample already exists. Do you want to overwrite?
ta: மாதிரி ஏற்கனவே உள்ளது. நீங்கள் மேலெழுத விரும்புகிறீர்களா?

source: Samples
ta: மாதிரிகள்

source: Save
ta: சேமி

source: Save As
ta: என சேமி

source: Shorten URL
ta: முகவரி ஐ சுருக்கவும்

source: Show log output
ta: பதிவு வெளியீட்டைக் காட்டு

source: Show samples
ta: மாதிரிகளைக் காட்டு

source: Source Code
ta: மூலக் குறியீடு

source: Starting application
ta: பயன்பாடு தொடக்க

source: Static
ta: நிலையான

source: Successfully started
ta: வெற்றிகரமாக தொடங்கியது

source: Syntax Highlighting
ta: தொடரியல் சிறப்பம்சமாக

source: Tap OK to discard your changes.
ta: உங்கள் மாற்றங்களை நிராகரிக்க சரி என்பதைத் தட்டவும்.

source: Unfortunately, an unrecoverable internal error was caused by your code. This may prevent the playground application to run properly.||
ta: துரதிர்ச்டவசமாக, உங்கள் குறியீட்டால் மீட்டெடுக்க முடியாத உள் பிழை ஏற்பட்டது. இது விளையாட்டு மைதான பயன்பாடு சரியாக இயங்குவதைத் தடுக்கலாம். ||

source: Use tinyurl to shorten the url.
ta: முகவரி ஐக் குறைக்க Tinyurl ஐப் பயன்படுத்தவும்.

source: User
ta: பயனர்

source: Website
ta: வலைத்தளம்

source: qooxdoo
ta: கழுத்து
