Repository: 247i/TACETr
Catalog: உரை/தானி/quickweather-quickweather-fastlane-*.po
Languages: ta

# changelogs/80.txt:1
source: * Added location indicator on radar * Polish Translation Updates via Weblate (Credit Rcvrvugyvgvb) * German Translation Updates via Weblate (Credit J. Lavoie) * French Translation Updates via Weblate (Credit J. Lavoie) * Dutch Translation Updates via Weblate (Credit arjan-s) * Italian Translation Updates via Weblate (Credit J. Lavoie) * Galician Translation Updates via Weblate (Credit @xcomesana) * Spanish Translation Updates via Weblate (Credit gallegonovato)
ta: * ரேடாரில் இருப்பிட காட்டி சேர்க்கப்பட்டது * வலைபெயர்ப்பு வழியாக போலந்து மொழிபெயர்ப்பு புதுப்பிப்புகள் (கடன் rcvrvuggyvgvb) * வலைபெயர்ப்பு வழியாக செர்மன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் சே. லாவோய்) * வலைபெயர்ப்பு வழியாக பிரஞ்சு மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் சே. லாவோய்) * வலைபெயர்ப்பு வழியாக டச்சு மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் அர்சன்-எச்) * வலைபெயர்ப்பு வழியாக இத்தாலிய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் சே. லாவோய்) * வலைபெயர்ப்பு வழியாக காலிசியன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @xcomesana) * வலைபெயர்ப்பு வழியாக ச்பானிச் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் கேலெகோனோவாடோ)

# changelogs/82.txt:1
source: * Added option to expand weather details by default * Added sunrise, sunset, moonrise, moonset to Gadgetbridge data * Bugfix: International Dateline Bug * Spanish Translation Updates via Weblate (Credit gallegonovato) * German Translation Updates via Weblate (Credit @kytta) * Russian Translation Updates via Weblate (Credit @kytta) * Galician Translation Updates via Weblate (Credit @xcomesana) * Greek Translation Updates via Weblate (Credit @stavpup) * Portugese Translation Updates via Weblate (Credit @MisterCosta96) * French Translation Updates via Weblate (Credit @fauust)
ta: * இயல்புநிலையாக வானிலை விவரங்களை விரிவாக்குவதற்கான விருப்பம் சேர்க்கப்பட்டது * கேசெட் பிரிட்ச் தரவுகளில் சூரிய தோன்றுகை, சூரிய மறைவு, மூன்ரைச், மூன்செட் ஆகியவற்றை சேர்க்கப்பட்டது * பிழைத்திருத்தம்: பன்னாட்டு டேட்லைன் பிழை * வலைபெயர்ப்பு வழியாக ச்பானிச் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் கேலெகோனோவாடோ) * வலைபெயர்ப்பு வழியாக செர்மன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @KYTTA) * வலைபெயர்ப்பு வழியாக ரச்ய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @KYTTA) * வலைபெயர்ப்பு வழியாக காலிசியன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @xcomesana) * வலைபெயர்ப்பு வழியாக கிரேக்க மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @stavpup) * வலைபெயர்ப்பு வழியாக போர்த்துகீசிய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @மிச்டர்கோச்டா 96) * வலைபெயர்ப்பு வழியாக பிரஞ்சு மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @fauust)

# changelogs/85.txt:1
source: * Added Sun and Moon optional card * Added radar image retry * Bugfix: Crash when removing weather card type * Portugese Translation Updates via Weblate (Credit @MisterCosta96) * French Translation Updates via Weblate (Credit @fauust) * Polish Translation Updates via Weblate (Credit @extrm1991) * Galician Translation Updates via Weblate (Credit @xcomesana) * Spanish Translation Updates via Weblate (Credit gallegonovato) * Basque Translation Updates via Weblate (Credit Alexander Gabilondo) * Dutch Translation Updates via Weblate (Credit @5mikachu)
ta: * சூரியன் மற்றும் சந்திரன் விருப்ப அட்டை சேர்க்கப்பட்டது * சேர்க்கப்பட்ட ரேடார் பட மறுசீரமைப்பு * பிழைத்திருத்தம்: வானிலை அட்டை வகையை அகற்றும்போது செயலிழப்பு * வலைபெயர்ப்பு வழியாக போர்த்துகீசிய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @மிச்டர்கோச்டா 96) * வலைபெயர்ப்பு வழியாக பிரஞ்சு மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @fauust) * வலைபெயர்ப்பு வழியாக போலந்து மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @extm1991) * வலைபெயர்ப்பு வழியாக காலிசியன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @xcomesana) * வலைபெயர்ப்பு வழியாக ச்பானிச் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் கேலெகோனோவாடோ) * வலைபெயர்ப்பு வழியாக பாச்க் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் அலெக்சாண்டர் கபிலோண்டோ) * வலைபெயர்ப்பு வழியாக டச்சு மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @5 மிகாச்சு)

# changelogs/86.txt:1
source: * Bugfix: Loop during initialization * Portugese Translation Updates via Weblate (Credit @MisterCosta96) * Galician Translation Updates via Weblate (Credit @xcomesana) * Spanish Translation Updates via Weblate (Credit gallegonovato) * Polish Translation Updates via Weblate (Credit @extrm1991)
ta: * பிழைத்திருத்தம்: துவக்கத்தின் போது லூப் * வலைபெயர்ப்பு வழியாக போர்த்துகீசிய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @மிச்டர்கோச்டா 96) * வலைபெயர்ப்பு வழியாக காலிசியன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @xcomesana) * வலைபெயர்ப்பு வழியாக ச்பானிச் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் கேலெகோனோவாடோ) * வலைபெயர்ப்பு வழியாக போலந்து மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @extm1991)

# changelogs/87.txt:1
source: * Bugfix: Progress arrows not appearing during initialization * Portugese Translation Updates via Weblate (Credit @MisterCosta96) * Galician Translation Updates via Weblate (Credit @xcomesana) * Tamazight (Standard Moroccan) Translation Updates via Weblate (Credit @zouhirdehbi)
ta: * பிழைத்திருத்தம்: துவக்கத்தின் போது முன்னேற்ற அம்புகள் தோன்றவில்லை * வலைபெயர்ப்பு வழியாக போர்த்துகீசிய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @மிச்டர்கோச்டா 96) * வலைபெயர்ப்பு வழியாக காலிசியன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @xcomesana) * தமாசைட் (நிலையான மொராக்கோ) மொழிபெயர்ப்பு புதுப்பிப்புகள் வலைபெயர்ப்பு வழியாக (கிரெடிட் @zouhirdehbi)

# changelogs/88.txt:1
source: * Bugfix: Progress arrows not appearing during initialization * Bugfix: Crash when loading radar * Portugese Translation Updates via Weblate (Credit @MisterCosta96) * Galician Translation Updates via Weblate (Credit @xcomesana)
ta: * பிழைத்திருத்தம்: துவக்கத்தின் போது முன்னேற்ற அம்புகள் தோன்றவில்லை * பிழைத்திருத்தம்: ரேடார் ஏற்றும்போது செயலிழப்பு * வலைபெயர்ப்பு வழியாக போர்த்துகீசிய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @மிச்டர்கோச்டா 96) * வலைபெயர்ப்பு வழியாக காலிசியன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @xcomesana)

# changelogs/89.txt:1
source: * Bugfix: Fix for certificate errors on Android 7 and earlier using Open-Meteo * Bugfix: Crash when loading radar
ta: * பிழைத்திருத்தம்: திறந்த-மெட்டியோவைப் பயன்படுத்தி ஆண்ட்ராய்டு 7 மற்றும் அதற்கு முந்தைய சான்றிதழ் பிழைகளை சரிசெய்யவும் * பிழைத்திருத்தம்: ரேடார் ஏற்றும்போது செயலிழப்பு

# changelogs/90.txt:1
source: * OpenWeatherMap will be closing the "One Call 2.5" API in June 2024. QuickWeather users who wish to use OpenWeatherMap should use an API key with access to "One Call 3.0" via the "One Call by Call" subscription. Users may continue to use API keys with "One Call 2.5" until OpenWeatherMap closes the API. * Added ft/s and Beaufort wind units * Bugfix: Incorrectly showing Open-Meteo surface pressure instead of sealevel pressure * Tamazight (Standard Moroccan) Translation Updates via Weblate (Credit @zouhirdehbi) * Greek Translation Updates via Weblate (Credit @stavpup) * German Translation Updates via Weblate (Credit @stavpup) * Portugese Translation Updates via Weblate (Credit @MisterCosta96) * Galician Translation Updates via Weblate (Credit @xcomesana) * Spanish Translation Updates via Weblate (Credit gallegonovato)
ta: * ஓபன் டர்மேப் சூன் 2024 இல் "ஒரு அழைப்பு 2.5" பநிஇ மூடப்படும். ஓபன்வெதர்மேப்பைப் பயன்படுத்த விரும்பும் குயிக்வெதர் பயனர்கள் "ஒரு அழைப்பு 3.0" வழியாக "ஒரு அழைப்பு மூலம் அழைப்பு" சந்தா வழியாக அணுகலுடன் பநிஇ விசையைப் பயன்படுத்த வேண்டும். திறந்தநாலையான பநிஇ ஐ மூடும் வரை பயனர்கள் "ஒரு அழைப்பு 2.5" உடன் பநிஇ விசைகளை தொடர்ந்து பயன்படுத்தலாம். * Ft/s மற்றும் பியூஃபோர்ட் காற்று அலகுகள் சேர்க்கப்பட்டன * பிழைத்திருத்தம்: சீலெவல் அழுத்தத்திற்கு பதிலாக திறந்த-மெட்டியோ மேற்பரப்பு அழுத்தத்தை தவறாகக் காட்டுகிறது * தமாசைட் (நிலையான மொராக்கோ) மொழிபெயர்ப்பு புதுப்பிப்புகள் வலைபெயர்ப்பு வழியாக (கிரெடிட் @zouhirdehbi) * வலைபெயர்ப்பு வழியாக கிரேக்க மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @stavpup) * வலைபெயர்ப்பு வழியாக செர்மன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @stavpup) * வலைபெயர்ப்பு வழியாக போர்த்துகீசிய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @மிச்டர்கோச்டா 96) * வலைபெயர்ப்பு வழியாக காலிசியன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @xcomesana) * வலைபெயர்ப்பு வழியாக ச்பானிச் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் கேலெகோனோவாடோ)

# changelogs/91.txt:1
source: * Added weather forecast "as of" date * Added a loading indicator to the radar * Radar time label is now shown when animation is running * Bugfix: Fix for background service not starting after boot on some devices * Bugfix: Fix for some text being cut off on devices with large fonts * Bugfix: Possible fix for current weather notification layout issues * Hebrew Translation Updates via Weblate (Credit Anonymous) * Spanish Translation Updates via Weblate (Credit gallegonovato) * Basque Translation Updates via Weblate (Credit Alexander Gabilondo) * Galician Translation Updates via Weblate (Credit @xcomesana) * Greek Translation Updates via Weblate (Credit @stavpup) * Polish Translation Updates via Weblate (Credit @extrm1991) * Portugese Translation Updates via Weblate (Credit @MisterCosta96) * Dutch Translation Updates via Weblate (Credit @arjan-s)
ta: * தேதியின்படி வானிலை முன்னறிவிப்பு "சேர்க்கப்பட்டது * ரேடாரில் ஏற்றுதல் காட்டி சேர்த்தது * அனிமேசன் இயங்கும்போது ரேடார் நேர சிட்டை இப்போது காட்டப்பட்டுள்ளது * பிழைத்திருத்தம்: சில சாதனங்களில் துவக்கத்திற்குப் பிறகு பின்னணி சேவையை சரிசெய்யவும் * பிழைத்திருத்தம்: பெரிய எழுத்துருக்கள் கொண்ட சாதனங்களில் சில உரையை துண்டிக்க சரிசெய்யவும் * பிழைத்திருத்தம்: தற்போதைய வானிலை அறிவிப்பு தளவமைப்பு சிக்கல்களுக்கு சாத்தியமான பிழைத்திருத்தம் * வலைபெயர்ப்பு வழியாக எபிரேய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கடன் அநாமதேய) * வலைபெயர்ப்பு வழியாக ச்பானிச் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் கேலெகோனோவாடோ) * வலைபெயர்ப்பு வழியாக பாச்க் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் அலெக்சாண்டர் கபிலோண்டோ) * வலைபெயர்ப்பு வழியாக காலிசியன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @xcomesana) * வலைபெயர்ப்பு வழியாக கிரேக்க மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @stavpup) * வலைபெயர்ப்பு வழியாக போலந்து மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @extm1991) * வலைபெயர்ப்பு வழியாக போர்த்துகீசிய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @மிச்டர்கோச்டா 96) * வலைபெயர்ப்பு வழியாக டச்சு மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @அர்சன்-எச்)

# changelogs/93.txt:1
source: * Added File Weather Cache * Bugfix: Fixed In-Memory Weather Cache * Bugfix: Fixed weather alerts dialogs opening repeatedly * Portugese Translation Updates via Weblate (Credit @MisterCosta96) * Spanish Translation Updates via Weblate (Credit gallegonovato)
ta: * கோப்பு வானிலை தற்காலிக சேமிப்பு சேர்க்கப்பட்டது * பிழைத்திருத்தம்: நினைவக வானிலை தற்காலிக சேமிப்பு சரி * பிழைத்திருத்தம்: நிலையான வானிலை எச்சரிக்கைகள் உரையாடல்கள் மீண்டும் மீண்டும் திறக்கப்படுகின்றன * வலைபெயர்ப்பு வழியாக போர்த்துகீசிய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @மிச்டர்கோச்டா 96) * வலைபெயர்ப்பு வழியாக ச்பானிச் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் கேலெகோனோவாடோ)

# changelogs/94.txt:1
source: * Bugfix: Fixed graph not showing 3-hour temperature and precipitation data
ta: * பிழைத்திருத்தம்: நிலையான வரைபடம் 3 மணி நேர வெப்பநிலை மற்றும் மழைப்பொழிவு தரவைக் காட்டவில்லை

# changelogs/95.txt:1
source: * Bugfix: Fixed graph not showing 3-hour temperature and precipitation data * Finnish Translation via Weblate (Credit @huuhaa) * Spanish Translation Updates via Weblate (Credit gallegonovato)
ta: * பிழைத்திருத்தம்: நிலையான வரைபடம் 3 மணி நேர வெப்பநிலை மற்றும் மழைப்பொழிவு தரவைக் காட்டவில்லை * வலைபெயர்ப்பு வழியாக பின்னிச் மொழிபெயர்ப்பு (கிரெடிட் @உஆ) * வலைபெயர்ப்பு வழியாக ச்பானிச் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் கேலெகோனோவாடோ)

# changelogs/98.txt:1
source: * Added weather alert translation via LibreTranslate to advanced settings * Bugfix: Tsunami test alerts hidden * Bugfix: Fixed dew point and wind speed descriptions in current weather * Spanish Translation Updates via Weblate (Credit @franciscot and gallegonovato) * French Translation Updates via Weblate (Credit Said Senoussi) * German Translation Updates via Weblate (Credit @amarradi and @franconian)
ta: * மேம்பட்ட அமைப்புகளுக்கு லிப்ரட்ரான்ச்லேட் வழியாக வானிலை எச்சரிக்கை மொழிபெயர்ப்பு சேர்க்கப்பட்டது * பிழைத்திருத்தம்: சுனாமி சோதனை விழிப்பூட்டல்கள் மறைக்கப்பட்டுள்ளன * பிழைத்திருத்தம்: தற்போதைய வானிலையில் நிலையான பனி புள்ளி மற்றும் காற்றின் வேக விளக்கங்கள் * வலைபெயர்ப்பு வழியாக ச்பானிச் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @ஃபிரான்சிச்காட் மற்றும் கேலெகோனோவாடோ) * வலைபெயர்ப்பு வழியாக பிரெஞ்சு மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் செனோசி கூறினார்) * வலைபெயர்ப்பு வழியாக செர்மன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @amarradi மற்றும் @franconian)
