Repository: 247i/TACETr
Catalog: உரை/தானி/quickweather-quickweather-fastlane-*.po
Languages: ta

# short_description.txt:1
source: Weather at a glance for anywhere in the world!
ta: உலகில் எங்கும் ஒரு பார்வையில் வானிலை!

# full_description.txt:1
source: QuickWeather is really fast. Just open the app and see the weather right now. There's no loading screen and no wait time. The weather is delivered to you with no extra junk, just clean and clear information. You can add as many locations to the side drawer as you want to have their weather a single tap away. QuickWeather can even determine your current location if you allow it (location information is not collected). QuickWeather is Always Free (No IAPs or Ads) and Always Open Source Here's what you get <ul><li>Fullscreen Radar</li><li>Current Weather, Temperature, "Feels Like" Temperature, Precipitation, Wind Speed, Humidity, Pressure, Dew Point, Visbility</li><li>Current and Forecast Temperature and Precipitation Graph</li><li>Current Weather Notification</li><li>Weather Alert Notifications</li><li>Hourly Temperature and Precipitation (48 hours)</li><li>3-Hour Temperature and Precipitation (5 days)</li><li>Daily Forecast Weather and High and Low Temperature (7 days)</li><li>Daily UV Index</li></ul> QuickWeather is powered by <a href="https://openweathermap.org/">OpenWeatherMap.org</a> or <a href="https://open-meteo.com/">Open-Meteo</a>. <ul><li>If using OpenWeatherMap, QuickWeather requires an active API key with the "One Call by Call" subscription to the "One Call 3.0" API to function. If you do not have one, you can sign up for a free API key <a href="https://home.openweathermap.org/subscriptions/unauth_subscribe/onecall_30/base">here</a>.</li><li>If using Open-Meteo, QuickWeather does not require an API key.</li></ul> Required Permissions <ul><li><b>Internet</b> - Required to connect to the internet and retrieve weather information</li></ul> Optional Permissions <ul><li><b>Location</b> - Required to retrieve the user's current location, if requested</li><li><b>Background Location</b> - Required to retrieve the user's current location for weather notification and alerts, if requested</li><li><b>Receive Boot Completed</b> - Required to reschedule the notification service each boot</li></ul>
ta: குயிக்வெதர் உண்மையில் வேகமாக உள்ளது. பயன்பாட்டைத் திறந்து இப்போது வானிலை பாருங்கள். ஏற்றுதல் திரை இல்லை, காத்திருப்பு நேரம் இல்லை. கூடுதல் குப்பை, தூய்மையான மற்றும் தெளிவான தகவல்கள் இல்லாமல் வானிலை உங்களுக்கு வழங்கப்படுகிறது. நீங்கள் அவர்களின் வானிலை ஒரு தட்டையாக இருக்க விரும்புவதால், பக்க அலமாரியில் பல இடங்களைச் சேர்க்கலாம். உங்கள் தற்போதைய இருப்பிடத்தை நீங்கள் அனுமதித்தால் குயிக்வெதர் கூட தீர்மானிக்க முடியும் (இருப்பிட செய்தி சேகரிக்கப்படவில்லை). குவிக்வெதர் எப்போதும் இலவசம் (IAPS அல்லது விளம்பரங்கள் இல்லை) மற்றும் எப்போதும் திறந்த மூல இங்கே நீங்கள் பெறுவது இப்போது மற்றும் மழைப்பொழிவு வரைபடம் </li> <li> தற்போதைய வானிலை அறிவிப்பு </li> <li> வானிலை எச்சரிக்கை அறிவிப்புகள் </li> <li> மணிநேர வெப்பநிலை மற்றும் மழைப்பொழிவு (48 மணிநேரம்) </li> <li> 3-மணி நேர வெப்பநிலை மற்றும் மழைப்பொழிவு (5 நாட்கள்) </li> <li> நாள்தோறும் முன்னறிவிப்பு வானிலை மற்றும் உயர் மற்றும் குறைந்த வெப்பநிலை (7 நாட்கள்) </li> <li> நாள்தோறும் புற ஊதா குறியீடு </li> </ul> குவிக்வெதர் <a href = "https://openweathermap.org/"> openweathermap.org </a> அல்லது <a href = "https://open-meteo.com/"> திறந்த-மெட்டியோ </a ஆல் இயக்கப்படுகிறது >. <ul> <li> OpenWeatherMap ஐப் பயன்படுத்தினால், Quickweather "ஒரு அழைப்பு" என்ற சந்தாவை "ஒரு அழைப்பு 3.0" பநிஇ க்கு செயல்பட வேண்டும். உங்களிடம் ஒன்று இல்லையென்றால், நீங்கள் ஒரு இலவச பநிஇ விசையில் பதிவு செய்யலாம் <a href = "https://home.openweathermap.org/subscriptions/unauth_subscribe/onecall_30/base"> இங்கே </a>. </Li> <li> திறந்த-மெட்டியோவைப் பயன்படுத்தினால், குவிக்வெதருக்கு பநிஇ விசை தேவையில்லை. </li> </ul> தேவையான அனுமதிகள் <ul> <li> <b> இணையம் </b> - இணையத்துடன் இணைக்கவும் வானிலை தகவல்களை மீட்டெடுக்கவும் தேவை </li> </ul> விருப்ப அனுமதிகள் இப்போது வானிலை அறிவிப்பு மற்றும் விழிப்பூட்டல்கள், கோரப்பட்டால் </li> <li> <b> துவக்கத்தைப் பெறுங்கள் </b> - ஒவ்வொரு துவக்கத்தையும் அறிவிப்பு சேவையை மாற்றியமைக்க வேண்டும் </li> </ul>

# changelogs/101.txt:1
source: * Bugfix: Fixed some dialogs closing instead of showing an error message * Bugfix: Fixed app toolbar being shown under status bar in Android 15
ta: * பிழைத்திருத்தம்: பிழை செய்தியைக் காண்பிப்பதற்குப் பதிலாக சில உரையாடல்கள் மூடப்படுகின்றன * பிழைத்திருத்தம்: ஆண்ட்ராய்டு 15 இல் நிலை பட்டியின் கீழ் நிலையான பயன்பாட்டு கருவிப்பட்டி காண்பிக்கப்படுகிறது

# changelogs/102.txt:1
source: * Bugfix: Fixed dialog button being hidden on some devices
ta: * பிழைத்திருத்தம்: சில சாதனங்களில் நிலையான உரையாடல் பொத்தானை மறைக்கவும்

# changelogs/27.txt:1
source: * Fullscreen Radar * Multi-column landscape mode * F-Droid Support * Background service more stable * Additional Minor Bugfixes
ta: * முழுத்திரை ரேடார் * பல நெடுவரிசை இயற்கை பயன்முறை * எஃப்-டிராய்டு உதவி * பின்னணி பணி மிகவும் நிலையானது * கூடுதல் சிறிய பிழைகள்

# changelogs/28.txt:1
source: * Bugfix: Crash on certain devices with certain browsers to due Custom Tabs * Library Updates
ta: * பிழை திருத்தம்: தனிப்பயன் தாவல்களைச் செய்ய சில உலாவிகளுடன் சில சாதனங்களில் செயலிழக்கச் செய்யுங்கள் * நூலக புதுப்பிப்புகள்

# changelogs/29.txt:1
source: * Added Manual Location Entry * Time Format Respects Device Settings * Library Updates * Updated Descriptions
ta: * கையேடு இருப்பிட நுழைவு சேர்க்கப்பட்டது * நேர வடிவம் சாதன அமைப்புகளை மதிக்கிறது * நூலக புதுப்பிப்புகள் * புதுப்பிக்கப்பட்ட விளக்கங்கள்

# changelogs/30.txt:1
source: * Added Ability to Edit Locations * Added Ability to open "geo" URIs and add that location * Bugfix: Back Button not closing app * Bugfix: Clicking Alert notifications not always opening the alert
ta: * இருப்பிடங்களைத் திருத்தும் திறன் சேர்க்கப்பட்டது * "சியோ" யுஆர்ஐக்களைத் திறந்து அந்த இடத்தைச் சேர்க்கும் திறன் சேர்க்கப்பட்டது * பிழைத்திருத்தம்: பின் பொத்தான் பயன்பாட்டை மூடவில்லை * பிழைத்திருத்தம்: எச்சரிக்கை அறிவிப்புகள் எப்போதும் எச்சரிக்கையைத் திறக்காது என்பதைக் சொடுக்கு செய்க

# changelogs/31.txt:1
source: * Bugfix: Resolved compatibility issue with Android library and Android 12
ta: * பிழைத்திருத்தம்: ஆண்ட்ராய்டு நூலகம் மற்றும் ஆண்ட்ராய்டு 12 உடன் பொருந்தக்கூடிய சிக்கல் தீர்க்கப்பட்டது

# changelogs/33.txt:1
source: * Detailed Daily Forecast with Chance of Precipitation * Additional Weather Icons * Additional Weather details * Simplified and Optimized Processes * Removed legacy weather provider * Faster Process to obtain Current Location * Added warning that new OpenWeatherMap API Keys may take up to a few hours to activate * Bugfix: Onboarding Welcome page not scrolling * Bugfix: Radar time respects system time format
ta: * மழைக்கான வாய்ப்புடன் விரிவான நாள்தோறும் முன்னறிவிப்பு * கூடுதல் வானிலை சின்னங்கள் * கூடுதல் வானிலை விவரங்கள் * எளிமைப்படுத்தப்பட்ட மற்றும் உகந்த செயல்முறைகள் * அகற்றப்பட்ட மரபு வானிலை வழங்குநர் * தற்போதைய இருப்பிடத்தைப் பெறுவதற்கான விரைவான செயல்முறை * புதிய OpenWeatherMap பநிஇ விசைகள் செயல்படுத்த சில மணிநேரம் வரை ஆகலாம் என்ற எச்சரிக்கை கூடுதல் * பிழைத்திருத்தம்: ஆன் போர்டிங் வரவேற்பு பக்கம் ச்க்ரோலிங் அல்ல * பிழைத்திருத்தம்: ரேடார் நேரம் கணினி நேர வடிவமைப்பை மதிக்கிறது

# changelogs/35.txt:1
source: * Using System Accent Color in Android 12 * Settings automatically update when changes are made, instead of when "Finish" is pressed * Bugfix: Error message incorrectly was shown if user allows coarse location access in Android 12 * Bugfix: Settings app did not update day/night properly * Bugfix: Ensured location is only accessed in the background when "Current Location" is selected
ta: * ஆண்ட்ராய்டு 12 இல் கணினி உச்சரிப்பு வண்ணத்தைப் பயன்படுத்துதல் * "பூச்சு" அழுத்தப்படுவதற்கு பதிலாக, மாற்றங்கள் செய்யப்படும்போது அமைப்புகள் தானாகவே புதுப்பிக்கப்படுகின்றன * பிழைத்திருத்தம்: ஆண்ட்ராய்டு 12 இல் கரடுமுரடான இருப்பிட அணுகலை பயனர் அனுமதித்தால் பிழை செய்தி தவறாக காட்டப்பட்டது * பிழைத்திருத்தம்: அமைப்புகள் பயன்பாடு பகல்/இரவு சரியாக புதுப்பிக்கவில்லை * பிழைத்திருத்தம்: "தற்போதைய இருப்பிடம்" தேர்ந்தெடுக்கப்படும்போது மட்டுமே இருப்பிடம் பின்னணியில் மட்டுமே அணுகப்படுகிறது

# changelogs/37.txt:1
source: * Bugfix: Alerts repeatedly notifying users * Bugfix: Frequent background job errors * Added "What's New" with information from GitHub * Added "Report a Bug" via the GitHub issue tracker * Library Updates
ta: * பிழைத்திருத்தம்: எச்சரிக்கைகள் பயனர்களுக்கு மீண்டும் மீண்டும் அறிவிக்கின்றன * பிழைத்திருத்தம்: அடிக்கடி பின்னணி வேலை பிழைகள் * கிட்அப்பின் தகவலுடன் "புதியது என்ன" சேர்க்கப்பட்டது * அறிவிலிமையம் வெளியீடு டிராக்கர் வழியாக "ஒரு பிழையைப் புகாரளிக்கவும்" சேர்க்கப்பட்டது * நூலக புதுப்பிப்புகள்

# changelogs/38.txt:1
source: * Check for new version * Full Backup and Restore Support * Added wind speed unit "knot" (Credit: @GitKalle) * Bugfix: Notifications shown for alerts already seen * Bugfix: Fixed location list sometimes having two "Current Locations" * Bugfix: Cannot remove location or edit location
ta: * புதிய பதிப்பை சரிபார்க்கவும் * முழு காப்புப்பிரதி மற்றும் ஆதரவை மீட்டமை * காற்றின் வேக அலகு "முடிச்சு" (கடன்: @gitkalle) சேர்க்கப்பட்டது * பிழைத்திருத்தம்: ஏற்கனவே காணப்பட்ட விழிப்பூட்டல்களுக்கு காட்டப்பட்டுள்ள அறிவிப்புகள் * பிழைத்திருத்தம்: நிலையான இருப்பிட பட்டியல் சில நேரங்களில் இரண்டு "தற்போதைய இடங்களைக் கொண்டது" * பிழைத்திருத்தம்: இருப்பிடத்தை அகற்றவோ அல்லது இருப்பிடத்தைத் திருத்தவோ முடியாது

# changelogs/40.txt:1
source: * Memory Optimization * Additional Error Logging * German Translation (Credit @ktutsch) * Bugfix: Crash when creating a location manually for languages using commas as decimal separator
ta: * நினைவக தேர்வுமுறை * கூடுதல் பிழை பதிவு * செர்மன் மொழிபெயர்ப்பு (கிரெடிட் @ktutsch) .

# changelogs/44.txt:1
source: * Renamed "Current Location" to "My Location" and added an indicator icon * Added an indicator and error message to the Other Location "Search" option * Added an option for users to add their current location as a new location * Added an option for users to add locations from a map * Bugfix: Spaces are ignored in API keys * Minor optimizations throughout the app
ta: * "தற்போதைய இருப்பிடம்" என்று "எனது இருப்பிடம்" என்று மறுபெயரிட்டு ஒரு காட்டி ஐகானைச் சேர்த்தது * மற்ற இடத்திற்கு "தேடல்" விருப்பத்திற்கு ஒரு காட்டி மற்றும் பிழை செய்தியைச் சேர்த்தது * பயனர்கள் தங்கள் தற்போதைய இருப்பிடத்தை புதிய இருப்பிடமாக சேர்க்க ஒரு விருப்பத்தைச் சேர்த்துள்ளனர் * பயனர்கள் ஒரு வரைபடத்திலிருந்து இருப்பிடங்களைச் சேர்க்க ஒரு விருப்பத்தைச் சேர்த்துள்ளனர் * பிழைத்திருத்த: பநிஇ விசைகளில் இடைவெளிகள் புறக்கணிக்கப்படுகின்றன * பயன்பாடு முழுவதும் சிறிய மேம்படுத்தல்கள்

# changelogs/45.txt:1
source: * Support for Android 13 * Fixed bug "Graph sometimes not intelligible" * Added monochrome app icon for Android 13
ta: * ஆண்ட்ராய்டு 13 க்கான உதவி * நிலையான பிழை "வரைபடம் சில நேரங்களில் புரியாது" * ஆண்ட்ராய்டு 13 க்கான ஒரே வண்ணமுடைய பயன்பாட்டு படவுரு சேர்க்கப்பட்டது

# changelogs/46.txt:1
source: * Bugfix: Support for OpenWeatherMap OneCall API 3.0
ta: * பிழைத்திருத்தம்: OpenWeatherMap Onecall பநிஇ 3.0 க்கான உதவி

# changelogs/47.txt:1
source: * Added "Feels Like" temperature * Added Visibility distance * Accessibility: Better contrast for links and dialog buttons * Accessibility: Better TalkBack and content descriptions * Bugfix: crash in Settings * Bugfix: App not responding when checking for new versions
ta: * சேர்க்கப்பட்டது "உணர்கிறது" வெப்பநிலை * தெரிவுநிலை தூரம் சேர்க்கப்பட்டது * அணுகல்: இணைப்புகள் மற்றும் உரையாடல் பொத்தான்களுக்கு சிறந்த மாறுபாடு * அணுகல்: சிறந்த பேச்சு மற்றும் உள்ளடக்க விளக்கங்கள் * பிழைத்திருத்தம்: அமைப்புகளில் செயலிழப்பு * பிழைத்திருத்தம்: புதிய பதிப்புகளைச் சரிபார்க்கும்போது பயன்பாடு பதிலளிக்கவில்லை

# changelogs/48.txt:1
source: * Added Gadgetbridge support * Added predictive back gesture for Android 13 * Bugfix: Additional crashes in settings
ta: * கேசெட் பிரிட்ச் உதவி சேர்க்கப்பட்டது * ஆண்ட்ராய்டு 13 க்கான முன்கணிப்பு பின் சைகை சேர்க்கப்பட்டது * பிழைத்திருத்தம்: அமைப்புகளில் கூடுதல் செயலிழப்புகள்

# changelogs/49.txt:1
source: * Bugfix: Gadgetbridge should update in the background even without notifications enabled
ta: * Bugfix: அறிவிப்புகள் இல்லாமல் கூட கேசெட் பிரிட்ச் பின்னணியில் புதுப்பிக்க வேண்டும்

# changelogs/51.txt:1
source: * Gadgetbridge: Support for all build variants * Gadgetbridge: More accurate temperatures * Bugfix: Fixed crash in settings
ta: * கேசெட் பிரிட்ச்: அனைத்து உருவாக்க வகைகளுக்கும் உதவி * கேசெட் பிரிட்ச்: மிகவும் துல்லியமான வெப்பநிலை * பிழைத்திருத்தம்: அமைப்புகளில் நிலையான செயலிழப்பு

# changelogs/52.txt:1
source: * Bugfix: Cannot enter commas in "Edit Location" Dialog * Bugfix: Crash if no locations are selected * Bugfix: Difficulty scrolling through locations in settings if there are many locations
ta: * Bugfix: "இருப்பிடத்தைத் திருத்து" உரையாடலில் காற்புள்ளியை உள்ளிட முடியாது * பிழைத்திருத்தம்: இடங்கள் எதுவும் தேர்ந்தெடுக்கப்படாவிட்டால் செயலிழப்பு * பிழைத்திருத்தம்: பல இடங்கள் இருந்தால் அமைப்புகளில் இருப்பிடங்கள் வழியாக உருட்டுவதில் தொல்லை

# changelogs/55.txt:1
source: * New radar map renderer using MapLibre instead of a WebView * In Settings, changing the theme automatically updates the application theme * Location name format localization
ta: * வெப்வியூவுக்கு பதிலாக Maplibre ஐப் பயன்படுத்தி புதிய ரேடார் வரைபட ரெண்டரர் * அமைப்புகளில், கருப்பொருளை மாற்றுவது தானாகவே பயன்பாட்டு கருப்பொருளைப் புதுப்பிக்கிறது * இருப்பிட பெயர் வடிவமைப்பு உள்ளூராக்கல்

# changelogs/56.txt:1
source: * Bugfix: Radar not loading
ta: * பிழைத்திருத்தம்: ரேடார் ஏற்றப்படவில்லை

# changelogs/57.txt:1
source: * Bugfix: Crash in settings * Bugfix: Crash when clicking radar attribution * Bugfix: Crash when refreshing radar
ta: * பிழைத்திருத்தம்: அமைப்புகளில் செயலிழப்பு * பிழைத்திருத்தம்: ரேடார் பண்புக்கூறு சொடுக்கு செய்யும் போது செயலிழப்பு * பிழைத்திருத்தம்: ரேடார் புத்துணர்ச்சியூட்டும் போது செயலிழப்பு

# changelogs/58.txt:1
source: * Added UV Index and Percent Change of Precipitation to Gadgetbridge integration (Credit: @arjan-s) * Bugfix: Windspeed was send to Gadgetbridge in the incorrect unit
ta: * புற ஊதா குறியீடு மற்றும் கேசெட் பிரிட்ச் ஒருங்கிணைப்புக்கு மழைப்பொழிவின் சதவீத மாற்றம் (கடன்: @அர்சன்-எச்) * பிழைத்திருத்தம்: தவறான பிரிவில் கேசெட் பிரிட்சுக்கு விண்ட்ச்பீட் அனுப்பப்பட்டது

# changelogs/60.txt:1
source: * Added an additional high temperature color * Added Translations via Weblate * Bugfix: Fixed Monochrome icon for themed app icons
ta: * கூடுதல் உயர் வெப்பநிலை நிறத்தை சேர்த்தது * வலைபெயர்ப்பு வழியாக மொழிபெயர்ப்புகளைச் சேர்த்தது * பிழைத்திருத்தம்: கருப்பொருள் பயன்பாட்டு ஐகான்களுக்கான நிலையான மோனோக்ரோம் படவுரு

# changelogs/61.txt:1
source: * Edit Location link from navigation menu * Norwegian Translation via Weblate (Credit @comradekingu) * Portugese Translation via Weblate (Credit @pedro-32) * French Translation via Weblate (Credit Paul Collignan) * Bugfix: Fix for background job stopping
ta: * வழிசெலுத்தல் மெனுவிலிருந்து இருப்பிட இணைப்பைத் திருத்தவும் * வலைபெயர்ப்பு வழியாக நோர்வே மொழிபெயர்ப்பு (கிரெடிட் @comradekingu) * வலைபெயர்ப்பு வழியாக போர்த்துகீசிய மொழிபெயர்ப்பு (கிரெடிட் @பருத்தித்துறை -32) * வலைபெயர்ப்பு வழியாக பிரஞ்சு மொழிபெயர்ப்பு (கிரெடிட் பால் கொலிக்னன்) * பிழைத்திருத்தம்: பின்னணி வேலை நிறுத்தப்படுவதை சரிசெய்யவும்

# changelogs/62.txt:1
source: * German Translation Update via Weblate (Credit @franconian) * Radar navigation controls can be hidden by tapping the map * Radar performance improvements and style tweaks
ta: * வலைபெயர்ப்பு வழியாக செர்மன் மொழிபெயர்ப்பு புதுப்பிப்பு (கிரெடிட் @ஃபிராங்கோனியன்) * வரைபடத்தைத் தட்டுவதன் மூலம் ரேடார் வழிசெலுத்தல் கட்டுப்பாடுகளை மறைக்க முடியும் * ரேடார் செயல்திறன் மேம்பாடுகள் மற்றும் பாணி மாற்றங்கள்

# changelogs/64.txt:1
source: - Added Advanced Settings - Added App Language Settings to Advanced Settings - Added Radar Image Quality to Advanced Settings - Daily and Hourly Weather detail cards can now scroll horizontally - Added Chinese (simplified) (Credit: @aerowolf) - Radar begins loading much faster
ta: - மேம்பட்ட அமைப்புகள் சேர்க்கப்பட்டன - மேம்பட்ட அமைப்புகளில் பயன்பாட்டு மொழி அமைப்புகளைச் சேர்த்தது - மேம்பட்ட அமைப்புகளில் ரேடார் பட தகுதி சேர்க்கப்பட்டது - நாள்தோறும் மற்றும் மணிநேர வானிலை விவரம் அட்டைகள் இப்போது கிடைமட்டமாக உருட்டலாம் - சீனச் சேர்க்கப்பட்டது (எளிமைப்படுத்தப்பட்ட) (கடன்: @aerowolf) - ராடார் மிக வேகமாக ஏற்றத் தொடங்குகிறது

# changelogs/65.txt:1
source: - Temperature and precipitation graph is now scrollable and has 48 hours of data - Entire current and forecast weather description is available, instead of just 2 lines - Bugfix: offcenter thermometer icon in temperature and precipitation graph
ta: - வெப்பநிலை மற்றும் மழைப்பொழிவு வரைபடம் இப்போது உருட்டக்கூடியது மற்றும் 48 மணிநேர தரவு உள்ளது - முழு தற்போதைய மற்றும் முன்னறிவிப்பு வானிலை விளக்கம் வெறும் 2 வரிகளுக்கு பதிலாக கிடைக்கிறது - பிழைத்திருத்தம்: வெப்பநிலை மற்றும் மழைப்பொழிவு வரைபடத்தில் ஆஃப் சென்டர் தெர்மோமீட்டர் படவுரு

# changelogs/66.txt:1
source: * Gadgetbridge API updated to WeatherSpec v4 (Credit @joserebelo) * German Translation Updates (Credit @franconian) * Polish Translation (Credit @extrm1991)
ta: * கேசெட் பிரிட்ச் பநிஇ வெதர்ச்பெக் வி 4 க்கு புதுப்பிக்கப்பட்டது (கிரெடிட் @சோசரெபெலோ) * செர்மன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @ஃபிராங்கோனியன்) * போலந்து மொழிபெயர்ப்பு (கிரெடிட் @extm1991)

# changelogs/69.txt:1
source: * Support for Open-Meteo weather provider
ta: * திறந்த-மெட்டியோ வானிலை வழங்குநருக்கு உதவி

# changelogs/70.txt:1
source: * Support for Open-Meteo weather provider * Support for Android API 34 * Bugfix: Crash caused by Divide By Zero * Bugfix: Gadgetbridge hourly data not showing the full 48 hours (Credit @joserebelo)
ta: * திறந்த-மெட்டியோ வானிலை வழங்குநருக்கு உதவி * ஆண்ட்ராய்டு பநிஇ 34 க்கான உதவி * பிழைத்திருத்தம்: பூச்சியத்தால் வகுக்கப்படுவதால் ஏற்படும் செயலிழப்பு * பிழைத்திருத்தம்: கேசெட் பிரிட்ச் மணிநேர தரவு முழு 48 மணிநேரங்களைக் காட்டவில்லை (கிரெடிட் @சோசரெபெலோ)

# changelogs/71.txt:1
source: * Localized Time Formats * Bugfix: Open-Meteo Gadgetbridge weather icons * German Translation Updates via Weblate (Credit @franconian) * French Translation Updates via Weblate (Credit Paul Collignan)
ta: * உள்ளூர்மயமாக்கப்பட்ட நேர வடிவங்கள் * பிழைத்திருத்தம்: திறந்த-மெட்டியோ கேசெட் பிரிட்ச் வானிலை சின்னங்கள் * வலைபெயர்ப்பு வழியாக செர்மன் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @ஃபிராங்கோனியன்) * வலைபெயர்ப்பு வழியாக பிரஞ்சு மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் பால் கொலிக்னன்)

# changelogs/72.txt:1
source: * Dutch translation via Weblate (Credit @PoepiePeppie) * German translation via Weblate (Credit @franconian)
ta: * வலைபெயர்ப்பு வழியாக டச்சு மொழிபெயர்ப்பு (கிரெடிட் @poepiepeppie) * வலைபெயர்ப்பு வழியாக செர்மன் மொழிபெயர்ப்பு (கிரெடிட் @ஃபிராங்கோனியன்)

# changelogs/73.txt:1
source: * Dutch translation via Weblate (Credit @PoepiePeppie) * German translation via Weblate (Credit @franconian) * Spanish translation via Weblate (Credit @palmax) * French translation via Weblate (Credit @dragibusnoir)
ta: * வலைபெயர்ப்பு வழியாக டச்சு மொழிபெயர்ப்பு (கிரெடிட் @poepiepeppie) * வலைபெயர்ப்பு வழியாக செர்மன் மொழிபெயர்ப்பு (கிரெடிட் @ஃபிராங்கோனியன்) * வலைபெயர்ப்பு வழியாக ச்பானிச் மொழிபெயர்ப்பு (கிரெடிட் @Palmax) * வலைபெயர்ப்பு வழியாக பிரஞ்சு மொழிபெயர்ப்பு (கிரெடிட் @Dragibusnoir)

# changelogs/74.txt:1
source: * Added ability to disable radar in advanced settings * Chinese translation via Weblate (Credit @Mr-Spade) * Dutch translation via Weblate (Credit arjan-s) * Portugese translation via Weblate (Credit @pedro-32) * Russian translation via Weblate (Credit Andy Panda) * Spanish translation via Webalte (Credit gallegonovato)
ta: * மேம்பட்ட அமைப்புகளில் ரேடாரை முடக்கும் திறன் சேர்க்கப்பட்டது * வலைபெயர்ப்பு வழியாக சீன மொழிபெயர்ப்பு (கடன் @mr-spade) * வலைபெயர்ப்பு வழியாக டச்சு மொழிபெயர்ப்பு (கிரெடிட் அர்சன்-எச்) * வலைபெயர்ப்பு வழியாக போர்த்துகீசிய மொழிபெயர்ப்பு (கிரெடிட் @பருத்தித்துறை -32) * வலைபெயர்ப்பு வழியாக ரச்ய மொழிபெயர்ப்பு (கடன் ஆண்டி பாண்டா) * வெபால்ட் வழியாக ச்பானிச் மொழிபெயர்ப்பு (கிரெடிட் கேலெகோனோவாடோ)

# changelogs/75.txt:1
source: * Bugfix: Mapbox playback speed increases when pressing play, due to not pausing properly (Credit @sslater11) * Italian translation via Weblate (Credit @UToppino) * Basque translation via Weblate (Credit Alexander Gabilondo) * Russian translation via Weblate (Credit Andy Panda) * Polish translation via Weblate (Credit @gnu-ewm) * French translation via Weblate (Credit J. Lavoie) * German translation via Weblate (Credit J. Lavoie)
ta: . * வலைபெயர்ப்பு வழியாக இத்தாலிய மொழிபெயர்ப்பு (கிரெடிட் @utoppino) * வலைபெயர்ப்பு வழியாக பாச்க் மொழிபெயர்ப்பு (கிரெடிட் அலெக்சாண்டர் கபிலோண்டோ) * வலைபெயர்ப்பு வழியாக ரச்ய மொழிபெயர்ப்பு (கடன் ஆண்டி பாண்டா) * வலைபெயர்ப்பு வழியாக போலந்து மொழிபெயர்ப்பு (கிரெடிட் @குனு-ஈவ்ம்) * வலைபெயர்ப்பு வழியாக பிரஞ்சு மொழிபெயர்ப்பு (கிரெடிட் சே. லாவோய்) * வலைபெயர்ப்பு வழியாக செர்மன் மொழிபெயர்ப்பு (கிரெடிட் சே. லாவோய்)

# changelogs/76.txt:1
source: * Updated Privacy Policy to use GitHub Pages
ta: * அறிவிலிமையம் பக்கங்களைப் பயன்படுத்த தனியுரிமைக் கொள்கை புதுப்பிக்கப்பட்டது

# changelogs/77.txt:1
source: * Using CartoDB for base map for radar * Added legend to radar * Added radar themes to advanced settings * Fixed radar attribution * Fixed radar text scaling * Fix for crash when editing locations * Fix for crash when Rainviewer has outages * Polish Translation Updates via Weblate (Credit @extrm1991) * Basque Translation Updates via Weblate (Credit Alexander Gabilondo) * Tamazight (Standard Moroccan) Translation Updates via Weblate (Credit @zouhirdehbi)
ta: * ரேடருக்கு அடிப்படை வரைபடத்திற்கு கார்ட்டோடிபியைப் பயன்படுத்துதல் * ரேடருக்கு புராணக்கதை சேர்க்கப்பட்டது * மேம்பட்ட அமைப்புகளில் ரேடார் கருப்பொருள்கள் சேர்க்கப்பட்டன * நிலையான ரேடார் பண்புக்கூறு * நிலையான ரேடார் உரை அளவிடுதல் * இடங்களைத் திருத்தும்போது செயலிழப்பை சரிசெய்யவும் * ரெய்வீவருக்கு செயலிழப்புகள் இருக்கும்போது செயலிழப்பை சரிசெய்யவும் * வலைபெயர்ப்பு வழியாக போலந்து மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @extm1991) * வலைபெயர்ப்பு வழியாக பாச்க் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் அலெக்சாண்டர் கபிலோண்டோ) * தமாசைட் (நிலையான மொராக்கோ) மொழிபெயர்ப்பு புதுப்பிப்புகள் வலைபெயர்ப்பு வழியாக (கிரெடிட் @zouhirdehbi)

# changelogs/78.txt:1
source: * Added ability to change the order of and/or disable weather cards * Bugfix: Radar height not changing in landscape mode * Bugfix: Now displaying an 8th day of daily data * Bugfix: Filtering non-weather alerts * Polish Translation Updates via Weblate (Credit @extrm1991) * Dutch Translation Updates via Weblate (Credit @arjan-s) * Tamazight (Standard Moroccan) Translation Updates via Weblate (Credit @zouhirdehbi) * Basque Translation Updates via Weblate (Credit Alexander Gabilondo) * Hebrew Translation Updates via Weblate (Credit עקיבא בקנשטיין) * Russian Translation Updates via Weblate (Credit gfbdrgng)
ta: * வானிலை அட்டைகளின் வரிசையை மாற்றும் மற்றும்/அல்லது முடக்கும் திறன் கூடுதல் * பிழைத்திருத்தம்: நிலப்பரப்பு பயன்முறையில் ரேடார் உயரம் மாறவில்லை * பிழைத்திருத்தம்: இப்போது நாள்தோறும் தரவின் 8 வது நாளைக் காட்டுகிறது * பிழைத்திருத்தம்: வானிலை அல்லாத விழிப்பூட்டல்களை வடிகட்டுதல் * வலைபெயர்ப்பு வழியாக போலந்து மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @extm1991) * வலைபெயர்ப்பு வழியாக டச்சு மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் @அர்சன்-எச்) * தமாசைட் (நிலையான மொராக்கோ) மொழிபெயர்ப்பு புதுப்பிப்புகள் வலைபெயர்ப்பு வழியாக (கிரெடிட் @zouhirdehbi) * வலைபெயர்ப்பு வழியாக பாச்க் மொழிபெயர்ப்பு புதுப்பிப்புகள் (கிரெடிட் அலெக்சாண்டர் கபிலோண்டோ) * வலைபெயர்ப்பு வழியாக எபிரேய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கடன் עק בקנשט) * வலைபெயர்ப்பு வழியாக ரச்ய மொழிபெயர்ப்பு புதுப்பிப்புகள் (கடன் GFBDRGNG)

# changelogs/79.txt:1
source: * Bugfix: No cards shown for new users
ta: * பிழைத்திருத்தம்: புதிய பயனர்களுக்கு அட்டைகள் எதுவும் காட்டப்படவில்லை
