Repository: 247i/TACETr
Catalog: உரை/தானி/quotes-status-creator-quotes-status-creator-*.po
Languages: ta

# app_name
source: Quotes
ta: மேற்கோள்கள்

source: Home
ta: வீடு

source: Favorites
ta: பிடித்தவை

source: Share Random Quote
ta: சீரற்ற மேற்கோளைப் பகிரவும்

source: Quote
ta: மேற்கோள்

source: Author
ta: நூலாசிரியர்

source: Add
ta: கூட்டு

source: Cancel
ta: ரத்துசெய்

source: Submit
ta: சமர்ப்பிக்கவும்

# default_size
source: Default
ta: இயல்புநிலை

source: Reset Settings
ta: அமைப்புகளை மீட்டமைக்கவும்

source: Plain Color
ta: வெற்று நிறம்

source: Image From Gallery
ta: கேலரியிலிருந்து படம்

source: Default Images
ta: இயல்புநிலை படங்கள்

source: Change Font Style
ta: எழுத்துரு பாணியை மாற்றவும்

source: Change Font Color
ta: எழுத்துரு நிறத்தை மாற்றவும்

source: Change Font Size
ta: எழுத்துரு அளவை மாற்றவும்

source: Quotes Status Creator
ta: நிலை உருவாக்கியவர் மேற்கோள்கள்

source: Add Custom Quote
ta: தனிப்பயன் மேற்கோளைச் சேர்க்கவும்

source: Pick Background Image
ta: பின்னணி படத்தைத் தேர்ந்தெடுக்கவும்

source: Used Images
ta: பயன்படுத்தப்பட்ட படங்கள்

source: New Images
ta: புதிய படங்கள்

source: Pick Card Color
ta: அட்டை வண்ணத்தைத் தேர்ந்தெடுங்கள்

source: Pick a Color
ta: ஒரு வண்ணத்தைத் தேர்ந்தெடுங்கள்

source: Choose a Theme
ta: ஒரு கருப்பொருளைத் தேர்வுசெய்க

source: Light Theme
ta: ஒளி கருப்பொருள்

source: Dark Theme
ta: இருண்ட கருப்பொருள்

source: Follow System Theme
ta: கணினி கருப்பொருள் பின்பற்றவும்

source: Pick Font Style
ta: எழுத்துரு பாணியைத் தேர்ந்தெடுங்கள்

source: Font Size
ta: எழுத்துரு அளவு

source: Settings
ta: அமைப்புகள்

source: SKIP
ta: தவிர்

source: NEXT
ta: அடுத்தது

source: Quote Loading...
ta: மேற்கோள் ஏற்றுதல் ...

source: Pick an Option
ta: ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்

source: Copy Quote to Clipboard
ta: இடைநிலைப்பலகைக்கு மேற்கோளை நகலெடுக்கவும்

source: Share Quote as Image
ta: மேற்கோளை படமாக பகிரவும்

source: Save to Gallery
ta: கேலரியில் சேமிக்கவும்

source: Ask every time
ta: ஒவ்வொரு முறையும் கேளுங்கள்

source: Nothing Here!
ta: இங்கே எதுவும் இல்லை!

source: Search
ta: தேடல்

source: Report via Telegram
ta: தந்தி வழியாக அறிக்கை

source: Report via GitHub
ta: அறிவிலிமையம் வழியாக அறிக்கை

# error_report_note
source: To diagnose and fix this issue, please send us a crash report.
ta: இந்த சிக்கலைக் கண்டறிந்து சரிசெய்ய, எங்களுக்கு செயலிழப்பு அறிக்கையை அனுப்பவும்.

# your_comment
source: Your comment (optional)
ta: உங்கள் கருத்து (விரும்பினால்)

source: About
ta: பற்றி

source: Version
ta: பதிப்பு

# share_text
source: Install Quotes Status Creator - an open source app that lets you share quotations as status images on social media
ta: மேற்கோள்கள் நிலை உருவாக்கியவர் - சமூக ஊடகங்களில் மேற்கோள்களை நிலை படங்களாகப் பகிர அனுமதிக்கும் திறந்த மூல பயன்பாடு

source: Share Quotes Status Creator
ta: மேற்கோள்கள் நிலை உருவாக்கியவர் பகிர்ந்து கொள்ளுங்கள்

source: Join Telegram Group
ta: டெலிகிராம் குழுவில் சேரவும்

source: Join our community on Telegram
ta: டெலிகிராமில் எங்கள் சமூகத்தில் சேரவும்

source: Rate the App
ta: பயன்பாட்டை மதிப்பிடுங்கள்

source: Rate this app on Google Play
ta: இந்த பயன்பாட்டை Google Play இல் மதிப்பிடுங்கள்

source: Share the App
ta: பயன்பாட்டைப் பகிரவும்

source: Share Quotes Status Creator with your friends
ta: உங்கள் நண்பர்களுடன் மேற்கோள்களை நிலை உருவாக்கியவரைப் பகிரவும்

source: Source Code
ta: மூலக் குறியீடு

source: View source code on GitHub
ta: கிதுபில் மூலக் குறியீட்டைக் காண்க

source: Thanks To
ta: நன்றி

source: Thanks to these awesome people
ta: இந்த அற்புதமான நபர்களுக்கு நன்றி

source: Translate the app
ta: பயன்பாட்டை மொழிபெயர்க்கவும்

# help_in_localization
source: Help in localization by adding translations in your language
ta: உங்கள் மொழியில் மொழிபெயர்ப்புகளைச் சேர்ப்பதன் மூலம் உள்ளூர்மயமாக்கலுக்கு உதவுங்கள்

source: crashed
ta: செயலிழந்தது

source: Package Name:
ta: தொகுப்பு பெயர்:

source: App Version:
ta: பயன்பாட்டு பதிப்பு:

source: Version Code:
ta: பதிப்பு குறியீடு:

source: Android Version:
ta: ஆண்ட்ராய்டு பதிப்பு:

source: App Start Date:
ta: பயன்பாட்டு தொடக்க தேதி:

source: Stack Trace:
ta: அடுக்கு ட்ரேச்:

source: Comment:
ta: கருத்து:

source: Crash report for
ta: விபத்துக்குள்ளான அறிக்கை

source: Report Copied to Clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்ட அறிக்கை

source: Life
ta: வாழ்க்கை

source: Success
ta: செய்

source: Love
ta: காதல்

source: Action
ta: செயல்

source: Dream
ta: கனவு

source: Fail
ta: தோல்வி

source: Thought
ta: சிந்தனை

source: Heart
ta: இதயம்

source: Mistake
ta: தவறு

source: Wisdom
ta: ஞானம்

source: Fear
ta: அச்சம்

source: Courage
ta: துணிவு

source: Friend
ta: நண்பர்

source: Attitude
ta: அணுகுமுறை

source: Perseverance
ta: விடாமுயற்சி

source: Motivation
ta: உந்துதல்

source: Inspiration
ta: ஊக்கம்

source: Action Cancelled!
ta: நடவடிக்கை ரத்து செய்யப்பட்டது!

source: Oops! Something went wrong!
ta: அச்சச்சோ! ஏதோ தவறு நடந்தது!

source: Please Connect to the Internet
ta: இணையத்துடன் இணைக்கவும்

source: Choose a background
ta: பின்னணியைத் தேர்வுசெய்க

source: Already Present in Favorites
ta: ஏற்கனவே பிடித்தவைகளில் உள்ளது

source: Added to Favorites
ta: பிடித்தவைகளில் சேர்க்கப்பட்டது

source: Please Wait....
ta: தயவுசெய்து காத்திருங்கள் ....

source: Welcome!
ta: வரவேற்கிறோம்!

# welcome_desc
source: Quotes Status Creator lets you share quotations on social media.
ta: மேற்கோள்கள் நிலை உருவாக்கியவர் சமூக ஊடகங்களில் மேற்கோள்களைப் பகிர்ந்து கொள்ள உங்களை அனுமதிக்கிறது.

source: Feature Rich
ta: நற்பொருத்தம் பணக்காரர்

# huge_collection_desc
source: Quotes Status Creator packs plethora of features enhancing the ease of use!
ta: மேற்கோள்கள் நிலை உருவாக்கியவர் பயன்பாட்டின் எளிமையை மேம்படுத்தும் அம்சங்களின் ஏராளமான பொதிகள்!

source: Highly Customizable
ta: மிகவும் தனிப்பயனாக்கக்கூடியது

# highly_customizable_desc
source: <![CDATA[Quotes Status Creator lets you customize the card, background & font.]]>
ta: <! [சி.டி.ஏ.டி.ஏ [மேற்கோள்கள் நிலை உருவாக்கியவர் அட்டை, பின்னணி மற்றும் எழுத்துருவைத் தனிப்பயனாக்க உங்களை அனுமதிக்கிறது.]]>

source: Field Empty
ta: புலம் காலியாக உள்ளது

source: Quote added to Favorites
ta: பிடித்தவைகளில் மேற்கோள் சேர்க்கப்பட்டது

source: Applying Changes
ta: மாற்றங்களைப் பயன்படுத்துதல்

source: Pick Font Color
ta: எழுத்துரு வண்ணத்தைத் தேர்ந்தெடுங்கள்

source: Pick Background Color
ta: பின்னணி நிறத்தைத் தேர்ந்தெடுங்கள்

source: Swipe Right to Share
ta: பகிர்ந்து கொள்ள உரிமை ச்வைப் செய்யுங்கள்

source: Swipe Left to Delete
ta: நீக்க இடதுபுறம் ச்வைப் செய்யவும்

source: Swipe Right to Delete
ta: நீக்க வலதுபுறம் ச்வைப் செய்யவும்

source: Swipe Left to Share
ta: பகிர்ந்து கொள்ள இடது

source: Font set
ta: எழுத்துரு தொகுப்பு

source: Removed from Favorites
ta: பிடித்தவைகளிலிருந்து அகற்றப்பட்டது

source: Undo
ta: செயல்தவிர்

source: All
ta: அனைத்தும்

# default_string
source: Default
ta: இயல்புநிலை

source: Custom
ta: தனிப்பயன்

source: Font file not found
ta: எழுத்துரு கோப்பு கிடைக்கவில்லை

source: Reverse Swipe
ta: தலைகீழ் ச்வைப்

source: Reverse Swipe Action on Favorites
ta: பிடித்தவைகளில் தலைகீழ் ச்வைப் நடவடிக்கை

source: Share
ta: பங்கு

source: Default Action
ta: இயல்புநிலை செயல்

source: Share Button Behaviour
ta: பொத்தான் நடத்தை பகிரவும்

source: Theme
ta: கருப்பொருள்

source: Pick a theme for the app
ta: பயன்பாட்டிற்கான கருப்பொருளைத் தேர்ந்தெடுக்கவும்

source: Settings Reset
ta: அமைப்புகள் மீட்டமைக்கின்றன

source: Restarting App for changes to take effect
ta: மாற்றங்கள் நடைமுறைக்கு வருவதற்கான பயன்பாட்டை மறுதொடக்கம் செய்தல்

source: Daily Reminder
ta: நாள்தோறும் நினைவூட்டல்

source: Daily notifications
ta: நாள்தோறும் அறிவிப்புகள்

source: Turned on
ta: இயக்கப்பட்டது

source: Turned off
ta: அணைக்கப்பட்டது

source: Daily Notification not set
ta: நாள்தோறும் அறிவிப்பு அமைக்கப்படவில்லை

source: Try again
ta: மீண்டும் முயற்சிக்கவும்

source: Debug build
ta: பிழைத்திருத்த கட்டமைப்பை

source: Add to Favorites
ta: பிடித்தவைகளில் சேர்க்கவும்

source: Quote of the day
ta: அன்றைய மேற்கோள்

source: Share via
ta: வழியாக பகிரவும்

source: Copied to Clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது

source: Saving to Gallery
ta: கேலரிக்கு சேமித்தல்

source: App requires these permissions to share the quote
ta: மேற்கோளைப் பகிர இந்த அனுமதிகள் பயன்பாட்டிற்கு தேவை

source: Permission Denied
ta: இசைவு மறுக்கப்பட்டது

source: Please Accept Necessary Permissions
ta: தேவையான அனுமதிகளை ஏற்றுக்கொள்ளுங்கள்

source: App requires these permissions to run properly
ta: பயன்பாட்டிற்கு இந்த அனுமதிகள் சரியாக இயங்க வேண்டும்

source: Choose from device
ta: சாதனத்திலிருந்து தேர்வு செய்யவும்

# unsplash_credit
source: All images are from <a href="https://unsplash.com/?utm_source=Quotes%20Status%20Creator%26utm_medium=referral">Unsplash</a>
ta: எல்லா படங்களும் <a href = "https://unsplash.com/?utm_source=quotes%20Status%20CREATOR%26UTM_MEDIUM=REFERRAL"> Unsplash </a>

source: About Icon IV
ta: படவுரு IV பற்றி

source: About FAB
ta: ஃபேப் பற்றி

source: Card FAB
ta: அட்டை ஃபேப்

source: Settings FAB
ta: அமைப்புகள் ஃபேப்

source: Font FAB
ta: எழுத்துரு ஃபேப்

source: Home FAB
ta: ஓம் ஃபேப்

source: Home FAB Overlay
ta: முகப்பு ஃபேப் மேலடுக்கு

source: BG FAB
ta: பி.சி ஃபேப்

source: Color FAB
ta: வண்ண ஃபேப்

source: Fav FAB
ta: ஃபேப் ஃபேப்

source: Splash Screen App Icon
ta: ச்பிளாச் திரை ஆப் படவுரு

source: Default Single Image
ta: இயல்புநிலை ஒற்றை படம்

source: Color Pick Single IV
ta: வண்ண தேர்வு ஒற்றை IV

source: About Screen App Icon
ta: திரை பயன்பாட்டு படவுரு பற்றி

source: Fav RecyclerView Empty Hint ImageView
ta: Fav மறுசுழற்சி பார்வை வெற்று குறிப்பு படக் காட்சி

source: Quote Fragment Favourite Button
ta: FRAGMENT பிடித்த பொத்தானை மேற்கோள் காட்டுங்கள்

source: Quote Fragment Share Button
ta: மேற்கோள் துண்டு பங்கு பொத்தானை

source: Settings Screen Notification Switch Hint
ta: அமைப்புகள் திரை அறிவிப்பு சுவிட்ச் குறிப்பு

source: Settings Screen Fav Reverse Switch Hint
ta: அமைப்புகள் திரை ஃபேவ் தலைகீழ் சுவிட்ச் குறிப்பு

source: Settings Screen Share TV Hint
ta: அமைப்புகள் திரை பகிர்வு டிவி குறிப்பு

source: Quote Widget Favourite Button
ta: மேற்கோள் விட்செட் பிடித்த பொத்தானை

source: Quote Widget Share Button
ta: மேற்கோள் விட்செட் பகிர்வு பொத்தானை

source: Quote Widget Quote Container ImageView
ta: மேற்கோள் விட்செட் மேற்கோள் கொள்கலன் இமேச்வியூ

source: Quote Widget Author Container ImageView
ta: மேற்கோள் விட்செட் ஆசிரியர் கொள்கலன் இமேச்வியூ

source: Bottom Sheet Done Indicator
ta: கீழே தாள் முடிந்தது காட்டி

source: Tour Fragment ImageView
ta: சுற்றுலா துண்டு படம்

source: Home Search ImageView
ta: முகப்பு தேடல் படக் காட்சி

source: Custom Flag IV
ta: தனிப்பயன் கொடி IV

source: Unsplash single image
ta: ஒற்றை படத்தை அவிழ்த்து விடுங்கள்
