Repository: 247i/TACETr
Catalog: உரை/தானி/raisetoanswer-raise-to-answer-*.po
Languages: ta

# app_name
source: Raise To Answer
ta: பதிலளிக்க உயர்த்தவும்

# permissions_needed
source: App can't work without this permission, sorry…
ta: இந்த அனுமதியின்றி பயன்பாடு வேலை செய்ய முடியாது, மன்னிக்கவும்…

# raise_to_answer_header
source: Raise To Answer
ta: பதிலளிக்க உயர்த்தவும்

source: Incoming call service
ta: உள்வரும் அழைப்பு பணி

source: Raise To Answer is listening to sensor data
ta: பதிலளிக்க உயர்த்துவது சென்சார் தரவைக் கேட்பது

source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

# could_not_bind_sensor
source: Failed registering sensors, your device may lack a proximity sensor or accelerometer. Raise To Answer cannot continue.
ta: பதிவுசெய்தல் சென்சார்கள் தோல்வியுற்றது, உங்கள் சாதனத்தில் அருகாமையில் சென்சார் அல்லது முடுக்கமானி இல்லாதிருக்கலாம். பதிலளிக்க உயர்த்த முடியாது.

# feature_raise_to_answer
source: Answer by holding your phone to your ear
ta: உங்கள் தொலைபேசியை உங்கள் காதில் வைத்திருப்பதன் மூலம் பதில்

# feature_flip_over_to_decline
source: Decline by putting your phone down screen-first
ta: உங்கள் தொலைபேசியை திரையில் வைப்பதன் மூலம் குறைகிறது

# detected_raise_to_answer
source: Call pickup detected
ta: கால் பிக்கப் கண்டறியப்பட்டது

# detected_flip_over
source: Call decline detected
ta: அழைப்பு வீழ்ச்சி கண்டறியப்பட்டது

source: Test started
ta: சோதனை தொடங்கியது

# enable_at_least_one_feature
source: Please enable at least one feature
ta: குறைந்தது ஒரு அம்சத்தையாவது இயக்கவும்

# select_behaviour
source: Other settings
ta: பிற அமைப்புகள்

# behaviour_beep
source: Beep when about to answer incoming call
ta: உள்வரும் அழைப்புக்கு பதிலளிக்கும்போது பீப்

source: vibrate_behaviour_enabled_key
ta: அதிர்வு_பீஏவியர்_இனபிள்_கே

# feature_answer_all_angles
source: Answer at any angle
ta: எந்த கோணத்திலும் பதில்

# decline_holder
source: Declining calls
ta: குறைக்கும் அழைப்புகள்

# answer_holder
source: Answering calls
ta: அழைப்புகளுக்கு பதிலளித்தல்

source: answer_all_angles_enabled_key
ta: பதில்_ஆல்_ஆங்கில்ச்_இனபிள்_கே

# missing_support_magnetometer
source: Your device lacks a magnetometer, declining or limiting answering to an up-right angle is not supported.
ta: உங்கள் சாதனத்தில் ஒரு காந்தமாமீட்டர் இல்லை, குறைகிறது அல்லது வலது கோணத்திற்கு பதிலைக் கட்டுப்படுத்துவது ஆதரிக்கப்படவில்லை.

# missing_support_android_9
source: Your device is running a version of Android before 9, declining calls is not supported.
ta: உங்கள் சாதனம் 9 க்கு முன்னர் ஆண்ட்ராய்டு இன் பதிப்பை இயக்குகிறது, குறைகிறது அழைப்புகள் ஆதரிக்கப்படவில்லை.

source: Debug log copied to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்ட பிழைத்திருத்த பதிவு

# behaviour_vibrate
source: Vibrate when about to answer incoming call
ta: உள்வரும் அழைப்புக்கு பதிலளிக்கும்போது அதிர்வுறும்

source: Enable test mode
ta: சோதனை பயன்முறையை இயக்கவும்

source: Disable test mode
ta: சோதனை பயன்முறையை முடக்கு

source: Start Test
ta: சோதனை தொடக்க

source: End test
ta: இறுதி சோதனை

source: Test ended
ta: சோதனை முடிந்தது

# test_succesful_question
source: Was the test successful? If not, you could send the test logs to the developer so she can help to figure out what went wrong.
ta: சோதனை வெற்றிகரமாக இருந்ததா? இல்லையென்றால், நீங்கள் டெவலப்பருக்கு சோதனை பதிவுகளை அனுப்பலாம், எனவே என்ன தவறு நடந்தது என்பதைக் கண்டுபிடிக்க அவள் உதவலாம்.

source: Close
ta: மூடு

source: Report issue
ta: சிக்கல் அறிக்கை

# privacy_policy_popup_text
source: Many app stores require apps to show their privacy policy on first start. Here is ours: We collect NO DATA AT ALL and our app is Open Source so anyone can confirm this to be true.
ta: பல பயன்பாட்டு கடைகளுக்கு பயன்பாடுகள் முதல் தொடக்கத்தில் தங்கள் தனியுரிமைக் கொள்கையைக் காட்ட வேண்டும். இங்கே நம்முடையது: நாங்கள் எந்த தரவையும் சேகரிக்கவில்லை, எங்கள் பயன்பாடு திறந்த மூலமாக உள்ளது, எனவே இது உண்மை என்பதை யார் வேண்டுமானாலும் உறுதிப்படுத்த முடியும்.

source: Accept
ta: ஏற்றுக்கொள்
