Repository: 247i/TACETr
Catalog: உரை/தானி/rays-string-xml-*.po
Languages: ta

# mini_tool_screen_name
source: Mini Tool
ta: மினி கருவி

# mini_tool_experimental
source: Beta
ta: பீட்டா

# style_transfer_screen_name
source: Style Transfer
ta: நடை பரிமாற்றம்

# style_transfer_screen_transfer
source: Transfer
ta: இடமாற்றம்

# style_transfer_screen_image_not_selected
source: Please select the target style image and content image before transferring
ta: மாற்றுவதற்கு முன் இலக்கு பாணி படம் மற்றும் உள்ளடக்க படத்தைத் தேர்ந்தெடுக்கவும்

# style_transfer_screen_style
source: Style
ta: சூல் தண்டு

# style_transfer_screen_content
source: Content
ta: உள்ளடக்கம்

# style_transfer_screen_select_style_image
source: Select a style image
ta: ஒரு பாணி படத்தைத் தேர்ந்தெடுக்கவும்

# style_transfer_screen_select_content_image
source: Select a content image
ta: உள்ளடக்க படத்தைத் தேர்ந்தெடுக்கவும்

# selfie_segmentation_screen_name
source: Selfie segmentation
ta: செல்ஃபி பிரிவு

# selfie_segmentation_screen_segment
source: Segment
ta: பிரிவு

# selfie_segmentation_screen_image_not_selected
source: Please select a selfie image before segmenting
ta: பிரிப்பதற்கு முன் செல்ஃபி படத்தைத் தேர்ந்தெடுக்கவும்

# selfie_segmentation_screen_selfie
source: Selfie
ta: செல்ஃபி

# selfie_segmentation_screen_background
source: Background
ta: பின்னணி

# selfie_segmentation_screen_select_selfie_image
source: Select a selfie image
ta: செல்ஃபி படத்தைத் தேர்ந்தெடுக்கவும்

# selfie_segmentation_screen_select_background_image
source: Select a background image
ta: பின்னணி படத்தைத் தேர்ந்தெடுக்கவும்

# selfie_segmentation_screen_reset_selfie_transformations
source: Reset selfie
ta: செல்ஃபி மீட்டமை

# api_screen_name
source: API (Experimental)
ta: பநிஇ (சோதனை)

# api_grant_screen_name
source: API grant
ta: பநிஇ மானியம்

# setting_screen_api_description
source: Application Programming Interface
ta: பயன்பாட்டு நிரலாக்க இடைமுகம்

# api_grant_repo_no_package
source: No such package is available: %s
ta: அத்தகைய தொகுப்பு எதுவும் கிடைக்கவில்லை: %s

# api_grant_screen_description
source: Manage API permissions for external applications
ta: வெளிப்புற பயன்பாடுகளுக்கான பநிஇ அனுமதிகளை நிர்வகிக்கவும்

# api_grant_screen_enable
source: Enable API
ta: பநிஇ ஐ இயக்கு

# accessibility_service_label
source: Rays
ta: கதிர்கள்

# accessibility_service_description
source: It is recommended that Rays should be allowed to launch on startup, launch by other apps and keep running in background. The following features of Rays are required for accessibility: Auto share
ta: ச்டார்ட்அப்பில் தொடங்கவும், பிற பயன்பாடுகளால் தொடங்கவும், பின்னணியில் இயங்கவும் அனுமதிக்கப்பட வேண்டும் என்று பரிந்துரைக்கப்படுகிறது. அணுகலுக்கு கதிர்களின் பின்வரும் நற்பொருத்தங்கள் தேவை: வாகன பங்கு

# auto_share_screen_name
source: Auto share
ta: வாகன பங்கு

# auto_share_screen_description
source: Share sticker to the previous page automatically
ta: முந்தைய பக்கத்திற்கு ச்டிக்கரை தானாக பகிரவும்

# auto_share_screen_ignore
source: Ignore strategy
ta: மூலோபாயத்தை புறக்கணிக்கவும்

# auto_share_screen_ignore_description
source: Ignore the existence of the matched pages
ta: பொருந்திய பக்கங்களின் இருப்பை புறக்கணிக்கவும்

# auto_share_screen_ignore_input_dialog_title
source: Ignore strategy regex
ta: மூலோபாய வழக்கவெளி ஐ புறக்கணிக்கவும்

# auto_share_screen_ignore_regex_format_error
source: Regex format invalid
ta: ரீசெக்ச் வடிவம் தவறானது

# auto_share_screen_accessibility_granted
source: Accessibility permission granted now
ta: அணுகல் இசைவு இப்போது வழங்கப்பட்டுள்ளது

# auto_share_screen_accessibility_not_granted
source: No accessibility permission granted now
ta: அணுகல் இசைவு இப்போது வழங்கப்படவில்லை

# auto_share_screen_supported_app
source: Auto share allows you to share a sticker directly to the application corresponding to the previous page. This feature requires accessibility permission. After killing the Rays process, upgrading or reinstalling Rays, Auto share may be disabled and needs to be enabled by manually granting accessibility permission. It is recommended that Rays should be allowed to launch on startup, launch by other apps and keep running in background. Supported apps: Telegram Discord WeChat Instagram QQ WhatsApp Weibo
ta: முந்தைய பக்கத்துடன் தொடர்புடைய பயன்பாட்டிற்கு நேரடியாக ஒரு ச்டிக்கரைப் பகிர ஆட்டோ சர் உங்களை அனுமதிக்கிறது. இந்த அம்சத்திற்கு அணுகல் இசைவு தேவை. கதிர்கள் செயல்முறையை கொன்ற பிறகு, கதிர்களை மேம்படுத்துதல் அல்லது மீண்டும் நிறுவுதல், ஆட்டோ பங்கு முடக்கப்படலாம் மற்றும் அணுகல் அனுமதியை கைமுறையாக வழங்குவதன் மூலம் இயக்கப்பட வேண்டும். ச்டார்ட்அப்பில் தொடங்கவும், பிற பயன்பாடுகளால் தொடங்கவும், பின்னணியில் இயங்கவும் அனுமதிக்கப்பட வேண்டும் என்று பரிந்துரைக்கப்படுகிறது. ஆதரிக்கப்பட்ட பயன்பாடுகள்: தந்தி முரண்பாடு வெச்சாட் இன்ச்டாகிராம் Qq வாட்ச்அப் வெய்போ

# help_translate
source: Translate
ta: மொழிபெயர்த்திடு

source: Sponsor
ta: ஒப்புரவாளர்

# sponsor_description
source: If you like the app, you can buy me a cup of coffee, thanks!
ta: நீங்கள் பயன்பாட்டை விரும்பினால், நீங்கள் எனக்கு ஒரு கப் காபி வாங்கலாம், நன்றி!

# sponsor_afadian
source: Afadian
ta: அஃபாடியன்

# sponsor_buy_me_a_coffee
source: Buy me a coffee
ta: எனக்கு ஒரு காபி வாங்கவும்

# classification_screen_threshold
source: Classification threshold
ta: வகைப்பாடு வாசல்

# classification_screen_threshold_description
source: Only tags with confidence higher than this threshold will be recommended, suggested to be set around 0.5. SVG format is not supported.
ta: இந்த வாசலை விட நம்பிக்கையுடன் கூடிய குறிச்சொற்கள் மட்டுமே பரிந்துரைக்கப்படும், இது 0.5 ஐ அமைக்க பரிந்துரைக்கப்படுகிறது. எச்.வி.சி வடிவம் ஆதரிக்கப்படவில்லை.

# text_recognize_screen_name
source: Text recognize
ta: உரை ஏற்பு

# text_recognize_screen_description
source: Recognize texts in a sticker
ta: ஒரு ச்டிக்கரில் உரைகளை அங்கீகரிக்கவும்

# text_recognize_screen_threshold
source: Text recognize threshold
ta: உரை வாசலை அங்கீகரிக்கவும்

# text_recognize_screen_threshold_description
source: Only texts with confidence higher than this threshold will be recommended, suggested to be set around 0.4. SVG format is not supported.
ta: இந்த வாசலை விட நம்பிக்கையுடன் கூடிய நூல்கள் மட்டுமே பரிந்துரைக்கப்படும், இது 0.4 ஐ அமைக்க பரிந்துரைக்கப்படுகிறது. எச்.வி.சி வடிவம் ஆதரிக்கப்படவில்லை.

# privacy_screen_name
source: Privacy
ta: தனியுரிமை

# setting_screen_privacy_description
source: Disable screenshot, blur stickers
ta: திரைக்காட்சி, மங்கலான ச்டிக்கர்களை முடக்கு

# privacy_screen_disable_screenshot
source: Disable screenshot
ta: ச்கிரீன்சாட்டை முடக்கு

# privacy_screen_disable_screenshot_description
source: Screenshot is prohibited in the app
ta: பயன்பாட்டில் திரைக்காட்சி தடைசெய்யப்பட்டுள்ளது

# blur_stickers_screen_name
source: Blur stickers
ta: மங்கலான ச்டிக்கர்கள்

# blur_stickers_screen_description
source: Blurring the specified stickers only un-blurs when clicking on the sticker in the detail screen
ta: விவரத் திரையில் ச்டிக்கரைக் சொடுக்கு செய்யும் போது குறிப்பிட்ட ச்டிக்கர்களை மங்கலாக்குகிறது

source: Expand
ta: விரிவாக்கு

source: Collapse
ta: சரிவு

# share_sheet_action_copy
source: Copy
ta: நகலெடு

# share_sheet_action_save
source: Save
ta: சேமி

# share_sheet_action_save_toast_success
source: Saved to "Pictures/Rays"
ta: "படங்கள்/கதிர்கள்" என சேமிக்கப்பட்டது

# share_sheet_action_save_toast_failed
source: Save failed
ta: சேமி தோல்வியுற்றது

# detail_screen_name
source: Detail
ta: விவரம்

source: More
ta: மேலும்

# home_screen_recommend_tags
source: Recommend tags
ta: குறிச்சொற்களை பரிந்துரைக்கவும்

# home_screen_random_tags
source: Random tags
ta: சீரற்ற குறிச்சொற்கள்

# home_screen_recent_create_stickers
source: Recent creates
ta: அண்மைக் கால உருவாக்கங்கள்

# home_screen_recent_shared_stickers
source: Recent shares
ta: அண்மைக் கால பங்குகள்

# home_screen_most_shared_stickers
source: Most shares
ta: பெரும்பாலான பங்குகள்

# home_screen_export_to_backup_zip
source: Export as backup zip
ta: காப்பு சிப் ஆக ஏற்றுமதி

# stickers_list_screen_name
source: Stickers list
ta: ச்டிக்கர்கள் பட்டியல்

# stickers_list_screen_export_current_stickers
source: Export as backup zip
ta: காப்பு சிப் ஆக ஏற்றுமதி

source: Delete
ta: நீக்கு

# image_source_screen_name
source: Image source
ta: பட மூல

# setting_screen_image_source_description
source: Method for picking stickers
ta: ச்டிக்கர்களைத் தேர்ந்தெடுப்பதற்கான முறை

# image_screen_picker
source: Image Picker
ta: பட எடுப்பவர்

# image_screen_picker_description
source: Configure the method for picking stickers
ta: ச்டிக்கர்களைத் தேர்ந்தெடுப்பதற்கான முறையை உள்ளமைக்கவும்

# pick_image_method_pick_visual_media
source: Photo picker (%s)
ta: புகைப்பட பிக்கர் (%s)

# pick_image_method_open_document
source: From document (%s)
ta: ஆவணத்திலிருந்து (%s)

# pick_image_method_get_content
source: From content (%s)
ta: உள்ளடக்கத்திலிருந்து (%s)

# pick_image_method_pick_from_gallery
source: From gallery (%s)
ta: கேலரியில் இருந்து (%s)

source: Use the following to open
ta: திறக்க பின்வருவனவற்றைப் பயன்படுத்தவும்

# blur_stickers_screen_blur_keywords
source: Blur keywords
ta: மங்கலான முக்கிய வார்த்தைகள்

# blur_stickers_screen_add_blur_keyword
source: Add blur keyword
ta: மங்கலான முக்கிய சொல்லைச் சேர்க்கவும்

# blur_stickers_screen_tip
source: If the title or label string of a sticker contains the blur keywords, then the sticker will be displayed blurred.
ta: ஒரு ச்டிக்கரின் தலைப்பு அல்லது சிட்டை சரம் மங்கலான முக்கிய வார்த்தைகளைக் கொண்டிருந்தால், ச்டிக்கர் மங்கலாக இருக்கும்.

# blur_stickers_screen_radius
source: Blur radius
ta: மங்கலான ஆரம்

source: Loading…
ta: ஏற்றுகிறது…

source: Stickers
ta: ச்டிக்கர்கள்

# cache_screen_name
source: Cache
ta: கேச்

# cache_screen_description
source: Delete cached data
ta: தற்காலிக சேமிப்பு தரவை நீக்கு

# cache_screen_delete_provider_thumbnails
source: Delete thumbnails
ta: சிறு உருவங்களை நீக்கு

# cache_screen_delete_provider_thumbnails_description
source: Delete sticker provider thumbnail caches
ta: ச்டிக்கர் வழங்குநர் சிறு தற்காலிக சேமிப்புகளை நீக்கு

# cache_screen_delete_provider_thumbnails_success
source: All thumbnails cleared, spent %.2fs
ta: அனைத்து சிறு உருவங்களும் அழிக்கப்பட்டன, %.2fs செலவிட்டன

# data_screen_danger_category
source: Danger area
ta: இடர் பகுதி

# data_screen_delete_all_sticker_share_time_data
source: Delete share data
ta: பகிர்வு தரவை நீக்கு

# data_screen_delete_all_sticker_share_time_data_description
source: Delete sticker share statistics, e.g. time of each share
ta: ச்டிக்கர் பகிர்வு புள்ளிவிவரங்களை நீக்கு, எ.கா. ஒவ்வொரு பங்கின் நேரமும்

# about_screen_other_works_podaura_name
source: PodAura
ta: போடூர்

# about_screen_other_works_podaura_description
source: All-in-one Android podcast app for RSS, media dl & play.
ta: ஆர்எச்எச், மீடியா டிஎல் & பிளேவுக்கான ஆல் இன் ஒன் ஆண்ட்ராய்டு போட்காச்ட் பயன்பாடு.

# cache_screen_delete_all_mimetypes
source: Delete mimetypes
ta: Mimetypes ஐ நீக்கு

# cache_screen_delete_all_mimetypes_description
source: Delete cached Mimetype data
ta: தற்காலிக சேமிப்பு MIMETYPE தரவை நீக்கு

# cache_screen_delete_all_mimetypes_success
source: All Mimetype deleted, spent %.2fs
ta: அனைத்து மைமெட்டைப் நீக்கப்பட்டது, %.2fs செலவிட்டது

# crashed
source: <![CDATA[Crashed (＃＞＜)]]>
ta: <! [CDATA [செயலிழந்தது (＃＞＜)]>

# submit_an_issue_on_github
source: Report on GitHub
ta: அறிவிலிமையம் பற்றிய அறிக்கை

source: Copied
ta: நகலெடுக்கப்பட்டது

# crash_screen_crash_log
source: Log
ta: பதிவு

# crash_screen_copy_crash_log
source: Copy log
ta: நகல் பதிவு

# appearance_screen_amoled_dark
source: Amoled dark
ta: அமோல்ட் இருள்

# home_screen_image_search
source: Image search
ta: பட தேடல்

# image_search_screen_name
source: Image search
ta: பட தேடல்

# image_search_screen_search
source: Search
ta: தேடல்

# image_search_screen_max_result_count
source: Max result count: %d
ta: அதிகபட்ச முடிவு எண்ணிக்கை: %d

# image_search_screen_long_time_tip
source: The first use of this feature may take some time. Please be patient.
ta: இந்த அம்சத்தின் முதல் பயன்பாடு சிறிது நேரம் ஆகலாம். தயவுசெய்து பொறுமையாக இருங்கள்.

# image_search_screen_source_image
source: Source
ta: மூலம்

# image_search_screen_source_image_hint
source: Select a image
ta: ஒரு படத்தைத் தேர்ந்தெடுக்கவும்

# image_search_screen_threshold
source: Threshold: %.2f
ta: வாசல்: %.2f

# search_config_screen_enable_add_screen_image_search
source: Add screen search
ta: திரை தேடலைச் சேர்க்கவும்

# search_config_screen_enable_add_screen_image_search_description
source: Show similar images on the Add Screen
ta: சேர் திரையில் ஒத்த படங்களைக் காட்டுங்கள்

# search_config_screen_image_search_max_result_count
source: Max result count
ta: அதிகபட்ச முடிவு எண்ணிக்கை

# add_screen_similar_stickers
source: Similar stickers
ta: ஒத்த ச்டிக்கர்கள்

# detail_screen_full_image
source: View in full screen
ta: முழுத் திரையில் காண்க

# data_screen_delete_vector_db
source: Delete vector DB
ta: திசையன் டி.பி.

# data_screen_delete_vector_db_description
source: The data in this database is all cached data
ta: இந்த தரவுத்தளத்தில் உள்ள தரவு அனைத்தும் தற்காலிக சேமிக்கப்பட்ட தரவு

# merge_stickers_screen_name
source: Merge stickers
ta: ச்டிக்கர்களை ஒன்றிணைக்கவும்

# merge_stickers_screen_merge_successful
source: Merge successful
ta: வெற்றிகரமாக ஒன்றிணைக்கவும்

# merge_stickers_screen_candidate_titles
source: Candidate titles
ta: வேட்பாளர் தலைப்புகள்

# merge_stickers_screen_candidate_images
source: Candidate images
ta: வேட்பாளர் படங்கள்

# merge_stickers_screen_candidate_tags
source: Candidate tags
ta: வேட்பாளர் குறிச்சொற்கள்

# merge_stickers_screen_empty_sticker_list
source: Please select at least two stickers to merge
ta: ஒன்றிணைக்க குறைந்தது இரண்டு ச்டிக்கர்களைத் தேர்ந்தெடுக்கவும்

# merge_stickers_screen_merge
source: Merge
ta: ஒன்றிணைக்கவும்

# merge_stickers_screen_max_count_limit
source: Up to 20 stickers can be merged, excess will not be processed
ta: 20 ச்டிக்கர்கள் வரை இணைக்கப்படலாம், அதிகப்படியான செயலாக்கப்படாது

# image_load_error
source: Image can't be displayed
ta: படத்தைக் காட்ட முடியாது

# classification_model_screen_enable_on_add_screen
source: Enable on add screen
ta: சேர் திரையில் இயக்கவும்

# classification_model_screen_enable_on_add_screen_description
source: Enable classification tag recommendations on the add screen
ta: சேர் திரையில் வகைப்பாடு குறிச்சொல் பரிந்துரைகளை இயக்கவும்

# text_recognize_model_screen_enable_on_add_screen
source: Enable on add screen
ta: சேர் திரையில் இயக்கவும்

# text_recognize_screen_enable_on_add_screen_description
source: Enable text recognize on the add screen
ta: சேர் திரையில் உரை அங்கீகரிக்கவும்
