Repository: 247i/TACETr
Catalog: உரை/தானி/rays-string-xml-*.po
Languages: ta

# app_name
source: Rays
ta: கதிர்கள்

# more_screen_name
source: More
ta: மேலும்

# home_screen_name
source: Home
ta: வீடு

# home_screen_search_hint
source: Search
ta: தேடல்

# home_screen_add
source: Add
ta: கூட்டு

# add_screen_save_current_sticker
source: Save current sticker
ta: தற்போதைய ச்டிக்கரை சேமிக்கவும்

# add_screen_title
source: Title (Optional)
ta: தலைப்பு (விரும்பினால்)

# add_screen_add_tags
source: Add tags (Optional)
ta: குறிச்சொற்களைச் சேர்க்கவும் (விரும்பினால்)

# add_screen_name
source: Add
ta: கூட்டு

# add_screen_name_edit
source: Edit
ta: தொகு

source: Back
ta: பின்

# failed_info
source: Failed: %s
ta: தோல்வியுற்றது: %s

# add_screen_waiting_uris
source: Waiting list
ta: காத்திருப்பு பட்டியல்

# add_screen_sticker_is_not_set
source: Please select a sticker!
ta: தயவுசெய்து ஒரு ச்டிக்கரைத் தேர்ந்தெடுக்கவும்!

# add_screen_tag_field_hint
source: Press Enter to add
ta: சேர்க்க Enter ஐ அழுத்தவும்

# add_screen_add_tag
source: Add
ta: கூட்டு

# add_screen_add_tag_to_all
source: Add to all stickers in the waiting list
ta: காத்திருப்பு பட்டியலில் உள்ள அனைத்து ச்டிக்கர்களிலும் சேர்க்கவும்

# add_screen_global_tags
source: Global tags
ta: உலகளாவிய குறிச்சொற்கள்

# add_screen_global_tags_tips
source: Global tags will be added to all stickers in the waiting list.
ta: காத்திருப்பு பட்டியலில் உள்ள அனைத்து ச்டிக்கர்களிலும் உலகளாவிய குறிச்சொற்கள் சேர்க்கப்படும்.

# add_screen_skip_current_sticker
source: Drop current editing content
ta: தற்போதைய திருத்துதல் உள்ளடக்கத்தை கைவிடவும்

# search_config_screen_name
source: Search
ta: தேடல்

# home_screen_close_search
source: Close
ta: மூடு

# home_screen_clear_search_text
source: Clear query
ta: தெளிவான வினவல்

# search_config_screen_common_category
source: General
ta: பொது

# search_config_screen_use_regex
source: Regular expression
ta: வழக்கமான வெளிப்பாடு

# search_config_screen_use_regex_description
source: Consider search keywords as regular expression
ta: தேடல் முக்கிய வார்த்தைகளை வழக்கமான வெளிப்பாடாகக் கருதுங்கள்

# search_config_screen_domain_category
source: Search domain (search all when not selected)
ta: தேடு டொமைன் (தேர்ந்தெடுக்கப்படாதபோது அனைத்தையும் தேடுங்கள்)

# detail_screen_edit
source: Edit
ta: தொகு

# home_screen_delete
source: Delete
ta: நீக்கு

# home_screen_export
source: Export
ta: ஏற்றுமதி

# detail_screen_copy
source: Copy
ta: நகலெடு

# detail_screen_copied
source: Copied
ta: நகலெடுக்கப்பட்டது

source: Info
ta: தகவல்

# dialog_ok
source: OK
ta: சரி

# dialog_close
source: Close
ta: மூடு

source: Cancel
ta: ரத்துசெய்

# home_screen_delete_warning
source: Delete? The operation is irreversible!
ta: நீக்கவா? செயல்பாடு மாற்ற முடியாதது!

# dialog_warning
source: Warning
ta: எச்சரிக்கை

# dialog_exit
source: Exit
ta: வெளியேறு

source: Settings
ta: அமைப்புகள்

source: About
ta: பற்றி

# setting_screen_search_description
source: Search preference, search domain
ta: தேடல் விருப்பம், தேடல் களம்

# about_screen_app_full_name
source: (Record All Your Stickers)
ta: (உங்கள் எல்லா ச்டிக்கர்களையும் பதிவு செய்யுங்கள்)

# about_screen_description_1
source: A tool to record, search and manage stickers on your phone.
ta: உங்கள் தொலைபேசியில் ச்டிக்கர்களைப் பதிவுசெய்ய, தேட மற்றும் நிர்வகிக்க ஒரு கருவி.

# about_screen_description_2
source: Are you still struggling with too many stickers on your phone and having trouble finding the ones you want? This tool will help you manage your stickers! 😋
ta: உங்கள் தொலைபேசியில் அதிகமான ச்டிக்கர்களுடன் நீங்கள் இன்னும் போராடுகிறீர்களா, நீங்கள் விரும்புவதைக் கண்டுபிடிப்பதில் சிக்கல் உள்ளதா? இந்த கருவி உங்கள் ச்டிக்கர்களை நிர்வகிக்க உதவும்! .

# about_screen_description_3
source: Rays utilizes the MVI architecture and fully adopts the Material You design style. All pages are developed using Jetpack Compose.
ta: கதிர்கள் எம்.வி.ஐ கட்டமைப்பைப் பயன்படுத்துகின்றன மற்றும் நீங்கள் வடிவமைக்கும் பாணியை முழுமையாக ஏற்றுக்கொள்கின்றன. அனைத்து பக்கங்களும் செட் பேக் இசையமைப்பைப் பயன்படுத்தி உருவாக்கப்படுகின்றன.

# about_screen_goto_github_repo
source: GitHub repository
ta: அறிவிலிமையம் களஞ்சியம்

# about_screen_join_discord
source: Discord server
ta: முரண்பாடு சேவையகம்

# about_screen_join_telegram
source: Telegram group
ta: தந்தி குழு

# license_screen_name
source: Open source license
ta: திறந்த மூல உரிமம்

# no_browser_found
source: Can't find the browser! Link: %s
ta: உலாவியைக் கண்டுபிடிக்க முடியவில்லை! இணைப்பு: %s

# appearance_screen_name
source: Appearance & style
ta: தோற்றம் & நடை

# setting_screen_appearance_description
source: Theme, dark mode, style
ta: கருப்பொருள், இருண்ட பயன்முறை, பாணி

# appearance_screen_dark_mode
source: Dark mode
ta: இருண்ட முறை

# appearance_screen_dark_mode_description
source: Set dark mode strategy
ta: இருண்ட பயன்முறை மூலோபாயத்தை அமைக்கவும்

# appearance_screen_sticker_color_theme
source: Sticker color theme
ta: ச்டிக்கர் வண்ண கருப்பொருள்

# appearance_screen_sticker_color_theme_description
source: When open the sticker detail page, update the theme color to the main color of the sticker
ta: ச்டிக்கர் விவரம் பக்கத்தைத் திறக்கும்போது, ​​தீம் வண்ணத்தை ச்டிக்கரின் முக்கிய வண்ணத்திற்கு புதுப்பிக்கவும்

# dark_mode_dark
source: Dark mode
ta: இருண்ட முறை

# dark_mode_light
source: Light mode
ta: ஒளி பயன்முறை

# dark_mode_follow_system
source: System default
ta: கணினி இயல்புநிலை

# import_export_screen_using_cloud_category
source: Via cloud
ta: முகில் வழியாக

# import_export_screen_using_file_category
source: Via files
ta: கோப்புகள் வழியாக

# import_files_screen_name
source: Import from files
ta: கோப்புகளிலிருந்து இறக்குமதி செய்யுங்கள்

# import_files_screen_description
source: Import stickers, tags, and other information from the local files
ta: உள்ளக கோப்புகளிலிருந்து ச்டிக்கர்கள், குறிச்சொற்கள் மற்றும் பிற தகவல்களை இறக்குமதி செய்க

# import_files_screen_select_file
source: Select backup file
ta: காப்புப்பிரதி கோப்பைத் தேர்ந்தெடுக்கவும்

# import_files_screen_import
source: Import
ta: இறக்குமதி

# import_files_screen_progress_unzipping
source: Unzipping: %s
ta: அன்சிப்பிங்: %s

# import_files_screen_progress_checking_backup_format
source: Checking backup file format…
ta: காப்பு கோப்பு வடிவமைப்பைச் சரிபார்க்கிறது…

# import_files_screen_progress_saving_data
source: Saving data…
ta: தரவைச் சேமித்தல்…

# import_files_screen_successful
source: Import successful
ta: இறக்குமதி வெற்றிகரமாக

# import_files_screen_successful_desc
source: Updated %1$d sticker in total, took %2$.2f s
ta: மொத்தத்தில் %1$d ச்டிக்கர் புதுப்பிக்கப்பட்டது, %2 $ .2f கள் எடுத்தன

# import_files_screen_on_conflict
source: On conflict
ta: மோதலில்

# import_files_screen_on_conflict_desc
source: Conflict refers to the situation where the UUID of the sticker you are currently importing is the same as the UUID of an existing sticker, regardless of whether the content of these two stickers is the same.
ta: மோதல் என்பது நீங்கள் தற்போது இறக்குமதி செய்யும் ச்டிக்கரின் UUID இன் சூழ்நிலையை குறிக்கிறது, இந்த இரண்டு ச்டிக்கர்களின் உள்ளடக்கம் ஒன்றா என்பதைப் பொருட்படுத்தாமல், ஏற்கனவே இருக்கும் ச்டிக்கரின் UUID க்கு சமம்.

# export_files_screen_name
source: Export to files
ta: கோப்புகளுக்கு ஏற்றுமதி செய்யுங்கள்

# export_files_screen_description
source: Export stickers, tags, and other information to the local files
ta: உள்ளக கோப்புகளுக்கு ச்டிக்கர்கள், குறிச்சொற்கள் மற்றும் பிற தகவல்களை ஏற்றுமதி செய்யுங்கள்

# export_files_screen_select_dir
source: Select export directory
ta: ஏற்றுமதி கோப்பகத்தைத் தேர்ந்தெடுக்கவும்

# export_files_screen_exclude_field
source: Exclude
ta: விலக்கு

# export_files_screen_export
source: Export
ta: ஏற்றுமதி

# export_files_screen_progress_exporting
source: Exporting…
ta: ஏற்றுமதி செய்கிறது…

# export_files_screen_progress_zipping
source: Zipping: %s
ta: சிப்பிங்: %s

# export_files_screen_progress_open_backup_file
source: Open
ta: திற

# export_files_screen_successful
source: Export successful
ta: ஏற்றுமதி வெற்றிகரமாக

# export_files_screen_successful_desc
source: Exported %1$d sticker in total, took %2$.2f s
ta: மொத்தம் ஏற்றுமதி %1$d ச்டிக்கர், %2 $ .2f கள் எடுத்தது

# export_files_screen_open_backup_file
source: Open backup file
ta: காப்புப்பிரதி கோப்பைத் திறக்கவும்

# export_files_screen_no_stickers_to_export
source: No stickers to export
ta: ஏற்றுமதி செய்ய ச்டிக்கர்கள் இல்லை

# handle_imported_sticker_proxy_skip
source: Skip
ta: தவிர்

# handle_imported_sticker_proxy_replace
source: Replace
ta: மாற்றவும்

# import_export_files_repo_invalid_magic_number
source: Invalid format, Magic number not equals to 0x0D000721
ta: தவறான வடிவம், மேசிக் எண் 0x0D000721 ​​க்கு சமம் இல்லை

# import_export_files_repo_invalid_format
source: Invalid format: %s
ta: தவறான வடிவம்: %s

# import_export_screen_webdav_description
source: Synchronize data via WebDAV
ta: WebDAV வழியாக தரவை ஒத்திசைக்கவும்

# webdav_screen_service_category
source: Service
ta: பணி

# webdav_screen_account
source: Account
ta: கணக்கு

# webdav_screen_account_description
source: Please input your WebDAV account
ta: உங்கள் WebDAV கணக்கை உள்ளிடவும்

# webdav_screen_password_description
source: Please input your WebDAV password
ta: உங்கள் WebDAV கடவுச்சொல்லை உள்ளிடவும்

# webdav_screen_password
source: Password
ta: கடவுச்சொல்

# webdav_screen_password_entered
source: Password saved
ta: கடவுச்சொல் சேமிக்கப்பட்டது

# webdav_screen_server
source: Server
ta: சேவையகம்

# webdav_screen_server_description
source: Please input the WebDAV server URL
ta: WebDAV சேவையக முகவரி ஐ உள்ளிடவும்

# webdav_screen_sync_category
source: Sync
ta: ஒத்திசைவு

# webdav_screen_upload
source: Push
ta: புச்

# webdav_screen_upload_description
source: Push the local data to remote
ta: உள்ளக தரவை தொலைதூரத்திற்கு தள்ளுங்கள்

# webdav_screen_upload_tip
source: When pushing local data to the remote, local stickers will overwrite the remote content if there is a conflict. If a sticker is not existing in local but in remote, the sticker will be moved to the remote recycle bin.
ta: உள்ளக தரவை தொலைதூரத்திற்கு தள்ளும்போது, ​​மோதல் இருந்தால் உள்ளக ச்டிக்கர்கள் தொலைநிலை உள்ளடக்கத்தை மேலெழுதும். ஒரு ச்டிக்கர் உள்ளக இல்லை, ஆனால் தொலைதூரத்தில் இருந்தால், ச்டிக்கர் தொலை மறுசுழற்சி தொட்டிக்கு நகர்த்தப்படும்.

# webdav_screen_download
source: Pull
ta: இழுக்கவும்

# webdav_screen_download_description
source: Pull data from remote
ta: தொலைதூரத்திலிருந்து தரவை இழுக்கவும்

# webdav_screen_download_tip
source: When pulling data from the remote, local content is overwritten if there is a conflict. If a sticker is both local and in the remote recycle bin, that local sticker will be deleted. If a sticker is in the local and not in the remote, the sticker will not be modified.
ta: தொலைதூரத்திலிருந்து தரவை இழுக்கும்போது, ​​மோதல் இருந்தால் உள்ளக உள்ளடக்கம் மேலெழுதப்படும். ஒரு ச்டிக்கர் உள்ளக மற்றும் தொலை மறுசுழற்சி தொட்டியில் இருந்தால், அந்த உள்ளக ச்டிக்கர் நீக்கப்படும். ஒரு ச்டிக்கர் உள்ளக மற்றும் தொலைதூரத்தில் இல்லாவிட்டால், ச்டிக்கர் மாற்றப்படாது.

# webdav_screen_download_success
source: Pull successful, spent %1$.2fs, update %2$d sticker
ta: வெற்றிகரமாக இழுக்கவும், %1 $ .2fs செலவழிக்கவும், புதுப்பிப்பு %2$d ச்டிக்கர்

# webdav_screen_upload_success
source: Push succeeded, spent %1$.2fs, update %2$d sticker
ta: புச் செய் பெற்றது, %1 $ .2fs செலவழித்தது, %2$d ச்டிக்கர் புதுப்பிக்கவும்

# webdav_screen_waiting
source: Please wait…
ta: தயவுசெய்து காத்திருங்கள்…

# webdav_screen_input_server
source: Server URL
ta: சேவையக முகவரி

# webdav_screen_input_account
source: Account
ta: கணக்கு

# webdav_screen_input_password
source: Password
ta: கடவுச்சொல்

# webdav_screen_remote_recycle_bin
source: Remote recycle bin
ta: தொலை மறுசுழற்சி பின்

# webdav_screen_remote_recycle_bin_description
source: View the remote recycle bin (logically deleted)
ta: தொலை மறுசுழற்சி தொட்டியைக் காண்க (தர்க்கரீதியாக நீக்கப்பட்டது)

# webdav_screen_remote_recycle_bin_tip
source: Contents in the remote recycle bin are stickers that were logically deleted. Operations on the remote recycle bin will only affect the remote contents and will not modify the local contents.
ta: தொலை மறுசுழற்சி தொட்டியில் உள்ள உள்ளடக்கங்கள் தர்க்கரீதியாக நீக்கப்பட்ட ச்டிக்கர்கள். தொலை மறுசுழற்சி தொட்டியின் செயல்பாடுகள் தொலை உள்ளடக்கங்களை மட்டுமே பாதிக்கும் மற்றும் உள்ளக உள்ளடக்கங்களை மாற்றாது.

# webdav_screen_clear_remote_recycle_bin
source: Clear
ta: தெளிவான

# webdav_screen_last_modified_time
source: Last modified on: %s
ta: கடைசியாக மாற்றப்பட்டது: %s

# webdav_screen_delete
source: Delete
ta: நீக்கு

# webdav_screen_remote_recycle_bin_is_empty
source: Empty~
ta: வெற்று ~

# appearance_screen_wallpaper_colors
source: Wallpaper colors
ta: வால்பேப்பர் வண்ணங்கள்

source: Primary color
ta: முதன்மை நிறம்

# theme_no_palettes
source: No palettes
ta: தட்டுகள் இல்லை

# appearance_screen_basic_colors
source: Basic colors
ta: அடிப்படை வண்ணங்கள்

# dark_mode_invalid
source: Invalid value
ta: தவறான மதிப்பு

# password_visibility_off
source: Hide
ta: மறை

# password_visibility_on
source: Show
ta: காட்டு

# clear_input_text
source: Clear
ta: தெளிவான

source: Paste
ta: ஒட்டு

# webdav_screen_info_incomplete
source: WebDAV information is incomplete!
ta: WebDav செய்தி முழுமையடையாது!

# data_screen_name
source: Data
ta: தகவல்கள்

# data_screen_import_export_description
source: Sync sticker data
ta: ச்டிக்கர் தரவை ஒத்திசைக்கவும்

# data_screen_delete_all
source: Delete all local stickers
ta: அனைத்து உள்ளக ச்டிக்கர்களையும் நீக்கவும்

# data_screen_delete_all_description
source: Delete all local data managed by Rays, including images, titles and labels. This operation is irreversible
ta: படங்கள், தலைப்புகள் மற்றும் லேபிள்கள் உட்பட கதிர்களால் நிர்வகிக்கப்படும் அனைத்து உள்ளக தரவையும் நீக்கவும். இந்த செயல்பாடு மீளமுடியாதது

# setting_screen_data_description
source: Backup, synchronize, delete sticker data
ta: காப்புப்பிரதி, ஒத்திசைவு, ச்டிக்கர் தரவை நீக்கு

# data_screen_delete_all_success
source: All sticker data cleared, spent %.2fs
ta: அனைத்து ச்டிக்கர் தரவுகளும் அழிக்கப்பட்டன, %.2fs செலவழித்தன

# data_screen_delete_sticker_share_time_success
source: All sticker share statistics cleared, spent %.2fs
ta: அனைத்து ச்டிக்கர் பங்கு புள்ளிவிவரங்கள் அழிக்கப்பட்டன, %.2fs செலவழித்தன

# search_config_screen_intersect_search_by_space
source: Intersection search
ta: குறுக்குவெட்டு தேடல்

# search_config_screen_intersect_search_by_space_description
source: Use spaces to split multiple keywords to achieve the "and" condition
ta: "மற்றும்" நிபந்தனையை அடைய பல முக்கிய வார்த்தைகளைப் பிரிக்க இடங்களைப் பயன்படுத்தவும்

# delete_sticker_failed
source: Delete failed
ta: நீக்கு தோல்வியுற்றது

# export_sticker_success
source: Export successful
ta: ஏற்றுமதி வெற்றிகரமாக

# export_sticker_failed
source: Export failed
ta: ஏற்றுமதி தோல்வியடைந்தது

# export_stickers_result
source: Export %d sticker
ta: ஏற்றுமதி %d ச்டிக்கர்

# webdav_screen_restore
source: Restore
ta: மீட்டமை

# empty_tip
source: Empty~
ta: வெற்று ~

# add_screen_select_sticker
source: Select stickers
ta: ச்டிக்கர்களைத் தேர்ந்தெடுக்கவும்

# add_screen_add_stickers
source: Add stickers
ta: ச்டிக்கர்களைச் சேர்க்கவும்

# add_screen_update_sticker
source: Select a new sticker
ta: புதிய ச்டிக்கரைத் தேர்ந்தெடுக்கவும்

# add_screen_save_all
source: Save all
ta: அனைத்தையும் சேமி

# add_screen_remove_sticker_from_waiting_list
source: Cancel edit
ta: திருத்து நீக்கறல்

# import_export_screen_name
source: Sync data
ta: தரவை ஒத்திசைக்கவும்

source: Send sticker
ta: ச்டிக்கரை அனுப்பவும்

# about_screen_other_works_raca_name
source: Raca (Record All Classic Articles)
ta: RACA (அனைத்து உன்னதமான கட்டுரைகளையும் பதிவு செய்யுங்கள்)

# about_screen_other_works_raca_description
source: A tool to record and search abstract passages and mini-essays in the comments section locally. 🤗 Are you still having trouble remembering the content of your mini-essay and facing the embarrassing situation of forgetting the front, middle and back? Using this tool will help you record the mini-essays you come across and never worry about forgetting them again! 😋
ta: உள்ளூரில் கருத்துகள் பிரிவில் சுருக்க பத்திகள் மற்றும் மினி-எசேக்களை பதிவுசெய்து தேடுவதற்கான ஒரு கருவி. Ming உங்கள் மினி-எச்சேயின் உள்ளடக்கத்தை நினைவில் கொள்வதிலும், முன், நடுத்தர மற்றும் பின்புறத்தை மறந்துவிடும் சங்கடமான சூழ்நிலையை எதிர்கொள்வதிலும் உங்களுக்கு இன்னும் சிக்கல் உள்ளதா? இந்த கருவியைப் பயன்படுத்துவது நீங்கள் சந்திக்கும் மினி-எசசைப் பதிவுசெய்ய உதவும், அவற்றை மீண்டும் மறந்துவிடுவதைப் பற்றி ஒருபோதும் கவலைப்பட வேண்டாம்! .

# about_screen_other_works_night_screen_name
source: Night Screen
ta: இரவு திரை

# about_screen_other_works_night_screen_description
source: When you use your phone at night 🌙, Night Screen can help you reduce the brightness of the screen and reduce the damage to your eyes.
ta: இரவில் உங்கள் தொலைபேசியைப் பயன்படுத்தும்போது, ​​இரவு திரை திரையின் பிரகாசத்தைக் குறைக்கவும், கண்களுக்கு ஏற்படும் சேதத்தைக் குறைக்கவும் உதவும்.

# about_screen_other_works
source: Other works
ta: மற்ற படைப்புகள்

# add_screen_sticker_duplicate
source: The sticker has already been added and is showing the existing information!
ta: ச்டிக்கர் ஏற்கனவே சேர்க்கப்பட்டுள்ளது மற்றும் ஏற்கனவே உள்ள தகவல்களைக் காட்டுகிறது!

# add_screen_suggest_tag
source: Suggested tags
ta: பரிந்துரைக்கப்பட்ட குறிச்சொற்கள்

# ml_screen_name
source: AI
ta: அய்

# setting_screen_ml_description
source: Configure AI models
ta: AI மாதிரிகளை உள்ளமைக்கவும்

# classification_screen_name
source: Sticker classification
ta: ச்டிக்கர் வகைப்பாடு

# classification_screen_description
source: Select a sticker classification model, set confidence thresholds
ta: ஒரு ச்டிக்கர் வகைப்பாடு மாதிரியைத் தேர்ந்தெடுத்து, நம்பிக்கை வாசல்களை அமைக்கவும்

# classification_model_screen_name
source: Classification model
ta: வகைப்பாடு மாதிரி

# classification_model_screen_description
source: Select a machine learning model used for classification stickers
ta: வகைப்பாடு ச்டிக்கர்களுக்குப் பயன்படுத்தப்படும் இயந்திர கற்றல் மாதிரியைத் தேர்ந்தெடுக்கவும்

# classification_model_screen_default
source: Default
ta: இயல்புநிலை

# classification_model_screen_select
source: Select external model
ta: வெளிப்புற மாதிரியைத் தேர்ந்தெடுக்கவும்

# classification_model_screen_select_description
source: Select an external model file (.tflite or .lite)
ta: வெளிப்புற மாதிரி கோப்பைத் தேர்ந்தெடுக்கவும் (.tflite அல்லது .லைட்)

# classification_model_screen_default_name
source: EfficientNet-Lite2
ta: திறமையான-லைட் 2

# appearance_screen_style_category
source: Style
ta: சூல் தண்டு

# search_style_screen_name
source: Search screen style
ta: தேடல் திரை நடை

# detail_screen_sticker_scale
source: Sticker scale
ta: ச்டிக்கர் அளவு

# home_style_screen_show_popular_tags
source: Show popular tags
ta: பிரபலமான குறிச்சொற்களைக் காட்டு

# home_style_screen_show_popular_tags_description
source: Show the tags corresponding to the most shared stickers below the search bar
ta: தேடல் பட்டியின் கீழே மிகவும் பகிரப்பட்ட ச்டிக்கர்களுடன் தொடர்புடைய குறிச்சொற்களைக் காட்டுங்கள்

# home_style_screen_show_last_query
source: Show last query
ta: கடைசி வினவலைக் காட்டு

# home_style_screen_show_last_query_description
source: Show last query string in the search bar when opening the search screen
ta: தேடல் திரையைத் திறக்கும்போது தேடல் பட்டியில் கடைசி வினவல் சரத்தை காட்டு

# default_tag
source: %s (Default)
ta: %s (இயல்புநிலை)

# update_check
source: Check updates
ta: புதுப்பிப்புகளை சரிபார்க்கவும்

# update_no_update
source: Already the latest version!
ta: ஏற்கனவே அண்மைக் கால பதிப்பு!

# update_newer
source: New version
ta: புதிய பதிப்பு

# update_newer_text
source: New version: %1$s Published on: %2$s Downloads: %3$s
ta: புதிய பதிப்பு: %1$s வெளியிடப்பட்டது: %2$s பதிவிறக்கங்கள்: %3$s

# download_update
source: Download
ta: பதிவிறக்கம்

# update_ignore
source: Ignore this update
ta: இந்த புதுப்பிப்பை புறக்கணிக்கவும்

# update_check_failed
source: Check for update failed: %s
ta: புதுப்பிப்புக்கான சோதனை தோல்வியுற்றது: %s

# sticker_create_time
source: Create time
ta: நேரத்தை உருவாக்குங்கள்

# sticker_modify_time
source: Modify time
ta: நேரத்தை மாற்றவும்

# search_result_sort_tag_count
source: Number of tags
ta: குறிச்சொற்களின் எண்ணிக்கை

# search_result_sort_title
source: Title
ta: தலைப்பு

# search_result_sort
source: Sort
ta: வரிசைப்படுத்து

# search_result_reverse
source: Reverse
ta: தலைகீழ்

# multi_select
source: Select
ta: தேர்ந்தெடு

# invert_selection
source: Invert
ta: தலைகீழ்

# home_screen_search_result_list_to_top
source: To the top
ta: மேலே

# webdav_screen_progress_upload_data_sticker
source: Updating remote data + sticker
ta: தொலைநிலை தரவு + ச்டிக்கரைப் புதுப்பித்தல்

# webdav_screen_progress_logical_delete_remote
source: Moving to remote recycle bin
ta: தொலை மறுசுழற்சி தொட்டிக்கு நகரும்

# webdav_screen_progress_upload_data
source: Updating remote data
ta: தொலைநிலை தரவைப் புதுப்பித்தல்

# webdav_screen_progress_download_data_sticker
source: Updating local data + sticker
ta: உள்ளக தரவு + ச்டிக்கரைப் புதுப்பித்தல்

# webdav_screen_progress_download_data
source: Updating local data
ta: உள்ளக தரவைப் புதுப்பித்தல்

# webdav_screen_progress_delete
source: Deleting local data + sticker
ta: உள்ளக தரவு + ச்டிக்கரை நீக்குகிறது

# webdav_screen_progress_refresh_backup_info
source: Updating backup information
ta: காப்புப்பிரதி தகவல்களைப் புதுப்பித்தல்

# data_sync_warning
source: Please do not force kill the app or disconnect the network when pushing and pulling, as this may corrupt the data!
ta: தயவுசெய்து பயன்பாட்டைக் கொல்லவோ அல்லது தள்ளும் போது பிணையத்தை துண்டிக்கவோ அல்லது இழுக்கவோ கட்டாயப்படுத்த வேண்டாம், ஏனெனில் இது தரவை சிதைக்கக்கூடும்!

# detail_screen_sticker_info
source: Sticker info
ta: ச்டிக்கர் செய்தி

# detail_screen_sticker_info_md5
source: Sticker MD5
ta: ச்டிக்கர் MD5

# detail_screen_sticker_info_last_modified_time
source: Last modified time
ta: கடைசி மாற்றியமைக்கப்பட்ட நேரம்

# home_screen_select_export_folder
source: Select export folder
ta: ஏற்றுமதி கோப்புறையைத் தேர்ந்தெடுக்கவும்

# home_screen_select_export_folder_tip
source: Please select an export folder
ta: ஏற்றுமதி கோப்புறையைத் தேர்ந்தெடுக்கவும்

# db_sticker_table
source: Sticker table
ta: ச்டிக்கர் அட்டவணை

# db_sticker_table_title
source: Title
ta: தலைப்பு

# db_tag_table
source: Tag table
ta: குறிச்சொல் அட்டவணை

# db_tag_table_tag
source: Tag
ta: குறிச்சொல்

# image_scale_crop
source: Crop
ta: பயிர்

# image_scale_inside
source: Inside
ta: உள்ளே

# image_scale_fill_width
source: Fill width
ta: அகலம் நிரப்பவும்

# image_scale_fill_height
source: Fill height
ta: உயரத்தை நிரப்பவும்

# image_scale_fit
source: Fit
ta: பொருத்தம்

# image_scale_fill_bounds
source: Fill bounds
ta: எல்லைகளை நிரப்பவும்

# sticker_click_count
source: Click count
ta: எண்ணிக்கை என்பதைக் சொடுக்கு செய்க

# sticker_share_count
source: Share count
ta: பங்கு எண்ணிக்கை

# share_config_screen_name
source: Share
ta: பங்கு

# uri_string_share_screen_name
source: URI string share
ta: யூரி சரம் பங்கு

# uri_string_share_screen_description
source: Copy sticker URI string when sharing
ta: பகிரும்போது ச்டிக்கர் யூரி சரத்தை நகலெடுக்கவும்

source: Enable
ta: இயக்கு

# uri_string_share_screen_add_app_package
source: Add package
ta: தொகுப்பு சேர்க்கவும்

# uri_string_share_screen_add_app_package_example
source: e.g., com.skyd.example
ta: எ.கா., com.skyd.example

# uri_string_share_repo_no_package
source: This package is unavailable: %s
ta: இந்த தொகுப்பு கிடைக்கவில்லை: %s

# setting_screen_share_config_description
source: Sticker file extension, URI string share
ta: ச்டிக்கர் கோப்பு நீட்டிப்பு, யூரி சரம் பகிர்வு

# share_config_screen_file_extension
source: File extension
ta: கோப்பு நீட்டிப்பு

# share_config_screen_file_extension_description
source: Add the file extension name when sharing a sticker
ta: ச்டிக்கரைப் பகிரும்போது கோப்பு நீட்டிப்பு பெயரைச் சேர்க்கவும்

# share_config_screen_copy_sticker_to_clipboard
source: Copy when sharing
ta: பகிரும்போது நகலெடுக்கவும்

# share_config_screen_copy_sticker_to_clipboard_description
source: Copy the stickers to clipboard while sharing
ta: பகிர்வின் போது ச்டிக்கர்களை இடைநிலைப்பலகைக்கு நகலெடுக்கவும்
