Repository: 247i/TACETr
Catalog: உரை/தானி/readrops-strings-*.po
Languages: ta

source: Add feed
ta: ஊட்டத்தைச் சேர்க்கவும்

source: Settings
ta: அமைப்புகள்

# add_feed_title
source: Add feed
ta: ஊட்டத்தைச் சேர்க்கவும்

source: Feed url
ta: முகவரி க்கு உணவளிக்கவும்

source: Validate
ta: சரிபார்க்கவும்

# empty_field
source: Field can't be empty
ta: புலம் காலியாக இருக்க முடியாது

# wrong_url
source: Input is not a valid URL
ta: உள்ளீடு சரியான முகவரி அல்ல

# add_feed_connexion_error
source: Connection error
ta: இணைப்பு பிழை

# add_feed_unknownhost_error
source: Unknown host
ta: தெரியாத புரவலன்

# read_time
source: %1$s min
ta: %1$s மணித்துளி

# read_time_lower_than_1
source: <1 min
ta: <1 மணித்துளி

# read_time_one_minute
source: 1 min
ta: 1 மணித்துளி

source: Share Article
ta: கட்டுரை பகிர்ந்து கொள்ளுங்கள்

source: Open url
ta: திறந்த முகவரி

source: Add folder
ta: கோப்புறையைச் சேர்

source: Feed name
ta: உணவுப் பெயர்

source: Edit feed
ta: ஊட்டத்தைத் திருத்து

source: No folder
ta: கோப்புறை இல்லை

source: Cancel
ta: ரத்துசெய்

source: Delete feed?
ta: ஊட்டத்தை நீக்கவா?

# feed_insertion_successfull
source: Feed %1$s added successfully
ta: %1$s ஐ வெற்றிகரமாகச் சேர்க்கவும்

# feed_insertion_network_failed
source: Network failure when accessing feed %1$s
ta: ஊட்டத்தை அணுகும்போது பிணையம் தோல்வி %1$s

# feed_insertion_parse_failed
source: Failure when parsing feed %1$s
ta: ஊட்டத்தை பாகுபடுத்தும்போது தோல்வி %1$s

# feed_insertion_wrong_format
source: Wrong format for feed %1$s
ta: ஊட்டத்திற்கான தவறான வடிவம் %1$s

# feed_insertion_unknown_error
source: Unknown error for feed %1$s
ta: ஊட்டத்திற்கு தெரியாத பிழை %1$s

source: Articles
ta: கட்டுரைகள்

source: Show read articles
ta: வாசிப்பு கட்டுரைகளைக் காட்டு

# mark_unread
source: Mark as non read
ta: படிக்காத எனக் குறிக்கவும்

# mark_read
source: Mark as read
ta: படித்தபடி குறி

source: Account url
ta: கணக்கு முகவரி

source: Account name
ta: கணக்கு பெயர்

source: Login
ta: புகுபதிவு

source: Password
ta: கடவுச்சொல்

# password_helper
source: This is your FreshRSS API password (Configuration > Profile)
ta: இது உங்கள் ஃப்ரெச்ஆர்எச்எச் பநிஇ கடவுச்சொல் (உள்ளமைவு> சுயவிவரம்)

source: Add account
ta: கணக்கைச் சேர்க்கவும்

source: No feed
ta: ஊட்டம் இல்லை

# choose_account
source: Choose an account
ta: ஒரு கணக்கைத் தேர்வுசெய்க

source: Account
ta: கணக்கு

source: Feeds
ta: ஊட்டங்கள்

source: Edit folder
ta: கோப்புறையைத் திருத்து

source: Delete folder ?
ta: கோப்புறையை நீக்கவா?

source: Delete account
ta: கணக்கை நீக்கு

# delete_account_question
source: Delete account ?
ta: கணக்கை நீக்கவா?

# feed_deleted
source: The feed %1$s has been deleted
ta: தீவனம் %1$s நீக்கப்பட்டது

# feed_doesnt_exist
source: The feed %1$s doesn't exist on the server
ta: ஊட்டம் %1$s சேவையகத்தில் இல்லை

# error_occured
source: An error occurred
ta: பிழை ஏற்பட்டது

# folder_already_exists
source: The folder already exists
ta: கோப்புறை ஏற்கனவே உள்ளது

# folder_doesnt_exist
source: The folder doesn't exist on the server
ta: கோப்புறை சேவையகத்தில் இல்லை

source: Credentials
ta: நற்சான்றிதழ்கள்

# filter_newest
source: Newest to oldest
ta: புதியது முதல் பழமையானது

# filter_oldest
source: Oldest to newest
ta: பழமையானது முதல் புதியது

# login_failed
source: Login failed. Please check your credentials
ta: உள்நுழைவு தோல்வியடைந்தது. உங்கள் சான்றுகளை சரிபார்க்கவும்

source: New account
ta: புதிய கணக்கு

source: Local
ta: உள்ளக

source: Delete
ta: நீக்கு

# app_licence
source: App released under the GPLv3 licence
ta: GPLV3 உரிமத்தின் கீழ் வெளியிடப்பட்ட பயன்பாடு

source: Get feeds colors
ta: ஊட்டங்களின் வண்ணங்களைப் பெறுங்கள்

source: Global
ta: உலகளாவிய

source: Open items in
ta: திறந்த உருப்படிகளைத் திறக்கவும்

# external_navigator
source: External web browser
ta: வெளிப்புற வலை உலாவி

source: Share URL
ta: முகவரி ஐப் பகிரவும்

source: OPML Import/Export
ta: OPML இறக்குமதி/ஏற்றுமதி

source: OPML import
ta: OPML இறக்குமதி

source: OPML export
ta: OPML ஏற்றுமதி

source: Image Options
ta: பட விருப்பங்கள்

source: Download image
ta: படத்தைப் பதிவிறக்கவும்

source: Share image
ta: படத்தைப் பகிரவும்

source: Theme
ta: கருப்பொருள்

source: Light
ta: ஒளி

source: Dark
ta: இருண்ட

source: New feed
ta: புதிய ஊட்டம்

# auto_synchro
source: Automatic synchronisation
ta: தானியங்கி ஒத்திசைவு

source: Manual
ta: கையேடு

# min_30
source: 30 min
ta: 30 மணித்துளி

# hour_1
source: 1 hour
ta: 1 மணி நேரம்

# hour_2
source: 2 hours
ta: 2 மணி நேரம்

# hour_3
source: 3 hours
ta: 3 மணி நேரம்

# hour_6
source: 6 hours
ta: 6 மணி நேரம்

# hour_12
source: 12 hours
ta: 12 மணி நேரம்

source: Every day
ta: தினமும்

# account_synchro
source: Accounts synchronisation
ta: கணக்குகள் ஒத்திசைவு

# new_items
source: %1$s new articles
ta: %1$s புதிய கட்டுரைகள்

source: Notifications
ta: அறிவிப்புகள்

# auto_synchro_disabled
source: Automatic synchronization is disabled
ta: தானியங்கி ஒத்திசைவு முடக்கப்பட்டுள்ளது

# enable_auto_synchro_text
source: To be displayed, notifications need background synchronization to be activated. Do you want to open settings?
ta: காண்பிக்கப்படுவதற்கு, அறிவிப்புகளுக்கு பின்னணி ஒத்திசைவு செயல்படுத்தப்பட வேண்டும். அமைப்புகளைத் திறக்க விரும்புகிறீர்களா?

source: Open
ta: திற

source: Back
ta: பின்

source: Synchronize
ta: ஒத்திசைக்கவும்

source: Navigator view
ta: நேவிகேட்டர் பார்வை

source: Favorites
ta: பிடித்தவை

# system
source: System theme
ta: கணினி கருப்பொருள்

# hide_feeds
source: Hide feeds without new items
ta: புதிய உருப்படிகள் இல்லாமல் ஊட்டங்களை மறைக்கவும்

source: Mark items read on scroll
ta: சுருளில் படித்த உருப்படிகளைக் குறிக்கவும்

source: New articles
ta: புதிய கட்டுரைகள்

source: Filters
ta: வடிப்பான்கள்

# error_occurred
source: An error occurred
ta: பிழை ஏற்பட்டது

source: Details
ta: விவரங்கள்

source: Synchronization errors
ta: ஒத்திசைவு பிழைகள்

# error_occurred_feed
source: An error occurred for the following feed:
ta: பின்வரும் ஊட்டத்திற்கு பிழை ஏற்பட்டது:

# unreachable_feed_http_error
source: Unreachable feed, HTTP error %1$s
ta: அணுக முடியாத ஊட்டம், http பிழை %1$s

# network_failure
source: Network failure: %1$s
ta: பிணையம் தோல்வி: %1$s

source: Processing feed error
ta: தீவன பிழை செயலாக்க

source: Unreachable URL
ta: அணுக முடியாத முகவரி

# unable_open_file
source: Unable to open file
ta: கோப்பைத் திறக்க முடியவில்லை

# http_error_400
source: HTTP error 400, please check your server URL
ta: HTTP பிழை 400, உங்கள் சேவையக முகவரி ஐ சரிபார்க்கவும்

# http_error_401
source: HTTP error 401, please check your credentials
ta: HTTP பிழை 401, தயவுசெய்து உங்கள் சான்றுகளை சரிபார்க்கவும்

# http_error_403
source: HTTP error 403, access forbidden
ta: HTTP பிழை 403, அணுகல் தடைசெய்யப்பட்டுள்ளது

# http_error_404
source: HTTP error 404, URL not found
ta: HTTP பிழை 404, முகவரி கிடைக்கவில்லை

# http_error_4XX
source: HTTP error %1$d, please check your fields
ta: HTTP பிழை %1$d, தயவுசெய்து உங்கள் புலங்களைச் சரிபார்க்கவும்

# http_error_5XX
source: HTTP error %1$d, server error
ta: Http பிழை %1$d, சேவையக பிழை

# http_error
source: HTTP error %1$d
ta: Http பிழை %1$d

# feed_url_read_only
source: The API doesn't support Feed URL modification
ta: ஊட்ட முகவரி மாற்றத்தை பநிஇ ஆதரிக்காது

# updating_account
source: Updating %1$s account
ta: %1$s கணக்கைப் புதுப்பித்தல்

source: Enable all
ta: அனைத்தையும் இயக்கு

source: Disable all
ta: அனைத்தையும் முடக்கு

source: Open source libraries
ta: திறந்த மூல நூலகங்கள்

# make_donation
source: Make a donation
ta: நன்கொடை செய்யுங்கள்

source: Other accounts
ta: பிற கணக்குகள்

source: Update
ta: புதுப்பிப்பு

source: Rename account
ta: கணக்கு மறுபெயரிடுங்கள்

source: Name
ta: பெயர்

source: URL
ta: முகவரி

# unread
source: %1$d unread
ta: %1$d படிக்கவில்லை

source: Preferences
ta: விருப்பத்தேர்வுகள்

# item_view
source: Article view
ta: கட்டுரை பார்வை

source: Timeline
ta: காலவரிசை

# hide_feeds_subtitle
source: Feeds with no left unread items will be hidden in the drawer
ta: இடது படிக்காத உருப்படிகள் இல்லாத ஊட்டங்கள் டிராயரில் மறைக்கப்படும்

source: Compact
ta: கச்சிதமான

source: Regular
ta: வழக்கமான

source: Large
ta: பெரிய

source: Item size
ta: உருப்படி அளவு

# background_sync_already_running
source: A background synchronization is already running
ta: பின்னணி ஒத்திசைவு ஏற்கனவே இயங்குகிறது

source: Disable battery optimization
ta: பேட்டரி தேர்வுமுறை முடக்கு

# disable_battery_optimization_subtitle
source: Can help with background synchronization not being killed by the system
ta: கணினியால் கொல்லப்படாத பின்னணி ஒத்திசைவு உதவ முடியும்

# battery_optimization_already_disabled
source: Battery optimization already disabled for this app
ta: இந்த பயன்பாட்டிற்கு பேட்டரி தேர்வுமுறை ஏற்கனவே முடக்கப்பட்டுள்ளது

source: OPML export success
ta: OPML ஏற்றுமதி செய்

# add_to_favorite
source: Add to favorites
ta: பிடித்தவைகளில் சேர்க்கவும்

# grant_access_notifications
source: Grant access to Notifications
ta: அறிவிப்புகளுக்கு அணுகல் வழங்கவும்

# system_notifications_disabled
source: System notifications are currently disabled. Click here to enable them
ta: கணினி அறிவிப்புகள் தற்போது முடக்கப்பட்டுள்ளன. அவற்றை இயக்க இங்கே சொடுக்கு செய்க

# show_notifications_background_sync
source: Show notifications after background synchronization
ta: பின்னணி ஒத்திசைவுக்குப் பிறகு அறிவிப்புகளைக் காட்டு

# background_sync_new_articles
source: Be notified of new articles after background synchronization
ta: பின்னணி ஒத்திசைவுக்குப் பிறகு புதிய கட்டுரைகள் குறித்து அறிவிக்கப்படும்

# no_article
source: No articles
ta: பொதுவிதிகள் இல்லை

source: No RSS feed found
ta: ஆர்.எச்.எச் ஊட்டம் எதுவும் கிடைக்கவில்லை

# not_valid_rss_feed
source: The provided URL is not a valid RSS feed
ta: வழங்கப்பட்ட முகவரி சரியான RSS ஊட்டம் அல்ல

source: More
ta: மேலும்

source: Show oldest articles first
ta: முதலில் பழமையான கட்டுரைகளை காட்டு

# delete_feed_question
source: Do you want to delete feed %1$s?
ta: ஊட்டத்தை %1$s ஐ நீக்க விரும்புகிறீர்களா?

# delete_folder_question
source: Do you want to delete folder %1$s? All linked feeds will also be deleted.
ta: கோப்புறையை %1$s ஐ நீக்க விரும்புகிறீர்களா? இணைக்கப்பட்ட அனைத்து ஊட்டங்களும் நீக்கப்படும்.

source: Update color
ta: வண்ணத்தைப் புதுப்பிக்கவும்

source: External
ta: வெளிப்புறம்

# mark_all_articles_read
source: Mark all articles as read
ta: எல்லா கட்டுரைகளையும் வாசித்தபடி குறிக்கவும்

# mark_all_articles_read_question
source: Do you really want to mark all items as read?
ta: எல்லா உருப்படிகளையும் படிக்க நீங்கள் உண்மையில் குறிக்க விரும்புகிறீர்களா?

source: Readrops crashed.
ta: ரீட் ராப்ச் செயலிழந்தது.

# crash_message
source: I you see this, it means the app ran into an unexpected error. Please if you can, report the error on Github.
ta: இதை நீங்கள் காண்கிறீர்கள், இதன் பொருள் பயன்பாடு எதிர்பாராத பிழையில் இயங்கியது. தயவுசெய்து உங்களால் முடிந்தால், கிட்அப்பில் பிழையைப் புகாரளிக்கவும்.

# report_error_github
source: Report the error on Github
ta: கிட்அப்பில் பிழையைப் புகாரளிக்கவும்

# copy_error_clipboard
source: Copy error to clipboard
ta: பிழையை இடைநிலைப்பலகைக்கு நகலெடுக்கவும்

source: Copied!
ta: நகலெடுக்கப்பட்டது!

source: Bitcoin (copy address)
ta: பிட்காயின் (நகல் முகவரி)

source: Litecoin (copy address)
ta: லிட்காயின் (நகல் முகவரி)

# donation_text
source: I you find my work useful and you would like to support me, you can consider making me a donation.
ta: நான் எனது வேலையை பயனுள்ளதாகக் கருதுகிறேன், நீங்கள் என்னை ஆதரிக்க விரும்புகிறீர்கள், என்னை நன்கொடையாக மாற்றுவதை நீங்கள் கருத்தில் கொள்ளலாம்.

source: Downloaded file!
ta: பதிவிறக்கம் செய்யப்பட்ட கோப்பு!

# provide_full_url
source: Please provide the full API URL
ta: முழு பநிஇ முகவரி ஐ வழங்கவும்

# provide_root_url
source: Please provide the service root URL
ta: பணி ரூட் முகவரி ஐ வழங்கவும்

# order_field_tooltip
source: RSS feeds always contain old articles it is unlikely you will see in your timeline if you order it by date. Ordering by article identifier lets you show all new inserted articles whatever date they might have.
ta: ஆர்எச்எச் ஊட்டங்கள் எப்போதுமே பழைய கட்டுரைகளைக் கொண்டிருக்கின்றன, நீங்கள் தேதியின்படி ஆர்டர் செய்தால் உங்கள் காலவரிசையில் நீங்கள் காண்பது சாத்தியமில்லை. கட்டுரை அடையாளங்காட்டி மூலம் ஆர்டர் செய்வது, புதிய செருகப்பட்ட கட்டுரைகள் அனைத்தையும் அவர்கள் வைத்திருந்த தேதியைக் காட்ட உங்களை அனுமதிக்கிறது.

source: Date
ta: திகதி

source: Identifier
ta: அடையாளங்காட்டி

source: Ascending
ta: ஏறுதல்

source: Descending
ta: இறங்கு

source: Order by
ta: வழங்கியவர்

source: With direction
ta: திசையுடன்

# choose_folder
source: Choose a folder
ta: ஒரு கோப்புறையைத் தேர்வுசெய்க

# selected
source: (%1$s selected)
ta: (%1$s தேர்ந்தெடுக்கப்பட்டது)

# add_selected_feeds
source: Add %1$s selected feeds
ta: %1$s தேர்ந்தெடுக்கப்பட்ட ஊட்டங்களைச் சேர்க்கவும்

# enter_url
source: Enter an URL
ta: ஒரு முகவரி ஐ உள்ளிடவும்

source: Feed already exists
ta: ஊட்டம் ஏற்கனவே உள்ளது

source: Invalid folder
ta: தவறான கோப்புறை

source: Invalid feed
ta: தவறான ஊட்டம்

# error_image_download
source: An error occurred while downloading the image
ta: படத்தைப் பதிவிறக்கும் போது பிழை ஏற்பட்டது

source: Enable notifications
ta: அறிவிப்புகளை இயக்கவும்

# account_notifications_disabled
source: Account notifications are currently disabled
ta: கணக்கு அறிவிப்புகள் தற்போது முடக்கப்பட்டுள்ளன

source: Open Feed in
ta: திறந்த தீவனம்

source: Local view
ta: உள்ளக பார்வை

source: External view
ta: வெளிப்புற பார்வை

# do_not_ask_again_next_feeds
source: Do not ask me again for next feeds
ta: அடுத்த ஊட்டங்களுக்கு மீண்டும் என்னிடம் கேட்க வேண்டாம்

source: Default category
ta: இயல்புநிலை வகை

source: Synchronize at launch
ta: துவக்கத்தில் ஒத்திசைக்கவும்

source: Feed color
ta: உணவு நிறம்

source: Preview
ta: முன்னோட்டம்

source: Select color
ta: வண்ணத்தைத் தேர்ந்தெடுக்கவும்

source: Reset
ta: மீட்டமை

source: Actions
ta: செயல்கள்

# reload_color_favicon
source: Reload color from Favicon
ta: ஃபாவிகானிலிருந்து வண்ணத்தை மீண்டும் ஏற்றவும்

# load_color_new_favicon
source: Load color from a new favicon
ta: புதிய ஃபாவிகானிலிருந்து வண்ணத்தை ஏற்றவும்

# error_occurred_reloading_favicon_color
source: An error occurred while reloading favicon color
ta: ஃபாவிகான் வண்ணத்தை மீண்டும் ஏற்றும்போது பிழை ஏற்பட்டது

source: Use default color
ta: இயல்புநிலை நிறத்தைப் பயன்படுத்தவும்

source: Warning
ta: எச்சரிக்கை

# understand
source: I understand
ta: எனக்கு புரிகிறது

# greader_warning
source: Google Reader is a very old API and lack documentation. It may not be implemented in every aggregator the same way and thus might not work well. If you encounter any synchronization problem, please report them to Readrops Github repository.
ta: கூகிள் ரீடர் மிகவும் பழைய பநிஇ மற்றும் ஆவணங்கள் இல்லாதது. இது ஒவ்வொரு திரட்டலிலும் ஒரே மாதிரியாக செயல்படுத்தப்படாமல் போகலாம், இதனால் சரியாக வேலை செய்யாது. ஏதேனும் ஒத்திசைவு சிக்கலை நீங்கள் சந்தித்தால், தயவுசெய்து அவற்றை அறிவிலிமையம் களஞ்சியத்தை ரீட் ராப் செய்ய புகாரளிக்கவும்.

# fever_warning
source: Fever is a very old, limited and depreciated API. It doesn't support feed and folder management. It is also poorly documented, may not be implemented in every aggregator the same way and thus might not work well. If you encounter any synchronization problem, please report them to Readrops Github repository.
ta: காய்ச்சல் மிகவும் பழமையான, வரையறுக்கப்பட்ட மற்றும் மதிப்பிழந்த பநிஇ. இது தீவனம் மற்றும் கோப்புறை நிர்வாகத்தை ஆதரிக்காது. இது மோசமாக ஆவணப்படுத்தப்பட்டுள்ளது, ஒவ்வொரு திரட்டியிலும் அதே வழியில் செயல்படுத்தப்படாமல் போகலாம், இதனால் நன்றாக வேலை செய்யாது. ஏதேனும் ஒத்திசைவு சிக்கலை நீங்கள் சந்தித்தால், தயவுசெய்து அவற்றை அறிவிலிமையம் களஞ்சியத்தை ரீட் ராப் செய்ய புகாரளிக்கவும்.

source: API
ta: பநிஇ
