Repository: 247i/TACETr
Catalog: உரை/தானி/requirements-bazaar-web-frontend-*.po
Languages: ta

source: Settings
ta: அமைப்புகள்

# lp-title
source: We Connect the People That Matter
ta: முக்கியமானவர்களை நாங்கள் இணைக்கிறோம்

# lp-desc
source: Requirements Bazaar allows users to discuss innovative ideas so that developers can focus on features that really matter.
ta: தேவைகள் கடைவீதி பயனர்களை புதுமையான யோசனைகளைப் பற்றி விவாதிக்க அனுமதிக்கிறது, இதனால் உருவாக்குபவர்கள் உண்மையில் முக்கியமான அம்சங்களில் கவனம் செலுத்த முடியும்.

# landing-welcome
source: Welcome to Requirements Bazaar!
ta: தேவைகள் கடைவீதி வரவேற்கிறோம்!

# landing-how-it-works
source: How It Works
ta: இது எவ்வாறு இயங்குகிறது

# landing-step-1
source: 1. Create a project
ta: 1. ஒரு திட்டத்தை உருவாக்கவும்

# landing-step-2
source: 2. Invite users to your project
ta: 2. உங்கள் திட்டத்திற்கு பயனர்களை அழைக்கவும்

# landing-step-3
source: 3. Respond to requirements from your community
ta: 3. உங்கள் சமூகத்தின் தேவைகளுக்கு பதிலளிக்கவும்

# landing-try-it-out
source: Try It Out
ta: அதை முயற்சிக்கவும்

# landing-reqBazInNumbers
source: Requirements Bazaar in Numbers
ta: எண்களில் தேவைகள் கடைவீதி

# landing-projectsCountLabel
source: Projects
ta: திட்டங்கள்

# landing-requirementsCountLabel
source: Requirements
ta: தேவைகள்

# landing-commentsCountLabel
source: Comments
ta: கருத்துகள்

# landing-activeUsersCountLabel
source: Active Users
ta: செயலில் உள்ள பயனர்கள்

# landing-activeUsersCountRangeLabel
source: in the last year
ta: கடந்த ஆண்டில்

# landing-lastMonthLabel
source: last month
ta: கடந்த மாதம்

# landing-features
source: Features
ta: நற்பொருத்தங்கள்

# landing-featureDiscussTitle
source: Discuss with Users
ta: பயனர்களுடன் கலந்துரையாடுங்கள்

# landing-featureDiscussText
source: Discuss new ideas, and innovate together with your end-users.
ta: புதிய யோசனைகளைப் பற்றி விவாதிக்கவும், உங்கள் இறுதி பயனர்களுடன் சேர்ந்து புதுமைப்படுத்தவும்.

# landing-featureVoteTitle
source: Vote for Requirements
ta: தேவைகளுக்கு வாக்களியுங்கள்

# landing-featureVoteText
source: Let users vote for requirements to help developers prioritizing the right features.
ta: சரியான அம்சங்களுக்கு முன்னுரிமை அளிக்க டெவலப்பர்களுக்கு உதவ பயனர்கள் தேவைகளுக்கு வாக்களிக்கட்டும்.

# landing-featureGitHubTitle
source: Link to GitHub
ta: கிதுபுடனான இணைப்பு

# landing-featureGitHubText
source: Link your project to a GitHub repository to keep requirements engineering and development in sync.
ta: தேவைகள் பொறியியல் மற்றும் வளர்ச்சியை ஒத்திசைவில் வைத்திருக்க உங்கள் திட்டத்தை அறிவிலிமையம் களஞ்சியத்துடன் இணைக்கவும்.

# landing-featuredProjects-title
source: Featured Projects
ta: பிரத்யேக திட்டங்கள்

# landing-featuredProjects-text
source: Check out some of our most interesting projects to get to know Requirements Bazaar in more detail.
ta: தேவைகள் பசாரை இன்னும் விரிவாக அறிய எங்கள் மிகவும் சுவையான சில திட்டங்களைப் பாருங்கள்.

# landing-reqBazProject-description
source: New ideas for Requirements Bazaar itself are also tracked and discussed directly on the platform. Feel free to submit your own ideas or discuss the project with other users.
ta: தேவைகளுக்கான புதிய சிந்தனைகள் கடைவீதி தானே கண்காணிக்கப்பட்டு நேரடியாக மேடையில் விவாதிக்கப்படுகிறது. உங்கள் சொந்த யோசனைகளைச் சமர்ப்பிக்க தயங்க அல்லது மற்ற பயனர்களுடன் திட்டத்தைப் பற்றி விவாதிக்கவும்.

# landing-reqBazProject-cardPlaceholder
source: Click here to open the Requirements Bazaar project!
ta: தேவைகள் கடைவீதி திட்டத்தைத் திறக்க இங்கே சொடுக்கு செய்க!

# projects-exploreText
source: Take a look at the public projects on Requirements Bazaar.
ta: தேவைகள் கடைவீதி குறித்த பொதுத் திட்டங்களைப் பாருங்கள்.

# projects-addNewProject
source: Add new Project...
ta: புதிய திட்டத்தைச் சேர்க்கவும் ...

# projects-featuredProjects
source: Featured Projects
ta: பிரத்யேக திட்டங்கள்

# projects-getFeaturedContactUs
source: Contact us to get featured!
ta: இடத்தைப் பெற எங்களைத் தொடர்பு கொள்ளுங்கள்!

# projects-allProjects
source: All Projects
ta: அனைத்து திட்டங்களும்

# projects-signInToCreateProjectHeader
source: Login
ta: புகுபதிவு

# projects-signInToCreateProjectMessage
source: You need to sign in to create a project.
ta: ஒரு திட்டத்தை உருவாக்க நீங்கள் உள்நுழைய வேண்டும்.

# signInToCreateCategory
source: You need to sign in to create a category.
ta: ஒரு வகையை உருவாக்க நீங்கள் உள்நுழைய வேண்டும்.

# signInToCreateRequirement
source: You need to sign in to create a requirement.
ta: ஒரு தேவையை உருவாக்க நீங்கள் உள்நுழைய வேண்டும்.

# signInToFollowProject
source: You need to sign in to follow a project.
ta: ஒரு திட்டத்தைப் பின்பற்ற நீங்கள் உள்நுழைய வேண்டும்.

# signInToFollowCategory
source: You need to sign in to follow a category.
ta: ஒரு வகையைப் பின்பற்ற நீங்கள் உள்நுழைய வேண்டும்.

# signInToVoteRequirement
source: You need to sign in to vote for a requirement.
ta: தேவைக்கு வாக்களிக்க நீங்கள் உள்நுழைய வேண்டும்.

# linkRepository-dialogHeader
source: Link GitHub repository
ta: அறிவிலிமையம் களஞ்சியத்தை இணைக்கவும்

# linkRepository-pasteUrlInstruction
source: To get started, first, paste the base URL of a GitHub Repository that should be connected to this project.
ta: தொடங்குவதற்கு, முதலில், இந்த திட்டத்துடன் இணைக்கப்பட வேண்டிய ஒரு அறிவிலிமையம் களஞ்சியத்தின் அடிப்படை முகவரி ஐ ஒட்டவும்.

# linkRepository-urlInvalid
source: Please enter a valid GitHub repository URL
ta: செல்லுபடியாகும் அறிவிலிமையம் களஞ்சிய முகவரி ஐ உள்ளிடவும்

# gitHubSetup-configureWebhookInstruction
source: Now, you need to configure a webhook for the GitHub repository that should be connected to this project.
ta: இப்போது, ​​இந்த திட்டத்துடன் இணைக்கப்பட வேண்டிய அறிவிலிமையம் களஞ்சியத்திற்கான ஒரு வெப்ஊக்கை நீங்கள் கட்டமைக்க வேண்டும்.

# gitHubSetup-pleaseGoTo
source: Please go to
ta: தயவுசெய்து செல்லுங்கள்

# gitHubSetup-andConfigureValues
source: and configure the following values:
ta: பின்வரும் மதிப்புகளை உள்ளமைக்கவும்:

# gitHubSetup-payloadUrlLabel
source: Payload URL
ta: தாங்குசுமை முகவரி

# gitHubSetup-contentTypeLabel
source: Content-type
ta: உள்ளடக்க வகை

# gitHubSetup-secretLabel
source: Secret
ta: மறைபொருள்

# gitHubSetup-eventsLabel
source: Which events would you like to trigger this webhook?
ta: இந்த வெப்ஊக்கை எந்த நிகழ்வுகளைத் தூண்ட விரும்புகிறீர்கள்?

# gitHubSetup-eventsLabel-hint
source: Select one of the following
ta: பின்வருவனவற்றில் ஒன்றைத் தேர்ந்தெடுக்கவும்

# gitHubSetup-eventsLabel-optionAllEvents
source: 'Send me everything.'
ta: 'எல்லாவற்றையும் எனக்கு அனுப்புங்கள்.'

# gitHubSetup-eventsLabel-optionSpecificEvents
source: 'Select inividual events': Issues, Pull Requests, and Releases
ta: 'தனிப்பட்ட நிகழ்வுகளைத் தேர்ந்தெடுக்கவும்': சிக்கல்கள், இழுவை கோரிக்கைகள் மற்றும் வெளியீடுகள்

# gitHubSetup-goToGitHubSettings
source: Go to GitHub Settings
ta: அறிவிலிமையம் அமைப்புகளுக்குச் செல்லுங்கள்

# gitHubUrlLabel
source: GitHub URL
ta: அறிவிலிமையம் முகவரி

# projectDetails-newRelease
source: New Release Available
ta: புதிய வெளியீடு கிடைக்கிறது

# projectDetails-connectToGitHub
source: Connect to GitHub
ta: கிட்அப்புடன் இணைக்கவும்

# projectDetails-showOnGitHub
source: Show on GitHub
ta: கிட்அப்பில் காட்டு

# projectDetails-joinDevelopmentOnGithub
source: Join Development on GitHub
ta: கிதுபில் வளர்ச்சியில் சேரவும்

# projectDetails-members
source: Members
ta: உறுப்பினர்கள்

# projectDetails-tags
source: Labels
ta: சிட்டைகள்

# projectDetails-allCategories
source: All Categories
ta: அனைத்து பிரிவுகளும்

# projectDetails-addTag
source: Add Label
ta: லேபிளைச் சேர்க்கவும்

# projectDetails-editTag
source: Edit Label
ta: லேபிளைத் திருத்து

# tagName
source: Name
ta: பெயர்

# tagColour
source: Color
ta: நிறம்

# projectDetails-chooseUserName
source: Choose a user name
ta: பயனர் பெயரைத் தேர்வுசெய்க

# projectDetails-userNameIsRequired
source: Username is required.
ta: பயனர்பெயர் தேவை.

# projectDetails-selectRole
source: Select a Role
ta: ஒரு பாத்திரத்தைத் தேர்ந்தெடுக்கவும்

# projectDetails-warningRemoveYourself
source: You'll remove yourself from the project!
ta: திட்டத்திலிருந்து உங்களை நீங்களே அகற்றுவீர்கள்!

# projectDetails-areYouSureYouWantToRemove
source: Are you sure you want to remove label
ta: நீங்கள் நிச்சயமாக லேபிளை அகற்ற விரும்புகிறீர்களா?

# projectDetails-areYouSureYouWantToRemoveTag
source: Are you sure you want to remove tag
ta: நீங்கள் குறிச்சொல்லை அகற்ற விரும்புகிறீர்களா?

# projectDetails-fromTheProject
source: from the project?
ta: திட்டத்திலிருந்து?

# categoryDetails-activeRequirements
source: Active Requirements
ta: செயலில் தேவைகள்

# categoryDetails-completedRequirements
source: Completed Requirements
ta: நிறைவு செய்யப்பட்ட தேவைகள்

# categoryDetails-nothingToSeeHere
source: Nothing to see here.
ta: இங்கே பார்க்க எதுவும் இல்லை.

# categoryDetails-addRequirement
source: Add new Requirement...
ta: புதிய தேவையைச் சேர்க்கவும் ...

# requirementDetails-requirementNotFound
source: Requirement not found...
ta: தேவை கிடைக்கவில்லை ...

# requirementDetails-showMoreRequirements
source: Show more Requirements
ta: மேலும் தேவைகளைக் காட்டுங்கள்

source: Public Projects
ta: பொது திட்டங்கள்

source: Last Active Projects
ta: கடைசி செயலில் உள்ள திட்டங்கள்

# lp-mot
source: Listen to your users
ta: உங்கள் பயனர்களைக் கேளுங்கள்

source: Project
ta: திட்டம்

source: Projects
ta: திட்டங்கள்

source: New
ta: புதிய

source: All
ta: அனைத்தும்

# onlyMyProjects
source: Only show projects owned by me
ta: எனக்குச் சொந்தமான திட்டங்களை மட்டுமே காட்டு

# createProject
source: Create a Project
ta: ஒரு திட்டத்தை உருவாக்கவும்

# pr-desc
source: This is the list of all projects.
ta: இது அனைத்து திட்டங்களின் பட்டியல்.

# searchLabel
source: Filter the list by project name or description
ta: திட்டத்தின் பெயர் அல்லது விளக்கம் மூலம் பட்டியலை வடிகட்டவும்

# filterCategoriesLabel
source: Filter the list by category name or description
ta: வகை பெயர் அல்லது விளக்கம் மூலம் பட்டியலை வடிகட்டவும்

# formTitle
source: Title
ta: தலைப்பு

# formDesc
source: Description
ta: விவரம்

# formTag
source: Label
ta: சிட்டை

# tagNone
source: No Label
ta: சிட்டை இல்லை

source: Cancel
ta: ரத்துசெய்

source: Save
ta: சேமி

source: Delete
ta: நீக்கு

source: Edit
ta: தொகு

source: Vote
ta: வாக்களிக்கவும்

source: Share
ta: பங்கு

source: Copy to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கவும்

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Done
ta: முடிந்தது

source: User
ta: பயனர்

source: Role
ta: பங்கு

source: User ID
ta: பயனர் ஐடி

source: Username
ta: பயனர்பெயர்

# deleteProjectTitle
source: Delete Project
ta: திட்டத்தை நீக்கு

# deleteProjectDesc
source: This action can't be undone! Are you sure that you want to permanently delete this project?
ta: இந்த செயலை செயல்தவிர்க்க முடியாது! இந்த திட்டத்தை நிரந்தரமாக நீக்க விரும்புகிறீர்கள் என்பதில் உறுதியாக இருக்கிறீர்களா?

source: Edit Project
ta: திட்டத்தைத் திருத்து

source: Create Category
ta: வகையை உருவாக்கவும்

source: Categories
ta: வகைகள்

# setAsDefault
source: Set as Default Category
ta: இயல்புநிலை வகையாக அமைக்கவும்

source: Delete Category
ta: வகையை நீக்கு

source: Edit Category
ta: வகையைத் திருத்து

source: Edit Comment
ta: எப்படி திருத்து

source: Created
ta: உருவாக்கப்பட்டது

source: Updated
ta: புதுப்பிக்கப்பட்டது

source: Not Found
ta: கண்டுபிடிக்கப்படவில்லை

source: Create Requirement
ta: தேவையை உருவாக்குங்கள்

# deleteCompDesc
source: This action can't be undone! Are you sure that you want to permanently delete this category?
ta: இந்த செயலை செயல்தவிர்க்க முடியாது! இந்த வகையை நிரந்தரமாக நீக்க விரும்புகிறீர்கள் என்பதில் உறுதியாக இருக்கிறீர்களா?

# noRequirement
source: Requirement doesn't exist. Redirected you to category page.
ta: தேவை இல்லை. வகை பக்கத்திற்கு உங்களை திருப்பி விடப்பட்டது.

# fieldsNotEmptyReq
source: Requirement isn't posted! Fields should not be empty!
ta: தேவை வெளியிடப்படவில்லை! புலங்கள் காலியாக இருக்கக்கூடாது!

# reqCreatedSucc
source: Requirement created successfully!
ta: தேவை வெற்றிகரமாக உருவாக்கப்பட்டது!

# errorCreReq
source: Some error occurred while creating the requirement!
ta: தேவையை உருவாக்கும் போது சில பிழை ஏற்பட்டது!

# fieldsNotEmptyPrj
source: Project isn't posted! Fields should not be empty!
ta: திட்டம் வெளியிடப்படவில்லை! புலங்கள் காலியாக இருக்கக்கூடாது!

# prjCreatedSucc
source: Project created successfully!
ta: திட்டம் வெற்றிகரமாக உருவாக்கப்பட்டது!

# errorCrePrj
source: Some error occurred while creating the project!
ta: திட்டத்தை உருவாக்கும் போது சில பிழை ஏற்பட்டது!

# categoryCreateSuccess
source: Category created successfully!
ta: வகை வெற்றிகரமாக உருவாக்கப்பட்டது!

# categoryCreateError
source: Some error occurred while creating the category!
ta: வகையை உருவாக்கும் போது சில பிழை ஏற்பட்டது!

# projectEditSuccess
source: The project was successfully updated.
ta: திட்டம் வெற்றிகரமாக புதுப்பிக்கப்பட்டது.

# projectEditError
source: Unfortunately the changes could not be saved. Please try again.
ta: துரதிர்ச்டவசமாக மாற்றங்களைச் சேமிக்க முடியவில்லை. மீண்டும் முயற்சிக்கவும்.

# categoryDeleteSuccess
source: Category deleted successfully!
ta: வகை வெற்றிகரமாக நீக்கப்பட்டது!

# categoryEditSuccess
source: The edit on the category has been saved.
ta: பிரிவில் உள்ள திருத்தம் சேமிக்கப்பட்டுள்ளது.

# categoryEditError
source: Unfortunately the changes could not be saved. Please try again.
ta: துரதிர்ச்டவசமாக மாற்றங்களைச் சேமிக்க முடியவில்லை. மீண்டும் முயற்சிக்கவும்.

# noEmptyFields
source: You can't have empty fields!
ta: உங்களிடம் வெற்று புலங்கள் இருக்க முடியாது!

source: All Projects
ta: அனைத்து திட்டங்களும்

source: My Projects
ta: எனது திட்டங்கள்

source: Dashboard
ta: முகப்புப்பெட்டி

# welcome
source: Welcome back
ta: மீண்டும் வருக

# delCommTitle
source: Delete Comment
ta: கருத்தை நீக்கு

# delCommDesc
source: This action can't be undone! Are you sure that you want to permanently delete this comment?
ta: இந்த செயலை செயல்தவிர்க்க முடியாது! இந்த கருத்தை நிரந்தரமாக நீக்க விரும்புகிறீர்கள் என்பதில் உறுதியாக இருக்கிறீர்களா?

# noComments
source: No comments yet…
ta: இன்னும் கருத்துகள் இல்லை…

# noDevelopers
source: No developers. Maybe you can develop this feature?
ta: உருவாக்குபவர்கள் இல்லை. ஒருவேளை நீங்கள் இந்த அம்சத்தை உருவாக்க முடியுமா?

# noFollowers
source: No followers. Be the first one to follow the project!
ta: பின்தொடர்பவர்கள் இல்லை. திட்டத்தைப் பின்பற்றிய முதல் நபராக இருங்கள்!

source: by
ta: மூலம்

source: Delete Requirement
ta: தேவையை நீக்கு

# exportRequirementPdf
source: Export PDF
ta: ஏற்றுமதி PDF

# exportRequirementTex
source: Export LaTeX
ta: லேடெக்ச் ஏற்றுமதி

# deleteRequirementDesc
source: This action can't be undone! Are you sure that you want to permanently delete this requirement?
ta: இந்த செயலை செயல்தவிர்க்க முடியாது! இந்த தேவையை நிரந்தரமாக நீக்க விரும்புகிறீர்கள் என்பதில் உறுதியாக இருக்கிறீர்களா?

source: Show Contributors
ta: பங்களிப்பாளர்களைக் காட்டு

source: Mark as done
ta: மார்க் செய்தபடி

# markAsUndone
source: Re-Open
ta: மீண்டும் திறக்கவும்

source: Follow Requirement
ta: தேவையைப் பின்பற்றுங்கள்

source: Unfollow Requirement
ta: பின்வருமாறு தேவை

source: Develop Requirement
ta: தேவையை உருவாக்குங்கள்

source: Undevelop Requirement
ta: வளர்ச்சி தேவை

source: Edit Requirement
ta: தேவையைத் திருத்து

source: View on GitHub
ta: கிட்அப்பில் காண்க

source: Create GitHub Issue
ta: அறிவிலிமையம் சிக்கலை உருவாக்கவும்

# createIssueDialogHeader
source: Create Issue for Requirement
ta: தேவைக்கு சிக்கலை உருவாக்கவும்

# createIssueDialogMessage
source: You will be redirected to GitHub
ta: நீங்கள் கிதுபுக்கு திருப்பி விடப்படுவீர்கள்

# requirementAlreadyOnGitHub
source: This Requirement is already on GitHub.
ta: இந்த தேவை ஏற்கனவே கிதுபில் உள்ளது.

source: Creator
ta: உருவாக்கியவர்

source: Lead Developer
ta: முன்னணி உருவாக்குபவர்

source: Comments
ta: கருத்துகள்

# addComment
source: Add a comment…
ta: ஒரு கருத்தைச் சேர்க்கவும்…

# commentNoEmpty
source: Comment can't be empty!
ta: கருத்து காலியாக இருக்க முடியாது!

# commentDeleteSuccess
source: The comment was successfully deleted.
ta: கருத்து வெற்றிகரமாக நீக்கப்பட்டது.

# reqEditSucc
source: Requirement edited successfully!
ta: தேவை வெற்றிகரமாக திருத்தப்பட்டது!

# reqDelSucc
source: Requirement deleted successfully!
ta: தேவை வெற்றிகரமாக நீக்கப்பட்டது!

source: Hide Contributors
ta: பங்களிப்பாளர்களை மறைக்க

# fdbFollowReq
source: You are now following this requirement.
ta: நீங்கள் இப்போது இந்த தேவையைப் பின்பற்றுகிறீர்கள்.

# fdbUnfollowReq
source: You are not following this requirement anymore.
ta: இந்த தேவையை நீங்கள் இனி பின்பற்றவில்லை.

# fdbDevelopReq
source: You are now a developer of this requirement.
ta: நீங்கள் இப்போது இந்த தேவையை உருவாக்குபவர்.

# fdbUndevelopReq
source: You are not developing this requirement anymore.
ta: இந்த தேவையை நீங்கள் இனி வளர்க்கவில்லை.

# mailDefaultLeader
source: Get e-mail notifications from requirements you lead
ta: நீங்கள் வழிநடத்தும் தேவைகளிலிருந்து மின்னஞ்சல் அறிவிப்புகளைப் பெறுங்கள்

# mailDefaultFollow
source: Get mails from requirements you follow
ta: நீங்கள் பின்பற்றும் தேவைகளிலிருந்து அஞ்சல்களைப் பெறுங்கள்

# srchReq
source: Search Requirement
ta: தேடல் தேவை

source: Developers
ta: உருவாக்குநர்கள்

source: Followers
ta: பின்தொடர்பவர்கள்

# explore-projects
source: Explore Public Projects
ta: பொது திட்டங்களை ஆராயுங்கள்

# lp-mot1
source: Discuss their ideas
ta: அவர்களின் கருத்துக்களைப் பற்றி விவாதிக்கவும்

# lp-mot2
source: Organize and expand your features
ta: உங்கள் அம்சங்களை ஒழுங்கமைத்து விரிவுபடுத்துங்கள்

source: Get Started
ta: தொடங்கவும்

# takeAlook
source: Take a look at a few example projects and if we have convinced you create your own!
ta: சில எடுத்துக்காட்டு திட்டங்களைப் பாருங்கள், நாங்கள் உங்கள் சொந்தத்தை உருவாக்குவதை நாங்கள் நம்பினால்!

source: Contact
ta: தொடர்பு

# defaultComp
source: default category
ta: இயல்புநிலை வகை

source: Follow Category
ta: வகையைப் பின்தொடரவும்

source: Unfollow Category
ta: பின்தொடர்தல் வகை

# confirmationCategoryFollow
source: You are now following this category.
ta: நீங்கள் இப்போது இந்த வகையைப் பின்பற்றுகிறீர்கள்.

# confirmationCategoryUnfollow
source: You are not following this category anymore.
ta: நீங்கள் இனி இந்த வகையைப் பின்பற்றவில்லை.

source: Follow Project
ta: திட்டத்தைப் பின்பற்றுங்கள்

source: Unfollow Project
ta: பின்தொடர்தல் திட்டம்

# confirmationProjectUnfollow
source: You are not following this project anymore.
ta: நீங்கள் இனி இந்த திட்டத்தை பின்பற்றவில்லை.

# confirmationProjectFollow
source: You are now following this project.
ta: நீங்கள் இப்போது இந்த திட்டத்தைப் பின்பற்றுகிறீர்கள்.

# followTap
source: Click to follow.
ta: பின்தொடர சொடுக்கு செய்க.

# unfollowTap
source: Click to unfollow.
ta: பின்தொடர சொடுக்கு செய்க.

source: Become Lead Developer
ta: முன்னணி உருவாக்குபவர் ஆக

# stopLeadDeveloper
source: Stop Being Lead Developer
ta: முன்னணி டெவலப்பராக இருப்பதை நிறுத்துங்கள்

# new-projects
source: New Project
ta: புதிய திட்டம்

# active-req
source: Active Requirements
ta: செயலில் தேவைகள்

# realized-req
source: Realized Requirements
ta: உணரப்பட்ட தேவைகள்

source: List View
ta: பட்டியல் பார்வை

source: Grid View
ta: கட்டம் பார்வை

# inputRequired
source: Please fill out this field.
ta: தயவுசெய்து இந்த புலத்தை நிரப்பவும்.

source: Options
ta: விருப்பங்கள்

source: Reply
ta: பதில்

source: Language
ta: மொழி

source: Show Activity Tracker
ta: செயல்பாட்டு டிராக்கரைக் காட்டு

source: User Settings
ta: பயனர் அமைப்புகள்

# voteSuccessful
source: You have successfully voted for this requirement.
ta: இந்த தேவைக்கு நீங்கள் வெற்றிகரமாக வாக்களித்துள்ளீர்கள்.

# unvoteSuccessful
source: You have successfully removed your vote for this requirement.
ta: இந்த தேவைக்கான உங்கள் வாக்குகளை நீங்கள் வெற்றிகரமாக நீக்கிவிட்டீர்கள்.

source: Please be patient...
ta: தயவுசெய்து பொறுமையாக இருங்கள் ...

source: Change Category
ta: வகை மாற்ற

source: Current Category
ta: தற்போதைய வகை

source: New Category
ta: புதிய வகை

source: Move Requirement to Category
ta: வகைக்கு தேவையை நகர்த்தவும்

# selectCategoryPlaceholder
source: Select a Category
ta: ஒரு வகையைத் தேர்ந்தெடுக்கவும்

# devTimeline-title
source: Development Timeline
ta: மேம்பாட்டு காலவரிசை

# devTimeline-requirementExported
source: Requirement Exported
ta: ஏற்றுமதி தேவை

# devTimeline-inProgress
source: Development in Progress
ta: முன்னேற்றத்தில் வளர்ச்சி

# devTimeline-closed
source: Closed
ta: மூடப்பட்டது

source: Sorting
ta: வரிசைப்படுத்துதல்

# sorting-activity
source: Last Activity
ta: கடைசி செயல்பாடு

# sorting-alphabetical
source: Alphabetically
ta: அகரவரிசை

# sorting-comments
source: Number of Comments
ta: கருத்துகளின் எண்ணிக்கை

# sorting-date
source: Creation Date
ta: உருவாக்கும் தேதி

# sorting-followers
source: Number of Followers
ta: பின்தொடர்பவர்களின் எண்ணிக்கை

# sorting-popularity
source: Popularity
ta: புகழ்

# sorting-requirements
source: Number of Requirements
ta: தேவைகளின் எண்ணிக்கை

# sorting-votes
source: Number of Votes
ta: வாக்குகளின் எண்ணிக்கை

# sorting-tags
source: Label
ta: சிட்டை

source: Votes
ta: வாக்குகள்

source: Requirements
ta: தேவைகள்

source: About
ta: பற்றி

source: Developer
ta: உருவாக்குநர்

source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

source: Logout
ta: வெளியேற்றம்

source: Sign in
ta: விடுபதிகை

source: Recent Activities
ta: அண்மைக் கால நடவடிக்கைகள்

# dashboard-projects
source: Recent activities in projects you follow
ta: நீங்கள் பின்பற்றும் திட்டங்களில் அண்மைக் கால நடவடிக்கைகள்

# dashboard-categories
source: Recent activities in categories you follow
ta: நீங்கள் பின்பற்றும் வகைகளில் அண்மைக் கால செயல்பாடுகள்

# dashboard-requirements
source: Recent activities in requirements you follow
ta: நீங்கள் பின்பற்றும் தேவைகளில் அண்மைக் கால செயல்பாடுகள்

# dashboard-badges
source: Achievements
ta: சாதனைகள்

# dashboard-rank
source: Your current rank:
ta: உங்கள் தற்போதைய தரவரிசை:

# home-greeting
source: Hi
ta: ஆய்

# home-description
source: This is your personal dashboard with every update you need.
ta: உங்களுக்கு தேவையான ஒவ்வொரு புதுப்பிப்பிலும் இது உங்கள் தனிப்பட்ட டாச்போர்டு.

source: Level
ta: நிலை

# next-rank
source: Next:
ta: அடுத்து:

# headerExportRequirement
source: Requirement of
ta: தேவை

# headerExportCatAll
source: Requirements of
ta: தேவைகள்

# headerExportCatComplete
source: Completed Requirements of
ta: நிறைவு செய்யப்பட்ட தேவைகள்

# headerExportCatActive
source: Active Requirements of
ta: செயலில் தேவைகள்

# exportRequirementsCompleted
source: Completed Requirements
ta: நிறைவு செய்யப்பட்ட தேவைகள்

# exportRequirementsActive
source: Active Requirements
ta: செயலில் தேவைகள்

# exportRequirementsAll
source: All Requirements
ta: அனைத்து தேவைகளும்

# exportRequirementsPdf
source: PDF
ta: பி.டி.எஃப்

# exportRequirementsTex
source: LaTeX
ta: லாடெக்சு

# exportBtn
source: Export
ta: ஏற்றுமதி

# selectReqType
source: Select Requirements
ta: தேவைகளைத் தேர்ந்தெடுக்கவும்

source: Select File type
ta: கோப்பு வகையைத் தேர்ந்தெடுக்கவும்

# reqType
source: Type of Requirements:
ta: தேவைகளின் வகை:

# fileType
source: Export format:
ta: ஏற்றுமதி வடிவம்:

source: Export Category
ta: ஏற்றுமதி வகை

source: Export Requirement
ta: ஏற்றுமதி தேவை

# tagHeader
source: Use labels as header:
ta: லேபிள்களை தலைப்பாகப் பயன்படுத்துங்கள்:

# QUEST
source: Quest completed!
ta: தேடல் முடிந்தது!

# ACHIEVEMENT
source: Achievement completed!
ta: சாதனை முடிந்தது!

# BADGE
source: Badge earned!
ta: ஒட்டு சம்பாதித்தார்!

# LEVEL
source: Level Up!
ta: நிலை!
