Repository: 247i/TACETr
Catalog: உரை/தானி/rms-personal-data-safe-elsa-laula-lif-doed-*.po
Languages: ta

source: därvid framhållande att hela vårt folks öde beror endast och allenast på denna frågas nöjaktiga lösning. För att utreda dessa bättre vill jag först behandla grundfrågan angående lapparnes äganderätt till sina lappskatteland, jämte rätten för lapparne att idka åkerbruk. Genom Kungl. Bref af den 13 december 1867 bestämdes en odlingsgräns, hvarvid en gränslinie sattes mellan den svenske nybyggaren och den lappska befolkningen. Nybyggarne halva erhållit äganderätt till sina hemman, under det att lapplandet förklarades vara kronomark. Med anledning häraf bortadvocerades lapparnes rätt till den jord, hvaruppå vi alla, naturligt sedt, hafva att hämta vårt lifsuppehälle. Genom att endast hafva dispositionsrätt till ett jordområde, lappskattelandet, och med dystra aningar vänta på den dag, då man kan blifva bortförd från sitt hem, där generation efter generation nedlagt sin ungdoms arbetskraft, sin mannaålders möda och ålderdomens arbetshjälp, kan icke gifva den arbetslust, en kraftig stam bör utveckla. Arbetslusten klädes i handling först vid det tillfälle när man vet, att man gagnar sig själf, sina barn och sina efterkommande. Idoghet och ihärdighet saknas icke bland lappbefolkningen, det är endast föremålets faktiska bestående, som förhindrar arbetsintensiteten och den välmåga, som annars skulle sprida sig. Med de jämtländska lapparnes öde framför sina ögon, dessa som jagats upp till ofruktbara berg på grund af att deras rättsfråga till jorden ej beaktats, kunna icke de vester- och norrbottniska lapparne inse annat öde, äfven de, så länge frågan om rätten till jorden icke löses.
ta: எங்கள் மக்களின் தலைவிதி முழுவதையும் மட்டுமே சார்ந்துள்ளது, இந்த கேள்வியின் திருப்தியான தீர்வை மட்டுமே சார்ந்துள்ளது. இவற்றை சிறப்பாக விசாரிக்க, லாப்பர்ன் அவர்களின் ஒட்டுவேலை நிலத்தின் உரிமையாளர் தொடர்பான அடிப்படை சிக்கலையும், லாப்பர்ன் விவசாயத்தை முன்னெடுக்க உரிமையும் சமாளிக்க விரும்புகிறேன். குங்ல் மூலம். டிசம்பர் 13, 1867 இன் ப்ரெஃப், ஒரு சாகுபடி வரம்பு தீர்மானிக்கப்பட்டது, இதன் மூலம் ச்வீடிச் குடியேறியவர்களுக்கும் லாப்பிச் மக்களுக்கும் இடையே ஒரு எல்லைக்கோடு அமைக்கப்பட்டது. புதிய பில்டர்கள் பாதி பேர் தங்கள் வீட்டுவசதிகளின் உரிமையைப் பெற்றனர், அதே நேரத்தில் லாப்லேண்ட் ஒரு காலவரிசை என்று அறிவிக்கப்பட்டது. இந்த காரணத்திற்காக, நிலத்திற்கான லாப்சரின் உரிமை நீக்கப்பட்டது, நாம் அனைவரும், இயற்கையாகவே, எங்கள் இல்லத்தை மீட்டெடுக்க வேண்டும். ஒரு நிலப்பரப்பு, ஒட்டுவேலை நிலம், மற்றும் இருண்ட தடயங்கள் ஆகியவற்றைக் கொண்டு, நீங்கள் ஒருவரின் வீட்டிலிருந்து கடத்தப்படக்கூடிய நாளுக்காக காத்திருங்கள், தலைமுறை தலைமுறை தனது இளைஞர்களின் உழைப்பு, அவரது மனிதனின் முயற்சி மற்றும் வேலை உதவி முதுமையில், அந்த வேலை விருப்பத்தை கொடுக்க முடியாது, ஒரு வலுவான தண்டு உருவாக வேண்டும். உங்களுக்கும், உங்கள் குழந்தைகளுக்கும், ஒருவரின் சந்ததியினருக்கும் நீங்கள் பயனடைகிறீர்கள் என்று உங்களுக்குத் தெரிந்த நேரத்தில் மட்டுமே செயலில் ஆடை அணிவதற்கான வேலை ஆசை. ஐடோசெனெச் மற்றும் விடாமுயற்சி ஆகியவை ஒட்டு மக்களிடையே குறைவு இல்லை, இது பொருளின் உண்மையானது மட்டுமே வேலை தீவிரத்தைத் தடுக்கிறது மற்றும் இல்லையெனில் பரவக்கூடிய நல்வாழ்வு. அவர்களின் கண்களுக்கு முன்னால் சாம்ட்லேண்ட் திட்டுகளின் தலைவிதியுடன், மலட்டுத்தன்மையுள்ள மலைகள் வரை துரத்தப்பட்டவை, ஏனெனில் பூமிக்கு அவற்றின் சட்டரீதியான சிக்கல் கணக்கில் எடுத்துக்கொள்ளப்படவில்லை, மேற்கு மற்றும் வடக்கு திட்டுகள் மற்ற விதிகளை உணர முடியாது, வரை கூட பூமிக்கு உரிமை பற்றிய கேள்வி தீர்க்கப்படவில்லை.

source: Årligen och dagligen gifves äfven hos oss Vesterbottens lappar exempel på hvarthän tillståndet leder. För en tid tillbaka, låt oss säga 30- à 40-tal år, kommo de svenska nybyggarne och frågade vänligt om de kunde få slå sig ned och odla upp en bit mark. Lappen såg i detta förhållande ingen som helst orsak att neka den arbetsamme mannen. Om några år hade nybyggaren odlat upp marken omkring sitt tjäll, och tog syn på densamma. Vederbörande beviljade beredvilligt lagfart å marken och icke blott den mark, som han själf odlat utan därtill ett öfrigt område. Området kunde, och gjorde det i de flesta förhållanden, sträcka sig om lappens frodiga renvallar och skatteland, den som förut varit vänlig nog att tillmötesgå nybyggarens önskningar att få odla marken bredvid honom. Så gick väl några år och en vacker dag infinner sig vederbörande synemän och kungör för den olycklige lappen att han icke längre äger rättighet till den gröda, som af honom vidare inbärgas.
ta: ஒவ்வொரு ஆண்டும் மற்றும் தினமும், வெச்டர்போட்டனின் திட்டுகளுடன், நிபந்தனைகள் எங்கு வழங்கப்படுகின்றன என்பதற்கான எடுத்துக்காட்டுகளும். சிறிது நேரம், 30 முதல் 40 ஆண்டுகள் வரை, ச்வீடிச் குடியேறியவர்கள் வந்து, அவர்கள் குடியேறி கொஞ்சம் நிலத்தை வளர முடியுமா என்று தயவுசெய்து கேட்டார்கள். இந்த உறவில், வேலை செய்யும் மனிதனை மறுக்க எந்த காரணமும் இல்லை. சில ஆண்டுகளில், குடியேறியவர்கள் அவரது டிசலைச் சுற்றி தரையில் வளர்ந்தனர், அதேபோல் ஒரு பார்வையை எடுத்துக் கொண்டனர். கேள்விக்குரிய நபருக்கு நிலத்தில் சட்ட விரைவு வழங்கப்பட்டது, அவரே வளர்ந்த நிலத்தை மட்டுமல்லாமல், மீதமுள்ள பகுதியும். இப்பகுதி, பெரும்பாலான சூழ்நிலைகளில், தி லச் ரெய்ண்டீரையும், பேட்சின் வரி நாட்டையும் நீட்டிக்க முடியும், முன்னர் அவருக்கு அடுத்ததாக நிலத்தை வளர்க்க குடியேறியவர்களின் ஆசைகளை நிறைவு செய்ய போதுமானவர். எனவே இது சில வருடங்கள் நீடித்தது, ஒரு அழகான நாள் கேள்விக்குரியதாகத் தோன்றுகிறது மற்றும் துரதிர்ச்டவசமான குறிப்பை அறிவிக்கிறது, அவர் இனி பயிருக்கு உரிமையை வைத்திருக்கிறார், அது அவரால் மேலும் கொண்டு செல்லப்படுகிறது.

source: Med dessa syner framför sina ögon lär väl ingen förundra sig öfver att den lappska befolkningen känner en bäfvan för hvad som komma skall. Merendels utgöres nu denna lappska befolkning, som på sådant sätt bortdrifves af sådana, som icke äro renägande och hvad ödet blir för dessa olyckliga är icke svårt att förutse. De blifva fattiga och utarmade. Därhän har lapparnes osäkra rättsställning ledt, på grund af deras undantagsställning i den svenska jordrättsskipningen. Svensk praxis har dock alltid varit och är det ännu, att vid afvittrings- och storskiftesförrättningar det folk, som af ålder bott och brukat landet, fått för sig och sina efterkommande för evärdelig tid tilldelad sin beskärda del. Lappen måste tillerkännas äfven denna rättsställning, eljest är hans öde besegladt. Han drifves i annat fall allt längre och längre upp mot de kala bergstopparne mot norska gränsen, den han ju icke får öfverskrida. Vid denna tidpunkt, då är väl också vår strid förgäfves, och då är det förbi med de svenska lapparne. Men hvem i vårt humana tidehvarf åtager sig att kasta den historiska dödsdomen öfver ett folk, som trots all sin brist på mänskliga dygder dock icke kan öfverbevisas om att det genom eget förvållande förorsakat sin undergång.
ta: கண்களுக்கு முன்னால் இந்த தரிசனங்கள் இருப்பதால், லாப்பிச் மக்கள் வரவிருக்கும் விசயங்களுக்கு ஒரு போக்கை உணர்கிறார்கள் என்பதில் யாரும் ஆச்சரியப்படுவதில்லை. பெரும்பாலும். அவர்கள் ஏழையாகி குறைந்து போகிறார்கள். அங்கு, லாப்பர்னின் நிச்சயமற்ற சட்ட நிலை வழிவகுத்தது, ஏனெனில் ச்வீடிச் நில நீதிபதியில் அவர்கள் விதிவிலக்கு. எவ்வாறாயினும், ச்வீடிச் நடைமுறை எப்போதுமே உள்ளது, இன்னும் புறப்படுதல் மற்றும் பெரிய அளவிலான நடவடிக்கைகள் ஏற்பட்டால், நாட்டை வாழ்ந்து பயன்படுத்திய மக்கள், அவர்களின் நியாயமான பகுதிக்கு ஒதுக்கப்பட்ட ஒரு ஈனிக் நேரத்திற்கு அவர்களின் சந்ததியினருக்கு வழங்கப்பட்டுள்ளனர். இந்த சட்ட நிலைப்பாட்டையும் வழங்க வேண்டும், இல்லையெனில் அவரது தலைவிதி சீல் வைக்கப்பட்டுள்ளது. அவர் வேறுவிதமாக வெகுதூரம் மற்றும் மேலும் வெற்று மலை சிகரங்களை நோர்வே எல்லையை நோக்கி இயக்கப்படுகிறார், அவர் விட அதிகமாக இருக்கக்கூடாது. இந்த நேரத்தில், எங்கள் போரும் வீணாக உள்ளது, பின்னர் அது ச்வீடிச் திட்டுகளுடன் முடிந்துவிட்டது. ஆனால், நமது மனிதாபிமான அலைகளில், வரலாற்று மரணத்தை ஒரு மக்கள் மீது வீச யார் மேற்கொள்கின்றனர், இருப்பினும், மனித நற்பண்புகள் இல்லாத போதிலும், அது தங்களது சொந்தத்தின் மூலம் அதன் வீழ்ச்சியை ஏற்படுத்தியது என்று தண்டிக்க முடியாது.

source: I sammanhang med rätten till jorden står lappens rätt att öfvergå till jordbruksidkande folk och bruka sina lappskatteland. Genom sådana förhållanden, som de af nybyggarnes sätt att gå till väga gentemot den lappska befolkningen jag nyss nämnt och det understöd de därvid vinna af den svenska lagen kan vi icke annat än se denna rätt oss bestriden. Marken därofvan odlingsgränsen är oss tilldelad för renbete, icke för jordbruk. En del skäl, som jag i annat sammanhang berört, har tydliggjort, att vi i betraktande af lefvebrödet icke ha annan utsikt än, att när renarne på ett eller annat sätt förolyckats vi måste gå till brukandet af vårt lappskatteland. Men öfver detta står en tidsfråga, nämligen den att hela folket förr eller senare måste gå till jordbruket. Renen finner ej längre sitt bete bland fjällen. I en ej allt för aflägsen framtid hafva vi att se att den ene lappen efter den andre förlorar sina renar. Ogynnsamma förhållanden komma därvid att medverka, icke minst den skadeersättningsskyldighet, den renägande lappen numera underkastas enligt bestämmelserna i § 14 uti lapplagen den 1 juli 1898, och genom hvilken bl. a. en lappman helt nyligen dömdes till tre tusen kronors skadeersättning. Och hvarför skall lappens existensförmåga kringskäras af lagar? Erfarenheten lärer att inget folk går så framåt som när frihet råder i alla delar. Lappens frihet är kringskuren. Hans kamp för lefvebrödet är utstakad och betingelsen att lefva hänskjuten allenast till renarne och renarnes skötsel. I medvetandet finnes dock allt jämt en känsla som talar om frihet och denna känsla återfinnes äfven hos oss, lappar!
ta: பூமியின் உரிமையின் சூழலில், விவசாய மக்களுக்குச் சென்று அவர்களின் ஒட்டுவேலை நிலத்தைப் பயன்படுத்துவதே பேட்சின் உரிமை. நான் இப்போது குறிப்பிட்டுள்ள லாப்பிச் மக்கள்தொகைக்குச் செல்வதற்கான புதிய பில்டர்களின் வழி மற்றும் ச்வீடிச் சட்டத்திலிருந்து அவர்கள் பெறும் உதவி போன்ற நிபந்தனைகள் மூலம், அமெரிக்காவிற்கான இந்த உரிமையை மட்டுமே நாம் காண முடியும். விவசாயத்திற்காக அல்ல, கலைமான் வளர்ப்புக்கு சாகுபடி வரம்பு ஒதுக்கப்பட்டுள்ள மண். மற்றொரு சூழலில் எனக்கு இருக்கும் சில காரணங்கள், வாழ்க்கை ரொட்டியைக் கருத்தில் கொண்டு, ஒரு வழியில் அல்லது இன்னொரு வழியில் கலைமான் செய்யும் போது நமது ஒட்டுவேலை நிலத்தின் பயன்பாட்டிற்கு செல்ல வேண்டியிருக்கும் என்பதைத் தவிர வேறு எந்த பார்வையும் இல்லை என்பதை தெளிவுபடுத்தியுள்ளார். ஆனால் இதற்கு மேலே காலத்தின் ஒரு சேதி, அதாவது முழு மக்களும் விரைவில் அல்லது பின்னர் விவசாயத்திற்கு செல்ல வேண்டும். கலைமான் இனி மலைகள் மத்தியில் அதன் தூண்டைக் காணவில்லை. மிக தொலைதூர எதிர்காலத்தில், அந்தக் குறிப்பு மற்றொன்று அதன் கலைமான் இழப்பை நாம் காண வேண்டும். இந்த வழியில், சாதகமற்ற நிலைமைகள் ஈடுபடும், குறைந்தது சேதங்களுக்கான பொறுப்பு அல்ல, துப்புரவு குறிப்பு இப்போது சூலை 1, 1898 அன்று சட்டச் சட்டத்தில் § 14 விதிகளின்படி சமர்ப்பிக்கப்படுகிறது, இதன் மூலம், மற்றவற்றுடன். அ. சட்டங்களால் பேட்சின் திறன் ஏன் இருக்க வேண்டும்? எல்லா பகுதிகளிலும் விடுதலை மேலோங்கும் போது எந்த மக்களும் முன்னேறவில்லை என்று பட்டறிவு கற்பிக்கிறது. பேட்சின் விடுதலை விருத்தசேதனம் செய்யப்படுகிறது. லெஃப்ட் ரொட்டிக்கான அவரது போராட்டம் நடைபாதை மற்றும் கலைமான் மற்றும் கலைமான் கவனிப்புக்கு மட்டுமே வாழ வேண்டும். இருப்பினும், நனவில், சுதந்திரத்தைப் பற்றி பேசும் ஒரு உணர்வு கூட இருக்கிறது, இந்த உணர்வும் எங்களுடன் காணப்படுகிறது, திட்டுகள்!

source: <emphasis>Renbetesrätten</emphasis> är, som jag antydt, närmare beskrifven i författningen om utstakningen af odlingsgränsen den 13 dec. 1867. Den markeras allt emellanåt af en dagorder från Umeå landskansli och hålles då i sådan form, att man skulle tro, att lapparnes renbetesrätt vore betryggad. Framför mig ligger en länskungörelse af den 12 januari 1898, däri det heter, att anläggning af nybyggen ofvan odlingsgränsen icke finge vidare af kungl. maj:ts befallningshafvande beviljas; att de nybyggen, som redan funnos ofvan odlingsgränsen, skulle återläggas till kronomark och att all mark ofvan odlingsgränsen skulle återläggas till renbetesland. Denna kungörelse har fullföljts så, att under dessa sex år ett större antal nybyggen anlagts ofvan odlingsgränsen, ja, man har till och med dömt lappar till skadeersättning gentemot dessa nybyggare. Alla förordningar till trots synes dock endast den rättvisan vara gällande, att lappen skall drifvas från sin mark. Skulle i verkligheten de lagar, som skrifvits till förmån för lapparnes renbete efterföljts, hade lappen icke haft rätt att klaga öfver denna sak. Men lagda i händer, som utan hänsyn till den lappska befolkningen gynnar nybyggaren, kan det nuvarande tillståndet icke föra annat än till renarnes minskning och lappens försämrade lefnadsställning.
ta: <வலியுறுத்தல்> ரெய்ண்டியர் வளர்ப்பு உரிமை </வலியுறுத்தல்>, நான் பரிந்துரைத்தபடி, டிசம்பர் 13 ஆம் தேதி சாகுபடி வரம்பின் பங்கு குறித்து அரசியலமைப்பில் விவரிப்பதற்கு நெருக்கமாக உள்ளது. 1867. இது எப்போதாவது உமே லேண்ட்ச்கன்ச்லியிடமிருந்து ஒரு நாள் உத்தரவால் குறிக்கப்பட்டுள்ளது, பின்னர் லாப்சனின் கலைமான் மந்தை உறுதியளிக்கிறது என்று ஒருவர் நம்புவார். எனக்கு முன்னால் சனவரி 12, 1898 இல் ஒரு மாவட்ட அறிவிப்பு உள்ளது, இது சாகுபடி வரம்பை புதிய கட்டிடத்தை நிர்மாணிப்பது ராசாவால் கண்டுபிடிக்கப்படாது என்று கூறுகிறது. மே: டி.எச் கட்டளை ஏவல்வ்ச் வழங்கப்பட்டுள்ளன; ஏற்கனவே சாகுபடி வரம்புக்கு மேலே காணப்பட்ட புதிய கட்டிடங்கள் காலவரிசைக்கு மீட்டமைக்கப்படும், மேலும் சாகுபடி வரம்பிற்கு மேலே உள்ள அனைத்து நிலங்களும் நிலத்தை வளர்ப்பதற்கு மீட்டமைக்கப்படும். இந்த அறிவிப்பு நிறைவடைந்துள்ளது, இதனால் இந்த ஆறு ஆண்டுகளில் சாகுபடி வரம்பை விட அதிக எண்ணிக்கையிலான புதிய கட்டிடங்கள் கட்டப்பட்டுள்ளன, ஆம், இந்த குடியேற்றவாசிகளுக்கு எதிரான இழப்பீட்டை சேதப்படுத்தும் குறிப்புகள் தண்டனை விதிக்கப்பட்டுள்ளன. எவ்வாறாயினும், அனைத்து விதிமுறைகளும் தோன்றுகின்றன, இருப்பினும், குறிப்பு அதன் நிலத்திலிருந்து இயக்கப்பட வேண்டும் என்று பயன்படுத்துவதற்கான அறம் மட்டுமே. உண்மையில், லாப்பர்னின் கலைமான் வளர்ப்புக்கு ஆதரவாக எழுதப்பட்ட சட்டங்கள் இந்த விசயத்தைப் பற்றி குற்றச்சாட்டு செய்ய உரிமை இல்லை. ஆனால் கைகளில் போடப்பட்டது, இது லாபியன் மக்களைப் பொருட்படுத்தாமல், குடியேறியவர்களுக்கு பயனளிக்கிறது, தற்போதைய நிலை ரெய்ண்டீரின் குறைப்பு மற்றும் பேட்சின் சரிவு ஆகியவற்றைத் தவிர வேறு எதையும் கொண்டு வர முடியாது.

source: Lapparne önska i denna fråga således endast hvad de i lag blifvit förut tillförsäkrade, d. v. s. att all mark ofvan odlingsgränsen utlägges till renbetesland. Men huru kan konungens befallningshafvande förklara att vid lapptinget i Fatmomakke nu framlägga ett förslag, gående ut på att inlösa nödig renbetesmark ofvan odlingsgränsen och därvid säga att lappen erhåller gynnsamma reformer, när vi förut för sex år sedan i länets kungörelse uttryckligen fått denna mark till oss upplåten. Detta motsägande förslag, hvilket nu framkommit, är således i strid mot förut gifna bestämmelser i fråga om renbete och afser ingalunda att skänka lappen någon fördel utan gäller endast såsom en inskränkning i bestämmelserna af kungl. maj:ts befallningshafvandes kungörelse den 12 januari 1898.
ta: லாப்பர்ன், இந்த பிரச்சினையில், அவர்கள் முன்னர் காப்பீடு செய்யப்பட்டதை மட்டுமே விரும்புகிறார்கள், அதாவது சாகுபடி வரம்பின் அனைத்து நிலங்களும் கலைமான் வளர்ப்புக்கு ஆளாகின்றன. ஆனால் ஃபாட்மோமக்கேயில் மடியில், சாகுபடி வரம்பின் தேவையான கலைமான் வளர்ப்பு நிலத்தை மீட்டெடுக்க இப்போது ஒரு முன்மொழிவு சமர்ப்பிக்கிறது, இதன் மூலம் ஆறு ஆண்டுகளுக்கு முன்பு இந்த நிலத்தை நாம் வெளிப்படையாகப் பெற்றபோது, ​​அந்தக் குறிப்பு சாதகமான சீர்திருத்தங்களைப் பெறுகிறது என்று கூறுகிறது. கவுண்டியின் அறிவிப்பு குத்தகைக்கு விடப்பட்டது. இந்த முரண்பாடான முன்மொழிவு, இப்போது வெளிவந்துள்ளது, இதனால் ரெய்ண்டியர் மந்தை தொடர்பாக முன்னர் கொடுக்கப்பட்ட விதிகளை மீறுகிறது மற்றும் குறிப்புக்கு எந்த நன்மையையும் கொடுக்க விரும்புகிறது, ஆனால் ராசாவின் விதிகளில் ஒரு கட்டுப்பாடாக மட்டுமே பொருந்தும். மே: சனவரி 12, 1898 அன்று டி.எச்.

source: Fattiglappens öde
ta: ஏழைகளின் தலைவிதி

source: synes nu starkt hotadt genom det af lappfogden Burman vid lapptinget i Fatmomakke framlagda förslaget att nedflytta den icke renägande lappen nedanför odlingsgränsen och där bereda honom jordbruk. Vi kunna icke annat än protestera mot detta förslag. Det vore att med ens tillintetgöra den lappska befolkningen och få anspråken på vårt land för alla tider häfda. De renägande lapparne förminskas alltjämt på grund af renarnes existensförhållanden, förut omnämnda. De sammansmälta allt framgent och under de senaste åren ha de renägande lapparnes antal väsentligen förminskats. De icke renägande lapparne skulle nu — enligt förslaget — nedflyttas till nybyggen nedanför odlingsgränsen och man får väl säga där öfverlämnas åt sitt öde. Hvartefter nu de renägande lapparne förlora sina renar, nedflyttas dessa nedanför odlingsgränsen och gå säkerligen där sin undergång till mötes, under det att den renägande lappen drifves mot fjället, förlorar sina renar och nedskickas sedan utfattig nedanför odlingsgränsen. När man tager i betraktande, att den mark, som är ofvan odlingsgränsen, är utlagd till renbetesland för oss lappar och att å dessa marker nybyggen äro uppresta, som äro olagligt tillkomna; hvarföre icke låta lappen tillträda dessa nybyggen och nu boende nybyggare ofvan odlingsgränsen få tillfälle att nedflytta nedanför densamma? Hvarföre skulle hinder möta för lappen att bruka dessa land, som gör att lappen åtminstone får bo i sitt af ålder brukade land samt slipper att å nya och för honom främmande trakter söka sitt uppehälle. Detta förslag afser ingalunda något förbättrande af lapparnes lefnadsställning, utan afser helt enkelt att afskära lapparnes förbindelse med sitt eget folk, för att sedan låta dem undergå det öde, som bland de svenska nybyggarne väntar desamma nedanför gränslinien.
ta: சாகுபடி வரம்பிற்குக் கீழே தூய்மை செய்யாத குறிப்பை நிராகரித்து அவரை அங்கு தயார்படுத்துவதற்கான லேப்ஃபோக்டன் பர்மன் முன்வைத்த திட்டத்தால் இப்போது அது வலுவாக அச்சுறுத்தப்படுகிறது. இந்த திட்டத்திற்கு எதிராக மட்டுமே நாம் எதிர்ப்பு தெரிவிக்க முடியும். இது லாபியன் மக்களால் கூட அழிக்கப்படும் மற்றும் எல்லா நேரங்களிலும் நம் நாட்டில் கூற்றுக்களை வைத்திருப்பது. முன்னர் குறிப்பிடப்பட்ட ரெய்ண்டீரின் இருப்பின் நிலைமைகள் காரணமாக கலைமான் மந்தைகள் இன்னும் குறைக்கப்படுகின்றன. எதிர்காலத்தில் எல்லாவற்றையும் ஒன்றிணைத்தது மற்றும் அண்மைக் கால ஆண்டுகளில் கலைமான் மந்தைகளின் எண்ணிக்கை கணிசமாகக் குறைக்கப்பட்டுள்ளது. க்ளீன் அல்லாத லாப்பர்ன் இப்போது - முன்மொழிவின் படி - சாகுபடி வரம்பிற்குக் கீழே புதிய கட்டுமானத்திற்கு இடமாற்றம் செய்யப்படுவார், மேலும் அவர்களின் தலைவிதிக்கு ஒப்படைக்கப்பட்டுள்ளதாக ஒருவர் கூறலாம். அங்குதான் கலைமான் மந்தைகள் தங்கள் கலைமான் இழக்கிறார்கள், அவர்கள் சாகுபடி வரம்பிற்குக் கீழே இடமாற்றம் செய்யப்பட்டு, நிச்சயமாக அவற்றின் வீழ்ச்சி சந்திக்கும் இடத்திற்குச் செல்கிறார்கள், அதே நேரத்தில் துப்புரவு குறிப்பு மலையை நோக்கி இயக்கப்படுகிறது, அதன் கலைமான் இழந்து பின்னர் சாகுபடி வரம்பிற்கு கீழே அனுப்பப்படுகிறது. சாகுபடி எல்லைக்கு மேலே உள்ள நிலம், எங்களுக்கு குறிப்புகள் குறிப்புகளுக்கு கலைமயமாக்கும் நிலத்திற்கு அமைக்கப்பட்டிருப்பதாகவும், இந்த நிலங்களில் புதிய கட்டிடங்கள் அமைக்கப்பட்டிருப்பதாகவும் ஒருவர் கருதும் போது, ​​அவை சட்டவிரோதமாக சேர்க்கப்படுகின்றன; இந்த புதிய கட்டிடங்களை ஒட்டு எடுக்க ஏன் அனுமதிக்கக்கூடாது, இப்போது சாகுபடி வரம்பில் குடியேறியவர்களில் வசிப்பவர்களுக்கு அதற்குக் கீழே இடமாற்றம் செய்ய வாய்ப்பு உள்ளது? இந்த நிலங்களைப் பயன்படுத்துவதற்கான குறிப்பை ஏன் தடைகள் எதிர்கொள்ளும், இது குறிப்பை அதன் நாட்டில் பயன்படுத்த அனுமதிக்கிறது, அவருக்கும் வெளிநாட்டு பகுதிகளுக்கும் அவரது வாழ்க்கையை நாட வேண்டியதில்லை. இந்த முன்மொழிவு லாப்பார்னின் வாழ்க்கை நிலையில் சில முன்னேற்றங்களை மறுக்கவில்லை, ஆனால் வெறுமனே தங்கள் சொந்த மக்களுடனான லாப்பர்னின் தொடர்பை கைவிட விரும்புகிறது, பின்னர் விதிக்கு உட்படுத்த அனுமதிக்கிறது, இது ச்வீடிச் குடியேறியவர்களிடையே எல்லைக் கோட்டுக்குக் கீழே காத்திருக்கிறது.

source: Lapparnes rösträttsförhållanden.
ta: லாப்பர்னின் வாக்களிப்பு உரிமைகள்.

source: Om i Sverige skriande orättvisor anses begångna med att större delen af folket undandrages medbestämmanderätt i folkets egna angelägenheter, så äro dock de lappländska förhållandena än olidligare.
ta: எவ்வாறாயினும், ச்வீடனில், அநீதியானது மக்களின் சொந்த விவகாரங்களில் கோ -தீர்மானத்தின் உரிமையுடன் பெரும்பாலான மக்கள் தவிர்க்கப்படுவதால், லாப்லேண்ட் நிலைமைகள் இன்னும் முக்கியமல்ல.

source: <emphasis>Den kommunala rösträtten</emphasis> i lappkommunerna utöfvas endast och allenast af den svenske jordbrukaren och lappens lifsnäring ger ej honom den inkomst, som berättigar honom att deltaga i allmänna, honom rörande angelägenheter. Högst fåtal lappar (ifrågasättas kan, om det än finnes några) äga bestämmanderätt vid kommunala stämmor, och dock afgöras vid dessa lapparnes angelägenheter rörande beskattning, fattigvård och öfriga kommunala ärenden. Det har icke förunnats lappmannen att vinna inträde i kommunal myndighet och i något medafgöra om frågor, som rör lappens rättsförhållande i kommunen, till hvilket förhållande den kommunala bestämmanderätten i mångt och mycket dock kan medverka. Och i de flesta fall inse lapparne, hvilka i många lappkommuner utgör flertalet, att de icke kunna inverka något till förbättrade förhållanden, då de icke på grund af den kommunala rösträttsskalan förmå uträtta något.
ta: <வலியுறுத்தல்> நகராட்சி வாக்களிப்பு உரிமைகள் </வலியுறுத்தல்> ஒட்டு நகராட்சிகளில் மட்டுமே பயன்படுத்தப்படுகின்றன, மேலும் ச்வீடிச் உழவர் மற்றும் லாப்பனின் வாழ்க்கைத் தொழில் மட்டுமே அவருக்கு பொதுவாக பங்கேற்க உரிமை அளிக்கும் வருமானத்தை வழங்கவில்லை, அவர் விசயங்களைப் பற்றி. நகராட்சி கூட்டங்களில் முடிவு செய்ய அதிகபட்சம் சில திட்டுகள் (கேள்வி எழுப்பப்பட்டிருக்கலாம்) உரிமை உண்டு, இருப்பினும், வரிவிதிப்பு, வறுமை பராமரிப்பு மற்றும் பிற நகராட்சி வழக்குகள் தொடர்பான இந்த திட்டுகளின் விசயங்களால் தீர்மானிக்கப்பட வேண்டும். நகராட்சி அதிகாரசபைக்குள் நுழைவதற்கும், நகராட்சியில் லாப்பனின் சட்ட உறவு தொடர்பான பிரச்சினைகள் அல்லது நகராட்சி முடிவெடுக்கும் அதிகாரம், பல மற்றும் பலவற்றிலும் எந்த உறவினர்களிடமும் இது ஒட்டு மனிதனிடம் செய்யப்படவில்லை இருப்பினும், பங்கேற்கலாம். பெரும்பாலான சந்தர்ப்பங்களில், பல ஒட்டு நகராட்சிகளில் பெரும்பான்மையைக் கொண்ட லாப்பர்ன், மேம்பட்ட நிலைமைகளுக்கு எதையும் பாதிக்க முடியாது, ஏனெனில் நகராட்சி வாக்களிக்கும் உரிமை அளவின் காரணமாக, எதையும் செய்ய முடியாது.
