Repository: 247i/TACETr
Catalog: உரை/தானி/rms-personal-data-safe-elsa-laula-lif-doed-*.po
Languages: ta

source: <?asciidoc-toc?> <?asciidoc-numbered?>
ta: <? ASCIIDOC-TOC?> <? Asciidoc- எண்ணற்ற?>

source: sv
ta: எச்.வி.

source: Inför lif eller död?
ta: லைஃப் அல்லது மரணத்திற்கு முன்?

source: Sanningsord i de lappska förhållandena
ta: மடிக்கணினி நிலைமைகளில் உண்மை வார்த்தைகள்

source: <date>2024-06-04</date> <author> <personname> <firstname>Else</firstname> <surname>Laula</surname> </personname> </author> <authorinitials>EL</authorinitials> <date>2024-04-01</date> <pubdate>2024-04-01</pubdate> <edition>1</edition>
ta: <தேதி> 2024-06-04 </athername> <firstname> else </firstname> <surname> லாலா </குடும்பப்பெயர்> </personname> </autoritials> el </authinitials> <தேதி> 2024-04-01 </date> <ubdate> 2024-04-01 </bubdate> <பதிப்பு> 1 </பதிப்பு>

source: Originaltexten i detta dokument är inte längre skyddad av upphovsrättslagen, eftersom författaren har varit död i mer än 92 år. Återutgiven publiceras med användarvillkoren Creative Commons Erkännande.
ta: இந்த ஆவணத்தின் அசல் உரை இனிமேல் பதிப்புரிமைச் சட்டத்தால் பாதுகாக்கப்படாது, ஏனெனில் ஆசிரியர் 92 ஆண்டுகளுக்கும் மேலாக இறந்துவிட்டார். கிரியேட்டிவ் காமன்ச் அங்கீகாரத்தின் விதிமுறைகளுடன் ரிட்டர்ன் வெளியிடப்பட்டது.

source: För mer information om användarvillkorane Creative Commons 0, besök <ulink url="https://creativecommons.org/publicdomain/zero/1.0/deed.en"/> og <ulink url="https://creativecommons.org/licenses/by/4.0/"/>.
ta: பயனர் கடன் கிரியேட்டிவ் காமன்ச் 0 பற்றிய கூடுதல் தகவலுக்கு, <ulink முகவரி = "https://creativecomms.org/publicomain/zero/1.0/deed.en" /உரிமங்கள் /by/4.0/"/>.

source: Omfördelning och användning i källformat (Asciidoc) och kompilerad form (XML, HTML, PDF, PostScript, RTF och så vidare) är tillåts både med och utan ändringar.
ta: மூல வடிவத்தில் (ASCIIDOC) மற்றும் தொகுக்கப்பட்ட படிவம் (XML, HTML, PDF, PostScript, RTF மற்றும் பலவற்றில் மறுபகிர்வு மற்றும் பயன்பாடு மாற்றங்களுடன் மற்றும் இல்லாமல் அனுமதிக்கப்படுகிறது.

source: Elsa
ta: எல்சா

source: Laula
ta: லாலா

source: <city>Oslo</city>
ta: <சிட்டி> ஒச்லோ </சிட்டி>

source: <publisher> <publishername>Petter Reinholdtsen</publishername> <placeholder type="address" id="0"/> </publisher>
ta: <debisher> <derishername> பெட்டர் ரெய்ன்ஆட்சன் </degishername> <ஒதுக்கிட வகை = "முகவரி" ஐடி = "0"/> </sudisher>

source: Långt uppe bland fjällen i öfversta Norrland bor sedan mannaminnes tider vår stam. Svunna tiders häfder tälja dock att vi lappar icke alltid varit hänvisade till att söka lefvebröd bland kala bergstoppar, utan lemningar från forna tider visar att lapparna besuttit rymliga betesmarker under gynnsamma förhållanden. Under seklernas lopp har lappen dock alltjämt fått vika för den jordbruksidkande germanska rasen. Fredlig, lugn, sluten och alltid nöjd med sin lott har lappen utan protester själfmant lemnat hvad han trott vara hans tillhörighet och tum för tum ha de svenska nybyggarna dragit till sig den betesmark, som af lapparne användts. De hafva däraf fått namnet «nomadiserande» d. v. s. ständigt vandrande, men månne icke den omständigheten, att de svagare under alla tider fått gifva vika för de starkare, varit orsaken till denna vandringslusta. Att lappen har betingelser för att bosätta sig när han fått sitt lefvebröd, därom vittna med tillräcklig tydbarhet de sista decenniernas erfarenheter. Man gör orätt om man i lappbefolkningens tvungna undandragande ser något af zigenarlifvet. Vårt folk vilja blifva bofasta om de därtill fått rättighet, men de hafva i alla tider lefvat i en undantagsställning eller med andra ord — de hafva ställts utom lagen, utom de allmänna rättigheternas gräns.
ta: அப்பர் நோர்லாண்டில் உள்ள மலைகள் மத்தியில், நம் பழங்குடியினரை வாழ்கின்றன என்பதால். எவ்வாறாயினும், நாங்கள் திட்டுகள் வெற்று மலை சிகரங்களுக்கிடையில் லெஃப்வே ரொட்டியைத் தேடுவதற்கு எப்போதும் குறிப்பிடப்படவில்லை என்று மன்னிப்பு நேரங்கள் கணக்கிடப்படுகின்றன, ஆனால் பண்டைய காலத்தின் வசைபாடுதல்கள், திட்டுகள் சாதகமான நிலைமைகளின் கீழ் அகன்ற மேய்ச்சல் நிலங்களை எடுத்துள்ளன என்பதைக் காட்டுகின்றன. இருப்பினும், பல நூற்றாண்டுகளாக, இந்த குறிப்பு விவசாய செர்மன் இனத்திற்கு இன்னும் வழிவகுத்தது. அமைதியான, அமைதியான, மூடிய மற்றும் எப்போதுமே தனது இடத்திலேயே நிறைவு அடைகிறார், ஆர்ப்பாட்டங்கள் இல்லாத இணைப்பு, அவர் தனது இணைப்பு மற்றும் அங்குலங்களுக்கு அங்குலமாக நினைத்ததை விட்டுவிட்டார், ச்வீடிச் குடியேறியவர்கள் திட்டுக்களால் பயன்படுத்தப்படும் மேய்ச்சலை ஈர்த்துள்ளனர். அவர்கள் "நாடோடி" என்று பெயரிடப்பட்டுள்ளனர். அவர் தனது லெஃப்வே ரொட்டியைப் பெற்றபோது தீர்வு காண நிபந்தனைகள் உள்ளன, இதன் மூலம் கடந்த தசாப்தங்களின் அனுபவங்களுக்கு போதுமான தெளிவுடன் சாட்சியமளிக்கின்றன. ஒட்டு மக்கள்தொகையில் சிப்சி வாழ்க்கையைப் பார்த்தால் நீங்கள் தவறு செய்கிறீர்கள். எங்கள் மக்கள் உரிமைகளைப் பெற்றிருந்தால் குடியிருப்பாளராக இருக்க விரும்புகிறார்கள், ஆனால் அவர்கள் எப்போதும் விதிவிலக்காகவோ அல்லது வேறுவிதமாகக் கூறினால் - அவர்கள் பொது உரிமைகளின் வரம்பைத் தவிர சட்டத்திற்கு அப்பாற்பட்டவர்கள்.

source: Föga eller litet lemna lappska kulturskildrare af lappens jernhårda kamp för tillvaron och de tvungna omständigheter, hvarunder de hafva att förskaffa sig sitt uppehälle. Merendels framställes lappens arbete, hans kamp för brödet, hans säregna lefnadsförhållanden och hans äfventyr i sagornas skimrande ljus, hans verkliga arbete för nöjestillfredsställelse. Tyvärr är dock icke lappens lefnad ett tidsfördrif utan ett af mödor, faror och umbäranden uppfylldt lif. Hvem täljer de lappska hemmens tårfyllda kval, hvem uttalar tröstens ord till de hårdt pröfvade, hvem mättar enkor och faderlösa barn och hvem räcker lappen en skärf i nödens dag? Man sätter sig icke in i lappbefolkningens förhållanden utan betraktar det hela som en föråldrad brokig tafla bredvid svenskens högre kulturstadium. Och dock tillmätes orättvist den lappska befolkningen kulturlyten, hvilka ej hafva sin uppkomst i vår stam utan äro till oss öfverförda från de högre kultiverade. Ja, man har därvid gått så långt att man därföre ansett oss ej vara värdiga att inrangeras bland folkslag eller med andra ord åtnjuta rättigheten att existera. Efter denna korta inledning vill jag öfvergå till en skildring af de laster, hvaruti vårt folkslag sägas vara försjunkna uti och som öppet sagts mig vara orsaken till den hjälplösa ställning, lappen befinner sig uti.
ta: லாப்பனின் இரும்பு -ஆரார்ட் இருப்புக்கான சிறிய அல்லது சற்று இடது லாப்ச்கா கலாச்சார டெபிக்டர் மற்றும் கட்டாய சூழ்நிலைகள், அந்த சமயத்தில் அவர்கள் தங்கள் வாழ்க்கையைப் பெற்றுள்ளனர். பெரும்பாலும். இருப்பினும், துரதிர்ச்டவசமாக, லாப்பனின் வாழ்க்கை ஒரு கால தப்பெண்ணம் அல்ல, ஆனால் தாய்மார்கள், ஆபத்துகள் மற்றும் கச்டங்களில் ஒன்று நிறைவேற்றப்பட்டது. லாப்ச்கா வீட்டின் கண்ணீர் தகுதிகளை யார் கணக்கிடுகிறார்கள், அவர் ஆறுதலின் வார்த்தைகளை கடினமாக்கியவர், விதவைகள் மற்றும் தந்தையற்ற குழந்தைகளை நிறைவு செய்கிறார், துன்பத்தின் நாளில் ஒட்டு கடைசியாக யார்? ஒட்டு மக்கள்தொகையின் நிலைமைகளுக்கு நீங்கள் வரவில்லை, ஆனால் இவை அனைத்தும் ச்வீடிச் உயர் கலாச்சார அரங்கிற்கு அடுத்த காலாவதியான மாறுபட்ட டேப்லெட்டைக் கருதுகின்றன. எவ்வாறாயினும், கலாச்சார விளக்குகளின் லாபியன் மக்கள்தொகைக்கு நியாயமற்ற முறையில் காரணம், அவை நமது கோத்திரத்தில் தோன்றவில்லை, ஆனால் அதிக பயிரிடப்பட்டவர்களிடமிருந்து நமக்கு மாற்றப்படுகின்றன. ஆமாம், நீங்கள் இதுவரை சென்றுவிட்டீர்கள், நாங்கள் மக்களிடையே செருகப்படுவதற்கு தகுதியானவர்கள் என்று நாங்கள் கருதவில்லை அல்லது வேறுவிதமாகக் கூறினால், இருப்பதற்கான உரிமையை அனுபவிக்க. இந்த சுருக்கமான அறிமுகத்திற்குப் பிறகு, சுமைகளின் சித்தரிப்புக்கு மாற்ற விரும்புகிறேன், அங்கு எங்கள் மக்கள் மூழ்கியிருப்பதாகக் கூறப்படுகிறது, மேலும் உதவியற்ற பதவிக்கு காரணம் என்று வெளிப்படையாகக் கூறியது போல், குறிப்பு உள்ளது.

source: Lapparnes dryckenskap.
ta: லாப்பர்ன் குடிப்பழக்கம்.

source: När jag i våras sökte att väcka intresse för vårt folk, framhållande den hjälplösa ställning de befunno sig uti och den särställning de intogo i fråga om rent mänskliga rättigheter, möttes jag med orden: «Lapparne supa, de dricka, de kunna icke upphjälpas» o. s. v. Till en början vill jag konstatera det faktum att bland våra lappar finnas inga vanedrinkare och sedan tider man minnes tillbaka har icke åtminstone i min hemtrakt någon lapps dödsorsak varit alkoholsjukdom. Jämfördt med de senaste svenska iakttagelserna, som konstaterat att 50 tusen drinkare befolka landet, torde den lappska dryckenskapen <emphasis>icke</emphasis> böra öfverskattas sin betydelse. Däremot förekommer beklagligt nog att berusade lappar uppträda vid marknader, som hållas vid kusten, men äfven då i ett mycket ringa antal. Men dessa bestå ingalunda af sådana, som hafva för vana att berusa sig, utan utgöras af tillfälliga supare, som genom köp, byte eller annan handel kommit i beröring med svenska marknadsbesökare och bjudits förtäring för att «affärerna skall gå bättre». Men äfven detta nationallyte är i försvinnande och det af sin egen orsak, nämligen den, att lappen merendels inser att han gör dåliga affärer när han <emphasis>låter</emphasis> berusa sig.
ta: இந்த வசந்த காலத்தில் நான் எங்கள் மக்கள் மீது ஆர்வத்தைத் தூண்ட முயன்றபோது, ​​அவர்கள் இருந்த உதவியற்ற நிலைப்பாட்டையும், அவர்கள் முற்றிலும் மனித உரிமைகளில் எடுத்த சிறப்பு நிலையும் தொடர்ந்து, "லாப்பர்ன் சுபா, பானங்கள், அவற்றை வளர்க்க முடியாது" என்ற வார்த்தைகளை நான் சந்தித்தேன் எனவே ஆரம்பத்தில், எங்கள் குறிப்புகளில் வசிப்பவர்கள் இல்லை என்ற உண்மையை நான் அறிய விரும்புகிறேன், நீங்கள் நினைவில் வைத்திருக்கிறீர்கள், குறைந்தபட்சம் என் வீட்டு பிராந்தியத்தில் எந்தவொரு பேட்சின் காரணமும் ஆல்கஆல் நோயாகும். 50,000 குடிகாரர்கள் நாட்டை விரிவுபடுத்துவதைக் கண்டறிந்த அண்மைக் கால ச்வீடிச் அவதானிப்புகளுடன் ஒப்பிடும்போது, ​​லாபியன் குடிக்கும் தன்மை <வலியுறுத்தல்> செய்யக்கூடாது </வலியுறுத்தல்> அதன் முக்கியத்துவத்தை ரத்து செய்ய வேண்டும். மறுபுறம், கடற்கரையில் நடைபெறும் சந்தைகளில் போதையில் உள்ள திட்டுகள் ஏற்படுவது வருந்தத்தக்கது, ஆனால் மிகக் குறைந்த எண்ணிக்கையிலும். ஆனால் இவை குடிபோதையில் உள்ளவர்களின் எந்த வழியையும் கொண்டிருக்கவில்லை, ஆனால் தற்காலிக சூப்பர்களைக் கொண்டிருக்கின்றன, அவை கொள்முதல், இரை அல்லது பிற வர்த்தகத்தின் மூலம், ச்வீடிச் சந்தை பார்வையாளர்களுடன் தொடர்பு கொண்டு, "வணிகத்தை சிறப்பாகச் செல்ல" நுகர்வு அழைத்தன. ஆனால் இந்த தேசிய மாற்றம் கூட காணாமல் போகிறது மற்றும் அதன் சொந்த காரணத்திற்காக, அதாவது அவர் <வலியுறுத்தல்> லெட்ச் </வலியுறுத்தல்> தன்னை குடித்தபோது அவர் மோசமான வணிகம் செய்வதை குறிப்பு பெரும்பாலும் உணர்கிறது.

source: Oberättigandet att kasta ett folks ovana på en annan ras’ skuldror och däraf förklara en hjälplös belägenhets berättigande, lyser äfven bjärt fram inför påståendet att lappen icke själf producerar, försäljer eller på annat sätt tillhandahåller berusande drycker. Den last, som har sitt upphof inom folkets egna landamären, bör icke påbördas andra folk, som genom njutningslystnaden förledes att sjunka i densamma.
ta: மற்றொரு இனத்தின் தோள்களில் அறிமுகமில்லாத ஒரு மக்களை வீசுவதற்கும், நீதியின் உதவியற்ற நிலைப்பாட்டை விளக்குவதற்கும் சங்கடமாக இருக்கிறது, மேலும் குறிப்பு போதைப்பொருள் பானங்களை விளைவாக்கம் செய்யவோ, விற்கவோ அல்லது வேறுவிதமாக வழங்கவோ இல்லை என்ற கூற்றுக்கு முன்பே முன்னோக்கி பிரகாசிக்கிறது. மக்களின் சொந்த லேண்டமாருக்குள் உயர்த்தப்பட்ட சரக்கு, இன்பத்தின் இன்பத்தின் மூலம், அதே நேரத்தில் மூழ்குவதற்கு மயக்கமடையக்கூடாது.

source: Tiggeri af nöd eller lättja?
ta: துன்பம் அல்லது சோம்பல் பிச்சை?

source: Beklagligt är det förhållande, hvarmed man äfven framhåller lapparnes tiggeri, såsom föranledt af lättja. Vårt folk kunna indelas i två olika afdelningar, beroende på det förhållande de stå till förvärfvet af det dagliga brödet, nämligen renägande och icke renägande lappar De förra utgöras af sådana, som trots alla svårigheter lyckats behålla sina renar; de senare däremot af de, som genom ett eller annat förhållande blifvit utan renar, hvilket är detsamma som förlusten af sitt lefvebröd. Det är endast genom utrönandet af på hvad sätt en lapp gått förlustig sina renar, som man kan bedöma, om tiggeriet är förorsakadt af lättja eller af verklig nöd. Lappens framtid är förknippad med renen, hans trogne följeslagare genom lifvet. Af den har han sin existens, utan honom står han inför hungersnöden. Jagt och fiske måste alltid räknas som en bisyssla, mera till att söka än att erhålla lefvebröd. På renen måste man söka lappens existensminimum. Ett lappmatlag på sju personer (man, hustru och fem barn) behöfver årligen till sitt hushåll nedslagta 40 renar, hvaraf 20 användas till lapphemmets eget behof af kött och den andra hälften försäljas till inköp af mjöl och andra lifsförnödenheter jämte beklädnad. För dessa 20 renar erhåller lappen i lyckligaste fall omkring 300 kr. På denna summa drar en lappsk familj sig drägligt fram genom lifvet. Men nu en annan sak. För att efter denna beräkningsgrund fastslå ett existensminimum, behöfver lappen till sitt förfogande en renhjord af nära 350 renar, och detta antal kan icke en lapp på tio uppbringa. En renhjord på 100, det minsta antal som en lapp kan hafva för att uppträda som själfständigt renägande, lemnar en årlig afkastning af 30 renkalfvar. Dessa späda kalfvar utsättas nu med ens för tusentals faror, icke minst att märka nybyggarnes hundar. Redan efter ett år har afkomman med säkerhet nedbringats med minst ett tiotal, andra året till 15 och vid fullvuxen ålder till 12.
ta: வருந்தத்தக்கது என்பது சோம்பேறித்தனத்தால் ஏற்படுவதால், திட்டுக்களின் இரப்புணவு எடுப்பதை வலியுறுத்துகிறது. எங்கள் மக்கள் இரண்டு வெவ்வேறு துறைகளாகப் பிரிக்கப்படலாம், நாள்தோறும் ரொட்டியைப் பெறுவதற்கு அவர்கள் நிற்கும் உறவைப் பொறுத்து, அதாவது தூய்மையான மற்றும் தூய்மையான திட்டுகள், முந்தையவர்கள், அனைத்து சிரமங்களும் இருந்தபோதிலும், தங்கள் கலைமான் தக்கவைக்க முடிந்தது ; பிந்தையது, மறுபுறம், ஒன்று அல்லது இன்னொருவரால், கலைமான் இல்லாமல் மாறும் நபர்களால், இது அவர்களின் கல்லீரல் ரொட்டியின் இழப்புக்கு சமம். ஒரு குறிப்பு அதன் கலைமான் எந்த வழியில் இழந்துள்ளது, இரப்புணவு எடுப்பது சோம்பல் அல்லது உண்மையான துயரத்தால் ஏற்படுகிறதா என்பதை ஒருவர் மதிப்பிட முடியும். பேட்சின் எதிர்காலம் வாழ்க்கையின் மூலம் அவரது உண்மையுள்ள தோழரான கலைமான் உடன் தொடர்புடையது. அதிலிருந்து அவருக்கு இருப்பு உள்ளது, அவர் இல்லாமல் அவர் பஞ்சத்தை எதிர்கொள்கிறார். வேட்டை மற்றும் மீன்பிடித்தல் எப்போதுமே ஒரு பக்க வேலையாக எண்ணப்பட வேண்டும், லெஃப்வ் ரொட்டியைப் பெறுவதை விட தேடுவது அதிகம். ரெய்ண்டீரில் நீங்கள் குறிப்பின் குறைந்தபட்சத்தைத் தேட வேண்டும். ஏழு பேர் (ஆண், மனைவி மற்றும் ஐந்து குழந்தைகள்) ஒரு ஒட்டு உணவு ஆண்டுதோறும் தங்கள் வீடுகளுக்கு 40 ரெய்ண்டீரைத் தாக்கியது, அவற்றில் 20 பேட்சின் சொந்த இறைச்சிக்குத் தேவைக்கு பயன்படுத்தப்படுகின்றன, மற்ற பாதி மாவு மற்றும் பிற வாழ்நாள் அலகுகளை வாங்குவதற்காக விற்கப்படுகிறது அத்துடன் உறைப்பூச்சு. இந்த 20 கலைமான், குறிப்பு மகிழ்ச்சியான வழக்கில் SEK 300 ஐப் பெறுகிறது. இந்த தொகையில், ஒரு லாப்ச்க் குடும்பம் வாழ்க்கையில் மிகவும் ஈர்க்கிறது. ஆனால் இப்போது மற்றொரு சேதி. இந்த கணக்கீட்டிற்குப் பிறகு குறைந்தபட்ச இருப்பைத் தீர்மானிக்க, பேட்சிற்கு 350 ரெய்ண்டீருக்கு அருகில் ஒரு கலைமான் மந்தை தேவை, மேலும் இந்த எண்ணிக்கை பத்து இடத்தைக் கொண்டு வர முடியாது. 100 இன் ஒரு கலைமான் மந்தை, ஒரு இணைப்பு சுயாதீனமாக முற்றிலும் செயல்பட வேண்டிய மிகச்சிறிய எண்ணிக்கையானது, ஆண்டுதோறும் 30 கலைமான் கன்றுகளின் வருவாயை விட்டுச்செல்கிறது. இந்த நீர்த்த கன்றுகள் இப்போது ஆயிரக்கணக்கான ஆபத்துகளுக்கு ஆளாகின்றன, நாய்களின் நாய்களை கவனிக்க முடியாது. ஏற்கனவே ஒரு வருடம் கழித்து, சந்ததியினர் நிச்சயமாக குறைந்தது ஒரு டசன், இரண்டாம் ஆண்டு 15 ஆகவும், முழு வயதில் 12 ஆகவும் குறைக்கப்பட்டுள்ளனர்.

source: Alltså skulle lappen med blick på framtiden icke få nedslakta mer än 12 à högst 15 renar pr år. Hvarje antal som däröfver går, inverkar på den framtida betingelsen att lefva för lappen. Nedslaktar han exempelvis existensminimummet 40 renar, har han redan efter ett års tid renstocken nedbringad till 70 och fortfar detta förhållande är han redan efter ett par tre år under möjligheternas gräns, under betingelsen att lefva. När renarnas antal understigit 100, kan lappen icke längre ägna sig åt skötseln af sina egna renar, utan lämnar då desamma i vården hos någon renägande lapp, som själf icke har tillräckligt antal renar, och slår han sig merendels själf ned på en jordtorfva för att med jordens brukande bidraga till existensens möjlighet. Under tiden går nu hans renar «ut sig» mestadels på svårigheten att skydda det uppväxande rensläktet mot renmärken. Då återstår endast lappens jordbrukstorfva och då har han den framträngande svenske nybyggaren att kämpa med. Lappen får — alla ömmande omständigheter till trots — gifva vika och obarmhertigt drifves han till tiggarstafven, han har ju icke äganderätt till sitt land utan äger endast rätt till renbete. Utan renar, utan jord, utan utsikt att lefva af sina händers arbete finnes ju ingen annan möjlighet än att anropa barmhertiga medmänniskor om hjälp. Till råga på all denna helt vanliga olycka har den lappska befolkningen att nu utstå alla de sviter, som uppkommit efter de «sju hårda årens» historia, hvarför ofvan relaterade nöd blifver allt mera och mera allmän. De sju hårda åren inleddes med året 1892, då vintern kom tidigt, redan S:t Michaeli dag. Genom den tidiga vintern frös snön till is och betäckte bergen, hvarföre renen icke kunde komma åt den renmossa, som hör till hans uppehälle. Tusentals renar dogo då af svält, och detta förnyades sedan årligen en lång tid. Så kommo de stora timmerdrifningarna och renar — likaledes i tusental — blefvo nedfällda af träden. (I denna fråga vill jag i förbigående nämna, att lapparna icke för dessa olyckor erhöllo någon skadeersättning.) Förutom dessa olyckor hade renarne alltid att kämpa med nybyggarnas hundar. Som ett talande exempel på huru lätt en lapp kan bringas till nödens brant, vill jag anföra följande:
ta: எனவே, எதிர்காலத்தைப் பார்க்கும் இணைப்பு ஆண்டுக்கு 12 முதல் அதிகபட்சம் 15 ரெய்ண்டீரை தோற்கடிக்க முடியாது. நடக்கும் ஒவ்வொரு எண்ணும், குறிப்புக்கு வாழ எதிர்கால நிலையை பாதிக்கிறது. உதாரணமாக, குறைந்தபட்சம் 40 ரெய்ண்டீரை அவர் நிராகரித்திருந்தால், அவர் ஏற்கனவே ஒரு வருடத்திற்குப் பிறகு 70 ஆகக் குறைக்கப்பட்டுள்ளார், மேலும் அவர் வாழ்வதற்கான நிபந்தனையின் கீழ், சாத்தியக்கூறுகளின் வரம்பிற்கு இரண்டு ஆண்டுகளுக்குப் பிறகு இந்த உறவைத் தொடர்கிறார். கலைமான் 100 க்கும் குறைவாக இருக்கும்போது, ​​இணைப்பு இனி அதன் சொந்த கலைமான் பராமரிப்புக்காக தன்னை அர்ப்பணிக்க முடியாது, ஆனால் எந்தவொரு தூய்மையான குறிப்பையும் பராமரிப்பதில் ஒரே மாதிரியாக இருக்கும், அதில் போதுமான எண்ணிக்கையிலான கலைமான் இல்லை, மற்றும் பூமியின் பயன்பாட்டு பங்களிப்புடன் அவர் பெரும்பாலும் ஒரு மண்ணில் இறங்குகிறார். இதற்கிடையில், அவரது கலைமான் இப்போது வெளியே செல்கிறது »பெரும்பாலும் கலைமான் மார்க்சுக்கு எதிராக வளர்ந்து வரும் கலைமான் மந்தைகளைப் பாதுகாக்கும் சிரமத்தின் அடிப்படையில். பின்னர் லாப்பனின் விவசாய பெருநகரங்கள் மட்டுமே உள்ளன, பின்னர் அவர் எதிர்த்துப் போராடும் ச்வீடிச் குடியேறியவர்களை எதிர்த்துப் போராடுகிறார். இணைப்பு - அனைத்து மோசமான சூழ்நிலைகளும் இருந்தபோதிலும் - வழியைக் கொடுக்கும், இடைவிடாமல் அவர் பிச்சைக்காரருக்கு கடுமையானவருக்கு விரட்டப்படுகிறார், அவருக்கு தனது நாட்டின் உரிமை இல்லை, ஆனால் கலைமான் வளர்ப்புக்கு மட்டுமே உரிமை உண்டு. கலைமான் இல்லாமல், மண் இல்லாமல், தங்கள் கைகளின் வேலையால் வாழ வேண்டும் என்ற பார்வை இல்லாமல், மெர்சி தம மனிதர்களை உதவிக்கு அழைப்பதைத் தவிர வேறு எந்த வாய்ப்பும் இல்லை. இந்த மிகவும் பொதுவான விபத்தில் முதலிடம் பெற, லாபியன் மக்கள் இப்போது "ஏழு கடினமான ஆண்டுகளின்" வரலாற்றுக்குப் பிறகு எழுந்த அனைத்து அறைகளையும் தாங்கிக் கொண்டுள்ளனர், அதனால்தான் தொடர்புடைய துன்பம் பெருகிய முறையில் மேலும் மேலும் பொதுவானதாகி வருகிறது. ஏழு கடினமான ஆண்டுகள் 1892 ஆம் ஆண்டில் தொடங்கியது, குளிர்காலம் ஆரம்பத்தில் வந்தபோது, ​​ஏற்கனவே செயின்ட் மைக்கேலி நாள். குளிர்காலத்தின் ஆரம்பத்தில், பனி பனிக்கட்டிக்கு உறைந்து மலைகளை மூடியது, ஏன் கலைமான் தனது வாழ்க்கைக்கு சொந்தமான கலைமான் பாசியை அணுக முடியவில்லை. பின்னர் ஆயிரக்கணக்கான கலைமான் பட்டினியால் இறந்தது, பின்னர் இது நீண்ட காலமாக புதுப்பிக்கப்பட்டது. எனவே பெரிய மர இயக்கிகள் மற்றும் கலைமான் - அதேபோல் ஆயிரக்கணக்கானவர்களிடமும் - மரங்களால் கீழே விழுந்தன. . ஒரு குறிப்பை எவ்வளவு எளிதில் செங்குத்தானதாக கொண்டு வர முடியும் என்பதற்குச் சொல்லும் எடுத்துக்காட்டு, பின்வருவனவற்றைக் கூற விரும்புகிறேன்:

source: Lappmannen Gustaf Klementson i Fatmomakke var för några få år sedan ansedd som en välbärgad lappman. Han ägde en renhjord på omkring 300 renar och hade således existensmöjligheter för den stora familj, 11 personer, de voro. Hufvudsakligen genom timmerdrifningen nedslogos hans renar och därmed var hans uppehälle som renägande lapp förbi. På sitt lappskatteland sökte han nu att förebygga sin ruin och göra detta fruktbärande. Nu i dessa dagar har den svenske nybyggaren fullbordat lappmannens öde — och lappmannen utestängts från rätten till sitt lappskatteland. Hvad skall nu den arme af olyckan hemföljde söka sitt bröd. Återstår för honom, fadern med de nio barnen, någon annan utväg än att söka brödet hos barmhertiga medmänniskor, så framt han vill undgå hungersnöden? Är nöden här föranledd af lättja eller af verkligt behof?
ta: ஃபாட்மோமேக்கில் உள்ள லாப்மேன் குச்டாஃப் கிளெமென்சன் சில ஆண்டுகளுக்கு முன்பு ஒரு கிணறு -டோ லாப்மேனாக கருதப்பட்டார். அவர் சுமார் 300 கலைமான் ஒரு கலைமான் மந்தை வைத்திருந்தார், இதனால் பெரிய குடும்பத்தினருக்கு, 11 பேர் இருப்பதற்கான வாய்ப்புகள் இருந்தன. முக்கியமாக மர இயக்கி மூலம், அவரது கலைமான் தாமதமாகிவிட்டது, இதனால் அவரது வாழ்க்கை ஒரு தூய இணைப்பு. தனது ஒட்டுவேலை நிலத்தில், இப்போது அவர் தனது அழிவைத் தடுக்கிறார், இந்த பழத்தைத் தாங்கிக் கொள்ள முயன்றார். இப்போது இந்த நாட்களில், ச்வீடிச் புதுமுகம் லாப்மேனின் தலைவிதியை நிறைவு செய்துள்ளார் - மேலும் ஒட்டு மேன் தனது ஒட்டுவேலை நிலத்திற்கு உரிமையிலிருந்து விலக்கப்பட்டார். விபத்தின் தரைப்படை விபத்துடன் வீட்டிற்கு வர வேண்டும். அவருக்கு எஞ்சியிருக்கும், ஒன்பது குழந்தைகளுடன் தந்தை, இரக்கமுள்ள தம மனிதர்களின் ரொட்டியைத் தேடுவதைத் தவிர வேறு வழியில்லாமல், அவர் பஞ்சத்தைத் தவிர்க்க விரும்புகிறாரா? இங்கே சோம்பல் அல்லது உண்மையான தேவையால் வழிநடத்தப்படுகிறதா?

source: Det är sant att hvarje år beviljas ett statsanslag till nödlidande lappar, men dessa understöd ha dock endast i undantagsfall, och då i mycket små belopp kommit de fattiga lapparne till godo. Medlen af sändas till kommunalstyrelserna i de olika lappsocknarne och denna styrelse, som utgöres af svenska bebyggare, behåller merendels summan för kommunens räkning för att betäcka utgifterna för de lappar, som åtnjuta helt understöd af kommunen (s. k. «sockenlappar»).
ta: ஒவ்வொரு ஆண்டும் துன்பகரமான திட்டுகளுக்கு ஒரு மாநில மானியம் வழங்கப்படுகிறது என்பது உண்மைதான், ஆனால் இந்த உதவி, விதிவிலக்கான சந்தர்ப்பங்களில் மட்டுமே, பின்னர் மிகக் குறைந்த அளவுகளில் மோசமான திட்டுகள் பயனடைந்துள்ளன. பல்வேறு ஒட்டுவேலைகளில் உள்ள நகராட்சி கவுன்சில்களுக்கு இந்த பொருள் அனுப்பப்படுகிறது, மேலும் ச்வீடிச் பில்டர்களைக் கொண்ட இந்த வாரியம், நகராட்சியின் சார்பாக பெரும்பாலான தொகையை பராமரிக்கிறது, நகராட்சியின் முழுமையான ஆதரவை அனுபவிக்கும் திட்டுகளுக்கான செலவுகளை ஈடுகட்டுகிறது (எனவே "பாரிச் திட்டுகள்").

source: Om den lappska nöden, orsakerna till lappens tiggeri, till bekymren som hota lapphemmens framtid och därmed förknippade omständigheter, vore mycket att andraga, men då jag tror att de rader jag skrifvit om denna sak, ändrar svenskens uppfattning om detta sakförhållande, öfvergår jag till medlen, hvarmed den lappska befolkningen skulle kunna upphjälpas. Vi hafva velat benämna den
ta: லாபியன் துன்பம், இரப்புணவு எடுப்பதற்கான காரணங்கள், ஒட்டுவேலை எதிர்காலத்தை அச்சுறுத்தும் மற்றும் அதனுடன் தொடர்புடைய சூழ்நிலைகளை அச்சுறுத்தும் கவலைக்கு, சொல்ல வேண்டியது நிறைய இருக்கும், ஆனால் இந்த விசயத்தைப் பற்றி நான் எழுதும் வரிகள் என்று நான் நம்புகிறேன் என்பதால், மாற்றவும் இந்த உண்மை உறவைப் பற்றிய ச்வீடிச் கருத்து, நான் நிதிக்குச் செல்கிறேன், அதனுடன் லாபியன் மக்கள் தொகை பட்டியலிடப்படவில்லை. நாங்கள் அதை அழைக்க விரும்பினோம்

source: Lapparnes existensfråga
ta: லாப்பர்னின் இருப்பு சிக்கல்
