Repository: 247i/TACETr
Catalog: உரை/தானி/rms-personal-data-safe-elsa-laula-lif-doed-*.po
Languages: ta

source: Ställer sig nu <emphasis>den kommunala rösträtten</emphasis> förnuftsvidrig, är den politiska rösträttens förhållande till lappbefolkningen bedröfligare. Lagen stadgar att man, för att hafva rösträtt till Riksdagens Andra kammare, skall hafva en inkomst af 800 kr. eller en jordbrukslägenhet, taxeringsvärderad till 1,000 kr. Intetdera af dessa mått fyller lappen. Af renen kan han icke uppbringa ens 500 kr., och de lappskatteland, hvilka, belägna å allmän kronomark, som de äro, äro ju icke lappens. Hade lappen utsikt att föra fram en representant ur sitt eget led, hade många goda reformer kunnat åstadkommas. Man har sagt att inom riksdagen funnits lapprepresentanter från fjällbygden. Innerst ha dock dessa icke utgjort några målsmän för lappbefolkningen, utan möjligen för nybyggarne, men i hvilket fall som helst till bådas nackdel, då intet synligt resultat af deras verksamhet kvarlämnats annat än möjligen en förbättring i införseln af spritdrycker till lappska gränsen. Stora och viktiga frågor, som beröra vårt folks framtid, föres årligen fram på den lappska dagordningen, och då vi vunnit den skans, som lämnar lappen medbestämmanderätt till sitt eget öde, kunna dessa med glädje framläggas. Dessa frågor äro dock icke kraf som äro obilliga, utan utgöres af sådana förmåner, som redan vunnits af den svenska befolkningen, men ej genom den undantagsställning (ingalunda till lappens fördel) som lappen innehafver, ännu beskärts den lappska rasen. Sekellångt betryck har hvilat på våra skuldror, och däri är att se lappbefolkningens underlägsenhet och efterblifvenhet.
ta: இப்போது, ​​<வலியுறுத்தல்>, நகராட்சி வாக்களிக்கும் உரிமைகள் </வலியுறுத்தல்> விவேகமானவை, ஒட்டு மக்களுக்கான அரசியல் வாக்களிப்பு உரிமைகளின் உறவு மிகவும் சோகமாக உள்ளது. ரிக்ச்டாக்கின் இரண்டாவது அறைக்கு வாக்களிக்கும் உரிமை இருக்க, ஒருவருக்கு SEK 800 வருமானம் இருக்க வேண்டும் என்று சட்டம் கூறுகிறது. அல்லது ஒரு விவசாய அபார்ட்மென்ட், SEK 1,000 மதிப்புள்ள வரி. இந்த பரிமாணங்கள் எதுவும் இணைப்பை நிரப்பவில்லை. கலைமான் 500 ஐக் கூட கொண்டு வர முடியாது, மேலும் அவை பொது காலவரிசையில் அமைந்துள்ள ஒட்டுவேலை நிலங்கள், அவை இணைப்பு அல்ல. ஒரு பிரதிநிதியை தனது சொந்த வழியிலிருந்து வெளியே கொண்டு வருவதற்கு ஒட்டு ஒரு பார்வை இருந்திருந்தால், பல நல்ல சீர்திருத்தங்களை அடைய முடியும். ரிக்ச்டாக்கிற்குள் மலை கிராமப்புறங்களைச் சேர்ந்த ஒட்டு பிரதிநிதிகள் இருந்ததாகக் கூறப்படுகிறது. எவ்வாறாயினும், கடந்த காலங்களில், இவை ஒட்டு மக்கள்தொகைக்கான எந்தவொரு கோல்கீப்பர்களையும் உருவாக்கவில்லை, ஆனால் குடியேறியவர்களுக்கு, ஆனால் எந்தவொரு சந்தர்ப்பத்திலும் இருவரின் பாதகத்திற்கும், அவற்றின் செயல்பாடுகளின் புலப்படும் முடிவுகள் எதுவும் விடப்படவில்லை என்பதால் லாப்ச்கா எல்லைக்கு ஆவிகள் இறக்குமதி செய்தல். எங்கள் மக்களின் எதிர்காலத்தை கையாளும் பெரிய மற்றும் முக்கியமான சிக்கல்கள், ஆண்டுதோறும் லாப்பிச் நிகழ்ச்சி நிரலில் பரிந்துரைக்கப்படுகின்றன, மேலும் நாங்கள் ச்கான்களை வென்றபோது, ​​இது அவர்களின் சொந்த விதிக்கு இணைத் தடையை விட்டுச்செல்லும் போது, ​​இவை மகிழ்ச்சியுடன் வழங்கப்படலாம். எவ்வாறாயினும், இந்த சிக்கல்கள் விருப்பமில்லாத ஆற்றல் அல்ல, ஆனால் ச்வீடிச் மக்களால் ஏற்கனவே வென்ற நன்மைகளால் ஆனவை, ஆனால் விதிவிலக்கால் அல்ல (இணைப்புக்கு ஆதரவாக எந்த வகையிலும்) குறிப்பு, லாபியன் இனம் இன்னும் செதுக்கப்பட்டது . தேர்ந்தெடுக்கப்பட்ட அழுத்தம் நம் தோள்களில் தங்கியிருக்கிறது, அதில் ஒட்டு மக்கள்தொகையின் தாழ்வு மற்றும் பின்விளைவுகளைக் காண வேண்டும்.

source: Lappska skolförhållanden.
ta: பள்ளி நிலைமைகள்.

source: Man låter alltid lappbefolkningen uppbära förnärmelser för att den är okunnig, men man undersöker så ytterst sällan skälet, hvarför upplysningen ej vunnit insteg bland vårt folk. Skälet är dock icke svårt att uppleta. Af naturen är lappen icke vanlottad. Tvärtom! Det har erkänts att den unge lappen äger goda förutsättningar för att vinna upplysning. Orsaken ligger i det helt naturliga skälet, att lappen icke ägnas någon uppmärksamhet i upplysningshänseende. Ända till dess Lappska missionen inrättade skolor däruppe bland fjällen hafva vi lappar icke haft någon undervisning. Denna välgörande förening verkar mycket godt, men kan dock i utsträckning ej inverka på ett helt folk. Det lappska barnet sändes till denna skola vid cirka 12 års ålder och kvarstannar där i 3 år. Under denna jämförelsevis korta tid får den unge lappen inhämta all den undervisning, som står honom till buds. Att detta icke blir mycket, beror väl på att denna skola indelas i småbarns- och folkskola. Med denna undervisning går han ut i lifvet, och då må man ej undra på om lappen är okunnig. Skulle lappen däremot få tillägna sig den undervisning, som de svenska barnen åtnjuta, skulle nog bildning och intelligens äfven vinna insteg i Lappland.
ta: ஒட்டு மக்கள்தொகையை கருத்துகளைப் பெற நீங்கள் எப்போதும் அனுமதிக்கிறீர்கள், ஏனெனில் இது அறியாதது, ஆனால் நீங்கள் மிகவும் அரிதாகவே விசாரிக்கப்படுகிறீர்கள், அதனால்தான் செய்தி எங்கள் மக்களிடையே நுழைவு பெறவில்லை. இருப்பினும், காரணம் எழுந்திருப்பது கடினம் அல்ல. இயற்கையால், இணைப்பு இடைவெளி இல்லை. மாறாக! அறிவொளியை வெல்வதற்கு இளம் குறிப்புக்கு நல்ல நிலைமைகள் உள்ளன என்பதை ஒப்புக் கொள்ளப்பட்டுள்ளது. குறிப்புக்கு எந்த கவனம் செலுத்தப்படவில்லை என்பதற்கான இயல்பான காரணத்தினால் காரணம். அதன் லாப்பிச் பணி வரை, மலைகள் மத்தியில் பள்ளிகள் அமைக்கப்பட்டன. இந்த தொண்டு சங்கம் மிகவும் நன்றாக இருக்கிறது, ஆனால் ஒரு முழு மக்களையும் பாதிக்க முடியாது. பாப்பிச் குழந்தை சுமார் 12 வயதில் இந்த பள்ளிக்கு அனுப்பப்பட்டு 3 ஆண்டுகள் அங்கேயே உள்ளது. இந்த ஒப்பீட்டளவில் குறுகிய காலத்தில், இளம் குறிப்பு அவருக்குக் கிடைக்கும் அனைத்து போதனைகளையும் பெறலாம். இந்த பள்ளி குறுநடை போடும் குழந்தை மற்றும் தொடக்கப்பள்ளியாக பிரிக்கப்பட்டுள்ளதால் இது அதிகம் இல்லை. இந்த போதனையுடன் அவர் வாழ்க்கையில் வெளியே செல்கிறார், பின்னர் குறிப்பு அறியாதவரா என்று ஒருவர் ஆச்சரியப்படக்கூடாது. மறுபுறம், ச்வீடிச் குழந்தைகள் அனுபவிக்கும் போதனைகளைப் பெற ஒட்டு அனுமதிக்கப்பட வேண்டும் என்றால், அநேகமாக கல்வியும் உளவுத்துறையும் லாப்லாண்டில் நுழைவார்கள்.

source: Till ofvan nämnda skolor — andra skolor finnas ej — bidrager staten endast med en ringa skärf, men månne ej den svenska staten äfven har skyldighet att bland den lappska befolkningen inrätta skolor, om ej sådana som de svenska, så dock drägligare skolförhållanden?
ta: மேற்கூறிய பள்ளிகளுக்கு - பிற பள்ளிகள் இல்லை - அரசு ஒரு சிறிய வெட்டுடன் மட்டுமே பங்களிக்கிறது, ஆனால் ச்வீடிச் மக்களிடையே பள்ளிகளை அமைப்பதற்கான கடமை ச்வீடிச் மக்களிடையே இல்லை, இல்லையென்றால் ச்வீடிச் போன்றவை அல்ல பள்ளி நிலைமைகள்?

source: I likhet med dryckenskapslasten, kastas okunnigheten på lapparne som en skuggande, förklarande omständighet till nu rådande förhållanden. Men okunnigheten har sitt upphof i bristen på något att lära i yngre år, icke i lappbarnets motvilja för bildning och utveckling.
ta: குடி சுமைகளைப் போலவே, லாப்பார்னின் அறியாமை தற்போதைய நிலைமைகளுக்கு ஒரு நிழல், விளக்கமளிக்கும் சூழ்நிலையாக வீசப்படுகிறது. ஆனால் அறியாமை இளைய ஆண்டுகளில் கற்றுக்கொள்ள ஏதாவது இல்லாத நிலையில், கல்வி மற்றும் மேம்பாட்டுக்கு லாப் குழந்தையின் தயக்கத்தில் அல்ல.

source: Hvad är att närmast göra?
ta: மிக நெருக்கமாக என்ன செய்ய வேண்டும்?

source: Mer och mer söker den frågan sig fram, hvad som vi närmast skola göra. Vi kunna icke längre lita på att utom saken stående skola så intressera sig för vårt folks ställning, att de skola bevaka vår rätt. Och med all möjlig möda kunna de det icke. Våra säregna lefnads- och andra förhållanden äro af sådan beskaffenhet, att om äfven reformer skulle vinnas på dessa vägar, skulle dessa endast blifva halfmessyrer af tvifvelaktig innebörd. Våra tvister om rätten till jorden måste dagligen bevakas och våra frågor måste stundligen föras framåt. Men då måste lappen taga saken i sin egen hand. På hvad sätt? frågar mången. Det finnes icke mer än ett. Och detta är: en enhetlig lappsk förening, fungerande i hvarje lifsnerv af lappska befolkningen. I hvarje större by eller kommun bildas en förening, låt oss exempelvis säga Tärna by lappförening. Denna utlyser ett möte med lapparne i Tärnaby och skrider till val af styrelse. Denna styrelse får i uppdrag att emottaga tvistefrågor, med föreningen diskutera de reformer, som äro önskvärda och äfvenledes föra fram desamma till en centralstyrelse för hela lappbefolkningen, utlysa möten och i alla delar tillvarataga den lappska befolkningens kraf. Sådana föreningar böra så fort sig göras kan bildas i alla lappkommuner eller större byar i Jämtland, Vester- och Norrbotten. På våren 1905 utser de lappska föreningarne hvar sitt ombud att sammanträda i exempelvis Fatmomakke, och där behandlas sedan våra gemensamma lifsfrågor. Där kommer då den första lappska kongressen till stånd och sedan åstadkommes nog af sig själf, dock under träget arbete, ett annat förhållande. Med en dylik organisation kunna vi påräkna en makt, som obetingadt kommer att föra vår sak till seger.
ta: மேலும் மேலும், இது நாம் மிக நெருக்கமாக என்ன செய்வோம் என்ற கேள்வியைத் தேடுகிறது. இந்த விசயத்திற்கு வெளியே, எங்கள் மக்களின் நிலைப்பாட்டில் அவர்கள் எங்கள் உரிமையை கண்காணிப்பார்கள் என்று நாங்கள் இனி நம்ப முடியாது. மற்றும் சாத்தியமான அனைத்து முயற்சிகளிலும் அவர்களால் முடியாது. எங்கள் விசித்திரமான வாழ்க்கையும் பிற நிபந்தனைகளும் அத்தகைய இயல்புடையவை, இந்த சாலைகளில் சீர்திருத்தங்களும் வென்றால், இவை சந்தேகத்திற்குரிய அர்த்தத்தின் அரை மெச்களாக மட்டுமே இருக்கும். பூமிக்கான உரிமை குறித்த எங்கள் மோதல்கள் தினமும் கண்காணிக்கப்பட வேண்டும், எங்கள் கேள்விகள் அவ்வப்போது முன்வைக்கப்பட வேண்டும். ஆனால் பின்னர் இணைப்பு இந்த விசயத்தை அதன் சொந்த கையில் எடுக்க வேண்டும். என்ன வழி? பல கேட்கிறது. ஒன்றுக்கு மேற்பட்டவர்கள் இல்லை. இது: ஒரு சீரான லாப்ச்க் சங்கம், லேபிச் மக்கள்தொகையின் ஒவ்வொரு வாழ்க்கை நரம்பிலும் செயல்படுகிறது. ஒவ்வொரு பெரிய கிராமத்திலும் அல்லது நகராட்சியிலும், ஒரு சங்கம் உருவாகிறது, எடுத்துக்காட்டாக, லாப்ஃபெரனிங் மூலம் டர்னாவைக் கூறுவோம். இது டார்னாபியில் உள்ள லாப்பர்னே உடனான சந்திப்பை அறிவித்து வாரியத்தின் தேர்தலுக்கு நடவடிக்கை எடுக்கிறது. இந்த வாரியம் தகராறு சிக்கல்களைப் பெற நியமிக்கப்பட்டுள்ளது, சங்கம் விரும்பத்தக்க சீர்திருத்தங்களைப் பற்றி விவாதித்து, முழு ஒட்டு மக்களுக்கும் ஒரு நடு வாரியத்திற்கும் இதைப் பற்றி விவாதிக்கிறது, கூட்டங்களை அறிவிக்கிறது மற்றும் எல்லா வகையிலும் லாப்சியன் மக்கள்தொகையின் சக்தியைப் பயன்படுத்துகிறது. இத்தகைய சங்கங்கள் விரைவில் செய்யப்பட வேண்டும், சாம்ட்லேண்ட், வெச்டர் மற்றும் நோர்போட்டன் ஆகியவற்றில் உள்ள அனைத்து ஒட்டு நகராட்சிகளிலோ அல்லது பெரிய கிராமங்களிலோ உருவாக்க முடியும். 1905 வசந்த காலத்தில், லாப்பிச் சங்கங்கள் ஒவ்வொரு பிரதிநிதியையும் சந்திக்க நியமிக்கிறது, எடுத்துக்காட்டாக, ஃபாட்மோமாக், பின்னர் எங்கள் பொதுவான பிரச்சினைகள் கையாளப்படுகின்றன. அங்கு, முதல் லாப்ச்கா காங்கிரச் பலனளிக்கும், பின்னர் அந்த வேலையின் போது, ​​மற்றொரு உறவின் போது போதுமான அளவு சாதிக்கும். அத்தகைய அமைப்பைக் கொண்டு, ஒரு சக்தியை நாம் எண்ணலாம், இது நிபந்தனையின்றி எங்கள் காரணத்தை வெற்றிக்கு கொண்டு வரும்.

source: När vi stå en och en kunna vi föga eller litet uträtta. Gemensamt hafva vi dock ett intresse, och detta intresse måste förenas och blifva en makt. Och inom kort skola vi hafva en duglig stab af egna landsmän, som med insikt, reda och klokhet bringar saken vidare fram.
ta: நாம் ஒவ்வொன்றாக நிற்கும்போது, ​​நாம் கொஞ்சம் அல்லது கொஞ்சம் சாதிக்க முடியும். இருப்பினும், பொதுவாக, எங்களுக்கு ஒரு ஆர்வம் உள்ளது, மேலும் இந்த ஆர்வம் ஒன்றுபட்டு ஒரு சக்தியாக மாற வேண்டும். விரைவில் எங்கள் சொந்த நாட்டு மக்களின் நல்ல ஊழியர்களைக் கொண்டிருப்போம், அவர்கள் நுண்ணறிவுடன், கண்டுபிடி மற்றும் ஞானத்தை, மேலும் இந்த விசயத்தை மேம்படுத்துவார்கள்.

source: Till Eder, I unga män och kvinnor, vill jag säga ett ord. Vårt folks framtid ligger i Edra händer. Med Eder kraft skall vårt folk och land vidmakthållas. Sky inga umbäranden när det gäller vårt folk och vårt påtänkta föreningsband! Medlet, hvarmed vår stam skall upplyftas, finnes i den utstakade vägen, och en gång funnen, beträdd och trampad, skall mödan ingalunda blifva fruktlös. Därföre, fram, I bröder och systrar från Jemtland, Vester- och Norrbotten, upp att verka för de nedtryckta; tillägnen Eder all den bildning, som I kunnen få, stöd de svaga i kampen för tillvaron och tänk på vårt framtidsmål!
ta: உங்களுக்கு, இளைஞர்கள் மற்றும் பெண்களில், நான் ஒரு சொல் சொல்ல விரும்புகிறேன். எங்கள் மக்களின் எதிர்காலம் உங்கள் கைகளில் உள்ளது. உங்கள் சக்தியால், எங்கள் மக்களும் நிலமும் பராமரிக்கப்பட வேண்டும். எங்கள் மக்களுக்கும், நம்முடைய திட்டமிடப்பட்ட அசோசியேசன் இசைக்குழுவிலும் வரும்போது ச்கை இல்லை கச்டங்கள்! எங்கள் பழங்குடியினர் உயர்த்தப்பட வேண்டிய முகவர், செட் பாதையில் காணப்படுகிறார், மேலும் ஒரு முறை கண்டுபிடிக்கப்பட்டு, நுழைந்து மிதித்தால், முயற்சி பலனற்றதாக இருக்காது. ஆகையால், செம்ட்லேண்ட், வெச்டர் மற்றும் நோர்போட்டன் ஆகியோரின் சகோதர சகோதரிகளில், மனச்சோர்வடைந்தவர்களுக்கு வேலை செய்ய; பெறக்கூடிய அனைத்து உருவாக்கங்களும் உங்களுக்கு கிடைக்கின்றன, வாழ்க்கைக்கான போராட்டத்தில் பலவீனமானவர்களை ஆதரிக்கவும், எங்கள் எதிர்கால இலக்கைப் பற்றி சிந்திக்கவும்!

source: Till Eder, I gamle, genom motgångar härdade, genom ett träget arbete för tidigt utsläpade, sluten eder till våra föreningar i massa. Ingen enda lapp får saknas i vår förening. Det är de betryckta, som skola föra sin talan fram i ljuset, och detta på ett fullt värdigt, parlamentariskt sätt. Det blir lapparnes riksdag, som nästa år skall samlas å tidpunkt och ställe, som sedan skall bestämmas.
ta: ஈடருக்கு, பழையது, துன்பத்தின் மூலம், ஒரு தொண்டை வேலை மூலம் முன்கூட்டியே தீர்ந்துவிட்டது, உங்களை மாச்சில் உள்ள எங்கள் சங்கங்களுக்கு மூடியது. எங்கள் சங்கத்தில் எந்த ஒரு குறிப்பும் இல்லை. ஒடுக்கப்பட்டவர்கள் தான் தங்கள் செயலை வெளிச்சத்தில் கொண்டு வருவார்கள், இது முழு கண்ணியமான, பாராளுமன்ற வழியில். இது லாப்ச் பாராளுமன்றமாக இருக்கும், இது அடுத்த ஆண்டு நேரத்திலும் இடத்திலும் சேகரிக்கப்படும், பின்னர் அது தீர்மானிக்கப்படும்.

source: För att nu allt skall bildas enhetligt för hela vårt folk och efter samma grunder, så lämnar jag beredvilligt alla upplysningar om denna sak.
ta: எங்கள் முழு மக்களுக்கும் ஒரே மாதிரியாகவும், ஒரே அடிப்படையில், இந்த விசயத்தைப் பற்றிய அனைத்து தகவல்களையும் நான் உடனடியாக வழங்குவேன்.

source: Med dessa maningsord till Eder, bröder och systrar, slutar jag dessa ord. Låt nu handlingarne kraftigt åtfölja dessa ord af mig, framlagda i en tid, då lappens framtid synes hotad från alla sidor, och hans rätt till den jord, hvartill vi alla födts att söka vårt uppehälle, bestridd.
ta: சகோதர சகோதரிகளே, இந்த வார்த்தைகளால் நான் இந்த வார்த்தைகளை முடிக்கிறேன். இப்போது ஆவணங்கள் இந்த வார்த்தைகளை என்னால் வலுவாகக் கொண்டு வரட்டும், இது பேட்சின் எதிர்காலம் எல்லா பக்கங்களிலிருந்தும் அச்சுறுத்தப்பட்டதாகத் தோன்றும் நேரத்தில், பூமிக்கு அவரது உரிமை, நாம் அனைவரும் நம் வாழ்க்கையைத் தேடுவதற்காக பிறந்தோம்.

source: Må den Högste, som leder och danar folkens öden nu och allt framgent med misskundsamhet förbarma sig öfver vårt folk och leda dess väg in på den bana, som lyfter det upp till ett intelligent och framåtsträfvande kulturfolk.
ta: மிக உயர்ந்தவர்கள், இப்போது மக்களின் தலைவிதியை வழிநடத்தும் மற்றும் நடனமாடுவார்கள், எதிர்காலத்தில் எல்லாவற்றையும் நம் மக்கள் மீது தவறான நடத்தை கொண்டு, அதன் பாதையை ஒரு புத்திசாலித்தனமான மற்றும் முன்னோக்கி பார்க்கும் கலாச்சார மக்களுக்கு உயர்த்தும் பாதையில் வழிநடத்தலாம்.

source: <?latex \vspace{5mm} ?>
ta: <? லாடெக்சு \ vspace {5mm}?>

source: Gardfjäll, Dikanäs, Vilhelmina i juli 1904.
ta: கார்ட்ஃப்சால், டிகானச், வில்எல்மினா சூலை 1904 இல்.

source: Med systerlig hälsning
ta: உடன்பிறந்தவள் வாழ்த்துடன்

source: Elsa Laula.
ta: எல்சா லாலா.

source: Inför lif eller död? Sanningsord i de lappska förhållandena / Else Laula (Renberg) (1877-1931).
ta: லைஃப் அல்லது மரணத்திற்கு முன்? லாபியன் நிலைமைகளில் உண்மை சொற்கள் / வேறு லாலா (ரென்பெர்க்) (1877-1931).

source: © 1904 Else Laula.
ta: © 1904 வேறு பார்வை.

source: © 2024 Petter Reinholdtsen. En del rättigheter bevarade.
ta: © 2024 பெட்டர் ரெய்ன்ஓல்ட்சென். சில உரிமைகள் பாதுகாக்கப்படுகின்றன.

source: Originalet publicerades ursprungligen 1904. Återutgiven april 2024 av Petter Reinholdtsen.
ta: அசல் முதலில் 1904 இல் வெளியிடப்பட்டது. ஏப்ரல் 2024 இல் பெட்டர் ரெய்ன்ஓல்ட்சென் திரும்பினார்.

source: Typsatt med <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> och typsnitt Crimson Text.
ta: <Ulink முகவரி = "http://dblatex.sourceforge.net"> dblatex </ulink> மற்றும் எழுத்துரு கிரிம்சன் உரையுடன் தட்டச்சு செய்க.

source: Omslaget är designat av förleggare. Porträtt på omslaget är baserat på en fotografi från 1916 med okänd fotograf, tillgänglig för allmänheten domäntermer från Wikipedia, <ulink url="https://commons.wikimedia.org/wiki/File:Elsa_Laula_Renberg.jpg"/>.
ta: கவர் வெளிப்புற கியர் மூலம் வடிவமைக்கப்பட்டுள்ளது. அட்டைப்படத்தின் உருவப்படம் 1916 ஆம் ஆண்டு அறியப்படாத புகைப்படக் கலைஞருடன் ஒரு புகைப்படத்தை அடிப்படையாகக் கொண்டது, இது விக்கிபீடியாவிலிருந்து பொது டொமைன் விதிமுறைகளுக்கு கிடைக்கிறது, <ulink முகவரி = "https://commons.wikimedia.org

source: Bergteckningen på omslaget är hämtade från <ulink url="https://pixabay.com/vectors/mountain-top-grand-silhouette-far-306236/"/> och <ulink url="https://svgsilh.com/zh/image/306236.html"/> där den är tillgängliga med användarvillkoren Creative Commons 0.
ta: அட்டைப்படத்தில் உள்ள மலை வரைதல் <ulink முகவரி = "https://pixabay.com/vectors/mountain-to-grand-silhoute-far-306236/"/> மற்றும் <ulink முகவரி = "https: // svgsilh .com zh/image/306236.html "/> இது கிரியேட்டிவ் காமன்ச் பயன்பாட்டு விதிமுறைகளுடன் கிடைக்கும்.

source: Källfilerna är tillgängliga från <ulink url="https://codeberg.org/pere/text-infor-lif-elsa-laula"/>. Rapporter eventuella kommentarer och input om boken där.
ta: மூல கோப்புகள் <ulink முகவரி = "https://codeberg.org/pere/text-infor-lif-elsa-laula"/> இலிருந்து கிடைக்கின்றன. அங்குள்ள புத்தகத்தைப் பற்றிய சாத்தியமான கருத்துகள் மற்றும் உள்ளீட்டைப் புகாரளிக்கிறது.

source: images/cc.svg
ta: படங்கள்/cc.svg

source: Format / MIME-type
ta: வடிவம் / மைம்-வகை

source: US Trade-utgåvan tillgänglig från lulu.com
ta: அமெரிக்க வர்த்தக பதிப்பு lulu.com இலிருந்து கிடைக்கிறது

source: application/pdf
ta: விண்ணப்பம்/PDF

source: application/epub+zip tillgänglig från lulu.com
ta: பயன்பாடு/EPUB+ZIP LULU.com இலிருந்து கிடைக்கிறது
