Repository: 247i/TACETr
Catalog: உரை/தானி/ror-player-tune-description-xango-*.po
Languages: ta

source: Was drawn as the **Tune of the Year 2019**.
ta: 2019 ஆம் ஆண்டின் ** டியூன் ** ஆக வரையப்பட்டது.

source: Start the tune with the intro break (without surdos), then count in the Surdos for the "Surdo intro part". Come out of the intro and into the groove using the Boum Shakla Break.
ta: அறிமுக இடைவெளியுடன் (சூர்டோச் இல்லாமல்) ட்யூனைத் தொடங்கவும், பின்னர் "சூர்டோ இன்ட்ரோ பகுதிக்கு" சூர்டோசில் எண்ணவும். ப ou ம் சாக்லா இடைவேளையைப் பயன்படுத்தி அறிமுகத்திலிருந்து மற்றும் பள்ளத்திற்கு வெளியே வாருங்கள்.

source: Sign
ta: அடையாளம்

source: Xangô Tune Sign
ta: சாங்கோ டியூன் அடையாளம்

source: Rain trickling down, with 10 fingers
ta: 10 விரல்களுடன், மழை தந்திரமாக இருக்கிறது

source: Background
ta: பின்னணி

source: **Name:** Xangô (pronounced Shango) is an Orisha, a spirit in the Yoruba religion (originating from Central Africa, but making its way to South America through slavery) ([Wikipedia]{1}). Xangô is the god of lighning and thunder, known and feared for his strength and agression.
ta: . சாங்கா லைட் மற்றும் இடி கொண்ட கடவுள், அவருடைய வலிமை மற்றும் ஆக்ரசத்திற்காக அறியப்பட்ட மற்றும் பயப்படுகிறார்.

source: Traditional Xango ceremonial drumming are one of the influences to Afro-Brazilian music. There are quite a lot of groups and songs that have the word Xango in their name.
ta: பாரம்பரிய xango சடங்கு டிரம்மிங் என்பது ஆப்ரோ-பிரேசிலியன் இசையின் தாக்கங்களில் ஒன்றாகும். அவற்றின் பெயரில் xango என்ற வார்த்தையைக் கொண்ட குழுக்கள் மற்றும் பாடல்கள் நிறைய உள்ளன.

source: **Musical background:** A group called Xangó Batucada seems to play something similar to our tune ([YouTube]{1}, [Facebook]{2}). *(More info needed.)*
ta: ** இசை பின்னணி: ** xange படுகாடா என்ற குழு எங்கள் பாடலுக்கு ([YouTube] {1}, [Facebook] {2}) ஒத்த ஒன்றை விளையாடுவதாக தெரிகிறது. *(மேலும் செய்தி தேவை.)*

source: **Sign:** The tune sign is supposed to symbolize the rain in the thunder storm the rhythm is supposed to represent. The tune is to remind of the thunder, the rain and the lightning of the god (or spirit).
ta: ** அடையாளம்: ** இடி புயலில் மழையை குறிக்கும் டியூன் அடையாளம் தாளம் பிரதிநிதித்துவப்படுத்த வேண்டும். கடவுளின் (அல்லது ஆவி) இடி, மழை மற்றும் மின்னல் ஆகியவற்றை நினைவூட்டுவதே இசைக்குழு.

source: **History:** Part of the second round of tunes taken from Barking Bateria in 2004/2005.
ta: ** வரலாறு: ** 2004/2005 இல் குரைக்கும் பாக்டீரியாவிலிருந்து எடுக்கப்பட்ட இரண்டாவது சுற்று பாடலின் ஒரு பகுதி.

source: Meaning / Origin of Xangô
ta: Xangô இன் பொருள் / தோற்றம்

source: Religion: Its origin is the religion of the Yoruba, a Westafrican people / ethnic group connected mainly via language. It‘s believed that there is a Supreme Being known as Olorun or Olodumaré. Several gods called „powers“ are worshipped (intermediary spiritual beings, also called orixas in other religions. Every orixa is connected to a natural phenomenon, colors, food, …). Drumming, dancing and singing are used for rituals, in which for example one deity is called down to manifest by possessing a person. People seek guidance and protection by the orixas through dance, song and sacrifice, the powers are appeased and worshipped.
ta: மதம்: அதன் தோற்றம் யோருப்பாவின் மதம், ஒரு வெச்டாஃப்ரிகன் மக்கள் / இனக்குழு முக்கியமாக மொழி வழியாக இணைக்கப்பட்டுள்ளது. ஓலோருன் அல்லது ஓலோடுமாரே என்று அழைக்கப்படும் ஒரு உச்சம் இருப்பதாக இது நம்பியது. "சக்திகள்" என்று அழைக்கப்படும் பல கடவுள்கள் வணங்கப்படுகிறார்கள் (இடைத்தரக ஆன்மீக மனிதர்கள், பிற மதங்களில் ஓரிக்சாச் என்றும் அழைக்கப்படுகிறார்கள். ஒவ்வொரு ஓரிக்சாவும் இயற்கையான நிகழ்வு, வண்ணங்கள், உணவு,…) உடன் இணைக்கப்பட்டுள்ளது. டிரம்மிங், நடனம் மற்றும் பாடல் சடங்குகளுக்கு பயன்படுத்தப்படுகின்றன, எடுத்துக்காட்டாக ஒரு தெய்வத்தை வைத்திருப்பதன் மூலம் ஒரு தெய்வம் வெளிப்படுவதற்கு அழைக்கப்படுகிறது. நடனம், பாடல் மற்றும் கொடை மூலம் ஓரிக்சாக்களால் மக்கள் வழிகாட்டுதலையும் பாதுகாப்பையும் நாடுகிறார்கள், அதிகாரங்கள் சமாதானப்படுத்தப்பட்டு வழிபடுகின்றன.

source: Orixa / Deity: Most popular orixa in the Yoruba-religion and the religions that derive from it. God of thunder and lightning, represents justice and wisdom, very powerful and known for his anger, his power is the main symbol of African resistance against slavery.
ta: ஓரிக்சா / தெய்வம்: யோருப்பா-மதத்தில் மிகவும் பிரபலமான ஓரிக்சா மற்றும் அதிலிருந்து பெறப்பட்ட மதங்கள். இடி மற்றும் மின்னல் கடவுள், நீதியையும் ஞானத்தையும் குறிக்கிறது, மிகவும் சக்திவாய்ந்த மற்றும் அவரது கோபத்திற்கு பெயர் பெற்றது, அவரது ஆற்றல் அடிமைத்தனத்திற்கு எதிரான ஆப்பிரிக்க எதிர்ப்பின் முக்கிய அடையாளமாகும்.

source: Elements of Christianism in Candomblé, Shango and other African religions
ta: கேண்டம்ப்ளே, சாங்கோ மற்றும் பிற ஆப்பிரிக்க மதங்களில் கிறிச்தவ மதத்தின் கூறுகள்

source: During colonization, enslaved people recognized that some of the Catholic saints shared symbols and characteristics with their orixas. They began to identify some of the orixas with these saints, as a method to secretly worship their actual gods while pretending to embrace the faith of their masters. Depending on the region, orixas correspond to different saints. Xangô corresponds to Saint Barbara (she is also associated with lightning and thunder) or Saint Jerome.
ta: காலனித்துவத்தின் போது, ​​அடிமைப்படுத்தப்பட்ட மக்கள் சில கத்தோலிக்க புனிதர்கள் தங்கள் ஓரிக்சாக்களுடன் சின்னங்களையும் குணாதிசயங்களையும் பகிர்ந்து கொண்டனர் என்பதை உணர்ந்தனர். இந்த புனிதர்களுடன் சில ஓரிக்சாக்களை அவர்கள் அடையாளம் காணத் தொடங்கினர், தங்கள் எசமானர்களின் நம்பிக்கையைத் தழுவுவதாக நடித்து, தங்கள் உண்மையான கடவுள்களை ரகசியமாக வணங்குவதற்கான ஒரு முறையாக. பிராந்தியத்தைப் பொறுத்து, ஓரிக்சாச் வெவ்வேறு புனிதர்களுடன் ஒத்திருக்கும். Xangô செயிண்ட் பார்பராவுடன் ஒத்திருக்கிறது (அவள் மின்னல் மற்றும் தண்டருடன் தொடர்புடையவள்) அல்லது செயிண்ட் செரோம்.

source: In 1983, there was a conference on the orixa tradition and culture in Salvador (Bahia), when some Candomblé priest*esses proposed to do away with the Catholic elements in Candomblé (especially imagery of saints). Today it’s hotly debated whether to do this or not.
ta: 1983 ஆம் ஆண்டில், சால்வடாரில் (பஇயா) ஓரிக்சா பாரம்பரியம் மற்றும் பண்பாடு குறித்த ஒரு மாநாடு இருந்தது, சில கேண்டம்ப்ளே பூசாரி*கட்டுரைகள் கேண்டம்ப்ளே (குறிப்பாக புனிதர்களின் படங்கள்) இல் கத்தோலிக்க கூறுகளை அகற்ற முன்மொழிந்தன. இதைச் செய்யலாமா வேண்டாமா என்பது இன்று பரபரப்பாக விவாதிக்கப்படுகிறது.

source: Controversies
ta: சர்ச்சைகள்

source: Since this tune is directly rooted in Afro-Brazilian religion, many people in the RoR network consider it cultural appropriation to play it. There is an ongoing debate on whether this tune should be abandoned.
ta: இந்த இசைக்கு நேரடியாக ஆப்ரோ-பிரேசிலிய மதத்தில் வேரூன்றியுள்ளதால், ROR நெட்வொர்க்கில் உள்ள பலர் அதை விளையாடுவது கலாச்சார ஒதுக்கீட்டைக் கருதுகின்றனர். இந்த பாடலை கைவிட வேண்டுமா என்பது குறித்து தொடர்ந்து விவாதம் உள்ளது.

source: Difficulty
ta: தொல்லை

source: **Surdos:** easy
ta: ** சூர்டோச்: ** எளிதானது

source: **Repi:** medium
ta: ** ரச்: ** சராசரி

source: **Snare:** hard
ta: ** SNARE: ** கடினமானது

source: **Tamborim:** easy
ta: ** தம்போரிம்: ** எளிதானது

source: **Agogô:** medium
ta: ** அகோகே: ** நடுத்தர
