Repository: 247i/TACETr
Catalog: உரை/தானி/sanmill-f-droid-metadata-*.po
Languages: ta

# title.txt:1
source: Mill
ta: மில்

# short_description.txt:1
source: A Mill Game which supports many rule variants, written in Flutter
ta: பல விதி மாறுபாடுகளை ஆதரிக்கும் ஒரு ஆலை விளையாட்டு, படபடப்பில் எழுதப்பட்டது

# full_description.txt:1
source: A Nine Men's Morris (and its variants) program Rules: * A player who aligns three of his pieces on a board line has a mill and may remove his opponent's piece(s). * Any player reduces to two pieces and has no option to form new mills and thus loses the game. * If a player cannot move one of his pieces (is locked up), he has lost the game. Features: * Support many rule variants, such as Nine Men's Morris and Twelve Men's Morris, "Flying" rule or no "Flying" rule * Play against the AI, or play both sides * Adjustable playing strength * Highly configurable * Color themes * Accessibility
ta: ஒன்பது ஆண்கள் மோரிச் (மற்றும் அதன் மாறுபாடுகள்) திட்டம் விதிகள்: * ஒரு போர்டு வரிசையில் தனது மூன்று துண்டுகளை சீரமைக்கும் ஒரு வீரர் ஒரு ஆலை வைத்திருக்கிறார், மேலும் அவரது எதிரியின் துண்டு (களை) அகற்றலாம். * எந்தவொரு வீரரும் இரண்டு துண்டுகளாகக் குறைகிறார்கள், மேலும் புதிய ஆலைகளை உருவாக்க விருப்பமில்லை, இதனால் விளையாட்டை இழக்கிறது. * ஒரு வீரர் தனது துண்டுகளில் ஒன்றை நகர்த்த முடியாவிட்டால் (பூட்டப்பட்டுள்ளது), அவர் விளையாட்டை இழந்துவிட்டார். அம்சங்கள்: * ஒன்பது ஆண்கள் மோரிச் மற்றும் பன்னிரண்டு ஆண்கள் மோரிச் போன்ற பல விதி மாறுபாடுகளை ஆதரிக்கவும், "பறக்கும்" விதி அல்லது "பறக்கும்" விதி இல்லை * AI க்கு எதிராக விளையாடுங்கள், அல்லது இருபுறமும் விளையாடுங்கள் * சரிசெய்யக்கூடிய விளையாட்டு வலிமை * மிகவும் கட்டமைக்கக்கூடியது * வண்ண கருப்பொருள்கள் * அணுகல்

# changelogs/1768.txt:1
source: v1.0.3 * Show restart/cancel buttons instead of yes/no buttons on dialog when player win the top difficult level.
ta: v1.0.3 * பிளேயர் சிறந்த கடினமான நிலையை வெல்லும்போது ஆம்/உரையாடலில் ஆம்/இல்லை பொத்தான்களுக்கு பதிலாக மறுதொடக்கம்/ரத்துசெய் பொத்தான்களைக் காட்டு.

# changelogs/1776.txt:1
source: v1.0.4 * Lock screen orientation to portrait.
ta: v1.0.4 * உருவப்படத்திற்கு திரை நோக்குநிலையை பூட்டவும்.

# changelogs/1797.txt:1
source: v1.0.5 * Indicate white pieces as player 1 and black as player 2 * Change text 'Hint' to 'Info' * Fix typo
ta: v1.0.5 * வெள்ளை துண்டுகளை பிளேயர் 1 ஆகவும், பிளாக் பிளேயர் 2 ஆகவும் குறிக்கவும் * உரையை 'குறிப்பை' 'செய்தி' என மாற்றவும் * எழுத்துப்பிழை சரிசெய்யவும்

# changelogs/1810.txt:1
source: v1.0.6 * Improve stability.
ta: v1.0.6 * ச்திரத்தன்மையை மேம்படுத்தவும்.

# changelogs/1813.txt:1
source: v1.0.7 * Support standard notation.
ta: v1.0.7 * நிலையான குறியீட்டை ஆதரிக்கவும்.

# changelogs/1818.txt:1
source: v1.0.8 * Support taking back. You can try to undo a bad move and make any other better move.
ta: v1.0.8 * திரும்பப் பெற உதவி. நீங்கள் ஒரு மோசமான நடவடிக்கையை செயல்தவிர்க்க முயற்சி செய்யலாம் மற்றும் வேறு எந்த சிறந்த நகர்வையும் செய்யலாம்.

# changelogs/1823.txt:1
source: v1.0.9 * Show notations on board (configurable).
ta: v1.0.9 * போர்டில் குறியீடுகளைக் காட்டு (உள்ளமைக்கக்கூடியது).

# changelogs/1827.txt:1
source: v1.0.10 * Speed up thinking of first two moves. * Only show the notation on board on two sides.
ta: v1.0.10 * முதல் இரண்டு நகர்வுகளை நினைத்து வேகப்படுத்துங்கள். * இரண்டு பக்கங்களிலும் போர்டில் குறியீட்டை மட்டும் காட்டுங்கள்.

# changelogs/1832.txt:1
source: v1.0.11 * Support Step forward & Take back all & Step forward all.
ta: v1.0.11 * உதவி முன்னேறவும், அனைத்தையும் திரும்பப் பெறவும், அனைத்தையும் முன்னெடுத்துச் செல்லுங்கள்.

# changelogs/1834.txt:1
source: v1.0.12 * You can force AI to move now when AI is thinking.
ta: v1.0.12 * AI நினைக்கும் போது இப்போது நகர்த்த AI ஐ கட்டாயப்படுத்தலாம்.

# changelogs/1839.txt:1
source: v1.0.13 * Double back to close App. * Popup Privacy Policy dialog when first run.
ta: v1.0.13 * நெருக்கமான பயன்பாட்டிற்கு இரட்டை. * முதல் இயங்கும் போது பாப்அப் தனியுரிமைக் கொள்கை உரையாடல்.

# changelogs/1847.txt:1
source: v1.0.14 * Add German translation.
ta: v1.0.14 * செர்மன் மொழிபெயர்ப்பைச் சேர்க்கவும்.

# changelogs/1857.txt:1
source: v1.0.15 * Support screen recording (Experimental)
ta: v1.0.15 * உதவி திரை பதிவு (சோதனை)

# changelogs/1869.txt:1
source: v1.0.16 * Support setting piece animation.
ta: v1.0.16 * துண்டு அனிமேசனை அமைப்பதை ஆதரிக்கவும்.

# changelogs/1874.txt:1
source: v1.0.17 * Support setting font size (Take effect after restarting the App). * Keep mute when taking back (configurable).
ta: v1.0.17 * எழுத்துரு அளவை அமைப்பதை ஆதரிக்கவும் (பயன்பாட்டை மறுதொடக்கம் செய்த பிறகு நடைமுறைக்கு விடுங்கள்). * திரும்பப் பெறும்போது (உள்ளமைக்கக்கூடிய) ஊமையாக வைத்திருங்கள்.

# changelogs/1876.txt:1
source: v1.0.18 * You can rollback several steps.
ta: v1.0.18 * நீங்கள் பல படிகளை மாற்றலாம்.

# changelogs/1889.txt:1
source: v1.0.19 * Add Farsi (Persian language) machine translation.
ta: v1.0.19 * ஃபார்சி (பாரசீக மொழி) இயந்திர மொழிபெயர்ப்பைச் சேர்க்கவும்.

# changelogs/1894.txt:1
source: v1.0.20 * Support Ten/Eleven Men's Morris. * You can set how many pieces left can fly. * Add History Navigation Toolbar.
ta: v1.0.20 * பத்து/பதினொரு ஆண்கள் மோரிசை ஆதரிக்கவும். * எஞ்சியிருக்கும் எத்தனை துண்டுகள் பறக்க முடியும் என்பதை நீங்கள் அமைக்கலாம். * வரலாற்று வழிசெலுத்தல் கருவிப்பட்டியைச் சேர்க்கவும்.

# changelogs/1901.txt:1
source: v1.0.21 * Support exporting and importing the game.
ta: v1.0.21 * விளையாட்டை ஏற்றுமதி செய்வதற்கும் இறக்குமதி செய்வதற்கும் ஆதரவளிக்கவும்.

# changelogs/1908.txt:1
source: v1.0.22 * Fix white side attack so early from the sides at 3rd move.
ta: v1.0.22 * 3 வது நகர்வில் பக்கங்களிலிருந்து மிக விரைவாக வெள்ளை பக்க தாக்குதலை சரிசெய்யவும்.

# changelogs/1919.txt:1
source: v1.0.23 * Various format variants are supported when importing Move List.
ta: v1.0.23 * நகர்வு பட்டியலை இறக்குமதி செய்யும் போது பல்வேறு வடிவமைப்பு மாறுபாடுகள் ஆதரிக்கப்படுகின்றன.

# changelogs/1933.txt:1
source: v1.0.24 * Support considering mobility of pieces.
ta: v1.0.24 * துண்டுகளின் இயக்கம் கருத்தில் கொண்டு உதவி.

# changelogs/1936.txt:1
source: v1.0.25 * Add EULA link.
ta: v1.0.25 * EULA இணைப்பைச் சேர்க்கவும்.

# changelogs/1940.txt:1
source: v1.1.0 * Improve Hungarian translation.
ta: v1.1.0 * அங்கேரிய மொழிபெயர்ப்பை மேம்படுத்தவும்.

# changelogs/1953.txt:1
source: v1.1.1 * Support importing PlayOK notation. * Support specific N of "N-move rules".
ta: v1.1.1 * பிளேயோக் குறியீட்டை இறக்குமதி செய்வதை ஆதரிக்கவும். * "N- நகரும் விதிகள்" இன் குறிப்பிட்ட N ஐ ஆதரிக்கவும்.

# changelogs/1956.txt:1
source: v1.1.2 * Add Romanian language machine translation. * Improve stability of import/export.
ta: v1.1.2 * ருமேனிய மொழி இயந்திர மொழிபெயர்ப்பைச் சேர்க்கவும். * இறக்குமதி/ஏற்றுமதியின் நிலைத்தன்மையை மேம்படுத்தவும்.

# changelogs/1959.txt:1
source: v1.1.3 * Make email-sender work with Android 11 devices when crashing.
ta: v1.1.3 * செயலிழக்கும்போது ஆண்ட்ராய்டு 11 சாதனங்களுடன் மின்னஞ்சல்-வாரிசு வேலை செய்யுங்கள்.

# changelogs/1962.txt:1
source: v1.1.4 * Support setting languages to English, German, Persian, Hungarian, Romanian, and Chinese.
ta: v1.1.4 * ஆங்கிலம், செர்மன், பாரசீக, அங்கேரிய, ருமேனிய மற்றும் சீன மொழிகளுக்கு மொழிகளை அமைப்பதை ஆதரிக்கிறது.

# changelogs/1970.txt:1
source: v1.1.5 * Add Arabic/Spanish/French/Japanese/Korean/Portuguese/Russian machine translations.
ta: v1.1.5 * அரபு/ச்பானிச்/பிரஞ்சு/சப்பானிய/கொரிய/போர்த்துகீசிய/ரச்ய இயந்திர மொழிபெயர்ப்புகளைச் சேர்க்கவும்.

# changelogs/1977.txt:1
source: v1.1.6 * Provide interactive feedback directly in the app by annotating a screenshot of the current page and adding text. * Improve Romanian and Hungarian language translations.
ta: v1.1.6 * தற்போதைய பக்கத்தின் திரை சாட்டைக் சிறுகுறிப்பு செய்து உரையைச் சேர்ப்பதன் மூலம் பயன்பாட்டில் நேரடியாக ஊடாடும் கருத்துக்களை வழங்கவும். * ருமேனிய மற்றும் அங்கேரிய மொழி மொழிபெயர்ப்புகளை மேம்படுத்தவும்.

# changelogs/1981.txt:1
source: v1.1.7 * Add Hindi/Italian/Polish/Turkish machine translations.
ta: v1.1.7 * இந்தி/இத்தாலிய/போலந்து/துருக்கிய இயந்திர மொழிபெயர்ப்புகளைச் சேர்க்கவும்.

# changelogs/1994.txt:1
source: v1.1.8 * Fix menu UI problem with Right-To-Left. * Improve English translations. * Show language name instead of language code in trailing of menu item.
ta: v1.1.8 * வலது-இடத்திற்கு பட்டியல் இடைமுகம் சிக்கலை சரிசெய்யவும். * ஆங்கில மொழிபெயர்ப்புகளை மேம்படுத்தவும். * பட்டியல் உருப்படியின் பின்னணியில் மொழி குறியீட்டிற்கு பதிலாக மொழி பெயரைக் காட்டு.

# changelogs/1998.txt:1
source: v1.1.9 * Improve Farsi (Persian language) translation (WIP). * Fix options arrows and navigation buttons issues in RTL languages. * Fix animation icon is too high when the locale is Arabic.
ta: v1.1.9 * ஃபார்சி (பாரசீக மொழி) மொழிபெயர்ப்பை (WIP) மேம்படுத்தவும். * ஆர்.டி.எல் மொழிகளில் விருப்பங்கள் அம்புகள் மற்றும் வழிசெலுத்தல் பொத்தான்கள் சிக்கல்களை சரிசெய்யவும். * லோகேல் அரபு ஆக இருக்கும்போது அனிமேசன் படவுரு மிக அதிகமாக உள்ளது.

# changelogs/2011.txt:1
source: v1.1.10 * Fix options arrows issues in RTL languages. * Improve Farsi (Persian language) translation (WIP). * Improve English translations. * Add Bulgarian/Bengali/Danish/Greek/Estonian/Finnish/Gujarati/Croatian/Indonesian/Lithuanian/Latvian/Macedonian/Malay/Dutch/Slovak/Slovenian/Albanian/Serbian/Swedish/Telugu/Thai machine translations.
ta: v1.1.10 * ஆர்.டி.எல் மொழிகளில் விருப்பங்கள் அம்புகள் சிக்கல்களை சரிசெய்யவும். * ஃபார்சி (பாரசீக மொழி) மொழிபெயர்ப்பை (WIP) மேம்படுத்தவும். * ஆங்கில மொழிபெயர்ப்புகளை மேம்படுத்தவும். * பல்கேரிய/பெங்காலி/டேனிச்/கிரேக்க/எச்டோனியன்/ஃபின்னிச்/குசராட்டி/இந்தோனேசிய/லிதுவேனியன்/லாட்வியன்/மாசிடோனியன்/மலாய்/டச்சு/ச்லோவாக்/ச்லோவேனியன்/அல்பேனியன்/செர்பிய/ச்வீடிச்/தெலுங்கு/தாய் மெசின் மொழிபெயர்ப்புகளைச் சேர்க்கவும்.

# changelogs/2020.txt:1
source: v1.1.11 * Improve Spanish translation.
ta: v1.1.11 * ச்பானிச் மொழிபெயர்ப்பை மேம்படுத்தவும்.

# changelogs/2025.txt:1
source: v1.1.12 * Improve Persian translation. * Add Traditional Chinese translation.
ta: v1.1.12 * பாரசீக மொழிபெயர்ப்பை மேம்படுத்தவும். * பாரம்பரிய சீன மொழிபெயர்ப்பைச் சேர்க்கவும்.

# changelogs/2031.txt:1
source: v1.1.13 * Add Kannada/Norwegian/Uzbek/Vietnamese machine translations.
ta: v1.1.13 * கன்னட/நோர்வே/உச்பெக்/வியட்நாமிய இயந்திர மொழிபெயர்ப்புகளைச் சேர்க்கவும்.

# changelogs/2037.txt:1
source: v1.1.14 * Set default rule to Twelve Men's Morris when the country is Iran.
ta: v1.1.14 * நாடு ஈரானாக இருக்கும்போது இயல்புநிலை விதியை பன்னிரண்டு ஆண்கள் மோரிசுக்கு அமைக்கவும்.

# changelogs/2043.txt:1
source: v1.1.15 * Support menu color settings. * Improve Persian translation.
ta: v1.1.15 * பட்டியல் வண்ண அமைப்புகளை ஆதரிக்கவும். * பாரசீக மொழிபெயர்ப்பை மேம்படுத்தவும்.

# changelogs/2053.txt:1
source: v1.1.16 * Show status bar for large screen device. * Do not show navigation toolbar setting if window aspect ratio is less than 1.7. * Improve Persian translation.
ta: v1.1.16 * பெரிய திரை சாதனத்திற்கான நிலை பட்டியைக் காட்டு. * சாளர விகித விகிதம் 1.7 க்கும் குறைவாக இருந்தால் வழிசெலுத்தல் கருவிப்பட்டி அமைப்பைக் காட்ட வேண்டாம். * பாரசீக மொழிபெயர்ப்பை மேம்படுத்தவும்.

# changelogs/2060.txt:1
source: v1.1.17 * Allows to configure the color of the toolbar.
ta: v1.1.17 * கருவிப்பட்டியின் நிறத்தை உள்ளமைக்க அனுமதிக்கிறது.

# changelogs/2067.txt:1
source: v1.1.18 * When the skill level is 1, AI moves more randomly to reduce the difficulty. * Fix navigation toolbar setting disappears on some devices. * Fix drawer highlight item text color.
ta: v1.1.18 * திறன் நிலை 1 ஆக இருக்கும்போது, ​​சிரமத்தை குறைக்க AI இன்னும் தோராயமாக நகர்கிறது. * வழிசெலுத்தல் கருவிப்பட்டி அமைப்பு சில சாதனங்களில் மறைந்துவிடும். * டிராயர் சிறப்பம்சமாக உருப்படி உரை வண்ணத்தை சரிசெய்யவும்.

# changelogs/2070.txt:1
source: v1.1.19 * Volunteers can get involved in the translations on our POEditor.
ta: v1.1.19 * தன்னார்வலர்கள் எங்கள் கவிதையாளரின் மொழிபெயர்ப்புகளில் ஈடுபடலாம்.

# changelogs/2075.txt:1
source: v1.1.20 * Improve the AI's abilities, especially in the moving phase and high levels.
ta: v1.1.20 * AI இன் திறன்களை மேம்படுத்தவும், குறிப்பாக நகரும் கட்டம் மற்றும் உயர் மட்டங்களில்.

# changelogs/2077.txt:1
source: v1.1.21 * Fix take-back and step-forward buttons icon direction in right-to-left layout.
ta: v1.1.21 * வலது-இடது-இடதுபுறத்தில் டேக்-பேக் மற்றும் படி-முன்னோக்கி பொத்தான்கள் படவுரு திசையை சரிசெய்யவும்.

# changelogs/2079.txt:1
source: v1.1.22 When humans vs. AI, the two sides have made many moves but have not taken the opponent's pieces for many consecutive moves, and the AI will get frozen. This issue has been resolved.
ta: v1.1.22 மனிதர்கள் மற்றும் AI க்கு எதிராக, இரு தரப்பினரும் பல நகர்வுகளைச் செய்துள்ளனர், ஆனால் தொடர்ச்சியான பல நகர்வுகளுக்கு எதிராளியின் துண்டுகளை எடுக்கவில்லை, மேலும் AI உறைந்துவிடும். இந்த சிக்கல் தீர்க்கப்பட்டுள்ளது.

# changelogs/2086.txt:1
source: v1.1.23 * Set count of unplaced pieces' text color to board line color * Add Swiss German translation (WIP)
ta: v1.1.23 * பலகைகளின் எண்ணிக்கையை அமைக்கவும், பலகை வரி வண்ணமாக * சுவிச் செர்மன் மொழிபெயர்ப்பைச் சேர்க்கவும் (WIP)

# changelogs/2090.txt:1
source: v1.1.24 * Show unplaced pieces counter by default. * Improve Finnish translation.
ta: v1.1.24 * இயல்புநிலையாக இடமாற்றம் செய்யப்படாத துண்டுகள் கவுண்டரைக் காட்டு. * பின்னிச் மொழிபெயர்ப்பை மேம்படுத்தவும்.

# changelogs/2129.txt:1
source: v1.1.25 Support accessibility.
ta: v1.1.25 அணுகலை ஆதரிக்கவும்.

# changelogs/2137.txt:1
source: v1.1.26 Improve accessibility.
ta: v1.1.26 அணுகலை மேம்படுத்தவும்.

# changelogs/2143.txt:1
source: v1.1.27 Improve accessibility.
ta: v1.1.27 அணுகலை மேம்படுத்தவும்.

# changelogs/2146.txt:1
source: v1.1.28 The AI algorithm has been improved to increase the AI's skills to 180% of the original.
ta: v1.1.28 AI இன் திறன்களை அசல் 180% ஆக அதிகரிக்க AI வழிமுறை மேம்படுத்தப்பட்டுள்ளது.

# changelogs/2148.txt:1
source: v1.1.29 Improve AI algorithm.
ta: B1.1.29 AI வழிமுறையை மேம்படுத்தவும்.

# changelogs/2156.txt:1
source: v1.1.30 * Avoid the AI being too aggressive in the opening phase, which can easily lead to losses. * Increase the max value of skill level from 20 to 30. * Set 'Consider mobility of pieces' to on as default. * Add 'Piece highlight color' setting and set red as default.
ta: v1.1.30 * தொடக்க கட்டத்தில் AI மிகவும் ஆக்ரோசமாக இருப்பதைத் தவிர்க்கவும், இது எளிதில் இழப்புகளுக்கு வழிவகுக்கும். * திறன் மட்டத்தின் அதிகபட்ச மதிப்பை 20 முதல் 30 வரை அதிகரிக்கவும். * இயல்புநிலையாக 'துண்டுகளின் இயக்கம்' என்று அமைக்கவும். * 'துண்டு சிறப்பம்சமாக வண்ணம்' அமைப்பைச் சேர்த்து, சிவப்பு நிறத்தை இயல்புநிலையாக அமைக்கவும்.

# changelogs/2160.txt:1
source: v1.1.31 * Nine Men's Morris: Fix AI is likely to block white from making a mill in the opening phase, thus making AI vulnerable to lose the game. * Twelve Men's Morris: Boost the AI power.
ta: v1.1.31 ! * பன்னிரண்டு ஆண்கள் மோரிச்: AI சக்தியை அதிகரிக்கும்.

# changelogs/2164.txt:1
source: v1.1.32 Allows users to choose the AI algorithm.
ta: v1.1.32 AI வழிமுறையைத் தேர்வுசெய்ய பயனர்களை அனுமதிக்கிறது.

# changelogs/2167.txt:1
source: v1.1.33 Support Flutter 2.5.
ta: v1.1.33 உதவி புளட்டர் 2.5.

# changelogs/2172.txt:1
source: v1.1.34 Avoid the white being too aggressive in the opening phase, which can quickly lose the game.
ta: v1.1.34 தொடக்க கட்டத்தில் வெள்ளை மிகவும் ஆக்ரோசமாக இருப்பதைத் தவிர்க்கவும், இது விரைவாக விளையாட்டை இழக்க நேரிடும்.

# changelogs/2178.txt:1
source: v1.1.35 Optimize the AI's ability to control the situation in the opening phase.
ta: v1.1.35 தொடக்க கட்டத்தில் நிலைமையைக் கட்டுப்படுத்தும் AI இன் திறனை மேம்படுத்தவும்.

# changelogs/2182.txt:1
source: v1.1.36 * Fix the icon direction display problem in the right-to-left layout. * Improved Arabic translation.
ta: v1.1.36 * படவுரு திசை காட்சி சிக்கலை வலது-இடது தளவமைப்பில் சரிசெய்யவும். * மேம்படுத்தப்பட்ட அரபு மொழிபெயர்ப்பு.

# changelogs/2184.txt:1
source: v1.1.37 Change the icon of the game over.
ta: v1.1.37 விளையாட்டின் ஐகானை மாற்றவும்.

# changelogs/2196.txt:1
source: v1.1.38 * Support removing unplaced piece setting - If a player forms the mill in the placing phase, he can remove the opponent's unplaced piece and continue to make a move. * Support Endgame N-Move rule. * Change the judgment condition of the N-move rule from > to =. * Support threefold repetition setting. * Allow configuring point style and point width. * Support import GoldToken move list.
ta: v1.1.38 * இடமாற்றம் செய்யப்படாத துண்டு அமைப்பை அகற்றும் உதவி - ஒரு வீரர் வைக்கும் கட்டத்தில் ஆலை உருவாக்கினால், அவர் எதிரியின் இடமில்லாத பகுதியை அகற்றி தொடர்ந்து ஒரு நகர்வை மேற்கொள்ள முடியும். * எண்ட்கேம் என்-மூவ் விதியை ஆதரிக்கவும். * N-நகரும் விதியின் தீர்ப்பு நிலையை> முதல் = என மாற்றவும். * மூன்று மடங்கு மறுபடியும் அமைப்பை ஆதரிக்கவும். * புள்ளி பாணி மற்றும் புள்ளி அகலத்தை உள்ளமைக்க அனுமதிக்கவும். * இறக்குமதி கோல்டோகன் நகரும் பட்டியல்.

# changelogs/2206.txt:1
source: v1.1.39 * Enhance the AI power of the moving phase. * Improve French and Hungarian translation. * Android 4.1.x is no longer supported.
ta: v1.1.39 * நகரும் கட்டத்தின் AI சக்தியை மேம்படுத்தவும். * பிரஞ்சு மற்றும் அங்கேரிய மொழிபெயர்ப்பை மேம்படுத்துதல். * ஆண்ட்ராய்டு 4.1.x இனி ஆதரிக்கப்படாது.

# changelogs/2212.txt:1
source: v1.1.40 Upgrade to Flutter 2.10.0.
ta: v1.1.40 ஃப்ளட்டர் 2.10.0 க்கு மேம்படுத்தவும்.

# changelogs/2216.txt:1
source: v1.1.41 Upgrade to Flutter 2.10.1.
ta: v1.1.41 ஃப்ளட்டருக்கு மேம்படுத்தவும் 2.10.1.

# changelogs/2220.txt:1
source: v1.1.42 * Add Ukrainian translation. * Improve Portuguese (Brazil) translation.
ta: v1.1.42 * உக்ரேனிய மொழிபெயர்ப்பைச் சேர்க்கவும். * போர்த்துகீசியம் (பிரேசில்) மொழிபெயர்ப்பை மேம்படுத்தவும்.

# changelogs/2225.txt:1
source: v1.1.43 * Improve Korean translation. * Upgrade Flutter to 2.10.3.
ta: v1.1.43 * கொரிய மொழிபெயர்ப்பை மேம்படுத்தவும். * ஃப்ளட்டரை 2.10.3 ஆக மேம்படுத்தவும்.

# changelogs/2930.txt:1
source: v2.0.1 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.1 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/2943.txt:1
source: v2.0.2 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.2 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/2955.txt:1
source: v2.0.3 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.3 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3001.txt:1
source: v2.0.4 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.4 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3034.txt:1
source: v2.0.5 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.5 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3048.txt:1
source: v2.0.6 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.6 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3063.txt:1
source: v2.0.7 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.7 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3069.txt:1
source: v2.0.8 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.8 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3071.txt:1
source: v2.0.9 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.9 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3118.txt:1
source: v2.0.11 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.11 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3124.txt:1
source: v2.0.12 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.12 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3152.txt:1
source: v2.0.13 * Support sharing GIF. * Disable gestures on game page. * Add shadow to unplaced and removed pieces. * Fix status bar icon color to white. * Fix edges of pieces located on the edge of the board are blurred.
ta: v2.0.13 * GIF ஐப் பகிர்வதை ஆதரிக்கவும். * விளையாட்டு பக்கத்தில் சைகைகளை முடக்கு. * இடங்கள் மற்றும் அகற்றப்பட்ட துண்டுகளுக்கு நிழல் சேர்க்கவும். * நிலை பட்டி படவுரு நிறத்தை வெள்ளை நிறத்தில் சரிசெய்யவும். * பலகையின் விளிம்பில் அமைந்துள்ள துண்டுகளின் விளிம்புகளை சரிசெய்யவும்.

# changelogs/3166.txt:1
source: v2.0.14 Improve game screen recorder.
ta: v2.0.14 விளையாட்டு திரை ரெக்கார்டரை மேம்படுத்தவும்.

# changelogs/3169.txt:1
source: v2.0.15 Add wizard.
ta: v2.0.15 வழிகாட்டி சேர்க்கவும்.

# changelogs/3172.txt:1
source: v2.0.16 Improve accessibility of wizard.
ta: v2.0.16 வழிகாட்டியின் அணுகலை மேம்படுத்தவும்.

# changelogs/3178.txt:1
source: v2.0.17 Improve wizard.
ta: v2.0.17 வழிகாட்டி மேம்படுத்தவும்.

# changelogs/3198.txt:1
source: v2.0.18 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.18 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3202.txt:1
source: v2.0.19 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.0.19 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3205.txt:1
source: v2.0.20 Fix the problem that the three icons are not displayed at the top of the tutorial page in dark mode.
ta: v2.0.20 மூன்று ஐகான்கள் டுடோரியல் பக்கத்தின் மேற்புறத்தில் இருண்ட பயன்முறையில் காட்டப்படாத சிக்கலை சரிசெய்யவும்.

# changelogs/3269.txt:1
source: v2.1.0 This update includes various improvements and bug fixes to make the app better for you.
ta: v2.1.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3271.txt:1
source: v3.0.0 This update includes various improvements and bug fixes to make the app better for you.
ta: v3.0.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3306.txt:1
source: v3.0.1 This update includes various improvements and bug fixes to make the app better for you.
ta: v3.0.1 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3319.txt:1
source: v3.1.0 Support landscape orientation.
ta: v3.1.0 இயற்கை நோக்குநிலையை ஆதரிக்கவும்.

# changelogs/3330.txt:1
source: v3.2.0 Pad supports Landscape Orientation.
ta: v3.2.0 திண்டு இயற்கை நோக்குநிலையை ஆதரிக்கிறது.

# changelogs/3333.txt:1
source: v3.3.0 This update includes various improvements and bug fixes to make the app better for you.
ta: v3.3.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3354.txt:1
source: v3.3.1 This update includes various improvements and bug fixes to make the app better for you.
ta: v3.3.1 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3359.txt:1
source: v3.3.2 This update includes various improvements and bug fixes to make the app better for you.
ta: v3.3.2 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3366.txt:1
source: v3.3.3 Fixed an issue where the displayed language was Arabic instead of English as expected in minor locales.
ta: v3.3.3 சிறிய இடங்களில் எதிர்பார்த்தபடி காட்சிப்படுத்தப்பட்ட மொழி ஆங்கிலத்திற்கு பதிலாக அரபு என்று ஒரு சிக்கல் சரி செய்யப்பட்டது.
