Repository: 247i/TACETr
Catalog: உரை/தானி/sanmill-f-droid-metadata-*.po
Languages: ta

# changelogs/3395.txt:1
source: v3.4.0 1. Add a setting for AI response delay time. If you find that the AI moves too quickly and it is difficult to see the moves clearly, you can increase this value. 2. Fixed an issue where, when forming a mill, the move that forms the mill is not always displayed first but is shown together with the removal move, making it unclear how the AI formed the mill. 3. Fixed the issue where the red circle indicating a selected piece would not be transferred to a new piece when tapping on another piece instead of the selected piece.
ta: v3.4.0 1. AI மறுமொழி தாமத நேரத்திற்கு ஒரு அமைப்பைச் சேர்க்கவும். AI மிக விரைவாக நகர்கிறது என்பதை நீங்கள் கண்டால், நகர்வுகளை தெளிவாகக் காண்பது கடினம் என்றால், இந்த மதிப்பை நீங்கள் அதிகரிக்கலாம். 2. ஒரு ஆலை உருவாக்கும் போது, ​​ஆலையை உருவாக்கும் நகர்வு எப்போதும் முதலில் காட்டப்படாது, ஆனால் அகற்றும் நகர்வுடன் ஒன்றாகக் காட்டப்படும் ஒரு சிக்கல் சரி செய்யப்பட்டது, இது AI ஆலை எவ்வாறு உருவாக்கியது என்பது தெளிவாகத் தெரியவில்லை. 3. தேர்ந்தெடுக்கப்பட்ட துண்டுக்கு பதிலாக மற்றொரு துண்டைத் தட்டும்போது தேர்ந்தெடுக்கப்பட்ட துண்டைக் குறிக்கும் சிவப்பு வட்டம் புதிய துண்டுக்கு மாற்றப்படாது.

# changelogs/3412.txt:1
source: v3.4.1 Fixed several issues with the setup position function.
ta: v3.4.1 அமைவு நிலை செயல்பாட்டில் பல சிக்கல்கள் சரி செய்யப்பட்டன.

# changelogs/3419.txt:1
source: v3.4.2 Fix game result dialog is shown twice.
ta: v3.4.2 விளையாட்டு முடிவு உரையாடல் இரண்டு முறை காட்டப்பட்டுள்ளது.

# changelogs/3467.txt:1
source: v3.5.0 New Features: * Added MCTS algorithm. * Introduced new GoldenJade color theme. Improvements: * Changed Color Panel Picker style to Color Slide Picker in settings. * Enhanced performance, especially in the flying phase.
ta: v3.5.0 புதிய அம்சங்கள்: * MCTS வழிமுறை சேர்க்கப்பட்டது. * புதிய கோல்டன்சேட் வண்ண கருப்பொருள் அறிமுகப்படுத்தப்பட்டது. மேம்பாடுகள்: * அமைப்புகளில் வண்ண ச்லைடு பிக்கருக்கு வண்ண பேனல் பிக்கர் பாணியை மாற்றியது. * மேம்பட்ட செயல்திறன், குறிப்பாக பறக்கும் கட்டத்தில்.

# changelogs/3480.txt:1
source: v3.5.1 Added several color themes.
ta: v3.5.1 பல வண்ண கருப்பொருள்கள் சேர்க்கப்பட்டன.

# changelogs/3498.txt:1
source: v3.5.2 Imporve Schweizerdeutsch translation.
ta: V3.5.2 சுவிச் செர்மன் மொழிபெயர்ப்பை வழங்குதல்.

# changelogs/3505.txt:1
source: v3.5.3 This update includes various improvements and bug fixes to make the app better for you.
ta: v3.5.3 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3507.txt:1
source: v3.5.4 This update includes various improvements and bug fixes to make the app better for you.
ta: v3.5.4 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3526.txt:1
source: v3.5.5 This update includes various improvements and bug fixes to make the app better for you.
ta: v3.5.5 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3533.txt:1
source: v3.5.6 Fix the issue of being unable to import the move list on the first launch after installation.
ta: v3.5.6 நிறுவலுக்குப் பிறகு முதல் துவக்கத்தில் நகர்வு பட்டியலை இறக்குமதி செய்ய முடியாமல் போன சிக்கலை சரிசெய்யவும்.

# changelogs/3535.txt:1
source: v3.5.7 This update includes various improvements and bug fixes to make the app better for you.
ta: v3.5.7 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3540.txt:1
source: v3.5.8 Fixed the issue of the screen displaying gray when a game ends in a draw.
ta: v3.5.8 ஒரு விளையாட்டு டிராவில் முடிவடையும் போது சாம்பல் காண்பிக்கும் திரையின் சிக்கல் சரி செய்யப்பட்டது.

# changelogs/3543.txt:1
source: v3.5.9 Fixed the issue where the 'Move Now' button on the Navigation Toolbar disappears when switching to the 'Setup Position' page and then switching back.
ta: v3.5.9 'அமைவு நிலை' பக்கத்திற்கு மாறும்போது வழிசெலுத்தல் கருவிப்பட்டியில் 'இப்போது நகர்த்து' பொத்தானை மறைந்துபோகும் சிக்கல் சரி செய்யப்பட்டது.

# changelogs/3551.txt:1
source: v3.5.10 Update Croatian translations.
ta: v3.5.10 குரோசிய மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும்.

# changelogs/3553.txt:1
source: v3.5.11 This update includes various improvements and bug fixes to make the app better for you.
ta: v3.5.11 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3555.txt:1
source: v3.5.12 Improve Croatian translation.
ta: v3.5.12 குரோசிய மொழிபெயர்ப்பை மேம்படுத்தவும்.

# changelogs/3558.txt:1
source: v3.5.13 Solve the problem that sometimes tapping the Move List button does not respond.
ta: v3.5.13 சில நேரங்களில் நகரும் பட்டியல் பொத்தானைத் தட்டாத சிக்கலைத் தீர்க்கவும்.

# changelogs/3565.txt:1
source: v3.6.0 Support showing positional advantage indicator.
ta: v3.6.0 நிலை நன்மை குறிகாட்டியைக் காட்டும் உதவி.

# changelogs/3583.txt:1
source: v3.6.1 Improve translations.
ta: v3.6.1 மொழிபெயர்ப்புகளை மேம்படுத்தவும்.

# changelogs/3588.txt:1
source: v3.6.2 This update includes various improvements and bug fixes to make the app better for you.
ta: v3.6.2 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3594.txt:1
source: v3.6.2 Improved Serbian translation.
ta: v3.6.2 மேம்படுத்தப்பட்ட செர்பிய மொழிபெயர்ப்பு.

# changelogs/3602.txt:1
source: v3.6.3 Improved German translation.
ta: v3.6.3 மேம்பட்ட செர்மன் மொழிபெயர்ப்பு.

# changelogs/3739.txt:1
source: v3.7.0 * Improved translation for multiple languages. * Qt application now officially supports loading the Perfect Database. Mobile applications currently do not support loading the Perfect Database. To use the Perfect Database, please download the PC version of the program.
ta: v3.7.0 * பல மொழிகளுக்கான மேம்படுத்தப்பட்ட மொழிபெயர்ப்பு. * கியுடி பயன்பாடு இப்போது சரியான தரவுத்தளத்தை ஏற்றுவதை அதிகாரப்பூர்வமாக ஆதரிக்கிறது. மொபைல் பயன்பாடுகள் தற்போது சரியான தரவுத்தளத்தை ஏற்றுவதை ஆதரிக்கவில்லை. சரியான தரவுத்தளத்தைப் பயன்படுத்த, நிரலின் பிசி பதிப்பைப் பதிவிறக்கவும்.

# changelogs/3779.txt:1
source: v3.8.0 * Add support for Background Image Picker. * The AI is smarter on moves 5 and 6 when playing as White. * Improve Brazilian Portuguese localization.
ta: v3.8.0 * பின்னணி பட தேர்வாளருக்கு ஆதரவைச் சேர்க்கவும். * வெள்ளை நிறமாக விளையாடும்போது 5 மற்றும் 6 நகர்வுகளில் AI புத்திசாலி. * பிரேசிலிய போர்த்துகீசிய பரவலாக்கத்தை மேம்படுத்தவும்.

# changelogs/3825.txt:1
source: v3.8.1 This update includes various improvements and bug fixes to make the app better for you.
ta: v3.8.1 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3826.txt:1
source: v4.0.0 - Introduced support for Perfect AI, enhancing challenge and engagement levels. Acknowledgments to Gábor Gévay and Gábor Danner. - Enabled the transfer of PGN files from phones to PCs. - Updated to Material3 design.
ta: v4.0.0 - சரியான AI க்கான ஆதரவை அறிமுகப்படுத்தியது, அறைகூவல் மற்றும் நிச்சயதார்த்த நிலைகளை மேம்படுத்துதல். கோபர் கிவே மற்றும் கோபர் டேனருக்கு ஒப்புதல்கள். - பி.சி.என் கோப்புகளை தொலைபேசிகளிலிருந்து பிசிக்களுக்கு மாற்ற உதவியது. - பொருள் 3 வடிவமைப்பிற்கு புதுப்பிக்கப்பட்டது.

# changelogs/3828.txt:1
source: v4.0.1 Fix Perfect AI cannot achieve rapid victories.
ta: v4.0.1 சரியான AI ஐ சரிசெய்ய முடியாது விரைவான வெற்றிகளை அடைய முடியாது.

# changelogs/3844.txt:1
source: v4.0.2 Combine traditional AI and perfect database.
ta: v4.0.2 பாரம்பரிய AI மற்றும் சரியான தரவுத்தளத்தை இணைக்கவும்.

# changelogs/3849.txt:1
source: v4.0.3 * Adjust DB strategy to avoid maximizing AI pieces in mixed mode.
ta: v4.0.3 * கலப்பு பயன்முறையில் AI துண்டுகளை அதிகரிப்பதைத் தவிர்க்க DB மூலோபாயத்தை சரிசெய்யவும்.

# changelogs/3884.txt:1
source: v4.0.4 Improved Spanish translation.
ta: v4.0.4 மேம்படுத்தப்பட்ட ச்பானிச் மொழிபெயர்ப்பு.

# changelogs/3893.txt:1
source: v4.0.5 * Added Sinhala support. * Updated Spanish translation.
ta: v4.0.5 * சிங்கள ஆதரவைச் சேர்த்தது. * புதுப்பிக்கப்பட்ட ச்பானிச் மொழிபெயர்ப்பு.

# changelogs/3908.txt:1
source: v4.0.6 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.0.6 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3918.txt:1
source: v4.0.7 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.0.7 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3920.txt:1
source: v4.0.8 Improved translation.
ta: v4.0.8 மேம்படுத்தப்பட்ட மொழிபெயர்ப்பு.

# changelogs/3929.txt:1
source: v4.0.9 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.0.9 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/3937.txt:1
source: v4.0.10 Improve translations.
ta: v4.0.10 மொழிபெயர்ப்புகளை மேம்படுத்தவும்.

# changelogs/3942.txt:1
source: v4.1.0 * Fix Random algorithm didn't work with Perfect Database disabled.
ta: v4.1.0 * சீரற்ற வழிமுறையை சரிசெய்யவும் சரியான தரவுத்தள முடக்கப்பட்ட நிலையில் வேலை செய்யவில்லை.

# changelogs/4019.txt:1
source: v4.2.0 This update includes various improvements and bug fixes to make the app better for you. - Improved AI. - Supports the rules of the Dooz game. - Added Monochrome theme.
ta: v4.2.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன. - மேம்படுத்தப்பட்ட AI. - டூச் விளையாட்டின் விதிகளை ஆதரிக்கிறது. - ஒரே வண்ணமுடைய கருப்பொருள் சேர்க்கப்பட்டது.

# changelogs/4041.txt:1
source: v4.3.0 This update includes various improvements and bug fixes to make the app better for you. * Support displaying numbers on pieces. * Support saving board images to the gallery (Android 10 and later only). * Improve AI.
ta: v4.3.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன. * எண்களைக் காண்பிப்பதை ஆதரிக்கவும். * கேலரியில் சேமிப்பு பலகை படங்களை ஆதரிக்கவும் (Android 10 மற்றும் பின்னர் மட்டும்). * AI ஐ மேம்படுத்தவும்.

# changelogs/4043.txt:1
source: v4.3.1 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.3.1 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4059.txt:1
source: v4.4.0 This update includes various improvements and bug fixes to make the app better for you. * Support transforming board. * Nine Men's Morris: Built-in Perfect Database files for the first 8 moves.
ta: v4.4.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன. * உருமாற்ற வாரியத்தை ஆதரிக்கவும். * ஒன்பது ஆண்கள் மோரிச்: முதல் 8 நகர்வுகளுக்கான சரியான தரவுத்தள கோப்புகள்.

# changelogs/4063.txt:1
source: v4.5.0 This update includes various improvements and bug fixes to make the app better for you. * Android: Support opening PGN files from the phone's file explorer. * Fix piece number cannot be transformed. * Display the piece number only when it is not 0.
ta: v4.5.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன. * Android: தொலைபேசியின் கோப்பு எக்ச்ப்ளோரரிலிருந்து PGN கோப்புகளைத் திறப்பதை ஆதரிக்கவும். * சரி துண்டு எண்ணை மாற்ற முடியாது. * துண்டு எண்ணை 0 இல்லாதபோது மட்டுமே காண்பி.

# changelogs/4080.txt:1
source: v4.5.1 This update includes various improvements and bug fixes to make the app better for you. * Save the image when saving the game to PGN.
ta: v4.5.1 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன. * விளையாட்டை PGN க்கு சேமிக்கும்போது படத்தை சேமிக்கவும்.

# changelogs/4083.txt:1
source: v4.6.0 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.6.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4085.txt:1
source: v4.6.1 Fixed an issue where the app could not open PGN files while it was already running.
ta: v4.6.1 பயன்பாடு ஏற்கனவே இயங்கும் போது பயன்பாடு திறக்க முடியாத ஒரு சிக்கல் சரி செய்யப்பட்டது.

# changelogs/4087.txt:1
source: v4.6.2 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.6.2 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4089.txt:1
source: v4.6.3 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.6.3 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4091.txt:1
source: v4.7.0 Enhanced AI engine performance by 23%.
ta: v4.7.0 AI இயந்திர செயல்திறனை 23%மேம்படுத்தியது.

# changelogs/4099.txt:1
source: v4.7.2 Fixed an issue where upgrading from v4.2.0 to the latest version would cause an error on first launch if colors had previously been set: `LateInitializationError: Field '_colorSettingsBox@859236735' has not been initialized.`
ta: v4.7.2 வண்ணங்கள் முன்னர் அமைக்கப்பட்டிருந்தால் V4.2.0 இலிருந்து அண்மைக் கால பதிப்பிற்கு மேம்படுத்துவது முதல் துவக்கத்தில் பிழையை ஏற்படுத்தும் ஒரு சிக்கல் சரி செய்யப்பட்டது: `லேடினிட்டியல்மயமாக்கல் பிழை: புலம் '_colorsettingsbox@859236735' துவக்கப்படவில்லை .`

# changelogs/4101.txt:1
source: v4.7.3 Fixed an issue where upgrading from v4.2.0 to the latest version would cause an error on first launch if colors had previously been set: `LateInitializationError: Field '_colorSettingsBox@859236735' has not been initialized.`
ta: v4.7.3 வண்ணங்கள் முன்னர் அமைக்கப்பட்டிருந்தால் V4.2.0 இலிருந்து அண்மைக் கால பதிப்பிற்கு மேம்படுத்துவது முதல் துவக்கத்தில் பிழையை ஏற்படுத்தும் ஒரு சிக்கல் சரி செய்யப்பட்டது: `லேடினிட்டியல்மயமாக்கல் பிழை: புலம் '_colorsettingsbox@859236735' துவக்கப்படவில்லை .`

# changelogs/4105.txt:1
source: v4.8.0 Allow auto restart after game over.
ta: v4.8.0 கேம் ஓவருக்குப் பிறகு ஆட்டோ மறுதொடக்கம் செய்ய அனுமதிக்கவும்.

# changelogs/4110.txt:1
source: v4.9.0 Tap on the movelist to navigate directly to a specific step.
ta: v4.9.0 ஒரு குறிப்பிட்ட படிக்கு நேரடியாக செல்ல மூவலிச்ட்டைத் தட்டவும்.

# changelogs/4112.txt:1
source: v4.9.1 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.9.1 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4116.txt:1
source: v4.9.2 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.9.2 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4118.txt:1
source: v4.9.3 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.9.3 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4120.txt:1
source: v4.9.4 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.9.4 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4122.txt:1
source: v4.10.0 Visually indicate the currently active selection in the move list.
ta: v4.10.0 நகர்வு பட்டியலில் தற்போது செயலில் உள்ள தேர்வை பார்வைக்கு சுட்டிக்காட்டுகிறது.

# changelogs/4127.txt:1
source: v4.10.1 Fix visibility of number picker in dark mode.
ta: v4.10.1 இருண்ட பயன்முறையில் எண் தேர்வாளரின் தெரிவுநிலையை சரிசெய்யவும்.

# changelogs/4141.txt:1
source: v4.11.0 - Added the ability to directly display the game moves when the "Moves" button is clicked, if the history navigation toolbar is shown. - Added a paste button to the game moves dialog. - Ensured the color picker dialog remains open when tapped outside the dialog area. - Fixed an issue where the coordinate text color did not change when switching themes. - Added the Transparent Canvas color theme to color settings, which is useful when a background image is set.
ta: v4.11.0 - வரலாற்று வழிசெலுத்தல் கருவிப்பட்டி காட்டப்பட்டால், "நகர்வுகள்" பொத்தானைக் சொடுக்கு செய்யும் போது விளையாட்டு நகர்வுகளை நேரடியாகக் காண்பிக்கும் திறனைச் சேர்த்தது. - விளையாட்டு நகர்த்தும் உரையாடலில் பேச்ட் பொத்தானைச் சேர்த்தது. - உரையாடல் பகுதிக்கு வெளியே தட்டும்போது வண்ண பிக்கர் உரையாடல் திறந்திருப்பதை உறுதி செய்தது. - கருப்பொருள்களை மாற்றும்போது ஒருங்கிணைப்பு உரை நிறம் மாறாத ஒரு சிக்கல் சரி செய்யப்பட்டது. - வண்ண அமைப்புகளில் வெளிப்படையான கேன்வாச் வண்ண கருப்பொருள் சேர்த்தது, இது பின்னணி படம் அமைக்கப்படும்போது பயனுள்ளதாக இருக்கும்.

# changelogs/4172.txt:1
source: v4.12.0 * Support Lasker Morris.
ta: v4.12.0 * லாச்கர் மோரிசை ஆதரிக்கவும்.

# changelogs/4179.txt:1
source: v4.13.0 Support Restrict Repeated Mills Formation. This rule prevents a player from moving a piece back to its original position to immediately reform a mill, if the piece was just used to form a mill in the previous turn.
ta: v4.13.0 உதவி மீண்டும் மீண்டும் ஆலைகள் உருவாவதைக் கட்டுப்படுத்துகிறது. இந்த விதி ஒரு வீரர் ஒரு பகுதியை அதன் அசல் நிலைக்கு நகர்த்துவதைத் தடுக்கிறது உடனடியாக ஒரு ஆலை சீர்திருத்தவும், துண்டு ஒரு ஆலை உருவாக்க பயன்படுத்தப்பட்டால் முந்தைய முறை.

# changelogs/4181.txt:1
source: v4.13.1 Fixed an issue where file icons were not visible in dark mode.
ta: v4.13.1 இருண்ட பயன்முறையில் கோப்பு சின்னங்கள் காணப்படாத ஒரு சிக்கல் சரி செய்யப்பட்டது.

# changelogs/4202.txt:1
source: v4.14.0 * Support Russian rules. * accessibility: Fix incorrect screen reader outputs for board notations.
ta: v4.14.0 * ரச்ய விதிகளை ஆதரிக்கவும். * அணுகல்: போர்டு குறியீடுகளுக்கு தவறான திரை வாசகர் வெளியீடுகளை சரிசெய்யவும்.

# changelogs/4206.txt:1
source: v4.14.1 Fixed accessibility issues.
ta: v4.14.1 நிலையான அணுகல் சிக்கல்கள்.

# changelogs/4208.txt:1
source: v4.14.2 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.14.2 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4215.txt:1
source: v4.14.3 Address the issue where a human player can remove a piece from a mill even when this is not permitted by the rules.
ta: v4.14.3 விதிமுறைகளால் அனுமதிக்கப்படாதபோது கூட ஒரு மனித வீரர் ஒரு ஆலையிலிருந்து ஒரு பகுதியை அகற்றக்கூடிய சிக்கலை நிவர்த்தி செய்யுங்கள்.

# changelogs/4218.txt:1
source: v4.15.0 Modified the game engine to avoid repetitive draws, promoting more aggressive and varied playing strategies.
ta: v4.15.0 மீண்டும் மீண்டும் டிராக்களைத் தவிர்ப்பதற்காக விளையாட்டு இயந்திரத்தை மாற்றியமைத்தது, மிகவும் ஆக்ரோசமான மற்றும் மாறுபட்ட விளையாட்டு உத்திகளை ஊக்குவிக்கிறது.

# changelogs/4229.txt:1
source: v4.16.0 Imporve AI.
ta: உள்ளடக்கிய மேம்படுத்தல் ay.

# changelogs/4236.txt:1
source: v4.16.1 Improve translations.
ta: v4.16.1 மொழிபெயர்ப்புகளை மேம்படுத்தவும்.

# changelogs/4238.txt:1
source: v4.16.2 Fix translation issues.
ta: v4.16.2 மொழிபெயர்ப்பு சிக்கல்களை சரிசெய்யவும்.

# changelogs/4240.txt:1
source: v4.16.3 Fix language names.
ta: v4.16.3 மொழி பெயர்களை சரிசெய்யவும்.

# changelogs/4247.txt:1
source: v4.16.4 Fix translations.
ta: v4.16.4 மொழிபெயர்ப்புகளை சரிசெய்யவும்.

# changelogs/4249.txt:1
source: v4.16.5 Fix translations.
ta: v4.16.5 மொழிபெயர்ப்புகளை சரிசெய்யவும்.

# changelogs/4254.txt:1
source: v4.16.6 Fix issues of Setup Position.
ta: v4.16.6 அமைவு நிலையின் சிக்கல்களை சரிசெய்யவும்.

# changelogs/4263.txt:1
source: v4.16.7 Resolve display issues in Feedback module.
ta: v4.16.7 பின்னூட்ட தொகுதியில் காட்சி சிக்கல்களைத் தீர்க்கவும்.

# changelogs/4268.txt:1
source: v4.16.8 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.16.8 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4274.txt:1
source: v4.17.0 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.17.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4283.txt:1
source: v4.17.2 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.17.2 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4285.txt:1
source: v4.17.3 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.17.3 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4292.txt:1
source: v4.17.4 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.17.4 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4297.txt:1
source: v4.17.5 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.17.5 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4299.txt:1
source: v4.17.6 This update includes various improvements and bug fixes to make the app better for you.
ta: v4.17.6 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4332.txt:1
source: v5.0.0 This update includes various improvements and bug fixes to make the app better for you.
ta: v5.0.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4343.txt:1
source: v5.2.0 This update includes various improvements and bug fixes to make the app better for you.
ta: v5.2.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4351.txt:1
source: v5.3.0 This update includes various improvements and bug fixes to make the app better for you.
ta: v5.3.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4358.txt:1
source: v5.4.0 This update includes various improvements and bug fixes to make the app better for you.
ta: v5.4.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4362.txt:1
source: v5.4.1 This update includes various improvements and bug fixes to make the app better for you.
ta: v5.4.1 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4366.txt:1
source: v5.4.2 This update includes various improvements and bug fixes to make the app better for you.
ta: v5.4.2 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4374.txt:1
source: v5.5.0 This update includes various improvements and bug fixes to make the app better for you.
ta: v5.5.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4378.txt:1
source: v5.5.1 This update includes various improvements and bug fixes to make the app better for you.
ta: v5.5.1 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4384.txt:1
source: v5.6.0 This update includes various improvements and bug fixes to make the app better for you.
ta: v5.6.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4387.txt:1
source: v5.6.1 This update includes various improvements and bug fixes to make the app better for you.
ta: v5.6.1 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4404.txt:1
source: v5.7.0 This update includes various improvements and bug fixes to make the app better for you.
ta: v5.7.0 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.

# changelogs/4408.txt:1
source: v5.7.1 This update includes various improvements and bug fixes to make the app better for you.
ta: v5.7.1 இந்த புதுப்பிப்பில் பயன்பாட்டை சிறந்ததாக்க பல்வேறு மேம்பாடுகள் மற்றும் பிழை திருத்தங்கள் உள்ளன.
