Repository: 247i/TACETr
Catalog: உரை/தானி/sebasic4-messages-*.po
Languages: ta

# NAME
source: English
ta: ஆங்கிலம்

# FILENAME
source: EN.LN
ta: A.ln

source: Scroll?____
ta: உருள்? ____

# ERROR
source: in
ta: இல்

source: Ready_______
ta: ரெடி_______

source: Ok
ta: சரி

source: Break
ta: இடைவேளை

# FOR
source: NEXT without FOR
ta: அடுத்து இல்லாமல்

# SYNTAX
source: Syntax error
ta: தொடரியல் பிழை

# GOSUB
source: RETURN without GOSUB
ta: கோசப் இல்லாமல் திரும்பவும்

# DATA
source: Out of DATA
ta: தரவுக்கு வெளியே

# CALL
source: Illegal function call
ta: சட்டவிரோத செயல்பாடு அழைப்பு

source: Overflow
ta: வழிவு

# MEMORY
source: Out of memory
ta: நினைவகத்திற்கு வெளியே

# LINE
source: Undefined line number
ta: வரையறுக்கப்படாத வரி எண்

# SUBSCRIPT
source: Subscript out of range
ta: சந்தா வரம்பிற்கு வெளியே

# VARIABLE
source: Undefined variable
ta: வரையறுக்கப்படாத மாறி

# ADDRESS
source: Address out of range
ta: வரம்பிற்கு வெளியே முகவரி

# STATEMENT
source: Statement missing
ta: அறிக்கை இல்லை

# TYPE
source: Type mismatch
ta: பொருந்தாத வகை

# SCREEN
source: Out of screen
ta: திரைக்கு வெளியே

# DEVICE
source: Bad I/O device
ta: மோசமான I/O சாதனம்

# STREAM
source: Undefined stream
ta: வரையறுக்கப்படாத ச்ட்ரீம்

# CHANNEL
source: Undefined channel
ta: வரையறுக்கப்படாத சேனல்

# FUNCTION
source: Undefined user function
ta: வரையறுக்கப்படாத பயனர் செயல்பாடு

# BUFFER
source: Line buffer overflow
ta: வரி இடையக வழிதல்

# NEXT
source: FOR without NEXT
ta: அடுத்து இல்லாமல்

# WEND
source: WHILE without WEND
ta: வென்ட் இல்லாமல் இருக்கும்போது

# WHILE
source: WEND without WHILE
ta: இல்லாமல் வென்ட்

# FILE
source: File not found
ta: கோப்பு கிடைக்கவில்லை

# INPUT
source: Input past end
ta: கடந்த கால இடைவெளியில் உள்ளீடு

# PATH
source: Path not found
ta: பாதை காணப்படவில்லை
