Repository: 247i/TACETr
Catalog: உரை/தானி/share2fedi-site-*.po
Languages: ta

# metaDescription
source: Share₂Fedi is a share page for Mastodon, Misskey, Friendica, and others. Type in your post text and the instance URL and click ‘Publish’!
ta: சார்ஃபெடி என்பது மாச்டோடன், மிச்கி, ஃப்ரெச்டிகா மற்றும் பிறருக்கு ஒரு பங்கு பக்கம். உங்கள் இடுகை உரை மற்றும் நிகழ்வு முகவரி இல் தட்டச்சு செய்து ‘வெளியிடு’ என்பதைக் சொடுக்கு செய்க!

source: Language:
ta: மொழி:

# description
source: Share₂Fedi is an instance-agnostic share page for {}. With it, you can post to various federated platforms from a single page.
ta: Sharefedi என்பது {for க்கான ஒரு நிகழ்வு-அஞ்ஞான பகிர்வு பக்கம். இதன் மூலம், நீங்கள் ஒரு பக்கத்திலிருந்து பல்வேறு கூட்டாட்சி தளங்களுக்கு இடுகையிடலாம்.

# fediverse
source: the Fediverse
ta: ஃபெடிவர்ச்

source: Supported projects:
ta: உதவி திட்டங்கள்:

source: incl.
ta: உள்ளிட்டவை.

# credits
source: Share₂Fedi is developed and maintained by {}. Source code is {}. Hosted with {}. {}.
ta: Share₂fedi {by ஆல் உருவாக்கப்பட்டு பராமரிக்கப்படுகிறது. மூலக் குறியீடு {}. {With உடன் புரவலன் செய்யப்பட்டது. {}.

# nikita
source: Nikita Karamov
ta: நிகிதா கரமோவ்

source: on GitHub
ta: கிட்அப்பில்

source: Status page
ta: நிலை பக்கம்

source: Licence
ta: உரிமம்

# licence1
source: Share₂Fedi is free software: you can redistribute it and/or modify it under the terms of the GNU Affero General Public License, version 3, as published by the Free Software Foundation.
ta: SHAREFEDI இலவச மென்பொருள்: இலவச மென்பொருள் அறக்கட்டளை வெளியிட்டுள்ளபடி, பதிப்பு 3, குனு அஃபெரோ பொது பொது உரிமம், பதிப்பு 3 இன் விதிமுறைகளின் கீழ் அதை மறுபகிர்வு செய்யலாம் மற்றும்/அல்லது மாற்றலாம்.

# licence2
source: Share₂Fedi is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License for more details.
ta: சேர்ஃபெடி இது பயனுள்ளதாக இருக்கும் என்ற நம்பிக்கையில் விநியோகிக்கப்படுகிறது, ஆனால் எந்த உத்தரவாதமும் இல்லாமல்; ஒரு குறிப்பிட்ட நோக்கத்திற்காக வணிகத்தன்மை அல்லது உடற்தகுதி ஆகியவற்றின் மறைமுக பொறுப்பு கூட இல்லாமல். மேலும் விவரங்களுக்கு குனு அஃபெரோ பொது பொது உரிமத்தைப் பார்க்கவும்.

source: Privacy Notice
ta: தனியுரிமை அறிவிப்பு

# privacy1
source: s2f.kytta.dev is hosted on Vercel. Vercel processes IP addresses, system configuration information, and other information about traffic to and from s2f.kytta.dev. Vercel does not store this information nor does it get shared with third parties. See {} for more information.
ta: s2f.kytta.dev வெர்சலில் புரவலன் செய்யப்படுகிறது. S2F.Kytta.dev க்கு மற்றும் போக்குவரத்து பற்றிய பிற தகவல்களை ஐபி முகவரிகள், கணினி உள்ளமைவு செய்தி மற்றும் பிற தகவல்களை வெல் செயலாக்குகிறது. வெர்சல் இந்த தகவலை சேமிக்காது அல்லது மூன்றாம் தரப்பினருடன் பகிரப்படாது. மேலும் தகவலுக்கு {} ஐப் பார்க்கவும்.

# privacy2
source: When you click the ‘Publish’ button, you’ll get redirected to a Fediverse instance you’ve specified. It may process and/or store your data. Please refer to the privacy policy of the respective instance.
ta: நீங்கள் ‘வெளியிடு’ பொத்தானைக் சொடுக்கு செய்தால், நீங்கள் குறிப்பிட்ட ஃபெடிவர்ச் நிகழ்வுக்கு திருப்பி விடப்படுவீர்கள். இது உங்கள் தரவை செயலாக்கலாம் மற்றும்/அல்லது சேமிக்கலாம். அந்தந்த நிகழ்வின் தனியுரிமைக் கொள்கையைப் பார்க்கவும்.

# vercelPP
source: Vercel’s privacy policy
ta: வெர்சலின் தனியுரிமைக் கொள்கை

source: Post text
ta: இடுகை உரை

# postTextPlaceholder
source: What’s on your mind?
ta: உங்கள் மனதில் என்ன இருக்கிறது?

# instance
source: Fediverse instance
ta: ஃபெடிவர்ச் நிகழ்வு

source: Previously used:
ta: முன்பு பயன்படுத்தப்பட்டது:

# rememberInstance
source: Remember instance on this device
ta: இந்த சாதனத்தில் உதாரணத்தை நினைவில் கொள்ளுங்கள்

source: Publish
ta: வெளியிடுங்கள்
