Repository: 247i/TACETr
Catalog: உரை/தானி/showcase-strings-*.po
Languages: ta

# app_name
source: ShowCase
ta: காட்சி பெட்டி

# no_permission_dialog_ok
source: OK
ta: சரி

# no_permission_dialog_cancel
source: Cancel
ta: ரத்துசெய்

# place_of_birth
source: Place of Birth: %1$s
ta: பிறந்த இடம்: %1$s

# birthday
source: Birthday: %1$s
ta: பிறந்த நாள்: %1$s

# cast_movie_title
source: Part of the cast in
ta: நடிகர்களின் ஒரு பகுதி

# crew_movie_title
source: Part of the crew in
ta: குழுவினரின் ஒரு பகுதி

source: Movie added
ta: திரைப்படம் சேர்க்கப்பட்டது

source: Series added
ta: தொடர் சேர்க்கப்பட்டது

# show_added_error
source: Could not add show to database
ta: தரவுத்தளத்தில் காட்சியைச் சேர்க்க முடியவில்லை

# start_date
source: Started on: %1$s
ta: தொடங்கியது: %1$s

# start_date_unknown
source: Start date: Not set
ta: தொடக்க தேதி: அமைக்கப்படவில்லை

# finish_date
source: Finished on: %1$s
ta: முடிந்தது: %1$s

# finish_date_unknown
source: Finish date: Not set
ta: முடிவு தேதி: அமைக்கப்படவில்லை

# times_watched
source: Times Watched: %1$d
ta: நேரம் பார்த்தது: %1$d

# episodes_seen
source: Episodes seen: %1$d/%2$d
ta: எபிசோடுகள் காணப்பட்டவை: %1$d/ %2$d

source: Rating:
ta: மதிப்பீடு:

# change_start_date_2
source: Start date:
ta: தொடக்க தேதி:

# change_finish_date_2
source: Finish date:
ta: தேதி முடிக்க:

# change_watched_times
source: Times watched:
ta: நேரங்கள் பார்த்தன:

# cast_title
source: Cast
ta: நடிகர்கள்

# crew_title
source: Crew
ta: குழுவினர்

# recommendations_title
source: Recommendations
ta: பரிந்துரைகள்

# category_picker
source: Pick the appropriate category
ta: பொருத்தமான வகையைத் தேர்ந்தெடுக்கவும்

# show_category
source: Category:
ta: வகை:

source: Sort By
ta: வரிசைப்படுத்தவும்

# default_sort
source: Default
ta: இயல்புநிலை

source: Most Popular
ta: மிகவும் பிரபலமானது

source: Best Rated
ta: சிறந்த மதிப்பிடப்பட்ட

source: Release Date
ta: வெளியீட்டு தேதி

source: Categories
ta: வகைகள்

source: Watching
ta: பார்ப்பது

source: Plan to Watch
ta: பார்க்க திட்டமிடுங்கள்

source: Watched
ta: பார்த்தேன்

source: On Hold
ta: நிறுத்தி

source: Dropped
ta: கைவிடப்பட்டது

source: Dates
ta: தேதிகள்

# in_the_theater_right_now
source: In theatres
ta: திரையரங்குகளில்

source: Between two dates
ta: இரண்டு தேதிகளுக்கு இடையில்

source: End date:
ta: இறுதி தேதி:

source: Genres
ta: வகைகள்

source: Advanced
ta: மேம்பட்ட

# keyword_text
source: Exclude and include keywords by putting their IDs in the respective text box below. * Use , (comma) to indicate you mean both keywords. * Use | (pipe) to indicate you want one or the other.
ta: அவற்றின் ஐடிகளை அந்தந்த உரை பெட்டியில் கீழே வைப்பதன் மூலம் முக்கிய வார்த்தைகளை விலக்கி சேர்க்கவும். * இரண்டு முக்கிய வார்த்தைகளையும் நீங்கள் குறிக்க, (கமா) பயன்படுத்தவும். * பயன்படுத்த | (குழாய்) நீங்கள் ஒன்று அல்லது மற்றொன்றை விரும்புகிறீர்கள் என்பதைக் குறிக்க.

# with_keywords_hint
source: Include shows with the keywords…
ta: முக்கிய வார்த்தைகளுடன் நிகழ்ச்சிகளைச் சேர்க்கவும்…

# without_keywords_hint
source: Exclude shows with the keywords…
ta: முக்கிய வார்த்தைகளுடன் காட்சிகளை விலக்கு…

# movie_tab_title
source: Movies
ta: திரைப்படங்கள்

# series_tab_title
source: Series
ta: தொடர்

# saved_tab_title
source: Saved
ta: சேமிக்கப்பட்டது

# write_to_external_storage_as
source: Saved as:
ta: சேமிக்கப்பட்டது:

# choose_export_file
source: Choose a file format to export:
ta: ஏற்றுமதி செய்ய கோப்பு வடிவமைப்பைத் தேர்வுசெய்க:

# choose_file
source: Choose a file to import:
ta: இறக்குமதி செய்ய ஒரு கோப்பைத் தேர்வுசெய்க:

# import_cancel
source: Cancel
ta: ரத்துசெய்

# file_not_found_exception
source: Could not find the file
ta: கோப்பைக் கண்டுபிடிக்க முடியவில்லை

# hint_search
source: Search…
ta: தேடுங்கள்…

# action_export
source: Export
ta: ஏற்றுமதி

# action_import
source: Import
ta: இறக்குமதி

# action_save
source: Save
ta: சேமி

# title_general
source: General
ta: பொது

# title_show_cast
source: Show cast
ta: நடிகர்களைக் காட்டு

# title_show_crew
source: Show crew
ta: குழுவைக் காட்டு

# title_show_recommendations
source: Show recommendations
ta: பரிந்துரைகளைக் காட்டு

# title_show_save_dialog
source: Show save dialog
ta: சேமி உரையாடலைக் காட்டு

# title_persistent_filtering
source: Persistent filter
ta: தொடர்ச்சியான வடிகட்டி

# summary_persistent_filtering
source: Auto-filter shows when starting the app
ta: பயன்பாட்டைத் தொடங்கும்போது ஆட்டோ-வடிகட்டி காட்சிகள்

# title_show_representation
source: Show representation
ta: பிரதிநிதித்துவத்தைக் காட்டு

# title_shows_in_grid
source: Display shows in a grid
ta: ஒரு கட்டத்தில் காட்சிகள் காட்சிகள்

# title_grid_size
source: Grid size
ta: கட்டம் அளவு

# summary_grid_size
source: Amount of items in a row
ta: ஒரு வரிசையில் உள்ள பொருட்களின் அளவு

# title_data_usage
source: Data usage
ta: தரவு பயன்பாடு

# title_live_search
source: Use live search
ta: நேரடி தேடலைப் பயன்படுத்தவும்

# title_hide_tabs
source: Hide tabs
ta: தாவல்களை மறைக்கவும்

# summary_hide_tabs
source: Restart the app to apply changes.
ta: மாற்றங்களைப் பயன்படுத்த பயன்பாட்டை மறுதொடக்கம் செய்யுங்கள்.

# title_hide_movies_tab
source: Hide the 'Movies' tab
ta: 'திரைப்படங்கள்' தாவலை மறைக்கவும்

# title_hide_series_tab
source: Hide the 'Series' tab
ta: 'தொடர்' தாவலை மறைக்கவும்

# title_hide_saved_tab
source: Hide the 'Saved' tab
ta: 'சேமித்த' தாவலை மறைக்கவும்

# title_api_language
source: API language
ta: பநிஇ மொழி

# summary_api_language
source: Set the language of the API data (otherwise defaults to system language).
ta: பநிஇ தரவின் மொழியை அமைக்கவும் (இல்லையெனில் கணினி மொழிக்கு இயல்புநிலை).

# text_tmdb_credits
source: This product uses the TMDB API but is not endorsed or certified by TMDB
ta: இந்த தயாரிப்பு TMDB பநிஇ ஐப் பயன்படுத்துகிறது, ஆனால் இது TMDB ஆல் அங்கீகரிக்கப்படவில்லை அல்லது சான்றளிக்கப்படவில்லை

# action_settings
source: Settings
ta: அமைப்புகள்

# no_internet_connection
source: There is no Internet connection
ta: இணைய இணைப்பு இல்லை

# title_movies
source: Movies
ta: திரைப்படங்கள்

# title_series
source: Series
ta: தொடர்

# title_saved
source: Saved
ta: சேமிக்கப்பட்டது

# title_account
source: Account
ta: கணக்கு

# title_people
source: People
ta: மக்கள்

# collapse_icon_description
source: Collapses or expands the view
ta: பார்வையை சரிவது அல்லது விரிவுபடுத்துகிறது

# image_description
source: Poster of the show
ta: நிகழ்ச்சியின் சுவரொட்டி

# person_image_description
source: Picture of the person
ta: நபரின் படம்

# movie_image_description
source: Image from the show
ta: நிகழ்ச்சியிலிருந்து படம்

# edit_icon_description
source: Turns on 'edit' mode
ta: 'திருத்து' பயன்முறையை இயக்குகிறது

# file_picked_success
source: File selected
ta: கோப்பு தேர்ந்தெடுக்கப்பட்டது

source: Log In
ta: புகுபதிகை

source: Lists
ta: பட்டியல்கள்

source: Episodes:
ta: அத்தியாயங்கள்:

source: Delete
ta: நீக்கு

source: Cancel
ta: ரத்துசெய்

source: Description
ta: விவரம்

source: List Name
ta: பட்டியல் பெயர்

source: Create List
ta: பட்டியலை உருவாக்கு

# previous_lists
source: Prior Lists
ta: முன் பட்டியல்கள்

source: Create New List
ta: புதிய பட்டியலை உருவாக்கவும்

source: Enter List Name
ta: பட்டியல் பெயரை உள்ளிடவும்

source: Export
ta: ஏற்றுமதி

# login_successful
source: Logged in
ta: உள்நுழைந்தது

source: Experimental
ta: சோதனை

# dynamic_color_preference_summary
source: Colours the details page based on movie or cast image colour.
ta: திரைப்படம் அல்லது நடிகர்கள் பட வண்ணத்தின் அடிப்படையில் விவரங்கள் பக்கத்தை வண்ணமயமாக்குகின்றன.

# dynamic_color_preference_title
source: Dynamically colored details page
ta: மாறும் வண்ண விவரங்கள் பக்கம்

source: Share link button
ta: இணைப்பு பொத்தானைப் பகிரவும்

# database_import_successful
source: Database imported. Please reopen the app.
ta: தரவுத்தளம் இறக்குமதி செய்யப்பட்டது. பயன்பாட்டை மீண்டும் திறக்கவும்.

source: Notification
ta: அறிவிப்பு

# summary_notification_one
source: This preference only applies to movies and shows. For episodes of shows, turn them on individually.
ta: இந்த விருப்பம் திரைப்படங்கள் மற்றும் நிகழ்ச்சிகளுக்கு மட்டுமே பொருந்தும். நிகழ்ச்சிகளின் அத்தியாயங்களுக்கு, அவற்றை தனித்தனியாக இயக்கவும்.

source: Get notified for saved movies
ta: சேமித்த திரைப்படங்களுக்கு அறிவிக்கப்படுங்கள்

# summary_notification_two
source: You will get notified for saved movies when released.
ta: வெளியானபோது சேமிக்கப்பட்ட திரைப்படங்களுக்கு உங்களுக்கு அறிவிக்கப்படும்.

# not_logged_in
source: You are not logged in
ta: நீங்கள் உள்நுழையவில்லை

# logged_in
source: You are logged in
ta: நீங்கள் உள்நுழைந்துள்ளீர்கள்

source: Other
ta: மற்றொன்று

source: Get Notified
ta: அறிவிக்க

source: Title
ta: தலைப்பு

source: Sign Up
ta: பதிவு செய்க

source: Log Out
ta: விடுபதிகை

source: Username
ta: பயனர்பெயர்

# private_list
source: Private
ta: தனிப்பட்ட

source: WatchList
ta: கண்காணிப்பு பட்டியல்

# add_to_list
source: List
ta: பட்டியல்

source: Favourite
ta: பிடித்த

source: Rate
ta: விகிதம்

source: Overview
ta: கண்ணோட்டம்

source: Other Details
ta: பிற விவரங்கள்

source: Country
ta: நாடு

# revenue
source: Budget / Revenue
ta: பட்செட் / வருவாய்

source: Status
ta: நிலை

source: Add to favourite
ta: பிடித்ததைச் சேர்க்கவும்

source: Add rating
ta: மதிப்பீட்டைச் சேர்க்கவும்

# get_notified_for_episode
source: You will get notified when episodes of %1$s release
ta: %1$s வெளியீட்டின் அத்தியாயங்கள் உங்களுக்கு அறிவிக்கப்படும்

# error_reminder_episode
source: Could not save reminder for %1$s
ta: %1$s க்கு நினைவூட்டலைச் சேமிக்க முடியவில்லை

# removed_from_reminder
source: %1$s removed from reminders
ta: நினைவூட்டல்களிலிருந்து %1$s அகற்றப்பட்டன

# crash_log_copied
source: Crash log copied to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்ட செயலிழப்பு பதிவு

source: Permission required
ta: இசைவு தேவை

# permission_required_description
source: This permission is needed to show notifications. There are no spam notifications.
ta: அறிவிப்புகளைக் காட்ட இந்த இசைவு தேவை. ச்பேம் அறிவிப்புகள் எதுவும் இல்லை.

source: OK
ta: சரி

source: Released Movies
ta: வெளியான திரைப்படங்கள்

# notification_for_movie_released
source: Get notified when a movie is released.
ta: ஒரு திரைப்படம் வெளியிடப்படும் போது அறிவிக்கப்படும்.

source: Aired Episodes
ta: ஒளிபரப்பப்பட்ட அத்தியாயங்கள்

# notification_for_episode_air
source: Be notified when an episode is aired.
ta: ஒரு அத்தியாயம் ஒளிபரப்பப்படும்போது அறிவிக்கப்படும்.

source: Not Rated
ta: மதிப்பிடப்படவில்லை

source: Unknown
ta: தெரியவில்லை

source: No description
ta: விளக்கம் இல்லை

# logged_out_successfully
source: Logged out
ta: வெளியேறியது

# rating_delete_success
source: Rating deleted
ta: மதிப்பீடு நீக்கப்பட்டது

# delete_rating_fail
source: Could not delete rating
ta: மதிப்பீட்டை நீக்க முடியவில்லை

# list_delete_success
source: List deleted
ta: பட்டியல் நீக்கப்பட்டது

# failed_to_delete_list
source: Could not delete list
ta: பட்டியலை நீக்க முடியவில்லை

source: Media removed from list
ta: பட்டியலிலிருந்து ஊடகங்கள் அகற்றப்பட்டன

# failed_to_remove_media_from_list
source: Could not remove media from list
ta: பட்டியலிலிருந்து ஊடகங்களை அகற்ற முடியவில்லை

# list_created_successfully
source: List created
ta: பட்டியல் உருவாக்கப்பட்டது

# failed_to_create_list
source: Could not create list
ta: பட்டியலை உருவாக்க முடியவில்லை

source: Added to watchlist
ta: கண்காணிப்பு பட்டியலில் சேர்க்கப்பட்டது

source: Removed from watchlist
ta: கண்காணிப்பு பட்டியலிலிருந்து அகற்றப்பட்டது

source: Media added to list
ta: பட்டியலில் ஊடகங்கள் சேர்க்கப்பட்டன

# failed_to_add_media_to_list
source: Could not add media to list
ta: பட்டியலில் மீடியாவைச் சேர்க்க முடியவில்லை

source: Added to favourites
ta: பிடித்தவைகளில் சேர்க்கப்பட்டது

source: Removed from favourites
ta: பிடித்தவைகளிலிருந்து அகற்றப்பட்டது

# rating_added_successfully
source: Rating added
ta: மதிப்பீடு சேர்க்கப்பட்டது

# failed_to_add_rating
source: Could not add rating.
ta: மதிப்பீட்டைச் சேர்க்க முடியவில்லை.

# episode_airing_today
source: Episode %1$s (%2$s) is airing today!
ta: எபிசோட் %1$s ( %2$s) இன்று ஒளிபரப்பாகிறது!

# movie_released_today
source: %1$s is released today!
ta: %1$s இன்று வெளியிடப்படுகின்றன!

# episodes_removed
source: All episodes marked as watched
ta: பார்த்தது என குறிக்கப்பட்ட அனைத்து அத்தியாயங்களும்

# episodes_added
source: All episodes marked as unwatched
ta: அனைத்து அத்தியாயங்களும் கவனிக்கப்படாதவை என குறிக்கப்பட்டன

# error_occurred_in_list_data
source: Could not fetch list data
ta: பட்டியல் தரவைப் பெற முடியவில்லை

# login_failed
source: Something went wrong. Please log in again.
ta: ஏதோ தவறு நடந்தது. மீண்டும் உள்நுழைக.

# list_state_info
source: The TMDB API lacks a direct method of retrieving availability state (i.e., whether a movie is available or not) for all lists in a single request. Consequently, each movie must be checked against each list, which is inefficient. List states are therefore managed in an offline database after fetching details from TMDB. When a user adds or removes a movie from a list, this action is recorded both in TMDB and our database. However, if a user modifies their lists outside of the app (e.g., on the TMDB website), the app won’t be aware of these changes. To update the data, users can manually refresh their lists using the provided button.
ta: ஒரே கோரிக்கையில் உள்ள அனைத்து பட்டியல்களுக்கும் கிடைக்கும் நிலையை (அதாவது, ஒரு திரைப்படம் கிடைக்குமா இல்லையா) மீட்டெடுப்பதற்கான நேரடி முறை டிஎம்டிபி பநிஇ இல்லை. இதன் விளைவாக, ஒவ்வொரு திரைப்படமும் ஒவ்வொரு பட்டியலுக்கும் எதிராக சரிபார்க்கப்பட வேண்டும், இது திறமையற்றது. எனவே டிஎம்டிபியிலிருந்து விவரங்களைப் பெற்ற பிறகு பட்டியல் மாநிலங்கள் இணைப்பில்லாத தரவுத்தளத்தில் நிர்வகிக்கப்படுகின்றன. ஒரு பயனர் ஒரு பட்டியலிலிருந்து ஒரு திரைப்படத்தை சேர்க்கும்போது அல்லது நீக்கும்போது, ​​இந்த செயல் TMDB மற்றும் எங்கள் தரவுத்தளத்தில் பதிவு செய்யப்படுகிறது. இருப்பினும், ஒரு பயனர் பயன்பாட்டிற்கு வெளியே (எ.கா., டிஎம்டிபி இணையதளத்தில்) தங்கள் பட்டியல்களை மாற்றியமைத்தால், இந்த மாற்றங்கள் குறித்து பயன்பாடு அறிந்திருக்காது. தரவைப் புதுப்பிக்க, வழங்கப்பட்ட பொத்தானைப் பயன்படுத்தி பயனர்கள் தங்கள் பட்டியல்களை கைமுறையாக புதுப்பிக்கலாம்.

# lists_state_info_title
source: Lists Info
ta: செய்தி பட்டியலிடுகிறது

source: Load HD images
ta: எச்டி படங்களை ஏற்றவும்

# load_hd_image_summary
source: The movie posters, episode images, cast images will be loaded with 780+ resolution.
ta: திரைப்பட சுவரொட்டிகள், எபிசோட் படங்கள், நடிகர்கள் படங்கள் 780+ தெளிவுத்திறனுடன் ஏற்றப்படும்.

# runtime_minutes
source: %1$d minutes
ta: %1$d நிமிடங்கள்

source: Rated
ta: மதிப்பிடப்பட்டது

source: Movie
ta: படம்

source: TV Show
ta: தொலைக்காட்சி நிகழ்ச்சி

source: Type
ta: வகை

# just_watch_attribution
source: This app uses JustWatch data to show 'Where to watch?' info.
ta: இந்த பயன்பாடு சச்ட்வாட்ச் தரவைப் பயன்படுத்துகிறது 'எங்கு பார்க்க வேண்டும்?' செய்தி.

# share
source: Share ShowCase
ta: பகிர்வு காட்சி பெட்டி

source: Donate
ta: நன்கொடை

source: Attribution
ta: பண்புக்கூறு

# about_movie_db
source: About
ta: பற்றி

source: Image
ta: படம்

source: Where to watch?
ta: எங்கே பார்க்க வேண்டும்?

source: Trailer
ta: டிரெய்லர்

# selected_directory
source: Path:
ta: பாதை:

# export_info
source: The app allows for the exportation of files in ".db", ".json" and ".csv" formats. Please note, however, that only the ".db" format is supported for subsequent imports.
ta: ".Db", ".json" மற்றும் ".csv" வடிவங்களில் கோப்புகளை ஏற்றுமதி செய்ய பயன்பாடு அனுமதிக்கிறது. எவ்வாறாயினும், ".DB" வடிவம் மட்டுமே அடுத்தடுத்த இறக்குமதிக்கு ஆதரிக்கப்படுகிறது என்பதை நினைவில் கொள்க.

# directory_path
source: Path: %1$s
ta: பாதை: %1$s

# no_browser_available
source: No app can handle this request. Please install a web browser.
ta: இந்த கோரிக்கையை எந்த பயன்பாடும் கையாள முடியாது. வலை உலாவியை நிறுவவும்.

# rate_movie
source: Rate
ta: விகிதம்

source: Edit
ta: தொகு

source: Done
ta: முடிந்தது

# episode_rating_tmdb_not_set
source: Rating (TMDB): Not set
ta: மதிப்பீடு (TMDB): அமைக்கப்படவில்லை

# episode_rating_db_not_set
source: Rating (DB): Not set
ta: மதிப்பீடு (டி.பி.): அமைக்கப்படவில்லை

source: Watched on:
ta: பார்த்தது:

source: Rating (DB):
ta: மதிப்பீடு (டி.பி.):

source: Watched On: Not set
ta: பார்த்தது: அமைக்கப்படவில்லை

# account_data_tab_title
source: Account
ta: கணக்கு

source: Hide the 'Account' tab
ta: 'கணக்கு' தாவலை மறைக்கவும்

# loading_in_progress
source: Please wait, loading in progress…
ta: தயவுசெய்து காத்திருங்கள், முன்னேற்றத்தில் ஏற்றுகிறது…

source: Save to database
ta: தரவுத்தளத்தில் சேமிக்கவும்

source: Save
ta: சேமி

source: Choose Date
ta: தேதியைத் தேர்வுசெய்க

source: Error adding episode to database
ta: தரவுத்தளத்தில் அத்தியாயத்தைச் சேர்ப்பதில் பிழை

# login_is_required_to_use_tmdb_based_sync
source: Login needed use TMDB based sync.
ta: உள்நுழைவு தேவை TMDB அடிப்படையிலான ஒத்திசைவு.

# overview_not_available
source: Overview not added to the episode. It will when available.
ta: எபிசோடில் கண்ணோட்டம் சேர்க்கப்படவில்லை. அது கிடைக்கும்போது அது இருக்கும்.

source: Search Engine
ta: தேடுபொறி

# search_engine_key_summary
source: Search Engine to use for searching movies from the app (default is Google)
ta: பயன்பாட்டிலிருந்து திரைப்படங்களைத் தேடுவதற்கு பயன்படுத்த தேடுபொறி (இயல்புநிலை கூகிள்)

source: Home
ta: வீடு

source: Rating (TMDB):
ta: மதிப்பீடு (TMDB):

source: Links
ta: இணைப்புகள்

# search_movie_show
source: Search Movie and/or show…
ta: திரைப்படத் தேடு மற்றும்/அல்லது காட்டு…

source: Invalid URL
ta: தவறான முகவரி

# image_download_successful
source: Image downloaded
ta: பட பதிவிறக்க

# failed_to_download_image
source: Could not download image
ta: படத்தைப் பதிவிறக்க முடியவில்லை

source: Error:
ta: பிழை:

# failed_to_create_directory
source: Could not create directory
ta: கோப்பகத்தை உருவாக்க முடியவில்லை

# reviews
source: Review: %1$s
ta: விமர்சனம்: %1$s

# no_reviews
source: Review: Not added
ta: விமர்சனம்: சேர்க்கப்படவில்லை

source: Default media type
ta: இயல்புநிலை ஊடக வகை

# show_shows_as_default_in_the_account_tab
source: Display "Shows" as default in the 'Account' tab
ta: 'கணக்கு' தாவலில் இயல்புநிலையாக "காட்சிகள்" காண்பி

# remember_only_the_year
source: Don't remember the exact date
ta: சரியான தேதி நினைவில் இல்லை

source: Remember the full date
ta: முழு தேதியை நினைவில் கொள்க

source: Month
ta: மாதம்

source: Year
ta: ஆண்டு

source: Keywords
ta: முக்கிய வார்த்தைகள்

source: Search
ta: தேடல்

source: Homepage
ta: முகப்புப்பக்கம்

source: Pick File
ta: கோப்பைத் தேர்ந்தெடுங்கள்

# error_saving_file
source: Something went wrong. Could not save file.
ta: ஏதோ தவறு நடந்தது. கோப்பைச் சேமிக்க முடியவில்லை.

source: Now Playing
ta: இப்போது விளையாடுகிறது

source: Airing Today
ta: இன்று ஒளிபரப்பாகிறது

source: Upcoming
ta: வரவிருக்கும்

source: On The Air
ta: காற்றில்

source: Trending
ta: டிரெண்டிங்

source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

# permission_required_image
source: This permission is necessary to view the images. Please grant the permission from 'Settings' or 'App info'.
ta: படங்களைக் காண இந்த இசைவு தேவை. தயவுசெய்து 'அமைப்புகள்' அல்லது 'பயன்பாட்டு செய்தி' ஆகியவற்றிலிருந்து அனுமதியை வழங்கவும்.

# copy_text
source: Copy
ta: நகலெடு

source: Crash Log
ta: செயலிழப்பு பதிவு

source: Close
ta: மூடு

# file_picked_fail
source: Could not select file
ta: கோப்பைத் தேர்ந்தெடுக்க முடியவில்லை

# action_account
source: Account
ta: கணக்கு

# database_not_found
source: Database unavailable
ta: தரவுத்தளம் கிடைக்கவில்லை

# export_channel_name
source: Database Backup
ta: தரவுத்தள காப்புப்பிரதி

# export_channel_description
source: Notification for automated database backup
ta: தானியங்கு தரவுத்தள காப்புப்பிரதிக்கான அறிவிப்பு

# auto_backup_directory_selection
source: Select Directory for Auto-backup
ta: ஆட்டோ-பேக்அப்பிற்கான கோப்பகத்தைத் தேர்ந்தெடுக்கவும்

source: Backup Directory Selected
ta: காப்புப்பிரதி அடைவு தேர்ந்தெடுக்கப்பட்டது

# enable_auto_backup
source: Turn on auto-backup
ta: ஆட்டோ-பேக்அப்பை இயக்கவும்

source: Database Backup
ta: தரவுத்தள காப்புப்பிரதி

# database_backup_successful
source: Database backup completed.
ta: தரவுத்தள காப்புப்பிரதி முடிந்தது.

# database_backup_failed
source: Could not back up database. Try granting access to the folder again.
ta: தரவுத்தளத்தை காப்புப் பிரதி எடுக்க முடியவில்லை. கோப்புறையை மீண்டும் அணுக முயற்சிக்கவும்.

source: Filter people list
ta: மக்கள் பட்டியலை வடிகட்டவும்

source: Import Movie Database
ta: திரைப்பட தரவுத்தளத்தை இறக்குமதி செய்யுங்கள்

source: Import People Database
ta: மக்கள் தரவுத்தளத்தை இறக்குமதி செய்யுங்கள்

source: Seasons
ta: பருவங்கள்

# account_id_fail_try_login_again
source: Could not retrieve account ID. Try login again.
ta: கணக்கு ஐடியை மீட்டெடுக்க முடியவில்லை. மீண்டும் உள்நுழைய முயற்சிக்கவும்.

source: Select Year and Month
ta: ஆண்டு மற்றும் மாதத்தைத் தேர்ந்தெடுக்கவும்

source: No trailer available
ta: டிரெய்லர் எதுவும் கிடைக்கவில்லை

source: Select a Date
ta: தேதியைத் தேர்ந்தெடுக்கவும்

# failed_to_retrieve_account_id
source: Could not retrieve account ID
ta: கணக்கு ஐடியை மீட்டெடுக்க முடியவில்லை

source: Season
ta: சீசன்

# watching1
source: Watching: %1$d
ta: பார்ப்பது: %1$d

# watched1
source: Watched: %1$d
ta: பார்த்தது: %1$d

# plan_to_watch1
source: Plan to Watch: %1$d
ta: பார்க்க திட்டமிடுங்கள்: %1$d

# on_hold1
source: On Hold: %1$d
ta: நிறுத்தி: %1$d

# dropped1
source: Dropped: %1$d
ta: கைவிடப்பட்டது: %1$d

source: Watch Summary
ta: சுருக்கம் பார்க்கவும்

source: Share link using
ta: பயன்படுத்தி இணைப்பைப் பகிரவும்

# episode_title
source: S:%1$d E:%2$d %3$s
ta: எச்:%1$d e:%2$d%3$s

# season_number
source: S: %1$d
ta: எச்: %1$d

# episode_number
source: E: %1$d
ta: இ: %1$d

source: Review
ta: சீராய்வு

# rating1
source: Rating
ta: செயல்வரம்பு

source: Specials
ta: சிறப்பு

source: No specials available
ta: சிறப்பு எதுவும் கிடைக்கவில்லை

# backup_fequency_error_text
source: Backup frequency cannot be less than 15 minutes
ta: காப்பு அதிர்வெண் 15 நிமிடங்களுக்கும் குறைவாக இருக்க முடியாது

source: Backup Frequency
ta: காப்பு அதிர்வெண்

# error_rating_exceeds_limit
source: Please enter a value within 0.0–10.0
ta: 0.0–10.0 க்குள் ஒரு மதிப்பை உள்ளிடவும்

# items_count
source: Items: %1$d
ta: உருப்படிகள்: %1$d

source: Refresh
ta: புதுப்பிப்பு
