Repository: 247i/TACETr
Catalog: உரை/தானி/sonic-pi-qt-sonic-pi-gui-*.po
Languages: ta

# MainWindow
source: Please consider reporting a bug at
ta: ஒரு பிழையைப் புகாரளிப்பதைக் கவனியுங்கள்

# MainWindow
source: Start Recording
ta: பதிவு செய்யத் தொடங்குங்கள்

# MainWindow
source: Increase Text Size
ta: உரை அளவை அதிகரிக்கவும்

# MainWindow
source: Decrease Text Size
ta: உரை அளவைக் குறைக்கவும்

# MainWindow
source: Tools
ta: கருவிகள்

# MainWindow
source: About
ta: பற்றி

# MainWindow
source: Core Team
ta: மைய அணி

# MainWindow
source: Contributors
ta: பங்களிப்பாளர்கள்

# MainWindow
source: Community
ta: சமூகம்

# MainWindow
source: Studio Mode Enabled. Thank-you for supporting Sonic Pi.
ta: ச்டுடியோ பயன்முறை இயக்கப்பட்டது. சோனிக் பைக்கு ஆதரவளித்ததற்கு நன்றி.

# MainWindow
source: No Matching Studio Hash Found...
ta: பொருந்தக்கூடிய ச்டுடியோ ஆச் இல்லை ...

# MainWindow
source: Close
ta: மூடு

# MainWindow
source: Align code to improve readability
ta: வாசிப்புத்திறனை மேம்படுத்த குறியீட்டை சீரமைக்கவும்

# MainWindow
source: Toggle visibility of audio oscilloscope
ta: ஆடியோ அலைக்காட்டி தெரிவுநிலையை மாற்றவும்

# MainWindow
source: License
ta: உரிமம்

# MainWindow
source: History
ta: வரலாறு

# MainWindow
source: Sonic Pi - Info
ta: சோனிக் பை - செய்தி

# MainWindow
source: Save Recording
ta: பதிவைச் சேமிக்கவும்

# MainWindow
source: Cannot read file %1: %2.
ta: கோப்பு %1 ஐப் படிக்க முடியாது: %2.

# MainWindow
source: Cannot write file %1: %2.
ta: கோப்பு %1 ஐ எழுத முடியாது: %2.

# MainWindow
source: Tutorial
ta: பயிற்சி

# MainWindow
source: Examples
ta: எடுத்துக்காட்டுகள்

# MainWindow
source: Synths
ta: சின்த்ச்

# MainWindow
source: Samples
ta: மாதிரிகள்

# MainWindow
source: Lang
ta: லாங்

# QObject
source: Sonic Pi
ta: சோனிக் பை

# SettingsWidget
source: Audio
ta: ஆடியோ

# SettingsWidget
source: Editor
ta: திருத்தி

# SettingsWidget
source: Visuals
ta: காட்சிகள்

# SettingsWidget
source: Updates
ta: புதுப்பிப்புகள்

# SettingsWidget
source: Language
ta: மொழி

# SettingsWidget
source: Use this slider to change the system volume.
ta: கணினி அளவை மாற்ற இந்த ச்லைடரைப் பயன்படுத்தவும்.

# SettingsWidget
source: Audio Output
ta: ஆடியோ வெளியீடு

# SettingsWidget
source: Advanced audio settings for working with external PA systems when performing with Sonic Pi.
ta: வேலை செய்வதற்கான மேம்பட்ட ஆடியோ அமைப்புகள் சோனிக் பி.ஐ.யுடன் செயல்படும்போது வெளிப்புற பி.ஏ அமைப்புகள்.

# SettingsWidget
source: Invert stereo
ta: தலைகீழ் ச்டீரியோ

# SettingsWidget
source: Toggle stereo inversion. If enabled, audio sent to the left speaker will be routed to the right speaker and vice versa.
ta: ச்டீரியோ தலைகீழ் மாற்றவும். இயக்கப்பட்டிருந்தால், இடது பேச்சாளருக்கு அனுப்பப்படும் ஆடியோ சரியான பேச்சாளருக்கு அனுப்பவும், நேர்மாறாகவும்.

# SettingsWidget
source: Force mono
ta: மோனோவை கட்டாயப்படுத்துங்கள்

# SettingsWidget
source: Toggle mono mode. If enabled both right and left audio is mixed and the same signal is sent to both speakers. Useful when working with external systems that can only handle mono.
ta: மோனோ பயன்முறையை மாற்றவும். வலது மற்றும் இடது ஆடியோ இரண்டையும் இயக்கினால் கலப்பு மற்றும் ஒரே சமிக்ஞை இரு பேச்சாளர்களுக்கும் அனுப்பப்படுகிறது. வெளிப்புற அமைப்புகளுடன் பணிபுரியும் போது பயனுள்ளதாக இருக்கும் மோனோவை மட்டுமே கையாள முடியும்.

# SettingsWidget
source: Synths and FX
ta: சின்த்ச் மற்றும் எஃப்எக்ச்

# SettingsWidget
source: Modify behaviour of synths and FX
ta: சின்த்ச் மற்றும் எஃப்எக்ச் நடத்தை மாற்றவும்

# SettingsWidget
source: Safe mode
ta: பாதுகாப்பான பயன்முறை

# SettingsWidget
source: Toggle synth argument checking functions. If disabled, certain synth opt values may create unexpectedly loud or uncomfortable sounds.
ta: சின்த் வாத சோதனை செயல்பாடுகளை மாற்றவும். முடக்கப்பட்டால், சில சின்த் OPT மதிப்புகள் இருக்கலாம் எதிர்பாராத விதமாக உரத்த அல்லது சங்கடமான ஒலிகளை உருவாக்கவும்.

# SettingsWidget
source: Enforce timing guarantees
ta: நேர உத்தரவாதங்களை செயல்படுத்தவும்

# SettingsWidget
source: When enabled, Sonic Pi will refuse to trigger synths and FX if it is too late to do so When disabled, Sonic Pi will always attempt to trigger synths and FX even when a little late.
ta: இயக்கப்பட்டால், சோனிக் பை மறுக்கும் சின்த்ச் மற்றும் எஃப்எக்ச் என்றால் தூண்டுவதற்கு அவ்வாறு செய்ய மிகவும் தாமதமானது முடக்கப்பட்டால், சோனிக் பை எப்போதும் இருக்கும் சின்த்ச் மற்றும் எஃப்எக்ச் ஆகியவற்றைத் தூண்ட முயற்சிக்கவும் கொஞ்சம் தாமதமாக இருக்கும்போது கூட.

# SettingsWidget
source: When enabled, Sonic Pi will allow synths and FX loaded via load_synthdefs to be triggered. When disabled, Sonic Pi will complain when you attempt to use a synth or FX which isn't recognised.
ta: இயக்கப்பட்டால், சோனிக் பை அனுமதிக்கும் Synths மற்றும் FX LOAD_SYNTHDEFS வழியாக ஏற்றப்படுகின்றன தூண்டப்பட வேண்டும். முடக்கப்பட்டபோது, ​​சோனிக் பை குற்றச்சாட்டு அளிப்பார் நீங்கள் ஒரு சின்த் அல்லது எஃப்எக்ச் பயன்படுத்த முயற்சிக்கும்போது இது அங்கீகரிக்கப்படவில்லை.

# SettingsWidget
source: Networked OSC
ta: பிணையம் OSC

# SettingsWidget
source: Sonic Pi can send and receive Open Sound Control messages to and from other programs or computers via the currently connected network.
ta: சோனிக் பை திறந்த ஒலி கட்டுப்பாட்டு செய்திகளை அனுப்பலாம் மற்றும் பெறலாம் பிற நிரல்கள் அல்லது கணினிகளிலிருந்து தற்போது இணைக்கப்பட்ட பிணையம் வழியாக.

# SettingsWidget
source: Local IP address
ta: உள்ளக ஐபி முகவரி

# SettingsWidget
source: Unavailable
ta: கிடைக்கவில்லை

# SettingsWidget
source: Allow OSC from other computers
ta: மற்ற கணினிகளிலிருந்து OSC ஐ அனுமதிக்கவும்

# SettingsWidget
source: When checked, Sonic Pi will let you send and receive OSC messages to and from remote machines. When unchecked, only sending and receiving from the local machine will be enabled.
ta: சரிபார்க்கும்போது, ​​தொலைநிலை இயந்திரங்களுக்கு மற்றும் OSC செய்திகளை அனுப்பவும் பெறவும் சோனிக் பை உங்களை அனுமதிக்கும். தேர்வு செய்யப்படும்போது, ​​உள்ளூர் இயந்திரத்திலிருந்து அனுப்புவதும் பெறுவதும் மட்டுமே இயக்கப்படும்.

# SettingsWidget
source: Allow incoming OSC
ta: உள்வரும் OSC ஐ அனுமதிக்கவும்

# SettingsWidget
source: all
ta: அனைத்தும்

# SettingsWidget
source: Default MIDI out channel
ta: இயல்புநிலை மிடி அவுட் சேனல்

# SettingsWidget
source: Automatically align code on Enter or Run
ta: ENTER அல்லது ஓடு இல் குறியீட்டை தானாக சீரமைக்கவும்

# SettingsWidget
source: Show code completion
ta: குறியீடு நிறைவைக் காட்டு

# SettingsWidget
source: When checked, Sonic Pi will listen for OSC messages. When unchecked no OSC messages will be received.
ta: சரிபார்க்கும்போது, ​​சோனிக் பை OSC செய்திகளைக் கேட்பார். தேர்வு செய்யப்படாதபோது, ​​OSC செய்திகள் எதுவும் பெறப்படாது.

# SettingsWidget
source: MIDI Configuration
ta: மிடி உள்ளமைவு

# SettingsWidget
source: Configure MIDI behaviour
ta: மிடி நடத்தை உள்ளமைக்கவும்

# SettingsWidget
source: MIDI Ports
ta: மிடி துறைமுகங்கள்

# SettingsWidget
source: List all connected MIDI Ports
ta: இணைக்கப்பட்ட அனைத்து மிடி போர்ட்களையும் பட்டியலிடுங்கள்

# SettingsWidget
source: Reset MIDI
ta: மிடி மீட்டமை

# SettingsWidget
source: Reset MIDI subsystems (Required to detect device changes on macOS)
ta: மிடி துணை அமைப்புகளை மீட்டமைக்கவும் (MACOS இல் சாதன மாற்றங்களைக் கண்டறிய வேண்டும்)

# SettingsWidget
source: No connected input devices
ta: இணைக்கப்பட்ட உள்ளீட்டு சாதனங்கள் இல்லை

# SettingsWidget
source: No connected output devices
ta: இணைக்கப்பட்ட வெளியீட்டு சாதனங்கள் இல்லை

# SettingsWidget
source: MIDI input devices send MIDI messages directly to Sonic Pi and are received as cue events (similar to incoming OSC messages and internal cues)
ta: மிடி உள்ளீட்டு சாதனங்கள் மிடி செய்திகளை நேரடியாக அனுப்புகின்றன சோனிக் பை மற்றும் அவை கோல் நிகழ்வுகளாக பெறப்படுகின்றன (உள்வரும் OSC செய்திகள் மற்றும் உள் குறிப்புகளைப் போன்றது)

# SettingsWidget
source: MIDI output devices receive MIDI messages directly from Sonic Pi which can be sent via the midi_* fns
ta: மிடி வெளியீட்டு சாதனங்கள் மிடி செய்திகளை நேரடியாகப் பெறுகின்றன சோனிக் பை, இது மிடி_* எஃப்என்எச் வழியாக அனுப்பப்படலாம்

# SettingsWidget
source: Show and Hide
ta: காட்டவும் மறைக்கவும்

# SettingsWidget
source: Configure editor display options.
ta: எடிட்டர் காட்சி விருப்பங்களை உள்ளமைக்கவும்.

# SettingsWidget
source: Configure editor look and feel.
ta: ஆசிரியர் தோற்றத்தையும் உணர்வையும் உள்ளமைக்கவும்.

# SettingsWidget
source: Main Volume
ta: முக்கிய தொகுதி

# SettingsWidget
source: Audio Input
ta: ஆடியோ உள்ளீடு

# SettingsWidget
source: Audio settings for working with audio inputs.
ta: ஆடியோ உள்ளீடுகளுடன் பணியாற்றுவதற்கான ஆடியோ அமைப்புகள்.

# SettingsWidget
source: Enable Audio Inputs
ta: ஆடியோ உள்ளீடுகளை இயக்கவும்

# SettingsWidget
source: Toggle to enable or disable audio inputs.
ta: ஆடியோ உள்ளீடுகளை இயக்க அல்லது முடக்க மாற்று.

# SettingsWidget
source: Enable external synths/FX
ta: வெளிப்புற சின்த்ச்/எஃப்எக்ச் இயக்கவும்

# SettingsWidget
source: Audio Hardware Information
ta: ஆடியோ வன்பொருள் செய்தி

# SettingsWidget
source: Audio hardware configuration and information.
ta: ஆடியோ வன்பொருள் உள்ளமைவு மற்றும் செய்தி.

# SettingsWidget
source: Information unavailable.
ta: செய்தி கிடைக்கவில்லை.

# SettingsWidget
source: Incoming OSC port
ta: உள்வரும் OSC துறைமுகம்

# SettingsWidget
source: Enable incoming MIDI cues
ta: உள்வரும் மிடி குறிப்புகளை இயக்கவும்

# SettingsWidget
source: Enable or disable automatic conversion of incoming MIDI messages to cue events
ta: உள்வரும் மிடி செய்திகளை CUE நிகழ்வுகளுக்கு தானியங்கி மாற்றத்தை இயக்கவும் அல்லது முடக்கவும்

# SettingsWidget
source: Default MIDI Channel to send messages to (* means all)
ta: செய்திகளை அனுப்ப இயல்புநிலை மிடி சேனல் (* எல்லாவற்றிற்கும்)

# SettingsWidget
source: Default MIDI Channel to send messages to (* means all)
ta: செய்திகளை அனுப்ப இயல்புநிலை மிடி சேனல் (* எல்லாவற்றிற்கும்)

# SettingsWidget
source: Show Panels
ta: பேனல்களைக் காட்டு

# SettingsWidget
source: Show and hide information panes such as the scope and log.
ta: நோக்கம் மற்றும் பதிவு போன்ற செய்தி பேன்களைக் காட்டி மறைக்கவும்.

# SettingsWidget
source: Theme
ta: கருப்பொருள்

# SettingsWidget
source: Automation / Misc
ta: ஆட்டோமேசன் / மற்றவை

# SettingsWidget
source: Configure automation and other features.
ta: ஆட்டோமேசன் மற்றும் பிற அம்சங்களை உள்ளமைக்கவும்.

# SettingsWidget
source: Auto-align
ta: ஆட்டோ-சீரமை

# SettingsWidget
source: Show line numbers
ta: வரி எண்களைக் காட்டு

# SettingsWidget
source: Toggle line number visibility.
ta: வரி எண் தெரிவுநிலையை மாற்றவும்.

# SettingsWidget
source: When enabled, Sonic Pi's editor will attempt to autocomplete your code with suggestions. When disabled, these suggestions will not be visible.
ta: இயக்கப்பட்டால், சோனிக் பை எடிட்டர் உங்கள் குறியீட்டை பரிந்துரைகளுடன் தன்னியக்கமாக்க முயற்சிக்கும். முடக்கப்பட்டால், இந்த பரிந்துரைகள் தெரியவில்லை.

# SettingsWidget
source: Show code context
ta: குறியீடு சூழலைக் காட்டு

# SettingsWidget
source: When enabled, Sonic Pi's editor will show a pane which will display context-specific information for the code such as the current line and position of the cursor.
ta: இயக்கப்பட்டால், சோனிக் PI இன் ஆசிரியர் ஒரு பலகத்தைக் காண்பிப்பார், இது கர்சரின் தற்போதைய வரி மற்றும் நிலை போன்ற குறியீட்டிற்கான சூழல் சார்ந்த தகவல்களைக் காண்பிக்கும்.

# SettingsWidget
source: Show log
ta: பதிவைக் காட்டு

# SettingsWidget
source: Toggle visibility of the log.
ta: பதிவின் தெரிவுநிலையை மாற்றவும்.

# SettingsWidget
source: Show cue log
ta: கியூ பதிவைக் காட்டு

# SettingsWidget
source: Toggle visibility of cue log which displays internal cues & incoming OSC/MIDI messages.
ta: உள் குறிப்புகள் மற்றும் உள்வரும் OSC/MIDI செய்திகளைக் காண்பிக்கும் CUE பதிவின் தெரிவுநிலையை மாற்றவும்.

# SettingsWidget
source: Show Link metronome controls
ta: இணைப்பு மெட்ரோனோம் கட்டுப்பாடுகளைக் காட்டு

# SettingsWidget
source: Toggle visibility of the Link metronome controls.
ta: இணைப்பு மெட்ரோனோம் கட்டுப்பாடுகளின் தெரிவுநிலையை மாற்றவும்.

# SettingsWidget
source: Show buttons
ta: பொத்தான்களைக் காட்டு

# SettingsWidget
source: Toggle visibility of the control buttons.
ta: கட்டுப்பாட்டு பொத்தான்களின் தெரிவுநிலையை மாற்றவும்.

# SettingsWidget
source: Show tabs
ta: தாவல்களைக் காட்டு

# SettingsWidget
source: Toggle visibility of the buffer selection tabs.
ta: இடையக தேர்வு தாவல்களின் தெரிவுநிலையை மாற்றவும்.

# SettingsWidget
source: Full screen
ta: முழுத் திரை

# SettingsWidget
source: Toggle full screen mode.
ta: முழு திரை பயன்முறையை மாற்றவும்.

# SettingsWidget
source: Show titles
ta: தலைப்புகளைக் காட்டு

# SettingsWidget
source: Toggle the title visibility for the scope, log, cue and other information panes
ta: நோக்கம், பதிவு, கியூ மற்றும் பிற செய்தி பேன்களுக்கான தலைப்பு தெரிவுநிலையை மாற்றவும்

# SettingsWidget
source: Hide Menubar in Fullscreen Mode
ta: முழுத்திரை பயன்முறையில் மெனுபரை மறைக்கவும்

# SettingsWidget
source: Automatically hide the menubar when the app is in full screen mode. Note that the menubar is always visible when not in full screen mode.
ta: பயன்பாடு முழு திரை பயன்முறையில் இருக்கும்போது தானாகவே மெனுபரை மறைக்கவும். முழு திரை பயன்முறையில் இல்லாதபோது மெனுபார் எப்போதும் தெரியும் என்பதை நினைவில் கொள்க.

# SettingsWidget
source: Light
ta: ஒளி

# SettingsWidget
source: Dark
ta: இருண்ட

# SettingsWidget
source: Pro Light
ta: சார்பு ஒளி

# SettingsWidget
source: Pro Dark
ta: இருண்ட சார்பு

# SettingsWidget
source: High Contrast
ta: உயர் வேறுபாடு

# SettingsWidget
source: Logging
ta: பதிவு

# SettingsWidget
source: Configure debug behaviour
ta: பிழைத்திருத்த நடத்தை உள்ளமைக்கவும்

# SettingsWidget
source: Log synths
ta: பதிவு சின்த்ச்

# SettingsWidget
source: Toggle log messages. If disabled, activity such as synth and sample triggering will not be printed to the log by default.
ta: பதிவு செய்திகளை மாற்றவும். முடக்கப்பட்டால், சின்த் மற்றும் மாதிரி போன்ற செயல்பாடு தூண்டுதல் முன்னிருப்பாக பதிவுக்கு அச்சிடப்படாது.

# SettingsWidget
source: Clear log on run
ta: இயக்கத்தில் பதிவை அழிக்கவும்

# SettingsWidget
source: Toggle log clearing on run. If enabled, the log is cleared each time the run button is pressed.
ta: ஓட்டத்தில் பதிவு தீர்வு மாற்றவும். இயக்கப்பட்டிருந்தால், பதிவு ஒவ்வொன்றும் அழிக்கப்படும் ரன் பொத்தானை அழுத்தும் நேரம்.

# SettingsWidget
source: Log cues
ta: பதிவு குறிப்புகள்

# SettingsWidget
source: Enable or disable logging of cues. If disabled, cues will still trigger. However, they will not be visible in the logs.
ta: குறிப்புகளின் பதிவை இயக்கவும் அல்லது முடக்கவும். முடக்கப்பட்டால், குறிப்புகள் இன்னும் தூண்டும். இருப்பினும், அவை பதிவுகளில் காணப்படாது.

# SettingsWidget
source: Auto-scroll log
ta: ஆட்டோ-ச்க்ரோல் பதிவு

# SettingsWidget
source: Toggle log auto scrolling. If enabled the log is scrolled to the bottom after every new message is displayed.
ta: பதிவு ஆட்டோ ச்க்ரோலிங்கை மாற்றவும். இயக்கப்பட்டால், ஒவ்வொரு புதிய செய்தியும் காட்டப்பட்ட பிறகு பதிவு கீழே உருட்டப்படும்.

# SettingsWidget
source: Settings useful for performing with Sonic Pi
ta: சோனிக் பைவுடன் செயல்பட பயனுள்ள அமைப்புகள்

# SettingsWidget
source: Show and Hide Scope
ta: நோக்கம் காட்டவும் மறைக்கவும்

# SettingsWidget
source: Scope Kinds
ta: நோக்கம் வகைகள்

# SettingsWidget
source: Show scopes
ta: ச்கோப்களைக் காட்டு

# SettingsWidget
source: Show scope labels
ta: நோக்கம் லேபிள்களைக் காட்டு

# SettingsWidget
source: Configure language settings
ta: மொழி அமைப்புகளை உள்ளமைக்கவும்

# SettingsWidget
source: UI & Tutorial Language (Requires a restart to take effect)
ta: இடைமுகம் & டுடோரியல் மொழி (நடைமுறைக்கு வர மறுதொடக்கம் தேவை)

# SettingsWidget
source: Change the language of the UI & Tutorial (Requires a restart to take effect)
ta: இடைமுகம் & டுடோரியலின் மொழியை மாற்றவும் (நடைமுறைக்கு வர மறுதொடக்கம் தேவை)

# SettingsWidget
source: Change the language of the UI & Tutorial
ta: இடைமுகம் & டுடோரியலின் மொழியை மாற்றவும்

# SettingsWidget
source: Translations have been generously provided by volunteers on https://hosted.weblate.org/projects/sonic-pi/. Thank you! :)
ta: மொழிபெயர்ப்புகள் தன்னார்வலர்களால் தாராளமாக வழங்கப்பட்டுள்ளன on https://hosted.weblate.org/projects/sonic-pi/. நன்றி! :)

# SettingsWidget
source: You've selected a new language: %1
ta: நீங்கள் ஒரு புதிய மொழியைத் தேர்ந்தெடுத்துள்ளீர்கள்: %1

# SettingsWidget
source: Do you want to apply this language?
ta: இந்த மொழியைப் பயன்படுத்த விரும்புகிறீர்களா?

# SettingsWidget
source: The new language will be applied when you next start Sonic Pi.
ta: நீங்கள் அடுத்ததாக சோனிக் பை தொடங்கும்போது புதிய மொழி பயன்படுத்தப்படும்.

# SettingsWidget
source: System language found: %1
ta: கணினி மொழி காணப்படுகிறது: %1

# SettingsWidget
source: System language: %1
ta: கணினி மொழி: %1

# SettingsWidget
source: Apply
ta: இடு

# SettingsWidget
source: Cancel
ta: ரத்துசெய்

# SettingsWidget
source: <b>The new language will be applied when you next start Sonic Pi.</b><br>
ta: <b> நீங்கள் அடுத்ததாக சோனிக் பை தொடங்கும்போது புதிய மொழி பயன்படுத்தப்படும். </b> <br>

# SettingsWidget
source: Current UI language: %1
ta: தற்போதைய இடைமுகம் மொழி: %1

# SettingsWidget
source: Restart Sonic Pi?
ta: சோனிக் பை மறுதொடக்கம் செய்யவா?

# SettingsWidget
source: Do you want to restart Sonic Pi now? This will stop any current runs & recordings.
ta: நீங்கள் இப்போது சோனிக் பை மறுதொடக்கம் செய்ய விரும்புகிறீர்களா? இது தற்போதைய ரன்கள் மற்றும் பதிவுகளை நிறுத்தும்.

# SettingsWidget
source: Restart
ta: மறுதொடக்கம்

# SettingsWidget
source: Dismiss
ta: தள்ளுபடி

# SettingsWidget
source: Audio input change detected.
ta: ஆடியோ உள்ளீட்டு மாற்றம் கண்டறியப்பட்டது.

# SettingsWidget
source: Your changes won't take effect until you restart Sonic Pi.
ta: நீங்கள் சோனிக் பை மறுதொடக்கம் செய்யும் வரை உங்கள் மாற்றங்கள் நடைமுறைக்கு வராது.

# SettingsWidget
source: Would you like to restart now?
ta: இப்போது மறுதொடக்கம் செய்ய விரும்புகிறீர்களா?

# SettingsWidget
source: Use system language
ta: கணினி மொழியைப் பயன்படுத்துங்கள்

# SettingsWidget
source: Toggle the visibility of the audio oscilloscopes.
ta: ஆடியோ அலைக்காட்டிகளின் தெரிவுநிலையை மாற்றவும்.

# SettingsWidget
source: Toggle the visibility of the labels for the audio oscilloscopes
ta: ஆடியோ அலைக்காட்டிகளுக்கான லேபிள்களின் தெரிவுநிலையை மாற்றவும்

# SettingsWidget
source: The audio oscilloscope comes in several flavours which may be viewed independently or all together: Lissajous - illustrates the phase relationship between the left and right channels Mirror Stereo - simple left/right composite wave, with left on top, right on bottom Mono - shows a combined view of the left and right channels (using RMS) Spectrum - shows the sound frequencies as a spectrum, from low to high frequencies Stereo - shows two independent scopes for left and right channels
ta: ஆடியோ அலைக்காட்டி பல சுவைகளில் வருகிறது சுயாதீனமாக அல்லது அனைத்தையும் ஒன்றாகப் பார்க்க வேண்டும்: லிசாசச் - இடது மற்றும் வலது சேனல்களுக்கு இடையிலான கட்ட உறவை விளக்குகிறது மிரர் ச்டீரியோ - எளிய இடது/வலது கலப்பு அலை, இடதுபுறத்தில், வலதுபுறத்தில் மோனோ - இடது மற்றும் வலது சேனல்களின் ஒருங்கிணைந்த பார்வையைக் காட்டுகிறது (ஆர்.எம்.எச் ஐப் பயன்படுத்துதல்) ச்பெக்ட்ரம் - ஒலி அதிர்வெண்களை ஒரு ச்பெக்ட்ரம் எனக் காட்டுகிறது, குறைந்த முதல் உயர் அதிர்வெண்கள் வரை ச்டீரியோ - இடது மற்றும் வலது சேனல்களுக்கு இரண்டு சுயாதீன நோக்கங்களைக் காட்டுகிறது

# SettingsWidget
source: Transparency
ta: வெளிப்படைத்தன்மை

# SettingsWidget
source: Check for updates
ta: புதுப்பிப்புகளை சரிபார்க்கவும்

# SettingsWidget
source: Toggle automatic update checking. This check involves sending anonymous information about your platform and version.
ta: தானியங்கி புதுப்பிப்பு சரிபார்ப்பை மாற்றவும். இந்த காசோலையில் உங்கள் தளம் மற்றும் பதிப்பு பற்றிய அநாமதேய தகவல்களை அனுப்புவது அடங்கும்.

# SettingsWidget
source: Check now
ta: இப்போது சரிபார்க்க

# SettingsWidget
source: Force a check for updates now. This check involves sending anonymous information about your platform and version.
ta: புதுப்பிப்புகளுக்கு இப்போது காசோலையை கட்டாயப்படுத்தவும். இந்த காசோலையில் உங்கள் தளம் மற்றும் பதிப்பு பற்றிய அநாமதேய தகவல்களை அனுப்புவது அடங்கும்.

# SettingsWidget
source: Get update
ta: புதுப்பிப்பைப் பெறுங்கள்

# SettingsWidget
source: Visit http://sonic-pi.net to download new version
ta: புதிய பதிப்பைப் பதிவிறக்க http://sonic-pi.net ஐப் பார்வையிடவும்

# SettingsWidget
source: Update Info
ta: தகவலைப் புதுப்பிக்கவும்

# SettingsWidget
source: Sonic Pi update info
ta: சோனிக் பை புதுப்பிப்பு செய்தி
