Repository: 247i/TACETr
Catalog: உரை/தானி/sonic-pi-qt-sonic-pi-gui-*.po
Languages: ta

# MainWindow
source: Preferences
ta: விருப்பத்தேர்வுகள்

# MainWindow
source: Log
ta: பதிவு

# MainWindow
source: Sonic Pi
ta: சோனிக் பை

# MainWindow
source: Running Code...
ta: குறியீடு இயங்கும் ...

# MainWindow
source: Beautifying...
ta: அழகுபடுத்துதல் ...

# MainWindow
source: Reloading...
ta: மீண்டும் ஏற்றுதல் ...

# MainWindow
source: Enabling Mixer HPF...
ta: மிக்சர் HPF ஐ இயக்குகிறது ...

# MainWindow
source: Disabling Mixer HPF...
ta: மிக்சர் HPF ஐ முடக்குதல் ...

# MainWindow
source: Welcome to Sonic Pi
ta: சோனிக் பைக்கு வருக

# MainWindow
source: Indenting selection...
ta: உள்தள்ளல் தேர்வு ...

# MainWindow
source: Indenting line...
ta: இன்டென்டிங் லைன் ...

# MainWindow
source: Toggle selection comment...
ta: தேர்வு கருத்தை மாற்றவும் ...

# MainWindow
source: Cues
ta: குறிப்புகள்

# MainWindow
source: Full screen mode off.
ta: முழு திரை பயன்முறை முடக்கப்பட்டுள்ளது.

# MainWindow
source: Toggle line comment...
ta: வரி கருத்தை மாற்றவும் ...

# MainWindow
source: Enabling MIDI input...
ta: மிடி உள்ளீட்டை செயல்படுத்துகிறது ...

# MainWindow
source: Disabling MIDI input...
ta: மிடி உள்ளீட்டை முடக்குதல் ...

# MainWindow
source: No connected input devices
ta: இணைக்கப்பட்ட உள்ளீட்டு சாதனங்கள் இல்லை

# MainWindow
source: No connected output devices
ta: இணைக்கப்பட்ட வெளியீட்டு சாதனங்கள் இல்லை

# MainWindow
source: Visit http://sonic-pi.net to download new version
ta: புதிய பதிப்பைப் பதிவிறக்க http://sonic-pi.net ஐப் பார்வையிடவும்

# MainWindow
source: Disabling OSC cue port...
ta: OSC CUE போர்ட்டை முடக்குதல் ...

# MainWindow
source: Enabling external OSC cue port...
ta: வெளிப்புற OSC கியூ போர்ட்டை செயல்படுத்துகிறது ...

# MainWindow
source: Enabling internal OSC cue port...
ta: உள் OSC கியூ போர்ட்டை செயல்படுத்துகிறது ...

# MainWindow
source: Connected MIDI inputs
ta: இணைக்கப்பட்ட மிடி உள்ளீடுகள்

# MainWindow
source: Connected MIDI outputs
ta: இணைக்கப்பட்ட மிடி வெளியீடுகள்

# MainWindow
source: Buffer files
ta: இடையக கோப்புகள்

# MainWindow
source: Link Metronome & Global Time Warp
ta: இணைப்பு மெட்ரோனோம் & உலகளாவிய டைம் வார்ப்

# MainWindow
source: Load Sonic Pi Buffer
ta: சோனிக் பை இடையகத்தை ஏற்றவும்

# MainWindow
source: Text files
ta: உரை கோப்புகள்

# MainWindow
source: Ruby files
ta: ரூபி கோப்புகள்

# MainWindow
source: All files
ta: அனைத்து கோப்புகள்

# MainWindow
source: Log Auto Scroll on...
ta: லாக் ஆட்டோ ச்க்ரோல் ஆன் ...

# MainWindow
source: Log Auto Scroll off...
ta: லாக் ஆட்டோ ச்க்ரோல் ஆஃப் ...

# MainWindow
source: Run the code in the current buffer
ta: தற்போதைய இடையகத்தில் குறியீட்டை இயக்கவும்

# MainWindow
source: Load
ta: சுமை

# MainWindow
source: Load an external file in the current buffer
ta: தற்போதைய இடையகத்தில் வெளிப்புற கோப்பை ஏற்றவும்

# MainWindow
source: Indent Code Buffer
ta: குறியீடு இடையகத்தை உள்தள்ளுங்கள்

# MainWindow
source: Code Size Up
ta: குறியீடு அளவு மேலே

# MainWindow
source: Code Size Down
ta: குறியீடு அளவு கீழே

# MainWindow
source: Show Scopes
ta: ச்கோப்களைக் காட்டு

# MainWindow
source: Show Info
ta: தகவலைக் காட்டு

# MainWindow
source: Wavefile (*.wav)
ta: அலைவரிசை (*.wav)

# MainWindow
source: Resetting MIDI...
ta: மிடியை மீட்டமைத்தல் ...

# MainWindow
source: MIDI is disabled...
ta: மிடி முடக்கப்பட்டுள்ளது ...

# MainWindow
source: Welcome back. Now get your live code on...
ta: மீண்டும் வருக. இப்போது உங்கள் நேரடி குறியீட்டைப் பெறுங்கள் ...

# MainWindow
source: Save Current Buffer
ta: தற்போதைய இடையகத்தை சேமிக்கவும்

# MainWindow
source: Scope
ta: நோக்கம்

# MainWindow
source: Playing Sample...
ta: மாதிரி விளையாடுவது ...

# MainWindow
source: Hiding pane titles...
ta: பலக தலைப்புகளை மறைத்தல் ...

# MainWindow
source: Showing pane titles...
ta: பலக தலைப்புகளைக் காட்டுகிறது ...

# MainWindow
source: Audio Inputs Enabled. Restart Sonic Pi for this setting to take effect...
ta: ஆடியோ உள்ளீடுகள் இயக்கப்பட்டன. இந்த அமைப்பு நடைமுறைக்கு வர சோனிக் பை மறுதொடக்கம் ...

# MainWindow
source: Audio Inputs Disabled. Restart Sonic Pi for this setting to take effect...
ta: ஆடியோ உள்ளீடுகள் முடக்கப்பட்டன. இந்த அமைப்பு நடைமுறைக்கு வர சோனிக் பை மறுதொடக்கம் ...

# MainWindow
source: Sonic Pi Boot Error
ta: சோனிக் பை துவக்க பிழை

# MainWindow
source: Zooming In...
ta: பெரிதாக்குதல் ...

# MainWindow
source: Zooming Out...
ta: பெரிதாக்குதல் ...

# MainWindow
source: Checking for updates...
ta: புதுப்பிப்புகளைச் சரிபார்க்கிறது ...

# MainWindow
source: Enabling update checking...
ta: புதுப்பிப்பு சரிபார்ப்பை செயல்படுத்துகிறது ...

# MainWindow
source: Disabling update checking...
ta: புதுப்பிப்பு சரிபார்ப்பை முடக்குதல் ...

# MainWindow
source: Enabling Mixer LPF...
ta: மிக்சர் எல்பிஎஃப் இயக்குகிறது ...

# MainWindow
source: Disabling Mixer LPF...
ta: மிக்சர் எல்பிஎஃப் முடக்குதல் ...

# MainWindow
source: Enabling Inverted Stereo...
ta: தலைகீழ் ச்டீரியோவை இயக்குகிறது ...

# MainWindow
source: Enabling Standard Stereo...
ta: நிலையான ச்டீரியோவை இயக்குகிறது ...

# MainWindow
source: Mono Mode...
ta: மோனோ பயன்முறை ...

# MainWindow
source: Stereo Mode...
ta: ச்டீரியோ பயன்முறை ...

# MainWindow
source: Stopping...
ta: நிறுத்துதல் ...

# MainWindow
source: Hiding about window...
ta: சாளரத்தைப் பற்றி மறைந்திருக்கும் ...

# MainWindow
source: Showing about window...
ta: சாளரத்தைப் பற்றி காட்டுகிறது ...

# MainWindow
source: Hiding help...
ta: உதவியை மறைக்கிறது ...

# MainWindow
source: Showing help...
ta: உதவியைக் காட்டுகிறது ...

# MainWindow
source: Updating System Volume...
ta: கணினி அளவைப் புதுப்பித்தல் ...

# MainWindow
source: Colour Theme:
ta: வண்ண தீம்:

# MainWindow
source: Show autocompletion on
ta: தன்னியக்கவியல் காட்டு

# MainWindow
source: Show autocompletion off
ta: தன்னியக்கவியல் காட்டுங்கள்

# MainWindow
source: Show context on
ta: சூழலைக் காட்டு

# MainWindow
source: Show context off
ta: சூழலைக் காட்டு

# MainWindow
source: Hiding preferences...
ta: விருப்பங்களை மறைக்கும் ...

# MainWindow
source: Showing preferences...
ta: விருப்பங்களைக் காட்டுகிறது ...

# MainWindow
source: Exit
ta: வெளியேறு

# MainWindow
source: Start recording to a WAV audio file
ta: WAV ஆடியோ கோப்பில் பதிவு செய்யத் தொடங்குங்கள்

# MainWindow
source: Save
ta: சேமி

# MainWindow
source: Save current buffer as an external file
ta: தற்போதைய இடையகத்தை வெளிப்புற கோப்பாக சேமிக்கவும்

# MainWindow
source: Toggle information about Sonic Pi
ta: சோனிக் பை பற்றிய தகவல்களை மாற்றவும்

# MainWindow
source: Show Help
ta: உதவியைக் காட்டு

# MainWindow
source: Toggle the visibility of the help pane
ta: உதவி பலகத்தின் தெரிவுநிலையை மாற்றவும்

# MainWindow
source: Show Preferences
ta: விருப்பங்களைக் காட்டு

# MainWindow
source: Toggle the visibility of the preferences pane
ta: விருப்பத்தேர்வுகள் பலகத்தின் தெரிவுநிலையை மாற்றவும்

# MainWindow
source: Show Line Numbers
ta: வரி எண்களைக் காட்டு

# MainWindow
source: Show Code Completion
ta: குறியீடு நிறைவைக் காட்டு

# MainWindow
source: Show Code Context
ta: குறியீடு சூழலைக் காட்டு

# MainWindow
source: Enable Audio Inputs
ta: ஆடியோ உள்ளீடுகளை இயக்கவும்

# MainWindow
source: Link Connect
ta: இணைப்பு இணைப்பு

# MainWindow
source: Connect or disconnect the Link Metronome from the network
ta: பிணையத்திலிருந்து இணைப்பு மெட்ரோனோம் இணைக்கவும் அல்லது துண்டிக்கவும்

# MainWindow
source: Tap Tempo
ta: இழப்பு டெம்போ

# MainWindow
source: Click Link Tap Tempo
ta: இணைப்பு தட்டு டெம்போ என்பதைக் சொடுக்கு செய்க

# MainWindow
source: Safe Audio Mode
ta: பாதுகாப்பான ஆடியோ பயன்முறை

# MainWindow
source: Enforce Timing Guarantees
ta: நேர உத்தரவாதங்களை செயல்படுத்தவும்

# MainWindow
source: Enable External Synths
ta: வெளிப்புற சின்த்சை இயக்கவும்

# MainWindow
source: Invert Stereo
ta: தலைகீழ் ச்டீரியோ

# MainWindow
source: Force Mono
ta: மோனோவை கட்டாயப்படுத்துங்கள்

# MainWindow
source: Enable Incoming MIDI Cues
ta: உள்வரும் மிடி குறிப்புகளை இயக்கவும்

# MainWindow
source: Allow Incoming OSC
ta: உள்வரும் OSC ஐ அனுமதிக்கவும்

# MainWindow
source: Allow OSC From Other Computers
ta: மற்ற கணினிகளிலிருந்து OSC ஐ அனுமதிக்கவும்

# MainWindow
source: Log Cues
ta: பதிவு குறிப்புகள்

# MainWindow
source: Log Synths
ta: பதிவு சின்த்ச்

# MainWindow
source: Clear Logs on Run
ta: இயக்கத்தில் பதிவுகளை அழிக்கவும்

# MainWindow
source: Auto-Scroll Log
ta: ஆட்டோ-ச்க்ரோல் பதிவு

# MainWindow
source: Live
ta: வாழ

# MainWindow
source: Code
ta: குறியீடு

# MainWindow
source: Audio
ta: ஆடியோ

# MainWindow
source: Visuals
ta: காட்சிகள்

# MainWindow
source: Light
ta: ஒளி

# MainWindow
source: Dark
ta: இருண்ட

# MainWindow
source: Pro Light
ta: சார்பு ஒளி

# MainWindow
source: Pro Dark
ta: இருண்ட சார்பு

# MainWindow
source: High Contrast
ta: உயர் வேறுபாடு

# MainWindow
source: Show Scope Labels
ta: நோக்கம் லேபிள்களைக் காட்டு

# MainWindow
source: Show Titles
ta: தலைப்புகளைக் காட்டு

# MainWindow
source: Hide Menu Bar in Fullscreen Mode
ta: முழுத்திரை பயன்முறையில் பட்டியல் பட்டியை மறைக்கவும்

# MainWindow
source: Colour Theme
ta: வண்ண கருப்பொருள்

# MainWindow
source: Show Scope Kinds
ta: நோக்கம் வகைகளைக் காட்டு

# MainWindow
source: MIDI Inputs
ta: மிடி உள்ளீடுகள்

# MainWindow
source: No Connected Inputs
ta: இணைக்கப்பட்ட உள்ளீடுகள் இல்லை

# MainWindow
source: MIDI Outputs
ta: மிடி வெளியீடுகள்

# MainWindow
source: No Connected Outputs
ta: இணைக்கப்பட்ட வெளியீடுகள் இல்லை

# MainWindow
source: Default MIDI Out Channel
ta: இயல்புநிலை மிடி அவுட் சேனல்

# MainWindow
source: All Channels
ta: அனைத்து சேனல்களும்

# MainWindow
source: Local IP Addresses
ta: உள்ளக ஐபி முகவரிகள்

# MainWindow
source: Incoming OSC Port
ta: உள்வரும் OSC துறைமுகம்

# MainWindow
source: View
ta: பார்வை

# MainWindow
source: Focus Editor
ta: கவனம் ஆசிரியர்

# MainWindow
source: Place focus on the code editor
ta: குறியீடு எடிட்டரில் கவனம் செலுத்துங்கள்

# MainWindow
source: Focus Logs
ta: பதிவுகள் கவனம் செலுத்துங்கள்

# MainWindow
source: Focus Context
ta: கவனம் சூழல்

# MainWindow
source: Place focus on the context pane
ta: சூழல் பலகத்தில் கவனம் செலுத்துங்கள்

# MainWindow
source: Focus Cues
ta: கவனம் குறிப்புகள்

# MainWindow
source: Place focus on the cue event pane
ta: கியூ நிகழ்வு பலகத்தில் கவனம் செலுத்துங்கள்

# MainWindow
source: Focus Preferences
ta: விருப்பங்களை மையப்படுத்தவும்

# MainWindow
source: Place focus on preferences
ta: விருப்பங்களில் கவனம் செலுத்துங்கள்

# MainWindow
source: Focus Help Listing
ta: உதவி பட்டியலில் கவனம் செலுத்துங்கள்

# MainWindow
source: Place focus on help listing
ta: உதவி பட்டியலில் கவனம் செலுத்துங்கள்

# MainWindow
source: Focus Help Details
ta: உதவி விவரங்களை மையப்படுத்தவும்

# MainWindow
source: Place focus on help details
ta: உதவி விவரங்களில் கவனம் செலுத்துங்கள்

# MainWindow
source: Focus Errors
ta: பிழைகள் கவனம் செலுத்துங்கள்

# MainWindow
source: Place focus on errors
ta: பிழைகளில் கவனம் செலுத்துங்கள்

# MainWindow
source: Focus BPM Scrubber
ta: பிபிஎம் ச்க்ரப்பர் கவனம் செலுத்துங்கள்

# MainWindow
source: Place focus on BPM Scrubber
ta: பிபிஎம் ச்க்ரப்பரில் கவனம் செலுத்துங்கள்

# MainWindow
source: Focus TimeWarp Scrubber
ta: டைம்வார்ப் ச்க்ரப்பர் கவனம் செலுத்துங்கள்

# MainWindow
source: Place focus on TimeWarp Scrubber
ta: இடுப்புப் ச்க்ரப்பரில் கவனம் செலுத்துங்கள்

# MainWindow
source: Apologies, unable to start...
ta: மன்னிப்பு, தொடங்க முடியவில்லை ...

# MainWindow
source: Sorry, Sonic Pi is having issues booting:
ta: மன்னிக்கவும், சோனிக் பை துவக்க சிக்கல்களைக் கொண்டுள்ளது:

# MainWindow
source: Auto Indent mode enabled
ta: ஆட்டோ இன்டென்ட் பயன்முறை இயக்கப்பட்டது

# MainWindow
source: Auto Indent mode disabled
ta: ஆட்டோ இன்டென்ட் பயன்முறை முடக்கப்பட்டுள்ளது

# MainWindow
source: Comment/Uncomment code
ta: கருத்து/அசைவற்ற குறியீடு

# MainWindow
source: Transpose Characters
ta: எழுத்துக்கள்

# MainWindow
source: Shift Line or Selection Up
ta: சிப்ட் லைன் அல்லது தேர்வு

# MainWindow
source: Shift Line or Selection Down
ta: சிப்ட் லைன் அல்லது தேர்வு கீழே

# MainWindow
source: Move Cursor Down
ta: கர்சரை கீழே நகர்த்தவும்

# MainWindow
source: Move Cursor Up
ta: கர்சரை மேலே நகர்த்தவும்

# MainWindow
source: Move Cursor Down 10 Lines
ta: கர்சரை 10 வரிகளில் நகர்த்தவும்

# MainWindow
source: Move Cursor Up 10 Lines
ta: கர்சரை 10 வரிகளை நகர்த்தவும்

# MainWindow
source: Cut to the end of the line
ta: வரியின் முடிவில் வெட்டு

# MainWindow
source: Copy the current selection
ta: தற்போதைய தேர்வை நகலெடு

# MainWindow
source: Cut the current selection
ta: தற்போதைய தேர்வை வெட்டுங்கள்

# MainWindow
source: Paste the current selection
ta: தற்போதைய தேர்வை ஒட்டவும்

# MainWindow
source: Move Cursor Right
ta: கர்சரை வலது நகர்த்தவும்

# MainWindow
source: Move Cursor Left
ta: கர்சரை நகர்த்தவும்

# MainWindow
source: Delete Right
ta: வலதுபுறம் நீக்கு

# MainWindow
source: Delete Left
ta: இடது நீக்கு

# MainWindow
source: Move Cursor to Start of Line
ta: கர்சரை வரியின் தொடக்கத்திற்கு நகர்த்தவும்

# MainWindow
source: Move Cursor to End of Line
ta: கர்சரை வரியின் முடிவுக்கு நகர்த்தவும்

# MainWindow
source: Move Cursor to Start of Document
ta: ஆவணத்தைத் தொடங்க கர்சரை நகர்த்தவும்

# MainWindow
source: Move Cursor to End of Document
ta: ஆவணத்தின் முடிவுக்கு கர்சரை நகர்த்தவும்

# MainWindow
source: Move Cursor Right by Word
ta: கர்சரை வார்த்தையால் நகர்த்தவும்

# MainWindow
source: Move Cursor Left by Word
ta: வார்த்தையால் விடப்பட்ட கர்சரை நகர்த்தவும்

# MainWindow
source: Vertially center the caret in the editor
ta: எடிட்டரில் பராமரிப்பை செங்குத்தாக மையப்படுத்தவும்

# MainWindow
source: Undo the last action
ta: கடைசி நடவடிக்கையை செயல்தவிர்

# MainWindow
source: Redo the last undo
ta: கடைசியாக செயல்தவிர்க்கவும்

# MainWindow
source: Select all text
ta: எல்லா உரையையும் தேர்ந்தெடுக்கவும்

# MainWindow
source: Delete word to the right
ta: வார்த்தையை வலதுபுறமாக நீக்கு

# MainWindow
source: Delete word to the left
ta: இடதுபுறத்தில் வார்த்தையை நீக்கு

# MainWindow
source: Uppercase word or selection
ta: பெரிய சொல் அல்லது தேர்வு

# MainWindow
source: Lowercase word or selection
ta: சிறிய சொல் அல்லது தேர்வு

# MainWindow
source: Set a mark in the text
ta: உரையில் ஒரு அடையாளத்தை அமைக்கவும்

# MainWindow
source: Look up documentation for the current word
ta: தற்போதைய வார்த்தைக்கான ஆவணங்களைப் பாருங்கள்

# MainWindow
source: Cycle through the available colour themes
ta: கிடைக்கக்கூடிய வண்ண கருப்பொருள்கள் மூலம் சுழற்சி

# MainWindow
source: Switch to the previous tab
ta: முந்தைய தாவலுக்கு மாறவும்

# MainWindow
source: Switch to the next tab
ta: அடுத்த தாவலுக்கு மாறவும்

# MainWindow
source: Switch to tab 1
ta: தாவல் 1 க்கு மாறவும்

# MainWindow
source: Switch to tab 2
ta: தாவல் 2 க்கு மாறவும்

# MainWindow
source: Switch to tab 3
ta: தாவல் 3 க்கு மாறவும்

# MainWindow
source: Switch to tab 4
ta: தாவல் 4 க்கு மாறவும்

# MainWindow
source: Switch to tab 5
ta: தாவல் 5 க்கு மாறவும்

# MainWindow
source: Switch to tab 6
ta: தாவல் 6 க்கு மாறவும்

# MainWindow
source: Switch to tab 7
ta: தாவல் 7 க்கு மாறவும்

# MainWindow
source: Switch to tab 8
ta: தாவல் 8 க்கு மாறவும்

# MainWindow
source: Switch to tab 9
ta: தாவல் 9 க்கு மாறவும்

# MainWindow
source: Switch to tab 0
ta: தாவல் 0 க்கு மாறவும்

# MainWindow
source: Place focus on the logs
ta: பதிவுகளில் கவனம் செலுத்துங்கள்

# MainWindow
source: Show or hide the buttons
ta: பொத்தான்களைக் காட்டவும் அல்லது மறைக்கவும்

# MainWindow
source: Show or hide the cue log
ta: கியூ பதிவைக் காட்டவும் அல்லது மறைக்கவும்

# MainWindow
source: Show or hide the log
ta: பதிவைக் காட்டுங்கள் அல்லது மறைக்கவும்

# MainWindow
source: Zoom in the log
ta: பதிவில் பெரிதாக்கவும்

# MainWindow
source: Zoom out the log
ta: பதிவை பெரிதாக்கவும்

# MainWindow
source: Toggle fullscreen mode
ta: முழுத்திரை பயன்முறையை மாற்றவும்

# MainWindow
source: Move Line or Selection Up
ta: வரி அல்லது தேர்வை நகர்த்தவும்

# MainWindow
source: Move Line or Selection Down
ta: வரி அல்லது தேர்வை கீழே நகர்த்தவும்

# MainWindow
source: Move Down One Line
ta: ஒரு வரியில் கீழே நகர்த்தவும்

# MainWindow
source: Move Up One Line
ta: ஒரு வரியை நகர்த்தவும்

# MainWindow
source: Move Down Ten Lines
ta: பத்து வரிகளை நகர்த்தவும்

# MainWindow
source: Move Up Ten Lines
ta: பத்து வரிகளை நகர்த்தவும்

# MainWindow
source: Cut to End of Line
ta: கோட்டின் முடிவுக்கு வெட்டு

# MainWindow
source: Copy
ta: நகலெடு

# MainWindow
source: Cut
ta: வெட்டு

# MainWindow
source: Paste
ta: ஒட்டு

# MainWindow
source: Move Right
ta: வலதுபுறம் நகர்த்தவும்

# MainWindow
source: Move Left
ta: இடதுபுறம் நகர்த்தவும்

# MainWindow
source: Delete Forward
ta: முன்னோக்கி நீக்கு

# MainWindow
source: Delete Back
ta: மீண்டும் நீக்கு

# MainWindow
source: Move to Start of Line
ta: வரியின் தொடக்கத்திற்கு நகர்த்தவும்

# MainWindow
source: Move to End of Line
ta: வரியின் முடிவுக்கு நகர்த்தவும்

# MainWindow
source: Move to Start of Document
ta: ஆவணத்தின் தொடக்கத்திற்கு நகர்த்தவும்

# MainWindow
source: Move to End of Document
ta: ஆவணத்தின் முடிவுக்கு செல்லுங்கள்

# MainWindow
source: Move Right One Word
ta: ஒரு வார்த்தையை வலதுபுறம் நகர்த்தவும்

# MainWindow
source: Move Left One Word
ta: இடதுபுறம் ஒரு வார்த்தையை நகர்த்தவும்

# MainWindow
source: Center Cursor Vertically
ta: சென்டர் கர்சர் செங்குத்தாக

# MainWindow
source: Undo
ta: செயல்தவிர்

# MainWindow
source: Redo
ta: மீண்டும்செய்

# MainWindow
source: Select All
ta: அனைத்தையும் தெரிவுசெய்

# MainWindow
source: Delete Word Left
ta: எஞ்சிய வார்த்தையை நீக்கு

# MainWindow
source: Delete Word Right
ta: வார்த்தையை சரியாக நீக்கு

# MainWindow
source: Upcase Word or Selection
ta: சொல் அல்லது தேர்வு

# MainWindow
source: Downcase Word or Selection
ta: கீழ்நிலை சொல் அல்லது தேர்வு

# MainWindow
source: Show Docs for Current Word
ta: தற்போதைய வார்த்தைக்கு டாக்சைக் காட்டு

# MainWindow
source: Cycle Themes
ta: சுழற்சி கருப்பொருள்கள்

# MainWindow
source: Previous Tab
ta: முந்தைய தாவல்

# MainWindow
source: Next Tab
ta: அடுத்த தாவல்

# MainWindow
source: Focus Tab 1
ta: கவனம் தாவல் 1

# MainWindow
source: Focus Tab 2
ta: கவனம் தாவல் 2

# MainWindow
source: Focus Tab 3
ta: கவனம் தாவல் 3

# MainWindow
source: Focus Tab 4
ta: கவனம் தாவல் 4

# MainWindow
source: Focus Tab 5
ta: கவனம் தாவல் 5

# MainWindow
source: Focus Tab 6
ta: கவனம் தாவல் 6

# MainWindow
source: Focus Tab 7
ta: கவனம் தாவல் 7

# MainWindow
source: Focus Tab 8
ta: கவனம் தாவல் 8

# MainWindow
source: Focus Tab 9
ta: கவனம் தாவல் 9

# MainWindow
source: Focus Tab 0
ta: கவனம் தாவல் 0

# MainWindow
source: Auto Indent Code Buffer
ta: ஆட்டோ இன்டென்ட் கோட் பஃபர்

# MainWindow
source: Set Mark
ta: மார்க் செட்

# MainWindow
source: Emacs Live Shortcut Mode
ta: EMAC கள் குறுக்குவழி பயன்முறையை வாழ்கின்றன

# MainWindow
source: Windows Shortcut Mode
ta: சாளரங்கள் குறுக்குவழி பயன்முறை

# MainWindow
source: Mac Shortcut Mode
ta: MAC குறுக்குவழி பயன்முறை

# MainWindow
source: User Shortcut Mode
ta: பயனர் குறுக்குவழி பயன்முறை

# MainWindow
source: Shortcut Mode
ta: குறுக்குவழி பயன்முறை

# MainWindow
source: Show Log
ta: பதிவைக் காட்டு

# MainWindow
source: Show Cue Log
ta: கியூ பதிவைக் காட்டு

# MainWindow
source: Show Metronome
ta: மெட்ரோனோம் காட்டு

# MainWindow
source: Show Buttons
ta: பொத்தான்களைக் காட்டு

# MainWindow
source: Show Tabs
ta: தாவல்களைக் காட்டு

# MainWindow
source: Full Screen Mode
ta: முழு திரை பயன்முறை

# MainWindow
source: Zoom In Logs
ta: பதிவுகளில் பெரிதாக்கவும்

# MainWindow
source: Zoom Out Logs
ta: பதிவுகளை பெரிதாக்கவும்

# MainWindow
source: Focus
ta: குவி

# MainWindow
source: Language
ta: மொழி

# MainWindow
source: Ready...
ta: ஆயத்தம் ...

# MainWindow
source: File loaded...
ta: கோப்பு ஏற்றப்பட்டது ...

# MainWindow
source: File saved...
ta: கோப்பு சேமிக்கப்பட்டது ...

# MainWindow
source: Restarting Sonic Pi...
ta: சோனிக் பை மறுதொடக்கம் ...

# MainWindow
source: Last checked %1
ta: கடைசியாக சரிபார்க்கப்பட்ட %1

# MainWindow
source: Sonic Pi checks for updates every two weeks.
ta: புதுப்பிப்புகளுக்கு சோனிக் பிஐ சரிபார்க்கிறது ஒவ்வொரு இரண்டு வாரங்களுக்கும்.

# MainWindow
source: This is Sonic Pi %1
ta: இது சோனிக் பை %1

# MainWindow
source: Version %2 is now available!
ta: பதிப்பு %2 இப்போது கிடைக்கிறது!

# MainWindow
source: New version available! Get Sonic Pi %1
ta: புதிய பதிப்பு கிடைக்கிறது! சோனிக் பை %1 ஐப் பெறுங்கள்

# MainWindow
source: Line: %1, Position: %2
ta: வரி: %1, நிலை: %2

# MainWindow
source: Sonic Pi - Audio Server Boot Error
ta: சோனிக் பை - ஆடியோ சேவையக துவக்க பிழை

# MainWindow
source: Sorry, the Audio Server failed to start...
ta: மன்னிக்கவும், ஆடியோ சேவையகம் தொடங்கத் தவறிவிட்டது ...

# MainWindow
source: Please try changing your default OS audio input & outputs.
ta: உங்கள் இயல்புநிலை OS ஆடியோ உள்ளீடு மற்றும் வெளியீடுகளை மாற்ற முயற்சிக்கவும்.

# MainWindow
source: Note, the audio rate of the inputs & outputs must be the same.
ta: குறிப்பு, உள்ளீடுகள் மற்றும் வெளியீடுகளின் ஆடியோ வீதம் ஒரே மாதிரியாக இருக்க வேண்டும்.

# MainWindow
source: For the curious among you, Sonic Pi uses the SuperCollider Audio Server to generate its sounds. By default it will connect to your default system audio input and outputs.
ta: உங்களிடையே ஆர்வமுள்ளவர்களுக்கு, சோனிக் பிஐ அதன் ஒலிகளை உருவாக்க சூப்பர் கோலைடர் ஆடியோ சேவையகத்தைப் பயன்படுத்துகிறது. இயல்பாக இது உங்கள் இயல்புநிலை கணினி ஆடியோ உள்ளீடு மற்றும் வெளியீடுகளுடன் இணைக்கும்.

# MainWindow
source: Unfortunately SuperCollider is having problems starting correctly. You can read the full error log below which should explain why.
ta: துரதிர்ச்டவசமாக சூப்பர் கோலைடர் சரியாகத் தொடங்கும் சிக்கல்களைக் கொண்டுள்ளது. கீழே உள்ள முழு பிழை பதிவையும் நீங்கள் படிக்கலாம், அது ஏன் என்பதை விளக்க வேண்டும்.

# MainWindow
source: To fix this you can try changing your default operating system audio inputs and outputs (ensuring they have the same audio rate).
ta: இதை சரிசெய்ய உங்கள் இயல்புநிலை இயக்க முறைமை ஆடியோ உள்ளீடுகள் மற்றும் வெளியீடுகளை மாற்ற முயற்சி செய்யலாம் (அவை ஒரே ஆடியோ வீதத்தைக் கொண்டுள்ளன என்பதை உறுதி செய்கிறது).

# MainWindow
source: Advanced Users
ta: மேம்பட்ட பயனர்கள்

# MainWindow
source: you may manually override this and further configure how SuperCollider boots by editing the file:
ta: நீங்கள் இதை கைமுறையாக மேலெழுதலாம், மேலும் கோப்பைத் திருத்துவதன் மூலம் சூப்பர் கோலைடர் எவ்வாறு துவங்குகிறது என்பதை மேலும் கட்டமைக்கலாம்:

# MainWindow
source: SuperCollider Log
ta: சூப்பர் கோலைடர் பதிவு

# MainWindow
source: Sonic Pi - Unable to Write to Home Directory
ta: சோனிக் பை - வீட்டு கோப்பகத்திற்கு எழுத முடியவில்லை

# MainWindow
source: Boot Error - Home Dir not writable:
ta: துவக்க பிழை - ஓம் டிர் எழுதவில்லை:

# MainWindow
source: Quick Fix: set the environment variable SONIC_PI_HOME to a directory you have permission to write to.
ta: விரைவான பிழைத்திருத்தம்: சுற்றுச்சூழல் மாறியை Sonic_pi_home ஐ நீங்கள் எழுத இசைவு உள்ள ஒரு கோப்பகத்திற்கு அமைக்கவும்.

# MainWindow
source: For the curious among you, Sonic Pi automatically stores the contents of the code buffers, configuration files and logs in a folder called .sonic-pi which typically resides in your home directory.
ta: உங்களிடையே ஆர்வமுள்ளவர்களுக்கு, சோனிக் பிஐ தானாகவே குறியீடு இடையகங்கள், உள்ளமைவு கோப்புகள் மற்றும் பதிவுகள் ஆகியவற்றின் உள்ளடக்கங்களை .சோனிக்-பிஐ எனப்படும் கோப்புறையில் சேமிக்கிறது.

# MainWindow
source: Unfortunately you don't appear to have permission to write to your home directory:
ta: துரதிர்ச்டவசமாக உங்கள் வீட்டு கோப்பகத்திற்கு எழுத உங்களுக்கு இசைவு இருப்பதாகத் தெரியவில்லை:

# MainWindow
source: To fix this you can set the environment variable SONIC_PI_HOME to any directory you have write access to and Sonic Pi will place its .sonic-pi directory within that.
ta: இதை சரிசெய்ய நீங்கள் சுற்றுச்சூழல் மாறி சோனிக்_பிஐ_ஓம் நீங்கள் எழுதும் அணுகல் உள்ள எந்த கோப்பகத்திற்கும் அமைக்கலாம், மேலும் சோனிக் பை அதன் .சோனிக்-பிஐ கோப்பகத்தை அதற்குள் வைக்கும்.

# MainWindow
source: Boot Error - SONIC_PI_HOME not writable:
ta: துவக்க பிழை - sonic_pi_home எழுதக்கூடியது அல்ல:

# MainWindow
source: Unfortunately it appears you have set the SONIC_PI_HOME environment variable to a directory you don't have permission to write to:
ta: துரதிர்ச்டவசமாக நீங்கள் சோனிக்_பிஐ_ஓம் சூழல் மாறியை ஒரு கோப்பகத்திற்கு அமைத்துள்ளீர்கள் என்று தோன்றுகிறது.

# MainWindow
source: Run
ta: ஓடு

# MainWindow
source: Stop
ta: நிறுத்து

# MainWindow
source: Stop all running code
ta: இயங்கும் அனைத்து குறியீட்டையும் நிறுத்துங்கள்

# MainWindow
source: Help
ta: உதவி
