Repository: 247i/TACETr
Catalog: உரை/தானி/soundux-website-*.po
Languages: ta

# index.tagline
source: A cross-platform soundboard
ta: ஒரு குறுக்கு-தளம் சவுண்ட்போர்டு

# index.download
source: Download
ta: பதிவிறக்கம்

# index.universalArchitecture
source: It has a universal architecture and therefore works with a variety of applications
ta: இது ஒரு உலகளாவிய கட்டமைப்பைக் கொண்டுள்ளது, எனவே பலவிதமான பயன்பாடுகளுடன் செயல்படுகிறது

# index.andManyMore
source: And many more
ta: மேலும் பல

# index.seeAllFeatures
source: See all features
ta: அனைத்து அம்சங்களையும் காண்க

# index.screenshots
source: Screenshots
ta: திரைக்காட்சிகள்

# index.nativeSupportFor
source: Native support for
ta: சொந்த உதவி

# input.ctrl
source: CTRL
ta: கட்டுப்பாடு

# screenshots.hint
source: Here you can see screenshots of the current version
ta: தற்போதைய பதிப்பின் திரை சாட்களை இங்கே காணலாம்

# features.title
source: Features
ta: நற்பொருத்தங்கள்

# features.clickToShowAdditionalInformation
source: Click on the different features to reveal additional information about them
ta: அவற்றைப் பற்றிய கூடுதல் தகவல்களை வெளிப்படுத்த வெவ்வேறு அம்சங்களைக் சொடுக்கு செய்க

# features.darkAndLightTheme.title
source: Dark and light theme
ta: இருண்ட மற்றும் ஒளி கருப்பொருள்

# features.darkAndLightTheme.description
source: Pick your poison
ta: உங்கள் விசத்தைத் தேர்ந்தெடுங்கள்

# features.folderTabs.title
source: Folder tabs
ta: கோப்புறை தாவல்கள்

# features.folderTabs.description
source: You don't have to add single sounds. Just put them in a folder 📂 and add it as a tab. It will automatically populate with all the supported audio formats 🎧
ta: நீங்கள் ஒற்றை ஒலிகளைச் சேர்க்க வேண்டியதில்லை. அவற்றை ஒரு கோப்புறையில் வைத்து அதை ஒரு தாவலாக சேர்க்கவும். இது அனைத்து ஆதரிக்கப்பட்ட ஆடியோ வடிவங்களுடனும் தானாகவே விரிவடையும்

# features.mediaControls.title
source: Media controls
ta: ஊடக கட்டுப்பாடுகள்

# features.mediaControls.description
source: We have individual media controls for each playing sound. You can play/pause ⏯, seek 🔼, repeat 🔂 or stop ⏹ them.
ta: ஒவ்வொரு விளையாடும் ஒலிக்கும் தனிப்பட்ட ஊடக கட்டுப்பாடுகள் எங்களிடம் உள்ளன. நீங்கள் விளையாடலாம்/இடைநிறுத்தலாம் ⏯, தேடலாம் 🔼, மீண்டும் 🔂 அல்லது நிறுத்துங்கள்.

# features.audioFormats.title
source: Supports a variety of audio formats
ta: பலவிதமான ஆடியோ வடிவங்களை ஆதரிக்கிறது

# features.audioFormats.description
source: As we make use of {miniaudio} we support common audio formats like mp3, wav, flac
ta: {மினியுடியோ fey ஐப் பயன்படுத்துவதால், எம்பி 3, வாவ், ஃப்ளாக் போன்ற பொதுவான ஆடியோ வடிவங்களை நாங்கள் ஆதரிக்கிறோம்

# features.soundSearch.title
source: Sound search
ta: ஒலி தேடல்

# features.soundSearch.description
source: A global search for all tabs
ta: அனைத்து தாவல்களுக்கான உலகளாவிய தேடல்

# features.soundSearch.description2
source: Can also be opened with {ctrl} + {f}
ta: {ctrl} + {f} உடன் திறக்கலாம்

# features.emulatedLaunchpad.title
source: Emulated Launchpad mode
ta: பின்பற்றப்பட்ட லாஞ்ச்பேட் பயன்முறை

# features.emulatedLaunchpad.description
source: An emulated launchpad on your keyboard
ta: உங்கள் விசைப்பலகையில் ஒரு பின்பற்றப்பட்ட லாஞ்ச்பேட்

# features.emulatedLaunchpad.description2
source: Press the corresponding key seen in the top right to play a sound
ta: ஒலியை இயக்க மேல் வலதுபுறத்தில் காணப்பட்ட தொடர்புடைய விசையை அழுத்தவும்

# features.emulatedLaunchpad.description3
source: Navigate pages with your arrow keys
ta: உங்கள் அம்பு விசைகளுடன் பக்கங்களுக்கு செல்லவும்

# features.globalHotkeys.title
source: Global hotkeys
ta: உலகளாவிய ஆட்கீச்

# features.globalHotkeys.description
source: You can set hotkeys for each sound and to stop all sounds. There is also an option to only trigger hotkeys from the currently selected tab
ta: ஒவ்வொரு ஒலிக்கும் நீங்கள் ஆட்கீசை அமைக்கலாம் மற்றும் எல்லா ஒலிகளையும் நிறுத்தலாம். தற்போது தேர்ந்தெடுக்கப்பட்ட தாவலில் இருந்து ஆட்கீசை மட்டுமே தூண்டுவதற்கான விருப்பமும் உள்ளது

# features.passThrough.title
source: Application pass-through
ta: விண்ணப்பம் பாச்-த்ரூ

# features.passThrough.description
source: Application pass-through allows you to redirect any application's sound to another. You can use it as a workaround for Discord's share audio feature
ta: பயன்பாட்டு பாச்-த்ரூ எந்தவொரு பயன்பாட்டின் ஒலியையும் இன்னொருவருக்கு திருப்பிவிட உங்களை அனுமதிக்கிறது. டிச்கார்ட்டின் பகிர்வு ஆடியோ அம்சத்திற்கான பணித்தொகுப்பாக நீங்கள் இதைப் பயன்படுத்தலாம்

# features.passThrough.description2
source: Can also be opened with {ctrl} + {g}
ta: {ctrl} + {g with உடன் திறக்கலாம்

# download.downloadNow
source: Download Soundux now
ta: சவுண்டக்ச் இப்போது பதிவிறக்கவும்

# download.failedToFetch
source: Failed to fetch information from GitHub
ta: கிட்அப்பிலிருந்து தகவல்களைப் பெறத் தவறிவிட்டது

# download.visitOurGitHub
source: Visit our GitHub page
ta: எங்கள் அறிவிலிமையம் பக்கத்தைப் பார்வையிடவும்

# download.latestVersion
source: Latest version
ta: அண்மைக் கால பதிப்பு

# download.released
source: Released
ta: வெளியிடப்பட்டது

# download.notSupported
source: Soundux is currently not supported on your operating system
ta: உங்கள் இயக்க முறைமையில் சவுண்டக்ச் தற்போது ஆதரிக்கப்படவில்லை

# download.differentFlavors
source: Soundux is offered as different flavors for your operating system.
ta: உங்கள் இயக்க முறைமைக்கு சவுண்டக்ச் வெவ்வேறு சுவைகளாக வழங்கப்படுகிறது.

# download.wrongOS
source: If the wrong operating system was detected, please change it in the upper right corner.
ta: தவறான இயக்க முறைமை கண்டறியப்பட்டால், தயவுசெய்து அதை மேல் வலது மூலையில் மாற்றவும்.

# download.windows.downloadSetup
source: Download Setup
ta: பதிவிறக்க அமைவு

# download.windows.downloadPortable
source: Download Portable
ta: சிறிய பதிவிறக்க

# download.windows.recommendSetup
source: We highly recommend you downloading the Setup as it automatically downloads and installs the required dependencies (WebView2 Runtime and VB-Cable).
ta: அமைப்பை தானாகவே பதிவிறக்கம் செய்து தேவையான சார்புகளை நிறுவுவதால் (வெப்வியூ 2 இயக்க நேரம் மற்றும் விபி-கேபிள்) பதிவிறக்குவதை நாங்கள் மிகவும் பரிந்துரைக்கிறோம்.

# download.windows.important
source: Important!
ta: முக்கியமானது!

# download.windows.importantInformation
source: Please click the button below or watch the video for important information about Windows support
ta: தயவுசெய்து கீழே உள்ள பொத்தானைக் சொடுக்கு செய்க அல்லது சாளரங்கள் உதவி பற்றிய முக்கியமான தகவலுக்கு வீடியோவைப் பாருங்கள்

# download.windows.additionalSteps
source: Additional setup steps
ta: கூடுதல் அமைவு படிகள்

# download.linux.noAutomaticUpdates
source: no automatic updates
ta: தானியங்கி புதுப்பிப்புகள் இல்லை

# download.linux.flatpak
source: For all distros with Flatpak support
ta: பிளாட்பாக் ஆதரவுடன் அனைத்து டிச்ட்ரோக்களுக்கும்

# download.linux.snap
source: For all distros with Snap support
ta: ச்னாப் ஆதரவுடன் அனைத்து டிச்ட்ரோக்களுக்கும்

# download.linux.archLinux
source: Install Soundux with your favorite AUR helper
ta: உங்களுக்கு பிடித்த அவுர் உதவியுடன் சவுண்டக்ச் நிறுவவும்

# download.linux.aurPage
source: Visit AUR page
ta: வருகை மற்றும் பக்கம்

# download.linux.debian
source: Install Soundux on Debian
ta: டெபியனில் சவுண்டக்ச் நிறுவவும்

# download.linux.debPackage
source: via DEB package
ta: டெப் தொகுப்பு வழியாக

# download.linux.downloadDeb
source: Download DEB package
ta: டெப் தொகுப்பைப் பதிவிறக்கவும்

# download.linux.ubuntu
source: Install Soundux on Ubuntu
ta: உபுண்டுவில் சவுண்டக்ச் நிறுவவும்

# download.linux.pacstall
source: via {pacstall}
ta: {pacstall} வழியாக

# download.linux.mpr.title
source: via {mpr}
ta: {mpr} வழியாக

# download.linux.mpr.dependencies
source: You need to install {makedeb} and {tap} first. See the {documentation}
ta: நீங்கள் முதலில் {makedeb} மற்றும் {tap} நிறுவ வேண்டும். {documentation} ஐப் பார்க்கவும்

# download.linux.mpr.documentation
source: documentation for it
ta: அதற்கான ஆவணங்கள்

# download.linux.fedora
source: Install Soundux on Fedora
ta: ஃபெடோராவில் சவுண்டக்ச் நிறுவவும்

# download.linux.copr
source: via {copr}
ta: {copr} வழியாக

# download.linux.rpmPackage
source: via RPM package
ta: ஆர்.பி.எம் தொகுப்பு வழியாக

# download.linux.downloadRpm
source: Download RPM package
ta: RPM தொகுப்பைப் பதிவிறக்கவும்

# download.changelog
source: Changelog
ta: மாற்றபதிவு

# download.downloadsPerVersion
source: Downloads per version
ta: ஒரு பதிப்பிற்கு பதிவிறக்கங்கள்

# download.latestVersions
source: Latest {num} versions
ta: அண்மைக் கால {num} பதிப்புகள்

# download.olderVersions
source: Older versions
ta: பழைய பதிப்புகள்

# download.tryOlderVersions
source: If you have problems with the latest version they might not occur in an older version. You can try out older versions here:
ta: அண்மைக் கால பதிப்பில் உங்களுக்கு சிக்கல்கள் இருந்தால் அவை பழைய பதிப்பில் ஏற்படாது. பழைய பதிப்புகளை இங்கே முயற்சி செய்யலாம்:

# windowsSetup.title
source: Windows Setup
ta: சாளரங்கள் அமைப்பு

# windowsSetup.additionalSteps
source: Additional steps after installing are required to get it working properly on Windows:
ta: நிறுவிய பின் கூடுதல் படிகள் சாளரங்களில் சரியாக வேலை செய்ய வேண்டும்:

# windowsSetup.continue
source: Continue
ta: தொடரவும்

# windowsSetup.finished
source: Finished
ta: முடிந்தது

# windowsSetup.optional
source: Optional
ta: விரும்பினால்

# windowsSetup.step1
source: Recording devices
ta: பதிவு சாதனங்கள்

# windowsSetup.openRecordingDevices
source: Open the recording devices settings
ta: பதிவு சாதன அமைப்புகளைத் திறக்கவும்

# windowsSetup.step2
source: Enable microphone
ta: மைக்ரோஃபோனை இயக்கவும்

# windowsSetup.changeProperties
source: Open the properties of your mic, enable {listenToThisDevice} and select {cableInput} under {playbackThroughThisDevice}.
ta: உங்கள் மைக்கின் பண்புகளைத் திறந்து, {listentothisdevice full ஐ இயக்கவும், {blaybacktherhoughthisdevice onder இன் கீழ் {CaballeInput below என்பதைத் தேர்ந்தெடுக்கவும்.

# windowsSetup.listenToThisDevice
source: Listen to this device
ta: இந்த சாதனத்தைக் கேளுங்கள்

# windowsSetup.playbackThroughThisDevice
source: Playback through this device
ta: இந்த சாதனம் மூலம் பின்னணி

# windowsSetup.step3
source: Improve quality
ta: தரத்தை மேம்படுத்தவும்

# windowsSetup.betterAudioQuality
source: For better audio quality open the properties of the {cableOutput} and set the sample rate to the same as your microphone.
ta: சிறந்த ஆடியோ தரத்திற்கு {கேபிள்அட்புட் of இன் பண்புகளைத் திறந்து மாதிரி வீதத்தை உங்கள் மைக்ரோஃபோனைப் போலவே அமைக்கவும்.

# windowsSetup.step4
source: Select in Soundux
ta: சவுண்டக்சில் தேர்ந்தெடுக்கவும்

# windowsSetup.selectCableInput
source: In Soundux select {cableInput} in the top right selection
ta: சவுண்டக்சில் மேல் வலது தேர்வில் {cableInput} ஐத் தேர்ந்தெடுக்கவும்

# faq.title
source: Frequently asked questions
ta: அடிக்கடி கேட்கப்படும் கேள்விகள்

# faq.discordInputDevice.question
source: Discord asks me if I want to change my input device, what to do?
ta: எனது உள்ளீட்டு சாதனத்தை மாற்ற விரும்புகிறீர்களா, என்ன செய்வது?

# faq.discordInputDevice.answer
source: Click on {neverAskAgain}
ta: {neverAskAgain} இல் சொடுக்கு செய்க

# faq.discordInputDevice.neverAskAgain
source: Never ask again
ta: மீண்டும் ஒருபோதும் கேட்க வேண்டாம்

# faq.discordAudioQuality.question
source: Why is the audio quality in Discord so bad?
ta: டிச்கார்ட்டில் உள்ள ஆடியோ தகுதி ஏன் மோசமாக உள்ளது?

# faq.discordAudioQuality.answer
source: Try disabling {echoCancellation} and {noiseReduction} in Discord's settings under {voiceAndVideo}.
ta: {VoiceandVideo onder இன் கீழ் டிச்கார்டின் அமைப்புகளில் {echoCancellation} மற்றும் {noiseReduction} முடக்க முயற்சிக்கவும்.

# faq.discordAudioQuality.echoCancellation
source: Echo Cancellation
ta: எதிரொலி ரத்து

# faq.discordAudioQuality.noiseReduction
source: Noise Reduction
ta: ஒலி குறைப்பு

# faq.discordAudioQuality.voiceAndVideo
source: Voice & Video
ta: குரல் & வீடியோ

# faq.cantHearSounds.question
source: I can't hear the sounds
ta: என்னால் ஒலிகளைக் கேட்க முடியாது

# faq.cantHearSounds.answer
source: Check if your default output device is set properly
ta: உங்கள் இயல்புநிலை வெளியீட்டு சாதனம் சரியாக அமைக்கப்பட்டுள்ளதா என்று சரிபார்க்கவும்

# faq.passThroughFails.question
source: When I try to pass-through an application it fails
ta: நான் ஒரு பயன்பாட்டை கடந்து செல்ல முயற்சிக்கும்போது அது தோல்வியடைகிறது

# faq.passThroughFails.answer
source: Some apps use OpenAL for audio which may prevent this. To solve this create a file named {fileName} in your home folder with the following contents:
ta: சில பயன்பாடுகள் ஆடியோவுக்கு ஓபனலைப் பயன்படுத்துகின்றன, இது இதைத் தடுக்கலாம். இதைத் தீர்க்க பின்வரும் உள்ளடக்கங்களுடன் உங்கள் வீட்டு கோப்புறையில் {fileName} என்ற கோப்பை உருவாக்கவும்:
