Repository: 247i/TACETr
Catalog: உரை/தானி/soundswitch-tray-icon-*.po
Languages: ta

# noUpdate
source: No update available
ta: புதுப்பிப்பு எதுவும் கிடைக்கவில்லை

source: No devices selected
ta: சாதனங்கள் எதுவும் தேர்ந்தெடுக்கப்படவில்லை

source: Playback Devices
ta: பின்னணி சாதனங்கள்

source: Volume Mixer
ta: தொகுதி மிக்சர்

source: Settings
ta: அமைப்புகள்

# about
source: About SoundSwitch
ta: சவுண்ட்ச்விட்ச் பற்றி

# quit
source: Quit SoundSwitch
ta: சவுண்ட்ச்விட்சை விட்டு வெளியேறவும்

# updateAvailable
source: Update Available ({0})
ta: புதுப்பிப்பு கிடைக்கிறது ({0})

# versionAvailable
source: Update for SoundSwitch ({0}) is available.
ta: சவுண்ட்ச்விட்சிற்கான புதுப்பிப்பு ({0}) கிடைக்கிறது.

# clickToUpdate
source: Click here to update.
ta: புதுப்பிக்க இங்கே சொடுக்கு செய்க.

# playbackChanged
source: SoundSwitch: Playback device switched to
ta: சவுண்ட்ச்விட்ச்: பிளேபேக் சாதனம் மாறியது

# recordingChanged
source: SoundSwitch: Recording device switched to
ta: சவுண்ட்ச்விட்ச்: பதிவு சாதனம் மாறியது

# configurationNeeded
source: SoundSwitch: Configuration needed
ta: சவுண்ட்ச்விட்ச்: உள்ளமைவு தேவை

# configurationNeededExplanation
source: No devices available to switch to. Open configuration by right-clicking on the icon.
ta: மாற சாதனங்கள் எதுவும் கிடைக்கவில்லை. ஐகானில் வலது சொடுக்கு செய்வதன் மூலம் உள்ளமைவைத் திறக்கவும்.

source: Error
ta: பிழை

source: Help
ta: உதவி

source: Donate
ta: நன்கொடை

# iconChanger.playback
source: Playback
ta: பின்னணி

# iconChanger.recording
source: Recording
ta: பதிவு

# iconChanger.none
source: Default
ta: இயல்புநிலை

# iconChanger.both
source: Both
ta: இரண்டும்

source: Community
ta: சமூகம்

# updateDisabled
source: Update check disabled
ta: புதுப்பிப்பு காசோலை முடக்கப்பட்டது

# forceCheckForUpdate
source: Check for update
ta: புதுப்பிப்புக்கு சரிபார்க்கவும்
