Repository: 247i/TACETr
Catalog: உரை/தானி/sozi-translations-*.po
Languages: ta

source: <i class="fa fa-exclamation-triangle"></i> Error
ta: <i வகுப்பு = "fa fa-grausclamation-triangle"> </i> பிழை

source: <i class="fa fa-info-circle"></i> Information
ta: <i வகுப்பு = "fa fa-info-ficle"> </i> செய்தி

source: Document was changed. Reloading.
ta: ஆவணம் மாற்றப்பட்டது. மீண்டும் ஏற்றுதல்.

source: Document was changed.
ta: ஆவணம் மாற்றப்பட்டது.

source: Presentation was exported to PDF.
ta: விளக்கக்காட்சி PDF க்கு ஏற்றுமதி செய்யப்பட்டது.

source: Failed to write PDF file.
ta: PDF கோப்பை எழுதுவதில் தோல்வி.

source: Presentation was exported to PPTX.
ta: விளக்கக்காட்சி PPTX க்கு ஏற்றுமதி செய்யப்பட்டது.

source: Failed to write PPTX file.
ta: PPTX கோப்பை எழுதுவதில் தோல்வி.

source: Presentation was exported to video.
ta: விளக்கக்காட்சி வீடியோவுக்கு ஏற்றுமதி செய்யப்பட்டது.

source: Failed to write video file.
ta: வீடியோ கோப்பை எழுதுவதில் தோல்வி.

source: Document is not valid SVG.
ta: ஆவணம் செல்லுபடியாகும் எச்.வி.சி அல்ல.

source: Document was imported from Sozi 13 or earlier.
ta: சோசி 13 அல்லது அதற்கு முந்தையவர்களிடமிருந்து ஆவணம் இறக்குமதி செய்யப்பட்டது.

source: Saved %s.
ta: சேமிக்கப்பட்டது %s.

source: Open an SVG file from your computer
ta: உங்கள் கணினியிலிருந்து ஒரு எச்.வி.சி கோப்பைத் திறக்கவும்

source: Do you want to save the presentation before closing?
ta: மூடுவதற்கு முன் விளக்கக்காட்சியை சேமிக்க விரும்புகிறீர்களா?

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: File not found: %s.
ta: கோப்பு கிடைக்கவில்லை: %s.

source: Choose an SVG file
ta: எச்.வி.சி கோப்பைத் தேர்வுசெய்க

source: SVG files
ta: எச்.வி.சி கோப்புகள்

source: This file will not be reloaded on change: %s.
ta: இந்த கோப்பு மாற்றத்தில் மீண்டும் ஏற்றப்படாது: %s.

source: Could not read file %s.
ta: %s கோப்பு படிக்க முடியவில்லை.

source: Open an SVG file from your computer (<i class="fa fa-exclamation-triangle"></i> read-only)
ta: உங்கள் கணினியிலிருந்து ஒரு எச்.வி.சி கோப்பைத் திறக்கவும் (<i வகுப்பு = "fa fa-grand-triangle"> </i> படிக்க மட்டும்)

source: Open an SVG file from Google Drive
ta: Google இயக்ககத்திலிருந்து ஒரு SVG கோப்பைத் திறக்கவும்

source: Autoselect outline element
ta: தன்னியக்க அவுட்லைன் உறுப்பு

source: Reset layer geometry
ta: அடுக்கு வடிவவியலை மீட்டமைக்கவும்

source: Create a new frame
ta: புதிய சட்டகத்தை உருவாக்கவும்

source: Save the presentation
ta: விளக்கக்காட்சியைச் சேமிக்கவும்

source: Redo
ta: மீண்டும்செய்

source: Undo
ta: செயல்தவிர்

source: Focus the frame title
ta: பிரேம் தலைப்பில் கவனம் செலுத்துங்கள்

source: Reload the SVG document
ta: எச்.வி.சி ஆவணத்தை மீண்டும் ஏற்றவும்

source: Toggle full-screen mode
ta: முழு திரை பயன்முறையை மாற்றவும்

source: Toggle the developer tools
ta: உருவாக்குபவர் கருவிகளை மாற்றவும்

source: Back to presentation properties
ta: விளக்கக்காட்சி பண்புகளுக்குத் திரும்பு

source: User interface
ta: பயனர் இடைமுகம்

source: Language
ta: மொழி

source: Font size
ta: எழுத்துரு அளவு

source: Enable notifications on save and reload
ta: சேமித்து மீண்டும் ஏற்றுவது குறித்த அறிவிப்புகளை இயக்கவும்

source: Enable notifications
ta: அறிவிப்புகளை இயக்கவும்

source: When Sozi loses the focus
ta: சோசி கவனத்தை இழக்கும்போது

source: Manually
ta: கைமுறையாக

source: Automatically
ta: தானாக

source: When Sozi gets the focus
ta: சோசி கவனம் செலுத்தும்போது

source: Behavior
ta: நடத்தை

source: Preview transition animations
ta: முன்னோட்ட மாற்றம் அனிமேசன்கள்

source: Enable animated transitions
ta: அனிமேசன் மாற்றங்களை இயக்கவும்

source: Keyboard shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

source: Rendering
ta: வழங்குதல்

source: Hardware acceleration
ta: வன்பொருள் முடுக்கம்

source: Enable hardware acceleration (effective after restarting the application)
ta: வன்பொருள் முடுக்கம் இயக்கவும் (பயன்பாட்டை மறுதொடக்கம் செய்த பிறகு பயனுள்ளதாக இருக்கும்)

source: Color correct rendering
ta: வண்ண சரியான வழங்குதல்

source: Enable color correct rendering (effective after restarting the application)
ta: வண்ண சரியான வழங்குதல் (பயன்பாட்டை மறுதொடக்கம் செய்த பிறகு பயனுள்ளதாக இருக்கும்)

source: Basic formatting supported:
ta: அடிப்படை வடிவமைப்பு ஆதரவு:

source: Ctrl+B: Bold
ta: Ctrl+B: தைரியமான

source: Ctrl+I: Italic
ta: Ctrl+I: சாய்வு

source: Ctrl+U: Underline
ta: Ctrl+U: அடிக்கோடிட்டுக் காட்டுங்கள்

source: Ctrl+0: Paragraph
ta: Ctrl+0: பத்தி

source: Ctrl+1: Big heading
ta: Ctrl+1: பெரிய தலைப்பு

source: Ctrl+2: Medium heading
ta: Ctrl+2: நடுத்தர தலைப்பு

source: Ctrl+3: Small heading
ta: Ctrl+3: சிறிய தலைப்பு

source: Ctrl+L: List
ta: Ctrl+L: பட்டியல்

source: Ctrl+N: Numbered list
ta: Ctrl+N: எண்ணற்ற பட்டியல்

source: Ctrl+>: Indent list entry
ta: Ctrl+>: உள்தள்ளல் பட்டியல் நுழைவு

source: Ctrl+<: Outdent list entry
ta: Ctrl+<: வெளிப்புற பட்டியல் நுழைவு

source: Select a layer to copy
ta: நகலெடுக்க ஒரு அடுக்கைத் தேர்ந்தெடுக்கவும்

source: Default
ta: இயல்புநிலை

source: Frame
ta: சட்டகம்

source: Show in frame list
ta: பிரேம் பட்டியலில் காண்பி

source: Show frame number
ta: பிரேம் எண்ணைக் காட்டு

source: Title
ta: தலைப்பு

source: Title level in frame list
ta: பிரேம் பட்டியலில் தலைப்பு நிலை

source: Id
ta: ஐடி

source: Timeout (seconds)
ta: நேரம் முடிந்தது (விநாடிகள்)

source: Timeout enable
ta: நேரம் முடிந்தது

source: Layer
ta: அடுக்கு

source: Link to previous frame
ta: முந்தைய சட்டத்திற்கான இணைப்பு

source: Clip
ta: கிளிப்

source: Copy layer
ta: நகல் அடுக்கு

source: Outline element Id
ta: அவுட்லைன் உறுப்பு ஐடி

source: Autoselect element
ta: தன்னியக்க உறுப்பு

source: Hide element
ta: உறுப்பு மறை

source: Fit to element
ta: உறுப்புக்கு பொருந்தும்

source: Layer opacity
ta: அடுக்கு ஒளிபுகாநிலை

source: Transition
ta: மாற்றம்

source: Configure the animation when moving to the selected frames.
ta: தேர்ந்தெடுக்கப்பட்ட பிரேம்களுக்கு செல்லும்போது அனிமேசனை உள்ளமைக்கவும்.

source: Duration (seconds)
ta: காலம் (விநாடிகள்)

source: Timing function
ta: நேர செயல்பாடு

source: Linear
ta: நேரியல்

source: Ease
ta: எளிதானது

source: Ease in
ta: எளிதாக

source: Ease out
ta: எளிதாக்குங்கள்

source: Ease in-out
ta: எளிதாக

source: Step start
ta: படி தொடக்க

source: Step end
ta: படி முடிவு

source: Step middle
ta: படி நடுத்தர

source: Relative zoom (%)
ta: உறவினர் சூம் (%)

source: Path Id
ta: பாதை ஐடி

source: Hide path
ta: பாதையை மறைக்கவும்

source: Notes
ta: குறிப்புகள்

source: Edit presenter notes. Click here to show the list of formatting shortcuts.
ta: தொகுப்பாளர் குறிப்புகளைத் திருத்தவும். வடிவமைத்தல் குறுக்குவழிகளின் பட்டியலைக் காட்ட இங்கே சொடுக்கு செய்க.

source: Custom stylesheets and scripts
ta: தனிப்பயன் நடைதாள் மற்றும் ச்கிரிப்ட்கள்

source: CSS or JS file names
ta: சிஎச்எச் அல்லது JS கோப்பு பெயர்கள்

source: Add CSS or JS files
ta: சிஎச்எச் அல்லது JS கோப்புகளைச் சேர்க்கவும்

source: Add a file
ta: ஒரு கோப்பைச் சேர்க்கவும்

source: Remove this file
ta: இந்த கோப்பை அகற்று

source: Player
ta: வீரர்

source: Support the browser's "Back" button to move to the previous frame
ta: முந்தைய சட்டத்திற்கு செல்ல உலாவியின் "பின்" பொத்தானை ஆதரிக்கவும்

source: Moving from one frame to another will change the content of the location bar automatically.
ta: ஒரு சட்டத்திலிருந்து இன்னொரு சட்டத்திற்கு நகர்த்துவது இருப்பிடப் பட்டியின் உள்ளடக்கத்தை தானாக மாற்றும்.

source: Allow to control the presentation
ta: விளக்கக்காட்சியைக் கட்டுப்படுத்த அனுமதிக்கவும்

source: using the mouse
ta: சுட்டியைப் பயன்படுத்துதல்

source: using the keyboard
ta: விசைப்பலகை பயன்படுத்துதல்

source: Allow to move the camera
ta: கேமராவை நகர்த்த அனுமதிக்கவும்

source: Allow to rotate the camera
ta: கேமராவை சுழற்ற அனுமதிக்கவும்

source: Allow to zoom
ta: பெரிதாக்க அனுமதிக்கவும்

source: Examples of frame lists to include/exclude in export
ta: ஏற்றுமதியில் சேர்க்க/விலக்க பிரேம் பட்டியல்களின் எடுத்துக்காட்டுகள்

source: Select frames 2, 5, and 12: "2, 5, 12"
ta: பிரேம்கள் 2, 5, மற்றும் 12: "2, 5, 12" என்பதைத் தேர்ந்தெடுக்கவும்

source: Select frames 5 to 8: "5:8"
ta: 5 முதல் 8 வரை பிரேம்களைத் தேர்ந்தெடுக்கவும்: "5: 8"

source: Select frames 5, 8, 11, 14, and 17: "5:8:17"
ta: 5, 8, 11, 14, மற்றும் 17: "5: 8: 17" ஐத் தேர்ந்தெடுக்கவும்

source: Select frames 2, 5, and 10 to 15: "2, 5, 10:15"
ta: 2, 5, மற்றும் 10 முதல் 15 வரை பிரேம்களைத் தேர்ந்தெடுக்கவும்: "2, 5, 10:15"

source: Export
ta: ஏற்றுமதி

source: Document type
ta: ஆவண வகை

source: Portable Document Format (PDF)
ta: சிறிய ஆவண வடிவமைப்பு (PDF)

source: Microsoft PowerPoint (PPTX)
ta: நுண்மென் பவர்பாயிண்ட் (பிபிடிஎக்ச்)

source: Video
ta: ஒளிதோற்றம்

source: Export the presentation
ta: விளக்கக்காட்சியை ஏற்றுமதி செய்யுங்கள்

source: Page size
ta: பக்க அளவு

source: A3
ta: இருங்கள்

source: A4
ta: ரிவெட்

source: A5
ta: சகோதரர்

source: Legal
ta: சட்டரீதியான

source: Letter
ta: கடிதம்

source: Tabloid
ta: செய்திக்கும்

source: Page orientation
ta: பக்க நோக்குநிலை

source: Landscape
ta: நிலப்பரப்பு

source: Portrait
ta: உருவப்படம்

source: List of frames to include
ta: சேர்க்க வேண்டிய பிரேம்களின் பட்டியல்

source: Click here to see the syntax for this field
ta: இந்த புலத்திற்கான தொடரியல் பார்க்க இங்கே சொடுக்கு செய்க

source: List of frames to exclude
ta: விலக்குவதற்கு பிரேம்களின் பட்டியல்

source: Slide size
ta: ச்லைடு அளவு

source: 35 mm
ta: 35 மி.மீ.

source: B4 (ISO)
ta: கிமு (ஐஎச்ஓ)

source: B4 (JIS)
ta: பி 4 (சே.ஐ.எச்)

source: B5 (ISO)
ta: பி 5 (பெரியது)

source: B5 (JIS)
ta: பி 5 (அவர்)

source: Banner
ta: பேனர்

source: Hagaki Card
ta: ஆகாக்கி அட்டை

source: Overhead
ta: மேற்செலவு

source: Screen 16:10
ta: திரை 16:10

source: Screen 16:9
ta: திரை 16: 9

source: Screen 4:3
ta: திரை 4: 3

source: Format
ta: வடிவம்

source: Ogg Vorbis (.ogv)
ta: மற்றும் வோர்பிச் (.ogv)

source: WebM (.webm)
ta: வெப்எம் (.webm)

source: Windows Media Video (.wmv)
ta: சாளரங்கள் மீடியா வீடியோ (.wmv)

source: Image sequence (.png)
ta: பட வரிசை (.png)

source: Width (pixels)
ta: அகலம் (பிக்சல்கள்)

source: Height (pixels)
ta: உயரம் (பிக்சல்கள்)

source: Frame rate (frames/sec)
ta: பிரேம் வீதம் (பிரேம்கள்/நொடி)

source: Bit rate (kbits/sec)
ta: பிட் வீதம் (kbits/நொடி)

source: Delete the selected frames
ta: தேர்ந்தெடுக்கப்பட்ட பிரேம்களை நீக்கவும்

source: Add layer
ta: அடுக்கு சேர்க்கவும்

source: Add all layers
ta: அனைத்து அடுக்குகளையும் சேர்க்கவும்

source: This layer is visible. Click to hide it.
ta: இந்த அடுக்கு தெரியும். அதை மறைக்க சொடுக்கு செய்க.

source: This layer is hidden. Click to show it.
ta: இந்த அடுக்கு மறைக்கப்பட்டுள்ளது. அதைக் காட்ட சொடுக்கு செய்க.

source: Remove this layer
ta: இந்த அடுக்கை அகற்று

source: Insert selection before frame %d
ta: பிரேம் %d க்கு முன் தேர்வைச் செருகவும்

source: Insert selection after frame %d
ta: பிரேம் %d க்குப் பிறகு தேர்வைச் செருகவும்

source: You should add graphic elements in the current area to help Sozi keep track of this layer's position.
ta: இந்த அடுக்கின் நிலையை சோசி கண்காணிக்க உதவ தற்போதைய பகுதியில் நீங்கள் கிராஃபிக் கூறுகளைச் சேர்க்க வேண்டும்.

source: Aspect ratio:
ta: அம்ச விகிதம்:

source: Move the selected layers (hold Alt to zoom, Shift to rotate)
ta: தேர்ந்தெடுக்கப்பட்ட அடுக்குகளை நகர்த்தவும் (பெரிதாக்க அல்ட் பிடி, சுழற்ற மாற்றவும்)

source: Zoom in/out on the selected layers (you can also hold the Alt key in Move mode)
ta: தேர்ந்தெடுக்கப்பட்ட அடுக்குகளில் பெரிதாக்க/வெளியே (நீங்கள் ஆல்ட் விசையை நகரும் பயன்முறையில் வைத்திருக்கலாம்)

source: Rotate the selected layers (you can also hold the Shift key in Move mode)
ta: தேர்ந்தெடுக்கப்பட்ட அடுக்குகளை சுழற்றுங்கள் (நீங்கள் சிப்ட் விசையை நகரும் பயன்முறையில் வைத்திருக்கலாம்)

source: Edit the clipping area
ta: கிளிப்பிங் பகுதியைத் திருத்தவும்

source: Disable full-screen mode
ta: முழு திரை பயன்முறையை முடக்கு

source: Enable full-screen mode
ta: முழு திரை பயன்முறையை இயக்கவும்

source: Preferences
ta: விருப்பத்தேர்வுகள்

source: Information
ta: தகவல்

source: System language
ta: கணினி மொழி
