Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_extdev--appapi_*.po
Languages: ta

source: Add the standard docutils :class:`~docutils.transforms.Transform` subclass *transform* to the list of transforms that are applied before Sphinx writes a document.
ta: நிலையான ஆவணங்களைச் சேர்க்கவும்: வகுப்பு: `~ docutils.transforms.transform` துணைப்பிரிவு * உருமாற்றம் * ஸ்பின்க்ஸ் ஒரு ஆவணத்தை எழுதுவதற்கு முன்பு பயன்படுத்தப்படும் மாற்றங்களின் பட்டியலுக்கு மாற்றவும்.

source: Register a JavaScript file to include in the HTML output.
ta: HTML வெளியீட்டில் சேர்க்க ஜாவாஸ்கிரிப்ட் கோப்பை பதிவு செய்யுங்கள்.

source: The name of a JavaScript file that the default HTML template will include. It must be relative to the HTML static path, or a full URI with scheme, or ``None`` . The ``None`` value is used to create an inline ``<script>`` tag. See the description of *kwargs* below.
ta: இயல்புநிலை HTML வார்ப்புருவில் இருக்கும் ஜாவாஸ்கிரிப்ட் கோப்பின் பெயர் அடங்கும். இது HTML நிலையான பாதையுடன் தொடர்புடையதாக இருக்க வேண்டும், அல்லது திட்டத்துடன் கூடிய முழு URI, அல்லது `` எதுவுமில்லை``. ஒரு இன்லைன் `` <script> `` குறிச்சொல் உருவாக்க `` எதுவுமில்லை` மதிப்பு பயன்படுத்தப்படுகிறது. * குவார்க்ஸ் * இன் விளக்கத்தை கீழே காண்க.

source: Files are included in ascending order of priority. If multiple JavaScript files have the same priority, those files will be included in order of registration. See list of "priority range for JavaScript files" below.
ta: முன்னுரிமையின் ஏறுவரிசை வரிசையில் கோப்புகள் சேர்க்கப்பட்டுள்ளன. பல ஜாவாஸ்கிரிப்ட் கோப்புகளுக்கு ஒரே முன்னுரிமை இருந்தால், அந்த கோப்புகள் பதிவுசெய்தலில் சேர்க்கப்படும். கீழே உள்ள "ஜாவாஸ்கிரிப்ட் கோப்புகளுக்கான முன்னுரிமை வரம்பு" பட்டியலைக் காண்க.

source: The loading method for the JavaScript file. Either ``'async'`` or ``'defer'`` are allowed.
ta: ஜாவாஸ்கிரிப்ட் கோப்பிற்கான ஏற்றுதல் முறை. ஒன்று `` 'async'`` அல்லது ``' டெஃபர்'`` அனுமதிக்கப்படுகிறது.

source: Extra keyword arguments are included as attributes of the ``<script>`` tag. If the special keyword argument ``body`` is given, its value will be added as the content of the ``<script>`` tag.
ta: `` <ஸ்கிரிப்ட்> `` குறிச்சொல்லின் பண்புகளாக கூடுதல் முக்கிய வாதங்கள் சேர்க்கப்பட்டுள்ளன. சிறப்பு முக்கிய வாதம் `` உடல்`` வழங்கப்பட்டால், அதன் மதிப்பு `` <ஸ்கிரிப்ட்> `` குறிச்சொல்லின் உள்ளடக்கமாக சேர்க்கப்படும்.

source: Example::
ta: உதாரணமாக::

source: priority range for JavaScript files
ta: ஜாவாஸ்கிரிப்ட் கோப்புகளுக்கான முன்னுரிமை வரம்பு

source: default priority for built-in JavaScript files
ta: உள்ளமைக்கப்பட்ட ஜாவாஸ்கிரிப்ட் கோப்புகளுக்கான இயல்புநிலை முன்னுரிமை

source: default priority for extensions
ta: நீட்டிப்புகளுக்கான இயல்புநிலை முன்னுரிமை

source: default priority for :confval:`html_js_files`
ta: இதற்கான இயல்புநிலை முன்னுரிமை: confval: `html_js_files`

source: A JavaScript file can be added to the specific HTML page when an extension calls this method on :event:`html-page-context` event.
ta: ஒரு நீட்டிப்பு இந்த முறையை அழைக்கும்போது குறிப்பிட்ட HTML பக்கத்தில் ஒரு ஜாவாஸ்கிரிப்ட் கோப்பை சேர்க்கலாம்: நிகழ்வு: `HTML-PAGE-CONTEXT` நிகழ்வு.

source: Renamed from ``app.add_javascript()``. And it allows keyword arguments as attributes of script tag.
ta: `` App.add_javascript () `` இலிருந்து மறுபெயரிடப்பட்டது. இது ஸ்கிரிப்ட் குறிச்சொல்லின் பண்புகளாக முக்கிய வாதங்களை அனுமதிக்கிறது.

source: Take priority argument. Allow to add a JavaScript file to the specific page.
ta: முன்னுரிமை வாதத்தை எடுத்துக் கொள்ளுங்கள். குறிப்பிட்ட பக்கத்தில் ஜாவாஸ்கிரிப்ட் கோப்பைச் சேர்க்க அனுமதிக்கவும்.

source: Take loading_method argument. Allow to change the loading method of the JavaScript file.
ta: ஏற்றுதல் முறை வாதங்களை எடுத்துக் கொள்ளுங்கள். ஜாவாஸ்கிரிப்ட் கோப்பின் ஏற்றுதல் முறையை மாற்ற அனுமதிக்கவும்.

source: Register a stylesheet to include in the HTML output.
ta: HTML வெளியீட்டில் சேர்க்க ஒரு நடைதாள் பதிவு செய்யுங்கள்.

source: The name of a CSS file that the default HTML template will include. It must be relative to the HTML static path, or a full URI with scheme.
ta: இயல்புநிலை HTML வார்ப்புருவில் உள்ள CSS கோப்பின் பெயர் அடங்கும். இது HTML நிலையான பாதையுடன் தொடர்புடையதாக இருக்க வேண்டும், அல்லது திட்டத்துடன் முழு URI.

source: Files are included in ascending order of priority. If multiple CSS files have the same priority, those files will be included in order of registration. See list of "priority range for CSS files" below.
ta: முன்னுரிமையின் ஏறுவரிசை வரிசையில் கோப்புகள் சேர்க்கப்பட்டுள்ளன. பல CSS கோப்புகளுக்கு ஒரே முன்னுரிமை இருந்தால், அந்த கோப்புகள் பதிவுசெய்யும் வரிசையில் சேர்க்கப்படும். கீழே உள்ள "CSS கோப்புகளுக்கான முன்னுரிமை வரம்பு" பட்டியலைக் காண்க.

source: Extra keyword arguments are included as attributes of the ``<link>`` tag.
ta: கூடுதல் முக்கிய வாதங்கள் `` <இணைப்பு> `` குறிச்சொல்லின் பண்புகளாக சேர்க்கப்பட்டுள்ளன.

source: priority range for CSS files
ta: CSS கோப்புகளுக்கான முன்னுரிமை வரம்பு

source: default priority for built-in CSS files
ta: உள்ளமைக்கப்பட்ட CSS கோப்புகளுக்கான இயல்புநிலை முன்னுரிமை

source: default priority for :confval:`html_css_files`
ta: இதற்கான இயல்புநிலை முன்னுரிமை: confval: `html_css_files`

source: A CSS file can be added to the specific HTML page when an extension calls this method on :event:`html-page-context` event.
ta: நீட்டிப்பு இந்த முறையை அழைக்கும்போது குறிப்பிட்ட HTML பக்கத்தில் ஒரு CSS கோப்பை சேர்க்கலாம்: நிகழ்வு: `HTML-PAGE-CONTEXT` நிகழ்வு.

source: Optional ``alternate`` and/or ``title`` attributes can be supplied with the arguments *alternate* (a Boolean) and *title* (a string). The default is no title and *alternate* = ``False``. For more information, refer to the `documentation <https://mdn.io/Web/CSS/Alternative_style_sheets>`__.
ta: விருப்ப `` மாற்று`` மற்றும்/அல்லது `` தலைப்பு`` பண்புகளை வாதங்களுடன் * மாற்று * (ஒரு பூலியன்) மற்றும் * தலைப்பு * (ஒரு சரம்) வழங்கலாம். இயல்புநிலை தலைப்பு இல்லை மற்றும் * மாற்று * = `` தவறு``. மேலும் தகவலுக்கு, `ஆவணங்கள் <https://mdn.io/web/css/alternative_style_sheets> __ __ ஐப் பார்க்கவும்.

source: Renamed from ``app.add_stylesheet()``. And it allows keyword arguments as attributes of link tag.
ta: `` App.add_stylesheet () `` இலிருந்து மறுபெயரிடப்பட்டது. இது இணைப்பு குறிச்சொல்லின் பண்புகளாக முக்கிய வாதங்களை அனுமதிக்கிறது.

source: Take priority argument. Allow to add a CSS file to the specific page.
ta: முன்னுரிமை வாதத்தை எடுத்துக் கொள்ளுங்கள். குறிப்பிட்ட பக்கத்தில் CSS கோப்பைச் சேர்க்க அனுமதிக்கவும்.

source: Register a package to include in the LaTeX source code.
ta: லேடெக்ஸ் மூலக் குறியீட்டில் சேர்க்க ஒரு தொகுப்பை பதிவு செய்யுங்கள்.

source: Add *packagename* to the list of packages that LaTeX source code will include. If you provide *options*, it will be taken to the `\usepackage` declaration. If you set *after_hyperref* truthy, the package will be loaded after ``hyperref`` package.
ta: லேடெக்ஸ் மூலக் குறியீட்டை உள்ளடக்கிய தொகுப்புகளின் பட்டியலில் * பேக்கஜெனேம் * ஐச் சேர்க்கவும். நீங்கள் *விருப்பங்களை *வழங்கினால், அது `\ UsePackage` அறிவிப்புக்கு கொண்டு செல்லப்படும். நீங்கள் * after_hyperref * உண்மையை அமைத்தால், தொகுப்பு `` ஹைப்பர்ரெஃப்`` தொகுப்புக்குப் பிறகு ஏற்றப்படும்.

source: *after_hyperref* option.
ta: * பிறகு_ஹைர்ரெஃப்* விருப்பம்.

source: Register a new lexer for source code.
ta: மூலக் குறியீட்டிற்கு புதிய லெக்ஸரை பதிவு செய்யுங்கள்.

source: Use *lexer* to highlight code blocks with the given language *alias*.
ta: கொடுக்கப்பட்ட மொழியுடன் குறியீடு தொகுதிகளை முன்னிலைப்படுத்த *லெக்ஸர் *ஐப் பயன்படுத்தவும் *மாற்றுப்பெயர் *.

source: Take a lexer class as an argument.
ta: ஒரு வாதமாக ஒரு லெக்ஸர் வகுப்பை எடுத்துக் கொள்ளுங்கள்.

source: Removed support for lexer instances as an argument.
ta: லெக்ஸர் நிகழ்வுகளுக்கான ஆதரவை ஒரு வாதமாக நீக்கியது.

source: Register a new documenter class for the autodoc extension.
ta: ஆட்டோடோக் நீட்டிப்புக்கு புதிய ஆவணப்படுத்தல் வகுப்பைப் பதிவுசெய்க.

source: Add *cls* as a new documenter class for the :mod:`sphinx.ext.autodoc` extension. It must be a subclass of :class:`sphinx.ext.autodoc.Documenter`. This allows auto-documenting new types of objects. See the source of the autodoc module for examples on how to subclass :class:`~sphinx.ext.autodoc.Documenter`.
ta: * CLS * ஐ ஒரு புதிய ஆவணக்காரர் வகுப்பாக சேர்க்கவும்: MOD: `sphinx.ext.autodoc` நீட்டிப்பு. இது ஒரு துணைப்பிரிவாக இருக்க வேண்டும்: வகுப்பு: `sphinx.ext.autodoc.documenter`. இது தானாக ஆவணப்படுத்த புதிய வகை பொருள்களை அனுமதிக்கிறது. துணைப்பிரிவு: வகுப்பு: `~ sphinx.ext.autodoc.documenter` என்பதற்கான எடுத்துக்காட்டுகளுக்கு ஆட்டோடோக் தொகுதியின் மூலத்தைக் காண்க.

source: If *override* is True, the given *cls* is forcedly installed even if a documenter having the same name is already installed.
ta: * மேலெழுத * உண்மை என்றால், அதே பெயரைக் கொண்ட ஒரு ஆவணப்படம் ஏற்கனவே நிறுவப்பட்டிருந்தாலும் கூட கொடுக்கப்பட்ட * CLS * கட்டாயமாக நிறுவப்படுகிறது.

source: See :ref:`autodoc_ext_tutorial`.
ta: காண்க: குறிப்பு: `AutoDoc_ext_tutorial`.

source: Register a new ``getattr``-like function for the autodoc extension.
ta: ஆட்டோடோக் நீட்டிப்புக்கு புதிய `` getattr`` போன்ற செயல்பாட்டைப் பதிவுசெய்க.

source: Add *getter*, which must be a function with an interface compatible to the :func:`getattr` builtin, as the autodoc attribute getter for objects that are instances of *typ*. All cases where autodoc needs to get an attribute of a type are then handled by this function instead of :func:`getattr`.
ta: *Getter *ஐச் சேர், இது: func: `getAttr` பில்டின் உடன் இணக்கமான இடைமுகத்துடன் ஒரு செயல்பாடாக இருக்க வேண்டும், ஏனெனில் *தட்டச்சு *நிகழ்வுகளுக்கான ஆட்டோடோக் பண்புக்கூறு பெறுநராக. ஆட்டோடாக் ஒரு வகையின் பண்புக்கூறைப் பெற வேண்டிய அனைத்து நிகழ்வுகளும் பின்னர் இந்த செயல்பாட்டால் கையாளப்படுகின்றன: func: `getattr`.

source: Register a new language for the HTML search index.
ta: HTML தேடல் குறியீட்டுக்கு புதிய மொழியைப் பதிவுசெய்க.

source: Add *cls*, which must be a subclass of :class:`sphinx.search.SearchLanguage`, as a support language for building the HTML full-text search index. The class must have a *lang* attribute that indicates the language it should be used for. See :confval:`html_search_language`.
ta: HTML முழு உரை தேடல் குறியீட்டை உருவாக்குவதற்கான ஒரு ஆதரவு மொழியாக: வகுப்பு: `sphinx.searchLanguage` இன் துணைப்பிரிவாக இருக்க வேண்டும் *Cls *ஐச் சேர்க்கவும். வகுப்பில் ஒரு * லாங் * பண்புக்கூறு இருக்க வேண்டும், அது பயன்படுத்தப்பட வேண்டிய மொழியைக் குறிக்கிறது. காண்க: confval: `html_search_language`.

source: Register a suffix of source files.
ta: மூல கோப்புகளின் பின்னொட்டைப் பதிவுசெய்க.

source: Same as :confval:`source_suffix`. The users can override this using the config setting.
ta: அதே: confval: `source_suffix`. பயனர்கள் கட்டமைப்பு அமைப்பைப் பயன்படுத்தி இதை மேலெழுதலாம்.

source: If false, do not install it the same suffix is already installed. If true, unconditionally install the suffix.
ta: தவறு என்றால், அதை நிறுவ வேண்டாம் அதே பின்னொட்டு ஏற்கனவே நிறுவப்பட்டுள்ளது. உண்மை என்றால், நிபந்தனையின்றி பின்னொட்டை நிறுவவும்.

source: Register a parser class.
ta: ஒரு பாகுபடுத்தி வகுப்பை பதிவு செய்யுங்கள்.

source: If false, do not install it if another parser is already installed for the same suffix. If true, unconditionally install the parser.
ta: தவறு என்றால், அதே பின்னொட்டுக்கு மற்றொரு பாகுபடுத்தி ஏற்கனவே நிறுவப்பட்டிருந்தால் அதை நிறுவ வேண்டாம். உண்மை என்றால், நிபந்தனையின்றி பாகுபடுத்தி நிறுவவும்.

source: *suffix* argument is deprecated. It only accepts *parser* argument. Use :meth:`add_source_suffix` API to register suffix instead.
ta: * பின்னொட்டு* வாதம் நீக்கப்பட்டது. இது * பாகுபடுத்தி * வாதத்தை மட்டுமே ஏற்றுக்கொள்கிறது. பயன்படுத்தவும்: METH: `add_source_suffix` அதற்கு பதிலாக பின்னொட்டைப் பதிவு செய்ய API.

source: Register an environment collector class.
ta: சுற்றுச்சூழல் சேகரிப்பான் வகுப்பைப் பதிவுசெய்க.

source: Refer to :ref:`collector-api`.
ta: பார்க்கவும்: ref: `கலெக்டர்-அபிஐ`.

source: Register a HTML Theme.
ta: ஒரு HTML கருப்பொருளை பதிவு செய்யுங்கள்.

source: The *name* is a name of theme, and *theme_path* is a full path to the theme (refs: :ref:`distribute-your-theme`).
ta: * பெயர் * என்பது கருப்பொருளின் பெயர், மற்றும் * தீம்_பாத் * என்பது கருப்பொருளுக்கு முழு பாதையாகும் (refs :: ref: `உங்கள்-தீம் விநியோகிக்கவும்).

source: Register a math renderer for HTML.
ta: HTML க்கு கணித ரெண்டரரை பதிவு செய்யுங்கள்.

source: The *name* is a name of math renderer. Both *inline_renderers* and *block_renderers* are used as visitor functions for the HTML writer: the former for inline math node (``nodes.math``), the latter for block math node (``nodes.math_block``). Regarding visitor functions, see :meth:`add_node` for details.
ta: * பெயர் * என்பது கணித ரெண்டரரின் பெயர். HTML எழுத்தாளருக்கான பார்வையாளர் செயல்பாடுகளாக * inline_renderers * மற்றும் * block_renderers * இரண்டும் பயன்படுத்தப்படுகின்றன: இன்லைன் கணித முனைக்கு முந்தையது (`` nodes.math``), தொகுதி கணித முனைக்கு (`` nodes.math_block``). பார்வையாளர் செயல்பாடுகள் குறித்து, காண்க: மெத்: `கூடுதல்_நோட்` விவரங்களுக்கு.

source: Register a message catalog.
ta: செய்தி பட்டியலைப் பதிவுசெய்க.

source: The name of the catalog
ta: பட்டியலின் பெயர்

source: The base path of the message catalog
ta: செய்தி பட்டியலின் அடிப்படை பாதை

source: For more details, see :func:`sphinx.locale.get_translation()`.
ta: மேலும் விவரங்களுக்கு, காண்க: func: `sphinx.locale.get_translation ()`.

source: Check whether parallel processing is allowed or not.
ta: இணையான செயலாக்கம் அனுமதிக்கப்பட்டதா இல்லையா என்பதைச் சரிபார்க்கவும்.

source: A type of processing; ``'read'`` or ``'write'``.
ta: ஒரு வகை செயலாக்கம்; `'' ``` அல்லது` `'எழுதுங்கள் .``.

source: Set the policy to include assets in HTML pages.
ta: உஉகுமொ பக்கங்களில் சொத்துகளைச் சேர்க்க கொள்கையை அமைக்கவும்.

source: always: include the assets in all the pages
ta: எப்போதும்: எல்லா பக்கங்களிலும் உள்ள சொத்துகளைச் சேர்க்கவும்

source: per_page: include the assets only in pages where they are used
ta: per_page: சொத்துக்களை அவை பயன்படுத்தப்படும் பக்கங்களில் மட்டும் சேர்க்கவும்

source: All these methods raise this exception if something went wrong with the extension API.
ta: நீட்டிப்பு API இல் ஏதேனும் தவறு நடந்தால் இந்த முறைகள் அனைத்தும் இந்த விதிவிலக்கை எழுப்புகின்றன.

source: Emitting events
ta: நிகழ்வுகளை வெளியிடுகிறது

source: Emit *event* and pass *arguments* to the callback functions.
ta: கால்பேக் செயல்பாடுகளுக்கு * நிகழ்வு * மற்றும் * வாதங்களை * அனுப்பவும்.

source: Return the return values of all callbacks as a list. Do not emit core Sphinx events in extensions!
ta: அனைத்து கால்பேக்குகளின் வருவாய் மதிப்புகளையும் ஒரு பட்டியலாக திருப்பி விடுங்கள். கோர் ஸ்பிங்க்ஸ் நிகழ்வுகளை நீட்டிப்புகளில் வெளியிட வேண்டாம்!

source: The name of event that will be emitted
ta: வெளிப்படும் நிகழ்வின் பெயர்

source: The arguments for the event
ta: நிகழ்விற்கான வாதங்கள்

source: The list of exceptions that are allowed in the callbacks
ta: கால்பேக்குகளில் அனுமதிக்கப்பட்ட விதிவிலக்குகளின் பட்டியல்

source: Added *allowed_exceptions* to specify path-through exceptions
ta: பாத்-மூலம் விதிவிலக்குகளைக் குறிப்பிட * அனுமதிக்கப்பட்ட_ எக்ஸ்செப்சஸ் * சேர்க்கப்பட்டது

source: Return the result of the first callback that doesn't return ``None``.
ta: `` எதுவுமில்லை`` திரும்பப் பெறாத முதல் அழைப்பின் முடிவைத் தரவும்.

source: Sphinx runtime information
ta: ஸ்பிங்க்ஸ் இயக்க நேர தகவல்

source: The application object also provides runtime information as attributes.
ta: பயன்பாட்டு பொருள் இயக்க நேர தகவல்களை பண்புகளாக வழங்குகிறது.

source: Target project. See :class:`.Project`.
ta: இலக்கு திட்டம். காண்க: வகுப்பு: `.பிரோஜெக்ட்`.

source: Source directory.
ta: மூல அடைவு.

source: Directory containing ``conf.py``.
ta: `` Conf.py`` கொண்ட அடைவு.

source: Directory for storing pickled doctrees.
ta: ஊறுகாய் கோட்பாடுகளை சேமிப்பதற்கான அடைவு.

source: Directory for storing built document.
ta: கட்டப்பட்ட ஆவணத்தை சேமிப்பதற்கான அடைவு.

source: True/False as to whether a new environment was created for this build, or None if the environment has not been initialised yet.
ta: இந்த உருவாக்கத்திற்கான புதிய சூழல் உருவாக்கப்பட்டதா அல்லது இன்னும் சூழல் தொடங்கப்படாவிட்டால் எதுவுமில்லை என்பது உண்மை/தவறு.

source: Sphinx core events
ta: ஸ்பிங்க்ஸ் கோர் நிகழ்வுகள்

source: Moved to :ref:`events`.
ta: :ref:`events` க்கு நகர்த்தப்பட்டது.

source: Checking the Sphinx version
ta: ஸ்பிங்க்ஸ் பதிப்பை சரிபார்க்கிறது

source: Use this to adapt your extension to API changes in Sphinx.
ta: SPHINX இல் API மாற்றங்களுக்கு உங்கள் நீட்டிப்பை மாற்றியமைக்க இதைப் பயன்படுத்தவும்.

source: Version info for better programmatic use.
ta: சிறந்த நிரல் பயன்பாட்டிற்கான பதிப்பு தகவல்.

source: A tuple of five elements; for Sphinx version 1.2.1 beta 3 this would be ``(1, 2, 1, 'beta', 3)``. The fourth element can be one of: ``alpha``, ``beta``, ``rc``, ``final``. ``final`` always has 0 as the last element.
ta: ஐந்து கூறுகளின் ஒரு டூப்பிள்; ஸ்பிங்க்ஸ் பதிப்பு 1.2.1 பீட்டா 3 க்கு இது `` (1, 2, 1, 'பீட்டா', 3) ``. நான்காவது உறுப்பு ஒன்றாகும்: `` ஆல்பா``, `` பீட்டா``, `` rc``, `` இறுதி``. `` இறுதி`` எப்போதும் 0 ஐ கடைசி உறுப்பு எனக் கொண்டுள்ளது.

source: Before version 1.2, check the string ``sphinx.__version__``.
ta: பதிப்பு 1.2 க்கு முன், `` ஸ்பிங்க்ஸ் .__ பதிப்பு__`` என்ற சரத்தை சரிபார்க்கவும்.

source: The Config object
ta: கட்டமைப்பு பொருள்

source: Configuration file abstraction.
ta: உள்ளமைவு கோப்பு சுருக்கம்.

source: The Config object makes the values of all config options available as attributes.
ta: கட்டமைப்பு பொருள் அனைத்து கட்டமைப்பு விருப்பங்களின் மதிப்புகளையும் பண்புக்கூறுகளாகக் கிடைக்கும்.

source: It is exposed via the :py:class:`~sphinx.application.Sphinx`\ ``.config`` and :py:class:`sphinx.environment.BuildEnvironment`\ ``.config`` attributes. For example, to get the value of :confval:`language`, use either ``app.config.language`` or ``env.config.language``.
ta: இது: py: class: `~ sphinx.application.sphinx` \` `.config`` மற்றும்: py: class:` sphinx.enveronment.buildenveronment` \ `` .config`` பண்புக்கூறுகள் வழியாக இது வெளிப்படும். எடுத்துக்காட்டாக, மதிப்பைப் பெற: confval: `மொழி`,` `app.config.language`` அல்லது` `env.config.language`` ஐப் பயன்படுத்தவும்.

source: The template bridge
ta: வார்ப்புரு பாலம்

source: This class defines the interface for a "template bridge", that is, a class that renders templates given a template name and a context.
ta: இந்த வகுப்பு ஒரு "வார்ப்புரு பாலம்" க்கான இடைமுகத்தை வரையறுக்கிறது, அதாவது, வார்ப்புரு பெயர் மற்றும் சூழலைக் கொடுக்கப்பட்ட வார்ப்புருக்கள் வழங்கும் ஒரு வகுப்பு.

source: Called by the builder to initialize the template system.
ta: வார்ப்புரு அமைப்பைத் தொடங்க பில்டரால் அழைக்கப்படுகிறது.

source: *builder* is the builder object; you'll probably want to look at the value of ``builder.config.templates_path``.
ta: * பில்டர்* என்பது பில்டர் பொருள்; `` biolder.config.templates_path`` இன் மதிப்பைப் பார்க்க விரும்புவீர்கள்.

source: *theme* is a :class:`sphinx.theming.Theme` object or None; in the latter case, *dirs* can be list of fixed directories to look for templates.
ta: * தீம்* ஒரு: வகுப்பு: `sphinx.theming.theme` பொருள் அல்லது எதுவுமில்லை; பிந்தைய வழக்கில், * dirs * வார்ப்புருக்களைத் தேடுவதற்கு நிலையான கோப்பகங்களின் பட்டியலாக இருக்கலாம்.

source: Called by the builder to determine if output files are outdated because of template changes. Return the mtime of the newest template file that was changed. The default implementation returns ``0``.
ta: வார்ப்புரு மாற்றங்கள் காரணமாக வெளியீட்டு கோப்புகள் காலாவதியானதா என்பதை தீர்மானிக்க பில்டரால் அழைக்கப்படுகிறது. மாற்றப்பட்ட புதிய வார்ப்புரு கோப்பின் MTIME ஐத் தரவும். இயல்புநிலை செயல்படுத்தல் `` 0`` ஐ வழங்குகிறது.

source: Called by the builder to render a template given as a filename with a specified context (a Python dictionary).
ta: ஒரு குறிப்பிட்ட சூழலுடன் (பைதான் அகராதி) கோப்பு பெயராக வழங்கப்பட்ட ஒரு வார்ப்புருவை வழங்க பில்டரால் அழைக்கப்படுகிறது.

source: Called by the builder to render a template given as a string with a specified context (a Python dictionary).
ta: ஒரு குறிப்பிட்ட சூழலுடன் (பைதான் அகராதி) ஒரு சரமாக கொடுக்கப்பட்ட ஒரு வார்ப்புருவை வழங்க பில்டரால் அழைக்கப்படுகிறது.

source: Exceptions
ta: விதிவிலக்குகள்

source: Base class for Sphinx errors.
ta: ஸ்பின்க்ஸ் பிழைகளுக்கான அடிப்படை வகுப்பு.

source: This is the base class for "nice" exceptions. When such an exception is raised, Sphinx will abort the build and present the exception category and message to the user.
ta: "நல்ல" விதிவிலக்குகளுக்கான அடிப்படை வகுப்பு இது. அத்தகைய விதிவிலக்கு எழுப்பப்படும்போது, ஸ்பிங்க்ஸ் கட்டமைப்பை நிறுத்தி, விதிவிலக்கு வகை மற்றும் செய்தியை பயனருக்கு வழங்கும்.

source: Extensions are encouraged to derive from this exception for their custom errors.
ta: நீட்டிப்புகள் அவற்றின் தனிப்பயன் பிழைகளுக்கு இந்த விதிவிலக்கிலிருந்து பெற ஊக்குவிக்கப்படுகின்றன.

source: Exceptions *not* derived from :exc:`SphinxError` are treated as unexpected and shown to the user with a part of the traceback (and the full traceback saved in a temporary file).
ta: விதிவிலக்குகள் * இதிலிருந்து பெறப்படவில்லை: எக்ஸ்செர்: `ஸ்பின்க்செர்ர்` எதிர்பாராதது என்று கருதப்படுகிறது மற்றும் ட்ரேஸ்பேக்கின் ஒரு பகுதியைக் கொண்டு பயனருக்குக் காட்டப்படுகிறது (மற்றும் ஒரு தற்காலிக கோப்பில் சேமிக்கப்படுகிறது).

source: Description of the exception "category", used in converting the exception to a string ("category: message"). Should be set accordingly in subclasses.
ta: விதிவிலக்கு விதிவிலக்கின் விளக்கம், விதிவிலக்கை ஒரு சரத்திற்கு மாற்றுவதற்கு பயன்படுத்தப்படுகிறது ("வகை: செய்தி"). அதற்கேற்ப துணைப்பிரிவுகளில் அமைக்கப்பட வேண்டும்.

source: Configuration error.
ta: உள்ளமைவு பிழை.

source: Extension error.
ta: நீட்டிப்பு பிழை.

source: Theme error.
ta: தீம் பிழை.

source: Incompatible Sphinx version error.
ta: பொருந்தாத ஸ்பிங்க்ஸ் பதிப்பு பிழை.
