Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_usage--restructuredtext--basics_*.po
Languages: ta

source: reStructuredText Primer
ta: மறுசீரமைப்பு டெக்ஸ்ட் ப்ரைமர்

source: reStructuredText is the default plaintext markup language used by Sphinx. This section is a brief introduction to reStructuredText (reST) concepts and syntax, intended to provide authors with enough information to author documents productively. Since reStructuredText was designed to be a simple, unobtrusive markup language, this will not take too long.
ta: reStructuredText என்பது சூரரிமாச்சிலை பயன்படுத்தும் இயல்புநிலை எளிய உரை மார்க்அப் மொழியாகும். இந்தப் பகுதியானது, மறுகட்டமைக்கப்பட்ட உரை (reST) கருத்துக்கள் மற்றும் தொடரியல் பற்றிய சுருக்கமான அறிமுகமாகும், இது ஆவணங்களை தயாரிப்பதற்கு போதுமான தகவலை ஆசிரியர்களுக்கு வழங்குவதை நோக்கமாகக் கொண்டுள்ளது. reStructuredText ஒரு எளிய, தடையற்ற மார்க்அப் மொழியாக வடிவமைக்கப்பட்டுள்ளதால், இதற்கு அதிக நேரம் எடுக்காது.

source: The authoritative `reStructuredText User Documentation <https://docutils.sourceforge.io/rst.html>`_. The "ref" links in this document link to the description of the individual constructs in the reStructuredText reference.
ta: அதிகாரப்பூர்வ `மறுகட்டமைக்கப்பட்ட உரை பயனர் ஆவணம் <https://docutils.sourceforge.io/rst.html>`_. இந்த ஆவணத்தில் உள்ள "ref" இணைப்புகள், மறுகட்டமைக்கப்பட்ட உரை குறிப்பில் உள்ள தனிப்பட்ட கட்டுமானங்களின் விளக்கத்துடன் இணைக்கின்றன.

source: Paragraphs
ta: பத்திகள்

source: The paragraph (:duref:`ref <paragraphs>`) is the most basic block in a reStructuredText document. Paragraphs are simply chunks of text separated by one or more blank lines. As in Python, indentation is significant in reStructuredText, so all lines of the same paragraph must be left-aligned to the same level of indentation.
ta: மறுகட்டமைக்கப்பட்ட உரை ஆவணத்தில் பத்தி (:duref:`ref <paragraphs>`) மிகவும் அடிப்படைத் தொகுதியாகும். பத்திகள் என்பது ஒன்று அல்லது அதற்கு மேற்பட்ட வெற்று வரிகளால் பிரிக்கப்பட்ட உரையின் துகள்களாகும். பைத்தானைப் போலவே, மறுகட்டமைக்கப்பட்ட உரையில் உள்தள்ளல் குறிப்பிடத்தக்கது, எனவே ஒரே பத்தியின் அனைத்து வரிகளும் ஒரே அளவிலான உள்தள்ளலுக்கு இடது-சீரமைக்கப்பட வேண்டும்.

source: Inline markup
ta: இன்லைன் மார்க்அப்

source: The standard reStructuredText inline markup is quite simple: use
ta: நிலையான மறுகட்டமைக்கப்பட்ட உரை இன்லைன் மார்க்அப் மிகவும் எளிமையானது: பயன்படுத்தவும்

source: one asterisk: ``*text*`` for emphasis (italics),
ta: ஒரு நட்சத்திரம்: ``*உரை*`` வலியுறுத்தலுக்காக (சாய்வு),

source: two asterisks: ``**text**`` for strong emphasis (boldface), and
ta: இரண்டு நட்சத்திரங்கள்: `` ** உரை ** `` வலுவான முக்கியத்துவத்திற்கு (போல்ட்ஃபேஸ்), மற்றும்

source: backquotes: ````text```` for code samples.
ta: பின்னணி: குறியீடு மாதிரிகளுக்கு `` `` உரை````.

source: If asterisks or backquotes appear in running text and could be confused with inline markup delimiters, they have to be escaped with a backslash.
ta: இயங்கும் உரையில் நட்சத்திரங்கள் அல்லது பின்னணி தோன்றினால், இன்லைன் மார்க்அப் டிலிமிட்டர்களுடன் குழப்பமடையக்கூடும் என்றால், அவை பின்சாய்வுடன் தப்பிக்க வேண்டும்.

source: Be aware of some restrictions of this markup:
ta: இந்த மார்க்அப்பின் சில கட்டுப்பாடுகளைப் பற்றி எச்சரிக்கையாக இருங்கள்:

source: it may not be nested,
ta: அது கூடு கட்டப்படாமல் இருக்கலாம்,

source: content may not start or end with whitespace: ``* text*`` is wrong,
ta: உள்ளடக்கம் ஒயிட்ஸ்பேஸுடன் தொடங்கவோ முடிவடையவோ கூடாது: ``* உரை* `` தவறு,

source: it must be separated from surrounding text by non-word characters. Use a backslash escaped space to work around that: ``thisis\ *one*\ word``.
ta: இது சுற்றியுள்ள உரையிலிருந்து வார்த்தை அல்லாத எழுத்துக்களால் பிரிக்கப்பட வேண்டும். அதைச் சுற்றி வேலை செய்ய பின்சாய்வுக்கோடான தப்பித்த இடத்தைப் பயன்படுத்தவும்: `` இது \ *ஒன்று *\ சொல்``.

source: These restrictions may be lifted in future versions of the docutils.
ta: இந்த கட்டுப்பாடுகள் ஆவணங்களின் எதிர்கால பதிப்புகளில் உயர்த்தப்படலாம்.

source: It is also possible to replace or expand upon some of this inline markup with roles. Refer to :ref:`rst-roles` for more information.
ta: இந்த இன்லைன் மார்க்அப்பில் சிலவற்றை ரோல்களுடன் மாற்றுவது அல்லது விரிவாக்குவதும் சாத்தியமாகும். மேலும் தகவலுக்கு :ref:`rst-roles` ஐப் பார்க்கவும்.

source: Lists and Quote-like blocks
ta: பட்டியல்கள் மற்றும் மேற்கோள் போன்ற தொகுதிகள்

source: List markup (:duref:`ref <bullet-lists>`) is natural: just place an asterisk at the start of a paragraph and indent properly. The same goes for numbered lists; they can also be autonumbered using a ``#`` sign::
ta: பட்டியல் மார்க்அப் (: duref: `refe <புல்லட்-பட்டியல்களை>`) இயற்கையானது: ஒரு பத்தியின் தொடக்கத்தில் ஒரு நட்சத்திரத்தை வைத்து சரியாக உள்தள்ளுங்கள். எண்ணற்ற பட்டியல்களுக்கும் இதுவே செல்கிறது; ``#`` அடையாளம் ::

source: Nested lists are possible, but be aware that they must be separated from the parent list items by blank lines::
ta: உள்ளமைக்கப்பட்ட பட்டியல்கள் சாத்தியம், ஆனால் அவை பெற்றோர் பட்டியல் உருப்படிகளிலிருந்து வெற்று வரிகளால் பிரிக்கப்பட வேண்டும் என்பதை அறிந்து கொள்ளுங்கள் ::

source: Definition lists (:duref:`ref <definition-lists>`) are created as follows::
ta: வரையறை பட்டியல்கள் (: duref: `refe <வரையறை-பட்டியல்கள்>`) பின்வருமாறு உருவாக்கப்பட்டுள்ளன ::

source: Note that the term cannot have more than one line of text.
ta: இந்த வார்த்தையில் ஒன்றுக்கு மேற்பட்ட வரிகள் இருக்க முடியாது என்பதை நினைவில் கொள்க.

source: Quoted paragraphs (:duref:`ref <block-quotes>`) are created by just indenting them more than the surrounding paragraphs.
ta: மேற்கோள் காட்டப்பட்ட பத்திகள் (: duref: `refe <block-quotes>`) சுற்றியுள்ள பத்திகளைக் காட்டிலும் அவற்றை நிர்வகிப்பதன் மூலம் உருவாக்கப்படுகின்றன.

source: Line blocks (:duref:`ref <line-blocks>`) are a way of preserving line breaks::
ta: வரி தொகுதிகள் (: duref: `ref <வரி-தடங்கள்>`) வரி இடைவெளிகளைப் பாதுகாப்பதற்கான ஒரு வழியாகும் ::

source: There are also several more special blocks available:
ta: இன்னும் பல சிறப்பு தொகுதிகள் உள்ளன:

source: field lists (:duref:`ref <field-lists>`, with caveats noted in :ref:`rst-field-lists`)
ta: புலம் பட்டியல்கள் (: duref: `ref <field-lists>`, இதில் குறிப்பிடப்பட்ட எச்சரிக்கையுடன்: ref: `rst-field-lists`)

source: option lists (:duref:`ref <option-lists>`)
ta: விருப்பமான பட்டியல்கள் (: duref: `refe <விருப்பத்தேர்வுகள்>`)

source: quoted literal blocks (:duref:`ref <quoted-literal-blocks>`)
ta: மேற்கோள் காட்டப்பட்ட நேரடி தொகுதிகள் (: duref: `ref <மேற்கோள்-ஒளி-தொகுதிகள்>`)

source: doctest blocks (:duref:`ref <doctest-blocks>`)
ta: ஆவணத் தொகுதிகள் (: duref: `ref <doctest-blocks>`)

source: Literal blocks
ta: நேரடி தொகுதிகள்

source: Literal code blocks (:duref:`ref <literal-blocks>`) are introduced by ending a paragraph with the special marker ``::``. The literal block must be indented (and, like all paragraphs, separated from the surrounding ones by blank lines)::
ta: சிறப்பு குறியீடு தொகுதிகள் (: duref: `ref <iteral-blocks>`) சிறப்பு மார்க்கருடன் `` :: `` உடன் ஒரு பத்தியை முடிப்பதன் மூலம் அறிமுகப்படுத்தப்படுகின்றன. நேரடி தொகுதி உள்தள்ளப்பட வேண்டும் (மற்றும், எல்லா பத்திகளையும் போலவே, சுற்றியுள்ளவற்றிலிருந்து வெற்று கோடுகளால் பிரிக்கப்படுகிறது) ::

source: The handling of the ``::`` marker is smart:
ta: `` :: `` மார்க்கரின் கையாளுதல் புத்திசாலி:

source: If it occurs as a paragraph of its own, that paragraph is completely left out of the document.
ta: இது அதன் சொந்த பத்தியாக நிகழ்ந்தால், அந்த பத்தி ஆவணத்திலிருந்து முற்றிலும் விலகிவிட்டது.

source: If it is preceded by whitespace, the marker is removed.
ta: அதற்கு முன்னதாக வைட்ஸ்பேஸால், மார்க்கர் அகற்றப்படும்.

source: If it is preceded by non-whitespace, the marker is replaced by a single colon.
ta: அதற்கு முன்னதாக வெண்மையானது இருந்தால், மார்க்கர் ஒரு பெருங்குடலால் மாற்றப்படுகிறது.

source: That way, the second sentence in the above example's first paragraph would be rendered as "The next paragraph is a code sample:".
ta: அந்த வகையில், மேற்கண்ட உதாரணத்தின் முதல் பத்தியின் இரண்டாவது வாக்கியம் "அடுத்த பத்தி ஒரு குறியீடு மாதிரி:" என்று வழங்கப்படும்.

source: Code highlighting can be enabled for these literal blocks on a document-wide basis using the :rst:dir:`highlight` directive and on a project-wide basis using the :confval:`highlight_language` configuration option. The :rst:dir:`code-block` directive can be used to set highlighting on a block-by-block basis. These directives are discussed later.
ta: : Rst: dir: `சிறப்பம்சமாக` உத்தரவு மற்றும் திட்ட அளவிலான அடிப்படையில்: conflan:` fillance_language` உள்ளமைவு விருப்பத்தைப் பயன்படுத்தி இந்த நேரடி தொகுதிகளுக்கு குறியீடு சிறப்பம்சமாக இயக்கப்படலாம். தி: rst: dir: `கோட்-பிளாக்` உத்தரவு ஒரு தொகுதி-மூலம்-தொகுதி அடிப்படையில் சிறப்பம்சமாக அமைக்க பயன்படுத்தப்படலாம். இந்த வழிமுறைகள் பின்னர் விவாதிக்கப்படுகின்றன.

source: Doctest blocks
ta: ஆவணத் தொகுதிகள்

source: Doctest blocks (:duref:`ref <doctest-blocks>`) are interactive Python sessions cut-and-pasted into docstrings. They do not require the :ref:`literal blocks <rst-literal-blocks>` syntax. The doctest block must end with a blank line and should *not* end with an unused prompt::
ta: டாக்டெஸ்ட் தொகுதிகள் (: duref: `refe <doctest-blocks>`) ஊடாடும் பைதான் அமர்வுகள் டாக்ஸ்ட்ரிங்ஸில் வெட்டப்பட்டு செலுத்தப்படுகின்றன. அவர்களுக்கு தேவையில்லை: ref: `நேரடி தொகுதிகள் <rst-literal-blocks>` தொடரியல். ஆவணத் தொகுதி ஒரு வெற்று வரியுடன் முடிவடைய வேண்டும், மேலும் பயன்படுத்தப்படாத வரியில் * முடிவடையக்கூடாது ::

source: Tables
ta: அட்டவணைகள்

source: For *grid tables* (:duref:`ref <grid-tables>`), you have to "paint" the cell grid yourself. They look like this::
ta: * கட்டம் அட்டவணைகளுக்கு * (: duref: `refe <கட்டம்-அட்டவணைகள்>`), நீங்கள் செல் கட்டத்தை நீங்களே "வண்ணம் தீட்ட வேண்டும்". அவர்கள் இப்படி இருக்கிறார்கள் ::

source: *Simple tables* (:duref:`ref <simple-tables>`) are easier to write, but limited: they must contain more than one row, and the first column cells cannot contain multiple lines. They look like this::
ta: . அவர்கள் இப்படி இருக்கிறார்கள் ::

source: Two more syntaxes are supported: *CSV tables* and *List tables*. They use an *explicit markup block*. Refer to :ref:`table-directives` for more information.
ta: மேலும் இரண்டு தொடரியல் ஆதரிக்கப்படுகிறது: *CSV அட்டவணைகள் *மற்றும் *பட்டியல் அட்டவணைகள் *. அவர்கள் *வெளிப்படையான மார்க்அப் பிளாக் *ஐப் பயன்படுத்துகிறார்கள். பார்க்கவும்: ref: `அட்டவணை-இயக்குநர்கள்` மேலும் தகவலுக்கு.

source: Hyperlinks
ta: ஹைப்பர்லிங்க்கள்

source: External links
ta: வெளி இணைப்புகள்

source: URLs and email addresses in text are automatically linked and do not need explicit markup at all. For example, https://domain.invalid/ is written with no special markup in the source of this document, and is recognised as an external hyperlink.
ta: உரையில் உள்ள URLகள் மற்றும் மின்னஞ்சல் முகவரிகள் தானாக இணைக்கப்பட்டு, வெளிப்படையான மார்க்அப் தேவையில்லை. எடுத்துக்காட்டாக, https://domain.invalid/ இந்த ஆவணத்தின் மூலத்தில் சிறப்பு மார்க்அப் இல்லாமல் எழுதப்பட்டுள்ளது, மேலும் இது வெளிப்புற ஐப்பர்லிங்காக அங்கீகரிக்கப்பட்டுள்ளது.

source: To create text with a link, the best approach is generally to put the URL below the paragraph as follows (:duref:`ref <hyperlink-targets>`)::
ta: இணைப்புடன் உரையை உருவாக்க, முகவரி ஐப் பத்தியின் கீழே பின்வருமாறு வைப்பதே சிறந்த அணுகுமுறையாகும் (:duref:`ref <hyperlink-targets>`)::

source: This keeps the paragraph more readable in source code.
ta: This keeps the பத்தி more readable in மூலம் code.

source: Alternatively, you can embed the URL within the prose for an 'inline link'. This can lead to longer lines, but has the benefit of keeping the link text and the URL pointed to in the same place. This uses the following syntax: ```Link text <https://domain.invalid/>`__`` (:duref:`ref <embedded-uris-and-aliases>`).
ta: மாற்றாக, 'இன்லைன் லிங்க்'க்காக உரைநடைக்குள் முகவரி ஐ உட்பொதிக்கலாம். இது நீண்ட வரிகளுக்கு வழிவகுக்கும், ஆனால் இணைப்பு உரை மற்றும் முகவரி ஐ ஒரே இடத்தில் வைத்திருப்பதன் பலன் உள்ளது. இது பின்வரும் தொடரியல் பயன்படுத்துகிறது: ```இணைப்பு உரை <https://domain.invalid/>`__`` (:duref:`ref <embedded-uris-and-aliases>`).

source: There must be a space between the link text and the opening angle bracket ('``<``') for the URL.
ta: URLக்கான இணைப்பு உரைக்கும் தொடக்கக் கோண அடைப்புக்குறிக்கும் ('``<``') இடையே இடைவெளி இருக்க வேண்டும்.

source: Use two trailing underscores when embedding the URL. Technically, a single underscore works as well, but that would create a named reference instead of an anonymous one. Named references typically do not have a benefit when the URL is embedded. Moreover, they have the disadvantage that you must make sure that you do not use the same "Link text" for another link in your document.
ta: முகவரி ஐ உட்பொதிக்கும்போது இரண்டு அடிக்கோடிட்டுகளைப் பயன்படுத்தவும். தொழில்நுட்ப ரீதியாக, ஒரு அடிக்கோடிடும் வேலை செய்கிறது, ஆனால் அது அநாமதேயத்திற்குப் பதிலாக பெயரிடப்பட்ட குறிப்பை உருவாக்கும். முகவரி உட்பொதிக்கப்படும் போது பெயரிடப்பட்ட குறிப்புகளுக்குப் பொதுவாகப் பலன் இருக்காது. மேலும், உங்கள் ஆவணத்தில் உள்ள மற்றொரு இணைப்பிற்கு அதே "இணைப்பு உரையை" நீங்கள் பயன்படுத்தவில்லை என்பதை உறுதிப்படுத்த வேண்டிய குறைபாடு அவர்களுக்கு உள்ளது.

source: You can also separate the link and the target definition (:duref:`ref <hyperlink-targets>`), like this::
ta: நீங்கள் இணைப்பு மற்றும் இலக்கு வரையறையையும் பிரிக்கலாம் (: duref: `refe <hyperlink-targets>`), இது போன்றது ::

source: Internal links
ta: உள் இணைப்புகள்

source: Internal linking is done via a special reStructuredText role provided by Sphinx, see the section on specific markup, :ref:`ref-role`.
ta: சூரரிமாச்சிலை வழங்கிய சிறப்பு மறுசீரமைக்கப்பட்ட உரைப் பாத்திரத்தின் மூலம் உள் இணைப்பு செய்யப்படுகிறது, குறிப்பிட்ட மார்க்அப்பில் உள்ள பகுதியைப் பார்க்கவும், :ref:`ref-role`.

source: Sections
ta: பிரிவுகள்

source: Section headers (:duref:`ref <sections>`) are created by underlining (and optionally overlining) the section title with a punctuation character, at least as long as the text::
ta: பிரிவு தலைப்புகள் (: duref: `ref <பிரிவுகள்>`) ஒரு நிறுத்தற்குறியுடன் பிரிவு தலைப்பை அடிக்கோடிட்டுக் காட்டுவதன் மூலம் (மற்றும் விருப்பமாக மீறுவது) உருவாக்கப்படுகின்றன, குறைந்தபட்சம் உரை ::

source: Normally, there are no heading levels assigned to certain characters as the structure is determined from the succession of headings. However, this convention is used in `Python Developer's Guide for documenting <https://devguide.python.org/documentation/markup/#sections>`_ which you may follow:
ta: பொதுவாக, சில எழுத்துக்களுக்கு தலைப்பு நிலைகள் ஒதுக்கப்படவில்லை, ஏனெனில் கட்டமைப்பு தலைப்புகளின் தொடர்ச்சியில் இருந்து தீர்மானிக்கப்படுகிறது. இருப்பினும், இந்த மாநாடு `பைதான் டெவலப்பரின் வழிகாட்டியில் <https://devguide.python.org/documentation/markup/#sections>` _ நீங்கள் பின்பற்றலாம்:

source: ``#`` with overline, for parts
ta: ``#`` `ஓவர்லைனுடன், பகுதிகளுக்கு

source: ``*`` with overline, for chapters
ta: ``*`` அத்தியாயங்களுக்கு ஓவர்லைனுடன்

source: ``=`` for sections
ta: பிரிவுகளுக்கு `` = ``

source: ``-`` for subsections
ta: துணைப்பிரிவுகளுக்கு `` -``

source: ``^`` for subsubsections
ta: ``^`` துணை

source: ``"`` for paragraphs
ta: `` "` `பத்திகளுக்கு

source: Of course, you are free to use your own marker characters (see the reStructuredText documentation), and use a deeper nesting level, but keep in mind that most target formats (HTML, LaTeX) have a limited supported nesting depth.
ta: நிச்சயமாக, நீங்கள் உங்கள் சொந்த குறிப்பான் எழுத்துக்களைப் பயன்படுத்த சுதந்திரமாக இருக்கிறீர்கள் (மறுகட்டமைக்கப்பட்ட உரை ஆவணங்களைப் பார்க்கவும்), மேலும் ஆழமான கூடு கட்டும் அளவைப் பயன்படுத்தவும், ஆனால் பெரும்பாலான இலக்கு வடிவங்கள் (HTML, LaTeX) வரையறுக்கப்பட்ட உதவி கூடு ஆழத்தைக் கொண்டுள்ளன என்பதை நினைவில் கொள்ளுங்கள்.

source: Field Lists
ta: புல பட்டியல்கள்

source: Field lists (:duref:`ref <field-lists>`) are sequences of fields marked up like this::
ta: புலம் பட்டியல்கள் (: duref: `ref <field-lists>`) இது போன்ற குறிக்கப்பட்ட புலங்களின் வரிசைகள் ::

source: They are commonly used in Python documentation::
ta: அவை பொதுவாக பைதான் ஆவணத்தில் பயன்படுத்தப்படுகின்றன ::

source: Sphinx extends standard docutils behavior and intercepts field lists specified at the beginning of documents. Refer to :doc:`field-lists` for more information.
ta: SPHINX நிலையான ஆவணங்களின் நடத்தை மற்றும் ஆவணங்களின் தொடக்கத்தில் குறிப்பிடப்பட்ட புல பட்டியல்களை இடைமறிக்கிறது. பார்க்கவும்: DOC: `புலம்-பட்டியல்கள்` மேலும் தகவலுக்கு.

source: Roles
ta: பாத்திரங்கள்

source: A role or "custom interpreted text role" (:dupage:`ref <roles>`) is an inline piece of explicit markup. It signifies that the enclosed text should be interpreted in a specific way. Sphinx uses this to provide semantic markup and cross-referencing of identifiers, as described in the appropriate section. The general syntax is ``:rolename:`content```.
ta: ஒரு பாத்திரம் அல்லது "தனிப்பயன் உரைப் பாத்திரம்" (:dupage:`ref <roles>`) என்பது வெளிப்படையான மார்க்அப்பின் இன்லைன் பகுதி. இணைக்கப்பட்ட உரை ஒரு குறிப்பிட்ட வழியில் விளக்கப்பட வேண்டும் என்பதை இது குறிக்கிறது. பொருத்தமான பிரிவில் விவரிக்கப்பட்டுள்ளபடி, அடையாளங்காட்டிகளின் சொற்பொருள் மார்க்அப் மற்றும் குறுக்கு-குறிப்பை வழங்க சூரரிமாச்சிலை இதைப் பயன்படுத்துகிறது. பொதுவான தொடரியல் ``:rolename:`content```.

source: Docutils supports the following roles:
ta: பின்வரும் பாத்திரங்களை டாக்டில்ஸ் ஆதரிக்கிறது:

source: :durole:`emphasis` -- equivalent of ``*emphasis*``
ta: : துரோல்: `வலியுறுத்தல்` -` `*முக்கியத்துவம்*` `

source: :durole:`strong` -- equivalent of ``**strong**``
ta: : துரோல்: `வலுவான` -` `** வலுவான **` `க்கு சமம்

source: :durole:`literal` -- equivalent of ````literal````
ta: : துரோல்: `லிட்டரல்` -

source: :durole:`subscript` -- subscript text
ta: : துரோல்: `சந்தா` - சந்தா உரை

source: :durole:`superscript` -- superscript text
ta: : துரோல்: `சூப்பர்ஸ்கிரிப்ட்` - சூப்பர்ஸ்கிரிப்ட் உரை

source: :durole:`title-reference` -- for titles of books, periodicals, and other materials
ta: : துரோல்: `தலைப்பு-குறிப்பு`-புத்தகங்கள், கால இடைவெளிகள் மற்றும் பிற பொருட்களின் தலைப்புகளுக்கு

source: Refer to :doc:`roles` for roles added by Sphinx.
ta: பார்க்கவும்: டிஓசி: ஸ்பின்க்ஸால் சேர்க்கப்பட்ட பாத்திரங்களுக்கான `பாத்திரங்கள்`.

source: Explicit Markup
ta: வெளிப்படையான மார்க்அப்

source: "Explicit markup" (:duref:`ref <explicit-markup-blocks>`) is used in reStructuredText for most constructs that need special handling, such as footnotes, specially-highlighted paragraphs, comments, and generic directives.
ta: "வெளிப்படையான மார்க்அப்" (:duref:`ref <explicit-markup-blocks>`) என்பது அடிக்குறிப்புகள், சிறப்பாக-உயர்த்தப்பட்ட பத்திகள், கருத்துகள் மற்றும் பொதுவான வழிமுறைகள் போன்ற சிறப்பு கையாளுதல் தேவைப்படும் பெரும்பாலான கட்டுமானங்களுக்கு மறுகட்டமைக்கப்பட்ட உரையில் பயன்படுத்தப்படுகிறது.

source: An explicit markup block begins with a line starting with ``..`` followed by whitespace and is terminated by the next paragraph at the same level of indentation. (There needs to be a blank line between explicit markup and normal paragraphs. This may all sound a bit complicated, but it is intuitive enough when you write it.)
ta: ஒரு வெளிப்படையான மார்க்அப் தொகுதி `` ..` உடன் தொடங்கி ஒரு வரியுடன் தொடங்குகிறது, அதைத் தொடர்ந்து வைட்ஸ்பேஸைத் தொடர்ந்து, அடுத்த பத்தியால் அதே அளவிலான உள்தள்ளலில் நிறுத்தப்படுகிறது. (வெளிப்படையான மார்க்அப் மற்றும் சாதாரண பத்திகளுக்கு இடையில் ஒரு வெற்று வரி இருக்க வேண்டும். இவை அனைத்தும் சற்று சிக்கலானதாகத் தோன்றலாம், ஆனால் நீங்கள் அதை எழுதும்போது இது போதுமான உள்ளுணர்வு.)

source: Directives
ta: வழிமுறைகள்

source: A directive (:duref:`ref <directives>`) is a generic block of explicit markup. Along with roles, it is one of the extension mechanisms of reStructuredText, and Sphinx makes heavy use of it.
ta: ஒரு கட்டளை (:duref:`ref <directives>`) என்பது வெளிப்படையான மார்க்அப்பின் பொதுவான தொகுதி. பாத்திரங்களுடன், இது மறுகட்டமைக்கப்பட்ட உரையின் நீட்டிப்பு வழிமுறைகளில் ஒன்றாகும், மேலும் சூரரிமாச்சிலை அதை அதிக அளவில் பயன்படுத்துகிறது.

source: Docutils supports the following directives:
ta: டாக்யூடில்ஸ் பின்வரும் வழிமுறைகளை ஆதரிக்கிறது:

source: Admonitions: :dudir:`attention`, :dudir:`caution`, :dudir:`danger`, :dudir:`error`, :dudir:`hint`, :dudir:`important`, :dudir:`note`, :dudir:`tip`, :dudir:`warning` and the generic :dudir:`admonition <admonitions>`. (Most themes style only "note" and "warning" specially.)
ta: அறிவுரைகள் :: டுடிர்: `கவனம்`,: டுடிர்:` எச்சரிக்கை`,: டுடிர்: `ஆபத்து`,: டுடிர்:` பிழை`,: துடிர்: `ஹின்ட்`,: டுடிர்:` முக்கியமானது`,: `குறிப்பு` குறிப்பு` . (பெரும்பாலான தீம்கள் பாணி மட்டுமே "குறிப்பு" மற்றும் "எச்சரிக்கை" குறிப்பாக.)

source: Images:
ta: படங்கள்:

source: :dudir:`image` (see also Images_ below)
ta: : dudir: `படம்` (கீழே உள்ள படங்களையும் காண்க_ கீழே)

source: :dudir:`figure` (an image with caption and optional legend)
ta: : டுடிர்: `படம்` (தலைப்பு மற்றும் விருப்ப புராணத்துடன் ஒரு படம்)

source: Additional body elements:
ta: கூடுதல் உடல் கூறுகள்:

source: :dudir:`contents <table-of-contents>` (a local, i.e. for the current file only, table of contents)
ta: :dudir:`contents <table-of-contents>` (உள்ளூர், அதாவது தற்போதைய கோப்பிற்கு மட்டும், உள்ளடக்க அட்டவணை)

source: :dudir:`container` (a container with a custom class, useful to generate an outer ``<div>`` in HTML)
ta: : dudir: `கொள்கலன்` (தனிப்பயன் வகுப்பைக் கொண்ட ஒரு கொள்கலன், HTML இல் வெளிப்புறத்தை உருவாக்க பயனுள்ளதாக இருக்கும்)

source: :dudir:`rubric` (a heading without relation to the document sectioning)
ta: : டுடிர்: `ரப்ரிக்` (ஆவண பிரிவுடன் தொடர்பு இல்லாத ஒரு தலைப்பு)

source: :dudir:`topic`, :dudir:`sidebar` (special highlighted body elements)
ta: :dudir:`topic`, :dudir:`sidebar` (சிறப்பு தனிப்படுத்தப்பட்ட உடல் உறுப்புகள்)

source: :dudir:`parsed-literal` (literal block that supports inline markup)
ta: : டுடிர்: `பாகுபடுத்தப்பட்ட-லிட்டரல்` (இன்லைன் மார்க்அப்பை ஆதரிக்கும் நேரடி தொகுதி)

source: :dudir:`epigraph` (a block quote with optional attribution line)
ta: : டுடிர்: `எபிகிராஃப்` (விருப்ப பண்புக்கூறு வரியுடன் ஒரு தொகுதி மேற்கோள்)

source: :dudir:`highlights`, :dudir:`pull-quote` (block quotes with their own class attribute)
ta: :duder:`highlights`, :duder:`pullquote` (அவற்றின் சொந்த வகுப்பு பண்புடன் மேற்கோள்களைத் தடு)

source: :dudir:`compound <compound-paragraph>` (a compound paragraph)
ta: : dudir: `கலவை <கூட்டு-பத்தி>` (ஒரு கூட்டு பத்தி)

source: Special tables:
ta: சிறப்பு அட்டவணைகள்:

source: :dudir:`table` (a table with title)
ta: : dudir: `அட்டவணை` (தலைப்புடன் ஒரு அட்டவணை)

source: :dudir:`csv-table` (a table generated from comma-separated values)
ta: : டுடிர்: `சி.எஸ்.வி-டேபிள்` (கமாவால் பிரிக்கப்பட்ட மதிப்புகளிலிருந்து உருவாக்கப்பட்ட அட்டவணை)

source: :dudir:`list-table` (a table generated from a list of lists)
ta: : dudir: `பட்டியல்-அட்டவணை` (பட்டியல்களின் பட்டியலிலிருந்து உருவாக்கப்பட்ட அட்டவணை)

source: Special directives:
ta: சிறப்பு வழிமுறைகள்:

source: :dudir:`raw <raw-data-pass-through>` (include raw target-format markup)
ta: :dudir:`raw <raw-data-pass-through>` (raw target-format markup அடங்கும்)

source: :dudir:`include` (include reStructuredText from another file) -- in Sphinx, when given an absolute include file path, this directive takes it as relative to the source directory
ta: :dudir:`include` (மற்றொரு கோப்பிலிருந்து மறுகட்டமைக்கப்பட்ட உரையை உள்ளடக்கியது) -- சூரரிமாச்சிலை இல், ஒரு முழுமையான அடங்கும் கோப்பு பாதையை வழங்கினால், இந்த கட்டளை அதை மூல கோப்பகத்துடன் ஒப்பிடும்.

source: :dudir:`class <setting-class-attributes>` (assign a class attribute to the next element)
ta: :dudir:`class <setting-class-attributes>` (அடுத்த உறுப்புக்கு வகுப்பு பண்புக்கூறை ஒதுக்கவும்)

source: When the default domain contains a ``class`` directive, this directive will be shadowed. Therefore, Sphinx re-exports it as ``rst-class``.
ta: இயல்புநிலை டொமைனில் `` வகுப்பு`` உத்தரவு இருக்கும்போது, இந்த உத்தரவு நிழலாடப்படும். எனவே, ஸ்பிங்க்ஸ் அதை `` rst- வகுப்பு`` என்று மீண்டும் ஏற்றுமதி செய்கிறது.
