Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_man--sphinx-autogen_*.po
Languages: ta

source: sphinx-autogen
ta: ஸ்பின்க்ஸ்-ஆட்டோஜென்

source: Synopsis
ta: சுருக்கம்

source: **sphinx-autogen** [*options*] <sourcefile> ...
ta: ** Sphinx-autogen ** [*விருப்பங்கள்*] <மூலப்பொருள்> ...

source: Description
ta: விளக்கம்

source: :program:`sphinx-autogen` is a tool for automatic generation of Sphinx sources that, using the :py:mod:`~sphinx.ext.autodoc` extension, document items included in :rst:dir:`autosummary` listing(s).
ta: :program:`sphinx-autogen` is a tool for automatic generation of Sphinx sources that, using the :py:mod:`~sphinx.ext.autodoc` extension, document items included in :rst:dir:`autosummary` listing(கள்).

source: *sourcefile* is the path to one or more reStructuredText documents containing :rst:dir:`autosummary` entries with the ``:toctree:`` option set. *sourcefile* can be an :py:mod:`fnmatch`-style pattern.
ta: *sourcefile* என்பது ``:toctree:`` விருப்பத் தொகுப்புடன் :rst:dir:`autosummary` உள்ளீடுகளைக் கொண்ட ஒன்று அல்லது அதற்கு மேற்பட்ட மறுகட்டமைக்கப்பட்ட உரை ஆவணங்களுக்கான பாதையாகும். *sourcefile* ஒரு :py:mod:`fnmatch`-பாணி வடிவமாக இருக்கலாம்.

source: Options
ta: விருப்பங்கள்

source: Directory to place the output file. If it does not exist, it is created. Defaults to the value passed to the ``:toctree:`` option.
ta: வெளியீட்டு கோப்பை வைக்க அடைவு. அது இல்லை என்றால், அது உருவாக்கப்பட்டது. ``: Toctree: `` விருப்பத்திற்கு அனுப்பப்பட்ட மதிப்பின் இயல்புநிலை.

source: Default suffix to use for generated files. Defaults to ``rst``.
ta: உருவாக்கப்பட்ட கோப்புகளுக்கு பயன்படுத்த இயல்புநிலை பின்னொட்டு. இயல்புநிலை `` rst``.

source: Custom template directory. Defaults to ``None``.
ta: தனிப்பயன் வார்ப்புரு அடைவு. இயல்புநிலை `` எதுவுமில்லை``.

source: Document imported members.
ta: இறக்குமதி செய்யப்பட்ட உறுப்பினர்கள் ஆவணம்.

source: Document exactly the members in a module's ``__all__`` attribute.
ta: ஒரு தொகுதியின் `` __all__`` பண்புக்கூறில் உறுப்பினர்களை சரியாக ஆவணப்படுத்தவும்.

source: Remove existing files in the output directory that are not generated anymore.
ta: வெளியீட்டு கோப்பகத்தில் உருவாக்கப்படாத கோப்புகளை அகற்றவும்.

source: Example
ta: உதாரணமாக

source: Given the following directory structure::
ta: பின்வரும் அடைவு கட்டமைப்பைக் கொடுத்தால் ::

source: and assuming ``docs/index.rst`` contained the following:
ta: மற்றும் `` டாக்ஸ்/இன்டெக்ஸ்.ர்ஸ்ட்` `பின்வருவனவற்றைக் கொண்டுள்ளது என்று வைத்துக் கொள்ளுங்கள்:

source: If you run the following:
ta: நீங்கள் பின்வருவனவற்றை இயக்கினால்:

source: then the following stub files will be created in ``docs``::
ta: பின்வரும் ஸ்டப் கோப்புகள் `` டாக்ஸ்`` :: இல் உருவாக்கப்படும்

source: and each of those files will contain a :py:mod:`~sphinx.ext.autodoc` directive and some other information.
ta: அந்த கோப்புகளில் ஒவ்வொன்றும் A: PY: MOD: `~ sphinx.ext.autodoc` உத்தரவு மற்றும் வேறு சில தகவல்கள் இருக்கும்.

source: See also
ta: மேலும் காண்க
