Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_usage--extensions--autodoc_*.po
Languages: ta

source: :mod:`sphinx.ext.autodoc` -- Include documentation from docstrings
ta: : மோட்: `sphinx.ext.autodoc` - டாக்ச்ட்ரிங்சிலிருந்து ஆவணங்களைச் சேர்க்கவும்

source: This extension can import the modules you are documenting, and pull in documentation from docstrings in a semi-automatic way.
ta: இந்த நீட்டிப்பு நீங்கள் ஆவணப்படுத்தும் தொகுதிகளை இறக்குமதி செய்யலாம், மேலும் டாக்ச்ட்ரிங்சிலிருந்து அரை தானியங்கி வழியில் ஆவணங்களை இழுக்கலாம்.

source: :mod:`~sphinx.ext.autodoc` **imports** the modules to be documented. If any modules have side effects on import, these will be executed by ``autodoc`` when :program:`sphinx-build` is run.
ta: :mod:`~sphinx.ext.autodoc` **imports** the தொகுதிகள் பெறுநர் be documented. If any தொகுதிகள் have பக்கம் effects on import, these will be executed by ``autodoc`` when :program:`sphinx-build` is run.

source: If you document scripts (as opposed to library modules), make sure that the main routine is protected by an ``if __name__ == '__main__'`` condition.
ta: நீங்கள் ச்கிரிப்ட்களை ஆவணப்படுத்தினால் (லைப்ரரி மாட்யூல்களுக்கு மாறாக), முக்கிய வழக்கம் ``if __name__ == '__main__'`` நிபந்தனையால் பாதுகாக்கப்படுவதை உறுதிசெய்யவும்.

source: For this to work, the docstrings must of course be written in correct reStructuredText. You can then use all of the usual Sphinx markup in the docstrings, and it will end up correctly in the documentation. Together with hand-written documentation, this technique eases the pain of having to maintain two locations for documentation, while at the same time avoiding auto-generated-looking pure API documentation.
ta: இது வேலை செய்ய, டாக்ச்ட்ரிங்ச் நிச்சயமாக சரியான மறுகட்டமைக்கப்பட்ட உரையில் எழுதப்பட வேண்டும். நீங்கள் டாக்ச்ட்ரிங்கில் வழக்கமான சூரரிமாச்சிலை மார்க்அப் அனைத்தையும் பயன்படுத்தலாம், அது ஆவணத்தில் சரியாக முடிவடையும். கையால் எழுதப்பட்ட ஆவணங்களுடன், இந்த நுட்பம் ஆவணப்படுத்தலுக்காக இரண்டு இடங்களை பராமரிக்க வேண்டிய வலியை எளிதாக்குகிறது, அதே நேரத்தில் தானாக உருவாக்கப்படும் தூய பநிஇ ஆவணங்களைத் தவிர்க்கிறது.

source: If you prefer `NumPy`_ or `Google`_ style docstrings over reStructuredText, you can also enable the :mod:`napoleon <sphinx.ext.napoleon>` extension. :mod:`!napoleon` is a preprocessor that converts docstrings to correct reStructuredText before ``autodoc`` processes them.
ta: மறுகட்டமைக்கப்பட்ட உரையை விட `NumPy`_ அல்லது `Google`_ பாணி ஆவணங்களை நீங்கள் விரும்பினால், நீங்கள் :mod:`napoleon <sphinx.ext.napolon>` நீட்டிப்பையும் இயக்கலாம். :mod:`!napolon` என்பது ஒரு முன்செயலி ஆகும், இது டாக்ச்ட்ரிங்சை ``autodoc`` செயலாக்குவதற்கு முன் மறுகட்டமைக்கப்பட்ட உரையை சரிசெய்யும்.

source: Getting started
ta: தொடங்குதல்

source: Setup
ta: அமைவு

source: Activate the plugin by adding ``'sphinx.ext.autodoc'`` to the :confval:`extensions` list in :file:`conf.py`:
ta: :file:`conf.py` இல் உள்ள :confval:`extensions` பட்டியலில் ``'sphinx.ext.autodoc'`` சேர்ப்பதன் மூலம் செருகுநிரலைச் செயல்படுத்தவும்:

source: Ensuring the code can be imported
ta: குறியீட்டை இறக்குமதி செய்ய முடியும் என்பதை உறுதிப்படுத்துகிறது

source: :mod:`~sphinx.ext.autodoc` analyses the code and docstrings by introspection after **importing the modules**. For importing to work, you have to make sure that your modules can be found by Sphinx and that dependencies can be resolved (if your module does ``import foo``, but ``foo`` is not available in the python environment that Sphinx runs in, your module import will fail).
ta: :mod:`~sphinx.ext.autodoc` **தொகுதிகளை இறக்குமதி செய்த பிறகு** சுயபரிசோதனை மூலம் குறியீடு மற்றும் ஆவணங்களை பகுப்பாய்வு செய்கிறது. வேலை செய்ய இறக்குமதி செய்ய, உங்கள் தொகுதிகள் ச்பிங்க்சால் கண்டுபிடிக்கப்படுவதையும், சார்புநிலைகள் தீர்க்கப்படுவதையும் உறுதிசெய்ய வேண்டும் (உங்கள் தொகுதி ``இறக்குமதி foo`` செய்தால், ஆனால் ``foo`` சூரரிமாச்சிலை இயங்கும் பைதான் சூழலில் இல்லை, உங்கள் தொகுதி இறக்குமதி தோல்வியடையும்).

source: There are two ways to ensure this:
ta: இதை உறுதிப்படுத்த இரண்டு வழிகள் உள்ளன:

source: Use an environment that contains your package and Sphinx. This can e.g. be your local development environment (with an editable install), or an environment in CI in which you install Sphinx and your package. The regular installation process ensures that your package can be found by Sphinx and that all dependencies are available.
ta: உங்கள் தொகுப்பு மற்றும் ச்பிங்க்சைக் கொண்டிருக்கும் சூழலைப் பயன்படுத்தவும். இது எ.கா. உங்கள் உள்ளக மேம்பாட்டுச் சூழலாக (திருத்தக்கூடிய நிறுவலுடன்) அல்லது தொஒ இல் நீங்கள் சூரரிமாச்சிலை மற்றும் உங்கள் தொகுப்பை நிறுவும் சூழலாக இருங்கள். வழக்கமான நிறுவல் செயல்முறையானது உங்கள் தொகுப்பை சூரரிமாச்சிலை ஆல் கண்டறிய முடியும் மற்றும் அனைத்து சார்புகளும் உள்ளன என்பதை உறுதி செய்கிறது.

source: It is alternatively possible to patch the Sphinx run so that it can operate directly on the sources; e.g. if you want to be able to do a Sphinx build from a source checkout.
ta: சூரரிமாச்சிலை ரன்னை ஒட்டு செய்வது மாற்றாக சாத்தியமாகும், இதனால் அது ஆதாரங்களில் நேரடியாக செயல்பட முடியும்; எ.கா. நீங்கள் ஒரு மூல செக் அவுட்டில் இருந்து சூரரிமாச்சிலை உருவாக்கத்தை செய்ய விரும்பினால்.

source: Patch :data:`sys.path` in :file:`conf.py` to include your source path. For example if you have a repository structure with :file:`doc/conf.py` and your package is at :file:`src/my_package`, then you should add the following to your :file:`conf.py`.
ta: உங்கள் மூலப் பாதையைச் சேர்க்க :file:`conf.py` இல் :data:`sys.path` ஐ இணைக்கவும். எடுத்துக்காட்டாக, உங்களிடம் :file:`doc/conf.py` உடன் ஒரு களஞ்சிய அமைப்பு இருந்தால் மற்றும் உங்கள் தொகுப்பு :file:`src/my_package` இல் இருந்தால், பின்வருவனவற்றை உங்கள் :file:`conf.py` இல் சேர்க்க வேண்டும்.

source: To cope with missing dependencies, specify the missing modules in the :confval:`autodoc_mock_imports` setting.
ta: விடுபட்ட சார்புகளை சமாளிக்க, விடுபட்ட தொகுதிகளை :confval:`autodoc_mock_imports` அமைப்பில் குறிப்பிடவும்.

source: Usage
ta: பயன்பாடு

source: You can now use the :ref:`autodoc-directives` to add formatted documentation for Python code elements like functions, classes, modules, etc. For example, to document the function ``io.open()``, reading its signature and docstring from the source file, you'd write:
ta: நீங்கள் இப்போது :ref:`autodoc-directives` ஐப் பயன்படுத்தி, செயல்பாடுகள், வகுப்புகள், தொகுதிகள் போன்ற பைதான் குறியீடு கூறுகளுக்கு வடிவமைக்கப்பட்ட ஆவணங்களைச் சேர்க்கலாம். எடுத்துக்காட்டாக, `io.open()`` செயல்பாட்டை ஆவணப்படுத்த, அதன் கையொப்பம் மற்றும் மூலக் கோப்பில் இருந்து ஆவணத்தைப் படித்து, நீங்கள் எழுதலாம்:

source: You can also document whole classes or even modules automatically, using member options for the auto directives, like:
ta: தானியங்கு உத்தரவுகளுக்கான உறுப்பினர் விருப்பங்களைப் பயன்படுத்தி, முழு வகுப்புகளையும் அல்லது தொகுதிக்கூறுகளையும் தானாக ஆவணப்படுத்தலாம்:

source: As a hint to autodoc extension, you can put a ``::`` separator between the module name and the object name to let autodoc know the correct module, if it is ambiguous:
ta: ஆட்டோடாக் நீட்டிப்புக்கான குறியீடாக, மாட்யூலின் பெயருக்கும் பொருளின் பெயருக்கும் இடையில் ``::`` பிரிப்பானைப் போடலாம், அது தெளிவற்றதாக இருந்தால், சரியான தொகுதியை autodocக்கு தெரியப்படுத்தலாம்:

source: Marking objects as public or private
ta: பொருட்களை பொது அல்லது தனிப்பட்டதாகக் குறிப்பது

source: autodoc considers a member private if its docstring contains ``:meta private:`` in its :ref:`info-field-lists`. For example:
ta: ஆட்டோடோக் ஒரு உறுப்பினரை அதன் ஆவணத்தில் ``: மேவு பிரைவேட்: `` அதன்: ref: `தகவல்-புலம்-பட்டியல்கள்` இருந்தால் தனிப்பட்டதாக கருதுகிறது. உதாரணத்திற்கு:

source: autodoc considers a member public if its docstring contains ``:meta public:`` in its :ref:`info-field-lists`, even if it starts with an underscore. For example:
ta: ஆட்டோடோக் ஒரு உறுப்பினர் அதன் ஆவணத்தில் ``: மேவு பப்ளிக்: `` அதன்: குறிப்பு: `தகவல்-புலம்-பட்டியல்கள்` என்றால், அது ஒரு அடிக்கோடிட்டுக் கொண்டாலும் கூட, அது பொது பொதுவைக் கருதுகிறது. உதாரணத்திற்கு:

source: autodoc considers a variable member does not have any default value if its docstring contains ``:meta hide-value:`` in its :ref:`info-field-lists`. Example:
ta: ஒரு மாறி உறுப்பினருக்கு அதன் டாக்ச்ட்ரிங்கில் ``: மேவு மறைவிடம்-மதிப்பு: `` அதன்: re: `தகவல்-புல-பட்டியல்கள்` என்றால் எந்த இயல்புநிலை மதிப்பும் இல்லை என்று ஆட்டோடோக் கருதுகிறது. உதாரணமாக:

source: Doc comments and docstrings
ta: ஆவணக் கருத்துகள் மற்றும் ஆவணங்கள்

source: Python has no built-in support for docstrings for module data members or class attributes. To allow documenting these, ``autodoc`` recognises a special format of :ref:`comment <python:comments>` called a 'doc comment' or 'documentation comment'.
ta: தொகுதி தரவு உறுப்பினர்கள் அல்லது வகுப்பு பண்புக்கூறுகளுக்கான டாக்ச்ட்ரிங்க்களுக்கு பைத்தானுக்கு உள்ளமைக்கப்பட்ட உதவி இல்லை. இவற்றை ஆவணப்படுத்த அனுமதிக்க, ``autodoc`` ஆனது :ref:`comment <python:comments>` ஒரு 'டாக் கருத்து' அல்லது 'ஆவணக் கருத்து' எனப்படும் சிறப்பு வடிவமைப்பை அங்கீகரிக்கிறது.

source: These comments start with a colon and an optional space character, ``'#:'`` or ``'#: '``. To be recognised, the comments must appear either on the same line as the variable or on one or more lines before the variable. Multi-line doc-comments must always appear on the lines before the variable's definition.
ta: இந்தக் கருத்துகள் பெருங்குடல் மற்றும் விருப்பமான ச்பேச் எழுத்துடன் தொடங்கும், ``'#:'`` அல்லது ``'#: '``. அங்கீகரிக்கப்பட, கருத்துகள் மாறியின் அதே வரியில் அல்லது மாறிக்கு முன் ஒன்று அல்லது அதற்கு மேற்பட்ட வரிகளில் தோன்ற வேண்டும். மல்டி-லைன் டாக்-கமெண்ட்கள் எப்போதும் மாறியின் வரையறைக்கு முன் வரிகளில் தோன்ற வேண்டும்.

source: For example, all three of the following variables have valid doc-comments:
ta: எடுத்துக்காட்டாக, பின்வரும் மூன்று மாறிகளும் சரியான ஆவண-கருத்துகளைக் கொண்டுள்ளன:

source: Alternatively, ``autodoc`` can recognise a docstring on the line immediately following the definition.
ta: மாற்றாக, ``autodoc`` ஆனது வரையறையைத் தொடர்ந்து வரியில் உள்ள டாக்ச்ட்ரிங்கை உடனடியாக அடையாளம் காண முடியும்.

source: In the the following class definition, all attributes have documentation recognised by ``autodoc``:
ta: பின்வரும் வகுப்பு வரையறையில், அனைத்து பண்புக்கூறுகளும் ``autodoc`` ஆல் அங்கீகரிக்கப்பட்ட ஆவணங்களைக் கொண்டுள்ளன:

source: Directives
ta: வழிமுறைகள்

source: :mod:`autodoc` provides several directives that are versions of the usual :rst:dir:`py:module`, :rst:dir:`py:class` and so forth. On parsing time, they import the corresponding module and extract the docstring of the given objects, inserting them into the page source under a suitable :rst:dir:`py:module`, :rst:dir:`py:class` etc. directive.
ta: :mod:`autodoc` வழக்கமான :rst:dir:`py:module`, :rst:dir:`py:class` மற்றும் பலவற்றின் பதிப்புகளாக பல வழிமுறைகளை வழங்குகிறது. பாகுபடுத்தும் நேரத்தில், அவர்கள் தொடர்புடைய தொகுதியை இறக்குமதி செய்து, கொடுக்கப்பட்ட பொருள்களின் டாக்ச்ட்ரிங்கைப் பிரித்தெடுத்து, பொருத்தமான :rst:dir:`py:module`, :rst:dir:`py:class` முதலிய கட்டளைகளின் கீழ் பக்க மூலத்தில் அவற்றைச் செருகுவார்கள்.

source: Just as :rst:dir:`py:class` respects the current :rst:dir:`py:module`, :rst:dir:`autoclass` will also do so. Likewise, :rst:dir:`automethod` will respect the current :rst:dir:`py:class`.
ta: எப்படி :rst:dir:`py:class` தற்போதைய மதிப்பை :rst:dir:`py:module`, :rst:dir:`autoclass` யும் செய்யும். அதேபோல், :rst:dir:`automethod` தற்போதைய :rst:dir:`py:class` ஐ மதிக்கும்.

source: Default directive options
ta: இயல்புநிலை கட்டளை விருப்பங்கள்

source: To make any of the options described below the default, use the :confval:`autodoc_default_options` dictionary in :file:`conf.py`.
ta: கீழே விவரிக்கப்பட்டுள்ள விருப்பங்களில் ஏதேனும் ஒன்றை இயல்புநிலையாக உருவாக்க, :file:`conf.py` இல் உள்ள :confval:`autodoc_default_options` அகராதியைப் பயன்படுத்தவும்.

source: If using defaults for the ``:members:``, ``:exclude-members:``, ``:private-members:``, or ``:special-members:`` options, setting the option on a directive will override the default. Instead, to extend the default list with the per-directive option, the list may be prepended with a plus sign (``+``), as follows:
ta: ``:members:``, ``:exclude-members:``, ``:private-members:`` அல்லது ``:special-members:`` விருப்பங்களுக்கு இயல்புநிலைகளைப் பயன்படுத்தினால், கட்டளையில் விருப்பத்தை அமைப்பது இயல்புநிலையை மீறும். அதற்குப் பதிலாக, இயல்புநிலைப் பட்டியலை ஒரு-வழிமுறை விருப்பத்துடன் நீட்டிக்க, பட்டியல் பின்வருமாறு கூட்டல் குறியுடன் (``+``) முன்வைக்கப்படலாம்:

source: If using :confval:`autodoc_default_options`, the defaults can be disabled per-directive with the negated form, :samp:`:no-{option}:` as an option of the directive For example:
ta: :confval:`autodoc_default_options` ஐப் பயன்படுத்தினால், கட்டளையின் ஒரு விருப்பமாக, நிராகரிக்கப்பட்ட படிவத்தில், இயல்புநிலைகள் ஒவ்வொரு கட்டளைக்கும் முடக்கப்படும், எடுத்துக்காட்டாக:

source: Automatically document modules
ta: தொகுதிகளை தானாக ஆவணப்படுத்துகிறது

source: Document a module. By default, the directive only inserts the docstring of the module itself:
ta: ஒரு தொகுதியை ஆவணப்படுத்தவும். முன்னிருப்பாக, கட்டளையானது தொகுதியின் ஆவணத்தை மட்டுமே செருகும்:

source: will produce source like this:
ta: இது போன்ற மூலத்தை உருவாக்கும்:

source: The directive can also contain content of its own, which will be inserted into the resulting non-auto directive source after the docstring (but before any automatic member documentation).
ta: இந்த கட்டளை அதன் சொந்த உள்ளடக்கத்தையும் கொண்டிருக்கலாம், இது டாக்ச்ட்ரிங்க்குப் பிறகு (ஆனால் எந்த ஒரு தன்னியக்க உறுப்பினர் ஆவணத்திற்கும் முன்) தானாக இயக்கப்படாத மூலத்தில் செருகப்படும்.

source: Therefore, you can also mix automatic and non-automatic member documentation, as follows:
ta: எனவே, நீங்கள் தானாக மற்றும் தானியங்கி அல்லாத உறுப்பினர் ஆவணங்களை பின்வருமாறு கலக்கலாம்:

source: Options
ta: விருப்பங்கள்

source: Do not generate an index entry for the documented module or any auto-documented members.
ta: ஆவணப்படுத்தப்பட்ட தொகுதி அல்லது தானாக ஆவணப்படுத்தப்பட்ட உறுப்பினர்களுக்கான குறியீட்டு உள்ளீட்டை உருவாக்க வேண்டாம்.

source: Do not generate an index entry for the documented module or any auto-documented members. Unlike ``:no-index:``, cross-references are still created.
ta: ஆவணப்படுத்தப்பட்ட தொகுதி அல்லது தானாக ஆவணப்படுத்தப்பட்ட உறுப்பினர்களுக்கான குறியீட்டு உள்ளீட்டை உருவாக்க வேண்டாம். ``:no-index:`` போலல்லாமல், குறுக்கு குறிப்புகள் இன்னும் உருவாக்கப்படுகின்றன.

source: Indicate platforms on which the module is available. This is identical to :rst:dir:`py:module`'s ``:platform:`` option.
ta: தொகுதி கிடைக்கும் தளங்களைக் குறிக்கவும். இது :rst:dir:`py:module` இன் ``:platform:`` விருப்பத்திற்கு ஒத்ததாகும்.

source: A sentence describing the module's purpose. This is identical to :rst:dir:`py:module`'s ``:synopsis:`` option.
ta: தொகுதியின் நோக்கத்தை விவரிக்கும் வாக்கியம். இது :rst:dir:`py:module`ன் ``:synopsis:`` விருப்பத்தை ஒத்ததாகும்.

source: Mark a module as deprecated. This is identical to :rst:dir:`py:module`'s ``:deprecated:`` option.
ta: ஒரு தொகுதி நிறுத்தப்பட்டதாகக் குறிக்கவும். இது :rst:dir:`py:module`ன் ``: deprecated:`` விருப்பத்திற்கு ஒத்ததாகும்.

source: Do not use ``__all__`` when analysing the module to document.
ta: தொகுதியை ஆவணப்படுத்தும்போது ``__all__`` ஐப் பயன்படுத்த வேண்டாம்.

source: Options for selecting members to document
ta: ஆவணத்திற்கான உறுப்பினர்களைத் தேர்ந்தெடுப்பதற்கான விருப்பங்கள்

source: Generate automatic documentation for all members of the target module:
ta: இலக்கு தொகுதியின் அனைத்து உறுப்பினர்களுக்கும் தானியங்கி ஆவணங்களை உருவாக்கவும்:

source: By default, ``autodoc`` only includes public members with a docstring or :ref:`doc-comment <doc-comment>` (``#:``). If ``__all__`` exists, it will be used to define which members are public, unless the :rst:dir:`:ignore-module-all: <automodule:ignore-module-all>` option is set.
ta: இயல்பாக, ``autodoc`` என்பது docstring அல்லது :ref:`doc-comment <doc-comment>` (``#:``) உள்ள பொது உறுப்பினர்களை மட்டுமே உள்ளடக்கும். ``__all__`` இருந்தால், :rst:dir:`:ignore-module-all: <automodule:ignore-module-all>` விருப்பம் அமைக்கப்படாவிட்டால், எந்த உறுப்பினர்கள் பொது என்பதை வரையறுக்க இது பயன்படுத்தப்படும்.

source: To only document certain members, an explicit comma-separated list may be used as the argument to ``:members:``:
ta: குறிப்பிட்ட உறுப்பினர்களை மட்டும் ஆவணப்படுத்த, ஒரு வெளிப்படையான காற்புள்ளியால் பிரிக்கப்பட்ட பட்டியலை ``:members:``க்கான வாதமாகப் பயன்படுத்தலாம்:

source: Exclude the given names from the members to document. For example:
ta: ஆவணத்திற்கு உறுப்பினர்களிடமிருந்து கொடுக்கப்பட்ட பெயர்களை விலக்கவும். உதாரணமாக:

source: To prevent documentation of imported classes or functions, in an :rst:dir:`!automodule` directive with the ``members`` option set, only module members where the ``__module__`` attribute is equal to the module name given to ``automodule`` will be documented.
ta: இறக்குமதி செய்யப்பட்ட வகுப்புகள் அல்லது செயல்பாடுகளை ஆவணப்படுத்துவதைத் தடுக்க, ``உறுப்பினர்கள்`` விருப்பத் தொகுப்பைக் கொண்ட :rst:dir:`!automodule` கட்டளையில், ``__module__`` பண்புக்கூறு ``automodule`` க்கு கொடுக்கப்பட்ட தொகுதி பெயருக்கு சமமாக இருக்கும் தொகுதி உறுப்பினர்கள் மட்டுமே ஆவணப்படுத்தப்படும்.

source: Set the ``imported-members`` option if you want to prevent this behavior and document all available members.
ta: இந்த நடத்தையைத் தடுக்கவும், கிடைக்கக்கூடிய அனைத்து உறுப்பினர்களையும் ஆவணப்படுத்தவும் விரும்பினால் ``இறக்குமதி செய்யப்பட்ட உறுப்பினர்கள்`` விருப்பத்தை அமைக்கவும்.

source: Note that attributes from imported modules will not be documented, because attribute documentation is discovered by parsing the source file of the current module.
ta: தற்போதைய தொகுதியின் மூலக் கோப்பைப் பாகுபடுத்துவதன் மூலம் பண்புக்கூறு ஆவணங்கள் கண்டறியப்பட்டதால், இறக்குமதி செய்யப்பட்ட தொகுதிகளிலிருந்து பண்புக்கூறுகள் ஆவணப்படுத்தப்படாது என்பதை நினைவில் கொள்ளவும்.

source: Generate automatic documentation for members of the target module that don't have a docstring or doc-comment. For example:
ta: ஆவணசரம் அல்லது டாக்-கமென்ட் இல்லாத இலக்கு தொகுதி உறுப்பினர்களுக்கு தானியங்கு ஆவணங்களை உருவாக்கவும். உதாரணமாக:

source: Generate automatic documentation for private members of the target module. This includes names with a leading underscore (e.g. ``_private``) and those members explicitly marked as private with ``:meta private:``.
ta: இலக்கு தொகுதியின் தனிப்பட்ட உறுப்பினர்களுக்கான தானியங்கி ஆவணங்களை உருவாக்கவும். இதில் முன்னணி அடிக்கோடிடப்பட்ட பெயர்கள் (எ.கா. ``_தனியார்``) மற்றும் ``:meta private:`` உடன் தனிப்பட்டதாகக் குறிக்கப்பட்ட உறுப்பினர்களும் அடங்கும்.

source: To only document certain private members, an explicit comma-separated list may be used as the argument to ``:private-members:``:
ta: குறிப்பிட்ட தனிப்பட்ட உறுப்பினர்களை மட்டும் ஆவணப்படுத்த, வெளிப்படையான கமாவால் பிரிக்கப்பட்ட பட்டியலை ``:private-members:`` வாதமாகப் பயன்படுத்தலாம்:

source: The option can now take a comma-separated list of arguments.
ta: இந்த விருப்பம் இப்போது கமாவால் பிரிக்கப்பட்ட வாதங்களின் பட்டியலை எடுக்கலாம்.

source: Generate automatic documentation for special members of the target module, also known as :ref:`'dunder' names <python:specialnames>`. This includes all names enclosed with a double-underscore, e.g. ``__special__``:
ta: இலக்கு தொகுதியின் சிறப்பு உறுப்பினர்களுக்கான தானியங்கு ஆவணங்களை உருவாக்கவும், இது :ref:`'dunder' பெயர்கள் <python:specialnames>` என்றும் அழைக்கப்படுகிறது. இரட்டை அடிக்கோடுடன் இணைக்கப்பட்ட அனைத்து பெயர்களும் இதில் அடங்கும், எ.கா. ``__சிறப்பு__``:

source: To only document certain special members, an explicit comma-separated list may be used as the argument to ``:special-members:``:
ta: குறிப்பிட்ட சில சிறப்பு உறுப்பினர்களை மட்டும் ஆவணப்படுத்த, ஒரு வெளிப்படையான கமாவால் பிரிக்கப்பட்ட பட்டியலை ``:special-members:``க்கான வாதமாகப் பயன்படுத்தலாம்:

source: Options for documented members
ta: ஆவணப்படுத்தப்பட்ட உறுப்பினர்களுக்கான விருப்பங்கள்

source: Choose the ordering of automatically documented members (default: ``alphabetical``). This overrides the :confval:`autodoc_member_order` setting.
ta: Choose the ordering of automatically documented உறுப்பினர்கள் (default: ``alphabetical``). இது :confval:`autodoc_member_order` அமைப்பை மீறுகிறது.

source: ``alphabetical``: Use simple alphabetical order.
ta: ``அகர வரிசை``: எளிய அகர வரிசையைப் பயன்படுத்தவும்.

source: ``groupwise``: Group by object type (class, function, etc), use alphabetical order within groups.
ta: ``groupwise``: பொருள் வகையின்படி குழு (வகுப்பு, செயல்பாடு, முதலியன), குழுக்களுக்குள் அகர வரிசையைப் பயன்படுத்தவும்.

source: ``bysource``: Use the order of objects in the module's source. The ``__all__`` variable can be used to override this order.
ta: ``மூலம்``: தொகுதியின் மூலத்தில் உள்ள பொருட்களின் வரிசையைப் பயன்படுத்தவும். இந்த ஆர்டரை மீறுவதற்கு ``__all__`` மாறியைப் பயன்படுத்தலாம்.

source: Note that for source order, the module must be a Python module with the source code available.
ta: மூல வரிசையைப் பொறுத்தவரை, தொகுதி கிடைக்கக்கூடிய மூலக் குறியீட்டைக் கொண்ட பைதான் தொகுதியாக இருக்க வேண்டும் என்பதை நினைவில் கொள்க.

source: Support the ``'bysource'`` option.
ta: ```பைசோர்ச்''` விருப்பத்தை ஆதரிக்கவும்.

source: Enable the :rst:dir:`:show-inheritance: <autoclass:show-inheritance>` option for all members of the module, if ``:members:`` is enabled.
ta: ``:members:`` இயக்கப்பட்டிருந்தால், தொகுதியின் அனைத்து உறுப்பினர்களுக்கும் :rst:dir:`:show-inheritance: <autoclass:show-inheritance>` விருப்பத்தை இயக்கவும்.

source: Automatically document classes or exceptions
ta: வகுப்புகள் அல்லது விதிவிலக்குகளைத் தானாக ஆவணப்படுத்தவும்

source: Document a class. For exception classes, prefer ``.. autoexception::``. By default, the directive only inserts the docstring of the class itself:
ta: ஒரு வகுப்பை ஆவணப்படுத்தவும். விதிவிலக்கு வகுப்புகளுக்கு, ``.. autoexception::`` என்பதைத் தேர்ந்தெடுக்கவும். இயல்பாக, கட்டளை வகுப்பின் டாக்ச்ட்ரிங்கை மட்டுமே செருகும்:

source: Advanced usage
ta: மேம்பட்ட பயன்பாடு

source: It is possible to override the signature for explicitly documented callable objects (functions, methods, classes) with the regular syntax that will override the signature gained from introspection:
ta: உள்நோக்கத்திலிருந்து பெறப்பட்ட கையொப்பத்தை மீறும் வழக்கமான தொடரியல் மூலம் வெளிப்படையாக ஆவணப்படுத்தப்பட்ட அழைக்கக்கூடிய பொருள்களுக்கான (செயல்பாடுகள், முறைகள், வகுப்புகள்) கையொப்பத்தை மேலெழுத முடியும்:

source: This is useful if the signature from the method is hidden by a decorator.
ta: முறையிலிருந்து கையொப்பம் ஒரு அலங்காரக்காரரால் மறைக்கப்பட்டால் இது பயனுள்ளதாக இருக்கும்.

source: Do not generate an index entry for the documented class or any auto-documented members.
ta: ஆவணப்படுத்தப்பட்ட வகுப்பு அல்லது தானாக ஆவணப்படுத்தப்பட்ட உறுப்பினர்களுக்கான குறியீட்டு உள்ளீட்டை உருவாக்க வேண்டாம்.

source: Do not generate an index entry for the documented class or any auto-documented members. Unlike ``:no-index:``, cross-references are still created.
ta: ஆவணப்படுத்தப்பட்ட வகுப்பு அல்லது தானாக ஆவணப்படுத்தப்பட்ட உறுப்பினர்களுக்கான குறியீட்டு உள்ளீட்டை உருவாக்க வேண்டாம். ``:no-index:`` போலல்லாமல், குறுக்கு குறிப்புகள் இன்னும் உருவாக்கப்படுகின்றன.

source: Select which docstring will be used for the main body of the directive. This overrides the global value of :confval:`autoclass_content`. The possible values are:
ta: கட்டளையின் முக்கிய பகுதிக்கு எந்த ஆவணசரம் பயன்படுத்தப்படும் என்பதைத் தேர்ந்தெடுக்கவும். இது :confval:`autoclass_content` இன் உலகளாவிய மதிப்பை மீறுகிறது. சாத்தியமான மதிப்புகள்:

source: ``class``: Only use the class's docstring. The :meth:`!__init__` method can be separately documented using the ``:members:`` option or :rst:dir:`automethod`.
ta: ``வகுப்பு``: வகுப்பின் டாக்ச்ட்ரிங்கை மட்டும் பயன்படுத்தவும். :meth:`!__init__` முறையானது ``:members:`` விருப்பம் அல்லது :rst:dir:`automethod` ஐப் பயன்படுத்தி தனித்தனியாக ஆவணப்படுத்தப்படலாம்.

source: ``init``: Only use the docstring of the :meth:`!__init__` method.
ta: ``init``: :meth:`!__init__` முறையின் டாக்ச்ட்ரிங்கை மட்டும் பயன்படுத்தவும்.

source: ``both``: Use both, appending the docstring of the :meth:`!__init__` method to the class's docstring.
ta: ``இரண்டு```: இரண்டையும் பயன்படுத்தவும், :meth:`!__init__` முறையின் டாக்ச்ட்ரிங்கை வகுப்பின் டாக்ச்ட்ரிங்கில் சேர்க்கவும்.
