Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_usage--restructuredtext--directives_*.po
Languages: ta

source: ``start-after``/``start-at`` and ``end-before``/``end-at`` can have same string. ``start-after``/``start-at`` filter lines before the line that contains the option string (``start-at`` will keep the line). Then ``end-before``/``end-at`` filter lines after the line that contains the option string (``end-at`` will keep the line and ``end-before`` skip the first line).
ta: ``start-after``/``start-at`` மற்றும் ``end-before``/``end-at`` ஒரே சரத்தைக் கொண்டிருக்கலாம். ``start-after``/``start-at`` வரிக்கு முன் வடிகட்டுதல் வரிகள் (``start-at`` வரியை வைத்திருக்கும்). பிறகு ``end-before`/``end-at`` என்ற விருப்பச் சரத்தைக் கொண்டிருக்கும் வரிக்குப் பிறகு வடிகட்டி வரிகள் வரும் (``end-at`` வரியை வைத்திருக்கும் மற்றும் ``end-before`` முதல் வரியைத் தவிர்க்கும்).

source: Added the ``start-after`` and ``end-before`` options.
ta: ``start-after`` மற்றும் ``end-before`` விருப்பங்கள் சேர்க்கப்பட்டன.

source: Added the ``start-at``, and ``end-at`` options.
ta: `` ச்டார்ட்-அட்``, மற்றும் `` எண்ட்-அட்`` விருப்பங்களைச் சேர்த்தது.

source: To only select ``[second-section]`` of an INI file such as the following, use ``:start-at: [second-section]`` and ``:end-before: [third-section]``:
ta: பின்வருபவை போன்ற இனி கோப்பின் ``[இரண்டாம்-பிரிவு]`` ஐ மட்டும் தேர்ந்தெடுக்க, ``:start-at: [second-section]`` மற்றும் ``:end-before: [III-section]``:

source: These options can be useful when working with tag comments. Using ``:start-after: [initialise]`` and ``:end-before: [initialised]`` keeps the lines between between the two comments below:
ta: குறிச்சொல் கருத்துகளுடன் பணிபுரியும் போது இந்த விருப்பங்கள் பயனுள்ளதாக இருக்கும். ``:start-after: [initialise]`` மற்றும் ``:end-before: [initialised]`` ஆகியவற்றைப் பயன்படுத்துவது கீழே உள்ள இரண்டு கருத்துகளுக்கு இடையே உள்ள கோடுகளை வைத்திருக்கும்:

source: When lines have been selected in any of the ways described above, the line numbers in ``emphasize-lines`` refer to these selected lines, counted consecutively starting from 1.
ta: மேலே விவரிக்கப்பட்டுள்ள வழிகளில் ஏதேனும் வரிகள் தேர்ந்தெடுக்கப்பட்டால், `` வலியுறுத்தல்-வரிகள்`` இல் உள்ள வரி எண்கள் இந்த தேர்ந்தெடுக்கப்பட்ட வரிகளைக் குறிக்கும், 1 முதல் தொடர்ந்து எண்ணப்படும்.

source: Prepend a line before the included code. This can be useful for example when highlighting PHP code that doesn't include the ``<?php`` or ``?>`` markers.
ta: சேர்க்கப்பட்ட குறியீட்டிற்கு முன் ஒரு வரியை முன்வைக்கவும். உதாரணமாக ``<?php`` அல்லது ``?>`` குறிப்பான்கள் இல்லாத பிஎச்பி குறியீட்டை முன்னிலைப்படுத்தும்போது இது பயனுள்ளதாக இருக்கும்.

source: Append a line after the included code. This can be useful for example when highlighting PHP code that doesn't include the ``<?php`` or ``?>`` markers.
ta: சேர்க்கப்பட்ட குறியீட்டிற்குப் பிறகு ஒரு வரியைச் சேர்க்கவும். உதாரணமாக ``<?php`` அல்லது ``?>`` குறிப்பான்கள் இல்லாத பிஎச்பி குறியீட்டை முன்னிலைப்படுத்தும்போது இது பயனுள்ளதாக இருக்கும்.

source: Show the diff of two files. For example:
ta: இரண்டு கோப்புகளின் வேறுபாட்டைக் காட்டு. உதாரணமாக:

source: This shows the diff between ``example.txt`` and ``example.txt.orig`` with unified diff format.
ta: இது ``example.txt`` மற்றும் ``example.txt.orig`` ஆகியவற்றுக்கு இடையே உள்ள வேறுபாட்டை ஒருங்கிணைக்கப்பட்ட வேறுபாடு வடிவத்துடன் காட்டுகிறது.

source: Added support for absolute filenames.
ta: முழுமையான கோப்பு பெயர்களுக்கான உதவி சேர்க்கப்பட்டது.

source: With both ``start-after`` and ``lines`` in use, the first line as per ``start-after`` is considered to be with line number ``1`` for ``lines``.
ta: `` தொடக்க-க்குப் பிறகு` `மற்றும்` `கோடுகள்`` பயன்பாட்டில் இருப்பதால், `` தொடக்க-க்குப் பிறகு`` இன் முதல் வரி `` கோடுகள்`` க்கு வரி எண் `` 1` உடன் கருதப்படுகிறது.

source: Glossary
ta: சொற்களஞ்சியம்

source: This directive must contain a reStructuredText definition-list-like markup with terms and definitions. The definitions will then be referenceable with the :rst:role:`term` role. Example::
ta: இந்த உத்தரவில் விதிமுறைகள் மற்றும் வரையறைகளுடன் மறுகட்டமைக்கப்பட்ட உரை வரையறை-பட்டியல் போன்ற மார்க்அப் இருக்க வேண்டும். வரையறைகள் பின்னர் :rst:role:`term` பாத்திரத்துடன் குறிப்பிடப்படும். உதாரணம்::

source: In contrast to regular definition lists, *multiple* terms per entry are allowed, and inline markup is allowed in terms. You can link to all of the terms. For example::
ta: வழக்கமான வரையறை பட்டியல்களுக்கு மாறாக, * ஒரு நுழைவுக்கு பல * விதிமுறைகள் அனுமதிக்கப்படுகின்றன, மேலும் இன்லைன் மார்க்அப் விதிமுறைகளில் அனுமதிக்கப்படுகிறது. நீங்கள் எல்லா விதிமுறைகளுக்கும் இணைக்கலாம். உதாரணத்திற்கு::

source: (When the glossary is sorted, the first term determines the sort order.)
ta: (சொற்களஞ்சியம் வரிசைப்படுத்தப்படும்போது, முதல் காலமானது வரிசை வரிசையை தீர்மானிக்கிறது.)

source: If you want to specify "grouping key" for general index entries, you can put a "key" as "term : key". For example::
ta: பொது குறியீட்டு உள்ளீடுகளுக்கு "குழும விசையை" குறிப்பிட விரும்பினால், நீங்கள் ஒரு "விசையை" "சொல்: விசை" என வைக்கலாம். உதாரணத்திற்கு::

source: Note that "key" is used for grouping key as is. The "key" isn't normalized; key "A" and "a" become different groups. The whole characters in "key" is used instead of a first character; it is used for "Combining Character Sequence" and "Surrogate Pairs" grouping key.
ta: "விசை" விசையை குழுமத்திற்கு பயன்படுத்தப்படுகிறது என்பதை நினைவில் கொள்க. "விசை" இயல்பாக்கப்படவில்லை; விசை "ஏ" மற்றும் "ஏ" வெவ்வேறு குழுக்களாக மாறுகிறது. முதல் எழுத்துக்கு பதிலாக "விசை" இல் உள்ள முழு எழுத்துக்களும் பயன்படுத்தப்படுகின்றன; இது "எழுத்து வரிசையை இணைப்பது" மற்றும் "வாடகை சோடிகள்" குழும விசைக்கு பயன்படுத்தப்படுகிறது.

source: In i18n situation, you can specify "localized term : key" even if original text only have "term" part. In this case, translated "localized term" will be categorized in "key" group.
ta: ப18ல் சூழ்நிலையில், அசல் உரைக்கு "கால" பகுதி மட்டுமே இருந்தாலும் "உள்ளூர்மயமாக்கப்பட்ட சொல்: விசை" என்பதை நீங்கள் குறிப்பிடலாம். இந்த வழக்கில், மொழிபெயர்க்கப்பட்ட "உள்ளூர்மயமாக்கப்பட்ட சொல்" "விசை" குழுவில் வகைப்படுத்தப்படும்.

source: Now supports multiple terms and inline markup in terms.
ta: இப்போது பல விதிமுறைகளையும் இன்லைன் மார்க்அப்பையும் ஆதரிக்கிறது.

source: Index key for glossary term should be considered *experimental*.
ta: சொற்களஞ்சிய காலத்திற்கான குறியீட்டு விசை *சோதனை *என்று கருதப்பட வேண்டும்.

source: Sort the entries alphabetically.
ta: உள்ளீடுகளை அகரவரிசையில் வரிசைப்படுத்தவும்.

source: In internationalized documentation, sort according to translated terms.
ta: சர்வதேசமயமாக்கப்பட்ட ஆவணங்களில், மொழிபெயர்க்கப்பட்ட விதிமுறைகளின்படி வரிசைப்படுத்தவும்.

source: Meta-information markup
ta: மெட்டா-தகவல் மார்க்அப்

source: Identifies the author of the current section. The argument should include the author's name such that it can be used for presentation and email address. The domain name portion of the address should be lower case. Example::
ta: தற்போதைய பிரிவின் ஆசிரியரை அடையாளம் காட்டுகிறது. விளக்கக்காட்சி மற்றும் மின்னஞ்சல் முகவரிக்கு பயன்படுத்தக்கூடிய எழுத்தாளரின் பெயர் வாதத்தில் இருக்க வேண்டும். முகவரியின் டொமைன் பெயர் பகுதி சிறியதாக இருக்க வேண்டும். உதாரணமாக::

source: By default, this markup isn't reflected in the output in any way (it helps keep track of contributions), but you can set the configuration value :confval:`show_authors` to ``True`` to make them produce a paragraph in the output.
ta: இயல்பாக, இந்த மார்க்அப் வெளியீட்டில் எந்த வகையிலும் பிரதிபலிக்கவில்லை (இது பங்களிப்புகளைக் கண்காணிக்க உதவுகிறது), ஆனால் நீங்கள் உள்ளமைவு மதிப்பை அமைக்கலாம்: confval: `show_authors`` `உண்மை`` அவை ஒரு பத்தியை உருவாக்குகின்றன வெளியீடு.

source: The :rst:dir:`codeauthor` directive, which can appear multiple times, names the authors of the described code, just like :rst:dir:`sectionauthor` names the author(s) of a piece of documentation. It too only produces output if the :confval:`show_authors` configuration value is ``True``.
ta: தி: rst: dir: `கோட்அவுட்டர்` டைரெக்டிவ், பல முறை தோன்றக்கூடிய, விவரிக்கப்பட்ட குறியீட்டின் ஆசிரியர்களை பெயரிடுங்கள், போலவே: rst: dir:` பிரிவு வழக்கறிஞர்` ஒரு ஆவணத்தின் ஆசிரியர் (கள்) பெயரிடுகிறார். இது: confval: `show_authors` உள்ளமைவு மதிப்பு` `உண்மை`` என்றால் மட்டுமே வெளியீட்டை உருவாக்குகிறது.

source: Index-generating markup
ta: குறியீட்டு உருவாக்கும் மார்க்அப்

source: Sphinx automatically creates index entries from all object descriptions (like functions, classes or attributes) like discussed in :doc:`/usage/domains/index`.
ta: விவாதிக்கப்பட்ட போன்ற அனைத்து பொருள் விளக்கங்களிலிருந்தும் (செயல்பாடுகள், வகுப்புகள் அல்லது பண்புக்கூறுகள் போன்றவை) சூரரிமாச்சிலை தானாகவே குறியீட்டு உள்ளீடுகளை உருவாக்குகிறது: doc: `/பயன்பாடு/களங்கள்/குறியீட்டு`.

source: However, there is also explicit markup available, to make the index more comprehensive and enable index entries in documents where information is not mainly contained in information units, such as the language reference.
ta: எவ்வாறாயினும், குறியீட்டை மிகவும் விரிவானதாக்குவதற்கும், மொழி குறிப்பு போன்ற செய்தி அலகுகளில் தகவல்கள் முக்கியமாக இல்லாத ஆவணங்களில் குறியீட்டு உள்ளீடுகளை இயக்குவதற்கும் வெளிப்படையான மார்க்அப் உள்ளது.

source: This directive contains one or more index entries. Each entry consists of a type and a value, separated by a colon.
ta: இந்த உத்தரவில் ஒன்று அல்லது அதற்கு மேற்பட்ட குறியீட்டு உள்ளீடுகள் உள்ளன. ஒவ்வொரு நுழைவும் ஒரு வகை மற்றும் மதிப்பைக் கொண்டுள்ளது, இது ஒரு பெருங்குடலால் பிரிக்கப்படுகிறது.

source: For example::
ta: உதாரணத்திற்கு::

source: This directive contains five entries, which will be converted to entries in the generated index which link to the exact location of the index statement (or, in case of offline media, the corresponding page number).
ta: இந்த உத்தரவை ஐந்து உள்ளீடுகளைக் கொண்டுள்ளது, அவை உருவாக்கப்பட்ட குறியீட்டில் உள்ளீடுகளாக மாற்றப்படும், அவை குறியீட்டு அறிக்கையின் சரியான இருப்பிடத்துடன் இணைக்கப்படுகின்றன (அல்லது, இணைப்பில்லாத மீடியாவின் விசயத்தில், தொடர்புடைய பக்க எண்).

source: Since index directives generate cross-reference targets at their location in the source, it makes sense to put them *before* the thing they refer to -- e.g. a heading, as in the example above.
ta: குறியீட்டு வழிமுறைகள் மூலத்தில் அவற்றின் இருப்பிடத்தில் குறுக்கு-குறிப்பு இலக்குகளை உருவாக்குவதால், அவற்றை * முன் * முன் வைப்பது அர்த்தமுள்ளதாக இருக்கிறது-எ.கா. மேலே உள்ள எடுத்துக்காட்டில் உள்ளதைப் போல ஒரு தலைப்பு.

source: The possible entry types are:
ta: சாத்தியமான நுழைவு வகைகள்:

source: single
ta: ஒற்றை

source: Creates a single index entry. Can be made a sub-entry by separating the sub-entry text with a semicolon (this notation is also used below to describe what entries are created). Examples:
ta: ஒற்றை குறியீட்டு உள்ளீட்டை உருவாக்குகிறது. துணை நுழைவு உரையை ஒரு அரைக்காற்புள்ளியுடன் பிரிப்பதன் மூலம் துணை நுழைவு செய்ய முடியும் (இந்த குறியீடு என்ன உள்ளீடுகள் உருவாக்கப்படுகின்றன என்பதை விவரிக்க கீழே பயன்படுத்தப்படுகிறது). எடுத்துக்காட்டுகள்:

source: ``single: execution`` creates an index entry labelled ``execution``.
ta: `` ஒற்றை: மரணதண்டனை`` `` மரணதண்டனை`` என்று பெயரிடப்பட்ட ஒரு குறியீட்டு உள்ளீட்டை உருவாக்குகிறது.

source: ``single: execution; context`` creates an sub-entry of ``execution`` labelled ``context``.
ta: `` ஒற்றை: மரணதண்டனை; சூழல்`` `` சூழல்` என்று பெயரிடப்பட்ட `` மரணதண்டனை`` இன் துணை நிறுவனத்தை உருவாக்குகிறது.

source: pair
ta: இணை

source: A shortcut to create two index entries. The pair of values must be separated by a semicolon. Example:
ta: இரண்டு குறியீட்டு உள்ளீடுகளை உருவாக்க ஒரு குறுக்குவழி. மதிப்புகளின் இணை அரைக்காற்புள்ளியால் பிரிக்கப்பட வேண்டும். உதாரணமாக:

source: This would create two index entries; ``loop; statement`` and ``statement; loop``.
ta: இது இரண்டு குறியீட்டு உள்ளீடுகளை உருவாக்கும்; `` லூப்; அறிக்கை`` மற்றும் `` அறிக்கை; லூப்``.

source: triple
ta: மூன்று

source: A shortcut to create three index entries. All three values must be separated by a semicolon. Example:
ta: மூன்று குறியீட்டு உள்ளீடுகளை உருவாக்க ஒரு குறுக்குவழி. மூன்று மதிப்புகளும் அரைக்காற்புள்ளியால் பிரிக்கப்பட வேண்டும். உதாரணமாக:

source: This would create three index entries; ``module; search path``, ``search; path, module``, and ``path; module search``.
ta: இது மூன்று குறியீட்டு உள்ளீடுகளை உருவாக்கும்; `` தொகுதி; தேடல் பாதை``, `` தேடல்; பாதை, தொகுதி``, மற்றும் `` பாதை; தொகுதி தேடல்``.

source: see
ta: பார்க்க

source: A shortcut to create an index entry that refers to another entry. Example:
ta: மற்றொரு உள்ளீட்டைக் குறிக்கும் குறியீட்டு உள்ளீட்டை உருவாக்க ஒரு குறுக்குவழி. உதாரணமாக:

source: This would create an index entry referring from ``entry`` to ``other`` (i.e. 'entry': See 'other').
ta: இது `` நுழைவு`` இலிருந்து `பிற`` (அதாவது 'நுழைவு': 'பிற' ஐப் பார்க்கவும்) குறிப்பிடும் குறியீட்டு உள்ளீட்டை உருவாக்கும்.

source: seealso
ta: சீல்சோ

source: Like ``see``, but inserts 'see also' instead of 'see'.
ta: `` பார்க்க`` போன்றவை, ஆனால் 'பார்க்க' என்பதற்குப் பதிலாக 'ஐக் காண்க'.

source: module, keyword, operator, object, exception, statement, builtin
ta: தொகுதி, முக்கிய சொல், ஆபரேட்டர், பொருள், விதிவிலக்கு, அறிக்கை, பில்டின்

source: These **deprecated** shortcuts all create two index entries. For example, ``module: hashlib`` creates the entries ``module; hashlib`` and ``hashlib; module``.
ta: இவை ** நீக்கப்பட்ட ** குறுக்குவழிகள் அனைத்தும் இரண்டு குறியீட்டு உள்ளீடுகளை உருவாக்குகின்றன. எடுத்துக்காட்டாக, `` தொகுதி: ஆச்லிப்`` உள்ளீடுகளை உருவாக்குகிறது `` தொகுதி; ஆச்லிப்` மற்றும் `` ஆச்லிப்; தொகுதி``.

source: These Python-specific entry types are deprecated.
ta: இந்த பைதான்-குறிப்பிட்ட நுழைவு வகைகள் நீக்கப்படுகின்றன.

source: Removal version set to Sphinx 9.0. Using these entry types will now emit warnings with the ``index`` category.
ta: அகற்றுதல் பதிப்பு சூரரிமாச்சிலை 9.0 க்கு அமைக்கப்பட்டுள்ளது. இந்த நுழைவு வகைகளைப் பயன்படுத்துவது இப்போது `` குறியீட்டு`` வகையுடன் எச்சரிக்கைகளை வெளியிடும்.

source: You can mark up "main" index entries by prefixing them with an exclamation mark. The references to "main" entries are emphasized in the generated index. For example, if two pages contain ::
ta: "முதன்மையான" குறியீட்டு உள்ளீடுகளை ஒரு ஆச்சரியக் குறியுடன் முன்னொட்டுவதன் மூலம் அவற்றைக் குறிக்கலாம். "முதன்மையான" உள்ளீடுகளுக்கான குறிப்புகள் உருவாக்கப்பட்ட குறியீட்டில் வலியுறுத்தப்படுகின்றன. உதாரணமாக, இரண்டு பக்கங்களில் இருந்தால் ::

source: and one page contains ::
ta: ஒரு பக்கத்தில் ::

source: then the backlink to the latter page is emphasized among the three backlinks.
ta: பிந்தைய பக்கத்தின் பின்னிணைப்பு மூன்று பின்னிணைப்புகளில் வலியுறுத்தப்படுகிறது.

source: For index directives containing only "single" entries, there is a shorthand notation::
ta: "ஒற்றை" உள்ளீடுகளை மட்டுமே கொண்ட குறியீட்டு வழிமுறைகளுக்கு, ஒரு சுருக்கெழுத்து குறியீடு உள்ளது ::

source: This creates four index entries.
ta: இது நான்கு குறியீட்டு உள்ளீடுகளை உருவாக்குகிறது.

source: Added ``see`` and ``seealso`` types, as well as marking main entries.
ta: `` பார்க்க`` மற்றும் `` சீயல்சோ` `வகைகளைச் சேர்த்தது, அத்துடன் முதன்மையான உள்ளீடுகளைக் குறிக்கவும்.

source: While the :rst:dir:`index` directive is a block-level markup and links to the beginning of the next paragraph, there is also a corresponding role that sets the link target directly where it is used.
ta: : rst: dir: `index` டைரெக்டிவ் என்பது ஒரு தொகுதி-நிலை மார்க்அப் மற்றும் அடுத்த பத்தியின் தொடக்கத்திற்கான இணைப்புகள், இணைப்பு இலக்கை அது பயன்படுத்தும் இடத்தில் நேரடியாக அமைக்கும் அதனுடன் தொடர்புடைய பாத்திரமும் உள்ளது.

source: The content of the role can be a simple phrase, which is then kept in the text and used as an index entry. It can also be a combination of text and index entry, styled like with explicit targets of cross-references. In that case, the "target" part can be a full entry as described for the directive above. For example::
ta: பாத்திரத்தின் உள்ளடக்கம் ஒரு எளிய சொற்றொடராக இருக்கலாம், பின்னர் அது உரையில் வைக்கப்பட்டு குறியீட்டு நுழைவாக பயன்படுத்தப்படுகிறது. இது உரை மற்றும் குறியீட்டு நுழைவு ஆகியவற்றின் கலவையாகவும் இருக்கலாம், இது குறுக்கு-குறிப்புகளின் வெளிப்படையான இலக்குகளைப் போலவே வடிவமைக்கப்பட்டுள்ளது. அவ்வாறான நிலையில், மேலே உள்ள உத்தரவுக்கு விவரிக்கப்பட்டுள்ளபடி "இலக்கு" பகுதி முழு நுழைவாக இருக்கலாம். உதாரணத்திற்கு::

source: Including content based on tags
ta: குறிச்சொற்களின் அடிப்படையில் உள்ளடக்கம் உட்பட

source: Include the content of the directive only if the *expression* is true. The expression should consist of tags, like this::
ta: * வெளிப்பாடு * உண்மையாக இருந்தால் மட்டுமே உத்தரவின் உள்ளடக்கத்தை சேர்க்கவும். வெளிப்பாடு இது போன்ற குறிச்சொற்களைக் கொண்டிருக்க வேண்டும் ::

source: Undefined tags are false, defined tags are true (tags can be defined via the :option:`--tag <sphinx-build --tag>` command-line option or within :file:`conf.py`, see :ref:`here <conf-tags>`). Boolean expressions (like ``(latex or html) and draft``) are supported and may use parentheses.
ta: வரையறுக்கப்படாத குறிச்சொற்கள் தவறானவை, வரையறுக்கப்பட்ட குறிச்சொற்கள் உண்மை (குறிச்சொற்களை :option:`--tag <sphinx-build --tag>` கட்டளை-வரி விருப்பத்தின் மூலம் வரையறுக்கலாம் அல்லது :file:`conf.py` இல், :ref:`இங்கே <conf-tags>` பார்க்கவும்). பூலியன் வெளிப்பாடுகள் (`(லேடெக்ச் அல்லது html) மற்றும் வரைவு`` போன்றவை) ஆதரிக்கப்படுகின்றன மற்றும் அடைப்புக்குறிகளைப் பயன்படுத்தலாம்.

source: The *format* and the *name* of the current builder (``html``, ``latex`` or ``text``) are always set as a tag [#]_. To make the distinction between format and name explicit, they are also added with the prefix ``format_`` and ``builder_``, e.g. the epub builder defines the tags ``html``, ``epub``, ``format_html`` and ``builder_epub``.
ta: தற்போதைய பில்டரின் * வடிவம் * மற்றும் * பெயர் * (`` html``, `` லேடெக்ச்`` அல்லது `உரை``) எப்போதும் ஒரு குறிச்சொல்லாக அமைக்கப்பட்டிருக்கும் [#] _. வடிவமைப்பிற்கும் பெயருக்கும் இடையிலான வேறுபாட்டை வெளிப்படையாகச் செய்ய, அவை `` `` `` `பில்டர்_`` என்ற முன்னொட்டுடன் சேர்க்கப்படுகின்றன, எ.கா. எபப் பில்டர் `` html``, `` epub``, `` format_html`` மற்றும் `` பில்டர்_பப்` ஆகியவற்றை வரையறுக்கிறது.

source: These standard tags are set *after* the configuration file is read, so they are not available there.
ta: இந்த நிலையான குறிச்சொற்கள் அமைக்கப்பட்டன * பிறகு * உள்ளமைவு கோப்பு படிக்கப்படுகிறது, எனவே அவை அங்கு கிடைக்காது.

source: All tags must follow the standard Python identifier syntax as set out in the `Identifiers and keywords <https://docs.python.org/3/reference/lexical_analysis.html#identifiers>`_ documentation. That is, a tag expression may only consist of tags that conform to the syntax of Python variables. In ASCII, this consists of the uppercase and lowercase letters ``A`` through ``Z``, the underscore ``_`` and, except for the first character, the digits ``0`` through ``9``.
ta: எல்லா குறிச்சொற்களும் `அடையாளங்காட்டிகள் மற்றும் முக்கிய வார்த்தைகளில் குறிப்பிடப்பட்டுள்ளபடி நிலையான பைதான் அடையாளங்காட்டி தொடரியல் பின்பற்ற வேண்டும் <https://docs.python.org/3/reference/lexical_analysis.html#ignidifiers>` _ ஆவணங்கள். அதாவது, ஒரு குறிச்சொல் வெளிப்பாடு பைதான் மாறிகளின் தொடரியல் ஒத்ததாக இருக்கும் குறிச்சொற்களைக் கொண்டிருக்கலாம். ascii இல், இது `` z`` வழியாக `` _`` மற்றும் முதல் எழுத்தைத் தவிர, முதல் எழுத்தைத் தவிர, `` 0`` மூலம் `` 9` 0`` மூலம் `` 9` `.

source: Added the name of the builder and the prefixes.
ta: பில்டரின் பெயர் மற்றும் முன்னொட்டுகளைச் சேர்த்தது.

source: This directive is designed to control only content of document. It could not control sections, labels and so on.
ta: இந்த கட்டளை ஆவணத்தின் உள்ளடக்கத்தை மட்டுமே கட்டுப்படுத்த வடிவமைக்கப்பட்டுள்ளது. இது பிரிவுகள், லேபிள்கள் மற்றும் பலவற்றைக் கட்டுப்படுத்த முடியவில்லை.

source: Tables
ta: அட்டவணைகள்

source: Use :ref:`reStructuredText tables <rst-tables>`, i.e. either
ta: பயன்படுத்தவும்: ref: `மறுசீரமைப்பு அட்டவணைகள் <rst- அட்டவணைகள்>`, அதாவது

source: grid table syntax (:duref:`ref <grid-tables>`),
ta: கட்டம் அட்டவணை தொடரியல் (: duref: `refe <கட்டம்-அட்டவணைகள்>`),

source: simple table syntax (:duref:`ref <simple-tables>`),
ta: எளிய அட்டவணை தொடரியல் (: duref: `refe <simmen- அட்டவணைகள்>`),

source: :dudir:`csv-table` syntax,
ta: : dudir: `csv-table` தொடரியல்,

source: or :dudir:`list-table` syntax.
ta: அல்லது: டுடிர்: `பட்டியல்-அட்டவணை` தொடரியல்.

source: The :dudir:`table` directive serves as optional wrapper of the *grid* and *simple* syntaxes.
ta: தி: டுடிர்: `அட்டவணை` டைரெக்டிவ் * கட்டம் * மற்றும் * எளிய * தொடரியல் ஆகியவற்றின் விருப்ப ரேப்பராக செயல்படுகிறது.

source: They work fine in HTML output, but rendering tables to LaTeX is complex. Check the :confval:`latex_table_style`.
ta: அவை html வெளியீட்டில் நன்றாக வேலை செய்கின்றன, ஆனால் அட்டவணையை லேடெக்சுக்கு வழங்குவது சிக்கலானது. சரிபார்க்கவும்: confval: `latex_table_style`.

source: Merged cells (multi-row, multi-column, both) from grid tables containing complex contents such as multiple paragraphs, blockquotes, lists, literal blocks, will render correctly to LaTeX output.
ta: பல பத்திகள், பிளாக்கோட்டுகள், பட்டியல்கள், நேரடி தொகுதிகள் போன்ற சிக்கலான உள்ளடக்கங்களைக் கொண்ட கட்டம் அட்டவணைகளிலிருந்து இணைக்கப்பட்ட கலங்கள் (மல்டி-ரோ, மல்டி-கோலன், இரண்டும்) லேடெக்ச் வெளியீட்டிற்கு சரியாக வழங்கப்படும்.

source: The partial support of the LaTeX builder for nesting a table in another has been extended. Formerly Sphinx would raise an error if ``longtable`` class was specified for a table containing a nested table, and some cases would not raise an error at Sphinx level but fail at LaTeX level during PDF build. This is a complex topic in LaTeX rendering and the output can sometimes be improved via the :rst:dir:`tabularcolumns` directive.
ta: லேடெக்ச் பில்டரின் ஒரு மேசையை மற்றொன்றில் கூடுகட்டுவதற்கான பகுதி உதவி நீட்டிக்கப்பட்டுள்ளது. உள்ளமை அட்டவணையைக் கொண்ட அட்டவணைக்கு ``நீண்ட அட்டவணை`` வகுப்பு குறிப்பிடப்பட்டிருந்தால் முன்பு சூரரிமாச்சிலை பிழையை எழுப்பும், மேலும் சில சமயங்களில் சூரரிமாச்சிலை அளவில் பிழை ஏற்படாது ஆனால் PDF உருவாக்கத்தின் போது லாடெக்சு அளவில் தோல்வியடையும். லாடெக்சு ரெண்டரிங்கில் இது ஒரு சிக்கலான தலைப்பு மற்றும் வெளியீடு சில சமயங்களில் :rst:dir:`tabularcolumns' கட்டளை மூலம் மேம்படுத்தப்படும்.

source: This directive influences only the LaTeX output, and only for the next table in source. The mandatory argument is a column specification (known as an "alignment preamble" in LaTeX idiom). Please refer to a LaTeX documentation, such as the `wiki page`_, for basics of such a column specification.
ta: இந்த கட்டளை லாடெக்சு வெளியீட்டை மட்டுமே பாதிக்கும், மேலும் மூலத்தில் உள்ள அடுத்த அட்டவணைக்கு மட்டுமே. கட்டாய உரையாடல் என்பது நெடுவரிசை விவரக்குறிப்பு (LaTeX ஐடியமில் "சீரமைப்பு முன்னுரை" என அறியப்படுகிறது). அத்தகைய நெடுவரிசை விவரக்குறிப்பின் அடிப்படைகளுக்கு, `விக்கி பக்கம்`_ போன்ற லாடெக்சு ஆவணத்தைப் பார்க்கவும்.

source: Sphinx renders tables with at most 30 rows using ``tabulary`` (or ``tabular`` if at least one cell contains either a code-block or a nested table), and those with more rows with ``longtable``. The advantage of using ``tabulary`` is that it tries to compute automatically (internally to LaTeX) suitable column widths.
ta: சூரரிமாச்சிலை அதிகபட்சம் 30 வரிசைகள் கொண்ட அட்டவணைகளை ``டேபுலரி`` (அல்லது குறைந்தபட்சம் ஒரு கலத்தில் குறியீடு-தடுப்பு அல்லது உள்ளமைக்கப்பட்ட அட்டவணை இருந்தால் ``டேபுலர்``) மற்றும் ``நீண்ட அட்டவணை`` உடன் அதிக வரிசைகள் உள்ள அட்டவணைகளை வழங்குதல் செய்கிறது. ``டேபுலரி``யைப் பயன்படுத்துவதன் நன்மை என்னவென்றால், அது தானாகவே (உள்நாட்டில் லாடெக்சு க்கு) பொருத்தமான நெடுவரிசை அகலங்களைக் கணக்கிட முயற்சிக்கிறது.
