Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_usage--restructuredtext--directives_*.po
Languages: ta

source: The ``tabulary`` algorithm often works well, but in some cases when a cell contains long paragraphs, the column will be given a large width and other columns whose cells contain only single words may end up too narrow. The :rst:dir:`tabularcolumns` can help solve this via providing to LaTeX a custom "alignment preamble" (aka "colspec"). For example ``lJJ`` will be suitable for a three-columns table whose first column contains only single words and the other two have cells with long paragraphs.
ta: ``டேபுலரி`` அல்காரிதம் பெரும்பாலும் நன்றாக வேலை செய்கிறது, ஆனால் சில சமயங்களில் ஒரு கலத்தில் நீண்ட பத்திகள் இருக்கும் போது, ​​நெடுவரிசைக்கு பெரிய அகலம் வழங்கப்படும் மற்றும் மற்ற நெடுவரிசைகளில் ஒற்றை வார்த்தைகள் மட்டுமே இருக்கும். :rst:dir:`tabularcolumns`, லாடெக்சு க்கு தனிப்பயன் "சீரமைப்பு முன்னுரை" (aka "colspec") வழங்குவதன் மூலம் இதைத் தீர்க்க உதவும். எடுத்துக்காட்டாக, ``lJJ`` என்பது மூன்று நெடுவரிசை அட்டவணைக்கு ஏற்றது, அதன் முதல் நெடுவரிசையில் ஒற்றை வார்த்தைகள் மட்டுமே உள்ளன, மற்ற இரண்டில் நீண்ட பத்திகள் கொண்ட கலங்கள் உள்ளன.

source: Of course, a fully automated solution would be better, and it is still hoped for, but it is an intrinsic aspect of ``tabulary``, and the latter is in use by Sphinx ever since ``0.3``... It looks as if solving the problem of squeezed columns could require substantial changes to that LaTeX package. And no good alternative appears to exist, as of 2025.
ta: நிச்சயமாக, ஒரு முழுமையான தானியங்கு தீர்வு சிறப்பாக இருக்கும், அது இன்னும் எதிர்பார்க்கப்படுகிறது, ஆனால் இது ``டேபுலரி``ன் உள்ளார்ந்த அம்சமாகும், மேலும் பிந்தையது ``0.3`` என்பதிலிருந்து ச்பிங்க்சால் பயன்பாட்டில் உள்ளது... அழுத்தப்பட்ட நெடுவரிசைகளின் சிக்கலைத் தீர்க்க அந்த லாடெக்சு தொகுப்பில் கணிசமான மாற்றங்கள் தேவைப்படுவது போல் தெரிகிறது. 2025 ஆம் ஆண்டு நிலவரப்படி நல்ல மாற்று எதுவும் இருப்பதாகத் தெரியவில்லை.

source: A way to solve the issue for all tables at once, is to inject in the LaTeX preamble (see :confval:`latex_elements`) a command such as ``\setlength{\tymin}{1cm}`` which causes all columns to be at least ``1cm`` wide (not counting inter-column whitespace). Currently, Sphinx configures ``\tymin`` to allow room for three characters at least.
ta: எல்லா அட்டவணைகளுக்கும் ஒரே நேரத்தில் சிக்கலைத் தீர்ப்பதற்கான ஒரு வழி, லாடெக்சு முன்னுரையில் (பார்க்க :confval:`latex_elements`) ``\setlength{\tymin}{1cm}`` போன்ற கட்டளையை உட்செலுத்துவது, இது அனைத்து நெடுவரிசைகளும் குறைந்தபட்சம் ``1cm`` அகலமாக இருக்கும் (இடை-நெடுவரிசை இடைவெளியைக் கணக்கிடாது). தற்போது, ​​குறைந்தது மூன்று எழுத்துகளுக்கு இடமளிக்க சூரரிமாச்சிலை ``\tymin`` ஐ உள்ளமைக்கிறது.

source: Here is a more sophisticated "colspec", for a 4-columns table:
ta: 4-நெடுவரிசை அட்டவணைக்கு மிகவும் நுட்பமான "கோல்ச்பெக்" இங்கே உள்ளது:

source: This is used in Sphinx own PDF docs at :ref:`dev-deprecated-apis`. Regarding column widths, this "colspec" achieves the same as would ``:widths:`` option set to ``40 10 12 38`` but it injects extra effects.
ta: இது சூரரிமாச்சிலை சொந்த PDF ஆவணத்தில் :ref:`dev-deprecated-apis` இல் பயன்படுத்தப்படுகிறது. நெடுவரிசை அகலங்களைப் பொறுத்தவரை, இந்த "கோல்ச்பெக்" ஆனது ``:அகலங்கள்:`` விருப்பத்தை ``40 10 12 38`` என அமைக்கிறது, ஆனால் அது கூடுதல் விளைவுகளைச் செலுத்துகிறது.

source: In case both :rst:dir:`tabularcolumns` and ``:widths:`` option of table directives are used, ``:widths:`` option will be ignored by the LaTeX builder. Of course it is obeyed by other builders.
ta: அட்டவணை வழிமுறைகளின் :rst:dir:`tabularcolumns` மற்றும் ``:widths:`` ஆகிய இரண்டும் பயன்படுத்தப்பட்டால், ``:widths:`` விருப்பம் லாடெக்சு பில்டரால் புறக்கணிக்கப்படும். நிச்சயமாக இது மற்ற பில்டர்களால் கடைப்பிடிக்கப்படுகிறது.

source: Literal blocks do not work at all with ``tabulary`` and Sphinx will then fall back to ``tabular`` LaTeX environment. It will employ the :rst:dir:`tabularcolumns` specification in that case only if it contains no usage of the ``tabulary`` specific column types (which are ``L``, ``R``, ``C`` and ``J``).
ta: லிட்டரல் பிளாக்குகள் ``டேபுலரி`` உடன் வேலை செய்யாது, பின்னர் சூரரிமாச்சிலை ``டேபுலர்`` லேடெக்ச் சூழலுக்குத் திரும்பும். அது ``டேபுலரி`` குறிப்பிட்ட நெடுவரிசை வகைகளின் (``எல்``, ``ஆர்``, ``சி`` மற்றும் ``சே``) பயன்பாடு இல்லாமல் இருந்தால் மட்டுமே அது :rst:dir:`tabularcolumns` விவரக்குறிப்பைப் பயன்படுத்தும்.

source: Besides the LaTeX ``l``, ``r``, ``c`` and ``p{width}`` column specifiers, and the ``tabulary`` specific ``L``, ``R``, ``C`` and ``J``, one can also use (with all table types) ``\X{a}{b}`` which configures the column width to be a fraction ``a/b`` of the total line width and ``\Y{f}`` where ``f`` is a decimal: for example ``\Y{0.2}`` means that the column will occupy ``0.2`` times the line width.
ta: லாடெக்சு ``l``, ``r``, ``c`` மற்றும் ``p{width}`` நெடுவரிசைக் குறிப்பான்கள், மற்றும் ```டேபுலரி`` குறிப்பிட்ட ``L``, ``R``, ``C`` மற்றும் ``J`` ஆகியவற்றைத் தவிர, ஒருவர் பயன்படுத்தலாம் (அனைத்து அட்டவணை வகைகளுடன்) ``\X` அகலம் `a } ``a/b`` மொத்த வரி அகலம் மற்றும் ``\Y{a}`` இங்கு ``f`` என்பது தசமமாகும்: எடுத்துக்காட்டாக ``\Y{b}`` என்பது நெடுவரிசை வரி அகலத்தை விட ``0.2`` மடங்குகளை ஆக்கிரமிக்கும்.

source: Sphinx uses ``J`` (justified) by default with ``tabulary``, not ``L`` (flushed-left). To revert, include ``\newcolumntype{T}{L}`` in the LaTeX preamble, as in fact Sphinx uses ``T`` and sets it by default to be an alias of ``J``.
ta: சூரரிமாச்சிலை முன்னிருப்பாக ``டேபுலரி`` உடன் ``சே`` (நியாயப்படுத்தப்பட்டது) பயன்படுத்துகிறது, ``எல்`` (ஃப்ளச்-இடது) அல்ல. மாற்றியமைக்க, லாடெக்சு முன்னுரையில் ``\nபுதிய நெடுவரிசை வகை{T}{L}`` சேர்க்கவும், உண்மையில் சூரரிமாச்சிலை ``T`` ஐப் பயன்படுத்துகிறது மற்றும் அதை இயல்பாக ``J`` இன் மாற்றுப்பெயராக அமைக்கிறது.

source: Formerly, Sphinx did not use ``tabulary`` if the table had at least one cell containing "problematic" elements such as lists, object descriptions, blockquotes (etc...) because such contents are not out-of-the-box compatible with ``tabulary``. At ``9.0`` a technique, which was already in use for merged cells, was extended to such cases, and the sole "problematic" contents are code-blocks and nested tables. So tables containing (only) cells with multiple paragraphs, bullet or enumerated lists, or line blocks, will now better fit to their contents (if not rendered by ``longtable``). Cells with object descriptions or admonitions will still have a tendency to induce the table to fill the full text area width, but columns in that table with no such contents will be tighter.
ta: முன்னர், பட்டியல்கள், பொருள் விளக்கங்கள், தொகுதி மேற்கோள்கள் (முதலிய...) போன்ற "சிக்கல்" கூறுகளைக் கொண்ட அட்டவணையில் குறைந்தபட்சம் ஒரு கலமாவது இருந்தால், சூரரிமாச்சிலை ``டேபுலரி`` ஐப் பயன்படுத்தவில்லை, ஏனெனில் அத்தகைய உள்ளடக்கங்கள் ``டேபுலரி`` உடன் இணக்கமாக இல்லை. ``9.0`` இல், ஒருங்கிணைக்கப்பட்ட கலங்களுக்கு ஏற்கனவே பயன்பாட்டில் இருந்த ஒரு நுட்பம், அத்தகைய நிகழ்வுகளுக்கு நீட்டிக்கப்பட்டது, மேலும் ஒரே "சிக்கல்" உள்ளடக்கங்கள் குறியீடு-தொகுதிகள் மற்றும் உள்ளமை அட்டவணைகள் ஆகும். எனவே பல பத்திகள், புல்லட் அல்லது எண்ணிடப்பட்ட பட்டியல்கள் அல்லது வரித் தொகுதிகள் கொண்ட (மட்டும்) கலங்களைக் கொண்ட அட்டவணைகள், அவற்றின் உள்ளடக்கங்களுக்கு (``நீண்ட அட்டவணை`` மூலம் வழங்கப்படாவிட்டால்) இப்போது நன்றாகப் பொருந்தும். பொருள் விளக்கங்கள் அல்லது அறிவுரைகளைக் கொண்ட கலங்கள் முழு உரை பகுதி அகலத்தை நிரப்ப அட்டவணையைத் தூண்டும் போக்கைக் கொண்டிருக்கும், ஆனால் அத்தகைய உள்ளடக்கங்கள் இல்லாத அட்டவணையில் உள்ள நெடுவரிசைகள் இறுக்கமாக இருக்கும்.

source: To force usage of the LaTeX ``longtable`` environment pass ``longtable`` as a ``:class:`` option to :dudir:`table`, :dudir:`csv-table`, or :dudir:`list-table`. Use :ref:`rst-class <rstclass>` for other tables.
ta: லேடெக்ச் `` லாங்டபிள்`` சூழல் `` லாங்டபிள்`` ஐ ``: வகுப்பு: `` விருப்பத்திற்கு: துடிர்: `அட்டவணை`,: டுடிர்:` சி.எச்.வி-டேபிள்`, அல்லது: துடிர்: ` பட்டியல்-அட்டவணை`. பயன்படுத்தவும்: ref: `rst-class <rstclass>` மற்ற அட்டவணைகளுக்கு.

source: Math
ta: கணிதம்

source: The input language for mathematics is LaTeX markup. This is the de-facto standard for plain-text math notation and has the added advantage that no further translation is necessary when building LaTeX output.
ta: கணிதத்திற்கான உள்ளீட்டு மொழி லேடெக்ச் மார்க்அப் ஆகும். இது வெற்று-உரை கணித குறியீட்டிற்கான டி-ஃபாக்டோ தரநிலையாகும், மேலும் லேடெக்ச் வெளியீட்டை உருவாக்கும்போது மேலும் மொழிபெயர்ப்பு தேவையில்லை என்பதற்கு கூடுதல் நன்மை உண்டு.

source: Keep in mind that when you put math markup in **Python docstrings** read by :mod:`autodoc <sphinx.ext.autodoc>`, you either have to double all backslashes, or use Python raw strings (``r"raw"``).
ta: நீங்கள் கணித மார்க்அப்பை ** பைதான் டாக்ச்ட்ரிங்சில் வைக்கும்போது ** படித்தவர்: மோட்: `ஆட்டோடோக் <sphinx.ext.autodoc>`, நீங்கள் எல்லா பின்சாய்வுக்கோல்களையும் இரட்டிப்பாக்க வேண்டும், அல்லது பைதான் மூல சரங்களை பயன்படுத்த வேண்டும் (`` r " மூல "` `).

source: Directive for displayed math (math that takes the whole line for itself).
ta: காட்டப்படும் கணிதத்திற்கான கட்டளை (கணிதம் முழு வரியையும் தனக்குத்தானே எடுக்கும்).

source: The directive supports multiple equations, which should be separated by a blank line::
ta: கட்டளை பல சமன்பாடுகளை ஆதரிக்கிறது, இது ஒரு வெற்று வரியால் பிரிக்கப்பட வேண்டும் ::

source: In addition, each single equation is set within a ``split`` environment, which means that you can have multiple aligned lines in an equation, aligned at ``&`` and separated by ``\\``::
ta: கூடுதலாக, ஒவ்வொரு ஒற்றை சமன்பாடும் ஒரு `` பிளவு`` சூழலுக்குள் அமைக்கப்பட்டுள்ளது, அதாவது நீங்கள் ஒரு சமன்பாட்டில் பல சீரமைக்கப்பட்ட வரிகளைக் கொண்டிருக்கலாம், `` & `` இல் சீரமைக்கப்பட்டு `` \\ `` ::

source: For more details, look into the documentation of the `AmSMath LaTeX package`_.
ta: மேலும் விவரங்களுக்கு, `அம்ச்மாத் லேடெக்ச் தொகுப்பு`_ இன் ஆவணங்களைப் பாருங்கள்.

source: When the math is only one line of text, it can also be given as a directive argument::
ta: கணிதம் உரையின் ஒரே ஒரு வரியாக இருக்கும்போது, அதை ஒரு கட்டளை வாதமாகவும் வழங்கலாம் ::

source: Normally, equations are not numbered. If you want your equation to get a number, use the ``label`` option. When given, it selects an internal label for the equation, by which it can be cross-referenced, and causes an equation number to be issued. See :rst:role:`eq` for an example. The numbering style depends on the output format.
ta: பொதுவாக, சமன்பாடுகள் எண்ணப்படவில்லை. உங்கள் சமன்பாடு ஒரு எண்ணைப் பெற விரும்பினால், `` லேபிள்`` விருப்பத்தைப் பயன்படுத்தவும். வழங்கப்படும்போது, இது சமன்பாட்டிற்கான ஒரு உள் லேபிளைத் தேர்ந்தெடுக்கிறது, இதன் மூலம் அதை குறுக்கு-குறிப்பிடலாம், மேலும் ஒரு சமன்பாடு எண்ணை வழங்குகிறது. காண்க: rst: பங்கு: `eq` ஒரு எடுத்துக்காட்டுக்கு. எண்ணும் பாணி வெளியீட்டு வடிவமைப்பைப் பொறுத்தது.

source: Prevent wrapping of the given math in a math environment. When you give this option, you must make sure yourself that the math is properly set up. For example::
ta: கொடுக்கப்பட்ட கணிதத்தை கணித சூழலில் மடக்குவதைத் தடுக்கவும். இந்த விருப்பத்தை நீங்கள் கொடுக்கும்போது, ​​​​கணிதம் சரியாக அமைக்கப்பட்டுள்ளதா என்பதை நீங்களே உறுதிப்படுத்திக் கொள்ள வேண்டும். உதாரணமாக::

source: The directive option ``:nowrap:`` was renamed to ``:no-wrap:``.
ta: கட்டளை விருப்பமான ``:nowrap:`` ``:no-wrap:`` என மறுபெயரிடப்பட்டது.

source: The previous name has been retained as an alias, but will be deprecated and removed in a future version of Sphinx.
ta: முந்தைய பெயர் மாற்றுப்பெயராகத் தக்கவைக்கப்பட்டது, ஆனால் ச்பிங்க்சின் எதிர்காலப் பதிப்பில் நீக்கப்பட்டு அகற்றப்படும்.

source: :ref:`math-support`
ta: : குறிப்பு: `கணித ஆதரவு`

source: Rendering options for math with HTML builders.
ta: html பில்டர்களுடன் கணிதத்திற்கான விருப்பங்களை வழங்குதல்.

source: Explains how to configure LaTeX builder to support Unicode literals in math mark-up.
ta: கணித மார்க்-அப் இல் யூனிகோட் லிட்டரர்களை ஆதரிக்க லேடெக்ச் பில்டரை எவ்வாறு கட்டமைப்பது என்பதை விளக்குகிறது.

source: Grammar production displays
ta: இலக்கண விளைவாக்கம் காட்சிகள்

source: Special markup is available for displaying the productions of a formal grammar. The markup is simple and does not attempt to model all aspects of BNF_ (or any derived forms), but provides enough to allow context-free grammars to be displayed in a way that causes uses of a symbol to be rendered as hyperlinks to the definition of the symbol. There is this directive:
ta: முறையான இலக்கணத்தின் தயாரிப்புகளைக் காண்பிக்க சிறப்பு மார்க்அப் உள்ளது. மார்க்அப் எளிமையானது மற்றும் BNF_ இன் அனைத்து அம்சங்களையும் (அல்லது ஏதேனும் பெறப்பட்ட படிவங்கள்) மாதிரியாக்க முயற்சிக்காது, ஆனால் குறியீட்டின் வரையறைக்கு ஐப்பர்லிங்க்களாக வழங்கப்படுவதற்கு ஒரு குறியீட்டின் பயன்பாடுகளை ஏற்படுத்தும் வகையில் சூழல்-இலவச இலக்கணங்களைக் காட்ட அனுமதிக்க போதுமானது. இந்த கட்டளை உள்ளது:

source: This directive is used to enclose a group of productions. Each production is given on a single line and consists of a name, separated by a colon from the following definition. If the definition spans multiple lines, each continuation line must begin with a colon placed at the same column as in the first line. Blank lines are not allowed within ``productionlist`` directive arguments.
ta: தயாரிப்புகளின் குழுவை இணைக்க இந்த கட்டளை பயன்படுத்தப்படுகிறது. ஒவ்வொரு உற்பத்தியும் ஒரு வரியில் கொடுக்கப்பட்டுள்ளது மற்றும் பின்வரும் வரையறையிலிருந்து ஒரு பெருங்குடலால் பிரிக்கப்பட்ட ஒரு பெயரைக் கொண்டுள்ளது. வரையறை பல கோடுகளை உள்ளடக்கியிருந்தால், ஒவ்வொரு தொடரும் வரியும் முதல் வரியில் உள்ள அதே நெடுவரிசையில் வைக்கப்படும் பெருங்குடலுடன் தொடங்க வேண்டும். ``தயாரிப்புப் பட்டியல்`` கட்டளை வாதங்களுக்குள் வெற்றுக் கோடுகள் அனுமதிக்கப்படாது.

source: The optional *production_group* directive argument serves to distinguish different sets of production lists that belong to different grammars. Multiple production lists with the same *production_group* thus define rules in the same scope. This can also be used to split the description of a long or complex grammar across multiple ``productionlist`` directives with the same *production_group*.
ta: விருப்பமான *production_group* கட்டளை உரையாடல் வெவ்வேறு இலக்கணங்களுக்குச் சொந்தமான பல்வேறு தயாரிப்பு பட்டியல்களை வேறுபடுத்த உதவுகிறது. ஒரே *உற்பத்தி_குழு* கொண்ட பல தயாரிப்பு பட்டியல்கள் ஒரே நோக்கத்தில் விதிகளை வரையறுக்கின்றன. நீண்ட அல்லது சிக்கலான இலக்கணத்தின் விளக்கத்தை ஒரே *உற்பத்தி_குழு* மூலம் பல ``உற்பத்தி பட்டியல்`` வழிகாட்டுதல்களில் பிரிக்கவும் இது பயன்படுத்தப்படலாம்.

source: The definition can contain token names which are marked as interpreted text, (e.g. "``sum ::= `integer` "+" `integer```"), to generate cross-references to the productions of these tokens. Such cross-references implicitly refer to productions from the current group. To reference a production from another grammar, the token name must be prefixed with the group name and a colon, e.g. "``other-group:sum``". If the group of the token should not be shown in the production, it can be prefixed by a tilde, e.g., "``~other-group:sum``". To refer to a production from an unnamed grammar, the token should be prefixed by a colon, e.g., "``:sum``". No further reStructuredText parsing is done in the production, so that special characters (``*``, ``|``, etc) do not need to be escaped.
ta: இந்த டோக்கன்களின் தயாரிப்புகளுக்கு குறுக்கு-குறிப்புகளை உருவாக்க, விளக்க உரையாகக் குறிக்கப்பட்ட கிள்ளாக்கு பெயர்களைக் கொண்டிருக்கலாம், (எ.கா. "``சம் ::= `முழு" "+" `முழு```"). இத்தகைய குறுக்கு-குறிப்புகள் மறைமுகமாக தற்போதைய குழுவின் தயாரிப்புகளைக் குறிக்கின்றன. மற்றொரு இலக்கணத்திலிருந்து ஒரு தயாரிப்பைக் குறிப்பிட, கிள்ளாக்கு பெயரை குழுவின் பெயர் மற்றும் பெருங்குடலுடன் முன்னொட்டாக இருக்க வேண்டும், எ.கா. "``மற்ற குழு:தொகை``". தயாரிப்பில் டோக்கனின் குழு காட்டப்படக்கூடாது எனில், அதை ஒரு டில்டே மூலம் முன்னொட்டாக வைக்கலாம், எ.கா., "``~மற்ற குழு:தொகை``". பெயரிடப்படாத இலக்கணத்திலிருந்து தயாரிப்பைக் குறிப்பிட, கிள்ளாக்கு ஒரு பெருங்குடலால் முன்னொட்டப்பட வேண்டும், எ.கா., "``:தொகை``". தயாரிப்பில் மேலும் மறுகட்டமைக்கப்பட்ட உரை பாகுபடுத்தல் செய்யப்படுவதில்லை, அதனால் சிறப்பு எழுத்துக்கள் (``*``, ``|`` போன்றவை) தப்பிக்க வேண்டிய அவசியமில்லை.

source: Token productions can be cross-referenced outwith the production list by using the :rst:role:`token` role. If you have used a *production_group* argument, the token name must be prefixed with the group name and a colon, e.g., "``my_group:sum``" instead of just "``sum``". Standard :ref:`cross-referencing modifiers <xref-modifiers>` may be used with the ``:token:`` role, such as custom link text and suppressing the group name with a tilde (``~``).
ta: கிள்ளாக்கு தயாரிப்புகள் :rst:role:`token` பாத்திரத்தைப் பயன்படுத்தி உற்பத்திப் பட்டியலில் குறுக்கு-குறிப்பிடப்படலாம். நீங்கள் *production_group* வாதத்தைப் பயன்படுத்தியிருந்தால், கிள்ளாக்கு பெயர் குழுவின் பெயருடனும் பெருங்குடலுடனும் முன்னொட்டாக இருக்க வேண்டும், எ.கா. "``sum`` என்பதற்குப் பதிலாக "``my_group:sum``". நிலையான :ref:`cross-referencing modifiers <xref-modifiers>` தனிப்பயன் இணைப்பு உரை மற்றும் குழு பெயரை டில்டே (``~``) மூலம் அடக்குதல் போன்ற ``:token:`` பாத்திரத்துடன் பயன்படுத்தப்படலாம்.

source: The following is an example taken from the Python Reference Manual::
ta: பைதான் குறிப்பு கையேட்டில் இருந்து எடுக்கப்பட்ட ஒரு எடுத்துக்காட்டு பின்வருமாறு ::

source: Footnotes
ta: அடிக்குறிப்புகள்

source: The LaTeX writer only refers the ``maxdepth`` option of first toctree directive in the document.
ta: லேடெக்ச் எழுத்தாளர் ஆவணத்தில் முதல் டோக்ட்ரீ உத்தரவின் `` மேக்ச்டெப்ட்`` விருப்பத்தை மட்டுமே குறிப்பிடுகிறார்.

source: A note on available globbing syntax: you can use the standard shell constructs ``*``, ``?``, ``[...]`` and ``[!...]`` with the feature that these all don't match slashes. A double star ``**`` can be used to match any sequence of characters *including* slashes.
ta: கிடைக்கக்கூடிய குளோபிங் தொடரியல் பற்றிய குறிப்பு: நீங்கள் நிலையான செல் கட்டமைப்பதைப் பயன்படுத்தலாம் ``*``, ``? இவை அனைத்தும் குறைப்புகளுடன் பொருந்தவில்லை. *ச்லாச்கள் உட்பட எழுத்துக்களின் எந்தவொரு வரிசையையும் பொருத்த இரட்டை விண்மீன் `` ** `` பயன்படுத்தப்படலாம்.

source: There is a standard ``.. include`` directive, but it raises errors if the file is not found. This one only emits a warning.
ta: ஒரு நிலையான `` ..`` உத்தரவைச் சேர்க்கவும், ஆனால் கோப்பு கிடைக்கவில்லை என்றால் அது பிழைகளை எழுப்புகிறது. இது ஒரு எச்சரிக்கையை மட்டுமே வெளியிடுகிறது.

source: For most builders name and format are the same. At the moment only builders derived from the html builder distinguish between the builder format and the builder name.
ta: பெரும்பாலான பில்டர்களுக்கு பெயர் மற்றும் வடிவம் ஒன்றே. இந்த நேரத்தில் html பில்டரிடமிருந்து பெறப்பட்ட பில்டர்கள் மட்டுமே பில்டர் வடிவத்திற்கும் பில்டர் பெயருக்கும் இடையில் வேறுபடுகிறார்கள்.

source: Note that the current builder tag is not available in ``conf.py``, it is only available after the builder is initialized.
ta: தற்போதைய பில்டர் குறிச்சொல் `` conf.py`` இல் கிடைக்கவில்லை என்பதை நினைவில் கொள்க, இது பில்டர் துவக்கப்பட்ட பின்னரே கிடைக்கும்.
