Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_changes--3_4_*.po
Languages: ta

source: Sphinx 3.4
ta: சூரரிமாச்சிலை 3.4

source: Release 3.4.3 (released Jan 08, 2021)
ta: வெளியீடு 3.4.3 (ஜனவரி 08, 2021 இல் வெளியிடப்பட்டது)

source: Bugs fixed
ta: பிழைகள் சரி செய்யப்பட்டன

source: #8655: autodoc: Failed to generate document if target module contains an object that raises an exception on ``hasattr()``
ta: #8655: autodoc: இலக்கு தொகுதியில் ``hasattr()`` இல் விதிவிலக்கு எழுப்பும் பொருள் இருந்தால் ஆவணத்தை உருவாக்க முடியவில்லை

source: Release 3.4.2 (released Jan 04, 2021)
ta: வெளியீடு 3.4.2 (ஜனவரி 04, 2021 வெளியிடப்பட்டது)

source: #8164: autodoc: Classes that inherit mocked class are not documented
ta: #8164: autodoc: கேலி செய்யப்பட்ட வகுப்பைப் பெற்ற வகுப்புகள் ஆவணப்படுத்தப்படவில்லை

source: #8602: autodoc: The ``autodoc-process-docstring`` event is emitted to the non-datadescriptors unexpectedly
ta: #8602: autodoc: ``autodoc-process-docstring`` நிகழ்வு எதிர்பாராதவிதமாக டேட்டா ச்கிரிப்டர்களுக்கு அனுப்பப்பட்டது.

source: #8616: autodoc: AttributeError is raised on non-class object is passed to autoclass directive
ta: #8616: autodoc: பண்புப் பிழையானது வகுப்பு அல்லாத பொருளில் எழுப்பப்பட்டது, அது ஆட்டோகிளாச் கட்டளைக்கு அனுப்பப்படுகிறது

source: Release 3.4.1 (released Dec 25, 2020)
ta: வெளியீடு 3.4.1 (டிசம்பர் 25, 2020 வெளியிடப்பட்டது)

source: #8559: autodoc: AttributeError is raised when using forward-reference type annotations
ta: #8559: autodoc: முன்னோக்கு-குறிப்பு வகை சிறுகுறிப்புகளைப் பயன்படுத்தும் போது பண்புப் பிழை எழுப்பப்படுகிறது

source: #8568: autodoc: TypeError is raised on checking slots attribute
ta: #8568: autodoc: ச்லாட் பண்புக்கூறைச் சரிபார்ப்பதில் தட்டச்சுப் பிழை எழுகிறது

source: #8567: autodoc: Instance attributes are incorrectly added to Parent class
ta: #8567: autodoc: பெற்றோர் வகுப்பில் நிகழ்வு பண்புக்கூறுகள் தவறாக சேர்க்கப்பட்டுள்ளன

source: #8566: autodoc: The ``autodoc-process-docstring`` event is emitted to the alias classes unexpectedly
ta: #8566: autodoc: ``autodoc-process-docstring`` நிகழ்வு எதிர்பாராதவிதமாக மாற்றுப்பெயர் வகுப்புகளுக்கு வெளியிடப்பட்டது

source: #8583: autodoc: Unnecessary object comparison via ``__eq__`` method
ta: #8583: autodoc: ``__eq__`` முறை மூலம் தேவையற்ற பொருள் ஒப்பீடு

source: #8565: linkcheck: Fix PriorityQueue crash when link tuples are not comparable
ta: #8565: இணைப்புச் சரிபார்ப்பு: இணைப்பு டூப்பிள்கள் ஒப்பிட முடியாதபோது முன்னுரிமை வரிசை செயலிழப்பை சரிசெய்யவும்

source: Release 3.4.0 (released Dec 20, 2020)
ta: வெளியீடு 3.4.0 (டிசம்பர் 20, 2020 வெளியிடப்பட்டது)

source: Incompatible changes
ta: பொருந்தாத மாற்றங்கள்

source: #8105: autodoc: the signature of class constructor will be shown for decorated classes, not a signature of decorator
ta: #8105: autodoc: அலங்கரிக்கப்பட்ட வகுப்புகளுக்கு வகுப்பு கட்டமைப்பாளரின் கையொப்பம் காட்டப்படும், அலங்கரிப்பவரின் கையொப்பம் அல்ல

source: Deprecated
ta: மதிப்பிடப்பட்டது

source: The ``follow_wrapped`` argument of ``sphinx.util.inspect.signature()``
ta: `` Sphinx.util.inspect.signature () ``

source: The ``no_docstring`` argument of ``sphinx.ext.autodoc.Documenter.add_content()``
ta: `` Sphinx.ext.autodoc.documenter.add_content () `` `` `no_docstring`` வாதம்` `

source: ``sphinx.ext.autodoc.InstanceAttributeDocumenter``
ta: `` sphinx.ext.autodoc.instanceattributetocumenter``

source: ``sphinx.ext.autodoc.SlotsAttributeDocumenter``
ta: `` sphinx.ext.autodoc.slotsattributetocumenter``

source: Features added
ta: அம்சங்கள் சேர்க்கப்பட்டன

source: #8119: autodoc: Allow to determine whether a member not included in ``__all__`` attribute of the module should be documented or not via :event:`autodoc-skip-member` event
ta: #8119: autodoc: தொகுதியின் ``__all__`` பண்புக்கூறில் சேர்க்கப்படாத உறுப்பினர் :event:`autodoc-skip-member` நிகழ்வின் மூலம் ஆவணப்படுத்தப்பட வேண்டுமா இல்லையா என்பதைத் தீர்மானிக்க அனுமதிக்கவும்.

source: #8219: autodoc: Parameters for generic class are not shown when super class is a generic class and show-inheritance option is given (in Python 3.7 or above)
ta: #8219: autodoc: சூப்பர் கிளாச் பொதுவான வகுப்பாக இருக்கும் போது பொதுவான வகுப்பிற்கான அளவுருக்கள் காட்டப்படாது மற்றும் சோ-இன்அரிட்டன்ச் விருப்பம் கொடுக்கப்பட்டிருக்கும் (பைதான் 3.7 அல்லது அதற்கு மேல்)

source: autodoc: Add ``Documenter.config`` as a shortcut to access the config object
ta: ஆட்டோடோக்: கட்டமைப்பு பொருளை அணுக குறுக்குவழியாக `` dopucier.config`` ஐச் சேர்க்கவும்

source: autodoc: Add ``Optional[t]`` to annotation of function and method if a default value equal to ``None`` is set.
ta: ஆட்டோடோக்: இயல்புநிலை மதிப்பு `` `எதுவுமில்லை`` க்கு சமமான செயல்பாடு மற்றும் முறையை சிறுகுறிப்புக்கு` `விருப்பமான [t]` `சேர்க்கவும்.

source: #8209: autodoc: Add ``:no-value:`` option to :rst:dir:`autoattribute` and :rst:dir:`autodata` directive to suppress the default value of the variable
ta: #8209: autodoc: மாறியின் இயல்புநிலை மதிப்பை அடக்குவதற்கு ``:no-value:`` விருப்பத்தை :rst:dir:`autoattribute` மற்றும் :rst:dir:`autodata` கட்டளையைச் சேர்க்கவும்

source: #8460: autodoc: Support custom types defined by typing.NewType
ta: #8460: autodoc: தட்டச்சு செய்வதன் மூலம் வரையறுக்கப்பட்ட தனிப்பயன் வகைகளை ஆதரிக்கவும்.NewType

source: #8285: napoleon: Add :confval:`napoleon_attr_annotations` to merge type hints on source code automatically if any type is specified in docstring
ta: #8285: napoleon: docstring இல் ஏதேனும் வகை குறிப்பிடப்பட்டிருந்தால், மூலக் குறியீட்டில் உள்ள வகை குறிப்புகளை தானாகவே ஒன்றிணைக்க :confval:`napoleon_attr_annotations` ஐச் சேர்க்கவும்

source: #8236: napoleon: Support numpydoc's "Receives" section
ta: #8236: நெப்போலியன்: நம்பி டாக்ச் "பெறப்பட்டது" பிரிவுக்கு உதவி

source: #6914: Add a new event :event:`warn-missing-reference` to custom warning messages when failed to resolve a cross-reference
ta: #6914: குறுக்குக் குறிப்பைத் தீர்க்கத் தவறினால் தனிப்பயன் முன்னறிவிப்பு செய்திகளில் புதிய நிகழ்வைச் சேர்க்கவும் :event:`warn-missing-reference`

source: #6914: Emit a detailed warning when failed to resolve a ``:ref:`` reference
ta: #6914: ``:ref:`` குறிப்பைத் தீர்க்கத் தவறினால் விரிவான எச்சரிக்கையை வெளியிடவும்

source: #6629: linkcheck: The builder now handles rate limits. See :confval:`linkcheck_rate_limit_timeout` for details.
ta: #6629: இணைப்புச் சரிபார்ப்பு: பில்டர் இப்போது கட்டண வரம்புகளைக் கையாளுகிறார். விவரங்களுக்கு :confval:`linkcheck_rate_limit_timeout` ஐப் பார்க்கவும்.

source: #7613: autodoc: autodoc does not respect __signature__ of the class
ta: #7613: autodoc: autodoc வகுப்பின் __கையொப்பத்தை_ மதிப்பதில்லை

source: #4606: autodoc: the location of the warning is incorrect for inherited method
ta: #4606: autodoc: மரபுவழி முறைக்கு முன்னறிவிப்பு இடம் தவறானது

source: #8105: autodoc: the signature of class constructor is incorrect if the class is decorated
ta: #8105: autodoc: கிளாச் அலங்கரிக்கப்பட்டிருந்தால், கிளாச் கன்ச்ட்ரக்டரின் கையொப்பம் தவறானது

source: #8434: autodoc: :confval:`autodoc_type_aliases` does not effect to variables and attributes
ta: #8434: autodoc: :confval:`autodoc_type_aliases` மாறிகள் மற்றும் பண்புகளை பாதிக்காது

source: #8443: autodoc: autodata directive can't create document for PEP-526 based type annotated variables
ta: #8443: autodoc: PEP-526 அடிப்படையிலான சிறுகுறிப்பு மாறிகளுக்கான ஆவணத்தை ஆட்டோடேட்டா கட்டளையால் உருவாக்க முடியாது

source: #8443: autodoc: autoattribute directive can't create document for PEP-526 based uninitialized variables
ta: #8443: autodoc: autoattribute கட்டளையால் PEP-526 அடிப்படையிலான துவக்கமற்ற மாறிகளுக்கான ஆவணத்தை உருவாக்க முடியாது

source: #8480: autodoc: autoattribute could not create document for __slots__ attributes
ta: #8480: autodoc: autoattribute __slots__ பண்புக்கூறுகளுக்கான ஆவணத்தை உருவாக்க முடியவில்லை

source: #8503: autodoc: autoattribute could not create document for a GenericAlias as class attributes correctly
ta: #8503: autodoc: autoattribute ஆனது, வகுப்பு பண்புக்கூறுகளாக, பொதுவான மாற்றுப்பொருளுக்கான ஆவணத்தை உருவாக்க முடியவில்லை.

source: #8534: autodoc: autoattribute could not create document for a commented attribute in alias class
ta: #8534: autodoc: autoattribute ஆனது மாற்று வகுப்பில் கருத்து தெரிவிக்கப்பட்ட பண்புக்கூறுக்கான ஆவணத்தை உருவாக்க முடியவில்லை

source: #8452: autodoc: autodoc_type_aliases doesn't work when autodoc_typehints is set to "description"
ta: #8452: autodoc: autodoc_typehints "விளக்கம்" என அமைக்கப்படும் போது autodoc_type_aliases வேலை செய்யாது

source: #8541: autodoc: autodoc_type_aliases doesn't work for the type annotation to instance attributes
ta: #8541: autodoc: autodoc_type_aliases நிகழ்வு பண்புக்கூறுகளுக்கான வகை சிறுகுறிப்புக்கு வேலை செய்யாது

source: #8460: autodoc: autodata and autoattribute directives do not display type information of TypeVars
ta: #8460: autodoc: autodata மற்றும் autoattribute கட்டளைகள் TypeVars வகைத் தகவலைக் காட்டாது

source: #8493: autodoc: references to builtins not working in class aliases
ta: #8493: autodoc: வகுப்பு மாற்றுப்பெயர்களில் வேலை செய்யாத பில்டின்கள் பற்றிய குறிப்புகள்

source: #8522: autodoc: ``__bool__`` method could be called
ta: #8522: autodoc: ``__bool__`` முறையை அழைக்கலாம்

source: #8067: autodoc: A typehint for the instance variable having type_comment on super class is not displayed
ta: #8067: ஆட்டோடாக்: சூப்பர் கிளாசில் டைப்_கமென்ட் கொண்ட நிகழ்வு மாறிக்கான டைப்இன்ட் காட்டப்படவில்லை

source: #8545: autodoc: a __slots__ attribute is not documented even having docstring
ta: #8545: autodoc: ஒரு __slots__ பண்புக்கூறு docstring இருந்தாலும் ஆவணப்படுத்தப்படவில்லை

source: #741: autodoc: inherited-members doesn't work for instance attributes on super class
ta: #741: autodoc: பரம்பரை-உறுப்பினர்கள் சூப்பர் வகுப்பில் உள்ள பண்புக்கூறுகளுக்கு வேலை செய்யாது

source: #8477: autosummary: non utf-8 reST files are generated when template contains multibyte characters
ta: #8477: தன்னியக்க சுருக்கம்: டெம்ப்ளேட்டில் மல்டிபைட் எழுத்துகள் இருக்கும்போது utf-8 அல்லாத reST கோப்புகள் உருவாக்கப்படுகின்றன

source: #8501: autosummary: summary extraction splits text after "el at." unexpectedly
ta: #8501: தன்னியக்க சுருக்கம்: சுருக்கம் பிரித்தெடுத்தல் "el at" க்குப் பிறகு உரையைப் பிரிக்கிறது. எதிர்பாராத விதமாக

source: #8524: html: Wrong url_root has been generated on a document named "index"
ta: #8524: html: "index" என்ற ஆவணத்தில் தவறான url_root உருவாக்கப்பட்டுள்ளது

source: #8419: html search: Do not load ``language_data.js`` in non-search pages
ta: #8419: உஉகுமொ தேடல்: தேடாத பக்கங்களில் ```language_data.js`` ஐ ஏற்ற வேண்டாம்

source: #8549: i18n: ``-D gettext_compact=0`` is no longer working
ta: #8549: i18n: ``-D gettext_compact=0`` இனி வேலை செய்யாது

source: #8454: graphviz: The layout option for graph and digraph directives don't work
ta: #8454: graphviz: வரைபடம் மற்றும் டிக்ராஃப் வழிமுறைகளுக்கான தளவமைப்பு விருப்பம் வேலை செய்யாது

source: #8131: linkcheck: Use GET when HEAD requests cause Too Many Redirects, to accommodate infinite redirect loops on HEAD
ta: #8131: இணைப்புச் சரிபார்ப்பு: HEAD இல் எல்லையற்ற வழிமாற்று சுழற்சிகளுக்கு இடமளிக்க, HEAD கோரிக்கைகள் பல வழிமாற்றுகளை ஏற்படுத்தும் போது GET ஐப் பயன்படுத்தவும்

source: #8437: Makefile: ``make clean`` with empty BUILDDIR is dangerous
ta: #8437: மேக்ஃபைல்: காலியான BUILDDIR உடன் ``மேக் க்ளீன்`` என்பது ஆபத்தானது

source: #8365: py domain: ``:type:`` and ``:rtype:`` gives false ambiguous class lookup warnings
ta: #8365: py டொமைன்: ``:type:`` மற்றும் ``:rtype:`` தவறான தெளிவற்ற வகுப்பு தேடல் எச்சரிக்கைகளை அளிக்கிறது

source: #8352: std domain: Failed to parse an option that starts with bracket
ta: #8352: std டொமைன்: அடைப்புக்குறியுடன் தொடங்கும் விருப்பத்தை அலசுவதில் தோல்வி

source: #8519: LaTeX: Prevent page brake in the middle of a seealso
ta: #8519: LaTeX: நடுவில் பக்க முறிவைத் தடுக்கவும்

source: #8520: C, fix copying of AliasNode.
ta: #8520: சி, அலியாச்நோட் நகலெடுப்பதை சரிசெய்யவும்.
