Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_extdev--eventapi_*.po
Languages: ta

source: Event Manager API
ta: நிகழ்வு மேலாளர் பநிஇ

source: Event manager for Sphinx.
ta: ஸ்பிங்க்ஸிற்கான நிகழ்வு மேலாளர்.

source: Register a custom Sphinx event called *name*.
ta: *பெயர்* எனப்படும் தனிப்பயன் சூரரிமாச்சிலை நிகழ்வைப் பதிவுசெய்யவும்.

source: This is needed to be able to emit the event.
ta: நிகழ்வை வெளிப்படுத்த இது தேவை.

source: Parameters
ta: அளவுருக்கள்

source: The name of the event.
ta: நிகழ்வின் பெயர்.

source: Connect a handler to specific event.
ta: குறிப்பிட்ட நிகழ்வுக்கு ஒரு கையாளுபவரை இணைக்கவும்.

source: Register *callback* to be called when the *name* event is emitted.
ta: *பெயர்* நிகழ்வு வெளியிடப்படும் போது அழைக்கப்படும் *கால்பேக்* பதிவு.

source: See :ref:`event callbacks <events>` for details on available core events and the arguments of their corresponding callback functions.
ta: கிடைக்கக்கூடிய முக்கிய நிகழ்வுகள் மற்றும் அவற்றின் தொடர்புடைய கால்பேக் செயல்பாடுகளின் வாதங்கள் பற்றிய விவரங்களுக்கு :ref:`event callbacks <events>` ஐப் பார்க்கவும்.

source: The name of the target event.
ta: இலக்கு நிகழ்வின் பெயர்.

source: Callback function for the event.
ta: நிகழ்வுக்கான அழைப்பு செயல்பாடு.

source: The priority of the callback. The callbacks will be invoked in ascending order of *priority*.
ta: அழைப்பின் முன்னுரிமை. அழைப்புகள் *முன்னுரிமை* என்ற ஏறுவரிசையில் செயல்படுத்தப்படும்.

source: Returns
ta: வருமானம்

source: A listener ID, for use with the :meth:`disconnect` method.
ta: :meth:`disconnect` முறையுடன் பயன்படுத்த, கேட்பவர் அடையாளம்.

source: Support *priority*
ta: ஆதரவு *முன்னுரிமை *

source: Disconnect the handler given by *listener_id*.
ta: *listener_id* வழங்கிய ஏண்ட்லரைத் துண்டிக்கவும்.

source: A listener_id previously returned by :meth:`connect`.
ta: கேட்டவர்_ஐடி முன்பு :meth:`connect` மூலம் வழங்கப்பட்டது.

source: Emit a Sphinx event.
ta: ஒரு ஸ்பிங்க்ஸ் நிகழ்வை வெளியிடுங்கள்.

source: This emits the *name* event and passes *args* to the handler functions. Return the return values of all handlers as a list. Do not emit core Sphinx events in extensions!
ta: இது *பெயர்* நிகழ்வை வெளியிடுகிறது மற்றும் கையாளுபவர் செயல்பாடுகளுக்கு *args* ஐ அனுப்புகிறது. எல்லா ஏண்ட்லர்களின் ரிட்டர்ன் மதிப்புகளையும் பட்டியலாக வழங்கவும். முக்கிய சூரரிமாச்சிலை நிகழ்வுகளை நீட்டிப்புகளில் வெளியிட வேண்டாம்!

source: The name of the event that will be emitted.
ta: வெளிப்படும் நிகழ்வின் பெயர்.

source: The arguments for the event, to be passed to the handler functions.
ta: நிகழ்விற்கான வாதங்கள், கையாளுபவர் செயல்பாடுகளுக்கு அனுப்பப்பட வேண்டும்.

source: The list of exceptions that are allowed in the handlers.
ta: ஏண்ட்லர்களில் அனுமதிக்கப்படும் விதிவிலக்குகளின் பட்டியல்.

source: Added *allowed_exceptions* to specify path-through exceptions
ta: பாத்-மூலம் விதிவிலக்குகளைக் குறிப்பிட * அனுமதிக்கப்பட்ட_ எக்ஸ்செப்சஸ் * சேர்க்கப்பட்டது

source: Emit a Sphinx event and return the first result.
ta: சூரரிமாச்சிலை நிகழ்வை வெளியிட்டு முதல் முடிவைத் தரவும்.

source: This emits the *name* event and passes *args* to the handler functions. The first non-None result is returned.
ta: இது *பெயர்* நிகழ்வை வெளியிடுகிறது மற்றும் கையாளுபவர் செயல்பாடுகளுக்கு *args* ஐ அனுப்புகிறது. முதல் Non-ஆன முடிவு திரும்பியது.
