Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_changes--4_0_*.po
Languages: ta

source: Sphinx 4.0
ta: சூரரிமாச்சிலை 4.0

source: Release 4.0.3 (released Jul 05, 2021)
ta: வெளியீடு 4.0.3 (ஜூலை 05, 2021 வெளியிடப்பட்டது)

source: Features added
ta: அம்சங்கள் சேர்க்கப்பட்டன

source: C, add C23 keywords ``_Decimal32``, ``_Decimal64``, and ``_Decimal128``.
ta: C, C23 முக்கிய வார்த்தைகளை `` _decimal32``, `` _decimal64``, மற்றும் `` _decimal128`` ஐச் சேர்க்கவும்.

source: #9354: C, add :confval:`c_extra_keywords` to allow user-defined keywords during parsing.
ta: #9354: சி, பாகுபடுத்தும் போது பயனர் வரையறுக்கப்பட்ட முக்கிய வார்த்தைகளை அனுமதிக்க :confval:`c_extra_keywords` ஐ சேர்க்கவும்.

source: Revert the removal of ``sphinx.util:force_decode()`` to become some 3rd party extensions available again during 5.0
ta: 5.0 இன் போது மீண்டும் கிடைக்கும் சில 3 வது தரப்பு நீட்டிப்புகளாக மாற `` sphinx.util: force_decode () `` அகற்றப்படுவதை மாற்றவும்

source: Bugs fixed
ta: பிழைகள் சரி செய்யப்பட்டன

source: #9330: changeset domain: :rst:dir:`versionchanged` with contents being a list will cause error during pdf build
ta: #9330: changeet domain: :rst:dir:`versionchanged` உள்ளடக்கங்கள் பட்டியலாக இருப்பதால் pdf உருவாக்கத்தின் போது பிழை ஏற்படும்

source: #9313: LaTeX: complex table with merged cells broken since 4.0
ta: #9313: LaTeX: 4.0 இலிருந்து உடைந்த இணைக்கப்பட்ட கலங்களைக் கொண்ட சிக்கலான அட்டவணை

source: #9305: LaTeX: backslash may cause Improper discretionary list pdf build error with Japanese engines
ta: #9305: LaTeX: backslash சப்பானிய இயந்திரங்களுடன் தவறான விருப்பப் பட்டியல் pdf உருவாக்கப் பிழையை ஏற்படுத்தலாம்

source: #9354: C, remove special macro names from the keyword list. See also :confval:`c_extra_keywords`.
ta: #9354: சி, முக்கிய சொல் பட்டியலில் இருந்து சிறப்பு மேக்ரோ பெயர்களை அகற்றவும். மேலும் காண்க :confval:`c_extra_keywords`.

source: #9322: KeyError is raised on PropagateDescDomain transform
ta: #9322: PropagateDescDomain மாற்றத்தில் முக்கியப் பிழை எழுப்பப்பட்டது

source: Release 4.0.2 (released May 20, 2021)
ta: வெளியீடு 4.0.2 (மே 20, 2021 இல் வெளியிடப்பட்டது)

source: Dependencies
ta: சார்புநிலைகள்

source: #9216: Support jinja2-3.0
ta: #9216: சின்சா2-3.0ஐ ஆதரிக்கவும்

source: Incompatible changes
ta: பொருந்தாத மாற்றங்கள்

source: #9222: Update Underscore.js to 1.13.1
ta: #9222: Underscore.js ஐ 1.13.1 க்கு புதுப்பிக்கவும்

source: #9217: manpage: Stop creating a section directory on build manpage by default (see :confval:`man_make_section_directory`)
ta: #9217: manpage: பில்ட் மேன்பேசில் ஒரு பிரிவு கோப்பகத்தை இயல்பாக உருவாக்குவதை நிறுத்துங்கள் (பார்க்க :confval:`man_make_section_directory`)

source: #9210: viewcode: crashed if non importable modules found on parallel build
ta: #9210: பார்வைக் குறியீடு: இணையான கட்டமைப்பில் இறக்குமதி செய்ய முடியாத தொகுதிகள் கண்டறியப்பட்டால் செயலிழக்கப்படும்

source: #9240: Unknown node error for pending_xref_condition is raised if an extension that does not support the node installs a missing-reference handler
ta: #9240: கணுவை ஆதரிக்காத நீட்டிப்பு, விடுபட்ட குறிப்பு ஏண்ட்லரை நிறுவினால், நிலுவையில் உள்ள_xref_நிலைக்கான அறியப்படாத முனை பிழை எழுப்பப்படுகிறது.

source: Release 4.0.1 (released May 11, 2021)
ta: வெளியீடு 4.0.1 (மே 11, 2021 இல் வெளியிடப்பட்டது)

source: #9189: autodoc: crashed when ValueError is raised on generating signature from a property of the class
ta: #9189: autodoc: வகுப்பின் ஒரு சொத்திலிருந்து கையொப்பத்தை உருவாக்குவதில் மதிப்புப் பிழை எழுப்பப்பட்டபோது செயலிழந்தது

source: #9188: autosummary: warning is emitted if list value is set to autosummary_generate
ta: #9188: autosummary: பட்டியல் மதிப்பு autosummary_generate என அமைக்கப்பட்டால் முன்னறிவிப்பு வெளியிடப்படும்

source: #8380: html search: tags for search result are broken
ta: #8380: உஉகுமொ தேடல்: தேடல் முடிவுக்கான குறிச்சொற்கள் உடைந்தன

source: #9198: i18n: Babel emits errors when running compile_catalog
ta: #9198: i18n: compile_catalog ஐ இயக்கும் போது Babel பிழைகளை வெளியிடுகிறது

source: #9205: py domain: The :canonical: option causes "more than one target for cross-reference" warning
ta: #9205: py டொமைன்: :canonical: விருப்பம் "குறுக்கு குறிப்புக்கு ஒன்றுக்கும் மேற்பட்ட இலக்கு" எச்சரிக்கையை ஏற்படுத்துகிறது

source: #9201: websupport: UndefinedError is raised: 'css_tag' is undefined
ta: #9201: websupport: UndefinedError எழுப்பப்பட்டது: 'css_tag' வரையறுக்கப்படவில்லை

source: Release 4.0.0 (released May 09, 2021)
ta: வெளியீடு 4.0.0 (மே 09, 2021 இல் வெளியிடப்பட்டது)

source: 4.0.0b1
ta: 4.0.0 பி 1

source: Drop python 3.5 support
ta: பைதான் 3.5 ஆதரவை கைவிடவும்

source: Drop Docutils 0.12 and 0.13 support
ta: ஆவணங்களை 0.12 மற்றும் 0.13 ஆதரவை விடுங்கள்

source: LaTeX: add ``tex-gyre`` font dependency
ta: லேடெக்ஸ்: `` டெக்ஸ்-கைர்`` எழுத்துரு சார்பு சேர்க்கவும்

source: 4.0.0b2
ta: 4.0.0 பி 2

source: Support Docutils 0.17. Please notice it changes the output of HTML builder. Some themes do not support it, and you need to update your custom CSS to upgrade it.
ta: ஆதரிக்கவும் ஆவணங்கள் 0.17. இது HTML பில்டரின் வெளியீட்டை மாற்றுவதை கவனியுங்கள். சில கருப்பொருள்கள் அதை ஆதரிக்கவில்லை, அதை மேம்படுத்த உங்கள் தனிப்பயன் CSS ஐ புதுப்பிக்க வேண்டும்.

source: #8539: autodoc: info-field-list is generated into the class description when :confval:`autodoc_typehints`\ ``='description'`` and :confval:`autoclass_content`\ ``='class'`` set
ta: #8539: autodoc: info-field-list ஆனது வகுப்பு விளக்கத்தில் உருவாக்கப்படும் போது :confval:`autodoc_typehints`\ ``='description'`` மற்றும் :confval:`autoclass_content`\ ``='class'`` அமைக்கப்படும்

source: #8898: extlinks: "%s" becomes required keyword in the link caption string
ta: #8898: extlinks: இணைப்பு தலைப்பு சரத்தில் "%s" தேவையான முக்கிய சொல்லாக மாறும்

source: domain: The ``Index`` class becomes subclasses of ``abc.ABC`` to indicate methods that must be overridden in the concrete classes
ta: டொமைன்: கான்கிரீட் வகுப்புகளில் மீறப்பட வேண்டிய முறைகளைக் குறிக்க `` குறியீட்டு`` வகுப்பு `` abc.abc`` இன் துணைப்பிரிவுகளாக மாறுகிறது

source: #4826: py domain: The structure of python objects is changed. A boolean value is added to indicate that the python object is canonical one
ta: #4826: py டொமைன்: பைதான் பொருள்களின் அமைப்பு மாற்றப்பட்டது. பைதான் பொருள் நியதியானது என்பதைக் குறிக்க பூலியன் மதிப்பு சேர்க்கப்படுகிறது

source: #7425: MathJax: The MathJax was changed from 2 to 3. Users using a custom MathJax configuration may have to set the old MathJax path or update their configuration for version 3. See :mod:`sphinx.ext.mathjax`.
ta: #7425: MathJax: MathJax 2 இலிருந்து 3 ஆக மாற்றப்பட்டது. தனிப்பயன் MathJax உள்ளமைவைப் பயன்படுத்தும் பயனர்கள் பழைய MathJax பாதையை அமைக்க வேண்டும் அல்லது பதிப்பு 3 க்கு தங்கள் உள்ளமைவை புதுப்பிக்க வேண்டும். :mod:`sphinx.ext.mathjax` ஐப் பார்க்கவும்.

source: #7784: i18n: The msgid for alt text of image is changed
ta: #7784: i18n: The msgid க்கு மாற்று உரை of படம் மாற்றப்பட்டது

source: #5560: napoleon: :confval:`napoleon_use_param` also affect "other parameters" section
ta: #5560: நெப்போலியன்: :confval:`napolon_use_param` "பிற அளவுருக்கள்" பிரிவையும் பாதிக்கிறது

source: #7996: manpage: Make a section directory on build manpage by default (see :confval:`man_make_section_directory`)
ta: #7996: manpage: பில்ட் மேன்பேசில் ஒரு பிரிவு கோப்பகத்தை இயல்பாக உருவாக்கவும் (பார்க்க :confval:`man_make_section_directory`)

source: #7849: html: Change the default setting of :confval:`html_codeblock_linenos_style` to ``'inline'``
ta: #7849: html: :confval:`html_codeblock_linenos_style` இன் இயல்புநிலை அமைப்பை ``'inline'`` ஆக மாற்றவும்

source: #8380: html search: search results are wrapped with ``<p>`` instead of ``<div>``
ta: #8380: உஉகுமொ தேடல்: தேடல் முடிவுகள் ``<div>`` என்பதற்குப் பதிலாக ``<p>`` உடன் மூடப்பட்டிருக்கும்

source: html theme: Move a script tag for documentation_options.js in basic/layout.html to ``script_files`` variable
ta: HTML தீம்: `` ஸ்கிரிப்ட்_ஃபைல்கள்` `` `ஸ்கிரிப்ட்_ஃபைல்கள்`` `ஸ்கிரிப்ட்_ஃபைல்கள்` என்ற அடிப்படை/தளவமைப்பில் ஆவணப்படுத்தல்_ஓபிஷன்களுக்கான ஸ்கிரிப்ட் குறிச்சொல்லை நகர்த்தவும்

source: html theme: Move CSS tags in basic/layout.html to ``css_files`` variable
ta: HTML தீம்: CSS குறிச்சொற்களை அடிப்படை/தளவமைப்பில். Html இல் `` CSS_FILES`` மாறியை நகர்த்தவும்

source: #8915: html theme: Emit a warning for ``sphinx_rtd_theme`` 0.2.4 or older
ta: #8915: உஉகுமொ தீம்: ``sphinx_rtd_theme`` 0.2.4 அல்லது அதற்கு மேற்பட்டவற்றுக்கு முன்னறிவிப்பு விடுங்கள்

source: #8508: LaTeX: uplatex becomes a default setting of latex_engine for Japanese documents
ta: #8508: LaTeX: சப்பானிய ஆவணங்களுக்கான லேடெக்ச்_என்சினின் இயல்புநிலை அமைப்பாக அப்லேடெக்ச் ஆனது

source: #5977: py domain: ``:var:``, ``:cvar:`` and ``:ivar:`` fields do not create cross-references
ta: #5977: py டொமைன்: ``:var:``, ``:cvar:`` மற்றும் ``:ivar:`` புலங்கள் குறுக்குக் குறிப்புகளை உருவாக்காது

source: #4550: The ``align`` attribute of ``figure`` and ``table`` nodes becomes ``None`` by default instead of ``'default'``
ta: #4550: ``figure`` மற்றும் ``table`` முனைகளின் ``align`` பண்புக்கூறானது, ```default''`` என்பதற்குப் பதிலாக இயல்புநிலையாக ``None`` ஆனது

source: #8769: LaTeX refactoring: split sphinx.sty into multiple files and rename some auxiliary files created in ``latex`` build output repertory
ta: #8769: லாடெக்சு மறுசீரமைப்பு: sphinx.styயை பல கோப்புகளாகப் பிரித்து, ``லேடெக்ச்`` பில்ட் அவுட்புட் ரெப்பர்ட்டரியில் உருவாக்கப்பட்ட சில துணைக் கோப்புகளை மறுபெயரிடவும்

source: #8937: Use explicit title instead of <no title>
ta: #8937: <no title> என்பதற்குப் பதிலாக வெளிப்படையான தலைப்பைப் பயன்படுத்தவும்

source: #8487: The :file: option for csv-table directive now recognizes an absolute path as a relative path from source directory
ta: #8487: csv-table directiveக்கான :file: விருப்பம் இப்போது மூல கோப்பகத்தில் இருந்து தொடர்புடைய பாதையாக ஒரு முழுமையான பாதையை அங்கீகரிக்கிறது.

source: #9023: Change the CSS classes on :rst:role:`cpp:expr` and :rst:role:`cpp:texpr`.
ta: #9023: :rst:role:`cpp:expr` மற்றும் :rst:role:`cpp:texpr` இல் சிஎச்எச் வகுப்புகளை மாற்றவும்.

source: Deprecated
ta: மதிப்பிடப்பட்டது

source: ``favicon`` and ``logo`` variable in HTML templates
ta: Html வார்ப்புருக்களில் `` ஃபாவிகான்`` மற்றும் `` லோகோ``

source: #8924: autodoc: Support ``bound`` argument for TypeVar
ta: #8924: autodoc: TypeVar க்கான ``கௌண்ட்`` வாதத்தை ஆதரிக்கவும்

source: #7383: autodoc: Support typehints for properties
ta: #7383: autodoc: பண்புகளுக்கான உதவி தட்டச்சு குறிப்புகள்

source: #5603: autodoc: Allow to refer to a python class using its canonical name when the class has two different names; a canonical name and an alias name
ta: #5603: autodoc: வகுப்பு இரண்டு வெவ்வேறு பெயர்களைக் கொண்டிருக்கும்போது அதன் நியமனப் பெயரைப் பயன்படுத்தி பைதான் வகுப்பைக் குறிப்பிட அனுமதிக்கவும்; ஒரு நியமனப் பெயர் மற்றும் மாற்றுப் பெயர்

source: #8539: autodoc: Add :confval:`autodoc_typehints_description_target` to control the behavior of ``autodoc_typehints=description``
ta: #8539: autodoc: ``autodoc_typehints=description`` இன் நடத்தையைக் கட்டுப்படுத்த :confval:`autodoc_typehints_description_target` சேர்

source: #8841: autodoc: :confval:`autodoc_docstring_signature` will continue to look for multiple signature lines without backslash character
ta: #8841: autodoc: :confval:`autodoc_docstring_signature` பின்சாய்வு எழுத்து இல்லாமல் பல கையொப்ப வரிகளைத் தேடும்

source: #7549: autosummary: Enable :confval:`autosummary_generate` by default
ta: #7549: தன்னியக்க சுருக்கம்: முன்னிருப்பாக :confval:`autosummary_generate` ஐ இயக்கு

source: #8898: extlinks: Allow %s in link caption string
ta: #8898: extlinks: இணைப்பு தலைப்பு சரத்தில் %s ஐ அனுமதிக்கவும்

source: #4826: py domain: Add ``:canonical:`` option to python directives to describe the location where the object is defined
ta: #4826: py டொமைன்: பொருள் வரையறுக்கப்பட்ட இடத்தை விவரிக்க, பைதான் கட்டளைகளில் ``:canonical:`` விருப்பத்தைச் சேர்க்கவும்

source: #7199: py domain: Add :confval:`python_use_unqualified_type_names` to suppress the module name of the python reference if it can be resolved (experimental)
ta: #7199: py டொமைன்: பைதான் குறிப்பின் தொகுதிப் பெயரைத் தீர்க்க முடிந்தால் அதை அடக்குவதற்கு :confval:`python_use_unqualified_type_names` ஐச் சேர்க்கவும் (பரிசோதனை)

source: #7068: py domain: Add :rst:dir:`py:property` directive to describe a property
ta: #7068: py டொமைன்: சொத்தை விவரிக்க :rst:dir:`py:property` கட்டளையைச் சேர்க்கவும்

source: #7784: i18n: The alt text for image is translated by default (without :confval:`gettext_additional_targets` setting)
ta: #7784: i18n: படத்திற்கான மாற்று உரை இயல்புநிலையாக மொழிபெயர்க்கப்பட்டது (:confval:`gettext_additional_targets` அமைப்பு இல்லாமல்)

source: #2018: html: :confval:`html_favicon` and :confval:`html_logo` now accept URL for the image
ta: #2018: html: :confval:`html_favicon` மற்றும் :confval:`html_logo` இப்போது படத்திற்கான முகவரி ஐ ஏற்கவும்

source: #8070: html search: Support searching for 2characters word
ta: #8070: உஉகுமொ தேடல்: 2 எழுத்துகள் வார்த்தைக்கான தேடலை ஆதரிக்கவும்

source: #9036: html theme: Allow to inherite the search page
ta: #9036: உஉகுமொ தீம்: தேடல் பக்கத்தைப் பெற அனுமதிக்கிறது

source: #8938: imgconverter: Show the error of the command availability check
ta: #8938: imgconverter: கட்டளை கிடைக்கும் சரிபார்ப்பின் பிழையைக் காட்டு

source: #7830: Add debug logs for change detection of sources and templates
ta: #7830: ஆதாரங்கள் மற்றும் டெம்ப்ளேட்களின் மாற்றத்தைக் கண்டறிவதற்காக பிழைத்திருத்தப் பதிவுகளைச் சேர்க்கவும்

source: #8201: Emit a warning if toctree contains duplicated entries
ta: #8201: டோக்ட்ரீயில் நகல் உள்ளீடுகள் இருந்தால் முன்னறிவிப்பு விடுங்கள்

source: #8326: ``master_doc`` is now renamed to :confval:`root_doc`
ta: #8326: ``master_doc`` இப்போது :confval:`root_doc` என மறுபெயரிடப்பட்டுள்ளது

source: #8942: C++, add support for the C++20 spaceship operator, ``<=>``.
ta: #8942: C++, C++20 ச்பேச்சிப் ஆபரேட்டருக்கான ஆதரவைச் சேர்க்கவும், ``<=>``.

source: #7199: A new node, ``sphinx.addnodes.pending_xref_condition`` has been added. It can be used to choose appropriate content of the reference by conditions.
ta: #7199: ஒரு புதிய முனை, ``sphinx.addnodes.pending_xref_condition`` சேர்க்கப்பட்டது. நிபந்தனைகளின்படி குறிப்பின் பொருத்தமான உள்ளடக்கத்தைத் தேர்வுசெய்ய இது பயன்படுத்தப்படலாம்.

source: #8818: autodoc: Super class having ``Any`` arguments causes nitpicky warning
ta: #8818: autodoc: ``Any`` வாதங்களைக் கொண்ட சூப்பர் கிளாச் மோசமான எச்சரிக்கையை ஏற்படுத்துகிறது

source: #9095: autodoc: TypeError is raised on processing broken metaclass
ta: #9095: autodoc: உடைந்த மெட்டாகிளாசைச் செயலாக்குவதில் தட்டச்சுப் பிழை ஏற்படுகிறது

source: #9110: autodoc: metadata of GenericAlias is not rendered as a reference in py37+
ta: #9110: autodoc: GenericAlias ​​இன் மேனிலை தரவு py37+ இல் ஒரு குறிப்பாக வழங்கப்படவில்லை

source: #9098: html: copy-range protection for doctests doesn't work in Safari
ta: #9098: html: டாக்டெச்ட்களுக்கான நகல்-வரம்பு பாதுகாப்பு சஃபாரியில் வேலை செய்யாது

source: #9103: LaTeX: imgconverter: conversion runs even if not needed
ta: #9103: LaTeX: imgconverter: தேவை இல்லாவிட்டாலும் மாற்றம் இயங்கும்

source: #8127: py domain: Ellipsis in info-field-list causes nitpicky warning
ta: #8127: பை டொமைன்: இன்ஃபோ-ஃபீல்ட்-லிச்ட்டில் உள்ள எலிப்சிச் நிட்பிக்கி எச்சரிக்கையை ஏற்படுத்துகிறது

source: #9121: py domain: duplicated warning is emitted when both canonical and its alias objects are defined on the document
ta: #9121: py டொமைன்: ஆவணத்தில் நியதி மற்றும் அதன் மாற்றுப் பொருள்கள் இரண்டும் வரையறுக்கப்படும்போது நகல் முன்னறிவிப்பு வெளியிடப்படுகிறது

source: #9023: More CSS classes on domain descriptions, see :ref:`nodes` for details.
ta: #9023: டொமைன் விளக்கங்களில் மேலும் சிஎச்எச் வகுப்புகள், விவரங்களுக்கு :ref:`nodes` ஐப் பார்க்கவும்.

source: #8195: mathjax: Rename :confval:`mathjax_config` to :confval:`mathjax2_config` and add :confval:`mathjax3_config`
ta: #8195: mathjax: :confval:`mathjax_config` என்பதை :confval:`mathjax2_config` என மறுபெயரிட்டு :confval:`mathjax3_config` ஐ சேர்க்கவும்

source: #8917: autodoc: Raises a warning if function has wrong __globals__ value
ta: #8917: autodoc: செயல்பாடு தவறான __globals__ மதிப்பைக் கொண்டிருந்தால் எச்சரிக்கையை எழுப்புகிறது

source: #8415: autodoc: a TypeVar imported from other module is not resolved (in Python 3.7 or above)
ta: #8415: autodoc: மற்ற தொகுதியிலிருந்து இறக்குமதி செய்யப்பட்ட TypeVar தீர்க்கப்படவில்லை (பைதான் 3.7 அல்லது அதற்கு மேல்)

source: #8992: autodoc: Failed to resolve types.TracebackType type annotation
ta: #8992: autodoc: வகைகளைத் தீர்க்க முடியவில்லை.TracebackType வகை சிறுகுறிப்பு

source: #8905: html: ``html_add_permalinks=None`` and ``html_add_permalinks=""`` are ignored
ta: #8905: html: ``html_add_permalinks=None`` மற்றும் ``html_add_permalinks=""`` புறக்கணிக்கப்பட்டது

source: #8380: html search: Paragraphs in search results are not identified as ``<p>``
ta: #8380: உஉகுமொ தேடல்: தேடல் முடிவுகளில் உள்ள பத்திகள் ``<p>`` என அடையாளம் காணப்படவில்லை

source: #8915: html theme: The translation of ``sphinx_rtd_theme`` does not work
ta: #8915: உஉகுமொ தீம்: ``sphinx_rtd_theme`` இன் மொழிபெயர்ப்பு வேலை செய்யவில்லை

source: #8342: Emit a warning if a unknown domain is given for directive or role (ex. ``:unknown:doc:``)
ta: #8342: வழிகாட்டுதல் அல்லது பங்குக்காக அறியப்படாத டொமைன் வழங்கப்பட்டால் எச்சரிக்கையை வெளியிடவும் (எ.கா. ``:unknown:doc:``)

source: #7241: LaTeX: No wrapping for ``cpp:enumerator``
ta: #7241: LaTeX: ``cpp:enumerator``க்கு ரேப்பிங் இல்லை

source: #8711: LaTeX: backticks in code-blocks trigger latexpdf build warning (and font change) with late TeXLive 2019
ta: #8711: LaTeX: கோட்-பிளாக்சில் உள்ள பேக்டிக்குகள் டெக்ச்லைவ் 2019 இன் பிற்பகுதியில் லேடெக்ச்பிடிஎஃப் உருவாக்க எச்சரிக்கையை (மற்றும் எழுத்துரு மாற்றம்) தூண்டுகிறது

source: #8253: LaTeX: Figures with no size defined get overscaled (compared to images with size explicitly set in pixels) (fixed for ``'pdflatex'/'lualatex'`` only)
ta: #8253: LaTeX: அளவு வரையறுக்கப்படாத புள்ளிவிவரங்கள் மிகைப்படுத்தப்படுகின்றன (அளவை வெளிப்படையாக பிக்சல்களில் அமைக்கப்பட்டுள்ள படங்களுடன் ஒப்பிடும்போது) (``'pdflatex'/'lualatex'``க்கு மட்டும் சரி செய்யப்பட்டது)

source: #8881: LaTeX: The depth of bookmarks panel in PDF is not enough for navigation
ta: #8881: LaTeX: PDF இல் உள்ள புக்மார்க்ச் பேனலின் ஆழம் வழிசெலுத்தலுக்குப் போதாது

source: #8874: LaTeX: the fix to two minor Pygments LaTeXFormatter output issues ignore Pygments style
ta: #8874: LaTeX: இரண்டு சிறிய நிறமிகளை சரிசெய்தல் LaTeXFormatter வெளியீட்டு சிக்கல்கள் Pygments பாணியை புறக்கணிக்கின்றன

source: #8925: LaTeX: 3.5.0 ``verbatimmaxunderfull`` setting does not work as expected
ta: #8925: LaTeX: 3.5.0 ``verbatimmaxunderfull`` அமைப்பு எதிர்பார்த்தபடி வேலை செய்யவில்லை

source: #8980: LaTeX: missing line break in ``\pysigline``
ta: #8980: LaTeX: ``\pysigline`` இல் வரி முறிவு இல்லை

source: #8995: LaTeX: legacy ``\pysiglinewithargsret`` does not compute correctly available horizontal space and should use a ragged right style
ta: #8995: LaTeX: மரபு ``\pysiglinewithargsret`` சரியாகக் கிடைக்கும் கிடைமட்ட இடத்தைக் கணக்கிடாது, மேலும் கிழிந்த வலது பாணியைப் பயன்படுத்த வேண்டும்

source: #9009: LaTeX: "release" value with underscore leads to invalid LaTeX
ta: #9009: LaTeX: "வெளியீடு" மதிப்பு அடிக்கோடிடுதல் தவறான LaTeXக்கு வழிவகுக்கிறது

source: #8911: C++: remove the longest matching prefix in :confval:`cpp_index_common_prefix` instead of the first that matches.
ta: #8911: C++: முதலில் பொருந்துவதற்குப் பதிலாக :confval:`cpp_index_common_prefix` இல் உள்ள நீளமான பொருந்தும் முன்னொட்டை அகற்றவும்.

source: C, properly reject function declarations when a keyword is used as parameter name.
ta: சி, ஒரு முக்கிய சொல் அளவுரு பெயராகப் பயன்படுத்தப்படும்போது செயல்பாட்டு அறிவிப்புகளை சரியாக நிராகரிக்கவும்.

source: #8933: viewcode: Failed to create back-links on parallel build
ta: #8933: பார்வைக்குறியீடு: இணையான கட்டமைப்பில் பின் இணைப்புகளை உருவாக்க முடியவில்லை

source: #8960: C and C++, fix rendering of (member) function pointer types in function parameter lists.
ta: #8960: C மற்றும் C++, செயல்பாடு அளவுரு பட்டியல்களில் (உறுப்பினர்) செயல்பாடு சுட்டிக்காட்டி வகைகளின் ரெண்டரிங்கை சரிசெய்யவும்.

source: C++, fix linking of names in array declarators, pointer to member (function) declarators, and in the argument to ``sizeof...``.
ta: சி ++, வரிசை அறிவிப்பாளர்களில் பெயர்களை இணைப்பதை சரிசெய்யவும், உறுப்பினர் (செயல்பாடு) அறிவிப்பாளர்களுக்கு சுட்டிக்காட்டி, மற்றும் வாதத்தில் `` அளவு ... ``.

source: C, fix linking of names in array declarators.
ta: சி, வரிசை அறிவிப்பாளர்களில் பெயர்களை இணைப்பதை சரிசெய்யவும்.

source: C, C++, fix ``KeyError`` when an ``alias`` directive is the first C/C++ directive in a file with another C/C++ directive later.
ta: சி, சி ++, ஒரு `` மாற்றுப்பெயர்`` உத்தரவு என்பது ஒரு கோப்பில் முதல் சி/சி ++ கட்டளைக்கு பின்னர் மற்றொரு சி/சி ++ கட்டளையாக இருக்கும்போது `` KEYERROR`` ஐ சரிசெய்யவும்.

source: 4.0.0b3
ta: 4.0.0 பி3

source: #9167: html: Failed to add CSS files to the specific page
ta: #9167: html: குறிப்பிட்ட பக்கத்தில் சிஎச்எச் கோப்புகளைச் சேர்ப்பதில் தோல்வி
