Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_usage--extensions--autodoc_*.po
Languages: ta

source: If the :meth:`!__init__` method doesn't exist or has a blank docstring, ``autodoc`` will attempt to use the :meth:`!__new__` method's docstring, if it exists and is not blank.
ta: :meth:`!__init__` முறை இல்லை அல்லது வெற்று ஆவணசரம் இருந்தால், ``autodoc`` :meth:`!__new__` முறையின் டாக்ச்ட்ரிங்கைப் பயன்படுத்த முயற்சிக்கும், அது இருந்தால் மற்றும் காலியாக இல்லை.

source: Generate automatic documentation for all members of the target class:
ta: இலக்கு வகுப்பின் அனைத்து உறுப்பினர்களுக்கும் தானியங்கி ஆவணங்களை உருவாக்கவும்:

source: By default, ``autodoc`` only includes public members with a docstring or :ref:`doc-comment <doc-comment>` (``#:``) that are attributes of the target class (i.e. not inherited).
ta: இயல்பாக, ``autodoc`` என்பது ஆவணசரம் அல்லது :ref:`doc-comment <doc-comment>` (``#:``) உள்ள பொது உறுப்பினர்களை மட்டுமே உள்ளடக்கியது, அவை இலக்கு வகுப்பின் பண்புக்கூறுகளாகும் (அதாவது மரபுரிமையாக இல்லை).

source: To generate automatic documentation for members inherited from base classes, use the ``:inherited-members:`` option:
ta: அடிப்படை வகுப்புகளிலிருந்து பெறப்பட்ட உறுப்பினர்களுக்கான தானியங்கி ஆவணங்களை உருவாக்க, ``:inherited-members:`` விருப்பத்தைப் பயன்படுத்தவும்:

source: This can be combined with the ``:undoc-members:`` option to generate automatic documentation for *all* available members of the class.
ta: வகுப்பில் உள்ள *அனைத்து* உறுப்பினர்களுக்கும் தானியங்கி ஆவணங்களை உருவாக்க, இது ``:undoc-members:`` விருப்பத்துடன் இணைக்கப்படலாம்.

source: The members of classes listed in the argument to ``:inherited-members:`` are excluded from the automatic documentation. This defaults to :py:class:`python:object` if no argument is provided, meaning that members of the ``object`` class are not documented. To include these, use ``None`` as the argument.
ta: ``:inherited-members:`` வாதத்தில் பட்டியலிடப்பட்டுள்ள வகுப்புகளின் உறுப்பினர்கள் தானியங்கு ஆவணப்படுத்தலில் இருந்து விலக்கப்பட்டுள்ளனர். எந்த வாதமும் வழங்கப்படாவிட்டால், இது :py:class:`python:object` க்கு இயல்புநிலையாகும், அதாவது ``object`` வகுப்பின் உறுப்பினர்கள் ஆவணப்படுத்தப்படவில்லை. இவற்றைச் சேர்க்க, ``ஒன்றுமில்லை`` என்பதை வாதமாகப் பயன்படுத்தவும்.

source: For example; If your class ``MyList`` is derived from ``list`` class and you don't want to document ``list.__len__()``, you should specify a option ``:inherited-members: list`` to avoid special members of list class.
ta: உதாரணமாக; உங்கள் வகுப்பு ``MyList`` ``list`` வகுப்பிலிருந்து பெறப்பட்டது மற்றும் நீங்கள் ``list.__len__()`` ஆவணப்படுத்த விரும்பவில்லை எனில், பட்டியல் வகுப்பின் சிறப்பு உறுப்பினர்களைத் தவிர்க்க ``:inherited-members: list`` என்ற விருப்பத்தைக் குறிப்பிட வேண்டும்.

source: Should any of the inherited members use a format other than reStructuredText for their docstrings, there may be markup warnings or errors.
ta: மரபுவழி உறுப்பினர்களில் யாரேனும் தங்கள் ஆவணங்களுக்கு மறுகட்டமைக்கப்பட்ட உரையைத் தவிர வேறு வடிவமைப்பைப் பயன்படுத்தினால், மார்க்அப் எச்சரிக்கைகள் அல்லது பிழைகள் இருக்கலாம்.

source: ``:inherited-members:`` now takes the name of a base class to exclude as an argument.
ta: ``:inherited-members:`` இப்போது ஒரு வாதமாக விலக்க அடிப்படை வகுப்பின் பெயரைப் பெறுகிறது.

source: A comma separated list of base class names can be used.
ta: அடிப்படை வகுப்புப் பெயர்களின் கமாவால் பிரிக்கப்பட்ட பட்டியலைப் பயன்படுத்தலாம்.

source: Generate automatic documentation for members of the target class that don't have a docstring or doc-comment. For example:
ta: ஆவணசரம் அல்லது டாக்-கமெண்ட் இல்லாத இலக்கு வகுப்பின் உறுப்பினர்களுக்கு தானியங்கி ஆவணங்களை உருவாக்கவும். உதாரணமாக:

source: Generate automatic documentation for private members of the target class. This includes names with a leading underscore (e.g. ``_private``) and those members explicitly marked as private with ``:meta private:``.
ta: இலக்கு வகுப்பின் தனிப்பட்ட உறுப்பினர்களுக்கான தானியங்கி ஆவணங்களை உருவாக்கவும். இதில் முன்னணி அடிக்கோடிடப்பட்ட பெயர்கள் (எ.கா. ``_தனியார்``) மற்றும் ``:meta private:`` உடன் தனிப்பட்டதாகக் குறிக்கப்பட்ட உறுப்பினர்களும் அடங்கும்.

source: The option can now take arguments.
ta: விருப்பம் இப்போது வாதங்களை எடுக்கலாம்.

source: Generate automatic documentation for special members of the target class, also known as :ref:`'dunder' names <python:specialnames>`. This includes all names enclosed with a double-underscore, e.g. ``__special__``:
ta: இலக்கு வகுப்பின் சிறப்பு உறுப்பினர்களுக்கான தானியங்கு ஆவணங்களை உருவாக்கவும், இது :ref:`'dunder' பெயர்கள் <python:specialnames>` என்றும் அழைக்கப்படுகிறது. இரட்டை அடிக்கோடுடன் இணைக்கப்பட்ட அனைத்து பெயர்களும் இதில் அடங்கும், எ.கா. ``__சிறப்பு__``:

source: ``'alphabetical'``: Use simple alphabetical order.
ta: ``'அகர வரிசை'``: எளிய அகர வரிசையைப் பயன்படுத்தவும்.

source: ``'groupwise'``: Group by object type (class, function, etc), use alphabetical order within groups.
ta: ``'குழுவரிசை'``: பொருள் வகையின்படி குழுவாக்கு (வகுப்பு, செயல்பாடு போன்றவை), குழுக்களுக்குள் அகர வரிசையைப் பயன்படுத்தவும்.

source: ``'bysource'``: Use the order of objects in the module's source. The ``__all__`` variable can be used to override this order.
ta: ```மூலம்''``: தொகுதியின் மூலத்தில் உள்ள பொருட்களின் வரிசையைப் பயன்படுத்தவும். இந்த ஆர்டரை மீறுவதற்கு ``__all__`` மாறியைப் பயன்படுத்தலாம்.

source: Insert the class's base classes after the class signature.
ta: வகுப்பு கையொப்பத்திற்குப் பிறகு வகுப்பின் அடிப்படை வகுப்புகளைச் செருகவும்.

source: Automatically document function-like objects
ta: செயல்பாடு போன்ற பொருட்களை தானாக ஆவணப்படுத்துகிறது

source: Document a function, method, property, or decorator. By default, the directive only inserts the docstring of the function itself:
ta: ஆவணம் a function, method, property, or decorator. By default, the கட்டளை only inserts the docstring of the சார்பு itself:

source: The directive can also contain content of its own, which will be inserted into the resulting non-auto directive source after the docstring.
ta: இந்த கட்டளை அதன் சொந்த உள்ளடக்கத்தையும் கொண்டிருக்கலாம், இது டாக்ச்ட்ரிங்க்குப் பிறகு தானாக இயக்கப்படாத மூலத்தில் செருகப்படும்.

source: Therefore, you can also mix automatic and non-automatic documentation, as follows:
ta: எனவே, நீங்கள் தானியங்கி மற்றும் தானியங்கி அல்லாத ஆவணங்களையும் பின்வருமாறு கலக்கலாம்:

source: If you document decorated functions or methods, keep in mind that ``autodoc`` retrieves its docstrings by importing the module and inspecting the ``__doc__`` attribute of the given function or method. That means that if a decorator replaces the decorated function with another, it must copy the original ``__doc__`` to the new function.
ta: அலங்கரிக்கப்பட்ட செயல்பாடுகள் அல்லது முறைகளை நீங்கள் ஆவணப்படுத்தினால், தொகுதியை இறக்குமதி செய்து, கொடுக்கப்பட்ட செயல்பாடு அல்லது முறையின் ``__doc__`` பண்புக்கூறை ஆய்வு செய்வதன் மூலம் ``autodoc` அதன் ஆவணங்களை மீட்டெடுக்கிறது என்பதை நினைவில் கொள்ளவும். அதாவது, ஒரு அலங்கரிப்பாளர் அலங்கரிக்கப்பட்ட செயல்பாட்டை மற்றொருவருடன் மாற்றினால், அது அசல் ``__doc__`` புதிய செயல்பாட்டிற்கு நகலெடுக்க வேண்டும்.

source: Do not generate an index entry for the documented function.
ta: ஆவணப்படுத்தப்பட்ட செயல்பாட்டிற்கான குறியீட்டு உள்ளீட்டை உருவாக்க வேண்டாம்.

source: Do not generate an index entry for the documented function. Unlike ``:no-index:``, cross-references are still created.
ta: ஆவணப்படுத்தப்பட்ட செயல்பாட்டிற்கான குறியீட்டு உள்ளீட்டை உருவாக்க வேண்டாம். ``:no-index:`` போலல்லாமல், குறுக்கு குறிப்புகள் இன்னும் உருவாக்கப்படுகின்றன.

source: Automatically document attributes or data
ta: பண்புகளை அல்லது தரவை தானாக ஆவணப்படுத்துகிறது

source: Document a module level variable or constant ('data') or class attribute. By default, the directive only inserts the docstring of the variable itself:
ta: தொகுதி நிலை மாறி அல்லது மாறிலி ('தரவு') அல்லது வகுப்பு பண்புக்கூறை ஆவணப்படுத்தவும். முன்னிருப்பாக, கட்டளையானது மாறியின் டாக்ச்ட்ரிங்கை மட்டுமே செருகும்:

source: Doc-comments are now allowed on the same line of an assignment.
ta: ஆவண-கருத்துகள் இப்போது ஒரு பணியின் அதே வரிசையில் அனுமதிக்கப்படுகின்றன.

source: Do not generate an index entry for the documented variable or constant.
ta: ஆவணப்படுத்தப்பட்ட மாறி அல்லது மாறிலிக்கான குறியீட்டு உள்ளீட்டை உருவாக்க வேண்டாம்.

source: Do not generate an index entry for the documented variable or constant. Unlike ``:no-index:``, cross-references are still created.
ta: ஆவணப்படுத்தப்பட்ட மாறி அல்லது மாறிலிக்கான குறியீட்டு உள்ளீட்டை உருவாக்க வேண்டாம். ``:no-index:`` போலல்லாமல், குறுக்கு குறிப்புகள் இன்னும் உருவாக்கப்படுகின்றன.

source: By default, ``autodoc`` attempts to obtain the type annotation and value of the variable by introspection, displaying it after the variable's name. To override this, a custom string for the variable's value may be used as the argument to ``annotation``.
ta: முன்னிருப்பாக, ``autodoc`` ஆனது, மாறியின் பெயருக்குப் பிறகு அதைக் காண்பிக்கும், உள்நோக்கத்தின் மூலம் மாறியின் வகை சிறுகுறிப்பு மற்றும் மதிப்பைப் பெற முயற்சிக்கிறது. இதை மேலெழுத, மாறியின் மதிப்புக்கான தனிப்பயன் சரம் ``குறிப்பு``க்கான வாதமாகப் பயன்படுத்தப்படலாம்.

source: For example, if the runtime value of ``FILE_MODE`` is ``0o755``, the displayed value will be ``493`` (as ``oct(493) == '0o755'``). This can be fixed by setting ``:annotation: = 0o755``.
ta: எடுத்துக்காட்டாக, ``FILE_MODE`` இன் இயக்க நேர மதிப்பு ``0o755`` எனில், காட்டப்படும் மதிப்பு ``493`` (``oct(493) == '0o755''`` ஆக இருக்கும். ``: சிறுகுறிப்பு: = 0o755`` அமைப்பதன் மூலம் இதை சரிசெய்யலாம்.

source: If ``:annotation:`` is used without arguments, no value or type hint will be shown for the variable.
ta: ``: சிறுகுறிப்பு:`` வாதங்கள் இல்லாமல் பயன்படுத்தப்பட்டால், மாறிக்கு மதிப்பு அல்லது வகை குறிப்பு எதுவும் காட்டப்படாது.

source: To display the type hint of the variable without a value, use the ``:no-value:`` option. If both the ``:annotation:`` and ``:no-value:`` options are used, ``:no-value:`` has no effect.
ta: மதிப்பு இல்லாமல் மாறியின் வகை குறிப்பைக் காட்ட, ``:no-value:`` விருப்பத்தைப் பயன்படுத்தவும். ``:annotation:`` மற்றும் ``:no-value:`` ஆகிய இரண்டும் பயன்படுத்தப்பட்டால், ``:no-value:`` எந்த விளைவையும் ஏற்படுத்தாது.

source: Automatically document type aliases
ta: தானாக ஆவண வகை மாற்றுப்பெயர்கள்

source: Document a :pep:`695` type alias (the :keyword:`type` statement). By default, the directive only inserts the docstring of the alias itself:
ta: ஒரு :pep:`695` வகை மாற்றுப்பெயரை ஆவணப்படுத்தவும் (திறவுச்சொல்:`type` அறிக்கை). முன்னிருப்பாக, கட்டளை மாற்றுப்பெயரின் டாக்ச்ட்ரிங்கை மட்டுமே செருகும்:

source: Therefore, you can also mix automatic and non-automatic member documentation.
ta: எனவே, நீங்கள் தானியங்கி மற்றும் தானியங்கி அல்லாத உறுப்பினர் ஆவணங்களையும் கலக்கலாம்.

source: Configuration
ta: உள்ளமைவு

source: There are also config values that you can set:
ta: நீங்கள் அமைக்கக்கூடிய கட்டமைப்பு மதிப்புகளும் உள்ளன:

source: Type
ta: வகை

source: Default
ta: இயல்புநிலை

source: If true, autodoc will use the legacy class-based implementation. This is the behaviour prior to Sphinx 9.0. It is based on the ``Documenter`` class hierarchy.
ta: சரி எனில், autodoc மரபு வகுப்பு அடிப்படையிலான செயலாக்கத்தைப் பயன்படுத்தும். இது சூரரிமாச்சிலை 9.0க்கு முந்தைய நடத்தை. இது ``ஆவணம்`` வகுப்பு படிநிலையை அடிப்படையாகக் கொண்டது.

source: This setting is provided for backwards compatibility if your documentation or an extension you use uses or monkeypatches the legacy class-based API in Python code. If this is the case, set ``autodoc_use_legacy_class_based = True`` in your :file:`conf.py`. Please also add a comment to `the tracking issue on GitHub <https://github.com/sphinx-doc/sphinx/issues/14089>`__ so that the maintainers are aware of your use case, for possible future improvements.
ta: உங்கள் ஆவணங்கள் அல்லது நீங்கள் பயன்படுத்தும் நீட்டிப்பு, பைதான் குறியீட்டில் உள்ள மரபு வகுப்பு அடிப்படையிலான பநிஇ ஐப் பயன்படுத்தினால் அல்லது குரங்கு ஒட்டு செய்தால், பின்னோக்கி இணக்கத்தன்மைக்காக இந்த அமைப்பு வழங்கப்படுகிறது. இப்படி இருந்தால், உங்கள் :file:`conf.py` இல் ``autodoc_use_legacy_class_based = True`` என்பதை அமைக்கவும். GitHub <https://github.com/sphinx-doc/sphinx/issues/14089>`__ இல் `கண்காணிப்புச் சிக்கலுக்கு ஒரு கருத்தைச் சேர்க்கவும். இதனால், எதிர்காலத்தில் சாத்தியமான மேம்பாடுகளுக்கு, உங்கள் உபயோகத்தை பராமரிப்பவர்கள் அறிந்திருப்பார்கள்.

source: The legacy class-based implementation does not support PEP 695 type aliases.
ta: மரபு வகுப்பு அடிப்படையிலான செயல்படுத்தல் PEP 695 வகை மாற்றுப்பெயர்களை ஆதரிக்காது.

source: This value selects what content will be inserted into the main body of an :rst:dir:`autoclass` directive. The possible values are:
ta: இந்த மதிப்பு an: rst: dir: `autoclass` உத்தரவின் முக்கிய உடலில் எந்த உள்ளடக்கம் செருகப்படும் என்பதைத் தேர்ந்தெடுக்கிறது. சாத்தியமான மதிப்புகள்:

source: ``'class'``
ta: ``வகுப்பு''`

source: Only the class' docstring is inserted. You can still document ``__init__`` as a separate method using :rst:dir:`automethod` or the ``members`` option to :rst:dir:`autoclass`.
ta: வகுப்பின் ஆவணசரம் மட்டுமே செருகப்பட்டுள்ளது. நீங்கள் இன்னும் ``__init__`` ஒரு தனி முறையாக :rst:dir:`automethod` அல்லது ``members`` விருப்பத்தை :rst:dir:`autoclass` ஐப் பயன்படுத்தி ஆவணப்படுத்தலாம்.

source: ``'both'``
ta: ```இரண்டும்''`

source: Both the class' and the ``__init__`` method's docstring are concatenated and inserted.
ta: வகை 'மற்றும் `__init__`` முறையின் ஆவணப்படம் இரண்டுமே ஒன்றிணைக்கப்பட்டு செருகப்படுகின்றன.

source: Only the ``__init__`` method's docstring is inserted.
ta: `__init__`` முறையின் ஆவணப்படம் மட்டுமே செருகப்படுகிறது.

source: If the class has no ``__init__`` method or if the ``__init__`` method's docstring is empty, but the class has a ``__new__`` method's docstring, it is used instead.
ta: வகுப்பிற்கு `__init__`` முறை இல்லையென்றால் அல்லது` __init__`` முறையின் ஆவணப்படம் காலியாக இருந்தால், ஆனால் வகுப்பில் `__new__`` முறையின் ஆவணப்படம் இருந்தால், அதற்கு பதிலாக இது பயன்படுத்தப்படுகிறது.

source: This value selects how the signature will be displayed for the class defined by :rst:dir:`autoclass` directive. The possible values are:
ta: இந்த மதிப்பு வரையறுக்கப்பட்ட வகுப்பிற்கு கையொப்பம் எவ்வாறு காண்பிக்கப்படும் என்பதைத் தேர்ந்தெடுக்கிறது: rst: dir: `autoclass` கட்டளை. சாத்தியமான மதிப்புகள்:

source: ``'mixed'``
ta: ```கலப்பு''``

source: Display the signature with the class name.
ta: கையொப்பத்தை வகுப்பு பெயருடன் காண்பி.

source: ``'separated'``
ta: ```பிரிக்கப்பட்ட''``

source: Display the signature as a method.
ta: கையொப்பத்தை ஒரு முறையாகக் காண்பி.

source: Define the order in which :rst:dir:`automodule` and :rst:dir:`autoclass` members are listed. Supported values are:
ta: :rst:for:`automobile` மற்றும் :rst:sir:`all class` உறுப்பினர்கள் பட்டியலிடப்பட்டுள்ள வரிசையை வரையறுக்கவும். ஆதரிக்கப்படும் மதிப்புகள்:

source: ``'alphabetical'``: Use alphabetical order.
ta: ``'அகர வரிசை'``: அகர வரிசையைப் பயன்படுத்தவும்.

source: ``'groupwise'``: order by member type. The order is:
ta: ```குழுவரிசை''``: உறுப்பினர் வகையின்படி ஆர்டர். உத்தரவு:

source: for modules, exceptions, classes, functions, data
ta: தொகுதிகள், விதிவிலக்குகள், வகுப்புகள், செயல்பாடுகள், தரவு

source: for classes: class methods, static methods, methods,
ta: வகுப்புகளுக்கு: வகுப்பு முறைகள், நிலையான முறைகள், முறைகள்,

source: and properties/attributes
ta: மற்றும் பண்புகள்/பண்புகள்

source: Members are ordered alphabetically within groups.
ta: உறுப்பினர்கள் குழுக்களாக அகரவரிசைப்படி வரிசைப்படுத்தப்பட்டுள்ளனர்.

source: ``'bysource'``: Use the order in which the members appear in the source code. This requires that the module must be a Python module with the source code available.
ta: ``'மூலம்'``: மூலக் குறியீட்டில் உறுப்பினர்கள் தோன்றும் வரிசையைப் பயன்படுத்தவும். இதற்குத் தொகுதியானது பைதான் தொகுதியாக இருக்க வேண்டும், அதில் கிடைக்கும் மூலக் குறியீட்டைக் கொண்டிருக்க வேண்டும்.

source: Support for ``'bysource'``.
ta: `` 'bysource'`` என்பதற்கான உதவி.

source: The default options for autodoc directives. They are applied to all autodoc directives automatically. It must be a dictionary which maps option names to the values. For example:
ta: ஆட்டோடாக் உத்தரவுகளுக்கான இயல்புநிலை விருப்பங்கள். அவை தானாகவே அனைத்து ஆட்டோடாக் உத்தரவுகளுக்கும் பயன்படுத்தப்படும். இது மதிப்புகளுக்கு விருப்பப் பெயர்களை வரைபடமாக்கும் அகராதியாக இருக்க வேண்டும். உதாரணமாக:

source: Setting ``None`` or ``True`` to the value is equivalent to giving only the option name to the directives.
ta: `` எதுவுமில்லை`` அல்லது `` உண்மை`` ஐ மதிப்புக்கு அமைப்பதற்கு சமமானதாகும்.

source: The supported options are:
ta: ஆதரிக்கப்படும் விருப்பங்கள்:

source: ``'members'``: See :rst:dir:`automodule:members`.
ta: ``'உறுப்பினர்கள்'``: பார்க்க :rst:dir:`automodule:members`.

source: ``'undoc-members'`` See :rst:dir:`automodule:undoc-members`.
ta: ``'undoc-members'`` பார்க்க :rst:dir:`automodule:undoc-members`.

source: ``'private-members'``: See :rst:dir:`automodule:private-members`.
ta: ``'தனியார்-உறுப்பினர்கள்'``: பார்க்க :rst:dir:`automodule:private-members`.

source: ``'special-members'``: See :rst:dir:`automodule:special-members`.
ta: ``'special-members'``: பார்க்க :rst:dir:`automodule:special-members`.

source: ``'inherited-members'``: See :rst:dir:`autoclass:inherited-members`.
ta: ``'பரம்பரை-உறுப்பினர்கள்'``: பார்க்க :rst:dir:`autoclass:inherited-members`.

source: ``'imported-members'``: See :rst:dir:`automodule:imported-members`.
ta: ``'இறக்குமதி-உறுப்பினர்கள்''': பார்க்க :rst:dir:`automodule:imported-members`.

source: ``'exclude-members'``: See :rst:dir:`automodule:exclude-members`.
ta: ``'விலக்கு-உறுப்பினர்கள்'``: பார்க்க :rst:dir:`automodule:exclude-members`.

source: ``'ignore-module-all'``: See :rst:dir:`automodule:ignore-module-all`.
ta: ``'ignore-module-all'``: பார்க்க :rst:dir:`automodule:ignore-module-all`.

source: ``'member-order'``: See :rst:dir:`automodule:member-order`.
ta: ``'உறுப்பினர்-வரிசை'``: பார்க்க :rst:dir:`automodule:member-order`.

source: ``'show-inheritance'``: See :rst:dir:`autoclass:show-inheritance`.
ta: ``'சோ-இன்எரிட்டன்ச்'''': பார்க்க :rst:dir:`autoclass:show-inheritance`.

source: ``'class-doc-from'``: See :rst:dir:`autoclass:class-doc-from`.
ta: ``'class-doc-from''``: பார்க்க :rst:dir:`autoclass:class-doc-from`.

source: ``'no-value'``: See :rst:dir:`autodata:no-value`.
ta: ``'no-value'``: பார்க்க :rst:dir:`autodata:no-value`.

source: ``'no-index'``: See :rst:dir:`automodule:no-index`.
ta: ``'no-index'``: பார்க்க :rst:dir:`automodule:no-index`.

source: ``'no-index-entry'``: See :rst:dir:`automodule:no-index-entry`.
ta: ``'no-index-entry''``: பார்க்க :rst:dir:`automodule:no-index-entry`.

source: Accepts ``True`` as a value.
ta: `` உண்மை`` ஒரு மதிப்பாக ஏற்றுக்கொள்கிறது.

source: Added ``'imported-members'``.
ta: சேர்க்கப்பட்டது `'' இறக்குமதி செய்யப்பட்ட-உறுப்பினர்கள்'```.

source: Added ``'class-doc-from'``.
ta: `` 'வகுப்பு-டாக்-from'``.

source: Added ``'no-value'``.
ta: `` 'இல்லை-மதிப்பு'``.

source: Functions imported from C modules cannot be introspected, and therefore the signature for such functions cannot be automatically determined. However, it is an often-used convention to put the signature into the first line of the function's docstring.
ta: சி தொகுதிகளிலிருந்து இறக்குமதி செய்யப்படும் செயல்பாடுகளை உள்நோக்க முடியாது, எனவே அத்தகைய செயல்பாடுகளுக்கான கையொப்பத்தை தானாகவே தீர்மானிக்க முடியாது. இருப்பினும், கையொப்பத்தை செயல்பாட்டின் ஆவணத்தின் முதல் வரியில் வைப்பது பெரும்பாலும் பயன்படுத்தப்படும் மாநாடு ஆகும்.

source: If this boolean value is set to ``True`` (which is the default), autodoc will look at the first line of the docstring for functions and methods, and if it looks like a signature, use the line as the signature and remove it from the docstring content.
ta: இந்த பூலியன் மதிப்பு `` உண்மை`` (இது இயல்புநிலை) என அமைக்கப்பட்டால், ஆட்டோடோக் செயல்பாடுகள் மற்றும் முறைகளுக்காக டாக்ச்ட்ரிங்கின் முதல் வரியைப் பார்க்கும், மேலும் அது கையொப்பம் போல் தோன்றினால், வரியை கையொப்பமாகப் பயன்படுத்தவும், அகற்றவும் இது ஆவணசரம் உள்ளடக்கத்திலிருந்து.

source: autodoc will continue to look for multiple signature lines, stopping at the first line that does not look like a signature. This is useful for declaring overloaded function signatures.
ta: ஆட்டோடோக் பல கையொப்ப வரிகளைத் தேடும், கையொப்பம் போல் இல்லாத முதல் வரியில் நிறுத்தப்படும். அதிக சுமை கொண்ட செயல்பாட்டு கையொப்பங்களை அறிவிக்க இது பயனுள்ளதாக இருக்கும்.

source: Support overloaded signatures
ta: அதிக சுமை கொண்ட கையொப்பங்களை ஆதரிக்கவும்

source: Overloaded signatures do not need to be separated by a backslash
ta: அதிக சுமை கொண்ட கையொப்பங்கள் பின்சாய்வுக்குறிப்பால் பிரிக்கப்பட வேண்டிய அவசியமில்லை

source: This value contains a list of modules to be mocked up. This is useful when some external dependencies are not met at build time and break the building process. You may only specify the root package of the dependencies themselves and omit the sub-modules:
ta: இந்த மதிப்பில் கேலி செய்யப்பட வேண்டிய தொகுதிகளின் பட்டியல் உள்ளது. சில வெளிப்புற சார்புநிலைகள் உருவாக்கும் நேரத்தில் நிறைவு செய்யப்படாதபோது இது பயனுள்ளதாக இருக்கும். நீங்கள் சார்புகளின் ரூட் தொகுப்பை மட்டுமே குறிப்பிடலாம் மற்றும் துணை தொகுதிகளைத் தவிர்க்கலாம்:

source: Will mock all imports under the ``django`` package.
ta: `` சாங்கோ`` தொகுப்பின் கீழ் அனைத்து இறக்குமதியையும் கேலி செய்யும்.

source: This config value only requires to declare the top-level modules that should be mocked.
ta: இந்த கட்டமைப்பு மதிப்புக்கு மட்டுமே கேலி செய்யப்பட வேண்டிய உயர்மட்ட தொகுதிகள் அறிவிக்க வேண்டும்.

source: This value controls how to represent typehints. The setting takes the following values:
ta: இந்த மதிப்பு டைப்இன்ட்களை எவ்வாறு பிரதிநிதித்துவப்படுத்துவது என்பதைக் கட்டுப்படுத்துகிறது. அமைப்பு பின்வரும் மதிப்புகளை எடுக்கும்:

source: ``'signature'`` -- Show typehints in the signature
ta: ```கையொப்பம்''` -- கையொப்பத்தில் வகை குறிப்புகளைக் காட்டு

source: ``'description'`` -- Show typehints as content of the function or method The typehints of overloaded functions or methods will still be represented in the signature.
ta: `` 'விளக்கம்'`` - டைப்இன்ட்களை செயல்பாட்டின் உள்ளடக்கமாக அல்லது முறையாகக் காட்டு அதிக சுமை கொண்ட செயல்பாடுகள் அல்லது முறைகளின் தட்டச்சுப்பொறிகள் கையொப்பத்தில் குறிப்பிடப்படும்.

source: ``'none'`` -- Do not show typehints
ta: `` 'எதுவுமில்லை'` - டைப்இன்ட்களைக் காட்ட வேண்டாம்

source: ``'both'`` -- Show typehints in the signature and as content of the function or method
ta: `` 'இரண்டும் `` - கையொப்பத்தில் மற்றும் செயல்பாடு அல்லது முறையின் உள்ளடக்கமாக தட்டச்சுப்பொறிகளைக் காட்டு

source: Overloaded functions or methods will not have typehints included in the description because it is impossible to accurately represent all possible overloads as a list of parameters.
ta: அதிக சுமை கொண்ட செயல்பாடுகள் அல்லது முறைகள் விளக்கத்தில் டைப்இன்ட்கள் சேர்க்கப்படாது, ஏனெனில் சாத்தியமான அனைத்து ஓவர்லோடுகளையும் அளவுருக்களின் பட்டியலாக துல்லியமாக பிரதிநிதித்துவப்படுத்துவது சாத்தியமில்லை.

source: New option ``'description'`` is added.
ta: புதிய விருப்பம் `` 'விளக்கம்'`` சேர்க்கப்பட்டுள்ளது.

source: New option ``'both'`` is added.
ta: புதிய விருப்பம் `` 'இரண்டும் சேர்க்கப்பட்டுள்ளது.

source: This value controls whether the types of undocumented parameters and return values are documented when :confval:`autodoc_typehints` is set to ``'description'``. Supported values:
ta: இந்த மதிப்பு :confval:`autodoc_typehints` ``'விளக்கம்'`` என அமைக்கப்படும் போது ஆவணப்படுத்தப்படாத அளவுருக்கள் மற்றும் திரும்ப மதிப்புகள் ஆவணப்படுத்தப்பட வேண்டுமா என்பதைக் கட்டுப்படுத்துகிறது. ஆதரிக்கப்படும் மதிப்புகள்:

source: ``'all'``: Types are documented for all parameters and return values, whether they are documented or not.
ta: ```அனைத்து''``: அனைத்து அளவுருக்கள் மற்றும் திரும்ப மதிப்புகள் ஆவணப்படுத்தப்பட்டாலும் இல்லாவிட்டாலும் வகைகள் ஆவணப்படுத்தப்படும்.

source: ``'documented'``: Types will only be documented for a parameter or a return value that is already documented by the docstring.
ta: ```ஆவணப்படுத்தப்பட்ட''``: ஆவணசரம் மூலம் ஏற்கனவே ஆவணப்படுத்தப்பட்ட அளவுரு அல்லது வருவாய் மதிப்புக்காக மட்டுமே வகைகள் ஆவணப்படுத்தப்படும்.
