Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_changes--1_5_*.po
Languages: ta

source: Sphinx does not ship anymore (but still uses) LaTeX style file ``fncychap``
ta: ஸ்பின்க்ஸ் இனி அனுப்பாது (ஆனால் இன்னும் பயன்படுத்துகிறது) லேடெக்ஸ் ஸ்டைல் கோப்பு `` fncychap``

source: #2435: Slim down quickstarted conf.py
ta: #2435: ச்லிம் பேரூர் விரைவுத் தொடங்கப்பட்ட conf.py

source: The ``sphinx.sty`` latex package does not load itself "hyperref", as this is done later in the preamble of the latex output via ``'hyperref'`` key.
ta: `` Sphinx.sty`` லேடெக்ஸ் தொகுப்பு தன்னை "ஹைப்பர்ரெஃப்" ஏற்றாது, ஏனெனில் இது பின்னர் லேடெக்ஸ் வெளியீட்டின் முன்னுரிமையில் `` 'ஹைப்பர்ரெஃப்'`` KEY வழியாக செய்யப்படுகிறது.

source: Sphinx does not ship anymore a custom modified LaTeX style file ``tabulary``. The non-modified package is used.
ta: தனிப்பயன் மாற்றியமைக்கப்பட்ட லேடெக்ஸ் ஸ்டைல் கோப்பு `` டேபுலரி`` இனி SPHINX அனுப்பாது. மாற்றியமைக்கப்படாத தொகுப்பு பயன்படுத்தப்படுகிறது.

source: #3057: By default, footnote marks in latex PDF output are not preceded by a space anymore, ``\sphinxBeforeFootnote`` allows user customization if needed.
ta: #3057: முன்னிருப்பாக, லேடெக்ச் PDF வெளியீட்டில் அடிக்குறிப்புக் குறிகளுக்கு முன்னால் இடைவெளி இருக்காது, ``\sphinxBeforeFootnote`` தேவைப்பட்டால் பயனர் தனிப்பயனாக்கலை அனுமதிக்கிறது.

source: LaTeX target requires that option ``hyperfootnotes`` of package ``hyperref`` be left unchanged to its default (i.e. ``true``) (refs: #3022)
ta: லாடெக்சு இலக்குக்கு, ``hyperref`` தொகுப்பின் ``hyperfootnotes`` விருப்பத்தை அதன் இயல்புநிலையாக மாற்றாமல் இருக்க வேண்டும் (அதாவது ``true``) (குறிப்புகள்: #3022)

source: 1.5 final
ta: 1.5 இறுதி

source: #2986: ``themes/basic/defindex.html`` is now deprecated
ta: #2986: ``themes/basic/defindex.html`` இப்போது நிறுத்தப்பட்டது

source: Emit warnings that will be deprecated in Sphinx 1.6 by default. Users can change the behavior by setting the environment variable PYTHONWARNINGS. Please refer :ref:`when-deprecation-warnings-are-displayed`.
ta: முன்னிருப்பாக ஸ்பிங்க்ஸ் 1.6 இல் நீக்கப்படும் எச்சரிக்கைகளை வெளியிடுங்கள். சுற்றுச்சூழல் மாறி பைதன்வார்னிங்ஸை அமைப்பதன் மூலம் பயனர்கள் நடத்தை மாற்றலாம். தயவுசெய்து பார்க்கவும்: ref: `எப்போது-குறைப்பு-எச்சரிக்கைகள்-காண்பிக்கப்படுகின்றன- காட்சிப்படுத்தப்பட்டவை.

source: #2454: new JavaScript variable ``SOURCELINK_SUFFIX`` is added
ta: #2454: புதிய சாவாச்கிரிப்ட் மாறி ``SOURCELINK_SUFFIX`` சேர்க்கப்பட்டது

source: Deprecated
ta: மதிப்பிடப்பட்டது

source: These features are removed in Sphinx 1.6:
ta: இந்த அம்சங்கள் ஸ்பிங்க்ஸ் 1.6 இல் அகற்றப்படுகின்றன:

source: LDML format support in i18n feature
ta: I18N அம்சத்தில் LDML வடிவமைப்பு ஆதரவு

source: Some functions and classes in ``sphinx.util.pycompat``: ``zip_longest``, ``product``, ``all``, ``any``, ``next``, ``open``, ``class_types``, ``base_exception``, ``relpath``, ``StringIO``, ``BytesIO``. Please use the standard library version instead;
ta: `` Sphinx.util.pycompat``: `` zip_longest``, `` தயாரிப்பு`, `` `அனைத்தும்`,` `ஏதேனும்``,` `அடுத்த``,` திறந்திருக்கும்`` . அதற்கு பதிலாக நிலையான நூலக பதிப்பைப் பயன்படுத்தவும்;

source: If any deprecation warning like ``RemovedInSphinxXXXWarning`` are displayed, please refer :ref:`when-deprecation-warnings-are-displayed`.
ta: `` RemovedInsphinxxxxwarning`` போன்ற ஏதேனும் மதிப்பிழப்பு எச்சரிக்கை காட்டப்பட்டால், தயவுசெய்து பார்க்கவும்: ref: `எப்போது-குறைப்பு-எச்சரிக்கைகள்-காண்பிக்கப்படுகின்றன-.

source: #2951: Add ``--implicit-namespaces`` PEP-0420 support to apidoc.
ta: #2951: ``--inmplicit-namespaces`` PEP-0420 ஆதரவை apidoc இல் சேர்க்கவும்.

source: Add ``:caption:`` option for sphinx.ext.inheritance_diagram.
ta: ``: தலைப்பு: `` sphinx.ext.inheritance_diagram க்கு விருப்பத்தை சேர்க்கவும்.

source: #2471: Add config variable for default doctest flags.
ta: #2471: இயல்புநிலை டாக்டெச்ட் கொடிகளுக்கு கட்டமைப்பு மாறியைச் சேர்க்கவும்.

source: Convert linkcheck builder to requests for better encoding handling
ta: சிறந்த குறியாக்க கையாளுதலுக்கான கோரிக்கைகளுக்கு லிங்க்செக் பில்டரை மாற்றவும்

source: #2463, #2516: Add keywords of "meta" directive to search index
ta: #2463, #2516: தேடல் குறியீட்டில் "மேவு" கட்டளையின் முக்கிய வார்த்தைகளைச் சேர்க்கவும்

source: ``:maxdepth:`` option of toctree affects ``secnumdepth`` (ref: #2547)
ta: ``:maxdepth:`` toctree விருப்பம் ``secnumdepth`` (குறிப்பு: #2547)

source: #2575: Now ``sphinx.ext.graphviz`` allows ``:align:`` option
ta: #2575: இப்போது ``sphinx.ext.graphviz`` ``:align:`` விருப்பத்தை அனுமதிக்கிறது

source: Show warnings if unknown key is specified to ``latex_elements``
ta: தெரியாத விசை ``latex_elements`` க்கு குறிப்பிடப்பட்டிருந்தால் எச்சரிக்கைகளைக் காட்டு

source: Show warnings if no domains match with ``primary_domain`` (ref: #2001)
ta: ``முதன்மை டொமைன்`` (இன்: #2001) உடன் எந்த டொமைனும் பொருந்தவில்லை எனில் எச்சரிக்கையைக் காட்டு

source: C++, show warnings when the kind of role is misleading for the kind of target it refers to (e.g., using the ``class`` role for a function).
ta: C++, அது குறிக்கும் இலக்கின் வகையை தவறாக வழிநடத்தும் போது எச்சரிக்கைகளைக் காட்டு

source: latex, writer abstracts more of text styling into customizable macros, e.g. the ``visit_emphasis`` will output ``\sphinxstyleemphasis`` rather than ``\emph`` (which may be in use elsewhere or in an added LaTeX package). See list at end of ``sphinx.sty`` (ref: #2686)
ta: லேடெக்ச், ரைட்டர் டெக்ச்ட் ச்டைலிங்கை தனிப்பயனாக்கக்கூடிய மேக்ரோக்களாக மாற்றுகிறார், எ.கா. ``visit_emphasis`` ஆனது ``\emph`` என்பதற்குப் பதிலாக ``\sphinxstyleemphasis`` என்பதை வெளியிடும் (இது வேறு இடங்களில் அல்லது சேர்க்கப்பட்ட லாடெக்சு தொகுப்பில் பயன்பாட்டில் இருக்கலாம்). ``sphinx.sty`` இன் இறுதியில் பட்டியலைப் பார்க்கவும் (குறிப்பு: #2686)

source: latex, public names for environments and parameters used by note, warning, and other admonition types, allowing full customizability from the ``'preamble'`` key or an input file (ref: feature request #2674, #2685)
ta: லேடெக்ச், குறிப்பு, முன்னறிவிப்பு மற்றும் பிற அறிவுரை வகைகளால் பயன்படுத்தப்படும் சூழல்கள் மற்றும் அளவுருக்களுக்கான பொதுப் பெயர்கள், ``' முன்னுரை'`` விசை அல்லது உள்ளீட்டு கோப்பிலிருந்து முழு தனிப்பயனாக்கத்தை அனுமதிக்கிறது (குறிப்பு: அம்ச கோரிக்கை #2674, #2685)

source: latex, better computes column widths of some tables (as a result, there will be slight changes as tables now correctly fill the line width; ref: #2708)
ta: லேடெக்ச், சில அட்டவணைகளின் நெடுவரிசை அகலத்தை சிறப்பாகக் கணக்கிடுகிறது (இதன் விளைவாக, அட்டவணைகள் இப்போது வரி அகலத்தை சரியாக நிரப்புவதால் சிறிய மாற்றங்கள் இருக்கும்; குறிப்பு: #2708)

source: latex, sphinxVerbatim environment is more easily customizable (ref: #2704). In addition to already existing VerbatimColor and VerbatimBorderColor:
ta: latex, sphinxVerbatim சூழல் மிகவும் எளிதாக தனிப்பயனாக்கக்கூடியது (குறிப்பு: #2704). ஏற்கனவே உள்ள VerbatimColor மற்றும் VerbatimBorderColor ஆகியவற்றுடன் கூடுதலாக:

source: two lengths ``\sphinxverbatimsep`` and ``\sphinxverbatimborder``,
ta: இரண்டு நீளங்கள் `` \ sphinxverbatimsep`` மற்றும் `` \ sphinxverbatimborder``,

source: booleans ``\ifsphinxverbatimwithframe`` and ``\ifsphinxverbatimwrapslines``.
ta: பூலியன்ஸ் `` \ ifsphinxverbatimwithframe`` மற்றும் `\ ifsphinxverbatimwrapslines``.

source: latex, captions for literal blocks inside tables are handled, and long code lines wrapped to fit table cell (ref: #2704)
ta: லேடெக்ச், அட்டவணைகளுக்குள் உள்ள எழுத்துத் தொகுதிகளுக்கான தலைப்புகள் கையாளப்படுகின்றன, மேலும் டேபிள் கலத்திற்கு ஏற்றவாறு நீண்ட குறியீடு கோடுகள் மூடப்பட்டிருக்கும் (குறிப்பு: #2704)

source: #2597: Show warning messages as darkred
ta: #2597: முன்னறிவிப்பு செய்திகளை இருண்டதாகக் காட்டு

source: latex, allow image dimensions using px unit (default is 96px=1in)
ta: லேடெக்ஸ், பிஎக்ஸ் அலகு பயன்படுத்தி பட பரிமாணங்களை அனுமதிக்கவும் (இயல்புநிலை 96px = 1in)

source: Show warnings if invalid dimension units found
ta: தவறான பரிமாண அலகுகள் காணப்பட்டால் எச்சரிக்கைகளைக் காட்டுங்கள்

source: #2650: Add ``--pdb`` option to setup.py command
ta: #2650: setup.py கட்டளைக்கு ``--pdb`` விருப்பத்தைச் சேர்க்கவும்

source: latex, make the use of ``\small`` for code listings customizable (ref #2721)
ta: லேடெக்ச், தனிப்பயனாக்கக்கூடிய குறியீடு பட்டியல்களுக்கு ``\small`` ஐப் பயன்படுத்தவும் (ref #2721)

source: #2663: Add ``--warning-is-error`` option to setup.py command
ta: #2663: setup.py கட்டளையில் ``--warning-is-error`` விருப்பத்தைச் சேர்க்கவும்

source: Show warnings if deprecated latex options are used
ta: நீக்கப்பட்ட லேடெக்ஸ் விருப்பங்கள் பயன்படுத்தப்பட்டால் எச்சரிக்கைகளைக் காட்டு

source: Add sphinx.config.ENUM to check the config values is in candidates
ta: கட்டமைப்பு மதிப்புகள் வேட்பாளர்களில் உள்ளன என்பதை சரிபார்க்க Sphinx.config.enum ஐச் சேர்க்கவும்

source: math: Add hyperlink marker to each equations in HTML output
ta: கணிதம்: HTML வெளியீட்டில் ஒவ்வொரு சமன்பாடுகளுக்கும் ஹைப்பர்லிங்க் மார்க்கரைச் சேர்க்கவும்

source: Add new theme ``nonav`` that doesn't include any navigation links. This is for any help generator like qthelp.
ta: புதிய தீம் `` nonav`` ஐச் சேர்க்கவும், அதில் எந்த வழிசெலுத்தல் இணைப்புகளும் இல்லை. இது Qthelp போன்ற எந்த உதவி ஜெனரேட்டருக்கும் ஆகும்.

source: #2680: ``sphinx.ext.todo`` now emits warnings if ``todo_emit_warnings`` enabled. Also, it emits an additional event named ``todo-defined`` to handle the TODO entries in 3rd party extensions.
ta: #2680: ``todo_emit_warnings`` இயக்கப்பட்டிருந்தால், ``sphinx.ext.todo`` இப்போது எச்சரிக்கைகளை வெளியிடுகிறது. மேலும், இது 3வது தரப்பு நீட்டிப்புகளில் TODO உள்ளீடுகளைக் கையாள ``todo-defined`` என்ற கூடுதல் நிகழ்வை வெளியிடுகிறது.

source: Python domain signature parser now uses the xref mixin for 'exceptions', allowing exception classes to be autolinked.
ta: பைதான் டொமைன் கையொப்பம் பாகுபடுத்தி இப்போது 'விதிவிலக்குகளுக்கு' எக்ஸ்ரெஃப் மிக்ஸினைப் பயன்படுத்துகிறது, இது விதிவிலக்கு வகுப்புகளை ஆட்டோலிங்க் செய்ய அனுமதிக்கிறது.

source: #2513: Add ``latex_engine`` to switch the LaTeX engine by conf.py
ta: #2513: conf.py மூலம் லாடெக்சு இன்சினை மாற்ற ``latex_engine`` ஐச் சேர்க்கவும்

source: #2682: C++, basic support for attributes (C++11 style and GNU style). The new configuration variables 'cpp_id_attributes' and 'cpp_paren_attributes' can be used to introduce custom attributes.
ta: #2682: C++, பண்புக்கூறுகளுக்கான அடிப்படை உதவி (C++11 பாணி மற்றும் GNU பாணி). புதிய கட்டமைப்பு மாறிகள் 'cpp_id_attributes' மற்றும் 'cpp_paren_attributes' தனிப்பயன் பண்புகளை அறிமுகப்படுத்த பயன்படுத்தப்படலாம்.

source: #1958: C++, add configuration variable 'cpp_index_common_prefix' for removing prefixes from the index text of C++ objects.
ta: #1958: C++, C++ பொருள்களின் குறியீட்டு உரையிலிருந்து முன்னொட்டுகளை அகற்ற 'cpp_index_common_prefix' என்ற உள்ளமைவு மாறியைச் சேர்க்கவும்.

source: C++, added concept directive. Thanks to mickk-on-cpp.
ta: சி ++, சேர்க்கப்பட்ட கருத்து உத்தரவு. மிக்-ஆன்-சிபிபிக்கு நன்றி.

source: C++, added support for template introduction syntax. Thanks to mickk-on-cpp.
ta: சி ++, வார்ப்புரு அறிமுகம் தொடரியல் ஆகியவற்றிற்கான ஆதரவு சேர்க்கப்பட்டது. மிக்-ஆன்-சிபிபிக்கு நன்றி.

source: #2725: latex builder: allow to use user-defined template file (experimental)
ta: #2725: லேடக்ச் பில்டர்: பயனர் வரையறுக்கப்பட்ட டெம்ப்ளேட் கோப்பைப் பயன்படுத்த இசைவு (பரிசோதனை)

source: apidoc now avoids invalidating cached files by not writing to files whose content doesn't change. This can lead to significant performance wins if apidoc is run frequently.
ta: உள்ளடக்கம் மாறாத கோப்புகளுக்கு எழுதாமல் தற்காலிக சேமிப்பு கோப்புகளை செல்லாததாக்கும் அபிடோக் இப்போது தவிர்க்கிறது. அபிடோக் அடிக்கடி இயக்கப்பட்டால் இது குறிப்பிடத்தக்க செயல்திறன் வெற்றிகளுக்கு வழிவகுக்கும்.

source: #2851: ``sphinx.ext.math`` emits missing-reference event if equation not found
ta: #2851: ``sphinx.ext.math`` சமன்பாடு காணப்படாவிட்டால், விடுபட்ட குறிப்பு நிகழ்வை வெளியிடுகிறது

source: #1210: ``eqref`` role now supports cross reference
ta: #1210: ``eqref`` பாத்திரம் இப்போது குறுக்குக் குறிப்பை ஆதரிக்கிறது

source: #2892: Added ``-a`` (``--append-syspath``) option to ``sphinx-apidoc``
ta: #2892: ``-a`` (``--append-syspath``) விருப்பத்தை ``sphinx-apidoc`` இல் சேர்க்கப்பட்டது

source: #1604: epub3 builder: Obey font-related CSS when viewing in iBooks.
ta: #1604: epub3 builder: iBooks இல் பார்க்கும் போது எழுத்துரு தொடர்பான CSSக்குக் கீழ்ப்படியுங்கள்.

source: #646: ``option`` directive support '.' character as a part of options
ta: #646: ``option`` டைரக்டிவ் சப்போர்ட் '.' விருப்பங்களின் ஒரு பகுதியாக எழுத்து

source: Add document about kindlegen and fix document structure for it.
ta: கின்டெல்ஜென் பற்றிய ஆவணத்தைச் சேர்த்து, அதற்கான ஆவண கட்டமைப்பை சரிசெய்யவும்.

source: #2474: Add ``intersphinx_timeout`` option to ``sphinx.ext.intersphinx``
ta: #2474: ``sphinx.ext.intersphinx`` இல் ``intersphinx_timeout`` விருப்பத்தைச் சேர்க்கவும்

source: #2926: EPUB3 builder supports vertical mode (``epub3_writing_mode`` option)
ta: #2926: EPUB3 பில்டர் செங்குத்து பயன்முறையை ஆதரிக்கிறது (``epub3_writing_mode`` விருப்பம்)

source: #2695: ``build_sphinx`` subcommand for setuptools handles exceptions as same as ``sphinx-build`` does
ta: #2695: ``பில்ட்_ச்பிங்க்ச்`` அமைப்புகளுக்கான துணைக் கட்டளை, ``ச்பிங்க்ச்-பில்ட்`` செய்வது போலவே விதிவிலக்குகளைக் கையாளுகிறது

source: #326: ``numref`` role can also refer sections
ta: #326: ``numref`` பாத்திரம் பிரிவுகளையும் குறிப்பிடலாம்

source: #2916: ``numref`` role can also refer caption as an its linktext
ta: #2916: ``numref`` பாத்திரத்தை அதன் இணைப்பு உரையாகவும் குறிப்பிடலாம்

source: #3008: ``linkcheck`` builder ignores self-signed certificate URL
ta: #3008: ``linkcheck`` பில்டர் தன்வய கையொப்பமிட்ட சான்றிதழ் முகவரி ஐ புறக்கணிக்கிறது

source: #3020: new ``'geometry'`` key to ``latex_elements`` whose default uses LaTeX style file ``geometry.sty`` to set page layout
ta: #3020: பக்க தளவமைப்பை அமைக்க லேடெக்ச் பாணி ​​கோப்பை ``geometry.sty`` ஐப் பயன்படுத்தும் ```லேடெக்ச்_எலிமென்ட்ச்``க்கான புதிய ``'சியோமெட்ரி''` விசை

source: #2843: Add :start-at: and :end-at: options to literalinclude directive
ta: #2843: டைரக்டிவ் உள்ளிடுவதற்கு :start-at: மற்றும் :end-at: விருப்பங்களைச் சேர்க்கவும்

source: #2527: Add ``:reversed:`` option to toctree directive
ta: #2527: டோக்ட்ரீ உத்தரவுக்கு ``:ரிவர்ச்டு:`` விருப்பத்தைச் சேர்க்கவும்

source: Add ``-t`` and ``-d`` option to ``sphinx-quickstart`` to support templating generated Sphinx project.
ta: வார்ப்புரு உருவாக்கப்பட்ட ஸ்பிங்க்ஸ் திட்டத்தை ஆதரிக்க `` -t` மற்றும் `` -d`` விருப்பத்தை `` sphinx-quickstart`` இல் சேர்க்கவும்.

source: #3028: Add ``{path}`` and ``{basename}`` to the format of ``figure_language_filename``
ta: #3028: ``figure_language_filename`` வடிவமைப்பில் ``{path}`` மற்றும் ``{basename}`` சேர்க்கவும்

source: new ``'hyperref'`` key in the ``latex_elements`` dictionary (ref #3030)
ta: ```லேடெக்ச்_எலிமென்ட்ச்`` அகராதியில் புதிய ``'ஐப்பர்ரெஃப்'`` விசை (குறிப்பு #3030)

source: #3022: Allow code-blocks in footnotes for LaTeX PDF output
ta: #3022: லாடெக்சு PDF வெளியீட்டிற்கான அடிக்குறிப்புகளில் குறியீட்டுத் தொகுதிகளை அனுமதிக்கவும்

source: 1.5b1
ta: 1.5 பி 1

source: #2513: A better default settings for XeLaTeX
ta: #2513: XeLaTeXக்கான சிறந்த இயல்புநிலை அமைப்புகள்

source: #3096: ``'maxlistdepth'`` key to work around LaTeX list limitations
ta: #3096: லாடெக்சு பட்டியல் வரம்புகளைச் சுற்றி வேலை செய்வதற்கான ``'maxlistdepth'`` விசை

source: #3060: autodoc supports documentation for attributes of Enum class. Now autodoc render just the value of Enum attributes instead of Enum attribute representation.
ta: #3060: எனம் வகுப்பின் பண்புக்கூறுகளுக்கான ஆவணங்களை ஆட்டோடாக் ஆதரிக்கிறது. இப்போது ஆட்டோடாக் Enum பண்புக்கூறு பிரதிநிதித்துவத்திற்கு பதிலாக Enum பண்புக்கூறுகளின் மதிப்பை வழங்குதல் செய்கிறது.

source: Add ``--extensions`` to ``sphinx-quickstart`` to support enable arbitrary extensions from command line (ref: #2904)
ta: கட்டளை வரியிலிருந்து தன்னிச்சையான நீட்டிப்புகளை இயக்குவதை ஆதரிக்க, ``--நீட்டிப்புகளை`` ``ச்பிங்க்ச்-குயிக்ச்டார்ட்`` சேர்க்கவும் (குறிப்பு: #2904)

source: #3104, #3122: ``'sphinxsetup'`` for key=value styling of Sphinx LaTeX
ta: #3104, #3122: சூரரிமாச்சிலை லாடெக்சு இன் கீ=மதிப்பு ச்டைலிங்கிற்கான ``'ச்பிங்க்ச்செட்டப்'``

source: #3071: Autodoc: Allow mocked module decorators to pass-through functions unchanged
ta: #3071: ஆட்டோடாக்: கேலி செய்யப்பட்ட மாட்யூல் டெக்கரேட்டர்கள் மாறாமல் செயல்பாடுகளை அனுப்ப இசைவு

source: #2495: linkcheck: Allow skipping anchor checking using :confval:`linkcheck_anchors_ignore`
ta: #2495: இணைப்புச் சரிபார்ப்பு: :confval:`linkcheck_anchors_ignore` ஐப் பயன்படுத்தி நங்கூரச் சரிபார்ப்பைத் தவிர்க்கவும்

source: #3083: let Unicode no-break space act like LaTeX ``~`` (fixed #3019)
ta: #3083: யூனிகோட் நோ-பிரேக் ச்பேச் லாடெக்சு ``~`` போன்று செயல்பட அனுமதிக்கவும் (நிலையானது #3019)

source: #3116: allow word wrap in PDF output for inline literals (ref #3110)
ta: #3116: இன்லைன் எழுத்துகளுக்கு PDF வெளியீட்டில் சொல் மடக்கு இசைவு (ref #3110)

source: #930: sphinx-apidoc allow wildcards for excluding paths. Thanks to Nick Coghlan.
ta: #930: ச்பிங்க்ச்-அபிடோக் பாதைகளைத் தவிர்த்து வைல்டு கார்டுகளை அனுமதிக்கிறது. நிக் கோக்லனுக்கு நன்றி.

source: #3121: add ``inlineliteralwraps`` option to control if inline literal word-wraps in latex
ta: #3121: லேடெக்சில் இன்லைன் லைட்டர்ரல் வேர்ட்-ரேப்கள் இருந்தால் கட்டுப்படுத்த ``inlineliteralwraps`` விருப்பத்தைச் சேர்க்கவும்

source: #3095: Add :confval:`tls_verify` and :confval:`tls_cacerts` to support self-signed HTTPS servers in linkcheck and intersphinx
ta: #3095: இணைப்புச் சரிபார்ப்பு மற்றும் இன்டர்ச்பிங்க்சில் சுய-கையொப்பமிட்ட HTTPS சேவையகங்களை ஆதரிக்க :confval:`tls_verify` மற்றும் :confval:`tls_cacerts` ஆகியவற்றைச் சேர்க்கவும்

source: #2215: make.bat generated by sphinx-quickstart can be called from another dir. Thanks to Timotheus Kampik.
ta: #2215: ச்பிங்க்ச்-குயிக்ச்டார்ட் மூலம் உருவாக்கப்படும் make.bat ஐ வேறொரு இயக்கத்திலிருந்து அழைக்கலாம். திமோதியச் காம்பிக் அவர்களுக்கு நன்றி.

source: #3185: Add new warning type ``misc.highlighting_failure``
ta: #3185: ``misc.highlighting_failure`` என்ற புதிய முன்னறிவிப்பு வகையைச் சேர்க்கவும்

source: #2707: (latex) the column width is badly computed for tabular
ta: #2707: (லேடெக்ச்) நெடுவரிசை அகலம் அட்டவணைக்கு மோசமாக கணக்கிடப்படுகிறது

source: #2799: Sphinx installs roles and directives automatically on importing sphinx module. Now Sphinx installs them on running application.
ta: #2799: சூரரிமாச்சிலை தொகுதியை இறக்குமதி செய்வதில் சூரரிமாச்சிலை தானாக பாத்திரங்கள் மற்றும் வழிமுறைகளை நிறுவுகிறது. இப்போது சூரரிமாச்சிலை அவற்றை இயங்கும் பயன்பாட்டில் நிறுவுகிறது.

source: ``sphinx.ext.autodoc`` crashes if target code imports * from mock modules by ``autodoc_mock_imports``.
ta: ``autodoc_mock_imports`` மூலம் போலி மாட்யூல்களில் இருந்து இலக்கு குறியீடு * இறக்குமதி செய்தால் ``sphinx.ext.autodoc`` செயலிழக்கும்.

source: #1953: ``Sphinx.add_node`` does not add handlers the translator installed by ``html_translator_class``
ta: #1953: ``Html_translator_class`` மூலம் நிறுவப்பட்ட மொழிபெயர்ப்பாளரை ``Sphinx.add_node`` கையாளுபவர்களைச் சேர்க்காது

source: #1797: text builder inserts blank line on top
ta: #1797: டெக்ச்ட் பில்டர் மேலே வெற்றுக் கோட்டைச் செருகுகிறது

source: #2894: quickstart main() doesn't use argv argument
ta: #2894: Quickstart main() argv வாதத்தைப் பயன்படுத்தாது

source: #2874: gettext builder could not extract all text under the ``only`` directives
ta: #2874: உரைபெறு builderல் ``only`` கட்டளைகளின் கீழ் அனைத்து உரைகளையும் பிரித்தெடுக்க முடியவில்லை

source: #2485: autosummary crashes with multiple source_suffix values
ta: #2485: பல மூல_பின்னொட்டு மதிப்புகளுடன் தன்னியக்க சுருக்கம் செயலிழக்கிறது

source: #1734: Could not translate the caption of toctree directive
ta: #1734: டோக்ட்ரீ உத்தரவின் தலைப்பை மொழிபெயர்க்க முடியவில்லை

source: Could not translate the content of meta directive (ref: #1734)
ta: மேவு கட்டளையின் உள்ளடக்கத்தை மொழிபெயர்க்க முடியவில்லை (குறிப்பு: #1734)

source: #2550: external links are opened in help viewer
ta: #2550: எல்ப் வியூவரில் வெளிப்புற இணைப்புகள் திறக்கப்படுகின்றன

source: #2687: Running Sphinx multiple times produces 'already registered' warnings
ta: #2687: Sphinxஐ பலமுறை இயக்குவது 'ஏற்கனவே பதிவுசெய்யப்பட்ட' எச்சரிக்கைகளை உருவாக்குகிறது

source: #2810: Problems with pdflatex in an Italian document
ta: #2810: இத்தாலிய ஆவணத்தில் pdflatex இல் உள்ள சிக்கல்கள்

source: Use ``latex_elements.papersize`` to specify papersize of LaTeX in Makefile
ta: மேக்ஃபைலில் லேடெக்ஸின் ஆவணங்களை குறிப்பிட `` Latex_elements.papersize`` ஐப் பயன்படுத்தவும்

source: #2988: linkcheck: retry with GET request if denied HEAD request
ta: #2988: இணைப்புச் சரிபார்ப்பு: HEAD கோரிக்கை நிராகரிக்கப்பட்டால், GET கோரிக்கையுடன் மீண்டும் முயற்சிக்கவும்

source: #2990: linkcheck raises "Can't convert 'bytes' object to str implicitly" error if linkcheck_anchors enabled
ta: #2990: linkcheck_anchors இயக்கப்பட்டிருந்தால், இணைப்புச் சரிபார்ப்பு "பைட்டுகள்' பொருளை மறைமுகமாக str ஆக மாற்ற முடியாது" பிழையை எழுப்புகிறது

source: #3004: Invalid link types "top" and "up" are used
ta: #3004: தவறான இணைப்பு வகைகள் "மேல்" மற்றும் "மேல்" பயன்படுத்தப்படுகின்றன

source: #3009: Bad rendering of parsed-literals in LaTeX since Sphinx 1.4.4
ta: #3009: சூரரிமாச்சிலை 1.4.4 முதல் லாடெக்சு இல் பாகுபடுத்தப்பட்ட எழுத்துகளின் மோசமான வழங்குதல்

source: #3000: ``option`` directive generates invalid HTML anchors
ta: #3000: ``option`` கட்டளை தவறான உஉகுமொ ஆங்கர்களை உருவாக்குகிறது

source: #2984: Invalid HTML has been generated if ``html_split_index`` enabled
ta: #2984: ``html_split_index`` செயல்படுத்தப்பட்டால் தவறான உஉகுமொ உருவாக்கப்படும்

source: #2986: themes/basic/defindex.html should be changed for html5 friendly
ta: #2986: தீம்கள்/அடிப்படை/defindex.html html5 நட்புக்கு மாற்றப்பட வேண்டும்

source: #2987: Invalid HTML has been generated if multiple IDs are assigned to a list
ta: #2987: ஒரு பட்டியலில் பல ஐடிகள் ஒதுக்கப்பட்டால், தவறான உஉகுமொ உருவாக்கப்படும்

source: #2891: HTML search does not provide all the results
ta: #2891: உஉகுமொ தேடல் அனைத்து முடிவுகளையும் வழங்காது

source: #1986: Title in PDF Output
ta: #1986: PDF வெளியீட்டில் தலைப்பு

source: #147: Problem with latex chapter style
ta: #147: லேடெக்ச் அத்தியாயம் பாணியில் சிக்கல்

source: #3018: LaTeX problem with page layout dimensions and chapter titles
ta: #3018: பக்க தளவமைப்பு பரிமாணங்கள் மற்றும் அத்தியாய தலைப்புகளில் லாடெக்சு சிக்கல்

source: Fix an issue with ``\pysigline`` in LaTeX style file (ref #3023)
ta: லாடெக்சு பாணி கோப்பில் ``\pysigline`` உடன் சிக்கலைச் சரிசெய்யவும் (ref #3023)

source: #3038: ``sphinx.ext.math*`` raises TypeError if labels are duplicated
ta: #3038: ``sphinx.ext.math*`` லேபிள்கள் நகலெடுக்கப்பட்டால் TypeError ஐ எழுப்பும்

source: #3031: incompatibility with LaTeX package ``tocloft``
ta: #3031: லாடெக்சு தொகுப்பு ``tocloft`` உடன் இணக்கமின்மை

source: #3003: literal blocks in footnotes are not supported by Latex
ta: #3003: அடிக்குறிப்புகளில் உள்ள எழுத்துத் தொகுதிகள் லேடெக்சால் ஆதரிக்கப்படவில்லை

source: #3047: spacing before footnote in pdf output is not coherent and allows breaks
ta: #3047: pdf வெளியீட்டில் அடிக்குறிப்புக்கு முன் இடைவெளி ஒத்திசைவாக இல்லை மற்றும் இடைவெளிகளை அனுமதிக்கிறது

source: #3045: HTML search index creator should ignore "raw" content if now html
ta: #3045: உஉகுமொ தேடல் குறியீட்டை உருவாக்குபவர் இப்போது உஉகுமொ என்றால் "raw" உள்ளடக்கத்தை புறக்கணிக்க வேண்டும்

source: #3039: English stemmer returns wrong word if the word is capitalized
ta: #3039: ஆங்கில ச்டெம்மர் சொல் பெரியதாக இருந்தால் தவறான வார்த்தையைத் தரும்

source: Fix make-mode Makefile template (ref #3056, #2936)
ta: மேக்-மோட் மேக்ஃபைல் டெம்ப்ளேட்டை சரிசெய்யவும் (குறிப்பு #3056, #2936)

source: #2432: Fix unwanted * between varargs and keyword only args. Thanks to Alex Grönholm.
ta: #2432: varargs மற்றும் Keyword only args இடையே தேவையற்ற * ஐ சரிசெய்யவும். Alex Grönholm அவர்களுக்கு நன்றி.

source: #3062: Failed to build PDF using 1.5a2 (undefined ``\hypersetup`` for Japanese documents since PR#3030)
ta: #3062: 1.5a2 ஐப் பயன்படுத்தி PDF ஐ உருவாக்க முடியவில்லை (பிஆர்#3030 முதல் சப்பானிய ஆவணங்களுக்கான வரையறுக்கப்படாத ``\ஐப்பர்செட்டப்``)

source: Better rendering of multiline signatures in html.
ta: HTML இல் பல கையொப்பங்களை சிறப்பாகக் காண்பித்தல்.
