Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_changes--1_4_*.po
Languages: ta

source: Remove ``image/gif`` from supported_image_types of LaTeX writer (#2272)
ta: லாடெக்சு ரைட்டரின் ஆதரிக்கப்படும்_பட_வகைகளில் இருந்து ``image/gif`` அகற்று (#2272)

source: Fix ValueError is raised if LANGUAGE is empty string
ta: மொழி வெற்று சரமாக இருந்தால் VALUEERROR உயர்த்தப்படுகிறது

source: Fix unpack warning is shown when the directives generated from ``Sphinx.add_crossref_type`` is used
ta: `` Sphinx.add_crossref_type`` இலிருந்து உருவாக்கப்படும் வழிமுறைகள் பயன்படுத்தப்படும்போது, அவிழ்க்கும் எச்சரிக்கையை சரிசெய்யவும் காண்பிக்கப்படுகிறது

source: The default highlight language is now ``default``. This means that source code is highlighted as Python 3 (which is mostly a superset of Python 2) if possible. To get the old behavior back, add ``highlight_language = "python"`` to conf.py.
ta: இயல்புநிலை சிறப்பம்சமாக மொழி இப்போது `` இயல்புநிலை``. இதன் பொருள் மூலக் குறியீடு பைதான் 3 ஆக முன்னிலைப்படுத்தப்படுகிறது (இது பெரும்பாலும் பைதான் 2 இன் சூப்பர்செட்) முடிந்தால். பழைய நடத்தையைத் திரும்பப் பெற, `` சிறப்பம்சமாக_எல்ஜேஜ் = "பைதான்" `` `conf.py இல் சேர்க்கவும்.

source: #2329: Refresh environment forcedly if source directory has changed.
ta: #2329: மூல கோப்பகம் மாறியிருந்தால் சூழலை கட்டாயமாக புதுப்பிக்கவும்.

source: #2331: Fix code-blocks are filled by block in dvi; remove ``xcdraw`` option from xcolor package
ta: #2331: ஃபிக்ச் குறியீடு-தொகுதிகள் dvi இல் உள்ள தொகுதி மூலம் நிரப்பப்படுகின்றன; xcolor தொகுப்பிலிருந்து ``xcdraw`` விருப்பத்தை அகற்றவும்

source: Fix the confval type checker emits warnings if unicode is given to confvals which expects string value
ta: சரம் மதிப்பை எதிர்பார்க்கும் கான்ஃப்வல்களுக்கு யூனிகோட் வழங்கப்பட்டால், கான்ஃப்வால் வகை செக்கரை உறுதிப்படுத்துகிறது

source: #2360: Fix numref in LaTeX output is broken
ta: #2360: லாடெக்சு வெளியீட்டில் உள்ள numref ஐ சரிசெய்யவும்

source: #2361: Fix additional paragraphs inside the "compound" directive are indented
ta: #2361: "கலவை" கட்டளைக்குள் கூடுதல் பத்திகள் உள்தள்ளப்பட்டுள்ளன

source: #2364: Fix KeyError 'rootSymbol' on Sphinx upgrade from older version.
ta: #2364: பழைய பதிப்பிலிருந்து சூரரிமாச்சிலை மேம்படுத்தலில் 'ரூட் சிம்பல்' என்ற முக்கிய பிழையை சரிசெய்யவும்.

source: #2348: Move amsmath and amssymb to before fontpkg on LaTeX writer.
ta: #2348: லாடெக்சு ரைட்டரில் fontpkgக்கு முன் amsmath மற்றும் amssymb ஐ நகர்த்தவும்.

source: #2368: Ignore emacs lock files like ``.#foo.rst`` by default.
ta: #2368: இயல்புநிலையாக ``.#foo.rst`` போன்ற emacs லாக் கோப்புகளைப் புறக்கணிக்கவும்.

source: #2262: literal_block and its caption has been separated by pagebreak in LaTeX output.
ta: #2262: Literal_block மற்றும் அதன் தலைப்பு லாடெக்சு வெளியீட்டில் பேச் பிரேக் மூலம் பிரிக்கப்பட்டுள்ளது.

source: #2319: Fix table counter is overridden by code-block's in LaTeX. Thanks to jfbu.
ta: #2319: லாடெக்சு இல் உள்ள கோட்-பிளாக் மூலம் ஃபிக்ச் டேபிள் கவுண்டர் மேலெழுதப்பட்டது. jfbuக்கு நன்றி.

source: Fix unpack warning if combined with 3rd party domain extensions.
ta: 3 வது தரப்பு டொமைன் நீட்டிப்புகளுடன் இணைந்தால் எச்சரிக்கையை திறக்கவும்.

source: #1153: Fix figures in sidebar causes latex build error.
ta: #1153: பக்கப்பட்டியில் உள்ள புள்ளிவிவரங்களை சரிசெய்வது லேடெக்ச் உருவாக்கப் பிழையை ஏற்படுத்துகிறது.

source: #2358: Fix user-preamble could not override the tocdepth definition.
ta: #2358: பயனர் முன்னுரையை சரிசெய்தல் tocdepth வரையறையை மீற முடியவில்லை.

source: #2358: Reduce tocdepth if ``part`` or ``chapter`` is used for top_sectionlevel
ta: #2358: மேல்_பிரிவு நிலைக்கு ``பகுதி`` அல்லது ``அத்தியாயம்`` பயன்படுத்தப்பட்டால் tocdepth குறைக்கவும்

source: #2351: Fix footnote spacing
ta: #2351: அடிக்குறிப்பு இடைவெளியை சரிசெய்யவும்

source: #2363: Fix ``toctree()`` in templates generates broken links in SingleHTMLBuilder.
ta: #2363: Fix ``toctree()`` in வார்ப்புருக்கள் generates broken links in SingleHTMLBuilder.

source: #2366: Fix empty hyperref is generated on toctree in HTML builder.
ta: #2366: உஉகுமொ பில்டரில் டோக்ட்ரீயில் காலியான ஐப்பர்ரெஃப் உருவாக்கப்பட்டது.

source: Documentation
ta: ஆவணம்

source: #1757: Fix for usage of :confval:`html_last_updated_fmt`. Thanks to Ralf Hemmecke.
ta: #1757: :confval:`html_last_updated_fmt` இன் பயன்பாட்டிற்கான சரி. ரால்ஃப் எம்மெக்கிற்கு நன்றி.
