Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_usage--extensions--autosectionlabel_*.po
Languages: ta

source: :mod:`sphinx.ext.autosectionlabel` -- Allow referencing sections by their title
ta: :mod:`sphinx.ext.autosectionlabel` -- பிரிவுகளை அவற்றின் தலைப்பின் மூலம் குறிப்பிடுவதை இசைவு

source: By default, cross-references to sections use labels (see :rst:role:`ref`). This extension allows you to instead refer to sections by their title.
ta: இயல்பாக, பிரிவுகளுக்கான குறுக்கு குறிப்புகள் லேபிள்களைப் பயன்படுத்துகின்றன (பார்க்க :rst:role:`ref`). இந்த நீட்டிப்பு, அதற்குப் பதிலாகப் பிரிவுகளின் தலைப்பின்படி அவற்றைப் பார்க்க உங்களை அனுமதிக்கிறது.

source: For example::
ta: உதாரணத்திற்கு::

source: Internally, this extension generates the labels for each section. If same section names are used in whole of document, any one is used for a target by default. The ``autosectionlabel_prefix_document`` configuration variable can be used to make headings which appear multiple times but in different documents unique.
ta: உள்நாட்டில், இந்த நீட்டிப்பு ஒவ்வொரு பிரிவிற்கும் லேபிள்களை உருவாக்குகிறது. அதே பிரிவு பெயர்கள் முழு ஆவணத்திலும் பயன்படுத்தப்பட்டால், இயல்புநிலையாக இலக்குக்கு எந்த ஒன்றும் பயன்படுத்தப்படுகின்றன. பல முறை தோன்றும் ஆனால் வெவ்வேறு ஆவணங்களில் தனித்துவமான தலைப்புகளை உருவாக்க `` autosectionlabel_prefix_document`` உள்ளமைவு மாறி பயன்படுத்தப்படலாம்.

source: Configuration
ta: உள்ளமைவு

source: Type
ta: வகை

source: Default
ta: இயல்புநிலை

source: True to prefix each section label with the name of the document it is in, followed by a colon. For example, ``index:Introduction`` for a section called ``Introduction`` that appears in document ``index.rst``. Useful for avoiding ambiguity when the same section heading appears in different documents.
ta: ஒவ்வொரு பிரிவு லேபிளையும் அது இருக்கும் ஆவணத்தின் பெயருடன் முன்னொட்டு, அதைத் தொடர்ந்து ஒரு பெருங்குடல். எடுத்துக்காட்டாக, `` index.rst`` என்ற பிரிவுக்கு `` குறியீட்டு: `அறிமுகம்:` index.rst``. வெவ்வேறு ஆவணங்களில் அதே பிரிவு தலைப்பு தோன்றும்போது தெளிவற்ற தன்மையைத் தவிர்க்க பயனுள்ளதாக இருக்கும்.

source: If set, autosectionlabel chooses the sections for labeling by its depth. For example, when set 1 to ``autosectionlabel_maxdepth``, labels are generated only for top level sections, and deeper sections are not labeled. It defaults to ``None`` (i.e. all sections are labeled).
ta: அமைக்கப்பட்டால், autosectionlabel அதன் ஆழத்தின் அடிப்படையில் லேபிளிங்கிற்கான பிரிவுகளைத் தேர்ந்தெடுக்கும். எடுத்துக்காட்டாக, 1 ஐ ``autosectionlabel_maxdepth`` என அமைக்கும் போது, ​​மேல் நிலைப் பிரிவுகளுக்கு மட்டுமே லேபிள்கள் உருவாக்கப்படும், மேலும் ஆழமான பிரிவுகள் லேபிளிடப்படாது. இது இயல்புநிலையாக ``ஒன்றுமில்லை`` (அதாவது அனைத்து பிரிவுகளும் லேபிளிடப்பட்டுள்ளன).

source: Debugging
ta: பிழைத்திருத்தம்

source: The ``WARNING: undefined label`` indicates that your reference in :rst:role:`ref` is mis-spelled. Invoking :program:`sphinx-build` with ``-vvv`` (see :option:`-v`) will print all section names and the labels that have been generated for them. This output can help finding the right reference label.
ta: ``எச்சரிக்கை: வரையறுக்கப்படாத லேபிள்`` என்பது :rst:role:`ref` இல் உள்ள உங்கள் குறிப்பு தவறாக எழுதப்பட்டிருப்பதைக் குறிக்கிறது. ``-vvv`` (பார்க்க :option:`-v`) உடன் :program:`sphinx-build` ஐ ​​அழைப்பது அனைத்து பிரிவு பெயர்களையும் அவற்றுக்காக உருவாக்கப்பட்ட லேபிள்களையும் அச்சிடும். இந்த வெளியீடு சரியான குறிப்பு லேபிளைக் கண்டறிய உதவும்.
