Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_usage--restructuredtext--basics_*.po
Languages: ta

source: If you want to add a class to a directive, you may consider the ``:class:`` :dudir:`option <common-options>` instead, which is supported by most directives and allows for a more compact notation.
ta: நீங்கள் ஒரு கட்டளைக்கு வகுப்பைச் சேர்க்க விரும்பினால், அதற்குப் பதிலாக ``:class:`` :dudir:`option <common-options>` ஐப் பரிசீலிக்கலாம், இது பெரும்பாலான கட்டளைகளால் ஆதரிக்கப்படுகிறது மற்றும் மிகவும் சுருக்கமான குறியீட்டை அனுமதிக்கிறது.

source: HTML specifics:
ta: HTML பிரத்தியேகங்கள்:

source: :dudir:`meta` (generation of HTML ``<meta>`` tags, see also :ref:`html-meta` below)
ta: :dudir:`meta` (HTML ``<meta>`` குறிச்சொற்களின் தலைமுறை, மேலும் பார்க்கவும் :ref:`html-meta`)

source: :dudir:`title <metadata-document-title>` (override document title)
ta: :dudir:`title <metadata-document-title>` (ஆவணத்தின் தலைப்பை மீறு)

source: Influencing markup:
ta: மார்க்அப்பை பாதிக்கிறது:

source: :dudir:`default-role` (set a new default role)
ta: : dudir: `இயல்புநிலை-பங்கு` (புதிய இயல்புநிலை பாத்திரத்தை அமைக்கவும்)

source: :dudir:`role` (create a new role)
ta: : dudir: `பங்கு` (ஒரு புதிய பாத்திரத்தை உருவாக்கு)

source: Since these are only per-file, better use Sphinx's facilities for setting the :confval:`default_role`.
ta: இவை ஒரு கோப்புக்கு மட்டுமே என்பதால்,: confval: `default_role` ஐ அமைப்பதற்கான SPHINX இன் வசதிகளை சிறப்பாகப் பயன்படுத்துங்கள்.

source: Do *not* use the directives :dudir:`sectnum`, :dudir:`header` and :dudir:`footer`.
ta: * செய்ய வேண்டாம் * வழிமுறைகளைப் பயன்படுத்த வேண்டாம்: dudir: `Sectnum`,: tudir:` header` மற்றும்: dudir: `footter`.

source: Directives added by Sphinx are described in :doc:`directives`.
ta: SPHINX ஆல் சேர்க்கப்பட்ட வழிமுறைகள் இதில் விவரிக்கப்பட்டுள்ளன: DOC: `வழிமுறைகள்`.

source: Basically, a directive consists of a name, arguments, options and content. (Keep this terminology in mind, it is used in the next chapter describing custom directives.) Looking at this example, ::
ta: அடிப்படையில், ஒரு உத்தரவு ஒரு பெயர், வாதங்கள், விருப்பங்கள் மற்றும் உள்ளடக்கம் ஆகியவற்றைக் கொண்டுள்ளது. (இந்த சொற்களை மனதில் கொள்ளுங்கள், இது தனிப்பயன் வழிமுறைகளை விவரிக்கும் அடுத்த அத்தியாயத்தில் பயன்படுத்தப்படுகிறது.) இந்த உதாரணத்தைப் பார்க்கும்போது, ::

source: ``function`` is the directive name. It is given two arguments here, the remainder of the first line and the second line, as well as one option ``module`` (as you can see, options are given in the lines immediately following the arguments and indicated by the colons). Options must be indented to the same level as the directive content.
ta: `` செயல்பாடு`` என்பது வழிநடத்தும் பெயர். இதற்கு இங்கே இரண்டு வாதங்கள் வழங்கப்படுகின்றன, முதல் வரியின் எஞ்சியவை மற்றும் இரண்டாவது வரியையும், அத்துடன் ஒரு விருப்பம் `` தொகுதி`` (நீங்கள் பார்க்கிறபடி, வாதங்களைத் தொடர்ந்து உடனடியாக வரிகளில் விருப்பங்கள் வழங்கப்படுகின்றன மற்றும் பெருங்குடல்களால் குறிக்கப்படுகின்றன) . விருப்பங்கள் வழிநடத்தும் உள்ளடக்கத்தின் அதே நிலைக்கு உள்தள்ளப்பட வேண்டும்.

source: The directive content follows after a blank line and is indented relative to the directive start or if options are present, by the same amount as the options.
ta: டைரெக்டிவ் உள்ளடக்கம் ஒரு வெற்று வரிக்குப் பிறகு பின்வருமாறு மற்றும் உத்தரவு தொடக்கத்துடன் ஒப்பிடும்போது அல்லது விருப்பங்கள் இருந்தால், விருப்பங்களின் அதே அளவு.

source: Be careful as the indent is not a fixed number of whitespace, e.g. three, but any number whitespace. This can be surprising when a fixed indent is used throughout the document and can make a difference for directives which are sensitive to whitespace. Compare::
ta: உள்தள்ளல் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான இடைவெளி அல்ல என்பதால் கவனமாக இருங்கள், எ.கா. மூன்று, ஆனால் எந்த எண் இடைவெளி. ஆவணம் முழுவதும் ஒரு நிலையான உள்தள்ளல் பயன்படுத்தப்படும்போது இது ஆச்சரியமாக இருக்கும், மேலும் இடைவெளிக்கு உணர்திறன் கொண்ட வழிமுறைகளுக்கு ஒரு வித்தியாசத்தை ஏற்படுத்தும். ஒப்பிடுக ::

source: In the first code block, the indent for the content was fixated by the option line to three spaces, consequently the content starts with four spaces. In the latter the indent was fixed by the content itself to seven spaces, thus it does not start with a space.
ta: முதல் குறியீடு தொகுதியில், உள்ளடக்கத்திற்கான உள்தள்ளல் விருப்பக் கோடு மூலம் மூன்று இடைவெளிகளுக்கு நிர்ணயிக்கப்பட்டது, இதன் விளைவாக உள்ளடக்கம் நான்கு இடைவெளிகளுடன் தொடங்குகிறது. பிந்தையவற்றில் உள்தள்ளல் உள்ளடக்கத்தால் ஏழு இடங்களுக்கு நிர்ணயிக்கப்பட்டது, இதனால் அது ஒரு இடத்துடன் தொடங்காது.

source: Images
ta: படங்கள்

source: reStructuredText supports an image directive (:dudir:`ref <image>`), used like so::
ta: reStructuredText ஒரு பட கட்டளையை ஆதரிக்கிறது (:dudir:`ref <image>`), இவ்வாறு பயன்படுத்தப்படுகிறது::

source: When used within Sphinx, the file name given (here ``gnu.png``) must either be relative to the source file, or absolute which means that they are relative to the top source directory. For example, the file ``sketch/spam.rst`` could refer to the image ``images/spam.png`` as ``../images/spam.png`` or ``/images/spam.png``.
ta: SPHINX க்குள் பயன்படுத்தும்போது, கொடுக்கப்பட்ட கோப்பு பெயர் (இங்கே `` gnu.png``) மூல கோப்புடன் தொடர்புடையதாக இருக்க வேண்டும், அல்லது முழுமையானது, அதாவது அவை சிறந்த மூல கோப்பகத்துடன் தொடர்புடையவை. எடுத்துக்காட்டாக, `` ஸ்கெட்ச்/spam.rst`` கோப்பு `` படங்கள்/spam.png`` படத்தை `` ../ படங்கள்/spam.png`` அல்லது ``/images/spam.png எனக் குறிக்கலாம் ``.

source: Sphinx will automatically copy image files over to a subdirectory of the output directory on building (e.g. the ``_static`` directory for HTML output.)
ta: SPHINX படக் கோப்புகளை கட்டிடம் குறித்த வெளியீட்டு கோப்பகத்தின் துணை அடைவில் தானாகவே நகலெடுக்கும் (எ.கா. HTML வெளியீட்டிற்கான `` _static`` அடைவு.)

source: Interpretation of image size options (``width`` and ``height``) is as follows: if the size has no unit or the unit is pixels, the given size will only be respected for output channels that support pixels. Other units (like ``pt`` for points) will be used for HTML and LaTeX output (the latter replaces ``pt`` by ``bp`` as this is the TeX unit such that ``72bp=1in``).
ta: பட அளவு விருப்பங்களின் விளக்கம் (`` அகலம்`` மற்றும் `` உயரம்``) பின்வருமாறு: அளவிற்கு யூனிட் இல்லை அல்லது அலகு பிக்சல்கள் என்றால், கொடுக்கப்பட்ட அளவு பிக்சல்களை ஆதரிக்கும் வெளியீட்டு சேனல்களுக்கு மட்டுமே மதிக்கப்படும். பிற அலகுகள் (புள்ளிகளுக்கான `` pt`` போன்றவை) HTML மற்றும் லேடெக்ஸ் வெளியீட்டிற்கு பயன்படுத்தப்படும் (பிந்தையது `` pt`` ஆல் `` பிபி`` ஆல் மாற்றப்படுகிறது, ஏனெனில் இது டெக்ஸ் யூனிட் ஆகும், அதாவது `` 72bp = 1in````` ).

source: Sphinx extends the standard docutils behavior by allowing an asterisk for the extension::
ta: நீட்டிப்புக்கு ஒரு நட்சத்திரத்தை அனுமதிப்பதன் மூலம் SPHINX நிலையான ஆவணங்களின் நடத்தையை நீட்டிக்கிறது ::

source: Sphinx then searches for all images matching the provided pattern and determines their type. Each builder then chooses the best image out of these candidates. For instance, if the file name ``gnu.*`` was given and two files :file:`gnu.pdf` and :file:`gnu.png` existed in the source tree, the LaTeX builder would choose the former, while the HTML builder would prefer the latter. Supported image types and choosing priority are defined at :doc:`/usage/builders/index`.
ta: ஸ்பிங்க்ஸ் பின்னர் வழங்கப்பட்ட வடிவத்துடன் பொருந்தக்கூடிய அனைத்து படங்களையும் தேடுகிறது மற்றும் அவற்றின் வகையை தீர்மானிக்கிறது. ஒவ்வொரு பில்டரும் இந்த வேட்பாளர்களிடமிருந்து சிறந்த படத்தைத் தேர்வு செய்கிறார்கள். உதாரணமாக, கோப்பு பெயர் `` குனு.*`` வழங்கப்பட்டது மற்றும் இரண்டு கோப்புகள்: கோப்பு: `gnu.pdf` மற்றும்: கோப்பு:` gnu.png` மூல மரத்தில் இருந்தால், லேடெக்ஸ் பில்டர் முந்தையதைத் தேர்ந்தெடுப்பார், HTML பில்டர் பிந்தையதை விரும்புவார். ஆதரிக்கப்படும் பட வகைகள் மற்றும் முன்னுரிமையைத் தேர்ந்தெடுப்பது இங்கு வரையறுக்கப்பட்டுள்ளன: DOC: `/பயன்பாடு/பில்டர்கள்/குறியீட்டு`.

source: Note that image file names should not contain spaces.
ta: பட கோப்பு பெயர்களில் இடைவெளிகள் இருக்கக்கூடாது என்பதை நினைவில் கொள்க.

source: Added the support for file names ending in an asterisk.
ta: ஒரு நட்சத்திரத்தில் முடிவடையும் கோப்பு பெயர்களுக்கான ஆதரவைச் சேர்த்தது.

source: Image paths can now be absolute.
ta: பட பாதைகள் இப்போது முழுமையானதாக இருக்கலாம்.

source: latex target supports pixels (default is ``96px=1in``).
ta: லேடெக்ஸ் இலக்கு பிக்சல்களை ஆதரிக்கிறது (இயல்புநிலை `` 96px = 1in``).

source: Footnotes
ta: அடிக்குறிப்புகள்

source: For footnotes (:duref:`ref <footnotes>`), use ``[#name]_`` to mark the footnote location, and add the footnote body at the bottom of the document after a "Footnotes" rubric heading, like so::
ta: அடிக்குறிப்புகளுக்கு (: duref: `ref <footnotes>`), அடிக்குறிப்பு இருப்பிடத்தைக் குறிக்க `` [#பெயர்] _`` ஐப் பயன்படுத்தவும், மேலும் "அடிக்குறிப்புகள்" ரப்ரிக் தலைப்புக்குப் பிறகு ஆவணத்தின் அடிப்பகுதியில் அடிக்குறிப்பு உடலைச் சேர்க்கவும் அதனால்::

source: You can also explicitly number the footnotes (``[1]_``) or use auto-numbered footnotes without names (``[#]_``).
ta: நீங்கள் அடிக்குறிப்புகளை (`` [1] _``) வெளிப்படையாக எண்ணலாம் அல்லது பெயர்கள் இல்லாமல் தானாக எண்ணும் அடிக்குறிப்புகளைப் பயன்படுத்தலாம் (`` [#] _ ``).

source: Citations
ta: மேற்கோள்கள்

source: Standard reStructuredText citations (:duref:`ref <citations>`) are supported, with the additional feature that they are "global", i.e. all citations can be referenced from all files. Use them like so::
ta: நிலையான மறுகட்டமைக்கப்பட்ட உரை மேற்கோள்கள் (:duref:`ref <citations>`) ஆதரிக்கப்படுகின்றன, அவை "உலகளாவிய" என்ற கூடுதல் அம்சத்துடன், அதாவது அனைத்து மேற்கோள்களையும் எல்லா கோப்புகளிலிருந்தும் குறிப்பிடலாம். அவற்றை இவ்வாறு பயன்படுத்தவும் ::

source: Citation usage is similar to footnote usage, but with a label that is not numeric or begins with ``#``.
ta: மேற்கோள் பயன்பாடு அடிக்குறிப்பு பயன்பாட்டைப் போன்றது, ஆனால் ஒரு லேபிளுடன் எண் அல்ல அல்லது ``#`` உடன் தொடங்குகிறது.

source: Substitutions
ta: மாற்றீடுகள்

source: reStructuredText supports "substitutions" (:duref:`ref <substitution-definitions>`), which are pieces of text and/or markup referred to in the text by ``|name|``. They are defined like footnotes with explicit markup blocks, like this::
ta: reStructuredText "பதிலீடுகள்" (:duref:`ref <substitution-definitions>`) ஆதரிக்கிறது, அவை உரையின் துண்டுகள் மற்றும்/அல்லது ``|name|`` மூலம் உரையில் குறிப்பிடப்பட்ட மார்க்அப் ஆகும். இது போன்ற வெளிப்படையான மார்க்அப் தொகுதிகள் கொண்ட அடிக்குறிப்புகள் போல் அவை வரையறுக்கப்பட்டுள்ளன::

source: or this::
ta: அல்லது இது ::

source: See the :duref:`reStructuredText reference for substitutions <substitution-definitions>` for details.
ta: விவரங்களுக்கு மாற்று <substitution-definition>`க்கான :duref:`reStructuredText குறிப்பைப் பார்க்கவும்.

source: If you want to use some substitutions for all documents, put them into :confval:`rst_prolog` or :confval:`rst_epilog` or put them into a separate file and include it into all documents you want to use them in, using the :dudir:`include` directive. (Be sure to give the include file a file name extension differing from that of other source files, to avoid Sphinx finding it as a standalone document.)
ta: எல்லா ஆவணங்களுக்கும் நீங்கள் சில மாற்றுகளைப் பயன்படுத்த விரும்பினால், அவற்றை வைக்கவும்: confval: `rst_prolog` அல்லது: confval:` rst_epilog` அல்லது அவற்றை ஒரு தனி கோப்பில் வைக்கவும், அவற்றை நீங்கள் பயன்படுத்த விரும்பும் அனைத்து ஆவணங்களிலும் சேர்க்கவும்: டுடிர்: `சேர்க்கவும்` உத்தரவு. (SPHINX ஐ ஒரு முழுமையான ஆவணமாகக் கண்டுபிடிப்பதைத் தவிர்க்க, மற்ற மூலக் கோப்புகளிலிருந்து வேறுபடும் கோப்பு பெயர் நீட்டிப்பை உள்ளிட்ட கோப்பை வழங்குவதை உறுதிப்படுத்திக் கொள்ளுங்கள்.)

source: Sphinx defines some default substitutions, see :ref:`default-substitutions`.
ta: SPHINX சில இயல்புநிலை மாற்றீடுகளை வரையறுக்கிறது, காண்க: குறிப்பு: `இயல்புநிலை-பதில்கள்`.

source: Comments
ta: கருத்துகள்

source: Every explicit markup block which isn't a valid markup construct (like the footnotes above) is regarded as a comment (:duref:`ref <comments>`). For example::
ta: செல்லுபடியாகும் மார்க்அப் கட்டமைப்பாக இல்லாத ஒவ்வொரு வெளிப்படையான மார்க்அப் தொகுதியும் (மேலே உள்ள அடிக்குறிப்புகள் போன்றவை) ஒரு கருத்தாகக் கருதப்படுகின்றன (: duref: `ref <centes>`). உதாரணத்திற்கு::

source: You can indent text after a comment start to form multiline comments::
ta: ஒரு கருத்தை உருவாக்கத் தொடங்கிய பிறகு நீங்கள் உரையை உள்துறை கருத்துகளை உருவாக்கலாம் ::

source: HTML Metadata
ta: HTML மெட்டாடேட்டா

source: The :dudir:`meta` directive allows specifying the HTML `metadata element`_ of a Sphinx documentation page. For example, the directive::
ta: தி: டுடிர்: `மெட்டா` டைரெக்டிவ் ஒரு ஸ்பிங்க்ஸ் ஆவணப்படுத்தல் பக்கத்தின் HTML` மெட்டாடேட்டா உறுப்பு`_ ஐக் குறிப்பிட அனுமதிக்கிறது. உதாரணமாக, உத்தரவு ::

source: will generate the following HTML output:
ta: பின்வரும் HTML வெளியீட்டை உருவாக்கும்:

source: Also, Sphinx will add the keywords as specified in the meta directive to the search index. Thereby, the ``lang`` attribute of the meta element is considered. For example, the directive::
ta: மேலும், SPHINX மெட்டா உத்தரவில் குறிப்பிடப்பட்டுள்ளபடி முக்கிய வார்த்தைகளை தேடல் குறியீட்டில் சேர்க்கும். இதன்மூலம், மெட்டா உறுப்பின் `` லாங்`` பண்புக்கூறு கருதப்படுகிறது. உதாரணமாக, உத்தரவு ::

source: adds the following words to the search indices of builds with different language configurations:
ta: வெவ்வேறு மொழி உள்ளமைவுகளுடன் கட்டடங்களின் தேடல் குறியீடுகளுக்கு பின்வரும் சொற்களைச் சேர்க்கிறது:

source: ``pleasefindthiskey``, ``pleasefindthiskeytoo`` to *English* builds;
ta: `` தயவுசெய்து `தயவுசெய்து,` `தயவுசெய்து * ஆங்கிலம் * கட்டமைக்கிறது;

source: ``bittediesenkeyfinden`` to *German* builds;
ta: `` Bititesenkeyfinden`` `` to * ஜெர்மன் * கட்டியெழுப்ப;

source: ``backup`` to builds in all languages.
ta: எல்லா மொழிகளிலும் கட்டமைக்க `` காப்புப்பிரதி``.

source: Source encoding
ta: மூல குறியாக்கம்

source: Sphinx supports source files that are encoded in UTF-8. This means that the full range of Unicode__ characters may be used directly in reStructuredText.
ta: UTF-8 இல் குறியிடப்பட்ட மூலக் கோப்புகளை சூரரிமாச்சிலை ஆதரிக்கிறது. அதாவது யூனிகோட்__ எழுத்துகளின் முழு வீச்சும் மறுகட்டமைக்கப்பட்ட உரையில் நேரடியாகப் பயன்படுத்தப்படலாம்.

source: Gotchas
ta: கோட்சாஸ்

source: There are some problems one commonly runs into while authoring reStructuredText documents:
ta: reStructuredText ஆவணங்களை எழுதும் போது பொதுவாக சில சிக்கல்கள் உள்ளன:

source: **Separation of inline markup:** As said above, inline markup spans must be separated from the surrounding text by non-word characters, you have to use a backslash-escaped space to get around that. See :duref:`the reference <substitution-definitions>` for the details.
ta: . காண்க: duref: `குறிப்பு <மாற்று-வரையறைகள்>` விவரங்களுக்கு.
