Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_changes--1_5_*.po
Languages: ta

source: Sphinx 1.5
ta: சூரரிமாச்சிலை 1.5

source: Release 1.5.6 (released May 15, 2017)
ta: வெளியீடு 1.5.6 (மே 15, 2017 அன்று வெளியிடப்பட்டது)

source: Bugs fixed
ta: பிழைகள் சரி செய்யப்பட்டன

source: #3614: Sphinx crashes with requests-2.5.0
ta: #3614: கோரிக்கைகளுடன் சூரரிமாச்சிலை செயலிழக்கிறது-2.5.0

source: #3618: autodoc crashes with tupled arguments
ta: #3618: ஆட்டோடாக் ட்புல்டு ஆர்குயூட்டுகளுடன் செயலிழக்கிறது

source: #3664: No space after the bullet in items of a latex list produced by Sphinx
ta: #3664: சூரரிமாச்சிலை தயாரித்த லேடெக்ச் பட்டியலின் உருப்படிகளில் புல்லட்டிற்குப் பிறகு இடமில்லை

source: #3657: EPUB builder crashes if a document starting with genindex exists
ta: #3657: genindex உடன் தொடங்கும் ஆவணம் இருந்தால் EPUB பில்டர் செயலிழக்கும்

source: #3588: No compact (p tag) html output in the i18n document build even when :confval:`html_compact_lists` is ``True``.
ta: #3588: ப18ல் ஆவண உருவாக்கத்தில் கச்சிதமான (p டேக்) உஉகுமொ வெளியீடு இல்லை :confval:`html_compact_lists` ``True``.

source: #3685: AttributeError when using 3rd party domains
ta: #3685: மூன்றாம் தரப்பு டொமைன்களைப் பயன்படுத்தும் போது பண்புப் பிழை

source: #3702: LaTeX writer styles figure legends with a hard-coded ``\small``
ta: #3702: கடின-குறியிடப்பட்ட ``\சிறிய`` மூலம் லாடெக்ச் ரைட்டர் ச்டைல்கள் லெசெண்டுகளை வடிவமைக்கின்றன

source: #3708: LaTeX writer allows irc scheme
ta: #3708: லாடெக்சு எழுத்தாளர் irc திட்டத்தை அனுமதிக்கிறது

source: #3717: Stop enforcing that favicon's must be .ico
ta: #3717: ஃபேவிகான் .ico ஆக இருக்க வேண்டும் என்று செயல்படுத்துவதை நிறுத்துங்கள்

source: #3731, #3732: Protect isenumclass predicate against non-class arguments
ta: #3731, #3732: isenumclass predicate ஐ அல்லாத வர்க்க வாதங்களுக்கு எதிராக பாதுகாக்கவும்

source: #3320: Warning about reference target not being found for container types
ta: #3320: கன்டெய்னர் வகைகளுக்கான குறிப்பு இலக்கு கண்டறியப்படவில்லை என்பது பற்றிய முன்னறிவிப்பு

source: Misspelled ARCHIVEPREFIX in Makefile for latex build repertory
ta: லேடெக்ஸ் பில்ட் ரெபர்ட்டரி செய்வதற்கான மேக்ஃபைலில் தவறாக அனுப்பப்பட்ட காப்பகப் பிரிக்ஸ்

source: Release 1.5.5 (released Apr 03, 2017)
ta: வெளியீடு 1.5.5 (ஏப்ரல் 03, 2017 வெளியிடப்பட்டது)

source: #3597: python domain raises UnboundLocalError if invalid name given
ta: #3597: தவறான பெயர் கொடுக்கப்பட்டால் பைதான் டொமைன் UnboundLocalError ஐ எழுப்புகிறது

source: #3599: Move to new MathJax CDN
ta: #3599: புதிய MathJax CDNக்கு நகர்த்தவும்

source: Release 1.5.4 (released Apr 02, 2017)
ta: வெளியீடு 1.5.4 (ஏப்ரல் 02, 2017 வெளியிடப்பட்டது)

source: Features added
ta: அம்சங்கள் சேர்க்கப்பட்டன

source: #3470: Make genindex support all kinds of letters, not only Latin ones
ta: #3470: லத்தீன் எழுத்துக்கள் மட்டுமின்றி, அனைத்து வகையான எழுத்துக்களுக்கும் genindex ஆதரவளிக்கவும்

source: #3445: setting ``'inputenc'`` key to ``\\usepackage[utf8x]{inputenc}`` leads to failed PDF build
ta: #3445: ``'inputenc'`` விசையை ``\\usepackage[utf8x]{inputenc}`` என அமைப்பது தோல்வியடைந்த PDF உருவாக்கத்திற்கு வழிவகுக்கிறது

source: EPUB file has duplicated ``nav.xhtml`` link in ``content.opf`` except first time build
ta: EPUB கோப்பு `` content.opf`` இல் `` nav.xhtml`` இணைப்பை நகலெடுத்துள்ளது.

source: #3488: objects.inv has broken when ``release`` or ``version`` contain return code
ta: #3488: ``வெளியீடு`` அல்லது ``பதிப்பு`` திரும்பக் குறியீட்டைக் கொண்டிருக்கும்போது objects.inv உடைந்துவிட்டது

source: #2073, #3443, #3490: gettext builder that writes pot files unless the content are same without creation date. Thanks to Yoshiki Shibukawa.
ta: #2073, #3443, #3490: உருவாக்கிய தேதி இல்லாமல் உள்ளடக்கம் ஒரே மாதிரியாக இல்லாவிட்டால் பாட் கோப்புகளை எழுதும் உரைபெறு builder. யோசிகி சிபுகாவாவுக்கு நன்றி.

source: #3487: intersphinx: failed to refer options
ta: #3487: intersphinx: விருப்பங்களைக் குறிப்பிடுவதில் தோல்வி

source: #3496: latex longtable's last column may be much wider than its contents
ta: #3496: லேடெக்ச் லாங்டேபிளின் கடைசி நெடுவரிசை அதன் உள்ளடக்கங்களை விட மிகவும் அகலமாக இருக்கலாம்

source: #3507: wrong quotes in latex output for productionlist directive
ta: #3507: உற்பத்திப் பட்டியல் உத்தரவுக்கான லேடெக்ச் வெளியீட்டில் தவறான மேற்கோள்கள்

source: #3533: Moving from Sphinx 1.3.1 to 1.5.3 breaks LaTeX compilation of links rendered as code
ta: #3533: சூரரிமாச்சிலை 1.3.1 இலிருந்து 1.5.3க்கு நகர்வது குறியீடாக வழங்கப்பட்ட இணைப்புகளின் லாடெக்சு தொகுப்பை உடைக்கிறது

source: #2665, #2607: Link names in C++ docfields, and make it possible for other domains.
ta: #2665, #2607: C++ டாக்ஃபீல்டுகளில் பெயர்களை இணைத்து, மற்ற டொமைன்களுக்கு சாத்தியமாக்குங்கள்.

source: #3542: C++, fix parsing error of non-type template argument with template.
ta: #3542: C++, வகை அல்லாத டெம்ப்ளேட் வாதத்தின் பாகுபடுத்தும் பிழையை டெம்ப்ளேட்டுடன் சரிசெய்யவும்.

source: #3065, #3520: python domain fails to recognize nested class
ta: #3065, #3520: பைதான் டொமைன் உள்ளமை வகுப்பை அங்கீகரிக்கத் தவறியது

source: #3575: Problems with pdflatex in a Turkish document built with Sphinx has reappeared (refs #2997, #2397)
ta: #3575: ச்பிங்க்சுடன் கட்டப்பட்ட துருக்கிய ஆவணத்தில் pdflatex இல் உள்ள சிக்கல்கள் மீண்டும் தோன்றியுள்ளன (குறிப்புகள் #2997, #2397)

source: #3577: Fix intersphinx debug tool
ta: #3577: intersphinx பிழைத்திருத்த கருவியை சரிசெய்யவும்

source: A LaTeX command such as ``\\large`` inserted in the title items of :confval:`latex_documents` causes failed PDF build (refs #3551, #3567)
ta: :confval:`latex_documents` இன் தலைப்பு உருப்படிகளில் செருகப்பட்ட ``\\large`` போன்ற லாடெக்சு கட்டளை தோல்வியடைந்த PDF உருவாக்கத்தை ஏற்படுத்துகிறது (குறிப்புகள் #3551, #3567)

source: Release 1.5.3 (released Feb 26, 2017)
ta: வெளியீடு 1.5.3 (பிப்ரவரி 26, 2017 இல் வெளியிடப்பட்டது)

source: Support requests-2.0.0 (experimental) (refs: #3367)
ta: உதவி கோரிக்கைகள்-2.0.0 (பரிசோதனை) (குறிப்புகள்: #3367)

source: (latex) PDF page margin dimensions may be customized (refs: #3387)
ta: (லேடெக்ச்) PDF பக்க விளிம்பு பரிமாணங்கள் தனிப்பயனாக்கப்படலாம் (குறிப்புகள்: #3387)

source: ``literalinclude`` directive allows combination of ``:pyobject:`` and ``:lines:`` options (refs: #3416)
ta: ``literlinclude`` கட்டளையானது ``:pyobject:`` மற்றும் ``:lines:`` விருப்பங்களைச் சேர்க்க அனுமதிக்கிறது (குறிப்புகள்: #3416)

source: #3400: make-mode doesn't use subprocess on building docs
ta: #3400: மேக்-மோட் டாக்சை உருவாக்குவதில் துணைச் செயல்முறையைப் பயன்படுத்தாது

source: #3370: the caption of code-block is not picked up for translation
ta: #3370: கோட்-பிளாக்கின் தலைப்பு மொழிபெயர்ப்புக்காக எடுக்கப்படவில்லை

source: LaTeX: :confval:`release` is not escaped (refs: #3362)
ta: LaTeX: :confval:`release` தப்பிக்கவில்லை (குறிப்புகள்: #3362)

source: #3364: sphinx-quickstart prompts overflow on Console with 80 chars width
ta: #3364: ச்பிங்க்ச்-குயிக்ச்டார்ட் 80 எழுத்துகள் அகலத்துடன் கன்சோலில் நிரம்பி வழிகிறது

source: since 1.5, PDF's TOC and bookmarks lack an entry for general Index (refs: #3383)
ta: 1.5 முதல், PDF இன் TOC மற்றும் புக்மார்க்குகளில் பொது குறியீட்டிற்கான நுழைவு இல்லை (குறிப்புகள்: #3383)

source: #3392: ``'releasename'`` in :confval:`latex_elements` is not working
ta: #3392: ``'releasename'`` in :confval:`latex_elements` வேலை செய்யவில்லை

source: #3356: Page layout for Japanese ``'manual'`` docclass has a shorter text area
ta: #3356: சப்பானிய ````கையேடு''`` டாக்ளாசுக்கான பக்க தளவமைப்பு குறுகிய உரைப் பகுதியைக் கொண்டுள்ளது

source: #3394: When ``'pointsize'`` is not ``10pt``, Japanese ``'manual'`` document gets wrong PDF page dimensions
ta: #3394: ``'புள்ளி அளவு'`` ``10pt`` இல்லை என்றால், சப்பானிய ```கையேடு'`` ஆவணம் தவறான PDF பக்க பரிமாணங்களைப் பெறுகிறது

source: #3399: quickstart: conf.py was not overwritten by template
ta: #3399: விரைவு தொடக்கம்: conf.py டெம்ப்ளேட்டால் மேலெழுதப்படவில்லை

source: #3366: option directive does not allow punctuations
ta: #3366: விருப்பங்கள் கட்டளை நிறுத்தற்குறிகளை அனுமதிக்காது

source: #3410: return code in :confval:`release` breaks html search
ta: #3410: :confval:`release` இல் குறியீட்டை திரும்பப் பெறுகிறது, உஉகுமொ தேடலை உடைக்கிறது

source: #3427: autodoc: memory addresses are not stripped on Windows
ta: #3427: autodoc: சாளரங்களில் நினைவக முகவரிகள் அகற்றப்படவில்லை

source: #3428: xetex build tests fail due to fontspec v2.6 defining ``\strong``
ta: #3428: fontspec v2.6 வரையறுக்கும் ``\strong`` காரணமாக xetex உருவாக்க சோதனைகள் தோல்வியடைந்தன.

source: #3349: Result of ``IndexBuilder.load()`` is broken
ta: #3349: ``IndexBuilder.load()`` இன் முடிவு முறிந்தது

source: #3450: &nbsp is appeared in EPUB docs
ta: #3450: EPUB டாக்சில் &nbsp தோன்றியது

source: #3418: Search button is misaligned in nature and pyramid theme
ta: #3418: தேடல் பொத்தான் இயற்கையிலும் பிரமிட் தீமிலும் தவறாக வடிவமைக்கப்பட்டுள்ளது

source: #3421: Could not translate a caption of tables
ta: #3421: அட்டவணைகளின் தலைப்பை மொழிபெயர்க்க முடியவில்லை

source: #3552: linkcheck raises UnboundLocalError
ta: #3552: இணைப்புச் சரிபார்ப்பு UnboundLocalError ஐ எழுப்புகிறது

source: Release 1.5.2 (released Jan 22, 2017)
ta: வெளியீடு 1.5.2 (ஜனவரி 22, 2017 இல் வெளியிடப்பட்டது)

source: Incompatible changes
ta: பொருந்தாத மாற்றங்கள்

source: Dependency requirement updates: requests 2.4.0 or above (refs: #3268, #3310)
ta: சார்பு தேவை புதுப்பிப்புகள்: கோரிக்கைகள் 2.4.0 அல்லது அதற்கு மேற்பட்டவை (குறிப்புகள்: #3268, #3310)

source: #3241: emit latex warning if buggy titlesec (ref #3210)
ta: #3241: தரமற்ற தலைப்பு நொடி என்றால் லேடெக்ச் எச்சரிக்கையை வெளியிடவும் (குறிப்பு #3210)

source: #3194: Refer the $MAKE environment variable to determine ``make`` command
ta: #3194: ``make`` கட்டளையைத் தீர்மானிக்க $MAKE சூழல் மாறியைப் பார்க்கவும்

source: Emit warning for nested numbered toctrees (refs: #3142)
ta: உள்ளமைக்கப்பட்ட எண்ணிடப்பட்ட டோக்ட்ரீகளுக்கான எச்சரிக்கையை வெளியிடு (குறிப்புகள்: #3142)

source: #978: ``intersphinx_mapping`` also allows a list as a parameter
ta: #978: ``Intersphinx_mapping`` ஒரு அளவுருவாக பட்டியலை அனுமதிக்கிறது

source: #3340: (LaTeX) long lines in :dudir:`parsed-literal` are wrapped like in :rst:dir:`code-block`, inline math and footnotes are fully functional.
ta: #3340: (LaTeX) :dudir:`parsed-literal` இல் உள்ள நீண்ட கோடுகள் :rst:dir:`code-block`, இன்லைன் கணிதம் மற்றும் அடிக்குறிப்புகள் முழுமையாக செயல்படும்.

source: #3246: xapian search adapter crashes
ta: #3246: xapian தேடல் அடாப்டர் செயலிழந்தது

source: #3253: In Py2 environment, building another locale with a non-captioned toctree produces ``None`` captions
ta: #3253: Py2 சூழலில், தலைப்பு இல்லாத டோக்ட்ரீயுடன் மற்றொரு இடத்தை உருவாக்குவது ``ஒன்றுமில்லை`` தலைப்புகளை உருவாக்குகிறது

source: #185: References to section title including raw node has broken
ta: #185: raw கணு உட்பட பிரிவு தலைப்புக்கான குறிப்புகள் உடைந்துள்ளன

source: #3255: In Py3.4 environment, autodoc doesn't support documentation for attributes of Enum class correctly.
ta: #3255: Py3.4 சூழலில், Enum வகுப்பின் பண்புக்கூறுகளுக்கான ஆவணங்களை ஆட்டோடாக் சரியாக ஆதரிக்காது.

source: #3261: ``latex_use_parts`` makes Sphinx crash
ta: #3261: ``லேடெக்ச்_யூச்_பார்ட்ச்`` ச்பிங்க்சை செயலிழக்கச் செய்கிறது

source: The warning type ``misc.highlighting_failure`` does not work
ta: எச்சரிக்கை வகை `` misc.highlighting_failure`` வேலை செய்யாது

source: #3294: ``add_latex_package()`` make crashes non-LaTeX builders
ta: #3294: ``சேர்_லேடெக்ச்_பேக்கேச்()`` க்ராச்களை லேடெக்ச் அல்லாத பில்டர்களை உருவாக்குங்கள்

source: The caption of table are rendered as invalid HTML (refs: #3287)
ta: அட்டவணையின் தலைப்பு தவறான உஉகுமொ ஆக வழங்கப்படுகிறது (குறிப்புகள்: #3287)

source: #3268: Sphinx crashes with requests package from Debian jessie
ta: #3268: டெபியன் செச்சியின் கோரிக்கைகள் தொகுப்புடன் சூரரிமாச்சிலை செயலிழந்தது

source: #3284: Sphinx crashes on parallel build with an extension which raises unserializable exception
ta: #3284: சூரரிமாச்சிலை ஒரு நீட்டிப்புடன் இணையான கட்டமைப்பில் செயலிழக்கச் செய்கிறது, இது வரிசைப்படுத்த முடியாத விதிவிலக்கை எழுப்புகிறது

source: #3315: Bibliography crashes on latex build with docclass 'memoir'
ta: #3315: டாக்ளாச் 'நினைவகத்துடன்' லேடெக்ச் கட்டமைப்பில் நூலியல் செயலிழந்தது

source: #3328: Could not refer rubric implicitly
ta: #3328: ரூபிரை மறைமுகமாகக் குறிப்பிட முடியவில்லை

source: #3329: emit warnings if po file is invalid and can't read it. Also writing mo
ta: #3329: போ கோப்பு தவறானது மற்றும் அதைப் படிக்க முடியவில்லை என்றால் எச்சரிக்கைகளை வெளியிடுங்கள். மேலும் எழுதுவது மோ

source: #3337: Ugly rendering of definition list term's classifier
ta: #3337: வரையறை பட்டியல் காலத்தின் வகைப்படுத்தியின் அசிங்கமான வழங்குதல்

source: #3335: gettext does not extract field_name of a field in a field_list
ta: #3335: உரைபெறு ஆனது புலத்தின்_பட்டியலிலிருந்து புலத்தின்_பெயரைப் பிரித்தெடுக்காது

source: #2952: C++, fix refs to operator() functions.
ta: #2952: C++, ஆபரேட்டர்() செயல்பாடுகளை சரிசெய்தல்.

source: Fix Unicode super- and subscript digits in :rst:dir:`code-block` and parsed-literal LaTeX output (ref #3342)
ta: யூனிகோட் சூப்பர் மற்றும் சப்ச்கிரிப்ட் இலக்கங்களை :rst:dir:`code-block` மற்றும் பாகுபடுத்தப்பட்ட-லிட்டரல் லாடெக்சு வெளியீடு (ref #3342)

source: LaTeX writer: leave ``"`` character inside parsed-literal as is (ref #3341)
ta: லாடெக்சு எழுத்தாளர்: ``"`` எழுத்தை பாகுபடுத்தப்பட்ட-சொற்களுக்குள் அப்படியே விடவும் (குறிப்பு #3341)

source: #3234: intersphinx failed for encoded inventories
ta: #3234: குறியிடப்பட்ட சரக்குகளுக்கு intersphinx தோல்வியடைந்தது

source: #3158: too much space after captions in PDF output
ta: #3158: PDF வெளியீட்டில் தலைப்புகளுக்குப் பிறகு அதிக இடம்

source: #3317: An URL in parsed-literal contents gets wrongly rendered in PDF if with hyphen
ta: #3317: பாகுபடுத்தப்பட்ட-உள்ளடக்கத்தில் உள்ள URL, ஐபனுடன் இருந்தால், PDF இல் தவறாக வழங்குதல் செய்யப்படும்.

source: LaTeX crash if the filename of an image inserted in parsed-literal via a substitution contains an hyphen (ref #3340)
ta: பதிலீடு வழியாக பாகுபடுத்தப்பட்ட மொழியில் செருகப்பட்ட படத்தின் கோப்புப் பெயரில் ஐபன் இருந்தால் லாடெக்சு செயலிழக்கும் (குறிப்பு #3340)

source: LaTeX rendering of inserted footnotes in parsed-literal is wrong (ref #3340)
ta: பாகுபடுத்தப்பட்ட-மொழியில் செருகப்பட்ட அடிக்குறிப்புகளின் லாடெக்சு வழங்குதல் தவறானது (குறிப்பு #3340)

source: Inline math in parsed-literal is not rendered well by LaTeX (ref #3340)
ta: பாகுபடுத்தப்பட்ட-மொழியில் உள்ள இன்லைன் கணிதம் லாடெக்சு ஆல் சரியாக வழங்கப்படவில்லை (குறிப்பு #3340)

source: #3308: Parsed-literals don't wrap very long lines with pdf builder (ref #3340)
ta: #3308: பாகுபடுத்தப்பட்ட எழுத்துக்கள் pdf பில்டருடன் மிக நீண்ட வரிகளை மடிக்காது (குறிப்பு #3340)

source: #3295: Could not import extension sphinx.builders.linkcheck
ta: #3295: sphinx.builders.linkcheck நீட்டிப்பை இறக்குமதி செய்ய முடியவில்லை

source: #3285: autosummary: asterisks are escaped twice
ta: #3285: தன்னியக்க சுருக்கம்: நட்சத்திரக் குறியீடுகள் இரண்டு முறை தப்பிக்கப்படுகின்றன

source: LaTeX, pass dvipdfm option to geometry package for Japanese documents (ref #3363)
ta: LaTeX, சப்பானிய ஆவணங்களுக்கான வடிவியல் தொகுப்பிற்கு dvipdfm விருப்பத்தை அனுப்பவும் (குறிப்பு #3363)

source: Fix parselinenos() could not parse left half open range (cf. "-4")
ta: பார்சலினெனோஸை சரிசெய்யவும் () இடது அரை திறந்த வரம்பை (cf. "-4") அலச முடியவில்லை

source: Release 1.5.1 (released Dec 13, 2016)
ta: வெளியீடு 1.5.1 (டிசம்பர் 13, 2016 வெளியிடப்பட்டது)

source: #3214: Allow to suppress "unknown mimetype" warnings from epub builder using :confval:`suppress_warnings`.
ta: #3214: :confval:`suppress_warnings` ஐப் பயன்படுத்தி எபப் பில்டரிடமிருந்து "தெரியாத மைம் வகை" எச்சரிக்கைகளை அடக்க அனுமதிக்கவும்.

source: #3195: Can not build in parallel
ta: #3195: இணையாக உருவாக்க முடியாது

source: #3198: AttributeError is raised when toctree has 'self'
ta: #3198: டோக்ட்ரீ 'சுயமாக' இருக்கும்போது பண்புப் பிழை எழுப்பப்படுகிறது

source: #3211: Remove untranslated Sphinx locale catalogs (it was covered by untranslated it_IT)
ta: #3211: மொழிபெயர்க்கப்படாத சூரரிமாச்சிலை லோகேல் பட்டியல்களை அகற்று (இது மொழிபெயர்க்கப்படாத it_IT மூலம் மூடப்பட்டது)

source: #3212: HTML Builders crashes with Docutils 0.13
ta: #3212: உஉகுமொ பில்டர்ச் ஆவணங்கள் 0.13 உடன் செயலிழக்கிறது

source: #3207: more latex problems with references inside parsed-literal directive (``\DUrole``)
ta: #3207: பாகுபடுத்தப்பட்ட-லிட்டரல் டைரக்டிவ் (``\DUrole``) உள்ளே உள்ள குறிப்புகளில் அதிக லேடெக்ச் சிக்கல்கள்

source: #3205: sphinx.util.requests crashes with old pyOpenSSL (< 0.14)
ta: #3205: sphinx.util.requests பழைய pyOpenSSL உடன் செயலிழக்கச் செய்கிறது (< 0.14)

source: #3220: KeyError when having a duplicate citation
ta: #3220: நகல் மேற்கோள் இருக்கும்போது முக்கிய பிழை

source: #3200: LaTeX: xref inside desc_name not allowed
ta: #3200: LaTeX: desc_name உள்ளே xref அனுமதிக்கப்படவில்லை

source: #3228: ``build_sphinx`` command crashes when missing dependency
ta: #3228: ``பில்ட்_ச்பிங்க்ச்`` சார்புநிலையை இழக்கும்போது கட்டளை செயலிழக்கிறது

source: #2469: Ignore updates of catalog files for gettext builder. Thanks to Hiroshi Ohkubo.
ta: #2469: உரைபெறு பில்டருக்கான பட்டியல் கோப்புகளின் புதுப்பிப்புகளைப் புறக்கணிக்கவும். இரோசி ஓகுபோவுக்கு நன்றி.

source: #3183: Randomized jump box order in generated index page.
ta: #3183: உருவாக்கப்பட்ட குறியீட்டுப் பக்கத்தில் சீரற்ற சம்ப் பாக்ச் வரிசை.

source: Release 1.5 (released Dec 5, 2016)
ta: வெளியீடு 1.5 (டிசம்பர் 5, 2016 வெளியிடப்பட்டது)

source: latex, package fancybox is not any longer a dependency of sphinx.sty
ta: லேடெக்ஸ், தொகுப்பு ஃபேன்ஸி பாக்ஸ் இனி sphinx.sty இன் சார்பு இல்லை

source: Use ``'locales'`` as a default value of ``locale_dirs``
ta: ``locale_dirs`` இன் இயல்புநிலை மதிப்பாக ``'locales'`` ஐப் பயன்படுத்தவும்

source: latex, package ifthen is not any longer a dependency of sphinx.sty
ta: லேடெக்ஸ், தொகுப்பு ifthen இனி sphinx.sty இன் சார்பு இல்லை

source: latex, style file does not modify fancyvrb's Verbatim (also available as OriginalVerbatim) but uses sphinxVerbatim for name of custom wrapper.
ta: லேடெக்ஸ், ஸ்டைல் கோப்பு ஃபேன்ஸ்விஆர்பியின் சொற்களஞ்சியத்தை மாற்றியமைக்காது (அசல் பெர்பாடிமாகவும் கிடைக்கிறது) ஆனால் தனிப்பயன் ரேப்பரின் பெயருக்கு ஸ்பின் எக்ஸ்வெர்பாடிமைப் பயன்படுத்துகிறது.

source: latex, package newfloat is not used (and not included) anymore (ref #2660; it was used since 1.3.4 and shipped with Sphinx since 1.4).
ta: லேடெக்ச், தொகுப்பு நியூஃப்ளோட் இனி பயன்படுத்தப்படாது (மற்றும் சேர்க்கப்படவில்லை) (குறிப்பு #2660; இது 1.3.4 முதல் பயன்படுத்தப்பட்டது மற்றும் 1.4 முதல் ச்பிங்க்சுடன் அனுப்பப்பட்டது).

source: latex, literal blocks in tables do not use OriginalVerbatim but sphinxVerbatimintable which handles captions and wraps lines (ref #2704).
ta: லேடெக்ச், அட்டவணையில் உள்ள எழுத்துத் தொகுதிகள் அசல் வெர்பேட்டிமைப் பயன்படுத்துவதில்லை, ஆனால் சூரரிமாச்சிலை வெர்பேடிம் மிண்டபிள் இது தலைப்புகள் மற்றும் வரிகளை மறைக்கும் (குறிப்பு #2704).

source: latex, replace ``pt`` by TeX equivalent ``bp`` if found in ``width`` or ``height`` attribute of an image.
ta: லேடெக்ஸ், `` அகலம்` அல்லது `` உயரம்`` ஒரு படத்தின் பண்புக்கூறில் காணப்பட்டால், `` பி.டி`` ஐ டெக்ஸ் சமமான `` பிபி`` ஆல் மாற்றவும்.

source: latex, if ``width`` or ``height`` attribute of an image is given with no unit, use ``px`` rather than ignore it.
ta: லேடெக்ஸ், ஒரு படத்தின் `` அகலம்` அல்லது `` உயரம்`` எந்த அலகு இல்லாமல் கொடுக்கப்பட்டால், அதைப் புறக்கணிப்பதை விட `` px`` ஐப் பயன்படுத்தவும்.

source: latex: Separate stylesheets of pygments to independent .sty file
ta: லேடெக்ஸ்: சுயாதீனமான .ஸ்டை கோப்பிற்கு பிக்மென்ட்களின் தனி நடைதாள்

source: #2454: The filename of sourcelink is now changed. The value of ``html_sourcelink_suffix`` will be appended to the original filename (like ``index.rst.txt``).
ta: #2454: சோர்ச்லிங்கின் கோப்பு பெயர் இப்போது மாற்றப்பட்டுள்ளது. ``html_sourcelink_suffix`` இன் மதிப்பு அசல் கோப்புப் பெயருடன் இணைக்கப்படும் (``index.rst.txt`` போன்றவை).

source: ``sphinx.util.copy_static_entry()`` is now deprecated. Use ``sphinx.util.fileutil.copy_asset()`` instead.
ta: `` sphinx.util.copy_static_entry () `` இப்போது நீக்கப்பட்டது. அதற்கு பதிலாக `` sphinx.util.fileutil.copy_asset () `` ஐப் பயன்படுத்தவும்.

source: ``sphinx.util.osutil.filecopy()`` skips copying if the file has not been changed (ref: #2510, #2753)
ta: ``sphinx.util.osutil.filecopy()`` கோப்பு மாற்றப்படவில்லை என்றால் நகலெடுப்பதைத் தவிர்க்கும் (குறிப்பு: #2510, #2753)

source: Internet Explorer 6-8, Opera 12.1x or Safari 5.1+ support is dropped because jQuery version is updated from 1.11.0 to 3.1.0 (ref: #2634, #2773)
ta: Internet Explorer 6-8, Opera 12.1x அல்லது Safari 5.1+ உதவி கைவிடப்பட்டது, ஏனெனில் சேவினாவல் பதிப்பு 1.11.0 இலிருந்து 3.1.0 க்கு புதுப்பிக்கப்பட்டது (குறிப்பு: #2634, #2773)

source: QtHelpBuilder doesn't generate search page (ref: #2352)
ta: QtHelpBuilder தேடல் பக்கத்தை உருவாக்கவில்லை (குறிப்பு: #2352)

source: QtHelpBuilder uses ``nonav`` theme instead of default one to improve readability.
ta: Qthelpbuilder வாசிப்புத்திறனை மேம்படுத்த இயல்புநிலை ஒன்றிற்கு பதிலாக `` nonav`` கருப்பொருளைப் பயன்படுத்துகிறது.

source: latex: To provide good default settings to Japanese documents, Sphinx uses ``jreport`` and ``jsbook`` as docclass if :confval:`language` is ``ja``.
ta: லேடெக்ஸ்: ஜப்பானிய ஆவணங்களுக்கு நல்ல இயல்புநிலை அமைப்புகளை வழங்க, ஸ்பின்க்ஸ் `` JREPORT` மற்றும் `` JSbook`` ஐ டாக்ளாஸாக பயன்படுத்துகிறது: confval: `மொழி` என்பது` `ja``.

source: ``sphinx-quickstart`` now allows a project version is empty
ta: `` ஸ்பின்க்ஸ்-க்ளிக்ஸ்டார்ட்`` இப்போது ஒரு திட்ட பதிப்பு காலியாக உள்ளது

source: Fix :download: role on epub/qthelp builder. They ignore the role because they don't support it.
ta: சரி: பதிவிறக்கம்: EPUB/Qthelp பில்டரில் பங்கு. அவர்கள் அந்த பாத்திரத்தை புறக்கணிக்கிறார்கள், ஏனெனில் அவர்கள் அதை ஆதரிக்கவில்லை.

source: ``sphinx.ext.viewcode`` doesn't work on epub building by default. ``viewcode_enable_epub`` option
ta: `` sphinx.ext.viewcode`` இயல்புநிலையாக எபப் கட்டிடத்தில் வேலை செய்யாது. `` ViewCode_enable_epub`` விருப்பம்

source: ``sphinx.ext.viewcode`` disabled on singlehtml builder.
ta: `` sphinx.ext.viewcode`` ஒற்றைஹெச்.டி.எம்.எல் பில்டரில் முடக்கப்பட்டுள்ளது.

source: Use make-mode of ``sphinx-quickstart`` by default. To disable this, use ``-M`` option
ta: இயல்பாக `` ஸ்பின்க்ஸ்-க்யூக்ஸ்டார்ட்`` இன் மேக்-பயன்முறையைப் பயன்படுத்தவும். இதை முடக்க, `` -m`` விருப்பத்தைப் பயன்படுத்தவும்

source: Fix ``genindex.html``, Sphinx's document template, link address to itself to satisfy xhtml standard.
ta: Sphinx இன் ஆவண வார்ப்புருவான `` `ஜெனின்டெக்ஸ்.ஹெச்.டி.எம்.எல்`` ஐ சரிசெய்யவும், எக்ஸ்ஹெச்.டி.எம்.எல் தரத்தை பூர்த்தி செய்ய தன்னை இணைக்கவும்.

source: Use epub3 builder by default. And the old epub builder is renamed to epub2.
ta: முன்னிருப்பாக EPUB3 பில்டரைப் பயன்படுத்தவும். பழைய எபப் பில்டர் EPUB2 க்கு மறுபெயரிடப்படுகிறது.

source: Fix ``epub`` and ``epub3`` builders that contained links to ``genindex`` even if ``epub_use_index = False``.
ta: `` Epub_use_index = false`` என்றாலும் `` ஜெனின்டெக்ஸ்` `உடன் இணைப்புகளைக் கொண்ட` `எபப்`` மற்றும்` `எபப் 3`` பில்டர்களை சரிசெய்யவும்.

source: ``html_translator_class`` is now deprecated. Use :meth:`~sphinx.application.Sphinx.set_translator` API instead.
ta: `` html_translator_class`` இப்போது நீக்கப்பட்டது. பயன்படுத்தவும்: meth: `~ sphinx.application.sphinx.set_translator` api.

source: Drop python 2.6 and 3.3 support
ta: பைதான் 2.6 மற்றும் 3.3 ஆதரவை கைவிடவும்

source: Drop epub3 builder's ``epub3_page_progression_direction`` option (use ``epub3_writing_mode``).
ta: EPUB3 பில்டரின் `` EPUB3_PAGE_PROGRESSION_DIRECTION` விருப்பத்தை விடுங்கள் (`` EPUB3_WRITING_MODE`` ஐப் பயன்படுத்தவும்).

source: #2877: Rename ``latex_elements['footer']`` to ``latex_elements['atendofbody']``
ta: #2877: ```latex_elements['footer']`` என்பதை ``latex_elements['atendofbody']`` என மறுபெயரிடவும்

source: #2983: Rename ``epub3_description`` and ``epub3_contributor`` to ``epub_description`` and ``epub_contributor``.
ta: #2983: ``epub3_description`` மற்றும் ``epub3_contributor`` என்பதை ``epub_description`` மற்றும் ``epub_contributor`` என மறுபெயரிடவும்.

source: Remove themes/basic/defindex.html; no longer used
ta: கருப்பொருள்களை அகற்று/அடிப்படை/diffindex.html; இனி பயன்படுத்தப்படவில்லை
