Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_extdev--appapi_*.po
Languages: ta

source: Application API
ta: பயன்பாட்டு API

source: Each Sphinx extension is a Python module with at least a :func:`setup` function. This function is called at initialization time with one argument, the application object representing the Sphinx process.
ta: ஒவ்வொரு ஸ்பிங்க்ஸ் நீட்டிப்பும் குறைந்தபட்சம் ஒரு பைதான் தொகுதி ஆகும்: func: `அமைவு` செயல்பாடு. இந்த செயல்பாடு ஒரு வாதத்துடன் துவக்க நேரத்தில் அழைக்கப்படுகிறது, இது SPHINX செயல்முறையைக் குறிக்கும் பயன்பாட்டு பொருள்.

source: This application object has the public API described in the following.
ta: இந்த பயன்பாட்டு பொருள் பின்வருவனவற்றில் விவரிக்கப்பட்டுள்ள பொது ஏபிஐ உள்ளது.

source: Extension setup
ta: நீட்டிப்பு அமைப்பு

source: These methods are usually called in an extension's ``setup()`` function.
ta: இந்த முறைகள் வழக்கமாக நீட்டிப்பின் `` அமைவு () `` செயல்பாட்டில் அழைக்கப்படுகின்றன.

source: Examples of using the Sphinx extension API can be seen in the :mod:`sphinx.ext` package.
ta: SPHINX நீட்டிப்பு API ஐப் பயன்படுத்துவதற்கான எடுத்துக்காட்டுகளை: mod: `sphinx.ext` தொகுப்பில் காணலாம்.

source: Import and setup a Sphinx extension module.
ta: ஸ்பிங்க்ஸ் நீட்டிப்பு தொகுதியை இறக்குமதி செய்து அமைக்கவும்.

source: Load the extension given by the module *name*. Use this if your extension needs the features provided by another extension. No-op if called twice.
ta: தொகுதி *பெயர் *வழங்கிய நீட்டிப்பை ஏற்றவும். உங்கள் நீட்டிப்புக்கு மற்றொரு நீட்டிப்பு வழங்கப்பட்ட அம்சங்கள் தேவைப்பட்டால் இதைப் பயன்படுத்தவும். இரண்டு முறை அழைக்கப்பட்டால் இல்லை.

source: Check the Sphinx version if requested.
ta: கோரப்பட்டால் ஸ்பிங்க்ஸ் பதிப்பை சரிபார்க்கவும்.

source: Compare *version* with the version of the running Sphinx, and abort the build when it is too old.
ta: இயங்கும் ஸ்பிங்க்ஸின் பதிப்போடு * பதிப்பு * ஐ ஒப்பிட்டு, பழையதாக இருக்கும்போது கட்டியெழுப்பவும்.

source: Parameters
ta: அளவுருக்கள்

source: The required version in the form of ``major.minor`` or ``(major, minor)``.
ta: `` மேஜர்.மினோர்`` அல்லது `` (மேஜர், மைனர்) `` வடிவத்தில் தேவையான பதிப்பு.

source: Type of *version* now allows ``(major, minor)`` form.
ta: * பதிப்பு * வகை இப்போது `` (பெரிய, சிறிய) `` படிவத்தை அனுமதிக்கிறது.

source: Register *callback* to be called when *event* is emitted.
ta: * நிகழ்வு * உமிழப்படும் போது அழைக்கப்பட வேண்டிய * கால்பேக் * ஐ பதிவு செய்யுங்கள்.

source: For details on available core events and the arguments of callback functions, please see :ref:`events`.
ta: கிடைக்கக்கூடிய முக்கிய நிகழ்வுகள் மற்றும் அழைப்பு செயல்பாடுகளின் வாதங்கள் பற்றிய விவரங்களுக்கு, தயவுசெய்து பார்க்கவும்: குறிப்பு: `நிகழ்வுகள்`.

source: The name of target event
ta: இலக்கு நிகழ்வின் பெயர்

source: Callback function for the event
ta: நிகழ்விற்கான திரும்பப்பெறுதல் செயல்பாடு

source: The priority of the callback. The callbacks will be invoked in order of *priority* (ascending).
ta: அழைப்பின் முன்னுரிமை. கால்பேக்குகள் * முன்னுரிமை * (ஏறுதல்) வரிசையில் செயல்படுத்தப்படும்.

source: Returns
ta: வருமானம்

source: A listener ID. It can be used for :meth:`disconnect`.
ta: ஒரு கேட்பவர் ஐடி. இதைப் பயன்படுத்தலாம்: மெத்: `துண்டிக்கவும்`.

source: Support *priority*
ta: ஆதரவு *முன்னுரிமை *

source: Unregister callback by *listener_id*.
ta: *கேட்போர்_ஐடி *மூலம் பதிவு செய்யவும்.

source: A listener_id that :meth:`connect` returns
ta: ஒரு கேட்பவர்_ஐடி: மெத்: `இணைக்கவும்` திரும்பும்

source: Register a new builder.
ta: புதிய பில்டரை பதிவு செய்யுங்கள்.

source: A builder class
ta: ஒரு பில்டர் வகுப்பு

source: If true, install the builder forcedly even if another builder is already installed as the same name
ta: உண்மை என்றால், மற்றொரு பில்டர் ஏற்கனவே அதே பெயராக நிறுவப்பட்டிருந்தாலும் பில்டரை கட்டாயமாக நிறுவவும்

source: Add *override* keyword.
ta: * மேலெழுத * முக்கிய சொல்லைச் சேர்க்கவும்.

source: Register a configuration value.
ta: உள்ளமைவு மதிப்பைப் பதிவுசெய்க.

source: This is necessary for Sphinx to recognize new values and set default values accordingly.
ta: SPHINX க்கு புதிய மதிப்புகளை அடையாளம் காணவும், அதற்கேற்ப இயல்புநிலை மதிப்புகளை அமைக்கவும் இது அவசியம்.

source: The name of the configuration value. It is recommended to be prefixed with the extension name (ex. ``html_logo``, ``epub_title``)
ta: உள்ளமைவு மதிப்பின் பெயர். நீட்டிப்பு பெயருடன் முன்னொட்டு (எ.கா. `html_logo``,` `epub_title``)

source: The default value of the configuration.
ta: உள்ளமைவின் இயல்புநிலை மதிப்பு.

source: The condition of rebuild. It must be one of those values: * ``'env'`` if a change in the setting only takes effect when a document is parsed -- this means that the whole environment must be rebuilt. * ``'html'`` if a change in the setting needs a full rebuild of HTML documents. * ``''`` if a change in the setting will not need any special rebuild.
ta: மறுகட்டமைப்பின் நிலை. அந்த மதிப்புகளில் ஒன்றாக இருக்க வேண்டும்: * `` '' '' '' '' ஒரு ஆவணம் பாகுபடுத்தப்படும்போது மட்டுமே அமைப்பில் மாற்றம் நடைமுறைக்கு வந்தால் - இதன் பொருள் முழு சூழலும் மீண்டும் கட்டப்பட வேண்டும். * `` 'html'``` அமைப்பில் ஒரு மாற்றத்திற்கு HTML ஆவணங்களை முழுமையாக மீண்டும் கட்டியெழுப்ப வேண்டும் என்றால். * `` '' `` அமைப்பில் மாற்றத்திற்கு எந்த சிறப்பு மறுகட்டமைப்பும் தேவையில்லை என்றால்.

source: The condition of rebuild. It must be one of those values:
ta: மறுகட்டமைப்பின் நிலை. அது அந்த மதிப்புகளில் ஒன்றாக இருக்க வேண்டும்:

source: ``'env'`` if a change in the setting only takes effect when a document is parsed -- this means that the whole environment must be rebuilt.
ta: ஒரு ஆவணம் பாகுபடுத்தப்படும்போது மட்டுமே அமைப்பில் மாற்றம் நடைமுறைக்கு வந்தால் - `'' env'`` - இதன் பொருள் முழு சூழலும் மீண்டும் கட்டப்பட வேண்டும்.

source: ``'html'`` if a change in the setting needs a full rebuild of HTML documents.
ta: `` 'html'``` அமைப்பில் ஒரு மாற்றத்திற்கு HTML ஆவணங்களை முழுமையாக மீண்டும் கட்டியெழுப்ப வேண்டும்.

source: ``''`` if a change in the setting will not need any special rebuild.
ta: `` '' `` அமைப்பில் மாற்றத்திற்கு எந்த சிறப்பு மறுகட்டமைப்பும் தேவையில்லை என்றால்.

source: The type of configuration value. A list of types can be specified. For example, ``[str]`` is used to describe a configuration that takes string value.
ta: உள்ளமைவு மதிப்பு வகை. வகைகளின் பட்டியலைக் குறிப்பிடலாம். எடுத்துக்காட்டாக, சரம் மதிப்பை எடுக்கும் உள்ளமைவை விவரிக்க `` [str] `` பயன்படுத்தப்படுகிறது.

source: A short description of the configuration value.
ta: உள்ளமைவு மதிப்பின் சுருக்கமான விளக்கம்.

source: If the *default* value is a callable, it will be called with the config object as its argument in order to get the default value. This can be used to implement config values whose default depends on other values.
ta: * இயல்புநிலை * மதிப்பு அழைக்கக்கூடியதாக இருந்தால், இயல்புநிலை மதிப்பைப் பெறுவதற்காக அது கட்டமைப்பு பொருளுடன் அதன் வாதமாக அழைக்கப்படும். இயல்புநிலை மற்ற மதிப்புகளைப் பொறுத்து உள்ளமைவு மதிப்புகளை செயல்படுத்த இதைப் பயன்படுத்தலாம்.

source: Changed *rebuild* from a simple boolean (equivalent to ``''`` or ``'env'``) to a string. However, booleans are still accepted and converted internally.
ta: ஒரு எளிய பூலியனில் இருந்து (`` '' `` அல்லது `` '' என்வ்'``` க்கு சமம்) ஒரு சரத்திற்கு மாற்றப்பட்டது. இருப்பினும், பூலியர்கள் இன்னும் ஏற்றுக்கொள்ளப்பட்டு உள்நாட்டில் மாற்றப்படுகிறார்கள்.

source: The *types* parameter.
ta: *வகைகள்* அளவுரு.

source: The *description* parameter.
ta: *விளக்கம்* அளவுரு.

source: Register an event called *name*.
ta: *பெயர் *என்ற நிகழ்வைப் பதிவுசெய்க.

source: This is needed to be able to emit it.
ta: அதை வெளியிடுவதற்கு இது தேவை.

source: The name of the event
ta: நிகழ்வின் பெயர்

source: Register or override a Docutils translator class.
ta: ஒரு ஆவண மொழிபெயர்ப்பாளர் வகுப்பை பதிவு செய்யுங்கள் அல்லது மேலெழுதவும்.

source: This is used to register a custom output translator or to replace a builtin translator. This allows extensions to use a custom translator and define custom nodes for the translator (see :meth:`add_node`).
ta: தனிப்பயன் வெளியீட்டு மொழிபெயர்ப்பாளரை பதிவு செய்ய அல்லது பில்டின் மொழிபெயர்ப்பாளரை மாற்ற இது பயன்படுகிறது. இது தனிப்பயன் மொழிபெயர்ப்பாளரைப் பயன்படுத்தவும் மொழிபெயர்ப்பாளருக்கான தனிப்பயன் முனைகளை வரையறுக்கவும் நீட்டிப்புகளை அனுமதிக்கிறது (பார்க்க: மெத்: `கூடுதல்_நோட்`).

source: The name of the builder for the translator
ta: மொழிபெயர்ப்பாளருக்கான பில்டரின் பெயர்

source: A translator class
ta: ஒரு மொழிபெயர்ப்பாளர் வகுப்பு

source: If true, install the translator forcedly even if another translator is already installed as the same name
ta: உண்மை என்றால், மற்றொரு மொழிபெயர்ப்பாளர் ஏற்கனவே அதே பெயராக நிறுவப்பட்டிருந்தாலும் மொழிபெயர்ப்பாளரை கட்டாயமாக நிறுவவும்

source: Register a Docutils node class.
ta: ஒரு ஆவண முனை வகுப்பைப் பதிவுசெய்க.

source: This is necessary for Docutils internals. It may also be used in the future to validate nodes in the parsed documents.
ta: ஆவணங்கள் உட்புறங்களுக்கு இது அவசியம். பாகுபடுத்தப்பட்ட ஆவணங்களில் உள்ள முனைகளை சரிபார்க்க எதிர்காலத்தில் இது பயன்படுத்தப்படலாம்.

source: A node class
ta: ஒரு முனை வகுப்பு

source: Visitor functions for each builder (see below)
ta: ஒவ்வொரு பில்டருக்கும் பார்வையாளர் செயல்பாடுகள் (கீழே காண்க)

source: If true, install the node forcedly even if another node is already installed as the same name
ta: உண்மை என்றால், மற்றொரு முனை ஏற்கனவே அதே பெயராக நிறுவப்பட்டிருந்தாலும், முனையை கட்டாயமாக நிறுவவும்

source: Node visitor functions for the Sphinx HTML, LaTeX, text and manpage writers can be given as keyword arguments: the keyword should be one or more of ``'html'``, ``'latex'``, ``'text'``, ``'man'``, ``'texinfo'`` or any other supported translators, the value a 2-tuple of ``(visit, depart)`` methods. ``depart`` can be ``None`` if the ``visit`` function raises :exc:`docutils.nodes.SkipNode`. Example:
ta: SPHINX HTML, Latex, Text மற்றும் Manpage எழுத்தாளர்களுக்கான முனை பார்வையாளர் செயல்பாடுகள் முக்கிய வாதங்களாக வழங்கப்படலாம்: முக்கிய சொல் ஒன்று அல்லது அதற்கு மேற்பட்டதாக இருக்க வேண்டும் `'' html'``,` `'Latex'``,` `உரை' . `` வருகை`` `` ஒன்றும் ஒன்றும் ஏற்படலாம் `` வருகை`` செயல்பாடு எழுப்பினால்: EXC: `docutils.nodes.skipnode`. உதாரணமாக:

source: Obviously, translators for which you don't specify visitor methods will choke on the node when encountered in a document to translate.
ta: வெளிப்படையாக, நீங்கள் பார்வையாளர் முறைகளைக் குறிப்பிடாத மொழிபெயர்ப்பாளர்கள் மொழிபெயர்க்க ஒரு ஆவணத்தில் எதிர்கொள்ளும்போது முனையில் மூச்சுத் திணறுவார்கள்.

source: Added the support for keyword arguments giving visit functions.
ta: வருகை செயல்பாடுகளை வழங்கும் முக்கிய வாதங்களுக்கான ஆதரவைச் சேர்த்தது.

source: Register a Docutils node class as a numfig target.
ta: ஒரு டாக்யூடில்ஸ் முனை வகுப்பை ஒரு எண்ஃபிக் இலக்காக பதிவு செய்யுங்கள்.

source: Sphinx numbers the node automatically. And then the users can refer it using :rst:role:`numref`.
ta: ஸ்பின்க்ஸ் எண்கள் முனையை தானாகவே. பின்னர் பயனர்கள் இதைப் பயன்படுத்தி குறிப்பிடலாம்: rst: பங்கு: `numref`.

source: The type of enumerable nodes. Each figtype has individual numbering sequences. As system figtypes, ``figure``, ``table`` and ``code-block`` are defined. It is possible to add custom nodes to these default figtypes. It is also possible to define new custom figtype if a new figtype is given.
ta: கணக்கிட முடியாத முனைகளின் வகை. ஒவ்வொரு ஃபிக்டைப்பிலும் தனிப்பட்ட எண்ணும் காட்சிகள் உள்ளன. கணினி படம், `` படம்``, `` அட்டவணை`` மற்றும் `கோட்-பிளாக்`` வரையறுக்கப்பட்டுள்ளன. இந்த இயல்புநிலை படங்களுக்கு தனிப்பயன் முனைகளைச் சேர்க்க முடியும். ஒரு புதிய படம் வழங்கப்பட்டால் புதிய தனிப்பயன் படம் வரையறுக்கவும் முடியும்.

source: A getter function to obtain the title of node. It takes an instance of the enumerable node, and it must return its title as string. The title is used to the default title of references for :rst:role:`ref`. By default, Sphinx searches ``docutils.nodes.caption`` or ``docutils.nodes.title`` from the node as a title.
ta: முனையின் தலைப்பைப் பெற ஒரு பெறுநர் செயல்பாடு. இது கணக்கிட முடியாத முனையின் ஒரு நிகழ்வை எடுக்கும், மேலும் அது அதன் தலைப்பை சரமாக திருப்பித் தர வேண்டும். இதற்கான குறிப்புகளின் இயல்புநிலை தலைப்புக்கு தலைப்பு பயன்படுத்தப்படுகிறது: rst: பங்கு: `ref`. இயல்பாக, ஸ்பின்க்ஸ் `` docutils.nodes.caption`` அல்லது `` docutils.nodes.title`` ஐ ஒரு தலைப்பாக தேடுகிறது.

source: Visitor functions for each builder (same as :meth:`add_node`)
ta: ஒவ்வொரு பில்டருக்கும் பார்வையாளர் செயல்பாடுகள் (அதே: மெத்: `கூடுதல்_நோட்`)

source: Register a Docutils directive.
ta: ஒரு ஆவண உத்தரவை பதிவு செய்யுங்கள்.

source: The name of the directive
ta: உத்தரவின் பெயர்

source: A directive class
ta: ஒரு உத்தரவு வகுப்பு

source: If false, do not install it if another directive is already installed as the same name If true, unconditionally install the directive.
ta: தவறு என்றால், மற்றொரு உத்தரவு ஏற்கனவே அதே பெயராக நிறுவப்பட்டிருந்தால் அதை நிறுவ வேண்டாம், நிபந்தனையின்றி உத்தரவை நிறுவவும்.

source: For example, a custom directive named ``my-directive`` would be added like this:
ta: எடுத்துக்காட்டாக, `` என்-டைரெக்டிவ்`` என்ற தனிப்பயன் உத்தரவு இதுபோன்று சேர்க்கப்படும்:

source: For more details, see `the Docutils docs <https://docutils.sourceforge.io/docs/howto/rst-directives.html>`__ .
ta: மேலும் விவரங்களுக்கு, `டாக்யூடில்ஸ் டாக்ஸ் <https://docutils.sourceforge.io/docs/howto/rst-directives.html> __. __ ஐப் பார்க்கவும்.

source: Docutils 0.5-style directive classes are now supported.
ta: ஆவணங்கள் 0.5-பாணி உத்தரவு வகுப்புகள் இப்போது ஆதரிக்கப்படுகின்றன.

source: Docutils 0.4-style (function based) directives support is deprecated.
ta: Docutils 0.4-பாணி (செயல்பாட்டு அடிப்படையிலான) வழிமுறைகள் ஆதரவு நீக்கப்பட்டது.

source: Register a Docutils role.
ta: ஒரு ஆவணப் பாத்திரத்தை பதிவு செய்யுங்கள்.

source: The name of role
ta: பாத்திரத்தின் பெயர்

source: A role function
ta: ஒரு பங்கு செயல்பாடு

source: If false, do not install it if another role is already installed as the same name If true, unconditionally install the role.
ta: தவறு என்றால், மற்றொரு பாத்திரம் ஏற்கனவே அதே பெயராக நிறுவப்பட்டிருந்தால் அதை நிறுவ வேண்டாம், நிபந்தனையின்றி பாத்திரத்தை நிறுவவும்.

source: For more details about role functions, see `the Docutils docs <https://docutils.sourceforge.io/docs/howto/rst-roles.html>`__ .
ta: பங்கு செயல்பாடுகளைப் பற்றிய கூடுதல் விவரங்களுக்கு, `டாக்யூடில்ஸ் டாக்ஸ் <https://docutils.sourceforge.io/docs/howto/rst-roles.html> __.

source: Register a generic Docutils role.
ta: பொதுவான ஆவணப் பாத்திரத்தை பதிவு செய்யுங்கள்.

source: Register a Docutils role that does nothing but wrap its contents in the node given by *nodeclass*.
ta: *NodeClass *வழங்கிய முனையில் அதன் உள்ளடக்கங்களை மடிக்கத் தவிர வேறு எதுவும் செய்யாத ஒரு ஆவணப் பாத்திரத்தை பதிவு செய்யுங்கள்.

source: Register a domain.
ta: ஒரு களத்தை பதிவு செய்யுங்கள்.

source: A domain class
ta: ஒரு டொமைன் வகுப்பு

source: If false, do not install it if another domain is already installed as the same name If true, unconditionally install the domain.
ta: தவறு என்றால், மற்றொரு டொமைன் ஏற்கனவே அதே பெயராக நிறுவப்பட்டிருந்தால் அதை நிறுவ வேண்டாம், நிபந்தனையின்றி டொமைனை நிறுவவும்.

source: Register a Docutils directive in a domain.
ta: ஒரு களத்தில் ஒரு ஆவண உத்தரவை பதிவு செய்யுங்கள்.

source: Like :meth:`add_directive`, but the directive is added to the domain named *domain*.
ta: இது: மெத்: `ADD_DIRECTIVE`, ஆனால் உத்தரவு *டொமைன் *என்ற டொமைனில் சேர்க்கப்படுகிறது.

source: The name of target domain
ta: இலக்கு களத்தின் பெயர்

source: A name of directive
ta: உத்தரவின் பெயர்

source: Register a Docutils role in a domain.
ta: ஒரு களத்தில் ஒரு ஆவணப் பாத்திரத்தை பதிவு செய்யுங்கள்.

source: Like :meth:`add_role`, but the role is added to the domain named *domain*.
ta: இது: மெத்: `கூடுதல்_ரோல்`, ஆனால் *டொமைன் *என்ற டொமைனில் பங்கு சேர்க்கப்படுகிறது.

source: The name of the target domain
ta: இலக்கு களத்தின் பெயர்

source: The name of the role
ta: பாத்திரத்தின் பெயர்

source: The role function
ta: பங்கு செயல்பாடு

source: Register a custom index for a domain.
ta: ஒரு டொமைனுக்கான தனிப்பயன் குறியீட்டை பதிவு செய்யுங்கள்.

source: Add a custom *index* class to the domain named *domain*.
ta: *டொமைன் *என்ற டொமைனில் தனிப்பயன் *குறியீட்டு *வகுப்பைச் சேர்க்கவும்.

source: The index class
ta: குறியீட்டு வகுப்பு

source: If false, do not install it if another index is already installed as the same name If true, unconditionally install the index.
ta: பொய்யானது என்றால், மற்றொரு குறியீடு ஏற்கனவே அதே பெயராக நிறுவப்பட்டிருந்தால் அதை நிறுவ வேண்டாம் உண்மையாக இருந்தால், நிபந்தனையின்றி குறியீட்டை நிறுவவும்.

source: Register a new object type.
ta: புதிய பொருள் வகையை பதிவு செய்யுங்கள்.

source: This method is a very convenient way to add a new :term:`object` type that can be cross-referenced. It will do this:
ta: இந்த முறை புதியதைச் சேர்க்க மிகவும் வசதியான வழியாகும்: கால: `பொருள்` வகை குறுக்கு-குறிப்பிடக்கூடிய வகை. இது இதைச் செய்யும்:

source: Create a new directive (called *directivename*) for documenting an object. It will automatically add index entries if *indextemplate* is nonempty; if given, it must contain exactly one instance of ``%s``. See the example below for how the template will be interpreted.
ta: ஒரு பொருளை ஆவணப்படுத்த ஒரு புதிய உத்தரவை ( *டைரக்டிவேனேம் *என அழைக்கப்படுகிறது) உருவாக்கவும். * Indextemplate * nonempty என்றால் அது தானாகவே குறியீட்டு உள்ளீடுகளைச் சேர்க்கும்; வழங்கப்பட்டால், அதில் ``%s`` இன் ஒரு நிகழ்வு சரியாக இருக்க வேண்டும். வார்ப்புரு எவ்வாறு விளக்கப்படும் என்பதற்கான கீழே உள்ள உதாரணத்தைக் காண்க.

source: Create a new role (called *rolename*) to cross-reference to these object descriptions.
ta: இந்த பொருள் விளக்கங்களுக்கு குறுக்கு குறிப்புக்கு ஒரு புதிய பாத்திரத்தை ( *ரோலேனேம் *என அழைக்கப்படுகிறது) உருவாக்கவும்.

source: If you provide *parse_node*, it must be a function that takes a string and a docutils node, and it must populate the node with children parsed from the string. It must then return the name of the item to be used in cross-referencing and index entries. See the :file:`conf.py` file in the source for this documentation for an example.
ta: நீங்கள் *parse_node *ஐ வழங்கினால், அது ஒரு சரம் மற்றும் ஒரு ஆவண முனையை எடுக்கும் செயல்பாடாக இருக்க வேண்டும், மேலும் இது சரத்திலிருந்து பாகுபடுத்தப்பட்ட குழந்தைகளுடன் முனையை விரிவுபடுத்த வேண்டும். அது குறுக்கு-குறிப்பு மற்றும் குறியீட்டு உள்ளீடுகளில் பயன்படுத்த வேண்டிய பொருளின் பெயரைத் தர வேண்டும். ஒரு எடுத்துக்காட்டுக்கு இந்த ஆவணத்திற்கான மூலத்தில் `conf.py` கோப்பைக் காண்க.

source: The *objname* (if not given, will default to *directivename*) names the type of object. It is used when listing objects, e.g. in search results.
ta: *Objname *(கொடுக்கப்படாவிட்டால், இயல்புநிலை *டைரக்டிவேனேமுக்கு *) பொருளின் வகையை பெயரிடுகிறது. பொருள்களை பட்டியலிடும்போது இது பயன்படுத்தப்படுகிறது, எ.கா. தேடல் முடிவுகளில்.

source: For example, if you have this call in a custom Sphinx extension::
ta: எடுத்துக்காட்டாக, தனிப்பயன் ஸ்பிங்க்ஸ் நீட்டிப்பில் இந்த அழைப்பு இருந்தால் ::

source: you can use this markup in your documents::
ta: உங்கள் ஆவணங்களில் இந்த மார்க்அப்பைப் பயன்படுத்தலாம் ::

source: For the directive, an index entry will be generated as if you had prepended ::
ta: உத்தரவுக்கு, நீங்கள் தயாரித்ததைப் போல ஒரு குறியீட்டு நுழைவு உருவாக்கப்படும் ::

source: The reference node will be of class ``literal`` (so it will be rendered in a proportional font, as appropriate for code) unless you give the *ref_nodeclass* argument, which must be a docutils node class. Most useful are ``docutils.nodes.emphasis`` or ``docutils.nodes.strong`` -- you can also use ``docutils.nodes.generated`` if you want no further text decoration. If the text should be treated as literal (e.g. no smart quote replacement), but not have typewriter styling, use ``sphinx.addnodes.literal_emphasis`` or ``sphinx.addnodes.literal_strong``.
ta: குறிப்பு முனை `` லிட்டரல்`` வகுப்பில் இருக்கும் (எனவே இது ஒரு விகிதாசார எழுத்துருவில் வழங்கப்படும், குறியீட்டிற்கு பொருத்தமானது) நீங்கள் * ref_nodeclass * வாதத்தை வழங்காவிட்டால், இது ஒரு ஆவண முனை வகுப்பாக இருக்க வேண்டும். மிகவும் பயனுள்ளதாக இருக்கும் `` docutils.nodes.emphiss`` அல்லது `` docutils.nodes.strong`` - நீங்கள் `` docutils.nodes.generated`` ஐப் பயன்படுத்தலாம். உரையை நேரடி என்று கருத வேண்டும் (எ.கா. ஸ்மார்ட் மேற்கோள் மாற்றீடு இல்லை), ஆனால் தட்டச்சுப்பொறி ஸ்டைலிங் இல்லை என்றால், `` sphinx.addnodes.literal_emphasis`` அல்லது `` sphinx.addnodes.literal_strong`` ஐப் பயன்படுத்தவும்.

source: For the role content, you have the same syntactical possibilities as for standard Sphinx roles (see :ref:`xref-syntax`).
ta: பங்கு உள்ளடக்கத்தைப் பொறுத்தவரை, நிலையான ஸ்பிங்க்ஸ் பாத்திரங்களுக்கும் அதே செயற்கையான சாத்தியக்கூறுகள் உள்ளன (பார்க்க: குறிப்பு: `xref-syntax`).

source: If *override* is True, the given object_type is forcedly installed even if an object_type having the same name is already installed.
ta: * மேலெழுத * உண்மையாக இருந்தால், அதே பெயரைக் கொண்ட ஒரு பொருள்_ வகை ஏற்கனவே நிறுவப்பட்டிருந்தாலும் கூட கொடுக்கப்பட்ட பொருள்_ வகை கட்டாயமாக நிறுவப்படுகிறது.

source: Register a new crossref object type.
ta: புதிய கிராஸ்ரெஃப் பொருள் வகையை பதிவு செய்யுங்கள்.

source: This method is very similar to :meth:`~Sphinx.add_object_type` except that the directive it generates must be empty, and will produce no output.
ta: இந்த முறை மிகவும் ஒத்திருக்கிறது: மெத்: `~ sphinx.add_object_type` தவிர, அது உருவாக்கும் உத்தரவு காலியாக இருக்க வேண்டும், மேலும் வெளியீட்டை உருவாக்காது.

source: That means that you can add semantic targets to your sources, and refer to them using custom roles instead of generic ones (like :rst:role:`ref`). Example call::
ta: அதாவது உங்கள் ஆதாரங்களில் சொற்பொருள் இலக்குகளை நீங்கள் சேர்க்கலாம், மேலும் பொதுவானவற்றுக்கு பதிலாக தனிப்பயன் பாத்திரங்களைப் பயன்படுத்தி அவற்றைப் பார்க்கவும் (போன்றவை: rst: ref: `ref`). எடுத்துக்காட்டு அழைப்பு ::

source: Example usage::
ta: எடுத்துக்காட்டு பயன்பாடு ::

source: (Of course, the element following the ``topic`` directive needn't be a section.)
ta: (நிச்சயமாக, `` தலைப்பு`` உத்தரவைப் பின்பற்றும் உறுப்பு ஒரு பிரிவாக இருக்க தேவையில்லை.)

source: If false, do not install it if another cross-reference type is already installed as the same name If true, unconditionally install the cross-reference type.
ta: பொய்யானது என்றால், மற்றொரு குறுக்கு-குறிப்பு வகை ஏற்கனவே அதே பெயராக நிறுவப்பட்டிருந்தால் அதை நிறுவ வேண்டாம் உண்மையாக இருந்தால், நிபந்தனையின்றி குறுக்கு-குறிப்பு வகையை நிறுவவும்.

source: Register a Docutils transform to be applied after parsing.
ta: பாகுபடுத்தலுக்குப் பிறகு பயன்படுத்தப்படும் ஒரு ஆவண மாற்றங்களை பதிவு செய்யுங்கள்.

source: Add the standard docutils :class:`~docutils.transforms.Transform` subclass *transform* to the list of transforms that are applied after Sphinx parses a reST document.
ta: நிலையான ஆவணங்களைச் சேர்க்கவும்: வகுப்பு: `~ docutils.transforms.transform` துணைப்பிரிவு * உருமாற்றம் * ஸ்பிங்க்ஸ் ஒரு ஓய்வு ஆவணத்தை பாகுபடுத்திய பிறகு பயன்படுத்தப்படும் மாற்றங்களின் பட்டியலுக்கு மாற்றவும்.

source: A transform class
ta: ஒரு உருமாற்ற வகுப்பு

source: priority range categories for Sphinx transforms
ta: SPHINX உருமாற்றங்களுக்கான முன்னுரிமை வரம்பு பிரிவுகள்

source: Priority
ta: முன்னுரிமை

source: Main purpose in Sphinx
ta: ஸ்பிங்க்ஸில் முக்கிய நோக்கம்

source: Fix invalid nodes by docutils. Translate a doctree.
ta: ஆவணங்கள் மூலம் தவறான முனைகளை சரிசெய்யவும். ஒரு கோட்பாட்டை மொழிபெயர்க்கவும்.

source: Preparation
ta: தயாரிப்பு

source: early
ta: ஆரம்ப

source: main
ta: முக்கிய

source: Post processing. Deadline to modify text and referencing.
ta: பின் செயலாக்க. உரை மற்றும் குறிப்புகளை மாற்றுவதற்கான காலக்கெடு.

source: Collect referencing and referenced nodes. Domain processing.
ta: குறிப்பு மற்றும் குறிப்பிடப்பட்ட முனைகளை சேகரிக்கவும். டொமைன் செயலாக்கம்.

source: Finalize and clean up.
ta: இறுதி செய்து சுத்தம் செய்யுங்கள்.

source: refs: `Transform Priority Range Categories`__
ta: குறிப்புகள்: `முன்னுரிமை வரம்பு வகைகளை மாற்றவும்`__

source: Register a Docutils transform to be applied before writing.
ta: எழுதுவதற்கு முன் பயன்படுத்தப்படும் ஒரு ஆவண மாற்றங்களை பதிவு செய்யுங்கள்.
