Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_usage--restructuredtext--directives_*.po
Languages: ta

source: Each admonition directive supports a ``:collapsible:`` option, to make the content of the admonition collapsible (where supported by the output format). This can be useful for content that is not always relevant. By default, collapsible admonitions are initially open, but this can be controlled with the ``open`` and ``closed`` arguments to the ``:collapsible:`` option, which change the default state. In output formats that don't support collapsible content, the text is always included. For example:
ta: அறிவுரையின் உள்ளடக்கத்தை மடிக்கக்கூடியதாக மாற்றுவதற்கு (வெளியீட்டு வடிவமைப்பால் ஆதரிக்கப்படும்) ஒவ்வொரு அறிவுரை உத்தரவும் ``: மடிக்கக்கூடிய:`` விருப்பத்தை ஆதரிக்கிறது. எப்போதும் பொருந்தாத உள்ளடக்கத்திற்கு இது பயனுள்ளதாக இருக்கும். இயல்பாக, மடிக்கக்கூடிய அறிவுரைகள் ஆரம்பத்தில் திறந்திருக்கும், ஆனால் இது இயல்பு நிலையை மாற்றும் ``:collapsible:`` விருப்பத்திற்கு ``Open`` மற்றும் ``closed`` வாதங்களைக் கொண்டு கட்டுப்படுத்தலாம். மடிக்கக்கூடிய உள்ளடக்கத்தை ஆதரிக்காத வெளியீட்டு வடிவங்களில், உரை எப்போதும் சேர்க்கப்படும். உதாரணமாக:

source: This note is collapsible, and initially open by default.
ta: இந்தக் குறிப்பு மடிக்கக்கூடியது மற்றும் ஆரம்பத்தில் இயல்பாகத் திறக்கப்படும்.

source: Example
ta: உதாரணமாக

source: This example is collapsible, and initially open.
ta: இந்த எடுத்துக்காட்டு மடிக்கக்கூடியது மற்றும் ஆரம்பத்தில் திறந்திருக்கும்.

source: This hint is collapsible, but initially closed.
ta: இந்த குறிப்பு மடிக்கக்கூடியது, ஆனால் ஆரம்பத்தில் மூடப்பட்டது.

source: Describing changes between versions
ta: பதிப்புகளுக்கு இடையிலான மாற்றங்களை விவரிக்கிறது

source: This directive documents the version of the project which added the described feature. When this applies to an entire module or component, it should be placed at the top of the relevant section before any prose.
ta: விவரிக்கப்பட்ட அம்சத்தைச் சேர்த்த திட்டத்தின் பதிப்பை இந்த கட்டளை ஆவணப்படுத்துகிறது. இது ஒரு முழு தொகுதி அல்லது கூறுக்கும் பொருந்தும் போது, ​​எந்த உரைநடைக்கும் முன் தொடர்புடைய பகுதியின் மேல் வைக்க வேண்டும்.

source: The first argument must be given and is the version in question; you can add a second argument consisting of a *brief* explanation of the change.
ta: முதல் உரையாடல் வழங்கப்பட வேண்டும் மற்றும் கேள்விக்குரிய பதிப்பாகும்; மாற்றத்தின் * சுருக்கமான * விளக்கத்தை உள்ளடக்கிய இரண்டாவது வாதத்தை நீங்கள் சேர்க்கலாம்.

source: There must be no blank line between the directive head and the explanation; this is to make these blocks visually continuous in the markup.
ta: கட்டளைத் தலைக்கும் விளக்கத்திற்கும் இடையில் வெற்றுக் கோடு இருக்கக்கூடாது; இது இந்த தொகுதிகளை மார்க்அப்பில் பார்வைக்கு தொடர்ச்சியாக வைக்க வேண்டும்.

source: The :rst:dir:`versionadded` directive was renamed to :rst:dir:`version-added`. The previous name is retained as an alias.
ta: :rst:dir:`versionadded` கட்டளை :rst:dir:`version-added` என மறுபெயரிடப்பட்டது. முந்தைய பெயர் மாற்றுப்பெயராகவே வைக்கப்பட்டுள்ளது.

source: The *spam* parameter.
ta: *ச்பேம்* அளவுரு.

source: Similar to :rst:dir:`version-added`, but describes when and what changed in the named feature in some way (new parameters, changed side effects, etc.).
ta: :rst:dir:`version-added` போன்றது, ஆனால் பெயரிடப்பட்ட அம்சத்தில் எப்போது, ​​என்ன மாற்றம் ஏற்பட்டது என்பதை விவரிக்கிறது (புதிய அளவுருக்கள், மாற்றப்பட்ட பக்க விளைவுகள் போன்றவை).

source: The :rst:dir:`versionchanged` directive was renamed to :rst:dir:`version-changed`. The previous name is retained as an alias.
ta: :rst:dir:`versionchanged` கட்டளை :rst:dir:`version-changed` என மறுபெயரிடப்பட்டது. முந்தைய பெயர் மாற்றுப்பெயராகவே வைக்கப்பட்டுள்ளது.

source: The *spam* parameter is now of type *boson*.
ta: *ச்பேம்* அளவுரு இப்போது *போசான்* வகையாகும்.

source: Similar to :rst:dir:`version-added`, but describes when the feature was deprecated. A *brief* explanation can also be given, for example to tell the reader what to use instead.
ta: :rst:dir:`version-added` போன்றது, ஆனால் நற்பொருத்தம் எப்போது நிறுத்தப்பட்டது என்பதை விவரிக்கிறது. ஒரு *சுருக்கமான* விளக்கத்தையும் கொடுக்கலாம், உதாரணமாக வாசகருக்குப் பதிலாக எதைப் பயன்படுத்த வேண்டும் என்று சொல்லலாம்.

source: The :rst:dir:`deprecated` directive was renamed to :rst:dir:`version-deprecated`. The previous name is retained as an alias
ta: :rst:dir:`deprecated` கட்டளை :rst:dir:`version-deprecated` என மறுபெயரிடப்பட்டது. முந்தைய பெயர் மாற்றுப்பெயராகவே வைக்கப்பட்டுள்ளது

source: Use :py:func:`!spam` instead.
ta: அதற்கு பதிலாக :py:func:`!spam` ஐப் பயன்படுத்தவும்.

source: Similar to :rst:dir:`version-added`, but describes when the feature was removed. An explanation may be provided to tell the reader what to use instead, or why the feature was removed.
ta: :rst:dir:`version-added` போன்றது, ஆனால் நற்பொருத்தம் எப்போது அகற்றப்பட்டது என்பதை விவரிக்கிறது. அதற்குப் பதிலாக எதைப் பயன்படுத்த வேண்டும் அல்லது ஏன் நற்பொருத்தம் அகற்றப்பட்டது என்பதை வாசகரிடம் தெரிவிக்க ஒரு விளக்கம் வழங்கப்படலாம்.

source: The :rst:dir:`versionremoved` directive was renamed to :rst:dir:`version-removed`. The previous name is retained as an alias.
ta: :rst:dir:`versionremoved` கட்டளை :rst:dir:`version-removed` என மறுபெயரிடப்பட்டது. முந்தைய பெயர் மாற்றுப்பெயராகவே வைக்கப்பட்டுள்ளது.

source: The :py:func:`!spam` function is more flexible, and should be used instead.
ta: :py:func:`!spam` செயல்பாடு மிகவும் நெகிழ்வானது, அதற்குப் பதிலாகப் பயன்படுத்தப்பட வேண்டும்.

source: Presentational
ta: விளக்கக்காட்சி

source: A rubric is like an informal heading that doesn't correspond to the document's structure, i.e. it does not create a table of contents node.
ta: ஒரு ரூப்ரிக் என்பது ஒரு முறைசாரா தலைப்பைப் போன்றது, இது ஆவணத்தின் கட்டமைப்பிற்கு பொருந்தாது, அதாவது இது உள்ளடக்க முனையை உருவாக்காது.

source: If the *title* of the rubric is "Footnotes" (or the selected language's equivalent), this rubric is ignored by the LaTeX writer, since it is assumed to only contain footnote definitions and therefore would create an empty heading.
ta: ரப்ரிக்கின் * தலைப்பு * "அடிக்குறிப்புகள்" (அல்லது தேர்ந்தெடுக்கப்பட்ட மொழியின் சமமான) என்றால், இந்த ரப்ரிக் லேடெக்ச் எழுத்தாளரால் புறக்கணிக்கப்படுகிறது, ஏனெனில் இது அடிக்குறிப்பு வரையறைகளை மட்டுமே கொண்டிருப்பதாக கருதப்படுகிறது, எனவே வெற்று தலைப்பை உருவாக்கும்.

source: Assign `class attributes`_. This is a :dudir:`common option <common-options>`.
ta: `வகுப்பு பண்புகளை`_ ஒதுக்கவும். இது :dudir:`common சூதம் <common-options>`.

source: An implicit target name that can be referenced using :rst:role:`ref`. This is a :dudir:`common option <common-options>`.
ta: :rst:role:`ref` ஐப் பயன்படுத்தி குறிப்பிடக்கூடிய ஒரு மறைமுக இலக்கு பெயர். இது :dudir:`common சூதம் <common-options>`.

source: Use this option to specify the heading level of the rubric. In this case the rubric will be rendered as ``<h1>`` to ``<h6>`` for HTML output, or as the corresponding non-numbered sectioning command for LaTeX (see :confval:`latex_toplevel_sectioning`).
ta: ரூபிக்கின் தலைப்பு அளவைக் குறிப்பிட இந்த விருப்பத்தைப் பயன்படுத்தவும். இந்த வழக்கில், உஉகுமொ வெளியீட்டிற்கு ``<h1>`` இலிருந்து ``<h6>`` ஆகவோ அல்லது LaTeXக்கான தொடர்புடைய எண்ணற்ற பிரிவு கட்டளையாகவோ ரப்ரிக் வழங்குதல் செய்யப்படும் (பார்க்க :confval:`latex_toplevel_sectioning`).

source: This directive creates a centered boldfaced line of text.
ta: இந்த கட்டளை மையப்படுத்தப்பட்ட தடிமனான உரையை உருவாக்குகிறது.

source: This presentation-only directive is a legacy from older versions. Use a :ref:`rst-class <rstclass>` directive instead and add an appropriate style.
ta: இந்த விளக்கக்காட்சி-மட்டும் கட்டளை பழைய பதிப்புகளிலிருந்து ஒரு மரபு. a: ref ஐப் பயன்படுத்தவும்: `rst- class <rstclass>` அதற்கு பதிலாக உத்தரவிட்டு பொருத்தமான பாணியைச் சேர்க்கவும்.

source: This directive must contain a bullet list. It will transform it into a more compact list by either distributing more than one item horizontally, or reducing spacing between items, depending on the builder.
ta: இந்த உத்தரவில் புல்லட் பட்டியல் இருக்க வேண்டும். இது ஒன்றுக்கு மேற்பட்ட உருப்படிகளை கிடைமட்டமாக விநியோகிப்பதன் மூலம் அல்லது பில்டரைப் பொறுத்து உருப்படிகளுக்கு இடையில் இடைவெளியைக் குறைப்பதன் மூலம் அதை மிகவும் சிறிய பட்டியலாக மாற்றும்.

source: The number of columns; defaults to 2. For example::
ta: நெடுவரிசைகளின் எண்ணிக்கை; இயல்புநிலை 2. எடுத்துக்காட்டாக::

source: Showing code examples
ta: குறியீடு எடுத்துக்காட்டுகளைக் காட்டுகிறது

source: There are multiple ways to show syntax-highlighted literal code blocks in Sphinx:
ta: ச்பிங்க்சில் தொடரியல்-உயர் விளக்கு நேரடி குறியீடு தொகுதிகளைக் காட்ட பல வழிகள் உள்ளன:

source: using :ref:`reStructuredText doctest blocks <rst-doctest-blocks>`;
ta: பயன்படுத்தி :ref:`reStructuredText doctest தொகுதிகள் <rst-doctest-blocks>`;

source: using :ref:`reStructuredText literal blocks <rst-literal-blocks>`, optionally in combination with the :rst:dir:`highlight` directive;
ta: :ref:`reStructuredText லிட்டரல் பிளாக்ச் <rst-literal-blocks>` ஐப் பயன்படுத்தி, விருப்பமாக :rst:dir:`highlight` கட்டளையுடன் இணைந்து;

source: using the :rst:dir:`code-block` directive;
ta: பயன்படுத்துதல்: rst: dir: `குறியீடு-தொகுதி` உத்தரவு;

source: and using the :rst:dir:`literalinclude` directive.
ta: மற்றும்: rst: dir: `listeralinclude` கட்டளை.

source: Doctest blocks can only be used to show interactive Python sessions, while the remaining three can be used for other languages. Of these three, literal blocks are useful when an entire document, or at least large sections of it, use code blocks with the same syntax and which should be styled in the same manner. On the other hand, the :rst:dir:`code-block` directive makes more sense when you want more fine-tuned control over the styling of each block or when you have a document containing code blocks using multiple varied syntaxes. Finally, the :rst:dir:`literalinclude` directive is useful for including entire code files in your documentation.
ta: ஊடாடும் பைதான் அமர்வுகளைக் காட்ட மட்டுமே டாக்ச்டெச்ட் தொகுதிகள் பயன்படுத்தப்படலாம், மீதமுள்ள மூன்று மற்ற மொழிகளுக்குப் பயன்படுத்தப்படலாம். இந்த மூன்றில், ஒரு முழு ஆவணமும், அல்லது குறைந்த பட்சம் அதன் பெரிய பிரிவுகளும் ஒரே தொடரியல் கொண்ட குறியீடு தொகுதிகளைப் பயன்படுத்தும்போது, ஒரே மாதிரியாக வடிவமைக்கப்படும்போது, நேரடி தொகுதிகள் பயனுள்ளதாக இருக்கும். மறுபுறம், ஒவ்வொரு தொகுதியின் ச்டைலிங் மீது இன்னும் சிறப்பாக வடிவமைக்கப்பட்ட கட்டுப்பாட்டை நீங்கள் விரும்பும்போது அல்லது பல மாறுபட்ட தொடரியல் பயன்படுத்தி குறியீடு தொகுதிகள் கொண்ட ஆவணம் உங்களிடம் இருக்கும்போது: rst: dir: `கோட்-பிளாக்` கட்டளை அதிக அர்த்தமுள்ளதாக இருக்கும். இறுதியாக, தி: rst: dir: `listeralinclude` கட்டளை உங்கள் ஆவணங்களில் முழு குறியீடு கோப்புகளையும் சேர்க்க பயனுள்ளதாக இருக்கும்.

source: In all cases, Syntax highlighting is provided by `Pygments <https://pygments.org>`_. When using literal blocks, this is configured using any :rst:dir:`highlight` directives in the source file. When a ``highlight`` directive is encountered, it is used until the next ``highlight`` directive is encountered. If there is no ``highlight`` directive in the file, the global highlighting language is used. This defaults to ``python`` but can be configured using the :confval:`highlight_language` config value. The following values are supported:
ta: எல்லா சந்தர்ப்பங்களிலும், தொடரியல் சிறப்பம்சமாக `பைக்மென்ட் <https://pygments.org> _ _ ஆல் வழங்கப்படுகிறது. நேரடி தொகுதிகளைப் பயன்படுத்தும் போது, இது ஏதேனும்: rst: dir: `சிறப்பம்சமாக` மூல கோப்பில் உள்ள கட்டளைகளைப் பயன்படுத்தி கட்டமைக்கப்பட்டுள்ளது. ஒரு `` சிறப்பம்சமாக`` கட்டளை ஏற்படும்போது, அடுத்த `` சிறப்பம்சமாக`` கட்டளை ஏற்படும் வரை இது பயன்படுத்தப்படுகிறது. கோப்பில் `` சிறப்பம்சமாக` கட்டளை இல்லை என்றால், உலகளாவிய சிறப்பம்சமாக மொழி பயன்படுத்தப்படுகிறது. இது `` பைதான்`` க்கு இயல்புநிலையாக உள்ளது, ஆனால்: confval: `சிறப்பம்சமாக_எணங்குவேச்` கட்டமைப்பு மதிப்பைப் பயன்படுத்தி கட்டமைக்க முடியும். பின்வரும் மதிப்புகள் ஆதரிக்கப்படுகின்றன:

source: ``none`` (no highlighting)
ta: `` எதுவுமில்லை`` (சிறப்பம்சமாக இல்லை)

source: ``default`` (similar to ``python3`` but with a fallback to ``none`` without warning highlighting fails; the default when :confval:`highlight_language` isn't set)
ta: `` இயல்புநிலை`` (`` பைதான் 3`` போன்றது, ஆனால் எச்சரிக்கையின்றி `` எதுவுமில்லை` க்கு ஒரு குறைவடையும் சிறப்பம்சமாக தோல்வியடைகிறது;

source: ``guess`` (let Pygments guess the lexer based on contents, only works with certain well-recognizable languages)
ta: `` யூகம்`` (பிக்மென்ட்ச் உள்ளடக்கங்களின் அடிப்படையில் லெக்சரை யூகிக்கட்டும், நன்கு அங்கீகரிக்கக்கூடிய சில மொழிகளுடன் மட்டுமே வேலை செய்கிறது)

source: ``python``
ta: `` பைதான்``

source: ``rest``
ta: `` ஓய்வு``

source: ``c``
ta: `` சி``

source: ... and any other `lexer alias that Pygments supports`__
ta: ... மற்றும் பிக்மென்ட்ச் ஆதரிக்கும் வேறு எந்த `லெக்சர் மாற்றுப்பெயரும்`__

source: If highlighting with the selected language fails (i.e. Pygments emits an "Error" token), the block is not highlighted in any way.
ta: தேர்ந்தெடுக்கப்பட்ட மொழியுடன் முன்னிலைப்படுத்தினால் தோல்வியுற்றால் (அதாவது பைக்கிமென்ட்ச் ஒரு "பிழை" கிள்ளாக்கை வெளியிடுகிறது), தொகுதி எந்த வகையிலும் முன்னிலைப்படுத்தப்படவில்லை.

source: The list of lexer aliases supported is tied to the Pygment version. If you want to ensure consistent highlighting, you should fix your version of Pygments.
ta: ஆதரிக்கப்படும் லெக்சர் மாற்றுப்பெயர்களின் பட்டியல் பிக்மென்ட் பதிப்போடு பிணைக்கப்பட்டுள்ளது. சீரான சிறப்பம்சத்தை உறுதிப்படுத்த விரும்பினால், உங்கள் பிக்மென்ட்களின் பதிப்பை சரிசெய்ய வேண்டும்.

source: This language is used until the next ``highlight`` directive is encountered. As discussed previously, *language* can be any lexer alias supported by Pygments.
ta: அடுத்த `` சிறப்பம்சமாக`` கட்டளை எதிர்கொள்ளும் வரை இந்த மொழி பயன்படுத்தப்படுகிறது. முன்பு விவாதித்தபடி, * மொழி * பிக்மென்ட்களால் ஆதரிக்கப்படும் எந்த லெக்சர் மாற்றுப்பெயராகவும் இருக்கலாம்.

source: Enable to generate line numbers for code blocks.
ta: குறியீடு தொகுதிகளுக்கான வரி எண்களை உருவாக்க இயக்கவும்.

source: This option takes an optional number as threshold parameter. If any threshold given, the directive will produce line numbers only for the code blocks longer than N lines. If not given, line numbers will be produced for all of code blocks.
ta: இந்த விருப்பம் ஒரு விருப்ப எண்ணை வாசல் அளவுருவாக எடுக்கும். ஏதேனும் வாசல் கொடுக்கப்பட்டால், கட்டளை n வரிகளை விட நீண்ட குறியீட்டுத் தொகுதிகளுக்கு மட்டுமே வரி எண்களை உருவாக்கும். வழங்கப்படாவிட்டால், அனைத்து குறியீடு தொகுதிகளுக்கும் வரி எண்கள் தயாரிக்கப்படும்.

source: If given, minor errors on highlighting are ignored.
ta: வழங்கப்பட்டால், சிறப்பம்சமாக சிறிய பிழைகள் புறக்கணிக்கப்படும்.

source: The directive's alias name :rst:dir:`sourcecode` works as well. This directive takes a language name as an argument. It can be `any lexer alias supported by Pygments <https://pygments.org/docs/lexers/>`_. If it is not given, the setting of :rst:dir:`highlight` directive will be used. If not set, :confval:`highlight_language` will be used. To display a code example *inline* within other text, rather than as a separate block, you can use the :rst:role:`code` role instead.
ta: டைரெக்டிவ் மாற்றுப்பெயர் பெயர்: rst: dir: `sourcecode` வேலை செய்கிறது. இந்த கட்டளை ஒரு மொழி பெயரை ஒரு வாதமாக எடுத்துக்கொள்கிறது. இது `பிக்மென்ட்ச் <https://pygments.org/docs/lexers/> _ _ ஆல் ஆதரிக்கப்படும் எந்த லெக்சர் மாற்றுப்பெயரும் இருக்கலாம். இது வழங்கப்படாவிட்டால்,: rst: dir: `சிறப்பம்சமாக` கட்டளை பயன்படுத்தப்படும். அமைக்கப்படாவிட்டால்,: confval: `சிறப்பம்சமாக_பங்குச்` பயன்படுத்தப்படும். ஒரு குறியீடு எடுத்துக்காட்டு * இன்லைன் * மற்ற உரைக்குள், ஒரு தனி தொகுதிக்கு பதிலாக, நீங்கள்: rst: rew: `குறியீடு` பாத்திரத்தைப் பயன்படுத்தலாம்.

source: The ``language`` argument becomes optional.
ta: `` மொழி`` உரையாடல் விருப்பமாகிறது.

source: Enable to generate line numbers for the code block::
ta: குறியீடு தொகுதிக்கு வரி எண்களை உருவாக்க இயக்கவும் ::

source: Set the first line number of the code block. If present, ``linenos`` option is also automatically activated::
ta: குறியீடு தொகுதியின் முதல் வரி எண்ணை அமைக்கவும். இருந்தால், `` லினெனோச்` `விருப்பமும் தானாகவே செயல்படுத்தப்படுகிறது ::

source: Emphasize particular lines of the code block::
ta: குறியீடு தொகுதியின் குறிப்பிட்ட வரிகளை வலியுறுத்துங்கள் ::

source: LaTeX supports the ``emphasize-lines`` option.
ta: லேடெக்ச் `` வலியுறுத்தல் லைன்ச்` விருப்பத்தை ஆதரிக்கிறது.

source: Ignore minor errors on highlighting.
ta: முன்னிலைப்படுத்துவதில் சிறிய பிழைகளை புறக்கணிக்கவும்.

source: Set a caption to the code block.
ta: குறியீடு தொகுதிக்கு ஒரு தலைப்பை அமைக்கவும்.

source: Define implicit target name that can be referenced by using :rst:role:`ref`. For example::
ta: பயன்படுத்துவதன் மூலம் குறிப்பிடக்கூடிய மறைமுக இலக்கு பெயரை வரையறுக்கவும்: rst: பங்கு: `ref`. உதாரணத்திற்கு::

source: In order to cross-reference a code-block using either the :rst:role:`ref` or the :rst:role:`numref` role, it is necessary that both :strong:`name` and :strong:`caption` be defined. The argument of :strong:`name` can then be given to :rst:role:`numref` to generate the cross-reference. Example::
ta: : rst: rest: `ref` அல்லது: rst: rest:` numref` பங்கு ஆகியவற்றைப் பயன்படுத்தி ஒரு குறியீடு-தடுப்புக்கு குறுக்கு-குறிப்புக்காக, இரண்டுமே: வலுவான: `பெயர்` மற்றும்: வலுவான:` தலைப்பு `வரையறுக்கப்பட வேண்டும். இதன் வாதம்: வலுவானது: `பெயர்` பின்னர் வழங்கப்படலாம்: rst: பங்கு:` numref` குறுக்கு-குறிப்பை உருவாக்க. உதாரணமாக::

source: When using :rst:role:`ref`, it is possible to generate a cross-reference with only :strong:`name` defined, provided an explicit title is given. Example::
ta: பயன்படுத்தும் போது: rst: பங்கு: `ref`, ஒரு குறுக்கு-குறிப்பை மட்டுமே உருவாக்க முடியும்: வலுவானது:` பெயர்` வரையறுக்கப்பட்டுள்ளது, வெளிப்படையான தலைப்பு வழங்கப்பட்டால். உதாரணமாக::

source: Strip indentation characters from the code block. When number given, leading N characters are removed. When no argument given, leading spaces are removed via :func:`textwrap.dedent`. For example::
ta: குறியீடு தொகுதியிலிருந்து உள்தள்ளல் எழுத்துக்களை அகற்றவும். எண் கொடுக்கப்பட்டால், முன்னணி N எழுத்துகள் அகற்றப்படும். எந்த வாதமும் இல்லாதபோது, ​​முன்னணி இடைவெளிகள் :func:`textwrap.dedent` வழியாக அகற்றப்படும். உதாரணமாக::

source: Support automatic dedent.
ta: தானியங்கி அர்ப்பணிப்பை ஆதரிக்கவும்.

source: Longer displays of verbatim text may be included by storing the example text in an external file containing only plain text. The file may be included using the ``literalinclude`` directive. [#]_ For example, to include the Python source file :file:`example.py`, use:
ta: எளிய உரையை மட்டுமே கொண்ட வெளிப்புறக் கோப்பில் எடுத்துக்காட்டு உரையை சேமிப்பதன் மூலம் நீண்ட சொற்களஞ்சிய உரைகள் சேர்க்கப்படலாம். ``literlinclude`` கட்டளையைப் பயன்படுத்தி கோப்பு சேர்க்கப்படலாம். [#]_ எடுத்துக்காட்டாக, பைதான் மூலக் கோப்பை சேர்க்க :file:`example.py`, பயன்படுத்தவும்:

source: The file name is usually relative to the current file's path. However, if it is absolute (starting with ``/``), it is relative to the top source directory.
ta: கோப்பு பெயர் பொதுவாக தற்போதைய கோப்பின் பாதையுடன் தொடர்புடையது. இருப்பினும், இது முழுமையானதாக இருந்தால் (``/`` உடன் தொடங்கி), இது சிறந்த மூல கோப்பகத்துடன் தொடர்புடையது.

source: General options
ta: பொதுவான விருப்பங்கள்

source: Add a caption above the included content. If no argument is given, the filename is used as the caption.
ta: சேர்க்கப்பட்ட உள்ளடக்கத்திற்கு மேலே ஒரு தலைப்பைச் சேர்க்கவும். எந்த வாதமும் வழங்கப்படவில்லை என்றால், கோப்புப்பெயர் தலைப்பாகப் பயன்படுத்தப்படும்.

source: Options for formatting
ta: வடிவமைப்பிற்கான விருப்பங்கள்

source: Strip indentation characters from the included content. When a number is given, the leading N characters are removed. When no argument given, all common leading indentation is removed (using :func:`textwrap.dedent`).
ta: சேர்க்கப்பட்ட உள்ளடக்கத்திலிருந்து உள்தள்ளல் எழுத்துக்களை அகற்றவும். எண் கொடுக்கப்பட்டால், முன்னணி N எழுத்துகள் அகற்றப்படும். எந்த வாதமும் வழங்கப்படாதபோது, ​​அனைத்து பொதுவான முன்னணி உள்தள்ளல் அகற்றப்படும் (:func:`textwrap.dedent` ஐப் பயன்படுத்தி).

source: Expand tabs to N spaces.
ta: N இடைவெளிகளுக்கு தாவல்களை விரிவாக்கவும்.

source: Explicitly specify the encoding of the file. This overwrites the default encoding (UTF-8). For example:
ta: கோப்பின் குறியாக்கத்தை வெளிப்படையாகக் குறிப்பிடவும். இது இயல்பு குறியாக்கத்தை மேலெழுதுகிறது (UTF-8). உதாரணமாக:

source: Show line numbers alongside the included content. By default, line numbers are counted from 1. This can be changed by the options ``:lineno-start:`` and ``:lineno-match:``.
ta: சேர்க்கப்பட்ட உள்ளடக்கத்துடன் வரி எண்களைக் காட்டு. இயல்பாக, வரி எண்கள் 1 இலிருந்து கணக்கிடப்படும். இதை ``:lineno-start:`` மற்றும் ``:lineno-match:`` விருப்பங்கள் மூலம் மாற்றலாம்.

source: Set line number for the first line to show. If given, this automatically activates ``:linenos:``.
ta: காட்ட வேண்டிய முதல் வரிக்கு வரி எண்ணை அமைக்கவும். கொடுக்கப்பட்டால், இது தானாகவே ``:linenos:`` செயல்படுத்தப்படும்.

source: When including only parts of a file and show the original line numbers. This is only allowed only when the selection consists of contiguous lines.
ta: ஒரு கோப்பின் பகுதிகளை மட்டும் சேர்த்து அசல் வரி எண்களைக் காட்டும்போது. தேர்வானது தொடர்ச்சியான கோடுகளைக் கொண்டிருக்கும் போது மட்டுமே இது அனுமதிக்கப்படும்.

source: Emphasise particular lines of the included content. For example:
ta: சேர்க்கப்பட்ட உள்ளடக்கத்தின் குறிப்பிட்ட வரிகளை வலியுறுத்துங்கள். உதாரணமாக:

source: Select a highlighting language (`Pygments lexer`_) different from the current file's standard language (set by :rst:dir:`highlight` or :confval:`highlight_language`).
ta: தற்போதைய கோப்பின் நிலையான மொழியிலிருந்து (:rst:dir:`highlight` அல்லது :confval:`highlight_language` மூலம் அமைக்கப்பட்ட) ஐலைட் செய்யும் மொழியை (`Pygments lexer`_) தேர்ந்தெடுக்கவும்.

source: Ignore minor errors in highlighting.
ta: முன்னிலைப்படுத்துவதில் உள்ள சிறிய பிழைகளை புறக்கணிக்கவும்.

source: Options for selecting the content to include
ta: சேர்க்க வேண்டிய உள்ளடக்கத்தைத் தேர்ந்தெடுப்பதற்கான விருப்பங்கள்

source: For Python files, only include the specified class, function or method:
ta: பைதான் கோப்புகளுக்கு, குறிப்பிட்ட வகுப்பு, செயல்பாடு அல்லது முறையை மட்டும் உள்ளடக்கவும்:

source: Specify exactly which lines to include::
ta: எந்த வரிகளைச் சேர்க்க வேண்டும் என்பதைக் குறிப்பிடவும்::

source: This includes line 1, line 3, lines 5 to 10, and line 20 to the end.
ta: இதில் வரி 1, வரி 3, வரிகள் 5 முதல் 10 வரை, மற்றும் வரி 20 இறுதி வரை அடங்கும்.

source: Another way to control which part of the file is included is to use the ``start-after`` and ``end-before`` options (or only one of them). If ``start-after`` is given as a string option, only lines that follow the first line containing that string are included. If ``end-before`` is given as a string option, only lines that precede the first lines containing that string are included. The ``start-at`` and ``end-at`` options behave in a similar way, but the lines containing the matched string are included.
ta: கோப்பின் எந்தப் பகுதி சேர்க்கப்பட்டுள்ளது என்பதைக் கட்டுப்படுத்த மற்றொரு வழி ``ச்டார்ட்-ஆஃப்டர்`` மற்றும் `எண்ட்-பெஃபோர்`` விருப்பங்களைப் பயன்படுத்துவதாகும் (அல்லது அவற்றில் ஒன்று மட்டும்). ``ச்டார்ட்-ஆஃப்டர்`` என்பது சரம் விருப்பமாக வழங்கப்பட்டால், அந்த சரம் கொண்ட முதல் வரியைப் பின்தொடரும் வரிகள் மட்டுமே சேர்க்கப்படும். ``end-before`` ஒரு சரம் விருப்பமாக வழங்கப்பட்டால், அந்த சரம் கொண்ட முதல் வரிகளுக்கு முந்தைய வரிகள் மட்டுமே சேர்க்கப்படும். ``ச்டார்ட்-அட்` மற்றும் ``எண்ட்-அட்`` விருப்பங்கள் ஒரே மாதிரியாகவே செயல்படுகின்றன, ஆனால் பொருந்திய சரம் உள்ள கோடுகள் சேர்க்கப்பட்டுள்ளன.
