Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_extdev--utils_*.po
Languages: ta

source: Utilities
ta: பயன்பாடுகள்

source: Sphinx provides utility classes and functions to develop extensions.
ta: நீட்டிப்புகளை உருவாக்க SPHINX பயன்பாட்டு வகுப்புகள் மற்றும் செயல்பாடுகளை வழங்குகிறது.

source: Base classes for components
ta: கூறுகளுக்கான அடிப்படை வகுப்புகள்

source: These base classes are useful to allow your extensions to obtain Sphinx components (e.g. :class:`.Config`, :class:`.BuildEnvironment` and so on) easily.
ta: உங்கள் நீட்டிப்புகளை ஸ்பிங்க்ஸ் கூறுகளைப் பெற அனுமதிக்க இந்த அடிப்படை வகுப்புகள் பயனுள்ளதாக இருக்கும் (எ.கா.: வகுப்பு: `.கான்பிக்`,: வகுப்பு:` .பிலென்டென்டுமென்ட்` மற்றும் பல).

source: The subclasses of them might not work with bare docutils because they are strongly coupled with Sphinx.
ta: அவற்றின் துணைப்பிரிவுகள் வெற்று ஆவணங்களுடன் வேலை செய்யாது, ஏனெனில் அவை ஸ்பிங்க்ஸுடன் வலுவாக இணைக்கப்பட்டுள்ளன.

source: A base class of Transforms.
ta: உருமாற்றங்களின் அடிப்படை வகுப்பு.

source: Compared with ``docutils.transforms.Transform``, this class improves accessibility to Sphinx APIs.
ta: `` Docutils.transforms.transform`` உடன் ஒப்பிடும்போது, இந்த வகுப்பு SPHINX API களுக்கான அணுகலை மேம்படுத்துகிறது.

source: Reference to the :class:`.Sphinx` object.
ta: குறிப்பு: வகுப்பு: `.sphinx` பொருள்.

source: Reference to the :class:`.Config` object.
ta: குறிப்பு: வகுப்பு: `.கான்ஃபிக்` பொருள்.

source: Reference to the :class:`.BuildEnvironment` object.
ta: குறிப்பு: வகுப்பு: `.பிலென்டென்டர்மென்ட்` பொருள்.

source: A base class of post-transforms.
ta: பிந்தைய மாற்றங்களின் அடிப்படை வகுப்பு.

source: Post transforms are invoked to modify the document to restructure it for outputting. They resolve references, convert images, do special transformation for each output formats and so on. This class helps to implement these post transforms.
ta: வெளியீட்டிற்கு மறுசீரமைக்க ஆவணத்தை மாற்றியமைக்க இடுகை மாற்றங்கள் செயல்படுத்தப்படுகின்றன. அவை குறிப்புகளைத் தீர்க்கின்றன, படங்களை மாற்றுகின்றன, ஒவ்வொரு வெளியீட்டு வடிவங்களுக்கும் சிறப்பு மாற்றங்களைச் செய்கின்றன. இந்த இடுகை மாற்றங்களை செயல்படுத்த இந்த வகுப்பு உதவுகிறது.

source: Override to apply the transform to the document tree.
ta: ஆவண மரத்திற்கு மாற்றத்தைப் பயன்படுத்த மேலெழுதவும்.

source: Check this transform working for current builder.
ta: தற்போதைய பில்டருக்கு இந்த உருமாற்றத்தை சரிபார்க்கவும்.

source: Main method of post transforms.
ta: இடுகை மாற்றங்களின் முக்கிய முறை.

source: Subclasses should override this method instead of ``apply()``.
ta: `` விண்ணப்பிக்கவும் () `` என்பதற்குப் பதிலாக துணைப்பிரிவுகள் இந்த முறையை மேலெழுத வேண்டும்.

source: A base class for Sphinx directives.
ta: ஸ்பின்க்ஸ் வழிமுறைகளுக்கான அடிப்படை வகுப்பு.

source: This class provides helper methods for Sphinx directives.
ta: இந்த வகுப்பு SPHINX வழிமுறைகளுக்கு உதவி முறைகளை வழங்குகிறது.

source: The subclasses of this class might not work with docutils. This class is strongly coupled with Sphinx.
ta: இந்த வகுப்பின் துணைப்பிரிவுகள் ஆவணங்களுடன் வேலை செய்யாது. இந்த வகுப்பு ஸ்பிங்க்ஸுடன் வலுவாக இணைக்கப்பட்டுள்ளது.

source: Get current location info for logging.
ta: உள்நுழைவதற்கு தற்போதைய இருப்பிட தகவலைப் பெறுங்கள்.

source: Get source and line number.
ta: மூல மற்றும் வரி எண்ணைப் பெறுங்கள்.

source: Parse the directive's content into nodes.
ta: கட்டளையின் உள்ளடக்கத்தை முனைகளாக அலசவும்.

source: Parameters
ta: அளவுருக்கள்

source: Are titles (sections) allowed in the directive's content? Note that this option bypasses Docutils' usual checks on doctree structure, and misuse of this option can lead to an incoherent doctree. In Docutils, section nodes should only be children of ``Structural`` nodes, which includes ``document``, ``section``, and ``sidebar`` nodes.
ta: கட்டளையின் உள்ளடக்கத்தில் தலைப்புகள் (பிரிவுகள்) அனுமதிக்கப்படுமா? இந்த விருப்பம் டாக்ட்ரீ கட்டமைப்பில் Docutils இன் வழக்கமான சோதனைகளைத் தவிர்க்கிறது என்பதை நினைவில் கொள்ளவும், மேலும் இந்த விருப்பத்தை தவறாகப் பயன்படுத்துவது ஒரு பொருத்தமற்ற கோட்பாட்டிற்கு வழிவகுக்கும். ஆவணங்களில், பிரிவு முனைகள் ``ஆவணம்``, ``பிரிவு`` மற்றும் ``சைட்பார்`` முனைகளை உள்ளடக்கிய `` கட்டமைப்பு`` முனைகளின் குழந்தைகளாக மட்டுமே இருக்க வேண்டும்.

source: Parse *text* as inline elements.
ta: இன்லைன் கூறுகளாக *உரை* பாகுபடுத்தவும்.

source: The text to parse, which should be a single line or paragraph. This cannot contain any structural elements (headings, transitions, directives, etc).
ta: அலச வேண்டிய உரை, இது ஒரு வரி அல்லது பத்தியாக இருக்க வேண்டும். இதில் எந்த கட்டமைப்பு கூறுகளும் இருக்கக்கூடாது (தலைப்புகள், மாற்றங்கள், உத்தரவுகள் போன்றவை).

source: The line number where the interpreted text begins.
ta: விளக்கப்பட்ட உரை தொடங்கும் வரி எண்.

source: Returns
ta: வருமானம்

source: A list of nodes (text and inline elements) and a list of system_messages.
ta: முனைகளின் பட்டியல் (உரை மற்றும் இன்லைன் கூறுகள்) மற்றும் system_messages பட்டியல்.

source: Parse *text* into nodes.
ta: *உரை* முனைகளாக அலசவும்.

source: Text, in string form. ``StringList`` is also accepted.
ta: உரை, இருந்து சரத்தில். ``ச்ட்ரிங் லிச்ட்`` கூட ஏற்றுக்கொள்ளப்பட்டது.

source: Are titles (sections) allowed in *text*? Note that this option bypasses Docutils' usual checks on doctree structure, and misuse of this option can lead to an incoherent doctree. In Docutils, section nodes should only be children of ``Structural`` nodes, which includes ``document``, ``section``, and ``sidebar`` nodes.
ta: *உரையில்* தலைப்புகள் (பிரிவுகள்) அனுமதிக்கப்படுமா? இந்த விருப்பம் டாக்ட்ரீ கட்டமைப்பில் Docutils இன் வழக்கமான சோதனைகளைத் தவிர்க்கிறது என்பதை நினைவில் கொள்ளவும், மேலும் இந்த விருப்பத்தை தவறாகப் பயன்படுத்துவது ஒரு பொருத்தமற்ற கோட்பாட்டிற்கு வழிவகுக்கும். ஆவணங்களில், பிரிவு முனைகள் ``ஆவணம்``, ``பிரிவு`` மற்றும் ``சைட்பார்`` முனைகளை உள்ளடக்கிய `` கட்டமைப்பு`` முனைகளின் குழந்தைகளாக மட்டுமே இருக்க வேண்டும்.

source: The offset of the content.
ta: உள்ளடக்கத்தின் ஆஃப்செட்.

source: Set source and line number to the node.
ta: மூலத்தையும் வரி எண்ணையும் முனைக்கு அமைக்கவும்.

source: A base class for Sphinx roles.
ta: ஸ்பின்க்ஸ் பாத்திரங்களுக்கான அடிப்படை வகுப்பு.

source: This class provides helper methods for Sphinx roles.
ta: இந்த வகுப்பு ஸ்பிங்க்ஸ் பாத்திரங்களுக்கு உதவி முறைகளை வழங்குகிறது.

source: A list of strings, the directive content for customisation (from the "role" directive).
ta: சரங்களின் பட்டியல், தனிப்பயனாக்கலுக்கான உத்தரவு உள்ளடக்கம் ("பங்கு" உத்தரவிலிருந்து).

source: The ``docutils.parsers.rst.states.Inliner`` object.
ta: `` Docutils.parsers.rst.states.inliner`` பொருள்.

source: The role name actually used in the document.
ta: ஆவணத்தில் உண்மையில் பயன்படுத்தப்படும் பங்கு பெயர்.

source: A dictionary of directive options for customisation (from the "role" directive).
ta: தனிப்பயனாக்கலுக்கான உத்தரவு விருப்பங்களின் அகராதி ("பங்கு" உத்தரவிலிருந்து).

source: A string containing the entire interpreted text input.
ta: முழு விளக்கப்பட்ட உரை உள்ளீட்டைக் கொண்ட ஒரு சரம்.

source: The interpreted text content.
ta: விளக்கப்பட்ட உரை உள்ளடக்கம்.

source: A base class for reference roles.
ta: குறிப்பு பாத்திரங்களுக்கான அடிப்படை வகுப்பு.

source: The reference roles can accept ``link title <target>`` style as a text for the role. The parsed result; link title and target will be stored to ``self.title`` and ``self.target``.
ta: குறிப்பு பாத்திரங்கள் `` இணைப்பு தலைப்பு <இலக்கு> `` பாணியை பாத்திரத்திற்கான உரையாக ஏற்றுக்கொள்ளலாம். பாகுபடுத்தப்பட்ட முடிவு; இணைப்பு தலைப்பு மற்றும் இலக்கு `` self.title`` மற்றும் `` self.target`` க்கு சேமிக்கப்படும்.

source: A boolean indicates the reference is disabled.
ta: ஒரு பூலியன் குறிப்பு முடக்கப்பட்டிருப்பதைக் குறிக்கிறது.

source: A boolean indicates the role has explicit title or not.
ta: ஒரு பூலியன் இந்த பாத்திரத்திற்கு வெளிப்படையான தலைப்பு இருக்கிறதா இல்லையா என்பதைக் குறிக்கிறது.

source: The link target for the interpreted text.
ta: விளக்கப்பட்ட உரைக்கான இணைப்பு இலக்கு.

source: The link title for the interpreted text.
ta: விளக்கப்பட்ட உரைக்கான இணைப்பு தலைப்பு.

source: A base class for image converters.
ta: பட மாற்றிகளுக்கான அடிப்படை வகுப்பு.

source: An image converter is kind of Docutils transform module. It is used to convert image files which are not supported by a builder to the appropriate format for that builder.
ta: ஒரு பட மாற்றி என்பது ஒரு வகையான ஆவணங்கள் உருமாறும் தொகுதி. ஒரு பில்டரால் ஆதரிக்கப்படாத படக் கோப்புகளை அந்த பில்டருக்கு பொருத்தமான வடிவத்திற்கு மாற்ற இது பயன்படுகிறது.

source: For example, :py:class:`LaTeX builder <.LaTeXBuilder>` supports PDF, PNG and JPEG as image formats. However it does not support SVG images. For such case, using image converters allows to embed these unsupported images into the document. One of the image converters; :ref:`sphinx.ext.imgconverter <sphinx.ext.imgconverter>` can convert a SVG image to PNG format using Imagemagick internally.
ta: எடுத்துக்காட்டாக,: PY: வகுப்பு: `லேடெக்ஸ் பில்டர் <.லேட்எக்ஸ் பில்டர்>` பி.டி.எஃப், பி.என்.ஜி மற்றும் ஜே.பி.ஜி. இருப்பினும் இது எஸ்.வி.ஜி படங்களை ஆதரிக்காது. அத்தகைய சந்தர்ப்பத்தில், பட மாற்றிகளைப் பயன்படுத்துவது இந்த ஆதரிக்கப்படாத படங்களை ஆவணத்தில் உட்பொதிக்க அனுமதிக்கிறது. பட மாற்றிகளில் ஒன்று; .

source: There are three steps to make your custom image converter:
ta: உங்கள் தனிப்பயன் பட மாற்றியை உருவாக்க மூன்று படிகள் உள்ளன:

source: Make a subclass of ``ImageConverter`` class
ta: `` ImageConverter`` வகுப்பின் துணைப்பிரிவை உருவாக்கவும்

source: Override ``conversion_rules``, ``is_available()`` and ``convert()``
ta: `` Converty_Rules``, `` `is_available ()` `` மற்றும் `` மாற்றவும் () ``

source: Register your image converter to Sphinx using :py:meth:`.Sphinx.add_post_transform`
ta: உங்கள் பட மாற்றியை SPHINX க்கு பதிவுசெய்க: py: meth: `.sphinx.add_post_transform`

source: Convert an image file to the expected format.
ta: ஒரு படக் கோப்பை எதிர்பார்த்த வடிவத்திற்கு மாற்றவும்.

source: *_from* is a path of the source image file, and *_to* is a path of the destination file.
ta: * _from* என்பது மூல படக் கோப்பின் பாதை, மற்றும்* _to* என்பது இலக்கு கோப்பின் பாதை.

source: Return the image converter is available or not.
ta: திரும்ப பட மாற்றி கிடைக்குமா இல்லையா.

source: The converter is available or not. Will be filled at the first call of the build. The result is shared in the same process.
ta: மாற்றி கிடைக்கிறது அல்லது இல்லை. கட்டமைப்பின் முதல் அழைப்பில் நிரப்பப்படும். இதன் விளைவாக அதே செயல்பாட்டில் பகிரப்படுகிறது.

source: Todo
ta: செய்யவேண்டிய

source: This should be refactored not to store the state without class variable.
ta: வகுப்பு மாறி இல்லாமல் மாநிலத்தை சேமிக்கக்கூடாது என்று இது மறுசீரமைக்கப்பட வேண்டும்.

source: A conversion rules the image converter supports. It is represented as a list of pair of source image format (mimetype) and destination one::
ta: ஒரு மாற்று பட மாற்றி ஆதரிக்கும் விதிகள். இது மூல பட வடிவமைப்பு (MIMETYPE) மற்றும் இலக்கு ஒன்று: ஜோடி பட்டியலில் குறிப்பிடப்படுகிறது ::

source: Numerical priority of this transform, 0 through 999 (override).
ta: இந்த மாற்றத்தின் எண் முன்னுரிமை, 0 முதல் 999 வரை (மேலெழுத).

source: Utility functions
ta: பயன்பாட்டு செயல்பாடுகள்

source: The state machine state. Must be a subclass of ``RSTState``.
ta: அரசு இயந்திர நிலை. ``RSTSstate`` இன் துணைப்பிரிவாக இருக்க வேண்டும்.

source: The text's source, used when creating a new ``StringList``.
ta: புதிய ``ச்ட்ரிங்லிச்ட்`` ஐ உருவாக்கும் போது பயன்படுத்தப்படும் உரையின் சான்று.

source: Are titles (sections) allowed in *text*? Note that this option bypasses Docutils' usual checks on doctree structure, and misuse of this option can lead to an incoherent doctree. In Docutils, section nodes should only be children of ``document`` or ``section`` nodes.
ta: *உரையில்* தலைப்புகள் (பிரிவுகள்) அனுமதிக்கப்படுமா? இந்த விருப்பம் டாக்ட்ரீ கட்டமைப்பில் Docutils இன் வழக்கமான சரிபார்ப்புகளைத் தவிர்க்கிறது என்பதை நினைவில் கொள்ளவும், மேலும் இந்த விருப்பத்தை தவறாகப் பயன்படுத்துவது ஒரு பொருத்தமற்ற கோட்பாட்டிற்கு வழிவகுக்கும். ஆவணங்களில், பிரிவு முனைகள் ``ஆவணம்`` அல்லது ``பிரிவு`` முனைகளின் குழந்தைகளாக மட்டுமே இருக்க வேண்டும்.

source: If this is False (the default), then *content* is parsed as if it were an independent document, meaning that title decorations (e.g. underlines) do not need to match the surrounding document. This is useful when the parsed content comes from a completely different context, such as docstrings. If this is True, then title underlines must match those in the surrounding document, otherwise the behaviour is undefined. Warning: Up to Docutils 0.21, sections with a decoration style matching a level that is higher than the current section level are silently discarded! Since Docutils 0.22.1, an error is reported.
ta: இது தவறு (இயல்புநிலை) எனில், *உள்ளடக்கம்* ஒரு சுயாதீன ஆவணம் போல் பாகுபடுத்தப்படும், அதாவது தலைப்பு அலங்காரங்கள் (எ.கா. அடிக்கோடுகள்) சுற்றியுள்ள ஆவணத்துடன் பொருந்த வேண்டிய அவசியமில்லை. பாகுபடுத்தப்பட்ட உள்ளடக்கம் docstrings போன்ற முற்றிலும் வேறுபட்ட சூழலில் இருந்து வரும்போது இது பயனுள்ளதாக இருக்கும். இது உண்மை எனில், தலைப்பு அடிக்கோடுகள் சுற்றியுள்ள ஆவணத்துடன் பொருந்த வேண்டும், இல்லையெனில் நடத்தை வரையறுக்கப்படவில்லை. எச்சரிக்கை: Docutils 0.21 வரை, தற்போதைய பிரிவு அளவை விட அதிகமாக இருக்கும் நிலைக்கு பொருந்தும் அலங்கார பாணியுடன் கூடிய பிரிவுகள் அமைதியாக நிராகரிக்கப்படும்! ஆவணங்கள் 0.22.1 என்பதால், ஒரு பிழை பதிவாகியுள்ளது.

source: If this is False (the default), then *content* is parsed as if it were an independent document, meaning that title decorations (e.g. underlines) do not need to match the surrounding document. This is useful when the parsed content comes from a completely different context, such as docstrings. If this is True, then title underlines must match those in the surrounding document, otherwise the behaviour is undefined.
ta: இது தவறு (இயல்புநிலை) எனில், *உள்ளடக்கம்* ஒரு சுயாதீன ஆவணம் போல் பாகுபடுத்தப்படும், அதாவது தலைப்பு அலங்காரங்கள் (எ.கா. அடிக்கோடுகள்) சுற்றியுள்ள ஆவணத்துடன் பொருந்த வேண்டிய அவசியமில்லை. பாகுபடுத்தப்பட்ட உள்ளடக்கம் docstrings போன்ற முற்றிலும் வேறுபட்ட சூழலில் இருந்து வரும்போது இது பயனுள்ளதாக இருக்கும். இது உண்மை எனில், தலைப்பு அடிக்கோடுகள் சுற்றியுள்ள ஆவணத்துடன் பொருந்த வேண்டும், இல்லையெனில் நடத்தை வரையறுக்கப்படவில்லை.

source: Warning: Up to Docutils 0.21, sections with a decoration style matching a level that is higher than the current section level are silently discarded! Since Docutils 0.22.1, an error is reported.
ta: எச்சரிக்கை: Docutils 0.21 வரை, தற்போதைய பிரிவு அளவை விட அதிகமாக இருக்கும் நிலைக்கு பொருந்தும் அலங்கார பாணியுடன் கூடிய பிரிவுகள் அமைதியாக நிராகரிக்கப்படும்! ஆவணங்கள் 0.22.1 என்பதால், ஒரு பிழை பதிவாகியுள்ளது.

source: Utility types
ta: பயன்பாட்டு வகைகள்

source: The metadata returned by an extension's ``setup()`` function.
ta: நீட்டிப்பின் ``அமைவு()`` செயல்பாட்டின் மூலம் மேனிலை தரவு வழங்கப்பட்டது.

source: See :ref:`ext-metadata`.
ta: பார்க்க :ref:`ext-metadata`.

source: An integer that identifies the version of env data added by the extension.
ta: நீட்டிப்பால் சேர்க்கப்பட்ட env தரவின் பதிப்பை அடையாளம் காணும் முழு எண்.

source: Indicate whether parallel reading of source files is supported by the extension.
ta: மூலக் கோப்புகளின் இணையான வாசிப்பு நீட்டிப்பு மூலம் ஆதரிக்கப்படுகிறதா என்பதைக் குறிப்பிடவும்.

source: Indicate whether parallel writing of output files is supported by the extension (default: ``True``).
ta: வெளியீட்டு கோப்புகளின் இணையான எழுத்து நீட்டிப்பு மூலம் ஆதரிக்கப்படுகிறதா என்பதைக் குறிப்பிடவும் (இயல்புநிலை: ``உண்மை``).

source: The extension version (default: ``'unknown version'``).
ta: நீட்டிப்பு பதிப்பு (இயல்புநிலை: ``'தெரியாத பதிப்பு''`).
