Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_changes--7_1_*.po
Languages: ta

source: Sphinx 7.1
ta: சூரரிமாச்சிலை 7.1

source: Release 7.1.2 (released Aug 02, 2023)
ta: வெளியீடு 7.1.2 (ஆகஸ்ட் 02, 2023 இல் வெளியிடப்பட்டது)

source: Bugs fixed
ta: பிழைகள் சரி செய்யப்பட்டன

source: #11542: linkcheck: Properly respect :confval:`linkcheck_anchors` and do not spuriously report failures to validate anchors. Patch by James Addison.
ta: #11542: linkcheck: சரியாக மதிக்கவும் :confval:`linkcheck_anchors` மற்றும் அறிவிப்பாளர்களை சரிபார்க்க தோல்விகளை போலியாக தெரிவிக்க வேண்டாம். சேம்ச் அடிசன் எழுதிய ஒட்டு.

source: Release 7.1.1 (released Jul 27, 2023)
ta: வெளியீடு 7.1.1 (ஜூலை 27, 2023 வெளியிடப்பட்டது)

source: #11514: Fix ``SOURCE_DATE_EPOCH`` in multi-line copyright footer. Patch by Bénédikt Tran.
ta: #11514: பல வரி பதிப்புரிமை அடிக்குறிப்பில் ``SOURCE_DATE_EPOCH`` ஐ சரிசெய்யவும். பெனடிக்ட் டிரான் எழுதிய ஒட்டு.

source: Release 7.1.0 (released Jul 24, 2023)
ta: வெளியீடு 7.1.0 (ஜூலை 24, 2023 வெளியிடப்பட்டது)

source: Incompatible changes
ta: பொருந்தாத மாற்றங்கள்

source: Releases are no longer signed, given the `change in PyPI policy`_.
ta: வெளியீடுகள் இனி கையொப்பமிடப்படாது, `பைபி கொள்கையில் மாற்றம்`_.

source: Deprecated
ta: மதிப்பிடப்பட்டது

source: #11412: Emit warnings on using a deprecated Python-specific index entry type (namely, ``module``, ``keyword``, ``operator``, ``object``, ``exception``, ``statement``, and ``builtin``) in the :rst:dir:`index` directive, and set the removal version to Sphinx 9. Patch by Adam Turner.
ta: #11412: விலக்கப்பட்ட பைதான்-குறிப்பிட்ட குறியீட்டு உள்ளீடு வகையைப் பயன்படுத்துவதற்கான எச்சரிக்கைகளை வெளியிடவும் (அதாவது, ``தொகுதி``, ``திறவுச்சொல்``, ``ஆபரேட்டர்``, ``பொருள்``, ``விதிவிலக்கு``, ``ச்டேட்மென்ட்`` மற்றும் `பில்டின்```, மற்றும் `பில்டின்`` நேரடியாக அகற்றப்பட்ட பதிப்பில்: சூரரிமாச்சிலை 9. ஆடம் டர்னரின் ஒட்டு.

source: Features added
ta: அம்சங்கள் சேர்க்கப்பட்டன

source: #11415: Add a checksum to JavaScript and CSS asset URIs included within generated HTML, using the CRC32 algorithm.
ta: #11415: CRC32 அல்காரிதத்தைப் பயன்படுத்தி உருவாக்கப்பட்ட உஉகுமொ இல் சேர்க்கப்பட்டுள்ள சாவாகைஉரை மற்றும் சிஎச்எச் சொத்து URIகளில் செக்சம் சேர்க்கவும்.

source: :meth:`~sphinx.application.Sphinx.require_sphinx` now allows the version requirement to be specified as ``(major, minor)``.
ta: :meth:`~sphinx.application.Sphinx.require_sphinx` இப்போது பதிப்புத் தேவையை ``(பெரிய, சிறிய)`` எனக் குறிப்பிட அனுமதிக்கிறது.

source: #11011: Allow configuring a line-length limit for object signatures, via :confval:`maximum_signature_line_length` and the domain-specific variants. If the length of the signature (in characters) is greater than the configured limit, each parameter in the signature will be split to its own logical line. This behaviour may also be controlled by options on object description directives, for example :rst:dir:`py:function:single-line-parameter-list`. Patch by Thomas Louf, Adam Turner, and Jean-François B.
ta: #11011: :confval:`maximum_signature_line_length` மற்றும் டொமைன் சார்ந்த மாறுபாடுகள் வழியாக, பொருள் கையொப்பங்களுக்கான வரி-நீள வரம்பை உள்ளமைக்க அனுமதிக்கவும். கையொப்பத்தின் நீளம் (எழுத்துக்களில்) உள்ளமைக்கப்பட்ட வரம்பை விட அதிகமாக இருந்தால், கையொப்பத்தில் உள்ள ஒவ்வொரு அளவுருவும் அதன் சொந்த தருக்கக் கோட்டிற்குப் பிரிக்கப்படும். இந்த நடத்தை ஆப்செக்ட் விளக்க உத்தரவுகளின் விருப்பங்களால் கட்டுப்படுத்தப்படலாம், எடுத்துக்காட்டாக :rst:dir:`py:function:single-line-parameter-list`. தாமச் லூஃப், ஆடம் டர்னர் மற்றும் சீன்-பிரான்கோயிச் பி ஆகியோரின் ஒட்டு.

source: #10983: Support for multiline copyright statements in the footer block. Patch by Stefanie Molin
ta: #10983: அடிக்குறிப்பு தொகுதியில் பல வரி பதிப்புரிமை அறிக்கைகளுக்கான உதவி. ச்டெபானி மோலின் மூலம் ஒட்டு

source: ``sphinx.util.display.status_iterator`` now clears the current line with ANSI control codes, rather than overprinting with space characters.
ta: `` sphinx.util.display.status_iterator`` இப்போது விண்வெளி எழுத்துக்களுடன் அதிக அச்சிடுவதை விட, ANSI கட்டுப்பாட்டு குறியீடுகளுடன் தற்போதைய வரியை இப்போது அழிக்கிறது.

source: #11431: linkcheck: Treat SSL failures as broken links. Patch by James Addison.
ta: #11431: இணைப்புச் சரிபார்ப்பு: SSL தோல்விகளை உடைந்த இணைப்புகளாகக் கருதுங்கள். சேம்ச் அடிசன் எழுதிய ஒட்டு.

source: #11157: Keep the ``translated`` attribute on translated nodes.
ta: #11157: மொழிபெயர்க்கப்பட்ட முனைகளில் ``மொழிபெயர்க்கப்பட்ட`` பண்புக்கூறை வைத்திருங்கள்.

source: #11451: Improve the traceback displayed when using :option:`sphinx-build -T` in parallel builds. Patch by Bénédikt Tran
ta: #11451: இணை கட்டமைப்பில் :option:`sphinx-build -T` ஐப் பயன்படுத்தும் போது காண்பிக்கப்படும் ட்ரேச்பேக்கை மேம்படுத்தவும். பெனடிக்ட் டிரான் எழுதிய ஒட்டு

source: #11324: linkcheck: Use session-basd HTTP requests.
ta: #11324: இணைப்புச் சரிபார்ப்பு: அமர்வு-அடிப்படை HTTP கோரிக்கைகளைப் பயன்படுத்தவும்.

source: #11438: Add support for the :rst:dir:`py:class` and :rst:dir:`py:function` directives for PEP 695 (generic classes and functions declarations) and PEP 696 (default type parameters). Multi-line support (#11011) is enabled for type parameters list and can be locally controlled on object description directives, e.g., :rst:dir:`py:function:single-line-type-parameter-list`. Patch by Bénédikt Tran.
ta: #11438: PEP 695 (பொது வகுப்புகள் மற்றும் செயல்பாடுகள் அறிவிப்புகள்) மற்றும் PEP 696 (இயல்புநிலை வகை அளவுருக்கள்) க்கான :rst:dir:`py:class` மற்றும் :rst:dir:`py:function` வழிமுறைகளுக்கு ஆதரவைச் சேர்க்கவும். வகை அளவுருக்கள் பட்டியலுக்கு பல-வரி உதவி (#11011) இயக்கப்பட்டது மற்றும் பொருள் விளக்க உத்தரவுகளில் உள்நாட்டில் கட்டுப்படுத்தப்படலாம், எ.கா., :rst:dir:`py:function:single-line-type-parameter-list`. பெனடிக்ட் டிரான் எழுதிய ஒட்டு.

source: #11484: linkcheck: Allow HTML anchors to be ignored on a per-URL basis via :confval:`linkcheck_anchors_ignore_for_url` while still checking the validity of the page itself. Patch by Bénédikt Tran
ta: #11484: இணைப்புச் சரிபார்ப்பு: பக்கத்தின் செல்லுபடியை சரிபார்க்கும் போது :confval:`linkcheck_anchors_ignore_for_url` வழியாக ஒவ்வொரு முகவரி அடிப்படையில் உஉகுமொ ஆங்கர்களை புறக்கணிக்க அனுமதிக்கவும். பெனடிக்ட் டிரான் எழுதிய ஒட்டு

source: #1246: Add translation progress statistics and inspection support, via a new substitution (``|translation progress|``) and a new configuration variable (:confval:`translation_progress_classes`). These enable determining the percentage of translated elements within a document, and the remaining translated and untranslated elements.
ta: #1246: புதிய மாற்றீடு (``|மொழிபெயர்ப்பு முன்னேற்றம்|``) மற்றும் ஒரு புதிய உள்ளமைவு மாறி (:confval:`translation_progress_classes`) மூலம் மொழிபெயர்ப்பு முன்னேற்றப் புள்ளிவிவரங்கள் மற்றும் ஆய்வு ஆதரவைச் சேர்க்கவும். ஒரு ஆவணத்தில் மொழிபெயர்க்கப்பட்ட கூறுகளின் சதவீதத்தையும், மீதமுள்ள மொழிபெயர்க்கப்பட்ட மற்றும் மொழிபெயர்க்கப்படாத கூறுகளையும் இவை தீர்மானிக்கின்றன.

source: Restored the ``footnote-reference`` class that has been removed in the latest (unreleased) version of Docutils.
ta: ஆவணங்களின் சமீபத்திய (வெளியிடப்படாத) பதிப்பில் அகற்றப்பட்ட `` அடிக்குறிப்பு-குறிப்பு`` வகுப்பை மீட்டெடுத்தது.

source: #11486: Use :rfc:`8081` font file MIME types in the EPUB builder. Using the correct MIME type will prevent warnings from ``epubcheck`` and will generate a valid EPUB.
ta: #11486: EPUB பில்டரில் :rfc:`8081` எழுத்துரு கோப்பு MIME வகைகளைப் பயன்படுத்தவும். சரியான MIME வகையைப் பயன்படுத்துவது ``epubcheck`` இலிருந்து எச்சரிக்கைகளைத் தடுக்கும் மற்றும் சரியான EPUB ஐ உருவாக்கும்.

source: #11435: Use microsecond-resolution timestamps for outdated file detection in ``BuildEnvironment.get_outdated_files``.
ta: #11435: ``BuildEnvironment.get_outdated_files`` இல் காலாவதியான கோப்பைக் கண்டறிய மைக்ரோ செகண்ட்-ரெசல்யூசன் நேர முத்திரைகளைப் பயன்படுத்தவும்.

source: #11437: Top-level headings starting with a reStructuredText role now render properly when :confval:`rst_prolog` is set. Previously, a file starting with the below would have improperly rendered due to where the prologue text was inserted into the document.
ta: #11437: மறுசீரமைக்கப்பட்ட உரைப் பாத்திரத்துடன் தொடங்கும் மேல்-நிலை தலைப்புகள் இப்போது :confval:`rst_prolog` அமைக்கப்படும்போது சரியாக வழங்கப்படுகின்றன. முன்னதாக, ஆவணத்தில் முன்னுரை உரை செருகப்பட்டதன் காரணமாக, கீழே உள்ள கோப்புடன் தொடங்கும் கோப்பு முறையற்ற முறையில் வழங்குதல் செய்யப்பட்டிருக்கும்.

source: Patch by Bénédikt Tran.
ta: பேட்ச் வழங்கிய பேட்ச் டிரான்.

source: #11337: Fix a ``MemoryError`` in ``sphinx.ext.intersphinx`` when using ``None`` or ``typing.*`` as inline type references. Patch by Bénédikt Tran (picnixz)
ta: #11337: இன்லைன் வகை குறிப்புகளாக ``ஒன்று`` அல்லது ``டைப்பிங்.*`` ஐப் பயன்படுத்தும் போது ``sphinx.ext.intersphinx`` இல் ``MemoryError`` ஐ சரிசெய்யவும். ஒட்டு - பெனெடிக்ட் டிரான் (பிக்னிக்ச்)

source: Testing
ta: சோதனை

source: #11345: Always delete ``docutils.conf`` in test directories when running ``SphinxTestApp.cleanup()``.
ta: #11345: ``SphinxTestApp.cleanup()`` ஐ இயக்கும்போது சோதனை கோப்பகங்களில் எப்போதும் ``docutils.conf`` ஐ நீக்கவும்.
