Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_invocation_*.po
Languages: ta

source: Enable `sphinx.ext.coverage` extension.
ta: `sphinx.ext.coverage` நீட்டிப்பை இயக்கவும்.

source: Enable `sphinx.ext.imgmath` extension.
ta: `sphinx.ext.imgmath` நீட்டிப்பை இயக்கு.

source: Enable `sphinx.ext.mathjax` extension.
ta: `sphinx.ext.mathjax` நீட்டிப்பை இயக்கவும்.

source: Enable `sphinx.ext.ifconfig` extension.
ta: `sphinx.ext.ifconfig` நீட்டிப்பை இயக்கவும்.

source: Enable `sphinx.ext.viewcode` extension.
ta: `sphinx.ext.viewcode` நீட்டிப்பை இயக்கவும்.

source: Enable arbitary extensions.
ta: தன்னிச்சையான நீட்டிப்புகளை இயக்கவும்.

source: Makefile and Batchfile creation options
ta: மேக்ஃபைல் மற்றும் பேட்ச்பைல் உருவாக்கும் விருப்பங்கள்

source: Makefile/make.bat uses (or not use) make-mode. Default is use.
ta: makefile/make.bat பயன்படுத்துகிறது (அல்லது பயன்படுத்தக்கூடாது) மேக்-பயன்முறையை. இயல்புநிலை பயன்படுத்தப்படுகிறது.

source: make-mode is default.
ta: மேக்-மோட் இயல்புநிலை.

source: Create (or not create) makefile.
ta: மேக்ஃபைலை உருவாக்கவும் (அல்லது உருவாக்க வேண்டாம்).

source: Create (or not create) batchfile
ta: தொகுதி கோப்பை உருவாக்கவும் (அல்லது உருவாக்க வேண்டாம்)

source: Add various options for sphinx-quickstart invocation.
ta: sphinx-quickstart அழைப்புக்கு பல்வேறு விருப்பங்களைச் சேர்க்கவும்.

source: Project templating
ta: திட்ட வார்ப்புரு

source: where *projectdir* is the Sphinx documentation set directory in which you want to place. If you omit *projectdir*, files are generated into current directory by default.
ta: * projectdir * என்பது நீங்கள் வைக்க விரும்பும் சூரரிமாச்சிலை ஆவணப்படுத்தல் தொகுப்பு கோப்பகமாகும். நீங்கள் *projectdir *ஐத் தவிர்த்தால், கோப்புகள் இயல்பாக தற்போதைய கோப்பகத்தில் உருவாக்கப்படுகின்றன.

source: Template directory for template files. You can modify the templates of sphinx project files generated by quickstart. Following Jinja2 template files are allowed:
ta: வார்ப்புரு கோப்புகளுக்கான வார்ப்புரு அடைவு. குயிக்ச்டார்ட் உருவாக்கிய சூரரிமாச்சிலை திட்டக் கோப்புகளின் வார்ப்புருக்களை நீங்கள் மாற்றலாம். சின்சா 2 வார்ப்புரு கோப்புகள் அனுமதிக்கப்படுகின்றன:

source: In detail, please refer the system template files Sphinx provides. (sphinx/templates/quickstart)
ta: விரிவாக, தயவுசெய்து சூரரிமாச்சிலை வழங்கும் கணினி வார்ப்புரு கோப்புகளைப் பார்க்கவும். (ச்பின்க்ச்/வார்ப்புருக்கள்/குயிக்ச்டார்ட்)

source: Define a template variable
ta: ஒரு வார்ப்புரு மாறியை வரையறுக்கவும்

source: Project templating options for sphinx-quickstart
ta: sphinx-gouckstart க்கான திட்ட வார்ப்புரு விருப்பங்கள்

source: Invocation of sphinx-build
ta: ச்பிங்க்ச்-கட்டமைப்பின் அழைப்பு

source: The :program:`sphinx-build` script builds a Sphinx documentation set. It is called like this:
ta: தி: புரோகிராம்: `ச்பின்க்ச்-பில்ட்` ச்கிரிப்ட் ஒரு சூரரிமாச்சிலை ஆவணத் தொகுப்பை உருவாக்குகிறது. இது இப்படி அழைக்கப்படுகிறது:

source: where *sourcedir* is the :term:`source directory`, and *builddir* is the directory in which you want to place the built documentation. Most of the time, you don't need to specify any *filenames*.
ta: எங்கே * sourcedir * என்பது: கால: `மூல அடைவு`, மற்றும் * பில்டிர் * என்பது நீங்கள் கட்டப்பட்ட ஆவணங்களை வைக்க விரும்பும் கோப்பகமாகும். பெரும்பாலான நேரங்களில், நீங்கள் எந்த *கோப்பு பெயர்களையும் குறிப்பிட தேவையில்லை.

source: The :program:`sphinx-build` script has several options:
ta: தி: நிரல்: `ச்பின்க்ச்-பில்ட்` ச்கிரிப்டில் பல விருப்பங்கள் உள்ளன:

source: The :program:`sphinx-quickstart` script has several options:
ta: தி: புரோகிராம்: `ச்பின்க்ச்-க்யிக்ச்டார்ட்` ச்கிரிப்டில் பல விருப்பங்கள் உள்ளன:

source: The most important option: it selects a builder. The most common builders are:
ta: மிக முக்கியமான விருப்பம்: இது ஒரு பில்டரைத் தேர்ந்தெடுக்கிறது. மிகவும் பொதுவான கட்டுபவர்கள்:

source: Build HTML pages. This is the default builder.
ta: html பக்கங்களை உருவாக்குங்கள். இது இயல்புநிலை பில்டர்.

source: Build HTML pages, but with a single directory per document. Makes for prettier URLs (no ``.html``) if served from a webserver.
ta: html பக்கங்களை உருவாக்குங்கள், ஆனால் ஒரு ஆவணத்திற்கு ஒரு கோப்பகத்துடன். ஒரு வெப்சர்வரில் இருந்து பணி செய்தால், அழகிய முகவரி களை உருவாக்குகிறது (இல்லை `` .html``).

source: Build a single HTML with the whole content.
ta: முழு உள்ளடக்கத்துடன் ஒரு html ஐ உருவாக்குங்கள்.

source: Build HTML files with additional information for building a documentation collection in one of these formats.
ta: இந்த வடிவங்களில் ஒன்றில் ஆவணப்படுத்தல் சேகரிப்பை உருவாக்க கூடுதல் தகவலுடன் html கோப்புகளை உருவாக்குங்கள்.

source: Build an Apple Help Book. Requires :program:`hiutil` and :program:`codesign`, which are not Open Source and presently only available on Mac OS X 10.6 and higher.
ta: ஆப்பிள் உதவி புத்தகத்தை உருவாக்குங்கள். தேவைப்படுகிறது: நிரல்: `hiutil` மற்றும்: நிரல்:` கோட் டின்`, அவை திறந்த மூலமாக இல்லை, தற்போது மேக் ஓஎச் ஃச் 10.6 மற்றும் அதற்கு மேற்பட்டவை மட்டுமே கிடைக்கின்றன.

source: **applehelp**
ta: ** ஆப்பிள்எல்ப் **

source: Build LaTeX sources that can be compiled to a PDF document using :program:`pdflatex`.
ta: pdf ஆவணத்தில் தொகுக்கக்கூடிய லேடெக்ச் மூலங்களை உருவாக்குங்கள்: நிரல்: `pdflatex`.

source: **latex**
ta: ** லேடெக்ச் **

source: **man**
ta: **ஆண்**

source: Build manual pages in groff format for UNIX systems.
ta: யுனிக்ச் அமைப்புகளுக்கான groff வடிவத்தில் கையேடு பக்கங்களை உருவாக்குங்கள்.

source: Build Texinfo files that can be processed into Info files using :program:`makeinfo`.
ta: பயன்படுத்தும் செய்தி கோப்புகளில் செயலாக்கக்கூடிய டெக்சின்ஃபோ கோப்புகளை உருவாக்குங்கள்: நிரல்: `makeinfo`.

source: **texinfo**
ta: ** டெக்சின்ஃபோ **

source: **text**
ta: ** உரை **

source: Build plain text files.
ta: எளிய உரை கோப்புகளை உருவாக்குங்கள்.

source: **gettext**
ta: ** உரைபெறு **

source: Build gettext-style message catalogs (``.pot`` files).
ta: gettext- பாணி செய்தி பட்டியல்களை உருவாக்குங்கள் (`` .pot` கோப்புகள்).

source: Run all doctests in the documentation, if the :mod:`~sphinx.ext.doctest` extension is enabled.
ta: ஆவணத்தில் உள்ள அனைத்து ஆவணங்களையும் இயக்கவும், இருந்தால்: mod: `~ sphinx.ext.docteast` நீட்டிப்பு இயக்கப்பட்டது.

source: **doctest**
ta: ** டாக்டெச்ட் **

source: **linkcheck**
ta: ** லிங்க்செக் **

source: Check the integrity of all external links.
ta: அனைத்து வெளிப்புற இணைப்புகளின் ஒருமைப்பாட்டை சரிபார்க்கவும்.

source: **xml**
ta: ** எக்ச்எம்எல் **

source: Build Docutils-native XML files.
ta: டாக்யூடில்ச்-சொந்த எக்ச்எம்எல் கோப்புகளை உருவாக்குங்கள்.

source: Build compact pretty-printed "pseudo-XML" files displaying the internal structure of the intermediate document trees.
ta: இடைநிலை ஆவண மரங்களின் உள் கட்டமைப்பைக் காண்பிக்கும் சிறிய-அச்சிடப்பட்ட "போலி-எக்ச்எம்எல்" கோப்புகளை உருவாக்குங்கள்.

source: **pseudoxml**
ta: ** சூடோக்ச்எம்எல் **

source: See :ref:`builders` for a list of all builders shipped with Sphinx. Extensions can add their own builders.
ta: காண்க: குறிப்பு: `பில்டர்கள்` ச்பிங்க்சுடன் அனுப்பப்பட்ட அனைத்து பில்டர்களின் பட்டியலுக்கும். நீட்டிப்புகள் தங்கள் சொந்த பில்டர்களை சேர்க்கலாம்.

source: Quiet mode that will skips interactive wizard to specify options. This option requires `-p`, `-a` and `-v` options.
ta: அமைதியான பயன்முறை விருப்பங்களை குறிப்பிட ஊடாடும் வழிகாட்டியைத் தவிர்க்கும். இந்த விருப்பத்திற்கு `-p`,` -a` மற்றும் `-v` விருப்பங்கள் தேவை.

source: If given, always write all output files. The default is to only write output files for new and changed source files. (This may not apply to all builders.)
ta: வழங்கப்பட்டால், எப்போதும் அனைத்து வெளியீட்டு கோப்புகளையும் எழுதுங்கள். புதிய மற்றும் மாற்றப்பட்ட மூல கோப்புகளுக்கான வெளியீட்டு கோப்புகளை மட்டுமே எழுதுவதே இயல்புநிலை. (இது அனைத்து பில்டர்களுக்கும் பொருந்தாது.)

source: Don't use a saved :term:`environment` (the structure caching all cross-references), but rebuild it completely. The default is to only read and parse source files that are new or have changed since the last run.
ta: சேமித்த ஒரு பயன்படுத்த வேண்டாம்: கால: `சுற்றுச்சூழல்` (அனைத்து குறுக்கு-குறிப்புகளையும் தற்காலிகமாக தேக்கப்படுத்தும் கட்டமைப்பு), ஆனால் அதை முழுமையாக மீண்டும் உருவாக்கவும். இயல்புநிலை என்பது புதிய அல்லது கடைசி ஓட்டத்திலிருந்து மாற்றப்பட்ட மூல கோப்புகளைப் படித்து அலசுவது மட்டுமே.

source: Define the tag *tag*. This is relevant for :rst:dir:`only` directives that only include their content if this tag is set.
ta: குறிச்சொல் *குறிச்சொல் *ஐ வரையறுக்கவும். இது பொருத்தமானது: rst: dir: `இந்த குறிச்சொல் அமைக்கப்பட்டால் மட்டுமே அவற்றின் உள்ளடக்கத்தை உள்ளடக்கிய வழிமுறைகள் மட்டுமே.

source: Since Sphinx has to read and parse all source files before it can write an output file, the parsed source files are cached as "doctree pickles". Normally, these files are put in a directory called :file:`.doctrees` under the build directory; with this option you can select a different cache directory (the doctrees can be shared between all builders).
ta: வெளியீட்டு கோப்பை எழுதுவதற்கு முன்பு அனைத்து மூலக் கோப்புகளையும் சூரரிமாச்சிலை படித்து அலச வேண்டும் என்பதால், பாகுபடுத்தப்பட்ட மூல கோப்புகள் "கோட்பாட்டு ஊறுகாய்" என்று தற்காலிகமாக சேமிக்கப்படுகின்றன. பொதுவாக, இந்த கோப்புகள் ஒரு கோப்பகத்தில் வைக்கப்படுகின்றன: கோப்பு: `.டோக்ட்ரீச்` உருவாக்க கோப்பகத்தின் கீழ்; இந்த விருப்பத்தின் மூலம் நீங்கள் வேறு கேச் கோப்பகத்தைத் தேர்ந்தெடுக்கலாம் (கோட்பாடுகளை அனைத்து பில்டர்களுக்கும் இடையில் பகிரலாம்).

source: Distribute the build over *N* processes in parallel, to make building on multiprocessor machines more effective. Note that not all parts and not all builders of Sphinx can be parallelized.
ta: மல்டிபிராசசர் இயந்திரங்களில் கட்டிடம் மிகவும் பயனுள்ளதாக இருக்க, * n * செயல்முறைகளை இணையாக விநியோகிக்கவும். எல்லா பகுதிகளும், ச்பிங்க்சின் அனைத்து பில்டர்களையும் இணையாக அல்ல என்பதை நினைவில் கொள்க.

source: This option should be considered *experimental*.
ta: இந்த விருப்பத்தை *சோதனை *கருத வேண்டும்.

source: Don't look for the :file:`conf.py` in the source directory, but use the given configuration directory instead. Note that various other files and paths given by configuration values are expected to be relative to the configuration directory, so they will have to be present at this location too.
ta: மூல கோப்பகத்தில்: கோப்பு: `conf.py` ஐத் தேட வேண்டாம், ஆனால் அதற்கு பதிலாக கொடுக்கப்பட்ட உள்ளமைவு கோப்பகத்தைப் பயன்படுத்தவும். உள்ளமைவு மதிப்புகளால் வழங்கப்பட்ட பல்வேறு கோப்புகள் மற்றும் பாதைகள் உள்ளமைவு கோப்பகத்துடன் தொடர்புடையதாக இருக்கும் என்று எதிர்பார்க்கப்படுகிறது, எனவே அவை இந்த இடத்திலும் இருக்க வேண்டும்.

source: Don't look for a configuration file; only take options via the ``-D`` option.
ta: உள்ளமைவு கோப்பைத் தேட வேண்டாம்; `` -d`` விருப்பம் வழியாக மட்டுமே விருப்பங்களை எடுத்துக் கொள்ளுங்கள்.

source: Display usage summary or Sphinx version.
ta: பயன்பாட்டு சுருக்கம் அல்லது சூரரிமாச்சிலை பதிப்பைக் காண்பி.

source: Override a configuration value set in the :file:`conf.py` file. The value must be a number, string, list or dictionary value.
ta: : கோப்பு: `conf.py` கோப்பில் அமைக்கப்பட்ட உள்ளமைவு மதிப்பை மேலெழுதவும். மதிப்பு எண், சரம், பட்டியல் அல்லது அகராதி மதிப்பாக இருக்க வேண்டும்.

source: For lists, you can separate elements with a comma like this: ``-D html_theme_path=path1,path2``.
ta: பட்டியல்களுக்கு, நீங்கள் இதுபோன்ற கமாவுடன் கூறுகளை பிரிக்கலாம்: `` -d html_theme_path = path1, path2``.

source: For dictionary values, supply the setting name and key like this: ``-D latex_elements.docclass=scrartcl``.
ta: அகராதி மதிப்புகளுக்கு, இது போன்ற அமைக்கும் பெயரையும் விசையையும் வழங்கவும்: `` -d லேடெக்ச்_லெமென்ட்ச்.டோக்ளாச் = ச்க்ரார்ட்க்ளாச்``.

source: For boolean values, use ``0`` or ``1`` as the value.
ta: பூலியன் மதிப்புகளுக்கு, `` 0`` அல்லது `` 1`` மதிப்பாக பயன்படுத்தவும்.

source: The value can now be a dictionary value.
ta: மதிப்பு இப்போது அகராதி மதிப்பாக இருக்கலாம்.

source: The value can now also be a list value.
ta: மதிப்பு இப்போது பட்டியல் மதிப்பாகவும் இருக்கலாம்.

source: Make the *name* assigned to *value* in the HTML templates.
ta: html வார்ப்புருக்களில் * மதிப்புக்கு * நியமிக்கப்பட்ட * பெயர் * செய்யுங்கள்.

source: Run in nit-picky mode. Currently, this generates warnings for all missing references. See the config value :confval:`nitpick_ignore` for a way to exclude some references as "known missing".
ta: நைட்-பிக்கி பயன்முறையில் இயக்கவும். தற்போது, இது காணாமல் போன அனைத்து குறிப்புகளுக்கும் எச்சரிக்கைகளை உருவாக்குகிறது. கட்டமைப்பு மதிப்பைக் காண்க: confval: `nitpick_ignore` சில குறிப்புகளை" அறியப்பட்டதாகக் காணவில்லை "என்று விலக்குவதற்கான வழிக்கு.

source: Do not emit colored output.
ta: வண்ண வெளியீட்டை வெளியிட வேண்டாம்.

source: Structure options
ta: கட்டமைப்பு விருப்பங்கள்

source: Increase verbosity (loglevel). This option can be given up to three times to get more debug logging output. It implies :option:`-T`.
ta: சொற்களஞ்சியத்தை அதிகரிக்கவும் (லோக்லெவல்). அதிக பிழைத்திருத்த பதிவு வெளியீட்டைப் பெற இந்த விருப்பத்தை மூன்று முறை வரை கொடுக்கலாம். இது குறிக்கிறது: விருப்பம்: `-t`.

source: Do not output anything on standard output, only write warnings and errors to standard error.
ta: நிலையான வெளியீட்டில் எதையும் வெளியிட வேண்டாம், நிலையான பிழைக்கு எச்சரிக்கைகள் மற்றும் பிழைகளை மட்டும் எழுதுங்கள்.

source: Do not output anything on standard output, also suppress warnings. Only errors are written to standard error.
ta: நிலையான வெளியீட்டில் எதையும் வெளியிட வேண்டாம், எச்சரிக்கைகளையும் அடக்கவும். பிழைகள் மட்டுமே நிலையான பிழைக்கு எழுதப்படுகின்றன.

source: Write warnings (and errors) to the given file, in addition to standard error.
ta: நிலையான பிழைக்கு கூடுதலாக, கொடுக்கப்பட்ட கோப்பில் எச்சரிக்கைகள் (மற்றும் பிழைகள்) எழுதுங்கள்.

source: Turn warnings into errors. This means that the build stops at the first warning and ``sphinx-build`` exits with exit status 1.
ta: எச்சரிக்கைகளை பிழைகளாக மாற்றவும். இதன் பொருள் முதல் எச்சரிக்கையில் உருவாக்கம் நிறுத்தப்படும் மற்றும் `` ச்பின்க்ச்-பில்ட்`` வெளியேறும் நிலை 1 உடன் வெளியேறுகிறது.

source: Display the full traceback when an unhandled exception occurs. Otherwise, only a summary is displayed and the traceback information is saved to a file for further analysis.
ta: ஒரு விதிவிலக்கு ஏற்படும்போது முழு தடமறிதலைக் காண்பி. இல்லையெனில், ஒரு சுருக்கம் மட்டுமே காட்டப்படும் மற்றும் மேலதிக பகுப்பாய்விற்காக ஒரு கோப்பில் டிரேச்பேக் செய்தி சேமிக்கப்படுகிறது.

source: If specified, separate source and build directories.
ta: குறிப்பிடப்பட்டால், தனி மூல மற்றும் கோப்பகங்களை உருவாக்கவும்.

source: You can also give one or more filenames on the command line after the source and build directories. Sphinx will then try to build only these output files (and their dependencies).
ta: மூலத்திற்குப் பிறகு கட்டளை வரியில் ஒன்று அல்லது அதற்கு மேற்பட்ட கோப்பு பெயர்களையும் கொடுக்கலாம் மற்றும் கோப்பகங்களை உருவாக்கலாம். இந்த வெளியீட்டு கோப்புகளை (மற்றும் அவற்றின் சார்புகளை) மட்டுமே உருவாக்க சூரரிமாச்சிலை முயற்சிக்கும்.

source: Makefile options
ta: மேக்ஃபைல் விருப்பங்கள்

source: The :file:`Makefile` and :file:`make.bat` files created by :program:`sphinx-quickstart` usually run :program:`sphinx-build` only with the :option:`-b` and :option:`-d` options. However, they support the following variables to customize behavior:
ta: தி: கோப்பு: `மேக்ஃபைல்` மற்றும்: கோப்பு:` make.bat` உருவாக்கிய கோப்புகள்: நிரல்: `sphinx-quickstart` வழக்கமாக இயங்கும்: நிரல்:` sphinx- கட்டளை` மட்டுமே: விருப்பம்: `-b` மற்றும்: விருப்பம் : `-d` விருப்பங்கள். இருப்பினும், நடத்தையைத் தனிப்பயனாக்க பின்வரும் மாறிகளை அவை ஆதரிக்கின்றன:

source: The value for :confval:`latex_paper_size`.
ta: இதற்கான மதிப்பு: confval: `latex_paper_size`.

source: The command to use instead of ``sphinx-build``.
ta: `` ச்பின்க்ச்-பில்ட்`` க்கு பதிலாக பயன்படுத்த கட்டளை.

source: The build directory to use instead of the one chosen in :program:`sphinx-quickstart`.
ta: தேர்ந்தெடுக்கப்பட்ட ஒன்றுக்கு பதிலாக பயன்படுத்த வேண்டிய கோப்பகம்: நிரல்: `ச்பின்க்ச்-க்யூக்ச்டார்ட்`.

source: Additional options for :program:`sphinx-build`.
ta: இதற்கான கூடுதல் விருப்பங்கள்: நிரல்: `ச்பின்க்ச்-பில்ட்`.

source: Deprecation Warnings
ta: தேய்மான எச்சரிக்கைகள்

source: If any deprecation warning like ``RemovedInSphinxXXXWarning`` are displayed when building a user's document, some Sphinx extension is using deprecated features. In that case, please report it to author of the extension.
ta: பயனரின் ஆவணத்தை உருவாக்கும் போது `` remodedinsphinxxxxwarning`` போன்ற எந்தவொரு மதிப்பிழப்பு எச்சரிக்கையும் காட்டப்பட்டால், சில சூரரிமாச்சிலை நீட்டிப்பு நீக்கப்பட்ட அம்சங்களைப் பயன்படுத்துகிறது. அவ்வாறான நிலையில், தயவுசெய்து அதை நீட்டிப்பின் ஆசிரியரிடம் புகாரளிக்கவும்.

source: Inside the root directory, two more directories will be created; "_templates" for custom HTML templates and "_static" for custom stylesheets and other static files. You can enter another prefix (such as ".") to replace the underscore.
ta: ரூட் கோப்பகத்தின் உள்ளே, மேலும் இரண்டு கோப்பகங்கள் உருவாக்கப்படும்; தனிப்பயன் html வார்ப்புருக்கள் மற்றும் தனிப்பயன் ச்டைல்சீட்கள் மற்றும் பிற நிலையான கோப்புகளுக்கான "_ச்டாடிக்" "_templates". அடிக்கோடிட்டதை மாற்ற மற்றொரு முன்னொட்டை ("." போன்றவை) உள்ளிடலாம்.

source: To disable the deprecation warnings, please set ``PYTHONWARNINGS=`` environment variable to your environment. For example:
ta: தேய்மான எச்சரிக்கைகளை முடக்க, தயவுசெய்து உங்கள் சூழலுக்கு `` பைதன்வார்னிங்ச் = `` சுற்றுச்சூழல் மாறியை அமைக்கவும். உதாரணத்திற்கு:

source: ``PYTHONWARNINGS= make html`` (Linux/Mac)
ta: `` பைதன்வார்னிங்ச் = html`` (லினக்ச்/மேக்) உருவாக்குங்கள்

source: ``export PYTHONWARNINGS=`` and do ``make html`` (Linux/Mac)
ta: `` பைதன்வார்னிங்ச் = `` ஏற்றுமதி செய்து `` html` (லினக்ச்/மேக்) செய்யுங்கள்

source: ``set PYTHONWARNINGS=`` and do ``make html`` (Windows)
ta: `` பைதன்வார்னிங்ச் = `` ஐ அமைத்து, `` html` (விண்டோச்) செய்யுங்கள்

source: modify your Makefile/make.bat and set the environment variable
ta: உங்கள் makefile/make.bat ஐ மாற்றி சுற்றுச்சூழல் மாறியை அமைக்கவும்

source: Invocation of sphinx-apidoc
ta: ச்பின்க்ச்-அபிடோக்கின் அழைப்பு

source: The :program:`sphinx-apidoc` generates completely automatic API documentation for a Python package. It is called like this:
ta: தி: நிரல்: `ச்பின்க்ச்-அபிடோக்` பைதான் தொகுப்புக்கான முற்றிலும் தானியங்கி பநிஇ ஆவணங்களை உருவாக்குகிறது. இது இப்படி அழைக்கப்படுகிறது:

source: where *packagedir* is the path to the package to document, and *outputdir* is the directory where the generated sources are placed. Any *pathnames* given are paths to be excluded ignored during generation.
ta: * பேக்கேசெடிர் * என்பது ஆவணத்திற்கான தொகுப்புக்கான பாதையாகும், மேலும் * வெளியீட்டு டி.ஐ.ஆர் * என்பது உருவாக்கப்பட்ட ஆதாரங்கள் வைக்கப்பட்டுள்ள கோப்பகமாகும். எந்தவொரு * பாதைகள் * கொடுக்கப்பட்டவை தலைமுறையின் போது புறக்கணிக்கப்பட வேண்டிய பாதைகள்.

source: ``sphinx-apidoc`` generates reST files that use :mod:`sphinx.ext.autodoc` to document all found modules. If any modules have side effects on import, these will be executed by ``autodoc`` when ``sphinx-build`` is run.
ta: `` sphinx-apidoc`` use பயன்படுத்தும் ஓய்வு கோப்புகளை உருவாக்குகிறது: mod: `sphinx.ext.autodoc` அனைத்து கண்டுபிடிக்கப்பட்ட தொகுதிகளையும் ஆவணப்படுத்த. ஏதேனும் தொகுதிகள் இறக்குமதியில் பக்க விளைவுகளை ஏற்படுத்தினால், `` ச்பின்க்ச்-பில்ட்`` இயங்கும் போது இவை `` ஆட்டோடோக்`` ஆல் செயல்படுத்தப்படும்.

source: If you document scripts (as opposed to library modules), make sure their main routine is protected by a ``if __name__ == '__main__'`` condition.
ta: நீங்கள் ச்கிரிப்ட்களை ஆவணப்படுத்தினால் (நூலக தொகுதிகளுக்கு மாறாக), அவற்றின் முக்கிய வழக்கம் `` என்றால் __name__ == '__main __' `` நிபந்தனையால் பாதுகாக்கப்படுவதை உறுதிசெய்க.

source: The :program:`sphinx-apidoc` script has several options:
ta: தி: நிரல்: `ச்பின்க்ச்-அபிடோக்` ச்கிரிப்டில் பல விருப்பங்கள் உள்ளன:

source: Gives the directory in which to place the generated output.
ta: உருவாக்கப்பட்ட வெளியீட்டை வைக்க கோப்பகத்தை அளிக்கிறது.

source: Normally, sphinx-apidoc does not overwrite any files. Use this option to force the overwrite of all files that it generates.
ta: பொதுவாக, ச்பின்க்ச்-அபிடோக் எந்த கோப்புகளையும் மேலெழுதாது. இந்த விருப்பத்தை அது உருவாக்கும் அனைத்து கோப்புகளையும் மேலெழுதும் கட்டாயப்படுத்த இந்த விருப்பத்தைப் பயன்படுத்தவும்.

source: With this option given, no files will be written at all.
ta: கொடுக்கப்பட்ட இந்த விருப்பத்துடன், எந்த கோப்புகளும் எழுதப்படாது.

source: This option selects the file name suffix of output files. By default, this is ``rst``.
ta: இந்த விருப்பம் வெளியீட்டு கோப்புகளின் கோப்பு பெயர் பின்னொட்டைத் தேர்ந்தெடுக்கிறது. இயல்பாக, இது `` rst``.

source: Project basic options
ta: அடிப்படை விருப்பங்களை திட்டமிடுங்கள்

source: This sets the maximum depth of the table of contents, if one is generated.
ta: ஒன்று உருவாக்கப்பட்டால், உள்ளடக்கங்களின் அட்டவணையின் அதிகபட்ச ஆழத்தை இது அமைக்கிறது.

source: This option makes sphinx-apidoc follow symbolic links when recursing the filesystem to discover packages and modules. You may need it if you want to generate documentation from a source directory managed by `collective.recipe.omelette <https://pypi.python.org/pypi/collective.recipe.omelette/>`_. By default, symbolic links are skipped.
ta: தொகுப்புகள் மற்றும் தொகுதிகளைக் கண்டறிய கோப்பு முறைமையை மீட்டெடுக்கும் போது இந்த விருப்பம் sphinx-apidoc ஐ சிம்போலிக் இணைப்புகளைப் பின்பற்றுகிறது. `colloctive.recipe.omelette ஐ நிர்வகிக்கும் மூல கோப்பகத்தில் இருந்து ஆவணங்களை உருவாக்க விரும்பினால் உங்களுக்கு இது தேவைப்படலாம். இயல்பாக, குறியீட்டு இணைப்புகள் தவிர்க்கப்படுகின்றன.

source: This prevents the generation of a table-of-contents file ``modules.rst``. This has no effect when :option:`--full` is given.
ta: இது ஒரு அட்டவணை-ஆஃப்-உள்ளடக்கக் கோப்பின் உருவாக்கத்தை `` தொகுதிகள்.ர்ச்ட்`` தடுக்கிறது. இது எந்த விளைவையும் ஏற்படுத்தாது: விருப்பம்: `--full` வழங்கப்படுகிறது.

source: This option makes sphinx-apidoc create a full Sphinx project, using the same mechanism as :program:`sphinx-quickstart`. Most configuration values are set to default values, but you can influence the most important ones using the following options.
ta: இந்த விருப்பம் sphinx-apidoc ஒரு முழு சுழல் திட்டத்தை உருவாக்குகிறது, அதே பொறிமுறையைப் பயன்படுத்தி: நிரல்: `sphinx-guickstart`. பெரும்பாலான உள்ளமைவு மதிப்புகள் இயல்புநிலை மதிப்புகளாக அமைக்கப்பட்டுள்ளன, ஆனால் பின்வரும் விருப்பங்களைப் பயன்படுத்தி மிக முக்கியமானவற்றை நீங்கள் பாதிக்கலாம்.

source: By default sphinx-apidoc processes sys.path searching for modules only. Python 3.3 introduced :pep:`420` implicit namespaces that allow module path structures such as ``foo/bar/module.py`` or ``foo/bar/baz/__init__.py`` (notice that ``bar`` and ``foo`` are namespaces, not modules).
ta: இயல்பாகவே ச்பின்க்ச்-அபிடோக் செயல்முறைகள் sys.path தொகுதிகளை மட்டுமே தேடுகிறது. பைதான் 3.3 அறிமுகப்படுத்தப்பட்டது: பெப்: `420`` `ஃபூ/பார்/தொகுதி. `மற்றும்` `foo`` ஆகியவை பெயர்வெளிகள், தொகுதிகள் அல்ல).

source: Specifying this option interprets paths recursively according to PEP-0420.
ta: இந்த விருப்பத்தைக் குறிப்பிடுவது pep-0420 இன் படி பாதைகளை மீண்டும் மீண்டும் விளக்குகிறது.

source: This option makes sphinx-apidoc put module documentation before submodule documentation.
ta: இந்த விருப்பம் sphinx-apidoc புட் தொகுதி ஆவணங்களை துணை ஆவணங்களுக்கு முன் செய்கிறது.

source: Project name will be set. (see :confval:`project`).
ta: திட்ட பெயர் அமைக்கப்படும். (காண்க: confval: `திட்டம்`).

source: Append module_path to sys.path.
ta: sys.path உடன் தொகுதி_பாத் சேர்க்கவும்.

source: Sets the project name to put in generated files (see :confval:`project`).
ta: உருவாக்கப்பட்ட கோப்புகளில் வைக்க திட்ட பெயரை அமைக்கிறது (பார்க்க: confval: `project`).

source: Sets the author name(s) to put in generated files (see :confval:`copyright`).
ta: உருவாக்கப்பட்ட கோப்புகளில் வைக்க ஆசிரியர் பெயர் (களை) அமைக்கிறது (பார்க்க: confval: `பதிப்புரிமை`).

source: Sets the project version to put in generated files (see :confval:`version`).
ta: உருவாக்கப்பட்ட கோப்புகளில் வைக்க திட்ட பதிப்பை அமைக்கிறது (பார்க்க: confval: `பதிப்பு`).

source: Sets the project release to put in generated files (see :confval:`release`).
ta: உருவாக்கப்பட்ட கோப்புகளை வைக்க திட்ட வெளியீட்டை அமைக்கிறது (பார்க்க: confval: `வெளியீடு`).

source: Author names. (see :confval:`copyright`).
ta: ஆசிரியர் பெயர்கள். (காண்க: confval: `பதிப்புரிமை`).

source: Invocation of sphinx-quickstart
ta: ச்பிங்க்ச்-க்யூக்ச்டார்ட்டின் அழைப்பு
