Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_development--html_themes--index_*.po
Languages: ta

source: HTML theme development
ta: HTML தீம் மேம்பாடு

source: This document provides information about creating your own theme. If you simply wish to use a pre-existing HTML themes, refer to :doc:`/usage/theming`.
ta: இந்த ஆவணம் உங்கள் சொந்த கருப்பொருளை உருவாக்குவது பற்றிய தகவல்களை வழங்குகிறது. முன்பே இருக்கும் HTML கருப்பொருள்களைப் பயன்படுத்த நீங்கள் விரும்பினால், பார்க்க: DOC: `/பயன்பாடு/தீமிங்`.

source: Sphinx supports changing the appearance of its HTML output via *themes*. A theme is a collection of HTML templates, stylesheet(s) and other static files. Additionally, it has a configuration file which specifies from which theme to inherit, which highlighting style to use, and what options exist for customizing the theme's look and feel.
ta: ஸ்பின்க்ஸ் அதன் HTML வெளியீட்டின் தோற்றத்தை *கருப்பொருள்கள் *வழியாக மாற்றுவதை ஆதரிக்கிறது. ஒரு தீம் என்பது HTML வார்ப்புருக்கள், ஸ்டைல்ஷீட் (கள்) மற்றும் பிற நிலையான கோப்புகளின் தொகுப்பாகும். கூடுதலாக, இது ஒரு உள்ளமைவு கோப்பைக் கொண்டுள்ளது, இது எந்த கருப்பொருளிலிருந்து மரபுரிமையாக இருக்க வேண்டும் என்பதைக் குறிப்பிடுகிறது, இது பயன்படுத்த பாணியை முன்னிலைப்படுத்துகிறது, மேலும் கருப்பொருளின் தோற்றம் மற்றும் உணர்வைத் தனிப்பயனாக்க என்ன விருப்பங்கள் உள்ளன.

source: Themes are meant to be project-unaware, so they can be used for different projects without change.
ta: கருப்பொருள்கள் திட்ட-அனாவேர் என்று பொருள், எனவே அவை மாற்றமின்றி வெவ்வேறு திட்டங்களுக்கு பயன்படுத்தப்படலாம்.

source: See :ref:`dev-extensions` for more information that may be helpful in developing themes.
ta: காண்க: குறிப்பு: கருப்பொருள்களை வளர்ப்பதற்கு உதவக்கூடிய கூடுதல் தகவலுக்கு `தேவ்-விரிவாக்கங்கள்`.

source: Creating themes
ta: கருப்பொருள்களை உருவாக்குதல்

source: Themes take the form of either a directory or a zipfile (whose name is the theme name), containing the following:
ta: கருப்பொருள்கள் ஒரு அடைவு அல்லது ஜிப்ஃபைல் (அதன் பெயர் தீம் பெயர்) வடிவத்தை எடுத்துக்கொள்கின்றன, இதில் பின்வருவன உள்ளன:

source: Either a :file:`theme.toml` file (preferred) or a :file:`theme.conf` file.
ta: ஒரு :file:`theme.toml` கோப்பு (விருப்பம்) அல்லது :file:`theme.conf` கோப்பு.

source: HTML templates, if needed.
ta: தேவைப்பட்டால், HTML வார்ப்புருக்கள்.

source: A ``static/`` directory containing any static files that will be copied to the output static directory on build. These can be images, styles, script files.
ta: ஒரு `` நிலையான/`` ஏதேனும் நிலையான கோப்புகளைக் கொண்ட கோப்பகம், இது வெளியீட்டு நிலையான கோப்பகத்திற்கு நகலெடுக்கப்படும். இவை படங்கள், பாணிகள், ஸ்கிரிப்ட் கோப்புகளாக இருக்கலாம்.

source: Theme configuration (``theme.toml``)
ta: கருப்பொருள் உள்ளமைவு (``theme.toml``)

source: The :file:`theme.toml` file is a TOML_ document, containing two tables: ``[theme]`` and ``[options]``.
ta: :file:`theme.toml` கோப்பு TOML_ ஆவணமாகும், இதில் இரண்டு அட்டவணைகள் உள்ளன: ``[theme]`` மற்றும் ``[options]``.

source: The ``[theme]`` table defines the theme's settings:
ta: ``[தீம்]`` அட்டவணை தீமின் அமைப்புகளை வரையறுக்கிறது:

source: **inherit** (string): The name of the base theme from which to inherit settings, options, templates, and static files. All static files from theme 'ancestors' will be used. The theme will use all options defined in inherited themes. Finally, inherited themes will be used to locate missing templates (for example, if ``"basic"`` is used as the base theme, most templates will already be defined).
ta: ** inherit** (சரம்): அமைப்புகள், விருப்பங்கள், டெம்ப்ளேட்கள் மற்றும் நிலையான கோப்புகளைப் பெறுவதற்கான அடிப்படை தீமின் பெயர். கருப்பொருள் 'மூதாதையர்கள்' இருந்து அனைத்து நிலையான கோப்புகள் பயன்படுத்தப்படும். கருப்பொருள் மரபுவழி தீம்களில் வரையறுக்கப்பட்ட அனைத்து விருப்பங்களையும் பயன்படுத்தும். இறுதியாக, மறைந்திருக்கும் வார்ப்புருக்களைக் கண்டறிய மரபுரிமை தீம்கள் பயன்படுத்தப்படும் (உதாரணமாக, ``"அடிப்படை"`` அடிப்படை கருப்பொருளாகப் பயன்படுத்தப்பட்டால், பெரும்பாலான வார்ப்புருக்கள் ஏற்கனவே வரையறுக்கப்பட்டிருக்கும்).

source: If set to ``"none"``, the theme will not inherit from any other theme. Inheritance is recursive, forming a chain of inherited themes (e.g. ``default`` -> ``classic`` -> ``basic`` -> ``none``).
ta: ``"இல்லை"`` என அமைக்கப்பட்டால், கருப்பொருள் வேறு எந்த தீமிலிருந்தும் பெறாது. பரம்பரை என்பது சுழல்நிலையானது, இது பரம்பரை கருப்பொருள்களின் சங்கிலியை உருவாக்குகிறது (எ.கா. ``இயல்புநிலை`` -> ``கிளாசிக்`` -> ``அடிப்படை`` -> ```இல்லை``).

source: **stylesheets** (list of strings): A list of CSS filenames which will be included in generated HTML header. Setting the :confval:`html_style` config value will override this setting.
ta: ** ச்டைல்சீட்கள்** (சரங்களின் பட்டியல்): உருவாக்கப்பட்ட உஉகுமொ தலைப்பில் சேர்க்கப்படும் சிஎச்எச் கோப்புப் பெயர்களின் பட்டியல். :confval:`html_style` கட்டமைப்பு மதிப்பை அமைப்பது இந்த அமைப்பை மீறும்.

source: Other mechanisms for including multiple stylesheets include ``@import`` in CSS or using a custom HTML template with appropriate ``<link rel="stylesheet">`` tags.
ta: சிஎச்எச் இல் ``@இறக்குமதி`` அல்லது பொருத்தமான ``<link rel="stylesheet">`` குறிச்சொற்களைக் கொண்ட தனிப்பயன் உஉகுமொ டெம்ப்ளேட்டைப் பயன்படுத்துவது, பல நடைத்தாள்களைச் சேர்ப்பதற்கான பிற வழிமுறைகள்.

source: **sidebars** (list of strings): A list of sidebar templates. This can be overridden by the user via the :confval:`html_sidebars` config value.
ta: ** பக்கப்பட்டிகள்** (சரங்களின் பட்டியல்): பக்கப்பட்டி வார்ப்புருக்களின் பட்டியல். இதை பயனர் :confval:`html_sidebars` கட்டமைப்பு மதிப்பு வழியாக மேலெழுதலாம்.

source: **pygments_style** (table): A TOML table defining the names of Pygments styles to use for highlighting syntax. The table has two recognised keys: ``default`` and ``dark``. The style defined in the ``dark`` key will be used when the CSS media query ``(prefers-color-scheme: dark)`` evaluates to true.
ta: **pygments_style** (அட்டவணை): தொடரியல் சிறப்பம்சமாக பயன்படுத்துவதற்கு பயன்படுத்தப்படும் நிறமி பாணிகளின் பெயர்களை வரையறுக்கும் TOML அட்டவணை. அட்டவணையில் அங்கீகரிக்கப்பட்ட இரண்டு விசைகள் உள்ளன: ``இயல்புநிலை`` மற்றும் ``இருண்ட``. சிஎச்எச் மீடியா வினவல் ``(prefers-color-scheme: dark)`` சரி என மதிப்பிடும்போது ``dark`` விசையில் வரையறுக்கப்பட்ட நடை பயன்படுத்தப்படும்.

source: ``[theme.pygments_style.default]`` can be overridden by the user via the :confval:`pygments_style` config value.
ta: ``[theme.pygments_style.default]`` ஐ பயனரால் :confval:`pygments_style` கட்டமைப்பு மதிப்பு மூலம் மேலெழுதலாம்.

source: The ``[options]`` table defines the options for the theme. It is structured such that each key-value pair corresponds to a variable name and the corresponding default value. These options can be overridden by the user in :confval:`html_theme_options` and are accessible from all templates as ``theme_<name>``.
ta: ``[விருப்பங்கள்]`` அட்டவணை கருப்பொருள் விருப்பங்களை வரையறுக்கிறது. ஒவ்வொரு விசை-மதிப்பு சோடியும் ஒரு மாறி பெயர் மற்றும் தொடர்புடைய இயல்புநிலை மதிப்புக்கு ஒத்திருக்கும் வகையில் இது கட்டமைக்கப்பட்டுள்ளது. இந்த விருப்பங்களை பயனரால் :confval:`html_theme_options` இல் மேலெழுதலாம் மற்றும் அனைத்து டெம்ப்ளேட்களிலிருந்து ``theme_<name>`` என அணுகலாம்.

source: ``theme.toml`` support.
ta: ``theme.toml`` உதவி.

source: Exemplar :file:`theme.toml` file:
ta: சான்று :file:`theme.toml` கோப்பு:

source: Theme configuration (``theme.conf``)
ta: கருப்பொருள் உள்ளமைவு (``theme.conf``)

source: The :file:`theme.conf` file is in INI format [1]_ (readable by the standard Python :mod:`configparser` module) and has the following structure:
ta: தி: கோப்பு: `தீம்.கான்ஃப்` கோப்பு ஐ.என்.ஐ வடிவத்தில் உள்ளது [1] _ (நிலையான பைதான்: மோட்:` கட்டமைப்பு பார்வையாளர்` தொகுதி) மற்றும் பின்வரும் கட்டமைப்பைக் கொண்டுள்ளது:

source: The **inherit** setting gives the name of a "base theme", or ``none``. The base theme will be used to locate missing templates (most themes will not have to supply most templates if they use ``basic`` as the base theme), its options will be inherited, and all of its static files will be used as well. If you want to also inherit the stylesheet, include it via CSS' ``@import`` in your own.
ta: ** பரம்பரை ** அமைப்பு ஒரு "அடிப்படை தீம்" என்ற பெயரைக் கொடுக்கிறது, அல்லது `` எதுவுமில்லை``. காணாமல் போன வார்ப்புருக்களைக் கண்டுபிடிக்க அடிப்படை தீம் பயன்படுத்தப்படும் (பெரும்பாலான கருப்பொருள்கள் அடிப்படை கருப்பொருளாக `` அடிப்படை`` ஐப் பயன்படுத்தினால் பெரும்பாலான வார்ப்புருக்கள் வழங்க வேண்டியதில்லை), அதன் விருப்பங்கள் மரபுரிமையாக இருக்கும், மேலும் அதன் நிலையான கோப்புகள் அனைத்தும் பயன்படுத்தப்படும் நன்றாக. நீங்கள் ஸ்டைல்ஷீட்டைப் பெற விரும்பினால், அதை உங்கள் சொந்தமாக CSS '`@இறக்குமதி` வழியாகச் சேர்க்கவும்.

source: The **stylesheet** setting gives a list of CSS filenames separated commas which will be referenced in the HTML header. You can also use CSS' ``@import`` technique to include one from the other, or use a custom HTML template that adds ``<link rel="stylesheet">`` tags as necessary. Setting the :confval:`html_style` config value will override this setting.
ta: ** ஸ்டைல்ஷீட் ** அமைப்பு CSS கோப்பு பெயர்களின் பிரிக்கப்பட்ட காற்புள்ளிகளின் பட்டியலை வழங்குகிறது, இது HTML தலைப்பில் குறிப்பிடப்படும். மற்றொன்றிலிருந்து ஒன்றைச் சேர்க்க நீங்கள் CSS '``@இறக்குமதி` நுட்பத்தையும் பயன்படுத்தலாம் அல்லது தனிப்பயன் HTML வார்ப்புருவைப் பயன்படுத்தலாம், இது `` <இணைப்பு rel = "ஸ்டைல்ஷீட்"> `` தேவையான குறிச்சொற்களைச் சேர்க்கும். அமைத்தல்: confval: `html_style` கட்டமைப்பு மதிப்பு இந்த அமைப்பை மீறும்.

source: The **pygments_style** setting gives the name of a Pygments style to use for highlighting. This can be overridden by the user in the :confval:`pygments_style` config value.
ta: ** pygments_style ** அமைப்பு சிறப்பம்சமாகப் பயன்படுத்த பிக்மென்ட் பாணியின் பெயரைக் கொடுக்கிறது. இதை பயனரால் மீறலாம்: confval: `pygments_style` config value.

source: The **pygments_dark_style** setting gives the name of a Pygments style to use for highlighting when the CSS media query ``(prefers-color-scheme: dark)`` evaluates to true. It is injected into the page using :meth:`~sphinx.application.Sphinx.add_css_file`.
ta: **pygments_dark_style** அமைப்பானது, சிஎச்எச் மீடியா வினவல் ``(prefers-color-scheme: dark)`` சரி என மதிப்பிடும்போது, ​​ஐலைட் செய்ய, Pygments நடையின் பெயரை வழங்குகிறது. இது :meth:`~sphinx.application.Sphinx.add_css_file` ஐப் பயன்படுத்தி பக்கத்தில் செலுத்தப்படுகிறது.

source: The **sidebars** setting gives the comma separated list of sidebar templates for constructing sidebars. This can be overridden by the user in the :confval:`html_sidebars` config value.
ta: ** பக்கப்பட்டிகள் ** அமைப்பு கமாவைப் பிரிக்கப்பட்ட பக்கப்பட்டி வார்ப்புருக்கள் பக்கப்பட்டிகளை நிர்மாணிப்பதற்கான பட்டியலைக் கொடுக்கிறது. இதை பயனரால் மீறலாம்: confval: `html_sidebars` config value.

source: The **options** section contains pairs of variable names and default values. These options can be overridden by the user in :confval:`html_theme_options` and are accessible from all templates as ``theme_<name>``.
ta: ** விருப்பங்கள் ** பிரிவில் ஜோடிகள் மாறி பெயர்கள் மற்றும் இயல்புநிலை மதிப்புகள் உள்ளன. இந்த விருப்பங்களை பயனரால் மீறலாம்: confval: `html_theme_options` மற்றும் அனைத்து வார்ப்புருக்களிலிருந்தும்` `தீம்_ <பெயர்>` `என அணுகலாம்.

source: sidebar settings
ta: பக்கப்பட்டி அமைப்புகள்

source: The stylesheet setting accepts multiple CSS filenames
ta: ஸ்டைல்ஷீட் அமைப்பு பல CSS கோப்பு பெயர்களை ஏற்றுக்கொள்கிறது

source: Convert ``theme.conf`` to ``theme.toml``
ta: ``theme.conf`` ஐ ``theme.toml`` ஆக மாற்றவும்

source: INI-style theme configuration files (``theme.conf``) can be converted to TOML via a helper programme distributed with Sphinx. This is intended for one-time use, and may be removed without notice in a future version of Sphinx.
ta: INI-பாணி கருப்பொருள் உள்ளமைவு கோப்புகளை (`Theme.conf``) ச்பிங்க்சுடன் விநியோகிக்கப்பட்ட உதவி நிரல் மூலம் TOML ஆக மாற்றலாம். இது ஒரு முறை பயன்பாட்டிற்காக வடிவமைக்கப்பட்டுள்ளது, மேலும் சூரரிமாச்சிலை இன் எதிர்கால பதிப்பில் அறிவிப்பு இல்லாமல் அகற்றப்படலாம்.

source: The required argument is a path to a directory containing a ``theme.conf`` file. The programme will write a ``theme.toml`` file in the same directory, and will not modify the original ``theme.conf`` file.
ta: தேவையான உரையாடல் என்பது ``theme.conf`` கோப்பைக் கொண்ட கோப்பகத்திற்கான பாதையாகும். நிரல் அதே கோப்பகத்தில் ``theme.toml`` கோப்பை எழுதும், மேலும் அசல் ``theme.conf`` கோப்பை மாற்றாது.

source: Distribute your theme as a Python package
ta: உங்கள் கருப்பொருளை பைதான் தொகுப்பாக விநியோகிக்கவும்

source: As a way to distribute your theme, you can use a Python package. This makes it easier for users to set up your theme.
ta: உங்கள் கருப்பொருளை விநியோகிப்பதற்கான ஒரு வழியாக, நீங்கள் பைதான் தொகுப்பைப் பயன்படுத்தலாம். பயனர்கள் உங்கள் கருப்பொருளை அமைப்பதை இது எளிதாக்குகிறது.

source: To distribute your theme as a Python package, please define an entry point called ``sphinx.html_themes`` in your ``pyproject.toml`` file, and write a ``setup()`` function to register your theme using the :meth:`~sphinx.application.Sphinx.add_html_theme` API:
ta: உங்கள் கருப்பொருளை பைதான் தொகுப்பாக விநியோகிக்க, தயவுசெய்து உங்கள் `` pyproject.toml`` கோப்பில் `` sphinx.html_themes`` என்ற நுழைவு புள்ளியை வரையறுக்கவும், மேலும் `` அமைவு () `` செயல்பாட்டை எழுதவும் .

source: If your theme package contains two or more themes, please call ``add_html_theme()`` twice or more.
ta: உங்கள் தீம் தொகுப்பில் இரண்டு அல்லது அதற்கு மேற்பட்ட கருப்பொருள்கள் இருந்தால், தயவுசெய்து `` add_html_theme () `` இரண்டு அல்லது அதற்கு மேற்பட்டவற்றை அழைக்கவும்.

source: 'sphinx_themes' entry_points feature.
ta: 'sphinx_themes' enter_points அம்சம்.

source: ``sphinx_themes`` entry_points has been deprecated.
ta: `` sphinx_themes`` entry_points நீக்கப்பட்டது.

source: ``sphinx.html_themes`` entry_points feature.
ta: `` sphinx.html_themes`` entry_points அம்சம்.

source: Styling with CSS
ta: சிஎச்எச் உடன் ச்டைலிங்

source: The :confval:`!stylesheets` setting can be used to add custom CSS files to a theme.
ta: தனிப்பயன் சிஎச்எச் கோப்புகளை தீமில் சேர்க்க :confval:`!stylesheets' அமைப்பைப் பயன்படுத்தலாம்.

source: The structure of the HTML elements and their classes are currently not a well-defined public API. Please infer them from inspecting the built HTML pages. While we cannot guarantee full stability, they tend to be fairly stable.
ta: உஉகுமொ உறுப்புகளின் அமைப்பு மற்றும் அவற்றின் வகுப்புகள் தற்போது நன்கு வரையறுக்கப்பட்ட பொது பநிஇ அல்ல. கட்டப்பட்ட உஉகுமொ பக்கங்களை ஆய்வு செய்வதிலிருந்து அவற்றை ஊகிக்கவும். முழு ச்திரத்தன்மைக்கு பொறுப்பு அளிக்க முடியாது என்றாலும், அவை மிகவும் நிலையானதாக இருக்கும்.

source: Styling search result entries by category
ta: வகை வாரியாக தேடல் முடிவு உள்ளீடுகளை வடிவமைக்கிறது

source: The CSS classes named below are generated by Sphinx's standalone search code. If you are using a third-party search provider, such as ReadTheDocs_, to provide search results, then the theming options available may vary.
ta: கீழே பெயரிடப்பட்ட சிஎச்எச் வகுப்புகள் சூரரிமாச்சிலை இன் தனித்த தேடல் குறியீட்டால் உருவாக்கப்பட்டவை. தேடல் முடிவுகளை வழங்க ReadTheDocs_ போன்ற மூன்றாம் தரப்பு தேடல் வழங்குநரைப் பயன்படுத்துகிறீர்கள் என்றால், கிடைக்கும் தீமிங் விருப்பங்கள் மாறுபடலாம்.

source: The search result items have classes indicating the context in which the search term was found. You can use the CSS selectors:
ta: தேடல் முடிவு உருப்படிகளில் தேடல் சொல் கண்டுபிடிக்கப்பட்ட சூழலைக் குறிக்கும் வகுப்புகள் உள்ளன. நீங்கள் சிஎச்எச் தேர்விகளைப் பயன்படுத்தலாம்:

source: ``ul.search li.kind-index``: For results in an index, such as the glossary
ta: ``ul.search li.kind-index``: சொற்களஞ்சியம் போன்ற குறியீட்டின் முடிவுகளுக்கு

source: ``ul.search li.kind-object``: For results in source code, like Python function definitions
ta: ``ul.search li.kind-object``: பைதான் செயல்பாடு வரையறைகள் போன்ற மூலக் குறியீட்டின் முடிவுகளுக்கு

source: ``ul.search li.kind-title``: For results found in section headings
ta: ``ul.search li.kind-title``: பிரிவுத் தலைப்புகளில் காணப்படும் முடிவுகளுக்கு

source: ``ul.search li.kind-text``: For results found anywhere else in the documentation text
ta: ``ul.search li.kind-text``: ஆவண உரையில் வேறு எங்கும் காணப்படும் முடிவுகளுக்கு

source: As a base for inheritance by other themes, the ``basic`` theme is intentionally minimal and does not define CSS rules using these. Derived themes are encouraged to use these selectors as they see fit. For example, the following stylesheet adds contextual icons to the search result list:
ta: பிற கருப்பொருள்கள் மூலம் மரபுரிமைக்கான அடிப்படையாக, ``அடிப்படை`` கருப்பொருள் வேண்டுமென்றே குறைவாக உள்ளது மற்றும் இவற்றைப் பயன்படுத்தி சிஎச்எச் விதிகளை வரையறுக்காது. பெறப்பட்ட தீம்கள் இந்த தேர்வாளர்களை அவர்கள் பொருத்தமாகப் பயன்படுத்த ஊக்குவிக்கப்படுகின்றன. எடுத்துக்காட்டாக, பின்வரும் ச்டைல்சீட் தேடல் முடிவு பட்டியலில் சூழல்சார் சின்னங்களைச் சேர்க்கிறது:

source: Templating
ta: வார்ப்புரு

source: The :doc:`guide to templating <templating>` is helpful if you want to write your own templates. What is important to keep in mind is the order in which Sphinx searches for templates:
ta: தி: டாக்: `உங்கள் சொந்த வார்ப்புருக்கள் எழுத விரும்பினால்` வார்ப்புருவாக்கத்திற்கான வழிகாட்டி உதவியாக இருக்கும். நினைவில் கொள்ள வேண்டியது என்னவென்றால், ஸ்பிங்க்ஸ் வார்ப்புருக்களைத் தேடும் ஒழுங்கு:

source: First, in the user's ``templates_path`` directories.
ta: முதலாவதாக, பயனரின் `` வார்ப்புருக்கள்_பாத்` கோப்புகளில்.

source: Then, in the selected theme.
ta: பின்னர், தேர்ந்தெடுக்கப்பட்ட கருப்பொருளில்.

source: Then, in its base theme, its base's base theme, etc.
ta: பின்னர், அதன் அடிப்படை கருப்பொருளில், அதன் அடிப்படை தீம் போன்றவை.

source: When extending a template in the base theme with the same name, use the theme name as an explicit directory: ``{% extends "basic/layout.html" %}``. From a user ``templates_path`` template, you can still use the "exclamation mark" syntax as :ref:`described in the templating document <templating-primer>`.
ta: அதே பெயரில் அடிப்படை தீமில் டெம்ப்ளேட்டை நீட்டிக்கும்போது, ​​தீம் பெயரை வெளிப்படையான கோப்பகமாகப் பயன்படுத்தவும்: ``{% ஆனது "basic/layout.html" %}`` நீட்டிக்கிறது. ஒரு பயனர் ``templates_path`` டெம்ப்ளேட்டிலிருந்து, டெம்ப்ளேட்டிங் ஆவணம் <templating-primer>` இல் விவரிக்கப்பட்டுள்ள :ref:`ஆச்சரியக்குறியின் தொடரியலை நீங்கள் இன்னும் பயன்படுத்தலாம்.

source: Static templates
ta: நிலையான வார்ப்புருக்கள்

source: Since theme options are meant for the user to configure a theme more easily, without having to write a custom stylesheet, it is necessary to be able to template static files as well as HTML files. Therefore, Sphinx supports so-called "static templates", like this:
ta: தீம் விருப்பங்கள் பயனருக்கு ஒரு கருப்பொருளை மிக எளிதாக உள்ளமைக்க வேண்டும் என்பதால், தனிப்பயன் ஸ்டைல்ஷீட்டை எழுதாமல், நிலையான கோப்புகளையும் HTML கோப்புகளையும் வார்ப்புரு செய்ய முடியும். எனவே, இது போன்ற "நிலையான வார்ப்புருக்கள்" என்று அழைக்கப்படுவதை ஸ்பிங்க்ஸ் ஆதரிக்கிறது:

source: If the name of a file in the ``static/`` directory of a theme (or in the user's static path) ends with ``.jinja`` or ``_t``, it will be processed by the template engine. The suffix will be removed from the final file name.
ta: தீமின் ``நிலை/`` கோப்பகத்தில் (அல்லது பயனரின் நிலையான பாதையில்) கோப்பின் பெயர் ``.jinja`` அல்லது ``_t`` என முடிவடைந்தால், அது டெம்ப்ளேட் இயந்திரத்தால் செயலாக்கப்படும். இறுதி கோப்பு பெயரிலிருந்து பின்னொட்டு நீக்கப்படும்.

source: For example, a theme with a ``static/theme_styles.css.jinja`` file could use templating to put options into the stylesheet. When a documentation project is built with that theme, the output directory will contain a ``_static/theme_styles.css`` file where all template tags have been processed.
ta: எடுத்துக்காட்டாக, ``static/theme_styles.css.jinja`` கோப்பைக் கொண்ட கருப்பொருள், ச்டைல்சீட்டில் விருப்பங்களை வைக்க டெம்ப்ளேட்டிங்கைப் பயன்படுத்தலாம். அந்த கருப்பொருளுடன் ஒரு ஆவணப்படுத்தல் திட்டம் உருவாக்கப்படும் போது, ​​வெளியீட்டு கோப்பகத்தில் அனைத்து டெம்ப்ளேட் குறிச்சொற்களும் செயலாக்கப்பட்ட ``_static/theme_styles.css`` கோப்பு இருக்கும்.

source: The preferred suffix for static templates is now ``.jinja``, in line with the Jinja project's `recommended file extension`_.
ta: சின்சா திட்டத்தின் `பரிந்துரைக்கப்பட்ட கோப்பு நீட்டிப்பு`_க்கு ஏற்ப நிலையான டெம்ப்ளேட்டுகளுக்கு விருப்பமான பின்னொட்டு இப்போது ``.சின்சா`` ஆகும்.

source: The ``_t`` file suffix for static templates is now considered 'legacy', and support may eventually be removed.
ta: நிலையான வார்ப்புருக்களுக்கான ``_t`` கோப்பு பின்னொட்டு இப்போது 'மரபு' எனக் கருதப்படுகிறது, மேலும் உதவி இறுதியில் அகற்றப்படலாம்.

source: If a static template with either a ``_t`` suffix or a ``.jinja`` suffix is detected, it will be processed by the template engine, with the suffix removed from the final file name.
ta: ``_t`` பின்னொட்டு அல்லது ``.சின்சா`` பின்னொட்டு கொண்ட நிலையான டெம்ப்ளேட் கண்டறியப்பட்டால், இறுதி கோப்பு பெயரிலிருந்து பின்னொட்டு அகற்றப்பட்டு டெம்ப்ளேட் இயந்திரத்தால் அது செயலாக்கப்படும்.

source: Use custom page metadata in HTML templates
ta: HTML வார்ப்புருக்களில் தனிப்பயன் பக்க மெட்டாடேட்டாவைப் பயன்படுத்தவும்

source: Any key / value pairs in :doc:`field lists </usage/restructuredtext/field-lists>` that are placed *before* the page's title will be available to the Jinja template when building the page within the :data:`meta` attribute. For example, if a page had the following text before its first title:
ta: எந்த விசை/மதிப்பு ஜோடிகளும்: டிஓசி: `புலம் பட்டியல்கள் </பயன்பாடு/மறுசீரமைப்பு டெக்ஸ்ட்/புலம்-பட்டியல்களை>` அவை வைக்கப்படுகின்றன * முன் * பக்கத்தின் தலைப்பு ஜின்ஜா வார்ப்புருவில் பக்கத்தை உருவாக்கும் போது ஜின்ஜா வார்ப்புருவில் கிடைக்கும்: தரவு: `மெட்டா `பண்புக்கூறு. எடுத்துக்காட்டாக, ஒரு பக்கத்தில் அதன் முதல் தலைப்புக்கு முன் பின்வரும் உரை இருந்தால்:

source: Then it could be accessed within a Jinja template like so:
ta: அப்படி ஒரு ஜின்ஜா வார்ப்புருவுக்குள் அணுகலாம்:

source: Note the check that ``meta`` is a dictionary ("mapping" in Jinja terminology) to ensure that using it in this way is valid.
ta: இந்த வழியில் பயன்படுத்துவது செல்லுபடியாகும் என்பதை உறுதிப்படுத்த `` மெட்டா`` ஒரு அகராதி (ஜின்ஜா சொற்களில் "மேப்பிங்") என்பதை கவனியுங்கள்.

source: Defining custom template functions
ta: தனிப்பயன் வார்ப்புரு செயல்பாடுகளை வரையறுத்தல்

source: Sometimes it is useful to define your own function in Python that you wish to then use in a template. For example, if you'd like to insert a template value with logic that depends on the user's configuration in the project, or if you'd like to include non-trivial checks and provide friendly error messages for incorrect configuration in the template.
ta: சில நேரங்களில் நீங்கள் ஒரு வார்ப்புருவில் பயன்படுத்த விரும்பும் பைத்தானில் உங்கள் சொந்த செயல்பாட்டை வரையறுப்பது பயனுள்ளதாக இருக்கும். எடுத்துக்காட்டாக, திட்டத்தில் பயனரின் உள்ளமைவைப் பொறுத்து தர்க்கத்துடன் ஒரு வார்ப்புரு மதிப்பை நீங்கள் செருக விரும்பினால், அல்லது நீங்கள் அற்பமற்ற காசோலைகளைச் சேர்க்க விரும்பினால், வார்ப்புருவில் தவறான உள்ளமைவுக்கு நட்பு பிழை செய்திகளை வழங்க விரும்பினால்.

source: To define your own template function, you'll need to define two functions inside your module:
ta: உங்கள் சொந்த வார்ப்புரு செயல்பாட்டை வரையறுக்க, உங்கள் தொகுதிக்குள் இரண்டு செயல்பாடுகளை வரையறுக்க வேண்டும்:

source: A **page context event handler** (or **registration**) function. This is connected to the :class:`.Sphinx` application via an event callback.
ta: ஒரு ** பக்க சூழல் நிகழ்வு கையாளுபவர் ** (அல்லது ** பதிவு **) செயல்பாடு. இது: வகுப்பு: `.sphinx` ஒரு நிகழ்வு அழைப்பு வழியாக இணைக்கப்பட்டுள்ளது.

source: A **template function** that you will use in your Jinja template.
ta: உங்கள் ஜின்ஜா வார்ப்புருவில் நீங்கள் பயன்படுத்தும் ** வார்ப்புரு செயல்பாடு **.

source: First, define the registration function, which accepts the arguments for :event:`html-page-context`.
ta: முதலில், பதிவு செயல்பாட்டை வரையறுக்கவும், இது வாதங்களை ஏற்றுக்கொள்கிறது: நிகழ்வு: `html-page-context`.
