Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_development--html_themes--index_*.po
Languages: ta

source: Within the registration function, define the template function that you'd like to use within Jinja. The template function should return a string or Python objects (lists, dictionaries) with strings inside that Jinja uses in the templating process
ta: பதிவு செயல்பாட்டிற்குள், ஜின்ஜாவுக்குள் நீங்கள் பயன்படுத்த விரும்பும் வார்ப்புரு செயல்பாட்டை வரையறுக்கவும். வார்ப்புரு செயல்பாடு வார்ப்புரு செயல்பாட்டில் ஜின்ஜா பயன்படுத்தும் சரங்களுடன் ஒரு சரம் அல்லது பைதான் பொருள்களை (பட்டியல்கள், அகராதிகள்) திருப்பித் தர வேண்டும்

source: The template function will have access to all of the variables that are passed to the registration function.
ta: வார்ப்புரு செயல்பாடு பதிவு செயல்பாட்டிற்கு அனுப்பப்படும் அனைத்து மாறிகளுக்கும் அணுகலைக் கொண்டிருக்கும்.

source: At the end of the registration function, add the template function to the Sphinx application's context with ``context['template_func'] = template_func``.
ta: பதிவு செயல்பாட்டின் முடிவில், `` சூழல் ['டெம்ப்ளேட்_ஃபங்க்'] = டெம்ப்ளேட்_ஃபுங்க்`` உடன் SPHINX பயன்பாட்டின் சூழலில் வார்ப்புரு செயல்பாட்டைச் சேர்க்கவும்.

source: Finally, in your extension's ``setup()`` function, add your registration function as a callback for :event:`html-page-context`.
ta: இறுதியாக, உங்கள் நீட்டிப்பின் `` அமைவு () `` செயல்பாட்டில், உங்கள் பதிவு செயல்பாட்டை ஒரு அழைப்பாகச் சேர்க்கவும்: நிகழ்வு: `html-page-context`.

source: Now, you will have access to this function in jinja like so:
ta: இப்போது, ஜின்ஜாவில் இந்த செயல்பாட்டிற்கான அணுகல் உங்களுக்கு இருக்கும்:

source: Add your own static files to the build assets
ta: உருவாக்க சொத்துக்களில் உங்கள் சொந்த நிலையான கோப்புகளைச் சேர்க்கவும்

source: By default, Sphinx copies static files on the ``static/`` directory of the template directory. However, if your package needs to place static files outside of the ``static/`` directory for some reasons, you need to copy them to the ``_static/`` directory of HTML outputs manually at the build via an event hook. Here is an example of code to accomplish this:
ta: இயல்பாக, வார்ப்புரு கோப்பகத்தின் `` நிலையான/`` கோப்பகத்தில் நிலையான கோப்புகளை ஸ்பின்க்ஸ் நகலெடுக்கிறது. இருப்பினும், உங்கள் தொகுப்பு சில காரணங்களுக்காக `` நிலையான/`` கோப்பகத்திற்கு வெளியே நிலையான கோப்புகளை வைக்க வேண்டும் என்றால், அவற்றை `` _static/`` `HTML இன் அடைவு ஒரு நிகழ்வு கொக்கி வழியாக கட்டமைப்பில் கைமுறையாக வெளியிடும். இதை நிறைவேற்ற குறியீட்டின் எடுத்துக்காட்டு இங்கே:

source: Inject JavaScript based on user configuration
ta: பயனர் உள்ளமைவின் அடிப்படையில் ஜாவாஸ்கிரிப்டை செலுத்தவும்

source: If your extension makes use of JavaScript, it can be useful to allow users to control its behavior using their Sphinx configuration. However, this can be difficult to do if your JavaScript comes in the form of a static library (which will not be built with Jinja).
ta: உங்கள் நீட்டிப்பு ஜாவாஸ்கிரிப்டைப் பயன்படுத்தினால், பயனர்கள் தங்கள் ஸ்பின்க்ஸ் உள்ளமைவைப் பயன்படுத்தி அதன் நடத்தையை கட்டுப்படுத்த அனுமதிப்பது பயனுள்ளதாக இருக்கும். இருப்பினும், உங்கள் ஜாவாஸ்கிரிப்ட் ஒரு நிலையான நூலகத்தின் வடிவத்தில் வந்தால் இதைச் செய்வது கடினம் (இது ஜின்ஜாவுடன் கட்டப்படாது).

source: There are two ways to inject variables into the JavaScript space based on user configuration.
ta: பயனர் உள்ளமைவின் அடிப்படையில் ஜாவாஸ்கிரிப்ட் இடத்தில் மாறிகள் செலுத்த இரண்டு வழிகள் உள்ளன.

source: First, you may append ``_t`` to the end of any static files included with your extension. This will cause Sphinx to process these files with the templating engine, allowing you to embed variables and control behavior.
ta: முதலில், உங்கள் நீட்டிப்புடன் சேர்க்கப்பட்டுள்ள எந்த நிலையான கோப்புகளின் முடிவில் `` _t`` ஐச் சேர்க்கலாம். இது ஸ்பிங்க்ஸ் இந்த கோப்புகளை வார்ப்புரு இயந்திரத்துடன் செயலாக்க வழிவகுக்கும், இது மாறிகள் உட்பொதிக்கவும், நடத்தை கட்டுப்படுத்தவும் உங்களை அனுமதிக்கிறது.

source: For example, the following JavaScript structure:
ta: எடுத்துக்காட்டாக, பின்வரும் ஜாவாஸ்கிரிப்ட் அமைப்பு:

source: Will result in the following static file placed in your HTML's build output:
ta: உங்கள் HTML இன் உருவாக்க வெளியீட்டில் பின்வரும் நிலையான கோப்பை ஏற்படுத்தும்:

source: See :ref:`theming-static-templates` for more information.
ta: காண்க: குறிப்பு: மேலும் தகவலுக்கு `தீமிங்-ஸ்டாடிக்-டெம்ப்ளேட்டுகள்`.

source: Second, you may use the :meth:`.Sphinx.add_js_file` method without pointing it to a file. Normally, this method is used to insert a new JavaScript file into your site. However, if you do *not* pass a file path, but instead pass a string to the "body" argument, then this text will be inserted as JavaScript into your site's head. This allows you to insert variables into your project's JavaScript from Python.
ta: இரண்டாவதாக, நீங்கள்: `.sphinx.add_js_file` முறையை ஒரு கோப்பில் சுட்டிக்காட்டாமல் பயன்படுத்தலாம். பொதுவாக, உங்கள் தளத்தில் புதிய ஜாவாஸ்கிரிப்ட் கோப்பை செருக இந்த முறை பயன்படுத்தப்படுகிறது. இருப்பினும், நீங்கள் ஒரு கோப்பு பாதையை கடந்து செல்லவில்லை என்றால், அதற்கு பதிலாக "உடல்" வாதத்திற்கு ஒரு சரத்தை அனுப்பினால், இந்த உரை உங்கள் தளத்தின் தலையில் ஜாவாஸ்கிரிப்டாக செருகப்படும். பைத்தானில் இருந்து உங்கள் திட்டத்தின் ஜாவாஸ்கிரிப்டில் மாறிகள் செருக இது உங்களை அனுமதிக்கிறது.

source: For example, the following code will read in a user-configured value and then insert this value as a JavaScript variable, which your extension's JavaScript code may use:
ta: எடுத்துக்காட்டாக, பின்வரும் குறியீடு பயனர் கட்டமைக்கப்பட்ட மதிப்பில் படிக்கும், பின்னர் இந்த மதிப்பை ஜாவாஸ்கிரிப்ட் மாறியாக செருகும், இது உங்கள் நீட்டிப்பின் ஜாவாஸ்கிரிப்ட் குறியீடு பயன்படுத்தலாம்:

source: As a result, in your theme you can use code that depends on the presence of this variable. Users can control the variable's value by defining it in their :file:`conf.py` file.
ta: இதன் விளைவாக, உங்கள் கருப்பொருளில் இந்த மாறியின் இருப்பைப் பொறுத்தது குறியீட்டைப் பயன்படுத்தலாம். பயனர்கள் மாறியின் மதிப்பை அவற்றின்: கோப்பு: `conf.py` கோப்பில் வரையறுப்பதன் மூலம் கட்டுப்படுத்தலாம்.

source: It is not an executable Python file, as opposed to :file:`conf.py`, because that would pose an unnecessary security risk if themes are shared.
ta: இது இயங்கக்கூடிய பைதான் கோப்பு அல்ல, இதற்கு மாறாக: கோப்பு: `conf.py`, ஏனென்றால் கருப்பொருள்கள் பகிரப்பட்டால் அது தேவையற்ற பாதுகாப்பு அபாயத்தை ஏற்படுத்தும்.
