Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_changes--1_5_*.po
Languages: ta

source: #777: LaTeX output "too deeply nested" (ref #3096)
ta: #777: லாடெக்சு வெளியீடு "மிக ஆழமாக உள்ளமை" (குறிப்பு #3096)

source: Let LaTeX image inclusion obey ``scale`` before textwidth fit (ref #2865, #3059)
ta: லாடெக்சு படத்தைச் சேர்ப்பது, உரை அகலப் பொருத்தத்திற்கு முன் ``அளவு```க்குக் கீழ்ப்படியட்டும் (குறிப்பு #2865, #3059)

source: #3019: LaTeX fails on description of C function with arguments (ref #3083)
ta: #3019: வாதங்களுடன் C செயல்பாட்டின் விளக்கத்தில் லாடெக்சு தோல்வியடைந்தது (ref #3083)

source: fix latex inline literals where ``< > -`` gobbled a space
ta: `` <> --`` ஒரு இடத்தை மாற்றியமைக்கும் லேடெக்ஸ் இன்லைன் லிட்டரர்களை சரிசெய்யவும்

source: #3069: Even if ``'babel'`` key is set to empty string, LaTeX output contains one ``\addto\captions...``
ta: #3069: ``'babel'`` விசை வெற்று சரமாக அமைக்கப்பட்டிருந்தாலும், லாடெக்சு வெளியீட்டில் ஒரு ``\addto\\captions...`` உள்ளது

source: #3123: user ``'babel'`` key setting is not obeyed anymore
ta: #3123: பயனர் ``'babel'`` விசை அமைப்பு இனி கடைப்பிடிக்கப்படாது

source: #3155: Fix JavaScript for ``html_sourcelink_suffix`` fails with IE and Opera
ta: #3155: ``html_sourcelink_suffix``க்கான சாவாகைஉரை ஐச் சரிசெய்தல் IE மற்றும் Opera உடன் தோல்வியடைகிறது

source: #3085: keep current directory after breaking build documentation. Thanks to Timotheus Kampik.
ta: #3085: உருவாக்க ஆவணங்களை உடைத்த பிறகு தற்போதைய கோப்பகத்தை வைத்திருங்கள். திமோதியச் காம்பிக் அவர்களுக்கு நன்றி.

source: #3181: pLaTeX crashes with a section contains endash
ta: #3181: pLaTeX ஆனது என்டாச் கொண்ட ஒரு பிரிவில் செயலிழக்கிறது

source: #3180: latex: add stretch/shrink between successive singleline or multipleline cpp signatures (ref #3072)
ta: #3180: லேடெக்ச்: தொடர்ச்சியான ஒற்றை வரி அல்லது மல்டிலைன் சிபிபி கையொப்பங்களுக்கு இடையில் நீட்டிப்பு/சுருக்கம் சேர் (குறிப்பு #3072)

source: #3128: globing images does not support .svgz file
ta: #3128: குளோபிங் படங்கள் .svgz கோப்பை ஆதரிக்காது

source: #3015: fix a broken test on Windows.
ta: #3015: சாளரங்களில் உடைந்த சோதனையை சரிசெய்யவும்.

source: #1843: Fix documentation of descriptor classes that have a custom metaclass. Thanks to Erik Bray.
ta: #1843: தனிப்பயன் மெட்டாகிளாச் கொண்ட விளக்க வகுப்புகளின் ஆவணங்களை சரிசெய்தல். எரிக் ப்ரேக்கு நன்றி.

source: #3190: util.split_docinfo fails to parse multi-line field bodies
ta: #3190: util.split_docinfo மல்டி-லைன் ஃபீல்ட் பாடிகளை அலசுவதில் தோல்வியடைந்தது

source: #3024, #3037: In Python3, application.Sphinx._log crushed when the log message cannot be encoded into console encoding.
ta: #3024, #3037: Python3 இல், application.Sphinx._log, பதிவு செய்தியை கன்சோல் குறியாக்கத்தில் குறியாக்கம் செய்ய முடியாதபோது நசுக்கப்பட்டது.

source: Testing
ta: சோதனை

source: To simplify, Sphinx uses external mock package even if ``unittest.mock`` exists.
ta: எளிமைப்படுத்த, ஸ்பின்க்ஸ் `` unittest.mock`` இருந்தாலும் வெளிப்புற போலி தொகுப்பைப் பயன்படுத்துகிறது.
