Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_changes--1_4_*.po
Languages: ta

source: #2522: Sphinx touches mo files under installed directory that caused permission error.
ta: #2522: அனுமதிப் பிழையை ஏற்படுத்திய நிறுவப்பட்ட கோப்பகத்தின் கீழ் சூரரிமாச்சிலை மோ கோப்புகளைத் தொடுகிறது.

source: #2536: C++, fix crash when an immediately nested scope has the same name as the current scope.
ta: #2536: C++, உடனடியாக உள்ளமைக்கப்பட்ட ச்கோப் தற்போதைய ச்கோப்பின் அதே பெயரைக் கொண்டிருக்கும்போது செயலிழப்பை சரிசெய்யவும்.

source: #2555: Fix crash on any-references with unicode.
ta: #2555: யூனிகோட் மூலம் ஏதேனும் குறிப்புகளில் செயலிழப்பை சரிசெய்யவும்.

source: #2517: wrong bookmark encoding in PDF if using LuaLaTeX
ta: #2517: LuaLaTeX ஐப் பயன்படுத்தினால் PDF இல் தவறான புத்தகக்குறி குறியாக்கம்

source: #2521: generated Makefile causes BSD make crashed if sphinx-build not found
ta: #2521: உருவாக்கப்பட்ட மேக்ஃபைல் ச்பிங்க்ச்-பில்ட் கண்டுபிடிக்கப்படவில்லை என்றால் BSD தயாரிப்பை செயலிழக்கச் செய்கிறது

source: #2470: ``typing`` backport package causes autodoc errors with python 2.7
ta: #2470: ``டைப்பிங்`` பேக்போர்ட் தொகுப்பு பைதான் 2.7 உடன் ஆட்டோடாக் பிழைகளை ஏற்படுத்துகிறது

source: ``sphinx.ext.intersphinx`` crashes if non-string value is used for key of ``intersphinx_mapping``
ta: ``இன்டர்ச்பிங்க்ச்_மேப்பிங்`` விசைக்கு சரம் அல்லாத மதிப்பு பயன்படுத்தப்பட்டால் ``sphinx.ext.intersphinx`` செயலிழக்கும்

source: #2518: ``intersphinx_mapping`` disallows non alphanumeric keys
ta: #2518: ``இன்டர்ச்பிங்க்ச்_மேப்பிங்`` எண்ணெழுத்து அல்லாத விசைகளை அனுமதிக்காது

source: #2558: unpack error on devhelp builder
ta: #2558: டெவ்எல்ப் பில்டரில் அன்பேக் பிழை

source: #2561: Info builder crashes when a footnote contains a link
ta: #2561: அடிக்குறிப்பில் இணைப்பு இருக்கும் போது செய்தி உருவாக்கி செயலிழக்கிறது

source: #2565: The descriptions of objects generated by ``sphinx.ext.autosummary`` overflow lines at LaTeX writer
ta: #2565: லாடெக்சு ரைட்டரில் ``sphinx.ext.autosummary`` ஓவர்ஃப்ளோ லைன்களால் உருவாக்கப்பட்ட பொருள்களின் விளக்கங்கள்

source: Extend pdflatex config in sphinx.sty to subparagraphs (ref: #2551)
ta: sphinx.sty இல் உள்ள pdflatex கட்டமைப்பை துணைப் பத்திகளாக நீட்டிக்கவும் (குறிப்பு: #2551)

source: #2445: ``rst_prolog`` and ``rst_epilog`` affect to non reST sources
ta: #2445: ``rst_prolog`` மற்றும் ``rst_epilog`` ஆகியவை reST அல்லாத ஆதாரங்களை பாதிக்கின்றன

source: #2576: ``sphinx.ext.imgmath`` crashes if subprocess raises error
ta: #2576: துணைச் செயல்முறை பிழையை எழுப்பினால் ``sphinx.ext.imgmath`` செயலிழக்கும்

source: #2577: ``sphinx.ext.imgmath``: Invalid argument are passed to dvisvgm
ta: #2577: ``sphinx.ext.imgmath``: தவறான மதிப்புரு dvisvgm க்கு அனுப்பப்பட்டது

source: #2556: Xapian search does not work with Python 3
ta: #2556: பைதான் 3 உடன் Xapian தேடல் வேலை செய்யாது

source: #2581: The search doesn't work if language="es" (Spanish)
ta: #2581: language="es" (ச்பானிச்) என்றால் தேடல் வேலை செய்யாது

source: #2382: Adjust spacing after abbreviations on figure numbers in LaTeX writer
ta: #2382: லாடெக்சு ரைட்டரில் உருவ எண்களின் சுருக்கங்களுக்குப் பிறகு இடைவெளியைச் சரிசெய்யவும்

source: #2383: The generated footnote by ``latex_show_urls`` overflows lines
ta: #2383: ``லேடெக்ச்_சோ_யூஆர்எல்ச்`` மூலம் உருவாக்கப்பட்ட அடிக்குறிப்பு வரிகள் வழிந்தோடுகிறது

source: #2497, #2552: The label of search button does not fit for the button itself
ta: #2497, #2552: தேடல் பொத்தானின் சிட்டை பொத்தானுக்குப் பொருந்தாது

source: Release 1.4.1 (released Apr 12, 2016)
ta: வெளியீடு 1.4.1 (ஏப்ரல் 12, 2016 வெளியிடப்பட்டது)

source: The default format of ``today_fmt`` and ``html_last_updated_fmt`` is back to strftime format again. Locale Date Markup Language is also supported for backward compatibility until Sphinx 1.5.
ta: ``today_fmt`` மற்றும் ``html_last_updated_fmt`` இன் இயல்புநிலை வடிவம் மீண்டும் strftime வடிவத்திற்குத் திரும்பியது. லோகேல் தேதி மார்க்அப் மொழியானது சூரரிமாச்சிலை 1.5 வரை பின்தங்கிய இணக்கத்தன்மைக்கு துணைபுரிகிறது.

source: Translations
ta: மொழிபெயர்ப்புகள்

source: Added Welsh translation, thanks to Geraint Palmer.
ta: வெல்ஷ் மொழிபெயர்ப்பு சேர்க்கப்பட்டது, ஜெரைண்ட் பால்மருக்கு நன்றி.

source: Added Greek translation, thanks to Stelios Vitalis.
ta: கிரேக்க மொழிபெயர்ப்பு சேர்க்கப்பட்டது, ஸ்டெலியோஸ் விட்டலிஸுக்கு நன்றி.

source: Added Esperanto translation, thanks to Dinu Gherman.
ta: எஸ்பெராண்டோ மொழிபெயர்ப்பு சேர்க்கப்பட்டது, தினு கெர்மனுக்கு நன்றி.

source: Added Hindi translation, thanks to Purnank H. Ghumalia.
ta: இந்தி மொழிபெயர்ப்பு சேர்க்கப்பட்டது, பர்னங்க் எச். குமாலியாவுக்கு நன்றி.

source: Added Romanian translation, thanks to Razvan Stefanescu.
ta: ருமேனிய மொழிபெயர்ப்பைச் சேர்த்தது, ரஸ்வன் ஸ்டெபனெஸ்கு நன்றி.

source: C++, added support for ``extern`` and ``thread_local``.
ta: சி ++, `` வெளிப்புற`` மற்றும் `` நூல்_லோகல்`` ஆகியவற்றிற்கான ஆதரவைச் சேர்த்தது.

source: C++, type declarations are now using the prefixes ``typedef``, ``using``, and ``type``, depending on the style of declaration.
ta: சி ++, வகை அறிவிப்புகள் இப்போது அறிவிப்பு பாணியைப் பொறுத்து `` டைப் டெஃப்``, `` பயன்படுத்துதல்`, மற்றும் `` வகை` ஆகியவற்றைப் பயன்படுத்துகின்றன.

source: #2413: C++, fix crash on duplicate declarations
ta: #2413: C++, நகல் அறிவிப்புகளில் செயலிழப்பை சரிசெய்யவும்

source: #2394: Sphinx crashes when html_last_updated_fmt is invalid
ta: #2394: html_last_updated_fmt செல்லாத போது சூரரிமாச்சிலை செயலிழக்கிறது

source: #2408: dummy builder not available in Makefile and make.bat
ta: #2408: உருவாக்ககோப்பு மற்றும் make.bat இல் போலி பில்டர் கிடைக்கவில்லை

source: #2412: hyperlink targets are broken in LaTeX builder
ta: #2412: லாடெக்சு பில்டரில் ஐப்பர்லிங்க் இலக்குகள் உடைக்கப்பட்டுள்ளன

source: figure directive crashes if non paragraph item is given as caption
ta: பத்தி அல்லாத உருப்படி தலைப்பாக வழங்கப்பட்டால் படம் டைரெக்டிவ் செயலிழக்கிறது

source: #2418: time formats no longer allowed in today_fmt
ta: #2418: இன்றைய_எஃப்எம்டியில் நேர வடிவங்கள் இனி அனுமதிக்கப்படாது

source: #2395: Sphinx crashes if unicode character in image filename
ta: #2395: பட கோப்பு பெயரில் யூனிகோட் எழுத்து இருந்தால் சூரரிமாச்சிலை செயலிழக்கும்

source: #2396: "too many values to unpack" in genindex-single
ta: #2396: genindex-single இல் "அன்பேக் செய்ய பல மதிப்புகள்"

source: #2405: numref link in PDF jumps to the wrong location
ta: #2405: PDF இல் உள்ள numref இணைப்பு தவறான இடத்திற்குத் தாவுகிறது

source: #2414: missing number in PDF hyperlinks to code listings
ta: #2414: குறியீடு பட்டியல்களுக்கான PDF ஐப்பர்லிங்க்களில் எண் இல்லை

source: #2440: wrong import for gmtime. Thanks to Uwe L. Korn.
ta: #2440: gmtime க்கான தவறான இறக்குமதி. உவே எல். கோர்னுக்கு நன்றி.

source: Release 1.4 (released Mar 28, 2016)
ta: வெளியீடு 1.4 (மார்ச் 28, 2016 இல் வெளியிடப்பட்டது)

source: Drop ``PorterStemmer`` package support. Use ``PyStemmer`` instead of ``PorterStemmer`` to accelerate stemming.
ta: `` போர்ட்டர்ஸ்டெம்மர்` `தொகுப்பு ஆதரவை விடுங்கள். தண்டு விரைவுபடுத்துவதற்கு `` போர்ட்டர்ஸ்டெம்மர்` க்கு பதிலாக `` பிஸ்டம்மர்`` ஐப் பயன்படுத்தவும்.

source: ``sphinx_rtd_theme`` has become optional. Please install it manually. Refs #2087, #2086, #1845 and #2097. Thanks to Victor Zverovich.
ta: ``sphinx_rtd_theme`` விருப்பமானது. அதை கைமுறையாக நிறுவவும். குறிப்புகள் #2087, #2086, #1845 மற்றும் #2097. விக்டர் ச்வெரோவிச் அவர்களுக்கு நன்றி.

source: #2231: Use DUrole instead of DUspan for custom roles in LaTeX writer. It enables to take title of roles as an argument of custom macros.
ta: #2231: லாடெக்சு எழுத்தாளரில் தனிப்பயன் பாத்திரங்களுக்கு DUspan க்குப் பதிலாக DUrole ஐப் பயன்படுத்தவும். தனிப்பயன் மேக்ரோக்களின் வாதமாக பாத்திரங்களின் தலைப்பை எடுக்க இது உதவுகிறது.

source: #2022: 'Thumbs.db' and '.DS_Store' are added to ``exclude_patterns`` default values in conf.py that will be provided on sphinx-quickstart.
ta: #2022: 'Thumbs.db' மற்றும் '.DS_Store' ஆகியவை conf.py இல் உள்ள ``exclude_patterns`` இயல்பு மதிப்புகளில் சேர்க்கப்படும், அவை sphinx-quickstart இல் வழங்கப்படும்.

source: #2027, #2208: The ``html_title`` accepts string values only. And the ``None`` value cannot be accepted.
ta: #2027, #2208: ``html_title`` சர மதிப்புகளை மட்டுமே ஏற்கும். மேலும் ``ஒன்றுமில்லை`` மதிப்பை ஏற்க முடியாது.

source: ``sphinx.ext.graphviz``: show graph image in inline by default
ta: `` sphinx.ext.graphviz``: முன்னிருப்பாக இன்லைனில் வரைபட படத்தைக் காட்டு

source: #2060, #2224: The ``manpage`` role now generate ``sphinx.addnodes.manpage`` node instead of ``sphinx.addnodes.literal_emphasis`` node.
ta: #2060, #2224: ``manpage`` பங்கு இப்போது ``sphinx.addnodes.literal_emphasis`` முனைக்கு பதிலாக ``sphinx.addnodes.manpage`` முனையை உருவாக்குகிறது.

source: #2022: :confval:`html_extra_path` also copies dotfiles in the extra directory, and refers to :confval:`exclude_patterns` to exclude extra files and directories.
ta: #2022: :confval:`html_extra_path` கூடுதல் கோப்பகத்தில் டாட்ஃபைல்களையும் நகலெடுக்கிறது, மேலும் கூடுதல் கோப்புகள் மற்றும் கோப்பகங்களைத் தவிர்க்க :confval:`exclude_patterns` என்பதைக் குறிக்கிறது.

source: #2300: enhance autoclass:: to use the docstring of __new__ if __init__ method's is missing of empty
ta: #2300: ஆட்டோகிளாசை மேம்படுத்தவும்:: __new__ மற்றும் __init__ முறையின் ஆவணசரம் பயன்படுத்த காலியாக உள்ளது

source: #2251: Previously, under glossary directives, multiple terms for one definition are converted into single ``term`` node and the each terms in the term node are separated by ``termsep`` node. In new implementation, each terms are converted into individual ``term`` nodes and ``termsep`` node is removed. By this change, output layout of every builders are changed a bit.
ta: #2251: முன்னர், சொற்களஞ்சிய வழிகாட்டுதல்களின் கீழ், ஒரு வரையறைக்கான பல சொற்கள் ஒற்றை ``டேர்ம்`` முனையாக மாற்றப்பட்டு, முனையில் உள்ள ஒவ்வொரு சொற்களும் ``டெர்ம்செப்`` முனையால் பிரிக்கப்படுகின்றன. புதிய செயலாக்கத்தில், ஒவ்வொரு விதிமுறைகளும் தனிப்பட்ட ``டேர்ம்`` முனைகளாக மாற்றப்பட்டு ``டெர்ம்செப்`` முனை அகற்றப்படும். இந்த மாற்றத்தால், ஒவ்வொரு பில்டர்களின் அவுட்புட் லேஅவுட் சிறிது மாற்றப்படுகிறது.

source: The default highlight language is now Python 3. This means that source code is highlighted as Python 3 (which is mostly a superset of Python 2), and no parsing is attempted to distinguish valid code. To get the old behavior back, add ``highlight_language = "python"`` to conf.py.
ta: இயல்புநிலை சிறப்பம்சமாக மொழி இப்போது பைதான் 3 ஆகும். இதன் பொருள் மூலக் குறியீடு பைதான் 3 ஆக முன்னிலைப்படுத்தப்படுகிறது (இது பெரும்பாலும் பைதான் 2 இன் சூப்பர்செட்), மற்றும் செல்லுபடியாகும் குறியீட்டை வேறுபடுத்துவதற்கு எந்த பாகுபடுத்தலும் முயற்சிக்கவில்லை. பழைய நடத்தையைத் திரும்பப் பெற, `` சிறப்பம்சமாக_எல்ஜேஜ் = "பைதான்" `` `conf.py இல் சேர்க்கவும்.

source: `Locale Date Markup Language <https://unicode.org/reports/tr35/tr35-dates.html#Date_Format_Patterns>`_ like ``"MMMM dd, YYYY"`` is default format for ``today_fmt`` and ``html_last_updated_fmt``. However strftime format like ``"%B %d, %Y"`` is also supported for backward compatibility until Sphinx 1.5. Later format will be disabled from Sphinx 1.5.
ta: ``"MMMM dd, YYYY"`` போன்ற `உள்ளூர் தேதி மார்க்அப் மொழி <https://unicode.org/reports/tr35/tr35-dates.html#Date_Format_Patterns>`_ என்பது ``today_fmt`l_fmt`l_க்கு இயல்புநிலை வடிவமாகும். இருப்பினும் ``"%B %d, %Y"`` போன்ற strftime வடிவம் சூரரிமாச்சிலை 1.5 வரை பின்தங்கிய இணக்கத்தன்மைக்கு துணைபுரிகிறது. பின்னர் வடிவம் சூரரிமாச்சிலை 1.5 இலிருந்து முடக்கப்படும்.

source: #2327: ``latex_use_parts`` is deprecated now. Use ``latex_toplevel_sectioning`` instead.
ta: #2327: ``லேடெக்ச்_யூச்_பார்ட்ச்`` இப்போது நிறுத்தப்பட்டது. அதற்குப் பதிலாக ```latex_toplevel_sectioning`` ஐப் பயன்படுத்தவும்.

source: #2337: Use ``\url{URL}`` macro instead of ``\href{URL}{URL}`` in LaTeX writer.
ta: #2337: லாடெக்சு ரைட்டரில் ``\href{URL}{URL}`` என்பதற்குப் பதிலாக ``\url{URL}`` மேக்ரோவைப் பயன்படுத்தவும்.

source: #1498: manpage writer: don't make whole of item in definition list bold if it includes strong node.
ta: #1498: manpage ரைட்டர்: வரையறைப் பட்டியலில் உள்ள உருப்படி முழுவதையும் தடிமனாக மாற்ற வேண்டாம்.

source: #582: Remove hint message from quick search box for html output.
ta: #582: உஉகுமொ வெளியீட்டிற்கான விரைவான தேடல் பெட்டியில் இருந்து குறிப்பு செய்தியை அகற்றவும்.

source: #2378: Sphinx now bundles newfloat.sty
ta: #2378: சூரரிமாச்சிலை இப்போது newfloat.sty தொகுப்புகளை உருவாக்குகிறது

source: #2092: add todo directive support in napoleon package.
ta: #2092: நெப்போலியன் தொகுப்பில் செய்யவேண்டிய டைரக்டிவ் ஆதரவைச் சேர்க்கவும்.

source: #1962: when adding directives, roles or nodes from an extension, warn if such an element is already present (built-in or added by another extension).
ta: #1962: ஒரு நீட்டிப்பிலிருந்து வழிமுறைகள், பாத்திரங்கள் அல்லது முனைகளைச் சேர்க்கும்போது, ​​அத்தகைய உறுப்பு ஏற்கனவே இருந்தால் (உள்ளமைக்கப்பட்ட அல்லது மற்றொரு நீட்டிப்பால் சேர்க்கப்பட்டது) எச்சரிக்கவும்.

source: #1909: Add "doc" references to Intersphinx inventories.
ta: #1909: Intersphinx சரக்குகளில் "டாக்" குறிப்புகளைச் சேர்க்கவும்.

source: C++ type alias support (e.g., ``.. type:: T = int``).
ta: C ++ வகை மாற்றுப்பெயர் ஆதரவு (எ.கா., `` .. வகை :: t = int``).

source: C++ template support for classes, functions, type aliases, and variables (#1729, #1314).
ta: வகுப்புகள், செயல்பாடுகள், வகை மாற்றுப்பெயர்கள் மற்றும் மாறிகளுக்கான C++ டெம்ப்ளேட் உதவி (#1729, #1314).

source: C++, added new scope management directives ``namespace-push`` and ``namespace-pop``.
ta: சி ++, புதிய நோக்கம் மேலாண்மை உத்தரவுகளை `` பெயர்வெளி-புஷ்`` மற்றும் `` பெயர்வெளி-பாப்`` சேர்த்தது.

source: #1970: Keyboard shortcuts to navigate Next and Previous topics
ta: #1970: அடுத்த மற்றும் முந்தைய தலைப்புகளுக்கு செல்ல விசைப்பலகை குறுக்குவழிகள்

source: Intersphinx: Added support for fetching Intersphinx inventories with URLs using HTTP basic auth.
ta: இன்டெர்ஸ்பின்க்ஸ்: HTTP அடிப்படை அங்கீகாரத்தைப் பயன்படுத்தி URL களுடன் இன்டர்ஸ்பின்க்ஸ் சரக்குகளைப் பெறுவதற்கான ஆதரவு சேர்க்கப்பட்டது.

source: C++, added support for template parameter in function info field lists.
ta: சி ++, செயல்பாட்டு தகவல் புல பட்டியல்களில் வார்ப்புரு அளவுருவுக்கு ஆதரவு சேர்க்கப்பட்டது.

source: C++, added support for pointers to member (function).
ta: சி ++, உறுப்பினருக்கு (செயல்பாடு) சுட்டிகளுக்கு ஆதரவு சேர்க்கப்பட்டது.

source: #2113: Allow ``:class:`` option to code-block directive.
ta: #2113: '`:class:`` விருப்பத்தை குறியீடு-தடுப்பு கட்டளையை அனுமதிக்கவும்.

source: #2192: Imgmath (pngmath with svg support).
ta: #2192: Imgmath (svg ஆதரவுடன் pngmath).

source: #2200: Support XeTeX and LuaTeX for the LaTeX builder.
ta: #2200: லாடெக்சு பில்டருக்கான XeTeX மற்றும் LuaTeX ஐ ஆதரிக்கவும்.

source: #1906: Use xcolor over color for \fcolorbox where available for LaTeX output.
ta: #1906: லாடெக்சு வெளியீடு கிடைக்கும் இடங்களில் \fcolorboxக்கு xcolor மேல் வண்ணத்தைப் பயன்படுத்தவும்.

source: #2216: Texinputs makefile improvements.
ta: #2216: டெக்ச்இன்புட்ச் மேக்ஃபைல் மேம்பாடுகள்.

source: #2170: Support for Chinese language search index.
ta: #2170: சீன மொழி தேடல் குறியீட்டிற்கான உதவி.

source: #2214: Add sphinx.ext.githubpages to publish the docs on GitHub Pages
ta: #2214: GitHub பக்கங்களில் ஆவணங்களை வெளியிட sphinx.ext.githubpages ஐச் சேர்க்கவும்

source: #1030: Make page reference names for latex_show_pagerefs translatable
ta: #1030: லேடெக்ச்_சோ_பேச்ரெஃப்களுக்கான பக்கக் குறிப்புப் பெயர்களை மொழிபெயர்க்கலாம்

source: #2162: Add Sphinx.add_source_parser() to add source_suffix and source_parsers from extension
ta: #2162: source_suffix மற்றும் source_parsers ஐ நீட்டிப்பிலிருந்து சேர்க்க Sphinx.add_source_parser() ஐ சேர்க்கவும்

source: #2207: Add sphinx.parsers.Parser class; a base class for new parsers
ta: #2207: sphinx.parsers.Parser வகுப்பு சேர்; புதிய பாகுபடுத்திகளுக்கான அடிப்படை வகுப்பு

source: #656: Add ``graphviz_dot`` option to graphviz directives to switch the ``dot`` command
ta: #656: ``dot`` கட்டளையை மாற்ற, graphviz வழிமுறைகளில் ``graphviz_dot`` விருப்பத்தைச் சேர்க்கவும்

source: #1939: Added the ``dummy`` builder: syntax check without output.
ta: #1939: ``டம்மி`` பில்டர் சேர்க்கப்பட்டது: வெளியீடு இல்லாமல் தொடரியல் சரிபார்ப்பு.

source: #2230: Add ``math_number_all`` option to number all displayed math in math extensions
ta: #2230: கணித நீட்டிப்புகளில் காட்டப்படும் அனைத்து கணிதத்தையும் எண்ணுவதற்கு ``கணித_எண்_அனைத்து`` விருப்பத்தைச் சேர்க்கவும்

source: #2235: ``needs_sphinx`` supports micro version comparison
ta: #2235: ``நீட்ச்_ச்பிங்க்ச்`` மைக்ரோ பதிப்பு ஒப்பீட்டை ஆதரிக்கிறது

source: #2282: Add "language" attribute to html tag in the "basic" theme
ta: #2282: "அடிப்படை" தீமில் உஉகுமொ குறிச்சொல்லில் "மொழி" பண்புக்கூறைச் சேர்க்கவும்

source: #1779: Add EPUB 3 builder
ta: #1779: EPUB 3 பில்டரைச் சேர்க்கவும்

source: #1751: Add :confval:`todo_link_only` to avoid file path and line indication on :rst:dir:`todolist`. Thanks to Francesco Montesano.
ta: #1751: :rst:dir:`todolist` இல் கோப்பு பாதை மற்றும் வரி குறிப்பை தவிர்க்க :confval:`todo_link_only` ஐ சேர்க்கவும். ஃபிரான்செச்கோ மான்டெசானோவுக்கு நன்றி.

source: #2199: Use ``imagesize`` package to obtain size of images.
ta: #2199: படங்களின் அளவைப் பெற ``imagesize`` தொகுப்பைப் பயன்படுத்தவும்.

source: #1099: Add configurable retries to the linkcheck builder. Thanks to Alex Gaynor. Also don't check anchors starting with ``!``.
ta: #1099: இணைப்புச் சரிபார்ப்பு பில்டரில் உள்ளமைக்கக்கூடிய மறு முயற்சிகளைச் சேர்க்கவும். அலெக்ச் கெய்னருக்கு நன்றி. மேலும் ``!`` என்று தொடங்கும் ஆங்கர்களை சரிபார்க்க வேண்டாம்.

source: #1858: Add Sphinx.add_enumerable_node() to add enumerable nodes for numfig feature
ta: #1858: numfig அம்சத்திற்காக எண்ணக்கூடிய முனைகளைச் சேர்க்க Sphinx.add_enumerable_node() ஐச் சேர்க்கவும்

source: #1286, #2099: Add ``sphinx.ext.autosectionlabel`` extension to allow reference sections using its title. Thanks to Tadhg O'Higgins.
ta: #1286, #2099: அதன் தலைப்பைப் பயன்படுத்தி குறிப்புப் பிரிவுகளை அனுமதிக்க ``sphinx.ext.autosectionlabel`` நீட்டிப்பைச் சேர்க்கவும். Tadhg O'Higgins க்கு நன்றி.

source: #1854: Allow to choose Janome for Japanese splitter.
ta: #1854: சப்பானிய ச்ப்ளிட்டருக்கான சானோமைத் தேர்வுசெய்ய அனுமதிக்கவும்.

source: #1853: support custom text splitter on html search with ``language='ja'``.
ta: #1853: ``மொழி='சா'`` உடன் உஉகுமொ தேடலில் தனிப்பயன் உரை பிரிப்பானை ஆதரிக்கவும்.

source: #2320: classifier of glossary terms can be used for index entries grouping key The classifier also be used for translation. See also :ref:`glossary-directive`.
ta: #2320: சொற்களஞ்சியச் சொற்களின் வகைப்படுத்தி குறியீட்டு உள்ளீடுகளுக்குப் பயன்படுத்தப்படலாம். மேலும் பார்க்கவும் :ref:`glossary-directive`.

source: #2308: Define ``\tablecontinued`` macro to redefine the style of continued label for longtables.
ta: #2308: லாங்டேபிள்களுக்கான தொடர்ச்சியான லேபிளின் பாணியை மறுவரையறை செய்ய ``\tablecontinued`` மேக்ரோவை வரையறுக்கவும்.

source: Select an image by similarity if multiple images are globbed by ``.. image:: filename.*``
ta: பல படங்கள் `` .. படம் :: கோப்பு பெயர் ஆகியவற்றால் குளோப் செய்யப்பட்டால் ஒற்றுமையால் ஒரு படத்தைத் தேர்ந்தெடுக்கவும்.*``

source: #1921: Support figure substitutions by :confval:`language` and :confval:`figure_language_filename`
ta: #1921: :confval:`language` மற்றும் :confval:`figure_language_filename` மூலம் எண்ணிக்கை மாற்றீடுகளை ஆதரிக்கவும்

source: #2245: Add ``latex_elements["passoptionstopackages"]`` option to call PassOptionsToPackages in early stage of preambles.
ta: #2245: முன்னுரைகளின் ஆரம்ப கட்டத்தில் PassOptionsToPackages ஐ அழைக்க ``latex_elements["passoptionstopackages"]`` விருப்பத்தைச் சேர்க்கவும்.

source: #2340: Math extension: support alignment of multiple equations for MathJax.
ta: #2340: கணித நீட்டிப்பு: MathJax க்கான பல சமன்பாடுகளின் உதவி சீரமைப்பு.

source: #2338: Define ``\titleref`` macro to redefine the style of ``title-reference`` roles.
ta: #2338: ``தலைப்பு-குறிப்பு`` பாத்திரங்களின் பாணியை மறுவரையறை செய்ய ``\titleref`` மேக்ரோவை வரையறுக்கவும்.

source: Define ``\menuselection`` and ``\accelerator`` macros to redefine the style of ``menuselection`` roles.
ta: ``மெனுசெலக்சன்`` ரோல்களின் பாணியை மறுவரையறை செய்ய ``\menuselection`` மற்றும் ``\accelerator`` மேக்ரோக்களை வரையறுக்கவும்.

source: Define ``\crossref`` macro to redefine the style of references
ta: குறிப்புகளின் பாணியை மறுவரையறை செய்ய `` \ கிராஸ் ரீஃப்` மேக்ரோவை வரையறுக்கவும்

source: #2301: Texts in the classic html theme should be hyphenated.
ta: #2301: கிளாசிக் உஉகுமொ தீமில் உள்ள உரைகள் ஐபனேட் செய்யப்பட வேண்டும்.

source: #2355: Define ``\termref`` macro to redefine the style of ``term`` roles.
ta: #2355: ``term`` பாத்திரங்களின் பாணியை மறுவரையறை செய்ய ``\termref`` மேக்ரோவை வரையறுக்கவும்.

source: Add :confval:`suppress_warnings` to suppress arbitrary warning message (experimental)
ta: சேர்: confval: தன்னிச்சையான எச்சரிக்கை செய்தியை அடக்குவதற்கு `அடக்கி_ வார்னிங்ஸ்` (சோதனை)

source: #2229: Fix no warning is given for unknown options
ta: #2229: தெரியாத விருப்பங்களுக்கு எந்த எச்சரிக்கையும் வழங்கப்படவில்லை என்பதை சரிசெய்யவும்

source: #2327: Add ``latex_toplevel_sectioning`` to switch the top level sectioning of LaTeX document.
ta: #2327: லாடெக்சு ஆவணத்தின் மேல் நிலைப் பிரிவை மாற்ற ``லேடெக்ச்_டோப்லெவல்_பிரிவு`` சேர்க்கவும்.

source: #1913: C++, fix assert bug for enumerators in next-to-global and global scope.
ta: #1913: C++, அடுத்த உலகளாவிய மற்றும் உலகளாவிய நோக்கத்தில் கணக்கீட்டாளர்களுக்கான உறுதியான பிழையை சரிசெய்யவும்.

source: C++, fix parsing of 'signed char' and 'unsigned char' as types.
ta: சி ++, 'கையொப்பமிடப்பட்ட கரி' மற்றும் 'கையொப்பமிடாத கரி' ஆகியவற்றின் பாகுபடுத்தலை வகைகளாக சரிசெய்யவும்.

source: C++, add missing support for 'friend' functions.
ta: சி ++, 'நண்பர்' செயல்பாடுகளுக்கு காணாமல் போன ஆதரவைச் சேர்க்கவும்.

source: C++, add missing support for virtual base classes (thanks to Rapptz).
ta: சி ++, மெய்நிகர் அடிப்படை வகுப்புகளுக்கு காணாமல் போன ஆதரவைச் சேர்க்கவும் (ராப்ட்ஸுக்கு நன்றி).

source: C++, add support for final classes.
ta: சி ++, இறுதி வகுப்புகளுக்கு ஆதரவைச் சேர்க்கவும்.

source: C++, fix parsing of types prefixed with 'enum'.
ta: சி ++, 'enum' உடன் முன்னொட்டப்பட்ட வகைகளின் பாகுபடுத்தலை சரிசெய்யவும்.

source: #2023: Dutch search support uses Danish stemming info.
ta: #2023: டச்சு தேடல் உதவி டேனிச் ச்டெமிங் தகவலைப் பயன்படுத்துகிறது.

source: C++, add support for user-defined literals.
ta: சி ++, பயனர் வரையறுக்கப்பட்ட எழுத்தாளர்களுக்கு ஆதரவைச் சேர்க்கவும்.

source: #1804: Now html output wraps overflowed long-line-text in the sidebar. Thanks to Hassen ben tanfous.
ta: #1804: இப்போது உஉகுமொ அவுட்புட் ரேப்கள் பக்கப்பட்டியில் நீண்ட வரி-உரையை நிரம்பி வழிகின்றன. ஆசன் பென் டான்ஃபோசுக்கு நன்றி.

source: #2183: Fix porterstemmer causes ``make json`` to fail.
ta: #2183: Fix porterstemmer ``make json`` தோல்வியடையும்.

source: #1899: Ensure list is sent to OptParse.
ta: #1899: பட்டியல் OptParse க்கு அனுப்பப்படுவதை உறுதிசெய்யவும்.

source: #2164: Fix wrong check for pdftex inside sphinx.sty (for graphicx package option).
ta: #2164: sphinx.sty இன் உள்ளே pdftex க்கான தவறான சரிபார்ப்பை சரிசெய்யவும் (graphicx தொகுப்பு விருப்பத்திற்கு).

source: #2165, #2218: Remove faulty and non-need conditional from sphinx.sty.
ta: #2165, #2218: sphinx.sty இலிருந்து தவறான மற்றும் தேவையற்ற நிபந்தனைகளை அகற்றவும்.

source: Fix broken LaTeX code is generated if unknown language is given
ta: அறியப்படாத மொழி வழங்கப்பட்டால் உடைந்த லேடெக்ஸ் குறியீடு உருவாக்கப்படுகிறது

source: #1944: Fix rst_prolog breaks file-wide metadata
ta: #1944: Fix rst_prolog கோப்பு அளவிலான மெட்டாடேட்டாவை உடைக்கிறது

source: #2074: make gettext should use canonical relative paths for .pot. Thanks to anatoly techtonik.
ta: #2074: உரைபெறு ஐ உருவாக்கவும் அனடோலி டெக்டோனிக்கிற்கு நன்றி.

source: #2311: Fix sphinx.ext.inheritance_diagram raises AttributeError
ta: #2311: sphinx.ext.inheritance_வரைபடம் பண்புப் பிழையை எழுப்புகிறது

source: #2251: Line breaks in .rst files are transferred to .pot files in a wrong way.
ta: #2251: .rst கோப்புகளில் உள்ள வரி முறிவுகள் தவறான வழியில் .pot கோப்புகளுக்கு மாற்றப்படும்.

source: #794: Fix date formatting in latex output is not localized
ta: #794: லேடெக்ச் வெளியீட்டில் ஃபிக்ச் டேட் ஃபார்மேட்டிங் உள்ளூர்மயமாக்கப்படவில்லை
