Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_extdev--builderapi_*.po
Languages: ta

source: Builder API
ta: பில்டர் ஏபிஐ

source: This is the base class for all builders.
ta: அனைத்து பில்டர்களுக்கும் இது அடிப்படை வகுப்பு.

source: It follows this basic workflow:
ta: இது இந்த அடிப்படை பணிப்பாய்வு பின்வருமாறு:

source: Call graph for the standard Sphinx build workflow
ta: நிலையான சூரரிமாச்சிலை உருவாக்க பணிப்பாய்வுக்கான அழைப்பு வரைபடம்

source: Overridable Attributes
ta: மீறக்கூடிய பண்புக்கூறுகள்

source: These class attributes should be set on builder sub-classes:
ta: இந்த வகுப்பு பண்புக்கூறுகள் பில்டர் துணை வகுப்புகளில் அமைக்கப்பட வேண்டும்:

source: The builder's name. This is the value used to select builders on the command line.
ta: கட்டியவர் பெயர். கட்டளை வரியில் பில்டர்களைத் தேர்ந்தெடுக்கப் பயன்படுத்தப்படும் மதிப்பு இதுவாகும்.

source: The builder's output format, or '' if no document output is produced. This is commonly the file extension, e.g. "html", though any string value is accepted. The builder's format string can be used by various components such as :class:`.SphinxPostTransform` or extensions to determine their compatibility with the builder.
ta: பில்டரின் வெளியீட்டு வடிவம், அல்லது ஆவண வெளியீடு எதுவும் உருவாக்கப்படவில்லை என்றால். இது பொதுவாக கோப்பு நீட்டிப்பு, எ.கா. "html", எந்த சர மதிப்பு ஏற்றுக்கொள்ளப்பட்டாலும். பில்டரின் வடிவமைப்பு சரத்தை :class:`.SphinxPostTransform` அல்லது நீட்டிப்புகள் போன்ற பல்வேறு கூறுகளால் பில்டருடன் அவற்றின் இணக்கத்தன்மையை தீர்மானிக்க பயன்படுத்தலாம்.

source: The message emitted upon successful build completion. This can be a printf-style template string with the following keys: ``outdir``, ``project``
ta: வெற்றிகரமாக கட்டியெழுப்பப்பட்ட செய்தி. இது பின்வரும் விசைகளைக் கொண்ட ஒரு printf- பாணி வார்ப்புரு சரமாக இருக்கலாம்: `` outtir``, `` திட்டம்``

source: Whether it is safe to make parallel :meth:`~.Builder.write_doc` calls.
ta: இணை :meth:`~.Builder.write_doc` அழைப்புகளைச் செய்வது பாதுகாப்பானதா.

source: The list of MIME types of image formats supported by the builder. Image files are searched in the order in which they appear here.
ta: பில்டரால் ஆதரிக்கப்படும் பட வடிவங்களின் MIME வகைகளின் பட்டியல். படக் கோப்புகள் இங்கே தோன்றும் வரிசையில் தேடப்படுகின்றன.

source: The builder can produce output documents that may fetch external images when opened.
ta: திறக்கும் போது வெளிப்புறப் படங்களைப் பெறக்கூடிய வெளியீட்டு ஆவணங்களை பில்டர் உருவாக்க முடியும்.

source: The file format produced by the builder allows images to be embedded using data-URIs.
ta: பில்டரால் உருவாக்கப்பட்ட கோப்பு வடிவம் தரவு-URIகளைப் பயன்படுத்தி படங்களை உட்பொதிக்க அனுமதிக்கிறது.

source: default translator class for the builder. This can be overridden by :py:meth:`~sphinx.application.Sphinx.set_translator`.
ta: பில்டருக்கான இயல்புநிலை மொழிபெயர்ப்பாளர் வகுப்பு. இதை மீறலாம்: py: meth: `~ sphinx.application.sphinx.set_translator`.

source: Core Methods
ta: முக்கிய முறைகள்

source: These methods define the core build workflow and must not be overridden:
ta: இந்த முறைகள் முக்கிய உருவாக்க பணிப்பாய்வுகளை வரையறுக்கின்றன மற்றும் மேலெழுதப்படக்கூடாது:

source: Build all source files.
ta: அனைத்து மூல கோப்புகளையும் உருவாக்குங்கள்.

source: Only rebuild as much as needed for changes in the *filenames*.
ta: *கோப்பு பெயர்களில் *மாற்றங்களுக்கு தேவையான அளவு மட்டுமே மீண்டும் உருவாக்குங்கள்.

source: Only rebuild what was changed or added since last build.
ta: கடைசியாக உருவாக்கப்பட்டதிலிருந்து மாற்றப்பட்ட அல்லது சேர்க்கப்பட்டதை மட்டுமே மீண்டும் உருவாக்குங்கள்.

source: Main build method, usually called by a specific ``build_*`` method.
ta: முதன்மையான உருவாக்க முறை, பொதுவாக ஒரு குறிப்பிட்ட ``பில்ட்_*`` முறையால் அழைக்கப்படுகிறது.

source: First updates the environment, and then calls :meth:`!write`.
ta: முதலில் சூழலைப் புதுப்பிக்கிறது, பின்னர் அழைக்கிறது: மெத்: `! எழுதுங்கள்`.

source: (Re-)read all files new or changed since last update.
ta: (மறு-) கடைசியாக புதுப்பித்ததிலிருந்து புதிய அல்லது மாற்றப்பட்ட எல்லா கோப்புகளையும் படிக்கவும்.

source: Store all environment docnames in the canonical format (ie using SEP as a separator in place of os.path.sep).
ta: அனைத்து சுற்றுச்சூழல் ஆவணப்பெயர்களையும் நியமன வடிவத்தில் சேமிக்கவும் (அதாவது os.path.sep க்கு பதிலாக SEP ஐ பிரிப்பானாகப் பயன்படுத்துதல்).

source: Parse a file and add/update inventory entries for the doctree.
ta: ஒரு கோப்பை அலசவும் மற்றும் டாக்ட்ரீக்கான சரக்கு உள்ளீடுகளைச் சேர்க்கவும்/புதுப்பிக்கவும்.

source: Write the doctree to a file, to be used as a cache by re-builds.
ta: மறு உருவாக்கம் மூலம் தற்காலிக சேமிப்பாகப் பயன்படுத்த, கோப்பில் கோட்பாட்டை எழுதவும்.

source: Write builder specific output files.
ta: பில்டர் குறிப்பிட்ட வெளியீட்டு கோப்புகளை எழுதவும்.

source: Abstract Methods
ta: சுருக்க முறைகள்

source: These must be implemented in builder sub-classes:
ta: இவை பில்டர் துணை வகுப்புகளில் செயல்படுத்தப்பட வேண்டும்:

source: Return an iterable of output files that are outdated, or a string describing what an update build will build.
ta: காலாவதியான வெளியீட்டு கோப்புகளைத் தரவும் அல்லது புதுப்பிப்பு உருவாக்கம் என்ன உருவாக்கும் என்பதை விவரிக்கும் சரம்.

source: If the builder does not output individual files corresponding to source files, return a string here. If it does, return an iterable of those files that need to be written.
ta: மூல கோப்புகளுடன் தொடர்புடைய தனிப்பட்ட கோப்புகளை பில்டர் வெளியிடவில்லை என்றால், இங்கே ஒரு சரம் திருப்பித் தரவும். அவ்வாறு செய்தால், எழுதப்பட வேண்டிய அந்தக் கோப்புகளைத் திருப்பித் தரவும்.

source: Write the output file for the document
ta: ஆவணத்திற்கான வெளியீட்டு கோப்பை எழுதவும்

source: Parameters
ta: அளவுருக்கள்

source: the :term:`docname <document name>`.
ta: :term:`docname <ஆவணப் பெயர்>`.

source: defines the content to be written.
ta: எழுதப்பட வேண்டிய உள்ளடக்கத்தை வரையறுக்கிறது.

source: The output filename must be determined within this method, typically by calling :meth:`~.Builder.get_target_uri` or :meth:`~.Builder.get_relative_uri`.
ta: வெளியீட்டு கோப்பின் பெயரை இந்த முறையில் தீர்மானிக்க வேண்டும், பொதுவாக :meth:`~.Builder.get_target_uri` அல்லது :meth:`~.Builder.get_relative_uri`.

source: Return the target URI for a document name.
ta: ஆவண பெயருக்காக இலக்கு URI ஐ திருப்பித் தரவும்.

source: *typ* can be used to qualify the link characteristic for individual builders.
ta: * தனிப்பட்ட கட்டமைப்பாளர்களுக்கான இணைப்பு சிறப்பியல்புக்கு தகுதி பெற Type* பயன்படுத்தப்படலாம்.

source: Overridable Methods
ta: மீறக்கூடிய முறைகள்

source: These methods can be overridden in builder sub-classes:
ta: பில்டர் துணை வகுப்புகளில் இந்த முறைகள் மேலெழுதப்படலாம்:

source: Load necessary templates and perform initialization. The default implementation does nothing.
ta: தேவையான வார்ப்புருக்களை ஏற்றவும், துவக்கத்தையும் செய்யுங்கள். இயல்புநிலை செயல்படுத்தல் எதுவும் செய்யாது.

source: Write all documents in *docnames*.
ta: அனைத்து ஆவணங்களையும் *டாக்னேம்களில்* எழுதவும்.

source: This method can be overridden if a builder does not create output files for each document.
ta: ஒவ்வொரு ஆவணத்திற்கும் ஒரு பில்டர் வெளியீட்டு கோப்புகளை உருவாக்கவில்லை என்றால், இந்த முறை மேலெழுதப்படலாம்.

source: A place where you can add logic before :meth:`write_doc` is run
ta: இதற்கு முன் தர்க்கத்தை சேர்க்கக்கூடிய இடம்: மெத்: `write_doc` இயக்கப்படுகிறது

source: Where assets (images, static files, etc) are copied before writing
ta: சொத்துக்கள் (படங்கள், நிலையான கோப்புகள் போன்றவை) எழுதும் முன் நகலெடுக்கப்படும்

source: Return a relative URI between two source filenames.
ta: இரண்டு மூல கோப்பு பெயர்களுக்கு இடையில் ஒரு தொடர்புடைய யூரியைத் திருப்பித் தரவும்.

source: raises
ta: எழுப்புகிறது

source: :exc:`!NoUri` if there's no way to return a sensible URI.
ta: :exc:`!NoUri` ஒரு விவேகமான யூரி ஐ திரும்பப் பெற வழி இல்லை என்றால்.

source: Finish the building process.
ta: கட்டிட செயல்முறையை முடிக்கவும்.

source: The default implementation does nothing.
ta: இயல்புநிலை செயல்படுத்தல் எதுவும் செய்யாது.

source: Attributes
ta: பண்புக்கூறுகள்

source: Attributes that are callable from the builder instance:
ta: பில்டர் நிகழ்விலிருந்து அழைக்கக்கூடிய பண்புக்கூறுகள்:

source: An :class:`.EventManager` object.
ta: ஒரு: வகுப்பு: `.eventmanager` பொருள்.

source: Overridable Attributes (extensions)
ta: மீறக்கூடிய பண்புக்கூறுகள் (நீட்டிப்புகள்)

source: Builder sub-classes can set these attributes to support built-in extensions:
ta: பில்டர் துணை வகுப்புகள் உள்ளமைக்கப்பட்ட நீட்டிப்புகளை ஆதரிக்க இந்த பண்புகளை அமைக்கலாம்:

source: By default, the :mod:`linkcode <sphinx.ext.linkcode>` extension will only inject references for an ``html`` builder. The ``supported_linkcode`` class attribute can be defined in a non-HTML builder to support managing references generated by linkcode. The expected value for this attribute is an expression which is compatible with :rst:dir:`only`.
ta: இயல்பாக, :mod:`linkcode <sphinx.ext.linkcode>` நீட்டிப்பு ஒரு ``html`` பில்டருக்கான குறிப்புகளை மட்டுமே செலுத்தும். ``supported_linkcode`` வகுப்பு பண்புக்கூறை உஉகுமொ அல்லாத பில்டரில் வரையறுக்கலாம், இது இணைப்புக் குறியீடு மூலம் உருவாக்கப்படும் குறிப்புகளை நிர்வகிப்பதை ஆதரிக்கிறது. இந்தப் பண்புக்கூறுக்கான எதிர்பார்க்கப்படும் மதிப்பு :rst:dir:`only` உடன் இணக்கமான வெளிப்பாடு ஆகும்.

source: For example, if a builder was named ``custom-builder``, the following can be used:
ta: எடுத்துக்காட்டாக, ஒரு பில்டருக்கு ``கச்டம் பில்டர்`` எனப் பெயரிடப்பட்டிருந்தால், பின்வருவனவற்றைப் பயன்படுத்தலாம்:
