Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_usage--restructuredtext--directives_*.po
Languages: ta

source: Directives
ta: வழிமுறைகள்

source: :ref:`As previously discussed <rst-directives>`, a directive is a generic block of explicit markup. While Docutils provides a number of directives, Sphinx provides many more and uses directives as one of the primary extension mechanisms.
ta: . டொக்யூடில்ச் பல வழிமுறைகளை வழங்கும் அதே வேளையில், சூரரிமாச்சிலை இன்னும் பலவற்றை வழங்குகிறது மற்றும் முதன்மை நீட்டிப்பு வழிமுறைகளில் ஒன்றாக வழிமுறைகளைப் பயன்படுத்துகிறது.

source: See :doc:`/usage/domains/index` for roles added by domains.
ta: காண்க: doc: `/பயன்பாடு/களங்கள்/குறியீட்டு` களங்களால் சேர்க்கப்பட்ட பாத்திரங்களுக்கு.

source: Refer to the :ref:`reStructuredText Primer <rst-directives>` for an overview of the directives provided by Docutils.
ta: இதைப் பார்க்கவும்: ref: `மறுசீரமைப்பு டெக்ச்ட் ப்ரைமர் <rst-adrectives>` docutils வழங்கிய கட்டளைகளின் கண்ணோட்டத்திற்கு.

source: Table of contents
ta: உள்ளடக்க அட்டவணை

source: Since reStructuredText does not have facilities to interconnect several documents, or split documents into multiple output files, Sphinx uses a custom directive to add relations between the single files the documentation is made of, as well as tables of contents. The ``toctree`` directive is the central element.
ta: மறுகட்டமைக்கப்பட்ட உரை பல ஆவணங்களை ஒன்றோடொன்று இணைக்கவோ அல்லது ஆவணங்களை பல வெளியீட்டு கோப்புகளாகப் பிரிக்கவோ வசதிகள் இல்லாததால், ஆவணங்கள் உருவாக்கப்பட்ட ஒற்றைக் கோப்புகள் மற்றும் உள்ளடக்க அட்டவணைகளுக்கு இடையேயான உறவுகளைச் சேர்க்க சூரரிமாச்சிலை தனிப்பயன் கட்டளையைப் பயன்படுத்துகிறது. ``டோக்ட்ரீ`` கட்டளை மைய உறுப்பு ஆகும்.

source: Simple "inclusion" of one file in another can be done with the :dudir:`include` directive.
ta: ஒரு கோப்பின் எளிய "சேர்த்தல்" மற்றொன்றுடன் செய்யப்படலாம்: tudir: `சேர்க்கவும்` கட்டளை.

source: To create table of contents for current document (.rst file), use the standard reStructuredText :dudir:`contents directive <table-of-contents>`.
ta: தற்போதைய ஆவணத்திற்கான (.rst கோப்பு) உள்ளடக்க அட்டவணையை உருவாக்க, நிலையான மறுகட்டமைக்கப்பட்ட உரை :dudir:`contents கட்டளை <table-of-contents>` ஐப் பயன்படுத்தவும்.

source: This directive inserts a "TOC tree" at the current location, using the individual TOCs (including "sub-TOC trees") of the documents given in the directive body. Relative document names (not beginning with a slash) are relative to the document the directive occurs in, absolute names are relative to the source directory. A numeric ``maxdepth`` option may be given to indicate the depth of the tree; by default, all levels are included. [#]_
ta: இந்த கட்டளை தற்போதைய இடத்தில் "toc மரம்" ஐ செருகுகிறது, டைரெக்டிவ் உடலில் கொடுக்கப்பட்ட ஆவணங்களின் தனிப்பட்ட toc களை ("துணை-டோக் மரங்கள்" உட்பட) பயன்படுத்துகிறது. உறவினர் ஆவணப் பெயர்கள் (ஒரு ச்லாசுடன் தொடங்கவில்லை) கட்டளை ஏற்படும் ஆவணத்துடன் தொடர்புடையது, முழுமையான பெயர்கள் மூல கோப்பகத்துடன் தொடர்புடையவை. மரத்தின் ஆழத்தைக் குறிக்க ஒரு எண் `` maxdepth`` விருப்பம் வழங்கப்படலாம்; இயல்பாக, அனைத்து நிலைகளும் சேர்க்கப்பட்டுள்ளன. [#] _

source: The representation of "TOC tree" is changed in each output format. The builders that output multiple files (e.g. HTML) treat it as a collection of hyperlinks. On the other hand, the builders that output a single file (e.g. LaTeX, man page, etc.) replace it with the content of the documents on the TOC tree.
ta: ஒவ்வொரு வெளியீட்டு வடிவத்திலும் "TOC மரத்தின்" பிரதிநிதித்துவம் மாற்றப்படுகிறது. பல கோப்புகளை (எ.கா. HTML) வெளியிடும் பில்டர்கள் அதை மிகை இணைப்புகளின் தொகுப்பாகக் கருதுகின்றனர். மறுபுறம், ஒரு கோப்பை வெளியிடும் பில்டர்கள் (எ.கா. LaTeX, மேன் பக்கம் போன்றவை) அதை TOC மரத்தில் உள்ள ஆவணங்களின் உள்ளடக்கத்துடன் மாற்றுகின்றனர்.

source: Consider this example (taken from the Python docs' library reference index)::
ta: இந்த உதாரணத்தைக் கவனியுங்கள் (பைதான் டாக்ச் நூலக குறிப்பு குறியீட்டிலிருந்து எடுக்கப்பட்டது) ::

source: This accomplishes two things:
ta: இது இரண்டு விசயங்களை நிறைவேற்றுகிறது:

source: Tables of contents from all those documents are inserted, with a maximum depth of two, that means one nested heading. ``toctree`` directives in those documents are also taken into account.
ta: அந்த எல்லா ஆவணங்களிலிருந்தும் உள்ளடக்கங்களின் அட்டவணைகள் செருகப்பட்டுள்ளன, அதிகபட்சம் இரண்டு ஆழம், அதாவது ஒரு உள்ளமைக்கப்பட்ட தலைப்பு. `` toctree`` அந்த ஆவணங்களில் உத்தரவுகளும் கணக்கில் எடுத்துக்கொள்ளப்படுகின்றன.

source: Sphinx knows the relative order of the documents ``intro``, ``strings`` and so forth, and it knows that they are children of the shown document, the library index. From this information it generates "next chapter", "previous chapter" and "parent chapter" links.
ta: ஆவணங்களின் ஒப்பீட்டு வரிசையை ச்பின்க்ச் அறிவார் `` அறிமுகம்``, `` சரங்கள்`` மற்றும் பலவற்றில் அவர்கள் காட்டப்பட்ட ஆவணத்தின் குழந்தைகள், நூலகக் குறியீட்டின் குழந்தைகள் என்பதை இது அறிவது. இந்த தகவலிலிருந்து இது "அடுத்த அத்தியாயம்", "முந்தைய அத்தியாயம்" மற்றும் "பெற்றோர் அத்தியாயம்" இணைப்புகளை உருவாக்குகிறது.

source: **Entries**
ta: ** உள்ளீடுகள் **

source: Document titles in the :rst:dir:`toctree` will be automatically read from the title of the referenced document. If that isn't what you want, you can specify an explicit title and target using a similar syntax to reStructuredText hyperlinks (and Sphinx's :ref:`cross-referencing syntax <xref-syntax>`). This looks like::
ta: :rst:dir:`toctree` இல் உள்ள ஆவணத் தலைப்புகள் குறிப்பிடப்பட்ட ஆவணத்தின் தலைப்பிலிருந்து தானாகவே படிக்கப்படும். நீங்கள் விரும்பவில்லை என்றால், நீங்கள் ஒரு வெளிப்படையான தலைப்பைக் குறிப்பிடலாம் மற்றும் மறுகட்டமைக்கப்பட்ட உரை ஐப்பர்லிங்க்களுக்கு ஒத்த தொடரியல் பயன்படுத்தி இலக்கை அமைக்கலாம் (மற்றும் ச்பிங்க்சின் :ref:`cross-referencing syntax <xref-syntax>`). இது போல் தெரிகிறது ::

source: The second line above will link to the ``strings`` document, but will use the title "All about strings" instead of the title of the ``strings`` document.
ta: மேலே உள்ள இரண்டாவது வரி `` சரங்கள்` ஆவணத்துடன் இணைக்கும், ஆனால் `` சரங்கள்` ஆவணத்தின் தலைப்புக்கு பதிலாக "சரம் பற்றி எல்லாம்" என்ற தலைப்பைப் பயன்படுத்தும்.

source: You can also add external links, by giving an HTTP URL instead of a document name.
ta: ஆவண பெயருக்கு பதிலாக http முகவரி ஐ வழங்குவதன் மூலம் வெளிப்புற இணைப்புகளையும் சேர்க்கலாம்.

source: The special entry name ``self`` stands for the document containing the toctree directive. This is useful if you want to generate a "sitemap" from the toctree.
ta: சிறப்பு நுழைவு பெயர் `` சுய`` என்பது டோக்ட்ரீ டைரெக்டிவ் கொண்ட ஆவணத்தை குறிக்கிறது. டோக்ட்ரீயிடமிருந்து ஒரு "தள வரைபடத்தை" உருவாக்க விரும்பினால் இது பயனுள்ளதாக இருக்கும்.

source: In the end, all documents in the :term:`source directory` (or subdirectories) must occur in some ``toctree`` directive; Sphinx will emit a warning if it finds a file that is not included, because that means that this file will not be reachable through standard navigation.
ta: முடிவில்,: கால: `மூல அடைவு` (அல்லது துணை அடைவுகள்) இல் உள்ள அனைத்து ஆவணங்களும் சில` `toctree`` உத்தரவில் ஏற்பட வேண்டும்; சேர்க்கப்படாத ஒரு கோப்பைக் கண்டறிந்தால், சூரரிமாச்சிலை ஒரு எச்சரிக்கையை வெளியிடும், ஏனென்றால் நிலையான வழிசெலுத்தல் மூலம் இந்த கோப்பு அடையப்படாது.

source: Use :confval:`exclude_patterns` to explicitly exclude documents or directories from building completely. Use :ref:`the "orphan" metadata <metadata>` to let a document be built, but notify Sphinx that it is not reachable via a toctree.
ta: பயன்படுத்தவும்: confval: ஆவணங்கள் அல்லது கோப்பகங்களை வெளிப்படையாக கட்டியெழுப்புவதிலிருந்து வெளிப்படையாக விலக்க `விலக்கு_பொட்டர்ச்`. பயன்படுத்தவும்: குறிப்பு: `" அனாதை "மேனிலை தரவு <மெட்டாடேட்டா>` ஒரு ஆவணத்தை உருவாக்க அனுமதிக்க, ஆனால் டோக்ட்ரீ வழியாக அதை அடைய முடியாது என்று ச்பிங்க்சுக்கு அறிவிக்கவும்.

source: The "root document" (selected by :confval:`root_doc`) is the "root" of the TOC tree hierarchy. It can be used as the documentation's main page, or as a "full table of contents" if you don't give a ``:maxdepth:`` option.
ta: "ரூட் ஆவணம்" (:confval:`root_doc` ஆல் தேர்ந்தெடுக்கப்பட்டது) என்பது TOC மரப் படிநிலையின் "ரூட்" ஆகும். நீங்கள் ``:maxdepth:`` விருப்பத்தை வழங்கவில்லை எனில், ஆவணத்தின் முதன்மையான பக்கமாக அல்லது "முழு உள்ளடக்க அட்டவணையாக" இதைப் பயன்படுத்தலாம்.

source: Added support for external links and "self" references.
ta: வெளிப்புற இணைப்புகள் மற்றும் "தன்வய" குறிப்புகளுக்கான உதவி சேர்க்கப்பட்டது.

source: Options
ta: விருப்பங்கள்

source: Assign `class attributes`_. This is a :dudir:`common option <common-options>`. For example::
ta: `வகுப்பு பண்புகளை`_ ஒதுக்கவும். இது :dudir:`common சூதம் <common-options>`. உதாரணமாக::

source: An implicit target name that can be referenced using :rst:role:`ref`. This is a :dudir:`common option <common-options>`. For example::
ta: :rst:role:`ref` ஐப் பயன்படுத்தி குறிப்பிடக்கூடிய ஒரு மறைமுக இலக்கு பெயர். இது :dudir:`common சூதம் <common-options>`. உதாரணமாக::

source: Add a caption to the toctree. For example::
ta: டோக்ட்ரீக்கு ஒரு தலைப்பைச் சேர்க்கவும். உதாரணமாக::

source: If you want to have section numbers even in HTML output, add the ``:numbered:`` option to the *top-level* toctree. For example::
ta: உஉகுமொ வெளியீட்டில் கூட நீங்கள் பிரிவு எண்களைக் கொண்டிருக்க விரும்பினால், *உயர்நிலை* டோக்ட்ரீயில் ``:numbered:`` விருப்பத்தைச் சேர்க்கவும். உதாரணமாக::

source: Section numbering then starts at the heading of ``foo``. Sub-toctrees are automatically numbered (don't give the ``numbered`` flag to those).
ta: பிரிவு எண்ணிடுதல் பிறகு ``foo`` என்ற தலைப்பில் தொடங்குகிறது. துணை-டாக்ட்ரீகள் தானாக எண்ணப்படும் (அவற்றுக்கு ``எண் போடப்பட்ட`` கொடியைக் கொடுக்க வேண்டாம்).

source: Numbering up to a specific depth is also possible, by giving the depth as a numeric argument to ``numbered``.
ta: ஒரு குறிப்பிட்ட ஆழத்தை எண்ணுவதும் சாத்தியமாகும், ஆழத்தை ஒரு எண் வாதமாக `` எண்ணற்ற`` க்கு வழங்குவதன் மூலம்.

source: Added the numeric *depth* argument.
ta: எண் *ஆழம்* வாதத்தைச் சேர்த்தது.

source: Only list document titles, not other headings of the same level. For example::
ta: ஆவணத் தலைப்புகளை மட்டும் பட்டியலிடவும், அதே மட்டத்தில் உள்ள மற்ற தலைப்புகள் அல்ல. உதாரணமாக::

source: Parse glob wildcards in toctree entries. All entries are matched against the list of available documents, and matches are inserted into the list alphabetically. For example::
ta: டோக்ட்ரீ உள்ளீடுகளில் குளோப் வைல்டு கார்டுகளை அலசவும். அனைத்து உள்ளீடுகளும் கிடைக்கக்கூடிய ஆவணங்களின் பட்டியலுடன் பொருந்துகின்றன, மேலும் பட்டியலில் அகரவரிசையில் பொருத்தங்கள் செருகப்படுகின்றன. உதாரணமாக::

source: This includes first all documents whose names start with ``intro``, then all documents in the ``recipe`` folder, then all remaining documents (except the one containing the directive, of course.) [#]_
ta: இதில் முதலில் அனைத்து ஆவணங்களும் அடங்கும், அதன் பெயர்கள் `` அறிமுகம்``, பின்னர் `` ரெசிபி` கோப்புறையில் உள்ள அனைத்து ஆவணங்களும், பின்னர் மீதமுள்ள அனைத்து ஆவணங்களும் (உத்தரவைக் கொண்ட ஒன்றைத் தவிர, நிச்சயமாக.) _ _

source: Reverse the order of the entries in the list. This is particularly useful when using the ``:glob:`` option.
ta: பட்டியலில் உள்ளீடுகளின் வரிசையைத் தலைகீழாக மாற்றவும். ``:glob:`` விருப்பத்தைப் பயன்படுத்தும் போது இது மிகவும் பயனுள்ளதாக இருக்கும்.

source: A hidden toctree only defines the document hierarchy. It will not insert links into the document at the location of the directive.
ta: ஒரு மறைக்கப்பட்ட டாக்ட்ரீ ஆவணப் படிநிலையை மட்டுமே வரையறுக்கிறது. இது கட்டளையிடப்பட்ட இடத்தில் ஆவணத்தில் இணைப்புகளைச் செருகாது.

source: This makes sense if you have other means of navigation, e.g. through manual links, HTML sidebar navigation, or if you use the ``:includehidden:`` option on the top-level toctree.
ta: உங்களிடம் வேறு வழிசெலுத்தல் வழிகள் இருந்தால் இது அர்த்தமுள்ளதாக இருக்கும், எ.கா. கையேடு இணைப்புகள், உஉகுமொ பக்கப்பட்டி வழிசெலுத்தல் அல்லது உயர்மட்ட டோக்ட்ரீயில் ``:includehidden:`` விருப்பத்தைப் பயன்படுத்தினால்.

source: If you want one global table of contents showing the complete document structure, you can add the ``:includehidden:`` option to the *top-level* toctree directive. All other toctrees on child pages can then be made invisible with the ``:hidden:`` option. The top-level toctree with ``:includehidden:`` will then include their entries.
ta: முழுமையான ஆவணக் கட்டமைப்பைக் காட்டும் ஒரு உலகளாவிய உள்ளடக்க அட்டவணையை நீங்கள் விரும்பினால், நீங்கள் ``:includehidden:`` விருப்பத்தை *உயர்நிலை* டோக்ட்ரீ உத்தரவுக்கு சேர்க்கலாம். குழந்தைப் பக்கங்களில் உள்ள மற்ற அனைத்து டாக்ட்ரீகளும் ``:hidden:`` விருப்பத்தின் மூலம் கண்ணுக்குத் தெரியாமல் செய்யலாம். ``:includehidden:`` உடன் உயர்மட்ட டோக்ட்ரீ அவர்களின் உள்ளீடுகளை உள்ளடக்கும்.

source: Special names
ta: சிறப்பு பெயர்கள்

source: Sphinx reserves some document names for its own use; you should not try to create documents with these names -- it will cause problems.
ta: ச்பின்க்ச் அதன் சொந்த பயன்பாட்டிற்காக சில ஆவண பெயர்களை கொண்டுள்ளது; இந்த பெயர்களுடன் ஆவணங்களை உருவாக்க நீங்கள் முயற்சிக்கக்கூடாது - இது சிக்கல்களை ஏற்படுத்தும்.

source: The special document names (and pages generated for them) are:
ta: சிறப்பு ஆவண பெயர்கள் (மற்றும் அவற்றுக்காக உருவாக்கப்பட்ட பக்கங்கள்):

source: ``genindex``
ta: ``மறுஇண்டெக்ச்''

source: This is used for the general index, which is populated with entries from :rst:dir:`index` directives and all index-generating :ref:`object descriptions <basic-domain-markup>`. For example, see Sphinx's :ref:`genindex`.
ta: இது பொது குறியீட்டுக்குப் பயன்படுத்தப்படுகிறது, இது :rst:dir:`index` வழிகாட்டுதல்கள் மற்றும் அனைத்து குறியீட்டு-உருவாக்கும் :ref:`object விளக்கங்கள் <basic-domain-markup>` இலிருந்து உள்ளீடுகளுடன் நிரப்பப்படுகிறது. எடுத்துக்காட்டாக, ச்பிங்க்சின் :ref:`genindex` ஐப் பார்க்கவும்.

source: ``modindex``
ta: ``மோடிண்டெக்ச்``

source: This is used for the Python module index, which contains one entry per :rst:dir:`py:module` directive. For example, see Sphinx's :ref:`py-modindex`.
ta: இது பைதான் தொகுதி indexக்கு பயன்படுத்தப்படுகிறது, இதில் :rst:dir:`py:module` கட்டளைக்கு ஒரு நுழைவு உள்ளது. எடுத்துக்காட்டாக, ச்பிங்க்சின் :ref:`py-modindex` ஐப் பார்க்கவும்.

source: ``search``
ta: ``தேடல்``

source: This is used for the search page, which contains a form that uses the generated JSON search index and JavaScript to full-text search the generated documents for search words; it works on every major browser. For example, see Sphinx's :ref:`search`.
ta: இது தேடல் பக்கத்திற்குப் பயன்படுத்தப்படுகிறது, இதில் உருவாக்கப்பட்ட சாதொபொகு தேடல் அட்டவணை மற்றும் சாவாச்கிரிப்ட் ஆகியவற்றைப் பயன்படுத்தி, தேடல் வார்த்தைகளுக்காக உருவாக்கப்பட்ட ஆவணங்களை முழு உரையாகத் தேடும் படிவம் உள்ளது; இது ஒவ்வொரு முக்கிய உலாவியிலும் வேலை செய்கிறது. எடுத்துக்காட்டாக, ச்பிங்க்சின் :ref:`search` ஐப் பார்க்கவும்.

source: Every name beginning with ``_``
ta: ``_`` உடன் தொடங்கும் ஒவ்வொரு பெயரும்

source: Though few such names are currently used by Sphinx, you should not create documents or document-containing directories with such names. (Using ``_`` as a prefix for a custom template directory is fine.)
ta: தற்போது ச்பிங்க்சால் இதுபோன்ற சில பெயர்கள் பயன்படுத்தப்பட்டாலும், அத்தகைய பெயர்களைக் கொண்ட ஆவணங்கள் அல்லது ஆவணம் கொண்ட கோப்பகங்களை நீங்கள் உருவாக்கக்கூடாது. (தனிப்பயன் டெம்ப்ளேட் கோப்பகத்திற்கான முன்னொட்டாக ``_`` பயன்படுத்துவது நல்லது.)

source: Be careful with unusual characters in filenames. Some formats may interpret these characters in unexpected ways:
ta: கோப்புப் பெயர்களில் வழக்கத்திற்கு மாறான எழுத்துகளுடன் கவனமாக இருங்கள். சில வடிவங்கள் இந்த எழுத்துக்களை எதிர்பாராத வழிகளில் விளக்கலாம்:

source: Do not use the colon ``:`` for HTML based formats. Links to other parts may not work.
ta: உஉகுமொ அடிப்படையிலான வடிவங்களுக்கு ``:`` பெருங்குடலைப் பயன்படுத்த வேண்டாம். மற்ற பகுதிகளுக்கான இணைப்புகள் வேலை செய்யாமல் போகலாம்.

source: Do not use the plus ``+`` for the ePub format. Some resources may not be found.
ta: ePub வடிவமைப்பிற்கு பிளச் ``+`` ஐப் பயன்படுத்த வேண்டாம். சில ஆதாரங்கள் கிடைக்காமல் போகலாம்.

source: Paragraph-level markup
ta: பத்தி-நிலை மார்க்அப்

source: These directives create short paragraphs and can be used inside information units as well as normal text.
ta: இந்த வழிமுறைகள் குறுகிய பத்திகளை உருவாக்குகின்றன, மேலும் செய்தி அலகுகள் மற்றும் சாதாரண உரைக்குள் பயன்படுத்தப்படலாம்.

source: Admonitions, messages, and warnings
ta: அறிவுரைகள், செய்திகள் மற்றும் எச்சரிக்கைகள்

source: The admonition directives create 'admonition' elements, a standardised system of communicating different types of information, from a helpful :rst:dir:`tip` to matters of paramount :rst:dir:`danger`. These directives can be used anywhere an ordinary body element can, and can contain arbitrary body elements. There are nine specific named admonitions and the generic :rst:dir:`admonition` directive.
ta: அறிவுரை வழிகாட்டுதல்கள் 'அறிவுரை' கூறுகளை உருவாக்குகின்றன, பல்வேறு வகையான தகவல்களைத் தொடர்புகொள்வதற்கான ஒரு தரப்படுத்தப்பட்ட அமைப்பு, பயனுள்ள :rst:dir:`tip` முதல் முக்கியமான விசயங்கள் வரை :rst:dir:`danger`. இந்த உத்தரவுகளை ஒரு சாதாரண உடல் உறுப்பு எங்கு வேண்டுமானாலும் பயன்படுத்தலாம் மற்றும் தன்னிச்சையான உடல் கூறுகளைக் கொண்டிருக்கலாம். ஒன்பது குறிப்பிட்ட பெயரிடப்பட்ட அறிவுரைகள் மற்றும் பொதுவான :rst:dir:`admonition` கட்டளைகள் உள்ளன.

source: Information that requires the reader's attention. The content of the directive should be written in complete sentences and include all appropriate punctuation.
ta: வாசகரின் கவனத்தை ஈர்க்க வேண்டிய செய்தி. உத்தரவின் உள்ளடக்கம் முழுமையான வாக்கியங்களில் எழுதப்பட வேண்டும் மற்றும் அனைத்து பொருத்தமான நிறுத்தற்குறிகளையும் உள்ளடக்கியிருக்க வேண்டும்.

source: Example:
ta: உதாரணமாக:

source: Please may I have your attention.
ta: தயவு செய்து நான் உங்கள் கவனத்தை ஈர்க்கலாம்.

source: Information with regard to which the reader should exercise care. The content of the directive should be written in complete sentences and include all appropriate punctuation.
ta: வாசகர் கவனம் செலுத்த வேண்டிய செய்தி. உத்தரவின் உள்ளடக்கம் முழுமையான வாக்கியங்களில் எழுதப்பட வேண்டும் மற்றும் அனைத்து பொருத்தமான நிறுத்தற்குறிகளையும் உள்ளடக்கியிருக்க வேண்டும்.

source: Exercise due caution.
ta: தகுந்த எச்சரிக்கையுடன் செயல்படவும்.

source: Information which may lead to near and present danger if not heeded. The content of the directive should be written in complete sentences and include all appropriate punctuation.
ta: கவனிக்கப்படாவிட்டால், அருகிலுள்ள மற்றும் தற்போதைய ஆபத்துக்கு வழிவகுக்கும் செய்தி. உத்தரவின் உள்ளடக்கம் முழுமையான வாக்கியங்களில் எழுதப்பட வேண்டும் மற்றும் அனைத்து பொருத்தமான நிறுத்தற்குறிகளையும் உள்ளடக்கியிருக்க வேண்டும்.

source: Let none think to fly the danger for soon or late love is his own avenger.
ta: விரைவில் அல்லது தாமதமான காதல் தனது சொந்த பழிவாங்கும் ஆபத்தை பறக்க யாரும் நினைக்க வேண்டாம்.

source: Information relating to failure modes of some description. The content of the directive should be written in complete sentences and include all appropriate punctuation.
ta: சில விளக்கத்தின் தோல்வி முறைகள் தொடர்பான செய்தி. உத்தரவின் உள்ளடக்கம் முழுமையான வாக்கியங்களில் எழுதப்பட வேண்டும் மற்றும் அனைத்து பொருத்தமான நிறுத்தற்குறிகளையும் உள்ளடக்கியிருக்க வேண்டும்.

source: ERROR 418: I'm a teapot.
ta: பிழை 418: நான் ஒரு தேநீர் தொட்டி.

source: Information that is helpful to the reader. The content of the directive should be written in complete sentences and include all appropriate punctuation.
ta: வாசகர்களுக்கு பயனுள்ள செய்தி. உத்தரவின் உள்ளடக்கம் முழுமையான வாக்கியங்களில் எழுதப்பட வேண்டும் மற்றும் அனைத்து பொருத்தமான நிறுத்தற்குறிகளையும் உள்ளடக்கியிருக்க வேண்டும்.

source: Look under the flowerpot.
ta: பூந்தொட்டியின் கீழ் பாருங்கள்.

source: Information that is of paramount importance and which the reader must not ignore. The content of the directive should be written in complete sentences and include all appropriate punctuation.
ta: மிக முக்கியமான மற்றும் வாசகர் புறக்கணிக்கக்கூடாத செய்தி. உத்தரவின் உள்ளடக்கம் முழுமையான வாக்கியங்களில் எழுதப்பட வேண்டும் மற்றும் அனைத்து பொருத்தமான நிறுத்தற்குறிகளையும் உள்ளடக்கியிருக்க வேண்டும்.

source: This is a statement of paramount importance.
ta: இது மிகவும் முக்கியத்துவம் வாய்ந்த அறிக்கை.

source: An especially important bit of information that the reader should know. The content of the directive should be written in complete sentences and include all appropriate punctuation.
ta: வாசகர்கள் தெரிந்து கொள்ள வேண்டிய முக்கியமான செய்தி. உத்தரவின் உள்ளடக்கம் முழுமையான வாக்கியங்களில் எழுதப்பட வேண்டும் மற்றும் அனைத்து பொருத்தமான நிறுத்தற்குறிகளையும் உள்ளடக்கியிருக்க வேண்டும்.

source: This function is not suitable for sending tins of spam.
ta: இந்தச் செயல்பாடு ச்பேம் டின்களை அனுப்புவதற்கு ஏற்றதல்ல.

source: Some useful tidbit of information for the reader. The content of the directive should be written in complete sentences and include all appropriate punctuation.
ta: வாசகருக்கு பயனுள்ள சில தகவல்கள். உத்தரவின் உள்ளடக்கம் முழுமையான வாக்கியங்களில் எழுதப்பட வேண்டும் மற்றும் அனைத்து பொருத்தமான நிறுத்தற்குறிகளையும் உள்ளடக்கியிருக்க வேண்டும்.

source: Remember your sun cream!
ta: உங்கள் சன் கிரீம் நினைவில் கொள்ளுங்கள்!

source: An important bit of information that the reader should be very aware of. The content of the directive should be written in complete sentences and include all appropriate punctuation.
ta: வாசகர்கள் அறிந்து கொள்ள வேண்டிய முக்கியமான செய்தி. உத்தரவின் உள்ளடக்கம் முழுமையான வாக்கியங்களில் எழுதப்பட வேண்டும் மற்றும் அனைத்து பொருத்தமான நிறுத்தற்குறிகளையும் உள்ளடக்கியிருக்க வேண்டும்.

source: Beware of the dog.
ta: நாய் கவனமாக.

source: A generic admonition, with an optional title. The content of the directive should be written in complete sentences and include all appropriate punctuation.
ta: விருப்பத் தலைப்புடன் பொதுவான அறிவுரை. உத்தரவின் உள்ளடக்கம் முழுமையான வாக்கியங்களில் எழுதப்பட வேண்டும் மற்றும் அனைத்து பொருத்தமான நிறுத்தற்குறிகளையும் உள்ளடக்கியிருக்க வேண்டும்.

source: This is a title
ta: இது ஒரு தலைப்பு

source: This is the content of the admonition.
ta: இதுவே உபதேசத்தின் உள்ளடக்கம்.

source: Many sections include a list of references to module documentation or external documents. These lists are created using the :rst:dir:`seealso` directive.
ta: பல பிரிவுகளில் தொகுதி ஆவணங்கள் அல்லது வெளிப்புற ஆவணங்களுக்கான குறிப்புகளின் பட்டியல் அடங்கும். இந்தப் பட்டியல்கள் :rst:dir:`seealso` கட்டளையைப் பயன்படுத்தி உருவாக்கப்படுகின்றன.

source: The :rst:dir:`!seealso` directive is typically placed in a section just before any subsections. The content of the :rst:dir:`seealso` directive should be either a single line or a reStructuredText `definition list`_.
ta: :rst:dir:`!seealso` கட்டளை பொதுவாக ஏதேனும் உட்பிரிவுகளுக்கு முன்பாக ஒரு பிரிவில் வைக்கப்படும். :rst:dir:`seealso` கட்டளையின் உள்ளடக்கம் ஒற்றை வரியாகவோ அல்லது மறுகட்டமைக்கப்பட்ட உரை `வரையறை பட்டியல்`_ ஆகவோ இருக்க வேண்டும்.

source: Example::
ta: உதாரணமாக::

source: Python's :py:mod:`zipfile` module
ta: பைத்தானின் :py:mod:`zipfile` தொகுதி

source: Documentation of Python's standard :py:mod:`zipfile` module.
ta: பைத்தானின் தரநிலை :py:mod:`zipfile` தொகுதிக்கான ஆவணப்படுத்தல்.

source: `GNU tar manual, Basic Tar Format <https://example.org>`_
ta: `குனு தார் கையேடு, அடிப்படை தார் வடிவமைப்பு <https://example.org>`_

source: Documentation for tar archive files, including GNU tar extensions.
ta: குனு தார் நீட்டிப்புகள் உட்பட தார் காப்பகக் கோப்புகளுக்கான ஆவணங்கள்.

source: Collapsible text
ta: சுருக்கக்கூடிய உரை
