Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_invocation_*.po
Languages: ta

source: Version of project. (see :confval:`version`).
ta: திட்டத்தின் பதிப்பு. (காண்க: confval: `பதிப்பு`).

source: Release of project. (see :confval:`release`).
ta: திட்டத்தின் வெளியீடு. (காண்க: confval: `வெளியீடு`).

source: Document language. (see :confval:`language`).
ta: ஆவண மொழி. (காண்க: confval: `மொழி`).

source: Source file suffix. (see :confval:`source_suffix`).
ta: மூல கோப்பு பின்னொட்டு. (காண்க: confval: `source_suffix`).

source: Master document name. (see :confval:`master_doc`).
ta: முதன்மை ஆவண பெயர். (காண்க: confval: `master_doc`).

source: The :program:`sphinx-quickstart` script generates a Sphinx documentation set. It is called like this:
ta: தி: புரோகிராம்: `ச்பின்க்ச்-க்யிக்ச்டார்ட்` ச்கிரிப்ட் ஒரு சூரரிமாச்சிலை ஆவணப்படுத்தல் தொகுப்பை உருவாக்குகிறது. இது இப்படி அழைக்கப்படுகிறது:

source: Use epub.
ta: எபப் பயன்படுத்தவும்.

source: Extension options
ta: நீட்டிப்பு விருப்பங்கள்

source: Enable `sphinx.ext.autodoc` extension.
ta: `sphinx.ext.autodoc` நீட்டிப்பை இயக்கவும்.

source: Enable `sphinx.ext.doctest` extension.
ta: `sphinx.ext.docteast` நீட்டிப்பை இயக்கவும்.

source: Enable `sphinx.ext.intersphinx` extension.
ta: `sphinx.ext.intersphinx` நீட்டிப்பை இயக்கவும்.

source: Enable `sphinx.ext.todo` extension.
ta: `sphinx.ext.todo` நீட்டிப்பை இயக்கவும்.
