Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_changes--1_4_*.po
Languages: ta

source: Sphinx 1.4
ta: சூரரிமாச்சிலை 1.4

source: Release 1.4.9 (released Nov 23, 2016)
ta: வெளியீடு 1.4.9 (நவம்பர் 23, 2016 இல் வெளியிடப்பட்டது)

source: Bugs fixed
ta: பிழைகள் சரி செய்யப்பட்டன

source: #2936: Fix doc/Makefile that can't build man because doc/man exists
ta: #2936: ஆவணம்/மனிதன் இருப்பதால் மனிதனை உருவாக்க முடியாத ஆவணம்/மேக்ஃபைலை சரிசெய்யவும்

source: #3058: Using the same 'caption' attribute in multiple 'toctree' directives results in warning / error
ta: #3058: பல 'டோக்ட்ரீ' உத்தரவுகளில் ஒரே 'தலைப்பு' பண்புக்கூறைப் பயன்படுத்தினால் முன்னறிவிப்பு / பிழை ஏற்படும்

source: #3068: Allow the '=' character in the -D option of sphinx-build.py
ta: #3068: sphinx-build.py இன் -D விருப்பத்தில் '=' எழுத்தை இசைவு

source: #3074: ``add_source_parser()`` crashes in debug mode
ta: #3074: ``சேர்_மூலப்_பாகுபடுத்தி()`` பிழைத்திருத்த பயன்முறையில் செயலிழக்கிறது

source: #3135: ``sphinx.ext.autodoc`` crashes with plain Callable
ta: #3135: ``sphinx.ext.autodoc`` பொதுவாக அழைக்கக்கூடியதுடன் செயலிழக்கிறது

source: #3150: Fix query word splitter in JavaScript. It behaves as same as Python's regular expression.
ta: #3150: சாவாச்கிரிப்டில் வினவல் சொல் பிரிப்பானை சரிசெய்யவும். இது பைத்தானின் வழக்கமான வெளிப்பாடு போலவே செயல்படுகிறது.

source: #3093: gettext build broken on substituted images.
ta: #3093: பதிலீடு செய்யப்பட்ட படங்களில் உரைபெறு உருவாக்கம் உடைந்தது.

source: #3093: gettext build broken on image node under ``note`` directive.
ta: #3093: ``குறிப்பு`` கட்டளையின் கீழ் பட முனையில் உரைபெறு உருவாக்கம் உடைந்தது.

source: imgmath: crashes on showing error messages if image generation failed
ta: imgmath: பட உருவாக்கம் தோல்வியுற்றால் பிழை செய்திகளைக் காண்பிப்பதில் செயலிழக்கிறது

source: #3117: LaTeX writer crashes if admonition is placed before first section title
ta: #3117: முதல் பகுதி தலைப்புக்கு முன் அறிவுரை வழங்கப்பட்டால் லாடெக்சு எழுத்தாளர் செயலிழக்கிறார்

source: #3164: Change search order of ``sphinx.ext.inheritance_diagram``
ta: #3164: ``sphinx.ext.inheritance_diagram`` இன் தேடல் வரிசையை மாற்றவும்

source: Release 1.4.8 (released Oct 1, 2016)
ta: வெளியீடு 1.4.8 (அக்டோபர் 1, 2016 வெளியிடப்பட்டது)

source: #2996: The wheel package of Sphinx got crash with ImportError
ta: #2996: The wheel தொகுப்பு of சூரரிமாச்சிலை got crash with ImportError

source: Release 1.4.7 (released Oct 1, 2016)
ta: வெளியீடு 1.4.7 (அக்டோபர் 1, 2016 வெளியிடப்பட்டது)

source: #2890: Quickstart should return an error consistently on all error conditions
ta: #2890: விரைவுத் தொடக்கமானது எல்லாப் பிழை நிலைகளிலும் ஒரு பிழையைத் தொடர்ந்து வழங்கும்

source: #2870: flatten genindex columns' heights.
ta: #2870: genindex பத்திகளின் உயரங்களைத் தட்டையாக்கு.

source: #2856: Search on generated HTML site doesn't find some symbols
ta: #2856: உருவாக்கப்பட்ட உஉகுமொ தளத்தில் தேடும் போது சில குறியீடுகள் கிடைக்கவில்லை

source: #2882: Fall back to a GET request on 403 status in linkcheck
ta: #2882: இணைப்புச் சரிபார்ப்பில் 403 நிலை குறித்த GET கோரிக்கைக்கு திரும்பவும்

source: #2902: jsdump.loads fails to load search index if keywords starts with underscore
ta: #2902: முக்கிய வார்த்தைகள் அடிக்கோடுடன் தொடங்கினால், jsdump.loads தேடல் குறியீட்டை ஏற்ற முடியவில்லை

source: #2900: Fix epub content.opf: add auto generated orphan files to spine.
ta: #2900: epub content.opf ஐ சரிசெய்யவும்: தானாக உருவாக்கப்பட்ட அனாதை கோப்புகளை முதுகெலும்பில் சேர்க்கவும்.

source: #2899: Fix ``hasdoc()`` function in Jinja2 template. It will detect ``genindex``, ``search`` also.
ta: #2899: சின்சா2 டெம்ப்ளேட்டில் ``hasdoc()`` செயல்பாட்டை சரிசெய்யவும். இது ``genindex``, ``search`` போன்றவற்றையும் கண்டறியும்.

source: #2901: Fix epub result: skip creating links from image tags to original image files.
ta: #2901: epub முடிவை சரிசெய்யவும்: படக் குறிச்சொற்களிலிருந்து அசல் படக் கோப்புகளுக்கான இணைப்புகளை உருவாக்குவதைத் தவிர்க்கவும்.

source: #2917: inline code is hyphenated on HTML
ta: #2917: இன்லைன் குறியீடு உஉகுமொ இல் ஐபனேட் செய்யப்பட்டுள்ளது

source: #1462: autosummary warns for namedtuple with attribute with trailing underscore
ta: #1462: தன்னியக்கச் சுருக்கம் நேம்ட்யூப்லைப் பற்றி எச்சரிக்கிறது

source: Could not reference equations if ``:nowrap:`` option specified
ta: ``: இப்போது: `` விருப்பம் குறிப்பிடப்பட்டால் சமன்பாடுகளை குறிப்பிட முடியவில்லை

source: #2873: code-block overflow in latex (due to commas)
ta: #2873: லேடெக்சில் குறியீடு-தடுப்பு வழிதல் (காற்புள்ளிகளின் காரணமாக)

source: #1060, #2056: sphinx.ext.intersphinx: broken links are generated if relative paths are used in ``intersphinx_mapping``
ta: #1060, #2056: sphinx.ext.intersphinx: ``intersphinx_mapping`` இல் தொடர்புடைய பாதைகள் பயன்படுத்தப்பட்டால் உடைந்த இணைப்புகள் உருவாக்கப்படும்

source: #2931: code-block directive with same :caption: causes warning of duplicate target. Now ``code-block`` and ``literalinclude`` does not define hyperlink target using its caption automatically.
ta: #2931: அதே :caption: குறியீட்டு-தடுப்பு கட்டளை நகல் இலக்கை எச்சரிக்கிறது. இப்போது ``குறியீடு-தடுப்பு`` மற்றும் ``literlinclude`` ஆகியவை தானாகவே அதன் தலைப்பைப் பயன்படுத்தி ஐப்பர்லிங்க் இலக்கை வரையறுக்கவில்லை.

source: #2962: latex: missing label of longtable
ta: #2962: லேடெக்ச்: லாங்டேபிள் சிட்டை இல்லை

source: #2968: autodoc: show-inheritance option breaks docstrings
ta: #2968: autodoc: show-inheritance விருப்பம் docstrings ஐ உடைக்கிறது

source: Release 1.4.6 (released Aug 20, 2016)
ta: வெளியீடு 1.4.6 (ஆகஸ்ட் 20, 2016 இல் வெளியிடப்பட்டது)

source: Incompatible changes
ta: பொருந்தாத மாற்றங்கள்

source: #2867: linkcheck builder crashes with six-1.4. Now Sphinx depends on six-1.5 or later
ta: #2867: இணைப்புச் சரிபார்ப்பு பில்டர் சிக்ச்-1.4 உடன் செயலிழக்கிறது. இப்போது சூரரிமாச்சிலை ஆறு-1.5 அல்லது அதற்குப் பிறகு சார்ந்துள்ளது

source: applehelp: Sphinx crashes if ``hiutil`` or ``codesign`` commands not found
ta: ஆப்பிள்ஹெல்ப்: `` hiutil`` அல்லது `` குறியீட்டு `கட்டளைகள் கிடைக்கவில்லை என்றால் ஸ்பிங்க்ஸ் செயலிழக்கிறது

source: Fix ``make clean`` abort issue when build dir contains regular files like ``DS_Store``.
ta: `` Ds_store`` போன்ற வழக்கமான கோப்புகளைக் கொண்டிருக்கும்போது `` சுத்தமாக `` கைவிட சிக்கலை சரிசெய்யவும்.

source: Reduce epubcheck warnings/errors:
ta: EPUBCHECK எச்சரிக்கைகள்/பிழைகளைக் குறைக்கவும்:

source: Fix DOCTYPE to html5
ta: HTML5 க்கு டாக் டைப்பை சரிசெய்யவும்

source: Change extension from .html to .xhtml.
ta: நீட்டிப்பை .html இலிருந்து .xhtml ஆக மாற்றவும்.

source: Disable search page on epub results
ta: EPUB முடிவுகளில் தேடல் பக்கத்தை முடக்கு

source: #2778: Fix autodoc crashes if obj.__dict__ is a property method and raises exception
ta: #2778: obj.__dict__ என்பது சொத்து முறை மற்றும் விதிவிலக்கை உயர்த்தினால் ஆட்டோடாக் செயலிழப்புகளை சரிசெய்யவும்

source: Fix duplicated toc in epub3 output.
ta: EPUB3 வெளியீட்டில் நகல் TOC ஐ சரிசெய்யவும்.

source: #2775: Fix failing linkcheck with servers not supporting identity encoding
ta: #2775: அடையாள குறியாக்கத்தை ஆதரிக்காத சேவையகங்கள் மூலம் இணைப்புச் சரிபார்ப்பு தோல்வியைச் சரிசெய்யவும்

source: #2833: Fix formatting instance annotations in ext.autodoc.
ta: #2833: ext.autodoc இல் வடிவமைப்பு நிகழ்வு சிறுகுறிப்புகளை சரிசெய்யவும்.

source: #1911: ``-D`` option of ``sphinx-build`` does not override the ``extensions`` variable
ta: #1911: ``sphinx-build`` இன் ``-D`` விருப்பம் ``extensions`` மாறியை மீறாது

source: #2789: ``sphinx.ext.intersphinx`` generates wrong hyperlinks if the inventory is given
ta: #2789: சரக்கு கொடுக்கப்பட்டால் ``sphinx.ext.intersphinx`` தவறான ஐப்பர்லிங்க்களை உருவாக்குகிறது

source: parsing errors for caption of code-blocks are displayed in document (ref: #2845)
ta: கோட்-பிளாக்சின் தலைப்புக்கான பாகுபடுத்தும் பிழைகள் ஆவணத்தில் காட்டப்படும் (குறிப்பு: #2845)

source: #2846: ``singlehtml`` builder does not include figure numbers
ta: #2846: ``singlehtml`` பில்டர் எண்ணிக்கை எண்களைக் கொண்டிருக்கவில்லை

source: #2816: Fix data from builds cluttering the ``Domain.initial_data`` class attributes
ta: #2816: ``Domain.initial_data`` கிளாச் பண்புக்கூறுகளை ஒழுங்கீனம் செய்யும் கட்டமைப்பிலிருந்து தரவைச் சரிசெய்தல்

source: Release 1.4.5 (released Jul 13, 2016)
ta: வெளியீடு 1.4.5 (ஜூலை 13, 2016 வெளியிடப்பட்டது)

source: latex, inclusion of non-inline images from image directive resulted in non-coherent whitespaces depending on original image width; new behaviour by necessity differs from earlier one in some cases. (ref: #2672)
ta: லேடெக்ச், பட கட்டளையிலிருந்து இன்லைன் அல்லாத படங்களைச் சேர்ப்பதன் விளைவாக அசல் பட அகலத்தைப் பொறுத்து ஒத்திசைவற்ற இடைவெளிகள் ஏற்பட்டன; தேவையின் அடிப்படையில் புதிய நடத்தை சில சந்தர்ப்பங்களில் முந்தையதை விட வேறுபடுகிறது. (குறிப்பு: #2672)

source: latex, use of ``\includegraphics`` to refer to Sphinx custom variant is deprecated; in future it will revert to original LaTeX macro, custom one already has alternative name ``\sphinxincludegraphics``.
ta: லேடெக்ஸ், ஸ்பின்க்ஸ் தனிப்பயன் மாறுபாட்டைக் குறிக்க `` \ சேர்க்கப்பட்ட கிராபிக்ஸ்` பயன்பாடு நீக்கப்பட்டது; எதிர்காலத்தில் இது அசல் லேடெக்ஸ் மேக்ரோவுக்கு மாறும், தனிப்பயன் ஒன்னுக்கு ஏற்கனவே மாற்று பெயர் `` \ sphinxincludegraphics``.

source: Features added
ta: அம்சங்கள் சேர்க்கப்பட்டன

source: new config option :confval:`!latex_keep_old_macro_names`, defaults to ``True``. If ``False``, lets macros (for text styling) be defined only with ``\sphinx``-prefixed names
ta: புதிய கட்டமைப்பு விருப்பம்: confval: `! Latex_keep_old_macro_names`, இயல்புநிலை` `உண்மை``. `` தவறு` என்றால், மேக்ரோக்கள் (உரை ஸ்டைலிங்கிற்காக) `` \ ஸ்பின்க்ஸ்`-க்யூட் பெயர்களுடன் மட்டுமே வரையறுக்க அனுமதிக்கிறது

source: latex writer allows user customization of "shadowed" boxes (topics), via three length variables.
ta: மூன்று நீள மாறிகள் வழியாக, "நிழல்" பெட்டிகளின் (தலைப்புகள்) பயனர் தனிப்பயனாக்கலை லேடெக்ஸ் எழுத்தாளர் அனுமதிக்கிறார்.

source: woff-format web font files now supported by the epub builder.
ta: WOFF- வடிவ வலை எழுத்துரு கோப்புகள் இப்போது எபப் பில்டரால் ஆதரிக்கப்படுகின்றன.

source: jsdump fix for python 3: fixes the HTML search on python > 3
ta: பைதான் 3 க்கான jsdump fix: பைதான்> 3 இல் HTML தேடலை சரிசெய்கிறது

source: #2676: (latex) Error with verbatim text in captions since Sphinx 1.4.4
ta: #2676: (லேடெக்ச்) சூரரிமாச்சிலை 1.4.4 முதல் தலைப்புகளில் சொற்களஞ்சிய உரையில் பிழை

source: #2629: memoir class crashes LaTeX. Fixed by ``latex_keep_old_macro_names=False`` (ref 2675)
ta: #2629: நினைவு வகுப்பு லாடெக்சு செயலிழந்தது. ``latex_keep_old_macro_names=False`` மூலம் சரி செய்யப்பட்டது (குறிப்பு 2675)

source: #2684: ``sphinx.ext.intersphinx`` crashes with six-1.4.1
ta: #2684: ``sphinx.ext.intersphinx`` சிக்ச்-1.4.1 உடன் செயலிழக்கிறது

source: #2679: ``float`` package needed for ``'figure_align': 'H'`` latex option
ta: #2679: ``'figure_align'க்கு ``float`` தொகுப்பு தேவை: 'H'`` லேடெக்ச் விருப்பம்

source: #2671: image directive may lead to inconsistent spacing in pdf
ta: #2671: பட கட்டளை pdf இல் சீரற்ற இடைவெளிக்கு வழிவகுக்கும்

source: #2705: ``toctree`` generates empty bullet_list if ``:titlesonly:`` specified
ta: #2705: ``:titlesonly:`` குறிப்பிடப்பட்டால், ``toctree`` வெற்று புல்லட்_பட்டியலை உருவாக்குகிறது

source: #2479: ``sphinx.ext.viewcode`` uses python2 highlighter by default
ta: #2479: ``sphinx.ext.viewcode`` முன்னிருப்பாக python2 ஐலைட்டரைப் பயன்படுத்துகிறது

source: #2700: HtmlHelp builder has hard coded index.html
ta: #2700: HtmlHelp பில்டரில் கடின குறியிடப்பட்ட index.html உள்ளது

source: latex, since 1.4.4 inline literal text is followed by spurious space
ta: லேடெக்ஸ், 1.4.4 இன்லைன் நேரடி உரையைத் தொடர்ந்து போலியான இடத்தைத் தொடர்ந்து

source: #2722: C++, fix id generation for var/member declarations to include namespaces.
ta: #2722: C++, பெயர்வெளிகளைச் சேர்க்க var/member declarations அடையாளம் உருவாக்கத்தை சரிசெய்யவும்.

source: latex, images (from image directive) in lists or quoted blocks did not obey indentation (fixed together with #2671)
ta: லேடெக்ச், பட்டியல்கள் அல்லது மேற்கோள் காட்டப்பட்ட தொகுதிகளில் உள்ள படங்கள் (படம் கட்டளையிலிருந்து) உள்தள்ளலுக்குக் கீழ்ப்படியவில்லை (#2671 உடன் சரி செய்யப்பட்டது)

source: #2733: since Sphinx 1.4.4 ``make latexpdf`` generates lots of hyperref warnings
ta: #2733: சூரரிமாச்சிலை 1.4.4 ``make latexpdf`` ஆனது நிறைய ஐப்பர்ரெஃப் எச்சரிக்கைகளை உருவாக்குகிறது.

source: #2731: ``sphinx.ext.autodoc`` does not access propertymethods which raises any exceptions
ta: #2731: ``sphinx.ext.autodoc`` எந்த விதிவிலக்குகளையும் எழுப்பும் சொத்து முறைகளை அணுகாது

source: #2666: C++, properly look up nested names involving constructors.
ta: #2666: C++, கன்ச்ட்ரக்டர்களை உள்ளடக்கிய உள்ளமை பெயர்களை சரியாகப் பார்க்கவும்.

source: #2579: Could not refer a label including both spaces and colons via ``sphinx.ext.intersphinx``
ta: #2579: ``sphinx.ext.intersphinx`` வழியாக இடைவெளிகள் மற்றும் பெருங்குடல்கள் இரண்டையும் உள்ளடக்கிய லேபிளைப் பார்க்க முடியவில்லை

source: #2718: Sphinx crashes if the document file is not readable
ta: #2718: ஆவணக் கோப்பைப் படிக்க முடியவில்லை என்றால், சூரரிமாச்சிலை செயலிழக்கும்

source: #2699: hyperlinks in help HTMLs are broken if ``html_file_suffix`` is set
ta: #2699: ``html கோப்பு பின்னொட்டு`` அமைக்கப்பட்டால், உதவி உஉகுமொ இல் உள்ள ஐப்பர்லிங்க் உடைக்கப்படும்

source: #2723: extra spaces in latex pdf output from multirow cell
ta: #2723: மல்டிரோ கலத்திலிருந்து லேடெக்ச் pdf வெளியீட்டில் கூடுதல் இடைவெளிகள்

source: #2735: latexpdf ``Underfull \hbox (badness 10000)`` warnings from title page
ta: #2735: latexpdf ``Underfull \hbox (badness 10000)`` எச்சரிக்கைகள் தலைப்புப் பக்கத்திலிருந்து

source: #2667: latex crashes if resized images appeared in section title
ta: #2667: பகுதியின் தலைப்பில் மறுஅளவிடப்பட்ட படங்கள் தோன்றினால் லேடெக்ச் செயலிழக்கும்

source: #2763: (html) Provide default value for required ``alt`` attribute for image tags of SVG source, required to validate and now consistent w/ other formats.
ta: #2763: (html) SVG மூலத்தின் படக் குறிச்சொற்களுக்குத் தேவையான ``alt`` பண்புக்கூறுக்கு இயல்புநிலை மதிப்பை வழங்கவும், சரிபார்க்கவும், இப்போது மற்ற வடிவங்களுடன் சீரானதாகவும் இருக்கும்.

source: Release 1.4.4 (released Jun 12, 2016)
ta: வெளியீடு 1.4.4 (ஜூன் 12, 2016 வெளியிடப்பட்டது)

source: #2630: latex: sphinx.sty notice environment formatting problem
ta: #2630: latex: sphinx.sty அறிவிப்பு சூழல் வடிவமைப்பு சிக்கல்

source: #2632: Warning directives fail in quote environment latex build
ta: #2632: மேற்கோள் சூழல் லேடெக்ச் உருவாக்கத்தில் முன்னறிவிப்பு உத்தரவுகள் தோல்வியடைகின்றன

source: #2633: Sphinx crashes with old styled indices
ta: #2633: பழைய பாணியிலான குறியீடுகளுடன் சூரரிமாச்சிலை செயலிழக்கிறது

source: Fix a ``\begin{\minipage}`` typo in sphinx.sty from 1.4.2 (ref: 68becb1)
ta: 1.4.2 இலிருந்து sphinx.sty இல் {\ மினிபேஜ்} `` எழுத்துப்பிழை ஒரு `` \ தொடக்கத்தை சரிசெய்யவும் (குறிப்பு: 68becb1)

source: #2622: Latex produces empty pages after title and table of contents
ta: #2622: லேடெக்ச் தலைப்பு மற்றும் உள்ளடக்க அட்டவணைக்குப் பிறகு வெற்றுப் பக்கங்களை உருவாக்குகிறது

source: #2640: 1.4.2 LaTeX crashes if code-block inside warning directive
ta: #2640: 1.4.2 லாடெக்சு crashes if code-block inside முன்னறிவிப்பு கட்டளை

source: Let LaTeX use straight quotes also in inline code (ref #2627)
ta: லாடெக்சு இன்லைன் குறியீட்டிலும் நேரான மேற்கோள்களைப் பயன்படுத்தட்டும் (குறிப்பு #2627)

source: #2351: latex crashes if enumerated lists are placed on footnotes
ta: #2351: எண்ணிடப்பட்ட பட்டியல்கள் அடிக்குறிப்புகளில் வைக்கப்பட்டால் லேடெக்ச் செயலிழக்கும்

source: #2646: latex crashes if math contains twice empty lines
ta: #2646: கணிதத்தில் இரண்டு முறை காலியான கோடுகள் இருந்தால் லேடெக்ச் செயலிழக்கும்

source: #2480: ``sphinx.ext.autodoc``: memory addresses were shown
ta: #2480: ``sphinx.ext.autodoc``: நினைவக முகவரிகள் காட்டப்பட்டன

source: latex: allow code-blocks appearing inside lists and quotes at maximal nesting depth (ref #777, #2624, #2651)
ta: லேடெக்ச்: அதிகபட்ச கூடு கட்டும் ஆழத்தில் பட்டியல்கள் மற்றும் மேற்கோள்களுக்குள் தோன்றும் குறியீடு-தொகுதிகளை அனுமதிக்கவும் (குறிப்பு #777, #2624, #2651)

source: #2635: Latex code directives produce inconsistent frames based on viewing resolution
ta: #2635: லேடெக்ச் குறியீடு உத்தரவுகள், பார்க்கும் தெளிவுத்திறனின் அடிப்படையில் சீரற்ற சட்டங்களை உருவாக்குகின்றன

source: #2639: Sphinx now bundles iftex.sty
ta: #2639: சூரரிமாச்சிலை இப்போது iftex.sty தொகுப்புகளை உருவாக்குகிறது

source: Failed to build PDF with framed.sty 0.95
ta: பிரேம். ஸ்டை 0.95 உடன் PDF ஐ உருவாக்கத் தவறிவிட்டது

source: Sphinx now bundles needspace.sty
ta: Sphinx இப்போது தேவைகள் .ஸ்டை தொகுக்கிறது

source: Release 1.4.3 (released Jun 5, 2016)
ta: வெளியீடு 1.4.3 (ஜூன் 5, 2016 வெளியிடப்பட்டது)

source: #2530: got "Counter too large" error on building PDF if large numbered footnotes existed in admonitions
ta: #2530: அறிவுரைகளில் பெரிய எண் அடிக்குறிப்புகள் இருந்தால், PDF ஐ உருவாக்குவதில் "கவுண்டர் மிகப் பெரியது" பிழை ஏற்பட்டது

source: ``width`` option of figure directive does not work if ``align`` option specified at same time (ref: #2595)
ta: ஒரே நேரத்தில் ``அலைன்`` விருப்பம் குறிப்பிடப்பட்டால், உருவ வழிகாட்டுதலின் ``அகலம்`` விருப்பம் வேலை செய்யாது (குறிப்பு: #2595)

source: #2590: The ``inputenc`` package breaks compiling under lualatex and xelatex
ta: #2590: The ``inputenc`` தொகுப்பு breaks compiling under lualatex and xelatex

source: #2540: date on latex front page use different font
ta: #2540: லேடெக்ச் முதல் பக்கத்தில் தேதி வெவ்வேறு எழுத்துருவைப் பயன்படுத்துகிறது

source: Suppress "document isn't included in any toctree" warning if the document is included (ref: #2603)
ta: ஆவணம் சேர்க்கப்பட்டிருந்தால், "எந்த டாக்ட்ரீயிலும் ஆவணம் சேர்க்கப்படவில்லை" என்ற எச்சரிக்கையை அடக்கவும் (குறிப்பு: #2603)

source: #2614: Some tables in PDF output will end up shifted if user sets non zero \parindent in preamble
ta: #2614: பயனர் முன்னுரையில் பூச்சியமற்ற \parindent என அமைத்தால் PDF வெளியீட்டில் உள்ள சில அட்டவணைகள் மாற்றப்படும்.

source: #2602: URL redirection breaks the hyperlinks generated by ``sphinx.ext.intersphinx``
ta: #2602: முகவரி திசைதிருப்பல் ``sphinx.ext.intersphinx`` மூலம் உருவாக்கப்பட்ட ஐப்பர்லிங்க்களை உடைக்கிறது

source: #2613: Show warnings if merged extensions are loaded
ta: #2613: இணைக்கப்பட்ட நீட்டிப்புகள் ஏற்றப்பட்டால் எச்சரிக்கைகளைக் காட்டு

source: #2619: make sure amstext LaTeX package always loaded (ref: d657225, 488ee52, 9d82cad and #2615)
ta: #2619: amstext லாடெக்சு தொகுப்பு எப்போதும் ஏற்றப்பட்டிருப்பதை உறுதிசெய்யவும் (குறிப்பு: d657225, 488ee52, 9d82cad மற்றும் #2615)

source: #2593: latex crashes if any figures in the table
ta: #2593: அட்டவணையில் ஏதேனும் புள்ளிவிவரங்கள் இருந்தால் லேடெக்ச் செயலிழக்கும்

source: Release 1.4.2 (released May 29, 2016)
ta: வெளியீடு 1.4.2 (மே 29, 2016 வெளியிடப்பட்டது)

source: Now :confval:`suppress_warnings` accepts following configurations (ref: #2451, #2466):
ta: இப்போது :confval:`suppress_warnings` பின்வரும் உள்ளமைவுகளை ஏற்றுக்கொள்கிறது (குறிப்பு: #2451, #2466):

source: #2453: LaTeX writer allows page breaks in topic contents; and their horizontal extent now fits in the line width (with shadow in margin). Also warning-type admonitions allow page breaks and their vertical spacing has been made more coherent with the one for hint-type notices (ref #2446).
ta: #2453: லாடெக்சு எழுத்தாளர் தலைப்பு உள்ளடக்கங்களில் பக்க இடைவெளிகளை அனுமதிக்கிறார்; மற்றும் அவற்றின் கிடைமட்ட அளவு இப்போது கோட்டின் அகலத்தில் (விளிம்பில் நிழலுடன்) பொருந்துகிறது. மேலும் எச்சரிக்கை-வகை அறிவுரைகள் பக்க இடைவெளிகளை அனுமதிக்கின்றன மற்றும் அவற்றின் செங்குத்து இடைவெளி, குறிப்பு வகை அறிவிப்புகளுக்கு (குறிப்பு #2446).

source: #2459: the framing of literal code-blocks in LaTeX output (and not only the code lines themselves) obey the indentation in lists or quoted blocks.
ta: #2459: லாடெக்சு வெளியீட்டில் (மற்றும் குறியீடு வரிகள் மட்டும் அல்ல) நேரடியான குறியீடு-தடுப்புகளின் கட்டமைப்பானது பட்டியல்கள் அல்லது மேற்கோள் காட்டப்பட்ட தொகுதிகளில் உள்ள உள்தள்ளலுக்குக் கீழ்ப்படிகிறது.

source: #2343: the long source lines in code-blocks are wrapped (without modifying the line numbering) in LaTeX output (ref #1534, #2304).
ta: #2343: லாடெக்சு வெளியீட்டில் (குறிப்பு #1534, #2304) குறியீட்டுத் தொகுதிகளில் உள்ள நீண்ட மூலக் கோடுகள் மூடப்பட்டிருக்கும் (வரி எண்ணை மாற்றாமல்).

source: #2370: the equations are slightly misaligned in LaTeX writer
ta: #2370: லாடெக்சு எழுத்தாளரில் சமன்பாடுகள் சற்று தவறாக அமைக்கப்பட்டுள்ளன

source: #1817, #2077: suppress pep8 warnings on conf.py generated by sphinx-quickstart
ta: #1817, #2077: sphinx-quickstart மூலம் உருவாக்கப்பட்ட conf.py இல் pep8 எச்சரிக்கைகளை அடக்கவும்

source: #2407: building docs crash if document includes large data image URIs
ta: #2407: ஆவணத்தில் பெரிய தரவுப் பட URIகள் இருந்தால் கட்டிட ஆவணங்கள் செயலிழக்கும்

source: #2436: Sphinx does not check version by :confval:`needs_sphinx` if loading extensions failed
ta: #2436: நீட்டிப்புகளை ஏற்றுவது தோல்வியுற்றால்:confval:`needs_sphinx` மூலம் சூரரிமாச்சிலை பதிப்பைச் சரிபார்க்காது

source: #2397: Setup shorthandoff for Turkish documents
ta: #2397: துருக்கிய ஆவணங்களுக்கான சுருக்கத்தை அமைக்கவும்

source: #2447: VerbatimBorderColor wrongly used also for captions of PDF
ta: #2447: PDF இன் தலைப்புகளுக்கும் VerbatimBorderColor தவறாகப் பயன்படுத்தப்பட்டது

source: #2456: C++, fix crash related to document merging (e.g., singlehtml and Latex builders).
ta: #2456: C++, ஆவணம் இணைத்தல் தொடர்பான செயலிழப்பை சரிசெய்யவும் (எ.கா., singlehtml மற்றும் லாடெக்சு builders).

source: #2446: latex(pdf) sets local tables of contents (or more generally topic nodes) in unbreakable boxes, causes overflow at bottom
ta: #2446: லேடெக்ச் (pdf) உடைக்க முடியாத பெட்டிகளில் உள்ளக உள்ளடக்க அட்டவணைகளை (அல்லது பொதுவாக தலைப்பு முனைகள்) அமைக்கிறது, கீழே நிரம்பி வழிகிறது

source: #2476: Omit MathJax markers if :nowrap: is given
ta: #2476: :nowrap: கொடுக்கப்பட்டால் MathJax குறிப்பான்களைத் தவிர்க்கவும்

source: #2465: latex builder fails in case no caption option is provided to toctree directive
ta: #2465: டோக்ட்ரீ உத்தரவுக்கு தலைப்பு விருப்பத்தேர்வு வழங்கப்படாவிட்டால் லேடெக்ச் பில்டர் தோல்வியடைகிறது

source: Sphinx crashes if self referenced toctree found
ta: சுயமாக குறிப்பிடப்பட்டால் ஸ்பிங்க்ஸ் செயலிழக்கிறது

source: #2481: spelling mistake for mecab search splitter. Thanks to Naoki Sato.
ta: #2481: mecab தேடல் பிரிப்பான் எழுத்துப்பிழை. நவோகி சாடோவுக்கு நன்றி.

source: #2309: Fix could not refer "indirect hyperlink targets" by ref-role
ta: #2309: Fix ஆனது ref-role மூலம் "மறைமுக ஐப்பர்லிங்க் இலக்குகளை" குறிப்பிட முடியவில்லை

source: intersphinx fails if mapping URL contains any port
ta: URL ஐ மேப்பிங் செய்தால் இன்டெர்ஸ்பின்க்ஸ் தோல்வியடைகிறது

source: #2088: intersphinx crashes if the mapping URL requires basic auth
ta: #2088: மேப்பிங் URLக்கு அடிப்படை ஏற்பு தேவைப்பட்டால் intersphinx செயலிழக்கும்

source: #2304: auto line breaks in latexpdf codeblocks
ta: #2304: latexpdf கோட் பிளாக்குகளில் ஆட்டோ லைன் உடைகிறது

source: #1534: Word wrap long lines in Latex verbatim blocks
ta: #1534: லேடெக்ச் வெர்பேட்டிம் பிளாக்குகளில் வேர்ட் ரேப் நீண்ட கோடுகள்

source: #2460: too much white space on top of captioned literal blocks in PDF output
ta: #2460: PDF வெளியீட்டில் தலைப்பிடப்பட்ட எழுத்துத் தொகுதிகளின் மேல் அதிக இடைவெளி

source: Show error reason when multiple math extensions are loaded (ref: #2499)
ta: பல கணித நீட்டிப்புகள் ஏற்றப்படும் போது பிழைக்கான காரணத்தைக் காட்டு (குறிப்பு: #2499)

source: #2483: any figure number was not assigned if figure title contains only non text objects
ta: #2483: உருவத் தலைப்பில் உரை அல்லாத பொருள்கள் மட்டுமே இருந்தால், எந்த எண்ணும் ஒதுக்கப்படாது

source: #2501: Unicode subscript numbers are normalized in LaTeX
ta: #2501: யூனிகோட் சப்ச்கிரிப்ட் எண்கள் லாடெக்சு இல் இயல்பாக்கப்படுகின்றன

source: #2492: Figure directive with :figwidth: generates incorrect Latex-code
ta: #2492: :figwidth: உடன் Figure directive: தவறான லேடெக்ச்-குறியீட்டை உருவாக்குகிறது

source: The caption of figure is always put on center even if ``:align:`` was specified
ta: ``: சீரமை: `` குறிப்பிடப்பட்டிருந்தாலும் புள்ளிவிவரத்தின் தலைப்பு எப்போதும் மையத்தில் வைக்கப்படும்

source: #2526: LaTeX writer crashes if the section having only images
ta: #2526: பிரிவில் படங்கள் மட்டும் இருந்தால் லாடெக்சு ரைட்டர் செயலிழக்கும்
