Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_usage--extensions--autodoc_*.po
Languages: ta

source: ``'documented_params'``: Parameter types will only be annotated if the parameter is documented in the docstring. The return type is always annotated (except if it is ``None``).
ta: ``'documented_params'``: அளவுருக்கள் docstring இல் ஆவணப்படுத்தப்பட்டிருந்தால் மட்டுமே அளவுரு வகைகள் சிறுகுறிப்பு செய்யப்படும். திரும்பும் வகை எப்பொழுதும் சிறுகுறிப்பு செய்யப்படுகிறது (இது ``ஒன்றுமில்லை`` என்பதைத் தவிர).

source: New option ``'documented_params'`` is added.
ta: புதிய விருப்பம் `` 'ஆவணப்படுத்தப்பட்ட_பாராம்ச்'`` சேர்க்கப்பட்டுள்ளது.

source: A dictionary for users defined `type aliases`__ that maps a type name to the full-qualified object name. It is used to keep type aliases not evaluated in the document.
ta: பயனர்களுக்கான அகராதி, `வகை மாற்றுப்பெயர்கள்`__ முழுத் தகுதியான பொருளின் பெயருக்கு ஒரு வகை பெயரை வரைபடமாக்குகிறது. ஆவணத்தில் மதிப்பிடப்படாத வகை மாற்றுப்பெயர்களை வைத்திருக்க இது பயன்படுகிறது.

source: The type aliases are only available if your program enables :pep:`Postponed Evaluation of Annotations (PEP 563) <563>` feature via ``from __future__ import annotations``.
ta: உங்கள் நிரல் இயற்றினால் மட்டுமே வகை மாற்றுப்பெயர்கள் கிடைக்கின்றன: pep: `சிறுகுறிப்புகளின் ஒத்திவைக்கப்பட்ட மதிப்பீட்டை (pep 563) <563>` __ __future__ இலிருந்து இறக்குமதி சிறுகுறிப்புகளிலிருந்து `வழியாக நற்பொருத்தம்.

source: For example, there is code using a type alias:
ta: எடுத்துக்காட்டாக, ஒரு வகை மாற்றுப் பெயரைப் பயன்படுத்தி குறியீடு உள்ளது:

source: If ``autodoc_type_aliases`` is not set, autodoc will generate internal mark-up from this code as following:
ta: ``autodoc_type_aliases`` அமைக்கப்படவில்லை எனில், autodoc இந்தக் குறியீட்டிலிருந்து பின்வருமாறு உள் மார்க்-அப்பை உருவாக்கும்:

source: If you set ``autodoc_type_aliases`` as ``{'AliasType': 'your.module.AliasType'}``, it generates the following document internally:
ta: நீங்கள் ``autodoc_type_aliases`````````{'AliasType': 'your.module.AliasType'}`` என அமைத்தால், அது பின்வரும் ஆவணத்தை உள்நாட்டில் உருவாக்குகிறது:

source: This value controls the format of typehints. The setting takes the following values:
ta: இந்த மதிப்பு டைப்இன்ட்களின் வடிவமைப்பைக் கட்டுப்படுத்துகிறது. அமைப்பு பின்வரும் மதிப்புகளை எடுக்கும்:

source: ``'fully-qualified'`` -- Show the module name and its name of typehints
ta: `` 'முழுமையாக தகுதி வாய்ந்த'``-தொகுதி பெயரையும் அதன் டைப்இன்ட்களின் பெயரையும் காட்டுங்கள்

source: ``'short'`` -- Suppress the leading module names of the typehints (e.g. ``io.StringIO`` -> ``StringIO``)
ta: ``'குறுகிய'`` -- தட்டச்சு குறிப்புகளின் முன்னணி தொகுதி பெயர்களை அடக்கவும் (எ.கா. ``io.StringIO`` -> ``StringIO``)

source: The default setting was changed to ``'short'``
ta: இயல்புநிலை அமைப்பு `` 'சார்ட்'`` ஆக மாற்றப்பட்டது

source: If True, the default argument values of functions will be not evaluated on generating document. It preserves them as is in the source code.
ta: உண்மை என்றால், செயல்பாடுகளின் இயல்புநிலை வாத மதிப்புகள் ஆவணத்தை உருவாக்குவதில் மதிப்பீடு செய்யப்படாது. மூலக் குறியீட்டில் உள்ளதைப் போலவே இது அவற்றைப் பாதுகாக்கிறது.

source: Added as an experimental feature. This will be integrated into autodoc core in the future.
ta: ஒரு சோதனை அம்சமாக சேர்க்கப்பட்டது. இது எதிர்காலத்தில் ஆட்டோடோக் கோரில் ஒருங்கிணைக்கப்படும்.

source: Attempt to read ``# type: ...`` comments from source code to supplement missing type annotations, if True.
ta: ``# வகை: ...`` கருத்துரைகளைப் படிக்க முயற்சிக்கவும், அது சரி எனில், விடுபட்ட வகை சிறுகுறிப்புகளுக்கு துணைபுரிய மூலக் குறியீட்டிலிருந்து.

source: This can be disabled if your source code does not use type comments, for example if it exclusively uses type annotations or does not use type hints of any kind.
ta: உங்கள் மூலக் குறியீடு வகைக் கருத்துகளைப் பயன்படுத்தவில்லை என்றால், எடுத்துக்காட்டாக, வகை சிறுகுறிப்புகளை மட்டும் பயன்படுத்தினால் அல்லது எந்த வகை குறிப்புகளையும் பயன்படுத்தவில்லை என்றால் இது முடக்கப்படும்.

source: Added the option to disable the use of type comments in via the new :confval:`!autodoc_use_type_comments` option, which defaults to :code-py:`True` for backwards compatibility. The default will change to :code-py:`False` in Sphinx 10.
ta: புதிய :confval:`!autodoc_use_type_comments` விருப்பத்தின் மூலம் வகைக் கருத்துகளைப் பயன்படுத்துவதை முடக்குவதற்கான விருப்பம் சேர்க்கப்பட்டது, இது பின்னோக்கி இணக்கத்தன்மைக்காக :code-py:`True` க்கு இயல்புநிலையாக இருக்கும். சூரரிமாச்சிலை 10 இல் இயல்புநிலை :code-py:`False` என மாறும்.

source: This value controls the behavior of :option:`sphinx-build --fail-on-warning` during importing modules. If ``False`` is given, autodoc forcedly suppresses the error if the imported module emits warnings.
ta: இந்த மதிப்பு தொகுதிகளை இறக்குமதி செய்யும் போது :option:`sphinx-build --fail-on-warning` இன் நடத்தையை கட்டுப்படுத்துகிறது. ``False`` வழங்கப்பட்டால், இறக்குமதி செய்யப்பட்ட தொகுதி எச்சரிக்கைகளை வெளிப்படுத்தினால், autodoc பிழையை வலுக்கட்டாயமாக அடக்குகிறது.

source: This option now has no effect as :option:`!--fail-on-warning` no longer exits early.
ta: இந்த விருப்பம் இப்போது :option:`!--fail-on-warning` என எந்த விளைவையும் ஏற்படுத்தாது.

source: This value controls the docstrings inheritance. If set to True the docstring for classes or methods, if not explicitly set, is inherited from parents.
ta: இந்த மதிப்பு டாக்ச்ட்ரிங்ச் பரம்பரை கட்டுப்படுத்துகிறது. வகுப்புகள் அல்லது முறைகளுக்கான டாக்ச்ட்ரிங்கை உண்மையாக அமைத்தால், வெளிப்படையாக அமைக்கப்படாவிட்டால், பெற்றோரிடமிருந்து பெறப்படுகிறது.

source: :mod:`autodoc` supports suppressing warning messages via :confval:`suppress_warnings`. It defines the following additional warnings types:
ta: :confval:`suppress_warnings` வழியாக முன்னறிவிப்பு செய்திகளை அடக்குவதை :mod:`autodoc` ஆதரிக்கிறது. இது பின்வரும் கூடுதல் முன்னறிவிப்பு வகைகளை வரையறுக்கிறது:

source: autodoc
ta: ஆட்டோடாக்

source: Docstring preprocessing
ta: ஆவணசரம் முன் செயலாக்கம்

source: autodoc provides the following additional events:
ta: ஆட்டோடாக் பின்வரும் கூடுதல் நிகழ்வுகளை வழங்குகிறது:

source: Emitted when autodoc has read and processed a docstring. *lines* is a list of strings -- the lines of the processed docstring -- that the event handler can modify **in place** to change what Sphinx puts into the output.
ta: ஆட்டோடோக் ஒரு டாக்ச்ட்ரிங்கைப் படித்து செயலாக்கும்போது உமிழப்படும். *கோடுகள்*என்பது சரங்களின் பட்டியல் - பதப்படுத்தப்பட்ட ஆவணத்தின் கோடுகள் - நிகழ்வு கையாளுபவர் ** இடத்தில் ** ஐ மாற்ற முடியும் **

source: Parameters
ta: அளவுருக்கள்

source: the Sphinx application object
ta: சூரரிமாச்சிலை பயன்பாட்டு பொருள்

source: the type of the object which the docstring belongs to (one of ``'module'``, ``'class'``, ``'exception'``, ``'function'``, ``'decorator'``, ``'method'``, ``'property'``, ``'attribute'``, ``'data'``, or ``'type'``)
ta: ஆவணசரம் சேர்ந்த பொருளின் வகை (```தொகுதி''`, ``'வகுப்பு''``, ``'விதிவிலக்கு''``, ```செயல்பாடு''``, ``'அலங்கரிப்பான்''``, ```முறை''``, ``'சொத்து''`, ``'பண்பு'', ````````,

source: the fully qualified name of the object
ta: பொருளின் முழு தகுதி வாய்ந்த பெயர்

source: the object itself
ta: பொருள் தானே

source: the options given to the directive: an object with attributes corresponding to the options used in the auto directive, e.g. ``inherited_members``, ``undoc_members``, or ``show_inheritance``.
ta: கட்டளைக்கு கொடுக்கப்பட்ட விருப்பங்கள்: தன்னியக்க கட்டளையில் பயன்படுத்தப்படும் விருப்பங்களுடன் தொடர்புடைய பண்புகளைக் கொண்ட ஒரு பொருள், எ.கா. ``பரம்பரை_உறுப்பினர்கள்``, ``உறுப்பினர்களை நீக்குதல்`` அல்லது ``பரம்பரை_காட்சி``.

source: the lines of the docstring, see above
ta: டாக்ச்ட்ரிங்கின் கோடுகள், மேலே காண்க

source: Emitted before autodoc formats a signature for an object. The event handler can modify an object to change its signature.
ta: ஆட்டோடாக் முன் உமிழ்க்கும் ஒரு பொருளின் கையொப்பத்தை வடிவமைக்கிறது. நிகழ்வு கையாளுபவர் அதன் கையொப்பத்தை மாற்ற ஒரு பொருளை மாற்ற முடியும்.

source: a boolean indicates an object is bound method or not
ta: ஒரு பூலியன் ஒரு பொருள் பிணைக்கப்பட்ட முறை அல்லது இல்லை என்பதைக் குறிக்கிறது

source: Emitted when autodoc has formatted a signature for an object. The event handler can return a new tuple ``(signature, return_annotation)`` to change what Sphinx puts into the output.
ta: ஆட்டோடோக் ஒரு பொருளுக்கு கையொப்பத்தை வடிவமைத்தபோது உமிழப்படும். நிகழ்வு கையாளுபவர் ஒரு புதிய டூப்பிள் `` (கையொப்பம், திரும்ப_ஆனோடேசன்) `` வெளியீட்டில் சூரரிமாச்சிலை வைப்பதை மாற்ற முடியும்.

source: function signature, as a string of the form ``'(parameter_1, parameter_2)'``, or ``None`` if introspection didn't succeed and signature wasn't specified in the directive.
ta: செயல்பாடு கையொப்பம், ``'(அளவுரு_1, அளவுரு_2)'``, அல்லது ``ஒன்றுமில்லை`` படிவத்தின் சரமாக, சுயபரிசோதனை வெற்றிபெறவில்லை மற்றும் உத்தரவில் கையொப்பம் குறிப்பிடப்படவில்லை.

source: function return annotation as a string of the form ``'annotation'``, or ``''`` if there is no return annotation.
ta: ஃபங்சன் ரிட்டர்ன் சிறுகுறிப்பு என்பது ``'சிறுகுறிப்பு'`` வடிவத்தின் சரமாக, அல்லது ரிட்டர்ன் சிறுகுறிப்பு இல்லை என்றால் ``''``.

source: The :mod:`sphinx.ext.autodoc` module provides factory functions for commonly needed docstring processing in event :event:`autodoc-process-docstring`:
ta: தி: மோட்: `sphinx.ext.autodoc` தொகுதி நிகழ்வில் பொதுவாக தேவைப்படும் ஆவணசரம் செயலாக்கத்திற்கான தொழிற்சாலை செயல்பாடுகளை வழங்குகிறது: நிகழ்வு:` ஆட்டோடோக்-செயல்முறை-டோக்ச்ட்ரிங்`:

source: Return a listener that removes the first *pre* and last *post* lines of every docstring. If *what* is a sequence of strings, only docstrings of a type in *what* will be processed.
ta: ஒவ்வொரு ஆவணத்தின் முதல் * முன் * மற்றும் கடைசி * இடுகை * வரிகளை அகற்றும் கேட்பவரைத் திருப்பி விடுங்கள். * என்ன * என்பது சரங்களின் வரிசை என்றால், * என்ன * செயலாக்கப்படும்.

source: Use like this (e.g. in the ``setup()`` function of :file:`conf.py`)::
ta: இதைப் பயன்படுத்தவும் (எ.கா. `` அமைவு () `` செயல்பாட்டில்: கோப்பு: `conf.py`) ::

source: This can (and should) be used in place of :confval:`automodule_skip_lines`.
ta: இதற்கு பதிலாக இது பயன்படுத்தப்படலாம் (மற்றும் வேண்டும்): confval: `autolodule_skip_lines`.

source: Return a listener that either keeps, or if *exclude* is True excludes, lines between lines that match the *marker* regular expression. If no line matches, the resulting docstring would be empty, so no change will be made unless *keepempty* is true.
ta: ஒரு கேட்பவரைத் திருப்பி விடுங்கள், அல்லது * விலக்குதல் * உண்மையாக இருந்தால், * மார்க்கர் * வழக்கமான வெளிப்பாட்டுடன் பொருந்தக்கூடிய வரிகளுக்கு இடையிலான கோடுகள். வரி பொருந்தவில்லை என்றால், இதன் விளைவாக வரும் ஆவணங்கள் காலியாக இருக்கும், எனவே * தீவிரம் * உண்மையாக இல்லாவிட்டால் எந்த மாற்றமும் செய்யப்படாது.

source: If *what* is a sequence of strings, only docstrings of a type in *what* will be processed.
ta: * என்ன * என்பது சரங்களின் வரிசை என்றால், * என்ன * செயலாக்கப்படும்.

source: Emitted when autodoc has read and processed a class to determine the base-classes. *bases* is a list of classes that the event handler can modify **in place** to change what Sphinx puts into the output. It's emitted only if the ``show-inheritance`` option is given.
ta: அடிப்படை வகுப்புகளைத் தீர்மானிக்க, ஆட்டோடாக் ஒரு வகுப்பைப் படித்து செயலாக்கும்போது உமிழப்படும். *அடிப்படைகள்* என்பது சூரரிமாச்சிலை வெளியீட்டில் என்ன வைக்கிறது என்பதை மாற்ற, நிகழ்வு கையாளுபவர் **இடத்தில்** மாற்றக்கூடிய வகுப்புகளின் பட்டியல். ``சோ-பரம்பரை`` விருப்பம் கொடுக்கப்பட்டால் மட்டுமே அது வெளியிடப்படும்.

source: unused placeholder
ta: பயன்படுத்தப்படாத ஒதுக்கிட

source: the list of base classes signature. see above.
ta: அடிப்படை வகுப்புகள் கையொப்பத்தின் பட்டியல். மேலே பார்க்க.

source: ``bases`` can contain a string as a base class name. It will be processed as reStructuredText.
ta: ``bases`` ஒரு அடிப்படை வர்க்கப் பெயராக ஒரு சரத்தைக் கொண்டிருக்கலாம். இது மறுகட்டமைக்கப்பட்ட உரையாக செயலாக்கப்படும்.

source: Skipping members
ta: உறுப்பினர்களைத் தவிர்ப்பது

source: autodoc allows the user to define a custom method for determining whether a member should be included in the documentation by using the following event:
ta: பின்வரும் நிகழ்வைப் பயன்படுத்துவதன் மூலம் ஆவணத்தில் ஒரு உறுப்பினர் சேர்க்கப்பட வேண்டுமா என்பதை தீர்மானிக்க தனிப்பயன் முறையை வரையறுக்க ஆட்டோடாக் பயனரை அனுமதிக்கிறது:

source: Emitted when autodoc has to decide whether a member should be included in the documentation. The member is excluded if a handler returns ``True``. It is included if the handler returns ``False``.
ta: ஆவணத்தில் ஒரு உறுப்பினர் சேர்க்கப்பட வேண்டுமா என்பதை ஆட்டோடோக் தீர்மானிக்க வேண்டும். ஒரு கையாளுபவர் `` உண்மை`` திரும்பினால் உறுப்பினர் விலக்கப்படுவார். ஏண்ட்லர் `` தவறு`` திரும்பினால் அது சேர்க்கப்பட்டுள்ளது.

source: If more than one enabled extension handles the ``autodoc-skip-member`` event, autodoc will use the first non-``None`` value returned by a handler. Handlers should return ``None`` to fall back to the skipping behavior of autodoc and other enabled extensions.
ta: ஒன்றுக்கு மேற்பட்ட இயக்கப்பட்ட நீட்டிப்பு `` ஆட்டோடோக்-ச்கிப்-மெம்பர்`` நிகழ்வைக் கையாளுகிறது என்றால், ஆட்டோடோக் ஒரு கையாளுபவரால் திருப்பி அனுப்பப்பட்ட முதல் `நேன் அல்லாத` மதிப்பைப் பயன்படுத்தும். ஆட்டோடோக் மற்றும் பிற இயக்கப்பட்ட நீட்டிப்புகளின் தவிர்க்கும் நடத்தைக்குத் திரும்புவதற்கு கையாளுபவர்கள் `` எதுவுமில்லை` `திரும்ப வேண்டும்.

source: a boolean indicating if autodoc will skip this member if the user handler does not override the decision
ta: பயனர் கையாளுபவர் முடிவை மீறாவிட்டால் ஆட்டோடோக் இந்த உறுப்பினரைத் தவிர்ப்பதா என்பதைக் குறிக்கும் ஒரு பூலியன்
