Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_usage--extensions--todo_*.po
Languages: ta

source: :mod:`sphinx.ext.todo` -- Support for todo items
ta: : மோட்: `sphinx.ext.todo` - டோடோ உருப்படிகளுக்கான ஆதரவு

source: There are two additional directives when using this extension:
ta: இந்த நீட்டிப்பைப் பயன்படுத்தும் போது இரண்டு கூடுதல் வழிமுறைகள் உள்ளன:

source: Use this directive like, for example, :rst:dir:`note`.
ta: எடுத்துக்காட்டாக, இந்த உத்தரவைப் பயன்படுத்தவும், rst: dir: `குறிப்பு`.

source: It will only show up in the output if :confval:`todo_include_todos` is ``True``.
ta: இது வெளியீட்டில் மட்டுமே காண்பிக்கப்படும்: confval: `todo_include_todos` என்பது` `உண்மை``.

source: This directive supports an ``class`` option that determines the class attribute for HTML output. If not given, the class defaults to ``admonition-todo``.
ta: இந்த உத்தரவு HTML வெளியீட்டிற்கான வர்க்க பண்புகளை தீர்மானிக்கும் `` வகுப்பு`` விருப்பத்தை ஆதரிக்கிறது. வழங்கப்படாவிட்டால், வகுப்பு `` அறிவுரை-டோடோ`` இயல்புநிலையாகிறது.

source: This directive is replaced by a list of all todo directives in the whole documentation, if :confval:`todo_include_todos` is ``True``.
ta: இந்த உத்தரவு முழு ஆவணத்திலும் உள்ள அனைத்து டோடோ வழிமுறைகளின் பட்டியலால் மாற்றப்படுகிறது, if: confval: `todo_include_todos` என்பது` `உண்மை``.

source: These can be configured as seen below.
ta: கீழே காணப்படுவது போல் இவை கட்டமைக்கப்படலாம்.

source: Configuration
ta: உள்ளமைவு

source: Type
ta: வகை

source: Default
ta: இயல்புநிலை

source: If this is ``True``, :rst:dir:`todo` and :rst:dir:`todolist` produce output, else they produce nothing.
ta: இது ``உண்மை`` எனில், :rst:dir:`todo` மற்றும் :rst:dir:`todolist` ஆகியவை வெளியீட்டை உருவாக்குகின்றன, இல்லையெனில் அவை எதையும் உருவாக்காது.

source: If this is ``True``, :rst:dir:`todo` emits a warning for each TODO entries.
ta: இது ``உண்மை`` எனில், :rst:dir:`todo` ஒவ்வொரு TODO உள்ளீடுகளுக்கும் ஒரு எச்சரிக்கையை வெளியிடுகிறது.

source: If this is ``True``, :rst:dir:`todolist` produce output without file path and line.
ta: இது ``True`` எனில், :rst:dir:`todolist` கோப்பு பாதை மற்றும் வரி இல்லாமல் வெளியீட்டை உருவாக்குகிறது.

source: autodoc provides the following an additional event:
ta: ஆட்டோடாக் பின்வரும் கூடுதல் நிகழ்வை வழங்குகிறது:

source: Emitted when a todo is defined. *node* is the defined ``sphinx.ext.todo.todo_node`` node.
ta: ஒரு டோடோ வரையறுக்கப்படும்போது உமிழப்படும். * முனை* என்பது வரையறுக்கப்பட்ட `` sphinx.ext.todo.todo_node`` முனை.
