Repository: 247i/TACETr
Catalog: உரை/தானி/sphinx-doc_changes--2_4_*.po
Languages: ta

source: Sphinx 2.4
ta: சூரரிமாச்சிலை 2.4

source: Release 2.4.5 (released Nov 18, 2021)
ta: வெளியீடு 2.4.5 (நவம்பர் 18, 2021 இல் வெளியிடப்பட்டது)

source: Dependencies
ta: சார்புநிலைகள்

source: #9807: Restrict Docutils to 0.17.x or older
ta: #9807: ஆவணங்களை 0.17.x அல்லது அதற்கு மேற்பட்டதாகக் கட்டுப்படுத்தவும்

source: Release 2.4.4 (released Mar 05, 2020)
ta: வெளியீடு 2.4.4 (மார்ச் 05, 2020 இல் வெளியிடப்பட்டது)

source: Bugs fixed
ta: பிழைகள் சரி செய்யப்பட்டன

source: #7197: LaTeX: platex cause error to build image directive with target url
ta: #7197: LaTeX: இலக்கு முகவரி உடன் பட கட்டளையை உருவாக்க பிளேட்க்ச் பிழையை ஏற்படுத்துகிறது

source: #7223: Sphinx builds has been slower since 2.4.0
ta: #7223: 2.4.0 முதல் சூரரிமாச்சிலை உருவாக்கம் மெதுவாக உள்ளது

source: Release 2.4.3 (released Feb 22, 2020)
ta: வெளியீடு 2.4.3 (பிப்ரவரி 22, 2020 இல் வெளியிடப்பட்டது)

source: #7184: autodoc: ``*args`` and ``**kwarg`` in type comments are not handled properly
ta: #7184: autodoc: வகை கருத்துகளில் ``*args`` மற்றும் ``**kwarg`` சரியாக கையாளப்படவில்லை

source: #7189: autodoc: classmethod coroutines are not detected
ta: #7189: ஆட்டோடாக்: கிளாச்மெத்தட் கரோட்டின்கள் கண்டறியப்படவில்லை

source: #7183: intersphinx: ``:attr:`` reference to property is broken
ta: #7183: intersphinx: ``:attr:`` சொத்து பற்றிய குறிப்பு உடைக்கப்பட்டது

source: #6244, #6387: html search: Search breaks/hangs when built with dirhtml builder
ta: #6244, #6387: உஉகுமொ தேடல்: dirhtml பில்டரைக் கொண்டு உருவாக்கும்போது தேடல் முறிவுகள்/தொங்கும்

source: #7195: todo: emit doctree-resolved event with non-document node incorrectly
ta: #7195: செய்ய வேண்டியவை: ஆவணம் அல்லாத முனையுடன் டாக்ட்ரீ-தீர்க்கப்பட்ட நிகழ்வை தவறாக வெளியிடவும்

source: Release 2.4.2 (released Feb 19, 2020)
ta: வெளியீடு 2.4.2 (பிப்ரவரி 19, 2020 இல் வெளியிடப்பட்டது)

source: #7138: autodoc: ``autodoc.typehints`` crashed when variable has unbound object as a value
ta: #7138: autodoc: ``autodoc.typehints`` மாறியானது வரம்பற்ற பொருளை மதிப்பாகக் கொண்டிருக்கும்போது செயலிழந்தது

source: #7156: autodoc: separator for keyword only arguments is not shown
ta: #7156: autodoc: முக்கிய வார்த்தைகளுக்கான பிரிப்பான் மட்டும் வாதங்கள் காட்டப்படவில்லை

source: #7146: autodoc: IndexError is raised on suppressed type_comment found
ta: #7146: autodoc: ஒடுக்கப்பட்ட வகை_கருத்து கண்டறியப்பட்டதில் குறியீட்டுப் பிழை எழுப்பப்பட்டது

source: #7161: autodoc: typehints extension does not support parallel build
ta: #7161: autodoc: typehints நீட்டிப்பு இணை உருவாக்கத்தை ஆதரிக்காது

source: #7178: autodoc: TypeError is raised on fetching type annotations
ta: #7178: autodoc: வகை சிறுகுறிப்புகளைப் பெறுவதில் TypeError எழுகிறது

source: #7151: crashed when extension assigns a value to ``env.indexentries``
ta: #7151: ``env.indexentries``க்கு நீட்டிப்பு மதிப்பை ஒதுக்கும்போது செயலிழந்தது

source: #7170: text: Remove debug print
ta: #7170: உரை: பிழைத்திருத்த அச்சை அகற்று

source: #7137: viewcode: Avoid to crash when non-python code given
ta: #7137: பார்வைக் குறியீடு: பைதான் அல்லாத குறியீடு கொடுக்கப்படும்போது செயலிழப்பதைத் தவிர்க்கவும்

source: Release 2.4.1 (released Feb 11, 2020)
ta: வெளியீடு 2.4.1 (பிப்ரவரி 11, 2020 வெளியிடப்பட்டது)

source: #7120: html: crashed when on scaling SVG images which have float dimensions
ta: #7120: html: மிதவை பரிமாணங்களைக் கொண்ட SVG படங்களை அளவிடும் போது செயலிழந்தது

source: #7126: autodoc: TypeError: 'getset_descriptor' object is not iterable
ta: #7126: autodoc: TypeError: 'getset_descriptor' ஆப்செக்ட் மீண்டும் செய்ய முடியாது

source: Release 2.4.0 (released Feb 09, 2020)
ta: வெளியீடு 2.4.0 (பிப்ரவரி 09, 2020 வெளியிடப்பட்டது)

source: Deprecated
ta: மதிப்பிடப்பட்டது

source: The ``decode`` argument of ``sphinx.pycode.ModuleAnalyzer()``
ta: `` Sphinx.pycode.moduleanalyzer () `` `` `decode`` வாதம்` `

source: ``sphinx.environment.temp_data['gloss_entries']``
ta: `` sphinx.enveronment.temp_data ['gloss_entries'] ``

source: ``sphinx.environment.BuildEnvironment.indexentries``
ta: `` sphinx.enveronment.buildenveronment.indexentries``

source: ``sphinx.environment.collectors.indexentries.IndexEntriesCollector``
ta: `` sphinx.enveronment.collectors.indexentries.indexentriesCollector``

source: Features added
ta: அம்சங்கள் சேர்க்கப்பட்டன

source: #6910: inheritance_diagram: Make the background of diagrams transparent
ta: #6910: பரம்பரை_வரைபடம்: வரைபடங்களின் பின்னணியை வெளிப்படையானதாக ஆக்கு

source: #6446: duration: Add ``sphinx.ext.durations`` to inspect which documents slow down the build
ta: #6446: கால அளவு: எந்த ஆவணங்கள் உருவாக்கத்தை மெதுவாக்குகின்றன என்பதை ஆய்வு செய்ய ``sphinx.ext.durations`` ஐச் சேர்க்கவும்

source: #6837: LaTeX: Support a nested table
ta: #6837: LaTeX: உள்ளமைக்கப்பட்ட அட்டவணையை ஆதரிக்கவும்

source: #7115: LaTeX: Allow to override LATEXOPTS and LATEXMKOPTS via environment variable
ta: #7115: LaTeX: சுற்றுச்சூழல் மாறி வழியாக LATEXOPTS மற்றும் LATEXMKOPTS ஐ மேலெழுத அனுமதிக்கவும்

source: #6966: graphviz: Support ``:class:`` option
ta: #6966: graphviz: ``:class:`` விருப்பத்தை ஆதரிக்கவும்

source: #6696: html: ``:scale:`` option of image/figure directive not working for SVG images (imagesize-1.2.0 or above is required)
ta: #6696: html: ``:scale:`` விருப்பம் SVG படங்களுக்கு வேலை செய்யாத படம்/உருவம் கட்டளை (imagesize-1.2.0 அல்லது அதற்கு மேல் தேவை)

source: #6994: imgconverter: Support illustrator file (.ai) to .png conversion
ta: #6994: imgconverter: சில்லச்ட்ரேட்டர் கோப்பு (.AI) க்கு .png மாற்றத்தை ஆதரிக்கவும்

source: autodoc: Support Positional-Only Argument separator (PEP-570 compliant)
ta: ஆட்டோடோக்: நிலை-மட்டும் வாத பிரிப்பான் (PEP-570 இணக்கமானது)

source: autodoc: Support type annotations for variables
ta: ஆட்டோடோக்: மாறிகளுக்கான ஆதரவு வகை சிறுகுறிப்புகள்

source: #2755: autodoc: Add new event: :event:`autodoc-before-process-signature`
ta: #2755: autodoc: புதிய நிகழ்வைச் சேர்: :event:`autodoc-befor-process-signature`

source: #2755: autodoc: Support type_comment style (ex. ``# type: (str) -> str``) annotation (python3.8+ or `typed_ast <https://github.com/python/typed_ast>`_ is required)
ta: #2755: autodoc: Support type_comment சூல் தண்டு (ex. ``# தட்டச்சு: (str) -> str``) சிறுகுறிப்பு (python3.8+ அல்லது `typed_ast <https://github.com/python/typed_ast>`_ தேவை)

source: #7051: autodoc: Support instance variables without defaults (PEP-526)
ta: #7051: autodoc: இயல்புநிலை இல்லாமல் உதவி நிகழ்வு மாறிகள் (PEP-526)

source: #6418: autodoc: Add a new extension ``sphinx.ext.autodoc.typehints``. It shows typehints as object description if ``autodoc_typehints = "description"`` set. This is an experimental extension and it will be integrated into autodoc core in Sphinx 3.0
ta: #6418: autodoc: ``sphinx.ext.autodoc.typehints`` என்ற புதிய நீட்டிப்பைச் சேர்க்கவும். ``autodoc_typehints = "விளக்கம்"`` அமைக்கப்பட்டால் அது தட்டச்சு குறிப்புகளை பொருள் விளக்கமாக காட்டுகிறது. இது ஒரு சோதனை நீட்டிப்பு மற்றும் இது சூரரிமாச்சிலை 3.0 இல் ஆட்டோடாக் மையத்தில் ஒருங்கிணைக்கப்படும்

source: SphinxTranslator now calls visitor/departure method for super node class if visitor/departure method for original node class not found
ta: அசல் முனை வகுப்பிற்கான பார்வையாளர்/புறப்படும் முறை கிடைக்கவில்லை என்றால், ஸ்பின்எக்ஸ்ட்ரான்ஸ்லேட்டர் இப்போது சூப்பர் முனை வகுப்பிற்கான பார்வையாளர்/புறப்படும் முறையை அழைக்கிறது

source: #6418: Add new event: :event:`object-description-transform`
ta: #6418: புதிய நிகழ்வைச் சேர்க்கவும்: :event:`object-description-transform`

source: py domain: :rst:dir:`py:data` and :rst:dir:`py:attribute` take new options named ``:type:`` and ``:value:`` to describe its type and initial value
ta: PY டொமைன் :: rst: dir: `py: data` மற்றும்: rst: dir:` py: பண்புக்கூறு `என்ற புதிய விருப்பங்களை எடுத்துக் கொள்ளுங்கள்` `:` `மற்றும்` `: மதிப்பு:` `அதன் வகை மற்றும் ஆரம்ப மதிப்பை விவரிக்க

source: #6785: py domain: ``:py:attr:`` is able to refer properties again
ta: #6785: py டொமைன்: ``:py:attr:`` பண்புகளை மீண்டும் குறிப்பிட முடியும்

source: #6772: apidoc: Add ``-q`` option for quiet mode
ta: #6772: apidoc: அமைதியான பயன்முறைக்கு ``-q`` விருப்பத்தைச் சேர்க்கவும்

source: #6925: html: Remove redundant type="text/javascript" from <script> elements
ta: #6925: html: தேவையற்ற வகை="text/javascript" ஐ <script> உறுப்புகளிலிருந்து அகற்று

source: #7112: html: SVG image is not layouted as float even if aligned
ta: #7112: html: SVG படம் சீரமைக்கப்பட்டிருந்தாலும் கூட மிதவையாக அமைக்கப்படவில்லை

source: #6906, #6907: autodoc: failed to read the source codes encoded in cp1251
ta: #6906, #6907: autodoc: cp1251 இல் குறியிடப்பட்ட மூலக் குறியீடுகளைப் படிக்க முடியவில்லை

source: #6961: latex: warning for babel shown twice
ta: #6961: லேடக்ச்: பேபிலுக்கான முன்னறிவிப்பு இரண்டு முறை காட்டப்பட்டுள்ளது

source: #7059: latex: LaTeX compilation falls into infinite loop (wrapfig issue)
ta: #7059: latex: லாடெக்சு தொகுப்பானது எல்லையற்ற சுழற்சியில் விழுகிறது (wrapfig பிரச்சினை)

source: #6581: latex: ``:reversed:`` option for toctree does not effect to LaTeX build
ta: #6581: latex: ``:reversed:`` toctreeக்கான விருப்பம் லாடெக்சு உருவாக்கத்தை பாதிக்காது

source: #6559: Wrong node-ids are generated in glossary directive
ta: #6559: சொற்களஞ்சியத்தில் தவறான முனை-ஐடிகள் உருவாக்கப்படுகின்றன

source: #6986: apidoc: misdetects module name for .so file inside module
ta: #6986: apidoc: misdetects தொகுதி பெயர் க்கு .so கோப்பு inside தொகுதி

source: #6899: apidoc: private members are not shown even if ``--private`` given
ta: #6899: apidoc: ``--private`` வழங்கப்பட்டாலும் தனிப்பட்ட உறுப்பினர்கள் காட்டப்பட மாட்டார்கள்

source: #6327: apidoc: Support a python package consisted of __init__.so file
ta: #6327: apidoc: __init__.so கோப்பைக் கொண்ட பைதான் தொகுப்பை ஆதரிக்கவும்

source: #6999: napoleon: fails to parse tilde in :exc: role
ta: #6999: நெப்போலியன்: எக்செல்: பாத்திரத்தில் டில்டேவை அலசுவதில் தோல்வியடைந்தார்

source: #7019: gettext: Absolute path used in message catalogs
ta: #7019: gettext: செய்தி பட்டியல்களில் பயன்படுத்தப்படும் முழுமையான பாதை

source: #7023: autodoc: nested partial functions are not listed
ta: #7023: autodoc: உள்ளமை பகுதி செயல்பாடுகள் பட்டியலிடப்படவில்லை

source: #7023: autodoc: partial functions imported from other modules are listed as module members without :impoprted-members: option
ta: #7023: autodoc: மற்ற தொகுதிக்கூறுகளிலிருந்து இறக்குமதி செய்யப்படும் பகுதி செயல்பாடுகள் :immpoprted-members: விருப்பம் இல்லாமல் தொகுதி உறுப்பினர்களாக பட்டியலிடப்பட்டுள்ளன.

source: #6889: autodoc: Trailing comma in ``:members::`` option causes cryptic warning
ta: #6889: autodoc: ``:members::`` விருப்பத்தில் காற்புள்ளியைப் பின்தொடர்வது ரகசிய எச்சரிக்கையை ஏற்படுத்துகிறது

source: #6568: autosummary: ``autosummary_imported_members`` is ignored on generating a stub file for submodule
ta: #6568: தன்னியக்க சுருக்கம்: துணைத் தொகுதிக்கான ச்டப் கோப்பை உருவாக்கும் போது ``தானியங்கி_இறக்குமதி செய்யப்பட்ட_உறுப்பினர்கள்`` புறக்கணிக்கப்படுகிறது

source: #7055: linkcheck: redirect is treated as an error
ta: #7055: linkcheck: redirect ஆனது பிழையாகக் கருதப்படுகிறது

source: #7088: HTML template: If ``navigation_with_keys`` option is activated, modifier keys are ignored, which means the feature can interfere with browser features
ta: #7088: உஉகுமொ டெம்ப்ளேட்: ``நேவிகேசன்_வித்_கீச்`` விருப்பம் செயல்படுத்தப்பட்டால், மாற்றி விசைகள் புறக்கணிக்கப்படும், அதாவது உலாவி அம்சங்களில் நற்பொருத்தம் குறுக்கிடலாம்

source: #7090: std domain: Can't assign numfig-numbers for custom container nodes
ta: #7090: std டொமைன்: தனிப்பயன் கொள்கலன் முனைகளுக்கு numfig-எண்களை ஒதுக்க முடியாது

source: #7106: std domain: enumerated nodes are marked as duplicated when extensions call ``note_explicit_target()``
ta: #7106: std டொமைன்: நீட்டிப்புகள் ``குறிப்பு வெளிப்படையான இலக்கு()`` என அழைக்கும் போது எண்ணிடப்பட்ட முனைகள் நகல் எனக் குறிக்கப்படும்.

source: #7095: dirhtml: Cross references are broken via intersphinx and ``:doc:`` role
ta: #7095: dirhtml: குறுக்கு குறிப்புகள் intersphinx மற்றும் ``:doc:`` பாத்திரம் வழியாக உடைக்கப்படுகின்றன

source: C++:
ta: சி ++:

source: Don't crash when using the ``struct`` role in some cases.
ta: சில சந்தர்ப்பங்களில் `` struct`` பாத்திரத்தைப் பயன்படுத்தும் போது செயலிழக்க வேண்டாம்.

source: Don't warn when using the ``var``/``member`` role for function parameters.
ta: செயல்பாட்டு அளவுருக்களுக்கு `` var``/`` உறுப்பினர்` `பாத்திரத்தைப் பயன்படுத்தும் போது எச்சரிக்க வேண்டாம்.

source: Render call and braced-init expressions correctly.
ta: அழைப்பு மற்றும் பிரேஸ்-சில வெளிப்பாடுகளை சரியாக வழங்கவும்.

source: #7097: Filenames of images generated by ``sphinx.transforms.post_transforms.images.ImageConverter`` or its subclasses (used for latex build) are now sanitized, to prevent broken paths
ta: #7097: உடைந்த பாதைகளைத் தடுக்க ``sphinx.transforms.post_transforms.images.ImageConverter`` அல்லது அதன் துணைப்பிரிவுகள் (லேடெக்ச் உருவாக்கப் பயன்படுகிறது) மூலம் உருவாக்கப்பட்ட படங்களின் கோப்புப்பெயர்கள் இப்போது சுத்தப்படுத்தப்படுகின்றன.
