Repository: 247i/TACETr
Catalog: உரை/தானி/spoolman-web-client-*.po
Languages: ta

# help.resources.filament
source: Brands of filament. They have properties such as name, material, color, diameter, and more.
ta: இழைகளின் பிராண்டுகள். அவற்றில் பெயர், பொருள், நிறம், விட்டம் மற்றும் பல போன்ற பண்புகள் உள்ளன.

# help.resources.spool
source: Individual physical spools of a specific filament.
ta: ஒரு குறிப்பிட்ட இழைகளின் தனிப்பட்ட உடல் ச்பூல்கள்.

# help.resources.vendor
source: The companies that make the filament.
ta: இழை செய்யும் நிறுவனங்கள்.

# help.description
source: <title>Help</title><p>Here are some tips to get you started.</p><p>Spoolman holds 3 different types of data:</p><itemsHelp/><p>To add a new spool to the database, start by creating a <filamentCreateLink>Filament</filamentCreateLink> object. Once that's done, proceed to create a <spoolCreateLink>Spool</spoolCreateLink> object for that specific spool. If you acquire additional spools of the same filament later on, simply generate additional Spool objects and reuse the same Filament object.</p><p>Optionally, you can also generate a <vendorCreateLink>Manufacturer</vendorCreateLink> object for the company manufacturing the filament if you wish to track that information.</p><p>You have the option to link other 3D printer services to Spoolman, like Moonraker, which can automatically monitor filament usage and update the Spool objects for you. Refer to the <readmeLink>Spoolman README</readmeLink> for guidance on how to set that up.</p>
ta: <title> உதவி </title> <p> நீங்கள் தொடங்குவதற்கான சில குறிப்புகள் இங்கே. </p> <p> ச்பூல்மேன் 3 வெவ்வேறு வகையான தரவுகளை வைத்திருக்கிறார்: </p> <itemshelp/> <p> தரவுத்தளத்தில் ஒரு புதிய ச்பூலைச் சேர்க்க, <filemamentcreatelink> Filemation </filemationcreatelink> பொருளை உருவாக்குவதன் மூலம் தொடங்கவும். அது முடிந்ததும், அந்த குறிப்பிட்ட ச்பூலுக்கான </spoolcreatelink> ச்பூல் </spoolcreatelink> பொருளை உருவாக்க தொடரவும். அதே இழைகளின் கூடுதல் ச்பூல்களைப் பின்னர் நீங்கள் பெற்றால், கூடுதல் ச்பூல் பொருள்களை உருவாக்கி அதே இழை பொருளை மீண்டும் பயன்படுத்தினால். இழை பயன்பாட்டை தானாக கண்காணித்து, உங்களுக்கான ச்பூல் பொருள்களைப் புதுப்பிக்கவும். அதை எவ்வாறு அமைப்பது என்பதற்கான வழிகாட்டுதலுக்கு </p> குறித்த வழிகாட்டுதலுக்கு <ரீட்மெலிங்க்> ச்பூல்மேன் ரீட்மே </readmelink> ஐப் பார்க்கவும். </P>

# table.actions
source: Actions
ta: செயல்கள்

# settings.settings
source: Settings
ta: அமைப்புகள்

# settings.header
source: Settings
ta: அமைப்புகள்

# settings.general.tab
source: General
ta: பொது

# settings.general.currency.label
source: Currency
ta: நாணயம்

# settings.general.base_url.label
source: Base URL
ta: அடிப்படை முகவரி

# settings.general.base_url.tooltip
source: The base URL to use when generating features such as QR codes.
ta: QR குறியீடுகள் போன்ற அம்சங்களை உருவாக்கும்போது பயன்படுத்த வேண்டிய அடிப்படை முகவரி.

# settings.general.round_prices.label
source: Round prices
ta: சுற்று விலைகள்

# settings.general.round_prices.tooltip
source: Round prices to the nearest whole number.
ta: அருகிலுள்ள முழு எண்ணுக்கு வட்ட விலைகள்.

# settings.extra_fields.tab
source: Extra Fields
ta: கூடுதல் புலங்கள்

# settings.extra_fields.description
source: <p>Here you can add extra custom fields to your entities.</p><p>Once a field is added, you can not change its key or type, and for choice type fields you can not remove choices or change the multi choice state. If you remove a field, the associated data for all entities will be deleted.</p><p>The key is what other programs read/write the data as, so if your custom field is supposed to integrate with a third-party program, make sure to set it correctly. Default value is only applied to new items.</p><p>Extra fields can not be sorted or filtered in the table views.</p>
ta: <p> இங்கே நீங்கள் உங்கள் நிறுவனங்களுக்கு கூடுதல் தனிப்பயன் புலங்களைச் சேர்க்கலாம். நீங்கள் ஒரு புலத்தை அகற்றினால், அனைத்து நிறுவனங்களுக்கும் தொடர்புடைய தரவு நீக்கப்படும். </P> <p> மற்ற நிரல்கள் தரவைப் படிக்கிறோம்/எழுதுகின்றன என்பதுதான் முக்கியமானது, எனவே உங்கள் தனிப்பயன் புலம் மூன்றாம் தரப்பு நிரலுடன் ஒருங்கிணைக்க வேண்டுமானால், அதை சரியாக அமைக்க உறுதிசெய்க. இயல்புநிலை மதிப்பு புதிய உருப்படிகளுக்கு மட்டுமே பயன்படுத்தப்படுகிறது. </P> <p> கூடுதல் புலங்களை அட்டவணை காட்சிகளில் வரிசைப்படுத்தவோ வடிகட்டவோ முடியாது. </P>

# settings.extra_fields.params.key
source: Key
ta: விசை

# settings.extra_fields.params.name
source: Name
ta: பெயர்

# settings.extra_fields.params.field_type
source: Type
ta: வகை

# settings.extra_fields.params.unit
source: Unit
ta: அலகு

# settings.extra_fields.params.order
source: Order
ta: ஒழுங்கு

# settings.extra_fields.params.default_value
source: Default Value
ta: இயல்புநிலை மதிப்பு

# settings.extra_fields.params.choices
source: Choices
ta: தேர்வுகள்

# settings.extra_fields.params.multi_choice
source: Multi Choice
ta: பல தேர்வு

# settings.extra_fields.field_type.text
source: Text
ta: உரை

# settings.extra_fields.field_type.integer
source: Integer
ta: முழு எண்

# settings.extra_fields.field_type.integer_range
source: Integer Range
ta: முழு எண் வரம்பு

# settings.extra_fields.field_type.float
source: Float
ta: மிதவை

# settings.extra_fields.field_type.float_range
source: Float Range
ta: மிதவை வரம்பு

# settings.extra_fields.field_type.datetime
source: Datetime
ta: தேதிநேரம்

# settings.extra_fields.field_type.boolean
source: Boolean
ta: பூலியன்

# settings.extra_fields.field_type.choice
source: Choice
ta: தேர்வு

# settings.extra_fields.boolean_true
source: Yes
ta: ஆம்

# settings.extra_fields.boolean_false
source: No
ta: இல்லை

# settings.extra_fields.choices_missing_error
source: You cannot remove choices. The following choices are missing: {{choices}}
ta: நீங்கள் தேர்வுகளை அகற்ற முடியாது. பின்வரும் தேர்வுகள் காணவில்லை: {{choices}}

# settings.extra_fields.non_unique_key_error
source: The key must be unique.
ta: முக்கியமானது தனித்துவமாக இருக்க வேண்டும்.

# settings.extra_fields.key_not_changed
source: Please change the key to something else.
ta: தயவுசெய்து விசையை வேறு ஏதாவது மாற்றவும்.

# settings.extra_fields.delete_confirm
source: Delete field {{name}}?
ta: புலம் {{name}} ஐ நீக்கு?

# settings.extra_fields.delete_confirm_description
source: This will delete the field and all associated data for all entities.
ta: இது அனைத்து நிறுவனங்களுக்கும் புலம் மற்றும் தொடர்புடைய அனைத்து தரவையும் நீக்கிவிடும்.

# documentTitle.default
source: Spoolman
ta: ச்பூல்மேன்

# documentTitle.suffix
source: | Spoolman
ta: | ச்பூல்மேன்

# documentTitle.home.list
source: Home | Spoolman
ta: முகப்பு | ச்பூல்மேன்

# documentTitle.help.list
source: Help | Spoolman
ta: உதவி | ச்பூல்மேன்

# documentTitle.locations.list
source: Locations | Spoolman
ta: இடங்கள் | ச்பூல்மேன்

# documentTitle.filament.list
source: Filaments | Spoolman
ta: இழைகள் | ச்பூல்மேன்

# documentTitle.filament.show
source: #{{id}} Show Filament | Spoolman
ta: #{{id}} ஃபிலிமென்ட் காட்டு | ச்பூல்மேன்

# documentTitle.filament.edit
source: #{{id}} Edit Filament | Spoolman
ta: #{{id}} Filuctient தாள் | ச்பூல்மேன்

# documentTitle.filament.create
source: Create Filament | Spoolman
ta: இழை உருவாக்கு | ச்பூல்மேன்

# documentTitle.filament.clone
source: #{{id}} Clone Filament | Spoolman
ta: #{{id}} நகலி இழை | ச்பூல்மேன்

# documentTitle.spool.list
source: Spools | Spoolman
ta: ச்பூல்கள் | ச்பூல்மேன்

# documentTitle.spool.show
source: #{{id}} Show Spool | Spoolman
ta: #{{id}} காட்டு ச்பூல் | ச்பூல்மேன்

# documentTitle.spool.edit
source: #{{id}} Edit Spool | Spoolman
ta: #{{id}} திருத்து ச்பூல் | ச்பூல்மேன்

# documentTitle.spool.create
source: Create Spool | Spoolman
ta: ச்பூலை உருவாக்கு | ச்பூல்மேன்

# documentTitle.spool.clone
source: #{{id}} Clone Spool | Spoolman
ta: #{{id}} நகலி ச்பூல் | ச்பூல்மேன்

# documentTitle.vendor.list
source: Manufacturers | Spoolman
ta: உற்பத்தியாளர்கள் | ச்பூல்மேன்

# documentTitle.vendor.show
source: #{{id}} Show Manufacturer | Spoolman
ta: #{{id}} உற்பத்தியாளரைக் காட்டு | ச்பூல்மேன்

# documentTitle.vendor.edit
source: #{{id}} Edit Manufacturer | Spoolman
ta: #{{id}} உற்பத்தியாளரைத் திருத்து | ச்பூல்மேன்

# documentTitle.vendor.create
source: Create Manufacturer | Spoolman
ta: உற்பத்தியாளரை உருவாக்கு | ச்பூல்மேன்

# documentTitle.vendor.clone
source: #{{id}} Clone Manufacturer | Spoolman
ta: #{{id}} நகலி உற்பத்தியாளர் | ச்பூல்மேன்

# locations.locations
source: Locations
ta: இருப்பிடங்கள்

# locations.new_location
source: New Location
ta: புதிய இடம்

# locations.no_location
source: No Location
ta: இடம் இல்லை

# locations.no_locations_help
source: This page lets you organize your spools in locations, add some spools to get started!
ta: இந்த பக்கம் உங்கள் ச்பூல்களை இருப்பிடங்களில் ஒழுங்கமைக்க அனுமதிக்கிறது, தொடங்குவதற்கு சில ச்பூல்களைச் சேர்க்கவும்!
