Repository: 247i/TACETr
Catalog: உரை/தானி/spoolman-web-client-*.po
Languages: ta

# actions.list
source: List
ta: பட்டியல்

# actions.create
source: Create
ta: உருவாக்கு

# actions.edit
source: Edit
ta: தொகு

# actions.show
source: Show
ta: காட்டு

# actions.clone
source: Clone
ta: நகலி

# buttons.create
source: Create
ta: உருவாக்கு

# buttons.save
source: Save
ta: சேமி

# buttons.saveAndAdd
source: Save and Add
ta: சேமித்து சேர்க்கவும்

# buttons.logout
source: Log out
ta: விடுபதிகை

# buttons.delete
source: Delete
ta: நீக்கு

# buttons.edit
source: Edit
ta: தொகு

# buttons.cancel
source: Cancel
ta: ரத்துசெய்

# buttons.confirm
source: Are you sure?
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா?

# buttons.continue
source: Continue
ta: தொடரவும்

# buttons.filter
source: Filter
ta: வடிப்பி

# buttons.clear
source: Clear
ta: தெளிவான

# buttons.refresh
source: Refresh
ta: புதுப்பிப்பு

# buttons.show
source: Show
ta: காட்டு

# buttons.undo
source: Undo
ta: செயல்தவிர்

# buttons.import
source: Import
ta: இறக்குமதி

# buttons.clone
source: Clone
ta: நகலி

# buttons.archive
source: Archive
ta: காப்பகம்

# buttons.unArchive
source: Unarchive
ta: அன்கான்

# buttons.hideArchived
source: Hide Archived
ta: காப்பகப்படுத்தப்பட்டதை மறைக்கவும்

# buttons.showArchived
source: Show Archived
ta: காப்பகப்படுத்தப்பட்டதைக் காட்டு

# buttons.notAccessTitle
source: You don't have permission to access
ta: அணுக உங்களுக்கு இசைவு இல்லை

# buttons.hideColumns
source: Hide Columns
ta: நெடுவரிசைகளை மறைக்கவும்

# buttons.clearFilters
source: Clear Filters
ta: தெளிவான வடிப்பான்கள்

# warnWhenUnsavedChanges
source: Are you sure you want to leave? You have unsaved changes.
ta: நீங்கள் நிச்சயமாக வெளியேற விரும்புகிறீர்களா? நீங்கள் சேமிக்கப்படாத மாற்றங்கள் உள்ளன.

# notifications.success
source: Successful
ta: செய்

# notifications.error
source: Error (status code: {{statusCode}})
ta: பிழை (நிலை குறியீடு: {{statusCode}})

# notifications.undoable
source: You have {{seconds}} seconds to undo.
ta: நீங்கள் செயல்தவிர்க்க {{seconds}} வினாடிகள் உள்ளன.

# notifications.createSuccess
source: Successfully created {{resource}}
ta: வெற்றிகரமாக உருவாக்கப்பட்டது {{resource}}

# notifications.createError
source: There was an error creating {{resource}} (status code: {{statusCode}})
ta: {{resource}} (நிலைக் குறியீடு: {{statusCode}}) உருவாக்கும் பிழை இருந்தது

# notifications.deleteSuccess
source: Successfully deleted {{resource}}
ta: வெற்றிகரமாக நீக்கப்பட்டது {{resource}}

# notifications.deleteError
source: Error when deleting {{resource}} (status code: {{statusCode}})
ta: {{resource}} நீக்கும்போது பிழை (நிலைக் குறியீடு: {{statusCode}})

# notifications.editSuccess
source: Successfully edited {{resource}}
ta: வெற்றிகரமாக திருத்தப்பட்டது {{resource}}

# notifications.editError
source: Error when editing {{resource}} (status code: {{statusCode}})
ta: {{resource}} திருத்தும்போது பிழை (நிலை குறியீடு: {{statusCode}})

# notifications.importProgress
source: Importing: {{processed}}/{{total}}
ta: இறக்குமதி: {{processed}}/{{total}}}

# notifications.saveSuccessful
source: Save successful!
ta: வெற்றிகரமாக சேமிக்கவும்!

# notifications.validationError
source: Validation error: {{error}}
ta: சரிபார்ப்பு பிழை: {{error}}

# kofi
source: Tip me on Ko-fi
ta: உதவிக்குறிப்பு மற்றும் ஆன்-ஃபை

source: Loading
ta: ஏற்றுகிறது

source: Version
ta: பதிப்பு

source: Unknown
ta: தெரியவில்லை

source: Yes
ta: ஆம்

source: No
ta: இல்லை

# tags.clone
source: Clone
ta: நகலி

# dashboard.title
source: Dashboard
ta: முகப்புப்பெட்டி

# printing.generic.title
source: Printing
ta: அச்சிடுதல்

# printing.generic.description
source: Tune in the settings below to get the desired print layout. Keep in mind that printers and your OS may apply it's own margins and scaling, so you may need to perform some trial-and-error before it's all correct. Test it on a piece of regular paper before printing on the actual labels.
ta: விரும்பிய அச்சு தளவமைப்பைப் பெற கீழேயுள்ள அமைப்புகளில் டியூன் செய்யுங்கள். அச்சுப்பொறிகளும் உங்கள் ஓஎச்வும் அதன் சொந்த ஓரங்கள் மற்றும் அளவிடுதலைப் பயன்படுத்தலாம் என்பதை நினைவில் கொள்ளுங்கள், எனவே இவை அனைத்தும் சரியானதாக இருப்பதற்கு முன்பு நீங்கள் சில சோதனை மற்றும் பிழை செய்ய வேண்டியிருக்கும். உண்மையான லேபிள்களில் அச்சிடுவதற்கு முன் வழக்கமான காகிதத்தில் அதை சோதிக்கவும்.

# printing.generic.helpMargin
source: Margins should be configured to match your label paper and printer, changing these will affect the size of the entire grid.
ta: உங்கள் சிட்டை காகிதம் மற்றும் அச்சுப்பொறியுடன் பொருந்தக்கூடிய வகையில் விளிம்புகள் கட்டமைக்கப்பட வேண்டும், இவற்றை மாற்றுவது முழு கட்டத்தின் அளவையும் பாதிக்கும்.

# printing.generic.helpPrinterMargin
source: Safe-Zone should be set to how close to the paper edge your printer can print, changing these will not affect the entire grid.
ta: உங்கள் அச்சுப்பொறி எவ்வளவு நெருக்கமாக அச்சிட முடியும் என்பதற்கு பாதுகாப்பான-மண்டலத்தை அமைக்க வேண்டும், இவற்றை மாற்றுவது முழு கட்டத்தையும் பாதிக்காது.

# printing.generic.print
source: Print
ta: அச்சிடுக

# printing.generic.columns
source: Columns
ta: நெடுவரிசைகள்

# printing.generic.rows
source: Rows
ta: வரிசைகள்

# printing.generic.paperSize
source: Paper Size
ta: காகித அளவு

# printing.generic.customSize
source: Custom
ta: தனிப்பயன்

# printing.generic.dimensions
source: Dimensions
ta: பரிமாணங்கள்

# printing.generic.showBorder
source: Show Border
ta: எல்லையைக் காட்டு

# printing.generic.previewScale
source: Preview Scale
ta: முன்னோட்டம் அளவு

# printing.generic.skipItems
source: Skip Items
ta: உருப்படிகளைத் தவிர்க்கவும்

# printing.generic.itemCopies
source: Item Copies
ta: உருப்படி நகல்கள்

# printing.generic.contentSettings
source: Content Settings
ta: உள்ளடக்க அமைப்புகள்

# printing.generic.layoutSettings
source: Layout Settings
ta: தளவமைப்பு அமைப்புகள்

# printing.generic.horizontalSpacing
source: Horizontal Spacing
ta: கிடைமட்ட இடைவெளி

# printing.generic.verticalSpacing
source: Vertical Spacing
ta: செங்குத்து இடைவெளி

# printing.generic.marginLeft
source: Left Margin
ta: இடது விளிம்பு

# printing.generic.marginRight
source: Right Margin
ta: வலது விளிம்பு

# printing.generic.marginTop
source: Top Margin
ta: மேல் விளிம்பு

# printing.generic.marginBottom
source: Bottom Margin
ta: கீழ் விளிம்பு

# printing.generic.printerMarginLeft
source: Safe-Zone Left
ta: பாதுகாப்பான மண்டலம் இடது

# printing.generic.printerMarginRight
source: Safe-Zone Right
ta: பாதுகாப்பான-மண்டல உரிமை

# printing.generic.printerMarginTop
source: Safe-Zone Top
ta: பாதுகாப்பான-மண்டல மேல்

# printing.generic.printerMarginBottom
source: Safe-Zone Bottom
ta: பாதுகாப்பான-மண்டல கீழே

# printing.generic.borders.none
source: None
ta: எதுவுமில்லை

# printing.generic.borders.border
source: Border
ta: எல்லை

# printing.generic.borders.grid
source: Grid
ta: வலைவாய்

# printing.generic.settings
source: Presets
ta: முன்னமைவுகள்

# printing.generic.defaultSettings
source: Default
ta: இயல்புநிலை

# printing.generic.addSettings
source: Add New Preset
ta: புதிய முன்னமைவைச் சேர்க்கவும்

# printing.generic.newSetting
source: New
ta: புதிய

# printing.generic.duplicateSettings
source: Duplicate
ta: நகல்

# printing.generic.deleteSettings
source: Delete Current Preset
ta: தற்போதைய முன்னமைவை நீக்கு

# printing.generic.deleteSettingsConfirm
source: Are you sure you want to delete this preset?
ta: இந்த முன்னமைவை நீக்க விரும்புகிறீர்களா?

# printing.generic.settingsName
source: Preset Name
ta: முன்னமைக்கப்பட்ட பெயர்

# printing.generic.saveSetting
source: Save Presets
ta: முன்னமைவுகளை சேமிக்கவும்

# printing.generic.saveAsImage
source: Save as Image
ta: படமாக சேமிக்கவும்

# printing.qrcode.button
source: Print Labels
ta: லேபிள்களை அச்சிடுக

# printing.qrcode.title
source: Label Printing
ta: சிட்டை அச்சிடுதல்

# printing.qrcode.template
source: Label Template
ta: சிட்டை வார்ப்புரு

# printing.qrcode.templateHelp
source: Use {} to insert values of the spool object as text. For example, {id} will be replaced with the spool id, or {filament.material} will be replaced with the material of the spool. if a value is missing it will be replaced with "?". A second set of {} can be used to remove this. In addition, any text between the sets of {} will be removed if the value is missing. For example, {Lot Nr: {lot_nr}} will only show the label if the spool has a lot number. Enclose text with double asterix ** to make it bold. Click the button to view a list of all available tags.
ta: ச்பூல் பொருளின் மதிப்புகளை உரையாக செருக {} ஐப் பயன்படுத்தவும். எடுத்துக்காட்டாக, {id} ச்பூல் ஐடியுடன் மாற்றப்படும், அல்லது {filament.material} ச்பூலின் பொருள் மூலம் மாற்றப்படும். ஒரு மதிப்பு காணவில்லை என்றால் அது "?" இதை அகற்ற {of இன் இரண்டாவது தொகுப்பு பயன்படுத்தப்படலாம். கூடுதலாக, மதிப்பு காணவில்லை எனில் {of இன் தொகுப்புகளுக்கு இடையில் எந்த உரையும் அகற்றப்படும். எடுத்துக்காட்டாக, {lot nr: {lot_nr} எச்பி ச்பூலில் நிறைய எண் இருந்தால் மட்டுமே லேபிளைக் காண்பிக்கும். தைரியமாக மாற்ற இரட்டை ஆச்டெரிக்ச் ** உடன் உரையை இணைக்கவும். கிடைக்கக்கூடிய அனைத்து குறிச்சொற்களின் பட்டியலையும் காண பொத்தானைக் சொடுக்கு செய்க.

# printing.qrcode.textSize
source: Label Text Size
ta: உரை அளவு சிட்டை

# printing.qrcode.showContent
source: Print Label
ta: சிட்டை அச்சு

# printing.qrcode.useHTTPUrl.label
source: QR code link
ta: QR குறியீடு இணைப்பு

# printing.qrcode.useHTTPUrl.tooltip
source: Will use proprietary link that will work only if scanned from Spoolman's scanning feature (default). URL uses either the base URL specified in settings, or the current page URL if not set.
ta: ச்பூல்மேனின் ச்கேனிங் அம்சத்திலிருந்து (இயல்புநிலை) ச்கேன் செய்யப்பட்டால் மட்டுமே செயல்படும் தனியுரிம இணைப்பைப் பயன்படுத்தும். அமைப்புகளில் குறிப்பிடப்பட்டுள்ள அடிப்படை முகவரி அல்லது தற்போதைய பக்க முகவரி ஐ அமைக்கவில்லை என்றால் முகவரி பயன்படுத்துகிறது.

# printing.qrcode.useHTTPUrl.options.default
source: Default
ta: இயல்புநிலை

# printing.qrcode.useHTTPUrl.options.url
source: URL
ta: முகவரி

# printing.qrcode.useHTTPUrl.preview
source: Preview:
ta: முன்னோட்டம்:

# printing.qrcode.showQRCode
source: Print QR Code
ta: QR குறியீட்டை அச்சிடுக

# printing.qrcode.showQRCodeMode.no
source: No
ta: இல்லை

# printing.qrcode.showQRCodeMode.simple
source: Simple
ta: எளிய

# printing.qrcode.showQRCodeMode.withIcon
source: With Icon
ta: ஐகானுடன்

# printing.spoolSelect.title
source: Select Spools
ta: ச்பூல்களைத் தேர்ந்தெடுக்கவும்

# printing.spoolSelect.description
source: Select spools to print labels for.
ta: லேபிள்களை அச்சிட ச்பூல்களைத் தேர்ந்தெடுக்கவும்.

# printing.spoolSelect.showArchived
source: Show Archived
ta: காப்பகப்படுத்தப்பட்டதைக் காட்டு

# printing.spoolSelect.noSpoolsSelected
source: You have not selected any spools.
ta: நீங்கள் எந்த ச்பூல்களையும் தேர்வு செய்யவில்லை.

# printing.spoolSelect.selectAll
source: Select/Unselect All
ta: அனைத்தையும் தேர்ந்தெடு/தேர்வுநீக்கு

# printing.spoolSelect.selectedTotal
source: {{count}} spool selected
ta: {{count}} ச்பூல் தேர்ந்தெடுக்கப்பட்டது

# scanner.title
source: QR Code Scanner
ta: QR குறியீடு ச்கேனர்

# scanner.description
source: Scan a Spoolman QR code to view details about the spool.
ta: ச்பூல் பற்றிய விவரங்களைக் காண ஒரு ச்பூல்மேன் கியூஆர் குறியீட்டை ச்கேன் செய்யுங்கள்.

# scanner.error.notAllowed
source: You have not allowed access to the camera.
ta: கேமராவை அணுக நீங்கள் அனுமதிக்கவில்லை.

# scanner.error.insecureContext
source: The page is not served over HTTPS.
ta: பக்கம் HTTPS க்கு மேல் வழங்கப்படவில்லை.

# scanner.error.streamApiNotSupported
source: The browser does not support the MediaStream API.
ta: உலாவி மீடியாச்ட்ரீம் பநிஇ ஆதரிக்காது.

# scanner.error.notReadable
source: The camera is not readable.
ta: கேமரா படிக்க முடியாது.

# scanner.error.notFound
source: No camera was found.
ta: கேமரா எதுவும் கண்டுபிடிக்கப்படவில்லை.

# scanner.error.unknown
source: An unknown error occurred. ({{error}})
ta: அறியப்படாத பிழை ஏற்பட்டது. ({{error}})

# spool.spool
source: Spools
ta: ச்பூல்கள்

# spool.fields.id
source: ID
ta: ஐடி

# spool.fields.filament_name
source: Filament
ta: தாள்

# spool.fields.filament
source: Filament
ta: தாள்

# spool.fields.filament_internal
source: Internal
ta: உள்

# spool.fields.filament_external
source: External
ta: வெளிப்புறம்

# spool.fields.price
source: Price
ta: விலை

# spool.fields.material
source: Material
ta: பொருள்

# spool.fields.weight_to_use
source: Weight
ta: எடை

# spool.fields.used_weight
source: Used Weight
ta: பயன்படுத்தப்பட்ட எடை

# spool.fields.remaining_weight
source: Remaining Weight
ta: மீதமுள்ள எடை

# spool.fields.measured_weight
source: Measured Weight
ta: அளவிடப்பட்ட எடை

# spool.fields.used_length
source: Used Length
ta: பயன்படுத்தப்பட்ட நீளம்

# spool.fields.remaining_length
source: Remaining Length
ta: மீதமுள்ள நீளம்

# spool.fields.initial_weight
source: Initial Weight
ta: தொடக்க எடை

# spool.fields.spool_weight
source: Empty Weight
ta: வெற்று எடை

# spool.fields.location
source: Location
ta: இடம்

# spool.fields.lot_nr
source: Lot Nr
ta: நிறைய இல்லை

# spool.fields.first_used
source: First Used
ta: முதலில் பயன்படுத்தப்பட்டது

# spool.fields.last_used
source: Last Used
ta: கடைசியாக பயன்படுத்தப்பட்டது

# spool.fields.registered
source: Registered
ta: பதிவுசெய்யப்பட்டது

# spool.fields.comment
source: Comment
ta: கருத்து

# spool.fields.archived
source: Archived
ta: காப்பகப்படுத்தப்பட்டது

# spool.fields_help.price
source: Price of a full spool. If not set, the price of the filament will be assumed instead.
ta: ஒரு முழு ச்பூலின் விலை. அமைக்கப்படாவிட்டால், அதற்கு பதிலாக இழைகளின் விலை ஏற்றுக்கொள்ளப்படும்.

# spool.fields_help.weight_to_use
source: Select what weight value to enter. Measured weight is only available if the spool weight is set for the selected filament.
ta: என்ன எடை மதிப்பை உள்ளிட வேண்டும் என்பதைத் தேர்ந்தெடுக்கவும். தேர்ந்தெடுக்கப்பட்ட இழைக்கு ச்பூல் எடை அமைக்கப்பட்டால் மட்டுமே அளவிடப்பட்ட எடை கிடைக்கும்.

# spool.fields_help.used_weight
source: How much filament has been used from the spool. A new spool should have 0g used.
ta: ச்பூலில் இருந்து எவ்வளவு இழை பயன்படுத்தப்பட்டுள்ளது. ஒரு புதிய ச்பூல் 0 ஐயா பயன்படுத்தப்பட வேண்டும்.

# spool.fields_help.remaining_weight
source: How much filament is left on the spool. For a new spool this should match the spool weight.
ta: ச்பூலில் எவ்வளவு இழை விடப்பட்டுள்ளது. ஒரு புதிய ச்பூலுக்கு இது ச்பூல் எடையுடன் பொருந்த வேண்டும்.

# spool.fields_help.measured_weight
source: How much the filament and spool weigh.
ta: இழை மற்றும் ச்பூல் எவ்வளவு எடை கொண்டது.

# spool.fields_help.initial_weight
source: The initial weight of filament on the spool (net weight). Will use the weight from the filament object if not set.
ta: ச்பூலில் (நிகர எடை) இழைகளின் ஆரம்ப எடை. அமைக்காவிட்டால் இழை பொருளிலிருந்து எடையைப் பயன்படுத்தும்.

# spool.fields_help.spool_weight
source: The weight of the spool when it is empty. Leave empty to use the value from the filament or the manufacturer.
ta: ச்பூலின் காலியாக இருக்கும்போது அது எடை. இழை அல்லது உற்பத்தியாளரிடமிருந்து மதிப்பைப் பயன்படுத்த காலியாக விடவும்.

# spool.fields_help.location
source: Where the spool is located if you have multiple locations where you store your spools.
ta: உங்கள் ச்பூல்களை சேமிக்கும் பல இடங்கள் இருந்தால் ச்பூல் அமைந்துள்ள இடத்தில்.

# spool.fields_help.lot_nr
source: Manufacturer's lot number. Can be used to ensure a print has consistent color if multiple spools are used.
ta: உற்பத்தியாளரின் நிறைய எண். பல ச்பூல்கள் பயன்படுத்தப்பட்டால் அச்சுக்கு நிலையான வண்ணம் இருப்பதை உறுதிப்படுத்த பயன்படுத்தலாம்.

# spool.fields_help.external_filament
source: You have selected a filament from the external database. A filament object (and possibly a manufacturer object) will be created automatically when you create this spool. This can create duplicate filament objects if you have already created a filament object for this filament.
ta: வெளிப்புற தரவுத்தளத்திலிருந்து ஒரு இழை தேர்வு செய்துள்ளீர்கள். இந்த ச்பூலை நீங்கள் உருவாக்கும்போது ஒரு இழை பொருள் (மற்றும் ஒரு உற்பத்தியாளர் பொருள்) தானாக உருவாக்கப்படும். இந்த இழைக்கு நீங்கள் ஏற்கனவே ஒரு இழை பொருளை உருவாக்கியிருந்தால் இது நகல் இழை பொருள்களை உருவாக்க முடியும்.

# spool.titles.create
source: Create Spool
ta: ச்பூலை உருவாக்கவும்

# spool.titles.clone
source: Clone Spool
ta: நகலி ச்பூல்

# spool.titles.edit
source: Edit Spool
ta: திருத்து ச்பூல்

# spool.titles.list
source: Spools
ta: ச்பூல்கள்

# spool.titles.show
source: Show Spool
ta: ச்பூல் காட்டு

# spool.titles.show_title
source: [Spool #{{id}}] {{name}}
ta: [ச்பூல் #{{id}}] {{name}}

# spool.titles.archive
source: Archive Spool
ta: காப்பக ச்பூல்

# spool.titles.adjust
source: Adjust Spool Filament
ta: ச்பூல் இழை சரிசெய்யவும்

# spool.form.measurement_type.length
source: Length
ta: நீளம்

# spool.form.measurement_type.weight
source: Weight
ta: எடை

# spool.form.measurement_type_label
source: Measurement Type
ta: அளவீட்டு வகை

# spool.form.adjust_filament_help
source: Here you can directly add or subtract filament from the spool. A positive value will consume filament, a negative value will add it.
ta: இங்கே நீங்கள் நேரடியாக ச்பூலில் இருந்து இழைகளைச் சேர்க்கலாம் அல்லது கழிக்கலாம். நேர்மறையான மதிப்பு இழையை நுகரும், எதிர்மறை மதிப்பு அதைச் சேர்க்கும்.

# spool.form.adjust_filament_value
source: Consume Amount
ta: தொகையை உட்கொள்ளுங்கள்

# spool.form.new_location_prompt
source: Enter a new location
ta: புதிய இடத்தை உள்ளிடவும்

# spool.form.spool_updated
source: This spool has been updated by someone/something else since you opened this page. Saving will overwrite those changes!
ta: இந்த பக்கத்தைத் திறந்ததிலிருந்து இந்த ச்பூல் யாரோ/வேறு ஏதாவது புதுப்பிக்கப்பட்டுள்ளது. சேமிப்பது அந்த மாற்றங்களை மேலெழுதும்!

# spool.messages.archive
source: Are you sure you want to archive this spool?
ta: இந்த ச்பூலை காப்பகப்படுத்த விரும்புகிறீர்களா?

# spool.formats.last_used
source: Last used {{date}}
ta: கடைசியாக பயன்படுத்தப்பட்ட {{date}}

# filament.filament
source: Filaments
ta: இழைகள்

# filament.fields.id
source: ID
ta: ஐடி

# filament.fields.vendor_name
source: Manufacturer
ta: உற்பத்தியாளர்

# filament.fields.vendor
source: Manufacturer
ta: உற்பத்தியாளர்

# filament.fields.name
source: Name
ta: பெயர்

# filament.fields.material
source: Material
ta: பொருள்

# filament.fields.price
source: Price
ta: விலை

# filament.fields.density
source: Density
ta: அடர்த்தி

# filament.fields.diameter
source: Diameter
ta: விட்டம்

# filament.fields.weight
source: Weight
ta: எடை

# filament.fields.spool_weight
source: Spool Weight
ta: ச்பூல் எடை

# filament.fields.article_number
source: Article Number
ta: கட்டுரை எண்

# filament.fields.registered
source: Registered
ta: பதிவுசெய்யப்பட்டது

# filament.fields.comment
source: Comment
ta: கருத்து

# filament.fields.settings_extruder_temp
source: Extruder Temp
ta: எக்ச்ட்ரூடர் தற்காலிக

# filament.fields.settings_bed_temp
source: Bed Temp
ta: படுக்கை தற்காலிக

# filament.fields.color_hex
source: Color
ta: நிறம்

# filament.fields.single_color
source: Single
ta: ஒற்றை

# filament.fields.multi_color
source: Multi
ta: பல

# filament.fields.coaxial
source: Coextruded
ta: இணை

# filament.fields.longitudinal
source: Longitudinal
ta: நீளமான

# filament.fields.external_id
source: External ID
ta: வெளிப்புற ஐடி

# filament.fields.spools
source: Show Spools
ta: ச்பூல்களைக் காட்டு

# filament.fields_help.name
source: Filament name, to distinguish this filament type among others from the same manufacturer. Should contain the color for example.
ta: இழை பெயர், இந்த இழை வகையை ஒரே உற்பத்தியாளரிடமிருந்து வேறுபடுத்துவதற்கு. உதாரணமாக வண்ணம் இருக்க வேண்டும்.

# filament.fields_help.material
source: E.g. PLA, ABS, PETG, etc.
ta: எ.கா. பி.எல்.ஏ, ஏபிஎச், பெட்சி, முதலியன.

# filament.fields_help.price
source: Price of a full spool.
ta: ஒரு முழு ச்பூலின் விலை.

# filament.fields_help.weight
source: The filament weight of a full spool (net weight). This should not include the weight of the spool itself, only the filament. It is what is usually written on the packaging.
ta: ஒரு முழு ச்பூலின் இழை எடை (நிகர எடை). இதில் ச்பூலின் எடையை சேர்க்கக்கூடாது, இழை மட்டுமே. இது பொதுவாக பேக்கேசிங்கில் எழுதப்படுகிறது.

# filament.fields_help.spool_weight
source: The weight of an empty spool. Used to determine measured weight of a spool.
ta: வெற்று ச்பூலின் எடை. ஒரு ச்பூலின் அளவிடப்பட்ட எடையை தீர்மானிக்கப் பயன்படுகிறது.

# filament.fields_help.article_number
source: E.g. EAN, UPC, etc.
ta: எ.கா. EAN, UPC, முதலியன.

# filament.fields_help.multi_color_direction
source: Filaments can have multiple colors in two ways: either through coextrusion, like dual-color filaments with consistent multi-colors, or through longitudinal color changes, like gradient filaments that shift colors along the spool.
ta: இழைகள் இரண்டு வழிகளில் பல வண்ணங்களைக் கொண்டிருக்கலாம்: சகாக்களின் மூலம், நிலையான பல வண்ணங்களுடன் இரட்டை-வண்ண இழைகள் போன்றவை, அல்லது ச்பூலில் வண்ணங்களை மாற்றும் சாய்வு இழைகள் போன்ற நீளமான வண்ண மாற்றங்கள் மூலம்.

# filament.titles.create
source: Create Filament
ta: இழை உருவாக்கு

# filament.titles.clone
source: Clone Filament
ta: நகலி இழை

# filament.titles.edit
source: Edit Filament
ta: இழை திருத்து

# filament.titles.list
source: Filaments
ta: இழைகள்

# filament.titles.show
source: Show Filament
ta: இழை காட்டு

# filament.titles.show_title
source: [Filament #{{id}}] {{name}}
ta: [இழை #{{id}}] {{name}}

# filament.form.filament_updated
source: This filament has been updated by someone/something else since you opened this page. Saving will overwrite those changes!
ta: இந்த பக்கத்தைத் திறந்ததிலிருந்து இந்த இழை யாரோ/வேறு ஏதாவது புதுப்பிக்கப்பட்டுள்ளது. சேமிப்பது அந்த மாற்றங்களை மேலெழுதும்!

# filament.form.import_external
source: Import from External
ta: வெளிப்புறத்திலிருந்து இறக்குமதி

# filament.form.import_external_description
source: Select a filament in the list to automatically populate its details in the filament creation form. This will overwrite any data you have entered in the form.<br><br>A Manufacturer object will be created automatically when you click Ok, if necessary.
ta: அதன் விவரங்களை இழை உருவாக்கும் வடிவத்தில் தானாக விரிவுபடுத்தப் பட்டியலில் ஒரு இழை தேர்ந்தெடுக்கவும். இது நீங்கள் படிவத்தில் உள்ளிட்ட எந்தத் தரவையும் மேலெழுதும். <br> <br> தேவைப்பட்டால், சரி என்பதைக் சொடுக்கு செய்யும்போது ஒரு உற்பத்தியாளர் பொருள் தானாக உருவாக்கப்படும்.

# filament.buttons.add_spool
source: Add Spool
ta: ச்பூல் சேர்க்கவும்

# vendor.vendor
source: Manufacturers
ta: உற்பத்தியாளர்கள்

# vendor.fields.id
source: ID
ta: ஐடி

# vendor.fields.name
source: Name
ta: பெயர்

# vendor.fields.empty_spool_weight
source: Empty Spool Weight
ta: வெற்று ச்பூல் எடை

# vendor.fields.external_id
source: External ID
ta: வெளிப்புற ஐடி

# vendor.fields.registered
source: Registered
ta: பதிவுசெய்யப்பட்டது

# vendor.fields.comment
source: Comment
ta: கருத்து

# vendor.fields_help.empty_spool_weight
source: The weight of an empty spool from this manufacturer.
ta: இந்த உற்பத்தியாளரிடமிருந்து வெற்று ச்பூலின் எடை.

# vendor.titles.create
source: Create Manufacturer
ta: உற்பத்தியாளரை உருவாக்கவும்

# vendor.titles.clone
source: Clone Manufacturer
ta: நகலி உற்பத்தியாளர்

# vendor.titles.edit
source: Edit Manufacturer
ta: உற்பத்தியாளரைத் திருத்து

# vendor.titles.list
source: Manufacturers
ta: உற்பத்தியாளர்கள்

# vendor.titles.show
source: Show Manufacturer
ta: உற்பத்தியாளரைக் காட்டு

# vendor.titles.show_title
source: [Manufacturer #{{id}}] {{name}}
ta: [உற்பத்தியாளர் #{{id}}] {{name}}

# vendor.form.vendor_updated
source: This manufacturer has been updated by someone/something else since you opened this page. Saving will overwrite those changes!
ta: இந்த பக்கத்தைத் திறந்ததிலிருந்து இந்த உற்பத்தியாளர் யாரோ/வேறு ஏதாவது புதுப்பிக்கப்பட்டார். சேமிப்பது அந்த மாற்றங்களை மேலெழுதும்!

# home.home
source: Home
ta: வீடு

# home.welcome
source: Welcome to your Spoolman instance!
ta: உங்கள் ச்பூல்மேன் உதாரணத்திற்கு வருக!

# home.description
source: It looks like you haven't added any spools yet. See the <helpPageLink>Help page</helpPageLink> for help getting started.
ta: நீங்கள் இதுவரை எந்த ச்பூல்களையும் சேர்க்கவில்லை என்று தெரிகிறது. தொடங்குவதற்கு <எல்பேசெலிங்க்> உதவி பக்கம் </எல்பேசெலிங்க்> ஐப் பார்க்கவும்.

# help.help
source: Help
ta: உதவி
