Repository: 247i/TACETr
Catalog: உரை/தானி/stooa-frontend-blog-*.po
Languages: ta

source: Share
ta: பங்கு

# bannerText
source: Take your online conversations to the next level
ta: உங்கள் நிகழ்நிலை உரையாடல்களை அடுத்த கட்டத்திற்கு கொண்டு செல்லுங்கள்

# blogCTA
source: Schedule your next meeting in Stooa
ta: STOOA இல் உங்கள் அடுத்த கூட்டத்தை திட்டமிடவும்

# blogPage.headerTitle
source: We love, we share
ta: நாங்கள் விரும்புகிறோம், பகிர்ந்து கொள்கிறோம்

# blogPage.headerSubtitle
source: At Stooa we like to talk about debate, conversation, listening to all the voices and learning from them, if you are also interested in these topics, this is your place.
ta: ச்டோவாவில் நாங்கள் விவாதம், உரையாடல், எல்லா குரல்களையும் கேட்பது மற்றும் அவர்களிடமிருந்து கற்றல் பற்றி பேச விரும்புகிறோம், இந்த தலைப்புகளில் நீங்களும் ஆர்வமாக இருந்தால், இது உங்கள் இடம்.

# blogPage.lastPosts
source: Last articles
ta: கடைசி கட்டுரைகள்

# posts.5-tips-boost-participation-online-meetings.title
source: 5 tips to boost participation in online meetings
ta: நிகழ்நிலை கூட்டங்களில் பங்கேற்பை அதிகரிக்க 5 உதவிக்குறிப்புகள்

# posts.5-tips-boost-participation-online-meetings.subtitle
source: Innovate in your online meetings: let's talk about effective techniques to increase engagement.
ta: உங்கள் நிகழ்நிலை கூட்டங்களில் புதுமை: நிச்சயதார்த்தத்தை அதிகரிக்க பயனுள்ள நுட்பங்களைப் பற்றி பேசலாம்.

# posts.5-tips-boost-participation-online-meetings.description
source: Discover how to improve your online meetings with our 5 tips: let's start with effective techniques to encourage participation, understand how to break the ice creatively, and we close by learning the potential of the Fishbowl dynamic.
ta: எங்கள் 5 உதவிக்குறிப்புகளுடன் உங்கள் நிகழ்நிலை சந்திப்புகளை எவ்வாறு மேம்படுத்துவது என்பதைக் கண்டறியவும்: பங்கேற்பை ஊக்குவிப்பதற்கும், பனியை எவ்வாறு ஆக்கப்பூர்வமாக உடைப்பது என்பதைப் புரிந்துகொள்வதற்கும், ஃபிச் பவுல் மாறும் திறனைக் கற்றுக்கொள்வதன் மூலமும் நாங்கள் மூடுகிறோம்.

# posts.5-tips-boost-participation-online-meetings.author
source: Carme from Stooa
ta: ச்டோவாவிலிருந்து கார்ம்

# posts.5-tips-boost-participation-online-meetings.date-and-duration
source: 5 min read - November 20 2023
ta: 5 மணித்துளி படிக்க - நவம்பர் 20 2023

# posts.5-tips-boost-participation-online-meetings.content.firstBlock
source: Have you ever felt like you were talking to the screen instead of your colleagues during online meetings? The awkward silence, the gazes lost in the cameras... and the famous "Does anyone want to add anything?" that always ends in a long silence.
ta: நிகழ்நிலை கூட்டங்களின் போது உங்கள் சகாக்களுக்குப் பதிலாக திரையில் பேசுவது போல் நீங்கள் எப்போதாவது உணர்ந்திருக்கிறீர்களா? மோசமான ம silence னம், கேமராக்களில் இழந்த விழிகள் ... மற்றும் பிரபலமான "யாராவது எதையும் சேர்க்க விரும்புகிறார்களா?" அது எப்போதும் ஒரு நீண்ட ம .னத்தில் முடிகிறது.

# posts.5-tips-boost-participation-online-meetings.content.secondBlock
source: You're not alone. Maintaining <span>participation</span> and <span>commitment</span> in online meetings is a mission many of us face in this digital era. But don't worry! There are super creative ways to improve this.
ta: நீங்கள் தனியாக இல்லை. நிகழ்நிலை கூட்டங்களில் <span> பங்கேற்பு </span> மற்றும் <span> அர்ப்பணிப்பு </span> ஆகியவற்றைப் பராமரிப்பது இந்த டிசிட்டல் சகாப்தத்தில் நம்மில் பலர் எதிர்கொள்ளும் ஒரு நோக்கம். ஆனால் கவலைப்பட வேண்டாம்! இதை மேம்படுத்த சூப்பர் படைப்பு வழிகள் உள்ளன.

# posts.5-tips-boost-participation-online-meetings.content.thirdBlock
source: Here are some tricks that will help you...
ta: உங்களுக்கு உதவும் சில தந்திரங்கள் இங்கே ...

# posts.5-tips-boost-participation-online-meetings.content.icebreakers
source: 1. Icebreakers
ta: 1. ஐச் பிரேக்கர்கள்

# posts.5-tips-boost-participation-online-meetings.content.fourthBlock
source: Start your meetings with an icebreaker. They are very useful strategic tools to start a session, especially online, with the aim of building trust and <span>energizing the group</span>, and they do more than just break the ice; they also allow you to <span>stimulate creativity</span> from the beginning. A simple example could be asking participants to share their desktop background and the story behind it.
ta: உங்கள் சந்திப்புகளை ஒரு ஐச்கிரீக்கருடன் தொடங்கவும். நம்பிக்கையை வளர்த்துக் கொள்ளும் நோக்கத்துடன், குறிப்பாக ஆன்லைனில் ஒரு அமர்வைத் தொடங்க அவை மிகவும் பயனுள்ள மூலோபாய கருவிகளாகும், மேலும் </span> ஐ உற்சாகப்படுத்துகின்றன, மேலும் அவை பனியை உடைப்பதை விட அதிகமாக செய்கின்றன; ஆரம்பத்தில் இருந்தே படைப்பாற்றல் </span> ஐத் தூண்டவும் அவை உங்களை அனுமதிக்கின்றன. ஒரு எளிய எடுத்துக்காட்டு பங்கேற்பாளர்களை அவர்களின் டெச்க்டாப் பின்னணியையும் அதன் பின்னால் உள்ள கதையையும் பகிர்ந்து கொள்ளும்படி கேட்கலாம்.

# posts.5-tips-boost-participation-online-meetings.content.fifthBlock
source: A good icebreaker is like coffee in the morning: necessary to wake up and get warm. 🐠
ta: ஒரு நல்ல ஐச்கிரீக்கர் காலையில் காபி போன்றது: எழுந்து சூடாக இருக்க தேவை. .

# posts.5-tips-boost-participation-online-meetings.content.surveys
source: 2. Polls
ta: 2. கருத்துக் கணிப்புகள்

# posts.5-tips-boost-participation-online-meetings.content.sixthBlock
source: Incorporate live polls to collect instant opinions and preferences. Polls can be about the theme of the meeting or to break the ice. They work very well to <span>give a voice to all attendees</span>, thus increasing participation.<br/>For example, you could launch a poll about the favorite snack for meetings or the best meme of the month. Polls are like the GPS of the meeting, they tell you where people are going and keep everyone on course. And the best thing is that everyone feels like they are piloting!
ta: உடனடி கருத்துகளையும் விருப்பங்களையும் சேகரிக்க நேரடி வாக்கெடுப்புகளை இணைக்கவும். கருத்துக் கணிப்புகள் கூட்டத்தின் கருப்பொருளைப் பற்றியது அல்லது பனியை உடைக்கலாம். அவை அனைத்து பங்கேற்பாளர்களுக்கும் </span> க்கு ஒரு குரலைக் கொடுப்பதற்கு மிகச் சிறப்பாக செயல்படுகின்றன, இதனால் பங்கேற்பு அதிகரிக்கிறது. கருத்துக் கணிப்புகள் கூட்டத்தின் சி.பி.எச் போன்றவை, மக்கள் எங்கு செல்கிறார்கள் என்பதை அவர்கள் உங்களுக்குக் கூறுகிறார்கள், அனைவரையும் நிச்சயமாக வைத்திருக்கிறார்கள். சிறந்த சேதி என்னவென்றால், எல்லோரும் அவர்கள் பைலட்டிங் செய்வது போல் உணர்கிறார்கள்!

# posts.5-tips-boost-participation-online-meetings.content.seventhBlock
source: You can do this with tools like Kahoot, Butter, or Google Forms.
ta: கஊட், வெண்ணெய் அல்லது கூகிள் படிவங்கள் போன்ற கருவிகளுடன் இதைச் செய்யலாம்.

# posts.5-tips-boost-participation-online-meetings.content.agenda
source: 3. Agenda and Order of the Day
ta: 3. நிகழ்ச்சி நிரல் மற்றும் அன்றைய ஒழுங்கு

# posts.5-tips-boost-participation-online-meetings.content.eighthBlock
source: Share a detailed agenda before the meeting. Make sure it is clear, concise, and highlights the <span>key points and times</span> specific to each topic. This helps participants prepare and keeps the meeting focused and efficient.
ta: கூட்டத்திற்கு முன் ஒரு விரிவான நிகழ்ச்சி நிரலைப் பகிர்ந்து கொள்ளுங்கள். ஒவ்வொரு தலைப்புக்கும் குறிப்பிட்ட <span> முக்கிய புள்ளிகள் மற்றும் நேரங்கள் </span> ஐ இது தெளிவாகவும், சுருக்கமாகவும், எடுத்துக்காட்டுகிறது. இது பங்கேற்பாளர்களைத் தயாரிக்க உதவுகிறது மற்றும் கூட்டத்தை மையமாகவும் திறமையாகவும் வைத்திருக்கிறது.

# posts.5-tips-boost-participation-online-meetings.content.reactions
source: 4. Reactions
ta: 4. எதிர்வினைகள்

# posts.5-tips-boost-participation-online-meetings.content.ninthBlock
source: Encourage participants to use reactions during the meeting. Use reactions like confetti at a carnival: let the thumbs up and hearts fly when something is cool. <span>It's the fastest way to say "That's it!" without interrupting the flow</span>.<br/>At Stooa, we usually start sessions by throwing out a question and asking participants to respond with reactions. You could ask what they would prefer between two things, for example: never being able to listen to music again 👎, or having to listen to music all the time 👍, and ask them to react with a thumbs up or down.
ta: கூட்டத்தின் போது எதிர்வினைகளைப் பயன்படுத்த பங்கேற்பாளர்களை ஊக்குவிக்கவும். ஒரு திருவிழாவில் கான்ஃபெட்டி போன்ற எதிர்வினைகளைப் பயன்படுத்துங்கள்: ஏதாவது குளிர்ச்சியாக இருக்கும்போது கட்டைவிரல் மற்றும் இதயங்கள் பறக்கட்டும். <span> "அதுதான்!" ஓட்டத்தை குறுக்கிடாமல் </span>. உதாரணமாக, இரண்டு விசயங்களுக்கு இடையில் அவர்கள் என்ன விரும்புகிறார்கள் என்று நீங்கள் கேட்கலாம்: ஒருபோதும் இசையை மீண்டும் கேட்க முடியாமல், அல்லது எப்போதும் இசையைக் கேட்க வேண்டும் 👍, மேலும் கட்டைவிரலால் மேலே அல்லது கீழ்நோக்கி நடந்துகொள்ளச் சொல்லுங்கள்.

# posts.5-tips-boost-participation-online-meetings.content.fishbowl
source: 5. Fishbowl
ta: 5. ஃபிச்போல்

# posts.5-tips-boost-participation-online-meetings.content.eleventhBlock
source: The Fishbowl dynamic will allow you to stop being the person who facilitates the session so you can focus on the conversation and the insights gained. This dynamic focuses on improving the <span>flow of dialogue</span>, and it manages to activate participation by giving all attendees the opportunity to actively participate.
ta: ஃபிச்போல் மாறும் அமர்வை எளிதாக்கும் நபராக இருப்பதை நிறுத்த உங்களை அனுமதிக்கும், இதனால் நீங்கள் உரையாடல் மற்றும் பெறப்பட்ட நுண்ணறிவுகளில் கவனம் செலுத்தலாம். இந்த மாறும் </span> ஐ </span> ஐ மேம்படுத்துவதில் கவனம் செலுத்துகிறது, மேலும் அனைத்து பங்கேற்பாளர்களுக்கும் தீவிரமாக பங்கேற்க வாய்ப்பளிப்பதன் மூலம் பங்கேற்பை செயல்படுத்த இது நிர்வகிக்கிறது.

# posts.5-tips-boost-participation-online-meetings.content.howItWorks
source: How does it work?
ta: இது எவ்வாறு செயல்படுகிறது?

# posts.5-tips-boost-participation-online-meetings.content.twelfthBlock
source: The Fishbowl is like an aquarium for brilliant ideas. Imagine that you are in an online meeting, and instead of everyone talking at once (total chaos!), some participants are in the "aquarium" (the Fishbowl itself) <span>sharing their ideas</span> while the rest observe and listen attentively. Participants in the aquarium rotate, ensuring that everyone has the chance to dive into the center of the action.
ta: ஃபிச்போல் புத்திசாலித்தனமான யோசனைகளுக்கான மீன்வளம் போன்றது. நீங்கள் ஒரு நிகழ்நிலை கூட்டத்தில் இருக்கிறீர்கள் என்று கற்பனை செய்து பாருங்கள், எல்லோரும் ஒரே நேரத்தில் பேசுவதற்குப் பதிலாக (மொத்த குழப்பம்!), சில பங்கேற்பாளர்கள் "மீன்வளையில்" (ஃபிச்போல் தானே) <ச்பான்> தங்கள் கருத்துக்களைப் பகிர்வது </span> இல் இருக்கிறார்கள், மீதமுள்ளவர்கள் கவனத்துடன் கவனித்து கேட்கிறார்கள். மீன்வளையில் பங்கேற்பாளர்கள் சுழல்கிறார்கள், அனைவருக்கும் நடவடிக்கையின் மையத்தில் மூழ்குவதற்கான வாய்ப்பு இருப்பதை உறுதி செய்கிறது.

# posts.5-tips-boost-participation-online-meetings.content.benefits
source: Benefits of the Fishbowl:
ta: ஃபிச்போலின் நன்மைகள்:

# posts.5-tips-boost-participation-online-meetings.content.listItem1
source: <span>Perfect Balance:</span> Everyone gets their moment in the spotlight, avoiding the chaos of speaking at the same time.
ta: <span> சரியான சமநிலை: </span> எல்லோரும் தங்கள் தருணத்தை கவனத்தை ஈர்க்கின்றனர், ஒரே நேரத்தில் பேசும் குழப்பத்தைத் தவிர்க்கிறார்கள்.

# posts.5-tips-boost-participation-online-meetings.content.listItem2
source: <span>Focus without Distractions:</span> It eliminates interruptions, keeping the meeting focused on the essential ideas.
ta: <span> கவனச்சிதறல்கள் இல்லாமல் கவனம் செலுத்துங்கள்: </span> இது குறுக்கீடுகளை நீக்குகிறது, கூட்டத்தை அத்தியாவசிய கருத்துக்களில் கவனம் செலுத்துகிறது.

# posts.5-tips-boost-participation-online-meetings.content.listItem3
source: <span>Active Participation:</span> The constant rotation inside the aquarium ensures that each team member has their chance to shine.
ta: <span> செயலில் பங்கேற்பு: </span> மீன்வளத்திற்குள் நிலையான சுழற்சி ஒவ்வொரு குழு உறுப்பினருக்கும் பிரகாசிக்க வாய்ப்பு இருப்பதை உறுதி செய்கிறது.

# posts.5-tips-boost-participation-online-meetings.content.listItem4
source: <span>Creative and Relaxed Atmosphere:</span> The unique structure of the Fishbowl creates a comfortable space to share ideas, without excessive formalities.
ta: <span> படைப்பு மற்றும் தளர்வான வளிமண்டலம்: </span> ஃபிச்போலின் தனித்துவமான அமைப்பு அதிகப்படியான சம்பிரதாயங்கள் இல்லாமல், கருத்துக்களைப் பகிர்ந்து கொள்ள ஒரு வசதியான இடத்தை உருவாக்குகிறது.

# posts.5-tips-boost-participation-online-meetings.content.thirdteenthBlock
source: Get ready to dive into the Fishbowl dynamic and make your online meetings a feast of innovation and participation. If you want to try this technique online, we invite you to schedule your next meeting at Stooa 🚀🐟
ta: ஃபிச்போல் மாறும் ஒன்றில் முழுக்குவதற்கு தயாராகுங்கள் மற்றும் உங்கள் நிகழ்நிலை கூட்டங்களை புதுமை மற்றும் பங்கேற்பு விருந்து செய்யுங்கள். இந்த நுட்பத்தை ஆன்லைனில் முயற்சிக்க விரும்பினால், உங்கள் அடுத்த கூட்டத்தை ச்டூவாவில் திட்டமிட உங்களை அழைக்கிறோம்

# posts.5-tips-boost-participation-online-meetings.content.summaryTitle
source: In summary
ta: சுருக்கத்தில்

# posts.5-tips-boost-participation-online-meetings.content.fourteenthBlock
source: With these tricks, your meetings will be the envy of the corporate world. Introduce these games, techniques, and a little madness, and your team will be counting the minutes to connect. Let the fun begin!
ta: இந்த தந்திரங்களுடன், உங்கள் கூட்டங்கள் கார்ப்பரேட் உலகின் பொறாமையாக இருக்கும். இந்த விளையாட்டுகள், நுட்பங்கள் மற்றும் ஒரு சிறிய பைத்தியக்காரத்தனத்தை அறிமுகப்படுத்துங்கள், மேலும் உங்கள் குழு இணைக்க நிமிடங்களை எண்ணும். வேடிக்கை தொடங்கட்டும்!

# posts.5-tips-boost-participation-online-meetings.content.sixteenthBlock
source: Remember, a good meeting is like a good party: everyone must enjoy and participate. And with Stooa, we're here to make sure the party never stops. 🎉
ta: நினைவில் கொள்ளுங்கள், ஒரு நல்ல சந்திப்பு ஒரு நல்ல விருந்து போன்றது: எல்லோரும் அனுபவித்து பங்கேற்க வேண்டும். ச்டோவாவுடன், கட்சி ஒருபோதும் நிற்காது என்பதை உறுதிப்படுத்த நாங்கள் இங்கு வந்துள்ளோம். .

# posts.5-tips-boost-participation-online-meetings.content.seventeenthBlock
source: And you, do you use any of these dynamics in your meetings? How do you increase participation in your online meetings?<br/> I'll be reading you in the comments 👀
ta: நீங்கள், உங்கள் கூட்டங்களில் இந்த இயக்கவியல் ஏதேனும் ஒன்றைப் பயன்படுத்துகிறீர்களா? உங்கள் நிகழ்நிலை கூட்டங்களில் பங்கேற்பை எவ்வாறு அதிகரிப்பது? <br/> நான் உங்களை கருத்துகளில் படிப்பேன்

# posts.5-tips-boost-participation-online-meetings.content.readTheArticle
source: You can read <a>the original article</a> published on LinkedIn by Carme Alcoverro.
ta: நீங்கள் படிக்கலாம் <a> அசல் கட்டுரை </a> கார்ம் அல்கோவர்ரோவால் லிங்க்ட்இனில் வெளியிடப்பட்டது.

# posts.3-innovative-dynamics-for-retros.title
source: 3 Innovative dynamics for your team retrospectives
ta: 3 உங்கள் குழு பின்னோக்கி புதுமையான இயக்கவியல்

# posts.3-innovative-dynamics-for-retros.subtitle
source: Transform your agile retrospectives with these three innovative dynamics
ta: இந்த மூன்று புதுமையான இயக்கவியலுடன் உங்கள் சுறுசுறுப்பான பின்னோக்கி மாற்றவும்

# posts.3-innovative-dynamics-for-retros.description
source: Explore three creative dynamics to enhance your agile team retrospectives: The Starfish, The Dartboard, and The Agile Aquarium with Stooa or Fishbowl. Ideal for Scrum and Kanban methodologies in online environments.
ta: உங்கள் சுறுசுறுப்பான குழு பின்னோக்கி மேம்படுத்த மூன்று படைப்பு இயக்கவியலை ஆராயுங்கள்: ச்டார்ஃபிச், டார்ட் போர்டு மற்றும் ச்டூவா அல்லது ஃபிச்போல் கொண்ட சுறுசுறுப்பான மீன்வளம். நிகழ்நிலை சூழல்களில் ச்க்ரம் மற்றும் கான்பன் முறைகளுக்கு ஏற்றது.

# posts.3-innovative-dynamics-for-retros.author
source: Guido from Stooa
ta: ச்டோவாவிலிருந்து கைடோ

# posts.3-innovative-dynamics-for-retros.date-and-duration
source: 5 min read - November 29 2023
ta: 5 மணித்துளி படிக்க - நவம்பர் 29 2023

# posts.3-innovative-dynamics-for-retros.content.firstBlock
source: Agile team retrospectives are crucial for development and continuous improvement. To take these sessions to a new level, let me introduce you to three creative dynamics that we integrate into Scrum and Kanban methodologies, along with an innovative digital approach in Fishbowl using the free tool Stooa.
ta: வளர்ச்சி மற்றும் தொடர்ச்சியான முன்னேற்றத்திற்கு சுறுசுறுப்பான குழு பின்னோக்கி முக்கியமானது. இந்த அமர்வுகளை ஒரு புதிய நிலைக்கு கொண்டு செல்ல, ச்க்ரம் மற்றும் கான்பன் முறைகளில் நாங்கள் ஒருங்கிணைக்கும் மூன்று படைப்பு இயக்கவியலுக்கு உங்களுக்கு அறிமுகப்படுத்துகிறேன், சேர்ந்து ஃபிச்போலில் ஒரு புதுமையான டிசிட்டல் அணுகுமுறையுடன் இலவச கருவி ச்டோவாவைப் பயன்படுத்தி.

# posts.3-innovative-dynamics-for-retros.content.theStarfish
source: 🌟 The Starfish 🌟
ta: Star நட்சத்திர மீன்

# posts.3-innovative-dynamics-for-retros.content.starfishObjective
source: <span>Objective</span>: Identify practices to continue, start, stop, increase, and decrease.
ta: <span> குறிக்கோள் </span>: தொடர, தொடங்க, நிறுத்த, அதிகரிக்க மற்றும் குறைவதற்கான நடைமுறைகளை அடையாளம் காணவும்.

# posts.3-innovative-dynamics-for-retros.content.starfishHowItWorks
source: <span>How it's done</span>: Use a five-pointed star to represent each category. The team adds post-its in each category and then spends the necessary time to discuss each point of the star, depending on the number of items to discuss and their importance.
ta: <span> இது எப்படி முடிந்தது </span>: ஒவ்வொரு வகையையும் குறிக்க ஐந்து புள்ளிகள் கொண்ட நட்சத்திரத்தைப் பயன்படுத்தவும். குழு ஒவ்வொரு வகையிலும் பிந்தையவற்றைச் சேர்க்கிறது, பின்னர் விவாதிக்க வேண்டிய பொருட்களின் எண்ணிக்கை மற்றும் அவற்றின் முக்கியத்துவத்தைப் பொறுத்து நட்சத்திரத்தின் ஒவ்வொரு புள்ளியையும் விவாதிக்க தேவையான நேரத்தை செலவிடுகிறது.

# posts.3-innovative-dynamics-for-retros.content.starfishBenefits
source: <span>Ideal for</span>: Teams looking for a comprehensive view of their performance.
ta: </span> க்கு ஏற்றது </ச்பான்>: அவர்களின் செயல்திறனைப் பற்றிய விரிவான பார்வையைத் தேடும் அணிகள்.

# posts.3-innovative-dynamics-for-retros.content.bullseye
source: 🎯 The Dartboard 🎯
ta: T டார்ட் போர்டு

# posts.3-innovative-dynamics-for-retros.content.bullseyeObjective
source: <span>Objective</span>: Focus on specific goals and strategies to achieve them.
ta: <span> குறிக்கோள் </span>: குறிப்பிட்ட குறிக்கோள்கள் மற்றும் அவற்றை அடைய உத்திகளில் கவனம் செலுத்துங்கள்.

# posts.3-innovative-dynamics-for-retros.content.bullseyeHowItWorks
source: <span>How it's done</span>: Create a dartboard with circles representing different focus areas. Team members add post-its in each region of the board, depending on their importance, and then discuss improvements and make them actionable in each area. I recommend not using too many circles to keep the session manageable.
ta: <span> இது எப்படி முடிந்தது </span>: வெவ்வேறு கவனம் செலுத்தும் பகுதிகளைக் குறிக்கும் வட்டங்களுடன் ஒரு டார்ட்போர்டை உருவாக்கவும். குழு உறுப்பினர்கள் வாரியத்தின் ஒவ்வொரு பிராந்தியத்திலும் தங்கள் முக்கியத்துவத்தைப் பொறுத்து பிந்தையவற்றைச் சேர்க்கிறார்கள், பின்னர் மேம்பாடுகளைப் பற்றி விவாதித்து ஒவ்வொரு பகுதியிலும் அவற்றை செயல்படச் செய்கிறார்கள். அமர்வை நிர்வகிக்க பல வட்டங்களைப் பயன்படுத்த வேண்டாம் என்று நான் பரிந்துரைக்கிறேன்.

# posts.3-innovative-dynamics-for-retros.content.bullseyeBenefits
source: <span>Ideal for</span>: Teams that need to concentrate on specific areas of improvement.
ta: </span> க்கு ஏற்றது </span>: முன்னேற்றத்தின் குறிப்பிட்ட பகுதிகளில் கவனம் செலுத்த வேண்டிய அணிகள்.

# posts.3-innovative-dynamics-for-retros.content.bullseyeTime
source: <span>Recommended Time/Duration</span>: 1 hour, dedicating between 10 and 15 minutes to each circle.
ta: <span> பரிந்துரைக்கப்பட்ட நேரம்/காலம் </span>: 1 மணிநேரம், ஒவ்வொரு வட்டத்திற்கும் 10 முதல் 15 நிமிடங்கள் வரை அர்ப்பணிக்கிறது.

# posts.3-innovative-dynamics-for-retros.content.bullseyeTip
source: I share you an example of the concepts that can go inside the circles of each target: Technical performance, teamwork and communication, innovation and learning, and finally user experience.
ta: ஒவ்வொரு இலக்கின் வட்டங்களுக்குள் செல்லக்கூடிய கருத்துகளுக்கு ஒரு எடுத்துக்காட்டு நான் உங்களுக்கு பகிர்ந்து கொள்கிறேன்: தொழில்நுட்ப செயல்திறன், குழுப்பணி மற்றும் செய்தி தொடர்பு, புதுமை மற்றும் கற்றல் மற்றும் இறுதியாக பயனர் பட்டறிவு.

# posts.3-innovative-dynamics-for-retros.content.fishbowl
source: 🐠 The Agile Aquarium with Stooa 🐠
ta: St ச்டூவாவுடன் சுறுசுறுப்பான மீன்வளம்

# posts.3-innovative-dynamics-for-retros.content.fishbowlObjective
source: <span>Objective</span>: Promote a deep and structured discussion in a digital environment, including all voices and viewpoints of the team.
ta: <span> குறிக்கோள் </span>: டிசிட்டல் சூழலில் ஆழமான மற்றும் கட்டமைக்கப்பட்ட விவாதத்தை ஊக்குவிக்கவும், குழுவின் அனைத்து குரல்கள் மற்றும் கண்ணோட்டங்கள் உட்பட.

# posts.3-innovative-dynamics-for-retros.content.fishbowlHowItWorks
source: <span>How it's done</span>: Implement the Fishbowl dynamics, and if it's online, I recommend using Stooa, a free, open-source unconference tool that doesn't require downloading. Arrange participants in an inner circle (where the debate takes place) and an outer circle (where they observe the debate) within the virtual space. Anyone from the outer circle can freely enter the inner circle whenever they need to contribute their perspective to the conversation. This facilitates participation in a fluid and organised manner <span>without the need for moderation</span>, allowing the conversation to remain <span>focused on the central topic</span> and encouraging diversity of voices involved.
ta: <span> இது எப்படி முடிந்தது </span>: ஃபிச்போல் இயக்கவியலை செயல்படுத்தவும், அது ஆன்லைனில் இருந்தால், பதிவிறக்கம் தேவையில்லாத இலவச, திறந்த-மூல அசைவற்ற கருவியான STOOA ஐப் பயன்படுத்த பரிந்துரைக்கிறேன். பங்கேற்பாளர்களை ஒரு உள் வட்டத்தில் (விவாதம் நடைபெறும் இடத்தில்) மற்றும் மெய்நிகர் இடத்திற்குள் வெளிப்புற வட்டம் (அவர்கள் விவாதத்தை கவனிக்கும் இடத்தில்) ஏற்பாடு செய்யுங்கள். வெளிப்புற வட்டத்திலிருந்து எவரும் உரையாடலுக்கு தங்கள் முன்னோக்கை பங்களிக்க வேண்டிய போதெல்லாம் உள் வட்டத்தில் சுதந்திரமாக நுழைய முடியும். இது மிதமான </span> தேவையில்லாமல் ஒரு திரவம் மற்றும் ஒழுங்கமைக்கப்பட்ட முறையில் <span> இல் பங்கேற்பதை எளிதாக்குகிறது, இது உரையாடல் <ச்பான்> மைய தலைப்பு </span> இல் கவனம் செலுத்துவதற்கும், சம்பந்தப்பட்ட குரல்களின் பன்முகத்தன்மையை ஊக்குவிப்பதற்கும் அனுமதிக்கிறது.

# posts.3-innovative-dynamics-for-retros.content.fishbowlBenefits
source: <span>Ideal for</span>: Remote or hybrid teams looking to improve communication and obtain multiple perspectives.
ta: </span> க்கு ஏற்றது>: தகவல்தொடர்புகளை மேம்படுத்தவும் பல முன்னோக்குகளைப் பெறவும் விரும்பும் தொலை அல்லது கலப்பின குழுக்கள்.

# posts.3-innovative-dynamics-for-retros.content.alreadyKnew
source: Were you familiar with these dynamics? My favorite is the Aquarium with Stooa. It offers a different kind of retrospective that generates incredibly enriching conversations. If you've read this far, thank you for your time! If you have any cool dynamics that work for you in team retrospectives, I'd love to hear about them.
ta: இந்த இயக்கவியல் உங்களுக்கு தெரிந்திருக்கிறதா? எனக்கு பிடித்தது ச்டூவாவுடனான மீன்வளம். இது நம்பமுடியாத வளமான உரையாடல்களை உருவாக்கும் வேறுபட்ட வகையான பின்னோக்கிப் பார்க்கிறது. நீங்கள் இதுவரை படித்திருந்தால், உங்கள் நேரத்திற்கு நன்றி! குழு பின்னோக்கி உங்களுக்காக வேலை செய்யும் ஏதேனும் அருமையான இயக்கவியல் உங்களிடம் இருந்தால், அவற்றைப் பற்றி நான் கேட்க விரும்புகிறேன்.

# posts.3-innovative-dynamics-for-retros.content.tryStooa
source: I also encourage you to try the Stooa tool for your next agile retrospective! We've developed this easy-to-use, completely free, and open-source tool.
ta: உங்கள் அடுத்த சுறுசுறுப்பான பின்னோக்கி ச்டூவா கருவியை முயற்சிக்க நான் உங்களை ஊக்குவிக்கிறேன்! இந்த சுலபமான, முற்றிலும் இலவச மற்றும் திறந்த மூல கருவியை நாங்கள் உருவாக்கியுள்ளோம்.

# posts.3-innovative-dynamics-for-retros.content.feedback
source: And if you have any feedback to share with me, I'd be delighted to read it :)
ta: என்னுடன் பகிர்ந்து கொள்ள உங்களுக்கு ஏதேனும் கருத்து இருந்தால், அதைப் படிக்க நான் மகிழ்ச்சியடைவேன் :)

# posts.3-innovative-dynamics-for-retros.content.originalPost
source: You can read and comment in the <a>original article</a> published in LinkedIn by Guido.
ta: கைடோவால் லிங்க்ட்இனில் வெளியிடப்பட்ட <a> அசல் கட்டுரையில் நீங்கள் படித்து கருத்து தெரிவிக்கலாம்.
