Repository: 247i/TACETr
Catalog: உரை/தானி/stooa-frontend-register-*.po
Languages: ta

# title
source: Register to get started
ta: தொடங்குவதற்கு பதிவு செய்யுங்கள்

# shareAccount
source: If you would like to share your <strong>Twitter</strong> or <strong>Linkedin</strong> profiles with other attendees, fill in the following fields.
ta: உங்கள் <strong> ட்விட்டர் </strong> அல்லது <strong> சென்டர் </strong> பிற பங்கேற்பாளர்களுடன் சுயவிவரங்களைப் பகிர்ந்து கொள்ள விரும்பினால், பின்வரும் புலங்களை நிரப்பவும்.

# linkedin
source: Linkedin URL (optional)
ta: சென்டர் முகவரி (விரும்பினால்)

# twitter
source: Twitter URL (optional)
ta: ட்விட்டர் முகவரி (விரும்பினால்)

# linkedinHelp
source: Copy & paste your Linkedin URL profile
ta: உங்கள் சென்டர் முகவரி சுயவிவரத்தை நகலெடுத்து ஒட்டவும்

# twitterHelp
source: Copy & paste your Twitter URL profile
ta: உங்கள் ட்விட்டர் முகவரி சுயவிவரத்தை நகலெடுத்து ஒட்டவும்

# haveAccount
source: Already registered?
ta: ஏற்கனவே பதிவு செய்யப்பட்டுள்ளதா?

# button.register
source: Register for free
ta: இலவசமாக பதிவு செய்யுங்கள்

# button.login
source: Log in
ta: புகுபதிகை

# terms
source: By creating this account, you agree to our <a>Term & Conditions and the Privacy Policy</a>.
ta: இந்த கணக்கை உருவாக்குவதன் மூலம், எங்கள் <a> கால மற்றும் நிபந்தனைகள் மற்றும் தனியுரிமைக் கொள்கையை நீங்கள் ஒப்புக்கொள்கிறீர்கள் </a>.
