Repository: 247i/TACETr
Catalog: உரை/தானி/subway-tooter-strings-*.po
Languages: ta

source: Select and copy
ta: தேர்ந்தெடுத்து நகலெடுக்கவும்

# search_web
source: Web search
ta: வலை தேடல்

# muted_word
source: Banned words
ta: தடைசெய்யப்பட்ட வார்த்தைகள்

# word_was_muted
source: The word was banned.
ta: சொல் தடை செய்யப்பட்டது.

# copy_complete
source: Clipboard updated.
ta: இடைநிலைப்பலகை புதுப்பிக்கப்பட்டது.

# footer_color
source: Footer's color
ta: அடிக்குறிப்பின் நிறம்

# button_background_color
source: Button's background color
ta: பொத்தானின் பின்னணி நிறம்

# button_foreground_color
source: Button's foreground color
ta: பொத்தானின் முன்புற நிறம்

# tab_background_color
source: Tab's background color
ta: தாவலின் பின்னணி நிறம்

# tab_divider_color
source: Tab's divider color
ta: தாவலின் வகுப்பி நிறம்

source: Open status from
ta: இருந்து திறந்த நிலை

# help_translation
source: Help improve the translation
ta: மொழிபெயர்ப்பை மேம்படுத்த உதவுங்கள்

# dont_use_streaming_api
source: Refresh the feeds manually
ta: ஊட்டங்களை கைமுறையாக புதுப்பிக்கவும்

# dont_refresh_on_activity_resume
source: Disable auto-refresh when returning to the app.
ta: பயன்பாட்டிற்குத் திரும்பும்போது ஆட்டோ-ரஃப்ரெசை முடக்கு.

# status_id_conversion_failed
source: Could not convert status ID.
ta: நிலை ஐடியை மாற்ற முடியவில்லை.

source: Already favourited.
ta: ஏற்கனவே சாதகமானது.

source: Already bookmarked.
ta: ஏற்கனவே புக்மார்க்கு செய்யப்பட்டது.

source: Already boosted.
ta: ஏற்கனவே உயர்த்தப்பட்டது.

# dont_screen_off
source: Keep the screen on when using the app.
ta: பயன்பாட்டைப் பயன்படுத்தும் போது திரையை வைத்திருங்கள்.

# hide_media_default
source: Hide all media
ta: எல்லா ஊடகங்களையும் மறைக்கவும்

# cant_close_column_by_back_button_when_multiple_column_shown
source: You can't close the column using the "Back" button when multiple columns are shown.
ta: பல நெடுவரிசைகள் காண்பிக்கப்படும் போது "பின்" பொத்தானைப் பயன்படுத்தி நெடுவரிசையை மூட முடியாது.

# disable_tablet_mode
source: Disable tablet mode (app restart required)
ta: டேப்லெட் பயன்முறையை முடக்கு (பயன்பாட்டு மறுதொடக்கம் தேவை)

# minimum_column_width
source: Minimum column width (default=300dp, app restart required)
ta: குறைந்தபட்ச நெடுவரிசை அகலம் (இயல்புநிலை = 300 டிபி, பயன்பாட்டு மறுதொடக்கம் தேவை)

# media_thumbnail_height
source: Media Thumbnail height (default=64dp, app restart required)
ta: மீடியா சிறு உயரம் (இயல்புநிலை = 64 டிபி, பயன்பாட்டு மறுதொடக்கம் தேவை)

# account_picker_reply
source: Reply from?
ta: இருந்து பதில்?

# account_picker_quote_toot
source: Account to "quote post"?
ta: "மேற்கோள் இடுகை" க்கு கணக்கு?

source: Reply from another account
ta: மற்றொரு கணக்கிலிருந்து பதிலளிக்கவும்

# launcher_icon_by
source: Thanks to フタバ for the application icon.
ta: பயன்பாட்டு ஐகானுக்கு ஃபுடாபாவுக்கு நன்றி.

# ssl_bug_7_0
source: Android 7.0 can only use the elliptic curve "prime256v1". Unfortunately your server seems to not support it. This bug has been fixed in Android 7.1.1. You can either upgrade your OS or ask the server administrator to add support to the elliptic curve "prime256v1". See also https://code.google.com/p/android/issues/detail?id=224438
ta: ஆண்ட்ராய்டு 7.0 நீள்வட்ட வளைவை "PRIME256V1" மட்டுமே பயன்படுத்த முடியும். துரதிர்ச்டவசமாக உங்கள் சேவையகம் அதை ஆதரிக்கவில்லை என்று தெரிகிறது. இந்த பிழை ஆண்ட்ராய்டு 7.1.1 இல் சரி செய்யப்பட்டது. உங்கள் OS ஐ மேம்படுத்தலாம் அல்லது "PRIME256V1" என்ற நீள்வட்ட வளைவுக்கு ஆதரவைச் சேர்க்க சேவையக நிர்வாகியிடம் கேட்கலாம். Https://code.google.com/p/android/issues/detail?id=224438 ஐயும் காண்க

# timeline_font
source: Timeline font (app restart required)
ta: காலவரிசை எழுத்துரு (பயன்பாட்டு மறுதொடக்கம் தேவை)

# timeline_font_bold
source: Bold timeline font (app restart required)
ta: தைரியமான காலவரிசை எழுத்துரு (பயன்பாட்டு மறுதொடக்கம் தேவை)

# restore_draft
source: Restore from draft
ta: வரைவிலிருந்து மீட்டமைக்கவும்

# select_draft
source: Which draft to restore ?
ta: எந்த வரைவு மீட்டெடுக்க?

# account_in_draft_is_lost
source: The account used to make this draft has been removed from this app. The following context can not be restored: in_reply_to, media attachment
ta: இந்த வரைவை உருவாக்கப் பயன்படுத்தப்படும் கணக்கு இந்த பயன்பாட்டிலிருந்து அகற்றப்பட்டுள்ளது. பின்வரும் சூழலை மீட்டெடுக்க முடியாது: in_reply_to, மீடியா இணைப்பு

# reply_to_in_draft_is_lost
source: The reply origin referred by the draft has been lost. The following context is removed: in_reply_to
ta: வரைவால் குறிப்பிடப்படும் பதில் தோற்றம் இழந்துவிட்டது. பின்வரும் சூழல் அகற்றப்பட்டது: in_reply_to

# attachment_in_draft_is_lost
source: Some of the media attachments in the draft have been lost.
ta: வரைவில் உள்ள சில ஊடக இணைப்புகள் இழந்துவிட்டன.

# app_data_export
source: Export app data
ta: பயன்பாட்டு தரவை ஏற்றுமதி செய்யுங்கள்

# app_data_import
source: Import app data
ta: பயன்பாட்டு தரவை இறக்குமதி செய்யுங்கள்

# app_data_import_desc
source: You can export data to any app that can receive data, but maybe you can import data only from device's storage or Google drive. Column background image may be not exported/imported over device. Timeline font is not exported/imported. Custom notification sound may be not exported/imported over device.
ta: தரவைப் பெறக்கூடிய எந்தவொரு பயன்பாட்டிற்கும் நீங்கள் தரவை ஏற்றுமதி செய்யலாம், ஆனால் சாதனத்தின் சேமிப்பிடம் அல்லது கூகிள் டிரைவிலிருந்து மட்டுமே தரவை இறக்குமதி செய்யலாம். நெடுவரிசை பின்னணி படம் சாதனத்தின் மீது ஏற்றுமதி செய்யப்படாமல்/இறக்குமதி செய்யப்படலாம். காலவரிசை எழுத்துரு ஏற்றுமதி செய்யப்படவில்லை/இறக்குமதி செய்யப்படவில்லை. தனிப்பயன் அறிவிப்பு ஒலி சாதனத்தின் மீது ஏற்றுமதி செய்யப்படாமல்/இறக்குமதி செய்யப்படலாம்.

# app_data_import_confirm
source: Existing data (before import) will be cleared. Are you sure?
ta: தற்போதுள்ள தரவு (இறக்குமதிக்கு முன்) அழிக்கப்படும். நீங்கள் உறுதியாக இருக்கிறீர்களா?

# user_id_conversion_failed
source: Could not convert user ID.
ta: பயனர் ஐடியை மாற்ற முடியவில்லை.

# draft_picker_desc
source: Long tap to delete.
ta: நீக்க நீண்ட தட்டு.

source: Draft deleted.
ta: வரைவு நீக்கப்பட்டது.

# dont_crop_media_thumbnail
source: Don't crop media thumbnail (app restart required)
ta: மீடியா சிறு உருவத்தை பயிர் செய்ய வேண்டாம் (பயன்பாட்டு மறுதொடக்கம் தேவை)

# tab_indicator_color
source: Tab's indicator color
ta: தாவலின் காட்டி நிறம்

source: Plugin
ta: சொருகு

source: Select plugin
ta: சொருகி தேர்ந்தெடுக்கவும்

source: Plugin not installed.
ta: சொருகி நிறுவப்படவில்லை.

# language_code
source: en
ta: என்

source: Tablet mode
ta: டேப்லெட் பயன்முறை

source: Appearance
ta: தோற்றம்

source: Performance
ta: செயல்திறன்

source: Behavior
ta: நடத்தை

# notification_on_off_desc
source: There is also an account setting to turn notifications off/on.
ta: அறிவிப்புகளை அணைக்க/இயக்க ஒரு கணக்கு அமைப்பும் உள்ளது.

source: Post
ta: இடுகை

# post_compose_button_default_account
source: Default account when compose post button tapped
ta: இயல்புநிலை கணக்கு இடுகையிடப்பட்ட பொத்தானை எழுதும்போது

# account_change_failed_old_draft_has_no_in_reply_to_url
source: Could not switch account. Old draft data has no in_reply_to_url, can't convert in_reply_to for selected server.
ta: கணக்கை மாற்ற முடியவில்லை. பழைய வரைவு தரவுகளில் in_reply_to_url இல்லை, தேர்ந்தெடுக்கப்பட்ட சேவையகத்திற்கு in_reply_to ஐ மாற்ற முடியாது.

source: "in_reply_to" ID conversion failed.
ta: "in_reply_to" ஐடி மாற்றம் தோல்வியடைந்தது.

# prior_chrome_custom_tabs
source: Prioritise Google Chrome (if "Custom Tabs" is turned on)
ta: Google Chrome க்கு முன்னுரிமை கொடுங்கள் ("தனிப்பயன் தாவல்கள்" இயக்கப்பட்டிருந்தால்)

# enable_speech
source: Enables speech
ta: பேச்சை செயல்படுத்துகிறது

source: (URL omitted)
ta: (URL தவிர்க்கப்பட்டது)

source: Blocked domains
ta: தடுக்கப்பட்ட களங்கள்

# block_domain_that
source: Block the whole domain "%1$s"
ta: முழு களத்தையும் "%1$s" ஐத் தடுக்கவும்

# confirm_block_domain
source: Really block the whole domain "%1$s"?
ta: "%1$s" முழு களத்தையும் உண்மையில் தடுக்கவா?

# confirm_unblock_domain
source: Unblock the domain "%1$s"?
ta: "%1$s" டொமைனைத் தடுக்கவா?

# text_to_speech_initializing
source: Starting TextToSpeech…
ta: உரை டோச்பீச் தொடங்குகிறது…

# text_to_speech_initialize_failed
source: Could not start TextToSpeech. Status: %1$s
ta: உரை டோச்பீச் தொடங்க முடியவில்லை. நிலை: %1$s

source: TextToSpeech shut down…
ta: TextTospech மூடப்பட்டது…

# show_post_button_bar_top
source: Show button bar at the top of posting screen
ta: இடுகையிடும் திரையின் மேலே பொத்தான் பட்டியைக் காட்டு

# client_name
source: Client name (access token update required)
ta: கிளையன்ட் பெயர் (அணுகல் கிள்ளாக்கு புதுப்பிப்பு தேவை)

# toot_search
source: Post search
ta: தேடல்

# toot_search_msp
source: Post search (MSP)
ta: இடுகை தேடல் (எம்.எச்.பி)

# toot_search_ts
source: Post search (ts)
ta: இடுகை தேடல் (TS)

# toot_search_notestock
source: notestock search
ta: நோட்டெச்டாக் தேடல்

# mastodon_search_portal
source: Mastodon search portal(JP)
ta: மாச்டோடன் தேடல் போர்டல் (சே.பி.)

# search_desc_mastodon_api
source: Account/hashtag search using Mastodon API.
ta: மாச்டோடன் பநிஇ பயன்படுத்தி கணக்கு/ஏச்டேக் தேடல்.

# toot_search_of
source: Post search "%1$s"
ta: இடுகை தேடல் "%1$s"

# toot_search_msp_of
source: Post search (MSP) "%1$s"
ta: இடுகை தேடல் (MSP) "%1$s"

# toot_search_ts_of
source: Post search (ts) "%1$s"
ta: இடுகை தேடல் (TS) "%1$s"

# progress_synchronize_toot
source: Syncing post…
ta: இடுகை ஒத்திசைத்தல்…

# send_header_account_name
source: Account-Name
ta: கணக்கு-பெயர்

# send_header_account_acct
source: Account-Acct
ta: கணக்கு-அக்ச்டி

# send_header_account_url
source: Account-Url
ta: கணக்கு-உர்எல்

# send_header_account_created_at
source: Account-Created-At
ta: கணக்கு உருவாக்கிய-அட்

# send_header_account_statuses_count
source: Account-Statuses-Count
ta: கணக்கு-நிலை-எண்ணிக்கை

# send_header_account_followers_count
source: Account-Followers-Count
ta: கணக்கு-பின்தொடர்பவர்கள்-எண்ணிக்கை

# send_header_account_following_count
source: Account-Following-Count
ta: கணக்கு-பின்தொடரும்-எண்ணிக்கை

# send_header_account_locked
source: Account-Locked
ta: கணக்கு பூட்டப்பட்ட

# send_header_account_image_avatar
source: Account-Image-Avatar
ta: கணக்கு-படம்-அவதார்

# send_header_account_image_avatar_static
source: Account-Image-Avatar-Static
ta: கணக்கு-படம்-அவதார்-நிலையானது

# send_header_account_image_header
source: Account-Image-Header
ta: கணக்கு-பட-தலைவர்

# send_header_account_image_header_static
source: Account-Image-Header-Static
ta: கணக்கு-பட-தலைப்பு-நிலையானது

# open_local_timeline_for
source: Open timeline of "%1$s"
ta: "%1$s" இன் திறந்த காலவரிசை

source: Notification sound
ta: அறிவிப்பு ஒலி

# timeline_font_size
source: Timeline font size (Unit:sp. leave empty to default. app restart required) … …
ta: காலவரிசை எழுத்துரு அளவு (அலகு: எச்பி. இயல்புநிலைக்கு காலியாக விடவும். பயன்பாட்டு மறுதொடக்கம் தேவை) … …

# acct_font_size
source: Acct font size (Unit:sp. leave empty to default. app restart required)
ta: ACCT எழுத்துரு அளவு (அலகு: sp. இயல்புநிலைக்கு காலியாக விடவும். பயன்பாட்டு மறுதொடக்கம் தேவை)

source: Don't add duplication check header
ta: நகல் காசோலை தலைப்பைச் சேர்க்க வேண்டாம்

# show_quick_toot_bar
source: Show "Quick Post" bar (app restart required.)
ta: "விரைவான இடுகை" பட்டியைக் காட்டு (பயன்பாட்டு மறுதொடக்கம் தேவை.)

# quick_toot_hint
source: Quick Post
ta: விரைவான இடுகை

# search_is_not_available_on_pseudo_account
source: Search function is unavailable on pseudo account .
ta: போலி கணக்கில் தேடல் செயல்பாடு கிடைக்கவில்லை.

# conversation_from_another_account
source: Conversation view from another account
ta: மற்றொரு கணக்கிலிருந்து உரையாடல் பார்வை

source: Show avatar image
ta: அவதார் படத்தைக் காட்டு

source: Quote URL…
ta: மேற்கோள் URL…

source: Actions for notification
ta: அறிவிப்புக்கான செயல்கள்

source: Delete this notification
ta: இந்த அறிவிப்பை நீக்கு

# mute_this_conversation
source: Mute more notifications for this conversation
ta: இந்த உரையாடலுக்கான கூடுதல் அறிவிப்புகளை முடக்கவும்

# unmute_this_conversation
source: Unmute more notifications for this conversation
ta: இந்த உரையாடலுக்கான கூடுதல் அறிவிப்புகளை மாற்றவும்

# input_access_token
source: Enter access token
ta: அணுகல் கிள்ளாக்கை உள்ளிடவும்

# input_access_token_desc
source: Specify access token instead of normal user authentication. (advanced)
ta: சாதாரண பயனர் அங்கீகாரத்திற்கு பதிலாக அணுகல் டோக்கனைக் குறிப்பிடவும். (மேம்பட்டது)

# access_token_or_api_token
source: Access token (if using Misskey, please input API token)
ta: அணுகல் கிள்ளாக்கு (மிச்கியைப் பயன்படுத்தினால், தயவுசெய்து பநிஇ கிள்ளாக்கை உள்ளிடவும்)

# token_not_specified
source: Please input access token.
ta: அணுகல் கிள்ளாக்கை உள்ளிடவும்.

source: Quote name…
ta: மேற்கோள் பெயர்…

# format_of_quote_name
source: Format of "Quote name" (set text that contains %1$s)
ta: "மேற்கோள் பெயர்" இன் வடிவம் ( %1$s ஐக் கொண்ட உரையை அமைக்கவும்)

# dont_show_favourite
source: Don't show favourites
ta: பிடித்தவைகளைக் காட்ட வேண்டாம்

# dont_show_follow
source: Don't show follows
ta: பின்வருமாறு காட்ட வேண்டாம்

source: Background image
ta: பின்னணி படம்

source: Background image alpha
ta: பின்னணி பட ஆல்பா

# acct_color
source: Acct text color
ta: ACCT உரை நிறம்

# content_color
source: Content text color
ta: உள்ளடக்க உரை நிறம்

# content_sample
source: (sample)The quick brown fox jumps over the lazy dog.
ta: (மாதிரி) விரைவான பழுப்பு நரி சோம்பேறி நாய் மீது குதிக்கிறது.

# image_animation_enable
source: Enable image animation (Wastes a lot of battery)
ta: பட அனிமேசனை இயக்கவும் (நிறைய பேட்டரியை வீணாக்குகிறது)

# acct_sample
source: (sample)username@server
ta: (மாதிரி) பயனர்பெயர்@சேவையகம்

# mention_full_acct
source: Show mention as full acct (column reload required)
ta: முழு சட்டகை ஆகக் குறிப்பிடவும் (நெடுவரிசை மறுஏற்றம் தேவை)

# remote_profile_warning
source: Information on remote profile pages may not be displayed accurately. Press here to view the profile in web browser.
ta: தொலை சுயவிவர பக்கங்கள் பற்றிய தகவல்கள் துல்லியமாக காட்டப்படாது. வலை உலாவியில் சுயவிவரத்தைக் காண இங்கே அழுத்தவும்.

source: Public profile
ta: பொது சுயவிவரம்

# change_avatar
source: Change avatar icon
ta: அவதார் ஐகானை மாற்றவும்

# change_header
source: Change header image
ta: தலைப்பு படத்தை மாற்றவும்

source: Display name
ta: காட்சி பெயர்

source: Note
ta: குறிப்பு

source: URI
ta: யூரி

source: Title
ta: தலைப்பு

source: E-mail
ta: மின்னஞ்சல்

source: Description
ta: விவரம்

# description_long
source: Description (old Mastodon)
ta: விளக்கம் (பழைய மாச்டோடன்)

source: Version
ta: பதிப்பு

# instance_information_of
source: Server information of "%1$s"
ta: "%1$s" இன் சேவையக செய்தி

# instance_information
source: Server information
ta: சேவையக செய்தி

# missing_mail_app
source: Missing e-mail app.
ta: மின்னஞ்சல் பயன்பாட்டைக் காணவில்லை.

# relative_timestamp
source: Show relative timestamps
ta: உறவினர் நேர முத்திரைகளைக் காட்டு

# time_within_second
source: just now
ta: இப்போது

# relative_time_unit_second1
source: second
ta: இரண்டாவது

# relative_time_unit_seconds
source: seconds
ta: நொடிகள்

# relative_time_unit_minute1
source: minute
ta: நிமிடங்கள்

# relative_time_unit_minutes
source: minutes
ta: நிமிடங்கள்

# relative_time_unit_hour1
source: hour
ta: மணி

# relative_time_unit_hours
source: hours
ta: மணி

# relative_time_unit_day1
source: day
ta: நாள்

# relative_time_unit_days
source: days
ta: நாட்கள்

# relative_time_phrase_future
source: %1$d %2$s later
ta: %1$d %2$s க்குப் பிறகு

# notification_channel_description
source: This setting is used to adjust notification for %1$s
ta: இந்த அமைப்பு %1$s க்கான அறிவிப்பை சரிசெய்ய பயன்படுத்தப்படுகிறது

# notification_style_after_oreo
source: Notification style
ta: அறிவிப்பு நடை

# notification_for
source: Notification for %1$s
ta: %1$s க்கான அறிவிப்பு

# enquete_was_end
source: Enquete ended.
ta: முடிந்தது.

# enquete_voted
source: Voted.
ta: வாக்களித்தார்.

# enquete_vote_failed
source: Could not vote. %1$s
ta: வாக்களிக்க முடியவில்லை. %1$s

source: choice 1
ta: தேர்வு 1

source: choice 2
ta: தேர்வு 2

# choice3
source: choice 3 (optional)
ta: தேர்வு 3 (விரும்பினால்)

# choice4
source: choice 4 (optional)
ta: தேர்வு 4 (விரும்பினால்)

source: Make enquete
ta: என்குவலை உருவாக்குங்கள்

# dont_use_action_button_with_quick_toot_bar
source: Disable IME Action button when using "Quick Post" bar (app restart required)
ta: "விரைவான இடுகை" பட்டியைப் பயன்படுத்தும் போது IME செயல் பொத்தானை முடக்கு (பயன்பாட்டு மறுதொடக்கம் தேவை)

# auto_cw
source: Auto hide long text (by setting "line counts" greater than 0. app restart required)
ta: தானாக மறை நீண்ட உரை (0 ஐ விட அதிகமாக "வரி எண்ணிக்கைகள்" அமைப்பதன் மூலம். பயன்பாட்டு மறுதொடக்கம் தேவை)

# auto_cw_prefix
source: (Auto CW)
ta: (ஆட்டோ சி.டபிள்யூ)

# enquete_item_is_empty
source: Enquete choice %1$d is empty.
ta: Enquete தேர்வு %1$d காலியாக உள்ளது.

# enquete_item_too_long
source: Enquete choice %1$d is too long. Please decrease by %2$d character(s).
ta: Enquete தேர்வு %1$d மிக நீளமானது. தயவுசெய்து %2$d எழுத்து (கள்) குறைகிறது.

# enquete_item_duplicate
source: Enquete choice %1$d is a duplicate of another choice.
ta: Enquete தேர்வு %1$d என்பது மற்றொரு தேர்வின் நகல்.

# profile_pin
source: Pin on profile
ta: சுயவிவரத்தில் முள்

# profile_unpin
source: Unpin from profile
ta: சுயவிவரத்திலிருந்து அவிழ்த்து விடுங்கள்

# profile_pin_progress
source: Changing pinned status…
ta: பின் நிலையை மாற்றுதல்…

# length_warning
source: "%1$s" is too long (%2$d/%3$d characters). It is not acceptable in the standard server, but it may be acceptable in some servers. Are you sure?
ta: "%1$s" மிக நீளமானது (%2$d/%3$d எழுத்துக்கள்). இது நிலையான சேவையகத்தில் ஏற்றுக்கொள்ளப்படாது, ஆனால் சில சேவையகங்களில் இது ஏற்றுக்கொள்ளப்படலாம். நீங்கள் உறுதியாக இருக்கிறீர்களா?

# short_acct_local_user
source: Short acct for local user (app restart required)
ta: உள்ளக பயனருக்கான குறுகிய ACCT (பயன்பாட்டு மறுதொடக்கம் தேவை)

# loading_notification_title
source: Loading notification…
ta: அறிவிப்பை ஏற்றுகிறது…

# error_notification_title
source: Server timeout
ta: சேவையக நேரம் முடிந்தது

# error_notification_summary
source: If on a destructed server, please remove its account from app.
ta: அழிக்கப்பட்ட சேவையகத்தில் இருந்தால், தயவுசெய்து அதன் கணக்கை பயன்பாட்டிலிருந்து அகற்றவும்.

source: Open hashtag column
ta: திறந்த ஏச்டேக் நெடுவரிசை

# quote_hashtag_of
source: Quote the hashtag "%1$s"
ta: "%1$s" என்ற ஏச்டேக்கை மேற்கோள் காட்டுங்கள்

# quote_all_hashtag_of
source: Quote all hashtags "%1$s"
ta: அனைத்து ஏச்டேக்குகளையும் "%1$s"

source: Parsing response…
ta: பாகுபடுத்தும் பதில்…

# video_pick
source: Pick video
ta: வீடியோவைத் தேர்ந்தெடுங்கள்

source: Already followed.
ta: ஏற்கனவே பின்பற்றப்பட்டது.

# cant_get_web_setting_visibility
source: Can't get visibility setting in web app.
ta: வலை பயன்பாட்டில் தெரிவுநிலை அமைப்பைப் பெற முடியாது.

# mastodon_1_6_later
source: Mastodon 1.6 or later
ta: மாச்டோடன் 1.6 அல்லது அதற்குப் பிறகு

# user_count
source: Users
ta: பயனர்கள்

# toot_count
source: Posts
ta: இடுகைகள்

# domain_count
source: Connected domain count
ta: இணைக்கப்பட்ட டொமைன் எண்ணிக்கை

# not_provided_mastodon_under_1_6
source: Not provided pre Mastodon 1.6
ta: முன் மாச்டோடன் 1.6 வழங்கப்படவில்லை

# mime_type_missing
source: Missing media MIME type.
ta: மீடியா மைம் வகை காணவில்லை.

# mime_type_not_acceptable
source: The media MIME type %1$s is not accepted.
ta: மீடியா மைம் வகை %1$s ஏற்றுக்கொள்ளப்படவில்லை.

# dont_show_timeout
source: Don't show "Server timeout" notification
ta: "சேவையக நேரம் முடிந்தது" அறிவிப்பைக் காட்ட வேண்டாம்

# emoji_category_people
source: People
ta: மக்கள்

# emoji_category_nature
source: Nature
ta: இயற்கை

# emoji_category_foods
source: Foods
ta: உணவுகள்

# emoji_category_activity
source: Activity
ta: செய்கைப்பாடு

# emoji_category_places
source: Places
ta: இடங்கள்

# emoji_category_objects
source: Objects
ta: பொருள்கள்

# emoji_category_symbols
source: Symbols
ta: குறியிடுகள்

# emoji_category_flags
source: Flags
ta: கொடிகள்

# emoji_category_others
source: Others
ta: மற்றவர்கள்

# emoji_category_custom
source: Custom
ta: தனிப்பயன்

# emoji_category_recent
source: Recent
ta: அண்மைக் கால

# open_picker_emoji
source: Emoji picker…
ta: ஈமோசி பிக்கர்…

# open_picker_tag
source: Hashtag picker…
ta: ஏச்டேக் பிக்கர்…

# open_picker_mention
source: Mention picker…
ta: பிக்கரைக் குறிப்பிடவும்…

# skin_tone_light
source: light skin tone
ta: ஒளி தோல் தொனி

# skin_tone_medium_light
source: medium light skin tone
ta: நடுத்தர ஒளி தோல் தொனி

# skin_tone_medium
source: medium skin tone
ta: நடுத்தர தோல் தொனி

# skin_tone_medium_dark
source: medium dark skin tone
ta: நடுத்தர இருண்ட தோல் தொனி

# skin_tone_dark
source: dark skin tone
ta: இருண்ட தோல் தொனி

# disable_custom_emoji_animation
source: Disable custom Emoji animation (app restart and column reload required)
ta: தனிப்பயன் ஈமோசி அனிமேசனை முடக்கு (பயன்பாட்டு மறுதொடக்கம் மற்றும் நெடுவரிசை மறுஏற்றம் தேவை)

# card_header_card
source: Card
ta: அட்டை

# card_header_author
source: Author
ta: நூலாசிரியர்

# card_header_provider
source: Provider
ta: வழங்குநர்

# allow_non_space_before_emoji_code
source: Allow non-space character before emoji shortcode (Affect to display and post. to set display, please restart app and reload column. The emojis converted at posting can't be restored to shortcode.)
ta: ஈமோசி குறுக்குவழிக்கு முன் விண்வெளி அல்லாத எழுத்தை அனுமதிக்கவும் (காட்சியைக் காண்பிப்பதற்கும் இடுகையிடுவதற்கும் பாதிக்கப்படுகிறது. காட்சியை அமைக்க, தயவுசெய்து பயன்பாட்டை மறுதொடக்கம் செய்து நெடுவரிசையை மீண்டும் ஏற்றவும். இடுகையில் மாற்றப்பட்ட ஈமோசிகளை குறுக்குவழிக்கு மீட்டெடுக்க முடியாது.)

source: Emoji
ta: ஈமோசி

source: Not blocked.
ta: தடுக்கப்படவில்லை.

source: Not muted.
ta: முடக்கப்படவில்லை.

# media_description
source: (attachment %1$d) %2$s
ta: (இணைப்பு %1$d) %2$s

source: set description
ta: விளக்கத்தை அமைக்கவும்

# attachment_description_cant_edit_while_uploading
source: Attachment description can't be edit while uploading.
ta: இணைப்பு விளக்கத்தை பதிவேற்றும்போது திருத்த முடியாது.

source: attachment description
ta: இணைப்பு விளக்கம்

# description_empty
source: description is not specified.
ta: விளக்கம் குறிப்பிடப்படவில்லை.

# attachment_description_sending
source: sending attachment description…
ta: இணைப்பு விளக்கத்தை அனுப்புகிறது…

# hide_boost_in_home
source: Hide boosts by this user from your home TL
ta: உங்கள் வீட்டிலிருந்து இந்த பயனரின் ஊக்கங்களை மறைக்கவும்

# show_boost_in_home
source: Show boosts by this user from your home TL
ta: உங்கள் வீட்டிலிருந்து இந்த பயனரின் ஊக்கங்களைக் காட்டு

# operation_succeeded
source: Done.
ta: முடிந்தது.

# list_member_add_remove
source: Add/remove from lists…
ta: பட்டியல்களிலிருந்து சேர்க்க/அகற்று…

source: Lists
ta: பட்டியல்கள்

# list_show_member
source: show list users
ta: பட்டியல் பயனர்களைக் காட்டு

# list_show_timeline
source: show list TL
ta: பட்டியலைக் காட்டு tl

# list_member_of
source: "%1$s" list users
ta: "%1$s" பட்டியல் பயனர்கள்

# list_tl_of
source: "%1$s" list
ta: "%1$s" பட்டியல்

# list_create_hint
source: name of new list
ta: புதிய பட்டியலின் பெயர்

# list_name_empty
source: please input name of new list.
ta: புதிய பட்டியலின் பெயரை உள்ளிடவும்.

# list_created
source: new list created.
ta: புதிய பட்டியல் உருவாக்கப்பட்டது.

# list_delete_confirm
source: Delete the list "%1$s"?
ta: "%1$s" பட்டியலை நீக்கவா?

# list_member
source: List users
ta: பயனர்களை பட்டியலிடுங்கள்

source: List timeline
ta: காலவரிசை பட்டியல்

# list_member_delete_confirm
source: Delete the list member "%1$s" from list "%2$s"?
ta: பட்டியல் உறுப்பினரை "%1$s" பட்டியலில் இருந்து நீக்கவா?

source: Target user
ta: இலக்கு பயனர்

source: List owner
ta: பட்டியல் உரிமையாளர்

# list_create
source: New list…
ta: புதிய பட்டியல்…

source: List
ta: பட்டியல்

# list_not_supported
source: Lists is not supported on this server.
ta: இந்த சேவையகத்தில் பட்டியல்கள் ஆதரிக்கப்படவில்லை.

# cant_access_list
source: Can't access to lists
ta: பட்டியல்களை அணுக முடியாது

# account_sync_failed
source: Could not sync account.
ta: கணக்கை ஒத்திசைக்க முடியவில்லை.

# list_retry_with_follow
source: You are not following %1$s yet. Would you like to follow and then add to list?
ta: நீங்கள் இன்னும் %1$s ஐப் பின்பற்றவில்லை. நீங்கள் பின்தொடர விரும்புகிறீர்களா, பின்னர் பட்டியலில் சேர்க்க விரும்புகிறீர்களா?
