Repository: 247i/TACETr
Catalog: உரை/தானி/subway-tooter-strings-*.po
Languages: ta

# cant_add_list_follow_requesting
source: Can't add user to list: Please retry 2,3 times. Or if user is "locked", please wait until for approval of follow request.
ta: பட்டியலில் பயனரைச் சேர்க்க முடியாது: தயவுசெய்து 2,3 முறை மீண்டும் முயற்சிக்கவும். அல்லது பயனர் "பூட்டப்பட்டிருந்தால்" என்றால், பின்தொடர் கோரிக்கையின் ஒப்புதலுக்காக காத்திருக்கவும்.

# cant_add_list_follow_failed
source: Can't add user to list: follow operation failed.
ta: பட்டியலில் பயனரைச் சேர்க்க முடியாது: செயல்பாட்டைப் பின்தொடரவும் தோல்வியடைந்தது.

# list_member_added
source: Added.
ta: சேர்க்கப்பட்டது.

# confirm_mute_notification_for_user
source: Mute notifications from this user
ta: இந்த பயனரிடமிருந்து முடக்கு அறிவிப்புகள்

# account_moved_to
source: %1$s has moved to:
ta: %1$s இதற்கு நகர்ந்தது:

# jump_moved_user
source: %1$s has been moved. Would you like to check %2$s ?
ta: %1$s நகர்த்தப்பட்டுள்ளன. %2$s ஐ சரிபார்க்க விரும்புகிறீர்களா?

source: ignore suggestion
ta: ஆலோசனையை புறக்கணிக்கவும்

# list_not_created
source: (list is not created)
ta: (பட்டியல் உருவாக்கப்படவில்லை)

source: Your lists
ta: உங்கள் பட்டியல்கள்

# media_attachment_max_byte_size
source: Media attachment (image) bytes size limit (Unit:MB. The default is 8)
ta: மீடியா இணைப்பு (படம்) பைட்டுகள் அளவு வரம்பு (அலகு: எம்பி. இயல்புநிலை 8)

# media_attachment_max_byte_size_movie
source: Media attachment (movie) bytes size limit (Unit:MB. The default is 40)
ta: மீடியா இணைப்பு (மூவி) பைட்டுகளின் அளவு வரம்பு (அலகு: எம்பி. இயல்புநிலை 40)

# media_attachment_max_byte_size_pixelfed
source: Media attachment (Pixelfed) bytes size limit (Unit:MB. The default is 15)
ta: மீடியா இணைப்பு (பிக்செல்ஃப்) பைட்டுகள் அளவு வரம்பு (அலகு: எம்பி. இயல்புநிலை 15)

# tootsearch
source: tootsearch (JP)
ta: டூட்சாச் (சே.பி.)

# cant_handle_uri_of
source: Subway Tooter can't handle URI "%1$s". Please select other app.
ta: சுரங்கப்பாதை டூட்டர் யூரி "%1$s" ஐ கையாள முடியாது. பிற பயன்பாட்டைத் தேர்ந்தெடுக்கவும்.

# use_internal_media_viewer
source: Use built-in media viewer
ta: உள்ளமைக்கப்பட்ட ஊடக பார்வையாளரைப் பயன்படுத்தவும்

source: Previous
ta: முந்தைய

source: Next
ta: அடுத்தது

source: Download
ta: பதிவிறக்கம்

source: Downloading…
ta: பதிவிறக்கம்…

# url_is_copied
source: URL copied to clipboard
ta: முகவரி இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது

# download_complete
source: Downloaded. %1$s
ta: பதிவிறக்கம். %1$s

# download_failed
source: Download failed. %1$s
ta: பதிவிறக்கம் தோல்வியடைந்தது. %1$s

# open_browser_of
source: Open "%1$s" in browser
ta: உலாவியில் "%1$s" ஐத் திறக்கவும்

source: Open in browser
ta: உலாவியில் திற

source: Share URL
ta: முகவரி ஐப் பகிரவும்

# share_url_more
source: Share URL…
ta: பகிர்வு URL…

# copy_url
source: Copy URL to clipboard
ta: இடைநிலைப்பலகைக்கு முகவரி ஐ நகலெடுக்கவும்

# media_attachment_empty
source: Missing media attachments.
ta: ஊடக இணைப்புகளைக் காணவில்லை.

# media_attachment_type_error
source: The type of media attachment is "%1$s". ST can't handle it, but you can try open in browser.
ta: மீடியா இணைப்பு வகை "%1$s" ஆகும். செயின்ட் அதைக் கையாள முடியாது, ஆனால் நீங்கள் உலாவியில் திறக்க முயற்சி செய்யலாம்.

# video_buffering
source: Buffering…
ta: இடையக…

# dont_repeat_download_to_same_url
source: Can't repeat downloading same URL in a few seconds.
ta: சில நொடிகளில் அதே முகவரி ஐ பதிவிறக்குவதை மீண்டும் செய்ய முடியாது.

# zooming_of_resized
source: (%4$d/%5$d) ×%3$.1f %1$d×%2$d (original %6$d×%7$d)
ta: (%4 $ d/%5 $ d) ×%3 $ .1f %1$d ×%2$d (அசல்%6 $ டி ×%7 $ D)

# media_attachment_still_uploading
source: Still uploading media.
ta: இன்னும் ஊடகங்களை பதிவேற்றுகிறது.

# highlight_word
source: Highlight keyword
ta: முக்கிய சொல்லை முன்னிலைப்படுத்தவும்

source: New item…
ta: புதிய உருப்படி…

# word_empty
source: Please input keyword.
ta: முக்கிய சொல்லை உள்ளிடவும்.

source: already exist.
ta: ஏற்கனவே உள்ளது.

# highlight_desc
source: Swipe leftwards to delete. You may need reload the check whether it is set.
ta: நீக்க இடதுபுறமாக ச்வைப் செய்யவும். காசோலை அமைக்கப்பட்டிருக்கிறதா என்பதை மீண்டும் ஏற்றலாம்.

# check_sound
source: Play notification sound
ta: அறிவிப்பு ஒலி விளையாடுங்கள்

source: Keyword
ta: முக்கிய சொல்

# domain_block_from_pseudo
source: Can't use domain block from pseudo account.
ta: போலி கணக்கிலிருந்து டொமைன் தொகுதியைப் பயன்படுத்த முடியாது.

# domain_block_from_local
source: Can't use domain block for your server.
ta: உங்கள் சேவையகத்திற்கு டொமைன் தொகுதியைப் பயன்படுத்த முடியாது.

# always_show_application
source: Show (via) application name if possible
ta: முடிந்தால் (வழியாக) பயன்பாட்டு பெயரைக் காட்டு

# force_gap_when_refresh
source: Force adding gap when refreshing top
ta: மேல் புத்துணர்ச்சியூட்டும் போது இடைவெளியைச் சேர்க்க கட்டாயப்படுத்துங்கள்

# avatar_icon_size
source: Avatar icon size (Unit:dp. default:48. app restart required)
ta: அவதார் படவுரு அளவு (அலகு: டிபி. இயல்புநிலை: 48. பயன்பாட்டு மறுதொடக்கம் தேவை)

# avatar_icon_round_ratio
source: Avatar icon round ratio (Unit:%. default:33. app restart required)
ta: அவதார் படவுரு சுற்று விகிதம் (அலகு:%. இயல்புநிலை: 33. பயன்பாட்டு மறுதொடக்கம் தேவை)

# avatar_icon_dont_round
source: Don't round corner of avatar icon (app restart required)
ta: அவதார் ஐகானின் சுற்று மூலையில் வேண்டாம் (பயன்பாட்டு மறுதொடக்கம் தேவை)

# share_view_pool
source: Share view pool between columns
ta: நெடுவரிசைகளுக்கு இடையில் காட்சி குளம் பகிரவும்

source: Rename…
ta: மறுபெயரிடுங்கள்…

source: Allow column duplication
ta: நெடுவரிசை நகல் அனுமதிக்கவும்

# system_notification_not_related
source: Not chosen when tapping system notification
ta: கணினி அறிவிப்பைத் தட்டும்போது தேர்வு செய்யப்படவில்லை

# notification_type_mention
source: mention
ta: குறிப்பு

# notification_type_follow
source: follow
ta: பின்தொடர்

# notification_type_boost
source: boost
ta: பூச்ட்

# notification_type_reaction
source: reaction
ta: எதிர்வினை

# notification_type_vote
source: vote
ta: வாக்களிக்கவும்

# notification_type_post
source: post
ta: இடுகை

# notification_type_update
source: post update
ta: புதுப்பிப்பு இடுகை

# notification_type_status_reference
source: post referenced
ta: இடுகை குறிப்பிடப்பட்டுள்ளது

# notification_type_status_reference_fedibird
source: post referenced (fedibird.com)
ta: இடுகை குறிப்பிடப்பட்டுள்ளது (fedibird.com)

# notification_type_signup
source: (admin)user signup
ta: (நிர்வாகி) பயனர் பதிவுபெறுதல்

# notification_type_report
source: (admin)report
ta: (நிர்வாகி) அறிக்கை

# dont_show_normal_toot
source: Don't show normal posts
ta: சாதாரண இடுகைகளைக் காட்ட வேண்டாம்

# dont_show_non_public_toot
source: Don't show non-public posts
ta: பொது அல்லாத இடுகைகளைக் காட்ட வேண்டாம்

# set_focus_point
source: set focus point (Mastodon 2.3+)
ta: கவனம் புள்ளியை அமைக்கவும் (மாச்டோடன் 2.3+)

# report_forward_to
source: The user belongs to server %1$s. Forward anonymoused copy of this report to that server?
ta: பயனர் சேவையக %1$s க்கு சொந்தமானது. இந்த அறிக்கையின் அநாமதேய நகலை அந்த சேவையகத்திற்கு அனுப்பவா?

source: Locked account
ta: பூட்டப்பட்ட கணக்கு

# contact
source: contact account
ta: தொடர்பு கணக்கு

source: languages
ta: மொழிகள்

# append_attachment_url_to_content
source: Append attachment URL to content text
ta: உள்ளடக்க உரையில் இணைப்பு முகவரி ஐ சேர்க்கவும்

# hide_favourite_notification_from_user
source: Disable Fav/BT notifications from this user
ta: இந்த பயனரிடமிருந்து FAV/BT அறிவிப்புகளை முடக்கு

# show_favourite_notification_from_user
source: Enable Fav/BT notifications from this user
ta: இந்த பயனரிடமிருந்து FAV/BT அறிவிப்புகளை இயக்கவும்

# fav_muted_user
source: FBN disabled users
ta: FBN ஊனமுற்ற பயனர்கள்

# fav_muted_user_long
source: Fav/Boost notifications disabled users
ta: FAV/பூச்ட் அறிவிப்புகள் ஊனமுற்ற பயனர்கள்

# fav_muted_user_desc
source: Ignore notifications from users on this list. Favourite, Boost, Follow Request, Reaction, etc.
ta: இந்த பட்டியலில் பயனர்களிடமிருந்து அறிவிப்புகளை புறக்கணிக்கவும். பிடித்த, பூச்ட், கோரிக்கை, எதிர்வினை போன்றவற்றைப் பின்பற்றுங்கள்.

source: Changed.
ta: மாற்றப்பட்டது.

# thumbnails_arrange_vertically
source: Vertical arrange thumbnails (app restart required)
ta: செங்குத்து ஏற்பாடு சிறு உருவங்கள் (பயன்பாட்டு மறுதொடக்கம் தேவை)

# instance_local
source: Server local
ta: உள்ளக சேவையகம்

# pull_notification_check_interval
source: Pull notification check interval (Unit: minutes, default:15, min:15)
ta: அறிவிப்பு சோதனை இடைவெளியை இழுக்கவும் (அலகு: நிமிடங்கள், இயல்புநிலை: 15, நிமிடம்: 15)

# follow_accept
source: accept
ta: ஏற்றுக்கொள்

# follow_deny
source: deny
ta: மறுக்கவும்

# follow_accept_confirm
source: Approve follow request from %1$s?
ta: %1$s இலிருந்து கோரிக்கையைப் பின்பற்றவா?

# follow_deny_confirm
source: Reject follow request from %1$s?
ta: %1$s இலிருந்து கோரிக்கையைப் பின்பற்றவா?

source: Direct messages
ta: நேரடி செய்திகள்

source: Unfavourite
ta: விடுதலை

source: Unboost
ta: பூச்ட்

source: Don't retrieve preview card
ta: முன்னோட்ட அட்டையை மீட்டெடுக்க வேண்டாம்

# field_name1
source: label1
ta: சிட்டை 1

# field_name2
source: label2
ta: சிட்டை 2

# field_name3
source: label3
ta: விழுங்க

# field_name4
source: label4
ta: சிட்டை 4

# field_value1
source: value1
ta: மதிப்பு 1

# field_value2
source: value2
ta: மதிப்பு 2

# field_value3
source: value3
ta: மதிப்பு 3

# field_value4
source: value4
ta: மதிப்பு 4

source: Profile metadata
ta: சுயவிவர மேனிலை தரவு

# available_mastodon_2_4_later
source: (available in Mastodon 2.4+)
ta: (மாச்டோடன் 2.4+ இல் கிடைக்கிறது)

# confirm_boost_private_from
source: Boost private status from %1$s ? It's shown to all followers.
ta: %1$s இலிருந்து தனியார் நிலையை அதிகரிக்கவா? இது அனைத்து பின்தொடர்பவர்களுக்கும் காட்டப்பட்டுள்ளது.

# boost_private_toot_not_allowed
source: Private post can not be boost by another person.
ta: தனியார் பதவியை மற்றொரு நபரால் உயர்த்த முடியாது.

source: Update push subscription
ta: புச் சந்தாவைப் புதுப்பிக்கவும்

# pseudo_account_not_supported
source: Pseudo accounts can't use notifications.
ta: போலி கணக்குகள் அறிவிப்புகளைப் பயன்படுத்த முடியாது.

# instance_does_not_support_push_api
source: Push subscription is not supported on this server (version %1$s).
ta: இந்த சேவையகத்தில் புச் சந்தா ஆதரிக்கப்படவில்லை (பதிப்பு %1$s).

# missing_fcm_device_id
source: Can't prepare FCM device ID. Please try again later.
ta: FCM சாதன ஐடியை தயாரிக்க முடியாது. தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும்.

# missing_install_id
source: Can't prepare install ID. Please try again later.
ta: நிறுவ ஐடியைத் தயாரிக்க முடியாது. தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும்.

# token_exported
source: Due to exporting application data or restoring from backup, this access token may be used by other devices as well. Because access tokens that are not used by other devices are required to use push notifications, we recommend updating the access token.
ta: பயன்பாட்டுத் தரவை ஏற்றுமதி செய்வதன் காரணமாக அல்லது காப்புப்பிரதியில் இருந்து மீட்டமைப்பதன் காரணமாக, இந்த அணுகல் கிள்ளாக்கு பிற சாதனங்களாலும் பயன்படுத்தப்படலாம். மற்ற சாதனங்களால் பயன்படுத்தப்படாத டோக்கன்கள் புச் அறிவிப்புகளைப் பயன்படுத்த வேண்டியிருப்பதால், அணுகல் கிள்ளாக்கைப் புதுப்பிக்க பரிந்துரைக்கிறோம்.

# missing_push_api
source: This server has no push subscription API.
ta: இந்த சேவையகத்தில் புச் சந்தா பநிஇ இல்லை.

# missing_push_scope
source: Your access token does not contains push scope. updating access token is recommended.
ta: உங்கள் அணுகல் டோக்கனில் புச் நோக்கம் இல்லை. அணுகல் கிள்ளாக்கைப் புதுப்பித்தல் பரிந்துரைக்கப்படுகிறது.

source: Push subscription deleted.
ta: புச் சந்தா நீக்கப்பட்டது.

source: Push subscription updated.
ta: சந்தா புதுப்பிக்கப்பட்டது.

# push_subscription_not_exists
source: Push subscription not required.
ta: புச் சந்தா தேவையில்லை.

# push_subscription_already_exists
source: Push subscription up to date.
ta: சந்தாவை புதுப்பித்த நிலையில் தள்ளுங்கள்.

# user_agent
source: User-Agent HTTP header
ta: பயனர் முகவர் http தலைப்பு

# user_agent_error
source: User-Agent can't contains NON-ASCII characters. [%1$s]
ta: பயனர்-முகவர் ASCII அல்லாத எழுத்துக்களைக் கொண்டிருக்க முடியாது. [%1$s]

# none_or_hidden_following
source: Not following anyone, or hidden by setting.
ta: யாரையும் பின்பற்றவில்லை, அல்லது அமைப்பதன் மூலம் மறைக்கப்படவில்லை.

# none_or_hidden_followers
source: No followers, or hidden by setting.
ta: பின்தொடர்பவர்கள் இல்லை, அல்லது அமைப்பதன் மூலம் மறைக்கப்படவில்லை.

# yourself_can_see_your_network
source: Even if you choose to hide social graphs, yourself can see it.
ta: சமூக வரைபடங்களை மறைக்க நீங்கள் தேர்வுசெய்தாலும், நீங்களே அதைப் பார்க்கலாம்.

# follow_follower_list_may_restrict
source: If the remote user choose to hide the social graph, only the followings/followers on this server will be displayed.
ta: தொலை பயனர் சமூக வரைபடத்தை மறைக்க தேர்வுசெய்தால், இந்த சேவையகத்தில் பின்வரும்/பின்தொடர்பவர்கள் மட்டுமே காண்பிக்கப்படும்.

# trend_tag
source: Trending tags
ta: டிரெண்டிங் குறிச்சொற்கள்

# trend_link
source: Trending links
ta: பிரபலமான இணைப்புகள்

# trend_post
source: Trending posts
ta: பிரபலமான இடுகைகள்

# people_talking
source: %1$d(%2$d) people talking
ta: %1$d (%2$d) மக்கள் பேசுகிறார்கள்

# trend_tag_desc
source: The numbers indicate 'daily(weekly)'.
ta: எண்கள் 'நாள்தோறும் (வாராந்திர)' என்பதைக் குறிக்கின்றன.

source: Redraft and delete
ta: மறுபிரவேசம் மற்றும் நீக்கு

# cant_sync_toot
source: Can't synchronize post.
ta: இடுகையை ஒத்திசைக்க முடியாது.

# cant_change_account_when_redraft
source: Can't change account while using redraft.
ta: ரெட்ராஃப்டைப் பயன்படுத்தும் போது கணக்கை மாற்ற முடியாது.

# cant_change_account_when_edit
source: Can't change account while edit the post.
ta: இடுகையைத் திருத்தும்போது கணக்கை மாற்ற முடியாது.

# delete_base_status_before_toot
source: Delete base status before posting. All of favourites/boosts will be lost. Replies will be disconnected. Media attachments will not kept on Mastodon pre-2.4.1 . Are you sure?
ta: இடுகையிடுவதற்கு முன் அடிப்படை நிலையை நீக்கு. பிடித்தவை/ஊக்கங்கள் அனைத்தும் இழக்கப்படும். பதில்கள் துண்டிக்கப்படும். ஊடக இணைப்புகள் மாச்டோடன் முன் -2.4.1 இல் வைக்கப்படாது. நீங்கள் உறுதியாக இருக்கிறீர்களா?

# notification_tl_font_size
source: Notification TL font size (Unit: sp. leave empty to default. app restart required) … …
ta: அறிவிப்பு TL எழுத்துரு அளவு (அலகு: எச்பி. இயல்புநிலைக்கு காலியாக விடவும். பயன்பாட்டு மறுதொடக்கம் தேவை) … …

# notification_tl_icon_size
source: Notification TL icon size (Unit:dp. default:24. app restart required)
ta: அறிவிப்பு TL படவுரு அளவு (அலகு: dp. இயல்புநிலை: 24. பயன்பாட்டு மறுதொடக்கம் தேவை)

# post_button_tapped_repeatly
source: Post button was tapped repeatedly
ta: போச்ட் பொத்தான் மீண்டும் மீண்டும் தட்டப்பட்டது

# regex_filter_matches_empty_string
source: Regex filter matches to empty string.
ta: ரீசெக்ச் வடிகட்டி வெற்று சரத்துடன் பொருந்துகிறது.

source: Follow suggestion
ta: ஆலோசனையைப் பின்பற்றவும்

source: Close all columns
ta: அனைத்து நெடுவரிசைகளையும் மூடு

# confirm_close_column_all
source: Really close all columns (exclude protected)?
ta: எல்லா நெடுவரிசைகளையும் உண்மையில் மூடு (பாதுகாக்கப்பட்டதை விலக்கவும்)?

source: Keyword filters
ta: முக்கிய வடிப்பான்கள்

source: Keyword filter
ta: முக்கிய வடிகட்டி

# keyword_filter_new
source: New filter
ta: புதிய வடிகட்டி

# keyword_filter_edit
source: Edit filter
ta: வடிகட்டியைத் திருத்து

# filter_delete_confirm
source: Delete the filter '%1$s'?
ta: '%1$s' வடிப்பானை நீக்கவா?

# filter_of
source: Filter '%1$s'
ta: '%1$s' ஐ வடிகட்டவும்

source: filtered
ta: வடிகட்டப்பட்டது

# filter_phrase
source: Phrase
ta: சொற்றொடர்

# filter_context
source: Filter contexts
ta: சூழல்களை வடிகட்டவும்

# filter_options
source: Options
ta: விருப்பங்கள்

# filter_irreversible
source: Irreversible
ta: மீளமுடியாத

# filter_irreversible_long
source: Irreversible. Drop instead of hide. Filtered posts will disappear irreversibly, even if the filter is removed later.
ta: மீளமுடியாத. மறைப்பதற்கு பதிலாக கைவிடவும். வடிகட்டி பின்னர் அகற்றப்பட்டாலும், வடிகட்டிய பதிவுகள் மாற்றமுடியாமல் மறைந்துவிடும்.

# filter_word_match
source: Whole word
ta: முழு சொல்

# filter_word_match_long
source: Whole word. Recommended to enable only phrases consisting of alphanumeric characters.
ta: முழு சொல். எண்ணெழுத்து எழுத்துக்களைக் கொண்ட சொற்றொடர்களை மட்டுமே இயக்க பரிந்துரைக்கப்படுகிறது.

# filter_expires_at
source: Expire
ta: காலாவதியாகுங்கள்

# filter_home
source: home
ta: வீடு

# filter_notification
source: notification
ta: அறிவிப்பு

# filter_public
source: public
ta: பொது

# filter_thread
source: conversation
ta: உரையாடல்

# filter_profile
source: profile
ta: சுயவிவரம்

source: Don't change
ta: மாற்ற வேண்டாம்

# filter_expire_unlimited
source: Unlimited
ta: வரம்பற்றது

# filter_expire_30min
source: 30 minutes after saving
ta: சேமித்த 30 நிமிடங்களுக்குப் பிறகு

# filter_expire_1hour
source: 1 hour after saving
ta: சேமித்த 1 மணி நேரம்

# filter_expire_6hour
source: 6 hours after saving
ta: சேமித்த 6 மணி நேரம்

# filter_expire_12hour
source: 12 hours after saving
ta: சேமித்த 12 மணி நேரம்

# filter_expire_1day
source: 1 day after saving
ta: சேமித்த 1 நாள்

# filter_expire_1week
source: 1 week after saving
ta: சேமித்த 1 வாரத்திற்குப் பிறகு

# scroll_top_from_column_strip
source: Scroll to top when tapping visible column in column strip
ta: நெடுவரிசை ச்ட்ரிப்பில் புலப்படும் நெடுவரிசையைத் தட்டும்போது மேலே உருட்டவும்

# delete_suggestion
source: Delete from follow suggestion…
ta: பின்தொடர் ஆலோசனையிலிருந்து நீக்கு…

# delete_succeeded_confirm
source: Remove the user "%1$s"from follow suggestion?
ta: பின்தொடர்தல் ஆலோசனையிலிருந்து பயனரை "%1$s" ஐ அகற்றவா?

# toot_context_parse_failed
source: Could not parse conversation.
ta: உரையாடலை அலச முடியவில்லை.

# toot_default_text
source: Default text when composing post. (Does not affect to quick post bar, nor switching account in toot composition screen)
ta: இடுகையை உருவாக்கும் போது இயல்புநிலை உரை. (விரைவான போச்ட் பட்டியை பாதிக்காது, அல்லது கணக்கை டூட் கலவை திரையில் மாற்றாது)

source: List divider color
ta: வகுப்பி வண்ணத்தை பட்டியலிடுங்கள்

# display_replies_count
source: Show replies count
ta: பதில்களைக் காட்டு எண்ணிக்கை

# display_boost_count
source: Show boosts count
ta: காட்டு எண்ணிக்கையை காட்டு

# display_favourite_count
source: Show favourites count
ta: பிடித்தவை எண்ணிக்கையைக் காட்டு

# replies_count_actual
source: Actual
ta: உண்மையான

# replies_count_none
source: None
ta: எதுவுமில்லை

# missing_available_account
source: There is no account available for this purpose.
ta: இந்த நோக்கத்திற்காக கணக்கு எதுவும் கிடைக்கவில்லை.

# misskey_account_not_supported
source: Misskey account is not supported.
ta: மிச்கி கணக்கு ஆதரிக்கப்படவில்லை.

# misskey_cant_show_all_descendants
source: In Misskey, only direct replies to target note are enumerated. Not all descendants can be displayed.
ta: மிச்கியில், இலக்கு குறிப்புக்கான நேரடி பதில்கள் மட்டுமே கணக்கிடப்படுகின்றன. எல்லா சந்ததியினரையும் காட்ட முடியாது.

# cant_get_misskey_app_secret
source: This Misskey server does not provide app secret in the response of /api/app/create API. Please consider updating the Misskey service version to server admin.
ta: இந்த மிச்கி சேவையகம்/API/APP/API இன் பதிலில் பயன்பாட்டு ரகசியத்தை வழங்காது. சேவையக நிர்வாகிக்கு மிச்கி பணி பதிப்பைப் புதுப்பிப்பதைக் கவனியுங்கள்.

# visibility_style
source: <![CDATA[Visibility name & icon]]>
ta: <! [CDATA [தெரிவுநிலை பெயர் & ஐகான்]]>

# visibility_style_by_account
source: Fit to column account
ta: நெடுவரிசை கணக்கிற்கு பொருந்தும்

source: Mastodon
ta: மாச்டோடன்

source: Misskey
ta: மிச்கி

# visibility_home
source: Home
ta: வீடு

# visibility_followers
source: Followers
ta: பின்தொடர்பவர்கள்

# vote_count_text
source: %1$d votes
ta: % 1 $ டி வாக்குகள்

# reaction_add
source: Add reaction
ta: எதிர்வினை சேர்க்கவும்

# reaction_remove
source: Remove reaction
ta: எதிர்வினையை அகற்று

# unknown_notification_from
source: unknown notification from %1$s
ta: %1$s இலிருந்து அறியப்படாத அறிவிப்பு

source: Don't show reaction
ta: எதிர்வினை காட்ட வேண்டாம்

# dont_show_vote
source: Don't show enquete
ta: என்கெட்டைக் காட்ட வேண்டாம்

# boost_button_size
source: Boost button size (Unit:dp, default=40, app restart required)
ta: பூச்ட் பொத்தான் அளவு (அலகு: டிபி, இயல்புநிலை = 40, பயன்பாட்டு மறுதொடக்கம் தேவை)

# boost_button_alignment
source: Boost button alignment (app restart required)
ta: பூச்ட் பொத்தான் சீரமைப்பு (பயன்பாட்டு மறுதொடக்கம் தேவை)

source: Start
ta: தொடங்கு

source: Center
ta: நடுவண்

source: End
ta: முடிவு

# misskey_hybrid_timeline
source: Social timeline
ta: சமூக காலவரிசை

# misskey_hybrid_timeline_long
source: Social TL (Misskey)
ta: சமூக டி.எல் (மிச்கி)

# renote_to
source: Renote to %1$s
ta: ரிமோட் டு %1$s

# quote_to
source: Quote to %1$s
ta: %1$s க்கு மேற்கோள்

# reply_to
source: Reply to %1$s
ta: %1$s க்கு பதில்

# deleted_at
source: deleted at %1$s
ta: %1$s இல் நீக்கப்பட்டது

# already_reactioned
source: already reacted to.
ta: ஏற்கனவே எதிர்வினையாற்றியது.

# not_reactioned
source: not yet reacted to.
ta: இன்னும் எதிர்வினையாற்றவில்லை.

source: 'Unlisted' visibility
ta: 'பட்டியலிடப்படாத' தெரிவுநிலை

source: 'Followers' visibility
ta: 'பின்தொடர்பவர்களின் தெரிவுநிலை

# direct_with_user_visibility
source: 'Direct to users' visibility
ta: 'பயனர்களின் தெரிவுநிலைக்கு நேரடியாக

source: 'Direct only me' visibility
ta: 'எனக்கு மட்டும் என்னை' தெரிவுநிலை

source: Already voted.
ta: ஏற்கனவே வாக்களித்தார்.

# endorse_set
source: Endorse in your profile
ta: உங்கள் சுயவிவரத்தில் ஒப்புதல் அளிக்கவும்

# endorse_unset
source: Remove endorsement in your profile
ta: உங்கள் சுயவிவரத்தில் ஒப்புதலை அகற்று

# endorse_succeeded
source: Endorsed.
ta: ஒப்புதல்.

source: Follow request cancelled.
ta: கோரிக்கையைப் பின்பற்றவும் ரத்து செய்யப்பட்டது.

# confirm_cancel_follow_request_who_from
source: Cancel follow request from %2$s to %1$s?
ta: ரத்துசெய் %2$s முதல் %1$s வரை கோரிக்கையைப் பின்தொடரவும்?

source: Reaction
ta: எதிர்வினை

# vote_polls
source: voting or its result
ta: வாக்களிப்பு அல்லது அதன் முடிவு

# timeout_for_embed_media_viewer
source: Timeout for embedded media viewer (Unit:seconds, app restart(delete from app history) required)
ta: உட்பொதிக்கப்பட்ட மீடியா பார்வையாளருக்கான நேரம் முடிந்தது (அலகு: விநாடிகள், பயன்பாட்டு மறுதொடக்கம் (பயன்பாட்டு வரலாற்றிலிருந்து நீக்குதல்) தேவை)

# timeout_for_server_api
source: Timeout for server API(Unit:seconds, app restart(delete from app history) required)
ta: சேவையக பநிஇ க்கான நேரம் முடிந்தது (அலகு: விநாடிகள், பயன்பாட்டு மறுதொடக்கம் (பயன்பாட்டு வரலாற்றிலிருந்து நீக்குதல்) தேவை)

# link_color
source: Link color (app restart required)
ta: இணைப்பு நிறம் (பயன்பாட்டு மறுதொடக்கம் தேவை)

# missing_closeable_column
source: Missing closeable column in visible range.
ta: புலப்படும் வரம்பில் மூடக்கூடிய நெடுவரிசையை காணவில்லை.

# dont_use_custom_tabs
source: Don't use (Chrome/Firefox) "Custom Tabs" when opening links
ta: இணைப்புகளைத் திறக்கும்போது (Chrome/Firefox) "தனிப்பயன் தாவல்கள்" பயன்படுத்த வேண்டாம்

source: Privacy policy
ta: தனியுரிமைக் கொள்கை

# agree
source: I agree
ta: நான் ஒப்புக்கொள்கிறேன்

# ltl_around_toot
source: Local TL around the post
ta: இடுகையைச் சுற்றி உள்ளக டி.எல்

# ltl_around
source: Local timeline around…
ta: சுற்றி உள்ளக காலவரிசை…

# ltl_around_of
source: Local timeline around %1$s
ta: உள்ளக காலவரிசை சுமார் 1 $ s

# ftl_around_toot
source: Federated TL around the post
ta: இடுகையைச் சுற்றி கூட்டாட்சி டி.எல்

# ftl_around
source: Federated timeline around…
ta: கூட்டாட்சி காலவரிசை…

# ftl_around_of
source: Federated timeline around %1$s
ta: கூட்டாட்சி காலவரிசை %1$s

# account_tl_around_toot
source: Account TL around the post
ta: இடுகையைச் சுற்றி கணக்கு

# account_tl_around
source: Account timeline around…
ta: கணக்கு காலவரிசை…

# account_tl_around_of
source: Account timeline around %1$s
ta: கணக்கு காலவரிசை %1$s

source: verified at
ta: சரிபார்க்கப்பட்டது

source: Use old API
ta: பழைய பநிஇ பயன்படுத்தவும்
