Repository: 247i/TACETr
Catalog: உரை/தானி/subway-tooter-strings-*.po
Languages: ta

# around_toot_limitation_warning
source: "Timeline around the specified time" feature has limitation for the server Mastodon pre-2.6.0. It is impossible to get a little newer timeline from the specified time.
ta: "குறிப்பிட்ட நேரத்தைச் சுற்றி காலவரிசை" நற்பொருத்தம் சேவையக மாச்டோடன் முன் -2.6.0 க்கு வரம்பைக் கொண்டுள்ளது. குறிப்பிட்ட நேரத்திலிருந்து கொஞ்சம் புதிய காலவரிசையைப் பெறுவது சாத்தியமில்லை.

# card_description_length
source: Preview card description characters limit
ta: முன்னோட்ட அட்டை விளக்கம் எழுத்துக்கள் வரம்பு

# status_deleted_at
source: This note has been deleted at %1$s
ta: இந்த குறிப்பு %1$s இல் நீக்கப்பட்டுள்ளது

# status_deleted
source: This note has been deleted
ta: இந்த குறிப்பு நீக்கப்பட்டது

# conversation_without_reply
source: (no reply)
ta: (பதில் இல்லை)

source: Show conversation
ta: உரையாடலைக் காட்டு

source: Participants:
ta: பங்கேற்பாளர்கள்:

# participants_and_more
source: … and more
ta: … மேலும்

# conversation_to
source: To:
ta: இதற்கு:

# use_quote_toot
source: Use "Quote Post". (customized server)
ta: "மேற்கோள் இடுகை" ஐப் பயன்படுத்தவும். (தனிப்பயனாக்கப்பட்ட சேவையகம்)

# mute_application_confirm
source: Mute the app "%1$s"?
ta: "%1$s" பயன்பாட்டை முடக்கவா?

# boost_button_alpha
source: Boost button alpha opacity (Unit:%. app restart required. also affected of content text alpha.)
ta: பூச்ட் பொத்தான் ஆல்பா ஒளிபுகாநிலை (அலகு:%. பயன்பாட்டு மறுதொடக்கம் தேவை. உள்ளடக்க உரை ஆல்பாவையும் பாதிக்கிறது.)

# toot_background_color
source: Post background color
ta: பின்னணி நிறத்தை இடுங்கள்

source: Column color default
ta: நெடுவரிசை வண்ண இயல்புநிலை

source: Header background color
ta: தலைப்பு பின்னணி நிறம்

source: Header foreground color
ta: தலைப்பு முன்புற நிறம்

source: Content background color
ta: உள்ளடக்க பின்னணி நிறம்

source: Content acct color
ta: உள்ளடக்க ACCT நிறம்

source: Content text color
ta: உள்ளடக்க உரை நிறம்

# quick_toot_bar_background_color
source: Quick post bar background color
ta: விரைவான போச்ட் பார் பின்னணி நிறம்

source: Don't show preview card
ta: முன்னோட்ட அட்டையைக் காட்ட வேண்டாம்

# instance_does_not_support_push_api_pleroma
source: Push subscription API is not supported on this server (maybe Pleroma).
ta: புச் சந்தா பநிஇ இந்த சேவையகத்தில் ஆதரிக்கப்படவில்லை (ஒருவேளை ப்ளெரோமா).

# quote_renote
source: Quoted renote (Misskey)
ta: மேற்கோள் ரெனோட் (மிச்கி)

source: (blank CW)
ta: (வெற்று சி.டபிள்யூ)

# actions_for_instance
source: Actions for this server
ta: இந்த சேவையகத்திற்கான செயல்கள்

source: Animation
ta: அனிமேசன்

source: TLS Handshake
ta: டி.எல்.எச் ஏண்ட்சேக்

source: Links
ta: இணைப்புகள்

# profile_directory
source: Directory
ta: அடைவு

# profile_directory_of
source: Directory of "%1$s"
ta: "%1$s" அடைவு

# about_this_instance
source: About this server
ta: இந்த சேவையகம் பற்றி

source: Top page
ta: முதல் பக்கம்

# show_open_sticker
source: Show OpenSticker (column reload required)
ta: ஓபன்ச்டிக்கரைக் காட்டு (நெடுவரிசை மறுஏற்றம் தேவை)

source: Location
ta: இடம்

source: Birthday
ta: பிறந்த நாள்

# existing_account
source: Log in
ta: புகுபதிகை

# existing_account_desc
source: Log in as existing account.
ta: இருக்கும் கணக்காக உள்நுழைக.

source: Create account
ta: கணக்கை உருவாக்கவும்

# create_account_desc
source: Create new account on specified server.
ta: குறிப்பிட்ட சேவையகத்தில் புதிய கணக்கை உருவாக்கவும்.

# user_name_hint
source: ex.) MonaLisa
ta: எ.கா.) மோனாலிசா

source: User name
ta: பயனர் பெயர்

# email_hint
source: ex.) monalisa@gmail.com
ta: எ.கா.) monalisa@gmail.com

source: Password
ta: கடவுச்சொல்

# password_hint
source: Enter the password…
ta: கடவுச்சொல்லை உள்ளிடவும்…

source: terms
ta: விதிமுறைகள்

# agree_terms
source: I agree to the terms of service
ta: பணி விதிமுறைகளை நான் ஒப்புக்கொள்கிறேன்

# instance_rules
source: Server rules
ta: சேவையக விதிகள்

# username_empty
source: Please specify the user name.
ta: பயனர் பெயரைக் குறிப்பிடவும்.

# email_empty
source: Please specify the e-mail address.
ta: மின்னஞ்சல் முகவரியைக் குறிப்பிடவும்.

# password_empty
source: Please specify the password.
ta: கடவுச்சொல்லைக் குறிப்பிடவும்.

# username_not_need_atmark
source: The username can not contain "@" or "/".
ta: பயனர்பெயரில் "@" அல்லது "/" இருக்க முடியாது.

# pseudo_account_cant_get_follow_list
source: Can't read follow list from pseudo account.
ta: போலி கணக்கிலிருந்து பின்தொடர் பட்டியலைப் படிக்க முடியாது.

# reaction_remove_confirm
source: Remove your reaction "%1$s"?
ta: உங்கள் எதிர்வினையை "%1$s" ஐ அகற்றவா?

# scheduled_status
source: Scheduled post
ta: திட்டமிடப்பட்ட இடுகை

source: Unspecified
ta: குறிப்பிடப்படாத

# scheduled_status_sent
source: Scheduled status was sent.
ta: திட்டமிடப்பட்ட நிலை அனுப்பப்பட்டது.

# scheduled_status_delete_confirm
source: Delete this scheduled status?
ta: இந்த திட்டமிடப்பட்ட நிலையை நீக்கவா?

# scheduled_post_deleted
source: Deleted.
ta: நீக்கப்பட்டது.

source: Scheduled status list
ta: திட்டமிடப்பட்ட நிலை பட்டியல்

source: Can't change account when editing scheduled status.
ta: திட்டமிடப்பட்ட நிலையைத் திருத்தும்போது கணக்கை மாற்ற முடியாது.

# delete_scheduled_status_before_update
source: Delete scheduled status before posting. Are you sure?
ta: இடுகையிடுவதற்கு முன் திட்டமிடப்பட்ட நிலையை நீக்கு. நீங்கள் உறுதியாக இருக்கிறீர்களா?

# reply_icon_size
source: Reply icon size (Unit: dp. Default:24. App restart required)
ta: பதில் படவுரு அளவு (அலகு: டிபி. இயல்புநிலை: 24. பயன்பாட்டு மறுதொடக்கம் தேவை)

# header_icon_size
source: Header icon size (Unit: dp. Default:24. App restart required)
ta: தலைப்பு படவுரு அளவு (அலகு: டிபி. இயல்புநிலை: 24. பயன்பாட்டு மறுதொடக்கம் தேவை)

# header_text_size
source: Header text size (Unit: sp. Default:14. App restart required)
ta: தலைப்பு உரை அளவு (அலகு: எச்பி. இயல்புநிலை: 14. பயன்பாட்டு மறுதொடக்கம் தேவை)

# strip_icon_size
source: Column strip icon size (Unit: dp. Default:30. App restart required)
ta: நெடுவரிசை துண்டு படவுரு அளவு (அலகு: டிபி. இயல்புநிலை: 30. பயன்பாட்டு மறுதொடக்கம் தேவை)

source: All
ta: அனைத்தும்

source: Show links in context menu
ta: சூழல் பட்டியலில் இணைப்புகளைக் காண்பி

# scheduled_status_requires_mastodon_2_7_0
source: Scheduled status requires Mastodon 2.7.0 or later.
ta: திட்டமிடப்பட்ட நிலைக்கு மாச்டோடன் 2.7.0 அல்லது அதற்குப் பிறகு தேவை.

# move_notifications_quick_filter_to_column_setting
source: Show notifications quick filter in column setting (app restart required)
ta: அறிவிப்புகளைக் காண்பி நெடுவரிசை அமைப்பில் விரைவான வடிகட்டி (பயன்பாட்டு மறுதொடக்கம் தேவை)

# copy_account_id
source: Copy account ID %1$s
ta: கணக்கு ஐடி %1$s நகலெடுக்கவும்

# open_in_admin_ui
source: Open in admin web UI
ta: நிர்வாகி வலை இடைமுகம் இல் திறக்கப்படுகிறது

# show_acct_in_system_notification
source: Show acct (instead of user name) in system notification
ta: கணினி அறிவிப்பில் ACCT (பயனர் பெயருக்கு பதிலாக) காட்டு

source: Show link underline
ta: இணைப்பு அடிக்கோடிட்டுக் காட்டுங்கள்

source: Official account
ta: அதிகாரப்பூர்வ கணக்கு

source: Releases
ta: வெளியீடுகள்

# timezone
source: Time zone (app restart required)
ta: நேர மண்டலம் (பயன்பாட்டு மறுதொடக்கம் தேவை)

source: Device time zone
ta: சாதன நேர மண்டலம்

# hashtag_extra_any
source: Additional tags: any (tags without #)
ta: கூடுதல் குறிச்சொற்கள்: ஏதேனும் ( #இல்லாத குறிச்சொற்கள்)

# hashtag_extra_all
source: Additional tags: all (tags without #)
ta: கூடுதல் குறிச்சொற்கள்: அனைத்தும் ( #இல்லாத குறிச்சொற்கள்)

# hashtag_extra_none
source: Additional tags: none (tags without #)
ta: கூடுதல் குறிச்சொற்கள்: எதுவுமில்லை ( #இல்லாத குறிச்சொற்கள்)

# hashtag_title_any
source: or %1$s
ta: அல்லது %1$s

# hashtag_title_all
source: and %1$s
ta: மற்றும் %1$s

# hashtag_title_none
source: without %1$s
ta: %1$s இல்லாமல்

source: Add
ta: கூட்டு

# show_clear_button_in_search_bar
source: Show clear button on search bar (app restart required)
ta: தேடல் பட்டியில் தெளிவான பொத்தானைக் காட்டு (பயன்பாட்டு மறுதொடக்கம் தேவை)

source: Event background color
ta: நிகழ்வு பின்னணி நிறம்

source: Unfollow (Misskey)
ta: பின்தொடர்வது (மிச்கி)

source: Follow request (Misskey)
ta: கோரிக்கையைப் பின்பற்றவும் (மிச்கி)

# dont_remove_deleted_toot_from_timeline
source: Don't remove deleted posts from timeline
ta: நீக்கப்பட்ட இடுகைகளை காலவரிசையிலிருந்து அகற்ற வேண்டாம்

source: Don't show column background image
ta: நெடுவரிசை பின்னணி படத்தைக் காட்ட வேண்டாம்

source: Allow multiple choice
ta: பல தேர்வை அனுமதிக்கவும்

# hide_totals
source: Hide totals until expire
ta: காலாவதியாகும் வரை மொத்தங்களை மறைக்கவும்

source: Expiration
ta: காலாவதி

# poll_dont_make
source: Don't make poll
ta: வாக்கெடுப்பு செய்ய வேண்டாம்

# poll_make
source: Make poll
ta: வாக்கெடுப்பு செய்யுங்கள்

# poll_make_friends_nico
source: Make poll (friends.nico API)
ta: வாக்கெடுப்பை உருவாக்குங்கள் (நண்பர்கள்.ரிகோ ஏபிஐ)

# poll_expire_days
source: days
ta: நாட்கள்

# poll_expire_hours
source: hours
ta: மணி

# poll_expire_minutes
source: minutes
ta: நிமிடங்கள்

# vote_1
source: 1 vote
ta: 1 வாக்கு

# vote_2
source: %1$d votes.
ta: % 1 $ டி வாக்குகள்.

# vote_expire_at
source: time limit: %1$s
ta: நேர வரம்பு: %1$s

# vote_count_unavailable
source: ??? votes
ta: ??? வாக்குகள்

# vote_button
source: Vote
ta: வாக்களிக்கவும்

# end_of_polling_from
source: End of polling from %1$s
ta: %1$s இலிருந்து வாக்குப்பதிவின் முடிவு

# open_hashtag_from_account
source: Open hashtag(from %1$s) column
ta: திறந்த ஏச்டேக் ( %1$s இலிருந்து) நெடுவரிசையை திறந்து வைக்கவும்

# hashtag_from_acct
source: Hashtag from account
ta: கணக்கிலிருந்து ஏச்டேக்

# hashtag_of_from
source: Hashtag #%1$s from %2$s
ta: %2$s இலிருந்து # %1$s ஏச்டேக்

source: Boost with visibility
ta: தெரிவுநிலையுடன் அதிகரிக்கும்

# confirm_private_boost_from
source: Boost this status from %1$s ? It's shown to all followers.
ta: இந்த நிலையை %1$s இலிருந்து உயர்த்தவா? இது அனைத்து பின்தொடர்பவர்களுக்கும் காட்டப்பட்டுள்ளது.

# quick_toot_menu
source: Quick post menu
ta: விரைவான இடுகை பட்டியல்

source: Input
ta: உள்ளீடு

# polls_choice_not_selected
source: Please select 1 or more choices.
ta: 1 அல்லது அதற்கு மேற்பட்ட தேர்வுகளைத் தேர்ந்தெடுக்கவும்.

# custom_emoji_separator_zwsp
source: use ZWSP instead of space for custom emoji separator
ta: தனிப்பயன் ஈமோசி பிரிப்பானுக்கு இடத்திற்கு பதிலாக ZWSP ஐப் பயன்படுத்தவும்

source: fixed phrase
ta: நிலையான சொற்றொடர்

# mark_sensitive_by_default
source: Always mark media as sensitive (when posting)
ta: எப்போதும் மீடியாவை உணர்திறன் என்று குறிக்கவும் (இடுகையிடும்போது)

# load_preference_from_web_ui
source: Load some preferences from WebUI
ta: WebUI இலிருந்து சில விருப்பங்களை ஏற்றவும்

# notifications_from_acct
source: Notifications from user
ta: பயனரிடமிருந்து அறிவிப்புகள்

# notifications_from
source: Notifications from %1$s
ta: %1$s இலிருந்து அறிவிப்புகள்

source: Show translate button
ta: மொழிபெயர்ப்பு பொத்தானைக் காட்டு

source: Translate
ta: மொழிபெயர்த்திடு

source: Translation app
ta: மொழிபெயர்ப்பு பயன்பாடு

# missing_app_can_receive_action_send
source: Missing app that can receive ACTION_SEND.
ta: Action_send ஐப் பெறக்கூடிய பயன்பாடு காணாமல் போனது.

# select_destination_app_and_back
source: Select the destination app, then back to app setting.
ta: இலக்கு பயன்பாட்டைத் தேர்ந்தெடுத்து, பயன்பாட்டு அமைப்புக்குத் திரும்பு.

source: Custom share button 1
ta: தனிப்பயன் பகிர்வு பொத்தான் 1

source: Custom share button 2
ta: தனிப்பயன் பகிர்வு பொத்தான் 2

source: Custom share button 3
ta: தனிப்பயன் பகிர்வு பொத்தான் 3

source: Custom share button 4
ta: தனிப்பயன் பகிர்வு பொத்தான் 4

source: Custom share button 5
ta: தனிப்பயன் பகிர்வு பொத்தான் 5

source: Custom share button 6
ta: தனிப்பயன் பகிர்வு பொத்தான் 6

source: Custom share button 7
ta: தனிப்பயன் பகிர்வு பொத்தான் 7

source: Custom share button 8
ta: தனிப்பயன் பகிர்வு பொத்தான் 8

source: Custom share button 9
ta: தனிப்பயன் பகிர்வு பொத்தான் 9

source: Custom share button 10
ta: தனிப்பயன் பகிர்வு பொத்தான் 10

# custom_share_app_not_found
source: the share target app is not installed. please configure it in "App setting/behavior".
ta: பங்கு இலக்கு பயன்பாடு நிறுவப்படவில்லை. தயவுசெய்து அதை "பயன்பாட்டு அமைப்பு/நடத்தை" இல் உள்ளமைக்கவும்.

# additional_buttons_position
source: Additional buttons position (app restart required)
ta: கூடுதல் பொத்தான்கள் நிலை (பயன்பாட்டு மறுதொடக்கம் தேவை)

source: Top
ta: மேலே

source: Bottom
ta: கீழே

source: Switch button color
ta: சுவிட்ச் பொத்தான் நிறம்

# max_toot_chars
source: maximum character count in status (0:default. if server provides max_toot_chars, this setting is ignored.)
ta: நிலையில் அதிகபட்ச எழுத்து எண்ணிக்கை (0: இயல்புநிலை. சேவையகம் max_toot_chars ஐ வழங்கினால், இந்த அமைப்பு புறக்கணிக்கப்படுகிறது.)

# read_more_hashtag
source: Read more hashtags
ta: மேலும் படிக்க ஏச்டேக்குகள்

# read_more_account
source: Read more accounts
ta: மேலும் கணக்குகளைப் படியுங்கள்

# read_more_status
source: Read more posts
ta: மேலும் இடுகைகளைப் படிக்கவும்

source: Muted users from pseudo account
ta: போலி கணக்கிலிருந்து முடக்கிய பயனர்கள்

# order_active
source: Recently active
ta: அண்மைக் காலத்தில் செயலில்

# order_new
source: New arrivals
ta: புதிய வருகை

source: Local only
ta: உள்ளக மட்டும்

source: Last active
ta: கடைசியாக செயலில்

# profile_directory_not_supported_on_misskey
source: Profile directory is not supported on Misskey
ta: சுயவிவர அடைவு மிச்கியில் ஆதரிக்கப்படவில்லை

source: Show in directory
ta: கோப்பகத்தில் காட்டு

source: Featured hashtags
ta: சிறப்பு ஏச்டேக்குகள்

source: Custom emoji
ta: தனிப்பயன் ஈமோசி

# windows_insets_color
source: Window insets color (such as OS's status/navigation bar)(app restart required)
ta: சாளர இன்செட்டுகள் வண்ணம் (OS இன் நிலை/வழிசெலுத்தல் பட்டி போன்றவை) (பயன்பாட்டு மறுதொடக்கம் தேவை)

# pixelfed_does_not_allow_reply_with_media
source: Pixelfed does not allow reply with media attachment.
ta: பிக்செல்ஃப் மீடியா இணைப்புடன் பதிலை அனுமதிக்காது.

# pixelfed_does_not_allow_post_without_media
source: Pixelfed does not allow post (not reply) without media attachment.
ta: பிக்செல்ஃப் மீடியா இணைப்பு இல்லாமல் இடுகையை (பதில் இல்லை) அனுமதிக்காது.

# hashtag_contains_ascii_and_not_ascii
source: Hashtag %1$s contains both of ASCII and non-ASCII characters. It may be a typo. Are you sure?
ta: ஏச்டேக் %1$s ASCII மற்றும் ASCII அல்லாத எழுத்துக்கள் இரண்டையும் கொண்டுள்ளது. இது ஒரு எழுத்துப்பிழையாக இருக்கலாம். நீங்கள் உறுதியாக இருக்கிறீர்களா?

# warn_hashtag_ascii_and_non_ascii
source: Warn if hashtag contains both of ASCII and non-ASCII characters
ta: ஏச்டேக்கில் ASCII மற்றும் ASCII அல்லாத எழுத்துக்கள் உள்ளன என்பதை எச்சரிக்கவும்

# enable_connect_to_pixelfed_server
source: Enable connect to Pixelfed server (experimental. many problems)
ta: பிக்செல்ஃப் செய்யப்பட்ட சேவையகத்துடன் இணைக்கவும் (சோதனை. பல சிக்கல்கள்)

# reason_create_account
source: Reason why you want to create an account on this server (optional)
ta: இந்த சேவையகத்தில் ஒரு கணக்கை உருவாக்க நீங்கள் விரும்புவதற்கான காரணம் (விரும்பினால்)

source: Cross-account actions
ta: குறுக்கு கணக்கு நடவடிக்கைகள்

source: Account timeline
ta: கணக்கு காலவரிசை

# around_this_toot
source: Around the post
ta: இடுகையைச் சுற்றி

# your_toot
source: Your post
ta: உங்கள் இடுகை

source: Extra actions
ta: கூடுதல் செயல்கள்

# block_domain
source: Block whole domain
ta: முழு களத்தைத் தடு

# instance_actions_for
source: Actions for the server "%1$s"
ta: சேவையகத்திற்கான செயல்கள் "%1$s"

# quick_toot_omit_account_selection
source: When using quick post, omit account selection if possible
ta: விரைவான இடுகையைப் பயன்படுத்தும் போது, ​​முடிந்தால் கணக்கு தேர்வை தவிர்க்கவும்

# separate_notification_group_for_reply
source: Separate notification groups for reply
ta: பதிலளிக்க அறிவிப்புக் குழுக்கள்

# timeline_line_spacing
source: Timeline line spacing (floating number is used as line spacing multiplier. leave empty to default. app restart required)
ta: காலவரிசை வரி இடைவெளி (மிதக்கும் எண் வரி இடைவெளி பெருக்கமாக பயன்படுத்தப்படுகிறது. இயல்புநிலைக்கு காலியாக விடவும். பயன்பாட்டு மறுதொடக்கம் தேவை)

# always_expand_context_menu_sub_items
source: Always expand sub-items of context menu
ta: சூழல் மெனுவின் துணை உருப்படிகளை எப்போதும் விரிவாக்குங்கள்

# release_notes_latest
source: Release notes (v%1$s)
ta: வெளியீட்டு குறிப்புகள் (v%1$s)

# release_notes_updated
source: Release notes (v%1$s→v%2$s)
ta: வெளியீட்டு குறிப்புகள் (v%1$s → V%2$s)

source: Test
ta: தேர்வு

source: Please help translation!
ta: மொழிபெயர்ப்புக்கு உதவுங்கள்!

# show_bookmark_button
source: Show bookmark button (app restart required)
ta: புத்தகக்குறி பொத்தானைக் காட்டு (பயன்பாட்டு மறுதொடக்கம் தேவை)

source: Show filtered word
ta: வடிகட்டப்பட்ட வார்த்தையைக் காட்டு

source: Enable domain timeline
ta: டொமைன் காலவரிசையை இயக்கவும்

source: (fedibird)Domain timeline
ta: (ஃபெடிபர்ட்) டொமைன் காலவரிசை

source: Domain timeline
ta: டொமைன் காலவரிசை

# domain_timeline_of
source: %1$s domain timeline
ta: %1$s டொமைன் காலவரிசை

source: Language filter
ta: மொழி வடிகட்டி

source: Export
ta: ஏற்றுமதி

source: Import
ta: இறக்குமதி

# language_code_default
source: (default)
ta: (இயல்புநிலை)

# language_code_unknown
source: (unknown)
ta: (தெரியவில்லை)

# language_show
source: Show
ta: காட்டு

# language_hide
source: Hide
ta: மறை

source: Language
ta: மொழி

source: Show/Hide
ta: காட்டு/மறைக்க

# language_filter_description
source: column reload required to apply filter.
ta: வடிகட்டியைப் பயன்படுத்துவதற்கு நெடுவரிசை மறுஏற்றம் தேவை.

source: Clear all
ta: அனைத்தையும் அழிக்கவும்

source: Presets
ta: முன்னமைவுகள்

source: Custom
ta: தனிப்பயன்

# language_code_hint
source: choose preset or input language code
ta: முன்னமைக்கப்பட்ட அல்லது உள்ளீட்டு மொழி குறியீட்டைத் தேர்வுசெய்க

# language_is
source: lang: %1$s
ta: வெறும்: %1$s

source: Always show language
ta: எப்போதும் மொழியைக் காட்டுங்கள்

source: Drawable list
ta: வரையக்கூடிய பட்டியல்

source: Developer options
ta: உருவாக்குபவர் விருப்பங்கள்

# justify_window_content_portrait
source: Justify window content (Portrait)(app restart required)
ta: சாளர உள்ளடக்கத்தை நியாயப்படுத்துங்கள் (உருவப்படம்) (பயன்பாட்டு மறுதொடக்கம் தேவை)

source: Follow request
ta: கோரிக்கையைப் பின்பற்றவும்

# push_notification_server_key_missing
source: Push notification will not work because server misconfiguration. Server public key is missing.
ta: சேவையக தவறான கட்டமைப்பு என்பதால் புச் அறிவிப்பு இயங்காது. சேவையக பொது விசை இல்லை.

# push_notification_server_key_empty
source: Push notification will not work because server misconfiguration. Server public key is empty.
ta: சேவையக தவறான கட்டமைப்பு என்பதால் புச் அறிவிப்பு இயங்காது. சேவையக பொது விசை காலியாக உள்ளது.

# divide_notification
source: Divide notifications
ta: அறிவிப்புகளை பிரிக்கவும்

source: Announcements
ta: அறிவிப்புகள்

# announcements_period1
source: Event Period: %1$s
ta: நிகழ்வு காலம்: %1$s

# announcements_period2
source: Event Period: %1$s…%2$s
ta: நிகழ்வு காலம்: %1$s… %2$s

# edited_at
source: Edited: %1$s
ta: திருத்தப்பட்டது: %1$s

source: Hide followers count
ta: பின்தொடர்பவர்களை மறைக்கவும்

source: EmojiOne shortcode support
ta: ஈமோசியோன் குறுக்குவழி உதவி

# emojione_shortcode_support_desc
source: The posts made by old Mastodon may contain emojione's shortcode even if the server have been updated.
ta: ஓல்ட் மாச்டோடன் தயாரித்த இடுகைகளில் சேவையகம் புதுப்பிக்கப்பட்டிருந்தாலும் ஈமோசியோனின் குறுக்குவழி இருக்கலாம்.

source: Copy to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கவும்

source: Copied to clipboard.
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது.

# language_filter_quit_waring
source: Language filter is not saved. exit anyway?
ta: மொழி வடிகட்டி சேமிக்கப்படவில்லை. எப்படியும் வெளியேறவா?

# keyword_filter_quit_waring
source: Keyword filter is not saved. exit anyway?
ta: முக்கிய வடிகட்டி சேமிக்கப்படவில்லை. எப்படியும் வெளியேறவா?

source: Import completed. Please restart app.
ta: இறக்குமதி முடிந்தது. பயன்பாட்டை மறுதொடக்கம் செய்யுங்கள்.

source: Delete custom emoji cache
ta: தனிப்பயன் ஈமோசி தற்காலிக சேமிப்பை நீக்கு

source: Antenna list
ta: ஆண்டெனா பட்டியல்

# antenna_timeline
source: Antenna TL
ta: ஆண்டெனா டி.எல்

# antenna_timeline_of
source: Antenna TL '%1$s'
ta: ஆண்டெனா tl '%1$s'

# antenna_list_misskey
source: Antenna list (Misskey 12+)
ta: ஆண்டெனா பட்டியல் (மிச்கி 12+)

# quote_toot
source: Quote post (customized server)
ta: மேற்கோள் இடுகை (தனிப்பயனாக்கப்பட்ட சேவையகம்)

# quote_toot_bt
source: Quote boost outer (debug purpose)
ta: மேற்கோள் பூச்ட் வெளிப்புறம் (பிழைத்திருத்த நோக்கம்)

source: Quote
ta: மேற்கோள்

source: Promoted
ta: ஊக்குவிக்கப்பட்டது

source: Featured
ta: இடம்பெற்றது

source: Remote only
ta: தொலைநிலை மட்டும்

# invites_enabled
source: Users can create invitations
ta: பயனர்கள் அழைப்பிதழ்களை உருவாக்கலாம்

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Muted quote
ta: முடக்கிய மேற்கோள்

source: Button accent color
ta: பொத்தான் உச்சரிப்பு நிறம்

# search_bar_background_color
source: Search bar background color (app restart required)
ta: தேடல் பட்டி பின்னணி வண்ணம் (பயன்பாட்டு மறுதொடக்கம் தேவை)

# announcement_background_color
source: Announcements background color (app restart required)
ta: அறிவிப்புகள் பின்னணி நிறம் (பயன்பாட்டு மறுதொடக்கம் தேவை)

# conversation_main_toot_background_color
source: Focused in conversation post background color
ta: உரையாடல் இடுகை பின்னணி நிறத்தில் கவனம் செலுத்தியது

# verified_link_background_color
source: Verified link background color (app restart required)
ta: சரிபார்க்கப்பட்ட இணைப்பு பின்னணி நிறம் (பயன்பாட்டு மறுதொடக்கம் தேவை)

# verified_link_foreground_color
source: Verified link foreground color (app restart required)
ta: சரிபார்க்கப்பட்ட இணைப்பு முன்புற வண்ணம் (பயன்பாட்டு மறுதொடக்கம் தேவை)

# screen_bottom_padding
source: Screen bottom padding (Unit: dp. Default:0. App restart required)
ta: திரை கீழ் திணிப்பு (அலகு: டிபி. இயல்புநிலை: 0. பயன்பாட்டு மறுதொடக்கம் தேவை)

source: Personal notes
ta: தனிப்பட்ட குறிப்புகள்

# personal_notes_of
source: Personal notes of %1$s
ta: %1$s இன் தனிப்பட்ட குறிப்புகள்

source: Custom thumbnail
ta: தனிப்பயன் சிறுபடம்

# close_emoji_picker_when_selected
source: Close emoji picker after selecting emoji
ta: ஈமோசியைத் தேர்ந்தெடுத்த பிறகு ஈமோசி பிக்கரை மூடு

# new_version_available
source: New version available! %1$s
ta: புதிய பதிப்பு கிடைக்கிறது! %1$s

# release_note_with_assets
source: Release note (Please find the APK file in assets section.)
ta: வெளியீட்டு குறிப்பு (தயவுசெய்து APK கோப்பை சொத்துக்கள் பிரிவில் கண்டுபிடிக்கவும்.)

source: Release note
ta: வெளியீட்டு குறிப்பு

source: Check beta release
ta: பீட்டா வெளியீட்டை சரிபார்க்கவும்

source: Exit reasons
ta: வெளியேறும் காரணங்கள்

source: Read gap head
ta: இடைவெளி தலையைப் படியுங்கள்

source: Read gap tail
ta: இடைவெளி வால் படிக்கவும்

source: Scroll position after read gap from head
ta: தலையிலிருந்து இடைவெளியைப் படித்த பிறகு உருட்டவும்

source: Scroll position after read gap from tail
ta: வால் இருந்து இடைவெளியைப் படித்த பிறகு உருட்டவும்

# gap_head
source: Head of gap
ta: இடைவெளி தலை

# gap_tail
source: Tail of gap
ta: இடைவெளியின் வால்

# ignore_text_in_shared_media
source: Don't append extra text that come with shared media from external apps
ta: வெளிப்புற பயன்பாடுகளிலிருந்து பகிரப்பட்ட ஊடகத்துடன் வரும் கூடுதல் உரையை சேர்க்க வேண்டாம்

# input_sharp_itself
source: Input '#' itself
ta: உள்ளீடு '#'

source: Notify posts from this user
ta: இந்த பயனரின் இடுகைகளுக்கு அறிவிக்கவும்

source: Stop notify posts from this user
ta: இந்த பயனரின் இடுகைகளுக்கு அறிவிப்பதை நிறுத்துங்கள்

source: Gap
ta: இடைவெளி

# powered_by_open_sticker
source: Using OpenSticker API.
ta: OpenSticker பநிஇ ஐப் பயன்படுத்துதல்.

source: Speech
ta: பேச்சு

source: Duration
ta: காலம்

# duration_indefinite
source: Indefinite
ta: காலவரையற்றது

# duration_minutes_5
source: 5 minutes
ta: 5 நிமிடங்கள்

# duration_minutes_30
source: 30 minutes
ta: 30 நிமிடங்கள்

# duration_hours_1
source: 1 hour
ta: 1 மணி நேரம்

# duration_hours_6
source: 6 hours
ta: 6 மணி நேரம்

# duration_days_1
source: 1 day
ta: 1 நாள்

# duration_days_3
source: 3 days
ta: 3 நாட்கள்

# duration_days_7
source: 7 days
ta: 7 நாட்கள்

source: notestock
ta: நோட்டெச்டாக்

# toot_search_notestock_of
source: notestock search "%1$s"
ta: நோட்டெச்டாக் தேடல் "%1$s"
