Repository: 247i/TACETr
Catalog: உரை/தானி/subway-tooter-strings-*.po
Languages: ta

# app_name
source: Subway Tooter
ta: சுரங்கப்பாதை டூட்டர்

# action_settings
source: Settings
ta: அமைப்புகள்

# account_add
source: Add an account
ta: ஒரு கணக்கைச் சேர்க்கவும்

# instance
source: Server
ta: சேவையகம்

# user_mail_address
source: E-mail
ta: மின்னஞ்சல்

# user_password
source: Password
ta: கடவுச்சொல்

source: OK
ta: சரி

source: Cancel
ta: ரத்துசெய்

# instance_not_specified
source: Server not specified
ta: சேவையகம் குறிப்பிடப்படவில்லை

# mail_not_specified
source: E-mail not specified
ta: மின்னஞ்சல் குறிப்பிடப்படவில்லை

source: Password not specified
ta: கடவுச்சொல் குறிப்பிடப்படவில்லை

source: Network error.
ta: பிணைய பிழை.

source: Error response.
ta: பிழை பதில்.

# api_error
source: API error. %1$s
ta: பநிஇ பிழை. %1$s

# register_app_to_server
source: Registering this app to %1$s…
ta: இந்த பயன்பாட்டை %1$s க்கு பதிவு செய்தல்…

# request_access_token
source: Requesting access token…
ta: அணுகல் டோக்கனைக் கோருகிறது…

# request_api
source: Acquiring: %1$s %2$s
ta: பெறுதல்: %1$s %2$s

# reading_api
source: Reading: %1$s %2$s
ta: படித்தல்: %1$s %2$s

# column_empty
source: Use the bottom left menu button to add a column
ta: நெடுவரிசையைச் சேர்க்க கீழே இடது பட்டியல் பொத்தானைப் பயன்படுத்தவும்

source: Home
ta: வீடு

source: Local timeline
ta: உள்ளக காலவரிசை

# federate_timeline
source: Federated timeline
ta: கூட்டாட்சி காலவரிசை

# login_required
source: Please set your access token from the account settings.
ta: கணக்கு அமைப்புகளிலிருந்து உங்கள் அணுகல் கிள்ளாக்கை அமைக்கவும்.

source: Cancelled
ta: ரத்து செய்யப்பட்டது

# account_pick
source: Select an account
ta: ஒரு கணக்கைத் தேர்ந்தெடுக்கவும்

source: Account confirmed.
ta: கணக்கு உறுதிப்படுத்தப்பட்டது.

source: Reply
ta: பதில்

source: Default
ta: இயல்புநிலை

source: More
ta: மேலும்

# close_column
source: Close the column
ta: நெடுவரிசையை மூடு

source: Thumbnail
ta: சிறுபடம்

source: Reload
ta: ஏற்றவும்

source: Favourites
ta: பிடித்தவை

source: Notifications
ta: அறிவிப்புகள்

source: Reports
ta: அறிக்கைகள்

# your_statuses
source: Your profile
ta: உங்கள் சுயவிவரம்

# statuses_of
source: Profile of %1$s
ta: %1$s சுயவிவரம்

source: Follow
ta: பின்தொடர்

source: Following
ta: பின்வருமாறு

source: Followers
ta: பின்தொடர்பவர்கள்

source: Statuses
ta: நிலைகள்

source: Hide
ta: மறை

source: Tap to show
ta: காட்ட தட்டவும்

source: Show
ta: காட்டு

# act_post
source: Composite post
ta: கலப்பு இடுகை

source: Content warning
ta: உள்ளடக்க எச்சரிக்கை

# please_add_account
source: You need to make an account to create post.
ta: இடுகையை உருவாக்க நீங்கள் ஒரு கணக்கை உருவாக்க வேண்டும்.

# not_selected_2
source: (not selected)
ta: (தேர்ந்தெடுக்கப்படவில்லை)

# content_warning_hint
source: Write your warning here
ta: உங்கள் எச்சரிக்கையை இங்கே எழுதுங்கள்

# content_hint
source: The content of your post
ta: உங்கள் இடுகையின் உள்ளடக்கம்

# status
source: Post
ta: இடுகை

source: List empty
ta: காலியாக பட்டியல்

source: Post from
ta: இருந்து இடுகை

# choose_account
source: Choose your account
ta: உங்கள் கணக்கைத் தேர்வுசெய்க

# response_not_json
source: API response is not JSON.
ta: பநிஇ பதில் சாதொபொகு அல்ல.

# attachment_too_many
source: up to 4 files is allowed.
ta: 4 கோப்புகள் வரை அனுமதிக்கப்படுகிறது.

# account_select_please
source: Select the account
ta: கணக்கைத் தேர்ந்தெடுக்கவும்

# login_failed
source: Could not log in.
ta: உள்நுழைய முடியவில்லை.

# file_size_too_big
source: The file is bigger than the limit of %1$dMB.
ta: கோப்பு %1 $ DMB வரம்பை விட பெரியது.

# visibility_public
source: Public
ta: பொது

# visibility_unlisted
source: Unlisted
ta: பட்டியலிடப்படாதது

# visibility_private
source: Followers-only
ta: பின்தொடர்பவர்கள் மட்டுமே

# visibility_direct
source: Direct
ta: நேரடி

# visibility_web_setting
source: Trace web app setting
ta: வலை பயன்பாட்டு அமைப்பைக் கண்டறியவும்

# visibility_account_setting
source: Trace account setting
ta: கணக்கு அமைப்பைக் கண்டறியவும்

# visibility_local_public
source: Public (local)
ta: பொது (உள்ளூர்)

# visibility_local_home
source: Home (local)
ta: வீடு (உள்ளூர்)

# visibility_local_followers
source: Followers-only (local)
ta: பின்தொடர்பவர்கள்-மட்டும் (உள்ளூர்)

# visibility_local_unlisted
source: Unlisted (local)
ta: பட்டியலிடப்படாத (உள்ளூர்)

source: Choose visibility
ta: தெரிவுநிலையைத் தேர்வுசெய்க

# confirm_delete_attachment
source: Remove this attachment?
ta: இந்த இணைப்பை அகற்றவா?

# post_error_contents_empty
source: Please input content text.
ta: உள்ளடக்க உரையை உள்ளிடவும்.

# post_error_contents_warning_empty
source: Please input content warning text.
ta: உள்ளடக்க எச்சரிக்கை உரையை உள்ளிடவும்.

# wait_previous_operation
source: Please wait until last operation is over.
ta: கடைசி செயல்பாடு முடியும் வரை காத்திருங்கள்.

source: Can't remove boost while favourited
ta: சாதகமாக இருக்கும்போது ஊக்கத்தை அகற்ற முடியாது

source: Confirm
ta: உறுதிப்படுத்தவும்

# confirm_boost_from
source: Boost this status from %1$s ? It's shown to all followers and on your profile page.
ta: இந்த நிலையை %1$s இலிருந்து உயர்த்தவா? இது அனைத்து பின்தொடர்பவர்களுக்கும் உங்கள் சுயவிவரப் பக்கத்திலும் காட்டப்பட்டுள்ளது.

# confirm_unboost_from
source: Unboost this status from %1$s ?
ta: இந்த நிலையை %1$s இலிருந்து பூச முடியுமா?

# confirm_favourite_from
source: Favourite this status from %1$s ? Notification will be sent to its author.
ta: %1$s இலிருந்து இந்த நிலையை பிடித்ததா? அறிவிப்பு அதன் ஆசிரியருக்கு அனுப்பப்படும்.

# confirm_unfavourite_from
source: Unfavourite this status from %1$s ?
ta: %1$s இலிருந்து இந்த நிலையை ஏமாற்றுகிறீர்களா?

# confirm_unbookmark_from
source: Unbookmark this status from %1$s ?
ta: இந்த நிலையை %1$s இலிருந்து புத்தகமில்லை?

# display_name_favourited_by
source: %1$s favourited
ta: %1$s சாதனை

# display_name_boosted_by
source: %1$s boosted
ta: %1$s உயர்த்தப்பட்டன

# display_name_replied_by
source: %1$s replied
ta: %1$s பதிலளித்தன

# display_name_mentioned_by
source: %1$s mentioned
ta: %1$s குறிப்பிடப்பட்டுள்ளன

# display_name_voted_by
source: %1$s voted
ta: %1$s வாக்களித்தன

# display_name_follow_request_by
source: %1$s sent follow request
ta: %1$s அனுப்பப்பட்ட கோரிக்கை

# display_name_follow_request_accepted_by
source: %1$s accepted your follow request
ta: உங்கள் பின்தொடர் கோரிக்கையை %1$s ஏற்றுக்கொண்டன

# display_name_quoted_by
source: %1$s quoted
ta: %1$s மேற்கோள் காட்டப்பட்டுள்ளன

# display_name_posted_by
source: %1$s posted
ta: %1$s இடுகையிடப்படுகின்றன

# display_name_updates_post
source: %1$s updates the post
ta: %1$s இடுகையை புதுப்பிக்கிறது

# display_name_references_post
source: %1$s references your post
ta: %1$s உங்கள் இடுகையை குறிப்பிடுகின்றன

# display_name_reaction_by
source: %1$s reactioned
ta: %1$s எதிர்வினை

# display_name_followed_by
source: %1$s is following you
ta: %1$s உங்களைப் பின்தொடர்கின்றன

# display_name_unfollowed_by
source: %1$s unfollowed you
ta: %1$s உங்களைப் பின்தொடரவில்லை

# display_name_signed_up
source: %1$s signed up on your server
ta: உங்கள் சேவையகத்தில் %1$s பதிவு செய்யப்பட்டுள்ளன

# display_name_report
source: %1$s reported.
ta: %1$s அறிக்கை.

source: Account
ta: கணக்கு

# account_setting
source: Account settings
ta: கணக்கு அமைப்புகள்

# setting
source: Settings
ta: அமைப்புகள்

# app_setting
source: App settings
ta: பயன்பாட்டு அமைப்புகள்

# column_list
source: Columns list
ta: நெடுவரிசை பட்டியல்

# update_access_token
source: Update the access token
ta: அணுகல் கிள்ளாக்கைப் புதுப்பிக்கவும்

# account_remove
source: Remove this account
ta: இந்த கணக்கை அகற்று

source: Actions
ta: செயல்கள்

# default_status_visibility
source: Default visibility
ta: இயல்புநிலை தெரிவுநிலை

# confirm_before_boost
source: Confirm before boosting
ta: அதிகரிப்பதற்கு முன் உறுதிப்படுத்தவும்

# sensitive_content_default_open
source: Showing sensitive attachments by default
ta: இயல்பாகவே முக்கியமான இணைப்புகளைக் காட்டுகிறது

# cw_default_open
source: Expand CWed content by default
ta: முன்னிருப்பாக CWED உள்ளடக்கத்தை விரிவாக்குங்கள்

source: User
ta: பயனர்

# confirm_account_remove
source: This account will be deleted and all the columns will be removed. Are you sure?
ta: இந்த கணக்கு நீக்கப்பட்டு அனைத்து நெடுவரிசைகளும் அகற்றப்படும். நீங்கள் உறுதியாக இருக்கிறீர்களா?

source: Username not match
ta: பயனர்பெயர் பொருந்தவில்லை

# access_token_updated_for
source: %1$s's access token was updated.
ta: %1$s இன் அணுகல் கிள்ளாக்கு புதுப்பிக்கப்பட்டது.

# back_to_column_list
source: Go to column list when pressing "Back"
ta: "பேக்" ஐ அழுத்தும்போது நெடுவரிசை பட்டியலுக்குச் செல்லுங்கள்

# account_empty
source: Account is not set up.Please add account.
ta: கணக்கு அமைக்கப்படவில்லை. கணக்கைச் சேர்க்கவும்.

# dont_confirm_before_close_column
source: Close column without confirmation
ta: உறுதிப்படுத்தாமல் நெடுவரிசையை மூடு

source: Drag handle
ta: இழுவை கைப்பிடி

source: Delete
ta: நீக்கு

# column_list_desc
source: Swipe to delete. Long press to sort. Changes will be applied when reloading the view.
ta: நீக்க ச்வைப். வரிசைப்படுத்த நீண்ட அழுத்தவும். பார்வையை மீண்டும் ஏற்றும்போது மாற்றங்கள் பயன்படுத்தப்படும்.

source: Last selection
ta: கடைசி தேர்வு

# reply_to_this_status
source: Reply to this post:
ta: இந்த இடுகைக்கு பதில்:

# cant_change_account_when_attachment_specified
source: You can't switch accounts while there is media attachment.
ta: மீடியா இணைப்பு இருக்கும்போது நீங்கள் கணக்குகளை மாற்ற முடியாது.

source: Column
ta: நெடுவரிசை

source: Conversation view
ta: உரையாடல் பார்வை

# conversation_around
source: Conversation around post:%1$s
ta: இடுகையைச் சுற்றி உரையாடல்:%1$s

# instance_not_need_slash
source: Hostname of the server, without '/', '@'.
ta: சேவையகத்தின் ஓச்ட்பெயர், '/', '@' இல்லாமல்.

# mail_address_not_contains_at_mark
source: Use e-mails that contains '@' and '.'
ta: '@' மற்றும் '' கொண்ட மின்னஞ்சல்களைப் பயன்படுத்தவும்.

# instance_hint
source: ex) mastodon.social
ta: எ.கா) Mastodon.ocial

source: Unfollow
ta: பின்தொடரவும்

# follow_succeeded
source: Followed
ta: தொடர்ந்து

# unfollow_succeeded
source: Unfollowed
ta: பின்தொடரப்பட்டது

source: Mute
ta: முடக்கு

source: Unmute
ta: ஊன்

source: Block
ta: தொகுதி

source: Unblock
ta: தடை

source: Report
ta: அறிக்கை

# cant_follow_locked_user
source: Could not follow the non-public user
ta: பொது அல்லாத பயனரைப் பின்பற்ற முடியவில்லை

# unmute_succeeded
source: Unmuted
ta: அன்ச்டட்

# mute_succeeded
source: Muted
ta: முடக்கிய

# unblock_succeeded
source: Unblocked
ta: தடைசெய்யப்பட்டது

# block_succeeded
source: Blocked
ta: தடுக்கப்பட்டது

# report_reason
source: Reason for reporting
ta: புகாரளிப்பதற்கான காரணம்

# comment_empty
source: You need to clarify your reason for reporting
ta: புகாரளிப்பதற்கான உங்கள் காரணத்தை நீங்கள் தெளிவுபடுத்த வேண்டும்

# report_completed
source: Reported
ta: அறிக்கை

source: Mention
ta: குறிப்பு

# hashtag_of
source: Hashtag :#%1$s
ta: ஏச்டேக்:#%1$s

# open_in_account
source: Open with %1$s
ta: %1$s உடன் திறக்கவும்

source: Open web page
ta: வலைப்பக்கத்தைத் திறக்கவும்

# open_web_on_host
source: Open web page on %1$s
ta: வலைப்பக்கத்தை %1$s இல் திறக்கவும்

source: Follow from another account
ta: மற்றொரு கணக்கிலிருந்து பின்பற்றவும்

# search_of
source: Search "%1$s"
ta: "%1$s" ஐத் தேடுங்கள்

source: Search
ta: தேடல்

# resolve_non_local_account
source: Load non local account
ta: உள்ளக கணக்கை ஏற்றவும்

# confirm_close_column
source: Close this column?
ta: இந்த நெடுவரிசையை மூடவா?

source: Favourite from another account
ta: மற்றொரு கணக்கிலிருந்து பிடித்தது

source: Boost from another account
ta: மற்றொரு கணக்கிலிருந்து உயர்த்தவும்

source: Reaction from another account
ta: மற்றொரு கணக்கிலிருந்து எதிர்வினை

# app_about
source: About this app
ta: இந்த பயன்பாடு பற்றி

source: OSS license
ta: OSS உரிமம்

# please_rate
source: Please take the time to review the app.
ta: பயன்பாட்டை மதிப்பாய்வு செய்ய நேரம் ஒதுக்குங்கள்.

source: Rate on store
ta: கடையில் விகிதம்

# please_donate
source: Please support this app.
ta: இந்த பயன்பாட்டை ஆதரிக்கவும்.

# version_is
source: Version %1$s
ta: பதிப்பு %1$s

# open_instance_website
source: Open https://%1$s/
ta: திறந்த https: //%1$s/

source: Boost
ta: பூச்ட்

source: Favourite
ta: பிடித்த

# mention2
source: Mention
ta: குறிப்பு

# notification_count
source: %1$d notifications
ta: %1$d அறிவிப்புகள்

# app_exit
source: Close the app
ta: பயன்பாட்டை மூடு

# ask_always
source: Always ask
ta: எப்போதும் கேளுங்கள்

source: Open column list
ta: நெடுவரிசை பட்டியலைத் திறக்கவும்

# back_button_action
source: Action of the "Back" button
ta: "பின்" பொத்தானின் செயல்

source: prior local URL when open attachment
ta: திறந்த இணைப்பு போது முந்தைய உள்ளக முகவரி

# disable_fast_scroller
source: Disable fast scroller (app restart required)
ta: ஃபாச்ட் ச்க்ரோலரை முடக்கு (பயன்பாட்டு மறுதொடக்கம் தேவை)

# delete_succeeded
source: Deleted
ta: நீக்கப்பட்டது

source: Developer
ta: உருவாக்குநர்

source: with attachment
ta: இணைப்புடன்

source: with highlight
ta: சிறப்பம்சத்துடன்

source: Column is busy
ta: நெடுவரிசை பிசியாக உள்ளது

# read_gap
source: Load missing messages
ta: காணாமல் போன செய்திகளை ஏற்றவும்

source: Muted users
ta: முடக்கிய பயனர்கள்

source: Blocked users
ta: தடுக்கப்பட்ட பயனர்கள்

# end_of_list
source: end of the list
ta: பட்டியலின் முடிவு

# send_text
source: Send text to apps
ta: பயன்பாடுகளுக்கு உரையை அனுப்பவும்

# send_header_date
source: Date
ta: திகதி

# send_header_from_acct
source: From-Acct
ta: முதல் ACCCT

# send_header_from_name
source: From-Name
ta: பெயரிலிருந்து

# send_header_content_warning
source: Content-Warning
ta: உள்ளடக்கம்-எச்சரிக்கை

# send_header_url
source: Status-URL
ta: நிலை-உர்எல்

source: Don't close column
ta: நெடுவரிசையை மூட வேண்டாம்

# column_has_dont_close_option
source: You can't close this column (check column settings).
ta: இந்த நெடுவரிசையை நீங்கள் மூட முடியாது (நெடுவரிசை அமைப்புகளை சரிபார்க்கவும்).

# ui_theme
source: UI theme (app restart required)
ta: இடைமுகம் கருப்பொருள் (பயன்பாட்டு மறுதொடக்கம் தேவை)

# theme_light
source: Light
ta: ஒளி

# theme_dark
source: Dark
ta: இருண்ட

# theme_mastodon_dark
source: Mastodon Dark
ta: மாச்டோடன் இருண்ட

# dont_show_boost
source: Don't show boosts
ta: ஊக்கங்களைக் காட்ட வேண்டாம்

# dont_show_reply
source: Don't show replies
ta: பதில்களைக் காட்ட வேண்டாம்

source: Regex filter
ta: ரீசெக்ச் வடிகட்டி

source: Regex error
ta: வழக்கவெளி பிழை

# notification_delete
source: Empty notifications
ta: வெற்று அறிவிப்புகள்

# confirm_delete_notification
source: Your notification(s) on the server will be deleted. Are you sure?
ta: சேவையகத்தில் உங்கள் அறிவிப்பு (கள்) நீக்கப்படும். நீங்கள் உறுதியாக இருக்கிறீர்களா?

# search_for
source: Search %1$s
ta: தேடல் %1$s

# spoil_visibility_for_account
source: Visibility is spoiled for account.
ta: கணக்கிற்காக தெரிவுநிலை கெட்டுப்போகிறது.

source: contributor
ta: பங்களிப்பாளர்

# thanks_for
source: Thanks for %1$s.
ta: %1$s க்கு நன்றி.

# simple_list
source: Reduce buttons in timeline (app restart required)
ta: காலவரிசையில் பொத்தான்களைக் குறைக்கவும் (பயன்பாட்டு மறுதொடக்கம் தேவை)

# refresh_after_ummute
source: After unmute items, reloading columns to refresh.
ta: ஆன்மேட் உருப்படிகளுக்குப் பிறகு, புதுப்பிக்க நெடுவரிசைகளை மீண்டும் ஏற்றவும்.

# muted_app
source: Muted apps
ta: முடக்கிய பயன்பாடுகள்

# application_is
source: app: %1$s
ta: பயன்பாடு: %1$s

# mute_app_of
source: mute app "%1$s"
ta: முடக்கு பயன்பாடு "%1$s"

source: App was muted.
ta: பயன்பாடு முடக்கப்பட்டது.

# favourite_succeeded
source: Favourited
ta: சாதகமானது

# unfavourite_succeeded
source: Unfavourited
ta: முதலீடு செய்யாதது

source: Bookmark
ta: புத்தககுறி

source: Bookmark from another account
ta: மற்றொரு கணக்கிலிருந்து புக்மார்க்கு

# bookmark_succeeded
source: Bookmarked
ta: புக்மார்க்கு செய்யப்பட்டது

source: Bookmarks
ta: புக்மார்க்குகள்

# unbookmark_succeeded
source: Unbookmarked
ta: நூல் குறிக்கப்படாதது

# boost_succeeded
source: Boosted
ta: உயர்த்தப்பட்டது

# unboost_succeeded
source: Unboosted
ta: பூச்ட்ட்

# reaction_succeeded
source: Reacted
ta: எதிர்வினை

source: notification option
ta: அறிவிப்பு விருப்பம்

source: sound
ta: ஒலி

source: vibration
ta: அதிர்வு

source: LED
ta: எல்.ஈ.டி

source: Follow requests
ta: கோரிக்கைகளைப் பின்பற்றவும்

# follow_request_ok
source: Accept the follow request
ta: பின்தொடர் கோரிக்கையை ஏற்றுக்கொள்ளுங்கள்

# follow_request_ng
source: Decline the follow request
ta: பின்தொடர் கோரிக்கையை நிராகரிக்கவும்

# follow_request_rejected
source: You declined %1$s's follow request.
ta: நீங்கள் %1$s இன் பின்தொடர்தல் கோரிக்கையை குறைத்தீர்கள்.

# follow_request_authorized
source: You accepted %1$s's follow request.
ta: %1$s இன் பின்தொடர்தல் கோரிக்கையை நீங்கள் ஏற்றுக்கொண்டீர்கள்.

source: Close
ta: மூடு

source: Pseudo account
ta: போலி கணக்கு

# pseudo_account_desc
source: Read only public data on the server without log in.
ta: உள்நுழையாமல் சேவையகத்தில் பொது தரவை மட்டும் படிக்கவும்.

source: Server confirmed.
ta: சேவையகம் உறுதிப்படுத்தப்பட்டது.

# not_available_for_pseudo_account
source: Unavailable for pseudo account
ta: போலி கணக்கிற்கு கிடைக்கவில்லை

# not_available_for_misskey_account
source: Unavailable for Misskey account
ta: மிச்கி கணக்கிற்கு கிடைக்கவில்லை

# not_available_for_mastodon_account
source: Unavailable for Mastodon account
ta: மாச்டோடன் கணக்கிற்கு கிடைக்கவில்லை

# exit_app_when_close_protected_column
source: Exit app when trying to close protected column with "Back" button without confirmation
ta: உறுதிப்படுத்தப்படாமல் பாதுகாக்கப்பட்ட நெடுவரிசையை "பின்" பொத்தானைக் கொண்டு மூட முயற்சிக்கும்போது பயன்பாட்டிலிருந்து வெளியேறவும்

# resize_image
source: Resize attachment image (JPEG, PNG)
ta: இணைப்பு படம் (JPEG, Png) மறுஅளவிடுங்கள்

source: Don't resize
ta: மறுஅளவிட வேண்டாம்

# long_side_pixel
source: Resize to %1$d pixels
ta: %1$d பிக்சல்களுக்கு மறுஅளவிடுங்கள்

# resize_square_pixels
source: Resize to %1$d square pixels (equiv. %2$dx%2$d)
ta: %1$d சதுர பிக்சல்களுக்கு மறுஅளவிடுங்கள் (சமம். %2$dx %2$d)

# resize_square_pixels_2
source: Resize to %1$d square pixels (equiv. %2$s)
ta: %1$d சதுர பிக்சல்களுக்கு (சமம். %2$s)

# image_capture
source: Take a picture
ta: படம் எடுக்கவும்

# video_capture
source: Capture a video
ta: வீடியோவைப் பிடிக்கவும்

# voice_capture
source: Capture a voice
ta: ஒரு குரலைப் பிடிக்கவும்

# attachment_uploading
source: Uploading media attachment…
ta: மீடியா இணைப்பைப் பதிவேற்றுவது…

# attachment_uploaded
source: Media attachment was uploaded.
ta: ஊடக இணைப்பு பதிவேற்றப்பட்டது.

# actions_for_status
source: Actions for this post
ta: இந்த இடுகைக்கான செயல்கள்

# actions_for_user
source: Actions for this user
ta: இந்த பயனருக்கான செயல்கள்

source: Open profile
ta: திறந்த சுயவிவரம்

source: Send message
ta: செய்தி அனுப்பவும்

source: Send message from another account
ta: மற்றொரு கணக்கிலிருந்து செய்தியை அனுப்பவும்

source: Open profile from another account
ta: மற்றொரு கணக்கிலிருந்து திறந்த சுயவிவரம்

# confirm_block_user
source: Block %1$s?
ta: தொகுதி %1$s?

# confirm_mute_user
source: Mute %1$s?
ta: முடக்கு %1$s?

# confirm_delete_status
source: Delete this post?
ta: இந்த இடுகையை நீக்கவா?

# nickname_label
source: Nickname and color (if specified, it's shown instead of full acct)
ta: புனைப்பெயர் மற்றும் வண்ணம் (குறிப்பிடப்பட்டால், இது முழு ACTT க்கு பதிலாக காட்டப்பட்டுள்ளது)

source: Color
ta: நிறம்

source: Reset
ta: மீட்டமை

source: Edit
ta: தொகு

source: Preview
ta: முன்னோட்டம்

source: Nickname
ta: புனைப்பெயர்

source: Text color
ta: உரை நிறம்

source: Background color
ta: பின்னணி நிறம்

source: Save
ta: சேமி

source: Discard
ta: நிராகரிக்கவும்

# nickname_and_color_and_notification_sound
source: Nickname, Color, Notification sound
ta: புனைப்பெயர், நிறம், அறிவிப்பு ஒலி

source: Nickname and Color
ta: புனைப்பெயர் மற்றும் வண்ணம்

# nickname_applied_after_reload
source: The change of nickname/color will be applied after reload column.
ta: மறுஏற்றம் நெடுவரிசைக்குப் பிறகு புனைப்பெயர்/வண்ணத்தின் மாற்றம் பயன்படுத்தப்படும்.

# show_follow_button_in_button_bar
source: Show "Follow" button in button bar (app restart required)
ta: பொத்தான் பட்டியில் "பின்தொடர்" பொத்தானைக் காட்டு (பயன்பாட்டு மறுதொடக்கம் தேவை)

# follow_requested
source: Follow request was sent.
ta: பின்தொடர் கோரிக்கை அனுப்பப்பட்டது.

source: Confirmation
ta: உறுதிப்படுத்தல்

source: Follow locked user
ta: பூட்டப்பட்ட பயனரைப் பின்தொடரவும்

source: Don't confirm again
ta: மீண்டும் உறுதிப்படுத்த வேண்டாம்

# confirm_post_from
source: Post from %1$s?
ta: %1$s இலிருந்து இடுகையிடவா?

# confirm_follow_who_from
source: Follow %1$s from %2$s?
ta: %2$s இலிருந்து %1$s ஐப் பின்பற்றவா?

# confirm_unfollow_who_from
source: Unfollow %1$s from %2$s?
ta: %2$s இலிருந்து %1$s ஐப் பின்தொடர்கிறீர்களா?

# confirm_follow_request_who_from
source: Send follow request from %2$s to the locked user %1$s?
ta: பூட்டப்பட்ட பயனருக்கு %2$s இலிருந்து பின்தொடர் கோரிக்கையை அனுப்பவும் %1$s?

# follow_request_cant_remove_by_sender
source: seems the follow request can't be removed by its sender…
ta: பின்தொடர்தல் கோரிக்கையை அதன் அனுப்புநரால் அகற்ற முடியாது என்று தெரிகிறது…

source: Profile
ta: சுயவிவரம்

# profile_of
source: %1$s's profile
ta: %1$s இன் சுயவிவரம்

# it_is_you
source: It's you.
ta: இது நீங்கள்.

# refresh_after_toot
source: Refresh after posting
ta: இடுகையிட்ட பிறகு புதுப்பிக்கவும்

# refresh_scroll_to_toot
source: Refresh, scroll to the post
ta: புதுப்பிக்கவும், இடுகைக்கு உருட்டவும்

# refresh_no_scroll
source: Refresh, don't scroll
ta: புதுப்பிக்கவும், உருட்ட வேண்டாம்

source: Don't refresh
ta: புதுப்பிக்க வேண்டாம்

source: Boosted by…
ta: உயர்த்தப்பட்டது…

source: Favourited by…
ta: வழங்கியவர்…

source: hashtag
ta: ஏச்டேக்

source: conversation
ta: உரையாடல்

# account_picker_open_user_who
source: Account to open user %1$s?
ta: பயனர் %1$s ஐ திறக்க கணக்கு?

# account_picker_add_timeline_of
source: Account to open %1$s?
ta: %1$s ஐ திறக்க கணக்கு?

# account_picker_open_setting
source: Account to open setting?
ta: திறந்த அமைப்பிற்கு கணக்கு?

# account_picker_favourite
source: Account to favourite?
ta: பிடித்ததற்கு கணக்கு?

# account_picker_bookmark
source: Account to bookmark?
ta: புக்மார்க்கு கணக்கு?

# account_picker_boost
source: Account to boost?
ta: அதிகரிக்க கணக்கு?

# account_picker_reaction
source: Account to react?
ta: எதிர்வினையாற்ற கணக்கு?

# account_picker_follow
source: Account to follow?
ta: பின்பற்ற வேண்டிய கணக்கு?

# account_picker_toot
source: Account to post?
ta: இடுகையிட கணக்கு?

# account_picker_mute
source: Account to mute user %1$s?
ta: முடக்கு பயனர் %1$s க்கு கணக்கு?

# account_picker_block
source: Account to block user %1$s?
ta: பயனர் %1$s ஐத் தடுக்க கணக்கு?

source: QR code
ta: QR குறியீடு

# generating_qr_code
source: Making QR code…
ta: QR குறியீட்டை உருவாக்குதல்…

source: Media attachment
ta: ஊடக இணைப்பு

source: Visibility
ta: விழிமை

source: Clear
ta: தெளிவான

# toot
source: Post
ta: இடுகை

source: Clear text
ta: உரையை அழிக்கவும்

source: Clear text and media
ta: உரை மற்றும் ஊடகங்களை அழிக்கவும்

source: Menu
ta: பட்டியல்

# open_in_pseudo_account
source: Open in emulated account on %1$s
ta: %1$s இல் பின்பற்றப்பட்ட கணக்கில் திறக்கவும்

source: Color and Background…
ta: நிறம் மற்றும் பின்னணி…

source: Column background
ta: நெடுவரிசை பின்னணி

# pick_image
source: Pick an image
ta: ஒரு படத்தைத் தேர்ந்தெடுக்கவும்

source: Pick images or video…
ta: படங்கள் அல்லது வீடியோவைத் தேர்ந்தெடுக்கவும்…

source: Pick image(s)…
ta: படங்களைத் தேர்ந்தெடு)…

source: Pick video(s)…
ta: வீடியோ (களை) தேர்ந்தெடு…

# pick_audios
source: Choose audio file(s)…
ta: ஆடியோ கோப்பு (களை) தேர்வு செய்யவும்…

source: Image alpha
ta: உருவ ஆல்பா

source: Image
ta: படம்

source: Column header
ta: நெடுவரிசை தலைப்பு

source: Foreground color
ta: முன்புற நிறம்

# hashtag_and_visibility_not_match
source: this message contains hashtags, but message visibility is not public. normally hashtags are searchable only in public messages. Are you sure?
ta: இந்த செய்தியில் ஏச்டேக்குகள் உள்ளன, ஆனால் செய்தி தெரிவுநிலை பொதுவில் இல்லை. பொதுவாக ஏச்டேக்குகள் பொது செய்திகளில் மட்டுமே தேடப்படுகின்றன. நீங்கள் உறுதியாக இருக்கிறீர்களா?

# copy_st
source: Copy
ta: நகலெடு

source: Send
ta: அனுப்பு

# mute_word
source: Ban word
ta: வார்த்தையை தடை செய்யுங்கள்
