Repository: 247i/TACETr
Catalog: உரை/தானி/subway-tooter-strings-*.po
Languages: ta

source: Update push subscription(not force)
ta: புச் சந்தாவைப் புதுப்பிக்கவும் (சக்தி அல்ல)

source: Reset notification tracking status
ta: அறிவிப்பு கண்காணிப்பு நிலையை மீட்டமைக்கவும்

source: Web browser
ta: வலை உலாவி

# visibility_unknown
source: Unknown
ta: தெரியவில்லை

# visibility_limited
source: Limited
ta: வரையறுக்கப்பட்ட

# visibility_mutual
source: Mutual
ta: பரச்பர

# server_has_no_support_of_visibility
source: Server has no support of visibility '%1$s'.
ta: '%1$s' தெரிவுநிலைக்கு சேவையகத்திற்கு எந்த ஆதரவும் இல்லை.

source: Show emoji picker other category
ta: ஈமோசி பிக்கர் பிற வகையைக் காட்டு

# in_app_unicode_emoji
source: use in-app Unicode Emoji (app restart required)
ta: பயன்பாட்டில் உள்ள யூனிகோட் ஈமோசியைப் பயன்படுத்தவும் (பயன்பாட்டு மறுதொடக்கம் தேவை)

# emoji_category_composite_tones
source: Composite Tones
ta: கலப்பு டோன்கள்

source: Resend confirm mail…
ta: அஞ்சலை உறுதிப்படுத்தவும்…

# update_mail_address
source: Update e-mail address
ta: மின்னஞ்சல் முகவரியைப் புதுப்பிக்கவும்

# resend_confirm_mail_requested
source: Resending confirm E-mail was requested.
ta: உறுதிப்படுத்தும் உறுதிப்படுத்தும் மின்னஞ்சல் கோரப்பட்டது.

# confirm_mail_description
source: After requesting resending confirm E-mail, - please check the mail on your mailer. - open confirm link in the mail. - close this dialog and reload column.
ta: மறுசீரமைக்கப்பட்ட மின்னஞ்சலை மறுசீரமைத்த பிறகு, - உங்கள் அஞ்சலில் அஞ்சலை சரிபார்க்கவும். - அஞ்சலில் உறுதிப்படுத்தல் இணைப்பைத் திறக்கவும். - இந்த உரையாடலை மூடி, நெடுவரிசையை மீண்டும் ஏற்றவும்.

source: Push notification filter
ta: அறிவிப்பு வடிகட்டியை அழுத்தவும்

source: No one
ta: யாரும் இல்லை

source: Reactioned posts
ta: எதிர்விளைவுகள்

source: Reactions
ta: எதிர்வினைகள்

# cant_reaction_remote_custom_emoji
source: can't reaction with remote custom emoji %1$s
ta: தொலைநிலை தனிப்பயன் ஈமோசி %1$s உடன் எதிர்வினை செய்ய முடியாது

# keep_reaction_space
source: Keep Spacing for Reactions
ta: எதிர்வினைகளுக்கு இடைவெளியைத் தொடருங்கள்

source: long tap to delete
ta: நீக்க நீண்ட தட்டு

source: Suggestion source
ta: பரிந்துரை மூல

source: Can't leave empty keyword.
ta: வெற்று முக்கிய சொல்லை விட முடியாது.

source: Can't save duplicated keyword.
ta: நகல் முக்கிய சொல்லைச் சேமிக்க முடியாது.

source: Discard changes?
ta: மாற்றங்களை நிராகரிக்கவா?

source: saved.
ta: சேமிக்கப்பட்டது.

# not_available_for_current_accounts
source: Unavailable for current accounts
ta: நடப்பு கணக்குகளுக்கு கிடைக்கவில்லை

# confirm_reaction
source: Reaction %1$s from %2$s?
ta: %2$s இலிருந்து %1$s?

# confirm_reaction_to_pleroma
source: Reaction custom emoji %1$s from %2$s to server %3$s that may not support custom emoji reaction. Continue?
ta: எதிர்வினை தனிப்பயன் ஈமோசி எதிர்வினையை ஆதரிக்காமல் போகக்கூடிய எதிர்வினை தனிப்பயன் ஈமோசி %1$s %2$s முதல் சேவையகம் %3$s வரை. தொடரவா?

# multi_window_post
source: Multi window for post activity (experimental)
ta: பிந்தைய செயல்பாட்டிற்கான பல சாளரம் (சோதனை)

# many_window_post
source: Many window for post activity (experimental)
ta: பிந்தைய செயல்பாட்டிற்கான பல சாளரம் (சோதனை)

# mfm_decoration_enabled
source: (Misskey)Show text decorations
ta: (மிசி) உரை அலங்காரங்களைக் காட்டுங்கள்

# mfm_show_unsupported_markup
source: (Misskey)Show unsupported markups
ta: (மிசி) ஆதரிக்கப்படாத மார்க்அப்களைக் காட்டுங்கள்

source: Show media description
ta: ஊடக விளக்கத்தைக் காட்டு

source: Background pattern
ta: பின்னணி முறை

source: Use Twemoji emoji
ta: ட்வெமோசி ஈமோசியைப் பயன்படுத்தவும்

source: Open column from URL…
ta: முகவரி இலிருந்து நெடுவரிசையைத் திறக்கவும்…

# url_empty
source: please input URL of user or status.
ta: பயனர் அல்லது அந்தச்தின் முகவரி ஐ உள்ளிடவும்.

source: URL of user or status
ta: பயனர் அல்லது அந்தச்தின் முகவரி

# url_parse_failed
source: parse error.
ta: இந்த பிழை.

source: Unbookmark
ta: புத்தகமரம்

# event_text_alpha
source: Text alpha for some notifications (0.0～1.0, default=1. app restart required)
ta: சில அறிவிப்புகளுக்கான உரை ஆல்பா (0.0 ～ 1.0, இயல்புநிலை = 1. பயன்பாட்டு மறுதொடக்கம் தேவை)

# attachment_handling_start
source: Initializing…
ta: தொடங்குதல்…

# attachment_handling_compress
source: Compressing…
ta: அமுக்குதல்…

# attachment_handling_compress_ratio
source: Compressing %1$d%%…
ta: சுருக்கம்%1$d %%…

# attachment_handling_uploading
source: Uploading %1$d%%…
ta: பதிவேற்றுவது%1$d %%…

# attachment_handling_waiting
source: Waiting response…
ta: காத்திருப்பு பதில்…

# attachment_handling_waiting_async
source: Waiting response(asynchronized)…
ta: காத்திருப்பு பதில் (ஒத்திசைவற்றது)…

# option_deprecated_mastodon342
source: (This option is deprecated for Mastodon 3.4.2+. App uses information from the server.)
ta: (இந்த விருப்பம் மாச்டோடன் 3.4.2+ க்கு நீக்கப்பட்டது. பயன்பாடு சேவையகத்திலிருந்து தகவல்களைப் பயன்படுத்துகிறது.)

# movie_transcode
source: Movie transcoding
ta: மூவி டிரான்ச்கோடிங்

# movie_transcode_mode
source: Mode
ta: பயன்முறை

# movie_transcode_max_bitrate
source: Max bitrate (Unit:bits per second. default=2,000,000. Also it may be reduced by server configuration.)
ta: மேக்ச் பிட்ரேட் (அலகு: நொடிக்கு பிட்கள். இயல்புநிலை = 2,000,000. மேலும் இது சேவையக உள்ளமைவால் குறைக்கப்படலாம்.)

# movie_transcode_max_frame_rate
source: Max frame rate(Unit:frames per second. default=30. Also it may be reduced by server configuration.)
ta: அதிகபட்ச பிரேம் வீதம் (அலகு: நொடிக்கு பிரேம்கள். இயல்புநிலை = 30. மேலும் இது சேவையக உள்ளமைவால் குறைக்கப்படலாம்.)

# movie_transcode_max_square_pixels
source: Max square pixels(default=2304000. Also it may be reduced by server configuration.)
ta: அதிகபட்ச சதுர படப்புள்ளிகள் (இயல்புநிலை = 2304000. மேலும் இது சேவையக உள்ளமைவால் குறைக்கப்படலாம்.)

source: Always
ta: எப்போதும்

source: Auto
ta: தானி

# status_edit
source: Edit (Mastodon 3.5.0+)
ta: திருத்து (மாச்டோடன் 3.5.0+)

source: edited
ta: திருத்தப்பட்டது

source: Edit history
ta: வரலாற்றைத் திருத்து

# post_language_code
source: Language code of Post (leave empty to use device's language setting)
ta: இடுகையின் மொழி குறியீடு (சாதனத்தின் மொழி அமைப்பைப் பயன்படுத்த காலியாக விடவும்)

# device_language
source: (device's language)
ta: (சாதனத்தின் மொழி)

source: Skin tones
ta: தோல் டோன்கள்

# skin_tone_unspecified
source: Unspecified
ta: குறிப்பிடப்படாத

source: Search emojis…
ta: ஈமோசிகளைத் தேடுங்கள்…

source: Categories
ta: வகைகள்

source: Error
ta: பிழை

# emoji_picker_custom_of
source: Custom: %1$s
ta: தனிப்பயன்: %1$s

source: Others
ta: மற்றவர்கள்

# post_error_attachments_duplicated
source: Misskey does not allow duplicate in attachments.
ta: இணைப்புகளில் நகல் அனுமதிக்காது.

# use_web_settings
source: (Use web setting)
ta: (வலை அமைப்பைப் பயன்படுத்தவும்)

source: Content
ta: உள்ளடக்கம்

# enable_misskey_notification_check
source: Enable notification check for Misskey server (unstable)
ta: மிசி சேவையகத்திற்கான அறிவிப்பு காசோலையை இயக்கவும் (நிலையற்றது)

# old_devices_warning
source: End of support for older devices
ta: பழைய சாதனங்களுக்கான ஆதரவின் முடிவு

# followed_tags
source: Followed hashtags
ta: ஏச்டேக்குகளைத் தொடர்ந்து

# follow_hashtag_of
source: Follow %1$s
ta: %1$s ஐப் பின்தொடரவும்

# unfollow_hashtag_of
source: Unfollow %1$s
ta: பின்பற்ற %1$s

# conversation_with_reference
source: conversation + reference
ta: உரையாடல் + குறிப்பு

# tootsearch_discontinued
source: Tootsearch service discontinued on 2022/12/25.
ta: டூட்ச் தேடல் பணி 2022/12/25 அன்று நிறுத்தப்பட்டது.

# msp_discontinued
source: Mastodon Search Portal service was discontinued.
ta: மாச்டோடன் தேடல் போர்டல் பணி நிறுத்தப்பட்டது.

# permission_rational_notifications
source: to check/show notifications, the app need runtime permission.
ta: அறிவிப்புகளை சரிபார்க்க/காட்ட, பயன்பாட்டிற்கு இயக்க நேர இசைவு தேவை.

# permission_denied_notifications
source: Missing app permission to show notifications.
ta: அறிவிப்புகளைக் காட்ட பயன்பாட்டு இசைவு இல்லை.

# permission_rational_download_manager
source: Permission required to use DownloadManager.
ta: DownloadManager ஐப் பயன்படுத்த இசைவு தேவை.

# permission_denied_download_manager
source: Missing app permission to use DownloadManager.
ta: DownloadManager ஐப் பயன்படுத்த பயன்பாட்டு இசைவு இல்லை.

# permission_rational_media_access
source: Permission required to access the device's media data.
ta: சாதனத்தின் மீடியா தரவை அணுக இசைவு தேவை.

# permission_denied_media_access
source: Missing app permission to access the device's media data.
ta: சாதனத்தின் மீடியா தரவை அணுக பயன்பாட்டு இசைவு இல்லை.

source: Popup background color
ta: பாப்அப் பின்னணி நிறம்

source: Filter title
ta: வடிகட்டி தலைப்பு

source: Filter action
ta: வடிகட்டி செயல்

# filter_action_warn
source: Hide, but warn about filter.
ta: மறைக்க, ஆனால் வடிகட்டி பற்றி எச்சரிக்கவும்.

# filter_action_hide
source: Hide. (for old server, it works as Irreversible)
ta: மறை. (பழைய சேவையகத்தைப் பொறுத்தவரை, இது மாற்ற முடியாததாக செயல்படுகிறது)

source: Keyword or phrase
ta: முக்கிய சொல் அல்லது சொற்றொடர்

source: Add Keyword or phrase
ta: முக்கிய சொல் அல்லது சொற்றொடரைச் சேர்க்கவும்

# filter_keyword_empty
source: filter keyword(s) is empty.
ta: வடிகட்டி முக்கிய சொல் (கள்) காலியாக உள்ளது.

# filter_title_empty
source: filter title is empty.
ta: வடிகட்டி தலைப்பு காலியாக உள்ளது.

source: Acct customize
ta: Acct தனிப்பயனாக்கு

# delete_confirm
source: delete "%1$s" ?
ta: "%1$s" ஐ நீக்கவா?

# color_theme_changed
source: Default color theme has been updated. This may conflict with your customized color settings. We recommend reviewing the colors section in app settings.
ta: இயல்புநிலை வண்ண கருப்பொருள் புதுப்பிக்கப்பட்டுள்ளது. இது உங்கள் தனிப்பயனாக்கப்பட்ட வண்ண அமைப்புகளுடன் முரண்படக்கூடும். பயன்பாட்டு அமைப்புகளில் வண்ணங்கள் பகுதியை மதிப்பாய்வு செய்ய பரிந்துரைக்கிறோம்.

# tablet_snap
source: Align column edge to screen edge when scrolling (app restart required)
ta: ச்க்ரோலிங் செய்யும் போது நெடுவரிசை விளிம்பை திரை விளிம்பிற்கு சீரமைக்கவும் (பயன்பாட்டு மறுதொடக்கம் தேவை)

# server_host_name
source: Server's host name
ta: சேவையகத்தின் புரவலன் பெயர்

# input_server_name_desc
source: ・The host name part in the server's URL. ・without http:// or trailing /path… . ・Mastodon server list: https://joinmastodon.org/servers
ta: சேவையகம் சேவையகத்தின் முகவரி இல் புரவலன் பெயர் பகுதி. Ht http: // அல்லது பின்னால்/பாதை இல்லாமல்…. ・ மாச்டோடன் சேவையக பட்டியல்: https://joinmastodon.org/servers

# authentication_select
source: Select authentication method
ta: அங்கீகார முறையைத் தேர்ந்தெடுக்கவும்

# authentication_select_desc
source: Select how to access the server from below.
ta: கீழே இருந்து சேவையகத்தை எவ்வாறு அணுகுவது என்பதைத் தேர்ந்தெடுக்கவும்.

# server_host_name_cant_contains_it
source: host name can't contains [%1$s].
ta: புரவலன் பெயரில் [%1$s] இருக்க முடியாது.

source: Next step
ta: அடுத்த அடி

# user_creation_not_supported
source: [%1$s, %2$s] server type does not support user registration from app.
ta: [ %1$s, %2$s] சேவையக வகை பயன்பாட்டிலிருந்து பயனர் பதிவை ஆதரிக்காது.

# confirm_remove_column_mark_as_dont_close
source: Remove column that mark as "don't close" ?
ta: "மூடாதே" என்று குறிக்கும் நெடுவரிசையை அகற்றவா?

source: Alert
ta: விழிப்புணர்வு

# alert_notification_desc
source: shows various alerts
ta: பல்வேறு விழிப்பூட்டல்களைக் காட்டுகிறது

source: Push message
ta: செய்தி தள்ளுங்கள்

# push_message_desc
source: shows various push messages from SNS server.
ta: SNS சேவையகத்திலிருந்து பல்வேறு புச் செய்திகளைக் காட்டுகிறது.

source: Pull notification
ta: அறிவிப்பை இழுக்கவும்

# pull_notification_desc
source: notifications pulled from SNS
ta: SNS இலிருந்து அறிவிப்புகள் இழுக்கப்படுகின்றன

# push_worker
source: Push notification handler
ta: அறிவிப்பு கையாளுபவர் தள்ளுங்கள்

# push_worker_desc
source: processing tasks about push notification
ta: புச் அறிவிப்பு பற்றிய பணிகளை செயலாக்குகிறது

# polling_foregrounder_desc
source: polling new notifications from SNS
ta: SNS இலிருந்து புதிய அறிவிப்புகளை வாக்களித்தல்

source: Server timeout
ta: சேவையக நேரம் முடிந்தது

# server_timeout_desc
source: showing errors about checking notifications from SNS
ta: SNS இலிருந்து அறிவிப்புகளை சரிபார்ப்பது பற்றிய பிழைகளைக் காட்டுகிறது

source: Push distributor
ta: புச் விநியோகச்தர்

# push_distributor_desc
source: select push distributer that is used to deliver push notification,
ta: புச் அறிவிப்பை வழங்க பயன்படும் புச் விநியோகச்தரைத் தேர்ந்தெடுக்கவும்,

source: Select push delivery service
ta: புச் டெலிவரி சேவையைத் தேர்ந்தெடுக்கவும்

# firebase_cloud_messaging
source: Google FCM(Firebase Cloud Messaging)
ta: கூகிள் எஃப்.சி.எம் (ஃபயர்பேச் முகில் மெசேசிங்)

source: none
ta: எதுவுமில்லை

source: Approved.
ta: அங்கீகரிக்கப்பட்டது.

# push_subscription_keep_using
source: Continues current subscription.
ta: தற்போதைய சந்தாவைத் தொடர்கிறது.

# push_subscription_off_unread_notification
source: Continues current subscription. (sendReadMessage has been turned off.)
ta: தொடர்ச்சியான தற்போதைய சந்தா. (ஒரு செய்தி அணைக்கப்பட்டுள்ளது.)

# push_subscription_delete_current
source: Push subscription has been canceled.
ta: புச் சந்தா ரத்து செய்யப்பட்டுள்ளது.

# push_subscription_app_server_hash_missing_but_ok
source: The push delivery service has not been registered on the app server, but there is no problem because the subscription is not required.
ta: பயன்பாட்டு சேவையகத்தில் புச் டெலிவரி பணி பதிவு செய்யப்படவில்லை, ஆனால் சந்தா தேவையில்லை என்பதால் எந்த பிரச்சனையும் இல்லை.

# push_subscription_app_server_hash_missing_error
source: The push delivery service could not be registered with the app server. Selecting the push delivery service again may improve the situation.
ta: புச் டெலிவரி சேவையை பயன்பாட்டு சேவையகத்துடன் பதிவு செய்ய முடியவில்லை. புச் டெலிவரி சேவையைத் தேர்ந்தெடுப்பது நிலைமையை மேம்படுத்தக்கூடும்.

# incorrect_chars
source: incorrect chars "%1$s"
ta: தவறான எழுத்துக்கள் "%1$s"

source: Account list
ta: கணக்கு பட்டியல்

# post_reset_confirm
source: Save to drafts and edit new post?
ta: வரைவுகளைச் சேமித்து புதிய இடுகையைத் திருத்தவா?

source: Removing old distributer…
ta: பழைய விநியோகச்தரை நீக்குதல்…

# test_progress_dialog
source: progress dialog test
ta: முன்னேற்ற உரையாடல் சோதனை

# push_subscription_is_not_required
source: Push subscription is not required because notifications not enabled, or push distributer is not enabled.
ta: புச் சந்தா தேவையில்லை, ஏனெனில் அறிவிப்புகள் இயக்கப்படவில்லை, அல்லது புச் விநியோகச்தர் இயக்கப்படவில்லை.

# push_subscription_is_not_required_delete_secret_keys
source: Secret key is no longer used, and it has been deleted.
ta: ரகசிய விசை இனி பயன்படுத்தப்படாது, அது நீக்கப்பட்டது.

# push_subscription_exists_but_not_created_by_this_device
source: Push subscription is found, but not created by this device.
ta: புச் சந்தா காணப்படுகிறது, ஆனால் இந்த சாதனத்தால் உருவாக்கப்படவில்லை.

# push_subscription_creating_new_secret_key
source: Creating secret key…
ta: ரகசிய விசையை உருவாக்குதல்…

# push_subscription_creating
source: Creating new push subscription…
ta: புதிய புச் சந்தாவை உருவாக்குதல்…

# push_subscription_server_key_saved
source: Server key has been saved.
ta: சேவையக விசை சேமிக்கப்பட்டது.

source: Push subscription completed.
ta: புச் சந்தா முடிந்தது.

# push_message_re_decode
source: Reprocessing
ta: மறு செயலாக்கம்

# push_message_save_to_download_folder
source: Save to download folder
ta: கோப்புறையைப் பதிவிறக்க சேமிக்கவும்

# push_message_save_to_download_folder_with_secret_key
source: Save to download folder (with secret key. Be careful with data security, This is dangerous!)
ta: பதிவிறக்க கோப்புறையில் சேமிக்கவும் (ரகசிய விசையுடன். தரவு பாதுகாப்பில் கவனமாக இருங்கள், இது ஆபத்தானது!)

source: Push message history
ta: செய்தி வரலாற்றை தள்ளுங்கள்

# alert_test
source: test alert notification
ta: சோதனை எச்சரிக்கை அறிவிப்பு

# saved_to
source: Saved to %1$s
ta: %1$s க்கு சேமிக்கப்பட்டது

source: View
ta: பார்வை

source: notification permission not granted
ta: அறிவிப்பு இசைவு வழங்கப்படவில்லை

# push_notification_use
source: Use push subscription to receive notification.
ta: அறிவிப்பைப் பெற புச் சந்தாவைப் பயன்படுத்தவும்.

# pull_notification_use
source: Use pull check periodically to load notification.
ta: அறிவிப்பை ஏற்றுவதற்கு அவ்வப்போது புல் காசோலை பயன்படுத்தவும்.

source: Server configuration
ta: சேவையக உள்ளமைவு

source: Fedibird capacities
ta: ஃபெடிபேர்ட் திறன்கள்

# push_subscription_exists_updateing
source: Updating current push subscription…
ta: தற்போதைய புச் சந்தாவைப் புதுப்பித்தல்…

source: Manually update
ta: கைமுறையாக புதுப்பிக்கவும்

# notification_push_distributor_disabled
source: Notification push distributor not selected.
ta: அறிவிப்பு புச் விநியோகச்தர் தேர்ந்தெடுக்கப்படவில்லை.

source: Notification accent color
ta: அறிவிப்பு உச்சரிப்பு நிறம்

source: Pleroma features
ta: பிளெரோமா நற்பொருத்தங்கள்

# unified_push_got_new_endpoint_url
source: Got new UnifiedPush endpoint URL…
ta: புதிய ஒருங்கிணைந்த புச் எண்ட்பாயிண்ட் முகவரி கிடைத்தது…

# removing_old_fcm_token
source: Removing expired FCM device token from app server…
ta: பயன்பாட்டு சேவையகத்திலிருந்து காலாவதியான FCM சாதன கிள்ளாக்கை நீக்குதல்…

# removing_old_unified_push_url
source: Removing expired UnifiedPush endpoint URL from app server…
ta: பயன்பாட்டு சேவையகத்திலிருந்து காலாவதியான ஒருங்கிணைந்த புச் எண்ட்பாயிண்ட் முகவரி ஐ நீக்குதல்…

# sending_push_distributor_info_to_app_server
source: Sending push service information to app server…
ta: பயன்பாட்டு சேவையகத்திற்கு புச் பணி தகவல்களை அனுப்புகிறது…

# push_distributor_not_available
source: Push distributor is not available. You can receive push notifications by installing a UnifiedPush compatible push delivery app. see https://unifiedpush.org/
ta: புச் விநியோகச்தர் கிடைக்கவில்லை. ஒருங்கிணைந்த புச் இணக்கமான புச் டெலிவரி பயன்பாட்டை நிறுவுவதன் மூலம் நீங்கள் புச் அறிவிப்புகளைப் பெறலாம். https://unifiedpush.org/ ஐப் பார்க்கவும்

source: glide test
ta: சறுக்கு சோதனை

# default_post_account_default_action
source: viewing column account(phone), or ask always(tablet)
ta: நெடுவரிசை கணக்கைப் பார்ப்பது (தொலைபேசி), அல்லது எப்போதும் கேளுங்கள் (டேப்லெட்)

source: Quick post account
ta: விரைவான இடுகை கணக்கு

source: Show username on filtered post
ta: வடிகட்டப்பட்ட இடுகையில் பயனர்பெயரைக் காட்டு

# log_save_level
source: Log collection level
ta: பதிவு சேகரிப்பு நிலை

# log_all
source: all
ta: அனைத்தும்

# log_verbose
source: verbose
ta: வாய்மொழி

# log_debug
source: debug
ta: பிழைத்திருத்தம்

# log_info
source: info
ta: தகவல்

# log_warn
source: warn
ta: எச்சரிக்கை

# log_error
source: error
ta: பிழை

# log_assert
source: assert
ta: உறுதிப்படுத்தவும்

# send_log_email
source: Send logs by e-mail
ta: மின்னஞ்சல் மூலம் பதிவுகளை அனுப்பவும்

source: Bug report
ta: பிழை அறிக்கை

# bug_report_desc
source: The app keeps logs for the past few days, but does not send them outside without permission. It is only referenced when the user explicitly sends logs.
ta: பயன்பாடு கடந்த சில நாட்களாக பதிவுகளை வைத்திருக்கிறது, ஆனால் அவற்றை அனுமதியின்றி வெளியே அனுப்பாது. பயனர் வெளிப்படையாக பதிவுகளை அனுப்பும்போது மட்டுமே இது குறிப்பிடப்படுகிறது.

# log_save_level_desc
source: Log severity level. Logs with a severity less than this setting will not be collected.
ta: பதிவு தீவிர நிலை. இந்த அமைப்பைக் காட்டிலும் குறைவான தீவிரத்தன்மை கொண்ட பதிவுகள் சேகரிக்கப்படாது.

# image_alpha_too_low
source: background image alpha is too low. can you view the image?
ta: பின்னணி பட ஆல்பா மிகக் குறைவு. படத்தைப் பார்க்க முடியுமா?

source: Enable deprecated something
ta: எதையாவது நீக்கியது

# misskey_support_end
source: Misskey support has ended
ta: மிச்கி உதவி முடிந்தது

# emoji_size_mastodon
source: (Mastodon)Custom emoji scaling(Unit:%. default:100)
ta: (மாச்டோடன்) தனிப்பயன் ஈமோசி அளவிடுதல் (அலகு:%. இயல்புநிலை: 100)

# emoji_size_misskey
source: (Misskey)Custom emoji scaling(Unit:%。default:250)
ta: (மிசி) தனிப்பயன் ஈமோசி அளவிடுதல் (அலகு:%。 இயல்புநிலை: 250)

# emoji_size_reaction
source: Reaction emoji scaling(Unit:%。default:150)
ta: எதிர்வினை ஈமோசி அளவிடுதல் (அலகு:%。 இயல்புநிலை: 150)

# emoji_size_user_name
source: User name emoji scaling(Unit:%。default:100)
ta: பயனர் பெயர் ஈமோசி அளவிடுதல் (அலகு:%。 இயல்புநிலை: 100)

# emoji_wide_mode
source: Wide custom emoji
ta: பரந்த தனிப்பயன் ஈமோசி

source: Enabled
ta: இயக்கப்பட்டது

source: Disabled
ta: முடக்கப்பட்டது

# emoji_texture_pixels
source: Emoji texture max pixels(Unix:pixels, default: 128. task kill required. reduce to 64 if your device's RAM is not enough)
ta: ஈமோசி அமைப்பு அதிகபட்ச படப்புள்ளிகள் (யூனிக்ச்: படப்புள்ளிகள், இயல்புநிலை: 128. பணியைக் கொலை தேவை. உங்கள் சாதனத்தின் ரேம் போதுமானதாக இல்லாவிட்டால் 64 ஆக குறைக்கவும்)

# emoji_picker_category_collapse
source: Collapse emoji picker categories (turning off it will very slow if your servers has a lot of emojis)
ta: ஈமோசி பிக்கர் வகைகளை சரிவது (உங்கள் சேவையகங்களில் நிறைய ஈமோசிகள் இருந்தால் அதை அணைக்க மிகவும் மெதுவாக இருக்கும்)

# unfollow_hashtag_confirm
source: unfollow hashtag "%1$s"?
ta: "%1$s" ஆச்டாக்?

# plugin_app_intro
source: Introduction to plug-in apps
ta: செருகுநிரல் பயன்பாடுகளுக்கு அறிமுகம்

# autocomplete_list_loading
source: loading autocomplete list…
ta: தன்னியக்கவியல் பட்டியலை ஏற்றுகிறது…

# media_count
source: %1$d attachments (tap to see all)
ta: %1$d இணைப்புகள் (அனைத்தையும் பார்க்க தட்டவும்)

source: applied when post.
ta: இடுகையின் போது பயன்படுத்தப்படும்.

# exceed_reaction_per_account
source: Reaction limit is %1$d.
ta: எதிர்வினை வரம்பு %1$d ஆகும்.

source: Copy reaction name
ta: எதிர்வினை பெயரை நகலெடுக்கவும்

source: Send to other app
ta: பிற பயன்பாட்டிற்கு அனுப்பவும்

source: Save to local folder
ta: உள்ளக கோப்புறையில் சேமிக்கவும்

# app_data_export_import
source: Export/Import app data
ta: பயன்பாட்டு தரவை ஏற்றுமதி/இறக்குமதி செய்யுங்கள்

# translate_or_custom_share
source: Translate/Custom share buttons
ta: மொழிபெயர்க்க/தனிப்பயன் பகிர்வு பொத்தான்கள்

source: Use WebP format if server accepts.
ta: சேவையகம் ஏற்றுக்கொண்டால் WebP வடிவமைப்பைப் பயன்படுத்தவும்.

source: Detail
ta: விவரம்

source: Emoji detail
ta: ஈமோசி விவரம்

# post_404_desc
source: (Or, you reply to follower-only post from other account)
ta: (அல்லது, மற்ற கணக்கிலிருந்து பின்தொடர்பவர் மட்டுமே இடுகைக்கு பதிலளிக்கிறீர்கள்)

source: rearrange
ta: மறுசீரமைக்கவும்

# attachment_rearrange_desc
source: Drag to rearrange.
ta: மறுசீரமைக்க இழுக்கவும்.

# language_filter_importing
source: Importing language filter…
ta: மொழி வடிகட்டியை இறக்குமதி செய்தல்…

# language_filter_loading
source: Loading available languages…
ta: கிடைக்கக்கூடிய மொழிகளை ஏற்றுகிறது…

# language_name_montenegrin
source: Montenegrin
ta: மாண்டினெக்ரின்

source: Agg. boosts
ta: Agg. ஊக்கங்கள்

# agg_status_limit
source: prove posts limit
ta: இடுகைகளின் வரம்பு நிரூபிக்கவும்

# display_name_boosted_by_agg
source: %1$s and %2$s followings boosted.
ta: %1$s மற்றும் %2$s பின்தொடர்தல் அதிகரித்தது.

# notification_type_severed_relationships
source: severed relationships
ta: துண்டிக்கப்பட்ட உறவுகள்

# servered_relationships_domain_block
source: %1$s admin/moderator has blocked domain %2$s.
ta: %1$s நிர்வாகம்/மதிப்பீட்டாளர் டொமைன் %2$s ஐத் தடுத்துள்ளார்.

# servered_relationships_account_suspension
source: %1$s admin/moderator has suspended account %2$s.
ta: %1$s நிர்வாகம்/மதிப்பீட்டாளர் கணக்கு %2$s ஐ இடைநீக்கம் செய்துள்ளார்.

# servered_relationships_user_domain_block
source: user %1$s have blocked domain %2$s.
ta: பயனர் %1$s டொமைன் %2$s ஐத் தடுத்துள்ளன.

# count_following_1
source: %1$d account you follow
ta: நீங்கள் பின்பற்றும் %1$d கணக்கு

# count_followings
source: %1$d accounts you follow
ta: நீங்கள் பின்பற்றும் %1$d கணக்குகள்

# count_follower_1
source: %1$d of your follower
ta: உங்கள் பின்தொடர்பவரின் %1$d

# count_followers
source: %1$d of your followers
ta: உங்களைப் பின்தொடர்பவர்களில் %1$d

# losts_join
source: and
ta: மற்றும்

# lost_relationships
source: you lost %1$s.
ta: நீங்கள் %1$s இழந்துவிட்டீர்கள்.

# check_details_web_ui
source: Check details in Web UI.
ta: வலை இடைமுகம் இல் விவரங்களைச் சரிபார்க்கவும்.

source: back
ta: பின்
