Repository: 247i/TACETr
Catalog: உரை/தானி/tagstudio-strings-*.po
Languages: ta

# app.git
source: Git Commit
ta: அறிவிலி கமிட்

# app.pre_release
source: Pre-Release
ta: முன் வெளியீடு

# app.title
source: {base_title} - Library '{library_dir}'
ta: {base_title} - நூலகம் '{library_dir}'

# color_manager.title
source: Manage Tag Colors
ta: குறிச்சொல் வண்ணங்களை நிர்வகிக்கவும்

# color.color_border
source: Use Secondary Color for Border
ta: எல்லைக்கு இரண்டாம் நிலை வண்ணத்தைப் பயன்படுத்தவும்

# color.confirm_delete
source: Are you sure you want to delete the color "{color_name}"?
ta: "{color_name}" என்ற வண்ணத்தை நீக்க விரும்புகிறீர்களா?

# color.delete
source: Delete Tag
ta: குறிச்சொல்லை நீக்கு

# color.import_pack
source: Import Color Pack
ta: வண்ண பேக் இறக்குமதி

# color.name
source: Name
ta: பெயர்

# color.namespace.delete.prompt
source: Are you sure you want to delete this color namespace? This will delete ALL colors in the namespace along with it!
ta: இந்த வண்ண பெயர்வெளியை நீக்க விரும்புகிறீர்களா? இது பெயர்வெளியில் உள்ள அனைத்து வண்ணங்களையும் நீக்கிவிடும்!

# color.namespace.delete.title
source: Delete Color Namespace
ta: வண்ண பெயர்வெளியை நீக்கு

# color.new
source: New Color
ta: புதிய நிறம்

# color.placeholder
source: Color
ta: நிறம்

# color.primary_required
source: Primary Color (Required)
ta: முதன்மை நிறம் (தேவை)

# color.primary
source: Primary Color
ta: முதன்மை நிறம்

# color.secondary
source: Secondary Color
ta: இரண்டாம் நிலை நிறம்

# color.title.no_color
source: No Color
ta: நிறம் இல்லை

# drop_import.description
source: The following files match file paths that already exist in the library
ta: பின்வரும் கோப்புகள் ஏற்கனவே நூலகத்தில் இருக்கும் கோப்பு பாதைகளுடன் பொருந்துகின்றன

# drop_import.duplicates_choice.plural
source: The following {count} files match file paths that already exist in the library.
ta: பின்வரும் {count} கோப்புகள் ஏற்கனவே நூலகத்தில் இருக்கும் கோப்பு பாதைகளுடன் பொருந்துகின்றன.

# drop_import.duplicates_choice.singular
source: The following file matches a file path that already exists in the library.
ta: பின்வரும் கோப்பு ஏற்கனவே நூலகத்தில் இருக்கும் கோப்பு பாதையுடன் பொருந்துகிறது.

# drop_import.progress.label.initial
source: Importing New Files...
ta: புதிய கோப்புகளை இறக்குமதி செய்கிறது ...

# drop_import.progress.label.plural
source: Importing New Files... {count} Files Imported.{suffix}
ta: புதிய கோப்புகளை இறக்குமதி செய்கிறது ... {count} கோப்புகள் இறக்குமதி செய்யப்பட்டன. {suffix}

# drop_import.progress.label.singular
source: Importing New Files... 1 File imported.{suffix}
ta: புதிய கோப்புகளை இறக்குமதி செய்கிறது ... 1 கோப்பு இறக்குமதி செய்யப்பட்டது. {suffix}

# drop_import.progress.window_title
source: Import Files
ta: கோப்புகளை இறக்குமதி செய்க

# drop_import.title
source: Conflicting File(s)
ta: முரண்படும் கோப்பு (கள்)

# edit.color_manager
source: Manage Tag Colors
ta: குறிச்சொல் வண்ணங்களை நிர்வகிக்கவும்

# edit.tag_manager
source: Manage Tags
ta: குறிச்சொற்களை நிர்வகிக்கவும்

# entries.duplicate.merge.label
source: Merging Duplicate Entries...
ta: நகல் உள்ளீடுகளை ஒன்றிணைத்தல் ...

# entries.duplicate.merge
source: Merge Duplicate Entries
ta: நகல் உள்ளீடுகளை ஒன்றிணைக்கவும்

# entries.duplicate.refresh
source: Refresh Duplicate Entries
ta: நகல் உள்ளீடுகளைப் புதுப்பி

# entries.duplicates.description
source: Duplicate entries are defined as multiple entries which point to the same file on disk. Merging these will combine the tags and metadata from all duplicates into a single consolidated entry. These are not to be confused with "duplicate files", which are duplicates of your files themselves outside of TagStudio.
ta: மறுநுழைவுகள் என்பது, ஒரே கோப்பை குறிக்கும் பல நுழைவுகளை குறிக்கும். இவற்றை இணைப்பதால், அனைத்து மறுநுழைவுகளின் குறிச்சொற்களும் மெட்டாடேட்டாவும் ஒரே ஒட்டுமொத்த நுழைவாகச் சேர்க்கப்படும். இவற்றை 'மறுகோப்புகள்' என்பதுடன் குழப்பக் கூடாது, ஏனெனில் அவை டாக் ஸ்டுடியோவுக்கு வெளியேயுள்ள கோப்புகளின் நகல்களாகும்.

# entries.mirror.confirmation
source: Are you sure you want to mirror the following {count} Entries?
ta: பின்வரும் உள்ளீடுகளைப் பிரதிபலிக்க விரும்புகிறீர்களா {count}?

# entries.mirror.label
source: Mirroring {idx}/{total} Entries...
ta: {idx}/{total} உள்ளீடுகளைப் பிரதிபலிக்கப்படுகின்றது...

# entries.mirror.title
source: Mirroring Entries
ta: உள்ளீடுகள் பிரதிபழிக்கப்படுகின்றது

# entries.mirror.window_title
source: Mirror Entries
ta: கண்ணாடி உள்ளீடுகள்

# entries.mirror
source: &Mirror
ta: & கண்ணாடி

# entries.running.dialog.new_entries
source: Adding {total} New File Entries...
ta: {total} புதிய கோப்பு உள்ளீடுகளைச் சேர்ப்பது ...

# entries.running.dialog.title
source: Adding New File Entries
ta: புதிய கோப்பு உள்ளீடுகளைச் சேர்ப்பது

# entries.tags
source: Tags
ta: குறிச்சொற்கள்

# entries.unlinked.delete_alt
source: De&lete Unlinked Entries
ta: டி & லெட் இணைக்கப்படாத உள்ளீடுகள்

# entries.unlinked.delete.confirm
source: Are you sure you want to delete the following {count} entries?
ta: பின்வரும் உள்ளீடுகளை நிச்சயமாக நீக்க விரும்புகிறீர்களா {count}?

# entries.unlinked.delete.deleting_count
source: Deleting {idx}/{count} Unlinked Entries
ta: {idx}/{count} இணைக்கப்படாத உள்ளீடுகள் நீக்கப்படுகிறது

# entries.unlinked.delete.deleting
source: Deleting Entries
ta: உள்ளீடுகள் நீக்கப்படுகிறது

# entries.unlinked.delete
source: Delete Unlinked Entries
ta: இணைக்கப்படாத உள்ளீடுகளை நீக்கு

# entries.unlinked.description
source: Each library entry is linked to a file in one of your directories. If a file linked to an entry is moved or deleted outside of TagStudio, it is then considered unlinked.<br><br>Unlinked entries may be automatically relinked via searching your directories or deleted if desired.
ta: ஒவ்வொரு நூலக நுழைவும் உங்கள் கோப்பகங்களில் ஒன்றில் ஒரு கோப்போடு இணைக்கப்பட்டுள்ளது. ஒரு நுழைவுடன் இணைக்கப்பட்ட ஒரு கோப்பு டாக்ச்டுடியோவுக்கு வெளியே நகர்த்தப்பட்டால் அல்லது நீக்கப்பட்டால், அது பின்னர் இணைக்கப்படாததாகக் கருதப்படுகிறது.

# entries.unlinked.missing_count.none
source: Unlinked Entries: N/A
ta: இணைக்கப்படாத உள்ளீடுகள்: இதற்கில்லை.

# entries.unlinked.missing_count.some
source: Unlinked Entries: {count}
ta: இணைக்கப்படாத உள்ளீடுகள்: {count}

# entries.unlinked.refresh_all
source: &Refresh All
ta: & அனைத்தையும் புதுப்பிக்கவும்

# entries.unlinked.relink.attempting
source: Attempting to Relink {idx}/{missing_count} Entries, {fixed_count} Successfully Relinked
ta: {idx}/{missing_count} உள்ளீடுகளை மீண்டும் இணைக்க முயற்சிக்கிறது, {fixed_count} மீண்டும் இணைக்கப்பட்டது

# entries.unlinked.relink.manual
source: &Manual Relink
ta: & கையேடு மறுபரிசீலனை

# entries.unlinked.relink.title
source: Relinking Entries
ta: உள்ளீடுகள் மீண்டும் இணைக்கப்படுகின்றது

# entries.unlinked.scanning
source: Scanning Library for Unlinked Entries...
ta: இணைக்கப்படாத நுழைவுகளை புத்தககல்லரியில் சோதனை செய்யப்படுகிறது...

# entries.unlinked.search_and_relink
source: &Search && Relink
ta: & தேடல் && relink

# entries.unlinked.title
source: Fix Unlinked Entries
ta: இணைக்கப்படாத உள்ளீடுகளைச் சரிசெய்யவும்

# field.copy
source: Copy Field
ta: நகல் புலம்

# field.edit
source: Edit Field
ta: புலம் திருத்து

# field.paste
source: Paste Field
ta: புலம் ஒட்டவும்

# file.date_added
source: Date Added
ta: தேதி சேர்க்கப்பட்டது

# file.date_created
source: Date Created
ta: உருவாக்கப்பட்ட தேதி

# file.date_modified
source: Date Modified
ta: மாற்றப்பட்ட தேதி

# file.dimensions
source: Dimensions
ta: பரிமாணங்கள்

# file.duplicates.description
source: TagStudio supports importing DupeGuru results to manage duplicate files.
ta: நகல் கோப்புகளை நிர்வகிக்க டுபெகுரு முடிவுகளை இறக்குமதி செய்வதை டேக்ச்டுடியோ ஆதரிக்கிறது.

# file.duplicates.dupeguru.advice
source: After mirroring, you're free to use DupeGuru to delete the unwanted files. Afterwards, use TagStudio's "Fix Unlinked Entries" feature in the Tools menu in order to delete the unlinked Entries.
ta: படிமம் முடிந்தவுடன், தேவையற்ற கோப்புகளை நீக்க DupeGuru ஐ பயன்படுத்தலாம். அதற்குப் பிறகு, இணைக்காத நுழைவுகளை நீக்க 'டாக் ஸ்டுடியோ' வின் 'இணைக்கப்படாத உள்ளீடுகளைச் சரிசெய்' அம்சத்தைக் கருவிகள் பட்டியில் பயன்படுத்தவும்.

# file.duplicates.dupeguru.file_extension
source: DupeGuru Files (*.dupeguru)
ta: DupeGuru கோப்புகள் (*.dupeguru)

# file.duplicates.dupeguru.load_file
source: &Load DupeGuru File
ta: & டுபெகுரு கோப்பை ஏற்றவும்

# file.duplicates.dupeguru.no_file
source: No DupeGuru File Selected
ta: DupeGuru கோப்பு எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# file.duplicates.dupeguru.open_file
source: Open DupeGuru Results File
ta: DupeGuru முடிவுகள் கோப்பைத் திறக்க

# file.duplicates.fix
source: Fix Duplicate Files
ta: நகல் கோப்புகளைச் சரிசெய்

# file.duplicates.matches_uninitialized
source: Duplicate File Matches: N/A
ta: நகல் கோப்பு பொருத்தங்கள்: ஒன்றும் இல்லை

# file.duplicates.matches
source: Duplicate File Matches: {count}
ta: நகல் கோப்பு பொருந்துகிறது: {count}

# file.duplicates.mirror_entries
source: &Mirror Entries
ta: & கண்ணாடி உள்ளீடுகள்

# file.duplicates.mirror.description
source: Mirror the Entry data across each duplicate match set, combining all data while not removing or duplicating fields. This operation will not delete any files or data.
ta: ஒவ்வொரு மறுநுழைவு பொருத்தத் தொகுப்பிலும் நுழைவு தரவுகளைப் பிரதிபலிக்கவும், அனைத்து தரவுகளையும் இணைக்கவும், எந்தத் தகவல்களையும் நீக்காமலும் மறு செய்யாமலும். இந்தச் செயலில் எந்தக் கோப்புகள் அல்லது தரவுகளும் நீக்கப்பட மாட்டாது.

# file.duration
source: Length
ta: நீளம்

source: File Not Found
ta: கோப்பு கிடைக்கவில்லை:

# file.open_file_with
source: Open file with
ta: உடன் கோப்பைத் திறக்கவும்

# file.open_file
source: Open file
ta: கோப்பைத் திறக்கவும்

# file.open_location.generic
source: Show file in file explorer
ta: கோப்பு எக்ச்ப்ளோரரில் கோப்பைக் காட்டு

# file.open_location.mac
source: Reveal in Finder
ta: கண்டுபிடிப்பாளரில் வெளிப்படுத்துங்கள்

# file.open_location.windows
source: Show in File Explorer
ta: கோப்பு எக்ச்ப்ளோரரில் காண்பி

# folders_to_tags.close_all
source: Close All
ta: அனைத்தையும் மூடு

# folders_to_tags.converting
source: Converting folders to Tags
ta: கோப்புறைகளை குறிச்சொற்களாக மாற்றப்படுகிறது

# folders_to_tags.description
source: Creates tags based on your folder structure and applies them to your entries. The structure below shows all the tags that will be created and what entries they will be applied to.
ta: உங்கள் அடைவு கட்டமைப்பின் அடிப்படையில் குறிச்சொற்களை உருவாக்கி, அவற்றை உங்கள் நுழைவுகளில் பயன்படுத்துகிறது. கீழே காணப்படும் கட்டமைப்பானது உருவாக்கப்படும் அனைத்து குறிச்சொற்களையும், அவை எந்த நுழைவுகளில் பயன்படுத்தப்படும் என்பதையும் காட்டுகிறது.

# folders_to_tags.open_all
source: Open All
ta: அனைத்தையும் திற

# folders_to_tags.title
source: Create Tags From Folders
ta: கோப்புறைகளிலிருந்து குறிச்சொற்களை உருவாக்கு

# about.title
source: About TagStudio
ta: டேக்ச்டுடியோ பற்றி

# about.content
source: <p>TagStudio is a photo & file organization application with an underlying tag-based system that focuses on giving freedom and flexibility to the user. No proprietary programs or formats, no sea of sidecar files, and no complete upheaval of your filesystem structure.</p>License: GPLv3<br>Config path: {config_path}<br>FFmpeg: {ffmpeg}<br>FFprobe: {ffprobe}<p><a href="https://github.com/TagStudioDev/TagStudio">GitHub</a> | <a href="https://docs.tagstud.io">Documentation</a> | <a href="https://discord.com/invite/hRNnVKhF2G">Discord</a></p>
ta: <p> டேக்ச்டுடியோ என்பது ஒரு புகைப்படம் மற்றும் கோப்பு அமைப்பு பயன்பாடாகும், இது பயனருக்கு விடுதலை மற்றும் நெகிழ்வுத்தன்மையை வழங்குவதில் கவனம் செலுத்துகிறது. தனியுரிம திட்டங்கள் அல்லது வடிவங்கள் இல்லை, பக்கவாட்டு கோப்புகளின் கடல் இல்லை, உங்கள் கோப்பு முறைமை கட்டமைப்பின் முழுமையான எழுச்சி இல்லை. href = "https://github.com/tagstudiodev/tagstudio"> github </a> | <a href = "https://docs.tagstud.io"> ஆவணங்கள் </a> | <a href = "https://discord.com/invite/hrnnvkhf2g"> டிச்கார்ட் </a> </p>

# generic.add
source: Add
ta: சேர்

# generic.apply_alt
source: &Apply
ta: & விண்ணப்பிக்கவும்

# generic.apply
source: Apply
ta: விண்ணப்பிக்க

# generic.cancel_alt
source: &Cancel
ta: ரத்துசெய் (&c)

# generic.cancel
source: Cancel
ta: ரத்து செய்

# generic.close
source: Close
ta: மூடு

# generic.continue
source: Continue
ta: தொடரவும்

# generic.copy
source: Copy
ta: நகலெடு

# generic.cut
source: Cut
ta: வெட்டு

# generic.delete_alt
source: &Delete
ta: அழி (&d)

# generic.delete
source: Delete
ta: நீக்கு

# generic.done_alt
source: &Done
ta: & முடிந்தது

# generic.done
source: Done
ta: முடிந்தது

# generic.edit_alt
source: &Edit
ta: திருத்து (&e)

# generic.edit
source: Edit
ta: திருத்து

# generic.filename
source: Filename
ta: கோப்புப்பெயர்

# generic.navigation.back
source: Back
ta: பின்

# generic.navigation.next
source: Next
ta: அடுத்தது

# generic.none
source: None
ta: எதுவுமில்லை

# generic.overwrite_alt
source: &Overwrite
ta: & மேலெழுதும்

# generic.overwrite
source: Overwrite
ta: மேலெழுதும்

# generic.paste
source: Paste
ta: ஒட்டு

# generic.recent_libraries
source: Recent Libraries
ta: சமீபத்திய நூலகங்கள்

# generic.rename_alt
source: &Rename
ta: & மறுபெயரிடுங்கள்

# generic.rename
source: Rename
ta: மறுபெயரிடுங்கள்

# generic.reset
source: Reset
ta: மீட்டமை

# generic.save
source: Save
ta: சேமி

# generic.skip_alt
source: &Skip
ta: & தவிர்க்கவும்

# generic.skip
source: Skip
ta: தவிர்

# help.visit_github
source: Visit GitHub Repository
ta: அறிவிலிமையம் களஞ்சியத்தைப் பார்வையிடவும்

# home.search_entries
source: Search Entries
ta: தேடல் உள்ளீடுகள்

# home.search_library
source: Search Library
ta: தேடல் நூலகம்

# home.search_tags
source: Search Tags
ta: குறிச்சொற்களைத் தேடு

# home.search
source: Search
ta: தேடு

# home.thumbnail_size.extra_large
source: Extra Large Thumbnails
ta: கூடுதல் பெரிய சிறு உருவங்கள்

# home.thumbnail_size.large
source: Large Thumbnails
ta: பெரிய சிறு உருவங்கள்

# home.thumbnail_size.medium
source: Medium Thumbnails
ta: நடுத்தர சிறு உருவங்கள்

# home.thumbnail_size.mini
source: Mini Thumbnails
ta: மினி சிறு உருவங்கள்

# home.thumbnail_size.small
source: Small Thumbnails
ta: சிறிய சிறு உருவங்கள்

# home.thumbnail_size
source: Thumbnail Size
ta: சின்னப்பட அளவு

# ignore_list.add_extension
source: &Add Extension
ta: & நீட்டிப்பு சேர்க்கவும்

# ignore_list.mode.exclude
source: Exclude
ta: தவிர்

# ignore_list.mode.include
source: Include
ta: உள்ளடக்கு

# ignore_list.mode.label
source: List Mode:
ta: பட்டியல் பயன்முறை:

# ignore_list.title
source: File Extensions
ta: கோப்பு நீட்டிப்புகள்

# json_migration.checking_for_parity
source: Checking for Parity...
ta: சமத்துவத்தை சரிபார்க்கிறது ...

# json_migration.creating_database_tables
source: Creating SQL Database Tables...
ta: கவிமொ தரவுத்தள அட்டவணைகளை உருவாக்குதல் ...

# json_migration.description
source: <br>Start and preview the results of the library migration process. The converted library will <i>not</i> be used unless you click "Finish Migration". <br><br>Library data should either have matching values or feature a "Matched" label. Values that do not match will be displayed in red and feature a "<b>(!)</b>" symbol next to them.<br><center><i>This process may take up to several minutes for larger libraries.</i></center>
ta: <br> நூலக இடம்பெயர்வு செயல்முறையின் முடிவுகளைத் தொடங்கவும் முன்னோட்டமிடவும். மாற்றப்பட்ட நூலகம் <i> இல்லை </i> நீங்கள் "இடம்பெயர்வு முடிக்கவும்" என்பதைக் சொடுக்கு செய்யாவிட்டால் பயன்படுத்தப்படும். <br> <br> நூலகத் தரவுகள் பொருந்தக்கூடிய மதிப்புகளைக் கொண்டிருக்க வேண்டும் அல்லது "பொருந்திய" லேபிளைக் கொண்டிருக்க வேண்டும். பொருந்தாத மதிப்புகள் சிவப்பு நிறத்தில் காண்பிக்கப்படும் மற்றும் அவர்களுக்கு அடுத்த "<b> (!) </B>" சின்னத்தைக் கொண்டிருக்கும். <br> <center> <i> இந்த செயல்முறை பெரிய நூலகங்களுக்கு பல நிமிடங்கள் வரை ஆகலாம்.

# json_migration.discrepancies_found.description
source: Discrepancies were found between the original and converted library formats. Please review and choose to whether continue with the migration or to cancel.
ta: அசல் மற்றும் மாற்றப்பட்ட நூலக வடிவங்களுக்கு இடையில் முரண்பாடுகள் காணப்பட்டன. தயவுசெய்து மதிப்பாய்வு செய்து இடம்பெயர்வு தொடர வேண்டுமா அல்லது ரத்து செய்ய என்பதைத் தேர்வுசெய்க.

# json_migration.discrepancies_found
source: Library Discrepancies Found
ta: நூலக முரண்பாடுகள் காணப்படுகின்றன

# json_migration.finish_migration
source: Finish Migration
ta: இடம்பெயர்வு முடிக்கவும்

# json_migration.heading.aliases
source: Aliases:
ta: மாற்றுப்பெயர்கள்:

# json_migration.heading.colors
source: Colors:
ta: நிறங்கள்:

# json_migration.heading.differ
source: Discrepancy
ta: முரண்பாடு

# json_migration.heading.entires
source: Entries:
ta: உள்ளீடுகள்:

# json_migration.heading.extension_list_type
source: Extension List Type:
ta: நீட்டிப்பு பட்டியல் வகை:

# json_migration.heading.fields
source: Fields:
ta: புலங்கள்:

# json_migration.heading.file_extension_list
source: File Extension List:
ta: கோப்பு நீட்டிப்பு பட்டியல்:

# json_migration.heading.match
source: Matched
ta: பொருந்தியது

# json_migration.heading.names
source: Names:
ta: பெயர்கள்:

# json_migration.heading.parent_tags
source: Parent Tags:
ta: பெற்றோர் குறிச்சொற்கள்:

# json_migration.heading.paths
source: Paths:
ta: பாதைகள்:

# json_migration.heading.shorthands
source: Shorthands:
ta: சுருக்கெழுத்து:

# json_migration.heading.tags
source: Tags:
ta: குறிச்சொற்கள்:

# json_migration.info.description
source: Library save files created with TagStudio versions <b>9.4 and below</b> will need to be migrated to the new <b>v9.5+</b> format.<br><h2>What you need to know:</h2><ul><li>Your existing library save file will <b><i>NOT</i></b> be deleted</li><li>Your personal files will <b><i>NOT</i></b> be deleted, moved, or modified</li><li>The new v9.5+ save format can not be opened in earlier versions of TagStudio</li></ul><h3>What's changed:</h3><ul><li>"Tag Fields" have been replaced by "Tag Categories". Instead of adding tags to fields first, tags now get added directly to file entries. They're then automatically organized into categories based on parent tags marked with the new "Is Category" property in the tag editing menu. Any tag can be marked as a category, and child tags will sort themselves underneath parent tags marked as categories. The "Favorite" and "Archived" tags now inherit from a new "Meta Tags" tag which is marked as a category by default.</li><li>Tag colors have been tweaked and expanded upon. Some colors have been renamed or consolidated, however all tag colors will still convert to exact or close matches in v9.5.</li></ul><ul>
ta: டேக்ச்டுடியோ பதிப்புகளுடன் உருவாக்கப்பட்ட கோப்புகளை நூலகம் சேமிக்கவும் <b> 9.4 மற்றும் கீழே </b> புதிய <b> v9.5+</b> வடிவத்திற்கு இடம்பெயர வேண்டும். <b> <i> இல்லை </i> </b> நீக்கப்பட வேண்டும், நகர்த்தப்படும் அல்லது மாற்றியமைக்கப்பட வேண்டும் </li> <li> புதிய V9.5+ சேமிக்கும் வடிவமைப்பை டேக்ச்டுடியோவின் முந்தைய பதிப்புகளில் திறக்க முடியாது </li> </ul> <h3> என்ன மாற்றப்பட்டுள்ளது: </h3> <ul> <li> "குறிச்சொற்கள்" குறிச்சொற்களால் மாற்றப்பட்டுள்ளன. முதலில் புலங்களில் குறிச்சொற்களைச் சேர்ப்பதற்கு பதிலாக, குறிச்சொற்கள் இப்போது கோப்பு உள்ளீடுகளில் நேரடியாக சேர்க்கப்படுகின்றன. குறிச்சொல் திருத்துதல் பட்டியலில் புதிய "வகை" சொத்துடன் குறிக்கப்பட்ட பெற்றோர் குறிச்சொற்களின் அடிப்படையில் அவை தானாகவே வகைகளாக ஒழுங்கமைக்கப்படுகின்றன. எந்தவொரு குறிச்சொல்லையும் ஒரு வகையாகக் குறிக்க முடியும், மேலும் குழந்தை குறிச்சொற்கள் வகைகளாக குறிக்கப்பட்ட பெற்றோர் குறிச்சொற்களுக்கு அடியில் தங்களை வரிசைப்படுத்தும். "பிடித்த" மற்றும் "காப்பகப்படுத்தப்பட்ட" குறிச்சொற்கள் இப்போது ஒரு புதிய "மேவு குறிச்சொற்கள்" குறிச்சொல்லிலிருந்து பெறப்படுகின்றன, இது இயல்புநிலையாக ஒரு வகையாக குறிக்கப்பட்டுள்ளது. </Li> <li> குறிச்சொல் வண்ணங்கள் மாற்றப்பட்டு விரிவாக்கப்பட்டுள்ளன. சில வண்ணங்கள் மறுபெயரிடப்பட்டுள்ளன அல்லது ஒருங்கிணைக்கப்பட்டுள்ளன, இருப்பினும் எல்லா குறிச்சொல் வண்ணங்களும் V9.5 இல் உள்ள சரியான அல்லது நெருக்கமான போட்டிகளாக மாறும். </Li> </ul> <ul>

# json_migration.migrating_files_entries
source: Migrating {entries:,d} File Entries...
ta: இடம்பெயர்வு {உள்ளீடுகள் :, d} கோப்பு உள்ளீடுகள் ...

# json_migration.migration_complete_with_discrepancies
source: Migration Complete, Discrepancies Found
ta: இடம்பெயர்வு முடிந்தது, முரண்பாடுகள் காணப்படுகின்றன

# json_migration.migration_complete
source: Migration Complete!
ta: இடம்பெயர்வு முடிந்தது!

# json_migration.start_and_preview
source: Start and Preview
ta: தொடக்க மற்றும் முன்னோட்டம்

# json_migration.title.new_lib
source: <h2>v9.5+ Library</h2>
ta: <H2> V9.5+ நூலகம் </H2>

# json_migration.title.old_lib
source: <h2>v9.4 Library</h2>
ta: <H2> V9.4 நூலகம் </H2>

# json_migration.title
source: Save Format Migration: "{path}"
ta: வடிவமைப்பு இடம்பெயர்வுகளைச் சேமிக்கவும்: "{path}"

# landing.open_create_library
source: Open/Create Library {shortcut}
ta: நூலகத்தைத் திறக்கவும்/உருவாக்கவும் {shortcut}

# library_object.name_required
source: Name (Required)
ta: பெயர் (தேவை)

# library_object.name
source: Name
ta: பெயர்

# library_object.slug_required
source: ID Slug (Required)
ta: ஐடி ச்லக் (தேவை)

# library_object.slug
source: ID Slug
ta: ஐடி ச்லக்

# library.field.add
source: Add Field
ta: புலத்தைச் சேர்க்க

# library.field.confirm_remove
source: Are you sure you want to remove this "{name}" field?
ta: இந்த "{name}" புலத்தை நிச்சயமாக அகற்ற விரும்புகிறீர்களா?

# library.field.mixed_data
source: Mixed Data
ta: கலப்பு தரவு

# library.field.remove
source: Remove Field
ta: புலத்தை அகற்று

# library.missing
source: Library Location is Missing
ta: இடம் காணவில்லை

# library.name
source: Library
ta: நூலகம்

# library.refresh.scanning_preparing
source: Scanning Directories for New Files... Preparing...
ta: புதிய கோப்புகளுக்கான அடைவுகள் சோதனை செய்யப்படுகின்றது... தயாராகிறது...

# library.refresh.scanning.plural
source: Scanning Directories for New Files... {searched_count} Files Searched, {found_count} New Files Found
ta: புதிய கோப்புகளுக்கான கோப்பகங்களை ச்கேன் செய்தல் ... {searched_count} கோப்புகள் தேடப்பட்டன, {found_count} புதிய கோப்புகள் காணப்படுகின்றன

# library.refresh.scanning.singular
source: Scanning Directories for New Files... {searched_count} File Searched, {found_count} New Files Found
ta: புதிய கோப்புகளுக்கான கோப்பகங்களை ச்கேன் செய்தல் ... {searched_count} கோப்பு தேடப்பட்டது, {found_count} புதிய கோப்புகள் காணப்படுகின்றன

# library.refresh.title
source: Refreshing Directories
ta: கோப்பகங்கள் புதுப்பிக்கப்படுகின்றன

# library.scan_library.title
source: Scanning Library
ta: புத்தககல்லரி சோதனை செய்யப்படுகிறது

# macros.running.dialog.new_entries
source: Running Configured Macros on {count}/{total} New File Entries...
ta: {count} இல் கட்டமைக்கப்பட்ட செயல்முறைகளை இயக்கப்படுகிறது / {total} புதிய பதிவுகள்

# macros.running.dialog.title
source: Running Macros on New Entries
ta: புதிய நுழைவுகளில் செயல்முறைகளை இயக்கப்படுகின்றது

# media_player.autoplay
source: Autoplay
ta: ஆட்டோபிளே

# menu.delete_selected_files_ambiguous
source: Move File(s) to {trash_term}
ta: கோப்புகளை நகர்த்தவும்) {trash_term}

# menu.delete_selected_files_plural
source: Move Files to {trash_term}
ta: கோப்புகளை {crash_term பெறுநர் க்கு நகர்த்தவும்

# menu.delete_selected_files_singular
source: Move File to {trash_term}
ta: கோப்பை {crash_term பெறுநர் க்கு நகர்த்தவும்

# menu.edit.ignore_list
source: Ignore Files and Folders
ta: கோப்புகள் மற்றும் கோப்புறைகளை புறக்கணிக்கவும்

# menu.edit.manage_file_extensions
source: Manage File Extensions
ta: கோப்பு நீட்டிப்புகளை நிர்வகிக்கவும்

# menu.edit.manage_tags
source: Manage Tags
ta: குறிச்சொற்களை நிர்வகிக்கவும்

# menu.edit.new_tag
source: New &Tag
ta: புதிய & குறிச்சொல்

# menu.edit
source: Edit
ta: திருத்து

# menu.file.clear_recent_libraries
source: Clear Recent
ta: சமீபத்தியதை அழிக்கவும்

# menu.file.close_library
source: &Close Library
ta: & நூலகம் மூடு

# menu.file.new_library
source: New Library
ta: புதிய நூலகம்

# menu.file.open_create_library
source: &Open/Create Library
ta: & நூலகத்தைத் திறக்க/உருவாக்கவும்

# menu.file.open_library
source: Open Library
ta: திறந்த நூலகம்

# menu.file.open_recent_library
source: Open Recent
ta: அண்மைக் கால திறப்பு

# menu.file.refresh_directories
source: &Refresh Directories
ta: கோப்பகத்தை புதுப்பிக்கவும்

# menu.file.save_backup
source: &Save Library Backup
ta: & நூலக காப்புப்பிரதியை சேமிக்கவும்

# menu.file.save_library
source: Save Library
ta: நூலகத்தை சேமிக்கவும்
