Repository: 247i/TACETr
Catalog: உரை/தானி/tagstudio-strings-*.po
Languages: ta

# menu.file
source: &File
ta: கோப்பு (&f)

# menu.help.about
source: About
ta: பற்றி

# menu.help
source: &Help
ta: உதவி (&h)

# menu.macros.folders_to_tags
source: Folders to Tags
ta: குறிச்சொற்களுக்கு கோப்புறைகள்

# menu.macros
source: &Macros
ta: & மேக்ரோக்கள்

# menu.select
source: Select
ta: தேர்ந்தெடு

# menu.settings
source: Settings...
ta: அமைப்புகள் ...

# menu.tools.fix_duplicate_files
source: Fix Duplicate &Files
ta: நகல் & கோப்புகளை சரிசெய்யவும்

# menu.tools.fix_unlinked_entries
source: Fix &Unlinked Entries
ta: சரிசெய்யப்படாத உள்ளீடுகளை சரிசெய்யவும்

# menu.tools
source: &Tools
ta: கருவிகள் (&t)

# menu.view
source: &View
ta: காண்க (&v)

# menu.window
source: Window
ta: சாளரம்

# namespace.create.description_color
source: Tag colors use namespaces as color palette groups. All custom colors must be under a namespace group first.
ta: குறிச்சொல் வண்ணங்கள் பெயர்வெளிகளை வண்ணத் தட்டு குழுக்களாகப் பயன்படுத்துகின்றன. அனைத்து தனிப்பயன் வண்ணங்களும் முதலில் ஒரு பெயர்வெளி குழுவின் கீழ் இருக்க வேண்டும்.

# namespace.create.description
source: Namespaces are used by TagStudio to separate groups of items such as tags and colors in a way that makes them easy to export and share. Namespaces starting with "tagstudio" are reserved by TagStudio for internal use.
ta: குறிச்சொற்கள் மற்றும் வண்ணங்கள் போன்ற பொருட்களின் குழுக்களை ஏற்றுமதி செய்வதற்கும் பகிர்வதற்கும் எளிதாக்கும் வகையில் பிரிக்கப்படுவதற்கு பெயர்வெளிகள் டேக்ச்டுடியோவால் பயன்படுத்தப்படுகின்றன. "டேக்ச்டுடியோ" உடன் தொடங்கும் பெயர்வெளிகள் உள் பயன்பாட்டிற்காக டேக்ச்டுடியோவால் ஒதுக்கப்பட்டுள்ளன.

# namespace.create.title
source: Create Namespace
ta: பெயர்வெளியை உருவாக்கவும்

# namespace.new.button
source: New Namespace
ta: புதிய பெயர்வெளி

# namespace.new.prompt
source: Create a New Namespace to Start Adding Custom Colors!
ta: தனிப்பயன் வண்ணங்களைச் சேர்க்கத் தொடங்க புதிய பெயர்வெளியை உருவாக்கவும்!

# preview.multiple_selection
source: <b>{count}</b> Items Selected
ta: <b> {count} </b> தேர்ந்தெடுக்கப்பட்ட உருப்படிகள்

# preview.no_selection
source: No Items Selected
ta: உருப்படிகள் எதுவும் தேர்ந்தெடுக்கப்படவில்லை

# select.add_tag_to_selected
source: Add Tag to Selected
ta: தேர்ந்தெடுக்கப்பட்டவருக்கு குறிச்சொல்லைச் சேர்க்கவும்

source: Select All
ta: அனைத்தையும் தெரிவுசெய்

# select.clear
source: Clear Selection
ta: தெளிவான தேர்வு

# edit.copy_fields
source: Copy Fields
ta: புலங்களை நகலெடுக்கவும்

# edit.paste_fields
source: Paste Fields
ta: புலங்களை ஒட்டவும்

# settings.clear_thumb_cache.title
source: Clear Thumbnail Cache
ta: சிறுபடம் அழி

# settings.language
source: Language
ta: மொழி

# settings.open_library_on_start
source: Open Library on Start
ta: தொடக்கத்தில் நூலகத்தைத் திறக்கவும்

# settings.restart_required
source: Please restart TagStudio for changes to take effect.
ta: மாற்றங்கள் நடைமுறைக்கு வருவதற்கு டேக்ச்டுடியோவை மறுதொடக்கம் செய்யுங்கள்.

# settings.show_filenames_in_grid
source: Show Filenames in Grid
ta: கட்டத்தில் கோப்பு பெயர்களைக் காட்டு

# settings.show_recent_libraries
source: Show Recent Libraries
ta: அண்மைக் கால நூலகங்களைக் காட்டு

# settings.title
source: Settings
ta: அமைப்புகள்

# sorting.direction.ascending
source: Ascending
ta: ஏறுதல்

# sorting.direction.descending
source: Descending
ta: இறங்கு

# splash.opening_library
source: Opening Library "{library_path}"...
ta: "{library_path}" ஐ திறக்கும் ...

# status.deleted_file_plural
source: Deleted {count} files!
ta: நீக்கப்பட்டது {count} கோப்புகள்!

# status.deleted_file_singular
source: Deleted 1 file!
ta: 1 கோப்பு நீக்கப்பட்டது!

# status.deleted_none
source: No files deleted.
ta: கோப்புகள் நீக்கப்படவில்லை.

# status.deleted_partial_warning
source: Only deleted {count} file(s)! Check if any of the files are currently missing or in use.
ta: {count} கோப்பு (கள்) மட்டுமே நீக்கப்பட்டது! ஏதேனும் கோப்புகள் தற்போது காணவில்லை அல்லது பயன்பாட்டில் உள்ளதா என சரிபார்க்கவும்.

# status.deleting_file
source: Deleting file [{i}/{count}]: "{path}"...
ta: கோப்பை நீக்குதல் [{i}/{count}]: "{path}" ...

# status.library_backup_in_progress
source: Saving Library Backup...
ta: நூலக காப்புப்பிரதியை சேமிக்கிறது ...

# status.library_backup_success
source: Library Backup Saved at: "{path}" ({time_span})
ta: நூலக காப்புப் பிரதி சேமிக்கப்பட்டது: "{path}" ({time_span})

# status.library_closed
source: Library Closed ({time_span})
ta: நூலகம் மூடப்பட்டது ({time_span})

# status.library_closing
source: Closing Library...
ta: நிறைவு நூலகம் ...

# status.library_save_success
source: Library Saved and Closed!
ta: நூலகம் சேமிக்கப்பட்டு மூடப்பட்டது!

# status.library_search_query
source: Searching Library...
ta: தேடும் நூலகம் ...

# status.library_version_expected
source: Expected:
ta: எதிர்பார்க்கப்படுகிறது:

# status.library_version_found
source: Found:
ta: கிடைத்தது:

# status.library_version_mismatch
source: Library Version Mismatch!
ta: நூலக பதிப்பு பொருந்தாதது!

# status.results_found
source: {count} Results Found ({time_span})
ta: {count} முடிவுகள் காணப்படுகின்றன ({time_span})

# status.results.invalid_syntax
source: Invalid Search Syntax:
ta: தவறான தேடல் தொடரியல்:

# status.results
source: Results
ta: முடிவுகள்

# tag_manager.title
source: Library Tags
ta: நூலக குறிச்சொற்கள்

# tag.add_to_search
source: Add to Search
ta: தேடலில் சேர்

# tag.add.plural
source: Add Tags
ta: குறிச்சொற்களைச் சேர்க்கவும்

# tag.add
source: Add Tag
ta: குறிச்சொல் சேர்க்க

# tag.aliases
source: Aliases
ta: மாற்றுப்பெயர்கள்

# tag.all_tags
source: All Tags
ta: அனைத்து குறிச்சொற்களும்

# tag.choose_color
source: Choose Tag Color
ta: குறிச்சொல் வண்ணத்தைத் தேர்வுசெய்க

# tag.color
source: Color
ta: நிறம்

# tag.confirm_delete
source: Are you sure you want to delete the tag "{tag_name}"?
ta: "{tag_name}" என்ற குறிச்சொல்லை நீக்க விரும்புகிறீர்களா?

# tag.create_add
source: Create && Add "{query}"
ta: && சேர் "{query}"

# tag.create
source: Create Tag
ta: குறிச்சொல்லை உருவாக்கவும்

# tag.disambiguation.tooltip
source: Use this tag for disambiguation
ta: இந்த குறிச்சொல்லைப் பயன்படுத்தவும்

# tag.edit
source: Edit Tag
ta: குறிச்சொல்லைத் திருத்து

# tag.is_category
source: Is Category
ta: வகை

# tag.name
source: Name
ta: பெயர்

# tag.new
source: New Tag
ta: புதிய குறிச்சொல்

# tag.parent_tags.add
source: Add Parent Tag(s)
ta: பெற்றோர் குறிச்சொற்களைச் சேர்க்க

# tag.parent_tags.description
source: This tag can be treated as a substitute for any of these Parent Tags in searches.
ta: இந்த குறிச்சொல்லை தேடல்களில் உள்ள இந்த பெற்றோர் குறிச்சொற்களுக்கு மாற்றாக கருதலாம்.

# tag.parent_tags
source: Parent Tags
ta: பெற்றோர் குறிச்சொற்கள்

# tag.remove
source: Remove Tag
ta: குறிச்சொல்லை அகற்று

# tag.search_for_tag
source: Search for Tag
ta: குறிச்சொல்லைத் தேடு

# tag.shorthand
source: Shorthand
ta: சுருக்கெழுத்து

# tag.tag_name_required
source: Tag Name (Required)
ta: குறிச்சொல் பெயர் (தேவை)

# tag.view_limit
source: View Limit:
ta: வரம்பைக் காண்க:

# trash.context.ambiguous
source: Move file(s) to {trash_term}
ta: கோப்புகளை நகர்த்தவும்) {trash_term}

# trash.context.plural
source: Move files to {trash_term}
ta: கோப்புகளை {crash_term பெறுநர் க்கு நகர்த்தவும்

# trash.context.singular
source: Move file to {trash_term}
ta: கோப்பை {crash_term பெறுநர் க்கு நகர்த்தவும்

# trash.dialog.disambiguation_warning.plural
source: This will remove them from TagStudio <i>AND</i> your file system!
ta: இது அவற்றை டேக்ச்டுடியோ <i> மற்றும் </i> உங்கள் கோப்பு முறைமையிலிருந்து அகற்றும்!

# trash.dialog.disambiguation_warning.singular
source: This will remove it from TagStudio <i>AND</i> your file system!
ta: இது டேக்ச்டுடியோ <i> மற்றும் </i> உங்கள் கோப்பு முறைமையிலிருந்து அகற்றப்படும்!

# trash.dialog.move.confirmation.plural
source: Are you sure you want to move these {count} files to the {trash_term}?
ta: இந்த {count} கோப்புகளை {crash_term க்கு க்கு நகர்த்த விரும்புகிறீர்களா?

# trash.dialog.move.confirmation.singular
source: Are you sure you want to move this file to the {trash_term}?
ta: இந்த கோப்பை {crash_term with க்கு நகர்த்த விரும்புகிறீர்களா?

# trash.dialog.permanent_delete_warning
source: <b>WARNING!</b> If this file can't be moved to the {trash_term}, <b>it will be <b>permanently deleted!</b>
ta: <b> எச்சரிக்கை! </b> இந்த கோப்பை {crash_term க்கு க்கு மாற்ற முடியாவிட்டால், <b> இது <b> நிரந்தரமாக நீக்கப்படும்! </b>

# trash.dialog.title.plural
source: Delete Files
ta: கோப்புகளை நீக்கு

# trash.dialog.title.singular
source: Delete File
ta: கோப்பை அழி

# trash.name.generic
source: Trash
ta: குப்பை

# trash.name.windows
source: Recycle Bin
ta: மறுசுழற்சி பின்

# view.size.0
source: Mini
ta: மினி

# view.size.1
source: Small
ta: சிறிய

# view.size.2
source: Medium
ta: சராசரி

# view.size.3
source: Large
ta: பெரிய

# view.size.4
source: Extra Large
ta: கூடுதல் பெரிய

# window.message.error_opening_library
source: Error opening library.
ta: பிழை திறப்பது நூலகம்.

# window.title.error
source: Error
ta: பிழை

# window.title.open_create_library
source: Open/Create Library
ta: நூலகத்தைத் திறக்கவும்/உருவாக்கவும்
