Repository: 247i/TACETr
Catalog: உரை/தானி/tasks-android-*.po
Languages: ta

source: OK
ta: சரி

source: Cancel
ta: ரத்துசெய்

# actfm_picture_clear
source: Clear Picture
ta: தெளிவான படம்

# TVA_add_comment
source: Add a comment…
ta: ஒரு கருத்தைச் சேர்க்கவும்…

source: Display name
ta: பெயர்

# backup_BPr_header
source: Backups
ta: காப்புப்பிரதிகள்

# backup_BAc_export
source: Backup now
ta: இப்போதே நகல் எடு

# backup_BAc_import
source: Import backup
ta: நகலை இறக்குமதி செய்

# export_toast
source: Backed up %1$s to %2$s.
ta: %1$s முதல் %2$s வரை நகல் எடுக்கப்பட்டது.

# import_summary_title
source: Restore summary
ta: சுருக்கத்தை மீட்டமை

# import_summary_message
source: File %1$s contained %2$s. %3$s imported, %4$s already exist %5$s had errors
ta: கோப்பு %1$s %2$s ஐக் கொண்டுள்ளது. %3$s இறக்குமதி செய்யப்பட்டன, %4 $ கள் ஏற்கனவே உள்ளன %5 $ s பிழைகள் இருந்தன

# import_progress_read
source: Reading task %d…
ta: %d… வேலையை படிக்கிறது

# read_permission_label
source: Tasks Permission
ta: வேலைகள் அனுமதி

# discard_confirmation
source: Are you sure you want to discard your changes?
ta: உங்கள் மாற்றங்களை நிராகரிக்க விரும்புகிறீர்களா?

source: Keep editing
ta: திருத்துவதைத் தொடருங்கள்

# DLG_delete_this_task_question
source: Delete this task?
ta: இந்த வேலையை நீக்கலாமா?

# DLG_hour_minutes
source: Time (hours : minutes)
ta: நேரம் (மணி : நிமிடங்கள்)

# DLG_undo
source: Undo
ta: பின்வாங்கு

# WID_dateButtonUnset
source: Click to set
ta: கிளிக் செய்து அமைக்கவும்

# TLA_no_items
source: There are no tasks here.
ta: இங்கு எந்த வேலைகளும் இல்லை.

# TLA_menu_sort
source: Sort
ta: வரிசைப்படுத்து

# TLA_menu_search
source: Search
ta: தேடு

# TLA_menu_settings
source: Settings
ta: அமைப்புகள்

source: App settings
ta: பயன்பாட்டு அமைப்புகள்

# TAd_actionEditTask
source: Edit
ta: தொகு

source: Customize drawer
ta: டிராயரைத் தனிப்பயனாக்குங்கள்

# customize_drawer_summary
source: Drag and drop to rearrange menu items
ta: பட்டியல் உருப்படிகளை மறுசீரமைக்க இழுத்து விடுங்கள்

# action_call
source: Call
ta: அழைப்பு

# action_open
source: Open
ta: திற

# SSD_sort_my_order
source: My order
ta: எனது ஆர்டர்

# astrid_sort_order
source: Astrid manual sorting
ta: ஆஸ்ட்ரிட் கையேடு வரிசையாக்கம்

# astrid_sort_order_summary
source: Enable Astrid's manual sort mode for 'My Tasks', 'Today', and tags. This sort mode will be replaced by 'My order' in a future update
ta: 'எனது பணிகள்', 'இன்று' மற்றும் குறிச்சொற்களுக்கு ஆச்ட்ரிட்டின் கையேடு வரிசை பயன்முறையை இயக்கவும். இந்த வகையான பயன்முறை எதிர்கால புதுப்பிப்பில் 'எனது ஆர்டர்' மூலம் மாற்றப்படும்

# SSD_sort_auto
source: Smart sort
ta: ஸ்மார்ட் வகை

# SSD_sort_alpha
source: By title
ta: தலைப்பு மூலம்

# SSD_sort_start
source: By start date
ta: தொடங்கும் நாள் கொண்டு

# SSD_sort_due
source: By due date
ta: உரிய தேதிக்குள்

# SSD_sort_importance
source: By priority
ta: முன்னுரிமையால்

# SSD_sort_modified
source: By last modified
ta: கடைசியாக மாற்றியமைக்கப்பட்டது

# sort_created
source: By creation time
ta: படைப்பு நேரம் மூலம்

# sort_list
source: By list
ta: பட்டியல் மூலம்

# sort_completed
source: By completion time
ta: நிறைவு நேரம்

# FLA_search_filter
source: Matching '%s'
ta: பொருந்தும் '%s'

# FLA_new_filter
source: Create new filter
ta: புதிய வடிப்பானை உருவாக்கவும்

# TEA_title_hint
source: Task name
ta: வேலை பெயர்

# TEA_importance_label
source: Priority
ta: முன்னுரிமை

# TEA_add_subtask
source: Add subtask
ta: துணை பணி சேர்க்கவும்

# TEA_note_label
source: Description
ta: விவரிப்பு

# TEA_estimatedDuration_label
source: How long will it take?
ta: இது எவ்வளவு நேரம் எடுக்கும்?

# TEA_elapsedDuration_label
source: Time already spent
ta: ஏற்கனவே செலவழித்த நேரம்

source: Save
ta: சேமி

# TEA_timer_est
source: Est. %s
ta: எஸ்டி. %s

# TEA_timer_elap
source: Elapsed %s
ta: கழிந்தது %s

source: Due date
ta: உரிய தேதி

source: Due time
ta: உரிய தேதி

source: Start date
ta: தொடங்கும் நாள்

source: Day before due
ta: செலுத்த வேண்டிய நாள் முன்

source: Week before due
ta: செலுத்த வேண்டிய வாரம் முன்

# TEA_control_repeat
source: Repeat
ta: மீண்டும் செய்யவும்

# TEA_control_gcal
source: Calendar
ta: நாள்காட்டி

# TEA_control_importance
source: Priority
ta: முன்னுரிமை

# TEA_control_location
source: Location
ta: இடம்

# TEA_control_notes
source: Description
ta: விளக்கம்

# TEA_control_files
source: Files
ta: கோப்புகள்

# TEA_control_reminders
source: Reminders
ta: நினைவூட்டல்கள்

# TEA_control_timer
source: Timer Controls
ta: டைமர் கட்டுப்பாடுகள்

# TEA_control_hidden_section
source: ----Hide Always----
ta: ---- எப்போதும் மறை ----

# TEA_creation_date
source: Creation date
ta: உருவாக்கும் தேதி

source: None
ta: எதுவுமில்லை

# EPr_edit_screen_options
source: Edit screen options
ta: திரை விருப்பங்களைத் திருத்து

# EPr_beastMode_reset
source: Reset to defaults
ta: இயல்புநிலைக்கு மீட்டமை

# EPr_fullTask_title
source: Show full task title
ta: முழு பணி தலைப்பைக் காட்டு

# EPr_show_task_edit_comments
source: Show comments in task edit
ta: பணி திருத்தத்தில் கருத்துகளைக் காட்டு

source: Task list options
ta: பணி பட்டியல் விருப்பங்கள்

# EPr_cal_end_or_start_at_due_time
source: Calendar event time
ta: நாள்காட்டி நிகழ்வு நேரம்

# EPr_cal_end_at_due_time
source: End calendar events at due time
ta: நாள்காட்டி நிகழ்வுகளை உரிய நேரத்தில் முடிக்கவும்

# EPr_cal_start_at_due_time
source: Start calendar events at due time
ta: சரியான நேரத்தில் நாள்காட்டி நிகழ்வுகளைத் தொடங்கவும்

# always_display_full_date
source: Show full date
ta: முழு தேதியை காண்பி

# EPr_reset_preferences
source: Reset preferences
ta: விருப்பங்களை மீட்டமைக்கவும்

# EPr_reset_preferences_warning
source: Preferences will be reset to default values
ta: முன்னுரிமைகள் இயல்புநிலை மதிப்புகளுக்கு மீட்டமைக்கப்படும்

# EPr_delete_task_data
source: Delete task data
ta: பணி தரவை நீக்கு

# EPr_delete_task_data_warning
source: All tasks will be permanently deleted
ta: அனைத்து பணிகளும் நிரந்தரமாக நீக்கப்படும்

# EPr_manage_delete_completed_gcal
source: Delete calendar events for completed tasks
ta: பூர்த்தி செய்யப்பட்ட பணிகளுக்கு நாள்காட்டி நிகழ்வுகளை நீக்கு

# EPr_manage_delete_completed_gcal_message
source: Do you really want to delete all your events for completed tasks?
ta: பூர்த்தி செய்யப்பட்ட பணிகளுக்காக உங்கள் எல்லா நிகழ்வுகளையும் நீக்க விரும்புகிறீர்களா?

# EPr_manage_delete_gcal_status
source: Deleted %d calendar events!
ta: %d நாள்காட்டி நிகழ்வுகள் நீக்கப்பட்டன!

# EPr_manage_delete_all_gcal
source: Delete all calendar events for tasks
ta: பணிகளுக்கான அனைத்து நாள்காட்டி நிகழ்வுகளையும் நீக்கு

# EPr_manage_delete_all_gcal_message
source: Do you really want to delete all your events for tasks?
ta: பணிகளுக்காக உங்கள் எல்லா நிகழ்வுகளையும் நீக்க விரும்புகிறீர்களா?

source: Task defaults
ta: பணி இயல்புநிலை

# EPr_default_importance_title
source: Default priority
ta: இயல்புநிலை முன்னுரிமை

source: Default start date
ta: இயல்புநிலை தொடக்க தேதி

source: Default due date
ta: இயல்புநிலை காரணமாக தேதி

# EPr_default_reminders_title
source: Default reminders
ta: இயல்புநிலை நினைவூட்டல்கள்

# EPr_default_location_reminder_title
source: Default location reminders
ta: இயல்புநிலை இருப்பிட நினைவூட்டல்கள்

# EPr_default_reminders_mode_title
source: Default ring/vibrate type
ta: இயல்புநிலை வளையம் / அதிர்வு வகை

source: Default location
ta: இயல்புநிலை இடம்

# priority_high
source: High
ta: உயரமான

# priority_medium
source: Medium
ta: நடுத்தரமான

# priority_low
source: Low
ta: குறைந்த

source: Day after tomorrow
ta: நாளை மறுநாள்

source: Next week
ta: அடுத்த வாரம்

source: No reminders
ta: நினைவூட்டல்கள் இல்லை

# default_location_reminder_on_arrival
source: On arrival
ta: வந்தவுடன்

# default_location_reminder_on_departure
source: On departure
ta: புறப்படும் போது

# default_location_reminder_on_arrival_or_departure
source: On arrival and departure
ta: வருகை மற்றும் புறப்படும் போது

# BFE_Active
source: My Tasks
ta: என் வேலைகள்

# BFE_Recent
source: Recently modified
ta: சமீபத்தில் மாற்றியவை

# CFA_button_add
source: Add Criteria
ta: அளவுகோல்களைச் சேர்க்கவும்

# CFC_dueBefore_text
source: Due By: ?
ta: காரணமாக :?

# CFC_dueBefore_name
source: Due By…
ta: காரணமாக…

# CFC_startBefore_text
source: Start by: ?
ta: தொடங்கியவர்:?

# CFC_startBefore_name
source: Start by…
ta: மூலம் தொடங்கவும்…

source: No due date
ta: முடிக்கப்பட வேண்டிய தேதி இல்லை

source: No start date
ta: தொடங்கும் தேதி இல்லை

# filter_any_start_date
source: Any start date
ta: ஏதேனும் தொடங்கும் தேதி

source: Next Month
ta: அடுத்த மாதம்

# CFC_importance_text
source: Priority at least ?
ta: குறைந்தபட்சம் முன்னுரிமை?

# CFC_importance_name
source: Priority…
ta: முன்னுரிமை…

# CFC_tag_text
source: Tag: ?
ta: குறிச்சொல் :?

# CFC_tag_name
source: Tag…
ta: குறிச்சொல்…

# CFC_tag_contains_name
source: Tag name contains…
ta: குறிச்சொல் பெயர் உள்ளது…

# CFC_tag_contains_text
source: Tag name contains: ?
ta: குறிச்சொல் பெயர் பின்வருமாறு:?

# CFC_title_contains_name
source: Title contains…
ta: தலைப்பில்…

# CFC_title_contains_text
source: Title contains: ?
ta: தலைப்பில்:?

# gcal_TEA_error
source: Error adding task to calendar!
ta: வேலையை நாட்காட்டியில் சேர்க்க முடியவில்லை!

# gcal_TEA_showCalendar_label
source: Open Calendar Event
ta: நாள்காட்டி நிகழ்வைத் திறக்கவும்

source: Calendar event not found
ta: நாள்காட்டி நிகழ்வு கிடைக்கவில்லை

# gcal_completed_title
source: %s (completed)
ta: %s (முடிந்தது)

# CFC_gtasks_list_text
source: In List: ?
ta: பட்டியலில் :?

# CFC_list_name
source: In list…
ta: பட்டியலில்…

# gtasks_GTA_clear_completed
source: Clear Completed
ta: தெளிவான நிறைவு

# gtasks_GLA_authenticating
source: Authenticating…
ta: அங்கீகரிக்கிறது…

# gtasks_GLA_errorIOAuth
source: Sorry, we had trouble communicating with Google servers. Please try again later.
ta: மன்னிக்கவும், Google சேவையகங்களுடன் தொடர்புகொள்வதில் சிக்கல் ஏற்பட்டது. பின்னர் மீண்டும் முயற்சிக்கவும்.

# gtasks_GPr_header
source: Google Tasks
ta: Google பணிகள்

# gtasks_error_accountNotFound
source: Account %s not found—please log out and log back in from the Google Tasks settings.
ta: கணக்கு %s காணப்படவில்லை - தயவுசெய்து வெளியேறி, Google பணிகள் அமைப்புகளிலிருந்து மீண்டும் உள்நுழைக.

# premium_record_audio
source: Record a note
ta: ஒரு குறிப்பைப் பதிவுசெய்க

source: Ring once
ta: ஒரு முறை ஒலி

source: Ring five times
ta: ஐந்து முறை ஒலி

source: Ring nonstop
ta: நிறுத்தாமல் ஒலி

# rmd_NoA_done
source: Complete
ta: முழுமை

# rmd_NoA_snooze
source: Snooze
ta: உறக்கநிலை

source: Snooze all
ta: அனைத்தையும் உறக்கநிலையில் வைக்கவும்

# rmd_EPr_quiet_hours_start_title
source: Quiet hours start
ta: அமைதியான நேரம் தொடங்கும்

# rmd_EPr_quiet_hours_end_title
source: Quiet hours end
ta: அமைதியான நேரம் முடிகிறது

# rmd_EPr_rmd_time_desc
source: Notifications for tasks without due times will appear at %s
ta: சரியான நேரமின்றி பணிகளுக்கான அறிவிப்புகள் %s இல் தோன்றும்

source: Persistent notifications
ta: தொடர்ச்சியான அறிவிப்புகள்

# persistent_notifications_description
source: Persistent notifications cannot be cleared
ta: தொடர்ச்சியான அறிவிப்புகளை அழிக்க முடியாது

# swipe_to_snooze_title
source: Swipe to snooze
ta: உறக்கநிலைக்கு ச்வைப் செய்யவும்

# swipe_to_snooze_description
source: Snooze time
ta: உறக்கநிலை நேரம்

# swipe_to_snooze_time_description
source: A cleared notification will be snoozed and recreated %s
ta: அழிக்கப்பட்ட அறிவிப்பு உறக்கநிலை மற்றும் %s மீண்டும் உருவாக்கப்படும்

# swipe_to_snooze_time_immediately
source: immediately
ta: உடனடியாக

# swipe_to_snooze_time_15_minutes
source: after 15 minutes
ta: 15 நிமிடங்களுக்குப் பிறகு

# swipe_to_snooze_time_30_minutes
source: after 30 minutes
ta: 30 நிமிடங்களுக்குப் பிறகு

# swipe_to_snooze_time_1_hour
source: after 1 hour
ta: 1 மணி நேரம் கழித்து

# swipe_to_snooze_time_24_hours
source: after 24 hours
ta: 24 மணி நேரம் கழித்து

# rmd_EPr_defaultRemind_title
source: Random reminders
ta: சீரற்ற நினைவூட்டல்கள்

# default_random_reminder_disabled
source: Disabled
ta: முடக்கப்பட்டது

# default_random_reminder_hourly
source: Hourly
ta: மணி

# default_random_reminder_daily
source: Daily
ta: தினசரி

# default_random_reminder_weekly
source: Weekly
ta: வாராந்திர

# default_random_reminder_bi_weekly
source: Bi-weekly
ta: இரு வாராந்திர

# repeat_option_does_not_repeat
source: Does not repeat
ta: மீண்டும் செய்யாது

# repeat_option_every_day
source: Every day
ta: தினமும்

# repeat_option_every_week
source: Every week
ta: ஒவ்வொரு வாரமும்

# repeat_option_every_month
source: Every month
ta: ஒவ்வொரு மாதமும்

# repeat_option_every_year
source: Every year
ta: ஒவ்வொரு வருடமும்

# repeat_option_custom
source: Custom…
ta: தனிப்பயன்…

# repeat_occurrence
source: occurrence
ta: நிகழ்வு

# task_count
source: %d task
ta: %d பணி

# subtask_count
source: %d subtask
ta: %d துணை பணி

# list_count
source: %d list
ta: %d பட்டியல்

# repeat_times
source: time
ta: நேரம்

# repeat_minutes
source: minute
ta: நிமிடம்

# reminder_minutes
source: Minute
ta: நிமிடங்கள்

# repeat_n_minutes
source: %d minute
ta: %d நிமிடம்

# repeat_hours
source: hour
ta: மணி

# reminder_hours
source: Hour
ta: மணி

# repeat_n_hours
source: %d hour
ta: %d மணி

# repeat_days
source: day
ta: நாள்

# reminder_days
source: Day
ta: நாள்

# repeat_n_days
source: %d day
ta: %d நாள்

# repeat_weeks
source: week
ta: வாரம்

# reminder_week
source: Week
ta: வாரம்

# repeat_n_weeks
source: %d week
ta: %d வாரம்

# repeat_months
source: month
ta: மாதம்

# repeat_years
source: year
ta: ஆண்டு

# repeat_n_years
source: %d year
ta: %d ஆண்டு

# repeat_type_due
source: due date
ta: உரிய தேதி

# repeat_type_completion
source: completion date
ta: நிறைவு தேதி

# repeat_type_completion_capitalized
source: Completion date
ta: முடியும் தேதி

# repeat_snackbar
source: %1$s rescheduled for %2$s
ta: %1$s %2$s க்கு மாற்றியமைக்கப்பட்டது

# new_tag
source: Create new tag
ta: புதிய குறிச்சொல்லை உருவாக்கவும்

# new_list
source: Create new list
ta: புதிய பட்டியலை உருவாக்கவும்

# delete_tag_confirmation
source: Delete %s?
ta: %s ஐ நீக்கவா?

# delete_comment
source: comment
ta: கருத்து

source: Comment
ta: கருத்து

# TPl_notification
source: Timers Active for %s!
ta: டைமர்கள் %s க்கு செயலில் உள்ளன!

# TEA_timer_controls
source: Timer
ta: டைமர்

# TEA_timer_comment_started
source: started this task:
ta: இந்த பணியைத் தொடங்கினார்:

# TEA_timer_comment_stopped
source: stopped doing this task:
ta: இந்த பணியை செய்வதை நிறுத்தியது:

# TEA_timer_comment_spent
source: Time spent:
ta: செலவிட்ட நேரம்:

# voice_create_prompt
source: Speak to create a task
ta: ஒரு பணியை உருவாக்க பேசுங்கள்

# EPr_voiceInputEnabled_title
source: Voice input
ta: குரல் உள்ளீடு

# EPr_voiceRemindersEnabled_title
source: Voice reminders
ta: குரல் நினைவூட்டல்கள்

# EPr_voiceRemindersEnabled_desc_enabled
source: Tasks will speak task names during task reminders
ta: பணி நினைவூட்டல்களின் போது பணிகள் பணி பெயர்களைப் பேசும்

source: Delete task
ta: பணியை நீக்கு

# voice_command_added_task
source: Added task
ta: பணி சேர்க்கப்பட்டது

# Ntasks
source: 1 task
ta: 1 பணி

source: Now
ta: இப்போது

source: Today
ta: இன்று

source: Tomorrow
ta: நாளை

# next_sunday
source: Next Sun
ta: அடுத்த ஞாயிறு

# next_monday
source: Next Mon
ta: அடுத்த திங்கள்

# next_tuesday
source: Next Tue
ta: அடுத்த செவ்வாய்

# next_wednesday
source: Next Wed
ta: அடுத்த புதன்

# next_thursday
source: Next Thu
ta: அடுத்த வியாழன்

# next_friday
source: Next Fri
ta: அடுத்த வெள்ளி

# next_saturday
source: Next Sat
ta: அடுத்த சனி

source: Yesterday
ta: நேற்று

# widget_show_checkboxes
source: Show checkboxes
ta: தேர்வுப்பெட்டிகளைக் காட்டு

# widget_show_header
source: Show header
ta: தலைப்பைக் காட்டு

# widget_show_settings
source: Show settings
ta: அமைப்புகளைக் காட்டு

# widget_show_title
source: Show title
ta: தலைப்பு காட்டு

# widget_show_menu
source: Show menu
ta: மெனுவைக் காட்டு

# widget_show_dividers
source: Show dividers
ta: வகுப்புகளைக் காட்டு

source: Notifications
ta: அறிவிப்புகள்

source: Silent
ta: அமைதியாக

source: Sound
ta: ஒலி

source: Vibrations
ta: அதிர்வுகள்

source: Quiet hours
ta: அமைதியான நேரம்

# quiet_hours_in_effect
source: Quiet hours are in effect
ta: அமைதியான நேரம் நடைமுறையில் உள்ளது

# attachment_directory
source: Attachment folder
ta: இணைப்பு கோப்புறை

# backup_directory
source: Backup folder
ta: காப்பு கோப்புறை

source: Google Drive backup
ta: Google Driveல் நகலெடுக்கவும்

source: Miscellaneous
ta: இதர

source: Subtasks
ta: துணை பணிகள்

source: Enabled
ta: இயக்கப்பட்டது

source: Font size
ta: எழுத்துரு அளவு

# header_spacing
source: Spacing
ta: இடைவெளி

source: Row spacing
ta: வரிசை இடைவெளி

source: Customize edit screen
ta: திருத்து திரையைத் தனிப்பயனாக்குங்கள்

# customize_edit_screen_summary
source: Rearrange or remove fields
ta: புலங்களை மறுசீரமைக்க அல்லது அகற்றவும்

source: Source code
ta: மூல குறியீடு

# translations
source: Contribute translations
ta: மொழிபெயர்ப்புகளை பங்களிக்கவும்

source: Contact developer
ta: டெவலப்பரைத் தொடர்பு கொள்ளுங்கள்

source: Send application logs
ta: பயன்பாட்டு பதிவுகளை அனுப்பவும்

source: Rate Tasks
ta: விகித பணிகள்

# quiet_hours_summary
source: No reminders during quiet hours
ta: அமைதியான நேரங்களில் நினைவூட்டல்கள் இல்லை

source: Add reminder
ta: நினைவூட்டலைச் சேர்க்கவும்

source: Add location
ta: இருப்பிடத்தைச் சேர்க்கவும்

source: Remove
ta: அகற்று

# randomly_every
source: Randomly every %s
ta: தோராயமாக ஒவ்வொரு %s

source: Randomly
ta: சீரற்ற

source: Pick a date and time
ta: தேதி மற்றும் நேரத்தைத் தேர்ந்தெடுங்கள்

source: When overdue
ta: தாமதமாகும்போது

source: When due
ta: காரணமாக இருக்கும்போது

source: When started
ta: தொடங்கும்போது

source: Tags
ta: குறிச்சொற்கள்

source: Change priority
ta: முன்னுரிமையை மாற்றவும்

source: Filters
ta: வடிப்பான்கள்

# date_shortcut_hour
source: For an hour
ta: ஒரு மணி நேரத்திற்கு

# date_shortcut_morning
source: Morning
ta: காலை

# date_shortcut_afternoon
source: Afternoon
ta: மதியம்

# date_shortcut_evening
source: Evening
ta: மாலை

# date_shortcut_night
source: Night
ta: இரவு

# date_shortcut_tomorrow_morning
source: Tomorrow morning
ta: நாளை காலை

# date_shortcut_tomorrow_afternoon
source: Tomorrow afternoon
ta: நாளை மதியம்

# date_shortcut_tomorrow_evening
source: Tomorrow evening
ta: நாளை மாலை

# date_shortcut_tomorrow_night
source: Tomorrow night
ta: நாளை இரவு

# date_shortcut_must_come_before
source: %1$s must come before %2$s
ta: %1$s %2$s க்கு முன் வர வேண்டும்

# date_shortcut_must_come_after
source: %1$s must come after %2$s
ta: %1$s %2$s க்குப் பிறகு வர வேண்டும்

source: Discard changes?
ta: மாற்றங்களை கைவிடலாமா?

# menu_discard_changes
source: Discard changes
ta: மாற்றங்களை கைவிடலாமா

source: Discard
ta: நிராகரி

source: Tag settings
ta: குறிச்சொல் அமைப்புகள்

source: List settings
ta: பட்டியல் அமைப்புகள்

source: Delete
ta: அழி

source: Copy
ta: நகலெடுக்கவும்

source: Move
ta: நகர்வு

source: Filter settings
ta: அமைப்புகளை வடிகட்டவும்

source: Show unstarted
ta: தொடங்காதவற்றை காட்டு

source: Show completed
ta: நிகழ்ச்சி முடிந்தது

# filter_criteria_unstarted
source: Not started
ta: தொடங்கப்படவில்லை

# no_app_found
source: No app could handle this request
ta: இந்த கோரிக்கையை எந்த பயன்பாடும் கையாள முடியாது

source: Add attachment
ta: இணைப்பை சேர்க்கவும்

source: Take a picture
ta: படம் எடுக்கவும்

source: Pick from gallery
ta: கேலரியில் இருந்து எடுக்கவும்

source: Pick from storage
ta: சேமிப்பிலிருந்து எடுக்கவும்

source: Privacy policy
ta: தனியுரிமைக் கொள்கை

# send_anonymous_statistics
source: Improve Tasks
ta: பணிகளை மேம்படுத்தவும்

# send_anonymous_statistics_summary
source: Send anonymous usage statistics and crash reports to help improve Tasks. No personal data will be collected.
ta: பணிகளை மேம்படுத்த உதவ அநாமதேய பயன்பாட்டு புள்ளிவிவரங்கள் மற்றும் செயலிழப்பு அறிக்கைகளை அனுப்பவும். தனிப்பட்ட தரவு எதுவும் சேகரிக்கப்படாது.

source: Tag already exists
ta: குறிச்சொல் ஏற்கனவே உள்ளது

source: Name cannot be empty
ta: பெயர் காலியாக இருக்க முடியாது

source: Username required
ta: பயனர்பெயர் தேவை

source: Password required
ta: கடவுச்சொல் தேவை

source: URL required
ta: URL தேவை

# url_host_name_required
source: Hostname required
ta: ஹோஸ்ட்பெயர் தேவை

# url_invalid_scheme
source: Must begin with http(s)://
ta: Http (கள்) உடன் தொடங்க வேண்டும்: //

source: (No title)
ta: (தலைப்பு இல்லை)

source: Back button saves task
ta: பின் பொத்தான் பணியைச் சேமிக்கிறது

source: Show edit screen without unlock
ta: திறக்காமல் திருத்து திரை காண்பி

# show_edit_screen_without_unlock_summary
source: Enables use of Quick Settings tile without unlocking device
ta: சாதனத்தைத் திறக்காமல் விரைவான அமைப்புகள் ஓடு பயன்படுத்த உதவுகிறது

source: Default list
ta: இயல்புநிலை பட்டியல்

source: Default tags
ta: இயல்புநிலை குறிச்சொற்கள்

source: Default recurrence
ta: இயல்புநிலை மீண்டும் நிகழ்கிறது

source: Filter
ta: வடிகட்டு

source: Opacity
ta: ஒளிபுகா தன்மை

# opacity_header
source: Header opacity
ta: தலைப்பு ஒளிபுகாநிலை

# opacity_row
source: Row opacity
ta: வரிசை ஒளிபுகாநிலை

# opacity_footer
source: Footer opacity
ta: அடிக்குறிப்பு ஒளிபுகாநிலை

source: Theme
ta: பேசும்

source: Color
ta: நிறம்

source: Icon
ta: உருவம்

source: Launcher icon
ta: துவக்கி படவுரு

# theme_black
source: Black
ta: கருப்பு

# theme_light
source: Light
ta: ஒளி

# theme_dark
source: Dark
ta: இருள்

# theme_wallpaper
source: Wallpaper
ta: சுவர்

# theme_day_night
source: Day/Night
ta: பகல் / இரவு

# theme_system_default
source: System default
ta: கணினி இயல்புநிலை

# theme_dynamic
source: Dynamic
ta: மாறும்

source: Language
ta: மொழி

# restart_required
source: Restart Tasks for this change to take effect
ta: இந்த மாற்றம் நடைமுறைக்கு வருவதற்கான பணிகளை மறுதொடக்கம் செய்யுங்கள்

source: Restart now
ta: இப்போது மறுதொடக்கம் செய்யுங்கள்

# restart_later
source: Later
ta: பின்னர்

# settings_localization
source: Localization
ta: உள்ளூர்மயமாக்கல்

source: LED notification
ta: LED அறிவிப்பு

source: Hardware support required
ta: வன்பொருள் ஆதரவு தேவை

source: Widget settings
ta: விட்ஜெட் அமைப்புகள்

# widget_header_settings
source: Header settings
ta: தலைப்பு அமைப்புகள்

# widget_row_settings
source: Row settings
ta: வரிசை அமைப்புகள்

# widget_open_list
source: Open list
ta: திறந்த பட்டியல்

# widget_due_date_after_title
source: After title
ta: தலைப்புக்குப் பிறகு

# widget_due_date_below_title
source: Below title
ta: தலைப்புக்கு கீழே

# widget_due_date_hidden
source: Hidden
ta: மறைக்கப்பட்டுள்ளது

# clear_completed_tasks_confirmation
source: Clear completed tasks?
ta: பூர்த்தி செய்யப்பட்ட பணிகளை அழிக்கவா?

# clear_completed_tasks_count
source: %s will be deleted
ta: %s நீக்கப்படும்

# copy_multiple_tasks_confirmation
source: %s copied
ta: %s நகலெடுக்கப்பட்டது

# delete_multiple_tasks_confirmation
source: %s deleted
ta: %s நீக்கப்பட்டது

source: Delete selected tasks?
ta: தேர்ந்தெடுக்கப்பட்ட பணிகளை நீக்கவா?

source: Copy selected tasks?
ta: தேர்ந்தெடுக்கப்பட்ட பணிகளை நகலெடுக்கவா?

source: Date and time
ta: தேதி மற்றும் நேரம்

source: Add account
ta: கணக்கு சேர்க்க

source: User
ta: பயனர்

source: Password
ta: கடவுச்சொல்

# error_adding_account
source: Error: %s
ta: பிழை: %s

# notification_disable_battery_optimizations_description
source: Battery optimizations may delay notifications
ta: பேட்டரி மேம்படுத்தல்கள் அறிவிப்புகளை தாமதப்படுத்தக்கூடும்

source: Bundle notifications
ta: மூட்டை அறிவிப்புகள்

source: Default Reminder
ta: இயல்புநிலை நினைவூட்டல்

source: Badges
ta: அடையாளக்குறிகள்

source: List
ta: பட்டியல்

source: Repeats from
ta: இருந்து மீண்டும்

# repeats_single
source: Repeats %s
ta: %s மீண்டும் செய்கிறது

# repeats_single_on
source: Repeats %1$s on %2$s
ta: %2$s இல் %1$s மறுநிகழ்வு

# repeats_single_number_of_times
source: Repeats %1$s, occurs %2$d %3$s
ta: %1$s மீண்டும் நிகழ்கிறது, %2$d %3$s

# repeats_single_on_until
source: Repeats %1$s on %2$s, ends on %3$s
ta: %2$s இல் %1$s மறுநிகழ்வு, %3$s இல் முடிகிறது

# repeats_single_on_number_of_times
source: Repeats %1$s on %2$s, occurs %3$d %4$s
ta: %2$s இல் %1$s, %3$d %4 $ s ஏற்படுகிறது

# repeats_minutely
source: minutely
ta: மிகச்சிறிய

# repeats_hourly
source: hourly
ta: மணிநேர

# repeats_daily
source: daily
ta: தினசரி

# repeats_weekly
source: weekly
ta: வாராந்திர

# repeats_monthly
source: monthly
ta: மாதாந்திர

# repeats_yearly
source: yearly
ta: ஆண்டு
