Repository: 247i/TACETr
Catalog: உரை/தானி/tasks-android-*.po
Languages: ta

# repeats_custom_recurrence
source: Custom recurrence
ta: தனிப்பயன் மறுநிகழ்வு

source: Repeats every
ta: ஒவ்வொன்றும் மீண்டும்

# repeats_weekly_on
source: Repeats on
ta: மறுநிகழ்வு

# repeats_never
source: Never
ta: ஒருபோதும்

# repeats_on
source: On
ta: ஆன்

# repeats_after
source: After
ta: பிறகு

# repeats_ends
source: Ends
ta: முனைகள்

# repeats_plural
source: Repeats every %s
ta: ஒவ்வொரு %s ஐ மறுநிகழ்வு செய்கிறது

# repeats_plural_on
source: Repeats every %1$s on %2$s
ta: %2$s இல் ஒவ்வொரு %1$s ஐ மறுநிகழ்வு செய்கிறது

# repeats_plural_until
source: Repeats every %1$s, ends on %2$s
ta: ஒவ்வொரு %1$s ஐ மறுநிகழ்வு, %2$s இல் முடிகிறது

# repeats_plural_number_of_times
source: Repeats every %1$s, occurs %2$d %3$s
ta: ஒவ்வொரு %1$s ஐ மீண்டும் நிகழ்கிறது, %2$d %3$s ஏற்படுகிறது

# repeats_plural_on_until
source: Repeats every %1$s on %2$s, ends on %3$s
ta: %2$s இல் ஒவ்வொரு %1$s ஐ மறுநிகழ்வு, %3$s இல் முடிகிறது

# repeats_plural_on_number_of_times
source: Repeats every %1$s on %2$s, occurs %3$d %4$s
ta: %2$s இல் ஒவ்வொரு %1$s ஐ மீண்டும் நிகழ்கிறது, %3$d %4 $ s ஏற்படுகிறது

source: Don't add to calendar
ta: நாள்காட்டியில் சேர்க்க வேண்டாம்

source: Default calendar
ta: இயல்புநிலை காலண்டர்

# rmd_time_description
source: Show notifications for tasks without due times
ta: பணிகளுக்கான அறிவிப்புகளைக் காட்டுங்கள்

# badges_description
source: Display a task count on Tasks' launcher icon. Not all launchers support badges.
ta: பணிகளின் துவக்க ஐகானில் பணி எண்ணிக்கையைக் காண்பி. அனைத்து துவக்கிகளும் பேட்ச்களை ஆதரிக்கவில்லை.

# bundle_notifications_summary
source: Combine multiple notifications into one
ta: பல அறிவிப்புகளை ஒன்றில் இணைக்கவும்

# repeat_monthly_every_day_of_nth_week
source: every %1$s %2$s
ta: ஒவ்வொரு %1$s %2$s

# repeat_monthly_on_day_number
source: Monthly on day %1d
ta: நாள் %1d

# repeat_monthly_on_the_nth_weekday
source: Monthly on the %1$s %2$s
ta: %1$s %2$s இல் மாதாந்திர

# repeat_monthly_first_week
source: first
ta: முதல்

# repeat_monthly_second_week
source: second
ta: இரண்டாவது

# repeat_monthly_third_week
source: third
ta: மூன்றாவது

# repeat_monthly_fourth_week
source: fourth
ta: நான்காவது

# repeat_monthly_fifth_week
source: fifth
ta: ஐந்தாவது

# repeat_monthly_last_week
source: last
ta: கடந்த

# tasker_create_task
source: Create task
ta: பணியை உருவாக்கவும்

# tasker_list_notification
source: List notification
ta: பட்டியல் அறிவிப்பு

source: Help
ta: உதவி

# help_and_feedback
source: Help & feedback
ta: உதவி & கருத்து

# caldav_home_set_not_found
source: Home set not found
ta: முகப்பு தொகுப்பு கிடைக்கவில்லை

# network_error
source: Could not connect
ta: இணைக்க முடியவில்லை

source: Upgrade to pro
ta: சார்புக்கு மேம்படுத்தவும்

source: Subscription
ta: சந்தா

# manage_subscription
source: Modify subscription
ta: சந்தாவை மாற்றவும்

source: Refresh purchases
ta: வாங்குதல்களைப் புதுப்பிக்கவும்

# button_subscribe
source: Subscribe
ta: பதிவு

# button_unsubscribe
source: Cancel subscription
ta: சந்தாவை ரத்துசெய்

source: About
ta: பற்றி

# license_summary
source: Tasks is libre open-source software, licensed under the GNU General Public License v3.0
ta: பணிகள் லிப்ரே ஓப்பன் சோர்ஸ் மென்பொருளாகும், இது குனு GPLv3.0 இன் கீழ் உரிமம் பெற்றது

# pro_dashclock_extension
source: Dashclock extension
ta: டாஷ்க்லாக் நீட்டிப்பு

source: Requires pro subscription
ta: சார்பு சந்தா தேவை

source: This feature requires a subscription
ta: இந்த அம்சத்திற்கு சந்தா தேவை

source: Log out
ta: வெளியேறு

# logout_warning
source: All data for this account will be removed from your device
ta: இந்தக் கணக்கிற்கான எல்லா தரவும் உங்கள் சாதனத்திலிருந்து அகற்றப்படும்

source: Cannot access account
ta: கணக்கை அணுக முடியாது

# reinitialize_account
source: Reinitialize
ta: மீண்டும் துவக்கு

# action_create_new_task
source: Create new task
ta: புதிய பணியை உருவாக்கவும்

# action_new_task
source: New task
ta: புதிய பணி

source: Show description
ta: விளக்கத்தைக் காட்டு

source: Show full description
ta: முழு விளக்கத்தைக் காட்டு

# linkify
source: Show links
ta: இணைப்புகளைக் காட்டு

# linkify_description
source: Add links to websites, addresses, and phone numbers
ta: வலைத்தளங்கள், முகவரிகள் மற்றும் தொலைபேசி எண்களுக்கு இணைப்புகளைச் சேர்க்கவும்

# location_remind_arrival
source: Remind on arrival
ta: வருகையை நினைவூட்டுங்கள்

# location_remind_departure
source: Remind on departure
ta: புறப்படுவதை நினைவூட்டுங்கள்

source: Visit website
ta: வலைத்தளத்தைப் பார்வையிடவும்

# location_arrived
source: Arrived at %s
ta: %s இல் வந்து சேர்ந்தது

# location_departed
source: Departed %s
ta: புறப்பட்டது %s

# building_notifications
source: Generating notifications
ta: அறிவிப்புகளை உருவாக்குகிறது

source: Choose a location
ta: இருப்பிடத்தைத் தேர்வுசெய்க

# pick_this_location
source: Select this location
ta: இந்த இருப்பிடத்தைத் தேர்ந்தெடுக்கவும்

source: Or choose a location
ta: அல்லது இருப்பிடத்தைத் தேர்வுசெய்க

source: Missing permissions
ta: அனுமதிகள் இல்லை

# background_location_permission_required
source: Tasks collects location data to enable location-based reminders, even when the app is closed or not in use.
ta: பயன்பாடு மூடப்பட்டிருந்தாலும் அல்லது பயன்பாட்டில் இல்லாவிட்டாலும் கூட, இருப்பிட அடிப்படையிலான நினைவூட்டல்களை இயக்க பணிகள் இருப்பிடத் தரவை சேகரிக்கின்றன.

# location_permission_required_location
source: Location permissions are needed to find your current location
ta: உங்கள் தற்போதைய இருப்பிடத்தைக் கண்டுபிடிக்க இருப்பிட அனுமதிகள் தேவை

source: Open map
ta: வரைபடத்தைத் திறக்கவும்

source: Choose new location
ta: புதிய இருப்பிடத்தைத் தேர்வுசெய்க

source: Third-party licenses
ta: மூன்றாம் தரப்பு உரிமங்கள்

source: What's New
ta: புதியது என்ன

# version_string
source: Version %s
ta: பதிப்பு %s

source: Invalid backup file
ta: தவறான காப்பு கோப்பு

# google_tasks_add_to_top
source: New tasks on top
ta: மேலே புதிய பணிகள்

source: Name your price
ta: உங்கள் விலைக்கு பெயரிடுங்கள்

source: Expand subtasks
ta: துணை பணிகளை விரிவாக்குங்கள்

source: Collapse subtasks
ta: துணை பணிகளைச் சுருக்கவும்

# subtasks_multilevel_microsoft
source: Multi-level subtasks not supported by Microsoft To Do
ta: மைக்ரோசாப்ட் ஆதரிக்காத பல-நிலை துணைப்பிரிவுகள் செய்ய

source: Enter tag name
ta: குறிச்சொல் பெயரை உள்ளிடவும்

# choose_synchronization_service
source: Select a platform
ta: ஒரு தளத்தைத் தேர்ந்தெடுக்கவும்

# tasks_org_description
source: Synchronize your tasks with Tasks.org
ta: உங்கள் பணிகளை டாச்கள்.org உடன் ஒத்திசைக்கவும்

# decsync_selection_description
source: File-based synchronization
ta: கோப்பு அடிப்படையிலான ஒத்திசைவு

# microsoft_selection_description
source: Synchronize with your personal Microsoft account
ta: உங்கள் தனிப்பட்ட நுண்மென் கணக்குடன் ஒத்திசைக்கவும்

# davx5_selection_description
source: Synchronize your tasks with the DAVx⁵ app
ta: உங்கள் பணிகளை DAVX⁵ பயன்பாட்டுடன் ஒத்திசைக்கவும்

source: Show advanced settings
ta: மேம்பட்ட அமைப்புகளைக் காட்டு

# etesync_account_description
source: Requires an account with EteSync.com or a self-hosted server
ta: EteSync.com அல்லது சுய ஹோஸ்ட் செய்த சேவையகத்துடன் கணக்கு தேவை

# preferences_look_and_feel
source: Look and feel
ta: பார்க்கவும் உணரவும்

# preferences_advanced
source: Advanced
ta: மேம்படுத்தபட்ட

source: Documentation
ta: ஆவணம்

source: Wearable notifications
ta: அணியக்கூடிய அறிவிப்புகள்

# wearable_notifications_summary
source: Display notifications on your wearable
ta: நீங்கள் அணிந்திருப்பவற்றில் notifications காட்டவும்

source: Troubleshooting
ta: பழுது நீக்கும்

# notification_troubleshooting_summary
source: Tap here if you are having trouble with notifications
ta: அறிவிப்புகளில் சிக்கல் இருந்தால் இங்கே தட்டவும்

source: Disable battery optimizations
ta: பேட்டரி மேம்படுத்தல்களை முடக்கு

source: More settings
ta: மேலும் அமைப்புகள்

# more_notification_settings_summary
source: Ringtone, vibrations, and more
ta: ரிங்டோன், அதிர்வுகள் மற்றும் பல

source: Invalid username or password
ta: தவறான பயனர்பெயர் அல்லது கடவுச்சொல்

source: Color wheel
ta: வண்ண சக்கரம்

# upgrade_blurb_1
source: Hi! My name is Alex. I am the independent developer behind Tasks
ta: வணக்கம்! என் பெயர் அலெக்ஸ். பணிகளுக்குப் பின்னால் உள்ள சுயாதீன டெவலப்பர் நான்

# upgrade_blurb_2
source: I have spent thousands of hours working on Tasks, and I publish all of the source code online for free. In order to support my work some features require a subscription
ta: நான் பணிகளில் ஆயிரக்கணக்கான மணிநேரங்களை செலவிட்டேன், மேலும் மூலக் குறியீடு அனைத்தையும் ஆன்லைனில் இலவசமாக வெளியிடுகிறேன். எனது பணியை ஆதரிக்க சில அம்சங்களுக்கு சந்தா தேவை

source: Back
ta: மீண்டும்

source: Chip appearance
ta: சிப் தோற்றம்

source: Places
ta: இடங்கள்

source: Navigation drawer
ta: வழிசெலுத்தல் டிராயர்

source: Hide unused tags
ta: பயன்படுத்தப்படாத குறிச்சொற்களை மறைக்கவும்

source: Hide unused places
ta: பயன்படுத்தப்படாத இடங்களை மறைக்கவும்

source: No date
ta: தேதி இல்லை

source: No time
ta: நேரம் இல்லை

# shortcut_pick_time
source: Pick time
ta: நேரத்தைத் தேர்ந்தெடுங்கள்

# auto_dismiss_datetime
source: Autoclose date time picker
ta: தேதி தேர்வை தானாகவே மூடவும்

# auto_dismiss_datetime_list
source: Task list
ta: பணி பட்டியல்

# auto_dismiss_datetime_list_summary
source: Autoclose when picking from task list
ta: பணி பட்டியலிலிருந்து எடுக்கும்போது ஆட்டோக்ளோச்

# auto_dismiss_datetime_edit
source: Task edit
ta: பணி திருத்தம்

# auto_dismiss_datetime_edit_summary
source: Autoclose when picking from task edit
ta: பணி திருத்தத்திலிருந்து எடுக்கும்போது ஆட்டோக்ளோச்

# auto_dismiss_datetime_widget
source: Widget
ta: விட்ஜெட்

# auto_dismiss_datetime_widget_summary
source: Autoclose when picking from widget
ta: விட்செட்டில் இருந்து எடுக்கும்போது ஆட்டோக்ளோச்

# auto_dismiss_datetime_summary
source: Close date time picker after selecting a date or time
ta: தேதி தேர்வை, தேர்வுக்கு பின் மூடவும்

# calendar_event_created
source: Calendar event created for %s
ta: %s க்கு காலண்டர் நிகழ்வு உருவாக்கப்பட்டது

source: Select all
ta: அனைத்தையும் தெரிவுசெய்

source: Share
ta: பகிர்

# widget_id
source: Widget ID: %d
ta: விட்ஜெட் ஐடி: %d

# settings_default
source: Default
ta: இயல்புநிலை

source: Compact
ta: கச்சிதமான

# custom_filter_and
source: AND
ta: மற்றும்

# custom_filter_or
source: OR
ta: அல்லது

# custom_filter_not
source: NOT
ta: இல்லை

# filter_overdue
source: Overdue
ta: காலம் கடந்த

# filter_today_only
source: Today only
ta: இன்று மட்டும்

# filter_any_due_date
source: Any due date
ta: ஏதேனும் உரிய தேதி

# filter_after_today
source: After today
ta: இன்றுக்குப் பிறகு

# filter_no_tags
source: No tags
ta: குறிச்சொற்கள் இல்லை

source: Add tags
ta: குறிச்சொற்களைச் சேர்க்கவும்

# filter_high_priority
source: High priority
ta: அதி முக்கியத்துவம்

# filter_medium_priority
source: Medium priority
ta: நடுத்தர முன்னுரிமை

# filter_low_priority
source: Low priority
ta: குறைந்த முன்னுரிமை

# filter_no_priority
source: No priority
ta: குறைந்த முன்னுரிமை

source: Enjoying Tasks?
ta: பணிகளை அனுபவிக்கிறீர்களா?

# donate_nag
source: Consider showing your support with a donation!
ta: நன்கொடை மூலம் உங்கள் ஆதரவைக் காண்பிப்பதைக் கவனியுங்கள்!

source: Donate today
ta: இன்று நன்கொடை

# donate_maybe_later
source: Maybe later
ta: ஒருவேளை பின்னர்

# support_development_subscribe
source: Unlock additional features and support open source software
ta: கூடுதல் அம்சங்களைத் திறந்து திறந்த மூல மென்பொருளை ஆதரிக்கவும்

source: Got it!
ta: அறிந்துகொண்டேன்!

# sort_start_group
source: Start %s
ta: தொடக்க %s

# sort_due_group
source: Due %s
ta: காரணமாக %s

# sort_created_group
source: Created %s
ta: %s உருவாக்கப்பட்டது

# sort_modified_group
source: Modified %s
ta: மாற்றியமைக்கப்பட்ட %s

# sort_completion_group
source: Completion %s
ta: நிறைவு %s

source: On launch
ta: தொடங்கும்போது

source: Open last viewed list
ta: கடைசியாகப் பார்த்த பட்டியலைத் திறக்கவும்

source: Local lists
ta: உள்ளக பட்டியல்கள்

source: Lists
ta: பட்டியல்கள்

source: Reset sort order
ta: வரிசை வரிசையை மீட்டமைக்கவும்

# permission_read_tasks
source: Full access to Tasks database
ta: பணிகள் தரவுத்தளத்திற்கான முழு அணுகல்

source: Automatic backups
ta: தானியங்கி காப்புப்பிரதிகள்

# android_auto_backup
source: Android Backup Service
ta: ஆண்ட்ராய்டு காப்பு பணி

# android_auto_backup_device_summary
source: You must also opt in to backup service through your device settings. Not all devices provide backup service.
ta: உங்கள் சாதன அமைப்புகள் மூலம் காப்புப்பிரதி சேவையைத் தேர்வுசெய்ய வேண்டும். எல்லா சாதனங்களும் காப்பு சேவையை வழங்காது.

# last_backup
source: Last backup: %s
ta: கடைசி காப்புப்பிரதி: %s

# last_backup_never
source: never
ta: ஒருபோதும்

source: Device settings
ta: சாதன அமைப்புகள்

source: Account
ta: கணக்கு

source: Foreground location
ta: முன்புற இடம்

source: Background location
ta: பின்னணி இடம்

# backups_ignore_warnings
source: Ignore warnings
ta: எச்சரிக்கைகளை புறக்கணிக்கவும்

# backups_ignore_warnings_summary
source: Ignore backup warnings if you do not need backups or have your own backup solution
ta: உங்களுக்கு காப்புப்பிரதிகள் தேவையில்லை அல்லது உங்கள் சொந்த காப்புப்பிரதி தீர்வு இருந்தால் காப்புப்பிரதி எச்சரிக்கைகளை புறக்கணிக்கவும்

# backup_location_warning
source: WARNING: Files located in %s will be deleted if Tasks is uninstalled! Please choose a custom location to prevent Android from deleting your files.
ta: எச்சரிக்கை: பணிகள் நிறுவல் நீக்கப்பட்டால் %s இல் அமைந்துள்ள கோப்புகள் நீக்கப்படும்! உங்கள் கோப்புகளை நீக்குவதைத் தடுக்க தனிப்பயன் இருப்பிடத்தைத் தேர்வுசெய்க.

# multi_select_reschedule
source: Reschedule
ta: மறுசீரமைப்பு

# date_picker_multiple
source: Multiple
ta: நான்கு

# custom_filter_has_subtask
source: Has subtasks
ta: துணை பணிகள் உள்ளன

# custom_filter_is_subtask
source: Is subtask
ta: சப்டாச்க்

# custom_filter_has_reminder
source: Has reminder
ta: நினைவூட்டல் உள்ளது

# your_subscription_expired
source: Your subscription has expired. Subscribe now to resume service.
ta: உங்கள் சந்தா காலாவதியானது. சேவையை மீண்டும் தொடங்க இப்போது குழுசேரவும்.

# insufficient_subscription
source: Insufficient subscription level. Please upgrade your subscription to resume service.
ta: போதுமான சந்தா நிலை. சேவையை மீண்டும் தொடங்க உங்கள் சந்தாவை மேம்படுத்தவும்.

# insufficient_sponsorship
source: No eligible GitHub sponsorship found
ta: தகுதியான அறிவிலிமையம் ச்பான்சர்சிப் எதுவும் கிடைக்கவில்லை

# no_google_play_subscription
source: No eligible Google Play subscription found
ta: தகுதியான கூகிள் பிளே சந்தா எதுவும் கிடைக்கவில்லை

# price_per_year
source: $%s/year
ta: $%s/ஆண்டு

# price_per_month
source: $%s/month
ta: $%s/மாதம்

# price_per_month_with_currency
source: %s/month
ta: %s/மாதம்

# price_per_year_with_currency
source: %s/year
ta: %s/ஆண்டு

# current_subscription
source: Current subscription: %s
ta: தற்போதைய சந்தா: %s

# follow_reddit
source: Join r/tasks
ta: ஆர்/பணிகளில் சேரவும்

# follow_twitter
source: Follow @tasks_org
ta: @Tasks_org ஐப் பின்தொடரவும்

# chat_libera
source: Join #tasks on Libera Chat
ta: லைபரா அரட்டையில் #பணிகளில் சேரவும்

source: Social
ta: சமூக

source: Support
ta: உதவி

source: Issue tracker
ta: வெளியீடு டிராக்கர்

source: Open source
ta: திறந்த மூல

source: Privacy
ta: தனியுரிமை

source: Authorization cancelled
ta: ஏற்பு ரத்து செய்யப்பட்டது

source: Not signed in
ta: உள்நுழையவில்லை

source: Google Play subscribers
ta: கூகிள் பிளே சந்தாதாரர்கள்

source: GitHub Sponsors
ta: அறிவிலிமையம் ஒப்புரவாளர்கள்

source: Sign in with Google
ta: Google உடன் உள்நுழைக

source: Sign in with GitHub
ta: கிதுபுடன் உள்நுழைக

source: Authentication required
ta: ஏற்பு தேவை

# github_sponsor
source: Sponsor
ta: ஒப்புரவாளர்

source: Migrate
ta: இடம்பெயர்வு

source: Migrating tasks
ta: இடம்பெயரும் பணிகள்

# migrate_count
source: Move %s to Tasks.org
ta: %s ஐ tasks.org க்கு நகர்த்தவும்

source: Above average
ta: சராசரிக்கு மேல்

# save_percent
source: Save %d%%
ta: %d %% சேமிக்கவும்

# sign_in_to_tasks
source: Sign in to Tasks.org
ta: Tasks.org இல் உள்நுழைக

# sign_in_to_tasks_disclosure
source: Your e-mail address and account ID will be transmitted and stored by Tasks.org. This information will be used for authentication and to provide you with important service related announcements. This information will not be shared with anyone.
ta: உங்கள் மின்னஞ்சல் முகவரி மற்றும் கணக்கு ஐடி TASKS.org ஆல் அனுப்பப்பட்டு சேமிக்கப்படும். இந்த செய்தி அங்கீகாரத்திற்காகவும், முக்கியமான பணி தொடர்பான அறிவிப்புகளை உங்களுக்கு வழங்கவும் பயன்படுத்தப்படும். இந்த செய்தி யாருடனும் பகிரப்படாது.

source: App password
ta: பயன்பாட்டு கடவுச்சொல்

source: App passwords
ta: பயன்பாட்டு கடவுச்சொற்கள்

# app_passwords_more_info
source: Synchronize your tasks and calendars with third-party desktop and mobile apps. Tap here for more info
ta: மூன்றாம் தரப்பு டெச்க்டாப் மற்றும் மொபைல் பயன்பாடுகளுடன் உங்கள் பணிகள் மற்றும் காலெண்டர்களை ஒத்திசைக்கவும். மேலும் தகவலுக்கு இங்கே தட்டவும்

source: Generate new password
ta: புதிய கடவுச்சொல்லை உருவாக்குங்கள்

# app_password_enter_description
source: Give your password a name (optional)
ta: உங்கள் கடவுச்சொல்லை ஒரு பெயரைக் கொடுங்கள் (விரும்பினால்)

# app_password_created_at
source: Created: %s
ta: உருவாக்கப்பட்டது: %s

# app_password_last_access
source: Last used: %s
ta: கடைசியாக பயன்படுத்தப்பட்டது: %s

# app_password_delete_confirmation
source: Any app using this password will be signed out
ta: இந்த கடவுச்சொல்லைப் பயன்படுத்தும் எந்த பயன்பாடும் பதிவு செய்யப்படும்

# app_password_save
source: Use these credentials to configure a third-party app. They grant complete access to your Tasks.org account, don't write them down or share them with anyone!
ta: மூன்றாம் தரப்பு பயன்பாட்டை உள்ளமைக்க இந்த நற்சான்றிதழ்களைப் பயன்படுத்தவும். அவர்கள் உங்கள் டாச்க்ச்.org கணக்கிற்கு முழுமையான அணுகலை வழங்குகிறார்கள், அவற்றை எழுத வேண்டாம் அல்லது யாருடனும் பகிர்ந்து கொள்ள வேண்டாம்!

# copied_to_clipboard
source: %s copied to clipboard
ta: இடைநிலைப்பலகைக்கு %s நகலெடுக்கப்பட்டது

source: Tasks.org account
ta: Tasks.org கணக்கு

source: Tasks.org account required
ta: Tasks.org கணக்கு தேவை

# account_not_included
source: Not included with 'Name your price' subscriptions
ta: 'உங்கள் விலை பெயர்' சந்தாக்களுடன் சேர்க்கப்படவில்லை

source: List members
ta: உறுப்பினர்களை பட்டியலிடுங்கள்

source: Remove user?
ta: பயனரை அகற்றவா?

# remove_user_confirmation
source: %1$s will no longer have access to %2$s
ta: %1$s இனி %2$s அணுகல் இருக்காது

source: Share list
ta: பகிர்வு பட்டியல்

source: Email
ta: மின்னஞ்சல்

source: Invite
ta: அழைக்கவும்

source: Invite declined
ta: அழைப்பு மறுக்கப்பட்டது

source: Invite awaiting response
ta: காத்திருக்கும் பதிலுக்காக அழைக்கவும்

source: Invite invalid
ta: செல்லாது என்று அழைக்கவும்

# picker_mode_date
source: Date picker mode
ta: தேதி பிக்கர் பயன்முறை

# picker_mode_time
source: Time picker mode
ta: நேர பிக்கர் பயன்முறை

# picker_mode_calendar
source: Calendar
ta: நாட்காட்டி

# picker_mode_clock
source: Clock
ta: கடிகை

# picker_mode_text
source: Text
ta: உரை

# pro_free_trial
source: New subscribers receive a 7-day free trial. Cancel at any time
ta: புதிய சந்தாதாரர்கள் 7 நாள் இலவச சோதனையைப் பெறுகிறார்கள். எந்த நேரத்திலும் ரத்துசெய்

# upgrade_more_customization
source: More customization
ta: மேலும் தனிப்பயனாக்கம்

# upgrade_more_customization_description
source: Unlock all themes, colors, and icons
ta: அனைத்து கருப்பொருள்கள், வண்ணங்கள் மற்றும் ஐகான்களைத் திறக்கவும்

# upgrade_tasks_org_account_description
source: Sync with Tasks.org and collaborate with other users
ta: Tasks.org உடன் ஒத்திசைத்து பிற பயனர்களுடன் ஒத்துழைக்கவும்

# upgrade_desktop_access
source: Desktop access
ta: டெச்க்டாப் அணுகல்

# upgrade_desktop_access_description
source: Sync with third-party clients like Outlook and Apple Reminders
ta: அவுட்லுக் மற்றும் ஆப்பிள் நினைவூட்டல்கள் போன்ற மூன்றாம் தரப்பு வாடிக்கையாளர்களுடன் ஒத்திசைக்கவும்

# upgrade_open_source_description
source: Your subscription supports continued development
ta: உங்கள் சந்தா தொடர்ச்சியான வளர்ச்சியை ஆதரிக்கிறது

source: More options
ta: மேலும் விருப்பங்கள்

source: Markdown
ta: மார்க் பேரூர்

# markdown_description
source: Enable Markdown in title and description
ta: தலைப்பு மற்றும் விளக்கத்தில் மார்க் டவுனை இயக்கவும்

# completion_sound
source: Play completion sound
ta: நிறைவு ஒலி

source: Completed
ta: முடிந்தது

# snackbar_task_completed
source: Task completed
ta: பணி முடிந்தது

# completed_tasks_at_bottom
source: Move completed tasks to bottom
ta: நிறைவு செய்யப்பட்ட பணிகளை கீழே நகர்த்தவும்

# snackbar_tasks_completed
source: %d tasks completed
ta: %d பணிகள் முடிந்தது

# alarm_before_start
source: %s before start
ta: தொடங்குவதற்கு முன் %s

# alarm_after_start
source: %s after start
ta: தொடக்கத்திற்குப் பிறகு %s

# alarm_before_due
source: %s before due
ta: வருவதற்கு முன் %s

# alarm_after_due
source: %s after due
ta: உரிய பிறகு %s

# snoozed_until
source: Snoozed until %s
ta: %s வரை உறக்கநிலை

source: Custom notification
ta: தனிப்பயன் notification

# caldav_server_unknown
source: Unknown
ta: தெரியவில்லை

# caldav_server_other
source: Other
ta: மற்றொன்று

# caldav_server_type
source: Server type
ta: சேவையக வகை

source: Dismiss
ta: தள்ளுபடி

# hint_customize_edit_title
source: Too much information?
ta: அதிகமான தகவல்கள்?

# hint_customize_edit_body
source: You can customize this screen by rearranging or removing fields
ta: புலங்களை மறுசீரமைப்பதன் மூலம் அல்லது அகற்றுவதன் மூலம் இந்தத் திரையைத் தனிப்பயனாக்கலாம்

source: Enable reminders
ta: நினைவூட்டல்களை இயக்கவும்

# enable_reminders_description
source: Reminders are disabled in Android Settings
ta: ஆண்ட்ராய்டு அமைப்புகளில் நினைவூட்டல்கள் முடக்கப்பட்டுள்ளன

# enable_alarms
source: Get notified at the right time
ta: சரியான நேரத்தில் அறிவிக்கப்படுங்கள்

# enable_alarms_description
source: To make sure you're notified at the right time, grant permission to set alarms and reminders in Settings
ta: சரியான நேரத்தில் உங்களுக்கு அறிவிக்கப்பட்டிருப்பதை உறுதிப்படுத்த, அமைப்புகளில் அலாரங்கள் மற்றும் நினைவூட்டல்களை அமைக்க இசைவு வழங்கவும்

source: Sign in
ta: விடுபதிகை

# consent_agree
source: Agree
ta: ஒப்புக்கொள்கிறேன்

# consent_deny
source: Not now
ta: இப்போது இல்லை

# sort_sorting
source: Sorting
ta: வரிசைப்படுத்துதல்

# sort_grouping
source: Grouping
ta: தொகுத்தல்

# sort_ascending
source: Ascending
ta: ஏறுதல்

# sort_descending
source: Descending
ta: இறங்கு

# sort_not_available
source: Not available for tags, filters, or places
ta: குறிச்சொற்கள், வடிப்பான்கள் அல்லது இடங்களுக்கு கிடைக்கவில்லை

source: Add shortcut to home screen
ta: முகப்புத் திரையில் குறுக்குவழியைச் சேர்க்கவும்

source: Add widget to home screen
ta: முகப்புத் திரையில் விட்செட்டைச் சேர்க்கவும்

source: Cost: Free
ta: செலவு: இலவசம்

# cost_money
source: Cost: $
ta: செலவு: $

# cost_more_money
source: Cost: $$$
ta: செலவு: $$$

# multiline_title
source: Allow multiline titles
ta: மல்டிலைன் தலைப்புகளை அனுமதிக்கவும்

# multiline_title_on
source: Press Enter key to add line breaks
ta: வரி இடைவெளிகளைச் சேர்க்க ENTER விசையை அழுத்தவும்

# multiline_title_off
source: Press Done to close keyboard
ta: விசைப்பலகை மூட முடிந்தது

# sync_warning_microsoft_title
source: About Microsoft To Do sync
ta: ஒத்திசைவு செய்ய மைக்ரோசாப்ட் பற்றி

# sync_warning_microsoft
source: Not all task details sync with Microsoft To Do.
ta: அனைத்து பணி விவரங்களும் மைக்ரோசாப்ட் உடன் ஒத்திசைக்கவில்லை.

# sync_warning_google_tasks_title
source: About Google Task sync
ta: கூகிள் பணி ஒத்திசைவு பற்றி

# sync_warning_google_tasks
source: Not all task details sync with Google Tasks
ta: அனைத்து பணி விவரங்களும் கூகிள் பணிகளுடன் ஒத்திசைக்கவில்லை

# button_learn_more
source: Learn more
ta: மேலும் அறிக
