Repository: 247i/TACETr
Catalog: உரை/தானி/tb-android-onboarding-migration-*.po
Languages: ta

# onboarding_migration_thunderbird_qr_code_import_title
source: Already using Thunderbird on desktop?
ta: ஏற்கனவே டெச்க்டாப்பில் தண்டர்பேர்டைப் பயன்படுத்துகிறீர்களா?

# onboarding_migration_thunderbird_qr_code_import_text
source: Easily import your account settings by scanning a QR code.
ta: QR குறியீட்டை ச்கேன் செய்வதன் மூலம் உங்கள் கணக்கு அமைப்புகளை எளிதாக இறக்குமதி செய்யுங்கள்.

# onboarding_migration_thunderbird_qr_code_import_instructions_intro
source: In Thunderbird desktop, go to:
ta: தண்டர்பேர்ட் டெச்க்டாப்பில், செல்லுங்கள்:

# onboarding_migration_thunderbird_qr_code_import_instructions_bullet_1
source: ‘Settings’ in the Spaces Toolbar (bottom left)
ta: ச்பேச் கருவிப்பட்டியில் ‘அமைப்புகள்’ (கீழ் இடது)

# onboarding_migration_thunderbird_qr_code_import_instructions_bullet_2_v2
source: Select ‘Export to Mobile’
ta: ‘மொபைலுக்கு ஏற்றுமதி’ என்பதைத் தேர்ந்தெடுக்கவும்

# onboarding_migration_thunderbird_qr_code_import_instructions_require_latest
source: Import requires the latest version of Thunderbird Desktop 128. <xliff:g id="link_text">%s</xliff:g>
ta: இறக்குமதிக்கு தண்டர்பேர்ட் டெச்க்டாப் 128 இன் அண்மைக் கால பதிப்பு தேவைப்படுகிறது.

# onboarding_migration_thunderbird_qr_code_import_instructions_learn_update
source: Learn how to update Thunderbird.
ta: தண்டர்பேர்டைப் புதுப்பிப்பது எப்படி என்பதை அறிக.

# onboarding_migration_thunderbird_qr_code_import_button_text
source: Import settings
ta: அமைப்புகளை இறக்குமதி செய்யுங்கள்

# onboarding_migration_thunderbird_new_account_title
source: New to Thunderbird?
ta: தண்டர்பேர்டுக்கு புதியதா?

# onboarding_migration_thunderbird_new_account_button_text
source: Add an email account now
ta: இப்போது ஒரு மின்னஞ்சல் கணக்கைச் சேர்க்கவும்

# onboarding_migration_thunderbird_import_title
source: Moving from another app or device?
ta: மற்றொரு பயன்பாடு அல்லது சாதனத்திலிருந்து நகர்கிறீர்களா?

# onboarding_migration_thunderbird_import_button_text
source: Import your account settings now
ta: உங்கள் கணக்கு அமைப்புகளை இப்போது இறக்குமதி செய்யுங்கள்

# onboarding_migration_thunderbird_link_open_error
source: No app found to open the link.
ta: இணைப்பைத் திறக்க எந்த பயன்பாடும் கிடைக்கவில்லை.
