Repository: 247i/TACETr
Catalog: உரை/தானி/thegoldeconomy-github-*.po
Languages: ta

# command.info.add
source: Use to add gold to an account
ta: ஒரு கணக்கில் தங்கத்தை சேர்க்க பயன்படுத்தவும்

# command.info.balance
source: Shows your current balance
ta: உங்கள் தற்போதைய சமநிலையைக் காட்டுகிறது

# command.info.deposit
source: Use to deposit gold onto your account
ta: உங்கள் கணக்கில் தங்கத்தை டெபாசிட் செய்ய பயன்படுத்தவும்

# command.info.pay
source: Use to send another player gold
ta: மற்றொரு பிளேயர் தங்கத்தை அனுப்ப பயன்படுத்தவும்

# command.info.remove
source: Use to remove gold from an account
ta: ஒரு கணக்கிலிருந்து தங்கத்தை அகற்ற பயன்படுத்தவும்

# command.info.set
source: Use to set the account balance of a player
ta: ஒரு வீரரின் கணக்கு இருப்பை அமைக்க பயன்படுத்தவும்

# command.info.withdraw
source: Use to withdraw gold from your account
ta: உங்கள் கணக்கிலிருந்து தங்கத்தை திரும்பப் பெற பயன்படுத்தவும்

# error.bankplot
source: You have to be on a Bank Plot to use this command!
ta: இந்த கட்டளையைப் பயன்படுத்த நீங்கள் வங்கி சதித்திட்டத்தில் இருக்க வேண்டும்!

# error.invalidBase
source: The base is not correctly defined in the config file! Only the values "nuggets", "ingots" or "raw" are allowed! If you don't have the base option in your config file, add: base: "nuggets", "ingots" or "raw"
ta: கட்டமைப்பு கோப்பில் அடிப்படை சரியாக வரையறுக்கப்படவில்லை! "நகட்", "இங்காட்கள்" அல்லது "ரா" மதிப்புகள் மட்டுமே அனுமதிக்கப்படுகின்றன! உங்கள் கட்டமைப்பு கோப்பில் அடிப்படை விருப்பம் இல்லையென்றால், சேர்: அடிப்படை: "நகட்", "இங்கோட்கள்" அல்லது "ரா"

# error.negative
source: You can't withdraw, deposit or transfer a negative amount of gold!
ta: எதிர்மறையான அளவு தங்கத்தை நீங்கள் திரும்பப் பெறவோ, டெபாசிட் செய்யவோ அல்லது மாற்றவோ முடியாது!

# error.noPermission
source: &cNo permission
ta: & CNO இசைவு

# error.noPlayer
source: No player found!
ta: எந்த வீரரும் கிடைக்கவில்லை!

# error.notAPlayer
source: You need to be a player to run the command!
ta: கட்டளையை இயக்க நீங்கள் ஒரு வீரராக இருக்க வேண்டும்!

# error.notEnough
source: You don't have enough gold!
ta: உங்களிடம் போதுமான தங்கம் இல்லை!

# error.notEnoughMoneyWithdraw
source: You can't withdraw more than you have!
ta: உங்களிடம் இருப்பதை விட அதிகமாக நீங்கள் திரும்பப் பெற முடியாது!

# error.payYourself
source: You cannot send money to yourself!
ta: நீங்களே பணம் அனுப்ப முடியாது!

# error.zero
source: You can't withdraw or deposit 0 gold!
ta: நீங்கள் 0 தங்கத்தை திரும்பப் பெறவோ அல்லது டெபாசிட் செய்யவோ முடியாது!

# help.deposit
source: You need to specify how much gold you want to deposit! Usage: /bank deposit <gold | all>
ta: நீங்கள் எவ்வளவு தங்கத்தை டெபாசிட் செய்ய விரும்புகிறீர்கள் என்பதைக் குறிப்பிட வேண்டும்! பயன்பாடு: /வங்கி வைப்பு <தங்கம் | எல்லாம்>

# help.withdraw
source: You need to specify how much gold you want to withdraw! Usage: /bank withdraw <gold | all>
ta: நீங்கள் எவ்வளவு தங்கத்தை திரும்பப் பெற விரும்புகிறீர்கள் என்பதைக் குறிப்பிட வேண்டும்! பயன்பாடு: /வங்கி திரும்பப் பெறுதல் <தங்கம் | எல்லாம்>

# info.balance
source: &fYou have a total of &6%d&f gold (Bank: &6%d&f | Inventory: &6%d&f)
ta: & fyou மொத்தம் & 6%d & எஃப் தங்கம் (வங்கி: & 6%d & எஃப் | சரக்கு: & 6%d & எஃப்)

# info.balance.other
source: &f%s has currently a balance of &6%d gold &f
ta: & f%s தற்போது & 6%d தங்கம் & f இன் சமநிலையைக் கொண்டுள்ளது

# info.deposit
source: &fYou have deposited &6%d&f gold.
ta: நீங்கள் டெபாசிட் செய்துள்ளீர்கள் & 6%d & எஃப் தங்கம்.

# info.moneyReceived
source: You have received &6%d gold &f from %s!
ta: நீங்கள் & 6 %d கோல்ட் & எஃப் %s இலிருந்து பெற்றுள்ளீர்கள்!

# info.sender.addmoney
source: Added &6%d gold to the balance of %s!
ta: சேர்க்கப்பட்டது & %s சமநிலைக்கு 6 %d தங்கம்!

# info.sender.moneyset
source: Balance from %s set to &6%d!
ta: %s அமைக்கப்பட்ட & 6 %d இலிருந்து இருப்பு!

# info.sender.remove
source: Removed &6%d gold from the balance of %s!
ta: நீக்கப்பட்டது & %s சமநிலையிலிருந்து 6 %d தங்கம்!

# info.sendMoneyTo
source: You've sent &6%d gold&f to %s!
ta: நீங்கள் & 6 %d கோல்ட் & எஃப் %s க்கு அனுப்பியுள்ளீர்கள்!

# info.target.addMoney
source: %d gold was added to your balance!
ta: உங்கள் சமநிலைக்கு %d தங்கம் சேர்க்கப்பட்டது!

# info.target.moneySet
source: Your balance was set to %d!
ta: உங்கள் இருப்பு %d ஆக அமைக்கப்பட்டது!

# info.target.remove
source: %d gold was removed from your balance!
ta: உங்கள் சமநிலையிலிருந்து %d தங்கம் அகற்றப்பட்டது!

# info.withdraw
source: &fYou have withdrawn &6%d&f gold.
ta: நீங்கள் திரும்பப் பெற்றுள்ளீர்கள் & 6%d & எஃப் தங்கம்.

# warning.drops
source: &fItems that didn't fit into your inventory were dropped!
ta: உங்கள் சரக்குகளுக்கு பொருந்தாத & ஃபிடெம்கள் கைவிடப்பட்டன!

# warning.update
source: &fYou are using an outdated version of the plugin. Please update to the latest version.
ta: & fyou சொருகி காலாவதியான பதிப்பைப் பயன்படுத்துகிறது. அண்மைக் கால பதிப்பிற்கு புதுப்பிக்கவும்.
