Repository: 247i/TACETr
Catalog: உரை/தானி/theme-color-handbookgeneral-*.po
Languages: ta

source: General
ta: பொது

source: This application allows you to modify the current color scheme of Lipstick (a.k.a. Home Screen).
ta: லிப்ச்டிக் (a.k.a. முகப்புத் திரை) தற்போதைய வண்ணத் திட்டத்தை மாற்ற இந்த பயன்பாடு உங்களை அனுமதிக்கிறது.

source: It can not (yet) however, change saved Ambiences directly. Applied changes will not survive an Ambience change, Lipstick restart, or device reboot.<br> However, using the Shelves feature you can restore schemes you previously saved and re-apply them afterwards.
ta: இருப்பினும் (இன்னும்) காப்பாற்றப்பட்ட ஆச்சரை நேரடியாக மாற்ற முடியாது. பயன்பாட்டு மாற்றங்கள் ஒரு சுற்றுப்புற மாற்றம், உதட்டுச்சாயம் மறுதொடக்கம் அல்லது சாதன மறுதொடக்கம் ஆகியவற்றிலிருந்து தப்பிக்காது. <br> இருப்பினும், அலமாரிகள் அம்சத்தைப் பயன்படுத்தி நீங்கள் முன்பு சேமித்த திட்டங்களை மீட்டெடுக்கலாம் மற்றும் பின்னர் அவற்றை மீண்டும் பயன்படுத்தலாம்.

source: Also, by exporting changes to an installable package, changes can be made permanent.
ta: மேலும், நிறுவக்கூடிய தொகுப்பில் மாற்றங்களை ஏற்றுமதி செய்வதன் மூலம், மாற்றங்களை நிரந்தரமாக்க முடியும்.

source: Currently only some colors can be edited. There are others in use by the system which are usually autocomputed from the basic four and can not be modified.
ta: தற்போது சில வண்ணங்களை மட்டுமே திருத்த முடியும். கணினியால் பயன்பாட்டில் உள்ளது, அவை வழக்கமாக அடிப்படை நான்கிலிருந்து தன்னியக்கமாக்கப்படுகின்றன, மேலும் அவை மாற்றியமைக்க முடியாது.

source: We are working on overcoming some of these limitations, but some things would require patching the system UI elements which is beyond the scope of this app.
ta: இந்த வரம்புகளில் சிலவற்றைக் கடப்பதில் நாங்கள் பணியாற்றி வருகிறோம், ஆனால் சில விசயங்களுக்கு இந்த பயன்பாட்டின் எல்லைக்கு அப்பாற்பட்ட கணினி இடைமுகம் கூறுகளை ஒட்டுவது தேவைப்படும்.

source: Basic Workflow
ta: அடிப்படை பணிப்பாய்வு

source: The basic workflow for re-coloring an existing Ambience or creating a new one would be something like this:
ta: ஏற்கனவே உள்ள சூழலை மீண்டும் வண்ணமயமாக்குவதற்கான அடிப்படை பணிப்பாய்வு அல்லது புதிய ஒன்றை உருவாக்குவது இது போன்றதாக இருக்கும்:

source: switch to an Ambience of your liking using the usual methods
ta: வழக்கமான முறைகளைப் பயன்படுத்தி உங்கள் விருப்பத்தின் சூழலுக்கு மாறவும்

source: launch ThemeColor
ta: ThemeColor ஐத் தொடங்கவும்

source: using the Sliders editing mode, adjust the four basic colors (primary, secondary, highlight and secondary highlight) to your liking.
ta: ச்லைடர்கள் திருத்துதல் பயன்முறையைப் பயன்படுத்தி, உங்கள் விருப்பப்படி நான்கு அடிப்படை வண்ணங்களை (முதன்மை, இரண்டாம் நிலை, சிறப்பம்சமாக மற்றும் இரண்டாம் நிலை சிறப்பம்சம்) சரிசெய்யவும்.

source: use the PullDown menu <i>Apply Colors to System</i> to apply to the current theme
ta: தற்போதைய கருப்பொருளுக்கு விண்ணப்பிக்க புல்டவுன் பட்டியல் <i> கணினிக்கு வண்ணங்களைப் பயன்படுத்துங்கள் </i>

source: explore the Sailfish UI a bit to make sure all looks right. Always check the VKB, that can easily become unreadable
ta: அனைத்தும் சரியாகத் தெரிகிறது என்பதை உறுதிப்படுத்த படகோட்டம் இடைமுகம் ஐ சற்று ஆராயுங்கள். எப்போதும் VKB ஐ சரிபார்க்கவும், அது எளிதில் படிக்க முடியாததாக மாறும்

source: go back to ThemeColor, and use the Shelves to store your colors for later reuse from within the app.
ta: ThemeColor க்குச் சென்று, அலமாரிகளைப் பயன்படுத்தி உங்கள் வண்ணங்களை பயன்பாட்டிற்குள் இருந்து மறுபயன்பாட்டுக்கு சேமிக்க.

source: adjust if necessary and repeat the last two steps above until everything looks pretty
ta: தேவைப்பட்டால் சரிசெய்து, எல்லாம் அழகாக இருக்கும் வரை மேலே இரண்டு படிகளை மேலே செய்யவும்

source: (optional:) to export and create an ambience RPM, and optionally install it, use the menu item <i>Export Ambience</i>
ta: (optional:) பெறுநர் ஏற்றுமதி and create an ambience RPM, and optionally install it, use the பட்டியல் item <i>Export Ambience</i>

source: … and done! Your new Ambience should now show up in the usual place in Settings to select.
ta: … முடிந்தது! உங்கள் புதிய சூழ்நிலை இப்போது தேர்வு செய்ய அமைப்புகளில் வழக்கமான இடத்தில் காட்டப்பட வேண்டும்.

source: If it does not (sometimes it happens) that means that ambienced has crashed. In that case you can try to use the two <i>Restart</i> functions on the Advanced page to restart either Lipstick (the Home Screen), or just ambienced (the Theme engine)).
ta: அது இல்லையென்றால் (சில நேரங்களில் அது நிகழ்கிறது) அதாவது அம்பியென்ட் செயலிழந்தது. அவ்வாறான நிலையில், லிப்ச்டிக் (முகப்புத் திரை) அல்லது அப்பட்டமான (தீம் எஞ்சின்)) மறுதொடக்கம் செய்ய மேம்பட்ட பக்கத்தில் இரண்டு <i> மறுதொடக்கம் </i> செயல்பாடுகளைப் பயன்படுத்த முயற்சி செய்யலாம்.
