Repository: 247i/TACETr
Catalog: உரை/தானி/thorium-reader-thorium-reader-translation-*.po
Languages: ta

# settings.keyboard.list.NavigateNextLibraryPageAlt.description
source: In the library window, show the next page of a paginated list of publications. This is an alternative keyboard shortcut to the default one
ta: நூலக சாளரத்தில், வெளியீடுகளின் சிறிய பட்டியலின் அடுத்த பக்கத்தைக் காட்டுங்கள். இது இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி

# settings.keyboard.list.NavigateNextLibraryPageAlt.name
source: Go to Next Library Page (Alternative)
ta: அடுத்த நூலகப் பக்கத்திற்குச் செல்லவும் (மாற்று)

# settings.keyboard.list.NavigateNextOPDSPage.description
source: In the library window for catalogs / OPDS feeds, follow the next pagination link. Note that there is an alternative keyboard shortcut to this default one
ta: பட்டியல்கள் / OPDS ஊட்டங்களுக்கான நூலக சாளரத்தில், அடுத்த மாசு இணைப்பைப் பின்பற்றவும். இந்த இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி உள்ளது என்பதை நினைவில் கொள்க

# settings.keyboard.list.NavigateNextOPDSPage.name
source: Go to Next OPDS Page
ta: அடுத்த OPDS பக்கத்திற்குச் செல்லவும்

# settings.keyboard.list.NavigateNextOPDSPageAlt.description
source: In the library window for catalogs / OPDS feeds, follow the next pagination link. This is an alternative keyboard shortcut to the default one
ta: பட்டியல்கள் / OPDS ஊட்டங்களுக்கான நூலக சாளரத்தில், அடுத்த மாசு இணைப்பைப் பின்பற்றவும். இது இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி

# settings.keyboard.list.NavigateNextOPDSPageAlt.name
source: Go to Next OPDS Page (Alternative)
ta: அடுத்த OPDS பக்கத்திற்குச் செல்லவும் (மாற்று)

# settings.keyboard.list.NavigateNextPage.description
source: In the reader window, turn to the next 'page' in the publication. Note that there is an alternative keyboard shortcut to this default one
ta: வாசகர் சாளரத்தில், வெளியீட்டில் அடுத்த 'பக்கத்திற்கு' திரும்பவும். இந்த இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி உள்ளது என்பதை நினைவில் கொள்க

# settings.keyboard.list.NavigateNextPage.name
source: Go to Next Page
ta: அடுத்த பக்கத்திற்குச் செல்

# settings.keyboard.list.NavigateNextPageAlt.description
source: In the reader window, turn to the next 'page' in the publication. This is an alternative keyboard shortcut to the default one
ta: வாசகர் சாளரத்தில், வெளியீட்டில் அடுத்த 'பக்கத்திற்கு' திரும்பவும். இது இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி

# settings.keyboard.list.NavigateNextPageAlt.name
source: Go to Next Page (Alternative)
ta: அடுத்த பக்கத்திற்குச் செல்லவும் (மாற்று)

# settings.keyboard.list.NavigatePreviousChapter.description
source: In the reader window, navigate to the previous document in the reading order of the publication (e.g. chapter in the book spine). Note that there is an alternative keyboard shortcut to this default one
ta: வாசகர் சாளரத்தில், வெளியீட்டின் வாசிப்பு வரிசையில் முந்தைய ஆவணத்திற்கு செல்லவும் (எ.கா. முதுகெலும்பில் அத்தியாயம்). இந்த இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி உள்ளது என்பதை நினைவில் கொள்க

# settings.keyboard.list.NavigatePreviousChapter.name
source: Go to Previous Chapter
ta: முந்தைய அத்தியாயத்திற்குச் செல்லுங்கள்

# settings.keyboard.list.NavigatePreviousChapterAlt.description
source: In the reader window, navigate to the previous document in the reading order of the publication (e.g. chapter in the book spine). This is an alternative keyboard shortcut to the default one
ta: வாசகர் சாளரத்தில், வெளியீட்டின் வாசிப்பு வரிசையில் முந்தைய ஆவணத்திற்கு செல்லவும் (எ.கா. முதுகெலும்பில் அத்தியாயம்). இது இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி

# settings.keyboard.list.NavigatePreviousChapterAlt.name
source: Go to Previous Chapter (Alternative)
ta: முந்தைய அத்தியாயத்திற்குச் செல்லவும் (மாற்று)

# settings.keyboard.list.NavigatePreviousHistory.description
source: In the reader window, jump one step backwards in the navigation history
ta: வாசகர் சாளரத்தில், வழிசெலுத்தல் வரலாற்றில் ஒரு படி பின்னோக்கி செல்லவும்

# settings.keyboard.list.NavigatePreviousHistory.name
source: Go to Previous History
ta: முந்தைய வரலாற்றுக்குச் செல்லுங்கள்

# settings.keyboard.list.NavigatePreviousLibraryPage.description
source: In the library window, show the previous page of a paginated list of publications. Note that there is an alternative keyboard shortcut to this default one
ta: நூலக சாளரத்தில், வெளியீடுகளின் சிறிய பட்டியலின் முந்தைய பக்கத்தைக் காட்டுங்கள். இந்த இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி உள்ளது என்பதை நினைவில் கொள்க

# settings.keyboard.list.NavigatePreviousLibraryPage.name
source: Go to Previous Library Page
ta: முந்தைய நூலகப் பக்கத்திற்குச் செல்லவும்

# settings.keyboard.list.NavigatePreviousLibraryPageAlt.description
source: In the library window, show the previous page of a paginated list of publications. This is an alternative keyboard shortcut to the default one
ta: நூலக சாளரத்தில், வெளியீடுகளின் சிறிய பட்டியலின் முந்தைய பக்கத்தைக் காட்டுங்கள். இது இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி

# settings.keyboard.list.NavigatePreviousLibraryPageAlt.name
source: Go to Previous Library Page (Alternative)
ta: முந்தைய நூலகப் பக்கத்திற்குச் செல்லவும் (மாற்று)

# settings.keyboard.list.NavigatePreviousOPDSPage.description
source: In the library window for catalogs / OPDS feeds, follow the previous pagination link. Note that there is an alternative keyboard shortcut to this default one
ta: பட்டியல்கள் / OPDS ஊட்டங்களுக்கான நூலக சாளரத்தில், முந்தைய மாசு இணைப்பைப் பின்பற்றவும். இந்த இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி உள்ளது என்பதை நினைவில் கொள்க

# settings.keyboard.list.NavigatePreviousOPDSPage.name
source: Go to Previous OPDS Page
ta: முந்தைய OPDS பக்கத்திற்குச் செல்லவும்

# settings.keyboard.list.NavigatePreviousOPDSPageAlt.description
source: In the library window for catalogs / OPDS feeds, follow the previous pagination link. This is an alternative keyboard shortcut to the default one
ta: பட்டியல்கள் / OPDS ஊட்டங்களுக்கான நூலக சாளரத்தில், முந்தைய மாசு இணைப்பைப் பின்பற்றவும். இது இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி

# settings.keyboard.list.NavigatePreviousOPDSPageAlt.name
source: Go to Previous OPDS Page (Alternative)
ta: முந்தைய OPDS பக்கத்திற்குச் செல்லவும் (மாற்று)

# settings.keyboard.list.NavigatePreviousPage.description
source: In the reader window, turn to the previous 'page' in the publication. Note that there is an alternative keyboard shortcut to this default one
ta: வாசகர் சாளரத்தில், வெளியீட்டில் முந்தைய 'பக்கத்திற்கு' திரும்பவும். இந்த இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி உள்ளது என்பதை நினைவில் கொள்க

# settings.keyboard.list.NavigatePreviousPage.name
source: Go to Previous Page
ta: முந்தைய பக்கத்திற்குச் செல்

# settings.keyboard.list.NavigatePreviousPageAlt.description
source: In the reader window, turn to the previous 'page' in the publication. This is an alternative keyboard shortcut to the default one
ta: வாசகர் சாளரத்தில், வெளியீட்டில் முந்தைய 'பக்கத்திற்கு' திரும்பவும். இது இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி

# settings.keyboard.list.NavigatePreviousPageAlt.name
source: Go to Previous Page (Alternative)
ta: முந்தைய பக்கத்திற்குச் செல்லவும் (மாற்று)

# settings.keyboard.list.NavigateToBegin.description
source: In the reader window, go to the beginning of the publication
ta: வாசகர் சாளரத்தில், வெளியீட்டின் தொடக்கத்திற்குச் செல்லவும்

# settings.keyboard.list.NavigateToBegin.name
source: Go to Beginning
ta: தொடக்கத்திற்குச் செல்லுங்கள்

# settings.keyboard.list.NavigateToEnd.description
source: In the reader window, go to the end of the publication
ta: வாசகர் சாளரத்தில், வெளியீட்டின் முடிவுக்குச் செல்லவும்

# settings.keyboard.list.NavigateToEnd.name
source: Go to End
ta: முடிவுக்குச் செல்லுங்கள்

# settings.keyboard.list.OpenReaderInfo.description
source: In the reader window, open the popup dialog that display information about the publication
ta: வாசகர் சாளரத்தில், வெளியீட்டைப் பற்றிய தகவல்களைக் காண்பிக்கும் மேல்தோன்றல் உரையாடலைத் திறக்கவும்

# settings.keyboard.list.OpenReaderInfo.name
source: Display Publication Information
ta: வெளியீட்டு தகவலைக் காண்பி

# settings.keyboard.list.OpenReaderInfoWhereAmI.description
source: In the reader window, open the popup dialog that display information about the publication, and focus the keyboard on the section that shows the context of the current reading location
ta: வாசகர் சாளரத்தில், வெளியீட்டைப் பற்றிய தகவல்களைக் காண்பிக்கும் மேல்தோன்றல் உரையாடலைத் திறந்து, தற்போதைய வாசிப்பு இருப்பிடத்தின் சூழலைக் காட்டும் பிரிவில் விசைப்பலகை கவனம் செலுத்துங்கள்

# settings.keyboard.list.OpenReaderInfoWhereAmI.name
source: Display Publication Information, Show Reading Location
ta: வெளியீட்டு தகவலைக் காண்பி, வாசிப்பு இருப்பிடத்தைக் காண்பி

# settings.keyboard.list.Print.description
source: In the reader window, open the print dialog
ta: வாசகர் சாளரத்தில், அச்சு உரையாடலைத் திறக்கவும்

# settings.keyboard.list.Print.name
source: Print
ta: அச்சிடுக

# settings.keyboard.list.SearchNext.description
source: In the reader window's search tool, go to the next found match. Note that there is an alternative keyboard shortcut to this default one
ta: ரீடர் சாளரத்தின் தேடல் கருவியில், அடுத்ததாகக் காணப்பட்ட போட்டிக்குச் செல்லவும். இந்த இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி உள்ளது என்பதை நினைவில் கொள்க

# settings.keyboard.list.SearchNext.name
source: Search Next
ta: அடுத்து தேடுங்கள்

# settings.keyboard.list.SearchNextAlt.description
source: In the reader window's search tool, go to the next found match. This is an alternative keyboard shortcut to the default one
ta: வாசகர் சாளரத்தின் தேடல் கருவியில், அடுத்ததாகக் காணப்படும் போட்டிக்குச் செல்லவும். இது இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி

# settings.keyboard.list.SearchNextAlt.name
source: Search Next (Alternative)
ta: அடுத்து தேடுங்கள் (மாற்று)

# settings.keyboard.list.SearchPrevious.description
source: In the reader window's search tool, go to the previous found match. Note that there is an alternative keyboard shortcut to this default one
ta: வாசகர் சாளரத்தின் தேடல் கருவியில், முந்தைய போட்டிக்குச் செல்லவும். இந்த இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி உள்ளது என்பதை நினைவில் கொள்க

# settings.keyboard.list.SearchPrevious.name
source: Search Previous
ta: முன்பு தேடுங்கள்

# settings.keyboard.list.SearchPreviousAlt.description
source: In the reader window's search tool, go to the previous found match. This is an alternative keyboard shortcut to the default one
ta: வாசகர் சாளரத்தின் தேடல் கருவியில், முந்தைய போட்டிக்குச் செல்லவும். இது இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி

# settings.keyboard.list.SearchPreviousAlt.name
source: Search Previous (Alternative)
ta: முந்தையதைத் தேடுங்கள் (மாற்று)

# settings.keyboard.list.SpeakReaderInfoWhereAmI.description
source: In the reader window, describe the context of the current reading location, using speech text compatible with screen readers
ta: வாசகர் சாளரத்தில், தற்போதைய வாசிப்பு இருப்பிடத்தின் சூழலை விவரிக்கவும், பேச்சு உரையை திரை வாசகர்களுடன் இணக்கமாகப் பயன்படுத்துங்கள்

# settings.keyboard.list.SpeakReaderInfoWhereAmI.name
source: Describe Reading Location (Speech)
ta: வாசிப்பு இருப்பிடத்தை விவரிக்கவும் (பேச்சு)

# settings.keyboard.list.ToggleBookmark.description
source: Add a new bookmark or remove an existing one if it is currently selected
ta: புதிய புக்மார்க்கைச் சேர்க்கவும் அல்லது தற்போது தேர்ந்தெடுக்கப்பட்டால் ஏற்கனவே இருக்கும் ஒன்றை அகற்றவும்

# settings.keyboard.list.ToggleBookmark.name
source: Toggle Bookmark
ta: புத்தக்குறியை மாற்று

# settings.keyboard.list.ToggleReaderFullscreen.description
source: In the reader window, activate system fullscreen or restore normal window mode. Note that this is different from 'zen mode' which simplifies the user interface
ta: ரீடர் சாளரத்தில், கணினி முழுத் திரையை செயல்படுத்தவும் அல்லது சாதாரண சாளர பயன்முறையை மீட்டெடுக்கவும். இது பயனர் இடைமுகத்தை எளிதாக்கும் 'சென் பயன்முறை' இலிருந்து வேறுபட்டது என்பதை நினைவில் கொள்க

# settings.keyboard.list.ToggleReaderFullscreen.name
source: Toggle Fullscreen
ta: மாற்று முழுத்திரை

# settings.keyboard.loadUserJson
source: Load from user file
ta: பயனர் கோப்பிலிருந்து ஏற்றவும்

# settings.keyboard.noShortcutFound
source: No shortcut found with this label
ta: இந்த லேபிளுடன் குறுக்குவழி எதுவும் கிடைக்கவில்லை

# settings.keyboard.resetDefaults
source: Reset (load defaults)
ta: மீட்டமைக்கவும் (இயல்புநிலைகளை ஏற்றவும்)

# settings.keyboard.save
source: Save
ta: சேமி

# settings.keyboard.searchPlaceholder
source: Type to search a shortcut
ta: குறுக்குவழியைத் தேட தட்டச்சு செய்க

# settings.language.languageChoice
source: Language
ta: மொழி

# settings.library.enableAPIAPP
source: Activate the 'PNB' library system
ta: 'PNB' நூலக அமைப்பை செயல்படுத்தவும்

# settings.library.title
source: Access to French library accounts
ta: பிரஞ்சு நூலக கணக்குகளுக்கான அணுகல்

# settings.note.export.applyDefaultTemplate
source: Load default template
ta: இயல்புநிலை வார்ப்புருவை ஏற்றவும்

# settings.note.export.enableCheckbox
source: Customize the HTML template
ta: உஉகுமொ வார்ப்புருவைத் தனிப்பயனாக்குங்கள்

# settings.note.export.overrideHTMLTemplate
source: Notes export (annotations and bookmarks)
ta: குறிப்புகள் ஏற்றுமதி (சிறுகுறிப்புகள் மற்றும் புக்மார்க்குகள்)

# settings.session.title
source: Enable session saving
ta: அமர்வு சேமிப்பை இயக்கவும்

# settings.tabs.appearance
source: Appearance
ta: தோற்றம்

# settings.tabs.general
source: General
ta: பொது

# settings.tabs.keyboardShortcuts
source: Keyboard shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

# settings.theme.auto
source: Automatic
ta: தானியங்கி

# settings.theme.dark
source: Dark
ta: இருண்ட

# settings.theme.description
source: Application theme matches operating system.
ta: பயன்பாட்டு கருப்பொருள் இயக்க முறைமையுடன் பொருந்துகிறது.

# settings.theme.light
source: Light
ta: ஒளி

# settings.theme.title
source: Application Theme
ta: பயன்பாட்டு கருப்பொருள்

# tts.highlight.mainColor
source: Main colour
ta: முக்கிய நிறம்

# tts.highlight.maskBlockWordOutline
source: Mask Block, Word Outline
ta: மறைப்பு Block, சொல் Outline

# tts.highlight.maskBlockWordSolidBackground
source: Mask Block, Word Solid Background
ta: முகமூடி தொகுதி, சொல் திட பின்னணி

# tts.highlight.maskBlockWordUnderline
source: Mask Block, Word Underline
ta: முகமூடி தொகுதி, சொல் அடிக்கோடிட்டு

# tts.highlight.maskWordOutline
source: Mask, Word Outline
ta: முகமூடி, சொல் அவுட்லைன்

# tts.highlight.maskWordSolidBackground
source: Mask, Word Solid Background
ta: முகமூடி, சொல் திட பின்னணி

# tts.highlight.maskWordUnderline
source: Mask, Word Underline
ta: முகமூடி, சொல் அடிக்கோடிட்டு

# tts.highlight.outlineWordOutline
source: Outline, Word Outline
ta: அவுட்லைன், சொல் அவுட்லைன்

# tts.highlight.outlineWordSolidBackground
source: Outline, Word Solid Background
ta: அவுட்லைன், சொல் திட பின்னணி

# tts.highlight.outlineWordUnderline
source: Outline, Word Underline
ta: அவுட்லைன், சொல் அடிக்கோடிட்டு

# tts.highlight.preview
source: TTS highlight style preview
ta: TTS சிறப்பம்சமாக பாணி முன்னோட்டம்

# tts.highlight.solidBackgroundWordOutline
source: Solid Background, Word Outline
ta: திடமான பின்னணி, சொல் அவுட்லைன்

# tts.highlight.solidBackgroundWordSolidBackground
source: Solid Background, Word Solid Background
ta: திடமான பின்னணி, சொல் திட பின்னணி

# tts.highlight.solidBackgroundWordUnderline
source: Solid Background, Word Underline
ta: திடமான பின்னணி, சொல் அடிக்கோடிட்டு

source: TTS highlight style
ta: TTS சிறப்பம்சமாக பாணி

# tts.highlight.underlineWordOutline
source: Underline, Word Outline
ta: அடிக்கோடிட்டு, சொல் அவுட்லைன்

# tts.highlight.underlineWordSolidBackground
source: Underline, Word Solid Background
ta: அடிக்கோடிட்டு, சொல் திட பின்னணி

# tts.highlight.underlineWordUnderline
source: Underline, Word Underline
ta: அடிக்கோடிட்டு, சொல் அடிக்கோடிட்டு

# tts.highlight.wordColor
source: Word colour
ta: சொல் நிறம்

# wizard.buttons.discover
source: Discover what's new
ta: புதியதைக் கண்டறியவும்

# wizard.buttons.goToBooks
source: Go to my publications
ta: எனது வெளியீடுகளுக்குச் செல்லுங்கள்

# wizard.buttons.next
source: Next
ta: அடுத்தது

# wizard.description.annotations
source: Highlight document text, choose style and color, attach personal notes. Create annotations in 'quick' mode to bypass the editor (you can enter text and customize styles later). For extra speed, use the 'instant' mode which creates notes immediately after highlighting document text!
ta: ஆவண உரையை முன்னிலைப்படுத்தவும், பாணி மற்றும் வண்ணத்தைத் தேர்வுசெய்யவும், தனிப்பட்ட குறிப்புகளை இணைக்கவும். எடிட்டரைத் தவிர்ப்பதற்கு 'விரைவு' பயன்முறையில் சிறுகுறிப்புகளை உருவாக்கவும் (நீங்கள் உரையை உள்ளிட்டு பின்னர் பாணிகளைத் தனிப்பயனாக்கலாம்). கூடுதல் வேகத்திற்கு, ஆவண உரையை முன்னிலைப்படுத்திய உடனேயே குறிப்புகளை உருவாக்கும் 'உடனடி' பயன்முறையைப் பயன்படுத்தவும்!

# wizard.description.catalogs
source: Borrow publications from your local library or discover publications via OPDS feeds. Access a variety of publications from multiple sources thanks to online catalogs.
ta: உங்கள் உள்ளக நூலகத்திலிருந்து வெளியீடுகளை கடன் வாங்கவும் அல்லது OPDS ஊட்டங்கள் வழியாக வெளியீடுகளைக் கண்டறியவும். நிகழ்நிலை பட்டியல்களுக்கு நன்றி பல ஆதாரங்களிலிருந்து பல்வேறு வெளியீடுகளை அணுகவும்.

# wizard.description.home
source: Thorium looks different! Let's discover what's new...
ta: தோரியம் வித்தியாசமாகத் தெரிகிறது! புதியது என்ன என்பதைக் கண்டுபிடிப்போம் ...

# wizard.description.readingView1
source: Customize your reading and listening preferences: Thorium now offers multiple color themes for both the user interface and publication documents. It is now also easier to configure 'readaloud' ebooks with synthetic speech and synchronized text/audio narration.
ta: உங்கள் வாசிப்பு மற்றும் கேட்கும் விருப்பங்களைத் தனிப்பயனாக்குங்கள்: தோரியம் இப்போது பயனர் இடைமுகம் மற்றும் வெளியீட்டு ஆவணங்கள் இரண்டிற்கும் பல வண்ண கருப்பொருள்களை வழங்குகிறது. செயற்கை பேச்சு மற்றும் ஒத்திசைக்கப்பட்ட உரை/ஆடியோ விவரிப்புடன் 'மெடோலூட்' மின்புத்தகங்களை உள்ளமைப்பதும் இப்போது எளிதானது.

# wizard.description.readingView2
source: Thorium's improved user interface makes it easier to find text in publications, explore search results, go to specific pages, browse the table of contents, create bookmarks, etc. thanks to the new 'docked' panels. The fullscreen reading mode continues to offer a distraction-free environment.
ta: தோரியத்தின் மேம்பட்ட பயனர் இடைமுகம் வெளியீடுகளில் உரையைக் கண்டுபிடிப்பது, தேடல் முடிவுகளை ஆராய்வது, குறிப்பிட்ட பக்கங்களுக்குச் செல்வது, உள்ளடக்க அட்டவணையை உலாவுவது, புக்மார்க்குகளை உருவாக்குவது போன்றவற்றை எளிதாக்குகிறது. புதிய 'நறுக்கப்பட்ட' பேனல்களுக்கு நன்றி. முழுத்திரை வாசிப்பு முறை கவனச்சிதறல் இல்லாத சூழலை தொடர்ந்து வழங்குகிறது.

# wizard.description.yourBooks
source: Welcome to your redesigned personal bookshelf! In the 'grid' view, easily filter by tags or find publications by keywords. In the advanced 'table' view, select and sort publications by specific authors, title, date, format, etc.
ta: உங்கள் மறுவடிவமைப்பு செய்யப்பட்ட தனிப்பட்ட புத்தக அலமாரிக்கு வருக! 'கட்டம்' பார்வையில், குறிச்சொற்களால் எளிதில் வடிகட்டவும் அல்லது முக்கிய வார்த்தைகளால் வெளியீடுகளைக் கண்டறியவும். மேம்பட்ட 'அட்டவணை' பார்வையில், குறிப்பிட்ட ஆசிரியர்கள், தலைப்பு, தேதி, வடிவம் போன்றவற்றின் வெளியீடுகளைத் தேர்ந்தெடுத்து வரிசைப்படுத்துங்கள்.

# wizard.dontShow
source: Don't show again
ta: மீண்டும் காட்ட வேண்டாம்

# wizard.tab.annotations
source: Annotations
ta: சிறுகுறிப்புகள்

# wizard.tab.catalogs
source: Catalogs
ta: பட்டியல்கள்

# wizard.tab.home
source: Home
ta: வீடு

# wizard.tab.readingView
source: Reading view
ta: வாசிப்பு பார்வை

# wizard.tab.yourBooks
source: Your publications
ta: உங்கள் வெளியீடுகள்

# wizard.title.allBooks
source: All my publications
ta: எனது வெளியீடுகள் அனைத்தும்

# wizard.title.newFeature
source: New feature: Annotations
ta: புதிய அம்சம்: சிறுகுறிப்புகள்

# wizard.title.welcome
source: Welcome to Thorium 3.0
ta: தோரியம் 3.0 க்கு வருக
