Repository: 247i/TACETr
Catalog: உரை/தானி/thorium-reader-thorium-reader-translation-*.po
Languages: ta

# publ-a11y-display-guide.conformance.conformance-details-wcag-2-2.descriptive
source: Web Content Accessibility Guidelines (WCAG) 2.2
ta: வலை உள்ளடக்க அணுகல் வழிகாட்டுதல்கள் (WCAG) 2.2

# publ-a11y-display-guide.conformance.conformance-no.compact
source: No information is available
ta: எந்த தகவலும் கிடைக்கவில்லை

# publ-a11y-display-guide.conformance.conformance-no.descriptive
source: No information is available
ta: எந்த தகவலும் கிடைக்கவில்லை

# publ-a11y-display-guide.conformance.conformance-title
source: Conformance
ta: இணக்கம்

# publ-a11y-display-guide.conformance.conformance-unknown-standard.compact
source: Conformance to accepted standards for accessibility of this publication cannot be determined
ta: இந்த வெளியீட்டின் அணுகலுக்கான ஏற்றுக்கொள்ளப்பட்ட தரங்களுக்கு இணங்குவதை தீர்மானிக்க முடியாது

# publ-a11y-display-guide.conformance.conformance-unknown-standard.descriptive
source: Conformance to accepted standards for accessibility of this publication cannot be determined
ta: இந்த வெளியீட்டின் அணுகலுக்கான ஏற்றுக்கொள்ளப்பட்ட தரங்களுக்கு இணங்குவதை தீர்மானிக்க முடியாது

# publ-a11y-display-guide.hazards.hazards-flashing.compact
source: Flashing content
ta: ஒளிரும் உள்ளடக்கம்

# publ-a11y-display-guide.hazards.hazards-flashing.descriptive
source: The publication contains flashing content which can cause photosensitive seizures
ta: வெளியீட்டில் ஒளிரும் உள்ளடக்கம் உள்ளது, இது ஒளிச்சேர்க்கை வலிப்புத்தாக்கங்களை ஏற்படுத்தும்

# publ-a11y-display-guide.hazards.hazards-flashing-none.compact
source: No flashing content
ta: ஒளிரும் உள்ளடக்கம் இல்லை

# publ-a11y-display-guide.hazards.hazards-flashing-none.descriptive
source: The publication contains no flashing content
ta: வெளியீட்டில் ஒளிரும் உள்ளடக்கம் இல்லை

# publ-a11y-display-guide.hazards.hazards-flashing-unknown.compact
source: The presence of flashing content is unknown
ta: ஒளிரும் உள்ளடக்கத்தின் இருப்பு தெரியவில்லை

# publ-a11y-display-guide.hazards.hazards-flashing-unknown.descriptive
source: The presence of flashing content is unknown
ta: ஒளிரும் உள்ளடக்கத்தின் இருப்பு தெரியவில்லை

# publ-a11y-display-guide.hazards.hazards-motion.compact
source: Motion simulation
ta: இயக்க உருவகப்படுத்துதல்

# publ-a11y-display-guide.hazards.hazards-motion.descriptive
source: The publication contains motion simulations that can cause motion sickness
ta: இயக்க நோயை ஏற்படுத்தக்கூடிய இயக்க உருவகப்படுத்துதல்களை வெளியீட்டில் கொண்டுள்ளது

# publ-a11y-display-guide.hazards.hazards-motion-none.compact
source: No motion simulation
ta: இயக்க உருவகப்படுத்துதல் இல்லை

# publ-a11y-display-guide.hazards.hazards-motion-none.descriptive
source: The publication contains no motion simulation
ta: வெளியீட்டில் இயக்க உருவகப்படுத்துதல் இல்லை

# publ-a11y-display-guide.hazards.hazards-motion-unknown.compact
source: The presence of motion simulation is unknown
ta: இயக்க உருவகப்படுத்துதலின் இருப்பு தெரியவில்லை

# publ-a11y-display-guide.hazards.hazards-motion-unknown.descriptive
source: The presence of motion simulation is unknown
ta: இயக்க உருவகப்படுத்துதலின் இருப்பு தெரியவில்லை

# publ-a11y-display-guide.hazards.hazards-no-metadata.compact
source: No information is available
ta: எந்த தகவலும் கிடைக்கவில்லை

# publ-a11y-display-guide.hazards.hazards-no-metadata.descriptive
source: No information is available
ta: எந்த தகவலும் கிடைக்கவில்லை

# publ-a11y-display-guide.hazards.hazards-none.compact
source: No hazards
ta: ஆபத்துகள் இல்லை

# publ-a11y-display-guide.hazards.hazards-none.descriptive
source: The publication contains no hazards
ta: வெளியீட்டில் எந்த ஆபத்துகளும் இல்லை

# publ-a11y-display-guide.hazards.hazards-sound.compact
source: Sounds
ta: ஒலிகள்

# publ-a11y-display-guide.hazards.hazards-sound.descriptive
source: The publication contains sounds which can be uncomfortable
ta: வெளியீட்டில் சங்கடமான ஒலிகள் உள்ளன

# publ-a11y-display-guide.hazards.hazards-sound-none.compact
source: No sounds
ta: ஒலி இல்லை

# publ-a11y-display-guide.hazards.hazards-sound-none.descriptive
source: The publication contains no sounds
ta: வெளியீட்டில் எந்த ஒலிகளும் இல்லை

# publ-a11y-display-guide.hazards.hazards-sound-unknown.compact
source: The presence of sounds is unknown
ta: ஒலிகளின் இருப்பு தெரியவில்லை

# publ-a11y-display-guide.hazards.hazards-sound-unknown.descriptive
source: The presence of sounds is unknown
ta: ஒலிகளின் இருப்பு தெரியவில்லை

# publ-a11y-display-guide.hazards.hazards-title
source: Hazards
ta: ஆபத்துகள்

# publ-a11y-display-guide.hazards.hazards-unknown.compact
source: The presence of hazards is unknown
ta: அபாயங்களின் இருப்பு தெரியவில்லை

# publ-a11y-display-guide.hazards.hazards-unknown.descriptive
source: The presents of hazards is unknown
ta: ஆபத்துகளின் பரிசுகள் தெரியவில்லை

# publ-a11y-display-guide.navigation.navigation-index.compact
source: Index
ta: குறியெண்

# publ-a11y-display-guide.navigation.navigation-index.descriptive
source: Index with links to referenced entries
ta: குறிப்பிடப்பட்ட உள்ளீடுகளுக்கான இணைப்புகளுடன் குறியீடு

# publ-a11y-display-guide.navigation.navigation-no-metadata.compact
source: No information is available
ta: எந்த தகவலும் கிடைக்கவில்லை

# publ-a11y-display-guide.navigation.navigation-no-metadata.descriptive
source: No information is available
ta: எந்த தகவலும் கிடைக்கவில்லை

# publ-a11y-display-guide.navigation.navigation-page-navigation.compact
source: Go to page
ta: பக்கத்திற்குச் செல்லுங்கள்

# publ-a11y-display-guide.navigation.navigation-page-navigation.descriptive
source: Page list to go to pages from the print source version
ta: அச்சு மூல பதிப்பிலிருந்து பக்கங்களுக்குச் செல்ல பக்க பட்டியல்

# publ-a11y-display-guide.navigation.navigation-structural.compact
source: Headings
ta: தலைப்புகள்

# publ-a11y-display-guide.navigation.navigation-structural.descriptive
source: Elements such as headings, tables, etc for structured navigation
ta: கட்டமைக்கப்பட்ட வழிசெலுத்தலுக்கான தலைப்புகள், அட்டவணைகள் போன்ற கூறுகள்

# publ-a11y-display-guide.navigation.navigation-title
source: Navigation
ta: வானோடல்

# publ-a11y-display-guide.navigation.navigation-toc.compact
source: Table of contents
ta: உள்ளடக்க அட்டவணை

# publ-a11y-display-guide.navigation.navigation-toc.descriptive
source: Table of contents to all chapters of the text via links
ta: இணைப்புகள் வழியாக உரையின் அனைத்து அத்தியாயங்களுக்கும் உள்ளடக்க அட்டவணை

source: Chemical formulas in LaTeX
ta: லேடெக்சில் வேதியியல் சூத்திரங்கள்

source: Chemical formulas in accessible format (LaTeX)
ta: அணுகக்கூடிய வடிவத்தில் வேதியியல் சூத்திரங்கள் (லேடெக்ச்)

source: Chemical formulas in MathML
ta: கணிதத்தில் வேதியியல் சூத்திரங்கள்

source: Chemical formulas in accessible format (MathML)
ta: அணுகக்கூடிய வடிவத்தில் வேதியியல் சூத்திரங்கள் (MATHML)

source: Math as LaTeX
ta: கணிதம் லேடெக்ச்

source: Math formulas in accessible format (LaTeX)
ta: அணுகக்கூடிய வடிவத்தில் கணித சூத்திரங்கள் (லேடெக்ச்)

source: Math as MathML
ta: கணிதமாக கணிதம்

source: Math formulas in accessible format (MathML)
ta: அணுகக்கூடிய வடிவத்தில் கணித சூத்திரங்கள் (MATHML)

source: Text descriptions of math are provided
ta: கணிதத்தின் உரை விளக்கங்கள் வழங்கப்படுகின்றன

source: Text descriptions of math are provided
ta: கணிதத்தின் உரை விளக்கங்கள் வழங்கப்படுகின்றன

# publ-a11y-display-guide.rich-content.rich-content-closed-captions.compact
source: Videos have closed captions
ta: வீடியோக்களில் மூடிய தலைப்புகள் உள்ளன

# publ-a11y-display-guide.rich-content.rich-content-closed-captions.descriptive
source: Videos included in publications have closed captions
ta: வெளியீடுகளில் சேர்க்கப்பட்ட வீடியோக்கள் மூடிய தலைப்புகளைக் கொண்டுள்ளன

# publ-a11y-display-guide.rich-content.rich-content-extended.compact
source: Information-rich images are described by extended descriptions
ta: செய்தி நிறைந்த படங்கள் நீட்டிக்கப்பட்ட விளக்கங்களால் விவரிக்கப்பட்டுள்ளன

# publ-a11y-display-guide.rich-content.rich-content-extended.descriptive
source: Information-rich images are described by extended descriptions
ta: செய்தி நிறைந்த படங்கள் நீட்டிக்கப்பட்ட விளக்கங்களால் விவரிக்கப்பட்டுள்ளன

# publ-a11y-display-guide.rich-content.rich-content-open-captions.compact
source: Videos have open captions
ta: வீடியோக்களில் திறந்த தலைப்புகள் உள்ளன

# publ-a11y-display-guide.rich-content.rich-content-open-captions.descriptive
source: Videos included in publications have open captions
ta: வெளியீடுகளில் சேர்க்கப்பட்ட வீடியோக்கள் திறந்த தலைப்புகளைக் கொண்டுள்ளன

# publ-a11y-display-guide.rich-content.rich-content-title
source: Rich content
ta: பணக்கார உள்ளடக்கம்

# publ-a11y-display-guide.rich-content.rich-content-transcript.compact
source: Transcript(s) provided
ta: டிரான்ச்கிரிப்ட் (கள்) வழங்கப்பட்டது

# publ-a11y-display-guide.rich-content.rich-content-transcript.descriptive
source: Transcript(s) provided
ta: டிரான்ச்கிரிப்ட் (கள்) வழங்கப்பட்டது

# publ-a11y-display-guide.rich-content.rich-content-unknown.compact
source: No information is available
ta: எந்த தகவலும் கிடைக்கவில்லை

# publ-a11y-display-guide.rich-content.rich-content-unknown.descriptive
source: No information is available
ta: எந்த தகவலும் கிடைக்கவில்லை

source: Has alternative text
ta: மாற்று உரை உள்ளது

source: Has alternative text descriptions for images
ta: படங்களுக்கான மாற்று உரை விளக்கங்கள் உள்ளன

source: No information about nonvisual reading is available
ta: அல்லாத வாசிப்பு பற்றிய எந்த தகவலும் கிடைக்கவில்லை

source: No information about nonvisual reading is available
ta: அல்லாத வாசிப்பு பற்றிய எந்த தகவலும் கிடைக்கவில்லை

source: Not readable in read aloud or dynamic braille
ta: சத்தமாக அல்லது மாறும் பிரெய்லில் படிக்க படிக்க முடியாது

source: The content is not readable as read aloud speech or dynamic braille
ta: உரத்த பேச்சு அல்லது மாறும் பிரெய்ல் வாசிப்பதால் உள்ளடக்கம் படிக்க முடியாது

source: Not fully readable in read aloud or dynamic braille
ta: சத்தமாக அல்லது மாறும் பிரெயிலில் படிக்க முழுமையாக படிக்க முடியாது

source: Not all of the content will be readable as read aloud speech or dynamic braille
ta: உரத்த பேச்சு அல்லது மாறும் பிரெய்லைப் படிக்கும்போது எல்லா உள்ளடக்கங்களும் படிக்க முடியாது

source: Readable in read aloud or dynamic braille
ta: உரக்க அல்லது மாறும் பிரெயிலில் படிக்கக்கூடியது

source: All content can be read as read aloud speech or dynamic braille
ta: எல்லா உள்ளடக்கத்தையும் உரத்த பேச்சு அல்லது மாறும் பிரெய்ல் படிக்கலாம்

source: Prerecorded audio clips
ta: முன்பதிவு செய்யப்பட்ட ஆடியோ கிளிப்புகள்

source: Prerecorded audio clips are embedded in the content
ta: முன்பதிவு செய்யப்பட்ட ஆடியோ கிளிப்புகள் உள்ளடக்கத்தில் உட்பொதிக்கப்பட்டுள்ளன

source: No information about prerecorded audio is available
ta: முன்கூட்டியே பதிவுசெய்யப்பட்ட ஆடியோ பற்றிய தகவல்கள் எதுவும் கிடைக்கவில்லை

source: No information about prerecorded audio is available
ta: முன்கூட்டியே பதிவுசெய்யப்பட்ட ஆடியோ பற்றிய தகவல்கள் எதுவும் கிடைக்கவில்லை

source: Prerecorded audio only
ta: முன்பதிவு செய்யப்பட்ட ஆடியோ மட்டுமே

source: Audiobook with no text alternative
ta: உரை மாற்று இல்லாத ஆடியோபுக்

source: Prerecorded audio synchronized with text
ta: முன்பதிவு செய்யப்பட்ட ஆடியோ உரையுடன் ஒத்திசைக்கப்பட்டது

source: All the content is available as prerecorded audio synchronized with text
ta: அனைத்து உள்ளடக்கங்களும் உரையுடன் ஒத்திசைக்கப்பட்ட ஆடியோவை ஒத்திசைக்கின்றன

# publ-a11y-display-guide.ways-of-reading.ways-of-reading-title
source: Ways of reading
ta: வாசிப்பதற்கான வழிகள்

source: Appearance can be modified
ta: தோற்றத்தை மாற்றியமைக்கலாம்

source: Appearance of the text and page layout can be modified according to the capabilities of the reading system (font family and font size, spaces between paragraphs, sentences, words, and letters, as well as color of background and text)
ta: உரை மற்றும் பக்க தளவமைப்பின் தோற்றத்தை வாசிப்பு அமைப்பின் திறன்களின்படி மாற்றலாம் (எழுத்துரு குடும்பம் மற்றும் எழுத்துரு அளவு, பத்திகள், வாக்கியங்கள், சொற்கள் மற்றும் கடிதங்கள், அத்துடன் பின்னணி மற்றும் உரையின் நிறம்)

source: No information about appearance modifiability is available
ta: தோற்றம் மாற்றியமைத்தல் பற்றிய எந்த தகவலும் கிடைக்கவில்லை

source: No information about appearance modifiability is available
ta: தோற்றம் மாற்றியமைத்தல் பற்றிய எந்த தகவலும் கிடைக்கவில்லை

# publication.accessibility.accessModeSufficient.textual
source: All content can be read as read aloud speech or dynamic braille
ta: எல்லா உள்ளடக்கத்தையும் உரத்த பேச்சு அல்லது மாறும் பிரெய்ல் படிக்கலாம்

# publication.accessibility.accessibilityFeature.alternativeText
source: Has alt text on images
ta: படங்களில் மாற்று உரை உள்ளது

# publication.accessibility.accessibilityFeature.displayTransformability
source: Appearance of the text and page layout can be modified
ta: உரை மற்றும் பக்க தளவமைப்பின் தோற்றத்தை மாற்றலாம்

# publication.accessibility.accessibilityFeature.longDescription
source: Fully described graphical resources
ta: முழுமையாக விவரிக்கப்பட்ட வரைகலை வளங்கள்

# publication.accessibility.accessibilityFeature.printPageNumbers
source: Contains a page list to go to pages from the print source version
ta: அச்சு மூல பதிப்பிலிருந்து பக்கங்களுக்குச் செல்ல ஒரு பக்க பட்டியலைக் கொண்டுள்ளது

# publication.accessibility.accessibilityFeature.readingOrder
source: Contains a reading order
ta: ஒரு வாசிப்பு வரிசையைக் கொண்டுள்ளது

# publication.accessibility.accessibilityFeature.synchronizedAudioText
source: Text & audio synchronised
ta: உரை மற்றும் ஆடியோ ஒத்திசைக்கப்பட்டது

# publication.accessibility.accessibilityFeature.tableOfContents
source: Contains a Table Of Contents
ta: உள்ளடக்க அட்டவணையைக் கொண்டுள்ளது

# publication.accessibility.accessibilityHazard.flashing
source: Flashing
ta: ஒளிரும்

# publication.accessibility.accessibilityHazard.motionSimulation
source: Motion simulation
ta: இயக்க உருவகப்படுத்துதல்

# publication.accessibility.accessibilityHazard.name
source: Hazard:
ta: ஆபத்து:

# publication.accessibility.accessibilityHazard.noFlashing
source: No flashing
ta: ஒளிரும் இல்லை

# publication.accessibility.accessibilityHazard.noMotionSimulation
source: No motion simulation
ta: இயக்க உருவகப்படுத்துதல் இல்லை

# publication.accessibility.accessibilityHazard.noSound
source: No sound
ta: ஒலி இல்லை

# publication.accessibility.accessibilityHazard.none
source: None
ta: எதுவுமில்லை

# publication.accessibility.accessibilityHazard.sound
source: Sound
ta: ஒலி

# publication.accessibility.accessibilityHazard.unknown
source: Unknown
ta: தெரியவில்லை

# publication.accessibility.certifierReport
source: Certifier report:
ta: ஒத்திவைப்பு சான்றளிக்கவும்:

# publication.accessibility.conformsTo
source: Conforms to:
ta: இதற்கு இணங்குகிறது:

# publication.accessibility.moreInformation
source: More information
ta: மேலும் செய்தி

# publication.accessibility.name
source: Accessibility
ta: அணுகல்

# publication.accessibility.noA11y
source: No accessibility information available
ta: அணுகல் தகவல்கள் எதுவும் கிடைக்கவில்லை

# publication.actions
source: Actions
ta: செயல்கள்

# publication.audio.tracks
source: Tracks
ta: தடங்கள்

# publication.author
source: Author
ta: நூலாசிரியர்

# publication.cancelledLcp
source: This publication's LCP license is cancelled.
ta: இந்த வெளியீட்டின் எல்.சி.பி உரிமம் ரத்து செய்யப்பட்டது.

# publication.certificateRevoked
source: Revoked LCP license certificate.
ta: ரத்து செய்யப்பட்ட எல்.சி.பி உரிம சான்றிதழ்.

# publication.certificateSignatureInvalid
source: Invalid LCP license certificate signature.
ta: தவறான எல்.சி.பி உரிம சான்றிதழ் கையொப்பம்.

# publication.cover.img
source: cover image
ta: கவர் படம்

# publication.day
source: day
ta: நாள்

# publication.days
source: days
ta: நாட்கள்

# publication.duration.title
source: Duration
ta: காலம்

# publication.encryptedNoLicense
source: Publication is encrypted but lacks an LCP license!
ta: வெளியீடு குறியாக்கம் செய்யப்பட்டுள்ளது, ஆனால் எல்.சி.பி உரிமம் இல்லை!

# publication.expired
source: Loan expired
ta: கடன் காலாவதியானது

# publication.expiredLcp
source: This publication's LCP license is expired.
ta: இந்த வெளியீட்டின் எல்.சி.பி உரிமம் காலாவதியானது.

# publication.incorrectPassphrase
source: No stored passphrase fits the publication, or the entered passphrase is wrong.
ta: சேமிக்கப்பட்ட பாச்ஃபிரேச் வெளியீட்டிற்கு பொருந்தவில்லை, அல்லது நுழைந்த பாச்ஃபிரேச் தவறானது.

# publication.lcpEnd
source: End
ta: முடிவு

# publication.lcpRightsCopy
source: Copied characters
ta: நகலெடுக்கப்பட்ட எழுத்துக்கள்

# publication.lcpRightsPrint
source: Printed pages
ta: அச்சிடப்பட்ட பக்கங்கள்

# publication.lcpStart
source: Start
ta: தொடங்கு

# publication.licenceLCP
source: License (LCP)
ta: உரிமம் (எல்.சி.பி)

# publication.licenseCertificateDateInvalid
source: Expired LCP provider certificate.
ta: காலாவதியான எல்.சி.பி வழங்குநர் சான்றிதழ்.

# publication.licenseOutOfDate
source: Out of date LCP License.
ta: எல்.சி.பி உரிமத்திற்கு வெளியே.

# publication.licenseSignatureInvalid
source: Invalid LCP license signature.
ta: தவறான எல்.சி.பி உரிம கையொப்பம்.

# publication.licensed
source: Licensed
ta: உரிமம்

# publication.markAsRead
source: Mark as read
ta: படித்தபடி குறி

# publication.notStarted
source: Not Started
ta: தொடங்கப்படவில்லை

# publication.onGoing
source: In Progress
ta: முன்னேற்றத்தில் உள்ளது

# publication.progression.title
source: Progression
ta: முன்னேற்றம்

# publication.read
source: Finished
ta: முடிந்தது

# publication.remainingTime
source: Loan (remaining time)
ta: கடன் (மீதமுள்ள நேரம்)

# publication.renewButton
source: Renew
ta: புதுப்பித்தல்

# publication.returnButton
source: Return
ta: திரும்ப

# publication.returnedLcp
source: This LCP-protected publication is returned.
ta: இந்த எல்.சி.பி-பாதுகாக்கப்பட்ட வெளியீடு திரும்பப் பெறப்படுகிறது.

# publication.revokedLcp
source: This publication's LCP license is revoked.
ta: இந்த வெளியீட்டின் எல்.சி.பி உரிமம் ரத்து செய்யப்படுகிறது.

# publication.seeLess
source: See less
ta: குறைவாகக் காண்க

# publication.seeMore
source: See more
ta: மேலும் காண்க

# publication.timeLeft
source: Remaining time
ta: மீதமுள்ள நேரம்

# publication.title
source: Title
ta: தலைப்பு

# publication.userKeyCheckInvalid
source: Incorrect passphrase.
ta: தவறான கடவுச்சொல்.

# reader.annotations.Color
source: Color
ta: நிறம்

# reader.annotations.addNote
source: Annotate
ta: சிறுகுறிப்பு

# reader.annotations.advancedMode
source: Instant mode (auto create after select)
ta: உடனடி பயன்முறை (தேர்ந்தெடுக்கப்பட்ட பிறகு தானாக உருவாக்கு)

# reader.annotations.annotationsExport.description
source: Name the exported notes:
ta: ஏற்றுமதி செய்யப்பட்ட குறிப்புகளுக்கு பெயரிடுங்கள்:

# reader.annotations.annotationsExport.title
source: Title
ta: தலைப்பு

# reader.annotations.annotationsOptions
source: Annotation Options
ta: சிறுகுறிப்பு விருப்பங்கள்

# reader.annotations.date
source: Modification date
ta: மாற்றும் தேதி

# reader.annotations.export
source: Save notes as...
ta: குறிப்புகளை சேமிக்கவும் ...

# reader.annotations.filter.all
source: All
ta: அனைத்தும்

# reader.annotations.filter.filterByColor
source: Filter by Color
ta: வண்ணத்தால் வடிகட்டவும்

# reader.annotations.filter.filterByCreator
source: Filter by Creator
ta: படைப்பாளரால் வடிகட்டவும்

# reader.annotations.filter.filterByDrawtype
source: Filter by Type
ta: வகை மூலம் வடிகட்டவும்

# reader.annotations.filter.filterByTag
source: Filter by Tag
ta: குறிச்சொல் மூலம் வடிகட்டவும்

# reader.annotations.filter.filterOptions
source: Filter Options
ta: வடிகட்டி விருப்பங்கள்

# reader.annotations.filter.none
source: None
ta: எதுவுமில்லை

# reader.annotations.hide
source: Do not display
ta: காட்ட வேண்டாம்

# reader.annotations.highlight
source: Highlight
ta: சிறப்பம்சமாக

# reader.annotations.noSelectionToast
source: No selection
ta: தேர்வு இல்லை

# reader.annotations.note
source: {{- color}} Note
ta: {{- வண்ணம்}} குறிப்பு

# reader.annotations.quickAnnotations
source: Quick create (skip editor)
ta: விரைவான உருவாக்கு (ச்கிப் எடிட்டரைத் தவிர்)

# reader.annotations.saveNote
source: Save
ta: சேமி

# reader.annotations.sorting.lastcreated
source: Last created
ta: கடைசியாக உருவாக்கப்பட்டது

# reader.annotations.sorting.lastmodified
source: Last modified
ta: கடைசியாக மாற்றப்பட்டது

# reader.annotations.sorting.progression
source: Progression
ta: முன்னேற்றம்

# reader.annotations.sorting.sortingOptions
source: Sorting Options
ta: வரிசையாக்க விருப்பங்கள்

# reader.annotations.toggleMarginMarks
source: Display in margins
ta: விளிம்புகளில் காண்பி

# reader.annotations.type.outline
source: Outline
ta: அவுட்லைன்

# reader.annotations.type.solid
source: Solid background
ta: திட பின்னணி

# reader.annotations.type.strikethrough
source: Strikethrough
ta: ச்ட்ரைகெத்ரோ

# reader.annotations.type.underline
source: Underline
ta: அடிக்கோடிட்டு

# reader.bookmarks.index
source: Bookmark {{- index}}
ta: புக்மார்க்கு {{- குறியீட்டு}}

# reader.divina.mute
source: mute audio
ta: முடக்கு ஆடியோ

# reader.divina.unmute
source: unmute audio
ta: இயக்க ஆடியோ

# reader.fxl.fit
source: Fit
ta: பொருத்தம்

# reader.goToContent
source: Go to the content
ta: உள்ளடக்கத்திற்குச் செல்லுங்கள்

# reader.imgViewer.title
source: Image viewer (zoom)
ta: பட பார்வையாளர் (பெரிதாக்கு)

# reader.imgViewer.zoomIn
source: Zoom In
ta: பெரிதாக்கு

# reader.imgViewer.zoomOut
source: Zoom Out
ta: சிறிதாக்கு

# reader.imgViewer.zoomReset
source: Reset Zoom
ta: பெரிதாக்கு மீட்டமைக்கவும்

# reader.marks.annotations
source: Annotations
ta: சிறுகுறிப்புகள்

# reader.marks.bookmarks
source: Bookmarks
ta: புக்மார்க்குகள்

# reader.marks.delete
source: Delete
ta: நீக்கு

# reader.marks.edit
source: Edit
ta: தொகு

# reader.marks.goTo
source: Go to page
ta: பக்கத்திற்குச் செல்லுங்கள்

# reader.marks.landmarks
source: Landmarks
ta: அடையாளங்கள்

# reader.marks.saveMark
source: Save
ta: சேமி

# reader.marks.search
source: Search
ta: தேடல்

# reader.marks.searchResult
source: Search [{{- searchText}}]
ta: தேடு [{{- SearchText}}]

# reader.marks.toc
source: Table of Contents
ta: உள்ளடக்க அட்டவணை

# reader.media-overlays.activate
source: Activate Readaloud
ta: சத்தமாக படிக்க செயல்படுத்தவும்

# reader.media-overlays.captions
source: Captions / clean view
ta: தலைப்புகள் / தூய்மையான பார்வை

# reader.media-overlays.captionsDescription
source: Simplified text view with minimal captions styling.
ta: குறைந்தபட்ச தலைப்புகள் ச்டைலிங் கொண்ட எளிமைப்படுத்தப்பட்ட உரை காட்சி.

# reader.media-overlays.disableContinuousPlay
source: Disable continuous play
ta: தொடர்ச்சியான விளையாட்டை முடக்கு

# reader.media-overlays.disableContinuousPlayDescription
source: Do not automatically play the next item, pause immediately after the current item has finished playing.
ta: அடுத்த உருப்படியை தானாகவே இயக்க வேண்டாம், தற்போதைய உருப்படி விளையாடுவதை முடித்த உடனேயே இடைநிறுத்தவும்.

# reader.media-overlays.ignoreAndUseTTS
source: Ignore pre-recorded audio, use TTS
ta: முன்பே பதிவுசெய்யப்பட்ட ஆடியோவைப் புறக்கணித்து, TTS ஐப் பயன்படுத்து

# reader.media-overlays.ignoreAndUseTTSDescription
source: Ignore EPUB Media Overlays, read with Text To Speech instead
ta: EPUB மீடியா மேலடுக்குகளைப் புறக்கணித்து, அதற்குப் பதிலாக உரையிலிருந்துபேசு உடன் படி

# reader.media-overlays.next
source: Next Readaloud
ta: அடுத்து சத்தமாக படியுங்கள்

# reader.media-overlays.pause
source: Pause Readaloud
ta: இடைநிறுத்தம் சத்தமாக படிக்க

# reader.media-overlays.play
source: Play Readaloud
ta: சத்தமாக வாசிக்கவும்

# reader.media-overlays.previous
source: Previous Readaloud
ta: முந்தைய சத்தமாக படித்தது

# reader.media-overlays.skip
source: Skippability
ta: ச்கிப்பிபிலிட்டி

# reader.media-overlays.skipDescription
source: Jump over / ignore auxiliary content such as pagebreaks, footnotes/endnotes, etc.
ta: பேச் பிரேக்குகள், அடிக்குறிப்புகள் / இறுதி குறிப்புகள் போன்ற துணை உள்ளடக்கத்தை மேலே செல்லவும் / புறக்கணிக்கவும்.

# reader.media-overlays.speed
source: Readaloud playback rate
ta: Readoloud பின்னணி வீதம்

# reader.media-overlays.stop
source: Stop Readaloud
ta: சத்தமாக வாசிப்பதை நிறுத்துங்கள்

# reader.media-overlays.title
source: Readaloud
ta: READOWLOUD

# reader.navigation.ZenModeExit
source: Exit Zen mode
ta: சென் பயன்முறையில் வெளியேறவும்

# reader.navigation.ZenModeTitle
source: Zen mode
ta: சென் ஃபேசன்
