Repository: 247i/TACETr
Catalog: உரை/தானி/thorium-reader-thorium-reader-translation-*.po
Languages: ta

# accessibility.bookMenu
source: Menu
ta: பட்டியல்

# accessibility.closeDialog
source: Close
ta: மூடு

# accessibility.importFile
source: Import publication
ta: இறக்குமதி வெளியீடு

# accessibility.leftSlideButton
source: Slide to the left
ta: இடதுபுறத்தில் ச்லைடு

# accessibility.mainContent
source: main content
ta: முக்கிய உள்ளடக்கம்

# accessibility.rightSlideButton
source: Slide to the right
ta: வலதுபுறம் சரிய

# accessibility.skipLink
source: Skip to content
ta: உள்ளடக்கத்தைத் தவிர்க்கவும்

# accessibility.toolbar
source: toolbar
ta: கருவிப்பட்டி

# apiapp.documentation
source: Thorium Documentation
ta: தோரியம் ஆவணம்

# apiapp.howItWorks
source: How does it work?
ta: இது எவ்வாறு செயல்படுகிறது?

# apiapp.informations
source: In France, many public libraries provide a machine-readable catalog (similar to OPDS but not identical), letting patrons download digital publications from their personal bookshelf. Integrating this technology in Thorium Reader allows you to download an ebook or audiobook directly into Thorium Reader for instant reading. How do you connect your French public library account to Thorium Reader? It's simple. Enter a French city ('Paris') or part of the library name in the Search field and hit the Search button. A list of public libraries corresponding to your search will appear. Select a library and hit Add. In the updated list of catalogs, select this library: an authentication form is displayed. Enter your username/email address and password, and hit Login. You can now see the content of your personal bookshelf, from which you can download and read the ebooks and audiobooks you previously borrowed.
ta: பிரான்சில், பல பொது நூலகங்கள் இயந்திரத்தால் படிக்கக்கூடிய பட்டியலை வழங்குகின்றன (OPD கள் போன்றவை ஆனால் ஒரே மாதிரியாக இல்லை), புரவலர்கள் தங்கள் தனிப்பட்ட புத்தக அலமாரியில் இருந்து டிசிட்டல் வெளியீடுகளை பதிவிறக்கம் செய்ய அனுமதிக்கின்றன. இந்த தொழில்நுட்பத்தை தோரியம் ரீடரில் ஒருங்கிணைப்பது உடனடி வாசிப்புக்காக ஒரு புத்தக அல்லது ஆடியோபுக்கை நேரடியாக தோரியம் ரீடரில் பதிவிறக்கம் செய்ய உங்களை அனுமதிக்கிறது. உங்கள் பிரஞ்சு பொது நூலகக் கணக்கை தோரியம் ரீடருடன் எவ்வாறு இணைப்பது? இது எளிது. தேடல் புலத்தில் ஒரு பிரஞ்சு நகரம் ('பாரிச்') அல்லது நூலக பெயரின் ஒரு பகுதியை உள்ளிட்டு தேடல் பொத்தானை அழுத்தவும். உங்கள் தேடலுடன் தொடர்புடைய பொது நூலகங்களின் பட்டியல் தோன்றும். ஒரு நூலகத்தைத் தேர்ந்தெடுத்து சேர் அழுத்தவும். பட்டியல்களின் புதுப்பிக்கப்பட்ட பட்டியலில், இந்த நூலகத்தைத் தேர்ந்தெடுக்கவும்: அங்கீகார படிவம் காட்டப்படும். உங்கள் பயனர்பெயர்/மின்னஞ்சல் முகவரி மற்றும் கடவுச்சொல்லை உள்ளிட்டு, உள்நுழைவை அழுத்தவும். உங்கள் தனிப்பட்ட புத்தக அலமாரியின் உள்ளடக்கத்தை இப்போது நீங்கள் காணலாம், அதில் இருந்து நீங்கள் முன்பு கடன் வாங்கிய மின்புத்தகங்கள் மற்றும் ஆடியோபுக்குகளை பதிவிறக்கம் செய்து படிக்கலாம்.

# apiapp.noLibraryFound
source: No library found ({{- name}})
ta: எந்த நூலகமும் கிடைக்கவில்லை ({{- பெயர்}})

# app.edit.copy
source: Copy
ta: நகலெடு

# app.edit.cut
source: Cut
ta: வெட்டு

# app.edit.paste
source: Paste
ta: ஒட்டு

# app.edit.print
source: Print
ta: அச்சிடுக

# app.edit.redo
source: Redo
ta: மீண்டும்செய்

# app.edit.selectAll
source: Select all
ta: அனைத்தையும் தெரிவுசெய்

# app.edit.title
source: Edit
ta: தொகு

# app.edit.undo
source: Undo
ta: செயல்தவிர்

# app.hide
source: Hide {{- appName}}
ta: {{- appName}} ஐ மறைக்கவும்

# app.quit
source: Quit {{- appName}}
ta: {{- appname}}

# app.session.exit.askBox.button.no
source: No
ta: இல்லை

# app.session.exit.askBox.button.yes
source: Yes
ta: ஆம்

# app.session.exit.askBox.help
source: Activate this if you want reader windows that are open when you close the application to automatically re-open at next launch.
ta: அடுத்த துவக்கத்தில் தானாகவே மீண்டும் திறக்க பயன்பாட்டை மூடும்போது திறந்திருக்கும் வாசகர் சாளரங்களை நீங்கள் விரும்பினால் இதைச் செயல்படுத்தவும்.

# app.session.exit.askBox.message
source: Saving and restoring the reading session
ta: வாசிப்பு அமர்வை சேமித்தல் மற்றும் மீட்டமைத்தல்

# app.session.exit.askBox.title
source: Save session?
ta: அமர்வை சேமிக்கவா?

# app.update.message
source: New version available, click to learn more.
ta: புதிய பதிப்பு கிடைக்கிறது, மேலும் அறிய சொடுக்கு செய்க.

# app.update.title
source: {{- appName}} software update.
ta: {{- AppName}} மென்பொருள் புதுப்பிப்பு.

# app.window.showLibrary
source: Show library / bookshelf
ta: நூலகம் / புத்தக அலமாரி காட்டு

# catalog.about.title
source: About {{- appName}} (online)
ta: பற்றி {{- appName}} (ஆன்லைன்)

# catalog.addBookToLib
source: Import
ta: இறக்குமதி

# catalog.addTags
source: Add tag
ta: குறிச்சொல்லைச் சேர்க்கவும்

# catalog.addTagsButton
source: Add
ta: கூட்டு

# catalog.allBooks
source: All publications
ta: அனைத்து வெளியீடுகளும்

# catalog.bookInfo
source: About publication
ta: வெளியீடு பற்றி

# catalog.column.ascending
source: ascending
ta: ஏறுதல்

# catalog.column.descending
source: descending
ta: இறங்கு

# catalog.column.unsorted
source: unsorted
ta: வரிசைப்படுத்தப்படாதது

# catalog.delete
source: Delete
ta: நீக்கு

# catalog.deleteBook
source: Delete
ta: நீக்கு

# catalog.deleteTag
source: Delete tag
ta: குறிச்சொல்லை நீக்கு

# catalog.description
source: Description
ta: விவரம்

# catalog.emptyTagList
source: No tagged publications.
ta: குறிக்கப்பட்ட வெளியீடுகள் இல்லை.

# catalog.entry.continueReading
source: Resume reading
ta: மீண்டும் வாசிப்பு

# catalog.entry.lastAdditions
source: Recently added
ta: அண்மைக் காலத்தில் சேர்க்கப்பட்டது

# catalog.export
source: Save as
ta: என சேமி

# catalog.exportAnnotation
source: Export notes
ta: ஏற்றுமதி குறிப்புகள்

# catalog.format
source: Format
ta: வடிவம்

# catalog.importAnnotation
source: Import notes
ta: குறிப்புகளை இறக்குமதி செய்யுங்கள்

# catalog.lang
source: Language
ta: மொழி

# catalog.lastRead
source: Last Read
ta: கடைசியாக படியுங்கள்

# catalog.moreInfo
source: Publication Details
ta: வெளியீட்டு விவரங்கள்

# catalog.myBooks
source: My publications
ta: எனது வெளியீடுகள்

# catalog.noPublicationHelpL1
source: Drop files here
ta: கோப்புகளை இங்கே விடுங்கள்

# catalog.noPublicationHelpL2
source: or use the "{{- importTitle }}" button above.
ta: அல்லது மேலே உள்ள "{{- இறக்குமதி}}" பொத்தானைப் பயன்படுத்தவும்.

# catalog.noPublicationHelpL3
source: LCP-protected publications are supported.
ta: எல்.சி.பி பாதுகாக்கப்பட்ட வெளியீடுகள் ஆதரிக்கப்படுகின்றன.

# catalog.noPublicationHelpL4
source: Supported extensions:
ta: உதவி நீட்டிப்புகள்:

# catalog.numberOfPages
source: Number of pages
ta: பக்கங்களின் எண்ணிக்கை

# catalog.opds.auth.cancel
source: Cancel
ta: ரத்துசெய்

# catalog.opds.auth.login
source: Login
ta: புகுபதிவு

# catalog.opds.auth.password
source: Password
ta: கடவுச்சொல்

# catalog.opds.auth.register
source: Register
ta: பதிவு செய்யுங்கள்

# catalog.opds.auth.username
source: Username / Email Address
ta: பயனர்பெயர் / மின்னஞ்சல் முகவரி

# catalog.opds.info.availableSince
source: Since
ta: முதல்

# catalog.opds.info.availableState.available
source: Available
ta: கிடைக்கிறது

# catalog.opds.info.availableState.ready
source: Ready
ta: ஆயத்தம்

# catalog.opds.info.availableState.reserved
source: Reserved
ta: ஒதுக்கப்பட்டுள்ளது

# catalog.opds.info.availableState.unavailable
source: Unavailable
ta: கிடைக்கவில்லை

# catalog.opds.info.availableState.unknown
source: Unknown
ta: தெரியவில்லை

# catalog.opds.info.availableUntil
source: Until
ta: வரை

# catalog.opds.info.copyAvalaible
source: Available
ta: கிடைக்கிறது

# catalog.opds.info.copyTotal
source: Copies
ta: நகல்கள்

# catalog.opds.info.holdPosition
source: Hold position
ta: நிலை பிடி

# catalog.opds.info.holdTotal
source: Held
ta: நடைபெற்றது

# catalog.opds.info.numberOfItems
source: Number of items
ta: பொருட்களின் எண்ணிக்கை

# catalog.opds.info.priveValue
source: Price
ta: விலை

# catalog.opds.info.state
source: State
ta: மாநிலம்

# catalog.publisher
source: Publisher
ta: வெளியீட்டாளர்

# catalog.readBook
source: Read
ta: படிக்க

# catalog.released
source: Published on
ta: வெளியிடப்பட்டது

# catalog.sort
source: Sort by
ta: வரிசைப்படுத்தவும்

# catalog.tag
source: Tag
ta: குறிச்சொல்

# catalog.tags
source: Tags
ta: குறிச்சொற்கள்

# catalog.update
source: Edit
ta: தொகு

# dialog.annotations.descAuthor
source: by '{{- author}}'
ta: வழங்கியவர் '{{- ஆசிரியர்}}'

# dialog.annotations.descCreator
source: created by
ta: உருவாக்கியது

# dialog.annotations.descList
source: {{- nb}} note(s) {{- creator}} will be imported into '{{- title}}' {{- author}}
ta: {{- nb}} குறிப்பு(கள்) {{- creator}} இல் இறக்குமதி செய்யப்படும் '{{- title}}' {{- author}}

# dialog.annotations.descNewer
source: Conflict(s): {{- nb}} newer note(s)
ta: மோதல் (மற்றும்}} புதிய குறிப்புகள்)

# dialog.annotations.descOlder
source: Conflict(s): {{- nb}} older note(s)
ta: மோதல் (}} பழைய குறிப்புகளில்)

# dialog.annotations.descTitle
source: Annotations title:
ta: சிறுகுறிப்பு தலைப்பு:

# dialog.annotations.importAll
source: Import all notes
ta: எல்லா குறிப்புகளையும் இறக்குமதி செய்யுங்கள்

# dialog.annotations.importWithoutConflict
source: Import only conflict-free notes
ta: மோதல் இல்லாத குறிப்புகளை மட்டுமே இறக்குமதி செய்க

# dialog.annotations.origin
source: Origin publication: '{{- title}}' {{- author}}
ta: தோற்றம் வெளியீடு: '{{- தலைப்பு}}' {{- ஆசிரியர்}}

# dialog.annotations.title
source: Import notes?
ta: குறிப்புகள் இறக்குமதி?

# dialog.cancel
source: Cancel
ta: ரத்துசெய்

# dialog.deleteAnnotations
source: Delete annotations?
ta: சிறுகுறிப்புகளை நீக்கவா?

# dialog.deleteAnnotationsText
source: Are you sure you want to delete {{- annotationListLength}} note(s)?
ta: நீங்கள் நிச்சயமாக {{- சிறுகுறிப்பு செட்ட்லெங்}} குறிப்புகளை நீக்க விரும்புகிறீர்களா?

# dialog.deleteBookmarks
source: Delete bookmarks?
ta: புக்மார்க்குகளை நீக்கவா?

# dialog.deleteBookmarksText
source: Are you sure you want to delete {{- bookmarkListLength}} bookmark(s)?
ta: {{- புக்மார்க்குகள் பட்டியல் நீளம்}} புக்மார்க்குகளை நீக்க விரும்புகிறீர்களா?

# dialog.deleteFeed
source: Delete catalog?
ta: பட்டியலை நீக்கவா?

# dialog.deletePublication
source: Delete publication?
ta: வெளியீட்டை நீக்கவா?

# dialog.import
source: Confirm import:
ta: இறக்குமதியை உறுதிப்படுத்தவும்:

# dialog.importError
source: An error occurred, verify the file extension ({{acceptedExtension}})
ta: பிழை ஏற்பட்டது, கோப்பு நீட்டிப்பை சரிபார்க்கவும் ({{acceptedExtension}})

# dialog.renew
source: Renew/extend loan?
ta: கடனைப் புதுப்பிக்க/நீட்டிக்கவா?

# dialog.return
source: Return publication?
ta: வெளியீட்டைத் திரும்ப?

# dialog.yes
source: Yes
ta: ஆம்

# error.errorBox.error
source: Error message:
ta: பிழை செய்தி:

# error.errorBox.message
source: Error in {{- filename}}
ta: {{- கோப்பு பெயர்}} இல் பிழை

# error.errorBox.title
source: Internal {{- appName}} Error
ta: உள் {{- appName}}} பிழை

# header.allBooks
source: All publications
ta: அனைத்து வெளியீடுகளும்

# header.catalogs
source: Catalogs
ta: பட்டியல்கள்

# header.downloads
source: Downloads
ta: பதிவிறக்கங்கள்

# header.fitlerTagTitle
source: Filter by tag
ta: குறிச்சொல் மூலம் வடிகட்டவும்

# header.gridTitle
source: Grid
ta: வலைவாய்

# header.home
source: Bookshelf menu
ta: புத்தக அலமாரி பட்டியல்

# header.homeTitle
source: Home
ta: வீடு

# header.importTitle
source: Import publication
ta: இறக்குமதி வெளியீடு

# header.listTitle
source: Table
ta: அட்டவணை

# header.myCatalogs
source: My catalogs
ta: எனது பட்டியல்கள்

# header.refreshTitle
source: reload
ta: ஏற்றவும்

# header.searchPlaceholder
source: Search
ta: தேடல்

# header.searchTitle
source: Search
ta: தேடல்

# header.settings
source: Settings
ta: அமைப்புகள்

# header.viewMode
source: View mode
ta: பார்வை பயன்முறையை

# library.lcp.hint
source: Hint:
ta: குறிப்பு:

# library.lcp.open
source: Open
ta: திற

# library.lcp.password
source: Passphrase
ta: கடவுச்சொல்

# library.lcp.sentence
source: This publication needs an LCP passphrase to be opened
ta: இந்த வெளியீட்டிற்கு எல்.சி.பி பாச்ஃபிரேச் திறக்கப்பட வேண்டும்

# library.lcp.urlHint
source: Forgot your passphrase? Click here to get support.
ta: உங்கள் கடவுச்சொல் மறந்துவிட்டீர்களா? ஆதரவைப் பெற இங்கே சொடுக்கு செய்க.

# library.lcp.whatIsLcp?
source: What is LCP?
ta: எல்.சி.பி என்றால் என்ன?

# library.lcp.whatIsLcpInfoDetails
source: LCP stands for 'Licensed Content Protection'.
ta: எல்.சி.பி என்பது 'உரிமம் பெற்ற உள்ளடக்க பாதுகாப்பு' என்பதைக் குறிக்கிறது.

# library.lcp.whatIsLcpInfoDetailsLink
source: To learn more, click this link to the EDRLab website.
ta: மேலும் அறிய, எட்ர்லாப் வலைத்தளத்திற்கான இந்த இணைப்பைக் சொடுக்கு செய்க.

# message.annotations.alreadyImported
source: All notes are already imported.
ta: எல்லா குறிப்புகளும் ஏற்கனவே இறக்குமதி செய்யப்பட்டுள்ளன.

# message.annotations.emptyFile
source: No notes available in the file.
ta: கோப்பில் குறிப்புகள் எதுவும் கிடைக்கவில்லை.

# message.annotations.errorParsing
source: Error during file parsing:
ta: கோப்பு பாகுபடுத்தலின் போது பிழை:

# message.annotations.noBelongTo
source: Unable to import notes, at least one note does not belong to the publication.
ta: குறிப்புகளை இறக்குமதி செய்ய முடியவில்லை, குறைந்தது ஒரு குறிப்பையாவது வெளியீட்டிற்கு சொந்தமானது அல்ல.

# message.annotations.nothing
source: There is no note ready to be imported, aborting the import
ta: இறக்குமதியை நிறுத்தி, இறக்குமதி செய்ய எந்த குறிப்பும் தயாராக இல்லை

# message.annotations.success
source: Import completed successfully.
ta: இறக்குமதி வெற்றிகரமாக முடிந்தது.

# message.download.error
source: Downloading [{{- title}}] failed: [{{- err}}]
ta: பதிவிறக்கம் [{{- தலைப்பு}}] தோல்வியுற்றது: [{{- பிழை}}]

# message.import.alreadyImport
source: [{{- title}}] was already imported.
ta: [{{- தலைப்பு}}] ஏற்கனவே இறக்குமதி செய்யப்பட்டது.

# message.import.fail
source: Importing [{{- path}}] failed: [{{- err}}]
ta: இறக்குமதி [{{- பாதை}}] தோல்வியுற்றது: [{{- பிழை}}]

# message.import.success
source: Importing [{{- title}}] completed.
ta: இறக்குமதி [{{- தலைப்பு}}] நிறைவு செய்யப்பட்டது.

# message.open.error
source: Loading publication failed: [{{- err}}]
ta: வெளியீட்டை ஏற்றுவது தோல்வியுற்றது: [{{- பிழை}}]

# opds.addForm.addButton
source: Add
ta: கூட்டு

# opds.addForm.name
source: Name:
ta: பெயர்:

# opds.addForm.namePlaceholder
source: Name
ta: பெயர்

# opds.addForm.url
source: Link:
ta: இணைப்பு:

# opds.addForm.urlPlaceholder
source: Link
ta: இணைப்பு

# opds.addFormApiapp.title
source: Add library account
ta: நூலகக் கணக்கைச் சேர்க்கவும்

# opds.addMenu
source: Add OPDS feed
ta: OPDS ஊட்டத்தைச் சேர்க்கவும்

# opds.breadcrumbRoot
source: Catalogs
ta: பட்டியல்கள்

# opds.documentation
source: OPDS official website
ta: OPDS அதிகாரப்பூர்வ வலைத்தளம்

# opds.empty
source: No publication found
ta: வெளியீடு எதுவும் கிடைக்கவில்லை

# opds.firstPage
source: First
ta: முதல்

# opds.informations
source: Imagine a world where you can explore and download digital publications from public libraries and digital booksellers with just a few clicks. That's exactly what the Open Publication Distribution System (OPDS) catalog format offers. With OPDS, you can navigate through catalogs from various ebook providers, sign up, borrow, buy a publication, or visit your personal bookshelf. You can even download an ebook or audiobook directly into Thorium Reader for instant reading. So, how do you find an OPDS catalog? It's simple. Look for a hyperlink (URL) leading to the catalog. Copy this URL into the Link field above. Keep in mind that there's no one-stop shop for all active OPDS catalogs. You'll need to contact your preferred library or bookseller and ask for their OPDS catalog URL. If you're not sure where to start, Wikipedia has a few registries of OPDS catalogs in various languages that might be helpful. The Name field is left at your convenience; it provides an easy way to identify the feed in Thorium Reader.
ta: ஒரு சில கிளிக்குகளில் பொது நூலகங்கள் மற்றும் டிசிட்டல் புத்தக விற்பனையாளர்களிடமிருந்து டிசிட்டல் வெளியீடுகளை ஆராய்ந்து பதிவிறக்கக்கூடிய ஒரு உலகத்தை கற்பனை செய்து பாருங்கள். திறந்த வெளியீட்டு விநியோக அமைப்பு (OPDS) பட்டியல் வடிவம் வழங்குகிறது. OPDS உடன், நீங்கள் பல்வேறு மின்புத்தக வழங்குநர்களிடமிருந்து பட்டியல்கள் மூலம் செல்லலாம், பதிவுபெறலாம், கடன் வாங்கலாம், வெளியீட்டை வாங்கலாம் அல்லது உங்கள் தனிப்பட்ட புத்தக அலமாரியைப் பார்வையிடலாம். உடனடி வாசிப்புக்காக நீங்கள் ஒரு புத்தக அல்லது ஆடியோபுக்கை நேரடியாக தோரியம் ரீடரில் பதிவிறக்கம் செய்யலாம். எனவே, OPDS பட்டியலை எவ்வாறு கண்டுபிடிப்பது? இது எளிது. பட்டியலுக்கு வழிவகுக்கும் ஒரு ஐப்பர்லிங்க் (URL) ஐத் தேடுங்கள். இந்த முகவரி ஐ மேலே உள்ள இணைப்பு புலத்தில் நகலெடுக்கவும். அனைத்து செயலில் உள்ள OPDS பட்டியல்களுக்கும் ஒரு நிறுத்த கடை இல்லை என்பதை நினைவில் கொள்ளுங்கள். நீங்கள் விரும்பும் நூலகம் அல்லது புத்தக விற்பனையாளரைத் தொடர்புகொண்டு அவர்களின் OPDS பட்டியல் முகவரி ஐக் கேட்க வேண்டும். எங்கிருந்து தொடங்குவது என்று உங்களுக்குத் தெரியாவிட்டால், விக்கிபீடியாவில் பல்வேறு மொழிகளில் OPDS பட்டியல்களின் சில பதிவுகள் உள்ளன, அவை உதவியாக இருக்கும். உங்கள் வசதிக்காக பெயர் புலம் விடப்பட்டுள்ளது; தோரியம் ரீடரில் ஊட்டத்தை அடையாளம் காண இது ஒரு எளிதான வழியை வழங்குகிறது.

# opds.lastPage
source: Last
ta: கடைசி

# opds.menu.aboutBook
source: About publication
ta: வெளியீடு பற்றி

# opds.menu.addExtract
source: Import extract
ta: இறக்குமதி சாறு

# opds.menu.goBuyBook
source: Buy publication
ta: வெளியீடு வாங்கவும்

# opds.menu.goLoanBook
source: Borrow publication
ta: கடன் வெளியீடு

# opds.menu.goRevokeLoanBook
source: Revoke loan
ta: கடனைத் திரும்பப் பெறுங்கள்

# opds.menu.goSubBook
source: Subscribe
ta: குழுசேர்

# opds.network.error
source: Error accessing feed
ta: ஊட்டத்தை அணுகுவதில் பிழை

# opds.network.noInternet
source: No internet
ta: இணையம் இல்லை

# opds.network.noInternetMessage
source: Try checking the network cable, modem, router or wifi
ta: பிணையம் கேபிள், மோடம், திசைவி அல்லது வைஃபை சரிபார்க்க முயற்சிக்கவும்

# opds.network.reject
source: Sorry, unexpected error!
ta: மன்னிக்கவும், எதிர்பாராத பிழை!

# opds.network.timeout
source: Network timeout, please try again later
ta: பிணையம் நேரம் முடிந்தது, தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும்

# opds.next
source: Next
ta: அடுத்தது

# opds.previous
source: Previous
ta: முந்தைய

# opds.shelf
source: Shelf
ta: அலமாரி

# opds.updateForm.name
source: Name:
ta: பெயர்:

# opds.updateForm.title
source: Edit OPDS feed
ta: OPDS ஊட்டத்தைத் திருத்து

# opds.updateForm.updateButton
source: Edit
ta: தொகு

# opds.updateForm.url
source: Link:
ta: இணைப்பு:

# opds.whatIsOpds
source: What Is OPDS?
ta: OPDS என்றால் என்ன?

# publ-a11y-display-guide.accessibility-summary.accessibility-summary-title
source: Accessibility summary
ta: அணுகல் சுருக்கம்

source: ARIA roles included
ta: ஏரியா பாத்திரங்கள் சேர்க்கப்பட்டுள்ளன

source: Content is enhanced with ARIA roles to optimize organization and facilitate navigation
ta: அமைப்பை மேம்படுத்துவதற்கும் வழிசெலுத்தலை எளிதாக்குவதற்கும் ஏரியா பாத்திரங்களுடன் உள்ளடக்கம் மேம்படுத்தப்பட்டுள்ளது

source: Audio descriptions
ta: ஆடியோ விளக்கங்கள்

source: Audio descriptions
ta: ஆடியோ விளக்கங்கள்

source: Braille
ta: பிரெய்ல்

source: Braille
ta: பிரெய்ல்

source: Full ruby annotations
ta: முழு ரூபி சிறுகுறிப்புகள்

source: Full ruby annotations
ta: முழு ரூபி சிறுகுறிப்புகள்

source: High contrast between foreground and background audio
ta: முன்புறம் மற்றும் பின்னணி ஆடியோவுக்கு இடையில் அதிக வேறுபாடு

source: High contrast between foreground and background audio
ta: முன்புறம் மற்றும் பின்னணி ஆடியோவுக்கு இடையில் அதிக வேறுபாடு

source: High contrast between foreground text and background
ta: முன்புற உரை மற்றும் பின்னணிக்கு இடையில் அதிக வேறுபாடு

source: High contrast between foreground text and background
ta: முன்புற உரை மற்றும் பின்னணிக்கு இடையில் அதிக வேறுபாடு

source: Large print
ta: பெரிய அச்சு

source: Large print
ta: பெரிய அச்சு

source: Page breaks included
ta: பக்க இடைவெளிகள் சேர்க்கப்பட்டுள்ளன

source: Page breaks included from the original print source
ta: அசல் அச்சு மூலத்திலிருந்து பக்க இடைவெளிகள் சேர்க்கப்பட்டுள்ளன

source: Some Ruby annotations
ta: சில ரூபி சிறுகுறிப்புகள்

source: Some Ruby annotations
ta: சில ரூபி சிறுகுறிப்புகள்

source: Sign language
ta: சைகை மொழி

source: Sign language
ta: சைகை மொழி

source: Tactile graphics included
ta: தொட்டுணரக்கூடிய கிராபிக்ச் சேர்க்கப்பட்டுள்ளது

source: Tactile graphics have been integrated to facilitate access to visual elements for blind people
ta: பார்வையற்றவர்களுக்கு காட்சி கூறுகளை அணுகுவதற்கு தொட்டுணரக்கூடிய கிராபிக்ச் ஒருங்கிணைக்கப்பட்டுள்ளன

source: Tactile 3D objects
ta: தொட்டுணரக்கூடிய 3D பொருள்கள்

source: Tactile 3D objects
ta: தொட்டுணரக்கூடிய 3D பொருள்கள்

source: Text-to-speech hinting provided
ta: உரை-க்கு-பேச்சு குறிப்பு வழங்கப்பட்டது

source: Text-to-speech hinting provided
ta: உரை-க்கு-பேச்சு குறிப்பு வழங்கப்பட்டது

source: Additional accessibility information
ta: கூடுதல் அணுகல் செய்தி

# publ-a11y-display-guide.conformance.conformance-a.compact
source: This publication meets minimum accessibility standards
ta: இந்த வெளியீடு குறைந்தபட்ச அணுகல் தரங்களை நிறைவு செய்கிறது

# publ-a11y-display-guide.conformance.conformance-a.descriptive
source: The publication contains a conformance statement that it meets the EPUB Accessibility and WCAG 2 Level A standard
ta: வெளியீட்டில் எபப் அணுகல் மற்றும் WCAG 2 நிலை ஒரு தரத்தை நிறைவு செய்கிறது என்ற இணக்க அறிக்கை உள்ளது

# publ-a11y-display-guide.conformance.conformance-aa.compact
source: This publication meets accepted accessibility standards
ta: இந்த வெளியீடு ஏற்றுக்கொள்ளப்பட்ட அணுகல் தரங்களை நிறைவு செய்கிறது

# publ-a11y-display-guide.conformance.conformance-aa.descriptive
source: The publication contains a conformance statement that it meets the EPUB Accessibility and WCAG 2 Level AA standard
ta: வெளியீட்டில் EPUB அணுகல் மற்றும் WCAG 2 நிலை AA தரத்தை நிறைவு செய்கிறது என்ற இணக்க அறிக்கை உள்ளது

# publ-a11y-display-guide.conformance.conformance-aaa.compact
source: This publication exceeds accepted accessibility standards
ta: இந்த வெளியீடு ஏற்றுக்கொள்ளப்பட்ட அணுகல் தரங்களை மீறுகிறது

# publ-a11y-display-guide.conformance.conformance-aaa.descriptive
source: The publication contains a conformance statement that it meets the EPUB Accessibility and WCAG 2 Level AAA standard
ta: வெளியீட்டில் EPUB அணுகல் மற்றும் WCAG 2 நிலை AAA தரத்தை நிறைவு செய்கிறது என்ற இணக்க அறிக்கை உள்ளது

# publ-a11y-display-guide.conformance.conformance-certifier.compact
source: The publication was certified by
ta: வெளியீடு சான்றிதழ் பெற்றது

# publ-a11y-display-guide.conformance.conformance-certifier-credentials.compact
source: The certifier's credential is
ta: சான்றிதழின் நற்சான்றிதழ்

# publ-a11y-display-guide.conformance.conformance-details-certifier-report.compact
source: For more information refer to the certifier's report
ta: மேலும் தகவலுக்கு சான்றிதழின் அறிக்கையைப் பார்க்கவும்

# publ-a11y-display-guide.conformance.conformance-details-claim.compact
source: This publication claims to meet
ta: இந்த வெளியீடு சந்திப்பதாகக் கூறுகிறது

# publ-a11y-display-guide.conformance.conformance-details-claim.descriptive
source: This publication claims to meet
ta: இந்த வெளியீடு சந்திப்பதாகக் கூறுகிறது

source: EPUB Accessibility 1.0
ta: எபப் அணுகல் 1.0

source: EPUB Accessibility 1.0
ta: எபப் அணுகல் 1.0

source: EPUB Accessibility 1.1
ta: எபப் அணுகல் 1.1

source: EPUB Accessibility 1.1
ta: எபப் அணுகல் 1.1

# publ-a11y-display-guide.conformance.conformance-details-level-a.compact
source: Level A
ta: நிலை a

# publ-a11y-display-guide.conformance.conformance-details-level-a.descriptive
source: Level A
ta: நிலை a

# publ-a11y-display-guide.conformance.conformance-details-level-aa.compact
source: Level AA
ta: நிலை AA

# publ-a11y-display-guide.conformance.conformance-details-level-aa.descriptive
source: Level AA
ta: நிலை AA

# publ-a11y-display-guide.conformance.conformance-details-level-aaa.compact
source: Level AAA
ta: நிலை AAA

# publ-a11y-display-guide.conformance.conformance-details-level-aaa.descriptive
source: Level AAA
ta: நிலை AAA

# publ-a11y-display-guide.conformance.conformance-details-wcag-2-1.descriptive
source: Web Content Accessibility Guidelines (WCAG) 2.1
ta: வலை உள்ளடக்க அணுகல் வழிகாட்டுதல்கள் (WCAG) 2.1
