Repository: 247i/TACETr
Catalog: உரை/தானி/thorium-reader-thorium-reader-translation-*.po
Languages: ta

# reader.navigation.annotationTitle
source: annotation
ta: சிறுகுறி

# reader.navigation.backHomeTitle
source: Close this reading window (back to bookshelf)
ta: இந்த வாசிப்பு சாளரத்தை மூடு (புத்தக அலமாரிக்கு திரும்பவும்)

# reader.navigation.bookmarkTitle
source: bookmark
ta: புத்தககுறி

# reader.navigation.currentPage
source: Current page: {{- current}}
ta: தற்போதைய பக்கம்: {{- தற்போதைய}}

# reader.navigation.currentPageTotal
source: Current page: {{- current}}/{{- total}}
ta: தற்போதைய பக்கம்: {{- தற்போதைய}}/{{- மொத்தம்}}

# reader.navigation.detachWindowTitle
source: show library / bookshelf window
ta: நூலகம் / புத்தக அலமாரி சாளரத்தைக் காட்டு

# reader.navigation.goTo
source: Go to
ta: செல்

# reader.navigation.goToError
source: Page break does not exist
ta: பக்க இடைவெளி இல்லை

# reader.navigation.goToPlaceHolder
source: Enter page number
ta: பக்க எண்ணை உள்ளிடவும்

# reader.navigation.goToTitle
source: Go to page
ta: பக்கத்திற்குச் செல்லுங்கள்

# reader.navigation.historyNext
source: Jump forward
ta: முன்னோக்கி செல்லவும்

# reader.navigation.historyPrevious
source: Jump back
ta: பின்னால் செல்லவும்

# reader.navigation.infoTitle
source: information
ta: தகவல்

# reader.navigation.magnifyingGlassButton
source: search publication
ta: தேடல் வெளியீடு

# reader.navigation.openTableOfContentsTitle
source: navigation
ta: வானோடல்

# reader.navigation.page
source: Page
ta: பக்கம்

# reader.navigation.pdfscalemode
source: Page fit or width
ta: பக்க பொருத்தம் அல்லது அகலம்

# reader.navigation.print
source: print
ta: அச்சிடுக

# reader.navigation.settingsTitle
source: settings
ta: அமைப்புகள்

# reader.notes.colors.cyan
source: Cyan
ta: சியான்

# reader.notes.colors.green
source: Green
ta: பச்சை

# reader.notes.colors.orange
source: Orange
ta: ஆரஞ்சு

# reader.notes.colors.purple
source: Purple
ta: ஊதா

# reader.notes.colors.red
source: Red
ta: சிவப்பு

# reader.notes.colors.yellow
source: Yellow
ta: மஞ்சள்

# reader.picker.search.founds
source: {{- nResults}} match(es)
ta: {{- tnresults}} பொருந்துகிறது)

# reader.picker.search.input
source: text to match
ta: பொருத்த உரை

# reader.picker.search.next
source: Next
ta: அடுத்தது

# reader.picker.search.notFound
source: no matches
ta: போட்டிகள் இல்லை

# reader.picker.search.previous
source: Previous
ta: முந்தைய

# reader.picker.search.results
source: Results
ta: முடிவுகள்

# reader.picker.search.submit
source: Find
ta: கண்டுபிடி

# reader.picker.searchTitle
source: Search:
ta: தேடல்:

# reader.print.description
source: {{- appName}} pre-print step: please select the pages you want to send to the system print dialog (this publication has {{- count}} pages)
ta: {{- appName}} முன்-அச்சு படி: கணினி அச்சு உரையாடலுக்கு நீங்கள் அனுப்ப விரும்பும் பக்கங்களைத் தேர்ந்தெடுக்கவும் (இந்த வெளியீட்டில் {{- எண்ணிக்கை}} பக்கங்கள் உள்ளன)

# reader.print.descriptionLcp
source: {{- appName}} pre-print step: please select the pages you want to send to the system print dialog (this LCP-protected publication has {{- count}} pages)
ta: {{- appName}} முன்-அச்சு படி: கணினி அச்சு உரையாடலுக்கு நீங்கள் அனுப்ப விரும்பும் பக்கங்களைத் தேர்ந்தெடுக்கவும் (இந்த LCP- பாதுகாக்கப்பட்ட வெளியீட்டில் {{- எண்ணிக்கை}} பக்கங்கள் உள்ளன)

# reader.print.descriptionLcpLimit
source: LCP limit: {{- lcpLimitPages}}, pages remaining: {{- count}}
ta: LCP வரம்பு: {{- lcplimitpages}}, மீதமுள்ள பக்கங்கள்: {{- எண்ணிக்கை}}}

# reader.print.pageHelpInfo
source: Page selector syntax:
ta: பக்க தேர்வாளர் தொடரியல்:

# reader.print.pageHelpInfo1
source: - enter a page number to reference a single page (e.g. "6")
ta: - ஒரு பக்கத்தைக் குறிப்பிட ஒரு பக்க எண்ணை உள்ளிடவும் (எ.கா. "6")

# reader.print.pageHelpInfo2
source: - enter two page numbers separated by a dash character to reference a range of contiguous pages (e.g. "6-13")
ta: - தொடர்ச்சியான பக்கங்களின் வரம்பைக் குறிக்க ஒரு கோடு எழுத்துக்களால் பிரிக்கப்பட்ட இரண்டு பக்க எண்களை உள்ளிடவும் (எ.கா. "6-13")

# reader.print.pageHelpInfo3
source: - use the semicolon character to separate multiple pages or page ranges (e.g. "5;14-20;37")
ta: - பல பக்கங்கள் அல்லது பக்க வரம்புகளை பிரிக்க அரைக்கா தன்மையைப் பயன்படுத்தவும் (எ.கா. "5; 14-20; 37")

# reader.print.pageHelpInfo4
source: - leave out the first or last page of a range to reference the first or last page of the publication (e.g. "-16" is equivalent to "1-16", and "34-" is equivalent to "34-100" assuming a book with a total of 100 pages)
ta: -வெளியீட்டின் முதல் அல்லது கடைசி பக்கத்தைக் குறிப்பிடுவதற்கான வரம்பின் முதல் அல்லது கடைசி பக்கத்தை விட்டு விடுங்கள் (எ.கா. "-16" என்பது "1-16" க்கு சமம், மற்றும் "34-" என்பது "34-100" க்கு சமம், மொத்தம் 100 பக்கங்களைக் கொண்ட ஒரு புத்தகத்தை அனுமானிக்கிறது)

# reader.print.pages
source: Pages
ta: பக்கங்கள்

# reader.print.print
source: Print
ta: அச்சிடுக

# reader.settings.column.auto
source: Default
ta: இயல்புநிலை

# reader.settings.column.one
source: 1 col
ta: 1 கோல்

# reader.settings.column.title
source: Columns
ta: நெடுவரிசைகள்

# reader.settings.column.two
source: 2 cols
ta: 2 நெடுவரிசைகள்

# reader.settings.customFontSelected
source: You have chosen a personal font
ta: நீங்கள் ஒரு தனிப்பட்ட எழுத்துருவைத் தேர்ந்தெடுத்துள்ளீர்கள்

# reader.settings.customizeReader
source: Customize text formatting
ta: உரை வடிவமைப்பைத் தனிப்பயனாக்குங்கள்

# reader.settings.disabled
source: disabled
ta: முடக்கப்பட்டது

# reader.settings.display
source: Display
ta: காட்சி

# reader.settings.disposition.title
source: Layout
ta: மனையமைவு

# reader.settings.font
source: Font
ta: எழுத்துரு

# reader.settings.fontSize
source: Font size
ta: எழுத்துரு அளவு

# reader.settings.infoCustomFont
source: Select custom font from operating system by typing its name
ta: இயக்க முறைமை அதன் பெயரைத் தட்டச்சு செய்வதன் மூலம் தனிப்பயன் எழுத்துருவைத் தேர்ந்தெடுக்கவும்

# reader.settings.justification
source: Alignment
ta: இருப்புவழி

# reader.settings.justify
source: Justify
ta: நியாயப்படுத்துங்கள்

# reader.settings.letterSpacing
source: Letter spacing
ta: கடிதம் இடைவெளி

# reader.settings.lineSpacing
source: Line spacing
ta: வரி இடைவெளி

# reader.settings.margin
source: Margin
ta: விளிம்பு

# reader.settings.noFootnotes
source: Disable popup footnotes
ta: பாப்அப் அடிக்குறிப்புகளை முடக்கு

# reader.settings.noRTLFlip
source: Disable Right-To-Left UI
ta: வலது-இடது இடைமுகம் ஐ முடக்கு

# reader.settings.noRuby
source: Hide Japanese Ruby
ta: சப்பானிய ரூபியை மறைக்கவும்

# reader.settings.noTemporaryNavTargetOutline
source: Disable visual navigation indicators
ta: காட்சி வழிசெலுத்தல் குறிகாட்டிகளை முடக்கு

# reader.settings.paginated
source: Paginated
ta: பிணைப்பு

# reader.settings.paraSpacing
source: Paragraph spacing
ta: பத்தி இடைவெளி

# reader.settings.pdfZoom.name.fit
source: page fit
ta: பக்க பொருத்தம்

# reader.settings.pdfZoom.name.width
source: page width
ta: பக்க அகலம்

# reader.settings.pdfZoom.title
source: Zoom
ta: பெரிதாக்கு

# reader.settings.preset.apply
source: Apply
ta: இடு

# reader.settings.preset.applyDetails
source: Apply your preferred configuration to the current publication.
ta: தற்போதைய வெளியீட்டில் உங்களுக்கு விருப்பமான உள்ளமைவைப் பயன்படுத்துங்கள்.

# reader.settings.preset.detail
source: Save / Apply / Reset your preferred configuration.
ta: உங்களுக்கு விருப்பமான உள்ளமைவைச் சேமிக்கவும் / விண்ணப்பிக்கவும் / மீட்டமைக்கவும்.

# reader.settings.preset.reset
source: Reset
ta: மீட்டமை

# reader.settings.preset.resetDetails
source: Reset your preferred configuration (default settings).
ta: உங்களுக்கு விருப்பமான உள்ளமைவை மீட்டமைக்கவும் (இயல்புநிலை அமைப்புகள்).

# reader.settings.preset.save
source: Save
ta: சேமி

# reader.settings.preset.saveDetails
source: This action saves the current configuration, i.e. your preferred display and text formatting options. The settings can then be applied to other publications by clicking the 'apply' button in other reader windows.
ta: இந்த செயல் தற்போதைய உள்ளமைவை சேமிக்கிறது, அதாவது உங்கள் விருப்பமான காட்சி மற்றும் உரை வடிவமைப்பு விருப்பங்கள். பிற வாசகர் சாளரங்களில் 'விண்ணப்பிக்கவும்' பொத்தானைக் சொடுக்கு செய்வதன் மூலம் அமைப்புகள் பிற வெளியீடுகளுக்குப் பயன்படுத்தப்படலாம்.

# reader.settings.preset.title
source: Preferences
ta: விருப்பத்தேர்வுகள்

# reader.settings.preview
source: Preview
ta: முன்னோட்டம்

# reader.settings.reduceMotion
source: Reduce motion
ta: இயக்கத்தைக் குறைக்கவும்

# reader.settings.scrolled
source: Scrollable
ta: கீறப்பட்டது

# reader.settings.spacing
source: Spacing
ta: இடைவெளி

# reader.settings.text
source: Text
ta: உரை

# reader.settings.theme.name.Contrast1
source: Contrast 1
ta: மாறுபாடு 1

# reader.settings.theme.name.Contrast2
source: Contrast 2
ta: மாறுபாடு 2

# reader.settings.theme.name.Contrast3
source: Contrast 3
ta: மாறுபாடு 3

# reader.settings.theme.name.Contrast4
source: Contrast 4
ta: மாறுபாடு 4

# reader.settings.theme.name.Neutral
source: Neutral
ta: நடுநிலை

# reader.settings.theme.name.Night
source: Night
ta: இரவு

# reader.settings.theme.name.Paper
source: Paper
ta: காகிதம்

# reader.settings.theme.name.Sepia
source: Sepia
ta: செபியா

# reader.settings.theme.title
source: Theme
ta: கருப்பொருள்

# reader.settings.wordSpacing
source: Word spacing
ta: சொல் இடைவெளி

# reader.svg.left
source: Left
ta: இடது

# reader.svg.right
source: Right
ta: வலது

# reader.toc.publicationNoToc
source: No table of contents
ta: உள்ளடக்க அட்டவணை இல்லை

# reader.tts.activate
source: Activate Text To Speech (TTS)
ta: உரைக்கு உரையை செயல்படுத்தவும் (TTS)

# reader.tts.language
source: TTS language
ta: Tts மொழி

# reader.tts.next
source: Next TTS
ta: அடுத்த டி.டி.எச்

# reader.tts.options
source: TTS options
ta: TTS விருப்பங்கள்

# reader.tts.pause
source: Pause TTS
ta: இடைவேளை tts

# reader.tts.play
source: Play TTS
ta: TTS ஐ விளையாடுங்கள்

# reader.tts.previous
source: Previous TTS
ta: முந்தைய டி.டி.எச்

# reader.tts.sentenceDetect
source: Split TTS text
ta: டி.டி.எச் உரையை பிரிக்கவும்

# reader.tts.sentenceDetectDescription
source: Break long paragraphs into sentences.
ta: நீண்ட பத்திகளை வாக்கியங்களாக உடைக்கவும்.

# reader.tts.speed
source: TTS playback rate
ta: TTS பிளேபேக் வீதம்

# reader.tts.stop
source: Stop TTS
ta: TTS ஐ நிறுத்துங்கள்

# reader.tts.voice
source: TTS voice
ta: Tts குரல்

# settings.annotationCreator.creator
source: Annotations creator (optional)
ta: சிறுகுறிப்புகள் உருவாக்கியவர் (விரும்பினால்)

# settings.annotationCreator.help
source: If specified, this name will be included in the metadata of exported notes.
ta: குறிப்பிடப்பட்டால், இந்த பெயர் ஏற்றுமதி செய்யப்பட்ட குறிப்புகளின் மெட்டாடேட்டாவில் சேர்க்கப்படும்.

# settings.annotationCreator.name
source: Name
ta: பெயர்

# settings.annotationCreator.organization
source: Organization
ta: அமைப்பு

# settings.annotationCreator.person
source: Person
ta: ஆள்

# settings.annotationCreator.type
source: Type:
ta: தட்டச்சு:

# settings.auth.help
source: This action deletes all OPDS login credentials.
ta: இந்த செயல் அனைத்து OPDS உள்நுழைவு நற்சான்றுகளையும் நீக்குகிறது.

# settings.auth.title
source: Access to publication catalogs
ta: வெளியீட்டு பட்டியல்களுக்கான அணுகல்

# settings.auth.wipeData
source: Clear login data
ta: உள்நுழைவு தரவை அழிக்கவும்

# settings.keyboard.advancedMenu
source: Keyboard shortcuts advanced menu
ta: விசைப்பலகை குறுக்குவழிகள் மேம்பட்ட பட்டியல்

# settings.keyboard.cancel
source: Cancel
ta: ரத்துசெய்

# settings.keyboard.disclaimer
source: The application defaults were designed based on the physical location of keys on a QWERTY layout
ta: பயன்பாட்டு இயல்புநிலைகள் qwerty தளவமைப்பில் விசைகளின் இயற்பியல் இருப்பிடத்தின் அடிப்படையில் வடிவமைக்கப்பட்டன

# settings.keyboard.editUserJson
source: Edit user file...
ta: பயனர் கோப்பைத் திருத்து ...

# settings.keyboard.keyboardShortcuts
source: Keyboard shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

# settings.keyboard.list.AddBookmarkWithLabel.description
source: Open the bookmark creation dialog and edit the textual label (note), color and tag
ta: புக்மார்க்கு உருவாக்கும் உரையாடலைத் திறந்து உரை சிட்டை (குறிப்பு), வண்ணம் மற்றும் குறிச்சொல்லைத் திருத்தவும்

# settings.keyboard.list.AddBookmarkWithLabel.name
source: Create Bookmark with Label
ta: லேபிளுடன் புத்தகக்குறியை உருவாக்கவும்

# settings.keyboard.list.AnnotationsCreate.description
source: Open the annotation creation dialog for the selected document text, and edit the textual note, highlight color and type, and tag
ta: தேர்ந்தெடுக்கப்பட்ட ஆவண உரைக்கான சிறுகுறிப்பு உருவாக்கும் உரையாடலைத் திறந்து, உரை குறிப்பைத் திருத்தி, வண்ணம் மற்றும் வகையை முன்னிலைப்படுத்தவும், குறிச்சொல்லாகவும்

# settings.keyboard.list.AnnotationsCreate.name
source: Create Annotation
ta: சிறுகுறிப்பை உருவாக்கவும்

# settings.keyboard.list.AnnotationsCreateQuick.description
source: Create an annotation for the selected document text, with the last-used highlight color and type (this does not open the editor dialog, so the textual note and tag is empty)
ta: தேர்ந்தெடுக்கப்பட்ட ஆவண உரைக்கு ஒரு சிறுகுறிப்பை உருவாக்கவும், கடைசியாக பயன்படுத்தப்பட்ட சிறப்பம்சமாக வண்ணம் மற்றும் வகையுடன் (இது எடிட்டர் உரையாடலைத் திறக்காது, எனவே உரை குறிப்பு மற்றும் குறிச்சொல் காலியாக உள்ளது)

# settings.keyboard.list.AnnotationsCreateQuick.name
source: Create Quick Annotation
ta: விரைவான சிறுகுறிப்பை உருவாக்கவும்

# settings.keyboard.list.AnnotationsToggleMargin.description
source: Alternate the annotation and bookmark visual indicators, either in the document margin or in the text
ta: ஆவண விளிம்பில் அல்லது உரையில் சிறுகுறிப்பு மற்றும் புக்மார்க்கு காட்சி குறிகாட்டிகளை மாற்றவும்

# settings.keyboard.list.AnnotationsToggleMargin.name
source: Toggle Annotation Margin
ta: சிறுகுறிப்பு விளிம்பை மாற்றவும்

# settings.keyboard.list.AudioNext.description
source: Move forward to the next audio event in EPUB3 Media Overlays, Text To Speech readaloud, or audiobooks
ta: EPUB3 மீடியா மேலடுக்கில் அடுத்த ஆடியோ நிகழ்வுக்கு முன்னேறவும், உரையின் உரை சத்தமாக வாசிக்கவும், ஆடியோபுக்குகளுக்கு

# settings.keyboard.list.AudioNext.name
source: Next Audio
ta: அடுத்த ஆடியோ

# settings.keyboard.list.AudioNextAlt.description
source: Move forward to the next audio event in EPUB3 Media Overlays, Text To Speech readaloud, or audiobooks. This skips the current escapable structure, if applicable
ta: EPUB3 மீடியா மேலடுக்குகளில் அடுத்த ஆடியோ நிகழ்வுக்கு முன்னேறவும், உரையை உரக்கப் படிக்க உரை, ஆடியோபுக்குகளுக்கு. இது பொருந்தினால், தற்போதைய தப்பிக்கக்கூடிய கட்டமைப்பைத் தவிர்க்கிறது

# settings.keyboard.list.AudioNextAlt.name
source: Next Audio (escape)
ta: அடுத்த ஆடியோ (தப்பித்தல்)

# settings.keyboard.list.AudioPlayPause.description
source: Toggle play/pause in EPUB3 Media Overlays, Text To Speech readaloud, or audiobooks
ta: EPUB3 மீடியா மேலடுக்கில் நாடகம்/இடைநிறுத்தம், உரையின் உரை சத்தமாக வாசிக்கவும், ஆடியோபுக்குகளுக்கு

# settings.keyboard.list.AudioPlayPause.name
source: Play/Pause Audio
ta: ஆடியோவை இயக்கவும்/இடைநிறுத்தவும்

# settings.keyboard.list.AudioPrevious.description
source: Move backward to the previous audio event in EPUB3 Media Overlays, Text To Speech readaloud, or audiobooks
ta: EPUB3 மீடியா மேலடுக்கில் முந்தைய ஆடியோ நிகழ்வுக்கு பின்னோக்கி நகர்த்தவும், உரைக்கு உரை உரக்கப் படிக்கவும், ஆடியோபுக்குகளுக்கு

# settings.keyboard.list.AudioPrevious.name
source: Previous Audio
ta: முந்தைய ஆடியோ

# settings.keyboard.list.AudioPreviousAlt.description
source: Move backward to the previous audio event in EPUB3 Media Overlays, Text To Speech readaloud, or audiobooks. This skips the current escapable structure, if applicable
ta: EPUB3 மீடியா மேலடுக்குகளில் முந்தைய ஆடியோ நிகழ்வுக்கு பின்னோக்கி நகர்த்தவும், உரையை உரக்கப் படிக்க உரை, ஆடியோபுக்குகளுக்கு. இது பொருந்தினால், தற்போதைய தப்பிக்கக்கூடிய கட்டமைப்பைத் தவிர்க்கிறது

# settings.keyboard.list.AudioPreviousAlt.name
source: Previous Audio (escape)
ta: முந்தைய ஆடியோ (தப்பித்தல்)

# settings.keyboard.list.AudioStop.description
source: Stop audio in EPUB3 Media Overlays, Text To Speech readaloud, or audiobooks
ta: EPUB3 மீடியா மேலடுக்கில் ஆடியோவை நிறுத்துங்கள், உரைக்கு உரை உரக்கப் படிக்கவும், ஆடியோபுக்குகளுக்கு

# settings.keyboard.list.AudioStop.name
source: Stop Audio
ta: ஆடியோவை நிறுத்து

# settings.keyboard.list.CloseReader.description
source: Close the reader window and return to the library
ta: வாசகர் சாளரத்தை மூடி நூலகத்திற்குத் திரும்புக

# settings.keyboard.list.CloseReader.name
source: Close Reader
ta: மூடு வாசகர்

# settings.keyboard.list.FXLZoomIn.description
source: Zoom into a fixed layout single page or 2-page spread.
ta: ஒரு நிலையான தளவமைப்பு ஒற்றை பக்கம் அல்லது 2 பக்க பரவலாக பெரிதாக்கவும்.

# settings.keyboard.list.FXLZoomIn.name
source: FXL Zoom In
ta: Fxl பெரிதாக்கு

# settings.keyboard.list.FXLZoomOut.description
source: Zoom out of a fixed layout single page or 2-page spread.
ta: ஒரு நிலையான தளவமைப்பு ஒற்றை பக்கம் அல்லது 2 பக்க பரவலில் இருந்து பெரிதாக்கவும்.

# settings.keyboard.list.FXLZoomOut.name
source: FXL Zoom Out
ta: FXL பெரிதாக்கவும்

# settings.keyboard.list.FXLZoomReset.description
source: Reset zoom on a fixed layout single page or 2-page spread.
ta: ஒரு நிலையான தளவமைப்பு ஒற்றை பக்கம் அல்லது 2 பக்க பரவலில் பெரிதாக்கத்தை மீட்டமைக்கவும்.

# settings.keyboard.list.FXLZoomReset.name
source: Reset FXL Zoom
ta: FXL சூம் மீட்டமைக்கவும்

# settings.keyboard.list.FocusMain.description
source: Move the keyboard focus to the 'main' landmark in the graphical user interface. In the reader window, this moves into the publication content
ta: விசைப்பலகை மையத்தை வரைகலை பயனர் இடைமுகத்தில் உள்ள 'முதன்மையான' அடையாளத்திற்கு நகர்த்தவும். வாசகர் சாளரத்தில், இது வெளியீட்டு உள்ளடக்கத்தில் நகர்கிறது

# settings.keyboard.list.FocusMain.name
source: Focus on Main Content
ta: முக்கிய உள்ளடக்கத்தில் கவனம் செலுத்துங்கள்

# settings.keyboard.list.FocusMainDeep.description
source: In the reader window, this moves the keyboard focus into the publication content using a more reliable technique for screen readers
ta: ரீடர் சாளரத்தில், இது விசைப்பலகை கவனம் செலுத்தும் உள்ளடக்கத்தில் வெளியீட்டு உள்ளடக்கத்தில் திரை வாசகர்களுக்கான நம்பகமான நுட்பத்தைப் பயன்படுத்தி நகர்த்துகிறது

# settings.keyboard.list.FocusMainDeep.name
source: Deep Focus on Main Content
ta: முக்கிய உள்ளடக்கத்தில் ஆழ்ந்த கவனம்

# settings.keyboard.list.FocusReaderGotoPage.description
source: Move the keyboard focus to the 'goto page' section of the reader window's navigation panel
ta: விசைப்பலகை மையத்தை ரீடர் சாளரத்தின் வழிசெலுத்தல் குழுவின் 'கோட்டோ பக்கம்' பகுதிக்கு நகர்த்தவும்

# settings.keyboard.list.FocusReaderGotoPage.name
source: Focus on 'Go to Page'
ta: 'பக்கத்திற்குச் செல்லுங்கள்' என்பதில் கவனம் செலுத்துங்கள்

# settings.keyboard.list.FocusReaderNavigation.description
source: Move the keyboard focus to the reader window's navigation panel
ta: விசைப்பலகை மையத்தை வாசகர் சாளரத்தின் வழிசெலுத்தல் பேனலுக்கு நகர்த்தவும்

# settings.keyboard.list.FocusReaderNavigation.name
source: Focus on Navigation Panel
ta: வழிசெலுத்தல் குழுவில் கவனம் செலுத்துங்கள்

# settings.keyboard.list.FocusReaderNavigationAnnotations.description
source: Move the keyboard focus to the 'annotations' section of the reader window's navigation panel
ta: விசைப்பலகை மையத்தை வாசகர் சாளரத்தின் வழிசெலுத்தல் குழுவின் 'சிறுகுறிப்புகள்' பகுதிக்கு நகர்த்தவும்

# settings.keyboard.list.FocusReaderNavigationAnnotations.name
source: Focus on 'Annotations'
ta: 'சிறுகுறிப்புகளில்' கவனம் செலுத்துங்கள்

# settings.keyboard.list.FocusReaderNavigationBookmarks.description
source: Move the keyboard focus to the 'bookmarks' section of the reader window's navigation panel
ta: விசைப்பலகை மையத்தை வாசகர் சாளரத்தின் வழிசெலுத்தல் குழுவின் 'புக்மார்க்ச்' பகுதிக்கு நகர்த்தவும்

# settings.keyboard.list.FocusReaderNavigationBookmarks.name
source: Focus on 'Bookmarks'
ta: 'புக்மார்க்குகள்' மீது கவனம் செலுத்துங்கள்

# settings.keyboard.list.FocusReaderNavigationSearch.description
source: Move the keyboard focus to the 'search' section of the reader window's navigation panel
ta: விசைப்பலகை மையத்தை வாசகர் சாளரத்தின் வழிசெலுத்தல் குழுவின் 'தேடல்' பகுதிக்கு நகர்த்தவும்

# settings.keyboard.list.FocusReaderNavigationSearch.name
source: Focus on 'Search'
ta: 'தேடலில்' கவனம் செலுத்துங்கள்

# settings.keyboard.list.FocusReaderNavigationTOC.description
source: Move the keyboard focus to the 'TOC' section of the reader window's navigation panel
ta: விசைப்பலகை மையத்தை வாசகர் சாளரத்தின் வழிசெலுத்தல் குழுவின் 'TOC' பிரிவுக்கு நகர்த்தவும்

# settings.keyboard.list.FocusReaderNavigationTOC.name
source: Focus on 'table of contents'
ta: 'உள்ளடக்க அட்டவணையில்' கவனம் செலுத்துங்கள்

# settings.keyboard.list.FocusReaderSettings.description
source: Move the keyboard focus to the reader window's settings panel (display preferences, etc.)
ta: விசைப்பலகை மையத்தை வாசகர் சாளரத்தின் அமைப்புகள் பேனலுக்கு நகர்த்தவும் (காட்சி விருப்பத்தேர்வுகள் போன்றவை)

# settings.keyboard.list.FocusReaderSettings.name
source: Focus on Reader Settings
ta: வாசகர் அமைப்புகளில் கவனம் செலுத்துங்கள்

# settings.keyboard.list.FocusSearch.description
source: Move the keyboard focus to the reader window's text search input, or in the library window this searches the bookshelf or the active OPDS feed
ta: விசைப்பலகை மையத்தை வாசகர் சாளரத்தின் உரை தேடல் உள்ளீட்டிற்கு நகர்த்தவும் அல்லது நூலக சாளரத்தில் இது புத்தக அலமாரி அல்லது செயலில் உள்ள OPDS ஊட்டத்தைத் தேடுகிறது

# settings.keyboard.list.FocusSearch.name
source: Search Command
ta: தேடல் கட்டளை

# settings.keyboard.list.FocusToolbar.description
source: Move the keyboard focus to the landmark area of the graphical user interface immediately before the 'skip link' (which itself moves the focus to the main content area of the library or reader window)
ta: விசைப்பலகை மையத்தை 'ச்கிப் லிங்க்' க்கு முன் வரைகலை பயனர் இடைமுகத்தின் மைல்கல் பகுதிக்கு நகர்த்தவும் (இது நூலகத்தின் முக்கிய உள்ளடக்க பகுதிக்கு அல்லது வாசகர் சாளரத்திற்கு கவனம் செலுத்துகிறது)

# settings.keyboard.list.FocusToolbar.name
source: Focus on Toolbar
ta: கருவிப்பட்டியில் கவனம் செலுத்துங்கள்

# settings.keyboard.list.NavigateNextChapter.description
source: In the reader window, navigate to the next document in the reading order of the publication (e.g. chapter in the book spine). Note that there is an alternative keyboard shortcut to this default one
ta: வாசகர் சாளரத்தில், வெளியீட்டின் வாசிப்பு வரிசையில் அடுத்த ஆவணத்திற்கு செல்லவும் (எ.கா. முதுகெலும்பு புத்தகத்தில் அத்தியாயம்). இந்த இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி உள்ளது என்பதை நினைவில் கொள்க

# settings.keyboard.list.NavigateNextChapter.name
source: Go to Next Chapter
ta: அடுத்த அத்தியாயத்திற்குச் செல்லுங்கள்

# settings.keyboard.list.NavigateNextChapterAlt.description
source: In the reader window, navigate to the next document in the reading order of the publication (e.g. chapter in the book spine). This is an alternative keyboard shortcut to the default one
ta: வாசகர் சாளரத்தில், வெளியீட்டின் வாசிப்பு வரிசையில் அடுத்த ஆவணத்திற்கு செல்லவும் (எ.கா. முதுகெலும்பு புத்தகத்தில் அத்தியாயம்). இது இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி

# settings.keyboard.list.NavigateNextChapterAlt.name
source: Go to Next Chapter (Alternative)
ta: அடுத்த அத்தியாயத்திற்குச் செல்லுங்கள் (மாற்று)

# settings.keyboard.list.NavigateNextHistory.description
source: In the reader window, jump one step forward in the navigation history
ta: வாசகர் சாளரத்தில், வழிசெலுத்தல் வரலாற்றில் ஒரு படி மேலே செல்லவும்

# settings.keyboard.list.NavigateNextHistory.name
source: Go to Next History
ta: அடுத்த வரலாற்றுக்குச் செல்லுங்கள்

# settings.keyboard.list.NavigateNextLibraryPage.description
source: In the library window, show the next page of a paginated list of publications. Note that there is an alternative keyboard shortcut to this default one
ta: நூலக சாளரத்தில், வெளியீடுகளின் சிறிய பட்டியலின் அடுத்த பக்கத்தைக் காட்டுங்கள். இந்த இயல்புநிலைக்கு மாற்று விசைப்பலகை குறுக்குவழி உள்ளது என்பதை நினைவில் கொள்க

# settings.keyboard.list.NavigateNextLibraryPage.name
source: Go to Next Library Page
ta: அடுத்த நூலகப் பக்கத்திற்குச் செல்லவும்
