Repository: 247i/TACETr
Catalog: உரை/தானி/thunder-thunder-*.po
Languages: ta

# reply
source: {count, plural, zero {Reply} one {Reply} other {Replies} }
ta: {count, plural, zero {மறுமொழி} one {மறுமொழி} other {மறுமொழிகள்} }

source: Reply Color
ta: பதில் நிறம்

# replyNotSupported
source: Replying from this view is currently not supported yet
ta: இந்த பார்வையில் இருந்து பதிலளிப்பது தற்போது ஆதரிக்கப்படவில்லை

source: Reply to Post
ta: இடுகைக்கு பதில்

# replyingTo
source: Replying to {author}
ta: {author} க்கு பதிலளித்தல்

# report
source: {count, plural, zero {Report} one {Report} other {Reports} }
ta: {count, plural, zero {அறிக்கை} one {அறிக்கை} other {அறிக்கைகள்} }

source: Report Comment
ta: கருத்து தெரிவிக்கவும்

source: Report Post
ta: அறிக்கை இடுகை

source: Reporter:
ta: நிருபர்:

# requiredField
source: *required
ta: *தேவை

source: Reset
ta: மீட்டமை

source: Reset comment preferences
ta: கருத்து விருப்பங்களை மீட்டமைக்கவும்

source: Reset post preferences
ta: இடுகை விருப்பங்களை மீட்டமைக்கவும்

source: Reset Preferences
ta: விருப்பங்களை மீட்டமைக்கவும்

source: Reset Preferences and Data
ta: விருப்பத்தேர்வுகள் மற்றும் தரவை மீட்டமைக்கவும்

source: Restore
ta: மீட்டெடு

source: Restore Comment
ta: கருத்தை மீட்டெடுங்கள்

source: Restore Post
ta: இடுகையை மீட்டெடுங்கள்

source: Restored Comment
ta: மீட்டெடுக்கப்பட்ட கருத்து

source: Restored comment from draft
ta: வரைவில் இருந்து மீட்டெடுக்கப்பட்டது

source: Restored Community
ta: மீட்டெடுக்கப்பட்ட சமூகம்

source: Restored Post
ta: மீட்டமைக்கப்பட்ட இடுகை

source: Restored post from draft
ta: வரைவிலிருந்து மீட்டெடுக்கப்பட்ட இடுகை

source: Retry
ta: மீண்டும் முயற்சிக்கவும்

source: Right Long Swipe
ta: வலது நீண்ட ச்வைப்

source: Right Short Swipe
ta: வலது குறுகிய ச்வைப்

source: Save
ta: சேமி

source: Save Color
ta: நிறத்தை சேமிக்கவும்

source: Save Settings
ta: அமைப்புகளை சேமிக்கவும்

source: Saved
ta: சேமிக்கப்பட்டது

source: Scaled
ta: அளவிடப்பட்டது

source: Scrape Missing Link Previews
ta: காணாமல் போன இணைப்பு முன்னோட்டங்களைத் துடைக்கவும்

source: Screen Reader Profile
ta: திரை ரீடர் சுயவிவரம்

# screenReaderProfileDescription
source: Optimizes Thunder for screen readers by reducing overall elements and removing potentially conflicting gestures.
ta: ஒட்டுமொத்த கூறுகளைக் குறைப்பதன் மூலமும், முரண்பட்ட சைகைகளை அகற்றுவதன் மூலமும் திரை வாசகர்களுக்கான இடியை மேம்படுத்துகிறது.

source: Search
ta: தேடல்

source: Search by text
ta: உரை மூலம் தேடுங்கள்

source: Search by URL
ta: முகவரி மூலம் தேடுங்கள்

source: Search Comments
ta: கருத்துகளைத் தேடுங்கள்

# searchCommentsFederatedWith
source: Search for comments federated with {instance}
ta: {instance} உடன் கூட்டாக்கப்பட்ட கருத்துகளைத் தேடு

# searchCommunitiesFederatedWith
source: Search for communities federated with {instance}
ta: {instance} உடன் கூட்டாக்கப்பட்ட சமூகங்களைத் தேடு

source: Search {instance}
ta: தேடல் {instance}

# searchInstancesFederatedWith
source: Search for instances federated with {instance}
ta: {instance} உடன் கூட்டமைப்பு செய்யப்பட்ட நிகழ்வுகளைத் தேடு

# searchPostSearchType
source: Select Post Search Type
ta: இடுகை தேடல் வகையைத் தேர்ந்தெடுக்கவும்

# searchPostsFederatedWith
source: Search for posts federated with {instance}
ta: {instance} உடன் கூட்டாக்கப்பட்ட இடுகைகளைத் தேடு

source: Search term
ta: தேடல் கால

# searchUsersFederatedWith
source: Search for users federated with {instance}
ta: {instance} உடன் கூட்டாக்கப்பட்ட பயனர்களைத் தேடு

source: Select account to comment as
ta: கருத்து தெரிவிக்க கணக்கைத் தேர்ந்தெடுக்கவும்

source: Select account to post as
ta: இடுகையிட கணக்கைத் தேர்ந்தெடுக்கவும்

source: Select all
ta: அனைத்தையும் தெரிவுசெய்

# selectCommunity
source: Select a community (required)
ta: ஒரு சமூகத்தைத் தேர்ந்தெடுக்கவும் (தேவை)

source: Select Feed Type
ta: தீவன வகையைத் தேர்ந்தெடுக்கவும்

source: Select Language
ta: மொழியைத் தேர்ந்தெடுக்கவும்

source: Select Search Type
ta: தேடல் வகையைத் தேர்ந்தெடுக்கவும்

source: Select Text
ta: உரையைத் தேர்ந்தெடுக்கவும்

source: Send background test local notification
ta: பின்னணி சோதனை உள்ளக அறிவிப்பை அனுப்பவும்

source: Send background test UnifiedPush notification
ta: பின்னணி சோதனை ஒருங்கிணைந்த புச் அறிவிப்பை அனுப்பவும்

source: Send test local notification
ta: சோதனை உள்ளக அறிவிப்பை அனுப்பவும்

source: Send test UnifiedPush notification
ta: சோதனை ஒருங்கிணைந்த புச் அறிவிப்பை அனுப்பவும்

# sensitiveContentWarning
source: May contain sensitive content. Tap to reveal.
ta: முக்கியமான உள்ளடக்கம் இருக்கலாம். வெளிப்படுத்த தட்டவும்.

source: Sent request for test notification.
ta: சோதனை அறிவிப்புக்கான கோரிக்கை அனுப்பப்பட்டது.

# serverErrorComments
source: A server error was encountered when fetching more comments: {message}
ta: மேலும் கருத்துகளைப் பெறும்போது சேவையக பிழை ஏற்பட்டது: {message}

source: Set Action
ta: நடவடிக்கை அமைக்கவும்

# setLongPress
source: Set as long-press action
ta: நீண்ட அழுத்த செயலாக அமைக்கவும்

# setShortPress
source: Set as short-press action
ta: குறுகிய செய்தித் தாள் செயலாக அமைக்கவும்

# settingOverrideLabel
source: These settings override Thunder's default settings.
ta: இந்த அமைப்புகள் தண்டரின் இயல்புநிலை அமைப்புகளை மீறுகின்றன.

# settingTypeNotSupported
source: Settings of type {settingType} are not yet supported.
ta: வகை {settingType} இன் அமைப்புகள் இன்னும் ஆதரிக்கப்படவில்லை.

source: Settings
ta: அமைப்புகள்

# settingsExportedSuccessfully
source: Settings were successfully saved to '{savedFilePath}'
ta: அமைப்புகள் வெற்றிகரமாக '{savedFilePath}'

# settingsFeedCards
source: These settings apply to the cards in the main feed, actions are always available when actually opening posts.
ta: இந்த அமைப்புகள் முக்கிய ஊட்டத்தில் உள்ள அட்டைகளுக்கு பொருந்தும், உண்மையில் இடுகைகளைத் திறக்கும்போது செயல்கள் எப்போதும் கிடைக்கும்.

# settingsImportedSuccessfully
source: Settings were imported successfully!
ta: அமைப்புகள் வெற்றிகரமாக இறக்குமதி செய்யப்பட்டன!

# settingsNotExportedSuccessfully
source: Settings were not saved successfully, or the operation was canceled.
ta: அமைப்புகள் வெற்றிகரமாக சேமிக்கப்படவில்லை, அல்லது அறுவை மருத்தீடு ரத்து செய்யப்பட்டது.

# settingsNotImportedSuccessfully
source: Settings were not imported successfully or the operation was canceled.
ta: அமைப்புகள் வெற்றிகரமாக இறக்குமதி செய்யப்படவில்லை அல்லது செயல்பாடு ரத்து செய்யப்பட்டது.

source: Settings Page
ta: அமைப்புகள் பக்கம்

# settingsPageAbout
source: About
ta: பற்றி

# settingsPageAccessibility
source: Accessibility
ta: அணுகல்

# settingsPageAccount
source: Account
ta: கணக்கு

# settingsPageAccountBlocks
source: Blocklists
ta: பிளாக்லிச்ட்கள்

# settingsPageAccountLanguages
source: Discussion Languages
ta: கலந்துரையாடல் மொழிகள்

# settingsPageAccountMedia
source: Manage Media
ta: மீடியாவை நிர்வகிக்கவும்

# settingsPageAppearance
source: Appearance
ta: தோற்றம்

# settingsPageAppearanceComments
source: Comments
ta: கருத்துகள்

# settingsPageAppearancePosts
source: Posts
ta: இடுகைகள்

# settingsPageAppearanceTheming
source: Theming
ta: தீமிங்

# settingsPageDebug
source: Debug
ta: பிழைத்திருத்தம்

# settingsPageFilters
source: Filters
ta: வடிப்பான்கள்

# settingsPageFloatingActionButton
source: Floating Action Button
ta: மிதக்கும் செயல் பொத்தான்

# settingsPageGeneral
source: General
ta: பொது

# settingsPageGestures
source: Gestures
ta: சைகைகள்

# settingsPageUserLabels
source: User Labels
ta: பயனர் லேபிள்கள்

# settingsPageVideo
source: Video
ta: ஒளிதோற்றம்

source: Share
ta: பங்கு

# shareComment
source: Share Comment Link
ta: கருத்து இணைப்பைப் பகிரவும்

# shareCommentLocal
source: Share Comment Link (My Instance)
ta: கருத்து இணைப்பைப் பகிரவும் (எனது நிகழ்வு)

source: Share Community
ta: சமூகத்தைப் பகிர்ந்து கொள்ளுங்கள்

source: Share Community Link
ta: சமூக இணைப்பைப் பகிரவும்

# shareCommunityLinkLocal
source: Share Community Link (My Instance)
ta: சமூக இணைப்பைப் பகிரவும் (எனது நிகழ்வு)

source: Share Image
ta: படத்தைப் பகிரவும்

source: Share Lemmy Link
ta: லெம்மி இணைப்பைப் பகிரவும்

# shareLink
source: Share External Link
ta: வெளிப்புற இணைப்பைப் பகிரவும்

source: Share Media
ta: ஊடகத்தைப் பகிரவும்

source: Share Media Link
ta: மீடியா இணைப்பைப் பகிரவும்

source: Share Original Link
ta: அசல் இணைப்பைப் பகிரவும்

# sharePost
source: Share Post Link
ta: இடுகை இணைப்பைப் பகிரவும்

# sharePostLocal
source: Share Post Link (My Instance)
ta: இடுகை இணைப்பைப் பகிரவும் (எனது நிகழ்வு)

source: Share Thumbnail
ta: சிறுபடத்தைப் பகிரவும்

source: Share Thumbnail As Image
ta: சிறுபடத்தை படமாக பகிரவும்

source: Share User
ta: பயனரைப் பகிரவும்

source: Share User Link
ta: பயனர் இணைப்பைப் பகிரவும்

# shareUserLinkLocal
source: Share User Link (My Instance)
ta: பயனர் இணைப்பைப் பகிரவும் (எனது நிகழ்வு)

source: Show all
ta: அனைத்தையும் காட்டு

source: Show Bot Accounts
ta: போட் கணக்குகளைக் காட்டு

source: Show Comment Action Buttons
ta: கருத்து நடவடிக்கை பொத்தான்களைக் காட்டு

source: Show Community Display Names
ta: சமூக காட்சி பெயர்களைக் காட்டு

source: Show Cross Posts
ta: குறுக்கு இடுகைகளைக் காட்டு

source: Show Edge to Edge Images
ta: எட்ச் டு எட்ச் படங்களைக் காட்டு

source: Show expanded taglines
ta: விரிவாக்கப்பட்ட டேக்லைன்களைக் காட்டு

source: Show Full Date
ta: முழு தேதியைக் காட்டு

# showFullDateDescription
source: Show full date on posts
ta: இடுகைகளில் முழு தேதியைக் காட்டு

source: Show Full Height Images
ta: முழு உயர படங்களைக் காட்டுங்கள்

source: Show Hidden Posts
ta: மறைக்கப்பட்ட இடுகைகளைக் காட்டு

# showInAppUpdateNotifications
source: Get Notified of new GitHub Releases
ta: புதிய அறிவிலிமையம் வெளியீடுகளுக்கு அறிவிக்கப்படும்

source: Show less
ta: குறைவாகக் காட்டு

source: Show more
ta: மேலும் காட்டு

source: Show Navigation Labels
ta: வழிசெலுத்தல் லேபிள்களைக் காட்டு

# showNavigationLabelsDescription
source: Whether to display labels beneath the bottom navigation buttons
ta: கீழே உள்ள வழிசெலுத்தல் பொத்தான்களுக்கு அடியில் லேபிள்களைக் காண்பிக்க வேண்டுமா

source: Show NSFW Content
ta: NSFW உள்ளடக்கத்தைக் காட்டு

source: Show own content
ta: சொந்த உள்ளடக்கத்தைக் காட்டு

source: Show Password
ta: கடவுச்சொல்லைக் காட்டு

source: Show Post Author
ta: இடுகை எழுத்தாளரைக் காட்டு

# showPostAuthorSubtitle
source: Post author is always shown in community feeds
ta: இடுகை ஆசிரியர் எப்போதும் சமூக ஊட்டங்களில் காட்டப்படுகிறார்

# showPostCommunityIcons
source: Show Community Icons
ta: சமூக சின்னங்களைக் காட்டு

# showPostSaveAction
source: Show Save Button
ta: சேமி பொத்தானைக் காட்டு

# showPostTextContentPreview
source: Show Text Preview
ta: உரை முன்னோட்டத்தைக் காட்டு

# showPostTitleFirst
source: Show Title First
ta: முதலில் தலைப்பைக் காட்டு

# showPostVoteActions
source: Show Vote Buttons
ta: வாக்கு பொத்தான்களைக் காட்டு

source: Show Read Posts
ta: வாசிப்பு இடுகைகளைக் காட்டு

source: Show saved content
ta: சேமித்த உள்ளடக்கத்தைக் காட்டு

# showScoreCounters
source: Display User Scores
ta: பயனர் மதிப்பெண்களைக் காண்பி

# showScores
source: Show Post/Comment Scores
ta: இடுகை/கருத்து மதிப்பெண்களைக் காட்டு

source: Show Text Post Indicator
ta: உரை இடுகை காட்டி காட்டு

# showThumbnailPreviewOnRight
source: Show Thumbnails on the Right
ta: வலதுபுறத்தில் சிறு உருவங்களைக் காட்டு

source: Show unread only
ta: படிக்க மட்டும் காட்டு

source: Show Update Changelogs
ta: புதுப்பிப்பு சேஞ்ச்லாக்சைக் காட்டு

# showUpdateChangelogsSubtitle
source: Display a list of changes after an update
ta: புதுப்பிப்புக்குப் பிறகு மாற்றங்களின் பட்டியலைக் காண்பி

source: Show User Avatar
ta: பயனர் அவதாரத்தைக் காட்டு

source: Show User Display Names
ta: பயனர் காட்சி பெயர்களைக் காட்டு

source: Show User Instance
ta: பயனர் உதாரணத்தைக் காட்டு

source: Sidebar
ta: பக்கப்பட்டி

# sidebarBottomNavDoubleTapDescription
source: Double-tap bottom nav to open sidebar
ta: பக்கப்பட்டியைத் திறக்க இரட்டை தட்டுதல் கீழே NAV

# sidebarBottomNavSwipeDescription
source: Swipe bottom nav to open sidebar
ta: பக்கப்பட்டியைத் திறக்க கீழே NAV ஐ ச்வைப் செய்யவும்

source: Small
ta: சிறிய

# somethingWentWrong
source: Oops, something went wrong!
ta: அச்சச்சோ, ஏதோ தவறு நடந்தது!

source: Sort By
ta: வரிசைப்படுத்தவும்

source: Sort by Top
ta: மேலே வரிசைப்படுத்துங்கள்

source: Sort Options
ta: வரிசைப்படுத்து விருப்பங்கள்

source: Spoiler
ta: இறக்கைத்தடை

source: Standard
ta: தரநிலை

source: Stats
ta: புள்ளிவிவரங்கள்

source: Status
ta: நிலை

source: Submit
ta: சமர்ப்பிக்கவும்

source: Subscribe
ta: குழுசேர்

source: Subscribe to Community
ta: சமூகத்திற்கு குழுசேரவும்

source: Subscribed
ta: சந்தா

source: Subscription request sent
ta: சந்தா கோரிக்கை அனுப்பப்பட்டது

source: Subscriptions
ta: சந்தாக்கள்

# successfullyBannedUser
source: Banned {username}
ta: தடைசெய்யப்பட்டது {username}

# successfullyBlocked
source: Blocked.
ta: தடுக்கப்பட்டது.

# successfullyBlockedCommunity
source: Blocked {communityName}
ta: தடுக்கப்பட்ட {communityName}

# successfullyBlockedUser
source: Blocked {username}
ta: தடுக்கப்பட்டது {username}

# successfullyUnbannedUser
source: Unbanned {username}
ta: தடைசெய்யப்படாத {username}

# successfullyUnblocked
source: Unblocked.
ta: தடைசெய்யப்பட்டது.

# successfullyUnblockedCommunity
source: Unblocked {communityName}
ta: தடைசெய்யப்படாத {communityName}

# successfullyUnblockedUser
source: Unblocked {username}
ta: தடைசெய்யப்பட்ட {username}

source: such as
ta: போன்றவை

source: Suggested title
ta: பரிந்துரைக்கப்பட்ட தலைப்பு

source: System
ta: மண்டலம்

# systemDarkMode
source: Pure Black
ta: தூய கருப்பு

# systemDarkModeDescription
source: Enable pure black theme for dark mode
ta: இருண்ட பயன்முறைக்கு தூய கருப்பு கருப்பொருள் இயக்கவும்

# tabletMode
source: Tablet Mode (2-column view)
ta: டேப்லெட் பயன்முறை (2 நெடுவரிசை பார்வை)

# tapToExit
source: Press back again to exit
ta: வெளியேற மீண்டும் அழுத்தவும்

# tappableAuthorCommunity
source: Tappable Authors & Communities
ta: தட்டக்கூடிய ஆசிரியர்கள் மற்றும் சமூகங்கள்

source: Teal
ta: டீல்

# testBackgroundNotificationDescription
source: Thunder will close itself and then attempt to generate a notification in the background. (It will take at least 15 minutes.)
ta: தண்டர் தன்னை மூடிவிட்டு பின்னர் பின்னணியில் ஒரு அறிவிப்பை உருவாக்க முயற்சிக்கும். (இது குறைந்தது 15 நிமிடங்கள் ஆகும்.)

# testBackgroundUnifiedPushNotificationDescription
source: Thunder will ask the notification server to send a delayed notification and then close itself. (It may take a few minutes.)
ta: தாமதமான அறிவிப்பை அனுப்பவும் பின்னர் தன்னை மூடிமறைக்கவும் தண்டர் அறிவிப்பு சேவையகத்தைக் கேட்கும். (இது சில நிமிடங்கள் ஆகலாம்.)

source: Text
ta: உரை

source: Text Actions
ta: உரை செயல்கள்

source: Theme
ta: கருப்பொருள்

# themeAccentColor
source: Accent Colors
ta: உச்சரிப்பு வண்ணங்கள்

source: Theme Primary
ta: கருப்பொருள் முதன்மை

source: Theme Secondary
ta: கருப்பொருள் இரண்டாம் நிலை

source: Theme Tertiary
ta: கருப்பொருள் மூன்றாம் நிலை

source: Theming
ta: தீமிங்

source: Thickness
ta: தடிமன்

source: This Account
ta: இந்த கணக்கு

source: Thumbnail URL
ta: சிறு முகவரி

# thunderHasBeenUpdated
source: Thunder updated to {version}!
ta: {version} க்கு இடி புதுப்பிக்கப்பட்டது!

# thunderNotificationServer
source: Thunder Notification Server: {server}
ta: தண்டர் அறிவிப்பு சேவையகம்: {server}

# timeoutComments
source: Error: Timeout when attempting to fetch comments
ta: பிழை: கருத்துகளைப் பெற முயற்சிக்கும்போது நேரம் முடிந்தது

# timeoutErrorMessage
source: There was a timeout waiting for a response.
ta: பதிலுக்காக காத்திருக்கும் நேரம் முடிந்தது.

# timeoutSaveComment
source: Error: Timeout when attempting to save a comment
ta: பிழை: கருத்தைச் சேமிக்க முயற்சிக்கும்போது நேரம் முடிந்தது

# timeoutSavingPost
source: Error: Timeout when attempting to save post.
ta: பிழை: இடுகையைச் சேமிக்க முயற்சிக்கும்போது நேரம் முடிந்தது.

# timeoutUpvoteComment
source: Error: Timeout when attempting to vote on comment
ta: பிழை: கருத்தில் வாக்களிக்க முயற்சிக்கும்போது நேரம் முடிந்தது

# timeoutVotingPost
source: Error: Timeout when attempting to vote post.
ta: பிழை: வாக்களிக்க முயற்சிக்கும்போது நேரம் முடிந்தது.

# toggelRead
source: Toggle Read
ta: படிக்கவும்

source: Top
ta: மேலே

# topAll
source: Top of all time
ta: எல்லா நேரத்திலும் மேல்

# topDay
source: Top Today
ta: இன்று மேலே

# topHour
source: Top in Past Hour
ta: கடந்த மணிநேரத்தில் மேலே

source: Top Month
ta: முதல் மாதம்

# topNineMonths
source: Top in Past 9 Months
ta: கடந்த 9 மாதங்களில் முதலிடம்

# topSixHour
source: Top in Past 6 Hours
ta: கடந்த 6 மணி நேரத்தில் மேலே

# topSixMonths
source: Top in Past 6 Months
ta: கடந்த 6 மாதங்களில் முதலிடம்

# topThreeMonths
source: Top in Past 3 Months
ta: கடந்த 3 மாதங்களில் முதலிடம்

# topTwelveHour
source: Top in Past 12 Hours
ta: கடந்த 12 மணி நேரத்தில் மேலே

source: Top Week
ta: முதல் வாரம்

source: Top Year
ta: முதல் ஆண்டு

# totalComments
source: {x} Comments
ta: {x} கருத்துகள்

# totalPosts
source: {x} Posts
ta: {x} இடுகைகள்

# totp
source: TOTP (optional)
ta: TOTP (விரும்பினால்)

# transferredModToCommunity
source: Transferred Community
ta: மாற்றப்பட்ட சமூகம்

# translationsMayNotBeComplete
source: Please note that the translations may not be complete
ta: மொழிபெயர்ப்புகள் முழுமையடையாது என்பதை நினைவில் கொள்க

source: Trending Communities
ta: பிரபலமான சமூகங்கள்

source: Try searching for...
ta: தேட முயற்சிக்கவும் ...

source: Unable to find community
ta: சமூகத்தைக் கண்டுபிடிக்க முடியவில்லை

# unableToFindCommunityName
source: Unable to find community '{communityName}'
ta: சமூகத்தைக் கண்டுபிடிக்க முடியவில்லை '{communityName}'

# unableToFindCommunityOnInstance
source: Unable to find the selected community on the selected user's instance.
ta: தேர்ந்தெடுக்கப்பட்ட பயனரின் நிகழ்வில் தேர்ந்தெடுக்கப்பட்ட சமூகத்தைக் கண்டுபிடிக்க முடியவில்லை.

source: Unable to find instance
ta: உதாரணத்தைக் கண்டுபிடிக்க முடியவில்லை

source: Unable to find language
ta: மொழியைக் கண்டுபிடிக்க முடியவில்லை

source: Unable to find post
ta: இடுகையைக் கண்டுபிடிக்க முடியவில்லை

source: Unable to find user
ta: பயனரைக் கண்டுபிடிக்க முடியவில்லை

# unableToFindUserName
source: Unable to find user '{username}'
ta: பயனரை '{username}' கண்டுபிடிக்க முடியவில்லை

source: Unable to load image
ta: படத்தை ஏற்ற முடியவில்லை

# unableToLoadImageFrom
source: Unable to load image from {domain}
ta: {domain}

source: Unable to load {instance}
ta: {instance}

source: Unable to load posts from {instance}
ta: {instance} இருந்து இலிருந்து இடுகைகளை ஏற்ற முடியவில்லை

# unableToLoadReplies
source: Unable to load more replies.
ta: மேலும் பதில்களை ஏற்ற முடியவில்லை.

# unableToNavigateToInstance
source: Unable to navigate to {instanceHost}. It may not be a valid Lemmy instance.
ta: {instanceHost} க்கு செல்ல முடியவில்லை. இது செல்லுபடியாகும் லெம்மி நிகழ்வாக இருக்காது.

source: Unable to resolve report
ta: அறிக்கையைத் தீர்க்க முடியவில்லை

# unableToRetrieveChangelog
source: Unable to retrieve changelog for version {version}.
ta: பதிப்பு {version} க்கான மாற்றபதிப்பு மீட்டெடுக்க முடியவில்லை.

source: Unban from Community
ta: சமூகத்திலிருந்து தடையின்றி

source: Unbanned User
ta: தடைசெய்யப்படாத பயனர்

source: Unbanned User from Community
ta: சமூகத்திலிருந்து தடைசெய்யப்படாத பயனர்

source: Unblock Community
ta: சமூகத்தைத் தடைசெய்க

source: Unblock Community Instance
ta: சமூக நிகழ்வைத் தடைசெய்க

source: Unblock Instance
ta: உதாரணத்தைத் தடைசெய்க

source: Unblock User
ta: பயனரைத் தடைசெய்க

source: Unblock User Instance
ta: பயனர் உதாரணத்தைத் தடைசெய்க

# understandEnable
source: I Understand, Enable
ta: எனக்கு புரிகிறது, இயக்கு

source: Unexpected Error
ta: எதிர்பாராத பிழை

source: Unfeatured Post
ta: தயாரிக்கப்படாத இடுகை

source: Unhid Community
ta: உலகளாவிய சமூகம்

source: Unhide
ta: இரக்கமற்றது

# unifiedPushDistributorApp
source: UnifiedPush Distributor app: {app} ({count} available)
ta: UNIFIDEPUSH விநியோகச்தர் பயன்பாடு: {app} ({count} கிடைக்கிறது)

source: UnifiedPush Notifications
ta: ஒருங்கிணைந்த புச் அறிவிப்புகள்

# unifiedPushServer
source: UnifiedPush Server: {server}
ta: UNIFIDEPUSH சேவையகம்: {server}

source: UnifiedPush
ta: UNIFIDEPUSH

source: Unlock Post
ta: இடுகை திறக்க

source: Unlocked Post
ta: திறக்கப்பட்ட இடுகை

source: Unpin from Community
ta: சமூகத்திலிருந்து அவிழ்த்து விடுங்கள்

source: Unpin Post from Community
ta: சமூகத்திலிருந்து இடுக்கையை அவிழ்த்து விடுங்கள்

source: Unreachable
ta: அணுக முடியாதது

source: Unresolved
ta: தீர்க்கப்படாதது

source: Unsubscribe
ta: குழுவிலகவும்

source: Unsubscribe from Community
ta: சமூகத்திலிருந்து குழுவிலகவும்

# unsubscribePending
source: Unsubscribe (subscription pending)
ta: குழுவிலகவும் (சந்தா நிலுவையில் உள்ளது)

source: Unsubscribed
ta: குழுவிலகப்பட்டது

# updateReleased
source: Update released: {version}
ta: புதுப்பிப்பு வெளியிடப்பட்டது: {version}

source: Upload image
ta: படத்தைப் பதிவேற்றவும்

source: Uploaded: {date}
ta: பதிவேற்றப்பட்டது: {date}

source: Upvote
ta: எழுப்பவும்

source: Upvote Color
ta: வண்ணத்தை உயர்த்தவும்

source: Upvoted
ta: மேம்பட்டது

# uriNotSupported
source: This type of link is not supported at the moment.
ta: இந்த வகை இணைப்பு இந்த நேரத்தில் ஆதரிக்கப்படவில்லை.

source: URL
ta: முகவரி

source: Use Advanced Share Sheet
ta: மேம்பட்ட பங்கு தாளைப் பயன்படுத்தவும்

# useApplePushNotifications
source: Use APNs Notifications
ta: APNS அறிவிப்புகளைப் பயன்படுத்தவும்

# useApplePushNotificationsDescription
source: Uses Apple's Push Notification service
ta: ஆப்பிளின் புச் அறிவிப்பு சேவையைப் பயன்படுத்துகிறது

# useCompactView
source: Enable for small posts, disable for big.
ta: சிறிய இடுகைகளுக்கு இயக்கு, பெரியதை முடக்கு.

# useLocalNotifications
source: Use Local Notifications (Experimental)
ta: உள்ளக அறிவிப்புகளைப் பயன்படுத்தவும் (சோதனை)

# useLocalNotificationsDescription
source: Periodically checks for notifications in the background
ta: பின்னணியில் அறிவிப்புகளை அவ்வப்போது சரிபார்க்கிறது

source: Use Material You Theme
ta: நீங்கள் கருப்பொருளைப் பயன்படுத்தவும்

# useMaterialYouThemeDescription
source: Overrides the selected custom theme
ta: தேர்ந்தெடுக்கப்பட்ட தனிப்பயன் கருப்பொருளை மீறுகிறது

source: Use Profile Picture for Drawer
ta: டிராயருக்கு சுயவிவரப் படத்தைப் பயன்படுத்தவும்

# useProfilePictureForDrawerSubtitle
source: When logged in, shows the user's profile picture in place of the drawer icon
ta: உள்நுழையும்போது, டிராயர் ஐகானுக்கு பதிலாக பயனரின் சுயவிவரப் படத்தைக் காட்டுகிறது

# useSuggestedTitle
source: Use suggested title: {title}
ta: பரிந்துரைக்கப்பட்ட தலைப்பைப் பயன்படுத்தவும்: {title}

source: Use UnifiedPush Notifications
ta: ஒருங்கிணைந்த புச் அறிவிப்புகளைப் பயன்படுத்தவும்

# useUnifiedPushNotificationsDescription
source: Requires a compatible app
ta: இணக்கமான பயன்பாடு தேவை

source: User
ta: பயனர்

source: User Actions
ta: பயனர் செயல்கள்

# userEntry
source: User '{username}'
ta: பயனர் '{username}'

source: User Format
ta: பயனர் வடிவம்

# userLabelHint
source: This is my favorite user
ta: இது எனக்கு பிடித்த பயனர்

source: User Labels
ta: பயனர் லேபிள்கள்

# userLabelsSettingsPageDescription
source: You can add, modify, or remove labels associated with users.
ta: பயனர்களுடன் தொடர்புடைய லேபிள்களை நீங்கள் சேர்க்கலாம், மாற்றலாம் அல்லது அகற்றலாம்.

source: User Name Color
ta: பயனர் பெயர் நிறம்

source: User Name Thickness
ta: பயனர் பெயர் தடிமன்

source: User not logged in
ta: பயனர் உள்நுழையவில்லை

source: User Profiles
ta: பயனர் சுயவிவரங்கள்

# userSettingDescription
source: These settings sync with your Lemmy account and are only applied on a per-account basis.
ta: இந்த அமைப்புகள் உங்கள் லெம்மி கணக்குடன் ஒத்திசைக்கப்படுகின்றன, மேலும் அவை ஒரு கணக்கில் மட்டுமே பயன்படுத்தப்படுகின்றன.

source: User Style
ta: பயனர் நடை

source: Username
ta: பயனர்பெயர்

# usernameFormattingRedirect
source: Looking for username formatting?
ta: பயனர்பெயர் வடிவமைப்பைத் தேடுகிறீர்களா?

source: Users
ta: பயனர்கள்

# versionNumber
source: Version {version}
ta: பதிப்பு {version}

source: Video
ta: ஒளிதோற்றம்

# videoAutoFullscreen
source: Auto Fullscreen
ta: ஆட்டோ முழுத்திரை

# videoAutoLoop
source: Loop Video
ta: லூப் வீடியோ

# videoAutoMute
source: Mute Videos
ta: முடக்கு வீடியோக்கள்

source: Video Autoplay
ta: வீடியோ ஆட்டோபிளே

# videoDefaultPlaybackSpeed
source: Default Playback Speed
ta: இயல்புநிலை பின்னணி விரைவு

# videoLinkHandlingExternal
source: Play video with an external app
ta: வெளிப்புற பயன்பாட்டுடன் வீடியோவை இயக்கவும்
