Repository: 247i/TACETr
Catalog: உரை/தானி/thunder-thunder-*.po
Languages: ta

# failedToUnblock
source: Could not unblock: {errorMessage}
ta: தடைசெய்ய முடியவில்லை: {errorMessage}

source: Failed to update notification settings
ta: அறிவிப்பு அமைப்புகளைப் புதுப்பிக்கத் தவறிவிட்டது

source: Favorites
ta: பிடித்தவை

source: Featured Post
ta: பிரத்யேக இடுகை

source: Feed
ta: தீவனம்

# feedBehaviourSettings
source: Feed
ta: தீவனம்

source: Feed Settings
ta: அமைப்புகளுக்கு உணவளிக்கவும்

# feedTypeAndSorts
source: Default Feed Type and Sorting
ta: இயல்புநிலை தீவன வகை மற்றும் வரிசையாக்கம்

# fetchAccountError
source: Could not determine account
ta: கணக்கை தீர்மானிக்க முடியவில்லை

# filteringBy
source: Filtering by {entity}
ta: {entity} மூலம் வடிகட்டுதல்

source: Filters
ta: வடிப்பான்கள்

source: Floating Action Button
ta: மிதக்கும் செயல் பொத்தான்

# floatingActionButtonInformation
source: Thunder has a fully customizable FAB experience that supports a few gestures. - Swipe up to reveal additional FAB actions - Swipe down/up to hide or reveal the FAB To customize the main and secondary actions for the FAB, long press on one of the actions below.
ta: தண்டர் ஒரு சில சைகைகளை ஆதரிக்கும் ஒரு முழுமையான தனிப்பயனாக்கக்கூடிய ஃபேப் அனுபவத்தைக் கொண்டுள்ளது. - கூடுதல் FAB செயல்களை வெளிப்படுத்த ச்வைப் செய்யவும் - ஃபேப்பை மறைக்க அல்லது வெளிப்படுத்த கீழே/மேலே ச்வைப்/மேலே FAB க்கான முக்கிய மற்றும் இரண்டாம் நிலை செயல்களைத் தனிப்பயனாக்க, கீழேயுள்ள செயல்களில் ஒன்றை நீண்ட அழுத்தவும்.

# floatingActionButtonLongPressDescription
source: denotes the FAB's long-press action.
ta: ஃபேப்பின் நீண்டகால செயலாக்கத்தைக் குறிக்கிறது.

# floatingActionButtonSinglePressDescription
source: denotes the FAB's single-press action.
ta: ஃபேப்பின் ஒற்றை-பத்திரிகை செயலைக் குறிக்கிறது.

source: Fonts
ta: எழுத்துருக்கள்

source: Forward
ta: முன்னோக்கி

# foundUnifiedPushDistribtorApp
source: Found compatible app; restart Thunder to connect
ta: இணக்கமான பயன்பாட்டைக் கண்டறிந்தது; இணைக்க தண்டரை மறுதொடக்கம் செய்யுங்கள்

# fullScreenNavigationSwipeDescription
source: Swipe anywhere to go back when left-to-right gestures are disabled
ta: இடமிருந்து வலமாக சைகைகள் முடக்கப்பட்டிருக்கும் போது திரும்பிச் செல்ல எங்கும் ச்வைப் செய்யவும்

source: Fullscreen Swipe Gestures
ta: முழுத்திரை ச்வைப் சைகைகள்

source: General
ta: பொது

source: General Settings
ta: பொது அமைப்புகள்

source: Gestures
ta: சைகைகள்

source: Getting Started
ta: தொடங்குதல்

source: Green
ta: பச்சை

source: Guest Mode Feed Settings
ta: விருந்தினர் பயன்முறை தீவன அமைப்புகள்

# guestModeFeedSettingsLabel
source: The following settings are only applied to guest accounts. To adjust feed settings for your account, go to Account Settings.
ta: பின்வரும் அமைப்புகள் விருந்தினர் கணக்குகளுக்கு மட்டுமே பயன்படுத்தப்படுகின்றன. உங்கள் கணக்கிற்கான ஊட்ட அமைப்புகளை சரிசெய்ய, கணக்கு அமைப்புகளுக்குச் செல்லவும்.

source: Having issues with notifications?
ta: அறிவிப்புகளில் சிக்கல்கள் உள்ளதா?

source: Hid Community
ta: மறை சமூகம்

source: Hidden
ta: மறைக்கப்பட்ட

source: Hide
ta: மறை

source: Hide Color
ta: நிறத்தை மறைக்கவும்

source: Hide NSFW Posts from Feed
ta: ஊட்டத்திலிருந்து NSFW இடுகைகளை மறைக்கவும்

# hideNsfwPreviews
source: Blur NSFW Previews
ta: மங்கலான NSFW முன்னோட்டங்கள்

source: Hide Password
ta: கடவுச்சொல்லை மறைக்கவும்

source: Hide Thumbnails
ta: சிறு உருவங்களை மறைக்கவும்

source: Hide Top Bar on Scroll
ta: சுருளில் மேல் பட்டியை மறைக்கவும்

source: Host Instance
ta: புரவலன் நிகழ்வு

source: Hot
ta: சூடான

source: Image
ta: படம்

source: Image Caching Mode
ta: பட கேச்சிங் பயன்முறை

# imageCachingModeAggressive
source: Aggressively cache images (uses more memory)
ta: படங்களை ஆக்ரோசமாக கேச் (அதிக நினைவகத்தைப் பயன்படுத்துகிறது)

# imageCachingModeAggressiveShort
source: Aggressive
ta: வன்கவர்வு

# imageCachingModeRelaxed
source: Let image caches expire (uses less memory but causes images to reload more often)
ta: பட தற்காலிக சேமிப்புகள் காலாவதியாகட்டும் (குறைந்த நினைவகத்தைப் பயன்படுத்துகிறது, ஆனால் படங்களை அடிக்கடி மீண்டும் ஏற்றுகிறது)

# imageCachingModeRelaxedShort
source: Relaxed
ta: நிதானமாக

source: Image Dimension Timeout
ta: பட பரிமாண நேரம் முடிந்தது

source: Import Database
ta: தரவுத்தளத்தை இறக்குமதி செய்யுங்கள்

# importExportDatabase
source: Import/Export Thunder Database
ta: தண்டர் தரவுத்தளத்தை இறக்குமதி/ஏற்றுமதி செய்யுங்கள்

source: Import/Export Lemmy Account Settings
ta: லெம்மி கணக்கு அமைப்புகளை இறக்குமதி/ஏற்றுமதி செய்யுங்கள்

# importExportLemmyAccountSettingsSubtitle
source: Includes subscribed communities, blocklists, and account preferences
ta: சந்தா சமூகங்கள், தடுப்புப்பட்டிகள் மற்றும் கணக்கு விருப்பத்தேர்வுகள் அடங்கும்

source: Import/Export Settings
ta: இறக்குமதி/ஏற்றுமதி அமைப்புகள்

source: Import/Export Thunder Settings
ta: தண்டர் அமைப்புகளை இறக்குமதி/ஏற்றுமதி செய்யுங்கள்

# importLemmyAccountSettingsDescription
source: Import Lemmy account settings
ta: லெம்மி கணக்கு அமைப்புகளை இறக்குமதி செய்யுங்கள்

source: Import Settings
ta: அமைப்புகளை இறக்குமதி செய்யுங்கள்

# inReplyTo
source: In reply to {post} in {community}
ta: {community}இல் {post}இதற்குப் பதிலளிக்கும் விதமாக

source: in
ta: இல்

source: Inbox
ta: இன்பாக்ச்

source: Include Community
ta: சமூகத்தைச் சேர்க்கவும்

source: Include External Link
ta: வெளிப்புற இணைப்பைச் சேர்க்கவும்

source: Include Image
ta: படத்தைச் சேர்க்கவும்

source: Include Post Link
ta: இடுகை இணைப்பு சேர்க்கவும்

source: Include Text
ta: உரை சேர்க்கவும்

source: Include Title
ta: தலைப்பு சேர்க்கவும்

source: Information
ta: தகவல்

# instance
source: {count, plural, zero {Instance} one {Instance} other {Instances} }
ta: {count, plural, zero {நிகழ்வு} one {நிகழ்வு} other {நிகழ்வுகள்} }

source: Instance Actions
ta: நிகழ்வு செயல்கள்

# instanceEntry
source: Instance '{username}'
ta: சான்று '{username}'

# instanceHasAlreadyBenAdded
source: {instance} has already been added.
ta: {instance} ஏற்கனவே சேர்க்கப்பட்டுள்ளது.

source: Instance Name Color
ta: உதாரணத்தின் பெயர் நிறம்

source: Instance Name Thickness
ta: உதாரணத்தின் பெயர் தடிமன்

source: Instances
ta: நிகழ்வுகள்

# internetOrInstanceIssues
source: You may not be connected to the Internet, or your instance may be currently unavailable.
ta: நீங்கள் இணையத்துடன் இணைக்கப்படாமல் இருக்கலாம், அல்லது உங்கள் நிகழ்வு தற்போது கிடைக்காமல் இருக்கலாம்.

# joined
source: Joined {x}
ta: {x} இல் சேர்ந்தார்

# keywordFilterDescription
source: Filters posts containing any keywords in the title, body, or URL
ta: தலைப்பு, உடல் அல்லது முகவரி இல் ஏதேனும் முக்கிய வார்த்தைகளைக் கொண்ட இடுகைகளை வடிகட்டுகிறது

source: Keyword Filters
ta: முக்கிய வடிப்பான்கள்

source: Label
ta: சிட்டை

source: Language
ta: மொழி

# languageFilters
source: Looking for language filters?
ta: மொழி வடிப்பான்களைத் தேடுகிறீர்களா?

# languageNotAllowed
source: The community you are posting to does not allow posts in the language that you have selected. Try another language.
ta: நீங்கள் இடுகையிடும் சமூகம் நீங்கள் தேர்ந்தெடுத்த மொழியில் இடுகைகளை அனுமதிக்காது. வேறு மொழியை முயற்சிக்கவும்.

source: Large
ta: பெரிய

source: Left Long Swipe
ta: இடது நீண்ட ச்வைப்

source: Left Short Swipe
ta: இடது குறுகிய ச்வைப்

source: Light
ta: ஒளி

# link
source: {count, plural, zero {Link} one {Link} other {Links} }
ta: {count, plural, zero {இணைப்பு} one {இணைப்பு} other {இணைப்புகள்} }

source: Link Actions
ta: இணைப்பு செயல்கள்

# linkHandlingCustomTabs
source: Open in system browser embedded in-app
ta: பயன்பாட்டில் உட்பொதிக்கப்பட்ட கணினி உலாவியில் திறக்கவும்

# linkHandlingCustomTabsShort
source: In-app embedded
ta: பயன்பாட்டில் உட்பொதிக்கப்பட்டது

# linkHandlingExternal
source: Open in system browser externally
ta: கணினி உலாவியில் வெளிப்புறமாக திறக்கவும்

# linkHandlingExternalShort
source: External
ta: வெளிப்புறம்

# linkHandlingInApp
source: Use Thunder's built-in browser
ta: தண்டரின் உள்ளமைக்கப்பட்ட உலாவியைப் பயன்படுத்தவும்

# linkHandlingInAppShort
source: In-app
ta: பயன்பாட்டில்

# linksBehaviourSettings
source: Links
ta: இணைப்புகள்

# loadMorePlural
source: Load {count} more replies…
ta: {count} மேலும் பதில்களை ஏற்றவும்…

# loadMoreSingular
source: Load {count} more reply…
ta: ஏற்றவும் {count} மேலும் பதில்…

source: Loading...
ta: ஏற்றுகிறது ...

source: Local
ta: உள்ளக

source: Local Notifications
ta: உள்ளக அறிவிப்புகள்

source: Local Only
ta: உள்ளக மட்டும்

source: Local Posts
ta: உள்ளக இடுகைகள்

source: Lock Post
ta: பூட்டு இடுகை

source: Locked
ta: பூட்டப்பட்டுள்ளது

source: Locked Post
ta: பூட்டப்பட்ட இடுகை

source: Log out
ta: விடுபதிகை

source: Log in
ta: புகுபதிகை

source: Login attempt canceled.
ta: உள்நுழைவு முயற்சி ரத்து செய்யப்பட்டது.

# loginFailed
source: Could not log in. Please try again. (Error: {errorMessage})
ta: உள்நுழைய முடியவில்லை. தயவுசெய்து மீண்டும் முயற்சிக்கவும். (பிழை: {errorMessage})

# loginSucceeded
source: Logged in.
ta: உள்நுழைந்தது.

# loginToPerformAction
source: You need to be logged in to carry out this task.
ta: இந்த பணியைச் செய்ய நீங்கள் உள்நுழைய வேண்டும்.

# loginToSeeInbox
source: Log in to see your inbox
ta: உங்கள் இன்பாக்சைப் பார்க்க உள்நுழைக

source: Looking for account-specific feed settings?
ta: கணக்கு-குறிப்பிட்ட ஊட்ட அமைப்புகளைத் தேடுகிறீர்களா?

# malformedUri
source: The link you provided is in an unsupported format. Please make sure it's a valid link.
ta: நீங்கள் வழங்கிய இணைப்பு ஆதரிக்கப்படாத வடிவத்தில் உள்ளது. இது சரியான இணைப்பு என்பதை உறுதிப்படுத்தவும்.

source: Manage Accounts
ta: கணக்குகளை நிர்வகிக்கவும்

source: Manage Media
ta: மீடியாவை நிர்வகிக்கவும்

source: Mark all as read
ta: அனைத்தையும் படித்தபடி குறிக்கவும்

source: Mark as read
ta: படித்தபடி குறி

# markPostAsReadOnMediaView
source: Mark Read After Viewing Media
ta: மீடியாவைப் பார்த்த பிறகு மார்க் படித்தார்

# markPostAsReadOnScroll
source: Mark Read On Scroll
ta: சுருளில் மார்க் படித்தார்

# markReadColor
source: Mark Read/Unread Color
ta: மார்க் படிக்க/படிக்காத வண்ணம்

source: Matrix User
ta: அணி பயனர்

source: Me
ta: நான்

source: Medium
ta: சராசரி

# mention
source: {count, plural, zero {Mention} one {Mention} other {Mentions} }
ta: {count, plural, zero {குறிப்பிடு} one {குறிப்பிடு} other {குறிப்பிடுகள்} }

source: Menu
ta: பட்டியல்

# message
source: {count, plural, zero {Message} one {Message} other {Messages} }
ta: {count, plural, zero {செய்தி} one {செய்தி} other {செய்திகள்} }

source: Metadata Font Scale
ta: மேனிலை தரவு எழுத்துரு அளவு

# missingErrorMessage
source: No error message available
ta: பிழை செய்தி எதுவும் கிடைக்கவில்லை

# modAdd
source: Add/Remove Instance Moderators
ta: நிகழ்வு மதிப்பீட்டாளர்களைச் சேர்க்கவும்/அகற்றவும்

# modAddCommunity
source: Add/Remove Moderators to Communities
ta: சமூகங்களில் மதிப்பீட்டாளர்களைச் சேர்க்கவும்/அகற்றவும்

# modBan
source: Ban/Unban Instance Users
ta: தடை/தடைசெய்யும் பயனர்கள்

# modBanFromCommunity
source: Ban/Unban Users from Communities
ta: சமூகங்களைச் சேர்ந்த பயனர்களை தடை/தடைசெய்யவும்

# modFeaturePost
source: Feature/Unfeature Posts
ta: அம்சம்/அவிழ்க்கப்படாத இடுகைகள்

# modLockPost
source: Lock/Unlock Posts
ta: இடுகைகளை பூட்டவும்/திறக்கவும்

# modRemoveComment
source: Remove/Restore Comments
ta: கருத்துகளை அகற்று/மீட்டமைக்கவும்

# modRemoveCommunity
source: Remove/Restore Communities
ta: சமூகங்களை அகற்றவும்/மீட்டெடுக்கவும்

# modRemovePost
source: Remove/Restore Posts
ta: இடுகைகளை அகற்று/மீட்டமைக்கவும்

# modTransferCommunity
source: Transferring Communities
ta: சமூகங்களை மாற்றுதல்

source: Moderated Communities
ta: மிதமான சமூகங்கள்

source: Moderates
ta: மிதவாதிகள்

# moderator
source: {count, plural, zero {Moderator} one {Moderator} other {Moderators}}
ta: {count, plural, zero {மதிப்பீட்டாளர்} one {மதிப்பீட்டாளர்} other {மதிப்பீட்டாளர்கள்}}

source: Moderator Actions
ta: மதிப்பீட்டாளர் செயல்கள்

source: Modlog
ta: மோட்லாக்

source: Most Comments
ta: பெரும்பாலான கருத்துகள்

# mustBeLoggedIn
source: You need to be logged in
ta: நீங்கள் உள்நுழைய வேண்டும்

# mustBeLoggedInComment
source: You need to be logged in to comment
ta: கருத்து தெரிவிக்க நீங்கள் உள்நுழைந்திருக்க வேண்டும்

# mustBeLoggedInPost
source: You need to be logged in to create a post
ta: ஒரு இடுகையை உருவாக்க நீங்கள் உள்நுழைய வேண்டும்

source: Names
ta: பெயர்கள்

source: Navbar Double Tap Gestures
ta: NAVBAR இரட்டை தட்டு சைகைகள்

source: Navbar Swipe Gestures
ta: நவ்பர் ச்வைப் சைகைகள்

# navigateDown
source: Next comment
ta: அடுத்த கருத்து

# navigateUp
source: Previous comment
ta: முந்தைய கருத்து

source: Navigation
ta: வானோடல்

source: Nested Comment Indicator Color
ta: உள்ளமைக்கப்பட்ட கருத்து காட்டி நிறம்

source: Nested Comment Indicator Style
ta: உள்ளமைக்கப்பட்ட கருத்து காட்டி பாணி

source: Never
ta: ஒருபோதும்

source: New Comments
ta: புதிய கருத்துகள்

source: New Post
ta: புதிய இடுகை

source: New
ta: புதிய

source: No
ta: இல்லை

# noAccountsAdded
source: No accounts have been added
ta: கணக்குகள் எதுவும் சேர்க்கப்படவில்லை

# noAnonymousInstances
source: No anonymous instances have been added
ta: அநாமதேய நிகழ்வுகள் எதுவும் சேர்க்கப்படவில்லை

source: No comments found
ta: எந்தக் கருத்தும் கிடைக்கவில்லை

source: No communities found
ta: எந்த சமூகங்களும் கிடைக்கவில்லை

# noCommunityBlocks
source: No blocked communities
ta: தடுக்கப்பட்ட சமூகங்கள் இல்லை

source: No compatible app found
ta: இணக்கமான பயன்பாடு எதுவும் கிடைக்கவில்லை

# noDiscussionLanguages
source: No content is hidden based on language.
ta: மொழியின் அடிப்படையில் எந்த உள்ளடக்கமும் மறைக்கப்படவில்லை.

source: No display name set
ta: காட்சி பெயர் தொகுப்பு இல்லை

source: No email set
ta: மின்னஞ்சல் தொகுப்பு இல்லை

source: No favorited communities
ta: பிடித்த சமூகங்கள் இல்லை

# noImages
source: It looks like you have not uploaded any images.
ta: நீங்கள் எந்த படங்களையும் பதிவேற்றவில்லை என்று தெரிகிறது.

# noInstanceBlocks
source: No blocked instances.
ta: தடுக்கப்பட்ட நிகழ்வுகள் இல்லை.

source: No items
ta: உருப்படிகள் இல்லை

# noKeywordFilters
source: No keyword filters added
ta: முக்கிய வடிப்பான்கள் எதுவும் சேர்க்கப்படவில்லை

source: No language
ta: மொழி இல்லை

source: No matrix user set
ta: மேட்ரிக்ச் பயனர் தொகுப்பு இல்லை

source: No mentions
ta: குறிப்புகள் இல்லை

source: No messages
ta: செய்திகள் இல்லை

source: No posts found.
ta: இடுகைகள் எதுவும் கிடைக்கவில்லை.

source: No profile bio set
ta: சுயவிவர உயிர் தொகுப்பு இல்லை

# noReferencesToImage
source: No posts or comments were found containing this image. However, it may be used elsewhere on the internet.
ta: இந்த படத்தைக் கொண்ட இடுகைகள் அல்லது கருத்துகள் எதுவும் காணப்படவில்லை. இருப்பினும், இது இணையத்தில் வேறு எங்கும் பயன்படுத்தப்படலாம்.

source: No replies
ta: பதில்கள் இல்லை

source: No results found.
ta: முடிவுகள் எதுவும் கிடைக்கவில்லை.

source: No Subscriptions
ta: சந்தாக்கள் இல்லை

# noUserBlocks
source: No blocked users.
ta: தடுக்கப்பட்ட பயனர்கள் இல்லை.

# noUserLabels
source: You have not created any user labels yet
ta: நீங்கள் இதுவரை எந்த பயனர் லேபிள்களையும் உருவாக்கவில்லை

source: No users found.
ta: பயனர்கள் எதுவும் கிடைக்கவில்லை.

source: None
ta: எதுவுமில்லை

source: Normal
ta: சாதாரண

# notValidLemmyInstance
source: {instance} does not appear to be a valid Lemmy instance
ta: {instance} செல்லுபடியாகும் லெம்மி உதாரணமாகத் தெரியவில்லை

# notValidUrl
source: Not a valid URL
ta: செல்லுபடியாகும் முகவரி அல்ல

source: Nothing to share
ta: பகிர எதுவும் இல்லை

# notifications
source: {count, plural, zero {Notification} one {Notifications} other {Notifications}}
ta: {count, plural, zero {அறிவிப்பு} one {அறிவிப்பு} other {அறிவிப்புகள்}}

# notificationsBehaviourSettings
source: Notifications
ta: அறிவிப்புகள்

# notificationsNotAllowed
source: Notifications are not allowed for Thunder in system settings
ta: கணினி அமைப்புகளில் இடிக்கு அறிவிப்புகள் அனுமதிக்கப்படவில்லை

# notificationsWarningDialog
source: Notifications are an **experimental feature** which may not function correctly on all devices. - Checks will occur every ~15 minutes and will consume additional battery. - Disable battery optimizations for a higher likelihood of successful notifications. See the following page for more information.
ta: அறிவிப்புகள் ஒரு ** சோதனை அம்சமாகும் ** இது எல்லா சாதனங்களிலும் சரியாக செயல்படாது. - ஒவ்வொரு ~ 15 நிமிடங்களுக்கும் காசோலைகள் நிகழும், மேலும் கூடுதல் பேட்டரியை உட்கொள்ளும். - வெற்றிகரமான அறிவிப்புகளின் அதிக சாத்தியக்கூறுகளுக்கு பேட்டரி மேம்படுத்தல்களை முடக்கு. மேலும் தகவலுக்கு பின்வரும் பக்கத்தைப் பார்க்கவும்.

# nsfwWarning
source: NSFW - Tap to reveal
ta: NSFW - வெளிப்படுத்த தட்டவும்

source: off
ta: அணை

source: offline
ta: இணையமில்லாமல்

source: OK
ta: சரி

source: Old
ta: பழைய

source: on
ta: ஆன்

source: On Wifi
ta: வைஃபை மீது

# onlyModsCanPostInCommunity
source: Only moderators may post in this community
ta: இந்த சமூகத்தில் மதிப்பீட்டாளர்கள் மட்டுமே இடுகையிடலாம்

source: Open
ta: திற

source: Open account switcher
ta: கணக்கு ச்விட்சர் திறக்கவும்

source: Open by default
ta: இயல்பாக திறக்கவும்

source: Open in Browser
ta: உலாவியில் திற

source: Open Instance
ta: திறந்த நிகழ்வு

source: Open Links in External Browser
ta: வெளிப்புற உலாவியில் இணைப்புகளைத் திறக்கவும்

source: Open Links in Reader Mode
ta: வாசகர் பயன்முறையில் இணைப்புகளைத் திறக்கவும்

source: Open Settings
ta: திறந்த அமைப்புகள்

source: Orange
ta: ஆரஞ்சு

source: Original Poster
ta: அசல் சுவரொட்டி

source: Overview
ta: கண்ணோட்டம்

source: Password
ta: கடவுச்சொல்

source: Pending
ta: நிலுவையில் உள்ளது

# permissionDenied
source: Thunder has not been granted permission to display notifications. Please enable in system settings.
ta: அறிவிப்புகளைக் காண்பிக்க தண்டருக்கு இசைவு வழங்கப்படவில்லை. கணினி அமைப்புகளில் இயக்கவும்.

# permissionDeniedMessage
source: Thunder requires some permissions in order to save this image which have been denied.
ta: மறுக்கப்பட்ட இந்த படத்தை சேமிக்க தண்டருக்கு சில அனுமதிகள் தேவை.

source: Pin Post to Community
ta: சமூகத்திற்கு முள் இடுகை

source: Pin to Community
ta: சமூகத்திற்கு முள்

source: Pinned
ta: குத்திவைக்கப்பட்டது

# placeholderText
source: Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.
ta: லோரெம் மிகவும் கேரட், தக்காளி இளங்கலை உருவாக்குபவர், ஆனால் நான் ஒரு இன்கோடில் இருப்பேன், ஒரு சிறந்த நேரத்தின் வலி. ஒரு விசித்திரமான மன்னிப்பைச் செய்வதற்காக, உல்லாம்கோ வேலையை அவர் பயன்படுத்துகிறார், இதன் விளைவாக வசதியின் அலிகிபிப் தவிர. வீட்டுப்பாடம் அல்லது விமர்சிக்கப்பட்ட இன்பத்தில் வலி ஏற்பட்ட வலி ஒரு இணை வலி கால்பந்து தப்பிக்கும். தவிர, அவர்கள் செய்ய ஆர்வமுள்ள கண்மூடித்தனமானவர்கள், சேவைகள் தின்பண்டங்கள் என்ற ஆன்மாவை கைவிடுகின்றன என்பதில் அவர்கள் தவறு செய்கிறார்கள்.

source: Post
ta: இடுகை

source: Post Actions
ta: செயல்கள் இடுகை

# postBehaviourSettings
source: Posts
ta: இடுகைகள்

source: Post Body
ta: போச்ட் உடல்

source: Post Body Settings
ta: உடல் அமைப்புகளை இடுகையிடவும்

# postBodySettingsDescription
source: These settings affect the display of the post body
ta: இந்த அமைப்புகள் பிந்தைய உடலின் காட்சியை பாதிக்கின்றன

# postBodyShowCommunityInstance
source: Show Community Instance
ta: சமூக நிகழ்வைக் காட்டு

# postBodyShowUserInstance
source: Show User Instance
ta: பயனர் உதாரணத்தைக் காட்டு

source: Post Body View Type
ta: உடல் பார்வை வகை

source: Post Content Font Scale
ta: உள்ளடக்க எழுத்துரு அளவை இடுங்கள்

source: Post created successfully!
ta: இடுகை வெற்றிகரமாக உருவாக்கப்பட்டது!

# postLocked
source: Post locked. No replies allowed.
ta: இடுகை பூட்டப்பட்டுள்ளது. பதில்கள் எதுவும் அனுமதிக்கப்படவில்லை.

# postMetadataInstructions
source: You can customize the metadata information by dragging and dropping the desired information
ta: விரும்பிய தகவல்களை இழுத்து கைவிடுவதன் மூலம் மேனிலை தரவு தகவல்களைத் தனிப்பயனாக்கலாம்

# postNSFW
source: Mark as NSFW
ta: NSFW ஆக குறிக்கவும்

# postPreview
source: Show a preview of the post with the given settings
ta: கொடுக்கப்பட்ட அமைப்புகளுடன் இடுகையின் முன்னோட்டத்தைக் காட்டு

source: Post saved as draft
ta: இடுகை வரைவாக சேமிக்கப்பட்டது

# postShowUserInstance
source: Show User Instance
ta: பயனர் உதாரணத்தைக் காட்டு

source: Post Swipe Actions
ta: இடுகை ச்வைப் செயல்கள்

# postSwipeGesturesHint
source: Looking to use buttons instead? Change what buttons appear on post cards in general settings.
ta: அதற்கு பதிலாக பொத்தான்களைப் பயன்படுத்த விரும்புகிறீர்களா? பொது அமைப்புகளில் தபால் அட்டைகளில் பொத்தான்கள் தோன்றுவதை மாற்றவும்.

# postTitle
source: Title
ta: தலைப்பு

source: Post Title Font Scale
ta: தலைப்பு எழுத்துரு அளவை இடுங்கள்

# postTogglePreview
source: Toggle Preview
ta: முன்னோட்டத்தை மாற்றவும்

# postURL
source: URL
ta: முகவரி

# postUploadImageError
source: Could not upload image
ta: படத்தை பதிவேற்ற முடியவில்லை

source: Post View Type
ta: பார்வை வகை

source: Posts
ta: இடுகைகள்

source: Preview
ta: முன்னோட்டம்

source: {profile} applied successfully!
ta: {profile} வெற்றிகரமாக பயன்படுத்தப்படுகிறது!

source: Profile Bio
ta: சுயவிவர உயிர்

source: Profiles
ta: சுயவிவரங்கள்

source: Public
ta: பொது

source: Pure Black
ta: தூய கருப்பு

source: Purged Comment
ta: சுத்திகரிக்கப்பட்ட கருத்து

source: Purged Community
ta: தூய்மைப்படுத்தப்பட்ட சமூகம்

source: Purged Person
ta: சுத்திகரிக்கப்பட்ட நபர்

source: Purged Post
ta: சுத்திகரிக்கப்பட்ட இடுகை

source: Purple
ta: ஊதா

# pushNotification
source: Push Notifications
ta: அறிவிப்புகளை அழுத்தவும்

# pushNotificationDescription
source: If enabled, Thunder will send your JWT token(s) to the server in order to poll for new notifications. **NOTE:** This will not take effect until the next time the app is launched.
ta: இயக்கப்பட்டால், புதிய அறிவிப்புகளுக்கு வாக்கெடுப்பு செய்வதற்காக தண்டர் உங்கள் JWT கிள்ளாக்கை (களை) சேவையகத்திற்கு அனுப்பும். ** குறிப்பு: ** பயன்பாடு தொடங்கப்படும் வரை இது நடைமுறைக்கு வராது.

source: Push Notification Server
ta: அறிவிப்பு சேவையகத்தை அழுத்தவும்

# pushNotificationServerDescription
source: Configure the push notification server. The server must be properly configured to send push notifications to your device. **Only enter a server that you trust with your credentials.**
ta: புச் அறிவிப்பு சேவையகத்தை உள்ளமைக்கவும். உங்கள் சாதனத்திற்கு புச் அறிவிப்புகளை அனுப்ப சேவையகம் சரியாக கட்டமைக்கப்பட வேண்டும். ** உங்கள் சான்றுகளுடன் நீங்கள் நம்பும் சேவையகத்தை மட்டும் உள்ளிடவும். **

# rateLimitErrorMessage
source: You have hit the rate limit for this request. Please wait and try again later.
ta: இந்த கோரிக்கைக்கான விகித வரம்பை நீங்கள் தாக்கியுள்ளீர்கள். தயவுசெய்து காத்திருந்து பின்னர் மீண்டும் முயற்சிக்கவும்.

# reachedTheBottom
source: No more items to load
ta: ஏற்ற இன்னும் உருப்படிகள் இல்லை

source: Read
ta: படிக்க

source: Read All
ta: அனைத்தையும் படியுங்கள்

source: Reader mode
ta: வாசகர் பயன்முறை

source: Reason
ta: காரணம்

source: Red
ta: சிவப்பு

source: Reduce Animations
ta: அனிமேசன்களைக் குறைக்கவும்

# reducesAnimations
source: Reduces the animations used within Thunder
ta: தண்டருக்குள் பயன்படுத்தப்படும் அனிமேசன்களைக் குறைக்கிறது

source: Refresh
ta: புதுப்பிப்பு

source: Refresh Content
ta: உள்ளடக்கத்தைப் புதுப்பிக்கவும்

source: Removal Reason
ta: அகற்றுதல் காரணம்

source: Remove
ta: அகற்று

source: Remove Account
ta: கணக்கை அகற்று

source: Remove as Community Moderator
ta: சமூக மதிப்பீட்டாளராக அகற்று

source: Remove Comment
ta: கருத்தை அகற்று

source: Remove from favorites
ta: பிடித்தவைகளிலிருந்து அகற்று

source: Remove instance
ta: உதாரணத்தை அகற்று

source: Remove "{keyword}"?
ta: "{keyword}" ஐ அகற்றவா?

# removeKeywordFilter
source: Remove Keyword
ta: முக்கிய சொல்லை அகற்று

source: Remove Post
ta: இடுகையை அகற்று

source: Removed
ta: அகற்றப்பட்டது

source: Removed Comment
ta: அகற்றப்பட்ட கருத்து

source: Removed Community
ta: அகற்றப்பட்ட சமூகம்

# removedCommunityFromSubscriptions
source: Unsubscribed from community
ta: சமூகத்திலிருந்து குழுவிலகப்படாதது

source: Removed Instance Mod
ta: அகற்றப்பட்ட நிகழ்வு மோட்

source: Removed Mod from Community
ta: சமூகத்திலிருந்து மோட் அகற்றப்பட்டது

source: Removed Post
ta: அகற்றப்பட்ட இடுகை

source: Reorder
ta: மறுவரிசை
