Repository: 247i/TACETr
Catalog: உரை/தானி/thunder-thunder-*.po
Languages: ta

source: About
ta: பற்றி

source: Accept
ta: ஏற்றுக்கொள்

source: Accessibility
ta: அணுகல்

# accessibilityProfilesDescription
source: Accessibility profiles allows applying several settings at once to accommodate a particular accessibility requirement.
ta: அணுகல் சுயவிவரங்கள் ஒரு குறிப்பிட்ட அணுகல் தேவைக்கு ஏற்ப பல அமைப்புகளை ஒரே நேரத்தில் பயன்படுத்த அனுமதிக்கிறது.

# account
source: {count, plural, zero {Account} one {Account} other {Accounts} }
ta: {count, plural, zero {Account} one {கணக்கு} other {கணக்குகள்} }

# accountBirthday
source: Account Birthday {additionalInfo}
ta: கணக்கு பிறந்த நாள் {additionalInfo}

# accountSettingOverrideWarning
source: Your account settings override the following settings
ta: உங்கள் கணக்கு அமைப்புகள் பின்வரும் அமைப்புகளை மீறுகின்றன

source: Account Settings
ta: கணக்கு அமைப்புகள்

# accountSettingsExportedSuccessfully
source: Lemmy account settings exported successfully to {savedFilePath}!
ta: லெம்மி கணக்கு அமைப்புகள் வெற்றிகரமாக {savedFilePath} க்கு ஏற்றுமதி செய்யப்பட்டன!

# accountSettingsImportedSuccessfully
source: Lemmy account settings imported successfully!
ta: லெம்மி கணக்கு அமைப்புகள் வெற்றிகரமாக இறக்குமதி செய்யப்படுகின்றன!

# accountSwitchParentCommentNotFound
source: The selected comment was not found on '{instance}'. Switching back to previous account.
ta: தேர்ந்தெடுக்கப்பட்ட கருத்து '{instance}' இல் காணப்படவில்லை. முந்தைய கணக்கிற்கு மாறுகிறது.

# accountSwitchPostNotFound
source: The selected post was not found on '{instance}'. Switching back to previous account.
ta: தேர்ந்தெடுக்கப்பட்ட இடுகை '{instance}' இல் காணப்படவில்லை. முந்தைய கணக்கிற்கு மாறுகிறது.

source: Action Colors
ta: செயல் வண்ணங்கள்

# actionColorsRedirect
source: Looking to customize colors?
ta: வண்ணங்களைத் தனிப்பயனாக்க விரும்புகிறீர்களா?

source: Actions
ta: செயல்கள்

source: Active
ta: செயலில்

source: Activity
ta: செய்கைப்பாடு

source: Add
ta: கூட்டு

source: Add Account
ta: கணக்கைச் சேர்க்கவும்

# addAccountToSeeProfile
source: Log in to see your account.
ta: உங்கள் கணக்கைக் காண உள்நுழைக.

source: Add Anonymous Instance
ta: அநாமதேய நிகழ்வைச் சேர்க்கவும்

source: Add as Community Moderator
ta: சமூக மதிப்பீட்டாளராகச் சேர்க்கவும்

# addDiscussionLanguage
source: Add Language
ta: மொழியைச் சேர்க்கவும்

# addKeywordFilter
source: Add Keyword
ta: முக்கிய சொல்லைச் சேர்க்கவும்

source: Add to favorites
ta: பிடித்தவைகளில் சேர்க்கவும்

source: Add User Label
ta: பயனர் லேபிளைச் சேர்க்கவும்

# addedCommunityToSubscriptions
source: Subscribed to community
ta: சமூகத்திற்கு குழுசேர்ந்தது

source: Added Instance Mod
ta: நிகழ்வு மோட் சேர்க்கப்பட்டது

source: Added Mod to Community
ta: சமூகத்திற்கு மோட் சேர்க்கப்பட்டது

source: Admin
ta: நிர்வாகி

source: Advanced
ta: மேம்பட்ட

# ago
source: {time} ago
ta: {time} முன்பு

source: All
ta: அனைத்தும்

source: All Posts
ta: அனைத்து இடுகைகளும்

# allowOpenSupportedLinks
source: Allow app to open supported links.
ta: உதவி இணைப்புகளைத் திறக்க பயன்பாட்டை அனுமதிக்கவும்.

source: Already posted to
ta: ஏற்கனவே இடுகையிடப்பட்டது

source: Alt Text
ta: மாற்று உரை

source: Alternate Sources
ta: மாற்று ஆதாரங்கள்

source: Always
ta: எப்போதும்

# andXMore
source: and {count} more
ta: மேலும் {count} மேலும்

source: Animations
ta: அனிமேசன்கள்

source: Anonymous
ta: அநாமதேய

source: Anonymous Instances
ta: அநாமதேய நிகழ்வுகள்

source: App Language
ta: பயன்பாட்டு மொழி

source: Appearance
ta: தோற்றம்

source: Apple Push Notification Service
ta: ஆப்பிள் புச் அறிவிப்பு பணி

source: Applied
ta: பயன்படுத்தப்பட்டது

source: Apply
ta: இடு

# areNotificationsAllowedBySystem
source: Notifications are allowed by system: {yesOrNo}
ta: அறிவிப்புகள் கணினி மூலம் அனுமதிக்கப்படுகின்றன: {yesOrNo}

# averageComments
source: {x} comments/month
ta: {x} கருத்துகள்/மாதம்

# averageContributions
source: {x} contributions/month
ta: {x} பங்களிப்புகள்/மாதம்

# averagePosts
source: {x} posts/month
ta: {x} இடுகைகள்/மாதம்

source: Back
ta: பின்

source: Back button
ta: பின் பொத்தான்

source: Back To Top
ta: மீண்டும் மேலே

# backgroundCheckWarning
source: Note that notification checks will consume additional battery
ta: அறிவிப்பு காசோலைகள் கூடுதல் பேட்டரியை நுகரும் என்பதை நினைவில் கொள்க

source: Ban from Community
ta: சமூகத்திலிருந்து தடை

source: Banned User
ta: தடைசெய்யப்பட்ட பயனர்

source: Banned User from Community
ta: சமூகத்திலிருந்து தடைசெய்யப்பட்ட பயனர்

source: Base
ta: காரம்

source: Block Community
ta: தொகுதி சமூகம்

source: Block Community Instance
ta: சமூக உதாரணத்தைத் தடுக்கும்

source: Block Instance
ta: தொகுதி நிகழ்வு

source: Block Management
ta: தொகுதி மேலாண்மை

# blockSettingLabel
source: User/Community/Instance Blocks
ta: பயனர்/சமூகம்/நிகழ்வு தொகுதிகள்

source: Block User
ta: தொகுதி பயனர்

source: Block User Instance
ta: பயனர் உதாரணத்தைத் தடுக்கும்

source: Blocked Communities
ta: தடுக்கப்பட்ட சமூகங்கள்

source: Blocked Instances
ta: தடுக்கப்பட்ட நிகழ்வுகள்

source: Blocked Users
ta: தடுக்கப்பட்ட பயனர்கள்

source: Blue
ta: நீலம்

source: Bold
ta: தடிமான

source: Bold Community Name
ta: தைரியமான சமூக பெயர்

source: Bold Instance Name
ta: தைரியமான நிகழ்வு பெயர்

source: Bold User Name
ta: தைரியமான பயனர் பெயர்

source: Bot
ta: போட்

# browserMode
source: Link handling
ta: இணைப்பு கையாளுதல்

# browsingAnonymously
source: You are currently browsing {instance} anonymously.
ta: நீங்கள் தற்போது {instance} அநாமதேயமாக உலாவுகிறீர்கள்.

source: Cancel
ta: ரத்துசெய்

# cannotReportOwnComment
source: You may not submit a report for your own comment.
ta: உங்கள் சொந்த கருத்துக்கு நீங்கள் ஒரு அறிக்கையை சமர்ப்பிக்கக்கூடாது.

# cantBlockAdmin
source: You may not block an instance administrator.
ta: நீங்கள் ஒரு நிகழ்வு நிர்வாகியைத் தடுக்கக்கூடாது.

# cantBlockYourself
source: You may not block yourself.
ta: நீங்களே தடுக்கக்கூடாது.

# cardPostCardMetadataItems
source: Card View Metadata
ta: அட்டை பார்வை மேனிலை தரவு

source: Card View
ta: அட்டை பார்வை

# cardViewDescription
source: Enable card view to adjust settings
ta: அமைப்புகளை சரிசெய்ய அட்டை காட்சியை இயக்கவும்

source: Card View Settings
ta: அட்டை காட்சி அமைப்புகள்

source: Change account settings for
ta: கணக்கு அமைப்புகளை மாற்றவும்

source: Change notification settings...
ta: அறிவிப்பு அமைப்புகளை மாற்றவும் ...

source: Change Password
ta: கடவுச்சொல்லை மாற்றவும்

# changePasswordWarning
source: To change your password, you will be redirected to your instance site. Are you sure you want to continue?
ta: உங்கள் கடவுச்சொல்லை மாற்ற, நீங்கள் உங்கள் நிகழ்வு தளத்திற்கு திருப்பி விடப்படுவீர்கள். நீங்கள் தொடர விரும்புகிறீர்களா?

source: Change Sort
ta: வரிசைப்படுத்துங்கள்

# clearCache
source: Clear Cache ({cacheSize})
ta: தெளிவான தற்காலிக சேமிப்பு ({cacheSize})

# clearCacheLabel
source: Clear Cache
ta: தெளிவான தற்காலிக சேமிப்பு

source: Clear Database
ta: தரவுத்தளத்தை அழிக்கவும்

source: Clear Preferences
ta: தெளிவான விருப்பத்தேர்வுகள்

source: Clear Search
ta: தேடலை அழி

# clearedCache
source: Cleared cache successfully.
ta: கேச் வெற்றிகரமாக அழிக்கப்பட்டது.

# clearedDatabase
source: Local database cleared. Restart Thunder for new changes to take effect.
ta: உள்ளக தரவுத்தளம் அழிக்கப்பட்டது. புதிய மாற்றங்கள் நடைமுறைக்கு வர தண்டரை மறுதொடக்கம் செய்யுங்கள்.

# clearedUserPreferences
source: Cleared all user preferences
ta: அனைத்து பயனர் விருப்பங்களையும் அழித்துவிட்டது

source: Close
ta: மூடு

source: Collapse
ta: சரிவு

source: Collapse Comment Preview
ta: கருத்து முன்னோட்டம்

source: Collapse Information
ta: தகவல்களை சரிவு

# collapseParentCommentBodyOnGesture
source: Hide Parent Comment when Collapsed
ta: சரிந்தபோது பெற்றோரின் கருத்தை மறைக்கவும்

source: Collapse post
ta: வீழ்ச்சி இடுகை

source: Collapse Post Preview
ta: இடுகை முன்னோட்டத்தை வீழ்த்துங்கள்

source: Collapse Spoiler
ta: ச்பாய்லர் சரிவு

source: Color
ta: நிறம்

source: Colorize Community Name
ta: சமூக பெயரை வண்ணமயமாக்கவும்

source: Colorize Instance Name
ta: நிகழ்வு பெயரை வண்ணமயமாக்குங்கள்

source: Colorize User Name
ta: பயனர் பெயரை வண்ணமயமாக்குங்கள்

source: Colors
ta: நிறங்கள்

source: Combine Comment Scores
ta: கருத்து மதிப்பெண்களை இணைக்கவும்

# combineCommentScoresLabel
source: Combine Comment Scores
ta: கருத்து மதிப்பெண்களை இணைக்கவும்

# combineNavAndFab
source: Combine FAB and Navigation Buttons
ta: FAB மற்றும் வழிசெலுத்தல் பொத்தான்களை இணைக்கவும்

# combineNavAndFabDescription
source: Floating Action Button will be shown between navigation buttons.
ta: வழிசெலுத்தல் பொத்தான்களுக்கு இடையில் மிதக்கும் செயல் பொத்தானைக் காண்பிக்கும்.

source: Comfortable
ta: வசதியானது

source: Comment
ta: கருத்து

# commentBehaviourSettings
source: Comments
ta: கருத்துகள்

# commentFontScale
source: Comment Content Font Scale
ta: கருத்து உள்ளடக்க எழுத்துரு அளவு

# commentPreview
source: Show a preview of the comments with the given settings
ta: கொடுக்கப்பட்ட அமைப்புகளுடன் கருத்துகளின் முன்னோட்டத்தைக் காட்டுங்கள்

# commentReported
source: The comment has been marked for review.
ta: கருத்து மதிப்பாய்வுக்காக குறிக்கப்பட்டுள்ளது.

source: Comment saved as draft
ta: கருத்து வரைவாக சேமிக்கப்பட்டது

# commentShowUserAvatar
source: Show User Avatar
ta: பயனர் அவதாரத்தைக் காட்டு

# commentShowUserInstance
source: Show User Instance
ta: பயனர் உதாரணத்தைக் காட்டு

source: Comment Sort Type
ta: கருத்து வரிசை வகை

source: Comment Swipe Actions
ta: கருத்து ச்வைப் செயல்கள்

# commentSwipeGesturesHint
source: Looking to use buttons instead? Enable them in the comments section in general settings.
ta: அதற்கு பதிலாக பொத்தான்களைப் பயன்படுத்த விரும்புகிறீர்களா? பொது அமைப்புகளில் கருத்துகள் பிரிவில் அவற்றை இயக்கவும்.

source: Comments
ta: கருத்துகள்

source: Communities
ta: சமூகங்கள்

source: Community
ta: சமூகம்

source: Community Actions
ta: சமூக நடவடிக்கைகள்

# communityEntry
source: Community '{community}'
ta: சமூகம் '{community}'

source: Community Format
ta: சமூக வடிவம்

source: Community Name Color
ta: சமூக பெயர் நிறம்

source: Community Name Thickness
ta: சமூக பெயர் தடிமன்

source: Community Style
ta: சமூக நடை

source: Compact
ta: கச்சிதமான

# compactPostCardMetadataItems
source: Compact View Metadata
ta: சிறிய பார்வை மேனிலை தரவு

source: Compact View
ta: சிறிய பார்வை

# compactViewDescription
source: Enable compact view to adjust settings
ta: அமைப்புகளை சரிசெய்ய சிறிய பார்வையை இயக்கவும்

source: Compact View Settings
ta: சிறிய பார்வை அமைப்புகள்

source: Condensed
ta: ஒடுக்கப்பட்ட

source: Confirm
ta: உறுதிப்படுத்தவும்

# confirmLogOutBody
source: Are you sure you want to log out?
ta: நீங்கள் நிச்சயமாக வெளியேற விரும்புகிறீர்களா?

# confirmLogOutTitle
source: Log Out?
ta: வெளியேறு?

# confirmMarkAllAsReadBody
source: Are you sure you want to mark all replies, mentions, and messages as read?
ta: எல்லா பதில்கள், குறிப்பிடல்கள் மற்றும் செய்திகளையும் படித்ததாகக் குறிக்க விரும்புகிறீர்களா?

# confirmMarkAllAsReadTitle
source: Mark all as read?
ta: அனைத்தையும் படித்தபடி குறிக்கவும்?

# confirmResetCommentPreferences
source: This will reset all comment preferences. Are you sure you want to proceed?
ta: இது அனைத்து கருத்து விருப்பங்களையும் மீட்டமைக்கும். நீங்கள் தொடர விரும்புகிறீர்களா?

# confirmResetPostPreferences
source: This will reset all post preferences. Are you sure you want to proceed?
ta: இது அனைத்து இடுகை விருப்பங்களையும் மீட்டமைக்கும். நீங்கள் தொடர விரும்புகிறீர்களா?

# confirmUnsubscription
source: Are you sure you want to unsubscribe?
ta: நீங்கள் நிச்சயமாக குழுவிலக விரும்புகிறீர்களா?

# connectedToUnifiedPushDistributorApp
source: Conected to {app}
ta: {app} உடன் இணைக்கப்பட்டுள்ளது

source: Content Management
ta: உள்ளடக்க மேலாண்மை

source: Content Warning
ta: உள்ளடக்க எச்சரிக்கை

source: Controversial
ta: சர்ச்சைக்குரிய

source: Copied to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது

source: Copy
ta: நகலெடு

source: Copy Comment
ta: கருத்து நகல்

source: Copy selected
ta: தேர்ந்தெடுக்கப்பட்ட நகல்

source: Copy Text
ta: உரையை நகலெடுக்கவும்

# couldNotDetermineCommentDelete
source: Error: Could not determine post to delete the comment.
ta: பிழை: கருத்தை நீக்க இடுகையை தீர்மானிக்க முடியவில்லை.

# couldNotDeterminePostComment
source: Error: Could not determine post to comment to.
ta: பிழை: கருத்து தெரிவிக்க இடுகையை தீர்மானிக்க முடியவில்லை.

# couldntCreateReport
source: Your comment report could not be submitted at this time. Please try again later
ta: இந்த நேரத்தில் உங்கள் கருத்து அறிக்கையை சமர்ப்பிக்க முடியவில்லை. தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும்

# couldntFindPost
source: Unable to load the requested post. It may have been deleted or removed.
ta: கோரப்பட்ட இடுகையை ஏற்ற முடியவில்லை. இது நீக்கப்பட்டிருக்கலாம் அல்லது அகற்றப்பட்டிருக்கலாம்.

source: {count} Comments
ta: {count} கருத்துகள்

source: {count} Local Subscribers
ta: {count} உள்ளக சந்தாதாரர்கள்

source: {count} Posts
ta: {count} இடுகைகள்

source: {count} Subscribers
ta: {count} சந்தாதாரர்கள்

source: {count} users
ta: {count} பயனர்கள்

# countUsersActiveDay
source: {count} users/day
ta: {count} பயனர்கள்/நாள்

# countUsersActiveHalfYear
source: {count} users/6 mo
ta: {count} பயனர்கள்/6 மோ

# countUsersActiveMonth
source: {count} users/mo
ta: {count} பயனர்கள்/மோ

# countUsersActiveWeek
source: {count} users/wk
ta: {count} பயனர்கள்/WK

source: Create Account
ta: கணக்கை உருவாக்கவும்

source: Create Comment
ta: கருத்தை உருவாக்குங்கள்

source: Create new cross-post
ta: புதிய குறுக்கு இடுகையை உருவாக்கவும்

source: Create Post
ta: இடுகையை உருவாக்கவும்

# created
source: Created {date}
ta: உருவாக்கப்பட்டது {date}

source: Created Today
ta: இன்று உருவாக்கப்பட்டது

source: Creator
ta: உருவாக்கியவர்

# crossPostedFrom
source: cross-posted from: {postUrl}
ta: குறுக்கு இடுகையிடப்பட்டது: {postUrl}

source: Cross-posted to
ta: குறுக்கு இடுகையிடப்பட்டது

# currentLongPress
source: Currently set as long press
ta: தற்போது நீண்ட பத்திரிகையாக அமைக்கப்பட்டுள்ளது

# currentNotificationsMode
source: Current notifications mode: {mode}
ta: தற்போதைய அறிவிப்புகள் பயன்முறை: {mode}

# currentSinglePress
source: Currently set as single press
ta: தற்போது ஒற்றை பத்திரிகையாக அமைக்கப்பட்டுள்ளது

# customizeSwipeActions
source: Customize swipe actions (tap to change)
ta: ச்வைப் செயல்களைத் தனிப்பயனாக்குங்கள் (மாற்றத் தட்டவும்)

source: Danger Zone
ta: இடர் மண்டலம்

source: Dark
ta: இருண்ட

# databaseExportWarning
source: The database may contain sensitive information related to your Lemmy account. If you export it, you should not share it with anyone. Do you want to proceed?
ta: தரவுத்தளத்தில் உங்கள் லெம்மி கணக்கு தொடர்பான முக்கியமான தகவல்கள் இருக்கலாம். நீங்கள் அதை ஏற்றுமதி செய்தால், அதை யாருடனும் பகிர்ந்து கொள்ளக்கூடாது. நீங்கள் தொடர விரும்புகிறீர்களா?

# databaseExportedSuccessfully
source: The database was successfully exported to '{savedFilePath}'
ta: தரவுத்தளம் வெற்றிகரமாக '{savedFilePath}' க்கு ஏற்றுமதி செய்யப்பட்டது

# databaseImportedSuccessfully
source: The database was imported successfully!
ta: தரவுத்தளம் வெற்றிகரமாக இறக்குமதி செய்யப்பட்டது!

# databaseNotExportedSuccessfully
source: The database was not exported successfully or the operation was canceled.
ta: தரவுத்தளம் வெற்றிகரமாக ஏற்றுமதி செய்யப்படவில்லை அல்லது செயல்பாடு ரத்து செய்யப்பட்டது.

# databaseNotImportedSuccessfully
source: The database was not imported successfully, or the operation was canceled.
ta: தரவுத்தளம் வெற்றிகரமாக இறக்குமதி செய்யப்படவில்லை, அல்லது செயல்பாடு ரத்து செய்யப்பட்டது.

source: Date Format
ta: தேதி வடிவம்

source: Debug
ta: பிழைத்திருத்தம்

# debugDescription
source: The following debug settings should only be used for troubleshooting purposes.
ta: பின்வரும் பிழைத்திருத்த அமைப்புகள் சரிசெய்தல் நோக்கங்களுக்காக மட்டுமே பயன்படுத்தப்பட வேண்டும்.

# debugNotificationsDescription
source: Use the following options to troubleshoot issues related to notifications.
ta: அறிவிப்புகள் தொடர்பான சிக்கல்களை சரிசெய்ய பின்வரும் விருப்பங்களைப் பயன்படுத்தவும்.

source: Decline
ta: வீழ்ச்சி

# defaultColor
source: Default
ta: இயல்புநிலை

source: Default Comment Sort Type
ta: இயல்புநிலை கருத்து வரிசை வகை

source: Default Feed Sort Type
ta: இயல்புநிலை ஊட்ட வரிசை வகை

source: Default Feed Type
ta: இயல்புநிலை தீவன வகை

source: Delete
ta: நீக்கு

source: Delete Account
ta: கணக்கை நீக்கு

# deleteAccountDescription
source: To permanently delete your account, you will be redirected to your instance site. Are you sure you want to continue?
ta: உங்கள் கணக்கை நிரந்தரமாக நீக்க, நீங்கள் உங்கள் நிகழ்வு தளத்திற்கு திருப்பி விடப்படுவீர்கள். நீங்கள் தொடர விரும்புகிறீர்களா?

source: Delete Comment
ta: கருத்தை நீக்கு

# deleteImageConfirmMessage
source: Are you sure you want to delete this image?
ta: இந்த படத்தை நீக்க விரும்புகிறீர்களா?

# deleteImageConfirmTitle
source: Delete?
ta: நீக்கவா?

source: Delete Local Database
ta: உள்ளக தரவுத்தளத்தை நீக்கு

# deleteLocalDatabaseDescription
source: This action will remove the local database and will log you out of all your accounts. Are you sure you want to continue?
ta: இந்த நடவடிக்கை உள்ளக தரவுத்தளத்தை அகற்றும், மேலும் உங்கள் எல்லா கணக்குகளிலிருந்தும் உங்களை உள்நுழைகிறது. நீங்கள் தொடர விரும்புகிறீர்களா?

source: Delete Local Preferences
ta: உள்ளக விருப்பங்களை நீக்கு

# deleteLocalPreferencesDescription
source: This will clear all your user preferences and settings in Thunder. Do you want to continue?
ta: இது உங்கள் பயனர் விருப்பத்தேர்வுகள் மற்றும் அமைப்புகளை இடியில் அழிக்கும். நீங்கள் தொடர விரும்புகிறீர்களா?

source: Delete Post
ta: இடுகையை நீக்கு

# deleteUserLabelConfirmation
source: Are you sure you want to delete the label?
ta: நீங்கள் நிச்சயமாக லேபிளை நீக்க விரும்புகிறீர்களா?

source: Deleted
ta: நீக்கப்பட்டது

source: deleted by creator
ta: படைப்பாளரால் நீக்கப்பட்டது

source: deleted by moderator
ta: மதிப்பீட்டாளரால் நீக்கப்பட்டது

# deselectUndeterminedWarning
source: If you deselect Undetermined, you will not see most content.
ta: நீங்கள் தீர்மானிக்கப்படாமல் தேர்வுசெய்தால், நீங்கள் பெரும்பாலான உள்ளடக்கங்களைக் காண மாட்டீர்கள்.

# detailedReason
source: Reason: {reason}
ta: காரணம்: {reason}

source: Dim Read Posts
ta: மங்கலான இடுகைகள்

source: Disable
ta: முடக்கு

source: Disable Push Notifications
ta: புச் அறிவிப்புகளை முடக்கு

source: Disabled
ta: முடக்கப்பட்டது

source: Discussion Languages
ta: கலந்துரையாடல் மொழிகள்

# discussionLanguagesTooltip
source: Content is filtered to the selected languages.
ta: தேர்ந்தெடுக்கப்பட்ட மொழிகளுக்கு உள்ளடக்கம் வடிகட்டப்படுகிறது.

source: Dismiss Read
ta: படித்தல்

source: Display Name
ta: காட்சி பெயர்

# displayUserScore
source: Display User Scores (Karma).
ta: பயனர் மதிப்பெண்களைக் காண்பி (கர்மா).

source: Divider Appearance
ta: வகுப்பி தோற்றம்

source: Do Not Show Again
ta: மீண்டும் காட்ட வேண்டாம்

# doNotSupportMultipleUnifiedPushApps
source: Found multiple compatible apps; please install only one
ta: பல இணக்கமான பயன்பாடுகள் கிடைத்தன; ஒன்றை மட்டும் நிறுவவும்

# downloadingMedia
source: Downloading media to share…
ta: பகிர ஊடகத்தைப் பதிவிறக்குகிறது…

source: Downvote
ta: கீழ்வாக்கு

source: Downvote Color
ta: வண்ணத்தை குறைக்கிறது

source: Downvoted
ta: கீழ்வாக்கிடப்பட்டது

# downvotesDisabled
source: Downvotes are turned off on this instance.
ta: இந்த நிகழ்வில் டவுன்வோட்டுகள் அணைக்கப்படுகின்றன.

source: Edit
ta: தொகு

source: Edit Comment
ta: எப்படி திருத்து

source: Edit Post
ta: இடுகையைத் திருத்து

source: Email
ta: மின்னஞ்சல்

source: Empty
ta: காலி

source: Empty Inbox
ta: வெற்று இன்பாக்ச்

# emptyUri
source: The link is empty. Please provide a valid dynamic link to proceed.
ta: இணைப்பு காலியாக உள்ளது. தொடர சரியான மாறும் இணைப்பை வழங்கவும்.

source: Enable Comment Navigation
ta: கருத்து வழிசெலுத்தலை இயக்கவும்

source: Enable experimental features
ta: சோதனை அம்சங்களை இயக்கவும்

# enableFeedFab
source: Enable Floating Button on Feeds
ta: ஊட்டங்களில் மிதக்கும் பொத்தானை இயக்கவும்

source: Enable Floating Button On Feeds
ta: ஊட்டங்களில் மிதக்கும் பொத்தானை இயக்கவும்

source: Enable Floating Button On Posts
ta: இடுகைகளில் மிதக்கும் பொத்தானை இயக்கவும்

source: Enable Inbox Notifications
ta: இன்பாக்ச் அறிவிப்புகளை இயக்கவும்

# enablePostFab
source: Enable Floating Button on Posts
ta: இடுகைகளில் மிதக்கும் பொத்தானை இயக்கவும்

source: End of comments
ta: கருத்துகளின் முடிவு

source: End Search
ta: இறுதி தேடல்

# errorDeletingImage
source: There was an error deleting the image: {error}
ta: படத்தை நீக்குவதில் பிழை இருந்தது: {error}

# errorDownloadingMedia
source: Could not download the media file to share: {errorMessage}
ta: பகிர்வதற்கு மீடியா கோப்பை பதிவிறக்கம் செய்ய முடியவில்லை: {errorMessage}

# errorImportingAccountSettings
source: There was an error importing the settings. The file might not be in the right format.
ta: அமைப்புகளை இறக்குமதி செய்வதில் பிழை ஏற்பட்டது. கோப்பு சரியான வடிவத்தில் இருக்காது.

# errorLoadingAccountSettings
source: There was an error loading the settings file or the operation was canceled.
ta: அமைப்புகள் கோப்பை ஏற்றுவதில் பிழை ஏற்பட்டது அல்லது செயல்பாடு ரத்து செய்யப்பட்டது.

# errorMarkingReplyRead
source: There was an error marking the reply as read.
ta: பதிலைக் குறிக்கும் பிழை இருந்தது.

# errorMarkingReplyUnread
source: There was an error marking the reply as unread.
ta: பதிலை படிக்காதது எனக் குறிக்கும் பிழை ஏற்பட்டது.

# errorParsingJson
source: There was an error parsing the selected file. It may not be valid JSON.
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பை பாகுபடுத்துவதில் பிழை ஏற்பட்டது. இது செல்லுபடியாகாது சேசன்.

# errorSavingAccountSettings
source: There was an error saving the settings file or the operation was canceled.
ta: அமைப்புகள் கோப்பைச் சேமிப்பதில் பிழை ஏற்பட்டது அல்லது செயல்பாடு ரத்து செய்யப்பட்டது.

# exceptionProcessingUri
source: An error occurred while processing the link. It may not be available on your instance.
ta: இணைப்பை செயலாக்கும்போது பிழை ஏற்பட்டது. இது உங்கள் நிகழ்வில் கிடைக்காமல் போகலாம்.

# excessiveApiCallsWarning
source: Your feed may be taking a while to load due to keyword filters.
ta: முக்கிய வடிப்பான்கள் காரணமாக ஏற்றுவதற்கு உங்கள் ஊட்டம் சிறிது நேரம் ஆகலாம்.

source: Expand
ta: விரிவாக்கு

source: Expand Comment Preview
ta: கருத்து முன்னோட்டத்தை விரிவாக்குங்கள்

source: Expand Information
ta: தகவல்களை விரிவாக்குங்கள்

source: Expand options
ta: விருப்பங்களை விரிவாக்குங்கள்

source: Expand post
ta: இடுகையை விரிவாக்கு

source: Expand Post Preview
ta: இடுகை முன்னோட்டத்தை விரிவாக்குங்கள்

source: Expand Spoiler
ta: ச்பாய்லரை விரிவாக்கு

source: Expanded
ta: விரிவாக்கப்பட்டது

source: Experimental Features
ta: சோதனை நற்பொருத்தங்கள்

# experimentalFeaturesDescription
source: These features are still in development and may be unstable. Use them at your own risk. You must restart Thunder to take effect.
ta: இந்த நற்பொருத்தங்கள் இன்னும் வளர்ச்சியில் உள்ளன மற்றும் நிலையற்றதாக இருக்கலாம். அவற்றை உங்கள் சொந்த ஆபத்தில் பயன்படுத்தவும். நடைமுறைக்கு வர நீங்கள் தண்டரை மறுதொடக்கம் செய்ய வேண்டும்.

source: Explore instance
ta: நிகழ்வை ஆராயுங்கள்

source: Export Database
ta: ஏற்றுமதி தரவுத்தளம்

# exportDatabaseSubtitle
source: The database contains info about accounts, favorites, anonymous subscriptions, and user labels.
ta: தரவுத்தளத்தில் கணக்குகள், பிடித்தவை, அநாமதேய சந்தாக்கள் மற்றும் பயனர் லேபிள்கள் பற்றிய தகவல்கள் உள்ளன.

# exportLemmyAccountSettingsDescription
source: Export Lemmy account settings
ta: லெம்மி கணக்கு அமைப்புகளை ஏற்றுமதி செய்யுங்கள்

# exportSettingsSubtitle
source: The settings includes all of the preferences that you have configured in Thunder.
ta: அமைப்புகளில் நீங்கள் இடியில் கட்டமைக்கப்பட்ட அனைத்து விருப்பங்களும் அடங்கும்.

source: Extra Large
ta: கூடுதல் பெரிய

# failedToBlock
source: Failed to block: {errorMessage}
ta: தடுப்பதில் தோல்வி: {errorMessage}

# failedToCommunicateWithThunderNotificationServer
source: Failed to communicate with Thunder notification server at '{serverAddress}'
ta: '{serverAddress}' இல் தண்டர் அறிவிப்பு சேவையகத்துடன் தொடர்புகொள்வதில் தோல்வி

# failedToLoadBlocks
source: Could not load blocks: {errorMessage}
ta: தொகுதிகளை ஏற்ற முடியவில்லை: {errorMessage}

# failedToLoadVideo
source: Failed to load video. Open link in browser?
ta: வீடியோவை ஏற்றுவதில் தோல்வி. உலாவியில் இணைப்பை திறக்கவா?

source: Failed to perform action
ta: செயலைச் செய்யத் தவறிவிட்டது
