Repository: 247i/TACETr
Catalog: உரை/தானி/thunder-thunder-*.po
Languages: ta

# videoPlayerInApp
source: Use Thunder built-in player
ta: தண்டர் உள்ளமைக்கப்பட்ட பிளேயரைப் பயன்படுத்தவும்

# videoPlayerMode
source: Player Mode
ta: பிளேயர் பயன்முறை

source: View all
ta: அனைத்தையும் காண்க

source: View all comments
ta: அனைத்து கருத்துகளையும் காண்க

source: View Comment Source
ta: கருத்து மூலத்தைக் காண்க

source: View Modlog
ta: மோட்லாக் காண்க

source: View original
ta: அசல் காண்க

source: View post as different account
ta: இடுகையை வெவ்வேறு கணக்காக காண்க

source: View post source
ta: பிந்தைய மூலத்தைக் காண்க

source: View source
ta: மூலத்தைக் காண்க

source: Viewing all
ta: அனைத்தையும் பார்க்கிறது

# visibility
source: Visibility: {visibility}
ta: தெரிவுநிலை: {visibility}

source: Visit Community
ta: சமூகத்தைப் பார்வையிடவும்

source: Visit Community Instance
ta: சமூக நிகழ்வைப் பார்வையிடவும்

source: Visit Instance
ta: நிகழ்வைப் பார்வையிடவும்

source: Visit User Instance
ta: பயனர் நிகழ்வைப் பார்வையிடவும்

source: Visit User Profile
ta: பயனர் சுயவிவரத்தைப் பார்வையிடவும்

source: Warning
ta: எச்சரிக்கை

source: {x} downvotes
ta: {x} கீழ்நோக்கி

source: {x} score
ta: {x} மதிப்பெண்

source: {x} upvotes
ta: {x} மேல்வாக்குகள்

# xYearsOld
source: {count, plural, zero {{x} year old} one {{x} year old} other {{x} years old}}
ta: {count, plural, zero {{x} ஆண்டு பழையது} one {{x} ஆண்டு பழையது} other {{x} ஆண்டுகள் பழையது}}

source: Yes
ta: ஆம்

source: You must select a .json file.
ta: நீங்கள் ஒரு .json கோப்பைத் தேர்ந்தெடுக்க வேண்டும்.
