Repository: 247i/TACETr
Catalog: உரை/தானி/tipp10-application-*.po
Languages: ta

# AbcRainWidgetPress space bar to start
source: Press space bar to start
ta: தொடங்க விண்வெளி பட்டியை அழுத்தவும்

# AbcRainWidget&Help
source: &Help
ta: உதவி (&h)

# AbcRainWidget&Pause
source: &Pause
ta: & இடைநிறுத்தம்

# AbcRainWidgetE&xit Game
source: E&xit Game
ta: மின் & xit விளையாட்டு

# AbcRainWidgetNumber of points:
source: Number of points:
ta: புள்ளிகளின் எண்ணிக்கை:

# AbcRainWidgetPoints:
source: Points:
ta: புள்ளிகள்:

# AbcRainWidgetLevel
source: Level
ta: நிலை

# AbcRainWidgetPress space bar to proceed
source: Press space bar to proceed
ta: தொடர விண்வெளி பட்டியை அழுத்தவும்

# CharSqlModel%L1 %
source: %L1 %
ta: %எல் 1 %

# CharTableSqlCharacters
source: Characters
ta: எழுத்துக்கள்

# CharTableSqlTarget Errors
source: Target Errors
ta: இலக்கு பிழைகள்

# CharTableSqlActual Errors
source: Actual Errors
ta: உண்மையான பிழைகள்

# CharTableSqlFrequency
source: Frequency
ta: மீடிறன், மீள்திறன், நிகழ்வெண், நிகழ்வு

# CharTableSqlError Rate
source: Error Rate
ta: பிழை வீதம்

# CharTableSqlThis column shows all of the characters typed
source: This column shows all of the characters typed
ta: இந்த நெடுவரிசை அனைத்தையும் காட்டுகிறது எழுத்துக்கள் தட்டச்சு செய்யப்பட்டன

# CharTableSqlThe character was supposed to be typed, but wasn't
source: The character was supposed to be typed, but wasn't
ta: கதாபாத்திரம் தட்டச்சு செய்யப்பட வேண்டும், ஆனால் இல்லை

# CharTableSqlCharacter was mistyped
source: Character was mistyped
ta: தன்மை தவறாகப் பேசப்பட்டது

# CharTableSqlThis column indicates the total frequency of each character shown
source: This column indicates the total frequency of each character shown
ta: இந்த நெடுவரிசை ஒவ்வொன்றின் மொத்த அதிர்வெண்ணைக் குறிக்கிறது எழுத்து காட்டப்பட்டுள்ளது

source: The error rate shows which characters give you the most problems. The error rate is calculated from the value "Target Error" and the value "Frequency".
ta: எந்த எழுத்துக்கள் தருகின்றன என்பதை பிழை விகிதம் காட்டுகிறது நீங்கள் மிகவும் சிக்கல்கள். பிழை விகிதம் "இலக்கு பிழை" மதிப்பிலிருந்து கணக்கிடப்படுகிறது மற்றும் "அதிர்வெண்" மதிப்பு.

# CharTableSqlReset characters
source: Reset characters
ta: எழுத்துக்களை மீட்டமைக்கவும்

source: Recorded error rates affect the intelligence feature and the selection of the text to be dictated. If the error rate for a certain character is excessively high it might be useful to reset the list. All recorded characters will now be deleted. Do you still wish to proceed?
ta: பதிவுசெய்யப்பட்ட பிழை விகிதங்கள் உளவுத்துறை அம்சத்தையும், கட்டளையிடப்பட வேண்டிய உரையின் தேர்வையும் பாதிக்கின்றன. ஒரு குறிப்பிட்ட எழுத்துக்கான பிழை விகிதம் அதிகமாக இருந்தால், பட்டியலை மீட்டமைப்பது பயனுள்ளதாக இருக்கும். பதிவுசெய்யப்பட்ட அனைத்து எழுத்துக்களும் இப்போது நீக்கப்படும். நீங்கள் இன்னும் தொடர விரும்புகிறீர்களா?

# ErrorMessageThe process will be aborted.
source: The process will be aborted.
ta: செயல்முறை கைவிடப்படும்.

# ErrorMessageThe update will be aborted.
source: The update will be aborted.
ta: புதுப்பிப்பு கைவிடப்படும்.

# ErrorMessageThe program will be aborted.
source: The program will be aborted.
ta: நிரல் கைவிடப்படும்.

# ErrorMessageCannot load the program logo.
source: Cannot load the program logo.
ta: நிரல் லோகோவை ஏற்ற முடியாது.

# ErrorMessageCannot load the keyboard bitmap.
source: Cannot load the keyboard bitmap.
ta: விசைப்பலகை பிட்மேப்பை ஏற்ற முடியாது.

# ErrorMessageCannot load the timer background.
source: Cannot load the timer background.
ta: நேரங்குறிகருவி பின்னணியை ஏற்ற முடியாது.

# ErrorMessageCannot load the status bar background.
source: Cannot load the status bar background.
ta: நிலை பட்டி பின்னணியை ஏற்ற முடியாது.

source: Cannot find the database %1. The file could not be imported. Please check whether it is a readable text file.
ta: தரவுத்தளத்தை %1 கண்டுபிடிக்க முடியவில்லை. கோப்பை இறக்குமதி செய்ய முடியவில்லை. இது படிக்கக்கூடிய உரை கோப்பு என்பதை சரிபார்க்கவும்.

# ErrorMessageConnection to the database failed.
source: Connection to the database failed.
ta: தரவுத்தளத்திற்கான இணைப்பு தோல்வியடைந்தது.

source: The user table with lesson data cannot be emptied. SQL statement failed.
ta: பாடம் தரவைக் கொண்ட பயனர் அட்டவணையை வெறுமை செய்ய முடியாது. கவிமொ அறிக்கை தோல்வியடைந்தது.

source: The user table with error data cannot be emptied. SQL statement failed.
ta: பிழை தரவைக் கொண்ட பயனர் அட்டவணையை வெறுமை செய்ய முடியாது. கவிமொ அறிக்கை தோல்வியடைந்தது.

# ErrorMessageNo lessons exist.
source: No lessons exist.
ta: பாடங்கள் எதுவும் இல்லை.

# ErrorMessageNo lesson selected. Please select a lesson.
source: No lesson selected. Please select a lesson.
ta: பாடம் எதுவும் தேர்ந்தெடுக்கப்படவில்லை. ஒரு பாடத்தைத் தேர்ந்தெடுக்கவும்.

# ErrorMessageCannot create the lesson. SQL statement failed.
source: Cannot create the lesson. SQL statement failed.
ta: பாடத்தை உருவாக்க முடியாது. கவிமொ அறிக்கை தோல்வியடைந்தது.

# ErrorMessageCannot save the lesson. SQL statement failed.
source: Cannot save the lesson. SQL statement failed.
ta: பாடத்தை சேமிக்க முடியாது. கவிமொ அறிக்கை தோல்வியடைந்தது.

# ErrorMessageCannot retrieve the lesson. SQL statement failed.
source: Cannot retrieve the lesson. SQL statement failed.
ta: பாடத்தை மீட்டெடுக்க முடியாது. கவிமொ அறிக்கை தோல்வியடைந்தது.

# ErrorMessageCannot analyze the lesson. SQL statement failed.
source: Cannot analyze the lesson. SQL statement failed.
ta: பாடத்தை பகுப்பாய்வு செய்ய முடியாது. கவிமொ அறிக்கை தோல்வியடைந்தது.

source: The file could not be imported. Please check whether it is a readable text file.
ta: கோப்பை இறக்குமதி செய்ய முடியவில்லை. இது படிக்கக்கூடிய உரை கோப்பு என்பதை சரிபார்க்கவும்.

source: The file could not be imported because it is empty. Please check whether it is a readable text file with content.
ta: கோப்பை காலியாக இருப்பதால் இறக்குமதி செய்ய முடியவில்லை. இது உள்ளடக்கத்துடன் படிக்கக்கூடிய உரை கோப்பா என்பதை சரிபார்க்கவும்.

source: The file could not be imported. Please check the spelling of the web address; it must be a valid URL and a readable text file. Please also check your internet connection.
ta: கோப்பை இறக்குமதி செய்ய முடியவில்லை. வலை முகவரியின் எழுத்துப்பிழை சரிபார்க்கவும்; இது செல்லுபடியாகும் முகவரி மற்றும் படிக்கக்கூடிய உரை கோப்பாக இருக்க வேண்டும். உங்கள் இணைய இணைப்பையும் சரிபார்க்கவும்.

source: The file could not be exported. Please check to see whether it is a writable text file.
ta: கோப்பை ஏற்றுமதி செய்ய முடியவில்லை. இது ஒரு எழுதக்கூடிய உரை கோப்பு என்பதை சரிபார்க்கவும்.

# ErrorMessageCannot create temporary file.
source: Cannot create temporary file.
ta: தற்காலிக கோப்பை உருவாக்க முடியாது.

source: Cannot execute the update process. Please check your internet connection and proxy settings.
ta: புதுப்பிப்பு செயல்முறையை இயக்க முடியாது. உங்கள் இணைய இணைப்பு மற்றும் பதிலாள் அமைப்புகளை சரிபார்க்கவும்.

# ErrorMessageCannot read the online update version.
source: Cannot read the online update version.
ta: நிகழ்நிலை புதுப்பிப்பு பதிப்பைப் படிக்க முடியாது.

# ErrorMessageCannot read the database update version.
source: Cannot read the database update version.
ta: தரவுத்தள புதுப்பிப்பு பதிப்பைப் படிக்க முடியாது.

# ErrorMessageCannot execute the SQL statement.
source: Cannot execute the SQL statement.
ta: கவிமொ அறிக்கையை இயக்க முடியாது.

# ErrorMessageCannot find typing mistake definitions.
source: Cannot find typing mistake definitions.
ta: தட்டச்சு தவறு வரையறைகளை கண்டுபிடிக்க முடியவில்லை.

# ErrorMessageCannot create temporary file. Update failed.
source: Cannot create temporary file. Update failed.
ta: தற்காலிக கோப்பை உருவாக்க முடியாது. புதுப்பிப்பு தோல்வியடைந்தது.

# ErrorMessageCannot create analysis table.
source: Cannot create analysis table.
ta: பகுப்பாய்வு அட்டவணையை உருவாக்க முடியாது.

# ErrorMessageCannot create analysis index.
source: Cannot create analysis index.
ta: பகுப்பாய்வு குறியீட்டை உருவாக்க முடியாது.

# ErrorMessageCannot fill analysis table with values.
source: Cannot fill analysis table with values.
ta: பகுப்பாய்வு அட்டவணையை மதிப்புகளுடன் நிரப்ப முடியாது.

# ErrorMessageAn error has occured.
source: An error has occured.
ta: பிழை ஏற்பட்டுள்ளது.

# ErrorMessage (Error number: %1)
source: (Error number: %1)
ta: (பிழை எண்: %1)

# EvaluationWidgetReport
source: Report
ta: அறிக்கை

# EvaluationWidgetOverview of Lessons
source: Overview of Lessons
ta: பாடங்களின் கண்ணோட்டம்

# EvaluationWidgetProgress of Lessons
source: Progress of Lessons
ta: பாடங்களின் முன்னேற்றம்

# EvaluationWidgetCharacters
source: Characters
ta: எழுத்துக்கள்

# EvaluationWidgetFingers
source: Fingers
ta: விரல்கள்

# EvaluationWidgetComparison Table
source: Comparison Table
ta: ஒப்பீட்டு அட்டவணை

# EvaluationWidget&Help
source: &Help
ta: உதவி (&h)

# EvaluationWidget&Close
source: &Close
ta: மூடு (&c)

# EvaluationWidgetUse examples
source: Use examples
ta: எடுத்துக்காட்டுகளைப் பயன்படுத்தவும்

source: Please note that you get better scores for slow typing without errors, than for fast typing with lots of errors!
ta: பிழைகள் இல்லாமல் மெதுவாக தட்டச்சு செய்வதற்கான சிறந்த மதிப்பெண்களைப் பெறுவீர்கள் என்பதை நினைவில் கொள்க, நிறைய பிழைகளுடன் வேகமாக தட்டச்சு செய்வதை விட!

# EvaluationWidgetScore
source: Score
ta: கெலிப்பெண்

# EvaluationWidgetFor example, this equates to …
source: For example, this equates to …
ta: உதாரணமாக, இது சமம்…

# EvaluationWidgetPerformance
source: Performance
ta: செயல்திறன்

# EvaluationWidgetPoints
source: Points
ta: பிரிவகம்

# EvaluationWidget%1 cpm and %2 errors in %3 minutes
source: %1 cpm and %2 errors in %3 minutes
ta: %1 சிபிஎம் மற்றும் %3 நிமிடங்களில் %2 பிழைகள்

# EvaluationWidgetNo experience in touch typing
source: No experience in touch typing
ta: தொடு தட்டச்சு செய்வதில் பட்டறிவு இல்லை

# EvaluationWidgetFirst steps in touch typing
source: First steps in touch typing
ta: தொடு தட்டச்சு செய்வதில் முதல் படிகள்

# EvaluationWidgetAdvanced level
source: Advanced level
ta: மேம்பட்ட நிலை

# EvaluationWidgetSuitable skills
source: Suitable skills
ta: பொருத்தமான திறன்கள்

# EvaluationWidgetVery good skills
source: Very good skills
ta: மிகவும் நல்ல திறன்கள்

# EvaluationWidgetPerfect skills
source: Perfect skills
ta: சரியான திறன்கள்

# FingerWidgetError rates of your fingers
source: Error rates of your fingers
ta: உங்கள் விரல்களின் பிழை விகிதங்கள்

source: The error rate is based on the recorded characters and the current selected keyboard layout.
ta: பிழை விகிதம் பதிவுசெய்யப்பட்ட எழுத்துக்கள் மற்றும் தற்போதைய தேர்ந்தெடுக்கப்பட்ட விசைப்பலகை தளவமைப்பை அடிப்படையாகக் கொண்டது.

# FingerWidgetError Rate:
source: Error Rate:
ta: பிழை வீதம்:

# FingerWidgetFrequency:
source: Frequency:
ta: அதிர்வெண்:

# FingerWidgetErrors:
source: Errors:
ta: பிழைகள்:

# HelpBrowserHelp
source: Help
ta: உதவி

# HelpBrowseren
source: en
ta: என்

# HelpBrowserBack
source: Back
ta: பின்

# HelpBrowserTable of Contents
source: Table of Contents
ta: உள்ளடக்க அட்டவணை

# HelpBrowser&Close
source: &Close
ta: மூடு (&c)

# HelpBrowser&Print page
source: &Print page
ta: பக்கத்தை அச்சிடுக

# HelpBrowserPrint page
source: Print page
ta: பக்கத்தை அச்சிடுக

# IllustrationDialogIntroduction
source: Introduction
ta: அறிமுகம்

# IllustrationDialogWelcome to TIPP10
source: Welcome to TIPP10
ta: TIPP10 க்கு வருக

source: TIPP10 is a free touch typing tutor for Windows, Mac OS and Linux. The ingenious thing about the software is its intelligence feature. Characters that are mistyped are repeated more frequently. Touch typing has never been so easy to learn.
ta: TIPP10 சாளரங்கள், மேக் ஓஎச் மற்றும் லினக்ச் ஆகியவற்றிற்கான இலவச தொடு தட்டச்சு ஆசிரியராகும். மென்பொருளைப் பற்றிய தனித்துவமான சேதி அதன் உளவுத்துறை அம்சமாகும். தவறாகப் பேசப்படும் எழுத்துக்கள் அடிக்கடி மறுநிகழ்வு செய்யப்படுகின்றன. தொடு தட்டச்சு செய்வது ஒருபோதும் கற்றுக்கொள்வது அவ்வளவு எளிதானது அல்ல.

# IllustrationDialogTips for using the 10 finger system
source: Tips for using the 10 finger system
ta: 10 விரல் அமைப்பைப் பயன்படுத்துவதற்கான உதவிக்குறிப்புகள்

source: 1. First place your fingers in the home position (this is displayed at the beginning of each lesson). The fingers return to the home row after each key is pressed.
ta: 1. முதலில் உங்கள் விரல்களை வீட்டு நிலையில் வைக்கவும் (இது ஒவ்வொரு பாடத்தின் தொடக்கத்திலும் காட்டப்படும்). ஒவ்வொரு விசையும் அழுத்தப்பட்ட பிறகு விரல்கள் வீட்டு வரிசைக்குத் திரும்புகின்றன.

# IllustrationDialogen
source: en
ta: என்

source: 2. Make sure your posture is straight and avoid looking at the keyboard. Your eyes should be directed toward the monitor at all times.
ta: 2. உங்கள் தோரணை நேராக இருப்பதை உறுதிசெய்து, விசைப்பலகையைப் பார்ப்பதைத் தவிர்க்கவும். உங்கள் கண்கள் எல்லா நேரங்களிலும் மானிட்டரை நோக்கி செலுத்தப்பட வேண்டும்.

source: 3. Bring your arms to the side of your body and relax your shoulders. Your upper arm and lower arm should be at a right angle. Do not rest your wrists and remain in an upright position.
ta: 3. உங்கள் கைகளை உங்கள் உடலின் பக்கத்திற்கு கொண்டு வந்து உங்கள் தோள்களை ஓய்வெடுங்கள். உங்கள் மேல் கை மற்றும் கீழ் கை சரியான கோணத்தில் இருக்க வேண்டும். உங்கள் மணிகட்டை ஓய்வெடுக்க வேண்டாம், நேர்மையான நிலையில் இருங்கள்.

# IllustrationDialog4. Try to remain relaxed during the typing lessons.
source: 4. Try to remain relaxed during the typing lessons.
ta: 4. தட்டச்சு பாடங்களின் போது நிதானமாக இருக்க முயற்சி செய்யுங்கள்.

source: 5. Try to keep typing errors to a minimum. It is much less efficient to type fast if you are making a lot of mistakes.
ta: 5. தட்டச்சு பிழைகளை குறைந்தபட்சமாக வைத்திருக்க முயற்சிக்கவும். நீங்கள் நிறைய தவறுகளைச் செய்கிறீர்கள் என்றால் வேகமாக தட்டச்சு செய்வது மிகவும் குறைவான செயல்திறன் கொண்டது.

source: 6. Once you have begun touch typing you have to avoid reverting back to the way you used to type (even if you are in a hurry).
ta: 6. நீங்கள் தொடு தட்டச்சு செய்யத் தொடங்கியதும், நீங்கள் தட்டச்சு செய்யப் பழகிய வழியைத் திரும்பப் பெறுவதைத் தவிர்க்க வேண்டும் (நீங்கள் அவசரமாக இருந்தாலும்).

source: If you need assistance with using the software use the help function.
ta: மென்பொருளைப் பயன்படுத்துவதற்கு உங்களுக்கு உதவி தேவைப்பட்டால் உதவி செயல்பாட்டைப் பயன்படுத்தவும்.

# IllustrationDialogAll rights reserved.
source: All rights reserved.
ta: அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை.

# IllustrationDialog&Launch TIPP10
source: &Launch TIPP10
ta: & TIPP10 ஐ அறிமுகப்படுத்துங்கள்

# IllustrationDialogDo&n't show me this window again
source: Do&n't show me this window again
ta: இந்த சாளரத்தை மீண்டும் எனக்குக் காட்ட வேண்டாம்

# LessonDialog&Cancel
source: &Cancel
ta: ரத்துசெய் (&c)

# LessonDialog&Save
source: &Save
ta: சேமி (&s)

# LessonDialog&Help
source: &Help
ta: உதவி (&h)

# LessonDialogName of the lesson (20 characters max.):
source: Name of the lesson (20 characters max.):
ta: பாடத்தின் பெயர் (அதிகபட்சம் 20 எழுத்துக்கள்):

# LessonDialogShort description (120 characters max.):
source: Short description (120 characters max.):
ta: குறுகிய விளக்கம் (120 எழுத்துக்கள் அதிகபட்சம்):

# LessonDialogLesson content (at least two lines):
source: Lesson content (at least two lines):
ta: பாடம் உள்ளடக்கம் (குறைந்தது இரண்டு கோடுகள்):

# LessonDialogSentence Lesson
source: Sentence Lesson
ta: வாக்கிய பாடம்

# LessonDialogEvery line will be completed with a line break at the end
source: Every line will be completed with a line break at the end
ta: ஒவ்வொரு வரியும் முடிக்கப்படும் முடிவில் ஒரு வரி இடைவெளி

source: Every unit (line) will be separated by blanks. A line break passes automatically after at least %1 characters.
ta: ஒவ்வொரு அலகு (வரி) பிரிக்கப்படும் மூலம் வெற்றிடங்கள். ஒரு வரி இடைவெளி கடந்து செல்கிறது குறைந்தது %1 எழுத்துகளுக்குப் பிறகு தானாகவே.

# LessonDialogEdit own Lesson
source: Edit own Lesson
ta: சொந்த பாடத்தைத் திருத்தவும்

# LessonDialogPlease enter the name of the lesson
source: Please enter the name of the lesson
ta: பாடத்தின் பெயரை உள்ளிடவும்

# LessonDialogPlease enter entire lesson content
source: Please enter entire lesson content
ta: முழு பாட உள்ளடக்கத்தையும் உள்ளிடவும்

# LessonDialogPlease enter 400 lines of text maximum
source: Please enter 400 lines of text maximum
ta: உரையின் 400 வரிகளை அதிகபட்சமாக உள்ளிடவும்

source: The name of the lesson already exists. Please enter a new lesson name.
ta: பாடத்தின் பெயர் ஏற்கனவே உள்ளது. புதிய பாடம் பெயரை உள்ளிடவும்.

# LessonDialogWord Lesson
source: Word Lesson
ta: சொல் பாடம்

source: <u>Explanation:</u><br>&nbsp;<br>Every line (separated by Enter key) is equivalent to a unit of the lesson. There are two types of lesson dictation:<br>&nbsp;<br><b>Sentence Lesson</b> - every line (sentence) will be dictated exactly how it was entered here with a line break at the end.<br>&nbsp;<br><b>Word Lesson</b> - the lines will be separated by blanks and a line break passes auomatically after at least %1 characters.
ta: <u> விளக்கம்: </u> <br> & nbsp; <br> ஒவ்வொரு வரியும் (ENTER விசையால் பிரிக்கப்பட்ட) பாடத்தின் ஒரு அலகுக்கு சமம். இரண்டு வகையான பாடம் கட்டளைகள் உள்ளன: <br> & nbsp; <br> <b> வாக்கிய பாடம் </b> - ஒவ்வொரு வரியும் (வாக்கியம்) ஒரு வரி இடைவெளியுடன் இங்கே ஒரு வரி இடைவெளியுடன் எவ்வாறு நுழைந்தது என்று கட்டளையிடப்படும்.

source: <b>What happens when "Intelligence" is enabled?</b><br>With enabled intelligence, the lines to be dictated will be selected depending on the typing mistake quotas instead of dictating them in the right order. Enabling the "Intelligence" only makes sense if the lesson consists of many lines (often "Word Lessons").<br>
ta: <b> "உளவுத்துறை" இயக்கப்பட்டால் என்ன நடக்கும்? </b> <br> இயக்கப்பட்ட நுண்ணறிவுடன், சரியான வரிசையில் கட்டளையிடுவதற்கு பதிலாக தட்டச்சு தவறு ஒதுக்கீட்டைப் பொறுத்து கட்டளையிடப்பட வேண்டிய கோடுகள் தேர்ந்தெடுக்கப்படும். பாடம் பல வரிகளைக் கொண்டிருந்தால் மட்டுமே "நுண்ணறிவை" செயல்படுத்துவது அர்த்தமுள்ளதாக இருக்கும் (பெரும்பாலும் "சொல் பாடங்கள்"). <br>

# LessonDialogDictate the text as:
source: Dictate the text as:
ta: உரையை இவ்வாறு ஆணையிடவும்:

# LessonDialogName of the Lesson:
source: Name of the Lesson:
ta: பாடத்தின் பெயர்:

# LessonDialogCreate own Lesson
source: Create own Lesson
ta: சொந்த பாடத்தை உருவாக்கவும்

# LessonDialogPlease enter at least two lines of text
source: Please enter at least two lines of text
ta: தயவுசெய்து குறைந்தது இரண்டு வரிகளை உள்ளிடவும்

# LessonPrintDialogPrint Lesson
source: Print Lesson
ta: பாடம் அச்சிடுக

# LessonPrintDialog&Print
source: &Print
ta: &அச்சிடு

# LessonPrintDialog&Cancel
source: &Cancel
ta: ரத்துசெய் (&c)

# LessonPrintDialogPlease enter your name:
source: Please enter your name:
ta: உங்கள் பெயரை உள்ளிடவும்:

# LessonResultPrint
source: Print
ta: அச்சிடுக

# LessonResultEntire Lesson
source: Entire Lesson
ta: முழு பாடம்

# LessonResult%L1 min
source: %L1 min
ta: %எல் 1 மணித்துளி

source: You have reached %1 at a typing speed of %2 cpm and %n typing error.
ta: %2 சிபிஎம் மற்றும் %n தட்டச்சு பிழையின் தட்டச்சு வேகத்தில் %1 ஐ எட்டியுள்ளீர்கள்.

# LessonResultSettings
source: Settings
ta: அமைப்புகள்

# LessonResultDuration:
source: Duration:
ta: காலம்:

# LessonResultTyping Errors:
source: Typing Errors:
ta: பிழைகள் தட்டச்சு:

# LessonResultAssistance:
source: Assistance:
ta: உதவி:

# LessonResultResults
source: Results
ta: முடிவுகள்

# LessonResultLesson:
source: Lesson:
ta: பாடம்:

# LessonResultTime:
source: Time:
ta: நேரம்:

# LessonResultCharacters:
source: Characters:
ta: எழுத்துக்கள்:

# LessonResultErrors:
source: Errors:
ta: பிழைகள்:

# LessonResultError Rate:
source: Error Rate:
ta: பிழை வீதம்:

# LessonResultCpm:
source: Cpm:
ta: சிபிஎம்:

# LessonResultDictation
source: Dictation
ta: கட்டளை

# LessonResultTIPP10 Touch Typing Tutor
source: TIPP10 Touch Typing Tutor
ta: TIPP10 தொடு தட்டச்சு ஆசிரியர்

# LessonResultReport
source: Report
ta: அறிக்கை

# LessonResultPrint Report
source: Print Report
ta: அச்சு அறிக்கை

# LessonResult%n minute(s)
source: %n minute
ta: %n மணித்துளி

# LessonResult%n character(s)
source: %n character
ta: %n எழுத்து

# LessonResultError Correction with Backspace
source: Error Correction with Backspace
ta: பேக்ச்பேசுடன் பிழை திருத்தம்

# LessonResultError Correction without Backspace
source: Error Correction without Backspace
ta: பேக்ச்பேச் இல்லாமல் பிழை திருத்தம்

# LessonResultIgnore Errors
source: Ignore Errors
ta: பிழைகளை புறக்கணிக்கவும்

# LessonResultNone
source: None
ta: எதுவுமில்லை

# LessonResultAll
source: All
ta: அனைத்தும்

# LessonResult- Colored Keys
source: - Colored Keys
ta: - வண்ண விசைகள்

# LessonResult- Home Row
source: - Home Row
ta: - வீட்டு வரிசை

# LessonResult- Motion Paths
source: - Motion Paths
ta: - இயக்க பாதைகள்

# LessonResult- Separation Line
source: - Separation Line
ta: - பிரிப்பு வரி

# LessonResult- Instructions
source: - Instructions
ta: - வழிமுறைகள்

# LessonResult%L1 s
source: %L1 s
ta: %எல் 1 கள்

# LessonResult%n point(s)
source: %n point
ta: %n புள்ளி

# LessonSqlModel%L1 s
source: %L1 s
ta: %எல் 1 கள்

# LessonSqlModel%L1 min
source: %L1 min
ta: %எல் 1 மணித்துளி

# LessonSqlModel%L1 %
source: %L1 %
ta: %எல் 1 %

# LessonSqlModel%n point(s)
source: %n point
ta: %n புள்ளி

# LessonTableSqlShow:
source: Show:
ta: காட்டு:

# LessonTableSqlAll Lessons
source: All Lessons
ta: அனைத்து பாடங்களும்

# LessonTableSqlTraining Lessons
source: Training Lessons
ta: பயிற்சி பாடங்கள்

# LessonTableSqlOpen Lessons
source: Open Lessons
ta: திறந்த பாடங்கள்

# LessonTableSqlOwn Lessons
source: Own Lessons
ta: சொந்த பாடங்கள்

# LessonTableSqlLesson
source: Lesson
ta: பாடம்

# LessonTableSqlTime
source: Time
ta: நேரம்

# LessonTableSqlDuration
source: Duration
ta: காலம்

# LessonTableSqlCharacters
source: Characters
ta: எழுத்துக்கள்

# LessonTableSqlErrors
source: Errors
ta: பிழைகள்

# LessonTableSqlRate
source: Rate
ta: விகிதம்

# LessonTableSqlCpm
source: Cpm
ta: சிபிஎம்

# LessonTableSqlScore
source: Score
ta: கெலிப்பெண்

# LessonTableSqlThis column shows the names of completed lessons
source: This column shows the names of completed lessons
ta: இந்த நெடுவரிசை பெயர்களைக் காட்டுகிறது நிறைவு செய்யப்பட்ட பாடங்கள்

# LessonTableSqlStart time of the lesson
source: Start time of the lesson
ta: பாடத்தின் தொடக்க நேரம்

# LessonTableSqlTotal duration of the lesson
source: Total duration of the lesson
ta: பாடத்தின் மொத்த காலம்

# LessonTableSqlNumber of characters dictated
source: Number of characters dictated
ta: கட்டளையிடப்பட்ட எழுத்துக்களின் எண்ணிக்கை

# LessonTableSqlNumber of typing errors
source: Number of typing errors
ta: தட்டச்சு பிழைகளின் எண்ணிக்கை

source: The error rate is calculated as follows: Errors / Characters The lower the error rate the better!
ta: பிழை விகிதம் பின்வருமாறு கணக்கிடப்படுகிறது: பிழைகள் / எழுத்துக்கள் பிழை விகிதம் குறைவாக இருக்கும்!

source: "Cpm" indicates how many characters per minute were entered on average
ta: "சிபிஎம்" நிமிடத்திற்கு எத்தனை எழுத்துக்கள் என்பதைக் குறிக்கிறது சராசரியாக உள்ளிடப்பட்டன

source: The score is calculated as follows: ((Characters - (20 x Errors)) / Duration in minutes) x 0.4 Note that slow typing without errors results in a better ranking, than fast typing with several errors!
ta: மதிப்பெண் பின்வருமாறு கணக்கிடப்படுகிறது: ((எழுத்துக்கள் - (20 ஃச் பிழைகள்)) / நிமிடங்களில் காலம்) ஃச் 0.4 பிழைகள் இல்லாமல் மெதுவாக தட்டச்சு செய்வது a பல பிழைகளுடன் வேகமாக தட்டச்சு செய்வதை விட சிறந்த தரவரிசை!

source: All results of the current lesson will be discarded! Do you really want to exit?
ta: தற்போதைய பாடத்தின் அனைத்து முடிவுகளும் நிராகரிக்கப்படும்! நீங்கள் உண்மையில் வெளியேற விரும்புகிறீர்களா?

# MainWindow&Go
source: &Go
ta: & போ

# MainWindow&Help
source: &Help
ta: உதவி (&h)

# MainWindow&File
source: &File
ta: கோப்பு (&f)

# MainWindow&Settings
source: &Settings
ta: &அமைப்புகள்

# MainWindowE&xit
source: E&xit
ta: வெளியேறு (&x)

# MainWindow&Results
source: &Results
ta: & முடிவுகள்

# MainWindow&Manual
source: &Manual
ta: & கையேடு

# MainWindow on the web
source: on the web
ta: வலையில்

# MainWindowInfo
source: Info
ta: தகவல்

# MainWindow&About
source: &About
ta: & பற்றி

# MainWindowABC-Game
source: ABC-Game
ta: ஏபிசி-விளையாட்டு

# MainWindowSoftware Version
source: Software Version
ta: மென்பொருள் பதிப்பு

# MainWindowDatabase Version
source: Database Version
ta: தரவுத்தள பதிப்பு

# MainWindowIntelligent Touch Typing Tutor
source: Intelligent Touch Typing Tutor
ta: நுண்ணறிவு தொடுதல் தட்டச்சு ஆசிரியர்
