Repository: 247i/TACETr
Catalog: உரை/தானி/tipp10-application-*.po
Languages: ta

# MainWindowOn the web:
source: On the web:
ta: வலையில்:

source: TIPP10 is published under the GNU General Public License and is available for free. You do not have to pay for it wherever you download it!
ta: TIPP10 குனு பொது பொது உரிமத்தின் கீழ் வெளியிடப்படுகிறது மற்றும் இது இலவசமாகக் கிடைக்கிறது. நீங்கள் எங்கு பதிவிறக்கினாலும் அதற்கு நீங்கள் பணம் செலுத்த வேண்டியதில்லை!

# MainWindowAbout
source: About
ta: பற்றி

# MainWindowPortable Version
source: Portable Version
ta: சிறிய பதிப்பு

# ProgressionWidgetTime
source: Time
ta: நேரம்

# ProgressionWidgetShow:
source: Show:
ta: காட்டு:

# ProgressionWidgetAll Lessons
source: All Lessons
ta: அனைத்து பாடங்களும்

# ProgressionWidgetTraining Lessons
source: Training Lessons
ta: பயிற்சி பாடங்கள்

# ProgressionWidgetOpen Lessons
source: Open Lessons
ta: திறந்த பாடங்கள்

# ProgressionWidgetOwn Lessons
source: Own Lessons
ta: சொந்த பாடங்கள்

# ProgressionWidgetOrder by x-axis:
source: Order by x-axis:
ta: எக்ச்-அச்சு மூலம் ஆர்டர்:

# ProgressionWidgetLesson
source: Lesson
ta: பாடம்

# ProgressionWidgetPoints
source: Points
ta: பிரிவகம்

# ProgressionWidgetTraining Lesson
source: Training Lesson
ta: பயிற்சி பாடம்

# ProgressionWidgetOpen Lesson
source: Open Lesson
ta: திறந்த பாடம்

# ProgressionWidgetOwn Lesson
source: Own Lesson
ta: சொந்த பாடம்

# ProgressionWidget%n point(s)
source: %n point
ta: %n புள்ளி

# ProgressionWidget%1 cpm
source: %1 cpm
ta: %1 சிபிஎம்

# ProgressionWidgetThe progress graph will be shown after completing two lessons.
source: The progress graph will be shown after completing two lessons.
ta: இரண்டு பாடங்களை முடித்த பிறகு முன்னேற்ற வரைபடம் காண்பிக்கப்படும்.

# ProgressionWidgetCpm
source: Cpm
ta: சிபிஎம்

# ProgressionWidgetScore
source: Score
ta: கெலிப்பெண்

# QObjectAffected directory:
source: Affected directory:
ta: பாதிக்கப்பட்ட அடைவு:

# QObjecten
source: en
ta: என்

# QObjectLeft little finger
source: Left little finger
ta: இடது சிறிய விரல்

# QObjectLeft ring finger
source: Left ring finger
ta: இடது மோதிர விரல்

# QObjectLeft middle finger
source: Left middle finger
ta: இடது நடுத்தர விரல்

# QObjectLeft forefinger
source: Left forefinger
ta: இடது கைவிரல்

# QObjectRight forefinger
source: Right forefinger
ta: சரியான கைவிரல்

# QObjectRight middle finger
source: Right middle finger
ta: வலது நடுத்தர விரல்

# QObjectRight ring finger
source: Right ring finger
ta: வலது மோதிர விரல்

# QObjectRight little finger
source: Right little finger
ta: வலது சிறிய விரல்

# QObjectThumb
source: Thumb
ta: கட்டைவிரல்

# RegExpDialogFilter for the keyboard layout
source: Filter for the keyboard layout
ta: விசைப்பலகை தளவமைப்புக்கு வடிகட்டவும்

# RegExpDialogLimitation of characters
source: Limitation of characters
ta: எழுத்துக்களின் வரம்பு

source: You should try to avoid using characters not supported by your keyboard layout. A filter as a regular expression is applied to all practice texts before the lesson begins. You should only make changes here if you are familiar with regular expressions.
ta: உங்கள் விசைப்பலகை தளவமைப்பால் ஆதரிக்கப்படாத எழுத்துக்களைப் பயன்படுத்துவதைத் தவிர்க்க முயற்சிக்க வேண்டும். பாடம் தொடங்குவதற்கு முன்பு அனைத்து நடைமுறை நூல்களுக்கும் வழக்கமான வெளிப்பாடாக ஒரு வடிகட்டி பயன்படுத்தப்படுகிறது. வழக்கமான வெளிப்பாடுகளை நீங்கள் அறிந்திருந்தால் மட்டுமே இங்கே மாற்றங்களைச் செய்ய வேண்டும்.

# RegExpDialogReplacement Filter
source: Replacement Filter
ta: மாற்று வடிகட்டி

source: Filtering unauthorized characters can produce texts that make little sense (e.g., by removing umlauts). You can define replacements that will be applied before the limitation of characters is applied. Please follow the example here that replaces all Germans umlauts and the ß symbol: ae=ae,oe=oe,ue=ue,Ae=Ae,Oe=Oe,Ue=Ue,ss=ss
ta: அங்கீகரிக்கப்படாத எழுத்துக்களை வடிகட்டுவது சிறிய அர்த்தமுள்ள நூல்களை உருவாக்க முடியும் (எ.கா., உம்லாட்சை அகற்றுவதன் மூலம்). எழுத்துக்களின் வரம்பு பயன்படுத்தப்படுவதற்கு முன்பு பயன்படுத்தப்படும் மாற்றீடுகளை நீங்கள் வரையறுக்கலாம். அனைத்து சேர்மனியர்களையும் ß சின்னத்தையும் மாற்றும் உதாரணத்தை இங்கே பின்பற்றவும்: ae = ae, oe = oe, ue = ue, ae = ae, oe = oe, ue = ue, ss = ss

# SettingsSome of your settings require a restart of the software to take effect.
source: Some of your settings require a restart of the software to take effect.
ta: உங்கள் சில அமைப்புகளுக்கு மென்பொருளை மறுதொடக்கம் செய்ய வேண்டும்.

source: All data for completed lessons for the current user will be deleted and the lesson list will return to its original state after initial installation! Do you really want to continue?
ta: தற்போதைய பயனருக்கான நிறைவு செய்யப்பட்ட பாடங்களுக்கான அனைத்து தரவும் நீக்கப்படும் ஆரம்ப நிறுவலுக்குப் பிறகு பாடம் பட்டியல் அதன் அசல் நிலைக்குத் திரும்பும்! நீங்கள் உண்மையில் தொடர விரும்புகிறீர்களா?

# SettingsThe data for completed lessons was successfully deleted!
source: The data for completed lessons was successfully deleted!
ta: நிறைவு செய்யப்பட்ட பாடங்களுக்கான தரவு வெற்றிகரமாக நீக்கப்பட்டது!

source: All recorded characters (mistake quotas) of the current user will be deleted and the character list will return to its original state after initial installation! Do you really want to continue?
ta: தற்போதைய பயனரின் அனைத்து பதிவு செய்யப்பட்ட எழுத்துக்களும் (தவறு ஒதுக்கீடுகள்) நீக்கப்படும் மற்றும் ஆரம்ப நிறுவலுக்குப் பிறகு எழுத்து பட்டியல் அதன் அசல் நிலைக்குத் திரும்பும்! நீங்கள் உண்மையில் தொடர விரும்புகிறீர்களா?

# SettingsThe recorded characters were successfully deleted!
source: The recorded characters were successfully deleted!
ta: பதிவுசெய்யப்பட்ட எழுத்துக்கள் வெற்றிகரமாக நீக்கப்பட்டன!

# SettingsSettings
source: Settings
ta: அமைப்புகள்

# SettingsTraining
source: Training
ta: பயிற்சி

# SettingsTicker
source: Ticker
ta: டிக்கர்

# SettingsHere you can select the background color
source: Here you can select the background color
ta: இங்கே நீங்கள் பின்னணி நிறத்தைத் தேர்ந்தெடுக்கலாம்

# SettingsHere you can select the font color
source: Here you can select the font color
ta: இங்கே நீங்கள் எழுத்துரு வண்ணத்தைத் தேர்ந்தெடுக்கலாம்

# SettingsCursor:
source: Cursor:
ta: கர்சர்:

source: Here you can change the font of the ticker (a font size larger than 20 pt is not recommended)
ta: இங்கே நீங்கள் டிக்கரின் எழுத்துருவை மாற்றலாம் (20 PT ஐ விட பெரிய எழுத்துரு அளவு பரிந்துரைக்கப்படவில்லை)

# SettingsChange &Font
source: Change &Font
ta: மாற்றம் & எழுத்துரு

# SettingsHere can select the color of the cursor for the current character
source: Here can select the color of the cursor for the current character
ta: தற்போதைய எழுத்துக்கு கர்சரின் நிறத்தை இங்கே தேர்ந்தெடுக்கலாம்

# SettingsFont:
source: Font:
ta: எழுத்துரு:

# SettingsFont Color:
source: Font Color:
ta: எழுத்துரு நிறம்:

# SettingsBackground:
source: Background:
ta: பின்னணி:

# SettingsSpeed:
source: Speed:
ta: வேகம்:

# SettingsOff
source: Off
ta: அணை

source: Here you can change the speed of the ticker (Slider on the left: Ticker does not move until reaching the end of line. Slider on the right: The ticker moves very fast.)
ta: இங்கே நீங்கள் டிக்கரின் வேகத்தை மாற்றலாம் (இடதுபுறத்தில் ச்லைடர்: வரியின் முடிவை அடையும் வரை டிக்கர் நகராது. வலதுபுறத்தில் ச்லைடர்: டிக்கர் மிக வேகமாக நகர்கிறது.)

# SettingsFast
source: Fast
ta: வேகமாக

# SettingsAudio Output
source: Audio Output
ta: ஆடியோ வெளியீடு

# SettingsHere you can activate a metronome
source: Here you can activate a metronome
ta: இங்கே நீங்கள் ஒரு மெட்ரோனோம் செயல்படுத்தலாம்

# SettingsMetronome:
source: Metronome:
ta: மெட்ரோனோம்:

# SettingsSelect how often the metronome sound should appear per minute
source: Select how often the metronome sound should appear per minute
ta: ஒரு நிமிடத்திற்கு மெட்ரோனோம் ஒலி எவ்வளவு அடிக்கடி தோன்ற வேண்டும் என்பதைத் தேர்ந்தெடுக்கவும்

# Settings cpm
source: cpm
ta: சிபிஎம்

# SettingsLanguage
source: Language
ta: மொழி

# SettingsAdvanced
source: Advanced
ta: மேம்பட்ட

# SettingsTraining Lessons:
source: Training Lessons:
ta: பயிற்சி பாடங்கள்:

source: The training lessons you have chosen are not suited for the keyboard layout. You can continue but you may have to put aside some keys from the beginning.
ta: நீங்கள் தேர்ந்தெடுத்த பயிற்சி பாடங்கள் விசைப்பலகை தளவமைப்புக்கு பொருந்தாது. நீங்கள் தொடரலாம், ஆனால் ஆரம்பத்தில் இருந்தே சில சாவிகளை ஒதுக்கி வைக்க வேண்டியிருக்கும்.

# SettingsKeyboard Layout:
source: Keyboard Layout:
ta: விசைப்பலகைத் தளவமைப்பு:

# SettingsResults
source: Results
ta: முடிவுகள்

# SettingsUser Data
source: User Data
ta: பயனர் தரவு

source: Here you can reset all saved lesson data (the lessons will be empty as they were after initial installation
ta: சேமித்த அனைத்து பாடம் தரவையும் இங்கே நீங்கள் மீட்டமைக்கலாம் (ஆரம்ப நிறுவலுக்குப் பிறகு பாடங்கள் காலியாக இருக்கும்

# SettingsReset &completed lessons
source: Reset &completed lessons
ta: மீட்டமை மற்றும் பாடங்களை நிறைவு செய்தது

source: Here you can reset all recorded keystrokes and typing mistakes (the characters will be empty as they were after initial installation)
ta: இங்கே நீங்கள் பதிவுசெய்யப்பட்ட அனைத்து விசை அழுத்தங்களையும், தட்டச்சு தவறுகளையும் மீட்டமைக்கலாம் (ஆரம்ப நிறுவலுக்குப் பிறகு எழுத்துக்கள் காலியாக இருக்கும்)

# SettingsReset all &recorded characters
source: Reset all &recorded characters
ta: அனைத்து மற்றும் பதிவு செய்யப்பட்ட எழுத்துக்களையும் மீட்டமைக்கவும்

# SettingsOther
source: Other
ta: மற்றொன்று

# SettingsWindows
source: Windows
ta: சாளரங்கள்

source: Here you can decide if an information window with tips is shown at the beginning
ta: உதவிக்குறிப்புகளைக் கொண்ட செய்தி சாளரம் ஆரம்பத்தில் காட்டப்பட்டுள்ளதா என்பதை இங்கே நீங்கள் தீர்மானிக்கலாம்

# SettingsShow welcome message at startup
source: Show welcome message at startup
ta: தொடக்கத்தில் வரவேற்பு செய்தியைக் காட்டு

source: Here you can define whether a warning window is displayed when an open or own lesson with active intelligence is started
ta: செயலில் உள்ள நுண்ணறிவுடன் திறந்த அல்லது சொந்த பாடம் தொடங்கப்படும்போது எச்சரிக்கை சாளரம் காட்டப்படுகிறதா என்பதை இங்கே நீங்கள் வரையறுக்கலாம்

# SettingsRemember enabled intelligence before starting an open or own lesson
source: Remember enabled intelligence before starting an open or own lesson
ta: தொடங்குவதற்கு முன் செயல்படுத்தப்பட்ட நுண்ணறிவை நினைவில் கொள்க ஒரு திறந்த அல்லது சொந்த பாடம்

source: Change duration of the lesson automatically to "Entire lesson" when disabling the intelligence
ta: பாடத்தின் காலத்தை தானாக மாற்றவும் உளவுத்துறையை முடக்கும்போது "முழு பாடம்"

# StartWidgetTraining Lessons
source: Training Lessons
ta: பயிற்சி பாடங்கள்

# StartWidgetSubject:
source: Subject:
ta: பொருள்:

# StartWidget&Edit
source: &Edit
ta: திருத்து (&e)

# StartWidget&New Lesson
source: &New Lesson
ta: புதிய பாடம்

# StartWidget&Import Lesson
source: &Import Lesson
ta: & பாடம் இறக்குமதி

# StartWidget&Export Lesson
source: &Export Lesson
ta: & ஏற்றுமதி பாடம்

# StartWidget&Edit Lesson
source: &Edit Lesson
ta: & பாடத்தைத் திருத்து

# StartWidget&Delete Lesson
source: &Delete Lesson
ta: & பாடத்தை நீக்கு

# StartWidgetDuration of Lesson
source: Duration of Lesson
ta: பாடத்தின் காலம்

# StartWidgetTime Limit:
source: Time Limit:
ta: கால அவகாசம்:

# StartWidgetThe dictation will be stopped after a specified time period
source: The dictation will be stopped after a specified time period
ta: ஆணையிட்ட பிறகு நிறுத்தப்படும் ஒரு குறிப்பிட்ட கால காலம்

# StartWidget minutes
source: minutes
ta: நிமிடங்கள்

# StartWidgetCharacter Limit:
source: Character Limit:
ta: எழுத்து வரம்பு:

# StartWidget characters
source: characters
ta: எழுத்துக்கள்

source: The dictation will be stopped after a specified number of correctly typed characters
ta: ஆணையிட்ட பிறகு நிறுத்தப்படும் சரியாக தட்டச்சு செய்யப்பட்ட ஒரு குறிப்பிட்ட எண்ணிக்கையிலான எழுத்துக்கள்

# StartWidgetEntire Lesson
source: Entire Lesson
ta: முழு பாடம்

# StartWidgetThe complete lesson will be dictated from beginning to end
source: The complete lesson will be dictated from beginning to end
ta: முழுமையான பாடம் கட்டளையிடப்படும் துவக்கம் முதல் இறுதி வரை

# StartWidget(Entire Lesson)
source: (Entire Lesson)
ta: (முழு பாடம்)

# StartWidgetResponse to Typing Errors
source: Response to Typing Errors
ta: பிழைகளைத் தட்டச்சு செய்வதற்கான பதில்

# StartWidgetBlock Typing Errors
source: Block Typing Errors
ta: தட்டச்சு பிழைகள்

# StartWidgetThe dictation will only proceed if the correct key was pressed
source: The dictation will only proceed if the correct key was pressed
ta: சரியானால் மட்டுமே கட்டளை தொடரும் விசை அழுத்தப்பட்டது

# StartWidgetCorrection with Backspace
source: Correction with Backspace
ta: பேக்ச்பேசுடன் திருத்தம்

# StartWidgetTyping errors have to be removed with the return key
source: Typing errors have to be removed with the return key
ta: தட்டச்சு பிழைகள் அகற்றப்பட வேண்டும் திரும்பும் விசையுடன்

# StartWidgetAudible Signal
source: Audible Signal
ta: கேட்கக்கூடிய சமிக்ஞை

# StartWidgetA beep sounds with every typing error
source: A beep sounds with every typing error
ta: ஒவ்வொரு தட்டச்சு பிழையுடனும் ஒரு பீப் ஒலிக்கிறது

# StartWidgetShow key picture
source: Show key picture
ta: முக்கிய படத்தைக் காட்டு

source: For every typing error the corresponding key picture is displayed on the keyboard
ta: ஒவ்வொரு தட்டச்சு பிழைக்கும் தொடர்புடைய முக்கிய படம் விசைப்பலகையில் காட்டப்படும்

source: *The text of the lesson will not be dictated in its intended sequence, but will be adjusted in real time to your typing errors.
ta: *பாடத்தின் உரை அதன் நோக்கம் கொண்ட வரிசையில் கட்டளையிடப்படாது, ஆனால் உங்கள் தட்டச்சு பிழைகளுக்கு உண்மையான நேரத்தில் சரிசெய்யப்படும்.

source: *Select this option if the text of the lesson will not be dictated in its intended sequence, but will be adjusted in real time to your typing errors.
ta: *பாடத்தின் உரை அதன் நோக்கம் கொண்ட வரிசையில் கட்டளையிடப்படாவிட்டால் இந்த விருப்பத்தைத் தேர்ந்தெடுக்கவும், ஆனால் உங்கள் தட்டச்சு பிழைகளுக்கு உண்மையான நேரத்தில் சரிசெய்யப்படும்.

# StartWidgetIntelligence
source: Intelligence
ta: நுண்ணறிவு

source: Based on the current error rates of all characters, the wordsand phrases of the dictation will be selected in real time.On the other hand, if the intelligence box is not checked, the text ofthe lesson is always dictated in the same order.
ta: எல்லா எழுத்துகளின் தற்போதைய பிழை விகிதங்களின் அடிப்படையில், கட்டளையின் சொற்கள் மற்றும் சொற்றொடர்கள் உண்மையான நேரத்தில் தேர்ந்தெடுக்கப்படும். மறுபுறம், உளவுத்துறை பெட்டி சரிபார்க்கப்படாவிட்டால், பாடத்தின் உரை எப்போதும் ஒரே வரிசையில் கட்டளையிடப்படுகிறது.

# StartWidgetAssistance
source: Assistance
ta: உதவி

# StartWidgetShow Keyboard
source: Show Keyboard
ta: விசைப்பலகை காட்டு

source: For visual support, the virtual keyboard and status information is shown
ta: காட்சி ஆதரவுக்கு, மெய்நிகர் விசைப்பலகை மற்றும் நிலை செய்தி காட்டப்பட்டுள்ளது

# StartWidgetColored Keys
source: Colored Keys
ta: வண்ண விசைகள்

# StartWidgetFor visual support pressing keys will be marked with colors
source: For visual support pressing keys will be marked with colors
ta: காட்சி ஆதரவுக்கு அழுத்தும் விசைகள் இருக்கும் வண்ணங்களால் குறிக்கப்பட்டுள்ளது

# StartWidgetHome Row
source: Home Row
ta: வீட்டு வரிசை

source: For visual support, the remaining fingers of the home row will be colored
ta: காட்சி ஆதரவுக்காக, மீதமுள்ள விரல்கள் வீட்டு வரிசையில் வண்ணமயமானதாக இருக்கும்

# StartWidgetL/R Separation Line
source: L/R Separation Line
ta: எல்/ஆர் பிரிப்பு வரி

source: For visual support a separation line between left and right hand will be shown
ta: காட்சி ஆதரவுக்காக இடது இடது இடையே ஒரு பிரிப்பு வரி வலது கை காண்பிக்கப்படும்

# StartWidgetInstruction
source: Instruction
ta: வழிமுறைகள்

# StartWidgetShow fingers to be used in the status bar
source: Show fingers to be used in the status bar
ta: நிலை பட்டியில் பயன்படுத்த வேண்டிய விரல்களைக் காட்டு

# StartWidgetMotion Paths
source: Motion Paths
ta: இயக்க பாதைகள்

# StartWidgetMotion paths of the fingers will be shown on the keyboard
source: Motion paths of the fingers will be shown on the keyboard
ta: விரல்களின் இயக்க பாதைகள் காண்பிக்கப்படும் விசைப்பலகையில்

# StartWidget&Help
source: &Help
ta: உதவி (&h)

# StartWidget&Start Training
source: &Start Training
ta: & பயிற்சியைத் தொடங்குங்கள்

# StartWidgetAll
source: All
ta: அனைத்தும்

# StartWidgetOpen Lessons
source: Open Lessons
ta: திறந்த பாடங்கள்

source: At the moment open lessons only exists in German language. We hope to provide open lessons in English soon.
ta: இந்த நேரத்தில் திறந்த பாடங்கள் செர்மன் மொழியில் மட்டுமே உள்ளன. விரைவில் ஆங்கிலத்தில் திறந்த பாடங்களை வழங்குவோம் என்று நம்புகிறோம்.

# StartWidgetOwn Lessons
source: Own Lessons
ta: சொந்த பாடங்கள்

# StartWidgetPlease select a text file
source: Please select a text file
ta: உரை கோப்பைத் தேர்ந்தெடுக்கவும்

# StartWidgetText files (*.txt)
source: Text files (*.txt)
ta: உரை கோப்புகள் (*.txt)

# StartWidgetPlease indicate the location of a text file
source: Please indicate the location of a text file
ta: உரை கோப்பின் இருப்பிடத்தைக் குறிக்கவும்

source: Do you really want to delete the lesson, and all the recorded data in the context of this lesson?
ta: இந்த பாடத்தின் சூழலில் பாடத்தையும் பதிவு செய்யப்பட்ட அனைத்து தரவையும் நீக்க விரும்புகிறீர்களா?

# TickerBoardPress space bar to proceed
source: Press space bar to proceed
ta: தொடர விண்வெளி பட்டியை அழுத்தவும்

# TickerBoardDictation Finished
source: Dictation Finished
ta: கட்டளை முடிந்தது

# TrainingWidget&Pause
source: &Pause
ta: & இடைநிறுத்தம்

# TrainingWidget&Cancel
source: &Cancel
ta: ரத்துசெய் (&c)

# TrainingWidget&Help
source: &Help
ta: உதவி (&h)

# TrainingWidgetPress space bar to start
source: Press space bar to start
ta: தொடங்க விண்வெளி பட்டியை அழுத்தவும்

# TrainingWidgetTake Home Row position
source: Take Home Row position
ta: வீட்டு வரிசை நிலையை எடுத்துக் கொள்ளுங்கள்

# TrainingWidgetDo you really want to exit the lesson early?
source: Do you really want to exit the lesson early?
ta: நீங்கள் உண்மையில் ஆரம்பத்தில் பாடத்திலிருந்து வெளியேற விரும்புகிறீர்களா?

# TrainingWidgetDo you want to save your results?
source: Do you want to save your results?
ta: உங்கள் முடிவுகளைச் சேமிக்க விரும்புகிறீர்களா?

# TrainingWidgetE&xit Lesson early
source: E&xit Lesson early
ta: ஈ & சிட் பாடம் ஆரம்பத்தில்

# TrainingWidgetErrors:
source: Errors:
ta: பிழைகள்:

# TrainingWidgetCpm:
source: Cpm:
ta: சிபிஎம்:

# TrainingWidgetTime:
source: Time:
ta: நேரம்:

# TrainingWidgetCharacters:
source: Characters:
ta: எழுத்துக்கள்:
