Repository: 247i/TACETr
Catalog: உரை/தானி/tor-onionsprouts-bot-*.po
Languages: ta

source: %d second
ta: %d இரண்டாவது

source: %d day
ta: %d நாள்

source: %d hour
ta: %d மணி

source: %d minute
ta: %d மணித்துளி

source: We are preparing your download...
ta: உங்கள் பதிவிறக்கத்தை நாங்கள் ஆயத்தம் செய்கிறோம் ...

source: We're now sending the file to Telegram, it will be ready in %s!
ta: நாங்கள் இப்போது கோப்பை டெலிகிராமிற்கு அனுப்புகிறோம், அது %s இல் தயாராக இருக்கும்!

source: You're the first person to request this file, so we have to download it first! Please wait...
ta: இந்த கோப்பைக் கோரிய முதல் நபர் நீங்கள், எனவே நாங்கள் அதை முதலில் பதிவிறக்கம் செய்ய வேண்டும்! தயவுசெய்து காத்திருங்கள் ...

source: We are uploading the signature file first...
ta: நாங்கள் முதலில் கையொப்பக் கோப்பைப் பதிவேற்றுகிறோம் ...

source: We are now uploading Tor Browser...
ta: நாங்கள் இப்போது டோர் உலாவியைப் பதிவேற்றுகிறோம் ...

source: Success!
ta: வெற்றி!

source: Here's your download
ta: இங்கே உங்கள் பதிவிறக்கம்

source: Stay safe!
ta: பாதுகாப்பாக இருங்கள்!

source: Main Menu
ta: முதன்மை பட்டியல்

source: Reason:
ta: காரணம்:

source: Failure!
ta: தோல்வி!

source: Something went wrong during the upload! Please try again later.
ta: பதிவேற்றத்தின் போது ஏதோ தவறு ஏற்பட்டது! தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும்.

source: Tor Browser Mirrors
ta: டோர் உலாவி கண்ணாடிகள்

source: (You should also include your operating system: Windows, macOS, or Linux)
ta: (உங்கள் இயக்க முறைமையும் நீங்கள் சேர்க்க வேண்டும்: சாளரங்கள், மேகோச் அல்லது லினக்ச்)

source: (Make sure that your email provider is safe!)
ta: (உங்கள் மின்னஞ்சல் வழங்குநர் பாதுகாப்பாக இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்!)

source: Go Back
ta: திரும்பிச் செல்லுங்கள்

source: Tor Bridges
ta: டோர் பாலங்கள்

source: You can request a bridge from {username}. Please keep in mind that you will also have to configure Tor Browser accordingly in order to use it.
ta: {பயனர்பெயர் இருந்து இலிருந்து ஒரு பாலத்தை நீங்கள் கோரலாம். டோர் உலாவியைப் பயன்படுத்த நீங்கள் அதற்கேற்ப கட்டமைக்க வேண்டும் என்பதை நினைவில் கொள்ளுங்கள்.

source: Wait, what are Tor bridges?
ta: காத்திருங்கள், டோர் பாலங்கள் என்றால் என்ன?

source: What is Tor?
ta: டோர் என்றால் என்ன?

source: Tor is a network that lets you anonymously connect to the Internet, while evading censorship, people monitoring of your Internet connection and ad tracking.
ta: டோர் என்பது ஒரு பிணையமாகும், இது இணையத்துடன் அநாமதேயமாக இணைக்க உங்களை அனுமதிக்கிறது, தணிக்கை, உங்கள் இணைய இணைப்பு மற்றும் விளம்பர கண்காணிப்பைக் கண்காணிக்கும் நபர்கள்.

source: The network is peer-to-peer and largely supported by volunteers, as well as The Tor Project Inc., a non-profit organization based in the United States.
ta: பிணையம் பியர்-டு-பியர் மற்றும் பெரும்பாலும் தன்னார்வலர்களால் ஆதரிக்கப்படுகிறது, அதே போல் அமெரிக்காவை தளமாகக் கொண்ட ஒரு இலாப நோக்கற்ற அமைப்பான டோர் ப்ராசெக்ட் இன்க்.

source: What are Tor bridges?
ta: டோர் பாலங்கள் என்றால் என்ன?

source: Tor bridges are computers that can be very helpful when your internet provider has blocked you from using Tor, or if you just want to hide the fact that you are using Tor from anyone that could be monitoring your internet connection. That could be your internet provider, government, household members, school, workplace, among others.
ta: டோர் பிரிட்சச் என்பது கணினிகள் ஆகும், அவை உங்கள் இணைய வழங்குநர் டோரைப் பயன்படுத்துவதைத் தடுத்தபோது மிகவும் உதவியாக இருக்கும், அல்லது உங்கள் இணைய இணைப்பைக் கண்காணிக்கக்கூடிய யாரிடமிருந்தும் நீங்கள் TOR ஐப் பயன்படுத்துகிறீர்கள் என்ற உண்மையை மறைக்க விரும்பினால். அது உங்கள் இணைய வழங்குநர், அரசு, வீட்டு உறுப்பினர்கள், பள்ளி, பணியிடமாக இருக்கலாம்.

source: If the Tor network is blocked in your country, you can use a bridge to gain access again. Bridges are also a good idea to use if you want to use Tor in a discreet manner.
ta: உங்கள் நாட்டில் TOR பிணையம் தடுக்கப்பட்டால், மீண்டும் அணுகலைப் பெற ஒரு பாலத்தைப் பயன்படுத்தலாம். நீங்கள் புத்திசாலித்தனமான முறையில் TOR ஐப் பயன்படுத்த விரும்பினால் பாலங்கள் பயன்படுத்துவது நல்லது.

source: Cool, how do I get one?
ta: கூல், நான் ஒன்றை எவ்வாறு பெறுவது?

source: Need support?
ta: உதவி தேவையா?

source: If you need support with anything that has to do with Tor, the Tor user support team can be reached on Telegram: {username}. There's also a dedicated active forum where anyone can post a question, feedback, or concern: {link}
ta: TOR உடன் தொடர்புடைய எதையும் உங்களுக்கு உதவி தேவைப்பட்டால், TOR பயனர் உதவி குழுவை டெலிகிராமில் அணுகலாம்: {பயனர்பெயர்}. ஒரு பிரத்யேக செயலில் உள்ள மன்றமும் உள்ளது, அங்கு எவரும் ஒரு கேள்வி, கருத்து அல்லது கவலையை இடுகையிடலாம்: {இணைப்பு}

source: Download Tor from Telegram
ta: டெலிகிராமில் இருந்து டோர் பதிவிறக்கவும்

source: Which operating system are you using?
ta: நீங்கள் எந்த இயக்க முறைமையைப் பயன்படுத்துகிறீர்கள்?

source: The version you have requested **(%s)** hasn't been uploaded to Telegram's servers yet. Please wait...
ta: நீங்கள் கோரிய பதிப்பு ** (%s) ** டெலிகிராமின் சேவையகங்களில் இன்னும் பதிவேற்றப்படவில்லை. தயவுசெய்து காத்திருங்கள் ...

source: Language selection
ta: மொழி தேர்வு

source: Please select your language:
ta: உங்கள் மொழியைத் தேர்ந்தெடுக்கவும்:

source: GetTor
ta: கெட்டர்

source: Change Language
ta: மொழியை மாற்றவும்

source: Welcome!
ta: உங்களை வரவேற்கிறோம்!

source: Hi, welcome to {name}!
ta: ஆய், {பெயர் க்கு க்கு வருக!

source: What do you want me to do?
ta: நான் என்ன செய்ய விரும்புகிறீர்கள்?

source: Send me Tor Browser
ta: எனக்கு டோர் உலாவி அனுப்புங்கள்

source: More...
ta: மேலும் ...

source: What do you want to know?
ta: நீங்கள் என்ன தெரிந்து கொள்ள விரும்புகிறீர்கள்?

source: Send me other mirrors for Tor Browser
ta: டோர் உலாவிக்கு மற்ற கண்ணாடியை எனக்கு அனுப்புங்கள்

source: Send me Tor bridges.
ta: எனக்கு டோர் பிரிட்சச் அனுப்புங்கள்.

source: Explain what Tor bridges are.
ta: டோர் பாலங்கள் என்றால் என்ன என்பதை விளக்குங்கள்.

source: Explain what Tor is.
ta: டோர் என்றால் என்ன என்பதை விளக்குங்கள்.

source: I have other questions.
ta: எனக்கு வேறு கேள்விகள் உள்ளன.
