Repository: 247i/TACETr
Catalog: உரை/தானி/tor-tor-browser-tb-torconnectproperties-*.po
Languages: ta

# torConnect.titlebarStatusName
source: Tor connection
ta: TOR இணைப்பு

# torConnect.titlebarStatusNotConnected
source: Not connected
ta: இணைக்கப்படவில்லை

# torConnect.titlebarStatusConnecting
source: Connecting…
ta: இணைத்தல்…

# torConnect.titlebarStatusPotentiallyBlocked
source: Potentially blocked
ta: தடுக்கப்பட்டதாக இருக்கும்

# torConnect.titlebarStatusConnected
source: Connected
ta: இணைக்கப்பட்டுள்ளது

# torConnect.torConnect
source: Connect to Tor
ta: Tor உடன் இணை

# torConnect.torConnecting
source: Establishing a Connection
ta: இணைப்பை நிறுவுகிறது

# torConnect.tryingAgain
source: Trying again…
ta: மீண்டும் முயற்சிக்கிறேன்…

# torConnect.noInternet
source: Tor Browser couldn’t reach the Internet
ta: டோர் உலாவி இணையத்தை அடைய முடியவில்லை

# torConnect.noInternetDescription
source: This could be due to a connection issue rather than Tor being blocked. Check your Internet connection, proxy and firewall settings before trying again.
ta: டோர் தடுக்கப்படுவதை விட இணைப்பு சிக்கல் காரணமாக இது இருக்கலாம். மீண்டும் முயற்சிக்கும் முன் உங்கள் இணைய இணைப்பு, பதிலாள் மற்றும் ஃபயர்வால் அமைப்புகளை சரிபார்க்கவும்.

# torConnect.torBootstrapFailed
source: Tor failed to establish a Tor network connection.
ta: டோர் பிணையம் இணைப்பை நிறுவ டோர் தவறிவிட்டார்.

# torConnect.couldNotConnect
source: Tor Browser could not connect to Tor
ta: TOR உலாவியால் TOR உடன் இணைக்க முடியவில்லை

# torConnect.configureConnection
source: configure your connection
ta: உங்கள் இணைப்பை உள்ளமைக்கவும்

# torConnect.assistDescription
source: If Tor is blocked in your location, trying a bridge may help. Connection assist can choose one for you using your location, or you can %S manually instead.
ta: உங்கள் இருப்பிடத்தில் டோர் தடுக்கப்பட்டால், ஒரு பாலத்தை முயற்சிப்பது உதவக்கூடும். இணைப்பு உதவி உங்கள் இருப்பிடத்தைப் பயன்படுத்தி ஒன்றைத் தேர்வுசெய்யலாம் அல்லது அதற்கு பதிலாக கைமுறையாக %எச் செய்யலாம்.

# torConnect.tryingBridge
source: Trying a bridge…
ta: ஒரு பாலம் முயற்சிக்கிறது…

# torConnect.tryingBridgeAgain
source: Trying one more time…
ta: இன்னும் ஒரு முறை முயற்சிக்கிறது…

# torConnect.errorLocation
source: Tor Browser couldn’t locate you
ta: டோர் உலாவியால் உங்களைக் கண்டுபிடிக்க முடியவில்லை

# torConnect.errorLocationDescription
source: Tor Browser needs to know your location in order to choose the right bridge for you. If you’d rather not share your location, %S manually instead.
ta: உங்களுக்காக சரியான பாலத்தைத் தேர்வுசெய்ய டோர் உலாவி உங்கள் இருப்பிடத்தை அறிந்து கொள்ள வேண்டும். உங்கள் இருப்பிடத்தை நீங்கள் பகிரவில்லை என்றால், அதற்கு பதிலாக %கள் கைமுறையாக.

# torConnect.isLocationCorrect
source: Are these location settings correct?
ta: இந்த இருப்பிட அமைப்புகள் சரியானதா?

# torConnect.isLocationCorrectDescription
source: Tor Browser still couldn’t connect to Tor. Please check your location settings are correct and try again, or %S instead.
ta: டோர் உலாவி இன்னும் டோருடன் இணைக்க முடியவில்லை. தயவுசெய்து உங்கள் இருப்பிட அமைப்புகள் சரியானவை என்பதைச் சரிபார்த்து மீண்டும் முயற்சிக்கவும், அல்லது அதற்கு பதிலாக %கள்.

# torConnect.finalError
source: Tor Browser still cannot connect
ta: டோர் உலாவி இன்னும் இணைக்க முடியாது

# torConnect.finalErrorDescription
source: Despite its best efforts, connection assist was not able to connect to Tor. Try troubleshooting your connection and adding a bridge manually instead.
ta: அதன் சிறந்த முயற்சிகள் இருந்தபோதிலும், இணைப்பு உதவியால் TOR உடன் இணைக்க முடியவில்லை. உங்கள் இணைப்பை சரிசெய்து, அதற்கு பதிலாக கைமுறையாக ஒரு பாலத்தை சேர்க்க முயற்சிக்கவும்.

# torConnect.breadcrumbAssist
source: Connection assist
ta: இணைப்பு உதவி

# torConnect.breadcrumbLocation
source: Location settings
ta: இருப்பிட அமைப்புகள்

# torConnect.breadcrumbTryBridge
source: Try a bridge
ta: ஒரு பாலத்தை முயற்சிக்கவும்

# torConnect.restartTorBrowser
source: Restart Tor Browser
ta: டோர் உலாவியை மறுதொடக்கம் செய்யுங்கள்

# torConnect.torConfigure
source: Configure Connection…
ta: இணைப்பை உள்ளமைக்கவும்…

# torConnect.viewLog
source: View logs…
ta: பதிவுகளைக் காண்க…

# torConnect.torConnectButton
source: Connect
ta: இணைக்க

# torConnect.cancel
source: Cancel
ta: நிராகரி

# torConnect.torConnected
source: Connected to the Tor network!
ta: TOR நெட்வொர்க்குடன் இணைக்கப்பட்டுள்ளது!

# torConnect.tryAgain
source: Try Again
ta: மீண்டும் முயற்சிக்கவும்

# torConnect.yourLocation
source: Your Location
ta: உங்கள் இருப்பிடம்

# torConnect.unblockInternetIn
source: Unblock the Internet in
ta: இணையத்தைத் தடைசெய்க

# torConnect.tryBridge
source: Try a Bridge
ta: ஒரு பாலத்தை முயற்சிக்கவும்

# torConnect.automatic
source: Automatic
ta: தானியங்கி

# torConnect.selectCountryRegion
source: Select Country or Region
ta: நாடு அல்லது பிராந்தியத்தைத் தேர்ந்தெடுக்கவும்

# torConnect.frequentLocations
source: Frequently selected locations
ta: அடிக்கடி தேர்ந்தெடுக்கப்பட்ட இடங்கள்

# torConnect.otherLocations
source: Other locations
ta: பிற இடங்கள்

# torConnect.offline
source: Internet not reachable
ta: இணையம் அடைய முடியாது

# torConnect.autoBootstrappingFailed
source: Automatic configuration failed
ta: தானியங்கி உள்ளமைவு தோல்வியடைந்தது

# torConnect.autoBootstrappingAllFailed
source: None of the configurations we tried worked
ta: நாங்கள் முயற்சித்த உள்ளமைவுகள் எதுவும் வேலை செய்யவில்லை

# torConnect.cannotDetermineCountry
source: Unable to determine user country
ta: பயனர் நாட்டை தீர்மானிக்க முடியவில்லை

# torConnect.noSettingsForCountry
source: No settings available for your location
ta: உங்கள் இருப்பிடத்திற்கு அமைப்புகள் எதுவும் கிடைக்கவில்லை
