Repository: 247i/TACETr
Catalog: உரை/தானி/tor-tor-vpn-*.po
Languages: ta

# app_name
source: Tor VPN
ta: டோர் வி.பி.என்

# action_save
source: Save
ta: சேமி

# action_configure
source: Configure
ta: உள்ளமைக்கவும்

# action_connect
source: Connect
ta: இணை

# action_cancel
source: Cancel
ta: ரத்துசெய்

# action_disconnect
source: Disconnect
ta: துண்டிக்கவும்

# action_reconnect
source: Reconnect
ta: மீண்டும் இணைக்கவும்

# action_try_again
source: Try again
ta: மீண்டும் முயற்சி செய்

# action_protect_all_apps
source: Protect all apps
ta: எல்லா பயன்பாடுகளையும் பாதுகாக்கவும்

# action_protect_this_app
source: Protect this app
ta: இந்த பயன்பாட்டைப் பாதுகாக்கவும்

# label_not_protected
source: None protected
ta: எதுவும் பாதுகாக்கப்படவில்லை

# label_some_protected
source: Some protected
ta: சில பாதுகாக்கப்பட்டவை

# action_refresh
source: Refresh
ta: புதுப்பி

# action_start
source: Start VPN
ta: VPN ஐத் தொடங்குங்கள்

# action_stop
source: Stop VPN
ta: VPN ஐ நிறுத்துங்கள்

# action_refresh_circuits
source: Refresh circuits
ta: சுற்றுகளை புதுப்பிக்கவும்

# action_copy_logs
source: Copy logs
ta: பதிவுகளை நகலெடுக்கவும்

# state_connected
source: Connected
ta: இணைக்கப்பட்டது

# state_connecting
source: Connecting…
ta: இணைக்கபடுகிறது…

# state_disconnecting
source: Disconnecting
ta: இணைப்பைத் துண்டிக்கிறது

# state_disconnected
source: Disconnected
ta: துண்டிக்கப்பட்டது

# app_routing_tor_apps
source: Tor powered apps
ta: டோர் இயங்கும் பயன்பாடுகள்

# app_routing_browsers
source: Browsers
ta: உலாவிகள்

# app_routing_other_apps
source: Other apps
ta: பிற பயன்பாடுகள்

# notification_channel_description
source: Shows updates about TorVPN.
ta: TORVPN பற்றிய புதுப்பிப்புகளைக் காட்டுகிறது.

# notification_channel_name
source: TorVPN notifications
ta: TORVPN அறிவிப்புகள்

source: Apps
ta: பயன்பாடுகள்

# apps_description
source: Choose apps to route through Tor
ta: TOR வழியாக செல்ல பயன்பாடுகளைத் தேர்வுசெய்க

# apps_description_all_protected
source: All apps protected
ta: அனைத்து பயன்பாடுகளும் பாதுகாக்கப்படுகின்றன

source: Tor Logs
ta: Tor பதிகைகள்

# tor_logs_description
source: View and copy your Tor logs
ta: உங்கள் TOR பதிவுகளைக் காணலாம் மற்றும் நகலெடுக்கவும்

source: Always-on VPN
ta: எப்போதும் VPN-ஆன்

# always_on_vpn_description
source: Open Android System Settings
ta: ஆண்ட்ராய்டு கணினி அமைப்புகளைத் திறக்கவும்

source: Copied …
ta: நகலெடுக்கப்பட்டது…

source: General
ta: பொது

# general_description
source: Configure general settings
ta: பொது அமைப்புகளை உள்ளமைக்கவும்

# title_guide
source: This app is highly experimental
ta: இந்த பயன்பாடு மிகவும் சோதனை

# guide_bullet_head_1
source: Report Bugs
ta: பிழைகள் புகாரளிக்கவும்

# guide_bullet_head_2
source: But don't do anything risky
ta: ஆனால் ஆபத்தான எதுவும் செய்ய வேண்டாம்

# guide_bullet_text_1
source: Don't forget to report any bugs you find back to our developers.
ta: எங்கள் டெவலப்பர்களிடம் நீங்கள் காணும் எந்த பிழைகளையும் புகாரளிக்க மறக்காதீர்கள்.

# guide_bullet_text_2
source: This is a pre-release version of the app, and is not safe to use for sensitive activities.
ta: இது பயன்பாட்டின் முன் வெளியீட்டு பதிப்பாகும், மேலும் முக்கியமான செயல்பாடுகளுக்கு பயன்படுத்த பாதுகாப்பானது அல்ல.

# stats_combined
source: ↓%2$s %1$s/s - ↑%4$s %3$s/s
ta: 2 %2 $ s %1 $ s/s - த்தி 4 $ s %3 $ s/s

# error_something_went_wrong
source: Something went wrong
ta: ஏதோ தவறு நடந்துவிட்டது

# error_detail_message
source: Tor VPN couldn’t connect to the Tor network.
ta: TOR VPN TOR நெட்வொர்க்குடன் இணைக்க முடியவில்லை.

# error_view_logs
source: View Tor logs
ta: டோர் பதிவுகளைக் காண்க

source: Connection
ta: இணைப்பு

# connection_description
source: Configure how to connect to Tor
ta: TOR உடன் எவ்வாறு இணைப்பது என்பதை உள்ளமைக்கவும்

source: Kill switch
ta: சுவிட்சைக் கொல்லுங்கள்

# kill_switch_description
source: Block apps from connecting to the internet if the Tor network can't be reached
ta: டோர் நெட்வொர்க்கை அடைய முடியாவிட்டால் இணையத்துடன் இணைப்பதைத் தடுக்கும் பயன்பாடுகளைத் தடுக்கிறது

# quickstart
source: Auto-Connect
ta: தானாக இணைப்பு

# quickstart_description
source: Connect to the Tor network automatically when launched
ta: தொடங்கும்போது தானாக TOR நெட்வொர்க்குடன் இணைக்கவும்

source: Exit location
ta: வெளியேறும் இடம்

# exit_location_description
source: Automatic mode selects exit relays from anywhere in the network, regardless of location. This helps protect your anonymity by preventing your activities from being linked.
ta: இருப்பிடத்தைப் பொருட்படுத்தாமல், நெட்வொர்க்கில் எங்கிருந்தும் வெளியேறும் ரிலேக்களை தானியங்கி பயன்முறை தேர்ந்தெடுக்கிறது. உங்கள் செயல்பாடுகள் இணைக்கப்படுவதைத் தடுப்பதன் மூலம் உங்கள் பெயர் தெரியாததைப் பாதுகாக்க இது உதவுகிறது.

# exit_location_automatic
source: Automatic (safest)
ta: தானியங்கி (பாதுகாப்பானது)

source: Up
ta: மேல்

source: Down
ta: கீழ்

# circuit_app_description
source: Circuit for %1$s
ta: %1 $ s க்கு சுற்று

source: This browser
ta: இந்த உலாவி

source: This app
ta: இந்த பயன்பாடு

source: Tor-powered app
ta: டோர்-இயங்கும் பயன்பாடு

# description_independent_tor_powered_app
source: This app uses its own Tor connection, independent of the Tor VPN. View and configure its connection in %1$s instead.
ta: இந்த பயன்பாடு TOR VPN இலிருந்து சுயாதீனமாக அதன் சொந்த TOR இணைப்பைப் பயன்படுத்துகிறது. அதற்கு பதிலாக அதன் இணைப்பை %1 $ s இல் காணலாம் மற்றும் உள்ளமைக்கவும்.

# action_open_app
source: Open %1$s
ta: %1$sஐத் திறக்கவும்

source: Guard
ta: காப்பு

# bootstrap_at
source: Bootstrap at: %1$s
ta: பூட்ச்ட்ராப்: %1 $ s

# new_connection
source: %1$s->%2$s: NEW connection to %3$s (app %4$d)
ta: %1 $ s-> %2 $ s: %3 $ s க்கு புதிய இணைப்பு (APP %4 $ D)

# failed_connection
source: %1$s->%2$s: FAILED connection to %3$s: %4$s (app %5$d)
ta: %1 $ s-> %2 $ s: %3 $ s உடன் தோல்வியுற்ற இணைப்பு: %4 $ s (app %5 $ d)

# failed_connection_closed
source: %1$s->%2$s: FAILED: %3$s
ta: %1 $ s-> %2 $ s: தோல்வியுற்றது: %3 $ s

# closed_connection
source: %1$s->%2$s: closed connection
ta: %1 $ s->%2 $ s: மூடிய இணைப்பு

source: Refresh all circuits?
ta: அனைத்து சுற்றுகளையும் புதுப்பிக்கவா?

# reload_all_circuits_description
source: New circuits will be established for all of your apps. Some apps and websites might not recognize you as a result, and could log you out of their services.
ta: உங்கள் எல்லா பயன்பாடுகளுக்கும் புதிய சுற்றுகள் நிறுவப்படும். சில பயன்பாடுகள் மற்றும் வலைத்தளங்கள் இதன் விளைவாக உங்களை அடையாளம் காணாமல் போகலாம், மேலும் அவற்றின் சேவைகளில் இருந்து உங்களை உள்நுழையலாம்.

# reload_app_circuits
source: Refresh this circuit?
ta: இந்த சுற்று புதுப்பிக்கவா?

# reload_app_circuits_description
source: New circuits will be established for this app only. Some apps and websites might not recognize you as a result, and could log you out of their services.
ta: இந்த பயன்பாட்டிற்கு மட்டுமே புதிய சுற்றுகள் நிறுவப்படும். சில பயன்பாடுகள் மற்றும் வலைத்தளங்கள் இதன் விளைவாக உங்களை அடையாளம் காணாமல் போகலாம், மேலும் அவற்றின் சேவைகளில் இருந்து உங்களை உள்நுழையலாம்.

# action_reload_circuits
source: Reload circuits
ta: சுற்றுகளை மீண்டும் ஏற்றவும்

# routed_over_country
source: Routed over %1$s
ta: %1 $ s க்கு மேல் திசைதிருப்பப்பட்டது

source: Unknown
ta: தெரியாதவை

# guide_got_it
source: Got it
ta: சரி

# connect_direct_to_tor
source: Connect directly to Tor
ta: நேரடியாக TOR உடன் இணைக்கவும்

# idle_toolbar_title
source: Tor VPN
ta: டோர் வி.பி.என்

source: Circuits
ta: சுற்றுகள்

source: Debugging
ta: வழுநீக்கம்

source: Use a bridge
ta: ஒரு பாலத்தைப் பயன்படுத்தவும்

# use_a_bridge_info
source: Bridges help you securely access the Tor network in places where Tor is blocked. Depending on where you are, one bridge may work better than another.
ta: டோர் தடுக்கப்பட்ட இடங்களில் டோர் நெட்வொர்க்கை பாதுகாப்பாக அணுக பாலங்கள் உங்களுக்கு உதவுகின்றன. நீங்கள் இருக்கும் இடத்தைப் பொறுத்து, ஒரு பாலம் மற்றொன்றை விட சிறப்பாக செயல்படக்கூடும்.

# bridge_behaviour
source: Behaviour
ta: நடத்தை

source: Current bridge
ta: தற்போதைய பாலம்

# bridge_option_obfs4_built
source: obfs4 (built-in)
ta: OBFS4 (உள்ளமைக்கப்பட்ட)

source: Bridge settings
ta: பாலம் அமைப்புகள்

source: Bridges
ta: Bridgeகள்

# built_in_bridges
source: Choose a built-in bridge
ta: உள்ளமைக்கப்பட்ட பாலத்தைத் தேர்வுசெய்க

source: obfs4 (built-in)
ta: OBFS4 (உள்ளமைக்கப்பட்ட)

source: Snowflake (built-in)
ta: ச்னோஃப்ளேக் (உள்ளமைக்கப்பட்ட)

source: None
ta: ஏதுமில்லை

# obfs4_description
source: Makes your traffic look like random data
ta: உங்கள் போக்குவரத்தை சீரற்ற தரவு போல தோற்றமளிக்கிறது

# snowflake_description
source: Routes your connection through Snowflake proxies to make it look like you're placing a video call
ta: நீங்கள் வீடியோ அழைப்பை வைப்பதைப் போல தோற்றமளிக்க ச்னோஃப்ளேக் ப்ராக்சிகள் மூலம் உங்கள் இணைப்பை வழிநடத்துகிறது

# add_new_bridge
source: Add new bridges
ta: புதிய பாலங்களைச் சேர்க்கவும்

# bridge_address
source: Enter bridge address
ta: பாலம் முகவரியை உள்ளிடவும்

# bridge_address_description
source: Add one or more bridges provided by a trusted person or organization.
ta: நம்பகமான நபர் அல்லது அமைப்பு வழங்கிய ஒன்று அல்லது அதற்கு மேற்பட்ட பாலங்களைச் சேர்க்கவும்.

source: Bridge addresses
ta: பாலம் முகவரிகள்

# action_paste_bridges
source: Paste your bridge addresses here
ta: உங்கள் பாலம் முகவரிகளை இங்கே ஒட்டவும்

# manual_bridge
source: Manual selection
ta: கையேடு தேர்வு

source: Get new bridges
ta: புதிய பாலங்களைப் பெறுங்கள்

# new_bridges
source: I need new bridges
ta: எனக்கு புதிய பாலங்கள் தேவை

# fetching_bridges
source: Fetching your new bridges…
ta: உங்கள் புதிய பாலங்களைப் பெறுகிறது…

# new_bridges_result
source: Here are your new bridges:
ta: உங்கள் புதிய பாலங்கள் இங்கே:

# get_new_bridges_description
source: Since bridge addresses aren't public, you'll need to request one from the Tor Project.
ta: பாலம் முகவரிகள் பொதுவில் இல்லை என்பதால், நீங்கள் TOR திட்டத்திலிருந்து ஒன்றைக் கோர வேண்டும்.

# ask_bridge_bot
source: Ask the bridge bot
ta: பாலம் போட் கேளுங்கள்

source: Telegram
ta: டெலிகிராம்

source: Signal
ta: குறிகை

source: Whatsapp
ta: வாட்ச்அப்

source: Web
ta: வலை

# email_providers
source: Gmail or Riseup
ta: சிமெயில் அல்லது ரைச்அப்

# telegram_bot_subtitle
source: Message %s
ta: செய்தி %s

# email_bot_subtitle
source: Email %s
ta: மின்னஞ்சல் %s

# web_bot_subtitle
source: Visit %s
ta: %s வருகை

# remove_bridge
source: Remove bridge address
ta: பாலம் முகவரியை அகற்று

source: Help
ta: உதவி

# qs_error
source: Connection error
ta: இணைப்பு பிழை

# qs_show_error
source: Show error
ta: பிழையைக் காட்டு

source: Appearance
ta: தோற்றம்

source: Name and icon
ta: பெயர் மற்றும் படவுரு

# launcher_hint
source: Choose an icon and name for your home screen and app drawer. The default Tor VPN icon and name will still be used in notifications.
ta: உங்கள் முகப்புத் திரை மற்றும் பயன்பாட்டு அலமாரிக்கு ஒரு படவுரு மற்றும் பெயரைத் தேர்வுசெய்க. இயல்புநிலை TOR VPN படவுரு மற்றும் பெயர் இன்னும் அறிவிப்புகளில் பயன்படுத்தப்படும்.

# app_name_variant_1
source: Calculator
ta: கணிப்பான்

# app_name_variant_2
source: Flashlight
ta: ஒளிரும் விளக்கு

# app_name_variant_3
source: Ping Pong
ta: பிங் பாங்

source: Warnings
ta: எச்சரிக்கைகள்

source: New circuits warnings
ta: புதிய சுற்றுகள் எச்சரிக்கைகள்

# new_circuits_warnings_description
source: Warn before reloading circuits.
ta: சுற்றுகளை மீண்டும் ஏற்றுவதற்கு முன் எச்சரிக்கவும்.

# view_faq
source: View our FAQ
ta: எங்கள் கேள்விகளைக் காண்க

# report_bug
source: Report a bug
ta: பிழையைப் புகாரளி

source: Contact support
ta: தொடர்பு உதவி

# help_description_wip
source: Tor VPN is a work in progress, and some features may not work as expected.
ta: டோர் விபிஎன் செயலில் உள்ளது, மேலும் சில நற்பொருத்தங்கள் எதிர்பார்த்தபடி செயல்படாது.

# help_description_bug_report
source: If you encounter an issue that’s not answered by our FAQ, please open a bug report or contact support.
ta: எங்கள் கேள்விகளால் பதிலளிக்கப்படாத ஒரு சிக்கலை நீங்கள் சந்தித்தால், தயவுசெய்து பிழை அறிக்கை அல்லது தொடர்பு ஆதரவைத் திறக்கவும்.

# bug_tor_forum
source: On the Tor Forum
ta: டோர் மன்றத்தில்

# bug_gitlab
source: On Gitlab
ta: கிட்லாப்பில்

source: Email
ta: மின்னஞ்சல்

source: Bridge Bot
ta: பாலம் போட்

# bot_msg_welcome
source: Welcome, weary traveler
ta: வரவேற்கிறோம், சோர்வுற்ற பயணி

# bot_msg_results
source: Here are your bridges:
ta: உங்கள் பாலங்கள் இங்கே:

source: Start again
ta: மீண்டும் தொடங்கவும்

source: Use bridges
ta: பாலங்களைப் பயன்படுத்துங்கள்

source: Change
ta: மாற்று

source: This device
ta: இந்த சாதனம்

source: obfs4 bridge
ta: OBFS4 பாலம்

source: About
ta: பற்றி

# about_description
source: Find out more about Tor VPN
ta: டோர் வி.பி.என் பற்றி மேலும் அறியவும்

source: Version
ta: பதிப்பு

source: Last updated
ta: கடைசியாக புதுப்பிக்கப்பட்டது

# about_description_long
source: Tor VPN is an experimental VPN app made by the %1$s, developers of Tor and Tor Browser—the world’s strongest tools for privacy and freedom online.
ta: TOR VPN என்பது ஒரு சோதனை VPN பயன்பாடாகும், இது %1 $ s, TOR மற்றும் TOR உலாவியின் உருவாக்குபவர்கள் - ஆன்லைனில் தனியுரிமை மற்றும் சுதந்திரத்திற்கான உலகின் வலுவான கருவிகள்.

source: Tor Project
ta: Tor திட்டம்

source: No internet
ta: இணையம் இல்லை

# n_bridges
source: %1$s bridge added
ta: %1 $ s பாலம் சேர்க்கப்பட்டது
