Repository: 247i/TACETr
Catalog: உரை/தானி/transistor-metadata-*.po
Languages: ta

# title.txt:1
source: Transistor - Simple Radio App
ta: டிரான்சிச்டர் - எளிய வானொலி பயன்பாடு

# short_description.txt:1
source: Transistor is an app for listening to radio stations over the internet.
ta: டிரான்சிச்டர் என்பது இணையத்தில் வானொலி நிலையங்களைக் கேட்பதற்கான ஒரு பயன்பாடாகும்.

# full_description.txt:1
source: <p><i>Transistor</i> is a radio app with a minimalistic approach, that may not be to everyone's liking. It has no radio station discovery feature. <i>Transistor</i> only offers a very simple search option and it imports audio streaming links, when you tap on them in a web browser.</p><p><br><b>FREQUENT QUESTIONS</b></p><dl><dt>HOW CAN I ADD A RADIO STATION</dt><dd>There are three ways to add a radio station to Transistor: Use Search, add playlist file address (M3U, PLS), enter a raw stream address.</dd><dt>WHERE DO THE RADIO STATION SEARCH RESULTS COME FROM?</dt><dd>Transistor searches the radio-browser.info online database. You can help out the radio-browser.info community by adding the missing station (http://www.radio-browser.info/gui/#!/add) to their database.</dd><dt>HOW CAN I CURATE THE RADIO STATION LIST?</dt><dd>Use the swipe gesture to delete a radio station from the list. Further editing options can be enabled in Settings. If enabled, tap and hold a radio station to edit its name, image or streaming link.</dd></dl>
ta: <p> <i> டிரான்சிச்டர் </i> என்பது மிகச்சிறிய அணுகுமுறையைக் கொண்ட ஒரு வானொலி பயன்பாடாகும், இது அனைவரின் விருப்பப்படி இருக்காது. இதற்கு வானொலி நிலைய கண்டுபிடிப்பு நற்பொருத்தம் இல்லை. <i> டிரான்சிச்டர் </i> மிகவும் எளிமையான தேடல் விருப்பத்தை மட்டுமே வழங்குகிறது, மேலும் இது ஒரு வலை உலாவியில் அவற்றைத் தட்டும்போது ஆடியோ ச்ட்ரீமிங் இணைப்புகளை இறக்குமதி செய்கிறது. Pls), ஒரு மூல ச்ட்ரீம் முகவரியை உள்ளிடவும். </Dd> <dt> வானொலி நிலைய தேடல் முடிவுகள் எங்கிருந்து வருகின்றன? </Dt> <dd> டிரான்சிச்டர் ரேடியோ-உலாவி.இன்ஃபோ நிகழ்நிலை தரவுத்தளத்தைத் தேடுகிறது. காணாமல் போன நிலையத்தை (http://www.radio-browser.info/gui/gui/ ##! அமைப்புகளில் மேலும் திருத்துதல் விருப்பங்களை இயக்க முடியும். இயக்கப்பட்டால், ஒரு வானொலி நிலையத்தை அதன் பெயர், படம் அல்லது ச்ட்ரீமிங் இணைப்பைத் திருத்தத் தட்டவும் வைத்திருங்கள். </Dd> </dl>

# changelogs/100.txt:1
source: # v4.2.0 - Ashes to Ashes (Release #100) **2024-10-04** - fixes station switching (notification and headphone buttons) - fixes playback resumption from the notification - minor bug fixes - new translation: Irish (THX Aindriú Mac Giolla Eoin) - new translation: Welsh (THX Aled Powell) - updated translations
ta: # V4.2.0 - சாம்பல் முதல் சாம்பல் (வெளியீடு # 100) ** 2024-10-04 ** - ச்டேசன் மாறுதல் சரிசெய்தல் (அறிவிப்பு மற்றும் தலையணி பொத்தான்கள்) - அறிவிப்பிலிருந்து பின்னணி மறுதொடக்கம் சரிசெய்கிறது - சிறிய பிழை திருத்தங்கள் . - புதிய மொழிபெயர்ப்பு: வெல்ச் (Thx Aled Powell) - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/101.txt:1
source: # v4.2.1 - Ashes to Ashes **2024-10-08** - removes unneeded (and unwanted) Play Services dependency from Transistor
ta: # V4.2.1 - சாம்பல் முதல் சாம்பல் ** 2024-10-08 ** - டிரான்சிச்டரில் இருந்து தேவையற்ற (மற்றும் தேவையற்ற) விளையாட்டு சேவைகளை சார்புகளை நீக்குகிறது

# changelogs/102.txt:1
source: # v4.2.2 - Ashes to Ashes **2024-11-01** - fixes a display bug in the player element - play button animation changed - new translations added: Estonian, Hindi, Kurdish (Thank you: @jrthwlate, @Scrambled777, @halbast) - updated translations
ta: # V4.2.2 - சாம்பல் முதல் சாம்பல் ** 2024-11-01 ** - பிளேயர் உறுப்பில் காட்சி பிழையை சரிசெய்கிறது - ப்ளே பொத்தான் அனிமேசன் மாற்றப்பட்டது . - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/103.txt:1
source: # v4.2.3 - Ashes to Ashes **2025-02-10** - updated targetSdkVersion to 35 (Android 15) - updated translations
ta: # v4.2.3 - சாம்பல் முதல் சாம்பல் ** 2025-02-10 ** - 35 க்கு இலக்கைப் புதுப்பித்தது (ஆண்ட்ராய்டு 15) - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/59.txt:1
source: # v3.0.9 - Oh! You Pretty Things **2018-08-08** - metadata display can handle UTF-8 and Latin1 characters - updated translations
ta: # V3.0.9 - ஓ! நீங்கள் அழகான விசயங்கள் ** 2018-08-08 ** - மேனிலை தரவு டிச்ப்ளே யுடிஎஃப் -8 மற்றும் லத்தீன் 1 எழுத்துக்களைக் கையாள முடியும் - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/60.txt:1
source: # v3.0.10 - Oh! You Pretty Things **2018-09-27** - Arabic language version - improved TalkBack support
ta: # V3.0.10 - ஓ! நீங்கள் அழகான விசயங்கள் ** 2018-09-27 ** - அரபு மொழி பதிப்பு - மேம்படுத்தப்பட்ட பேச்சு உதவி

# changelogs/61.txt:1
source: # v3.0.11 - Oh! You Pretty Things **2018-10-01** - Solves a serious issue with http-based connections on Android 9
ta: # V3.0.11 - ஓ! நீங்கள் அழகான விசயங்கள் ** 2018-10-01 ** - ஆண்ட்ராய்டு 9 இல் HTTP- அடிப்படையிலான இணைப்புகளுடன் ஒரு தீவிர சிக்கலை தீர்க்கிறது

# changelogs/62.txt:1
source: # v3.0.12 - Oh! You Pretty Things **2018-10-08** - updated Japanese language version - minor changes
ta: # V3.0.12 - ஓ! நீங்கள் அழகான விசயங்கள் ** 2018-10-08 ** - புதுப்பிக்கப்பட்ட சப்பானிய மொழி பதிப்பு - சிறிய மாற்றங்கள்

# changelogs/64.txt:1
source: # v3.1.0 - John, I’m Only Dancing **2018-11-19** - new app icon (thx @munadikieh) - improved handling of links from radio-browser.info - user interface with a new color scheme - bug fixes
ta: # v3.1.0 - சான், நான் மட்டுமே நடனமாடுகிறேன் ** 2018-11-19 ** - புதிய பயன்பாட்டு படவுரு (thx @munadikieh) - ரேடியோ-உலாவி.இன்ஃபோவிலிருந்து இணைப்புகளை மேம்படுத்துதல் - புதிய வண்ணத் திட்டத்துடன் பயனர் இடைமுகம் - பிழை திருத்தங்கள்

# changelogs/65.txt:1
source: # v3.1.1 - John, I’m Only Dancing **2019-01-16** - supports the Android system audio equalizer - bugfixes - updated translations - improved dark mode support
ta: # v3.1.1 - சான், நான் மட்டுமே நடனமாடுகிறேன் ** 2019-01-16 ** - ஆண்ட்ராய்டு சிச்டம் ஆடியோ சமநிலையை ஆதரிக்கிறது - பிழைத்திருத்தங்கள் - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் - மேம்படுத்தப்பட்ட இருண்ட பயன்முறை உதவி

# changelogs/66.txt:1
source: # v3.1.2 - John, I’m Only Dancing **2019-01-23** - bugfixes - updated translations
ta: # v3.1.2 - சான், நான் மட்டுமே நடனமாடுகிறேன் ** 2019-01-23 ** - பிழைத்திருத்தங்கள் - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/67.txt:1
source: # v3.2.0 - Life on Mars? **2019-06-26** - Italian translation - list of radio stations has larger icons - main app icon color changed to red
ta: # V3.2.0 - செவ்வாய் கிரகத்தில் வாழ்க்கை? ** 2019-06-26 ** - இத்தாலிய மொழிபெயர்ப்பு - வானொலி நிலையங்களின் பட்டியலில் பெரிய சின்னங்கள் உள்ளன - முதன்மையான பயன்பாட்டு படவுரு நிறம் சிவப்பு நிறமாக மாற்றப்பட்டது

# changelogs/68.txt:1
source: # v3.2.1 - Life on Mars? **2019-07-25** - Czech translation - the "now playing" metadata feature displays non-latin characters better (less unreadable gibberish)
ta: # V3.2.1 - செவ்வாய் கிரகத்தில் வாழ்க்கை? ** 2019-07-25 ** - செக் மொழிபெயர்ப்பு .

# changelogs/69.txt:1
source: # v3.2.2 - Life on Mars? **2019-10-18** - Thai language version - updated translations
ta: # V3.2.2 - செவ்வாய் கிரகத்தில் வாழ்க்கை? ** 2019-10-18 ** - தாய் மொழி பதிப்பு - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/70.txt:1
source: # v3.2.3 - Life on Mars? **2020-02-04** - Indonesian language version - small bug fixes
ta: # V3.2.3 - செவ்வாய் கிரகத்தில் வாழ்க்கை? ** 2020-02-04 ** - இந்தோனேசிய மொழி பதிப்பு - சிறிய பிழை திருத்தங்கள்

# changelogs/71.txt:1
source: # v3.2.4 - Life on Mars? **2020-02-12** - updated Indonesian language version
ta: # V3.2.4 - செவ்வாய் கிரகத்தில் வாழ்க்கை? ** 2020-02-12 ** - இந்தோனேசிய மொழி பதிப்பு புதுப்பிக்கப்பட்டது

# changelogs/72.txt:1
source: # v4.0.0 - Andy Warhol **2020-07-03** - this is a huge update - Transistor has been re-written from scratch in Kotlin - a couple of new user-facing features: -- radio station search (via radio-browser.info) -- you can mark a radio station as a favorite -- a dedicated Settings screen Find out more: https://codeberg.org/y20k/transistor/issues/251
ta: # V4.0.0 - ஆண்டி வார்ஓல் ** 2020-07-03 ** - இது ஒரு பெரிய புதுப்பிப்பு - கோட்லினில் உள்ள புதிதாக டிரான்சிச்டர் மீண்டும் எழுதப்பட்டுள்ளது - புதிய பயனர் எதிர்கொள்ளும் நற்பொருத்தங்கள் இரண்டு: -வானொலி நிலைய தேடல் (ரேடியோ-உலாவி.இன்ஃபோ வழியாக) - நீங்கள் ஒரு வானொலி நிலையத்தை பிடித்ததாகக் குறிக்கலாம் - ஒரு பிரத்யேக அமைப்புகள் திரை மேலும் கண்டுபிடிக்கவும்: https://codeberg.org/y20k/transistor/issues/251

# changelogs/73.txt:1
source: # v4.0.1 - Andy Warhol **2020-07-05** - fixes several small bugs with v4.0.0 -- metadata in notification updates correctly -- improved HLS support -- sorting is case insensitive The v4 update was pretty big, find out more: https://codeberg.org/y20k/transistor/src/branch/master/metadata/en-US/changelogs/72.txt
ta: # V4.0.1 - ஆண்டி வார்ஓல் ** 2020-07-05 ** - V4.0.0 உடன் பல சிறிய பிழைகள் சரிசெய்கின்றன - அறிவிப்பு புதுப்பிப்புகளில் மேனிலை தரவு சரியாக - மேம்படுத்தப்பட்ட எச்.எல்.எச் உதவி - வரிசையாக்கம் என்பது வழக்கு உணர்வற்றது வி 4 புதுப்பிப்பு மிகவும் பெரியது, மேலும் அறியவும்: https://codeberg.org/y20k/transistor/src/branch/master/metadata/en-us/changelogs/72.txt

# changelogs/74.txt:1
source: # v4.0.2 - Andy Warhol **2020-07-08** - fixes a bug with importing stream URLs (you may need to update the station) - brings back metadata display for Android Auto The v4 update was pretty big, find out more: https://codeberg.org/y20k/transistor/src/branch/master/metadata/en-US/changelogs/72.txt
ta: # V4.0.2 - ஆண்டி வார்ஓல் ** 2020-07-08 ** - ச்ட்ரீம் முகவரி களை இறக்குமதி செய்வதன் மூலம் ஒரு பிழையை சரிசெய்கிறது (நீங்கள் நிலையத்தை புதுப்பிக்க வேண்டியிருக்கலாம்) - ஆண்ட்ராய்டு ஆட்டோவிற்கான மேனிலை தரவு டிச்ப்ளேவை மீண்டும் கொண்டு வருகிறது வி 4 புதுப்பிப்பு மிகவும் பெரியது, மேலும் அறியவும்: https://codeberg.org/y20k/transistor/src/branch/master/metadata/en-us/changelogs/72.txt

# changelogs/75.txt:1
source: # v4.0.3 - Andy Warhol **2020-07-22** - Android Auto resumes playback of last played station - updated and new translations - a couple of small bug fixes The v4 update was pretty big, find out more: https://codeberg.org/y20k/transistor/src/branch/master/metadata/en-US/changelogs/72.txt
ta: # V4.0.3 - ஆண்டி வார்ஓல் ** 2020-07-22 ** - அண்ட்ராய்டு ஆட்டோ கடைசியாக விளையாடிய நிலையத்தின் பின்னணியை மீண்டும் தொடங்குகிறது - புதுப்பிக்கப்பட்ட மற்றும் புதிய மொழிபெயர்ப்புகள் - இரண்டு சிறிய பிழை திருத்தங்கள் வி 4 புதுப்பிப்பு மிகவும் பெரியது, மேலும் அறியவும்: https://codeberg.org/y20k/transistor/src/branch/master/metadata/en-us/changelogs/72.txt

# changelogs/76.txt:1
source: # v4.0.4 - Andy Warhol **2020-07-27** - improved scrolling performance The v4 update was pretty big, find out more: https://codeberg.org/y20k/transistor/src/branch/master/metadata/en-US/changelogs/72.txt
ta: # V4.0.4 - ஆண்டி வார்ஓல் ** 2020-07-27 ** - மேம்படுத்தப்பட்ட ச்க்ரோலிங் செயல்திறன் வி 4 புதுப்பிப்பு மிகவும் பெரியது, மேலும் அறியவும்: https://codeberg.org/y20k/transistor/src/branch/master/metadata/en-us/changelogs/72.txt

# changelogs/77.txt:1
source: # v4.0.5 - Andy Warhol **2020-07-29** - fixes search on devices, on which the language is set to Greek - updated translations The v4 update was pretty big, find out more: https://codeberg.org/y20k/transistor/src/branch/master/metadata/en-US/changelogs/72.txt
ta: # V4.0.5 - ஆண்டி வார்ஓல் ** 2020-07-29 ** - சாதனங்களில் தேடலை சரிசெய்கிறது, அதில் மொழி கிரேக்க மொழியில் அமைக்கப்பட்டுள்ளது - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் வி 4 புதுப்பிப்பு மிகவும் பெரியது, மேலும் அறியவும்: https://codeberg.org/y20k/transistor/src/branch/master/metadata/en-us/changelogs/72.txt

# changelogs/78.txt:1
source: # v4.0.6 - Andy Warhol **2020-09-03** - fixes the reappearing notification zombie - updated translations
ta: # V4.0.6 - ஆண்டி வார்ஓல் ** 2020-09-03 ** - மீண்டும் தோன்றும் அறிவிப்பு சாம்பி சரிசெய்கிறது - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/79.txt:1
source: # v4.0.7 - Andy Warhol **2020-10-01** - updated translations
ta: # V4.0.7 - ஆண்டி வார்ஓல் ** 2020-10-01 ** - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/80.txt:1
source: # v4.0.8 - Andy Warhol **2020-11-25** - Hebrew language version - updated translations - Android Auto station image display fixed - manual station image selection on Android 11 fixed
ta: # V4.0.8 - ஆண்டி வார்ஓல் ** 2020-11-25 ** - எபிரேய மொழி பதிப்பு - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் - ஆண்ட்ராய்டு ஆட்டோ ச்டேசன் பட காட்சி சரி செய்யப்பட்டது - ஆண்ட்ராய்டு 11 இல் கையேடு நிலைய படத் தேர்வு சரி செய்யப்பட்டது

# changelogs/81.txt:1
source: # v4.0.10 - Andy Warhol **2021-01-01** - fixes a bug in the Update Stations feature, that could leave Transistor in a weired state, where only single station is playable (see also: https://codeberg.org/y20k/transistor/issues/291)
ta: # V4.0.10 - ஆண்டி வார்ஓல் ** 2021-01-01 ** - புதுப்பிப்பு நிலையங்கள் அம்சத்தில் ஒரு பிழையை சரிசெய்கிறது, இது டிரான்சிச்டரை ஒரு வீரி நிலையில் விட்டுவிடக்கூடும், அங்கு ஒற்றை நிலையம் மட்டுமே இயக்கக்கூடியது (மேலும் காண்க: https://codeberg.org/y20k/transistor/issues/291)

# changelogs/82.txt:1
source: # v4.0.11 - Andy Warhol **2021-02-25** - Esperanto language version - updated translations - changed notification behavior
ta: # V4.0.11 - ஆண்டி வார்ஓல் ** 2021-02-25 ** - எச்பெராண்டோ மொழி பதிப்பு - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் - மாற்றப்பட்ட அறிவிப்பு நடத்தை

# changelogs/83.txt:1
source: # v4.0.12 - Andy Warhol **2021-03-10** - fixes broken playback from home screen shortcut
ta: # V4.0.12 - ஆண்டி வார்ஓல் ** 2021-03-10 ** - முகப்புத் திரை குறுக்குவழியில் இருந்து உடைந்த பின்னணியை சரிசெய்கிறது

# changelogs/84.txt:1
source: # v4.0.13 - Andy Warhol **2021-03-16** - tweaks the "currently playing" display - fixes a rare crash
ta: # V4.0.13 - ஆண்டி வார்ஓல் ** 2021-03-16 ** - "தற்போது விளையாடும்" காட்சியை மாற்றுகிறது - ஒரு அரிய விபத்தை சரிசெய்கிறது

# changelogs/85.txt:1
source: # v4.0.14 - Andy Warhol **2021-03-20** - small change to notification - fixes another rare crash
ta: # V4.0.14 - ஆண்டி வார்ஓல் ** 2021-03-20 ** - அறிவிப்புக்கு சிறிய மாற்றம் - மற்றொரு அரிய விபத்தை சரிசெய்கிறது

# changelogs/86.txt:1
source: # v4.0.15 - Andy Warhol **2021-07-28** - new language: Frisian - updated translations - Transistor now stops buffering immediately, when playback has been stopped
ta: # V4.0.15 - ஆண்டி வார்ஓல் ** 2021-07-28 ** - புதிய மொழி: ஃபிரிசியன் - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் - பிளேபேக் நிறுத்தப்பட்டால், டிரான்சிச்டர் இப்போது உடனடியாக இடையகத்தை நிறுத்துகிறார்

# changelogs/87.txt:1
source: # v4.0.16 - Andy Warhol **2021-08-12** - fixes previous and next buttons in the playback notification
ta: # V4.0.16 - ஆண்டி வார்ஓல் ** 2021-08-12 ** - பிளேபேக் அறிவிப்பில் முந்தைய மற்றும் அடுத்த பொத்தான்களை சரிசெய்கிறது

# changelogs/88.txt:1
source: # v4.0.17 - Andy Warhol **2021-11-05** - app theme now uses "dynamic colors" (Material You) on Android 12 - small bug fixes - updated translations
ta: # V4.0.17 - ஆண்டி வார்ஓல் ** 2021-11-05 ** - பயன்பாட்டு கருப்பொருள் இப்போது ஆண்ட்ராய்டு 12 இல் "மாறும் வண்ணங்கள்" (பொருள் நீங்கள்) பயன்படுத்துகிறது - சிறிய பிழை திருத்தங்கள் - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/89.txt:1
source: # v4.0.18 - Andy Warhol **2022-01-14** - minor layout changes to better fit in with the "Material Design 3" theme introduced in Android 12 - updated translations
ta: # V4.0.18 - ஆண்டி வார்ஓல் ** 2022-01-14 ** - ஆண்ட்ராய்டு 12 இல் அறிமுகப்படுத்தப்பட்ட "பொருள் வடிவமைப்பு 3" கருப்பொருளுடன் சிறப்பாக பொருந்தக்கூடிய சிறிய தளவமைப்பு மாற்றங்கள் - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/90.txt:1
source: # v4.1.0 - Modern Love **2022-03-08** - design overhaul that makes use of "Material Design 3" elements and colors - fix re-appearing playback notification on Android 11 - Galician language version - updated translations
ta: # V4.1.0 - நவீன காதல் ** 2022-03-08 ** - "பொருள் வடிவமைப்பு 3" கூறுகள் மற்றும் வண்ணங்களைப் பயன்படுத்தும் வடிவமைப்பு மாற்றியமைத்தல் - ஆண்ட்ராய்டு 11 இல் மீண்டும் தோன்றும் பின்னணி அறிவிப்பை சரிசெய்யவும் - காலிசியன் மொழி பதிப்பு - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/91.txt:1
source: # v4.1.1 - Modern Love **2022-05-12** - new option to backup (and restore) all radio stations including images - fix for blurry default station image - Indonesian language fix - updated translations
ta: # V4.1.1 - நவீன காதல் ** 2022-05-12 ** - படங்கள் உட்பட அனைத்து வானொலி நிலையங்களையும் காப்புப்பிரதி (மற்றும் மீட்டமைக்க) புதிய விருப்பம் - மங்கலான இயல்புநிலை நிலைய படத்தை சரிசெய்யவும் - இந்தோனேசிய மொழி பிழைத்திருத்தம் - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/92.txt:1
source: # v4.1.2 - Modern Love **2023-01-03** Note: In this update the playback background service has been completely revised. Transistor now uses media3 (https://developer.android.com/jetpack/androidx/releases/media3). I used the rebuild to get rid of "special solutions" that are uncommon for media players on the Android platform: There is no cancel button (x) in the notification anymore. Home Screen radio stations no longer start Transistor in the background. Sorry if you appreciated one of these features. It is important to me that Transistor behaves platform compliant. This makes maintaining my favorite radio app much easier. Changes in this version: - Transistor uses the media3 playback library - updated translations - enable the per-app language preference feature (Android 13)
ta: # V4.1.2 - நவீன காதல் ** 2023-01-03 ** குறிப்பு: இந்த புதுப்பிப்பில் பின்னணி பின்னணி பணி முற்றிலும் திருத்தப்பட்டுள்ளது. டிரான்சிச்டர் இப்போது மீடியா 3 (https://developer.android.com/jetpack/androidx/relaess/media3) ஐப் பயன்படுத்துகிறது. ஆண்ட்ராய்டு இயங்குதளத்தில் மீடியா பிளேயர்களுக்கு சிறப்பான "சிறப்பு தீர்வுகளை" அகற்ற நான் மறுகட்டமைப்பைப் பயன்படுத்தினேன்: அறிவிப்பில் இனி ரத்துசெய் பொத்தான் (எக்ச்) இல்லை. முகப்புத் திரை வானொலி நிலையங்கள் இனி பின்னணியில் டிரான்சிச்டரைத் தொடங்காது. இந்த அம்சங்களில் ஒன்றை நீங்கள் பாராட்டினால் மன்னிக்கவும். டிரான்சிச்டர் மேடையில் இணக்கமாக செயல்படுகிறார் என்பது எனக்கு முதன்மை. இது எனக்கு பிடித்த வானொலி பயன்பாட்டை பராமரிப்பது மிகவும் எளிதாக்குகிறது. இந்த பதிப்பில் மாற்றங்கள்: - டிரான்சிச்டர் மீடியா 3 பின்னணி நூலகத்தைப் பயன்படுத்துகிறது - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் - பயன்பாடு பயன்பாடு மொழி விருப்பத்தேர்வு அம்சத்தை இயக்கவும் (Android 13)

# changelogs/93.txt:1
source: # v4.1.3 - Modern Love **2023-01-11** - fixes metadata display in notification - fixes empty text fields on language versions that are not yet 100% translated
ta: # V4.1.3 - நவீன காதல் ** 2023-01-11 ** - அறிவிப்பில் மேனிலை தரவு காட்சியை சரிசெய்கிறது - இன்னும் 100% மொழிபெயர்க்கப்படாத மொழி பதிப்புகளில் வெற்று உரை புலங்களை சரிசெய்கிறது

# changelogs/94.txt:1
source: # v4.1.4 - Modern Love **2023-03-01** - M3U8 / HLS playback fixed - monochrome app icon variant added - network loss is handled better
ta: # V4.1.4 - நவீன காதல் ** 2023-03-01 ** - M3U8 / HLS பிளேபேக் சரி செய்யப்பட்டது - ஒரே வண்ணமுடைய பயன்பாட்டு படவுரு மாறுபாடு சேர்க்கப்பட்டது - பிணைய இழப்பு சிறப்பாக கையாளப்படுகிறது

# changelogs/95.txt:1
source: # v4.1.5 - Modern Love **2023-03-17** - improved station cover image handling - updated translations
ta: # V4.1.5 - நவீன காதல் ** 2023-03-17 ** - மேம்படுத்தப்பட்ட நிலைய கவர் பட கையாளுதல் - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/96.txt:1
source: # v4.1.6 - Modern Love **2023-07-10** - re-worked the input option for direct streaming URLs via the search dialog - new "Use Larger Buffer" option in settings - updated translations
ta: # V4.1.6 - நவீன காதல் ** 2023-07-10 ** - தேடல் உரையாடல் வழியாக நேரடி ச்ட்ரீமிங் முகவரி களுக்கான உள்ளீட்டு விருப்பத்தை மீண்டும் வேலை செய்தது - அமைப்புகளில் புதிய "பெரிய இடையகத்தைப் பயன்படுத்தவும்" விருப்பம் - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்

# changelogs/97.txt:1
source: # v4.1.7 - Modern Love **2023-10-22** - reworked the Add New Station dialog to work with m3u and pls files (local and remote) - updated the icons set (Material Symbols) - updated the app icon - new translations: Bulgarian, Finnish, Korean - updated translations - small bug fixes
ta: # V4.1.7 - நவீன காதல் ** 2023-10-22 ** - M3U மற்றும் PLS கோப்புகளுடன் (உள்ளூர் மற்றும் தொலைநிலை) வேலை செய்ய புதிய நிலைய உரையாடலை மறுவேலை செய்தது - ஐகான்கள் தொகுப்பு (பொருள் சின்னங்கள்) புதுப்பிக்கப்பட்டது - பயன்பாட்டு ஐகானைப் புதுப்பித்தது - புதிய மொழிபெயர்ப்புகள்: பல்கேரிய, பின்னிச், கொரிய - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் - சிறிய பிழை திருத்தங்கள்

# changelogs/98.txt:1
source: # v4.1.8 - Modern Love **2024-04-19** - new language: Interlingua - updated translations - small bug fixes: - show bitrate in station search (@SecT0uch) - sleep timer keeps running when station is changed - center the divider in the station card layout (@polttopull006) - correctly display the playback button state when a station is deleted (@dustin23) - handle html encoded metadata correctly (@gege)
ta: # V4.1.8 - நவீன காதல் ** 2024-04-19 ** - புதிய மொழி: இன்டர்லிங்குவா - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள் - சிறிய பிழை திருத்தங்கள்: - நிலைய தேடலில் பிட்ரேட்டைக் காட்டு (@sect0uch) - நிலையம் மாற்றப்படும்போது ச்லீப் நேரங்குறிகருவி தொடர்ந்து ஓடுகிறது - ச்டேசன் அட்டை தளவமைப்பில் வகுப்பியை மையமாகக் கொள்ளுங்கள் (@பொல்டோபுல்006) - ஒரு நிலையம் நீக்கப்படும் போது பிளேபேக் பொத்தான் நிலையை சரியாகக் காண்பி (@dostin23) - உஉகுமொ குறியாக்கப்பட்ட மெட்டாடேட்டாவை சரியாக கையாளவும் (@Gege)

# changelogs/99.txt:1
source: # v4.1.9 - Modern Love **2024-05-03** - now playing metadata for OGG and HLS streams - updated translations
ta: # V4.1.9 - நவீன காதல் ** 2024-05-03 ** - இப்போது OGG மற்றும் HLS நீரோடைகளுக்கு மேனிலை தரவு விளையாடுகிறது - புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகள்
