Repository: 247i/TACETr
Catalog: உரை/தானி/trifa-a-tox-client-for-android-trifa-fcm-companion-app-*.po
Languages: ta

# app_name
source: Tox Notify
ta: நச்சு அறிவிக்கவும்

# quickstart_message
source: This App's purpose is to receive Push Notifications and forward them to the TRIfA App running on this device.
ta: இந்த பயன்பாட்டின் நோக்கம் புச் அறிவிப்புகளைப் பெற்று அவற்றை இந்த சாதனத்தில் இயங்கும் ட்ரிஃபா பயன்பாட்டிற்கு அனுப்புவதாகும்.

# log_token
source: Send Token to TRIfA (for forwarding to ToxProxy)
ta: ட்ரிஃபாவுக்கு கிள்ளாக்கை அனுப்பவும் (டோக்ச்பிராக்சிக்கு அனுப்ப)

# msg_token_fmt
source: FCM registration Token: %s
ta: FCM பதிவு டோக்கன்: %s

# default_notification_channel_name
source: Weather
ta: வானிலை

# msg_subscribe_failed
source: Failed to subscribe to weather topic
ta: வானிலை தலைப்புக்கு குழுசேரத் தவறிவிட்டது

source: FCM Message
ta: FCM செய்தி

# title_activity_settings
source: SettingsActivity
ta: அமைப்புகள்

# lookandfeel_header
source: Look and Feel
ta: பாருங்கள் மற்றும் உணருங்கள்

# theme
source: Choose theme
ta: கருப்பொருள் தேர்வு செய்யவும்

source: Show notifications
ta: அறிவிப்புகளைக் காட்டு

# show_notifications_summary
source: for debugging, independent of TRIfA
ta: பிழைத்திருத்தத்திற்காக, ட்ரிஃபாவிலிருந்து சுயாதீனமாக

source: Prefer FCM
ta: FCM ஐ விரும்புங்கள்

# prefer_fcm_summary
source: use Google FCM for push messages if selected. use nfty.sh if not selected
ta: தேர்ந்தெடுக்கப்பட்டால் புச் செய்திகளுக்கு Google FCM ஐப் பயன்படுத்தவும். தேர்ந்தெடுக்கப்படாவிட்டால் nfty.sh ஐப் பயன்படுத்தவும்
