Repository: 247i/TACETr
Catalog: உரை/தானி/trustroots-messages-*.po
Languages: ta

source: ...explaining that you are interested in meeting them, not just looking for free accommodation.
ta: ... இலவச தங்குமிடத்தைத் தேடுவது மட்டுமல்லாமல், அவர்களைச் சந்திக்க நீங்கள் ஆர்வமாக உள்ளீர்கள் என்பதை விளக்குகிறது.

source: Change
ta: மாற்றம்

source: Conversation started {{ date }}
ta: உரையாடல் தொடங்கியது {{ date }}

source: Do you find messages from this person to be polite, respectful and in the spirit of Trustroots?
ta: இந்த நபரிடமிருந்து கண்ணியமாகவும், மரியாதையுடனும், ட்ரச்ட்ரூட்சின் ஆவியிலும் செய்திகளை நீங்கள் காண்கிறீர்களா?

source: Don't write to people 2 months ahead.
ta: 2 மாதங்களுக்கு முன்னால் மக்களுக்கு எழுத வேண்டாம்.

source: Edit your profile
ta: தொகு your சுயவிவரம்

source: Explain to them why you are choosing them
ta: Explain பெறுநர் them why you அரே choosing them

source: Failed to send the message. Perhaps your internet went down? Please try again.
ta: செய்தியை அனுப்புவதில் தோல்வி. ஒருவேளை உங்கள் இணையம் குறைந்துவிட்டதா? மீண்டும் முயற்சிக்கவும்.

source: Highlight text to add links or change its appearance. Ctrl+Enter to send.
ta: இணைப்புகளைச் சேர்க்க அல்லது அதன் தோற்றத்தை மாற்ற உரையை முன்னிலைப்படுத்தவும். Ctrl+அனுப்ப Enter.

source: License
ta: உரிமம்

source: Make sure your profile is complete
ta: உங்கள் சுயவிவரம் முடிந்தது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்

source: Member is not available anymore.
ta: உறுப்பினர் இனி கிடைக்கவில்லை.

source: More messages
ta: மேலும் செய்திகள்

source: No
ta: இல்லை

source: No conversations yet.
ta: இன்னும் உரையாடல்கள் இல்லை.

source: Please write longer profile description before sending messages.
ta: செய்திகளை அனுப்புவதற்கு முன் நீண்ட சுயவிவர விளக்கத்தை எழுதுங்கள்.

source: Send
ta: அனுப்பு

source: Sorry I can't host
ta: மன்னிக்கவும் என்னால் புரவலன் செய்ய முடியாது

source: Tell a little bit about yourself
ta: உங்களைப் பற்றி கொஞ்சம் சொல்லுங்கள்

source: Tell your host why you're on a trip
ta: நீங்கள் ஏன் ஒரு பயணத்தில் இருக்கிறீர்கள் என்று உங்கள் ஓச்டிடம் சொல்லுங்கள்

source: This user isn't a member anymore.
ta: இந்த பயனர் இனி உறுப்பினர் அல்ல.

source: Tip
ta: உதவிக்குறிப்பு

source: Trustroots is very much about spontaneous travel
ta: ட்ரச்ட்ரூட்ச் தன்னிச்சையான பயணத்தைப் பற்றி அதிகம்

source: Unknown member
ta: தெரியாத உறுப்பினர்

source: What are your expectations in regards with going through their town?
ta: அவர்களின் ஊரைச் செல்வது குறித்து உங்கள் எதிர்பார்ப்புகள் என்ன?

source: Write back
ta: மீண்டும் எழுதுங்கள்

source: Yes
ta: ஆம்

source: Yes, I can host!
ta: ஆம், நான் புரவலன் செய்ய முடியும்!

source: You
ta: நீங்கள்

source: You are writing to too many people too fast. Slow down and try later again.
ta: நீங்கள் பலருக்கு மிக வேகமாக எழுதுகிறீர்கள். மெதுவாக மீண்டும் முயற்சிக்கவும்.

source: You haven't been talking yet.
ta: நீங்கள் இன்னும் பேசவில்லை.

source: You replied
ta: நீங்கள் பதிலளித்தீர்கள்

source: You're much more likely to get a positive response if you have written a bit about yourself.
ta: உங்களைப் பற்றி கொஞ்சம் எழுதியிருந்தால் நீங்கள் நேர்மறையான பதிலைப் பெறுவதற்கான வாய்ப்புகள் அதிகம்.

source: Your profile seems quite empty.
ta: உங்கள் சுயவிவரம் மிகவும் காலியாகத் தெரிகிறது.

source: Your response won't be visible to them.
ta: உங்கள் பதில் அவர்களுக்குத் தெரியாது.

source: {{count}} unread messages
ta: {{count}} படிக்காத செய்திகள்
