Repository: 247i/TACETr
Catalog: உரை/தானி/trustroots-references-*.po
Languages: ta

# All experiences are by female members.
source: All experiences are from female members.
ta: அனைத்து அனுபவங்களும் பெண் உறுப்பினர்களிடமிருந்து வந்தவை.

# All experiences are by male members.
source: All experiences are from male members.
ta: அனைத்து அனுபவங்களும் ஆண் உறுப்பினர்களிடமிருந்து வந்தவை.

# Besides your personal experience, would you recommend others to host them?
source: Apart from your personal experience, would you recommend others to host them?
ta: உங்கள் தனிப்பட்ட அனுபவத்தைத் தவிர, மற்றவர்கள் அவற்றை புரவலன் செய்ய பரிந்துரைக்கிறீர்களா?

# Besides your personal experience, would you recommend others to meet them?
source: Apart from your personal experience, would you recommend others to meet them?
ta: உங்கள் தனிப்பட்ட அனுபவத்தைத் தவிர, மற்றவர்களைச் சந்திக்க பரிந்துரைக்கிறீர்களா?

# Besides your personal experience, would you recommend others to stay with them?
source: Apart from your personal experience, would you recommend others to stay with them?
ta: உங்கள் தனிப்பட்ட அனுபவத்தைத் தவிர, மற்றவர்களுடன் தங்குமாறு பரிந்துரைக்கிறீர்களா?

source: Choose your interaction
ta: உங்கள் தொடர்புகளைத் தேர்வுசெய்க

source: Choose your recommendation
ta: உங்கள் பரிந்துரையைத் தேர்வுசெய்க

source: Did not meet with anyone.
ta: யாரையும் சந்திக்கவில்லை.

source: Did you enjoy their cooking? Singing?
ta: அவர்களின் சமையலை நீங்கள் ரசித்தீர்களா? பாடுகிறீர்களா?

source: Did you maybe enjoy their cooking? Singing?
ta: அவர்களின் சமையலை நீங்கள் ரசித்தீர்களா? பாடுகிறீர்களா?

source: Did you not enjoy their cooking? Singing?
ta: அவர்களின் சமையலை நீங்கள் ரசிக்கவில்லையா? பாடுகிறீர்களா?

source: Did you not like their cooking? Singing?
ta: அவர்களின் சமையல் உங்களுக்கு பிடிக்கவில்லையா? பாடுகிறீர்களா?

source: Everyone recommends them.
ta: எல்லோரும் அவர்களை பரிந்துரைக்கிறார்கள்.

source: Everyone said they would not recommend them.
ta: எல்லோரும் அவர்களை பரிந்துரைக்க மாட்டார்கள் என்று கூறினர்.

source: Experiences pending publishing
ta: அனுபவங்கள் வெளியீடு நிலுவையில் உள்ளன

source: Feedback
ta: கருத்து

source: Guest
ta: விருந்தினர்

source: Host
ta: விருந்தோம்பி

source: How do you know them?
ta: அவற்றை நீங்கள் எப்படி அறிவீர்கள்?

source: I hosted them
ta: நான் அவற்றை புரவலன் செய்தேன்

source: It's extremely important you report anyone behaving against community rules or values to us.
ta: சமூக விதிகள் அல்லது மதிப்புகளுக்கு எதிராக நடந்து கொள்ளும் எவரையும் எங்களுக்கு புகாரளிப்பது மிகவும் முக்கியமானது.

source: Member since {{date, YYYY}}.
ta: உறுப்பினர் {{தேதி, yyyy}}.

# Message to the moderators
source: Send message to the moderators
ta: மதிப்பீட்டாளர்களுக்கு செய்தி அனுப்பவும்

source: Met in person
ta: நேரில் சந்தித்தார்

source: Met with everyone.
ta: எல்லோரிடமும் சந்தித்தார்.

source: Met with {{percentage}}% of members.
ta: உறுப்பினர்களில் {{percentage}}% உடன் சந்தித்தார்.

source: No
ta: இல்லை

source: No experiences yet.
ta: இன்னும் பட்டறிவு இல்லை.

source: Not recommend
ta: பரிந்துரைக்கவில்லை

source: One member shared their experience and they recommended them.
ta: ஒரு உறுப்பினர் தங்கள் அனுபவத்தைப் பகிர்ந்து கொண்டார், அவர்கள் அவர்களை பரிந்துரைத்தனர்.

source: One member shared their experience and they would not recommend them.
ta: ஒரு உறுப்பினர் தங்கள் அனுபவத்தைப் பகிர்ந்து கொண்டார், அவர்கள் அவர்களை பரிந்துரைக்க மாட்டார்கள்.

source: Optional
ta: விரும்பினால்

source: Please write in English if possible, thank you.
ta: முடிந்தால் ஆங்கிலத்தில் எழுதுங்கள், நன்றி.

source: Privately report this person to the moderators
ta: இந்த நபரை மதிப்பீட்டாளர்களிடம் தனிப்பட்ட முறையில் புகாரளிக்கவும்

source: Public feedback
ta: பொது கருத்து

source: Recommend
ta: பரிந்துரைக்கவும்

source: Recommendation
ta: பரிந்துரை

source: See their experiences
ta: அவர்களின் அனுபவங்களைக் காண்க

source: Share your experience
ta: உங்கள் அனுபவத்தைப் பகிர்ந்து கொள்ளுங்கள்

source: Skip
ta: தவிர்

source: Sorry, you can't share experience only with yourself.
ta: மன்னிக்கவும், அனுபவத்தை உங்களுடன் மட்டுமே பகிர்ந்து கொள்ள முடியாது.

source: Thank you for sharing your experience!
ta: உங்கள் அனுபவத்தைப் பகிர்ந்தமைக்கு நன்றி!

source: The answer you write will be publicly available on their profile.
ta: நீங்கள் எழுதும் பதில் அவர்களின் சுயவிவரத்தில் பொதுவில் கிடைக்கும்.

source: They hosted everyone.
ta: அவர்கள் அனைவருக்கும் விருந்தளித்தனர்.

source: They hosted me
ta: அவர்கள் எனக்கு விருந்தளித்தனர்

source: They hosted {{percentage}}% of members.
ta: அவர்கள் உறுப்பினர்களில் {{percentage}}% தொகுத்து வழங்கினர்.

source: Was hosted by everyone.
ta: எல்லோரும் தொகுத்து வழங்கினர்.

source: Was hosted by {{percentage}}% of members.
ta: உறுப்பினர்களில் {{percentage}}% வழங்கப்பட்டது.

source: We're sad to hear you didn't have a great experience using Trustroots!
ta: ட்ரச்ட்ரூட்சைப் பயன்படுத்தி உங்களுக்கு ஒரு சிறந்த பட்டறிவு இல்லை என்பதைக் கேட்டு நாங்கள் வருத்தப்படுகிறோம்!

source: Would you like to describe something about your experience with them?
ta: அவர்களுடனான உங்கள் அனுபவத்தைப் பற்றி ஏதாவது விவரிக்க விரும்புகிறீர்களா?

source: Write about your experience
ta: உங்கள் அனுபவத்தைப் பற்றி எழுதுங்கள்

source: Write about your experience with them
ta: அவர்களுடன் உங்கள் அனுபவத்தைப் பற்றி எழுதுங்கள்

source: Yes
ta: ஆம்

source: You already shared your experience with them
ta: உங்கள் அனுபவத்தை நீங்கள் ஏற்கனவே அவர்களுடன் பகிர்ந்து கொண்டீர்கள்

source: You also reported them to us. Please do <2>get in touch with us</2> if you have any further info to add.
ta: நீங்கள் அவற்றை எங்களிடம் புகாரளித்தீர்கள். தயவுசெய்து <2> எங்களுடன் தொடர்பு கொள்ளுங்கள் </2> உங்களிடம் சேர்க்க கூடுதல் செய்தி இருந்தால்.

source: You have {{count}} days left to respond before their experience will become public.
ta: அவர்களின் பட்டறிவு பகிரங்கமாகிவிடும் முன் பதிலளிக்க உங்களுக்கு {{count}} நாட்கள் உள்ளன.

source: Your experience will become public in {{count}} days, or when they share their experience with you.
ta: உங்கள் பட்டறிவு {{count}}} நாட்களில் பொதுவில் மாறும், அல்லது அவர்கள் தங்கள் அனுபவத்தை உங்களுடன் பகிர்ந்து கொள்ளும்போது.

source: Your experience will become public when {{name}} shares their experience, or at most in {{count}} days.
ta: {{name}} அவர்களின் அனுபவத்தைப் பகிர்ந்து கொள்ளும்போது அல்லது அதிகபட்சம் {{count}} நாட்களில் உங்கள் பட்டறிவு பகிரங்கமாகிவிடும்.

source: Your experience with {{name}} is public now.
ta: {{name} with உடனான உங்கள் பட்டறிவு இப்போது பொதுவில் உள்ளது.

# {{count}} did not recommend.
source: One did not recommend.
ta: ஒருவர் பரிந்துரைக்கவில்லை.

# {{count}} members shared their experiences.
source: One member shared their experience.
ta: ஒரு உறுப்பினர் தங்கள் அனுபவத்தைப் பகிர்ந்து கொண்டார்.

# {{count}} recommended them.
source: One recommended them.
ta: ஒருவர் அவர்களை பரிந்துரைத்தார்.

source: {{percentageFemales}}% of experiences are by females, and {{percentageMales}}% are by males.
ta: {{percentageFemales}}% அனுபவங்கள் பெண்களால், மற்றும் {{{percentageMales}}% ஆண்களால்.

source: {{percentage}}% of experiences are by female members.
ta: {{percentage}}% அனுபவங்கள் பெண் உறுப்பினர்களால்.

source: {{percentage}}% of experiences are by male members.
ta: {{percentage}}% அனுபவங்கள் ஆண் உறுப்பினர்களால்.
