Repository: 247i/TACETr
Catalog: உரை/தானி/trustroots-offers-*.po
Languages: ta

source: Accommodation
ta: தங்குமிடம்

source: Add it to map!
ta: வரைபடத்தில் சேர்க்கவும்!

# At most {{count}} guests.
source: At most one guest.
ta: அதிகபட்சம் ஒரு விருந்தினர்.

source: Bigger map
ta: பெரிய வரைபடம்

source: Can host
ta: புரவலன் செய்யலாம்

source: Cannot host currently
ta: தற்போது புரவலன் செய்ய முடியாது

source: Change
ta: மாற்றம்

source: Just making a dinner and would like to invite people over?
ta: ஒரு இரவு உணவு தயாரித்து, மக்களை அழைக்க விரும்புகிறீர்களா?

source: Meet people
ta: மக்களை சந்திக்கவும்

source: Meetups stay visible on map at most one month.
ta: சந்திப்புகள் வரைபடத்தில் ஒரு மாதத்தில் தெரியும்.

source: Might be able to host
ta: புரவலன் செய்ய முடியும்

source: Modify hosting offer
ta: ஓச்டிங் சலுகையை மாற்றவும்

source: No guests.
ta: விருந்தினர்கள் இல்லை.

source: Offering hospitality and welcoming “strangers” to our homes strengthens our faith in each other.
ta: விருந்தோம்பலை வழங்குவதும், எங்கள் வீடுகளுக்கு “அந்நியர்களை” வரவேற்பதும் ஒருவருக்கொருவர் நம்முடைய நம்பிக்கையை பலப்படுத்துகிறது.

source: Open on device
ta: சாதனத்தில் திறக்கவும்

source: Send a message
ta: ஒரு செய்தியை அனுப்பவும்

source: Sorry, user is not hosting currently.
ta: மன்னிக்கவும், பயனர் தற்போது ஓச்டிங் செய்யவில்லை.

source: Start hosting travellers
ta: பயணிகளை புரவலன் செய்யத் தொடங்குங்கள்

source: Travelling? Organising an event?
ta: பயணம்? ஒரு நிகழ்வை ஏற்பாடு செய்கிறீர்களா?

source: Travelling? Organising an event? Just making a dinner and would like to invite people over?
ta: பயணம்? ஒரு நிகழ்வை ஏற்பாடு செய்கிறீர்களா? ஒரு இரவு உணவு தயாரித்து, மக்களை அழைக்க விரும்புகிறீர்களா?
