Repository: 247i/TACETr
Catalog: உரை/தானி/twinkle-tray-twinkle-tray-*.po
Languages: ta

# LANGUAGE
source: English
ta: ஆங்கிலம்

# GENERIC_OK
source: OK
ta: சரி

# GENERIC_CANCEL
source: Cancel
ta: ரத்துசெய்

# GENERIC_SAVE
source: Save
ta: சேமி

# GENERIC_CLEAR
source: Clear
ta: தெளிவான

# GENERIC_DELETE
source: Delete
ta: நீக்கு

# GENERIC_OFF
source: Off
ta: அணை

# GENERIC_ON
source: On
ta: ஆன்

# GENERIC_QUIT
source: Quit
ta: வெளியேறு

# GENERIC_CLOSE
source: Close
ta: மூடு

# GENERIC_SETTINGS
source: Settings
ta: அமைப்புகள்

# GENERIC_INSTALL
source: Install
ta: நிறுவவும்

# GENERIC_DISMISS
source: Dismiss
ta: தள்ளுபடி

# GENERIC_DEFAULT
source: Default
ta: இயல்புநிலை

# GENERIC_OPTIONAL
source: Optional
ta: விரும்பினால்

# GENERIC_DISPLAY_SINGLE
source: Display
ta: காட்சி

# GENERIC_ALL_DISPLAYS
source: All Displays
ta: அனைத்து காட்சிகள்

# GENERIC_REFRESH_DISPLAYS
source: Refresh displays
ta: காட்சிகளைப் புதுப்பிக்கவும்

# GENERIC_MINIMUM
source: Min
ta: மணித்துளி

# GENERIC_MAXIMUM
source: Max
ta: அதிகபட்சம்

# GENERIC_NO_DISPLAYS
source: No displays detected. Please connect a display to your PC.
ta: காட்சிகள் எதுவும் கண்டறியப்படவில்லை. உங்கள் கணினியுடன் ஒரு காட்சியை இணைக்கவும்.

# GENERIC_NO_COMPATIBLE_DISPLAYS
source: No compatible displays found. Please check that "DDC/CI" is enabled for your displays.
ta: இணக்கமான காட்சிகள் எதுவும் கிடைக்கவில்லை. உங்கள் காட்சிகளுக்கு "டி.டி.சி/சிஐ" இயக்கப்பட்டதா என்பதை சரிபார்க்கவும்.

# GENERIC_NO_DISPLAYS_SHORT
source: No compatible displays detected.
ta: இணக்கமான காட்சிகள் எதுவும் கண்டறியப்படவில்லை.

# GENERIC_SECONDS
source: seconds
ta: நொடிகள்

# GENERIC_MINUTES
source: minutes
ta: நிமிடங்கள்

# GENERIC_DDC_WARNING
source: DDC/CI features such as controlling the power state can cause your monitor to become unresponsive. Use at your own risk.
ta: மின் நிலையைக் கட்டுப்படுத்துவது போன்ற டி.டி.சி/சிஐ நற்பொருத்தங்கள் உங்கள் மானிட்டர் பதிலளிக்காமல் இருக்கும். உங்கள் சொந்த ஆபத்தில் பயன்படுத்தவும்.

# GENERIC_SPEED_INSTANT
source: Instant
ta: உடனடி

# GENERIC_SPEED_SLOW
source: Slow
ta: மெதுவாக

# GENERIC_SPEED_VERY_SLOW
source: Very Slow
ta: மிகவும் மெதுவாக

# GENERIC_SPEED_NORMAL
source: Normal
ta: சாதாரண

# GENERIC_SPEED_FAST
source: Fast
ta: வேகமாக

# GENERIC_SPEED_VERY_FAST
source: Very fast
ta: மிக வேகமாக

# GENERIC_PAUSE_TOD
source: Pause Time Adjustments
ta: நேர மாற்றங்களை இடைநிறுத்தவும்

# GENERIC_PAUSE_IDLE
source: Pause Idle Detection
ta: செயலற்ற கண்டறிதல் இடைநிறுத்தம்

# PANEL_TITLE
source: Adjust Brightness
ta: பிரகாசத்தை சரிசெய்யவும்

# PANEL_UPDATE_AVAILABLE
source: New version available
ta: புதிய பதிப்பு கிடைக்கிறது

# PANEL_BUTTON_LINK_LEVELS
source: Link levels
ta: இணைப்பு நிலைகள்

# PANEL_BUTTON_TURN_OFF_DISPLAYS
source: Turn off displays
ta: காட்சிகளை அணைக்கவும்

# PANEL_LABEL_BRIGHTNESS
source: Brightness
ta: ஒளி

# PANEL_LABEL_CONTRAST
source: Contrast
ta: மாறுபாடு

# PANEL_LABEL_OFF_ON
source: Power State
ta: ஆற்றல் நிலை

# PANEL_LABEL_COLOR_TEMPERATURE
source: Color Temperature
ta: வண்ண வெப்பநிலை

# PANEL_LABEL_VOLUME
source: Volume
ta: தொகுதி

# PANEL_LABEL_TURN_OFF
source: Power off
ta: ஆற்றல் முடக்குகிறது

# PANEL_LABEL_TURN_ON
source: Power on
ta: ஆற்றல்

# INTRO_TITLE
source: Hello, Twinkle Tray!
ta: வணக்கம், ட்விங்கிள் தட்டு!

# INTRO_INSTRUCTIONS
source: The tray icon for Twinkle Tray is probably hidden, so you should move it to some place you can easily access it. See below for instructions.
ta: ட்விங்கிள் தட்டுக்கான தட்டு படவுரு அநேகமாக மறைக்கப்பட்டிருக்கலாம், எனவே நீங்கள் அதை எளிதாக அணுகக்கூடிய ஏதேனும் ஒரு இடத்திற்கு நகர்த்த வேண்டும். வழிமுறைகளுக்கு கீழே காண்க.

# SETTINGS_TITLE
source: Twinkle Tray Settings
ta: ட்விங்கிள் தட்டு அமைப்புகள்

# SETTINGS_SIDEBAR_GENERAL
source: General
ta: பொது

# SETTINGS_SIDEBAR_MONITORS
source: Monitor Settings
ta: அமைப்புகளை கண்காணிக்கவும்

# SETTINGS_SIDEBAR_FEATURES
source: DDC/CI Features
ta: டி.டி.சி/சி.ஐ நற்பொருத்தங்கள்

# SETTINGS_SIDEBAR_TIME
source: Time Adjustments
ta: நேர சரிசெய்தல்

# SETTINGS_SIDEBAR_HOTKEYS
source: Hotkeys & Shortcuts
ta: ஆட்கீச் மற்றும் குறுக்குவழிகள்

# SETTINGS_SIDEBAR_UPDATES
source: Updates
ta: புதுப்பிப்புகள்

# SETTINGS_GENERAL_TITLE
source: General
ta: பொது

# SETTINGS_GENERAL_STARTUP
source: Launch at startup
ta: தொடக்கத்தில் தொடங்கவும்

# SETTINGS_GENERAL_BRIGHTNESS_STARTUP_TITLE
source: Apply brightness at startup
ta: தொடக்கத்தில் பிரகாசத்தைப் பயன்படுத்துங்கள்

# SETTINGS_GENERAL_BRIGHTNESS_STARTUP_DESC
source: Restore the last known brightness for each display when Twinkle Tray starts.
ta: ட்விங்கிள் தட்டு தொடங்கும் போது ஒவ்வொரு காட்சிக்கும் கடைசியாக அறியப்பட்ட பிரகாசத்தை மீட்டெடுக்கவும்.

# SETTINGS_GENERAL_THEME_TITLE
source: Theme
ta: கருப்பொருள்

# SETTINGS_GENERAL_THEME_SYSTEM
source: System preferences (default)
ta: கணினி விருப்பத்தேர்வுகள் (இயல்புநிலை)

# SETTINGS_GENERAL_THEME_DARK
source: Dark
ta: இருண்ட

# SETTINGS_GENERAL_THEME_LIGHT
source: Light
ta: ஒளி

# SETTINGS_GENERAL_LANGUAGE_TITLE
source: Language
ta: மொழி

# SETTINGS_GENERAL_LANGUAGE_SYSTEM
source: System language (default)
ta: கணினி மொழி (இயல்புநிலை)

# SETTINGS_GENERAL_RESET_TITLE
source: Reset settings
ta: அமைப்புகளை மீட்டமைக்கவும்

# SETTINGS_GENERAL_RESET_DESC
source: Hit this button to clear your config.
ta: உங்கள் உள்ளமைவை அழிக்க இந்த பொத்தானை அழுத்தவும்.

# SETTINGS_GENERAL_RESET_BUTTON
source: Reset settings
ta: அமைப்புகளை மீட்டமைக்கவும்

# SETTINGS_GENERAL_ACRYLIC_TITLE
source: Acrylic Blur
ta: அக்ரிலிக் மங்கலானது

# SETTINGS_GENERAL_ACRYLIC_DESC
source: Enable or disable the blur behind transparent backgrounds in Twinkle Tray.
ta: ட்விங்கிள் தட்டில் வெளிப்படையான பின்னணியின் பின்னால் உள்ள மங்கலை இயக்கவும் அல்லது முடக்கவும்.

# SETTINGS_GENERAL_MICA_TITLE
source: Mica Blur
ta: சிறிய மங்கலானது

# SETTINGS_GENERAL_MICA_DESC
source: Enable or disable the blur behind backgrounds in Twinkle Tray.
ta: ட்விங்கிள் தட்டில் பின்னணிக்கு பின்னால் மங்கலை இயக்கவும் அல்லது முடக்கவும்.

# SETTINGS_GENERAL_ANALYTICS_TITLE
source: Analytics
ta: பகுப்பாய்வு

# SETTINGS_GENERAL_ANALYTICS_DESC
source: Send usage data to help improve Twinkle Tray. No personal info is sent. {{1}}
ta: ட்விங்கிள் தட்டில் மேம்படுத்த உதவ பயன்பாட்டு தரவை அனுப்பவும். தனிப்பட்ட செய்தி எதுவும் அனுப்பப்படவில்லை. {{1}}

# SETTINGS_GENERAL_ANALYTICS_LINK
source: Learn more
ta: மேலும் அறிக

# SETTINGS_GENERAL_SCROLL_TITLE
source: Tray icon scroll shortcut
ta: தட்டு படவுரு சுருள் குறுக்குவழி

# SETTINGS_GENERAL_SCROLL_DESC
source: Adjust the brightness of all displays at once by scrolling over the system tray icon. This does not work with some trackpads.
ta: கணினி தட்டு ஐகானை ச்க்ரோலிங் செய்வதன் மூலம் அனைத்து காட்சிகளின் பிரகாசத்தையும் ஒரே நேரத்தில் சரிசெய்யவும். இது சில டிராக்பேட்களுடன் வேலை செய்யாது.

# SETTINGS_GENERAL_TRAY_ICON_TITLE
source: Tray icon
ta: தட்டு படவுரு

# SETTINGS_GENERAL_TROUBLESHOOTING
source: Troubleshooting
ta: சரிசெய்தல்

# SETTINGS_GENERAL_DIS_MONITOR_FEATURES_TITLE
source: Enabled monitor detection methods
ta: இயக்கப்பட்ட மானிட்டர் கண்டறிதல் முறைகள்

# SETTINGS_GENERAL_DIS_MONITOR_FEATURES_DESC
source: If Twinkle Tray is unresponsive when clicking on the tray icon or not detecting your displays, you can try disabling certain monitor detection methods. Restart Twinkle Tray for changes to take effect. {{1}}
ta: தட்டு ஐகானைக் சொடுக்கு செய்யும்போது அல்லது உங்கள் காட்சிகளைக் கண்டறியாதபோது ட்விங்கிள் தட்டு பதிலளிக்கவில்லை என்றால், சில மானிட்டர் கண்டறிதல் முறைகளை முடக்க முயற்சி செய்யலாம். மாற்றங்கள் நடைமுறைக்கு வருவதற்கு ட்விங்கிள் தட்டில் மறுதொடக்கம் செய்யுங்கள். {{1}}

# SETTINGS_GENERAL_OVERLAY_TITLE
source: Default overlay behavior
ta: இயல்புநிலை மேலடுக்கு நடத்தை

# SETTINGS_GENERAL_OVERLAY_DESC
source: How forcefully the brightness hotkey overlay will attempt to display over other apps. You should not need to adjust this.
ta: பிரகாசமான ஆட்ச்கி மேலடுக்கு மற்ற பயன்பாடுகளை எவ்வளவு வலுக்கட்டமாகக் காட்ட முயற்சிக்கும். இதை நீங்கள் சரிசெய்ய தேவையில்லை.

# SETTINGS_GENERAL_DIS_OVERLAY_TITLE
source: Disable overlay
ta: மேலடுக்கை முடக்கு

# SETTINGS_GENERAL_DIS_OVERLAY_DESC
source: If Twinkle Tray's hotkey overlay is interfering with fullscreen applications, you can disable it here.
ta: ட்விங்கிள் ட்ரேயின் ஆட்ச்கி மேலடுக்கு முழுத்திரை பயன்பாடுகளில் தலையிடினால், நீங்கள் அதை இங்கே முடக்கலாம்.

# SETTINGS_GENERAL_ON_OVERLAY_TITLE
source: Most compatible
ta: மிகவும் இணக்கமானது

# SETTINGS_GENERAL_ON_OVERLAY_DESC
source: The overlay will display over most windows, but will not force itself above apps that are marked as "always on top".
ta: மேலடுக்கு பெரும்பாலான சாளரங்களில் காண்பிக்கப்படும், ஆனால் "எப்போதும் மேலே" எனக் குறிக்கப்பட்ட பயன்பாடுகளுக்கு மேலே தன்னை கட்டாயப்படுத்தாது.

# SETTINGS_GENERAL_FORCE_OVERLAY_TITLE
source: Forced on
ta: கட்டாயப்படுத்தப்பட்டது

# SETTINGS_GENERAL_FORCE_OVERLAY_DESC
source: Always try to show the overlay on top of other windows. This can cause issues with exclusive fullscreen games and other fullscreen apps. It can also trigger anti-cheat in some games.
ta: மற்ற சன்னல்களின் மேல் மேலடுக்கைக் காட்ட எப்போதும் முயற்சிக்கவும். இது பிரத்யேக முழுத்திரை விளையாட்டுகள் மற்றும் பிற முழுத்திரை பயன்பாடுகளில் சிக்கல்களை ஏற்படுத்தும். இது சில விளையாட்டுகளில் ஏமாற்றுக்காயைத் தூண்டும்.

# SETTINGS_GENERAL_LEGACY_DDC_TITLE
source: Legacy DDC/CI detection method
ta: மரபு டி.டி.சி/சிஐ கண்டறிதல் முறை

# SETTINGS_GENERAL_LEGACY_DDC_DESC
source: Use the old v1.15.5 method of detecting DDC/CI displays.
ta: டி.டி.சி/சிஐ காட்சிகளைக் கண்டறியும் பழைய V1.15.5 முறையைப் பயன்படுத்தவும்.

# SETTINGS_GENERAL_AUTOBRIGHT_TITLE
source: Auto-apply brightness
ta: தானாகவே பயன்பாட்டு ஒளி

# SETTINGS_GENERAL_AUTOBRIGHT_DESC
source: If your monitor responds strangely after turning it off/on or disconnecting/connecting hardware, disabling this may help.
ta: உங்கள் மானிட்டர் அதை அணைத்த பிறகு/ஆன்/ஆன் அல்லது துண்டிக்க/இணைத்த பிறகு விசித்திரமாக பதிலளித்தால், இதை முடக்குவது உதவக்கூடும்.

# SETTINGS_GENERAL_SKIP_APPLY_TITLE
source: Skip auto-apply to specific monitors
ta: குறிப்பிட்ட மானிட்டர்களுக்கு தானாக விண்ணப்பிக்கத் தவிர்க்கவும்

# SETTINGS_GENERAL_SKIP_APPLY_DESC
source: Disable auto-applying known brightness after all hardware/power events for specific monitors. This include the idle detection feature.
ta: குறிப்பிட்ட மானிட்டர்களுக்கான அனைத்து வன்பொருள்/சக்தி நிகழ்வுகளுக்குப் பிறகு தானாகவே பயன்படுத்தப்பட்ட பிரகாசத்தை முடக்கு. செயலற்ற கண்டறிதல் நற்பொருத்தம் இதில் அடங்கும்.

# SETTINGS_GENERAL_REPORT_TITLE
source: Generate Report
ta: அறிக்கையை உருவாக்குங்கள்

# SETTINGS_GENERAL_REPORT_DESC
source: Save a text file with information about your monitors and settings for debugging.
ta: உங்கள் மானிட்டர்கள் மற்றும் பிழைத்திருத்தத்திற்கான அமைப்புகள் பற்றிய தகவல்களுடன் உரை கோப்பை சேமிக்கவும்.

# SETTINGS_MONITORS_RATE_TITLE
source: Brightness update rate
ta: ஒளி புதுப்பிப்பு வீதம்

# SETTINGS_MONITORS_RATE_DESC
source: How often the brightness will be updated on your displays as you're adjusting their values. Increase the time if your displays are flickering.
ta: நீங்கள் அவற்றின் மதிப்புகளை சரிசெய்யும்போது உங்கள் காட்சிகளில் ஒளி எவ்வளவு அடிக்கடி புதுப்பிக்கப்படும். உங்கள் காட்சிகள் ஒளிரும் என்றால் நேரத்தை அதிகரிக்கவும்.

# SETTINGS_MONITORS_RATE_0
source: Ludicrous
ta: நகைச்சுவையான

# SETTINGS_MONITORS_RATE_1
source: Fast (250 ms)
ta: வேகமாக (250 எம்.எச்)

# SETTINGS_MONITORS_RATE_2
source: Normal (500 ms)
ta: இயல்பானது (500 எம்.எச்)

# SETTINGS_MONITORS_RATE_3
source: Slow (1 second)
ta: மெதுவாக (1 வினாடி)

# SETTINGS_MONITORS_RATE_4
source: Very Slow (2 seconds)
ta: மிகவும் மெதுவாக (2 விநாடிகள்)

# SETTINGS_MONITORS_RENAME_TITLE
source: Rename Monitors
ta: மானிட்டர்கள் மறுபெயரிடுங்கள்

# SETTINGS_MONITORS_RENAME_DESC
source: If you'd prefer a different name for each monitor (ex "Left Monitor", "Middle Monitor"), you can enter it below. Leaving the field empty will restore the original name.
ta: ஒவ்வொரு மானிட்டருக்கும் (முன்னாள் "இடது மானிட்டர்", "நடுத்தர மானிட்டர்") வெவ்வேறு பெயரை நீங்கள் விரும்பினால், நீங்கள் அதை கீழே உள்ளிடலாம். புலத்தை காலியாக விட்டுவிடுவது அசல் பெயரை மீட்டெடுக்கும்.

# SETTINGS_MONITORS_ENTER_NAME
source: Enter name
ta: பெயரை உள்ளிடவும்

# SETTINGS_MONITORS_REORDER_TITLE
source: Reorder Monitors
ta: மறுதொடக்கம் மானிட்டர்கள்

# SETTINGS_MONITORS_REORDER_DESC
source: Change the order that monitors are displayed in the tray. Click and drag to make changes.
ta: தட்டில் மானிட்டர்கள் காட்டப்படும் வரிசையை மாற்றவும். மாற்றங்களைச் செய்ய சொடுக்கு செய்து இழுக்கவும்.

# SETTINGS_MONITORS_NORMALIZE_TITLE
source: Normalize Brightness
ta: பிரகாசத்தை இயல்பாக்குங்கள்

# SETTINGS_MONITORS_NORMALIZE_DESC
source: Monitors often have different brightness ranges. By limiting the min/max brightness per display, the brightness levels between displays is much more consistent. Similar monitors will use the same settings.
ta: மானிட்டர்கள் பெரும்பாலும் வெவ்வேறு பிரகாசமான வரம்புகளைக் கொண்டுள்ளன. ஒரு காட்சிக்கு நிமிடம்/அதிகபட்ச பிரகாசத்தை கட்டுப்படுத்துவதன் மூலம், காட்சிகளுக்கு இடையிலான ஒளி அளவுகள் மிகவும் சீரானவை. இதே போன்ற மானிட்டர்கள் அதே அமைப்புகளைப் பயன்படுத்தும்.

# SETTINGS_MONITORS_DETAILS_NAME
source: Name
ta: பெயர்

# SETTINGS_MONITORS_DETAILS_INTERNAL_NAME
source: Internal Name
ta: உள் பெயர்

# SETTINGS_MONITORS_DETAILS_COMMUNICATION
source: Communication Method
ta: தொடர்பு முறை

# SETTINGS_MONITORS_DETAILS_BRIGHTNESS
source: Current Brightness
ta: தற்போதைய ஒளி

# SETTINGS_MONITORS_DETAILS_MAX_BRIGHTNESS
source: Max Brightness
ta: அதிகபட்ச ஒளி

# SETTINGS_MONITORS_DETAILS_BRIGHTNESS_NORMALIZATION
source: Brightness Normalization
ta: ஒளி இயல்பாக்கம்

# SETTINGS_MONITORS_HIDE_INTERNAL_TITLE
source: Hide Inactive Internal Display
ta: செயலற்ற உள் காட்சியை மறைக்கவும்

# SETTINGS_MONITORS_HIDE_INTERNAL_DESC
source: When the lid is closed or the internal display has been disabled in Windows, hide the brightness slider in the panel.
ta: மூடி மூடப்பட்டால் அல்லது சன்னல்களில் உள் காட்சி முடக்கப்பட்டால், பேனலில் பிரகாசமான ச்லைடரை மறைக்கவும்.

# SETTINGS_MONITORS_HIDE_DISPLAYS_TITLE
source: Hide Displays
ta: காட்சிகளை மறைக்கவும்

# SETTINGS_MONITORS_HIDE_DISPLAYS_DESC
source: If you would like to hide specific displays from the flyout, you can toggle them off here.
ta: ஃப்ளைஅவுட்டிலிருந்து குறிப்பிட்ட காட்சிகளை மறைக்க விரும்பினால், அவற்றை இங்கே மாற்றலாம்.

# SETTINGS_FEATURES_DESCRIPTION
source: Enable or disable specific DDC/CI features in the brightness panel. At least one feature must be enabled for your monitor to show up in the brightness panel. Not all displays support these features, such as laptop/tablet displays.
ta: பிரகாசமான பேனலில் குறிப்பிட்ட டி.டி.சி/சிஐ அம்சங்களை இயக்கவும் அல்லது முடக்கவும். உங்கள் மானிட்டர் பிரகாசமான குழுவில் காண்பிக்க குறைந்தபட்சம் ஒரு நற்பொருத்தம் இயக்கப்பட வேண்டும். எல்லா காட்சிகளும் மடிக்கணினி/டேப்லெட் காட்சிகள் போன்ற இந்த அம்சங்களை ஆதரிக்கவில்லை.

# SETTINGS_FEATURES_UNSUPPORTED
source: This monitor does not support DDC/CI features.
ta: இந்த மானிட்டர் டிடிசி/சிஐ அம்சங்களை ஆதரிக்கவில்லை.

# SETTINGS_FEATURES_CUR_BRIGHTNESS_TITLE
source: Check Current Values
ta: தற்போதைய மதிப்புகளை சரிபார்க்கவும்

# SETTINGS_FEATURES_CUR_BRIGHTNESS_DESC
source: Always get the latest values from the monitor when opening the brightness panel. Enable this if the brightness (or other VCP codes like contrast) frequently change from outside of Twinkle Tray.
ta: ஒளி பேனலைத் திறக்கும்போது மானிட்டரிலிருந்து அண்மைக் கால மதிப்புகளை எப்போதும் பெறுங்கள். ட்விங்கிள் தட்டுக்கு வெளியே இருந்து ஒளி (அல்லது மாறுபாடு போன்ற பிற வி.சி.பி குறியீடுகள்) அடிக்கடி மாறினால் இதை இயக்கவும்.

# SETTINGS_FEATURES_POWER_TITLE
source: Power State Signal
ta: ஆற்றல் நிலை சமிக்ஞை

# SETTINGS_FEATURES_POWER_DESC
source: When sending the DDC/CI command to turn off your display, the following value(s) will be sent.
ta: உங்கள் காட்சியை அணைக்க DDC/CI கட்டளையை அனுப்பும்போது, ​​பின்வரும் மதிப்பு (கள்) அனுப்பப்படும்.

# SETTINGS_FEATURES_POWER_STANDBY
source: Standby
ta: காத்திருப்பு

# SETTINGS_FEATURES_POWER_OFF
source: Power off
ta: ஆற்றல் முடக்குகிறது

# SETTINGS_FEATURES_POWER_COMPAT
source: Most compatible
ta: மிகவும் இணக்கமானது

# SETTINGS_FEATURES_POWER_WARNING
source: The "Standby" option is more likely to allow toggling the monitor on/off from Twinkle Tray. However, many monitors do not respond correctly to changing power state. Use at your own risk.
ta: "காத்திருப்பு" விருப்பம் ட்விங்கிள் தட்டில் இருந்து மானிட்டரை மாற்ற அனுமதிக்க அதிக வாய்ப்புள்ளது. இருப்பினும், பல மானிட்டர்கள் மின் நிலையை மாற்றுவதற்கு சரியாக பதிலளிக்கவில்லை. உங்கள் சொந்த ஆபத்தில் பயன்படுத்தவும்.

# SETTINGS_FEATURES_ADD
source: Add Feature
ta: அம்சத்தைச் சேர்க்கவும்

# SETTINGS_FEATURES_ADD_DESC
source: Enter the VCP code for the feature you would like to add to your display. Please note that Twinkle Tray does not validate if your display actually supports this VCP code. Use at your own risk.
ta: உங்கள் காட்சியில் நீங்கள் சேர்க்க விரும்பும் அம்சத்திற்காக VCP குறியீட்டை உள்ளிடவும். இந்த வி.சி.பி குறியீட்டை உங்கள் காட்சி உண்மையில் ஆதரித்தால் ட்விங்கிள் தட்டு சரிபார்க்காது என்பதை நினைவில் கொள்க. உங்கள் சொந்த ஆபத்தில் பயன்படுத்தவும்.

# SETTINGS_FEATURES_ADD_VCP
source: VCP Code
ta: வி.சி.பி குறியீடு

# SETTINGS_FEATURES_ADD_PLACEHOLDER
source: VCP code (Ex. 0x12)
ta: வி.சி.பி குறியீடு (எ.கா. 0x12)

# SETTINGS_FEATURES_ADD_EXISTS
source: This feature is already active.
ta: இந்த நற்பொருத்தம் ஏற்கனவே செயலில் உள்ளது.

# SETTINGS_FEATURES_VCP_LIST_TITLE
source: All VCP codes reported by this display
ta: இந்த காட்சியால் அறிவிக்கப்பட்ட அனைத்து வி.சி.பி குறியீடுகளும்

# SETTINGS_FEATURES_VCP_LIST_DESC
source: The following is a list of available VCP codes reported by this display to Windows. Twinkle Tray does not validate the functionality or stability of these VCP codes. Use them at your own risk.
ta: விண்டோசுக்கு இந்த காட்சி மூலம் புகாரளிக்கப்பட்ட VCP குறியீடுகளின் பட்டியல் பின்வருமாறு. இந்த வி.சி.பி குறியீடுகளின் செயல்பாடு அல்லது நிலைத்தன்மையை ட்விங்கிள் தட்டு சரிபார்க்காது. அவற்றை உங்கள் சொந்த ஆபத்தில் பயன்படுத்தவும்.

# SETTINGS_FEATURES_VCP_EXPECTED
source: Expected values
ta: எதிர்பார்க்கப்படும் மதிப்புகள்

# SETTINGS_TIME_TITLE
source: Time of Day Adjustments
ta: நாள் சரிசெய்தல் நேரம்

# SETTINGS_TIME_DESC
source: Automatically set your monitors to a specific brightness level at a desired time. All monitors will be set to the same, normalized levels.
ta: விரும்பிய நேரத்தில் உங்கள் மானிட்டர்களை ஒரு குறிப்பிட்ட பிரகாச நிலைக்கு தானாக அமைக்கவும். அனைத்து மானிட்டர்களும் ஒரே, இயல்பாக்கப்பட்ட நிலைகளுக்கு அமைக்கப்படும்.

# SETTINGS_TIME_ADD
source: Add a time
ta: ஒரு நேரத்தைச் சேர்க்கவும்

# SETTINGS_TIME_REMOVE
source: Remove time
ta: நேரத்தை அகற்று

# SETTINGS_TIME_INDIVIDUAL_TITLE
source: Set brightness for individual displays
ta: தனிப்பட்ட காட்சிகளுக்கு பிரகாசத்தை அமைக்கவும்

# SETTINGS_TIME_INDIVIDUAL_DESC
source: Configure the brightness per display instead of for all displays at once.
ta: எல்லா காட்சிகளுக்கும் பதிலாக ஒரே நேரத்தில் ஒரு காட்சிக்கு பிரகாசத்தை உள்ளமைக்கவும்.

# SETTINGS_TIME_TRANSITON_TITLE
source: Brightness transition speed
ta: ஒளி மாற்றம் விரைவு

# SETTINGS_TIME_TRANSITON_DESC
source: How quickly brightness should transition when time of day adjustments are activated.
ta: பகல் மாற்றங்களின் நேரம் செயல்படுத்தப்படும்போது எவ்வளவு விரைவாக ஒளி மாற வேண்டும்.

# SETTINGS_TIME_STARTUP_TITLE
source: Check at app startup
ta: பயன்பாட்டு தொடக்கத்தில் சரிபார்க்கவும்

# SETTINGS_TIME_STARTUP_DESC
source: Adjust the brightness to match the most relevant time when Twinkle Tray starts.
ta: ட்விங்கிள் தட்டு தொடங்கும் போது மிகவும் பொருத்தமான நேரத்தை பொருத்த பிரகாசத்தை சரிசெய்யவும்.

# SETTINGS_TIME_IDLE_TITLE
source: Idle Detection
ta: செயலற்ற கண்டறிதல்

# SETTINGS_TIME_IDLE_DESC
source: When no input has been detected for a period of time, the brightness of all displays will be reduced.
ta: ஒரு குறிப்பிட்ட காலத்திற்கு எந்த உள்ளீடும் கண்டறியப்படாதபோது, ​​அனைத்து காட்சிகளின் பிரகாசமும் குறைக்கப்படும்.

# SETTINGS_TIME_ANIMATE_TITLE
source: Animate between times
ta: நேரங்களுக்கு இடையில் உயிரூட்டவும்

# SETTINGS_TIME_ANIMATE_DESC
source: Brightness values will be animated between the current and next scheduled event. May increase CPU usage. Manual brightness adjustments will quickly be overwritten while this is active.
ta: தற்போதைய மற்றும் அடுத்த திட்டமிடப்பட்ட நிகழ்வுக்கு இடையில் பிரகாச மதிப்புகள் அனிமேசன் செய்யப்படும். சிபியு பயன்பாட்டை அதிகரிக்கலாம். இது செயலில் இருக்கும்போது கையேடு பிரகாச மாற்றங்கள் விரைவாக மேலெழுதப்படும்.

# SETTINGS_TIME_SUN_TITLE
source: Coordinates for sun position
ta: சூரிய நிலைக்கான ஒருங்கிணைப்புகள்

# SETTINGS_TIME_SUN_DESC
source: To use "sun position" for time adjustments, enter your current latitude and longitude so the correct times can be determined.
ta: நேர மாற்றங்களுக்கு "சூரிய நிலை" பயன்படுத்த, உங்கள் தற்போதைய அட்சரேகை மற்றும் தீர்க்கரேகையை உள்ளிடவும், இதனால் சரியான நேரங்களை தீர்மானிக்க முடியும்.

# SETTINGS_TIME_LAT
source: Latitude
ta: அகலாங்கு

# SETTINGS_TIME_LONG
source: Longitude
ta: நெட்டாங்கு

# SETTINGS_TIME_SUN_GET
source: Get coordinates
ta: ஒருங்கிணைப்புகளைப் பெறுங்கள்

# SETTINGS_TIME_IDLE_FS_TITLE
source: Fullscreen apps block idle detection
ta: முழுத்திரை பயன்பாடுகள் செயலற்ற கண்டறிதலைத் தடுக்கின்றன

# SETTINGS_TIME_IDLE_FS_DESC
source: Fullscreen apps block idle detection. This only applies to the focused window.
ta: முழுத்திரை பயன்பாடுகள் செயலற்ற கண்டறிதலைத் தடுக்கின்றன. இது கவனம் செலுத்திய சாளரத்திற்கு மட்டுமே பொருந்தும்.

# SETTINGS_TIME_IDLE_MEDIA_TITLE
source: Media blocks idle detection
ta: செயலற்ற கண்டறிதல் மீடியா தொகுதிகள்

# SETTINGS_TIME_IDLE_MEDIA_DESC
source: Idle detection will be disabled while any media is playing. This includes both video and audio. This only applies when Windows reports that media is playing.
ta: எந்தவொரு ஊடகமும் விளையாடும்போது செயலற்ற கண்டறிதல் முடக்கப்படும். இதில் வீடியோ மற்றும் ஆடியோ இரண்டுமே அடங்கும். மீடியா விளையாடுவதாக சாளரங்கள் தெரிவிக்கும்போது மட்டுமே இது பொருந்தும்.

# SETTINGS_HOTKEYS_TITLE
source: Hotkeys
ta: ஆட்கீச்

# SETTINGS_HOTKEYS_DESC
source: Configure hotkeys to adjust the brightness of one or all displays.
ta: ஒன்று அல்லது அனைத்து காட்சிகளின் பிரகாசத்தை சரிசெய்ய ஆட்கீசை உள்ளமைக்கவும்.

# SETTINGS_HOTKEYS_ADD
source: Add Hotkey
ta: ஆட்ச்கி சேர்க்கவும்

# SETTINGS_HOTKEYS_REMOVE
source: Remove hotkey
ta: ஆட்ச்கியை அகற்று

# SETTINGS_HOTKEYS_INCREASE
source: Increase Brightness
ta: பிரகாசத்தை அதிகரிக்கவும்

# SETTINGS_HOTKEYS_DECREASE
source: Decrease Brightness
ta: பிரகாசத்தைக் குறைத்தல்

# SETTINGS_HOTKEYS_PRESS_KEYS_HINT
source: Press keys here
ta: சாவியை இங்கே அழுத்தவும்

# SETTINGS_HOTKEYS_LEVEL_TITLE
source: Brightness level adjustment
ta: பிரகாசமான நிலை சரிசெய்தல்

# SETTINGS_HOTKEYS_LEVEL_DESC
source: How much the brightness should be adjusted when using hotkeys.
ta: ஆட்கிகளைப் பயன்படுத்தும் போது பிரகாசத்தை எவ்வளவு சரிசெய்ய வேண்டும்.

# SETTINGS_HOTKEYS_SCROLL_AMOUNT
source: Amount to scroll
ta: உருட்டும் தொகை

# SETTINGS_HOTKEYS_INVERT_SCROLL_TITLE
source: Invert scroll
ta: தலைகீழ் சுருள்

# SETTINGS_HOTKEYS_INVERT_SCROLL_DESC
source: When scrolling over the system tray icon, the scroll direction will be reversed.
ta: கணினி தட்டு ஐகானை ச்க்ரோலிங் செய்யும் போது, ​​உருள் திசை மாற்றப்படும்.

# SETTINGS_HOTKEYS_TOD_TITLE
source: Turn Off Displays action
ta: முடக்குகிறது செயலைக் காட்டுகிறது

# SETTINGS_HOTKEYS_TOD_DESC
source: Customize the signal sent when using the Turn Off Displays hotkey or icon. The software signal will display a black screen until input (ex. mouse or keyboard) is detected by Windows. The hardware signal will turn off power to the monitors.
ta: டர்ன் ஆஃப் டிச்ப்ளேச் ஆட்ச்கி அல்லது ஐகானைப் பயன்படுத்தும் போது அனுப்பப்பட்ட சமிக்ஞையைத் தனிப்பயனாக்கவும். உள்ளீடு (எ.கா. சுட்டி அல்லது விசைப்பலகை) விண்டோசால் கண்டறியப்படும் வரை மென்பொருள் சமிக்ஞை கருப்பு திரையைக் காண்பிக்கும். வன்பொருள் சமிக்ஞை மானிட்டர்களுக்கு சக்தியை அணைக்கும்.

# SETTINGS_HOTKEYS_TOD_NONE
source: None (hide icon)
ta: எதுவுமில்லை (ஐகானை மறைக்க)

# SETTINGS_HOTKEYS_TOD_SOFT
source: Software signal (default)
ta: மென்பொருள் சமிக்ஞை (இயல்புநிலை)
