Repository: 247i/TACETr
Catalog: உரை/தானி/twinkle-tray-twinkle-tray-*.po
Languages: ta

# SETTINGS_HOTKEYS_TOD_HARD
source: Hardware* signal (DDC/CI only)
ta: வன்பொருள்* சமிக்ஞை (டி.டி.சி/சிஐ மட்டும்)

# SETTINGS_HOTKEYS_TOD_BOTH
source: Hardware* & software signal
ta: வன்பொருள்* & மென்பொருள் சமிக்ஞை

# SETTINGS_HOTKEYS_TOD_NOTE
source: *Note: Not all DDC/CI monitors support this feature.
ta: *குறிப்பு: எல்லா டி.டி.சி/சிஐ மானிட்டர்களும் இந்த அம்சத்தை ஆதரிக்கவில்லை.

# SETTINGS_HOTKEYS_BREAK_TITLE
source: Hotkeys break linked levels
ta: ஆட்கிகள் இணைக்கப்பட்ட நிலைகளை உடைக்கின்றன

# SETTINGS_HOTKEYS_BREAK_DESC
source: When using a hotkey for a single display and "linked levels" is active, it will be deactivated.
ta: ஒற்றை காட்சி மற்றும் "இணைக்கப்பட்ட நிலைகள்" செயலில் இருக்கும் போது, ​​அது செயலிழக்கப்படும்.

# SETTINGS_HOTKEY_OFF_WARN
source: This action will use the option selected under "Turn Off Displays action". If you wish to turn off specific displays instead, use the "Set" or "Cycle" Hotkey Action instead.
ta: இந்த நடவடிக்கை "டர்ன் ஆஃப் டிச்ப்ளேச் செயல்" இன் கீழ் தேர்ந்தெடுக்கப்பட்ட விருப்பத்தைப் பயன்படுத்தும். அதற்கு பதிலாக குறிப்பிட்ட காட்சிகளை அணைக்க விரும்பினால், அதற்கு பதிலாக "செட்" அல்லது "சுழற்சி" ஆட்கி செயலைப் பயன்படுத்தவும்.

# SETTINGS_HOTKEY_TARGET
source: Action Target
ta: செயல் இலக்கு

# SETTINGS_HOTKEY_VALUE
source: Value
ta: மதிப்பு

# SETTINGS_HOTKEY_VALUE_PLACEHOLDER
source: Enter a number
ta: ஒரு எண்ணை உள்ளிடவும்

# SETTINGS_HOTKEY_VALUES
source: Values
ta: மதிப்புகள்

# SETTINGS_HOTKEY_ADD_VALUE
source: Add Value
ta: மதிப்பு சேர்க்கவும்

# SETTINGS_HOTKEY_ACTION
source: Action
ta: செயல்

# SETTINGS_HOTKEY_ACTION_SET
source: Set value
ta: மதிப்பை அமைக்கவும்

# SETTINGS_HOTKEY_ACTION_OFFSET
source: Adjust value
ta: மதிப்பை சரிசெய்யவும்

# SETTINGS_HOTKEY_ACTION_CYCLE
source: Cycle list of values
ta: மதிப்புகளின் சுழற்சி பட்டியல்

# SETTINGS_PROFILES_TITLE
source: Profiles
ta: சுயவிவரங்கள்

# SETTINGS_PROFILES_DESC
source: Automatically adjust the brightness or shortcut overlay behavior depending on the focused app. You can also add profiles to the right-click menu in the system tray to quickly change the brightness to pre-defined profiles.
ta: கவனம் செலுத்திய பயன்பாட்டைப் பொறுத்து தானாகவே ஒளி அல்லது குறுக்குவழி மேலடுக்கு நடத்தை சரிசெய்யவும். முன்பே வரையறுக்கப்பட்ட சுயவிவரங்களுக்கு பிரகாசத்தை விரைவாக மாற்ற கணினி தட்டில் வலது சொடுக்கு பட்டியலில் சுயவிவரங்களையும் சேர்க்கலாம்.

# SETTINGS_PROFILES_ADD
source: New Profile
ta: புதிய சுயவிவரம்

# SETTINGS_PROFILES_NAME
source: Profile Name
ta: சுயவிவர பெயர்

# SETTINGS_PROFILES_BRIGHTNESS_TOGGLE
source: Set brightness when active
ta: செயலில் இருக்கும்போது பிரகாசத்தை அமைக்கவும்

# SETTINGS_PROFILES_SHOW_MENU
source: Show in right-click tray menu
ta: வலது சொடுக்கு தட்டு பட்டியலில் காண்பி

# SETTINGS_PROFILES_TRIGGER_TITLE
source: App trigger settings
ta: பயன்பாட்டு தூண்டுதல் அமைப்புகள்

# SETTINGS_PROFILES_APP_PATH
source: App path
ta: பயன்பாட்டு பாதை

# SETTINGS_PROFILES_APP_DESC
source: If you want this profile to activate automatically when a specific app is focused, enter the full or partial path of the EXE below.
ta: ஒரு குறிப்பிட்ட பயன்பாடு கவனம் செலுத்தும்போது இந்த சுயவிவரம் தானாகவே செயல்படுத்த விரும்பினால், கீழே உள்ள EXE இன் முழு அல்லது பகுதி பாதையை உள்ளிடவும்.

# SETTINGS_PROFILES_OVERLAY_TITLE
source: Override overlay type
ta: மேலெழுதும் வகை

# SETTINGS_PROFILES_OVERLAY_DESC
source: Changes the behavior of the hotkey overlay when the specified app is focused. This feature does not work when the profile is manually activated.
ta: குறிப்பிட்ட பயன்பாடு கவனம் செலுத்தும்போது ஆட்ச்கி மேலடுக்கின் நடத்தையை மாற்றுகிறது. சுயவிவரம் கைமுறையாக செயல்படுத்தப்படும்போது இந்த நற்பொருத்தம் செயல்படாது.

# SETTINGS_UPDATES_TITLE
source: Updates
ta: புதுப்பிப்புகள்

# SETTINGS_UPDATES_VERSION
source: You have Twinkle Tray {{1}}.
ta: உங்களிடம் ட்விங்கிள் தட்டு உள்ளது {{1}}.

# SETTINGS_UPDATES_AUTOMATIC_TITLE
source: Automatically check for new versions
ta: புதிய பதிப்புகளை தானாக சரிபார்க்கவும்

# SETTINGS_UPDATES_AUTOMATIC_DESC
source: When there is a new version, it will be shown in the brightness panel.
ta: புதிய பதிப்பு இருக்கும்போது, ​​அது ஒளி பேனலில் காண்பிக்கப்படும்.

# SETTINGS_UPDATES_MS_STORE
source: To check for new versions, visit the Microsoft Store app.
ta: புதிய பதிப்புகளைச் சரிபார்க்க, நுண்மென் கடை பயன்பாட்டைப் பார்வையிடவும்.

# SETTINGS_UPDATES_AVAILABLE
source: New version of Twinkle Tray available!
ta: ட்விங்கிள் தட்டின் புதிய பதிப்பு கிடைக்கிறது!

# SETTINGS_UPDATES_NONE_AVAILABLE
source: Up to date. The current version includes the following changes:
ta: புதுப்பித்த நிலையில். தற்போதைய பதிப்பில் பின்வரும் மாற்றங்கள் உள்ளன:

# SETTINGS_UPDATES_DOWNLOADING
source: Downloading update…
ta: புதுப்பிப்பைப் பதிவிறக்குகிறது…

# SETTINGS_UPDATES_DOWNLOAD
source: Download & Install {{1}}
ta: பதிவிறக்கம் செய்து நிறுவவும் {{1}}

# SETTINGS_UPDATES_CHANNEL
source: Update channel
ta: சேனலைப் புதுப்பிக்கவும்

# SETTINGS_UPDATES_BRANCH_STABLE
source: Stable (default)
ta: நிலையான (இயல்புநிலை)

# SETTINGS_UPDATES_BRANCH_BETA
source: Beta
ta: பீட்டா
