Repository: 247i/TACETr
Catalog: உரை/தானி/ubuntu-desktop-translations-firmware-updater-*.po
Languages: ta

# affectsFdeWarningTitle
source: You may lose all your data without recovery keys
ta: மீட்பு விசைகள் இல்லாமல் உங்கள் எல்லா தரவையும் இழக்க நேரிடும்

# affectsFdeWarningBody1
source: You may need to enter it on boot after updating firmware. Make sure you also have recovery keys for any other encrypted drives on this computer.
ta: ஃபார்ம்வேரைப் புதுப்பித்த பிறகு நீங்கள் அதை துவக்கத்தில் உள்ளிட வேண்டியிருக்கலாம். இந்த கணினியில் மறைகுறியாக்கப்பட்ட வேறு எந்த இயக்கிகளுக்கும் மீட்பு விசைகள் உங்களிடம் உள்ளன என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# affectsFdeWarningBody2
source: You need to provide a recovery key because you enabled hardware-backed encryption.
ta: நீங்கள் வன்பொருள் உதவி குறியாக்கத்தை இயக்கியதால் மீட்பு விசையை வழங்க வேண்டும்.

# affectsFdeTextFieldLabel
source: Enter your recovery key
ta: உங்கள் மீட்பு விசையை உள்ளிடவும்

# affectsFdeLinkLabel
source: Learn more
ta: மேலும் அறிக

# affectsFdeIncorrectKey
source: Recovery key does not work, check or replace it in the Security Center
ta: மீட்பு விசை பாதுகாப்பு மையத்தில் வேலை செய்யவோ, சரிபார்க்கவோ அல்லது மாற்றவோ இல்லை

source: All Versions
ta: அனைத்து பதிப்புகளும்

# appTitle
source: Firmware Updater
ta: ஃபார்ம்வேர் புதுப்பிப்பு

# batteryWarning
source: Warning: some device updates may only be available on external power!
ta: எச்சரிக்கை: சில சாதன புதுப்பிப்புகள் வெளிப்புற சக்தியில் மட்டுமே கிடைக்கக்கூடும்!

source: Checksum
ta: செக்சம்

source: Close
ta: மூடு

source: Cancel
ta: ரத்துசெய்

source: Current
ta: மின்னோட்ட்ம், ஓட்டம்

# deviceUnavailable
source: The device will be unavailable during this action.
ta: இந்த செயலின் போது சாதனம் கிடைக்காது.

source: Device request
ta: சாதன கோரிக்கை

source: Downgrade
ta: தரமிறக்குதல்

# downgradeConfirm
source: Downgrade <b>{name}</b> to version <b>{version}</b>?
ta: பதிப்பிற்கு <b> {name} </b> ஐத் தரமிறக்கவும் <b> {version} </b>?

source: Flags
ta: கொடிகள்

# fwupdDeviceFlagInternal
source: Internal device
ta: உள் சாதனம்

# fwupdDeviceFlagUpdatable
source: Updatable
ta: புதுப்பிக்கத்தக்கது

# fwupdDeviceFlagOnlyOffline
source: Update requires a reboot
ta: புதுப்பிப்புக்கு மறுதொடக்கம் தேவை

# fwupdDeviceFlagRequireAc
source: System requires external power source
ta: கணினிக்கு வெளிப்புற ஆற்றல் மூல தேவை

# fwupdDeviceFlagLocked
source: Device is locked
ta: சாதனம் பூட்டப்பட்டுள்ளது

# fwupdDeviceFlagSupported
source: Supported on remote server
ta: தொலை சேவையகத்தில் ஆதரிக்கப்படுகிறது

# fwupdDeviceFlagNeedsBootloader
source: Requires a bootloader
ta: துவக்க ஏற்றி தேவை

# fwupdDeviceFlagRegistered
source: Registered
ta: பதிவுசெய்யப்பட்டது

# fwupdDeviceFlagNeedsReboot
source: Needs a reboot after installation
ta: நிறுவலுக்குப் பிறகு மறுதொடக்கம் தேவை

# fwupdDeviceFlagNeedsShutdown
source: Needs shutdown after installation
ta: நிறுவலுக்குப் பிறகு பணிநிறுத்தம் தேவை

# fwupdDeviceFlagReported
source: Reported to remote server
ta: தொலை சேவையகத்திற்கு அறிக்கை

# fwupdDeviceFlagNotified
source: User has been notified
ta: பயனருக்கு அறிவிக்கப்பட்டுள்ளது

# fwupdDeviceFlagInstallParentFirst
source: Install to parent device first
ta: முதலில் பெற்றோர் சாதனத்தில் நிறுவவும்

# fwupdDeviceFlagIsBootloader
source: Is in bootloader mode
ta: துவக்க ஏற்றி பயன்முறையில் உள்ளது

# fwupdDeviceFlagWaitForReplug
source: Hardware is waiting to be replugged
ta: வன்பொருள் மாற்றப்படுவதற்கு காத்திருக்கிறது

# fwupdDeviceFlagIgnoreValidation
source: Ignore validation safety checks
ta: சரிபார்ப்பு பாதுகாப்பு சோதனைகளை புறக்கணிக்கவும்

# fwupdDeviceFlagTrusted
source: Trusted
ta: நம்பகமான

# fwupdDeviceFlagNeedsActivation
source: Device update needs activation
ta: சாதன புதுப்பிப்புக்கு செயல்படுத்தல் தேவை

# fwupdDeviceFlagWillDisappear
source: Device will not re-appear after update completes
ta: புதுப்பிப்பு முடிந்ததும் சாதனம் மீண்டும் தோன்றாது

# fwupdDeviceFlagCanVerify
source: Cryptographic hash verification is available
ta: கிரிப்டோகிராஃபிக் ஆச் சரிபார்ப்பு கிடைக்கிறது

# fwupdDeviceFlagDualImage
source: Device stages updates
ta: சாதன நிலைகள் புதுப்பிப்புகள்

# fwupdDeviceFlagSelfRecovery
source: Device can recover flash failures
ta: சாதனம் ஃபிளாச் தோல்விகளை மீட்டெடுக்க முடியும்

# fwupdDeviceFlagUsableDuringUpdate
source: Device is usable for the duration of the update
ta: புதுப்பிப்பின் காலத்திற்கு சாதனம் பயன்படுத்தக்கூடியது

# fwupdDeviceFlagVersionCheckRequired
source: Device firmware is required to have a version check
ta: பதிப்பு காசோலை வைத்திருக்க சாதன நிலைபொருள் தேவை

# fwupdDeviceFlagInstallAllReleases
source: Device is required to install all provided releases
ta: வழங்கப்பட்ட அனைத்து வெளியீடுகளையும் நிறுவ சாதனம் தேவை

# fwupdDeviceFlagHasMultipleBranches
source: Device supports switching to a different branch of firmware
ta: சாதனம் ஃபார்ம்வேரின் வேறு கிளைக்கு மாறுவதை ஆதரிக்கிறது

# fwupdDeviceFlagBackupBeforeInstall
source: Device will backup firmware before installing
ta: நிறுவும் முன் சாதனம் ஃபார்ம்வேரை காப்புப் பிரதி எடுக்கும்

# fwupdDeviceFlagWildcardInstall
source: All devices of the same type will be updated at the same time
ta: ஒரே வகையின் அனைத்து சாதனங்களும் ஒரே நேரத்தில் புதுப்பிக்கப்படும்

# fwupdDeviceFlagOnlyVersionUpgrade
source: Only version upgrades are allowed
ta: பதிப்பு மேம்படுத்தல்கள் மட்டுமே அனுமதிக்கப்படுகின்றன

# fwupdDeviceFlagUnreachable
source: Device is unreachable
ta: சாதனம் அணுக முடியாதது

# fwupdDeviceFlagAffectsFde
source: Full disk encryption secrets may be invalidated when updating
ta: புதுப்பிக்கும்போது முழு வட்டு குறியாக்க ரகசியங்கள் செல்லுபடியாகாது

# fwupdDeviceFlagEndOfLife
source: End of life
ta: வாழ்க்கையின் முடிவு

# fwupdDeviceFlagSignedPayload
source: Signed Payload
ta: கையொப்பமிடப்பட்ட பேலோட்

# fwupdDeviceFlagUnsignedPayload
source: Unsigned Payload
ta: கையொப்பமிடாத பேலோட்

# fwupdErrorInternal
source: Internal error
ta: உள் பிழை

# fwupdErrorVersionNewer
source: Installed newer firmware version
ta: புதிய ஃபார்ம்வேர் பதிப்பை நிறுவியது

# fwupdErrorVersionSame
source: Installed same firmware version
ta: அதே ஃபார்ம்வேர் பதிப்பை நிறுவியது

# fwupdErrorAlreadyPending
source: Already set to be installed offline
ta: ஏற்கனவே ஆஃப்லைனில் நிறுவப்பட உள்ளது

# fwupdErrorAuthFailed
source: Failed to get authentication
ta: அங்கீகாரத்தைப் பெறுவதில் தோல்வி

# fwupdErrorRead
source: Failed to read from device
ta: சாதனத்திலிருந்து படிக்கத் தவறிவிட்டது

# fwupdErrorWrite
source: Failed to write to the device
ta: சாதனத்திற்கு எழுதத் தவறிவிட்டது

# fwupdErrorInvalidFile
source: Invalid file format
ta: தவறான கோப்பு வடிவம்

# fwupdErrorNotFound
source: No matching device exists
ta: பொருந்தக்கூடிய சாதனம் எதுவும் இல்லை

# fwupdErrorNothingToDo
source: Nothing to do
ta: செய்ய எதுவும் இல்லை

# fwupdErrorNotSupported
source: Action was not possible
ta: நடவடிக்கை சாத்தியமில்லை

# fwupdErrorSignatureInvalid
source: Signature was invalid
ta: கையொப்பம் தவறானது

# fwupdErrorAcPowerRequired
source: AC power was required
ta: ஏசி ஆற்றல் தேவைப்பட்டது

# fwupdErrorPermissionDenied
source: Permission was denied
ta: இசைவு மறுக்கப்பட்டது

# fwupdErrorBrokenSystem
source: User has configured their system in a broken way
ta: பயனர் தங்கள் கணினியை உடைந்த வழியில் உள்ளமைத்துள்ளார்

# fwupdErrorBatteryLevelTooLow
source: The system battery level is too low
ta: கணினி பேட்டரி நிலை மிகக் குறைவு

# fwupdErrorNeedsUserAction
source: User needs to do an action to complete the update
ta: புதுப்பிப்பை முடிக்க பயனர் ஒரு செயலைச் செய்ய வேண்டும்

# fwupdErrorAuthExpired
source: Failed to get auth as credentials have expired
ta: நற்சான்றிதழ்கள் காலாவதியானதால் ஏற்பு பெறத் தவறிவிட்டது

# fwupdErrorUnknown
source: Unknown error
ta: தெரியாத பிழை

# fwupdStatusUnknown
source: Unknown state
ta: தெரியாத நிலை

# fwupdStatusIdle
source: Idle
ta: நிலையிக்கம்

# fwupdStatusLoading
source: Loading a resource
ta: ஒரு வளத்தை ஏற்றுகிறது

# fwupdStatusDecompressing
source: Decompressing firmware
ta: ஃபார்ம்வேரை குறைக்கவும்

# fwupdStatusDeviceRestart
source: Restarting the device
ta: சாதனத்தை மறுதொடக்கம் செய்தல்

# fwupdStatusDeviceWrite
source: Writing to a device
ta: ஒரு சாதனத்திற்கு எழுதுதல்

# fwupdStatusDeviceVerify
source: Verifying (reading) a device
ta: ஒரு சாதனத்தை சரிபார்க்கிறது (படித்தல்)

# fwupdStatusScheduling
source: Scheduling an offline update
ta: இணைப்பில்லாத புதுப்பிப்பை திட்டமிடுதல்

# fwupdStatusDownloading
source: A file is downloading
ta: ஒரு கோப்பு பதிவிறக்கம் செய்கிறது

# fwupdStatusDeviceRead
source: Reading from a device
ta: சாதனத்திலிருந்து படித்தல்

# fwupdStatusDeviceErase
source: Erasing a device
ta: சாதனத்தை அழித்தல்

# fwupdStatusWaitingForAuth
source: Waiting for authentication
ta: அங்கீகாரத்திற்காக காத்திருக்கிறது

# fwupdStatusDeviceBusy
source: The device is busy
ta: சாதனம் பிசியாக உள்ளது

# fwupdStatusShutdown
source: The daemon is shutting down
ta: டீமான் மூடப்பட்டு வருகிறது

# guid
source: GUIDs
ta: கய்ட்ச்

# installError
source: Failed to install firmware!
ta: ஃபார்ம்வேரை நிறுவுவதில் தோல்வி!

source: No devices found
ta: சாதனங்கள் எதுவும் கிடைக்கவில்லை

source: OK
ta: சரி

source: Older Versions
ta: பழைய பதிப்புகள்

# rebootLater
source: Restart later
ta: பின்னர் மறுதொடக்கம் செய்யுங்கள்

# rebootNow
source: Restart now
ta: இப்போது மறுதொடக்கம் செய்யுங்கள்

# rebootConfirmMessage
source: You must restart your device to complete the update. Make sure your device is plugged in or fully charged. Save your files before you restart to avoid losing data.
ta: புதுப்பிப்பை முடிக்க உங்கள் சாதனத்தை மறுதொடக்கம் செய்ய வேண்டும். உங்கள் சாதனம் செருகப்பட்டதா அல்லது முழுமையாக சார்ச் செய்யப்பட்டுள்ளதா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். தரவை இழப்பதைத் தவிர்க்க மறுதொடக்கம் செய்வதற்கு முன் உங்கள் கோப்புகளைச் சேமிக்கவும்.

# rebootConfirmTitle
source: Restart to complete this update
ta: இந்த புதுப்பிப்பை முடிக்க மறுதொடக்கம் செய்யுங்கள்

source: Reinstall
ta: மீண்டும் நிறுவவும்

# reinstallConfirm
source: Reinstall <b>{name}</b> version <b>{current}</b>?
ta: மீண்டும் நிறுவவும் <b> {name} </b> பதிப்பு <b> {current} </b>?

source: Show Releases
ta: வெளியீடுகளைக் காட்டு

source: Show Updates
ta: புதுப்பிப்புகளைக் காட்டு

source: Update
ta: புதுப்பிப்பு

source: Update available
ta: புதுப்பிப்பு கிடைக்கிறது

source: Update Checksums
ta: செக்சம்களைப் புதுப்பிக்கவும்

# updateChecksumsConfirm
source: Update device checksums of <b>{name}</b>?
ta: <b> {name} </b> இன் சாதன செக்சம்களைப் புதுப்பிக்கவும்?

# updateChecksumsInfo
source: This will record the current cryptographic hashes as verified.
ta: இது சரிபார்க்கப்பட்டபடி தற்போதைய கிரிப்டோகிராஃபிக் ஆச்களை பதிவு செய்யும்.

source: Update to Latest
ta: அண்மைக் கால புதுப்பிப்பு

# updateConfirm
source: Update <b>{name}</b> to version <b>{version}</b>?
ta: புதுப்பிப்பு <b> {name} </b> பதிப்பிற்கு <b> {version} </b>?

source: Vendor
ta: விற்பனையாளர்

source: Verify Firmware
ta: ஃபார்ம்வேரை சரிபார்க்கவும்

# verifyFirmwareConfirm
source: Verify firmware checksums of {name}?
ta: {name} இன் ஃபார்ம்வேர் செக்சம்களை சரிபார்க்கவா?

source: Current Version
ta: தற்போதைய பதிப்பு

# minVersion
source: Minimum Version
ta: குறைந்தபட்ச பதிப்பு

source: Latest Version
ta: அண்மைக் கால பதிப்பு
