Repository: 247i/TACETr
Catalog: உரை/தானி/ubuntu-desktop-translations-provision-common-*.po
Languages: ta

# accessibilityPageTitle
source: Accessibility
ta: அணுகல்

# accessibilityPageHeader
source: Accessibility in {DISTRO}
ta: {டிச்ட்ரோ on இல் அணுகல்

# accessibilityPageBody
source: Customise {DISTRO} to your needs before you set up. You can change them later in System Settings.
ta: நீங்கள் அமைப்பதற்கு முன் உங்கள் தேவைகளுக்கு தனிப்பயன் {டிச்ட்ரோ. கணினி அமைப்புகளில் அவற்றை பின்னர் மாற்றலாம்.

# accessibilitySeeingLabel
source: Seeing
ta: பார்ப்பது

# accessibilityHearingLabel
source: Hearing
ta: கேட்பு

# accessibilityTypingLabel
source: Typing
ta: தட்டச்சு

# accessibilityPointingLabel
source: Pointing and clicking
ta: சுட்டிக்காட்டுதல் மற்றும் சொடுக்கு செய்தல்

# accessibilityZoomLabel
source: Zoom
ta: பெரிதாக்கு

# accessibilityHighContrastLabel
source: High contrast
ta: உயர் வேறுபாடு

# accessibilityLargeTextLabel
source: Large text
ta: பெரிய உரை

# accessibilityReduceAnimationLabel
source: Reduce animation
ta: அனிமேசனைக் குறைக்கவும்

# accessibilityScreenReaderLabel
source: Screen reader
ta: திரை ரீடர்

# accessibilityVisualAlertsLabel
source: Visual alerts
ta: காட்சி எச்சரிக்கைகள்

# accessibilityStickKeysLabel
source: Sticky keys
ta: ஒட்டும் விசைகள்

# accessibilitySlowKeysLabel
source: Slow keys
ta: மெதுவான விசைகள்

# accessibilityMouseKeysLabel
source: Mouse keys
ta: சுட்டி விசைகள்

# accessibilityDesktopZoomLabel
source: Desktop zoom
ta: டெச்க்டாப் சூம்

# errorPageTitle
source: Something went wrong
ta: ஏதோ தவறு நடந்தது

# errorPageUnexpected
source: We're sorry, but we're not sure what the error is. You can try restarting your computer and start the installation process again. You can can also <a>report the issue</a>.
ta: மன்னிக்கவும், ஆனால் பிழை என்னவென்று எங்களுக்குத் தெரியவில்லை. உங்கள் கணினியை மறுதொடக்கம் செய்ய முயற்சி செய்யலாம் மற்றும் நிறுவல் செயல்முறையை மீண்டும் தொடங்கலாம். </a> பிரச்சினையை நீங்கள் புகாரளிக்கலாம்.

# errorPageUbuntuBug
source: To send an automated bug report including relevant debug information, please run <pre>sudo ubuntu-bug {SNAP}</pre> in a terminal, or from the command console (Alt+F2).
ta: தொடர்புடைய பிழைத்திருத்த செய்தி உட்பட தானியங்கி பிழை அறிக்கையை அனுப்ப, தயவுசெய்து <முன்> சுடோ உபுண்டு-பக் {SNAP} </pre> ஒரு முனையத்தில் அல்லது கட்டளை கன்சோலில் (ALT+F2) இயக்கவும்.

# errorPageShowLog
source: Show log
ta: பதிவைக் காட்டு

# errorPageHideLog
source: Hide log
ta: பதிவை மறைக்க

source: Restart
ta: மறுதொடக்கம்

source: Close
ta: மூடு

# timezonePageTitle
source: Select your timezone
ta: உங்கள் நேர மண்டலத்தைத் தேர்ந்தெடுக்கவும்

# timezoneLocationLabel
source: Location
ta: இடம்

# timezoneTimezoneLabel
source: Timezone
ta: நேர மண்டலம்

# keyboardTitle
source: Keyboard layout
ta: விசைப்பலகை அமைப்பு

# keyboardHeader
source: Select your keyboard layout
ta: உங்களின் விசைப்பலகை அமைப்பைத் தேர்வு செய்யவும்:

# keyboardTestHint
source: Type here to test your keyboard
ta: உங்கள் விசைப்பலகையை சோதிக்க இங்கு தட்டச்சு செய்யவும்

# keyboardDetectTitle
source: Detect keyboard layout
ta: விசைப்பலகையின் அமைப்பைக் கண்டறியவும்

# keyboardDetectButton
source: Detect
ta: கண்டறியவும்

# keyboardVariantLabel
source: Select your keyboard variant:
ta: உங்கள் விசைப்பலகை மாறுபாட்டைத் தேர்ந்தெடுக்கவும்:

# keyboardPressKeyLabel
source: Please press one of the following keys:
ta: பின்வரும் விசைகளில் ஒன்றை அழுத்துங்கள்:

# keyboardKeyPresentLabel
source: Is the following key present on your keyboard?
ta: பின்வரும் விசை உங்களுடைய தட்டச்சு பலகையில் இருக்கிறதா?

# themePageTitle
source: Choose your theme
ta: உங்கள் தோற்றத்தை தேர்வு செய்யவும்

# themePageHeader
source: You can always change this later in the appearance settings.
ta: தோற்ற அமைப்புகளில் இதை எப்போது வேண்டுமானாலும் மாற்றலாம்.

# themeDark
source: Dark
ta: கருமை

# themeLight
source: Light
ta: ஒளி

# localePageTitle
source: Welcome to {DISTRO}
ta: {டிச்ட்ரோ க்கு க்கு வருக

# localeHeader
source: Choose your language:
ta: உங்கள் மொழியைத் தேர்வுசெய்க:

# identityPageTitle
source: Create your account
ta: நீங்கள் யார்?

# identityAutoLogin
source: Log in automatically
ta: தானியங்கியாக உள்நுழையவும்

# identityRequirePassword
source: Require my password to log in
ta: உள்நுழைய எனது கடவுச்சொல் தேவை

# identityRealNameLabel
source: Your name
ta: உங்கள் பெயர்

# identityRealNameRequired
source: A name is required
ta: ஒரு பெயர் தேவை

# identityRealNameTooLong
source: That name is too long.
ta: அந்த பெயர் மிக நீளமானது.

# identityHostnameLabel
source: Your computer's name
ta: உங்கள் கணினியின் பெயர்

# identityHostnameInfo
source: The name it uses when it talks to other computers.
ta: மற்ற கணினிகளுடன் பேசும்போது அது பயன்படுத்தும் பெயர்.

# identityHostnameRequired
source: A computer name is required
ta: கணினி பெயர் தேவை

# identityHostnameTooLong
source: That computer name is too long.
ta: அந்த கணினி பெயர் மிக நீளமானது.

# identityInvalidHostname
source: The computer name is invalid
ta: கணினியின் பெயர் தவறானது

# identityUsernameLabel
source: Your username
ta: பயனர்பெயரை தேர்ந்தெடுங்கள்

# identityUsernameRequired
source: A username is required
ta: ஒரு பயனர்பெயர் தேவை

# identityInvalidUsername
source: The username is invalid
ta: பயனர்பெயர் தவறானது

# identityUsernameInUse
source: That user name already exists.
ta: அந்த பயனர் பெயர் ஏற்கனவே உள்ளது.

# identityUsernameSystemReserved
source: That name is reserved for system usage.
ta: கணினி பயன்பாட்டிற்காக அந்த பெயர் ஒதுக்கப்பட்டுள்ளது.

# identityUsernameTooLong
source: That name is too long.
ta: அந்த பெயர் மிக நீளமானது.

# identityUsernameInvalidChars
source: That name contains invalid characters.
ta: அந்த பெயரில் தவறான எழுத்துக்கள் உள்ளன.

# identityPasswordLabel
source: Password
ta: கடவுச்சொல்லை தேர்வு செய்யவும்

# identityPasswordRequired
source: A password is required
ta: கடவுச்சொல் தேவை

# identityConfirmPasswordLabel
source: Confirm password
ta: உங்கள் கடவுச்சொல்லை உறுதிப்படுத்தவும்

# identityPasswordMismatch
source: The passwords do not match
ta: கடவுச்சொற்கள் பொருந்தவில்லை

# identityPasswordShow
source: Show
ta: காட்டு

# identityPasswordHide
source: Hide
ta: மறை

# identityActiveDirectoryOption
source: Use Active Directory
ta: செயலில் உள்ள கோப்பகத்தைப் பயன்படுத்தவும்

# identityActiveDirectoryInfo
source: You'll enter domain and other details in the next step.
ta: அடுத்த கட்டத்தில் டொமைனையும் பிற விவரங்களையும் உள்ளிடுவீர்கள்.

# activeDirectoryTitle
source: Log into Active Directory
ta: செயலில் உள்ள கோப்பகத்தில் உள்நுழைக

# activeDirectoryHeader
source: Log into Active Directory?
ta: செயலில் உள்ள கோப்பகத்தில் உள்நுழைகவா?

# activeDirectoryInfo
source: {DISTRO} is designed to integrate seamlessly with Active Directory for easier administration.
ta: {DISTRO} எளிதான நிர்வாகத்திற்கான செயலில் உள்ள கோப்பகத்துடன் தடையின்றி ஒருங்கிணைக்க வடிவமைக்கப்பட்டுள்ளது.

# activeDirectoryTestConnection
source: Test domain connectivity
ta: டொமைன் இணைப்பை சோதிக்கவும்

# activeDirectoryDomainLabel
source: Domain
ta: டொமைன்

# activeDirectoryDomainEmpty
source: Required
ta: தேவை

# activeDirectoryDomainTooLong
source: Too long
ta: மிக நீண்ட

# activeDirectoryDomainInvalidChars
source: Invalid characters
ta: தவறான எழுத்துக்கள்

# activeDirectoryDomainStartDot
source: Starts with a dot (.)
ta: ஒரு புள்ளியுடன் தொடங்குகிறது (.)

# activeDirectoryDomainEndDot
source: Ends with a dot (.)
ta: ஒரு புள்ளியுடன் முடிவடைகிறது (.)

# activeDirectoryDomainStartHyphen
source: Starts with a hyphen (-)
ta: ஒரு ஐபனுடன் தொடங்குகிறது (-)

# activeDirectoryDomainEndHyphen
source: Ends with a hyphen (-)
ta: ஒரு ஐபனுடன் முடிவடைகிறது (-)

# activeDirectoryDomainMultipleDots
source: Contains multiple sequenced dots (..)
ta: பல வரிசைப்படுத்தப்பட்ட புள்ளிகள் உள்ளன (..)

# activeDirectoryDomainNotFound
source: Domain not found
ta: டொமைன் கிடைக்கவில்லை

# activeDirectoryAdminLabel
source: Domain join user
ta: டொமைன் பயனருடன் சேரவும்

# activeDirectoryAdminEmpty
source: Required
ta: தேவை

# activeDirectoryAdminInvalidChars
source: Invalid characters
ta: தவறான எழுத்துக்கள்

# activeDirectoryPasswordLabel
source: Password
ta: கடவுச்சொல்

# activeDirectoryPasswordEmpty
source: Required
ta: தேவை

# activeDirectoryErrorTitle
source: Error configuring connection to Active Directory
ta: செயலில் உள்ள கோப்பகத்திற்கான இணைப்பை உள்ளமைப்பதில் பிழை

# activeDirectoryErrorMessage
source: Sorry, Active Directory can't be set up at the moment. Once your system is up and running, visit <a href="https://help.ubuntu.com/activedirectory">help.ubuntu.com/activedirectory</a> for help.
ta: மன்னிக்கவும், செயலில் உள்ள கோப்பகத்தை இந்த நேரத்தில் அமைக்க முடியாது. உங்கள் கணினி முடிந்ததும், <a href = "https://help.ubuntu.com/actidedirectory"> உதவிக்கு உதவுகிறது.

# networkPageTitle
source: Internet connection
ta: இணைய இணைப்பு

# networkPageHeader
source: Connect to the internet
ta: இணையத்துடன் இணைக்கவும்

# networkPageBody
source: An internet connection will improve your installation with compatibility check and extra software packages.
ta: இணைய இணைப்பு உங்கள் நிறுவலை பொருந்தக்கூடிய சோதனை மற்றும் கூடுதல் மென்பொருள் தொகுப்புகளுடன் மேம்படுத்தும்.

# networkWiredOption
source: Use wired connection
ta: கம்பி இணைப்பைப் பயன்படுத்தவும்

# networkWiredNone
source: No wired connection detected
ta: கம்பி இணைப்பு எதுவும் கண்டறியப்படவில்லை

# networkWiredOff
source: Wired connection is turned off
ta: கம்பி இணைப்பு அணைக்கப்பட்டுள்ளது

# networkWiredDisabled
source: To use Ethernet on this computer, a wired connection must be enabled
ta: இந்த கணினியில் ஈதர்நெட்டைப் பயன்படுத்த, கம்பி இணைப்பு இயக்கப்பட வேண்டும்

# networkWiredEnable
source: Enable wired
ta: கம்பி இயக்கு

# networkWifiOption
source: Connect to a Wi-Fi network
ta: வைஃபை நெட்வொர்க்குடன் இணைக்கவும்

# networkWifiOff
source: Wireless networking disabled
ta: வயர்லெச் நெட்வொர்க்கிங் முடக்கப்பட்டது

# networkWifiNone
source: No Wi-Fi devices detected
ta: வைஃபை சாதனங்கள் எதுவும் கண்டறியப்படவில்லை

# networkWifiDisabled
source: To use Wi-Fi on this computer, wireless networking must be enabled
ta: இந்த கணினியில் வைஃபை பயன்படுத்த, வயர்லெச் நெட்வொர்க்கிங் இயக்கப்பட வேண்டும்

# networkWifiEnable
source: Enable Wi-Fi
ta: வைஃபை இயக்கவும்

# networkHiddenWifiOption
source: Connect to a hidden Wi-Fi network
ta: மறைக்கப்பட்ட வைஃபை நெட்வொர்க்குடன் இணைக்கவும்

# networkHiddenWifiNameLabel
source: Network name
ta: பிணைய பெயர்

# networkHiddenWifiNameRequired
source: A network name is required
ta: பிணைய பெயர் தேவை

# networkNoneOption
source: Do not connect to the internet
ta: இணையத்துடன் இணைக்க வேண்டாம்

# eulaPageTitle
source: License agreement
ta: உரிம ஒப்பந்தத்தின்

# eulaReviewTerms
source: Review the license terms
ta: உரிம விதிமுறைகளை மதிப்பாய்வு செய்யவும்

# eulaReadAndAcceptTerms
source: To continue setting up this machine, you must read and accept the license agreement terms.
ta: இந்த இயந்திரத்தை தொடர்ந்து அமைக்க, உரிம ஒப்பந்த விதிமுறைகளைப் படித்து ஏற்றுக்கொள்ள வேண்டும்.

# eulaAcceptTerms
source: I have read and accept these terms
ta: இந்த விதிமுறைகளைப் படித்து ஏற்றுக்கொண்டேன்
