Repository: 247i/TACETr
Catalog: உரை/தானி/ubuntu-desktop-translations-prompting-client-*.po
Languages: ta

# securityCenterInfo
source: You can always change these permissions in the <Security Center>
ta: இந்த அனுமதிகளை நீங்கள் எப்போதும் <பாதுகாப்பு மையம்> இல் மாற்றலாம்

# promptAccessMoreOptionsTitle
source: Set access for {snap} to:
ta: {snap} க்கு அணுகலை அமைக்கவும்:

# promptAccessTitle
source: Give {snap} {permission} access to:
ta: {snap} {permission} அணுகல் கொடுங்கள்:

# promptActionOptionAllow
source: Allow
ta: இசைவு

# promptActionOptionAllowAlways
source: Allow always
ta: எப்போதும் அனுமதிக்கவும்

# promptActionOptionAllowOnce
source: Allow once
ta: ஒரு முறை அனுமதிக்கவும்

# promptActionOptionDeny
source: Deny
ta: மறுக்கவும்

# promptActionOptionDenyOnce
source: Deny once
ta: ஒரு முறை மறுக்கவும்

# promptActionTitle
source: Action
ta: செயல்

# promptLifespanOptionForever
source: Always
ta: எப்போதும்

# promptLifespanOptionSession
source: Until logout
ta: வெளியேறும் வரை

# promptLifespanOptionSingle
source: Once
ta: ஒருமுறை

# promptLifespanTitle
source: Duration
ta: காலம்

# promptSaveAndContinue
source: Save and continue
ta: சேமித்து தொடரவும்

# promptTitle
source: Security notification
ta: பாதுகாப்பு அறிவிப்பு

# homePatternInfo
source: <Learn about path patterns>
ta: <பாதை வடிவங்களைப் பற்றி அறிந்து கொள்ளுங்கள்>

# homePatternTypeCustomPath
source: Custom path pattern
ta: தனிப்பயன் பாதை முறை

# homePatternTypeRequestedDirectory
source: The requested folder only
ta: கோரப்பட்ட கோப்புறை மட்டுமே

# homePatternTypeRequestedFile
source: The requested file only
ta: கோரப்பட்ட கோப்பு மட்டுமே

# homePatternTypeTopLevelDirectory
source: Everything in the {topLevelDir} folder
ta: {topLevelDir} கோப்புறையில் உள்ள அனைத்தும்

# homePatternTypeRequestedDirectoryContents
source: Everything in the folder
ta: கோப்புறையில் உள்ள அனைத்தும்

# homePatternTypeContainingDirectory
source: Everything in the folder
ta: கோப்புறையில் உள்ள அனைத்தும்

# homePatternTypeHomeDirectory
source: Everything in the Home folder
ta: வீட்டு கோப்புறையில் உள்ள அனைத்தும்

# homePatternTypeMatchingFileExtension
source: All {fileExtension} files
ta: அனைத்து {fileExtension} கோப்புகள்

# homePromptDefaultBody
source: {snap} wants to get {permissions} access to {path}
ta: {snap} {permissions} அணுகல் {பாதைக்கு அணுகல் விரும்புகிறது

# homePromptTopLevelDirBody
source: {snap} wants to get {permissions} access to the {foldername} folder.
ta: {snap} {permissions} அணுகல் {foldername} கோப்புறையைப் பெற விரும்புகிறது.

# homePromptTopLevelDirFileBody
source: {snap} wants to get {permissions} access to {filename} in the {foldername} folder.
ta: {snap} {permissions} க்கு {filename} அணுகல் {foldername} கோப்புறையில் பெற விரும்புகிறது.

# homePromptHomeDirBody
source: {snap} wants to get {permissions} access to your Home folder.
ta: {snap} உங்கள் வீட்டு கோப்புறையில் {permissions} அணுகலைப் பெற விரும்புகிறது.

# homePromptHomeDirFileBody
source: {snap} wants to get {permissions} access to {filename} in your Home folder.
ta: {snap} உங்கள் வீட்டுக் கோப்புறையில் {கோப்பு பெயருக்கு {permissions} அணுகலைப் பெற விரும்புகிறது.

# homePromptMetaDataTitle
source: About this app
ta: இந்த பயன்பாடு பற்றி

# homePromptMetaDataPublishedBy
source: Published by {publisher}
ta: {publisher} ஆல் வெளியிடப்பட்டது

# homePromptMetaDataLastUpdated
source: Last updated on {date}
ta: கடைசியாக {date} இல் புதுப்பிக்கப்பட்டது

# homePromptMoreOptionsLabel
source: More options...
ta: மேலும் விருப்பங்கள் ...

# homePromptMetaDataAppCenterLink
source: Visit App Center page
ta: பயன்பாட்டு மையப் பக்கத்தைப் பார்வையிடவும்

# homePromptSuggestedPermission
source: Also give {permission} access
ta: {permission} அணுகலையும் கொடுங்கள்

# homePromptPermissionsTitle
source: Permissions
ta: அனுமதிகள்

# homePromptPermissionsRead
source: Read
ta: படிக்க

# homePromptPermissionsWrite
source: Write
ta: எழுதுங்கள்

# homePromptPermissionsExecute
source: Execute
ta: செயல்படுத்தவும்

# homePromptErrorUnknownTitle
source: Something went wrong
ta: ஏதோ தவறு நடந்தது
