Repository: 247i/TACETr
Catalog: உரை/தானி/urlcheck-app-strings-*.po
Languages: ta

# mWebhook_error
source: Failed to send to webhook
ta: வெப்ஊக்கிற்கு அனுப்பத் தவறிவிட்டது

# mWebhook_templates
source: Templates
ta: வார்ப்புருக்கள்

# mWebhook_test
source: Test webhook
ta: வெப்ஊக்கை சோதிக்கவும்

# mDrawer_name
source: Drawer
ta: டிராயர்

# mDrawer_desc
source: All modules below this will be hidden in a drawer. The modules will still work, but will be hidden until you open the drawer. Here you can place modules you rarely use, to avoid clutter.
ta: இதற்கு கீழே உள்ள அனைத்து தொகுதிகளும் ஒரு அலமாரியில் மறைக்கப்படும். தொகுதிகள் இன்னும் வேலை செய்யும், ஆனால் நீங்கள் டிராயரைத் திறக்கும் வரை மறைக்கப்படும். ஒழுங்கீனத்தைத் தவிர்க்க, நீங்கள் அரிதாகவே பயன்படுத்தும் தொகுதிகளை இங்கே வைக்கலாம்.

# mChg_name
source: Changelog
ta: மாற்றபதிவு

# mChg_desc
source: Will notify when the app was updated.
ta: பயன்பாடு புதுப்பிக்கப்பட்டபோது அறிவிக்கும்.

# mChg_updated
source: The app has been updated.
ta: பயன்பாடு புதுப்பிக்கப்பட்டுள்ளது.

# mChg_current
source: Current version: %s
ta: தற்போதைய பதிப்பு: %s

# mChg_view
source: View changes
ta: மாற்றங்களைக் காண்க
