Repository: 247i/TACETr
Catalog: உரை/தானி/urlcheck-app-strings-*.po
Languages: ta

# translators
source: TrianguloY
ta: முக்கோண

# locale
source: English
ta: ஆங்கிலம்

# txt_info
source: This app acts as an intermediary when opening clicked URL links. A dialog with some info about the link is shown when choosing this app to open it. Press the module button below to check and configure all available modules.
ta: சொடுக்கு செய்யப்பட்ட முகவரி இணைப்புகளைத் திறக்கும்போது இந்த பயன்பாடு இடைத்தரகராக செயல்படுகிறது. இந்த பயன்பாட்டைத் திறக்கத் தேர்ந்தெடுக்கும்போது இணைப்பைப் பற்றிய சில தகவல்களைக் கொண்ட உரையாடல் காண்பிக்கப்படும். கிடைக்கக்கூடிய அனைத்து தொகுதிகளையும் சரிபார்க்கவும் உள்ளமைக்கவும் கீழே உள்ள தொகுதி பொத்தானை அழுத்தவும்.

# txt_sample
source: Press the link below to test it:
ta: அதைச் சோதிக்க கீழே உள்ள இணைப்பை அழுத்தவும்:

# a_modules
source: Modules
ta: தொகுதிகள்

# a_settings
source: Settings
ta: அமைப்புகள்

# a_about
source: About
ta: பற்றி

# txt_about
source: App created by TrianguloY. Contributions: %1$s. Translations: %2$s.
ta: முக்கோணத்தால் உருவாக்கப்பட்ட பயன்பாடு. பங்களிப்புகள்: %1$s. மொழிபெயர்ப்புகள்: %2$s.

# link_blog
source: TrianguloY's blog
ta: முக்கோணத்தின் வலைப்பதிவு

# link_changelog
source: Changelog
ta: மாற்றபதிவு

# link_source
source: Source code
ta: மூலக் குறியீடு

# link_privacy
source: Privacy policy
ta: தனியுரிமைக் கொள்கை

# txt_conf
source: Here are all the available modules, where you can check their description and settings. You can also reorder, toggle the title visibility and enable/disable them.
ta: கிடைக்கக்கூடிய அனைத்து தொகுதிகளும் இங்கே உள்ளன, அங்கு அவற்றின் விளக்கம் மற்றும் அமைப்புகளை நீங்கள் சரிபார்க்கலாம். நீங்கள் மறுவரிசைப்படுத்தலாம், தலைப்பு தெரிவுநிலையை மாற்றலாம் மற்றும் அவற்றை இயக்கலாம்/முடக்கலாம்.

# toast_cantEnable
source: Can't enable the module: %s
ta: தொகுதியை இயக்க முடியாது: %s

# menu_resetOrder
source: Reset order
ta: ஆர்டரை மீட்டமை

# menu_toggleDecorations
source: Toggle all titles
ta: எல்லா தலைப்புகளையும் மாற்றவும்

# desc_up
source: Move up
ta: மேலே செல்லுங்கள்

# desc_down
source: Move down
ta: கீழே செல்லுங்கள்

# desc_decorations
source: Show/hide title
ta: தலைப்பைக் காட்டு/மறைக்க

# desc_enable
source: Enable/disable module
ta: தொகுதியை இயக்கவும்/முடக்கவும்

# txt_openLinks
source: Open links on this app: Over the years Android has changed the way to configure it, and differs between versions. Find below all available settings for your device, if links are not being opened on this app try them all.
ta: இந்த பயன்பாட்டில் திறந்த இணைப்புகள்: பல ஆண்டுகளாக ஆண்ட்ராய்டு அதை உள்ளமைக்க வழியை மாற்றியுள்ளது, மேலும் பதிப்புகளுக்கு இடையில் வேறுபடுகிறது. இந்த பயன்பாட்டில் இணைப்புகள் திறக்கப்படாவிட்டால், உங்கள் சாதனத்திற்கான கிடைக்கக்கூடிய அனைத்து அமைப்புகளுக்கும் கீழே கண்டுபிடி, அவை அனைத்தையும் முயற்சிக்கவும்.

# btn_setBrowser
source: Set as default browser
ta: இயல்புநிலை உலாவியாக அமைக்கவும்

# toast_defaultSet
source: The app is now the default web browser
ta: பயன்பாடு இப்போது இயல்புநிலை வலை உலாவி

# btn_configureBrowser
source: Default web browser
ta: இயல்புநிலை வலை உலாவி

# btn_linksSettings
source: Open supported links
ta: உதவி இணைப்புகளைத் திறக்கவும்

# btn_androidSettings
source: Android app settings
ta: ஆண்ட்ராய்டு பயன்பாட்டு அமைப்புகள்

# txt_theme
source: Theme:
ta: தீம்:

# spin_darkTheme
source: Dark
ta: இருண்ட

# spin_lightTheme
source: Light
ta: ஒளி

# txt_width
source: Dialog width: Warning! Small values may hide screen elements.
ta: உரையாடல் அகலம்: எச்சரிக்கை! சிறிய மதிப்புகள் திரை கூறுகளை மறைக்கக்கூடும்.

# spin_fullWidth
source: Full
ta: முழு

# spin_dynamicWidth
source: Dynamic
ta: மாறும்

# txt_locale
source: Locale:
ta: இடம்:

# txt_animation
source: Enable animations
ta: அனிமேசன்களை இயக்கவும்

# txt_processText
source: Sync url with editable text (when the app is opened by long tapping text on an input textbox)
ta: திருத்தக்கூடிய உரையுடன் முகவரி ஐ ஒத்திசைக்கவும் (உள்ளீட்டு உரைப்பெட்டியில் நீண்ட தட்டுவதன் மூலம் பயன்பாடு திறக்கப்படும் போது)

# btn_tutorialSettings
source: Repeat tutorial
ta: டுடோரியலை மீண்டும் செய்யவும்

# btn_backupRestore
source: Backup / Restore
ta: காப்புப்பிரதி / மீட்டமை

# bck_mn_advanced
source: Show advanced options
ta: மேம்பட்ட விருப்பங்களைக் காட்டு

# btn_backup
source: Backup
ta: காப்புப்பிரதி

# btn_replace
source: Replace
ta: மாற்றவும்

# btn_restore
source: Restore
ta: மீட்டமை

# btn_delete
source: Delete
ta: நீக்கு

# bkp_description
source: Choose which elements to backup/restore. When restoring, if the backup was created without it, existing ones will be kept.
ta: காப்புப்பிரதி/மீட்டமைக்க எந்த கூறுகளைத் தேர்வுசெய்க. மீட்டமைக்கும்போது, ​​அது இல்லாமல் காப்புப்பிரதி உருவாக்கப்பட்டால், ஏற்கனவே உள்ளவை வைக்கப்படும்.

# bkp_data
source: Data: Standard application data. Things like enabled modules, json configurations, etc. Will not include secrets nor cache.
ta: தரவு: நிலையான பயன்பாட்டு தரவு. இயக்கப்பட்ட தொகுதிகள், சாதொபொகு உள்ளமைவுகள் போன்றவற்றில் ரகசியங்கள் அல்லது தற்காலிக சேமிப்பு இருக்காது.

# bkp_data_prefs
source: Preferences: Data saved as preferences.
ta: விருப்பத்தேர்வுகள்: தரவு விருப்பங்களாக சேமிக்கப்பட்டது.

# bkp_data_files
source: Files: Data saved as files.
ta: கோப்புகள்: தரவு கோப்புகளாக சேமிக்கப்பட்டது.

# bkp_secrets
source: Secrets: Data considered 'secret', like the VirusTotal api key or the log.
ta: ரகசியங்கள்: வைரச்டாட்டல் பநிஇ விசை அல்லது பதிவு போன்ற 'ரகசியமாக' கருதப்படும் தரவு.

# bjp_cache
source: Cache: Data that can be easily downloaded/generated, like the hosts database. Enabling this option may increase the backup size notably.
ta: கேச்: ஓச்ட்கள் தரவுத்தளத்தைப் போல எளிதாக பதிவிறக்கம் செய்ய/உருவாக்கக்கூடிய தரவு. இந்த விருப்பத்தை செயல்படுத்துவது காப்பு அளவை குறிப்பாக அதிகரிக்கக்கூடும்.

# bck_restoreDelete
source: Delete elements before restoring. Note that preferences and some files with default values may not exist, so disabling this option will merge the existing elements with the backup ones in unexpected ways. Disable if you know what you are doing.
ta: மீட்டமைப்பதற்கு முன் கூறுகளை நீக்கு. விருப்பத்தேர்வுகள் மற்றும் இயல்புநிலை மதிப்புகளைக் கொண்ட சில கோப்புகள் இருக்காது என்பதை நினைவில் கொள்க, எனவே இந்த விருப்பத்தை முடக்குவது ஏற்கனவே உள்ள கூறுகளை காப்பு மூலம் எதிர்பாராத வழிகளில் ஒன்றிணைக்கும். நீங்கள் என்ன செய்கிறீர்கள் என்று உங்களுக்குத் தெரிந்தால் முடக்கு.

# bck_ignoreNewer
source: Allow backups created from newer app versions.
ta: புதிய பயன்பாட்டு பதிப்புகளிலிருந்து உருவாக்கப்பட்ட காப்புப்பிரதிகளை அனுமதிக்கவும்.

# bck_newer
source: Canceled. The backup was created with a newer app version.
ta: ரத்து செய்யப்பட்டது. புதிய பயன்பாட்டு பதிப்பில் காப்புப்பிரதி உருவாக்கப்பட்டது.

# bck_chooseFile
source: Choose backup file
ta: காப்பு கோப்பைத் தேர்வுசெய்க

# bck_backupOk
source: Backup created
ta: காப்புப்பிரதி உருவாக்கப்பட்டது

# bck_backupError
source: Unable to create backup, try to choose a different location for the file.
ta: காப்புப்பிரதியை உருவாக்க முடியவில்லை, கோப்பிற்கு வேறு இடத்தைத் தேர்வு செய்ய முயற்சிக்கவும்.

# bck_restoreTitle
source: Restore backup
ta: காப்புப்பிரதியை மீட்டமைக்கவும்

# bck_restoreMessage
source: WARNING! This will replace the selected elements from the backup. Do you really want to continue?
ta: எச்சரிக்கை! இது தேர்ந்தெடுக்கப்பட்ட கூறுகளை காப்புப்பிரதியிலிருந்து மாற்றும். நீங்கள் உண்மையில் தொடர விரும்புகிறீர்களா?

# bck_restoreConfirm
source: Replace elements
ta: கூறுகளை மாற்றவும்

# bck_restoreOk
source: Backup restored
ta: காப்புப்பிரதி மீட்டெடுக்கப்பட்டது

# bck_restoreError
source: Unable to restore the backup. Is it a valid file?
ta: காப்புப்பிரதியை மீட்டெடுக்க முடியவில்லை. இது சரியான கோப்பா?

# bck_deleteTitle
source: Delete elements
ta: கூறுகளை நீக்கு

# bck_deleteMessage
source: WARNING! This will delete all the selected elements. Do you really want to continue?
ta: எச்சரிக்கை! இது தேர்ந்தெடுக்கப்பட்ட அனைத்து கூறுகளையும் நீக்கிவிடும். நீங்கள் உண்மையில் தொடர விரும்புகிறீர்களா?

# bck_deleteConfirm
source: Delete elements
ta: கூறுகளை நீக்கு

# bck_deleteOk
source: Elements deleted
ta: கூறுகள் நீக்கப்பட்டன

# bck_deleteError
source: Unable to delete elements
ta: கூறுகளை நீக்க முடியவில்லை

source: Tutorial
ta: பயிற்சி

# txt_tutorial1
source: Thanks for downloading the app! This is the tutorial, if you want to skip it you can do so with the button below. You can always come back to this tutorial from the settings menu.
ta: பயன்பாட்டைப் பதிவிறக்கியதற்கு நன்றி! இது டுடோரியல், நீங்கள் அதைத் தவிர்க்க விரும்பினால் கீழே உள்ள பொத்தானைக் கொண்டு அவ்வாறு செய்யலாம். அமைப்புகள் மெனுவிலிருந்து நீங்கள் எப்போதும் இந்த டுடோரியலுக்கு திரும்பி வரலாம்.

# txt_tutorial2
source: The app acts as an intermediary when opening or sharing url links. Once an url is sent to the app you can interact with it via the modules. After that you can open the link (in the app you want), share it or copy it to the clipboard.
ta: முகவரி இணைப்புகளைத் திறக்கும்போது அல்லது பகிரும்போது பயன்பாடு ஒரு இடைத்தரகராக செயல்படுகிறது. பயன்பாட்டிற்கு ஒரு முகவரி அனுப்பப்பட்டதும் நீங்கள் தொகுதிகள் வழியாக தொடர்பு கொள்ளலாம். அதன் பிறகு நீங்கள் இணைப்பைத் திறக்கலாம் (நீங்கள் விரும்பும் பயன்பாட்டில்), அதைப் பகிரவும் அல்லது கிளிப்போர்டில் நகலெடுக்கவும்.

# txt_tutorial3
source: Set the app as the default web browser to intercept URLs when opening them. (Not needed if URLs are redirected using the “Share” functionality.)
ta: பயன்பாட்டை இயல்புநிலை வலை உலாவியாக முகவரி களைத் திறக்கும்போது இடைமறிக்க அமைக்கவும். (“பங்கு” செயல்பாட்டைப் பயன்படுத்தி முகவரி கள் திருப்பி விடப்பட்டால் தேவையில்லை.)

# txt_tutorial4
source: Modules is how the app interacts with the URLs. Each of the modules has a specific function. Usually to present info about the URL, or allowing it to be modified. Read about them and set them up as needed. Important: All the actions are manual by default. The app won't modify anything nor connect to the Internet unless you specifically allow it, but some actions can be auto-applied if desired. Open the list of modules from the main screen, or by tapping the button below.
ta: பயன்பாடு முகவரி களுடன் எவ்வாறு தொடர்பு கொள்கிறது என்பது தொகுதிகள். ஒவ்வொரு தொகுதிகளும் ஒரு குறிப்பிட்ட செயல்பாட்டைக் கொண்டுள்ளன. வழக்கமாக முகவரி பற்றிய தகவல்களை முன்வைக்க, அல்லது அதை மாற்ற அனுமதிப்பது. அவற்றைப் பற்றி படித்து தேவைக்கேற்ப அவற்றை அமைக்கவும். முக்கியமானது: அனைத்து செயல்களும் இயல்புநிலையாக கையேடு. நீங்கள் குறிப்பாக அனுமதிக்காவிட்டால் பயன்பாடு எதையும் மாற்றியமைக்காது அல்லது இணையத்துடன் இணைக்காது, ஆனால் சில செயல்களை விரும்பினால் தானாகவே பயன்படுத்தலாம். முதன்மையான திரையில் இருந்து தொகுதிகளின் பட்டியலைத் திறக்கவும் அல்லது கீழே உள்ள பொத்தானைத் தட்டுவதன் மூலம்.

# txt_tutorial5
source: That's all. Here are some tips that can be useful: When an app doesn't give you a way to open or share a url, but it gives you a way to do the other you can solve the issue using this app. You can also copy the url to the clipboard by long pressing the share button. There are some urls which its only purpose is redirecting you to another url. If the final url can be opened in an app, then you can avoid opening it in a browser. Hope you find the app useful! And don't hesitate to suggest features, report bugs or even propose changes. Find all relevant links on the about screen.
ta: அவ்வளவுதான். பயனுள்ளதாக இருக்கும் சில குறிப்புகள் இங்கே: ஒரு பயன்பாடு உங்களுக்கு முகவரி ஐ திறக்க அல்லது பகிர ஒரு வழியை வழங்காதபோது, ​​ஆனால் இந்த பயன்பாட்டைப் பயன்படுத்தி சிக்கலைத் தீர்க்கக்கூடிய மற்றதைச் செய்ய இது ஒரு வழியை வழங்குகிறது. பங்கு பொத்தானை நீண்ட நேரம் அழுத்துவதன் மூலம் நீங்கள் முகவரி ஐ கிளிப்போர்டில் நகலெடுக்கலாம். சில முகவரி கள் உள்ளன, அதன் ஒரே நோக்கம் உங்களை மற்றொரு முகவரி க்கு திருப்பி விடுகிறது. இறுதி முகவரி ஐ ஒரு பயன்பாட்டில் திறக்க முடிந்தால், அதை உலாவியில் திறப்பதைத் தவிர்க்கலாம். பயன்பாடு பயனுள்ளதாக இருக்கும் என்று நம்புகிறேன்! அம்சங்களை பரிந்துரைக்க, பிழைகள் புகாரளிக்க அல்லது மாற்றங்களை முன்மொழிய தயங்க வேண்டாம். பற்றி திரையில் தொடர்புடைய அனைத்து இணைப்புகளையும் கண்டறியவும்.

# btn_tutorialSkip
source: Skip tutorial
ta: டுடோரியலைத் தவிர்க்கவும்

# btn_tutorialEnd
source: Finish tutorial
ta: டுடோரியலை முடிக்கவும்

# toast_noApp
source: Can not open the app
ta: பயன்பாட்டைத் திறக்க முடியாது

# toast_noBrowser
source: Can not open the web browser
ta: வலை உலாவியைத் திறக்க முடியாது

# title_choose
source: Choose app
ta: பயன்பாட்டைத் தேர்வுசெய்க

source: Invalid
ta: செல்லுபடியாகாத

source: Save
ta: சேமி

source: Reset
ta: மீட்டமை

source: Close
ta: மூடு

source: Clear
ta: தெளிவான

source: None
ta: எதுவுமில்லை

# auto
source: Automatic
ta: தானியங்கி

# defaultOn
source: Enabled by default
ta: இயல்பாக இயக்கப்பட்டது

# defaultOff
source: Disabled by default
ta: இயல்பாக முடக்கப்பட்டுள்ளது

source: Always on
ta: எப்போதும் இயக்கவும்

source: Always off
ta: எப்போதும் அணைக்கவும்

source: Hidden
ta: மறைக்கப்பட்ட

source: Share
ta: பங்கு

source: Canceled
ta: ரத்து செய்யப்பட்டது

source: Device default
ta: சாதன இயல்புநிலை

source: Next
ta: அடுத்தது

source: Back
ta: பின்

source: Dismiss
ta: தள்ளுபடி

# noLinks
source: No links detected
ta: இணைப்புகள் எதுவும் கண்டறியப்படவில்லை

source: Small
ta: சிறிய

source: Normal
ta: சாதாரண

source: Big
ta: பெரியது

source: Format
ta: வடிவம்

source: Discard
ta: நிராகரிக்கவும்

source: Json editor
ta: சாதொபொகு ஆசிரியர்

# json_info
source: Show info
ta: தகவலைக் காட்டு

# json_ignore
source: The content is not valid Json. Do you want to discard it and close the editor?
ta: உள்ளடக்கம் செல்லுபடியாகும் சாதொபொகு அல்ல. நீங்கள் அதை நிராகரித்து எடிட்டரை மூட விரும்புகிறீர்களா?

# json_discard_close
source: Discard and close
ta: நிராகரித்து மூடு

# json_save
source: There are unsaved changes, do you want to save or discard them?
ta: சேமிக்கப்படாத மாற்றங்கள் உள்ளன, அவற்றை சேமிக்க அல்லது நிராகரிக்க விரும்புகிறீர்களா?

# json_save_error
source: Unable to save: %s
ta: சேமிக்க முடியவில்லை: %s

# json_format_error
source: The content is not valid Json, can't be parsed.
ta: உள்ளடக்கம் செல்லுபடியாகும் சாதொபொகு அல்ல, பாகுபடுத்த முடியாது.

# json_discard
source: Warning, this will replace the editor content with the saved json. All changes made will be lost. Do you want to continue?
ta: எச்சரிக்கை, இது எடிட்டர் உள்ளடக்கத்தை சேமித்த சாதொபொகு உடன் மாற்றும். செய்யப்பட்ட அனைத்து மாற்றங்களும் இழக்கப்படும். நீங்கள் தொடர விரும்புகிறீர்களா?

# json_reset
source: Warning, this will replace the editor content with the built-in json. All editor changes made will be lost, but saved content will not be modified unless manually saved. Do you want to continue?
ta: எச்சரிக்கை, இது ஆசிரியர் உள்ளடக்கத்தை உள்ளமைக்கப்பட்ட சாதொபொகு உடன் மாற்றும். செய்யப்பட்ட அனைத்து எடிட்டர் மாற்றங்களும் இழக்கப்படும், ஆனால் கைமுறையாக சேமிக்கப்படாவிட்டால் சேமிக்கப்பட்ட உள்ளடக்கம் மாற்றப்படாது. நீங்கள் தொடர விரும்புகிறீர்களா?

# shortcut_checkClipboard
source: Check URLs from the clipboard
ta: கிளிப்போர்டிலிருந்து முகவரி களை சரிபார்க்கவும்

# a_automations
source: Automations
ta: ஆட்டோமேசன்ச்

# auto_desc
source: With automations you can perform module actions based on triggers. You can configure the automations here, or disable all them together using the toggle below.
ta: ஆட்டோமேசன் மூலம் நீங்கள் தூண்டுதல்களின் அடிப்படையில் தொகுதி செயல்களைச் செய்யலாம். நீங்கள் இங்கே ஆட்டோமேசனை உள்ளமைக்கலாம் அல்லது கீழே உள்ள மாற்று ஐப் பயன்படுத்தி அனைத்தையும் ஒன்றாக முடக்கலாம்.

# auto_enabled
source: Enable automations feature
ta: ஆட்டோமேசன் அம்சத்தை இயக்கவும்

# auto_error_toast
source: Show toast if automation fails
ta: ஆட்டோமேசன் தோல்வியுற்றால் சிற்றுண்டியைக் காட்டு

# auto_notFound
source: No automation with key '%s' is available. Make sure it is valid and the required module is active.
ta: முக்கிய '%s' உடன் ஆட்டோமேசன் எதுவும் கிடைக்கவில்லை. இது செல்லுபடியாகும் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் மற்றும் தேவையான தொகுதி செயலில் உள்ளது.

# auto_editor
source: Automations configuration. Format: list of objects where the key is a unique automation name and the content includes the following values: - 'regex': string|list: a valid java regex that the url must match for the automation to run. If list, at least one regex must match. If omitted, all urls will match. - 'referrer': string, optional: if present, the referrer (the app that opened the link) must exactly match this value. You can use the debug module to check the actual value. - 'action': string|list, required: the key of the automation to run. If multiple they will run in order. Check below for a list of all the available keys. - 'stop': boolean: if true, no more automations will run for the current url. False by default. - 'enabled': boolean, optional: if false this automation will be skipped. True by default.
ta: ஆட்டோமேசன் உள்ளமைவு. வடிவம்: விசை ஒரு தனித்துவமான ஆட்டோமேசன் பெயர் மற்றும் உள்ளடக்கம் பின்வரும் மதிப்புகளை உள்ளடக்கிய பொருள்களின் பட்டியல்: . பட்டியல் என்றால், குறைந்தது ஒரு ரீசெக்ச் பொருந்த வேண்டும். விடுபட்டால், அனைத்து முகவரி களும் பொருந்தும். . உண்மையான மதிப்பைச் சரிபார்க்க பிழைத்திருத்த தொகுதியைப் பயன்படுத்தலாம். - 'செயல்': சரம் | பட்டியல், தேவை: இயக்க ஆட்டோமேசனின் விசை. பல இருந்தால் அவை வரிசையில் இயங்கும். கிடைக்கக்கூடிய அனைத்து விசைகளின் பட்டியலுக்கு கீழே சரிபார்க்கவும். - 'நிறுத்து': பூலியன்: உண்மையாக இருந்தால், தற்போதைய முகவரி க்கு ஆட்டோமேசன்கள் எதுவும் இயங்காது. இயல்புநிலையாக பொய். - 'இயக்கப்பட்டது': பூலியன், விரும்பினால்: பொய்யானால் இந்த ஆட்டோமேசன் தவிர்க்கப்படும். இயல்புநிலையாக உண்மை.

# auto_available_prefix
source: Available automation actions (keys):
ta: கிடைக்கும் ஆட்டோமேசன் செயல்கள் (விசைகள்):

# auto_available_disabled
source: This module is disabled, automations won't run
ta: இந்த தொகுதி முடக்கப்பட்டுள்ளது, ஆட்டோமேசன்ச் இயங்காது

# auto_rule_webhook
source: Send everything to webhook
ta: எல்லாவற்றையும் வெப்ஊக்கிற்கு அனுப்புங்கள்

# auto_open
source: Will open the url with the first available app. Equivalent of pressing the 'open' button.
ta: கிடைக்கக்கூடிய முதல் பயன்பாட்டுடன் முகவரி ஐ திறக்கும். 'திறந்த' பொத்தானை அழுத்துவதற்கு சமம்.

# auto_share
source: Will share the url. Equivalent of pressing the 'share' button.
ta: முகவரி ஐப் பகிர்ந்து கொள்ளும். 'பகிர்' பொத்தானை அழுத்துவதற்கு சமம்.

# auto_copy
source: Will copy the url. Equivalent of pressing the 'copy' button.
ta: முகவரி ஐ நகலெடுக்கும். 'நகல்' பொத்தானை அழுத்துவதற்கு சமம்.

# auto_ctabs
source: Will enable ctabs. Equivalent of pressing the 'ctabs' button if disabled (even if hidden).
ta: CTAB களை இயக்கும். முடக்கப்பட்டால் 'CTABS' பொத்தானை அழுத்துவதற்கு சமம் (மறைக்கப்பட்டிருந்தாலும் கூட).

# auto_incognito
source: Will enable incognito. Equivalent of pressing the 'incognito' button if disabled (even if hidden).
ta: மறைமுகத்தை இயக்கும். முடக்கப்பட்டால் 'மறைநிலை' பொத்தானை அழுத்துவதற்கு சமம் (மறைக்கப்பட்டிருந்தாலும் கூட).

# auto_close
source: Will close the application, doing nothing else.
ta: பயன்பாட்டை மூடும், வேறு எதுவும் செய்யாது.

# auto_checkStatus
source: Will run the status check. Equivalent of pressing the 'Check' button.
ta: நிலை சோதனை இயங்கும். 'செக்' பொத்தானை அழுத்துவதற்கு சமம்.

# auto_unshort
source: Will run the unshort process. Equivalent of pressing the 'Unshort' button.
ta: அன்சார்ட் செயல்முறையை இயக்கும். 'அன்சார்ட்' பொத்தானை அழுத்துவதற்கு சமம்.

# auto_scan
source: Will scan the url. Equivalent of pressing the 'Scan' button.
ta: முகவரி ஐ ச்கேன் செய்யும். 'ச்கேன்' பொத்தானை அழுத்துவதற்கு சமம்.

# auto_clear
source: Will clear the url. Equivalent of pressing the 'Clear' button. Note that the module itself contains an auto setting that will also clear all urls more efficiently, and should be preferred.
ta: முகவரி ஐ அழிக்கும். 'தெளிவான' பொத்தானை அழுத்துவதற்கு சமம். தொகுதியில் ஒரு ஆட்டோ அமைப்பு உள்ளது என்பதை நினைவில் கொள்க, இது அனைத்து முகவரி களையும் மிகவும் திறமையாக அழிக்கும், மேலும் அது விரும்பப்பட வேண்டும்.

# auto_drawer
source: Will open the drawer. Equivalent of pressing the drawer button if collapsed.
ta: டிராயரைத் திறக்கும். சரிந்தால் டிராயர் பொத்தானை அழுத்துவதற்கு சமம்.

# mPttrn_name
source: Pattern checker
ta: முறை சரிபார்ப்பு

# mPttrn_desc
source: This module checks the url with regex patterns that warns, suggests or applies replacements. You can modify or create your own patterns, or even use user-created ones. Built-in patterns include: - Warning when contains non-ascii characters like greek letters. This can be used for phishing: googĺe.com vs google.com - Suggest replacing 'http' with 'https' - Suggest replacing Youtube, Reddit or Twitter with privacy-friendly alternatives [disabled by default]
ta: இந்த தொகுதி முகவரி ஐ ரீசெக்ச் வடிவங்களுடன் சரிபார்க்கிறது, இது மாற்றீடுகளை எச்சரிக்கிறது, பரிந்துரைக்கிறது அல்லது பயன்படுத்துகிறது. நீங்கள் உங்கள் சொந்த வடிவங்களை மாற்றலாம் அல்லது உருவாக்கலாம் அல்லது பயனர் உருவாக்கியவற்றைப் பயன்படுத்தலாம். உள்ளமைக்கப்பட்ட வடிவங்கள் பின்வருமாறு: - கிரேக்க எழுத்துக்கள் போன்ற ASCII அல்லாத எழுத்துக்கள் இருக்கும்போது எச்சரிக்கை. ஃபிசிங் செய்ய இதைப் பயன்படுத்தலாம்: Googĺe.com vs Google.com - 'http' ஐ 'https' உடன் மாற்ற பரிந்துரைக்கவும் - யூடியூப், ரெடிட் அல்லது ட்விட்டரை தனியுரிமை நட்பு மாற்றுகளுடன் மாற்ற பரிந்துரைக்கவும் [இயல்புநிலையாக முடக்கப்பட்டுள்ளது]

# mPttrn_regexfix
source: Fix optional regex groups (disable if regex is not working correctly)
ta: விருப்ப ரீசெக்ச் குழுக்களை சரிசெய்யவும் (ரீசெக்ச் சரியாக வேலை செய்யவில்லை என்றால் முடக்கு)

# mPttrn_userContent
source: List of other useful user-created patterns: %s
ta: பிற பயனுள்ள பயனர் உருவாக்கிய வடிவங்களின் பட்டியல்: %s

# mPttrn_fix
source: Apply
ta: இடு

# mPttrn_fixed
source: Applied - %s
ta: பயன்பாடு - %s

# mPttrn_ascii
source: Warning! Non-ASCII characters found.
ta: எச்சரிக்கை! அசி அல்லாத எழுத்துக்கள் காணப்பட்டன.

# mPttrn_upperDomain
source: Warning! Upper case letter in domain.
ta: எச்சரிக்கை! டொமைனில் மேல் வழக்கு கடிதம்.

# mPttrn_http
source: HTTP link. Consider using HTTPS.
ta: HTTP இணைப்பு. HTTPS ஐப் பயன்படுத்துவதைக் கவனியுங்கள்.

# mPttrn_noSchemeHttp
source: Missing HTTP scheme.
ta: HTTP திட்டத்தைக் காணவில்லை.

# mPttrn_noSchemeHttps
source: Missing HTTPS scheme.
ta: HTTPS திட்டத்தைக் காணவில்லை.

# mPttrn_wrongSchemaHttp
source: Invalid http scheme capitalization.
ta: தவறான HTTP திட்ட மூலதனம்.

# mPttrn_wrongSchemaHttps
source: Invalid https scheme capitalization.
ta: தவறான HTTPS திட்ட மூலதனம்.

# mPttrn_ok
source: No matching patterns
ta: பொருந்தக்கூடிய வடிவங்கள் இல்லை

# mPttrn_editor
source: Here you can edit or add new pattern. Format: - 'encode': boolean: set to true to encode the url before checking regex. - 'regex': string: a valid java regex that the url must match, otherwise the pattern is skipped. If omitted, the full url will match. - 'excludeRegex': string: if provided, a valid java regex that the url must not match, otherwise the pattern is skipped. - 'replacement': string|list: if provided, the 'fix' button will run 'url=url.replaceAll(regex,replacement)'. If list, replacement will be a random element from it. - 'decode': boolean: set to true to decode the replaced url. - 'automatic': boolean: set to true to automatically apply the pattern. - 'enabled': boolean: set to false to disable the pattern. Note: if you edit the patterns, new built-in patterns from app updates will not be added automatically (you can restore them with the reset option).
ta: இங்கே நீங்கள் புதிய வடிவத்தைத் திருத்தலாம் அல்லது சேர்க்கலாம். வடிவம்: - 'குறியாக்கம்': பூலியன்: ரீசெக்சை சரிபார்க்கும் முன் முகவரி ஐ குறியாக்க உண்மைக்கு அமைக்கவும். - 'ரீசெக்ச்': சரம்: முகவரி பொருந்த வேண்டிய செல்லுபடியாகும் சாவா ரீசெக்ச், இல்லையெனில் முறை தவிர்க்கப்படுகிறது. விடுபட்டால், முழு முகவரி பொருந்தும். . - 'மாற்றீடு': சரம் | பட்டியல்: வழங்கப்பட்டால், 'சரி' பொத்தான் 'முகவரி. பட்டியல் என்றால், மாற்றீடு அதிலிருந்து ஒரு சீரற்ற உறுப்பு ஆகும். - 'டிகோட்': பூலியன்: மாற்றப்பட்ட முகவரி ஐ டிகோட் செய்ய உண்மையாக அமைக்கவும். - 'தானியங்கி': பூலியன்: வடிவத்தை தானாகவே பயன்படுத்துவதற்கு உண்மையாக அமைக்கவும். - 'இயக்கப்பட்டது': பூலியன்: வடிவத்தை முடக்க பொய்யாக அமைக்கவும். குறிப்பு: நீங்கள் வடிவங்களைத் திருத்தினால், பயன்பாட்டு புதுப்பிப்புகளிலிருந்து புதிய உள்ளமைக்கப்பட்ட வடிவங்கள் தானாகவே சேர்க்கப்படாது (மீட்டமை விருப்பத்துடன் அவற்றை மீட்டெடுக்கலாம்).

# mOpen_name
source: Open and share
ta: திறந்து பகிரவும்
