Repository: 247i/TACETr
Catalog: உரை/தானி/urlcheck-app-strings-*.po
Languages: ta

# mOpen_desc
source: Contains the following buttons (left to right): - Custom Tabs button: toggle to enable/disable the custom tab feature. When enabled, the browser should be opened in a 'lite' mode. - Incognito button: For Firefox only. Toggle to enable/disable the incognito mode. When enabled, the browser should be opened in incognito. - Open button: Press the app name to open the link on that app. If a link can be opened with multiple apps, an arrow will be shown to let you choose. - Copy button: Press the button to copy the link into the clipboard. - Share button: Press the button to share the link.
ta: பின்வரும் பொத்தான்கள் உள்ளன (இடமிருந்து வலமாக): - தனிப்பயன் தாவல்கள் பொத்தான்: தனிப்பயன் தாவல் அம்சத்தை இயக்க/முடக்க மாற்று. இயக்கப்பட்டால், உலாவி ஒரு 'லைட்' பயன்முறையில் திறக்கப்பட வேண்டும். - மறைநிலை பொத்தான்: பயர்பாக்சுக்கு மட்டும். மறைநிலை பயன்முறையை இயக்க/முடக்க மாற்று. இயக்கப்பட்டால், உலாவி மறைநிலையில் திறக்கப்பட வேண்டும். - திறக்க பொத்தானை: அந்த பயன்பாட்டில் இணைப்பைத் திறக்க பயன்பாட்டு பெயரை அழுத்தவும். பல பயன்பாடுகளுடன் ஒரு இணைப்பைத் திறக்க முடிந்தால், நீங்கள் தேர்வு செய்ய அனுமதிக்க ஒரு அம்பு காண்பிக்கப்படும். - நகல் பொத்தானை: கிளிப்போர்டில் இணைப்பை நகலெடுக்க பொத்தானை அழுத்தவும். - பகிர்வு பொத்தான்: இணைப்பைப் பகிர பொத்தானை அழுத்தவும்.

# mOpen_ctabs
source: Custom tabs:
ta: தனிப்பயன் தாவல்கள்:

# mOpen_incognito
source: Incognito mode:
ta: மறைநிலை பயன்முறை:

# mOpen_closeOpen
source: Close dialog after opening
ta: திறந்த பிறகு உரையாடலை மூடு

# mOpen_closeShare
source: Close dialog after sharing
ta: பகிர்வுக்குப் பிறகு உரையாடலை மூடு

# mOpen_closeCopy
source: Close dialog after copying
ta: நகலெடுத்த பிறகு உரையாடலை மூடு

# mOpen_perDomain
source: Sort different domains independently
ta: வெவ்வேறு களங்களை சுயாதீனமாக வரிசைப்படுத்துங்கள்

# mOpen_noReferrer
source: Hide the source app (referrer)
ta: மூல பயன்பாட்டை மறைக்கவும் (குறிப்பு)

# mOpen_rejected
source: Hide app if URL was rejected (an app immediately requests to open the same URL it was opened with). Doesn't affect sharing.
ta: பயன்பாட்டை மறைக்க முகவரி நிராகரிக்கப்பட்டால் (ஒரு பயன்பாடு உடனடியாக திறக்கப்பட்ட அதே முகவரி ஐ திறக்குமாறு கோருகிறது). பகிர்வை பாதிக்காது.

# mOpen_mergeCopy
source: Merge Copy and Share buttons (long press to copy)
ta: நகல் மற்றும் பகிர பொத்தான்களை ஒன்றிணைக்கவும் (நகலெடுக்க நீண்ட அழுத்தவும்)

# mOpen_iconSize
source: Icon size
ta: படவுரு அளவு

# mOpen_with
source: Open with %s
ta: %s உடன் திறந்திருக்கும்

# mOpen_open
source: Open
ta: திற

# mOpen_share
source: Share
ta: பங்கு

# mOpen_copyUrl
source: Copy
ta: நகலெடு

# mOpen_clipboard
source: URL copied to clipboard
ta: முகவரி இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது

# mOpen_noapps
source: No apps
ta: பயன்பாடுகள் இல்லை

# mOpen_tabsDesc
source: Toggle Custom Tabs feature
ta: தனிப்பயன் தாவல்கள் அம்சத்தை மாற்றவும்

# mOpen_incognitoDesc
source: Toggle incognito mode (for Firefox only)
ta: மறைநிலை பயன்முறையை மாற்றவும் (பயர்பாக்சுக்கு மட்டும்)

# mStatus_name
source: Status code
ta: நிலை குறியீடு

# mStatus_desc
source: By pressing the check button, a network request will be made to retrieve and display the site status code. If the result is a redirection, you will be able to view the destination URL. The URL content is obtained (GET), but not evaluated, so redirections based on JavaScript won't be detected.
ta: காசோலை பொத்தானை அழுத்துவதன் மூலம், தள நிலை குறியீட்டை மீட்டெடுக்கவும் காண்பிக்கவும் பிணைய கோரிக்கை செய்யப்படும். இதன் விளைவாக ஒரு திருப்பிவிடுதலாக இருந்தால், நீங்கள் இலக்கு முகவரி ஐக் காண முடியும். முகவரி உள்ளடக்கம் பெறப்படுகிறது (GET), ஆனால் மதிப்பீடு செய்யப்படவில்லை, எனவே சாவாச்கிரிப்டை அடிப்படையாகக் கொண்ட திருப்பிவிடங்கள் கண்டறியப்படாது.

# mStatus_ioerror
source: Network error while trying to check the URL: %s
ta: முகவரி ஐ சரிபார்க்க முயற்சிக்கும்போது பிணைய பிழை: %s

# mStatus_error
source: Internal error while trying to check the URL: %s
ta: முகவரி ஐ சரிபார்க்க முயற்சிக்கும்போது உள் பிழை: %s

# mStatus_check
source: Check status
ta: நிலையை சரிபார்க்கவும்

# mStatus_recheck
source: Check
ta: சரிபார்

# mStatus_checking
source: Checking…
ta: சோதனை…

# mStatus_unknownCode
source: %d: Unknown status code
ta: %d: அறியப்படாத நிலைக் குறியீடு

# mStatus_redir
source: Redirects to %s
ta: %s க்கு திருப்பிவிடுகிறது

# mStatus_autoRedirect
source: Automatically replace redirection URLs
ta: திருப்பிவிடுதல் முகவரி களை தானாக மாற்றவும்

# mInput_name
source: Input text
ta: உள்ளீட்டு உரை

# mInput_desc
source: Displays the current URL. Press it to enter edit mode.
ta: தற்போதைய முகவரி ஐக் காட்டுகிறது. திருத்து பயன்முறையை உள்ளிட அதை அழுத்தவும்.

# mVT_name
source: URL Scanner
ta: முகவரி ச்கேனர்

# mVT_desc
source: When this module is enabled you can scan the URL using VirusTotal and check the report. A personal VirusTotal API key is needed for it to work, you can get one after registering for a free account here: https://www.virustotal.com/gui/join-us .
ta: இந்த தொகுதி இயக்கப்பட்டால், நீங்கள் முகவரி ஐ வைரச்டோட்டலைப் பயன்படுத்தி ச்கேன் செய்து அறிக்கையைச் சரிபார்க்கலாம். இது வேலை செய்ய தனிப்பட்ட வைரச்டோட்டல் பநிஇ விசை தேவை, இலவச கணக்கிற்கு பதிவுசெய்த பிறகு நீங்கள் ஒன்றைப் பெறலாம்: https://www.virustotal.com/gui/join-us.

# mVT_apiKey
source: API key
ta: பநிஇ விசை

# mVT_noKey
source: Missing API key
ta: பநிஇ விசையை காணவில்லை

# mVT_tm
source: VirusTotal™ is a trademark of Google, Inc.
ta: வைரச்டோட்டல் ™ என்பது கூகிள், இன்க்.

# mVT_scan
source: Scan
ta: ச்கேன்

# mVT_cancel
source: Cancel
ta: ரத்துசெய்

# mVT_scanning
source: Scanning…
ta: ச்கேனிங்…

# mVT_goodUrl
source: None of the %1$d engines detected the URL (as of date %2$s)
ta: %1$d என்சின்கள் எதுவும் முகவரி ஐ கண்டறியவில்லை (தேதி %2$s வரை)

# mVT_warningUrl
source: Warning, %1$d/%2$d engines detected the URL (as of date %3$s)
ta: எச்சரிக்கை, %1$d/ %2$d என்சின்கள் முகவரி ஐக் கண்டறிந்தன (தேதி %3$s இன் படி)

# mVT_badUrl
source: Careful! %1$d/%2$d engines detected the URL (as of date %3$s)
ta: கவனமாக! %1$d/ %2$d என்சின்கள் முகவரி ஐக் கண்டறிந்தன (தேதி %3$s இன் படி)

# mVT_connectError
source: Can not connect to VirusTotal. Ensure you are connected to the Internet, or try again later.
ta: வைரச்டோட்டலுடன் இணைக்க முடியாது. நீங்கள் இணையத்துடன் இணைக்கப்பட்டுள்ளீர்கள் என்பதை உறுதிப்படுத்தவும், அல்லது பின்னர் மீண்டும் முயற்சிக்கவும்.

# mVT_jsonError
source: Can not connect to VirusTotal. Ensure the API key is valid, or try again later.
ta: வைரச்டோட்டலுடன் இணைக்க முடியாது. பநிஇ விசை செல்லுபடியாகும் என்பதை உறுதிப்படுத்தவும், அல்லது பின்னர் மீண்டும் முயற்சிக்கவும்.

# mD_name
source: Debug/Marker module
ta: பிழைத்திருத்த/மார்க்கர் தொகுதி

# mD_desc
source: If you reorder the modules, new ones added in future updates will be placed above this one. If you enable this it will display some internal debug data (like original intent uri), useful for developers. You can hold to select text.
ta: நீங்கள் தொகுதிகளை மறுவரிசைப்படுத்தினால், எதிர்கால புதுப்பிப்புகளில் சேர்க்கப்பட்ட புதியவை இதற்கு மேலே வைக்கப்படும். இதை நீங்கள் இயக்கினால், இது டெவலப்பர்களுக்கு பயனுள்ள சில உள் பிழைத்திருத்த தரவைக் காண்பிக்கும் (அசல் நோக்கம் யூரி போன்றவை). உரையைத் தேர்ந்தெடுக்க நீங்கள் வைத்திருக்கலாம்.

# mD_ctabs
source: Show debug messages from the custom tabs service
ta: தனிப்பயன் தாவல்கள் சேவையிலிருந்து பிழைத்திருத்த செய்திகளைக் காட்டு

# mD_show
source: Load debug data
ta: பிழைத்திருத்த தரவை ஏற்றவும்

# mHist_name
source: History
ta: வரலாறு

# mHist_desc
source: When the URL is edited, either manually or by other modules, this one allows you to view and revert changes.
ta: முகவரி ஐ திருத்தும்போது, ​​கைமுறையாக அல்லது பிற தொகுதிகள் மூலமாக, மாற்றங்களைக் காணவும் மாற்றவும் இது உங்களை அனுமதிக்கிறது.

# mClear_name
source: URL Cleaner
ta: முகவரி கிளீனர்

# mClear_desc
source: This module removes tracking, referrer and other useless parameters from the URL. It also allows for common offline URL redirections.
ta: இந்த தொகுதி முகவரி இலிருந்து கண்காணிப்பு, பரிந்துரைப்பவர் மற்றும் பிற பயனற்ற அளவுருக்களை நீக்குகிறது. இது பொதுவான இணைப்பில்லாத முகவரி திசைதிருப்பல்களையும் அனுமதிக்கிறது.

# mClear_tm
source: Built-in catalog copied from ClearURLs: https://docs.clearurls.xyz/latest/specs/rules/
ta: க்ளியர்யூர்ல்களிலிருந்து நகலெடுக்கப்பட்ட உள்ளமைக்கப்பட்ட பட்டியல்: https://docs.clearurls.xyz/latest/specs/rules/

# mClear_clear
source: Apply
ta: இடு

# mClear_matches
source: Matches %s
ta: பொருந்துகிறது %s

# mClear_blocked
source: - BLOCKED!
ta: - தடுக்கப்பட்டது!

# mClear_exception
source: - ignored due to exception %s
ta: - விதிவிலக்கு %s காரணமாக புறக்கணிக்கப்படுகிறது

# mClear_rule
source: - useless parameter found
ta: - பயனற்ற அளவுரு காணப்படுகிறது

# mClear_rawRule
source: - useless content found
ta: - பயனற்ற உள்ளடக்கம் காணப்பட்டது

# mClear_referral
source: - referral found
ta: - பரிந்துரை காணப்பட்டது

# mClear_forcedRedirection
source: - forced redirection found
ta: - கட்டாய திசைதிருப்பல் காணப்பட்டது

# mClear_redirection
source: - redirection found
ta: - திசை திருப்புதல் கிடைத்தது

# mClear_cleared
source: - Cleared
ta: - அழிக்கப்பட்டது

# mClear_noRules
source: No matching rules
ta: பொருந்தக்கூடிய விதிகள் இல்லை

# mClear_auto
source: Auto-apply
ta: தானாகவே

# mClear_toggleReferral
source: Enable referral marketing (referral parameters won't be cleared)
ta: பரிந்துரை சந்தைப்படுத்தல் (பரிந்துரை அளவுருக்கள் அழிக்கப்படாது)

# mClear_toggleVerbose
source: Enable verbose info for the matching process
ta: பொருந்தும் செயல்முறைக்கு வாய்மொழி தகவலை இயக்கவும்

# mClear_error
source: Could not check rule
ta: விதியை சரிபார்க்க முடியவில்லை

# mClear_updater
source: Updater
ta: புதுப்பிப்பவர்

# mClear_sourceDesc
source: URL of the Json file catalog with the rules:
ta: விதிகளுடன் சாதொபொகு கோப்பு பட்டியலின் URL:

# mClear_urlHint
source: Catalog URL
ta: அட்டவணை முகவரி

# mClear_hashDesc
source: URL of the catalog hash file. If omitted, the download will not be checked to see if it was tampered/modified (not recommended)
ta: அட்டவணை ஆச் கோப்பின் முகவரி. விடுபட்டால், பதிவிறக்கம் அது சேதப்படுத்தப்பட்டதா/மாற்றியமைக்கப்பட்டதா என்று சரிபார்க்கப்படாது (பரிந்துரைக்கப்படவில்லை)

# mClear_hashHint
source: No hash check
ta: ஆச் காசோலை இல்லை

# mClear_updateNow
source: Update now
ta: இப்போது புதுப்பிக்கவும்

# mClear_autoUpdate
source: Update periodically
ta: அவ்வப்போது புதுப்பிக்கவும்

# mClear_lastCheck
source: Last check:
ta: கடைசி சோதனை:

# mClear_lastUpdate
source: Last update:
ta: கடைசி புதுப்பிப்பு:

# mClear_updated
source: Catalog updated
ta: பட்டியல் புதுப்பிக்கப்பட்டது

# mClear_upToDate
source: Catalog up to date
ta: புதுப்பித்த நிலையில் பட்டியலிடுங்கள்

# mClear_urlError
source: Unable to fetch the rules, make sure the URL is valid and you have an active connection
ta: விதிகளைப் பெற முடியவில்லை, முகவரி செல்லுபடியாகும் என்பதை உறுதிப்படுத்தவும், உங்களுக்கு செயலில் இணைப்பு உள்ளது

# mClear_hashError
source: Unable to fetch the hash, make sure the url is valid and you have an active connection
ta: ஆசைப் பெற முடியவில்லை, முகவரி செல்லுபடியாகும் என்பதை உறுதிப்படுத்தவும், உங்களுக்கு செயலில் இணைப்பு உள்ளது

# mClear_hashMismatch
source: Hashes do not match, the file may have been tampered with. If you want to skip the check remove the hash URL
ta: ஆச்கள் பொருந்தவில்லை, கோப்பு சேதப்படுத்தப்பட்டிருக்கலாம். நீங்கள் காசோலையைத் தவிர்க்க விரும்பினால் ஆச் முகவரி ஐ அகற்றவும்

# mClear_restore
source: Restore ClearURLs paths
ta: கிளியர்யூர்ல்ச் பாதைகளை மீட்டமை

# mClear_editor
source: Catalog rules: They must follow the format from https://docs.clearurls.xyz/latest/specs/rules/. Note that any modification to the parent object 'providers' will be overwritten if the catalog is updated automatically or manually from the updater dialog. To have personal rules set them in a different parent object (any name).
ta: பட்டியல் விதிகள்: அவை https://docs.clearurls.xyz/latest/specs/rules/ இலிருந்து வடிவமைப்பைப் பின்பற்ற வேண்டும். புதுப்பிப்பு உரையாடலில் இருந்து தானாகவோ அல்லது கைமுறையாகவோ பட்டியல் புதுப்பிக்கப்பட்டால், பெற்றோர் பொருள் 'வழங்குநர்கள்' மீறப்படுவது மேலெழுதப்படும் என்பதை நினைவில் கொள்க. தனிப்பட்ட விதிகள் இருக்க அவற்றை வேறு பெற்றோர் பொருளில் (எந்த பெயரும்) அமைக்கவும்.

# mRemove_name
source: Queries Remover
ta: வினவல்கள் நீக்கி

# mRemove_desc
source: [DEPRECATED] With this module you can remove queries from the URL. Press the button to remove them all or press the arrow to remove one at a time. Thanks to PabloOQ for the idea and original implementation! This module has been deprecated in favor of the 'Uri parts' module
ta: [நீக்கப்பட்டது] இந்த தொகுதி மூலம் நீங்கள் முகவரி இலிருந்து வினவல்களை அகற்றலாம். அவை அனைத்தையும் அகற்ற பொத்தானை அழுத்தவும் அல்லது ஒரு நேரத்தில் ஒன்றை அகற்ற அம்புக்குறியை அழுத்தவும். சிந்தனை மற்றும் அசல் செயலாக்கத்திற்கு பப்லூக் நன்றி! இந்த தொகுதி 'யுஆர்ஐ பாகங்கள்' தொகுதிக்கு ஆதரவாக நீக்கப்பட்டது

# mRemove_found1
source: 1 query found
ta: 1 வினவல் கிடைத்தது

# mRemove_found
source: %d queries found
ta: %d வினவல்கள் காணப்பட்டன

# mRemove_noQueries
source: No queries
ta: வினவல்கள் இல்லை

# mRemove_all
source: Remove all
ta: அனைத்தையும் அகற்று

# mRemove_one
source: Remove %s
ta: %s ஐ அகற்று

# mRemove_empty
source: Remove empty
ta: காலியாக அகற்றவும்

# mLog_name
source: Log
ta: பதிவு

# mLog_desc
source: This module logs all checked URLs. You can view, clear or edit the full log here, no visual indication will appear on the main dialog. To disable logging, just disable the module.
ta: இந்த தொகுதி சரிபார்க்கப்பட்ட அனைத்து முகவரி களையும் பதிவு செய்கிறது. முழு பதிவையும் இங்கே காணலாம், அழிக்கலாம் அல்லது திருத்தலாம், முதன்மையான உரையாடலில் காட்சி அறிகுறி எதுவும் தோன்றாது. பதிவை முடக்க, தொகுதியை முடக்கு.

# mLog_view
source: View log
ta: பதிவைக் காண்க

# mLog_edit
source: Edit log
ta: பதிவைத் திருத்து

# mLog_empty
source: No data
ta: தரவு இல்லை

# mLog_limit
source: Maximum number of entries to keep. Recommended value: 100. Set empty for unlimited
ta: வைத்திருக்க அதிகபட்ச உள்ளீடுகளின் எண்ணிக்கை. பரிந்துரைக்கப்பட்ட மதிப்பு: 100. வரம்பற்ற காலியாக அமைக்கவும்

# mLog_unlimited
source: Unlimited
ta: வரம்பற்றது

# mHosts_name
source: Hosts labeler
ta: ஓச்ட்கள் லேபிளர்

# mHosts_desc
source: This module labels hosts, configured either by specifying them manually or by using a remote hosts-like file. You can use it to warn about dangerous or special sites. The builtin configuration specifies StevenBlack's hosts (adware/malware, fakenews, gambling and adult content) from https://github.com/StevenBlack/hosts. Note: subdomains will also be checked, so 'x.y.z' and 'y.z' will be detected for the entry 'y.z'
ta: இந்த தொகுதி ஓச்ட்களை லேபிளிடுகிறது, அவற்றை கைமுறையாகக் குறிப்பிடுவதன் மூலமோ அல்லது தொலை ஓச்ட்கள் போன்ற கோப்பைப் பயன்படுத்துவதன் மூலமோ கட்டமைக்கப்படுகிறது. ஆபத்தான அல்லது சிறப்பு தளங்களைப் பற்றி எச்சரிக்க நீங்கள் இதைப் பயன்படுத்தலாம். பில்டின் உள்ளமைவு https://github.com/stevenblack/hosts இலிருந்து ச்டீவ்ல்ப்ளேக்கின் ஓச்ட்களை (ஆட்வேர்/தீம்பொருள், ஃபேக்கனியூச், சூதாட்டம் மற்றும் அகவை வந்தோர் உள்ளடக்கம்) குறிப்பிடுகிறது. குறிப்பு: துணை டொமைன்களும் சரிபார்க்கப்படும், எனவே 'Y.Z' நுழைவுக்கு 'X.Y.Z' மற்றும் 'Y.Z' ஆகியவை கண்டறியப்படும்

# mHosts_malware
source: adware/malware
ta: ஆட்வேர்/தீம்பொருள்

# mHosts_info
source: Host:
ta: புரவலன்:

# mHosts_noLabel
source: no label
ta: சிட்டை இல்லை

# mHosts_fakenews
source: fakenews
ta: ஃபேக்கனியூச்

# mHosts_gambling
source: gambling
ta: சூதாட்டம்

# mHosts_adult
source: adult content
ta: வயதுவந்தோர் உள்ளடக்கம்

# mHosts_build
source: Build
ta: உருவாக்கு

# mHosts_uninitialized
source: Hosts database uninitialized. Press to build
ta: தரவுத்தளத்தை வழங்காத புரவலன். உருவாக்க அழுத்தவும்

# mHosts_parseError
source: Can not parse URL host
ta: முகவரி ஓச்டை அலச முடியாது

# mHosts_editor
source: Hosts configuration. Format: List of objects where the key is the hosts label and the content includes the following optional values: - file: An url of a remote hosts-file to download. All valid hosts present will be added. The lines should follow the hosts syntax: 'ip host [alias…]', but those with only 'host' are valid too. - hosts: List of raw hosts (strings) to add. - color: The label's color. An Android color string (#AARRGGBB, #RRGGBB or a valid color name). Defaults to a 'danger' red. - replace: if false existing hosts won't be replaced. Note that objects are evaluated from top to bottom. True by default. - enabled: if false this whole object will be skipped. True by default.
ta: உள்ளமைவு புரவலன். வடிவம்: முக்கிய ஓச்ட்கள் சிட்டை மற்றும் உள்ளடக்கத்தில் உள்ள பொருள்களின் பட்டியல் பின்வரும் விருப்ப மதிப்புகளை உள்ளடக்கியது: - கோப்பு: பதிவிறக்கம் செய்ய தொலை ஓச்ட்கள்-கோப்பின் முகவரி. தற்போதுள்ள அனைத்து செல்லுபடியாகும் ஓச்ட்களும் சேர்க்கப்படும். கோடுகள் ஓச்ட்களின் தொடரியல்: 'ஐபி புரவலன் [மாற்றுப்பெயர்…]', ஆனால் 'புரவலன்' மட்டுமே உள்ளவர்களும் செல்லுபடியாகும். - ஓச்ட்கள்: சேர்க்க மூல ஓச்ட்களின் பட்டியல் (சரங்கள்). - நிறம்: லேபிளின் நிறம். ஒரு ஆண்ட்ராய்டு வண்ண சரம் (#AarggBB, #RRGGBB அல்லது செல்லுபடியாகும் வண்ண பெயர்). 'இடர்' சிவப்பு நிறத்திற்கு இயல்புநிலை. - மாற்றவும்: தவறான ஓச்ட்கள் மாற்றப்படாது என்றால். பொருள்கள் மேலிருந்து கீழாக மதிப்பீடு செய்யப்படுகின்றன என்பதை நினைவில் கொள்க. இயல்புநிலையாக உண்மை. - இயக்கப்பட்டது: பொய்யானது இருந்தால் இந்த முழு பொருளும் தவிர்க்கப்படும். இயல்புநிலையாக உண்மை.

# mHosts_buildTitle
source: Build hosts database
ta: ஓச்ட்கள் தரவுத்தளத்தை உருவாக்குங்கள்

# mHosts_buildDesc
source: This will clear the current hosts database and build it with the current configuration, downloading hosts files from the internet if required. This action may take a few seconds. Continue?
ta: இது தற்போதைய புரவலன் தரவுத்தளத்தை அழித்து தற்போதைய உள்ளமைவுடன் உருவாக்கும், தேவைப்பட்டால் இணையத்திலிருந்து ஓச்ட்கள் கோப்புகளைப் பதிவிறக்குகிறது. இந்த நடவடிக்கை சில வினாடிகள் ஆகலாம். தொடரவா?

# mHosts_buildProgress
source: Building catalog
ta: கட்டிட அட்டவணை

# mHosts_buildInit
source: Initializing
ta: துவக்குதல்

# mHosts_buildClear
source: Clearing…
ta: தீர்வு…

# mHosts_buildDownload
source: Downloading '%1$s' hosts from %2$s…
ta: %2$s இலிருந்து ' %1$s' ஓச்ட்களைப் பதிவிறக்குவது…

# mHosts_buildSave
source: Saving…
ta: சேமிப்பு…

# mHosts_built
source: Database built: %d hosts
ta: தரவுத்தளம் கட்டப்பட்டது: %d ஓச்ட்கள்

# mUnshort_name
source: Unshortener
ta: அன்சார்டனர்

# mUnshort_desc
source: This module will unshort links by sending them to https://unshorten.me/, which evaluates them on their servers and save the redirection for future requests. Avoid unshortening links with private or sensitive data. Their api is rate limited to 10 requests per hour for new checks. The module response will show how many requests you have pending.
ta: இந்த தொகுதி அவற்றை https://unshorten.me/ க்கு அனுப்புவதன் மூலம் இணைப்புகளை மாற்றும், அவை அவற்றின் சேவையகங்களில் மதிப்பிடுகின்றன மற்றும் எதிர்கால கோரிக்கைகளுக்கான திருப்பிவிடலை சேமிக்கின்றன. தனிப்பட்ட அல்லது முக்கியமான தரவுகளுடன் இணைப்புகளைத் தவிர்க்கவும். அவற்றின் பநிஇ புதிய காசோலைகளுக்கான ஒரு மணி நேரத்திற்கு 10 கோரிக்கைகளுக்கு வரையறுக்கப்பட்டுள்ளது. நீங்கள் எத்தனை கோரிக்கைகள் நிலுவையில் உள்ளது என்பதை தொகுதி பதில் காண்பிக்கும்.

# mUnshort_tm
source: unshorten.me free API by Unshorten.me
ta: anshorten.me இலவச பநிஇ ஆல் unshorten.me

# mUnshort_checking
source: Checking…
ta: சோதனை…

# mUnshort_error
source: Server error: %s
ta: சேவையக பிழை: %s

# mUnshort_internal
source: Internal error (%s)
ta: உள் பிழை (%s)

# mUnshort_to
source: Unshortens to %s
ta: %s க்கு அசைக்கப்படுகிறது

# mUnshort_notFound
source: No unshorted url found
ta: அசைக்கப்படாத முகவரி எதுவும் கிடைக்கவில்லை

# mUnshort_pending
source: pending: %1$d/%2$d
ta: நிலுவையில் உள்ளது: %1$d/ %2$d

# mUnshort_ok
source: Unshortened
ta: அசைக்கப்படாதது

# mFlags_name
source: Flags editor
ta: கொடிகள் ஆசிரியர்

# mFlag_desc
source: [Beta feature] This is an advanced module, it allows you to edit the intent flags when opening another app. This module will show a list of flags, you can change if the flag is set or not by taping the icon. There is also an overflow menu to hide flags in there, it is just visual, flags will still use the assigned state. The flags will have two color indicators next to the checkbox. The left one shows the value received from the intent, the right one indicates the state set by the module itself. Red means the flag is not set and green means the flag is set. Additionally the preference indicator can be grey, this means that the state was set to auto. With the button below you can edit the default state and the visibility of the flags.
ta: [பீட்டா அம்சம்] இது ஒரு மேம்பட்ட தொகுதி, மற்றொரு பயன்பாட்டைத் திறக்கும்போது நோக்கக் கொடிகளைத் திருத்த இது உங்களை அனுமதிக்கிறது. இந்த தொகுதி கொடிகளின் பட்டியலைக் காண்பிக்கும், ஐகானைத் தட்டுவதன் மூலம் கொடி அமைக்கப்பட்டதா இல்லையா என்பதை நீங்கள் மாற்றலாம். அங்கு கொடிகளை மறைக்க ஒரு வழிதல் பட்டியல் உள்ளது, அது காட்சி, கொடிகள் இன்னும் ஒதுக்கப்பட்ட நிலையைப் பயன்படுத்தும். கொடிகள் தேர்வுப்பெட்டிக்கு அடுத்ததாக இரண்டு வண்ண குறிகாட்டிகளைக் கொண்டிருக்கும். இடது ஒன்று நோக்கத்திலிருந்து பெறப்பட்ட மதிப்பைக் காட்டுகிறது, வலது ஒன்று தொகுதியால் நிர்ணயிக்கப்பட்ட நிலையை குறிக்கிறது. சிவப்பு என்றால் கொடி அமைக்கப்படவில்லை மற்றும் பச்சை என்றால் கொடி அமைக்கப்பட்டுள்ளது. கூடுதலாக, விருப்பக் காட்டி சாம்பல் நிறமாக இருக்கலாம், இதன் பொருள் மாநிலம் ஆட்டோவாக அமைக்கப்பட்டது. கீழேயுள்ள பொத்தானைக் கொண்டு இயல்புநிலை நிலை மற்றும் கொடிகளின் தெரிவுநிலையைத் திருத்தலாம்.

# mFlag_editFlags
source: Edit default flag values
ta: இயல்புநிலை கொடி மதிப்புகளைத் திருத்தவும்

# mParts_name
source: Uri parts
ta: யூரி பாகங்கள்

# mParts_desc
source: This module shows all parts of the url decoded: scheme, authority, paths, queries and fragment. By clicking a part it will be set as the new url, useful for example if one of the queries or paths was an encoded redirection url. By long clicking a part it will be copied to the clipboard. You can also click the 'X' button to remove some of them. This is an advanced version of the 'Queries Remover' module.
ta: இந்த தொகுதி முகவரி டிகோட் செய்யப்பட்ட அனைத்து பகுதிகளையும் காட்டுகிறது: திட்டம், அதிகாரம், பாதைகள், வினவல்கள் மற்றும் துண்டு. ஒரு பகுதியைக் சொடுக்கு செய்வதன் மூலம் அது புதிய முகவரி ஆக அமைக்கப்படும், எடுத்துக்காட்டாக வினவல்கள் அல்லது பாதைகளில் ஒன்று குறியிடப்பட்ட திசைதிருப்பல் முகவரி ஆக இருந்தால் பயனுள்ளதாக இருக்கும். ஒரு பகுதியை நீண்ட நேரம் சொடுக்கு செய்வதன் மூலம் அது இடைநிலைப்பலகைக்கு நகலெடுக்கப்படும். அவற்றில் சிலவற்றை அகற்ற 'ஃச்' பொத்தானைக் சொடுக்கு செய்யலாம். இது 'வினவல்கள் நீக்குதல்' தொகுதியின் மேம்பட்ட பதிப்பாகும்.

# mParts_empty
source: (empty)
ta: (காலியாக)

# mParts_copy
source: Part copied to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்ட பகுதி

# mWebhook_name
source: Webhook
ta: வெப்ஊக்

# mWebhook_desc
source: This module sends URLs to a configured webhook endpoint. Each URL is sent with a timestamp, allowing you to collect and process URLs on your own server. Thanks to anoop-b for the idea and base implementation! Configure your webhook URL and body below to start sending URLs. For the body, you can use the placeholders $URL$ and $TIMESTAMP$.
ta: இந்த தொகுதி கட்டமைக்கப்பட்ட வெப்ஊக் இறுதிப்புள்ளிக்கு முகவரி களை அனுப்புகிறது. ஒவ்வொரு முகவரி ஒரு நேர முத்திரையுடன் அனுப்பப்படுகிறது, இது உங்கள் சொந்த சேவையகத்தில் முகவரி களை சேகரித்து செயலாக்க அனுமதிக்கிறது. சிந்தனை மற்றும் அடிப்படை செயலாக்கத்திற்கு அனூப்-பி நன்றி! முகவரி களை அனுப்பத் தொடங்க கீழே உங்கள் வெப்ஊக் முகவரி மற்றும் உடலை உள்ளமைக்கவும். உடலைப் பொறுத்தவரை, நீங்கள் பிளேச்ஓல்டர்கள் $ முகவரி $ மற்றும் $ டைம்ச்டாம்ப் $ ஐப் பயன்படுத்தலாம்.

# mWebhook_url_hint
source: Webhook URL
ta: வெப்ஊக் முகவரி

# mWebhook_body_hint
source: Webhook body
ta: வெப்ஊக் உடல்

# mWebhook_send
source: Send to Webhook
ta: வெப்ஊக்கிற்கு அனுப்புங்கள்

# mWebhook_auto
source: Automatically send URLs
ta: தானாக முகவரி களை அனுப்பவும்

# mWebhook_auto_send
source: Send to webhook
ta: வெப்ஊக்கிற்கு அனுப்புங்கள்

# mWebhook_missing_config
source: Missing webhook url or body
ta: வெப்ஊக் முகவரி அல்லது உடலை காணவில்லை

# mWebhook_sending
source: Sending to webhook…
ta: வெப்ஊக்கிற்கு அனுப்புகிறது…

# mWebhook_success
source: Successfully sent to webhook
ta: வெப்ஊக்கிற்கு வெற்றிகரமாக அனுப்பப்பட்டது
