Repository: 247i/TACETr
Catalog: உரை/தானி/vacation-days-metadata-*.po
Languages: ta

# title.txt:1
source: Vacation Days
ta: விடுமுறை நாட்கள்

# short_description.txt:1
source: See when you’re free — Vacation Days helps you keep track of your days off.
ta: நீங்கள் எப்போது ஓய்வில் இருக்கிறீர்கள் என்று பாருங்கள் — விடுமுறை நாட்கள் உங்கள் விடுமுறை நாட்களைக் கண்காணிக்க உதவுகிறது.

# full_description.txt:1
source: See when you’re free and plan holidays. <b>At a glance.</b> View your vacation days in one of two layouts: a timeline or a calendar. Counters in the top bar show your vacation days for the current year — and how many are left. <b>Sorted in seconds.</b> Tap the floating button to add new vacation days. Enter a name, swipe to select a date range, and you’re done. <b>Switching phones?</b> Back up all your data on one device and restore it on another. Make periodic backups to keep your data safe. <b>Night owls, rejoice.</b> A beautiful Dark Mode for late-night viewing. Toggle it automatically or have it follow the system appearance. Webpage: <a href="https://www.crazymarvin.com/vacation-days">https://www.crazymarvin.com/vacation-days</a> Translate it on Hosted Weblate: <a href="https://hosted.weblate.org/engage/vacationdays/">https://hosted.weblate.org/engage/vacationdays/</a> Libre software on GitHub: <a href="https://github.com/Crazy-Marvin/VacationDays">https://github.com/Crazy-Marvin/VacationDays</a>
ta: நீங்கள் எப்போது ஓய்வாக இருக்கிறீர்கள் என்று பார்த்து விடுமுறை நாட்களைத் திட்டமிடுங்கள். <b>ஒரு பார்வையில்.</b> உங்கள் விடுமுறை நாட்களை இரண்டு தளவமைப்புகளில் ஒன்றில் காண்க: ஒரு காலவரிசை அல்லது ஒரு காலண்டர். மேல் பட்டியில் உள்ள கவுண்டர்கள் நடப்பு ஆண்டிற்கான உங்கள் விடுமுறை நாட்களைக் காட்டுகின்றன - மேலும் எத்தனை மீதமுள்ளன. <b>வினாடிகளில் வரிசைப்படுத்தப்பட்டது.</b> புதிய விடுமுறை நாட்களைச் சேர்க்க மிதக்கும் பொத்தானைத் தட்டவும். ஒரு பெயரை உள்ளிட்டு, தேதி வரம்பைத் தேர்ந்தெடுக்க ஸ்வைப் செய்யவும், அவ்வளவுதான். <b>தொலைபேசிகளை மாற்றுகிறீர்களா?</b> ஒரு சாதனத்தில் உங்கள் எல்லா தரவையும் காப்புப் பிரதி எடுத்து மற்றொரு சாதனத்தில் மீட்டெடுக்கவும். உங்கள் தரவைப் பாதுகாப்பாக வைத்திருக்க அவ்வப்போது காப்புப்பிரதிகளை உருவாக்கவும். <b>இரவு ஆந்தைகளே, மகிழ்ச்சியுங்கள்.</b> இரவு நேரப் பார்வைக்கு அழகான டார்க் பயன்முறை. அதைத் தானாக நிலைமாற்றவும் அல்லது சிஸ்டம் தோற்றத்தைப் பின்பற்றச் செய்யவும். வலைப்பக்கம்: <a href="https://www.crazymarvin.com/vacation-days">https://www.crazymarvin.com/vacation-days</a> ஹோஸ்ட் செய்யப்பட்ட வெப்லேட்டில் இதை மொழிபெயர்க்கவும்: <a href="https://hosted.weblate.org/engage/vacationdays/">https://hosted.weblate.org/engage/vacationdays/</a> GitHub இல் இலவச மென்பொருள்: <a href="https://github.com/Crazy-Marvin/VacationDays">https://github.com/Crazy-Marvin/VacationDays</a>

# changelogs/1.txt:1
source: Initial Release
ta: ஆரம்ப வெளியீடு

# changelogs/10.txt:1
source: - Many Bugs Fixed Thanks To subeep 🐛 - UI Improvements Thanks To unbiaseduser 🎨 - Pressing Back Now Does Not Close The App Automatically 🐛 - Switch To Vector Icons For A Sharper view Thanks To karthikayya 🎨 - Translation Updates 🗺️
ta: - சப்பீப்பிற்கு நன்றி பல பிழைகள் சரி செய்யப்பட்டன 🐛 - பாரபட்சமற்ற பயனருக்கு நன்றி UI மேம்பாடுகள் 🎨 - இப்போது பின் அழுத்தினால் செயலி தானாக மூடப்படாது 🐛 - கூர்மையான பார்வைக்கு வெக்டர் ஐகான்களுக்கு மாறவும் கார்த்திகையாவுக்கு நன்றி 🎨 - மொழிபெயர்ப்பு புதுப்பிப்புகள் 🗺️

# changelogs/11.txt:1
source: - Rewrite of Vacation Days in Kotlin to enhance maintainablity, performance, efficiency, UX and security 💣 A huge thank you to all contributors and translators, especially Mubeen. 😘 Feel welcome to report issues and submit fixes on https://github.com/Crazy-Marvin/VacationDays/ or translations on https://hosted.weblate.org/engage/vacation-days/. 🚀
ta: - பராமரிப்பு, செயல்திறன், செயல்திறன், UX மற்றும் பாதுகாப்பை மேம்படுத்தக் கோட்லினில் விடுமுறை நாட்களை மீண்டும் எழுதவும் 💣 அனைத்து பங்களிப்பாளர்கள் மற்றும் மொழிபெயர்ப்பாளர்களுக்கு, குறிப்பாக முபீனுக்கு மிகப்பெரிய நன்றி. 😘 https://github.com/Crazy-Marvin/VacationDays/ அல்லது https://hosted.weblate.org/engage/vacation-days/ இல் மொழிபெயர்ப்புகளில் சிக்கல்களைப் புகாரளிக்கவும் திருத்தங்களைச் சமர்ப்பிக்கவும் வரவேற்கிறோம். 🚀

# changelogs/12.txt:1
source: - Counter Fixed 🐛 - Dependency Updates ⚙️ - Translation Updates 🗺️ A huge thank you to all contributors and translators, especially Mubeen. 😘 Feel welcome to report issues and submit fixes on https://github.com/Crazy-Marvin/VacationDays/ or translations on https://hosted.weblate.org/engage/vacation-days/. 🚀
ta: - கவுண்டர் சரி செய்யப்பட்டது 🐛 - சார்பு புதுப்பிப்புகள் ⚙️ - மொழிபெயர்ப்பு புதுப்பிப்புகள் 🗺️ அனைத்து பங்களிப்பாளர்கள் மற்றும் மொழிபெயர்ப்பாளர்களுக்கு, குறிப்பாக முபீனுக்கு மிகப்பெரிய நன்றி. 😘 https://github.com/Crazy-Marvin/VacationDays/ அல்லது https://hosted.weblate.org/engage/vacation-days/ இல் மொழிபெயர்ப்புகளில் சிக்கல்களைப் புகாரளிக்கவும் திருத்தங்களைச் சமர்ப்பிக்கவும் வரவேற்கிறோம். 🚀

# changelogs/13.txt:1
source: - Hopefully enable reproducible builds successfully ❤️ A huge thank you to all contributors and translators, especially IzzyOnDroid. 😘 Feel welcome to report issues and submit fixes on https://github.com/Crazy-Marvin/VacationDays/ or translations on https://hosted.weblate.org/engage/vacation-days/. 🚀
ta: - மீண்டும் உருவாக்கக்கூடிய கட்டமைப்புகளை வெற்றிகரமாக இயக்க முடியும் என்று நம்புகிறேன் ❤️ அனைத்து பங்களிப்பாளர்கள் மற்றும் மொழிபெயர்ப்பாளர்களுக்கு, குறிப்பாக IzzyOnDroid க்கு மிகப்பெரிய நன்றி. 😘 https://github.com/Crazy-Marvin/VacationDays/ அல்லது https://hosted.weblate.org/engage/vacation-days/ இல் மொழிபெயர்ப்புகளில் சிக்கல்களைப் புகாரளிக்கவும் திருத்தங்களைச் சமர்ப்பிக்கவும் வரவேற்கிறோம். 🚀

# changelogs/14.txt:1
source: - Hopefully enable reproducible builds successfully (again) ❤️ A huge thank you to all contributors and translators, especially IzzyOnDroid. 😘 Feel welcome to report issues and submit fixes on https://github.com/Crazy-Marvin/VacationDays/ or translations on https://hosted.weblate.org/engage/vacation-days/. 🚀
ta: - மீண்டும் உருவாக்கக்கூடிய கட்டமைப்புகளை வெற்றிகரமாக இயக்க முடியும் என்று நம்புகிறேன் (மீண்டும்) ❤️ அனைத்து பங்களிப்பாளர்கள் மற்றும் மொழிபெயர்ப்பாளர்களுக்கு, குறிப்பாக IzzyOnDroid க்கு மிகப்பெரிய நன்றி. 😘 https://github.com/Crazy-Marvin/VacationDays/ அல்லது https://hosted.weblate.org/engage/vacation-days/ இல் மொழிபெயர்ப்புகளில் சிக்கல்களைப் புகாரளிக்கவும் திருத்தங்களைச் சமர்ப்பிக்கவும் வரவேற்கிறோம். 🚀

# changelogs/15.txt:1
source: This update includes many bug fixes and a few helpful new features. 🥳 As always, let us know if something is not working or missing. 😘 - Try to fix reproducible builds (again) ❤️ - Further housecleaning 🛀 - Deletion of entries is possible again 🐛 - Vacation days in the past can be added again 🐛 - Highlighting of today's date should look good again 🐛 - Size of some too small textfields should be dynamically fixed 🐛 - Notify users when they try to save a vacation without name instead of just exiting without saving ⚠️ - BETA: Notification for future vacations 🔔 - Homescreen widget 🏠 - Dependency updates ⚙️ - Translation updates 🗺️ A huge thank you to all contributors and translators, especially Mubeen. 😘 Feel welcome to report issues and submit fixes on https://github.com/Crazy-Marvin/VacationDays/ or translations on https://hosted.weblate.org/engage/vacation-days/. 🚀 And of course, enjoy your vacations because you are awesome! 🏖️
ta: இந்தப் புதுப்பிப்பில் பல பிழைத் திருத்தங்களும் சில பயனுள்ள புதிய அம்சங்களும் உள்ளன. 🥳 எப்போதும் போல, ஏதாவது வேலை செய்யவில்லை அல்லது விடுபட்டிருந்தால் எங்களுக்குத் தெரியப்படுத்துங்கள். 😘 - மீண்டும் உருவாக்கக்கூடிய கட்டமைப்புகளைச் சரிசெய்ய முயற்சிக்கவும் (மீண்டும்) ❤️ - மேலும் வீட்டைச் சுத்தம் செய்தல் 🛀 - உள்ளீடுகளை நீக்குவது மீண்டும் சாத்தியம் 🐛 - கடந்த கால விடுமுறை நாட்களை மீண்டும் சேர்க்கலாம் 🐛 - இன்றைய தேதியை மீண்டும் சிறப்பித்துக் காட்டுவது நன்றாக இருக்க வேண்டும் 🐛 - சில மிகச் சிறிய உரைப் புலங்களின் அளவு மாறும் வகையில் சரி செய்யப்பட வேண்டும் 🐛 - பயனர்கள் விடுமுறையை சேமிக்காமல் வெளியேறுவதற்குப் பதிலாகப் பெயர் இல்லாமல் சேமிக்க முயற்சிக்கும்போது அவர்களுக்குத் தெரிவிக்கவும் ⚠️ - பீட்டா: எதிர்கால விடுமுறைகளுக்கான அறிவிப்பு 🔔 - முகப்புத் திரை விட்ஜெட் 🏠 - சார்பு புதுப்பிப்புகள் ⚙️ - மொழிபெயர்ப்பு புதுப்பிப்புகள் 🗺️ அனைத்து பங்களிப்பாளர்கள் மற்றும் மொழிபெயர்ப்பாளர்களுக்கு, குறிப்பாக முபீனுக்கு மிகப்பெரிய நன்றி. 😘 https://github.com/Crazy-Marvin/VacationDays/ அல்லது https://hosted.weblate.org/engage/vacation-days/ இல் மொழிபெயர்ப்புகளில் சிக்கல்களைப் புகாரளிக்கவும் திருத்தங்களைச் சமர்ப்பிக்கவும் வரவேற்கிறோம். 🚀 நிச்சயமாக, உங்கள் விடுமுறையை அனுபவியுங்கள், ஏனென்றால் நீங்கள் அருமை! 🏖️

# changelogs/2.txt:1
source: Little improvements under the hood
ta: மறைவில் சிறிய மேம்பாடுகள்

# changelogs/3.txt:1
source: Little improvements under the hood
ta: மறைவில் சிறிய மேம்பாடுகள்

# changelogs/4.txt:1
source: Internal fixes
ta: உள் திருத்தங்கள்

# changelogs/5.txt:1
source: "Fix" linting for release builds
ta: வெளியீட்டு கட்டமைப்புகளுக்கான லிண்டிங்கை "சரிசெய்யவும்"

# changelogs/6.txt:1
source: Dependency updates
ta: சார்பு புதுப்பிப்புகள்

# changelogs/7.txt:1
source: - 🐛 Saving of the appearance settings fixed - 🎵 App now shows a message that the backup feature is not implemented yet - 🤮 Better handlig of ill days - 🆕 Dependenices updated
ta: - 🐛 தோற்ற அமைப்புகளின் சேமிப்பு சரி செய்யப்பட்டது. - 🎵 காப்புப்பிரதி அம்சம் இன்னும் செயல்படுத்தப்படவில்லை என்ற செய்தியை ஆப்ஸ் இப்போது காட்டுகிறது. - 🤮 நோய்வாய்ப்பட்ட நாட்களைச் சிறப்பாகக் கையாளுதல் - 🆕 சார்புநிலைகள் புதுப்பிக்கப்பட்டன

# changelogs/8.txt:1
source: The app now shows the number of Vacation Days. More enhancements are on the way. 🚀
ta: இப்போது ஆப்ஸ் விடுமுறை நாட்களின் எண்ணிக்கையைக் காட்டுகிறது. மேலும் மேம்பாடுகள் வரவிருக்கின்றன. 🚀

# changelogs/9.txt:1
source: - ⚙️ Fix backup (#94) - 🎨 Support Themed Icon which was introduced for Android 13+ (#83) - 🐛 Fix version name shown in the About screen (#97) - 👍 Update dependencies and translations Thank you so much to @unbiaseduser, @amarradi and all translators! 😘
ta: - ⚙️ காப்புப்பிரதியைச் சரிசெய்யவும் (#94) - 🎨 ஆண்ட்ராய்டு 13+ (#83) க்காக அறிமுகப்படுத்தப்பட்ட தீம் ஐகானை ஆதரிக்கவும். - 🐛 அறிமுகம் திரையில் காட்டப்பட்டுள்ள பதிப்பு பெயரைச் சரிசெய்யவும் (#97) - 👍 சார்புநிலைகள் மற்றும் மொழிபெயர்ப்புகளைப் புதுப்பிக்கவும் @unbiaseduser, @amarradi மற்றும் அனைத்து மொழிபெயர்ப்பாளர்களுக்கும் மிக்க நன்றி! 😘
