Repository: 247i/TACETr
Catalog: உரை/தானி/venom-translations-*.po
Languages: ta

source: _Redo
ta: _ ரெடோ

source: New message from %s
ta: %s இலிருந்து புதிய செய்தி

source: Show details
ta: விவரங்களைக் காட்டு

source: Mute conversation
ta: முடக்கு உரையாடல்

source: Friend request
ta: நண்பர் கோரிக்கை

source: New file from %s
ta: %s இலிருந்து புதிய கோப்பு

source: Conference invite
ta: மாநாட்டு அழைப்பு

source: %s invites you to a conference
ta: %s உங்களை ஒரு மாநாட்டிற்கு அழைக்கிறது

source: Just now
ta: இப்போது

source: %u minute ago
ta: %u மணித்துளி முன்பு

source: %u hour ago
ta: %u மணி நேரத்திற்கு முன்பு

source: Today at %s
ta: இன்று %s

source: Yesterday at %s
ta: நேற்று %s

source: Tox User
ta: நச்சு பயனர்

source: Set level of messages to log
ta: பதிவு செய்ய செய்திகளின் அளவை அமைக்கவும்

source: <loglevel>
ta: <லோக்லெவல்>

source: Display version number
ta: பதிப்பு எண்ணைக் காண்பி

source: Show preferences
ta: விருப்பங்களைக் காட்டு

source: Settings
ta: அமைப்புகள்

source: New conference…
ta: புதிய மாநாடு…

source: Invite to conference…
ta: மாநாட்டிற்கு அழைக்கவும்…

source: Leave conference
ta: விடுப்பு மாநாடு

source: Remove friend
ta: நண்பரை அகற்று

source: %u new friend request
ta: %u புதிய நண்பர் கோரிக்கை

source: %u new conference invite
ta: %u புதிய மாநாட்டு அழைப்பு

source: Online right now
ta: இப்போது நிகழ்நிலை

source: Never seen online
ta: ஆன்லைனில் பார்த்ததில்லை

source: Last seen: %s
ta: கடைசியாக பார்த்தது: %s

source: New Message!
ta: புதிய செய்தி!

source: Offline
ta: இணையமில்லாமல்

source: Away
ta: தொலைவில்

source: Busy
ta: பிசியாக

source: Online
ta: ஆன்லைனில்

source: Notice
ta: அறிவிப்பு

source: Message sent ✓
ta: செய்தி அனுப்பப்பட்டது

source: Message received ✓
ta: செய்தி பெறப்பட்டது

source: me
ta: நான்

source: %s has been removed from your contact list.
ta: உங்கள் தொடர்பு பட்டியலிலிருந்து %s அகற்றப்பட்டுள்ளன.

source: Undo
ta: செயல்தவிர்

source: Unnamed conference %u
ta: பெயரிடப்படாத மாநாடு %u

source: %u Peers online
ta: %u பியர்ச் ஆன்லைனில்

source: Address must consist of 76 hexadecimal characters
ta: முகவரி 76 எக்சாடெசிமல் எழுத்துக்களைக் கொண்டிருக்க வேண்டும்

source: %s in %s
ta: %s இல் %s

source: Hide
ta: மறை

source: Show
ta: காட்டு

source: Status
ta: நிலை

source: Preferences
ta: விருப்பத்தேர்வுகள்

source: About
ta: பற்றி

source: Logout
ta: வெளியேற்றம்

source: Quit
ta: வெளியேறு

source: Wrong password
ta: தவறான கடவுச்சொல்

source: Username can not be empty
ta: பயனர்பெயர் காலியாக இருக்க முடியாது

source: Username is already taken
ta: பயனர்பெயர் ஏற்கனவே எடுக்கப்பட்டுள்ளது

source: Password must be at least 6 characters long
ta: கடவுச்சொல் குறைந்தது 6 எழுத்துக்கள் நீளமாக இருக்க வேண்டும்

source: Passwords must match
ta: கடவுச்சொற்கள் பொருந்த வேண்டும்

source: Creating profile failed:
ta: சுயவிவரத்தை உருவாக்குவது தோல்வியுற்றது:

source: Profile is encrypted
ta: சுயவிவரம் குறியாக்கம் செய்யப்பட்டுள்ளது

source: Packagers
ta: பேக்கேசர்கள்

source: A modern Tox client for the Linux desktop
ta: லினக்ச் டெச்க்டாப்பிற்கான நவீன டாக்ச் வாங்கி

source: Copyright © 2013-2018 Venom authors and contributors
ta: பதிப்புரிமை © 2013-2018 வெனோம் ஆசிரியர்கள் மற்றும் பங்களிப்பாளர்கள்

source: translator-credits
ta: மொழிபெயர்ப்பாளர்-வரவு

source: A new kind of instant messaging
ta: ஒரு புதிய வகையான உடனடி செய்தி

source: Chat with your friends and family without anyone else listening in.
ta: வேறு யாரும் கேட்காமல் உங்கள் நண்பர்கள் மற்றும் குடும்பத்தினருடன் அரட்டையடிக்கவும்.

source: Now with 50% less bugs.
ta: இப்போது 50% குறைவான பிழைகள்.

source: Generating witty dialog…
ta: நகைச்சுவையான உரையாடலை உருவாக்குகிறது…

source: Thank you for using Venom.
ta: விசத்தைப் பயன்படுத்தியதற்கு நன்றி.

source: Always think positive.
ta: எப்போதும் நேர்மறையாக சிந்தியுங்கள்.

source: Have a good day and stay safe.
ta: ஒரு நல்ல நாள் மற்றும் பாதுகாப்பாக இருங்கள்.

source: You can do it. ― Coffee
ta: நீங்கள் அதை செய்ய முடியும். - காபி

source: Life moves pretty fast. If you don’t stop and look around once in a while, you could miss it. ― Ferris Bueller
ta: வாழ்க்கை மிக வேகமாக நகர்கிறது. நீங்கள் நிறுத்தி ஒரு முறை சுற்றிப் பார்க்கவில்லை என்றால், நீங்கள் அதை இழக்க நேரிடும். - பெர்ரிச் புல்லர்

source: Drink your milk for extra strong bones.
ta: கூடுதல் வலுவான எலும்புகளுக்கு உங்கள் பால் குடிக்கவும்.

source: File transfers
ta: கோப்பு இடமாற்றங்கள்

source: %s is typing…
ta: %s தட்டச்சு செய்கின்றன…

source: Choose a file to send
ta: அனுப்ப ஒரு கோப்பைத் தேர்வுசெய்க

source: _Save
ta: _சேவ்

source: Invite from %s
ta: %s இலிருந்து அழைக்கவும்

source: Images
ta: படங்கள்

source: No file transfers yet …
ta: இதுவரை கோப்பு இடமாற்றங்கள் இல்லை…

source: Login automatically
ta: தானாக உள்நுழைக

source: Password
ta: கடவுச்சொல்

source: Login
ta: புகுபதிவு

source: Other profiles
ta: பிற சுயவிவரங்கள்

source: Import profile…
ta: இறக்குமதி சுயவிவரம்…

source: New profile
ta: புதிய சுயவிவரம்

source: Username
ta: பயனர்பெயர்

source: Confirm Password
ta: கடவுச்சொல்லை உறுதிப்படுத்தவும்

source: Create
ta: உருவாக்கு

source: Create profile
ta: சுயவிவரத்தை உருவாக்கவும்

source: Remove transfer
ta: பரிமாற்றத்தை அகற்று

source: Open file
ta: கோப்பை திற

source: Start transfer
ta: பரிமாற்றத்தைத் தொடங்குங்கள்

source: Pause transfer
ta: இடைநிறுத்தம் பரிமாற்றம்

source: Stop transfer
ta: பரிமாற்றத்தை நிறுத்துங்கள்

source: Create a conference
ta: ஒரு மாநாட்டை உருவாக்கவும்

source: Conference
ta: மாநாடு

source: paste from clipboard
ta: கிளிப்போர்டிலிருந்து ஒட்டவும்

source: <small>Name the conference (optional)</small>
ta: <mall> மாநாட்டிற்கு பெயரிடுங்கள் (விரும்பினால்) </சிறிய>

source: Text
ta: உரை

source: Speech
ta: பேச்சு

source: <small>Select a conference type</small>
ta: <mall> ஒரு மாநாட்டு வகையைத் தேர்ந்தெடுக்கவும் </சிறிய>

source: New conference
ta: புதிய மாநாடு

source: Conference invites
ta: மாநாடு அழைக்கிறது

source: Accept all
ta: அனைத்தையும் ஏற்றுக்கொள்

source: Reject all
ta: அனைத்தையும் நிராகரிக்கவும்

source: No new conference invites
ta: புதிய மாநாடு எதுவும் அழைக்கப்படவில்லை

source: This peer is also in your friends list
ta: இந்த பியர் உங்கள் நண்பர்கள் பட்டியலில் உள்ளது

source: That's you
ta: அது நீங்கள்

source: Insert Emoji
ta: ஈமோசியை செருகவும்

source: No one here...
ta: இங்கே யாரும் இல்லை ...

source: No messages yet...
ta: இன்னும் செய்திகள் இல்லை ...

source: Show peers
ta: சகாக்களைக் காட்டு

source: _Preferences
ta: விருப்பத்தேர்வுகள்

source: Add a friend
ta: ஒரு நண்பரைச் சேர்க்கவும்

source: Filter contacts by status
ta: நிலை மூலம் தொடர்புகளை வடிகட்டவும்

source: All
ta: அனைத்தும்

source: Add a contact
ta: ஒரு தொடர்பைச் சேர்க்கவும்

source: View file transfers
ta: கோப்பு இடமாற்றங்களைக் காண்க

source: Open preferences
ta: திறந்த விருப்பத்தேர்வுகள்

source: Edit your profile
ta: உங்கள் சுயவிவரத்தைத் திருத்தவும்

source: Change your status
ta: உங்கள் நிலையை மாற்றவும்

source: Start a call
ta: அழைப்பைத் தொடங்கவும்

source: Start a video call
ta: வீடியோ அழைப்பைத் தொடங்கவும்

source: Attach screenshot…
ta: ச்கிரீன்சாட்டை இணைக்கவும்…

source: Attach file…
ta: கோப்பை இணைக்கவும்…

source: Insert attachment
ta: இணைப்பைச் செருகவும்

source: Accept
ta: ஏற்றுக்கொள்

source: Deny
ta: மறுக்கவும்

source: Leave Conference
ta: விடுப்பு மாநாடு

source: Title:
ta: தலைப்பு:

source: Notifications
ta: அறிவிப்புகள்

source: <small>Notifications have been globally disabled</small>
ta: <mall> அறிவிப்புகள் உலகளவில் முடக்கப்பட்டுள்ளன </சிறிய>

source: Apply
ta: இடு

source: Peers
ta: சகாக்கள்

source: Learn more
ta: மேலும் அறிக

source: Get involved
ta: ஈடுபடுங்கள்

source: No new friend requests
ta: புதிய நண்பர் கோரிக்கைகள் எதுவும் இல்லை

source: Please let me add you to my contact list. 😁
ta: எனது தொடர்பு பட்டியலில் உங்களைச் சேர்க்க அனுமதிக்கிறேன். .

source: Send a friend request
ta: நண்பர் கோரிக்கையை அனுப்பவும்

source: Enter a Tox ID or URI here
ta: ஒரு நச்சு ஐடி அல்லது யூரியை இங்கே உள்ளிடவும்

source: <small>Enter your friends Tox ID</small>
ta: <tall> உங்கள் நண்பர்களின் டாக்ச் ஐடியை உள்ளிடவும் </சிறிய>

source: _Message:
ta: _மெசேச்:

source: Send a custom message to be displayed to the friend you are adding
ta: நீங்கள் சேர்க்கும் நண்பருக்கு காண்பிக்கப்பட வேண்டிய தனிப்பயன் செய்தியை அனுப்பவும்

source: <small>Send your friend a short message</small>
ta: <tall> உங்கள் நண்பருக்கு ஒரு குறுகிய செய்தியை அனுப்பவும் </சிறிய>

source: Send
ta: அனுப்பு

source: Friend requests
ta: நண்பர் கோரிக்கைகள்

source: Reset
ta: மீட்டமை

source: Take a picture
ta: படம் எடுக்கவும்

source: Choose a file
ta: ஒரு கோப்பைத் தேர்வுசெய்க

source: Choose an avatar
ta: அவதாரத்தைத் தேர்வுசெய்க

source: Username:
ta: பயனர்பெயர்:

source: Status message:
ta: நிலை செய்தி:

source: Tox
ta: நச்சு

source: Copy to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கவும்

source: ID:
ta: ஐடி:

source: Advanced
ta: மேம்பட்ட

source: Tox nospam
ta: நச்சு நோச்பாம்

source: Generate new random nospam
ta: புதிய சீரற்ற நோச்பாம் உருவாக்கு

source: Set this nospam
ta: இந்த நோச்பாம் அமைக்கவும்

source: Previous nospams
ta: முந்தைய நோச்பாம்

source: General
ta: பொது

source: Bootstrap nodes
ta: தொடக்கவார் முனைகள்

source: Proxy
ta: பதிலாள்

source: Appearance
ta: தோற்றம்

source: Dark Theme
ta: இருண்ட கருப்பொருள்

source: <small>Use a dark variant of the theme</small>
ta: <mall> கருப்பொருளின் இருண்ட மாறுபாட்டைப் பயன்படுத்தவும் </small>

source: Animations
ta: அனிமேசன்கள்

source: <small>Turn on animated transitions</small>
ta: <mall> அனிமேசன் மாற்றங்களை இயக்கவும் </சிறிய>

source: Small contacts
ta: சிறிய தொடர்புகள்

source: <small>Show contacts in a compact format</small>
ta: <mall> ஒரு சிறிய வடிவத்தில் தொடர்புகளைக் காட்டு </சிறிய>

source: Spellcheck
ta: எழுத்துப்பிழை

source: <small>Check your spelling while you type</small>
ta: <mall> நீங்கள் தட்டச்சு செய்யும் போது உங்கள் எழுத்துப்பிழை சரிபார்க்கவும் </சிறிய>

source: Sounds
ta: ஒலிகள்

source: <small>Play sounds on new notifications</small>
ta: <tall> புதிய அறிவிப்புகளில் பிளே ஒலிகள் </சிறிய>

source: While Busy
ta: பிசியாக இருக்கும்போது

source: <small>Receive notifications even while you are busy</small>
ta: <tall> நீங்கள் பிசியாக இருக்கும்போது கூட அறிவிப்புகளைப் பெறுங்கள் </சிறிய>

source: Tray icon
ta: தட்டு படவுரு

source: Minimize
ta: குறைக்கவும்

source: <small>Minimize to tray instead of close</small>
ta: <small> மூடு </சிறிய> க்கு பதிலாக தட்டில் குறைக்கவும்

source: Privacy
ta: தனியுரிமை

source: Send typing status
ta: தட்டச்சு நிலையை அனுப்பவும்

source: <small>Show others when you are typing</small>
ta: <mall> நீங்கள் தட்டச்சு செய்யும் போது மற்றவர்களைக் காட்டுங்கள் </சிறிய>

source: Keep History
ta: வரலாற்றை வைத்திருங்கள்

source: <small>Store your sent and received messages</small>
ta: <mall> நீங்கள் அனுப்பிய மற்றும் பெறப்பட்ட செய்திகளை சேமிக்கவும் </சிறிய>

source: <b>Connection</b>
ta: <b> இணைப்பு </b>

source: UDP
ta: யுடிபி

source: <small>Use UDP communication when available</small>
ta: <small> கிடைக்கும்போது யுடிபி தகவல்தொடர்புகளைப் பயன்படுத்தவும் </சிறிய>

source: IPv6
ta: Ipvsh

source: <small>Allow both IPv4 and IPv6 communication</small>
ta: <mall> IPv4 மற்றும் IPv6 தொடர்பு </small> இரண்டையும் அனுமதிக்கவும்

source: Local discovery
ta: உள்ளக கண்டுபிடிப்பு

source: <small>Look for peers on the local network</small>
ta: <Mallish> உள்ளக நெட்வொர்க்கில் சகாக்களைத் தேடுங்கள் </சிறிய>

source: Hole punching
ta: துளை குத்துதல்

source: <small>Enable UDP <a href="https://en.wikipedia.org/wiki/Hole_punching_(networking)">hole punching</a></small>
ta: <mall> UDP <a href = "https://en.wikipedia.org/wiki/hole_punching_(networking)"> துளை குத்துதல் </a> </small>

source: Update bootstrap nodes
ta: தொடக்கவார் முனைகளை புதுப்பிக்கவும்

source: <b>Bootstrap nodes</b>
ta: <b> தொடக்கவார் முனைகள் </b>

source: <b>Proxy</b>
ta: <b> பதிலாள் </b>

source: System settings
ta: கணினி அமைப்புகள்

source: <small>Use your systems proxy settings</small>
ta: <mall> உங்கள் கணினிகள் பதிலாள் அமைப்புகளைப் பயன்படுத்தவும் </small>

source: Manual settings
ta: கையேடு அமைப்புகள்

source: <small>Use custom proxy settings</small>
ta: <mall> தனிப்பயன் பதிலாள் அமைப்புகளைப் பயன்படுத்தவும் </சிறிய>

source: Host
ta: விருந்தோம்பி

source: <small>Set a SOCKS5 proxy to connect to</small>
ta: <small> இணைக்க ஒரு SOCKS5 ப்ராக்சியை அமைக்கவும் </small>

source: Remove from your friends list
ta: உங்கள் நண்பர்கள் பட்டியலிலிருந்து அகற்று

source: Alias:
ta: மாற்றுப்பெயர்:

source: Reset alias
ta: மாற்றுப்பெயரை மீட்டமைக்கவும்

source: <small>Set a custom alias to quickly find your friends</small>
ta: <mall> உங்கள் நண்பர்களைக் கண்டுபிடிக்க தனிப்பயன் மாற்றுப்பெயரை அமைக்கவும் </சிறிய>

source: Auto accept conference invites
ta: ஆட்டோ ஏற்றுக்கொள்ளும் மாநாடு அழைப்புகள்

source: Auto accept file transfers
ta: கோப்பு இடமாற்றங்களை தானாக ஏற்றுக்கொள்ளுங்கள்

source: Save files to
ta: கோப்புகளை சேமிக்கவும்

source: Public key:
ta: பொது விசை:

source: Oh no! Something broke!
ta: ஓ! ஏதோ உடைந்தது!

source: Please check your settings and retry
ta: உங்கள் அமைப்புகளை சரிபார்த்து மீண்டும் முயற்சிக்கவும்

source: Info
ta: தகவல்

source: Log
ta: பதிவு

source: Retry
ta: மீண்டும் முயற்சிக்கவும்

source: Venom
ta: நஞ்சு

source: tox;instant messaging;video chat;
ta: டாக்ச்; உடனடி செய்தி; வீடியோ அரட்டை;
