Repository: 247i/TACETr
Catalog: உரை/தானி/voice-notify-store-*.po
Languages: ta

source: Voice Notify
ta: குரல் அறிவிப்பு

source: Voice Notify uses TTS to announce status bar notification messages
ta: நிலை பட்டி அறிவிப்பு செய்திகளை அறிவிக்க குரல் அறிவிப்பு TTS ஐப் பயன்படுத்துகிறது

source: Voice Notify announces status bar notification messages using Text-To-Speech (TTS) so you don't need to look at the screen to know what a notification says.
ta: குரல் அறிவிப்பு உரை-க்கு-பேச்சு (TTS) ஐப் பயன்படுத்தி நிலை பட்டி அறிவிப்பு செய்திகளை அறிவிக்கிறது, எனவே அறிவிப்பு என்ன சொல்கிறது என்பதை அறிய நீங்கள் திரையைப் பார்க்க தேவையில்லை.

source: FEATURES: • Widget and quick settings tile to suspend Voice Notify • Customizable TTS message • Replace text to be spoken • Ignore or enable for individual apps • Ignore or require notifications containing specified text • Choice of TTS audio stream • Choice of speaking when screen or headset is on or off, or while in silent/vibrate mode • Quiet Time • Shake-to-silence • Limit length of spoken message • Repeat notifications at custom interval while screen off • Custom delay of TTS after notification • Most settings can be overridden per-app • Notification log • Post a test notification • Backup and restore settings as zip file • Light and dark themes (follows system theme)
ta: அம்சங்கள்: • விட்செட் மற்றும் விரைவான அமைப்புகள் குரல் அறிவிப்பை இடைநிறுத்த ஓடு • தனிப்பயனாக்கக்கூடிய TTS செய்தி The பேச வேண்டிய உரையை மாற்றவும் பயன்பாடு தனிப்பட்ட பயன்பாடுகளை புறக்கணிக்கவும் அல்லது இயக்கவும் உரை குறிப்பிட்ட உரையைக் கொண்ட அறிவிப்புகளை புறக்கணிக்கவும் அல்லது தேவை Auld டி.டி.எச் ஆடியோ ச்ட்ரீமின் தேர்வு Screens திரை அல்லது எட்செட் இயக்கத்தில் அல்லது முடக்கும்போது அல்லது அமைதியான/அதிர்வு பயன்முறையில் இருக்கும்போது பேசும் தேர்வு • அமைதியான நேரம் • சேக்-டு-சைலன்ச் The பேசும் செய்தியின் நீளத்தைக் கட்டுப்படுத்துங்கள் Screen திரையிடப்படும்போது தனிப்பயன் இடைவெளியில் அறிவிப்புகளை மீண்டும் செய்யவும் அறிவிப்புக்குப் பிறகு TTS இன் தனிப்பயன் நேரந்தவறுகை Apt பெரும்பாலான அமைப்புகள் பயன்பாட்டிற்கு மேலெழுதப்படலாம் • அறிவிப்பு பதிவு தேர்வு சோதனை அறிவிப்பை இடுங்கள் Sigs அமைப்புகளை ZIP கோப்பாக காப்புப்பிரதி மற்றும் மீட்டமை • ஒளி மற்றும் இருண்ட கருப்பொருள்கள் (கணினி கருப்பொருளைப் பின்பற்றுகிறது)

source: GETTING STARTED: Voice Notify operates through Android's Notification Listener service and must be enabled in the Notification Access settings. A shortcut to that screen is provided at the top of the main Voice Notify screen.
ta: தொடங்குதல்: குரல் அறிவிப்பு ஆண்ட்ராய்டு இன் அறிவிப்பு கேட்போர் சேவையின் மூலம் இயங்குகிறது மற்றும் அறிவிப்பு அணுகல் அமைப்புகளில் இயக்கப்பட வேண்டும். அந்தத் திரைக்கான குறுக்குவழி முதன்மையான குரல் அறிவிப்பு திரையின் மேற்புறத்தில் வழங்கப்படுகிறது.

source: Some device brands, such as Xiaomi and Samsung among several others, have an additional permission that by default prevents apps like Voice Notify from auto-starting or running in the background. When Voice Notify is opened on a known affected device and the service isn't running, a dialog will appear with instructions and in some cases can open directly into the relevant settings screen.
ta: சியோமி மற்றும் சாம்சங் போன்ற சில சாதன பிராண்டுகளுக்கு கூடுதல் இசைவு உள்ளது, இது இயல்புநிலையாக குரல் போன்ற பயன்பாடுகளை தானாகத் தொடங்குவதிலிருந்து அல்லது பின்னணியில் இயங்குவதைத் தடுக்கிறது. அறியப்பட்ட பாதிக்கப்பட்ட சாதனத்தில் குரல் அறிவிப்பு திறக்கப்பட்டு, பணி இயங்காதபோது, ​​ஒரு உரையாடல் அறிவுறுத்தல்களுடன் தோன்றும், சில சந்தர்ப்பங்களில் நேரடியாக தொடர்புடைய அமைப்புகள் திரையில் திறக்க முடியும்.

source: PERMISSIONS: • Post Notifications - Required to post the test notification. This is typically the only permission that Android shows to the user. • Query All Packages - Required to fetch a list of all installed apps for the App List and allow for per-app settings • Bluetooth - Required to detect whether Bluetooth headset is connected • Vibrate - Required for Test feature while device is in vibrate mode • Modify Audio Settings - Required for improved wired headset detection • Read Phone State - Required to interrupt TTS if a phone call becomes active [Android 11 and below]
ta: அனுமதிகள்: • இடுகை அறிவிப்புகள் - சோதனை அறிவிப்பை இடுகையிட தேவை. அண்ட்ராய்டு பயனருக்கு காண்பிக்கும் ஒரே இசைவு இதுதான். Packet அனைத்து தொகுப்புகளையும் வினவவும் - பயன்பாட்டு பட்டியலுக்கான நிறுவப்பட்ட அனைத்து பயன்பாடுகளின் பட்டியலையும் பெற வேண்டும் மற்றும் பயன்பாட்டு அமைப்புகளுக்கு அனுமதிக்க வேண்டும் • ஊடலை - ஊடலை எட்செட் இணைக்கப்பட்டுள்ளதா என்பதைக் கண்டறிய வேண்டும் • அதிர்வு - சாதனம் அதிர்வு பயன்முறையில் இருக்கும்போது சோதனை அம்சத்திற்கு தேவை Audio ஆடியோ அமைப்புகளை மாற்றவும் - மேம்பட்ட கம்பி எட்செட் கண்டறிதலுக்கு தேவை Phone தொலைபேசி நிலையைப் படியுங்கள் - தொலைபேசி அழைப்பு செயலில் இருந்தால் TTS ஐ குறுக்கிட வேண்டும் [Android 11 மற்றும் கீழே]

source: ABOUT AUDIO STREAM OPTION: Behavior of audio streams may vary by device or Android version, so I advise doing your own testing to determine which stream is right for you. The Media stream (default) should be good for most people.
ta: ஆடியோ ச்ட்ரீம் விருப்பம் பற்றி: ஆடியோ ச்ட்ரீம்களின் நடத்தை சாதனம் அல்லது ஆண்ட்ராய்டு பதிப்பின் மூலம் மாறுபடலாம், எனவே எந்த ச்ட்ரீம் உங்களுக்கு சரியானது என்பதை தீர்மானிக்க உங்கள் சொந்த சோதனையைச் செய்ய நான் அறிவுறுத்துகிறேன். மீடியா ச்ட்ரீம் (இயல்புநிலை) பெரும்பாலான மக்களுக்கு நல்லது.

source: DISCLAIMER: Voice Notify developers are not responsible for the notifications that are announced. Options are provided to help prevent unwanted announcing of notifications. Use at your own risk!
ta: மறுப்பு: அறிவிக்கப்பட்ட அறிவிப்புகளுக்கு குரல் அறிவிப்பு உருவாக்குபவர்கள் பொறுப்பல்ல. தேவையற்ற அறிவிப்புகளை அறிவிப்பதைத் தடுக்க உதவும் விருப்பங்கள் வழங்கப்படுகின்றன. உங்கள் சொந்த ஆபத்தில் பயன்படுத்தவும்!

source: PROBLEMS: Please report issues at: https://github.com/pilot51/voicenotify/issues If necessary, you can install any version from the releases section on GitHub: https://github.com/pilot51/voicenotify/releases
ta: சிக்கல்கள்: சிக்கல்களைப் புகாரளிக்கவும்: https://github.com/pilot51/voicenotify/issues தேவைப்பட்டால், கிதுபில் வெளியீடுகள் பிரிவில் இருந்து எந்த பதிப்பையும் நிறுவலாம்: https://github.com/pilot51/voicenotify/relases

source: SOURCE CODE: Voice Notify is open source under the Apache License. https://github.com/pilot51/voicenotify Code contributor details can be found at https://github.com/pilot51/voicenotify/graphs/contributors
ta: மூலக் குறியீடு: குரல் அறிவிப்பு அப்பாச்சி உரிமத்தின் கீழ் திறந்த மூலமாகும். https://github.com/pilot51/voicenotify குறியீடு பங்களிப்பாளர் விவரங்களை https://github.com/pilot51/voicenotify/graphs/contributors இல் காணலாம்

source: TRANSLATIONS: The app is written in US English.
ta: மொழிபெயர்ப்பு: பயன்பாடு அமெரிக்க ஆங்கிலத்தில் எழுதப்பட்டுள்ளது.

source: Translations are crowdsourced at https://hosted.weblate.org/projects/voice-notify
ta: மொழிபெயர்ப்புகள் https://hosted.weblate.org/projects/voice-sotify இல் கூட்டமாக உள்ளன

source: Translation completion (20 languages): 100%: None At least 80%: Chinese (Simplified Han), Hebrew, Japanese, Spanish At least 50%: Finnish, French, German, Hindi, Indonesian, Italian, Norwegian (Bokmål), Polish, Russian, Vietnamese Below 50%: Czech, Dutch, Greek, Hungarian, Malay, Portuguese
ta: மொழிபெயர்ப்பு நிறைவு (20 மொழிகள்): 100%: எதுவுமில்லை குறைந்தது 80%: சீன (எளிமைப்படுத்தப்பட்ட ஆன்), எபிரேய, சப்பானிய, ச்பானிச் குறைந்தது 50%: பின்னிச், பிரஞ்சு, செர்மன், இந்தி, இந்தோனேசிய, இத்தாலியன், நோர்வே (போக்மால்), போலந்து, ரச்ய, வியட்நாமிய 50%க்குக் கீழே: செக், டச்சு, கிரேக்கம், அங்கேரிய, மலாய், போர்த்துகீசியம்

source: Thank you to all of the developers, translators, and testers who donated their time to help make Voice Notify better!
ta: குரலை சிறப்பாக அறிவிக்க உதவுவதற்காக தங்கள் நேரத்தை நன்கொடையாக வழங்கிய உருவாக்குபவர்கள், மொழிபெயர்ப்பாளர்கள் மற்றும் சோதனையாளர்கள் அனைவருக்கும் நன்றி!
