Repository: 247i/TACETr
Catalog: உரை/தானி/wallabag-craue-config-*.po
Languages: ta

# settings_changed
source: Configuration updated
ta: உள்ளமைவு புதுப்பிக்கப்பட்டது

# download_pictures
source: Download pictures onto your server
ta: உங்கள் சேவையகத்தில் படங்களை பதிவிறக்கவும்

# diaspora_url
source: diaspora* URL, if the service is enabled
ta: டயச்போரா* முகவரி, பணி இயக்கப்பட்டிருந்தால்

# export_epub
source: Enable ePub export
ta: EPUB ஏற்றுமதியை இயக்கவும்

# export_pdf
source: Enable PDF export
ta: PDF ஏற்றுமதியை இயக்கவும்

# export_csv
source: Enable CSV export
ta: காபிம ஏற்றுமதியை இயக்கவும்

# export_json
source: Enable JSON export
ta: சாதொபொகு ஏற்றுமதியை இயக்கவும்

# export_txt
source: Enable TXT export
ta: TXT ஏற்றுமதியை இயக்கவும்

# export_xml
source: Enable XML export
ta: எக்ச்எம்எல் ஏற்றுமதியை இயக்கவும்

# import_with_rabbitmq
source: Enable RabbitMQ to import data asynchronously
ta: ஒத்திசைவற்ற முறையில் தரவை இறக்குமதி செய்ய ராபிட்எம்.கியூவை இயக்கவும்

# import_with_redis
source: Enable Redis to import data asynchronously
ta: ஒத்திசைவற்ற முறையில் தரவை இறக்குமதி செய்ய ரெடிசை இயக்கவும்

# shaarli_url
source: Shaarli URL, if the service is enabled
ta: சார்லி முகவரி, பணி இயக்கப்பட்டிருந்தால்

# unmark_url
source: Unmark URL, if the service is enabled
ta: பணி இயக்கப்பட்டிருந்தால், முகவரி ஐ குறைக்கிறது

# share_diaspora
source: Enable share to diaspora*
ta: புலம்பெயர்ந்தோருக்கு பங்கை இயக்கவும்*

# share_mail
source: Enable share by e-mail
ta: மின்னஞ்சல் மூலம் பங்கை இயக்கவும்

# share_shaarli
source: Enable sharing to Shaarli
ta: சார்லிக்கு பகிர்வை இயக்கவும்

# share_twitter
source: Enable sharing to Twitter
ta: ட்விட்டருக்கு பகிர்வதை இயக்கவும்

# share_unmark
source: Enable sharing to Unmark.it
ta: Unmark.it க்கு பகிர்வை இயக்கவும்

# share_linkding
source: Enable sharing to Linkding
ta: லிங்க்ட்இனுக்கு பகிர்வதை இயக்கவும்

# show_printlink
source: Display a link to print content
ta: உள்ளடக்கத்தை அச்சிட இணைப்பைக் காண்பி

# wallabag_support_url
source: Support URL for wallabag
ta: வாலபேக்கிற்கான முகவரி ஐ ஆதரிக்கவும்

# entry
source: article
ta: கட்டுரை

source: export
ta: ஏற்றுமதி

source: import
ta: இறக்குமதி

source: misc
ta: இதர

# modify_settings
source: apply
ta: இடு

# matomo_host
source: Host of your website in Matomo (without http:// or https://)
ta: Matomo இல் உங்கள் வலைத்தளத்தின் புரவலன் (http: // அல்லது https: // இல்லாமல்)

# matomo_site_id
source: ID of your website in Matomo
ta: மாடோமோவில் உங்கள் வலைத்தளத்தின் ஐடி

# matomo_enabled
source: Enable Matomo
ta: மாடோமோவை இயக்கவும்

# share_public
source: Allow public URLs for entries
ta: உள்ளீடுகளுக்கு பொது முகவரி களை அனுமதிக்கவும்

# download_images_enabled
source: Download images locally
ta: படங்களை உள்ளூரில் பதிவிறக்கவும்

# restricted_access
source: Enable authentication for paywalled websites
ta: செலுத்தப்பட்ட வலைத்தளங்களுக்கான அங்கீகாரத்தை இயக்கவும்

# api_user_registration
source: Turn on user registration via the API
ta: பநிஇ வழியாக பயனர் பதிவை இயக்கவும்

# store_article_headers
source: Enable if wallabag stores HTTP headers for each article
ta: ஒவ்வொரு கட்டுரைக்கும் வாலபாக் HTTP தலைப்புகளை சேமித்து வைத்தால் இயக்கவும்

# shaarli_share_origin_url
source: Enable sharing origin URL to Shaarli, if the service is enabled
ta: பணி இயக்கப்பட்டிருந்தால், சார்லிக்கு பகிர்வு தோற்றம் முகவரி ஐ இயக்கவும்
