Repository: 247i/TACETr
Catalog: உரை/தானி/wallabag-android-app-*.po
Languages: ta

# app_name
source: wallabag
ta: வாலபாக்

# btnMarkRead
source: Mark as Read
ta: படித்தபடி குறி

# btnMarkUnread
source: Mark as Unread
ta: படிக்காத எனக் குறிக்கவும்

source: Add to Favorites
ta: பிடித்தவைகளில் சேர்க்கவும்

source: Remove from Favorites
ta: பிடித்தவைகளிலிருந்து அகற்று

# menuShare
source: Share
ta: பங்கு

# menuNext
source: Next article
ta: அடுத்த கட்டுரை

# menuPrevious
source: Previous article
ta: முந்தைய கட்டுரை

# menuDelete
source: Delete
ta: அழி

# menuOpenOriginal
source: Open original
ta: திறந்த அசல்

# menuCopyOriginalURL
source: Copy original URL
ta: அசல் முகவரி ஐ நகலெடுக்கவும்

# menuTTS
source: Text To Speech
ta: பேச்சுக்கு உரை

# ttsSpeed
source: Rate
ta: விகிதம்

# ttsPitch
source: Pitch
ta: குனிவு

# ttsVolume
source: Volume
ta: தொகுதி

# ttsLanguage
source: Choose Language
ta: மொழியைத் தேர்வுசெய்க

# ttsVoice
source: Choose Voice
ta: குரலைத் தேர்வுசெய்க

# ttsAutoplayNextArticle
source: AutoPlay Next Article
ta: தன்னியக்க அடுத்த கட்டுரை

# ttsError
source: Text To Speech Error
ta: பேச்சு பிழைக்கு உரை

# ttsFastRewind
source: Fast Rewind
ta: வேகமான முன்னாடி

# ttsPlayPause
source: Play / Pause
ta: விளையாடு / இடைநிறுத்தம்

# ttsFastForward
source: Fast Forward
ta: வேகமாக முன்னோக்கி

# ttsOptions
source: Options
ta: விருப்பங்கள்

# menu_open_random_article
source: Open random article
ta: சீரற்ற கட்டுரையைத் திறக்கவும்

# menu_syncLocalChanges
source: Sync local changes
ta: உள்ளக மாற்றங்களை ஒத்திசைக்கவும்

# d_deleteArticle_title
source: Delete article?
ta: கட்டுரையை நீக்கவா?

# d_deleteArticle_message
source: Are you sure you want to delete the article?
ta: நீங்கள் நிச்சயமாக கட்டுரையை நீக்க விரும்புகிறீர்களா?

# txtNetOffline
source: Make sure you are connected to the Internet first.
ta: நீங்கள் முதலில் இணையத்துடன் இணைக்கப்பட்டுள்ளீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# txtConfigNotSet
source: Set up the app before syncing.
ta: ஒத்திசைவதற்கு முன் பயன்பாட்டை அமைக்கவும்.

# txtUrlCopied
source: Article URL copied to clipboard
ta: கட்டுரை முகவரி கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டது

# dialog_add_label
source: Add a new article
ta: புதிய கட்டுரையைச் சேர்க்கவும்

source: Page URL
ta: பக்க முகவரி

# share_article_title
source: Share article
ta: கட்டுரை பகிர்ந்து கொள்ளுங்கள்

# share_text_extra
source: via @wallabagapp
ta: @Wallabagapp வழியாக

# positive_answer
source: Yes
ta: ஆம்

# negative_answer
source: No
ta: இல்லை

source: No articles
ta: கட்டுரைகள் இல்லை

# loading_article_text
source: Loading…
ta: ஏற்றுகிறது…

# d_urlAction_title
source: Select an action for URL
ta: முகவரி க்கு ஒரு செயலைத் தேர்ந்தெடுக்கவும்

# d_urlAction_openInBrowser
source: Open in browser
ta: உலாவியில் திற

# d_urlAction_addToWallabag
source: Add to wallabag
ta: வாலபாக் சேர்க்கவும்

# d_urlAction_copyToClipboard
source: Copy to clipboard
ta: கிளிப்போர்டுக்கு நகலெடுக்கவும்

source: OK
ta: சரி

# d_add_fail_title
source: Fail
ta: தோல்வி

# d_add_fail_text
source: Couldn't find a URL in share string:
ta: Couldn't கண்டுபிடி a முகவரி in பங்கு string:

# d_configurationChanged_title
source: Parameters changed
ta: அளவுருக்கள் மாற்றப்பட்டன

# d_configurationChanged_message
source: Test the connection to check if the new parameters work.
ta: தேர்வு the connection பெறுநர் சரிபார் if the புதிய parameters work.

# d_configurationChanged_answer_decline
source: Not now
ta: இப்போது இல்லை

# d_configurationIsQuestionable_title
source: Problem detected
ta: சிக்கல் கண்டறியப்பட்டது

# d_configurationIsQuestionable_message
source: There was a connection error recently. It is recommended to perform a connection test.
ta: There was a connection பிழை recently. It is recommended பெறுநர் perform a connection test.

# addLink_success_text
source: Added
ta: சேர்க்கப்பட்டது

# settings_parametersAreOk
source: The parameters are fine
ta: The parameters அரே fine

# settings_parametersAutofilled
source: Parameters filled
ta: அளவுருக்கள் நிரப்பப்பட்டன

# testConnection_progressDialogMessage
source: Testing connection…
ta: சோதனை இணைப்பு…

# testConnection_errorMessage_incorrectUrl
source: Incorrect URL
ta: Incorrect முகவரி

# testConnection_errorMessage_unsupportedServerVersion
source: The server version is unsupported
ta: The சேவையகம் version is unsupported

# testConnection_errorMessage_wallabagNotFound
source: Could not find wallabag service — check URL
ta: Could not கண்டுபிடி wallabag பணி — சரிபார் முகவரி

# testConnection_errorMessage_httpAuth
source: HTTP authentication failed
ta: HTTP ஏற்பு தோல்வியடைந்தது

# testConnection_errorMessage_noCSRF
source: Could not parse login form
ta: Could not பாகுபடுத்தல் புகுபதிவு form

# testConnection_errorMessage_incorrectCredentials
source: Can't log in — check username and password
ta: Can't log in — சரிபார் username and password

# testConnection_errorMessage_authProblems
source: Could not log in (usually caused by HTTP-redirections)
ta: உள்நுழைய முடியவில்லை (பொதுவாக HTTP-Redirections காரணமாக ஏற்படுகிறது)

# testConnection_errorMessage_unknownPageAfterLogin
source: Unknown page after login. Usually caused by two-factor authentication (which the app doesn't support yet).
ta: தெரியவில்லை page after login. Usually caused by two-factor authentication (which the பயன்பாடு doesn't support yet).

# testConnection_errorMessage_unknown
source: Unknown error
ta: தெரியவில்லை பிழை

# testConnection_errorMessage_unknownWithMessage
source: Unknown error: %s
ta: தெரியவில்லை error: %s

# d_testConnection_urlSuggestion_title
source: Consider changing URL
ta: Consider changing முகவரி

# d_testConnection_urlSuggestion_acceptButton
source: Use suggested
ta: பரிந்துரைக்கப்பட்ட பயன்படுத்தவும்

# d_testConnection_urlSuggestion_declineButton
source: Use mine
ta: என்னுடையது பயன்படுத்தவும்

# d_testConnection_urlSuggestion_cancelButton
source: Cancel
ta: ரத்துசெய்

# d_testConnection_urlSuggestion_message
source: Changing the URL to %s is recommended over using the entered one.
ta: உள்ளிட்ட ஒன்றைப் பயன்படுத்துவதற்கு முகவரி ஐ %s ஆக மாற்ற பரிந்துரைக்கப்படுகிறது.

# d_testConnection_urlSuggestion_message_mandatory
source: It is suggested to change URL to: %s
ta: முகவரி ஐ மாற்ற பரிந்துரைக்கப்படுகிறது: %s

# d_testConnection_fail_title
source: Connection test failed
ta: இணைப்பு சோதனை தோல்வியடைந்தது

# getCredentials_progressDialogMessage
source: Getting API credentials…
ta: பநிஇ நற்சான்றிதழ்களைப் பெறுதல்…

# d_getCredentials_title_fail
source: Couldn't get API credentials
ta: பநிஇ நற்சான்றிதழ்களைப் பெற முடியவில்லை

# d_getCredentials_title_message
source: Something went wrong. Check your Internet connection and try again.
ta: ஏதோ தவறு நடந்தது. உங்கள் இணைய இணைப்பை சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# checkCredentials_progressDialogMessage
source: Testing API access…
ta: பநிஇ அணுகலை சோதித்தல்…

# d_checkCredentials_title_fail
source: API access test failed
ta: பநிஇ அணுகல் சோதனை தோல்வியடைந்தது

# d_checkCredentials_errorMessage_notFound
source: API not found
ta: பநிஇ காணப்படவில்லை

# d_checkCredentials_errorMessage_notFoundWithMessage
source: API not found: %s
ta: பநிஇ காணப்படவில்லை: %s

# d_checkCredentials_errorMessage_noAccess
source: No access to API
ta: பநிஇ க்கு அணுகல் இல்லை

# d_checkCredentials_errorMessage_noAccessWithMessage
source: No access to API: %s
ta: பநிஇ க்கு அணுகல் இல்லை: %s

# d_checkCredentials_errorMessage_unknown
source: Unknown error
ta: தெரியாத பிழை

# d_checkCredentials_errorMessage_unknownWithMessage
source: Unknown error: %s
ta: தெரியாத பிழை: %s

# wrongUsernameOrPassword_errorMessage
source: Couldn't log in. Maybe the username or password is wrong?
ta: உள்நுழைய முடியவில்லை. பயனர்பெயர் அல்லது கடவுச்சொல் தவறாக இருக்கலாம்?

# previousUpdateNotFinished
source: Previous update not finished yet
ta: முந்தைய புதுப்பிப்பு இன்னும் முடிக்கப்படவில்லை

# feedName_favorites
source: Favorites
ta: பிடித்தவை

# feedName_archived
source: Archived
ta: காப்பகப்படுத்தப்பட்டது

# feedName_unread
source: Unread
ta: படிக்காதது

# articleList_favoriteMark
source: Favorite mark
ta: பிடித்த குறி

# articleList_ArchivedMark
source: Archived mark
ta: காப்பகப்படுத்தப்பட்ட குறி

# noPreviousArticle
source: There is no previous article in current list
ta: தற்போதைய பட்டியலில் முந்தைய கட்டுரை எதுவும் இல்லை

# scrolledOverBottom
source: Scroll %d more time(s) past the bottom to mark article as read
ta: உருட்டல் %d அதிக நேரம் (கள்) கட்டுரையைப் படிக்க கீழே குறிக்கவும்

# markedAsRead
source: Article marked as read
ta: கட்டுரை வாசிப்பு என குறிக்கப்பட்டுள்ளது

# noNextArticle
source: No more articles in current list
ta: தற்போதைய பட்டியலில் மேலும் கட்டுரைகள் இல்லை

# themeName_light
source: Light
ta: ஒளி

# themeName_light_contrast
source: Light (high contrast)
ta: ஒளி (உயர் மாறுபாடு)

# themeName_eink
source: For e-ink displays
ta: மின்-மை காட்சிகளுக்கு

# themeName_dark
source: Dark
ta: இருண்ட

# themeName_dark_contrast
source: Dark (high contrast)
ta: இருண்ட (உயர் மாறுபாடு)

# themeName_solarized
source: Solarized
ta: சோலரிச்

# menu_readArticle_increaseFontSize
source: Increase font size
ta: எழுத்துரு அளவை அதிகரிக்கவும்

# menu_readArticle_decreaseFontSize
source: Decrease font size
ta: எழுத்துரு அளவைக் குறைக்கவும்

# aboutText
source: <b>wallabag app for Android</b> wallabag is a self-hostable app, allowing you to not miss any content anymore. Click, save and read the extracted content at your leisure.
ta: <b> ஆண்ட்ராய்டுக்கான வாலபாக் பயன்பாடு </b> வாலபாக் ஒரு சுய-ஓச்டபிள் பயன்பாடாகும், இது இனி எந்த உள்ளடக்கத்தையும் தவறவிடக்கூடாது. உங்கள் ஓய்வு நேரத்தில் பிரித்தெடுக்கப்பட்ட உள்ளடக்கத்தை சொடுக்கு செய்து, சேமிக்கவும் படிக்கவும்.

source: Read speed
ta: வேகத்தைப் படியுங்கள்

# voiceHeight
source: Voice pitch
ta: குரல் சுருதி

source: Read volume
ta: தொகுதி படிக்கவும்

# menuDownloadAsFile
source: Download as file
ta: கோப்பாக பதிவிறக்கவும்

# dialog_title_downloadFileFormat
source: Select file format
ta: கோப்பு வடிவமைப்பைத் தேர்ந்தெடுக்கவும்

# downloadAsFilePathStart
source: Downloading article
ta: கட்டுரை பதிவிறக்குகிறது

# downloadAsFileArticleDownloaded
source: Article downloaded
ta: கட்டுரை பதிவிறக்கம் செய்யப்பட்டது

# downloadAsFileArticleDownloadedDetail
source: Article %s downloaded
ta: கட்டுரைகள் பதிவிறக்கம்

# downloadAsFileTouchToOpen
source: Touch to open
ta: திறக்கத் தொடவும்

# downloadAsFileProgressDetail
source: wallabag downloads your article %1$s in %2$s
ta: வாலபாக் உங்கள் கட்டுரையை %1 $ s %2 $ s இல் பதிவிறக்குகிறது

# downloadAsFileProgress
source: wallabag downloads your article in %s
ta: வாலபாக் உங்கள் கட்டுரையை %s இல் பதிவிறக்குகிறார்

# notification_updatingArticles
source: Updating articles
ta: கட்டுரைகளைப் புதுப்பித்தல்

# notification_updatingArticles_full
source: Performing full update
ta: முழு புதுப்பிப்பைச் செய்கிறது

# notification_updatingArticles_fast
source: Performing fast update
ta: விரைவான புதுப்பிப்பை செய்கிறது

# notification_sweepingDeletedArticles
source: Sweeping deleted articles
ta: நீக்கப்பட்ட கட்டுரைகள்

# notification_downloadingImages
source: Downloading images…
ta: படங்களைப் பதிவிறக்குகிறது…

# notification_syncingQueue
source: Syncing local changes…
ta: உள்ளக மாற்றங்களை ஒத்திசைக்கிறது…

# notification_backgroundOperations
source: Background operations
ta: பின்னணி செயல்பாடுகள்

# notification_error
source: Error
ta: பிழை

# notification_incorrectCredentials
source: Incorrect credentials
ta: தவறான நற்சான்றிதழ்கள்

# notification_incorrectConfiguration
source: Incorrect configuration
ta: தவறான உள்ளமைவு

# notification_serverError
source: Server error
ta: சேவையக பிழை

# notification_unknownError
source: Unknown error
ta: தெரியாத பிழை

# notification_expandedError
source: Error: %s
ta: பிழை: %s

# notification_channel_group_name_sync
source: Syncing
ta: ஒத்திசைவு

# notification_channel_group_name_other
source: Other
ta: மற்றொன்று

# notification_channel_name_tts
source: wallabag TTS
ta: வாலபாக் டி.டி.எச்

# notification_channel_name_sync
source: Syncing
ta: ஒத்திசைவு

# notification_channel_name_downloading_articles
source: Downloading PDFs
ta: PDFS ஐ பதிவிறக்குகிறது

# notification_channel_name_background_operations
source: Background operations
ta: பின்னணி செயல்பாடுகள்

# notification_channel_name_error
source: Errors
ta: பிழைகள்

# menu_lists_search
source: Search
ta: தேடல்

# menu_lists_changeSortOrder
source: Change sort order
ta: வரிசை வரிசையை மாற்றவும்

# menu_lists_sweepDeletedArticles
source: "Sweep" deleted articles
ta: "ச்வீப்" நீக்கப்பட்ட கட்டுரைகள்

# menu_lists_fullUpdate
source: Full update
ta: முழு புதுப்பிப்பு

# other_searchHint
source: Search by article title or text
ta: கட்டுரை தலைப்பு அல்லது உரை மூலம் தேடுங்கள்

# menu_changeTitle
source: Change title
ta: தலைப்பை மாற்றவும்

# menu_manageTags
source: Manage tags
ta: குறிச்சொற்களை நிர்வகிக்கவும்

# manageTags_title
source: Manage tags
ta: குறிச்சொற்களை நிர்வகிக்கவும்

# manageTags_save
source: Save
ta: சேமி

# manageTags_textField_hint
source: One or more (comma-separated) tags
ta: ஒன்று அல்லது அதற்கு மேற்பட்ட (கமாவால் பிரிக்கப்பட்ட) குறிச்சொற்கள்

# manageTags_addNew
source: Add
ta: கூட்டு

# manageTags_currentTags
source: Selected tags:
ta: தேர்ந்தெடுக்கப்பட்ட குறிச்சொற்கள்:

# manageTags_currentTags_none
source: None
ta: எதுவுமில்லை

# manageTags_addMoreTags
source: Add more tags:
ta: மேலும் குறிச்சொற்களைச் சேர்க்கவும்:

# content_estimatedReadingTimeTTSLabel
source: Estimated reading time
ta: மதிப்பிடப்பட்ட வாசிப்பு நேரம்

# lastUpdateTimeLabel
source: Last update: %s
ta: கடைசி புதுப்பிப்பு: %s

# listItem_estimatedReadingTime
source: %d min
ta: %D மணித்துளி

# navigation_drawer_open
source: Open navigation drawer
ta: திறந்த வழிசெலுத்தல் அலமாரியை

# navigation_drawer_close
source: Close navigation drawer
ta: வழிசெலுத்தல் அலமாரியை மூடு

# nav_main_articles
source: Articles
ta: கட்டுரைகள்

# nav_main_tags
source: Tags
ta: குறிச்சொற்கள்

# nav_main_tagged_articles
source: Tagged articles
ta: குறிச்சொல் கட்டுரைகள்

# nav_add
source: Add new entry
ta: புதிய நுழைவைச் சேர்க்கவும்

# nav_other_settings
source: Settings
ta: அமைப்புகள்

# nav_other_about
source: About
ta: பற்றி

# title_main_tag
source: Tag: %s
ta: குறிச்சொல்: %s

# message_couldNotOpenUrl
source: Couldn't open this URL
ta: இந்த முகவரி ஐ திறக்க முடியவில்லை

# message_disableTouch_inputDisabled
source: Touch input off
ta: உள்ளீட்டைத் தொடவும்

# message_disableTouch_inputEnabled
source: Touch input on
ta: உள்ளீட்டைத் தொடவும்

# d_disableTouch_changeKey_title
source: Button to turn off touch input
ta: தொடு உள்ளீட்டை அணைக்க பொத்தான்

# d_disableTouch_currentCode
source: Currently selected key-code (press a button to change it):
ta: தற்போது தேர்ந்தெடுக்கப்பட்ட விசை குறியீடு (அதை மாற்ற ஒரு பொத்தானை அழுத்தவும்):

# pref_name_runConnectionWizard
source: Run connection wizard
ta: இணைப்பு வழிகாட்டி இயக்கவும்

# pref_desc_runConnectionWizard
source: Helps set up basic connection settings
ta: அடிப்படை இணைப்பு அமைப்புகளை அமைக்க உதவுகிறது

# pref_categoryName_connection
source: Connection
ta: இணைப்பு

# pref_name_connection_url
source: wallabag URL
ta: vallabag முகவரி

# pref_desc_connection_url
source: Examples: https://wallabag.example.com https://example.com/wallabag https://app.wallabag.it
ta: எடுத்துக்காட்டுகள்: https://wallabag.example.com https://example.com/wallabag https://app.wallabag.it

# pref_name_connection_username
source: Username
ta: பயனர்பெயர்

# pref_name_connection_password
source: Password
ta: கடவுச்சொல்

# pref_name_connection_api_clientID
source: Client ID
ta: வாங்கி ஐடி

# pref_name_connection_api_clientSecret
source: Client secret
ta: வாங்கி மறைபொருள்

# pref_name_connection_autofill
source: Auto-fill
ta: ஆட்டோ ஃபில்

# pref_desc_connection_autofill
source: Test connection and fill in client ID and client secret
ta: இணைப்பை சோதித்து கிளையன்ட் ஐடி மற்றும் கிளையன்ட் ரகசியத்தை நிரப்பவும்

# pref_categoryName_connection_advanced
source: Advanced connection settings
ta: மேம்பட்ட இணைப்பு அமைப்புகள்

# pref_categoryName_connection_advanced_httpAuth
source: HTTP Basic authentication
ta: HTTP அடிப்படை ஏற்பு

# pref_categoryDesc_connection_advanced_httpAuth
source: If you don't know what it is, leave it empty
ta: அது என்னவென்று உங்களுக்குத் தெரியாவிட்டால், அதை காலியாக விடவும்

# pref_name_connection_advanced_httpAuthUsername
source: HTTP auth username
ta: Http Auth பயனர்பெயர்

# pref_name_connection_advanced_httpAuthPassword
source: HTTP auth password
ta: Http Auth கடவுச்சொல்

# pref_categoryName_ui
source: UI
ta: இடைமுகம்

# pref_name_ui_theme
source: App theme
ta: பயன்பாட்டு கருப்பொருள்

# pref_name_ui_article_fontSize
source: Article text size (%)
ta: கட்டுரை உரை அளவு (%)

# pref_name_ui_article_fontSerif
source: Serif typeface
ta: செரிஃப் டைப்ஃபேச்

# pref_desc_ui_article_fontSerif
source: Serif font for articles
ta: கட்டுரைகளுக்கான செரிஃப் எழுத்துரு

# pref_name_ui_article_textAlignment_justify
source: Text alignment: Justify
ta: உரை சீரமைப்பு: நியாயப்படுத்துங்கள்

# pref_desc_ui_article_textAlignment_justify
source: Stretches lines to equal width (like in newspapers)
ta: வரிகளை சம அகலத்திற்கு நீட்டுகிறது (செய்தித்தாள்களைப் போல)

# pref_name_ui_article_handlePreformattedText
source: Handling Long Preformatted Text
ta: நீண்ட முன் வடிவமைக்கப்பட்ட உரையை கையாளுதல்

# pref_desc_ui_article_handlePreformattedText
source: How to handle preformatted text too long to show in full.
ta: முன் வடிவமைக்கப்பட்ட உரையை முழுமையாகக் காண்பிப்பது எப்படி.

# pref_name_ui_showArticleAddedDialog
source: Show a dialog when bagging
ta: பேக் செய்யும் போது ஒரு உரையாடலைக் காட்டு

# pref_desc_ui_showArticleAddedDialog
source: Shows a dialog allowing favoriting/archiving/tagging a newly added article (or a toast message otherwise)
ta: புதிதாக சேர்க்கப்பட்ட கட்டுரையை (அல்லது வேறுவிதமாக ஒரு சிற்றுண்டி செய்தி) பிடித்த/காப்பகப்படுத்த/குறிச்சொல் அனுமதிக்கும் உரையாடலைக் காட்டுகிறது

# pref_name_ui_article_fullscreen
source: Fullscreen articles
ta: முழுத்திரை கட்டுரைகள்

# pref_desc_ui_article_fullscreen
source: Hides system and app bars when reading articles
ta: கட்டுரைகளைப் படிக்கும்போது கணினி மற்றும் பயன்பாட்டு பட்டியை மறைக்கவும்

# pref_name_ui_onyxworkaround_enabled
source: Onyx Boox theme workaround
ta: ஓனிக்ச் போக்ச் கருப்பொருள் பணித்தொகுப்பு

# pref_desc_ui_onyxworkaround_enabled
source: Prevent Onyx devices forcing black link colors
ta: கருப்பு இணைப்பு வண்ணங்களை கட்டாயப்படுத்தும் ஓனிக்ச் சாதனங்களைத் தடுக்கவும்

# pref_name_ui_readingSpeed
source: Reading speed
ta: வாசிப்பு விரைவு

# pref_desc_ui_readingSpeed
source: Your reading speed (in words per minute) to show estimated reading time.
ta: மதிப்பிடப்பட்ட வாசிப்பு நேரத்தைக் காட்ட உங்கள் வாசிப்பு விரைவு (நிமிடத்திற்கு வார்த்தைகளில்).

# pref_name_ui_keepScreenOn
source: Keep screen on while reading
ta: படிக்கும்போது திரையை வைத்திருங்கள்

# pref_desc_ui_keepScreenOn
source: Don't let the screen turn off while reading an article
ta: ஒரு கட்டுரையைப் படிக்கும்போது திரையை அணைக்க வேண்டாம்

# pref_categoryName_ui_screenScrolling
source: Screen scrolling
ta: திரை ச்க்ரோலிங்

# pref_name_ui_volumeButtonsScrolling_enabled
source: Go up and down using the volume buttons
ta: தொகுதி பொத்தான்களைப் பயன்படுத்தி மேலும் கீழும் செல்லுங்கள்

# pref_name_ui_tapToScroll_enabled
source: Tap-to-scroll
ta: தட்டவும்-ச்க்ரோல்

# pref_desc_ui_tapToScroll_enabled
source: Go up and down by tapping the left and right screen sides
ta: இடது மற்றும் வலது திரை பக்கங்களைத் தட்டுவதன் மூலம் மேலேயும் கீழேயும் செல்லுங்கள்

# pref_name_ui_screenScrolling_percent
source: Percent of screen height to scroll
ta: திரைக்கு திரை உயரத்தின் விழுக்காடு

# pref_name_ui_screenScrolling_smooth
source: Smooth scrolling
ta: மென்மையான ச்க்ரோலிங்

# pref_categoryName_ui_misc
source: Misc
ta: இதர

# pref_name_ui_disableTouch_enabled
source: No touch input
ta: தொடு உள்ளீடு இல்லை

# pref_desc_ui_disableTouch_enabled
source: Press the "No touch input" button (camera button by default) to block or unblock touch input on the reading screen (system controls are unaffected)
ta: வாசிப்புத் திரையில் தொடு உள்ளீட்டைத் தடுக்க அல்லது தடுக்க "டச் உள்ளீடு" பொத்தானை (இயல்பாக கேமரா பொத்தான்) அழுத்தவும் (கணினி கட்டுப்பாடுகள் பாதிக்கப்படாது)

# pref_name_ui_disableTouch_keyCode
source: "No touch input" button
ta: "தொடு உள்ளீடு இல்லை" பொத்தான்

# pref_desc_ui_disableTouch_keyCode
source: Select a button to turn on and off touch input
ta: தொடு உள்ளீட்டை இயக்கவும் முடக்கவும் ஒரு பொத்தானைத் தேர்ந்தெடுக்கவும்

# pref_name_ui_scrollOverBottom
source: Scroll past bottom to mark as read
ta: படிக்க கடந்த காலத்தை உருட்டவும்

# pref_desc_ui_scrollOverBottom
source: Set how many times scrolling past the bottom marks an article as read
ta: கீழே எத்தனை முறை ச்க்ரோலிங் செய்வது ஒரு கட்டுரையைப் படித்ததாகக் குறிக்கிறது

# pref_name_ui_swipeArticles
source: Swipe Articles
ta: கட்டுரைகளை ச்வைப் செய்யவும்

# pref_desc_ui_swipeArticles
source: Swipe ← or → inside an article to go to previous or next article
ta: முந்தைய அல்லது அடுத்த கட்டுரைக்குச் செல்ல ஒரு கட்டுரையின் உள்ளே ச்வைப் ← அல்லது →

# pref_name_ui_previewImage_enabled
source: Preview Image
ta: படம் முன்னோட்டம்

# pref_desc_ui_previewImage_enabled
source: Display the preview image before the article
ta: கட்டுரைக்கு முன் முன்னோட்டப் படத்தைக் காண்பி

# pref_name_ui_annotations_enabled
source: Annotation support
ta: சிறுகுறிப்பு உதவி

# pref_desc_ui_annotations_enabled
source: Experimental! See, edit and create annotations
ta: சோதனை! சிறுகுறிப்புகளைப் பார்க்கவும், திருத்தவும் உருவாக்கவும்

# pref_name_ui_mathRendering_enabled
source: Math rendering
ta: கணித வழங்குதல்

# pref_desc_ui_mathRendering_enabled
source: LaTeX-math rendering via KaTeX
ta: கேடெக்ச் வழியாக லேடெக்ச்-கணித வழங்குதல்

# pref_name_ui_mathRendering_delimiters
source: Math delimiters
ta: கணித டிலிமிட்டர்கள்

# pref_desc_ui_mathRendering_delimiters
source: Select the environment delimiters KaTeX should process
ta: சுற்றுச்சூழல் டிலிமிட்டர்களைத் தேர்ந்தெடுக்கவும் Katex செயலாக்க வேண்டும்

# pref_categoryName_tts
source: Text-to-speech
ta: உரை-க்கு-பேச்சு

# pref_name_tts_fastForwardTime
source: Fast-forward skip time
ta: வேகமாக முன்னோக்கி தவிர் நேரம்

# pref_desc_tts_fastForwardTime
source: Number of seconds pressing "Fast Forward" skips forwards
ta: "ஃபாச்ட் ஃபார்வர்ட்" ஐ அழுத்தும் விநாடிகளின் எண்ணிக்கை முன்னோக்கி தவிர்க்கிறது

# pref_name_tts_rewindTime
source: Rewind skip time
ta: ரிவைண்ட் ச்கிப் நேரத்தை

# pref_desc_tts_rewindTime
source: Number of seconds pressing "Rewind" skips backwards
ta: "ரிவைண்ட்" ஐ அழுத்தும் விநாடிகளின் எண்ணிக்கை பின்னோக்கி தவிர்க்கும்

# pref_name_tts_nextButtonIsFastForward
source: "Next" button fast-forwards
ta: "அடுத்த" பொத்தான் வேகமாக முன்னோக்கி

# pref_desc_tts_nextButtonIsFastForward
source: Pressing "Next" media button fast-forwards instead of skipping to next article
ta: அடுத்த கட்டுரையைத் தவிர்ப்பதற்கு பதிலாக "அடுத்த" மீடியா பொத்தானை வேகமாக முன்னோக்கி அழுத்துகிறது

# pref_name_tts_previousButtonIsRewind
source: "Previous" button rewinds
ta: "முந்தைய" பொத்தான் முன்னேற்றம்

# pref_desc_tts_previousButtonIsRewind
source: Pressing "Previous" media button rewinds instead of skipping to previous article
ta: முந்தைய கட்டுரையைத் தவிர்ப்பதற்குப் பதிலாக "முந்தைய" மீடியா பொத்தானை மறுபரிசீலனை செய்கிறது

# pref_name_tts_showPreviewAsAlbumArt
source: Preview image as album art
ta: ஆல்பம் கலையாக படத்தை முன்னோட்டமிடுங்கள்

# pref_desc_tts_showPreviewAsAlbumArt
source: Use article preview picture (if present) as the album cover-art (shown in the notification and possibly as lock-screen background)
ta: ஆல்பம் கவர்-கலை என கட்டுரை முன்னோட்டப் படத்தை (இருந்தால்) பயன்படுத்தவும் (அறிவிப்பில் காட்டப்பட்டுள்ளது மற்றும் பூட்டு-திரை பின்னணியாக இருக்கலாம்)

# pref_categoryName_sync
source: Syncing
ta: ஒத்திசைவு

# pref_name_sync_syncTypes
source: Ways to sync
ta: ஒத்திசைக்க வழிகள்

# pref_desc_sync_syncTypes
source: Press for more info about syncing types
ta: ஒத்திசைவு வகைகளைப் பற்றிய கூடுதல் தகவலுக்கு அழுத்தவும்
