Repository: 247i/TACETr
Catalog: உரை/தானி/wallabag-android-app-*.po
Languages: ta

# pref_desc_sync_syncTypes_text
source: "Full" and "Fast" are the two main syncing types. "Full" deletes all local content and re-downloads it. (The option is there in the menu as a last resort.) "Fast" (incremental) downloads any changes made since the previous sync to save time and bandwidth. It can't detect and delete remotely deleted articles. (Pull ↓ beyond the top position scrollbar in any article list to use it). Use "Deleted article sweep" to auto-remove any local articles not found on the server. Takes a while, but saves traffic over the "Full" sync. Local changes are always synced from the client to the server before updating local content (if it fails, nothing is lost).
ta: "முழு" மற்றும் "வேகமாக" இரண்டு முக்கிய ஒத்திசைவு வகைகள். "முழு" அனைத்து உள்ளக உள்ளடக்கங்களையும் நீக்கிவிட்டு அதை மீண்டும் ஏற்றுகிறது. (விருப்பம் பட்டியலில் கடைசி முயற்சியாக உள்ளது.) "ஃபாச்ட்" (அதிகரிக்கும்) நேரம் மற்றும் அலைவரிசையை மிச்சப்படுத்த முந்தைய ஒத்திசைவிலிருந்து செய்யப்பட்ட எந்த மாற்றங்களையும் பதிவிறக்குகிறது. தொலைதூர நீக்கப்பட்ட கட்டுரைகளை இது கண்டறிந்து நீக்க முடியாது. (அதைப் பயன்படுத்த எந்த கட்டுரை பட்டியலிலும் மேல் நிலை சுருளுக்கு அப்பால் இழுக்கவும்). சேவையகத்தில் காணப்படாத எந்தவொரு உள்ளக கட்டுரைகளையும் தானாக அகற்ற "நீக்கப்பட்ட கட்டுரை ச்வீப்" ஐப் பயன்படுத்தவும். சிறிது நேரம் எடுக்கும், ஆனால் "முழு" ஒத்திசைவின் மீது போக்குவரத்தை மிச்சப்படுத்துகிறது. உள்ளக உள்ளடக்கத்தை புதுப்பிப்பதற்கு முன்பு உள்ளக மாற்றங்கள் எப்போதும் கிளையண்டிலிருந்து சேவையகத்துடன் ஒத்திசைக்கப்படுகின்றன (அது தோல்வியுற்றால், எதுவும் இழக்கப்படவில்லை).

# pref_name_sync_sweepingAfterFastSync_enabled
source: "Deleted article sweep" after "Fast" sync
ta: "ஃபாச்ட்" ஒத்திசைவுக்குப் பிறகு "நீக்கப்பட்ட கட்டுரை ச்வீப்"

# pref_desc_sync_sweepingAfterFastSync_enabled
source: The description of different sync types above has more info
ta: மேலே உள்ள வெவ்வேறு ஒத்திசைவு வகைகளின் விளக்கம் கூடுதல் தகவலைக் கொண்டுள்ளது

# pref_categoryName_autoSync
source: Auto-sync
ta: ஆட்டோ ஒத்திசைவு

# pref_name_autoSync_onStartup_enabled
source: Auto-sync upon app start
ta: பயன்பாட்டு தொடக்கத்தில் தானாக ஒத்திசைவு

# pref_decs_autoSync_onStartup_enabled
source: The app will sync when you open it
ta: நீங்கள் அதைத் திறக்கும்போது பயன்பாடு ஒத்திசைக்கும்

# pref_name_autoSync_enabled
source: Auto-sync
ta: ஆட்டோ ஒத்திசைவு

# pref_desc_autoSync_enabled
source: Syncs local changes (added links, archived articles, etc.) automatically and downloads new articles based on a schedule
ta: உள்ளக மாற்றங்களை ஒத்திசைக்கிறது (சேர்க்கப்பட்ட இணைப்புகள், காப்பகப்படுத்தப்பட்ட கட்டுரைகள் போன்றவை) தானாகவே மற்றும் ஒரு அட்டவணையின் அடிப்படையில் புதிய கட்டுரைகளைப் பதிவிறக்குகின்றன

# pref_name_autoSync_interval
source: Auto-sync interval
ta: ஆட்டோ-ஒத்திசைவு இடைவெளி

# pref_option_autoSync_interval_15m
source: 15 minutes
ta: 15 நிமிடங்கள்

# pref_option_autoSync_interval_30m
source: 30 minutes
ta: 30 நிமிடங்கள்

# pref_option_autoSync_interval_1h
source: 1 hour
ta: 1 மணி நேரம்

# pref_option_autoSync_interval_12h
source: 12 hours
ta: 12 மணி நேரம்

# pref_option_autoSync_interval_24h
source: 24 hours
ta: 24 மணி நேரம்

# pref_name_autoSync_type
source: Auto-sync type
ta: ஆட்டோ-ஒத்திசைவு வகை

# pref_name_autoSyncQueue_enabled
source: Separate auto-sync for local changes
ta: உள்ளக மாற்றங்களுக்கு ஆட்டோ-ஒத்திசைவைப் பிரிக்கவும்

# pref_desc_autoSyncQueue_enabled
source: Syncs local changes (added links, archived articles, etc.) to the server once online again.
ta: உள்ளக மாற்றங்களை (சேர்க்கப்பட்ட இணைப்புகள், காப்பகப்படுத்தப்பட்ட கட்டுரைகள் போன்றவை) ஆன்லைனில் மீண்டும் சேவையகத்துடன் ஒத்திசைக்கிறது.

# pref_name_imageCache_enabled
source: Put article images in cache
ta: கட்டுரை படங்களை தற்காலிக சேமிப்பில் வைக்கவும்

# pref_desc_imageCache_enabled
source: Auto-download all images from every article onto the device (takes up a lot of time and space if the article list is long)
ta: ஒவ்வொரு கட்டுரையிலிருந்தும் எல்லா படங்களையும் சாதனத்தில் தானாக ஏற்றவும் (கட்டுரை பட்டியல் நீளமாக இருந்தால் நிறைய நேரத்தையும் இடத்தையும் எடுக்கும்)

# pref_name_storage_dbPath
source: Database location
ta: தரவுத்தள இடம்

# pref_name_storage_dbPath_internalStorage
source: Internal storage
ta: உள் சேமிப்பு

# pref_name_storage_dbPath_externalStorage
source: External storage: %s
ta: வெளிப்புற சேமிப்பு: %s

# pref_name_storage_dbPath_dbMoved
source: Database moved
ta: தரவுத்தளம் நகர்ந்தது

# pref_categoryName_miscellaneous
source: Miscellaneous
ta: மற்றவை

# pref_name_misc_addTitleToSharedText
source: Add title to shared text
ta: பகிரப்பட்ட உரையில் தலைப்பைச் சேர்க்கவும்

# pref_desc_misc_addTitleToSharedText
source: Add the article title to the shared text
ta: பகிரப்பட்ட உரையில் கட்டுரை தலைப்பைச் சேர்க்கவும்

# pref_name_misc_appendWallabagMention
source: Append wallabag mention
ta: வாலபாக் குறிப்பிடவும்

# pref_desc_misc_appendWallabagMention
source: Append "via @wallabagapp" to shared texts
ta: பகிரப்பட்ட நூல்களில் "@wallabagapp வழியாக" சேர்க்கவும்

# pref_name_misc_handleHttpScheme
source: Handle HTTP scheme
ta: HTTP திட்டத்தை கையாளவும்

# pref_desc_misc_handleHttpScheme
source: Show wallabag in the list of web-browsers
ta: வலை உலாவிகளின் பட்டியலில் வாலபேக்கைக் காட்டு

# pref_name_misc_ftsIcuTokenizer_enabled
source: Use ICU tokenizer for full-text-search
ta: முழு உரை-தேடலுக்கு ஐ.சி.யூ டோக்கனைசரைப் பயன்படுத்தவும்

# pref_desc_misc_ftsIcuTokenizer_enabled
source: Uses ICU tokenizer for full-text-search indexing (generic unicode61 tokenizer is used otherwise). May improve search results for CJK languages. "Full update" is required for the option to take effect.
ta: முழு உரை-தேடல் குறியீட்டுக்கு ஐ.சி.யூ டோக்கனைசரைப் பயன்படுத்துகிறது (பொதுவான யூனிகோட் 61 டோக்கனைசர் இல்லையெனில் பயன்படுத்தப்படுகிறது). சி.சே.கே மொழிகளுக்கான தேடல் முடிவுகளை மேம்படுத்தலாம். விருப்பம் நடைமுறைக்கு வர "முழு புதுப்பிப்பு" தேவை.

# pref_name_misc_wipeDB
source: Clear Database
ta: தரவுத்தளத்தை அழிக்கவும்

# pref_desc_misc_wipeDB
source: Deletes articles and all unsynced local changes and URLs from the local database
ta: உள்ளக தரவுத்தளத்திலிருந்து கட்டுரைகள் மற்றும் அனைத்து கட்டுப்பாடற்ற உள்ளக மாற்றங்கள் மற்றும் முகவரி களை நீக்குகிறது

# pref_name_misc_wipeDB_confirmTitle
source: Clear Database?
ta: தரவுத்தளத்தை அழிக்கவா?

# pref_name_misc_wipeDB_confirmMessage
source: Are you sure you want to clear the database?
ta: தரவுத்தளத்தை அழிக்க விரும்புகிறீர்களா?

# pref_categoryName_misc_localQueue
source: Local changes
ta: உள்ளக மாற்றங்கள்

# pref_name_misc_localQueue_notice
source: Warning
ta: எச்சரிக்கை

# pref_desc_misc_localQueue_notice
source: Don't do anything here unless you know what you're doing!
ta: நீங்கள் என்ன செய்கிறீர்கள் என்று உங்களுக்குத் தெரியாவிட்டால் இங்கே எதுவும் செய்ய வேண்டாம்!

# pref_name_misc_localQueue_dumpToFile
source: Save to file
ta: கோப்பில் சேமிக்கவும்

# pref_desc_misc_localQueue_dumpToFile
source: Saves all local changes to a TXT file (for studying it yourself or attaching it to a bug report)
ta: அனைத்து உள்ளக மாற்றங்களையும் ஒரு TXT கோப்பில் சேமிக்கிறது (அதை நீங்களே படிப்பதற்காக அல்லது பிழை அறிக்கையில் இணைப்பது)

# pref_name_misc_localQueue_removeFirstItem
source: Remove first local queue item
ta: முதல் உள்ளக வரிசை உருப்படியை அகற்று

# pref_desc_misc_localQueue_removeFirstItem
source: Removes the first unsynced item. May help with repeating error notifications during syncing. Tip: Save all local changes to a file first.
ta: முதல் சொல்லப்படாத உருப்படியை நீக்குகிறது. ஒத்திசைவின் போது மீண்டும் மீண்டும் பிழை அறிவிப்புகளுக்கு உதவலாம். உதவிக்குறிப்பு: அனைத்து உள்ளக மாற்றங்களையும் முதலில் ஒரு கோப்பில் சேமிக்கவும்.

# pref_name_misc_logging_logcatToFile
source: Save logcat output to a file
ta: LogCat வெளியீட்டை ஒரு கோப்பில் சேமிக்கவும்

# pref_desc_misc_logging_logcatToFile
source: Saves logcat output (Android app log) to a file in /sdcard/Android/data/fr.gaulupeau.apps.InThePoche/files/
ta: LogCat வெளியீட்டை (Android பயன்பாடு Log) /sdcard/android/data/fr.gaulupeau.apps.inthepoche/files/ இல் உள்ள கோப்பில் சேமிக்கிறது

# misc_localQueue_empty
source: No local changes
ta: உள்ளக மாற்றங்கள் இல்லை

# misc_localQueue_removeFirstItem_done
source: Done
ta: முடிந்தது

# misc_localQueue_dumpToFile_result_dumped
source: Saved as %s
ta: %s ஆக சேமிக்கப்பட்டது

# misc_localQueue_dumpToFile_result_error
source: Error: %s
ta: பிழை: %s

# misc_localQueue_dumpToFile_header
source: Report syncing problems here: %s
ta: இங்கே ஒத்திசைவு சிக்கல்களைப் புகாரளிக்கவும்: %s

# misc_logging_logcatToFile_result_saved
source: Logs saved to %s
ta: பதிவுகள் %s க்கு சேமிக்கப்பட்டன

# misc_logging_logcatToFile_result_error
source: Error: %s
ta: பிழை: %s

# connectionWizard_misc_scanQrCode
source: Scan a QR code
ta: ஒரு QR குறியீட்டை ச்கேன் செய்யுங்கள்

# connectionWizard_misc_scanQrCode_desc
source: Or configure the app using a QR code (available in the "Config" section of the web application)
ta: அல்லது QR குறியீட்டைப் பயன்படுத்தி பயன்பாட்டை உள்ளமைக்கவும் (வலை பயன்பாட்டின் "கட்டமைப்பு" பிரிவில் கிடைக்கிறது)

# connectionWizard_misc_installQrCodeScanner
source: (Install a QR-code scanner first.)
ta: (முதலில் QR-குறியீடு ச்கேனரை நிறுவவும்.)

# connectionWizard_misc_incorrectConnectionURI
source: Incorrect connection URI used
ta: யுஆர்ஐ பயன்படுத்திய தவறான இணைப்பு

# connectionWizard_welcome_titleMessage
source: Welcome to wallabag.
ta: வாலபாகுக்கு வருக.

# connectionWizard_welcome_text
source: Set up a connection using the wizard first.
ta: முதலில் வழிகாட்டியைப் பயன்படுத்தி இணைப்பை அமைக்கவும்.

# connectionWizard_welcome_rerunNotice
source: (You can re-run the connection wizard from "Settings" at any time.)
ta: (நீங்கள் எந்த நேரத்திலும் "அமைப்புகளிலிருந்து" இணைப்பு வழிகாட்டியை மீண்டும் இயக்கலாம்.)

# connectionWizard_welcome_prev
source: Skip
ta: தவிர்

# connectionWizard_welcome_next
source: Next
ta: அடுத்தது

# connectionWizard_providerSelection_titleMessage
source: Select wallabag provider
ta: வாலபாக் வழங்குநரைத் தேர்ந்தெடுக்கவும்

# connectionWizard_providerSelection_provider_general_name
source: Other
ta: மற்றொன்று

# connectionWizard_providerSelection_provider_general_desc
source: Lets you type in settings manually
ta: அமைப்புகளை கைமுறையாக தட்டச்சு செய்ய அனுமதிக்கிறது

# connectionWizard_providerSelection_provider_wallabagit_desc
source: Select this option if you have an account on https://wallabag.it
ta: உங்களிடம் https://wallabag.it இல் கணக்கு இருந்தால் இந்த விருப்பத்தைத் தேர்ந்தெடுக்கவும்

# connectionWizard_providerSelection_prev
source: Skip
ta: தவிர்

# connectionWizard_providerSelection_next
source: Next
ta: அடுத்தது

# connectionWizard_provider_general_titleMessage
source: Basic setup
ta: அடிப்படை அமைப்பு

# connectionWizard_provider_general_prev
source: Back
ta: பின்

# connectionWizard_provider_general_next
source: Connect
ta: இணை

# connectionWizard_provider_wallabagit_titleMessage
source: wallabag.it setup
ta: vallabag.it அமைப்பு

# connectionWizard_provider_wallabagit_prev
source: Back
ta: பின்

# connectionWizard_provider_wallabagit_next
source: Connect
ta: இணை

# connectionWizard_summary_titleMessage
source: All done.
ta: அனைத்தும் முடிந்தது.

# connectionWizard_summary_text
source: Click to save and go to the main screen.
ta: சேமிக்க சொடுக்கு செய்து முதன்மையான திரைக்குச் செல்லவும்.

# connectionWizard_summary_toastMessage
source: Setup completed
ta: அமைப்பு முடிந்தது

# connectionWizard_summary_prev
source: Back
ta: பின்

# connectionWizard_summary_next
source: Save settings
ta: அமைப்புகளை சேமிக்கவும்

source: Remove tag
ta: குறிச்சொல்லை அகற்று

# notification_stacktrace
source: Stacktrace:
ta: ச்டாக் ட்ரேச்:

# notification_copyToClipboard
source: Copy to clipboard
ta: கிளிப்போர்டுக்கு நகலெடுக்கவும்

# notification_clipboardLabel
source: Error details
ta: பிழை விவரங்கள்

source: Copied to clipboard
ta: கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டது

# menu_tag
source: Add tag
ta: குறிச்சொல்லைச் சேர்க்கவும்

# menu_annotate
source: Annotate
ta: சிறுகுறிப்பு

# articleEdit_openArticle
source: Open article
ta: திறந்த கட்டுரை

source: Title
ta: தலைப்பு

# untagged
source: <![CDATA[<untagged>]]>
ta: <! [Cdata [<oundaged>]]>

# contentIsTooLong
source: Article content too long to display
ta: கட்டுரை உள்ளடக்கம் காண்பிக்க மிக நீண்டது

# articleContent_previewImageAltText
source: Preview image
ta: படம் முன்னோட்டம்

# tts_image
source: Image: %s
ta: படங்கள்

# notification_action_media_rewind
source: Rewind
ta: முன்னாடி

# notification_action_media_pause
source: Pause
ta: இடைநிறுத்தம்

# notification_action_media_play
source: Play
ta: விளையாடுங்கள்

# notification_action_media_fastforward
source: Fast Forward
ta: வேகமாக முன்னோக்கி

# notification_action_media_next
source: Next
ta: அடுத்தது
