Repository: 247i/TACETr
Catalog: உரை/தானி/webcord-settings-*.po
Languages: ta

# general.name
source: General
ta: பொது

# general.menuBar.name
source: Menu bar
ta: பார் பட்டியல்

# general.menuBar.description
source: Changes visibility settings of native menu bar.
ta: சொந்த பட்டியல் பட்டியின் தெரிவுநிலை அமைப்புகளை மாற்றுகிறது.

# general.menuBar.labels.hide
source: Hide menu bar automatically (<kbd>ALT</kbd> key switches the visibility).
ta: பட்டியல் பட்டியை தானாக மறைக்கவும் (<kbd> மாற்று </kbd> விசை தெரிவுநிலையை மாற்றுகிறது).

# general.tray.name
source: Tray
ta: தட்டு

# general.tray.description
source: Changes the visibility of the icon in the system tray.
ta: கணினி தட்டில் ஐகானின் தெரிவுநிலையை மாற்றுகிறது.

# general.tray.labels.disable
source: Disable hiding window to the system tray functionality.
ta: கணினி தட்டு செயல்பாட்டிற்கு மறைக்கும் சாளரத்தை முடக்கு.

# general.taskbar.name
source: Taskbar
ta: பண்பரை

# general.taskbar.description
source: Controls the behavior of taskbar entry of WebCord.
ta: வெப்கோர்டின் பணிப்பட்டு நுழைவின் நடத்தையை கட்டுப்படுத்துகிறது.

# general.taskbar.labels.flash
source: Flash taskbar button on new messages.
ta: புதிய செய்திகளில் ஃபிளாச் டாச்க்பார் பொத்தான்.

# general.window.name
source: WebCord's main window
ta: வெப்கார்டின் முக்கிய சாளரம்

# general.window.description
source: Controls the look and behavior of the window displaying client interface.
ta: கிளையன்ட் இடைமுகத்தைக் காண்பிக்கும் சாளரத்தின் தோற்றத்தையும் நடத்தையையும் கட்டுப்படுத்துகிறது.

# general.window.labels.transparent
source: Allow for translucent window background.
ta: கசியும் சாளர பின்னணியை அனுமதிக்கவும்.

# general.window.labels.hideOnClose
source: Hide window to tray with the close button.
ta: மூடு பொத்தானைக் கொண்டு தட்டில் சாளரத்தை மறைக்கவும்.

# privacy.name
source: Privacy
ta: தனியுரிமை

# privacy.blockApi.name
source: Discord API blocking
ta: டிச்கார்ட் பநிஇ தடுப்பு

# privacy.blockApi.description
source: Blocks Discord API requests for hardening the privacy.
ta: தனியுரிமையை கடினப்படுத்துவதற்கான டிச்கார்ட் பநிஇ கோரிக்கைகளைத் தடுக்கிறது.

# privacy.blockApi.labels.science
source: Block known telemetry endpoints (<code>/science</code> and <code>/tracing</code>).
ta: அறியப்பட்ட டெலிமெட்ரி எண்ட்பாயிண்ட்ச் (<code>/அறிவியல் </code> மற்றும் <code>/tracing </code>).

# privacy.blockApi.labels.typingIndicator
source: Block typing indicator (<code>/typing</code>).
ta: தட்டச்சு காட்டி காட்டி (<code>/தட்டச்சு </code>).

# privacy.blockApi.labels.fingerprinting
source: Block known fingerprinting methods (<code>api.js</code> and <code>cdn-cgi</code>).
ta: அறியப்பட்ட கைரேகை முறைகளைத் தடுக்கவும் (<code> api.js </code> மற்றும் <code> CDN-CGI </code>).

# privacy.permissions.name
source: Permissions
ta: அனுமதிகள்

# privacy.permissions.description
source: Allows or denies the permission checks and request from the Discord website. Please note that other permissions not listed here are blocked automatically by WebCord.
ta: இசைவு காசோலைகள் மற்றும் முரண்பாடு வலைத்தளத்திலிருந்து கோரிக்கையை அனுமதிக்கிறது அல்லது மறுக்கிறது. இங்கே பட்டியலிடப்படாத பிற அனுமதிகள் வெப்கோர்டால் தானாகத் தடுக்கப்படுகின்றன என்பதை நினைவில் கொள்க.

# privacy.permissions.labels.video
source: Camera
ta: கேமரா

# privacy.permissions.labels.audio
source: Microphone
ta: ஒலிவாங்கி

# privacy.permissions.labels.fullscreen
source: Fullscreen
ta: முழு திரை

# privacy.permissions.labels.notifications
source: Notifications
ta: அறிவிப்புகள்

# privacy.permissions.labels.display-capture
source: Desktop capture
ta: டெச்க்டாப் பிடிப்பு

# privacy.permissions.labels.background-sync
source: Background synchronisation
ta: பின்னணி ஒத்திசைவு

# privacy.permissions.labels.speaker-selection
source: Audio devices list
ta: ஆடியோ சாதனங்கள் பட்டியல்

# advanced.name
source: Advanced
ta: மேம்பட்ட

# advanced.csp.name
source: Content Security Policy
ta: உள்ளடக்க பாதுகாப்பு கொள்கை

# advanced.csp.description
source: Switches whenever application should ignore Discord's Content Security Policy headers and let client set its own CSP for privacy and security concerns.
ta: விண்ணப்பம் டிச்கார்டின் உள்ளடக்க பாதுகாப்புக் கொள்கை தலைப்புகளை புறக்கணித்து, தனியுரிமை மற்றும் பாதுகாப்பு கவலைகளுக்கு கிளையன்ட் தனது சொந்த சிஎச்பியை அமைக்க அனுமதிக்கும் போதெல்லாம் சுவிட்சுகள்.

# advanced.csp.labels.enabled
source: Use built-in Content Security Policy.
ta: உள்ளமைக்கப்பட்ட உள்ளடக்க பாதுகாப்புக் கொள்கையைப் பயன்படுத்தவும்.

# advanced.cspThirdParty.name
source: Third party websites
ta: மூன்றாம் தரப்பு வலைத்தளங்கள்

# advanced.cspThirdParty.description
source: Sets a list of the third-party websites allowed to connect or display content.
ta: உள்ளடக்கத்தை இணைக்க அல்லது காண்பிக்க அனுமதிக்கப்பட்ட மூன்றாம் தரப்பு வலைத்தளங்களின் பட்டியலை அமைக்கிறது.

# advanced.cspThirdParty.labels.gif
source: GIF Providers
ta: GIF வழங்குநர்கள்

# advanced.cspThirdParty.info.googleStorageApi
source: Required for file uploads on Discord!
ta: டிச்கார்ட்டில் கோப்பு பதிவேற்றங்களுக்கு தேவை!

# advanced.currentInstance.name
source: Discord instance
ta: முரண்பாடு நிகழ்வு

# advanced.currentInstance.description
source: Selects the instance WebCord should connect to. <b>Experimental</b> as the Fosscord implementation is not fully finished yet.
ta: வெப்கார்ட் இணைக்க வேண்டிய நிகழ்வைத் தேர்ந்தெடுக்கிறது. <b> சோதனை </b> ஃபோச்கார்ட் செயல்படுத்தல் இன்னும் முழுமையாக முடிக்கப்படாததால்.

# advanced.devel.name
source: Developer mode
ta: உருவாக்குபவர் பயன்முறை

# advanced.devel.description
source: Enables the access to tools and unfinished options that are potentially considered as broken or dangerous. <b>Disclaimer</b>: application maintainers are not responsible for any bugs or issues after this option is enabled – please do not report them!
ta: உடைந்த அல்லது ஆபத்தானதாகக் கருதப்படும் கருவிகள் மற்றும் முடிக்கப்படாத விருப்பங்களுக்கான அணுகலை செயல்படுத்துகிறது. <b> மறுப்பு </b>: இந்த விருப்பம் இயக்கப்பட்ட பிறகு எந்தவொரு பிழைகள் அல்லது சிக்கல்களுக்கும் பயன்பாட்டு பராமரிப்பாளர்கள் பொறுப்பல்ல - தயவுசெய்து அவற்றைப் புகாரளிக்க வேண்டாம்!

# advanced.devel.labels.enabled
source: Enable developer mode.
ta: உருவாக்குபவர் பயன்முறையை இயக்கவும்.

# advanced.redirection.name
source: Cross-origin redirection behavior
ta: குறுக்கு-தொட்டி திசைதிருப்பல் நடத்தை

# advanced.redirection.description
source: Controls the actions on cross-origin redirections. <b>This affects application security</b>.
ta: குறுக்கு-ஓசின் திசைதிருப்பல்களில் செயல்களைக் கட்டுப்படுத்துகிறது. <b> இது பயன்பாட்டு பாதுகாப்பை பாதிக்கிறது </b>.

# advanced.redirection.labels.warn
source: Always warn user about cross-origin redirections to external applications.
ta: வெளிப்புற பயன்பாடுகளுக்கு குறுக்கு-இயற்பியல் திசைதிருப்பல்கள் குறித்து எப்போதும் பயனரை எச்சரிக்கவும்.

# advanced.optimize.name
source: Client optimizations
ta: வாடிக்கையாளர் மேம்படுத்தல்கள்

# advanced.optimize.description
source: Tries to detect the user software and hardware to apply custom flags to the Chromium engine that <b>might</b> improve Electron's performance or functionality. <b>Experimental</b>, as there's a reason why Chromium does not apply these flags by default.
ta: <b> </b> எலக்ட்ரானின் செயல்திறன் அல்லது செயல்பாட்டை மேம்படுத்தக்கூடிய குரோமியம் எஞ்சினுக்கு தனிப்பயன் கொடிகளைப் பயன்படுத்த பயனர் மென்பொருள் மற்றும் வன்பொருளைக் கண்டறிய முயற்சிக்கிறது. <b> சோதனை </b>, குரோமியம் இந்த கொடிகளை இயல்பாகவே பயன்படுத்தாததற்கு ஒரு காரணம் இருப்பதால்.

# advanced.optimize.labels.gpu
source: Optimize the client for the currently active graphics card.
ta: தற்போது செயலில் உள்ள கிராபிக்ச் அட்டைக்கு கிளையண்டை மேம்படுத்தவும்.

# advanced.webApi.name
source: Access to JavaScript APIs
ta: சாவாச்கிரிப்ட் பநிஇ களுக்கான அணுகல்

# advanced.webApi.description
source: Controls which API should be permitted in unpriviledged (DOM) scripts.
ta: பநிஇ எந்த பநிஇ அனுமதிக்கப்பட வேண்டும் என்பதற்கான கட்டுப்பாடுகள், தழுவிய (டோம்) ச்கிரிப்ட்களில்.

# advanced.webApi.labels.webGl
source: Enable WebGL support.
ta: WEBGL ஆதரவை இயக்கவும்.

# advanced.unix.name
source: Experimental features for Unix/Unix-like OS
ta: யுனிக்ச்/யுனிக்ச் போன்ற ஓஎச்சிற்கான சோதனை நற்பொருத்தங்கள்

# advanced.unix.description
source: Enables features that were flagged by Chromium/Blink engine as experimental. <b>Use them at your own responsibility</b>.
ta: குரோமியம்/பிளிங்க் எஞ்சின் மூலம் கொடியிடப்பட்ட அம்சங்களை சோதனைக்குரியதாக செயல்படுத்துகிறது. <b> அவற்றை உங்கள் சொந்த பொறுப்பில் பயன்படுத்தவும் </b>.

# advanced.unix.labels.autoscroll
source: Enable middle-click scrolling (aka. <i>autoscroll</i>).
ta: நடுத்தர சொடுக்கு ச்க்ரோலிங் (அக்கா. <i> ஆட்டோச்கிரோல் </i>) ஐ இயக்கவும்.
