Repository: 247i/TACETr
Catalog: உரை/தானி/webcord-web-*.po
Languages: ta

# offline.title
source: Cannot connect to the Discord service.
ta: முரண்பாடு சேவையுடன் இணைக்க முடியாது.

# offline.description
source: Please make sure you're connected to the internet.
ta: நீங்கள் இணையத்துடன் இணைக்கப்பட்டுள்ளீர்கள் என்பதை உறுதிப்படுத்தவும்.

# aboutWindow.nav.about
source: About
ta: பற்றி

# aboutWindow.nav.credits
source: Credits
ta: வரவு

# aboutWindow.nav.licenses
source: Licenses
ta: உரிமங்கள்

# aboutWindow.about.appDescription
source: Discord and Fosscord web client with privacy-focused features.
ta: தனியுரிமையை மையமாகக் கொண்ட அம்சங்களுடன் முரண்பாடு மற்றும் ஃபோச்கார்ட் வலை வாங்கி.

# aboutWindow.about.appRepo
source: GitHub Repository
ta: அறிவிலிமையம் களஞ்சியம்

# aboutWindow.about.featuresTitle
source: Build flags
ta: கொடிகளை உருவாக்குங்கள்

# aboutWindow.about.featuresDefault
source: Default
ta: இயல்புநிலை

# aboutWindow.about.checksumTitle
source: Checksum
ta: செக்சம்

# aboutWindow.credits.people.author
source: Author, maintainer and main developer.
ta: ஆசிரியர், பராமரிப்பாளர் மற்றும் முதன்மையான உருவாக்குபவர்.

# aboutWindow.credits.people.contributors.default
source: Code contributor.
ta: குறியீடு பங்களிப்பாளர்.

# aboutWindow.licenses.appLicenseTitle
source: Application license
ta: விண்ணப்ப உரிமம்

# aboutWindow.licenses.appLicenseBody
source: %s is a free software: you can use, modify and redistribute it under terms of MIT license, which should be distributed with this software.
ta: %s ஒரு இலவச மென்பொருள்: நீங்கள் அதை எம்ஐடி உரிமத்தின் விதிமுறைகளின் கீழ் பயன்படுத்தலாம், மாற்றலாம் மற்றும் மறுபகிர்வு செய்யலாம், இது இந்த மென்பொருளுடன் விநியோகிக்கப்பட வேண்டும்.

# aboutWindow.licenses.showLicense
source: Show license
ta: உரிமத்தைக் காட்டு

# aboutWindow.licenses.thirdPartyLicensesTitle
source: Third party licenses
ta: மூன்றாம் தரப்பு உரிமங்கள்

# aboutWindow.licenses.thirdPartyLicensesBody
source: %s depends on following third party software:
ta: %s மூன்றாம் தரப்பு மென்பொருளைப் பின்பற்றுவதைப் பொறுத்தது:

# aboutWindow.licenses.licensedUnder
source: under %s license
ta: %s உரிமத்தின் கீழ்

# aboutWindow.licenses.packageAuthors
source: %s authors
ta: %s ஆசிரியர்கள்
