Repository: 247i/TACETr
Catalog: உரை/தானி/wg-tunnel-fastlane-*.po
Languages: ta

# title.txt:1
source: WG Tunnel
ta: Wg சுரங்கப்பாதை

# short_description.txt:1
source: An alternative VPN client app for WireGuard with additional features
ta: கூடுதல் அம்சங்களுடன் வயர் கார்டுக்கான மாற்று வி.பி.என் வாங்கி பயன்பாடு

# full_description.txt:1
source: Features - Add tunnels via .conf file, zip, manual entry, or QR code - Auto connect to VPN based on Wi-Fi SSID, ethernet, or mobile data - Split tunneling by application with search - WireGuard support for kernel and userspace modes - Amnezia support for userspace mode for DPI/censorship protection - Always-On VPN support - Export Amnezia and WireGuard tunnels to zip - Quick tile support for VPN toggling - Static shortcuts support for primary tunnel for automation integration - Intent automation support for all tunnels - Automatic service restart after reboot - Battery preservation measures
ta: அம்சங்கள் - .conf கோப்பு, சிப், கையேடு நுழைவு அல்லது QR குறியீடு வழியாக சுரங்கங்களைச் சேர்க்கவும் - வைஃபை எச்எச்ஐடி, ஈதர்நெட் அல்லது மொபைல் தரவின் அடிப்படையில் VPN உடன் தானாக இணைக்கவும் - தேடலுடன் பயன்பாட்டின் மூலம் சுரங்கப்பாதையை பிரிக்கவும் - கர்னல் மற்றும் பயனர்ச்பேச் முறைகளுக்கு வயர் கார்ட் உதவி - டிபிஐ/தணிக்கை பாதுகாப்பிற்கான பயனர்களின் பயன்முறைக்கான அம்னேசியா உதவி - எப்போதும் VPN உதவி - அம்னேசியா மற்றும் வயர் கார்ட் சுரங்கங்களை சிப்பிற்கு ஏற்றுமதி செய்யுங்கள் - VPN மாற்றுவதற்கான விரைவான ஓடு உதவி - ஆட்டோமேசன் ஒருங்கிணைப்புக்கான முதன்மை சுரங்கப்பாதைக்கு நிலையான குறுக்குவழிகள் உதவி - அனைத்து சுரங்கங்களுக்கும் நோக்கம் ஆட்டோமேசன் உதவி - மறுதொடக்கம் செய்த பிறகு தானியங்கி பணி மறுதொடக்கம் - பேட்டரி பாதுகாப்பு நடவடிக்கைகள்

# changelogs/32100.txt:1
source: Enhancements: - Fix < Android 9 permission bug - Other optimizations
ta: மேம்பாடுகள்: - <Android 9 இசைவு பிழையை சரிசெய்யவும் - பிற மேம்படுத்தல்கள்

# changelogs/32200.txt:1
source: Enhancements: - Add tunnel statistics to main screen - Improve settings screen AndroidTV navigation - Remove notification vibration - Various other bug fixes
ta: மேம்பாடுகள்: - முதன்மையான திரையில் சுரங்கப்பாதை புள்ளிவிவரங்களைச் சேர்க்கவும் - அமைப்புகள் திரை AndroidTV வழிசெலுத்தல் மேம்படுத்தவும் - அறிவிப்பு அதிர்வுகளை அகற்று - வேறு பல பிழை திருத்தங்கள்

# changelogs/32300.txt:1
source: Enhancements: - Add support for mobile data only auto-tunneling - Improve support screen UI - Update resource links - Various other bug fixes
ta: மேம்பாடுகள்: - மொபைல் தரவுகளுக்கான ஆதரவை மட்டுமே தானாக சுரங்கப்படுத்துதல் - உதவி திரை இடைமுகம் ஐ மேம்படுத்தவும் - வள இணைப்புகளைப் புதுப்பிக்கவும் - வேறு பல பிழை திருத்தங்கள்

# changelogs/32400.txt:1
source: Enhancements: - Add basic WireGuard Kernel support - Improved location disclosure flow - Fix auto-tunnel permissions bug - Various other UI bug fixes
ta: மேம்பாடுகள்: - அடிப்படை வயர் கார்ட் கர்னல் ஆதரவைச் சேர்க்கவும் - மேம்படுத்தப்பட்ட இருப்பிட வெளிப்படுத்தல் ஓட்டம் - ஆட்டோ-டன்னல் அனுமதிகள் பிழையை சரிசெய்யவும் - வேறு பல இடைமுகம் பிழை திருத்தங்கள்

# changelogs/32500.txt:1
source: Fixes: - Android 14 foreground permissions
ta: திருத்தங்கள்: - ஆண்ட்ராய்டு 14 முன்புற அனுமதிகள்

# changelogs/33000.txt:1
source: Enhancements: - Refactor state management - Improve AndroidTV navigation - Improve auto-tunneling efficiency - Improve navigation - Auto-tunneling pause feature - Many bugfixes
ta: மேம்பாடுகள்: - மறுசீரமைப்பு மாநில மேலாண்மை - AndroidTV வழிசெலுத்தலை மேம்படுத்தவும் - ஆட்டோ-சுரங்கப்பாதை செயல்திறனை மேம்படுத்தவும் - வழிசெலுத்தலை மேம்படுத்தவும் - ஆட்டோ-சுரங்கப்பாதை இடைநிறுத்தம் நற்பொருத்தம் - பல பிழைகள்

# changelogs/33100.txt:1
source: Enhancements: - Refactor state management - Improve AndroidTV navigation - Improve auto-tunneling efficiency - Improve navigation - Auto-tunneling pause feature - Many bugfixes
ta: மேம்பாடுகள்: - மறுசீரமைப்பு மாநில மேலாண்மை - AndroidTV வழிசெலுத்தலை மேம்படுத்தவும் - ஆட்டோ-சுரங்கப்பாதை செயல்திறனை மேம்படுத்தவும் - வழிசெலுத்தலை மேம்படுத்தவும் - ஆட்டோ-சுரங்கப்பாதை இடைநிறுத்தம் நற்பொருத்தம் - பல பிழைகள்

# changelogs/33200.txt:1
source: Enhancements: - Refactor state management - Improve AndroidTV navigation - Improve auto-tunneling efficiency - Improve navigation - Auto-tunneling pause feature - Fix foreground start auto-tunnel - Many bugfixes
ta: மேம்பாடுகள்: - மறுசீரமைப்பு மாநில மேலாண்மை - AndroidTV வழிசெலுத்தலை மேம்படுத்தவும் - ஆட்டோ-சுரங்கப்பாதை செயல்திறனை மேம்படுத்தவும் - வழிசெலுத்தலை மேம்படுத்தவும் - ஆட்டோ-சுரங்கப்பாதை இடைநிறுத்தம் நற்பொருத்தம் - முன்புற தொடக்க ஆட்டோ-டன்னலை சரிசெய்யவும் - பல பிழைகள்

# changelogs/33300.txt:1
source: Enhancements: - Added delete tunnel confirmation - Added battery background permission Fixes: - Tunnel disable frozen bug - Email to field bug - Config edit empty DNS
ta: மேம்பாடுகள்: - சுரங்கப்பாதை உறுதிப்படுத்தலை நீக்கு - பேட்டரி பின்னணி இசைவு சேர்க்கப்பட்டது திருத்தங்கள்: - சுரங்கப்பாதை உறைந்த பிழையை முடக்கு - புலப் பிழைக்கு மின்னஞ்சல் அனுப்புங்கள் - வெற்று டி.என்.எச்

# changelogs/33400.txt:1
source: Enhancements: - Fixed create config not saving - Bumped versions
ta: மேம்பாடுகள்: - நிலையான உருவாக்க கட்டமைப்பு சேமிக்காமல் உருவாக்கு - மோதிய பதிப்புகள்

# changelogs/33401.txt:1
source: What's new: - This is a CI testing version
ta: புதியது என்ன: - இது தொஒ சோதனை பதிப்பு

# changelogs/33500.txt:1
source: What's new: - Auto-start on reboot for Always-On VPN kernel mode - Support for adaptive theme icons - Fix notification icons, tile icon - Fix AndroidTV icons
ta: புதியது என்ன: -எப்போதும் VPN கர்னல் பயன்முறையில் மறுதொடக்கத்தில் தானாகத் தொடங்கவும் - தகவமைப்பு கருப்பொருள் ஐகான்களுக்கான உதவி - அறிவிப்பு சின்னங்கள், ஓடு படவுரு சரிசெய்யவும் - AndroidTv சின்னங்களை சரிசெய்யவும்

# changelogs/33600.txt:1
source: What's new: - Improve first launch flow - Switch to wireguard lib fork - Request VPN permission on first VPN start - Bump versions
ta: புதியது என்ன: - முதல் ஏவுதளத்தை மேம்படுத்தவும் - வயர் கார்ட் லிப் ஃபோர்க்குக்கு மாறவும் - முதல் VPN தொடக்கத்தில் VPN இசைவு கோருங்கள் - பம்ப் பதிப்புகள்

# changelogs/33700.txt:1
source: What's new: - Tunnel display UI bug fix
ta: புதியது என்ன: - சுரங்கப்பாதை காட்சி இடைமுகம் பிழை பிழைத்திருத்தம்

# changelogs/33800.txt:1
source: What's new: - Config edit UI bug fix - Add GrapheneOS first launch AOVPN notification - Bump versions
ta: புதியது என்ன: - கட்டம் இடைமுகம் பிழை பிழைத்திருத்தம் - கிராபெனியோக்களை முதலில் AOVPN அறிவிப்பைத் தொடங்கவும் - பம்ப் பதிப்புகள்

# changelogs/33900.txt:1
source: What's new: - Add logs screen - Add local app lock - Add restart vpn on failed ping - Various bug fixes
ta: புதியது என்ன: - பதிவுகள் திரை சேர்க்கவும் - உள்ளக பயன்பாட்டு பூட்டைச் சேர்க்கவும் - தோல்வியுற்ற பிங்கில் மறுதொடக்கம் VPN ஐச் சேர்க்கவும் - பல்வேறு பிழை திருத்தங்கள்

# changelogs/34000.txt:1
source: What's new: - Auto tunnel to specific tunnels by wifi name - Auto tunnel control from tile and shortcuts - Auto start manual tunnel if it was on before reboot - Various bug fixes and performance improvements
ta: புதியது என்ன: - வைஃபை பெயரால் குறிப்பிட்ட சுரங்கங்களுக்கு ஆட்டோ சுரங்கப்பாதை - ஓடு மற்றும் குறுக்குவழிகளிலிருந்து ஆட்டோ சுரங்கப்பாதை கட்டுப்பாடு - மறுதொடக்கம் செய்வதற்கு முன்பு இருந்திருந்தால் ஆட்டோ ச்டார்ட் கையேடு சுரங்கப்பாதை - பல்வேறு பிழை திருத்தங்கள் மற்றும் செயல்திறன் மேம்பாடுகள்

# changelogs/34100.txt:1
source: What's new: - Improved auto tunnel reliability - Improved tile sync - Added AndroidTV assets - Added apk fingerprint
ta: புதியது என்ன: - மேம்படுத்தப்பட்ட ஆட்டோ சுரங்கப்பாதை நம்பகத்தன்மை - மேம்படுத்தப்பட்ட ஓடு ஒத்திசைவு - AndroidTV சொத்துக்கள் சேர்க்கப்பட்டன - APK கைரேகை சேர்க்கப்பட்டது

# changelogs/34200.txt:1
source: What's new: - Fix stop tunnel regression - Add logs obfuscation - Add hide FAB on scroll - Add Turkish localization
ta: புதியது என்ன: - ச்டாப் சுரங்கப்பாதை பின்னடைவை சரிசெய்யவும் - பதிவுகளைச் சேர்க்கவும் - சுருளில் மறை ஃபேப் சேர்க்கவும் - துருக்கிய உள்ளூர்மயமாக்கலைச் சேர்க்கவும்

# changelogs/34202.txt:1
source: What's new: - Add Amnezia side-by-side with WireGuard - Fix app shortcuts bug
ta: புதியது என்ன: -கம்பர்கார்டுடன் அம்னேசியாவை அருகருகே சேர்க்கவும் - பயன்பாட்டு குறுக்குவழிகள் பிழையை சரிசெய்யவும்

# changelogs/34300.txt:1
source: What's new: - Official support for AmneziaWG - Import/export for Amnezia configs - Auto-tunnel to only toggle once per network change - Additional languages support - Other bug fixes and improvements
ta: புதியது என்ன: - Amneziawg க்கான அதிகாரப்பூர்வ உதவி - அம்னேசியா உள்ளமைவுகளுக்கு இறக்குமதி/ஏற்றுமதி - பிணைய மாற்றத்திற்கு ஒரு முறை மட்டுமே மாற்றுவதற்கு தானாக சுரங்கப்பாதை - கூடுதல் மொழிகள் உதவி - பிற பிழை திருத்தங்கள் மற்றும் மேம்பாடுகள்

# changelogs/34400.txt:1
source: What's new: - Improve tunnel import naming - Fix auto tunneling init state bug - Improved error handling - Fix Amnezia zip import bug
ta: புதியது என்ன: - சுரங்கப்பாதை இறக்குமதி பெயரிடுதலை மேம்படுத்தவும் - ஆட்டோ சுரங்கப்பாதை init state பிழை ஐ சரிசெய்யவும் - மேம்படுத்தப்பட்ட பிழை கையாளுதல் - அம்னேசியா சிப் இறக்குமதி பிழையை சரிசெய்யவும்

# changelogs/34500.txt:1
source: What's new: - Additional language support - Auto-tunneling mobile data bug fix - AndroidTV floating action button fix - Other optimizations and enhancements
ta: புதியது என்ன: - கூடுதல் மொழி உதவி - தானாக சுரங்கப்பாதை மொபைல் தரவு பிழை பிழைத்திருத்தம் - ஆண்ட்ராய்டு மிதக்கும் செயல் பொத்தான் சரி - பிற தேர்வுமுறை மற்றும் மேம்பாடு

# changelogs/34600.txt:1
source: What's new: - Fixes auto tunneling bugs - Fixes android backup bug - Bump versions
ta: புதியது என்ன: - ஆட்டோ சுரங்கப்பாதை பிழைகள் சரிசெய்கின்றன - ஆண்ட்ராய்டு காப்பு பிழையை சரிசெய்கிறது - பம்ப் பதிப்புகள்

# changelogs/34700.txt:1
source: What's new: - Fix crashing issues - Improve tile performance - Re-enable pin lock - Make restart on boot a setting - Various performance and bug fixes
ta: புதியது என்ன: - செயலிழந்த சிக்கல்களை சரிசெய்யவும் - ஓடு செயல்திறனை மேம்படுத்தவும் - மீண்டும் இயக்கக்கூடிய முள் பூட்டு - துவக்க ஒரு அமைப்பில் மறுதொடக்கம் செய்யுங்கள் - பல்வேறு செயல்திறன் மற்றும் பிழை திருத்தங்கள்

# changelogs/34800.txt:1
source: What's new: - Fixes for AndroidTV UI tunnel control - Fixes portrait lock bug - Fixes pin lock bypass bug - Fixes auto tunnel tile bug
ta: புதியது என்ன: - AndroidTv இடைமுகம் சுரங்கப்பாதை கட்டுப்பாட்டுக்கான திருத்தங்கள் - உருவப்படம் பூட்டு பிழையை சரிசெய்கிறது - முள் பூட்டு பைபாச் பிழையை சரிசெய்கிறது - ஆட்டோ சுரங்கப்பாதை ஓடு பிழையை சரிசெய்கிறது

# changelogs/35000.txt:1
source: What's new: - Improve auto tunnel reliability - Add support for light/dark/dynamic theming - Add support for pre/post up/down scripts - Remove tunnel persistent notification - Various other fixes and improvements
ta: புதியது என்ன: - ஆட்டோ சுரங்கப்பாதை நம்பகத்தன்மையை மேம்படுத்தவும் - ஒளி/இருண்ட/டைனமிக் கருப்பொருளுக்கு ஆதரவைச் சேர்க்கவும் - முன்/போச்ட் அப்/டவுன் ச்கிரிப்ட்களுக்கு ஆதரவைச் சேர்க்கவும் - சுரங்கப்பாதை தொடர்ந்து அறிவிப்பை அகற்று - வேறு பல திருத்தங்கள் மற்றும் மேம்பாடுகள்

# changelogs/35100.txt:1
source: What's new: - Fixes for tunnels not launching from background - Add support for restart services after update - UI animation speed improvements - Other optimizations
ta: புதியது என்ன: - சுரங்கங்கள் பின்னணியில் இருந்து தொடங்கப்படாததற்கான திருத்தங்கள் - புதுப்பித்தலுக்குப் பிறகு மறுதொடக்கம் சேவைகளுக்கு ஆதரவைச் சேர்க்கவும் - இடைமுகம் அனிமேசன் வேக மேம்பாடுகள் - பிற மேம்படுத்தல்கள்

# changelogs/35200.txt:1
source: What's new: - Added wildcard support for wifi names - Live edit of tunnel/auto-tunnel settings while active - Fix slowness on mobile data - Various bug fixes and improvements - UI optimizations
ta: புதியது என்ன: - வைஃபை பெயர்களுக்கு வைல்டு அட்டை உதவி சேர்க்கப்பட்டது - செயலில் இருக்கும்போது சுரங்கப்பாதை/ஆட்டோ-டன்னல் அமைப்புகளின் நேரடி திருத்து - மொபைல் தரவுகளில் மந்தநிலையை சரிசெய்யவும் - பல்வேறு பிழை திருத்தங்கள் மற்றும் மேம்பாடுகள் - இடைமுகம் மேம்படுத்தல்கள்

# changelogs/35300.txt:1
source: What's new: - Rooted devices now get wifi name without location - Logs screen scroll and sharing improvements - Tunnel import bug fixes for AndroidTV 14 - Tunnel statistics UI enhancements - Other bug fixes and improvements
ta: புதியது என்ன: - வேரூன்றிய சாதனங்கள் இப்போது இருப்பிடம் இல்லாமல் வைஃபை பெயரைப் பெறுகின்றன - திரை சுருள் மற்றும் பகிர்வு மேம்பாடுகளை பதிவு செய்கிறது - AndroidTv 14 க்கான சுரங்கப்பாதை இறக்குமதி பிழை திருத்தங்கள் - சுரங்கப்பாதை புள்ளிவிவரங்கள் இடைமுகம் மேம்பாடுகள் - பிற பிழை திருத்தங்கள் மற்றும் மேம்பாடுகள்

# changelogs/36000.txt:1
source: What's new: - UI update - AndroidTV navigation improvements - Battery drain bug fix - Wildcards fix with optional setting - Other improvements
ta: புதியது என்ன: - இடைமுகம் புதுப்பிப்பு - AndroidTV வழிசெலுத்தல் மேம்பாடுகள் - பேட்டரி வடிகால் பிழை திருத்தம் - விருப்ப அமைப்புடன் காடு கார்டுகள் சரிசெய்தல் - பிற மேம்பாடுகள்

# changelogs/36100.txt:1
source: What's new: - Add tunnel from clipboard - Add localizations - Fix battery drain bug - Fix delete bug - Improve tunnel tile sync - Other fixes and improvements
ta: What's new: - கூட்டு tunnel இருந்து clipboard - கூட்டு localizations - Fix மின்கலம் drain bug - Fix நீக்கு bug - Improve tunnel tile sync - மற்றொன்று fixes and improvements

# changelogs/36200.txt:1
source: What's new: - Added VPN kill switch w/LAN bypass - Improved auto tunnel speed and reliability - Improved tile sync - Various bug fixes and improvements
ta: புதியது என்ன: - வி.பி.என் கில் சுவிட்ச் w/LAN பைபாச் சேர்க்கப்பட்டது - மேம்படுத்தப்பட்ட ஆட்டோ சுரங்கப்பாதை விரைவு மற்றும் நம்பகத்தன்மை - மேம்படுத்தப்பட்ட ஓடு ஒத்திசைவு - பல்வேறு பிழை திருத்தங்கள் மற்றும் மேம்பாடுகள்

# changelogs/36300.txt:1
source: What's new: - Fixed kernel mode toggle bug - Fixed notification crash bug
ta: புதியது என்ன: - நிலையான கர்னல் பயன்முறை பிழையை மாற்றவும் - நிலையான அறிவிப்பு செயலிழப்பு பிழை

# changelogs/36500.txt:1
source: What's new: - Auto tunnel reliability improvements - Split tunnel save fix and performance improvements - Kernel mode bug fix - Tile bug fix - Various other fixes and improvements
ta: புதியது என்ன: - ஆட்டோ சுரங்கப்பாதை நம்பகத்தன்மை மேம்பாடுகள் - பிளவு சுரங்கப்பாதை சேமி பிழைத்திருத்தம் மற்றும் செயல்திறன் மேம்பாடுகள் - கர்னல் பயன்முறை பிழை பிழைத்திருத்தம் - ஓடு பிழை பிழைத்திருத்தம் - வேறு பல திருத்தங்கள் மற்றும் மேம்பாடுகள்

# changelogs/36600.txt:1
source: What's new: - Ping feature now works independent of auto tunnel - Added convenience action for Amnezia compatibility - Added convenience action for excluding LAN from tunnel - Added debounce delay tuning option for auto tunnel - Many bug fixes and improvements
ta: புதியது என்ன: - பிங் நற்பொருத்தம் இப்போது ஆட்டோ சுரங்கப்பாதையில் இருந்து சுயாதீனமாக செயல்படுகிறது - அம்னேசியா பொருந்தக்கூடிய வசதியான நடவடிக்கை சேர்க்கப்பட்டது - சுரங்கப்பாதையில் இருந்து LAN ஐத் தவிர்ப்பதற்கான வசதியான நடவடிக்கை சேர்க்கப்பட்டது - ஆட்டோ சுரங்கப்பாதைக்கு டெபுன்ச் நேரந்தவறுகை ட்யூனிங் விருப்பம் சேர்க்கப்பட்டது - பல பிழை திருத்தங்கள் மற்றும் மேம்பாடுகள்
