Repository: 247i/TACETr
Catalog: உரை/தானி/xed-editor-xed-editor-*.po
Languages: ta

source: Edit mode
ta: திருத்தும் முறை

source: No folder opened
ta: கோப்புறை எதுவும் திறக்கப்படவில்லை

source: Cut
ta: வெட்டு

# cut_desc
source: Move document
ta: ஆவணத்தை நகர்த்தவும்

# timeout
source: Download cancelled due to timeout. Please ensure your internet connection is stable
ta: நேரம் முடிந்ததால் பதிவிறக்கம் ரத்து செய்யப்பட்டது. உங்கள் இணைய இணைப்பு நிலையானது என்பதை உறுதிப்படுத்தவும்

source: More
ta: மேலும்

source: Theme settings
ta: கருப்பொருள் அமைப்புகள்

source: Add theme
ta: கருப்பொருள் சேர்க்கவும்

# unsupported_feature
source: This feature is not supported on your device
ta: இந்த நற்பொருத்தம் உங்கள் சாதனத்தில் ஆதரிக்கப்படவில்லை

# confirm_exit
source: Are you sure you want to exit?
ta: நீங்கள் வெளியேற விரும்புகிறீர்களா?

# tab_memory_warning
source: Not enough memory is available to open this tab. Opening it may cause Xed-Editor to crash. Do you want to continue anyway?
ta: இந்த தாவலைத் திறக்க போதுமான நினைவகம் கிடைக்கவில்லை. அதைத் திறப்பது xed-editor விபத்துக்குள்ளாக்கக்கூடும். எப்படியும் தொடர விரும்புகிறீர்களா?

# read_mode_desc
source: Enable read mode by default
ta: இயல்புநிலையாக வாசிப்பு பயன்முறையை இயக்கவும்

source: Acquire wakelock
ta: வேக்கலாக் பெறுங்கள்

source: Release wakelock
ta: வேக்க்லாக் வெளியீடு

# getting_ready
source: Getting everything ready…
ta: எல்லாவற்றையும் ஆயத்தம் செய்வது…

# native_runner
source: This runner only works on native files, consider moving it to terminal home directory
ta: இந்த ரன்னர் நேட்டிவ் கோப்புகளில் மட்டுமே செயல்படும், அதை டெர்மினல் ஓம் டைரக்டரிக்கு நகர்த்தவும்

# terminal_virus_notice
source: On some devices, especially certain models from China, you may see a system security warning when many processes are running in the terminal (for example during 'apt update' or 'apt upgrade'). This is a false positive and does not indicate a real virus.
ta: சில சாதனங்களில், குறிப்பாக சீனாவின் சில மாடல்களில், டெர்மினலில் பல செயல்முறைகள் இயங்கும் போது, ​​கணினி பாதுகாப்பு எச்சரிக்கையை நீங்கள் காணலாம் (உதாரணமாக 'apt update' அல்லது 'apt upgrade' போது). இது தவறான நேர்மறை மற்றும் உண்மையான வைரசைக் குறிக்கவில்லை.

# text_mate_suggestion
source: TextMate auto-completion
ta: TextMate தானாக நிறைவு

# text_mate_suggestion_desc
source: Suggest predefined keywords
ta: முன் வரையறுக்கப்பட்ட முக்கிய வார்த்தைகளை பரிந்துரைக்கவும்

source: Don't ask again
ta: மீண்டும் கேட்காதே

source: Install
ta: நிறுவவும்

# ask_lsp_install
source: Would you like to install '%s' language server?
ta: '%s' மொழி சேவையகத்தை நிறுவ விரும்புகிறீர்களா?

# uninstall_terminal_warning
source: Permanently uninstall Ubuntu? This action cannot be undone.
ta: உபுண்டுவை நிரந்தரமாக நிறுவல் நீக்கவா? இந்தச் செயலைச் செயல்தவிர்க்க முடியாது.

source: Uninstall
ta: நிறுவல் நீக்கவும்

source: Uninstall terminal
ta: முனையத்தை நிறுவல் நீக்கவும்

# project_as_wk
source: Use project as working directory
ta: வேலை செய்யும் கோப்பகமாக திட்டத்தைப் பயன்படுத்தவும்

# project_as_wk_desc
source: Use project as working directory in terminal
ta: முனையத்தில் வேலை செய்யும் கோப்பகமாக திட்டத்தைப் பயன்படுத்தவும்

# seccomp_desc
source: Fix "function not implemented" error on some devices
ta: சில சாதனங்களில் "செயல்பாடு செயல்படுத்தப்படவில்லை" பிழையை சரிசெய்யவும்

# non_native_filetype
source: Running code is not supported in this location. Consider moving your file to the terminal's home directory to run it.
ta: இந்த இடத்தில் இயங்கும் குறியீடு ஆதரிக்கப்படவில்லை. உங்கள் கோப்பை இயக்க டெர்மினலின் ஓம் டைரக்டரிக்கு நகர்த்துவதைக் கவனியுங்கள்.

# sdcard_filetype
source: Running code is not recommended in this location. Consider moving your file to the terminal's home directory.
ta: இந்த இடத்தில் குறியீட்டை இயக்குவது பரிந்துரைக்கப்படவில்லை. உங்கள் கோப்பை டெர்மினலின் ஓம் டைரக்டரிக்கு நகர்த்துவதைக் கவனியுங்கள்.

source: Rename file
ta: கோப்பை மறுபெயரிடுங்கள்

source: New name
ta: புதிய பெயர்

source: Wrapper type
ta: ரேப்பர் வகை

source: Type
ta: வகை

source: Name
ta: பெயர்

source: View GitHub profile
ta: GitHub சுயவிவரத்தைக் காண்க

source: Debug options
ta: பிழைத்திருத்த விருப்பங்கள்

# debug_options_desc
source: Debugging options for %s
ta: %sக்கான பிழைத்திருத்த விருப்பங்கள்

source: Force crash
ta: படை விபத்து

# force_crash_desc
source: Throw a runtime exception
ta: இயக்க நேர விதிவிலக்கை எறியுங்கள்

# force_crash_confirm
source: Do you want to force crash the app? The app may freeze.
ta: பயன்பாட்டை வலுக்கட்டாயமாக சிதைக்க விரும்புகிறீர்களா? பயன்பாடு முடக்கப்படலாம்.

source: Memory usage
ta: நினைவக பயன்பாடு

source: Strict mode
ta: கண்டிப்பான முறை

# strict_mode_desc
source: Detect disk or network access on the main thread
ta: முதன்மையான தொடரிழையில் வட்டு அல்லது பிணைய அணுகலைக் கண்டறியவும்

source: ANR Watchdog
ta: ANR கண்காணிப்பகம்

# anr_watchdog_desc
source: Terminate Xed-Editor if it becomes unresponsive for more than 5 seconds
ta: Xed-Editor 5 வினாடிகளுக்கு மேல் பதிலளிக்கவில்லை என்றால் அதை நிறுத்தவும்

source: Verbose errors
ta: வாய்மொழி பிழைகள்

# verbose_errors_desc
source: Include stacktrace in error dialogs
ta: பிழை உரையாடல்களில் ச்டேக்ட்ரேசைச் சேர்க்கவும்

source: Debugger
ta: பிழைத்திருத்தி

# debugger_not_allowed
source: Debugger is not allowed on release builds
ta: வெளியீட்டு உருவாக்கங்களில் பிழைத்திருத்தம் அனுமதிக்கப்படாது

source: Capturing logcat…
ta: லாக்கேட்டைப் பிடிக்கிறது…

# unsupported_file_ext
source: Unsupported file extension
ta: ஆதரிக்கப்படாத கோப்பு நீட்டிப்பு

source: Invalid port
ta: தவறான துறைமுகம்

source: Port number
ta: துறைமுகம் எண்

# file_ext_example
source: File extension (e.g. py)
ta: கோப்பு நீட்டிப்பு (எ.கா. பை)

# logcat_saved
source: File saved in terminal home directory as logcat.txt
ta: கோப்பு டெர்மினல் ஓம் டைரக்டரியில் logcat.txt ஆக சேமிக்கப்பட்டது

source: Stop logcat
ta: லாக்கேட்டை நிறுத்து

# discord
source: Discord community
ta: கருத்து வேறுபாடு சமூகம்

# use_tabs
source: Insert tab character
ta: தாவல் எழுத்தைச் செருகவும்

# use_tabs_desc
source: Use a real tab (\t) instead of spaces for indentation
ta: உள்தள்ளலுக்கான இடைவெளிகளுக்குப் பதிலாக உண்மையான தாவலைப் (\t) பயன்படுத்தவும்

source: Language server
ta: மொழி சேவையகம்

source: Manage language servers
ta: மொழி சேவையகங்களை நிர்வகிக்கவும்

# manage_language_servers_desc
source: Install, connect and configure language servers
ta: மொழி சேவையகங்களை நிறுவவும், இணைக்கவும் மற்றும் கட்டமைக்கவும்

source: Format on save
ta: சேமிப்பில் வடிவமைப்பு

# format_on_save_desc
source: Format the file automatically when saved
ta: சேமிக்கப்படும் போது தானாகவே கோப்பை வடிவமைக்கவும்

# no_language_server
source: No language server installed.
ta: மொழி சேவையகம் நிறுவப்படவில்லை.

source: Developer
ta: உருவாக்குநர்

source: Build info
ta: செய்தி உருவாக்கவும்

source: Community
ta: சமூகம்

source: Failsafe mode
ta: தோல்வியடையும் பயன்முறை

# failsafe_mode_desc
source: Start terminal in maintenance mode
ta: பராமரிப்பு முறையில் முனையத்தைத் தொடங்கவும்

source: Render whitespace
ta: இடைவெளி விடாது

# render_whitespace_desc
source: Render spaces, tabs, and line breaks as visible symbols
ta: ச்பேச்கள், தாவல்கள் மற்றும் வரி முறிவுகளை காணக்கூடிய சின்னங்களாக வழங்கவும்

# ask_refresh
source: Are you sure you want to refresh this document? Any unsaved changes will be lost.
ta: இந்த ஆவணத்தை நிச்சயமாகப் புதுப்பிக்க விரும்புகிறீர்களா? சேமிக்கப்படாத மாற்றங்கள் அனைத்தும் இழக்கப்படும்.

# docs
source: Documentation
ta: ஆவணப்படுத்துதல்

# docs_desc
source: Visit documentation page.
ta: ஆவணப் பக்கத்தைப் பார்வையிடவும்.

source: GitHub stars
ta: அறிவிலிமையம் நட்சத்திரங்கள்

source: API Error
ta: பநிஇ பிழை

source: Unknown
ta: தெரியவில்லை

# cant_write
source: Cannot write to the file (no write permissions)
ta: கோப்பில் எழுத முடியாது (எழுதுவதற்கு இசைவு இல்லை)

# content_update
source: This file was modified by another app. Do you want to refresh? Unsaved changes will be lost.
ta: இந்தக் கோப்பு வேறொரு ஆப்சால் மாற்றப்பட்டது. புதுப்பிக்க வேண்டுமா? சேமிக்கப்படாத மாற்றங்கள் இழக்கப்படும்.

# info_lsp
source: Language servers are separate processes that provide intelligent features, such as code completion, error highlighting and inline documentation.
ta: மொழி சேவையகங்கள் என்பது தனித்தனி செயல்முறைகளாகும், அவை குறியீட்டை நிறைவு செய்தல், பிழையை முன்னிலைப்படுத்துதல் மற்றும் இன்லைன் ஆவணப்படுத்தல் போன்ற அறிவார்ந்த அம்சங்களை வழங்குகின்றன.

# experimental_lsp
source: Language servers are experimental and may not work properly.
ta: மொழி சேவையகங்கள் சோதனைக்குரியவை மற்றும் சரியாக வேலை செய்யாமல் போகலாம்.

source: Storage
ta: சேமிப்பு

source: Support
ta: உதவி

# support_desc
source: Support development
ta: உதவி மேம்பாடு

source: Translate
ta: மொழிபெயர்த்திடு

# terminal_feature
source: Terminal and runners
ta: டெர்மினல் மற்றும் ரன்னர்ச்

source: Folder name
ta: கோப்புறை பெயர்

source: Invalid characters
ta: தவறான எழுத்துகள்

# script_show_input_dialog
source: Show an input dialog
ta: உள்ளீட்டு உரையாடலைக் காட்டு

source: Properties
ta: பண்புகள்

source: Rename folder
ta: கோப்புறையை மறுபெயரிடவும்

source: Ignore case
ta: வழக்கை புறக்கணிக்கவும்

source: Regex
ta: வழக்கவெளி

source: Whole word
ta: முழு சொல்

source: Go to definition
ta: வரையறைக்குச் செல்லவும்

source: Go to references
ta: குறிப்புகளுக்குச் செல்லவும்

source: Rename symbol
ta: மறுபெயரிடு அடையாளம்

source: Format document
ta: ஆவணத்தை வடிவமைக்கவும்

source: Format selection
ta: வடிவமைப்பு தேர்வு

# go_to_definition_desc
source: Select one of the %d definitions to navigate to their location.
ta: அவற்றின் இருப்பிடத்திற்குச் செல்ல %d வரையறைகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

# go_to_references_desc
source: Select one of the %d references to navigate to their location.
ta: அவற்றின் இருப்பிடத்திற்குச் செல்ல %d குறிப்புகளில் ஒன்றைத் தேர்ந்தெடுக்கவும்.

source: No definitions found.
ta: வரையறைகள் இல்லை.

source: No references found.
ta: குறிப்புகள் எதுவும் இல்லை.

# find_definitions_error
source: Unable to find definitions.
ta: வரையறைகளைக் கண்டுபிடிக்க முடியவில்லை.

# find_references_error
source: Unable to find references.
ta: குறிப்புகளைக் கண்டுபிடிக்க முடியவில்லை.

# rename_symbol_error
source: Unable to rename symbol.
ta: சின்னத்தை மறுபெயரிட முடியவில்லை.

# cannot_rename_symbol
source: You cannot rename this symbol.
ta: இந்த சின்னத்தை நீங்கள் மறுபெயரிட முடியாது.

# rename_symbol_multiple_files
source: Renaming across multiple files is not supported yet.
ta: பல கோப்புகளில் மறுபெயரிடுவது இன்னும் ஆதரிக்கப்படவில்லை.

# format_document_error
source: Unable to format document.
ta: ஆவணத்தை வடிவமைக்க முடியவில்லை.

# format_selection_error
source: Unable to format selection.
ta: தேர்வை வடிவமைக்க முடியவில்லை.

# continue_action
source: Continue
ta: தொடரவும்

source: Enable sticky scroll
ta: ஒட்டும் உருளை இயக்கவும்

# enable_sticky_scroll_desc
source: Keep the current code block header visible while scrolling
ta: ச்க்ரோலிங் செய்யும் போது தற்போதைய குறியீடு பிளாக் தலைப்பைத் தெரியும்படி வைக்கவும்

# enable_quick_deletion
source: Enable quick line deletion
ta: விரைவான வரி நீக்குதலை இயக்கு

# enable_quick_deletion_desc
source: Automatically delete the entire line if it is empty
ta: முழு வரியும் காலியாக இருந்தால் தானாகவே நீக்கவும்

source: Type command
ta: கட்டளையை தட்டச்சு செய்யவும்

source: Select language
ta: மொழியைத் தேர்ந்தெடுக்கவும்

source: (Recently used)
ta: (சமீபத்தில் பயன்படுத்தப்பட்டது)

source: Command palette
ta: கட்டளை தட்டு

# rename_failed
source: Unable to rename file
ta: கோப்பை மறுபெயரிட முடியவில்லை

# delete_failed
source: Unable to delete file
ta: கோப்பை நீக்க முடியவில்லை

# debug_mode_warn
source: Debug mode disables safety restrictions, which could lead to data loss or other issues if misused. Only enable it if you know what you're doing.
ta: பிழைத்திருத்த பயன்முறை பாதுகாப்புக் கட்டுப்பாடுகளை முடக்குகிறது, இது தவறாகப் பயன்படுத்தினால் தரவு இழப்பு அல்லது பிற சிக்கல்களுக்கு வழிவகுக்கும். நீங்கள் என்ன செய்கிறீர்கள் என்று தெரிந்தால் மட்டுமே அதை இயக்கவும்.

source: External LSP
ta: வெளிப்புற எல்எச்பி

source: External
ta: வெளி

# desktop_mode
source: Desktop Mode (Experimental)
ta: டெச்க்டாப் பயன்முறை (பரிசோதனை)

# desktop_mode_desc
source: Makes the app easier to use on tablets and desktop-sized screens
ta: டேப்லெட்டுகள் மற்றும் டெச்க்டாப் அளவிலான திரைகளில் பயன்பாட்டைப் பயன்படுத்துவதை எளிதாக்குகிறது

source: Built-in
ta: உள்ளமைக்கப்பட்ட

# change_lang_warn
source: Changing the language will restart this screen to apply the new language immediately. This may briefly show a blank screen, which could potentially trigger discomfort in people with photosensitive epilepsy.
ta: மொழியை மாற்றினால், புதிய மொழியை உடனடியாகப் பயன்படுத்த இந்தத் திரை மீண்டும் தொடங்கும். இது சுருக்கமாக ஒரு வெற்றுத் திரையைக் காட்டலாம், இது ஒளிச்சேர்க்கை கால்-கை வலிப்பு உள்ளவர்களுக்கு அசௌகரியத்தைத் தூண்டும்.

source: Address
ta: முகவரி

source: Invalid address
ta: தவறான முகவரி

source: Select all
ta: அனைத்தையும் தெரிவுசெய்

source: Select word
ta: வார்த்தையைத் தேர்ந்தெடுக்கவும்

source: Duplicate line
ta: நகல் வரி

# show_nav_extra_keys
source: Show navigation keys
ta: வழிசெலுத்தல் விசைகளைக் காட்டு

# show_nav_extra_keys_desc
source: Display navigation buttons as extra keys
ta: வழிசெலுத்தல் பொத்தான்களை கூடுதல் விசைகளாகக் காண்பி

# change_extra_keys
source: Edit extra keys
ta: கூடுதல் விசைகளைத் திருத்தவும்

# change_extra_keys_desc
source: Customize the extra keys shown above the keyboard
ta: விசைப்பலகைக்கு மேலே காட்டப்பட்டுள்ள கூடுதல் விசைகளைத் தனிப்பயனாக்கவும்

# change_extra_symbols
source: Edit extra symbols
ta: கூடுதல் சின்னங்களைத் திருத்தவும்

# change_extra_symbols_desc
source: Customize the characters shown in the extra keys panel
ta: கூடுதல் விசைகள் பேனலில் காட்டப்படும் எழுத்துக்களைத் தனிப்பயனாக்குங்கள்

# info_extra_keys
source: Extra keys are commands and symbols shown in a panel above the keyboard. You can long-press and drag to change the order of commands, or tap the button to add a new command. You can also customize the symbols using the final option.
ta: கூடுதல் விசைகள் என்பது விசைப்பலகைக்கு மேலே உள்ள பேனலில் காட்டப்படும் கட்டளைகள் மற்றும் குறியீடுகள். கட்டளைகளின் வரிசையை மாற்ற நீங்கள் நீண்ட நேரம் அழுத்தி இழுக்கலாம் அல்லது புதிய கட்டளையைச் சேர்க்க பொத்தானைத் தட்டவும். இறுதி விருப்பத்தைப் பயன்படுத்தி சின்னங்களையும் தனிப்பயனாக்கலாம்.

source: Symbols
ta: குறியிடுகள்

source: Commands
ta: கட்டளைகள்

source: Toolbar actions
ta: கருவிப்பட்டி செயல்கள்

# toolbar_actions_desc
source: Choose which actions appear in the app bar
ta: பயன்பாட்டுப் பட்டியில் எந்தச் செயல்கள் தோன்றும் என்பதைத் தேர்வுசெய்யவும்

source: Add command
ta: கட்டளையைச் சேர்க்கவும்

# info_toolbar_actions
source: Toolbar actions define which commands are shown in the toolbar when a file is open. You can long-press and drag to change their order, or tap the button to add a new command.
ta: ஒரு கோப்பு திறந்திருக்கும் போது கருவிப்பட்டியில் எந்த கட்டளைகள் காட்டப்படும் என்பதை கருவிப்பட்டி செயல்கள் வரையறுக்கின்றன. அவற்றின் வரிசையை மாற்ற நீண்ட நேரம் அழுத்தி இழுக்கலாம் அல்லது புதிய கட்டளையைச் சேர்க்க பொத்தானைத் தட்டவும்.

source: Disable
ta: முடக்கு

source: Calculating…
ta: கணக்கிடுகிறது…

source: Permissions
ta: அனுமதிகள்

# lsp_process_desc
source: The terminal's initialization scripts, e.g., /initrc and .bashrc, will not run before this command.
ta: முனையத்தின் துவக்க ச்கிரிப்டுகள், எ.கா., /initrc மற்றும் .bashrc, இந்த கட்டளைக்கு முன் இயங்காது.

source: Command
ta: கட்டளை

source: Empty command
ta: வெற்று கட்டளை

source: Socket
ta: மாட்டி

source: Process
ta: செயல்முறை

# project_restore_failed
source: Failed to restore projects
ta: திட்டப்பணிகளை மீட்டெடுக்க முடியவில்லை

source: Theme flipper
ta: கருப்பொருள் ஃபிளிப்பர்

# theme_flipper_desc
source: Constantly change the theme mode every 7s
ta: ஒவ்வொரு 7 வினாடிகளுக்கும் கருப்பொருள் பயன்முறையை தொடர்ந்து மாற்றவும்

source: Show tab icons
ta: தாவல் ஐகான்களைக் காட்டு

# show_tab_icons_desc
source: Show file icons beside tab titles
ta: தாவல் தலைப்புகளுக்கு அருகில் கோப்பு ஐகான்களைக் காட்டு

# lsp_terminal_unavailable
source: LSP language features will not work because the terminal environment is unavailable or not functioning.
ta: டெர்மினல் சூழல் கிடைக்கவில்லை அல்லது செயல்படாததால் LSP மொழி நற்பொருத்தங்கள் செயல்படாது.

# invalid_intent
source: Received invalid intent: %s
ta: தவறான நோக்கம் பெறப்பட்டது: %s

source: Add parent command
ta: பெற்றோர் கட்டளையைச் சேர்க்கவும்

source: Jump to line
ta: வரிக்குச் செல்லவும்

source: Line number
ta: வரி எண்

# search_file_folder
source: Search files in project
ta: திட்டத்தில் கோப்புகளைத் தேடுங்கள்

# search_code
source: Search code in project
ta: திட்டத்தில் தேடல் குறியீடு

# incompatible_theme_warning
source: This theme is not compatible with your current version of Xed-Editor. Would you like to proceed anyway?
ta: இந்தத் கருப்பொருள் உங்கள் தற்போதைய Xed-Editor பதிப்போடு இணங்கவில்லை. எப்படியும் தொடர விரும்புகிறீர்களா?

# theme_install_failed
source: Theme installation failed
ta: கருப்பொருள் நிறுவல் தோல்வியடைந்தது

# theme_id_missing
source: JSON file does not specify a valid theme ID. Please add one and try again.
ta: சாதொபொகு கோப்பு சரியான கருப்பொருள் ஐடியைக் குறிப்பிடவில்லை. ஒன்றைச் சேர்த்து மீண்டும் முயற்சிக்கவும்.

# theme_name_missing
source: JSON file does not specify a valid theme name. Please add one and try again.
ta: சாதொபொகு கோப்பு சரியான கருப்பொருள் பெயரைக் குறிப்பிடவில்லை. ஒன்றைச் சேர்த்து மீண்டும் முயற்சிக்கவும்.

# theme_version_missing
source: JSON file does not specify a valid target version. Please add one and try again.
ta: சாதொபொகு கோப்பு சரியான இலக்கு பதிப்பைக் குறிப்பிடவில்லை. ஒன்றைச் சேர்த்து மீண்டும் முயற்சிக்கவும்.

# enter_code_snippet
source: Enter a code snippet
ta: குறியீடு துணுக்கை உள்ளிடவும்

# empty_code_results
source: Enter a search query to find in files
ta: கோப்புகளில் தேட தேடல் வினவலை உள்ளிடவும்

# no_results
source: No results found
ta: முடிவுகள் எதுவும் கிடைக்கவில்லை

# results
source: %d results found
ta: %d முடிவுகள் கிடைத்தன

# enter_name
source: Enter a name
ta: ஒரு பெயரை உள்ளிடவும்

# show_hidden_files_drawer
source: Show hidden files in drawer
ta: டிராயரில் மறைக்கப்பட்ட கோப்புகளைக் காட்டு

# show_hidden_files_drawer_desc
source: Show hidden files or folders like .git in the drawer
ta: மறைக்கப்பட்ட கோப்புகள் அல்லது .git போன்ற கோப்புறைகளை டிராயரில் காட்டு

# show_hidden_files_search
source: Show hidden files in search
ta: தேடலில் மறைக்கப்பட்ட கோப்புகளைக் காட்டு

# show_hidden_files_search_desc
source: Show hidden files or folders in the search results
ta: தேடல் முடிவுகளில் மறைக்கப்பட்ட கோப்புகள் அல்லது கோப்புறைகளைக் காட்டு

# emulate_editor_key
source: Emulate editor key press
ta: எமுலேட் எடிட்டர் கீ அழுத்தவும்

# select_key
source: Select key code
ta: முக்கிய குறியீட்டைத் தேர்ந்தெடுக்கவும்

source: Split extra keys
ta: கூடுதல் விசைகளை பிரிக்கவும்

# split_extra_keys_desc
source: Split extra key panel into two rows to separate commands and symbols
ta: கட்டளைகள் மற்றும் சின்னங்களைப் பிரிக்க கூடுதல் விசைப் பலகத்தை இரண்டு வரிசைகளாகப் பிரிக்கவும்

# disclaimer_heading
source: Terms of Use & Disclaimer
ta: பயன்பாட்டு விதிமுறைகள் & மறுப்பு

# disclaimer_read_carefully
source: Please read carefully before using this application.
ta: இந்த பயன்பாட்டைப் பயன்படுத்துவதற்கு முன்பு கவனமாகப் படிக்கவும்.

source: Data Loss Risk
ta: தரவு இழப்பு இடர்

# data_loss_risk_content
source: This application is provided for use with the understanding that data loss may occur due to unforeseen circumstances, including but not limited to: software instability, system failures, unexpected termination, or storage hardware issues. Users are solely responsible for maintaining independent, regular backups of all critical data.
ta: மென்பொருள் உறுதியற்ற தன்மை, கணினி தோல்விகள், எதிர்பாராத நிறுத்தம் அல்லது சேமிப்பக வன்பொருள் சிக்கல்கள் உட்பட, ஆனால் இவை மட்டும் அல்லாமல், எதிர்பாராத சூழ்நிலைகளால் தரவு இழப்பு ஏற்படக்கூடும் என்பதைப் புரிந்துகொள்வதற்காக இந்தப் பயன்பாடு வழங்கப்படுகிறது. அனைத்து முக்கியமான தரவுகளின் சுயாதீனமான, வழக்கமான காப்புப்பிரதிகளை பராமரிப்பதற்கு பயனர்கள் மட்டுமே பொறுப்பு.

source: Terminal Risks
ta: முனைய அபாயங்கள்

# terminal_risks_content
source: This application includes terminal functionality that provides direct access to your filesystem. Improper use of terminal commands can result in: • Permanent deletion of files or directories • Security vulnerabilities • Loss of critical data You are responsible for understanding the commands you execute and their potential consequences.
ta: இந்தப் பயன்பாட்டில் டெர்மினல் செயல்பாடு உள்ளது, இது உங்கள் கோப்பு முறைமைக்கு நேரடி அணுகலை வழங்குகிறது. டெர்மினல் கட்டளைகளை தவறாகப் பயன்படுத்தினால் பின்வருபவை ஏற்படலாம்: • கோப்புகள் அல்லது கோப்பகங்களை நிரந்தரமாக நீக்குதல் • பாதுகாப்பு பாதிப்புகள் • முக்கியமான தரவு இழப்பு நீங்கள் செயல்படுத்தும் கட்டளைகள் மற்றும் அவற்றின் சாத்தியமான விளைவுகளைப் புரிந்துகொள்வதற்கு நீங்கள் பொறுப்பு.

# third_party_ext
source: Third-Party Extensions
ta: மூன்றாம் தரப்பு நீட்டிப்புகள்

# third_party_ext_content
source: This application supports third-party extensions that may be developed by external parties. These extensions can: • Access and modify your files and data • Execute arbitrary code on your system • Contain bugs, vulnerabilities, or malicious code • Cause system instability or crashes • Compromise your security or privacy We do not review, endorse, or take responsibility for any third-party extensions. You install and use extensions entirely at your own risk. We are not liable for any damage, data loss, or security issues caused by third-party extensions.
ta: இந்தப் பயன்பாடு வெளிப்புற தரப்பினரால் உருவாக்கப்படக்கூடிய மூன்றாம் தரப்பு நீட்டிப்புகளை ஆதரிக்கிறது. இந்த நீட்டிப்புகள்: • உங்கள் கோப்புகள் மற்றும் தரவை அணுகலாம் மற்றும் மாற்றலாம் • உங்கள் கணினியில் தன்னிச்சையான குறியீட்டை இயக்கவும் • பிழைகள், பாதிப்புகள் அல்லது தீங்கிழைக்கும் குறியீடு உள்ளது • கணினி உறுதியற்ற தன்மை அல்லது செயலிழப்புகளை ஏற்படுத்துகிறது • உங்கள் பாதுகாப்பு அல்லது தனியுரிமையை வேறுபாடின்மை செய்யுங்கள் எந்தவொரு மூன்றாம் தரப்பு நீட்டிப்புகளையும் நாங்கள் மதிப்பாய்வு செய்யவோ, அங்கீகரிக்கவோ அல்லது பொறுப்பேற்கவோ மாட்டோம். நீங்கள் முழுவதுமாக உங்கள் சொந்த ஆபத்தில் நீட்டிப்புகளை நிறுவி பயன்படுத்துகிறீர்கள். மூன்றாம் தரப்பு நீட்டிப்புகளால் ஏற்படும் சேதம், தரவு இழப்பு அல்லது பாதுகாப்புச் சிக்கல்களுக்கு நாங்கள் பொறுப்பல்ல.

source: No Warranty
ta: பொறுப்பு இல்லை

# no_warranty_content
source: This software is distributed under the GNU General Public License v3.0 and is provided AS IS, WITHOUT WARRANTY OF ANY KIND, either express or implied, including but not limited to the warranties of merchantability, fitness for a particular purpose, and noninfringement.
ta: இந்த மென்பொருள் GNU பொது பொது உரிமம் v3.0 இன் கீழ் விநியோகிக்கப்படுகிறது மற்றும் எந்த விதமான உத்திரவாதமும் இல்லாமல், வணிகத்திறன், ஒரு குறிப்பிட்ட நோக்கத்திற்கான தகுதி மற்றும் மீறல் இல்லாத உத்தரவாதங்கள் உட்பட ஆனால் அவை மட்டும் அல்லாமல், வெளிப்படையான அல்லது மறைமுகமாக வழங்கப்படுகிறது.

# not_liable
source: Limitation of Liability
ta: பொறுப்பு வரம்பு

# not_liable_content
source: In no event shall the developers or copyright holders be liable for any claims, damages, or losses arising from the use of this software. This includes, without limitation: loss of data, system malfunctions, loss of revenue, or any incidental or consequential damages, even if advised of the possibility of such damage.
ta: எந்தவொரு சந்தர்ப்பத்திலும், இந்த மென்பொருளின் பயன்பாட்டிலிருந்து எழும் எந்தவொரு உரிமைகோரல்கள், சேதங்கள் அல்லது இழப்புகளுக்கு உருவாக்குபவர்கள் அல்லது பதிப்புரிமை வைத்திருப்பவர்கள் பொறுப்பேற்க மாட்டார்கள். இதில் வரம்புகள் இல்லாமல்: தரவு இழப்பு, சிச்டம் செயலிழப்புகள், வருவாய் இழப்பு அல்லது ஏதேனும் தற்செயலான அல்லது விளைவான சேதங்கள், அத்தகைய சேதத்தின் நிகழக்கூடிய குறித்து அறிவுறுத்தப்பட்டாலும் கூட.

# consent_statement
source: By clicking I Accept, you acknowledge that you have read, understood, and agree to these terms.
ta: நான் ஏற்றுக்கொள்கிறேன் என்பதைக் சொடுக்கு செய்வதன் மூலம், நீங்கள் இந்த விதிமுறைகளைப் படித்து, புரிந்துகொண்டு, ஒப்புக்கொண்டீர்கள் என்பதை ஒப்புக்கொள்கிறீர்கள்.

source: Decline
ta: நிராகரி

# i_accept_disabled
source: I Accept (%s)
ta: நான் ஏற்கிறேன் (%s)

source: I Accept
ta: நான் ஏற்றுக்கொள்கிறேன்

source: Keybindings
ta: விசைப்பலகைகள்
