Repository: 247i/TACETr
Catalog: உரை/தானி/xed-editor-xed-editor-*.po
Languages: ta

# app_name
source: Xed-Editor
ta: Xed-எடிட்டர்

# open_drawer
source: Open
ta: திற

# close_drawer
source: Close
ta: மூடு

# not_implemented
source: This feature is not implemented
ta: இந்த நற்பொருத்தம் செயல்படுத்தப்படவில்லை

source: Unsupported content
ta: ஆதரிக்கப்படாத உள்ளடக்கம்

# null_content
source: Error: content is null
ta: பிழை: உள்ளடக்கம் பூச்யமானது

source: Restart required
ta: மறுதொடக்கம் தேவை

# saved
source: File saved
ta: சேமிக்கப்பட்டது

# saved_all
source: Saved all files
ta: எல்லா கோப்புகளையும் சேமித்தது

source: Save
ta: சேமி

# word_wrap_wait
source: Please wait for word wrap to complete
ta: சொல் மடக்கு முடிவடையும் வரை காத்திருங்கள்

source: Open file or folder
ta: கோப்பு அல்லது கோப்புறையைத் திறக்கவும்

# open_directory
source: Open a directory
ta: ஒரு கோப்பகத்தைத் திறக்கவும்

source: New file
ta: புதிய கோப்பு

# new_file_hint
source: Name (e.g. test.txt)
ta: பெயர் (எ.கா. test.txt)

# mime
source: MIME type (e.g. text/plain)
ta: MIME வகை (எ.கா. உரை/வெற்று)

# rep
source: Replacement
ta: மாற்று

source: Search keyword
ta: தேடல் முக்கிய சொல்

# cs
source: Case sensitive
ta: கேச் சென்சிட்டிவ்

# wait
source: Please wait…
ta: தயவுசெய்து காத்திருங்கள்…

source: Report issue
ta: சிக்கல் அறிக்கை

source: Copy
ta: நகலெடு

source: Save all
ta: அனைத்தையும் சேமி

source: Undo
ta: செயல்தவிர்

source: Settings
ta: அமைப்புகள்

source: Print
ta: அச்சிடுக

source: Search
ta: தேடல்

# go_next
source: Next
ta: அடுத்தது

# go_prev
source: Prev
ta: முந்தைய

source: Close search
ta: தேடலை மூடு

source: Replace
ta: மாற்றவும்

source: Share
ta: பங்கு

source: Reselect
ta: மீண்டும் தேர்ந்தெடுக்கவும்

source: Open file
ta: கோப்பு திற

source: New folder
ta: புதிய கோப்புறை

source: Rename
ta: மறுபெயரிடுங்கள்

source: Open with…
ta: இதனுடன் திற…

source: Save as
ta: என சேமி

source: Paste
ta: ஒட்டு

source: Delete
ta: நீக்கு

source: Close this
ta: இதை மூடு

source: Close others
ta: மற்றவர்களை மூடு

source: Close all
ta: அனைத்தையும் மூடு

source: Insert date
ta: தேதியைச் செருகவும்

source: Close
ta: மூடு

# unsaved
source: Unsaved files
ta: சேமிக்கப்படாத கோப்புகள்

# unsaved_files
source: You have unsaved files!
ta: உங்களிடம் சேமிக்கப்படாத கோப்புகள் உள்ளன!

source: Cancel
ta: ரத்துசெய்

# save_exit
source: Save and exit
ta: சேமித்து வெளியேறவும்

source: Exit
ta: வெளியேறு

# restart_to_apply
source: Please restart to apply settings
ta: அமைப்புகளைப் பயன்படுத்த மறுதொடக்கம் செய்யுங்கள்

# oled
source: Black theme
ta: கருப்பு கருப்பொருள்

source: Word wrap
ta: சொல் மடக்கு

source: Keep drawer locked
ta: டிராயரை பூட்டிக் கொள்ளுங்கள்

source: Restart
ta: மறுதொடக்கம்

# refresh
source: Reload
ta: மறுஏற்றம்

# dir_example
source: Name (e.g. Test)
ta: பெயர் (எ.கா. சோதனை)

source: Create
ta: உருவாக்கு

# already_exists
source: A document already exist with this name
ta: இந்த பெயருடன் ஏற்கனவே ஒரு ஆவணம் உள்ளது

source: Attention
ta: கவனம்

# ask_del
source: Are you sure you want to permanently delete '%s'?
ta: '%s' ஐ நிரந்தரமாக நீக்க விரும்புகிறீர்களா?

# reselect_dir
source: Please reselect the directory
ta: கோப்பகத்தை மீண்டும் தேர்ந்தெடுக்கவும்

# cant_handle
source: No app found to handle the file
ta: கோப்பைக் கையாள எந்த பயன்பாடும் கிடைக்கவில்லை

source: Terminal
ta: முனையத்தில்

# add_file
source: Add external file
ta: வெளிப்புற கோப்பைச் சேர்க்கவும்

# open_as_project
source: Open as a project
ta: திட்டமாக திறக்கவும்

source: Keyword (regex)
ta: முக்கிய சொல் (regex)

source: Replace all
ta: Followeall

source: Replacement
ta: மாற்று

# tab_text_1
source: Tab 1
ta: தாவல் 1

# tab_text_2
source: Tab 2
ta: தாவல் 2

source: Title
ta: தலைப்பு

source: Description
ta: விவரம்

source: Download
ta: பதிவிறக்கம்

# dir_exist_not
source: Folder does not exists
ta: கோப்புறை இல்லை

source: File saved
ta: கோப்பு சேமிக்கப்பட்டது

source: Apply
ta: இடு

source: User data
ta: பயனர் தரவு

# invalid_userdata
source: User data is not valid. Change it in settings
ta: பயனர் தரவு செல்லுபடியாகாது. அமைப்புகளில் மாற்றவும்

source: Open in Terminal
ta: டெர்மினலில் திறக்கவும்

# open_dir_in_terminal
source: Open directory in Terminal
ta: டெர்மினலில் கோப்பகத்தைத் திறக்கவும்

# file_open_denied
source: Opening this file with other apps is not permitted
ta: இந்த கோப்பை மற்ற பயன்பாடுகளுடன் திறக்க அனுமதிக்கப்படாது

# reload_file_tree
source: Reload files
ta: கோப்புகளை மீண்டும் ஏற்றவும்

# close_current_project
source: Are you sure you want to close the project '%s'?
ta: '%s' திட்டத்தை நிச்சயமாக மூட விரும்புகிறீர்களா?

# rename_desc
source: Rename the document
ta: ஆவணத்தை மறுபெயரிடுங்கள்

# open_with_other
source: Open selected file in other apps
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பை மற்ற பயன்பாடுகளில் திறக்கவும்

# delete_desc
source: Permanently delete document
ta: ஆவணத்தை நிரந்தரமாக நீக்கவும்

# add_file_desc
source: Select a new file to be added here
ta: இங்கே சேர்க்க புதிய கோப்பைத் தேர்ந்தெடுக்கவும்

# create_new_file_desc
source: Create a new file under selected folder
ta: தேர்ந்தெடுக்கப்பட்ட கோப்புறையின் கீழ் புதிய கோப்பை உருவாக்கவும்

# paste_desc
source: Paste document
ta: ஆவணத்தை ஒட்டவும்

# clipboard_empty
source: File clipboard is empty
ta: கோப்பு இடைநிலைப்பலகை காலியாக உள்ளது

# save_desc
source: Save the selected file somewhere else
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பை வேறு எங்காவது சேமிக்கவும்

# copy_desc
source: Copy document
ta: ஆவணத்தை நகலெடுக்கவும்

# failed_move
source: Failed to move file
ta: கோப்பை நகர்த்துவதில் தோல்வி

source: File name
ta: கோப்பு பெயர்

# ff_path
source: File or folder path
ta: கோப்பு அல்லது கோப்புறை பாதை

source: Path
ta: பாதை

source: Open
ta: திற

# enter_path
source: Please enter a path
ta: தயவுசெய்து ஒரு பாதையை உள்ளிடவும்

# invalid_path
source: Path does not exist
ta: பாதை இல்லை

source: Permission denied
ta: இசைவு மறுக்கப்பட்டது

source: Manage storage
ta: சேமிப்பகத்தை நிர்வகிக்கவும்

# manage_storage_reason
source: Xed-Editor needs access to edit files in your storage. Please allow the access in the upcoming system setting.
ta: உங்கள் சேமிப்பகத்தில் கோப்புகளைத் திருத்த XED-EDITOR க்கு அணுகல் தேவை. வரவிருக்கும் கணினி அமைப்பில் அணுகலை அனுமதிக்கவும்.

source: OK
ta: சரி

# data_clear
source: App data is cleared
ta: பயன்பாட்டு தரவு அழிக்கப்படுகிறது

# action_done
source: Action completed
ta: செயல் முடிந்தது

# clone_repo
source: Clone repository
ta: நகலி களஞ்சியம்

# exists
source: Already exists!
ta: ஏற்கனவே உள்ளது!

source: Private files
ta: தனிப்பட்ட கோப்புகள்

# private_files_desc
source: Private files of Xed-Editor
ta: Xed-Editor இன் தனிப்பட்ட கோப்புகள்

# cloning
source: Cloning repository…
ta: குளோனிங் களஞ்சியம்…

source: Error
ta: பிழை

# open_dir_desc
source: Open a directory via system file picker
ta: சிச்டம் பைல் பிக்கர் வழியாக ஒரு கோப்பகத்தைத் திறக்கவும்

# open_file_desc
source: Choose a file to directly edit it
ta: அதை நேரடியாக திருத்த ஒரு கோப்பைத் தேர்வுசெய்க

# open_path
source: Internal storage
ta: உள் சேமிப்பு

# open_path_desc
source: Open internal storage
ta: உள் சேமிப்பகத்தைத் திறக்கவும்

source: Add
ta: கூட்டு

# already_opened
source: File already opened
ta: கோப்பு ஏற்கனவே திறக்கப்பட்டுள்ளது

# open_cant
source: Cannot open more than
ta: விட அதிகமாக திறக்க முடியாது

source: Files
ta: கோப்புகள்

source: Installed
ta: நிறுவப்பட்டது

source: Available
ta: கிடைக்கிறது

source: Already installed
ta: ஏற்கனவே நிறுவப்பட்டது

# download_sure
source: Are you sure you want to download '%s'?
ta: '%s' ஐ நிச்சயமாகப் பதிவிறக்க விரும்புகிறீர்களா?

source: Yes
ta: ஆம்

# fetch_failed
source: Fetch request returned null
ta: பெறுதல் கோரிக்கை பூச்யமாக திரும்பியது

# app
source: Application
ta: பயன்பாடு

# oled_desc
source: Applies a pure black theme
ta: தூய கருப்பு கருப்பொருள் பொருந்தும்

source: Themes
ta: கருப்பொருள்கள்

source: Change theme
ta: கருப்பொருள் மாற்றவும்

source: Editor
ta: திருத்தி

source: Smooth tabs
ta: மென்மையான தாவல்கள்

# smooth_tab_desc
source: Smoothly switch between tabs
ta: தாவல்களுக்கு இடையில் சீராக மாறவும்

# word_wrap_desc
source: Enable word wrap in all editors
ta: அனைத்து ஆசிரியர்களிடமும் சொல் மடக்கை இயக்கவும்

# drawer_lock_desc
source: Keep drawer locked when opening file
ta: கோப்பைத் திறக்கும்போது டிராயரை பூட்டிக் கொள்ளுங்கள்

# diagonal_scroll
source: Diagonal scrolling
ta: மூலைவிட்ட ச்க்ரோலிங்

# diagonal_scroll_desc
source: Enable diagonal scrolling in file tree
ta: கோப்பு மரத்தில் மூலைவிட்ட ச்க்ரோலிங்கை இயக்கவும்

# cursor_anim
source: Cursor animation
ta: கர்சர் அனிமேசன்

# cursor_anim_desc
source: Enable smooth cursor animations
ta: மென்மையான கர்சர் அனிமேசன்களை இயக்கு

# show_line_number
source: Show line numbers
ta: வரி எண்களைக் காட்டு

# pin_line_number
source: Pin line numbers
ta: பின் வரி எண்கள்

source: Extra keys
ta: கூடுதல் விசைகள்

# extra_keys_desc
source: Show extra keys above the keyboard
ta: விசைப்பலகைக்கு மேலே கூடுதல் விசைகளைக் காட்டு

source: Auto save
ta: தானியங்கு சேமிப்பு

# auto_save_desc
source: Automatically save file
ta: கோப்பை தானாகவே சேமிக்கவும்

# interval_in_ms
source: Interval in milliseconds
ta: மில்லி விநாடிகளில் இடைவெளி

# value_invalid
source: Invalid value
ta: தவறான மதிப்பு

# value_small
source: Value too small
ta: மதிப்பு மிகவும் சிறியது

# value_large
source: Value too large
ta: மதிப்பு மிகப் பெரியது

source: Text size
ta: உரை அளவு

# text_size_desc
source: Set text size
ta: உரை அளவை அமைக்கவும்

source: Tab size
ta: தாவல் அளவு

# tab_size_desc
source: Number of spaces inserted for a tab character
ta: எண் of இடங்கள் inserted க்கு a தாவல் எழுத்து

# monet
source: Dynamic colors
ta: மாறும் நிறங்கள்

# monet_desc
source: Use device theme in app
ta: பயன்பாட்டில் சாதன கருப்பொருளைப் பயன்படுத்து

# restart_app
source: Please restart the application.
ta: விண்ணப்பத்தை மறுதொடக்கம் செய்யுங்கள்.

# old_android
source: Unsupported Android version
ta: ஆதரிக்கப்படாத ஆண்ட்ராய்டு பதிப்பு

# app_desc
source: General application settings
ta: பொது பயன்பாட்டு அமைப்புகள்

# editor_desc
source: General editor settings
ta: பொது திருத்தி அமைப்புகள்

# terminal_desc
source: General terminal settings
ta: பொது முனைய அமைப்புகள்

source: Terminal text size
ta: முனைய உரை அளவு

# terminal_text_size_desc
source: Set terminal text size
ta: முனைய உரை அளவை அமைக்கவும்

source: Unknown error
ta: தெரியாத பிழை

# is_null
source: InputStream is null
ta: உள்ளீட்டு நீரோடை பூச்யமாகும்

# wait_pkg
source: Please wait while the packages are being downloaded.
ta: தொகுப்புகள் பதிவிறக்கம் செய்யப்படும்போது தயவுசெய்து காத்திருங்கள்.

# unsupported_aarch
source: Unsupported platform, use fail safe
ta: ஆதரிக்கப்படாத இயங்குதளம், ஃபெயில் சேஃப் பயன்படுத்தவும்

# pkg_download_failed
source: Package download failed
ta: தொகுப்பு பதிவிறக்கம் தோல்வியடைந்தது

# copy_failed
source: Failed to copy file
ta: கோப்பை நகலெடுப்பதில் தோல்வி

# install_done
source: Installed successfully
ta: வெற்றிகரமாக நிறுவப்பட்டது

# invalid_file_type
source: Invalid file type, ZIP file expected
ta: தவறான கோப்பு வகை, ZIP கோப்பு எதிர்பார்க்கப்படுகிறது

# install_failed
source: Failed to install
ta: நிறுவத் தவறிவிட்டது

source: Choose file
ta: கோப்பைத் தேர்வுசெய்க

source: Force char
ta: ஃபோர்ச் சார்

# force_char_desc
source: Force char based input in Terminal
ta: டெர்மினலில் சார் அடிப்படையிலான உள்ளீட்டை கட்டாயப்படுத்தவும்

source: Use Ctrl workaround
ta: கட்டுப்பாடு பணித்தொகுப்பைப் பயன்படுத்தவும்

# use_ctrl_workaround_desc
source: Use Ctrl+Space workaround
ta: கட்டுப்பாடு விண்வெளி பணித்தொகுப்பைப் பயன்படுத்தவும்

source: Editor font
ta: எடிட்டர் எழுத்துரு

# editor_font_desc
source: Select editor font
ta: எடிட்டர் எழுத்துருவைத் தேர்ந்தெடுக்கவும்

# force_desktop
source: Force desktop mode
ta: கட்டாய டெச்க்டாப் பயன்முறை

# force_desktop_desc
source: Force desktop layout on smaller screen devices
ta: சிறிய திரை சாதனங்களில் டெச்க்டாப் தளவமைப்பை கட்டாயப்படுத்தவும்

# force_normal
source: Force normal mode
ta: சாதாரண பயன்முறையை கட்டாயப்படுத்தவும்

# force_normal_desc
source: Force normal layout on large screen devices
ta: பெரிய திரை சாதனங்களில் இயல்பான தளவமைப்பை கட்டாயப்படுத்தவும்

# light_mode
source: Light
ta: ஒளி

# dark_mode
source: Dark
ta: இருண்ட

# auto_mode
source: Auto
ta: தானி

source: Theme mode
ta: கருப்பொருள் பயன்முறை

# cannot_be_empty
source: It cannot be empty.
ta: அது காலியாக இருக்க முடியாது.

# theme_mode_desc
source: Change app color theme
ta: பயன்பாட்டின் வண்ண கருப்பொருள் மாற்று

# show_suggestions
source: Show keyboard suggestions
ta: விசைப்பலகை பரிந்துரைகளைக் காட்டு

source: About
ta: பற்றி

# about_desc
source: About Xed-Editor
ta: Xed-editor பற்றி

source: Version
ta: பதிப்பு

source: Version code
ta: பதிப்பு குறியீடு

source: GitHub
ta: கிரப்

# github_desc
source: Star it on GitHub 🤩
ta: GitHub 🤩 இல் நட்சத்திரமிடுங்கள்

# telegram
source: Telegram group
ta: தந்தி குழு

# telegram_desc
source: Report issues, feature requests etc.
ta: அறிக்கைகள் சிக்கல்கள், அம்ச கோரிக்கைகள் போன்றவை.

source: Join
ta: சேர

source: Show virtual keyboard
ta: மெய்நிகர் விசைப்பலகையைக் காட்டு

# show_virtual_keyboard_desc
source: Show virtual keyboard when physical keyboard is connected
ta: இயற்பியல் விசைப்பலகை இணைக்கப்பட்டிருக்கும் போது மெய்நிகர் விசைப்பலகையைக் காட்டு

# git_commit
source: Git commit hash
ta: Git கமிட் ஆச்

source: Check for updates
ta: புதுப்பிப்புகளை சரிபார்க்கவும்

# check_for_updates_desc
source: Periodically check for updates
ta: புதுப்பிப்புகளை அவ்வப்போது சரிபார்

# click_open
source: Click here to open file
ta: கோப்பைத் திறக்க இங்கே சொடுக்கு செய்க

source: No
ta: இல்லை

# file_too_large
source: File is too big to open
ta: கோப்பு திறக்க முடியாத அளவுக்கு பெரியது

source: Toggle suggestion
ta: பரிந்துரையை நிலைமாற்று

source: Run
ta: ஓடு

# txt_word_wrap
source: Wrap TXT files
ta: உரை கோப்புகளை மடிக்கவும்

# txt_word_wrap_desc
source: Automatically wrap TXT files
ta: உரை கோப்புகளை தானாக மடிக்கவும்

# manage_editor_font
source: Manage editor fonts
ta: எடிட்டர் எழுத்துருக்களை நிர்வகிக்கவும்

source: Default encoding
ta: இயல்பு குறியாக்கம்

# default_encoding_desc
source: Editor default encoding
ta: எடிட்டர் இயல்பு குறியாக்கம்

source: Other
ta: மற்றொன்று

source: Content
ta: உள்ளடக்கம்

source: Fonts
ta: எழுத்துருக்கள்

# font_added
source: Font successfully added
ta: எழுத்துரு வெற்றிகரமாக சேர்க்கப்பட்டது

source: Delete font
ta: எழுத்துருவை நீக்கு

# add_font
source: Add new font
ta: புதிய எழுத்துருவைச் சேர்க்கவும்

# add_font_desc
source: Choose a TTF font from storage
ta: சேமிப்பகத்திலிருந்து TTF எழுத்துருவைத் தேர்ந்தெடுக்கவும்

# file_not_saved
source: Some files are not saved
ta: சில கோப்புகள் சேமிக்கப்படவில்லை

source: File unsaved
ta: கோப்பு சேமிக்கப்படவில்லை

# ask_unsaved
source: Are you sure you want to discard this unsaved document?
ta: இந்த சேமிக்கப்படாத இந்த ஆவணத்தை நிராகரிக்க விரும்புகிறீர்களா?

source: Keep editing
ta: தொடர்ந்து திருத்தவும்

source: Discard
ta: நிராகரிக்கவும்

source: Warning
ta: எச்சரிக்கை

# encoding_warning
source: Changing the default encoding is highly discouraged, as it can lead to file corruption. It is strongly recommended to use UTF-8 unless you fully understand the implications and have created proper backups.
ta: இயல்புநிலை குறியாக்கத்தை மாற்றுவது மிகவும் ஊக்கமளிக்கிறது, ஏனெனில் இது ஊழல் கோப்புக்கு வழிவகுக்கும். நீங்கள் தாக்கங்களை முழுமையாகப் புரிந்துகொண்டு சரியான காப்புப்பிரதிகளை உருவாக்காவிட்டால் UTF-8 ஐப் பயன்படுத்துவது கடுமையாக பரிந்துரைக்கப்படுகிறது.

source: Line spacing
ta: வரி இடைவெளி

# line_spacing_desc
source: Height multiplier for each line in the editor
ta: எடிட்டரில் ஒவ்வொரு வரிக்கும் உயரம் பெருக்கி

source: Mutators
ta: மியூடர்

# update_av
source: New updates available
ta: புதிய புதுப்பிப்புகள் கிடைக்கின்றன

source: Update
ta: புதுப்பிப்பு

source: Ignore
ta: புறக்கணிக்கவும்

# update_disable
source: Update check disabled
ta: புதுப்பிப்பு காசோலை முடக்கப்பட்டது

source: Launch
ta: ஏவுதல்

# mutator_desc
source: Create user scripts
ta: பயனர் ச்கிரிப்ட்களை உருவாக்கவும்

source: Restore sessions
ta: அமர்வுகளை மீட்டமைக்கவும்

# restore_sessions_desc
source: Restore previous tabs
ta: முந்தைய தாவல்களை மீட்டெடுக்கவும்

source: Terminal home
ta: டெர்மினல் ஓம்

# terminal_home_desc
source: Default home directory of terminal
ta: முனையத்தின் இயல்புநிலை வீட்டு அடைவு

source: Sessions
ta: அமர்வுகள்

source: Add session
ta: அமர்வைச் சேர்க்கவும்

source: Terminal runtime
ta: டெர்மினல் இயக்க நேரம்

# terminal_runtime_desc
source: Select terminal runtime
ta: முனைய இயக்க நேரத்தைத் தேர்ந்தெடுக்கவும்

# ext
source: Extensions
ta: நீட்டிப்புகள்

# ext_desc
source: Manage extensions
ta: நீட்டிப்புகளை நிர்வகிக்கவும்

# info_mutators
source: Mutators are small scripts that are used to modify the editor text. Create a mutator and click on it to open it in the editor.
ta: பிறழ்வுகள் சிறிய ச்கிரிப்ட்கள் ஆகும், அவை எடிட்டர் உரையை மாற்ற பயன்படுகின்றன. ஒரு பிறழ்வை உருவாக்கி, அதை எடிட்டரில் திறக்க அதைக் சொடுக்கு செய்க.

source: No mutators
ta: பிறழ்வு இல்லை

source: Tab opened
ta: தாவல் திறக்கப்பட்டது

source: Mutator name
ta: பிறழ்வு பெயர்

# name_empty_err
source: Name cannot be empty
ta: பெயர் காலியாக இருக்க முடியாது

# name_used
source: Name already used
ta: ஏற்கனவே பயன்படுத்தப்பட்ட பெயர்

# script_get_text
source: Get text
ta: உரை பெறவும்

# script_show_toast
source: Show toast
ta: சிற்றுண்டியைக் காட்டு

# script_network
source: Network
ta: பிணையம்

# script_showing_dialog
source: Showing a dialog
ta: ஒரு உரையாடலைக் காட்டுகிறது

# script_set_text
source: Set text
ta: உரை அமைக்கவும்

# script_text
source: This text will be written in the editor
ta: இந்த உரை எடிட்டரில் எழுதப்படும்

# script_api_info
source: Check the ImplApi class in Xed-Editor's source code at PROJECT/core/main/ui/screens/mutators/ImplApi for more information
ta: மேலும் தகவலுக்கு, PROJECT/core/main/ui/screens/mutators/ImplApi இல் Xed-Editor இன் மூலக் குறியீட்டில் ImplApi வகுப்பைச் சரிபார்க்கவும்.

source: Installing…
ta: நிறுவுதல்…

# not_plugin_err
source: Selected file is not an APK file
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பு APK கோப்பு அல்ல

source: Install from storage
ta: சேமிப்பகத்திலிருந்து நிறுவவும்

# no_ext
source: No extension installed.
ta: நீட்டிப்பு நிறுவப்படவில்லை.

source: Loading…
ta: ஏற்றுகிறது…

# info_ext
source: Extensions can be used to modify the behavior and features of Xed-Editor. To learn how to build a plugin, click here.
ta: Xed-Editor இன் நடத்தை மற்றும் அம்சங்களை மாற்ற நீட்டிப்புகளைப் பயன்படுத்தலாம். ஒரு செருகுநிரலை எவ்வாறு உருவாக்குவது என்பதை அறிய, இங்கே சொடுக்கு செய்யவும்.

source: Initializing…
ta: தொடங்குதல்…

source: Downloading…
ta: பதிவிறக்கம்…

# network_err
source: Network error. Please check that your internet connection is working properly.
ta: பிணைய பிழை. உங்கள் இணைய இணைப்பு சரியாக செயல்படுகிறதா என்பதை சரிபார்க்கவும்.

source: Scroll to bottom
ta: கீழே உருட்டவும்

# scroll_to_bottom_desc
source: Scroll to bottom when opening a file
ta: கோப்பைத் திறக்கும்போது கீழே உருட்டவும்

# file_err
source: File cannot be saved, try closing and reopening the file
ta: கோப்பை சேமிக்க முடியாது, கோப்பை மூடி மீண்டும் திறக்க முயற்சிக்கவும்

# file_not_loaded
source: File isn't loaded yet.
ta: கோப்பு இன்னும் ஏற்றப்படவில்லை.

# file_not_exist
source: File no longer exists
ta: கோப்பு இனி இல்லை

# disable_virtual_kbd
source: Disable virtual keyboard
ta: மெய்நிகர் விசைப்பலகை முடக்கு

# disable_virtual_kbd_desc
source: Disable virtual keyboard if hardware keyboard is available
ta: வன்பொருள் விசைப்பலகை கிடைத்தால் மெய்நிகர் விசைப்பலகை முடக்கு

source: Experimental feature
ta: ஆய்வு நற்பொருத்தம்

# experimental_session_restore_warning
source: This feature is experimental and known to sometimes cause loss of data
ta: இந்த நற்பொருத்தம் சோதனையானது மற்றும் சில நேரங்களில் தரவு இழப்பை ஏற்படுத்தும்

# highlighting
source: Syntax highlighting
ta: தொடரியல் சிறப்பம்சமாக

# unrestricted_file
source: Open files of any size
ta: எந்த அளவிலான கோப்புகளையும் திறக்கவும்

# unrestricted_file_desc
source: Allow opening files of any size. May lead to crashes.
ta: எந்த அளவிலான கோப்புகளையும் திறக்க அனுமதிக்கவும். விபத்துக்களுக்கு வழிவகுக்கும்.

# suggest_clear_app_data
source: Clearing app data is recommended
ta: பயன்பாட்டு தரவை அழிக்க பரிந்துரைக்கப்படுகிறது

# update_files_cleared
source: App updated: data cleared
ta: பயன்பாடு புதுப்பிக்கப்பட்டது: தரவு அழிக்கப்பட்டது

source: Toggle word wrap
ta: சொல் மடக்கு மாற்று

# warning_private_dir
source: Content of this directory will get deleted if you clear data or delete Xed-Editor
ta: நீங்கள் தரவை அழித்தால் அல்லது xed-editer ஐ நீக்கினால் இந்த கோப்பகத்தின் உள்ளடக்கம் நீக்கப்படும்

# read_only_file
source: File is read only
ta: கோப்பு மட்டுமே படிக்கப்படுகிறது

source: New document
ta: புதிய ஆவணம்

# new_document_desc
source: New file or folder
ta: புதிய கோப்பு அல்லது கோப்புறை

source: File
ta: கோப்பு

source: Folder
ta: கோப்புறை

source: Feature toggles
ta: நற்பொருத்தம் மாறுகிறது

# feature_toggles_desc
source: Enable or disable specific features
ta: குறிப்பிட்ட அம்சங்களை இயக்கவும் அல்லது முடக்கவும்

source: Backup
ta: காப்புப்பிரதி

source: Restore
ta: மீட்டமை

source: Success
ta: செய்

source: Failed
ta: தோல்வியுற்றது

# unknown_err
source: Something went wrong
ta: ஏதோ தவறாகிவிட்டது

# misc
source: Miscellaneous
ta: மற்றவை

# misc_desc
source: Miscellaneous settings
ta: இதர அமைப்புகள்

# expose_saf
source: Expose home directory
ta: முகப்பு கோப்பகத்தை வெளிப்படுத்தவும்

# expose_saf_desc
source: Make the home directory accessible to external apps via the system file picker (SAF)
ta: கணினி கோப்பு பிக்கர் (SAF) வழியாக வெளிப்புற பயன்பாடுகளுக்கு வீட்டு கோப்பகத்தை அணுகவும்

# saf_expose_warning
source: Exposing the home directory may reveal sensitive information to malicious apps, including Git tokens, passwords, usernames, and other files stored in your terminal home directory. Do you want to continue?
ta: வீட்டு கோப்பகத்தை அம்பலப்படுத்துவது, அறிவிலி டோக்கன்கள், கடவுச்சொற்கள், பயனர்பெயர்கள் மற்றும் உங்கள் டெர்மினல் ஓம் டைரக்டரியில் சேமிக்கப்பட்ட பிற கோப்புகள் உள்ளிட்ட தீங்கிழைக்கும் பயன்பாடுகளுக்கு முக்கியமான தகவல்களை வெளிப்படுத்தக்கூடும். நீங்கள் தொடர விரும்புகிறீர்களா?

source: Info
ta: தகவல்

source: File info
ta: கோப்பு செய்தி

source: Size
ta: அளவு

source: Can read
ta: படிக்க முடியும்

source: Can write
ta: எழுத முடியும்

source: Can execute
ta: செயல்படுத்த முடியும்

source: Is file
ta: கோப்பு

source: Copied
ta: நகலெடுக்கப்பட்டது

source: Flavor
ta: சுவை

# cant_undo
source: This action cannot be undone
ta: இந்த செயலை செயல்தவிர்க்க முடியாது

# auto_complete
source: Editor auto complete
ta: எடிட்டர் தானாக முடிந்தது

source: Capture logcat
ta: லாக்கேட்டைப் பிடிக்கவும்

# capture_logcat_desc
source: Capture logs in background for debugging
ta: பிழைத்திருத்தத்திற்கான பின்னணியில் பதிவுகளைப் பிடிக்கவும்

source: Logcat service
ta: லாக்கேட் பணி

# logcat_service_desc
source: Capturing logs in background
ta: பின்னணியில் பதிவுகளை கைப்பற்றுதல்

source: Temp file
ta: தற்காலிக கோப்பு

# manage_storage_desc
source: Manage storage permission
ta: சேமிப்பக அனுமதியை நிர்வகிக்கவும்

# lang
source: Language
ta: மொழி

# lang_desc
source: Language settings
ta: மொழி அமைப்புகள்

source: Indian
ta: இந்தியன்

source: Runners
ta: ஓட்டப்பந்தய வீரர்கள்

# runners_desc
source: Shell runners
ta: செல் ஓட்டப்பந்தய வீரர்கள்

source: No runners
ta: ஓடுபவர்கள் இல்லை

source: New runner
ta: புதிய ஓட்டப்பந்தய வீரர்

source: Runner name
ta: ரன்னர் பெயர்

# runner_regex
source: Regex pattern (e.g. .*py$)
ta: ரீசெக்ச் முறை

# invalid_runner_name
source: Only letters, numbers, underscores and hyphens allowed
ta: கடிதங்கள், எண்கள், அடிக்கோடிட்டுக் காட்டுதல் மற்றும் ஐபன்கள் மட்டுமே அனுமதிக்கப்படுகின்றன

# invalid_regex
source: Invalid regex pattern
ta: தவறான ரீசெக்ச் முறை

# runner_name_exists
source: Runner name already exists
ta: ரன்னர் பெயர் ஏற்கனவே உள்ளது

source: Edit runner
ta: திருத்து ரன்னர்

# info_runners
source: Runners are small bash scripts that are used to run a file/project. Create a runner and click on it to open it in the editor.
ta: ஓட்டப்பந்தய வீரர்கள் சிறிய பாச் ச்கிரிப்ட்கள், அவை கோப்பு/திட்டத்தை இயக்க பயன்படுகின்றன. ஒரு ரன்னரை உருவாக்கி, அதை எடிட்டரில் திறக்க அதைக் சொடுக்கு செய்க.

source: Redo
ta: மீண்டும்செய்

source: Read mode
ta: வாசிப்பு முறை
