Repository: 247i/TACETr
Catalog: உரை/தானி/xed-editor-xed-editor-*.po
Languages: ta

# keybindings_desc
source: Configure keybindings
ta: விசை பிணைப்புகளை உள்ளமைக்கவும்

source: None set
ta: எதுவும் அமைக்கப்படவில்லை

# press_key
source: Press a key combination (must contain Ctrl or Alt)
ta: விசை கலவையை அழுத்தவும் (Ctrl அல்லது மாற்று இருக்க வேண்டும்)

source: Ctrl
ta: கட்டுப்பாடு

source: Alt
ta: மாற்று

source: Shift
ta: உயர்த்து

# keybinds_info
source: Xed-Editor supports hardware keyboard shortcuts to help you work faster and more efficiently. A wide set of default keybindings is already available and you can configure them below to your liking.
ta: Xed-Editor வன்பொருள் விசைப்பலகை குறுக்குவழிகளை ஆதரிக்கிறது, இது உங்களுக்கு வேகமாகவும் திறமையாகவும் வேலை செய்ய உதவுகிறது. பலவிதமான இயல்புநிலை விசைப் பிணைப்புகள் ஏற்கனவே உள்ளன, அவற்றை உங்கள் விருப்பப்படி கீழே உள்ளமைக்கலாம்.

source: Reset all
ta: அனைத்தையும் மீட்டமைக்கவும்

# search_keybinds
source: Search commands or keybindings
ta: தேடல் கட்டளைகள் அல்லது விசை பிணைப்புகள்

# transform_lowercase
source: Transform to lowercase
ta: சிறிய எழுத்துக்கு மாற்றவும்

# transform_uppercase
source: Transform to uppercase
ta: பெரிய எழுத்துக்கு மாற்றவும்

# keybindings_conflict_error
source: The keybinding you are trying to set conflicts with another keybinding.
ta: நீங்கள் அமைக்க முயற்சிக்கும் விசைப் பிணைப்பு மற்றொரு விசைப் பிணைப்புடன் முரண்படுகிறது.

# auto_open_new_files
source: Open created files
ta: உருவாக்கப்பட்ட கோப்புகளைத் திறக்கவும்

# auto_open_new_files_desc
source: Automatically open newly created files
ta: புதிதாக உருவாக்கப்பட்ட கோப்புகளைத் தானாகத் திறக்கவும்

# return_to_app_desc
source: Go back to the app after exiting the terminal
ta: முனையத்திலிருந்து வெளியேறிய பிறகு பயன்பாட்டிற்குச் செல்லவும்

source: Return to app
ta: பயன்பாட்டிற்குத் திரும்பு

# reset_consent
source: Reset consent status
ta: ஒப்புதல் நிலையை மீட்டமைக்கவும்

# reset_consent_desc
source: Show the terms of use disclaimer on next startup
ta: அடுத்த தொடக்கத்தில் பயன்பாட்டு நிபந்தனைகளைக் காட்டு

# extra_key_bg
source: Extra key background
ta: கூடுதல் முக்கிய பின்னணி

# extra_key_bg_desc
source: Show background for extra keys
ta: கூடுதல் விசைகளுக்கான பின்னணியைக் காட்டு

source: Actions
ta: செயல்கள்

# enjoying_xed
source: Enjoying Xed-Editor?
ta: Xed-எடிட்டரை அனுபவிக்கிறீர்களா?

# support_message
source: You've saved %s files and run code %s times with Xed. I'm a solo developer keeping this app free and privacy-focused. If Xed has made your coding easier, would you consider supporting its development? Your support helps me: • Build features faster • Keep Xed ad-free forever • Respond to bugs quickly
ta: நீங்கள் %s கோப்புகளைச் சேமித்து, Xed மூலம் %s முறை குறியீட்டை இயக்கியுள்ளீர்கள். நான் இந்த ஆப்சை இலவசமாகவும் தனியுரிமையை மையமாகவும் வைத்திருக்கும் ஒரு தனி உருவாக்குபவர். Xed உங்கள் குறியீட்டை எளிதாக்கியிருந்தால், அதன் வளர்ச்சியை ஆதரிப்பதாக கருதுவீர்களா? உங்கள் உதவி எனக்கு உதவுகிறது: • அம்சங்களை வேகமாக உருவாக்குங்கள் • Xedஐ எப்போதும் விளம்பரமில்லாமல் வைத்திருங்கள் • பிழைகளுக்கு விரைவாக பதிலளிக்கவும்

# yes_support
source: Yes, I'll support! ❤️
ta: ஆம், நான் ஆதரிப்பேன்! ❤️

# remind_me
source: Remind me later
ta: பிறகு நினைவூட்டு

# not_for_me
source: No thanks
ta: நன்றி இல்லை

# sponsor_desc
source: Become a sponsor and help shape the future of this project
ta: ச்பான்சராக மாறி, இந்தத் திட்டத்தின் எதிர்காலத்தை வடிவமைக்க உதவுங்கள்

# coffee_desc
source: Show your love with a coffee - every cup helps! ☕
ta: ஒரு காபியுடன் உங்கள் அன்பைக் காட்டுங்கள் - ஒவ்வொரு கோப்பையும் உதவுகிறது! ☕

# upi_desc
source: Support directly through your favorite UPI app
ta: உங்களுக்குப் பிடித்த UPI பயன்பாட்டின் மூலம் நேரடியாக ஆதரிக்கவும்

source: Use
ta: பயன்படுத்தவும்

# no_upi_error
source: No UPI app found
ta: UPI ஆப்ச் எதுவும் இல்லை

# http_server_at
source: Serving at: %s
ta: சேவை: %s

# http_server_port_error
source: Could not start HTTP server on port %d
ta: %d போர்ட்டில் HTTP சேவையகத்தைத் தொடங்க முடியவில்லை

# inject_eruda
source: Enable DevTools
ta: DevTools ஐ இயக்கவும்

# inject_eruda_desc
source: Show the Eruda developer console in the HTML preview
ta: உஉகுமொ மாதிரிக்காட்சியில் Eruda உருவாக்குபவர் கன்சோலைக் காட்டு

source: HTML preview
ta: உஉகுமொ முன்னோட்டம்

# html_preview_desc
source: Start a local HTTP server to preview HTML files directly in the app
ta: பயன்பாட்டில் நேரடியாக உஉகுமொ கோப்புகளை முன்னோட்டமிட, உள்ளக HTTP சேவையகத்தைத் தொடங்கவும்

source: Markdown preview
ta: மார்க் பேரூர் முன்னோட்டம்

# markdown_preview_desc
source: Preview Markdown files directly in the app
ta: பயன்பாட்டில் நேரடியாக மார்க் பேரூர் கோப்புகளை முன்னோட்டமிடவும்

source: Universal runner
ta: யுனிவர்சல் ரன்னர்

# universal_runner_desc
source: Automatically detect file type and compile/run scripts in various languages
ta: கோப்பு வகையைத் தானாகக் கண்டறிந்து, பல்வேறு மொழிகளில் ச்கிரிப்ட்களைத் தொகுக்கலாம்/இயக்கலாம்

source: Server port
ta: சர்வர் துறைமுகம்

# server_port_desc
source: Set the port used by the built-in HTTP server
ta: உள்ளமைக்கப்பட்ட HTTP சேவையகம் பயன்படுத்தும் போர்ட்டை அமைக்கவும்

# launch_in_browser
source: Open in browser
ta: உலாவியில் திற

# launch_in_browser_desc
source: Open the file in your default browser instead of the in-app preview
ta: பயன்பாட்டு மாதிரிக்காட்சிக்குப் பதிலாக உங்கள் இயல்புநிலை உலாவியில் கோப்பைத் திறக்கவும்

# default_option
source: Default
ta: இயல்புநிலை

# save_tabs_error
source: Unable to save tabs
ta: தாவல்களைச் சேமிக்க முடியவில்லை

source: No themes found
ta: தீம்கள் எதுவும் இல்லை

# file_already_exists
source: A file with the name '%s' already exists
ta: '%s' என்ற பெயரில் ஒரு கோப்பு ஏற்கனவே உள்ளது

# folder_already_exists
source: A folder with the name '%s' already exists
ta: '%s' என்ற பெயரில் ஒரு கோப்புறை ஏற்கனவே உள்ளது

# file_creation_failed
source: Unable to create file
ta: கோப்பை உருவாக்க முடியவில்லை

# folder_creation_failed
source: Unable to create folder
ta: கோப்புறையை உருவாக்க முடியவில்லை
