Repository: 247i/TACETr
Catalog: உரை/தானி/yeswiki-yeswiki-*.po
Languages: ta

# ARCHIVES
source: Sauvegardes
ta: காப்புப்பிரதி

# ANSWER
source: Répondre
ta: பதில்

# BY
source: par
ta: இதற்க்கான

# CAUTION
source: Attention
ta: கவனம்

# CLEAN
source: Nettoyer
ta: தூய்மைப்படுத்த

# COMMENTS
source: Commentaires
ta: கருத்துகள்

# DELETE
source: Supprimer
ta: அழி

# DELETE_ALL
source: Supprimer tout
ta: அனைத்தையும் நீக்கு

# DELETE_ALL_SELECTED_ITEMS
source: Supprimer tous les éléments sélectionnés
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து கூறுகளையும் நீக்கு

# DELETE_SELECTION
source: Supprimer la sélection
ta: தேர்வை நீக்கு

# DEL
source: Suppr.
ta: அழி.

source: Email
ta: மின்னஞ்சல்

# INVERT
source: Inverser
ta: தலைகீழ்

# MODIFY
source: Modifier
ta: மாற்றியமைப்பாளர்

# NAME
source: Nom
ta: நோம்

# ONLY_FOR_ADMINS
source: Seulement pour les administrateurs
ta: நிர்வாகிகளுக்கு மட்டுமே

source: Pages
ta: பக்கங்கள்

# SUBSCRIPTION
source: Inscription
ta: கல்வெட்டு

source: Triples
ta: மும்மடங்கு

# UNKNOWN
source: Inconnu
ta: தெரியவில்லை

# WARNING
source: AVERTISSEMENT
ta: எச்சரிக்கை

# INVALID_ACTION
source: Action invalide
ta: செயல் தவறானது

# ERROR_NO_ACCESS
source: Accès interdit
ta: அணுகல் தடைசெய்யப்பட்டுள்ளது

# NOT_FOUND
source: N'existe pas
ta: இல்லை

# NO_REQUEST_FOUND
source: $_REQUEST[] pas trouvé. Wakka nécessite PHP 4.1.0 ou plus récent!
ta: $ _ REQUEST [] காணப்படவில்லை. வக்காவுக்கு பிஎச்பி 4.1.0 அல்லது மிக அண்மைக் கால தேவை!

# SITE_BEING_UPDATED
source: Ce site est en cours de mise à jour. Veuillez essayer plus tard.
ta: இந்த தளம் புதுப்பிக்கப்படுகிறது. தயவுசெய்து முயற்சிக்கவும்.

# DB_CONNECT_FAIL
source: Pour des raisons indépendantes de notre volonté, le contenu de ce YesWiki est temporairement inaccessible.<br>Probablement l'accès à la base de données a échoué. <br><br>Veuillez réessayer ultérieurement, merci de votre compréhension.
ta: எங்கள் விருப்பத்திலிருந்து சுயாதீனமான காரணங்களுக்காக, இந்த யெச்விகியின் உள்ளடக்கம் தற்காலிகமாக அணுக முடியாதது. <br><br> தயவுசெய்து மீண்டும் முயற்சிக்கவும், உங்கள் புரிதலுக்கு நன்றி.

# INCORRECT_PAGENAME
source: Le nom de la page est incorrect.
ta: பக்கத்தின் பெயர் தவறானது.

# PERFORMABLE_ERROR
source: Une erreur inattendue s'est produite. Veuillez contacter l'administrateur du site et lui communiquer l'erreur suivante :
ta: எதிர் பாராத பிழை ஏற்பட்டு விட்டது. தயவுசெய்து தள நிர்வாகியைத் தொடர்புகொண்டு பின்வரும் பிழையை அவருடன் தொடர்பு கொள்ளுங்கள்:

# MY_YESWIKI_SITE
source: Mon site YesWiki
ta: மோன் தளம் யெச்விகி

# FILE_WRITE_PROTECTED
source: le fichier de configuration est protégé en écriture
ta: உள்ளமைவு கோப்பு எழுத்துப்பூர்வமாக பாதுகாக்கப்படுகிறது

# DENY_READ
source: Vous n'êtes pas autorisé à lire cette page
ta: இந்தப் பக்கத்தைப் படிக்க உங்களுக்கு இசைவு இல்லை

# DENY_WRITE
source: Vous n'êtes pas autorisé à écrire sur cette page
ta: இந்த பக்கத்தில் எழுத உங்களுக்கு இசைவு இல்லை

# DENY_COMMENT
source: Vous n'êtes pas autorisé à commenter cette page
ta: இந்த பக்கத்தில் கருத்து தெரிவிக்க உங்களுக்கு இசைவு இல்லை

# DENY_DELETE
source: Vous n'êtes pas autorisé à supprimer cette page
ta: இந்த பக்கத்தை நீக்க உங்களுக்கு இசைவு இல்லை

# YESWIKI_TOOLS_CONFIG
source: Configuration extension(s) de YesWiki
ta: உள்ளமைவு நீட்டிப்பு (கள்) டி யெச்விகி

# DISCONNECT
source: Déconnexion
ta: துண்டிப்பு

# RETURN_TO_EXTENSION_LIST
source: Retour à la liste des extensions actives
ta: செயலில் நீட்டிப்புகளின் பட்டியலுக்குத் திரும்பு

# NO_TOOL_AVAILABLE
source: Aucun outil n'est disponible ou actif
ta: எந்த கருவியும் கிடைக்கவில்லை அல்லது செயலில் இல்லை

# LIST_OF_ACTIVE_TOOLS
source: Liste des extensions actives
ta: செயலில் நீட்டிப்புகளின் பட்டியல்

# ADMIN_BACKUPS_TITLE
source: Gestion des sauvegardes
ta: காப்பு மேலாண்மை

# ADMIN_BACKUPS_ARCHIVES_LIST
source: Liste des sauvegardes
ta: காப்பு பட்டியல்

# ADMIN_BACKUPS_ARCHIVE_FILENAME
source: Nom du fichier
ta: கோப்பு பெயர்

# ADMIN_BACKUPS_ARCHIVE_TYPE
source: Type
ta: வகை

# ADMIN_BACKUPS_ARCHIVE_TYPE_FULL
source: Sauvegarde complète (fichiers et base de données)
ta: முழுமையான காப்புப்பிரதி (கோப்புகள் மற்றும் தரவுத்தளம்)

# ADMIN_BACKUPS_ARCHIVE_TYPE_ONLY_FILES
source: Seulement les fichiers
ta: கோப்புகள் மட்டுமே

# ADMIN_BACKUPS_ARCHIVE_TYPE_ONLY_DATABASES
source: Seulement la base de données
ta: தரவுத்தளம் மட்டுமே

# ADMIN_BACKUPS_PLACEHOLDER_FILES
source: chemin relatif depuis la racine du wiki, séparé par des virgules
ta: விக்கியின் மூலத்திலிருந்து உறவினர் பாதை, கமாவால் பிரிக்கப்பட்டுள்ளது

# ADMIN_NO_BACKUP_FOUND
source: Pas d'archives de backup trouvées
ta: காப்பு காப்பகங்கள் எதுவும் கிடைக்கவில்லை

# ADMIN_BACKUPS_ARCHIVE_SIZE
source: Taille
ta: அளவு

# ADMIN_BACKUPS_CREATE
source: Créer une sauvegarde
ta: காப்புப்பிரதி

# ADMIN_BACKUPS_START
source: Démarrer la sauvegarde
ta: காப்புப்பிரதியைத் தொடங்கவும்

# ADMIN_BACKUPS_STOP
source: Arrêter
ta: நிறுத்து

# ADMIN_BACKUPS_STOP_BACKUP
source: Arrêter la sauvegarde
ta: காப்புப்பிரதியை நிறுத்துங்கள்

# ADMIN_BACKUPS_CONFIRM_DELETE_FILES
source: Confirmer la suppression des fichiers
ta: கோப்புகளை நீக்குவதை உறுதிப்படுத்தவும்

# ADMIN_BACKUPS_MESSAGE_HIBERNATION
source: le wiki est en hibernation.
ta: விக்கி உறக்கநிலையில் உள்ளது.

# ADMIN_BACKUPS_MESSAGE_WRITABLE_FILE
source: soucis de droits d'écriture des fichiers.
ta: கோட்டைகள் எழுதும் உரிமைகள்.

# ADMIN_BACKUPS_MESSAGE_CLI_NOT_WORKING
source: appels en ligne de commande impossible.
ta: சாத்தியமற்ற கட்டளை வரி அழைப்புகள்.

# ADMIN_BACKUPS_MESSAGE_PRIVATE_FOLDER_IS_PUBLIC
source: le dossier private est accessible publiquement.
ta: தனியார் கோப்பு பகிரங்கமாக அணுகக்கூடியது.

# ADMIN_BACKUPS_MESSAGE_NO_SPACE
source: il n'y a pas assez d'espace disque disponible.
ta: கிடைக்கக்கூடிய வட்டு இடம் இல்லை.

# ADMIN_BACKUPS_MESSAGE_DB_NOT_ARCHIVABLE
source: la base de données n'est pas sauvegardable.
ta: தரவுத்தளம் காப்புப்பிரதி அல்ல.

# ADMIN_BACKUPS_MESSAGE_ARCHIVE_CANNOT_BE_DONE
source: Archivage impossible car
ta: காப்பகமானது சாத்தியமற்றது

# ADMIN_BACKUPS_MESSAGE_SEE_DOC
source: Voir la documentation sur les sauvegardes
ta: காப்பு ஆவணங்களைக் காண்க

# PAGES_WITH_LINK
source: Pages ayant un lien vers
ta: ஒரு இணைப்புடன் பக்கங்கள்

# PAGES_WITH_LINK_TO_CURRENT_PAGE
source: Pages ayant un lien vers la page courante
ta: தற்போதைய பக்கத்திற்கான இணைப்பைக் கொண்ட பக்கங்கள்

# NO_PAGES_WITH_LINK_TO
source: Aucune page n'a de lien vers
ta: எந்த பக்கத்திற்கும் இணைப்பு இல்லை

# STYLE_SHEET
source: Feuille de style
ta: பாணி இலை

# CHANGESTYLE_ERROR
source: Le nom '{name}' n'est pas conforme à la règle de nommage imposée par l'action ChangeStyle. Reportez-vous à la documentation de cette action pour plus de précisions
ta: '{name}' என்ற பெயர் சேஞ்ச்ச்டைல் நடவடிக்கையால் விதிக்கப்பட்ட பெயரிடும் விதிக்கு இணங்காது. மேலும் விவரங்களுக்கு இந்த செயலின் ஆவணங்களைப் பார்க்கவும்

# YW_ACLS_LIST
source: Liste des droits d'accès de la page
ta: பக்க அணுகல் உரிமைகளின் பட்டியல்

# YW_ACLS_UPDATED
source: Droits d'accès mis à jour
ta: அணுகல் உரிமைகள் புதுப்பிக்கப்பட்டன

# YW_NEW_OWNER
source: et changement du propriétaire. Nouveau propriétaire :
ta: மற்றும் உரிமையாளரின் மாற்றம். புதிய உரிமையாளர்:

# YW_CANCEL
source: Annuler
ta: ரத்துசெய்

# YW_ACLS_READ
source: Droits de lecture (* pour tous, + pers identifiées, @admins grp admin)
ta: வாசிப்பு உரிமைகள் (* அனைவருக்கும், + அடையாளம் காணப்பட்டது, @admins grp நிர்வாகி)

# YW_ACLS_WRITE
source: Droits d'écriture (* pour tous, + pers identifiées, @admins grp admin)
ta: எழுதும் உரிமைகள் (* அனைவருக்கும், + அடையாளம் காணப்பட்டது, @admins grp நிர்வாகி)

# YW_ACLS_COMMENT
source: Droits pour commenter
ta: கருத்து உரிமைகள்

# YW_CHANGE_OWNER
source: Changer le propriétaire
ta: உரிமையாளரை மாற்றவும்

# YW_CHANGE_NOTHING
source: Ne rien modifier
ta: எதுவும் செய்ய வேண்டாம்

# YW_CANNOT_CHANGE_ACLS
source: Vous ne pouvez pas gérer les permissions de cette page
ta: இந்த பக்கத்தில் அனுமதிகளை நீங்கள் நிர்வகிக்க முடியாது

# YW_YOU_ARE_NOW_OWNER_OF_PAGE
source: Vous êtes maintenant le propriétaire de cette page
ta: நீங்கள் இப்போது இந்த பக்கத்தின் உரிமையாளர்

# ACTION_RIGHTS
source: Droits de l'action
ta: நடவடிக்கை உரிமைகள்

# SEE
source: Voir
ta: பார்க்க

# ERROR_WHILE_SAVING_ACL
source: Une erreur s'est produite pendant l'enregistrement de l'ACL pour l'action
ta: செயலுக்காக ACL இன் பதிவின் போது பிழை ஏற்பட்டது

# ERROR_CODE
source: code d'erreur
ta: பிழை குறியீடு

# NEW_ACL_FOR_ACTION
source: Nouvelle ACL pour l'action
ta: செயலுக்கு புதிய ஏ.சி.எல்

# NEW_ACL_SUCCESSFULLY_SAVED_FOR_ACTION
source: Nouvelle ACL enregistrée avec succès pour l'action
ta: புதிய ஏ.சி.எல் வெற்றிகரமாக செயலுக்காக பதிவு செய்யப்பட்டது

# EDIT_RIGHTS_FOR_ACTION
source: éditer les droits de l'action
ta: செயலின் உரிமைகளைத் திருத்தவும்

# SAVE
source: Enregistrer
ta: சேமிக்கவும்

# YW_COMMENTS_ARE_NOW_OPEN
source: Les commentaires ont été ouverts sur cette page
ta: இந்த பக்கத்தில் கருத்துகள் திறக்கப்பட்டன

# YW_COMMENTS_ARE_NOW_CLOSED
source: Les commentaires ont été fermés sur cette page
ta: கருத்துகள் இந்த பக்கத்தில் மூடப்பட்டன

# YW_PROBLEM_WITH_ACLS_LIST
source: Pas de groupe valide d'indiqué pour ouvrir les commentaires
ta: கருத்துகளைத் திறக்க செல்லுபடியாகும் குழு இல்லை

# DEFINITION_OF_THE_GROUP
source: Définition du groupe
ta: குழு வரையறை

# DEFINE
source: Définir
ta: வரையறு

# CREATE_NEW_GROUP
source: Ou créer un nouveau groupe
ta: அல்லது புதிய குழுவை உருவாக்கவும்

# ONLY_ADMINS_CAN_CHANGE_MEMBERS
source: Vous ne pouvez pas changer les membres du groupe des administrateurs car vous n'êtes pas administrateur
ta: நீங்கள் இயக்குநர் இல்லாததால் இயக்குநர்கள் குழுவின் உறுப்பினர்களை மாற்ற முடியாது

# YOU_CANNOT_REMOVE_YOURSELF
source: Vous ne pouvez pas vous retirer vous-même du groupe des administrateurs
ta: நிர்வாகிகள் குழுவிலிருந்து நீங்கள் திரும்பப் பெற முடியாது

# ERROR_RECURSIVE_GROUP
source: Erreur: vous ne pouvez pas définir un groupe récursivement
ta: பிழை: நீங்கள் மீண்டும் குழுவை வரையறுக்க முடியாது

# ERROR_WHILE_SAVING_GROUP
source: Une erreur s'est produite pendant l'enregistrement du groupe
ta: குழு பதிவின் போது பிழை ஏற்பட்டது

# USER_CANNOT_REMOVE_THEIRSELF_FROM_ADMIN
source: Vous ne pouvez vous supprimer vous-même du groupe admin
ta: நிர்வாகி குழுவிலிருந்து உங்களை நீக்க முடியாது

# NEW_ACL_FOR_GROUP
source: Nouvelle ACL pour le groupe
ta: குழுவிற்கு புதிய ஏ.சி.எல்

# NEW_ACL_SUCCESSFULLY_SAVED_FOR_THE_GROUP
source: Nouvelle ACL enrégistrée avec succès pour le groupe
ta: குழுவிற்கு அடுத்தடுத்து புதிய ஏ.சி.எல்

# EDIT_GROUP
source: éditer le groupe
ta: குழுவைத் திருத்தவும்

# EDIT_EXISTING_GROUP
source: Éditer un groupe existant
ta: ஏற்கனவே உள்ள குழுவைத் திருத்தவும்

# USERS_GROUPS_LIST
source: Liste des groupes et utilisateurices
ta: குழுக்கள் மற்றும் பயனர்களின் பட்டியல்

# GROUP_SELECTION
source: sélection
ta: தேர்வு

# DELETE_EXISTING_GROUP
source: Supprimer un groupe existant
ta: ஏற்கனவே உள்ள குழுவை நீக்கு

# GROUP_NAME
source: Nom du groupe
ta: குழுவின் பெயர்

# SEE_EDIT
source: Voir / Éditer
ta: பார்க்க / திருத்து

# ONLY_ALPHANUM_FOR_GROUP_NAME
source: Les noms de groupes ne peuvent contenir que des caractères alphanumériques
ta: குழு பெயர்களில் எண்ணெழுத்து எழுத்துக்கள் மட்டுமே இருக்க முடியும்

# LIST_GROUP_MEMBERS
source: Liste des membres du groupe {groupName}
ta: குழு உறுப்பினர்களின் பட்டியல் {groupName}

# ONE_NAME_BY_LINE
source: un nom d'utilisateur par ligne
ta: வரி மூலம் ஒரு பயனர்பெயர்

# ONLY_EMPTY_GROUP_FOR_DELETION
source: Seul un groupe vide peut être supprimé
ta: ஒரு வெற்று குழுவை மட்டுமே நீக்க முடியும்

# ONLY_NO_PAGES_GROUP_FOR_DELETION
source: Seuls les groupes non rattaché à une page peuvent être supprimé. Pages associées :
ta: ஒரு பக்கத்துடன் இணைக்கப்படாத குழுக்களை மட்டுமே நீக்க முடியும். தொடர்புடைய பக்கங்கள்:

# NO_VAR_GROUP
source: aucun group spécifié
ta: குழுக்கள் எதுவும் குறிப்பிடப்படவில்லை

# GROUP_NOT_STRING
source: la variable n'est pas une chaine de caractère
ta: மாறி ஒரு சரம் அல்ல

# HANDLER_RIGHTS
source: Droits du handler
ta: கையாளுபவர் உரிமைகள்

# ERROR_WHILE_SAVING_HANDLER_ACL
source: Une erreur s'est produite pendant l'enregistrement de l'ACL pour le handler
ta: அதைக் கையாள ACL இன் பதிவின் போது பிழை ஏற்பட்டது

# NEW_ACL_FOR_HANDLER
source: Nouvelle ACL pour le handler
ta: அதைக் கையாள புதிய ஏ.சி.எல்

# NEW_ACL_SUCCESSFULLY_SAVED_FOR_HANDLER
source: Nouvelle ACL enregistrée avec succès pour le handler
ta: புதிய ஏ.சி.எல் அதைக் கையாள வெற்றிகரமாக பதிவு செய்யப்பட்டது

# EDIT_RIGHTS_FOR_HANDLER
source: éditer les droits du handler
ta: ஏண்ட்லரின் உரிமைகளைத் திருத்தவும்

# ERASED_COMMENTS
source: Commentaire(s) effacé(s)
ta: கருத்து (கள்) அழிக்கப்பட்டது (கள்)

# FORM_RETURN
source: Retour au formulaire
ta: படிவத்திற்குத் திரும்பு

# NO_RECENT_COMMENTS
source: Pas de commentaires récents
ta: அண்மைக் கால கருத்துக்கள் இல்லை

# NO_SELECTED_COMMENTS_TO_ERASE
source: Aucun commentaire n'a été sélectionné pour étre effacé
ta: அழிக்க எந்தக் கருத்தும் தேர்ந்தெடுக்கப்படவில்லை

# ERROR
source: Erreur
ta: பிழை

source: Action
ta: செயல்

# MISSING_PAGE_PARAMETER
source: le paramètre "page" est manquant
ta: "பக்கம்" அமைப்பு இல்லை

# IMPOSSIBLE_FOR_THIS_PAGE
source: Impossible pour la page
ta: பக்கத்திற்கு சாத்தியமற்றது

# TO_INCLUDE_ITSELF
source: de s'inclure en elle même
ta: உங்களை தானே சேர்க்க

# INCLUSIONS_CHAIN
source: Chaine d'inclusions
ta: சேர்க்கும் சங்கிலி

# EDITION
source: édition
ta: திருத்துதல்

# READING_OF_INCLUDED_PAGE
source: Lecture de la page inclue
ta: பக்கத்தைப் படிப்பது சேர்க்கப்பட்டுள்ளது

# NOT_ALLOWED
source: non autorisée
ta: அங்கீகரிக்கப்படாதது

# INCLUDED_PAGE
source: La page inclue
ta: பக்கம் சேர்க்கப்பட்டுள்ளது

# DOESNT_EXIST
source: ne semble pas exister
ta: இருப்பதாகத் தெரியவில்லை

# THE_PAGE
source: La page
ta: அந்தப் பக்கம்

# BELONGING_TO
source: appartenant à
ta: சேர்ந்த

# LAST_CHANGE_BY
source: dernière modification par
ta: மூலம் கடைசி மாற்றம்

# LAST_CHANGE
source: dernière modification
ta: கடைசி மாற்றம்

# PAGE_LIST_WHERE
source: Liste des pages auxquelles
ta: எந்த பக்கங்களின் பட்டியல்

# HAS_PARTICIPATED
source: a participé
ta: பங்கேற்றார்

# EXCLUDING_EXCLUSIONS
source: hors exclusions
ta: ஆர்ச் விலக்குகள்

# INCLUDING
source: et dont
ta: மற்றும் எது

# IS_THE_OWNER
source: est le propriétaire
ta: உரிமையாளர்

# NO_PAGE_FOUND
source: Aucune page trouvée
ta: எந்தப் பக்கமும் கிடைக்கவில்லை

# IN_THIS_WIKI
source: dans ce wiki
ta: இந்த விக்கியில்

# LIST_PAGES_BELONGING_TO
source: Liste des pages appartenant à
ta: சொந்தமான பக்கங்களின் பட்டியல்

# THIS_USER_HAS_NO_PAGE
source: Cet utilisateur ne possède aucune page
ta: இந்த பயனருக்கு எந்தப் பக்கமும் இல்லை

# COMMENT_RESERVED_TO_CONNECTED
source: Veuillez vous connecter pour pouvoir utiliser l'action "{{usercomments}}" !
ta: "{{usercomments}}" என்ற செயலைப் பயன்படுத்த தயவுசெய்து இணைக்கவும்!

# YOUR_MODIFIED_PAGES_ORDERED_BY_MODIFICATION_DATE
source: Liste des pages que vous avez modifiées, triée par date de modification
ta: நீங்கள் மாற்றிய பக்கங்களின் பட்டியல், மாற்றியமைக்கும் தேதியால் வரிசைப்படுத்தப்படுகிறது

# YOUR_MODIFIED_PAGES_ORDERED_BY_NAME
source: Liste des pages que vous avez modifiées, triée par ordre alphabétique
ta: நீங்கள் மாற்றியமைத்த பக்கங்களின் பட்டியல், அகர வரிசைப்படி வரிசைப்படுத்தப்பட்டுள்ளது

# YOU_DIDNT_MODIFY_ANY_PAGE
source: Vous n'avez pas modifié de page
ta: நீங்கள் ஒரு பக்கத்தை மாற்றவில்லை

# YOU_ARENT_LOGGED_IN
source: Vous n'êtes pas identifié
ta: நீங்கள் உள்நுழையவில்லை

# IMPOSSIBLE_TO_SHOW_YOUR_MODIFIED_PAGES
source: impossible d'afficher la liste des pages que vous avez modifiées
ta: நீங்கள் மாற்றிய பக்கங்களின் பட்டியலைக் காட்ட முடியவில்லை

# LIST_OF_PAGES_WHERE_YOU_ARE_THE_OWNER
source: Liste des pages dont vous êtes le propriétaire
ta: நீங்கள் உரிமையாளர் பக்கங்களின் பட்டியல்

# YOU_DONT_OWN_ANY_PAGE
source: Vous n'êtes le propriétaire d'aucune page
ta: நீங்கள் எந்த பக்கத்தின் உரிமையாளரும் இல்லை

# NEWTEXTSEARCH_HINT
source: Un caractère inconnu peut être remplacé par « ? » plusieurs par « * »
ta: அறியப்படாத கதாபாத்திரத்தை "" மூலம் மாற்ற முடியுமா? " "பல பை" * "

# NO_SEARCH_RESULT
source: Désolé mais il n'y a aucun de résultat pour votre recherche
ta: மன்னிக்கவும், உங்கள் தேடலுக்கு எந்த முடிவும் இல்லை

# SEARCH_RESULTS
source: Résultats de la recherche
ta: தேடல் முடிவுகள்

# NO_ORPHAN_PAGES
source: Pas de pages orphelines
ta: அனாதை பக்கங்கள் இல்லை

# HISTORY
source: historique
ta: வரலாற்று

# TO_OBTAIN_RSS_FEED_TO_GO_THIS_ADDRESS
source: Pour obtenir le fil RSS des derniers changements, utilisez l'adresse suivante
ta: அண்மைக் கால மாற்றங்களின் RSS கம்பிக்கு, பின்வரும் முகவரியைப் பயன்படுத்தவும்

# LATEST_CHANGES_ON
source: Derniers changements sur
ta: அண்மைக் கால மாற்றங்கள்

# TO_OBTAIN_COMMENTS_RSS_FEED_TO_GO_THIS_ADDRESS
source: Pour obtenir le fil RSS des derniers commentaires, utilisez l'adresse suivante
ta: அண்மைக் கால கருத்துகளின் ஆர்எச்எச் கம்பிக்கு, பின்வரும் முகவரியைப் பயன்படுத்தவும்

# LATEST_COMMENTS_ON
source: Derniers commentaires sur
ta: அண்மைக் கால கருத்துகள்

# LAST COMMENT
source: dernier commentaire
ta: கடைசி இடுகை

# NO_RECENT_COMMENTS_ON_PAGES
source: Aucune page n'a été commentée récemment
ta: எந்த பக்கமும் அண்மைக் காலத்தில் கருத்து தெரிவிக்கப்படவில்லை

# ERROR_ACTION_REDIRECT
source: Erreur action {{redirect ...}}
ta: செயல் பிழை {{redirect ...}}

# CIRCULAR_REDIRECTION_FROM_PAGE
source: redirection circulaire depuis la page
ta: பக்கத்திலிருந்து வட்ட திசை திருப்புதல்

# CLICK_HERE_TO_EDIT
source: cliquer ici pour l'éditer
ta: அதைத் திருத்த இங்கே சொடுக்கு செய்க

# PRESENCE_OF_REDIRECTION_TO
source: Présence d'une redirection vers
ta: நோக்கி ஒரு திசைதிருப்பல்

source: Action {{resetpassword ...}}
ta: செயல் {{resetpassword ...}}

# PASSWORD_UPDATED
source: Mot de passe réinitialisé
ta: கடவுச்சொல்லை மீட்டமைக்க

# RESETTING_THE_PASSWORD
source: Réinitialisation du mot de passe
ta: கடவுச்சொல்லை மீட்டமைக்க

# WIKINAME
source: NomWiki
ta: நோம்வ்கி

source: Reset password
ta: கடவுச்சொல்லை மீட்டமைக்க

# NO_PERMISSIONS_TO_EXECUTE_THIS_ACTION
source: vous n'avez pas les permissions nécessaires pour exécuter cette action
ta: இந்த செயலைச் செய்ய தேவையான அனுமதிகள் உங்களிடம் இல்லை

# WHAT_YOU_SEARCH
source: Ce que vous souhaitez chercher
ta: நீங்கள் என்ன பார்க்க விரும்புகிறீர்கள்

# SEARCH
source: Chercher
ta: தேடுங்கள்

# SEARCH_RESULT_OF
source: Résultat(s) de la recherche de
ta: தேடலின் முடிவு (கள்)

# NO_RESULT_FOR
source: Aucun résultat pour
ta: எந்த முடிவுகளும் இல்லை

# END_OF_EXEC
source: Fin de l'exécution
ta: சாவுஒறுப்பு முடிவு

# ERROR_ACTION_TRAIL
source: Erreur action {{trail ...}}
ta: செயல் பிழை {{trail ...}}

# INDICATE_THE_PARAMETER_TOC
source: Indiquez le nom de la page sommaire, paramètre "toc"
ta: சுருக்கமான பக்கத்தின் பெயரைக் குறிக்கவும், "TOC" அளவுரு

# USER_GOTOADMIN
source: Gestion des utilisateurices
ta: பயனர்களின் மேலாண்மை

# USER_SETTINGS
source: Paramètres utilisateur
ta: பயனர் அமைப்புகள்

# USER_SIGN_UP
source: S'inscrire
ta: பதிவு

# YOU_ARE_NOW_DISCONNECTED
source: Vous êtes maintenant déconnecté
ta: நீங்கள் இப்போது வெளியேறிவிட்டீர்கள்

# PARAMETERS_SAVED
source: Paramètres sauvegardés
ta: சேமித்த அளவுருக்கள்

# NO_SPACES_IN_PASSWORD
source: Les espaces ne sont pas permis dans les mots de passe
ta: கடவுச்சொற்களில் இடைவெளிகள் அனுமதிக்கப்படவில்லை

# PASSWORD_TOO_SHORT
source: Mot de passe trop court
ta: மிகக் குறுகிய கடவுச்சொல்

# WRONG_PASSWORD
source: Mauvais mot de passe
ta: மோசமான கடவுச்சொல்

# PASSWORD_CHANGED
source: Mot de passe changé
ta: கடவுச்சொல் மாற்றப்பட்டது

# GREETINGS
source: Bonjour
ta: போன்சோர்

# YOUR_EMAIL_ADDRESS
source: Votre adresse de messagerie électronique
ta: உங்கள் மின்னணு மின்னஞ்சல் முகவரி

# DOUBLE_CLICK_TO_EDIT
source: édition en double-cliquant
ta: இரட்டை சொடுக்கு செய்வதன் மூலம் பதிப்பு

# SHOW_COMMENTS_BY_DEFAULT
source: Par défaut, montrer les commentaires
ta: இயல்பாக, கருத்துகளைக் காட்டுங்கள்

# MAX_NUMBER_OF_LASTEST_COMMENTS
source: Nombre maximum de derniers commentaires
ta: அண்மைக் கால கருத்துகளின் அதிகபட்ச எண்ணிக்கை

# MAX_NUMBER_OF_VERSIONS
source: Nombre maximum de versions
ta: பதிப்புகளின் அதிகபட்ச பெயர்

# YOUR_MOTTO
source: Votre devise
ta: உங்கள் நாணயம்

# CHANGE_THE_PASSWORD
source: Changement de mot de passe
ta: கடவுச்சொல் மாற்றம்

# YOUR_OLD_PASSWORD
source: Votre ancien mot de passe
ta: உங்கள் பழைய கடவுச்சொல்

# CHANGE
source: Changer
ta: சேஞ்சர்

# USERNAME_MUST_BE_WIKINAME
source: Votre nom d'utilisateur ne doit pas commencer par "!", "@", "#". Il ne doit pas contenir "<", ">", "\", "/". Il doit avoir 3 caractères minimum.
ta: உங்கள் பயனர்பெயர் "!", "@", "#" என்று தொடங்கக் கூடாது. அதில் "<", ">", "\", "/" இருக்கக் கூடாது. இதில் குறைந்தஅளவு 3 எழுத்துகள் இருக்க வேண்டும்.

# YOU_MUST_SPECIFY_AN_EMAIL
source: Vous devez spécifier une adresse de messagerie électronique
ta: நீங்கள் ஒரு மின்னஞ்சல் முகவரியைக் குறிப்பிட வேண்டும்

# THIS_IS_NOT_A_VALID_EMAIL
source: Ceci ne ressemble pas à une adresse de messagerie électronique
ta: இது மின்னஞ்சல் முகவரி போல் தெரியவில்லை

# PASSWORDS_NOT_IDENTICAL
source: Les mots de passe n'étaient pas identiques
ta: கடவுச்சொற்கள் ஒரே மாதிரியாக இல்லை

# PASSWORD_SHOULD_HAVE_5_CHARS_MINIMUM
source: doit contenir au minimum 5 caractères alphanumériques
ta: குறைந்தது 5 எண்ணெழுத்து எழுத்துக்கள் இருக்க வேண்டும்

# YOU_MUST_ACCEPT_COOKIES_TO_GET_CONNECTED
source: Vous devez accepter les cookies pour pouvoir vous connecter
ta: இணைக்க நீங்கள் குக்கீகளை ஏற்க வேண்டும்

# IF_YOU_ARE_REGISTERED_LOGGIN_HERE
source: Si vous êtes déjà enregistré, identifiez-vous ici
ta: நீங்கள் ஏற்கனவே சேமிக்கப்பட்டிருந்தால், உங்களை இங்கே அடையாளம் காணவும்

# PASSWORD_5_CHARS_MINIMUM
source: Mot de passe (5 caractères minimum)
ta: கடவுச்சொல் (குறைந்தபட்சம் 5 எழுத்துக்கள்)

# REMEMBER_ME
source: Se souvenir de moi
ta: என்னை நினைவில் கொள்ளுங்கள்

source: Identification
ta: அடையாளம் காணல்

# FILL_THE_NEXT_FIELDS_IF_YOU_LOGGIN_FOR_THE_FIRST_TIME_AND_REGISTER
source: Les champs suivants sont à remplir si vous vous identifiez pour la première fois (vous créerez ainsi un compte)
ta: நீங்கள் முதல் முறையாக அடையாளம் கண்டால் பின்வரும் புலங்கள் முடிக்கப்பட வேண்டும் (நீங்கள் ஒரு கணக்கை உருவாக்குவீர்கள்)

# PASSWORD_CONFIRMATION
source: Confirmation du mot de passe
ta: கடவுச்சொல் உறுதிப்படுத்தல்

# NEW_ACCOUNT
source: Nouveau compte
ta: புதிய கணக்கு

# LOGGED_USERS_ONLY_ACTION
source: Il faut être connecté pour pouvoir exécuter cette action
ta: இந்த செயலைச் செய்ய நீங்கள் இணைக்கப்பட வேண்டும்

# USER_DELETE
source: Supprimer l'utilisateur
ta: பயனரை நீக்கு

# NO_PAGE_TO_CREATE
source: Aucune page à créer
ta: உருவாக்க பக்கம் இல்லை

# NO_CSRF_TOKEN_ERROR
source: Erreur de conception du site : Le formulaire de soumission ne contenait pas le jeton d'identification unique nécessaire aux mécanismes internes de sécurité.
ta: தள வடிவமைப்பு பிழை: சமர்ப்பிக்கும் படிவத்தில் உள் பாதுகாப்பு வழிமுறைகளுக்குத் தேவையான தனித்துவமான அடையாள கிள்ளாக்கு இல்லை.

# CSRF_TOKEN_FAIL_ERROR
source: Cette page a peut-être été ouverte une seconde fois. Veuillez renouveler la demande depuis cette fenêtre (le jeton interne de sécurité n'était pas bon).
ta: இந்த பக்கம் இரண்டாவது முறையாக திறக்கப்பட்டிருக்கலாம். தயவுசெய்து இந்த சாளரத்திலிருந்து கோரிக்கையை புதுப்பிக்கவும் (உள் பாதுகாப்பு கிள்ளாக்கு நன்றாக இல்லை).

# FAVORITES_ADD
source: Ajouter aux favoris
ta: பிடித்தவையில் சேர்

# FAVORITES_REMOVE
source: Retirer des favoris
ta: பிடித்தவைகளைத் திரும்பப் பெறுங்கள்

# FAVORITES_DELETE_ALL
source: Supprimer tous mes favoris
ta: எனக்கு பிடித்த அனைத்தையும் நீக்கு

# FAVORITES_MY_FAVORITES
source: Mes favoris
ta: எனக்கு பிடித்தவை

# FAVORITES_NO_FAVORITE
source: Aucun favori n'a été enregistré
ta: பிடித்த எதுவும் பதிவு செய்யப்படவில்லை

# FAVORITES_NOT_ACTIVATED
source: L'usage des favoris n'est pas activé sur ce site.
ta: பிடித்தவைகளின் பயன்பாடு இந்த தளத்தில் செயல்படுத்தப்படவில்லை.

# FAVORITES_NOT_CONNECTED
source: L'usage des favoris n'est possible que pour les personnes connectées.
ta: இணைக்கப்பட்ட நபர்களுக்கு மட்டுமே பிடித்தவைகளின் பயன்பாடு சாத்தியமாகும்.

# FAVORITES_TITLE
source: Titre
ta: டைட்ரே

# FAVORITES_LINK
source: Lien
ta: உரிமை

# ADMIN_BACKUPS_CREATING
source: Création d'une sauvegarde
ta: காப்புப்பிரதியை உருவாக்குதல்
