Repository: 247i/TACETr
Catalog: உரை/தானி/yeswiki-yeswiki-extension-syndication-*.po
Languages: ta

# return[]->'SYNDICATION_ACTION_SYNDICATION'
source: Action {{syndication ...}}
ta: செயல் {{syndication ...}}

# return[]->'SYNDICATION_PARAM_URL_REQUIRED'
source: il faut entrer obligatoirement le param&egrave;tre "url" pour syndiquer un flux RSS
ta: il faut entrer willigatoirement le param & egrave; tre "முகவரி" ஊற்றப்பட்ட சிண்டிகர் அன் ஃப்ளக்ச் RSS

# return[]->'SYNDICATION_WRITE_ACCESS_TO_CACHE_FOLDER'
source: le r&eacute;pertoire "cache" n'a pas les droits d'acc&egrave;s en &eacute;criture
ta: லு ஆர் & ஈகூட்;

# return[]->'SYNDICATION_CREATE_CACHE_FOLDER'
source: il faut cr&eacute;er un r&eacute;pertoire "cache" dans le r&eacute;pertoire principal
ta: il faut சிஆர் & eacute; er un r & eacute; பெர்டோயர் "கேச்" டான்ச் லு ஆர் & ஈகூட்;

# return[]->'SYNDICATION_TEMPLATE_NOT_FOUND'
source: n'existe pas, on utilise le fichier template par d&eacute;faut.
ta: n'existe pas, லு ஃபைச்சியர் வார்ப்புருவைப் பயன்படுத்துங்கள் par டி & eacute; faut.

# return[]->'SYNDICATION_READ_MORE'
source: Lire la suite
ta: லயர் லா சூட்

# return[]->'SYNDICATION_ACTION_TWITTER'
source: Action {{twitter ...}}
ta: செயல் {{twitter ...}}

# return[]->'SYNDICATION_PARAM_USER_REQUIRED'
source: param&egrave;tre "user" manquant, il est obligatoire pour sp&eacute;fifier l'utilisateur twitter choisi
ta: param & egrave; tre "பயனர்" manquant, il est wolligatoire pour எச்பி & eacute;

# return[]->'SYNDICATION_ACTION_TWITTERSEARCH'
source: Action {{twittersearch ...}}
ta: செயல் {{twittersearch ...}}

# return[]->'SYNDICATION_PARAM_QUERY_REQUIRED'
source: param&egrave;tre "query" manquant, il est obligatoire pour sp&eacute;cifier votre recherche
ta: பரம் & எக்ரேவ்; ட்ரே "வினவல்" மேன்குவண்ட், il est wolligatoire pour எச்பி & eacute; cifier withre recherche

# return[]->'SYNDICATION_TEMPLATE_DOESNT_EXISTS'
source: Le fichier template
ta: லு ஃபைச்சியர் வார்ப்புரு

# return[]->'SYNDICATION_USE_OF_DEFAULT_TEMPLATE'
source: n'existe pas, on utilise le template par d&eacute;faut
ta: n'existe pas, le வார்ப்புருவைப் பயன்படுத்துங்கள் par டி & eacute; faut

# return[]->'SYNDICATION_SOURCE'
source: source
ta: மூலம்

# return[]->'SYNDICATION_SEE_ALL_CONTENT'
source: Accéder à l'intégralité du contenu
ta: Accéder à l'integralité du contenu
