Repository: 247i/TACETr
Catalog: உரை/தானி/yeswiki-yeswiki-*.po
Languages: ta

# ADMIN_BACKUPS_FORCE_UPDATE
source: Forcer une mise à jour sans sauvegarde
ta: காப்புப்பிரதி இல்லாமல் புதுப்பிப்பை கட்டாயப்படுத்துகிறது

# ADMIN_BACKUPS_BY_PASS
source: Mettre à jour sans sauvegarde
ta: புதுப்பிப்பு

source: OK
ta: சரி

# FAIL
source: ECHEC
ta: தோல்வி

# END_OF_INSTALLATION_BECAUSE_OF_ERRORS
source: Fin de l'installation suite à des erreurs dans la configuration
ta: உள்ளமைவில் பிழைகளைத் தொடர்ந்து நிறுவலின் முடிவு

# INSTALLATION_OF_YESWIKI
source: Installation de YesWiki
ta: யெச்விகியின் நிறுவல்

# YOUR_SYSTEM
source: Votre système
ta: உங்கள் கணினி

# EXISTENT_SYSTEM_RECOGNISED_AS_VERSION
source: existant a été reconnu comme étant la version
ta: தற்போதுள்ள பதிப்பாக அங்கீகரிக்கப்பட்டுள்ளது

# YOU_ARE_UPDATING_YESWIKI_TO_VERSION
source: Vous êtes sur le point de mettre à jour YesWiki pour la version
ta: பதிப்பிற்கு yeswiki ஐ புதுப்பிக்க உள்ளீர்கள்

# CHECK_YOUR_CONFIG_INFORMATION_BELOW
source: Veuillez revoir vos informations de configuration ci-dessous
ta: உங்கள் உள்ளமைவு தகவல்களை கீழே மதிப்பாய்வு செய்யவும்

# FILL_THE_FORM_BELOW
source: Veuillez compléter le formulaire suivant
ta: பின்வரும் படிவத்தை நிறைவு செய்யுங்கள்

# DEFAULT_LANGUAGE
source: Langue par défaut
ta: இயல்புநிலை

# NAVIGATOR_LANGUAGE
source: Langue du navigateur
ta: நேவிகேட்டர்

# DEFAULT_LANGUAGE_INFOS
source: Langue utilisée par défaut pour l'interface de YesWiki, il sera toujours possible de changer de langue pour chacune des pages créées
ta: யெச்விகி இடைமுகத்திற்கு இயல்புநிலையாகப் பயன்படுத்தப்படும் மொழி, உருவாக்கப்பட்ட ஒவ்வொரு பக்கங்களுக்கும் மொழியை மாற்ற எப்போதும் முடியும்

# GENERAL_CONFIGURATION
source: Configuration générale
ta: பொது உள்ளமைவு

# DATABASE_CONFIGURATION
source: Base de données
ta: தரவுத்தளம்

# MORE_INFOS
source: Aide
ta: உதவியாளர்

# MYSQL_SERVER
source: Machine MySQL
ta: இயந்திரம் mysql

# MYSQL_SERVER_INFOS
source: L'adresse IP ou le nom réseau de la machine sur laquelle se trouve votre serveur MySQL
ta: உங்கள் MySQL சேவையகம் அமைந்துள்ள இயந்திரத்தின் ஐபி முகவரி அல்லது பிணைய பெயர்

# MYSQL_DATABASE
source: Base de données MySQL
ta: MySQL தரவுத்தளம்

# MYSQL_DATABASE_INFOS
source: Cette base de données doit déjà exister avant de pouvoir continuer
ta: இந்த தரவுத்தளம் தொடரப்படுவதற்கு முன்பு ஏற்கனவே இருக்க வேண்டும்

# MYSQL_USERNAME
source: Nom de l'utilisateur MySQL
ta: பயனர்பெயர் MySQL

# MYSQL_USERNAME_INFOS
source: Nécessaire pour se connecter à votre base de données
ta: உங்கள் தரவுத்தளத்துடன் இணைக்க தேவை

# TABLE_PREFIX
source: Préfixe des tables
ta: அட்டவணை முன்னொட்டு

# TABLE_PREFIX_INFOS
source: Permet d'utiliser plusieurs YesWiki sur une même base de données : chaque nouveau YesWiki installé devra avoir un préfixe des tables différent
ta: ஒரே தரவுத்தளத்தில் பல யெச்விக்கியைப் பயன்படுத்த உங்களை அனுமதிக்கிறது: நிறுவப்பட்ட ஒவ்வொரு புதிய யெச்விகியும் வேறு அட்டவணை முன்னொட்டு இருக்க வேண்டும்

# MYSQL_PASSWORD
source: Mot de passe MySQL
ta: MySQL கடவுச்சொல்

# YESWIKI_WEBSITE_CONFIGURATION
source: Configuration de votre site YesWiki
ta: உங்கள் யெச்விகி தளத்தின் உள்ளமைவு

# YOUR_WEBSITE_NAME
source: Nom de votre site
ta: உங்கள் தளத்தின் பெயர்

# YOUR_WEBSITE_NAME_INFOS
source: Ceci peut être un NomWiki ou tout autre titre qui apparaitra sur les onglets et fenêtres
ta: இது ஒரு நோம்விகி அல்லது தாவல்கள் மற்றும் சாளரங்களில் தோன்றும் வேறு எந்த தலைப்பாகவும் இருக்கலாம்

# HOMEPAGE
source: Page d'accueil
ta: முகப்பு பக்கம்

# HOMEPAGE_INFOS
source: La page d'accueil de votre YesWiki. Elle doit être un NomWiki
ta: உங்கள் யெச்விகியின் முகப்பு பக்கம். அவள் ஒரு நோம்விகியாக இருக்க வேண்டும்

# KEYWORDS
source: Mots clés
ta: முக்கிய வார்த்தைகள்

# KEYWORDS_INFOS
source: Mots clés qui seront insérés dans les codes HTML (méta-données)
ta: உஉகுமொ குறியீடுகளில் (மெட்டா-பயலங்கள்) செருகப்படும் முக்கிய வார்த்தைகள்

source: Description
ta: விவரம்

# DESCRIPTION_INFOS
source: La description de votre site qui sera inséré dans les codes HTML (méta-données)
ta: உஉகுமொ குறியீடுகளில் (மெட்டா-போன்னீச்) செருகப்படும் உங்கள் தளத்தின் விளக்கம்

# CREATION_OF_ADMIN_ACCOUNT
source: Compte administrateur
ta: நிர்வாகி

# ADMIN_ACCOUNT_CAN
source: Le compte administrateur permet de
ta: நிர்வாகி கணக்கு அனுமதிக்கிறது

# MODIFY_AND_DELETE_ANY_PAGE
source: Modifier et supprimer n'importe quelle page
ta: எந்தப் பக்கத்தையும் திருத்தவும் நீக்கவும்

# MODIFY_ACCESS_RIGHTS_ON_ANY_PAGE
source: Modifier les droits d'accès à n'importe quelle page
ta: எந்த பக்கத்திற்கும் அணுகல் உரிமைகளை மாற்றவும்

# GENERATE_ACCESS_RIGHTS_ON_ANY_ACTION_OR_HANDLER
source: Gérer les droits d'accès à n'importe quelle action ou handler
ta: எந்தவொரு நடவடிக்கை அல்லது கையாளுபவருக்கும் அணுகல் உரிமைகளை நிர்வகிக்கவும்

# GENERATE_GROUPS
source: Gérer les groupes, ajouter/supprimer des utilisateurs au groupe administrateur (ayant les mêmes droits que lui)
ta: குழுக்களை நிர்வகிக்கவும், நிர்வாகி குழுவில் பயனர்களைச் சேர்க்கவும்/நீக்கவும் (அவரைப் போன்ற உரிமைகளைக் கொண்டது)

# ALL_ADMIN_TASKS_ARE_DESCRIBED_IN_THE_PAGE
source: Toutes les tâches d'administration sont accessibles depuis le bouton avec la roue crantée
ta: அனைத்து நிர்வாக பணிகளும் பொத்தானிலிருந்து கவனிக்கப்படாத சக்கரத்துடன் அணுகக்கூடியவை

# USE_AN_EXISTING_ACCOUNT
source: Utiliser un compte existant
ta: ஏற்கனவே உள்ள கணக்கைப் பயன்படுத்தவும்

# NO
source: Non
ta: அல்லாத

# YES
source: Oui
ta: ஆம்

# OR_CREATE_NEW_ACCOUNT
source: Ou créer un nouveau compte
ta: அல்லது புதிய கணக்கை உருவாக்கவும்

# ADMIN
source: Administrateur
ta: நிர்வாகி

# MUST_BE_WIKINAME
source: doit être un NomWiki
ta: ஒரு நோம்விகியாக இருக்க வேண்டும்

# PASSWORD
source: Mot de passe
ta: கடவுச்சொல்

# EMAIL_ADDRESS
source: Adresse e-mail
ta: மின்னஞ்சல் முகவரி

# MORE_OPTIONS
source: Options supplémentaires
ta: கூடுதல் விருப்பங்கள்

# ADVANCED_CONFIGURATION
source: + Configuration avancée
ta: + மேம்பட்ட உள்ளமைவு

# URL_REDIRECTION
source: Redirection d'URL
ta: திருப்பிவிடுதல் d'Url

# NEW_INSTALL_VALUES_CHANGE_ONLY_IF_YOU_KNOW_WHAT_YOU_ARE_DOING
source: Ceci est une nouvelle installation. Le programme d'installation va essayer de trouver les valeurs appropriées. Changez-les uniquement si vous savez ce que vous faites
ta: இது ஒரு புதிய நிறுவல். நிறுவல் நிரல் பொருத்தமான மதிப்புகளைக் கண்டுபிடிக்க முயற்சிக்கும். நீங்கள் என்ன செய்கிறீர்கள் என்று உங்களுக்குத் தெரிந்தால் மட்டுமே அவற்றை மாற்றவும்

# PAGENAME_WILL_BE_ADDED_AFTER_CHANGE_JUST_FOR_REDIRECTION
source: Les noms des pages seront directement rajoutés à l'URL de base de votre site YesWiki. Supprimez la partie "?" uniquement si vous utilisez la redirection (voir ci après)
ta: பக்கங்களின் பெயர்கள் உங்கள் யோவிகி தளத்தின் அடிப்படை முகவரி இல் நேரடியாக சேர்க்கப்படும். "பகுதி?" நீங்கள் திசைதிருப்பலைப் பயன்படுத்தினால் மட்டுமே (கீழே காண்க)

# BASE_URL
source: URL de base
ta: அடிப்படை முகவரி

# REDIRECTION_SHOULD_BE_ACTIVE_ONLY_IF_USED_IN_YESWIKI
source: ATTENTION : à n'activer que si nginx ou apache sont configurés pour ré-ecrire les URL sans le point d'interrogation
ta: தயவுசெய்து கவனிக்கவும்: கேள்விக்குறி இல்லாமல் முகவரி களை மீண்டும் எழுத Nginx அல்லது அப்பாச்சி கட்டமைக்கப்பட்டிருந்தால் மட்டுமே செயல்படுத்த

# HTML_INSERTION_HELP_TEXT
source: Augmente grandement les fonctionnalités du wiki, en permettant l'ajout de vidéos et iframe par exemple, mais est moins sécurisé
ta: விக்கியின் அம்சங்களை பெரிதும் அதிகரிக்கிறது, எடுத்துக்காட்டாக வீடியோக்கள் மற்றும் ஐஃப்ரேமை சேர்க்க அனுமதிக்கிறது, ஆனால் குறைந்த பாதுகாப்பானது

# INDEX_HELP_TEXT
source: Indique dans les meta-données html et dans le fichier robots.txt si votre site doit etre indexé par les moteurs de recherche ou pas
ta: மெட்டா-டானீச் உஉகுமொ மற்றும் robots.txt கோப்பில் உங்கள் தளம் தேடுபொறிகளால் குறியிடப்பட வேண்டுமா இல்லையா என்பதைக் குறிக்கிறது

# ACTIVATE_REDIRECTION_MODE
source: Activation du mode "redirection automatique"
ta: "தானியங்கி திசைதிருப்பல்" பயன்முறையை செயல்படுத்துதல்

# OTHER_OPTIONS
source: Autres options
ta: பிற விருப்பங்கள்

# OBLIGE_TO_PREVIEW_BEFORE_SAVING_PAGE
source: Imposer de faire un aperçu avant de pouvoir sauver une page
ta: நீங்கள் ஒரு பக்கத்தை சேமிப்பதற்கு முன் ஒரு கண்ணோட்டத்தை உருவாக்க வழங்குங்கள்

# AUTHORIZE_HTML_INSERTION
source: Autoriser l'insertion de HTML brut
ta: மூல உஉகுமொ இன் செருகலை அங்கீகரிக்கவும்

# AUTHORIZE_INDEX_BY_ROBOTS
source: Autoriser l'indexation par les moteurs de recherche
ta: தேடுபொறிகளால் குறியீட்டை அங்கீகரிக்கவும்

# CONTINUE
source: Continuer
ta: தொடரவும்

# PROBLEM_WHILE_INSTALLING
source: problème dans la procédure d'installation
ta: நிறுவல் நடைமுறையில் சிக்கல்

# VERIFICATION_OF_DATAS_AND_DATABASE_INSTALLATION
source: Test de la configuration et installation de la base de données
ta: தரவுத்தளத்தின் உள்ளமைவு மற்றும் நிறுவல்

# VERIFY_MYSQL_PASSWORD
source: Vérification mot de passe MySQL
ta: MySQL கடவுச்சொல்லை சரிபார்க்கிறது

# INCORRECT_MYSQL_PASSWORD
source: Le mot de passe MySQL est incorrect
ta: MySQL கடவுச்சொல் தவறானது

# TEST_MYSQL_CONNECTION
source: Test connexion MySQL
ta: சோதனை இணைப்பு MySQL

# SEARCH_FOR_DATABASE
source: Recherche base de données
ta: தரவுத்தள ஆராய்ச்சி

# GO_BACK
source: Retour
ta: மீண்டும்சுற்று

# NO_DATABASE_FOUND_TRY_TO_CREATE
source: La base de données que vous avez choisie n'existe pas. Nous allons tenter de la créer
ta: நீங்கள் தேர்ந்தெடுத்த தரவுத்தளம் இல்லை. அதை உருவாக்க முயற்சிப்போம்

# TRYING_TO_CREATE_DATABASE
source: Tentative de création de la base de données
ta: தரவுத்தளத்தை உருவாக்க முயற்சி

# DATABASE_COULD_NOT_BE_CREATED_YOU_MUST_CREATE_IT_MANUALLY
source: Création de la base impossible. Vous devez créer cette base manuellement avant d'installer YesWiki
ta: தளத்தை உருவாக்குவது சாத்தியமற்றது. யேச்விகியை நிறுவுவதற்கு முன் இந்த தளத்தை கைமுறையாக உருவாக்க வேண்டும்

# DATABASE_DOESNT_EXIST_YOU_MUST_CREATE_IT
source: La base de données que vous avez choisie n'existe pas, vous devez la créer avant d'installer YesWiki
ta: நீங்கள் தேர்ந்தெடுத்த தரவுத்தளம் இல்லை, யெச்விகியை நிறுவுவதற்கு முன் அதை உருவாக்க வேண்டும்

# CHECKING_THE_ADMIN_NAME
source: Vérification du nom de l'administrateur
ta: நிர்வாகி பெயரைச் சரிபார்க்கிறது

# CHECKING_THE_ADMIN_PASSWORD
source: Vérification du mot de passe Administrateur
ta: நிர்வாகி கடவுச்சொல் சரிபார்ப்பு

# CHECKING_THE_ADMIN_PASSWORD_CONFIRMATION
source: Vérification de la concordance des deux mots de passes administrateurs
ta: நிர்வாகிகளின் இரண்டு சொற்களின் ஒத்திசைவை சரிபார்க்கிறது

# CHECKING_ROOT_PAGE_NAME
source: Vérification du nom de la page d'accueil
ta: முகப்பு பக்கத்தின் பெயரின் சரிபார்ப்பு

# INCORRECT_ROOT_PAGE_NAME
source: Le nom de la page d'accueil doit uniquement contenir des lettres non accentuées, des chiffres, '_', '-' ou '.'
ta: முகப்பு பக்கத்தின் பெயரில் அறியப்படாத கடிதங்கள், புள்ளிவிவரங்கள், '_', '-' அல்லது '.'

# ADMIN_PASSWORD_ARE_DIFFERENT
source: Les mots de passe Aaministrateur sont différents
ta: நிர்வாகி கடவுச்சொற்கள் வேறுபட்டவை

# DATABASE_INSTALLATION
source: Installation de la base de données
ta: தரவுத்தளத்தை நிறுவுதல்

# CREATION_OF_TABLES
source: Création des tables, de l'administrateur et du groupe admins
ta: அட்டவணைகள், நிர்வாகி மற்றும் குழு நிர்வாகிகளை உருவாக்குதல்

# SQL_FILE_NOT_FOUND
source: Fichier SQL non trouvé
ta: கவிமொ கோப்பு கிடைக்கவில்லை

# NOT_POSSIBLE_TO_CREATE_SQL_TABLES
source: Impossible de créer les tables SQL.
ta: கவிமொ அட்டவணைகளை உருவாக்க இயலாது.

# ALREADY_CREATED
source: Déjà créée
ta: ஏற்கனவே உருவாக்கப்பட்டது

# ADMIN_ACCOUNT_CREATION
source: Création du compte Administrateur
ta: நிர்வாகி கணக்கை உருவாக்குதல்

# INSERTION_OF_PAGES
source: Insertion des pages par défaut
ta: இயல்புநிலை பக்கங்களை செருகுவது

# ALREADY_EXISTING
source: Existe déjà
ta: ஏற்கனவே இருக்கிறது

# UPDATING_FROM_WIKINI_0_1
source: En cours de mise à jour de WikiNi 0.1
ta: விக்கினியின் கீழ் 0.1 புதுப்பிப்பு

# TINY_MODIFICATION_OF_PAGES_TABLE
source: Modification très légère de la table des pages
ta: பக்கங்களின் அட்டவணையின் மிகவும் ஒளி மாற்றம்

# ALREADY_DONE
source: Already done? Hmm!
ta: ஏற்கனவே முடிந்தது? அ்ம்!

# INSERTION_OF_USER_IN_ADMIN_GROUP
source: Insertion de l'utilisateur spécifié dans le groupe admin
ta: நிர்வாகக் குழுவில் குறிப்பிடப்பட்ட பயனர் செருகல்

# NEXT_STEP_WRITE_CONFIGURATION_FILE
source: A l'étape suivante, le programme d'installation va essayer d'écrire le fichier de configuration
ta: அடுத்த கட்டத்தில், நிறுவல் நிரல் உள்ளமைவு கோப்பை எழுத முயற்சிக்கும்

# VERIFY_YOU_HAVE_RIGHTS_TO_WRITE_FILE
source: Assurez vous que le serveur web a bien le droit d'écrire dans ce fichier, sinon vous devrez le modifier manuellement
ta: இந்த கோப்பில் எழுத வலை சேவையகத்திற்கு உரிமை உள்ளதா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், இல்லையெனில் நீங்கள் அதை கைமுறையாக மாற்ற வேண்டும்

# CHECK_EXISTING_TABLE_PREFIX
source: Vérification de l'existence du préfixe de table
ta: அட்டவணை முன்னொட்டின் இருப்பின் சரிபார்ப்பு

# TABLE_PREFIX_ALREADY_USED
source: Le préfixe de table est déjà utilisé. Veuillez en choisir un nouveau.
ta: அட்டவணை முன்னொட்டு ஏற்கனவே பயன்படுத்தப்படுகிறது. புதிய ஒன்றைத் தேர்வுசெய்க.

# WRITING_CONFIGURATION_FILE
source: écriture du fichier de configuration
ta: உள்ளமைவு கோப்பை எழுதுதல்

# CREATED
source: créée
ta: உருவாக்கப்பட்டது

# DONT_CHANGE_YESWIKI_VERSION_MANUALLY
source: ne changez pas la yeswiki_version manuellement
ta: Yeswiki_version ஐ கைமுறையாக மாற்ற வேண்டாம்

# WRITING_CONFIGURATION_FILE_WIP
source: Création du fichier de configuration en cours
ta: தற்போதைய உள்ளமைவு கோப்பை உருவாக்குதல்

# FINISHED_CONGRATULATIONS
source: Voila c'est terminé, félicitations
ta: இங்கே அது முடிந்துவிட்டது, வாழ்த்துக்கள்

# GO_TO_YOUR_NEW_YESWIKI_WEBSITE
source: Aller sur votre nouveau site YesWiki
ta: உங்கள் புதிய யெச்விகி தளத்திற்குச் செல்லவும்

# IT_IS_RECOMMANDED_TO_REMOVE_WRITE_ACCESS_TO_CONFIG_FILE
source: Il est conseillé de retirer l'accès en écriture au fichier
ta: கோப்பில் எழுத்துப்பூர்வமாக அணுகலை திரும்பப் பெறுவது நல்லது

# THIS_COULD_BE_UNSECURE
source: ceci peut être une faille dans la sécurité
ta: இது பாதுகாப்பில் ஒரு குறைபாடாக இருக்கலாம்

# CONFIGURATION_FILE
source: le fichier de configuration
ta: உள்ளமைவு கோப்பு

# CONFIGURATION_FILE_NOT_CREATED
source: n'a pu être créé
ta: உருவாக்க முடியவில்லை

# TRY_CHANGE_ACCESS_RIGHTS_OR_FTP_TRANSFERT
source: Veuillez vous assurez que votre serveur a les droits d'accès en écriture pour ce fichier. Si pour une raison quelconque vous ne pouvez pas faire ça, vous devez copier les informations suivantes dans un fichier et les transférer au moyen d'un logiciel de transfert de fichier (ftp) sur le serveur dans un fichier
ta: இந்த கோப்பிற்கான அணுகல் உரிமைகளை உங்கள் சேவையகத்தில் உறுதிப்படுத்தவும். எந்தவொரு காரணத்திற்காகவும் நீங்கள் இதைச் செய்ய முடியாவிட்டால், நீங்கள் பின்வரும் தகவல்களை ஒரு கோப்பில் நகலெடுத்து கோப்பு பரிமாற்ற மென்பொருள் (FTP) மூலம் ஒரு கோப்பில் உள்ள சேவையகத்திற்கு மாற்ற வேண்டும்

# DIRECTLY_IN_THE_YESWIKI_FOLDER
source: directement dans le répertoire de YesWiki. Une fois que vous aurez fait cela, votre site YesWiki devrait fonctionner correctement
ta: நேரடியாக யோவிகி கோப்பகத்தில். நீங்கள் இதைச் செய்தவுடன், உங்கள் யெச்விகி தளம் சரியாக செயல்பட வேண்டும்

# TRY_AGAIN
source: Essayer à nouveau
ta: மீண்டும் முயற்சி வெற்றி

# USERS
source: Utilisateurs
ta: பயனர்கள்

# GROUPS
source: Groupes
ta: குழுக்கள்

# USER_CONFIRM_DELETE
source: Êtes-vous sûr·e de vouloir supprimer l’utilisateur·ice ?
ta: பயனரை நீக்க விரும்புகிறீர்களா?

# USER_DELETE_LONE_MEMBER_OF_GROUP
source: Vous ne pouvez pas supprimer un utilisateur qui est seul dans au moins un groupe
ta: குறைந்தது ஒரு குழுவில் தனியாக இருக்கும் ஒரு பயனரை நீங்கள் நீக்க முடியாது

# USER_DELETE_QUERY_FAILED
source: La requête de suppression de l'utilisateur dans la base de données a échoué
ta: தரவுத்தளத்தில் பயனர் நீக்குதல் கோரிக்கை தோல்வியடைந்தது

# USER_EMAIL_S_MAXIMUM_LENGTH_IS
source: Le nomnbre maximum de caractères d'un email d'utilisateur est
ta: பயனர் மின்னஞ்சலில் அதிகபட்ச எழுத்துக்கள் உள்ளன

# USER_LISTGROUPMEMBERSHIPS_QUERY_FAILED
source: La requête pour lsiter les groupes auquels l'utilisateur appartient a échoué
ta: பயனர் சொந்தமான குழுக்களை பட்டியலிடுவதற்கான கோரிக்கை தோல்வியுற்றது

# USER_MUST_BE_ADMIN_TO_DELETE
source: Vous devez être administrateur pour supprimer un utilisateur
ta: ஒரு பயனரை நீக்க நீங்கள் இயக்குநராக இருக்க வேண்டும்

# USER_NAME_S_MAXIMUM_LENGTH_IS
source: Le nomnbre maximum de caractères d'un nom d'utilisateur est
ta: பயனர்பெயரின் அதிகபட்ச எழுத்துக்கள்

# USER_NO_SPACES_IN_PASSWORD
source: Les espaces ne sont pas autorisés dans un mot de passe
ta: கடவுச்சொல்லில் இடைவெளிகள் அனுமதிக்கப்படாது

# USER_PASSWORD_MINIMUM_NUMBER_OF_CHARACTERS_IS
source: Le nombre minimum de caractères d'un mot de passe est
ta: கடவுச்சொல்லின் குறைந்தபட்ச பண்புகள்

# USER_PASSWORDS_NOT_IDENTICAL
source: Le mot de passe saisi pour vérification n'est pas identique au premier !
ta: சரிபார்ப்புக்காக உள்ளிடப்பட்ட கடவுச்சொல் முதல் ஒத்ததாக இல்லை!

# USER_PASSWORD_TOO_SHORT
source: Mot de passe trop court
ta: மிகக் குறுகிய கடவுச்சொல்

# USER_THIS_EMAIL_IS_ALLREADY_USED_ON_THIS_WIKI
source: L'email saisi est déjà utilisé sur ce wiki
ta: நுழைந்த பற்சிப்பி ஏற்கனவே இந்த விக்கியில் பயன்படுத்தப்படுகிறது

# USER_THIS_IS_NOT_A_VALID_NAME
source: Ceci n'est pas un nom d'utilisateur valide
ta: இது செல்லுபடியாகும் பயனர்பெயர் அல்ல

# USER_THIS_IS_NOT_A_VALID_EMAIL
source: Ceci n'est pas un email valide
ta: இது சரியான மின்னஞ்சல் அல்ல

# USER_UPDATE_QUERY_FAILED
source: La requête de mise à jour de l'utilisateur dans la base de données a échoué
ta: தரவுத்தளத்தில் பயனரின் புதுப்பிப்பு கோரிக்கை தோல்வியடைந்தது

# USER_YOU_MUST_SPECIFY_A_NAME
source: Veuillez saisir un nom pour l'utilisateur
ta: பயனருக்கான பெயரை உள்ளிடவும்

# USER_YOU_MUST_SPECIFY_AN_EMAIL
source: Veuillez saisir un email pour l'utilisateur
ta: பயனருக்கான மின்னஞ்சலை உள்ளிடவும்

# USER_USERSTABLE_MISTAKEN_ARGUMENT
source: l'action usertable a reçu un argument non autorisé
ta: ஓர்போர்டபிள் நடவடிக்கை அங்கீகரிக்கப்படாத வாதத்தைப் பெற்றது

# USER_WRONG_PASSWORD
source: Mot de passe incorrect
ta: தவறான கடவுச்சொல்

# USER_INCORRECT_PASSWORD_KEY
source: La clef de validation du mot de passe est incorrecte
ta: கடவுச்சொல் சரிபார்ப்பு விசை தவறானது

# USER_PASSWORD_UPDATE_FAILED
source: La modification du mot de passe a échoué
ta: கடவுச்சொல் மாற்றம் தோல்வியடைந்தது

# USER_NOT_LOGGED_IN_CANT_LOG_OUT
source: Déconnexion impossible car personne n'est connecté
ta: யாரும் இணைக்கப்படாததால் துண்டிப்பு சாத்தியமற்றது

# USER_TRYING_TO_LOG_WRONG_USER_OUT
source: Vous essayez de déconnecter quelqu'un d'autre
ta: நீங்கள் வேறொருவரை துண்டிக்க முயற்சிக்கிறீர்கள்

# USER_CREATION_FAILED
source: La création de l'utilisateur a échoué
ta: பயனரின் உருவாக்கம் தோல்வியடைந்தது

# USER_LOAD_BY_NAME_QUERY_FAILED
source: La requête de chargement de l'utilisateur par son nom depuis la base de données a échoué
ta: தரவுத்தளத்திலிருந்து அதன் பெயரால் பயனர் ஏற்றுதல் கோரிக்கை தோல்வியடைந்தது

# USER_NO_USER_WITH_THAT_NAME
source: Il n'y a aucun utilisateur avec ce nom
ta: இந்த பெயருடன் எந்த பயனரும் இல்லை

# USER_LOAD_BY_EMAIL_QUERY_FAILED
source: La requête de chargement de l'utilisateur par son email depuis la base de données a échoué
ta: தரவுத்தளத்திலிருந்து அவரது மின்னஞ்சல் மூலம் பயனர் ஏற்றுதல் கோரிக்கை தோல்வியடைந்தது

# USER_NO_USER_WITH_THAT_EMAIL
source: Il n'y a aucun utilisateur avec cet email
ta: இந்த மின்னஞ்சலுடன் பயனரும் இல்லை

# USER_UPDATE_MISSPELLED_PROPERTIES
source: La liste des champs à modifier par updateIntoDB est certainement défectueuse
ta: UpdateIntoDB ஆல் மாற்றப்பட வேண்டிய புலங்களின் பட்டியல் நிச்சயமாக குறைபாடுடையது

# USER_CANT_DELETE_ONESELF
source: Vous ne pouvez supprimer votre compte
ta: உங்கள் கணக்கை நீக்க முடியாது

# USER_TRYING_TO_MODIFY_AN_INEXISTANT_USER
source: L'utilisateur en cours de modification n'existe pas dans la base de données
ta: பயனர் மாற்றியமைக்கப்படுவது தரவுத்தளத்தில் இல்லை

# USER_YOU_ARE_NOW_DISCONNECTED
source: Vous êtes à présent déconnecté
ta: நீங்கள் இப்போது துண்டிக்கப்பட்டுள்ளீர்கள்

# USER_PARAMETERS_SAVED
source: Paramètres sauvegardés
ta: சேமித்த அளவுருக்கள்

# USER_DELETED
source: utilisateur supprimé
ta: நீக்கப்பட்ட பயனர்

# USER_PASSWORD_CHANGED
source: Mot de passe modifié
ta: மாற்றியமைக்கப்பட்ட கடவுச்சொல்

# USER_EMAIL_ADDRESS
source: Adresse de messagerie électronique
ta: மின்னணு மின்னஞ்சல் முகவரி

# USER_DOUBLE_CLICK_TO_EDIT
source: Éditer en double-cliquant
ta: இரட்டை சொடுக்கு

# USER_SHOW_COMMENTS_BY_DEFAULT
source: Par défaut, montrer les commentaires
ta: இயல்பாக, கருத்துகளைக் காட்டுங்கள்

# USER_MAX_NUMBER_OF_LASTEST_COMMENTS
source: Nombre maximum de derniers commentaires
ta: அண்மைக் கால கருத்துகளின் அதிகபட்ச எண்ணிக்கை

# USER_MAX_NUMBER_OF_VERSIONS
source: Nombre maximum de versions
ta: பதிப்புகளின் அதிகபட்ச பெயர்

# USER_MOTTO
source: Votre devise
ta: உங்கள் நாணயம்

# USER_UPDATE
source: Mise à jour
ta: புதுப்பிப்பு

# USER_DISCONNECT
source: Déconnexion
ta: துண்டிப்பு

# USER_CHANGE_THE_PASSWORD
source: Changement de mot de passe
ta: கடவுச்சொல் மாற்றம்

# USER_OLD_PASSWORD
source: Votre ancien mot de passe
ta: உங்கள் பழைய கடவுச்சொல்

# USER_NEW_PASSWORD
source: Nouveau mot de passe
ta: புதிய கடவுச்சொல்

# USER_CHANGE
source: Changer
ta: சேஞ்சர்

# USER_MUST_ACCEPT_COOKIES_TO_GET_CONNECTED
source: Vous devez accepter les cookies pour pouvoir vous connecter
ta: இணைக்க நீங்கள் குக்கீகளை ஏற்க வேண்டும்

# USER_WIKINAME
source: Votre NomWiki
ta: உங்கள் நோம்விகி

# USER_USERNAME
source: Votre nom d'utilisateur, utilisatrice
ta: உங்கள் பயனர்பெயர், பயனர்

# USER_PASSWORD_CONFIRMATION
source: Confirmation du mot de passe
ta: கடவுச்சொல் உறுதிப்படுத்தல்

# USER_NEW_ACCOUNT
source: Nouveau compte
ta: புதிய கணக்கு

# USER_PASSWORD
source: Mot de passe
ta: கடவுச்சொல்

# USER_ERRORS_FOUND
source: Erreur(s) trouvée(s)
ta: பிழை (கள்) காணப்படுகிறது (கள்)

# USER_YOU_MUST_SPECIFY_A_POSITIVE_INTEGER_FOR
source: Il faut une valeur entier positif pour %{name}.
ta: %{name} க்கு நேர்மறையான முழு மதிப்பையும் இது எடுக்கும்.

# USER_YOU_MUST_SPECIFY_YES_OR_NO
source: Il faut une value 'Y' ou 'N' pour %{name}.
ta: %{name} க்கு உங்களின் 'ஆம்' அல்லது 'இல்' மதிப்புத் தேவை.

# USER_YOU_MUST_SPECIFY_A_STRING
source: Il faut une chaîne de caractères pour %{name}.
ta: %{name} க்கு உங்களுக்கு ஒரு எழுத்து சரம் தேவை.

# DATABASE_QUERY_FAILED
source: La requête a échoué {\YesWiki\Database}
ta: கோரிக்கை தோல்வியுற்றது {\ yeswiki \ தரவுத்தளம்}

# DATABASE_YOU_MUST_FIRST_SET_ARGUMENT
source: Il manque des arguments pour un objet de la classe \YesWiki\Database
ta: வகுப்பின் ஒரு பொருளுக்கு வாதங்கள் இல்லை \ yewiki \ தரவுத்தளங்கள்

# DATABASE_MISSING_ARGUMENT
source: manque(nt)
ta: காணவில்லை)

# ACLS_RESERVED_FOR_ADMINS
source: Cette action est réservée aux admins
ta: இந்த நடவடிக்கை நிர்வாகிகளுக்கு ஒதுக்கப்பட்டுள்ளது

# ACLS_NO_SELECTED_PAGE
source: Aucune page n'a été sélectionnée.
ta: எந்தப் பக்கமும் தேர்ந்தெடுக்கப்படவில்லை.

# ACLS_NO_SELECTED_RIGHTS
source: Vous n'avez pas sélectionné de droits à modifier.
ta: மாற்றுவதற்கான எந்த உரிமையும் நீங்கள் தேர்வு செய்யவில்லை.

# ACLS_RIGHTS_WERE_SUCCESFULLY_CHANGED
source: Droit modifiés avec succès
ta: வெற்றிகரமாக மாற்றியமைக்கப்பட்ட சட்டம்

# ACLS_SELECT_PAGES_TO_MODIFY
source: Cochez les pages que vous souhaitez modifier et choisissez une action en bas de page
ta: நீங்கள் மாற்ற விரும்பும் பக்கங்களை சரிபார்த்து, பக்கத்தின் கீழே ஒரு செயலைத் தேர்வுசெய்க

# ACLS_PAGE
source: Page
ta: பக்கம்

# ACLS_FOR_SELECTED_PAGES
source: Actions pour les pages cochées ci dessus
ta: மேலே சரிபார்க்கப்பட்ட பக்கங்களுக்கான செயல்கள்

# ACLS_RESET_SELECTED_PAGES
source: Réinitialiser (avec les valeurs par défaut définies dans
ta: மீட்டமைக்கவும் (இயல்புநிலை மதிப்புகள் வரையறுக்கப்பட்டுள்ளன

# ACLS_REPLACE_SELECTED_PAGES
source: Remplacer (Les droits actuels seront supprimés)
ta: மாற்றவும் (தற்போதைய உரிமைகள் நீக்கப்படும்)
