Repository: 247i/TACETr
Catalog: உரை/தானி/yeswiki-yeswiki-*.po
Languages: ta

# ACLS_HELPER
source: Séparez chaque entrée des virgules, par exemple</br> <b>*</b> (tous les utilisateurs)</br> <b>+</b> (utilisateurs enregistrés)</br> <b>%</b> (créateur de la fiche/page)</br> <b>@nom_du_groupe</b> (groupe d'utilisateur, ex: @admins)</br> <b>JamesBond</b> (nom YesWiki d'un utilisateur)</br> <b>!SuperCat</b> (négation, SuperCat n'est pas autorisé)</br>
ta: கமாவிலிருந்து ஒவ்வொரு நுழைவையும் பிரிக்கவும், எடுத்துக்காட்டாக</br> <b>*</b> (அனைத்து பயனர்களும்)</br> <b>+</b> (பதிவுசெய்யப்பட்ட பயனர்கள்)</br> <b>%</b> (கோப்பு/பக்கத்தை உருவாக்கியவர்)</br> <b>@nom_du_groupe</b> (பயனர் குழு, எ.கா: @admins)</br> <b>சேம்சுபாண்டு </b> (பயனரின் ஆம்விக்கி பெயர்)</br> <b>!அருமைபூனை</b> (மறுப்பு, அருமைபூனை அங்கீகரிக்கப்படவில்லை) </br>

# ACLS_MODE_SIMPLE
source: Mode simple
ta: பயன்முறை எளிமையானது

# ACLS_MODE_ADVANCED
source: Mode avancé
ta: மேம்பட்ட ஃபேசன்

# ACLS_NO_CHANGE
source: Ne rien changer
ta: எதுவும் செய்ய வேண்டாம்

# ACLS_EVERYBODY
source: Tout le monde
ta: எல்லோரும்

# ACLS_AUTHENTIFICATED_USERS
source: Utilisateurs connectés
ta: இணைக்கப்பட்ட பயனர்கள்

# ACLS_OWNER
source: Propriétaire de la page
ta: பக்க உரிமையாளர்

# ACLS_ADMIN_GROUP
source: Groupe admin
ta: நிர்வாக குழு

# ACLS_LIST_OF_ACLS
source: Liste des droits séparés par des virgules
ta: காற்புள்ளிகளால் பிரிக்கப்பட்ட உரிமைகளின் பட்டியல்

# ACLS_UPDATE
source: Mettre à jour
ta: புதுப்பிக்க

# ACLS_COMMENTS_CLOSED
source: Commentaires fermés
ta: மூடிய கருத்துகள்

# ACLS_READ
source: Droits de lecture
ta: வாசிப்பு உரிமைகள்

# ACLS_WRITE
source: Droits d'écriture
ta: எழுதும் உரிமைகள்

# THEME_MANAGER_THEME_FOLDER
source: Le dossier du thème
ta: கருப்பொருள் கோப்பு

# THEME_MANAGER_SQUELETTE_FILE
source: Le fichier du squelette
ta: எலும்புக்கூடு கோப்பு

# THEME_MANAGER_NOT_FOUND
source: n'a pas été trouvé.
ta: காணப்படவில்லை.

# THEME_MANAGER_ERROR_GETTING_FILE
source: Une erreur s'est produite en chargeant ce fichier :
ta: இந்த கோப்பை ஏற்றுவதன் மூலம் பிழை ஏற்பட்டது:

# THEME_MANAGER_CLICK_TO_INSTALL
source: Cliquer pour installer le thème
ta: கருப்பொருள் நிறுவ சொடுக்கு செய்க

# THEME_MANAGER_AND_REPAIR
source: et réparer le site
ta: மற்றும் தளத்தை சரிசெய்யவும்

# THEME_MANAGER_LOGIN_AS_ADMIN
source: Veuillez vous connecter en tant qu'administrateur pour faire la mise à jour.
ta: புதுப்பிக்க நிர்வாகியாக இணைக்கவும்.

# EDIT_CONFIG_TITLE
source: Modification du fichier de configuration
ta: உள்ளமைவு கோப்பின் மாற்றம்

# EDIT_CONFIG_CURRENT_VALUE
source: Valeur actuelle
ta: தற்போதைய மதிப்பு

# EDIT_CONFIG_SAVE
source: Configuration sauvegardée
ta: சேமித்த உள்ளமைவு

# EDIT_CONFIG_HINT_WAKKA_NAME
source: Titre de votre wiki
ta: உங்கள் விக்கியின் தலைப்பு

# EDIT_CONFIG_HINT_ROOT_PAGE
source: Nom de la page d'accueil
ta: முகப்பு பக்கத்தின் பெயர்

# EDIT_CONFIG_HINT_DEFAULT_WRITE_ACL
source: Droits d'écriture par défaut des pages (* pour tous, + pour personnes identifiées, @admins pour groupe admin)
ta: பக்கங்களின் இயல்புநிலை எழுதும் உரிமைகள் (* அனைவருக்கும், + அடையாளம் காணப்பட்ட நபர்களுக்கு, நிர்வாகக் குழுவிற்கு adadmins)

# EDIT_CONFIG_HINT_DEFAULT_READ_ACL
source: Droits de lecture par défaut des pages (* pour tous, + pour personnes identifiées, @admins pour groupe admin)
ta: இயல்புநிலை பக்கங்கள் வாசிப்பு உரிமைகள் (* அனைவருக்கும், + அடையாளம் காணப்பட்ட நபர்களுக்கு, நிர்வாகக் குழுவிற்கான admins)

# EDIT_CONFIG_HINT_DEFAULT_COMMENT_ACL
source: Droits de commentaires par défaut des pages (comments-closed pour ferme, * pour tous, + pour personnes identifiées, @admins pour groupe admin)
ta: இயல்புநிலை பக்கங்கள் வர்ணனை உரிமைகள் (பண்ணைக்கான கருத்துரைகள், * அனைவருக்கும், + அடையாளம் காணப்பட்ட நபர்களுக்கு, நிர்வாகக் குழுவிற்கு adadmins)

# EDIT_CONFIG_HINT_COMMENTS_ACTIVATED
source: Commentaires activés (true ou false)
ta: செயல்படுத்தப்பட்ட கருத்துகள் (உண்மை அல்லது பொய்)

# EDIT_CONFIG_HINT_COMMENTS_HANDLER
source: Type de commentaires utilisés (''/embedded_humhub/external_humhub/yeswiki)
ta: பயன்படுத்தப்பட்ட கருத்துகளின் வகை (''/உட்பொதிக்கப்பட்ட_உமப்/வெளிப்புற_உமப்/யெச்விகி)

# EDIT_CONFIG_HINT_DEBUG
source: Activer le mode de debug (yes ou no)
ta: பிழைத்திருத்த பயன்முறையை செயல்படுத்தவும் (ஆம் அல்லது இல்லை)

# EDIT_CONFIG_HINT_DEFAULT_LANGUAGE
source: Langue par défaut (fr ou en ou ... auto = langue du navigateur)
ta: இயல்புநிலை மொழி (fr அல்லது en அல்லது ... தானி= நேவிகேட்டர் மொழி)

# EDIT_CONFIG_HINT_CONTACT_FROM
source: Utilisateur indiqué comme émetteur du mail (pour éviter les spams doit être le même que l'utilisateur smtp)
ta: மின்னஞ்சல் வழங்குநராக சுட்டிக்காட்டப்பட்ட பயனர் (ச்பேமைத் தவிர்ப்பது SMTP பயனரைப் போலவே இருக்க வேண்டும்)

# EDIT_CONFIG_HINT_MAIL_CUSTOM_MESSAGE
source: Message personnalisé des mails envoyés depuis l'action contact
ta: தொடர்பு செயலிலிருந்து தனிப்பயனாக்கப்பட்ட மின்னஞ்சல் செய்தி அனுப்பப்பட்டது

# EDIT_CONFIG_HINT_PASSWORD_FOR_EDITING
source: Mot de passe demandé pour modifier les pages (voir doc gestion des spams)
ta: பக்கங்களை மாற்றும்படி கோரப்பட்ட கடவுச்சொல் (ச்பேம் மேனேச்மென்ட் டாக் பார்க்கவும்)

# EDIT_CONFIG_HINT_PASSWORD_FOR_EDITING_MESSAGE
source: Message informatif pour demander le mot de passe (voir doc gestion des spams)
ta: கடவுச்சொல்லைக் கோர செய்தி (ச்பேமின் டாக் மேனேச்மென்ட் பார்க்கவும்)

# EDIT_CONFIG_HINT_ALLOW_DOUBLECLIC
source: Autoriser le doubleclic pour éditer les menus et pages spéciales (true ou false)
ta: மெனுக்கள் மற்றும் சிறப்பு பக்கங்களை (உண்மை அல்லது பொய்) திருத்த டபுள் சொடுக்கு அங்கீகரிக்கவும்

# EDIT_CONFIG_HINT_TIMEZONE
source: Fuseau horaire du site (ex. UTC, Europe/Paris, Europe/London)
ta: தள நேர மண்டலம் (எ.கா. யுடிசி, ஐரோப்பா/பாரிச், ஐரோப்பா/லண்டன்)

# EDIT_CONFIG_HINT_FAVICON
source: Icône du site (emoji ou URL vers une image PNG)
ta: தள படவுரு (ஒரு பி.என்.சி படத்திற்கு ஈமோசி அல்லது யுஆர்எல்)

# EDIT_CONFIG_HINT_ALLOWED_METHODS_IN_IFRAME
source: Méthodes autorisées à être affichées dans les iframes (iframe,editiframe,bazariframe,render,all = autoriser tout)
ta: IFRAMES இல் காட்ட அனுமதிக்கப்பட்ட முறைகள் (IFRAME, Editiframe, Bazaiframe, வழங்குதல், அனைத்தும் = எல்லாவற்றையும் அங்கீகரித்தல்)

# EDIT_CONFIG_HINT_REVISIONSCOUNT
source: Nombre maximum de versions d'une page dans l'historique des modifications
ta: மாற்றங்களின் வரலாற்றில் ஒரு பக்கத்தின் அதிகபட்ச பதிப்புகள்

# EDIT_CONFIG_HINT_DEFAULT_COMMENT_AVATAR
source: Image d'avatar par défaut pour les commentaires (URL vers une image)
ta: கருத்துகளுக்கான இயல்புநிலை அவதார் படம் (ஒரு படத்திற்கு URL)

# EDIT_CONFIG_HINT_HTMLPURIFIERACTIVATED
source: Activer le nettoyage HTML avant sauvegarde. Attention, modifie le contenu à la sauvegarde ! (true ou false)
ta: காப்புப்பிரதிக்கு முன் உஉகுமொ தூய்மை செய்யவும். கவனமாக இருங்கள், உள்ளடக்கத்தை காப்புப்பிரதிக்கு மாற்றவும்! (சரியா தவறா)

# EDIT_CONFIG_HINT_FAVORITES_ACTIVATED
source: Activer les favoris (true ou false)
ta: பிடித்தவைகளை செயல்படுத்தவும் (உண்மை அல்லது பொய்)

# EDIT_CONFIG_HINT_PREVIEW_BEFORE_SAVE
source: Activer la prévisualisation avant sauvegarde (true ou false)
ta: காப்புப்பிரதிக்கு முன் முன்னோட்டத்தை செயல்படுத்தவும் (உண்மை அல்லது பொய்)

# EDIT_CONFIG_GROUP_CORE
source: Paramètres Principaux
ta: முக்கிய அளவுருக்கள்

# EDIT_CONFIG_GROUP_ACCESS
source: Droit d'accès
ta: அணுக இசைவு

# EDIT_CONFIG_GROUP_EMAIL
source: Emails
ta: மின்னஞ்சல்கள்

# USERSTABLE_USER_DELETED
source: L'utilisateur "{username}" a été supprimé.
ta: பயனர் "{username}" நீக்கப்பட்டது.

# USERSTABLE_USER_NOT_DELETED
source: L'utilisateur "{username}" n'a pas été supprimé.
ta: பயனர் "{username}" நீக்கப்படவில்லை.

# USERSTABLE_NOT_EXISTING_USER
source: L'utilisateur "{username}" n'existe pas !
ta: பயனர் "{username}" இல்லை!

# GROUP_S
source: Groupe(s)
ta: குழுக்கள்)

# USERSTABLE_CREATE_USER
source: Créer un utilisateur
ta: ஒரு பயனரை உருவாக்கவும்

# USERSTABLE_CREATE_USER_HINT
source: Mot de passe généré aléatoirement
ta: தோராயமாக உருவாக்கப்பட்ட கடவுச்சொல்

# DELETEPAGE_CANCEL
source: Annuler
ta: ரத்துசெய்

# DELETEPAGE_CONFIRM
source: Voulez-vous vraiment supprimer définitivement la page {tag}&nbsp;?
ta: {tag} & nbsp;? பக்கத்தை நீக்க விரும்புகிறீர்களா?

# DELETEPAGE_CONFIRM_WHEN_BACKLINKS
source: Voulez-vous vraiment supprimer définitivement la page {tag} malgré la présence de liens&nbsp;?
ta: இணைப்புகள் இருந்தபோதிலும் {குறிச்சொல் the பக்கத்தை நீக்க விரும்புகிறீர்களா & nbsp;?

# DELETEPAGE_DELETE
source: Supprimer
ta: அழி

# DELETEPAGE_MESSAGE
source: La page {tag} a définitivement été supprimée
ta: பக்கம் {tag} நிச்சயமாக நீக்கப்பட்டது

# DELETEPAGE_NOT_ORPHEANED
source: Cette page n'est pas orpheline.
ta: இந்த பக்கம் அனாதை அல்ல.

# DELETEPAGE_NOT_OWNER
source: Vous n'êtes pas le propriétaire de cette page.
ta: நீங்கள் இந்த பக்கத்தின் உரிமையாளர் அல்ல.

# DELETEPAGE_PAGES_WITH_LINKS_TO
source: Pages ayant un lien vers {tag} :
ta: {tag}க்கு இணைப்புடன் பக்கங்கள்:

# DELETEPAGE_NOT_DELETED
source: Page non supprimée.
ta: பக்கம் நீக்கப்படவில்லை.

# EDIT_ALERT_ALREADY_SAVED_BY_ANOTHER_USER
source: Cette page a été modifiée par quelqu'un d'autre pendant que vous l'éditiez.\nVeuillez copier vos changements et rééditer cette page.
ta: இந்தப் பக்கத்தை நகலெடுக்கவும், இந்தப் பக்கத்தை மீண்டும் வெளியிடவும்.\n இந்தப் பக்கம் வேறொருவரால் மாற்றியமைக்கப்பட்டது.

# EDIT_NO_WRITE_ACCESS
source: Vous n'avez pas accès en écriture à cette page !
ta: இந்த பக்கத்திற்கு உங்களுக்கு அணுகல் இல்லை!

# EDIT_NO_CHANGE_MSG
source: Cette page n'a pas été enregistrée car elle n'a subi aucune modification.
ta: இந்த பக்கம் பதிவு செய்யப்படவில்லை, ஏனெனில் இது எந்த மாற்றத்திற்கும் உட்படுத்தப்படவில்லை.

# EDIT_PREVIEW
source: Aperçu
ta: முன்னோட்ட

# UPDATE_ADMIN_PAGES
source: Mettre à jour les pages de gestion
ta: மேலாண்மை பக்கங்களைப் புதுப்பிக்கவும்

# UPDATE_ADMIN_PAGES_CONFIRM
source: Confirmer la mise à jour des pages :
ta: பக்கங்களின் புதுப்பிப்பை உறுதிப்படுத்தவும்:

# UPDATE_ADMIN_PAGES_HINT
source: Mets à jour les pages de gestion avec les dernières fonctionnalités. Ceci est réversible.
ta: அண்மைக் கால அம்சங்களுடன் மேலாண்மை பக்கங்களைப் புதுப்பிக்கவும். இது மீளக்கூடியது.

# UPDATE_ADMIN_PAGES_ERROR
source: Il n'a pas été possible de mettre à jour toutes les pages de gestion !
ta: அனைத்து மேலாண்மை பக்கங்களையும் புதுப்பிக்க முடியவில்லை!

# UPDATE_PAGE_NOT_FOUND_IN_DEFAULT_SQL
source: la page "{{page}}" n'a pas été trouvée dans default-content.sql
ta: "{{page}}" பக்கம் இயல்புநிலை- content.sql இல் காணப்படவில்லை

# LINK_TO_REFERRERS_DOMAINS
source: Domaines faisant référence à ce wiki ({beginLink}voir la liste des pages externes{endLink}):
ta: இந்த விக்கியைக் குறிக்கும் களங்கள் ({starglink the வெளிப்புற பக்கங்களின் பட்டியலைக் காண்க {beginLink}):

# LINK_TO_REFERRERS_SITES
source: Sites faisant référence à ce wiki ({beginLink}voir la liste des domaines{endLink}):
ta: இந்த விக்கியைக் குறிக்கும் தளங்கள் ({startlink the களங்களின் பட்டியலைக் காண்க {beginLink}):

# LINK_TO_REFERRERS_SITES_ONLY_TAG
source: Voir les domaines faisant référence à {tag} seulement
ta: {tag} மட்டுமே குறிப்பிடும் பகுதிகளைக் காண்க

# LINK_TO_REFERRERS_SITES_PAGES_ONLY_TAG
source: Voir les références à {tag} seulement
ta: {tag} மட்டுமே குறிப்புகளைக் காண்க

# LINK_TO_REFERRERS_ALL_DOMAINS
source: Voir tous les domaines faisant référence
ta: குறிப்பிடும் அனைத்து பகுதிகளையும் காண்க

# LINK_TO_REFERRERS_ALL_REFS
source: Voir toutes les références
ta: அனைத்து குறிப்புகளையும் காண்க

# LINK_TO_REFERRERS_SITES_NO_GLOBAL
source: Domaines faisant référence à {tag}{since} ({beginLink}voir la liste des pages externes{endLink}):
ta: {tag} {since} ({startLink the வெளிப்புற பக்கங்களின் பட்டியலைக் காண்க {beginLink}):

# LINK_TO_REFERRERS_NO_GLOBAL
source: Pages externes faisant référence à {tag}{since} ({beginLink}voir la liste des domaines{endLink}):
ta: {tag} {since} ({startLink the களங்களின் பட்டியலைக் காண்க {beginLink}):

# REFERRERS_SITES_SINCE
source: depuis {time}
ta: காலத்திலிருந்து}

# REFERRERS_SITES_24_HOURS
source: 24 heures
ta: 24 மணி நேரம்

# REFERRERS_SITES_X_DAYS
source: {nb} jours
ta: {nb} நாட்கள்

# SUCCESS_RESTORE_REVISION
source: La version a bien été restaurée
ta: பதிப்பு மீட்டமைக்கப்பட்டுள்ளது

# TITLE_PAGE_HISTORY
source: Historique de la page
ta: பக்க வரலாறு

# TITLE_ENTRY_HISTORY
source: Historique de la fiche
ta: கோப்பின் வரலாறு

# REVISION_VERSION
source: Version N°
ta: பதிப்பு n °

# REVISION_ON
source: du
ta: of

# REVISION_BY
source: par
ta: இதற்க்கு

# CURRENT_VERSION
source: Version actuelle
ta: நடப்பு வடிவம்

# RESTORE_REVISION
source: Restaurer cette version
ta: இந்த பதிப்பை மீட்டெடுக்கவும்

# DISPLAY_WIKI_CODE
source: Afficher le code Wiki
ta: விக்கி குறியீட்டைக் காட்டு

# COMMENT_INFO
source: Ceci est un commentaire sur {tag} posté par {user} à {time}
ta: இது {tag} வெளியிட்ட {user} முதல் {time}

# EDIT_ARCHIVED_REVISION
source: Rééditer cette version archivée
ta: இந்த காப்பகப்படுத்தப்பட்ட பதிப்பை மீண்டும் வெளியிடுங்கள்

# REVISION_IS_ARCHIVE_OF_TAG_ON_TIME
source: Ceci est une version archivée de {link} à {time}
ta: இது {link} முதல் {நேரம் of இன் காப்பகப்படுத்தப்பட்ட பதிப்பாகும்

# REDIRECTED_FROM
source: Redirigé depuis {linkFrom}
ta: {Linkfrom இருந்து இலிருந்து திருப்பி விடப்பட்டது

# NOT_FOUND_PAGE
source: Cette page n'existe pas encore, voulez-vous la {beginLink}créer{endLink} ?
ta: இந்த பக்கம் இன்னும் இல்லை, நீங்கள் {beginLink} உருவாக்கு {endLink} வேண்டுமா?

# NOT_AUTORIZED_TO_READ_PAGE
source: Vous n'êtes pas autorisé à lire cette page
ta: இந்தப் பக்கத்தைப் படிக்க உங்களுக்கு இசைவு இல்லை

# YW_ADD_COMMENT
source: Ajouter votre commentaire
ta: உங்கள் கருத்தைச் சேர்க்கவும்

# YW_WRITE_COMMENT_HERE
source: Ecrire votre commentaire ici...
ta: உங்கள் கருத்தை இங்கே எழுதுங்கள் ...

# NUMBER_OF_ELEMENTS
source: Nombre d'éléments sélectionnés
ta: தேர்ந்தெடுக்கப்பட்ட கூறுகளின் எண்ணிக்கை

# COMMENT_EMPTY_NOT_SAVED
source: Commentaire vide, pas de sauvegarde.
ta: வெற்று கருத்து, காப்புப்பிரதி இல்லை.

# COMMENT_LOGIN
source: Se connecter pour commenter
ta: கருத்துடன் இணைக்கவும்

# COMMENT_NOT_ENOUGH_RIGHTS
source: Vous n'avez pas les droits suffisants pour commenter.
ta: கருத்து தெரிவிக்க உங்களுக்கு போதுமான உரிமை இல்லை.

# COMMENT_PUBLISHED
source: Commentaire publié !
ta: கருத்து வெளியிடப்பட்டது!

# COMMENT_REMOVED
source: Le commentaire a été supprimé.
ta: கருத்து நீக்கப்பட்டது.

# COMMENT_DELETE
source: Supprimer un commentaire
ta: ஒரு கருத்தை நீக்கு

# COMMENTS_CURRENTLY_CLOSED
source: L'ajout de commentaires sur cette page est présentement désactivé
ta: இந்த பக்கத்தில் கருத்துகளைச் சேர்ப்பது தற்போது முடக்கப்பட்டுள்ளது

# USER_MUST_BE_LOGGED_TO_COMMENT
source: Vous devez vous identifier pour pouvoir publier un commentaire.
ta: ஒரு கருத்தை வெளியிட நீங்கள் உங்களை அடையாளம் காண வேண்டும்.

# USER_NOT_ALLOWED_TO_COMMENT
source: Vous n'êtes pas dans un groupe autorisé à laisser des commentaires.
ta: கருத்துகளைத் தெரிவிக்க நீங்கள் அங்கீகரிக்கப்பட்ட குழுவில் இல்லை.

# NOT_AUTORIZED_TO_REMOVE_COMMENT
source: Vous n'êtes pas autorisé à supprimer ce commentaire.
ta: இந்த கருத்தை நீக்க உங்களுக்கு இசைவு இல்லை.

# COMMENT_TAG
source: Page
ta: பக்கம்

# COMMENT_DATE
source: Date
ta: திகதி

# COMMENT_USER
source: Auteur·ice
ta: நூலாசிரியர்

# COMMENT_CONTENT
source: Commentaire
ta: கருத்து

# COMMENT_ON_PAGE
source: Page parente
ta: பெற்றோர் பக்கம்

# COMMENT_CONFIRM_DELETE
source: Voulez-vous supprimer le commentaire ? (action définitive)
ta: கருத்தை நீக்க விரும்புகிறீர்களா? (இறுதி நடவடிக்கை)

# COMMENT_MODIFIED_BY
source: Modifié par %{user}
ta: %{பயனர் by ஆல் மாற்றப்பட்டது

# COMMENT_NEW_COMMENT
source: Nouveau commentaire sur la page %{tag}
ta: %{tag} பக்கத்தில் புதிய கருத்து

# COMMENT_NEW_COMMENT_ANSWER
source: Nouvelle réponse à votre commentaire sur la page %{tag}
ta: %{tag} பக்கத்தில் உங்கள் கருத்துக்கு புதிய பதில்

# COMMENT_NEW_COMMENT_MESSAGE
source: Un nouveau commentaire a été écrit par %{user} sur la page %{tag} sur le site [%{site}].
ta: தளத்தின் [ %{user}] %{tag} பக்கத்தில் %{site} ஆல் ஒரு புதிய கருத்து எழுதப்பட்டது.

# COMMENT_NEW_COMMENT_ANSWER_MESSAGE
source: Une nouvelle réponse a été écrite par %{user} à votre commentaire sur la page %{tag} sur le site [%{site}].
ta: தளத்தின் [ %{user}] %{tag} பக்கத்தில் உங்கள் கருத்துக்கு %{site} ஆல் ஒரு புதிய பதில் எழுதப்பட்டுள்ளது.

# COMMENT_NEW_COMMENT_TAG
source: Vous avez été cité dans un commentaire sur la page %{tag}
ta: %{tag} பக்கத்தின் கருத்தில் நீங்கள் மேற்கோள் காட்டப்பட்டீர்கள்

# COMMENT_NEW_COMMENT_ANSWER_TAG
source: Vous avez été cité dans une réponse à un commentaire sur la page %{tag}
ta: %{tag} பக்கத்தின் கருத்துக்கு நீங்கள் மேற்கோள் காட்டப்பட்டீர்கள்

# COMMENT_NEW_COMMENT_MESSAGE_TAG
source: Vous avez été cité dans un nouveau commentaire écrit par %{user} sur la page %{tag} sur le site [%{site}].
ta: தளத்தின் [ %{user}] %{tag} பக்கத்தில் %{site} எழுதிய புதிய கருத்தில் நீங்கள் மேற்கோள் காட்டப்பட்டுள்ளீர்கள்.

# COMMENT_NEW_COMMENT_ANSWER_MESSAGE_TAG
source: Vous avez été cité dans une réponse écrite par %{user} à un commentaire de la page %{tag} sur le site [%{site}].
ta: தளத்தின் [ %{user}] %{tag} பக்கத்தின் கருத்துக்கு %{site} ஆல் எழுதப்பட்ட பதிலில் நீங்கள் மேற்கோள் காட்டப்பட்டுள்ளீர்கள்.

# REACTION_EMPTY_ID
source: le paramètre "id" doit obligatoirement être renseigné
ta: "ஐடி" அளவுருவுக்கு தெரிவிக்கப்பட வேண்டும்

# REACTION_LIKE
source: J'approuve
ta: நான் ஒப்புக்கொள்கிறேன்

# REACTION_DISLIKE
source: Je n'approuve pas
ta: நான் ஒப்புதல் அளிக்கவில்லை

# REACTION_ANGRY
source: Faché·e
ta: ஃபாச்சே · மற்றும்

# REACTION_SURPRISED
source: Surpris·e
ta: வியப்பு · மற்றும்

# REACTION_THINKING
source: Dubitatif·ve
ta: DUBITATIVE · ve

# REACTION_LOGIN_TO_REACT
source: Pour réagir, identifiez-vous!
ta: எதிர்வினையாற்ற, உங்களை அடையாளம் காணவும்!

# REACTION_SHARE_YOUR_REACTION
source: Partagez votre réaction à propos de ce contenu
ta: இந்த உள்ளடக்கத்திற்கு உங்கள் எதிர்வினையைப் பகிரவும்

# REACTION_TO_ALLOW_REACTION
source: Pour vous permettre de réagir
ta: நீங்கள் எதிர்வினையாற்ற அனுமதிக்க

# REACTION_PLEASE_LOGIN
source: s'identifier
ta: அடையாளம்

# REACTION_NB_REACTIONS_LEFT
source: choix possible(s)
ta: சாத்தியமான தேர்வு (கள்)

# REACTION_ADMINISTER_REACTIONS
source: Administrer les réactions
ta: எதிர்வினைகளை நிர்வகிக்கவும்

# REACTION_CONNECT_AS_ADMIN
source: Veuillez vous connecter en tant qu'admin pour administrer les réactions.
ta: எதிர்வினைகளை நிர்வகிக்க நிர்வாகியாக இணைக்கவும்.

# REACTION_USER
source: Utilisateur·ice
ta: பயனர்

# REACTION_YOUR_REACTIONS
source: Vos réactions
ta: உங்கள் எதிர்வினைகள்

# REACTION_VOTE
source: Vote
ta: வாக்களிக்கவும்

# REACTION_DATE
source: Date
ta: திகதி

# REACTION_DATE_UNKNOWN
source: Date inconnue
ta: தெரியாத தேதி

# REACTION_DELETE
source: Supprimer
ta: அழி

# REACTION_DELETE_ALL
source: Tout supprimer
ta: அனைத்தையும் நீக்கு

# REACTION_LOGIN_TO_SEE_YOUR_REACTION
source: Se connecter pour voir vos réactions.
ta: உங்கள் எதிர்வினைகளைக் காண இணைக்கவும்.

# REACTION_YOU_VOTED
source: Vous avez voté
ta: நீங்கள் வாக்களித்தீர்கள்

# REACTION_FOR_POLL
source: au sondage
ta: கணக்கெடுப்பில்

# REACTION_FROM_PAGE
source: de la page
ta: பக்கத்தின்

# REACTION_ON_ENTRY
source: Réaction sur une fiche
ta: ஒரு தாளில் எதிர்வினை

# REACTION_TITLE_PARAM_NEEDED
source: Le paramètre 'titre' est obligatoire
ta: 'தலைப்பு' அளவுரு கட்டாயமாகும்

# REACTION_BAD_IMAGE_FORMAT
source: Mauvais format d'image : doit être un fichier, un icône utf8 ou une classe Fontawesome
ta: மோசமான பட வடிவம்: ஒரு கோப்பு, யுடிஎஃப் 8 படவுரு அல்லது ஒரு எழுத்துரு வகுப்பாக இருக்க வேண்டும்

# REACTION_NO_IMAGE
source: Image manquante
ta: படம் இல்லை

# GROUP_NAME_ALREADY_USED
source: le groupe existe déjà
ta: குழு ஏற்கனவே உள்ளது

# USER_NAME_DOES_NOT_EXIST
source: l'utlisateur n'existe pas
ta: பயனர் இல்லை

# GROUP_NAME_DOES_NOT_EXIST
source: le groupe n'existe pas
ta: குழு இல்லை

# INVALID_GROUP_NAME
source: le nom du groupe n'est pas valide
ta: குழுவின் பெயர் தவறானது

# GROUP_SAVED
source: groupe {group} mis à jour avec succès
ta: குழு {group} வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# GROUP_CREATED
source: groupe {group} créé avec succès
ta: குழு {group} வெற்றிகரமாக உருவாக்கப்பட்டது

# GROUP_DELETED
source: groupe {group} supprimé avec succès
ta: குழு {group} வெற்றிகரமாக நீக்கப்பட்டது

# ERROR_WHILE_EDITING_GROUP
source: error durant l'action sur le groupe.
ta: குழுவின் செயலின் போது பிழை.

# TO_ANOTHER_YESWIKI
source: dans un autre YesWiki
ta: மற்றொரு YesWiki இல்

# WIKI_URL_RECENT
source: Nécessite un YesWiki en version >= 4.5.0
ta: நிர்வாகிகள் a YesWics verion >= 4.5.0

# WIKI_URL
source: Url du YesWiki
ta: முகவரி JessWiii அல்ல

# VERIFY_WIKI
source: Vérifier
ta: சரிபார்க்கவும்

# PAGE_TAG_TO_DUPLICATE
source: Nom de la page à dupliquer
ta: நகலெடுக்க வேண்டிய பக்கத்தின் பெயர்

# DUPLICATE_AND_OPEN
source: Dupliquer
ta: நகல்

# VERIFY_PAGE_AVAILABILITY
source: Vérifier la disponibilité de la page
ta: பக்கத்தின் இருப்பை சரிபார்க்கவும்

# DISTANT_LOGIN
source: S'identifier sur le YesWiki distant
ta: ரிமோட் யெச்விக்கியில் உள்நுழைக
