Repository: 247i/TACETr
Catalog: உரை/தானி/yeswiki-yeswiki-extension-attach-*.po
Languages: ta

# return[]->'ATTACH_GET_CACHE_URLIMAGE_NO_FILE'
source: Fichier image inexistant
ta: பட கோப்பு இல்லை

# return[]->'ATTACH_ACTION_ATTACH'
source: Action {{attach ...}}
ta: செயல் {{attach ...}}

# return[]->'ATTACH_PARAM_DESC_REQUIRED'
source: param&egrave;tre "desc" obligatoire pour une image
ta: ஒரு படத்திற்கான அளவுரு "கட்டாய"

# return[]->'ATTACH_PARAM_HEIGHT_NOT_NUMERIC'
source: le param&egrave;tre "height", en pixels, doit &ecirc;tre uniquement compos&eacute; de chiffres entiers
ta: "உயரம்" என்ற அளவுரு, பிக்சல்களில், இசையமைப்பை மட்டுமே செய்ய வேண்டும் & éacute; முழு புள்ளிவிவரங்களின்

# return[]->'ATTACH_PARAM_WIDTH_NOT_NUMERIC'
source: le param&egrave;tre "width", en pixels, doit &ecirc;tre uniquement compos&eacute; de chiffres entiers
ta: பிக்சல்களில் "அகலம்" அளவுரு, இசையமைப்பை மட்டுமே செய்ய வேண்டும் & eacute; முழு புள்ளிவிவரங்களின்

# return[]->'ATTACH_UPLOAD_FORM_FOR_FILE'
source: Formulaire d'envoi du fichier
ta: கோப்பு அனுப்பும் படிவம்

# return[]->'ATTACH_BACK_TO_PAGE'
source: Retour &agrave; la page
ta: பின் & அக்ரேவ்; பக்கம்

# return[]->'NO_RIGHT_TO_WRITE_IN_THIS_PAGE'
source: Vous n'avez pas l'accès en &eacute;criture &agrave; cette page
ta: உங்களுக்கு விமர்சனத்திற்கான அணுகல் இல்லை & அக்ரேவ்; இந்த பக்கம்

# return[]->'INVALID_REQUEST_METHOD'
source: M&eacute;thode de requ&egrave;te invalide
ta: M & eacute; thode de requel & egrave; te invalide

# return[]->'ERROR_MOVING_TEMPORARY_FILE'
source: Erreur lors du d&eacute;placement du fichier temporaire
ta: தற்காலிக கோப்பை வைத்திருக்கும் போது பிழை

# return[]->'ERROR_UPLOAD_MAX_FILESIZE'
source: Le fichier t&eacute;l&eacute;charg&eacute; exc&ecirc;de la taille de upload_max_filesize, configur&eacute; dans le php.ini.
ta: டி & ஈகூட் கோப்பு கட்டணம் வசூலிக்கப்படுகிறது; பதிவேற்றம்_மாக்ச்_ஃபைல்சின் அளவு, கட்டமைப்பு & eacute; Php.ini இல்.

# return[]->'ERROR_MAX_FILE_SIZE'
source: Le fichier t&eacute;l&eacute;charg&eacute; exc&ecirc;de la taille de MAX_FILE_SIZE, qui a &eacute;t&eacute; sp&eacute;cifi&eacute;e dans le formulaire HTML.
ta: டி & ஈகூட் கோப்பு கட்டணம் வசூலிக்கப்படுகிறது; Max_file_size இன் அளவின் அளவு, இது உள்ளது உஉகுமொ வடிவத்தில் Cifi & eacute.

# return[]->'ERROR_PARTIAL_UPLOAD'
source: Le fichier n'a &eacute;t&eacute; que partiellement t&eacute;l&eacute;charg&eacute;.
ta: கோப்பு இல்லை அது ஓரளவு சார்ச் & eacute ;.

# return[]->'ERROR_NO_FILE_UPLOADED'
source: Aucun fichier n'a &eacute;t&eacute; t&eacute;l&eacute;charg&eacute;.
ta: எந்த கோப்பிலும் & eacute; t & éacute ;.

# return[]->'ERROR_NOT_AUTHORIZED_EXTENSION'
source: Le fichier n'a pas une extension autorisée, voici celles que la configuration autorise :
ta: கோப்பில் அங்கீகரிக்கப்பட்ட நீட்டிப்பு இல்லை, உள்ளமைவு அனுமதிக்கும் அவை இங்கே:

# return[]->'ATTACH_ACTION_FULLIMAGELINK_TEXT'
source: Permettre de cliquer sur l'image pour l'afficher en grand
ta: படத்தை பெரிய அளவில் காண்பிக்க சொடுக்கு செய்ய உங்களை அனுமதிக்கவும்

# return[]->'ATTACH_FILE_MANAGEMENT'
source: Gestion des fichiers
ta: கோப்பு மேலாண்மை

# return[]->'ATTACH_TRASH'
source: Corbeille
ta: கூடை

# return[]->'ATTACH_NO_ATTACHED_FILES'
source: Pas de fichiers attachés à la page {tag} pour l'instant.
ta: இப்போது {குறிச்சொல் the பக்கத்துடன் கோப்புகள் எதுவும் இணைக்கப்படவில்லை.

# return[]->'ATTACH_FILENAME'
source: Nom du fichier
ta: கோப்பு பெயர்

# return[]->'ATTACH_SIZE'
source: Taille
ta: அளவு

# return[]->'ATTACH_DATE_OF_MODIFICATION'
source: Date de modification
ta: தேதி மாற்றியமைத்தல்

# return[]->'ATTACH_RESTORE'
source: Restaurer
ta: மீட்டமை

# return[]->'ATTACH_REAL_FILENAME'
source: Nom réel du fichier : {file}
ta: கோப்பின் உண்மையான பெயர்: {file}

# return[]->'ATTACH_DELETED_ON'
source: - Supprimé le : {date}
ta: - நீக்கப்பட்டது: {date}

# return[]->'ATTACH_EMPTY_TRASH'
source: Vider la corbeille
ta: குப்பையை அகற்றவும்

# return[]->'ATTACH_EMPTY_TRASH_NOTICE'
source: les fichiers effacés à partir de la corbeille le seront définitivement.
ta: கூடையிலிருந்து அழிக்கப்பட்ட கோப்புகள் நிச்சயமாக இருக்கும்.

# return[]->'ATTACH_FILE_MANAGEMENT_TITLE'
source: Gestion des fichiers attachés à la page {tag}
ta: கோப்பு மேலாண்மை பக்கத்துடன் இணைக்கப்பட்டுள்ளது {tag}

# return[]->'ATTACH_FILE_MANAGEMENT_WARNING'
source: Les fichiers effac&eacute;s sur cette page le sont d&eacute;finitivement
ta: இந்த பக்கத்தில் அழிக்கப்பட்ட கோப்புகள் முடிந்தது

# return[]->'ATTACH_PAGE_REVISION'
source: Version de la page
ta: பக்க பதிப்பு

# return[]->'ATTACH_FILE_REVISION'
source: Version du fichier
ta: கோப்பு பதிப்பு

# return[]->'ATTACH_DELETION'
source: Suppression
ta: அடக்குமுறை

# return[]->'ATTACH_NO_RIGHTS_TO_ACCESS_FILEMANAGER'
source: Il faut avoir acc&egrave; en &eacute;criture &agrave; la page pour acc&eacute;der au gestionnaire des fichiers attach&eacute;s
ta: நீங்கள் குற்றம் சாட்டப்பட வேண்டும்; Eacute; இணைப்பின் மேலாளருக்கு துல்லியமான பக்கம் & eacute;

# return[]->'FILEMANAGER_ACTION_NEED_ACCESS'
source: Seul le propriétaire de cette page peut accéder au gestionnaire des fichiers attaché
ta: இந்த பக்கத்தின் உரிமையாளர் மட்டுமே இணைக்கப்பட்ட கோப்பு மேலாளரை அணுக முடியும்

# return[]->'ATTACH_ACTION_BACKGROUNDIMAGE'
source: Action {{backgroundimage ...}}
ta: செயல் {{backgroundimage ...}}

# return[]->'ATTACH_PARAM_FILE_OR_BGCOLOR_NOT_FOUND'
source: il faut indiquer soit une image avec le paramètre "file" ou une couleur de fond avec le paramètre "bgcolor"
ta: நீங்கள் "கோப்பு" அளவுருவைக் கொண்ட ஒரு படத்தை அல்லது "BGColor" அளவுருவுடன் பின்னணி நிறத்தைக் குறிக்க வேண்டும்

# return[]->'ATTACH_ACTION_PLAYER'
source: Action {{player ...}}
ta: செயல் {{player ...}}

# return[]->'ATTACH_DOWNLOAD_THE_FILE'
source: T&eacute;l&eacute;charger le fichier
ta: எல் & eacute கோப்பை ஏற்றவும்

# return[]->'ATTACH_URL_NOT_VALID'
source: l'URL n'est pas valide ou ne peut pas &ecirc;tre ouverte
ta: முகவரி செல்லுபடியாகாது அல்லது திறந்திருக்க முடியாது

# return[]->'ATTACH_PARAM_URL_REQUIRED'
source: param&egrave;tre "url" obligatoire
ta: கட்டாய "முகவரி" அளவுரு

# return[]->'ATTACH_PLAYER_CAN_ONLY_OPEN_FILES_LIKE'
source: le player ne peut que lire les fichiers mp3, flv et mm, et votre URL
ta: பிளேயர் எம்பி 3, எஃப்.எல்.வி மற்றும் எம்.எம் கோப்புகள் மற்றும் உங்கள் முகவரி ஐ மட்டுமே படிக்க முடியும்

# return[]->'ATTACH_NOT_LINKED_TO_GOOD_FILE_EXTENSION'
source: ne pointe pas sur ces types de fichiers
ta: இந்த வகை கோப்புகளை சுட்டிக்காட்ட வேண்டாம்

# return[]->'ATTACH_ACTION_POINTIMAGE'
source: Action {{pointimage ...}}
ta: செயல் {{pointimage ...}}

# return[]->'ATTACH_PARAM_FILE_NOT_FOUND'
source: param&egrave;tre "file" obligatoire
ta: கட்டாய "கோப்பு" அளவுரு

# return[]->'ATTACH_PARAM_FILE_MUST_BE_IMAGE'
source: le param&egrave;tre "file" doit &ecirc;tre une image (svg,gif,jpg,jpeg,png)
ta: அளவுரு "என்பது ஒரு படமாக இருக்க வேண்டும் (எச்.வி.சி, சி.ஐ.எஃப், சே.பி.சி, சே.பி.சி, பி.என்.சி)

# return[]->'ATTACH_DEFAULT_MARKER'
source: Point par d&eacute;faut
ta: புள்ளி டி & eacute;

# return[]->'ATTACH_ADD_MARKER'
source: Ajouter un point
ta: ஒரு புள்ளியைச் சேர்க்கவும்

# return[]->'ATTACH_TITLE'
source: Titre
ta: டைட்ரே

# return[]->'ATTACH_DESCRIPTION'
source: Description
ta: விவரம்

# return[]->'ATTACH_CANCEL'
source: Annuler
ta: ரத்துசெய்

# return[]->'ATTACH_SAVE'
source: Sauver
ta: சேமிக்கவும்

# return[]->'ATTACH_ACTION_VIDEO_PARAM_ERROR'
source: L'action video doit être appelée avec les paramètres « id » et « serveur ». Pour « serveur », seules les valeurs « vimeo » ou « youtube » ou « peertube » sont acceptées.
ta: வீடியோ செயலை "ஐடி" மற்றும் "சேவையகம்" அளவுருக்கள் மூலம் அழைக்க வேண்டும். "சேவையகம்" க்கு, "விமியோ" அல்லது "யூடியூப்" அல்லது "பீர்டியூப்" மதிப்புகள் மட்டுமே ஏற்றுக்கொள்ளப்படுகின்றன.

# return[]->'ATTACH_ACTION_PDF_PARAM_URL_ERROR'
source: L'action pdf doit être appelée avec le paramètre « url » et l'url renseignée doit provenir de la même origine que le wiki : c'est à dire du même sous-domaine du serveur (par exemple 'xxx.yyy.com'), du même schéma (par exemple 'https') et du même port s'il est spécifié (par exemple '8080').
ta: PDF நடவடிக்கை "முகவரி" அளவுருவுடன் அழைக்கப்பட வேண்டும், மேலும் தகவலறிந்த முகவரி விக்கியின் அதே தோற்றத்திலிருந்து வர வேண்டும்: அதாவது சேவையகத்தின் அதே துணை டொமைனைப் பற்றி சொல்ல வேண்டும் (எடுத்துக்காட்டாக 'xxx.yyy.com') , அதே வரைபடத்திலிருந்து (எடுத்துக்காட்டாக 'https') மற்றும் அதே துறைமுகம் குறிப்பிடப்பட்டால் (எடுத்துக்காட்டாக '8080').

# return[]->'ATTACH_ACTION_DISPLAY_PDF_TEXT'
source: Afficher le pdf dans la page :
ta: பக்கத்தில் PDF ஐக் காட்டுங்கள்:

# return[]->'ATTACH_ACTION_DISPLAY_PDF_LINK_TEXT'
source: sous forme de lien
ta: ஒரு இணைப்பின் வடிவத்தில்

# return[]->'ATTACH_ACTION_DISPLAY_PDF_INCLUDED_TEXT'
source: directement inclus dans la page
ta: பக்கத்தில் நேரடியாக சேர்க்கப்பட்டுள்ளது

# return[]->'ACTIVATE_JS_TO_UPLOAD_FILES'
source: Activer JavaScript pour joindre des fichiers
ta: கோப்புகளை இணைக்க சாவாச்கிரிப்டை செயல்படுத்தவும்

# return[]->'UPLOAD_A_FILE'
source: Joindre / Ins&eacute;rer un fichier
ta: சேர / அதற்கு பதிலாக ஒரு கோப்பு

# return[]->'UPLOAD_A_FILE_SHORT'
source: Fichier
ta: கோப்பு

# return[]->'UPLOAD_FILE'
source: T&eacute;l&eacute;charger le fichier
ta: எல் & eacute கோப்பை ஏற்றவும்

# return[]->'CANCEL_THIS_UPLOAD'
source: Annuler cet envoi
ta: இந்த கப்பலை ரத்துசெய்

# return[]->'INSERT'
source: Ins&eacute;rer
ta: சொரு & eacute; rer

# return[]->'DOWNLOAD_LINK_TEXT'
source: Texte du lien de t&eacute;l&eacute;chargement
ta: ஏற்றுதல் இணைப்பின் உரை

# return[]->'IMAGE_ALIGN'
source: Alignement de l'image
ta: பட சீரமைப்பு

# return[]->'IMAGE_SIZE'
source: Taille de l'image
ta: பட அளவு

# return[]->'THUMBNAIL'
source: Miniature
ta: மினியேச்சர்

# return[]->'MEDIUM'
source: Moyenne
ta: சராசரி

# return[]->'BIG'
source: Large
ta: பெரிய

# return[]->'ORIGINAL_SIZE'
source: Taille originale
ta: அசல் அளவு

# return[]->'CAPTION'
source: Texte affiché au survol
ta: உரை ஓவர்ஃப்ளைட்டில் காட்டப்படும்

# return[]->'SEE_THE_ADVANCED_PARAMETERS'
source: Voir les param&egrave;tres avanc&eacute;s
ta: அளவுருக்கள் மிகவும் முன்னேறியதைக் காண்க

# return[]->'ADVANCED_PARAMETERS'
source: Param&egrave;tres avanc&eacute;s
ta: நிறுத்தங்கள்

# return[]->'ASSOCIATED_LINK'
source: Lien web associé au clic
ta: சொடுக்கு உடன் தொடர்புடைய வலை இணைப்பு

# return[]->'GRAPHICAL_EFFECTS'
source: Effets graphiques
ta: கிராஃபிக் விளைவுகள்

# return[]->'WHITE_BORDER'
source: Bord blanc
ta: வெள்ளை விளிம்பு

# return[]->'DROP_SHADOW'
source: Ombre port&eacute;e
ta: துறைமுகம் & eacute நிழல்கள்;

# return[]->'ZOOM_HOVER'
source: Agrandissement au survol
ta: விமான விரிவாக்கம்

# return[]->'ALT_INFOS'
source: Ce texte sera affich&eacute; &agrave; la place de l'image si elle est introuvable sur le serveur
ta: இந்த உரை காண்பிக்கப்படும் & eacute; & அக்ரேவ்; படத்தின் இடம் சேவையகத்தில் காணப்படாவிட்டால்

# return[]->'ALTERNATIVE_TEXT'
source: Texte de remplacement
ta: மாற்று உரை

# return[]->'NONE'
source: Texte en dessous
ta: கீழே உரை

# return[]->'LEFT'
source: Gauche
ta: க uch ச்சே

# return[]->'CENTER'
source: Centre
ta: நடுவண்

# return[]->'RIGHT'
source: Droite
ta: சரி

# return[]->'FAILED'
source: &Eacute;chou&eacute;
ta: & Eacute;

# return[]->'ATTACH_HANDLER_AJAXUPLOAD_FOLDER_NOT_READABLE'
source: Le dossier de téléchargement n'est pas accessible en écriture.
ta: பதிவிறக்க கோப்புறை எழுத்துப்பூர்வமாக அணுக முடியாது.

# return[]->'ATTACH_HANDLER_AJAXUPLOAD_NO_FILE'
source: Pas de fichiers envoyés.
ta: கோப்புகள் அனுப்பப்படவில்லை.

# return[]->'ATTACH_HANDLER_AJAXUPLOAD_EMPTY_FILE'
source: Le fichier est vide.
ta: கோப்பு காலியாக உள்ளது.

# return[]->'ATTACH_HANDLER_AJAXUPLOAD_FILE_TOO_LARGE'
source: Le fichier est trop large.
ta: கோப்பு மிகவும் அகலமானது.

# return[]->'ATTACH_HANDLER_AJAXUPLOAD_AUTHORIZED_EXT'
source: Le fichier n'a pas une extension autorisée, voici les autorisées : {ext}.
ta: கோப்பில் அங்கீகரிக்கப்பட்ட நீட்டிப்பு இல்லை, இங்கே அங்கீகரிக்கப்பட்டவை: {ext}.

# return[]->'ATTACH_HANDLER_AJAXUPLOAD_ERROR'
source: Impossible de sauver le fichier. L'upload a été annulé ou le serveur a planté...
ta: கோப்பை சேமிக்க முடியவில்லை. பதிவேற்றம் ரத்து செய்யப்பட்டது அல்லது சேவையகம் நடப்பட்டது ...

# return[]->'EDIT_CONFIG_HINT_ATTACH-VIDEO-CONFIG[DEFAULT_VIDEO_SERVICE]'
source: Service de vidéo par défaut (peertube, youtube ou vimeo)
ta: இயல்புநிலை வீடியோ பணி (PEERTUBE, YouTube அல்லது VIMEO)

# return[]->'EDIT_CONFIG_HINT_ATTACH-VIDEO-CONFIG[DEFAULT_PEERTUBE_INSTANCE]'
source: Adresse du serveur peertube par défaut
ta: இயல்புநிலை PEERTUBE சேவையகத்தின் முகவரி

# return[]->'EDIT_CONFIG_HINT_MAX_FILE_SIZE'
source: Taille maximum des fichiers téléversés - octets (ex: Taille maximum des fichiers téléversés (ex: 2097152, 2048k, 2m)
ta: சேகரிக்கப்பட்ட கோப்புகளின் அதிகபட்ச அளவு - பைட்டுகள் (எ.கா. சேகரிக்கப்பட்ட கோப்புகளின் அதிகபட்ச அளவு (எ.கா: 2097152, 2048 கே, 2 மீ)

# return[]->'EDIT_CONFIG_GROUP_ATTACH'
source: Insertion de médias (images, vidéos)
ta: மீடியா செருகல் (படங்கள், வீடியோக்கள்)
