Repository: 247i/TACETr
Catalog: உரை/தானி/yeswiki-yeswiki-extension-tag-*.po
Languages: ta

# return[]->'TAGS_TAGS'
source: Mots clés
ta: மோட்ச் க்ளெச்

# return[]->'TAGS_ACTION_ADMINTAGS'
source: Action {{admintags ...}}
ta: செயல் {{admintags ...}}

# return[]->'TAGS_ACTION_ADMINTAGS_ONLY_FOR_ADMINS'
source: l'action est r&eacute;serv&eacute;e au groupe des administrateurs
ta: l'action est r & eacute; serv & eacute; இ அயு groupe des நிர்வாகம்

# return[]->'TAGS_NO_WRITE_ACCESS'
source: Vous n'avez pas acc&egrave;s en &eacute;criture &agrave; cette page !
ta: Vous n'avez pas acc & egrave; s என் & eacute; க்ரூடி & அக்ரேவ்; செட் பக்கம்!

# return[]->'TAGS_FROM_THIS_PAGE'
source: de cette page
ta: டி செட் பக்கம்

# return[]->'TAGS_FROM_ALL_PAGES'
source: de toutes les pages
ta: டி டூட்ச் லெச் பக்கங்கள்

# return[]->'TAGS_PRESENT_IN'
source: pr&eacute;sent dans
ta: pr & eacute; அனுப்பிய டான்ச்

# return[]->'TAGS_MODIFY'
source: Modifier
ta: மாற்றியமைப்பாளர்

# return[]->'TAGS_ADD_TAGS'
source: Ajouter mots cl&eacute;s en utilisant la touche entrée
ta: அசூட்டர் மோட்ச் cl & eacute; கள் பயன்படுத்தப்பட்ட லா டச் என்ட்ரே

# return[]->'TAGS_COMMENTS_ACTIVATED'
source: Les commentaires de cette page ont &eacute;t&eacute; activ&eacute;s.
ta: லெச் வர்ணனீச் டி செட் பேச் ஒன்ட் & ஈகூட்; டி & ஈகூட்; செயல்பாடு & eacute; கள்.

# return[]->'TAGS_ACTIVATE_COMMENTS'
source: Activer les commentaires
ta: ஆக்டிவர் லெச் கருத்துரை

# return[]->'TAGS_ACTIVATE_COMMENTS_ON_THIS_PAGE'
source: Activer les commentaires sur cette page
ta: ஆக்டிவர் லெச் கருத்துரு சர் செட் பக்கம்

# return[]->'TAGS_DESACTIVATE_COMMENTS'
source: D&eacute;sactiver les commentaires
ta: டி & eacute; sactiver les commpressaires

# return[]->'TAGS_DESACTIVATE_COMMENTS_ON_THIS_PAGE'
source: D&eacute;sactiver les commentaires sur cette page
ta: டி & eacute; sactiver les compraceaires சுர் cete page

# return[]->'TAGS_COMMENTS_ON_THIS_PAGE'
source: Commentaires sur cette page.
ta: வர்ணனைகள் சுர் செட் பக்கம்.

# return[]->'TAGS_COMMENTS_DESACTIVATED'
source: Commentaires d&eacute;sactiv&eacute;s.
ta: வர்ணனைகள் டி & eacute; sactiv & eacute; கள்.

# return[]->'TAGS_SEE_ALL_PAGES_WITH_THIS_TAGS'
source: Voir toutes les pages contenant ce mot cl&eacute;
ta: Voir tootes les பக்கங்கள் contenant ce mot cl & eacute;

# return[]->'TAGS_ALERT_PAGE_ALREADY_MODIFIED'
source: ALERTE : Cette page a &eacute;t&eacute; modifi&eacute;e par quelqu'un d'autre pendant que vous l'&eacute;ditiez.<br />Veuillez copier vos changements et r&eacute;&eacute;diter cette page.
ta: Aleerte: cete page a & eacute; t & eacute; மோடிஃபி & ஈகூட்;

# return[]->'TAGS_ANSWER_THIS_COMMENT'
source: R&eacute;pondre &agrave; ce commentaire
ta: ஆர் & ஈகூட்; பாண்ட்ரே & அக்ரேவ்; ce வர்ணனை

# return[]->'TAGS_DATE_FORMAT'
source: le d.m.Y &ag\rave; H:i:s
ta: லே என் & அக்ரேவ்; எச்: நான்: எச்

# return[]->'TAGS_WRITE_YOUR_COMMENT_HERE'
source: Ecrire votre commentaire ici...
ta: எக்ரைர் வோட்ரே வர்ணனை ஐசிஐ ...

# return[]->'TAGS_ADD_YOUR_COMMENT'
source: Ajouter votre commentaire
ta: அசூட்டர் வோட்ரே வர்ணனை

# return[]->'TAGS_ACTION_FILTERTAGS'
source: Action {{filtertags ...}}
ta: செயல் {{filterTags ...}}

# return[]->'TAGS_NO_FILTERS'
source: pas de param&egrave;tre "filter1" trouv&eacute;, alors qu'il est obligatoire.
ta: பாச் டி பரம் & எக்ரேவ்; ட்ரே "வடிகட்டி 1" ட்ரூவ் & ஈகூட்;

# return[]->'TAGS_ONLY_ONE_DOUBLEPOINT'
source: il ne peut y avoir qu'une fois le double point (:) pour indiquer le label, plusieurs trouv&eacute;s.
ta: il ne peut ஒய் avoir qu'une fois le இரட்டை புள்ளி (:) இண்டிகர் லே லேபிளை ஊற்றவும், பிளச்யூர்ச் ட்ரூவ் & eacute; கள்.

# return[]->'TAGS_ACTION_INCLUDEPAGES'
source: Action {{includepages ...}}
ta: செயல் {{inclowAges ...}}

# return[]->'TAGS_NO_PARAM_PAGES'
source: pas de param&egrave;tre "pages" trouv&eacute;, alors qu'il est obligatoire.
ta: பாச் டி பரம் & எக்ரேவ்; ட்ரே "பக்கங்கள்" ட்ரூவ் & ஈகூட்;

# return[]->'TAGS_NO_RESULTS'
source: Pas de r&eacute;sultats avec ces mots cl&eacute;s.
ta: பாச் டி ஆர் & ஈகூட்; சுல்டாட்ச் அவெக் செச் மோட்ச் சி.எல் & ஈகூட்; கள்.

# return[]->'TAGS_RESULTS'
source: r&eacute;sultats
ta: ஆர் & ஈகூட்; சுல்தாட்கள்

# return[]->'TAGS_FILTER'
source: Filtrer
ta: வடிகட்டி

# return[]->'TAGS_CONTAINING_TAG'
source: avec le mot cl&eacute;
ta: அவெக் லே மோட் சி.எல் & ஈகூட்;

# return[]->'TAGS_ONE_PAGE'
source: Une page
ta: Une பக்கம்

# return[]->'TAGS_PAGES'
source: pages
ta: பக்கங்கள்

# return[]->'TAGS_NO_TAG'
source: Aucun mot clé utilisé pour le moment
ta: Aucun mot clé utilise bour le தருணம்

# return[]->'TAGS_TOTAL_NB_PAGES'
source: Un total de %{nb_total} pages a &eacute;t&eacute; trouv&eacute;
ta: Un மொத்த de %{nb_total} பக்கங்கள் a & eacute; t & eacute; tropev & eacute;

# return[]->'TAGS_ONE_PAGE_FOUND'
source: Une page a &eacute;t&eacute; trouv&eacute;e
ta: Une பக்கம் A & eacute; t & eacute; ட்ரூவ் & ஈகூட்; இ

# return[]->'TAGS_NO_PAGE'
source: Aucune page trouv&eacute;e
ta: Aucune Page trouv & eacute; இ

# return[]->'TAGS_WITH_KEYWORD'
source: avec le mot cl&eacute;
ta: அவெக் லே மோட் சி.எல் & ஈகூட்;

# return[]->'TAGS_RSS_FEED_FOR_NEW_PAGES_WITH_TAGS'
source: Flux RSS des nouvelles pages avec les tags
ta: ஃப்ளக்ச் ஆர்எச்எச் டெச் நோவல்ச் பக்கங்கள் அவெக் லெச் குறிச்சொற்கள்

# return[]->'TAGS_YOUR_EBOOK'
source: Votre Ebook
ta: வோர்ட்ரே மின்புத்தகம்

# return[]->'TAGS_SPAM_RISK'
source: Il faut activer javascript pour ne pas &ecirc;tre consid&eacute;r&eacute; comme du spam.
ta: Il faut Activer சாவாகைஉரை pour ne pas & ecirc; tre consid & eacute; r & eacute; COMME DU SPAM.

# return[]->'TAGS_GENERATE_EBOOK'
source: G&eacute;n&eacute;rer l'Ebook
ta: G & eacute; n & eacute; rer l'மின்புத்தகம்

# return[]->'TAGS_EXPORT_PAGES_INFO'
source: S&eacute;lectionnez vos pages pour l'Ebook en cliquant sur
ta: S & eacute; lecternez vos பக்கங்கள் pour l'ebook என் cliquant சுர்

# return[]->'TAGS_ORDER_PAGES_INFO'
source: D&eacute;placez les pages pour les mettre dans l'ordre qui vous convient.
ta: டி & eacute; பிளேச் லெச் பக்கங்கள் லெச் மெட்ரே டான்ச் எல்'ஆர்ட்ரே குய் வவுச் கன்வீயன்.

# return[]->'TAGS_EBOOK_TITLE'
source: Titre de l'ouvrage
ta: டைட்ரே டி எல் ஓவ்ரேச்

# return[]->'TAGS_EBOOK_DESC'
source: Description
ta: விவரம்

# return[]->'TAGS_EBOOK_AUTHOR'
source: Pr&eacute;nom puis nom de l'auteur
ta: Pr & eacute; nom puis nom de l'ature

# return[]->'TAGS_EXAMPLE_AUTHOR'
source: Ex: Victor Hugo
ta: எ.கா: விக்டர் அ்யூகோ

# return[]->'TAGS_EBOOK_BIBLIO_AUTHOR'
source: Nom de l'auteur, virgule pr&eacute;nom
ta: Nom de l'auture, கன்னி pr & eacute; nom

# return[]->'TAGS_EXAMPLE_BIBLIO_AUTHOR'
source: Ex: Hugo, Victor
ta: எ.கா: அ்யூகோ, விக்டர்

# return[]->'TAGS_EBOOK_COVER_IMAGE'
source: Lien vers l'image de couverture de l'ouvrage
ta: Lien vers l'image de couverture de l'ovrage

# return[]->'TAGS_NO_TITLE_FOUND'
source: ERREUR : Le titre n'a pas &eacute;t&eacute; renseign&eacute;.
ta: எர்ரூர்: லு டைட்ரே என்ஏ பாச் & eacute; t & eacute; renensign & eacute ;.

# return[]->'TAGS_NO_DESC_FOUND'
source: ERREUR : La description n'a pas &eacute;t&eacute; renseign&eacute;.
ta: Erreur: la விளக்கம் n'a pas & eacute; t & eacute; renensign & eacute ;.

# return[]->'TAGS_NO_AUTHOR_FOUND'
source: ERREUR : L'auteur n'a pas &eacute;t&eacute; renseign&eacute;.
ta: Erreure: l'auture n'a pas & eacute; t & eacute; renensign & eacute ;.

# return[]->'TAGS_NO_BIBLIO_AUTHOR_FOUND'
source: ERREUR : L'auteur (version biblio) n'a pas &eacute;t&eacute; renseign&eacute;.
ta: Erreure: l'ature (பதிப்பு பிப்லியோ) n'a pas & eacute; t & eacute; renensign & eacute ;.

# return[]->'TAGS_NO_IMAGE_FOUND'
source: ERREUR : Le lien vers l'image de couverture n'a pas &eacute;t&eacute; renseign&eacute;.
ta: எர்ரூர்: லு லீன் வெர்சச் எல்'ச் இமேச் டி கூர்வெர்ட்ரே என்'ஏ பாச் & eacute; t & eacute; renensign & eacute ;.

# return[]->'TAGS_NOT_IMAGE_FILE'
source: ERREUR : Le lien vers l'image de couverture n'est pas une image avec l'extension .jpg.
ta: எர்ரூர்: லு லீன் வெர்சச் எல்'அம்பேம் டி கூர்வெர்ட்ரே என் ஈச்ட் பாச் யூன் இமேச் அவெக் எல் நீட்டிப்பு .jpg.

# return[]->'TAGS_EBOOK_PAGE_CREATED'
source: La page de l'Ebook a &eacute;t&eacute; cr&eacute;&eacute;e avec succ&egrave;s
ta: La page de l'ebook a & eacute; t & eacute; சிஆர் & eacute; & eacute; இ avec succ & egrave; கள்

# return[]->'TAGS_GOTO_EBOOK_PAGE'
source: Aller voir la page :
ta: அல்லர் Voir LA பக்கம்:

# return[]->'TAGS_FILTER_PAGES'
source: Filtrer les pages
ta: குறைந்த பக்கங்களை வடிகட்டவும்

# return[]->'TAGS_SEE_PAGE'
source: Voir la page
ta: Voir LA பக்கம்

# return[]->'TAGS_SELECT_PAGE'
source: S&eacute;lectionner la page
ta: S & eacute; லீக்சன்னர் லா பக்கம்

# return[]->'TAGS_DELETE_PAGE'
source: Enlever la page
ta: என்லீவர் லா பக்கம்

# return[]->'TAGS_FOR_THE_EBOOK'
source: pour l&apos;Ebook
ta: எல் & அப்போச்; மின்புத்தகம் ஊற்றவும்

# return[]->'TAGS_FROM_THE_EBOOK'
source: de l&apos;Ebook
ta: டி எல் & அப்போச்; மின்புத்தகம்

# return[]->'TAGS_AVAILABLE_PAGES'
source: Pages disponibles
ta: பக்கங்கள் அகற்றும்

# return[]->'TAGS_START_PAGE'
source: Page d'introduction
ta: பக்கம் டி அறிமுகம்

# return[]->'TAGS_END_PAGE'
source: Page de fin
ta: பேச் டி ஃபின்

# return[]->'TAGS_PUBLISHED_UNDER_CREATIVE_COMMONS_BY_SA'
source: Cet ouvrage est publi&eacute; sous licence Creative Commons BY SA.
ta: Cet ouvrage est publi & eacute; எச்.ஏ.

# return[]->'TAGS_ABOUT_THIS_EBOOK'
source: Information sur cet ouvrage
ta: செய்தி சுர் cet ouvrage

# return[]->'TAGS_CONTENT_VISIBLE_ONLINE_FROM_PAGE'
source: Contenu en ligne sur la page
ta: கான்டெனு என் லிக்னே சுர் லா பக்கம்

# return[]->'TAGS_NO_EBOOK_METADATAS'
source: Cette page ne poss&egrave;de pas les m&eacute;tadonn&eacute;es n&eacute;cessaires pour cr&eacute;er l'ebook.
ta: Cete page ne poss & egrave; de ​​pas les m & eacute; tadonn & eacute; es n & eacute; செசேர்கள் பவர் சிஆர் & eacute; er l'ebook.

# return[]->'TAGS_NO_EBOOK_FOUND'
source: Pas d'ebook trouv&eacute;.
ta: பாச் டி'புக் ட்ரூவ் & ஈகூட் ;.

# return[]->'TAGS_HIDDEN_CONTENT'
source: Contenu masqué
ta: கான்டெனு மாச்குவே

# return[]->'AB_tags_group_label'
source: Gestion des tags
ta: கெச்டியன் டெச் குறிச்சொற்கள்

# return[]->'AB_tags_admintag_label'
source: Gestion des tags
ta: கெச்டியன் டெச் குறிச்சொற்கள்

# return[]->'AB_tags_listpagestag_label'
source: Liste des pages par tag
ta: பட்டியல் டெச் பக்கங்கள் பார் குறிச்சொல்

# return[]->'AB_tags_listpagestag_type_label'
source: Type
ta: வகை

# return[]->'AB_tags_listpagestag_type_all'
source: toutes les pages et les fiches du wiki
ta: டூட்ச் லெச் பக்கங்கள் மற்றும் லெச் ஃபிடச் டு விக்கி

# return[]->'AB_tags_listpagestag_type_wiki'
source: uniquement les pages du wiki
ta: தனித்துவமான லெச் பக்கங்கள் டு விக்கி

# return[]->'AB_tags_listpagestag_type_bazar'
source: uniquement les fiches des formulaires
ta: தனித்துவமான லெச் ஃபிடச் டெச் ஃபார்முலேர்ச்

# return[]->'AB_tags_listpagestag_tags_label'
source: Tags
ta: குறிச்சொற்கள்

# return[]->'AB_tags_listpagestag_tags_hint'
source: séparés par des virgules
ta: sépares par des கன்னங்கள்

# return[]->'AB_tags_listpagestag_nb_label'
source: Nombre de pages
ta: நோம்ப்ரே டி பக்கங்கள்

# return[]->'AB_tags_listpagestag_tri_label'
source: Tri
ta: ட்ரை

# return[]->'AB_tags_listpagestag_tri_date'
source: tri par date décroissante
ta: ட்ரை சம தேதி décroissante

# return[]->'AB_tags_listpagestag_tri_alpha'
source: tri par ordre alphabétique
ta: ட்ரை பார் ஆர்ட்ரே ஆல்பாபெடிக்

# return[]->'AB_tags_listpagestag_template_label'
source: template
ta: வார்ப்புரு

# return[]->'AB_tags_listpagestag_template_list'
source: liste
ta: பட்டியல்

# return[]->'AB_tags_listpagestag_template_list_panel'
source: liste avec encadré
ta: பட்டியல் அவெக் என்காட்ரே

# return[]->'AB_tags_listpagestag_template_list_num'
source: liste avec puces
ta: பட்டியல் அவெக் பியூச்

# return[]->'AB_tags_listpagestag_shownumberinfo_label'
source: afficher le nombre de pages
ta: afficher le nombre de பக்கங்கள்

# return[]->'AB_tags_listpagestag_nuagetag_label'
source: nuage de tags
ta: nuage டி குறிச்சொற்கள்

# return[]->'AB_tags_listpagestag_rss_label'
source: lien rss vers la liste pour des tags donnés
ta: lien rss vers vers la liste bour des குறிச்சொற்கள் donnes

# return[]->'AB_tags_listpagestag_nbclasses_label'
source: nombre de classes CSS disponibles pour le nuage
ta: நோம்ப்ரே டி வகுப்புகள் சிஎச்எச் டிச்போனிபில்கள் லு நியூசை ஊற்றுகின்றன

# return[]->'AB_tags_nuagetag_tri_shuffle'
source: aléatoire
ta: அலாடோயர்

# return[]->'EDIT_CONFIG_HINT_HIDE_KEYWORDS'
source: Cacher les mots-clés en bas des pages (true ou false)
ta: கேச்சர் லெச் மோட்ச்-கிளெச் என் பாச் டெச் பக்கங்கள் (உண்மையான தவறான)

# return[]->'EDIT_CONFIG_GROUP_TAGS'
source: Mots-clés (tags)
ta: MOTS-CLES (குறிச்சொற்கள்)
