Repository: 247i/TACETr
Catalog: உரை/தானி/zulip-desktop-*.po
Languages: ta

source: A new update {{{version}}} has been downloaded.
ta: ஒரு புதிய புதுப்பிப்பு {{{version}}} பதிவிறக்கம் செய்யப்பட்டுள்ளது.

source: A new version {{{version}}} of Zulip Desktop is available.
ta: சூலிப் டெச்க்டாப்பின் புதிய பதிப்பு {{{version}}} கிடைக்கிறது.

source: About
ta: பற்றி

source: About Zulip
ta: ஜூலிப் பற்றி

source: Actual Size
ta: உண்மையான அளவு

source: Add Organization
ta: அமைப்பைச் சேர்

source: Add a Zulip organization
ta: ஒரு ஜூலிப் அமைப்பைச் சேர்க்கவும்

source: Add custom CSS
ta: தனிப்பயன் CSS ஐச் சேர்க்கவும்

source: Add to Dictionary
ta: அகராதியில் சேர்க்கவும்

source: Advanced
ta: மேம்பட்ட

source: All the connected organizations will appear here.
ta: இணைக்கப்பட்ட அனைத்து நிறுவனங்களும் இங்கே தோன்றும்.

source: Always start minimized
ta: எப்போதும் குறைக்கத் தொடங்குங்கள்

source: App Updates
ta: பயன்பாட்டு புதுப்பிப்புகள்

source: App language (requires restart)
ta: பயன்பாட்டு மொழி (மறுதொடக்கம் தேவை)

source: Appearance
ta: தோற்றம்

source: Application Shortcuts
ta: பயன்பாட்டு குறுக்குவழிகள்

source: Are you sure you want to disconnect this organization?
ta: இந்த அமைப்பைத் துண்டிக்க விரும்புகிறீர்களா?

source: Are you sure?
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா?

source: Ask where to save files before downloading
ta: பதிவிறக்குவதற்கு முன் கோப்புகளை எங்கு சேமிப்பது என்று கேளுங்கள்

source: Auto hide Menu bar
ta: தானாக மறை பட்டியல் பட்டி

source: Auto hide menu bar (Press Alt key to display)
ta: தானாக மறை மெனு பட்டியை (காண்பிக்க Alt விசையை அழுத்தவும்)

source: Available under the {{{link}}}Apache 2.0 License{{{endLink}}}
ta: {{{link}}} அப்பாச்சி 2.0 உரிமம் {{{endLink}}} கீழ் கிடைக்கிறது

source: Back
ta: மீண்டும்

source: Bounce dock on new private message
ta: புதிய தனிப்பட்ட செய்தியில் கப்பல்துறை பவுன்ஸ்

source: CSS file
ta: சிஎச்எச் கோப்பு

source: Cancel
ta: இரத்து

source: Certificate error
ta: சான்றிதழ் பிழை

source: Change
ta: மாற்றம்

source: Change the language from System Preferences → Keyboard → Text → Spelling.
ta: கணினி விருப்பங்களிலிருந்து மொழியை மாற்றவும் → விசைப்பலகை → உரை → எழுத்துப்பிழை.

source: Check for Updates
ta: புதுப்பிப்புகளைச் சரிபார்க்கவும்

source: Close
ta: நெருக்கமான

source: Connect
ta: இணைக்கவும்

source: Connect to another organization
ta: வேறொரு நிறுவனத்துடன் இணைக்கவும்

source: Connected organizations
ta: இணைக்கப்பட்ட நிறுவனங்கள்

source: Copy
ta: நகல்

source: Copy Email Address
ta: மின்னஞ்சல் முகவரியை நகலெடுக்கவும்

source: Copy Image
ta: படத்தை நகலெடுக்கவும்

source: Copy Image URL
ta: பட முகவரி ஐ நகலெடுக்கவும்

source: Copy Link
ta: இணைப்பை நகலெடுக்கவும்

source: Copy Zulip URL
ta: ஜூலிப் URL ஐ நகலெடுக்கவும்

source: Create a new organization
ta: புதிய அமைப்பை உருவாக்கவும்

source: Custom CSS file deleted
ta: தனிப்பயன் சிஎச்எச் கோப்பு நீக்கப்பட்டது

source: Cut
ta: வெட்டு

source: Default download location
ta: இயல்புநிலை பதிவிறக்க இடம்

source: Delete
ta: அழி

source: Desktop Notifications
ta: டெஸ்க்டாப் அறிவிப்புகள்

source: Desktop Settings
ta: டெஸ்க்டாப் அமைப்புகள்

source: Disconnect
ta: துண்டி

source: Disconnect organization
ta: அமைப்பு துண்டிக்கவும்

source: Do Not Disturb
ta: தொந்தரவு செய்ய வேண்டாம்

source: Download App Logs
ta: பயன்பாட்டு பதிவுகள் பதிவிறக்கவும்

source: Edit
ta: தொகு

source: Edit Shortcuts
ta: குறுக்குவழிகளைத் திருத்து

source: Enable auto updates
ta: தானியங்கு புதுப்பிப்புகளை இயக்கு

source: Enable error reporting (requires restart)
ta: பிழை அறிக்கையை இயக்கு (மறுதொடக்கம் தேவை)

source: Enable spellchecker (requires restart)
ta: எழுத்துப்பிழை சரிபார்ப்பை இயக்கு (மறுதொடக்கம் தேவை)

source: Error saving new organization
ta: புதிய அமைப்பைச் சேமிப்பதில் பிழை

source: Error saving update notifications
ta: புதுப்பிப்பு அறிவிப்புகளைச் சேமிப்பது பிழை

source: Error: {{{error}}} The latest version of Zulip Desktop is available at: {{{link}}} Current version: {{{version}}}
ta: பிழை: {{{error}}} சூலிப் டெச்க்டாப்பின் அண்மைக் கால பதிப்பு இங்கு கிடைக்கிறது: {{{link}}} தற்போதைய பதிப்பு: {{{version}}}}

source: Factory Reset
ta: தொழிற்சாலை மீட்டமைப்பு

source: Factory Reset Data
ta: தொழிற்சாலை மீட்டமைப்பு தரவு

source: File
ta: கோப்பு

source: Find accounts
ta: கணக்குகளைக் கண்டறியவும்

source: Find accounts by email
ta: மின்னஞ்சல் மூலம் கணக்குகளைக் கண்டறியவும்

source: Flash taskbar on new message
ta: புதிய செய்தியில் ஃபிளாஷ் பணிப்பட்டி

source: Forward
ta: முன்னோக்கி

source: Functionality
ta: செயல்பாடு

source: General
ta: பொது

source: Get beta updates
ta: பீட்டா புதுப்பிப்புகளைப் பெறுங்கள்

source: Go Back
ta: திரும்பிச் செல்லுங்கள்

source: Hard Reload
ta: கடின மறுஏற்றம்

source: Help
ta: உதவி

source: Help Center
ta: உதவி மையம்

source: Hide
ta: மறை

source: Hide Others
ta: மற்றவை மறை

source: Hide Zulip
ta: சூலிப்பை மறைக்கவும்

source: History
ta: வரலாறு

source: History Shortcuts
ta: வரலாறு குறுக்குவழிகள்

source: Install Later
ta: பின்னர் நிறுவவும்

source: Install and Relaunch
ta: நிறுவி மீண்டும் தொடங்கவும்

source: It will be installed the next time you restart the application.
ta: அடுத்த முறை நீங்கள் விண்ணப்பத்தை மறுதொடக்கம் செய்யும்போது இது நிறுவப்படும்.

source: Keyboard Shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

source: Later
ta: பின்னர்

source: Loading
ta: ஏற்றுகிறது

source: Log Out
ta: வெளியேறு

source: Log Out of Organization
ta: நிறுவனத்திலிருந்து வெளியேறு

source: Look Up
ta: பாருங்கள்

source: Maintained by {{{link}}}Zulip{{{endLink}}}
ta: {{{link}}} Zulip {{{endLink}} by ஆல் பராமரிக்கப்படுகிறது

source: Manual proxy configuration
ta: கையேடு ப்ராக்ஸி உள்ளமைவு

source: Minimize
ta: குறைத்தல்

source: Mute all sounds from Zulip
ta: ஜூலிப்பிலிருந்து எல்லா ஒலிகளையும் முடக்கு

source: Network
ta: வலைப்பின்னல்

source: Network and Proxy Settings
ta: பிணையம் மற்றும் பதிலாள் அமைப்புகள்

source: New servers added. Reload app now?
ta: புதிய சேவையகங்கள் சேர்க்கப்பட்டன. பயன்பாட்டை இப்போது மீண்டும் ஏற்றவா?

source: No
ta: இல்லை

source: No Suggestion Found
ta: எந்த ஆலோசனையும் கிடைக்கவில்லை

source: No updates available.
ta: புதுப்பிப்புகள் எதுவும் கிடைக்கவில்லை.

source: Notification settings
ta: அறிவிப்பு அமைப்புகள்

source: OR
ta: அல்லது

source: On macOS, the OS spellchecker is used.
ta: MACOS இல், OS எழுத்துப்பிழை பயன்படுத்தப்படுகிறது.

source: Organization URL
ta: அமைப்பு URL

source: Organizations
ta: அமைப்புக்கள்

source: Paste
ta: ஒட்டு

source: Paste and Match Style
ta: ஒட்டு மற்றும் போட்டி நடை

source: Proxy
ta: பதிலாள்

source: Proxy bypass rules
ta: ப்ராக்ஸி பைபாஸ் விதிகள்

source: Proxy rules
ta: ப்ராக்ஸி விதிகள்

source: Proxy settings saved.
ta: பதிலாள் அமைப்புகள் சேமிக்கப்பட்டன.

source: Quit
ta: விட்டுவிட

source: Quit Zulip
ta: ஜூலிப்பை விட்டு வெளியேறு

source: Quit when the window is closed
ta: சாளரம் மூடப்படும் போது வெளியேறவும்

source: Redo
ta: மீண்டும் செய்

source: Release Notes
ta: வெளியீட்டு குறிப்புகள்

source: Reload
ta: ஏற்றவும்

source: Report an Issue
ta: ஒரு சிக்கலைப் புகாரளிக்கவும்

source: Reset App Settings
ta: பயன்பாட்டு அமைப்புகளை மீட்டமைக்கவும்

source: Reset the application, thus deleting all the connected organizations and accounts.
ta: விண்ணப்பத்தை மீட்டமைக்கவும், இதனால் இணைக்கப்பட்ட அனைத்து நிறுவனங்களையும் கணக்குகளையும் நீக்குகிறது.

source: Save
ta: சேமி

source: Select All
ta: அனைத்தையும் தெரிவுசெய்

source: Select Download Location
ta: பதிவிறக்க இருப்பிடத்தைத் தேர்ந்தெடுக்கவும்

source: Select file
ta: கோப்பைத் தேர்ந்தெடு

source: Services
ta: சேவைகள்

source: Settings
ta: அமைப்புகள்

source: Shortcuts
ta: குறுக்குவழிகள்

source: Show app icon in system tray
ta: கணினி தட்டில் பயன்பாட்டு ஐகானைக் காட்டு

source: Show desktop notifications
ta: டெஸ்க்டாப் அறிவிப்புகளைக் காண்பி

source: Show sidebar
ta: பக்கப்பட்டியைக் காட்டு

source: Show unread count badge on app icon
ta: பயன்பாட்டு ஐகானில் படிக்காத எண்ணிக்கை பேட்சைக் காட்டு

source: Spellchecker Languages
ta: எழுத்துப்பிழை மொழிகள்

source: Start app at login
ta: உள்நுழைவில் பயன்பாட்டைத் தொடங்கவும்

source: Switch to Next Organization
ta: அடுத்த அமைப்புக்கு மாறவும்

source: Switch to Previous Organization
ta: முந்தைய அமைப்புக்கு மாறவும்

source: The custom CSS previously set is deleted.
ta: முன்னர் அமைக்கப்பட்ட தனிப்பயன் சிஎச்எச் நீக்கப்பட்டது.

source: The server presented an invalid certificate for {{{origin}}}: {{{error}}}
ta: சேவையகம் {{{origin}}} க்கான தவறான சான்றிதழை வழங்கியது: {{{error}}}

source: The update will be downloaded in the background. You will be notified when it is ready to be installed.
ta: புதுப்பிப்பு பின்னணியில் பதிவிறக்கம் செய்யப்படும். இது நிறுவ தயாராக இருக்கும்போது உங்களுக்கு அறிவிக்கப்படும்.

source: There was an error while saving the new organization. You may have to add your previous organizations again.
ta: புதிய அமைப்பைச் சேமிக்கும்போது பிழை ஏற்பட்டது. உங்கள் முந்தைய அமைப்புகளை மீண்டும் சேர்க்க வேண்டியிருக்கும்.

source: These desktop app shortcuts extend the Zulip webapp's
ta: இந்த டெஸ்க்டாப் பயன்பாட்டு குறுக்குவழிகள் ஜூலிப் வெப்ஆப்பை நீட்டிக்கின்றன

source: Tip
ta: குறிப்பு

source: Toggle DevTools for Active Tab
ta: செயலில் தாவலுக்கு DevTools ஐ மாற்று

source: Toggle DevTools for Zulip App
ta: ஜூலிப் பயன்பாட்டிற்கான DevTools ஐ மாற்று

source: Toggle Do Not Disturb
ta: தொந்தரவு செய்ய வேண்டாம் என்பதை நிலைமாற்று

source: Toggle Full Screen
ta: மாற்று முழுத்திரை

source: Toggle Sidebar
ta: பக்கப்பட்டியை நிலைமாற்று

source: Toggle Tray Icon
ta: தட்டு ஐகானை மாற்று

source: Tools
ta: கருவிகள்

source: Unable to check for updates.
ta: புதுப்பிப்புகளை சரிபார்க்க முடியவில்லை.

source: Unable to download the update.
ta: புதுப்பிப்பைப் பதிவிறக்க முடியவில்லை.

source: Undo
ta: செயல்தவிர்

source: Unhide
ta: இரக்கமற்றது

source: Unknown error
ta: தெரியாத பிழை

source: Upload
ta: பதிவேற்றம்

source: Use system proxy settings (requires restart)
ta: கணினி ப்ராக்ஸி அமைப்புகளைப் பயன்படுத்தவும் (மறுதொடக்கம் தேவை)

source: View
ta: காண்க

source: View Shortcuts
ta: குறுக்குவழிகளைக் காண்க

source: We encountered an error while saving the update notifications.
ta: புதுப்பிப்பு அறிவிப்புகளைச் சேமிக்கும்போது பிழையை நாங்கள் சந்தித்தோம்.

source: Window
ta: ஜன்னல்

source: Window Shortcuts
ta: சாளர குறுக்குவழிகள்

source: Yes
ta: ஆம்

source: You are running the latest version of Zulip Desktop. Version: {{{version}}}
ta: நீங்கள் சூலிப் டெச்க்டாப்பின் அண்மைக் கால பதிப்பை இயக்குகிறீர்கள். பதிப்பு: {{{version}}}}

source: You can select a maximum of 3 languages for spellchecking.
ta: எழுத்துப்பிழைக்கு அதிகபட்சம் 3 மொழிகளைத் தேர்ந்தெடுக்கலாம்.

source: Zoom In
ta: பெரிதாக்க

source: Zoom Out
ta: பெரிதாக்கு

source: keyboard shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

source: script
ta: ஸ்கிரிப்ட்

source: {{{server}}} runs an outdated Zulip Server version {{{version}}}. It may not fully work in this app.
ta: {{{server}}}} காலாவதியான சூலிப் சேவையக பதிப்பை இயக்குகிறது {{{version}}}. இந்த பயன்பாட்டில் இது முழுமையாக வேலை செய்யாமல் போகலாம்.
