import pota

# பாதை = "/Users/apt/Documents/அறிவிலி/TACETranslation/உரை/"
பாதை = "./"

# pota.அகராதி_இருமபொருள்(பாதை + "முடிந்தது/*.po")

# pota.வரிசைபடுத்து_கோப்புகள்(பாதை + "மொழிபெயர்ப்புகள்/மின்னியல்.po")
# pota.வரிசைபடுத்து_கோப்புகள்(பாதை + "பிறமொழி/*.po")

# pota.அகராதி_மேம்படுத்து(பாதை + "நினைவு/முடிந்தது.po", பாதை + "முடிந்தது/*.po")
# pota.அகராதி_மேம்படுத்து(பாதை + "நினைவு/பிறமொழி.po", பாதை + "பிறமொழி/*.po")

pota.பிறமொழி_தவிர்_கோப்புகள்(பாதை + "தானி/*.po")

pota.சரிபார்_கோப்புகள்(பாதை + "தானி/*.po")
