import tapo

பாதை = "./"
# பாதை = "/Users/apt/Documents/அறிவிலி/பயன்/மொழி/தமிழாக்கம்/உரை/"
# பாதை = "D:\அறிவிலி\பயன்\மொழி\தமிழாக்கம்\உரை\வரிசை\ta.po"


# tapo.எடுபொருள்மொழி(அனைத்தும்=False, இருமம்=False)
tapo.எடுபொருள்மொழிபெயர்(அனைத்தும்=True, இருமம்=False)
tapo.பண்புகள்மொழிபெயர்()
tapo.டீடிடீமொழிபெயர்()
tapo.சேசன்மொழிபெயர்()
tapo.சாதொபொகுமொழிபெயர்()
tapo.சரங்கள்மொழிபெயர்()
tapo.இனிமொழிபெயர்()
tapo.பிறமொழி_தவிர்_கோப்புகள்(பாதை + "*.po")
tapo.சரிபார்_கோப்புகள்(பாதை + "தானி" + "/" + "*.po")


# tapo.வரிசைபடுத்து_கோப்புகள்(பாதை)
# tapo.அகராதி_இருமபொருள்(பாதை + "முடிந்தது/*.po")
# tapo.அகராதி_மேம்படுத்து(பாதை + "நினைவு/முடிந்தது.po", பாதை + "முடிந்தது/*.po")
# tapo.அகராதி_மேம்படுத்து(பாதை + "நினைவு/பிறமொழி.po", பாதை + "பிறமொழி/*.po") 