import pota

பாதை = "./"
# பாதை = "/Users/apt/Documents/அறிவிலி/பயன்/மொழி/தமிழாக்கம்/உரை/"
# பாதை = "D:\அறிவிலி\பயன்\மொழி\தமிழாக்கம்\உரை\வரிசை\ta.po"

pota.எடுபொருள்மொழிபெயர்(அனைத்தும்=True, இருமம்=False)
pota.பண்புகள்மொழிபெயர்()
pota.டீடிடீமொழிபெயர்()
pota.சேசன்மொழிபெயர்()
pota.சாதொபொகுமொழிபெயர்()
pota.சரங்கள்மொழிபெயர்()
pota.இனிமொழிபெயர்()
pota.பிறமொழி_தவிர்_கோப்புகள்(பாதை + "*.po")
pota.சரிபார்_கோப்புகள்(பாதை + "தானி" + "/" + "*.po")

# pota.வரிசைபடுத்து_கோப்புகள்(பாதை)
# pota.அகராதி_இருமபொருள்(பாதை + "முடிந்தது/*.po")
# pota.அகராதி_மேம்படுத்து(பாதை + "நினைவு/முடிந்தது.po", பாதை + "முடிந்தது/*.po")
# pota.அகராதி_மேம்படுத்து(பாதை + "நினைவு/பிறமொழி.po", பாதை + "பிறமொழி/*.po")
