Repository: 247i/TACETr
Catalog: உரை/வெறுமை/hedy-parsons-*.po
Languages: ta

# levels->1->1->story
source: Puzzels are exercises in which the lines of code are already written for you. You only have to place the lines in the correct order. Drag the lines of code into the input screen and run the code. Can you get the program to work? You're a customer at bakery Hedy. You walk into the bakery and are welcomed by the baker. He asks what type of pie you want to order. Then he repeats your answer back to you. Lastly, your order is being prepared.
ta: புதிர்கள் என்பது குறியீட்டின் கோடுகள் உங்களுக்காக ஏற்கனவே எழுதப்பட்ட பயிற்சிகள். நீங்கள் வரிகளை சரியான வரிசையில் மட்டுமே வைக்க வேண்டும். குறியீட்டின் வரிகளை உள்ளீட்டுத் திரையில் இழுத்து குறியீட்டை இயக்கவும். நிரலை வேலை செய்ய முடியுமா? நீங்கள் பேக்கரி எடியில் ஒரு வாடிக்கையாளர். நீங்கள் பேக்கரிக்குள் நுழைந்து பேக்கரால் வரவேற்கப்படுகிறீர்கள். நீங்கள் எந்த வகையான பை ஆர்டர் செய்ய விரும்புகிறீர்கள் என்று அவர் கேட்கிறார். பின்னர் அவர் உங்கள் பதிலை உங்களிடம் மீண்டும் கூறுகிறார். கடைசியாக, உங்கள் ஆர்டர் தயாரிக்கப்படுகிறது.

# levels->1->1->code
source: {print} Welcome to bakery Hedy! {ask} What type of pie do you want to order? {echo} So you want {print} Your order is being prepared!
ta: {print} பேக்கரி எடிக்கு வருக! {ask} நீங்கள் எந்த வகை பை ஆர்டர் செய்ய விரும்புகிறீர்கள்? {echo} எனவே நீங்கள் விரும்புகிறீர்கள் {print} உங்கள் ஆர்டர் தயாரிக்கப்படுகிறது!

# levels->1->2->story
source: You're at the DJ Booth requesting a song. Create a program that asks if you are ready to party and then asks which song you would like to hear.
ta: நீங்கள் ஒரு பாடலைக் கோருகிறீர்கள். நீங்கள் விருந்துக்கு தயாரா என்று கேட்கும் ஒரு திட்டத்தை உருவாக்கவும், பின்னர் நீங்கள் எந்த பாடலைக் கேட்க விரும்புகிறீர்கள் என்று கேட்கிறீர்கள்.

# levels->1->2->code
source: {print} This is DJ Hedy {ask} Are you ready to party? {ask} What song would you like to hear? {echo} Great choice! I love the song
ta: {print} இது டி.சே. {ask} நீங்கள் விருந்துக்கு தயாரா? {ask} நீங்கள் எந்த பாடலைக் கேட்க விரும்புகிறீர்கள்? {echo} சிறந்த தேர்வு! நான் பாடலை விரும்புகிறேன்

# levels->2->1->story
source: You and your friends are going to watch some Netflix. Show which movie you're about to watch and wish the viewers lot of fun!
ta: நீங்களும் உங்கள் நண்பர்களும் சில நெட்ஃபிக்ச் பார்க்கப் போகிறீர்கள். நீங்கள் எந்த திரைப்படத்தைப் பார்க்கப் போகிறீர்கள் என்பதைக் காட்டுங்கள், பார்வையாளர்களுக்கு மிகவும் வேடிக்கையாக இருக்க வேண்டும்!

# levels->2->1->code
source: {print} It is time for an evening of Netflix film {is} Sonic the Hedgehog 2 {print} We're going to watch film {print} Have fun!
ta: {print} இது நெட்ஃபிக்ச் ஒரு மாலை நேரமாகும் படம் {is} சோனிக் தி எட்ச்ஆக் 2 {print} நாங்கள் படம் பார்க்கப் போகிறோம் {அச்சிடு fun வேடிக்கையாக இருங்கள்!

# levels->2->2->story
source: This is the webshop of a toy store. Create a program where costumers can add an item to their shopping cart.
ta: இது ஒரு பொம்மை கடையின் வெப்சாப். வாடிக்கையாளர்கள் தங்கள் வணிக வண்டியில் ஒரு பொருளைச் சேர்க்கக்கூடிய ஒரு திட்டத்தை உருவாக்கவும்.

# levels->2->2->code
source: {print} Welcome to our toystore toy {is} {ask} What would you like to buy? {print} toy is added to your shopping cart. {print} Thank you for shopping with us!
ta: {print} எங்கள் டாய்ச்டோருக்கு வருக பொம்மை {is} {ask} நீங்கள் என்ன வாங்க விரும்புகிறீர்கள்? {print} பொம்மை உங்கள் வணிக வண்டியில் சேர்க்கப்பட்டுள்ளது. {print} எங்களுடன் சாப்பிங் செய்ததற்கு நன்றி!

# levels->3->1->story
source: The new school year at Hogwarts is starting! It is the job of the sorting hat to sort you into one of the houses. Which house will you be sorted into? Are you a Gryffindor, Hufflepuff, Ravenclaw or Slytherin. Before the sorting hat reveals your house, you can tell it to not pick one of the houses.
ta: ஆக்வார்ட்சில் புதிய பள்ளி ஆண்டு தொடங்குகிறது! உங்களை ஒரு வீடுகளில் வரிசைப்படுத்துவது வரிசைப்படுத்தும் தொப்பியின் வேலை. நீங்கள் எந்த வீட்டிற்கு வரிசைப்படுத்தப்படுவீர்கள்? நீங்கள் ஒரு க்ரிஃபிண்டர், அஃப்ல்பஃப், ராவென்க்லா அல்லது ச்லிதரின். வரிசையாக்க தொப்பி உங்கள் வீட்டை வெளிப்படுத்துவதற்கு முன்பு, வீடுகளில் ஒன்றைத் தேர்ந்தெடுக்க வேண்டாம் என்று நீங்கள் சொல்லலாம்.

# levels->3->1->code
source: {print} The sorting hat is ready to sort you into a Hogwarts house. houses {is} Gryffindor, Hufflepuf, Ravenclaw, Slytherin dislike {is} {ask} Are there any houses you do not want to be part of? {remove} dislike {from} houses {print} Not dislike eh? Better be... houses {at} {random}
ta: {print} வரிசையாக்க தொப்பி உங்களை ஒரு ஆக்வார்ட்ச் வீட்டில் வரிசைப்படுத்த தயாராக உள்ளது. வீடுகள் {is} gryffindor, hufflepuf, ravenclaw, ச்லிதரின் விரும்பாத {is} {ask} நீங்கள் ஒரு பகுதியாக இருக்க விரும்பாத வீடுகள் ஏதேனும் உள்ளதா? } வீடுகளிலிருந்து} விரும்பாத} அகற்று {remove} விரும்பவில்லை? நல்லது ... வீடுகள் {from} {print}

# levels->3->2->story
source: Create a program that chooses a random meal for you. Make a list of food and a list of toppings and let the program decide what you'll have!
ta: உங்களுக்காக ஒரு சீரற்ற உணவைத் தேர்ந்தெடுக்கும் ஒரு திட்டத்தை உருவாக்கவும். உணவின் பட்டியல் மற்றும் மேல்புறங்களின் பட்டியலை உருவாக்கி, உங்களிடம் என்ன இருக்கிறது என்பதை நிரல் தீர்மானிக்கட்டும்!

# levels->3->2->code
source: food {is} pizza, icecream, salad, sandwich toppings {is} chocolate, cheese, tuna, sprinkles {print} Your random meal for today is... {sleep} 2 {print} food {at} {random} with toppings {at} {random}
ta: உணவு {is} பீச்சா, ஐச்கிரீம், சாலட், சாண்ட்விச் மேல்புறங்கள் {is} சாக்லேட், சீச், டுனா, தெளிப்பான்கள் {print} இன்றைய உங்கள் சீரற்ற உணவு ... {sleep} 2 {print} உணவு {at {{at} உடன் மேல்புறங்களுடன் {{{random}

# levels->3->3->story
source: In a chess tournament there are three players left. Create a program that decides which two players have to play against each other first. Start by printing the two players who play the first match, then print against which player the winner will play.
ta: ஒரு சதுரங்க போட்டியில் மூன்று வீரர்கள் எஞ்சியுள்ளனர். எந்த இரண்டு வீரர்கள் முதலில் ஒருவருக்கொருவர் எதிராக விளையாட வேண்டும் என்பதை தீர்மானிக்கும் ஒரு திட்டத்தை உருவாக்கவும். முதல் போட்டியில் விளையாடும் இரண்டு வீரர்களையும் அச்சிடுவதன் மூலம் தொடங்கவும், பின்னர் எந்த வீரர் வெற்றியாளர் விளையாடுவார் என்பதற்கு எதிராக அச்சிடவும்.

# levels->3->3->code
source: players {is} Liam, Noah, Sophie player_1 {is} players {at} {random} {remove} player_1 {from} players player_2 {is} players {at} {random} {print} player_1 ' first plays against ' player_2 {remove} player_2 {from} players {print} 'The winner plays against ' players {at} {random}
ta: வீரர்கள் {is} லியாம், நோவா, சோஃபி பிளேயர்_1 {is} பிளேயர்கள் {at {{remove} } பிளேயர்களிடமிருந்து} பிளேயர்_1 {அகற்று பிளேயர்_2 {random} பிளேயர்கள் {at} {from} {is} பிளேயர்_1 'பிளேயர்_2 க்கு எதிராக முதல் நாடகங்கள் } பிளேயர்களிடமிருந்து} பிளேயர்_2 {அகற்று {at} 'வெற்றியாளர்' வீரர்களுக்கு எதிராக விளையாடுகிறார் {{{random}

# levels->4->1->story
source: You are the newest Pokémon trainer from Pallet Town! Make a program that selects your first Pokémon. Let the program wait a second before revealing your first Pokémon.
ta: நீங்கள் பாலேட் டவுனில் இருந்து புதிய போகிமொன் பயிற்சியாளர்! உங்கள் முதல் போகிமொனைத் தேர்ந்தெடுக்கும் ஒரு நிரலை உருவாக்கவும். உங்கள் முதல் போகிமொனை வெளிப்படுத்துவதற்கு முன் நிரல் ஒரு நொடி காத்திருக்கட்டும்.

# levels->4->1->code
source: pokemons {is} Pikachu, Charmander, Bulbasaur, Squirtle {print} 'This is going to be your first Pokémon!' {sleep} {print} pokemons {at} {random}
ta: போகிமொன் {is} பிகாச்சு, சார்மண்டர், புல்பாசர், ச்கர்டில் {print} 'இது உங்கள் முதல் போகிமொன் ஆக இருக்கும்!' {sleep} {print} pokemons {at} {random}

# levels->4->2->story
source: Create a lottery that lets you choose an extra prize that you might win.
ta: நீங்கள் வெல்லக்கூடிய கூடுதல் பரிசைத் தேர்வுசெய்ய உதவும் ஒரு லாட்டரியை உருவாக்கவும்.

# levels->4->2->code
source: prizes {is} car, hamster, 1 million euros prize {is} {ask} 'What would you like to win?' {add} prize {to_list} prizes {print} 'You won a ' prizes {at} {random}
ta: பரிசுகள் {is} கார், வெள்ளெலி, 1 மில்லியன் யூரோக்கள் பரிசு {is {{is} 'நீங்கள் என்ன வெல்ல விரும்புகிறீர்கள்?' {ask} பரிசு {add} பரிசுகள் {to_list} 'நீங்கள் ஒரு' பரிசுகளை {{{print} இல் வென்றீர்கள்

# levels->5->1->story
source: Make a program that checks if your favourite movie is already in the list of the computer. If so, print that you have great taste, otherwise add the movie to the list.
ta: உங்களுக்கு பிடித்த படம் ஏற்கனவே கணினியின் பட்டியலில் இருக்கிறதா என்று சோதிக்கும் ஒரு நிரலை உருவாக்கவும். அப்படியானால், உங்களுக்கு சிறந்த சுவை இருப்பதாக அச்சிடுங்கள், இல்லையெனில் திரைப்படத்தை பட்டியலில் சேர்க்கவும்.

# levels->5->1->code
source: favorite_movies {is} Batman, Spiderman, The Avengers, Jurassic Park movie {is} {ask} 'What is your favourite movie?' {if} movie {in} favorite_movies {print} 'You have great taste!' {else} {print} 'Such a shame that your favourite movie is not in the list, we will add it right away!' {add} movie {to_list} favorite_movies
ta: பிடித்த_மோவிச் {is} பேட்மேன், ச்பைடர்மேன், அவென்சர்ச், சுராசிக் பார்க் திரைப்படம் {is} {ask} 'உங்களுக்கு பிடித்த படம் எது?' {if} movie {in} bead_movies {print} 'உங்களுக்கு சிறந்த சுவை இருக்கிறது!' {else} {print} 'உங்களுக்கு பிடித்த படம் பட்டியலில் இல்லாத ஒரு அவமானம், நாங்கள் அதை இப்போதே சேர்ப்போம்!' {add} மூவி {to_list} பிடித்த_மோவிச்

# levels->5->2->story
source: Create a maths game.
ta: கணித விளையாட்டை உருவாக்கவும்.

# levels->5->2->code
source: {print} 'Solve this problem' answer {is} {ask} '88 - 16 = ?' {if} answer {is} 72 {print} 'Correct!' {else} {print} 'Wrong! The answer was 72'
ta: {print} 'இந்த சிக்கலை தீர்க்கவும்' பதில் {is} {ask} '88 - 16 =? ' {if} பதில் {is} 72 {print} 'சரியானது!' {else} {print} 'தவறு! பதில் 72 '

# levels->6->1->story
source: Make a program that calculates how old you are in dog and cat years. First ask the age of the user and start calculating. First calculate the dogyears then the catyears. Show the user the different ages.
ta: நாய் மற்றும் பூனை ஆண்டுகளில் நீங்கள் எவ்வளவு வயதானவர் என்பதைக் கணக்கிடும் ஒரு திட்டத்தை உருவாக்கவும். முதலில் பயனரின் வயதைக் கேட்டு கணக்கிடத் தொடங்குங்கள். முதலில் டோகீயர்களைக் கணக்கிடுங்கள். பயனருக்கு வெவ்வேறு வயதினரைக் காட்டுங்கள்.

# levels->6->1->code
source: age = {ask} 'How old are you?' dog_age = age * 7 cat_age = age * 5 {print} 'In dog years you are ' dog_age ' years old.' {print} 'In cat years you are ' cat_age ' years old.'
ta: அகவை = {ask} 'உங்களுக்கு எவ்வளவு வயது?' dog_age = அகவை * 7 cat_age = அகவை * 5 Dog 'நாய் ஆண்டுகளில் நீங்கள்' நாய்_சேச் 'வயது.' {print} 'பூனை ஆண்டுகளில் நீங்கள்' பூனை_சேச் 'வயது.'

# levels->6->2->story
source: Create a program that helps you calculate how many cakes you should buy for your birthday party.
ta: உங்கள் பிறந்தநாள் விருந்துக்கு எத்தனை கேக்குகளை வாங்க வேண்டும் என்பதைக் கணக்கிட உதவும் ஒரு திட்டத்தை உருவாக்கவும்.

# levels->6->2->code
source: {print} 'It is your birthday!' people = {ask} 'How many people do you want to give a slice of cake?' cakes_amount = people/8 {print} 'You will have to buy ' cakes_amount ' cakes'
ta: {print} 'இது உங்கள் பிறந்த நாள்!' மக்கள் = {ask} 'எத்தனை பேர் கேக் துண்டு கொடுக்க விரும்புகிறீர்கள்?' Cakes_amount = மக்கள்/8 {print} 'நீங்கள்' கேக்குகள்_மவுண்ட் 'கேக்குகளை' வாங்க வேண்டும்

# levels->7->1->story
source: Complete the baby shark song. First comes baby shark, then mommy and finally daddy shark.
ta: குழந்தை சுறா பாடலை முடிக்கவும். முதலில் குழந்தை சுறா, பின்னர் மம்மி மற்றும் இறுதியாக அப்பா சுறா வருகிறார்கள்.

# levels->7->1->code
source: {repeat} 3 {times} {print} 'Baby shark tututututudu' {print} 'Baby shark' {repeat} 3 {times} {print} 'Mommy shark tututututudu' {print} 'Mommy shark' {repeat} 3 {times} {print} 'Daddy shark tututututudu' {print} 'Daddy shark'
ta: {repeat} 3 {times} {print} 'குழந்தை சுறா tututututudu' {print} 'குழந்தை சுறா' {repeat} 3 {times} {print} 'மம்மி சுறா tututututudu' {print} 'மம்மி சுறா' {repeat} 3 {times} {print} 'அப்பா சுறா tututututudu' {print} 'அப்பா சுறா'

# levels->7->2->story
source: Create the song 'The wheels on the bus go round and round'
ta: 'தி வீல்ச் ஆன் தி பச் சுற்று மற்றும் சுற்று' பாடலை உருவாக்கவும்

# levels->7->2->code
source: {print} 'the wheels on the bus go' {repeat} 3 {times} {print} 'round and round' {print} 'the wheels of the bus go round and round' {print} 'all through the town'
ta: {print} 'பச்சில் உள்ள சக்கரங்கள்' {repeat} 3 {times} {print} 'சுற்று மற்றும் சுற்று' {print} 'பச் சக்கரங்கள் சுற்றிலும் வட்டமாகவும் செல்கின்றன' {print} 'அனைத்து நகரம் வழியாகவும்'

# levels->8->1->story
source: You and four other friends are playing Pokémon Go! Create a program that decides in which team each of you will play. Either red, yellow or blue! Take a little pause after announcing a team.
ta: நீங்களும் மற்ற நான்கு நண்பர்களும் போகிமொன் கோ விளையாடுகிறீர்கள்! நீங்கள் ஒவ்வொருவரும் எந்த அணி விளையாடுவீர்கள் என்பதை தீர்மானிக்கும் ஒரு திட்டத்தை உருவாக்கவும். சிவப்பு, மஞ்சள் அல்லது நீலம்! ஒரு அணியை அறிவித்த பிறகு கொஞ்சம் இடைநிறுத்தம் செய்யுங்கள்.

# levels->8->1->code
source: teams = red, yellow, blue {print} 'Red, Yellow or Blue?' {repeat} 5 {times} {print} 'You are selected in team... ' {print} teams {at} {random} {sleep} 2
ta: அணிகள் = சிவப்பு, மஞ்சள், நீலம் {print} 'சிவப்பு, மஞ்சள் அல்லது நீலம்?' {repeat} 5 {times} {print} 'நீங்கள் அணியில் தேர்ந்தெடுக்கப்பட்டீர்கள் ...' {print} அணிகள் {at {{at} {random} 2

# levels->8->2->story
source: Print the countdown for a game of hide and seek.
ta: மறை மற்றும் தேட ஒரு விளையாட்டுக்கான கவுண்ட்டவுனை அச்சிடவும்.

# levels->8->2->code
source: counter = 11 {repeat} 10 {times} counter = counter - 1 {print} counter {sleep} 1 {print} 'Ready or not here I come!'
ta: எதிர் = 11 {repeat} 10 {times} கவுண்டர் = கவுண்டர் - 1 {print} கவுண்டர் {sleep} 1 {print} 'தயாராக இல்லையா இங்கே நான் வருகிறேன்!'

# levels->9->1->story
source: This game will give you three maths assignments. Each time the question is different. Can you figure out the order?
ta: இந்த விளையாட்டு உங்களுக்கு மூன்று கணித பணிகளை வழங்கும். ஒவ்வொரு முறையும் கேள்வி வேறுபட்டது. ஆர்டரைக் கண்டுபிடிக்க முடியுமா?

# levels->9->1->code
source: numbers = 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 {repeat} 3 {times} number = numbers {at} {random} correct_answer = 5 * number answer = {ask} 'What is 5 times' number '?' {if} answer = correct_answer {print} 'Good job!' {else} {print} 'No! The correct answer is ' correct_answer
ta: எண்கள் = 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 {repeat} 3 {times} எண் = எண்கள் {at} {random} சரியான_அன்வெர் = 5 * எண் பதில் = {ask} '5 முறை' எண் 'என்றால் என்ன?' {if} பதில் = சரியான_அன்வெர் {print} 'நல்ல வேலை!' {else} {print} 'இல்லை! சரியான பதில் 'சரியான_அன்வெர்

# levels->9->2->story
source: This code asks the costumers in a restaurant if they would like to order dessert. If they do, it asks them what kind of dessert. If they order tiramisu they are told that the tiramisu is sold out. Can you get the code to work?
ta: இந்த குறியீடு ஒரு உணவகத்தில் உள்ள ஆடைகளை இனிப்புக்கு ஆர்டர் செய்ய விரும்புகிறீர்களா என்று கேட்கிறது. அவர்கள் அவ்வாறு செய்தால், அது என்ன வகையான இனிப்பு என்று கேட்கிறது. அவர்கள் டிராமிசுவை ஆர்டர் செய்தால், டிராமிசு விற்கப்படுவதாகக் கூறப்படுகிறது. குறியீட்டை வேலை செய்ய முடியுமா?

# levels->9->2->code
source: order = {ask} 'Would you like to order dessert?' {if} order = yes dessert = {ask} 'What kind of dessert would you like?' {if} dessert = tiramisu {print} 'Sorry, we are out of tiramisu.' {else} {print} 'One ' dessert ' coming right up!' {else} {print} 'You dont want a dessert. No problem!'
ta: ஆர்டர் = {ask} 'நீங்கள் இனிப்பை ஆர்டர் செய்ய விரும்புகிறீர்களா?' {if} order = ஆம் இனிப்பு = {ask} 'நீங்கள் எந்த வகையான இனிப்பை விரும்புகிறீர்கள்?' {if} இனிப்பு = டிராமிசு {print} 'மன்னிக்கவும், நாங்கள் டிராமிசுவுக்கு வெளியே இருக்கிறோம்.' {else} {print} 'ஒரு' இனிப்பு 'வலதுபுறம் வருகிறது!' {else} {print} 'உங்களுக்கு ஒரு இனிப்பு தேவையில்லை. எந்த பிரச்சனையும் இல்லை! '

# levels->10->1->story
source: Help this family out by creating a schedule of who is cooking and what they should be making this week. The `{remove}` commands make sure nobody has to cook twice and they have a different dinner every day. **Mind!** the variable order should be first days, then people, and lastly dinner_options. This goes for the lines with the `{remove}` commands too.
ta: யார் சமைக்கிறார்கள், இந்த வாரம் அவர்கள் என்ன செய்ய வேண்டும் என்ற அட்டவணையை உருவாக்குவதன் மூலம் இந்த குடும்பத்திற்கு உதவுங்கள். `{remove}` கட்டளைகள் யாரும் இரண்டு முறை சமைக்க வேண்டியதில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், மேலும் அவர்கள் ஒவ்வொரு நாளும் வித்தியாசமான இரவு உணவைக் கொண்டிருக்கிறார்கள். ** மனம்! ** மாறி ஒழுங்கு முதல் நாட்களாகவும், பின்னர் மக்கள், கடைசியாக இரவு உணவு_ விருப்பங்களாகவும் இருக்க வேண்டும். இது `{remove}` கட்டளைகளையும் கொண்ட வரிகளுக்கு செல்கிறது.

# levels->10->1->code
source: days = Monday, Tuesday, Wednesday, Thursday, Friday people = mom, dad, Martin, Abby, Jesse dinner_options = pizza, tacos, pancakes, a salad, lasagne {for} day {in} days chosen_person = people {at} {random} chosen_dinner = dinner_options {at} {random} {print} 'On ' day ' ' chosen_person ' is making ' chosen_dinner {remove} chosen_person {from} people {remove} chosen_dinner {from} dinner_options
ta: நாட்கள் = திங்கள், செவ்வாய், அறிவன், வியாழன், வெள்ளி மக்கள் = அம்மா, அப்பா, மார்ட்டின், அப்பி, செச்சி டின்னர்_ஓப்சன்கள் = பீச்சா, டகோச், அப்பத்தை, ஒரு சாலட், லாசாக் }} நாள் {} நாட்களில் தேர்ந்தெடுக்கப்பட்ட_பர்சன் = மக்கள் {at {{for} தேர்ந்தெடுக்கப்பட்ட_டின்னர் = டின்னர்_ஆப்சன்கள் {at {{in} {அச்சிடுக } மக்களிடமிருந்து} தேர்ந்தெடுக்கப்பட்ட_பர்சன் {அகற்று }} sensen_dinner {{derining_options இலிருந்து {அகற்று

# levels->10->2->story
source: This make-over robot will decide your new hairstyle for you. If you do not agree with the first choice, you can try again. **Mind** The variable people is defined in the first line. The variable hairstyles in the second.
ta: இந்த மேக்-ஓவர் ரோபோ உங்களுக்காக உங்கள் புதிய சிகை அலங்காரத்தை தீர்மானிக்கும். முதல் தேர்வில் நீங்கள் உடன்படவில்லை என்றால், நீங்கள் மீண்டும் முயற்சி செய்யலாம். ** மனம் ** மாறி நபர்கள் முதல் வரியில் வரையறுக்கப்படுகிறார்கள். இரண்டாவது மாறி சிகை அலங்காரங்கள்.

# levels->10->2->code
source: people = Betty, Amanda, Marc hairstyles = a bald head, a mohawk, a ponytail, spikes {for} person {in} people {print} person ' will get ' hairstyles {at} {random} happy = {ask} person ', are you happy with this choice?' {if} happy {is} yes {print} 'Great' {else} {print} 'Lets try again... Then 'person ' will get ' hairstyles {at} {random}
ta: மக்கள் = பெட்டி, அமண்டா, மார்க் சிகை அலங்காரங்கள் = ஒரு வழுக்கை தலை, ஒரு மொஆக், ஒரு போனிடெயில், கூர்முனை }} நபருக்கு} மக்களில் {for} நபர் '{{in} இல்' சிகை அலங்காரங்கள் {கிடைக்கும் மகிழ்ச்சியாக = {print} நபர் ', இந்த தேர்வில் நீங்கள் மகிழ்ச்சியடைகிறீர்களா?' } என்றால்} மகிழ்ச்சியாக {} ஆம் {at} 'பெரியது' {random} {ask} 'மீண்டும் முயற்சிக்கலாம் ... பின்னர்' நபர் '' சிகை அலங்காரங்கள் {at {{if} கிடைக்கும்

# levels->11->1->story
source: Create the count down clock for New Year's eve! The program should show the numbers from 10 to 1 for a second and then wish you a happy new year.
ta: புத்தாண்டு கொண்டாட்டத்திற்கான கவுண்ட் பேரூர் கடிகாரத்தை உருவாக்கவும்! நிரல் ஒரு நொடி 10 முதல் 1 வரையிலான எண்களைக் காட்ட வேண்டும், பின்னர் உங்களுக்கு புத்தாண்டு வாழ்த்துக்கள்.

# levels->11->1->code
source: {for} number {in} {range} 10 {to} 1 {print} number {sleep} {clear} {print} 'Happy New Year!'
ta: {} எண் {{{for} 10 {in} 1 வரை {range} எண் {to} {print} {sleep} 'புத்தாண்டு வாழ்த்துக்கள்!'

# levels->11->2->story
source: Create a program that tells us the final results of the science fair. Firstly define the variable contestants, then the variable place. **Hint** Line 5 should be the sleep command, and you should end with saying congratulations.
ta: அறிவியல் கண்காட்சியின் இறுதி முடிவுகளை நமக்குச் சொல்லும் ஒரு திட்டத்தை உருவாக்கவும். முதலில் மாறி போட்டியாளர்களை வரையறுக்கவும், பின்னர் மாறி இடம். ** குறிப்பு ** வரி 5 தூக்கக் கட்டளையாக இருக்க வேண்டும், மேலும் நீங்கள் வாழ்த்துக்களைக் கூற வேண்டும்.

# levels->11->2->code
source: {print} 'And now we will reveal the results of the science fair' contestants = Vivienne, Paul, Trixy, Bianca, Katya place = 5 {for} contestant {in} contestants {sleep} 2 {print} 'On number ' place ' has ended... ' contestant place = place - 1 {print} 'Congratulations!'
ta: {print} 'இப்போது அறிவியல் கண்காட்சியின் முடிவுகளை வெளிப்படுத்துவோம்' போட்டியாளர்கள் = விவியென், பால், ட்ரிக்சி, பியான்கா, கத்யா இடம் = 5 }} போட்டியாளருக்கு} போட்டியாளர்களில் {for} 2 'இடம்' என்ற எண்ணில் {in} 'முடிந்தது ...' போட்டியாளர் இடம் = இடம் - 1 {sleep} 'வாழ்த்துக்கள்!'

# levels->12->1->story
source: Sing the song 'What shall we do with the drunken sailor'. In case you don't know it, the song goed like this: What will we do with the drunken sailor What will we do with the drunken sailor What will we do with the drunken sailor Early in the morning Way hey and up she rises Way hey and up she rises Way hey and up she rises Early in the morning
ta: 'குடிபோதையில் மாலுமியுடன் நாம் என்ன செய்ய வேண்டும்' என்ற பாடலைப் பாடுங்கள். உங்களுக்குத் தெரியாவிட்டால், பாடல் இப்படிச் சென்றது: குடிபோதையில் மாலுமியுடன் நாம் என்ன செய்வோம் குடிபோதையில் மாலுமியுடன் நாம் என்ன செய்வோம் குடிபோதையில் மாலுமியுடன் நாம் என்ன செய்வோம் அதிகாலையில் வழி ஏய் மற்றும் அவள் எழுகிறாள் வழி ஏய் மற்றும் அவள் எழுகிறாள் வழி ஏய் மற்றும் அவள் எழுகிறாள் அதிகாலையில்

# levels->12->1->code
source: verses = 'What will we do with the drunken sailor', 'Way hey and up she rises' {for} verse {in} verses {for} count {in} {range} 1 {to} 3 {print} verse {print} 'Early in the morning'
ta: வசனங்கள் = 'குடிபோதையில் மாலுமியுடன் நாங்கள் என்ன செய்வோம்', 'வழி ஏய் மற்றும் அவள் எழுகின்றன' }} வசனங்களுக்கு} வசனங்களில் {}} {for} 1 {in} 3 இல் {for {for க்கு {for} உரையாடல் {in} 'அதிகாலையில்'

# levels->12->2->story
source: Play a game of Twister with us! First define the variable people, then limbs, then colors.
ta: எங்களுடன் ட்விச்டர் விளையாட்டை விளையாடுங்கள்! முதலில் மாறி நபர்களை வரையறுக்கவும், பின்னர் கைகால்கள், பின்னர் வண்ணங்கள்.

# levels->12->2->code
source: people = 'Jess', 'Nick', 'Winston' limbs = 'left hand', 'left foot', 'right hand', 'right foot' colors = 'red', 'blue', 'green', 'yellow' {for} person {in} people {print} person ', put your ' limbs {at} {random} ' on ' colors {at} {random}
ta: மக்கள் = 'செச்', 'நிக்', 'வின்ச்டன்' கைகால்கள் = 'இடது கை', 'இடது கால்', 'வலது கை', 'வலது கால்' வண்ணங்கள் = 'சிவப்பு', 'நீலம்', 'பச்சை', 'மஞ்சள்' }} நபருக்கு} மக்களில் {for} நபர் ', உங்கள்' கைகால்கள் {in} {print} 'இல்' வண்ணங்களில் {{{at} இல் வைக்கவும்
