Repository: 247i/TACETr
Catalog: உரை/வெறுமை/raspiblitz-web-translations-*.po
Languages: ta

# translation.setup.blockchain_keep
source: Keep Blockchain
ta: பிளாக்செயின் வைத்திருங்கள்

# translation.setup.cancel
source: Cancel
ta: ரத்துசெய்

# translation.setup.cancel_setup
source: Do you really want to cancel the setup process
ta: அமைவு செயல்முறையை ரத்து செய்ய விரும்புகிறீர்களா?

# translation.setup.cl
source: Bitcoin Full Node with Core Lightning Implementation
ta: முக்கிய மின்னல் செயல்படுத்தலுடன் பிட்காயின் முழு முனை

# translation.setup.cl_description
source: Core Lightning (formerly known as c-lightning) is a Lightning Network implementation by Blockstream focused on performance and extendibility for developers and advanced users.
ta: கோர் மின்னல் (முன்னர் சி-லைட்னிங் என்று அழைக்கப்பட்டது) என்பது உருவாக்குபவர்கள் மற்றும் மேம்பட்ட பயனர்களுக்கான செயல்திறன் மற்றும் விரிவாக்கத்தில் கவனம் செலுத்தும் பிளாக்ச்ட்ரீமின் மின்னல் பிணையம் செயல்படுத்தல் ஆகும்.

# translation.setup.continue
source: Continue
ta: தொடரவும்

# translation.setup.convertwarning
source: RaspiBlitz can only convert your Blockchain and Lightning data (funds + channels) at the moment. Data from additional installed apps might get deleted in the migraton process.
ta: ராச்பிப்லிட்ச் இந்த நேரத்தில் உங்கள் பிளாக்செயின் மற்றும் மின்னல் தரவை (நிதி + சேனல்கள்) மட்டுமே மாற்ற முடியும். கூடுதல் நிறுவப்பட்ட பயன்பாடுகளின் தரவு இடம்பெயர்வு செயல்பாட்டில் நீக்கப்படலாம்.

# translation.setup.done_migration_ready
source: OK. Everything is ready to migrate to RaspiBlitz.
ta: சரி. ராச்பிப்லிட்சுக்கு இடம்பெயர எல்லாம் தயாராக உள்ளது.

# translation.setup.done_migration_start
source: Start Migration
ta: இடம்பெயர்வு தொடங்கவும்

# translation.setup.done_recover_ready
source: OK. Everything is ready to recover your RaspiBlitz.
ta: சரி. உங்கள் ராச்ப்ளிட்சை மீட்டெடுக்க எல்லாம் தயாராக உள்ளது.

# translation.setup.done_recover_start
source: Start Recovery
ta: மீட்பு தொடங்கவும்

# translation.setup.done_setup_ready
source: OK. Everything is ready to setup your RaspiBlitz.
ta: சரி. உங்கள் ராச்பிப்லிட்சை அமைக்க எல்லாம் தயாராக உள்ளது.

# translation.setup.done_setup_start
source: Start Setup
ta: அமைப்பைத் தொடங்குங்கள்

# translation.setup.done_update_ready
source: OK. Everything is ready to update your RaspiBlitz.
ta: சரி. உங்கள் ராச்ப்ளிட்சைப் புதுப்பிக்க எல்லாம் தயாராக உள்ளது.

# translation.setup.done_update_start
source: Start Update
ta: புதுப்பிப்பைத் தொடங்குங்கள்

# translation.setup.final_do_reboot
source: OK, do final Reboot
ta: சரி, இறுதி மறுதொடக்கம் செய்யுங்கள்

# translation.setup.final_info_reboot
source: I have written down my seed words and their correct order
ta: எனது விதை சொற்களையும் அவற்றின் சரியான வரிசையையும் எழுதியுள்ளேன்

# translation.setup.final_migration
source: Migration is finished.
ta: இடம்பெயர்வு முடிந்தது.

# translation.setup.final_recovery
source: Recovery is finished.
ta: மீட்பு முடிந்தது.

# translation.setup.final_seedwords
source: Please write down your seed words. These can be used to recover your lightning wallet. The order in which they appear matters. Never share your seed words with anyone, and keep them safe!
ta: உங்கள் விதை சொற்களை எழுதுங்கள். உங்கள் மின்னல் பணப்பையை மீட்டெடுக்க இவை பயன்படுத்தப்படலாம். அவை தோன்றும் வரிசை முக்கியமானது. உங்கள் விதை சொற்களை யாருடனும் பகிர்ந்து கொள்ள வேண்டாம், அவற்றைப் பாதுகாப்பாக வைத்திருங்கள்!

# translation.setup.final_setup
source: Configuration complete!
ta: உள்ளமைவு முடிந்தது!

# translation.setup.final_update
source: Update is finished.
ta: புதுப்பிப்பு முடிந்தது.

# translation.setup.lightningoutdated
source: The node you want to migrate from uses a newer Lightning version than this RaspiBlitz. Please wait for an updated release. You can shutdown and startup with your old node sd card - no changes were made.
ta: நீங்கள் இடம்பெயர விரும்பும் முனை இந்த ராச்பிப்லிட்சை விட புதிய மின்னல் பதிப்பைப் பயன்படுத்துகிறது. புதுப்பிக்கப்பட்ட வெளியீட்டிற்கு காத்திருக்கவும். உங்கள் பழைய முனை எச்டி கார்டுடன் நீங்கள் பணிநிறுத்தம் செய்து தொடங்கலாம் - எந்த மாற்றங்களும் செய்யப்படவில்லை.

# translation.setup.lnd
source: Bitcoin Full Node with Lightning LND Implementation
ta: மின்னல் எல்.என்.டி செயல்படுத்தலுடன் பிட்காயின் முழு முனை

# translation.setup.lnd_description
source: Adding the Lightning Network Daemon (LND), developed by Lightning Labs, to a Bitcoin full node introduces capabilities for faster and cheaper transactions. LND is one of the most popular and user-friendly implementations of the Lightning Network.
ta: மின்னல் ஆய்வகங்களால் உருவாக்கப்பட்ட மின்னல் பிணையம் டீமான் (எல்.என்.டி) ஐ ஒரு பிட்காயின் முழு முனையில் சேர்ப்பது வேகமான மற்றும் மலிவான பரிவர்த்தனைகளுக்கான திறன்களை அறிமுகப்படுத்துகிறது. எல்.என்.டி என்பது மின்னல் நெட்வொர்க்கின் மிகவும் பிரபலமான மற்றும் பயனர் நட்பு செயலாக்கங்களில் ஒன்றாகும்.

# translation.setup.migrate_to_os
source: Do you want to migrate from {{os}} to RaspiBlitz?
ta: நீங்கள் {{os}}} நான்கு, நாலடி, நான்கடி raspiblitz க்கு இடம்பெயர விரும்புகிறீர்களா?

# translation.setup.migrateblitz
source: Migrate
ta: இடம்பெயர்வு

# translation.setup.no_and_shutdown
source: No and Shutdown
ta: இல்லை மற்றும் பணிநிறுத்தம்

# translation.setup.ok
source: OK
ta: சரி

# translation.setup.other_options
source: Other Options
ta: பிற விருப்பங்கள்

# translation.setup.password_a_details
source: Also known as <0>Password A</0>. Use this password for login to your RaspiBlitz.
ta: <0> கடவுச்சொல் A </0> என்றும் அழைக்கப்படுகிறது. உங்கள் ராச்பிப்லிட்சில் உள்நுழைய இந்த கடவுச்சொல்லைப் பயன்படுத்தவும்.

# translation.setup.password_a_name
source: Node Password
ta: முனை கடவுச்சொல்

# translation.setup.password_a_short
source: Set your <0>Node</0> password
ta: உங்கள் <0> முனை </0> கடவுச்சொல்லை அமைக்கவும்

# translation.setup.password_b_details
source: Also known as <0>Password B</0>. Some apps require a password to install.
ta: <0> கடவுச்சொல் பி </0> என்றும் அழைக்கப்படுகிறது. சில பயன்பாடுகளுக்கு கடவுச்சொல் நிறுவ வேண்டும்.

# translation.setup.password_b_name
source: Apps Password
ta: பயன்பாடுகளின் கடவுச்சொல்

# translation.setup.password_b_short
source: Set your <0>Apps</0> password
ta: உங்கள் <0> பயன்பாடுகள் </0> கடவுச்சொல்லை அமைக்கவும்

# translation.setup.password_c_details
source: Also known as <0>Password C</0>. This will be used to access your lightning or bitcoin wallet.
ta: <0> கடவுச்சொல் சி </0> என்றும் அழைக்கப்படுகிறது. உங்கள் மின்னல் அல்லது பிட்காயின் பணப்பையை அணுக இது பயன்படுத்தப்படும்.

# translation.setup.password_c_name
source: Wallet Password
ta: பணப்பையை கடவுச்சொல்

# translation.setup.password_c_short
source: Set your <0>Wallet</0> Password
ta: உங்கள் <0> பணப்பையை அமைக்கவும் </0> கடவுச்சொல்லை அமைக்கவும்

# translation.setup.password_error_chars
source: Password should just contain characters & numbers.
ta: கடவுச்சொல்லில் எழுத்துக்கள் மற்றும் எண்கள் இருக்க வேண்டும்.

# translation.setup.password_error_empty
source: Password cannot be empty.
ta: கடவுச்சொல் காலியாக இருக்க முடியாது.

# translation.setup.password_error_length
source: Password needs to be at least 8 characters long.
ta: கடவுச்சொல் குறைந்தது 8 எழுத்துக்கள் நீளமாக இருக்க வேண்டும்.

# translation.setup.password_error_match
source: Passwords do not match.
ta: கடவுச்சொற்கள் பொருந்தவில்லை.

# translation.setup.password_repeat
source: Repeat
ta: மீண்டும்

# translation.setup.pleasewait
source: Please wait
ta: தயவுசெய்து காத்திருங்கள்

# translation.setup.preparingsetup
source: Preparing setup
ta: அமைப்பைத் தயாரித்தல்

# translation.setup.recoverblitz
source: Recover
ta: மீட்க

# translation.setup.restartinfo
source: Please wait until RaspiBlitz answers again
ta: ராச்பிப்லிட்ச் மீண்டும் பதிலளிக்கும் வரை காத்திருங்கள்

# translation.setup.restarting
source: Restarting
ta: மறுதொடக்கம்

# translation.setup.restarts
source: Restarts
ta: மறுதொடக்கம் செய்கிறது

# translation.setup.runningsetup
source: Running Setup
ta: இயங்கும் அமைப்பு

# translation.setup.none
source: Bitcoin Full Node Without Lightning
ta: மின்னல் இல்லாமல் பிட்காயின் முழு முனை

# translation.setup.none_description
source: Running a Bitcoin full node without any Lightning Network implementation involves participating directly in the Bitcoin network by validating transactions and blocks.
ta: எந்தவொரு மின்னல் பிணையம் செயல்படுத்தும் இல்லாமல் பிட்காயின் முழு முனையை இயக்குவது பரிவர்த்தனைகள் மற்றும் தொகுதிகளை சரிபார்ப்பதன் மூலம் பிட்காயின் நெட்வொர்க்கில் நேரடியாக பங்கேற்பதை உள்ளடக்குகிறது.

# translation.setup.select_lightning
source: Which lightning implementation would you like to install
ta: எந்த மின்னல் செயல்படுத்தல் நீங்கள் நிறுவ விரும்புகிறீர்களா?

# translation.setup.select_lightning_help
source: What the difference? <0>Learn more</0> about each implementation.
ta: என்ன வித்தியாசம்? <0> மேலும் அறிக </0> ஒவ்வொரு செயலாக்கத்தையும் பற்றி.

# translation.setup.setupblitz
source: Fresh Setup
ta: புதிய அமைப்பு

# translation.setup.setupoptions
source: Setup Options
ta: அமைவு விருப்பங்கள்

# translation.setup.setupwait
source: Setup will take some minutes
ta: அமைப்பு சில நிமிடங்கள் ஆகும்

# translation.setup.shuttingdown
source: Shutting down
ta: மூடுவது

# translation.setup.start_recovery
source: Would you like to start the recovery process?
ta: மீட்பு செயல்முறையைத் தொடங்க விரும்புகிறீர்களா?

# translation.setup.start_update
source: Would you like to start the update and recovery process?
ta: புதுப்பிப்பு மற்றும் மீட்பு செயல்முறையைத் தொடங்க விரும்புகிறீர்களா?

# translation.setup.started
source: started
ta: தொடங்கியது

# translation.setup.not_started
source: did not start
ta: தொடங்கவில்லை

# translation.setup.sync_bitcoin_starting
source: Starting sync
ta: ஒத்திசைவு தொடங்குகிறது

# translation.setup.sync_bitcoin_sync
source: Sync Progress
ta: முன்னேற்றத்தை ஒத்திசைக்கவும்

# translation.setup.sync_headline
source: Initial Sync in Progress
ta: ஆரம்ப ஒத்திசைவு செயலில் உள்ளது

# translation.setup.sync_restartinfo
source: (sync will continue on next restart)
ta: (அடுத்த மறுதொடக்கத்தில் ஒத்திசைவு தொடரும்)

# translation.setup.sync_wallet_info
source: Please unlock your Lightning Wallet (Password C):
ta: உங்கள் மின்னல் பணப்பையை திறக்கவும் (கடவுச்சொல் சி):

# translation.setup.sync_wallet_unlock
source: Unlock Wallet
ta: பணப்பையை திறக்கவும்

# translation.setup.updateblitz
source: Update
ta: புதுப்பிப்பு

# translation.setup.yes
source: Yes
ta: ஆம்

# translation.setup.yes_and_migrate
source: Migrate to RaspiBlitz
ta: ராச்பிப்லிட்சுக்கு இடம்பெயரவும்

# translation.tx.comment
source: Comment
ta: கருத்து

# translation.tx.comment_placeholder
source: Optional comment
ta: விருப்ப கருத்து

# translation.tx.confirm_info
source: Please confirm the following transaction
ta: பின்வரும் பரிவர்த்தனையை உறுதிப்படுத்தவும்

# translation.tx.confirmations
source: Confirmations
ta: உறுதிப்படுத்தல்கள்

# translation.tx.date
source: Date
ta: திகதி

# translation.tx.description
source: Description
ta: விவரம்

# translation.tx.fee
source: Fee
ta: கட்டணம்

# translation.tx.fee_rate
source: Fee rate
ta: கட்டண விகிதம்

# translation.tx.included_block
source: Included in Block
ta: தொகுதியில் சேர்க்கப்பட்டுள்ளது

# translation.tx.mempool
source: View on mempool
ta: மெம்பூலில் காண்க

# translation.tx.sent
source: Transaction sent!
ta: பரிவர்த்தனை அனுப்பப்பட்டது!

# translation.tx.spend_all
source: Spend all on-chain funds
ta: அனைத்து சங்கிலி நிதிகளையும் செலவிடுங்கள்

# translation.tx.all_onchain
source: All on-chain funds
ta: அனைத்து சங்கிலி நிதிகள்

# translation.tx.transactions
source: Transactions
ta: பரிவர்த்தனைகள்

# translation.tx.transactions_none
source: No transactions yet, time to make your first one
ta: இன்னும் பரிவர்த்தனைகள் இல்லை, உங்கள் முதல் ஒன்றை உருவாக்க நேரம்

# translation.tx.tx_details
source: Transaction Details
ta: பரிவர்த்தனை விவரங்கள்

# translation.tx.txid
source: Transaction ID
ta: பரிவர்த்தனை ஐடி

# translation.tx.unconfirmed
source: Unconfirmed
ta: உறுதிப்படுத்தப்படாதது

# translation.tx.value
source: Value
ta: மதிப்பு

# translation.wallet.address
source: Address
ta: முகவரி

# translation.wallet.amount
source: Amount
ta: தொகை

# translation.wallet.balance
source: Balance
ta: இருப்பு

# translation.wallet.available_balance
source: Available balance
ta: கிடைக்கும் இருப்பு

# translation.wallet.confirm
source: Confirm
ta: உறுதிப்படுத்தவும்

# translation.wallet.copied
source: Copied!
ta: நகலெடுக்கப்பட்டது!

# translation.wallet.copy_clipboard
source: Copy to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கவும்

# translation.wallet.create_invoice
source: Create invoice
ta: விலைப்பட்டியல் உருவாக்கவும்

# translation.wallet.create_invoice_ln
source: Create a Lightning invoice
ta: மின்னல் விலைப்பட்டியல் உருவாக்கவும்

# translation.wallet.fund
source: Fund your on-chain wallet
ta: உங்கள் ஆன்-சங்கிலி பணப்பையை நிதியளிக்கவும்

# translation.wallet.invoice
source: Invoice
ta: விலைப்பட்டியல்

# translation.wallet.on_chain
source: On-chain
ta: ஆன்-சங்கிலி

# translation.wallet.receive
source: Receive
ta: பெறுங்கள்

# translation.wallet.receive_aria_options
source: Receive options Lightning or On-chain
ta: விருப்பங்கள் மின்னல் அல்லது ஆன்-சங்கிலியைப் பெறுங்கள்

# translation.wallet.refresh
source: Refresh address
ta: முகவரியைப் புதுப்பிக்கவும்

# translation.wallet.scan_qr
source: Scan this QR code or copy the address below to receive funds
ta: இந்த QR குறியீட்டை ச்கேன் செய்யுங்கள் அல்லது நிதியைப் பெற கீழே உள்ள முகவரியை நகலெடுக்கவும்

# translation.wallet.send
source: Send
ta: அனுப்பு

# translation.wallet.send_lightning
source: Send funds over Lightning
ta: மின்னல் மீது பொருள் அனுப்பவும்

# translation.wallet.send_onchain
source: Send funds On-chain
ta: சங்கிலியில் நிதிகளை அனுப்பவும்

# translation.wallet.unlock
source: Unlock
ta: திறக்க

# translation.wallet.unlock_subtitle
source: Unlock your Lightning wallet
ta: உங்கள் மின்னல் பணப்பையை திறக்கவும்

# translation.wallet.unlock_success
source: Lightning wallet unlocked
ta: மின்னல் பணப்பையை திறக்கப்பட்டது

# translation.wallet.unlock_title
source: Unlock Wallet
ta: பணப்பையை திறக்கவும்

# translation.wallet.unlocking
source: Unlocking
ta: திறத்தல்

# translation.wallet.wallet_locked
source: Lightning wallet locked
ta: மின்னல் பணப்பையை பூட்டியது

# translation.wallet.wallet_unlock_info
source: To prevent additional sync time for your Lightning node, please also unlock your Lightning wallet.
ta: உங்கள் மின்னல் முனைக்கு கூடுதல் ஒத்திசைவு நேரத்தைத் தடுக்க, தயவுசெய்து உங்கள் மின்னல் பணப்பையை திறக்கவும்.

# translation.error.stack
source: Stack trace
ta: ச்டாக் சுவடு

# translation.error.report
source: Please report this error to
ta: இந்த பிழையைப் புகாரளிக்கவும்
