Repository: 247i/TACETr
Catalog: உரை/வெறுமை/raspiblitz-web-translations-*.po
Languages: ta

# translation.appInfo.btc-rpc-explorer.about
source: This is a self-hosted explorer for the Bitcoin blockchain, driven by RPC calls to your own Bitcoin node. It is easy to run and can be connected to other tools (like Electrum servers) to achieve a full-featured explorer.
ta: இது பிட்காயின் பிளாக்செயினுக்கான சுய-ஓச்ட் எக்ச்ப்ளோரர் ஆகும், இது உங்கள் சொந்த பிட்காயின் முனைக்கு ஆர்.பி.சி அழைப்புகளால் இயக்கப்படுகிறது. இது இயக்க எளிதானது மற்றும் முழு அம்சமான எக்ச்ப்ளோரரை அடைய மற்ற கருவிகளுடன் (எலக்ட்ரம் சேவையகங்கள் போன்றவை) இணைக்கப்படலாம்.

# translation.appInfo.btc-rpc-explorer.shortDescription
source: Bitcoin RPC Explorer
ta: பிட்காயின் ஆர்.பி.சி எக்ச்ப்ளோரர்

# translation.appInfo.btcpayserver.about
source: BTCPay Server is a free and open-source Bitcoin payment processor which allows you to accept bitcoin without fees or intermediaries.
ta: BTCPAY சேவையகம் என்பது ஒரு இலவச மற்றும் திறந்த மூல பிட்காயின் கட்டண செயலியாகும், இது கட்டணம் அல்லது இடைத்தரகர்கள் இல்லாமல் பிட்காயினை ஏற்க உங்களை அனுமதிக்கிறது.

# translation.appInfo.btcpayserver.shortDescription
source: Accept Bitcoin payments. Free, open-source & self-hosted, Bitcoin payment processor.
ta: பிட்காயின் கொடுப்பனவுகளை ஏற்றுக்கொள்ளுங்கள். இலவச, திறந்த மூல மற்றும் சுய-ஓச்ட், பிட்காயின் கட்டண செயலி.

# translation.appInfo.btcpayserver.ram_warning
source: Your system has less than the recommended 8GB of RAM to run BTCPayServer on RaspiBlitz. This could lead to instability if you proceed with the installation.
ta: ராச்பிப்லிட்சில் BTCPayserver ஐ இயக்க பரிந்துரைக்கப்பட்ட 8 சிபி ரேம் விட உங்கள் கணினி குறைவாக உள்ளது. நீங்கள் நிறுவலுடன் தொடர்ந்தால் இது உறுதியற்ற தன்மைக்கு வழிவகுக்கும்.

# translation.appInfo.lnbits.about
source: LNbits is a very simple Python server that sits on top of any funding source, and can be used as an accounts system to mitigate the risk of exposing applications to your full balance, via unique API keys for each wallet.
ta: LNBITS என்பது எந்தவொரு பொருள் மூலத்திற்கும் மேலாக அமர்ந்திருக்கும் மிக எளிய பைதான் சேவையகமாகும், மேலும் ஒவ்வொரு பணப்பையிலும் தனித்துவமான பநிஇ விசைகள் வழியாக, உங்கள் முழு சமநிலைக்கு பயன்பாடுகளை வெளிப்படுத்தும் அபாயத்தைத் தணிக்க ஒரு கணக்கு அமைப்பாக பயன்படுத்தலாம்.

# translation.appInfo.lnbits.shortDescription
source: Free and open-source lightning-network wallet/accounts system
ta: இலவச மற்றும் திறந்த மூல மின்னல்-நெட்வொர்க் பணப்பை/கணக்கு அமைப்பு

# translation.appInfo.mempool.about
source: An open-source explorer developed for the Bitcoin community, focusing on the emerging transaction fee market to help our transition into a multi-layer ecosystem.
ta: பிட்காயின் சமூகத்திற்காக ஒரு திறந்த-மூல ஆய்வாளர் உருவாக்கப்பட்டது, வளர்ந்து வரும் பரிவர்த்தனை கட்டண சந்தையில் கவனம் செலுத்தி, எங்கள் பல அடுக்கு சுற்றுச்சூழல் அமைப்பாக மாற்ற உதவுகிறது.

# translation.appInfo.mempool.shortDescription
source: An open-source explorer developed for the Bitcoin community
ta: பிட்காயின் சமூகத்திற்காக ஒரு திறந்த மூல எக்ச்ப்ளோரர் உருவாக்கப்பட்டது

# translation.appInfo.rtl.about
source: RTL is a full function, device agnostic, web user interface to help manage Lightning node operations. RTL is available on LND, Core Lightning and Eclair implementations.
ta: ஆர்.டி.எல் என்பது மின்னல் முனை செயல்பாடுகளை நிர்வகிக்க உதவும் முழு செயல்பாடு, சாதன அஞ்ஞான, வலை பயனர் இடைமுகமாகும். ஆர்.டி.எல் எல்.என்.டி, கோர் மின்னல் மற்றும் எக்லேர் செயலாக்கங்களில் கிடைக்கிறது.

# translation.appInfo.rtl.shortDescription
source: A full function web browser app for LND, Core Lightning and Eclair
ta: எல்.என்.டி, கோர் மின்னல் மற்றும் எக்லேர் ஆகியவற்றிற்கான முழு செயல்பாட்டு வலை உலாவி பயன்பாடு

# translation.appInfo.specter.about
source: Bitcoin Core has a very powerful command line interface and a wonderful daemon. Using PSBT and HWI it can also work with hardware wallets, but at the moment it is too linux-way. The same applies to multisignature setups. The goal of this project is to make a convenient and user-friendly GUI around Bitcoin Core with a focus on multisignature setup with hardware wallets and airgapped devices.
ta: பிட்காயின் கோர் மிகவும் சக்திவாய்ந்த கட்டளை வரி இடைமுகம் மற்றும் அற்புதமான டீமான் உள்ளது. PSBT மற்றும் HWI ஐப் பயன்படுத்தி இது வன்பொருள் பணப்பைகள் மூலம் வேலை செய்யலாம், ஆனால் இந்த நேரத்தில் அது மிகவும் லினக்ச்-வழி. பன்முகத்தன்மை அமைப்புகளுக்கும் இது பொருந்தும். இந்த திட்டத்தின் குறிக்கோள், வன்பொருள் பணப்பைகள் மற்றும் ஏர்கிரப் சாதனங்களுடன் மல்டிசிக்னேச்சர் அமைப்பை மையமாகக் கொண்டு பிட்காயின் கோரைச் சுற்றி ஒரு வசதியான மற்றும் பயனர் நட்பு GUI ஐ உருவாக்குவதாகும்.

# translation.appInfo.specter.shortDescription
source: A desktop GUI for Bitcoin Core optimised to work with hardware wallets
ta: பிட்காயின் கோருக்கு டெச்க்டாப் சி.யு.ஐ வன்பொருள் பணப்பைகளுடன் வேலை செய்ய உகந்ததாக உள்ளது

# translation.appInfo.thunderhub.about
source: ThunderHub is an open-source LND node manager where you can manage and monitor your node on any device or browser. It allows you to take control of the lightning network with a simple and intuitive UX and the most up-to-date tech stack.
ta: தண்டர்அப் என்பது ஒரு திறந்த மூல எல்.என்.டி முனை மேலாளராகும், அங்கு எந்தவொரு சாதனம் அல்லது உலாவியில் உங்கள் முனையை நிர்வகிக்கவும் கண்காணிக்கவும் முடியும். எளிமையான மற்றும் உள்ளுணர்வு யுஎக்ச் மற்றும் மிகவும் புதுப்பித்த தொழில்நுட்ப அடுக்குடன் மின்னல் நெட்வொர்க்கின் கட்டுப்பாட்டை எடுக்க இது உங்களை அனுமதிக்கிறது.

# translation.appInfo.thunderhub.shortDescription
source: LND Lightning Node Manager in your Browser
ta: உங்கள் உலாவியில் எல்.என்.டி மின்னல் முனை மேலாளர்

# translation.appInfo.jam.about
source: Jam is a web interface for JoinMarket focusing on user-friendliness and ease-of-use. It aims to provide sensible defaults and be easy to use for beginners while still having the features advanced users expect.
ta: சாம் என்பது சாய்மார்க்கெட்டுக்கான ஒரு வலை இடைமுகமாகும், இது பயனர் நட்பு மற்றும் எளிதான பயன்பாட்டை மையமாகக் கொண்டது. மேம்பட்ட பயனர்கள் எதிர்பார்க்கும் அம்சங்களைக் கொண்டிருக்கும்போது, ​​விவேகமான இயல்புநிலைகளை வழங்குவதையும், ஆரம்பநிலைக்கு பயன்படுத்த எளிதாகவும் இருக்கும்.

# translation.appInfo.jam.shortDescription
source: Jam - A web interface for JoinMarket
ta: சாம் - சாய்மார்க்கெட்டுக்கான வலை இடைமுகம்

# translation.appInfo.electrs.about
source: Electrs is an efficient re-implementation of Electrum Server in Rust. It indexes the entire Bitcoin blockchain, and allows your Lightning node to query it for on-chain transactions.
ta: எலக்ட்ரெச் என்பது துருப்பிடிப்பதில் எலக்ட்ரம் சேவையகத்தின் திறமையான மறு செயல்படுத்தல் ஆகும். இது முழு பிட்காயின் பிளாக்செயினையும் குறியீடாக்குகிறது, மேலும் உங்கள் மின்னல் முனையை சங்கிலி பரிவர்த்தனைகளுக்கு வினவ அனுமதிக்கிறது.

# translation.appInfo.electrs.shortDescription
source: Efficient re-implementation of Electrum Server in Rust
ta: துருவில் எலக்ட்ரம் சேவையகத்தின் திறமையாக மறு செயல்படுத்தல்

# translation.appInfo.electrs.initialSync
source: The index database needs to be created before Electrum Server can be used. This can take hours / days depending on your RaspiBlitz. Please check back later.
ta: எலக்ட்ரம் சேவையகத்தைப் பயன்படுத்துவதற்கு முன்பு குறியீட்டு தரவுத்தளத்தை உருவாக்க வேண்டும். இது உங்கள் ராச்பிப்லிட்சைப் பொறுத்து மணிநேரம் / நாட்கள் ஆகலாம். பின்னர் சரிபார்க்கவும்.

# translation.appInfo.electrs.connectLocal
source: Connect to Electrum Server over your Local Network
ta: உங்கள் உள்ளக பிணையத்தில் எலக்ட்ரம் சேவையகத்துடன் இணைக்கவும்

# translation.appInfo.electrs.connectTor
source: Connect to Electrum Server over Tor
ta: TOR க்கு மேல் எலக்ட்ரம் சேவையகத்துடன் இணைக்கவும்

# translation.appInfo.electrs.connectionInfo
source: These addresses allow you to connect your wallet or other applications to your node using Electrs. Use the local connection if you are on the same network as your node or the Tor address for remote access with enhanced privacy.
ta: இந்த முகவரிகள் உங்கள் பணப்பையை அல்லது பிற பயன்பாடுகளை எலக்ட்ரெசைப் பயன்படுத்தி உங்கள் முனையுடன் இணைக்க அனுமதிக்கின்றன. மேம்பட்ட தனியுரிமையுடன் தொலைநிலை அணுகலுக்கான உங்கள் முனை அல்லது டோர் முகவரியில் நீங்கள் இருந்தால் உள்ளக இணைப்பைப் பயன்படுத்தவும்.

# translation.appInfo.electrs.not_available
source: address not available
ta: முகவரி கிடைக்கவில்லை

# translation.appInfo.albyhub.about
source: Alby Hub allows you to control your Lightning node or wallet from any other application that supports NWC. Connect apps like Damus or Amethyst to your node.
ta: NWC ஐ ஆதரிக்கும் வேறு எந்த பயன்பாட்டிலிருந்தும் உங்கள் மின்னல் முனை அல்லது பணப்பையை கட்டுப்படுத்த ஆல்பி அப் உங்களை அனுமதிக்கிறது. டாமச் அல்லது அமேதிச்ட் போன்ற பயன்பாடுகளை உங்கள் முனையுடன் இணைக்கவும்.

# translation.appInfo.albyhub.shortDescription
source: Alby Hub - Your Own Center for Internet Money
ta: ஆல்பி அப் - இணைய பணத்திற்கான உங்கள் சொந்த நடுவண்

# translation.appInfo.alby.about
source: Alby Browser Extension
ta: ஆல்பி உலாவி நீட்டிப்பு

# translation.appInfo.alby.shortDescription
source: Connect your RaspiBlitz LND node and use Bitcoin & Nostr apps with the Alby Extension
ta: உங்கள் ராச்பிப்லிட்ச் எல்.என்.டி முனையை இணைத்து, ஆல்பி நீட்டிப்புடன் பிட்காயின் & நோச்ட் பயன்பாடுகளைப் பயன்படுத்தவும்

# translation.appInfo.alby.action.install
source: Install
ta: நிறுவவும்

# translation.appInfo.alby.action.addAccount
source: Connect
ta: இணை

# translation.appInfo.alby.action.connection_info_error
source: Could not get connection info
ta: இணைப்பு தகவலைப் பெற முடியவில்லை

# translation.appInfo.alby.action.connection.hint
source: Please install the Alby extension first
ta: முதலில் ஆல்பி நீட்டிப்பை நிறுவவும்

# translation.appInfo.alby.action.connection.success
source: Raspiblitz account was added to Alby
ta: ராச்பிப்லிட்ச் கணக்கு ஆல்பியில் சேர்க்கப்பட்டது

# translation.appInfo.alby.action.connection.error
source: Adding Raspiblitz to Alby didn't work, please try again
ta: ஆல்பிப்பில் ராச்பிப்லிட்சைச் சேர்ப்பது வேலை செய்யவில்லை, தயவுசெய்து மீண்டும் முயற்சிக்கவும்

# translation.apps.about
source: About
ta: பற்றி

# translation.apps.author
source: Author
ta: நூலாசிரியர்

# translation.apps.available
source: Available Apps
ta: கிடைக்கும் பயன்பாடுகள்

# translation.apps.info
source: Info
ta: தகவல்

# translation.apps.install
source: Install
ta: நிறுவவும்

# translation.apps.install_failure
source: Installation of {{appName}} failed: {{details}}
ta: {{appName}}} இன் நிறுவல் தோல்வியுற்றது: {{details}}

# translation.apps.install_success
source: {{appName}} installed successfully
ta: {{appName}} வெற்றிகரமாக நிறுவப்பட்டுள்ளது

# translation.apps.installed
source: Installed
ta: நிறுவப்பட்டது

# translation.apps.installing
source: Installing
ta: நிறுவுகிறது

# translation.apps.login_admin_pass_b
source: Login with User 'admin' & Password B
ta: பயனர் 'நிர்வாகி' மற்றும் கடவுச்சொல்லுடன் உள்நுழைக b

# translation.apps.login_no_pass
source: Login without Password
ta: கடவுச்சொல் இல்லாமல் உள்நுழைக

# translation.apps.login_pass_b
source: Login with Password B
ta: கடவுச்சொல்லுடன் உள்நுழைக ஆ

# translation.apps.login_userdef
source: Login with user-defined Password
ta: பயனர் வரையறுக்கப்பட்ட கடவுச்சொல்லுடன் உள்நுழைக

# translation.apps.no_page
source: No page available
ta: எந்தப் பக்கமும் கிடைக்கவில்லை

# translation.apps.offline
source: offline
ta: இணையமில்லாமல்

# translation.apps.online
source: online
ta: ஆன்லைனில்

# translation.apps.open
source: Open
ta: திற

# translation.apps.selfsigned_cert
source: This app uses a self-signed HTTPS certificate
ta: இந்த பயன்பாடு தன்வய கையொப்பமிடப்பட்ட HTTPS சான்றிதழைப் பயன்படுத்துகிறது

# translation.apps.source
source: Source code
ta: மூலக் குறியீடு

# translation.apps.uninstall
source: Uninstall
ta: நிறுவல் நீக்க

# translation.apps.uninstall_failure
source: Uninstall of {{appName}} failed: {{details}}
ta: {{appName}} தோல்வியுற்றது: {{details}}

# translation.apps.uninstall_success
source: Successfully uninstalled {{appName}}
ta: வெற்றிகரமாக நிறுவல் நீக்கப்பட்டது {{appName}}

# translation.apps.uninstalling
source: Uninstalling
ta: நிறுவல் நீக்குதல்

# translation.forms.hint.invoiceAmountZero
source: Invoice amount is zero
ta: விலைப்பட்டியல் தொகை பூச்சியம்

# translation.forms.validation.amount.required
source: Please input an amount
ta: ஒரு தொகையை உள்ளிடவும்

# translation.forms.validation.chainAddress.patternMismatch
source: Wrong address format
ta: தவறான முகவரி வடிவம்

# translation.forms.validation.chainAddress.required
source: Please input a Bitcoin address
ta: பிட்காயின் முகவரியை உள்ளிடவும்

# translation.forms.validation.chainAmount.max
source: Your balance is too low to send this amount
ta: இந்த தொகையை அனுப்ப உங்கள் இருப்பு மிகக் குறைவு

# translation.forms.validation.chainAmount.required
source: Please input an amount
ta: ஒரு தொகையை உள்ளிடவும்

# translation.forms.validation.chainFee.required
source: Please input a fee amount
ta: கட்டணத் தொகையை உள்ளிடவும்

# translation.forms.validation.lnInvoice.expired
source: Invoice expired
ta: விலைப்பட்டியல் காலாவதியானது

# translation.forms.validation.lnInvoice.max
source: Your balance is too low to pay this invoice
ta: இந்த விலைப்பட்டியல் செலுத்த உங்கள் இருப்பு மிகக் குறைவு

# translation.forms.validation.lnInvoice.patternMismatch
source: Wrong invoice format
ta: தவறான விலைப்பட்டியல் வடிவம்

# translation.forms.validation.lnInvoice.required
source: Please input a Lightning invoice
ta: மின்னல் விலைப்பட்டியல் உள்ளிடவும்

# translation.forms.validation.node_uri.required
source: Please input a node URI
ta: தயவுசெய்து ஒரு முனை யூரி ஐ உள்ளிடவும்

# translation.forms.validation.unlock.pass_c
source: Password C
ta: கடவுச்சொல் c

# translation.forms.validation.unlock.required
source: Password C is required
ta: கடவுச்சொல் சி தேவை

# translation.forms.validation.login.required
source: Password A is required
ta: கடவுச்சொல் A தேவை

# translation.hardware.cpu_load
source: CPU Load
ta: சிபியு சுமை

# translation.hardware.disk_usage
source: Disk Space used
ta: வட்டு இடம் பயன்படுத்தப்படுகிறது

# translation.hardware.header
source: Hardware Details
ta: வன்பொருள் விவரங்கள்

# translation.hardware.ram_usage
source: RAM Usage
ta: ராம் பயன்பாடு

# translation.hardware.temp
source: Temperature
ta: வெப்பநிலை

# translation.home.active
source: Active
ta: செயலில்

# translation.home.bitcoin
source: Bitcoin
ta: பிட்காயின்

# translation.home.blockchain_size
source: Blockchain Size
ta: பிளாக்செயின் அளவு

# translation.home.blocks_synced
source: Blocks synced
ta: தொகுதிகள் ஒத்திசைக்கப்படுகின்றன

# translation.home.blocktime
source: Blocktime
ta: தடுப்பு நேரம்

# translation.home.channel
source: Channel
ta: வாய்க்கால்

# translation.home.channel_balance
source: Channel Balance
ta: சேனல் இருப்பு

# translation.home.channel_closed
source: Channel closed successfully
ta: சேனல் வெற்றிகரமாக மூடப்பட்டது

# translation.home.channel_id
source: Channel ID
ta: சேனல் ஐடி

# translation.home.channel_opened
source: Channel opened successfully
ta: சேனல் வெற்றிகரமாக திறக்கப்பட்டது

# translation.home.close_channel
source: Close Channel
ta: சேனலை மூடு

# translation.home.confirm_channel_close
source: Confirm Channel close
ta: சேனலை நெருக்கமாக உறுதிப்படுத்தவும்

# translation.home.conn_details
source: Connection Details
ta: இணைப்பு விவரங்கள்

# translation.home.conn_in
source: Incoming
ta: உள்வரும்

# translation.home.conn_out
source: Outgoing
ta: வெளிச்செல்லும்

# translation.home.connections
source: Connections
ta: இணைப்புகள்

# translation.home.current_open_channels
source: Current open Channels
ta: தற்போதைய திறந்த சேனல்கள்

# translation.home.difficulty
source: Difficulty
ta: தொல்லை

# translation.home.force_close
source: Force close
ta: மூடு

# translation.home.hide
source: Hide
ta: மறை

# translation.home.lightning
source: Lightning
ta: மின்னல்

# translation.home.list_open_channels
source: List Channel
ta: பட்டியல் சேனல்

# translation.home.local_balance
source: Local Channel Balance
ta: உள்ளக சேனல் இருப்பு

# translation.home.network
source: Network
ta: பிணையம்

# translation.home.no
source: No
ta: இல்லை

# translation.home.no_open_channels
source: You currently have no open channels
ta: உங்களிடம் தற்போது திறந்த சேனல்கள் இல்லை

# translation.home.node_id
source: NodeID
ta: நோடிட்

# translation.home.node_uri
source: Node URI
ta: பின்னர் விற்கவும்

# translation.home.normal
source: Normal
ta: சாதாரண

# translation.home.onchain_cln_no_support
source: On-chain transactions made before RaspiBlitz v1.9 may not show up with Core Lightning
ta: ராச்பிப்லிட்ச் வி 1.9 க்கு முன் செய்யப்பட்ட ஆன்-சங்கிலி பரிவர்த்தனைகள் கோர் மின்னலுடன் காட்டப்படாது

# translation.home.open_channel
source: Open Channel
ta: திறந்த சேனல்

# translation.home.pending_balance_local
source: Pending Local Balance
ta: உள்ளக இருப்பு நிலுவையில் உள்ளது

# translation.home.pending_balance_remote
source: Pending Remote Balance
ta: தொலைநிலை சமநிலை நிலுவையில் உள்ளது

# translation.home.remote_balance
source: Remote Channel Balance
ta: தொலை சேனல் இருப்பு

# translation.home.show
source: Show
ta: காட்டு

# translation.home.show_qr
source: Show QR Code
ta: QR குறியீட்டைக் காட்டு

# translation.home.connect_node
source: Share this address with others so they can connect to your lightning node
ta: இந்த முகவரியை மற்றவர்களுடன் பகிர்ந்து கொள்ளுங்கள், இதனால் அவர்கள் உங்கள் மின்னல் முனையுடன் இணைக்க முடியும்

# translation.home.slow
source: Slow
ta: மெதுவாக

# translation.home.ssh
source: SSH login
ta: பாஓடு உள்நுழைவு

# translation.home.status
source: Status
ta: நிலை

# translation.home.tor
source: Tor
ta: டோர்

# translation.home.urgent
source: Urgent
ta: விரைவு

# translation.home.version
source: Version
ta: பதிப்பு

# translation.home.versions
source: Versions
ta: பதிப்புகள்

# translation.home.webui
source: WebUI
ta: பின்னப்பட்ட

# translation.home.not_available
source: Not available
ta: கிடைக்கவில்லை

# translation.language.cs
source: Czech
ta: செக்

# translation.language.de
source: German
ta: செர்மன்

# translation.language.en
source: English
ta: ஆங்கிலம்

# translation.language.es
source: Spanish
ta: ச்பானிச்

# translation.language.fr
source: French
ta: பிரஞ்சு

# translation.language.hu
source: Hungarian
ta: அங்கேரியன்

# translation.language.it
source: Italian
ta: இத்தாலிய

# translation.language.nb_NO
source: Norvegian
ta: நோர்வே

# translation.language.nl
source: Dutch
ta: டச்சு

# translation.language.pt
source: Portuguese
ta: போர்த்துகீசியம்

# translation.language.pt_BR
source: Portuguese (Brazilian)
ta: போர்த்துகீசியம் (பிரேசிலிய)

# translation.language.sv
source: Swedish
ta: ச்வீடிச்

# translation.language.vi
source: Vietnamese
ta: வியட்நாமிய

# translation.login.enter_pass
source: Enter password A
ta: கடவுச்சொல்லை உள்ளிடவும் a

# translation.login.enter_pass_placeholder
source: Password A
ta: கடவுச்சொல் a

# translation.login.error
source: An error occurred
ta: பிழை ஏற்பட்டது

# translation.login.unknown_error
source: Unknown error. The response was: {{code}} {{statusText}}.
ta: தெரியாத பிழை. பதில்: {{code}} {{statusText}}.

# translation.login.invalid_pass
source: Invalid password
ta: தவறான கடவுச்சொல்

# translation.login.login
source: Log in
ta: புகுபதிகை

# translation.login.caps_lock
source: Caps Lock is ON
ta: தொப்பிகள் பூட்டு இயக்கத்தில் உள்ளது

# translation.navigation.apps
source: Apps
ta: பயன்பாடுகள்

# translation.navigation.back
source: Back
ta: பின்

# translation.navigation.dark_mode
source: Dark Mode
ta: இருண்ட முறை

# translation.navigation.display_sats
source: Display SATS
ta: சாட்சைக் காண்பி

# translation.navigation.display_btc
source: Display BTC
ta: பி.டி.சி.

# translation.navigation.home
source: Home
ta: வீடு

# translation.navigation.logout
source: Log out
ta: விடுபதிகை

# translation.navigation.documentation
source: Documentation
ta: ஆவணப்படுத்துதல்

# translation.navigation.settings
source: Settings
ta: அமைப்புகள்

# translation.settings.cancel
source: Cancel
ta: ரத்துசெய்

# translation.settings.change
source: Change
ta: மாற்றம்

# translation.settings.change_pw_a
source: Change Node Password (A)
ta: முனை கடவுச்சொல்லை மாற்றவும் (அ)

# translation.settings.confirm
source: Confirm
ta: உறுதிப்படுத்தவும்

# translation.settings.curr_lang
source: Current language
ta: தற்போதைய மொழி

# translation.settings.language
source: Language
ta: மொழி

# translation.settings.new_pw
source: New password
ta: புதிய கடவுச்சொல்

# translation.settings.old_pw
source: Old password
ta: பழைய கடவுச்சொல்

# translation.settings.pass_a_changed
source: Password A changed successfully
ta: கடவுச்சொல் வெற்றிகரமாக மாற்றப்பட்டது

# translation.settings.reboot
source: Reboot
ta: மறுதொடக்கம் செய்யுங்கள்

# translation.settings.shutdown
source: Shutdown
ta: பணிநிறுத்தம்

# translation.settings.shutdown_confirm
source: Shutdown your RaspiBlitz?
ta: உங்கள் ராச்பிப்லிட்சை பணிநிறுத்தம் செய்யவா?

# translation.settings.shutdown_info
source: When shutdown is complete the activity light turns red and the LCD turns white.
ta: பணிநிறுத்தம் முடிந்ததும் செயல்பாடு ஒளி சிவப்பு நிறமாக மாறும் மற்றும் எல்சிடி வெண்மையாக மாறும்.

# translation.settings.shutdown_info_disconnect_power
source: Then wait 5 seconds and disconnect power.
ta: பின்னர் 5 வினாடிகள் காத்திருந்து சக்தியைத் துண்டிக்கவும்.

# translation.settings.generate_debug
source: Generate Debug Report
ta: பிழைத்திருத்த அறிக்கையை உருவாக்குங்கள்

# translation.settings.generate
source: Generate
ta: உருவாக்கு

# translation.settings.generating
source: Generating
ta: உருவாக்குதல்

# translation.settings.generating_debug_report
source: Generating Debug Report. This can take some time.
ta: பிழைத்திருத்த அறிக்கையை உருவாக்குதல். இதற்கு சிறிது நேரம் ஆகலாம்.

# translation.settings.debug_report_done
source: Debug Report created!
ta: பிழைத்திருத்த அறிக்கை உருவாக்கப்பட்டது!

# translation.setup.step.step
source: Step
ta: படி

# translation.setup.step.step_1_description
source: Prepare Drive
ta: இயக்கி ஆயத்தம்

# translation.setup.step.step_2_description
source: Node Name
ta: முனை பெயர்

# translation.setup.step.step_3_description
source: Node Type
ta: முனை வகை

# translation.setup.step.step_4_description
source: Set Passwords
ta: கடவுச்சொற்களை அமைக்கவும்

# translation.setup.setupmenu.lets_setup
source: Let's setup your RaspiBlitz
ta: உங்கள் ராச்பிப்லிட்சை அமைப்போம்

# translation.setup.setupmenu.setup_time
source: The total setup process takes about 20 minutes
ta: மொத்த அமைவு செயல்முறை சுமார் 20 நிமிடங்கள் ஆகும்

# translation.setup.format.delete_drive
source: Would you like to proceed deleting all data on your drive?
ta: உங்கள் இயக்ககத்தில் உள்ள எல்லா தரவையும் நீக்க விரும்புகிறீர்களா?

# translation.setup.format.warn
source: Please back up any important data as this will wipe your drive!
ta: எந்தவொரு முக்கியமான தரவையும் காப்புப் பிரதி எடுக்கவும், ஏனெனில் இது உங்கள் இயக்ககத்தைத் துடைக்கும்!

# translation.setup.format.keep_blockchain
source: Keep Blockchain data
ta: பிளாக்செயின் தரவை வைத்திருங்கள்

# translation.setup.format.delete_confirm
source: Yes, delete all data
ta: ஆம், எல்லா தரவையும் நீக்கு

# translation.setup.input_node.header
source: What should we call your node?
ta: உங்கள் முனையை நாங்கள் என்ன அழைக்க வேண்டும்?

# translation.setup.input_node.err_only_chars
source: Nodename should just contain characters & numbers.
ta: NodeName இல் எழுத்துக்கள் மற்றும் எண்கள் இருக்க வேண்டும்.

# translation.setup.input_node.err_max_length
source: Node name must be at most 32 characters long.
ta: முனை பெயர் அதிகபட்சம் 32 எழுத்துக்கள் நீளமாக இருக்க வேண்டும்.

# translation.setup.input_node.err_min_length
source: Node name needs to be at least 4 characters long.
ta: முனை பெயர் குறைந்தது 4 எழுத்துக்கள் நீளமாக இருக்க வேண்டும்.

# translation.setup.input_node.err_empty
source: Node name cannot be empty.
ta: முனை பெயர் காலியாக இருக்க முடியாது.

# translation.setup.input_node.label
source: Node Name
ta: முனை பெயர்

# translation.setup.blockchain_delete
source: Delete Blockchain
ta: பிளாக்செயினை நீக்கு

# translation.setup.blockchain_found_long
source: On your HDD/SSD existing blockchain data was found.
ta: உங்கள் HDD/SSD இல் இருக்கும் பிளாக்செயின் தரவு கண்டறியப்பட்டது.

# translation.setup.blockchain_found_short
source: Blockchain found on HDD/SSD
ta: பிளாக்செயின் HDD/SSD இல் காணப்படுகிறது
