Repository: 247i/TACETr
Catalog: உரை/வெறுமை/ror-player-tune-description-nova-balanca-*.po
Languages: ta

source: The tune is rather easy to learn, because a lot of the voices and breaks are similar to other rhythms. Also there are kind of three groups which are each synchronized:
ta: ட்யூன் கற்றுக்கொள்வது மிகவும் எளிதானது, ஏனென்றால் நிறைய குரல்களும் இடைவெளிகளும் மற்ற தாளங்களுக்கு ஒத்தவை. ஒவ்வொன்றும் ஒத்திசைக்கப்பட்ட மூன்று குழுக்கள் உள்ளன:

source: Surdos playing after each other so it becomes a – quite slow – easy memorize-able melody.
ta: சூர்டோச் ஒருவருக்கொருவர் பின்னால் விளையாடுகிறார், எனவே இது ஒரு-மிகவும் மெதுவாக-எளிதான மனப்பாடம் செய்யக்கூடிய மெல்லிசையாக மாறும்.

source: Snare & Repi play basically the same line but desynchronized → it’s possible to base the one voice on the other
ta: SNARE & REPI அடிப்படையில் அதே வரியை விளையாடுகிறது, ஆனால் தேய்மானம் → ஒரு குரலை மற்றொன்றில் அடிப்படையாகக் கொள்ள முடியும்

source: Tambs & Agogô play the same, just that the Tambs have only one possible tone while the Agogô has two.
ta: டம்ப்ச் & அகோகே ஒரே மாதிரியாக விளையாடுகிறார்கள், டாம்ப்களுக்கு ஒரே ஒரு தொனி மட்டுமே உள்ளது, அதே நேரத்தில் அகோகே இரண்டு உள்ளது.

source: **Sign:** fists before breast, open hands and arms
ta: ** அடையாளம்: ** மார்பகத்திற்கு முன் கைமுட்டிகள், கைகள் மற்றும் கைகளைத் திறக்கவும்

source: Sign
ta: அடையாளம்

source: Nova balança Tune Sign
ta: புதிய டியூன் அடையாளம் இருப்பு

source: Fists before breast, open hands and arms
ta: மார்பகத்திற்கு முன் கைமுட்டிகள், கைகள் மற்றும் கைகளைத் திறக்கவும்

source: Background
ta: பின்னணி

source: **Name:** “Nova balança” means ‘new wave’ in brazilian. It’s part of a belief that the new wave will come and bring the deported slaves back home.
ta: ** பெயர்: ** “நோவா பாலனியா” என்றால் பிரேசிலில் ‘புதிய அலை’. புதிய அலை வந்து நாடு கடத்தப்பட்ட அடிமைகளை வீட்டிற்கு அழைத்து வரும் என்ற நம்பிக்கையின் ஒரு பகுதியாகும்.

source: **Musical background:** *(More info needed.)*
ta: ** இசை பின்னணி: ***(மேலும் செய்தி தேவை.)*

source: **Sign:** *(More info needed.)*
ta: ** அடையாளம்: ***(மேலும் செய்தி தேவை.)*

source: **History:** From RoR Maastricht.
ta: ** வரலாறு: ** ரோர் மாச்ட்ரிக்டிலிருந்து.

source: Difficulty
ta: தொல்லை

source: **Surdos:** medium
ta: ** காது கேளாதோர்: ** நடுத்தர

source: **Repi:** easy
ta: ** ரெபி: ** எளிதானது

source: **Snare:** easy
ta: ** SNARE: ** எளிதானது

source: **Tamborim:** easy
ta: ** தம்போரிம்: ** எளிதானது

source: **Agogô:** easy – in fact the same as in Karla Shnikov
ta: ** அகோகா: ** எளிதானது - உண்மையில் கார்லா ச்னிகோவ் போலவே

source: Breaks
ta: இடைவெளிகள்

source: Break 1 is basically the same as Funk break 2, but to be played from soft to really, really loud!!! Try not to speed up whilst you’re playing it.
ta: பிரேக் 1 அடிப்படையில் ஃபங்க் பிரேக் 2 ஐப் போன்றது, ஆனால் மென்மையாக இருந்து உண்மையில், மிகவும் சத்தமாக விளையாடப்பட வேண்டும் !!! நீங்கள் அதை விளையாடும்போது விரைவுபடுத்த வேண்டாம்.

source: Break 2 is kind of a kickback break, between the surdos and everyone else; it has the same rhythm as the afoxe tamborim line
ta: பிரேக் 2 என்பது சூர்டோசுக்கும் மற்ற அனைவருக்கும் இடையில் ஒரு கிக்பேக் இடைவெளி; இது அஃபாக்ச் தம்போரிம் வரியின் அதே தாளத்தைக் கொண்டுள்ளது

source: Call Break is a call and response between the snare and everyone else.
ta: அழைப்பு இடைவெளி என்பது கண்ணியத்திற்கும் மற்ற அனைவருக்கும் இடையிலான அழைப்பு மற்றும் பதில்.
