Repository: 247i/TACETr
Catalog: உரை/வெறுமை/ror-player-tune-description-ragga-*.po
Languages: ta

source: This tune is in a Tango-like-rhythm which goes along for 8 steps/two bars.
ta: இந்த ட்யூன் ஒரு டேங்கோ போன்ற தாளத்தில் உள்ளது, இது 8 படிகள்/இரண்டு பார்களுக்கு செல்கிறது.

source: The Surdos are the basis, the complete tune is build upon. In five of the six breaks they have a special role; in four of them, they call the call&response-breaks (Break 1, Break 3 and the Kickbacks 1&2) and in the ‘Zorro-Break’ they are the only ones playing, while everyone else just plays along. But also in the groove they have a special position, because they are (except the Agogôs) the only instrument, which plays on beat. Everyone else plays offbeat, thereby the whole tune is somehow turned into a call&response.
ta: சூர்டோக்கள் அடிப்படையாகும், முழுமையான இசை கட்டமைக்கப்பட்டுள்ளது. ஆறு இடைவெளிகளில் ஐந்தில் அவர்களுக்கு ஒரு சிறப்பு பங்கு உண்டு; அவற்றில் நான்கில், அவர்கள் அழைப்பு & மறுமொழி முறிவுகளை (பிரேக் 1, பிரேக் 3 மற்றும் கிக்பேக்குகள் 1 & 2) என்று அழைக்கிறார்கள், மேலும் ‘சோரோ-பிரேக்’ இல் அவர்கள் மட்டுமே விளையாடுகிறார்கள், மற்றவர்கள் அனைவரும் விளையாடுகிறார்கள். ஆனால் பள்ளத்தில் அவர்களுக்கு ஒரு சிறப்பு நிலை உள்ளது, ஏனென்றால் அவை (அகோகச் தவிர) ஒரே கருவி, இது துடிப்பில் விளையாடுகிறது. மற்றவர்கள் அனைவரும் ஆஃபீட் விளையாடுகிறார்கள், இதன் மூலம் முழு பாடலும் எப்படியாவது அழைப்பு மற்றும் பதிலாக மாற்றப்படுகிறது.

source: There’s an alternate version of the Repi groove. It sounds quite nice, but can be very tiring, not only for the Repi players, but also for those who listen. Repi players should keep that in mind and change between alternate and normal version.
ta: ரெபி பள்ளத்தின் மாற்று பதிப்பு உள்ளது. இது மிகவும் நன்றாக இருக்கிறது, ஆனால் ரெபி பிளேயர்களுக்கு மட்டுமல்ல, கேட்பவர்களுக்கும் மிகவும் சோர்வாக இருக்கும். ரெபி பிளேயர்கள் அதை மனதில் வைத்து மாற்று மற்றும் சாதாரண பதிப்பிற்கு இடையில் மாற்ற வேண்டும்.

source: As Hedgehog is also a Tango-like-rhythm, Ragga-Hedgehog combinations use to sound nice.
ta: எட்ச்ஆக் ஒரு டேங்கோ போன்ற தாளமாகவும் இருப்பதால், ராகா-எட்ச்ஆக் சேர்க்கைகள் நன்றாக ஒலிக்க பயன்படுத்துகின்றன.

source: Sign
ta: அடையாளம்

source: Ragga Tune Sign
ta: இடர் டியூன் அடையாளம்

source: Fists together, thumbs to the left and to the right
ta: ஒன்றாக கைமுட்டிகள், இடது மற்றும் வலதுபுறம் கட்டைவிரல்

source: Background
ta: பின்னணி

source: **Name:** Ragga (short for Raggamuffin) is a type of electronic Jamaican pop music based on Reggae. ([Wikipedia]{1})
ta: ** பெயர்: ** ராகா (ராகமுஃபினுக்கு குறுகியது) என்பது ரெக்கேவை அடிப்படையாகக் கொண்ட மின்னணு சமைக்கா பாப் இசை. ([விக்கிபீடியா] {1})

source: **Musical background:** The Snare and Surdo beats can be heard in many Ragga songs.
ta: ** இசை பின்னணி: ** பல ராகா பாடல்களில் ச்னேர் மற்றும் சூர்டோ பீட்சைக் கேட்கலாம்.

source: **Sign:** *(More info needed.)*
ta: ** அடையாளம்: ***(மேலும் செய்தி தேவை.)*

source: **History:** Was introduced to the network in 2010 or so (together with Funk, but Funk is played at least since 2008 in the network)
ta: ** வரலாறு: ** 2010 அல்லது அதற்கு மேற்பட்ட நெட்வொர்க்கில் அறிமுகப்படுத்தப்பட்டது (ஃபங்க் உடன் சேர்ந்து, ஆனால் ஃபங்க் குறைந்தபட்சம் 2008 முதல் நெட்வொர்க்கில் விளையாடப்படுகிறது)

source: Difficulty
ta: தொல்லை

source: **Surdos:** medium
ta: ** காது கேளாதோர்: ** நடுத்தர

source: **Repi:** medium (alternate-version: hard)
ta: ** ரெபி: ** நடுத்தர (மாற்று-பதிப்பு: கடினமானது)

source: **Snare:** tricky
ta: ** SNARE: ** தந்திரமான

source: **Tamborim:** medium
ta: ** தம்போரிம்: ** நடுத்தர

source: **Agogô:** hard
ta: ** அகோகே: ** கடினமானது

source: Breaks
ta: இடைவெளிகள்

source: The Kick Back Breaks are a call & response between Surdos and all others. While ‘Kick Back 1’ is quite moderate, ‘Kick Back 2’ is quite fast. Using them as Intros, to speed up, or to create tension works really good.
ta: கிக் பேக் பிரேக்ச் என்பது சூர்டோசுக்கும் மற்றவர்களுக்கும் இடையிலான அழைப்பு மற்றும் பதில். ‘கிக் பேக் 1’ மிகவும் மிதமானதாக இருந்தாலும், ‘கிக் பேக் 2’ மிகவும் வேகமாக உள்ளது. அவற்றை அறிமுகங்களாகப் பயன்படுத்துதல், வேகப்படுத்த அல்லது பதற்றத்தை உருவாக்குவது மிகவும் நல்லது.

source: In the Kick Back 2 the Agogôs have a really hard part (playing sixteenth-notes with only one stick). It should be played accurate and not chaotically. Therefore it might be useful to take turns (one Agogô-player starts while another takes a break and e.g. after eight counts they change). Also, as a maestr@, counting in ‘Kick Back 2’ while stopping the Agogôs and getting them into the tune just a few bars before the next break (or getting into the tune, or whatever), might be helping – and increases tension and energy.
ta: கிக் பேக் 2 இல் 2 அகோகச் மிகவும் கடினமான பகுதியைக் கொண்டுள்ளது (ஒரே ஒரு குச்சியுடன் பதினாறாவது குறிப்புகளை விளையாடுவது). இது துல்லியமாக விளையாடப்பட வேண்டும், ஆனால் குழப்பமாக அல்ல. எனவே திருப்பங்களை எடுப்பது பயனுள்ளதாக இருக்கும் (ஒரு அகோகே-பிளேயர் தொடங்குகிறது, மற்றொன்று இடைவெளி எடுக்கும், எ.கா. எட்டு எண்ணிக்கைகளுக்குப் பிறகு அவை மாறுகின்றன). மேலும், ஒரு மேச்ட்@, ஆகோசை நிறுத்தி, அடுத்த இடைவேளைக்கு முன்னர் ஒரு சில பார்கள் (அல்லது டியூனில் இறங்குவது, அல்லது எதுவாக இருந்தாலும்), உதவியாக இருக்கலாம் - மேலும் பதற்றம் மற்றும் ஆற்றலை அதிகரிக்கிறது.
