Repository: 247i/TACETr
Catalog: உரை/வெறுமை/ror-player-tune-description-cochabamba-*.po
Languages: ta

source: A very energetic tune, which sounds a lot like hip hop.
ta: மிகவும் ஆற்றல் வாய்ந்த இசைக்கு, இது இப் ஆப் போன்றது.

source: For the Surdos it might be quite hard to be in time. While they actually just have a few hits to play it’s important for them to be synchronized. Try a memory-hook/phrase to sing along in order to remember, or just listen to the sound files until it really sticks in your head.
ta: சூர்டோசைப் பொறுத்தவரை, சரியான நேரத்தில் இருப்பது மிகவும் கடினமாக இருக்கலாம். அவர்கள் உண்மையில் விளையாட சில வெற்றிகளைக் கொண்டிருக்கும்போது, ​​அவர்கள் ஒத்திசைக்கப்படுவது முதன்மை. நினைவில் கொள்வதற்காக பாடுவதற்கு மெமரி-ஊக்/சொற்றொடரை முயற்சிக்கவும், அல்லது ஒலி கோப்புகள் உங்கள் தலையில் ஒட்டிக்கொண்டிருக்கும் வரை கேளுங்கள்.

source: Agogôs and Surdos are the ‘heart’ of this tune, try to have them as punctual as possible.
ta: அகோகச் மற்றும் சூர்டோச் இந்த பாடலின் ‘இதயம்’, அவற்றை முடிந்தவரை சரியான நேரத்தில் வைத்திருக்க முயற்சி செய்யுங்கள்.

source: Sign
ta: அடையாளம்

source: Cochabamba Tune Sign
ta: கோச்சபம்பா டியூன் அடையாளம்

source: Drink from a cup formed with one hand
ta: ஒரு கையால் உருவான ஒரு கோப்பையிலிருந்து குடிக்கவும்

source: Background
ta: பின்னணி

source: **Name:** Cochabamba is a major city in Bolivia. The 3rd PGA conference in 2001 was there. Social movements and direct action groups there revoked the privatization of drinking water.
ta: ** பெயர்: ** கோச்சபம்பா பொலிவியாவில் ஒரு முக்கிய நகரம். 2001 இல் 3 வது பிசிஏ மாநாடு இருந்தது. அங்குள்ள சமூக இயக்கங்கள் மற்றும் நேரடி நடவடிக்கை குழுக்கள் குடிநீரை தனியார்மயமாக்குவதை ரத்து செய்தன.

source: **Musical background:** Break 1 and Call Break are based on the song “Iron Lion Zion” by Bob Marley ([YouTube]{1}). *(More info needed.)*
ta: . *(மேலும் செய்தி தேவை.)*

source: **Sign:** Symbolizes drinking out of cup, referring to the privatization of water against which the protests happened in Cochabamba
ta: ** அடையாளம்: ** கோச்சபம்பாவில் ஆர்ப்பாட்டங்கள் நிகழ்ந்த தண்ணீரை தனியார்மயமாக்குவதைக் குறிக்கும் கோப்பையில் இருந்து குடிப்பதைக் குறிக்கிறது

source: **History:** *(More info needed.)*
ta: ** வரலாறு: ***(மேலும் செய்தி தேவை.)*

source: Difficulty
ta: தொல்லை

source: **Surdos:** medium/hard
ta: ** சூர்டோச்: ** நடுத்தர/கடினமானது

source: **Tamb&Repi:** medium (they play the same, a variation of the “ragga”-snare)
ta: **Tamb&Repi:** சராசரி (they play the same, a variation of the “ragga”-snare)

source: **Snare:** easy
ta: ** SNARE: ** எளிதானது

source: **Agogô:** hard (but it kicks ass – if you feel lucky try clicking the bells between the (double)hits.)
ta: ** அகோகே: ** கடினமானது (ஆனால் அது கழுதை உதைக்கிறது - நீங்கள் அதிர்ச்டத்தை உணர்ந்தால் (இரட்டை) வெற்றிகளுக்கு இடையில் மணிகள் சொடுக்கு செய்ய முயற்சிக்கவும்.)

source: Breaks
ta: இடைவெளிகள்

source: Some breaks go for three bars (12 steps) so if one instrument plays along it’s much likely to get desynchronized.
ta: சில இடைவெளிகள் மூன்று பார்களுக்கு (12 படிகள்) செல்கின்றன, எனவே ஒரு கருவி விளையாடினால், அது தேய்மானம் பெற வாய்ப்புள்ளது.

source: In the Iron Lion Zion break (or break 1) everyone plays the rhythm of the Agogô with only one tone.
ta: இரும்பு லயன் சீயோன் இடைவேளையில் (அல்லது முறிவு 1) எல்லோரும் ஒரே தொனியுடன் அகோகாவின் தாளத்தை விளையாடுகிறார்கள்.

source: In the Call Break it’s the same rhythm, but this time the repi calls the four double-hits and the rest answers with two single-hits.
ta: அழைப்பு இடைவேளையில் இது அதே தாளமாகும், ஆனால் இந்த முறை ரெபி நான்கு இரட்டை வெற்றிகளையும் மீதமுள்ள பதில்களையும் இரண்டு ஒற்றை வெற்றிகளுடன் அழைக்கிறது.

source: There’s also the cross-kicks, a break only for the Surdos where they skip the beats in the middle of one bar. If nothing else is mentioned everyone else continues playing.
ta: குறுக்கு-கிக்ச் உள்ளது, சூர்டோசுக்கு மட்டுமே ஒரு இடைவெளி உள்ளது, அங்கு அவர்கள் ஒரு பட்டியின் நடுவில் துடிப்புகளைத் தவிர்க்கிறார்கள். வேறு எதுவும் குறிப்பிடப்படவில்லை என்றால் எல்லோரும் தொடர்ந்து விளையாடுகிறார்கள்.
