Repository: 247i/TACETr
Catalog: உரை/வெறுமை/syphon-syphon-*.po
Languages: ta

# title-intro
source: Welcome to {}
ta: {To க்கு வருக

# header-login
source: take back the chat
ta: அரட்டையை மீண்டும் எடுத்துக் கொள்ளுங்கள்

# header-intro
source: Privacy and freedom without the hassle.
ta: தனியுரிமை மற்றும் விடுதலை தொந்தரவு இல்லாமல்.

# header-signup-username
source: Create a username
ta: பயனர்பெயரை உருவாக்கவும்

# header-general
source: General
ta: பொது

# header-ordering
source: Ordering
ta: வரிசைப்படுத்துதல்

# header-media
source: Media
ta: ஊடகம்

# header-media-auto-download
source: Media auto-download
ta: மீடியா ஆட்டோ-டவுன்லோட்

# header-update-password
source: Update Password
ta: கடவுச்சொல்லைப் புதுப்பிக்கவும்

# title-verification
source: Verification
ta: சரிபார்ப்பு

# title-view-delete-devices
source: Confirm Device Removal
ta: சாதனம் அகற்றுவதை உறுதிப்படுத்தவும்

# title-view-search-groups
source: Explore Groups
ta: குழுக்களை ஆராயுங்கள்

# title-view-search-users
source: Search Users
ta: பயனர்களைத் தேடுங்கள்

# title-view-invite-users
source: Invite Users
ta: பயனர்களை அழைக்கவும்

# title-view-chat-users
source: All Chat Users
ta: அனைத்து அரட்டை பயனர்களும்

# title-view-create-group
source: Create A Group Chat
ta: குழு அரட்டையை உருவாக்கவும்

# title-view-create-group-public
source: Create A Public Group
ta: ஒரு பொதுக் குழுவை உருவாக்கவும்

# title-view-devices
source: Devices
ta: சாதனங்கள்

# title-view-settings
source: Settings
ta: அமைப்புகள்

# title-view-theming
source: Appearance
ta: தோற்றம்

# title-view-advanced
source: Advanced
ta: மேம்பட்ட

# title-view-invite
source: Invite
ta: அழைக்கவும்

# title-view-settings-chat
source: Chats
ta: அரட்டைகள்

# title-view-privacy
source: Privacy & Security
ta: தனியுரிமை மற்றும் பாதுகாப்பு

# title-view-homeserver-search
source: Find Your Homeserver
ta: உங்கள் ஓம்சர்வரைக் கண்டுபிடி

# title-view-profile
source: Set up Your Profile
ta: உங்கள் சுயவிவரத்தை அமைக்கவும்

# title-proxy-use-proxy
source: Use a Proxy
ta: ப்ராக்சியைப் பயன்படுத்தவும்

# title-proxy-host
source: Modify Proxy Host
ta: பதிலாள் ஓச்டை மாற்றவும்

# title-proxy-port
source: Modify Proxy Port
ta: பதிலாள் போர்ட்டை மாற்றவும்

# title-proxy-use-basic-authentication
source: Use Proxy Authentication
ta: பதிலாள் அங்கீகாரத்தைப் பயன்படுத்தவும்

# title-proxy-username
source: Modify Proxy Username
ta: பதிலாள் பயனர்பெயரை மாற்றவும்

# title-proxy-password
source: Modify Proxy Password
ta: பதிலாள் கடவுச்சொல்லை மாற்றவும்

# title-lock-overlay
source: Please enter passcode.
ta: கடவுக்குறியீட்டை உள்ளிடவும்.

# title-search-unencrypted
source: Search Unencrypted
ta: மறைகுறியாக்கப்படாததைத் தேடுங்கள்

# title-confirm-lock-overlay
source: Please confirm passcode.
ta: கடவுக்குறியீட்டை உறுதிப்படுத்தவும்.

# title-message-details
source: Message Details
ta: செய்தி விவரங்கள்

# title-send-media-message
source: Send Media Message
ta: மீடியா செய்தியை அனுப்பவும்

# title-send-media-message-unencrypted
source: Send Media Message (Unencrypted)
ta: மீடியா செய்தியை அனுப்பவும் (மறைகுறியாக்கப்படாதது)

# title-toggle-autocorrect
source: Keyboard autocorrect
ta: விசைப்பலகை தன்னியக்கவியல்

# title-toggle-suggestions
source: Keyboard word suggestions
ta: விசைப்பலகை சொல் பரிந்துரைகள்

# title-dialog-key-backup-warning
source: Key Backup Warning
ta: முக்கிய காப்புப்பிரதி எச்சரிக்கை

# title-dialog-delete-keys
source: Confirm Deleting Keys
ta: விசைகளை நீக்குவதை உறுதிப்படுத்தவும்

# title-dialog-confirm-linkout
source: Confirm Opening Link
ta: திறப்பு இணைப்பை உறுதிப்படுத்தவும்

# title-dialog-encryption
source: Encrypt Chat?
ta: அரட்டை குறியாக்கவா?

# title-dialog-captcha
source: Complete Captcha
ta: முழுமையான கேப்ட்சா

# title-dialog-terms
source: Confirm Terms Of Service
ta: பணி விதிமுறைகளை உறுதிப்படுத்தவும்

# title-dialog-terms-alpha
source: Confirm Open Alpha Terms Of Service
ta: திறந்த ஆல்பா பணி விதிமுறைகளை உறுதிப்படுத்தவும்

# title-dialog-email-requirement
source: Email requirement
ta: மின்னஞ்சல் தேவை

# title-dialog-email-requirement-verified
source: Email verification
ta: மின்னஞ்சல் சரிபார்ப்பு

# title-dialog-accept-invite
source: Accept Invite?
ta: அழைப்பை ஏற்றுக்கொள்கிறீர்களா?

# title-dialog-chat-color
source: Select Chat Color
ta: அரட்டை வண்ணத்தைத் தேர்ந்தெடுக்கவும்

# title-dialog-draft-preview
source: Draft Preview
ta: வரைவு முன்னோட்டம்

# title-dialog-logout
source: Logout
ta: வெளியேற்றம்

# title-dialog-sync-interval
source: Modify Sync Interval
ta: ஒத்திசைவு இடைவெளியை மாற்றவும்

# title-dialog-chat-with-user
source: Chat with {}
ta: {Bith உடன் அரட்டையடிக்கவும்

# title-dialog-attempt-chat-with-user
source: Try chatting with {}
ta: {} உடன் அரட்டையடிக்க முயற்சிக்கவும்

# title-user-verification
source: User verification
ta: பயனர் சரிபார்ப்பு

# title-confirm-password
source: Confirm Password
ta: கடவுச்சொல்லை உறுதிப்படுத்தவும்

# title-confirm-email
source: Confirm Email
ta: மின்னஞ்சலை உறுதிப்படுத்தவும்

# title-device-rename
source: Rename a device
ta: ஒரு சாதனத்தை மறுபெயரிடுங்கள்

# title-blocked-users
source: Blocked Users
ta: தடுக்கப்பட்ட பயனர்கள்

# title-import-session-keys
source: Restore Session Keys
ta: அமர்வு விசைகளை மீட்டமைக்கவும்

# title-export-session-keys
source: Backup Session Keys
ta: காப்பு அமர்வு விசைகள்

# title-dialog-backup-session-keys
source: Backup Session Keys
ta: காப்பு அமர்வு விசைகள்

# title-dialog-confirm-deactivate-account
source: Confirm Deactivate Account
ta: செயலிழக்கக் கணக்கை உறுதிப்படுத்தவும்

# title-dialog-confirm-deactivate-account-final
source: Confirm Deactivate Account Final
ta: கணக்கு இறுதிப் போட்டியை செயலிழக்க உறுதிப்படுத்தவும்

# title-dialog-remove-screen-lock
source: Remove Screen Lock
ta: திரை பூட்டை அகற்று

# title-dialog-enter-screen-lock-pin
source: Enter your current screen lock pin
ta: உங்கள் தற்போதைய திரை பூட்டு முள் உள்ளிடவும்

# title-dialog-enter-new-screen-lock-pin
source: Enter your new screen lock pin
ta: உங்கள் புதிய திரை பூட்டு முள் உள்ளிடவும்

# title-dialog-verify-new-screen-lock-pin
source: Enter your pin again to verify
ta: சரிபார்க்க உங்கள் முள் மீண்டும் உள்ளிடவும்

# title-dialog-photo-permission
source: Permission Required
ta: இசைவு தேவை

# title-dialog-block-user
source: Block User
ta: தொகுதி பயனர்

# subtitle-proxy-use-proxy
source: This will force all traffic leaving Syphon to do so via a proxy
ta: இது சிபோனிலிருந்து வெளியேறும் அனைத்து போக்குவரத்தையும் பதிலாள் வழியாக அவ்வாறு செய்ய கட்டாயப்படுத்தும்

# subtitle-proxy-use-basic-authentication
source: Provide username and password to authenticate with a proxy
ta: பதிலாள் மூலம் அங்கீகரிக்க பயனர்பெயர் மற்றும் கடவுச்சொல்லை வழங்கவும்

# subtitle-settings-sync-interval
source: Amount of time in seconds the app wait between syncing
ta: நொடிகளில் நேரம் நேரம் காத்திருக்கிறது ஒத்திசைவுக்கு இடையில்

# subtitle-settings-sync-toggle
source: Toggle syncing with the matrix server
ta: மேட்ரிக்ச் சேவையகத்துடன் ஒத்திசைவை மாற்றவும்

# subtitle-settings-read-receipts
source: If read receipts are disabled or private, other users will not be able to see when you have read their messages.
ta: வாசிப்பு ரசீதுகள் முடக்கப்பட்டிருந்தால் அல்லது தனிப்பட்டதாக இருந்தால், நீங்கள் அவர்களின் செய்திகளைப் படிக்கும்போது மற்ற பயனர்களால் பார்க்க முடியாது.

# subtitle-toggle-autocorrect
source: Beware that keyboards may send autocorrect data to third-parties
ta: விசைப்பலகைகள் மூன்றாம் தரப்பினருக்கு தன்னியக்க மதிப்பை அனுப்பக்கூடும் என்பதில் கவனமாக

# subtitle-toggle-suggestions
source: Beware that keyboards may send suggestions data to third-parties
ta: விசைப்பலகைகள் மூன்றாம் தரப்பினருக்கு பரிந்துரைகளின் தரவை அனுப்பக்கூடும் என்பதில் கவனமாக

# subtitle-settings-show-membership-events
source: Show membership changes within the chat
ta: அரட்டையில் உறுப்பினர் மாற்றங்களைக் காட்டு

# subtitle-settings-enter-sends
source: Pressing the enter key will send a message
ta: ENTER விசையை அழுத்தினால் ஒரு செய்தியை அனுப்பும்

# subtitle-settings-24h-format
source: Show message timestamps using 24 hour format
ta: 24 மணிநேர வடிவமைப்பைப் பயன்படுத்தி செய்தி நேர முத்திரைகளைக் காட்டு

# subtitle-settings-dismiss-keyboard
source: Dismiss the keyboard after sending a message
ta: செய்தியை அனுப்பிய பின் விசைப்பலகை நிராகரிக்கவும்

# subtitle-settings-view-uploaded-media
source: See all uploaded data, even those unaccessible from messages
ta: பதிவேற்றிய அனைத்து தரவையும் காண்க, செய்திகளிலிருந்து அணுக முடியாதவை கூட

# subtitle-images-audio-video-files
source: Images, Audio, Video, Files
ta: படங்கள், ஆடியோ, வீடியோ, கோப்புகள்

# subtitle-theme-settings
source: Theme {}, Font {}
ta: கருப்பொருள் {}, எழுத்துரு {}

# subtitle-privacy-settings
source: Screen Lock {}, Registration Lock {}
ta: திரை பூட்டு {}, பதிவு பூட்டு {}

# subtitle-manual-sync
source: Perform a forced matrix sync based on last sync timestamp
ta: கடைசி ஒத்திசைவு நேர முத்திரையின் அடிப்படையில் கட்டாய மேட்ரிக்ச் ஒத்திசைவைச் செய்யுங்கள்

# subtitle-force-full-sync
source: Perform a forced full sync of all user data and messages
ta: அனைத்து பயனர் தரவு மற்றும் செய்திகளின் கட்டாய முழு ஒத்திசைவைச் செய்யுங்கள்

# label-import-session-keys
source: Restore Keys
ta: விசைகளை மீட்டமைக்கவும்

# label-export-session-keys
source: Backup Keys
ta: காப்பு விசைகள்

# label-searching
source: Searching…
ta: தேடுகிறது…

# label-search-homeservers
source: Search for homeservers…
ta: ஓம்சர்சர்களைத் தேடுங்கள்…

# label-search-user
source: Search for a user…
ta: ஒரு பயனரைத் தேடுங்கள்…

# label-search-users
source: Search for users…
ta: பயனர்களைத் தேடுங்கள்…

# label-search-results
source: Search Results
ta: தேடல் முடிவுகள்

# label-syncing-chats
source: syncing chats…
ta: அரட்டைகளை ஒத்திசைத்தல்…

# label-on
source: On
ta: ஆன்

# label-off
source: Off
ta: அணை

# label-private
source: Private
ta: தனிப்பட்ட

# label-email
source: Email
ta: மின்னஞ்சல்

# label-users
source: Users
ta: பயனர்கள்

# label-back
source: Go Back
ta: திரும்பிச் செல்லுங்கள்

# label-close
source: close
ta: மூடு

# label-send
source: Send
ta: அனுப்பு

# label-download-image
source: Load Image
ta: படத்தை ஏற்றவும்

# label-users-recent
source: Recent Users
ta: அண்மைக் கால பயனர்கள்

# label-users-results
source: Matched Users
ta: பொருந்திய பயனர்கள்

# label-users-known
source: Known Users
ta: அறியப்பட்ட பயனர்கள்

# label-chat-default
source: New Chat
ta: புதிய அரட்டை

# label-messages-empty
source: no messages found
ta: செய்திகள் எதுவும் கிடைக்கவில்லை

# label-call-invite
source: User invited you to a voice call
ta: பயனர் உங்களை குரல் அழைப்புக்கு அழைத்தார்

# label-call-hangup
source: User ended a voice call
ta: பயனர் ஒரு குரல் அழைப்பை முடித்தார்

# label-groups-empty
source: no groups found
ta: குழுக்கள் எதுவும் கிடைக்கவில்லை

# label-message-encrypted
source: Encrypted Message
ta: மறைகுறியாக்கப்பட்ட செய்தி

# label-message-matrix
source: Matrix message
ta: அணி செய்தி

# label-message-matrix-unencrypted
source: Matrix message (unencrypted)
ta: மேட்ரிக்ச் செய்தி (மறைகுறியாக்கப்படாதது)

# label-deleted-message
source: This message was deleted
ta: இந்த செய்தி நீக்கப்பட்டது

# label-terms-of-service
source: Terms of Service
ta: பணி விதிமுறைகள்

# label-search-unencrypted
source: Search Unencrypted
ta: மறைகுறியாக்கப்படாததைத் தேடுங்கள்

# label-about
source: About
ta: பற்றி

# label-chat-settings
source: Chat Settings
ta: அரட்டை அமைப்புகள்

# label-color
source: Color
ta: நிறம்

# label-timestamp
source: Timestamp
ta: நேர முத்திரை

# label-none
source: None
ta: எதுவுமில்லை

# label-syncing
source: Syncing
ta: ஒத்திசைவு

# label-stopped
source: Stopped
ta: நிறுத்தப்பட்டது

# label-version
source: Version
ta: பதிப்பு

# label-seconds
source: seconds
ta: நொடிகள்

# label-search-for-user
source: Search for a user...
ta: ஒரு பயனரைத் தேடுங்கள் ...

# label-current-password
source: Current Password
ta: தற்போதைய கடவுச்சொல்

# label-new-password
source: New Password
ta: புதிய கடவுச்சொல்

# label-confirm-new-password
source: Confirm New Password
ta: புதிய கடவுச்சொல்லை உறுதிப்படுத்தவும்

# label-always
source: Always
ta: எப்போதும்

# label-default-room-notification
source: Default (Argon)
ta: இயல்புநிலை (ஆர்கான்)

# label-fab-search
source: Search Chats
ta: அரட்டைகளைத் தேடுங்கள்

# label-fab-create-dm
source: Direct Message
ta: நேரடி செய்தி

# label-fab-create-group
source: Start Group Chat
ta: குழு அரட்டையைத் தொடங்கவும்

# label-fab-create-public
source: Start Public Chat
ta: பொது அரட்டையைத் தொடங்கவும்

# button-login
source: log in
ta: புகுபதிகை

# button-login-sso
source: single sign on
ta: ஒற்றை அடையாளம்

# button-save
source: save
ta: சேமி

# button-next
source: continue
ta: தொடரவும்

# button-finish
source: finish
ta: முடிக்க

# button-start-chat
source: let's chat
ta: அரட்டை அடிப்போம்

# button-create
source: create
ta: உருவாக்கு

# button-cancel
source: cancel
ta: ரத்துசெய்

# button-quit
source: quit
ta: வெளியேறு

# button-confirm
source: got it
ta: கிடைத்தது

# button-confirm-alt
source: ok
ta: சரி

# button-confirm-formal
source: confirm
ta: உறுதிப்படுத்தவும்

# button-enable
source: enable
ta: இயக்கு

# button-delete-keys
source: delete keys
ta: விசைகளை நீக்கு

# button-block-user
source: Block User
ta: தொகுதி பயனர்

# button-leave-chat
source: Leave Chat
ta: அரட்டையை விட்டு விடுங்கள்

# button-delete-chat
source: delete chat
ta: அரட்டையை நீக்கு

# button-archive-chat
source: archive chat
ta: காப்பக அரட்டை

# button-select-all
source: select all
ta: அனைத்தையும் தெரிவுசெய்

# button-chat-details
source: chat details
ta: அரட்டை விவரங்கள்

# button-send-verification
source: send verification email
ta: சரிபார்ப்பு மின்னஞ்சலை அனுப்பவும்

# button-confirm-verification
source: confirm verification
ta: சரிபார்ப்பை உறுதிப்படுத்தவும்

# button-deactivate
source: deactivate
ta: செயலிழக்கச் செய்யுங்கள்

# button-reset-password
source: reset password
ta: கடவுச்சொல்லை மீட்டமைக்கவும்

# button-dismiss
source: Dismiss
ta: தள்ளுபடி

# button-text-agreement
source: I Agree
ta: நான் ஒப்புக்கொள்கிறேன்

# button-text-see-users
source: See All Users
ta: அனைத்து பயனர்களையும் காண்க

# button-text-login-question
source: Already have a username?
ta: ஏற்கனவே பயனர்பெயர் உள்ளதா?

# button-text-signup-question
source: Don't have a username?
ta: பயனர்பெயர் இல்லையா?

# button-text-login
source: Login
ta: புகுபதிவு

# button-text-signup-action
source: Create One
ta: ஒன்றை உருவாக்கவும்

# button-text-load-captcha
source: Load Captcha
ta: கேப்ட்சாவை ஏற்றவும்

# button-text-confirmed
source: Confirmed
ta: உறுதிப்படுத்தப்பட்டது

# button-text-create-group
source: New Group
ta: புதிய குழு

# button-text-mark-all-read
source: Mark All Read
ta: எல்லா வாசிப்பையும் குறிக்கவும்

# button-text-invite
source: Invite Friends
ta: நண்பர்களை அழைக்கவும்

# button-text-settings
source: Settings
ta: அமைப்புகள்

# button-text-support
source: Help
ta: உதவி

# button-text-go-back
source: go back
ta: திரும்பிச் செல்லுங்கள்

# button-text-reject
source: reject
ta: நிராகரிக்கவும்

# button-text-accept
source: accept
ta: ஏற்றுக்கொள்

# button-text-lets-encrypt
source: let's encrypt
ta: குறியாக்கம் செய்வோம்

# button-text-import
source: import
ta: இறக்குமதி

# button-text-confirm-delete-keys
source: Delete Keys
ta: விசைகளை நீக்கு

# button-text-remove
source: Remove
ta: அகற்று

# button-save-message-edit
source: Save Message Edit
ta: செய்தி திருத்து சேமிக்கவும்

# button-gallery
source: Gallery
ta: கேலரி

# button-file
source: File
ta: கோப்பு

# button-contact
source: Contact
ta: தொடர்பு

# button-location
source: Location
ta: இடம்

# list-item-chat-detail-toggle-direct-chat
source: Direct Chat
ta: நேரடி அரட்டை

# list-item-chat-detail-notification-setting
source: Notification Settings
ta: அறிவிப்பு அமைப்புகள்

# list-item-chat-detail-notifications
source: Notifications
ta: அறிவிப்புகள்

# list-item-chat-detail-vibrate
source: Vibration
ta: அதிர்வு

# list-item-chat-detail-notification-sound
source: Notification Sound
ta: அறிவிப்பு ஒலி

# list-item-chat-detail-privacy-status
source: Privacy and Status
ta: தனியுரிமை மற்றும் நிலை

# list-item-chat-detail-view-key
source: View Encryption Key
ta: குறியாக்க விசையைக் காண்க

# list-item-mute-for-one-hour
source: Mute for 1 hour
ta: 1 மணி நேரம் முடக்கு

# list-item-mute-for-hours
source: Mute for {} hours
ta: }} மணிநேரங்களுக்கு முடக்கு

# list-item-mute-for-one-day
source: Mute for 1 day
ta: 1 நாள் முடக்கு

# list-item-mute-for-days
source: Mute for {} days
ta: }} நாட்களுக்கு முடக்கு

# list-item-settings-notification
source: Notifications
ta: அறிவிப்புகள்

# list-item-settings-privacy
source: Privacy
ta: தனியுரிமை

# list-item-settings-sms
source: SMS and MMS
ta: எச்.எம்.எச் மற்றும் எம்.எம்.எச்

# list-item-settings-logout
source: Logout
ta: வெளியேற்றம்

# list-item-settings-proxy
source: Proxy Settings
ta: பதிலாள் அமைப்புகள்

# list-item-settings-proxy-host
source: Host
ta: விருந்தோம்பி

# list-item-settings-proxy-port
source: Port
ta: துறைமுகம்

# list-item-settings-proxy-username
source: Proxy Username
ta: பதிலாள் பயனர்பெயர்

# list-item-settings-proxy-password
source: Proxy Password
ta: பதிலாள் கடவுச்சொல்

# list-item-settings-sync-interval
source: Sync Interval
ta: ஒத்திசைவு இடைவெளி

# list-item-settings-sync-toggle
source: Toggle Syncing
ta: ஒத்திசைவை மாற்றவும்

# list-item-settings-read-receipts
source: Read Receipts
ta: ரசீதுகளைப் படியுங்கள்

# list-item-settings-language
source: Language
ta: மொழி

# list-item-settings-show-membership-events
source: Show Membership Events
ta: உறுப்பினர் நிகழ்வுகளைக் காட்டு

# list-item-settings-enter-sends
source: Enter Key Sends
ta: விசை அனுப்புவதை உள்ளிடவும்

# list-item-settings-24h-format
source: 24 Hour Time Format
ta: 24 மணி நேர நேர வடிவம்

# list-item-settings-dismiss-keyboard
source: Dismiss Keyboard
ta: விசைப்பலகை நிராகரிக்கவும்

# list-item-settings-sort-by
source: Sort By
ta: வரிசைப்படுத்தவும்

# list-item-settings-group-by
source: Group By
ta: குழு

# list-item-settings-view-uploaded-media
source: View all uploaded Media
ta: பதிவேற்றிய அனைத்து ஊடகங்களையும் காண்க

# list-item-settings-auto-download
source: Auto Download
ta: ஆட்டோ பதிவிறக்கம்

# list-item-settings-when-using-mobile-data
source: When using mobile data
ta: மொபைல் தரவைப் பயன்படுத்தும் போது

# list-item-settings-when-using-wi-fi
source: When using Wi-Fi
ta: வைஃபை பயன்படுத்தும் போது

# list-item-settings-when-roaming
source: When Roaming
ta: ரோமிங் செய்யும் போது

# list-item-settings-manual-sync
source: Manual Sync
ta: கையேடு ஒத்திசைவு

# list-item-settings-force-full-sync
source: Force Full Sync
ta: முழு ஒத்திசைவை கட்டாயப்படுத்துங்கள்

# list-item-user-details-invite-to-room
source: Invite to Room
ta: அறைக்கு அழைக்கவும்

# list-item-user-details-start-chat
source: Chat with {}
ta: {Bith உடன் அரட்டையடிக்கவும்

# list-item-user-details-send-message
source: Send A Message
ta: ஒரு செய்தியை அனுப்பவும்

# list-item-user-details-view-profile
source: View Profile
ta: சுயவிவரத்தைக் காண்க

# list-item-user-details-unblock-user
source: Unblock User
ta: பயனரைத் தடைசெய்க

# list-item-user-details-block-user
source: Block User
ta: தொகுதி பயனர்

# list-item-image-options-photo-select-method
source: Photo Select Method
ta: புகைப்படம் தேர்ந்தெடுக்கப்பட்ட முறை

# list-item-image-options-take-photo
source: Take Photo
ta: புகைப்படம் எடுக்கவும்

# list-item-image-options-pick-from-gallery
source: Pick from Gallery
ta: கேலரியில் இருந்து தேர்வு

# list-item-image-options-remove-photo
source: Remove Photo
ta: புகைப்படத்தை அகற்று

# list-item-context-switcher-user-display-name
source: {} (Encrypted User)
ta: {} (மறைகுறியாக்கப்பட்ட பயனர்)

# list-item-context-switcher-accounts
source: Accounts
ta: கணக்குகள்

# list-item-context-switcher-add-account
source: Add Account
ta: கணக்கைச் சேர்க்கவும்

# list-item-advanced-settings-licenses
source: Open Source Licenses
ta: திறந்த மூல உரிமங்கள்

# list-item-advanced-settings-start-background
source: Start Background Service
ta: பின்னணி சேவையைத் தொடங்கவும்

# list-item-advanced-settings-stop-background
source: Stop All Services
ta: எல்லா சேவைகளையும் நிறுத்துங்கள்

# list-item-advanced-settings-test-notifications
source: Test Notifications
ta: அறிவிப்புகளை சோதிக்கவும்

# list-item-advanced-settings-test-sync-loop
source: Test Background Sync Loop
ta: சோதனை பின்னணி ஒத்திசைவு லூப்

# list-item-advanced-settings-force-function
source: Force Function
ta: ஆற்றல் செயல்பாடு

# list-item-sent
source: Sent
ta: அனுப்பப்பட்டது

# list-item-received
source: Received
ta: பெறப்பட்டது

# list-item-via
source: Platform
ta: இயங்குதளம்

# list-item-from
source: From
ta: இருந்து

# list-item-read-by
source: Seen By
ta: பார்த்தது

# alert-restart-app-effect
source: You'll need to close and restart the app for this to take effect
ta: இது நடைமுறைக்கு வர நீங்கள் பயன்பாட்டை மூடிவிட்டு மறுதொடக்கம் செய்ய வேண்டும்

# alert-invite-user-unknown
source: This user doesn't appear to exist within matrix, but you can attempt to invite them anyway. Make sure you have the correct name before trying.
ta: இந்த பயனர் மேட்ரிக்சில் இருப்பதாகத் தெரியவில்லை, ஆனால் நீங்கள் எப்படியும் அவற்றை அழைக்க முயற்சி செய்யலாம். முயற்சிக்கும் முன் உங்களுக்கு சரியான பெயர் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# alert-feature-in-progress
source: 🛠 This feature is coming soon
ta: Feature இந்த நற்பொருத்தம் விரைவில் வருகிறது

# alert-message-failed
source: Message Failed To Send
ta: செய்தி அனுப்பத் தவறிவிட்டது

# alert-homeserver-invalid
source: This server failed the 'well-known' check. Make sure the server is configured correctly.
ta: இந்த சேவையகம் 'நன்கு அறியப்பட்ட' காசோலையில் தோல்வியடைந்தது. சேவையகம் சரியாக உள்ளமைக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்தவும்.

# alert-offline
source: Looks like you may be offline. Check your connection and try again.
ta: நீங்கள் ஆஃப்லைனில் இருக்கலாம் என்று தெரிகிறது. உங்கள் இணைப்பைச் சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# alert-unknown
source: Unknown Error Occurred
ta: தெரியாத பிழை ஏற்பட்டது

# alert-could-not-launch-url
source: Could not launch {}
ta: தொடங்க முடியவில்லை {}

# alert-no-images-found
source: No Images Found.
ta: படங்கள் எதுவும் கிடைக்கவில்லை.

# alert-storage-access-required-for-keys
source: Enter the password for this session key import.
ta: இந்த அமர்வு விசை இறக்குமதிக்கான கடவுச்சொல்லை உள்ளிடவும்.

# alert-wait-for-full-sync-before-switching
source: Wait for full sync to finish before switching accounts
ta: கணக்குகளை மாற்றுவதற்கு முன் முழு ஒத்திசைவு முடிவடையும் வரை காத்திருங்கள்

# alert-log-out-enable-multiaccount
source: You must logout of your\ncurrent session to enable multiaccounts
ta: மல்டியாக்யூட்டுகளை இயக்க உங்கள் \ ncurrent அமர்வின் உள்நுழைய வேண்டும்

# alert-copied-to-clipboard
source: Copied to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது

# prompt-homeserver-select
source: Select your username and homeserver
ta: உங்கள் பயனர்பெயர் மற்றும் ஓம்சர்வர் என்பதைத் தேர்ந்தெடுக்கவும்

# prompt-confirm-deactivate
source: Enter your password below to confirm deactivation
ta: செயலிழக்கத்தை உறுதிப்படுத்த கீழே உங்கள் கடவுச்சொல்லை உள்ளிடவும்

# placeholder-topic
source: No Topic Description
ta: தலைப்பு விளக்கம் இல்லை

# content-thanks
source: Thanks for trying out {}!
ta: முயற்சித்ததற்கு நன்றி {}!

# content-support-dialog
source: The Syphon community is here to help you however we can. Feel free to join our Support chat or send us an email. Please be aware email can take anywhere from 1-5+ business days for a reply!
ta: எங்களால் முடிந்தாலும் உங்களுக்கு உதவ சிஃபோன் சமூகம் இங்கே உள்ளது. எங்கள் உதவி அரட்டையில் சேர தயங்க அல்லது எங்களுக்கு மின்னஞ்சல் அனுப்புங்கள். தயவுசெய்து எச்சரிக்கையாக இருங்கள் மின்னஞ்சல் ஒரு பதிலுக்கு 1-5+ வணிக நாட்களிலிருந்து எங்கும் எடுக்கலாம்!

# content-password-recommendation
source: Try thinking up 3 or more random words you'll easily remember
ta: 3 அல்லது அதற்கு மேற்பட்ட சீரற்ற சிந்திக்க முயற்சிக்கவும் நீங்கள் எளிதாக நினைவில் கொள்ளும் வார்த்தைகள்

# content-intro-section-one
source: {} works by using an encrypted and decentralized network called
ta: Chirt ஒரு மறைகுறியாக்கப்பட்டதைப் பயன்படுத்துவதன் மூலம் செயல்படுகிறது மற்றும் பரவலாக்கப்பட்ட பிணையம் அழைக்கப்பட்டார்

# content-intro-section-two
source: Matrix enables you to message others
ta: மேட்ரிக்ச் மற்றவர்களுக்கு செய்தி அனுப்ப உங்களுக்கு உதவுகிறது
