Repository: 247i/TACETr
Catalog: உரை/வெறுமை/syphon-syphon-*.po
Languages: ta

# content-intro-section-two-part-two
source: privately and control
ta: தனிப்பட்ட மற்றும் கட்டுப்பாடு

# content-intro-section-two-part-three
source: where the messages are stored
ta: எங்கே செய்திகள் சேமிக்கப்படுகின்றன

# content-intro-section-three
source: Both Matrix and {} are developed openly by organizations and people, not corporations
ta: மேட்ரிக்ச் மற்றும் {} இரண்டும் உருவாக்கப்பட்டுள்ளன நிறுவனங்கள் மற்றும் மக்களால் வெளிப்படையாக, நிறுவனங்கள் அல்ல

# content-intro-section-four
source: By using {} and other Matrix clients, we can make private messaging accessible to everyone
ta: {} மற்றும் பிற மேட்ரிக்ச் வாடிக்கையாளர்களைப் பயன்படுத்துவதன் மூலம், நாங்கள் தனியார் செய்தியை செய்யலாம் அனைவருக்கும் அணுகலாம்

# content-captcha-warning
source: Some Matrix servers require captcha confirmation provided by Google through reCAPTCHA. If you'd prefer not to complete this captcha, you may need to go back to server select and choose a different server for account creation.
ta: சில மேட்ரிக்ச் சேவையகங்களுக்கு கூகிள் ரெக்காப்ட்சா மூலம் வழங்கிய கேப்ட்சா உறுதிப்படுத்தல் தேவைப்படுகிறது. இந்த கேப்ட்சாவை முடிக்க வேண்டாம் என்று நீங்கள் விரும்பினால், நீங்கள் மீண்டும் சேவையகத்திற்குச் சென்று கணக்கு உருவாக்கத்திற்கு வேறு சேவையகத்தைத் தேர்வு செய்ய வேண்டியிருக்கும்.

# content-dialog-devices-delete
source: You will have to sign in again on these devices if you remove them.
ta: இந்த சாதனங்களை நீங்கள் அகற்றினால் அவற்றை மீண்டும் உள்நுழைய வேண்டும்.

# content-dialog-devices-key-export
source: Are you sure you want to backup this device's encryption key? It may make it available to others if you're not careful!
ta: இந்த சாதனத்தின் குறியாக்க விசையை காப்புப் பிரதி எடுக்க விரும்புகிறீர்களா? நீங்கள் கவனமாக இல்லாவிட்டால் அது மற்றவர்களுக்கு கிடைக்கக்கூடும்!

# content-dialog-device-rename
source: Enter the new public display name for this device.
ta: இந்த சாதனத்திற்கான புதிய பொது காட்சி பெயரை உள்ளிடவும்.

# content-dialog-photo-permission
source: Photos Permission is needed to access the gallery. Would you like to continue to the app settings?
ta: கேலரியை அணுக புகைப்படங்கள் இசைவு தேவை. பயன்பாட்டு அமைப்புகளுக்குத் தொடர விரும்புகிறீர்களா?

# content-dialog-block-user
source: If you block {}, you will not be able to see their messages and you will immediately leave this chat.
ta: நீங்கள் {that ஐத் தடுத்தால், அவர்களின் செய்திகளை நீங்கள் காண முடியாது, உடனடியாக இந்த அரட்டையை விட்டுவிடுவீர்கள்.

# content-notification-background
source: Background connection enabled
ta: பின்னணி இணைப்பு இயக்கப்பட்டது

# content-signup-email-requirement
source: This homeserver requires an email for registration. Your email will be visible to whoever or whatever is in control of the homeserver. Make sure you trust this homeserver before submitting this information
ta: இந்த ஓம்சருக்கு பதிவு செய்ய ஒரு மின்னஞ்சல் தேவைப்படுகிறது. உங்கள் மின்னஞ்சல் யாருடைய அல்லது எதுவுமே ஓம்சர்வரின் கட்டுப்பாட்டில் இருக்கும். இந்த தகவலைச் சமர்ப்பிப்பதற்கு முன் இந்த ஓம்சர்வரை நம்புகிறீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்

# content-signup-email-verification
source: This homeserver requires a verified email to complete registration. You'll need to click the link in the email address to continue. Make sure you trust this homeserver before clicking the verification link.
ta: இந்த ஓம்சருக்கு பதிவு செய்ய சரிபார்க்கப்பட்ட மின்னஞ்சல் தேவைப்படுகிறது. தொடர மின்னஞ்சல் முகவரியில் உள்ள இணைப்பைக் சொடுக்கு செய்ய வேண்டும். சரிபார்ப்பு இணைப்பைக் சொடுக்கு செய்வதற்கு முன் இந்த ஓம்சர்வரை நம்புகிறீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

# content-signup-captcha-requirement
source: This homeserver requires a captcha before you can create an account.
ta: இந்த ஓம்சருக்கு ஒரு கேப்ட்சா தேவை நீங்கள் ஒரு கணக்கை உருவாக்குவதற்கு முன்.

# content-forgot-email-verification
source: A verification email will be sent to your inbox before resetting your password. After verification, you'll be able to set and confirm a new password.
ta: உங்கள் கடவுச்சொல்லை மீட்டமைப்பதற்கு முன் சரிபார்ப்பு மின்னஞ்சல் உங்கள் இன்பாக்சுக்கு அனுப்பப்படும். சரிபார்ப்புக்குப் பிறகு, புதிய கடவுச்சொல்லை அமைத்து உறுதிப்படுத்த முடியும்.

# content-confirm-password-reset
source: Click on the link sent to your email. After clicking the link, press the continue button below to change your password.
ta: உங்கள் மின்னஞ்சலுக்கு அனுப்பப்பட்ட இணைப்பைக் சொடுக்கு செய்க. இணைப்பைக் சொடுக்கு செய்த பிறகு, உங்கள் கடவுச்சொல்லை மாற்ற கீழே உள்ள தொடர்ந்து பொத்தானை அழுத்தவும்.

# content-password-requirements
source: Each homeserver may have different requirements for passwords. If you're having trouble, try creating a password including a lower-case letter, an upper-case letter, a number and a symbol, and with at least 8 characters
ta: ஒவ்வொரு ஓம்சர்வரும் கடவுச்சொற்களுக்கு வெவ்வேறு தேவைகளைக் கொண்டிருக்கலாம். உங்களுக்கு சிக்கல் இருந்தால், ஒரு சிறிய கடிதம், மேல் வழக்கு கடிதம், எண் மற்றும் அடையாளம் உள்ளிட்ட கடவுச்சொல்லை உருவாக்க முயற்சிக்கவும், குறைந்தது 8 எழுத்துக்கள்

# content-sync-interval
source: Syncing works by submitting a long poll request to a matrix server. The sync interval is not how frequently it will sync, but how frequently it will attempt a new long poll request.
ta: மேட்ரிக்ச் சேவையகத்திற்கு நீண்ட வாக்கெடுப்பு கோரிக்கையை சமர்ப்பிப்பதன் மூலம் ஒத்திசைவு. ஒத்திசைவு இடைவெளி அது எவ்வளவு அடிக்கடி ஒத்திசைக்கப்படும் என்பதல்ல, ஆனால் இது ஒரு புதிய நீண்ட வாக்கெடுப்பு கோரிக்கையை எவ்வளவு அடிக்கடி முயற்சிக்கும்.

# content-proxy-host
source: The host for your proxy
ta: உங்கள் ப்ராக்சிக்கான புரவலன்

# content-proxy-port
source: The port your proxy is listening on
ta: துறைமுகம் உங்கள் பதிலாள் கேட்கிறது

# content-proxy-username
source: The username for authenticating with your proxy
ta: உங்கள் ப்ராக்சியுடன் அங்கீகரிப்பதற்கான பயனர்பெயர்

# content-proxy-password
source: The password for authenticating with your proxy
ta: உங்கள் ப்ராக்சியுடன் அங்கீகரிப்பதற்கான கடவுச்சொல்

# content-dialog-confirm-password
source: Please confirm your password (Default)
ta: உங்கள் கடவுச்சொல்லை உறுதிப்படுத்தவும் (இயல்புநிலை)

# content-notification-style-type-inbox
source: Group new messages within one notification
ta: ஒரு அறிவிப்புக்குள் புதிய செய்திகளை குழு

# content-notification-style-type-latest
source: Show one notification with the most recent message
ta: மிக அண்மைக் கால செய்தியுடன் ஒரு அறிவிப்பைக் காட்டுங்கள்

# content-notification-style-type-itemized
source: A new notification will appear for every new message
ta: ஒவ்வொரு புதிய செய்திக்கும் புதிய அறிவிப்பு தோன்றும்

# content-import-session-keys-enter-password
source: Enter the password for this session key file.
ta: இந்த அமர்வு விசை கோப்பிற்கான கடவுச்சொல்லை உள்ளிடவும்.

# content-export-session-keys-enter-password
source: Enter a password to encrypt your session keys.
ta: உங்கள் அமர்வு விசைகளை குறியாக்க கடவுச்சொல்லை உள்ளிடவும்.

# content-import-session-keys
source: Enter the password for this session key file. Please be aware the import may take a while to complete.
ta: இந்த அமர்வு விசை கோப்பிற்கான கடவுச்சொல்லை உள்ளிடவும். இறக்குமதி முடிக்க சிறிது நேரம் ஆகலாம் என்பதை நினைவில் கொள்க.

# content-export-session-keys
source: Enter a password for this session key backup. Please be aware the export may take a while to complete.
ta: இந்த அமர்வு விசை காப்புப்பிரதிக்கு கடவுச்சொல்லை உள்ளிடவும். ஏற்றுமதி முடிக்க சிறிது நேரம் ஆகலாம் என்பதை நினைவில் கொள்க.

# content-logout-confirm
source: Are you sure you want to log out?
ta: நீங்கள் நிச்சயமாக வெளியேற விரும்புகிறீர்களா?

# content-logout-multiaccount-confirm
source: Since you have other accounts, logging out will switch you to another account session.
ta: உங்களிடம் பிற கணக்குகள் இருப்பதால், உள்நுழைவது உங்களை மற்றொரு கணக்கு அமர்வுக்கு மாற்றும்.

# content-remove-screen-lock
source: Are you sure you want to remove the screen lock? This will also remove the pin protection of the cache
ta: திரை பூட்டை அகற்ற விரும்புகிறீர்களா? இது தற்காலிக சேமிப்பின் முள் பாதுகாப்பையும் அகற்றும்

# content-key-backup-warning
source: Due to background processing on iOS, your scheduled backup may or may not fire based on battery, processing power, and other factors. Always make sure your backups are being saved appropriately.
ta: ஐஇமு இல் பின்னணி செயலாக்கத்தின் காரணமாக, உங்கள் திட்டமிடப்பட்ட காப்புப்பிரதி பேட்டரி, செயலாக்க ஆற்றல் மற்றும் பிற காரணிகளின் அடிப்படையில் தீப்பிடிக்கலாம் அல்லது இல்லாமல் போகலாம். உங்கள் காப்புப்பிரதிகள் சரியான முறையில் சேமிக்கப்படுவதை எப்போதும் உறுதிப்படுத்திக் கொள்ளுங்கள்.

# message-edited-append
source: (edited)
ta: (திருத்தப்பட்டது)

# confirm-linkout
source: Are you sure you want to open the following link? {}
ta: பின்வரும் இணைப்பை நீங்கள் திறக்க விரும்புகிறீர்களா? {}

# confirm-delete-keys
source: Are you sure you want to delete your encryption keys for this device? This is very destructive and will probably render all your encrypted messages undecryptable.
ta: இந்த சாதனத்திற்கான உங்கள் குறியாக்க விசைகளை நீக்க விரும்புகிறீர்களா? இது மிகவும் அழிவுகரமானது, மேலும் உங்கள் மறைகுறியாக்கப்பட்ட எல்லா செய்திகளையும் சரிபார்க்க முடியாததாக வழங்கும்.

# confirm-invite
source: Are you sure you want to invite the following users?
ta: பின்வரும் பயனர்களை அழைக்க விரும்புகிறீர்களா?

# confirm-invites-multiple
source: Are you sure you want to invite the selected users to the following chat?
ta: தேர்ந்தெடுக்கப்பட்ட பயனர்களை பின்வரும் அரட்டைக்கு அழைக்க விரும்புகிறீர்களா?

# confirm-start-chat
source: Even if you don't send a message, the user will still see your invite to chat.
ta: நீங்கள் ஒரு செய்தியை அனுப்பாவிட்டாலும், அரட்டையடிக்க உங்கள் அழைப்பை பயனர் இன்னும் பார்ப்பார்.

# confirm-attempt-chat
source: Even if you don't send a message, the user will still see your invite to chat if they exist. Do you want to try chatting with this username?
ta: நீங்கள் ஒரு செய்தியை அனுப்பாவிட்டாலும், அவர்கள் அரட்டையடிக்க உங்கள் அழைப்பை பயனர் இன்னும் பார்ப்பார். இந்த பயனர்பெயருடன் அரட்டையடிக்க முயற்சிக்க விரும்புகிறீர்களா?

# confirm-terms-of-service
source: THIS SOFTWARE ({}) IS PROVIDED BY THE AUTHOR ''AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
ta: இந்த மென்பொருள் ({}) ஆசிரியரால் வழங்கப்படுகிறது '' '' மற்றும் எந்தவொரு வெளிப்படையான அல்லது மறைமுகமான உத்தரவாதங்களும், ஆனால் ஒரு குறிப்பிட்ட நோக்கத்திற்காக வணிகத்தன்மை மற்றும் உடற்தகுதி ஆகியவற்றின் மறைமுகமான உத்தரவாதங்கள் உட்பட, ஆனால் அவை மட்டும் அல்ல. எந்தவொரு சந்தர்ப்பத்திலும், எந்தவொரு நேரடி, மறைமுக, தற்செயலான, சிறப்பு, முன்மாதிரியான, அல்லது அதன் விளைவாக ஏற்படும் சேதங்களுக்கும் (மாற்று பொருட்கள் அல்லது சேவைகளை வாங்குவது உட்பட, ஆனால் மட்டுப்படுத்தப்படவில்லை; பயன்பாட்டு இழப்பு, தரவு அல்லது இலாபங்கள்; அத்தகைய சேதம்.

# confirm-enable-notifications
source: Your device will now prompt you to turn on notifications for {}. Do you want to turn on message notifications?
ta: உங்கள் சாதனம் இப்போது {for க்கான அறிவிப்புகளை இயக்கும்படி கேட்கும். செய்தி அறிவிப்புகளை இயக்க விரும்புகிறீர்களா?

# confirm-auth-verification
source: In order to perform this action, you'll need to enter your password again
ta: இந்த செயலைச் செய்ய, உங்கள் கடவுச்சொல்லை மீண்டும் உள்ளிட வேண்டும்

# confirm-alpha-version
source: Please be aware this app is still very much in Alpha.
ta: தயவுசெய்து இந்த பயன்பாடு இன்னும் ஆல்பாவில் இருப்பதை அறிந்து கொள்ளுங்கள்.

# confirm-alpha-warning
source: Do not use, nor do I recommend using, Syphon where proven and independently verified security is required.
ta: நிரூபிக்கப்பட்ட மற்றும் சுயாதீனமாக சரிபார்க்கப்பட்ட பாதுகாப்பு தேவைப்படும் இடத்தில் பயன்படுத்த வேண்டாம், அல்லது பயன்படுத்த பரிந்துரைக்க வேண்டாம்.

# confirm-alpha-warning-alt
source: You may lose data using this application as features and bugs are worked out.
ta: நற்பொருத்தங்கள் மற்றும் பிழைகள் தயாரிக்கப்படுவதால் இந்த பயன்பாட்டைப் பயன்படுத்தி தரவை நீங்கள் இழக்க நேரிடும்.

# confirm-terms-of-service-alt
source: Please read the below terms and conditions for this application and if you agree tap "I Agree" to continue:
ta: தயவுசெய்து இந்த பயன்பாட்டிற்கான கீழே உள்ள விதிமுறைகளையும் நிபந்தனைகளையும் படிக்கவும், நீங்கள் ஒப்புக்கொண்டால் தொடர "நான் ஒப்புக்கொள்கிறேன்" என்பதைத் தட்டவும்:

# confirm-invite-accept
source: If you accept this chat invite, the users in the chat will be made aware you've accepted. Are you sure you want to accept now?
ta: இந்த அரட்டை அழைப்பை நீங்கள் ஏற்றுக்கொண்டால், அரட்டையில் உள்ள பயனர்கள் நீங்கள் ஏற்றுக்கொண்டீர்கள் என்பதை அறிந்து கொள்வார்கள். நீங்கள் இப்போது ஏற்றுக்கொள்ள விரும்புகிறீர்களா?

# confirm-encryption
source: After you encrypt a chat, you cannot go back to sending messages unencrypted. Are you sure you want to encrypt this chat?
ta: நீங்கள் ஒரு அரட்டையை குறியாக்கிய பிறகு, மறைகுறியாக்கப்பட்ட செய்திகளை அனுப்புவதற்கு நீங்கள் திரும்பிச் செல்ல முடியாது. இந்த அரட்டையை குறியாக்க விரும்புகிறீர்களா?

# confirm-encryption-group
source: After you encrypt a chat, you cannot go back to sending messages unencrypted. Are you sure you want to encrypt this group chat? Please be aware Group E2EE is still a work in progress. You may lose message data!
ta: நீங்கள் ஒரு அரட்டையை குறியாக்கிய பிறகு, மறைகுறியாக்கப்பட்ட செய்திகளை அனுப்புவதற்கு நீங்கள் திரும்பிச் செல்ல முடியாது. இந்த குழு அரட்டையை குறியாக்க விரும்புகிறீர்களா? தயவுசெய்து குழு E2EE இன்னும் ஒரு வேலையில் உள்ளது என்பதை அறிந்து கொள்ளுங்கள். நீங்கள் செய்தி தரவை இழக்க நேரிடும்!

# confirm-advanced-colors
source: Are you sure you want to use advanced color selection? Selecting the same color as the background may prevent you from seeing parts of the app!
ta: மேம்பட்ட வண்ணத் தேர்வைப் பயன்படுத்த விரும்புகிறீர்களா? அதே நிறத்தைத் தேர்ந்தெடுப்பது பயன்பாட்டின் சில பகுதிகளைப் பார்ப்பதிலிருந்து பின்னணி உங்களைத் தடுக்கக்கூடும்!

# confirm-archive-chat-single
source: Are you sure you want to archive the chat "{}"? {} does not yet support viewing archived chats.
ta: அரட்டையை "{}" காப்பகப்படுத்த விரும்புகிறீர்களா? {} காப்பகப்படுத்தப்பட்ட அரட்டைகளைப் பார்ப்பதை இன்னும் ஆதரிக்கவில்லை.

# confirm-archive-chat-multi
source: Are you sure you want to archive all {} selected chats? {} does not yet support viewing archived chats.
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து அரட்டைகளையும் காப்பகப்படுத்த விரும்புகிறீர்களா? {} காப்பகப்படுத்தப்பட்ட அரட்டைகளைப் பார்ப்பதை இன்னும் ஆதரிக்கவில்லை.

# confirm-delete-chat-single
source: Are you sure you want to delete the chat "{}"? Messages sent in this chat will be lost forever.
ta: அரட்டையை "{}" நீக்க விரும்புகிறீர்களா? இந்த அரட்டையில் அனுப்பப்பட்ட செய்திகள் என்றென்றும் இழக்கப்படும்.

# confirm-delete-chat-multi
source: Are you sure you want to delete all {} selected chats? Messages sent in these chats will be lost forever.
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து அரட்டைகளையும் நீக்க விரும்புகிறீர்களா? இந்த அரட்டைகளில் அனுப்பப்பட்ட செய்திகள் என்றென்றும் இழக்கப்படும்.

# confirm-leave-chat-single
source: Are you sure you want to leave the chat "{}"?
ta: அரட்டையை "{}" விட்டுவிட விரும்புகிறீர்களா?

# confirm-leave-chat-single-nonpublic
source: This is not a public chat. You will not be able to rejoin this chat without an invitation.
ta: இது பொது அரட்டை அல்ல. அழைப்பிதழ் இல்லாமல் நீங்கள் மீண்டும் இந்த அரட்டையில் சேர முடியாது.

# confirm-leave-chat-multi
source: Are you sure you want to leave all {} selected chats?
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து அரட்டைகளையும் விட்டுவிட விரும்புகிறீர்களா?

# confirm-leave-chat-multi-nonpublic
source: Some or all of these chats are not public. You will not be able to rejoin these chats without an invitation.
ta: இந்த அரட்டைகள் சில அல்லது அனைத்தும் பொதுவில் இல்லை. அழைப்பிதழ் இல்லாமல் நீங்கள் மீண்டும் இந்த அரட்டைகளில் சேர முடியாது.

# confirm-block-user
source: If you block {}, you will not be able to see their messages and you will immediately leave this chat.
ta: நீங்கள் {that ஐத் தடுத்தால், அவர்களின் செய்திகளை நீங்கள் காண முடியாது, உடனடியாக இந்த அரட்டையை விட்டுவிடுவீர்கள்.

# warning-deactivate-account
source: THIS WILL PERMANENTLY DELETE YOUR ACCOUNT You will be unable to recover any data or access for this account after deactivation. Please take careful consideration before doing this!
ta: இது உங்கள் கணக்கை நிரந்தரமாக நீக்கும் செயலிழந்த பிறகு இந்த கணக்கிற்கான எந்த தரவையும் அணுகலையும் மீட்டெடுக்க முடியாது. இதைச் செய்வதற்கு முன் கவனமாக பரிசீலிக்கவும்!

# warning-deactivate-account-final
source: There is no way to recover this account after it's deleted. You will immediately be logged out of your account and it will become unavailable. This is your final warning regarding deactivation. If you are sure, press deactivate below.
ta: இந்த கணக்கு நீக்கப்பட்ட பிறகு அதை மீட்டெடுக்க வழி இல்லை. நீங்கள் உடனடியாக உங்கள் கணக்கிலிருந்து வெளியேற்றப்படுவீர்கள், அது கிடைக்காது. செயலிழக்க தொடர்பான உங்கள் இறுதி எச்சரிக்கை இது. நீங்கள் உறுதியாக இருந்தால், கீழே செயலிழக்க அழுத்தவும்.

# label-send-unencrypted
source: Send unencrypted message
ta: மறைகுறியாக்கப்பட்ட செய்தியை அனுப்பவும்

# label-send-encrypted
source: Send encrypted message
ta: மறைகுறியாக்கப்பட்ட செய்தியை அனுப்பவும்

# label-show-attachment-options
source: Open attachment options
ta: இணைப்பு விருப்பங்களைத் திறக்கவும்

# label-default
source: Default
ta: இயல்புநிலை

# popup-menu-item-search
source: Search
ta: தேடல்

# popup-menu-item-all-media
source: All Media
ta: அனைத்து ஊடகங்களும்

# popup-menu-item-chat-settings
source: Chat Settings
ta: அரட்டை அமைப்புகள்

# popup-menu-item-invite-friends
source: Invite Friends
ta: நண்பர்களை அழைக்கவும்

# popup-menu-item-mute-notifications
source: Mute Notifications
ta: முடக்கு அறிவிப்புகள்

# semantics-image-intro
source: Relaxed, lounging User
ta: நிதானமான, சத்தமிடும் பயனர்

# semantics-image-private-message
source: A person holding up a private message bubble
ta: ஒரு தனிப்பட்ட செய்தி குமிழியை வைத்திருக்கும் நபர்

# semantics-image-intro-section-third
source: People lounging around and messaging each other
ta: மக்கள் ஒருவருக்கொருவர் சுற்றித் திரிகிறார்கள்

# semantics-image-intro-section-four
source: Two different people feeling confident and lookin' good
ta: இரண்டு வெவ்வேறு நபர்கள் நம்பிக்கையுடன் உணர்கிறார்கள், அழகாக இருக்கிறார்கள்

# semantics-image-empty-chat-list
source: Several tiny, cute monsters peering out behind foliage.
ta: பல சிறிய, அழகான அரக்கர்கள் பசுமையாக பின்னால் வெளியேறுகிறார்கள்.

# semantics-image-terms-of-service
source: Hand holding a phone with a terms of service checkbox checked
ta: பணி விதிமுறைகள் சரிபார்க்கப்பட்ட தொலைபேசியை வைத்திருத்தல்

# semantics-image-signup-username
source: Person resting elbow on I.D. card
ta: ஐ.டி.யில் முழங்கையை ஓய்வெடுக்கும் நபர். அட்டை

# semantics-image-password-reset
source: Person resting arm ontop a letter with a checkbox inside
ta: நபர் மேலே ஒரு கடிதத்துடன் ஒரு கடிதத்தில் கை ஓய்வெடுக்கிறார்

# semantics-create-public-room
source: Create A Public Room
ta: ஒரு பொது அறையை உருவாக்கவும்

# semantics-image-password-update
source: User thinking up a password in a swirl of wind
ta: பயனர் ஒரு கடவுச்சொல்லை காற்றின் சுழற்சியில் சிந்திக்கிறார்

# semantics-close-actions-ring
source: Close Actions Ring
ta: நெருக்கமான செயல்கள் வளையம்

# semantics-open-actions-ring
source: Open Actions Ring
ta: திறந்த செயல்கள் வளையம்

# label-proxy-host
source: Hostname
ta: புரவலன்பெயர்

# label-proxy-port
source: Port
ta: துறைமுகம்

# label-proxy-username
source: Username
ta: பயனர்பெயர்

# label-proxy-password
source: Password
ta: கடவுச்சொல்

# label-password
source: password
ta: கடவுச்சொல்

# tooltip-search-users
source: Search users
ta: பயனர்களைத் தேடுங்கள்

# tooltip-profile-settings
source: Profile and Settings
ta: சுயவிவரம் மற்றும் அமைப்புகள்

# tooltip-search-chats
source: Search Chats
ta: அரட்டைகளைத் தேடுங்கள்

# tooltip-search-unencrypted
source: Search Unencrypted
ta: மறைகுறியாக்கப்படாததைத் தேடுங்கள்

# tooltip-cancel-reply
source: Cancel Reply
ta: பதிலை ரத்துசெய்

# tooltip-message-details
source: Message Details
ta: செய்தி விவரங்கள்

# tooltip-delete-message
source: Delete Message
ta: செய்தியை நீக்கு

# tooltip-edit-message
source: Edit Message
ta: செய்தியைத் திருத்தவும்

# tooltip-copy-message-content
source: Copy Message Content
ta: செய்தி உள்ளடக்கத்தை நகலெடுக்கவும்

# tooltip-quote-and-reply
source: Quote and Reply
ta: மேற்கோள் மற்றும் பதில்

# tooltip-share-chats
source: Share Chats
ta: சேர்காட்
