Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tangram-tangram-*.po
Languages: ta

source: Tangram
ta: டாங்கிராம்

source: Sonny Piers
ta: சோனி பியர்ச்

source: Browser for your pinned tabs
ta: உங்கள் பின் செய்யப்பட்ட தாவல்களுக்கான உலாவி

source: Tangram is a new kind of browser. It is designed to organize and run your Web applications. Each tab is persistent and independent. You can set multiple tabs with different accounts for the same application.
ta: டாங்கிராம் ஒரு புதிய வகையான உலாவி. இது உங்கள் வலை பயன்பாடுகளை ஒழுங்கமைக்கவும் இயக்கவும் வடிவமைக்கப்பட்டுள்ளது. ஒவ்வொரு தாவலும் தொடர்ச்சியான மற்றும் சுயாதீனமானவை. ஒரே பயன்பாட்டிற்கு வெவ்வேறு கணக்குகளுடன் பல தாவல்களை அமைக்கலாம்.

source: Common use cases:
ta: பொதுவான பயன்பாட்டு வழக்குகள்:

source: Stay up to date with your favorite communities; Mastodon, Twitter, ...
ta: உங்களுக்கு பிடித்த சமூகங்களுடன் புதுப்பித்த நிலையில் இருங்கள்; மாச்டோடன், ட்விட்டர், ...

source: Merge all these chat applications into one; WhatsApp, Messenger, Telegram, ...
ta: இந்த அரட்டை பயன்பாடுகள் அனைத்தையும் ஒன்றில் ஒன்றிணைக்கவும்; வாட்ச்அப், மெசஞ்சர், தந்தி, ...

source: Group your organization tools under one application; EMail, Calendar, ...
ta: உங்கள் நிறுவன கருவிகளை ஒரு பயன்பாட்டின் கீழ் தொகுக்கவும்; மின்னஞ்சல், காலண்டர், ...

source: One-stop for multiple sources of documentation or information
ta: ஆவணங்கள் அல்லது தகவல்களின் பல ஆதாரங்களுக்கான ஒரு நிறுத்தம்

source: Fix a bug preventing to start Tangram
ta: டாங்கிராம் தொடங்குவதைத் தடுக்கும் பிழையை சரிசெய்யவும்

source: Reduce the noisiness of logs
ta: பதிவுகளின் சத்தத்தை குறைக்கவும்

source: Fix a bug preventing to add new tabs
ta: புதிய தாவல்களைச் சேர்க்கத் தடுக்கும் பிழையை சரிசெய்யவும்

source: Notifications priority is normal instead of urgent by default
ta: அறிவிப்புகள் முன்னிருப்பாக அவசரத்திற்கு பதிலாக முன்னுரிமை இயல்பானது

source: Add a per-tab setting to change notifications priority
ta: அறிவிப்புகளின் முன்னுரிமையை மாற்ற ஒரு தாவல் அமைப்பைச் சேர்க்கவும்

source: Fix authentication on many popular websites
ta: பல பிரபலமான வலைத்தளங்களில் அங்கீகாரத்தை சரிசெய்யவும்

source: Fix Cancel button in tab settings dialog
ta: தாவல் அமைப்புகள் உரையாடலில் ரத்துசெய் பொத்தானை சரிசெய்யவும்

source: Use middle-click or Ctrl+click to open links in the browser
ta: உலாவியில் இணைப்புகளைத் திறக்க நடுத்தர சொடுக்கு அல்லது Ctrl+ஐப் பயன்படுத்தவும்

source: Fix window title
ta: சாளர தலைப்பை சரிசெய்யவும்

source: Update GNOME runtime to 41
ta: க்னோம் இயக்க நேரத்தை 41 ஆக புதுப்பிக்கவும்

source: Fix an issue preventing some sites such as Twitter or Facebook from being added.
ta: ட்விட்டர் அல்லது பேச்புக் போன்ற சில தளங்கள் சேர்க்கப்படுவதைத் தடுக்கும் சிக்கலை சரிசெய்யவும்.

source: Update GNOME runtime to 3.38
ta: க்னோம் இயக்க நேரத்தை 3.38 ஆக புதுப்பிக்கவும்

source: Enable spell checking
ta: எழுத்துப்பிழை சோதனையை இயக்கவும்

source: Customizable user-agent per instance
ta: ஒரு உதாரணமாக தனிப்பயனாக்கக்கூடிய பயனர் முகவர்

source: New project icon/logo
ta: புதிய திட்ட ஐகான்/லோகோ

source: New tab background color respects dark mode
ta: புதிய தாவல் பின்னணி வண்ணம் இருண்ட பயன்முறையை மதிக்கிறது

source: Add support for downloading files
ta: கோப்புகளைப் பதிவிறக்குவதற்கான ஆதரவைச் சேர்க்கவும்

source: Add home button
ta: முகப்பு பொத்தானைச் சேர்க்கவும்

source: Better desktop integration
ta: சிறந்த டெச்க்டாப் ஒருங்கிணைப்பு

source: Fix the main window becoming tiny when unmaximizing
ta: முதன்மையான சாளரத்தை உமிழ்ந்து பார்க்கும்போது சிறியதாக மாற்றுவதை சரிசெய்யவும்

source: Enable touchpad/touchscreen swipe navigation gestures
ta: டச்பேட்/தொடுதிரை ச்வைப் வழிசெலுத்தல் சைகைகளை இயக்கவும்

source: Better notifications handling
ta: சிறந்த அறிவிப்புகள் கையாளுதல்

source: Improved web compatibility and performances
ta: மேம்படுத்தப்பட்ட வலை பொருந்தக்கூடிய தன்மை மற்றும் செயல்திறன்

source: Tangram now works properly on Flatpak 1.0 (Linux Mint, Ubuntu 18.04, ...)
ta: டாங்கிராம் இப்போது பிளாட்பாக் 1.0 இல் சரியாக வேலை செய்கிறது (லினக்ச் புதினா, உபுண்டு 18.04, ...)

source: Franz;Ferdi;Rambox;Wavebox;Station;
ta: ஃபிரான்ச்; ஃபெர்டி; ராம்பாக்ச்; அலைவரிசை; நிலையம்;

source: Tabs position
ta: தாவல்கள் நிலை

source: Sets the position of the tabs
ta: தாவல்களின் நிலையை அமைக்கிறது

source: Window width
ta: சாளர அகலம்

source: Width of the window
ta: சாளரத்தின் அகலம்

source: Window height
ta: விண்டர் உயரம்

source: Height of the window
ta: சாளரத்தின் உயரம்

source: Window maximized
ta: சாளரம் அதிகரிக்கப்பட்டது

source: Whether the window is maximized
ta: சாளரம் அதிகரிக்கப்பட்டுள்ளதா

source: Instances
ta: நிகழ்வுகள்

source: Identifiers of instances to be found in /re/sonny/Tangram/instances/
ta: /மறு/சோனி/டாங்கிராம்/நிகழ்வுகளில் காணப்பட வேண்டிய நிகழ்வுகளின் அடையாளங்காட்டிகள்/

source: Name
ta: பெயர்

source: Name to display
ta: காண்பிக்க பெயர்

source: URL
ta: முகவரி

source: Start URL
ta: முகவரி ஐத் தொடங்கவும்

source: User agent
ta: பயனர் முகவர்

source: String that will be used as user agent, to identify the browser to the web servers.
ta: வலை சேவையகங்களுக்கு உலாவியை அடையாளம் காண, பயனர் முகவராகப் பயன்படுத்தப்படும் சரம்.

source: Notifications priority
ta: அறிவிப்புகள் முன்னுரிமை

source: Sets the priority of notifications
ta: அறிவிப்புகளின் முன்னுரிமையை அமைக்கிறது

source: translator-credits
ta: மொழிபெயர்ப்பாளர்-வரவு

source: Normal
ta: சாதாரண

source: Low
ta: குறைந்த

source: High
ta: உயர்ந்த

source: Urgent
ta: விரைவு

# shortcut window
source: General
ta: பொது

# shortcut window
source: Go to the next tab
ta: அடுத்த தாவலுக்குச் செல்லவும்

# shortcut window
source: Go to the previous tab
ta: முந்தைய தாவலுக்குச் செல்லவும்

# shortcut window
source: Move current tab to the left
ta: தற்போதைய தாவலை இடதுபுறமாக நகர்த்தவும்

# shortcut window
source: Move current tab to the right
ta: தற்போதைய தாவலை வலதுபுறமாக நகர்த்தவும்

# shortcut window
source: Quit
ta: வெளியேறு

# shortcut window
source: Shortcuts
ta: குறுக்குவழிகள்

# shortcut window
source: Toggle inspector
ta: இன்ச்பெக்டரை மாற்றவும்

# shortcut window
source: First – Ninth Tab
ta: முதல் - ஒன்பதாவது தாவல்

# shortcut window
source: Navigation
ta: வானோடல்

# shortcut window
source: Go to homepage
ta: முகப்புப்பக்கத்திற்குச் செல்லுங்கள்

# shortcut window
source: Reload current page
ta: தற்போதைய பக்கத்தை மீண்டும் ஏற்றவும்

# shortcut window
source: Reload bypassing cache
ta: கேச் பைபாசிங் மீண்டும் ஏற்றவும்

# shortcut window
source: Stop loading current page
ta: தற்போதைய பக்கத்தை ஏற்றுவதை நிறுத்துங்கள்

# shortcut window
source: Go back to the previous page
ta: முந்தைய பக்கத்திற்குச் செல்லவும்

# shortcut window
source: Go forward to the next page
ta: அடுத்த பக்கத்திற்கு முன்னேறவும்

# shortcut window
source: Focus the address bar
ta: முகவரி பட்டியில் கவனம் செலுத்துங்கள்

source: Top
ta: மேலே

source: Left
ta: இடது

source: Right
ta: வலது

source: Bottom
ta: கீழே

source: Keyboard Shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

source: About Tangram
ta: டாங்கிராம் பற்றி
