Repository: 247i/TACETr
Catalog: உரை/வெறுமை/terriajs-terriajsnext-*.po
Languages: ta

# description.downloadInFormat
source: Download the currently selected data in {{format}} format
ta: தற்போது தேர்ந்தெடுக்கப்பட்ட தரவை {{format}} வடிவத்தில் பதிவிறக்கவும்

# description.downloadNotSupported
source: Unfortunately your browser does not support the functionality needed to download this data as a file. Please use $t(browsers.chrome), $t(browsers.firefox), $t(browsers.edge), or $t(browsers.safari) to download this data.
ta: துரதிர்ச்டவசமாக உங்கள் உலாவி இந்தத் தரவை ஒரு கோப்பாகப் பதிவிறக்குவதற்குத் தேவையான செயல்பாட்டை ஆதரிக்காது. இந்தத் தரவைப் பதிவிறக்க $t(browsers.chrome), $t(browsers.firefox), $t(browsers.edge) அல்லது $t(browsers.safari) ஐப் பயன்படுத்தவும்.

# description.useTheLinkToDownload
source: Use the link below to download the data directly.
ta: தரவை நேரடியாக பதிவிறக்க கீழே உள்ள இணைப்பைப் பயன்படுத்தவும்.

# description.downloadData
source: Download Data
ta: தரவைப் பதிவிறக்கவும்

# description.dataSourceDetails
source: Data Source Details
ta: தரவு மூல விவரங்கள்

# description.dataServiceDetails
source: Data Service Details
ta: தரவு பணி விவரங்கள்

# description.dataCustodian
source: Data Custodian
ta: தரவு பாதுகாவலர்

# workbench.colorScaleRangeTitle
source: Invalid color scale range
ta: தவறான வண்ண அளவிலான வரம்பு

# workbench.colorScaleRangeMin
source: The minimum value must be a number.
ta: குறைந்தபட்ச மதிப்பு ஒரு எண்ணாக இருக்க வேண்டும்.

# workbench.colorScaleRangeMax
source: The maximum value must be a number.
ta: அதிகபட்ச மதிப்பு ஒரு எண்ணாக இருக்க வேண்டும்.

# workbench.colorScaleRangeMinSmallerThanMax
source: The minimum value of the color scale range must be less than the maximum value.
ta: வண்ண அளவிலான வரம்பின் குறைந்தபட்ச மதிப்பு அதிகபட்ச மதிப்பை விட குறைவாக இருக்க வேண்டும்.

# workbench.colorScaleRange
source: Color Scale Range
ta: வண்ண அளவிலான வரம்பு

# workbench.rangeMax
source: Maximum:
ta: அதிகபட்சம்:

# workbench.rangeMin
source: Minimum:
ta: குறைந்தபட்சம்:

# workbench.colorScaleUpdateRange
source: Update Range
ta: வரம்பு புதுப்பிப்பு

# workbench.displayPercent
source: Display as a percentage of regional total
ta: பிராந்திய மொத்தத்தின் சதவீதமாக காண்பிக்கப்படுகிறது

# workbench.opacity
source: Opacity: {{opacity}} %
ta: ஒளிபுகாநிலை: {{opacity}} %

# workbench.zoomToTitle
source: Zoom to extent
ta: பெரிதாக்க பெரிதாக்கவும்

# workbench.zoomTo
source: Ideal Zoom
ta: சிறந்த சூம்

# workbench.openFeatureTitle
source: Zoom to data
ta: தரவை பெரிதாக்கவும்

# workbench.openFeature
source: Zoom to
ta: பெரிதாக்கவும்

# workbench.previewItemTitle
source: About this data
ta: இந்த தரவு பற்றி

# workbench.showMoreActionsTitle
source: Show more actions
ta: மேலும் செயல்களைக் காட்டு

# workbench.previewItem
source: About Data
ta: தரவு பற்றி

# workbench.splitItemTitle
source: Duplicate and show splitter
ta: நகல் மற்றும் ச்ப்ளிட்டரைக் காட்டு

# workbench.splitItem
source: Compare
ta: ஒப்பிடுக

# workbench.diffImageTitle
source: View image differences between two dates
ta: இரண்டு தேதிகளுக்கு இடையிலான பட வேறுபாடுகளைக் காண்க

# workbench.diffImage
source: Difference
ta: வேறுபாடு

# workbench.exportDataTitle
source: Export map data
ta: வரைபட தரவை ஏற்றுமதி செய்யுங்கள்

# workbench.exportData
source: Export
ta: ஏற்றுமதி

# workbench.removeFromMapTitle
source: Remove this data
ta: இந்த தரவை அகற்று

# workbench.removeFromMap
source: Remove
ta: அகற்று

# workbench.label
source: Datasets
ta: தரவுத்தொகுப்புகள்

# workbench.removeAll
source: Remove All
ta: அனைத்தையும் அகற்று

# workbench.collapseAll
source: Collapse All
ta: அனைத்தையும் சரக்கு

# workbench.expandAll
source: Expand All
ta: அனைத்தையும் விரிவாக்குங்கள்

# workbench.disableAll
source: Disable All
ta: அனைத்தையும் முடக்கு

# workbench.enableAll
source: Enable All
ta: அனைத்தையும் இயக்கு

# workbench.toggleVisibility
source: Data show/hide
ta: தரவு காண்பி/மறைக்க

# workbench.addItemErrorTitle
source: Catalog item could not be added to workbench.
ta: பட்டியல் உருப்படியை வொர்க் பெஞ்சில் சேர்க்க முடியவில்லை.

# workbench.addItemErrorMessage
source: An error occurred while loading the catalog item.
ta: பட்டியல் உருப்படியை ஏற்றும்போது பிழை ஏற்பட்டது.

# workbench.searchItem
source: Search
ta: தேடல்

# workbench.searchItemTitle
source: Search
ta: தேடல்

# workbench.splitScreenMode
source: SPLIT SCREEN MODE
ta: திரை பயன்முறையைப் பிரிக்கவும்

# dateTime.selectorLabel
source: Time:
ta: நேரம்:

# dateTime.back
source: Go back
ta: திரும்பிச் செல்லுங்கள்

# dateTime.previous
source: Previous time
ta: முந்தைய நேரம்

# dateTime.selectTime
source: Select a time
ta: ஒரு நேரத்தைத் தேர்ந்தெடுக்கவும்

# dateTime.outOfRange
source: Currently out of range.
ta: தற்போது வரம்பிற்கு வெளியே.

# dateTime.next
source: Next time
ta: அடுத்த முறை

# dateTime.useTimeline
source: Use timeline
ta: காலவரிசை பயன்படுத்தவும்

# dateTime.availableTimeChart
source: Show available times on chart
ta: விளக்கப்படத்தில் கிடைக்கும் நேரங்களைக் காட்டு

# dateTime.timeline.textCell
source: Name of the dataset whose time range is shown
ta: தரவுத்தொகுப்பின் பெயர் அதன் நேர வரம்பு காட்டப்பட்டுள்ளது

# dateTime.timeline.gotoStart
source: Go to beginning
ta: தொடக்கத்திற்குச் செல்லுங்கள்

# dateTime.timeline.togglePlay
source: Play
ta: விளையாடுங்கள்

# dateTime.timeline.playSlower
source: Play Slower
ta: மெதுவாக விளையாடுங்கள்

# dateTime.timeline.playFaster
source: Play Faster
ta: வேகமாக விளையாடுங்கள்

# satellite.pickPoint
source: Select a point by clicking on the map.
ta: வரைபடத்தில் சொடுக்கு செய்வதன் மூலம் ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும்.

# satellite.querying
source: Querying position...
ta: வினவல் நிலை ...

# satellite.filterByLocation
source: Filter by location
ta: இருப்பிடம் மூலம் வடிகட்டவும்

# satellite.infoGroup
source: Only showing available capture times for:
ta: கிடைக்கக்கூடிய பிடிப்பு நேரங்களை மட்டுமே காண்பிக்கும்:

# satellite.removeFilter
source: Remove filter
ta: வடிகட்டியை அகற்று

# satellite.zoomTo
source: Zoom to
ta: பெரிதாக்கவும்

# satellite.newLocation
source: New location
ta: புதிய இடம்

# timer.nextScheduledUpdateTime
source: Next data update at {{scheduledUpdateTime}}
ta: அடுத்த தரவு புதுப்பிப்பு {{scheduledUpdateTime}}

# timer.nextScheduledUpdateCountdown
source: Next data update in {{timeCountdown}}
ta: அடுத்த தரவு புதுப்பிப்பு {{timeCountdown}}

# concept.active.edit
source: Edit condition
ta: நிபந்தனையைத் திருத்து

# concept.active.remove
source: Remove condition
ta: நிலையை அகற்று

# concept.inactive.cancel
source: Cancel
ta: ரத்துசெய்

# concept.inactive.newText
source: New condition
ta: புதிய நிலை

# concept.summary.addMoreText
source: Add a condition
ta: ஒரு நிபந்தனையைச் சேர்க்கவும்

# concept.summary.addFirstText
source: Add new condition
ta: புதிய நிபந்தனையைச் சேர்க்கவும்

# clipboard.success
source: Copied to clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது

# clipboard.unsuccessful
source: Copy unsuccessful...
ta: நகல் தோல்வியுற்றது ...

# clipboard.shareURL
source: Share URL
ta: முகவரி ஐப் பகிரவும்

# clipboard.shareExplanation
source: Anyone with this URL will be able to access this map.
ta: இந்த முகவரி உள்ள எவரும் இந்த வரைபடத்தை அணுக முடியும்.

# clipboard.copy
source: Copy
ta: நகலெடு

# includeStory.message
source: Include Story in Share
ta: கதையை பங்கில் சேர்க்கவும்

# dragDrop.text
source: <0>Drag & Drop</0><1>Your data anywhere to view on the map<1>
ta: <0> இழுத்து விடுங்கள் </0> <1> வரைபடத்தில் காண உங்கள் தரவு எங்கும் <1>

# dragDrop.notification
source: <0>"{{fileNames}}"</0> has been added to <4>My Data</4>.
ta: <0> "{{fileNames}}" </0> <4> எனது தரவு </4> இல் சேர்க்கப்பட்டது.

# loader.loadingMessage
source: Loading
ta: ஏற்றுகிறது

# emptyWorkbenchInfo[0].heading
source: Add a dataset here
ta: இங்கே ஒரு தரவுத்தொகுப்பைச் சேர்க்கவும்

# emptyWorkbenchInfo[0].body
source: When you add a dataset, its legend and settings appear here.
ta: நீங்கள் ஒரு தரவுத்தொகுப்பைச் சேர்க்கும்போது, அதன் புராணக்கதை மற்றும் அமைப்புகள் இங்கே தோன்றும்.

# emptyWorkbenchInfo[1].heading
source: Get started
ta: தொடங்கவும்

# emptyWorkbenchInfo[1].list[0]
source: Click Explore data to view available datasets
ta: கிடைக்கக்கூடிய தரவுத்தொகுப்புகளைக் காண தரவை ஆராயுங்கள் என்பதைக் சொடுக்கு செய்க

# emptyWorkbenchInfo[1].list[1]
source: Upload your own via Upload data
ta: பதிவேற்றும் தரவு வழியாக உங்கள் சொந்த பதிவேற்றவும்

# emptyWorkbenchInfo[1].list[2]
source: Find your added data in this panel
ta: இந்த குழுவில் உங்கள் கூடுதல் தரவைக் கண்டறியவும்

# emptyWorkbenchInfo[2].heading
source: What you can do
ta: நீங்கள் என்ன செய்ய முடியும்

# emptyWorkbenchInfo[2].list[0]
source: Show or hide data
ta: தரவைக் காட்டவும் அல்லது மறைக்கவும்

# emptyWorkbenchInfo[2].list[1]
source: Adjust transparency (opacity)
ta: வெளிப்படைத்தன்மையை சரிசெய்யவும் (ஒளிபுகாநிலை)

# emptyWorkbenchInfo[2].list[2]
source: Compare side-by-side
ta: பக்கவாட்டாக ஒப்பிடுக

# emptyWorkbenchInfo[2].list[3]
source: Change styles (colours, lines, symbols)
ta: பாணிகளை மாற்றவும் (வண்ணங்கள், கோடுகள், சின்னங்கள்)

# emptyWorkbenchInfo[2].list[4]
source: View different dates and times (if supported)
ta: வெவ்வேறு தேதிகள் மற்றும் நேரங்களைக் காண்க (ஆதரிக்கப்பட்டால்)

# emptyWorkbenchInfo[3].body
source: Use this panel to explore data, manage settings, and build your map scene or story.
ta: தரவை ஆராயவும், அமைப்புகளை நிர்வகிக்கவும், உங்கள் வரைபடக் காட்சி அல்லது கதையை உருவாக்கவும் இந்த குழுவைப் பயன்படுத்தவும்.

# dataCatalog.groupRemove
source: remove this group
ta: இந்த குழுவை அகற்று

# dataCatalog.groupEmpty
source: This group is empty
ta: இந்த குழு காலியாக உள்ளது

# catalogItem.privateIndicatorTitle
source: Private Dataset
ta: தனிப்பட்ட தரவுத்தொகுப்பு

# catalogItem.loading
source: Loading...
ta: ஏற்றுகிறது ...

# catalogItem.remove
source: Remove
ta: அகற்று

# catalogItem.add
source: Add
ta: கூட்டு

# catalogItem.trash
source: Remove from catalogue
ta: பட்டியலிலிருந்து அகற்று

# catalogItem.removeFromMap
source: Remove from map
ta: வரைபடத்திலிருந்து அகற்று

# catalogItem.preview
source: Preview
ta: முன்னோட்டம்

# chart.sectionLabel
source: Charts
ta: விளக்கப்படங்கள்

# chart.closePanel
source: Close Panel
ta: மூடு குழு

# chart.expand
source: Expand
ta: விரிவாக்கு

# chart.download
source: Download
ta: பதிவிறக்கம்

# chart.showItemInChart
source: Show {{value}} in chart
ta: விளக்கப்படத்தில் {{value}} ஐக் காட்டு

# chart.loading
source: Loading chart data...
ta: விளக்கப்பட தரவை ஏற்றுகிறது ...

# chart.noData
source: No chart data found.
ta: விளக்கப்பட தரவு எதுவும் கிடைக்கவில்லை.

# viewModels.searchNoLocations
source: Sorry, no locations match your search query.
ta: மன்னிக்கவும், உங்கள் தேடல் வினவலுடன் எந்த இடங்களும் பொருந்தவில்லை.

# viewModels.searchErrorOccurred
source: An error occurred while searching. Please check your internet connection or try again later.
ta: தேடும்போது பிழை ஏற்பட்டது. உங்கள் இணைய இணைப்பைச் சரிபார்க்கவும் அல்லது பின்னர் மீண்டும் முயற்சிக்கவும்.

# viewModels.searchMinCharacters
source: You need to enter minimum {{count}} character
ta: நீங்கள் குறைந்தபட்ச {{count}} எழுத்தை உள்ளிட வேண்டும்

# viewModels.searchAddresses
source: Addresses
ta: முகவரிகள்

# viewModels.searchPlaceNames
source: Official Place Names
ta: அதிகாரப்பூர்வ இட பெயர்கள்

# viewModels.searchNoPlaceNames
source: Sorry, no official place names match your search query.
ta: மன்னிக்கவும், உத்தியோகபூர்வ இடப் பெயர்கள் உங்கள் தேடல் வினவலுடன் பொருந்தவில்லை.

# viewModels.searchLocations
source: Locations
ta: இருப்பிடங்கள்

# viewModels.searchCatalogueItem
source: Catalogue Items
ta: அட்டவணை உருப்படிகள்

# viewModels.searchNoCatalogueItem
source: Sorry, no catalogue items match your search query.
ta: மன்னிக்கவும், உங்கள் தேடல் வினவலுடன் எந்த பட்டியல் உருப்படிகளும் பொருந்துகின்றன.

# viewModels.inMultipleLocations
source: In multiple locations including:
ta: உட்பட பல இடங்களில்:

# viewModels.inDataCatalogue
source: In Data Catalogue
ta: தரவு பட்டியலில்

# terriaViewer.slowWebGLAvailableTitle
source: Poor WebGL performance
ta: மோசமான வெப்சிஎல் செயல்திறன்

# terriaViewer.slowWebGLAvailableMessage
source: Your web browser reports that it has performance issues displaying {{appName}} in 3D, so you will see a limited, 2D-only experience. For the full 3D experience, please try using a different web browser, upgrading your video drivers, or upgrading your operating system.
ta: உங்கள் வலை உலாவி 3D இல் {{appName}}ஐக் காண்பிக்கும் செயல்திறன் சிக்கல்களைக் கொண்டுள்ளது என்று தெரிவிக்கிறது, எனவே நீங்கள் ஒரு வரையறுக்கப்பட்ட, 2D மட்டும் அனுபவத்தைக் காண்பீர்கள். முழு 3D அனுபவத்திற்கு, தயவுசெய்து வேறு வலை உலாவியைப் பயன்படுத்த முயற்சிக்கவும், உங்கள் வீடியோ இயக்கிகளை மேம்படுத்தவும் அல்லது உங்கள் இயக்க முறைமையை மேம்படுத்தவும் முயற்சிக்கவும்.

# terriaViewer.slowWebGLAvailableMessageII
source: {{appName}} works best with a web browser that supports {{webGL}} including the latest versions of $t(browsers.chrome), $t(browsers.firefox), $t(browsers.edge), and $t(browsers.safari). Your web browser does not appear to support WebGL, so you will see a limited, 2D-only experience.
ta: {{appName}} விரலிடைத் தோல் {{webGL}} ஐ ஆதரிக்கும் வலை உலாவியுடன் சிறப்பாகச் செயல்படுகிறது $t(browsers.chrome), $t(browsers.firefox), $t(browsers.edge), மற்றும் $t(browsers.safari). உங்கள் வலை உலாவி Webgl ஐ ஆதரிப்பதாகத் தெரியவில்லை, எனவே நீங்கள் ஒரு வரையறுக்கப்பட்ட, 2D மட்டும் அனுபவத்தைக் காண்பீர்கள்.

# terriaViewer.webGLNotSupportedTitle
source: WebGL not supported
ta: Webgl ஆதரிக்கப்படவில்லை

# terriaViewer.webGLNotSupportedOrSlowTitle
source: WebGL not supported or too slow
ta: வெப்சிஎல் ஆதரிக்கப்படவில்லை அல்லது மிக மெதுவாக இல்லை

# terriaViewer.webGLNotSupportedOrSlowMessage
source: Your web browser cannot display the map in 3D, either because it does not support WebGL or because your web browser has reported that WebGL will be extremely slow. Please try a different web browser, such as the latest version of $t(browsers.chrome), $t(browsers.firefox), $t(browsers.edge), or $t(browsers.safari). In some cases, you may need to upgrade your computer's video driver or operating system in order to get the 3D view in {{appName}}.
ta: உங்கள் வலை உலாவி 3D இல் வரைபடத்தைக் காண்பிக்க முடியாது, ஏனெனில் அது வெப்எல்லை ஆதரிக்காதது அல்லது வெப்சிஎல் மிகவும் மெதுவாக இருக்கும் என்று உங்கள் வலை உலாவித் தெரிவித்துள்ளதால். $t(browsers.chrome), $t(browsers.firefox), $t(browsers.edge) அல்லது $t(browsers.safari)ஆகியவற்றின் அண்மைக் கால பதிப்பு போன்ற வேறு வலை உலாவியை முயற்சிக்கவும். சில சந்தர்ப்பங்களில், 3D பார்வையை {{appName}} இல் பெற உங்கள் கணினியின் வீடியோ இயக்கி அல்லது இயக்க முறைமையை மேம்படுத்த வேண்டியிருக்கலாம்.

# analytics.selectLocation
source: Select Location
ta: இருப்பிடத்தைத் தேர்ந்தெடுக்கவும்

# analytics.point
source: Point (lat/lon)
ta: புள்ளி (லாட்/லோன்)

# analytics.polygon
source: Polygon
ta: பலகோணம்

# analytics.existingPolygon
source: Existing Polygon
ta: தற்போதுள்ள பலகோணம்

# analytics.nothingSelected
source: Nothing has been selected, please use the buttons above to make a selection.
ta: எதுவும் தேர்ந்தெடுக்கப்படவில்லை, தயவுசெய்து ஒரு தேர்வு செய்ய மேலே உள்ள பொத்தான்களைப் பயன்படுத்தவும்.

# analytics.runAnalysis
source: Run Analysis
ta: பகுப்பாய்வு ரன்

# analytics.clickToDrawLine
source: Click to draw line
ta: வரியை வரைய சொடுக்கு செய்க

# analytics.enterValidCoords
source: Please enter valid coordinates (e.g. 131.0361, -25.3450).
ta: செல்லுபடியாகும் ஆயங்களை உள்ளிடவும் (எ.கா. 131.0361, -25.3450).

# analytics.selectPoint
source: Select a point by clicking on the map.
ta: வரைபடத்தில் சொடுக்கு செய்வதன் மூலம் ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும்.

# analytics.clickToDrawPolygon
source: Click to draw polygon
ta: பலகோணத்தை வரைய சொடுக்கு செய்க

# analytics.shiftToDrawRectangle
source: Press the SHIFT key and hold down the left mouse button to draw a rectangle
ta: சிப்ட் விசையை அழுத்தி, ஒரு செவ்வகத்தை வரைய இடது சுட்டி பொத்தானை அழுத்திப் பிடித்துக் கொள்ளுங்கள்

# analytics.clickToDrawRectangle
source: Click to draw rectangle
ta: செவ்வகத்தை வரைய சொடுக்கு செய்க

# analytics.selectedPolygon
source: Selected Polygon
ta: தேர்ந்தெடுக்கப்பட்ட பலகோணம்

# analytics.regionName
source: Region name
ta: பகுதி பெயர்

# analytics.selectExistingPolygon
source: Select existing polygon
ta: இருக்கும் பலகோணத்தைத் தேர்ந்தெடுக்கவும்

# core.errors.tooDeepAddedByUser
source: Reached 100 catalog items when checking addedByUser and landing on ID: "{{memberId}}"? Check that you haven't got a recursive catalog group.
ta: சேர்க்கப்பட்ட பியூசரைச் சரிபார்த்து ஐடியில் தரையிறங்கும் போது 100 பட்டியல் உருப்படிகளை அடைந்தது: "{{memberId}}"? உங்களிடம் ஒரு சுழல்நிலை பட்டியல் குழு கிடைக்கவில்லை என்பதை சரிபார்க்கவும்.

# core.userAddedData
source: User-Added Data
ta: பயனர் சேர்க்கப்பட்ட தரவு

# core.chartData
source: Chart Data
ta: விளக்கப்படம் தரவு

# core.dataUri.errorTitle
source: Browser Does Not Support Data Download
ta: தரவு பதிவிறக்கத்தை உலாவி ஆதரிக்காது

# core.dataUri.errorMessage
source: Unfortunately Microsoft browsers (including all versions of Internet Explorer and Edge) do not support the data uri functionality needed to download data as a file. To download, copy the following uri into another browser such as $t(browsers.chrome), $t(browsers.firefox), or $t(browsers.safari): {{href}}
ta: துரதிர்ச்டவசமாக நுண்மென் உலாவிகள் (இன்டர்நெட் எக்ச்ப்ளோரர் மற்றும் எட்ச் ஆகியவற்றின் அனைத்து பதிப்புகளும் உட்பட) தரவை ஒரு கோப்பாகப் பதிவிறக்கம் செய்யத் தேவையான தரவு யூரி செயல்பாட்டை ஆதரிக்காது. பதிவிறக்க, பின்வரும் யூரி ஐ $t(browsers.chrome), $t(browsers.firefox), அல்லது $t(browsers.safari) போன்ற மற்றொரு உலாவியில் நகலெடுக்கவும்: {{href}}

# core.dataType.auto
source: File type
ta: கோப்பு வகை

# core.dataType.wms-group
source: Web Map Service (WMS) Server
ta: வலை வரைபட பணி (WMS) சேவையகம்

# core.dataType.wmts-group
source: Web Map Tile Service (WMTS) Server
ta: வலை வரைபட ஓடு பணி (WMTS) சேவையகம்

# core.dataType.wfs-group
source: Web Feature Service (WFS) Server
ta: வலை அம்ச பணி (WFS) சேவையகம்

# core.dataType.wps-getCapabilities
source: Web Processing Service (WPS) Server
ta: வலை செயலாக்க பணி (WPS) சேவையகம்

# core.dataType.esri-group
source: Esri ArcGIS Server
ta: ESRI ARCGIS சேவையகம்

# core.dataType.esri-mapServer
source: Esri ArcGIS MapServer (single layer)
ta: ESRI ARCGIS MAPSERVER (ஒற்றை அடுக்கு)

# core.dataType.esri-imageServer
source: Esri ArcGIS ImageServer (single layer)
ta: ESRI ARCGIS PIGRESEVER (ஒற்றை அடுக்கு)

# core.dataType.esri-featureServer
source: Esri ArcGIS FeatureServer (single layer)
ta: ESRI ARCGIS நற்பொருத்தங்கள் (ஒற்றை அடுக்கு)

# core.dataType.3d-tiles
source: 3D Tiles
ta: 3 டி ஓடுகள்

# core.dataType.open-street-map
source: Open Street Map Server
ta: தெரு வரைபட சேவையகத்தைத் திறக்கவும்

# core.dataType.opendatasoft-group
source: Opendatasoft Portal
ta: Opendatasoft போர்ட்டல்

# core.dataType.geojson
source: GeoJSON
ta: சியோச்சன்

# core.dataType.geoRss
source: GeoRSS
ta: சார்ச்

# core.dataType.kml
source: KML or KMZ
ta: KMLM அல்லது KMZ

# core.dataType.csv
source: CSV
ta: சிஎச்வி

# core.dataType.gpx
source: GPX
ta: சி.பி.எக்ச்

# core.dataType.json
source: Terria Catalog
ta: டெரியா பட்டியல்

# core.dataType.carto
source: Carto V1
ta: அட்டை வி 1

# core.dataType.carto-v3
source: Carto V3
ta: மன்னன்

# core.dataType.shp
source: Shapefile
ta: சேப்ஃபைல்

# core.dataType.socrata-group
source: Socrata Server
ta: சொக்ராட்டா சேவையகம்

# core.dataType.assimp-local
source: 3D file converter (zip) (experimental)
ta: 3D கோப்பு மாற்றி (சிப்) (சோதனை)

# core.dataType.assimp-local-description
source: **Warning:** 3D file converter is experimental. See list of [supported formats](https://github.com/assimp/assimp/blob/master/doc/Fileformats.md). Files must be zipped.
ta: ** எச்சரிக்கை: ** 3D கோப்பு மாற்றி சோதனை. [ஆதரவு வடிவங்களின்] பட்டியலைக் காண்க (https://github.com/assimp/assimp/blob/master/doc/fileformats.md). கோப்புகளை சிப் செய்ய வேண்டும்.

# core.dataType.assimp-remote
source: 3D file converter (experimental)
ta: 3D கோப்பு மாற்றி (சோதனை)

# core.dataType.assimp-remote-description
source: **Warning:** 3D file converter is experimental. See list of [supported formats](https://github.com/assimp/assimp/blob/master/doc/Fileformats.md). Zip files are also supported
ta: ** எச்சரிக்கை: ** 3D கோப்பு மாற்றி சோதனை. [ஆதரவு வடிவங்களின்] பட்டியலைக் காண்க (https://github.com/assimp/assimp/blob/master/doc/fileformats.md). சிப் கோப்புகளும் ஆதரிக்கப்படுகின்றன

# core.dataType.cog
source: Cloud Optimised Geotiff
ta: முகில் உகந்த சியோடிஃப்

# core.dataType.cesium-ion
source: Cesium ion
ta: சீசியம் அயன்

# core.printWindow.errorTitle
source: Error printing
ta: பிழை அச்சிடுதல்

# core.printWindow.errorMessage
source: Printing did not start within 10 seconds. Maybe this web browser does not support printing?
ta: அச்சிடுதல் 10 வினாடிகளுக்குள் தொடங்கவில்லை. ஒருவேளை இந்த வலை உலாவி அச்சிடுவதை ஆதரிக்கவில்லையா?

# core.printWindow.printMediaStart
source: print media start
ta: ஊடகங்கள் தொடங்குகின்றன

# core.printWindow.printMediaEnd
source: print media end
ta: மீடியா எண்ட் அச்சு

# core.printWindow.onbeforeprint
source: onbeforeprint
ta: அச்சிடும்முன்

# core.printWindow.onafterprint
source: onafterprint
ta: அச்சிட்டபின்

# core.consoleAnalytics.started
source: ConsoleAnalytics was started.
ta: ஒருங்கிணைப்பு தொடங்கப்பட்டது.

# core.consoleAnalytics.startedNoenableConsoleAnalytics
source: ConsoleAnalytics was started, however `configParameters.enableConsoleAnalytics` was not defined or set to false.
ta: `Configparameters.enableConsolanalytics` வரையறுக்கப்படவில்லை அல்லது பொய்யாக அமைக்கப்படவில்லை.

# core.consoleAnalytics.logStartedWithGAParameters
source: ConsoleAnalytics was started but a `googleAnalyticsKey` or `googleAnalyticsOptions` key was observed on `configParameters`
ta: CONCOLEANALITICS தொடங்கப்பட்டது, ஆனால் `googleanalyticskey` அல்லது` googlanaliticsoptions` விசை `கட்டமைப்பாளர்களில்` காணப்பட்டது

# core.googleAnalytics.log
source: Google Analytics tracking is disabled because terria.configParameters.googleAnalyticsKey is not specified
ta: கூகின் பகுப்பாய்வு கண்கானி முடக்கப்பட்டுள்ளது, ஏனெனில் terria.configParameters.googleAnalyticsKey குறிப்பிடவில்லை

# core.googleAnalytics.logEnabledOnDevelopment
source: Google Analytics was initialised in a `development` environment
ta: கூகிள் அனலிட்டிக்ச் ஒரு `வளர்ச்சி` சூழலில் தொடங்கப்பட்டது

# core.readText.fileRequired
source: file is require
ta: கோப்பு தேவை

# core.readXml.xmlError
source: The file does not contain valid XML.
ta: கோப்பில் செல்லுபடியாகும் எக்ச்எம்எல் இல்லை.

# core.serverConfig.failedToGet
source: Failed to get server config from {{serverConfigUrl}}. This means services such as proxy, convert and URL shortening may not work.
ta: {{serverConfigUrl}} இருந்து இலிருந்து சேவையக கட்டமைப்பைப் பெறுவதில் தோல்வி. இதன் பொருள் பதிலாள், மாற்றுதல் மற்றும் முகவரி சுருக்கம் போன்ற சேவைகள் செயல்படாது.

# core.terriaError.defaultTitle
source: An error occurred
ta: பிழை ஏற்பட்டது

# core.terriaError.defaultMessage
source: Unknown error
ta: தெரியாத பிழை

# core.terriaError.defaultCombineTitle
source: Multiple errors occurred
ta: பல பிழைகள் நிகழ்ந்தன

# core.terriaError.defaultCombineMessage
source: Details of the errors are below
ta: பிழைகள் பற்றிய விவரங்கள் கீழே உள்ளன

# core.terriaError.networkRequestTitle
source: A network request error occurred
ta: பிணைய கோரிக்கை பிழை ஏற்பட்டது

# core.terriaError.networkRequestMessage
source: Data may not be available or display correctly due to data custodian's service outage. Please try reloading the map, accessing the data at a later stage, or selecting a different dataset. <feedbacklink feedback-message='If the problem persists, please submit feedback here.' email-message='If the problem persists, please report to {{email}}'/>
ta: தரவு பாதுகாவலரின் பணி செயலிழப்பு காரணமாகத் தரவு கிடைக்காது அல்லது சரியாகக் காட்டப்படலாம். வரைபடத்தை மீண்டும் ஏற்ற முயற்சிக்கவும், பின்னர் கட்டத்தில் தரவை அணுகவும் அல்லது வேறு தரவுத்தொகுப்பைத் தேர்ந்தெடுக்கவும் முயற்சிக்கவும். <feedbacklink feedback-message='சிக்கல் தொடர்ந்தால், தயவுசெய்து கருத்துக்களை இங்கே சமர்ப்பிக்கவும்.' email-message='சிக்கல் தொடர்ந்தால், தயவுசெய்து {{email}}க்கு புகாரளி'/>
