Repository: 247i/TACETr
Catalog: உரை/வெறுமை/terriajs-terriajsnext-*.po
Languages: ta

# general.close
source: Close
ta: மூடு

# general.open
source: Open
ta: திற

# general.prev
source: Prev
ta: முந்தைய

# general.next
source: Next
ta: அடுத்தது

# general.skip
source: Skip
ta: தவிர்

# general.back
source: Back
ta: பின்

# general.delete
source: Delete
ta: நீக்கு

# general.cancel
source: Cancel
ta: ரத்துசெய்

# general.confirm
source: Confirm
ta: உறுதிப்படுத்தவும்

# browsers.chrome
source: Google Chrome
ta: கூகிள் குரோம்

# browsers.firefox
source: Mozilla Firefox
ta: மொசில்லா பயர்பாக்ச்

# browsers.edge
source: Microsoft Edge
ta: நுண்மென் எட்ச்

# browsers.safari
source: Apple Safari
ta: ஆப்பிள் சஃபாரி

# trainer.expandTrainer
source: Show more step detail
ta: மேலும் படி விவரங்களைக் காட்டு

# trainer.collapseTrainer
source: Hide step detail
ta: படி விவரங்களை மறைக்கவும்

# trainer.showAllSteps
source: Show all steps
ta: எல்லா படிகளையும் காட்டு

# trainer.hideAllSteps
source: Hide all steps
ta: எல்லா படிகளையும் மறைக்கவும்

# tour.preface.title
source: Take the tour
ta: சுற்றுப்பயணம் மேற்கொள்ளுங்கள்

# tour.preface.content
source: Unsure of where to begin? Take a quick tour of the main features of our software, and learn about some of the key functions to help you get on your way.
ta: எங்கிருந்து தொடங்குவது என்று தெரியவில்லையா? எங்கள் மென்பொருளின் முக்கிய அம்சங்களை விரைவாக சுற்றுப்பயணம் செய்து, உங்கள் வழியில் செல்ல உதவும் சில முக்கிய செயல்பாடுகளைப் பற்றி அறிந்து கொள்ளுங்கள்.

# tour.preface.close
source: Maybe later
ta: ஒருவேளை பின்னர்

# tour.preface.start
source: Start tour
ta: சுற்றுப்பயணம்

# tour.finish
source: Finish
ta: முடிக்க

# tour.locationSearchInput.content
source: ## Location search Enter a locality or address to easily locate a point of interest on the map.
ta: ## இருப்பிட தேடல் வரைபடத்தில் ஆர்வமுள்ள ஒரு புள்ளியைக் கண்டுபிடிக்க ஒரு இடம் அல்லது முகவரியை உள்ளிடவும்.

# tour.exploreMapDataButton.content
source: ## Explore Digital Twin data Browse the Terria Data Catalogue of available data and add it to the digital twin here. You can add multiple datasets at any one time, and you’ll see them listed down below in the Digital Twin Data panel.
ta: ## டிசிட்டல் இரட்டை தரவை ஆராயுங்கள் கிடைக்கக்கூடிய தரவின் டெர்ரியா தரவு பட்டியலை உலாவவும், அதை டிசிட்டல் இரட்டையரில் இங்கே சேர்க்கவும். நீங்கள் எந்த நேரத்திலும் பல தரவுத்தொகுப்புகளைச் சேர்க்கலாம், மேலும் அவை டிசிட்டல் இரட்டை தரவு குழுவில் கீழே பட்டியலிடப்பட்டிருப்பதைக் காண்பீர்கள்.

# tour.sidePanelUploadButton.content
source: ## Upload Data You can upload your own data to the map to view it with other data sets. Upload a file or link to an existing online data set or data service. Supported data formats include CSV, GeoJSON, KML, GPX and CZML.
ta: ## தரவைப் பதிவேற்றவும் உங்கள் சொந்த தரவை மற்ற தரவுத் தொகுப்புகளுடன் காண வரைபடத்தில் பதிவேற்றலாம். ஏற்கனவே உள்ள நிகழ்நிலை தரவு தொகுப்பு அல்லது தரவு சேவைக்கு ஒரு கோப்பைப் பதிவேற்றவும் அல்லது இணைப்பை ஏற்படுத்தவும். ஆதரிக்கப்பட்ட தரவு வடிவங்களில் சி.எச்.வி, சியோச்சன், கே.எம்.எல், சி.பி.எக்ச் மற்றும் சி.எச்.எம்.எல் ஆகியவை அடங்கும்.

# tour.menuBarMapSettingsButton.content
source: ## Map Settings Customise map settings such as base maps, 2D/3D Terrain, and map image quality for improved performance.
ta: ## வரைபட அமைப்புகள் மேம்பட்ட செயல்திறனுக்காக அடிப்படை வரைபடங்கள், 2 டி/3 டி நிலப்பரப்பு மற்றும் வரைபட படத் தகுதி போன்ற வரைபட அமைப்புகளைத் தனிப்பயனாக்குங்கள்.

# tour.menuBarStoryButton.content
source: ## Stories Stories allow you to add contextual information to a dataset to bring a narrative to life. Create your own data story using the Story Editor, and share it via the ‘Share’ panel once you’re done.
ta: ## கதைகள் ஒரு கதையை வாழ்க்கையில் கொண்டு வர ஒரு தரவுத்தொகுப்பில் சூழ்நிலை தகவல்களைச் சேர்க்க கதைகள் உங்களை அனுமதிக்கின்றன. கதை எடிட்டரைப் பயன்படுத்தி உங்கள் சொந்த தரவுக் கதையை உருவாக்கி, நீங்கள் முடித்ததும் ‘பகிர்’ குழு வழியாக பகிரவும்.

# tour.mapNavigationCompassOuterRing.content
source: ## View controls Here you can change the view of the map. You can change the orientation of your view by using the outer ring, and you can tilt the camera angle using the inner ring. Double click to reset the view.
ta: ## கட்டுப்பாடுகளைக் காண்க இங்கே நீங்கள் வரைபடத்தின் பார்வையை மாற்றலாம். வெளிப்புற வளையத்தைப் பயன்படுத்துவதன் மூலம் உங்கள் பார்வையின் நோக்குநிலையை மாற்றலாம், மேலும் உள் வளையத்தைப் பயன்படுத்தி கேமரா கோணத்தை சாய்க்கலாம். பார்வையை மீட்டமைக்க இருமுறை சொடுக்கு செய்க.

# tour.mapNavigationSplitterIcon.content
source: ## Compare A powerful feature of Terria is the ability to compare datasets using a split screen view. For datasets with a time-series component, such as satellite images, you can compare dates backwards and forwards in time by clicking on the date picker/selector.
ta: ## ஒப்பிட்டுப் பாருங்கள் டெரியாவின் சக்திவாய்ந்த நற்பொருத்தம் என்பது பிளவு திரை காட்சியைப் பயன்படுத்தி தரவுத்தொகுப்புகளை ஒப்பிடும் திறன் ஆகும். செயற்கைக்கோள் படங்கள் போன்ற நேர-தொடர் கூறுகளைக் கொண்ட தரவுத்தொகுப்புகளுக்கு, தேதி பிக்கர்/தேர்வாளரைக் சொடுக்கு செய்வதன் மூலம் தேதிகளை பின்னோக்கி மற்றும் முன்னோக்கி ஒப்பிடலாம்.

# measure.measureTool
source: Measure Tool
ta: அளவீட்டு கருவி

# measure.measureToolTitle
source: Line Measure
ta: வரி நடவடிக்கை

# measure.measureDistance
source: Measure distance between locations
ta: இருப்பிடங்களுக்கு இடையில் தூரத்தை அளவிடவும்

# location.errorGettingLocation
source: Error getting location
ta: இருப்பிடத்தைப் பெறுவதில் பிழை

# location.browserCannotProvide
source: Your browser cannot provide your location.
ta: உங்கள் உலாவி உங்கள் இருப்பிடத்தை வழங்க முடியாது.

# location.myLocation
source: My Location
ta: எனது இருப்பிடம்

# location.location
source: Location
ta: இடம்

# location.originError
source: Your browser can only provide your location when using HTTPS. You may be able to use {{secureUrl}} instead.
ta: HTTPS ஐப் பயன்படுத்தும்போது மட்டுமே உங்கள் உலாவி உங்கள் இருப்பிடத்தை வழங்க முடியும். அதற்குப் பதிலாக நீங்கள் {{secureUrl}} ஐப் பயன்படுத்தலாம்.

# location.centreMap
source: Centre map at your current location
ta: உங்கள் தற்போதைய இடத்தில் மைய வரைபடம்

# location.permissionDenied
source: Permission denied to get your location. Please check your browser settings.
ta: உங்கள் இருப்பிடத்தைப் பெற இசைவு மறுக்கப்பட்டது. உங்கள் உலாவி அமைப்புகளை சரிபார்க்கவும்.

# location.positionUnavailable
source: Your location information is unavailable.
ta: உங்கள் இருப்பிட செய்தி கிடைக்கவில்லை.

# location.timeout
source: Obtaining your location information took to long. Please try again later.
ta: உங்கள் இருப்பிட தகவல்களைப் பெறுவது நீண்ட நேரம் எடுத்தது. தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும்.

# splitterTool.errorTitle
source: Failed to compare catalog item.
ta: அட்டவணை உருப்படியை ஒப்பிடுவதில் தோல்வி.

# splitterTool.duplicateModelErrorMessage
source: An error occurred while splitting the catalog item `"{{name}}"`. This catalog item may not support "compare" functionality
ta: பட்டியல் உருப்படியை `" {{name}} "` பிரிக்கும்போது பிழை ஏற்பட்டது. இந்த பட்டியல் உருப்படி செயல்பாட்டை "ஒப்பிடுவதை" ஆதரிக்காது

# splitterTool.modelNotFoundErrorMessage
source: Model ID `"{{id}}"` could not be found
ta: மாதிரி ஐடி `" {{id}} "` கண்டுபிடிக்க முடியவில்லை

# splitterTool.toggleSplitterToolTitle
source: Compare
ta: ஒப்பிடுக

# splitterTool.toggleSplitterTool
source: Enable side-by-side comparison between two different sets of data
ta: இரண்டு வெவ்வேறு தொகுப்புகளுக்கு இடையிலான பக்கவாட்டாக ஒப்பீட்டை இயக்கவும்

# splitterTool.toggleSplitterToolDisabled
source: Please disable other side-by-side comparison features in order to enable standard compare
ta: தரமான ஒப்பீட்டை இயக்க மற்ற பக்கவாட்டு ஒப்பீட்டு அம்சங்களை முடக்கவும்

# splitterTool.title
source: Drag left or right to adjust views
ta: காட்சிகளை சரிசெய்ய இடது அல்லது வலதுபுறம் இழுக்கவும்

# splitterTool.workbench.goleftTitle
source: Show on the left side
ta: இடது பக்கத்தில் காட்டு

# splitterTool.workbench.goleft
source: Left
ta: இடது

# splitterTool.workbench.bothTitle
source: Show on both sides
ta: இருபுறமும் காட்டு

# splitterTool.workbench.both
source: Both
ta: இரண்டும்

# splitterTool.workbench.gorightTitle
source: Show on the right side
ta: வலது பக்கத்தில் காட்டு

# splitterTool.workbench.goright
source: Right
ta: வலது

# splitterTool.workbench.copyName
source: {{name}} (copy)
ta: {{name}} (நகல்)

# zoomCotrol.zoomIn
source: Zoom in
ta: பெரிதாக்கு

# zoomCotrol.zoomReset
source: Reset zoom
ta: பெரிதாக்கு மீட்டமைக்கவும்

# zoomCotrol.zoomOut
source: Zoom out
ta: சிறிதாக்கு

# compass.description
source: Drag outer ring: rotate view. Drag inner gyroscope: free orbit. Double-click: reset view. TIP: You can also free orbit by holding the CTRL key and dragging the map.
ta: வெளிப்புற வளையத்தை இழுக்கவும்: பார்வையை சுழற்றுங்கள். உள் கைரோச்கோப்பை இழுக்கவும்: இலவச சுற்றுப்பாதை. இருமுறை சொடுக்கு செய்யவும்: பார்வையை மீட்டமை. உதவிக்குறிப்பு: சி.டி.ஆர்.எல் விசையை வைத்து வரைபடத்தை இழுப்பதன் மூலம் நீங்கள் இலவச சுற்றுப்பாதையையும் செய்யலாம்.

# compass.title
source: Click and drag to rotate the camera
ta: கேமராவை சுழற்ற சொடுக்கு செய்து இழுக்கவும்

# compass.guidanceBtnTitle
source: Gyroscope Guidance
ta: கைரோச்கோப் வழிகாட்டுதல்

# compass.guidanceBtnText
source: View detailed instructions on how to use the compass
ta: திசைகாட்டி எவ்வாறு பயன்படுத்துவது என்பது குறித்த விரிவான வழிமுறைகளைக் காண்க

# compass.guidance.title
source: Gyroscope Controls
ta: கைரோச்கோப் கட்டுப்பாடுகள்

# compass.guidance.outerRingTitle
source: Outer Ring
ta: வெளிப்புற வளையம்

# compass.guidance.outerRingDescription
source: Drag the outer ring in a circular motion to rotate the map view 360˚.
ta: வரைபடக் காட்சி 360˚ ஐ சுழற்ற வட்ட இயக்கத்தில் வெளிப்புற வளையத்தை இழுக்கவும்.

# compass.guidance.innerCircleTitle
source: Inner Circle
ta: உள் வட்டம்

# compass.guidance.innerCircleDescription1
source: Click in the centre and slowly drag up, down, left or right to tilt and rotate the map at the same time.
ta: மையத்தில் சொடுக்கு செய்து, மெதுவாக மேலே, கீழே, இடது அல்லது வலதுபுறம் இழுக்கவும், அதே நேரத்தில் வரைபடத்தை சாய்த்து சுழற்றவும்.

# compass.guidance.innerCircleDescription2
source: Double click in here to reset view to its default state.
ta: அதன் இயல்புநிலை நிலைக்கு மீட்டமைக்க இங்கே இருமுறை சொடுக்கு செய்க.

# compass.guidance.ctrlDragDescription
source: You can also tilt and rotate the map by holding the CTRL key and dragging the map.
ta: கட்டுப்பாடு விசையை பிடித்து வரைபடத்தை இழுப்பதன் மூலம் நீங்கள் வரைபடத்தை சாய்த்து சுழற்றலாம்.

# compass.guidance.dismissText
source: Close and don't show again
ta: மூடி மீண்டும் காட்ட வேண்டாம்

# AR.title
source: Experimental Feature: Augmented Reality
ta: சோதனை அம்சம்: பெரிதாக்கப்பட்ட உண்மை

# AR.experimentalFeatureMessage
source: Augmented Reality mode is currently in beta. This mode is only designed for use on the latest high end mobile devices. <br /><br />WARNING: This mode can consume a lot of data, please be mindful of data usage charges from your network provider. <br /><br />The accuracy of this mode depends on the accuracy of your mobile devices internal compass.
ta: ஆக்மென்ட் ரியாலிட்டி பயன்முறை தற்போது பீட்டாவில் உள்ளது. இந்த பயன்முறை அண்மைக் கால உயர்நிலை மொபைல் சாதனங்களில் பயன்படுத்த மட்டுமே வடிவமைக்கப்பட்டுள்ளது. <br /> <br /> எச்சரிக்கை: இந்த பயன்முறை நிறைய தரவுகளை உட்கொள்ளலாம், தயவுசெய்து உங்கள் பிணைய வழங்குநரிடமிருந்து தரவு பயன்பாட்டு கட்டணங்களை கவனத்தில் கொள்ளுங்கள். <br /> <br /> இந்த பயன்முறையின் துல்லியம் உங்கள் மொபைல் சாதனங்களின் உள் திசைகாட்டி துல்லியத்தைப் பொறுத்தது.

# AR.confirmText
source: Got it
ta: கிடைத்தது

# AR.manualAlignmentTitle
source: Manual Alignment
ta: கையேடு சீரமைப்பு

# AR.manualAlignmentMessage
source: Align your mobile device so that it corresponds with the maps current alignment, then click the blinking compass. If no landmarks to align with are currently visible on the map, you can move the map using drag and pinch actions until a recognisable landmark is visible before aligning the device with the map. <br /><div>{{img}}</div> <br />Tip: The sun or moon are often good landmarks to align with if you are in a location you aren't familiar with (be careful not to look at the sun - it can hurt your eyes).
ta: உங்கள் மொபைல் சாதனத்தைச் சீரமைக்கவும், இது வரைபட தற்போதைய சீரமைப்புடன் ஒத்துப்போகிறது, பின்னர் ஒளிரும் திசைகாட்டி என்பதைக் சொடுக்கு செய்க. வரைபடத்தில் தற்போது ஒன்றிணைவதற்கு எந்த அடையாளங்களும் காணப்படவில்லை என்றால், வரைபடத்துடன் சாதனத்தைச் சீரமைப்பதற்கு முன்பு அடையாளம் காணக்கூடிய மைல்கல் தெரியும் வரை இழுவை மற்றும் பிஞ்ச் செயல்களைப் பயன்படுத்தி வரைபடத்தை நகர்த்தலாம். <br /><div>{{img}} </div> <br /> உதவிக்குறிப்பு: சூரியன் அல்லது சந்திரன் பெரும்பாலும் நீங்கள் அறிந்திருக்காத இடத்தில் இருந்தால் சீரமைக்க நல்ல அடையாளங்கள் (சூரியனைப் பார்க்காமல் கவனமாக இருங்கள் - அது உங்கள் கண்களைக் காயப்படுத்தும்).

# AR.resetAlignmentTitle
source: Reset Alignment
ta: சீரமைப்பை மீட்டமை

# AR.resetAlignmentMessage
source: Resetting to compass alignment. If the alignment doesn't match the real world try waving your device in a figure 8 motion to recalibrate device. This can be done at any time.<br /> <br />Avoid locations with magnetic fields or metal objects as these may disorient the devices compass.
ta: திசைகாட்டி சீரமைப்புக்கு மீட்டமைக்கிறது. சீரமைப்பு உண்மையான உலகத்துடன் பொருந்தவில்லை என்றால், சாதனத்தை மறுபரிசீலனை செய்ய படம் 8 இயக்கத்தில் உங்கள் சாதனத்தை அசைக்க முயற்சிக்கவும். இதை எந்த நேரத்திலும் செய்ய முடியும். <br /> <br /> சாதனங்கள் திசைகாட்டி திசைதிருப்பக்கூடும் என்பதால் காந்தப்புலங்கள் அல்லது உலோகப் பொருள்களைக் கொண்ட இடங்களைத் தவிர்க்கவும்.

# AR.arTool
source: augmented reality tool
ta: பெரிதாக்கப்பட்ட ரியாலிட்டி கருவி

# AR.btnHover
source: toggle hover height
ta: ஓவர் உயரத்தை மாற்றவும்

# AR.btnRealign
source: toggle manual alignment
ta: கையேடு சீரமைப்பை மாற்றவும்

# AR.btnResetRealign
source: reset compass alignment
ta: திசைகாட்டி சீரமைப்பை மீட்டமைக்கவும்

# tool.closeButtonTitle
source: Close {{toolName}} Tool
ta: {{toolName}} கருவியை மூடு

# tool.loadingError.title
source: Error Loading {{toolName}} Tool
ta: {{toolName}} கருவி ஏற்றுவதில் பிழை

# tool.loadingError.message
source: An error occurred while trying to load the this tool from the server. Please try again.
ta: சேவையகத்திலிருந்து இந்த கருவியை ஏற்ற முயற்சிக்கும்போது பிழை ஏற்பட்டது. மீண்டும் முயற்சிக்கவும்.

# tool.exitBtnTitle
source: Exit
ta: வெளியேறு

# tool.button.open
source: Exit {{toolNameLowerCase}}
ta: வெளியேறு {{toolNameLowerCase}}

# diffTool.title
source: Difference
ta: வேறுபாடு

# diffTool.close
source: Close
ta: மூடு

# diffTool.instructions.setDateA
source: Set date A
ta: அமைக்கப்பட்ட தேதி a

# diffTool.instructions.setDateB
source: Set date B
ta: தேதியை அமைக்கவும் b

# diffTool.instructions.changeDates
source: Change dates
ta: தேதிகளை மாற்றவும்

# diffTool.instructions.paneDescription
source: Visualise and compare the difference of data between two dates at one location.
ta: ஒரு இடத்தில் இரண்டு தேதிகளுக்கு இடையிலான தரவின் வேறுபாட்டைக் காட்சிப்படுத்தவும் ஒப்பிடவும்.

# diffTool.choosePreview
source: Choose a preview style
ta: முன்னோட்ட பாணியைத் தேர்வுசெய்க

# diffTool.chooseDifference
source: Choose a difference output
ta: வித்தியாச வெளியீட்டைத் தேர்வுசெய்க

# diffTool.differenceResultsTitle
source: Change detection results
ta: கண்டறிதல் முடிவுகளை மாற்றவும்

# diffTool.labels.area
source: Area
ta: பகுதி

# diffTool.labels.dates
source: Dates
ta: தேதிகள்

# diffTool.labels.dateComparisonA
source: Date Comparison A
ta: தேதி ஒப்பீடு a

# diffTool.labels.dateComparisonB
source: Date Comparison B
ta: தேதி ஒப்பீடு ஆ

# diffTool.labels.sourceDataset
source: Source dataset
ta: மூல தரவுத்தொகுப்பு

# diffTool.labels.previewStyle
source: Preview style
ta: முன்னோட்டம் நடை

# diffTool.labels.differenceOutput
source: Difference output
ta: வேறுபாடு வெளியீடு

# diffTool.labels.generateDiffButtonText
source: Generate change detection
ta: மாற்றம் கண்டறிதலை உருவாக்குங்கள்

# diffTool.labels.disabledButtonPrompt
source: Please note: A location and dates must be selected to proceed with change detection
ta: தயவுசெய்து கவனிக்கவும்: மாற்றம் கண்டறிதலுடன் தொடர இடம் மற்றும் தேதிகள் தேர்ந்தெடுக்கப்பட வேண்டும்

# diffTool.labels.areaFilterSelection
source: Area filter selection
ta: பகுதி வடிகட்டி தேர்வு

# diffTool.labels.saveToWorkbench
source: Save to workbench
ta: பணிப்பெட்டியில் சேமி

# diffTool.locationDisplay.noLocationSelected.title
source: No location selected!
ta: எந்த இடமும் தேர்ந்தெடுக்கப்படவில்லை!

# diffTool.locationDisplay.noLocationSelected.description
source: To filter image date picker by location, zoom in and select a point of interest on the map
ta: படத் தேதித் தேர்வியை இருப்பிடத்தின் அடிப்படையில் வடிகட்ட, பெரிதாக்கி, வரைபடத்தில் ஆர்வமுள்ள இடத்தைத் தேர்ந்தெடு

# diffTool.locationDisplay.locationSelected.title
source: Location selected & dates filtered
ta: இடம் தேர்ந்தெடுக்கப்பட்டது & தேதிகள் வடிகட்டப்படுகின்றன

# diffTool.locationDisplay.locationSelected.description
source: To change, click another point on the map
ta: மாற்ற, வரைபடத்தில் மற்றொரு புள்ளியைக் சொடுக்கு செய்க

# diffTool.locationPicker.initialMessages.title
source: Select a precise location
ta: துல்லியமான இடத்தைத் தேர்ந்தெடுக்கவும்

# diffTool.locationPicker.initialMessages.beforePick
source: We need this to run our change detection process.
ta: எங்கள் மாற்றத்தைக் கண்டறிதல் செயல்முறையை இயக்க இது தேவை.

# diffTool.locationPicker.initialMessages.afterPick
source: Click another point to change the selected region
ta: தேர்ந்தெடுக்கப்பட்ட பகுதியை மாற்ற மற்றொரு புள்ளியைக் சொடுக்கு செய்க

# diffTool.locationPicker.nextMessages.title
source: You have selected the location {{latitude}} {{longitude}}
ta: நீங்கள் {{latitude}} {{longitude}} இருப்பிடத்தைத் தேர்ந்தெடுத்துள்ளீர்கள்

# diffTool.locationPicker.nextMessages.beforePick
source: Click another point to change the selection
ta: தேர்வை மாற்ற மற்றொரு புள்ளியைக் சொடுக்கு செய்க

# diffTool.locationPicker.nextMessages.afterPick
source: Click another point to change the selection
ta: தேர்வை மாற்ற மற்றொரு புள்ளியைக் சொடுக்கு செய்க

# diffTool.locationPicker.errorMessages.title
source: Select a precise location
ta: துல்லியமான இடத்தைத் தேர்ந்தெடுக்கவும்

# diffTool.locationPicker.errorMessages.beforePick
source: Failed to resolve imagery at location! Please choose a different location or zoom-level.
ta: இருப்பிடத்தில் படங்களைத் தீர்க்கத் தவறிவிட்டது! தயவுசெய்து வேறு இடம் அல்லது சூம்-லெவலைத் தேர்வுசெய்க.

# diffTool.locationPicker.errorMessages.afterPick
source: Click another point to change the selection
ta: தேர்வை மாற்ற மற்றொரு புள்ளியைக் சொடுக்கு செய்க

# diffTool.datePicker.back
source: Go back
ta: திரும்பிச் செல்லுங்கள்

# diffTool.datePicker.previousDateTitle
source: Previous date
ta: முந்தைய தேதி

# diffTool.datePicker.nextDateTitle
source: Next date
ta: அடுத்த தேதி

# diffTool.datePicker.dateButtonTitle
source: Select a date
ta: தேதியைத் தேர்ந்தெடுக்கவும்

# legend.lat
source: Lat
ta: லாட்

# legend.lon
source: Lon
ta: லோன்

# legend.zone
source: ZONE
ta: மண்டலம்

# legend.e
source: E
ta: இ

# legend.elev
source: Elev
ta: எலை

# languagePanel.changeLanguage
source: Change Language
ta: மொழியை மாற்றவும்

# share.browserPrint
source: For better printed results, please use {{appName}}'s Print button instead of your web browser's print feature.
ta: சிறந்த அச்சிடப்பட்ட முடிவுகளுக்கு, உங்கள் வலை உலாவியின் அச்சு அம்சத்திற்கு பதிலாக {{appName}} இன் அச்சு பொத்தானைப் பயன்படுத்தவும்.

# share.shortLinkShortening
source: Shortening...
ta: சுருக்குதல் ...

# share.shortLinkError
source: An error occurred while attempting to shorten the URL. Please check your internet connection and try again.
ta: முகவரி ஐ குறைக்க முயற்சிக்கும் போது பிழை ஏற்பட்டது. உங்கள் இணைய இணைப்பைச் சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# share.localDataNote
source: <0><0>Note:</0></0><1>The following data sources will NOT be shared because they include data from this local system or from an authenticated online service. To share these data sources, publish their data on a web server and <2>add them using a url</2>.</1>
ta: <0> <0> குறிப்பு: </0> </0> <1> பின்வரும் தரவு மூலங்கள் பகிரப்படாது, ஏனெனில் அவை இந்த உள்ளக அமைப்பிலிருந்து தரவை அல்லது அங்கீகரிக்கப்பட்ட நிகழ்நிலை சேவையிலிருந்து அடங்கும். இந்தத் தரவு மூலங்களைப் பகிர, அவற்றின் தரவை வலை சேவையகத்தில் வெளியிடவும், <2> முகவரி ஐப் பயன்படுத்தி அவற்றைச் சேர்க்கவும் </2>. </1>

# share.generatingUrl
source: Generating share URL...
ta: பங்கு முகவரி ஐ உருவாக்குதல் ...

# share.printTitle
source: Print Map
ta: வரைபடத்தை அச்சிடுக

# share.printExplanation
source: Open a printable version of this map.
ta: இந்த வரைபடத்தின் அச்சிடக்கூடிய பதிப்பைத் திறக்கவும்.

# share.downloadMap
source: Download map (png)
ta: வரைபடத்தைப் பதிவிறக்குங்கள் (பி.என்.சி)

# share.printViewButton
source: Show Print View
ta: அச்சு காட்சியைக் காட்டு

# share.btnAdvanced
source: Advanced options
ta: மேம்பட்ட விருப்பங்கள்

# share.embedTitle
source: Embed map
ta: வரைபடம் உட்பொதித்தல்

# share.embedDescription
source: To embed, copy this code to embed this map into an HTML page:
ta: உட்பொதிக்க, இந்த வரைபடத்தை ஒரு உஉகுமொ பக்கத்தில் உட்பொதிக்க இந்த குறியீட்டை நகலெடுக்கவும்:

# share.shortenUsingService
source: Shorten the share URL using a web service
ta: வலை சேவையைப் பயன்படுத்தி பங்கு முகவரி ஐக் குறைக்கவும்

# share.btnCatalogShareText
source: Share
ta: பங்கு

# share.btnStoryShareText
source: Share
ta: பங்கு

# share.btnMapShareText
source: Share / Print
ta: பகிர் / அச்சு

# share.btnCatalogShareTitle
source: Share your catalogue with others
ta: உங்கள் பட்டியலை மற்றவர்களுடன் பகிர்ந்து கொள்ளுங்கள்

# share.btnStoryShareTitle
source: Share your story with others
ta: உங்கள் கதையை மற்றவர்களுடன் பகிர்ந்து கொள்ளுங்கள்

# share.btnMapShareTitle
source: Share your map with others
ta: உங்கள் வரைபடத்தை மற்றவர்களுடன் பகிர்ந்து கொள்ளுங்கள்

# share.convertNotificationTitle
source: Notice: share link upgraded
ta: அறிவிப்பு: பகிர்வு இணைப்பு மேம்படுத்தப்பட்டது

# share.convertNotificationMessage
source: This share link is based on an older version of TerriaJS - the software powering this web map. While best efforts are made to preserve the link, you might encounter issues with visualising the data. If you're a user of the share link, click OK to make the warning message disappear and continue with accessing the data.
ta: இந்த பங்கு இணைப்பு டெர்ரியாச்சின் பழைய பதிப்பை அடிப்படையாகக் கொண்டது - இந்த வலை வரைபடத்தை இயக்கும் மென்பொருள். இணைப்பைப் பாதுகாக்க சிறந்த முயற்சிகள் மேற்கொள்ளப்பட்டாலும், தரவைக் காட்சிப்படுத்துவதற்கான சிக்கல்களை நீங்கள் சந்திக்க நேரிடும். நீங்கள் பகிர்வு இணைப்பின் பயனராக இருந்தால், எச்சரிக்கை செய்தியை மறைந்து, தரவை அணுகுவதைத் தொடர சரி என்பதைக் சொடுக்கு செய்க.

# share.convertNotificationHelp
source: If you have created the share link, check the Help menu to see tips on updating the share link.
ta: நீங்கள் பகிர்வு இணைப்பை உருவாக்கியிருந்தால், பகிர்வு இணைப்பைப் புதுப்பிப்பதற்கான உதவிக்குறிப்புகளைக் காண உதவி மெனுவைச் சரிபார்க்கவும்.

# share.convertNotificationFeedback
source: For questions or feedback, click here.
ta: கேள்விகள் அல்லது பின்னூட்டங்களுக்கு, இங்கே சொடுக்கு செய்க.

# share.convertNotificationWarningsTitle
source: Technical details
ta: தொழில்நுட்ப விவரங்கள்

# share.convertErrorTitle
source: Could not upgrade share link to V8
ta: V8 க்கு பங்கு இணைப்பை மேம்படுத்த முடியவில்லை

# share.convertErrorMessage
source: This share link is based on an older version of TerriaJS - the software powering this web map. An error has occurred trying to upgrade the share data.
ta: இந்த பங்கு இணைப்பு டெர்ரியாச்சின் பழைய பதிப்பை அடிப்படையாகக் கொண்டது - இந்த வலை வரைபடத்தை இயக்கும் மென்பொருள். பங்கு தரவை மேம்படுத்த முயற்சிக்கும் பிழை ஏற்பட்டது.

# share.getShareSaveHelpMessage
source: How to Bookmark Sharelinks
ta: சேர்லிங்க்சை புக்மார்க்கு செய்வது எப்படி

# countDatasets.btnText
source: Start
ta: தொடங்கு

# countDatasets.loadError
source: failed to load.
ta: ஏற்றுவதில் தோல்வி.

# countDatasets.countingMessage
source: Counting, please wait...
ta: எண்ணுதல், தயவுசெய்து காத்திருங்கள் ...

# countDatasets.totals
source: <div>The catalog contains {{items}} items in {{groups}} groups.</div>
ta: <div> {{items}} பட்டியலில் {{groups}} குழுக்களில் உள்ளன. </div>
