Repository: 247i/TACETr
Catalog: உரை/வெறுமை/terriajs-terriajsnext-*.po
Languages: ta

# core.terriaError.networkRequestMessageDetailed
source: This may indicate one of the following: * The server hostname could not be resolved * The server did not respond to the request - or is temporarily unavailable * The server denied [Cross-Origin Resource Sharing (CORS)](https://docs.terria.io/guide/connecting-to-data/cross-origin-resource-sharing/) access to this URL * There is a problem with your internet connection If you entered the link manually, please verify that the link is correct.
ta: இது பின்வருவனவற்றில் ஒன்றைக் குறிக்கலாம்: * சேவையக ஓச்ட்பெயரை தீர்க்க முடியவில்லை * சேவையகம் கோரிக்கைக்கு பதிலளிக்கவில்லை - அல்லது தற்காலிகமாக கிடைக்கவில்லை ! * உங்கள் இணைய இணைப்பில் சிக்கல் உள்ளது நீங்கள் இணைப்பை கைமுறையாக உள்ளிட்டால், இணைப்பு சரியானதா என்பதை சரிபார்க்கவும்.

# core.unverifiedExternalLink.title
source: Warning: unverified link
ta: எச்சரிக்கை: சரிபார்க்கப்படாத இணைப்பு

# core.unverifiedExternalLink.message
source: You are about to open: `{{url}}` This link is unverified and could be unsafe.
ta: நீங்கள் திறக்கப் போகிறீர்கள்: `{{url}}` இந்த இணைப்பு சரிபார்க்கப்படாதது மற்றும் பாதுகாப்பற்றதாக இருக்கலாம்.

# core.unverifiedExternalLink.denyText
source: Cancel
ta: ரத்துசெய்

# core.unverifiedExternalLink.confirmText
source: Open in a new tab
ta: புதிய தாவலில் திறக்கவும்

# map.addressGeocoder.devError
source: bulkConvertAddresses must be implemented in the derived class.
ta: பெறப்பட்ட வகுப்பில் பல்க் கான்வர்டாட்ரெச் செயல்படுத்தப்பட வேண்டும்.

# map.cesium.stoppedRenderingTitle
source: 3D map failed to render
ta: 3D வரைபடம் வழங்கத் தவறிவிட்டது

# map.cesium.stoppedRenderingMessage
source: This may have been caused by a dataset just added to the workbench - please try removing it. If this does not resolve your problem you may need to reload {{appName}}.
ta: இது பணிப்பெண்ணில் சேர்க்கப்பட்ட தரவுத்தொகுப்பால் ஏற்பட்டிருக்கலாம் - தயவுசெய்து அதை அகற்ற முயற்சிக்கவும். இது உங்கள் சிக்கலை தீர்க்கவில்லை என்றால் {{appName}} ஐ மீண்டும் ஏற்ற வேண்டும்.

# map.cesium.devError
source: cesium is required.
ta: சீசியம் தேவை.

# map.cesium.failedToObtain
source: Failed to obtain image tile X: {{x}} Y: {{y}} Level: {{level}}.
ta: பட ஓடு x: {{x}} y: {{y}} நிலை: {{level}}.

# map.cesium.notWebMercatorTilingScheme
source: This dataset cannot be displayed on the 2D map because it does not support the Web Mercator (EPSG:3857) projection.
ta: இந்த தரவுத்தொகுப்பை 2 டி வரைபடத்தில் காட்ட முடியாது, ஏனெனில் இது வலை மெர்கேட்டரை (இபிஎச்சி: 3857) திட்டத்தை ஆதரிக்காது.

# map.cesium.unusalTilingScheme
source: This dataset cannot be displayed on the 2D map because it uses an unusual tiling scheme that is not supported.
ta: இந்த தரவுத்தொகுப்பை 2 டி வரைபடத்தில் காட்ட முடியாது, ஏனெனில் இது ஆதரிக்கப்படாத அசாதாரண டைலிங் திட்டத்தைப் பயன்படுத்துகிறது.

# map.cesium.terrainServerErrorTitle
source: Terrain Server Not Responding
ta: நிலப்பரப்பு சேவையகம் பதிலளிக்கவில்லை

# map.cesium.terrainServerErrorMessage
source: The terrain server is not responding at the moment. You can still use all the features of {{appName}} but there will be no terrain detail in 3D mode. We're sorry for the inconvenience. Please try again later and the terrain server should be responding as expected. If the issue persists, please contact us via email at {{supportEmail}}.
ta: நிலப்பரப்பு சேவையகம் இந்த நேரத்தில் பதிலளிக்கவில்லை. {{appName}} இன் அனைத்து அம்சங்களையும் நீங்கள் இன்னும் பயன்படுத்தலாம், ஆனால் 3D பயன்முறையில் நிலப்பரப்பு விவரம் இருக்காது. சிரமத்திற்கு வருந்துகிறோம். தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும், நிலப்பரப்பு சேவையகம் எதிர்பார்த்தபடி பதிலளிக்க வேண்டும். சிக்கல் தொடர்ந்தால், தயவுசெய்து எங்களை {{supportEmail}} இல் மின்னஞ்சல் வழியாகத் தொடர்பு கொள்ளவும்.

# map.computeRingWindingOrder.devError
source: Expected points of type {x:number, y:number}
ta: வகையின் எதிர்பார்க்கப்படும் புள்ளிகள் {x: எண், y: எண்}

# map.displayVariablesConcept.defaultName
source: Display Variable
ta: காட்சி மாறி

# map.drawExtentHelper.drawExtent
source: Draw Extent
ta: அளவை வரையவும்

# map.drawExtentHelper.extent
source: Extent
ta: அளவு

# map.gmlToGeoJson.missingPos
source: GML point element is missing a pos element.
ta: சி.எம்.எல் புள்ளி உறுப்பு ஒரு பிஓஎச் உறுப்பைக் காணவில்லை.

# map.gmlToGeoJson.missingExteriorRing
source: GML polygon is missing its exterior ring.
ta: சி.எம்.எல் பலகோணம் அதன் வெளிப்புற வளையத்தைக் காணவில்லை.

# map.gmlToGeoJson.missingPosList
source: GML polygon's exterior ring is missing a posList.
ta: சி.எம்.எல் பலகோணத்தின் வெளிப்புற வளையத்தை ஒரு போவிச்ட்டைக் காணவில்லை.

# map.gmlToGeoJson.containsUnsupportedFeatureType
source: GML contains unsupported feature type: {{type}}
ta: சி.எம்.எல் ஆதரிக்கப்படாத அம்ச வகை: {{type}}

# map.geoRssToGeoJson.containsUnsupportedFeatureType
source: GeoRSS contains unsupported feature type: {{type}}
ta: சார்ச் ஆதரிக்கப்படாத அம்ச வகை: {{type}}

# map.w3cToGeoJson.containsUnsupportedFeatureType
source: GeoRSS with W3C geometry contains unsupported feature type: {{type}}
ta: W3C வடிவவியலுடன் சார்ச் ஆதரிக்கப்படாத அம்ச வகை: {{type}}

# map.gnafAddressGeocoder.noAddresses
source: This tableStructure has no addresses!
ta: இந்த டேபிள்ச்ட்ரக்சருக்கு எந்த முகவரிகளும் இல்லை!

# map.gnafAddressGeocoder.noAddresses2
source: Even though the tableStructure reports it has an address column, it has no addresses
ta: டேப்ளச்ட்ரக்சர் அதில் ஒரு முகவரி நெடுவரிசை இருப்பதாக தெரிவித்தாலும், அதற்கு முகவரிகள் இல்லை

# map.gnafAddressGeocoder.suburb
source: Suburb
ta: புறநகர்

# map.gnafAddressGeocoder.state
source: State
ta: மாநிலம்

# map.gnafAddressGeocoder.postcode
source: Postcode
ta: அஞ்சல் குறியீடு

# map.gnafAddressGeocoder.matchedAddresses
source: Matched Address
ta: பொருந்திய முகவரி

# map.gnafAddressGeocoder.lon
source: Lon
ta: லோன்

# map.gnafAddressGeocoder.lat
source: Lat
ta: லாட்

# map.gnafAddressGeocoder.score
source: Score
ta: கெலிப்பெண்

# map.gnafAddressGeocoder.poBox
source: po box
ta: போ பெட்டி

# map.gnafAddressGeocoder.postOfficeBox
source: post office box
ta: தபால் அலுவலக பெட்டி

# map.imageryProviderHooks.devError
source: No context for image recoloring.
ta: பட மறுசீரமைப்பிற்கான சூழல் இல்லை.

# map.mapboxVectorTileImageryProvider.requireLayerName
source: MapboxVectorTileImageryProvider requires a layer name passed as options.layerName
ta: Mapboxvectortileimageryprovider ஒரு அடுக்கு பெயர் விருப்பங்களாக அனுப்பப்பட வேண்டும். Layername

# map.mapboxVectorTileImageryProvider.requireStyles
source: MapboxVectorTileImageryProvider requires a styling function passed as options.styleFunc
ta: Mapboxvectortileimageryprovider ஒரு ச்டைலிங் செயல்பாட்டை விருப்பங்களாக அனுப்ப வேண்டும்

# map.mapboxVectorTileImageryProvider.moreThanFourTiles
source: The imagery provider's rectangle and minimumLevel indicate that there are {{tileCount}} tiles at the minimum level. Imagery providers with more than four tiles at the minimum level are not supported.
ta: பட வழங்குநரின் செவ்வகம் மற்றும் குறைந்தபட்ச லெவல் குறைந்தபட்ச மட்டத்தில் {{tileCount}} ஓடுகள் உள்ளன என்பதைக் குறிக்கிறது. குறைந்தபட்ச மட்டத்தில் நான்கு ஓடுகளுக்கு மேல் உள்ள பட வழங்குநர்கள் ஆதரிக்கப்படவில்லை.

# map.mapboxVectorTileImageryProvider.maxLevelError
source: Maximum level too high for data set
ta: தரவு தொகுப்புக்கு அதிகபட்ச நிலை மிக அதிகம்

# map.regionProvider.csvRegionMappingTitle
source: CSV region mapping
ta: சி.எச்.வி பிராந்திய மேப்பிங்

# map.regionProvider.csvRegionMappingMessageZeroFound
source: Zero region names found for region type {{regionType}}
ta: பிராந்திய வகை {{regionType}} க்கு சுழிய பிராந்திய பெயர்கள் காணப்படுகின்றன

# map.regionProvider.csvRegionMappingMessageZeroBoundariesFound
source: Zero region boundaries found for region {{regionName}}
ta: பிராந்தியத்திற்கு காணப்படும் சுழிய பிராந்திய எல்லைகள் {{regionName}}

# map.regionProvider.csvRegionMappingMessageLoadError
source: Couldn't load region boundaries for region {{regionName}} {{exception}}
ta: பிராந்தியத்திற்கான பிராந்திய எல்லைகளை ஏற்ற முடியவில்லை {{regionName}} {{exception}}

# map.extraCreditLinks.dataAttribution
source: Data attribution
ta: தரவு பண்புக்கூறு

# map.extraCreditLinks.termsOfUse
source: Terms of use
ta: பயன்பாட்டு விதிமுறைகள்

# map.extraCreditLinks.credits
source: Credits
ta: வரவு

# map.extraCreditLinks.mapCredits
source: Map credits
ta: வரைபட வரவு

# map.extraCreditLinks.dataProvider
source: Data provided by:
ta: வழங்கிய தரவு:

# map.extraCreditLinks.searchProvider
source: Search provided by:
ta: வழங்கிய தேடல்:

# models.userData.addingDataErrorTitle
source: Data could not be added
ta: தரவைச் சேர்க்க முடியவில்லை

# models.userData.addingDataErrorMessage
source: The specified data could not be added because it is invalid or does not have the expected format.
ta: குறிப்பிட்ட தரவைச் சேர்க்க முடியவில்லை, ஏனெனில் இது தவறானது அல்லது எதிர்பார்க்கப்படும் வடிவம் இல்லை.

# models.userData.fileApiNotSupportedTitle
source: File API not supported
ta: கோப்பு பநிஇ ஆதரிக்கப்படவில்லை

# models.userData.fileApiNotSupportedMessage
source: Sorry, your web browser does not support the File API, which {{appName}} requires in order to add data from a file on your system. Please upgrade your web browser. For the best experience, we recommend the latest version of {{chrome}}, {{firefox}} or {{edge}}.
ta: மன்னிக்கவும், உங்கள் கணினியில் ஒரு கோப்பிலிருந்து தரவைச் சேர்க்க {{appName}} தேவைப்படும் பநிஇ கோப்பை உங்கள் வலை உலாவி ஆதரிக்காது. உங்கள் வலை உலாவியை மேம்படுத்தவும். சிறந்த அனுபவத்திற்கு, {{firefox}}, {{chrome}} அல்லது {{edge}} இன் அண்மைக் கால பதிப்பைப் பரிந்துரைக்கிறோம்.

# models.arcGisService.name
source: ArcGIS Service Group
ta: ஆர்கிசிச் பணி குழு

# models.arcGisService.invalidServerTitle
source: Invalid ArcGIS Server
ta: தவறான ARCGIS சேவையகம்

# models.arcGisService.invalidServerMessage
source: An error occurred while invoking the ArcGIS REST service. The server's response does not appear to be a valid ArcGIS REST document.
ta: ArcGIS REST சேவையைத் தூண்டும்போது பிழை ஏற்பட்டது. சேவையகத்தின் பதில் செல்லுபடியாகும் ARCGIS REST ஆவணமாகத் தெரியவில்லை.

# models.arcGisService.groupNotAvailableTitle
source: Group is not available
ta: குழு கிடைக்கவில்லை

# models.arcGisService.groupNotAvailableMessage
source: An error occurred while invoking the ArcGIS REST service.
ta: ArcGIS REST சேவையைத் தூண்டும்போது பிழை ஏற்பட்டது.

# models.arcGisFeatureServer.name
source: ArcGIS Feature Server
ta: ARCGIS அம்ச சேவையகம்

# models.arcGisFeatureServer.nameGroup
source: ArcGIS Feature Server Group
ta: ArcGIS அம்ச சேவையக குழு

# models.arcGisFeatureServer.invalidServiceTitle
source: Invalid ArcGIS Feature Service
ta: தவறான ARCGIS அம்ச பணி

# models.arcGisFeatureServer.invalidServiceMessage
source: An error occurred while invoking the ArcGIS Feature Service. The server's response does not appear to be a valid Feature Service document.
ta: ARCGIS அம்ச சேவையைத் தொடங்கும்போது பிழை ஏற்பட்டது. சேவையகத்தின் பதில் சரியான அம்ச பணி ஆவணமாகத் தெரியவில்லை.

# models.arcGisFeatureServer.groupNotAvailableTitle
source: Group is not available
ta: குழு கிடைக்கவில்லை

# models.arcGisFeatureServer.groupNotAvailableMessage
source: An error occurred while invoking the ArcGIS Feature Service.
ta: ARCGIS அம்ச சேவையைத் தொடங்கும்போது பிழை ஏற்பட்டது.

# models.arcGisFeatureServerCatalogGroup.name
source: ArcGIS Feature Server Group
ta: ArcGIS அம்ச சேவையக குழு

# models.arcGisFeatureServerCatalogGroup.dataDescription
source: Data Description
ta: தரவு விளக்கம்

# models.arcGisFeatureServerCatalogGroup.serviceDescription
source: Service Description
ta: பணி விளக்கம்

# models.arcGisFeatureServerCatalogGroup.copyrightText
source: Copyright Text
ta: பதிப்புரிமை உரை

# models.arcGisFeatureServerCatalogGroup.invalidServiceTitle
source: Invalid ArcGIS Feature Service
ta: தவறான ARCGIS அம்ச பணி

# models.arcGisFeatureServerCatalogGroup.invalidServiceMessage
source: An error occurred while invoking the ArcGIS Feature Service. The server's response does not appear to be a valid Feature Service document.
ta: ARCGIS அம்ச சேவையைத் தொடங்கும்போது பிழை ஏற்பட்டது. சேவையகத்தின் பதில் சரியான அம்ச பணி ஆவணமாகத் தெரியவில்லை.

# models.arcGisFeatureServerCatalogGroup.groupNotAvailableTitle
source: Group is not available
ta: குழு கிடைக்கவில்லை

# models.arcGisFeatureServerCatalogGroup.groupNotAvailableMessage
source: An error occurred while invoking the ArcGIS Feature Service.
ta: ARCGIS அம்ச சேவையைத் தொடங்கும்போது பிழை ஏற்பட்டது.

# models.arcGisFeatureServerCatalogItem.name
source: Esri ArcGIS FeatureServer
ta: ESRI ARCGIS நற்பொருத்தங்கள்

# models.arcGisFeatureServerCatalogItem.dataDescription
source: Data Description
ta: தரவு விளக்கம்

# models.arcGisFeatureServerCatalogItem.serviceDescription
source: Service Description
ta: பணி விளக்கம்

# models.arcGisFeatureServerCatalogItem.copyrightText
source: Copyright Text
ta: பதிப்புரிமை உரை

# models.arcGisFeatureServerCatalogItem.missingUrlTitle
source: Unable to load FeatureServer
ta: நற்பொருத்தங்கள் சர்வர் ஏற்ற முடியவில்லை

# models.arcGisFeatureServerCatalogItem.missingUrlMessage
source: Could not load the ArcGis FeatureServer endpoint because the catalog item does not have a `url`.
ta: ஆர்கிசிச் நற்பொருத்தங்கள் சர்வர் எண்ட்பாயிண்ட் ஏற்ற முடியவில்லை, ஏனெனில் பட்டியல் உருப்படியில் `url` இல்லை.

# models.arcGisFeatureServerCatalogItem.invalidServiceTitle
source: Invalid ArcGIS Feature Service layer
ta: தவறான ARCGIS அம்ச பணி அடுக்கு

# models.arcGisFeatureServerCatalogItem.invalidServiceMessage
source: An error occurred while invoking the ArcGIS Feature Service. The server's response does not appear to be a valid Feature Service layer.
ta: ARCGIS அம்ச சேவையைத் தொடங்கும்போது பிழை ஏற்பட்டது. சேவையகத்தின் பதில் சரியான அம்ச பணி அடுக்காகத் தெரியவில்லை.

# models.arcGisFeatureServerCatalogItem.reachedMaxFeatureLimit
source: Warning: This layer has reached the FeatureService feature limit ({{maxFeatures}}).
ta: எச்சரிக்கை: இந்த அடுக்கு நற்பொருத்தங்கள் பணி அம்ச வரம்பை எட்டியுள்ளது ({{maxFeatures}}).

# models.arcGisMapServerCatalogGroup.name
source: ArcGIS Map Server Group
ta: ArcGIS MAP சேவையக குழு

# models.arcGisMapServerCatalogGroup.dataDescription
source: Data Description
ta: தரவு விளக்கம்

# models.arcGisMapServerCatalogGroup.serviceDescription
source: Service Description
ta: பணி விளக்கம்

# models.arcGisMapServerCatalogGroup.copyrightText
source: Copyright Text
ta: பதிப்புரிமை உரை

# models.arcGisMapServerCatalogGroup.invalidServiceTitle
source: Invalid ArcGIS Map Service
ta: தவறான ARCGIS MAP பணி

# models.arcGisMapServerCatalogGroup.invalidServiceMessage
source: An error occurred while invoking the ArcGIS Map Service. The server's response does not appear to be a valid Map Service document.
ta: ARCGIS MAP சேவையைத் தொடங்கும்போது பிழை ஏற்பட்டது. சேவையகத்தின் பதில் சரியான வரைபட பணி ஆவணமாகத் தெரியவில்லை.

# models.arcGisMapServerCatalogGroup.groupNotAvailableTitle
source: Group is not available
ta: குழு கிடைக்கவில்லை

# models.arcGisMapServerCatalogGroup.groupNotAvailableMessage
source: An error occurred while invoking the ArcGIS Map Service.
ta: ARCGIS MAP சேவையைத் தொடங்கும்போது பிழை ஏற்பட்டது.

# models.arcGisMapServerCatalogGroup.singleFusedMapCacheLayerName
source: All layers
ta: அனைத்து அடுக்குகளும்

# models.arcGisMapServerCatalogItem.dataDescription
source: Data Description
ta: தரவு விளக்கம்

# models.arcGisMapServerCatalogItem.serviceDescription
source: Service Description
ta: பணி விளக்கம்

# models.arcGisMapServerCatalogItem.copyrightText
source: Copyright Text
ta: பதிப்புரிமை உரை

# models.arcGisMapServerCatalogItem.invalidUrlTitle
source: Unable to load MapServer
ta: வரைபடத்தை ஏற்ற முடியவில்லை

# models.arcGisMapServerCatalogItem.invalidUrlMessage
source: Could not load the ArcGis MapServer endpoint because the catalog item does not have a `url`.
ta: ஆர்கிசிச் மேப்சர்வர் எண்ட்பாயிண்ட் ஏற்ற முடியவில்லை, ஏனெனில் பட்டியல் உருப்படியில் `url` இல்லை.

# models.arcGisMapServerCatalogItem.noLayersFoundTitle
source: Could not load ArcGIS MapServer.
ta: Arcgis Mapserver ஐ ஏற்ற முடியவில்லை.

# models.arcGisMapServerCatalogItem.noLayersFoundMessage
source: The Esri ArcGIS MapServer '{{name}}' has no layers to show.
ta: ESRI Arcgis Mapserver '{{name}}' காட்ட அடுக்குகள் இல்லை.

# models.arcGisImageServerCatalogItem.name
source: Esri ArcGIS ImageServer
ta: ESRI ARCGIS PICTERVER

# models.arcGisImageServerCatalogItem.invalidUrlTitle
source: Unable to load ImageServer
ta: படங்களை ஏற்ற முடியவில்லை

# models.arcGisImageServerCatalogItem.invalidUrlMessage
source: Could not load the ArcGis ImageServer endpoint because the catalog item does not have a `url`.
ta: ஆர்கிசிச் இமேசர்வர் எண்ட்பாயிண்ட் ஏற்ற முடியவில்லை, ஏனெனில் பட்டியல் உருப்படியில் `url` இல்லை.

# models.arcGisImageServerCatalogItem.invalidServiceTitle
source: Invalid ArcGIS Image Service
ta: தவறான ARCGIS பட பணி

# models.arcGisImageServerCatalogItem.invalidServiceMessage
source: An error occurred while invoking the ArcGIS Image Service. The server's response does not appear to be a valid Image Service document.
ta: ARCGIS பட சேவையைத் தொடங்கும்போது பிழை ஏற்பட்டது. சேவையகத்தின் பதில் சரியான பட பணி ஆவணமாகத் தெரியவில்லை.

# models.arcGisImageServerCatalogItem.rasterFunction
source: Raster Function
ta: ராச்டர் செயல்பாடு

# models.bing.name
source: Bing Maps
ta: பிங் வரைபடங்கள்

# models.wcs.asyncResultLoadingMetadata
source: WCS loading: {{name}} service at {{timestamp}}. *Loading metadata (`DescribeCoverage`)*
ta: WCS ஏற்றுதல்: {{timestamp}} இல் {{name}} சேவை. *மெட்டாடேட்டாவை ஏற்றுகிறது (`விவரிக்கும் பாதுகாப்பு`)*

# models.wcs.asyncResultDescription
source: This is the result of exporting data from {{name}} service at {{timestamp}} with the input parameters below.
ta: கீழேயுள்ள உள்ளீட்டு அளவுருக்களுடன் {{name}} இல் {{timestamp}} சேவையிலிருந்து தரவை ஏற்றுமதி செய்வதன் விளைவாகும்.

# models.wcs.asyncPendingDescription
source: WCS loading: {{name}} service at {{timestamp}}. *Downloading coverage*
ta: WCS ஏற்றுதல்: {{name}} இல் {{timestamp}} சேவை. *கவரேச் பதிவிறக்குதல்*

# models.wcs.exportFailedTitle
source: Data export failed
ta: தரவு ஏற்றுமதி தோல்வியடைந்தது

# models.wcs.exportFailedMessage
source: The Web Coverage Service failed
ta: வலை பாதுகாப்பு பணி தோல்வியடைந்தது

# models.wcs.exportFailedMessageII
source: The Web Coverage Service failed: {{error}}
ta: வலை கவரேச் பணி தோல்வியுற்றது: {{error}}

# models.cartoMap.name
source: Carto Map
ta: கார்ட்டோ வரைபடம்

# models.cartoMap.noUrlTitle
source: No URL
ta: முகவரி இல்லை

# models.cartoMap.noUrlMessage
source: Unable to find a usable URL for the Carto Map layer.
ta: கார்ட்டோ வரைபட அடுக்குக்கு பயன்படுத்தக்கூடிய முகவரி ஐ கண்டுபிடிக்க முடியவில்லை.

# models.cesiumTerrain.name
source: Cesium Terrain
ta: சீசியம் நிலப்பரப்பு

# models.cesiumTerrain.name3D
source: Cesium 3D Tiles
ta: சீசியம் 3 டி ஓடுகள்

# models.cesiumTerrain.notSupportedErrorTitle
source: Not supported in 2D
ta: 2D இல் ஆதரிக்கப்படவில்லை

# models.cesiumTerrain.notSupportedErrorMessage
source: "{{name}}" cannot be show in the 2D view. Switch to 3D and try again.
ta: "{{name}}" 2 டி பார்வையில் காட்ட முடியாது. 3D க்கு மாறி மீண்டும் முயற்சிக்கவும்.

# models.cesiumTerrain.errorRenderingTitle
source: Error rendering in 3D
ta: 3D இல் பிழை வழங்குதல்

# models.cesiumTerrain.errorRenderingMessage
source: An error occurred while rendering in 3D. This probably indicates a bug in {{appName}} or an incompatibility with your system or web browser. We'll now switch you to 2D so that you can continue your work.
ta: 3D இல் வழங்குதல் செய்யும்போது பிழை ஏற்பட்டது. இது {{appName}} இல் உள்ள பிழை அல்லது உங்கள் கணினி அல்லது வலை உலாவியுடன் பொருந்தாத தன்மையைக் குறிக்கிறது. நாங்கள் இப்போது உங்களை 2D க்கு மாற்றுவோம், இதன்மூலம் உங்கள் வேலையைத் தொடரலாம்.

# models.ckan.nameServer
source: CKAN Server
ta: CKAN சேவையகம்

# models.ckan.errorLoadingTitle
source: Error loading CKAN catalogue
ta: சி.கே.ஏ.என் பட்டியலை ஏற்றுவதில் பிழை

# models.ckan.errorLoadingMessage
source: The definition for this CKAN catalogue does not have a valid filter query.
ta: இந்த சி.கே.ஏ.என் பட்டியலுக்கான வரையறைக்கு சரியான வடிகட்டி வினவல் இல்லை.

# models.ckan.corsErrorMessage
source: Couldn't retrieve packages from this CKAN server.
ta: இந்த CKAN சேவையகத்திலிருந்து தொகுப்புகளை மீட்டெடுக்க முடியவில்லை.

# models.ckan.name
source: CKAN Resource
ta: CKAN வள

# models.ckan.dataSourceErrorMessage
source: This data source does not have any details available.
ta: இந்த தரவு மூலத்தில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.ckan.serviceErrorMessage
source: This service does not have any details available.
ta: இந்த சேவையில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.ckan.datasetDescription
source: Dataset Description
ta: தரவுத்தொகுப்பு விளக்கம்

# models.ckan.dataDescription
source: Data Description
ta: தரவு விளக்கம்

# models.ckan.resourceDescription
source: Resource Description
ta: வள விளக்கம்

# models.ckan.datasetCustodian
source: Dataset Custodian
ta: தரவுத்தொகுப்பு பாதுகாவலர்

# models.ckan.licence
source: Licence
ta: உரிமம்

# models.ckan.author
source: Author
ta: நூலாசிரியர்

# models.ckan.contact_point
source: Contact
ta: தொடர்பு

# models.ckan.metadata_created
source: Created
ta: உருவாக்கப்பட்டது

# models.ckan.metadata_modified
source: Modified
ta: மாற்றியமைக்கப்பட்ட

# models.ckan.update_freq
source: Update Frequency
ta: புதுப்பிப்பு அதிர்வெண்

# models.ckan.idsNotSpecifiedTitle
source: resourceId or datasetId must be specified
ta: resourceID அல்லது datasetid குறிப்பிடப்பட வேண்டும்

# models.ckan.idsNotSpecifiedMessage
source: CkanCatalogItem requires that either resourceId or datasetId be specified.
ta: Ckancatalogitem வளம் ஐடி அல்லது DataSetid ஐக் குறிப்பிட வேண்டும்.

# models.ckan.errorRetrievingUrlTitle
source: Error retrieving CKAN URL
ta: CKAN முகவரி ஐ மீட்டெடுப்பதில் பிழை

# models.ckan.errorRetrievingUrlMessage
source: Could not retrieve URL as JSON: {{url}}.
ta: முகவரி ஐ சாதொபொகு என மீட்டெடுக்க முடியவில்லை: {{url}}.

# models.ckan.invalidCkanTitle
source: Invalid CKAN resource JSON
ta: தவறான CKAN வள சாதொபொகு

# models.ckan.invalidCkanMessage
source: The resource returned from the CKAN server does not appear to have a package_id.
ta: CKAN சேவையகத்திலிருந்து திரும்பிய சான்று ஒரு தொகுப்பு_ஐடி இருப்பதாகத் தெரியவில்லை.

# models.ckan.notCompatibleTitle
source: No compatible resources found
ta: இணக்கமான வளங்கள் எதுவும் கிடைக்கவில்லை

# models.ckan.notCompatibleMessageI
source: The CKAN dataset does not have a resource with the ID {{resourceId}} or it does not have a supported format.
ta: CKAN தரவுத்தொகுப்பில் ஐடி {{resourceId}} உடன் ஒரு ஆதாரத்தைக் கொண்டிருக்கவில்லை அல்லது அதற்கு உதவி வடிவம் இல்லை.

# models.ckan.notCompatibleMessageII
source: The CKAN dataset does not have any resources with a supported format.
ta: CKAN தரவுத்தொகுப்பில் உதவி வடிவத்துடன் எந்த ஆதாரமும் இல்லை.

# models.arcgisPortal.nameGroup
source: ArcGIS Portal Group
ta: ஆர்கிச் போர்டல் குழு

# models.arcgisPortal.errorLoadingTitle
source: Error loading ArcGIS Portal catalogue
ta: ArcGIS போர்ட்டல் பட்டியலை ஏற்றுவதில் பிழை

# models.arcgisPortal.errorLoadingMessage
source: The definition for this ArcGIS Portal catalogue does not have a valid filter query.
ta: இந்த ஆர்கிசிச் போர்ட்டல் பட்டியலுக்கான வரையறையில் சரியான வடிகட்டி வினவல் இல்லை.

# models.arcgisPortal.corsErrorMessage
source: Couldn't retrieve packages from this ArcGIS Portal server.
ta: இந்த ArcGIS போர்டல் சேவையகத்திலிருந்து தொகுப்புகளை மீட்டெடுக்க முடியவில்லை.

# models.arcgisPortal.name
source: ArcGIS Portal Item
ta: Arcgis போர்ட்டல் உருப்படி

# models.arcgisPortal.dataSourceErrorMessage
source: This data source does not have any details available.
ta: இந்த தரவு மூலத்தில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.arcgisPortal.serviceErrorMessage
source: This service does not have any details available.
ta: இந்த சேவையில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.arcgisPortal.datasetDescription
source: Dataset Description
ta: தரவுத்தொகுப்பு விளக்கம்

# models.arcgisPortal.licence
source: Licence
ta: உரிமம்

# models.arcgisPortal.openInPortal
source: Open in ArcGIS Portal
ta: ஆர்கிசிச் போர்ட்டலில் திறக்கப்படுகிறது
