Repository: 247i/TACETr
Catalog: உரை/வெறுமை/terriajs-terriajsnext-*.po
Languages: ta

# models.userDrawing.messageHeader
source: Draw on Map
ta: வரைபடத்தில் வரையவும்

# models.userDrawing.pointEntities
source: Points
ta: பிரிவகம்

# models.userDrawing.otherEntities
source: Lines and polygons
ta: கோடுகள் மற்றும் பலகோணங்கள்

# models.userDrawing.line
source: Line
ta: வரி

# models.userDrawing.firstPoint
source: First Point
ta: முதல் புள்ளி

# models.userDrawing.btnCancel
source: Cancel
ta: ரத்துசெய்

# models.userDrawing.btnDone
source: Done
ta: முடிந்தது

# models.userDrawing.clickToAddFirstPoint
source: Click to add a point
ta: ஒரு புள்ளியைச் சேர்க்க சொடுக்கு செய்க

# models.userDrawing.clickToAddAnotherPoint
source: Click to add another point
ta: மற்றொரு புள்ளியைச் சேர்க்க சொடுக்கு செய்க

# models.userDrawing.clickToRedrawRectangle
source: Click another point to redraw the rectangle
ta: செவ்வகத்தை மறுவடிவமைக்க மற்றொரு புள்ளியைக் சொடுக்கு செய்க

# models.userDrawing.anotherPoint
source: Another Point
ta: மற்றொரு புள்ளி

# models.userDrawing.userPolygon
source: User polygon
ta: பயனர் பலகோணம்

# models.webFeatureServiceCatalogGroup.wfsServer
source: Web Feature Service (WFS) Server
ta: வலை அம்ச பணி (WFS) சேவையகம்

# models.webFeatureServiceCatalogGroup.invalidWFSServerTitle
source: Invalid WFS server
ta: தவறான WFS சேவையகம்

# models.webFeatureServiceCatalogGroup.invalidWFSServerMessage
source: An error occurred while invoking GetCapabilities on the WFS server. The server's response does not appear to be a valid GetCapabilities document.
ta: WFS சேவையகத்தில் GetPapapapities ஐத் தூண்டும்போது பிழை ஏற்பட்டது. சேவையகத்தின் பதில் செல்லுபடியாகும் getPapapapities ஆவணமாகத் தெரியவில்லை.

# models.webFeatureServiceCatalogGroup.groupNotAvailableTitle
source: Group is not available
ta: குழு கிடைக்கவில்லை

# models.webFeatureServiceCatalogGroup.groupNotAvailableMessage
source: An error occurred while invoking GetCapabilities on the WFS server.
ta: WFS சேவையகத்தில் GetPapapapities ஐத் தூண்டும்போது பிழை ஏற்பட்டது.

# models.webFeatureServiceCatalogGroup.abstract
source: Web Feature Service Description
ta: வலை நற்பொருத்தம் பணி விளக்கம்

# models.webFeatureServiceCatalogGroup.accessConstraints
source: Web Feature Service Access Constraints
ta: வலை நற்பொருத்தம் பணி அணுகல் கட்டுப்பாடுகள்

# models.webFeatureServiceCatalogGroup.fees
source: Web Feature Service Fees
ta: வலை அம்ச பணி கட்டணம்

# models.webFeatureServiceCatalogItem.wfs
source: Web Feature Service (WFS)
ta: வலை அம்ச பணி (WFS)

# models.webFeatureServiceCatalogItem.dataDescription
source: Data Description
ta: தரவு விளக்கம்

# models.webFeatureServiceCatalogItem.abstract
source: Web Feature Service Description
ta: வலை நற்பொருத்தம் பணி விளக்கம்

# models.webFeatureServiceCatalogItem.serviceDescription
source: Service Description
ta: பணி விளக்கம்

# models.webFeatureServiceCatalogItem.metadataUrls
source: Metadata Links
ta: மேனிலை தரவு இணைப்புகள்

# models.webFeatureServiceCatalogItem.accessConstraints
source: Access Constraints
ta: அணுகல் கட்டுப்பாடுகள்

# models.webFeatureServiceCatalogItem.serviceContact
source: Service Contact
ta: பணி தொடர்பு

# models.webFeatureServiceCatalogItem.getCapabilitiesUrl
source: GetCapabilities URL
ta: GetPapapapities முகவரி

# models.webFeatureServiceCatalogItem.noLayerFoundTitle
source: No layer found
ta: அடுக்கு எதுவும் கிடைக்கவில்லை

# models.webFeatureServiceCatalogItem.noLayerFoundMessage
source: The WFS dataset '{{name}}' has no layers matching '{{typeNames}}'. Either the catalog file has been set up incorrectly, or the WFS server has changed.
ta: WFS தரவுத்தொகுப்பில் '{{name}}' '{{typeNames}}' பொருந்தக்கூடிய அடுக்குகள் இல்லை. பட்டியல் கோப்பு தவறாக அமைக்கப்பட்டுள்ளது, அல்லது WFS சேவையகம் மாறிவிட்டது.

# models.webFeatureServiceCatalogItem.missingDataTitle
source: Missing data
ta: தரவு இல்லை

# models.webFeatureServiceCatalogItem.missingDataMessage
source: The WFS dataset '{{name}}' did not return any data. Either the catalog file has been set up incorrectly, or the server address has changed.
ta: WFS தரவுத்தொகுப்பு '{{name}}' எந்த தரவையும் திருப்பித் தரவில்லை. பட்டியல் கோப்பு தவறாக அமைக்கப்பட்டுள்ளது, அல்லது சேவையக முகவரி மாறிவிட்டது.

# models.webFeatureServiceCatalogItem.missingUrlTitle
source: Unable to load GetCapabilities
ta: GetPapapapities ஐ ஏற்ற முடியவில்லை

# models.webFeatureServiceCatalogItem.missingUrlMessage
source: Could not load the Web Feature Service (WFS) GetCapabilities document because the catalog item does not have a `url`.
ta: வலை அம்ச பணி (WFS) GetPapapapities ஆவணத்தை ஏற்ற முடியவில்லை, ஏனெனில் பட்டியல் உருப்படியில் `url` இல்லை.

# models.webFeatureServiceCatalogItem.reachedMaxFeatureLimit
source: Warning: This layer has reached the WFS feature limit ({{maxFeatures}})
ta: எச்சரிக்கை: இந்த அடுக்கு WFS அம்ச வரம்பை எட்டியுள்ளது ({{maxFeatures}})

# models.webMapServiceCatalogGroup.wmsServer
source: Web Map Service (WMS) Server
ta: வலை வரைபட பணி (WMS) சேவையகம்

# models.webMapServiceCatalogGroup.invalidWMSServerTitle
source: Invalid WMS server
ta: தவறான WMS சேவையகம்

# models.webMapServiceCatalogGroup.invalidWMSServerMessage
source: An error occurred while invoking GetCapabilities on the WMS server. The server's response does not appear to be a valid GetCapabilities document.
ta: WMS சேவையகத்தில் GetPapapapities ஐத் தூண்டும்போது பிழை ஏற்பட்டது. சேவையகத்தின் பதில் செல்லுபடியாகும் getPapapapities ஆவணமாகத் தெரியவில்லை.

# models.webMapServiceCatalogGroup.groupNotAvailableTitle
source: Group is not available
ta: குழு கிடைக்கவில்லை

# models.webMapServiceCatalogGroup.groupNotAvailableMessage
source: An error occurred while invoking GetCapabilities on the WMS server.
ta: WMS சேவையகத்தில் GetPapapapities ஐத் தூண்டும்போது பிழை ஏற்பட்டது.

# models.webMapServiceCatalogGroup.missingUrlTitle
source: Unable to load GetCapabilities
ta: GetPapapapities ஐ ஏற்ற முடியவில்லை

# models.webMapServiceCatalogGroup.missingUrlMessage
source: Could not load the Web Map Service (WMS) GetCapabilities document because the catalog item does not have a `url`.
ta: வலை வரைபட பணி (WMS) GetPapapapities ஆவணத்தை ஏற்ற முடியவில்லை, ஏனெனில் பட்டியல் உருப்படியில் `url` இல்லை.

# models.webMapServiceCatalogGroup.abstract
source: Web Map Service Description
ta: வலை வரைபட பணி விளக்கம்

# models.webMapServiceCatalogGroup.accessConstraints
source: Web Map Service Access Constraints
ta: வலை வரைபட பணி அணுகல் கட்டுப்பாடுகள்

# models.webMapServiceCatalogGroup.fees
source: Web Map Service Fees
ta: வலை வரைபட பணி கட்டணம்

# models.webMapServiceCatalogItem.wms
source: Web Map Service (WMS)
ta: வலை வரைபட பணி (WMS)

# models.webMapServiceCatalogItem.dataDescription
source: Data Description
ta: தரவு விளக்கம்

# models.webMapServiceCatalogItem.serviceDescription
source: Service Description
ta: பணி விளக்கம்

# models.webMapServiceCatalogItem.metadataUrls
source: Metadata Links
ta: மேனிலை தரவு இணைப்புகள்

# models.webMapServiceCatalogItem.accessConstraints
source: Access Constraints
ta: அணுகல் கட்டுப்பாடுகள்

# models.webMapServiceCatalogItem.serviceContact
source: Service Contact
ta: பணி தொடர்பு

# models.webMapServiceCatalogItem.getCapabilitiesUrl
source: GetCapabilities URL
ta: GetPapapapities முகவரி

# models.webMapServiceCatalogItem.defaultStyleLabel
source: Default style
ta: இயல்புநிலை நடை

# models.webMapServiceCatalogItem.noLayerFoundTitle
source: No layer found
ta: அடுக்கு எதுவும் கிடைக்கவில்லை

# models.webMapServiceCatalogItem.noLayerFoundMessage
source: The WMS dataset '{{name}}' has no layers matching '{{layers}}'. Either the catalog file has been set up incorrectly, or the WMS server has changed.
ta: WMS தரவுத்தொகுப்பில் '{{name}}' '{{layers}}' பொருந்தக்கூடிய அடுக்குகள் இல்லை. பட்டியல் கோப்பு தவறாக அமைக்கப்பட்டுள்ளது, அல்லது WMS சேவையகம் மாறிவிட்டது.

# models.webMapServiceCatalogItem.badlyFormatedTitle
source: Badly formatted periodicity
ta: மோசமாக வடிவமைக்கப்பட்ட கால இடைவெளி

# models.webMapServiceCatalogItem.badlyFormatedMessage
source: The '{{name}}' dataset has a badly formed periodicity, '{{isoSegments}}'. Click the dataset's Info button for more information about the dataset and the data custodian.
ta: '{{name}}' தரவுத்தொகுப்பில் மோசமாக உருவான கால இடைவெளியைக் கொண்டுள்ளது, '{{isoSegments}}'. தரவுத்தொகுப்பு மற்றும் தரவு பாதுகாவலர் பற்றிய கூடுதல் தகவலுக்கு தரவுத்தொகுப்பின் செய்தி பொத்தானைக் சொடுக்கு செய்க.

# models.webMapServiceCatalogItem.missingDataTitle
source: Missing data
ta: தரவு இல்லை

# models.webMapServiceCatalogItem.missingDataMessage
source: The WMS dataset '{{name}}' did not return any data.{{line}}{{line}}Either the catalog file has been set up incorrectly, or the server address has changed.
ta: WMS தரவு '{{name}}' எந்தத் தரவையும் திருப்பித் தரவில்லை. {{line}}{{line}} ஒன்று பட்டியல் கோப்பு தவறாக அமைக்கப்பட்டுள்ளது, அல்லது சேவையக முகவரி மாறிவிட்டது.

# models.webMapServiceCatalogItem.missingUrlTitle
source: Unable to load GetCapabilities
ta: GetPapapapities ஐ ஏற்ற முடியவில்லை

# models.webMapServiceCatalogItem.missingUrlMessage
source: Could not load the Web Map Service (WMS) GetCapabilities document because the catalog item does not have a `url`.
ta: வலை வரைபட பணி (WMS) GetPapapapities ஆவணத்தை ஏற்ற முடியவில்லை, ஏனெனில் பட்டியல் உருப்படியில் `url` இல்லை.

# models.webMapTileServiceCatalogGroup.wmtsServer
source: Web Map Tile Service (WMTS) Server
ta: விரலிடைத் தோல் Map Tile பணி (WMTS) சேவையகம்

# models.webMapTileServiceCatalogGroup.invalidWMTSServerTitle
source: Invalid WMTS server
ta: தவறான WMTS சேவையகம்

# models.webMapTileServiceCatalogGroup.invalidWMTSServerMessage
source: An error occurred while invoking GetCapabilities on the WMTS server. The server's response does not appear to be a valid GetCapabilities document.
ta: WMTS சேவையகத்தில் GetPapapapities ஐத் தூண்டும்போது பிழை ஏற்பட்டது. சேவையகத்தின் பதில் செல்லுபடியாகும் getPapapapities ஆவணமாகத் தெரியவில்லை.

# models.webMapTileServiceCatalogGroup.groupNotAvailableTitle
source: Group is not available
ta: குழு கிடைக்கவில்லை

# models.webMapTileServiceCatalogGroup.groupNotAvailableMessage
source: An error occurred while invoking GetCapabilities on the WMTS server.
ta: An பிழை occurred while invoking GetCapabilities on the WMTS சேவையகம்.

# models.webMapTileServiceCatalogGroup.abstract
source: Web Map Service Description
ta: வலை வரைபட பணி விளக்கம்

# models.webMapTileServiceCatalogGroup.accessConstraints
source: Web Map Service Access Constraints
ta: வலை வரைபட பணி அணுகல் கட்டுப்பாடுகள்

# models.webMapTileServiceCatalogGroup.fees
source: Web Map Service Fees
ta: வலை வரைபட பணி கட்டணம்

# models.webMapTileServiceCatalogGroup.invalidCapabilitiesTitle
source: Invalid GetCapabilities
ta: தவறான getPapapapities

# models.webMapTileServiceCatalogGroup.invalidCapabilitiesMessage
source: The URL {{url}} was retrieved successfully but it does not appear to be a valid Web Map Tile Service (WMTS) GetCapabilities document. Either the catalog file has been set up incorrectly, or the server address has changed.
ta: முகவரி {{url}} வெற்றிகரமாக மீட்டெடுக்கப்பட்டது, ஆனால் இது செல்லுபடியாகும் வலை வரைபட ஓடு பணி (WMTS) GetPapapities ஆவணமாகத் தெரியவில்லை. பட்டியல் கோப்பு தவறாக அமைக்கப்பட்டுள்ளது, அல்லது சேவையக முகவரி மாறிவிட்டது.

# models.webMapTileServiceCatalogItem.wmts
source: Web Map Tile Service (WMTS)
ta: வலை வரைபட ஓடு பணி (WMTS)

# models.webMapTileServiceCatalogItem.dataDescription
source: Data Description
ta: தரவு விளக்கம்

# models.webMapTileServiceCatalogItem.serviceDescription
source: Service Description
ta: பணி விளக்கம்

# models.webMapTileServiceCatalogItem.accessConstraints
source: Access Constraints
ta: அணுகல் கட்டுப்பாடுகள்

# models.webMapTileServiceCatalogItem.fees
source: Web Map Tile Service Fees
ta: வலை வரைபட ஓடு பணி கட்டணம்

# models.webMapTileServiceCatalogItem.serviceContact
source: Service Contact
ta: பணி தொடர்பு

# models.webMapTileServiceCatalogItem.getCapabilitiesUrl
source: GetCapabilities URL
ta: GetPapapapities முகவரி

# models.webMapTileServiceCatalogItem.missingUrlTitle
source: Unable to load GetCapabilities
ta: GetPapapapities ஐ ஏற்ற முடியவில்லை

# models.webMapTileServiceCatalogItem.missingUrlMessage
source: Could not load the Web Map Tile Service (WMTS) GetCapabilities document because the catalog item does not have a `url`.
ta: வலை வரைபட ஓடு பணி (WMTS) GetPapapapities ஆவணத்தை ஏற்ற முடியவில்லை, ஏனெனில் பட்டியல் உருப்படியில் `url` இல்லை.

# models.webMapTileServiceCatalogItem.noUsableTileMatrixTitle
source: Warning
ta: எச்சரிக்கை

# models.webMapTileServiceCatalogItem.noUsableTileMatrixMessage
source: This WMTS layer has no Web Mercator tile matrix set - it may not display correctly
ta: இந்த WMTS அடுக்கில் வலை மெர்கேட்டர் டைல் மேட்ரிக்ச் தொகுப்பு இல்லை - இது சரியாகக் காட்டப்படாது

# models.webProcessingService.wps
source: Web Processing Service (WPS)
ta: வலை செயலாக்க பணி (WPS)

# models.webProcessingService.invalidWPSServerTitle
source: Invalid WPS server
ta: தவறான WPS சேவையகம்

# models.webProcessingService.invalidWPSServerMessage
source: An error occurred while invoking {{endpoint}} on the WPS server for process name {{name}}. The server's response does not appear to be a valid {{endpoint}} document.
ta: செயல்முறை பெயர் {{endpoint}} க்காக WPS சேவையகத்தில் {{name}} ஐ செயல்படுத்தும்போது பிழை ஏற்பட்டது. சேவையகத்தின் பதில் செல்லுபடியாகும் {{endpoint}} ஆவணமாகத் தெரியவில்லை.

# models.webProcessingService.processDescriptionErrorTitle
source: Process does not have a process description
ta: செயல்முறைக்கு செயல்முறை விளக்கம் இல்லை

# models.webProcessingService.processDescriptionErrorMessage
source: The WPS DescribeProcess for this process does not include a ProcessDescription.
ta: இந்த செயல்முறைக்கான WPS விவரிக்கும் செயலாக்கத்தில் ஒரு செயல்முறை விளக்கப்படம் இல்லை.

# models.webProcessingService.processInputErrorTitle
source: Process does not have any inputs
ta: செயல்முறைக்கு எந்த உள்ளீடுகளும் இல்லை

# models.webProcessingService.processInputErrorMessage
source: This WPS process does not specify any inputs.
ta: இந்த WPS செயல்முறை எந்த உள்ளீடுகளையும் குறிப்பிடவில்லை.

# models.webProcessingService.unsupportedParameterErrorTitle
source: Unsupported parameter type
ta: ஆதரிக்கப்படாத அளவுரு வகை

# models.webProcessingService.unsupportedParameterErrorMessage
source: The parameter {{identifier}} is not a supported type of parameter.
ta: {{identifier}} அளவுரு ஒரு உதவி வகை அளவுரு அல்ல.

# models.webProcessingService.invalidResponseErrorTitle
source: Invalid WPS server response
ta: தவறான WPS சேவையக பதில்

# models.webProcessingService.invalidResponseErrorMessage
source: An error occurred while accessing the status location on the WPS server for process name {{name}}.
ta: செயல்முறை பெயருக்கான WPS சேவையகத்தில் நிலை இருப்பிடத்தை அணுகும்போது பிழை ஏற்பட்டது {{name}}.

# models.webProcessingService.invalidResponseError2Title
source: Invalid response from WPS server
ta: WPS சேவையகத்திலிருந்து தவறான பதில்

# models.webProcessingService.invalidResponseError2Message
source: The response from the WPS server does not include a Status element.
ta: WPS சேவையகத்தின் பதிலில் நிலை உறுப்பு இல்லை.

# models.webProcessingService.failureReasonUnknowError
source: The reason for failure is unknown.
ta: தோல்விக்கான காரணம் தெரியவில்லை.

# models.webProcessingService.asyncShortReportFailed
source: Web Processing Service invocation failed. More details are available on the Info panel.
ta: வலை செயலாக்க பணி அழைப்பு தோல்வியடைந்தது. செய்தி குழுவில் மேலும் விவரங்கள் கிடைக்கின்றன.

# models.webProcessingService.errorDetails
source: Error Details
ta: பிழை விவரங்கள்

# models.webProcessingService.resultPendingDescription
source: This is the result of invoking the {{name}} process or service at {{timestamp}} with the input parameters below.
ta: இது கீழே உள்ள உள்ளீட்டு அளவுருக்களுடன் {{timestamp}}இல் {{name}} செயல்முறை அல்லது சேவையைச் செயல்படுத்துவதன் விளைவாகும்.

# models.webProcessingService.regionTypeDescription
source: The type of region to analyze.
ta: பகுப்பாய்வு செய்ய பகுதி வகை.

# models.webProcessingService.regionTypeName
source: Region Type
ta: பகுதி வகை

# models.webProcessingService.regionParameterName
source: Region Parameter
ta: பகுதி அளவுரு

# models.webProcessingService.wpsServer
source: Web Processing Service (WPS) Server
ta: வலை செயலாக்க பணி (WPS) சேவையகம்

# models.webProcessingService.wpsResult
source: Web Processing Service Result
ta: வலை செயலாக்க பணி முடிவு

# models.webProcessingServiceCatalogGroup.typeName
source: Web Processing Service (WPS) Server
ta: வலை செயலாக்க பணி (WPS) சேவையகம்

# models.webProcessingServiceCatalogGroup.missingUrlTitle
source: Unable to load GetCapabilities
ta: GetPapapapities ஐ ஏற்ற முடியவில்லை

# models.webProcessingServiceCatalogGroup.missingUrlMessage
source: Could not load the Web Processing Service (WPS) GetCapabilities document because the catalog item does not have a `url`.
ta: வலை செயலாக்க பணி (WPS) GetPapapapities ஆவணத்தை ஏற்ற முடியவில்லை, ஏனெனில் பட்டியல் உருப்படியில் `url` இல்லை.

# models.webProcessingServiceCatalogGroup.invalidCapabilitiesTitle
source: Invalid GetCapabilities
ta: தவறான getPapapapities

# models.webProcessingServiceCatalogGroup.invalidCapabilitiesMessage
source: The URL {{url}} was retrieved successfully but it does not appear to be a valid Web Processing Service (WPS) GetCapabilities document. Either the catalog file has been set up incorrectly, or the server address has changed.
ta: முகவரி {{url}} வெற்றிகரமாக மீட்டெடுக்கப்பட்டது, ஆனால் இது செல்லுபடியாகும் வலை செயலாக்க பணி (WPS) GetPapapapities ஆவணமாகத் தெரியவில்லை. பட்டியல் கோப்பு தவறாக அமைக்கப்பட்டுள்ளது, அல்லது சேவையக முகவரி மாறிவிட்டது.

# models.webProcessingServiceCatalogGroup.invalidServerTitle
source: Invalid WPS server
ta: தவறான WPS சேவையகம்

# models.webProcessingServiceCatalogGroup.invalidServerMessage
source: An error occurred while invoking GetCapabilities on the WPS server. The server's response does not appear to be a valid GetCapabilities document.
ta: WPS சேவையகத்தில் GetPapapapities ஐத் தூண்டும்போது பிழை ஏற்பட்டது. சேவையகத்தின் பதில் செல்லுபடியாகும் getPapapapities ஆவணமாகத் தெரியவில்லை.

# models.webProcessingServiceCatalogGroup.abstract
source: Web Processing Service Description
ta: வலை செயலாக்க பணி விளக்கம்

# models.webProcessingServiceCatalogGroup.accessConstraints
source: Web Processing Service Access Constraints
ta: வலை செயலாக்க பணி அணுகல் கட்டுப்பாடுகள்

# models.webProcessingServiceCatalogGroup.fees
source: Web Processing Service Fees
ta: வலை செயலாக்க பணி கட்டணம்

# models.webProcessingServiceCatalogGroup.providerName
source: Web Processing Service Provider Name
ta: வலை செயலாக்க பணி வழங்குநரின் பெயர்

# models.webProcessingServiceCatalogGroup.providerSite
source: Web Processing Service Provider Site
ta: வலை செயலாக்க பணி வழங்குநர் தளம்

# models.wfsFeatures.featuresGroup
source: Group of features in a Web Feature Service (WFS) Server
ta: வலை அம்ச பணி (WFS) சேவையகத்தில் அம்சங்களின் குழு

# models.wfsFeatures.queryErrorTitle
source: Error querying WFS server
ta: WFS சேவையகத்தை வினவுதல் பிழை

# models.wfsFeatures.queryErrorMessage
source: An error occurred while invoking GetFeature on the WFS server. The server's response does not appear to be a valid GeoJSON document.
ta: WFS சேவையகத்தில் GetFeature ஐ செயல்படுத்தும்போது பிழை ஏற்பட்டது. சேவையகத்தின் பதில் சரியான சியோச்சன் ஆவணமாகத் தெரியவில்லை.

# models.wfsFeatures.groupNotAvailableTitle
source: Group is not available
ta: குழு கிடைக்கவில்லை

# models.wfsFeatures.groupNotAvailableMessage
source: An error occurred while invoking GetFeature on the WFS server.
ta: WFS சேவையகத்தில் GetFeature ஐ செயல்படுத்தும்போது பிழை ஏற்பட்டது.

# models.shadow.name
source: Shadows
ta: நிழல்கள்

# models.shadow.options.none
source: None
ta: எதுவுமில்லை

# models.shadow.options.cast
source: Cast Only
ta: நடிப்பு மட்டுமே

# models.shadow.options.receive
source: Receive Only
ta: மட்டும் பெறுங்கள்

# models.shadow.options.both
source: Cast and Receive
ta: நடித்து பெறுங்கள்

# models.clippingBox.groupName
source: Clipping Box
ta: கிளிப்பிங் பெட்டி

# models.clippingBox.clipModel
source: Clip model
ta: கிளிப் மாதிரி

# models.clippingBox.showClippingBox
source: Show clipping box
ta: கிளிப்பிங் பெட்டியைக் காட்டு

# models.clippingBox.keepBoxAboveGround
source: Above ground only
ta: தரையில் மட்டும்

# models.clippingBox.clipDirection.name
source: Clip direction
ta: கிளிப் திசை

# models.clippingBox.clipDirection.options.inside
source: Clip inside the box
ta: பெட்டியின் உள்ளே கிளிப்

# models.clippingBox.clipDirection.options.outside
source: Clip outside the box
ta: பெட்டியின் வெளியே கிளிப்

# models.commonModelErrors.3dTypeIn2dMode
source: **Note:** This dataset can not be displayed in the 2D viewer. Switch to one of the 3D map modes.
ta: ** குறிப்பு: ** இந்த தரவுத்தொகுப்பை 2 டி பார்வையாளரில் காட்ட முடியாது. 3D வரைபட முறைகளில் ஒன்றிற்கு மாறவும்.

# models.scaleDatasetNotVisible.scaleZoomIn
source: Dataset is not available at this scale, zoom in to see it
ta: தரவுத்தொகுப்பு இந்த அளவில் கிடைக்கவில்லை, அதைப் பார்க்கப் பெரிதாக்கவும்

# models.scaleDatasetNotVisible.scaleZoomOut
source: Dataset is not available at this scale, zoom out to see it
ta: தரவுத்தொகுப்பு இந்த அளவில் கிடைக்கவில்லை, அதைப் பார்க்கப் சிறிதாக்கவும்

# models.tableStyling.hideAdvancedOptions
source: Hide advanced options
ta: மேம்பட்ட விருப்பங்களை மறைக்கவும்

# models.tableStyling.showAdvancedOptions
source: Show advanced options
ta: மேம்பட்ட விருப்பங்களைக் காட்டு

# models.tableStyling.copyUserStratum
source: Copy user stratum to clipboard
ta: பயனர் அடுக்கு இடைநிலைப்பலகைக்கு நகலெடுக்கவும்

# models.tableStyling.name
source: Style
ta: சூல் தண்டு

# models.tableStyling.reset
source: Reset to default style
ta: இயல்புநிலை பாணிக்கு மீட்டமைக்கவும்

# models.tableStyling.data.name
source: Data
ta: தகவல்கள்

# models.tableStyling.data.selectableDimensions.dataset.name
source: Dataset
ta: தரவுத்தொகுப்பு

# models.tableStyling.data.selectableDimensions.tableStyle.name
source: Style
ta: சூல் தண்டு

# models.tableStyling.data.selectableDimensions.tableStyleType.name
source: Symbology
ta: சிம்பாலசி

# models.tableStyling.data.selectableDimensions.tableStyleType.options.fill.name
source: Fill color
ta: நிறத்தை நிரப்பவும்

source: Point size
ta: புள்ளி அளவு

# models.tableStyling.data.selectableDimensions.tableStyleType.options.point.name
source: Point/Marker style
ta: புள்ளி/மார்க்கர் பாணி

source: Outline color
ta: அவுட்லைன் நிறம்

# models.tableStyling.data.selectableDimensions.tableStyleType.options.label.name
source: Label style
ta: சிட்டை நடை

# models.tableStyling.data.selectableDimensions.tableStyleType.options.trail.name
source: Trail style
ta: டிரெயில் பாணி

# models.tableStyling.fill.name
source: Fill Color
ta: நிறத்தை நிரப்பவும்

# models.tableStyling.fill.selectableDimensions.tableColorColumn.name
source: Variable
ta: மாறக்கூடிய

# models.tableStyling.fill.selectableDimensions.dataType.name
source: Column type (advanced)
ta: நெடுவரிசை வகை (மேம்பட்டது)

# models.tableStyling.fill.selectableDimensions.type.name
source: Type
ta: வகை

# models.tableStyling.fill.selectableDimensions.type.undefinedLabel
source: Please specify
ta: தயவுசெய்து குறிப்பிடவும்

# models.tableStyling.fill.selectableDimensions.type.options.noStyle.name
source: No style
ta: பாணி இல்லை

source: Sequential (continuous)
ta: தொடர்ச்சியான (தொடர்ச்சியான)

source: Sequential (discrete)
ta: தொடர்ச்சியான (தனித்துவமான)

source: Divergent (continuous)
ta: வேறுபட்ட (தொடர்ச்சியான)

source: Divergent (discrete)
ta: வேறுபட்ட (தனித்துவமான)

# models.tableStyling.fill.selectableDimensions.type.options.qualitative.name
source: Qualitative
ta: தரமான

source: Custom (qualitative)
ta: தனிப்பயன் (தரமான)

# models.tableStyling.fill.selectableDimensions.type.options.customDiscrete.name
source: Custom (discrete)
ta: தனிப்பயன் (தனித்துவமான)

# models.tableStyling.fill.selectableDimensions.scheme.name
source: Scheme
ta: திட்டம்

# models.tableStyling.fill.selectableDimensions.numberOfBins.name
source: Number of Bins
ta: தொட்டிகளின் எண்ணிக்கை

# models.tableStyling.min.name
source: Min
ta: மணித்துளி

# models.tableStyling.displayRange.name
source: Display range
ta: காட்சி வரம்பு
