Repository: 247i/TACETr
Catalog: உரை/வெறுமை/terriajs-terriajsnext-*.po
Languages: ta

# countDatasets.subTotals
source: <div> {{name}}: {{items}} items / {{groups}} groups</div>
ta: <div> {{name}}: {{items}} உருப்படிகள் / {{groups}} குழுக்கள் </div>

# countDatasets.recount
source: Recount
ta: மறுபரிசீலனை செய்யுங்கள்

# countDatasets.title
source: Count Datasets
ta: தரவுத்தொகுப்புகளை எண்ணுங்கள்

# countDatasets.btnCount
source: Count datasets
ta: தரவுத்தொகுப்புகளை எண்ணுங்கள்

# countDatasets.noMapDataEnabled
source: No map data enabled
ta: வரைபட தரவு எதுவும் இயக்கப்படவில்லை

# countDatasets.mapDataState
source: {{count}} dataset enabled on map
ta: {{count}} தரவுத்தொகுப்பு வரைபடத்தில் இயக்கப்பட்டது

# toolsPanel.btnText
source: Tool
ta: கருவி

# toolsPanel.btnTitle
source: Advanced toolbox
ta: மேம்பட்ட கருவிப்பெட்டி

# settingPanel.viewerModeLabels.CesiumTerrain
source: 3D Terrain
ta: 3 டி நிலப்பரப்பு

# settingPanel.viewerModeLabels.CesiumEllipsoid
source: 3D Smooth
ta: 3D மென்மையான

# settingPanel.viewerModeLabels.Leaflet
source: 2D
ta: மே

# settingPanel.qualityLabels.maximumPerformance
source: Maximum performance, lower quality
ta: அதிகபட்ச செயல்திறன், குறைந்த தகுதி

# settingPanel.qualityLabels.balancedPerformance
source: Balanced performance & quality
ta: சீரான செயல்திறன் மற்றும் தகுதி

# settingPanel.qualityLabels.lowerPerformance
source: Maximum quality, lower performance
ta: அதிகபட்ச தகுதி, குறைந்த செயல்திறன்

# settingPanel.nativeResolutionLabel
source: Press to stop using {{resolution1}} resolution and start using {{resolution2}} resolution
ta: {{resolution1}} தெளிவுத்திறனைப் பயன்படுத்துவதை நிறுத்தி {{resolution2}} தீர்மானத்தைப் பயன்படுத்தத் தொடங்குங்கள்

# settingPanel.native
source: native
ta: பழமை

# settingPanel.screen
source: screen
ta: திரை

# settingPanel.btnTitle
source: Change view
ta: பார்வையை மாற்றவும்

# settingPanel.btnText
source: Map Settings
ta: வரைபட அமைப்புகள்

# settingPanel.mapView
source: Map View
ta: வரைபடக் காட்சி

# settingPanel.baseMap
source: Base Map
ta: அடிப்படை வரைபடம்

# settingPanel.imageOptimisation
source: Image Optimisation
ta: பட தேர்வுமுறை

# settingPanel.nativeResolutionHeader
source: Use native device resolution
ta: சொந்த சாதனத் தீர்மானத்தைப் பயன்படுத்தவும்

# settingPanel.mapQuality
source: Map Quality:
ta: வரைபட தரம்:

# settingPanel.qualityLabel
source: Quality
ta: தகுதி

# settingPanel.performanceLabel
source: Performance
ta: செயல்திறன்

# settingPanel.timeline.title
source: Timeline
ta: காலவரிசை

# settingPanel.timeline.alwaysShowLabel
source: Press to start only showing the timeline when there are time-varying datasets on the workbench
ta: பணிப்பெண்ணில் நேரம் மாறுபடும் தரவுத்தொகுப்புகள் இருக்கும்போது மட்டுமே காலவரிசையைக் காட்டத் தொடங்க அழுத்தவும்

# settingPanel.timeline.hideLabel
source: Press to start always showing the timeline, even when no time-varying datasets are on the workbench
ta: நேரம் மாறுபடும் தரவுத்தொகுப்புகள் பணியிடத்தில் இல்லாதபோதும், காலவரிசையை எப்போதும் காண்பிக்கத் தொடங்க அழுத்தவும்

# settingPanel.timeline.alwaysShow
source: Always show
ta: எப்போதும் காட்டு

# settingPanel.terrain.hideUnderground
source: Terrain hides underground features
ta: நிலப்பரப்பு நிலத்தடி அம்சங்களை மறைக்கிறது

# settingPanel.terrain.showUndergroundFeatures
source: Press to start showing features that are underneath the terrain surface
ta: நிலப்பரப்பு மேற்பரப்புக்கு அடியில் உள்ள அம்சங்களைக் காட்டத் தொடங்க அழுத்தவும்

# settingPanel.terrain.hideUndergroundFeatures
source: Press to start hiding features that are underneath the terrain surface
ta: நிலப்பரப்பு மேற்பரப்புக்கு அடியில் இருக்கும் அம்சங்களை மறைக்கத் தொடங்க அழுத்தவும்

# settingPanel.terrain.sideLabel
source: Show Terrain on the
ta: நிலப்பரப்பைக் காட்டு

# settingPanel.terrain.left
source: Left
ta: இடது

# settingPanel.terrain.both
source: Both
ta: இரண்டும்

# settingPanel.terrain.right
source: Right
ta: வலது

# feedback.feedbackPreamble
source: We would love to hear from you!
ta: உங்களிடமிருந்து கேட்க நாங்கள் விரும்புகிறோம்!

# feedback.title
source: Feedback
ta: கருத்து

# feedback.close
source: close feedback
ta: பின்னூட்டத்தை மூடு

# feedback.yourName
source: Your name (optional)
ta: உங்கள் பெயர் (விரும்பினால்)

# feedback.email
source: Email address (optional)<br/><em>We can't follow up without it!</em>
ta: மின்னஞ்சல் முகவரி (விரும்பினால்) <br/> <em> இது இல்லாமல் எங்களால் பின்தொடர முடியாது! </em>

# feedback.commentQuestion
source: Comment or question
ta: கருத்து அல்லது கேள்வி

# feedback.shareWithDevelopers
source: Share my map view with {{appName}} developers
ta: எனது வரைபடக் காட்சியை {{appName}} டெவலப்பர்களுடன் பகிரவும்

# feedback.cancel
source: Cancel
ta: ரத்துசெய்

# feedback.sending
source: Sending...
ta: அனுப்புகிறது ...

# feedback.send
source: Send
ta: அனுப்பு

# feedback.feedbackBtnText
source: Give Feedback
ta: கருத்து தெரிவிக்கவும்

# feedback.minLength
source: Minimum length of feedback comment is {{minLength}}
ta: பின்னூட்டக் கருத்தின் குறைந்தபட்ச நீளம் {{minLength}}

# helpPanel.btnText
source: Help
ta: உதவி

# helpPanel.menuPaneTitle
source: We're here to help
ta: உதவ நாங்கள் இங்கு வந்துள்ளோம்

# helpPanel.menuPaneBody
source: Find useful tips on how to use TerriaJS by either checking the guides below or by contacting the team at [{{supportEmail}}]({{supportEmail}})
ta: கீழே உள்ள வழிகாட்டிகளைச் சரிபார்ப்பதன் மூலம் அல்லது [{{supportEmail}}] ({{supportEmail}}) இல் குழுவைத் தொடர்புகொள்வதன் மூலம் டெர்ரியாச்சை எவ்வாறு பயன்படுத்துவது என்பதற்கான பயனுள்ள உதவிக்குறிப்புகளைக் கண்டறியவும்

# helpPanel.promptMessage
source: Find the Tour, how-to videos & other help content here
ta: சுற்றுப்பயணம், எப்படி-வீடியோக்கள் மற்றும் பிற உதவி உள்ளடக்கத்தை இங்கே காணலாம்

# helpPanel.dismissText
source: Got it, thanks!
ta: கிடைத்தது, நன்றி!

# helpPanel.takeTour
source: Take the tour
ta: சுற்றுப்பயணம் மேற்கொள்ளுங்கள்

# helpPanel.mapUserGuide
source: Map user guide
ta: வரைபட பயனர் வழிகாட்டி

# sui.notifications.title
source: This map contains a story
ta: இந்த வரைபடத்தில் ஒரு கதை உள்ளது

# sui.notifications.message
source: Would you like to view it now?
ta: இப்போது அதைப் பார்க்க விரும்புகிறீர்களா?

# sui.notifications.confirmText
source: Yes
ta: ஆம்

# sui.notifications.denyText
source: Maybe later
ta: ஒருவேளை பின்னர்

# sui.showWorkbench
source: Explore Datasets [{{count}}]
ta: தரவுத்தொகுப்புகளை ஆராயுங்கள் [{{count}}]

# sui.hideWorkbench
source: Hide Workbench
ta: வொர்க் பெஞ்சை மறைக்கவும்

# featureInfo.catalogItem.moreThanMax
source: More than {{maximum}} {{catalogItemName}} features were found.
ta: {{maximum}} {{catalogItemName}} நற்பொருத்தங்கள் காணப்பட்டன.

# featureInfo.catalogItem.featuresFound
source: {{featCount}} {{catalogItemName}} features were found.
ta: {{featCount}} {{catalogItemName}} நற்பொருத்தங்கள் காணப்பட்டன.

# featureInfo.catalogItem.featureInfoShown
source: The first {{maximum}} are shown below.
ta: முதல் {{maximum}} கீழே காட்டப்பட்டுள்ளது.

# featureInfo.download
source: Download this Table
ta: இந்த அட்டவணையைப் பதிவிறக்கவும்

# featureInfo.pickLocation
source: Pick Location
ta: இருப்பிடத்தைத் தேர்ந்தெடுங்கள்

# featureInfo.clickMap
source: Click on the map to learn more about a location
ta: இருப்பிடத்தைப் பற்றி மேலும் அறிய வரைபடத்தில் சொடுக்கு செய்க

# featureInfo.noDataAvailable
source: No data is available here - try another location.
ta: இங்கே தரவு எதுவும் கிடைக்கவில்லை - மற்றொரு இடத்தை முயற்சிக்கவும்.

# featureInfo.clickToAddData
source: Click '$t(addData.addDataBtnText)' to add data to the map.
ta: வரைபடத்தில் தரவைச் சேர்க்க '$t(addData.addDataBtnText)' என்பதைக் சொடுக்கு செய்க.

# featureInfo.userSelection
source: User Selection
ta: பயனர் தேர்வு

# featureInfo.panelHeading
source: Feature Information
ta: அம்சத் செய்தி

# featureInfo.btnCloseFeature
source: Close data panel
ta: தரவு குழு மூடு

# featureInfo.satelliteSuggestionBtn
source: Show {{catalogItemName}} at this location
ta: இந்த இடத்தில் {{catalogItemName}} ஐக் காட்டு

# featureInfo.locationMarker
source: Location Marker
ta: இருப்பிட மார்க்கர்

# featureInfo.noInfoAvailable
source: No information available
ta: எந்த தகவலும் கிடைக்கவில்லை

# featureInfo.siteData
source: Site Data
ta: தள தரவு

# featureInfo.latLon
source: Lat / Lon
ta: ஆண்டுகள் / லோன்

# featureInfo.showRawData
source: Show Raw Data
ta: மூல தரவைக் காட்டு

# featureInfo.showCuratedData
source: Show Curated Data
ta: க்யூரேட்டட் தரவைக் காட்டு

# welcomeMessage.title
source: Let's get you started
ta: நீங்கள் தொடங்குவோம்

# welcomeMessage.welcomeMessage
source: Interested in data discovery and exploration?<br/>Dive right in and get started or check the following help guide options.
ta: தரவு கண்டுபிடிப்பு மற்றும் ஆய்வில் ஆர்வமா? <br/> சரியாக டைவ் செய்து தொடங்கவும் அல்லது பின்வரும் உதவி வழிகாட்டி விருப்பங்களை சரிபார்க்கவும்.

# welcomeMessage.welcomeMessageOnMobile
source: Interested in data discovery and exploration?
ta: தரவு கண்டுபிடிப்பு மற்றும் ஆய்வில் ஆர்வமா?

# welcomeMessage.tourBtnText
source: Take the tour
ta: சுற்றுப்பயணம் மேற்கொள்ளுங்கள்

# welcomeMessage.helpBtnText
source: I'll need some help
ta: எனக்கு சில உதவி தேவை

# welcomeMessage.exploreDataBtnText
source: Explore map data
ta: வரைபட தரவை ஆராயுங்கள்

# welcomeMessage.searchBtnText
source: Search for a location
ta: இருப்பிடத்தைத் தேடுங்கள்

# welcomeMessage.dismissText
source: Close message and don't show me this again
ta: செய்தியை மூடு, இதை மீண்டும் எனக்குக் காட்ட வேண்டாம்

# story.panelTitle
source: Story editor
ta: கதை ஆசிரியர்

# story.panelBody
source: Create and share interactive stories directly from your map.
ta: உங்கள் வரைபடத்திலிருந்து நேரடியாக ஊடாடும் கதைகளை உருவாக்கி பகிரவும்.

# story.panelBodyCapped
source: Each story is capped at {{ shareMaxRequestSize }} - split large data or many scenes into multiple stories to stay under the limit.
ta: ஒவ்வொரு கதையும் {{ shareMaxRequestSize }} - பெரிய தரவு அல்லது பல காட்சிகளை பல கதைகளாக பிரித்து வரம்பில் இருக்க வேண்டும்.

# story.gettingStarted
source: Getting started
ta: தொடங்குதல்

# story.gettingStartedTitle
source: Getting started
ta: தொடங்குதல்

# story.badgeBarLabel
source: Scenes
ta: காட்சிகள்

# story.share
source: Share
ta: பங்கு

# story.viewStory
source: view
ta: பார்வை

# story.view
source: View
ta: பார்வை

# story.editStory
source: edit
ta: தொகு

# story.edit
source: Edit
ta: தொகு

# story.expand
source: Expand
ta: விரிவாக்கு

# story.collapse
source: Collapse
ta: சரிவு

# story.recaptureStory
source: re-capture
ta: மறு பிடிப்பு

# story.recapture
source: Recapture
ta: மீண்டும் கைப்பற்றுதல்

# story.deleteStory
source: delete
ta: நீக்கு

# story.delete
source: Delete
ta: நீக்கு

# story.untitledScene
source: untitled scene
ta: பெயரிடப்படாத காட்சி

source: Story does not exist
ta: கதை இல்லை

# story.removeAllStories
source: Remove All
ta: அனைத்தையும் அகற்று

# story.removeAllStoriesDialog
source: Are you sure you wish to delete {{ count }} scene?
ta: {{ count }} காட்சியை நீக்க விரும்புகிறீர்களா?

# story.removeStoryDialog
source: Are you sure you wish to delete '<1>{{storyName}}</1>'?
ta: '<1> {{storyName}} </1>' ஐ நீக்க விரும்புகிறீர்களா?

# story.preview
source: preview stories
ta: கதைகள் முன்னோட்டம்

# story.play
source: Play
ta: விளையாடுங்கள்

# story.playStory
source: Story
ta: கதை

# story.captureSceneTitle
source: capture current scene
ta: தற்போதைய காட்சியைப் பிடிக்கவும்

# story.captureScene
source: Capture Scene
ta: காட்சியைப் பிடிக்கவும்

# story.editor.modalHeader
source: Story Editor - Scene capture
ta: கதை ஆசிரியர் - காட்சி பிடிப்பு

# story.editor.titleLabel
source: Title (required)
ta: தலைப்பு (தேவை)

# story.editor.descriptionLabel
source: Description
ta: விவரம்

# story.editor.placeholder
source: Enter a title here
ta: ஒரு தலைப்பை இங்கே உள்ளிடவும்

# story.editor.cancelBtn
source: cancel
ta: ரத்துசெய்

# story.editor.cancelEditing
source: Cancel
ta: ரத்துசெய்

# story.editor.saveBtn
source: save
ta: சேமி

# story.editor.saveStory
source: Save
ta: சேமி

# story.locationBtn
source: center scene
ta: மைய காட்சி

# story.exitBtn
source: exit story
ta: வெளியேறும் கதை

# story.previousBtn
source: go to previous scene
ta: முந்தைய காட்சிக்குச் செல்லுங்கள்

# story.prev
source: Prev
ta: முந்தைய

# story.untitled
source: untitled scene
ta: பெயரிடப்படாத காட்சி

# story.navBtn
source: go to story {{title}}
ta: கதைக்குச் செல்லுங்கள் {{title}}

# story.nextBtn
source: go to next scene
ta: அடுத்த காட்சிக்குச் செல்லுங்கள்

# story.next
source: Next
ta: அடுத்தது

# story.restart
source: Restart
ta: மறுதொடக்கம்

# story.navBtnMobile
source: go to story {{title}}
ta: கதைக்குச் செல்லுங்கள் {{title}}

# story.promptHtml1
source: <0>You can view and create stories at any time by clicking here.</0>
ta: <0> இங்கே சொடுக்கு செய்வதன் மூலம் எந்த நேரத்திலும் நீங்கள் கதைகளைக் காணலாம் மற்றும் உருவாக்கலாம். </0>

# story.promptHtml2
source: <0><0>INTRODUCING</0><1>Data Stories</1><2>Create and share interactive stories directly from your map.</2></0>
ta: <0><0>அறிமுகப்படுத்துதல்</0><1>தரவுக் கதைகள்</1><2>உங்கள் வரைபடத்திலிருந்து நேரடியாக ஊடாடும் கதைகளை உருவாக்கிப் பகிரவும்.</2> </0>

# story.story
source: Story
ta: கதை

# story.dismissText
source: Got it, thanks!
ta: கிடைத்தது, நன்றி!

# story.mobileViewStory
source: View Stories {{storiesLength}}
ta: கதைகளைக் காண்க {{storiesLength}}}

# story.storyEditor
source: Story Editor
ta: கதை ஆசிரியர்

# story.storiesTooLong
source: This story exceeds the maximum size allowed. Try reducing the number of visible datasets, or capture fewer scenes.
ta: இந்த கதை அனுமதிக்கப்பட்ட அதிகபட்ச அளவை விட அதிகமாக உள்ளது. புலப்படும் தரவுத்தொகுப்புகளின் எண்ணிக்கையைக் குறைக்க முயற்சிக்கவும் அல்லது குறைவான காட்சிகளைப் பிடிக்கவும்.

# story.hideStoryPanel
source: hide story builder
ta: கதை பில்டரை மறைக்கவும்

# story.loadSceneErrorTitle
source: Error loading Story Scene
ta: கதை காட்சியை ஏற்றுவதில் பிழை

# story.loadSceneErrorMessage
source: An error occurred while loading data for story scene: `{{title}}`.
ta: கதை காட்சிக்கான தரவை ஏற்றும்போது பிழை ஏற்பட்டது: `{{title}}`.

# satelliteGuidance.menuTitle
source: You can access map guides at any time by looking in the <2>help menu</2>.
ta: <2> உதவி பட்டியல் </2> ஐப் பார்த்து எந்த நேரத்திலும் வரைபட வழிகாட்டிகளை அணுகலாம்.

# satelliteGuidance.dismissText
source: Got it, thanks!
ta: கிடைத்தது, நன்றி!

# satelliteGuidance.titleI
source: Satellite Imagery: How do I…?
ta: செயற்கைக்கோள் படங்கள்: நான் எப்படி…?

# satelliteGuidance.bodyI
source: A super-quick guide to getting the most out of historical satellite imagery.
ta: வரலாற்று செயற்கைக்கோள் படங்களை அதிகம் பெறுவதற்கான ஒரு சூப்பர்-விரைவான வழிகாட்டி.

# satelliteGuidance.prevI
source: No thanks
ta: நன்றி இல்லை

# satelliteGuidance.nextI
source: View guide
ta: வழிகாட்டியைக் காண்க

# satelliteGuidance.titleII
source: Where is my satellite imagery?
ta: எனது செயற்கைக்கோள் படங்கள் எங்கே?

# satelliteGuidance.bodyII
source: You may need to adjust your zoom level to make satellite imagery visible on the map.
ta: வரைபடத்தில் செயற்கைக்கோள் படங்களைக் காண உங்கள் சூம் அளவை சரிசெய்ய வேண்டியிருக்கும்.

# satelliteGuidance.titleIII
source: Loading historical imagery
ta: வரலாற்று படங்களை ஏற்றுகிறது

# satelliteGuidance.bodyIII
source: In your data workbench, click on the capture date dropdown and select from available times to load historical imagery.
ta: உங்கள் தரவு வொர்க் பெஞ்சில், பிடிப்பு தேதி கீழ்தோன்றலைக் சொடுக்கு செய்து, வரலாற்று படங்களை ஏற்ற கிடைக்கக்கூடிய நேரங்களிலிருந்து தேர்ந்தெடுக்கவும்.

# satelliteGuidance.titleIV
source: Filtering imagery by location
ta: இருப்பிடத்தின் மூலம் படங்களை வடிகட்டுதல்

# satelliteGuidance.bodyIV
source: Satellite imagery may not always be available at your preferred time and location. If you only want to view imagery for a particular location, click ‘filter by location’ in your data workbench.
ta: நீங்கள் விரும்பும் நேரம் மற்றும் இருப்பிடத்தில் செயற்கைக்கோள் படங்கள் எப்போதும் கிடைக்காது. ஒரு குறிப்பிட்ட இருப்பிடத்திற்கான படங்களை மட்டுமே நீங்கள் காண விரும்பினால், உங்கள் தரவு பணிப்பெண்ணில் ‘இருப்பிடத்தால் வடிகட்டவும்’ என்பதைக் சொடுக்கு செய்க.

# satelliteGuidance.titleV
source: How do I view false-colour imagery?
ta: தவறான வண்ண உருவங்களை நான் எவ்வாறு பார்ப்பது?

# satelliteGuidance.bodyV
source: You can apply a range of styles, such as false-colour, to satellite imagery by clicking on the styles dropdown in your data workbench.
ta: உங்கள் தரவு பணிப்பெண்ணில் பாணிகள் கீழ்தோன்றலைக் சொடுக்கு செய்வதன் மூலம் செயற்கைக்கோள் படங்களுக்கு தவறான வண்ணங்கள் போன்ற பல பாணிகளைப் பயன்படுத்தலாம்.

# addData.addDataBtnText
source: Explore data
ta: தரவை ஆராயுங்கள்

# addData.btnHide
source: Hide
ta: மறை

# addData.load
source: Load local/web data
ta: உள்ளூர்/வலை தரவை ஏற்றவும்

# addData.closeDataPanel
source: Close data panel
ta: தரவு குழு மூடு

# addData.done
source: Done
ta: முடிந்தது

# addData.data
source: Data
ta: தகவல்கள்

# addData.myData
source: My Data
ta: எனது தரவு

# addData.modalTitle
source: Explore Data
ta: தரவை ஆராயுங்கள்

# addData.dataCatalogue
source: Data Catalogue
ta: தரவு பட்டியல்

# addData.searchPlaceholderWhole
source: Search whole catalogue
ta: முழு பட்டியலையும் தேடுங்கள்

# addData.searchPlaceholder
source: Search the catalogue
ta: பட்டியலைத் தேடுங்கள்

# addData.localAdd
source: Add local file
ta: உள்ளக கோப்பைச் சேர்க்கவும்

# addData.localFileType
source: <0>Step 1:</0> Select file type
ta: <0> படி 1: </0> கோப்பு வகையைத் தேர்ந்தெடுக்கவும்

# addData.localFile
source: <0>Step 2:</0> Select file
ta: <0> படி 2: </0> கோப்பைத் தேர்ந்தெடுக்கவும்

# addData.webAdd
source: Add web data
ta: வலைத் தரவைச் சேர்க்கவும்

# addData.webFileType
source: <0>Step 1:</0> Select file or web service type
ta: <0> படி 1: </0> கோப்பு அல்லது வலை பணி வகையைத் தேர்ந்தெடுக்கவும்

# addData.webFile
source: <0>Step 2:</0> Enter the URL of the data file or web service
ta: <0> படி 2: </0> தரவுக் கோப்பு அல்லது வலை சேவையின் முகவரி ஐ உள்ளிடவும்

# addData.urlInputBtn
source: Add
ta: கூட்டு

# addData.browse
source: Browse...
ta: உலாவுக ...

# addData.localTitle
source: Add Local Data
ta: உள்ளக தரவைச் சேர்க்கவும்

# addData.webTitle
source: Add Web Data
ta: வலைத் தரவைச் சேர்க்கவும்

# addData.dragDrop
source: Drag and Drop
ta: இழுத்து விடுங்கள்

# addData.infoText
source: <0>Drag and drop a file here to view it locally on the map</0><1>(it won’t be saved or uploaded to the internet)</1>
ta: <0> ஒரு கோப்பை வரைபடத்தில் உள்நாட்டில் காண இங்கே இழுத்து விடுங்கள் </0> <1> (இது சேமிக்கப்படாது அல்லது இணையத்தில் பதிவேற்றப்படாது) </1>

# addData.back
source: Back
ta: பின்

# addData.note
source: <0>Note: </0>Data added in this way is not saved or made visible to others.
ta: <0> குறிப்பு: </0> இந்த வழியில் சேர்க்கப்பட்ட தரவு சேமிக்கப்படவில்லை அல்லது மற்றவர்களுக்கு தெரியவரும்.

# search.resultsLabel
source: Search Results
ta: தேடல் முடிவுகள்

# search.done
source: Done
ta: முடிந்தது

# search.data
source: Data
ta: தகவல்கள்

# search.searchInDataCatalog
source: Search '{{locationSearchText}}' in the Data Catalogue
ta: தரவு பட்டியலில் '{{locationSearchText}}' ஐத் தேடுங்கள்

# search.search
source: Search '{{searchText}}' in the Data Catalogue
ta: தரவு பட்டியலில் '{{searchText}}' ஐத் தேடுங்கள்

# search.viewLess
source: View less {{name}} results
ta: குறைவாக {{name}} முடிவுகளைக் காண்க

# search.viewMore
source: View more {{name}} results
ta: மேலும் காண்க {{name}} முடிவுகள்

# search.placeholder
source: Search for locations
ta: இருப்பிடங்களைத் தேடுங்கள்

# search.searchCatalogue
source: Search the catalogue
ta: பட்டியலைத் தேடுங்கள்

# mobile.toggleNavigation
source: toggle navigation
ta: வழிசெலுத்தலை மாற்றவும்

# mobile.addDataBtnText
source: Data
ta: தகவல்கள்

# mobile.doneBtnText
source: Done
ta: முடிந்தது

# preview.doesNotContainGeospatialData
source: This file does not contain geospatial data.
ta: இந்த கோப்பில் புவியியல் தரவு இல்லை.

# preview.selectToPreviewDataset
source: Select a dataset to see a preview
ta: முன்னோட்டத்தைக் காண தரவுத்தொகுப்பைத் தேர்ந்தெடுக்கவும்

# preview.selectMultipleDatasets
source: <0>Press <strong>Shift</strong> and click</0><1 /><2>to add multiple datasets</2>
ta: <0> <strong> சிப்ட் </strong> ஐ அழுத்தவும், பல தரவுத்தொகுப்புகளைச் சேர்க்க </0> <1/> <2> ஐக் சொடுக்கு செய்க </2>

# preview.selectToPreviewSeparator
source: OR
ta: அல்லது

# preview.goToTheMap
source: Go to the map
ta: வரைபடத்திற்குச் செல்லுங்கள்

source: PREVIEW LOADING...
ta: முன்னோட்டம் ஏற்றுதல் ...

# preview.preview
source: {{appName}} preview
ta: {{appName}} முன்னோட்டம்

# preview.previewItemErrorTitle
source: Catalog item could not be previewed.
ta: அட்டவணை உருப்படியை முன்னோட்டமிட முடியவில்லை.

# preview.previewItemErrorMessage
source: An error occurred while loading the catalog item.
ta: பட்டியல் உருப்படியை ஏற்றும்போது பிழை ஏற்பட்டது.

# preview.noPreviewAvailable
source: NO PREVIEW AVAILABLE
ta: முன்னோட்டம் எதுவும் கிடைக்கவில்லை

# preview.dataPreviewLoading
source: DATA PREVIEW LOADING...
ta: தரவு முன்னோட்டம் ஏற்றுதல் ...

# preview.dataPreview
source: DATA PREVIEW
ta: தரவு முன்னோட்டம்

# preview.dataPreviewError
source: DATA PREVIEW ERROR
ta: தரவு முன்னோட்ட பிழை

# preview.removeFromMap
source: Remove from the map
ta: வரைபடத்திலிருந்து அகற்று

# preview.addToMap
source: Add to the map
ta: வரைபடத்தில் சேர்க்கவும்

# preview.disclaimer
source: Disclaimer
ta: மறுப்பு

# preview.dataDescription
source: Data Description
ta: தரவு விளக்கம்

# preview.datasetDescription
source: Dataset Description
ta: தரவுத்தொகுப்பு விளக்கம்

# preview.serviceDescription
source: Service Description
ta: பணி விளக்கம்

# preview.resourceDescription
source: Resource Description
ta: வள விளக்கம்

# preview.licence
source: Licence
ta: உரிமம்

# preview.accessConstraints
source: Access Constraints
ta: அணுகல் கட்டுப்பாடுகள்

# preview.fees
source: Fees
ta: கட்டணம்

# preview.author
source: Author
ta: நூலாசிரியர்

# preview.contact
source: Contact
ta: தொடர்பு

# preview.created
source: Created
ta: உருவாக்கப்பட்டது

# preview.modified
source: Modified
ta: மாற்றியமைக்கப்பட்ட

# preview.updateFrequency
source: Update Frequency
ta: புதுப்பிப்பு அதிர்வெண்

# preview.dataCustodian
source: Data Custodian
ta: தரவு பாதுகாவலர்

# preview.mayBeExperiencingIssues
source: This dataset may currently be experiencing issues
ta: இந்த தரவுத்தொகுப்பு தற்போது சிக்கல்களை அனுபவிக்கக்கூடும்

# description.name
source: Description
ta: விவரம்

# description.dataLocal
source: This file only exists in your browser. To share it, you must load it onto a public web server.
ta: இந்த கோப்பு உங்கள் உலாவியில் மட்டுமே உள்ளது. அதைப் பகிர, நீங்கள் அதை ஒரு பொது வலை சேவையகத்தில் ஏற்ற வேண்டும்.

# description.dataNotLocal
source: Please contact the provider of this data for more information, including information about usage rights and constraints.
ta: பயன்பாட்டு உரிமைகள் மற்றும் கட்டுப்பாடுகள் பற்றிய தகவல்கள் உட்பட கூடுதல் தகவலுக்கு இந்தத் தரவை வழங்குநரைத் தொடர்பு கொள்ளவும்.

# description.wms
source: This is a <1>WMS service</1>, which generates map images on request. It can be used in GIS software with this URL:
ta: இது ஒரு <1> WMS பணி </1>, இது கோரிக்கையின் பேரில் MAP படங்களை உருவாக்குகிறது. இந்த முகவரி உடன் GIS மென்பொருளில் இதைப் பயன்படுத்தலாம்:

# description.wfs
source: This is a <1>WFS service</1>, which transfers raw spatial data on request. It can be used in GIS software with this URL:
ta: இது ஒரு <1> WFS பணி </1> ஆகும், இது கோரிக்கையின் பேரில் மூல இடஞ்சார்ந்த தரவை மாற்றுகிறது. இந்த முகவரி உடன் GIS மென்பொருளில் இதைப் பயன்படுத்தலாம்:

# description.layerName
source: Layer name
ta: அடுக்கு பெயர்

# description.typeName
source: Type name
ta: பெயரைத் தட்டச்சு செய்க

# description.metadataUrls
source: Metadata Links
ta: மேனிலை தரவு இணைப்புகள்

# description.dataUrl
source: Data Links
ta: தரவு இணைப்புகள்

# description.useLinkBelow
source: Use the link below to download the data. See the {{link}} for more information on customising URL query parameters.
ta: தரவைப் பதிவிறக்க கீழே உள்ள இணைப்பைப் பயன்படுத்தவும். முகவரி வினவல் அளவுருக்களைத் தனிப்பயனாக்குவது பற்றிய கூடுதல் தகவலுக்கு {{link}} ஐப் பார்க்கவும்.
