Repository: 247i/TACETr
Catalog: உரை/வெறுமை/terriajs-terriajsnext-*.po
Languages: ta

# models.tableStyling.displayRange.selectableDimensions.max.name
source: Max
ta: அதிகபட்சம்

# models.tableStyling.bins.name
source: Bins
ta: பின்கள்

# models.tableStyling.bins.selectableDimensions.start.name
source: {{value1}} to {{value2}}
ta: {{value1}} முதல் {{value2}}

source: Color
ta: நிறம்

source: Start
ta: தொடங்கு

source: Stop
ta: நிறுத்து

# models.tableStyling.colors.name
source: Colors
ta: நிறங்கள்

# models.tableStyling.colors.selectableDimensions.color.name
source: Color
ta: நிறம்

# models.tableStyling.colors.selectableDimensions.value.name
source: Value
ta: மதிப்பு

# models.tableStyling.colors.selectableDimensions.remove.value
source: Remove
ta: அகற்று

# models.tableStyling.colors.selectableDimensions.add.value
source: Add Color
ta: வண்ணத்தைச் சேர்க்கவும்

# models.tableStyling.nullColor.name
source: Default color
ta: இயல்புநிலை நிறம்

# models.tableStyling.outlierColor.name
source: Outlier color
ta: வெளிநாட்டு நிறம்

# models.tableStyling.additionalColors.name
source: Additional colors
ta: கூடுதல் வண்ணங்கள்

# models.tableStyling.additionalColors.selectableDimensions.regionColor.name
source: Region color
ta: பகுதி நிறம்

# models.tableStyling.additionalColors.selectableDimensions.nullColor.name
source: Default color
ta: இயல்புநிலை நிறம்

# models.tableStyling.additionalColors.selectableDimensions.outlierColor.name
source: Outlier color
ta: வெளிநாட்டு நிறம்

# models.tableStyling.pointSize.name
source: Point size
ta: புள்ளி அளவு

# models.tableStyling.pointSize.selectableDimensions.pointSizeColumn.name
source: Variable
ta: மாறக்கூடிய

# models.tableStyling.pointSize.selectableDimensions.pointSizeNull.name
source: Default size
ta: இயல்புநிலை அளவு

# models.tableStyling.pointSize.selectableDimensions.pointSizesFactor.name
source: Size factor
ta: அளவு காரணி

# models.tableStyling.pointSize.selectableDimensions.pointSizeOffset.name
source: Size offset
ta: அளவு ஆஃப்செட்

# models.tableStyling.regionMapping.name
source: Region mapping
ta: பகுதி மேப்பிங்

# models.tableStyling.legend.name
source: Legend
ta: புராணக்கதை

# models.tableStyling.legend.selectableDimensions.legendTitle.name
source: Title
ta: தலைப்பு

# models.tableStyling.legend.selectableDimensions.legendTicks.name
source: Ticks
ta: உண்ணி

# models.tableStyling.legend.selectableDimensions.title.name
source: Item {{index}} Title
ta: உருப்படி {{index}} தலைப்பு

# models.tableStyling.styleOptions.name
source: Style options
ta: பாணி விருப்பங்கள்

# models.tableStyling.styleOptions.selectableDimensions.styleTitle.name
source: Title
ta: தலைப்பு

# models.tableStyling.styleOptions.selectableDimensions.longitudeColumn.name
source: Longitude column
ta: தீர்க்கரேகை நெடுவரிசை

# models.tableStyling.styleOptions.selectableDimensions.latitudeColumn.name
source: Latitude column
ta: அட்சரேகை நெடுவரிசை

# models.tableStyling.timeOptions.name
source: Time options
ta: நேர விருப்பங்கள்

# models.tableStyling.timeOptions.selectableDimensions.tableTimeColumn.name
source: Time column
ta: நேர நெடுவரிசை

# models.tableStyling.timeOptions.selectableDimensions.tableEndTimeColumn.name
source: End time column
ta: இறுதி நேர நெடுவரிசை

# models.tableStyling.timeOptions.selectableDimensions.tableTimeIdColumns.name
source: ID columns
ta: ஐடி நெடுவரிசைகள்

# models.tableStyling.timeOptions.selectableDimensions.tableTimeIsSampled.name
source: Is Sampled
ta: மாதிரி

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Display Duration
ta: காட்சி காலம்

source: Spread start time
ta: தொடக்க நேரம் பரப்பவும்

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Spread finish time
ta: பூச்சு நேரத்தை பரப்பவும்

source: Yes
ta: ஆம்

source: No
ta: இல்லை

# models.tableStyling.workbenchOptions.name
source: Workbench options
ta: பணிப்பெண் விருப்பங்கள்

# models.tableStyling.workbenchOptions.selectableDimensions.tableStyleEnalbed.name
source: Show style in Workbench
ta: வொர்க் பெஞ்சில் பாணியைக் காட்டு

source: Style showing
ta: பாணி காண்பிக்க

source: Style hidden
ta: பாணி மறைக்கப்பட்டுள்ளது

source: Show disable style option
ta: முடக்க பாணி விருப்பத்தைக் காட்டு

source: Show disable time option
ta: நேர விருப்பத்தை முடக்கவும்

source: Enable manual region mapping
ta: கையேடு பிராந்திய மேப்பிங்கை இயக்கவும்

# models.tableStyling.variableAndColumn.name
source: Variable/column
ta: மாறி/நெடுவரிசை

# models.tableStyling.variableAndColumn.selectableDimensions.columnTitle.name
source: Title
ta: தலைப்பு

# models.tableStyling.variableAndColumn.selectableDimensions.columnUnits.name
source: Units
ta: அலகுகள்

# models.tableStyling.style.selectableDimensions.column.name
source: Variable
ta: மாறக்கூடிய

# models.tableStyling.style.selectableDimensions.styleType.name
source: Type
ta: வகை

# models.tableStyling.style.selectableDimensions.styleType.undefinedLabel
source: Please specify
ta: தயவுசெய்து குறிப்பிடவும்

# models.tableStyling.style.selectableDimensions.styleType.constant.name
source: No style
ta: பாணி இல்லை

# models.tableStyling.style.selectableDimensions.styleType.bin.name
source: Discrete
ta: தனித்துவமான

# models.tableStyling.style.selectableDimensions.styleType.enum.name
source: Qualitative
ta: தரமான

# models.tableStyling.style.selectableDimensions.enum.name
source: Enum styles
ta: Enum பாணிகள்

source: No value
ta: மதிப்பு இல்லை

source: Value
ta: மதிப்பு

source: Remove
ta: அகற்று

source: Add style for value
ta: மதிப்புக்கு பாணியைச் சேர்க்கவும்

# models.tableStyling.style.selectableDimensions.bin.name
source: Bin styles
ta: பின் பாணிகள்

source: Add style bin
ta: பாணி தொட்டியைச் சேர்க்கவும்

source: No value
ta: மதிப்பு இல்லை

source: {{value1}} to {{value2}}
ta: {{value1}} முதல் {{value2}}

source: Start
ta: தொடங்கு

source: Stop
ta: நிறுத்து

source: Remove
ta: அகற்று

# models.tableStyling.style.null.name
source: Default
ta: இயல்புநிலை

# models.tableStyling.point.name
source: Marker style
ta: மார்க்கர் பாணி

# models.tableStyling.point.selectableDimensions.marker.name
source: Marker
ta: மார்க்கர்

# models.tableStyling.point.selectableDimensions.marker.tooltip
source: Marker supports URL and base64 of any supported image format (eg PNG, SVG)
ta: எந்தவொரு உதவி பட வடிவமைப்பின் (எ.கா. பி.என்.சி, எச்.வி.சி) மார்க்கர் முகவரி மற்றும் BASE64 ஐ ஆதரிக்கிறது

# models.tableStyling.point.selectableDimensions.rotation.name
source: Rotation
ta: சுழற்சி

# models.tableStyling.point.selectableDimensions.height.name
source: Height
ta: உயரம்

# models.tableStyling.point.selectableDimensions.width.name
source: Width
ta: அகலம்

# models.tableStyling.outline.name
source: Outline style
ta: அவுட்லைன் பாணி

# models.tableStyling.outline.selectableDimensions.color.name
source: Color
ta: நிறம்

# models.tableStyling.outline.selectableDimensions.width.name
source: Width
ta: அகலம்

# models.tableStyling.label.name
source: Label style
ta: சிட்டை நடை

# models.tableStyling.label.selectableDimensions.column.name
source: Label column
ta: சிட்டை நெடுவரிசை

# models.tableStyling.label.selectableDimensions.font.name
source: Font
ta: எழுத்துரு

# models.tableStyling.label.selectableDimensions.style.name
source: Label style
ta: சிட்டை நடை

# models.tableStyling.label.selectableDimensions.style.options.fill.name
source: Fill only
ta: மட்டும் நிரப்பவும்

# models.tableStyling.label.selectableDimensions.style.options.outline.name
source: Outline only
ta: அவுட்லைன் மட்டும்

# models.tableStyling.label.selectableDimensions.style.options.fillAndOutline.name
source: Fill and outline
ta: நிரப்பு மற்றும் கோடிட்டு

# models.tableStyling.label.selectableDimensions.scale.name
source: Scale
ta: அளவு

# models.tableStyling.label.selectableDimensions.fillColor.name
source: Fill color
ta: நிறத்தை நிரப்பவும்

# models.tableStyling.label.selectableDimensions.outlineColor.name
source: Outline color
ta: அவுட்லைன் நிறம்

# models.tableStyling.label.selectableDimensions.outlineWidth.name
source: Outline width
ta: அவுட்லைன் அகலம்

# models.tableStyling.label.selectableDimensions.horizontalOrigin.name
source: Horizontal origin
ta: கிடைமட்ட தோற்றம்

source: Left
ta: இடது

source: Center
ta: நடுவண்

source: Right
ta: வலது

# models.tableStyling.label.selectableDimensions.verticalOrigin.name
source: Vertical origin
ta: செங்குத்து தோற்றம்

# models.tableStyling.label.selectableDimensions.verticalOrigin.options.top.name
source: Top
ta: மேலே

source: Center
ta: நடுவண்

source: Baseline
ta: அடிப்படை

source: Bottom
ta: கீழே

# models.tableStyling.label.selectableDimensions.offsetX.name
source: Pixel offset X
ta: படப்புள்ளி ஆஃப்செட் ஃச்

# models.tableStyling.label.selectableDimensions.offsetY.name
source: Pixel offset Y
ta: படப்புள்ளி ஆஃப்செட் ஒய்

# models.tableStyling.trail.selectableDimensions.leadTime.name
source: Lead time (secs)
ta: முன்னணி நேரம் (விநாடிகள்)

# models.tableStyling.trail.selectableDimensions.trailTime.name
source: Trail time (secs)
ta: பாதை நேரம் (நொடி)

# models.tableStyling.trail.selectableDimensions.width.name
source: Width
ta: அகலம்

# models.tableStyling.trail.selectableDimensions.resolution.name
source: Resolution
ta: பகுத்தல்

# models.tableStyling.trail.selectableDimensions.growColor.name
source: Glow color
ta: பளபளப்பான நிறம்

# models.tableStyling.trail.selectableDimensions.growPower.name
source: Glow power
ta: பளபளப்பான ஆற்றல்

# models.tableStyling.trail.selectableDimensions.taperPower.name
source: Taper power
ta: Taper ஆற்றல்

# models.tableStyling.trail.selectableDimensions.solidColor.name
source: Solid color
ta: திட நிறம்

# models.tableStyling.trail.selectableDimensions.trailStyleOptions.name
source: Trail style options
ta: டிரெயில் பாணி விருப்பங்கள்

source: Material type
ta: பொருள் வகை

source: Solid color
ta: திட நிறம்

source: Polyline glow
ta: பாலிலின் பளபளப்பு

# models.cogCatalogItem.experimentalReprojectionWarning
source: This COG is not in a native projection (EPSG:4326 or EPSG:3857). Reprojecting is experimental and may not work as expected. If you have control of the source data we recommend reprojecting to EPSG:4326 or EPSG:3857 using GDAL or similar.
ta: இந்த COG ஒரு சொந்த திட்டத்தில் இல்லை (EPSG: 4326 அல்லது EPSG: 3857). இனப்பெருக்கம் என்பது சோதனைக்குரியது மற்றும் எதிர்பார்த்தபடி வேலை செய்யாது. மூல தரவுகளின் கட்டுப்பாடு உங்களிடம் இருந்தால், GDAL அல்லது அதற்கு ஒத்ததாக EPSG: 4326 அல்லது EPSG: 3857 க்கு மறுபரிசீலனை செய்ய பரிந்துரைக்கிறோம்.

# searchProvider.noSearchProviders
source: There is no configured search providers
ta: கட்டமைக்கப்பட்ட தேடல் வழங்குநர்கள் எதுவும் இல்லை

# searchProvider.models.unsupportedTypeTitle
source: Unknown type
ta: தெரியாத வகை

# searchProvider.models.unsupportedTypeMessage
source: Could not create unknown model type {{type}}.
ta: அறியப்படாத மாதிரி வகையை உருவாக்க முடியவில்லை {{type}}.

# searchProvider.models.idForMatchingErrorTitle
source: Missing property
ta: சொத்து இல்லை

# searchProvider.models.idForMatchingErrorMessage
source: Model objects must have an `id`, `localId`, or `name` property.
ta: மாதிரி பொருள்களில் `ஐடி`,` லோக்கல்ஐடி` அல்லது `பெயர்` சொத்து இருக்க வேண்டும்.

# deltaTool.titlePrefix
source: Change Detection
ta: கண்டறிதலை மாற்றவும்

# deltaTool.description
source: This tool visualizes the difference between imagery captured at two discrete points in time.
ta: இந்த கருவி இரண்டு தனித்துவமான புள்ளிகளில் கைப்பற்றப்பட்ட படங்களுக்கிடையிலான வேறுபாட்டைக் காட்சிப்படுத்துகிறது.

# deltaTool.pickLocation
source: To view available imagery, please select your location of interest on the map opposite.
ta: கிடைக்கக்கூடிய படங்களைக் காண, எதிர் வரைபடத்தில் உங்கள் ஆர்வத்தின் இருப்பிடத்தைத் தேர்ந்தெடுக்கவும்.

# deltaTool.cancelBtn
source: Cancel
ta: ரத்துசெய்

# deltaTool.generateDeltaBtn
source: Generate Difference Map
ta: வேறுபாடு வரைபடத்தை உருவாக்குங்கள்

# deltaTool.selectedLocation
source: Selected Location
ta: தேர்ந்தெடுக்கப்பட்ட இடம்

# deltaTool.primaryImage
source: Primary Image
ta: முதன்மை படம்

# deltaTool.secondaryImage
source: Secondary Image
ta: இரண்டாம் நிலை படம்

# deltaTool.pickerMessage.pickFirst
source: Select a point by clicking on the map
ta: வரைபடத்தில் சொடுக்கு செய்வதன் மூலம் ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும்

# deltaTool.pickerMessage.pickAnother
source: Click another point to change the selection
ta: தேர்வை மாற்ற மற்றொரு புள்ளியைக் சொடுக்கு செய்க

# deltaTool.pickerMessage.pickError
source: Error when trying to resolve imagery at location! Please select a point again by clicking on the map.
ta: இருப்பிடத்தில் படங்களை தீர்க்க முயற்சிக்கும்போது பிழை! வரைபடத்தில் சொடுக்கு செய்வதன் மூலம் மீண்டும் ஒரு புள்ளியைத் தேர்ந்தெடுக்கவும்.

# deltaTool.catalogItem.description
source: This layer visualizes the difference between imagery captured at two discrete points in time
ta: இந்த அடுக்கு இரண்டு தனித்துவமான புள்ளிகளில் கைப்பற்றப்பட்ட படங்களுக்கிடையிலான வேறுபாட்டைக் காட்சிப்படுத்துகிறது

# deltaTool.loadingError.title
source: Error loading Delta Tool
ta: டெல்டா கருவியை ஏற்றுவதில் பிழை

# deltaTool.loadingError.message
source: An error occurred while trying to load the delta tool from the server. Please try again.
ta: சேவையகத்திலிருந்து டெல்டா கருவியை ஏற்ற முயற்சிக்கும்போது பிழை ஏற்பட்டது. மீண்டும் முயற்சிக்கவும்.

# term.missingContent
source: missing content
ta: உள்ளடக்கத்தைக் காணவில்லை

# mapNavigation.additionalTools
source: Additional tools
ta: கூடுதல் கருவிகள்

# mapNavigation.additionalToolsTitle
source: Open additional tools
ta: கூடுதல் கருவிகளைத் திறக்கவும்

# itemSearchTool.toolLoadError
source: Error loading search tool.
ta: தேடல் கருவியை ஏற்றுவதில் பிழை.

# itemSearchTool.title
source: Search {{itemName}}
ta: {{itemName}} ஐத் தேடுங்கள்

# itemSearchTool.loading
source: Loading search parameters
ta: தேடல் அளவுருக்களை ஏற்றுகிறது

# itemSearchTool.loadError
source: Error loading search parameters. Check console for detailed errors.
ta: தேடல் அளவுருக்களை ஏற்றுவதில் பிழை. விரிவான பிழைகளுக்கு கன்சோலை சரிபார்க்கவும்.

# itemSearchTool.noParameters
source: No searchable parameters found
ta: தேடக்கூடிய அளவுருக்கள் எதுவும் கிடைக்கவில்லை

# itemSearchTool.searching
source: Searching
ta: தேடுகிறது

# itemSearchTool.searchError
source: Search failed. Check console for detailed errors.
ta: தேடல் தோல்வியடைந்தது. விரிவான பிழைகளுக்கு கன்சோலை சரிபார்க்கவும்.

# itemSearchTool.numericParameter.minimum
source: Minimum
ta: சிறுமம்

# itemSearchTool.numericParameter.maximum
source: Maximum
ta: பெருமம்

# itemSearchTool.searchBtnText
source: Search
ta: தேடல்

# itemSearchTool.resetBtnText
source: Clear input
ta: உள்ளீட்டை அழிக்கவும்

# itemSearchTool.backBtnText
source: Search again
ta: மீண்டும் தேடுங்கள்

# itemSearchTool.resultsCount
source: {{count}} match found
ta: {{count}} போட்டி காணப்பட்டது

# itemSearchTool.actions.highlightAll
source: Highlight all
ta: அனைத்தையும் முன்னிலைப்படுத்தவும்

# itemSearchTool.actions.showMatchingOnly
source: Show matching only
ta: பொருத்தத்தை மட்டும் காட்டு

# indexedItemSearchProvider.missingOptionIndexRootUrl
source: Option `indexRootUrl` is missing in the item's search configuration.
ta: சூதம் `indexRootUrl` is missing in the item's தேடல் configuration.

# indexedItemSearchProvider.errorParsingIndexRoot
source: Error parsing indexRoot file: {{indexRootUrl}}.
ta: பிழை பாகுபடுத்தும் குறியீட்டு ரூட் கோப்பு: {{indexRootUrl}}.

# pedestrianMode.toolButtonTitle
source: Pedestrian Mode
ta: பாதசாரி பயன்முறை

# pedestrianMode.dropPedestrianTooltipMessage
source: <b>Left click</b> to select drop location<br /><b>Right click / Esc</b> to cancel
ta: <b> இடது சொடுக்கு </b> டிராப் இருப்பிடத்தைத் தேர்ந்தெடுக்க <br /> <b> ரத்து செய்ய வலது சொடுக்கு /ESC </b>

# pedestrianMode.controls.title
source: Controls
ta: கட்டுப்பாடுகள்

# notification.title
source: Message
ta: செய்தி

# toast.mapIsZooming
source: Loading ideal zoom...
ta: சிறந்த சூம் ஏற்றுகிறது ...

# printView.loading
source: Creating print view...
ta: அச்சு காட்சியை உருவாக்குதல் ...

# compare.title
source: Compare
ta: ஒப்பிடுக

# compare.done
source: Done
ta: முடிந்தது

# compare.leftPanel
source: Left panel
ta: இடது குழு

# compare.rightPanel
source: Right panel
ta: வலது குழு

# compare.entireMap.title
source: Entire map
ta: முழு வரைபடமும்

# compare.entireMap.emptyText
source: Add new data to show across the entire map via the dotted menu above.
ta: மேலே உள்ள புள்ளியிடப்பட்ட பட்டியல் வழியாக முழு வரைபடத்திலும் காண்பிக்க புதிய தரவைச் சேர்க்கவும்.

# compare.entireMapMenu.browse
source: Browse map data
ta: வரைபட தரவை உலாவுக

# compare.entireMapMenu.sendAllToFront
source: Send all to front
ta: அனைத்தையும் முன் அனுப்பவும்

# compare.entireMapMenu.sendAllToBack
source: Send all to back
ta: அனைத்தையும் பின்னால் அனுப்பவும்

# compare.entireMapMenu.hideAll
source: Hide all
ta: அனைத்தையும் மறைக்கவும்

# compare.info
source: Compare spatial datasets from your workbench side-by-side on the map.
ta: வரைபடத்தில் உங்கள் வொர்க் பெஞ்சில் இருந்து இடஞ்சார்ந்த தரவுத்தொகுப்புகளை ஒப்பிடுக.

# compare.dataset.label
source: Dataset
ta: தரவுத்தொகுப்பு

# compare.dataset.selectOne
source: Select one
ta: ஒன்றைத் தேர்ந்தெடுக்கவும்

# compare.dimensionSelector.undefinedLabel
source: Not specified
ta: குறிப்பிடப்படவில்லை

# compare.dateButton.left
source: Left
ta: இடது

# compare.dateButton.right
source: Right
ta: வலது

# compare.dateButton.select
source: Select a date
ta: தேதியைத் தேர்ந்தெடுக்கவும்

# compare.dateLocationFilter.filter
source: Filter date by location
ta: இருப்பிடத்தின் மூலம் வடிகட்டி தேதி

# compare.dateLocationFilter.loading
source: Loading filter...
ta: ஏற்றுதல் வடிகட்டி ...

# compare.dateLocationFilter.cancel
source: Cancel
ta: ரத்துசெய்

# compare.dateLocationFilter.location
source: Now showing available imagery for {{latitude}}, {{longitude}}
ta: இப்போது {{latitude}}, {{longitude}} க்கான கிடைக்கக்கூடிய படங்களைக் காட்டுகிறது

# compare.dateLocationFilter.mouseTooltipTitle
source: Select location
ta: இருப்பிடத்தைத் தேர்ந்தெடுக்கவும்

# compare.dateLocationFilter.mouseTooltipMessage
source: Right click to cancel
ta: ரத்து செய்ய வலது சொடுக்கு செய்யவும்

# selectableDimensions.undefinedLabel
source: Not specified
ta: குறிப்பிடப்படவில்லை

# selectableDimensions.enabled
source: Enabled
ta: இயக்கப்பட்டது

# selectableDimensions.disabled
source: Disabled
ta: முடக்கப்பட்டது

# selectableDimensions.colorAdd
source: Add
ta: கூட்டு

# selectableDimensions.colorRemove
source: Remove
ta: அகற்று

# selectableDimensions.invalid
source: Invalid
ta: செல்லுபடியாகாத

# relatedMaps.buttonText
source: Related Maps
ta: தொடர்புடைய வரைபடங்கள்

# relatedMaps.buttonTitle
source: See related maps
ta: தொடர்புடைய வரைபடங்களைக் காண்க

# relatedMaps.panelHeading
source: Related Maps
ta: தொடர்புடைய வரைபடங்கள்

# relatedMaps.panelText
source: Clicking on a map below will open it in a separate window or tab.
ta: கீழே உள்ள வரைபடத்தில் சொடுக்கு செய்வது ஒரு தனி சாளரம் அல்லது தாவலில் திறக்கும்.
