Repository: 247i/TACETr
Catalog: உரை/வெறுமை/terriajs-terriajsnext-*.po
Languages: ta

# models.arcgisPortal.idsNotSpecifiedTitle
source: resourceId or datasetId must be specified
ta: resourceID அல்லது datasetid குறிப்பிடப்பட வேண்டும்

# models.arcgisPortal.idsNotSpecifiedMessage
source: ArcGIS Portal Item requires an itemId to be specified.
ta: ArcGIS போர்ட்டல் உருப்படிக்கு ஒரு உருப்படி ஐடி குறிப்பிடப்பட வேண்டும்.

# models.arcgisPortal.errorRetrievingUrlTitle
source: Error retrieving ArcGIS Portal URL
ta: ArcGIS போர்ட்டல் முகவரி ஐ மீட்டெடுப்பதில் பிழை

# models.arcgisPortal.errorRetrievingUrlMessage
source: Could not retrieve URL as JSON: {{url}}.
ta: முகவரி ஐ சாதொபொகு என மீட்டெடுக்க முடியவில்லை: {{url}}.

# models.catalog.name
source: Unnamed Item
ta: பெயரிடப்படாத உருப்படி

# models.catalog.group
source: Group
ta: குழு

# models.catalog.idForMatchingErrorTitle
source: Missing property
ta: சொத்து இல்லை

# models.catalog.idForMatchingErrorMessage
source: Model objects must have an `id`, `localId`, or `name` property.
ta: மாதிரி பொருள்களில் `ஐடி`,` லோக்கல்ஐடி` அல்லது `பெயர்` சொத்து இருக்க வேண்டும்.

# models.catalog.catalogMemberMustHaveName
source: A newly created catalog member must have a name.
ta: புதிதாக உருவாக்கப்பட்ட பட்டியல் உறுப்பினருக்கு ஒரு பெயர் இருக்க வேண்டும்.

# models.catalog.catalogMemberMustHaveType
source: A catalog member must have a type.
ta: ஒரு பட்டியல் உறுப்பினருக்கு ஒரு வகை இருக்க வேண்டும்.

# models.catalog.userAddedDataGroup
source: The group for data that was added by the user via the Add Data panel.
ta: சேர் தரவு குழு வழியாக பயனரால் சேர்க்கப்பட்ட தரவுகளுக்கான குழு.

# models.catalog.chartDataGroup
source: A group for chart data.
ta: விளக்கப்பட தரவுகளுக்கான குழு.

# models.catalog.dataSourceErrorMessage
source: This data source does not have any details available.
ta: இந்த தரவு மூலத்தில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.catalog.serviceErrorMessage
source: This service does not have any details available.
ta: இந்த சேவையில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.catalog.stubCreationFailure
source: Could not stub out catalog item {{item}}
ta: அட்டவணை உருப்படியை {{item}}

# models.catalog.unsupportedTypeTitle
source: Unknown type
ta: தெரியாத வகை

# models.catalog.unsupportedTypeMessage
source: Could not create unknown model type {{type}}.
ta: அறியப்படாத மாதிரி வகையை உருவாக்க முடியவில்லை {{type}}.

# models.catalog.unsupportedFileTypeTitle
source: Unsupported file type
ta: ஆதரிக்கப்படாத கோப்பு வகை

# models.catalog.unsupportedFileTypeMessage
source: This file format is not supported by {{appName}}. Supported file formats include: <ul><li>.geojson</li><li>.kml, .kmz</li><li>.csv (in {{link}})</li><li>Shapefile (.zip)</li></ul>
ta: இந்தக் கோப்பு வடிவம் {{appName}} ஆல் ஆதரிக்கப்படவில்லை. ஆதரிக்கப்பட்ட கோப்பு வடிவங்கள் பின்வருமாறு: <ul> <li>.சியோச்சன் </li> <li> .kmz, .kmz </li> <li> .csv ({{link}}) </li> <li> shateFile (.zip) </li> </ul>

# models.catalog.upload
source: Upload data
ta: தரவைப் பதிவேற்றவும்

# models.catalog.mustHaveType
source: Each item must have a type.
ta: ஒவ்வொரு உருப்படியிலும் ஒரு வகை இருக்க வேண்டும்.

# models.catalog.compositesError
source: Composites cannot include composite items.
ta: கலவைகளில் கலப்பு உருப்படிகளை சேர்க்க முடியாது.

# models.catalog.convertErrorTitle
source: Could not upgrade catalog to V8
ta: பட்டியலை V8 க்கு மேம்படுத்த முடியவில்லை

# models.catalog.convertErrorMessage
source: This catalog file is based on an older version of TerriaJS - the software powering this web map. An error has occurred trying to upgrade the catalog data for {{url}}.
ta: இந்த அட்டவணை கோப்பு டெர்ரியாச்சின் பழைய பதிப்பை அடிப்படையாகக் கொண்டது - இந்த வலை வரைபடத்தை இயக்கும் மென்பொருள். {{url}} க்கான பட்டியல் தரவை மேம்படுத்த முயற்சிக்கும் பிழை ஏற்பட்டது.

# models.catalog.addAll
source: Add All
ta: அனைத்தையும் சேர்க்கவும்

# models.catalog.removeAll
source: Remove All
ta: அனைத்தையும் அகற்று

# models.createParameter.unsupportedErrorTitle
source: Unsupported function parameter type
ta: ஆதரிக்கப்படாத செயல்பாட்டு அளவுரு வகை

# models.createParameter.unsupportedErrorMessage
source: Unknown function parameter type: {{type}}.
ta: அறியப்படாத செயல்பாட்டு அளவுரு வகை: {{type}}.

# models.csv.name
source: Comma-Separated Values (CSV)
ta: கமாவால் பிரிக்கப்பட்ட மதிப்புகள் (சி.எச்.வி)

# models.csv.dataSourceErrorMessage
source: This data source does not have any details available.
ta: இந்த தரவு மூலத்தில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.csv.serviceErrorMessage
source: This service does not have any details available.
ta: இந்த சேவையில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.csv.unexpectedTypeTitle
source: Unexpected type of CSV data
ta: எதிர்பாராத வகை காபிம தரவு

# models.csv.unexpectedTypeMessage
source: CsvCatalogItem data is expected to be a Blob, File, or String, but it was not any of these.
ta: CSVCatalogitem தரவு ஒரு குமிழ், கோப்பு அல்லது சரம் என்று எதிர்பார்க்கப்படுகிறது, ஆனால் அது இவற்றில் எதுவுமில்லை.

# models.csv.unableToLoadTitle
source: Unable to load CSV file
ta: காபிம கோப்பை ஏற்ற முடியவில்லை

# models.csv.unableToLoadMessage
source: See the <a href="https://github.com/TerriaJS/nationalmap/wiki/csv-geo-au">csv-geo-au</a> specification for supported CSV formats. {{message}}
ta: <a href="https://github.com/TerriaJS/nationalmap/wiki/csv-geo-au"> CSV-GEO -AU </a> உதவி காபிம வடிவங்களுக்கான விவரக்குறிப்பு ஆகியவற்றைக் காண்க. {{message}}

# models.csv.unableToLoadItemTitle
source: No CSV available
ta: சி.எச்.வி கிடைக்கவில்லை

# models.csv.unableToLoadItemMessage
source: The CSV catalog item cannot be loaded because it was not configured with a `url` or `csvString` property.
ta: சி.எச்.வி பட்டியல் உருப்படியை ஏற்ற முடியாது, ஏனெனில் இது `url` அல்லது` CSVString` சொத்துடன் கட்டமைக்கப்படவில்லை.

# models.csw.name
source: Catalogue Service (CSW)
ta: பட்டியல் பணி (சி.எச்.டபிள்யூ)

# models.csw.unknownError
source: The CSW server reported an unknown error.
ta: சி.எச்.டபிள்யூ சேவையகம் அறியப்படாத பிழையைப் புகாரளித்தது.

# models.csw.exceptionMessage
source: The CSW server reported an error: {{exceptionText}}
ta: சி.எச்.டபிள்யூ சேவையகம் ஒரு பிழையைப் புகாரளித்தது: {{exceptionText}}}

# models.csw.errorLoadingTitle
source: Could not load CSW
ta: சி.எச்.டபிள்யூவை ஏற்ற முடியவில்லை

# models.csw.notUseableTitle
source: Catalogue service is not usable. {{message}}
ta: அட்டவணை பணி பயன்படுத்த முடியாதது. {{message}}

# models.csw.notUseableMessage
source: Invalid response obtained when invoking GetDomain on the CSW server.
ta: சி.எச்.டபிள்யூ சேவையகத்தில் கெட்ட்டொமைனைத் தொடங்கும்போது தவறான பதில் பெறப்பட்டது.

# models.csw.errorLoadingRecordsTitle
source: Failed to load CSW records.
ta: சி.எச்.டபிள்யூ பதிவுகளை ஏற்றுவதில் தோல்வி.

# models.csw.errorLoadingRecordsMessage
source: Invalid response obtained when invoking GetRecords on the CSW
ta: சி.எச்.டபிள்யூவில் GetRecords ஐ அழைக்கும்போது செல்லாத பதில் பெறப்பட்டது

# models.csw.checkCORSDomain
source: Couldn't execute GetDomain on this CSW server.
ta: இந்த சி.எச்.டபிள்யூ சேவையகத்தில் GetDomain ஐ இயக்க முடியவில்லை.

# models.csw.checkCORSRecords
source: Couldn't execute GetRecords on this CSW server.
ta: இந்த சி.எச்.டபிள்யூ சேவையகத்தில் GetRecords ஐ இயக்க முடியவில்லை.

# models.csw.dataResponsibility
source: Data Responsibility
ta: தரவு பொறுப்பு

# models.csw.links
source: Links
ta: இணைப்புகள்

# models.csw.metadataURL
source: Metadata Record URL
ta: மேனிலை தரவு பதிவு முகவரி

# models.csw.checkCORS
source: Couldn't execute GetRecords on this CSW server.
ta: இந்த சி.எச்.டபிள்யூ சேவையகத்தில் GetRecords ஐ இயக்க முடியவில்லை.

# models.csw.cors
source: CORS
ta: கோர்ச்

# models.csw.missingUrlTitle
source: Unable to load Catalogue Service (CSW)
ta: அட்டவணை சேவையை ஏற்ற முடியவில்லை (சி.எச்.டபிள்யூ)

# models.csw.missingUrlMessage
source: Could not load the Catalogue Service (CSW) because the catalog group does not have a `url`.
ta: அட்டவணை சேவையை (சி.எச்.டபிள்யூ) ஏற்ற முடியவில்லை, ஏனெனில் பட்டியல் குழுவில் `url` இல்லை.

# models.czml.name
source: Cesium Language (CZML)
ta: சீசியம் மொழி (CZML)

# models.czml.dataSourceErrorMessage
source: This data source does not have any details available.
ta: இந்த தரவு மூலத்தில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.czml.serviceErrorMessage
source: This service does not have any details available.
ta: இந்த சேவையில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.czml.errorLoadingTitle
source: Could not load CZML
ta: CZML ஐ ஏற்ற முடியவில்லை

# models.czml.errorLoadingMessage
source: An error occurred while loading a CZML file.
ta: CZML கோப்பை ஏற்றும்போது பிழை ஏற்பட்டது.

# models.czml.unableToLoadItemTitle
source: No CZML available
ta: CZML எதுவும் கிடைக்கவில்லை

# models.czml.unableToLoadItemMessage
source: The CZML catalog item cannot be loaded because it was not configured with a `url`, `czmlData`, or `czmlString` property.
ta: CZML பட்டியல் உருப்படியை ஏற்ற முடியாது, ஏனெனில் இது `url`,` CZMldata` அல்லது `CZMLString` சொத்துடன் கட்டமைக்கப்படவில்லை.

# models.function.unknownFormaterTitle
source: Unknown formatter
ta: தெரியாத வடிவ

# models.function.unknownFormaterMessage
source: The function parameter formatter {{formatter}} is unknown. Valid formatters are:
ta: செயல்பாட்டு அளவுரு வடிவ {{formatter}} தெரியவில்லை. செல்லுபடியாகும் வடிவங்கள்:

# models.geoJson.name
source: GeoJSON
ta: சியோச்சன்

# models.geoJson.dataSourceErrorMessage
source: This data source does not have any details available.
ta: இந்த தரவு மூலத்தில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.geoJson.serviceErrorMessage
source: This service does not have any details available.
ta: இந்த சேவையில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.geoJson.errorLoadingTitle
source: Error loading GeoJSON
ta: சியோச்சனை ஏற்றுவதில் பிழை

# models.geoJson.errorParsingMessage
source: An error occurred parsing the provided data as JSON. This may indicate that the file is invalid or that it is not supported.
ta: வழங்கப்பட்ட தரவை சாதொபொகு ஆக பாகுபடுத்துவதில் பிழை ஏற்பட்டது. கோப்பு தவறானது அல்லது அது ஆதரிக்கப்படவில்லை என்பதை இது குறிக்கலாம்.

# models.geoJson.errorLoadingMessage
source: An error occurred while loading a GeoJSON file. This may indicate that the file is invalid or that it is not supported.
ta: சியோச்சன் கோப்பை ஏற்றும்போது பிழை ஏற்பட்டது. கோப்பு தவறானது அல்லது அது ஆதரிக்கப்படவில்லை என்பதை இது குறிக்கலாம்.

# models.geoJson.couldNotLoadTitle
source: Could not load JSON
ta: சாதொபொகு ஐ ஏற்ற முடியவில்லை

# models.geoJson.couldNotLoadMessage
source: An error occurred while retrieving JSON data from the provided link.CORS
ta: வழங்கப்பட்ட இணைப்பிலிருந்து சாதொபொகு தரவை மீட்டெடுக்கும்போது பிழை ஏற்பட்டது

# models.geoJson.unableToLoadItemTitle
source: No GeoJSON available
ta: சியோச்சன் எதுவும் கிடைக்கவில்லை

# models.geoJson.unableToLoadItemMessage
source: The GeoJSON catalog item cannot be loaded because it was not configured with a `url`, `geoJsonData`, or `geoJsonString` property.
ta: சியோச்சன் பட்டியல் உருப்படியை ஏற்ற முடியாது, ஏனெனில் அது `url`,` சியோச்சொண்டேட்டா` அல்லது `சியோச்சான்ச்ட்ரிங்` சொத்துடன் கட்டமைக்கப்படவில்லை.

# models.geoJson.unsupportedBrowserTitle
source: Unsupported web browser
ta: ஆதரிக்கப்படாத வலை உலாவி

# models.geoJson.unsupportedBrowserMessage
source: Sorry, your web browser does not support the File API, which {{appName}} requires in order to load this dataset. Please upgrade your web browser. For the best experience, we recommend the latest versions of $t(browsers.chrome) or $t(browsers.firefox) or $t(browsers.edge) or $t(browsers.safari).
ta: மன்னிக்கவும், இந்தத் தரவுத்தொகுப்பை ஏற்றுவதற்கு {{appName}} தேவைப்படும் பநிஇ கோப்பை உங்கள் வலை உலாவி ஆதரிக்காது. உங்கள் வலை உலாவியை மேம்படுத்தவும். சிறந்த அனுபவத்திற்காக, $t(browsers.chrome) அல்லது $t(browsers.firefox) அல்லது $t(browsers.edge) அல்லது $t(browsers.safari)ஆகியவற்றின் அண்மைக் கால பதிப்புகளைப் பரிந்துரைக்கிறோம்.

# models.shapefile.name
source: Shapefile
ta: சேப்ஃபைல்

# models.getToken.errorTitle
source: Token Error
ta: கிள்ளாக்கு பிழை

# models.getToken.invalidToken
source: <p>The token server responded with an invalid token.</p><p>Please report it by sending an email to {{email}}</p>
ta: <p> கிள்ளாக்கு சேவையகம் தவறான டோக்கனுடன் பதிலளித்தது.</p><p>தயவுசெய்து {{email}}க்கு ஒரு மின்னஞ்சல் அனுப்பி புகாரளி</p>

# models.getToken.unableToRequest
source: <p>Unable to request a token from the token server.</p><p>Please report it by sending an email to {{email}}</p>
ta: <p> கிள்ளாக்கு சேவையகத்திலிருந்து ஒரு டோக்கனைக் கோர முடியவில்லை. </p> <p> தயவுசெய்து {{email}} </p> க்கு மின்னஞ்சல் அனுப்புவதன் மூலம் அதைப் புகாரளிக்கவும்

# models.gltf.name
source: GL Transmission Format (glTF)
ta: சி.எல் பரிமாற்ற வடிவம் (சி.எல்.டி.எஃப்)

# models.gltf.dataSourceErrorMessage
source: This data source does not have any details available.
ta: இந்த தரவு மூலத்தில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.gltf.serviceErrorMessage
source: This service does not have any details available.
ta: இந்த சேவையில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.gltf.notSupportedErrorTitle
source: Not supported in 2D
ta: 2D இல் ஆதரிக்கப்படவில்லை

# models.gltf.notSupportedErrorMessage
source: "{{name}}" cannot be show in the 2D view. Switch to 3D and try again.
ta: "{{name}}" 2 டி பார்வையில் காட்ட முடியாது. 3D க்கு மாறி மீண்டும் முயற்சிக்கவும்.

# models.gltf.error
source: Error
ta: பிழை

# models.gltf.unableToRetrieve
source: Unable to retrieve feature details from: {{url}}
ta: அம்ச விவரங்களை மீட்டெடுக்க முடியவில்லை: {{url}}

# models.gpx.name
source: GPX
ta: சி.பி.எக்ச்

# models.gpx.dataSourceErrorMessage
source: This data source does not have any details available.
ta: இந்த தரவு மூலத்தில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.gpx.serviceErrorMessage
source: This service does not have any details available.
ta: இந்த சேவையில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.gpx.errorLoadingTitle
source: Error loading GPX
ta: சி.பி.எக்ச் ஏற்றுவதில் பிழை

# models.gpx.errorLoadingMessage
source: An error occurred while loading a GPX file. This may indicate that the file is invalid or that it is not supported by {{appName}}.
ta: சிபிஎக்ச் கோப்பை ஏற்றும்போது பிழை ஏற்பட்டது. கோப்பு தவறானது அல்லது அது {{appName}} ஆல் ஆதரிக்கப்படவில்லை என்பதைக் குறிக்கலாம்.

# models.georss.name
source: GeoRSS
ta: சார்ச்

# models.georss.subtitle
source: Subtitle
ta: வசன வரிகள்

# models.georss.updated
source: Updated
ta: புதுப்பிக்கப்பட்டது

# models.georss.category
source: Category
ta: வகை

# models.georss.description
source: Description
ta: விவரம்

# models.georss.copyrightText
source: Copyright Text
ta: பதிப்புரிமை உரை

# models.georss.link
source: Link
ta: இணைப்பு

# models.georss.author
source: Author
ta: நூலாசிரியர்

# models.georss.errorLoadingTitle
source: Could not load GeoRSS
ta: சார்சை ஏற்ற முடியவில்லை

# models.georss.errorLoadingMessage
source: An error occurred while loading a GeoRSS file.
ta: சார்ச் கோப்பை ஏற்றும்போது பிழை ஏற்பட்டது.

# models.georss.unableToLoadItemTitle
source: No GeoRSS available
ta: சார்ச் எதுவும் கிடைக்கவில்லை

# models.georss.unableToLoadItemMessage
source: The GeoRSS catalog item cannot be loaded because it was not configured with a `url`, or `geoRss` property.
ta: சார்ச் பட்டியல் உருப்படியை ஏற்ற முடியாது, ஏனெனில் அது `url` அல்லது` சியோர்ச்` சொத்துடன் கட்டமைக்கப்படவில்லை.

# models.imageryLayer.intervalSupportErrorTitle
source: Intervals not supported
ta: இடைவெளிகள் ஆதரிக்கப்படவில்லை

# models.imageryLayer.intervalSupportErrorMessage
source: Sorry, {{typeName}} ({{type}}) catalog items cannot currently be made time-varying by specifying the "intervals" property.
ta: மன்னிக்கவும், {{typeName}} ({{type}}) பட்டியல் உருப்படிகளை தற்போது "இடைவெளிகள்" சொத்தைக் குறிப்பிடுவதன் மூலம் நேரம் மாறுபடும்.

# models.imageryLayer.resolvingAvailability
source: Resolving availability at a location...
ta: ஒரு இடத்தில் கிடைப்பதைத் தீர்ப்பது ...

# models.imageryLayer.accessingBaseMapErrorTitle
source: Error accessing base map
ta: அடிப்படை வரைபடத்தை அணுகுவதில் பிழை

# models.imageryLayer.accessingBaseMapErrorMessage
source: An error occurred while attempting to download tiles for base map:<p><center>{{name}} </center></p> Please select a different base map using the Map button in the top-right corner.
ta: அடிப்படை வரைபடத்திற்கான ஓடுகளைப் பதிவிறக்கம் செய்ய முயற்சிக்கும்போது பிழை ஏற்பட்டது: <p> <center>{{name}}</center></p> தயவுசெய்து மேல்-வலது மூலையில் உள்ள வரைபட பொத்தானைப் பயன்படுத்தி வேறு அடிப்படை வரைபடத்தைத் தேர்ந்தெடுக்கவும்.

# models.imageryLayer.accessingCatalogItemErrorTitle
source: Error accessing catalogue item
ta: அட்டவணை உருப்படியை அணுகுவதில் பிழை

# models.imageryLayer.accessingCatalogItemErrorMessage
source: An error occurred while attempting to download tiles for catalogue item:<p><center>{{name}}</center></p> The catalogue item has been hidden from the map. You may re-show it in the Now Viewing panel to try again.
ta: பட்டியல் உருப்படிக்கு ஓடுகளைப் பதிவிறக்கம் செய்ய முயற்சிக்கும்போது பிழை ஏற்பட்டது: <p><center>{{name}}</center></p> அட்டவணை உருப்படி வரைபடத்திலிருந்து மறைக்கப்பட்டுள்ளது. மீண்டும் முயற்சிக்க இப்போது பார்க்கும் குழுவில் அதை மீண்டும் நிகழ்ச்சிக்கலாம்.

# models.imageryLayer.tileErrorTitle
source: Tile Error
ta: ஓடு பிழை

# models.imageryLayer.tileErrorMessage
source: The tile with the URL: {{url}} succeeded when loaded with XMLHttpRequest but failed multiple times when loaded directly by Cesium or Leaflet. This may indicate that the server is very sensitive to the request headers provided or is simply unreliable.
ta: முகவரி உடன் ஓடு: {{url}} எக்ச்எம்எல்எச்.டி.பிரெக்செச்ட் ஏற்றும்போது செய் பெற்றது, ஆனால் சீசியம் அல்லது துண்டுப்பிரசுரத்தால் நேரடியாக ஏற்றப்படும்போது பல முறை தோல்வியடைந்தது. வழங்கப்பட்ட கோரிக்கை தலைப்புகளுக்கு சேவையகம் மிகவும் உணர்திறன் கொண்டது அல்லது நம்பமுடியாதது என்பதை இது குறிக்கலாம்.

# models.imageryLayer.tileErrorMessageII
source: Got a 200 (OK) response from URL: {{url}} but it could not be loaded as an image.
ta: முகவரி இலிருந்து 200 (சரி) பதில் கிடைத்தது: {{url}} ஆனால் அதை ஒரு படமாக ஏற்ற முடியவில்லை.

# models.imageryLayer.unknownTileErrorTitle
source: Unknown Tile Error
ta: தெரியாத ஓடு பிழை

# models.imageryLayer.unknownTileErrorMessage
source: While accessing URL: {{url}} This probably indicates one of the following: * The server hostname could not be resolved, * The server did not respond to the request, or * The server denied Cross-Origin Resource Sharing (CORS) access to this URL (See https://docs.terria.io/guide/connecting-to-data/cross-origin-resource-sharing/).
ta: முகவரி ஐ அணுகும்போது: {{url}} இது பின்வருவனவற்றில் ஒன்றைக் குறிக்கிறது: * சேவையக ஓச்ட்பெயரை தீர்க்க முடியவில்லை, * சேவையகம் கோரிக்கைக்கு பதிலளிக்கவில்லை, அல்லது * இந்த முகவரி க்கான குறுக்கு-ஆரிசின் வள பகிர்வு (CORS) அணுகலை சேவையகம் மறுத்தது (பார்க்க https://docs.terria.io/guide/connection-to-to-data/crorse-origin-resource-pharing/).

# models.imageryLayer.unableToDisplayTitle
source: Unable to display dataset
ta: தரவுத்தொகுப்பைக் காட்ட முடியவில்லை

# models.imageryLayer.unableToDisplayMessage
source: {{name}} cannot be shown in 2D because it does not support the standard Web Mercator (EPSG:3857) projection. Please switch to 3D if it is supported on your system, update the dataset to support the projection, or use a different dataset.
ta: {{name}} 2d இல் காட்ட முடியாது, ஏனெனில் இது நிலையான வலை மெர்கேட்டரை (EPSG: 3857) திட்டத்தை ஆதரிக்காது. தயவுசெய்து உங்கள் கணினியில் ஆதரிக்கப்பட்டால் 3D க்கு மாறவும், திட்டத்தை ஆதரிக்கத் தரவுத்தொகுப்பைப் புதுப்பிக்கவும் அல்லது வேறு தரவுத்தொகுப்பைப் பயன்படுத்தவும்.

# models.imageryLayer.unableToShowLocTitle
source: Unable to show at this location
ta: இந்த இடத்தில் காட்ட முடியவில்லை

# models.imageryLayer.unableToShowLocMessage
source: {{name}} cannot be shown at this location because the available capture times are unknown. The {{featureTimesProperty}} property was not found.
ta: {{name}} இந்த இடத்தில் காட்ட முடியாது, ஏனெனில் கிடைக்கக்கூடிய பிடிப்பு நேரங்கள் தெரியவில்லை. {{featureTimesProperty}} சொத்து காணப்படவில்லை.

# models.invokeAnalyticsService.invocationFailedTitle
source: Service invocation failed
ta: பணி அழைப்பு தோல்வியடைந்தது

# models.invokeAnalyticsService.invocationFailedMessage
source: An error occurred on the server while computing {{invocationName}}.
ta: {{invocationName}} ஐ கணக்கிடும்போது சேவையகத்தில் பிழை ஏற்பட்டது.

# models.ionImagery.name
source: Cesium Ion Imagery
ta: சீசியம் அயன் படங்கள்

# models.kml.name
source: KML or KMZ
ta: KMLM அல்லது KMZ

# models.kml.dataSourceErrorMessage
source: This data source does not have any details available.
ta: இந்த தரவு மூலத்தில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.kml.serviceErrorMessage
source: This service does not have any details available.
ta: இந்த சேவையில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.kml.unexpectedTypeTitle
source: Unexpected type of KML data
ta: எதிர்பாராத வகை கே.எம்.எல் தரவு

# models.kml.unexpectedTypeMessage
source: KmlCatalogItem.data is expected to be an XML Document, Blob, or File, but it was none of these. This may indicate a bug in {{appName}} or incorrect use of the {{appName}} API.
ta: Kmlcatalogitem.data ஒரு எக்ச்எம்எல் ஆவணம், குமிழ் அல்லது கோப்பாக இருக்கும் என்று எதிர்பார்க்கப்படுகிறது, ஆனால் இது எதுவுமில்லை. இது {{appName}} இல் உள்ள பிழையைக் குறிக்கலாம் அல்லது {{appName}} பநிஇ இன் தவறான பயன்பாட்டைக் குறிக்கலாம்.

# models.kml.errorLoadingTitle
source: Error loading KML or KMZ
ta: KML அல்லது KMZ ஏற்றுவதில் பிழை

# models.kml.errorLoadingMessage
source: An error occurred while loading a KML or KMZ file. This may indicate that the file is invalid or that it is not supported by {{appName}}.
ta: KML அல்லது KMZ கோப்பை ஏற்றும்போது பிழை ஏற்பட்டது. கோப்பு தவறானது அல்லது அது {{appName}} ஆல் ஆதரிக்கப்படவில்லை என்பதைக் குறிக்கலாம்.

# models.kml.unableToLoadItemTitle
source: No KML available
ta: கே.எம்.எல் கிடைக்கவில்லை

# models.kml.unableToLoadItemMessage
source: The KML/KMZ catalog item cannot be loaded because it was not configured with a `url`, `kmlData` or `kmlString` property.
ta: KML/KMZ பட்டியல் உருப்படியை ஏற்ற முடியாது, ஏனெனில் இது `url`,` kmldata` அல்லது `kmlstring` சொத்துடன் கட்டமைக்கப்படவில்லை.

# models.magda.name
source: MAGDA Distribution
ta: மாக்டா வழங்கல்

# models.magda.dataSourceErrorMessage
source: This data source does not have any details available.
ta: இந்த தரவு மூலத்தில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.magda.serviceErrorMessage
source: This service does not have any details available.
ta: இந்த சேவையில் எந்த விவரங்களும் கிடைக்கவில்லை.

# models.magda.distributionDesc
source: Distribution Description
ta: விநியோக விளக்கம்

# models.magda.idsNotSpecifiedTitle
source: recordId must be specified
ta: ரெக்கார்ட்ஐடி குறிப்பிடப்பட வேண்டும்

# models.magda.idsNotSpecifiedMessage
source: MagdaReference requires that recordId be specified.
ta: ரெக்கார்டிட் குறிப்பிடப்பட வேண்டும்.

# models.magda.retrieveErrorTitle
source: Error retrieving MAGDA record
ta: மாக்டா பதிவை மீட்டெடுப்பதில் பிழை

# models.magda.retrieveErrorMessage
source: No distribution or dataset ID provided
ta: வழங்கல் அல்லது தரவுத்தொகுப்பு ஐடி வழங்கப்படவில்லை

# models.magda.notCompatibleTitle
source: No compatible distributions found
ta: இணக்கமான விநியோகங்கள் எதுவும் கிடைக்கவில்லை

# models.magda.notCompatibleMessageI
source: The MAGDA dataset does not have a distribution with the ID {{distributionId}} or it does not have a supported format.
ta: MAGDA தரவுத்தொகுப்பில் ஐடி {{distributionId}} உடன் வழங்கல் இல்லை அல்லது அதற்கு உதவி வடிவம் இல்லை.

# models.magda.notCompatibleMessageII
source: The MAGDA dataset does not have any distributions with a supported format.
ta: MAGDA தரவுத்தொகுப்பில் உதவி வடிவத்துடன் எந்த விநியோகமும் இல்லை.

# models.terria-reference.failedToLoadTarget
source: Failed to load member from external catalog
ta: வெளிப்புற பட்டியலிலிருந்து உறுப்பினரை ஏற்றுவதில் தோல்வி

# models.mapboxMap.name
source: Mapbox Map
ta: மேபாக்ச் வரைபடம்

# models.mapboxVectorTile.name
source: Mapbox Vector Tile
ta: மேபாக்ச் திசையன் ஓடு

# models.mapboxStyle.name
source: Mapbox Style
ta: மேபாக்ச் பாணி

# models.senaps.name
source: Senaps Locations
ta: செனாப்ச் இருப்பிடங்கள்
