Repository: 247i/TACETr
Catalog: உரை/வெறுமை/terriajs-terriajsnext-*.po
Languages: ta

# models.senaps.retrieveErrorTitle
source: Error processing Senaps Catalog Item
ta: பிழை செயலாக்க மெனாப்ச் பட்டியல் உருப்படி

# models.senaps.generalErrorMessage
source: Encountered an error processing Senaps data
ta: SENAPS தரவை செயலாக்க பிழையை எதிர்கொண்டது

# models.senaps.missingKeyErrorMessage
source: A Senaps API Key should be added to the terriajs-server config using the appendParamToQueryString option
ta: Appendparamtoquerystring விருப்பத்தைப் பயன்படுத்தி டெர்ரியாச்-சேவையக கட்டமைப்பில் ஒரு செனாப்ச் பநிஇ விசை சேர்க்கப்பட வேண்டும்

# models.senaps.locationHeadingFeatureInfo
source: Location
ta: இடம்

# models.senaps.availableStreamsHeadingFeatureInfo
source: Available Streams
ta: கிடைக்கும் நீரோடைகள்

# models.senaps.noStreamsMessageFeatureInfo
source: No streams at this location.
ta: இந்த இடத்தில் நீரோடைகள் இல்லை.

# models.senaps.missingSenapsBaseUrl
source: Senaps base url not provided. Have you logged in?
ta: செனாப்ச் அடிப்படை முகவரி வழங்கப்படவில்லை. நீங்கள் உள்நுழைந்தீர்களா?

# models.placesLikeMe.regionsLikeThisName
source: Regions like this
ta: இது போன்ற பகுதிகள்

# models.placesLikeMe.regionsLikeThisDescription
source: Identifies regions that are _most like_ a given region according to a given set of characteristics.
ta: கொடுக்கப்பட்ட குணாதிசயங்களின்படி கொடுக்கப்பட்ட பிராந்தியத்தை _ அதிகமாக இருக்கும் பகுதிகளை அடையாளம் காட்டுகிறது.

# models.placesLikeMe.regionTypeName
source: Region Type
ta: பகுதி வகை

# models.placesLikeMe.regionTypeDescription
source: The type of region to analyze.
ta: பகுப்பாய்வு செய்ய பகுதி வகை.

# models.placesLikeMe.regionName
source: Region
ta: பகுதி

# models.placesLikeMe.regionDescription
source: The region to analyze. The analysis will determine which regions are most similar to this one.
ta: பகுப்பாய்வு செய்ய பகுதி. எந்த பகுதிகள் இதை மிகவும் ஒத்தவை என்பதை பகுப்பாய்வு தீர்மானிக்கும்.

# models.placesLikeMe.characteristics
source: Characteristics
ta: பண்புகள்

# models.placesLikeMe.characteristicsDescription
source: The region characteristics to include in the analysis.
ta: பகுப்பாய்வில் சேர்க்க வேண்டிய பிராந்திய பண்புகள்.

# models.placesLikeMe.name
source: Places Like Me
ta: என்னைப் போன்ற இடங்கள்

# models.placesLikeMe.regioNotSelectedName
source: Region not selected
ta: பகுதி தேர்ந்தெடுக்கப்படவில்லை

# models.placesLikeMe.regioNotSelectedDescription
source: You must select a Region.
ta: நீங்கள் ஒரு பகுதியைத் தேர்ந்தெடுக்க வேண்டும்.

# models.placesLikeMe.placesLike
source: Places like {{regionName}}
ta: {{regionName}}} போன்ற இடங்கள்

# models.placesLikeMe.likenessesError
source: The list of likenesses and the list of region codes do not contain the same number of elements.
ta: ஒற்றுமையின் பட்டியல் மற்றும் பிராந்திய குறியீடுகளின் பட்டியலில் ஒரே எண்ணிக்கையிலான கூறுகள் இல்லை.

# models.raiseError.errorTitle
source: An error occurred
ta: பிழை ஏற்பட்டது

# models.raiseError.notificationFeedback
source: For questions or feedback, click here.
ta: கேள்விகள் அல்லது பின்னூட்டங்களுக்கு, இங்கே சொடுக்கு செய்க.

# models.raiseError.notificationFeedbackEmail
source: For questions or feedback, please contact {{email}}
ta: கேள்விகள் அல்லது பின்னூட்டங்களுக்கு, தயவுசெய்து {{email}} ஐ தொடர்பு கொள்ளவும்

# models.raiseError.developerDetails
source: Developer details
ta: உருவாக்குபவர் விவரங்கள்

# models.regionMapping.noDataForDate
source: No data for the selected date.
ta: தேர்ந்தெடுக்கப்பட்ட தேதிக்கு தரவு இல்லை.

# models.regionMapping.noDataForRegion
source: No data for the selected region.
ta: தேர்ந்தெடுக்கப்பட்ட பிராந்தியத்திற்கான தரவு இல்லை.

# models.regionMapping.outdatedBrowserTitle
source: Outdated Web Browser
ta: காலாவதியான வலை உலாவி

# models.regionMapping.outdatedBrowserMessage
source: You are using a very old web browser that cannot display "region mapped" datasets such as this one. Please upgrade to the latest version of $t(browsers.chrome), $t(browsers.firefox), $t(browsers.edge), or $t(browsers.safari) as soon as possible.
ta: இது போன்ற "பிராந்திய வரைபட" தரவுத்தொகுப்புகளைக் காட்ட முடியாத மிகப் பழைய வலை உலாவியைப் பயன்படுத்துகிறீர்கள். $t(browsers.chrome), $t(browsers.firefox), $t(browsers.edge), அல்லது $t(browsers.safari) கூடிய விரைவில் புதிப்பிக்கவும்.

# models.regionMapping.invalidServerTypeTitle
source: Invalid serverType {{serverType}} in regionMapping.json
ta: பிராந்தியமாப்பிங்.செசனில் தவறான ServerType {{serverType}}

# models.regionMapping.invalidServerTypeMessage
source: Expected serverType to be "WMS" or "vector" but got "{{serverType}}"
ta: சர்வர் டைப் "WMS" அல்லது "திசையன்" ஆக இருக்கும், ஆனால் "{{serverType}}" கிடைத்தது

# models.regionMapping.notRecognised
source: These region names were {{notRecognisedText}}
ta: இந்த பிராந்திய பெயர்கள் {{notRecognisedText}}

# models.regionMapping.notRecognisedText
source: not recognised
ta: அங்கீகரிக்கப்படவில்லை

# models.regionMapping.moreThanOneValue
source: These regions had {{moreThanOneValueText}}
ta: இந்த பிராந்தியங்கள் {{moreThanOneValueText}} இருந்தன

# models.regionMapping.moreThanOneValueText
source: more than one value
ta: ஒன்றுக்கு மேற்பட்ட மதிப்புகள்

# models.regionMapping.msg
source: Consult the {{link}} to see how to format the file.
ta: கோப்பை எவ்வாறு வடிவமைப்பது என்பதைப் பார்க்க {{link}} ஐ அணுகவும்.

# models.regionMapping.csvSpecification
source: CSV-geo-au specification
ta: CSV-GEO-AU விவரக்குறிப்பு

# models.regionMapping.issuesLoadingTitle
source: Issues loading {{name}}
ta: {{name}} ஏற்றுவதில் சிக்கல்கள்

# models.feedback.thanksTitle
source: Thank you for your feedback!
ta: உங்கள் கருத்துக்கு நன்றி!

# models.feedback.thanksMessage
source: Your feedback helps make {{appName}} better
ta: உங்கள் கருத்து {{appName}}} ஐ சிறப்பாகச் செய்ய உதவுகிறது

# models.feedback.unableToSendTitle
source: Unable to send feedback
ta: கருத்துக்களை அனுப்ப முடியவில்லை

# models.feedback.unableToSendMessage
source: This is really embarrassing, but an error occurred while attempting to send your feedback. Please email it to {{email}} instead.
ta: இது உண்மையில் சங்கடமாக இருக்கிறது, ஆனால் உங்கள் கருத்தை அனுப்ப முயற்சிக்கும் போது பிழை ஏற்பட்டது. அதற்கு பதிலாக {{email}} க்கு மின்னஞ்சல் செய்யவும்.

# models.resultPending.name
source: Result Pending
ta: முடிவு நிலுவையில் உள்ளது

# models.sensorObservationService.procedure
source: Procedure
ta: செயல்முறை

# models.sensorObservationService.property
source: Property
ta: சொத்து

# models.sensorObservationService.sos
source: SOS
ta: சோச்

# models.sensorObservationService.alreadyLoadingTitle
source: Data already loading
ta: தரவு ஏற்கனவே ஏற்றுகிறது

# models.sensorObservationService.alreadyLoadingMessage
source: Your data is still loading. You will be able to change the display once it has loaded
ta: உங்கள் தரவு இன்னும் ஏற்றப்படுகிறது. காட்சியை ஏற்றியவுடன் அதை மாற்ற முடியும்

# models.sensorObservationService.unknownError
source: The server reported an unknown error.
ta: சேவையகம் அறியப்படாத பிழையைப் புகாரளித்தது.

# models.sensorObservationService.exceptionMessage
source: The server reported an error: {{exceptionText}}
ta: சேவையகம் ஒரு பிழையைப் புகாரளித்தது: {{exceptionText}}}

# models.sensorObservationService.missingBody
source: The server responded with missing body.
ta: காணாமல் போன உடலுடன் சேவையகம் பதிலளித்தது.

# models.sensorObservationService.noFeatures
source: There are no features matching your query.
ta: உங்கள் வினவலுடன் பொருந்தக்கூடிய நற்பொருத்தங்கள் எதுவும் இல்லை.

# models.sensorObservationService.unknownFormat
source: The server responded with an unknown feature format.
ta: சேவையகம் அறியப்படாத அம்ச வடிவத்துடன் பதிலளித்தது.

# models.sensorObservationService.noMatchingFeatures
source: The Sensor Observation Service did not return any features matching your query.
ta: சென்சார் கண்காணிப்பு பணி உங்கள் வினவலுடன் பொருந்தக்கூடிய எந்த அம்சங்களையும் திருப்பித் தரவில்லை.

# models.openDataSoft.viewDatasetPage
source: View dataset page
ta: தரவுத்தொகுப்பு பக்கத்தைக் காண்க

# models.sdmxServerStratum.sdmxStructureLoadErrorTitle
source: SDMX structure request failed
ta: எச்.டி.எம்.எக்ச் கட்டமைப்பு கோரிக்கை தோல்வியடைந்தது

# models.sdmxServerStratum.loadDataErrorTitle
source: Failed to load SDMX group
ta: SDMX குழுவை ஏற்றுவதில் தோல்வி

# models.sdmxServerStratum.loadDataErrorMessage
source: The server has no dataflows
ta: சேவையகத்திற்கு தரவு பாய்ச்சல்கள் இல்லை

# models.sdmxJsonDataflowStratum.loadDataErrorTitle
source: Could not load SDMX dataflow
ta: SDMX DATAFLOW ஐ ஏற்ற முடியவில்லை

# models.sdmxJsonDataflowStratum.loadDataErrorMessage.invalidResponse
source: Invalid JSON object
ta: தவறான சாதொபொகு பொருள்

# models.sdmxJsonDataflowStratum.loadDataErrorMessage.noDatastructure
source: No data structures could be found for dataflow {{catalogItem.dataflowId}}
ta: டேட்டாஃப்ளோவுக்கு தரவு கட்டமைப்புகள் எதுவும் காணப்படவில்லை {{catalogItem.dataflowId}}

# models.sdmxJsonDataflowStratum.loadDataErrorMessage.noDataflow
source: Dataflow {{catalogItem.dataflowId}} is invalid
ta: டேட்டாஃப்ளோ {{catalogItem.dataflowId}} தவறானது

# models.sdmxJsonDataflowStratum.defaultUnitMeasure
source: Units
ta: அலகுகள்

# models.sdmxCatalogItem.viewBy.title
source: View by
ta: மூலம் காண்க

# models.sdmxCatalogItem.viewBy.time
source: Time-series
ta: நேர-தொடர்

# models.sdmxCatalogItem.viewBy.region
source: Region
ta: பகுதி

# models.sdmxCatalogItem.loadDataErrorTitle
source: Failed to load SDMX data for {{name}}
ta: {{name}} க்கான SDMX தரவை ஏற்றுவதில் தோல்வி

# models.sdmxCatalogItem.loadDataErrorMessage
source: Invalid response from {{csvUrl}}
ta: {{csvUrl}} இலிருந்து தவறான பதில்

# models.sdmxCatalogItem.noResultsWithDimensions
source: No results have been found. Please select different dimension values in the workbench than the following: {{dimensions}}
ta: முடிவுகள் எதுவும் கிடைக்கவில்லை. பின்வருவனவற்றைக் காட்டிலும் பணிப்பெண்ணில் வெவ்வேறு பரிமாண மதிப்புகளைத் தேர்ந்தெடுக்கவும்: {{dimensions}}

# models.time.invalidDate
source: Invalid Date
ta: தவறான தேதி

# models.time.invalidInitialTimeSource
source: Invalid initialTimeSource specified in config file: {{initialTimeSource}}
ta: கட்டமைப்பு கோப்பில் குறிப்பிடப்பட்டுள்ள தவறான துவக்க நேரங்கள்: {{initialTimeSource}}

# models.shareData.generateErrorTitle
source: Couldn't generate short URL.
ta: குறுகிய முகவரி ஐ உருவாக்க முடியவில்லை.

# models.shareData.generateErrorMessage
source: Something went wrong when trying to use the share data service to generate a short URL.
ta: குறுகிய முகவரி ஐ உருவாக்க பங்கு தரவு சேவையைப் பயன்படுத்த முயற்சிக்கும்போது ஏதோ தவறு ஏற்பட்டது.

# models.shareData.generateErrorDataExceedsLimitMessage
source: Error: Share data exceeds limit
ta: பிழை: பகிர்வு தரவு வரம்பை மீறுகிறது

# models.shareData.expandErrorTitle
source: Couldn't expand URL
ta: முகவரி ஐ விரிவாக்க முடியவில்லை

# models.shareData.expandErrorMessage
source: The share data service used to launch {{appName}} was not located. This may indicate an error in the link or that the service is unavailable at this time.
ta: {{appName}} ஐ அறிமுகப்படுத்தப் பயன்படுத்தப்படும் பகிர்வுத் தரவுப் பணி இல்லை. இது இணைப்பில் ஒரு பிழையைக் குறிக்கலாம் அல்லது இந்த நேரத்தில் பணி கிடைக்கவில்லை.

# models.socrataServer.name
source: Socrata Server
ta: சொக்ராட்டா சேவையகம்

# models.socrataServer.retrieveErrorMessage
source: Couldn't retrieve packages from this Socrata server.
ta: இந்த சாக்ராட்டா சேவையகத்திலிருந்து தொகுப்புகளை மீட்டெடுக்க முடியவில்லை.

# models.socrataServer.description
source: Description
ta: விவரம்

# models.socrataServer.licence
source: Licence
ta: உரிமம்

# models.socrataServer.attributes
source: Attributes
ta: பண்புக்கூறுகள்

# models.socrataServer.tags
source: Tags
ta: குறிச்சொற்கள்

# models.spatialDetailing.name
source: Spatial Detailing
ta: இடஞ்சார்ந்த விவரம்

# models.spatialDetailing.description
source: Predicts the characteristics of fine-grained regions by learning and exploiting correlations of coarse-grained data with Census characteristics.
ta: மக்கள் தொகை கணக்கெடுப்பு பண்புகளுடன் கரடுமுரடான தரவுகளின் தொடர்புகளைக் கற்றுக்கொள்வதன் மூலமும் சுரண்டுவதன் மூலமும் நேர்த்தியான பகுதிகளின் பண்புகளை முன்னறிவிக்கிறது.

# models.spatialDetailing.regionTypeToPredictName
source: Region Type to Predict
ta: கணிக்க பகுதி வகை

# models.spatialDetailing.regionTypeToPredictDescription
source: The type of region for which to predict characteristics.
ta: பண்புகளை கணிக்க வேண்டிய பகுதி வகை.

# models.spatialDetailing.coarseDataRegionTypeName
source: Coarse Data Region Type
ta: கரடுமுரடான தரவு பிராந்திய வகை

# models.spatialDetailing.coarseDataRegionTypeDescription
source: The type of region with which the coarse-grained input characteristics are associated.
ta: கரடுமுரடான உள்ளீட்டு பண்புகள் தொடர்புடைய பகுதியின் வகை.

# models.spatialDetailing.aggregationName
source: Aggregation
ta: திரள்வு

# models.spatialDetailing.aggregationDescription
source: Specifies how coarse region values were aggregated. True if the value is the mean of the values across the region, or False if the value is the sum of the values across the region.
ta: கரடுமுரடான பிராந்திய மதிப்புகள் எவ்வாறு திரட்டப்பட்டன என்பதைக் குறிப்பிடுகிறது. மதிப்பு என்பது பிராந்தியத்தில் உள்ள மதிப்புகளின் சராசரி என்றால், அல்லது மதிப்பு என்பது பிராந்தியத்தில் உள்ள மதிப்புகளின் கூட்டுத்தொகையாக இருந்தால் தவறானது.

# models.spatialDetailing.aggregationTrueName
source: Mean Aggregation
ta: சராசரி திரட்டல்

# models.spatialDetailing.aggregationTrueDescription
source: Coarse region values are the mean of samples in the region. For example, average household income.
ta: கரடுமுரடான பிராந்திய மதிப்புகள் பிராந்தியத்தில் உள்ள மாதிரிகளின் சராசரி. எடுத்துக்காட்டாக, சராசரி வீட்டு வருமானம்.

# models.spatialDetailing.aggregationFalseName
source: Sum Aggregation
ta: தொகை திரட்டல்

# models.spatialDetailing.aggregationFalseDescription
source: Coarse region values are the sum of samples in the region. For example, total population.
ta: கரடுமுரடான பிராந்திய மதிப்புகள் பிராந்தியத்தில் உள்ள மாதிரிகளின் கூட்டுத்தொகையாகும். உதாரணமாக, மொத்த மக்கள் தொகை.

# models.spatialDetailing.characteristicToPredictName
source: Characteristic to Predict
ta: கணிக்க சிறப்பியல்பு

# models.spatialDetailing.characteristicToPredictDescription
source: The characteristic to predict for each region.
ta: ஒவ்வொரு பிராந்தியத்திற்கும் கணிக்க வேண்டிய பண்பு.

# models.spatialDetailing.spatialDetailingOf
source: Spatial detailing of {{of}} at {{at}}
ta: {{of}} இன் இடஞ்சார்ந்த விவரம் {{at}} இல்

# models.spatialDetailing.wrongNumberOfElements
source: The list of values and the list of region codes do not contain the same number of elements
ta: மதிப்புகளின் பட்டியல் மற்றும் பிராந்திய குறியீடுகளின் பட்டியலில் ஒரே எண்ணிக்கையிலான கூறுகள் இல்லை

# models.tableData.noData
source: No data to show
ta: காட்ட தரவு இல்லை

# models.tableData.unsupportedCharactersTitle
source: Invalid characters in latitude and longitude columns
ta: அட்சரேகை மற்றும் தீர்க்கரேகை நெடுவரிசைகளில் தவறான எழுத்துக்கள்

# models.tableData.unsupportedCharactersMessage
source: Could not interpret latitude and longitude pair {{longitude}}, {{latitude}}
ta: அட்சரேகை மற்றும் தீர்க்கரேகை இணை {{longitude}}, {{latitude}} விளக்க முடியவில்லை

# models.tableData.bulkGeocoderInfoTitle
source: Bulk Geocoder Information
ta: மொத்த சியோகோடர் செய்தி

# models.tableData.bulkGeocoderInfoMessage
source: The CSV contains addresses, but {{number}} can't be located on the map:
ta: காபிம இல் முகவரிகள் உள்ளன, ஆனால் {{number}} வரைபடத்தில் இருக்க முடியாது:

# models.tableData.bulkGeocoderInfo2Message
source: {{nullAddresses}} addresses are missing from the CSV.
ta: {{nullAddresses}} முகவரிகள் காபிம இலிருந்து இல்லை.

# models.tableData.bulkGeocoderErrorTitle
source: Bulk Geocoder Error
ta: மொத்த சியோகோடர் பிழை

# models.tableData.bulkGeocoderErrorMessage
source: Unable to map addresses to lat-long coordinates, as an error occurred while retrieving address coordinates. Please check your internet connection or try again later.
ta: முகவரி ஆயங்களை மீட்டெடுக்கும் போது பிழை ஏற்பட்டதால், லாட்-லாங் ஆயத்தொகுதிகளுக்கு முகவரிகளை வரைபடமாக்க முடியவில்லை. உங்கள் இணைய இணைப்பைச் சரிபார்க்கவும் அல்லது பின்னர் மீண்டும் முயற்சிக்கவும்.

# models.tableData.legendZFilterLabel
source: Extreme values
ta: தீவிர மதிப்புகள்

# models.tableData.legendNullLabel
source: (No value)
ta: (மதிப்பு இல்லை)

# models.tableData.activeStyle
source: Display Variable
ta: காட்சி மாறி

# models.tableData.styleDisabledLabel
source: Disable style
ta: பாணியை முடக்கு

# models.tableData.zFilterEnabled
source: Extreme values hidden (click to show)
ta: தீவிர மதிப்புகள் மறைக்கப்பட்டுள்ளன (காட்ட சொடுக்கு செய்க)

# models.tableData.zFilterDisabled
source: Extreme values detected (click to hide)
ta: தீவிர மதிப்புகள் கண்டறியப்பட்டன (மறைக்க சொடுக்கு செய்க)

# models.tableData.timeDimensionEnabled
source: Time enabled (click to disable)
ta: நேரம் இயக்கப்பட்டது (முடக்க சொடுக்கு செய்க)

# models.tableData.timeDimensionDisabled
source: Time disabled (click to enable)
ta: நேரம் முடக்கப்பட்டது (இயக்க சொடுக்கு செய்க)

# models.tableData.editStyle
source: Edit Style
ta: பாணி திருத்து

# models.tableData.custom
source: Custom
ta: தனிப்பயன்

# models.tableData.regionMapping
source: Region Mapping
ta: பகுதி மேப்பிங்

# models.tableData.regionColumn
source: Region Column
ta: பகுதி நெடுவரிசை

# models.tableData.manualRegionMapping
source: Manual Region Mapping
ta: கையேடு பகுதி மேப்பிங்

# models.terrainCatalog.notSupportedErrorTitle
source: Not supported in 2D
ta: 2D இல் ஆதரிக்கப்படவில்லை

# models.terrainCatalog.notSupportedErrorMessage
source: {{name}} cannot be shown in the 2D view. Switch to 3D and try again
ta: {{name}} 2d பார்வையில் காட்ட முடியாது. 3D க்கு மாறி மீண்டும் முயற்சிக்கவும்

# models.terria.loadConfigErrorTitle
source: Failed to load Terria Map config
ta: டெரியா வரைபட கட்டமைப்பை ஏற்றுவதில் தோல்வி

# models.terria.proxyableDomainsDeprecation
source: `proxyableDomainsUrl` is no longer supported in v8
ta: `proxyabledomainsurl` இனி V8 இல் ஆதரிக்கப்படாது

# models.terria.initErrorTitle
source: Failed to initialize services
ta: சேவைகளைத் தொடங்கத் தவறிவிட்டது

# models.terria.initErrorMessage
source: A problem occurred with the Terria server. This may cause some layers or the conversion service to be unavailable.
ta: டெரியா சேவையகத்தில் ஒரு சிக்கல் ஏற்பட்டது. இது சில அடுக்குகள் அல்லது மாற்று பணி கிடைக்காமல் போகலாம்.

# models.terria.urlLoadErrorTitle
source: Problem loading URL
ta: முகவரி ஐ ஏற்றுவதில் சிக்கல்

# models.terria.urlLoadErrorMessage
source: A problem occurred while initialising Terria with URL parameters.
ta: முகவரி அளவுருக்களுடன் டெரியாவை தொடங்கும்போது ஒரு சிக்கல் ஏற்பட்டது.

# models.terria.loadModelErrorMessage
source: An error occurred while loading model `{{model}}`.
ta: மாதிரியை ஏற்றும்போது பிழை ஏற்பட்டது `{{model}}`.

# models.terria.loadingMagdaInitSourceErrorTitle
source: Error loading Magda initialization source
ta: மாக்டா துவக்க மூலத்தை ஏற்றுவது பிழை

# models.terria.loadingMagdaInitSourceErrorMessage
source: An error occurred while loading initialization information from Magda record `{{url}}`.
ta: MAGDA பதிவிலிருந்து துவக்க தகவலை ஏற்றும்போது பிழை ஏற்பட்டது `{{url}}`.

# models.terria.loadingInitSourcesErrorTitle
source: Error loading map configuration
ta: வரைபட உள்ளமைவை ஏற்றுவதில் பிழை

# models.terria.loadingInitSourcesErrorMessage
source: An error occurred while loading {{appName}} map configuration &mdash; it may not display correctly. Please try reloading the map, and if the problem persists, please report it by sending an email to {{email}}, or you can press the button below.
ta: {{appName}} வரைபட உள்ளமைவு &mdash; இது சரியாகக் காட்டப்படாமல் போகலாம். தயவுசெய்து வரைபடத்தை மீண்டும் ஏற்ற முயற்சிக்கவும், சிக்கல் தொடர்ந்தால், தயவுசெய்து {{email}} க்கு மின்னஞ்சல் அனுப்புவதன் மூலம் அதைப் புகாரளிக்கவும் அல்லது கீழே உள்ள பொத்தானை அழுத்தலாம்.

# models.terria.loadingInitSourceErrorTitle
source: Error loading initialization source
ta: துவக்க மூலத்தை ஏற்றுதல்

# models.terria.loadingInitSourceErrorMessage
source: Could not load initialization information from `{{fragment}}` because no initFragmentPaths are defined.
ta: துவக்க தகவல்களை `{{fragment}} இருந்து இலிருந்து ஏற்ற முடியவில்லை, ஏனெனில் initfragmentpaths எதுவும் வரையறுக்கப்படவில்லை.

# models.terria.loadingInitSourceError2Message
source: An error occurred while loading initialization information from: *`{{loadSource}}`*.
ta: துவக்க தகவல்களை ஏற்றும்போது பிழை ஏற்பட்டது: *`{{loadSource}}`*.

# models.terria.loadingInitJsonMessage
source: An error occurred while loading JSON file {{url}}.
ta: சாதொபொகு கோப்பை ஏற்றும்போது பிழை ஏற்பட்டது {{url}}.

# models.terria.loadingBaseMapsErrorTitle
source: Error loading basemaps
ta: BASEMAPS ஐ ஏற்றுவதில் பிழை

# models.terria.loadingBaseMapErrorTitle
source: Error loading basemap: `{{name}}`
ta: BASEMAP ஐ ஏற்றுவதில் பிழை: `{{name}}`

# models.terria.loadingShareDataErrorTitle
source: Error loading share data
ta: பகிர்வு தரவை ஏற்றுவதில் பிழை

# models.terria.parsingStartDataErrorMessage
source: An error occurred while parsing start data JSON.
ta: தொடக்க தரவு சாதொபொகு ஐ பாகுபடுத்தும்போது பிழை ஏற்பட்டது.

# models.terria.loadingWorkbenchItemErrorTitle
source: Error loading item in workbench: `{{name}}`
ta: வொர்க் பெஞ்சில் உருப்படியை ஏற்றுவதில் பிழை: `{{name}}`

# models.terria.disclaimer
source: Disclaimer
ta: மறுப்பு

# models.terria.buttonTitleConfirm
source: I Agree
ta: நான் ஒப்புக்கொள்கிறேன்

# models.terriaJSONcatalog.name
source: Terria JSON Catalog Function
ta: டெரியா சாதொபொகு பட்டியல் செயல்பாடு

# models.terriaJSONcatalog.misconfiguredErrorTitle
source: Misconfigured init file
ta: தவறாக கட்டமைக்கப்பட்ட init கோப்பு

# models.terriaJSONcatalog.misconfiguredErrorMessage
source: Service not configured for TerriaJsonCatalogFunction HTTP 202.
ta: டெர்ரியாச்சோன்காடலாக்ஃபங்க்சன் http 202 க்கு பணி கட்டமைக்கப்படவில்லை.

# models.terriaJSONcatalog.misconfiguredError2Message
source: HTTP 202 configuration {{url}} not present in response {{xhr}}
ta: Http 202 உள்ளமைவு {{url}} பதிலில் இல்லை {{xhr}}

# models.terriaJSONcatalog.serviceResponseErrorTitle
source: Service response not JSON string
ta: பணி பதில் சாதொபொகு சரம் அல்ல

# models.terriaJSONcatalog.serviceResponseErrorMessage
source: TerriaJsonCatalogFunction was supposed to receive a JSON string, received {{xhr}}
ta: டெர்ரியாச்சோன்காடலாக்ஃபங்க்சன் ஒரு சாதொபொகு சரம் பெற வேண்டும், பெறப்பட்டது {{xhr}}}

# models.terriaJSONcatalog.requestFailedTitle
source: Request Failed
ta: கோரிக்கை தோல்வியடைந்தது

# models.terriaJSONcatalog.requestFailedMessage
source: Request failed with status code {{status}}.
ta: நிலை குறியீடு {{status}} உடன் கோரிக்கை தோல்வியடைந்தது.

# models.terriaJSONcatalog.asyncResultDescription
source: This is the result of invoking the {{name}} process or service at {{timestamp}} with the input parameters below.
ta: இது கீழே உள்ள உள்ளீட்டு அளவுருக்களுடன் {{timestamp}} இல் {{name}} செயல்முறை அல்லது சேவையைச் செயல்படுத்துவதன் விளைவாகும்.

# models.terriaJSONcatalog.loadingInitSourceErrorTitle
source: Error loading initialization source
ta: துவக்க மூலத்தை ஏற்றுதல்

# models.terriaJSONcatalog.loadingInitSourceErrorMessage
source: Error loading initialization source {{fragment}} because no initFragmentPaths are defined.
ta: பிழை ஏற்றுதல் துவக்க மூல {{fragment}} ஏனெனில் initfragmentpaths எதுவும் வரையறுக்கப்படவில்லை.

# models.terriaJSONcatalog.loadingInitSourceError2Message
source: An error occurred while loading initialization information from: *`{{loadSource}}`*.
ta: துவக்க தகவல்களை ஏற்றும்போது பிழை ஏற்பட்டது: *`{{loadSource}}`*.

# models.terriaJSONcatalog.disclaimer
source: Disclaimer
ta: மறுப்பு

# models.terriaJSONcatalog.buttonTitleConfirm
source: I Agree
ta: நான் ஒப்புக்கொள்கிறேன்

# models.thredds.nameGroup
source: THREDDS Catalog Group
ta: த்ரெட்ச் பட்டியல் குழு

# models.threddsItem.name
source: THREDDS Item Reference
ta: TREDDS உருப்படி குறிப்பு

# models.urlTemplateMapServer.name
source: URL Template Map Server
ta: முகவரி வார்ப்புரு வரைபட சேவையகம்

# models.userDrawing.devError
source: Terria instance is required.
ta: டெரியா நிகழ்வு தேவை.
