Repository: 247i/TACETr
Catalog: உரை/வெறுமை/thextech-engine-general-*.po
Languages: ta

# editor.block.canBreak
source: Can Break
ta: உடைக்க முடியும்

# editor.block.canBreakTooltip
source: Legacy: breaks when hit
ta: மரபு: அடிக்கும்போது உடைகிறது

# editor.block.inside
source: Inside:
ta: உள்ளே:

# editor.block.invis
source: Invis
ta: இன்விச்

# editor.block.letterHeight
source: H
ta: ம

# editor.block.pickContents
source: Pick block contents
ta: தொகுதி உள்ளடக்கங்களைத் தேர்ந்தெடுங்கள்

# editor.block.slick
source: Slick
ta: மென்மையாய்

# editor.browser.askOverwriteFile
source: Overwrite {0}?
ta: மேலெழுதும் {0}?

# editor.browser.itemNewFile
source: <New File>
ta: <புதிய கோப்பு>

# editor.browser.itemNewFolder
source: <New Folder>
ta: <புதிய கோப்புறை>

# editor.browser.newFile
source: New file
ta: புதிய கோப்பு

# editor.browser.openFile
source: Open file
ta: கோப்பை திற

# editor.browser.saveFile
source: Save file
ta: கோப்பை சேமி

# editor.events.bounds.changeAllSectionBoundsToCurrent
source: Change all sect bounds to current?
ta: அனைத்து பிரிவு வரம்புகளையும் மின்னோட்டத்திற்கு மாற்றவா?

# editor.events.bounds.changeSectionBoundsToCurrent
source: Change sect {0} bounds to current?
ta: பிரிவு {0} வரம்புகளை மின்னோட்டத்திற்கு மாற்றவா?

# editor.events.bounds.shouldEvent
source: Should Event {0}
ta: நிகழ்வு {0}

# editor.events.controlsForEventN
source: Controls for event {0}
ta: நிகழ்வுக்கான கட்டுப்பாடுகள் {0}

# editor.events.deletion.cancel
source: No: do not delete event
ta: இல்லை: நிகழ்வை நீக்க வேண்டாம்

# editor.events.deletion.confirm
source: Yes: delete event
ta: ஆம்: நிகழ்வை நீக்கு

# editor.events.deletion.deletingEvent
source: Deleting event {0}
ta: நிகழ்வை நீக்குதல் {0}

# editor.events.desc.activate
source: NPC enters the screen
ta: NPC திரையில் நுழைகிறது

# editor.events.desc.death
source: NPC dies
ta: NPC இறந்துவிடுகிறது

# editor.events.desc.destroy
source: block is destroyed
ta: தொகுதி அழிக்கப்படுகிறது

# editor.events.desc.enter
source: warp is entered
ta: வார்ப் நுழைந்தது

# editor.events.desc.hit
source: block is hit
ta: தொகுதி செய் பெறுகிறது

# editor.events.desc.layerClear
source: everything in object layer is gone
ta: பொருள் அடுக்கில் உள்ள அனைத்தும் போய்விட்டன

# editor.events.desc.phraseTriggersAfterTemplate
source: {0} triggers {1} ms after event {2} occurs
ta: {0} தூண்டுதல்கள் {1} எம்.எச். நிகழ்வுக்குப் பிறகு {2} நிகழ்கிறது

# editor.events.desc.phraseTriggersWhenTemplate
source: {0} triggers when {1}
ta: {0} {1} போது தூண்டுகிறது

# editor.events.desc.talk
source: player talks to NPC
ta: வீரர் NPC உடன் பேசுகிறார்

# editor.events.header
source: Events:
ta: நிகழ்வுகள்:

# editor.events.headerTriggerEvent
source: Trigger:
ta: தூண்டுதல்:

# editor.events.itemNewEvent
source: <New Event>
ta: <புதிய நிகழ்வு>

# editor.events.label.activate
source: Activate
ta: செயல்படுத்து

# editor.events.label.death
source: Death
ta: இறப்பு

# editor.events.label.destroy
source: Destroy
ta: அழிக்கவும்

# editor.events.label.enter
source: Enter
ta: உள்ளிடவும்

# editor.events.label.hit
source: Hit
ta: செய்

# editor.events.label.layerClear
source: Layer Clear
ta: அடுக்கு தெளிவாக

# editor.events.label.next
source: Next
ta: அடுத்தது

# editor.events.label.talk
source: Talk
ta: பேச்சு

# editor.events.layers.headerHide
source: Hide:
ta: மறை:

# editor.events.layers.headerMove
source: Move:
ta: நகர்த்து:

# editor.events.layers.headerShow
source: Show:
ta: காட்டு:

# editor.events.layers.headerToggle
source: Toggle:
ta: தடுமாறுங்கள்:

# editor.events.letter.activate
source: A:
ta: அ:

# editor.events.letter.enter
source: E:
ta: இ:

# editor.events.letter.layerClear
source: L:
ta: எல்:

# editor.events.letter.talk
source: T:
ta: டி:

# editor.events.promptEventName
source: Event name
ta: நிகழ்வு பெயர்

# editor.events.promptEventText
source: Event text
ta: நிகழ்வு உரை

# editor.events.props.autostart
source: Autostart
ta: ஆட்டோச்டார்ட்

# editor.events.props.controls
source: Controls
ta: கட்டுப்பாடுகள்

# editor.events.props.endGame
source: End Game
ta: இறுதி விளையாட்டு

# editor.events.props.layerSmoke
source: Smoke
ta: புகை

# editor.events.props.sound
source: Sound
ta: ஒலி

# editor.events.sections.actionKeep
source: Keep
ta: வைத்திருங்கள்

# editor.events.sections.actionReset
source: Reset
ta: மீட்டமை

# editor.events.sections.actionSet
source: Set
ta: கணம்

# editor.events.sections.phraseAllSections
source: All Sections
ta: அனைத்து பிரிவுகளும்

# editor.events.sections.propBackground
source: BG
ta: பி.சி.

# editor.events.sections.propBounds
source: Bounds
ta: எல்லைகள்

# editor.events.sections.propMusic
source: Music
ta: இசை

# editor.events.settingsForEvent
source: Settings for event {0}
ta: நிகழ்வுக்கான அமைப்புகள் {0}

# editor.file.actionClearLevel
source: Clear Level
ta: தெளிவான நிலை

# editor.file.actionClearWorld
source: Clear World
ta: உலகத்தை அழிக்கவும்

# editor.file.actionExit
source: Exit
ta: வெளியேறு

# editor.file.actionOpen
source: Open
ta: திற

# editor.file.actionRevert
source: Revert
ta: மாற்றியமைக்கவும்

# editor.file.commandNew
source: New
ta: புதிய

# editor.file.commandOpen
source: Open...
ta: திறந்த ...

# editor.file.commandSave
source: Save
ta: சேமி

# editor.file.commandSaveAs
source: Save as...
ta: சேமி ...

# editor.file.confirmConfirmAction
source: Are you sure you want to {0}?
ta: நீங்கள் நிச்சயமாக {0} செய்ய விரும்புகிறீர்களா?

# editor.file.confirmConvertFormatTo
source: Convert format to {0}?
ta: வடிவத்தை {0 க்கு ஆக மாற்றவா?

# editor.file.confirmSaveBeforeAction
source: Save before you {0}?
ta: உங்களுக்கு முன் சேமிக்கவும் {0}?

# editor.file.convert.descNew
source: The file extension will change but the old file will NOT be deleted. Please check for lost features after saving.
ta: கோப்பு நீட்டிப்பு மாறும், ஆனால் பழைய கோப்பு நீக்கப்படாது. சேமித்த பிறகு இழந்த அம்சங்களை சரிபார்க்கவும்.

# editor.file.formatLegacy
source: Legacy
ta: மரபு

# editor.file.formatModern
source: Modern
ta: நவீன

# editor.file.labelCurrentFile
source: Current file:
ta: தற்போதைய கோப்பு:

# editor.file.labelFormat
source: Format:
ta: வடிவம்:

# editor.file.optionActionWithoutSave
source: {0} without saving
ta: {0} சேமிக்காமல்

# editor.file.optionCancelAction
source: Cancel: do not {0}
ta: ரத்துசெய்: {0} வேண்டாம்

# editor.file.optionCancelConversion
source: Cancel conversion
ta: மாற்றத்தை ரத்துசெய்

# editor.file.optionProceedWithConversion
source: Proceed with conversion
ta: மாற்றத்துடன் தொடரவும்

# editor.file.optionYesSaveThenAction
source: Yes: save then {0}
ta: ஆம்: சேமி {0}

# editor.file.sectionLevel
source: Level
ta: நிலை

# editor.file.sectionWorld
source: World
ta: உலகம்

# editor.labelSortLayer
source: Sort Layer:
ta: வரிசை அடுக்கு:

# editor.labelSortOffset
source: Sort Offset:
ta: வரிசைப்படுத்தல் ஆஃப்செட்:

# editor.layers.abbrevAttLayer
source: Att:
ta: க்கு:

# editor.layers.default
source: Default
ta: இயல்புநிலை

# editor.layers.deletion.cancel
source: Cancel: do not delete layer
ta: ரத்துசெய்: அடுக்கை நீக்க வேண்டாம்

# editor.layers.deletion.confirmDelete
source: No: *DELETE ALL CONTENTS*
ta: இல்லை: *எல்லா உள்ளடக்கங்களையும் நீக்கு *

# editor.layers.deletion.confirmPreserve
source: Yes: move to default layer
ta: ஆம்: இயல்புநிலை அடுக்குக்கு நகர்த்தவும்

# editor.layers.deletion.header
source: Deleting layer {0}
ta: அடுக்கு நீக்குதல் {0}

# editor.layers.deletion.preserveLayerContents
source: Preserve layer contents?
ta: அடுக்கு உள்ளடக்கங்களைப் பாதுகாக்கவா?

# editor.layers.desc.att
source: Whenever the NPC moves, the attached layer moves following it
ta: NPC நகரும் போதெல்லாம், இணைக்கப்பட்ட அடுக்கு அதைப் பின்பற்றுகிறது

# editor.layers.header
source: Layers:
ta: அடுக்குகள்:

# editor.layers.itemNewLayer
source: <New Layer>
ta: <புதிய அடுக்கு>

# editor.layers.label
source: Layer:
ta: அடுக்கு:

# editor.layers.labelAttached
source: Attached:
ta: இணைக்கப்பட்டுள்ளது:

# editor.layers.labelAttachedLayer
source: Attached Layer:
ta: இணைக்கப்பட்ட அடுக்கு:

# editor.layers.labelMoveLayer
source: Move Layer:
ta: அடுக்கை நகர்த்தவும்:

# editor.layers.promptLayerName
source: Layer name
ta: அடுக்கு பெயர்

# editor.letterCoordX
source: X
ta: ஃச்

# editor.letterCoordY
source: Y
ta: ஒய்

# editor.letterDown
source: D
ta: டி

# editor.letterLeft
source: L
ta: எல்

# editor.letterUp
source: U
ta: உ

# editor.level.alwaysVis
source: Always Vis
ta: எப்போதும் பார்வையிடவும்

# editor.level.bigBG
source: Big BG
ta: பெரிய பி.சி.

# editor.level.gameStart
source: Game Start
ta: விளையாட்டு தொடக்க

# editor.level.levelName
source: Level Name
ta: நிலை பெயர்

# editor.level.pathBG
source: Path BG
ta: பாதை பி.சி.

# editor.level.pathUnlocks
source: Path Unlocks
ta: பாதை திறத்தல்

# editor.level.startPos
source: Start Pos
ta: POS ஐத் தொடங்குங்கள்

# editor.mapPos
source: Map Pos:
ta: வரைபடம் போச்:

# editor.npc.abbrevGen
source: Gen
ta: கென்

# editor.npc.ai.LR
source: LR
ta: எல்.ஆர்

# editor.npc.ai.headerCustomAi
source: Custom AI:
ta: தனிப்பயன் AI:

# editor.npc.ai.jump
source: Jump
ta: தாவு

# editor.npc.ai.leap
source: Leap
ta: பாய்ச்சல்

# editor.npc.ai.swim
source: Swim
ta: நீச்சல்

# editor.npc.ai.target
source: Target
ta: இலக்கு

# editor.npc.ai.use1_0Ai
source: Use 1.0 AI?
ta: 1.0 பயன்படுத்தவா?

# editor.npc.gen.direction
source: Direction
ta: திசை

# editor.npc.gen.effectIs
source: Effect: {0}
ta: விளைவு: {0}

# editor.npc.gen.effectShoot
source: Shoot
ta: தண்டுக் கிளை

# editor.npc.gen.effectWarp
source: Warp
ta: வார்ப்

# editor.npc.gen.header
source: Generator Settings
ta: செனரேட்டர் அமைப்புகள்

# editor.npc.inContainer
source: In
ta: இல்

# editor.npc.inertNice
source: Nice
ta: நல்லது

# editor.npc.props.active
source: Active
ta: செயலில்

# editor.npc.props.attachSurface
source: Attach
ta: இணைக்கவும்

# editor.npc.props.facing
source: Facing
ta: எதிர்கொள்ளும்

# editor.npc.stuckStop
source: Stop
ta: நிறுத்து

# editor.npc.tooltipExpandSection
source: Expand section
ta: பிரிவு விரிவாக்க

# editor.pageBlankOfBlank
source: Page {0} of {1}
ta: {1 of இன் பக்கம் {0}

# editor.phraseAreYouSure
source: Are you sure?
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா?

# editor.phraseCountMore
source: {0} More
ta: {0} மேலும்

# editor.phraseDelayIsMs
source: Delay: {0} ms
ta: தாமதம்: {0} எம்.எச்

# editor.phraseGenericIndex
source: Number {0}
ta: எண் {0}

# editor.phraseRadiusIndex
source: Radius {0}
ta: ஆரம் {0}

# editor.phraseSectionIndex
source: Section {0}
ta: பிரிவு {0}

# editor.phraseTextOf
source: {0} Text
ta: {0} உரை

# editor.phraseWarpIndex
source: Warp {0}
ta: வார்ப் {0}

# editor.section.horizWrap
source: Horiz. Wrap
ta: மஞ்சள். மடக்கு

# editor.section.vertWrap
source: Vert. Wrap
ta: வெர்ட். மடக்கு

# editor.section.noTurnBack
source: No Turn Back
ta: திரும்பவில்லை

# editor.section.offscreenExit
source: Offscreen Exit
ta: ஆஃப்ச்கிரீன் வெளியேறுதல்

# editor.section.scroll
source: Scroll
ta: சுருள்

# editor.section.setBounds
source: Set Bounds
ta: எல்லைகளை அமைக்கவும்

# editor.section.underwater
source: Underwater
ta: நீருக்கடியில்

# editor.select.allSectPropBlankForEventN
source: All Sect {0} for {1}
ta: {1 க்கு க்கு அனைத்து பிரிவு {0}

# editor.select.pathBlankUnlock
source: Path {0} Unlock By
ta: பாதை {0} திறக்கவும்

# editor.select.sectBlankPropBlankForEventN
source: Sect {0} {1} for {2}
ta: {2 க்கு க்கு பிரிவு {0} {1}

# editor.select.sectionBlankPropBlank
source: Section {0} {1}
ta: பிரிவு {0} {1}

# editor.select.soundForEventN
source: Sound for Event {0}
ta: நிகழ்வுக்கான ஒலி {0}

# editor.select.warpTransitEffect
source: Warp Transition Effect
ta: வார்ப் மாற்றம் விளைவு

# editor.select.worldMusic
source: World Music
ta: உலக இசை

# editor.testPlay.boot
source: Boot
ta: துவக்க

# editor.testPlay.char
source: Char
ta: சார்

# editor.testPlay.magicHand
source: Magic Hand
ta: மேசிக் கை

# editor.testPlay.pet
source: Pet
ta: செல்லப்பிள்ளை

# editor.testPlay.power
source: Power
ta: விசை

# editor.toggleMagicBlock
source: Magic Block
ta: மேசிக் தொகுதி

# editor.tooltip.area
source: Area
ta: பகுதி

# editor.tooltip.blocks
source: Blocks
ta: தொகுதிகள்

# editor.tooltip.erase
source: Erase
ta: அழிக்கவும்

# editor.tooltip.eraseAll
source: Erase All
ta: அனைத்தையும் அழிக்கவும்

# editor.tooltip.events
source: Events
ta: நிகழ்வுகள்

# editor.tooltip.file
source: File
ta: கோப்பு

# editor.tooltip.layers
source: Layers
ta: அடுக்குகள்

# editor.tooltip.levels
source: Levels
ta: நிலைகள்

# editor.tooltip.music
source: Music
ta: இசை

# editor.tooltip.paths
source: Paths
ta: பாதைகள்

# editor.tooltip.scenes
source: Scenes
ta: காட்சிகள்

# editor.tooltip.select
source: Select
ta: தேர்ந்தெடு

# editor.tooltip.settings
source: Settings
ta: அமைப்புகள்

# editor.tooltip.show
source: Show
ta: காட்டு

# editor.tooltip.tiles
source: Tiles
ta: ஓடுகள்

# editor.tooltip.warps
source: Warps
ta: வார்ப்ச்

# editor.tooltip.water
source: Water
ta: நீர்

# editor.warp.allow
source: Allow:
ta: அனுமதிக்கவும்:

# editor.warp.cannonExit
source: Cannon Exit
ta: பீரங்கி வெளியேறுதல்

# editor.warp.effect
source: Effect:
ta: விளைவு:

# editor.warp.in
source: In
ta: இல்

# editor.warp.item
source: Item
ta: உருப்படி

# editor.warp.lvlWarp
source: Lvl Warp
ta: எல்விஎல் வார்ப்

# editor.warp.needFloor
source: Need Floor
ta: தளம் தேவை

# editor.warp.needKey
source: Need Key
ta: திறவுகோல் தேவை

# editor.warp.needStarCount
source: Need {0} {1}
ta: {0} {1} தேவை

# editor.warp.out
source: Out
ta: வெளியே

# editor.warp.placing
source: Placing:
ta: வைப்பது:

# editor.warp.ride
source: Ride
ta: சவாரி

# editor.warp.showStarCount
source: Show Star Count
ta: நட்சத்திர எண்ணிக்கையைக் காட்டு

# editor.warp.showStartScene
source: Show Start Scene
ta: தொடக்க காட்சியைக் காட்டு

# editor.warp.speed
source: Speed
ta: விரைவு

# editor.warp.starLockMessage
source: Star lock msg
ta: ச்டார் லாக் எம்.எச்.சி.

# editor.warp.style.blipInstant
source: Blip
ta: தட்டச்சு

# editor.warp.style.door
source: Door
ta: கதவு

# editor.warp.style.pipe
source: Pipe
ta: புழம்பு

# editor.warp.style.portal
source: Port
ta: துறைமுகம்

# editor.warp.style.style
source: Style:
ta: ச்டைல்:

# editor.warp.target
source: Target:
ta: இலக்கு:

# editor.warp.title
source: Warp Settings
ta: வார்ப் அமைப்புகள்

# editor.warp.to
source: To: {0}
ta: க்கு: {0}

# editor.warp.toMap
source: To Map
ta: வரைபடத்திற்கு

# editor.warp.transit.name0
source: NONE
ta: எதுவுமில்லை

# editor.warp.transit.name1
source: SCROLL
ta: சுருள்

# editor.warp.transit.name2
source: FADE
ta: மங்கல்

# editor.warp.transit.name3
source: CIRCLE
ta: வட்டம்

# editor.warp.transit.name4
source: FLIP (H)
ta: (ம) புரட்டல்

# editor.warp.transit.name5
source: FLIP (V)
ta: புரட்டுதல் (வி)

# editor.warp.twoWay
source: Two-Way
ta: இரு வழி

# editor.water.title
source: Water Settings
ta: நீர் அமைப்புகள்

# editor.wordCoins
source: Coins
ta: நாணயங்கள்

# editor.wordEnabled
source: Enabled
ta: இயக்கப்பட்டது

# editor.wordEvent.genitive
source: Event
ta: நிகழ்வு

# editor.wordEvent.nominative
source: Event
ta: நிகழ்வு

# editor.wordEvent.typeLabel
source: {0} Event:
ta: {0} நிகழ்வு:

# editor.wordHeight
source: Height
ta: உயரம்

# editor.wordInstant
source: Instant
ta: உடனடி

# editor.wordMode
source: Mode
ta: பயன்முறை

# editor.wordText
source: Text
ta: உரை

# editor.wordWidth
source: Width
ta: அகலம்

# editor.world.allowChars
source: Allow Chars
ta: எழுத்துக்களை அனுமதிக்கவும்

# editor.world.hubWorld
source: Hub World
ta: மைய உலகம்

# editor.world.introLevel
source: Intro Level
ta: அறிமுக நிலை

# editor.world.name
source: World Name
ta: உலக பெயர்

# editor.world.phraseCreditIndex
source: World Credit Line {0}:
ta: உலக கடன் வரி {0}:

# editor.world.retryOnFail
source: Retry On Fail
ta: தோல்வியுற்றதை மீண்டும் முயற்சிக்கவும்

# editor.world.totalStars
source: Total Stars:
ta: மொத்த நட்சத்திரங்கள்:

# game.connect.dropAddTitle
source: Drop/Add Players
ta: வீரர்களை கைவிடவும்/சேர்க்கவும்

# game.connect.phraseChangeChar
source: Change Char
ta: கரியை மாற்றவும்

# game.connect.phraseDropMe
source: Drop Me
ta: என்னை விடுங்கள்

# game.connect.phraseDropPX
source: Drop P{0}
ta: P ஐ விடுங்கள் p {0}

# game.connect.phraseForceResume
source: Force Resume
ta: படை மீண்டும் தொடங்குகிறது

# game.connect.phraseHoldStart
source: Hold Start
ta: தொடக்கத்தை வைத்திருங்கள்

# game.connect.phrasePressAButton
source: Press A Button
ta: ஒரு பொத்தானை அழுத்தவும்

# game.connect.phraseSetControls
source: Set Controls
ta: கட்டுப்பாடுகளை அமைக்கவும்

# game.connect.phraseStartToForceRes
source: Press Start to Force Resume
ta: விண்ணப்பத்தை கட்டாயப்படுத்தத் தொடங்குங்கள்

# game.connect.phraseStartToResume
source: Press Start to Resume
ta: மீண்டும் தொடங்கத் தொடங்குங்கள்

# game.connect.phraseTestControls
source: Test Controls
ta: சோதனை கட்டுப்பாடுகள்

# game.connect.phraseTestProfile
source: Test Profile
ta: சோதனை சுயவிவரம்

# game.connect.phraseWaitingForInput
source: Waiting for input device...
ta: உள்ளீட்டு சாதனத்திற்காக காத்திருக்கிறது ...

# game.connect.reconnectTitle
source: Reconnect
ta: மீண்டும் இணைக்கவும்

# game.connect.splitPressSelect_1
source: Press Select for
ta: தேர்வு என்பதை அழுத்தவும்

# game.connect.splitPressSelect_2
source: Controls Options
ta: விருப்பங்களை கட்டுப்படுத்துகிறது

# game.connect.wordDisconnect
source: Disconnect
ta: துண்டிக்கவும்

# game.error.errorInvalidEnterWarp
source: Can't start the level because of an invalid entrance warp {1} was specified. Total warp entries: {2} File: {0}
ta: தவறான நுழைவு வார்ப் {1} குறிப்பிடப்பட்டதால் மட்டத்தைத் தொடங்க முடியாது. மொத்த வார்ப் உள்ளீடுகள்: {2} கோப்பு: {0}

# game.error.errorNoStartPoint
source: Can't start the level because of no available start points placed or entrance warp specified. File: {0}
ta: கிடைக்கக்கூடிய தொடக்க புள்ளிகள் அல்லது நுழைவு வார்ப் குறிப்பிடப்படாததால் மட்டத்தைத் தொடங்க முடியாது. கோப்பு: {0}

# game.error.openFileFailed
source: Can't open "{0}": file doesn't exist or corrupted.
ta: "{0}" ஐ திறக்க முடியாது: கோப்பு இல்லை அல்லது சிதைக்கப்படவில்லை.

# game.error.warpNeedStarCount
source: You need {0} {1} to enter.
ta: நுழைய உங்களுக்கு {0} {1} தேவை.

# game.hint.pound-altrun
source: Press Alt Run to pound downwards!
ta: கீழ்நோக்கி பவுண்டுக்கு ஆல்ட் ரன் அழுத்தவும்!

# game.hint.pound-down
source: Press Down to pound downwards!
ta: கீழ்நோக்கி பவுண்டுக்கு கீழே அழுத்தவும்!

# game.hint.no-lives-new
source: No coins left? Take a loan! Just watch your score...
ta: நாணயங்கள் எதுவும் இல்லை? கடன் எடுத்துக் கொள்ளுங்கள்! உங்கள் மதிப்பெண்ணைப் பாருங்கள் ...

# game.hint.no-lives-old
source: Be careful - Game Over is imminent!
ta: கவனமாக இருங்கள் - கேம் ஓவர் உடனடி!

# game.hint.rainbow-surf
source: Grab, run, hold down, and let go to surf.
ta: பிடிக்கவும், ஓடுங்கள், பிடிக்கவும், சர்ஃப் செல்லவும்.

# game.hint.char5-bombs
source: Press Run to collect and Alt Run to throw.
ta: சேகரிக்க ரன் அழுத்தவும், வீசவும் ஆல்ட் ரன்.

# game.hint.heavy-duck
source: Duck to block most - but not all - flames!
ta: பெரும்பாலானவர்களைத் தடுக்க வாத்து - ஆனால் அனைத்தும் இல்லை - தீப்பிழம்புகள்!

# game.hint.shoe-block
source: Wearing this blocks most - but not all - flames!
ta: இந்த தொகுதிகளை மிகவும் அணிந்துகொள்வது - ஆனால் அனைத்தும் இல்லை - தீப்பிழம்புகள்!

# game.hint.gray-bricks
source: Some blocks are vulnerable to special powers.
ta: சில தொகுதிகள் சிறப்பு சக்திகளுக்கு பாதிக்கப்படக்கூடியவை.

# game.message.scanningLevels
source: Scanning levels...
ta: அளவை ச்கேனிங் ...

# game.pause.continue
source: Continue
ta: தொடரவும்

# game.pause.playerSetup
source: Player Setup
ta: பிளேயர் அமைப்பு

# game.pause.enterCode
source: Enter Code
ta: குறியீட்டை உள்ளிடவும்

# game.pause.quit
source: Quit
ta: வெளியேறு

# game.pause.quitTesting
source: Quit Testing
ta: பரிசோதனையை விட்டுவிடுங்கள்

# game.pause.resetCheckpoints
source: Reset Checkpoints
ta: சோதனைச் சாவடிகளை மீட்டமைக்கவும்

# game.pause.restartLevel
source: Restart Level
ta: அளவை மறுதொடக்கம் செய்யுங்கள்

# game.pause.returnToEditor
source: Return to Editor
ta: எடிட்டருக்குத் திரும்பு

# game.pause.saveAndContinue
source: Save and Continue
ta: சேமித்து தொடரவும்

# game.pause.saveAndQuit
source: Save and Quit
ta: சேமித்து வெளியேறவும்

# game.msgbox.sysInfoError
source: Error!
ta: பிழை!

# game.msgbox.sysInfoTitle
source: Info
ta: தகவல்

# game.msgbox.sysInfoWarning
source: Warning!
ta: எச்சரிக்கை!

# languageName
source: English
ta: ஆங்கிலம்

# menu.abbrevMilliseconds
source: MS
ta: எம்.எச்

# menu.battle.errorNoLevels
source: Can't start battle because of no levels available
ta: எந்த நிலைகளும் கிடைக்காததால் போரைத் தொடங்க முடியாது

# menu.caseNone
source: <None>
ta: <இல்லை>

# menu.character.selectCharacter
source: {0} game
ta: {0} விளையாட்டு

# menu.controls.buttons.altJump
source: Alt Jump
ta: ஆல்ட் சம்ப்

# menu.controls.buttons.altRun
source: Alt Run
ta: அனைத்து ரன்

# menu.controls.buttons.down
source: Down
ta: கீழே

# menu.controls.buttons.drop
source: Drop Item
ta: உருப்படியை கைவிடுங்கள்

# menu.controls.buttons.jump
source: Jump
ta: தாவு

# menu.controls.buttons.left
source: Left
ta: இடது

# menu.controls.buttons.right
source: Right
ta: வலது

# menu.controls.buttons.run
source: Run
ta: ஓடு

# menu.controls.buttons.start
source: Start
ta: தொடங்கு

# menu.controls.buttons.up
source: Up
ta: மேலே

# menu.controls.caseInvalid
source: (Invalid)
ta: (தவறானது)

# menu.controls.caseMouse
source: (Mouse)
ta: (சுட்டி)

# menu.controls.caseTouch
source: (Touch)
ta: (தொடு)

# menu.controls.controlsConnected
source: Connected:
ta: இணைக்கப்பட்டுள்ளது:

# menu.controls.controlsDeleteKey
source: (Alt Jump to Delete)
ta: (நீக்க ஆல்ட் சம்ப்)

# menu.controls.controlsDeviceTypes
source: Device Types
ta: சாதன வகைகள்

# menu.controls.controlsInUse
source: (In Use)
ta: (பயன்பாட்டில்)

# menu.controls.controlsNewProfile
source: <New Profile>
ta: <புதிய சுயவிவரம்>

# menu.controls.controlsNotInUse
source: (Not In Use)
ta: (பயன்பாட்டில் இல்லை)

# menu.controls.controlsReallyDeleteProfile
source: Really delete profile?
ta: உண்மையில் சுயவிவரத்தை நீக்கவா?

# menu.controls.controlsTitle
source: Controls
ta: கட்டுப்பாடுகள்

# menu.controls.cursor.down
source: Mouse Down
ta: சுட்டி கீழே

# menu.controls.cursor.left
source: Mouse Left
ta: சுட்டி இடது

# menu.controls.cursor.primary
source: Primary
ta: முதன்மை

# menu.controls.cursor.right
source: Mouse Right
ta: சுட்டி சரியானது

# menu.controls.cursor.secondary
source: Secondary
ta: இரண்டாம் நிலை

# menu.controls.cursor.tertiary
source: Tertiary
ta: மூன்றாம் நிலை

# menu.controls.cursor.up
source: Mouse Up
ta: சுட்டி அப்

# menu.controls.editor.fastScroll
source: Fast Scrl
ta: வேகமான scrl

# menu.controls.editor.modeErase
source: Mode Erase
ta: பயன்முறை அழித்தல்

# menu.controls.editor.modeSelect
source: Mode Select
ta: பயன்முறை தேர்ந்தெடுக்கவும்

# menu.controls.editor.nextSection
source: Next Sect
ta: அடுத்த பிரிவு

# menu.controls.editor.prevSection
source: Prev Sect
ta: முந்தைய பிரிவு

# menu.controls.editor.scrollDown
source: Scrl Down
ta: Scrl கீழே

# menu.controls.editor.scrollLeft
source: Scrl Left
ta: Scrl இடது

# menu.controls.editor.scrollRight
source: Scrl Right
ta: Scrl சரி

# menu.controls.editor.scrollUp
source: Scrl Up
ta: Scrl மேலே

# menu.controls.editor.switchScreens
source: Show Pane
ta: பலகம் காட்டு

# menu.controls.editor.testPlay
source: Test Play
ta: சோதனை நாடகம்

# menu.controls.hotkeys.debugInfo
source: Debug Info
ta: பிழைத்திருத்த செய்தி

# menu.controls.hotkeys.enterCheats
source: Enter Code
ta: குறியீட்டை உள்ளிடவும்

# menu.controls.hotkeys.fullscreen
source: Fullscreen
ta: முழு திரை

# menu.controls.hotkeys.legacyPause
source: Old Pause
ta: பழைய இடைநிறுத்தம்

# menu.controls.hotkeys.recordGif
source: Record GIF
ta: பதிவு gif

# menu.controls.hotkeys.screenshot
source: Screenshot
ta: திரைக்காட்சி

# menu.controls.hotkeys.toggleHUD
source: Toggle HUD
ta: HUD ஐ மாற்றவும்

# menu.controls.hotkeys.vanillaCam
source: Vanilla Cam
ta: வெண்ணிலா கேம்

# menu.controls.options.batteryStatus
source: Battery Status
ta: பேட்டர் நிலை

# menu.controls.options.maxPlayers
source: Max Players
ta: எம்எக்ச் பிளேயர்

# menu.controls.options.rumble
source: Rumble
ta: ரம்பிள்

# menu.controls.options.textEntryStyle
source: Text Entry Style
ta: உரை நுழைவு நடை
