Repository: 247i/TACETr
Catalog: உரை/வெறுமை/thextech-engine-general-*.po
Languages: ta

# menu.controls.joystickSimpleEditor
source: Simple Editor Controls
ta: எளிய எடிட்டர் கட்டுப்பாடுகள்

# menu.controls.phraseNewProfOldJoy
source: New Profile for Old Joystick
ta: பழைய சாய்ச்டிக் புதிய சுயவிவரம்

# menu.controls.profile.cursorControls
source: Cursor controls
ta: கர்சர் கட்டுப்பாடுகள்

# menu.controls.profile.deleteProfile
source: Delete profile
ta: சுயவிவரத்தை நீக்கு

# menu.controls.profile.editorControls
source: Editor controls
ta: ஆசிரியர் கட்டுப்பாடுகள்

# menu.controls.profile.hotkeys
source: Hotkeys
ta: ஆட்கீச்

# menu.controls.profile.playerControls
source: Player controls
ta: பிளேயர் கட்டுப்பாடுகள்

# menu.controls.profile.renameProfile
source: Rename profile
ta: சுயவிவரத்தை மறுபெயரிடுங்கள்

# menu.controls.tDS.buttonL
source: L
ta: எல்

# menu.controls.tDS.buttonSelect
source: Select
ta: தேர்ந்தெடு

# menu.controls.tDS.buttonStart
source: Start
ta: தொடங்கு

# menu.controls.tDS.buttonX
source: X
ta: ஃச்

# menu.controls.tDS.buttonY
source: Y
ta: ஒய்

# menu.controls.tDS.cStick
source: C-Stick
ta: சி-ச்டிக்

# menu.controls.tDS.casePen
source: (Pen)
ta: (பேனா)

# menu.controls.tDS.dPad
source: D-Pad
ta: டி-பேட்

# menu.controls.tDS.tStick
source: Thumb
ta: கட்டைவிரல்

# menu.controls.touchscreen.layout.longOld
source: Long (Old)
ta: நீண்ட (பழைய)

# menu.controls.touchscreen.layout.phabletOld
source: Phablet (Old)
ta: பேப்லெட் (பழைய)

# menu.controls.touchscreen.layout.phoneOld
source: Phone (Old)
ta: தொலைபேசி (பழையது)

# menu.controls.touchscreen.layout.standard
source: Standard
ta: தரநிலை

# menu.controls.touchscreen.layout.tabletOld
source: Tablet (Old)
ta: டேப்லெட் (பழையது)

# menu.controls.touchscreen.layout.tight
source: Tight
ta: இறுக்கமான

# menu.controls.touchscreen.layout.tinyOld
source: Tiny (Old)
ta: சிறிய (பழைய)

# menu.controls.touchscreen.option.feedbackLength
source: Feedback Length
ta: கருத்து நீளம்

# menu.controls.touchscreen.option.feedbackStrength
source: Feedback Strength
ta: கருத்து வலிமை

# menu.controls.touchscreen.option.holdRun
source: Hold Run on Start
ta: தொடக்கத்தில் ரன் வைத்திருங்கள்

# menu.controls.touchscreen.option.interfaceStyle
source: Interface Style
ta: இடைமுக நடை

# menu.controls.touchscreen.option.layoutStyle
source: Layout Style
ta: தளவமைப்பு நடை

# menu.controls.touchscreen.option.resetLayout
source: Reset Layout
ta: தளவமைப்பை மீட்டமைக்கவும்

# menu.controls.touchscreen.option.sStartSpacing
source: S-Start Spacing
ta: எச்-ச்டார்ட் இடைவெளி

# menu.controls.touchscreen.option.scaleButtons
source: Scale Buttons
ta: அளவிலான பொத்தான்கள்

# menu.controls.touchscreen.option.scaleDPad
source: Scale D-Pad
ta: அளவிலான டி-பேட்

# menu.controls.touchscreen.option.scaleFactor
source: Scale Factor
ta: அளவிலான காரணி

# menu.controls.touchscreen.option.showCodeButton
source: Show Code Button
ta: குறியீடு பொத்தானைக் காட்டு

# menu.controls.touchscreen.style.XODA
source: XODA
ta: காட்

# menu.controls.touchscreen.style.actions
source: Actions
ta: செயல்கள்

# menu.controls.types.gamepad
source: Gamepad
ta: கேம்பேட்

# menu.controls.types.keyboard
source: Keyboard
ta: விசைப்பலகை

# menu.controls.types.oldJoystick
source: Old Joy
ta: பழைய மகிழ்ச்சி

# menu.controls.types.touchscreen
source: Touchscreen
ta: தொடுதிரை

# menu.controls.wii.classic.buttonX
source: X
ta: ஃச்

# menu.controls.wii.classic.buttonY
source: Y
ta: ஒய்

# menu.controls.wii.classic.lStick
source: L-Pad
ta: எல்-பேட்

# menu.controls.wii.classic.rStick
source: R-Pad
ta: ஆர்-பேட்

# menu.controls.wii.nunchuck.buttonZ
source: Z
ta: சட்

# menu.controls.wii.phraseNewClassic
source: New Classic Profile
ta: புதிய கிளாசிக் சுயவிவரம்

# menu.controls.wii.phraseNewNunchuck
source: New Nunchuck Profile
ta: புதிய நன்சக் சுயவிவரம்

# menu.controls.wii.typeClassic
source: Classic
ta: கிளாசிக்

# menu.controls.wii.typeGamecube
source: GameCube
ta: கேம்க்யூப்

# menu.controls.wii.wiimote.buttonHome
source: Home
ta: வீடு

# menu.controls.wii.wiimote.caseIR
source: (IR)
ta: (மற்றும்)

# menu.controls.wii.wiimote.dPad
source: D-Pad
ta: டி-பேட்

# menu.controls.wii.wiimote.shake
source: Shake
ta: குலுக்கல்

# menu.controls.wordButtons
source: Buttons
ta: பொத்தான்கள்

# menu.controls.wordProfiles
source: Profiles
ta: சுயவிவரங்கள்

# menu.editor.errorMissingResources
source: Sorry! You are missing {0}, required for the in-game editor.
ta: மன்னிக்கவும்! விளையாட்டு எடிட்டருக்கு தேவைப்படும் {0} ஐ நீங்கள் காணவில்லை.

# menu.editor.battles
source: <Battle Levels>
ta: <போர் நிலைகள்>

# menu.editor.makeFor
source: Make for:
ta: செய்யுங்கள்:

# menu.editor.newWorld
source: <New World>
ta: <புதிய உலகம்>

# menu.editor.promptNewWorldName
source: New world name
ta: புதிய உலக பெயர்

# menu.game.gameBattleRandom
source: Random Level
ta: சீரற்ற நிலை

# menu.game.gameCopySave
source: Copy save
ta: சேமி நகல்

# menu.game.gameEraseSave
source: Erase save
ta: சேமி

# menu.game.gameEraseSlot
source: Select the slot to erase
ta: அழிக்க ச்லாட்டைத் தேர்ந்தெடுக்கவும்

# menu.game.gameNoBattleLevels
source: <No battle levels>
ta: <போர் நிலைகள் இல்லை>

# menu.game.gameNoEpisodesToPlay
source: <No episodes to play>
ta: <விளையாடுவதற்கு அத்தியாயங்கள் இல்லை>

# menu.game.warnEpCompat
source: This episode was made for a different branch of SMBX and may not work properly.
ta: இந்த அத்தியாயம் SMBX இன் வேறு கிளைக்காக உருவாக்கப்பட்டது மற்றும் சரியாக வேலை செய்யாமல் போகலாம்.

# menu.game.gameSlotContinue
source: SLOT {0} ... {1}%
ta: ச்லாட் {0} ... {1}%

# menu.game.gameSlotNew
source: SLOT {0} ... NEW GAME
ta: ச்லாட் {0} ... புதிய விளையாட்டு

# menu.game.gameSourceSlot
source: Select the source slot
ta: மூல ச்லாட்டைத் தேர்ந்தெடுக்கவும்

# menu.game.gameTargetSlot
source: Now select the target
ta: இப்போது இலக்கைத் தேர்ந்தெடுக்கவும்

# menu.game.phraseScore
source: Score: {0}
ta: ச்கோர்: {0}

# menu.game.phraseTime
source: Time: {0}
ta: நேரம்: {0}

# menu.loading
source: Loading...
ta: ஏற்றுகிறது ...

# menu.main.main1PlayerGame
source: 1 Player Game
ta: 1 பிளேயர் விளையாட்டு

# menu.main.mainBattleGame
source: Battle Game
ta: போர் விளையாட்டு

# menu.main.mainEditor
source: Editor
ta: திருத்தி

# menu.main.mainExit
source: Exit
ta: வெளியேறு

# menu.main.mainMultiplayerGame
source: 2 Player Game
ta: 2 பிளேயர் விளையாட்டு

# menu.main.mainOptions
source: Options
ta: விருப்பங்கள்

# menu.main.mainPlayEpisode
source: Play Episode
ta: அத்தியாயம் விளையாடுங்கள்

# menu.options.restartEngine
source: Restart engine for changes to take effect.
ta: மாற்றங்கள் நடைமுறைக்கு வர இயந்திரத்தை மறுதொடக்கம் செய்யுங்கள்.

# menu.options.advanced._header
source: Advanced
ta: மேம்பட்ட

# menu.options.advanced._tooltip
source: Technical options for internal operations
ta: உள் செயல்பாடுகளுக்கான தொழில்நுட்ப விருப்பங்கள்

# menu.options.advanced.advanced-audio
source: Audio
ta: ஆடியோ

# menu.options.advanced.advanced-video
source: Video
ta: ஒளிதோற்றம்

# menu.options.advanced.audio-buffer-size._name
source: Buffer size
ta: இடையக அளவு

# menu.options.advanced.audio-buffer-size._tooltip
source: Increase for fewer pops but more lag
ta: குறைவான பாப்சுக்கு அதிகரிப்பு ஆனால் அதிக பின்னடைவு

# menu.options.advanced.audio-channels._name
source: Channels
ta: சேனல்கள்

# menu.options.advanced.audio-channels.mono
source: Mono
ta: மோனோ

# menu.options.advanced.audio-channels.stereo
source: Stereo
ta: ச்டீரியோ

# menu.options.advanced.audio-enable
source: Enable
ta: இயக்கு

# menu.options.advanced.audio-format._name
source: Audio format
ta: ஆடியோ வடிவம்

# menu.options.advanced.audio-format._tooltip
source: Format for sound driver
ta: ஒலி இயக்கி வடிவம்

# menu.options.advanced.audio-sample-rate.11025
source: 11025 Hz
ta: 11025 எர்ட்ச்

# menu.options.advanced.audio-sample-rate.16000
source: 16000 Hz
ta: 16000 எர்ட்ச்

# menu.options.advanced.audio-sample-rate.22050
source: 22050 Hz
ta: 22050 எர்ட்ச்

# menu.options.advanced.audio-sample-rate.32000
source: 32000 Hz
ta: 32000 எர்ட்ச்

# menu.options.advanced.audio-sample-rate.44100
source: 44100 Hz
ta: 44100 எர்ட்ச்

# menu.options.advanced.audio-sample-rate.48000
source: 48000 Hz
ta: 48000 எர்ட்ச்

# menu.options.advanced.audio-sample-rate._name
source: Sample rate
ta: மாதிரி வீதம்

# menu.options.advanced.choose-assets-on-launch
source: Choose assets on launch
ta: துவக்கத்தில் சொத்துக்களைத் தேர்வுசெய்க

# menu.options.advanced.log-level._name
source: Log level
ta: பதிவு நிலை

# menu.options.advanced.log-level.critical
source: Critical
ta: விமர்சன

# menu.options.advanced.log-level.debug
source: Debug
ta: பிழைத்திருத்தம்

# menu.options.advanced.log-level.fatal
source: Fatal
ta: அபாயகரமான

# menu.options.advanced.log-level.info
source: Info
ta: தகவல்

# menu.options.advanced.log-level.none
source: None
ta: எதுவுமில்லை

# menu.options.advanced.log-level.warning
source: Warning
ta: எச்சரிக்கை

# menu.options.advanced.record-gameplay-data
source: Record gameplay
ta: விளையாட்டு விளையாட்டு

# menu.options.advanced.render._name
source: Render mode
ta: பயன்முறையை வழங்கவும்

# menu.options.advanced.render.hw
source: Auto
ta: தானி

# menu.options.advanced.render.opengl-tip
source: Desktop API with support for all new visual effects and full accuracy to SMBX64
ta: அனைத்து புதிய காட்சி விளைவுகளுக்கும் ஆதரவுடன் டெச்க்டாப் பநிஇ மற்றும் SMBX64 க்கு முழு துல்லியம்

# menu.options.advanced.render.opengl11-tip
source: Legacy desktop API with full accuracy to SMBX64
ta: SMBX64 க்கு முழு துல்லியத்துடன் மரபு டெச்க்டாப் பநிஇ

# menu.options.advanced.render.opengles
source: OpenGL ES 2+
ta: ஓபன்சிஎல் 2+ ஆகும்

# menu.options.advanced.render.opengles-tip
source: Mobile API with support for all new visual effects and high accuracy to SMBX64
ta: அனைத்து புதிய காட்சி விளைவுகளுக்கும் ஆதரவுடன் மொபைல் பநிஇ மற்றும் SMBX64 க்கு அதிக துல்லியம்

# menu.options.advanced.render.opengles11
source: OpenGL ES 1.1+
ta: ஓபன்சிஎல் 1.1+ ஆகும்

# menu.options.advanced.render.opengles11-tip
source: Legacy mobile API with full accuracy to SMBX64
ta: SMBX64 க்கு முழு துல்லியத்துடன் மரபு மொபைல் பநிஇ

# menu.options.advanced.render.sdl-tip
source: Basic cross-platform render API
ta: அடிப்படை குறுக்கு-தளம் வழங்கல் பநிஇ

# menu.options.advanced.render.sw
source: Software
ta: மென்பொருள்

# menu.options.advanced.scale-down-textures._name
source: Scale down images
ta: படங்களை அளவிடவும்

# menu.options.advanced.scale-down-textures._tooltip
source: Store images as 1x to save memory
ta: நினைவகத்தை சேமிக்க படங்களை 1x ஆக சேமிக்கவும்

# menu.options.advanced.scale-down-textures.all
source: All
ta: அனைத்தும்

# menu.options.advanced.scale-down-textures.all-tip
source: Less loading stutter than 'Safe'
ta: 'பாதுகாப்பானது' என்பதை விட குறைவான ஏற்றுதல் திணறல்

# menu.options.advanced.scale-down-textures.none
source: None
ta: எதுவுமில்லை

# menu.options.advanced.scale-down-textures.none-tip
source: Least loading stutter
ta: குறைந்தது ஏற்றுதல் திணறல்

# menu.options.advanced.scale-down-textures.safe
source: Safe
ta: பாதுகாப்பானது

# menu.options.advanced.scale-down-textures.safe-tip
source: Checks if images are in 2x format
ta: படங்கள் 2x வடிவத்தில் இருந்தால் சரிபார்க்கிறது

# menu.options.advanced.use-native-osk
source: Native OSK
ta: சொந்த ஓச்க்

# menu.options.advanced.inaccurate-gifs
source: Inaccurate GIFs
ta: தவறான GIF கள்

# menu.options.advanced.inaccurate-gifs-tip
source: Allows 3D effect when GIFs are present
ta: GIF கள் இருக்கும்போது 3D விளைவை அனுமதிக்கிறது

# menu.options.advanced.webm-recording
source: WEBM recording
ta: வெப்எம் பதிவு

# menu.options.advanced.internal-res-4p._name
source: 4P split screen size
ta: 4p பிளவு திரை அளவு

# menu.options.advanced.internal-res-4p.default
source: Default
ta: இயல்புநிலை

# menu.options.advanced.fullscreen-type._name
source: Fullscreen type
ta: முழுத்திரை வகை

# menu.options.advanced.fullscreen-type.auto
source: Auto
ta: தானி

# menu.options.advanced.fullscreen-type.desktop
source: Desktop
ta: டெச்க்டாப்

# menu.options.advanced.fullscreen-type.desktop-tip
source: Keep the current screen resolution
ta: தற்போதைய திரை தெளிவுத்திறனை வைத்திருங்கள்

# menu.options.advanced.fullscreen-type.real
source: Exclusive
ta: பிரத்தியேக

# menu.options.advanced.fullscreen-type.real-tip
source: Set physical screen resolution
ta: உடல் திரை தெளிவுத்திறனை அமைக்கவும்

# menu.options.audio._header
source: Audio
ta: ஆடியோ

# menu.options.audio.audio-music-volume
source: Music volume
ta: இசை தொகுதி

# menu.options.audio.audio-prefs
source: Preferences
ta: விருப்பத்தேர்வுகள்

# menu.options.audio.audio-sfx-volume
source: SFX volume
ta: SFX தொகுதி

# menu.options.audio.sfx-audio-fx
source: Echo effects
ta: எதிரொலி விளைவுகள்

# menu.options.audio.sfx-modern
source: Modern SFX
ta: நவீன எச்.எஃப்.எக்ச்

# menu.options.audio.sfx-modern-tip
source: Use sounds added in TheXTech
ta: Textech இல் சேர்க்கப்பட்ட ஒலிகளைப் பயன்படுத்தவும்

# menu.options.audio.sfx-pet-beat
source: Pet grooves
ta: செல்லப்பிராணி பள்ளங்கள்

# menu.options.audio.sfx-pet-beat-tip
source: Play special groove when riding a pet
ta: செல்லப்பிராணியை சவாரி செய்யும் போது சிறப்பு பள்ளம் விளையாடுங்கள்

# menu.options.audio.sfx-spatial-audio
source: Spatial audio
ta: இடஞ்சார்ந்த ஆடியோ

# menu.options.audio.sfx-spatial-audio-tip
source: Reduce volume of offscreen sounds
ta: ஆஃப்ச்கிரீன் ஒலிகளின் அளவைக் குறைக்கவும்

# menu.options.compatibility._header
source: Session Tweaks
ta: அமர்வு மாற்றங்கள்

# menu.options.compatibility._tooltip
source: Options for compat or debugging
ta: இணைத்தல் அல்லது பிழைத்திருத்தத்திற்கான விருப்பங்கள்

# menu.options.compatibility.autocode
source: Autocode
ta: ஆட்டோகோட்

# menu.options.compatibility.bugfixes
source: Bugfixes
ta: பிழைத்திருத்தங்கள்

# menu.options.compatibility.features
source: Features
ta: நற்பொருத்தங்கள்

# menu.options.compatibility.reset-all
source: Reset All
ta: அனைத்தையும் மீட்டமைக்கவும்

# menu.options.controls._header
source: Controls
ta: கட்டுப்பாடுகள்

# menu.options.episode-options._header
source: Episode Options
ta: அத்தியாயம் விருப்பங்கள்

# menu.options.episode-options.creator-compat._name
source: Creator compat
ta: படைப்பாளி இணைத்தல்

# menu.options.episode-options.creator-compat._tooltip
source: Logic tweaks by content creator
ta: உள்ளடக்க படைப்பாளரின் வழக்கு மாற்றங்கள்

# menu.options.episode-options.creator-compat.disable
source: Disable
ta: முடக்கு

# menu.options.episode-options.creator-compat.enable
source: Enable
ta: இயக்கு

# menu.options.episode-options.creator-compat.file-only
source: File only
ta: கோப்பு மட்டுமே

# menu.options.episode-options.playstyle._name
source: Playstyle
ta: பிளேச்டைல்

# menu.options.episode-options.playstyle.classic
source: Classic
ta: கிளாசிக்

# menu.options.episode-options.playstyle.classic-tip
source: Minimal updates
ta: குறைந்தபட்ச புதுப்பிப்புகள்

# menu.options.episode-options.playstyle.modern
source: Modern
ta: நவீன

# menu.options.episode-options.playstyle.modern-tip
source: All updates
ta: அனைத்து புதுப்பிப்புகளும்

# menu.options.episode-options.playstyle.vanilla
source: Vanilla
ta: வெண்ணிலா

# menu.options.episode-options.playstyle.vanilla-tip
source: No updates
ta: புதுப்பிப்புகள் இல்லை

# menu.options.episode-options.hub-resume
source: Save warp in hub
ta: வார்ப் அப்பில் சேமிக்கவும்

# menu.options.episode-options.hub-resume-tip
source: Resume play at the last warp you entered
ta: நீங்கள் நுழைந்த கடைசி போரில் மீண்டும் விளையாடுங்கள்

# menu.options.main._header
source: Main
ta: முக்கிய

# menu.options.main.background-work
source: Run in background
ta: பின்னணியில் இயக்கவும்

# menu.options.main.background-work-tip
source: Play with joystick while game is unfocused
ta: விளையாட்டு கவனம் செலுத்தாமல் இருக்கும்போது சாய்ச்டிக் உடன் விளையாடுங்கள்

# menu.options.main.four-screen-mode._name
source: 4P screen mode
ta: 4p திரை பயன்முறை

# menu.options.main.four-screen-mode.shared
source: Shared
ta: பகிரப்பட்டது

# menu.options.main.four-screen-mode.split
source: Split
ta: பிளவு

# menu.options.main.frame-skip
source: Frameskip
ta: பிரேம்கிப்

# menu.options.main.discord-rpc
source: Discord Integration
ta: முரண்பாடு ஒருங்கிணைப்பு

# menu.options.main.language
source: Language
ta: மொழி

# menu.options.main.multiplayer
source: Multiplayer
ta: மல்டிபிளேயர்

# menu.options.main.timing
source: Frame Timing
ta: சட்ட நேரம்

# menu.options.main.two-screen-mode._name
source: 2P screen mode
ta: 2p திரை பயன்முறை

# menu.options.main.two-screen-mode.shared
source: Shared
ta: பகிரப்பட்டது

# menu.options.main.two-screen-mode.split
source: Left/Right
ta: இடது/வலது

# menu.options.main.two-screen-mode.topbottom
source: Top/Bottom
ta: மேல்/கீழ்

# menu.options.main.unlimited-framerate
source: Unlimited framerate
ta: வரம்பற்ற ஃப்ரேம்ரேட்

# menu.options.main.vsync
source: V-Sync
ta: வி-ஒத்திசைவு

# menu.options.video._header
source: Video
ta: ஒளிதோற்றம்

# menu.options.video.battery-status._name
source: Device battery status
ta: சாதன பேட்டரி நிலை

# menu.options.video.battery-status.fullscreen
source: Fullscreen
ta: முழு திரை

# menu.options.video.battery-status.fullscreen-tip
source: Show when the game is fullscreen
ta: விளையாட்டு முழுத்திரையாக இருக்கும்போது காண்பி

# menu.options.video.battery-status.low
source: Low
ta: குறைந்த

# menu.options.video.battery-status.low-tip
source: Show when the battery is low
ta: பேட்டரி குறைவாக இருக்கும்போது காண்பி

# menu.options.video.battery-status.off
source: Off
ta: அணை

# menu.options.video.battery-status.on
source: Always
ta: எப்போதும்

# menu.options.video.display-controllers
source: Controls activity
ta: செயல்பாட்டைக் கட்டுப்படுத்துகிறது

# menu.options.video.effects
source: Screen Effects
ta: திரை விளைவுகள்

# menu.options.video.enable-inter-level-fade-effect
source: Fade transitions
ta: மங்கலான மாற்றங்கள்

# menu.options.video.fullscreen
source: Fullscreen
ta: முழு திரை

# menu.options.video.info-game
source: Onscreen game info
ta: திரை விளையாட்டு செய்தி

# menu.options.video.info-meta
source: Onscreen meta info
ta: திரை மேவு செய்தி

# menu.options.video.info-run
source: Onscreen run info
ta: திரை ரன் செய்தி

# menu.options.video.internal-res._name
source: Screen size
ta: திரை அளவு

# menu.options.video.internal-res._tooltip
source: Resolution of gameplay field
ta: விளையாட்டு புலத்தின் தீர்மானம்

# menu.options.video.internal-res.dynamic
source: Dynamic
ta: மாறும்

# menu.options.video.internal-res.gba
source: 480x320 (GBA)
ta: 480x320 (பெறுங்கள்)

# menu.options.video.internal-res.hd
source: 1280x720 (HD)
ta: 1280x720 (எச்டி)

# menu.options.video.internal-res.hello
source: 768x432 (HELLO)
ta: 768x432 (அலோ)

# menu.options.video.internal-res.nds
source: 512x384 (NDS)
ta: 512x384 (என்.டி.எச்)

# menu.options.video.internal-res.smbx-wide
source: SMBX (wide)
ta: SMBX (அகலம்)

# menu.options.video.internal-res.vga
source: 640x480 (VGA)
ta: 640x480 (விசிஏ)

# menu.options.video.scale-mode.2x
source: 2x
ta: ஃச்

# menu.options.video.scale-mode._name
source: Scale mode
ta: அளவிலான பயன்முறை

# menu.options.video.scale-mode.integer
source: Integer
ta: முழு எண்

# menu.options.video.scale-mode.linear
source: Smooth
ta: மென்மையான

# menu.options.video.scale-mode.nearest
source: Nearest
ta: அருகில்

# menu.options.video.scale-mode.full
source: Full
ta: முழு

# menu.options.video.scale-mode.center
source: Center
ta: நடுவண்

# menu.options.video.show-episode-title._name
source: Episode name
ta: அத்தியாயம் பெயர்

# menu.options.video.show-episode-title.bottom
source: Bottom
ta: கீழே

# menu.options.video.show-episode-title.bottom-tip
source: Show above speedrun timer
ta: ச்பீட்ரன் டைமருக்கு மேலே காட்டவும்

# menu.options.video.show-episode-title.off
source: Off
ta: அணை

# menu.options.video.show-episode-title.top
source: Top
ta: மேலே

# menu.options.video.show-episode-title.top-tip
source: Show above HUD at high resolution
ta: உயர் தெளிவுத்திறனில் HUD க்கு மேலே காண்பி

# menu.options.video.3d-compat-mode
source: 3D compat mode
ta: 3D இணைத்தல் பயன்முறை

# menu.options.video.3d-compat-mode-tip
source: Draw all objects in one 3D plane
ta: அனைத்து பொருட்களையும் ஒரு 3D விமானத்தில் வரையவும்

# menu.options.video.show-fails-counter
source: Fails counter
ta: எதிர் தோல்வி

# menu.options.video.show-fails-counter-tip
source: Show fails on the episode and current level
ta: அத்தியாயம் மற்றும் தற்போதைய மட்டத்தில் சோ தோல்வியடைகிறது

# menu.options.video.show-fps
source: Framerate
ta: பிரேம்ரேட்

# menu.options.video.show-medals-counter
source: Medals counter
ta: பதக்கங்கள் கவுண்டர்

# menu.options.video.show-medals-counter-tip
source: Show medals in HUD and at level entrance
ta: HUD மற்றும் நிலை நுழைவாயிலில் பதக்கங்களைக் காட்டு

# menu.options.video.show-playtime-counter._name
source: Playtime counter
ta: பிளே டைம் கவுண்டர்

# menu.options.video.show-playtime-counter._tooltip
source: Show time spent on the episode and current attempt
ta: அத்தியாயம் மற்றும் தற்போதைய முயற்சியில் செலவழித்த நேரத்தைக் காட்டு

# menu.options.video.show-playtime-counter.animated
source: Animated
ta: அனிமேசன்

# menu.options.video.show-playtime-counter.animated-tip
source: Adds a rainbow effect on level end
ta: நிலை முடிவில் வானவில் விளைவைச் சேர்க்கிறது

# menu.options.video.show-playtime-counter.off
source: Off
ta: அணை

# menu.options.video.show-playtime-counter.off-tip
source: Show only during speedruns
ta: ச்பீட்ரன்களின் போது மட்டுமே காட்டு

# menu.options.video.show-playtime-counter.opaque
source: Opaque
ta: ஒளிபுகா

# menu.options.video.show-playtime-counter.transparent
source: Transparent
ta: வெளிப்படையானது

# menu.options.video.show-screen-shake
source: Screen shake
ta: திரை குலுக்கல்

# menu.options.video.video-system
source: System
ta: மண்டலம்

# menu.options.video.world-map-stars-show
source: World map stars
ta: உலக வரைபட நட்சத்திரங்கள்

# menu.options.video.world-map-stars-show-tip
source: Show collected stars above levels
ta: சேகரிக்கப்பட்ட நட்சத்திரங்களை மட்டங்களுக்கு மேலே காட்டு

# menu.options.view-credits._header
source: View Credits
ta: வரவுகளைக் காண்க

# menu.options.speedrun.mode._name
source: Speedrun mode
ta: ச்பீட்ரன் பயன்முறை

# menu.wordBack
source: Back
ta: பின்

# menu.wordHide
source: Hide
ta: மறை

# menu.wordNo
source: No
ta: இல்லை

# menu.wordOff
source: Off
ta: அணை

# menu.wordOn
source: On
ta: ஆன்

# menu.wordPlayer
source: Player
ta: வீரர்

# menu.wordProfile
source: Profile
ta: சுயவிவரம்

# menu.wordResume
source: Resume
ta: மீண்டும் தொடங்குங்கள்

# menu.wordShow
source: Show
ta: காட்டு

# menu.wordWaiting
source: Waiting
ta: காத்திருக்கிறது

# menu.wordYes
source: Yes
ta: ஆம்

# outro.cppPortDevelopers
source: C++ port developers:
ta: சி ++ துறைமுகம் டெவலப்பர்கள்:

# outro.customSprites
source: Custom Sprites:
ta: தனிப்பயன் உருவங்கள்:

# outro.engineCredits
source: Engine credits:
ta: இயந்திர வரவு:

# outro.gameCredits
source: Game credits:
ta: விளையாட்டு வரவு:

# outro.levelDesign
source: Level Design:
ta: நிலை வடிவமைப்பு:

# outro.nameAndrewSpinks
source: Andrew Spinks
ta: ஆண்ட்ரூ சூரரிமாச்சிலை

# outro.nameVitalyNovichkov
source: Vitaly Novichkov
ta: விட்டலி நோவாச்ச்கோவ்

# outro.originalBy
source: Original VB6 code By:
ta: அசல் விபி 6 குறியீடு:

# outro.psVitaPortBy
source: PS Vita Port By:
ta: பி.எச். வீடா போர்ட்:

# outro.qualityControl
source: Quality Control:
ta: தரக் கட்டுப்பாடு:

# outro.specialThanks
source: Special Thanks:
ta: சிறப்பு நன்றி:

# pluralRules
source: one-is-singular
ta: ஒன்று-ஒற்றை
