Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: * Has anyone in my country ever been criminalized based on their internet activity? (This does not necessarily need to be specific to digital security training or use of Tor.)
ta: * எனது நாட்டில் யாராவது அவர்களின் இணைய நடவடிக்கைகளின் அடிப்படையில் குற்றமயமாக்கப்பட்டிருக்கிறார்களா? (இது டிசிட்டல் பாதுகாப்பு பயிற்சி அல்லது TOR இன் பயன்பாட்டிற்கு குறிப்பிட்டதாக இருக்க வேண்டிய அவசியமில்லை.)

source: * Is it illegal for me to access certain websites?
ta: * சில வலைத்தளங்களை அணுகுவது எனக்கு சட்டவிரோதமா?

source: * [OONI disclaimer](https://ooni.org/about/risks/)
ta: * [Ooni மறுப்பு] (https://ooni.org/about/risks/)

source: 1. **Your threat model.** A high-profile activist already under a lot of surveillance, for example, might attract more attention when reaching out to other activists to run a digital security training.
ta: 1. ** உங்கள் அச்சுறுத்தல் மாதிரி. ** ஏற்கனவே நிறைய கண்காணிப்புகளின் கீழ் ஒரு உயர்மட்ட ஆர்வலர், எடுத்துக்காட்டாக, டிசிட்டல் பாதுகாப்பு பயிற்சியை நடத்த மற்ற ஆர்வலர்களை அணுகும்போது அதிக கவனத்தை ஈர்க்கக்கூடும்.

source: 2. **The laws and regulations in the country.** Consult with local lawyers and local freedom of expression organizations and learn whether your country has a record in prosecuting individuals engaging in similar types of activities.
ta: 2. ** நாட்டில் உள்ள சட்டங்கள் மற்றும் ஒழுங்குமுறைகள். ** உள்ளக வழக்கறிஞர்கள் மற்றும் உள்ளக கருத்துச் சுதந்திர அமைப்புகளுடன் கலந்தாலோசித்து, இதேபோன்ற செயல்பாடுகளில் ஈடுபடும் நபர்களை வழக்குத் தொடுப்பதில் உங்கள் நாட்டில் பதிவு இருக்கிறதா என்பதை அறிக.

source: 3. **The types of training.** Not all trainings carry the same weight in terms of potential risk.
ta: 3. ** பயிற்சியின் வகைகள். ** அனைத்து பயிற்சிகளும் சாத்தியமான ஆபத்தின் அடிப்படையில் ஒரே எடையைக் கொண்டிருக்கவில்லை.

source: 5. **The training venue.** Running a Tor training in some spaces could expose your participants' identities.
ta: 5. ** பயிற்சி இடம். ** சில இடைவெளிகளில் ஒரு டோர் பயிற்சியை நடத்துவது உங்கள் பங்கேற்பாளர்களின் அடையாளங்களை அம்பலப்படுத்தக்கூடும்.

source: Additionally, while many countries do not have laws specifically prohibiting the activity of running a digital security training, the use of digital security tools may still be criminalized in certain countries under other, broader laws.
ta: கூடுதலாக, பல நாடுகளில் டிசிட்டல் பாதுகாப்புப் பயிற்சியை நடத்துவதற்கான செயல்பாட்டை குறிப்பாக தடைசெய்யும் சட்டங்கள் இல்லை என்றாலும், டிசிட்டல் பாதுகாப்பு கருவிகளின் பயன்பாடு சில நாடுகளில் மற்ற, பரந்த சட்டங்களின் கீழ் இன்னும் குற்றவாளியாக இருக்கக்கூடும்.

source: Additionally, your communication with us is not protected by any legal privilege, so law enforcement may subpoena and obtain any information you give us.
ta: கூடுதலாக, எங்களுடனான உங்கள் தொடர்பு எந்தவொரு சட்ட சலுகையினாலும் பாதுகாக்கப்படாது, எனவே சட்ட அமலாக்கமானது நீங்கள் எங்களுக்கு வழங்கும் எந்த தகவலையும் சமர்ப்பிக்கலாம்.

source: For example, talking about privacy in the digital age might be appreciated, but teaching how to circumvent government censorship could be a serious felony.
ta: எடுத்துக்காட்டாக, டிசிட்டல் யுகத்தில் தனியுரிமை பற்றி பேசுவது பாராட்டப்படலாம், ஆனால் அரசாங்க தணிக்கையை எவ்வாறு தவிர்ப்பது என்பதைக் கற்பிப்பது ஒரு தீவிரமான குற்றமாக இருக்கலாம்.

source: For example, using Tor Browser may be viewed as illegal or anti-government activity.
ta: எடுத்துக்காட்டாக, TOR உலாவியைப் பயன்படுத்துவது சட்டவிரோத அல்லது அரசாங்க எதிர்ப்பு நடவடிக்கைகளாகக் கருதப்படலாம்.

source: However, in some countries and in certain circumstances, it's possible that simply a gathering as human rights defenders could be risky, illegal, or even lead to imprisonment, physical assaults, large fines, threats, placement on government watch lists, and targeting for surveillance.
ta: இருப்பினும், சில நாடுகளிலும் சில சூழ்நிலைகளிலும், மனித உரிமை பாதுகாவலர்களாக ஒரு கூட்டம் ஆபத்தானது, சட்டவிரோதமானது, அல்லது சிறைவாசம், உடல் ரீதியான தாக்குதல்கள், பெரிய தண்டம், அச்சுறுத்தல்கள், அரசாங்க கண்காணிப்பு பட்டியல்களில் இடம் பெறுதல் மற்றும் கண்காணிப்புக்கு இலக்காக இருக்கலாம் .

source: However, we may be able to put you in touch with lawyers who are capable of addressing your questions and/or concerns.
ta: இருப்பினும், உங்கள் கேள்விகள் மற்றும்/அல்லது கவலைகளை நிவர்த்தி செய்யும் திறன் கொண்ட வழக்கறிஞர்களுடன் நாங்கள் உங்களை தொடர்பு கொள்ள முடியும்.

source: Ideally, you should use a private space where you control the participants' entrance.
ta: வெறுமனே, பங்கேற்பாளர்களின் நுழைவாயிலைக் கட்டுப்படுத்தும் ஒரு தனிப்பட்ட இடத்தை நீங்கள் பயன்படுத்த வேண்டும்.

source: If the space isn't private, check before the training to find out if participants are comfortable with revealing their identity to a third party.
ta: இடம் தனிப்பட்டதாக இல்லாவிட்டால், பங்கேற்பாளர்கள் தங்கள் அடையாளத்தை மூன்றாம் தரப்பினருக்கு வெளிப்படுத்த வசதியாக இருக்கிறார்களா என்பதை அறிய பயிற்சிக்கு முன் சரிபார்க்கவும்.

source: If you want to run a Tor training for the first time and you don't know how to assess the political and social environment, we strongly encourage you read this document and, in case of doubt, to reach out to the Tor Community Team privately.
ta: நீங்கள் முதன்முறையாக ஒரு TOR பயிற்சியை நடத்த விரும்பினால், அரசியல் மற்றும் சமூக சூழலை எவ்வாறு மதிப்பிடுவது என்று உங்களுக்குத் தெரியாவிட்டால், இந்த ஆவணத்தைப் படித்து, ஐயம் இருந்தால், டோர் சமூக குழுவை தனிப்பட்ட முறையில் அணுக நாங்கள் உங்களை கடுமையாக ஊக்குவிக்கிறோம் .

source: Note, this is not an exhaustive list of questions.
ta: குறிப்பு, இது கேள்விகளின் முழுமையான பட்டியல் அல்ல.

source: Please note that we are not lawyers, and any information we give you does not constitute legal advice.
ta: நாங்கள் வழக்கறிஞர்கள் அல்ல என்பதை நினைவில் கொள்க, நாங்கள் உங்களுக்கு வழங்கும் எந்த தகவலும் சட்ட ஆலோசனையை ஏற்படுத்தாது.

source: Some potential risks of running a digital security training are only valid in specific contexts.
ta: டிசிட்டல் பாதுகாப்பு பயிற்சியை இயக்குவதற்கான சில அபாயங்கள் குறிப்பிட்ட சூழல்களில் மட்டுமே செல்லுபடியாகும்.

source: Some questions you may want to answer before running a digital security training include:
ta: டிசிட்டல் பாதுகாப்பு பயிற்சியை இயக்குவதற்கு முன்பு நீங்கள் பதிலளிக்க விரும்பும் சில கேள்விகள் பின்வருமாறு:

source: Some relevant resources include:
ta: சில தொடர்புடைய ஆதாரங்கள் பின்வருமாறு:

source: The potential risks associated with running a Tor training depend on:
ta: ஒரு TOR பயிற்சியை இயக்குவதில் தொடர்புடைய அபாயங்கள் சார்ந்துள்ளது:

source: To our knowledge, no Tor trainer has ever faced consequences as a result of training others or speaking about Tor.
ta: எங்கள் அறிவைப் பொறுத்தவரை, மற்றவர்களுக்கு பயிற்சி அளித்ததன் விளைவாக அல்லது டோர் பற்றி பேசுவதன் விளைவாக எந்த டோர் பயிற்சியாளரும் இதுவரை விளைவுகளை எதிர்கொள்ளவில்லை.

source: Things you should be aware of before running a digital security training.
ta: டிசிட்டல் பாதுகாப்பு பயிற்சியை இயக்குவதற்கு முன்பு நீங்கள் அறிந்திருக்க வேண்டிய விசயங்கள்.

source: Risks
ta: அபாயங்கள்

source: ## Collect new forum badges
ta: ## புதிய மன்ற பேட்ச்களை சேகரிக்கவும்

source: ## Feeding back to our developers
ta: ## எங்கள் டெவலப்பர்களுக்கு மீண்டும் உணவளித்தல்

source: ## What are the risks?
ta: ## அபாயங்கள் என்ன?

source: ## What to look out for
ta: ## எதைப் பார்க்க வேண்டும்

source: #### Step 1
ta: #### படி 1

source: #### Step 2
ta: #### படி 2

source: #### Step 3
ta: #### படி 3

source: - Any relevant logs and/or screenshots
ta: - ஏதேனும் தொடர்புடைய பதிவுகள் மற்றும்/அல்லது திரை சாட்கள்

source: - Describe what you expected to happen instead
ta: - அதற்கு பதிலாக நீங்கள் எதிர்பார்த்ததை விவரிக்கவும்

source: - How did you install Tor Browser?
ta: - டோர் உலாவியை எவ்வாறு நிறுவினீர்கள்?

source: - Outline the steps necessary to reproduce the issue
ta: - சிக்கலை இனப்பெருக்கம் செய்ய தேவையான படிகளை கோடிட்டுக் காட்டுங்கள்

source: - Summarize the issue concisely
ta: - பிரச்சினையை சுருக்கமாக சுருக்கமாகக் கூறுங்கள்

source: - What platform are you using? E.g. Windows 11, Debian 11.3, MacOS 12.3, Android 12 etc.
ta: - நீங்கள் எந்த தளத்தைப் பயன்படுத்துகிறீர்கள்? எ.கா. சாளரங்கள் 11, டெபியன் 11.3, மேகோச் 12.3, ஆண்ட்ராய்டு 12 போன்றவை.

source: - What security level Tor Browser is set to?
ta: - என்ன பாதுகாப்பு நிலை டோர் உலாவி அமைக்கப்பட்டுள்ளது?

source: - What type of device are you using? E.g. Lenovo ThinkPad, MacBook Air, Samsung Galaxy S22, Google Pixel 6 etc.
ta: - நீங்கள் எந்த வகையான சாதனத்தைப் பயன்படுத்துகிறீர்கள்? எ.கா. லெனோவா திங்க்பேட், மேக்புக் ஏர், சாம்சங் கேலக்சி எச் 22, கூகிள் படப்புள்ளி 6 போன்றவை.

source: - What version of Tor Browser Alpha are you using? E.g. Tor Browser 11.5a9
ta: - டோர் உலாவி ஆல்பாவின் எந்த பதிப்பை நீங்கள் பயன்படுத்துகிறீர்கள்? எ.கா. டோர் உலாவி 11.5A9

source: As a small thank you for helping us keep Tor Browser stable and bug-free, Alpha Testers can collect [special badges](https://forum.torproject.org/badges) by reporting bugs on the Tor Forum.
ta: டோர் உலாவியை நிலையான மற்றும் பிழை இல்லாததாக வைத்திருக்க எங்களுக்கு உதவியதற்கு ஒரு சிறிய நன்றி, ஆல்பா சோதனையாளர்கள் டோர் மன்றத்தில் பிழைகள் புகாரளிப்பதன் மூலம் [சிறப்பு பேட்ச்கள்] (https://forum.torproject.org/badges) சேகரிக்கலாம்.

source: Download the latest [Tor Browser Alpha](https://www.torproject.org/download/alpha/) available for your platform.
ta: உங்கள் தளத்திற்கு கிடைக்கக்கூடிய அண்மைக் கால [டோர் உலாவி ஆல்பா] (https://www.torproject.org/download/alpha/) பதிவிறக்கவும்.

source: Each new version of Tor Browser Alpha is accompanied by a release post on the [Tor Blog](https://blog.torproject.org/category/applications/) and [Forum](https://forum.torproject.org/c/feedback/tor-browser-alpha-feedback/6) that includes a short, specific list of changes to test.
ta: TOR உலாவி ஆல்பாவின் ஒவ்வொரு புதிய பதிப்பும் [TOR வலைப்பதிவு] (https://blog.torproject.org/category/applications/) மற்றும் [மன்றம்] (https://forum.torproject.org/c/feedback/tor-browser-feedbaga-feedbaga-feedbaga-feedback/6.

source: Earn the bronze Alpha Tester badge for reporting your first bug that gets liked by a Tor Project team-member, and keep testing to unlock the silver and gold badges too.
ta: ஒரு டோர் திட்ட குழு உறுப்பினரால் விரும்பப்படும் உங்கள் முதல் பிழையைப் புகாரளிப்பதற்காக வெண்கல ஆல்பா டெச்டர் பேட்சைப் பெறுங்கள், மேலும் வெள்ளி மற்றும் தங்க பேட்ச்களையும் திறக்க சோதனை செய்யுங்கள்.

source: Firstly, check to see if the issue is unique to Tor Browser Alpha, or if it’s present in [Tor Browser’s stable release](https://www.torproject.org/download/) and/or Firefox as well.
ta: முதலாவதாக, சிக்கல் டோர் உலாவி ஆல்பாவுக்கு தனித்துவமானதா என்பதை சரிபார்க்கவும், அல்லது அது [டோர் உலாவியின் நிலையான வெளியீட்டில்] (https://www.torproject.org/download/) மற்றும்/அல்லது பயர்பாக்சில் இருக்கிறதா என்று சரிபார்க்கவும்.

source: Happy testing!
ta: மகிழ்ச்சியான சோதனை!

source: However, Firefox updates can introduce new bugs to Tor Browser in unpredictable ways. As such, we encourage you to continue to test features and functionality beyond what's listed in the changelog too.
ta: இருப்பினும், பயர்பாக்ச் புதுப்பிப்புகள் கணிக்க முடியாத வழிகளில் டோர் உலாவிக்கு புதிய பிழைகளை அறிமுகப்படுத்தலாம். எனவே, சேஞ்ச்லாக் பட்டியலிடப்பட்டுள்ளதைத் தாண்டி அம்சங்களையும் செயல்பாடுகளையும் தொடர்ந்து சோதிக்க நாங்கள் உங்களை ஊக்குவிக்கிறோம்.

source: If you’re the first to discover the issue, please create a new thread in the [Tor Browser Alpha Feedback](https://forum.torproject.org/c/feedback/tor-browser-alpha-feedback/6) category.
ta: சிக்கலைக் கண்டறிந்தால், தயவுசெய்து [டோர் உலாவி ஆல்பா பின்னூட்டம்] (https://forum.torproject.org/c/feedback/tor-browser-alpha-feedback/6) பிரிவில் ஒரு புதிய நூலை உருவாக்கவும்.

source: In addition to finding and reporting bugs, Alpha testers are also encouraged to provide feedback about new and experimental features to the team before they reach Tor Browser stable.
ta: பிழைகளைக் கண்டறிந்து அறிக்கையிடுவதோடு மட்டுமல்லாமல், ஆல்பா சோதனையாளர்கள் டோர் உலாவி நிலையானதை அடைவதற்கு முன்பு அணிக்கு புதிய மற்றும் சோதனை அம்சங்களைப் பற்றிய கருத்துக்களை வழங்க ஊக்குவிக்கப்படுகிறார்கள்.

source: Instead, please limit your use of Tor Browser Alpha and Nightly to preview new features, test their performance and provide feedback before their release.
ta: அதற்கு பதிலாக, புதிய அம்சங்களை முன்னோட்டமிட டோர் உலாவி ஆல்பா மற்றும் இரவு நேரத்தைக் கட்டுப்படுத்தவும், அவற்றின் செயல்திறனை சோதிக்கவும், அவை வெளியிடுவதற்கு முன்பு கருத்துக்களை வழங்கவும்.

source: Make sure to include the following details:
ta: பின்வரும் விவரங்களைச் சேர்ப்பதை உறுதிசெய்க:

source: Once you’ve verified that the problem you’ve encountered is indeed an issue with Tor Browser Alpha, check the [Tor Browser Alpha Feedback category](https://forum.torproject.org/c/feedback/tor-browser-alpha-feedback/6) on the Forum to see if it’s been reported already. If so, you can add your report to the same thread.
ta: நீங்கள் சந்தித்த சிக்கல் உண்மையில் டோர் உலாவி ஆல்பாவுடன் ஒரு சிக்கல் என்பதை நீங்கள் சரிபார்த்தவுடன், [டோர் உலாவி ஆல்பா பின்னூட்ட வகையை] (https://forum.torproject.org/c/feedback/tor-browser-alpha-feedback/6) சரிபார்க்கவும். அப்படியானால், உங்கள் அறிக்கையை அதே நூலில் சேர்க்கலாம்.

source: Or, if you have a GitLab account, post any bugs you find using the templates provided in [applications/tor-browser](https://gitlab.torproject.org/tpo/applications/tor-browser/-/issues) (but make sure to search the project for duplicates first).
ta: Or, if you have a GitLab account, post any bugs you கண்டுபிடி using the வார்ப்புருக்கள் provided in [applications/tor-browser](https://gitlab.torproject.org/tpo/applications/tor-browser/-/issues) (but make sure பெறுநர் தேடல் the திட்டம் க்கு duplicates first).

source: Sign up for an account on the [Tor Forum](https://forum.torproject.org/) (if you'd like to submit your feedback there).
ta: [TOR மன்றம்] (https://forum.torproject.org/) இல் ஒரு கணக்கிற்கு பதிவுபெறுக (உங்கள் கருத்தை அங்கு சமர்ப்பிக்க விரும்பினால்).

source: Start testing and follow the steps below to feed back any issues you discover to our developers.
ta: எங்கள் டெவலப்பர்களுக்கு நீங்கள் கண்டுபிடிக்கும் எந்தவொரு சிக்கலையும் திருப்பித் தர கீழே உள்ள படிகளைப் பின்பற்றவும்.

source: To become an Alpha Tester all you need to do is:
ta: ஆல்பா சோதனையாளராக நீங்கள் செய்ய வேண்டியதெல்லாம்:

source: To help keep Tor Browser available on Windows, Linux, MacOS and Android, we rely on a community of volunteer Alpha testers to try out early versions of Tor Browser before their general release.
ta: சாளரங்கள், லினக்ச், மேகோச் மற்றும் ஆண்ட்ராய்டு ஆகியவற்றில் டோர் உலாவியை கிடைக்கச் செய்ய, அவர்களின் பொது வெளியீட்டிற்கு முன்னர் டோர் உலாவியின் ஆரம்ப பதிப்புகளை முயற்சிக்க தன்னார்வ ஆல்பா சோதனையாளர்களின் சமூகத்தை நம்புகிறோம்.

source: Tor Browser Alpha and Nightly are unstable versions of Tor Browser and should not be used for activities that could put you at risk.
ta: TOR உலாவி ஆல்பா மற்றும் இரவுநேரம் TOR உலாவியின் நிலையற்ற பதிப்புகள் மற்றும் உங்களுக்கு ஆபத்தை ஏற்படுத்தக்கூடிய நடவடிக்கைகளுக்கு பயன்படுத்தக்கூடாது.

source: You can also find a more general list of browser functionality worth checking on the [Tor Browser Wiki](https://gitlab.torproject.org/tpo/applications/tor-browser/-/wikis/Quality-Assurance).
ta: [டோர் உலாவி விக்கி] (https://gitlab.torproject.org/tpo/applications/tor-browser/-/wikis/quality-arsuration) இல் சரிபார்க்க மதிப்புள்ள உலாவி செயல்பாட்டின் பொதுவான பட்டியலையும் நீங்கள் காணலாம்.

source: You can also submit Gitlab issues anonymously using [Anonticket](https://anonticket.onionize.space).
ta: [அனோன்டிக்கெட்] (https://anonticket.onionize.space) ஐப் பயன்படுத்தி அறிவிலிஆய்வு சிக்கல்களையும் அநாமதேயமாக சமர்ப்பிக்கலாம்.

source: User research
ta: பயனர் ஆராய்ச்சி

source: We rely on a community of volunteer Alpha testers to try out early versions of Tor Browser before their general release. Sign up to become an Alpha tester.
ta: டோர் உலாவியின் ஆரம்ப பதிப்புகளை அவர்களின் பொது வெளியீட்டிற்கு முன்னர் முயற்சிக்க தன்னார்வ ஆல்பா சோதனையாளர்களின் சமூகத்தை நாங்கள் நம்பியுள்ளோம். ஆல்பா சோதனையாளராக ஆக பதிவுபெறுக.

source: Become an alpha tester
ta: ஆல்பா சோதனையாளராகுங்கள்

source: ## We respect our users' privacy when we conduct research.
ta: ## நாங்கள் ஆராய்ச்சி நடத்தும்போது எங்கள் பயனர்களின் தனியுரிமையை நாங்கள் மதிக்கிறோம்.

source: Our user research is founded on the premises of consent, respect, and empathy.
ta: எங்கள் பயனர் ஆராய்ச்சி ஒப்புதல், மரியாதை மற்றும் பச்சாத்தாபம் ஆகியவற்றின் வளாகத்தில் நிறுவப்பட்டுள்ளது.

source: The way we build tools also builds community.
ta: நாங்கள் கருவிகளை உருவாக்கும் விதமும் சமூகத்தை உருவாக்குகிறது.

source: We practice human-centered design when we build tools for internet freedom.
ta: இணைய சுதந்திரத்திற்கான கருவிகளை உருவாக்கும்போது மனிதனை மையமாகக் கொண்ட வடிவமைப்பை நாங்கள் பயிற்சி செய்கிறோம்.

source: You can make an impact in your community by learning from our methods and helping us with user research.
ta: எங்கள் முறைகளிலிருந்து கற்றுக்கொள்வதன் மூலமும், பயனர் ஆராய்ச்சிக்கு எங்களுக்கு உதவுவதன் மூலமும் உங்கள் சமூகத்தில் தாக்கத்தை ஏற்படுத்தலாம்.

source: Learn about Tor users
ta: டோர் பயனர்களைப் பற்றி அறிக

source: We respect our users' privacy when we conduct research.
ta: நாங்கள் ஆராய்ச்சி நடத்தும்போது எங்கள் பயனர்களின் தனியுரிமையை நாங்கள் மதிக்கிறோம்.

source: User Research
ta: பயனர் ஆராய்ச்சி

source: ## Additional links
ta: ## கூடுதல் இணைப்புகள்

source: ## Be a good listener and open-minded
ta: ## ஒரு நல்ல கேட்பவராகவும் திறந்த மனதுடனும் இருங்கள்

source: ## Coordinate with the trainer and the Tor UX team
ta: ## பயிற்சியாளர் மற்றும் டோர் யுஎக்ச் குழுவுடன் ஒருங்கிணைக்கவும்

source: ## Describe and Ask for consent
ta: ## விவரிக்கவும் சம்மதத்தைக் கேட்கவும்

source: ## Get prepared!
ta: ## தயாராகுங்கள்!

source: ## Learn
ta: ## கற்றுக்கொள்ளுங்கள்

source: ## Report to Tor UX team
ta: ## டோர் யுஎக்ச் குழுவுக்கு அறிக்கை

source: ## Respect privacy
ta: ## தனியுரிமையை மதிக்கவும்

source: ## The interview process
ta: ## நேர்காணல் செயல்முறை

source: ### How to submit your findings
ta: ### உங்கள் கண்டுபிடிப்புகளை எவ்வாறு சமர்ப்பிப்பது

source: * [Design Kit: The Human-Centered Design Toolkit](https://www.ideo.com/post/design-kit)
ta: * [வடிவமைப்பு கிட்: மனிதனை மையமாகக் கொண்ட வடிவமைப்பு கருவித்தொகுப்பு] (https://www.ideo.com/post/design-kit)

source: * [OK Thanks Exploratorium ](https://okthanks.com/exploratorium)
ta: * [சரி நன்றி எக்ச்ப்ளோரடோரியம்] (https://okthanks.com/exploratorium)

source: * [Strength in Numbers: Usable Tools Don't Need to Be Invasive](https://blog.torproject.org/strength-numbers-usable-tools-dont-need-be-invasive)
ta: * [Strength in Numbers: Usable கருவிகள் Don't Need பெறுநர் Be Invasive](https://blog.torproject.org/strength-numbers-usable-tools-dont-need-be-invasive)

source: **We strongly recommend that you run through the plan for your session with the trainer**.
ta: ** பயிற்சியாளருடனான உங்கள் அமர்வுக்கான திட்டத்தை இயக்குமாறு நாங்கள் கடுமையாக பரிந்துரைக்கிறோம் **.

source: 1. Write your [report](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/community/user_research_reporting.md) (keep it simple).
ta: 1. உங்கள் [அறிக்கையை] எழுதுங்கள் (https://gitlab.torproject.org/tpo/ux/research/-/blob/master/community/user_research_reporting.md) (இதை எளிமையாக வைத்திருங்கள்).

source: 2. Upload it to our [Gitlab repository](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/README.md).
ta: 2. அதை உங்கள் [github களஞ்சியத்தில்] பதிவேற்றவும் (https://gitlab.torproject.org/tpo/ux/research/-/blob/master/readme.md).

source: 3. Create issues in the [Research repository](https://gitlab.torproject.org/tpo/ux/research/-/issues).
ta: 3. [ஆராய்ச்சி களஞ்சியத்தில்] சிக்கல்களை உருவாக்கவும் (https://gitlab.torproject.org/tpo/ux/research/-/issues).

source: 4. Allow the UX team time to discuss each issue and forward it to developers when necessary.
ta: 4. ஒவ்வொரு சிக்கலையும் விவாதிக்க யுஎக்ச் குழு நேரத்தை அனுமதிக்கவும், தேவைப்படும்போது அதை டெவலப்பர்களுக்கு அனுப்பவும்.

source: After your research is complete we'll ask you to fill a form with your address so we can send you a researcher kit too (including a t-shirt and stickers).
ta: உங்கள் ஆராய்ச்சி முடிந்ததும், உங்கள் முகவரியுடன் ஒரு படிவத்தை நிரப்பும்படி நாங்கள் உங்களிடம் கேட்போம், எனவே நாங்கள் உங்களுக்கு ஒரு ஆராய்ச்சியாளர் கிட்டையும் அனுப்பலாம் (ஒரு சட்டை மற்றும் ச்டிக்கர்கள் உட்பட).

source: At Tor, we don't collect invasive data about user behavior, only the data necessary to improve our services. We test our software, not people.
ta: TOR இல், பயனர் நடத்தை பற்றி வன்கவர்வு தரவை நாங்கள் சேகரிக்கவில்லை, எங்கள் சேவைகளை மேம்படுத்த தேவையான தரவு மட்டுமே. நாங்கள் எங்கள் மென்பொருளை சோதிக்கிறோம், மக்கள் அல்ல.

source: Before ending the session, coordinate with the trainer to solicit feedback from the participants.
ta: அமர்வை முடிப்பதற்கு முன், பங்கேற்பாளர்களிடமிருந்து கருத்துக்களைக் கோர பயிற்சியாளருடன் ஒருங்கிணைக்கவும்.

source: Before your session, read and print the [Demographics questionnaire](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/scripts%20and%20activities/2020/user_demographics-en.md) and [User Research Reporting](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/community/user_research_reporting.md) templates.
ta: உங்கள் அமர்வுக்கு முன், [புள்ளிவிவரங்கள் கேள்வித்தாள்](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/scripts%20and%20activities/2020/user_demographics-en.md)மற்றும் [பயனர் ஆராய்ச்சி அறிக்கையிடல்](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/community/user_research_reporting.md) வார்ப்புருக்கள்.

source: Congrats! You're going to run your first User Research session for Tor – and we're delighted to have you on board!
ta: வாழ்த்துக்கள்! டோருக்கான உங்கள் முதல் பயனர் ஆராய்ச்சி அமர்வை நீங்கள் இயக்கப் போகிறீர்கள் - மேலும் நீங்கள் போர்டில் இருப்பதில் நாங்கள் மகிழ்ச்சியடைகிறோம்!

source: Distribute the demographics questionnaire among the participants, and help answer their questions about how to fill it in if they have any.
ta: பங்கேற்பாளர்களிடையே புள்ளிவிவர கேள்வித்தாளை விநியோகிக்கவும், அவர்களிடம் ஏதேனும் இருந்தால் அதை எவ்வாறு நிரப்புவது என்பது குறித்த அவர்களின் கேள்விகளுக்கு பதிலளிக்க உதவுங்கள்.

source: Don't forget to thank the participant again at the end of the interview.
ta: நேர்காணலின் முடிவில் மீண்டும் பங்கேற்பாளருக்கு நன்றி தெரிவிக்க மறக்காதீர்கள்.

source: During the training session we listen to the stories people tell us about their lives, the laws of the jurisdictions they live in, and the difficulties they are going through.
ta: பயிற்சியின் போது, மக்கள் தங்கள் வாழ்க்கை, அவர்கள் வாழும் அதிகார வரம்புகளின் சட்டங்கள் மற்றும் அவர்கள் கடந்து செல்லும் சிரமங்களைப் பற்றி சொல்லும் கதைகளை நாங்கள் கேட்கிறோம்.

source: First of all, make sure you read the [Tor Code of Conduct](https://community.torproject.org/policies/code_of_conduct).
ta: முதலாவதாக, நீங்கள் [TOR நடத்தை விதிமுறை] (https://community.torproject.org/policies/code_of_conduct) ஐப் படித்ததை உறுதிசெய்க.

source: From elsewhere on the web:
ta: வலையில் வேறு இடங்களிலிருந்து:

source: From the Tor Project:
ta: TOR திட்டத்திலிருந்து:

source: Give each participant a different color of post-it per question and ask them to fill it in with what they think about: 1. the software, service or skill they just learned; 2. the Tor Project; and 3. Tor in general.
ta: ஒவ்வொரு பங்கேற்பாளருக்கும் ஒரு கேள்விக்கு பிந்தைய இடத்தின் வித்தியாசமான வண்ணத்தைக் கொடுத்து, அவர்கள் என்ன நினைக்கிறார்கள் என்பதை நிரப்பும்படி அவர்களிடம் கேளுங்கள்: 1. மென்பொருள், பணி அல்லது திறமை அவர்கள் இப்போது கற்றுக்கொண்டது; 2. டோர் திட்டம்; மற்றும் 3. டோர் பொதுவாக.

source: Here you will find helpful guidelines that are designed to make your research easier for both you and your audience.
ta: உங்களுக்கும் உங்கள் பார்வையாளர்களுக்கும் உங்கள் ஆராய்ச்சியை எளிதாக்கும் வகையில் வடிவமைக்கப்பட்ட பயனுள்ள வழிகாட்டுதல்களை இங்கே காணலாம்.
