Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: The internet would be only limited to watching the propaganda they serve me everyday even on streets...
ta: வீதிகளில் கூட அவர்கள் தினமும் எனக்கு பணி செய்யும் பிரச்சாரத்தைப் பார்ப்பதற்கு மட்டுமே இணையம் மட்டுப்படுத்தப்படும் ...

source: Tor helped me learn new things. I'm in a country where you can get locked up for having different opinions than my government.
ta: புதிய விசயங்களைக் கற்றுக்கொள்ள டோர் எனக்கு உதவினார். எனது அரசாங்கத்தை விட வேறுபட்ட கருத்துக்களைக் கொண்டிருப்பதற்காக நீங்கள் பூட்டக்கூடிய ஒரு நாட்டில் நான் இருக்கிறேன்.

source: Stories
ta: கதைகள்

source: Aiden
ta: ஐடன்

source: I use Tor to participate in grassroots anti-nuclear weapons activism.
ta: அடிமட்ட அணுக்கரு எதிர்ப்பு ஆயுத செயல்பாட்டில் பங்கேற்க நான் டோரைப் பயன்படுத்துகிறேன்.

source: This is quite dangerous so Tor is absolutely essential.
ta: இது மிகவும் ஆபத்தானது, எனவே டோர் முற்றிலும் தேவை.

source: I use Tor to participate in grassroots anti-nuclear weapons activism. This is quite dangerous so Tor is absolutely essential.
ta: அடிமட்ட அணுக்கரு எதிர்ப்பு ஆயுத செயல்பாட்டில் பங்கேற்க நான் டோரைப் பயன்படுத்துகிறேன். இது மிகவும் ஆபத்தானது, எனவே டோர் முற்றிலும் தேவை.

source: Akio
ta: அகியோ

source: During the past 4-5 years, I have used the Tor Browser to connect to "thousands" of sites.
ta: கடந்த 4-5 ஆண்டுகளில், "ஆயிரக்கணக்கான" தளங்களுடன் இணைக்க டோர் உலாவியைப் பயன்படுத்தினேன்.

source: I cannot express in just a few words how much I love Tor.
ta: நான் டோர் எவ்வளவு நேசிக்கிறேன் என்பதை சில வார்த்தைகளில் வெளிப்படுத்த முடியாது.

source: I face minimum risk, except for corporate business tracking.
ta: கார்ப்பரேட் வணிக கண்காணிப்பைத் தவிர, குறைந்தபட்ச ஆபத்தை நான் எதிர்கொள்கிறேன்.

source: I use Tor Browser as my everyday browser, nearly 100% of the time. I am in the USA.
ta: நான் டோர் உலாவியை எனது அன்றாட உலாவியாகப் பயன்படுத்துகிறேன், கிட்டத்தட்ட 100% நேரம். நான் அமெரிக்காவில் இருக்கிறேன்.

source: Tor has helped me to preserve my anonymity and protect my privacy, which are of great importance to me online.
ta: எனது அநாமதேயத்தைப் பாதுகாக்கவும், எனது தனியுரிமையைப் பாதுகாக்கவும் டோர் எனக்கு உதவியுள்ளார், இது ஆன்லைனில் எனக்கு மிகவும் முக்கியத்துவம் வாய்ந்தது.

source: Without Tor, I would feel like I had a hole in me, an empty feeling, uncomfortable, not good.
ta: டோர் இல்லாமல், என்னுள் ஒரு துளை இருப்பதைப் போல உணருவேன், ஒரு வெற்று உணர்வு, சங்கடமான, நல்லதல்ல.

source: I use Tor Browser as my everyday browser, nearly 100% of the time. I am in USA. I face minimum risk, except for corporate business tracking. During the past 4-5 years, I have used the Tor Browser to connect to "thousands" of sites.
ta: நான் டோர் உலாவியை எனது அன்றாட உலாவியாகப் பயன்படுத்துகிறேன், கிட்டத்தட்ட 100% நேரம். நான் அமெரிக்காவில் இருக்கிறேன். கார்ப்பரேட் வணிக கண்காணிப்பைத் தவிர, குறைந்தபட்ச ஆபத்தை நான் எதிர்கொள்கிறேன். கடந்த 4-5 ஆண்டுகளில், "ஆயிரக்கணக்கான" தளங்களுடன் இணைக்க டோர் உலாவியைப் பயன்படுத்தினேன்.

source: Alexis
ta: அலெக்சிச்

source: I am a trans-lesbian and I would rather decide who to tell this to.
ta: நான் ஒரு டிரான்ச்-லெச்பியன், இதை யாருக்குச் சொல்வது என்று நான் தீர்மானிக்கிறேன்.

source: I am able to be more confident talking about this with people I meet online.
ta: நான் ஆன்லைனில் சந்திக்கும் நபர்களுடன் இதைப் பற்றி பேசுவதில் அதிக நம்பிக்கையுடன் இருக்க முடிகிறது.

source: Keeping my social and sexual lives separate.
ta: எனது சமூக மற்றும் பாலியல் வாழ்க்கையை தனித்தனியாக வைத்திருத்தல்.

source: Mitigating risk of unnecessary exposure and judgement.
ta: தேவையற்ற வெளிப்பாடு மற்றும் தீர்ப்பின் அபாயத்தைத் தணித்தல்.

source: This has helped with my confidence offline too.
ta: இது எனது நம்பிக்கையை ஆஃப்லைனில் உதவியது.

source: Alva
ta: ஆல்வா

source: I don't believe online security, privacy or anonymity are only for criminals, but are an inherent right in a democratic republic.
ta: நிகழ்நிலை பாதுகாப்பு, தனியுரிமை அல்லது பெயர் தெரியாதது குற்றவாளிகளுக்கு மட்டுமே என்று நான் நம்பவில்லை, ஆனால் ஒரு சனநாயக குடியரசில் உள்ளார்ந்த உரிமை.

source: I have never done anything remotely illegal online, I fervently believe that my personal data, my browsing habits etc. are my business, and I refuse to have someone looking over my shoulder if I can prevent it at all.
ta: ஆன்லைனில் தொலைதூர சட்டவிரோதமான எதையும் நான் செய்ததில்லை, எனது தனிப்பட்ட தரவு, எனது உலாவல் பழக்கம் போன்றவை எனது வணிகம் என்று நான் ஆர்வமாக நம்புகிறேன், அதைத் தடுக்க முடிந்தால் யாராவது என் தோள்பட்டைக்கு மேல் பார்க்க மறுக்கிறேன்.

source: I think online security and privacy are CRITICAL to maintain a free society.
ta: ஒரு சுதந்திர சமுதாயத்தை பராமரிக்க நிகழ்நிலை பாதுகாப்பும் தனியுரிமையும் முக்கியமானவை என்று நான் நினைக்கிறேன்.

source: Security and privacy are not just a right, but an obligation for all freedom-loving people.
ta: பாதுகாப்பும் தனியுரிமையும் ஒரு உரிமை மட்டுமல்ல, சுதந்திரத்தை நேசிக்கும் அனைத்து மக்களுக்கும் ஒரு கடமை.

source: Amani
ta: அமானி

source: I desperately needed a means to secure my online privacy because I am a cyberstalking victim whose online identity has been both stolen and compromised.
ta: எனது நிகழ்நிலை தனியுரிமையைப் பாதுகாப்பதற்கான வழிமுறையை நான் மிகவும் தேவைப்பட்டேன், ஏனென்றால் நான் ஒரு சைபர்ச்டாக்கிங் பாதிக்கப்பட்டவனாக இருக்கிறேன், அதன் நிகழ்நிலை அடையாளம் திருடப்பட்டு வேறுபாடின்மை செய்யப்பட்டுள்ளது.

source: I started using Tor to protect my privacy and protect me from abuse.
ta: எனது தனியுரிமையைப் பாதுகாக்கவும், துச்பிரயோகத்திலிருந்து என்னைப் பாதுகாக்கவும் டோரைப் பயன்படுத்தத் தொடங்கினேன்.

source: Barbara
ta: பார்பரா

source: An internet without Tor is an internet I wouldn't want to use for many things.
ta: டோர் இல்லாத இணையம் ஒரு இணையம், நான் பல விசயங்களுக்கு பயன்படுத்த விரும்பாத.

source: Currently governments of nearly all states have passed or are planning on new police laws.
ta: தற்போது கிட்டத்தட்ட அனைத்து மாநிலங்களின் அரசாங்கங்களும் புதிய பொலிச் சட்டங்களை நிறைவேற்றியுள்ளன அல்லது திட்டமிட்டுள்ளன.

source: I am a left-wing political activist...
ta: நான் ஒரு இடதுசாரி அரசியல் ஆர்வலர் ...

source: I use Tor in my daily political work to stay a bit under the radar of secret agencies and police.
ta: இரகசிய முகவர் மற்றும் காவல்துறையின் ரேடரின் கீழ் சற்று தங்குவதற்கு எனது அன்றாட அரசியல் பணிகளில் டாரைப் பயன்படுத்துகிறேன்.

source: It helps me stay anonymous on the internet and do research without being followed.
ta: இது இணையத்தில் அநாமதேயமாக இருக்கவும், பின்பற்றாமல் ஆராய்ச்சி செய்யவும் எனக்கு உதவுகிறது.

source: Not only that I don't want to share all my personal data with random strange companies, I also don't want to face repression for legitimate human rights political work.
ta: எனது தனிப்பட்ட தரவு அனைத்தையும் சீரற்ற விசித்திரமான நிறுவனங்களுடன் பகிர்ந்து கொள்ள நான் விரும்பவில்லை என்பது மட்டுமல்லாமல், முறையான மனித உரிமைகள் அரசியல் பணிகளுக்காக அடக்குமுறையை எதிர்கொள்ள நான் விரும்பவில்லை.

source: These laws are against basic human rights and open possibilities of mass-surveillance.
ta: இந்த சட்டங்கள் அடிப்படை மனித உரிமைகள் மற்றும் வெகுசன-சரிவின் திறந்த சாத்தியக்கூறுகள்.

source: Thus, technologies like Tor are essential not only for the people trying to stop these law aggravations but for all of us.
ta: ஆகவே, டோர் போன்ற தொழில்நுட்பங்கள் இந்த சட்ட மோசடிகளை நிறுத்த முயற்சிக்கும் மக்களுக்கு மட்டுமல்ல, நம் அனைவருக்கும் தேவை.

source: Biljana
ta: பில்சானா

source: I have patients who work on legislation that can mean billions of dollars to major telecom, social media, and search concerns.
ta: முக்கிய தொலைதொடர்பு, சமூக ஊடகங்கள் மற்றும் தேடல் கவலைகளுக்கு பில்லியன் கணக்கான டாலர்களைக் குறிக்கும் சட்டத்தில் பணிபுரியும் நோயாளிகள் என்னிடம் உள்ளனர்.

source: I use Tor to do much of my research when I think there is a risk of correlating it to patient visits.
ta: நோயாளியின் வருகைகளுடன் அதை தொடர்புபடுத்தும் இடர் இருப்பதாக நான் நினைக்கும் போது எனது ஆராய்ச்சியை அதிகம் செய்ய நான் டோரைப் பயன்படுத்துகிறேன்.

source: I'm a doctor in a very political town.
ta: நான் மிகவும் அரசியல் நகரத்தில் ஒரு மருத்துவர்.

source: When I have to do research on diseases and treatment or look into aspects of my patients' histories, I am well aware that my search histories might be correlated to patient visits and leak information about their health, families, and personal lives.
ta: நோய்கள் மற்றும் சிகிச்சையைப் பற்றி நான் ஆராய்ச்சி செய்ய வேண்டியிருக்கும் போது அல்லது எனது நோயாளிகளின் வரலாறுகளின் அம்சங்களைப் பார்க்க வேண்டியிருக்கும் போது, எனது தேடல் வரலாறுகள் நோயாளியின் வருகைகளுடன் தொடர்புபடுத்தப்படலாம் மற்றும் அவர்களின் உடல்நலம், குடும்பங்கள் மற்றும் தனிப்பட்ட வாழ்க்கையைப் பற்றிய தகவல்களை கசியும் என்பதை நான் நன்கு அறிவேன்.

source: I'm a doctor in a very political town. I have patients who work on legislation that can mean billions of dollars to major telecom, social media, and search concerns.
ta: நான் மிகவும் அரசியல் நகரத்தில் ஒரு மருத்துவர். முக்கிய தொலைதொடர்பு, சமூக ஊடகங்கள் மற்றும் தேடல் கவலைகளுக்கு பில்லியன் கணக்கான டாலர்களைக் குறிக்கும் சட்டத்தில் பணிபுரியும் நோயாளிகள் என்னிடம் உள்ளனர்.

source: Branka
ta: பிரான்கா

source: I don't want that anyone knows about these diseases who I don't want to tell about this.
ta: இதைப் பற்றி நான் சொல்ல விரும்பாத இந்த நோய்களைப் பற்றி யாருக்கும் தெரியும் என்று நான் விரும்பவில்லை.

source: I use the Tor Browser to research about mental diseases, e.g. depression, that occur in our family.
ta: மன நோய்களைப் பற்றி ஆராய்ச்சி செய்ய நான் டோர் உலாவியைப் பயன்படுத்துகிறேன், எ.கா. மனச்சோர்வு, அவை எங்கள் குடும்பத்தில் நிகழ்கின்றன.

source: That's why I use Tor for researching about anything related to these diseases.
ta: அதனால்தான் இந்த நோய்கள் தொடர்பான எதையும் பற்றி ஆராய்ச்சி செய்ய நான் TOR ஐப் பயன்படுத்துகிறேன்.

source: Braylen
ta: பிரெய்லன்

source: Being able to protect my patients' personal information was of paramount importance.
ta: எனது நோயாளிகளின் தனிப்பட்ட தகவல்களைப் பாதுகாக்க முடியும் என்பது மிக முக்கியமானது.

source: I was a family physician and clinical psychiatrist for 25 years, often working with members of marginalized and persecuted groups.
ta: நான் 25 ஆண்டுகளாக ஒரு குடும்ப மருத்துவர் மற்றும் மருத்துவ மனநல மருத்துவராக இருந்தேன், பெரும்பாலும் ஓரங்கட்டப்பட்ட மற்றும் துன்புறுத்தப்பட்ட குழுக்களின் உறுப்பினர்களுடன் பணிபுரிந்தேன்.

source: I was a family physician and clinical psychiatrist for 25 years, often working with members of marginalized and persecuted groups. Being able to protect my patients' personal information was of paramount importance.
ta: நான் 25 ஆண்டுகளாக ஒரு குடும்ப மருத்துவர் மற்றும் மருத்துவ மனநல மருத்துவராக இருந்தேன், பெரும்பாலும் ஓரங்கட்டப்பட்ட மற்றும் துன்புறுத்தப்பட்ட குழுக்களின் உறுப்பினர்களுடன் பணிபுரிந்தேன். எனது நோயாளிகளின் தனிப்பட்ட தகவல்களைப் பாதுகாக்க முடியும் என்பது மிக முக்கியமானது.

source: Carmen
ta: கார்மென்

source: This is a collection of anonymous user stories from people who rely on Tor to
ta: இது டோர் நம்பியவர்களிடமிருந்து அநாமதேய பயனர் கதைகளின் தொகுப்பு

source: experiences with your network, friends and family, or as part of your work to
ta: உங்கள் பிணையம், நண்பர்கள் மற்றும் குடும்பத்தினர் அல்லது உங்கள் வேலையின் ஒரு பகுதியாக அனுபவங்கள்

source: promote the use of privacy-preserving technologies like ours and help us defend
ta: எங்களைப் போன்ற தனியுரிமையைப் பாதுகாக்கும் தொழில்நுட்பங்களின் பயன்பாட்டை ஊக்குவிக்கவும், பாதுகாக்க எங்களுக்கு உதவவும்

source: protect their privacy and anonymity. We encourage you to share their
ta: அவர்களின் தனியுரிமை மற்றும் அநாமதேயத்தைப் பாதுகாக்கவும். அவற்றைப் பகிர்ந்து கொள்ள நாங்கள் உங்களை ஊக்குவிக்கிறோம்

source: strong online protections.
ta: வலுவான நிகழ்நிலை பாதுகாப்புகள்.

source: There are many reasons why people rely on Tor's privacy protections. Learn more about the real-life experiences of our diverse user base and help us spread the word.
ta: டோரின் தனியுரிமை பாதுகாப்புகளை மக்கள் நம்புவதற்கு பல காரணங்கள் உள்ளன. எங்கள் மாறுபட்ட பயனர் தளத்தின் நிச வாழ்க்கை அனுபவங்களைப் பற்றி மேலும் அறிக மற்றும் வார்த்தையை பரப்ப எங்களுக்கு உதவுங்கள்.

source: User stories
ta: பயனர் கதைகள்

source: I use Tor and other encrypted services and believe that all digital services and applications should be encrypted.
ta: நான் டோர் மற்றும் பிற மறைகுறியாக்கப்பட்ட சேவைகளைப் பயன்படுத்துகிறேன், மேலும் அனைத்து டிசிட்டல் சேவைகள் மற்றும் பயன்பாடுகளும் குறியாக்கம் செய்யப்பட வேண்டும் என்று நம்புகிறேன்.

source: In a world in which the Patriot Act has removed basic protections guaranteed by the Fourth Amendment, US citizens have lost way too much in privacy rights to risk any transaction on an insecure platform.
ta: நான்காவது திருத்தத்தால் பொறுப்பு அளிக்கப்பட்ட அடிப்படை பாதுகாப்புகளை தேசபக்த சட்டம் நீக்கியுள்ள உலகில், அமெரிக்க குடிமக்கள் பாதுகாப்பற்ற மேடையில் எந்தவொரு பரிவர்த்தனையையும் அபாயப்படுத்த தனியுரிமை உரிமைகளில் அதிக வழியை இழந்துவிட்டனர்.

source: The lack of an enforceable privacy standard in the U. S. make caution necessary when dealing with any digital communication.
ta: எந்தவொரு டிசிட்டல் தகவல்தொடர்புகளையும் கையாளும் போது யு.எச். இல் நடைமுறைப்படுத்தக்கூடிய தனியுரிமை தரத்தின் பற்றாக்குறை அவசியமாக்குகிறது.

source: Dakota
ta: டகோதா

source: I'm from Brazil, and I've been using it for over 3 years.
ta: நான் பிரேசிலிலிருந்து வந்தவன், நான் 3 ஆண்டுகளுக்கும் மேலாக அதைப் பயன்படுத்துகிறேன்.

source: Tor Browser has helped me a lot in protecting me from fingerprinting on the web.
ta: வலையில் கைரேகையிலிருந்து என்னைப் பாதுகாப்பதில் டோர் உலாவி எனக்கு நிறைய உதவியது.

source: I'm from Brazil, and I've been using it for over 3 years. Tor has helped me a lot in protecting me from fingerprinting on the web.
ta: நான் பிரேசிலிலிருந்து வந்தவன், நான் 3 ஆண்டுகளுக்கும் மேலாக அதைப் பயன்படுத்துகிறேன். வலையில் கைரேகையிலிருந்து என்னைப் பாதுகாப்பதில் டோர் எனக்கு நிறைய உதவியுள்ளார்.

source: Diego
ta: டியாகோ

source: (Although they don't have the same attitude to privacy as I do).
ta: (நான் செய்வது போன்ற தனியுரிமைக்கு அவர்களுக்கு ஒரே அணுகுமுறை இல்லை என்றாலும்).

source: As teenagers, they, or their friends, are bumping into issues regarding sex, drugs, social media, and bullying.
ta: இளைஞர்கள், அவர்கள் அல்லது அவர்களது நண்பர்கள், பாலியல், போதைப்பொருள், சமூக ஊடகங்கள் மற்றும் கொடுமைப்படுத்துதல் தொடர்பான பிரச்சினைகளில் மோதிக் கொண்டிருக்கிறார்கள்.

source: I also encourage my children to use Tor for their research for the same reasons.
ta: அதே காரணங்களுக்காக டோர் தங்கள் ஆராய்ச்சியைப் பயன்படுத்த என் குழந்தைகளை ஊக்குவிக்கிறேன்.

source: I am a father of two teenagers.
ta: நான் இரண்டு இளைஞர்களின் தந்தை.

source: I use Tor to do the research to basically avoid telling Google (and others) that my children have these issues.
ta: எனது குழந்தைகளுக்கு இந்த பிரச்சினைகள் உள்ளன என்று கூகிள் (மற்றும் பிறர்) சொல்வதைத் தவிர்க்க ஆராய்ச்சி செய்ய நான் டோரைப் பயன்படுத்துகிறேன்.

source: It would be unethical of any parent NOT to do so and expose their children’s issues to these corporations.
ta: எந்தவொரு பெற்றோரும் அவ்வாறு செய்யாதது மற்றும் அவர்களின் குழந்தைகளின் பிரச்சினைகளை இந்த நிறுவனங்களுக்கு அம்பலப்படுத்துவது நெறிமுறையற்றது.

source: They are pretty open about many of these issues and so I try to be up to date with research, information, and details if anything arises.
ta: இந்த சிக்கல்களில் பலவற்றைப் பற்றி அவை மிகவும் திறந்திருக்கும், எனவே ஏதேனும் எழுந்தால் ஆராய்ச்சி, செய்தி மற்றும் விவரங்களுடன் புதுப்பித்த நிலையில் இருக்க முயற்சிக்கிறேன்.

source: I am a father of two teenagers. As teenagers, they, or their friends, are bumping into issues regarding sex, drugs, social media, and bullying.
ta: நான் இரண்டு இளைஞர்களின் தந்தை. இளைஞர்கள், அவர்கள் அல்லது அவர்களது நண்பர்கள், பாலியல், போதைப்பொருள், சமூக ஊடகங்கள் மற்றும் கொடுமைப்படுத்துதல் தொடர்பான பிரச்சினைகளில் மோதிக் கொண்டிருக்கிறார்கள்.

source: Ethan
ta: ஈதன்

source: I used Tor to obtain documents from Wikileaks, which helped expose local surveillance by military units of janitorial union organizing meetings, groups pressing for the rights of migrant workers etc.
ta: விக்கிலீக்சிடமிருந்து ஆவணங்களைப் பெற நான் டோரைப் பயன்படுத்தினேன், இது காவல்துறை தொழிற்சங்கக் கூட்டங்களை ஒழுங்கமைக்கும் இராணுவ அலகுகள், புலம்பெயர்ந்த தொழிலாளர்களின் உரிமைகளுக்கு அழுத்தம் கொடுக்கும் குழுக்கள் போன்றவற்றின் உள்ளக கண்காணிப்பை அம்பலப்படுத்த உதவியது.

source: I used Tor to obtain documents from Wikileaks.
ta: விக்கிலீக்சிலிருந்து ஆவணங்களைப் பெற நான் டோரைப் பயன்படுத்தினேன்.

source: Fumie
ta: ச்டெபமிக்

source: I've been using Tor for more than a year, and the Internet certainly wouldn't be as free without Tor.
ta: நான் ஒரு வருடத்திற்கும் மேலாக டோரைப் பயன்படுத்துகிறேன், இணையம் நிச்சயமாக டோர் இல்லாமல் இலவசமாக இருக்காது.

source: Tor makes sure I have a generic internet profile, free from any specifications.
ta: எந்தவொரு விவரக்குறிப்புகளிலிருந்தும் இலவசமாக, எனக்கு பொதுவான இணைய சுயவிவரம் இருப்பதை TOR உறுதி செய்கிறது.

source: Gabriella
ta: கேப்ரியெல்லா

source: I am a simple user.
ta: நான் ஒரு எளிய பயனர்.

source: I love Tor's system and everything that it stands for.
ta: டோரின் அமைப்பையும் அது நிற்கும் அனைத்தையும் நான் விரும்புகிறேன்.

source: I love privacy-related tools and I am very interested in encryption, decryption and security.
ta: தனியுரிமை தொடர்பான கருவிகளை நான் விரும்புகிறேன், குறியாக்கம், மறைகுறியாக்கம் மற்றும் பாதுகாப்பு ஆகியவற்றில் நான் மிகவும் ஆர்வமாக உள்ளேன்.

source: I use Tor for my privacy as well as to access region-restricted sites.
ta: எனது தனியுரிமைக்காகவும், பிராந்தியத்தால் தடைசெய்யப்பட்ட தளங்களை அணுகவும் நான் TOR ஐப் பயன்படுத்துகிறேன்.

source: I am a simple user. I love privacy-related tools and I am very interested in encryption, decryption and security.
ta: நான் ஒரு எளிய பயனர். தனியுரிமை தொடர்பான கருவிகளை நான் விரும்புகிறேன், குறியாக்கம், மறைகுறியாக்கம் மற்றும் பாதுகாப்பு ஆகியவற்றில் நான் மிகவும் ஆர்வமாக உள்ளேன்.

source: Galla
ta: கல்லா

source: I decided to take back my privacy and I have been using Tor ever since.
ta: எனது தனியுரிமையை திரும்பப் பெற முடிவு செய்தேன், அன்றிலிருந்து நான் டோரைப் பயன்படுத்துகிறேன்.

source: I no longer fear the internet and I have the Tor team to thank for that.
ta: நான் இனி இணையத்திற்கு அஞ்சமாட்டேன், அதற்கு நன்றி தெரிவிக்க டோர் குழு உள்ளது.

source: It has given me peace of mind... It has been empowering.
ta: இது எனக்கு மன அமைதியை அளித்துள்ளது ... அது அதிகாரம் அளிக்கிறது.

source: Hasim
ta: சந்திப்பு

source: The politics [here] is kind of crazy so I kind of fear about any of my data stored by the government.
ta: அரசியல் [இங்கே] ஒருவித பைத்தியம், எனவே அரசாங்கத்தால் சேமிக்கப்பட்ட எனது எந்த தரவையும் பற்றி நான் பயப்படுகிறேன்.

source: They can be really easily misused for life-threatening purposes.
ta: உயிருக்கு ஆபத்தான நோக்கங்களுக்காக அவை மிகவும் எளிதில் தவறாகப் பயன்படுத்தப்படலாம்.

source: Isabella
ta: இசபெல்லா

source: Although my physical well being is not threatened by the mass surveillance I mentally feel much more at ease knowing that my browsing history is protected by using Tor.
ta: வெகுசன கண்காணிப்பால் எனது உடல் நல்வாழ்வு அச்சுறுத்தப்படவில்லை என்றாலும், டோர் பயன்படுத்துவதன் மூலம் எனது உலாவல் வரலாறு பாதுகாக்கப்படுகிறது என்பதை அறிந்து நான் மனதளவில் அதிகமாக உணர்கிறேன்.

source: I do not face any direct threats or risks regarding my use of the internet, and solely use Tor to avoid mass surveillance of my browsing history.
ta: நான் இணையத்தைப் பயன்படுத்துவது தொடர்பான நேரடி அச்சுறுத்தல்கள் அல்லது அபாயங்களை நான் எதிர்கொள்ளவில்லை, மேலும் எனது உலாவல் வரலாற்றின் வெகுசன கண்காணிப்பைத் தவிர்க்க டோரைப் பயன்படுத்துகிறேன்.

source: I'm in the UK.
ta: நான் இங்கிலாந்தில் இருக்கிறேன்.

source: Otherwise my ISP would have a full 24/7 record of my browsing which by law has to be kept by them for a full 12 months.
ta: இல்லையெனில், எனது ISP எனது உலாவலின் முழு 24/7 பதிவைக் கொண்டிருக்கும், இது சட்டப்படி அவர்களால் முழு 12 மாதங்களுக்கு வைத்திருக்க வேண்டும்.

source: I'm in the UK. I do not face any direct threats or risks regarding my use of the internet, and solely use Tor to avoid mass surveillance of my browsing history.
ta: நான் இங்கிலாந்தில் இருக்கிறேன். நான் இணையத்தைப் பயன்படுத்துவது தொடர்பான நேரடி அச்சுறுத்தல்கள் அல்லது அபாயங்களை நான் எதிர்கொள்ளவில்லை, மேலும் எனது உலாவல் வரலாற்றின் வெகுசன கண்காணிப்பைத் தவிர்க்க டோரைப் பயன்படுத்துகிறேன்.

source: Israa
ta: இச்ரேல்

source: But I use Tor to protect others.
ta: ஆனால் மற்றவர்களைப் பாதுகாக்க நான் டோரைப் பயன்படுத்துகிறேன்.

source: It is such an important issue for journalists and activists so I want to support strengthening privacy and encryption laws to serve all users.
ta: பத்திரிகையாளர்கள் மற்றும் ஆர்வலர்களுக்கு இது ஒரு முக்கியமான பிரச்சினையாகும், எனவே அனைத்து பயனர்களுக்கும் பணி செய்ய தனியுரிமை மற்றும் குறியாக்க சட்டங்களை வலுப்படுத்துவதை நான் ஆதரிக்க விரும்புகிறேன்.

source: Really, I personally don’t need to worry much about my privacy.
ta: உண்மையில், நான் தனிப்பட்ட முறையில் எனது தனியுரிமையைப் பற்றி அதிகம் கவலைப்பட தேவையில்லை.

source: Really, I personally don’t need to worry much about my privacy. But I use Tor to protect others.
ta: உண்மையில், நான் தனிப்பட்ட முறையில் எனது தனியுரிமையைப் பற்றி அதிகம் கவலைப்பட தேவையில்லை. ஆனால் மற்றவர்களைப் பாதுகாக்க நான் டோரைப் பயன்படுத்துகிறேன்.

source: Jackson
ta: சாக்சன்

source: Encryption is the only way to ensure they can securly voice their opinion.
ta: குறியாக்கமே அவர்கள் தங்கள் கருத்தை பாதுகாப்பாக குரல் கொடுக்க முடியும் என்பதை உறுதிப்படுத்த ஒரே வழி.

source: Even in some parts of Europe sharing your own opinion or beliefs on politics, religion, abortion, sexual orientation etc. is dangerous and can easily lead to severe consequences.
ta: ஐரோப்பாவின் சில பகுதிகளில் கூட அரசியல், மதம், கருக்கலைப்பு, பாலியல் நோக்குநிலை போன்ற உங்கள் சொந்த கருத்தை அல்லது நம்பிக்கைகளைப் பகிர்ந்து கொள்வது ஆபத்தானது மற்றும் கடுமையான விளைவுகளுக்கு எளிதில் வழிவகுக்கும்.

source: I live in Europe and am not by any means an important, critical or endangered person, but I have friends in other parts of the world to whom anonymity and privacy through encryption is crucial.
ta: நான் ஐரோப்பாவில் வசிக்கிறேன், எந்த வகையிலும் ஒரு முக்கியமான, விமர்சன அல்லது ஆபத்தான நபர் அல்ல, ஆனால் உலகின் பிற பகுதிகளில் எனக்கு நண்பர்கள் உள்ளனர், அவர்களிடம் அநாமதேயமும், குறியாக்கத்தின் மூலம் தனியுரிமையும் முக்கியமானவை.

source: I live in Europe and am not by any means an important, critical or endangered person, but I have friends in other parts of the world to whom anonymity and privacy through encryption is crucial. Encryption is the only way to ensure they can securly voice their opinion.
ta: நான் ஐரோப்பாவில் வசிக்கிறேன், எந்த வகையிலும் ஒரு முக்கியமான, விமர்சன அல்லது ஆபத்தான நபர் அல்ல, ஆனால் உலகின் பிற பகுதிகளில் எனக்கு நண்பர்கள் உள்ளனர், அவர்களிடம் அநாமதேயமும், குறியாக்கத்தின் மூலம் தனியுரிமையும் முக்கியமானவை. குறியாக்கமே அவர்கள் தங்கள் கருத்தை பாதுகாப்பாக குரல் கொடுக்க முடியும் என்பதை உறுதிப்படுத்த ஒரே வழி.

source: Kai
ta: கை

source: I strongly believe encryption is essential for a healthy democracy, for the privacy of every human being on this planet and to combat/reduce government abuse of power and mass surveillance.
ta: ஆரோக்கியமான சனநாயகத்திற்கு குறியாக்கம் தேவை என்று நான் உறுதியாக நம்புகிறேன், இந்த கிரகத்தில் உள்ள ஒவ்வொரு மனிதனின் தனியுரிமைக்கும், அதிகாரத்தை அரசாங்கத்தின் தீய பயன்பாடு மற்றும் வெகுசன கண்காணிப்புகளை எதிர்த்துப் போராட/குறைக்க.

source: I strongly believe encryption is essential for a healthy democracy, for the privacy of every human being on this planet and to combat/reduce government abuse of power and mass surveillance.
ta: ஆரோக்கியமான சனநாயகத்திற்கு குறியாக்கம் தேவை என்று நான் உறுதியாக நம்புகிறேன், இந்த கிரகத்தில் உள்ள ஒவ்வொரு மனிதனின் தனியுரிமைக்கும், அதிகாரத்தை அரசாங்கத்தின் தீய பயன்பாடு மற்றும் வெகுசன கண்காணிப்புகளை எதிர்த்துப் போராட/குறைக்க.

source: Luca
ta: லூகா

source: It enables me to access content I couldn't from my country's IP range.
ta: எனது நாட்டின் ஐபி வரம்பிலிருந்து என்னால் முடியாத உள்ளடக்கத்தை அணுக இது எனக்கு உதவுகிறது.

source: Onion services are the most reliable tool to keep access to devices behind one-way firewalls.
ta: ஒரு வழி ஃபயர்வால்களுக்குப் பின்னால் சாதனங்களை அணுகுவதற்கான மிகவும் நம்பகமான கருவியாக வெங்காய சேவைகள் உள்ளன.

source: Protects me from different identities being correlated via IP address or browser features.
ta: ஐபி முகவரி அல்லது உலாவி நற்பொருத்தங்கள் வழியாக தொடர்புடைய வெவ்வேறு அடையாளங்களிலிருந்து என்னைப் பாதுகாக்கிறது.
