Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: FAQ written by the Electronic Frontier Foundation (EFF). Last updated March 27, 2020.
ta: மின்னணு எல்லைப்புற அறக்கட்டளை (EFF) எழுதிய கேள்விகள். கடைசியாக மார்ச் 27, 2020 இல் புதுப்பிக்கப்பட்டது.

source: The Legal FAQ for Tor Relay Operators
ta: டோர் ரிலே ஆபரேட்டர்களுக்கான சட்ட கேள்விகள்

source: (The Tor Project has an [abuse collection of templates](../../tor-abuse-templates/) to help you respond to other types of abuse complaints, too.)
ta: (The Tor திட்டம் has an [abuse collection of templates](../../tor-abuse-templates/) பெறுநர் உதவி you respond பெறுநர் மற்றொன்று வகைகள் of abuse complaints, too.)

source: Also, if you received this document from anywhere other than the EFF web site or [tor-dmca-response](../tor-dmca-response), it may be out of date.
ta: மேலும்.

source: As you know, the DMCA creates four "safe harbors" for service providers to protect them from copyright liability for the acts of their users, when the ISPs fulfill certain requirements. (17 U.S.C. 512)
ta: உங்களுக்குத் தெரிந்தபடி, ஐ.எச்.பி.எச் சில தேவைகளை நிறைவு செய்யும் போது, தங்கள் பயனர்களின் செயல்களுக்கான பதிப்புரிமை பொறுப்பிலிருந்து அவர்களைப் பாதுகாக்க பணி வழங்குநர்களுக்கு டி.எம்.சி.ஏ நான்கு "பாதுகாப்பான துறைமுகங்களை" உருவாக்குகிறது. (17 யு.எச்.சி 512)

source: Before sending any response to your ISP, you may want to seek the advice of an attorney licensed to practice in your jurisdiction.
ta: உங்கள் ISP க்கு ஏதேனும் பதிலை அனுப்புவதற்கு முன், உங்கள் அதிகார வரம்பில் பயிற்சி செய்ய உரிமம் பெற்ற ஒரு வழக்கறிஞரின் ஆலோசனையைப் பெற விரும்பலாம்.

source: Dear [ISP]:
ta: அன்பே [ISP]:

source: Follow the link to get the latest version.
ta: அண்மைக் கால பதிப்பைப் பெற இணைப்பைப் பின்தொடரவும்.

source: For these reasons, I am not an infringer of copyright in any materials that are transmitted through the Tor node that I run, either directly or under a theory of contributory or vicarious liability.
ta: இந்த காரணங்களுக்காக, நான் நேரடியாகவோ அல்லது பங்களிப்பு அல்லது மோசமான பொறுப்பு கோட்பாட்டின் கீழ் அல்லது நான் இயக்கும் டோர் முனை வழியாக பரவும் எந்தவொரு பொருட்களிலும் நான் பதிப்புரிமை மீறல் அல்ல.

source: Fortunately, copyright law should provide protections from many of them both to you and to your upstream provider.
ta: அதிர்ச்டவசமாக, பதிப்புரிமைச் சட்டம் அவற்றில் பலவற்றிலிருந்து உங்களுக்கும் உங்கள் மேலோடை வழங்குநருக்கும் பாதுகாப்பை வழங்க வேண்டும்.

source: I do not select the material transmitted through the Tor node that I run, and I have no practical means of either identifying the source of such material or preventing its transmission.
ta: நான் இயங்கும் டோர் முனை வழியாக அனுப்பப்படும் பொருளை நான் தேர்ந்தெடுக்கவில்லை, மேலும் அத்தகைய பொருளின் மூலத்தை அடையாளம் காண்பது அல்லது அதன் பரிமாற்றத்தைத் தடுப்பதற்கான நடைமுறை வழிமுறைகள் எனக்கு இல்லை.

source: I do nothing to encourage or promote the use of the Tor network for copyright infringement.
ta: பதிப்புரிமை மீறலுக்கான TOR நெட்வொர்க்கின் பயன்பாட்டை ஊக்குவிக்க அல்லது ஊக்குவிக்க நான் எதுவும் செய்யவில்லை.

source: I hope, as an organization committed to protecting the privacy of its customers, you'll agree that this is a valuable technology.
ta: அதன் வாடிக்கையாளர்களின் தனியுரிமையைப் பாதுகாக்க உறுதிபூண்டுள்ள ஒரு அமைப்பாக, இது ஒரு மதிப்புமிக்க தொழில்நுட்பம் என்பதை நீங்கள் ஒப்புக்கொள்கிறீர்கள் என்று நம்புகிறேன்.

source: If not, please contact me with any further questions.
ta: இல்லையென்றால், மேலும் ஏதேனும் கேள்விகளுடன் என்னை தொடர்பு கொள்ளவும்.

source: If you have and implement such a policy, and you otherwise qualify for the safe harbor, you should be free from fear of copyright damages.
ta: உங்களிடம் அத்தகைய கொள்கையை வைத்திருந்தால், பாதுகாப்பான துறைமுகத்திற்கு நீங்கள் தகுதி பெற்றிருந்தால், நீங்கள் பதிப்புரிமை சேதங்களுக்கு பயப்படுவதிலிருந்து விடுபட வேண்டும்.

source: If you're not comfortable including so much legal explanation, feel free to invite the ISP to contact EFF for a fuller discussion.
ta: இவ்வளவு சட்டப்பூர்வ விளக்கத்தை நீங்கள் வசதியாக இல்லாவிட்டால், ஒரு முழுமையான விவாதத்திற்கு EFF ஐ தொடர்பு கொள்ள ISP ஐ அழைக்க தயங்க.

source: If your Internet host forwards a copyright complaint to you, you can use this template to write a response, though you will need to customize it to your situation.
ta: உங்கள் இணைய புரவலன் உங்களுக்கு பதிப்புரிமை புகாரை அனுப்பினால், இந்த வார்ப்புருவைப் பயன்படுத்தி பதிலை எழுதலாம், இருப்பினும் உங்கள் நிலைமைக்கு அதைத் தனிப்பயனாக்க வேண்டும்.

source: In addition, it's up to you to comply with your ISP's terms of service.
ta: கூடுதலாக, உங்கள் ISP இன் பணி விதிமுறைகளுக்கு இணங்குவது உங்களுடையது.

source: Instead, the "conduit" safe harbor of section 512(a) of the DMCA has different and less burdensome eligibility requirements, as the D.C. Circuit Court of Appeals held in RIAA v. Verizon (see https://scholar.google.com/scholar_case?case=15815830240179540527) and the Eighth Circuit Court of Appeals confirmed in RIAA v. Charter (see https://scholar.google.com/scholar_case?case=11547531128234336420).
ta: அதற்கு பதிலாக, டி.எம்.சி.ஏ இன் பிரிவு 512 (அ) இன் "கன்ட்யூட்" பாதுகாப்பான துறைமுகம் வேறுபட்ட மற்றும் குறைந்த சுமை தகுதித் தேவைகளைக் கொண்டுள்ளது, ஏனெனில் டி.சி. ச்காலர்_கேச்? வழக்கு = 15815830240179540527) மற்றும் எட்டாவது சுற்று மேல்முறையீட்டு அறமன்றம் ரியா வி.

source: It does not host any content. Rather, it is part of a network of nodes on the Internet that simply pass packets among themselves before sending them to their destinations, just as any Internet intermediary does.
ta: இது எந்த உள்ளடக்கத்தையும் புரவலன் செய்யாது. மாறாக, இது இணையத்தில் உள்ள முனைகளின் வலையமைப்பின் ஒரு பகுதியாகும், இது எந்தவொரு இணைய இடைத்தரகரும் போலவே, தங்கள் இடங்களுக்கு அனுப்புவதற்கு முன்பு பாக்கெட்டுகளை தங்களுக்குள் அனுப்புகிறது.

source: Note to Tor relay operators: In this litigious era, anyone providing routing services may face copyright complaints for transmitted content.
ta: டோர் ரிலே ஆபரேட்டர்களுக்கான குறிப்பு: இந்த வழக்கு சகாப்தத்தில், ரூட்டிங் சேவைகளை வழங்கும் எவரும் கடத்தப்பட்ட உள்ளடக்கத்திற்கான பதிப்புரிமை புகார்களை எதிர்கொள்ளக்கூடும்.

source: Please also ensure all the statements are true for you.
ta: எல்லா அறிக்கைகளும் உங்களுக்கு உண்மை என்பதை உறுதிப்படுத்தவும்.

source: Thank you for forwarding me the notice you received from [copyright claimant] regarding [content]. I would like to assure you that I am not hosting the claimed infringing materials, and furthermore, the Digital Millennium Copyright Act's ("DMCA") safe harbors likely protect you from liability arising from this complaint. The notice is likely based upon misunderstandings about the law and about some of the software I run.
ta: [உள்ளடக்கம்] தொடர்பாக [பதிப்புரிமை உரிமைகோருபவரிடமிருந்து] நீங்கள் பெற்ற அறிவிப்பை எனக்கு அனுப்பியதற்கு நன்றி. உரிமைகோரப்பட்ட மீறல் பொருட்களை நான் புரவலன் செய்யவில்லை என்பதை நான் உங்களுக்கு உறுதியளிக்க விரும்புகிறேன், மேலும், டிசிட்டல் மில்லினியம் பதிப்புரிமைச் சட்டத்தின் ("டி.எம்.சி.ஏ") பாதுகாப்பான துறைமுகங்கள் இந்த புகாரிலிருந்து எழும் பொறுப்பிலிருந்து உங்களைப் பாதுகாக்கக்கூடும். அறிவிப்பு சட்டம் பற்றிய தவறான புரிதல்களையும், நான் இயக்கும் சில மென்பொருளையும் அடிப்படையாகக் கொண்டது.

source: Thank you for working with me on this matter. As a loyal subscriber, I appreciate your notifying me of this issue and hope that the protections of DMCA 512 put any concerns you may have to rest.
ta: இந்த விசயத்தில் என்னுடன் பணியாற்றியதற்கு நன்றி. ஒரு விசுவாசமான சந்தாதாரராக, இந்த பிரச்சினையை நீங்கள் எனக்கு அறிவிப்பதை நான் பாராட்டுகிறேன், மேலும் டி.எம்.சி.ஏ 512 இன் பாதுகாப்புகள் நீங்கள் ஓய்வெடுக்க வேண்டிய எந்த கவலையும் அளிக்கின்றன என்று நம்புகிறேன்.

source: The DMCA's requirements vary depending on the ISP's role. You may be familiar with the "notice and takedown" provisions of section 512(c) of the DMCA; however, those do not apply when an ISP merely acts as a conduit.
ta: ISP இன் பங்கைப் பொறுத்து DMCA இன் தேவைகள் மாறுபடும். டி.எம்.சி.ஏவின் பிரிவு 512 (சி) இன் "அறிவிப்பு மற்றும் தரமிறக்குதல்" விதிகளை நீங்கள் அறிந்திருக்கலாம்; இருப்பினும், ஒரு ஐ.எச்.பி வெறுமனே ஒரு வழித்தடமாக செயல்படும்போது அவை பொருந்தாது.

source: The copyright notice you received was likely triggered by a program I run called Tor. Tor is network software that helps users to enhance their privacy, security, and safety online.
ta: நீங்கள் பெற்ற பதிப்புரிமை அறிவிப்பு நான் டோர் என்று அழைக்கப்படும் ஒரு நிரலால் தூண்டப்படலாம். டோர் என்பது பிணையம் மென்பொருளாகும், இது பயனர்களின் தனியுரிமை, பாதுகாப்பு மற்றும் பாதுகாப்பை ஆன்லைனில் மேம்படுத்த உதவுகிறது.

source: The difference is that Tor tunnels the connections such that no hop can learn both the source and destination of the packets, giving users protection from nefarious snooping on network traffic.
ta: வேறுபாடு என்னவென்றால், பாக்கெட்டுகளின் மூலத்தையும் இலக்கு இரண்டையும் எந்த ஆப் கற்றுக்கொள்ள முடியாது, பிணையம் போக்குவரத்தில் மோசமான ச்னூப்பிங்கிலிருந்து பயனர்களுக்கு பாதுகாப்பை வழங்கும்.

source: The result is that, unlike most other Internet traffic, the final IP address that the recipient receives is not the IP address of the sender.
ta: இதன் விளைவாக, பிற இணைய போக்குவரத்தைப் போலல்லாமல், பெறுநர் பெறும் இறுதி ஐபி முகவரி அனுப்புநரின் ஐபி முகவரி அல்ல.

source: Therefore, you should continue to be protected under the DMCA 512(a) safe harbor without taking any further action.
ta: எனவே, நீங்கள் மேலும் எந்த நடவடிக்கையும் எடுக்காமல் டி.எம்.சி.ஏ 512 (அ) பாதுகாப்பான துறைமுகத்தின் கீழ் தொடர்ந்து பாதுகாக்கப்பட வேண்டும்.

source: This template is intended as a starting point, but you should tailor it to your own circumstances.
ta: இந்த வார்ப்புரு ஒரு தொடக்க புள்ளியாக கருதப்படுகிறது, ஆனால் நீங்கள் அதை உங்கள் சொந்த சூழ்நிலைகளுக்கு ஏற்ப வடிவமைக்க வேண்டும்.

source: This template letter is for informational purposes only and does not constitute legal advice.
ta: இந்த வார்ப்புரு கடிதம் செய்தி நோக்கங்களுக்காக மட்டுமே மற்றும் சட்ட ஆலோசனையை உருவாக்காது.

source: Tor protects users against hazards such as harassment, spam, and identity theft. Initial development of Tor, including deployment of a public-use Tor network, was a project of the U.S. Naval Research Laboratory, with funding from ONR and DARPA. (For more on Tor, see https://www.torproject.org/.)
ta: துன்புறுத்தல், ச்பேம் மற்றும் அடையாள திருட்டு போன்ற ஆபத்துகளிலிருந்து TOR பயனர்களைப் பாதுகாக்கிறது. பொது-பயன்பாட்டு டோர் நெட்வொர்க்கைப் பயன்படுத்துவது உட்பட TOR இன் ஆரம்ப வளர்ச்சி, யு.எச். கடற்படை ஆராய்ச்சி ஆய்வகத்தின் ஒரு திட்டமாகும், இது ONR மற்றும் DARPA இலிருந்து நிதியுதவி அளித்தது. (டோரைப் பற்றி மேலும் அறிய, https://www.torproject.org/ ஐப் பார்க்கவும்.)

source: Under DMCA 512(a), service providers like you are typically protected from damages for copyright infringement claims if you also maintain "a policy that provides for termination in appropriate circumstances of subscribers and account holders of the service provider's system or network who are repeat infringers."
ta: டி.எம்.சி.ஏ 512 (அ) இன் கீழ், உங்களைப் போன்ற பணி வழங்குநர்கள் பொதுவாக பதிப்புரிமை மீறல் உரிமைகோரல்களுக்கான சேதங்களிலிருந்து பாதுகாக்கப்படுகிறார்கள் "நீங்கள் பராமரித்தால்" சந்தாதாரர்கள் மற்றும் பணி வழங்குநரின் அமைப்பு அல்லது நெட்வொர்க்கின் கணக்கு வைத்திருப்பவர்களின் பொருத்தமான சூழ்நிலைகளில் நிறுத்தப்படுவதற்கு வழங்கும் ஒரு கொள்கையும் " . "

source: Very truly yours,
ta: மிகவும் உண்மையிலேயே உங்களுடையது,

source: Whether and how you should respond when you or your ISP has received a copyright notice will turn on the particular facts of your situation.
ta: நீங்கள் அல்லது உங்கள் ISP பதிப்புரிமை அறிவிப்பைப் பெற்றால் நீங்கள் எவ்வாறு பதிலளிக்க வேண்டும் என்பது உங்கள் நிலைமையின் குறிப்பிட்ட உண்மைகளை இயக்கும்.

source: While the Tor node that I run may appear to be the source of material that is alleged to be copyright-infringing, I do not host that material.
ta: நான் இயக்கும் டோர் முனை பதிப்புரிமை மீறல் என்று கூறப்படும் பொருளின் ஆதாரமாகத் தோன்றினாலும், நான் அந்த பொருளை புரவலன் செய்யவில்லை.

source: Written by the Electronic Frontier Foundation ([EFF](https://www.eff.org/)). Last updated March 27, 2020.
ta: எலக்ட்ரானிக் எல்லைப்புற அறக்கட்டளை எழுதியது ([EFF] (https://www.eff.org/)). கடைசியாக மார்ச் 27, 2020 இல் புதுப்பிக்கப்பட்டது.

source: Your customer, [User]
ta: உங்கள் வாடிக்கையாளர், [பயனர்]

source: Got a DMCA notice? Check out our sample response letter!
ta: டி.எம்.சி.ஏ அறிவிப்பு கிடைத்ததா? எங்கள் மாதிரி மறுமொழி கடிதத்தைப் பாருங்கள்!

source: Response template for Tor relay operator to ISP
ta: ISP க்கு டோர் ரிலே ஆபரேட்டருக்கான மறுமொழி வார்ப்புரு

source: **Always check the <abbr title="Terms of Service">TOS</abbr> and <abbr title="Acceptable Use Policy">AUP</abbr> before running a relay. They are prone to change and some of this information may be out of date.**
ta: . அவை மாற்றுவதற்கான வாய்ப்புகள் உள்ளன, மேலும் இந்த தகவல்களில் சில காலாவதியானதாக இருக்கலாம். **

source: **Try to avoid** the following hosters:
ta: ** தவிர்க்க முயற்சி செய்யுங்கள் ** பின்வரும் ஓச்டர்கள்:

source: Be sure to provide useful information like how much bandwidth you pushed, whether you thought the deal was cheap or expensive, how hard you had to work to make them understand what's going on, how long your server has been running, and whether you'd recommend them to others. Also include dates.
ta: நீங்கள் எவ்வளவு அலைவரிசை தள்ளினீர்கள், ஒப்பந்தம் மலிவானது அல்லது விலை உயர்ந்தது என்று நீங்கள் நினைத்தீர்களா, என்ன நடக்கிறது, எவ்வளவு காலம் உங்கள் சேவையகம் இயங்குகிறது, நீங்கள் விரும்புகிறீர்களா என்பதைப் புரிந்துகொள்ள நீங்கள் எவ்வளவு கடினமாக உழைக்க வேண்டும் போன்ற பயனுள்ள தகவல்களை வழங்குவதை உறுதிப்படுத்திக் கொள்ளுங்கள் அவற்றை மற்றவர்களுக்கு பரிந்துரைக்கவும். தேதிகளையும் சேர்க்கவும்.

source: For network diversity and stronger anonymity, you should avoid providers and countries that already attract a lot of Tor capacity. [Metrics](https://metrics.torproject.org/) is a great tool that allows you to group probabilities by country and AS (autonomous systems), so you can more easily identify networks you want to avoid.
ta: பிணையம் பன்முகத்தன்மை மற்றும் வலுவான அநாமதேயத்திற்கு, நீங்கள் ஏற்கனவே நிறைய TOR திறனை ஈர்க்கும் வழங்குநர்களையும் நாடுகளையும் தவிர்க்க வேண்டும். .

source: Since non-exits do not attract complaints, it should be fine to run them without contacting the hoster first. Make sure you understand their policies regarding bandwidth, especially on "unlimited" (fair use) contracts. For exit relays, you should read the fine [Tor Exit Guidelines](/relay/community-resources/tor-exit-guidelines) first.
ta: வெளியேற்றப்படாதது புகார்களை ஈர்க்காது என்பதால், முதலில் ஓச்டரைத் தொடர்பு கொள்ளாமல் அவற்றை இயக்குவது நன்றாக இருக்க வேண்டும். அலைவரிசை தொடர்பான அவர்களின் கொள்கைகளை நீங்கள் புரிந்துகொண்டுள்ளீர்கள், குறிப்பாக "வரம்பற்ற" (நியாயமான பயன்பாடு) ஒப்பந்தங்களில். வெளியேறும் ரிலேக்களுக்கு, நீங்கள் முதலில் தண்டம் [டோர் வெளியேறும் வழிகாட்டுதல்கள்] (/ரிலே/சமூக வளங்கள்/டோர்-எக்சிட்-குழுக்கள்) முதலில் படிக்க வேண்டும்.

source: These hosts already have many Tor nodes being hosted there.
ta: இந்த ஓச்ட்களில் ஏற்கனவே பல டோர் முனைகள் உள்ளன.

source: This page aims to list community experiences with Tor and various Internet Service Providers (ISPs) around the world. Some ISPs are Tor-friendly, some are not. Some are competent and clueful about Tor or about security in general. Let us know!
ta: இந்த பக்கம் உலகெங்கிலும் உள்ள டோர் மற்றும் பல்வேறு இணைய பணி வழங்குநர்கள் (ஐஎச்பிக்கள்) சமூக அனுபவங்களை பட்டியலிடுவதை நோக்கமாகக் கொண்டுள்ளது. சில ISP கள் டோர்-நட்பு, சில இல்லை. சிலர் டோர் அல்லது பொதுவாக பாதுகாப்பைப் பற்றி திறமையானவர்கள் மற்றும் துப்பு நிறைந்தவர்கள். எங்களுக்குத் தெரியப்படுத்துங்கள்!

source: Some ISPs are Tor-friendly, some are not
ta: சில ISP கள் டோர்-நட்பு, சில இல்லை

source: Good Bad ISPs
ta: நல்ல மோசமான ISP கள்

source: Below, you can find a list of organizations that run relays.
ta: கீழே, ரிலேக்களை இயக்கும் அமைப்புகளின் பட்டியலை நீங்கள் காணலாம்.

source: Please let us know if you would like your organization to be listed on this page.
ta: உங்கள் அமைப்பு இந்த பக்கத்தில் பட்டியலிடப்பட வேண்டுமா என்பதை எங்களுக்குத் தெரியப்படுத்துங்கள்.

source: Some organizations are dedicated to this purpose only and they are called Relay Associations.
ta: சில நிறுவனங்கள் இந்த நோக்கத்திற்காக மட்டுமே அர்ப்பணிக்கப்பட்டுள்ளன, அவை ரிலே சங்கங்கள் என்று அழைக்கப்படுகின்றன.

source: There are several organizations around the world that run Tor relays.
ta: டோர் ரிலேக்களை இயக்கும் பல அமைப்புகள் உலகம் முழுவதும் உள்ளன.

source: Relay associations are independent organizations that runs relays in the Tor network.
ta: ரிலே சங்கங்கள் TOR நெட்வொர்க்கில் ரிலேக்களை இயக்கும் சுயாதீன நிறுவனங்கள்.

source: Relay Associations
ta: ரிலே சங்கங்கள்

source: (We want to make sure our shirts help outreach happen all around the world, so please understand if we can't send you 5 shirts for your 5 excellent relays.)
ta: (உலகெங்கிலும் எங்கள் சட்டைகள் உதவ உதவுகின்றன என்பதை உறுதிப்படுத்த நாங்கள் விரும்புகிறோம், எனவே உங்கள் 5 சிறந்த ரிலேக்களுக்கு 5 சட்டைகளை உங்களுக்கு அனுப்ப முடியாவிட்டால் தயவுசெய்து புரிந்து கொள்ளுங்கள்.)

source: * Help out in other ways. Maintain a translation. Run Tor trainings.
ta: * வேறு வழிகளில் உதவுங்கள். மொழிபெயர்ப்பைப் பராமரிக்கவும். பயிற்சிக்காக ஓடுங்கள்.

source: * Operate a fast Tor relay that's been running for the past two months: you are eligible if you allow exits to port 80 and you average 250 KBytes/s traffic, or if you're not an exit but you average 500 KBytes/s traffic.
ta: * கடந்த இரண்டு மாதங்களாக இயங்கும் ஒரு வேகமான டோர் ரிலேவை இயக்கவும்: துறைமுகம் 80 க்கு வெளியேற அனுமதித்தால் நீங்கள் தகுதி பெறுவீர்கள், மேலும் சராசரியாக 250 kbytes/s போக்குவரத்து, அல்லது நீங்கள் வெளியேறவில்லை என்றால் நீங்கள் சராசரியாக 500 kbytes/s போக்குவரத்து .

source: **Important:** As part of our ongoing efforts to improve our internal processes, we have decided to **temporarily pause** the swag program for volunteers and relay operators.
ta: ** முக்கியமானது: ** எங்கள் உள் செயல்முறைகளை மேம்படுத்துவதற்கான எங்கள் தொடர்ச்சியான முயற்சிகளின் ஒரு பகுதியாக, தன்னார்வலர்கள் மற்றும் ரிலே ஆபரேட்டர்களுக்கான ஈட்டம் திட்டத்தை தற்காலிகமாக இடைநிறுத்த முடிவு செய்துள்ளோம்.

source: Do research on Tor and anonymity, solve some of our bugs, or establish yourself as a Tor advocate.
ta: டோர் மற்றும் அநாமதேயத்தைப் பற்றி ஆராய்ச்சி செய்யுங்கள், எங்கள் பிழைகள் சிலவற்றை தீர்க்கவும் அல்லது உங்களை ஒரு டோர் வக்கீலாக நிலைநிறுத்தவும்.

source: If you're operating a fast relay or you've done something else cool, email us at tshirt at torproject.org with the details.
ta: நீங்கள் வேகமான ரிலேவை இயக்குகிறீர்கள் அல்லது வேறு ஏதாவது செய்திருந்தால், விவரங்களுடன் Torproject.org இல் உள்ள TSHIRT இல் எங்களுக்கு மின்னஞ்சல் அனுப்புங்கள்.

source: Stay tuned for more updates as we approach the new year.
ta: புதிய ஆண்டை நாங்கள் அணுகும்போது மேலும் புதுப்பிப்புகளுக்கு காத்திருங்கள்.

source: There are [a variety of colors, shapes, and sizes](https://gitlab.torproject.org/tpo/community/team/-/wikis/tshirts) available in the great roots design that Leiah Jansen made for us, as well as some older designs.
ta: [பலவிதமான வண்ணங்கள், வடிவங்கள் மற்றும் அளவுகள்] (https://gitlab.torproject.org/tpo/community/team/-/wikis/tshirts) பெரிய வேர்கள் வடிவமைப்பில் லியா சான்சன் எங்களுக்காக உருவாக்கியதுடன், சில பழைய வடிவமைப்புகளும் உள்ளன.

source: There are two primary ways of contributing:
ta: பங்களிப்பதற்கான இரண்டு முதன்மை வழிகள் உள்ளன:

source: This pause will allow us to reorganize our workflow to better serve the community. We plan to relaunch the program in January 2025.
ta: இந்த இடைநிறுத்தம் சமூகத்திற்கு சிறப்பாக பணி செய்ய எங்கள் பணிப்பாய்வுகளை மறுசீரமைக்க அனுமதிக்கும். சனவரி 2025 இல் திட்டத்தை மீண்டும் தொடங்க திட்டமிட்டுள்ளோம்.

source: Write a good support program and get a lot of people to use it.
ta: ஒரு நல்ல உதவி திட்டத்தை எழுதி, அதைப் பயன்படுத்த நிறைய பேரைப் பெறுங்கள்.

source: You can get a Tor T-shirt for contributing to the Tor project.
ta: டோர் திட்டத்திற்கு பங்களிக்க நீங்கள் ஒரு டோர் டி-சர்ட்டைப் பெறலாம்.

source: If you're operating a fast relay or you've done something else cool, you're eligible to receive our swag.
ta: நீங்கள் வேகமான ரிலேவை இயக்குகிறீர்கள் அல்லது வேறு ஏதாவது செய்திருந்தால், எங்கள் ச்வாக்கைப் பெற நீங்கள் தகுதியுடையவர்.

source: Swag
ta: ஈட்டம்

source: # Before You Start
ta: # நீங்கள் தொடங்குவதற்கு முன்

source: ## Abuse Scenarios
ta: ## தீய பயன்பாடு காட்சிகள்

source: ## Brute Force Web Attacks
ta: ## முரட்டுத்தனமான வலை தாக்குதல்கள்

source: ## Comment/Forum Spam
ta: ## கருத்து/மன்றம் ச்பேம்

source: ## Common Boilerplate (Tor Intro)
ta: ## பொதுவான கொதிகலன் (டோர் அறிமுகம்)

source: ## DoS Attacks and Scraping Robots
ta: ## டோச் தாக்குதல் மற்றும் ச்கிராப்பிங் ரோபோக்கள்

source: ## E-Commerce Fraud
ta: ## இ-காமர்ச் மோசடி

source: ## Format and Philosophy of Templates
ta: ## வார்ப்புருக்களின் வடிவம் மற்றும் உண்மை

source: ## Google Groups Spam
ta: ## கூகிள் குழுக்கள் ச்பேம்

source: ## Hacked Gmail, Web Forum, or Misc Account Access
ta: ## ஏக் செய்யப்பட்ட சிமெயில், வலை மன்றம் அல்லது தவறான கணக்கு அணுகல்

source: ## Hacking (PHP Webshells, XSS, SQL Injection)
ta: ## ஏக்கிங் (PHP வெப்செல்ச், எக்ச்எச்எச், கவிமொ ஊசி)

source: ## Other Template Sets
ta: ## பிற வார்ப்புரு தொகுப்புகள்

source: ## PHP Relay or Exploited Webmail Account Spam
ta: ## பிஎச்பி ரிலே அல்லது சுரண்டப்பட்ட வெப்மெயில் கணக்கு ச்பேம்

source: ## SSH Bruteforce Attempts
ta: ## பாஓடு BRUTEFORCE முயற்சிகள்

source: ## Threats of Violence (Advice for Real-Time Discussion)
ta: ## வன்முறை அச்சுறுத்தல்கள் (நிகழ்நேர விவாதத்திற்கான ஆலோசனை)

source: * After all has been discussed, offer a follow up conversation within a week. Make sure your agreed upon changes are implemented. Neither the ISP nor Complainant may want to do this, but the fact that you offered is in your credit. This may help them feel "comfortable" with you.
ta: * அனைவருக்கும் விவாதிக்கப்பட்ட பிறகு, ஒரு வாரத்திற்குள் பின்தொடர்தல் உரையாடலை வழங்கவும். மாற்றங்களை நீங்கள் ஒப்புக்கொண்ட மாற்றங்கள் செயல்படுத்தப்படுவதை உறுதிசெய்க. ஐ.எச்.பி அல்லது புகார்தாரர் இதைச் செய்ய விரும்பவில்லை, ஆனால் நீங்கள் வழங்கிய உண்மை உங்கள் வரவுகளில் உள்ளது. இது உங்களுடன் "வசதியாக" உணர உதவும்.

source: * Arrange to talk with or directly email the complainant.
ta: * புகார்தாரருடன் பேச அல்லது நேரடியாக மின்னஞ்சல் செய்ய ஏற்பாடு செய்யுங்கள்.

source: * Discuss options. Options that have been offered to relay operators:
ta: * விருப்பங்களைப் பற்றி விவாதிக்கவும். ரிலே ஆபரேட்டர்களுக்கு வழங்கப்பட்ட விருப்பங்கள்:

source: * During the conversation make sure you explain a few points:
ta: * உரையாடலின் போது நீங்கள் சில புள்ளிகளை விளக்குவதை உறுதிசெய்க:

source: * In many cases, your ISP will be involved as a conduit for the 3rd party complainant. Your ISP wants to know:
ta: * பல சந்தர்ப்பங்களில், உங்கள் ISP 3 வது தரப்பு புகார்தாரருக்கான ஒரு வழியாக ஈடுபடும். உங்கள் ISP தெரிந்து கொள்ள விரும்புகிறது:

source: * In serious cases, such as harassment email or death threats, it is often helpful to draw an analogy to situations in the physical world where an action is perpetrated by an anonymous individual (such as delivering the notice via postal mail).
ta: * துன்புறுத்தல் மின்னஞ்சல் அல்லது இறப்பு அச்சுறுத்தல்கள் போன்ற கடுமையான சந்தர்ப்பங்களில், ஒரு அநாமதேய தனிநபரால் (தபால் அஞ்சல் வழியாக அறிவிப்பை வழங்குவது போன்றவை) ஒரு நடவடிக்கை செய்யப்படும் இயற்பியல் உலகில் உள்ள சூழ்நிலைகளுக்கு ஒரு ஒப்புமையை ஈர்ப்பது பெரும்பாலும் உதவியாக இருக்கும்.

source: * Read the [Tor Overview](https://2019.www.torproject.org/about/overview.html.en). Be prepared to summarize and answer basic questions. Assume the person with whom you're going to converse knows nothing about Tor. Assume this same person isn't going to trust anything you say.
ta: . அடிப்படை கேள்விகளை சுருக்கமாகவும் பதிலளிக்கவும் தயாராக இருங்கள். நீங்கள் உரையாடப் போகும் நபருக்கு டோர் பற்றி எதுவும் தெரியாது என்று வைத்துக் கொள்ளுங்கள். இதே நபர் நீங்கள் சொல்லும் எதையும் நம்பப் போவதில்லை என்று வைத்துக் கொள்ளுங்கள்.

source: * Remind them that traditional policework can still be used to determine who had the means, motive, and opportunity to commit the crime.
ta: * குற்றத்தைச் செய்வதற்கான வழிமுறைகள், நோக்கம் மற்றும் வாய்ப்பு யாருக்கு உள்ளது என்பதை தீர்மானிக்க பாரம்பரிய பொலிச் வேலைகள் இன்னும் பயன்படுத்தப்படலாம் என்பதை அவர்களுக்கு நினைவூட்டுங்கள்.
