Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: **Yes**. Be as transparent as possible about the fact that you're running an exit relay.
ta: ** ஆம் **. நீங்கள் வெளியேறும் ரிலேவை இயக்குகிறீர்கள் என்ற உண்மையைப் பற்றி முடிந்தவரை வெளிப்படையாக இருங்கள்.

source: **Yes**. Make sure you have a Tor-friendly ISP that knows you're running an exit relay and supports you in that goal.
ta: ** ஆம் **. உங்களிடம் ஒரு டோர்-நட்பு ஐ.எச்.பி இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், நீங்கள் வெளியேறும் ரிலேவை இயக்குகிறீர்கள், அந்த இலக்கில் உங்களை ஆதரிக்கிறது.

source: **Yes.** A federal law, 47 U.S.C. § 230 (often called Section 230), provides legal immunity for online intermediaries that host or republish speech.
ta: ** ஆம். ** ஒரு கூட்டாட்சி சட்டம், 47 யு.எச்.சி. 30 230 (பெரும்பாலும் பிரிவு 230 என அழைக்கப்படுகிறது), பேச்சை நடத்தும் அல்லது மீண்டும் வெளியிடும் நிகழ்நிலை இடைத்தரகர்களுக்கு சட்டப்பூர்வ நோய் எதிர்ப்பு சக்தியை வழங்குகிறது.

source: Also, if you received this document from anywhere besides the EFF web site or https://community.torproject.org/relay/community-resources/eff-tor-legal-faq, it may be out of date. Follow the link to get the latest version.
ta: மேலும். அண்மைக் கால பதிப்பைப் பெற இணைப்பைப் பின்தொடரவும்.

source: An exit relay may forward traffic that is considered unlawful, and that traffic may be attributed to the operator of a relay.
ta: வெளியேறும் ரிலே சட்டவிரோதமாகக் கருதப்படும் போக்குவரத்தை அனுப்பக்கூடும், மேலும் அந்த போக்குவரத்து ரிலேவின் ஆபரேட்டருக்கு காரணமாக இருக்கலாம்.

source: And Russian authorities wrongfully arrested math instructor and Tor relay operator [Dmitry Bogatov](https://www.eff.org/deeplinks/2017/04/access-now-and-eff-condemn-arrest-tor-node-operator-dmitry-bogatov-russia), though they later cleared him of [charges](https://web.archive.org/web/20190617062802/https://tass.com/society/986636).
ta: மற்றும் ரச்ய அதிகாரிகள் கணித பயிற்றுவிப்பாளரையும் டோர் ரிலே ஆபரேட்டரையும் தவறாக கைது செய்தனர் [dmitry போகாடோவ்] (https://www.eff.org/deeplinks/2017/04/access-now-and-and-condenm-rest-rest-node-node-node-bogatov-russia), ஆனால் அவர்கள் அவரை அழித்துவிட்டார்கள், ஆனால் அவரின் பிற்பகுதிகளில் அவரைத் துடைத்தனர், ஆனால் அவை பின்னர் அவரை அழித்துவிட்டன, ஆனால் அவை அவரைத் துண்டித்துவிட்டன, ஆனால் அவரின் பின்னடைவு, .

source: Another federal law, 17 U.S.C. § 512(a), part of the Digital Millennium Copyright Act, provides a legal safe harbor against copyright infringement claims based on material that is simply transmitted without modification, as a Tor relay does.
ta: மற்றொரு கூட்டாட்சி சட்டம், 17 யு.எச்.சி. Tigital 512 (அ), டிசிட்டல் மில்லினியம் பதிப்புரிமைச் சட்டத்தின் ஒரு பகுதியாகும், ஒரு டோர் ரிலே செய்வது போல, மாற்றியமின்றி பரவும் பொருளின் அடிப்படையில் பதிப்புரிமை மீறல் உரிமைகோரல்களுக்கு எதிராக சட்டபூர்வமான பாதுகாப்பான துறைமுகத்தை வழங்குகிறது.

source: Different factual situations and different legal jurisdictions will result in different answers to a number of questions.
ta: வெவ்வேறு உண்மை சூழ்நிலைகள் மற்றும் வெவ்வேறு சட்ட அதிகார வரம்புகள் பல கேள்விகளுக்கு வெவ்வேறு பதில்களை ஏற்படுத்தும்.

source: Do not examine anyone's communications without first talking to a lawyer.
ta: முதலில் ஒரு வழக்கறிஞருடன் பேசாமல் யாருடைய தகவல்தொடர்புகளையும் ஆராய வேண்டாம்.

source: EFF believes that Tor relays should be protected from copyright liability for the acts of their users because a Tor relay operator can raise an immunity defense under Section 512 of DMCA as well as defenses under copyright's secondary liability doctrines.
ta: டோர் ரிலேக்கள் தங்கள் பயனர்களின் செயல்களுக்கான பதிப்புரிமை பொறுப்பிலிருந்து பாதுகாக்கப்பட வேண்டும் என்று EFF நம்புகிறது, ஏனெனில் ஒரு டோர் ரிலே ஆபரேட்டர் டி.எம்.சி.ஏ இன் பிரிவு 512 இன் கீழ் நோய் எதிர்ப்பு ஆற்றல் பாதுகாப்பையும், பதிப்புரிமையின் இரண்டாம் நிலை பொறுப்புக் கோட்பாடுகளின் கீழ் பாதுகாப்புகளையும் உயர்த்த முடியும்.

source: EFF has written a [short template](tor-dmca-response) to help you write a response to your ISP, university, etc., to let them know about the details of the Digital Millennium Copyright Act's safe harbor, and how Tor fits in.
ta: உங்கள் ISP, பல்கலைக்கழகம் போன்றவற்றுக்கு ஒரு பதிலை எழுத உதவுவதற்காக, டிசிட்டல் மில்லினியம் பதிப்புரிமைச் சட்டத்தின் பாதுகாப்பான துறைமுகத்தின் விவரங்கள் மற்றும் TOR எவ்வாறு பொருந்துகிறது என்பதை அவர்களுக்குத் தெரிவிக்க, EFF ஒரு [குறுகிய வார்ப்புரு] (TOR-DMCA-RESPONSE) எழுதியுள்ளது.

source: Exit relays raise special concerns because the traffic that exits from them can be traced back to the relay's IP address.
ta: வெளியேறும் ரிலேக்கள் சிறப்பு கவலைகளை எழுப்புகின்றன, ஏனெனில் அவற்றிலிருந்து வெளியேறும் போக்குவரத்தை ரிலேவின் ஐபி முகவரிக்கு மாற்றலாம்.

source: For example, in 2016 Seattle police [mistakenly raided](https://web.archive.org/web/20191210114929/https://www.thestranger.com/slog/2016/04/08/23914735/judge-who-authorized-police-search-of-seattle-privacy-activists-wasnt-told-they-operate-tor-network/) the home of a privacy activist operating a Tor exit relay.
ta: உதாரணமாக, 2016 சியாட்டில் போலீசார் [தவறாக ரெய்டு] (https://web.archive.org/web/20191210114929/https://www.thestranger.com/slog/2016/04/08/2391473 5/நீதிபதி-ஊ-அங்கீகரிக்கப்பட்ட-பொலிச்-சீசர்-ஆஃப்-சிட்டில்-பிரிவாசி-ஆக்டிவிச்டுகள்-டோல்ட்-டோல்ட்-அவர்கள்-ஆபரேட்-டோர்-நெட்வொர்க்/) டோர் வெளியேறும் ரிலேவை இயக்கும் தனியுரிமை ஆர்வலரின் வீடு.

source: For information on what to do if law enforcement seeks access to your digital devices, check out EFF's [Know Your Rights](https://www.eff.org/wp/know-your-rights) guide.
ta: சட்ட அமலாக்கம் உங்கள் டிசிட்டல் சாதனங்களுக்கான அணுகலை நாடினால் என்ன செய்வது என்பது குறித்த தகவலுக்கு, EFF இன் [உங்கள் உரிமைகளை அறிந்து கொள்ளுங்கள்] (https://www.eff.org/wp/ wan-your-rights) வழிகாட்டியைப் பாருங்கள்.

source: For more information about responding to abuse complaints and other inquiries, check out the [Tor Abuse FAQ](https://support.torproject.org/abuse) and the collection of [abuse response templates](../tor-abuse-templates/) on the Tor Project's website.
ta: துச்பிரயோக புகார்கள் மற்றும் பிற விசாரணைகளுக்கு பதிலளிப்பது பற்றிய கூடுதல் தகவலுக்கு, [டோர் தீய பயன்பாடு கேள்விகள்] (https://support.torproject.org/abuse) மற்றும் [துச்பிரயோகம் மறுமொழி வார்ப்புருக்கள்] (../ டோர்-புச்-டெம்ப்ளேட்டுகள்/) சேகரிப்பு.

source: For that reason, it's best not to run your exit relay in your home or using your home Internet connection.
ta: அந்த காரணத்திற்காக, உங்கள் வீட்டில் வெளியேறும் ரிலேவை இயக்கவோ அல்லது உங்கள் வீட்டு இணைய இணைப்பைப் பயன்படுத்தவோ கூடாது.

source: Furthermore, your communications with Tor's developers are not protected by any legal privilege, so law enforcement or civil litigants could subpoena and obtain any information you give to them.
ta: மேலும், டோரின் டெவலப்பர்களுடனான உங்கள் தகவல்தொடர்புகள் எந்தவொரு சட்ட சலுகையினாலும் பாதுகாக்கப்படுவதில்லை, எனவே சட்ட அமலாக்கம் அல்லது குடிமை வழக்குரைஞர்கள் நீங்கள் அவர்களுக்கு வழங்கும் எந்த தகவலையும் பெறலாம்.

source: Given those risks, you should instead consider running your exit relay in a commercial facility that is supportive of Tor. Have a separate IP address for your exit relay, and don't route your own traffic through it.
ta: அந்த அபாயங்களைக் கருத்தில் கொண்டு, உங்கள் வெளியேறும் ரிலேவை DOR க்கு ஆதரவான வணிக வசதியில் இயக்குவதை நீங்கள் கருத்தில் கொள்ள வேண்டும். உங்கள் வெளியேறும் ரிலேவுக்கு தனி ஐபி முகவரியை வைத்திருங்கள், மேலும் உங்கள் சொந்த போக்குவரத்தை அதன் மூலம் வழிநடத்த வேண்டாம்.

source: Got a DMCA notice? Check out our [sample response letter](tor-dmca-response)!
ta: டி.எம்.சி.ஏ அறிவிப்பு கிடைத்ததா? எங்கள் [மாதிரி மறுமொழி கடிதம்] (TOR-DMCA-RESPONSE) ஐப் பாருங்கள்!

source: However, EFF believes so strongly that those running Tor relays shouldn't be liable for traffic that passes through the relay that we're running our own middle relay.
ta: எவ்வாறாயினும், ரிலே வழியாக செல்லும் போக்குவரத்துக்கு டோர் ரிலேக்கள் பொறுப்பேற்கக்கூடாது என்று EFF மிகவும் வலுவாக நம்புகிறது, நாங்கள் எங்கள் சொந்த நடுத்தர ரிலேவை இயக்குகிறோம்.

source: However, Tor relay operators in the United States can possibly create civil and even criminal liability for themselves under state or federal wiretap laws if they monitor, log, or disclose Tor users' communications, while non-U.S. operators may be subject to similar laws.
ta: எவ்வாறாயினும், ஒன்றுபட்டது ச்டேட்சில் உள்ள டோர் ரிலே ஆபரேட்டர்கள், பயனர்களின் தகவல்தொடர்புகளை கண்காணிக்க, பதிவுசெய்தால் அல்லது வெளிப்படுத்தினால், மாநில அல்லது கூட்டாட்சி வயர்டாப் சட்டங்களின் கீழ் தங்களுக்கு குடிமை மற்றும் கிரிமினல் பொறுப்பை உருவாக்க முடியும், அதே நேரத்தில் யு.எச். அல்லாதவர்கள் இதேபோன்ற சட்டங்களுக்கு உட்பட்டிருக்கலாம்.

source: However, if you do decide to waive your right to the assistance of counsel and answer questions without an attorney present, be sure to tell the truth.
ta: இருப்பினும், ஆலோசனையின் உதவிக்கான உங்கள் உரிமையை தள்ளுபடி செய்ய நீங்கள் முடிவு செய்தால், ஒரு வழக்கறிஞர் இல்லாமல் கேள்விகளுக்கு பதிலளித்தால், உண்மையைச் சொல்ல மறக்காதீர்கள்.

source: However, no court has yet addressed these issues in the context of Tor itself.
ta: எவ்வாறாயினும், இந்த பிரச்சினைகளை டோர் சூழலில் இதுவரை எந்த நீதிமன்றமும் தீர்க்கவில்லை.

source: If law enforcement becomes interested in traffic from your exit relay, it's possible that officers will mistakenly attribute that traffic as originating from your home.
ta: உங்கள் வெளியேறும் ரிலேவிலிருந்து போக்குவரத்தில் சட்ட அமலாக்கம் ஆர்வம் காட்டினால், அந்த போக்குவரத்து உங்கள் வீட்டிலிருந்து தோன்றியதாக அதிகாரிகள் தவறாக காரணம் கூறுவார்கள்.

source: If you are a Tor relay operator willing to stand up and help set a clear legal precedent establishing that merely running a relay does not create copyright liability for either operators or their bandwidth providers, EFF is interested in hearing from you.
ta: நீங்கள் ஒரு டோர் ரிலே ஆபரேட்டராக இருந்தால், எழுந்து நின்று ஒரு ரிலேவை இயக்குவது ஆபரேட்டர்கள் அல்லது அவர்களின் அலைவரிசை வழங்குநர்களுக்கு பதிப்புரிமை பொறுப்பை உருவாக்காது என்பதை நிறுவுவதற்கு ஒரு தெளிவான சட்ட முன்மாதிரியை அமைக்க உதவினால், EFF உங்களிடமிருந்து கேட்க ஆர்வமாக உள்ளது.

source: If you are detained and questioned by police, you have a right to request to speak with an attorney before and during any questioning.
ta: நீங்கள் காவல்துறையினரால் தடுத்து வைக்கப்பட்டு விசாரிக்கப்பட்டால், எந்தவொரு கேள்விக்கும் முன்னும் பின்னும் ஒரு வழக்கறிஞருடன் பேசுமாறு கோர உங்களுக்கு உரிமை உண்டு.

source: If you are not willing to deal with that risk, a bridge or middle relay may be a better fit for you.
ta: அந்த அபாயத்தை சமாளிக்க நீங்கள் தயாராக இல்லை என்றால், ஒரு பாலம் அல்லது நடுத்தர ரிலே உங்களுக்கு மிகவும் பொருத்தமாக இருக்கலாம்.

source: If you are uncomfortable with this uncertainty, you may consider using a reduced exit policy (such as the default policy suggested by the Tor Project) to try to minimize traffic types that are often targeted in copyright complaints.
ta: இந்த நிச்சயமற்ற தன்மையில் நீங்கள் சங்கடமாக இருந்தால், பதிப்புரிமை புகார்களை பெரும்பாலும் குறிவைக்கும் போக்குவரத்து வகைகளைக் குறைக்க முயற்சிக்கக் குறைக்கப்பட்ட வெளியேறும் கொள்கையை (டோர் திட்டத்தால் பரிந்துரைக்கப்பட்ட இயல்புநிலை கொள்கை போன்றவை) பயன்படுத்தலாம்.

source: If you do decide to run an exit relay from your home despite these risks, please review Tor’s recommendations, including telling your ISP and obtaining a separate IP address for the exit relay.
ta: இந்த அபாயங்கள் இருந்தபோதிலும் உங்கள் வீட்டிலிருந்து வெளியேறும் ரிலேவை இயக்க நீங்கள் முடிவு செய்தால், தயவுசெய்து உங்கள் ISP ஐச் சொல்வது மற்றும் வெளியேறும் ரிலேவுக்கு தனி ஐபி முகவரியைப் பெறுவது உள்ளிட்ட TOR இன் பரிந்துரைகளை மதிப்பாய்வு செய்யவும்.

source: If you like, you should consider submitting a copy of your notice to the Lumen Database. The email address for submissions is team@lumendatabase.org.
ta: நீங்கள் விரும்பினால், உங்கள் அறிவிப்பின் நகலை லுமேன் தரவுத்தளத்தில் சமர்ப்பிப்பதை நீங்கள் பரிசீலிக்க வேண்டும். சமர்ப்பிப்புகளுக்கான மின்னஞ்சல் முகவரி team@lumendatabase.org.

source: If your exit traffic draws the attention of the government or disgruntled private party, you want them to figure out quickly and easily that you are part of the Tor network and not responsible for the content.
ta: உங்கள் வெளியேறும் போக்குவரத்து அரசாங்கத்தின் கவனத்தை ஈர்க்கிறது அல்லது மனக்குறை அடைந்த தனியார் கட்சியை ஈர்க்கிறது என்றால், நீங்கள் TOR நெட்வொர்க்கின் ஒரு பகுதியாக இருக்கிறீர்கள், உள்ளடக்கத்திற்கு பொறுப்பல்ல என்பதை அவர்கள் விரைவாகவும் எளிதாகவும் கண்டுபிடிக்க வேண்டும்.

source: In the United States, the data may be protected by the Electronic Communications Privacy Act, and relay operators outside of the United States may be subject to similar data protection laws.
ta: ஒன்றுபட்டது ச்டேட்சில், எலக்ட்ரானிக் கம்யூனிகேசன்ச் தனியுரிமைச் சட்டத்தால் தரவு பாதுகாக்கப்படலாம், மேலும் அமெரிக்காவிற்கு வெளியே உள்ள ரிலே ஆபரேட்டர்கள் இதே போன்ற தரவு பாதுகாப்பு சட்டங்களுக்கு உட்பட்டிருக்கலாம்.

source: Indeed, police have mistakenly attributed traffic from an exit relay as coming from the relay’s operator.
ta: உண்மையில், ரிலேவின் ஆபரேட்டரிடமிருந்து வருவதாக வெளியேறும் ரிலேவிலிருந்து போக்குவரத்தை போலீசார் தவறாகக் கூறியுள்ளனர்.

source: Inquiries to EFF for the purpose of securing legal representation or referrals should be directed to our intake coordinator by sending an email to info at eff.org.
ta: சட்டப்பூர்வ பிரதிநிதித்துவம் அல்லது பரிந்துரைகளைப் பாதுகாப்பதற்கான நோக்கத்திற்காக EFF க்கான விசாரணைகள் Eff.org இல் தகவலுக்கு மின்னஞ்சல் அனுப்புவதன் மூலம் எங்கள் உட்கொள்ளும் ஒருங்கிணைப்பாளருக்கு அனுப்பப்பட வேண்டும்.

source: Inquiries to EFF for the purpose of securing legal representation should be directed to our intake coordinator (info at eff.org).
ta: சட்டப்பூர்வ பிரதிநிதித்துவத்தைப் பாதுகாப்பதற்கான நோக்கத்திற்காக EFF க்கான விசாரணைகள் எங்கள் உட்கொள்ளும் ஒருங்கிணைப்பாளருக்கு (EFF.org இல் தகவல்) அனுப்பப்பட வேண்டும்.

source: It is best to say "I want my attorney and I choose to remain silent" and then refuse questioning until you have a chance to talk to a lawyer.
ta: "நான் என் வழக்கறிஞரை விரும்புகிறேன், நான் அமைதியாக இருக்க வேண்டும் என்று தேர்வு செய்கிறேன்" என்று சொல்வது நல்லது, பின்னர் ஒரு வழக்கறிஞருடன் பேச உங்களுக்கு வாய்ப்பு கிடைக்கும் வரை கேள்வி கேட்க மறுக்கிறது.

source: Lumen encourages submissions from people outside the United States too.
ta: அமெரிக்காவிற்கு வெளியே உள்ளவர்களிடமிருந்து சமர்ப்பிப்புகளை லுமேன் ஊக்குவிக்கிறார்.

source: Lying to law enforcement may lead to more trouble than for whatever it was they wanted to talk to you about in the first place.
ta: சட்ட அமலாக்கத்தில் பொய் சொல்வது அவர்கள் முதலில் உங்களுடன் பேச விரும்பியதை விட அதிக சிக்கலுக்கு வழிவகுக்கும்.

source: NOTE: This FAQ is for informational purposes only and does not constitute legal advice.
ta: குறிப்பு: இந்த கேள்விகள் செய்தி நோக்கங்களுக்காக மட்டுமே மற்றும் சட்ட ஆலோசனையை உருவாக்கவில்லை.

source: Note that although EFF cannot practice law outside of the United States, it will still try to assist non-U.S. relay operators in finding local representation.
ta: அமெரிக்காவிற்கு வெளியே EFF சட்டத்தை பயிற்சி செய்ய முடியாது என்றாலும், உள்ளக பிரதிநிதித்துவத்தைக் கண்டுபிடிப்பதில் U.S அல்லாத ரிலே ஆபரேட்டர்களுக்கு இது உதவ முயற்சிக்கும் என்பதை நினைவில் கொள்க.

source: Note that template only refers to U.S. jurisdictions, and is intended only to address copyright complaints that are based on a relay of allegedly infringing material through the Tor node.
ta: வார்ப்புரு யு.எச். அதிகார வரம்புகளை மட்டுமே குறிக்கிறது என்பதை நினைவில் கொள்க, மேலும் பதிப்புரிமை புகார்களை நிவர்த்தி செய்வதற்காக மட்டுமே இது நோக்கம் கொண்டது, இது டோர் முனை மூலம் மீறுவதாகக் கூறப்படும் பொருட்களின் ரிலேவை அடிப்படையாகக் கொண்டது.

source: Of course, you should avoid keeping any sensitive or personal information on the computer hosting your exit relay, and you never should use that machine for any illegal purpose.
ta: நிச்சயமாக, உங்கள் வெளியேறும் ரிலேவை வழங்கும் கணினியில் எந்தவொரு முக்கியமான அல்லது தனிப்பட்ட தகவல்களையும் வைத்திருப்பதை நீங்கள் தவிர்க்க வேண்டும், மேலும் எந்தவொரு சட்டவிரோத நோக்கத்திற்காகவும் நீங்கள் ஒருபோதும் அந்த இயந்திரத்தைப் பயன்படுத்தக்கூடாது.

source: Our aim is to provide a general description of the legal issues surrounding Tor in the United States.
ta: அமெரிக்காவில் டோர் சுற்றியுள்ள சட்ட சிக்கல்களைப் பற்றிய பொதுவான விளக்கத்தை வழங்குவதே எங்கள் நோக்கம்.

source: Such inquiries will be kept confidential subject to the limits of the attorney/client privilege.
ta: இத்தகைய விசாரணைகள் வழக்கறிஞர்/வாடிக்கையாளர் சலுகையின் வரம்புகளுக்கு உட்பட்டு ரகசியமாக வைக்கப்படும்.

source: That may attract the attention of private litigants or law enforcement.
ta: இது தனியார் வழக்குரைஞர்கள் அல்லது சட்ட அமலாக்கத்தின் கவனத்தை ஈர்க்கக்கூடும்.

source: The Tor Project [suggests](https://blog.torproject.org/blog/tips-running-exit-node) the following ways to let others know that you're running an exit relay:
ta: TOR திட்டம் [பரிந்துரைக்கிறது] (https://blog.torproject.org/blog/tips-running-exit-node) நீங்கள் வெளியேறும் ரிலேவை இயக்குகிறீர்கள் என்பதை மற்றவர்களுக்கு தெரியப்படுத்த பின்வரும் வழிகள்:

source: The Tor Project's blog has some excellent [recommendations](https://blog.torproject.org/blog/tips-running-exit-node) for running an exit with as little risk as possible. We suggest that you review their advice before setting up an exit relay.
ta: டோர் திட்டத்தின் வலைப்பதிவில் சில சிறந்த [பரிந்துரைகள்] (https://blog.torproject.org/blog/tips-running-exit-node) முடிந்தவரை சிறிய ஆபத்துடன் வெளியேறும். வெளியேறும் ரிலே அமைப்பதற்கு முன் அவர்களின் ஆலோசனையை மதிப்பாய்வு செய்யுமாறு நாங்கள் பரிந்துரைக்கிறோம்.

source: The Tor community maintains a list of ISPs that are particularly Tor-savvy, as well as ones that aren't.
ta: டோர் சமூகம் குறிப்பாக டோர்-ஆர்வமுள்ள ISP களின் பட்டியலையும், இல்லாதவற்றையும் பராமரிக்கிறது.

source: Therefore, please do not act on this information alone; if you have any specific legal problems, issues, or questions, seek a complete review of your situation with a lawyer licensed to practice in your jurisdiction.
ta: எனவே, தயவுசெய்து இந்த தகவலில் மட்டும் செயல்பட வேண்டாம்; உங்களிடம் ஏதேனும் குறிப்பிட்ட சட்ட சிக்கல்கள், சிக்கல்கள் அல்லது கேள்விகள் இருந்தால், உங்கள் அதிகார வரம்பில் பயிற்சி செய்ய உரிமம் பெற்ற ஒரு வழக்கறிஞருடன் உங்கள் நிலைமையை முழுமையாக மதிப்பாய்வு செய்யவும்.

source: These relays do not directly forward traffic to the Internet and so can't be easily mistaken for the origin of allegedly unlawful content.
ta: இந்த ரிலேக்கள் நேரடியாக போக்குவரத்தை இணையத்திற்கு அனுப்பாது, எனவே சட்டவிரோத உள்ளடக்கத்தின் தோற்றத்தை எளிதில் தவறாகப் புரிந்து கொள்ள முடியாது.

source: This could mean the difference between having your computer seized by law enforcement and being left alone.
ta: இது உங்கள் கணினியை சட்ட அமலாக்கத்தால் பறிமுதல் செய்வதற்கும் தனியாக விடப்படுவதற்கும் உள்ள வித்தியாசத்தை குறிக்கும்.

source: This could result in law enforcement raiding your home, seizing your computer, and suspecting you of criminal activity.
ta: இது சட்ட அமலாக்கத்தை உங்கள் வீட்டைக் சோதனையிட்டு, உங்கள் கணினியைக் கைப்பற்றி, குற்றச் செயல்களை சந்தேகிக்கக்கூடும்.

source: This has resulted in police suspecting Tor relay operators of crimes and sometimes [seizing computer](https://www.eff.org/deeplinks/2011/08/why-ip-addresses-alone-dont-identify-criminals) equipment, including Tor relays.
ta: டோர் ரிலேச் உட்பட டோர் ரிலே ஆபரேட்டர்கள் குற்றங்களின் டோர் ரிலே ஆபரேட்டர்கள் மற்றும் சில சமயங்களில் [கணினியைக் கைப்பற்றுதல்] (https://www.eff.org/deeplinks/2011/08/why-ip-dandress-addresses- ஒரே-டோன்ட்-ஐடி-சைன்டிஃபை-கிரிமினல்) கருவிகளை போலீசார் சந்தேகித்துள்ளனர்.

source: This way, you'll receive any abuse complaints and can respond to them directly. Otherwise, try to ensure that your ISP forwards abuse complaints that it receives to you.
ta: இந்த வழியில், நீங்கள் ஏதேனும் துச்பிரயோக புகார்களைப் பெறுவீர்கள், மேலும் அவர்களுக்கு நேரடியாக பதிலளிக்க முடியும். இல்லையெனில், உங்கள் ISP உங்களுக்கு பெறும் துச்பிரயோக புகார்களை முன்னோக்கி உறுதிப்படுத்த முயற்சிக்கவும்.

source: This will help ensure that your Internet access isn't cut off due to abuse complaints.
ta: துச்பிரயோக புகார்கள் காரணமாக உங்கள் இணைய அணுகல் துண்டிக்கப்படவில்லை என்பதை உறுதிப்படுத்த இது உதவும்.

source: This will help us recognize trends and issues that the lawyers might want to focus on.
ta: வழக்கறிஞர்கள் கவனம் செலுத்த விரும்பும் போக்குகள் மற்றும் சிக்கல்களை அங்கீகரிக்க இது உதவும்.

source: Though there are important exceptions for certain criminal and intellectual property-based claims, Section 230’s immunity protects online services, such as the Tor network, against a range of laws that might otherwise be used to hold them legally responsible for what others say and do.
ta: சில குற்றவியல் மற்றும் அறிவுசார் சொத்து அடிப்படையிலான உரிமைகோரல்களுக்கு முக்கியமான விதிவிலக்குகள் இருந்தாலும், பிரிவு 230 இன் நோய் எதிர்ப்பு ஆற்றல் டோர் பிணையம் போன்ற நிகழ்நிலை சேவைகளை பாதுகாக்கிறது, மற்றவர்கள் சொல்வதற்கும் செய்வதற்கும் சட்டப்பூர்வமாக பொறுப்பேற்கப் பயன்படுத்தப்படக்கூடிய பல சட்டங்களுக்கு எதிராக.

source: To the extent you do maintain logs, however, you should not disclose them to any third party without first consulting a lawyer.
ta: இருப்பினும், நீங்கள் பதிவுகளை பராமரிக்கும் அளவிற்கு, ஒரு வழக்கறிஞரை முதலில் ஆலோசிக்காமல் அவற்றை எந்த மூன்றாம் தரப்பினருக்கும் வெளியிடக்கூடாது.

source: Tor's core developers further reserve the right to refuse a Tor relay operator's request to be listed in their directory or to remove any relay from their directory for any reason.
ta: டோர் ரிலே ஆபரேட்டரின் கோரிக்கையை தங்கள் கோப்பகத்தில் பட்டியலிட வேண்டும் அல்லது எந்தவொரு காரணத்திற்காகவும் எந்தவொரு ரிலேவையும் தங்கள் கோப்பகத்திலிருந்து அகற்றுவதற்கான உரிமையை டோரின் முக்கிய உருவாக்குபவர்கள் மேலும் ஒதுக்குகிறார்கள்.

source: We believe that running a Tor relay, including an exit relay that allows people to anonymously send and receive traffic, is legal under U.S. law. Law enforcement, however, [often misunderstands](https://www.eff.org/wp/unreliable-informants-ip-addresses-digital-tips-and-police-raids) how Tor works and has occasionally attributed illegal traffic on the network as originating from a Tor exit relay.
ta: ஒரு டோர் ரிலேவை இயக்குவது, வெளியேறும் ரிலே உட்பட, மக்களை அநாமதேயமாக போக்குவரத்தை அனுப்பவும் பெறவும் அனுமதிக்கிறது, இது யு.எச். சட்டத்தின் கீழ் சட்டபூர்வமானது என்று நாங்கள் நம்புகிறோம். எவ்வாறாயினும், சட்ட அமலாக்கம் [பெரும்பாலும் தவறான புரிதல்கள்] (https://www.eff.org/wp/uneliable-informants-ip-addresses-digital-tips-and-police-raids) டோர் எவ்வாறு செயல்படுகிறது மற்றும் அவ்வப்போது நெட்வொர்க்கில் சட்டவிரோத போக்குவரத்தை ஒரு டோர் வெளியேறும் வெளியீட்டிலிருந்து தோன்றியதாகக் கூறியது.

source: We cannot guarantee that you will never face any legal liability as a result of running a Tor relay.
ta: டோர் ரிலேவை இயக்குவதன் விளைவாக நீங்கள் ஒருபோதும் எந்தவொரு சட்டபூர்வமான பொறுப்பையும் எதிர்கொள்ள மாட்டீர்கள் என்று நாங்கள் பொறுப்பு அளிக்க முடியாது.

source: While we believe that running an exit relay is legal, it is practically impossible to stop the use of an exit relay for illegal activity.
ta: வெளியேறும் ரிலேவை இயக்குவது சட்டபூர்வமானது என்று நாங்கள் நம்பினாலும், சட்டவிரோத செயல்பாட்டிற்கு வெளியேறும் ரிலே பயன்பாட்டை நிறுத்துவது நடைமுறையில் சாத்தியமற்றது.

source: You can contact info@eff.org if you face a specific legal issue. We will try to assist you, but given EFF's small size, we cannot guarantee that we can help everyone.
ta: நீங்கள் ஒரு குறிப்பிட்ட சட்ட சிக்கலை எதிர்கொண்டால் info@eff.org ஐ தொடர்பு கொள்ளலாம். நாங்கள் உங்களுக்கு உதவ முயற்சிப்போம், ஆனால் EFF இன் சிறிய அளவைக் கொடுத்தால், நாங்கள் அனைவருக்கும் உதவ முடியும் என்று நாங்கள் பொறுப்பு அளிக்க முடியாது.

source: You may receive legal inquiries where you are prohibited by law from telling anyone about the request. We believe that, at least in the United States, such gag orders do not prevent you from talking to a lawyer, including calling a lawyer to find representation.
ta: கோரிக்கையைப் பற்றி யாரிடமும் சொல்ல சட்டத்தால் நீங்கள் தடைசெய்யப்பட்ட சட்ட விசாரணைகளை நீங்கள் பெறலாம். குறைந்தபட்சம் அமெரிக்காவில், அத்தகைய காக் ஆர்டர்கள் ஒரு வழக்கறிஞருடன் பேசுவதைத் தடுக்காது என்று நாங்கள் நம்புகிறோம், ஒரு வழக்கறிஞரை பிரதிநிதித்துவத்தைக் கண்டுபிடிக்க அழைப்பது உட்பட.
