Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: * It is easy for Onion Services operators to debug their logs and know which services have errors without recurring to a table or to memorize some random characters from a regular onion address.
ta: * வெங்காய பணி ஆபரேட்டர்கள் தங்கள் பதிவுகளை பிழைத்திருத்துவது எளிதானது மற்றும் ஒரு அட்டவணையில் மீண்டும் வராமல் எந்த சேவைகளுக்கு பிழைகள் உள்ளன அல்லது வழக்கமான வெங்காய முகவரியிலிருந்து சில சீரற்ற எழுத்துக்களை மனப்பாடம் செய்வது எளிதானது.

source: * It is easy for Onion Services users to know which site they are about to access.
ta: * வெங்காய பணி பயனர்கள் அவர்கள் எந்த தளத்தை அணுகப்போகிறார்கள் என்பதை அறிந்து கொள்வது எளிது.

source: * It is relatively easy for anybody with average computing resources to create other keys beginning with `mysitename` (although they are very unlikely to come up with the exact key from the example above).
ta: * சராசரி கணினி வளங்களைக் கொண்ட எவரும் `mysitename` உடன் தொடங்கும் பிற விசைகளை உருவாக்குவது ஒப்பீட்டளவில் எளிதானது (மேலே உள்ள எடுத்துக்காட்டிலிருந்து சரியான விசையை அவர்கள் கொண்டு வருவது மிகவும் சாத்தியமில்லை என்றாலும்).

source: * [Tips when mining Onion Addresses](https://onionservices.torproject.org/apps/web/onionspray/guides/mining/)
ta: * [வெங்காய முகவரிகளைச் சுரங்கப்படுத்தும்போது உதவிக்குறிப்புகள்](https://onionservices.torproject.org/apps/web/onionspray/guides/mining/)

source: **Step 3.** Run the generator
ta: ** படி 3. ** செனரேட்டரை இயக்கவும்

source: A vanity address is an onion address that starts with a pre-chosen number of characters, usually a meaningful name related to a specific Onion Service.
ta: ஒரு வேனிட்டி முகவரி என்பது வெங்காய முகவரி, இது முன்பே தேர்ந்தெடுக்கப்பட்ட எழுத்துக்களுடன் தொடங்குகிறது, பொதுவாக ஒரு குறிப்பிட்ட வெங்காய சேவையுடன் தொடர்புடைய அர்த்தமுள்ள பெயர்.

source: Additionally, if you are looking for a more advanced tool, see [Onionmine](https://onionservices.torproject.org/apps/web/onionmine/), a handy wrapper for `mkp224o` that can also handle TLS certificate generation for Onion Services.
ta: கூடுதலாக, நீங்கள் மிகவும் மேம்பட்ட கருவியைத் தேடுகிறீர்களானால், [வெங்காயத்தை] (https://onionservices.torproject.org/apps/web/onionmine/) ஐப் பார்க்கவும், `MKP224O` க்கான எளிமையான ரேப்பர், இது வெங்காய சேவைகளுக்கான TLS சான்றிதழ் தலைமுறையையும் கையாள முடியும்.

source: But it also has some disadvantages:
ta: ஆனால் இது சில குறைபாடுகளையும் கொண்டுள்ளது:

source: For example, when running many [Onionbalance](https://onionbalance.readthedocs.io/en/latest/) backends.
ta: எடுத்துக்காட்டாக, பல [வெங்காய பிரசங்கத்தை] (https://onionbalance.readthedocs.io/en/latest/) பின்தளத்தில் இயக்கும் போது.

source: For instance, one might try to generate an onion address for the `mysitename` website and end up with something looking like this:
ta: உதாரணமாக, ஒருவர் `mysitename` வலைத்தளத்திற்கு வெங்காய முகவரியை உருவாக்க முயற்சி செய்யலாம், மேலும் இதுபோன்ற ஒன்றைக் கொண்டு முடிவடையும்:

source: If the legitimate site does not use a vanity address, users might think that the fake site is the valid one because it has a nicer address.
ta: முறையான தளம் வேனிட்டி முகவரியைப் பயன்படுத்தவில்லை என்றால், பயனர்கள் ஒரு நல்ல முகவரியைக் கொண்டிருப்பதால் போலி தளம் செல்லுபடியாகும் என்று பயனர்கள் நினைக்கலாம்.

source: So, in a sense, vanity keys might be confusing and offer a false sense of identity; users can easily be mistaken into accessing an impersonating onion service just because it starts with `mysitename`.
ta: எனவே, ஒரு விதத்தில், வேனிட்டி விசைகள் குழப்பமானதாக இருக்கலாம் மற்றும் தவறான அடையாள உணர்வை வழங்கக்கூடும்; ஆள்மாறாட்டம் செய்யும் வெங்காய சேவையை `mysitename` உடன் தொடங்குவதால் பயனர்கள் எளிதாக தவறாகப் புரிந்து கொள்ளலாம்.

source: The long-term solution involves a better onion naming scheme, and vanity addresses would remain only as a way to help system administrators group onion addresses.
ta: நீண்டகால தீர்வு ஒரு சிறந்த வெங்காய பெயரிடும் திட்டத்தை உள்ளடக்கியது, மேலும் கணினி நிர்வாகிகள் குழு வெங்காய முகவரிகளுக்கு உதவுவதற்கான ஒரு வழியாக வேனிட்டி முகவரிகள் மட்டுமே இருக்கும்.

source: This has some advantages:
ta: இது சில நன்மைகளைக் கொண்டுள்ளது:

source: This will create the `onions` directory and others needed for each of the discovered onion addresses with their respective keys.
ta: இது `வெங்காயத்தின்` கோப்பகத்தையும், கண்டுபிடிக்கப்பட்ட ஒவ்வொரு வெங்காய முகவரிகளுக்கும் அந்தந்த விசைகளுடன் தேவையான பிறவற்றை உருவாக்கும்.

source: To know what else the tool can do, refer to its help by executing the following command:
ta: கருவி வேறு என்ன செய்ய முடியும் என்பதை அறிய, பின்வரும் கட்டளையை இயக்குவதன் மூலம் அதன் உதவியைப் பார்க்கவும்:

source: `mkp224o` is one of the tools that can be used to generate vanity addresses.
ta: `MKP224O` என்பது வேனிட்டி முகவரிகளை உருவாக்க பயன்படுத்தக்கூடிய கருவிகளில் ஒன்றாகும்.

source: mysitenameyx4fi3l6x2gyzmtmgxjyqyorj9qsb5r543izcwymle.onion
ta: mySitenameyx4fi3l6x2gyzmtmgxjyqyorj9qsb5r543izcwymle.onion.onion

source: More easily recognizable onion addresses.
ta: மிக எளிதாக அடையாளம் காணக்கூடிய வெங்காய முகவரிகள்.

source: Vanity Addresses
ta: வேனிட்டி முகவரிகள்

source: ##What are Onion Services?
ta: ## வெங்காய சேவைகள் என்றால் என்ன?

source: Onion services are services that can only be accessed over Tor. Running an Onion Service gives your users all the security of HTTPS with the added privacy benefits of Tor Browser.
ta: வெங்காய சேவைகள் டோர் மீது மட்டுமே அணுகக்கூடிய சேவைகள். வெங்காய சேவையை இயக்குவது உங்கள் பயனர்களுக்கு TOR உலாவியின் கூடுதல் தனியுரிமை நன்மைகளுடன் HTTP களின் அனைத்து பாதுகாப்பையும் வழங்குகிறது.

source: Grow your .onion
ta: உங்கள். ஒனியன் வளர்க்கவும்

source: Onion services help you and your users defeat surveillance and censorship. Learn how you can deploy Onion Services.
ta: வெங்காய சேவைகள் உங்களுக்கும் உங்கள் பயனர்களுக்கும் கண்காணிப்பு மற்றும் தணிக்கை ஆகியவற்றைத் தோற்கடிக்க உதவுகின்றன. வெங்காய சேவைகளை நீங்கள் எவ்வாறு பயன்படுத்தலாம் என்பதை அறிக.

source: Onion Services
ta: Onion சேவைகள்

source: ## Further resources
ta: ## மேலும் ஆதாரங்கள்

source: ## The Onion Service Protocol: Overview
ta: ## வெங்காய பணி நெறிமுறை: கண்ணோட்டம்

source: ## Why Onion Services?
ta: ## வெங்காய சேவைகள் ஏன்?

source: ### Act 1: Where the Onion Service sets up its introduction points
ta: ### சட்டம் 1: வெங்காய பணி அதன் அறிமுக புள்ளிகளை அமைக்கும் இடத்தில்

source: ### Act 2: Where the Onion Service publishes its descriptors
ta: ### சட்டம் 2: வெங்காய பணி அதன் விளக்கங்களை வெளியிடும் இடத்தில்

source: ### Act 3: Where a client wants to visit the Onion Service
ta: ### சட்டம் 3: ஒரு வாடிக்கையாளர் வெங்காய சேவையைப் பார்வையிட விரும்புகிறார்

source: ### Act 4: Where the client introduces itself to the Onion Service
ta: ### சட்டம் 4: வாடிக்கையாளர் வெங்காய சேவைக்கு தன்னை அறிமுகப்படுத்துகிறார்

source: ### Act 5: Where the client verify onion address signature
ta: ### சட்டம் 5: கிளையன்ட் வெங்காய முகவரி கையொப்பத்தை சரிபார்க்கும் இடத்தில்

source: ### Act 6: Where the client establishes a rendezvous point
ta: ### சட்டம் 6: வாடிக்கையாளர் ஒரு சந்திப்பு புள்ளியை நிறுவுகிறார்

source: ### Act 7: Where the Onion Service rendezvous with the client
ta: ### சட்டம் 7: வெங்காய பணி வாடிக்கையாளருடன் சந்திக்கும் இடத்தில்

source: ### Act 8: Where the rendezvous point verifies the client's secret
ta: ### சட்டம் 8: அங்கு சந்திப்பு புள்ளி வாடிக்கையாளரின் ரகசியத்தை சரிபார்க்கிறது

source: ### Act 9: Where the Onion Service rendezvous with the client
ta: ### சட்டம் 9: வெங்காய பணி வாடிக்கையாளருடன் சந்திக்கும் இடத்தில்

source: ### End-to-end authentication
ta: ### இறுதி முதல் இறுதி ஏற்பு

source: ### End-to-end encryption
ta: ### இறுதி-க்கு-இறுதி குறியாக்கம்

source: ### Location hiding
ta: ### இருப்பிடம் மறைந்திருக்கும்

source: ### NAT punching
ta: ### நாட் பஞ்சிங்

source: - Presentations about Onion Services: [Understanding Tor Onion Services and Their Use Cases - HOPE XI 2016](https://www.youtube.com/watch?v=VmsFxBEN3fc), [DEF CON 25 - Roger Dingledine - Next Generation Tor Onion Services](https://www.youtube.com/watch?v=Di7qAVidy1Y).
ta: - Presentations பற்றி Onion Services: [Understanding Tor Onion சேவைகள் and Their Use Cases - HOPE XI 2016](https://www.youtube.com/watch?v=VmsFxBEN3fc), [DEF கோன் 25 - Roger Dingledine - அடுத்தது Generation Tor Onion Services](https://www.youtube.com/watch?v=Di7qAVidy1Y).

source: <img class="col-lg-8" src="../../static/images/onion-services/overview/onion-service-01.png" alt="Onion Services: Step 1">
ta: <img வகுப்பு = "col-lg-8" SRC = "../../ நிலையான/படங்கள்/வெங்காய சேவைகள்/கண்ணோட்டம்/வெங்காய-சேவை -01.png" மாற்று = "வெங்காய சேவைகள்: படி 1">

source: <img class="col-lg-8" src="../../static/images/onion-services/overview/onion-service-02.png" alt="Onion Services: Step 2">
ta: <img வகுப்பு = "col-lg-8" SRC = "../../ நிலையான/படங்கள்/வெங்காய சேவைகள்/கண்ணோட்டம்/வெங்காய-சேவை -02.png" மாற்று = "வெங்காய சேவைகள்: படி 2">

source: <img class="col-lg-8" src="../../static/images/onion-services/overview/onion-service-03.png" alt="Onion Services: Step 3">
ta: <img வகுப்பு = "col-lg-8" SRC = "../../ நிலையான/படங்கள்/வெங்காய-சேவைகள்/கண்ணோட்டம்/வெங்காய-சேவை -03.png" மாற்று = "வெங்காய சேவைகள்: படி 3">

source: <img class="col-lg-8" src="../../static/images/onion-services/overview/onion-service-04.png" alt="Onion Services: Step 4">
ta: <img வகுப்பு = "col-lg-8" SRC = "../../ நிலையான/படங்கள்/வெங்காய-சேவைகள்/கண்ணோட்டம்/வெங்காய-சேவை -04.png" மாற்று = "வெங்காய சேவைகள்: படி 4">

source: <img class="col-lg-8" src="../../static/images/onion-services/overview/onion-service-05.png" alt="Onion Services: Step 5">
ta: <img வகுப்பு = "col-lg-8" SRC = "../../ நிலையான/படங்கள்/வெங்காய சேவைகள்/கண்ணோட்டம்/வெங்காய-சேவை -05.png" மாற்று = "வெங்காய சேவைகள்: படி 5">

source: <img class="col-lg-8" src="../../static/images/onion-services/overview/onion-service-06.png" alt="Onion Services: Step 6">
ta: <img வகுப்பு = "col-lg-8" SRC = "../../ நிலையான/படங்கள்/வெங்காய சேவைகள்/கண்ணோட்டம்/வெங்காய-சேவை -06.png" மாற்று = "வெங்காய சேவைகள்: படி 6">

source: <img class="col-lg-8" src="../../static/images/onion-services/overview/onion-service-07.png" alt="Onion Services: Step 7">
ta: <img வகுப்பு = "col-lg-8" SRC = "../../ நிலையான/படங்கள்/வெங்காய சேவைகள்/கண்ணோட்டம்/வெங்காய-சேவை -07.png" மாற்று = "வெங்காய சேவைகள்: படி 7">

source: <img class="col-lg-8" src="../../static/images/onion-services/overview/onion-service-08.png" alt="Onion Services: Step 8">
ta: <img வகுப்பு = "col-lg-8" SRC = "../../ நிலையான/படங்கள்/வெங்காய சேவைகள்/கண்ணோட்டம்/வெங்காய-சேவை -08.png" மாற்று = "வெங்காய சேவைகள்: படி 8">

source: <img class="col-lg-8" src="../../static/images/onion-services/overview/onion-service-09.png" alt="Onion Services: Step 9">
ta: <img வகுப்பு = "col-lg-8" SRC = "../../ நிலையான/படங்கள்/வெங்காய சேவைகள்/கண்ணோட்டம்/வெங்காய-சேவை -09.png" மாற்று = "வெங்காய சேவைகள்: படி 9">

source: All the previous steps were just set up for the Onion Service so that it's reachable by clients.
ta: முந்தைய அனைத்து படிகளும் வெங்காய சேவைக்காக அமைக்கப்பட்டன, இதனால் இது வாடிக்கையாளர்களால் அடைய முடியும்.

source: An Onion Service's IP address is protected.
ta: வெங்காய சேவையின் ஐபி முகவரி பாதுகாக்கப்படுகிறது.

source: And inside the descriptor, there are the introduction points that allow the client to introduce themselves to SecureDrop's Onion Service.
ta: விவரிப்பாளருக்குள், அறிமுக புள்ளிகள் உள்ளன, அவை வாடிக்கையாளரை பாதுகாப்பான வெங்காய சேவைக்கு தங்களை அறிமுகப்படுத்த அனுமதிக்கின்றன.

source: As the first step in the protocol, the Onion Service will contact a bunch of Tor relays and ask them to act as its _introduction points_ by establishing long-term circuits to them.
ta: நெறிமுறையின் முதல் படியாக, வெங்காய பணி டோர் ரிலேக்களைத் தொடர்புகொண்டு, நீண்ட கால சுற்றுகளை நிறுவுவதன் மூலம் அதன் _ அறிமுக புள்ளிகள்_ ஆக செயல்படும்படி கேட்கும்.

source: Before the introduction takes place, the client (in this case, you) picks a Tor relay and establishes a circuit to it.
ta: அறிமுகம் நடைபெறுவதற்கு முன்பு, வாடிக்கையாளர் (இந்த விசயத்தில், நீங்கள்) ஒரு டோர் ரிலேவைத் தேர்ந்தெடுத்து அதற்கு ஒரு சுற்று நிறுவுகிறார்.

source: Finally, using the rendezvous point, a Tor circuit is formed between you and your newspaper's SecureDrop Onion Service.
ta: இறுதியாக, ரெண்டெச்வச் புள்ளியைப் பயன்படுத்தி, உங்களுக்கும் உங்கள் செய்தித்தாளின் பாதுகாப்பான வெங்காய சேவைக்கும் இடையில் ஒரு டோர் சுற்று உருவாகிறது.

source: For this reason, the Onion Service assembles an _Onion Service descriptor_, containing a list of its introduction points (and "authentication keys"), and signs this descriptor with the Onion Service's _identity private key_.
ta: இந்த காரணத்திற்காக, வெங்காய பணி ஒரு _ ஒனியன் பணி விவரிப்பான்_ ஐ அதன் அறிமுக புள்ளிகளின் பட்டியலைக் கொண்டுள்ளது (மற்றும் "அங்கீகார விசைகள்"), மற்றும் இந்த விவரிப்பாளரை வெங்காய சேவையின் _identity தனிப்பட்ட key_ உடன் கையொப்பமிடுகிறது.

source: Here are some more resources if you want to learn more:
ta: நீங்கள் மேலும் அறிய விரும்பினால் இன்னும் சில ஆதாரங்கள் இங்கே:

source: Here is a detailed breakdown of how this happens:
ta: இது எவ்வாறு நடக்கிறது என்பதற்கான விரிவான முறிவு இங்கே:

source: In general, the complete connection between client and Onion Service consists of 6 relays: 3 of them were picked by the client, with the third being the rendezvous point, and the other 3 were picked by the Onion Service.
ta: பொதுவாக, கிளையன்ட் மற்றும் வெங்காய சேவைக்கு இடையிலான முழுமையான தொடர்பு 6 ரிலேக்களைக் கொண்டுள்ளது: அவற்றில் 3 வாடிக்கையாளரால் தேர்ந்தெடுக்கப்பட்டன, மூன்றாவது ரென்டெச்வச் பாயிண்ட், மற்ற 3 வெங்காய சேவையால் தேர்ந்தெடுக்கப்பட்டன.

source: In particular, an Onion Service's address looks like this: `vww6ybal4bd7szmgncyruucpgfkqahzddi37ktceo3ah7ngmcopnpyyd.onion`
ta: குறிப்பாக, ஒரு வெங்காய சேவையின் முகவரி இப்படி தெரிகிறது: `VWW6YBAL4BD7SZMGNCYRUUCPGFKQAHZDDI37KTCEO3AH7NGMCOPNPYD.ONION`

source: In this case, the client has the onion address of SecureDrop and want to visit it, so they connect to the service with Tor Browser.
ta: இந்த வழக்கில், கிளையன்ட் செக்யூர்டிராப்பின் வெங்காய முகவரியைக் கொண்டுள்ளது, மேலும் அதைப் பார்வையிட விரும்புகிறது, எனவே அவர்கள் டோர் உலாவியுடன் சேவையுடன் இணைகிறார்கள்.

source: Is your network filtered and you can't open ports on your firewall?
ta: உங்கள் பிணையம் வடிகட்டப்பட்டதா, உங்கள் ஃபயர்வாலில் துறைமுகங்களைத் திறக்க முடியவில்லையா?

source: It uses an anonymized Tor circuit to do this upload so that it does not reveal its location.
ta: இந்த பதிவேற்றத்தை செய்ய இது அநாமதேய டோர் சர்க்யூட்டைப் பயன்படுத்துகிறது, இதனால் அதன் இருப்பிடத்தை வெளிப்படுத்தாது.

source: Let's imagine that your local newspaper decides to set up an Onion Service (using [SecureDrop](https://securedrop.org/)) to receive anonymous tips.
ta: அநாமதேய உதவிக்குறிப்புகளைப் பெற உங்கள் உள்ளக செய்தித்தாள் ஒரு வெங்காய சேவையை ([செக்யூர்டு ராப்] (https://securedrop.org/) ஐப் பயன்படுத்தி) அமைக்க முடிவு செய்கிறது என்று கற்பனை செய்யலாம்.

source: No impersonation is possible, which is generally not the case.
ta: ஆள்மாறாட்டம் எதுவும் சாத்தியமில்லை, இது பொதுவாக அப்படி இல்லை.

source: Now let's fast-forward to the point where an actual client wants to visit the service.
ta: இப்போது ஒரு உண்மையான வாடிக்கையாளர் சேவையைப் பார்வையிட விரும்பும் இடத்திற்கு வேகமாக முன்னேறுவோம்.

source: Now that the introduction points are set up, we need to create a way for clients to be able to find them.
ta: இப்போது அறிமுக புள்ளிகள் அமைக்கப்பட்டுள்ளதால், வாடிக்கையாளர்களுக்கு அவற்றைக் கண்டுபிடிக்க ஒரு வழியை உருவாக்க வேண்டும்.

source: Now the next thing that needs to happen is that the client goes to the _distributed hash table_ from **Step 2** and ask for the signed descriptor of SecureDrop's Onion Service.
ta: இப்போது நடக்க வேண்டிய அடுத்த சேதி என்னவென்றால், கிளையன்ட் ** படி 2 ** இலிருந்து _ -குறிச்சொல் ஆச் அட்டவணை_ க்குச் சென்று, செக்யூர்ட்டின் வெங்காய சேவையின் கையொப்பமிடப்பட்ட விவரிப்பாளரைக் கேட்கிறார்.

source: Now the question becomes **what kind of protocol is needed to achieve all these properties?**
ta: இப்போது கேள்வி ** இந்த பண்புகள் அனைத்தையும் அடைய என்ன வகையான நெறிமுறை தேவை? **

source: Onion service traffic is encrypted from the client to the onion host.
ta: வெங்காய பணி போக்குவரத்து வாடிக்கையாளரிடமிருந்து வெங்காய ஓச்டுக்கு குறியாக்கம் செய்யப்படுகிறது.

source: Onion services are an overlay network on top of TCP/IP, so in some sense IP addresses are not even meaningful to Onion Services: they are not even used in the protocol.
ta: வெங்காய சேவைகள் TCP/IP க்கு மேல் ஒரு மேலடுக்கு பிணையம் ஆகும், எனவே சில வகையில் ஐபி முகவரிகள் வெங்காய சேவைகளுக்கு கூட அர்த்தமுள்ளதாக இல்லை: அவை நெறிமுறையில் கூட பயன்படுத்தப்படவில்லை.

source: Onion services are services that can only be accessed over Tor.
ta: வெங்காய சேவைகள் டோர் மீது மட்டுமே அணுகக்கூடிய சேவைகள்.

source: Onion services don't need open ports because they punch through NAT. They only establish outgoing connections.
ta: வெங்காய சேவைகளுக்கு திறந்த துறைமுகங்கள் தேவையில்லை, ஏனெனில் அவை NAT வழியாக குத்துகின்றன. அவை வெளிச்செல்லும் இணைப்புகளை மட்டுமே நிறுவுகின்றன.

source: Onion services offer various privacy and security benefits to their users.
ta: வெங்காய சேவைகள் தங்கள் பயனர்களுக்கு பல்வேறு தனியுரிமை மற்றும் பாதுகாப்பு சலுகைகளை வழங்குகின்றன.

source: Running an Onion Service gives your users all the security of HTTPS with the added privacy benefits of Tor Browser.
ta: வெங்காய சேவையை இயக்குவது உங்கள் பயனர்களுக்கு TOR உலாவியின் கூடுதல் தனியுரிமை நன்மைகளுடன் HTTP களின் அனைத்து பாதுகாப்பையும் வழங்குகிறது.

source: Say you want to anonymously send some tax fraud data to your local newspaper through its SecureDrop.
ta: உங்கள் உள்ளக செய்தித்தாளுக்கு அதன் பாதுகாப்பான ராப் மூலம் சில வரி மோசடி தரவை அநாமதேயமாக அனுப்ப விரும்புகிறீர்கள் என்று சொல்லுங்கள்.

source: That's one of the reasons we can achieve the security properties above.
ta: மேலே உள்ள பாதுகாப்பு பண்புகளை நாம் அடைய இது ஒரு காரணம்.

source: The Onion Service connects to the rendezvous point (through an anonymized circuit) and sends the "one-time secret" to it.
ta: வெங்காய பணி ரெண்டெச்வச் புள்ளியுடன் (அநாமதேய சுற்று மூலம்) இணைகிறது மற்றும் அதற்கு "ஒரு முறை ரகசியத்தை" அனுப்புகிறது.

source: The Onion Service protocol uses the Tor network so that the client can introduce itself to the service, and then set up a rendezvous point with the service over the Tor network.
ta: வெங்காய பணி நெறிமுறை TOR நெட்வொர்க்கைப் பயன்படுத்துகிறது, இதனால் கிளையன்ட் தன்னை சேவையில் அறிமுகப்படுத்த முடியும், பின்னர் TOR நெட்வொர்க்கில் சேவையுடன் ஒரு சந்திப்பு புள்ளியை அமைக்கலாம்.

source: The Onion Service upload that signed descriptor to a _distributed hash table_, which is part of the Tor network, so that clients can also get it.
ta: டோர் நெட்வொர்க்கின் ஒரு பகுதியாக இருக்கும் விநியோகிக்கப்பட்ட ஆச் அட்டவணையில் விவரிப்பாளரை கையொப்பமிட்ட வெங்காய பணி பதிவேற்றம், இதனால் வாடிக்கையாளர்களும் அதைப் பெற முடியும்.

source: The Onion Service will hide and protect itself behind the Tor network by only allowing access through three introduction points that it connects to through a three-hop Tor circuit.
ta: வெங்காய பணி TOR நெட்வொர்க்கின் பின்னால் தன்னை மறைத்து பாதுகாத்துக் கொள்ளும், இது மூன்று அறிமுக புள்ளிகள் மூலம் அணுகலை அனுமதிப்பதன் மூலம் மூன்று-ஆப் டோர் சுற்று மூலம் இணைக்கும்.

source: The _identity private key_ used here is the private part of the **public key that is encoded in the Onion Service address**.
ta: இங்கே பயன்படுத்தப்படும் _identity தனிப்பட்ட key_ வெங்காய பணி முகவரியில் குறியிடப்பட்ட ** பொது விசையின் தனிப்பட்ட பகுதியாகும் **.

source: The client asks the relay to become their rendezvous point and give it an "one-time secret" that will be used as part of the rendezvous procedure.
ta: வாடிக்கையாளர் ரிலேவை தங்கள் சந்திப்புகளாக மாற்றும்படி கேட்கிறார், மேலும் அதை "ஒரு முறை ரகசியமாக" கொடுக்கிறார், இது ரெண்டெச்வச் நடைமுறையின் ஒரு பகுதியாகப் பயன்படுத்தப்படும்.

source: The introduction point passes your details (secret string and rendezvous address) on to the Onion Service, which runs multiple verification processes to decide whether you're trustworthy or not.
ta: அறிமுகம் புள்ளி உங்கள் விவரங்களை (ரகசிய சரம் மற்றும் ரெண்டெச்வச் முகவரி) வெங்காய சேவைக்கு அனுப்புகிறது, இது நீங்கள் நம்பகமானவரா இல்லையா என்பதை தீர்மானிக்க பல சரிபார்ப்பு செயல்முறைகளை இயக்குகிறது.

source: The rendezvous point makes one final verification to match the secret strings from you and service (the latter also comes from you but has been relayed through the service).
ta: உங்களிடமிருந்தும் சேவையிலிருந்தும் ரகசிய சரங்களை பொருத்த ஒரு இறுதி சரிபார்ப்பை ரெண்டெச்வச் புள்ளி செய்கிறது (பிந்தையது உங்களிடமிருந்து வருகிறது, ஆனால் சேவையின் மூலம் ஒளிபரப்பப்பட்டது).

source: The rendezvous point simply relays (end-to-end encrypted) messages from client to service and vice versa.
ta: ரெண்டெச்வச் பாயிண்ட் வெறுமனே கிளையண்டிலிருந்து சேவைக்கு ரிலேச் (இறுதி முதல் இறுதி குறியாக்கம் செய்யப்பட்ட) செய்திகளை ரிலேச் செய்கிறது.

source: These circuits are anonymized circuits, so the server does not reveal the service location to the introduction points.
ta: இந்த சுற்றுகள் அநாமதேய சுற்றுகள், எனவே சேவையகம் பணி இருப்பிடத்தை அறிமுக புள்ளிகளுக்கு வெளிப்படுத்தாது.

source: This could happen if you are in a university campus, an office, an airport, or pretty much anywhere.
ta: நீங்கள் ஒரு பல்கலைக்கழக வளாகம், அலுவலகம், விமான நிலையம் அல்லது எங்கும் இருந்தால் இது நிகழலாம்.

source: This is like getting strong SSL/HTTPS for free.
ta: இது வலுவான SSL/HTTP களை இலவசமாகப் பெறுவது போன்றது.

source: This looks weird and random because it's the _identity public key_ of the Onion Service.
ta: இது வித்தியாசமாகவும் சீரற்றதாகவும் தோன்றுகிறது, ஏனெனில் இது வெங்காய சேவையின் _identity பொது விசை_.

source: This provides _location hiding_ to this connection.
ta: இது இந்த இணைப்பிற்கு _ லோகேசன் மறைத்தல்_ ஐ வழங்குகிறது.

source: This provides the _end-to-end authentication_ security property, since we are now sure that this descriptor could only be produced by that Onion Service and no one else.
ta: இது _END-TO-END அங்கீகாரம்_ பாதுகாப்பு சொத்தை வழங்குகிறது, ஏனெனில் இந்த விவரிப்பாளரை அந்த வெங்காய சேவையால் மட்டுமே தயாரிக்க முடியும் என்பதையும், வேறு யாரும் இல்லை என்பதையும் நாங்கள் இப்போது உறுதியாக நம்புகிறோம்.

source: This was just a high-level overview of the Tor Onion Services protocol.
ta: இது டோர் வெங்காய சேவைகள் நெறிமுறையின் உயர் மட்ட கண்ணோட்டமாக இருந்தது.

source: Usually, people connect to an IP address and are done, but how can you connect to something that does not have an IP address?
ta: வழக்கமாக, மக்கள் ஒரு ஐபி முகவரியுடன் இணைகிறார்கள், ஆனால் ஐபி முகவரி இல்லாத ஒன்றை நீங்கள் எவ்வாறு இணைக்க முடியும்?

source: Usually, reaching a website does not mean that a man-in-the-middle did not reroute to some other location (e.g. DNS attacks).
ta: வழக்கமாக, ஒரு வலைத்தளத்தை அடைவது என்பது ஒரு மனிதனின் நடுத்தரத்தை வேறு ஏதேனும் ஒரு இடத்திற்கு மாற்றவில்லை என்று அர்த்தமல்ல (எ.கா. டிஎன்எச் தாக்குதல்கள்).

source: When a user visits a particular onion, they know that the content they are seeing can only come from that particular onion.
ta: ஒரு பயனர் ஒரு குறிப்பிட்ட வெங்காயத்தைப் பார்வையிடும்போது, அவர்கள் பார்க்கும் உள்ளடக்கம் அந்த குறிப்பிட்ட வெங்காயத்திலிருந்து மட்டுமே வர முடியும் என்பதை அவர்கள் அறிவார்கள்.

source: When the client receives the signed descriptor, they verify the signature of the descriptor using the public key that is encoded in the onion address.
ta: வாடிக்கையாளர் கையொப்பமிடப்பட்ட விவரிப்பாளரைப் பெறும்போது, வெங்காய முகவரியில் குறியிடப்பட்ட பொது விசையைப் பயன்படுத்தி விளக்கத்தின் கையொப்பத்தை அவர்கள் சரிபார்க்கின்றனர்.

source: You find the onion address for the newspaper's SecureDrop from a public website or friend.
ta: ஒரு பொது வலைத்தளம் அல்லது நண்பரிடமிருந்து செய்தித்தாளின் பாதுகாப்பான ராப்பிற்கான வெங்காய முகவரியைக் காணலாம்.

source: Learn how Onion Services work.
ta: வெங்காய சேவைகள் எவ்வாறு செயல்படுகின்றன என்பதை அறிக.

source: How do Onion Services work?
ta: வெங்காய சேவைகள் எவ்வாறு செயல்படுகின்றன?

source: ## (Optional) Step 5: Running multiple Onion Services
ta: ## (விரும்பினால்) படி 5: பல வெங்காய சேவைகளை இயக்குதல்

source: ## Step 0: Get a working Tor
ta: ## படி 0: வேலை செய்யும் டோர் கிடைக்கும்

source: ## Step 1: Get a web server working
ta: ## படி 1: வலை சேவையகத்தைப் பெறுங்கள்

source: ## Step 2: Configure your Tor Onion Service
ta: ## படி 2: உங்கள் டோர் வெங்காய சேவையை உள்ளமைக்கவும்
