Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: How do I make my University / ISP / etc happy with my exit node?
ta: எனது வெளியேறும் முனையில் எனது பல்கலைக்கழகம் / ஐஎச்பி / போன்றவற்றை எவ்வாறு மகிழ்ச்சியடையச் செய்வது?

source: Tor Relay Universities
ta: டோர் ரிலே பல்கலைக்கழகங்கள்

source: * faster (and therefore more usable)
ta: * வேகமாக (எனவே மிகவும் பயன்படுத்தக்கூடியது)

source: * more robust against attacks
ta: * தாக்குதல்களுக்கு எதிராக மிகவும் வலுவானது

source: * more stable in case of outages
ta: * செயலிழப்புகளில் மிகவும் நிலையானது

source: * safer for its users (spying on more relays is harder than on a few)
ta: * அதன் பயனர்களுக்கு பாதுகாப்பானது (அதிக ரிலேக்களில் உளவு பார்ப்பது ஒரு சிலவற்றை விட கடினமானது)

source: By running a Tor relay you can help make the Tor network:
ta: டோர் ரிலேவை இயக்குவதன் மூலம் நீங்கள் TOR நெட்வொர்க்கை உருவாக்க உதவலாம்:

source: Running a relay requires technical skill and commitment, which is why we've created a wealth of resources to help our relay operators.
ta: ரிலேவை இயக்க தொழில்நுட்ப திறமை மற்றும் அர்ப்பணிப்பு தேவைப்படுகிறது, அதனால்தான் எங்கள் ரிலே ஆபரேட்டர்களுக்கு உதவ ஒரு வளங்களின் செல்வத்தை உருவாக்கியுள்ளோம்.

source: The Tor network relies on volunteers to donate bandwidth.
ta: டோர் பிணையம் அலைவரிசையை நன்கொடையாக தன்னார்வலர்களை நம்பியுள்ளது.

source: The current Tor network is quite small compared to the number of people who need to use Tor, which means we need more dedicated volunteers like you to run relays.
ta: டோர் பயன்படுத்த வேண்டிய நபர்களின் எண்ணிக்கையுடன் ஒப்பிடும்போது தற்போதைய டோர் பிணையம் மிகவும் சிறியது, அதாவது ரிலேக்களை இயக்க உங்களைப் போன்ற அர்ப்பணிப்பு தன்னார்வலர்கள் எங்களுக்கு தேவை.

source: The more people who run relays, the better the Tor network will be.
ta: ரிலேக்களை இயக்கும் அதிகமானவர்கள், டோர் பிணையம் சிறப்பாக இருக்கும்.

source: Grow the Tor network
ta: டோர் நெட்வொர்க்கை வளர்க்கவும்

source: Relays are the backbone of the Tor network. Help make Tor stronger and faster by running a relay today.
ta: ரிலேக்கள் TOR நெட்வொர்க்கின் முதுகெலும்பாகும். இன்று ரிலேவை இயக்குவதன் மூலம் டோவை வலுவாகவும் வேகமாகவும் செய்ய உதவுங்கள்.

source: Relay Operations
ta: ரிலே செயல்பாடுகள்

source: If you run into problems while setting up your relay, please refer to the [FAQs page](https://support.torproject.org/relay-operators) in the Support Portal.
ta: உங்கள் ரிலேவை அமைக்கும் போது நீங்கள் சிக்கல்களில் சிக்கினால், உதவி போர்ட்டலில் [கேள்விகள் பக்கம்] (https://support.torproject.org/relay-operators) ஐப் பார்க்கவும்.

source: The list is a great resource for asking (and answering) questions, and for getting to know other relay operators. Make sure to check out the archives!
ta: கேள்விகளைக் கேட்பதற்கும் (பதிலளிப்பதற்கும்) மற்றும் பிற ரிலே ஆபரேட்டர்களைப் பற்றி அறிந்து கொள்வதற்கும் இந்த பட்டியல் ஒரு சிறந்த ஆதாரமாகும். காப்பகங்களைப் பார்க்கவும்!

source: You can also ask your questions on the public [tor-relays mailing list](https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-relays) and the [Relay Operator](https://forum.torproject.net/c/support/relay-operator/17) sub-category on the Tor Forum.
ta: உங்கள் கேள்விகளை பொது [TOR-RELAYS அஞ்சல் பட்டியல்] (https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-relays) மற்றும் [ரிலே ஆபரேட்டர்] (https://forum.torproject.net/c/support/relay-cotatorator/17.

source: You can also get help by joining the IRC channel #tor-relays in the network [irc.oftc.net](https://support.torproject.org/get-in-touch/#irc-help).
ta: நெட்வொர்க்கில் [irc.oftc.net] (https://support.torproject.org/get-ing-touch/#irc-help) இல் ஐ.ஆர்.சி சேனல் #TOR-RELAYS இல் சேருவதன் மூலமும் நீங்கள் உதவியைப் பெறலாம்.

source: How to get help if you run into issues
ta: நீங்கள் சிக்கல்களில் சிக்கினால் உதவி பெறுவது எப்படி

source: Getting help
ta: உதவி பெறுதல்

source: As a global community-driven project, it is imperative to establish transparent and effective governance mechanisms to ensure the integrity, security, and reliability of the network.
ta: உலகளாவிய சமூகத்தால் இயக்கப்படும் திட்டமாக, நெட்வொர்க்கின் ஒருமைப்பாடு, பாதுகாப்பு மற்றும் நம்பகத்தன்மையை உறுதிப்படுத்த வெளிப்படையான மற்றும் பயனுள்ள நிர்வாக வழிமுறைகளை நிறுவுவது கட்டாயமாகும்.

source: By transparently documenting these processes, Tor aims to foster a community-driven approach to network security, enabling collaboration among developers, operators, and users.
ta: இந்த செயல்முறைகளை வெளிப்படையாக ஆவணப்படுத்துவதன் மூலம், டோர் பிணையம் பாதுகாப்பிற்கான சமூகத்தால் இயக்கப்படும் அணுகுமுறையை வளர்ப்பதை நோக்கமாகக் கொண்டுள்ளது, உருவாக்குபவர்கள், ஆபரேட்டர்கள் மற்றும் பயனர்களிடையே ஒத்துழைப்பை செயல்படுத்துகிறது.

source: Effective governance of relays is crucial for upholding the trust of users and ensuring the continued robustness of the Tor network.
ta: பயனர்களின் நம்பிக்கையை நிலைநிறுத்துவதற்கும், டோர் நெட்வொர்க்கின் தொடர்ச்சியான வலிமையை உறுதி செய்வதற்கும் ரிலேக்களின் பயனுள்ள ஆளுகை முக்கியமானது.

source: The Tor network operates on principles of openness, inclusivity, and decentralization.
ta: டோர் பிணையம் திறந்த தன்மை, உள்ளடக்கம் மற்றும் பரவலாக்கம் ஆகியவற்றின் கொள்கைகளில் இயங்குகிறது.

source: This section provides insight into the processes, policies, and structures that govern the operation and use of Tor relays.
ta: TOR ரிலேக்களின் செயல்பாடு மற்றும் பயன்பாட்டை நிர்வகிக்கும் செயல்முறைகள், கொள்கைகள் மற்றும் கட்டமைப்புகள் பற்றிய நுண்ணறிவை இந்த பிரிவு வழங்குகிறது.

source: Governance
ta: நிர்வாகம்

source: The processes and policies that govern relays on the Tor network.
ta: TOR நெட்வொர்க்கில் ரிலேக்களை நிர்வகிக்கும் செயல்முறைகள் மற்றும் கொள்கைகள்.

source: Having [processes to handle bad relays](https://gitlab.torproject.org/tpo/network-health/team/-/wikis/Bad-relay-work) in open networks like the Tor network is crucial to maintaining user privacy and security.
ta: TOR பிணையம் போன்ற திறந்த நெட்வொர்க்குகளில் [மோசமான ரிலேக்களைக் கையாள செயல்முறைகள்](https://gitlab.torproject.org/tpo/network-health/team/-/wikis/Bad-relay-work) பயனர் தனியுரிமை மற்றும் பாதுகாப்பைப் பராமரிக்க முக்கியமானது.

source: Malicious actors may attempt to join the network to attack Tor users.
ta: தீங்கிழைக்கும் நடிகர்கள் பயனர்களைத் தாக்க நெட்வொர்க்கில் சேர முயற்சிக்கலாம்.

source: The following resources are available to help users of the Tor network understand how we handle bad relay work.
ta: மோசமான ரிலே வேலைகளை நாங்கள் எவ்வாறு கையாளுகிறோம் என்பதைப் புரிந்துகொள்ள TOR நெட்வொர்க்கின் பயனர்கள் புரிந்துகொள்ள பின்வரும் ஆதாரங்கள் கிடைக்கின்றன.

source: They collaborate with Tor [Directory Authorities](/relay/governance/policies-and-proposals/directory-authority) to take action against identified bad relays.
ta: அடையாளம் காணப்பட்ட மோசமான ரிலேக்களுக்கு எதிராக நடவடிக்கை எடுக்க அவர்கள் டோர் [அடைவு அதிகாரிகள்] (/ரிலே/ஆளுகை/கொள்கைகள் மற்றும் ஆதரவுகள்/அடைவு-அங்கீகாரம்) உடன் ஒத்துழைக்கிறார்கள்.

source: To counter these threats, the Network Health team within the Tor Project actively detects and prevents such malicious efforts.
ta: இந்த அச்சுறுத்தல்களை எதிர்கொள்ள, TOR திட்டத்திற்குள் உள்ள பிணையம் சுகாதார குழு இத்தகைய தீங்கிழைக்கும் முயற்சிகளை தீவிரமாக கண்டறிந்து தடுக்கிறது.

source: While we strive for transparency at the Tor Project, hunting bad relays is one of the few areas where we are in [need to find a balance between secrecy and openness](https://lists.torproject.org/pipermail/tor-talk/2014-July/034219.html).
ta: TOR திட்டத்தில் வெளிப்படைத்தன்மைக்காக நாங்கள் பாடுபடுகையில், மோசமான ரிலேசை வேட்டையாடுவது நாம் [ரகசியத்திற்கும் திறந்த தன்மைக்கும் இடையில் ஒரு சமநிலையைக் கண்டுபிடிக்க வேண்டும்] (https://lists.torproject.org/pipermail/tor-stalk/2014- சூலை/034219.html).

source: Handling Bad Relays
ta: மோசமான ரிலேக்களைக் கையாளுதல்

source: > You can view the [rejected fingerprints for 2021 - 2024](https://gitlab.torproject.org/tpo/network-health/team/-/wikis/Rejected-fingerprints-found-in-attacks).
ta: > நீங்கள் [நிராகரிக்கப்பட்ட கைரேகைகளை 2021-2024](https://gitlab.torproject.org/tpo/network-health/team/-/wikis/Rejected-fingerprints-found-in-attacks) ஐக் காணலாம்).

source: However, occasional delays may occur, particularly in cases of ongoing attacks or other rare circumstances.
ta: இருப்பினும், அவ்வப்போது தாமதங்கள் ஏற்படலாம், குறிப்பாக தொடர்ச்சியான தாக்குதல்கள் அல்லது பிற அரிய சூழ்நிலைகளில்.

source: In April 2021, we started publishing the list of rejected fingerprints. Nevertheless, volunteers are allowed to explore historical data and document rejected fingerprints from the past if desired.
ta: ஏப்ரல் 2021 இல், நிராகரிக்கப்பட்ட கைரேகைகளின் பட்டியலை வெளியிடத் தொடங்கினோம். ஆயினும்கூட, தன்னார்வலர்கள் வரலாற்று தரவுகளை ஆராய அனுமதிக்கப்படுகிறார்கள், மேலும் ஆவணங்களை நிராகரித்த கைரேகைகள் கடந்த காலத்திலிருந்து கடந்த காலத்திலிருந்து.

source: The documentation of these fingerprints serves as a valuable resource for understanding and mitigating attacks on the Tor network, fostering a safer and more secure environment for all users.
ta: இந்த கைரேகைகளின் ஆவணங்கள் TOR நெட்வொர்க்கில் தாக்குதல்களைப் புரிந்துகொள்வதற்கும் தணிப்பதற்கும் ஒரு மதிப்புமிக்க வளமாக செயல்படுகின்றன, இது அனைத்து பயனர்களுக்கும் பாதுகாப்பான மற்றும் பாதுகாப்பான சூழலை வளர்க்கும்.

source: These delays are necessary to prevent attackers from gaining insights into our methods of detecting malicious relays.
ta: தீங்கிழைக்கும் ரிலேக்களைக் கண்டறிவதற்கான எங்கள் முறைகள் குறித்து தாக்குதல் நடத்தியவர்கள் நுண்ணறிவுகளைப் பெறுவதைத் தடுக்க இந்த தாமதங்கள் தேவை.

source: We publish all rejected fingerprints associated with attacks on a monthly basis, typically for the preceding month.
ta: தாக்குதல்களுடன் தொடர்புடைய அனைத்து நிராகரிக்கப்பட்ட கைரேகைகளையும் மாதாந்திர அடிப்படையில் வெளியிடுகிறோம், பொதுவாக முந்தைய மாதத்திற்கு.

source: Rejected Fingerprints
ta: நிராகரிக்கப்பட்ட கைரேகைகள்

source: Corner cases may arise where the intention behind a relay's behavior is unclear.
ta: ரிலேவின் நடத்தைக்குப் பின்னால் உள்ள நோக்கம் தெளிவாகத் தெரியாத இடத்தில் மூலையில் வழக்குகள் எழக்கூடும்.

source: For more details on how we address these issues, you can reference our [criteria for rejecting bad relays](https://gitlab.torproject.org/tpo/network-health/team/-/wikis/Criteria-for-rejecting-bad-relays) guide.
ta: இந்த சிக்கல்களை நாங்கள் எவ்வாறு எதிர்கொள்கிறோம் என்பது பற்றிய கூடுதல் விவரங்களுக்கு, நீங்கள் [மோசமான ரிலேக்களை நிராகரிப்பதற்கான அளவுகோல்களை] (https://gitlab.torproject.org/tpo/network-health/team/-/wikis/criteria-for-rejecting-bad-relays) வழிகாட்டியைக் குறிப்பிடலாம்.

source: However, there are instances where relays may be misconfigured or actively harmful to users.
ta: இருப்பினும், ரிலேக்கள் தவறாக கட்டமைக்கப்படலாம் அல்லது பயனர்களுக்கு தீவிரமாக தீங்கு விளைவிக்கும் நிகழ்வுகள் உள்ளன.

source: If direct communication isn't possible, the relay may be labeled as a "BadExit," indicating that it should no longer handle exit traffic while still remaining within the network.
ta: நேரடி தொடர்பு சாத்தியமில்லை என்றால், ரிலே ஒரு "பேடெக்சிட்" என்று பெயரிடப்படலாம், இது நெட்வொர்க்கில் எஞ்சியிருக்கும்போது வெளியேறும் போக்குவரத்தை இனி கையாளக்கூடாது என்பதைக் குறிக்கிறது.

source: In cases of misconfigured exit relays, which can cause usability issues for users, efforts are made to contact the operator to rectify the problem.
ta: பயனர்களுக்கான பயன்பாட்டு சிக்கல்களை ஏற்படுத்தும் தவறாக கட்டமைக்கப்பட்ட வெளியேறும் ரிலேக்கள் சந்தர்ப்பங்களில், சிக்கலை சரிசெய்ய ஆபரேட்டரை தொடர்பு கொள்ள முயற்சிகள் மேற்கொள்ளப்படுகின்றன.

source: In such cases, the relays are swiftly removed from the network to protect users.
ta: இதுபோன்ற சந்தர்ப்பங்களில், பயனர்களைப் பாதுகாக்க ரிலேக்கள் நெட்வொர்க்கிலிருந்து விரைவாக அகற்றப்படுகின்றன.

source: In such instances, communication with the operator is essential to determine the appropriate course of action.
ta: இதுபோன்ற நிகழ்வுகளில், பொருத்தமான செயலின் போக்கைத் தீர்மானிக்க ஆபரேட்டருடன் தொடர்பு தேவை.

source: Relays are considered malicious if they engage in behaviors such as DNS poisoning, SSL stripping, or sniffing user traffic.
ta: டி.என்.எச் நஞ்சு, எச்.எச்.எல் அகற்றுதல் அல்லது பயனர் போக்குவரத்தை முனகுவது போன்ற நடத்தைகளில் ஈடுபட்டால் ரிலேக்கள் தீங்கிழைக்கும் என்று கருதப்படுகிறது.

source: The Network Health team is responsible for identifying and addressing these issues.
ta: இந்த சிக்கல்களைக் கண்டறிந்து உரையாற்றுவதற்கு பிணையம் சுகாதார குழு பொறுப்பாகும்.

source: The Tor network relies on the contributions of volunteer relay operators to maintain its integrity and security.
ta: டோர் பிணையம் அதன் ஒருமைப்பாட்டையும் பாதுகாப்பையும் பராமரிக்க தன்னார்வ ரிலே ஆபரேட்டர்களின் பங்களிப்புகளை நம்பியுள்ளது.

source: This collaborative effort helps maintain the integrity and security of the Tor network for all users.
ta: இந்த கூட்டு முயற்சி அனைத்து பயனர்களுக்கும் TOR நெட்வொர்க்கின் ஒருமைப்பாட்டையும் பாதுகாப்பையும் பராமரிக்க உதவுகிறது.

source: Unlike misconfigured relays, malicious relays are not contacted before removal.
ta: தவறாக கட்டமைக்கப்பட்ட ரிலேக்களைப் போலல்லாமல், அகற்றப்படுவதற்கு முன்பு தீங்கிழைக்கும் ரிலேக்கள் தொடர்பு கொள்ளப்படவில்லை.

source: We encourage users to [report bad relays](https://gitlab.torproject.org/tpo/network-health/team/-/wikis/Criteria-for-rejecting-bad-relays#reporting-bad-relays) to the Bad Relays mailing list, providing detailed information to aid in investigation and resolution.
ta: [மோசமான ரிலேக்களைப் புகாரளிக்க](https://gitlab.torproject.org/tpo/network-health/team/-/wikis/Criteria-for-rejecting-bad-relays#reporting-bad-relays) பேட் ரிலேச் அஞ்சல் பட்டியலில், விசாரணைக்கு உதவுவதற்கு விரிவான தகவல்களை வழங்குவதில் பயனர்களை நாங்கள் ஊக்குவிக்கிறோம்.

source: Criteria for Rejecting Bad Relays
ta: மோசமான ரிலேக்களை நிராகரிப்பதற்கான அளவுகோல்கள்

source: By following these policies and actively participating in the proposal process, relay operators can contribute to the security, reliability, and integrity of the Tor network.
ta: இந்த கொள்கைகளைப் பின்பற்றுவதன் மூலமும், முன்மொழிவு செயல்பாட்டில் தீவிரமாக பங்கேற்பதன் மூலமும், ரிலே ஆபரேட்டர்கள் TOR நெட்வொர்க்கின் பாதுகாப்பு, நம்பகத்தன்மை மற்றும் ஒருமைப்பாட்டிற்கு பங்களிக்க முடியும்.

source: Policies refer to the rules, guidelines, and best practices that govern the operation of Tor relays and relay operators.
ta: கொள்கைகள் டோர் ரிலேக்கள் மற்றும் ரிலே ஆபரேட்டர்களின் செயல்பாட்டை நிர்வகிக்கும் விதிகள், வழிகாட்டுதல்கள் மற்றும் சிறந்த நடைமுறைகளைக் குறிக்கின்றன.

source: These policies cover various aspects of relay operation, including security, performance, privacy, Tor's network health, and community.
ta: இந்த கொள்கைகள் ரிலே செயல்பாட்டின் பல்வேறு அம்சங்களை உள்ளடக்கியது, இதில் பாதுகாப்பு, செயல்திறன், தனியுரிமை, டோரின் பிணையம் உடல்நலம் மற்றும் சமூகம் ஆகியவை அடங்கும்.

source: Policies and Proposals
ta: கொள்கைகள் மற்றும் திட்டங்கள்

source: # Directory Authorities
ta: # அடைவு அதிகாரிகள்

source: > [Read our directory authority policy](https://gitlab.torproject.org/tpo/core/torspec/-/blob/HEAD/attic/authority-policy.txt).
ta: > [எங்கள் அடைவு அதிகாரக் கொள்கையைப் படியுங்கள்] (https://gitlab.torproject.org/tpo/core/torspec/-/blob/head/attic/authority-policy.txt).

source: Directory Authorities are important components within the Tor network that serve as trusted entities responsible for managing and maintaining the list of Tor relays.
ta: TOR நெட்வொர்க்கில் அடைவு அதிகாரிகள் முக்கியமான கூறுகள், அவை TOR ரிலேக்களின் பட்டியலை நிர்வகிப்பதற்கும் பராமரிப்பதற்கும் பொறுப்பான நம்பகமான நிறுவனங்களாக செயல்படுகின்றன.

source: These authorities are operated by trusted organizations or individuals with a strong commitment to the principles of privacy, security, and network neutrality.
ta: இந்த அதிகாரிகள் தனியுரிமை, பாதுகாப்பு மற்றும் பிணையம் நடுநிலைமை ஆகிய கொள்கைகளுக்கு வலுவான அர்ப்பணிப்புடன் நம்பகமான நிறுவனங்கள் அல்லது தனிநபர்களால் இயக்கப்படுகிறார்கள்.

source: They are a set of specialized servers within the Tor network that collectively generate and distribute a signed document (known as the consensus) containing information about all known Tor relays.
ta: அவை TOR நெட்வொர்க்கில் உள்ள சிறப்பு சேவையகங்களின் தொகுப்பாகும், அவை கையொப்பமிடப்பட்ட ஆவணத்தை (ஒருமித்த கருத்து என அழைக்கப்படுகின்றன) கூட்டாக உருவாக்கி விநியோகிக்கின்றன.

source: Directory Authorities
ta: அடைவு அதிகாரிகள்

source: A [past proposal](https://lists.torproject.org/pipermail/tor-relays/2020-July/018643.html) suggested requiring physical addresses for verification from relay operators.
ta: ரிலே ஆபரேட்டர்களிடமிருந்து சரிபார்க்க உடல் முகவரிகள் தேவைப்படும் ஒரு [கடந்தகால முன்மொழிவு] (https://lists.torproject.org/pipermail/tor-relays/2020-july/018643.html) பரிந்துரைத்தது.

source: Additionally, we evaluate proposals based on how well they meet our [established criteria](https://community.torproject.org/policies/relays/evaluation-criteria-for-solution-to-combat-malicious-relays/) for supporting the relay operator community and achieving Tor's overall goals.
ta: கூடுதலாக, அவர்கள் எங்கள் [நிறுவப்பட்ட அளவுகோல்களை] (https://community.torproject.org/policies/relays/evaluation-foritea-for-ounel-for-ound-for-for-for-for-malical-felays/) ரிலே ஆபரேட்டர் சமூகத்தை ஆதரிப்பதற்கும், ஒட்டுமொத்த இலக்குகளை அடைவதற்கும் அவர்களின் திட்டங்களை மதிப்பீடு செய்கிறோம்.

source: But, on the other hand, a small increase in the entry requirements for running relays could also make the network more secure by keeping out bad actors.
ta: ஆனால், மறுபுறம், ரிலேக்களை இயக்குவதற்கான நுழைவுத் தேவைகளில் ஒரு சிறிய அதிகரிப்பு மோசமான நடிகர்களை வெளியேற்றுவதன் மூலம் பிணையத்தை மிகவும் பாதுகாப்பாக மாற்றக்கூடும்.

source: By being open about our decision-making and actions, we aim to foster trust with the Tor community so they can rely on us to safeguard their privacy and security.
ta: எங்கள் முடிவெடுக்கும் மற்றும் செயல்களைப் பற்றி வெளிப்படையாக இருப்பதன் மூலம், நாங்கள் டோர் சமூகத்துடன் நம்பிக்கையை வளர்ப்பதை நோக்கமாகக் கொண்டுள்ளோம், இதனால் அவர்கள் தனியுரிமை மற்றும் பாதுகாப்பைப் பாதுகாக்க அவர்கள் எங்களை நம்பலாம்.

source: By making the policy public, the Tor community can hold us accountable for its enforcement.
ta: கொள்கையை பகிரங்கப்படுத்துவதன் மூலம், டோர் சமூகம் அதன் அமலாக்கத்திற்கு எங்களை பொறுப்பேற்க முடியும்.

source: Every proposal is carefully reviewed to check that it aligns with all our community values, as outlined in Tor's [Code of Conduct](https://community.torproject.org/policies/code_of_conduct/) and [Social Contract](https://community.torproject.org/policies/social_contract/).
ta: டோரின் [நடத்தை விதிமுறை] (https://community.torproject.org/policies/code_of_conduct/) மற்றும் [சமூக ஒப்பந்தம்] (https://community.torproject.

source: For example, our [criteria for rejecting bad relays](https://gitlab.torproject.org/tpo/network-health/team/-/wikis/Criteria-for-rejecting-bad-relays) policy defines what qualifies as a malicious relay, and details the steps we take to identify and remove them.
ta: எடுத்துக்காட்டாக, எங்கள் [மோசமான ரிலேக்களை நிராகரிப்பதற்கான அளவுகோல்கள்] (https://gitlab.torproject.org/tpo/network-health/team/-/wikis/criteria-for-for- bad-relays) கொள்கை ஒரு தீங்கு விளைவிக்கும் ரிலே என வரையறுக்கிறது, மேலும் நாம் அடையாளம் காண்பதற்கான படிகளை விவரிக்கிறது.

source: For example, we want to keep the barrier for running relays low and build a transparent network.
ta: எடுத்துக்காட்டாக, ரிலேக்களை இயக்குவதற்கான தடையை நாங்கள் குறைவாக வைத்திருக்க விரும்புகிறோம் மற்றும் வெளிப்படையான நெட்வொர்க்கை உருவாக்க விரும்புகிறோம்.

source: For instance, while a proposal might be technically sound, our evaluation criteria go deeper to assess its practicality for relay operators and potential impact on the network's overall health ("will-it-work").
ta: உதாரணமாக, ஒரு திட்டம் தொழில்நுட்ப ரீதியாக ஒலியாக இருக்கும்போது, ரிலே ஆபரேட்டர்களுக்கான அதன் நடைமுறை மற்றும் நெட்வொர்க்கின் ஒட்டுமொத்த ஆரோக்கியத்தில் ("வில்-ஐடி-வேலை") சாத்தியமான தாக்கத்தை மதிப்பிடுவதற்கு எங்கள் மதிப்பீட்டு அளவுகோல்கள் ஆழமாக செல்கின்றன.

source: If you’re interested in [submitting a proposal](/relay/governance/policies-and-proposals/proposals), please review [our policies](https://community.torproject.org/policies/) to understand the principles that govern relays and the relay operator community.
ta: ரிலேக்கள் மற்றும் ரிலே ஆபரேட்டர் சமூகத்தை நிர்வகிக்கும் கொள்கைகளைப் புரிந்துகொள்ள [எங்கள் கொள்கைகளை] (எங்கள் கொள்கைகளை] (https://community.torproject.org/policies/) மதிப்பாய்வு செய்யவும் [ஒரு முன்மொழிவை சமர்ப்பித்தல்] (/ரிலே/ஆளுகை/கொள்கைகள் மற்றும் திட்டங்கள்/திட்டங்கள்) இல் நீங்கள் ஆர்வமாக இருந்தால்.

source: Keeping user information private and the network secure can be tricky when we also want to be open and accountable, but our evaluation criteria check that we’re on the right path.
ta: நாங்கள் திறந்த மற்றும் பொறுப்புணர்வுடன் இருக்க விரும்பும் போது பயனர் தகவல்களை தனிப்பட்டதாகவும், பிணையத்தை பாதுகாப்பாகவும் வைத்திருப்பது தந்திரமானதாக இருக்கும், ஆனால் எங்கள் மதிப்பீட்டு அளவுகோல்கள் நாங்கள் சரியான பாதையில் செல்கிறோம் என்பதை சரிபார்க்கவும்.

source: On top of that, we establish clear and publicly accessible rules and policies to govern specific situations and behaviours. These rules and policies outline what a violation is, and the corresponding actions we take.
ta: அதற்கு மேல், குறிப்பிட்ட சூழ்நிலைகள் மற்றும் நடத்தைகளை நிர்வகிக்க தெளிவான மற்றும் பகிரங்கமாக அணுகக்கூடிய விதிகள் மற்றும் கொள்கைகளை நாங்கள் நிறுவுகிறோம். இந்த விதிகள் மற்றும் கொள்கைகள் ஒரு மீறல் என்றால் என்ன, மற்றும் நாம் எடுக்கும் தொடர்புடைய நடவடிக்கைகள்.

source: One key way we’re delivering this transparency is by making all proposed network health enhancements public knowledge, easy to find, and clear to understand.
ta: இந்த வெளிப்படைத்தன்மையை நாங்கள் வழங்கும் ஒரு முக்கிய வழி, அனைத்து முன்மொழியப்பட்ட பிணையம் சுகாதார மேம்பாடுகளையும் பொது அறிவை உருவாக்குவதன் மூலம், கண்டுபிடிக்க எளிதானது, புரிந்துகொள்ள தெளிவாக உள்ளது.

source: Rather, following our evaluation criteria, we explored [alternative verification methods](https://lists.torproject.org/pipermail/tor-relays/2023-October/021358.html) that could be less intrusive for the operator community.
ta: மாறாக, எங்கள் மதிப்பீட்டு அளவுகோல்களைப் பின்பற்றி, [மாற்று சரிபார்ப்பு முறைகள்] (https://lists.torproject.org/pipermail/tor-relays/2023-october/021358.html) ஆபரேட்டர் சமூகத்திற்கு குறைவான ஊடுருவக்கூடியதாக ஆராய்ந்தோம்.

source: That's why we created the evaluation criteria; to carefully examine these security concerns without overloading relay operators.
ta: அதனால்தான் மதிப்பீட்டு அளவுகோல்களை உருவாக்கினோம்; ரிலே ஆபரேட்டர்கள் அதிக சுமை இல்லாமல் இந்த பாதுகாப்பு கவலைகளை கவனமாக ஆராய.

source: The [evaluation criteria for proposals](https://community.torproject.org/policies/relays/evaluation-criteria-for-solution-to-combat-malicious-relays/) are built on some important goals: keeping it easy to set up relays, protecting the network from bad actors, respecting human rights, and following Tor's values of transparency and accountability.
ta: [முன்மொழிவுகளுக்கான மதிப்பீட்டு அளவுகோல்கள்] (https://community.torproject.org/policies/relays/evaluation-forution-for- for- compat-maliacious-relays/) சில முக்கியமான குறிக்கோள்களின் அடிப்படையில் கட்டமைக்கப்பட்டுள்ளன: ரிலேசை எளிதாக அமைப்பதை எளிதாக வைத்திருத்தல், மோசமான நடிப்புகளின் வலிமையை பாதுகாக்கும், மற்றும் பின்வருபவை.

source: The criteria for reviewing proposals go beyond looking at technical feasibility, because we prioritize will-it-work over can-it-work.
ta: திட்டங்களை மறுஆய்வு செய்வதற்கான அளவுகோல்கள் தொழில்நுட்ப சாத்தியக்கூறுகளைப் பார்ப்பதைத் தாண்டி செல்கின்றன, ஏனென்றால் கேன்-இட்-வேலைக்கு மேல் பணிக்கு முன்னுரிமை அளிக்கிறோம்.

source: These criteria help us keep the Tor network inclusive, safe, and principled.
ta: இந்த அளவுகோல்கள் TOR நெட்வொர்க்கை உள்ளடக்கிய, பாதுகாப்பான மற்றும் கொள்கை ரீதியானதாக வைத்திருக்க எங்களுக்கு உதவுகின்றன.

source: These criteria serve as a rulebook for any improvements to the relays and processes for people who run them.
ta: இந்த அளவுகோல்கள் அவற்றை இயக்கும் நபர்களுக்கான ரிலேக்கள் மற்றும் செயல்முறைகளில் ஏதேனும் மேம்பாடுகளுக்கான விதி புத்தகமாக செயல்படுகின்றன.

source: This helps us make sure we don't overburden operators or introduce unintended privacy risks.
ta: நாங்கள் ஆபரேட்டர்களை அதிகமாகவோ அல்லது திட்டமிடப்படாத தனியுரிமை அபாயங்களை அறிமுகப்படுத்தவோ இல்லை என்பதை உறுதிப்படுத்த இது உதவுகிறது.
