Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: ### 7. Final Notes
ta: ### 7. இறுதி குறிப்புகள்

source: Heavily outdated versions of git can make `go install` fail, so try upgrading to a more recent git version if you're running into this problem.
ta: GIT இன் பெரிதும் காலாவதியான பதிப்புகள் `கோ நிறுவுங்கள்` தோல்வியடையச் செய்யலாம், எனவே நீங்கள் இந்த சிக்கலில் இயங்கினால் மிக அண்மைக் கால அறிவிலி பதிப்பிற்கு மேம்படுத்த முயற்சிக்கவும்.

source: How to deploy an obfs4 bridge on OpenSUSE
ta: OpenSuse இல் OBFS4 பாலத்தை எவ்வாறு பயன்படுத்துவது

source: BridgeDB uses six buckets for bridge distribution: HTTPS, Moat, Email, Telegram, Settings, and manual.
ta: பாலம் விநியோகத்திற்கு பிரிட்ச் ஆறு வாளிகளைப் பயன்படுத்துகிறது: HTTPS, அகழி, மின்னஞ்சல், தந்தி, அமைப்புகள் மற்றும் கையேடு.

source: Congrats!
ta: வாழ்த்துக்கள்!

source: Finally, there aren't many bridge users out there, so you cannot expect your bridge to be as popular as a relay.
ta: இறுதியாக, அங்கு பல பாலம் பயனர்கள் இல்லை, எனவே உங்கள் பாலம் ரிலே போல பிரபலமாக இருக்கும் என்று எதிர்பார்க்க முடியாது.

source: Finally, you can monitor your obfs4 bridge's usage on [Relay Search](https://metrics.torproject.org/rs.html#search).
ta: இறுதியாக, [ரிலே தேடல்] (https://metrics.torproject.org/rs.html#search) இல் உங்கள் OBFS4 பாலத்தின் பயன்பாட்டை கண்காணிக்கலாம்.

source: If you get to this point, it means that your obfs4 bridge is running and is being distributed by BridgeDB to censored users.
ta: நீங்கள் இந்த நிலைக்கு வந்தால், உங்கள் OBFS4 பாலம் இயங்குகிறது மற்றும் தணிக்கை செய்யப்பட்ட பயனர்களுக்கு பிரிட்ச்ட்பால் விநியோகிக்கப்படுகிறது.

source: If you want to connect to your bridge manually, you will need to know the bridge's obfs4 certificate.
ta: உங்கள் பாலத்துடன் கைமுறையாக இணைக்க விரும்பினால், பாலத்தின் OBFS4 சான்றிதழை நீங்கள் அறிந்து கொள்ள வேண்டும்.

source: Just enter your bridge's `<HASHED FINGERPRINT>` in the form and click "Search". After having set up the bridge, it takes approximately three hours for the bridge to show up in Relay Search.
ta: உங்கள் பாலத்தின் `<ஆசெட் கைரேகை>` படிவத்தில் உள்ளிட்டு "தேடல்" என்பதைக் சொடுக்கு செய்க. பாலத்தை அமைத்த பிறகு, ரிலே தேடலில் பாலம் காண்பிக்க சுமார் மூன்று மணி நேரம் ஆகும்.

source: Note that it can take several days or weeks until you see a consistent set of users, so don't get discouraged if you don't see user connections right away.
ta: நீங்கள் ஒரு நிலையான பயனர்களைக் காணும் வரை பல நாட்கள் அல்லது வாரங்கள் ஆகலாம் என்பதை நினைவில் கொள்க, எனவே பயனர் இணைப்புகளை இப்போதே காணவில்லை என்றால் சோர்வடைய வேண்டாம்.

source: Or when using Docker, use the following command to retrieve the bridge line:
ta: அல்லது டோக்கரைப் பயன்படுத்தும் போது, பாலம் வரியை மீட்டெடுக்க பின்வரும் கட்டளையைப் பயன்படுத்தவும்:

source: Paste the entire bridge line into Tor Browser:
ta: முழு பாலம் கோட்டையும் டோர் உலாவியில் ஒட்டவும்:

source: See the file `obfs4_bridgeline.txt`, which is found inside Tor Data Directory, for example, in Debian/Ubuntu `/var/lib/tor/pt_state/obfs4_bridgeline.txt` or FreeBSD `/var/db/tor/pt_state/obfs4_bridgeline.txt`.
ta: டோர் தரவு கோப்பகத்திற்குள் காணப்படும் `obfs4_bridgeline.txt` கோப்பைப் பார்க்கவும், எடுத்துக்காட்டாக, டெபியன்/உபுண்டு`/var/lib/tor/pt_state/obfs4_bridgeline.txt` அல்லது freebsd `/var/db/pt_state/ obfs4_bridgeline.txt`.

source: Some buckets are used more than others, which also affects the time until your bridge sees users.
ta: சில வாளிகள் மற்றவர்களை விட அதிகமாக பயன்படுத்தப்படுகின்றன, இது உங்கள் பாலம் பயனர்களைப் பார்க்கும் வரை நேரத்தையும் பாதிக்கிறது.

source: You can manually [change your bridge distribution method](https://support.torproject.org/relay-operators/change-bridge-distribution/).
ta: நீங்கள் கைமுறையாக [உங்கள் பாலம் விநியோக முறையை மாற்றலாம்] (https://support.torproject.org/relay-operators/change-bridge-distribution/).

source: You'll need to replace `<IP ADDRESS>`, `<PORT>`, and `<FINGERPRINT>` with the actual values, which you can find in the tor log. Make sure to use your server's identity key fingerprint for `<FINGERPRINT>`, not `<HASHED FINGERPRINT>` or the ed25519 key; and that `<PORT>` is the obfs4 port you chose - and not the OR port.
ta: டோர் பதிவில் நீங்கள் காணக்கூடிய உண்மையான மதிப்புகள் மூலம் `<Pis முகவரி>`, `<port>`, மற்றும் `<fingerprint>` ஆகியவற்றை மாற்ற வேண்டும். உங்கள் சேவையகத்தின் அடையாள விசை கைரேகை `<கைரேகை>`, `<ஆசெட் கைரேகை>` அல்லது ED25519 விசையை பயன்படுத்துவதை உறுதிசெய்க; `<port>` என்பது நீங்கள் தேர்ந்தெடுத்த OBFS4 துறைமுகம் ஆகும் - ஆனால் அல்லது துறைமுகம் அல்ல.

source: How to find your bridge in Relay Search and connect manually
ta: ரிலே தேடலில் உங்கள் பாலத்தை எவ்வாறு கண்டுபிடித்து கைமுறையாக இணைக்க வேண்டும்

source: Post-install
ta: நிறுவலுக்குப் பிறகு

source: ### 6. Monitor your logs
ta: ### 6. உங்கள் பதிவுகளை கண்காணிக்கவும்

source: * For more information on installing or building `lyrebird` from source, please refer to its [official documentation](https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/lyrebird#installation).
ta: * மூலத்திலிருந்து `லைரெபேர்ட்` ஐ நிறுவுதல் அல்லது கட்டியெழுப்புவது பற்றிய கூடுதல் தகவலுக்கு, தயவுசெய்து அதன் [அதிகாரப்பூர்வ ஆவணங்கள்] (https://gitlab.torproject.org/tpo/anti-censorhip/pluggable-transports/lyrebird#installation) ஐப் பார்க்கவும்.

source: Different from most recent distributions, Void Linux does not uses **systemd**; it uses [runit](https://man.voidlinux.org/runit.8) instead.
ta: மிக அண்மைக் கால விநியோகங்களிலிருந்து வேறுபட்டது, வெற்றிட லினக்ச் ** சிச்டம் டி ** ஐப் பயன்படுத்துவதில்லை; இது [runit] (https://man.voidlinux.org/runit.8) ஐப் பயன்படுத்துகிறது.

source: Once we can rely on an official `obfs4proxy` package provided by the Void Linux's maintainers, this is how we install it:
ta: வெற்றிட லினக்சின் பராமரிப்பாளர்களால் வழங்கப்பட்ட அதிகாரப்பூர்வ `OBFS4proxy` தொகுப்பை நாம் நம்பியவுடன், இதை நாங்கள் நிறுவுவது இதுதான்:

source: Once you enabled the service, it will automatically start. If you already started the `tor` daemon before and made changes do its configurations, you can restart it with:
ta: நீங்கள் சேவையை இயக்கியதும், அது தானாகவே தொடங்கும். நீங்கள் ஏற்கனவே `டோர்` டீமனைத் தொடங்கி மாற்றங்களைச் செய்தால் அதன் உள்ளமைவுகளைச் செய்தால், அதை மறுதொடக்கம் செய்யலாம்:

source: To enable `tor`'s service on a booted system:
ta: துவக்கப்பட்ட கணினியில் `டோர்'வின் சேவையை இயக்க:

source: To install the `tor` package on Void Linux, considering you are already on an up-to-date system:
ta: வெற்றிட லினக்சில் `டோர்` தொகுப்பை நிறுவ, நீங்கள் ஏற்கனவே புதுப்பித்த கணினியில் இருப்பதைக் கருத்தில் கொண்டு:

source: How to deploy an obfs4 bridge on Void Linux
ta: வெற்றிட லினக்சில் OBFS4 பாலத்தை எவ்வாறு பயன்படுத்துவது

source: Void Linux
ta: வெற்றிட லினக்ச்

source: ### 1. Download the Windows Expert Bundle and the Tor Browser
ta: ### 1. சாளரங்கள் வல்லுநர் மூட்டை மற்றும் டோர் உலாவியைப் பதிவிறக்கவும்

source: ### 2. Build files and relocate
ta: ### 2. கோப்புகளை உருவாக்கி இடமாற்றம் செய்யுங்கள்

source: ### 3. Create and edit your Tor config file
ta: ### 3. உங்கள் டோர் கட்டமைப்பு கோப்பை உருவாக்கி திருத்தவும்

source: ### 4. Start Tor
ta: ### 4. தொடங்கு டோர்

source: ### 5. Monitor your logs
ta: ### 5. உங்கள் பதிவுகளை கண்காணிக்கவும்

source: ### 6. Final notes
ta: ### 6. இறுதி குறிப்புகள்

source: * Note that both Tor's OR port and its obfs4 port must be reachable.
ta: * டோர் அல்லது துறைமுகம் மற்றும் அதன் OBFS4 துறைமுகம் இரண்டையும் அடைய வேண்டும் என்பதை நினைவில் கொள்க.

source: * Use a fixed obfs4 port larger than 1024, still avoiding 9001.
ta: * 1024 ஐ விட பெரிய ஒரு நிலையான OBFS4 போர்ட்டைப் பயன்படுத்தவும், இன்னும் 9001 ஐத் தவிர்க்கிறது.

source: * [Tor Browser (version depends on your computer)](https://www.torproject.org/download/languages/). Run the `.exe` and install with default settings.
ta: . `.Exe` ஐ இயக்கி இயல்புநிலை அமைப்புகளுடன் நிறுவவும்.

source: * [Windows Expert Bundle](https://www.torproject.org/download/tor/). Unzip the contents on the desktop.
ta: * [விண்டோச் வல்லுநர் மூட்டை] (https://www.torproject.org/download/tor/). டெச்க்டாப்பில் உள்ளடக்கங்களை அவிழ்த்து விடுங்கள்.

source: **Note: You should only run a Windows bridge if you can run it 24/7. If the operator is unable to guarantee that, a [Snowflake](https://snowflake.torproject.org/) is a better way to contribute resources.**
ta: ** குறிப்பு: நீங்கள் 24/7 ஐ இயக்க முடிந்தால் மட்டுமே சாளரங்கள் பாலத்தை இயக்க வேண்டும். அதற்கு ஆபரேட்டருக்கு பொறுப்பு அளிக்க முடியாவிட்டால், ஒரு [ச்னோஃப்ளேக்] (https://snowflake.torproject.org/) வளங்களை பங்களிக்க சிறந்த வழியாகும். **

source: Don't forget to change the `ORPort`, `ServerTransportListenAddr`, `ContactInfo`, `<user>`, and `Nickname` options.
ta: `Orport`,` ServerTransportListenaddr`, `ContactInfo`,` <பயனர்> `, மற்றும்` புனைப்பெயர்` விருப்பங்களை மாற்ற மறக்காதீர்கள்.

source: Double-click on the `torrc` file. When prompted *How do you want to open this file?*, select `Notepad`. Add the following:
ta: `டோர்க்` கோப்பில் இருமுறை சொடுக்கு செய்யவும். கேட்கும் போது *இந்த கோப்பை எவ்வாறு திறக்க விரும்புகிறீர்கள்? *, `நோட்பேட்` என்பதைத் தேர்ந்தெடுக்கவும். பின்வருவனவற்றைச் சேர்க்கவும்:

source: From the Tor folder on your desktop, select all `.dll`'s and `.exe`'s and cut/paste them into the `C:\Users\<user>\AppData\Roaming\tor\` folder.
ta: உங்கள் டெச்க்டாப்பில் உள்ள டோர் கோப்புறையிலிருந்து, `.dll` மற்றும்` .exe` ஆகியவற்றைத் தேர்ந்தெடுத்து அவற்றை `C: \ பயனர்கள் \ <பயனர்> \ appdata \ ரோமிங் \ tor` கோப்புறையில் வெட்டு/ஒட்டுக.

source: If your bridge is behind a firewall or NAT, make sure to open both ports.
ta: உங்கள் பாலம் ஒரு ஃபயர்வால் அல்லது NAT க்கு பின்னால் இருந்தால், இரு துறைமுகங்களையும் திறக்க உறுதிசெய்க.

source: In the `C:\Users\<user>\AppData\Roaming\tor\` folder, right-click on white space and select `New > Text Document`. Name the file `torrc`; there is no extension.
ta: `C: \ பயனர்கள் \ <பயனர்> \ appData \ ரோமிங் \ tor \` கோப்புறையில், வெள்ளை இடத்தை வலது சொடுக்கு செய்து `புதிய> உரை ஆவணம்` என்பதைத் தேர்ந்தெடுக்கவும். `டோர்க்` கோப்புக்கு பெயரிடுங்கள்; நீட்டிப்பு இல்லை.

source: Navigate to `C:\Users\<user>\Desktop\Tor Browser\Browser\TorBrowser\Tor\PluggableTransports`. Select `lyrebird.exe` and cut/paste it into the `C:\Users\<user>\AppData\Roaming\tor\` folder.
ta: `C: \ பயனர்கள் \ <பயனர்> \ டெச்க்டாப் \ டோர் உலாவி \ உலாவி \ டார்பிரோசர் \ டோர் \ பிளக்லெட்ரான்ச்போர்ட்ச்` க்கு செல்லவும். `Lyrebird.exe` ஐத் தேர்ந்தெடுத்து` C: \ பயனர்கள் \ <பயனர்> \ appdata \ ரோமிங் \ tor `கோப்புறையில் வெட்டு/ஒட்டவும்.

source: Open up the Command Prompt App. Change your directory with: `cd C:\Users\<user>\AppData\Roaming\tor\`. Type: `tor.exe -f torrc`.
ta: கட்டளை வரியில் பயன்பாட்டைத் திறக்கவும். உங்கள் கோப்பகத்தை மாற்றவும்: `குறுவட்டு சி: \ பயனர்கள் \ <பயனர்> \ appdata \ ரோமிங் \ tor`. வகை: `tor.exe -f torrc`.

source: Open up the Data folder on your desktop. Inside that Tor folder, select both `geoip` and `geoip6` and cut/paste them into the `C:\Users\<user>\AppData\Roaming\tor\` folder.
ta: உங்கள் டெச்க்டாப்பில் தரவு கோப்புறையைத் திறக்கவும். அந்த டோர் கோப்புறையின் உள்ளே, `சியோஐபி` மற்றும்` சியோஐபி 6` இரண்டையும் தேர்ந்தெடுத்து அவற்றை `சி: \ பயனர்கள் \ <பயனர்> \ ஆப் டேட்டா \ ரோமிங் \ டோர்` கோப்புறையில் வெட்டு/ஒட்டுக.

source: Open up the Tor folder on your desktop. Double click `tor.exe`. Once the command prompt reads: `[notice] Bootstrapped 100% (done): Done`, close the window. This creates the folder `C:\Users\<user>\AppData\Roaming\tor\` (where `<user>` is your user name).
ta: உங்கள் டெச்க்டாப்பில் டோர் கோப்புறையைத் திறக்கவும். `Tor.exe` இரட்டை என்பதைக் சொடுக்கு செய்க. கட்டளை வரியில் படித்தவுடன்: `[அறிவிப்பு] தொடக்கவார் 100% (முடிந்தது): முடிந்தது`, சாளரத்தை மூடு. இது `C: \ பயனர்கள் \ <பயனர்> \ appData \ ரோமிங் \ tor` (எங்கே `<பயனர்>` என்பது உங்கள் பயனர் பெயர்) கோப்புறையை உருவாக்குகிறது.

source: To confirm your bridge is running with no issues, you should see something like this in `C:\Users\<user>\AppData\Roaming\tor\notice.log`.
ta: உங்கள் பாலம் எந்தப் பிரச்சினையும் இல்லாமல் இயங்குகிறது என்பதை உறுதிப்படுத்த, இதுபோன்ற ஒன்றை `C: \ பயனர்கள் \ <பயனர்> \ appdata \ ரோமிங் \ tor \ withor.log` இல் பார்க்க வேண்டும்.

source: You can use [our reachability test](https://bridges.torproject.org/scan/) to see if your obfs4 port is reachable from the Internet.
ta: உங்கள் OBFS4 துறைமுகம் இணையத்திலிருந்து அடைய முடியுமா என்பதைப் பார்க்க நீங்கள் [எங்கள் அணுகல் சோதனை] (https://bridges.torproject.org/scan/) ஐப் பயன்படுத்தலாம்.

source: You will need to show hidden items and file name extensions. In your Explorer window, in the top-left, click on the View tab. In the Show/hide section furthest to the right, check the checkbox for Hidden items; check the checkbox for File name extensions.
ta: நீங்கள் மறைக்கப்பட்ட உருப்படிகள் மற்றும் கோப்பு பெயர் நீட்டிப்புகளைக் காட்ட வேண்டும். உங்கள் எக்ச்ப்ளோரர் சாளரத்தில், மேல்-இடது, காட்சி தாவலைக் சொடுக்கு செய்க. வலதுபுறத்தில் காட்சி/மறை பிரிவில், மறைக்கப்பட்ட உருப்படிகளுக்கான தேர்வுப்பெட்டியை சரிபார்க்கவும்; கோப்பு பெயர் நீட்டிப்புகளுக்கான தேர்வுப்பெட்டியை சரிபார்க்கவும்.

source: How to deploy an obfs4 bridge on Windows
ta: சன்னல்களில் OBFS4 பாலத்தை எவ்வாறு பயன்படுத்துவது

source: Windows
ta: சாளரங்கள்

source: # Questions you should clarify before configuring Tor
ta: # TOR ஐ கட்டமைப்பதற்கு முன் நீங்கள் தெளிவுபடுத்த வேண்டிய கேள்விகள்

source: ("ORPort" configuration: We recommend port 443 if that is not used by another daemon on your server already.
ta: ("ORPort" configuration: We recommend துறைமுகம் 443 if that is not used by another daemon on your சேவையகம் already.

source: (More ports usually means potentially more abuse complaints.)
ta: (அதிக துறைமுகங்கள் பொதுவாக அதிக துச்பிரயோக புகார்களைக் குறிக்கின்றன.)

source: * Do you want to run a Tor exit or non-exit (bridge/guard/middle) relay?
ta: * நீங்கள் ஒரு டோர் வெளியேறும் அல்லது வெளியேற்றப்படாத (பாலம்/காவலர்/நடுத்தர) ரிலேவை இயக்க விரும்புகிறீர்களா?

source: * Does the server have an IPv6 address?
ta: * சேவையகத்தில் ஐபிவி 6 முகவரி உள்ளதா?

source: * How much bandwidth/monthly traffic do you want to allow for Tor traffic?
ta: * டோர் போக்குவரத்தை எவ்வளவு அலைவரிசை/மாதாந்திர போக்குவரத்தை அனுமதிக்க விரும்புகிறீர்கள்?

source: * If you want to run an exit relay: Which ports do you want to allow in your exit policy?
ta: * நீங்கள் வெளியேறும் ரிலேவை இயக்க விரும்பினால்: உங்கள் வெளியேறும் கொள்கையில் எந்த துறைமுகங்களை அனுமதிக்க விரும்புகிறீர்கள்?

source: * What email address will you use in the ContactInfo field of your relay(s)?
ta: * உங்கள் ரிலே (கள்) இன் காண்டாக்ட்இன்ஃபோ புலத்தில் நீங்கள் எந்த மின்னஞ்சல் முகவரியைப் பயன்படுத்துவீர்கள்?

source: * What external TCP port do you want to use for incoming Tor connections?
ta: * உள்வரும் TOR இணைப்புகளுக்கு என்ன வெளிப்புற TCP துறைமுகம் பயன்படுத்த விரும்புகிறீர்கள்?

source: Click below on type of relay do you want to host and don't forget to read [Relay post-install and good practices](/relay/setup/post-install/).
ta: ரிலே வகையைப் பற்றி கீழே சொடுக்கு செய்க நீங்கள் புரவலன் செய்ய விரும்புகிறீர்களா?

source: If you are looking to run a relay with minimal effort, we recommend you stick to stable releases.
ta: குறைந்தபட்ச முயற்சியுடன் ரிலேவை இயக்க நீங்கள் விரும்பினால், நிலையான வெளியீடுகளில் ஒட்டிக்கொள்ள பரிந்துரைக்கிறோம்.

source: Note: For some operating systems, there are alpha version packages available (Tor versions with new features not deemed to be stable yet).
ta: குறிப்பு: சில இயக்க முறைமைகளுக்கு, ஆல்பா பதிப்பு தொகுப்புகள் உள்ளன (புதிய அம்சங்களைக் கொண்ட TOR பதிப்புகள் இன்னும் நிலையானதாகக் கருதப்படவில்லை).

source: ORPort 443 is recommended because it is often one of the few open ports on public WIFI networks.
ta: ORPORT 443 பரிந்துரைக்கப்படுகிறது, ஏனெனில் இது பெரும்பாலும் பொது வைஃபை நெட்வொர்க்குகளில் சில திறந்த துறைமுகங்களில் ஒன்றாகும்.

source: Port 9001 is another commonly used ORPort.)
ta: துறைமுகம் 9001 என்பது பொதுவாகப் பயன்படுத்தப்படும் மற்றொரு ஆட்டக்காராகும்.)

source: The installation commands are shown in code blocks and must be executed with root privileges.
ta: நிறுவல் கட்டளைகள் குறியீடு தொகுதிகளில் காட்டப்பட்டுள்ளன, மேலும் அவை ரூட் சலுகைகளுடன் செயல்படுத்தப்பட வேண்டும்.

source: These are only recommended for people eager to test and report bugs in bleeding edge releases/features.
ta: இரத்தப்போக்கு விளிம்பு வெளியீடுகள்/அம்சங்களில் பிழைகளை சோதிக்கவும் புகாரளிக்கவும் மட்டுமே இவை பரிந்துரைக்கப்படுகின்றன.

source: These steps are intended for the latest stable version of the given OS, on Ubuntu for the latest LTS release.
ta: இந்த படிகள் அண்மைக் கால எல்.டி.எச் வெளியீட்டிற்காக உபுண்டுவில் கொடுக்கப்பட்ட OS இன் அண்மைக் கால நிலையான பதிப்பிற்காக வடிவமைக்கப்பட்டுள்ளன.

source: This information will be made public.
ta: இந்த செய்தி பகிரங்கப்படுத்தப்படும்.

source: This section covers the installation and configuration of the program required to run a Tor relay for various operating systems.
ta: இந்த பிரிவு பல்வேறு இயக்க முறைமைகளுக்கு டோர் ரிலேவை இயக்க தேவையான நிரலின் நிறுவல் மற்றும் உள்ளமைவை உள்ளடக்கியது.

source: How to install and configure each type of relay: bridge, guard, middle, and exit.
ta: ஒவ்வொரு வகை ரிலேவை எவ்வாறு நிறுவுவது மற்றும் கட்டமைப்பது: பாலம், காவலர், நடுத்தர மற்றும் வெளியேறுதல்.

source: Technical Setup
ta: தொழில்நுட்ப அமைப்பு

source: ### 1. Package installation
ta: ### 1. தொகுப்பு நிறுவல்

source: ### 2. Lock changes in
ta: ### 2. இல் பூட்டு மாற்றங்கள்

source: ### 3. QNAME minimisation
ta: ### 3. Qname குறைத்தல்

source: ### 4. Start the service
ta: ### 4. சேவையைத் தொடங்கவும்

source: If the setting is missing, it should still be enabled by default.
ta: அமைப்பு காணவில்லை என்றால், அது இயல்பாகவே இயக்கப்பட வேண்டும்.

source: If you are running **systemd-resolved** with its stub listener, you may need to do a bit more than just that. Please refer to the [resolved.conf manpage](https://www.freedesktop.org/software/systemd/man/resolved.conf.html).
ta: நீங்கள் ** Systemd- தீர்க்கப்பட்ட ** அதன் ச்டப் கேட்பவருடன் இயங்குகிறீர்கள் என்றால், அதை விட சற்று அதிகமாக நீங்கள் செய்ய வேண்டியிருக்கும். தயவுசெய்து [counted.conf manpage] (https://www.freedesktop.org/software/systemd/man/resolved.conf.html) ஐப் பார்க்கவும்.

source: If you are using a legacy version of CentOS/RHEL, using `yum` instead of `dnf` may be more suitable.
ta: நீங்கள் சென்டோச்/RHEL இன் மரபு பதிப்பைப் பயன்படுத்துகிறீர்கள் என்றால், `dnf` க்கு பதிலாக` yum` ஐப் பயன்படுத்துவது மிகவும் பொருத்தமானதாக இருக்கலாம்.

source: The Unbound resolver you just installed also does DNSSEC validation.
ta: நீங்கள் இப்போது நிறுவிய வரம்பற்ற தீர்வும் DNSSEC சரிபார்ப்பையும் செய்கிறது.

source: The following commands install `unbound`, backup your DNS configuration, and tell the system to use the local resolver:
ta: பின்வரும் கட்டளைகள் `வரம்பற்ற` ஐ நிறுவி, உங்கள் டிஎன்எச் உள்ளமைவை காப்புப் பிரதி எடுத்து, உள்ளக தீர்வைப் பயன்படுத்த கணினியைச் சொல்லுங்கள்:

source: The latest versions of `unbound` have `qname-minimisation` enabled by default. However, it is advisable to verify this setting, as older versions did not enable it automatically.
ta: `வரம்பற்ற` இன் அண்மைக் கால பதிப்புகள் இயல்புநிலையாக` Qname-Minimisation` ஐ இயக்கியுள்ளன. இருப்பினும், இந்த அமைப்பை சரிபார்க்க அறிவுறுத்தப்படுகிறது, ஏனெனில் பழைய பதிப்புகள் தானாகவே செயல்படுத்தவில்லை.

source: To avoid unwanted configuration changes (for example by the DHCP client):
ta: தேவையற்ற உள்ளமைவு மாற்றங்களைத் தவிர்க்க (எடுத்துக்காட்டாக டி.எச்.சி.பி கிளையண்டால்):

source: To check and configure it, open the unbound configuration file, located at `/etc/unbound/unbound.conf`, look for the following entry and change it if necessary:
ta: அதைச் சரிபார்த்து கட்டமைக்க, `/etc/infound/infound.conf` இல் அமைந்துள்ள வரம்பற்ற உள்ளமைவு கோப்பைத் திறக்கவும், பின்வரும் நுழைவைத் தேடி தேவைப்பட்டால் அதை மாற்றவும்:

source: To enable and start the `unbound` service, run:
ta: `வரம்பற்ற` சேவையை இயக்கவும் தொடங்கவும், இயக்கவும்:

source: Exit relay
ta: ரிலே வெளியேறவும்

source: How to install Unbound on CentOS/RHEL
ta: சென்டோச்/RHEL இல் வரம்பற்றதை எவ்வாறு நிறுவுவது

source: CentOS/RHEL
ta: சென்டோச்/ரெல்

source: ## DNS on Exit Relays
ta: வெளியேறும் ரிலேக்களில் ## டி.என்.எச்

source: ## Exit Notice HTML page
ta: ## வெளியேறு அறிவிப்பு உஉகுமொ பக்கம்

source: ## Exit policy
ta: ## வெளியேறும் கொள்கை

source: ## Reverse DNS and WHOIS record
ta: ## தலைகீழ் டி.என்.எச் மற்றும் ஊயிச் பதிவு

source: * Avoid adding more than two resolvers to your `/etc/resolv.conf` file to limit AS-level exposure of DNS queries.
ta: * டி.என்.எச் வினவல்களின் நிலை வெளிப்பாட்டைக் கட்டுப்படுத்த உங்கள் `/etc/relorv.conf` கோப்பில் இரண்டு தீர்வுகளைச் சேர்ப்பதைத் தவிர்க்கவும்.

source: * DNS resolution can have a significant impact on the performance and reliability that your exit relay provides.
ta: * உங்கள் வெளியேறும் ரிலே வழங்கும் செயல்திறன் மற்றும் நம்பகத்தன்மையில் டிஎன்எச் தீர்மானம் குறிப்பிடத்தக்க தாக்கத்தை ஏற்படுத்தும்.

source: * Don't use any of the big DNS resolvers (Google, OpenDNS, Quad9, Cloudflare, 4.2.2.1-6) as your primary or fallback DNS resolver to avoid centralization.
ta: * மையமயமாக்கலைத் தவிர்ப்பதற்காக உங்கள் முதன்மை அல்லது குறைவடையும் டிஎன்எச் தீர்மானமாக பெரிய டிஎன்எச் தீர்வுகளை (கூகிள், ஓபன்என்எச், குவாட் 9, கிளவுட்ஃப்ளேர், 4.2.2.1-6) பயன்படுத்த வேண்டாம்.

source: * Ensure your local resolver does not use any outbound source IP address that is used by any Tor exit or non-exits, because it is not uncommon that Tor IPs are (temporarily) blocked and a blocked DNS resolver source IP address can have a broad impact.
ta: * உங்கள் உள்ளக தீர்வானது எந்தவொரு வெளிச்செல்லும் மூல ஐபி முகவரியையும் பயன்படுத்தாது என்பதை உறுதிப்படுத்தவும், ஏனெனில் எந்தவொரு டோர் வெளியேறும் அல்லது வெளியேற்றப்படாதது அல்லாதவை, ஏனெனில் டோர் ஐபிஎச் (தற்காலிகமாக) தடுக்கப்பட்டிருப்பது அசாதாரணமானது அல்ல, மேலும் தடுக்கப்பட்ட டிஎன்எச் தீர்மானம் மூல ஐபி முகவரி பரந்த தாக்கத்தை ஏற்படுத்தும்.

source: * If you want to add a second DNS resolver as a fallback to your `/etc/resolv.conf` configuration, choose a resolver within your autonomous system and make sure that it is not your first entry in that file (the first entry should be your local resolver).
ta: * உங்கள் `/etc/relorv.conf` உள்ளமைவுக்கு இரண்டாவது டிஎன்எச் தீர்வை ஒரு குறைவடையும் என நீங்கள் சேர்க்க விரும்பினால், உங்கள் தன்னாட்சி கணினியில் ஒரு தீர்வைத் தேர்ந்தெடுத்து, அந்தக் கோப்பில் இது உங்கள் முதல் நுழைவு அல்ல என்பதை உறுதிப்படுத்தவும் (முதல் நுழைவு வேண்டும் முதல் நுழைவு வேண்டும் உங்கள் உள்ளக தீர்வாக இருங்கள்).

source: * Large exit operators (>=100 Mbit/s) should make an effort to monitor and optimize Tor's DNS resolution timeout rate.
ta: * பெரிய வெளியேறும் ஆபரேட்டர்கள் (> = 100 MBIT/S) TOR இன் DNS தீர்மானம் காலக்கெடு வீதத்தை கண்காணிக்கவும் மேம்படுத்தவும் முயற்சி செய்ய வேண்டும்.

source: * We recommend running a local caching and DNSSEC-validating resolver without using any forwarders (specific instructions follow below, for various operating systems).
ta: * எந்தவொரு முன்னோக்கிப் பணியாளர்களையும் பயன்படுத்தாமல் உள்ளக கேச்சிங் மற்றும் டி.என்.எச்.எச்.இ.சி-சரிபார்க்கும் தீர்வை இயக்க பரிந்துரைக்கிறோம் (குறிப்பிட்ட வழிமுறைகள் கீழே பின்பற்றப்படுகின்றன, பல்வேறு இயக்க முறைமைகளுக்கு).

source: After switching to Unbound, verify that it works as expected by resolving a valid hostname. If it does not work, you can restore your old `/etc/resolv.conf` file.
ta: வரம்பற்ற மாறிய பிறகு, செல்லுபடியாகும் ஓச்ட்பெயரைத் தீர்ப்பதன் மூலம் எதிர்பார்த்தபடி இது செயல்படுகிறதா என்பதை சரிபார்க்கவும். இது வேலை செய்யவில்லை என்றால், உங்கள் பழைய `/etc/relorv.conf` கோப்பை மீட்டெடுக்கலாம்.

source: As a new exit relay - especially if you are new to your hoster - it is good to start with a reduced exit policy (to reduce the amount of abuse emails) and further open it up as you become more experienced.
ta: ஒரு புதிய வெளியேறும் ரிலே - குறிப்பாக நீங்கள் உங்கள் ஓச்டருக்கு புதியவராக இருந்தால் - குறைக்கப்பட்ட வெளியேறும் கொள்கையுடன் (துச்பிரயோகம் செய்யும் மின்னஞ்சல்களின் அளவைக் குறைக்க) தொடங்குவது நல்லது, மேலும் நீங்கள் அதிக பட்டறிவு வாய்ந்தவராக இருக்கும்போது அதை மேலும் திறக்கவும்.
