Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: There's no good reason to disallow its encrypted counterpart (like port 443), making these relays highly suspect for sniffing traffic. See [context](https://www.google.com/search?site:torproject.org+80+443+6667) and [spec](https://gitweb.torproject.org/torspec.git/tree/dir-spec.txt#n1969).
ta: அதன் மறைகுறியாக்கப்பட்ட எதிர்ப்பாளரை (போர்ட் 443 போன்றவை) அனுமதிக்க நல்ல காரணம் எதுவுமில்லை, இந்த ரிலேக்கள் போக்குவரத்தை முனகுவதற்கு மிகவும் சந்தேகத்திற்குரியவை. .

source: This can be either through maliciousness or misconfiguration.
ta: இது தீங்கிழைக்கும் அல்லது தவறான கட்டமைப்பு மூலம் இருக்கலாம்.

source: We have three types of flags we can apply:
ta: நாங்கள் விண்ணப்பிக்கக்கூடிய மூன்று வகையான கொடிகள் உள்ளன:

source: Which we use depends on the severity of the issue, and if it can still be safely used in certain situations.
ta: நாம் பயன்படுத்தும் பிரச்சினையின் தீவிரத்தைப் பொறுத்தது, மேலும் சில சூழ்நிலைகளில் அதைப் பாதுகாப்பாகப் பயன்படுத்த முடியுமானால்.

source: Yes. For our automated issue detection see [exitmap](http://www.cs.kau.se/philwint/spoiled_onions/) and [sybilhunter](https://gitweb.torproject.org/user/phw/sybilhunter.git/).
ta: ஆம். எங்கள் தானியங்கி வெளியீட்டு கண்டறிதலுக்கு [ExitMap] (http://www.cs.kau.se/philwint/spoiled_onions/) மற்றும் [Sybilhunter] (https://gitweb.torproject.org/user/user/phw/sybilhunter.git/) ஐப் பார்க்கவும்.

source: You can check which exit you are using at any time by visiting [tor check](https://check.torproject.org/). Please include the following in your report:
ta: [TOR CHECK] (https://check.torproject.org/) ஐப் பார்வையிடுவதன் மூலம் நீங்கள் எந்த நேரத்திலும் பயன்படுத்துகிறீர்கள் என்பதை நீங்கள் சரிபார்க்கலாம். உங்கள் அறிக்கையில் பின்வருவனவற்றைச் சேர்க்கவும்:

source: Community Resources
ta: சமூக வளங்கள்

source: Learn how to report relays that either doesn't work properly or tampers with our users' connections
ta: சரியாக வேலை செய்யாத ரிலேக்களை எவ்வாறு புகாரளிப்பது அல்லது எங்கள் பயனர்களின் இணைப்புகளுடன் சண்டையிடுவது எப்படி என்பதை அறிக

source: Bad relays
ta: மோசமான ரிலேக்கள்

source: # Bad relays
ta: # மோசமான ரிலேக்கள்

source: # Legal resources
ta: # சட்ட ஆதாரங்கள்

source: # Other resources
ta: # பிற வளங்கள்

source: # Responding to abuse complaints
ta: # துச்பிரயோக புகார்களுக்கு பதிலளித்தல்

source: # Running a relay with other people
ta: # மற்றவர்களுடன் ரிலேவை இயக்குதல்

source: ## At your company or organization
ta: ## உங்கள் நிறுவனம் அல்லது நிறுவனத்தில்

source: ## At your university
ta: உங்கள் பல்கலைக்கழகத்தில் ##

source: * And, most importantly, make sure to email tshirt@torproject.org and [claim your swag](swag). It's our way of saying thanks for defending privacy and free speech online.
ta: . தனியுரிமை மற்றும் சுதந்திரமான உரையை ஆன்லைனில் பாதுகாப்பதற்கு நன்றி சொல்லும் வழி இது.

source: * There is also more info about running a relay at the [Tor FAQ](https://support.torproject.org/relay-operators/).
ta: * [டோர் கேள்விகள்] (https://support.torproject.org/relay-operators/) இல் ரிலேவை இயக்குவது பற்றிய கூடுதல் தகவல்களும் உள்ளன.

source: * You can check out traffic and other statistics for your relay at our [Relay Search](https://metrics.torproject.org/rs.html) (your relay will appear on "Relay Search" about 3 hours after you started it).
ta: * எங்கள் [ரிலே தேடல்](https://metrics.torproject.org/rs.html) இல் உங்கள் ரிலேவுக்கான போக்குவரத்து மற்றும் பிற புள்ளிவிவரங்களை நீங்கள் பார்க்கலாம் (நீங்கள் தொடங்கிய 3 மணி நேரத்திற்குப் பிறகு "ரிலே தேடலில்" உங்கள் ரிலே தோன்றும்).

source: * abuse response templates from Coldhak, an organization in Canada that runs multiple relays: [DMCA Template](https://github.com/coldhakca/abuse-templates/blob/master/dmca.template), [Generic Abuse Template](https://github.com/coldhakca/abuse-templates/blob/master/generic.template).
ta: * பல ரிலேக்களை இயக்கும் கனடாவில் உள்ள கோல்ட்ஆக் என்ற அமைப்பிலிருந்து தீய பயன்பாடு மறுமொழி வார்ப்புருக்கள்: [டி.எம்.சி.ஏ வார்ப்புரு](https://github.com/coldhakca/abuse-templates/blob/master/dmca.template), [பொதுவான மோசடி வார்ப்புரு](https://github.com/coldhakca/abuse-templates/blob/master/generic.template).

source: A bad relay is one that either do not work properly or tamper with our users' connections. This can be either through maliciousness or misconfiguration.
ta: ஒரு மோசமான ரிலே என்பது சரியாக வேலை செய்யாது அல்லது எங்கள் பயனர்களின் இணைப்புகளை சேதப்படுத்தாது. இது தீங்கிழைக்கும் அல்லது தவறான கட்டமைப்பு மூலம் இருக்கலாம்.

source: Also see the [Tor Exit Guidelines](tor-exit-guidelines).
ta: [டோர் வெளியேறும் வழிகாட்டுதல்கள்] (டோர்-எக்சிட்-வழிகாட்டுதல்கள்) ஐயும் காண்க.

source: Becoming a Torservers partner is a good way to become more involved in the Tor relay community, and can help you connect with dedicated relay operators around the world for solidarity and support.
ta: டோர்ச் ரிலே சமூகத்தில் அதிக ஈடுபாடு கொள்ள ஒரு சிறந்த வழியாகும், மேலும் ஒற்றுமை மற்றும் ஆதரவுக்காக உலகெங்கிலும் உள்ள அர்ப்பணிப்பு ரிலே ஆபரேட்டர்களுடன் இணைக்க உங்களுக்கு உதவ முடியும்.

source: Congratulations, you're officially a Tor relay operator! What now?
ta: வாழ்த்துக்கள், நீங்கள் அதிகாரப்பூர்வமாக ஒரு டோர் ரிலே ஆபரேட்டர்! இப்போது என்ன?

source: Depending on your location and connections within the technical community of the area, the last one may be the hardest step.
ta: இப்பகுதியின் தொழில்நுட்ப சமூகத்திற்குள் உங்கள் இருப்பிடம் மற்றும் இணைப்புகளைப் பொறுத்து, கடைசியாக கடினமான படியாக இருக்கலாம்.

source: Exit relay operators should understand the potential risks associated with running an exit relay.
ta: வெளியேறும் ரிலே ஆபரேட்டர்கள் வெளியேறும் ரிலேவை இயக்குவதில் தொடர்புடைய அபாயங்களை புரிந்து கொள்ள வேண்டும்.

source: Exits are the ones that present some legal concerns, but operators under most circumstances will be able to handle legal matters by having an abuse response letter, running the exit from a location that isn't their home, and reading through some of the legal resources that Tor-supportive lawyers have put together.
ta: சில சட்டக் கவலைகளை முன்வைப்பவர்கள் வெளியேறுகிறார்கள், ஆனால் பெரும்பாலான சூழ்நிலைகளில் ஆபரேட்டர்கள் துச்பிரயோக மறுமொழி கடிதம் வைத்திருப்பதன் மூலமும், தங்கள் வீட்டிலிருந்து வெளியேறும் இடத்திலிருந்து வெளியேறுவதையும், சில சட்ட வளங்களை வாசிப்பதன் மூலமும் சட்ட விசயங்களை கையாள முடியும் அந்த டோர்-ஆதரவு வழக்கறிஞர்கள் ஒன்றாக இணைத்துள்ளனர்.

source: For the majority of operators in most countries, bridges and guard/middle relays are very low risk.
ta: பெரும்பாலான நாடுகளில் உள்ள பெரும்பான்மையான ஆபரேட்டர்களுக்கு, பாலங்கள் மற்றும் காவலர்/நடுத்தர ரிலேக்கள் மிகக் குறைந்த இடர்.

source: Get in touch with your local digital rights organization to see if they have recommendations about legal assistance, and if you're not sure what organizations are working in your region, [write to EFF](https://www.eff.org/about/contact) and see if they can help connect you.
ta: உங்கள் உள்ளக டிசிட்டல் உரிமைகள் நிறுவனத்துடன் சட்ட உதவியைப் பற்றிய பரிந்துரைகள் உள்ளதா என்பதைப் பார்க்கவும், உங்கள் பிராந்தியத்தில் என்ன நிறுவனங்கள் செயல்படுகின்றன என்பது உங்களுக்குத் தெரியாவிட்டால், [EFF க்கு எழுதுங்கள்] (https://www.eff.org/about/contact) உங்களை இணைக்க உதவ முடியுமா என்று பாருங்கள்.

source: If you do not know anyone in your social network interested in running relays, one place to meet people is [your local hackerspace](https://wiki.hackerspaces.org/Hackerspaces).
ta: ரிலேக்களை இயக்குவதில் ஆர்வமுள்ள உங்கள் சமூக வலைப்பின்னலில் யாரையும் உங்களுக்குத் தெரியாவிட்டால், மக்களைச் சந்திக்க ஒரு இடம் [உங்கள் உள்ளக ஏக்கர்ச்பேச்] (https://wiki.hackerspaces.org/hackerspaces).

source: If you work at a Tor-friendly company or organization, that's another ideal place to run a relay.
ta: நீங்கள் ஒரு டோர்-நட்பு நிறுவனம் அல்லது அமைப்பில் பணிபுரிந்தால், இது ரிலேவை இயக்க மற்றொரு சிறந்த இடம்.

source: In general it's a good idea to consult with a lawyer before deciding to operate an exit relay, especially if you live in a place where exit relay operators have been harassed, or if you're the only exit relay operator in your region.
ta: பொதுவாக வெளியேறும் ரிலேவை இயக்க முடிவு செய்வதற்கு முன் ஒரு வழக்கறிஞருடன் கலந்தாலோசிப்பது நல்லது, குறிப்பாக நீங்கள் வெளியேறும் ரிலே ஆபரேட்டர்கள் துன்புறுத்தப்பட்ட இடத்தில் வசிக்கிறீர்கள் என்றால், அல்லது உங்கள் பிராந்தியத்தில் நீங்கள் வெளியேறும் ஒரே ரிலே ஆபரேட்டர் என்றால்.

source: In many countries operating as a corporation instead of as an individual can also get you certain legal protections.
ta: ஒரு தனிநபராக பதிலாக ஒரு நிறுவனமாக செயல்படும் பல நாடுகளில் உங்களுக்கு சில சட்டப் பாதுகாப்புகளும் கிடைக்கும்.

source: It is extremely important to maintain good relationships with these ISPs.
ta: இந்த ISP களுடன் நல்ல உறவைப் பேணுவது மிகவும் முதன்மை.

source: It is important to respond to abuse complaints in a timely manner (usually within 24 hours). If the hoster gets annoyed by the amount of abuse you can reduce the amount of ports allowed in your exit policy.
ta: துச்பிரயோக புகார்களுக்கு சரியான நேரத்தில் (பொதுவாக 24 மணி நேரத்திற்குள்) பதிலளிப்பது முதன்மை. துச்பிரயோகத்தின் அளவால் ஓச்டர் கோபமடைந்தால், உங்கள் வெளியேறும் கொள்கையில் அனுமதிக்கப்பட்ட துறைமுகங்களின் அளவைக் குறைக்கலாம்.

source: Many bad relays are caught thanks to our wider community, so many thanks for all your help and vigilance! Learn how you can report [bad relays](bad-relays).
ta: பல மோசமான ரிலேக்கள் எங்கள் பரந்த சமூகத்திற்கு நன்றி செலுத்துகின்றன, உங்கள் எல்லா உதவிகளுக்கும் விழிப்புணர்வுக்கும் நன்றி! [மோசமான ரிலேக்கள்] (மோசமான-நம்பகத்தன்மை) எவ்வாறு புகாரளிக்கலாம் என்பதை அறிக.

source: Many computer science departments, university libraries, and individual students and faculty run relays from university networks.
ta: பல கணினி அறிவியல் துறைகள், பல்கலைக்கழக நூலகங்கள் மற்றும் தனிப்பட்ட மாணவர்கள் மற்றும் ஆசிரியர்கள் பல்கலைக்கழக நெட்வொர்க்குகளில் இருந்து ரிலேக்களை நடத்துகிறார்கள்.

source: Once you have a trusted group of people, depending on your region, it is often advised to create some type of non-profit corporation.
ta: உங்கள் பிராந்தியத்தைப் பொறுத்து, நீங்கள் நம்பகமான நபர்களைக் கொண்டிருந்தவுடன், சில வகையான இலாப நோக்கற்ற நிறுவனத்தை உருவாக்க பெரும்பாலும் அறிவுறுத்தப்படுகிறது.

source: Operators can put together their own abuse complaint template responses from one of many templates that Tor has created: [Tor Abuse Templates](tor-abuse-templates).
ta: டோர் உருவாக்கிய பல வார்ப்புருக்களில் ஒன்றிலிருந்து ஆபரேட்டர்கள் தங்கள் சொந்த துச்பிரயோக குற்றச்சாட்டு வார்ப்புரு பதில்களை ஒன்றிணைக்கலாம்: [டோர் தீய பயன்பாடு வார்ப்புருக்கள்] (டோர்-துச்பிரயோகம்-டெம்ப்ளேட்டுகள்).

source: Other docs we like:
ta: நாங்கள் விரும்பும் பிற டாக்ச்:

source: Please document your experience with new hosters on the following page: [GoodBadISPs](good-bad-isps)
ta: புதிய ஓச்டர்களுடனான உங்கள் அனுபவத்தை பின்வரும் பக்கத்தில் ஆவணப்படுத்தவும்: [குட்பாடிச்ப்ச்] (நல்ல-பேட்-இச்)

source: Running relays is more fun with other people! You can work with your university department, your employer or institution, or an organization like [Torservers.net](https://torservers.net) to run a relay.
ta: ரிலேக்களை இயக்குவது மற்றவர்களுடன் மிகவும் வேடிக்கையாக உள்ளது! ரிலேவை இயக்க உங்கள் பல்கலைக்கழகத் துறை, உங்கள் முதலாளி அல்லது நிறுவனம் அல்லது [torservers.net] (https://torservers.net) போன்ற ஒரு நிறுவனத்துடன் இணைந்து பணியாற்றலாம்.

source: Small local ISPs often have extra bandwidth, and may be interested in supporting your group with some bandwidth or rackspace.
ta: சிறிய உள்ளக ISP கள் பெரும்பாலும் கூடுதல் அலைவரிசையைக் கொண்டிருக்கின்றன, மேலும் உங்கள் குழுவை சில அலைவரிசை அல்லது ராக்ச்பேசுடன் ஆதரிக்க ஆர்வமாக இருக்கலாம்.

source: Some companies running relays include [Brass Horn Communications](https://brasshorncommunications.uk/), [Quintex Alliance Consulting](https://www.quintex.com/), [Private Internet Access](https://www.privateinternetaccess.com/), [Boing Boing](https://boingboing.net/) and OmuraVPN.
ta: ரிலேக்களில் இயங்கும் சில நிறுவனங்கள் [பித்தளை கொம்பு தகவல்தொடர்புகள்] (https://brasshorncommunications.uk/), [குயின்டெக்ச் அலையன்ச் கன்சல்டிங்] (https://www.quintex.com/), [தனியார் இணைய அணுகல்] (https://www.privateinterneternetrac.com/) [ Omuravpn.

source: Some organizations running Tor relays include Digital Courage, [Access Now](https://www.accessnow.org/), [Derechos Digitales](https://tor.derechosdigitales.org), [Enjambre Digital](https://tor.enjambre.net/) and Lebanon Libraries in New Hampshire.
ta: டோர் ரிலேக்களை இயக்கும் சில நிறுவனங்களில் டிசிட்டல் துணிவு, [அணுகல் இப்போது] (https://www.accessnow.org/), [டெரெச்சோச் டிசிட்டல்] (https://tor.derechosdigitales.org), [Engambre Digital] (https://tor.enjambre.netrary.

source: The [EFF Tor Legal FAQ](/relay/community-resources/eff-tor-legal-faq) answers many common questions about relay operation and the law. We also like [Noisebridge's wiki](https://www.noisebridge.net/wiki/Noisebridge_Tor/FBI) for additional legal resources.
ta: ரிலே செயல்பாடு மற்றும் சட்டம் குறித்த பல பொதுவான கேள்விகளுக்கு [EFF TOR சட்ட கேள்விகள்] (/ரிலே/சமூக-வளங்கள்/EFF-TOR-LEGAL-FAQ) பதிலளிக்கிறது. கூடுதல் சட்ட ஆதாரங்களுக்காக [சத்தம் பிரிட்சின் விக்கி] (https://www.noisebridge.net/wiki/noisebridge_tor/fbi) ஐயும் விரும்புகிறோம்.

source: The next steps are figuring out hardware, traffic, and server hosting.
ta: அடுத்த படிகள் வன்பொருள், போக்குவரத்து மற்றும் சேவையக ஓச்டிங் ஆகியவற்றைக் கண்டுபிடிப்பது.

source: There should be mutual trust between the people in the group, and members should commit to running relays for the long term.
ta: குழுவில் உள்ளவர்களிடையே பரச்பர நம்பிக்கை இருக்க வேண்டும், மேலும் உறுப்பினர்கள் நீண்ட காலத்திற்கு ரிலேக்களை இயக்குவதில் ஈடுபட வேண்டும்.

source: These universities include the Massachusetts Institute of Technology (MIT CSAIL), Boston University, the University of Waterloo, the University of Washington, Northeastern University, Karlstad University, Universitaet Stuttgart, and Friedrich-Alexander University Erlangen-Nuremberg.
ta: இந்த பல்கலைக்கழகங்களில் மாசசூசெட்ச் இன்ச்டிடியூட் ஆப் டெக்னாலசி (எம்ஐடி சிஎச்ஏஎல்), பாச்டன் பல்கலைக்கழகம், வாட்டர்லூ பல்கலைக்கழகம், வாசிங்டன் பல்கலைக்கழகம், வடகிழக்கு பல்கலைக்கழகம், கார்ல்ச்டாட் பல்கலைக்கழகம், யுனிவர்சிடாத் ச்டட்கார்ட் மற்றும் ப்ரீட்ரிக்-அலெக்சாண்டர் பல்கலைக்கழகம் எர்லாங்கன்-நியூரம்பெர்க் ஆகியவை அடங்கும்.

source: This is useful for having a bank account, shared ownership, grant applications, etc.
ta: வங்கி கணக்கு, பகிரப்பட்ட உரிமை, மானிய விண்ணப்பங்கள் போன்றவற்றைக் கொண்டிருப்பதற்கு இது பயனுள்ளதாக இருக்கும்.

source: To learn more about how to get support for a relay on your university's network, check out EFF's resources: Tor on campus [Part 1 - It's Been Done Before and Should Happen Again](https://www.eff.org/deeplinks/2014/08/tor-campus-part-i-its-been-done-and-should-happen-again) and [Part 2 - Icebreakers and Risk Mitigation Strategies](https://www.eff.org/deeplinks/2014/08/tor-campus-part-ii-icebreakers-and-risk-mitigation-strategies).
ta: பெறுநர் learn more பற்றி how பெறுநர் get support க்கு a அஞ்சல் சுருள் on your university's network, சரிபார் out EFF's resources: Tor on campus [Part 1 - It's Been முடிந்தது Before and Should Happen Again](https://www.eff.org/deeplinks/2014/08/tor-campus-part-i-its-been-done-and-should-happen-again) and [Part 2 - Icebreakers and இடர் Mitigation உத்திகள்] (https://www.eff.org/deeplinks/2014/08/tor-campus-part-ii-icebreakers- மற்றும்-ரிச்க்-குறைப்பு-மூலோபாயங்கள்).

source: To start a Torservers partner, the most important thing is to have a group of people (3-5 suggested to start) interested in helping with the various activities required for running relays.
ta: ஒரு டார்சர்சர் கூட்டாளரைத் தொடங்க, மிக முக்கியமான சேதி என்னவென்றால், ரிலேக்களை இயக்குவதற்குத் தேவையான பல்வேறு நடவடிக்கைகளுக்கு உதவ ஆர்வமுள்ள ஒரு குழு (3-5 தொடங்க பரிந்துரைக்கப்பட்டது).

source: Torservers is an independent, global network of organizations that help the Tor network by running high bandwidth Tor relays.
ta: டோர்ச்சர்வர்ச் என்பது ஒரு சுயாதீனமான, உலகளாவிய அமைப்புகளின் பிணையம் ஆகும், இது உயர் அலைவரிசை டோர் ரிலேக்களை இயக்குவதன் மூலம் TOR நெட்வொர்க்குக்கு உதவுகிறது.

source: How to get involved with the Tor relay operator community, advice on responding to abuse complaints, and how to start an organization dedicated to relay operation.
ta: டோர் ரிலே ஆபரேட்டர் சமூகத்துடன் எவ்வாறு ஈடுபடுவது, துச்பிரயோக புகார்களுக்கு பதிலளிப்பதற்கான அறிவுரை மற்றும் ரிலே செயல்பாட்டிற்கு அர்ப்பணிக்கப்பட்ட ஒரு நிறுவனத்தை எவ்வாறு தொடங்குவது.

source: Community and legal resources
ta: சமூகம் மற்றும் சட்ட வளங்கள்

source: ## Exit Relays
ta: ## வெளியேறும் ரிலேக்கள்

source: ## General Information
ta: ## பொதுவான செய்தி

source: ### Should I snoop on the plaintext traffic that exits through my Tor relay?
ta: ### எனது டோர் ரிலே மூலம் வெளியேறும் எளிய உரை போக்குவரத்தை நான் பதுங்க வேண்டுமா?

source: ### Can EFF promise that I won't get in trouble for running a Tor relay?
ta: டோர் ரிலேவை இயக்குவதில் நான் சிக்கலில் சிக்க மாட்டேன் என்று ### வாக்குறுதியளிக்க முடியுமா?

source: ### Do Tor's core developers make any promises about the trustworthiness or reliability of Tor relays that are listed in their directory?
ta: ### டோரின் முக்கிய உருவாக்குபவர்கள் தங்கள் கோப்பகத்தில் பட்டியலிடப்பட்டுள்ள டோர் ரிலேக்களின் நம்பகத்தன்மை அல்லது நம்பகத்தன்மை குறித்து ஏதேனும் வாக்குறுதிகளை அளிக்கிறார்களா?

source: ### Does U.S. law provide any protections for the Tor network against civil lawsuits?
ta: ### குடிமை வழக்குகளுக்கு எதிராக டோர் நெட்வொர்க்கிற்கு ஏதேனும் பாதுகாப்புகளை யு.எச். சட்டம் வழங்குகிறதா?

source: ### Has anyone ever been sued or prosecuted for running Tor?
ta: ### டோர் ஓடியதற்காக யாராவது வழக்குத் தொடுத்துள்ளார்களா அல்லது வழக்குத் தொடரப்பட்டார்களா?

source: ### How should I deal with a police visit/raid/interrogation?
ta: ### நான் ஒரு பொலிச் வருகை/சோதனை/விசாரணை எவ்வாறு சமாளிக்க வேண்டும்?

source: ### If I receive a subpoena or other information request from law enforcement or anyone else related to my Tor relay, what should I do?
ta: ### சட்ட அமலாக்கத்திடமிருந்து அல்லது எனது டோர் ரிலே தொடர்பான வேறு யாரிடமிருந்தும் நான் ஒரு சப்போனா அல்லது பிற செய்தி கோரிக்கையைப் பெற்றால், நான் என்ன செய்ய வேண்டும்?

source: ### Is it a good idea to let others know that I'm running an exit relay?
ta: ### நான் வெளியேறும் ரிலேவை இயக்குகிறேன் என்பதை மற்றவர்களுக்கு தெரியப்படுத்துவது நல்ல யோசனையா?

source: ### My ISP, university, etc. just sent me a DMCA notice. What should I do?
ta: ### எனது ISP, பல்கலைக்கழகம், முதலியன எனக்கு ஒரு டி.எம்.சி.ஏ அறிவிப்பை அனுப்பியது. நான் என்ன செய்ய வேண்டும்?

source: ### Should I contact the Tor developers when I have legal questions about Tor or to inform them if I suspect Tor is being used for illegal purposes?
ta: ### டோர் பற்றி சட்டரீதியான கேள்விகள் இருக்கும்போது டோர் டெவலப்பர்களைத் தொடர்பு கொள்ள வேண்டுமா அல்லது சட்டவிரோத நோக்கங்களுக்காக டோர் பயன்படுத்தப்படுவதாக நான் சந்தேகித்தால் அவர்களுக்குத் தெரிவிக்க வேண்டுமா?

source: ### Should I run an exit relay from my home?
ta: ### எனது வீட்டிலிருந்து வெளியேறும் ரிலேவை இயக்க வேண்டுமா?

source: ### Should I tell my ISP that I'm running an exit relay?
ta: ### நான் வெளியேறும் ரிலேவை இயக்குகிறேன் என்று எனது ISP க்கு சொல்ல வேண்டுமா?

source: ### Should I use Tor or encourage the use of Tor for illegal purposes?
ta: ### சட்டவிரோத நோக்கங்களுக்காக நான் TOR ஐப் பயன்படுத்த வேண்டுமா அல்லது TOR ஐப் பயன்படுத்த வேண்டுமா?

source: ### Will EFF represent me if I get in trouble for running a Tor relay?
ta: டோர் ரிலேவை இயக்குவதில் நான் சிக்கலில் சிக்கினால் ### EFF என்னை பிரதிநிதித்துவப்படுத்துமா?

source: * If possible, get an [ARIN](https://www.arin.net/) registration for your exit relay that displays contact information for you, not your ISP.
ta: * If possible, get an [ARIN](https://www.arin.net/) registration க்கு your exit அஞ்சல் சுருள் that displays தொடர்பு செய்தி க்கு you, not your ISP.

source: * Set up a notice like [this](https://blog.torproject.org/blog/tips-running-exit-node) to explain that you're running an exit relay that's part of the Tor network.
ta: * TOR நெட்வொர்க்கின் ஒரு பகுதியாக இருக்கும் வெளியேறும் ரிலேவை நீங்கள் இயக்குகிறீர்கள் என்பதை விளக்க [இது] (https://blog.torproject.org/blog/tips-running-exit-node போன்ற ஒரு அறிவிப்பை அமைக்கவும்.

source: * Set up a reverse DNS name for the IP address that makes clear that the computer is an exit relay.
ta: * கணினி ஒரு வெளியேறும் ரிலே என்பதை தெளிவுபடுத்தும் ஐபி முகவரிக்கு தலைகீழ் டிஎன்எச் பெயரை அமைக்கவும்.

source: **Although we are not aware of an individual being sued, prosecuted, or convicted for running a Tor relay**, law enforcement in the United States and other countries has occasionally mistakenly investigated individuals running a Tor relay.
ta: **Although we அரே not aware of an individual being sued, prosecuted, or convicted க்கு running a Tor relay**, law enforcement in the ஒன்றுபட்டது States and மற்றொன்று countries has occasionally mistakenly investigated individuals running a Tor relay.

source: **Educate them about Tor**. In most instances, properly configured Tor relays will have no useful data for inquiring parties, and you should feel free to educate them on this point.
ta: ** டோர் பற்றி அவர்களுக்கு கல்வி கற்பித்தல் **. பெரும்பாலான நிகழ்வுகளில், ஒழுங்காக உள்ளமைக்கப்பட்ட டோர் ரிலேக்கள் கட்சிகளை விசாரிப்பதற்கு பயனுள்ள தரவு இருக்காது, மேலும் இந்த கட்டத்தில் அவற்றைப் பயிற்றுவிக்க நீங்கள் தயங்க வேண்டும்.

source: **Maybe**. While EFF cannot promise legal representation for all Tor relay operators, it [will assist relay operators](https://www.eff.org/pages/legal-assistance) in assessing the situation and will try to locate qualified legal counsel when necessary.
ta: ** ஒருவேளை **. அனைத்து டோர் ரிலே ஆபரேட்டர்களுக்கும் சட்டப்பூர்வ பிரதிநிதித்துவத்தை EFF உறுதியளிக்க முடியாது என்றாலும், இது நிலைமையை மதிப்பிடுவதில் [ரிலே ஆபரேட்டர்களுக்கு உதவுகிறது] (https://www.eff.org/pages/legal-assistance) மற்றும் தேவைப்படும்போது தகுதிவாய்ந்த சட்ட ஆலோசனையை கண்டுபிடிக்க முயற்சிக்கும்.

source: **No**, this is risky and not recommended.
ta: ** இல்லை **, இது ஆபத்தானது மற்றும் பரிந்துரைக்கப்படவில்லை.

source: **No**. All new technologies create legal uncertainties, and Tor is no exception.
ta: ** இல்லை **. அனைத்து புதிய தொழில்நுட்பங்களும் சட்டரீதியான நிச்சயமற்ற தன்மைகளை உருவாக்குகின்றன, மேலும் டோர் விதிவிலக்கல்ல.

source: **No**. Although the developers attempt to verify that Tor relays listed in the directory maintained by the core developers are stable and have adequate bandwidth, neither they nor EFF can guarantee the personal trustworthiness or reliability of the individuals who run those relays.
ta: ** இல்லை **. கோர் டெவலப்பர்களால் பராமரிக்கப்படும் கோப்பகத்தில் பட்டியலிடப்பட்ட டோர் ரிலேக்கள் நிலையானவை மற்றும் போதுமான அலைவரிசை கொண்டவை என்பதை உருவாக்குபவர்கள் சரிபார்க்க முயற்சித்தாலும், அந்த ரிலேக்களை இயக்கும் நபர்களின் தனிப்பட்ட நம்பகத்தன்மை அல்லது நம்பகத்தன்மைக்கு அவர்களோ அல்லது EFF க்கு பொறுப்பு அளிக்கவோ முடியாது.

source: **No**. Tor has been developed to be a tool for free expression, privacy, and human rights. It is not a tool designed or intended to be used to break the law, either by Tor users or Tor relay operators.
ta: ** இல்லை **. TOR இலவச வெளிப்பாடு, தனியுரிமை மற்றும் மனித உரிமைகளுக்கான கருவியாக உருவாக்கப்பட்டுள்ளது. இது டோர் பயனர்கள் அல்லது டோர் ரிலே ஆபரேட்டர்களால் சட்டத்தை உடைக்க வடிவமைக்கப்பட்ட அல்லது பயன்படுத்தப்பட்ட ஒரு கருவி அல்ல.

source: **No**. Tor's developers are available to answer technical questions, but they are not lawyers and cannot give legal advice. Nor do they have any ability to prevent illegal activity that may occur through Tor relays.
ta: ** இல்லை **. தொழில்நுட்ப கேள்விகளுக்கு பதிலளிக்க டோரின் உருவாக்குபவர்கள் கிடைக்கின்றனர், ஆனால் அவர்கள் வழக்கறிஞர்கள் அல்ல, சட்ட ஆலோசனைகளை வழங்க முடியாது. டோர் ரிலேக்கள் மூலம் ஏற்படக்கூடிய சட்டவிரோத செயல்பாட்டைத் தடுக்க அவர்களுக்கு எந்த திறனும் இல்லை.

source: **No**. You may be technically capable of modifying the Tor source code or installing additional software to monitor or log plaintext that exits your relay.
ta: ** இல்லை **. டோர் மூலக் குறியீட்டை மாற்றியமைக்க அல்லது உங்கள் ரிலேவிலிருந்து வெளியேறும் எளிய உரையை கண்காணிக்க அல்லது பதிவு செய்ய கூடுதல் மென்பொருளை நிறுவுவதற்கு நீங்கள் தொழில்நுட்ப ரீதியாக திறன் கொண்டவராக இருக்கலாம்.
