Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: If you don't think you'll have time to format your report using the [User Research Reporting template](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/community/user_research_reporting.md), we will happily accept your findings another way - for example, you can take pictures or send us your raw notes.
ta: [பயனர் ஆராய்ச்சி அறிக்கையிடல் வார்ப்புரு] (https://gitlab.torproject.org/tpo/ux/research/-/blob/master/community/user_research_reporting.md) ஐப் பயன்படுத்தி உங்கள் அறிக்கையை வடிவமைக்க உங்களுக்கு நேரம் இருக்கும் என்று நீங்கள் நினைக்கவில்லை என்றால், உங்கள் கண்டுபிடிப்புகளை நாங்கள் மகிழ்ச்சியுடன் ஏற்றுக்கொள்வோம் - எடுத்துக்காட்டாக அல்லது நீங்கள் எடுத்துக்கொள்வோம்.

source: If you're planning to install any Tor software during your exercise or interviews you may need to download it before the session.
ta: உங்கள் உடற்பயிற்சி அல்லது நேர்காணல்களின் போது எந்த TOR மென்பொருளையும் நிறுவ திட்டமிட்டால், அமர்வுக்கு முன் அதை பதிவிறக்கம் செய்ய வேண்டியிருக்கும்.

source: It's easier to have this material printed and in hand, however if you prefer you can use digital copies instead.
ta: இந்த பொருளை அச்சிட்டு கையில் வைத்திருப்பது எளிதானது, இருப்பினும் நீங்கள் விரும்பினால் அதற்கு பதிலாக டிசிட்டல் நகல்களைப் பயன்படுத்தலாம்.

source: It's very important for us to hear back from you too.
ta: உங்களிடமிருந்தும் நாங்கள் மீண்டும் கேட்பது மிகவும் முதன்மை.

source: Join us at any time on our IRC channel #tor-ux or our [mailing list](https://lists.torproject.org/cgi-bin/mailman/listinfo/ux).
ta: எங்கள் ஐ.ஆர்.சி சேனல் #டோர்-யுஎக்ச் அல்லது எங்கள் [அஞ்சல் பட்டியல்] (https://lists.torproject.org/cgi-bin/mailman/listinfo/ux) இல் எந்த நேரத்திலும் எங்களுடன் சேருங்கள்.

source: Keep in mind that you might not have Internet access at the venue.
ta: அந்த இடத்தில் உங்களுக்கு இணைய அணுகல் இல்லை என்பதை நினைவில் கொள்ளுங்கள்.

source: Listening is a skill that helps build bridges. We believe this doesn't just apply to our services, but our communities too.
ta: கேட்பது பாலங்களை உருவாக்க உதவும் ஒரு திறமை. இது எங்கள் சேவைகளுக்கு மட்டும் பொருந்தாது என்று நாங்கள் நம்புகிறோம், ஆனால் எங்கள் சமூகங்களும் கூட.

source: Thank the participant for their willingness to participate and explain that we are testing the product, not them.
ta: பங்கேற்க பங்கேற்பாளருக்கு நன்றி மற்றும் நாங்கள் தயாரிப்பை சோதிக்கிறோம் என்பதை விளக்குங்கள், அவை அல்ல.

source: The interview should not last longer than 20 minutes.
ta: நேர்காணல் 20 நிமிடங்களுக்கு மேல் நீடிக்கக்கூடாது.

source: The two of you should work together to hand out post-its to the audience.
ta: நீங்கள் இருவரும் பார்வையாளர்களுக்கு பிந்தையதை ஒப்படைக்க ஒன்றிணைந்து செயல்பட வேண்டும்.

source: Their feedback can also take the form of questions - keep in mind that any feedback is a good feedback.
ta: அவர்களின் கருத்து கேள்விகளின் வடிவத்தையும் எடுக்கலாம் - எந்தவொரு கருத்தும் ஒரு நல்ல கருத்து என்பதை நினைவில் கொள்ளுங்கள்.

source: This way, we can learn how to facilitate better access to information through Tor. By listening, we learn.
ta: இந்த வழியில், டோர் மூலம் தகவல்களை சிறந்த அணுகலை எவ்வாறு எளிதாக்குவது என்பதை நாம் கற்றுக் கொள்ளலாம். கேட்பதன் மூலம், நாங்கள் கற்றுக்கொள்கிறோம்.

source: We don't keep or publish the names or contact details of research participants, and any time you're going to handle participant data (be it via impressions, survey submissions, or other records) you should ask for their consent in writing using the [consent form](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/scripts%20and%20activities/2021/consent_form.md) beforehand.
ta: ஆராய்ச்சி பங்கேற்பாளர்களின் பெயர்கள் அல்லது தொடர்பு விவரங்களை நாங்கள் வைத்திருக்கவோ வெளியிடவோ இல்லை, எந்த நேரத்திலும் நீங்கள் பங்கேற்பாளர் தரவைக் கையாளப் போகிறீர்கள் (இது பதிவுகள், கணக்கெடுப்பு சமர்ப்பிப்புகள் அல்லது பிற பதிவுகள் வழியாக இருக்கலாம்) [ஒப்புதலைப் பயன்படுத்தி அவர்களின் ஒப்புதலைக் கேட்க வேண்டும் படிவம்] (https://gitlab.torproject.org/tpo/ux/research/-/blob/master/scripts%20and%20Activities/2021/consent_form.md) முன்பே.

source: We want to know how the session was for you, how we can improve our support going forward, and if you plan to keep running user research for Tor in the future.
ta: அமர்வு உங்களுக்கானது, முன்னோக்கிச் செல்வதை நாங்கள் எவ்வாறு மேம்படுத்தலாம், எதிர்காலத்தில் TOR க்காக பயனர் ஆராய்ச்சியை இயக்க திட்டமிட்டால், நாங்கள் எவ்வாறு முன்னேற முடியும் என்பதை நாங்கள் அறிய விரும்புகிறோம்.

source: When the training commences, be sure to let everyone know your role and why you're taking notes during the session.
ta: பயிற்சி தொடங்கும் போது, உங்கள் பங்கை அனைவருக்கும் தெரியப்படுத்துங்கள், அமர்வின் போது நீங்கள் ஏன் குறிப்புகளை எடுத்துக்கொள்கிறீர்கள்.

source: While we're not interested in the specific characteristics of individual participants, it's important for us to be able to determine the reach of our training sessions, usability workshops and interviews.
ta: தனிப்பட்ட பங்கேற்பாளர்களின் குறிப்பிட்ட குணாதிசயங்களில் நாங்கள் ஆர்வம் காட்டவில்லை என்றாலும், எங்கள் பயிற்சி அமர்வுகள், பயன்பாட்டினை பட்டறைகள் மற்றும் நேர்காணல்களின் வரம்பை தீர்மானிக்க முடியும்.

source: You can take notes on the printed material you will carry with you, or on your computer.
ta: உங்களுடன் அல்லது உங்கள் கணினியில் நீங்கள் கொண்டு செல்லும் அச்சிடப்பட்ட பொருள் குறித்த குறிப்புகளை எடுக்கலாம்.

source: You don't have to do this alone - we can support you with meetings, guides, and mentorship too if you wish.
ta: நீங்கள் இதை மட்டும் செய்ய வேண்டியதில்லை - நீங்கள் விரும்பினால் கூட்டங்கள், வழிகாட்டிகள் மற்றும் வழிகாட்டுதலுடன் நாங்கள் உங்களுக்கு ஆதரவளிக்க முடியும்.

source: You'll also need to bring your chosen usability test and its accompanying methodology, if applicable.
ta: பொருந்தினால், நீங்கள் தேர்ந்தெடுத்த பயன்பாட்டினைப் பரிசோதனையையும் அதனுடன் கூடிய வழிமுறையையும் கொண்டு வர வேண்டும்.

source: Your agenda must be aligned and leave sufficient time to run your interviews or exercise at the end of the training session.
ta: உங்கள் நிகழ்ச்சி நிரல் சீரமைக்கப்பட வேண்டும் மற்றும் பயிற்சியின் முடிவில் உங்கள் நேர்காணல்களை அல்லது உடற்பயிற்சியை நடத்துவதற்கு போதுமான நேரத்தை விட்டுவிட வேண்டும்.

source: We collect only necessary data to improve our services.
ta: எங்கள் சேவைகளை மேம்படுத்த தேவையான தரவை மட்டுமே நாங்கள் சேகரிக்கிறோம்.

source: User Research Guidelines
ta: பயனர் ஆராய்ச்சி வழிகாட்டுதல்கள்

source: ## Checklist
ta: ## சரிபார்ப்பு பட்டியல்

source: ## Where to start
ta: ## எங்கு தொடங்குவது

source: ### Why do we run Demographics?
ta: ### நாங்கள் ஏன் புள்ளிவிவரங்களை இயக்குகிறோம்?

source: **Decision-making process.** We don't have a single model for decision making.
ta: ** முடிவெடுக்கும் செயல்முறை. ** முடிவெடுப்பதற்கான ஒரு மாதிரி எங்களிடம் இல்லை.

source: **Open source for privacy.**
ta: ** தனியுரிமைக்கான திறந்த மூல. **

source: **We don't track participants.** We care about your privacy and security.
ta: ** நாங்கள் பங்கேற்பாளர்களைக் கண்காணிக்கவில்லை. ** உங்கள் தனியுரிமை மற்றும் பாதுகாப்பைப் பற்றி நாங்கள் கவலைப்படுகிறோம்.

source: **We don't trick participants.** We don't use trick questions in our research.
ta: ** நாங்கள் பங்கேற்பாளர்களை ஏமாற்றவில்லை. ** எங்கள் ஆராய்ச்சியில் தந்திர கேள்விகளைப் பயன்படுத்துவதில்லை.

source: - Learn more about our users by reading [Tor's user personas](../personas/).
ta: - [டோரின் பயனர் நபர்கள்] (../ ஆளுமை/) படிப்பதன் மூலம் எங்கள் பயனர்களைப் பற்றி மேலும் அறிக.

source: - Open an issue in the [UX Research Repository](https://gitlab.torproject.org/tpo/ux/research/-/issues).
ta: - திற an சிக்கல் in the [UX Research Repository](https://gitlab.torproject.org/tpo/ux/research/-/issues).

source: - Read the guidelines on [how to do user research with Tor](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/README.md).
ta: - Read the guidelines on [how பெறுநர் do பயனர் research with Tor](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/README.md).

source: - Subscribe to the [UX mailing list](https://lists.torproject.org/cgi-bin/mailman/listinfo).
ta: - Subscribe பெறுநர் the [UX mailing list](https://lists.torproject.org/cgi-bin/mailman/listinfo).

source: Add the title of your research, then select the Usability Testing template option and fill it in.
ta: உங்கள் ஆராய்ச்சியின் தலைப்பைச் சேர்த்து, பின்னர் பயன்பாட்டினை சோதனை வார்ப்புரு விருப்பத்தைத் தேர்ந்தெடுத்து அதை நிரப்பவும்.

source: After choosing which study to run, open an issue in our [GitLab page](https://gitlab.torproject.org/tpo/ux/research).
ta: எந்த ஆய்வை இயக்க வேண்டும் என்பதைத் தேர்ந்தெடுத்த பிறகு, எங்கள் [GITLAB பக்கம்] (https://gitlab.torproject.org/tpo/ux/research) இல் ஒரு சிக்கலைத் திறக்கவும்.

source: After conducting your research, it's normal to be excited to see your feedback implemented as soon as possible.
ta: உங்கள் ஆராய்ச்சியை மேற்கொண்ட பிறகு, உங்கள் கருத்துக்களை விரைவில் செயல்படுத்துவதைக் கண்டு உற்சாகமாக இருப்பது இயல்பு.

source: As a transparent research space our surveys, studies, and reports are all public, and participants are free to view past studies prior to taking part - however they are not advised to do so.
ta: ஒரு வெளிப்படையான ஆராய்ச்சி இடமாக, எங்கள் ஆய்வுகள், ஆய்வுகள் மற்றும் அறிக்கைகள் அனைத்தும் பொதுவில் உள்ளன, மேலும் பங்கேற்பாளர்கள் பங்கேற்பதற்கு முன்னர் கடந்த கால ஆய்வுகளைப் பார்க்க சுதந்திரமாக உள்ளனர் - இருப்பினும் அவர்கள் அவ்வாறு செய்ய அறிவுறுத்தப்படவில்லை.

source: As a volunteer we also ask that you read and follow our [Code of Conduct](https://community.torproject.org/policies/code_of_conduct), as well our [Guidelines for Research](../guidelines/).
ta: ஒரு தன்னார்வலராக, எங்கள் [நடத்தை விதிமுறைகளை] (https://community.torproject.org/policies/code_of_conduct), அத்துடன் எங்கள் [ஆராய்ச்சிக்கான வழிகாட்டுதல்கள்] (../ வழிகாட்டுதல்கள்/) படித்து பின்பற்றும்படி கேட்டுக்கொள்கிறோம்.

source: However all feedback must be discussed internally across the different teams at the Tor Project first.
ta: இருப்பினும் அனைத்து கருத்துக்களும் முதலில் TOR திட்டத்தில் வெவ்வேறு அணிகள் முழுவதும் உள்நாட்டில் விவாதிக்கப்பட வேண்டும்.

source: If this is your first time running a User Research session for the Tor Project, we recommend starting with one of these studies. Both can be conducted on a rolling basis and ran remotely.
ta: TOR திட்டத்திற்கான பயனர் ஆராய்ச்சி அமர்வை இயக்குவது இது முதல் முறையாக இருந்தால், இந்த ஆய்வுகளில் ஒன்றைத் தொடங்க பரிந்துரைக்கிறோம். இரண்டையும் உருட்டல் அடிப்படையில் நடத்தலாம் மற்றும் தொலைதூரத்தில் ஓடலாம்.

source: If we invite you to participate in a study, we won't track you and any recordings will be erased after the report is complete.
ta: ஒரு ஆய்வில் பங்கேற்க நாங்கள் உங்களை அழைத்தால், நாங்கள் உங்களைக் கண்காணிக்க மாட்டோம், அறிக்கை முடிந்ததும் எந்த பதிவுகளும் அழிக்கப்படும்.

source: If you're already familiar with the Tor Project and user testing, have a look at our [current needs for user research](../open/) and see which study better suits you.
ta: டோர் திட்டம் மற்றும் பயனர் சோதனையை நீங்கள் ஏற்கனவே அறிந்திருந்தால், எங்கள் [பயனர் ஆராய்ச்சிக்கான தற்போதைய தேவைகள்] (../ திறந்த/) ஐப் பாருங்கள், எந்த ஆய்வு உங்களுக்கு மிகவும் பொருத்தமானது என்பதைப் பாருங்கள்.

source: In addition, collecting these demographics is required for specific studies to support human rights.
ta: கூடுதலாக, மனித உரிமைகளை ஆதரிக்க குறிப்பிட்ட ஆய்வுகளுக்கு இந்த புள்ளிவிவரங்களை சேகரிப்பது தேவை.

source: Not all of the data collected in our research is disclosed to the public, but our general findings are.
ta: எங்கள் ஆராய்ச்சியில் சேகரிக்கப்பட்ட எல்லா தரவுகளும் பொதுமக்களுக்கு வெளிப்படுத்தப்படவில்லை, ஆனால் எங்கள் பொதுவான கண்டுபிடிப்புகள்.

source: Please read our [Guidelines](../guidelines/) to get to know this process more.
ta: இந்த செயல்முறையை மேலும் அறிய எங்கள் [வழிகாட்டுதல்கள்] (../ வழிகாட்டுதல்கள்/) ஐப் படிக்கவும்.

source: Please remember to update the issue as your research evolves.
ta: உங்கள் ஆராய்ச்சி உருவாகும்போது சிக்கலைப் புதுப்பிக்க நினைவில் கொள்க.

source: Remember to drop us an email telling us about your plans so we can follow and support your research.
ta: உங்கள் திட்டங்களைப் பற்றி எங்களிடம் சொல்லும் மின்னஞ்சலை எங்களுக்கு அனுப்ப நினைவில் கொள்ளுங்கள், எனவே உங்கள் ஆராய்ச்சியை நாங்கள் பின்பற்றி ஆதரிக்கலாம்.

source: This means that it's often necessary to run the same research more than once to validate your findings, and meet the expectations of the engineers, developers, designers, researchers and others at Tor.
ta: இதன் பொருள், உங்கள் கண்டுபிடிப்புகளை சரிபார்க்க அதே ஆராய்ச்சியை ஒன்றுக்கு மேற்பட்ட முறை இயக்குவது மற்றும் பொறியாளர்கள், உருவாக்குபவர்கள், வடிவமைப்பாளர்கள், ஆராய்ச்சியாளர்கள் மற்றும் TOR இல் உள்ள பிறரின் எதிர்பார்ப்புகளை நிறைவு செய்வது பெரும்பாலும் தேவை.

source: To protect our participants' privacy we take care to anonymize their responses and avoid recording our sessions.
ta: எங்கள் பங்கேற்பாளர்களின் தனியுரிமையைப் பாதுகாக்க, அவர்களின் பதில்களை அநாமதேயமாக்குவதற்கும், எங்கள் அமர்வுகளைப் பதிவு செய்வதையும் தவிர்க்கவும் நாங்கள் கவனித்துக்கொள்கிறோம்.

source: We advise volunteers not to record their sessions at all.
ta: தன்னார்வலர்கள் தங்கள் அமர்வுகளை பதிவு செய்ய வேண்டாம் என்று நாங்கள் அறிவுறுத்துகிறோம்.

source: We also ask anyone running research not use software hosted by third parties like cloud providers.
ta: முகில் வழங்குநர்கள் போன்ற மூன்றாம் தரப்பினரால் வழங்கப்பட்ட மென்பொருளைப் பயன்படுத்த வேண்டாம் என்று ஆராய்ச்சியை இயக்கும் எவரையும் நாங்கள் கேட்கிறோம்.

source: We believe it's important to collect basic demographics to help us understand if we are meeting our mission regarding diversity and inclusion.
ta: பன்முகத்தன்மை மற்றும் சேர்த்தல் தொடர்பான எங்கள் பணியை நாங்கள் சந்திக்கிறீர்களா என்பதைப் புரிந்துகொள்ள உதவும் அடிப்படை புள்ளிவிவரங்களை சேகரிப்பது முதன்மை என்று நாங்கள் நம்புகிறோம்.

source: We don't collect personal data in our [Demographics](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/scripts%20and%20activities/2020/user_demographics-en.md), and all questions are optional.
ta: எங்கள் [புள்ளிவிவரங்கள்](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/scripts%20and%20activities/2020/user_demographics-en.md) இல் தனிப்பட்ட தரவை நாங்கள் சேகரிக்கவில்லை, மேலும் அனைத்து கேள்விகளும் விருப்பமானவை.

source: We expect participants to be honest with us, and we must be honest about our questions in return.
ta: பங்கேற்பாளர்கள் எங்களுடன் நேர்மையாக இருப்பார்கள் என்று நாங்கள் எதிர்பார்க்கிறோம், பதிலுக்கு எங்கள் கேள்விகளைப் பற்றி நாங்கள் நேர்மையாக இருக்க வேண்டும்.

source: We use free and open source software to analyze our data, and we recommend our volunteers do the same.
ta: எங்கள் தரவை பகுப்பாய்வு செய்ய இலவச மற்றும் திறந்த மூல மென்பொருளைப் பயன்படுத்துகிறோம், மேலும் எங்கள் தன்னார்வலர்களும் இதைச் செய்ய பரிந்துரைக்கிறோம்.

source: We care about privacy and security.
ta: தனியுரிமை மற்றும் பாதுகாப்பைப் பற்றி நாங்கள் கவலைப்படுகிறோம்.

source: How to Volunteer
ta: தன்னார்வத் தொண்டு செய்வது எப்படி

source: ### Emma
ta: ### எம்மா

source: ### Tor Browser for Android
ta: ### ஆண்ட்ராய்டு க்கான டோர் உலாவி

source: ### Tor Browser for Desktop
ta: டெச்க்டாப்பிற்கான ### டோர் உலாவி

source: * [Run Emma Network Test](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/scripts%20and%20activities/2020/run-emma.md)
ta: * [Run Emma பிணையம் Test](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/scripts%20and%20activities/2020/run-emma.md)

source: Before running Tor user research, be sure you read our [Guidelines to becoming a user researcher with Tor](../guidelines/).
ta: டோர் பயனர் ஆராய்ச்சியை இயக்குவதற்கு முன், டோர் உடன் பயனர் ஆராய்ச்சியாளராக மாறுவதற்கான எங்கள் வழிகாட்டுதல்களை நீங்கள் படித்திருக்கிறீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்] (../ வழிகாட்டுதல்கள்/).

source: These are our current needs for testing Tor products, as well as methodologies and testing scripts.
ta: TOR தயாரிப்புகளைச் சோதிப்பதற்கான எங்கள் தற்போதைய தேவைகள், அத்துடன் முறைகள் மற்றும் ச்கிரிப்ட்களை சோதனை செய்தல்.

source: We put our users in the center of our development process. That is how we bring privacy-enhancing technology to the ones who more need it. Explore what we are working on and start to run user research with your local community.
ta: எங்கள் பயனர்களை எங்கள் மேம்பாட்டு செயல்முறையின் மையத்தில் வைக்கிறோம். தனியுரிமையை அதிகரிக்கும் தொழில்நுட்பத்தை நாங்கள் அதிகம் தேவைப்படுபவர்களுக்கு கொண்டு வருகிறோம். நாங்கள் என்ன வேலை செய்கிறோம் என்பதை ஆராய்ந்து, உங்கள் உள்ளக சமூகத்துடன் பயனர் ஆராய்ச்சியை இயக்கத் தொடங்குங்கள்.

source: Open User Research
ta: பயனர் ஆராய்ச்சியைத் திறக்கவும்

source: ## Second generation
ta: ## இரண்டாம் தலைமுறை

source: ## Third generation
ta: ## மூன்றாம் தலைமுறை

source: * Aleisha, the privacy seeker: [View on Gitlab](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/personas/aleisha.pdf) · [Download PDF](https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/aleisha.pdf)
ta: . PDF] (https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/aleisha.pdf)

source: * Alex, the fearless journalist: [View on Gitlab](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/personas/alex.pdf) · [Download PDF](https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/alex.pdf)
ta: . PDF] (https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/alex.pdf)

source: * Daniel, the exiled journalist: [View on Gitlab](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/personas/daniel.pdf) · [Download PDF](https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/daniel.pdf)
ta: . PDF] (https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/daniel.pdf)

source: * Fatima, the censored user: [View on Gitlab](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/personas/fatima.pdf) · [Download PDF](https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/fatima.pdf)
ta: . PDF] (https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/fatima.pdf)

source: * Felix, the determined teacher: [View on Gitlab](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/personas/felix.pdf) · [Download PDF](https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/felix.pdf)
ta: . PDF] (https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/felix.pdf)

source: * Fernanda, the feminist activist: [View on Gitlab](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/personas/fernanda.pdf) · [Download PDF](https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/fernanda.pdf)
ta: . PDF] (https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/fernanda.pdf)

source: * Ifeanyi, the resolute reporter: [View on Gitlab](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/personas/ifeanyi.pdf) · [Download PDF](https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/ifeanyi.pdf)
ta: . PDF] (https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/ifanyi.pdf)

source: * Jelani, the human rights defender: [View on Gitlab](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/personas/jelani.pdf) · [Download PDF](https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/jelani.pdf)
ta: . PDF] (https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/jelani.pdf)

source: * Rosa, the transfeminist campaigner: [View on Gitlab](https://gitlab.torproject.org/tpo/ux/research/-/blob/master/personas/rosa.pdf) · [Download PDF](https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/rosa.pdf)
ta: . PDF] (https://gitlab.torproject.org/tpo/ux/research/-/raw/master/personas/rosa.pdf)

source: As such, these personas are due to be replaced in the near future.
ta: எனவே, இந்த நபர்கள் எதிர்காலத்தில் மாற்றப்பட உள்ளனர்.

source: Following a series of digital security workshops and usability testing sessions in Brazil, Ecuador & Mexico from 2021–2023, we consolidated much of what we learned into a further two personas:
ta: 2021–2023 முதல் பிரேசில், ஈக்வடார் மற்றும் மெக்சிகோவில் தொடர்ச்சியான டிசிட்டல் பாதுகாப்பு பட்டறைகள் மற்றும் பயன்பாட்டினை சோதனை அமர்வுகளைத் தொடர்ந்து, நாங்கள் கற்றுக்கொண்டவற்றில் பெரும்பகுதியை மேலும் இரண்டு நபர்களாக ஒருங்கிணைத்தோம்:

source: However as of 2023, some of the information presented in them (e.g. the social/political context and state of censorship in some countries) may be out of date.
ta: எவ்வாறாயினும், 2023 ஆம் ஆண்டு நிலவரப்படி, அவற்றில் வழங்கப்பட்ட சில தகவல்கள் (எ.கா. சில நாடுகளில் சமூக/அரசியல் சூழல் மற்றும் தணிக்கை நிலை) காலாவதியானதாக இருக்கலாம்.

source: In 2020, as part of a wider project on censorship circumvention, we created two additional personas set in the context of contemporary internet censorship events in West Africa:
ta: 2020 ஆம் ஆண்டில், தணிக்கை சுற்றறிக்கை குறித்த பரந்த திட்டத்தின் ஒரு பகுதியாக, மேற்கு ஆபிரிக்காவில் சமகால இணைய தணிக்கை நிகழ்வுகளின் பின்னணியில் அமைக்கப்பட்ட இரண்டு கூடுதல் நபர்களை நாங்கள் உருவாக்கினோம்:

source: The first generation of Tor personas were created following a series of field studies in the Global South from 2018 to 2019, where we were fortunate to meet many different kinds of Tor users – including activists, journalists and other human rights defenders.
ta: 2018 முதல் 2019 வரை உலகளாவிய தெற்கில் தொடர்ச்சியான கள ஆய்வுகளைத் தொடர்ந்து முதல் தலைமுறை டோர் நபர்கள் உருவாக்கப்பட்டன, அங்கு ஆர்வலர்கள், பத்திரிகையாளர்கள் மற்றும் பிற மனித உரிமை பாதுகாவலர்கள் உட்பட பல வகையான டோர் பயனர்களை சந்திக்க எங்களுக்கு அதிர்ச்டம் இருந்தது.

source: They help foster empathy by encouraging our developers to better understand the motivations, pain points and goals of our users.
ta: எங்கள் பயனர்களின் உந்துதல்கள், வலி புள்ளிகள் மற்றும் குறிக்கோள்களை நன்கு புரிந்துகொள்ள எங்கள் டெவலப்பர்களை ஊக்குவிப்பதன் மூலம் அவை பச்சாத்தாபத்தை வளர்க்க உதவுகின்றன.

source: User personas are a key component of our human-centered design process.
ta: பயனர் நபர்கள் எங்கள் மனிதனை மையமாகக் கொண்ட வடிவமைப்பு செயல்முறையின் முக்கிய அங்கமாகும்.

source: User personas are a key component of our human-centered design process that help us communicate the motivations, pain points and goals of our users.
ta: பயனர் நபர்கள் எங்கள் மனிதனை மையமாகக் கொண்ட வடிவமைப்பு செயல்முறையின் முக்கிய அங்கமாகும், இது எங்கள் பயனர்களின் உந்துதல்கள், வலி புள்ளிகள் மற்றும் குறிக்கோள்களைத் தொடர்பு கொள்ள உதவுகிறது.

source: Tor Personas
ta: மக்கள்

source: ### Community Research
ta: ### சமூக ஆராய்ச்சி

source: | Project | Methodology | Locations | Dates | Reporting |
ta: | திட்டம் | முறை | இடங்கள் | தேதிகள் | அறிக்கை |

source: We are committed to open design, so you can see the user research we have conducted within our community.
ta: திறந்த வடிவமைப்பில் நாங்கள் கடமைப்பட்டுள்ளோம், எனவே எங்கள் சமூகத்திற்குள் நாங்கள் நடத்திய பயனர் ஆராய்ச்சியை நீங்கள் காணலாம்.

source: Reports
ta: அறிக்கைகள்

source: #tor-relays
ta: #டோர்-ரிலேச்

source: (None)
ta: (எதுவும்)

source: A better world is possible when you invest in tools that prioritize your privacy over profit. Donate to Tor today.
ta: லாபத்தை விட உங்கள் தனியுரிமைக்கு முன்னுரிமை அளிக்கும் கருவிகளில் நீங்கள் முதலீடு செய்யும்போது ஒரு சிறந்த உலகம் சாத்தியமாகும். இன்று TOR க்கு நன்கொடை.

source: About
ta: பற்றி

source: Activism
ta: செயல்பாடு

source: Alexa Top Sites Captcha and Tor Block Monitoring
ta: அலெக்சா சிறந்த தளங்கள் கேப்ட்சா மற்றும் டோர் பிளாக் கண்காணிப்பு

source: Anti-Censorship
ta: சென்சார்சிப் எதிர்ப்பு

source: Are you a design researcher, user researcher, student, or someone interested in learning more about Tor users? Do you have new ideas, suggestions, or research that can help improve Tor applications? Help us by coordinating user research with your local community, and learn more about best practices for working with users at-risk.
ta: நீங்கள் ஒரு வடிவமைப்பு ஆராய்ச்சியாளர், பயனர் ஆராய்ச்சியாளர், மாணவர் அல்லது டோர் பயனர்களைப் பற்றி மேலும் அறிய ஆர்வமுள்ள ஒருவரா? TOR பயன்பாடுகளை மேம்படுத்த உதவும் புதிய சிந்தனைகள், பரிந்துரைகள் அல்லது ஆராய்ச்சி உங்களிடம் உள்ளதா? உங்கள் உள்ளக சமூகத்துடன் பயனர் ஆராய்ச்சியை ஒருங்கிணைப்பதன் மூலம் எங்களுக்கு உதவுங்கள், மேலும் ஆபத்தில் உள்ள பயனர்களுடன் பணியாற்றுவதற்கான சிறந்த நடைமுறைகளைப் பற்றி மேலும் அறிக.
