Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: If you run it behind a consumer-level router at home you will have to try and see if your home router can handle it or if it starts failing.
ta: வீட்டில் ஒரு நுகர்வோர் அளவிலான திசைவிக்கு பின்னால் நீங்கள் அதை இயக்கினால், உங்கள் வீட்டு திசைவி அதைக் கையாள முடியுமா அல்லது தோல்வியடையத் தொடங்குகிறதா என்று நீங்கள் முயற்சி செய்ய வேண்டும்.

source: If you want to run more than eight relays you will need more IPv4 addresses.
ta: நீங்கள் எட்டு ரிலேக்களுக்கு மேல் இயக்க விரும்பினால் உங்களுக்கு அதிக ஐபிவி 4 முகவரிகள் தேவைப்படும்.

source: It is recommended that a relay have at least 16 Mbit/s (Mbps) upload bandwidth and 16 Mbit/s (Mbps) download bandwidth available for Tor. More is better.
ta: ஒரு ரிலேக்கு குறைந்தது 16 mbit/s (Mbps) பதிவேற்ற அலைவரிசை மற்றும் 16 Mbit/s (Mbps) டாருக்கு கிடைக்கக்கூடிய அலைவரிசையை பதிவிறக்கம் செய்ய பரிந்துரைக்கப்படுகிறது. மேலும் சிறந்தது.

source: It is required that a Tor relay be allowed to use a minimum of 100 GByte of outbound traffic (and the same amount of incoming traffic) per month.
ta: ஒரு டோர் ரிலே மாதத்திற்கு குறைந்தபட்சம் 100 சிபிஇட்டை வெளிச்செல்லும் போக்குவரத்தை (மற்றும் உள்வரும் போக்குவரத்தின் அதே அளவு) பயன்படுத்த அனுமதிக்க வேண்டும்.

source: More (>2 TB/month) is better and recommended.
ta: மேலும் (> 2 காசநோய்/மாதம்) சிறந்தது மற்றும் பரிந்துரைக்கப்படுகிறது.

source: Note: That is only about 1 day worth of traffic on a 10 Mbit/s (Mbps) connection.
ta: குறிப்பு: இது 10 MBIT/S (MBPS) இணைப்பில் சுமார் 1 நாள் மதிப்புள்ள போக்குவரத்து மட்டுமே.

source: Note: You can only run [eight Tor relays](https://lists.torproject.org/pipermail/tor-relays/2023-June/021226.html) per public IPv4 address.
ta: குறிப்பு: பொது ஐபிவி 4 முகவரிக்கு நீங்கள் [எட்டு டோர் ரிலேக்கள்] (https://lists.torproject.org/pipermail/tor-relays/2023-june/021226.html) ஐ மட்டுமே இயக்க முடியும்.

source: Reboots and tor daemon restarts are fine.
ta: மறுதொடக்கங்கள் மற்றும் டோர் டீமான் மறுதொடக்கங்கள் நன்றாக உள்ளன.

source: Requirements for Tor relays depend on the type of relay and the bandwidth they provide.
ta: டோர் ரிலேக்களுக்கான தேவைகள் ரிலே வகை மற்றும் அவை வழங்கும் அலைவரிசை ஆகியவற்றைப் பொறுத்தது.

source: Similar requirements to a Guard/Middle relay plus
ta: ஒரு காவலர்/நடுத்தர ரிலே பிளசுக்கு ஒத்த தேவைகள்

source: The IPv4 address is not required to be static but static IP addresses are preferred.
ta: ஐபிவி 4 முகவரி நிலையானதாக இருக்க தேவையில்லை, ஆனால் நிலையான ஐபி முகவரிகள் விரும்பப்படுகின்றன.

source: The minimum requirements for a relay are 10 Mbit/s (Mbps).
ta: ரிலேவுக்கான குறைந்தபட்ச தேவைகள் 10 Mbit/s (MBPS).

source: There should be no problem at all with this requirement (all commercially available servers come with at least one IPv4 address).
ta: இந்த தேவையில் எந்த பிரச்சனையும் இருக்கக்கூடாது (வணிக ரீதியாக கிடைக்கக்கூடிய அனைத்து சேவையகங்களும் குறைந்தது ஒரு ஐபிவி 4 முகவரியுடன் வருகின்றன).

source: This can overwhelm consumer-level routers. If you run the Tor relay from a server (virtual or dedicated) in a data center you will be fine.
ta: இது நுகர்வோர்-நிலை திசைவிகளை மூழ்கடிக்கும். தரவு மையத்தில் ஒரு சேவையகத்திலிருந்து (மெய்நிகர் அல்லது அர்ப்பணிப்பு) டோர் ரிலேவை இயக்கினால் நீங்கள் நன்றாக இருப்பீர்கள்.

source: Tor does not need much disk storage.
ta: TOR க்கு அதிக வட்டு சேமிப்பு தேவையில்லை.

source: Tor has no hard uptime requirement but if your relay is not running for more than 2 hours a day its usefulness is limited.
ta: TOR க்கு கடினமான நேர தேவை இல்லை, ஆனால் உங்கள் ரிலே ஒரு நாளைக்கு 2 மணி நேரத்திற்கு மேல் இயங்கவில்லை என்றால் அதன் பயன் குறைவாகவே இருக்கும்.

source: Your IPv4 address should remain unchanged for at least 3 hours (if it regularly changes more often than that, it does not make much sense to run a relay or bridge there since it takes time to distribute the new list of relay IPs to clients - which happens only once every hour).
ta: உங்கள் ஐபிவி 4 முகவரி குறைந்தது 3 மணிநேரங்களுக்கு மாறாமல் இருக்க வேண்டும் (அதை விட அடிக்கடி மாறினால், ரிலே அல்லது பாலத்தை இயக்குவதற்கு அதிக அர்த்தமில்லை, ஏனெனில் ரிலே ஐபிக்களின் புதிய பட்டியலை வாடிக்கையாளர்களுக்கு விநியோகிக்க நேரம் எடுக்கும் - இது ஒவ்வொரு மணி நேரத்திற்கும் ஒரு முறை மட்டுமே நடக்கும்).

source: Requirements for Tor relays depend on the type of relay and the bandwidth they provide. Learn more about specific relay requirements.
ta: டோர் ரிலேக்களுக்கான தேவைகள் ரிலே வகை மற்றும் அவை வழங்கும் அலைவரிசை ஆகியவற்றைப் பொறுத்தது. குறிப்பிட்ட ரிலே தேவைகள் பற்றி மேலும் அறிக.

source: Relay requirements
ta: ரிலே தேவைகள்

source: # "Ext" means "extended", not "external". Don't try to set a specific port
ta: # "Ext" என்றால் "நீட்டிக்கப்பட்ட", "வெளிப்புறம்" அல்ல. ஒரு குறிப்பிட்ட துறைமுகத்தை அமைக்க முயற்சிக்காதீர்கள்

source: # Avoid port 9001 because it's commonly associated with
ta: # துறைமுகம் 9001 ஐத் தவிர்க்கவும், ஏனெனில் இது பொதுவாக தொடர்புடையது

source: # Local communication port between Tor and obfs4. Always set this to "auto".
ta: # TOR மற்றும் OBFS4 க்கு இடையில் உள்ளக தகவல்தொடர்பு துறைமுகம். எப்போதும் இதை "ஆட்டோ" ஆக அமைக்கவும்.

source: # Pick a nickname that you like for your bridge. This is optional.
ta: # உங்கள் பாலத்திற்கு நீங்கள் விரும்பும் புனைப்பெயரைத் தேர்ந்தெடுக்கவும். இது விருப்பமானது.

source: # Replace "<address@email.com>" with your email address so we can contact you if
ta: # உங்கள் மின்னஞ்சல் முகவரியுடன் "<setrody@email.com>" ஐ மாற்றவும், எனவே நாங்கள் உங்களை தொடர்பு கொள்ளலாம் என்றால் நாங்கள் உங்களை தொடர்பு கொள்ளலாம்

source: # Replace "TODO1" with a Tor port of your choice. This port must be externally
ta: # "TODO1" ஐ நீங்கள் விரும்பும் ஒரு TOR துறைமுகத்துடன் மாற்றவும். இந்த துறைமுகம் வெளிப்புறமாக இருக்க வேண்டும்

source: # Replace "TODO2" with an obfs4 port of your choice. This port must be
ta: # "TODO2" ஐ நீங்கள் விரும்பும் OBFS4 துறைமுகத்துடன் மாற்றவும். இந்த துறைமுகம் இருக்க வேண்டும்

source: # Tor and censors may be scanning the Internet for this port.
ta: # டோர் மற்றும் தணிக்கைகள் இந்த துறைமுகத்திற்கு இணையத்தை ச்கேன் செய்யலாம்.

source: # censors may be scanning the Internet for this port.
ta: # தணிக்கைகள் இந்த துறைமுகத்திற்கான இணையத்தை ச்கேன் செய்யலாம்.

source: # externally reachable and must be different from the one specified for ORPort.
ta: # வெளிப்புறமாக அடையக்கூடியது மற்றும் ஆர்போர்ட்டுக்கு குறிப்பிடப்பட்டவற்றிலிருந்து வேறுபட்டதாக இருக்க வேண்டும்.

source: # number, nor listen on 0.0.0.0.
ta: # எண், அல்லது 0.0.0.0 இல் கேட்கவும்.

source: # reachable. Avoid port 9001 because it's commonly associated with Tor and
ta: # அடையக்கூடியது. துறைமுகம் 9001 ஐத் தவிர்க்கவும், ஏனெனில் இது பொதுவாக TOR உடன் தொடர்புடையது

source: # there are problems with your bridge. This is optional but encouraged.
ta: # உங்கள் பாலத்தில் சிக்கல்கள் உள்ளன. இது விருப்பமானது ஆனால் ஊக்குவிக்கப்படுகிறது.

source: ### 1. Enable Automatic Software Updates
ta: ### 1. தானியங்கி மென்பொருள் புதுப்பிப்புகளை இயக்கவும்

source: ### 2. Install `tor`
ta: ### 2. `TOR` ஐ நிறுவவும்

source: ### 3. Install a Pluggable Transport
ta: ### 3. ஒரு சொருகக்கூடிய போக்குவரத்தை நிறுவவும்

source: ### 5. Enable and Start `tor`
ta: ### 5. `TOR` ஐ இயக்கவும் தொடங்கவும்

source: ### 6. Final Notes
ta: ### 6. இறுதி குறிப்புகள்

source: * **DISCLAIMER:** _AUR_ packages are user produced content. Any use of the provided files is at your own risk.
ta: *** மறுப்பு: ** _AUR_ தொகுப்புகள் பயனர் தயாரிக்கப்பட்ட உள்ளடக்கம். வழங்கப்பட்ட கோப்புகளின் எந்த பயன்பாடும் உங்கள் சொந்த ஆபத்தில் உள்ளது.

source: * If you decide to use a fixed obfs4 port smaller than 1024 (for example 80 or 443), you will need to give obfs4 `CAP_NET_BIND_SERVICE` capabilities to bind the port with a non-root user:
ta: * நீங்கள் 1024 ஐ விடச் சிறிய நிலையான obfs4 போர்ட்டைப் பயன்படுத்த முடிவு செய்தால் (எடுத்துக்காட்டாக 80 அல்லது 443), ரூட் அல்லாத பயனருடன் போர்ட்டை பிணைக்க obfs4 `CAP_NET_BIND_SERVICE` திறன்களை நீங்கள் வழங்க வேண்டும்:

source: * Note that both Tor's OR port and its obfs4 port must be reachable. If your bridge is behind a firewall or NAT, make sure to open both ports. You can use [our reachability test](https://bridges.torproject.org/scan/) to see if your obfs4 port is reachable from the Internet.
ta: * டோர் அல்லது துறைமுகம் மற்றும் அதன் OBFS4 துறைமுகம் இரண்டையும் அடைய வேண்டும் என்பதை நினைவில் கொள்க. உங்கள் பாலம் ஒரு ஃபயர்வால் அல்லது NAT க்கு பின்னால் இருந்தால், இரு துறைமுகங்களையும் திறக்க உறுதிசெய்க. உங்கள் OBFS4 துறைமுகம் இணையத்திலிருந்து அடைய முடியுமா என்பதைப் பார்க்க நீங்கள் [எங்கள் அணுகல் சோதனை] (https://bridges.torproject.org/scan/) ஐப் பயன்படுத்தலாம்.

source: ContactInfo <address@email.com>
ta: ContactInfo <derty@email.com>

source: Don't forget to change the `ORPort`, `ServerTransportListenAddr`, `ContactInfo`, and `Nickname` options.
ta: `Orport`,` ServerTransportListenaddr`, `ContactInfo`, மற்றும்` புனைப்பெயர்` விருப்பங்களை மாற்ற மறக்காதீர்கள்.

source: Follow the instructions to enable automatic software updates for your operating system.
ta: உங்கள் இயக்க முறைமைக்கு தானியங்கி மென்பொருள் புதுப்பிப்புகளை இயக்க வழிமுறைகளைப் பின்பற்றவும்.

source: For more information on installing or building `lyrebird` from source, please refer to its [official documentation](https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/lyrebird#installation).
ta: மூலத்திலிருந்து `லைரெபேர்ட்` ஐ நிறுவுதல் அல்லது உருவாக்குவது பற்றிய கூடுதல் தகவலுக்கு, தயவுசெய்து அதன் [அதிகாரப்பூர்வ ஆவணங்கள்] (https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/lyrebird#installation) ஐப் பார்க்கவும்.

source: If you are having trouble setting up your bridge, have a look at [our help section](../../../getting-help/).
ta: உங்கள் பாலத்தை அமைப்பதில் சிக்கல் இருந்தால், [எங்கள் உதவி பிரிவு] (../../../ gets-help/) ஐப் பாருங்கள்.

source: If your bridge is now running, check out the [post-install notes](../post-install/).
ta: உங்கள் பாலம் இப்போது இயங்கினால், [நிறுவப்பட்ட பிந்தைய குறிப்புகள்] (../ போச்ட்-இன்ச்டால்/) ஐப் பாருங்கள்.

source: One of the most important things to keep your relay secure is to install security updates timely and ideally automatically so you can not forget about it.
ta: உங்கள் ரிலேவை பாதுகாப்பாக வைத்திருக்க மிக முக்கியமான விசயங்களில் ஒன்று, பாதுகாப்பு புதுப்பிப்புகளை சரியான நேரத்தில் மற்றும் தானாகவே நிறுவுவது, எனவே அதை நீங்கள் மறந்துவிட முடியாது.

source: Sadly there's no package available on Arch Linux's official repositories to install it, so we must either build it from source, or use the AUR (ArchLinux User Repository).
ta: துரதிர்ச்டவசமாக அதை நிறுவ ஆர்ச் லினக்சின் அதிகாரப்பூர்வ களஞ்சியங்களில் எந்த தொகுப்பும் கிடைக்கவில்லை, எனவே நாங்கள் அதை மூலத்திலிருந்து உருவாக்க வேண்டும், அல்லது அவுர் (Acallinux பயனர் களஞ்சியத்தை) பயன்படுத்த வேண்டும்.

source: Should you opted to use AUR, once `makepkg` must not run as **root**, here is how `obfs4proxy` can be installed on Arch Linux using an unprivileged user account with `sudo` permissions:
ta: `Makepkg` ** ரூட் ** ஆக இயங்கக்கூடாது என்று நீங்கள் அவுர் ஐப் பயன்படுத்த விரும்பினால்,` sudo` அனுமதிகள் கொண்ட ஒரு பொருத்தமற்ற பயனர் கணக்கைப் பயன்படுத்தி ஆர்ச் லினக்சில் `obfs4proxy` ஐ எவ்வாறு நிறுவ முடியும் என்பது இங்கே:

source: To install the `tor` package on Arch Linux, please run:
ta: ஆர்ச் லினக்சில் `டோர்` தொகுப்பை நிறுவ, தயவுசெய்து இயக்கவும்:

source: To work around systemd hardening, you will also need to set `NoNewPrivileges=no` in `/usr/lib/systemd/system/tor.service` and then run `systemctl daemon-reload`. For more details, see [ticket 18356](https://gitlab.torproject.org/tpo/core/tor/-/issues/18356).
ta: சிச்டம் டி ஆர்டனிங்கைச் சுற்றி வேலை செய்ய, நீங்கள் `/usr/lib/systemd/system/tor.service` இல்` NoNewPrivileges=no` ஐ அமைத்து, பின்னர் `systemctl daemon-reload` ஐ இயக்க வேண்டும். மேலும் விவரங்களுக்கு, [டிக்கெட் 18356](https://gitlab.torproject.org/tpo/core/tor/-/issues/18356)ஐப் பார்க்கவும்.

source: We are opting here to install and use `obfs4` as pluggable transport, so we are going to install `obfs4proxy`.
ta: `OBFS4` ஐ சொருகக்கூடிய போக்குவரமாக நிறுவவும் பயன்படுத்தவும் நாங்கள் இங்கே தேர்வு செய்கிறோம், எனவே நாங்கள்` OBFS4Proxy` ஐ நிறுவப் போகிறோம்.

source: Bridge
ta: பாலம்

source: How to deploy an obfs4 bridge on Arch Linux
ta: ஆர்ச் லினக்சில் ஒரு OBFS4 பாலத்தை எவ்வாறு பயன்படுத்துவது

source: Arch Linux
ta: ஆர்ச் லினக்ச்

source: ### 2. Install `epel-release`
ta: ### 2. `EPEL-RELEASE` ஐ நிறுவவும்

source: ### 3. Configure Tor Project's Repository
ta: ### 3. டோர் திட்டத்தின் களஞ்சியத்தை உள்ளமைக்கவும்

source: ### 4. Install Tor
ta: ### 4. டோர் நிறுவவும்

source: ### 5. Build lyrebird (obfs4proxy) and move it into place.
ta: ### 5. லைரெபேர்ட் (OBFS4Proxy) ஐ உருவாக்கி அதை இடத்திற்கு நகர்த்தவும்.

source: ### 6. Edit your Tor config file, usually located at `/etc/tor/torrc` and replace its content with:
ta: ### 6. உங்கள் டோர் கட்டமைப்பு கோப்பைத் திருத்தி, வழக்கமாக `/etc/tor/torrc` இல் அமைந்துள்ளது மற்றும் அதன் உள்ளடக்கத்தை மாற்றவும்:

source: ### 7. Restart Tor
ta: ### 7. டோர் மறுதொடக்கம் செய்யுங்கள்

source: ### 8. Monitor your logs
ta: ### 8. உங்கள் பதிவுகளை கண்காணிக்கவும்

source: ### 9. Final Notes
ta: ### 9. இறுதி குறிப்புகள்

source: * Note that both Tor's OR port and its obfs4 port must be reachable. If your bridge is behind a firewall or NAT, make sure to open both ports. You can use our [reachability test](https://bridges.torproject.org/scan/) to see if your obfs4 port is reachable from the Internet.
ta: * டோர் அல்லது துறைமுகம் மற்றும் அதன் OBFS4 துறைமுகம் இரண்டையும் அடைய வேண்டும் என்பதை நினைவில் கொள்க. உங்கள் பாலம் ஒரு ஃபயர்வால் அல்லது NAT க்கு பின்னால் இருந்தால், இரு துறைமுகங்களையும் திறக்க உறுதிசெய்க. உங்கள் OBFS4 துறைமுகம் இணையத்திலிருந்து அடைய முடியுமா என்பதைப் பார்க்க எங்கள் [அணுகல் சோதனை] (https://bridges.torproject.org/scan/) ஐப் பயன்படுத்தலாம்.

source: Configuring the Tor Project's [Repository for CentOS/RHEL](https://support.torproject.org/rpm/) consists basically on setting up `/etc/yum.repos.d/Tor.repo` with the following content:
ta: TOR திட்டத்தின் [CentoS/RHEL க்கான களஞ்சியத்தை] (https://support.torproject.org/rpm/) கட்டமைப்பது அடிப்படையில் `/etc/yum.repos.d/tor.repo` ஐ பின்வரும் உள்ளடக்கத்துடன் அமைப்பதில் உள்ளது:

source: Follow the instructions to enable [automatic software updates](../../guard/centos-rhel/updates/) for your operating system.
ta: உங்கள் இயக்க முறைமைக்கு [தானியங்கி மென்பொருள் புதுப்பிப்புகளை] (../../ காவலர்/சென்டோச்-ரெல்/புதுப்பிப்புகள்/) இயக்க வழிமுறைகளைப் பின்பற்றவும்.

source: Heavily outdated versions of git can make `go get` fail, so try upgrading to a more recent git version if you're running into this problem.
ta: GIT இன் பெரிதும் காலாவதியான பதிப்புகள் `GO GET` தோல்வியடையச் செய்யலாம், எனவே நீங்கள் இந்த சிக்கலில் இயங்கினால் மிக அண்மைக் கால GIT பதிப்பிற்கு மேம்படுத்த முயற்சிக்கவும்.

source: If you are on a recent version that uses `dnf`, please keep using it for the following steps where `yum` is called on this setup guide.
ta: `Dnf` ஐப் பயன்படுத்தும் அண்மைக் கால பதிப்பில் நீங்கள் இருந்தால், தயவுசெய்து இந்த அமைவு வழிகாட்டியில்` yum` அழைக்கப்படும் பின்வரும் படிகளுக்கு இதைப் பயன்படுத்தவும்.

source: Install the golang package and other dependencies:
ta: கோலாங் தொகுப்பு மற்றும் பிற சார்புகளை நிறுவவும்:

source: Now build the binary, and move it to a proper directory:
ta: இப்போது பைனரியை உருவாக்கி, சரியான கோப்பகத்திற்கு நகர்த்தவும்:

source: Once you are set with EPEL and the Tor repositories, you are now able to install the package:
ta: நீங்கள் எபல் மற்றும் டோர் களஞ்சியங்களுடன் அமைக்கப்பட்டதும், இப்போது நீங்கள் தொகுப்பை நிறுவ முடியும்:

source: Please ensure the key matches with the one available on the [Fedora Project website](https://getfedora.org/keys/).
ta: [ஃபெடோரா திட்ட வலைத்தளம்] (https://getfedora.org/keys/) இல் கிடைக்கும் முக்கிய போட்டிகளை உறுதிப்படுத்தவும்.

source: Please note that when you are installing the first package from the EPEL repository you will be asked about verifying the EPEL's GPG signing key.
ta: ஈபல் களஞ்சியத்திலிருந்து முதல் தொகுப்பை நீங்கள் நிறுவும் போது, ஈபலின் சிபிசி கையொப்பமிடும் விசையை சரிபார்ப்பது குறித்து கேட்கப்படும் என்பதை நினைவில் கொள்க.

source: Recent versions of CentOS/RHEL are using `dnf` instead of `yum`:
ta: Centos/Rhel இன் அண்மைக் கால பதிப்புகள் `yum` க்கு பதிலாக` dnf` ஐப் பயன்படுத்துகின்றன:

source: Recent versions os CentOS/RHEL which ship with systemd:
ta: அண்மைக் கால பதிப்புகள் OS Centos/RHEL எந்த Systemd உடன் அனுப்பப்படுகின்றன:

source: Should you use an older release like CentOS/RHEL 6, that will be:
ta: சென்டோச்/ரெல் 6 போன்ற பழைய வெளியீட்டைப் பயன்படுத்த வேண்டுமா, அது இருக்கும்:

source: This will also happens when installing packages from Tor's repository for the first time - again you must ensure the key matches.
ta: முதல் முறையாக டோரின் களஞ்சியத்திலிருந்து தொகுப்புகளை நிறுவும் போது இதுவும் நடக்கும் - மீண்டும் நீங்கள் முக்கிய போட்டிகளை உறுதிப்படுத்த வேண்டும்.

source: To confirm your bridge is running with no issues, you should see something like this (usually in `/var/log/tor/log` or `/var/log/syslog`):
ta: உங்கள் பாலம் எந்த சிக்கலும் இல்லாமல் இயங்குகிறது என்பதை உறுதிப்படுத்த, நீங்கள் இதுபோன்ற ஒன்றைக் காண வேண்டும் (வழக்கமாக `/var/log/tor/log` அல்லது`/var/log/syslog`):

source: To install the `tor` package on CentOS/RHEL, you need to enable the use of the [EPEL](https://fedoraproject.org/wiki/EPEL) Repository first. To do so, you must install the `epel-release` package:
ta: Centos/Rhel இல் `TOR` தொகுப்பை நிறுவ, நீங்கள் முதலில் [EPEL] (https://fedoraproject.org/wiki/epel) களஞ்சியத்தைப் பயன்படுத்துவதை இயக்க வேண்டும். அவ்வாறு செய்ய, நீங்கள் `எபல்-வெளியீட்டு` தொகுப்பை நிறுவ வேண்டும்:

source: How to deploy an obfs4 bridge on CentOS/RHEL
ta: சென்டோச்/RHEL இல் OBFS4 பாலத்தை எவ்வாறு பயன்படுத்துவது

source: CentOS / RHEL
ta: சென்டோச் / ரெல்

source: 1. 24/7 Internet connectivity
ta: 1. 24/7 இணைய இணைப்பு

source: 2. The ability to expose TCP ports to the Internet (make sure that NAT doesn't get in the way)
ta: 2. டி.சி.பி போர்ட்களை இணையத்திற்கு அம்பலப்படுத்தும் திறன் (NAT வழியில் வரவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்)

source: Note 1: If you're running a platform that is not listed on this page, you can [compile obfs4 from source](https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/lyrebird#installation). Note that the project was renamed to lyrebird.
ta: குறிப்பு 1: இந்தப் பக்கத்தில் பட்டியலிடப்படாத ஒரு தளத்தை நீங்கள் இயக்குகிறீர்கள் என்றால், நீங்கள் [மூலத்திலிருந்து OBFS4 ஐ தொகுக்கலாம்] (https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/lyrebird#installation). இந்த திட்டம் லைரெபேர்டுக்கு மறுபெயரிடப்பட்டது என்பதை நினைவில் கொள்க.

source: Note 2: If you're planning to turn an existing but non-bridge relay into a bridge relay, changing IP address, name and fingerprint is advised to avoid easy discovery and blocklisting by ISPs or governments.
ta: குறிப்பு 2: ஏற்கனவே இருக்கும் ஆனால் பிரிட்ச் அல்லாத ரிலேவை பாலம் ரிலேவாக மாற்ற திட்டமிட்டால், ஐபி முகவரி, பெயர் மற்றும் கைரேகை மாற்றுவது ஐஎச்பிக்கள் அல்லது அரசாங்கங்களால் எளிதாக கண்டுபிடிப்பு மற்றும் தடுப்புப்பட்டியல் ஆகியவற்றைத் தவிர்க்க அறிவுறுத்தப்படுகிறது.

source: This guide will help you set up an obfs4 bridge to help censored users connect to the Tor network. The requirements are:
ta: தணிக்கை செய்யப்பட்ட பயனர்கள் TOR நெட்வொர்க்குடன் இணைக்க உதவும் வகையில் OBFS4 பாலத்தை அமைக்க இந்த வழிகாட்டி உதவும். தேவைகள்:

source: Bridge operations
ta: பாலம் செயல்பாடுகள்

source: Run an obfs4 bridge to help censored users connect to the Tor network
ta: தணிக்கை செய்யப்பட்ட பயனர்கள் TOR நெட்வொர்க்குடன் இணைக்க உதவ OBFS4 பாலத்தை இயக்கவும்

source: # "Ext" means "extended", not "external". Don't try to set a specific port number, nor listen on 0.0.0.0.
ta: # "Ext" என்றால் "நீட்டிக்கப்பட்ட", "வெளிப்புறம்" அல்ல. ஒரு குறிப்பிட்ட துறைமுகம் எண்ணை அமைக்க முயற்சிக்காதீர்கள், 0.0.0.0 இல் கேட்க வேண்டாம்.

source: # Avoid port 9001 because it's commonly associated with Tor and censors may be scanning the Internet for this port.
ta: # துறைமுகம் 9001 ஐத் தவிர்க்கவும், ஏனெனில் இது பொதுவாக TOR உடன் தொடர்புடையது மற்றும் தணிக்கைகள் இந்த துறைமுகத்திற்கான இணையத்தை ச்கேன் செய்யலாம்.

source: # Replace "<address@email.com>" with your email address so we can contact you if there are problems with your bridge.
ta: # உங்கள் மின்னஞ்சல் முகவரியுடன் "<seldress@email.com>" ஐ மாற்றவும், எனவே உங்கள் பாலத்தில் சிக்கல்கள் இருந்தால் நாங்கள் உங்களைத் தொடர்பு கொள்ளலாம்.

source: # Replace "TODO1" with a Tor port of your choice.
ta: # "TODO1" ஐ நீங்கள் விரும்பும் ஒரு TOR துறைமுகத்துடன் மாற்றவும்.

source: # Replace "TODO2" with an obfs4 port of your choice.
ta: # "TODO2" ஐ நீங்கள் விரும்பும் OBFS4 துறைமுகத்துடன் மாற்றவும்.

source: # This is optional but encouraged.
ta: # இது விருப்பமானது ஆனால் ஊக்குவிக்கப்படுகிறது.

source: # This port must be externally reachable and must be different from the one specified for ORPort.
ta: # இந்த துறைமுகம் வெளிப்புறமாக அடையக்கூடியதாக இருக்க வேண்டும், மேலும் இது orport க்கு குறிப்பிடப்பட்டவற்றிலிருந்து வேறுபட்டிருக்க வேண்டும்.

source: # This port must be externally reachable.
ta: # இந்த துறைமுகம் வெளிப்புறமாக அடையக்கூடியதாக இருக்க வேண்டும்.

source: ### 2. Configure Tor Project's Repository
ta: ### 2. டோர் திட்டத்தின் களஞ்சியத்தை உள்ளமைக்கவும்

source: ### 3. Install Tor
ta: ### 3. டோர் நிறுவவும்

source: ### 4. Install obfs4proxy
ta: ### 4. OBFS4Proxy ஐ நிறுவவும்

source: ### 5. Edit your Tor config file, usually located at `/etc/tor/torrc` and replace its content with:
ta: ### 5. உங்கள் டோர் கட்டமைப்பு கோப்பைத் திருத்தி, வழக்கமாக `/etc/tor/torrc` இல் அமைந்துள்ளது மற்றும் அதன் உள்ளடக்கத்தை மாற்றவும்:

source: ### 6. Restart Tor
ta: ### 6. டோர் மறுதொடக்கம் செய்யுங்கள்

source: ### 7. Monitor your logs
ta: ### 7. உங்கள் பதிவுகளை கண்காணிக்கவும்

source: ### 8. Final Notes
ta: ### 8. இறுதி குறிப்புகள்

source: #### (Optional) Configure systemd to allow obfs4 binding on privileged ports
ta: #### (விரும்பினால்) சலுகை பெற்ற துறைமுகங்களில் OBFS4 பிணைப்பை அனுமதிக்க SystemD ஐ உள்ளமைக்கவும்

source: **Note: Ubuntu users need to get Tor from the Tor Project's repository.**
ta: ** குறிப்பு: உபுண்டு பயனர்கள் டோர் திட்டத்தின் களஞ்சியத்திலிருந்து டோர் பெற வேண்டும். **

source: Configuring the Tor Project's package repository for Debian/Ubuntu is recommended and documented on **[Support portal](https://support.torproject.org/apt/tor-deb-repo/)**. Please follow those instructions before proceeding.
ta: டெபியன்/உபுண்டுவுக்கான TOR திட்டத்தின் தொகுப்பு களஞ்சியத்தை கட்டமைப்பது ** [ஆதரவு போர்ட்டல்] (https://support.torproject.org/apt/tor-deb-repo/) ** இல் பரிந்துரைக்கப்படுகிறது. தொடர்வதற்கு முன் அந்த வழிமுறைகளைப் பின்பற்றவும்.

source: Enable and Start `tor`:
ta: `டோர்` ஐ இயக்கவும் தொடங்கவும்:

source: Ensure you update the packages database before installing the package, than call `apt` to install it:
ta: தொகுப்பை நிறுவுவதற்கு முன் தொகுப்புகள் தரவுத்தளத்தை புதுப்பிப்பதை உறுதிசெய்கிறீர்கள், அதை நிறுவ `apt` ஐ அழைப்பதை விட:

source: Follow the instructions to enable [automatic software updates](/relay/setup/guard/debian-ubuntu/updates/) for your operating system.
ta: உங்கள் இயக்க முறைமைக்கு [தானியங்கி மென்பொருள் புதுப்பிப்புகள்] (/ரிலே/அமைவு/காவலர்/டெபியன்-உபுண்டு/புதுப்பிப்புகள்/) இயக்க வழிமுறைகளைப் பின்பற்றவும்.

source: For more details, see [ticket 18356](https://gitlab.torproject.org/tpo/core/tor/-/issues/18356).
ta: மேலும் விவரங்களுக்கு, [டிக்கெட் 18356](https://gitlab.torproject.org/tpo/core/tor/-/issues/18356) ஐப் பார்க்கவும்.

source: If everything worked correctly, you will now have two files `/etc/systemd/system/tor@.service.d/override.conf` and `/etc/systemd/system/tor@default.service.d/override.conf` containing the text you entered.
ta: எல்லாம் சரியாக வேலை செய்தால், உங்களிடம் இப்போது இரண்டு கோப்புகள் இருக்கும் `/etc/systemd/system/tor@.service.d/override.conf` மற்றும் `நீங்கள் உள்ளிட்ட உரையை கொண்டுள்ளது.

source: If not, you can [build it from source](https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/lyrebird#installation).
ta: இல்லையென்றால், நீங்கள் அதை [மூலத்திலிருந்து உருவாக்கலாம்] (https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/lyrebird#installation).
