Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: Are you interested in inviting someone from Tor to train your group? While we receive a high volume of training requests and may not be able to offer an in-person training, we may still be able to help. Contact the community team and let's talk.
ta: உங்கள் குழுவைப் பயிற்றுவிக்க TOR இலிருந்து ஒருவரை அழைக்க ஆர்வமாக உள்ளீர்களா? நாங்கள் அதிக அளவிலான பயிற்சி கோரிக்கைகளைப் பெறுகையில், தனிப்பட்ட பயிற்சியை வழங்க முடியாமல் போகலாம், நாங்கள் இன்னும் உதவ முடியும். சமூகக் குழுவைத் தொடர்புகொண்டு பேசலாம்.

source: Are you interested in learning more about Onion Services?
ta: வெங்காய சேவைகளைப் பற்றி மேலும் அறிய ஆர்வமாக உள்ளீர்களா?

source: Available in: {}
ta: கிடைக்கிறது: {}

source: Back to previous page:
ta: முந்தைய பக்கத்திற்குத் திரும்பு:

source: Become a Community User Researcher
ta: சமூக பயனர் ஆராய்ச்சியாளராகுங்கள்

source: Become a Tester
ta: ஒரு சோதனையாளராகுங்கள்

source: Blog
ta: வலைப்பதிவு

source: By {}
ta: மூலம் {}

source: Can you help us improve our translations?
ta: எங்கள் மொழிபெயர்ப்புகளை மேம்படுத்த எங்களுக்கு உதவ முடியுமா?

source: Check our extensive documentation
ta: எங்கள் விரிவான ஆவணங்களை சரிபார்க்கவும்

source: Check out the code
ta: குறியீட்டைப் பாருங்கள்

source: Clear filters
ta: தெளிவான வடிப்பான்கள்

source: Community mailing list
ta: சமூக அஞ்சல் பட்டியல்

source: Connect with other Relay Operators
ta: பிற ரிலே ஆபரேட்டர்களுடன் இணைக்கவும்

source: Contact
ta: தொடர்பு

source: Contributors to this page:
ta: இந்த பக்கத்திற்கு பங்களிப்பாளர்கள்:

source: Defend yourself against tracking and surveillance. Circumvent censorship.
ta: கண்காணிப்பு மற்றும் கண்காணிப்புக்கு எதிராக உங்களை தற்காத்துக் கொள்ளுங்கள். தணிக்கை தவிர.

source: Documentation
ta: ஆவணமாக்கம்

source: Donate
ta: நன்கொடை அளியுங்கள்

source: Donate Now
ta: இப்போதே நன்கொடையளியுங்கள்

source: Donate now
ta: இப்போது நன்கொடை

source: Download Tor Browser
ta: Tor உலாவியைப் பதிவிறக்குக

source: Download Tor Browser to experience real private browsing without tracking, surveillance, or censorship.
ta: பின்தொடர்தல், கண்காணிப்பு, தணிக்கை இல்லாத மெய்யான தனியுரிமை உலாவலை அனுபவிக்க Tor உலாவியைப் பதிவிறக்குக.

source: Edit ISP list
ta: ISP பட்டியலைத் திருத்து

source: Edit this page
ta: இந்த பக்கத்தைத் திருத்தவும்

source: Encryption
ta: மறையாக்கம்

source: Featured onionsites
ta: இடம்பெற்ற வெங்காயவாதிகள்

source: Find out how Tor helps internet users like {} reclaim their privacy and anonymity.
ta: இணைய பயனர்கள் தங்கள் தனியுரிமை மற்றும் அநாமதேயத்தை மீட்டெடுப்பது போன்ற எவ்வாறு உதவுவது என்பதைக் கண்டறியவும்.

source: Freedom of Information
ta: செய்தி விடுதலை

source: Get monthly updates and opportunities from the Tor Project:
ta: Tor திட்டத்திலிருந்து மாதப் புதுப்பித்தல்களையும் வாய்ப்புகளையும் பெற்றிடுக:

source: Healthcare
ta: ஆரோக்கியம்

source: Help fuel the development of truly private tools.
ta: உண்மையான தனியார் கருவிகளின் வளர்ச்சியைத் தூண்ட உதவுகிறது.

source: Here are some successful projects which have been implemented in the past by Google Summer of Code and Outreachy participants
ta: கூகிள் சம்மர் ஆஃப் கோட் மற்றும் அவுட்ரீச்சி பங்கேற்பாளர்களால் கடந்த காலத்தில் செயல்படுத்தப்பட்ட சில வெற்றிகரமான திட்டங்கள் இங்கே

source: Jobs
ta: பணிகள்

source: Join Tor Translators mailing list
ta: டோர் மொழிபெயர்ப்பாளர்கள் அஞ்சல் பட்டியலில் சேரவும்

source: Join the Community
ta: சமூகத்தில் சேரவும்

source: Journalists, activists, and everyday internet users rely on Tor.
ta: பத்திரிகையாளர்கள், ஆர்வலர்கள் மற்றும் அன்றாட இணைய பயனர்கள் TOR ஐ நம்பியுள்ளனர்.

source: Language
ta: மொழி

source: Language:
ta: மொழி:

source: Learn more
ta: மேலும் அறிய

source: Localization is a continuous process across our applications. Notice any improvements we could make to our translations? Open a ticket, reach out to us, or become part of our translators squad.
ta: உள்ளூர்மயமாக்கல் என்பது எங்கள் பயன்பாடுகளில் தொடர்ச்சியான செயல்முறையாகும். எங்கள் மொழிபெயர்ப்புகளுக்கு நாம் செய்யக்கூடிய ஏதேனும் மேம்பாடுகளைக் கவனிக்கிறீர்களா? ஒரு டிக்கெட்டைத் திறக்கவும், எங்களை அணுகவும், அல்லது எங்கள் மொழிபெயர்ப்பாளர்கள் அணியின் ஒரு பகுதியாக மாறவும்.

source: Maintained by
ta: மூலம் பராமரிக்கப்படுகிறது

source: Maintained by:
ta: வழங்கியவர்:

source: None of these ideas seem appealing? You may also want to propose your own project idea — which often results in the best projects.
ta: இந்த சிந்தனைகள் எதுவும் ஈர்க்கக்கூடியதாகத் தெரியவில்லை? உங்கள் சொந்த திட்ட யோசனையை நீங்கள் முன்மொழிய விரும்பலாம் - இது பெரும்பாலும் சிறந்த திட்டங்களில் விளைகிறது.

source: OONI Probe network experiments
ta: ஓனி ஆய்வு பிணையம் சோதனைகள்

source: OONI: Implement roaming test helpers
ta: ஓனி: ரோமிங் சோதனை உதவியாளர்களை செயல்படுத்தவும்

source: OONI: Improve OONI Explorer code quality
ta: ஓனி: ஓனி எக்ச்ப்ளோரர் குறியீடு தரத்தை மேம்படுத்தவும்

source: OONI: Integration and unit testing of OONI Probe Desktop apps
ta: OONI: OONI ஆய்வு டெச்க்டாப் பயன்பாடுகளின் ஒருங்கிணைப்பு மற்றும் அலகு சோதனை

source: OONI: Measure the accuracy of OONI GeoIP lookup
ta: ஓனி: ஓனி சியோப் தேடலின் துல்லியத்தை அளவிடவும்

source: Onion Balance V3 Enhancements
ta: வெங்காய இருப்பு வி 3 மேம்பாடுகள்

source: Onionize any website
ta: எந்த வலைத்தளத்தையும் வெங்காயப்படுத்தவும்

source: Online Safety
ta: நிகழ்நிலை பாதுகாப்பு

source: Opting out of Big Tech means investing in better alternatives. That's where Tor, Tor Browser, and Tails come in.
ta: பெரிய தொழில்நுட்பத்திலிருந்து விலகுவது என்பது சிறந்த மாற்றுகளில் முதலீடு செய்வதாகும். அங்குதான் டோர், டோர் உலாவி மற்றும் வால்கள் உள்ளே வருகின்றன.

source: Our mission:
ta: நமது குறிக்கோள்:

source: People shouldn't be exploited for using the internet.
ta: இணையத்தைப் பயன்படுத்துவதற்காக மக்கள் சுரண்டப்படக்கூடாது.

source: Press
ta: அச்சு ஊடகம்

source: Press Freedom
ta: செய்தித் தாள் விடுதலை

source: PrivChat
ta: இருங்கள்

source: Privacy
ta: தனியுரிமை

source: Privacy and freedom are human rights.
ta: தனியுரிமை மற்றும் விடுதலை மனித உரிமைகள்.

source: Privacy is about protecting who we are as human beings: our fears, our relationships, and our vulnerabilities.
ta: தனியுரிமை என்பது மனிதர்களாகிய நாம் யார் என்பதைப் பாதுகாப்பதாகும்: நமது அச்சங்கள், எங்கள் உறவுகள் மற்றும் நமது பாதிப்புகள்.

source: Privacy is possible.
ta: தனியுரிமை சாத்தியமாகும்.

source: Privacy isn't about having something to hide.
ta: தனியுரிமை என்பது மறைக்க ஏதாவது வைத்திருப்பது அல்ல.

source: Relay Operators mailing list
ta: ரிலே ஆபரேட்டர்கள் அஞ்சல் பட்டியல்

source: Request a Speaker
ta: பேச்சாளரைக் கோருங்கள்

source: SEARCH
ta: தேடல்

source: SIGN UP
ta: பதிவு செய்க

source: SUBSCRIBE TO OUR NEWSLETTER
ta: எங்கள் செய்திமடலுக்கு குழுசேரவும்

source: Search this website on DuckDuckGo...
ta: இந்த வலைத்தளத்தை டக்டகோவில் தேடுங்கள் ...

source: Support
ta: உதவி

source: Talk
ta: பேச்சு

source: The Onion Services Ecosystem documentation is directed to everyone: from those who want to understand and use the technology, to the ones interested in advanced topics such as the current research.
ta: வெங்காய சேவைகள் சுற்றுச்சூழல் அமைப்புகள் அனைவருக்கும் அனுப்பப்படுகின்றன: தொழில்நுட்பத்தைப் புரிந்துகொண்டு பயன்படுத்த விரும்புவோர் முதல், தற்போதைய ஆராய்ச்சி போன்ற மேம்பட்ட தலைப்புகளில் ஆர்வமுள்ளவர்கள் வரை.

source: There is a toolkit that lets you take any existing website and host it as an onionsite too. This is important because onionsites are more secure than just regular sites. There is an installation guide for how to use this toolkit to onionize your site.
ta: ஒரு கருவித்தொகுப்பு உள்ளது, இது ஏற்கனவே இருக்கும் எந்த வலைத்தளத்தையும் எடுத்து வெங்காயமாக புரவலன் செய்ய அனுமதிக்கிறது. இது முக்கியமானது, ஏனெனில் வெங்காயவாதிகள் வழக்கமான தளங்களை விட பாதுகாப்பானவர்கள். உங்கள் தளத்தை வெங்காயப்படுத்த இந்த கருவித்தொகுப்பை எவ்வாறு பயன்படுத்துவது என்பதற்கான நிறுவல் வழிகாட்டி உள்ளது.

source: These rights are denied online around the world, but Tor gives them back.
ta: இந்த உரிமைகள் உலகெங்கிலும் ஆன்லைனில் மறுக்கப்படுகின்றன, ஆனால் டோர் அவற்றை திருப்பித் தருகிறார்.

source: To advance human rights and freedoms by creating and deploying free and open source anonymity and privacy technologies, supporting their unrestricted availability and use, and furthering their scientific and popular understanding.
ta: கட்டற்ற திறவூற்று பெயரறியப்படாமை மற்றும் தனியுரிமைத் தொழில்நுட்பங்களை உருவாக்குதல் செயல்படுத்தல், அவற்றின் கட்டுப்பாடற்ற கிடைக்கும் தன்மைக்கு உதவுதல், அவற்றின் அறிவியல் மற்றும் பொதுவான புரிதலைப் பரப்புதல் மூலம் மனித உரிமைகளையும் விடுதலைகளையும் முன்னெடுத்தல்.

source: Tools
ta: கருவிகள்

source: Topic
ta: தலைப்பு

source: Topic:
ta: தலைப்பு:

source: Tor Project
ta: Tor திட்டம்

source: Tor Speakers Bureau
ta: டோர் பேச்சாளர்கள் பணியகம்

source: Tor Weather
ta: TOR வானிலை

source: Tor forum
ta: TOR மன்றம்

source: Tor software is developed by the Tor Project, a 501(c)(3) nonprofit organization.
ta: TOR மென்பொருளை TOR திட்டத்தால் உருவாக்கப்பட்டுள்ளது, இது 501 (சி) (3) இலாப நோக்கற்ற அமைப்பு.

source: Tor software is used by millions of people around the world.
ta: டோர் மென்பொருளை உலகெங்கிலும் உள்ள மில்லியன் கணக்கான மக்களால் பயன்படுத்தப்படுகிறது.

source: Trackers are harvesting our every move, but a safer internet is possible.
ta: டிராக்கர்கள் எங்கள் ஒவ்வொரு அசைவையும் அறுவடை செய்கிறார்கள், ஆனால் பாதுகாப்பான இணையம் சாத்தியமாகும்.

source: Tracking and surveillance are widespread.
ta: கண்காணிப்பு மற்றும் கண்காணிப்பு பரவலாக உள்ளன.

source: Trademark, copyright notices, and rules for use by third parties can be found in our [Trademark and Brand policy](https://www.torproject.org/about/trademark).
ta: வர்த்தக முத்திரை, பதிப்புரிமை அறிவிப்புகள் மற்றும் மூன்றாம் தரப்பினரின் பயன்பாட்டிற்கான விதிகள் எங்கள் [வர்த்தக முத்திரை மற்றும் சூட்டுக்குறி கொள்கை](https://www.torproject.org/about/trademark) இல் காணலாம்.

source: UX team mailing list
ta: யுஎக்ச் குழு அஞ்சல் பட்டியல்

source: Upcoming Tor Events
ta: வரவிருக்கும் TOR நிகழ்வுகள்

source: Updated: {}
ta: புதுப்பிக்கப்பட்டது: {}

source: View
ta: பார்வை

source: View Google Slides
ta: கூகிள் ச்லைடுகளைக் காண்க

source: View and share
ta: பார்வை மற்றும் பகிர்வு

source: We build free and open source software anyone can use.
ta: எவரும் பயன்படுத்தக்கூடிய இலவச மற்றும் திறந்த மூல மென்பொருளை நாங்கள் உருவாக்குகிறோம்.

source: We have a dedicated group of Tor core contributors who are ready to speak at your next event. You can request a speaker by contacting speaking@torproject.org with your preferred topic, language requirement, date, and other details.
ta: உங்கள் அடுத்த நிகழ்வில் பேசத் தயாராக இருக்கும் டோர் கோர் பங்களிப்பாளர்களின் பிரத்யேக குழு எங்களிடம் உள்ளது. உங்கள் விருப்பமான தலைப்பு, மொழி தேவை, தேதி மற்றும் பிற விவரங்களுடன் bysop@torproject.org ஐ தொடர்புகொள்வதன் மூலம் பேச்சாளரைக் கோரலாம்.

source: We invite you to contact us to discuss your own project idea.
ta: உங்கள் சொந்த திட்ட யோசனையைப் பற்றி விவாதிக்க எங்களை தொடர்பு கொள்ள உங்களை அழைக்கிறோம்.

source: We regularly release Tor Browser early versions to allow users to test software improvements and new ideas. Sign up to be in our testing pool.
ta: மென்பொருள் மேம்பாடுகள் மற்றும் புதிய யோசனைகளை சோதிக்க பயனர்களை அனுமதிக்க டோர் உலாவி ஆரம்ப பதிப்புகளை நாங்கள் தவறாமல் வெளியிடுகிறோம். எங்கள் சோதனைக் குளத்தில் இருக்க பதிவு செய்க.

source: We think privacy should be the default online, and that's what our software provides.
ta: தனியுரிமை ஆன்லைனில் இயல்புநிலையாக இருக்க வேண்டும் என்று நாங்கள் நினைக்கிறோம், அதையே எங்கள் மென்பொருள் வழங்குகிறது.

source: Word of mouth is critical to reaching new people and helping them protect themselves online. Here's how you can help:
ta: புதிய நபர்களை அடைவதற்கும் ஆன்லைனில் தங்களை பாதுகாத்துக் கொள்ள உதவுவதற்கும் வாய் சொல் முக்கியமானது. நீங்கள் எவ்வாறு உதவ முடியும் என்பது இங்கே:

source: in irc.oftc.net.
ta: irc.oftc.net இல்.

source: {} is a pseudonym. This is an anonymous story submitted by a Tor user.
ta: {} என்பது ஒரு புனைப்பெயர். இது ஒரு TOR பயனரால் சமர்ப்பிக்கப்பட்ட அநாமதேய கதை.

source: Search
ta: தேடல்

source: Back to previous page:
ta: முந்தைய பக்கத்திற்குத் திரும்பு:

source: Read more.
ta: மேலும் வாசிக்க.

source: Word of mouth is critical to reaching new people and helping them protect themselves online. Here's how you can help:
ta: புதிய நபர்களை அடைவதற்கும் ஆன்லைனில் தங்களை பாதுகாத்துக் கொள்ள உதவுவதற்கும் வாய் சொல் முக்கியமானது. நீங்கள் எவ்வாறு உதவ முடியும் என்பது இங்கே:

source: Last updated
ta: கடைசியாக புதுப்பிக்கப்பட்டது

source: Estimated time
ta: கணிக்கப்பட்ட நேரம்

source: Objectives
ta: குறிக்கோள்கள்

source: External reading sources
ta: வெளிப்புற வாசிப்பு ஆதாரங்கள்

source: Download sample slides
ta: மாதிரி ச்லைடுகளைப் பதிவிறக்கவும்

source: Topics
ta: தலைப்புகள்

source: Join the Conversation
ta: உரையாடலில் சேரவும்

source: Do you have ideas on how to improve our training material and educational outreach? Join the conversation on the Tor Project forum. Simply create a post under the “Education” category!
ta: எங்கள் பயிற்சிப் பொருள் மற்றும் கல்விப் பயணத்தை எவ்வாறு மேம்படுத்துவது என்பது குறித்த சிந்தனைகள் உங்களிடம் உள்ளதா? TOR திட்ட மன்றத்தில் உரையாடலில் சேரவும். “கல்வி” பிரிவின் கீழ் ஒரு இடுகையை உருவாக்கவும்!

source: Improve this translation
ta: இந்த மொழிபெயர்ப்பை மேம்படுத்தவும்
