Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: A Distributed Denial of Service (DDoS) attack is when an attacker sends so much traffic to a website or network that it gets overwhelmed and stops working.
ta: ஒரு விநியோகிக்கப்பட்ட பணி மறுப்பு (டி.டி.ஓ.எச்) தாக்குதல் என்பது ஒரு வலைத்தளம் அல்லது நெட்வொர்க்கிற்கு இவ்வளவு போக்குவரத்தை அனுப்பும்போது, அது அதிகமாகி வேலை செய்வதை நிறுத்துகிறது.

source: A [**malicious relay**](/content/relay/governance/handling-bad-relays/) is like a friend in the chain who secretly opens the letter and reads it or even changes it before passing it on.
ta: ஒரு [** தீங்கிழைக்கும் ரிலே **] (/உள்ளடக்கம்/ரிலே/ஆளுகை/கையாளுதல்-தடுப்பு-நம்பகத்தன்மை/) சங்கிலியில் உள்ள ஒரு நண்பரைப் போன்றது, அவர் கடிதத்தைத் திறந்து அதைப் படிக்கிறார் அல்லது கடந்து செல்வதற்கு முன்பு அதை மாற்றுகிறார்.

source: As Tor offers protection, it also faces numerous threats from attackers who aim to undermine its security.
ta: டோர் பாதுகாப்பை வழங்குவதால், அதன் பாதுகாப்பைக் குறைமதிப்பிற்கு உட்படுத்தும் நோக்கில் தாக்குபவர்களிடமிருந்து ஏராளமான அச்சுறுத்தல்களையும் இது எதிர்கொள்கிறது.

source: Attackers can use different tricks to do this.
ta: இதைச் செய்ய தாக்குதல் நடத்தியவர்கள் வெவ்வேறு தந்திரங்களைப் பயன்படுத்தலாம்.

source: Attackers might do something similar by observing patterns in your online activity by running [bad relays](/content/relay/governance/handling-bad-relays/) and deploying DDoS attacks to get more traffic routed over their own relays.
ta: [மோசமான ரிலேக்கள்] (/உள்ளடக்கம்/ரிலே/ஆளுகை/கையாளுதல்-பேட்-ரிலேச்/) இயங்குவதன் மூலம் உங்கள் நிகழ்நிலை செயல்பாட்டில் வடிவங்களைக் கவனிப்பதன் மூலம் தாக்குதல் நடத்தியவர்கள் ஒத்த ஒன்றைச் செய்யலாம் மற்றும் டி.டி.ஓ.எச் தாக்குதல்களை தங்கள் சொந்த ரிலேக்களில் அதிக போக்குவரத்தை வழிநடத்துகிறார்கள்.

source: Attackers use a similar method called **traffic analysis**.
ta: தாக்குதல் நடத்துபவர்கள் ** போக்குவரத்து பகுப்பாய்வு ** எனப்படும் இதேபோன்ற முறையைப் பயன்படுத்துகின்றனர்.

source: But what if one of these relays is operated by someone with bad intentions?
ta: ஆனால் இந்த ரிலேக்களில் ஒன்று மோசமான நோக்கங்களைக் கொண்ட ஒருவரால் இயக்கப்பட்டால் என்ன செய்வது?

source: By comparing these patterns, they can guess which Tor user is connected to which website or service, even if the data itself is encrypted.
ta: இந்த வடிவங்களை ஒப்பிடுவதன் மூலம், தரவு தானே குறியாக்கம் செய்யப்பட்டிருந்தாலும், எந்த வலைத்தளம் அல்லது சேவையுடன் எந்த டோர் பயனர் இணைக்கப்பட்டுள்ளார் என்பதை அவர்கள் யூகிக்க முடியும்.

source: By understanding how Tor works and the risks involved, you can make informed choices to protect your privacy.
ta: டோர் எவ்வாறு செயல்படுகிறது மற்றும் சம்பந்தப்பட்ட அபாயங்களைப் புரிந்துகொள்வதன் மூலம், உங்கள் தனியுரிமையைப் பாதுகாக்க தகவலறிந்த தேர்வுகளை நீங்கள் செய்யலாம்.

source: Deanonymization is when someone figures out who you really are, even though you’re trying to stay anonymous.
ta: நீங்கள் அநாமதேயமாக இருக்க முயற்சித்தாலும், நீங்கள் உண்மையில் யார் என்பதை யாராவது கண்டுபிடிக்கும் போது டியூனொனொனிமிசேசன் ஆகும்.

source: Each friend passes the letter to the next, and the final friend delivers it to the recipient.
ta: ஒவ்வொரு நண்பரும் கடிதத்தை அடுத்த இடத்திற்கு அனுப்புகிறார்கள், இறுதி நண்பர் அதை பெறுநருக்கு வழங்குகிறார்.

source: Even though the letter is sealed, someone watching can guess who you’re writing to by seeing who you gave the letter to and who received it at the other end.
ta: கடிதம் சீல் வைக்கப்பட்டிருந்தாலும், நீங்கள் யாருக்கு கடிதத்தை கொடுத்தீர்கள், மறுமுனையில் யார் பெற்றீர்கள் என்பதைப் பார்ப்பதன் மூலம் நீங்கள் யாரை எழுதுகிறீர்கள் என்று யாராவது யூகிக்க முடியும்.

source: For instance, an attacker might keep watch of your internet connection (perhaps through your Internet Service Provider).
ta: உதாரணமாக, தாக்குபவர் உங்கள் இணைய இணைப்பைக் கவனிக்கக்கூடும் (ஒருவேளை உங்கள் இணைய பணி வழங்குநர் மூலம்).

source: If an attacker doesn’t want people to use Tor, they might send a huge amount of traffic to Tor’s relays, making it hard or impossible for real users to connect.
ta: தாக்குபவர் மக்கள் டோரைப் பயன்படுத்துவதை விரும்பவில்லை என்றால், அவர்கள் டோரின் ரிலேக்களுக்கு ஒரு பெரிய அளவிலான போக்குவரத்தை அனுப்பக்கூடும், இதனால் உண்மையான பயனர்கள் இணைப்பது கடினம் அல்லது சாத்தியமற்றது.

source: If an attacker runs an exit relay (the last relay before your data leaves the Tor network), they could try to spy on your data if it’s not properly encrypted.
ta: ஒரு தாக்குபவர் வெளியேறும் ரிலேவை இயக்கினால் (உங்கள் தரவு TOR நெட்வொர்க்கை விட்டு வெளியேறுவதற்கு முன்பு கடைசி ரிலே), உங்கள் தரவை சரியாக குறியாக்கம் செய்யாவிட்டால் அது உளவு பார்க்க முயற்சி செய்யலாம்.

source: If an attacker sees data going into the Tor network from your computer and sees similar data coming out on the other side, they might guess that the data is connected, even though it’s encrypted.
ta: ஒரு தாக்குபவர் உங்கள் கணினியிலிருந்து TOR நெட்வொர்க்கில் தரவைப் பார்த்தால், இதே போன்ற தரவு மறுபுறம் வெளிவருவதைக் கண்டால், தரவு குறியாக்கம் செய்யப்பட்டிருந்தாலும், அது இணைக்கப்பட்டுள்ளது என்று அவர்கள் யூகிக்கக்கூடும்.

source: Imagine someone knocks on your door, and as soon as you open it, they quickly take a picture of you.
ta: யாரோ உங்கள் கதவைத் தட்டுவதை கற்பனை செய்து பாருங்கள், நீங்கள் அதைத் திறந்தவுடன், அவர்கள் விரைவாக உங்களைப் படம் எடுக்கிறார்கள்.

source: Imagine your mail carrier (ISP) could choose specific sorting facilities they control, not to open your letters, but to monitor where they go and when.
ta: உங்கள் மெயில் கேரியர் (ஐ.எச்.பி) அவர்கள் கட்டுப்படுத்தும் குறிப்பிட்ட வரிசையாக்க வசதிகளைத் தேர்வுசெய்யலாம் என்று கற்பனை செய்து பாருங்கள், உங்கள் கடிதங்களைத் திறக்க அல்ல, ஆனால் அவை எங்கு செல்கின்றன, எப்போது என்று கண்காணிக்க.

source: Imagine you’re sending a secret letter through a series of friends.
ta: தொடர்ச்சியான நண்பர்கள் மூலம் நீங்கள் ஒரு ரகசிய கடிதத்தை அனுப்புகிறீர்கள் என்று கற்பனை செய்து பாருங்கள்.

source: In some cases, attackers might work with ISPs to monitor or control what you do online.
ta: சில சந்தர்ப்பங்களில், நீங்கள் ஆன்லைனில் என்ன செய்கிறீர்கள் என்பதை கண்காணிக்க அல்லது கட்டுப்படுத்த தாக்குபவர்கள் ISP களுடன் இணைந்து பணியாற்றலாம்.

source: In some countries, ISPs might be forced to monitor or block Tor traffic, making it harder for you to use the network.
ta: சில நாடுகளில், ஐ.எச்.பி.எச் போக்குவரத்தை கண்காணிக்க அல்லது தடுக்க வேண்டிய கட்டாயத்தில் இருக்கலாம், இதனால் நீங்கள் நெட்வொர்க்கைப் பயன்படுத்துவது கடினம்.

source: Internet Service Providers (ISPs) are the companies that connect you to the internet.
ta: இணைய பணி வழங்குநர்கள் (ISP கள்) உங்களை இணையத்துடன் இணைக்கும் நிறுவனங்கள்.

source: It’s like flooding a store with so many customers that no one can get through the door.
ta: இது பல வாடிக்கையாளர்களுடன் ஒரு கடையில் வெள்ளம் வருவது போன்றது, யாரும் கதவு வழியாக செல்ல முடியாது.

source: People who want to break Tor's protections use many different methods.
ta: டோரின் பாதுகாப்புகளை உடைக்க விரும்பும் நபர்கள் பலவிதமான முறைகளைப் பயன்படுத்துகிறார்கள்.

source: Similarly, local adversaries can manipulate your Tor traffic to ensure it passes through their controlled Guards or Bridges (the first connection points in the Tor network).
ta: இதேபோல், உள்ளக விரோதிகள் உங்கள் டோர் போக்குவரத்தை தங்கள் கட்டுப்படுத்தப்பட்ட காவலர்கள் அல்லது பாலங்கள் (TOR நெட்வொர்க்கில் முதல் இணைப்பு புள்ளிகள்) வழியாகச் செல்வதை உறுதிசெய்ய முடியும்.

source: Some relays receive data, some pass it along, and others send it out of the network.
ta: சில ரிலேக்கள் தரவைப் பெறுகின்றன, சிலவற்றை கடந்து செல்கின்றன, மற்றவை அதை நெட்வொர்க்கிலிருந்து அனுப்புகின்றன.

source: The Tor network relies on volunteers to run [relays](/content/relay/) (like the friends in our secret letter example).
ta: [ரிலேக்கள்] (/உள்ளடக்கம்/ரிலே/) (எங்கள் ரகசிய கடிதம் எடுத்துக்காட்டில் உள்ள நண்பர்களைப் போல) இயக்க டோர் பிணையம் தன்னார்வலர்களை நம்பியுள்ளது.

source: These attackers can attempt to breach Tor users' privacy through a range of tactics, ranging from complex technical trickery to simple lies.
ta: இந்த தாக்குதல் செய்பவர்கள் சிக்கலான தொழில்நுட்ப தந்திரங்கள் முதல் எளிய பொய்கள் வரை பல தந்திரோபாயங்கள் மூலம் பயனர்களின் தனியுரிமையை மீற முயற்சிக்கலாம்.

source: They didn’t need to follow you around all day to figure out where you live—they just needed to catch you at the right moment.
ta: நீங்கள் எங்கு வசிக்கிறீர்கள் என்பதைக் கண்டுபிடிக்க அவர்கள் நாள் முழுவதும் உங்களைப் பின்தொடரத் தேவையில்லை - சரியான நேரத்தில் உங்களைப் பிடிக்க அவர்கள் தேவைப்பட்டனர்.

source: They don’t need to read your messages—they can try to figure out who’s talking to whom just by watching how data moves through the Tor network.
ta: அவர்கள் உங்கள் செய்திகளைப் படிக்கத் தேவையில்லை - டோர் பிணையம் வழியாகத் தரவு எவ்வாறு நகர்கிறது என்பதைப் பார்ப்பதன் மூலம் யார் யாருடன் பேசுகிறார்கள் என்பதை அவர்கள் கண்டுபிடிக்க முயற்சி செய்யலாம்.

source: Through this, they can notice that you send a specific amount of data into the Tor network at a certain time, or the data exiting the Tor network with similar timing and size.
ta: இதன் மூலம், ஒரு குறிப்பிட்ட நேரத்தில் ஒரு குறிப்பிட்ட அளவு தரவை TOR நெட்வொர்க்கில் அனுப்புவதை அவர்கள் கவனிக்க முடியும், அல்லது டோர் நெட்வொர்க்கிலிருந்து வெளியேறும் தரவு ஒத்த நேரம் மற்றும் அளவுடன்.

source: To prevent this from happening, always use HTTPS websites, which encrypt your traffic end-to-end, and avoid transmitting sensitive information over unencrypted connections while using Tor.
ta: இது நடப்பதைத் தடுக்க, எப்போதும் HTTPS வலைத்தளங்களைப் பயன்படுத்துங்கள், இது உங்கள் போக்குவரத்தை முடிவில் இருந்து குறியாக்குகிறது, மேலும் TOR ஐப் பயன்படுத்தும் போது மறைகுறியாக்கப்பட்ட இணைப்புகள் மீது முக்கியமான தகவல்களை கடத்துவதைத் தவிர்க்கவும்.

source: To stay safe online, it's essential to be aware of these threats.
ta: ஆன்லைனில் பாதுகாப்பாக இருக்க, இந்த அச்சுறுத்தல்களைப் பற்றி விழிப்புடன் இருப்பது தேவை.

source: Tor offers a powerful tool for online privacy, but it's important to understand that it's not invincible.
ta: டோர் நிகழ்நிலை தனியுரிமைக்கு ஒரு சக்திவாய்ந்த கருவியை வழங்குகிறது, ஆனால் அது வெல்லமுடியாதது அல்ல என்பதை புரிந்து கொள்ள வேண்டியது தேவை.

source: Whether you're a regular Tor user or just interested in online privacy, understanding these concerns is critical to your online safety.
ta: நீங்கள் ஒரு வழக்கமான டோர் பயனராக இருந்தாலும் அல்லது நிகழ்நிலை தனியுரிமையில் ஆர்வமாக இருந்தாலும், இந்த கவலைகளைப் புரிந்துகொள்வது உங்கள் நிகழ்நிலை பாதுகாப்பிற்கு முக்கியமானது.

source: While they can't read your traffic, this increases their chances of tracking your activity and potentially identifying you through traffic patterns.
ta: உங்கள் போக்குவரத்தை அவர்களால் படிக்க முடியாது என்றாலும், இது உங்கள் செயல்பாட்டைக் கண்காணிப்பதற்கான வாய்ப்புகளை அதிகரிக்கிறது மற்றும் போக்குவரத்து முறைகள் மூலம் உங்களை அடையாளம் காணும்.

source: How Attackers Work
ta: தாக்குதல் நடத்துபவர்கள் எவ்வாறு செயல்படுகிறார்கள்

source: ![An image showing positions of client-side threats on the Tor network](/static/images/threat-model/client-side.png "title='Client Threats' class='img-fluid'")
ta: ![TOR நெட்வொர்க்கில் கிளையன்ட் பக்க அச்சுறுத்தல்களின் நிலைகளைக் காட்டும் படம்](/static/images/threat-model/client-side.png "title='Client Threats' class='img-fluid'")

source: ## Understanding Client-side Adversaries
ta: ## கிளையன்ட் பக்க விரோதிகளைப் புரிந்துகொள்வது

source: ### Denial of Service (DoS) attacks
ta: ### பணி மறுப்பு (DOS) தாக்குதல்கள்

source: A Denial of Service (DoS) attack is a tactic where an attacker attempts to make a service, in this case, the Tor network, hard to use for its intended users.
ta: பணி மறுப்பு (DOS) தாக்குதல் என்பது ஒரு தந்திரோபாயமாகும், அங்கு தாக்குபவர் ஒரு சேவையை உருவாக்க முயற்சிக்கிறார், இந்த விசயத்தில், TOR பிணையம், அதன் நோக்கம் கொண்ட பயனர்களைப் பயன்படுத்துவது கடினம்.

source: A Tor client is software that lets you use the Tor network.
ta: ஒரு TOR வாங்கி என்பது TOR நெட்வொர்க்கைப் பயன்படுத்த உங்களை அனுமதிக்கும் மென்பொருள்.

source: Client-side attackers are individuals or entities that use a Tor client to carry out attacks on the network.
ta: கிளையன்ட் பக்க தாக்குதல் நடத்துபவர்கள் என்பது நெட்வொர்க்கில் தாக்குதல்களைச் செய்ய TOR கிளையண்டைப் பயன்படுத்தும் நபர்கள் அல்லது நிறுவனங்கள்.

source: Client-side attackers can execute DoS attacks to degrade the performance of the Tor network, causing disruptions that impact all users.
ta: கிளையன்ட் பக்க தாக்குதல் நடத்துபவர்கள் TOR நெட்வொர்க்கின் செயல்திறனைக் குறைக்க DOS தாக்குதல்களைச் செய்யலாம், இதனால் அனைத்து பயனர்களையும் பாதிக்கும் இடையூறுகள் ஏற்படுகின்றன.

source: However, the network faces various threats, even from people who just use a Tor client.
ta: இருப்பினும், பிணையம் ஒரு TOR கிளையண்டைப் பயன்படுத்தும் நபர்களிடமிருந்து கூட பல்வேறு அச்சுறுத்தல்களை எதிர்கொள்கிறது.

source: Instead, they rely on their access to the internet and a Tor client to execute their attacks.
ta: அதற்கு பதிலாக, அவர்கள் தங்கள் தாக்குதல்களைச் செய்ய இணையத்திற்கான அணுகலை நம்பியிருக்கிறார்கள்.

source: One of the primary threats posed by client-side attackers is the ability to perform a Denial of Service (DoS) attack.
ta: வாடிக்கையாளர் பக்க தாக்குதல் நடத்தியவர்களால் முன்வைக்கப்படும் முதன்மை அச்சுறுத்தல்களில் ஒன்று, பணி மறுப்பு (DOS) தாக்குதலைச் செய்வதற்கான திறன் ஆகும்.

source: The Tor network is designed to protect users' privacy by routing their internet traffic through a series of relays, making it difficult to trace their online activities.
ta: டோர் பிணையம் பயனர்களின் தனியுரிமையைப் பாதுகாக்க வடிவமைக்கப்பட்டுள்ளது, இது தொடர்ச்சியான ரிலேக்கள் மூலம் அவர்களின் இணைய போக்குவரத்தை வழிநடத்துவதன் மூலம், அவர்களின் நிகழ்நிலை செயல்பாடுகளைக் கண்டறிவது கடினம்.

source: The most common Tor client is the Tor Browser, which is similar to a regular web browser but with built-in privacy protections.
ta: மிகவும் பொதுவான டோர் கிளையன்ட் டோர் உலாவி ஆகும், இது வழக்கமான வலை உலாவிக்கு ஒத்ததாக இருக்கிறது, ஆனால் உள்ளமைக்கப்பட்ட தனியுரிமை பாதுகாப்புகளுடன்.

source: The result is a significantly slowed network, making it difficult for legitimate users to connect or use Tor effectively.
ta: இதன் விளைவாக கணிசமாக மெதுவான பிணையமாகும், இது முறையான பயனர்களுக்கு TOR ஐ திறம்பட இணைப்பது அல்லது பயன்படுத்துவது கடினம்.

source: These client-side attackers, while limited in their capabilities compared to more sophisticated attackers, can still pose significant risks to the network's performance and reliability.
ta: இந்த கிளையன்ட் பக்க தாக்குதல் நடத்தியவர்கள், அதிநவீன தாக்குதல்களுடன் ஒப்பிடும்போது அவர்களின் திறன்களில் மட்டுப்படுத்தப்பட்டிருந்தாலும், நெட்வொர்க்கின் செயல்திறன் மற்றும் நம்பகத்தன்மைக்கு குறிப்பிடத்தக்க அபாயங்களை இன்னும் ஏற்படுத்தக்கூடும்.

source: They could flood the network with an overwhelming amount of traffic using external services, or exploiting the Tor protocol itself.
ta: வெளிப்புற சேவைகளைப் பயன்படுத்தி அதிக அளவு போக்குவரத்து அல்லது டோர் நெறிமுறையை சுரண்டுவதன் மூலம் அவர்கள் நெட்வொர்க்கை வெள்ளம் செய்யலாம்.

source: This disruption can also frustrate relay operators, sometimes leading them to shut down their relays, which inadvertently weakens the network—a potential goal of the attacker.
ta: இந்த இடையூறு ரிலே ஆபரேட்டர்களையும் விரக்தியடையச் செய்யலாம், சில சமயங்களில் அவர்களின் ரிலேக்களை மூடுவதற்கு வழிவகுக்கும், இது கவனக்குறைவாக நெட்வொர்க்கை பலவீனப்படுத்துகிறது -இது தாக்குபவரின் சாத்தியமான குறிக்கோள்.

source: This traffic might not necessarily come from a single client but could be distributed across many clients in a coordinated attack.
ta: இந்த போக்குவரத்து ஒரு வாடிக்கையாளரிடமிருந்து வர வேண்டிய அவசியமில்லை, ஆனால் பல வாடிக்கையாளர்களிடையே ஒருங்கிணைந்த தாக்குதலில் விநியோகிக்கப்படலாம்.

source: Unlike more advanced attackers, they do not control any relays or infrastructure within the Tor network.
ta: மேம்பட்ட தாக்குபவர்களைப் போலல்லாமல், அவர்கள் டோர் நெட்வொர்க்கில் எந்த ரிலேக்கள் அல்லது உள்கட்டமைப்பையும் கட்டுப்படுத்த மாட்டார்கள்.

source: Client-side Attackers on the Tor Network
ta: TOR நெட்வொர்க்கில் கிளையன்ட் பக்க தாக்குதல் நடத்தியவர்கள்

source: ![An image showing positions of bad actors on the Tor network](/static/images/threat-model/threat-position.png "title='Threats to Tor' class='img-fluid'")
ta: ![TOR நெட்வொர்க்கில் மோசமான நடிகர்களின் நிலைகளைக் காட்டும் படம்](/static/images/threat-model/threat-position.png "title='Threats பெறுநர் Tor' class='img-fluid'")

source: Attackers can just use a Tor client or be an ISP/WiFi operator.
ta: தாக்குதல் நடத்துபவர்கள் ஒரு TOR கிளையண்டைப் பயன்படுத்தலாம் அல்லது ISP/WIFI ஆபரேட்டராக இருக்கலாம்.

source: By understanding these tactics, we can better protect the Tor network and its users from potential attacks.
ta: இந்த தந்திரோபாயங்களைப் புரிந்துகொள்வதன் மூலம், டோர் பிணையம் மற்றும் அதன் பயனர்களை சாத்தியமான தாக்குதல்களிலிருந்து சிறப்பாகப் பாதுகாக்க முடியும்.

source: The Tor network helps maintain online privacy and anonymity, but it is not immune to attacks.
ta: டோர் பிணையம் நிகழ்நிலை தனியுரிமை மற்றும் அநாமதேயத்தை பராமரிக்க உதவுகிறது, ஆனால் அது தாக்குதல்களுக்கு நோய் எதிர்ப்பு ஆற்றல் இல்லை.

source: They might also be part of the Network, or our community and engage in mailing list discussions, proposal work etc.
ta: அவை நெட்வொர்க்கின் ஒரு பகுதியாக இருக்கலாம், அல்லது எங்கள் சமூகமாக இருக்கலாம் மற்றும் அஞ்சல் பட்டியல் விவாதங்கள், முன்மொழிவு பணிகள் போன்றவற்றில் ஈடுபடலாம்.

source: This section explores the different ways attackers might position themselves on or around the Tor network.
ta: இந்த பிரிவு தாக்குதல் நடத்துபவர்கள் TOR நெட்வொர்க்கில் அல்லது அதைச் சுற்றியுள்ள பல்வேறு வழிகளை ஆராய்கிறது.

source: Understanding how attackers can position themselves as local clients or within the Tor network is crucial to safeguarding its users and ensuring the network remains secure.
ta: தாக்குதல் நடத்தியவர்கள் தங்களை உள்ளக வாடிக்கையாளர்களாக அல்லது டோர் நெட்வொர்க்குக்குள் எவ்வாறு நிலைநிறுத்திக் கொள்ள முடியும் என்பதைப் புரிந்துகொள்வது அதன் பயனர்களைப் பாதுகாப்பதற்கும், பிணையம் பாதுகாப்பாக இருப்பதை உறுதி செய்வதற்கும் முக்கியமானது.

source: We will examine the strategies they use, the risks they pose, and how these threats can be mitigated.
ta: அவர்கள் பயன்படுத்தும் உத்திகள், அவர்கள் எழுப்பும் அபாயங்கள் மற்றும் இந்த அச்சுறுத்தல்களை எவ்வாறு குறைக்க முடியும் என்பதை நாங்கள் ஆராய்வோம்.

source: Threat Positioning on the Tor Network
ta: TOR நெட்வொர்க்கில் அச்சுறுத்தல் நிலைப்படுத்தல்

source: ![An image showing positions of local threats on the Tor network](/static/images/threat-model/local.png "title='Local Threats' class='img-fluid'")
ta: ![TOR நெட்வொர்க்கில் உள்ளக அச்சுறுத்தல்களின் நிலைகளைக் காட்டும் படம்](/static/images/threat-model/local.png "title='Local Threats' class='img-fluid'")

source: ## Examples of Local Adversary Attacks
ta: ## உள்ளக விரோத தாக்குதல்களின் எடுத்துக்காட்டுகள்

source: ## How Local Adversaries attack the network
ta: ## உள்ளக விரோதிகள் நெட்வொர்க்கை எவ்வாறு தாக்குகிறார்கள்

source: - **Covert Channel Exploits:** If a local adversary additionally operates an exit relay (the final node in the Tor circuit before traffic exits to the internet), they could exploit certain vulnerabilities, such as dropped cells, to leak your information or deanonymize you secretly.
ta: - **Covert வாய்க்கால் Exploits:** If a local adversary additionally operates an exit அஞ்சல் சுருள் (the final கணு in the Tor சுற்று before traffic exits பெறுநர் the internet), they could exploit certain vulnerabilities, such அச் dropped cells, பெறுநர் leak your செய்தி or deanonymize you secretly.

source: - **NetFlow Analysis:** An ISP or hosting provider could perform [NetFlow analysis](https://gitlab.torproject.org/tpo/network-health/team/-/issues/42), a technique that monitors traffic flows in a network.
ta: - **NetFlow Analysis:** An ISP or hosting வழங்குநர் could perform [NetFlow analysis](https://gitlab.torproject.org/tpo/network-health/team/-/issues/42), a technique that monitors traffic flows in a network.

source: 1. **Controlling Traffic Routes:**
ta: 1. ** போக்குவரத்து வழிகளைக் கட்டுப்படுத்துதல்: **

source: 2. **Exploiting Information Leaks:**
ta: 2. ** செய்தி கசிவுகளை சுரண்டுவது: **

source: A dropped cell refers to a piece of data (called a cell) that is intentionally discarded or ignored by a node in the network, and when a cell is dropped, it means the data doesn't move forward in the network.
ta: கைவிடப்பட்ட செல் என்பது நெட்வொர்க்கில் ஒரு முனையால் வேண்டுமென்றே நிராகரிக்கப்படுகிறது அல்லது புறக்கணிக்கப்படுகிறது, மேலும் ஒரு செல் கைவிடப்படும்போது, நெட்வொர்க்கில் தரவு முன்னேறாது என்று பொருள்.

source: Although, the ISPs or hosting providers that manage the Tor relays you use to connect to the Tor network, as well as any other ISPs and routers along your path to the network, are also considered local adversaries.
ta: இருப்பினும், TOR நெட்வொர்க்குடன் இணைக்க நீங்கள் பயன்படுத்தும் TOR ரிலேக்களை நிர்வகிக்கும் ISP கள் அல்லது ஓச்டிங் வழங்குநர்கள், அதே போல் நெட்வொர்க்கிற்கான உங்கள் பாதையில் உள்ள வேறு எந்த ISP கள் மற்றும் ரவுட்டர்களும் உள்ளக விரோதிகளாக கருதப்படுகிறார்கள்.

source: By analyzing these flows, they might identify patterns that confirm whether specific traffic belongs to a particular user, thus aiding in deanonymization attempts.
ta: இந்த ஓட்டங்களை பகுப்பாய்வு செய்வதன் மூலம், குறிப்பிட்ட போக்குவரத்து ஒரு குறிப்பிட்ட பயனருக்கு சொந்தமானதா என்பதை உறுதிப்படுத்தும் வடிவங்களை அவை அடையாளம் காணக்கூடும், இதனால் டியனொனொனிமீசேசன் முயற்சிகளுக்கு உதவுகிறது.

source: By doing this, they increase their chances of monitoring your traffic and potentially deanonymizing you. This manipulation can be subtle and difficult for users to detect, making it a potent threat.
ta: இதைச் செய்வதன் மூலம், அவர்கள் உங்கள் போக்குவரத்தை கண்காணிப்பதற்கான வாய்ப்புகளை அதிகரிக்கின்றனர், மேலும் உங்களை நீர்த்துப்போகச் செய்யக்கூடும். இந்த கையாளுதல் பயனர்களைக் கண்டறிவது நுட்பமானதாகவும் கடினமாகவும் இருக்கும், இது ஒரு சக்திவாய்ந்த அச்சுறுத்தலாக மாறும்.

source: For example, these leaks might reveal patterns in your traffic that could make it easier for an attacker to deanonymize you or link your activities back to you.
ta: எடுத்துக்காட்டாக, இந்த கசிவுகள் உங்கள் போக்குவரத்தில் உள்ள வடிவங்களை வெளிப்படுத்தக்கூடும், இது ஒரு தாக்குபவர் உங்களை ஏமாற்றுவதை எளிதாக்கும் அல்லது உங்கள் செயல்பாடுகளை உங்களிடம் இணைப்பதை எளிதாக்குகிறது.

source: Local adversaries are in a unique position to take advantage of these leaks because they can closely monitor your connection to the Tor network.
ta: இந்த கசிவுகளைப் பயன்படுத்த உள்ளக விரோதிகள் ஒரு தனித்துவமான நிலையில் உள்ளனர், ஏனெனில் அவர்கள் TOR நெட்வொர்க்குடனான உங்கள் தொடர்பை நெருக்கமாக கண்காணிக்க முடியும்.

source: Local adversaries can manipulate the routing of your Tor traffic to ensure it only passes through Guards or Bridges (the first point of connection in the Tor network) that they control.
ta: உள்ளக விரோதிகள் உங்கள் டோர் போக்குவரத்தின் வழித்தடத்தை கையாளலாம், அது அவர்கள் கட்டுப்படுத்தும் காவலர்கள் அல்லது பாலங்கள் (டோர் நெட்வொர்க்கில் இணைப்பின் முதல் புள்ளி) வழியாக மட்டுமே செல்கிறது என்பதை உறுதிப்படுத்த முடியும்.

source: Local adversaries may not have the broad capabilities of those who control or monitor different relays in the network, but they are still dangerous because they can focus on the specific connections that pass through their systems.
ta: நெட்வொர்க்கில் வெவ்வேறு ரிலேக்களைக் கட்டுப்படுத்தும் அல்லது கண்காணிப்பவர்களின் பரந்த திறன்களை உள்ளக எதிரிகள் கொண்டிருக்கக்கூடாது, ஆனால் அவை இன்னும் ஆபத்தானவை, ஏனெனில் அவை அவற்றின் அமைப்புகள் வழியாக செல்லும் குறிப்பிட்ட இணைப்புகளில் கவனம் செலுத்த முடியும்.

source: Some of the key ways they can attack the Tor users include:
ta: TOR பயனர்களைத் தாக்கக்கூடிய சில முக்கிய வழிகள் பின்வருமாறு:

source: Their proximity to your connection path gives them unique opportunities to gather information or manipulate your traffic in ways that more distant adversaries cannot.
ta: உங்கள் இணைப்பு பாதைக்கு அவர்கள் அருகாமையில் இருப்பது தகவல்களைச் சேகரிக்க அல்லது உங்கள் போக்குவரத்தை அதிக தொலைதூர எதிரிகளால் செய்ய முடியாத வழிகளில் கையாளுவதற்கு தனித்துவமான வாய்ப்புகளை வழங்குகிறது.
