Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: 6. Actually HTTPS does give you a little bit more than Onion Services.
ta: 6. உண்மையில் HTTP கள் வெங்காய சேவைகளை விட இன்னும் கொஞ்சம் அதிகமாக தருகின்றன.

source: Alternatively, websites can provide other ways to verify their onion address using HTTPS, for example, linking their onion site address from an HTTPS-authenticated page, or using [Onion-Location](../onion-location/).
ta: மாற்றாக, வலைத்தளங்கள் HTTPS ஐப் பயன்படுத்தி தங்கள் வெங்காய முகவரியை சரிபார்க்க பிற வழிகளை வழங்க முடியும், எடுத்துக்காட்டாக, அவர்களின் வெங்காய தள முகவரியை ஒரு HTTPS- அங்கீகரிக்கப்பட்ட பக்கத்திலிருந்து இணைத்தல் அல்லது [வெங்காய இருப்பிடம்] (../ வெங்காய-இருப்பிடம்/) பயன்படுத்துதல்.

source: As ".onion" is a [special top level domain name](https://tools.ietf.org/html/rfc7686), most Certificate Authorities don't have support for issuing X.509 certificates for onion sites.
ta: ".Onion" என்பது ஒரு [சிறப்பு உயர்மட்ட டொமைன் பெயர்] (https://tools.ietf.org/html/rfc7686), பெரும்பாலான சான்றிதழ் அதிகாரிகளுக்கு வெங்காய தளங்களுக்கு x.509 சான்றிதழ்களை வழங்குவதற்கான உதவி இல்லை.

source: For example, in the case where the webserver isn't in the same location as the Tor program, you would need to use an HTTPS certificate to avoid exposing unencrypted traffic to the network in between the two.
ta: எடுத்துக்காட்டாக, டோர் நிரலின் அதே இடத்தில் வெப்சர்வர் இல்லாத நிலையில், இரண்டிற்கும் இடையில் பிணையத்திற்கு மறைகுறியாக்கப்பட்ட போக்குவரத்தை அம்பலப்படுத்துவதைத் தவிர்க்க நீங்கள் ஒரு HTTPS சான்றிதழைப் பயன்படுத்த வேண்டும்.

source: If this proposal gets implemented, an Onion Service operator could make their own HTTPS certificate chain using an onion key to sign it.
ta: இந்த திட்டம் செயல்படுத்தப்பட்டால், ஒரு வெங்காய பணி ஆபரேட்டர் தங்கள் சொந்த HTTPS சான்றிதழ் சங்கிலியை ஒரு வெங்காய விசையைப் பயன்படுத்தி கையொப்பமிட முடியும்.

source: In that case, just using Onion Services over HTTP could leak [secure cookies](https://community.torproject.org/onion-services/ecosystem/apps/web/onionspray/security/advisories/001-torbrowser/).
ta: அவ்வாறான நிலையில், HTTP க்கு மேல் வெங்காய சேவைகளைப் பயன்படுத்துவது [பாதுகாப்பான குக்கீகள்கள்] (https://community.torproject.org/onion-services/ecosystem/apps/web/onionspray/security/advisories/001-torbrowser/) கசியக்கூடும்.

source: In that case, your Onion Service will need to use an HTTPS certificate in order to function.
ta: அவ்வாறான நிலையில், உங்கள் வெங்காய பணி செயல்பட HTTPS சான்றிதழைப் பயன்படுத்த வேண்டும்.

source: In the nearby future, we hope that [Let's Encrypt](https://letsencrypt.org/) CA can start issuing v3 onion certificates for free.
ta: அருகிலுள்ள எதிர்காலத்தில், [குறியாக்கலாம்] (https://letsencrypt.org/) CA வி 3 வெங்காய சான்றிதழ்களை இலவசமாக வழங்கத் தொடங்கலாம் என்று நம்புகிறோம்.

source: Modern browsers indicate that a connection is insecure if not using TLS, and require that a TLS connection is authenticated by a CA-issued x.509 certificate.
ta: நவீன உலாவிகள் TLS ஐப் பயன்படுத்தாவிட்டால் ஒரு இணைப்பு பாதுகாப்பற்றது என்பதைக் குறிக்கிறது, மேலும் CA- வழங்கப்பட்ட X.509 சான்றிதழால் TLS இணைப்பு அங்கீகரிக்கப்பட வேண்டும்.

source: No certificate authority is required for this proof, because the name of the service is the actual public key used to authenticate the underlying connection.
ta: இந்த ஆதாரத்திற்கு எந்த சான்றிதழ் அதிகாரமும் தேவையில்லை, ஏனென்றால் சேவையின் பெயர் அடிப்படை இணைப்பை அங்கீகரிக்கப் பயன்படுத்தப்படும் உண்மையான பொது விசையாகும்.

source: Recently in 2020, the Certificate Authority/Browser Forum voted and [approved version 3 onion certificates](https://archive.cabforum.org/pipermail/servercert-wg/2020-February/001637.html), so CAs are now allowed to issue Domain Validation (DV) and Organization Validation (OV) certificates containing Tor onion addresses.
ta: அண்மைக் காலத்தில் 2020 ஆம் ஆண்டில், சான்றிதழ் ஆணையம்/உலாவி மன்றம் வாக்களித்தது மற்றும் [அங்கீகரிக்கப்பட்ட பதிப்பு 3 வெங்காய சான்றிதழ்கள்] (https://archive.cabforum.org/pipermail/servercert-wg/2020-february/001637.html), எனவே CAS இப்போது டொமைன் சரிபார்ப்பு (டி.வி.

source: Remember that there's no requirement for the webserver and the Tor process to be on the same machine.
ta: வெப்சர்வர் மற்றும் டோர் செயல்முறை ஒரே கணினியில் இருக்க வேண்டிய அவசியமில்லை என்பதை நினைவில் கொள்ளுங்கள்.

source: Right now, HTTPS certificates are only provided by:
ta: இப்போது, HTTPS சான்றிதழ்கள் மட்டுமே வழங்கப்படுகின்றன:

source: That said, there are some specific cases where you would need or want to have an HTTPS for your onion site.
ta: உங்கள் வெங்காய தளத்திற்கு ஒரு HTTP களை வைத்திருக்க விரும்பும் சில குறிப்பிட்ட வழக்குகள் உள்ளன.

source: There are some alternatives you might want to try to address this problem:
ta: இந்த சிக்கலை தீர்க்க நீங்கள் முயற்சிக்க விரும்பும் சில மாற்று வழிகள் உள்ளன:

source: There is an [open proposal](https://github.com/alecmuffett/onion-dv-certificate-proposal/blob/master/text/draft-muffett-same-origin-onion-certificates.txt) to allow Tor Browser to verify self-created HTTPS certificates.
ta: டோர் உலாவியை சுய-உருவாக்கப்பட்ட HTTPS சான்றிதழ்களை சரிபார்க்க டோர் உலாவியை அனுமதிக்க ஒரு [திறந்த முன்மொழிவு] (https://github.com/alecmuffett/onion-dv-cert-cert-putificate-propocal/blob/master/text/dext/draft-muffett-same-same-nion-certificates.txt) உள்ளது.

source: This way the content will work smoothly, independently of what website name it's being served from.
ta: இந்த வழியில் உள்ளடக்கம் சீராக செயல்படும், இது எந்த வலைத்தளத்தின் பெயரிலிருந்து வழங்கப்படுகிறது என்பதிலிருந்து சுயாதீனமாக செயல்படும்.

source: This will mean that you don't need to involve a third-party in making it, so no third-party will know that your onion exists.
ta: இது ஒரு மூன்றாம் தரப்பினரை உருவாக்குவதில் நீங்கள் ஈடுபட தேவையில்லை என்று பொருள், எனவே உங்கள் வெங்காயம் இருப்பதை மூன்றாம் தரப்பு அறியாது.

source: Tor Browser would know how to verify such a self-created chain.
ta: அத்தகைய சுய-உருவாக்கிய சங்கிலியை எவ்வாறு சரிபார்க்க வேண்டும் என்று டோர் உலாவிக்கு தெரியும்.

source: Tor Developers and UX team worked together to bring a new user experience for Tor Browser users, so when a user visits an onion site using HTTP, [Tor Browser doesn't display a warning or error message](https://support.torproject.org/onionservices/onionservices-5/).
ta: டோர் உலாவி பயனர்களுக்கான புதிய பயனர் அனுபவத்தைக் கொண்டுவருவதற்கு டோர் உருவாக்குபவர்கள் மற்றும் யுஎக்ச் குழு ஒன்றிணைந்து செயல்பட்டன, எனவே ஒரு பயனர் HTTP ஐப் பயன்படுத்தி ஒரு வெங்காய தளத்தைப் பார்வையிடும்போது, [TOR உலாவி ஒரு முன்னறிவிப்பு அல்லது பிழை செய்தியைக் காட்டாது] (https://support.torproject.org/onionservices/onionservices-5/).

source: Users would need to click and do a manual verification, and that would show that they're visiting the onion site that they're expecting.
ta: பயனர்கள் ஒரு கையேடு சரிபார்ப்பைக் சொடுக்கு செய்து செய்ய வேண்டும், மேலும் அவர்கள் எதிர்பார்க்கும் வெங்காய தளத்தை அவர்கள் பார்வையிடுகிறார்கள் என்பதை இது காண்பிக்கும்.

source: We compiled some topics and arguments, so you can analyze what's the best for your onion site:
ta: நாங்கள் சில தலைப்புகள் மற்றும் வாதங்களை தொகுத்தோம், எனவே உங்கள் வெங்காய தளத்திற்கு எது சிறந்தது என்பதை நீங்கள் பகுப்பாய்வு செய்யலாம்:

source: We wrote about [Tor Browser security expectations](https://blog.torproject.org/tor-brower-onion-services-challenges-opportunities), and how we're working on Onion Services usability and adoption.
ta: [TOR உலாவி பாதுகாப்பு எதிர்பார்ப்புகள்] (https://blog.torproject.org/tor-brower-onion- சேவைகள்-சேனெங்க்ச்-வாய்ப்புகள்), மற்றும் வெங்காய சேவைகள் பயன்பாட்டினை மற்றும் தத்தெடுப்பு ஆகியவற்றில் நாங்கள் எவ்வாறு செயல்படுகிறோம் என்பதைப் பற்றி எழுதினோம்.

source: When visiting a site over HTTPS (HTTP over TLS), the TLS protocol prevents data in transit from being read or manipulated by man in the middle attacks, and an x.509 certificate obtained from a Certificate Authority (CA) validates that the user is actually connecting to a server representing the domain name in the browser address bar.
ta: HTTPS (HTTP க்கு மேல் TLS) க்கு மேல் ஒரு தளத்தைப் பார்வையிடும்போது, TLS நெறிமுறை போக்குவரத்தில் தரவை நடுத்தர தாக்குதல்களில் மனிதனால் படிக்கவோ அல்லது கையாளவோ தடுக்கிறது, மேலும் ஒரு சான்றிதழ் அதிகாரசபையிலிருந்து (CA) பெறப்பட்ட X.509 சான்றிதழ் பயனர் என்பதை உறுதிப்படுத்துகிறது உலாவி முகவரி பட்டியில் உள்ள டொமைன் பெயரைக் குறிக்கும் சேவையகத்துடன் உண்மையில் இணைகிறது.

source: When visiting a site over the Onion Services protocol, the Tor protocol prevents data in transit from being read or manipulated by man in the middle attacks, and the Onion Service protocol validates that the user is connected to the domain name in the browser address bar.
ta: வெங்காய சேவைகள் நெறிமுறைக்கு மேல் ஒரு தளத்தைப் பார்வையிடும்போது, TOR நெறிமுறை நடுத்தர தாக்குதல்களில் மனிதனால் படிக்கப்படுவதிலோ அல்லது கையாளப்படுவதையோ தடுக்கிறது, மேலும் வெங்காய பணி நெறிமுறை பயனர் உலாவி முகவரி பட்டியில் டொமைன் பெயருடன் இணைக்கப்பட்டுள்ளது என்பதை உறுதிப்படுத்துகிறது.

source: While there is extensive criticism regarding HTTPS and the CA trust model, the information security community has taught users to look for HTTPS when visiting a website as a synonym of secure connection, and to avoid HTTP connections.
ta: HTTPS மற்றும் CA அறக்கட்டளை மாதிரி குறித்து விரிவான விமர்சனங்கள் இருக்கும்போது, தகவல் பாதுகாப்பு சமூகம் பயனர்களுக்கு பாதுகாப்பான இணைப்பின் ஒத்ததாக ஒரு வலைத்தளத்தைப் பார்வையிடும்போது HTTP களைத் தேடவும், HTTP இணைப்புகளைத் தவிர்க்கவும் கற்றுக் கொடுத்தது.

source: Learn why some onions have TLS certificates.
ta: சில வெங்காயத்தில் ஏன் டி.எல்.எச் சான்றிதழ்கள் உள்ளன என்பதை அறிக.

source: HTTPS for your Onion Service
ta: உங்கள் வெங்காய சேவைக்கு https

source: ### Apache
ta: ### அப்பாச்சி

source: ### Caddy
ta: ### கேடி

source: ### More information
ta: ### மேலும் செய்தி

source: ### Using an HTML `<meta>` attribute
ta: ### ஒரு உஉகுமொ `<meta>` பண்புக்கூறு பயன்படுத்துதல்

source: #### Limitations
ta: #### வரம்புகள்

source: * The Onion-Location value must be a valid URL with http: or https: protocol and a .onion hostname.
ta: * வெங்காய-இருப்பிட மதிப்பு http: அல்லது https: நெறிமுறை மற்றும் ஒரு. ஒனியன் ஓச்ட்பெயருடன் செல்லுபடியாகும் முகவரி ஆக இருக்க வேண்டும்.

source: * The webpage defining the Onion-Location header must be served over HTTPS.
ta: * வெங்காய இடத்தை வரையறுக்கும் வலைப்பக்கம் HTTPS வழியாக வழங்கப்பட வேண்டும்.

source: * The webpage defining the Onion-Location header must not be an onion site.
ta: * வெங்காய இடத்தை வரையறுக்கும் வலைப்பக்கம் வெங்காய தளமாக இருக்கக்கூடாது.

source: **Step 1.** Create an Onion service by setting the following in `torrc`:
ta: ** படி 1. ** பின்வருவனவற்றை `டோர்க்` இல் அமைப்பதன் மூலம் வெங்காய சேவையை உருவாக்கவும்:

source: **Step 1.** Enable headers and rewrite modules and reload Apache2
ta: ** படி 1. ** தலைப்புகளை இயக்கி தொகுதிகளை மீண்டும் எழுதவும், அப்பாச்சி 2 ஐ மீண்டும் ஏற்றவும்

source: **Step 2.** Add the Onion-Location header to your Virtual Host configuration file
ta: ** படி 2. ** உங்கள் மெய்நிகர் புரவலன் உள்ளமைவு கோப்பில் வெங்காய இருப்பிட தலைப்பைச் சேர்க்கவும்

source: **Step 2.** Edit website configuration file
ta: ** படி 2. ** வலைத்தள உள்ளமைவு கோப்பைத் திருத்தவும்

source: **Step 3.** Reload Apache
ta: ** படி 3. ** அப்பாச்சியை மீண்டும் ஏற்றவும்

source: **Step 3.** Test website configuration
ta: ** படி 3. ** வலைத்தள உள்ளமைவை சோதிக்கவும்

source: **Step 4.** Restart nginx
ta: ** படி 4. ** மறுதொடக்கம் nginx

source: **Step 4.** Testing your Onion-Location
ta: ** படி 4. ** உங்கள் வெங்காய இருப்பிடத்தை சோதித்தல்

source: **Step 5.** Testing your Onion-Location
ta: ** படி 5. ** உங்கள் வெங்காய இருப்பிடத்தை சோதித்தல்

source: **Testing it out:** Test it out with:
ta: ** இதைச் சோதித்தல்: ** இதைச் சோதிக்கவும்:

source: Caddy features [automatic HTTPS](https://caddyserver.com/docs/automatic-https) by default, so it provisions your TLS certificate and takes care of HTTP-to-HTTPS redirection for you.
ta: கேடி நற்பொருத்தங்கள் [தானியங்கி https] (https://caddyserver.com/docs/automatic-https) இயல்பாக, எனவே இது உங்கள் TLS சான்றிதழை வழங்குகிறது மற்றும் உங்களுக்காக http-to-https திருப்பிவிடுவதை கவனித்துக்கொள்கிறது.

source: Check your web server and operating system documentation.
ta: உங்கள் வலை சேவையகம் மற்றும் இயக்க முறைமை ஆவணங்களை சரிபார்க்கவும்.

source: For the header to be valid the following conditions need to be fulfilled:
ta: தலைப்பு செல்லுபடியாகும் வகையில் பின்வரும் நிபந்தனைகள் நிறைவு செய்யப்பட வேண்டும்:

source: For this reason, visitors are always redirected to the .onion URL specified in the content-part of the meta tag, regardless of which subpage they are on.
ta: இந்த காரணத்திற்காக, பார்வையாளர்கள் எப்போதுமே மேவு குறிச்சொல்லின் உள்ளடக்க-பாகத்தில் குறிப்பிடப்பட்டுள்ள. ஒனி முகவரி க்கு திருப்பி விடப்படுகிறார்கள், அவர்கள் எந்த துணைப்பிரிவில் இருந்தாலும் பொருட்படுத்தாமல்.

source: HTML cannot read the requested URL and insert it dynamically in the http-equiv `<meta>` tag.
ta: உஉகுமொ கோரப்பட்ட முகவரி ஐப் படித்து அதை HTTP-EQUIV `<Meta>` குறிச்சொல்லில் மாறும்.

source: Header set Onion-Location "http://your-onion-address.onion%{REQUEST_URI}s"
ta: தலைப்பு தொகுப்பு வெங்காய இடத்தை "http: //your-onion-address.onion% {REQUEST_URI} s"

source: If you're running a static site and have the onion address in a `$TOR_HOSTNAME` environment variable, your Caddyfile will look like this:
ta: நீங்கள் ஒரு நிலையான தளத்தை இயக்குகிறீர்கள் மற்றும் வெங்காய முகவரியை `$ tor_hostname` சுற்றுச்சூழல் மாறியில் வைத்திருந்தால், உங்கள் கேடிஃபைல் இப்படி இருக்கும்:

source: If you're using Caddy 2, to include an Onion-Location header, add the following declaration in your Caddyfile:
ta: நீங்கள் கேடி 2 ஐப் பயன்படுத்துகிறீர்கள் என்றால், வெங்காய இருப்பிட தலைப்பைச் சேர்க்க, உங்கள் கேடிஃபைலில் பின்வரும் அறிவிப்பைச் சேர்க்கவும்:

source: In `/etc/nginx/conf.d/<your-website>.conf` add the Onion-Location header and the Onion Service address.
ta: `/Etc/nginx/conf.d/ <your-website> .conf` இல் வெங்காய இருப்பிட தலைப்பு மற்றும் வெங்காய பணி முகவரியைச் சேர்க்கவும்.

source: Look for `onion-location` entry and the Onion Service address.
ta: `வெங்காய-இருப்பிடம்` நுழைவு மற்றும் வெங்காய பணி முகவரியைப் பாருங்கள்.

source: On this page, the commands to manage the web server are based on Debian-like operating systems and may differ from other systems.
ta: இந்த பக்கத்தில், வலை சேவையகத்தை நிர்வகிப்பதற்கான கட்டளைகள் டெபியன் போன்ற இயக்க முறைமைகளை அடிப்படையாகக் கொண்டவை மற்றும் பிற அமைப்புகளிலிருந்து வேறுபடலாம்.

source: Onion-Location is an easy way to advertise an onion site to the users.
ta: வெங்காய தளத்தை பயனர்களுக்கு விளம்பரப்படுத்த வெங்காய இருப்பிடம் ஒரு எளிதான வழியாகும்.

source: Or open the website in Tor Browser and a purple pill will appear in the address bar.
ta: அல்லது டோர் உலாவியில் வலைத்தளத்தைத் திறக்கவும், முகவரி பட்டியில் ஒரு ஊதா மாத்திரை தோன்றும்.

source: Or, open the web site in Tor Browser and a purple pill will appear in the address bar.
ta: அல்லது, டோர் உலாவியில் வலைத்தளத்தைத் திறக்கவும், முகவரி பட்டியில் ஒரு ஊதா மாத்திரை தோன்றும்.

source: Read the [Onion-Location spec](https://gitweb.torproject.org/tor-browser-spec.git/tree/proposals/100-onion-location-header.txt).
ta: [வெங்காய-இருப்பிட விவரக்குறிப்பு] (https://gitweb.torproject.org/tor-browser-spec.git/tree/proposals/100-onion-location-header.txt) ஐப் படிக்கவும்.

source: Reload the apache2 service, so your configuration changes take effect:
ta: அப்பாச்சி 2 சேவையை மீண்டும் ஏற்றவும், எனவே உங்கள் உள்ளமைவு மாற்றங்கள் நடைமுறைக்கு வருகின்றன:

source: The Onion-Location header would be equivalent to a `<meta http-equiv="onion-location" content="http://<your-onion-service-address>.onion" />` added in the HTML head element of the webpage. Replace `<your-onion-service-address.onion>` with the Onion Service that you want to redirect.
ta: வெங்காய-இருப்பிட தலைப்பு `<மெட்டா http-eciv =" வெங்காயம்-இருப்பிட "உள்ளடக்கம் =" http: // <உங்கள்-ஓனியன்-சேவை-முகவரி> .onion "/>` வலைப்பக்கத்தின் உஉகுமொ தலை உறுப்பில் சேர்க்கப்பட்ட. `<உங்கள்-உங்கள்-சேவை-சேவை-முகவரி.

source: The configuration file with the Onion-Location should look like this:
ta: வெங்காய இருப்பிடத்துடன் உள்ளமைவு கோப்பு இப்படி இருக்க வேண்டும்:

source: The identical behaviour of Onion-Location includes the option of defining it as a HTML `<meta>` http-equiv attribute.
ta: வெங்காய இருப்பிடத்தின் ஒரே மாதிரியான நடத்தை அதை ஒரு உஉகுமொ `<meta>` http-equiv பண்புக்கூறு என வரையறுக்கும் விருப்பத்தை உள்ளடக்கியது.

source: The web server should confirm that the new syntax is working:
ta: புதிய தொடரியல் செயல்படுகிறது என்பதை வலை சேவையகம் உறுதிப்படுத்த வேண்டும்:

source: Therefore, if possible, we recommend using one of the above methods.
ta: எனவே, முடிந்தால், மேலே உள்ள முறைகளில் ஒன்றைப் பயன்படுத்த பரிந்துரைக்கிறோம்.

source: This may be used by websites that prefer (or need) to define an Onion-Location by modifying the served HTML content instead of adding a new HTTP header.
ta: புதிய HTTP தலைப்பைச் சேர்ப்பதற்கு பதிலாக வழங்கப்பட்ட உஉகுமொ உள்ளடக்கத்தை மாற்றியமைப்பதன் மூலம் வெங்காய இருப்பிடத்தை வரையறுக்க விரும்பும் (அல்லது தேவை) வலைத்தளங்களால் இது பயன்படுத்தப்படலாம்.

source: To configure an Onion-Location header, the service operator should first configure an Onion service.
ta: வெங்காய இருப்பிட தலைப்பை உள்ளமைக்க, பணி ஆபரேட்டர் முதலில் வெங்காய சேவையை உள்ளமைக்க வேண்டும்.

source: To configure this header in Apache 2.2 or above, you will need to enable a `headers` and `rewrite` modules and edit the website Virtual Host file.
ta: இந்த தலைப்பை அப்பாச்சி 2.2 அல்லது அதற்கு மேல் உள்ளமைக்க, நீங்கள் ஒரு `தலைப்புகள்` மற்றும்` மீண்டும் எழுதுதல்` தொகுதிகளை இயக்க வேண்டும் மற்றும் வலைத்தள மெய்நிகர் புரவலன் கோப்பைத் திருத்த வேண்டும்.

source: To test if Onion-Location is working, fetch the website HTTP headers, for example:
ta: வெங்காய இருப்பிடம் செயல்படுகிறதா என்பதை சோதிக்க, எடுத்துக்காட்டாக, HTTP தலைப்புகள் என்ற வலைத்தளத்தைப் பெறுங்கள்:

source: Virtual Host example:
ta: மெய்நிகர் புரவலன் எடுத்துக்காட்டு:

source: Where `your-onion-address.onion` is the Onion Service address you want to redirect and `{REQUEST_URI}` is the [path component of the requested URI](https://httpd.apache.org/docs/2.4/mod/mod_rewrite.html), such as "/index.html".
ta: `Your-youn-address.onion` என்பது நீங்கள் திருப்பிவிட விரும்பும் வெங்காய பணி முகவரி மற்றும்` {REQUEST_URI} `என்பது கோரப்பட்ட யூரி இன் பாதை கூறு] (https://httpd.apache.org/docs/2.4/mod/mod_reit.

source: You can either configure a web server to show an Onion-Location Header or add an HTML `<meta>` attribute in the website.
ta: வெங்காய இருப்பிட தலைப்பைக் காட்ட நீங்கள் ஒரு வலை சேவையகத்தை உள்ளமைக்கலாம் அல்லது இணையதளத்தில் ஒரு உஉகுமொ `<meta>` பண்புக்கூறைச் சேர்க்கலாம்.

source: Learn how to set up an Onion-Location for your onion site.
ta: உங்கள் வெங்காய தளத்திற்கு வெங்காய இருப்பிடத்தை எவ்வாறு அமைப்பது என்பதை அறிக.

source: - Another common issue is whether to use HTTPS on your onionsite or not.
ta: - மற்றொரு பொதுவான சிக்கல் என்னவென்றால், உங்கள் வெங்காயத்தில் HTTPS ஐப் பயன்படுத்தலாமா வேண்டாமா.

source: - As mentioned [here](../../setup/), be careful of letting your web server reveal identifying information about you, your computer, or your location.
ta: - அச் mentioned [here](../../setup/), be careful of letting your விரலிடைத் தோல் சேவையகம் reveal identifying செய்தி பற்றி you, your computer, or your location.

source: - If your computer isn't online all the time, your Onion Service won't be either.
ta: - உங்கள் கணினி எப்போதும் ஆன்லைனில் இல்லை என்றால், உங்கள் வெங்காய சேவையும் இருக்காது.

source: - It is generally a better idea to host Onion Services on a Tor client rather than a Tor relay, since relay uptime and other properties are publicly visible.
ta: - ரிலே நேரம் மற்றும் பிற சொத்துக்கள் பொதுவில் காணக்கூடியதால், டோர் ரிலேவை விட டோர் கிளையண்டில் வெங்காய சேவைகளை புரவலன் செய்வது பொதுவாக ஒரு சிறந்த யோசனையாகும்.

source: - The longer an Onion Service is online, the higher the risk that its location is discovered.
ta: - நீண்ட வெங்காய பணி ஆன்லைனில் இருக்கும், அதன் இருப்பிடம் கண்டுபிடிக்கப்பட்ட இடர் அதிகம்.

source: - To protect your Onion Service from advanced attacks you should use [Vanguards addon](https://github.com/mikeperry-tor/vanguards), read [Tor blog about Vanguards](https://blog.torproject.org/announcing-vanguards-add-onion-services) and [Vanguards' Security README](https://github.com/mikeperry-tor/vanguards/blob/master/README_SECURITY.md).
ta: -மேம்பட்ட தாக்குதல்களிலிருந்து உங்கள் வெங்காய சேவையைப் பாதுகாக்க நீங்கள் [வான்கார்ட்ச் addon] (https://github.com/mikeperry-tor/vanguards) ஐப் பயன்படுத்த வேண்டும், [வான்கார்டுகளைப் பற்றி TOR வலைப்பதிவு] (https://blog.torbroject.org ReadMe] (https://github.com/mikeperry-tor/vanguards/blob/master/readme_security.md).

source: Also, here are some more anonymity issues you should keep in mind:
ta: மேலும், நீங்கள் மனதில் கொள்ள வேண்டிய இன்னும் சில பெயர் தெரியாத சிக்கல்கள் இங்கே:

source: For example, readers can probably determine whether it's thttpd or Apache, and learn something about your operating system.
ta: எடுத்துக்காட்டாக, வாசகர்கள் இது thttpd அல்லது அப்பாச்சி என்பதை தீர்மானிக்கலாம், மேலும் உங்கள் இயக்க முறைமையைப் பற்றி ஏதாவது கற்றுக்கொள்ளலாம்.

source: For some security suggestions please make sure you read over Riseup's ["Tor Hidden (Onion) Services Best Practices" document](https://riseup.net/en/security/network-security/tor/onionservices-best-practices).
ta: சில பாதுகாப்பு பரிந்துரைகளுக்கு, ரைச்அப்பின் ["டோர் மறைக்கப்பட்ட (வெங்காயம்) சேவைகள் சிறந்த நடைமுறைகள்" ஆவணம்] (https://riseup.net/en/security/network-security/tor/onionservices-best- நடைமுறைகள்) பற்றி நீங்கள் படித்திருக்கிறீர்கள் என்பதை உறுதிப்படுத்தவும்.

source: Have a look at [this post](https://blog.torproject.org/blog/facebook-hidden-services-and-https-certs) on the Tor Blog to learn more about these issues.
ta: இந்த சிக்கல்களைப் பற்றி மேலும் அறிய TOR வலைப்பதிவில் [இந்த இடுகையை] (https://blog.torproject.org/blog/facebook-didend-services-and-https-certs) பாருங்கள்.

source: Onion services operators need to practice proper [operational security](https://gitlab.torproject.org/legacy/trac/-/wikis/doc/OperationalSecurity) and system administration to maintain security.
ta: வெங்காய சேவைகள் ஆபரேட்டர்கள் முறையான [செயல்பாட்டு பாதுகாப்பு] (https://gitlab.torproject.org/legacy/trac/-/wikis/doc/operationalsecurity) மற்றும் கணினி நிர்வாகம் ஆகியவற்றைப் பயிற்சி செய்ய வேண்டும்.

source: The most prominent attacks are building a profile of the Onion Service's availability and matching induced traffic patterns.
ta: வெங்காய சேவையின் கிடைக்கும் தன்மை மற்றும் பொருத்தப்பட்ட தூண்டப்பட்ட போக்குவரத்து முறைகளின் சுயவிவரத்தை உருவாக்குவது மிக முக்கியமான தாக்குதல்கள்.

source: This leaks information to an observant adversary.
ta: இது ஒரு கவனிக்கும் எதிரிக்கு தகவலைக் கசிய வைக்கிறது.

source: Learn more tips to secure your Onion Services.
ta: உங்கள் வெங்காய சேவைகளைப் பாதுகாக்க மேலும் உதவிக்குறிப்புகளைக் அறிக.

source: Operational Security
ta: செயல்பாட்டு பாதுகாப்பு

source: "Vanity" onion addresses are a partial workaround for the difficulty of memorizing the 56-character-long onion addresses.
ta: "வேனிட்டி" வெங்காய முகவரிகள் 56-எழுத்து-நீளமான வெங்காய முகவரிகளை மனப்பாடம் செய்வதில் சிரமத்திற்கு ஒரு பகுதி வேலை.

source: ## Read more
ta: ## மேலும் வாசிக்க

source: ## Vanity address generation
ta: ## வேனிட்டி முகவரி உருவாக்கம்

source: * An attacker wishing to impersonate an existing onionsite by creating a fake version of it might use vanity addresses as an additional way to convince users that their address is the right one.
ta: * ஒரு போலி பதிப்பை உருவாக்குவதன் மூலம் ஏற்கனவே இருக்கும் வெங்காயத்தை ஆள்மாறாட்டம் செய்ய விரும்பும் தாக்குபவர், பயனர்கள் தங்கள் முகவரி சரியானது என்பதை நம்ப வைப்பதற்கான கூடுதல் வழியாக வேனிட்டி முகவரிகளைப் பயன்படுத்தலாம்.

source: * It consumes resources (time and energy): the bigger the vanity name, the longer (and more computing power) it takes.
ta: * இது வளங்களை பயன்படுத்துகிறது (நேரம் மற்றும் ஆற்றல்): பெரிய வேனிட்டி பெயர், நீண்ட (மேலும் கணினி சக்தி) எடுக்கும்.

source: * It has some branding appeal to site owners.
ta: * இது தள உரிமையாளர்களுக்கு சில பிராண்டிங் முறையீட்டைக் கொண்டுள்ளது.
