Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: ## Step 3: Restart Tor and check that it worked
ta: ## படி 3: டோர் மறுதொடக்கம் செய்து அது வேலை செய்ததா என்பதை சரிபார்க்கவும்

source: ## Step 4: Test that your Onion Service works
ta: ## படி 4: உங்கள் வெங்காய பணி செயல்படுகிறது என்பதை சோதிக்கவும்

source: ## Step 6: Security advice and more tips
ta: ## படி 6: பாதுகாப்பு அறிவுரை மற்றும் கூடுதல் உதவிக்குறிப்புகள்

source: * [Onion services best practices](https://riseup.net/en/security/network-security/tor/onionservices-best-practices) by Riseup Collective.
ta: * [Onion சேவைகள் best practices](https://riseup.net/en/security/network-security/tor/onionservices-best-practices) by Riseup Collective.

source: * [OnionScan](https://onionscan.org/) is a tool to check if your onionsite is leaking information that could compromise your anonymity like your server IP address.
ta: * [OnionScan](https://onionscan.org/) is a கருவி பெறுநர் சரிபார் if your onionsite is leaking செய்தி that could compromise your anonymity like your சேவையகம் IP address.

source: * [Operational Security](../advanced/opsec/).
ta: * [செயல்பாட்டு பாதுகாப்பு] (../ மேம்பட்ட/OPSEC/).

source: **Tip:** A good practice to avoid leaking an Onion Service to a local network is to run Onion Services over Unix sockets instead of a TCP socket.
ta: ** உதவிக்குறிப்பு: ** உள்ளக நெட்வொர்க்கிற்கு வெங்காய சேவையை கசிவதைத் தவிர்ப்பதற்கான ஒரு நல்ல நடைமுறை, டி.சி.பி சாக்கெட்டுக்கு பதிலாக யூனிக்ச் சாக்கெட்டுகள் மீது வெங்காய சேவைகளை இயக்குவது.

source: All the following `HiddenServicePort` lines refer to this `HiddenServiceDir` line, until you add another `HiddenServiceDir` line:
ta: பின்வரும் அனைத்து `hiddenserviceport` வரிகளும் இந்த` hiddenservicedir` வரியைக் குறிக்கின்றன, நீங்கள் மற்றொரு `hiddenservicedir` வரியைச் சேர்க்கும் வரை:

source: Apache is available in the main repository of multiple Linux and *BSD distributions.
ta: பல லினக்ச் மற்றும் *பி.எச்.டி விநியோகங்களின் முக்கிய களஞ்சியத்தில் அப்பாச்சி கிடைக்கிறது.

source: As a first step, you should set up a web server locally, like Nginx, Apache, or your favorite web server.
ta: முதல் படியாக, நீங்கள் ஒரு வலை சேவையகத்தை உள்நாட்டில் அமைக்க வேண்டும், Nginx, apache அல்லது உங்களுக்கு பிடித்த வலை சேவையகம்.

source: As an example, we will cover how to set up an onionsite with Nginx and Apache on Debian.
ta: உதாரணமாக, டெபியனில் என்சின்க்ச் மற்றும் அப்பாச்சியுடன் ஒரு வெங்காயத்தை எவ்வாறு அமைப்பது என்பதை நாங்கள் உள்ளடக்குவோம்.

source: As part of this guide, we will assume you have a functional Tor in your machine.
ta: இந்த வழிகாட்டியின் ஒரு பகுதியாக, உங்கள் கணினியில் ஒரு செயல்பாட்டு டோர் இருப்பதாக நாங்கள் கருதுவோம்.

source: By default, the web server will be running on `localhost:80` at the end of the installation.
ta: இயல்பாக, வலை சேவையகம் நிறுவலின் முடிவில் `லோக்கல் ஓச்ட்: 80` இல் இயங்கும்.

source: Depending on your operating system and setup, your Tor configuration file can be at a different location or look different.
ta: உங்கள் இயக்க முறைமை மற்றும் அமைப்பைப் பொறுத்து, உங்கள் TOR உள்ளமைவு கோப்பு வேறு இடத்தில் இருக்கலாம் அல்லது வித்தியாசமாக இருக்கலாம்.

source: Finally, if you plan to keep your service available for a long time, you might want to make a backup copy of the `private_key` file somewhere.
ta: இறுதியாக, உங்கள் சேவையை நீண்ட நேரம் கிடைக்கச் செய்ய நீங்கள் திட்டமிட்டால், `private_key` கோப்பின் காப்புப்பிரதி நகலை எங்காவது உருவாக்க விரும்பலாம்.

source: For example, in Nginx and using Tor with Unix sockets, the configuration would look like this:
ta: எடுத்துக்காட்டாக, NGINX இல் மற்றும் UNIX சாக்கெட்டுகளுடன் TOR ஐப் பயன்படுத்துதல், உள்ளமைவு இப்படி இருக்கும்:

source: For the technical details of how the Onion Service protocol works, see our Onion Service protocol page.
ta: வெங்காய பணி நெறிமுறை எவ்வாறு செயல்படுகிறது என்பதற்கான தொழில்நுட்ப விவரங்களுக்கு, எங்கள் வெங்காய பணி நெறிமுறை பக்கத்தைப் பார்க்கவும்.

source: If Tor starts up again, great. Otherwise, something is wrong. First look at your logfiles for hints.
ta: டோர் மீண்டும் தொடங்கினால், சிறந்தது. இல்லையெனில், ஏதோ தவறு. குறிப்புகளுக்கு முதலில் உங்கள் பதிவு கோப்புகளைப் பாருங்கள்.

source: If it doesn't work, look in your logs for some hints, and keep playing with it until it works.
ta: இது வேலை செய்யவில்லை என்றால், சில குறிப்புகளுக்கு உங்கள் பதிவுகளைப் பாருங்கள், அது செயல்படும் வரை அதனுடன் தொடர்ந்து விளையாடுங்கள்.

source: If you get stuck or want to do more, find a friend who can help you or join our [tor-onions](https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-onions) mailing list to speak with other operators.
ta: நீங்கள் சிக்கிக்கொண்டால் அல்லது மேலும் பலவற்றைச் செய்ய விரும்பினால், உங்களுக்கு உதவக்கூடிய ஒரு நண்பரைக் கண்டுபிடி அல்லது எங்கள் [டோர்-ஓனியன்ச்] (https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-onions) அஞ்சல் பட்டியலை மற்ற ஆபரேட்டர்களுடன் பேச.

source: If you have a static website, but never installed Nginx or Apache, another project to try is [OnionShare](https://onionshare.org), where running an onionsite will be easier: guided with a graphic interface and with minimal configuration.
ta: உங்களிடம் ஒரு நிலையான வலைத்தளம் இருந்தால், ஆனால் ஒருபோதும் Nginx அல்லது Apache ஐ நிறுவவில்லை என்றால், முயற்சிக்க வேண்டிய மற்றொரு திட்டம் [வெங்காயர்] (https://onionshare.org), அங்கு ஒரு வெங்காயத்தை இயக்குவது எளிதாக இருக்கும்: கிராஃபிக் இடைமுகத்துடன் வழிகாட்டும் மற்றும் குறைந்தபட்ச உள்ளமைவுடன்.

source: If you want to forward multiple virtual ports for a single Onion Service, just add more `HiddenServicePort` lines.
ta: ஒற்றை வெங்காய சேவைக்கு பல மெய்நிகர் துறைமுகங்களை அனுப்ப விரும்பினால், மேலும் `hiddenserviceport` வரிகளைச் சேர்க்கவும்.

source: If you want to run multiple Onion Services from the same Tor client, just add another `HiddenServiceDir` line.
ta: ஒரே டோர் கிளையண்டிலிருந்து பல வெங்காய சேவைகளை இயக்க விரும்பினால், மற்றொரு `hiddenservicedir` வரியைச் சேர்க்கவும்.

source: If you're running multiple onionsites on the same web server, remember to edit your web server virtual host file and add the onion address for each website.
ta: ஒரே வலை சேவையகத்தில் நீங்கள் பல வெங்காயத்தை இயக்குகிறீர்கள் என்றால், உங்கள் வலை சேவையக மெய்நிகர் புரவலன் கோப்பைத் திருத்தவும், ஒவ்வொரு வலைத்தளத்திற்கும் வெங்காய முகவரியைச் சேர்க்கவும் நினைவில் கொள்ளுங்கள்.

source: If your keys leak, other people can impersonate your Onion Service, deeming it compromised, useless, and dangerous to visit.
ta: உங்கள் சாவிகள் கசிந்தால், மற்றவர்கள் உங்கள் வெங்காய சேவையை ஆள்மாறாட்டம் செய்து, வேறுபாடின்மை, பயனற்றவர்கள் மற்றும் பார்வையிட ஆபத்தானவர்கள் என்று கருதலாம்.

source: It is important to note that an Onion Service configured like this will be readable by anybody who knows or discovers the address.
ta: இது போன்ற கட்டமைக்கப்பட்ட வெங்காய பணி முகவரியை அறிந்த அல்லது கண்டுபிடிக்கும் எவராலும் படிக்கக்கூடியது என்பதை கவனத்தில் கொள்ள வேண்டும்.

source: It will print some warnings or error messages. That should give you an idea of what went wrong.
ta: இது சில எச்சரிக்கைகள் அல்லது பிழை செய்திகளை அச்சிடும். என்ன தவறு நடந்தது என்பது பற்றிய ஒரு யோசனையை அது உங்களுக்கு வழங்க வேண்டும்.

source: Make sure this is the case.
ta: இதுதான் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: Nginx is available in the main repository of multiple Linux and *BSD distributions.
ta: பல லினக்ச் மற்றும் *பி.எச்.டி விநியோகங்களின் முக்கிய களஞ்சியத்தில் NGINX கிடைக்கிறது.

source: Now save your `torrc` and restart Tor.
ta: இப்போது உங்கள் `டோர்க்` ஐ சேமித்து டோர் மறுதொடக்கம் செய்யுங்கள்.

source: Now that you have an onionsite working, you may want to deploy [Onion-Location](../advanced/onion-location/), or use tools like Docker, [Heroku](https://gitlab.torproject.org/hiro/onions-on-heroku), [Terraform](https://gitlab.torproject.org/hiro/terraform-onions), [Ansible](https://galaxy.ansible.com/systemli/onion) or [stem](https://stem.torproject.org/tutorials/over_the_river.html) to automate the management of your Onion Services.
ta: இப்போது உங்களுக்கு ஒரு வெங்காய வேலை உள்ளது, நீங்கள் [வெங்காய-இருப்பிடத்தை] (../ மேம்பட்ட/வெங்காய-இருப்பிடத்தை/) வரிசைப்படுத்த விரும்பலாம், அல்லது கப்பல்துறை, [ஈரோகு] (https://gitlab.torproject.org/hiro/onions-on-heroku போன்ற கருவிகளைப் பயன்படுத்தலாம்), . சேவைகள்.

source: Now to get your Onion Service address, go to your `HiddenServiceDir` directory, and find a file named `hostname`.
ta: இப்போது உங்கள் வெங்காய பணி முகவரியைப் பெற, உங்கள் `hiddenservicedir` கோப்பகத்திற்குச் சென்று,` ஓச்ட்பெயர்` என்ற கோப்பைக் கண்டறியவும்.

source: Now you can connect to your Onion Service using Tor Browser, and you should get the HTML page you set up back in **Step 1**.
ta: இப்போது நீங்கள் டோர் உலாவியைப் பயன்படுத்தி உங்கள் வெங்காய சேவையுடன் இணைக்கலாம், மேலும் நீங்கள் அமைக்கும் உஉகுமொ பக்கத்தை ** படி 1 ** இல் பெற வேண்டும்.

source: Once your web server is set up, make sure it works: open your browser and go to http://localhost/.
ta: உங்கள் வலை சேவையகம் அமைக்கப்பட்டதும், அது செயல்படுவதை உறுதிசெய்து கொள்ளுங்கள்: உங்கள் உலாவியைத் திறந்து http: // localhost/க்குச் செல்லவும்.

source: Onion services version 2 is deprecated and is no longer supported since the 0.4.6.1-alpha Tor release, in 2021.
ta: வெங்காய சேவைகள் பதிப்பு 2 நீக்கப்பட்டது மற்றும் 2021 ஆம் ஆண்டில் 0.4.6.1-ஆல்பா டோர் வெளியீட்டிலிருந்து இனி ஆதரிக்கப்படாது.

source: Please read the blog post [Onion Service version deprecation timeline](https://blog.torproject.org/v2-deprecation-timeline) for more information.
ta: மேலும் தகவலுக்கு வலைப்பதிவு இடுகையை [வெங்காய பணி பதிப்பு தேய்மான காலவரிசை] (https://blog.torproject.org/v2-deprecation-timeline) படிக்கவும்.

source: Read more about [Client authorization](../advanced/client-auth/) documentation.
ta: [கிளையன்ட் அங்கீகாரம்] (../ மேம்பட்ட/கிளையன்ட்-ஆத்/) ஆவணங்களைப் பற்றி மேலும் வாசிக்க.

source: Setting up a web server can be complex.
ta: வலை சேவையகத்தை அமைப்பது சிக்கலானது.

source: Some onionsite operators may not want to disclose their Onion Service location.
ta: சில வெங்காய ஆபரேட்டர்கள் தங்கள் வெங்காய பணி இருப்பிடத்தை வெளியிட விரும்ப மாட்டார்கள்.

source: That is not an easy task, and these resources will help on how to make this possible:
ta: இது எளிதான பணி அல்ல, இதை எவ்வாறு சாத்தியமாக்குவது என்பதற்கு இந்த ஆதாரங்கள் உதவும்:

source: The `HiddenServiceDir` line specifies the directory which should contain information and cryptographic keys for your Onion Service.
ta: `Hiddenservicedir` வரி உங்கள் வெங்காய சேவைக்கான செய்தி மற்றும் கிரிப்டோகிராஃபிக் விசைகளைக் கொண்டிருக்க வேண்டிய கோப்பகத்தைக் குறிப்பிடுகிறது.

source: The `HiddenServicePort` line specifies a _virtual port_ (that is, the port that people visiting your Onion Service will be using), and in the above case it says that any traffic incoming to port 80 of your Onion Service should be redirected to `127.0.0.1:80` (which is where the web server from step 1 is listening).
ta: `Hiddenserviceport` வரி ஒரு _ மாறுபட்ட போர்ட்_ (அதாவது, உங்கள் வெங்காய சேவையைப் பார்வையிடும் நபர்கள் பயன்படுத்தும் துறைமுகம்) குறிப்பிடுகிறது, மேலும் மேற்கண்ட வழக்கில், உங்கள் வெங்காய சேவையின் 80 போர்ட்டுக்கு உள்வரும் எந்தவொரு போக்குவரத்தும்` 127.0 க்கு திருப்பி விடப்பட வேண்டும் என்று கூறுகிறது .0.1: 80` (இது படி 1 இலிருந்து வலை சேவையகம் கேட்கிறது).

source: The `hostname` file in your Onion Service configuration directory contains the hostname for your new onion v3 service.
ta: உங்கள் வெங்காய பணி உள்ளமைவு கோப்பகத்தில் உள்ள `ஓச்ட்பெயர்` கோப்பில் உங்கள் புதிய வெங்காய வி 3 சேவைக்கான ஓச்ட்பெயர் உள்ளது.

source: The default version of Onion Services is version 3 and its address is 56 characters long, without the `http://` and `.onion` parts.
ta: வெங்காய சேவைகளின் இயல்புநிலை பதிப்பு என்பது பதிப்பு 3 மற்றும் அதன் முகவரி 56 எழுத்துக்கள் நீளமானது, `http://` மற்றும் `.onion` பாகங்கள் இல்லாமல்.

source: The next step is opening the config file of Tor (torrc) and doing the appropriate configurations to setup an Onion Service.
ta: அடுத்த கட்டம் டோர் (டோர்க்) இன் கட்டமைப்பு கோப்பைத் திறந்து, வெங்காய சேவையை அமைப்பதற்கு பொருத்தமான உள்ளமைவுகளைச் செய்வது.

source: The other files are your Onion Service keys, so it is imperative that these are kept private.
ta: மற்ற கோப்புகள் உங்கள் வெங்காய பணி விசைகள், எனவே இவை தனிப்பட்டதாக வைத்திருப்பது கட்டாயமாகும்.

source: Then try putting a file in the main HTML directory, and make sure it shows up when you access the site.
ta: முதன்மையான உஉகுமொ கோப்பகத்தில் ஒரு கோப்பை வைக்க முயற்சிக்கவும், நீங்கள் தளத்தை அணுகும்போது அது காண்பிக்கப்படுவதை உறுதிசெய்க.

source: Therefore, you need to configure your web server so it doesn't give away any information about you, your computer, or your location.
ta: எனவே, உங்கள் வலை சேவையகத்தை நீங்கள் கட்டமைக்க வேண்டும், எனவே இது உங்களைப் பற்றியும், உங்கள் கணினி அல்லது உங்கள் இருப்பிடத்தைப் பற்றிய எந்த தகவலையும் கொடுக்காது.

source: This guide shows you how to set up an Onion Service for your website.
ta: உங்கள் வலைத்தளத்திற்கு வெங்காய சேவையை எவ்வாறு அமைப்பது என்பதை இந்த வழிகாட்டி உங்களுக்குக் காட்டுகிறது.

source: To install `apache2` package:
ta: `அப்பாச்சி 2` தொகுப்பை நிறுவ:

source: To install `nginx` package:
ta: `Nginx` தொகுப்பை நிறுவ:

source: To set up Tor, please follow the [Tor installation guide](./install/).
ta: டோர் அமைக்க, தயவுசெய்து [TOR நிறுவல் வழிகாட்டி] (./ நிறுவல்/) ஐப் பின்பற்றவும்.

source: Tor should be up and running correctly for this guide to work.
ta: இந்த வழிகாட்டி வேலை செய்ய டோர் சரியாக இயங்க வேண்டும்.

source: Typically, there are typos in the `torrc` or wrong directory permissions (See the [logging FAQ](https://www.torproject.org/docs/faq#Logs) entry if you don't know how to enable or find your log file.)
ta: பொதுவாக, `டோர்க்` அல்லது தவறான அடைவு அனுமதிகளில் எழுத்துப்பிழைகள் உள்ளன ([பதிவுசெய்தல் கேள்விகள்] (https://www.torproject.org/docs/faq#logs) நுழைவு பார்க்கவும் உங்கள் பதிவு கோப்பை எவ்வாறு இயக்குவது அல்லது கண்டுபிடிப்பது என்று உங்களுக்குத் தெரியாவிட்டால்).

source: We recommend you install a new separate web server for your Onion Service, since even if you already have one installed, you may be using it (or want to use it later) for a regular website.
ta: உங்கள் வெங்காய சேவைக்கு ஒரு புதிய தனி வலை சேவையகத்தை நிறுவ பரிந்துரைக்கிறோம், ஏனெனில் நீங்கள் ஏற்கனவே ஒன்றை நிறுவியிருந்தாலும், வழக்கமான வலைத்தளத்திற்கு நீங்கள் அதைப் பயன்படுத்தலாம் (அல்லது பின்னர் பயன்படுத்த விரும்புகிறீர்கள்).

source: When Tor starts, it will automatically create the `HiddenServiceDir` that you specified (if necessary).
ta: டோர் தொடங்கும் போது, நீங்கள் குறிப்பிட்ட `hiddenservicedir` ஐ அது தானாகவே உருவாக்கும் (தேவைப்பட்டால்).

source: You can make Onion Services require authentication, and only users with a private key will access the service.
ta: நீங்கள் வெங்காய சேவைகளுக்கு ஏற்பு தேவைப்படலாம், மேலும் தனிப்பட்ட விசையை கொண்ட பயனர்கள் மட்டுமே சேவையை அணுகுவார்கள்.

source: You should also know where Tor's configuration files are.
ta: டோரின் உள்ளமைவு கோப்புகள் எங்கே என்பதையும் நீங்கள் அறிந்து கொள்ள வேண்டும்.

source: You will need to add the following two lines to your `torrc` file:
ta: உங்கள் `டோர்க்` கோப்பில் பின்வரும் இரண்டு வரிகளை நீங்கள் சேர்க்க வேண்டும்:

source: You will want to change the `HiddenServiceDir` line, so that it points to an actual directory that is readable/writeable by the user that will be running Tor.
ta: நீங்கள் `hiddenservicedir` வரியை மாற்ற விரும்புவீர்கள், இதனால் இது ஒரு உண்மையான கோப்பகத்தை சுட்டிக்காட்டுகிறது, இது பயனரால் படிக்கக்கூடிய/எழுதக்கூடியது.

source: Get Started
ta: ஆரம்பி

source: Learn how to set up an onionsite of your very own.
ta: உங்கள் சொந்த வெங்காயத்தை எவ்வாறு அமைப்பது என்பதை அறிக.

source: Set up Your Onion Service
ta: உங்கள் வெங்காய சேவையை அமைக்கவும்

source: ### Debian / Ubuntu
ta: ### டெபியன் / உபுண்டு

source: ### Fedora
ta: ### ஃபெடோரா

source: ### Installing Tor from source
ta: ### மூலத்திலிருந்து TOR ஐ நிறுவுதல்

source: ### macOS
ta: ### மேகோச்

source: **Admin access:** To install Tor you need root privileges.
ta: ** நிர்வாக அணுகல்: ** டோர் நிறுவ உங்களுக்கு ரூட் சலுகைகள் தேவை.

source: **Do not use the packages in Ubuntu's universe**.
ta: ** உபுண்டு யுனிவர்சில் உள்ள தொகுப்புகளைப் பயன்படுத்த வேண்டாம் **.

source: 1. Configure Tor Package repository
ta: 1. டோர் தொகுப்பு களஞ்சியத்தை உள்ளமைக்கவும்

source: 1. Configure Tor package repository
ta: 1. டோர் தொகுப்பு களஞ்சியத்தை உள்ளமைக்கவும்

source: 1. Download latest release and dependencies
ta: 1. அண்மைக் கால வெளியீடு மற்றும் சார்புகளை பதிவிறக்கவும்

source: 1. Install a package manager
ta: 1. ஒரு தொகுப்பு மேலாளரை நிறுவவும்

source: 1. Package Installation
ta: 1. தொகுப்பு நிறுவல்

source: 1. Package installation
ta: 1. தொகுப்பு நிறுவல்

source: 2. Install Tor
ta: 2. டோர் நிறுவவும்

source: 2. Package installation
ta: 2. தொகுப்பு நிறுவல்

source: Add the following to /etc/yum.repos.d/tor.repo and then install the tor package.
ta: பின்வருவனவற்றை /etc/yum.repos.d/tor.repo இல் சேர்த்து TOR தொகுப்பை நிறுவவும்.

source: Below all commands that need to be run as root user like apt and dpkg are prepended with '#', while commands to be run as user with '$' resembling the standard prompt in a terminal.
ta: APT மற்றும் DPKG போன்ற ரூட் பயனராக இயக்க வேண்டிய அனைத்து கட்டளைகளுக்கும் கீழே '#' உடன் தயாரிக்கப்படுகிறது, அதே நேரத்தில் ஒரு முனையத்தில் நிலையான வரியில் ஒத்த '$' பயனராக இயக்கப்பட வேண்டிய கட்டளைகள்.

source: Enable the Torproject package repository by following the [instructions](https://support.torproject.org/apt/tor-deb-repo/).
ta: [அறிவுறுத்தல்கள்] (https://support.torproject.org/apt/tor-deb-repo/) ஐப் பின்பற்றுவதன் மூலம் டோர்ப்ரோசெக்ட் தொகுப்பு களஞ்சியத்தை இயக்கவும்.

source: If you are using Homebrew in a Terminal window, run:
ta: நீங்கள் ஒரு முனைய சாளரத்தில் ஓம்பிரூவைப் பயன்படுத்துகிறீர்கள் என்றால், இயக்கவும்:

source: If you are using Macports in a Terminal window, run:
ta: நீங்கள் ஒரு முனைய சாளரத்தில் மேக்போர்ட்சைப் பயன்படுத்துகிறீர்கள் என்றால், இயக்கவும்:

source: If you're building from source, first install [libevent](http://www.monkey.org/~provos/libevent/), and make sure you have openssl and zlib (including the -devel packages if applicable).
ta: நீங்கள் மூலத்திலிருந்து கட்டியெழுப்பினால், முதலில் [libevent](http://www.monkey.org/~provos/libevent/) ஐ நிறுவவும், உங்களிடம் OpenSSL மற்றும் ZLIB (பொருந்தினால் -tevel தொகுப்புகள் உட்பட) இருப்பதை உறுதிசெய்க.

source: In the past they have not reliably been updated. That means you could be missing stability and security fixes.
ta: கடந்த காலத்தில் அவை நம்பத்தகுந்த வகையில் புதுப்பிக்கப்படவில்லை. அதாவது நீங்கள் ச்திரத்தன்மை மற்றும் பாதுகாப்பு திருத்தங்களை காணவில்லை.

source: Now you can run tor as src/app/tor (0.4.3.x and later), or you can run `make install` (as root if necessary) to install it into /usr/local/, and then you can start it just by running tor.
ta: இப்போது நீங்கள் TOR ஐ SRC/App/TOR (0.4.3.x மற்றும் அதற்குப் பிறகு) ஆக இயக்கலாம், அல்லது/usr/local/இல் நிறுவ `நிறுவலை (தேவைப்பட்டால் ரூட் என) இயக்கலாம், பின்னர் டோர் இயக்குவதன் மூலம் அதைத் தொடங்கலாம்.

source: The latest release of Tor can be found on the [download](https://www.torproject.org/download/tor/) page.
ta: TOR இன் அண்மைக் கால வெளியீட்டை [பதிவிறக்கம்](https://www.torproject.org/download/tor/) பக்கத்தில் காணலாம்.

source: There are two package manager on OS X: Homebrew and Macports.
ta: OS ஃச் இல் இரண்டு தொகுப்பு மேலாளர்கள் உள்ளனர்: ஓம்பிரூ மற்றும் மேக்போர்ட்ச்.

source: To install Homebrew follow the instructions on [brew.sh](https://brew.sh/).
ta: ஓம்பிரூவை நிறுவ [bure.sh](https://brew.sh/) இல் உள்ள வழிமுறைகளைப் பின்பற்றவும்.

source: To install Macports follow the instructions on [macports.org/install.php](https://www.macports.org/install.php).
ta: மேக்போர்ட்சை நிறுவ [macports.org/install.php ](https://www.macports.org/install.php) இல் உள்ள வழிமுறைகளைப் பின்பற்றவும்.

source: To open a root terminal you have several options: sudo su, or sudo -i, or su -i. Note that sudo asks for your user password, while su expects the root password of your system.
ta: ரூட் முனையத்தைத் திறக்க உங்களுக்கு பல விருப்பங்கள் உள்ளன: சுடோ சு, அல்லது சுடோ -ஐ, அல்லது சு -ஐ. சூடோ உங்கள் பயனர் கடவுச்சொல்லைக் கேட்கிறார் என்பதை நினைவில் கொள்க, அதே நேரத்தில் சு உங்கள் கணினியின் ரூட் கடவுச்சொல்லை எதிர்பார்க்கிறது.

source: You can use the package manager of your choice.
ta: உங்கள் விருப்பப்படி தொகுப்பு மேலாளரைப் பயன்படுத்தலாம்.

source: How to install Tor
ta: TOR ஐ எவ்வாறு நிறுவுவது

source: "I first saw the need for this tool when I learned about how David Miranda, the partner of my colleague Glenn Greenwald, got detained for nine hours at a London airport while he was trying to fly home to Brazil.
ta: "எனது சகாவான க்ளென் கிரீன்வால்டின் பங்காளியான டேவிட் மிராண்டா, பிரேசிலுக்கு வீட்டிற்கு பறக்க முயன்றபோது லண்டன் விமான நிலையத்தில் ஒன்பது மணி நேரம் தடுத்து வைக்கப்பட்டார் என்பதைப் பற்றி அறிந்தபோது இந்த கருவியின் தேவையை நான் முதலில் பார்த்தேன்.

source: "You know what you're saying during a phone call, or what you're writing in an email. But you have hardly any control over the metadata you produce, because it is generated automatically. [...] In sum, metadata can tell your surveillant virtually everything they'd ever want or need to know about you, except what's actually going on inside your head."
ta: "ஒரு தொலைபேசி அழைப்பின் போது நீங்கள் என்ன சொல்கிறீர்கள், அல்லது நீங்கள் ஒரு மின்னஞ்சலில் எழுதுகிறீர்கள் என்பது உங்களுக்குத் தெரியும். ஆனால் நீங்கள் தயாரிக்கும் மெட்டாடேட்டாவின் மீது உங்களுக்கு எந்த கட்டுப்பாடும் இல்லை, ஏனெனில் அது தானாகவே உருவாக்கப்படுகிறது. [...] மொத்தத்தில், மேனிலை தரவு உங்கள் தலைக்குள் உண்மையில் என்ன நடக்கிறது என்பதைத் தவிர, அவர்கள் விரும்பும் அல்லது உங்களைப் பற்றி தெரிந்து கொள்ள வேண்டிய அனைத்தையும் உங்கள் கண்காணிப்பாளரிடம் சொல்ல முடியும். "

source: ### Decentralization
ta: ### பரவலாக்கம்

source: ### Educate users about privacy by design
ta: ### வடிவமைப்பு மூலம் தனியுரிமை பற்றி பயனர்களுக்கு கல்வி கற்பித்தல்

source: ### Freedom of Press and Censorship Circumvention
ta: ### செய்தித் தாள் விடுதலை மற்றும் தணிக்கை சுற்றறிக்கை

source: ### How Onion Services Work
ta: ### வெங்காய சேவைகள் எவ்வாறு செயல்படுகின்றன

source: ### Level up your service privacy
ta: ### உங்கள் பணி தனியுரிமையை சமன் செய்யுங்கள்

source: ### Metadata obfuscation or elimination
ta: ### மேனிலை தரவு ஒடுக்குமுறை அல்லது நீக்குதல்

source: ### Network sustainability
ta: ### பிணைய நிலைத்தன்மை

source: ### One onion a day keeps the surveillance away
ta: ### ஒரு நாளைக்கு ஒரு வெங்காயம் கண்காணிப்பை விலக்கி வைக்கிறது

source: ### Protect sources, whistleblowers, and journalists
ta: ### ஆதாரங்கள், விசில்ப்ளோயர்கள் மற்றும் பத்திரிகையாளர்களைப் பாதுகாக்கவும்

source: * "We launched this in part because we do a lot of reporting, writing, and coding about issues like media censorship, digital privacy and surveillance, and breaches of private medical information. Readers use our interactive databases to see data that reveals a lot about themselves, such as whether their doctor receives payments from drug companies. Our readers should never need to worry that somebody else is watching what they’re doing on our site. So we made our site available as a Tor hidden service (Onion Service) to give readers a way to browse our site while leaving behind less of a digital trail." [ProPublica](https://www.propublica.org/nerds/a-more-secure-and-anonymous-propublica-using-tor-hidden-services)
ta: * "நாங்கள் இதை ஒரு பகுதியாக அறிமுகப்படுத்தினோம், ஏனென்றால் ஊடக தணிக்கை, டிசிட்டல் தனியுரிமை மற்றும் கண்காணிப்பு மற்றும் தனியார் மருத்துவ தகவல்களை மீறுதல் போன்ற சிக்கல்களைப் பற்றி நாங்கள் நிறைய அறிக்கையிடல், எழுதுதல் மற்றும் குறியீடுகளைச் செய்கிறோம். வாசகர்கள் தங்களைப் பற்றி நிறைய வெளிப்படுத்தும் தரவைக் காண எங்கள் ஊடாடும் தரவுத்தளங்களைப் பயன்படுத்துகிறார்கள், எங்கள் மருத்துவரிடம் எங்கள் வாசகர்களைப் பற்றி ஒருபோதும் கவலைப்படுவதில்லை. சேவை) டிசிட்டல் பாதையை குறைவாக விட்டுவிடும்போது எங்கள் தளத்தை உலாவ வாசகர்களுக்கு ஒரு வழியைக் கொடுக்க. " .

source: * Decentralization
ta: * பரவலாக்கம்

source: * Educate users about privacy by design
ta: * வடிவமைப்பு மூலம் தனியுரிமை பற்றி பயனர்களுக்கு கல்வி கற்பித்தல்

source: * Freedom of Press and Censorship Circumvention
ta: * செய்தித் தாள் விடுதலை மற்றும் தணிக்கை சுற்றறிக்கை

source: * How Onion Services Work
ta: * வெங்காய சேவைகள் எவ்வாறு செயல்படுகின்றன
