Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: These attackers include entities like your WiFi router administrator, Internet Service Provider (ISP), hosting provider, or Virtual Private Network (VPN) service.
ta: இந்த தாக்குதல் செய்பவர்களில் உங்கள் வைஃபை திசைவி நிர்வாகி, இணைய பணி வழங்குநர் (ஐ.எச்.பி), ஓச்டிங் வழங்குநர் அல்லது மெய்நிகர் தனியார் பிணையம் (விபிஎன்) பணி போன்ற நிறுவனங்கள் அடங்கும்.

source: These local adversaries can execute a variety of attacks, including:
ta: இந்த உள்ளக விரோதிகள் பலவிதமான தாக்குதல்களைச் செய்ய முடியும்:

source: This method, known as a dropped cells covert channel vector, could allow the attacker to deanonymize you, or gather information about your activities on the Tor network.
ta: கைவிடப்பட்ட செல்கள் இரகசிய சேனல் திசையன் என அழைக்கப்படும் இந்த முறை, தாக்குபவர் உங்களை ஏமாற்ற அனுமதிக்கலாம் அல்லது டோர் நெட்வொர்க்கில் உங்கள் செயல்பாடுகள் குறித்த தகவல்களை சேகரிக்கலாம்.

source: Your Tor usage can leak data that local adversaries might want to exploit.
ta: உங்கள் TOR பயன்பாடு உள்ளக எதிரிகள் சுரண்ட விரும்பும் தரவைக் கசியும்.

source: Local Attackers on the Tor Network
ta: TOR நெட்வொர்க்கில் உள்ளக தாக்குதல் நடத்தியவர்கள்

source: ## How Network Adversaries attack Tor
ta: ## பிணையம் விரோதிகள் டோர் எவ்வாறு தாக்குகிறார்கள்

source: ### 1. Running Malicious Relays
ta: ### 1. தீங்கிழைக்கும் ரிலேக்களை இயக்குதல்

source: ### 2. Exploiting Information Leaks
ta: ### 2. செய்தி கசிவுகளை சுரண்டுவது

source: ### 3. Denial of Service (DoS) Attacks
ta: ### 3. பணி மறுப்பு (DOS) தாக்குதல்கள்

source: - Assist other deanonymization attempts by providing additional data that makes it easier to confirm which traffic belongs to a specific user.
ta: - ஒரு குறிப்பிட்ட பயனருக்கு எந்த போக்குவரத்து சொந்தமானது என்பதை உறுதிப்படுத்துவதை எளிதாக்கும் கூடுதல் தரவை வழங்குவதன் மூலம் பிற டியனொனொனிமிசேசன் முயற்சிகளுக்கு உதவுங்கள்.

source: - Collect data that can be used to deanonymize users.
ta: - பயனர்களைப் பயன்படுத்துவதற்குப் பயன்படுத்தக்கூடிய தரவைச் சேகரிக்கவும்.

source: - Deanonymize users directly by correlating traffic patterns between the entry and exit points of the Tor network.
ta: - TOR நெட்வொர்க்கின் நுழைவு மற்றும் வெளியேறும் புள்ளிகளுக்கு இடையில் போக்குவரத்து முறைகளை தொடர்புபடுத்துவதன் மூலம் பயனர்களை நேரடியாக deanonymize.

source: - Disrupt communication between Tor users and the network.
ta: - TOR பயனர்களுக்கும் பிணையத்திற்கும் இடையிலான தகவல்தொடர்புகளை சீர்குலைக்கவும்.

source: - Exploit vulnerabilities in the Tor protocol to generate large amounts of traffic, overwhelming the network.
ta: - TOR நெறிமுறையில் பாதிப்புகளை சுரண்டுவது பெரிய அளவிலான போக்குவரத்தை உருவாக்குகிறது, இது பிணையத்தை மூழ்கடிக்கும்.

source: - Spy on traffic passing through them.
ta: - அவர்கள் வழியாக செல்லும் போக்குவரத்தை உளவு பார்த்தால்.

source: - Use external services to flood the network with traffic, causing congestion.
ta: - போக்குவரத்துடன் நெட்வொர்க்கை வெள்ளம் செய்ய வெளிப்புற சேவைகளைப் பயன்படுத்துங்கள், இதனால் நெரிசல் ஏற்படுகிறது.

source: A DoS attack can also frustrate volunteers running relays, potentially leading them to shut down their relays, which weakens the network and makes it more vulnerable to further attacks.
ta: ஒரு DOS தாக்குதல் ரிலேக்களை இயங்கும் தன்னார்வலர்களையும் விரக்தியடையச் செய்யலாம், இது அவர்களின் ரிலேக்களை மூடுவதற்கு வழிவகுக்கும், இது நெட்வொர்க்கை பலவீனப்படுத்துகிறது மற்றும் மேலும் தாக்குதல்களுக்கு மிகவும் பாதிக்கப்படுகிறது.

source: A deeper understanding of these threats and continuous vigilance are essential to maintaining the security and usability of the Tor network.
ta: TOR நெட்வொர்க்கின் பாதுகாப்பு மற்றும் பயன்பாட்டினைப் பராமரிக்க இந்த அச்சுறுத்தல்கள் மற்றும் தொடர்ச்சியான விழிப்புணர்வு பற்றிய ஆழமான புரிதல் தேவை.

source: A network adversary running relays can take advantage of these leaks to:
ta: ஒரு பிணைய பகைவன் இயங்கும் ரிலேக்கள் இந்த கசிவுகளைப் பயன்படுத்திக் கொள்ளலாம்:

source: An attacker could operate a malicious exit relay—the final node where traffic exits the Tor network and reaches the open internet—
ta: ஒரு தாக்குபவர் ஒரு தீங்கிழைக்கும் வெளியேறும் ரிலேவை இயக்க முடியும் -போக்குவரத்து TOR நெட்வொர்க்கிலிருந்து வெளியேறி திறந்த இணையத்தை அடையும் இறுதி முனை -

source: As the Tor project relies on volunteers for relays and external funding,
ta: டோர் திட்டம் ரிலேக்கள் மற்றும் வெளிப்புற நிதிக்காக தன்னார்வலர்களை நம்பியிருப்பதால்,

source: If users perceive the network as unsafe or slow, they may stop using it, reducing the overall anonymity of the network (since more users make it harder to track individual traffic).
ta: பயனர்கள் பிணையத்தை பாதுகாப்பற்றதாகவோ அல்லது மெதுவாகவோ உணர்ந்தால், அவர்கள் அதைப் பயன்படுத்துவதை நிறுத்தலாம், பிணையத்தின் ஒட்டுமொத்த அநாமதேயத்தைக் குறைக்கிறார்கள் (அதிக பயனர்கள் தனிப்பட்ட போக்குவரத்தை கண்காணிப்பது கடினம் என்பதால்).

source: Malicious relays may also be purposefully misconfigured to introduce vulnerabilities into the network.
ta: நெட்வொர்க்கில் பாதிப்புகளை அறிமுகப்படுத்த தீங்கிழைக்கும் ரிலேக்கள் வேண்டுமென்றே தவறாக கட்டமைக்கப்படலாம்.

source: Network adversaries can also use DoS attacks to degrade the performance of the Tor network, making it slow or unreliable.
ta: டோர் நெட்வொர்க்கின் செயல்திறனைக் குறைக்க பிணையம் விரோதிகள் டாச் தாக்குதல்களைப் பயன்படுத்தலாம், இது மெதுவாக அல்லது நம்பமுடியாதது.

source: Network adversaries can carry out a variety of attacks, which can generally fall into three broad categories:
ta: பிணையம் விரோதிகள் பலவிதமான தாக்குதல்களைச் செய்யலாம், இது பொதுவாக மூன்று பரந்த வகைகளாக வரக்கூடும்:

source: Network attackers often run relays that are configured to harm the network or users in some way.
ta: பிணையம் தாக்குதல் செய்பவர்கள் பெரும்பாலும் பிணையம் அல்லது பயனர்களுக்கு ஏதேனும் ஒரு வகையில் தீங்கு விளைவிக்கும் வகையில் கட்டமைக்கப்பட்ட ரிலேக்களை இயக்குகிறார்கள்.

source: Network attackers pose a significant threat to the security and reliability of the network.
ta: பிணையம் தாக்குதல் செய்பவர்கள் நெட்வொர்க்கின் பாதுகாப்பு மற்றும் நம்பகத்தன்மைக்கு குறிப்பிடத்தக்க அச்சுறுத்தலை ஏற்படுத்துகிறார்கள்.

source: The goal of a DoS attack is often to discourage users from using Tor by making it so slow or unusable that they switch to less secure alternatives.
ta: ஒரு DOS தாக்குதலின் குறிக்கோள் பெரும்பாலும் TOR ஐப் பயன்படுத்துவதை ஊக்கப்படுத்துவதாகும், இது மிகவும் மெதுவாக அல்லது பயன்படுத்த முடியாததாக மாற்றுவதன் மூலம் அவை குறைந்த பாதுகாப்பான மாற்றுகளுக்கு மாறுகின்றன.

source: The presence of malicious or misconfigured relays, along with the potential for DoS attacks, can severely undermine Tor’s security, reliability, and reputation.
ta: தீங்கிழைக்கும் அல்லது தவறாக கட்டமைக்கப்பட்ட ரிலேக்கள், டாச் தாக்குதல்களுக்கான சாத்தியக்கூறுகளுடன், டோரின் பாதுகாப்பு, நம்பகத்தன்மை மற்றும் நற்பெயரை கடுமையாக குறைமதிப்பிற்கு உட்படுத்தலாம்.

source: Their goal may be to deanonymize users, degrade network performance, or damage Tor’s reputation.
ta: பயனர்களை டனொனிமிங் செய்வது, பிணையம் செயல்திறனை சீர்குலைப்பது அல்லது டோரின் நற்பெயரை சேதப்படுத்துவது அவர்களின் குறிக்கோளாக இருக்கலாம்.

source: These attackers are those who run or compromise relays within the network, or manipulate traffic to exploit weaknesses in the Tor protocol.
ta: இந்த தாக்குதல் செய்பவர்கள் நெட்வொர்க்கில் ரிலேக்களை இயக்குபவர்கள் அல்லது வேறுபாடின்மை செய்கிறார்கள், அல்லது TOR நெறிமுறையில் பலவீனங்களை சுரண்டுவதற்கு போக்குவரத்தை கையாளுகிறார்கள்.

source: These attacks might:
ta: இந்த தாக்குதல்கள் இருக்கலாம்:

source: These information leaks are detailed in [*Proposal 344*](https://gitlab.torproject.org/tpo/core/torspec/-/blob/main/proposals/344-protocol-info-leaks.txt), which highlights the severity of each one.
ta: இந்த செய்தி கசிவுகள் [*முன்மொழிவு 344*] (https://gitlab.torproject.org/tpo/core/torspec/-/blob/main/proposals/344-Protocol-info-leaks.txt) இல் விவரிக்கப்பட்டுள்ளன, இது ஒவ்வொன்றின் தீவிரத்தையும் எடுத்துக்காட்டுகிறது.

source: These relays might not follow proper protocol, resulting in traffic that leaks information, making it easier to track users.
ta: இந்த ரிலேக்கள் சரியான நெறிமுறையைப் பின்பற்றாது, இதன் விளைவாக போக்குவரத்து தகவலைக் கசியும், இது பயனர்களைக் கண்காணிப்பதை எளிதாக்குகிறது.

source: This allows the attacker to intercept and manipulate traffic, posing significant risks to users relying on Tor for secure, anonymous browsing.
ta: இது தாக்குதலை இடைமறிக்கவும் கையாளவும் அனுமதிக்கிறது, இது பாதுகாப்பான, அநாமதேய உலாவலுக்காக TOR ஐ நம்பியிருக்கும் பயனர்களுக்கு குறிப்பிடத்தக்க அபாயங்களை ஏற்படுத்துகிறது.

source: Tor actively works to detect and remove these relays, but attackers often attempt to bypass detection
ta: இந்த ரிலேக்களைக் கண்டறிந்து அகற்ற டோர் தீவிரமாக செயல்படுகிறார், ஆனால் தாக்குதல் நடத்துபவர்கள் பெரும்பாலும் கண்டறிதலைத் தவிர்ப்பதற்கு முயற்சிக்கிறார்கள்

source: Tor’s protocol, while designed to protect user anonymity, has known information leaks or "[side channels](https://gitlab.torproject.org/tpo/core/torspec/-/blob/main/proposals/344-protocol-info-leaks.txt)" that attackers can exploit.
ta: டோரின் நெறிமுறை, பயனர் அநாமதேயத்தைப் பாதுகாக்க வடிவமைக்கப்பட்டிருந்தாலும், செய்தி கசிவுகள் அல்லது "[பக்க சேனல்கள்] (https://gitlab.torproject.org/tpo/core/torspec/-/blob/main/proposals/344-Protocol-inf-inteal.

source: While Tor has systems in place to detect and remove these threats, attackers are constantly evolving their tactics to avoid detection and weaken the network.
ta: இந்த அச்சுறுத்தல்களைக் கண்டறிந்து அகற்றுவதற்கான அமைப்புகள் TOR ஐக் கொண்டிருக்கும்போது, தாக்குதல் நடத்துபவர்கள் கண்டறிதலைத் தவிர்ப்பதற்கும் நெட்வொர்க்கை பலவீனப்படுத்துவதற்கும் தொடர்ந்து தங்கள் தந்திரங்களை உருவாக்கி வருகின்றனர்.

source: While not all require running relays to exploit, network adversaries who operate relays are in a better position to see more traffic and perform traffic analysis, making their attacks more effective.
ta: எல்லாவற்றிற்கும் சுரண்டலுக்கு ரிலேக்கள் தேவையில்லை என்றாலும், ரிலேக்களை இயக்கும் பிணையம் விரோதிகள் அதிக போக்குவரத்தைக் காணவும் போக்குவரத்து பகுப்பாய்வைச் செய்யவும் சிறந்த நிலையில் உள்ளனர், இதனால் அவர்களின் தாக்குதல்கள் மிகவும் பயனுள்ளதாக இருக்கும்.

source: [Malicious relays](/relay/governance/handling-bad-relays/) can be designed to:
ta: [Malicious relays](/relay/governance/handling-bad-relays/) can be designed இதற்கு:

source: by concealing the true nature of their relays, such as lying about key relay properties or frustrating Tor’s scanning efforts.
ta: முக்கிய ரிலே பண்புகளைப் பற்றி பொய் சொல்வது அல்லது வெறுப்பூட்டும் டோரின் ச்கேனிங் முயற்சிகள் போன்ற அவற்றின் ரிலேக்களின் உண்மையான தன்மையை மறைப்பதன் மூலம்.

source: frequent attacks could discourage operators and impact funding, both critical for keeping the network operational.
ta: அடிக்கடி தாக்குதல்கள் ஆபரேட்டர்களை ஊக்கப்படுத்தலாம் மற்றும் நிதியை பாதிக்கக்கூடும், இவை இரண்டும் பிணையத்தை செயல்படுத்துவதற்கு முக்கியமானவை.

source: intentionally designed to steal sensitive data like cryptocurrencies, hijack online accounts, log user activity, or exploit vulnerabilities in Tor's protocol.
ta: கிரிப்டோகரன்ச்கள், நிகழ்நிலை கணக்குகளை கடத்திச் செல்வது, பயனர் செயல்பாட்டை பதிவு செய்தல் அல்லது டோரின் நெறிமுறையில் பாதிப்புகளை சுரண்டுவது போன்ற முக்கியமான தரவுகளைத் திருட வேண்டுமென்றே வடிவமைக்கப்பட்டுள்ளது.

source: running malicious relays that risks user safety and security, manipulating Tor’s protocol to leak information, and performing denial of service (DoS) attacks.
ta: பயனர் பாதுகாப்பு மற்றும் பாதுகாப்பை அபாயப்படுத்தும் தீங்கிழைக்கும் ரிலேக்களை இயக்குதல், தகவல்களைக் கசிய டோரின் நெறிமுறையை கையாளுதல் மற்றும் பணி மறுப்பு (DOS) தாக்குதல்களைச் செய்தல்.

source: Network Attackers on the Tor Network
ta: TOR நெட்வொர்க்கில் பிணையம் தாக்குபவர்கள்

source: ![An image showing positions of bad actors in the Tor community](/static/images/threat-model/project.png "title='Tor Community with bad actors' class='img-fluid'")
ta: ![டோர் சமூகத்தில் மோசமான நடிகர்களின் நிலைகளைக் காட்டும் படம்](/static/images/threat-model/project.png "title='Tor Community with bad actors' class='img-fluid'")

source: ## How project adversaries can attack Tor
ta: ## திட்ட விரோதிகள் எவ்வாறு டோர் தாக்க முடியும்

source: 1. **Infiltrating communication channels**:
ta: 1. ** தகவல்தொடர்பு சேனல்களில் ஊடுருவுகிறது **:

source: 2. **Spreading fear, uncertainty, and doubt**:
ta: 2. ** அச்சம், நிச்சயமற்ற தன்மை மற்றும் ஐயம் ஆகியவற்றைப் பரப்புதல் **:

source: 3. **Interfering with governance**:
ta: 3. ** நிர்வாகத்தில் தலையிடுகிறது **:

source: 4. **Targeting key staff**:
ta: 4. ** முக்கிய ஊழியர்களை குறிவைத்தல் **:

source: 5. **Attacking infrastructure related to bad-relay work:**
ta: 5. ** மோசமான-ரீலி வேலை தொடர்பான உள்கட்டமைப்பைத் தாக்குதல்: **

source: By attacking this infrastructure, they might aim to undermine the detection systems and allow their malicious relays to operate undetected, ultimately weakening the network's defenses.
ta: இந்த உள்கட்டமைப்பைத் தாக்குவதன் மூலம், அவை கண்டறிதல் அமைப்புகளை குறைமதிப்பிற்கு உட்படுத்துவதையும், அவற்றின் தீங்கிழைக்கும் ரிலேக்கள் கண்டறியப்படாமல் செயல்பட அனுமதிப்பதையும் நோக்கமாகக் கொண்டிருக்கலாம், இறுதியில் பிணையத்தின் பாதுகாப்புகளை பலவீனப்படுத்துகின்றன.

source: In any open-source project like Tor, it's essential to be aware of potential adversaries who exploit the transparency and openness of our workflows and communication channels.
ta: டோர் போன்ற எந்தவொரு திறந்த மூல திட்டத்திலும், எங்கள் பணிப்பாய்வு மற்றும் தகவல்தொடர்பு சேனல்களின் வெளிப்படைத்தன்மை மற்றும் திறந்த தன்மையை சுரண்டக்கூடிய சாத்தியமான எதிரிகளைப் பற்றி அறிந்திருப்பது தேவை.

source: Individuals working on attack detection or mitigation may face direct intimidation, bribery attempts, or indirect attacks on the infrastructure they rely on.
ta: தாக்குதல் கண்டறிதல் அல்லது தணிப்பதில் பணிபுரியும் நபர்கள் நேரடி மிரட்டல், கையூட்டு முயற்சிகள் அல்லது அவர்கள் நம்பியிருக்கும் உள்கட்டமைப்பு மீதான மறைமுக தாக்குதல்களை எதிர்கொள்ளக்கூடும்.

source: Project adversaries are individuals or groups who take advantage of our open system to disrupt or manipulate the Tor network and its community.
ta: திட்ட விரோதிகள் என்பது டோர் பிணையம் மற்றும் அதன் சமூகத்தை சீர்குலைக்க அல்லது கையாள எங்கள் திறந்த முறையைப் பயன்படுத்திக் கொள்ளும் நபர்கள் அல்லது குழுக்கள்.

source: The infrastructure supporting the detection and mitigation of malicious relays is a key target for adversaries.
ta: தீங்கிழைக்கும் ரிலேக்களைக் கண்டறிதல் மற்றும் குறைப்பதை ஆதரிக்கும் உள்கட்டமைப்பு எதிரிகளுக்கு முக்கிய இலக்காகும்.

source: Their tactics may include:
ta: அவர்களின் தந்திரோபாயங்களில் பின்வருவன அடங்கும்:

source: These adversaries may aim to weaken our network and disrupt our community by infiltrating discussions, shaping decisions, or attacking the infrastructure that supports our project.
ta: இந்த விரோதிகள் எங்கள் நெட்வொர்க்கை பலவீனப்படுத்துவதையும், விவாதங்களில் ஊடுருவுவதன் மூலமும், முடிவுகளை வடிவமைப்பதன் மூலமோ அல்லது எங்கள் திட்டத்தை ஆதரிக்கும் உள்கட்டமைப்பைத் தாக்குவதன் மூலமோ எங்கள் சமூகத்தை சீர்குலைப்பதை நோக்கமாகக் கொள்ளலாம்.

source: These attackers may join mailing lists, forums, or other community spaces to influence discussions, steer proposals, and create division.
ta: இந்த தாக்குதல் நடத்தியவர்கள் விவாதங்களை பாதிக்க, திட்டங்களை வழிநடத்துவதற்கும், பிரிவை உருவாக்குவதற்கும் அஞ்சல் பட்டியல்கள், மன்றங்கள் அல்லது பிற சமூக இடங்களில் சேரலாம்.

source: They may also attempt to disrupt proposal processes, particularly those related to community governance and the Tor development roadmap, to weaken the project's direction.
ta: திட்டத்தின் திசையை பலவீனப்படுத்த முன்மொழிவு செயல்முறைகளை, குறிப்பாக சமூக நிர்வாகம் மற்றும் டோர் மேம்பாட்டு பாதை வரைபடம் தொடர்பானவை ஆகியவற்றை சீர்குலைக்க அவர்கள் முயற்சி செய்யலாம்.

source: They may attempt to erode trust in Tor by sharing misleading or harmful information on both internal and external platforms.
ta: உள் மற்றும் வெளிப்புற தளங்களில் தவறான அல்லது தீங்கு விளைவிக்கும் தகவல்களைப் பகிர்வதன் மூலம் அவர்கள் TOR மீதான நம்பிக்கையை அழிக்க முயற்சிக்கலாம்.

source: Threats to The Tor Project
ta: TOR திட்டத்திற்கு அச்சுறுத்தல்கள்

source: ## Before the training
ta: பயிற்சிக்கு முன் ##

source: ## After the training
ta: ## பயிற்சிக்குப் பிறகு

source: ## At the training
ta: பயிற்சியில் ##

source: - How will you assess the needs of your group? What needs can you meet?
ta: - உங்கள் குழுவின் தேவைகளை எவ்வாறு மதிப்பிடுவீர்கள்? நீங்கள் என்ன சந்திக்க முடியும்?

source: - How will you assess the skill level of your group? What skill levels can you teach to?
ta: - உங்கள் குழுவின் திறன் அளவை எவ்வாறு மதிப்பிடுவீர்கள்? நீங்கள் என்ன திறன் நிலைகளுக்கு கற்பிக்க முடியும்?

source: 1. Create an agenda and share it on a projection or on a whiteboard so that your participants can be prepared for the day.
ta: 1. ஒரு நிகழ்ச்சி நிரலை உருவாக்கி, அதை ஒரு திட்டத்தில் அல்லது ஒயிட் போர்டில் பகிர்ந்து கொள்ளுங்கள், இதன் மூலம் உங்கள் பங்கேற்பாளர்கள் நாள் தயாராக இருக்க முடியும்.

source: 1. Find a location that is accessible, affordable, has an internet connection and other materials like a white board, projector, and screen.
ta: 1. அணுகக்கூடிய, மலிவு, இணைய இணைப்பு மற்றும் வெள்ளை பலகை, ப்ரொசெக்டர் மற்றும் திரை போன்ற பிற பொருட்களைக் கொண்ட இடத்தைக் கண்டறியவும்.

source: 1. Think about how you will evaluate your success at the training.
ta: 1. பயிற்சியில் உங்கள் வெற்றியை எவ்வாறு மதிப்பீடு செய்வீர்கள் என்பதைப் பற்றி சிந்தியுங்கள்.

source: 2. Communicate about how much time the training will take, and when breaks will happen. Make sure you take breaks!
ta: 2. பயிற்சி எவ்வளவு நேரம் எடுக்கும், எப்போது இடைவெளிகள் நடக்கும் என்பதைப் பற்றி தொடர்பு கொள்ளுங்கள். நீங்கள் இடைவெளி எடுப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்!

source: 2. Promote your event in your community's spaces, taking safety into consideration.
ta: 2. உங்கள் நிகழ்வை உங்கள் சமூகத்தின் இடைவெளிகளில் ஊக்குவிக்கவும், பாதுகாப்பைக் கவனத்தில் கொள்ளுங்கள்.

source: 3. Communicate about when you'll take questions, either during the training, at the end, or both.
ta: 3. பயிற்சியின் போது, முடிவில் அல்லது இரண்டையும் நீங்கள் எப்போது கேள்விகளை எடுப்பீர்கள் என்பதைப் பற்றி தொடர்பு கொள்ளுங்கள்.

source: 3. Create localized handouts for some of the more difficult concepts that you'll be teaching.
ta: 3. நீங்கள் கற்பிக்கும் சில கடினமான கருத்துக்களுக்கு உள்ளூர்மயமாக்கப்பட்ட கையேடுகளை உருவாக்கவும்.

source: 4. Communicate about how you'll offer hands-on help (if at all).
ta: 4. நீங்கள் எவ்வாறு உதவியை வழங்குவீர்கள் என்பதைப் பற்றி தொடர்பு கொள்ளுங்கள் (எப்படியிருந்தாலும்).

source: 4. Make sure you have plenty of stickers to hand out to participants!
ta: 4. பங்கேற்பாளர்களிடம் ஒப்படைக்க உங்களிடம் ஏராளமான ச்டிக்கர்கள் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்!

source: 5. Communicate about how participants can contact you securely after the training.
ta: 5. பயிற்சிக்குப் பிறகு பங்கேற்பாளர்கள் உங்களை எவ்வாறு பாதுகாப்பாக தொடர்பு கொள்ளலாம் என்பதைப் பற்றி தொடர்பு கொள்ளுங்கள்.

source: 5. Create a link list of all the resources you'll be talking about.
ta: 5. நீங்கள் பேசும் அனைத்து வளங்களின் இணைப்பு பட்டியலையும் உருவாக்கவும்.

source: 6. Determine how you'll do hands-on assistance at your training.
ta: 6. உங்கள் பயிற்சியில் நீங்கள் எவ்வாறு உதவுவீர்கள் என்பதைத் தீர்மானிக்கவும்.

source: 6. Show the participants the resources at [community.torproject.org](/) and [support.torproject.org](https://support.torproject.org).
ta: 6. பங்கேற்பாளர்களுக்கு [community.torproject.org] (/) மற்றும் [support.torproject.org] (https://support.torproject.org) இல் வளங்களைக் காட்டுங்கள்.

source: 7. Make sure your presentation is up-to-date (both information and screenshots) and save your presentation in two file formats -- for example, odp and pdf -- and on at least one additional device -- for example, on your computer and on a USB stick.
ta: 7. உங்கள் விளக்கக்காட்சி புதுப்பித்த நிலையில் இருப்பதை உறுதிசெய்து கொள்ளுங்கள் (தகவல் மற்றும் திரை சாட்கள் இரண்டும்) மற்றும் உங்கள் விளக்கக்காட்சியை இரண்டு கோப்பு வடிவங்களில் சேமிக்கவும்-எடுத்துக்காட்டாக, ODP மற்றும் PDF-மற்றும் குறைந்தது ஒரு கூடுதல் சாதனத்தில்-எடுத்துக்காட்டாக, உங்களுடையது கணினி மற்றும் ஒரு யூ.எச்.பி குச்சியில்.

source: 7. Show the participants other resources like [sec.eff.org](https://sec.eff.org).
ta: 7. பங்கேற்பாளர்களுக்கு [sec.eff.org] (https://sec.eff.org) போன்ற பிற ஆதாரங்களைக் காட்டுங்கள்.

source: 8. Decide how you will facilitate a safer space. We recommend using the [Tor Code of Conduct](../code-of-conduct/).
ta: 8. நீங்கள் எவ்வாறு பாதுகாப்பான இடத்தை எளிதாக்குவீர்கள் என்பதை முடிவு செய்யுங்கள். [TOR நடத்தை விதிமுறை] (../ குறியீட்டு-கடத்தல்/) ஐப் பயன்படுத்த பரிந்துரைக்கிறோம்.

source: Good preparation is essential to an effective and safe training, so we've curated some resources to help you make the most of your training event.
ta: பயனுள்ள மற்றும் பாதுகாப்பான பயிற்சிக்கு நல்ல தயாரிப்பு தேவை, எனவே உங்கள் பயிற்சி நிகழ்வைப் பயன்படுத்த உங்களுக்கு உதவ சில ஆதாரங்களை நாங்கள் இணைத்துள்ளோம்.

source: If you need more help, make sure the partners you're bringing in are aware of the safety needs of the community, and communicate with your contacts in the community to make sure they're okay with you bringing in additional trainers.
ta: உங்களுக்கு கூடுதல் உதவி தேவைப்பட்டால், நீங்கள் கொண்டு வரும் கூட்டாளர்கள் சமூகத்தின் பாதுகாப்புத் தேவைகளைப் பற்றி அறிந்திருப்பதை உறுதிசெய்து கொள்ளுங்கள், மேலும் கூடுதல் பயிற்சியாளர்களைக் கொண்டுவருவதில் அவர்கள் சரியாக இருப்பதை உறுதிசெய்ய சமூகத்தில் உள்ள உங்கள் தொடர்புகளுடன் தொடர்பு கொள்ளுங்கள்.

source: Make sure that the location is safe for your attendees to visit.
ta: உங்கள் பங்கேற்பாளர்கள் பார்வையிட இருப்பிடம் பாதுகாப்பானது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: Once you've answered those questions, you're ready to plan your training!
ta: அந்த கேள்விகளுக்கு நீங்கள் பதிலளித்தவுடன், உங்கள் பயிற்சியைத் திட்டமிட நீங்கள் தயாராக உள்ளீர்கள்!

source: Other questions to ask yourself before deciding to do a training:
ta: ஒரு பயிற்சி செய்ய முடிவு செய்வதற்கு முன் உங்களை நீங்களே கேட்டுக்கொள்ள வேண்டிய பிற கேள்விகள்:

source: Running security training is a fun and rewarding way to help your community conduct human rights work safely.
ta: பாதுகாப்பு பயிற்சியை நடத்துவது உங்கள் சமூகத்தை மனித உரிமைகளை பாதுகாப்பாக நடத்த உதவும் ஒரு வேடிக்கையான மற்றும் பலனளிக்கும் வழியாகும்.

source: Security trainings can help people communicate and use the internet safely, but there are additional considerations to be made before training some at-risk groups.
ta: பாதுகாப்பு பயிற்சி மக்கள் இணையத்தை பாதுகாப்பாக தொடர்புகொள்வதற்கும் பயன்படுத்துவதற்கும் உதவும், ஆனால் சில ஆபத்தான குழுக்களுக்கு பயிற்சியளிப்பதற்கு முன்பு கூடுதல் பரிசீலனைகள் உள்ளன.

source: That's why we recommend this resource from EFF's Security Education Companion, ["Am I the right person to give this training?"](https://sec.eff.org/articles/right-person-to-train).
ta: அதனால்தான் இந்த வளத்தை EFF இன் பாதுகாப்புக் கல்வி தோழரிடமிருந்து பரிந்துரைக்கிறோம், ["இந்த பயிற்சியை வழங்க நான் சரியான நபரா?"] (Https://sec.eff.org/articles/right-persons-to-rain).

source: This includes downloads and PDFs of handouts.
ta: இதில் பதிவிறக்கங்கள் மற்றும் கையேடுகளின் PDF கள் அடங்கும்.

source: This resource can help you be sure that you're doing the best by the community of people you wish to train.
ta: நீங்கள் பயிற்சியளிக்க விரும்பும் நபர்களின் சமூகத்தால் நீங்கள் சிறப்பாகச் செய்கிறீர்கள் என்பதை உறுதிப்படுத்த இந்த சான்று உங்களுக்கு உதவும்.

source: Under many circumstances, social media is great for promotion, but for higher risk groups, you may want to use a smaller word-of-mouth network or require community members to share information individually to other trusted people.
ta: பல சூழ்நிலைகளில், சமூக ஊடகங்கள் பதவி உயர்வுக்கு மிகச் சிறந்தவை, ஆனால் அதிக ஆபத்துள்ள குழுக்களுக்கு, நீங்கள் ஒரு சிறிய வார்த்தை-வாய் நெட்வொர்க்கைப் பயன்படுத்த விரும்பலாம் அல்லது சமூக உறுப்பினர்கள் மற்ற நம்பகமான நபர்களுக்கு தனித்தனியாக தகவல்களைப் பகிர்ந்து கொள்ள வேண்டும்.

source: Will you be able to handle this alone? Or will you require partners?
ta: இதை நீங்கள் தனியாக கையாள முடியுமா? அல்லது உங்களுக்கு கூட்டாளர்கள் தேவையா?

source: You can also start the training by asking participants to come up with their own community agreements for the space.
ta: பங்கேற்பாளர்கள் தங்கள் சொந்த சமூக ஒப்பந்தங்களை இடத்திற்கான கொண்டு வருமாறு கேட்டு பயிற்சியைத் தொடங்கலாம்.
