Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: Note: The command `nohup` allows the program to run in the background even after the terminal is closed, and `&` puts the command in the background immediately.
ta: குறிப்பு: முனையம் மூடப்பட்ட பின்னரும் கூட `நோஅப்` கட்டளை நிரலை பின்னணியில் இயக்க அனுமதிக்கிறது, மேலும்` & `கட்டளையை பின்னணியில் உடனடியாக வைக்கிறது.

source: Open your terminal and clone the source code:
ta: உங்கள் முனையத்தைத் திறந்து மூலக் குறியீட்டை நகலி செய்யுங்கள்:

source: Otherwise consult the documentation for your operating system.
ta: இல்லையெனில் உங்கள் இயக்க முறைமைக்கான ஆவணங்களை அணுகவும்.

source: Otherwise download [Go binary](https://golang.org/dl/) from the official website and follow its [installation instructions](https://go.dev/doc/install).
ta: இல்லையெனில் அதிகாரப்பூர்வ வலைத்தளத்திலிருந்து [பை பைனரி] (https://golang.org/dl/) பதிவிறக்கம் செய்து அதன் [நிறுவல் வழிமுறைகளை] பின்பற்றவும் (https://go.dev/doc/install).

source: Please check your Go version by using the command `go version`.
ta: `கோ பதிப்பு` கட்டளையைப் பயன்படுத்தி உங்கள் GO பதிப்பை சரிபார்க்கவும்.

source: Please execute the following steps with the user account under which the proxy should be executed.
ta: பதிலாள் செயல்படுத்தப்பட வேண்டிய பயனர் கணக்குடன் பின்வரும் படிகளை இயக்கவும்.

source: Please login using a user account with `sudo` rights or directly with `root` (in the later case omit the `sudo` part in the following commands).
ta: தயவுசெய்து `sudo` உரிமைகளுடன் அல்லது நேரடியாக` ரூட்` உடன் பயனர் கணக்கைப் பயன்படுத்தி உள்நுழையவும் (பிற்காலத்தில் பின்வரும் கட்டளைகளில் `சூடோ` பகுதியை தவிர்க்கவும்).

source: Please verify if this is working by rebooting the system and checking the log.
ta: கணினியை மறுதொடக்கம் செய்து பதிவைச் சரிபார்ப்பதன் மூலம் இது செயல்படுகிறதா என்பதை சரிபார்க்கவும்.

source: Running a Snowflake proxy is an easy way to contribute to the Tor Project's anti-censorship efforts.
ta: ஒரு ச்னோஃப்ளேக் ப்ராக்சியை இயக்குவது TOR திட்டத்தின் சென்சார்சிப் எதிர்ப்பு முயற்சிகளுக்கு பங்களிக்க எளிதான வழியாகும்.

source: Second you need the git client to download the Snowflake source code.
ta: இரண்டாவதாக ச்னோஃப்ளேக் மூலக் குறியீட்டைப் பதிவிறக்க உங்களுக்கு அறிவிலி வாங்கி தேவை.

source: This guide will walk you through the installation, operation, and maintenance of [Snowflake](https://snowflake.torproject.org) proxy on Linux-based systems.
ta: இந்த வழிகாட்டி [ச்னோஃப்ளேக்] (https://snowflake.torproject.org) லினக்ச் அடிப்படையிலான அமைப்புகளில் பதிலாள் ஆகியவற்றின் நிறுவல், செயல்பாடு மற்றும் பராமரிப்பு மூலம் உங்களை அழைத்துச் செல்லும்.

source: To keep your snowflake proxy updated, execute the following commands every few weeks (login with the user account you used during installing the proxy):
ta: உங்கள் ச்னோஃப்ளேக் ப்ராக்சியை புதுப்பிக்க, ஒவ்வொரு சில வாரங்களுக்கும் பின்வரும் கட்டளைகளை இயக்கவும் (ப்ராக்சியை நிறுவும் போது நீங்கள் பயன்படுத்திய பயனர் கணக்கில் உள்நுழைக):

source: You will need **Go 1.21** or newer to run the Snowflake proxy.
ta: ச்னோஃப்ளேக் ப்ராக்சியை இயக்க உங்களுக்கு ** 1.21 ** அல்லது புதியது தேவைப்படும்.

source: How to compile and run a standalone Snowflake proxy from the source
ta: மூலத்திலிருந்து ஒரு முழுமையான ச்னோஃப்ளேக் ப்ராக்சியை தொகுத்து இயக்குவது எப்படி

source: Compile Snowflake proxy from the source
ta: ச்னோஃப்ளேக் ப்ராக்சியை மூலத்திலிருந்து தொகுக்கவும்

source: # NGINX vhost block example
ta: # Nginx vhost block எடுத்துக்காட்டு

source: ### Set Proxy headers ###
ta: ### பதிலாள் தலைப்புகளை அமைக்கவும் ###

source: ### Set WebSocket headers ###
ta: ### வெப்சாக்கெட் தலைப்புகளை அமைக்கவும் ###

source: ### Web server configuration
ta: ### வலை சேவையக உள்ளமைவு

source: #### Step 1. Configure your domain
ta: #### படி 1. உங்கள் களத்தை உள்ளமைக்கவும்

source: #### Step 2. Obtain a valid certificate
ta: #### படி 2. சரியான சான்றிதழைப் பெறுங்கள்

source: #### Step 3. Install NGINX
ta: #### படி 3. nginx ஐ நிறுவவும்

source: #### Step 4. Configure NGINX
ta: #### படி 4. nginx ஐ உள்ளமைக்கவும்

source: #### Step 5. Configure your Tor WebTunnel bridge
ta: #### படி 5. உங்கள் டோர் வெப்டன்னல் பாலத்தை உள்ளமைக்கவும்

source: **2.1. Install ACME**
ta: ** 2.1. ACME ஐ நிறுவவும் **

source: **2.2. Issue a certificate**
ta: ** 2.2. ஒரு சான்றிதழை வழங்கவும் **

source: 1. A static IPv4 (preferably);
ta: 1. ஒரு நிலையான ஐபிவி 4 (முன்னுரிமை);

source: 2. The ability to expose TCP ports to the Internet (make sure that NAT doesn't get in the way);
ta: 2. டி.சி.பி போர்ட்களை இணையத்திற்கு அம்பலப்படுத்தும் திறன் (NAT வழியில் வரவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்);

source: 3. A self-hosted website, including a configurable web server (such as NGINX or Apache) and a domain under your control;
ta: 3. கட்டமைக்கக்கூடிய வலை சேவையகம் (என்சின்க்ச் அல்லது அப்பாச்சி போன்றவை) மற்றும் உங்கள் கட்டுப்பாட்டின் கீழ் ஒரு டொமைன் உள்ளிட்ட தன்வய புரவலன் வலைத்தளம்;

source: 4. A valid TLS certificate;
ta: 4. செல்லுபடியாகும் டி.எல்.எச் சான்றிதழ்;

source: 4.1. Generate a random string
ta: 4.1. ஒரு சீரற்ற சரத்தை உருவாக்குங்கள்

source: 4.2. Create or edit an NGINX vhost
ta: 4.2. ஒரு nginx vhost ஐ உருவாக்கவும் அல்லது திருத்தவும்

source: 4.3. Test the vhost configuration and reload NGINX
ta: 4.3. VHOST உள்ளமைவை சோதித்து, nginx ஐ மீண்டும் ஏற்றவும்

source: 5. At least 1 GB of memory RAM (4 GB recommended) to support the Tor process and WebTunnel transport.
ta: 5. டோர் செயல்முறை மற்றும் வெப்டன்னல் போக்குவரத்தை ஆதரிக்க குறைந்தது 1 சிபி நினைவக ரேம் (4 சிபி பரிந்துரைக்கப்படுகிறது).

source: Congratulations! You've successfully configured your web server to proxy requests to your Tor bridge.
ta: வாழ்த்துக்கள்! உங்கள் டோர் பிரிட்சுக்கு பதிலாள் கோரிக்கைகளுக்கு உங்கள் வலை சேவையகத்தை வெற்றிகரமாக கட்டமைத்துள்ளீர்கள்.

source: Create a new vhost file such as `/etc/nginx/sites-available/webtunnel-vhost` that forwards traffic to the WebTunnel bridge.
ta: `/Etc/etc/nginx/தளங்கள்-கிடைக்கக்கூடிய/வெப்டன்னல்-வோச்ட்` போன்ற புதிய VHOST கோப்பை உருவாக்கவும், இது போக்குவரத்தை வெப்டன்னல் பாலத்திற்கு அனுப்புகிறது.

source: Deploying a WebTunnel bridge involves configuring both a web server and a Tor bridge with this pluggable transport.
ta: ஒரு வெப்டன்னல் பாலத்தை வரிசைப்படுத்துவது என்பது ஒரு வலை சேவையகம் மற்றும் ஒரு டோர் பாலம் இரண்டையும் இந்த சொருகக்கூடிய போக்குவரத்துடன் கட்டமைப்பதை உள்ளடக்குகிறது.

source: For more details on system requirements, we recommend reading the [Tor relay requirements](/relay/relays-requirements) page.
ta: கணினி தேவைகள் குறித்த கூடுதல் விவரங்களுக்கு, [டோர் ரிலே தேவைகள்] (/ரிலே/ரிலேச்-வேண்டுகோள்) பக்கத்தைப் படிக்க பரிந்துரைக்கிறோம்.

source: Here is a full [NGINX vhost with WebTunnel example](https://gitlab.torproject.org/-/snippets/190).
ta: வெப்டன்னல் எடுத்துக்காட்டு கொண்ட ஒரு முழு [nginx vhost] (https://gitlab.torproject.org/-/snippets/190) இங்கே உள்ளது.

source: If you already have a website domain, you can either use the main domain or create a subdomain.
ta: உங்களிடம் ஏற்கனவே ஒரு வலைத்தள டொமைன் இருந்தால், நீங்கள் முதன்மையான களத்தைப் பயன்படுத்தலாம் அல்லது ஒரு துணை டொமைனை உருவாக்கலாம்.

source: If your website doesn't have a TLS certificate, you can obtain one by using [acme.sh](https://github.com/acmesh-official/acme.sh), which is an ACME protocol client written in Shell language.
ta: உங்கள் வலைத்தளத்திற்கு TLS சான்றிதழ் இல்லையென்றால், செல் மொழியில் எழுதப்பட்ட ACME நெறிமுறை கிளையன்ட் ஆகும் [agme.sh] (https://github.com/acmesh-formical/acme.sh) ஐப் பயன்படுத்தி ஒன்றைப் பெறலாம்.

source: In this guide, the WebTunnel bridge is hosted on the same server as your website, but it's possible to host it in a different server.
ta: இந்த வழிகாட்டியில், வெப்டன்னல் பாலம் உங்கள் வலைத்தளத்தின் அதே சேவையகத்தில் புரவலன் செய்யப்படுகிறது, ஆனால் அதை வேறு சேவையகத்தில் புரவலன் செய்ய முடியும்.

source: Install NGINX:
ta: Nginx ஐ நிறுவவும்:

source: Now, you must install and configure your bridge to receive these requests from the web server.
ta: இப்போது, இந்த கோரிக்கைகளை வலை சேவையகத்திலிருந்து பெற உங்கள் பாலத்தை நிறுவி கட்டமைக்க வேண்டும்.

source: Or
ta: அல்லது

source: Or if you want to use an existing vhost, you can just edit and add the ```location {}``` block to it.
ta: அல்லது நீங்கள் ஏற்கனவே இருக்கும் VHOST ஐப் பயன்படுத்த விரும்பினால், நீங்கள் திருத்தி `` `இருப்பிடம்}` `` `` `` `` `ஆகியவற்றைச் சேர்க்கலாம்.

source: Please follow the second part of this guide.
ta: இந்த வழிகாட்டியின் இரண்டாம் பகுதியைப் பின்தொடரவும்.

source: Please note that if you don't meet the requirements to run a WebTunnel or obfs4 bridge, running a [Snowflake proxy](/relay/setup/snowflake) is a great way to donate your bandwidth to help users circumvent censorship.
ta: ஒரு வெப்டன்னல் அல்லது OBFS4 பாலத்தை இயக்குவதற்கான தேவைகளை நீங்கள் நிறைவு செய்யாவிட்டால், [ச்னோஃப்ளேக் ப்ராக்சி] (/ரிலே/அமைவு/ச்னோஃப்ளேக்) இயக்குவது பயனர்கள் தணிக்கை செய்வதைத் தவிர்ப்பதற்கு உங்கள் அலைவரிசையை நன்கொடையாக வழங்குவதற்கான சிறந்த வழியாகும் என்பதை நினைவில் கொள்க.

source: Replace `$PATH` with the random string.
ta: சீரற்ற சரம் மூலம் `$ பாதை` ஐ மாற்றவும்.

source: Replace `example.com` with your website domain.
ta: உங்கள் வலைத்தள களத்துடன் `எடுத்துக்காட்டு.காம்` ஐ மாற்றவும்.

source: Replace `my@example.com` with your email address:
ta: உங்கள் மின்னஞ்சல் முகவரியுடன் `எனது@example.com` ஐ மாற்றவும்:

source: The first part of this guide provides detailed instructions for configuring your web server to support WebTunnel.
ta: இந்த வழிகாட்டியின் முதல் பகுதி வெப்டன்னலை ஆதரிக்க உங்கள் வலை சேவையகத்தை உள்ளமைக்க விரிவான வழிமுறைகளை வழங்குகிறது.

source: The requirements for deploying a WebTunnel bridge are:
ta: வெப்டன்னல் பாலத்தை வரிசைப்படுத்துவதற்கான தேவைகள்:

source: The second part, you will choose between two methods for running the WebTunnel bridge: either using Docker or by compiling from the source code.
ta: இரண்டாவது பகுதி, வெப்டன்னல் பாலத்தை இயக்குவதற்கான இரண்டு முறைகளுக்கு இடையே நீங்கள் தேர்வு செய்வீர்கள்: டோக்கரைப் பயன்படுத்துதல் அல்லது மூலக் குறியீட்டிலிருந்து தொகுத்தல்.

source: This guide will help you set up a WebTunnel bridge to help censored users connect to the Tor network.
ta: தணிக்கை செய்யப்பட்ட பயனர்கள் TOR நெட்வொர்க்குடன் இணைக்க உதவும் வகையில் வெப்டன்னல் பாலத்தை அமைக்க இந்த வழிகாட்டி உங்களுக்கு உதவும்.

source: To coexist with other content on a single port, you should install a reverse proxy, such as NGINX.
ta: ஒற்றை துறைமுகத்தில் மற்ற உள்ளடக்கங்களுடன் இணைந்து வாழ, நீங்கள் Nginx போன்ற தலைகீழ் ப்ராக்சியை நிறுவ வேண்டும்.

source: When clients connect to your web server, they will be redirected to your WebTunnel proxy when they use a secret path.
ta: வாடிக்கையாளர்கள் உங்கள் வலை சேவையகத்துடன் இணைக்கும்போது, அவர்கள் ஒரு ரகசிய பாதையைப் பயன்படுத்தும் போது அவர்கள் உங்கள் வெப்டன்னல் ப்ராக்சிக்கு திருப்பி விடப்படுவார்கள்.

source: You can generate a random string by running this command:
ta: இந்த கட்டளையை இயக்குவதன் மூலம் நீங்கள் ஒரு சீரற்ற சரத்தை உருவாக்கலாம்:

source: You have two options available: either compile a Go binary from the [source](source) or use [Docker](docker).
ta: உங்களிடம் இரண்டு விருப்பங்கள் உள்ளன: [மூல] (மூல) இலிருந்து GO பைனரியை தொகுக்கவும் அல்லது [டோக்கர்] (டோக்கர்) பயன்படுத்தவும்.

source: [WebTunnel](https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/webtunnel) is a pluggable transport that attempts to imitate web browsing activities based on [HTTPT](https://censorbib.nymity.ch/#Frolov2020b).
ta: [WebTunnel](https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/webtunnel) is a pluggable transport that attempts பெறுநர் imitate விரலிடைத் தோல் browsing activities based on [HTTPT](https://censorbib.nymity.ch/#Frolov2020b).

source: WebTunnel Bridge
ta: வெப்டன்னல் பாலம்

source: Run a WebTunnel bridge to help censored users connect to the Tor network
ta: தணிக்கை செய்யப்பட்ட பயனர்கள் TOR நெட்வொர்க்குடன் இணைக்க உதவும் வகையில் ஒரு வெப்டன்னல் பாலத்தை இயக்கவும்

source: #### 0. Configure your domain and web server
ta: #### 0. உங்கள் டொமைன் மற்றும் வலை சேவையகத்தை உள்ளமைக்கவும்

source: #### 1. Install Docker runtime
ta: #### 1. கப்பல்துறை இயக்க நேரத்தை நிறுவவும்

source: #### 2. Run Dockerized WebTunnel bridge
ta: #### 2. டோக்கரைச் செய்யப்பட்ட வெப்டன்னல் பிரிட்ச் இயக்கவும்

source: #### 3. Download the WebTunnel docker compose file
ta: #### 3. வெப்டன்னல் கப்பல்துறை இசையமைத்தல் கோப்பைப் பதிவிறக்கவும்

source: #### 4. Start your WebTunnel bridge
ta: ####. உங்கள் வெப்டன்னல் பாலத்தைத் தொடங்கவும்

source: #### 5. Test your WebTunnel bridge
ta: #### 5. உங்கள் வெப்டன்னல் பாலத்தை சோதிக்கவும்

source: Before you proceed with the instructions below, it's necessary to configure your domain and web server first.
ta: கீழேயுள்ள வழிமுறைகளுடன் நீங்கள் தொடர முன், முதலில் உங்கள் டொமைன் மற்றும் வலை சேவையகத்தை உள்ளமைக்க வேண்டியது தேவை.

source: By default, your docker WebTunnel bridge will be distributed via [Bridges website](https://bridges.torproject.org).
ta: இயல்பாக, உங்கள் கப்பல்துறை வெப்டன்னல் பாலம் [பிரிட்சச் வலைத்தளம்] (https://bridges.torproject.org) வழியாக விநியோகிக்கப்படும்.

source: It's just there because the pluggable transport specification requires an IP address there.
ta: சொருகக்கூடிய போக்குவரத்து விவரக்குறிப்புக்கு அங்கு ஒரு ஐபி முகவரி தேவைப்படுவதால் அது இருக்கிறது.

source: Note that this Docker compose file includes auto-update by default, and will update the WebTunnel bridge server without any further action.
ta: இந்த கப்பல்துறை இசையமைப்புக் கோப்பில் இயல்பாக ஆட்டோ-புதுப்பிப்பு அடங்கும் என்பதை நினைவில் கொள்க, மேலும் எந்த நடவடிக்கையும் இல்லாமல் வெப்டன்னல் பிரிட்ச் சேவையகத்தை புதுப்பிக்கும்.

source: Refer to the first part of the [WebTunnel guide](/relay/setup/webtunnel) to see how to set up your website domain and web server.
ta: உங்கள் வலைத்தள டொமைன் மற்றும் வலை சேவையகத்தை எவ்வாறு அமைப்பது என்பதைப் பார்க்க [வெப்டன்னல் கையேடு] (/ரிலே/செட்அப்/வெப்டன்னல்) இன் முதல் பகுதியைப் பார்க்கவும்.

source: Remove `watchtower` to disable this behavior.
ta: இந்த நடத்தையை முடக்க `வாட்ச் டவர்` ஐ அகற்றவும்.

source: Replace `URL` with your domain and path (refer to the first part of the WebTunnel guide), and `OPERATOR_EMAIL` with your email address, then run:
ta: உங்கள் டொமைன் மற்றும் பாதையுடன் `url` ஐ மாற்றவும் (வெப்டன்னல் வழிகாட்டியின் முதல் பகுதியைப் பார்க்கவும்), மற்றும் உங்கள் மின்னஞ்சல் முகவரியுடன்` ஆபரேட்டர்_மெயில்` ஐப் பார்க்கவும், பின்னர் இயக்கவும்:

source: The IPv6 address you get is randomly generated and never used.
ta: நீங்கள் பெறும் ஐபிவி 6 முகவரி தோராயமாக உருவாக்கப்பட்டு ஒருபோதும் பயன்படுத்தப்படவில்லை.

source: These commands will create an environment file (`.env`) for the configuration of WebTunnel bridge.
ta: இந்த கட்டளைகள் வெப்டன்னல் பாலத்தின் உள்ளமைவுக்கு சுற்றுச்சூழல் கோப்பை (`.env`) உருவாக்கும்.

source: This guide will help you set up a WebTunnel bridge using Docker to help censored users connect to the Tor network.
ta: தணிக்கை செய்யப்பட்ட பயனர்கள் TOR நெட்வொர்க்குடன் இணைக்க உதவுவதற்காக டோக்கரைப் பயன்படுத்தி ஒரு வெப்டன்னல் பாலத்தை அமைக்க இந்த வழிகாட்டி உங்களுக்கு உதவும்.

source: You can copy and paste the bridge line in Tor Browser, and it should work.
ta: டோர் உலாவியில் நீங்கள் பாலம் கோட்டை நகலெடுத்து ஒட்டலாம், அது வேலை செய்ய வேண்டும்.

source: You can obtain your bridge line address and verify if it is working by running:
ta: உங்கள் பிரிட்ச் லைன் முகவரியைப் பெற்று, அது இயங்குவதன் மூலம் செயல்படுகிறதா என்பதை சரிபார்க்கலாம்:

source: How to run a WebTunnel bridge on Docker
ta: டோக்கரில் ஒரு வெப்டன்னல் பாலத்தை எவ்வாறு இயக்குவது

source: WebTunnel Docker setup
ta: வெப்டன்னல் கப்பல்துறை அமைப்பு

source: #### 1. Install Golang
ta: #### 1. கோலாங்கை நிறுவவும்

source: #### 2. Clone and compile
ta: #### 2. நகலி மற்றும் தொகுத்தல்

source: #### 3. Install Tor
ta: #### 3. டோர் நிறுவவும்

source: #### 4. Edit your torrc
ta: ####. உங்கள் டோர்க் திருத்தவும்

source: #### 5. Restart Tor
ta: #### 5. டோர் மறுதொடக்கம் செய்யுங்கள்

source: #### 6. Edit and reload AppArmor tor permission
ta: #### 6. apparmor tor அனுமதியைத் திருத்தி மீண்டும் ஏற்றவும்

source: #### 7. Monitor your logs
ta: #### 7. உங்கள் பதிவுகளை கண்காணிக்கவும்

source: #### 8. Final notes
ta: #### 8. இறுதி குறிப்புகள்

source: - `Nickname WebTunnetTest` with the nickname of your bridge.
ta: - `உங்கள் பாலத்தின் புனைப்பெயருடன் WebTunnettest` என்ற புனைப்பெயர்.

source: - `url=https://yourdomain/path` with your WebTunnel url including your domain and secret path;
ta: - `url=https://yourdomain/path` with your WebTunnel முகவரி including your domain and secret path;

source: After having set up the bridge, it takes approximately three hours for the bridge to show up in Relay Search.
ta: பாலத்தை அமைத்த பிறகு, ரிலே தேடலில் பாலம் காண்பிக்க சுமார் மூன்று மணி நேரம் ஆகும்.

source: After modifying the profile and reloading it, test to see if the tor process can now execute `/usr/local/bin/webtunnel` without any AppArmor denials.
ta: சுயவிவரத்தை மாற்றியமைத்து, அதை மீண்டும் ஏற்றிய பிறகு, TOR செயல்முறை இப்போது `/usr/local/bin/bebtunnel` ஆகியவற்றை எந்தவொரு பொருத்தமற்ற மறுப்புகளும் இல்லாமல் இயக்க முடியுமா என்று சோதிக்கவும்.

source: And compile the WebTunnel server binary:
ta: வெப்டன்னல் சேவையக பைனரியை தொகுக்கவும்:

source: And run these commands to enable the Tor Debian repository:
ta: டோர் டெபியன் களஞ்சியத்தை செயல்படுத்த இந்த கட்டளைகளை இயக்கவும்:

source: Check the system logs (e.g., `dmesg` or `/var/log/syslog`) to ensure the error doesn't reappear.
ta: பிழை மீண்டும் தோன்றாது என்பதை உறுதிப்படுத்த கணினி பதிவுகளை (எ.கா., `dmesg` அல்லது`/var/log/syslog`) சரிபார்க்கவும்.

source: Clone the WebTunnel git repository:
ta: வெப்டன்னல் அறிவிலி களஞ்சியத்தை நகலி செய்யுங்கள்:

source: Edit your Tor config file, usually located at `/etc/tor/torrc` and replace its contents with:
ta: வழக்கமாக `/etc/tor/torrc` இல் அமைந்துள்ள உங்கள் டோர் கட்டமைப்பு கோப்பைத் திருத்தி அதன் உள்ளடக்கங்களை மாற்றவும்:

source: Enable and Start tor:
ta: TOR ஐ இயக்கவும் தொடங்கவும்:

source: Finally, copy the binary to another location:
ta: இறுதியாக, பைனரியை மற்றொரு இடத்திற்கு நகலெடுக்கவும்:

source: Finally, update your package list and install Tor:
ta: இறுதியாக, உங்கள் தொகுப்பு பட்டியலைப் புதுப்பித்து டோர் நிறுவவும்:

source: Finally, you can replace the URL contents with your domain and secret path.
ta: இறுதியாக, முகவரி உள்ளடக்கங்களை உங்கள் டொமைன் மற்றும் ரகசிய பாதையுடன் மாற்றலாம்.

source: If set to any option other than `HTTPS`, the bridge will not be distributed to users.
ta: `Https` ஐத் தவிர வேறு எந்த விருப்பத்திற்கும் அமைக்கப்பட்டால், பாலம் பயனர்களுக்கு விநியோகிக்கப்படாது.

source: If you are having trouble setting up your bridge, have a look at our [help section](relay/getting-help).
ta: உங்கள் பாலத்தை அமைப்பதில் சிக்கல் இருந்தால், எங்கள் [உதவி பிரிவு] (ரிலே/பெறுதல்) பாருங்கள்.

source: If you copy the hashed fingerprint instead of your bridge fingerprint, you won't be able to connect.
ta: உங்கள் பாலம் கைரேகைக்கு பதிலாக ஆசெட் கைரேகையை நகலெடுத்தால், நீங்கள் இணைக்க முடியாது.

source: If your bridge is now running, you can test it by copying and pasting your bridge line into Tor Browser.
ta: உங்கள் பாலம் இப்போது இயங்கினால், உங்கள் பாலம் கோட்டை டோர் உலாவியில் நகலெடுத்து ஒட்டுவதன் மூலம் அதை சோதிக்கலாம்.

source: Import the Tor Project keyring:
ta: TOR திட்ட கீரிங்கை இறக்குமதி செய்யுங்கள்:

source: Just enter your bridge's `<HASHED FINGERPRINT>` in the form and click "Search".
ta: உங்கள் பாலத்தின் `<ஆசெட் கைரேகை>` படிவத்தில் உள்ளிட்டு "தேடல்" என்பதைக் சொடுக்கு செய்க.

source: Now, just replace the content below to create your WebTunnel bridge line. 10.0.0.2:443 is just a random IP address that's never used. It's just there because the pluggable transport specification requires an IP address there.
ta: இப்போது, உங்கள் வெப்டன்னல் பிரிட்ச் கோட்டை உருவாக்க கீழே உள்ள உள்ளடக்கத்தை மாற்றவும். 10.0.0.2:443 என்பது ஒருபோதும் பயன்படுத்தப்படாத ஒரு சீரற்ற ஐபி முகவரி. சொருகக்கூடிய போக்குவரத்து விவரக்குறிப்புக்கு அங்கு ஒரு ஐபி முகவரி தேவைப்படுவதால் அது இருக்கிறது.

source: On a Debian-like system, install Tor from the [Tor Debian repository](https://support.torproject.org/apt/tor-deb-repo/).
ta: டெபியன் போன்ற அமைப்பில், [டோர் டெபியன் களஞ்சியத்தை] (https://support.torproject.org/apt/tor-deb-repo/) இலிருந்து TOR ஐ நிறுவவும்.

source: Refer to the first part of the [WebTunnel guide](/relay/setup/webtunnel) to see how to set up your web server.
ta: உங்கள் வலை சேவையகத்தை எவ்வாறு அமைப்பது என்பதைப் பார்க்க [வெப்டன்னல் கையேடு] (/ரிலே/செட்அப்/வெப்டன்னல்) இன் முதல் பகுதியைப் பார்க்கவும்.

source: Reload the AppArmor profile:
ta: Apparmor சுயவிவரத்தை மீண்டும் ஏற்றவும்:

source: Remember to copy only the fingerprint and do not include the bridge nickname.
ta: கைரேகையை மட்டுமே நகலெடுக்க நினைவில் வைத்துக் கொள்ளுங்கள், மேலும் பாலம் புனைப்பெயரை சேர்க்க வேண்டாம்.

source: This default applies unless an operator explicitly configures the `BridgeDistribution` setting in the torrc file to a different option.
ta: ஒரு ஆபரேட்டர் டோர்க் கோப்பில் உள்ள `பிரிட்ச்ச்டிச்ட்ரிபியூசன்` அமைப்பை வேறு விருப்பத்திற்கு வெளிப்படையாக உள்ளமைக்காவிட்டால் இந்த இயல்புநிலை பொருந்தும்.

source: This guide will help you set up a WebTunnel bridge compiled from the source to help censored users connect to the Tor network.
ta: தணிக்கை செய்யப்பட்ட பயனர்கள் TOR நெட்வொர்க்குடன் இணைக்க உதவும் வகையில் மூலத்திலிருந்து தொகுக்கப்பட்ட ஒரு வெப்டன்னல் பாலத்தை அமைக்க இந்த வழிகாட்டி உங்களுக்கு உதவும்.

source: To allow tor to run your WebTunnel binary, edit the AppArmor `system_tor` profile at `/etc/apparmor.d/system_tor` and add an entry allowing tor to execute WebTunnel:
ta: உங்கள் வெப்டன்னல் பைனரியை இயக்க டோர் அனுமதிக்க, apparmor `system_tor` சுயவிவரத்தை`/etc/apparmor.d/system_tor` இல் திருத்தி, வெப்டன்னலை இயக்க டோர் அனுமதிக்கும் ஒரு உள்ளீட்டைச் சேர்க்கவும்:

source: To build the WebTunnel server binary, you need to install [Golang](https://go.dev/dl/).
ta: வெப்டன்னல் சர்வர் பைனரியை உருவாக்க, நீங்கள் [கோலாங்] (https://go.dev/dl/) ஐ நிறுவ வேண்டும்.

source: To build your WebTunnel bridge line, you need to copy your bridge `FINGERPRINT`, but don't confuse it with your hashed fingerprint, which is the fingerprint that you will find on the Tor Relay Search website.
ta: உங்கள் வெப்டன்னல் பிரிட்ச் கோட்டை உருவாக்க, உங்கள் பாலம் `கைரேகை` நகலெடுக்க வேண்டும், ஆனால் அதை உங்கள் ஆச் கைரேகையுடன் குழப்ப வேண்டாம், இது டோர் ரிலே தேடல் இணையதளத்தில் நீங்கள் காணும் கைரேகை.

source: To confirm your bridge is running with no issues, you should see something like this (usually in /var/log/syslog or run `sudo journalctl -e -u tor@default`):
ta: உங்கள் பாலம் எந்த சிக்கலும் இல்லாமல் இயங்குகிறது என்பதை உறுதிப்படுத்த, நீங்கள் இதுபோன்ற ஒன்றைக் காண வேண்டும் (வழக்கமாக/var/log/syslog அல்லது `sudo jarxctl -e -u tor@default` ஐ இயக்கவும்):

source: You can find this in your torrc line under `ServerTransportOptions`.
ta: இதை உங்கள் டோர்க் வரிசையில் `சர்வர் டிரான்ச்போர்ட்அப்சன்ச்` இன் கீழ் காணலாம்.

source: You can find your bridge fingerprint in the `/var/lib/tor/fingerprint` file.
ta: உங்கள் பாலம் கைரேகையை `/var/lib/tor/கைரேகை` கோப்பில் காணலாம்.

source: You can install Go on Debian by running:
ta: இயங்குவதன் மூலம் நீங்கள் டெபியனை நிறுவலாம்:

source: You can monitor your WebTunnel bridge's usage on [Relay Search](https://metrics.torproject.org/rs.html#search).
ta: [ரிலே தேடல்] (https://metrics.torproject.org/rs.html#search) இல் உங்கள் வெப்டன்னல் பிரிட்சின் பயன்பாட்டை கண்காணிக்கலாம்.

source: Your WebTunnel bridge will by default be automatically distributed via the [Bridges website](https://bridges.torproject.org), also known as the `HTTPS` distributor.
ta: `HTTPS` விநியோகச்தர் என்றும் அழைக்கப்படும் [பிரிட்சச் வலைத்தளம்] (https://bridges.torproject.org) வழியாக உங்கள் வெப்டன்னல் பாலம் இயல்பாகவே விநியோகிக்கப்படும்.

source: How to run a WebTunnel bridge from the source
ta: மூலத்திலிருந்து ஒரு வெப்டன்னல் பாலத்தை எவ்வாறு இயக்குவது

source: Compile and run WebTunnel from the source
ta: மூலத்திலிருந்து வெப்டூனலை தொகுத்து இயக்கவும்

source: # AS/location diversity
ta: # AS/இருப்பிட பன்முகத்தன்மை

source: # Choosing a hosting provider
ta: # ஓச்டிங் வழங்குநரைத் தேர்ந்தெடுப்பது

source: # Choosing an Operating System
ta: # இயக்க முறைமையைத் தேர்ந்தெடுப்பது

source: # OS Level Configuration
ta: # OS நிலை உள்ளமைவு
