Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: For example, implementing features like HTTPS-only mode in Tor Browser strengthens overall security and helps reduce the risks posed by malicious exit relays.
ta: எடுத்துக்காட்டாக, TOR உலாவியில் HTTPS- மட்டும் பயன்முறை போன்ற அம்சங்களை செயல்படுத்துவது ஒட்டுமொத்த பாதுகாப்பை பலப்படுத்துகிறது மற்றும் தீங்கிழைக்கும் வெளியேறும் ரிலேக்களால் ஏற்படும் அபாயங்களைக் குறைக்க உதவுகிறது.

source: The open nature of the Tor network means that preventing malicious or misconfigured relays from joining is nearly impossible.
ta: TOR நெட்வொர்க்கின் திறந்த தன்மை என்பது தீங்கிழைக்கும் அல்லது தவறாக கட்டமைக்கப்பட்ட ரிலேக்கள் சேருவதைத் தடுப்பது கிட்டத்தட்ட சாத்தியமற்றது என்பதாகும்.

source: This combination of technical, social, and external improvements forms Tor’s strategy for mitigating threats stemming from malicious relays and keeping the network safe.
ta: தொழில்நுட்ப, சமூக மற்றும் வெளிப்புற மேம்பாடுகளின் இந்த கலவையானது தீங்கிழைக்கும் ரிலேக்களிலிருந்து உருவாகும் அச்சுறுத்தல்களைத் தணிப்பதற்கும் நெட்வொர்க்கைப் பாதுகாப்பாக வைத்திருப்பதற்கும் டோரின் மூலோபாயத்தை உருவாக்குகிறது.

source: This helps identify relays that may be intentionally tampering with traffic or undermining the network’s security.
ta: போக்குவரத்தை வேண்டுமென்றே சேதப்படுத்தும் அல்லது பிணையத்தின் பாதுகாப்பைக் குறைமதிப்பிற்கு உட்படுத்தக்கூடிய ரிலேக்களை அடையாளம் காண இது உதவுகிறது.

source: To address this, we take a multi-faceted approach to detect and mitigate these threats.
ta: இதை நிவர்த்தி செய்ய, இந்த அச்சுறுத்தல்களைக் கண்டறிந்து தணிக்க பன்முக அணுகுமுறையை நாங்கள் எடுத்துக்கொள்கிறோம்.

source: We also stay engaged with third-party applications and tools that can aid in the fight against malicious relays.
ta: தீங்கிழைக்கும் ரிலேக்களுக்கு எதிரான போராட்டத்திற்கு உதவக்கூடிய மூன்றாம் தரப்பு விண்ணப்பங்கள் மற்றும் கருவிகளிலும் நாங்கள் ஈடுபடுகிறோம்.

source: We’ve set up systems to constantly perform automatic network scans to detect any signs of malicious activity.
ta: தீங்கிழைக்கும் செயல்பாட்டின் எந்த அறிகுறிகளையும் கண்டறிய தானியங்கி பிணையம் ச்கேன்களை தொடர்ந்து செய்ய அமைப்புகளை அமைத்துள்ளோம்.

source: Mitigating Malicious Relays
ta: தீங்கிழைக்கும் ரிலேக்களைத் தணித்தல்

source: # Network threat mitigation systems
ta: # பிணையம் அச்சுறுத்தல் குறைப்பு அமைப்புகள்

source: As a privacy-focused network, Tor is constantly exposed to a wide range of threats that aim to undermine its security and functionality.
ta: தனியுரிமையை மையமாகக் கொண்ட நெட்வொர்க்காக, டோர் தொடர்ந்து அதன் பாதுகாப்பையும் செயல்பாட்டையும் குறைமதிப்பிற்கு உட்படுத்தும் நோக்கில் பரந்த அளவிலான அச்சுறுத்தல்களுக்கு ஆளாகிறது.

source: By combining technical safeguards, community collaboration, and continuous innovation, Tor actively works to detect and address threats before they can cause harm.
ta: தொழில்நுட்ப பாதுகாப்புகள், சமூக ஒத்துழைப்பு மற்றும் தொடர்ச்சியான கண்டுபிடிப்புகளை இணைப்பதன் மூலம், தீங்கு விளைவிக்கும் முன் அச்சுறுத்தல்களைக் கண்டறிந்து உரையாற்ற டோர் தீவிரமாக செயல்படுகிறார்.

source: These systems are crucial in preserving the safety and reliability of the Tor network, allowing it to continue operating as a secure tool for users around the world.
ta: TOR நெட்வொர்க்கின் பாதுகாப்பு மற்றும் நம்பகத்தன்மையைப் பாதுகாப்பதில் இந்த அமைப்புகள் முக்கியமானவை, இது உலகெங்கிலும் உள்ள பயனர்களுக்கு பாதுகாப்பான கருவியாக தொடர்ந்து செயல்பட அனுமதிக்கிறது.

source: To fight against these threats, Tor employs a variety of threat mitigation systems designed to protect the network from malicious activity, both technical and social in nature.
ta: இந்த அச்சுறுத்தல்களுக்கு எதிராக போராட, TOR தொழில்நுட்ப மற்றும் சமூக இயல்பில் உள்ள தீங்கிழைக்கும் செயல்பாட்டிலிருந்து நெட்வொர்க்கைப் பாதுகாக்க வடிவமைக்கப்பட்ட பலவிதமான அச்சுறுத்தல் குறைப்பு முறைகளைப் பயன்படுத்துகிறது.

source: Network Threats Mitigation
ta: பிணையம் அச்சுறுத்தல்கள் தணிப்பு

source: # Addressing Denial of Service (DoS) Threats
ta: # பணி மறுப்பு (DOS) அச்சுறுத்தல்களை நிவர்த்தி செய்தல்

source: A key part of defending against DoS threats involves collaboration with the [relay operator community](https://community.torproject.org/relay/governance/relay-operators/) and [Directory Authorities](https://community.torproject.org/relay/governance/policies-and-proposals/directory-authority/).
ta: DOS அச்சுறுத்தல்களுக்கு எதிராக பாதுகாப்பதில் ஒரு முக்கிய பகுதி [ரிலே ஆபரேட்டர் சமூகம்] (https://community.torproject.org/relay/governance/relay-operators/) மற்றும் [அடைவு ஆகியவற்றுடன் ஒத்துழைப்பதை உள்ளடக்கியது அதிகாரிகள்].

source: However, this system can't handle all the types of DoS attacks the network faces, and redesigning it is beyond the scope of C-Tor.
ta: இருப்பினும், இந்த அமைப்பால் பிணையம் முகங்களை தாக்கும் அனைத்து வகையான DOS தாக்குதல்களையும் கையாள முடியாது, மேலும் அதை மறுவடிவமைப்பது சி-டோரின் எல்லைக்கு அப்பாற்பட்டது.

source: Mitigating all possible **Denial of Service (DoS)** attacks in the Tor network is a complex task.
ta: டோர் நெட்வொர்க்கில் சாத்தியமான ** சேவையின் மறுப்பு (DOS) ** தாக்குதல்கள் ஒரு சிக்கலான பணியாகும்.

source: The current C-Tor implementation includes an anti-DoS system that defends against the most critical vulnerabilities.
ta: தற்போதைய சி-டார் செயல்படுத்தலில் ஒரு DOS எதிர்ப்பு அமைப்பு உள்ளது, இது மிக முக்கியமான பாதிப்புகளுக்கு எதிராக பாதுகாக்கும்.

source: Their input has been proved essential in testing potential fixes and workarounds, especially in cases where the current anti-DoS system has limitations that prevent direct solutions.
ta: சாத்தியமான திருத்தங்கள் மற்றும் பணித்தொகுப்புகளைச் சோதிப்பதில் அவற்றின் உள்ளீடு தேவை என்று நிரூபிக்கப்பட்டுள்ளது, குறிப்பாக தற்போதைய DOS எதிர்ப்பு அமைப்பு நேரடி தீர்வுகளைத் தடுக்கும் வரம்புகளைக் கொண்ட சந்தர்ப்பங்களில்.

source: These groups have played a crucial role in identifying and understanding DoS attacks in the real world.
ta: இந்த குழுக்கள் உண்மையான உலகில் DOS தாக்குதல்களைக் கண்டறிந்து புரிந்துகொள்வதில் முக்கிய பங்கு வகிக்கின்றன.

source: To fill these gaps, the remaining DoS vulnerabilities are addressed in the new Rust-based implementation, [Arti](https://gitlab.torproject.org/tpo/core/arti).
ta: இந்த இடைவெளிகளை நிரப்ப, மீதமுள்ள DOS பாதிப்புகள் புதிய துரு அடிப்படையிலான செயல்படுத்தல் [ARTI] (https://gitlab.torproject.org/tpo/core/arti) இல் உரையாற்றப்படுகின்றன.

source: We hope that by working together, we can reduce both the short- and long-term impacts of these attacks.
ta: ஒன்றிணைந்து செயல்படுவதன் மூலம், இந்த தாக்குதல்களின் குறுகிய மற்றும் நீண்ட கால தாக்கங்களை நாம் குறைக்க முடியும் என்று நம்புகிறோம்.

source: Addressing Denial of Service (DoS) Threats
ta: பணி மறுப்பு (DOS) அச்சுறுத்தல்களை நிவர்த்தி செய்தல்

source: # Resolving Information Leaks
ta: # செய்தி கசிவுகளைத் தீர்ப்பது

source: A **bandwidth inflation attack** happens when a malicious relay in the Tor network falsely reports a higher bandwidth capacity than it actually has.
ta: TOR நெட்வொர்க்கில் ஒரு தீங்கிழைக்கும் ரிலே உண்மையில் இருப்பதை விட அதிக அலைவரிசை திறனை பொய்யாகப் புகாரளிக்கும் போது ** அலைவரிசை பணவீக்க தாக்குதல் ** நிகழ்கிறது.

source: Another emerging threat comes from passive application-layer traffic patterns.
ta: மற்றொரு வளர்ந்து வரும் அச்சுறுத்தல் செயலற்ற பயன்பாட்டு-அடுக்கு போக்குவரத்து முறைகளிலிருந்து வருகிறது.

source: By focusing on the most serious issues, Tor continues to enhance the security and reliability of the network.
ta: மிகவும் கடுமையான சிக்கல்களில் கவனம் செலுத்துவதன் மூலம், டோர் தொடர்ந்து பிணையத்தின் பாதுகாப்பு மற்றும் நம்பகத்தன்மையை மேம்படுத்துகிறார்.

source: In a bandwidth inflation attack, the attacker manipulates the system by making their relay appear faster or more capable than it really is.
ta: ஒரு அலைவரிசை பணவீக்க தாக்குதலில், தாக்குபவர் தங்கள் ரிலே உண்மையில் இருப்பதை விட வேகமாக அல்லது திறமையானதாக தோன்றுவதன் மூலம் கணினியைக் கையாளுகிறார்.

source: These include cryptographic tagging, manipulation of cell headers, and dropped cells. Tor’s new project, the [Arti](https://gitlab.torproject.org/tpo/core/arti) client, resolves these critical vulnerabilities.
ta: கிரிப்டோகிராஃபிக் டேக்கிங், செல் தலைப்புகளை கையாளுதல் மற்றும் கைவிடப்பட்ட செல்கள் ஆகியவை இதில் அடங்கும். டோரின் புதிய திட்டம், [arti] (https://gitlab.torproject.org/tpo/core/arti) கிளையன்ட், இந்த முக்கியமான பாதிப்புகளைத் தீர்க்கிறது.

source: This gives the malicious relay a greater chance of being used in the network.
ta: இது தீங்கிழைக்கும் ரிலே நெட்வொர்க்கில் பயன்படுத்த அதிக வாய்ப்பை வழங்குகிறது.

source: This means that an attacker could monitor traffic and, based on the size, timing, or frequency of data packets, make educated guesses about the content or nature of the user's activity without directly interacting with or altering the data.
ta: இதன் பொருள், தாக்குபவர் போக்குவரத்தை கண்காணிக்க முடியும், மேலும் தரவு பாக்கெட்டுகளின் அளவு, நேரம் அல்லது அதிர்வெண் ஆகியவற்றின் அடிப்படையில், தரவை நேரடியாக தொடர்பு கொள்ளாமல் அல்லது மாற்றாமல் பயனரின் செயல்பாட்டின் உள்ளடக்கம் அல்லது தன்மை குறித்து படித்த யூகங்களை உருவாக்குகிறது.

source: To counter this, Tor detects and removes relays that falsely inflate their bandwidth, protecting users from these harmful relays.
ta: இதை எதிர்கொள்ள, TOR அவர்களின் அலைவரிசையை பொய்யாக உயர்த்தும் ரிலேக்களைக் கண்டறிந்து நீக்குகிறது, இந்த தீங்கு விளைவிக்கும் ரிலேக்களிலிருந்து பயனர்களைப் பாதுகாக்கிறது.

source: To tackle this, we port a traffic analysis framework and simulator to Arti, which will help in identifying and reducing these risks.
ta: இதைச் சமாளிக்க, நாங்கள் ஒரு போக்குவரத்து பகுப்பாய்வு கட்டமைப்பையும் சிமுலேட்டரையும் ஆர்ட்டிக்கு அனுப்புகிறோம், இது இந்த அபாயங்களை கண்டறிந்து குறைக்க உதவும்.

source: Tor relays are ranked based on their reported and measured bandwidth, and relays with higher bandwidth are more likely to be chosen by users to route their traffic.
ta: டோர் ரிலேக்கள் அவற்றின் அறிக்கையிடப்பட்ட மற்றும் அளவிடப்பட்ட அலைவரிசையின் அடிப்படையில் தரவரிசைப்படுத்தப்படுகின்றன, மேலும் அதிக அலைவரிசையுடன் கூடிய ரிலேக்கள் பயனர்கள் தங்கள் போக்குவரத்தை வழிநடத்தத் தேர்ந்தெடுக்கப்படுவதற்கான வாய்ப்புகள் அதிகம்.

source: Tor’s protocol has various information leaks, and while not all have been addressed yet, we focus on mitigating the most severe threats.
ta: டோரின் நெறிமுறையில் பல்வேறு செய்தி கசிவுகள் உள்ளன, மேலும் அனைத்தும் இன்னும் தீர்க்கப்படவில்லை என்றாலும், மிகக் கடுமையான அச்சுறுத்தல்களைத் தணிப்பதில் கவனம் செலுத்துகிறோம்.

source: We also take action against bandwidth inflation attacks by detecting and removing the malicious relays responsible.
ta: தீங்கிழைக்கும் ரிலேக்களைக் கண்டறிந்து அகற்றுவதன் மூலம் அலைவரிசை பணவீக்க தாக்குதல்களுக்கு எதிராக நாங்கள் நடவடிக்கை எடுக்கிறோம்.

source: Resolving Information Leaks
ta: செய்தி கசிவுகளைத் தீர்ப்பது

source: # Mitigating Attacks on the Tor Project
ta: # TOR திட்டத்தின் மீதான தாக்குதல்களைத் தணித்தல்

source: By having important conversations in the open, any attempts to harm the project are more easily noticed and stopped.
ta: திறந்த வெளியில் முக்கியமான உரையாடல்களைக் கொண்டிருப்பதன் மூலம், திட்டத்திற்கு தீங்கு விளைவிக்கும் எந்தவொரு முயற்சிகளும் மிகவும் எளிதாகக் கவனிக்கப்பட்டு நிறுத்தப்படுகின்றன.

source: First, we keep discussions public and transparent. This openness helps to build trust within the community and between contributors and the Tor Project itself.
ta: முதலில், நாங்கள் விவாதங்களை பொது மற்றும் வெளிப்படையானதாக வைத்திருக்கிறோம். இந்த திறந்த தன்மை சமூகத்திற்குள்ளும் பங்களிப்பாளர்களுக்கும் டோர் திட்டத்திற்கும் இடையில் நம்பிக்கையை வளர்க்க உதவுகிறது.

source: Handling malicious relays, for example, is a group effort.
ta: தீங்கிழைக்கும் ரிலேக்களைக் கையாள்வது, எடுத்துக்காட்டாக, ஒரு குழு முயற்சி.

source: In addition, Tor plans to share database dumps publicly so researchers can help verify the data and its integrity, adding an extra layer of protection against manipulation.
ta: கூடுதலாக, தரவுத்தளக் குப்பைகளை பகிரங்கமாகப் பகிர TOR திட்டமிட்டுள்ளது, எனவே ஆராய்ச்சியாளர்கள் தரவையும் அதன் ஒருமைப்பாட்டையும் சரிபார்க்க உதவலாம், மேலும் கையாளுதலுக்கு எதிராக கூடுதல் பாதுகாப்பை சேர்க்கலாம்.

source: Regular communication and clear policies also help to prevent confusion and keep everyone aligned toward the same goals.
ta: வழக்கமான தகவல்தொடர்பு மற்றும் தெளிவான கொள்கைகள் குழப்பத்தைத் தடுக்கவும், அனைவரையும் ஒரே இலக்குகளை நோக்கி இணைத்து வைத்திருக்கவும் உதவுகின்றன.

source: The community and staff work together to identify and remove bad relays, so the network stays secure.
ta: மோசமான ரிலேக்களை அடையாளம் காணவும் அகற்றவும் சமூகமும் ஊழியர்களும் ஒன்றிணைந்து செயல்படுகிறார்கள், எனவே பிணையம் பாதுகாப்பாக இருக்கும்.

source: This means that targeting or intimidating one person won’t stop the work from getting done.
ta: இதன் பொருள் ஒரு நபரை குறிவைப்பது அல்லது அச்சுறுத்துவது வேலை செய்வதைத் தடுக்காது.

source: Though defending against targeted attacks is challenging, our approach—combining transparency, teamwork,
ta: இலக்கு தாக்குதல்களுக்கு எதிராக பாதுகாப்பது சவாலானது என்றாலும், எங்கள் அணுகுமுறை -வெளிப்படைத்தன்மை, குழுப்பணி,

source: To address these threats, we do a few key things.
ta: இந்த அச்சுறுத்தல்களை நிவர்த்தி செய்ய, நாங்கள் சில முக்கிய விசயங்களைச் செய்கிறோம்.

source: To protect our infrastructure, Tor takes extra precautions. Databases are only accessible internally, and the information is shared through secure systems designed to prevent disruption.
ta: எங்கள் உள்கட்டமைப்பைப் பாதுகாக்க, டோர் கூடுதல் முன்னெச்சரிக்கை நடவடிக்கைகளை எடுக்கிறார். தரவுத்தளங்கள் உள்நாட்டில் மட்டுமே அணுகக்கூடியவை, மேலும் இடையூறு ஏற்படுவதைத் தடுக்க வடிவமைக்கப்பட்ட பாதுகாப்பான அமைப்புகள் மூலம் செய்தி பகிரப்படுகிறது.

source: Tor’s open environment allows anyone to contribute by writing code or engaging in discussions.
ta: டோரின் திறந்த சூழல் குறியீட்டை எழுதுவதன் மூலமோ அல்லது விவாதங்களில் ஈடுபடுவதன் மூலமோ யாரையும் பங்களிக்க அனுமதிக்கிறது.

source: Transparency is key, as it makes it harder for adversaries to exploit gaps in communication or processes.
ta: வெளிப்படைத்தன்மை முக்கியமானது, ஏனெனில் இது எதிரிகளுக்கு தொடர்பு அல்லது செயல்முறைகளில் உள்ள இடைவெளிகளைப் பயன்படுத்துவது கடினமானது.

source: When it comes to defending against attacks on staff or specific systems, we rely on teamwork, among other things.
ta: ஊழியர்கள் அல்லது குறிப்பிட்ட அமைப்புகள் மீதான தாக்குதல்களுக்கு எதிராக பாதுகாக்கும்போது, நாங்கள் குழுப்பணியை நம்புகிறோம்.

source: While this openness makes participation easy, it also presents opportunities for adversaries to disrupt the project.
ta: இந்த திறந்த தன்மை பங்கேற்பை எளிதாக்குகிறது என்றாலும், விரோதிகள் திட்டத்தை சீர்குலைப்பதற்கான வாய்ப்புகளையும் இது வழங்குகிறது.

source: and secure infrastructure—helps the project remain strong and resilient in the face of threats.
ta: மற்றும் பாதுகாப்பான உள்கட்டமைப்பு - அச்சுறுத்தல்களை எதிர்கொள்வதில் இந்த திட்டம் வலுவாகவும் நெகிழ்ச்சியாகவும் இருக்கும்.

source: Mitigating Attacks on the Tor Project
ta: TOR திட்டத்தின் மீதான தாக்குதல்களைத் தணித்தல்

source: ## Goals of attackers
ta: தாக்குதல் நடத்தியவர்களின் இலக்குகள்

source: ## Who is an attacker?
ta: ## தாக்குபவர் யார்?

source: ### 1. Revealing User Identities
ta: ### 1. பயனர் அடையாளங்களை வெளிப்படுத்துதல்

source: ### 2. Exploiting Tor Users
ta: ### 2. டோர் பயனர்களை சுரண்டுவது

source: ### 3. Disrupting the Network
ta: ### 3. பிணையத்தை சீர்குலைக்கும்

source: ### 4. Weakening the Tor Project
ta: ### 4. TOR திட்டத்தை பலவீனப்படுத்துதல்

source: - **Client-side attackers:**
ta: - ** கிளையன்ட் பக்க தாக்குபவர்கள்: **

source: - **Local attackers:**
ta: - ** உள்ளக தாக்குபவர்கள்: **

source: - **Network attackers:**
ta: - ** பிணையம் தாக்குபவர்கள்: **

source: - **Project attackers:**
ta: - ** திட்ட தாக்குதல் செய்பவர்கள்: **

source: An attacker is any individual, group, or organization that aims to compromise the security, anonymity, or integrity of the Tor network or the Tor Project itself.
ta: தாக்குபவர் என்பது எந்தவொரு தனிநபர், குழு அல்லது அமைப்பு ஆகும், இது TOR பிணையம் அல்லது TOR திட்டத்தின் பாதுகாப்பு, பெயர் தெரியாதது அல்லது ஒருமைப்பாட்டை வேறுபாடின்மை செய்வதை நோக்கமாகக் கொண்டுள்ளது.

source: Another goal may be to disrupt the Tor network, making it unreliable or slowing it down.
ta: மற்றொரு குறிக்கோள் டோர் நெட்வொர்க்கை சீர்குலைப்பதாக இருக்கலாம், அதை நம்பமுடியாததாக ஆக்குகிறது அல்லது அதை மெதுவாக்குகிறது.

source: Attackers may also target the Tor project directly, attempting to undermine its development, credibility, or organizational structure.
ta: தாக்குதல் நடத்தியவர்கள் TOR திட்டத்தை நேரடியாக குறிவைக்கலாம், அதன் வளர்ச்சி, நம்பகத்தன்மை அல்லது நிறுவன கட்டமைப்பைக் குறைமதிப்பிற்கு உட்படுத்த முயற்சிக்கிறார்கள்.

source: Attackers may seek to exploit Tor users by stealing assets like cryptocurrencies (e.g., Bitcoin) or siphoning off private and confidential information.
ta: கிரிப்டோகரன்ச்கள் (எ.கா., பிட்காயின்) போன்ற சொத்துக்களைத் திருடுவதன் மூலமோ அல்லது தனியார் மற்றும் ரகசிய தகவல்களைத் துடைப்பதன் மூலமோ தாக்குபவர்கள் பயனர்களை சுரண்ட முற்படலாம்.

source: Attackers might flood the network with traffic to that slow down the network or reduce the overall reliability of Tor services, making it less effective and accessible for users.
ta: தாக்குதல் நடத்தியவர்கள் நெட்வொர்க்கை மெதுவாக்கலாம் அல்லது TOR சேவைகளின் ஒட்டுமொத்த நம்பகத்தன்மையைக் குறைக்கலாம், இது குறைந்த செயல்திறன் மற்றும் பயனர்களுக்கு அணுகக்கூடியதாக இருக்கும்.

source: By identifying these attackers, we can better develop strategies to protect the network and its users.
ta: இந்த தாக்குபவர்களை அடையாளம் காண்பதன் மூலம், பிணையம் மற்றும் அதன் பயனர்களைப் பாதுகாப்பதற்கான உத்திகளை நாங்கள் சிறப்பாக உருவாக்க முடியும்.

source: By watching and intercepting traffic, these attackers can aim to profit financially or gather sensitive data that can be used for malicious purposes.
ta: போக்குவரத்தை கவனித்து இடைமறிப்பதன் மூலம், இந்த தாக்குதல் நடத்துபவர்கள் பொருள் ரீதியாக லாபம் பெறுவதை நோக்கமாகக் கொள்ளலாம் அல்லது தீங்கிழைக்கும் நோக்கங்களுக்காகப் பயன்படுத்தக்கூடிய முக்கியமான தரவைச் சேகரிக்கலாம்.

source: By weakening the project, attackers aim to diminish the effectiveness of Tor as a tool for privacy and freedom online.
ta: திட்டத்தை பலவீனப்படுத்துவதன் மூலம், தாக்குதல் நடத்துபவர்கள் ஆன்லைனில் தனியுரிமை மற்றும் சுதந்திரத்திற்கான ஒரு கருவியாக TOR இன் செயல்திறனைக் குறைப்பதை நோக்கமாகக் கொண்டுள்ளனர்.

source: However, various entities, with different motivations and capabilities, pose threats to this system.
ta: இருப்பினும், பல்வேறு நிறுவனங்கள், வெவ்வேறு உந்துதல்கள் மற்றும் திறன்களுடன், இந்த அமைப்புக்கு அச்சுறுத்தல்களை ஏற்படுத்துகின்றன.

source: If attackers succeed in deanonymizing users, they can strip away this protection, expose sensitive activities, compromise privacy, and potentially link users to their real-world identities.
ta: பயனர்களை டனொனிமிங் செய்வதில் தாக்குதல் நடத்தியவர்கள் செய் பெற்றால், அவர்கள் இந்த பாதுகாப்பை அகற்றலாம், முக்கியமான செயல்பாடுகளை அம்பலப்படுத்தலாம், தனியுரிமையை வேறுபாடின்மை செய்யலாம் மற்றும் பயனர்களை அவர்களின் நிச உலக அடையாளங்களுடன் இணைக்க முடியும்.

source: Local attackers, like ISPs or compromised Wi-Fi networks, can monitor and manipulate a user’s traffic, or disrupt their connection to the Tor network.
ta: உள்ளக தாக்குதல், ISP கள் அல்லது வேறுபாடின்மை செய்யப்பட்ட வைஃபை நெட்வொர்க்குகள் போன்றவை, பயனரின் போக்குவரத்தை கண்காணிக்கவும் கையாளவும் அல்லது TOR நெட்வொர்க்குடனான அவர்களின் தொடர்பை சீர்குலைக்கவும் முடியும்.

source: One of the main goals of attackers may be to uncover the identities of Tor users.
ta: தாக்குபவர்களின் முக்கிய குறிக்கோள்களில் ஒன்று TOR பயனர்களின் அடையாளங்களை வெளிக்கொணர்வதாக இருக்கலாம்.

source: Operating within the Tor Network, they can influence the network by injecting or manipulating traffic through the relays they run, potentially compromising the anonymity of users.
ta: TOR நெட்வொர்க்கில் இயங்குகிறது, அவர்கள் இயங்கும் ரிலேக்கள் மூலம் போக்குவரத்தை செலுத்துவதன் மூலமோ அல்லது கையாளுவதன் மூலமோ பிணையத்தை பாதிக்கலாம், இது பயனர்களின் அநாமதேயத்தை வேறுபாடின்மை செய்யக்கூடும்.

source: Our threat model identifies these entities and provides a foundational understanding of the possible threats faced by the Tor network.
ta: எங்கள் அச்சுறுத்தல் மாதிரி இந்த நிறுவனங்களை அடையாளம் காட்டுகிறது மற்றும் டோர் பிணையம் எதிர்கொள்ளும் அச்சுறுத்தல்களைப் பற்றிய அடிப்படை புரிதலை வழங்குகிறது.

source: Project attackers focus on The Tor Project itself, trying to introduce vulnerabilities or disrupt operations by targeting Tor software, infrastructure, or key personnel.
ta: திட்ட தாக்குதல் செய்பவர்கள் TOR திட்டத்தில் கவனம் செலுத்துகிறார்கள், TOR மென்பொருள், உள்கட்டமைப்பு அல்லது முக்கிய பணியாளர்களை குறிவைப்பதன் மூலம் பாதிப்புகளை அறிமுகப்படுத்த அல்லது செயல்பாடுகளை சீர்குலைக்க முயற்சிக்கிறார்கள்.

source: Some of these goals include:
ta: இந்த இலக்குகளில் சில பின்வருமாறு:

source: The Tor network is designed to provide anonymity and privacy for its users.
ta: டோர் பிணையம் அதன் பயனர்களுக்கு பெயர் மற்றும் தனியுரிமையை வழங்க வடிவமைக்கப்பட்டுள்ளது.

source: The attackers we are primarily focused on include:
ta: நாங்கள் முதன்மையாக கவனம் செலுத்தும் தாக்குதல் செய்பவர்கள் பின்வருமாறு:

source: These attackers may have various motivations, ranging from surveillance and data theft to disrupting the network’s functionality.
ta: இந்த தாக்குதல் நடத்துபவர்களுக்கு பல்வேறு உந்துதல்கள் இருக்கலாம், கண்காணிப்பு மற்றும் தரவு திருட்டு முதல் நெட்வொர்க்கின் செயல்பாட்டை சீர்குலைக்கும் வரை.

source: This could include introducing vulnerabilities into the software, discrediting the project, or creating conflicts within the community.
ta: மென்பொருளில் பாதிப்புகளை அறிமுகப்படுத்துவது, திட்டத்தை இழிவுபடுத்துதல் அல்லது சமூகத்திற்குள் மோதல்களை உருவாக்குவது ஆகியவை இதில் அடங்கும்.

source: This prevents users from securely accessing the internet, and persistent disruptions can undermine trust in Tor and their privacy protection.
ta: இது பயனர்கள் இணையத்தை பாதுகாப்பாக அணுகுவதைத் தடுக்கிறது, மேலும் தொடர்ச்சியான இடையூறுகள் TOR மற்றும் அவர்களின் தனியுரிமை பாதுகாப்பு மீதான நம்பிக்கையை குறைமதிப்பிற்கு உட்படுத்தும்.

source: Tor’s strength lies in providing privacy to its users.
ta: டோரின் வலிமை அதன் பயனர்களுக்கு தனியுரிமையை வழங்குவதில் உள்ளது.

source: Understanding what attackers aim to achieve can help users and developers better defend against these threats.
ta: தாக்குதல் செய்பவர்கள் எதை அடைய வேண்டும் என்பதைப் புரிந்துகொள்வது பயனர்கள் மற்றும் உருவாக்குபவர்கள் இந்த அச்சுறுத்தல்களுக்கு எதிராக சிறப்பாக பாதுகாக்க உதவும்.

source: Using a Tor client, these attackers might aim to degrade the network's performance by jamming it with traffic.
ta: ஒரு TOR கிளையண்டைப் பயன்படுத்தி, இந்த தாக்குதல் செய்பவர்கள் நெட்வொர்க்கின் செயல்திறனை போக்குவரத்துடன் நெரிசலாக்குவதன் மூலம் அதை இழிவுபடுத்துவதை நோக்கமாகக் கொள்ளலாம்.

source: Who is an attacker?
ta: தாக்குபவர் யார்?

source: ![An image showing a sample of how DDoS is carried out](/static/images/threat-model/client-side.png "title='DDoS attack on Tor' class='img-fluid'")
ta: ![டி.டி.ஓ.எச் எவ்வாறு மேற்கொள்ளப்படுகிறது என்பதற்கான மாதிரியைக் காட்டும் படம்](/static/images/threat-model/client-side.png "title='DDoS attack on Tor' class='img-fluid'")

source: ![An image showing positions of bad relays on the Tor network](/static/images/threat-model/network.png "title='Bad Relays on the Tor Network' class='img-fluid'")
ta: ![TOR நெட்வொர்க்கில் மோசமான ரிலேக்களின் நிலைகளைக் காட்டும் படம்](/static/images/threat-model/network.png "title='Bad Relays on the Tor Network' class='img-fluid'")

source: ### 1. Traffic Analysis: Watching how data moves
ta: ### 1. போக்குவரத்து பகுப்பாய்வு: தரவு எவ்வாறு நகர்கிறது என்பதைப் பார்ப்பது

source: ### 2. Malicious Relays: Bad friends in the chain
ta: ### 2. தீங்கிழைக்கும் ரிலேக்கள்: சங்கிலியில் மோசமான நண்பர்கள்

source: ### 3. Deanonymization: Revealing your identity
ta: ###. டியனொனொனிமிசேசன்: உங்கள் அடையாளத்தை வெளிப்படுத்துதல்

source: ### 4. DDoS Attacks: Overloading the network
ta: ### 4. DDOS தாக்குதல்கள்: பிணையத்தை ஓவர்லோட் செய்தல்

source: ### 5. Working with ISPs: Spying through your internet provider
ta: ### 5. ISP களுடன் பணிபுரிதல்: உங்கள் இணைய வழங்குநர் மூலம் உளவு பார்ப்பது
