Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: You may want to create a follow up survey, or at least contact participants and ask them to share their feedback with you.
ta: நீங்கள் ஒரு பின்தொடர்தல் கணக்கெடுப்பை உருவாக்க விரும்பலாம், அல்லது குறைந்த பட்சம் பங்கேற்பாளர்களைத் தொடர்பு கொண்டு, அவர்களின் கருத்துக்களை உங்களுடன் பகிர்ந்து கொள்ளச் சொல்லுங்கள்.

source: You'll share this link list on a whiteboard or project it at the training.
ta: இந்த இணைப்பு பட்டியலை ஒரு ஒயிட் போர்டில் பகிர்கிறீர்கள் அல்லது பயிற்சியில் திட்டமிடுவீர்கள்.

source: _Am I the right person to give this training?_
ta: _Am நான் இந்த பயிற்சியை வழங்க சரியான நபர்? _

source: Best Practices for Trainers
ta: பயிற்சியாளர்களுக்கான சிறந்த நடைமுறைகள்

source: Training
ta: பயிற்சி

source: Training Best Practices
ta: சிறந்த நடைமுறைகளுக்கு பயிற்சி

source: ## About the Venue
ta: ## இடம் பற்றி

source: ## After the Training
ta: ## பயிற்சிக்குப் பிறகு

source: ## Audience & Communication
ta: ## பார்வையாளர்கள் மற்றும் தொடர்பு

source: ## During the Training
ta: பயிற்சியின் போது ##

source: ## Prepare
ta: ## ஆயத்தம்

source: ## Security Protocol
ta: ## பாதுகாப்பு நெறிமுறை

source: * "All questions are welcome"
ta: * "எல்லா கேள்விகளும் வரவேற்கப்படுகின்றன"

source: * Collect participants' feedback
ta: * பங்கேற்பாளர்களின் கருத்துக்களை சேகரிக்கவும்

source: * I already contacted my organization and told them that I'm organizing this training
ta: * நான் ஏற்கனவே எனது நிறுவனத்தைத் தொடர்பு கொண்டு, இந்த பயிற்சியை ஏற்பாடு செய்கிறேன் என்று அவர்களிடம் சொன்னேன்

source: * I asked all participants to bring the necessary equipment to the training
ta: * அனைத்து பங்கேற்பாளர்களையும் தேவையான உபகரணங்களை பயிற்சிக்கு கொண்டு வரும்படி கேட்டேன்

source: * I have an agenda for the training
ta: * பயிற்சிக்கான நிகழ்ச்சி நிரல் என்னிடம் உள்ளது

source: * I have confirmed participants for the training
ta: * பயிற்சிக்காக பங்கேற்பாளர்களை உறுதிப்படுத்தியுள்ளேன்

source: * I read the Training [Best Practices](../best-practices/)
ta: * நான் பயிற்சியைப் படித்தேன் [சிறந்த நடைமுறைகள்] (../ சிறந்த நடைமுறைகள்/)

source: * I reviewed my [training slides](../resources/)
ta: * எனது [பயிற்சி ச்லைடுகளை] (../ வளங்கள்/) மதிப்பாய்வு செய்தேன்

source: * I shared a contact to whom my organization should call if something happens
ta: * ஏதேனும் நடந்தால் எனது அமைப்பு யாருக்கு அழைக்க வேண்டும் என்பதற்கு நான் ஒரு தொடர்பைப் பகிர்ந்து கொண்டேன்

source: * I shared the venue address, date and time to all participants
ta: * பங்கேற்பாளர்கள் அனைவருக்கும் இடம் முகவரி, தேதி மற்றும் நேரத்தை பகிர்ந்து கொண்டேன்

source: * Introduce yourself and ask people to introduce themselves
ta: * உங்களை அறிமுகப்படுத்திக் கொண்டு, தங்களை அறிமுகப்படுத்த மக்களிடம் கேளுங்கள்

source: * Leave an e-mail for further contact and support
ta: * மேலும் தொடர்பு மற்றும் ஆதரவுக்கு ஒரு மின்னஞ்சலை விடுங்கள்

source: * Make an agreement about taking or not taking photos
ta: * புகைப்படங்களை எடுப்பது அல்லது எடுக்காதது பற்றி ஒரு உடன்பாடு செய்யுங்கள்

source: * Make an evaluation about the training
ta: * பயிற்சியைப் பற்றி மதிப்பீடு செய்யுங்கள்

source: * Present the agenda
ta: * நிகழ்ச்சி நிரலை முன்வைக்கவும்

source: * Report to Community and UX team
ta: * சமூகம் மற்றும் யுஎக்ச் குழுவுக்கு அறிக்கை

source: * The venue has an internet connection and I know the wifi password
ta: * இந்த இடத்திற்கு இணைய இணைப்பு உள்ளது, மேலும் வைஃபை கடவுச்சொல் எனக்குத் தெரியும்

source: * The venue has enough tables and chairs for everyone
ta: * இந்த இடம் அனைவருக்கும் போதுமான அட்டவணைகள் மற்றும் நாற்காலிகள் உள்ளன

source: * There is a projector or TV available and works with my computer
ta: * ஒரு ப்ரொசெக்டர் அல்லது டிவி கிடைக்கிறது மற்றும் எனது கணினியுடன் வேலை செய்கிறது

source: Before starting the training, make sure you:
ta: பயிற்சியைத் தொடங்குவதற்கு முன், உங்களை உறுதிப்படுத்திக் கொள்ளுங்கள்:

source: Complete this checklist before running a Tor training.
ta: TOR பயிற்சியை இயக்குவதற்கு முன் இந்த சரிபார்ப்பு பட்டியலை முடிக்கவும்.

source: Based on our best practices, we have a checklist to help you prepare to conduct your training.
ta: எங்கள் சிறந்த நடைமுறைகளின் அடிப்படையில், உங்கள் பயிற்சியை நடத்துவதற்கு உங்களுக்கு உதவ ஒரு சரிபார்ப்பு பட்டியல் உள்ளது.

source: Training Checklist
ta: பயிற்சி சரிபார்ப்பு பட்டியல்

source: ## Code of Conduct for Trainers
ta: ## பயிற்சியாளர்களுக்கான நடத்தை விதிமுறை

source: The Tor Project is committed to fostering an inclusive environment and community. Tor is a place where people should feel safe to engage, share their point of view, and participate.
ta: டோர் திட்டம் ஒரு உள்ளடக்கிய சூழலையும் சமூகத்தையும் வளர்ப்பதில் உறுதிபூண்டுள்ளது. டோர் என்பது மக்கள் ஈடுபடவும், அவர்களின் பார்வையைப் பகிர்ந்து கொள்ளவும், பங்கேற்கவும் பாதுகாப்பாக உணர வேண்டிய இடம்.

source: Code of Conduct
ta: நடத்தை விதிமுறை

source: Foster a safe, engaging environment.
ta: பாதுகாப்பான, ஈர்க்கக்கூடிய சூழலை வளர்க்கவும்.

source: Code of Conduct for Trainers
ta: பயிற்சியாளர்களுக்கான நடத்தை விதிமுறை

source: ## We want to teach the world about Tor. Can you help?
ta: ## டோர் பற்றி உலகிற்கு கற்பிக்க விரும்புகிறோம். நீங்கள் உதவ முடியுமா?

source: Are you a Tor trainer or interested in becoming one? Looking for resources to help your community learn the most about Tor? We've got you covered.
ta: நீங்கள் ஒரு டோர் பயிற்சியாளரா அல்லது ஒருவராக மாற ஆர்வமாக உள்ளீர்களா? டோர் பற்றி உங்கள் சமூகத்திற்கு அதிகம் கற்றுக்கொள்ள உதவும் ஆதாரங்களைத் தேடுகிறீர்களா? நாங்கள் உங்களை மூடிமறைத்துள்ளோம்.

source: For some users with serious threat models, teaching Tor and other privacy tools can be risky if not done with care.
ta: கடுமையான அச்சுறுத்தல் மாதிரிகள் கொண்ட சில பயனர்களுக்கு, டோர் மற்றும் பிற தனியுரிமை கருவிகளை கற்பித்தல் கவனமாக செய்யாவிட்டால் ஆபத்தானது.

source: If this describes your community, or if you're not sure, please [contact our Community Team](https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-community-team) for more help.
ta: இது உங்கள் சமூகத்தை விவரித்தால், அல்லது உங்களுக்குத் தெரியாவிட்டால், தயவுசெய்து [எங்கள் சமூகக் குழுவை தொடர்பு கொள்ளவும்] (https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-community-team) மேலும் உதவிக்கு.

source: Check our resources
ta: எங்கள் வளங்களை சரிபார்க்கவும்

source: Do you teach your community about using Tor? These resources are for you.
ta: டோர் பயன்படுத்துவது பற்றி உங்கள் சமூகத்திற்கு கற்பிக்கிறீர்களா? இந்த வளங்கள் உங்களுக்கானவை.

source: These guides are explainers on topics related to Tor and digital security more broadly including: Web fingerprinting, Internet censorship, Tails, metadata security, and more! You can make use of these guides for self-learning or during trainings as reading resources. For training material, please visit [our training resources page](https://community.torproject.org/training/resources/)
ta: இந்த வழிகாட்டிகள் டோர் மற்றும் டிசிட்டல் பாதுகாப்பு தொடர்பான தலைப்புகளில் விளக்கமளிக்கும்: வலை கைரேகை, இணைய தணிக்கை, வால்கள், மேனிலை தரவு பாதுகாப்பு மற்றும் பல! இந்த வழிகாட்டிகளை தன்வய கற்றலுக்காக அல்லது பயிற்சிகளின் போது வாசிப்பு வளங்களாகப் பயன்படுத்தலாம். பயிற்சிப் பொருளுக்கு, தயவுசெய்து [எங்கள் பயிற்சி வளங்கள் பக்கம்] (https://community.torproject.org/training/resources/)

source: Check out our resources
ta: எங்கள் ஆதாரங்களைப் பாருங்கள்

source: Digital Security Guides
ta: டிசிட்டல் பாதுகாப்பு வழிகாட்டிகள்

source: A set of short guides on topics related to Tor and digital security more broadly, to share during trainings or for personal learning.
ta: டோர் மற்றும் டிசிட்டல் பாதுகாப்பு தொடர்பான தலைப்புகளில் குறுகிய வழிகாட்டிகளின் தொகுப்பு, பயிற்சிகளின் போது அல்லது தனிப்பட்ட கற்றலுக்காக பகிர்ந்து கொள்ள.

source: Or, if you want to teach your community about Tor, these training materials are for you!
ta: அல்லது, டோர் பற்றி உங்கள் சமூகத்திற்கு கற்பிக்க விரும்பினால், இந்த பயிற்சிப் பொருட்கள் உங்களுக்கானவை!

source: Our Community team delivers digital security training about Tor to human rights defenders, journalists, activists and marginalized communities around the world.
ta: உலகெங்கிலும் உள்ள மனித உரிமை பாதுகாவலர்கள், பத்திரிகையாளர்கள், ஆர்வலர்கள் மற்றும் ஓரங்கட்டப்பட்ட சமூகங்களுக்கு டோர் பற்றிய டிசிட்டல் பாதுகாப்பு பயிற்சியை எங்கள் சமூக குழு வழங்குகிறது.

source: To request a Tor training for your organization or community, please contact us and send an email to [training at torproject.org](mailto:training@torproject.org).
ta: உங்கள் அமைப்பு அல்லது சமூகத்திற்காக ஒரு TOR பயிற்சியைக் கோர, தயவுசெய்து எங்களைத் தொடர்புகொண்டு [Torproject.org இல் பயிற்சிக்கு ஒரு மின்னஞ்சல் அனுப்பவும் (mailto: windorproject.org).

source: Training Resources
ta: பயிற்சி வளங்கள்

source: * [Is there a backdoor in Tor?](https://support.torproject.org/about/backdoor/)
ta: * [டோரில் ஒரு கதவு இருக்கிறதா?] (Https://support.torproject.org/about/backdoor/)

source: * [What is the difference between using Tor Browser and 'incognito mode' or private tabs? ](https://support.torproject.org/tbb/tbb-and-incognito-mode/)
ta: * [டோர் உலாவி மற்றும் 'மறைநிலை பயன்முறை' அல்லது தனியார் தாவல்களைப் பயன்படுத்துவதில் என்ன வித்தியாசம்? ].

source: * [Who funds Tor?](https://support.torproject.org/misc/misc-3/)
ta: * [யார் டோர்?] (Https://support.torproject.org/misc/misc-3/)

source: * [Why did my search engine switch to DuckDuckGo? Or what is DuckDuckGo?](https://support.torproject.org/tbb/tbb-41/)
ta: * [எனது தேடுபொறி ஏன் டக்டகோவுக்கு மாறியது? .

source: * [Why don't you prevent bad people from doing bad things when using Tor?](https://support.torproject.org/misc/misc-2/)
ta: * [டோரைப் பயன்படுத்தும் போது மோசமான நபர்கள் மோசமான காரியங்களைச் செய்வதை ஏன் தடுக்கவில்லை?]

source: After running a couple of Tor trainings, you will find that first time users have some similar questions about Tor.
ta: ஓரிரு டோர் பயிற்சிகளை இயக்கிய பிறகு, முதல் முறையாக பயனர்கள் TOR பற்றி சில ஒத்த கேள்விகளைக் கொண்டிருப்பதை நீங்கள் காண்பீர்கள்.

source: For an extensive resource, check [Support portal](https://support.torproject.org).
ta: ஒரு விரிவான வளத்திற்கு, [ஆதரவு போர்ட்டலை] சரிபார்க்கவும் (https://support.torproject.org).

source: Outlined below are some of the most frequent questions we get during our training sessions. Be prepared for these questions before running your training.
ta: எங்கள் பயிற்சி அமர்வுகளின் போது நாம் அடிக்கடி பெறும் சில கேள்விகள் கீழே கோடிட்டுக் காட்டப்பட்டுள்ளன. உங்கள் பயிற்சியை நடத்துவதற்கு முன் இந்த கேள்விகளுக்கு தயாராக இருங்கள்.

source: People who are new to the Tor project, quite often, ask similar questions, and we can help you prepare for these questions.
ta: TOR திட்டத்திற்கு புதியவர்கள், பெரும்பாலும் இதேபோன்ற கேள்விகளைக் கேட்கிறார்கள், மேலும் இந்த கேள்விகளுக்குத் தயாராவதற்கு நாங்கள் உங்களுக்கு உதவ முடியும்.

source: Tor Training FAQ
ta: TOR பயிற்சி கேள்விகள்

source: During training, it is very common that users experience pain points and frustrations.
ta: பயிற்சியின் போது, பயனர்கள் வலி புள்ளிகளையும் ஏமாற்றங்களையும் அனுபவிப்பது மிகவும் பொதுவானது.

source: It's very important that you read the [User Research Guidelines](https://community.torproject.org/user-research/guidelines/) and both participant and training feedback beforehand, so you can better understand what to take notes about and how to care about users data privacy.
ta: [பயனர் ஆராய்ச்சி வழிகாட்டுதல்களை] (https://community.torproject.org/user-research/guidelines/) மற்றும் பங்கேற்பாளர் மற்றும் பயிற்சி பின்னூட்டங்களை முன்பே படிப்பது மிகவும் முதன்மை, எனவே குறிப்புகளைப் பற்றி எதைப் பற்றி எடுக்க வேண்டும் மற்றும் பயனர்களின் தரவு தனியுரிமையைப் பற்றி எவ்வாறு கவனிப்பது என்பதை நீங்கள் நன்கு புரிந்து கொள்ள முடியும்.

source: Knowing them can help the community to develop and make necessary user-centered improvements on Tor tools.
ta: அவற்றை அறிந்துகொள்வது சமூகத்திற்கு டோர் கருவிகளில் பயனரை மையமாகக் கொண்ட மேம்பாடுகளை உருவாக்கவும் உதவவும் உதவும்.

source: Use these materials to collect [participants' feedback](participant) about the training, and [this form to report](trainer) your training and user feedback to us.
ta: பயிற்சியைப் பற்றி [பங்கேற்பாளர்களின் பின்னூட்டம்] (பங்கேற்பாளர்) சேகரிக்க இந்த பொருட்களைப் பயன்படுத்தவும், மேலும் [புகாரளிக்க இந்த படிவம்] (பயிற்சியாளர்) உங்கள் பயிற்சி மற்றும் பயனர் கருத்துக்களை எங்களுக்கு.

source: We appreciate all the time you're taking to teach and improve Tor tools!
ta: TOR கருவிகளை கற்பிக்கவும் மேம்படுத்தவும் நீங்கள் எடுக்கும் எல்லா நேரங்களையும் நாங்கள் பாராட்டுகிறோம்!

source: We rely on user feedback to improve our software.
ta: எங்கள் மென்பொருளை மேம்படுத்த பயனர் கருத்துக்களை நாங்கள் நம்புகிறோம்.

source: Help us to improve Tor
ta: TOR ஐ மேம்படுத்த எங்களுக்கு உதவுங்கள்

source: We rely on user feedback to improve our software. Use these resources to collect feedback during your Tor Training.
ta: எங்கள் மென்பொருளை மேம்படுத்த பயனர் கருத்துக்களை நாங்கள் நம்புகிறோம். உங்கள் TOR பயிற்சியின் போது கருத்துக்களை சேகரிக்க இந்த வளங்களைப் பயன்படுத்தவும்.

source: Training Feedback
ta: பயிற்சி பின்னூட்டம்

source: #### Training Participants Survey
ta: #### பயிற்சி பங்கேற்பாளர்கள் கணக்கெடுப்பு

source: (Consider an answer of 1 as "I don't think I need protection", and 5 as "I really need protection"):
ta: (1 இன் பதிலை "எனக்கு பாதுகாப்பு தேவை என்று நான் நினைக்கவில்லை" என்றும், 5 "எனக்கு உண்மையில் பாதுகாப்பு தேவை" என்றும் கருதுங்கள்):

source: **Note:** *This file should be filled by the training participants.*
ta: ** குறிப்பு: ***இந்த கோப்பை பயிற்சி பங்கேற்பாளர்களால் நிரப்ப வேண்டும்.*

source: **Please share**:
ta: ** தயவுசெய்து பகிரவும் **:

source: **Thank you!**
ta: ** நன்றி! **

source: - Country:
ta: - நாடு:

source: - Date:
ta: - தேதி:

source: - Facilitator/Trainer:
ta: - வசதி/பயிற்சியாளர்:

source: - Organization:
ta: - அமைப்பு:

source: - ▢ At least once a day
ta: - a ஒரு நாளைக்கு ஒரு முறையாவது

source: - ▢ At least once a week
ta: - வாரத்திற்கு ஒரு முறையாவது

source: - ▢ Between 20 - 40
ta: - the 20 - 40 க்கு இடையில்

source: - ▢ Day to day technology user
ta: - ▢ அன்றாட தொழில்நுட்ப பயனர்

source: - ▢ Desktop or laptop computer
ta: - ▢ டெச்க்டாப் அல்லது லேப்டாப் கணினி

source: - ▢ Female
ta: - ▢ பெண்

source: - ▢ I do not use a VPN
ta: - ▢ நான் ஒரு VPN ஐப் பயன்படுத்துவதில்லை

source: - ▢ Just in specific situations
ta: - குறிப்பிட்ட சூழ்நிலைகளில்

source: - ▢ Less than 20
ta: - ▢ 20 க்கும் குறைவானது

source: - ▢ Male
ta: - ▢ ஆண்

source: - ▢ Mobile/cell phone
ta: - ▢ மொபைல்/செல்போன்

source: - ▢ More than 40
ta: - ▢ 40 க்கு மேல்

source: - ▢ N/A
ta: - ▢ இதற்கில்லை

source: - ▢ Non binary
ta: - ▢ அல்லாத பைனரி

source: - ▢ Other:
ta: - ▢ மற்றவை:

source: - ▢ Prefer not to disclose
ta: - ben வெளிப்படுத்த வேண்டாம்

source: - ▢ Someone that has a good understanding of tools and how things work
ta: - the கருவிகளைப் பற்றி நன்கு புரிந்து கொண்ட ஒருவர் மற்றும் விசயங்கள் எவ்வாறு செயல்படுகின்றன

source: - ▢ Tablet
ta: - ▢ டேப்லெட்

source: - ▢ Technical Expert
ta: - ▢ தொழில்நுட்ப வல்லுநர்

source: - ▢ Tor Browser for Android
ta: - ஆண்ட்ராய்டு க்கான டோர் உலாவி

source: - ▢ Tor Browser for Desktop
ta: - ▢ டெச்க்டாப்பிற்கான டோர் உலாவி

source: 1. Is this your first Digital Security training?
ta: 1. இது உங்கள் முதல் டிசிட்டல் பாதுகாப்பு பயிற்சியா?

source: 10. What gender do you identify as?
ta: 10. நீங்கள் என்ன பாலினத்தை அடையாளம் காண்கிறீர்கள்?

source: 11. Would you describe yourself mostly as a...
ta: 11. உங்களை பெரும்பாலும் ஒரு என்று வர்ணிப்பீர்களா ...

source: 12. How old are you?
ta: 12. உங்களுக்கு எவ்வளவு வயது?

source: 13. How can this training be useful for your work?
ta: 13. உங்கள் வேலைக்கு இந்த பயிற்சி எவ்வாறு பயனுள்ளதாக இருக்கும்?

source: 14. Are there any additional topics missing that you would still like to learn?
ta: 14. நீங்கள் இன்னும் கற்றுக்கொள்ள விரும்பும் கூடுதல் தலைப்புகள் ஏதேனும் உள்ளதா?

source: 2. Is this the first Tor training you attend?
ta: 2. நீங்கள் கலந்துகொள்ளும் முதல் டோர் பயிற்சியா இதுதானா?

source: 3. On a scale of 1 to 5, circle the option of how strongly you believe you need to protect your privacy and security online.
ta: 3. 1 முதல் 5 வரை, உங்கள் தனியுரிமை மற்றும் பாதுகாப்பை ஆன்லைனில் பாதுகாக்க வேண்டும் என்று நீங்கள் எவ்வளவு வலுவாக நம்புகிறீர்கள் என்ற விருப்பத்தை வட்டமிடுங்கள்.

source: 4. What types of devices do you use to access the Internet?
ta: 4. இணையத்தை அணுக நீங்கள் எந்த வகையான சாதனங்களைப் பயன்படுத்துகிறீர்கள்?

source: 5. Have you used Tor before?
ta: 5. நீங்கள் முன்பு பழகினீர்களா?

source: 6. How often do you use Tor?
ta: 6. நீங்கள் எத்தனை முறை டோரைப் பயன்படுத்துகிறீர்கள்?

source: 7. Which of the following Tor-powered products do you use?
ta: 7. பின்வரும் டோர்-இயங்கும் தயாரிப்புகளில் எது பயன்படுத்துகிறீர்கள்?

source: 8. How often do you use a VPN?
ta: 8. நீங்கள் ஒரு VPN ஐ எத்தனை முறை பயன்படுத்துகிறீர்கள்?

source: 9. Which VPN do you use?
ta: 9. நீங்கள் எந்த வி.பி.என் பயன்படுத்துகிறீர்கள்?

source: Feel free to contact us if you have any questions or suggestions at ``ux-team@torproject.org``.
ta: `` Ux-team@torproject.org`` இல் ஏதேனும் கேள்விகள் அல்லது பரிந்துரைகள் இருந்தால் எங்களை தொடர்பு கொள்ளலாம்.

source: ▢ Yes - ▢ No
ta: ▢ ஆம் - இல்லை

source: Use this form to collect participants' feedback about Tor training sessions. Print, distribute and ask participants to fill it by the end of the training.
ta: TOR பயிற்சி அமர்வுகள் குறித்து பங்கேற்பாளர்களின் கருத்துக்களை சேகரிக்க இந்த படிவத்தைப் பயன்படுத்தவும். பயிற்சியின் முடிவில் அதை நிரப்ப பங்கேற்பாளர்களை அச்சிட்டு, விநியோகிக்கவும், கேட்கவும்.

source: Training participants survey
ta: பயிற்சி பங்கேற்பாளர்கள் கணக்கெடுப்பு

source: # Training Feedback Report
ta: # பயிற்சி கருத்து அறிக்கை

source: ### Activities Done
ta: ### செயல்பாடுகள் முடிந்தது

source: ### Audience
ta: ### பார்வையாளர்கள்

source: ### Questions from the group
ta: குழுவிலிருந்து ### கேள்விகள்

source: ### Venue Notes
ta: ### இடம் குறிப்புகள்

source: #### Feedback about Tor in general
ta: #### பொதுவாக டோர் பற்றிய கருத்து

source: #### Feedback about Tor tools
ta: TOR கருவிகளைப் பற்றிய #### கருத்து

source: #### How can Tor support you better next time?
ta: #### அடுத்த முறை உங்களை எவ்வாறு சிறப்பாக ஆதரிக்க முடியும்?

source: #### Number of participants:
ta: #### பங்கேற்பாளர்களின் எண்ணிக்கை:

source: #### Training
ta: #### பயிற்சி

source: **Date:**
ta: ** தேதி: **

source: **Facilitator:**
ta: ** வசதியாளர்: **

source: **Location:**
ta: ** இடம்: **

source: **Note:**
ta: ** குறிப்பு: **

source: **Organization:**
ta: ** அமைப்பு: **

source: Add anything that can be useful for you, feel free to use bullet points.
ta: உங்களுக்கு பயனுள்ளதாக இருக்கும் எதையும் சேர்க்கவும், புல்லட் புள்ளிகளைப் பயன்படுத்தலாம்.

source: Describing the venue is helpful to understand the context of your HRD audience and what is needed to improve your training next time. Share with us some notes about it (for instance, if it is a community center, has internet, etc).
ta: உங்கள் மனிதவள மேம்பாட்டு பார்வையாளர்களின் சூழலையும், அடுத்த முறை உங்கள் பயிற்சியை மேம்படுத்த என்ன தேவை என்பதையும் புரிந்துகொள்ள இடத்தை விவரிப்பது உதவியாக இருக்கும். அதைப் பற்றிய சில குறிப்புகளை எங்களுடன் பகிர்ந்து கொள்ளுங்கள் (உதாரணமாக, இது ஒரு சமூக மையமாக இருந்தால், இணையம் போன்றவை).

source: If possible, include gender diversity as well.
ta: முடிந்தால், பாலின பன்முகத்தன்மையையும் சேர்க்கவும்.

source: List here up to 10 questions that the group brought up during the training.
ta: பயிற்சியின் போது குழு கொண்டு வந்த 10 கேள்விகள் வரை இங்கே பட்டியலிடுங்கள்.

source: List the participants' feedback about Tor here <small>(how they believe Tor can support their work, what they expect from digital security tools, etc)</small>.
ta: டோர் பற்றிய பங்கேற்பாளர்களின் கருத்தை இங்கே பட்டியலிடுங்கள் <mall> (டோர் தங்கள் வேலையை ஆதரிக்க முடியும் என்று அவர்கள் நம்புகிறார்கள், டிசிட்டல் பாதுகாப்பு கருவிகளிலிருந்து அவர்கள் எதிர்பார்ப்பது போன்றவை) </சிறிய>.

source: List the participants' feedback about the Tor tool they learned and installed here <small>(Example: were participants able to install the Tor tool? Did it work after installation? If it didn't, please list what device - model and operating system - was the participant using, as well as the kind of problems they experienced. If possible, also share the error log. If you were able to troubleshoot and solve the problem, please share it)</small>.
ta: அவர்கள் கற்றுக்கொண்ட மற்றும் நிறுவிய டோர் கருவி பற்றிய பங்கேற்பாளர்களின் கருத்தை இங்கே பட்டியலிடுங்கள் <mall> (எடுத்துக்காட்டு: பங்கேற்பாளர்கள் TOR கருவியை நிறுவ முடியுமா? நிறுவலுக்குப் பிறகு அது செயல்படவில்லையா? அவ்வாறு செய்யாவிட்டால், தயவுசெய்து எந்த சாதனம் - மாதிரி மற்றும் இயக்க முறைமை - பங்கேற்பாளர் பயன்படுத்தினார்கள், அதேபோல் அவர்கள் அனுபவித்த சிக்கல்களும்.

source: List the participants' feedback about the training <small>(for instance: if the participants need more trainings in the same topics, if they asked for more tools on privacy and security, etc)</small>.
ta: பயிற்சியைப் பற்றிய பங்கேற்பாளர்களின் கருத்தை பட்டியலிடுங்கள் <ச்மால்> (உதாரணமாக: பங்கேற்பாளர்களுக்கு ஒரே தலைப்புகளில் அதிக பயிற்சிகள் தேவைப்பட்டால், தனியுரிமை மற்றும் பாதுகாப்பு குறித்த கூடுதல் கருவிகளைக் கேட்டால்) </சிறிய>.

source: Tell us about the activity you just did, which tools did you cover, what was the main goal for the activity. Feel free to use bullet points.
ta: நீங்கள் செய்த செயல்பாடு, நீங்கள் எந்த கருவிகளை உள்ளடக்கியது, செயல்பாட்டிற்கான முக்கிய குறிக்கோள் என்ன என்பதைப் பற்றி எங்களிடம் கூறுங்கள். புல்லட் புள்ளிகளைப் பயன்படுத்த தயங்க.

source: This file should be filled by the trainer/facilitator or note taker.
ta: இந்த கோப்பை பயிற்சியாளர்/வசதியாளர் அல்லது குறிப்பு எடுப்பவர் நிரப்ப வேண்டும்.

source: We want to know who our users are. We don't like boolean options here, so a qualitative descriptive paragraph illustrating if you are working with human rights defenders, journalists, or students is very useful.
ta: எங்கள் பயனர்கள் யார் என்பதை நாங்கள் அறிய விரும்புகிறோம். நாங்கள் இங்கே பூலியன் விருப்பங்களை விரும்பவில்லை, எனவே நீங்கள் மனித உரிமை பாதுகாவலர்கள், பத்திரிகையாளர்கள் அல்லது மாணவர்களுடன் பணிபுரிகிறீர்களா என்பதை விளக்கும் ஒரு தரமான விளக்கமான பத்தி மிகவும் பயனுள்ளதாக இருக்கும்.

source: This template guides the trainer through reporting user and trainer needs when running a Tor training. Use it to report your training to us.
ta: TOR பயிற்சியை இயக்கும் போது பயனர் மற்றும் பயிற்சியாளர் தேவைகளைப் புகாரளிப்பதன் மூலம் இந்த வார்ப்புரு பயிற்சியாளரை வழிநடத்துகிறது. உங்கள் பயிற்சியை எங்களிடம் புகாரளிக்க இதைப் பயன்படுத்தவும்.

source: Training report
ta: பயிற்சி அறிக்கை

source: Since 2018, we have formed partnerships with the following organizations. They have organized Tor trainings, collected user feedback, promoted the Tor Project mission and values.
ta: 2018 முதல், பின்வரும் நிறுவனங்களுடன் கூட்டாண்மைகளை உருவாக்கியுள்ளோம். அவர்கள் டோர் பயிற்சிகளை ஒழுங்கமைத்து, பயனர் கருத்துக்களை சேகரித்தனர், டோர் திட்ட பணி மற்றும் மதிப்புகளை ஊக்குவித்தனர்.

source: Since 2018, we have formed parterships with the following organizations.
ta: 2018 முதல், பின்வரும் அமைப்புகளுடன் கூட்டாண்மை உருவாக்கியுள்ளோம்.

source: Partners
ta: பங்காளிகள்

source: All training material is available under the [Creative Commons Attribution-ShareAlike License 4.0](https://creativecommons.org/licenses/by-sa/4.0/) (CC BY-SA 4.0).
ta: அனைத்து பயிற்சிப் பொருட்களும் [கிரியேட்டிவ் காமன்ச் பண்புக்கூறு-சரேலைக் உரிமம் 4.0] (https://creativecommons.org/licenses/by-sa/4.0/) (சிசி பை-எச்ஏ 4.0) இன் கீழ் கிடைக்கின்றன.

source: To request a Tor training for your organization or community, please contact us through the email [training at torproject.org](mailto:training@torproject.org).
ta: உங்கள் அமைப்பு அல்லது சமூகத்திற்கு ஒரு TOR பயிற்சியைக் கோர, தயவுசெய்து எங்களை மின்னஞ்சல் மூலம் தொடர்பு கொள்ளவும் [Torproject.org இல் பயிற்சி] (mailto: staingtorproject.org).

source: ## Evaluating risks
ta: ## அபாயங்களை மதிப்பீடு செய்தல்

source: * Anonymity software?
ta: * பெயர் தெரியாத மென்பொருள்?

source: * Are there laws in my country that require Internet Service Providers (ISPs) to track my online activity?
ta: * எனது நிகழ்நிலை செயல்பாட்டைக் கண்காணிக்க இணைய பணி வழங்குநர்கள் (ISP கள்) தேவைப்படும் சட்டங்கள் எனது நாட்டில் உள்ளதா?

source: * Cryptography?
ta: * குறியாக்கவியல்?

source: * Does my country prohibit me from using:
ta: * எனது நாடு பயன்படுத்துவதைத் தடைசெய்கிறதா:
