Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: If you decide to use a fixed obfs4 port smaller than 1024 (for example 80 or 443), you will need to configure systemd and give obfs4 `CAP_NET_BIND_SERVICE` capabilities to bind the port with a non-root user:
ta: நீங்கள் 1024 ஐ விடச் சிறிய நிலையான obfs4 போர்ட்டைப் பயன்படுத்த முடிவு செய்தால் (எடுத்துக்காட்டாக 80 அல்லது 443), நீங்கள் systemd ஐ உள்ளமைத்து, ரூட் அல்லாத பயனருடன் போர்ட்டை பிணைக்க obfs4 `CAP_NET_BIND_SERVICE` திறன்களை வழங்க வேண்டும்:

source: If you're running any of them, `sudo apt-get install obfs4proxy` should work.
ta: அவற்றில் ஏதேனும் ஒன்றை நீங்கள் இயக்குகிறீர்கள் என்றால், `sudo apt-get install obfs4proxy` வேலை செய்ய வேண்டும்.

source: In the editor, enter the following text, then save and quit.
ta: எடிட்டரில், பின்வரும் உரையை உள்ளிட்டு, பின்னர் சேமித்து விடுங்கள்.

source: In the second editor that appears, enter the same text, then save and quit.
ta: தோன்றும் இரண்டாவது எடிட்டரில், அதே உரையை உள்ளிட்டு, பின்னர் சேமித்து விடுங்கள்.

source: Note that both Tor's OR port and its obfs4 port must be reachable. If your bridge is behind a firewall or NAT, make sure to open both ports. You can use our [reachability test](https://bridges.torproject.org/scan/) to see if your obfs4 port is reachable from the Internet.
ta: டோர் அல்லது துறைமுகம் மற்றும் அதன் OBFS4 துறைமுகம் இரண்டையும் அணுக வேண்டும் என்பதை நினைவில் கொள்க. உங்கள் பாலம் ஒரு ஃபயர்வால் அல்லது NAT க்கு பின்னால் இருந்தால், இரு துறைமுகங்களையும் திறக்க உறுதிசெய்க. உங்கள் OBFS4 துறைமுகம் இணையத்திலிருந்து அடைய முடியுமா என்பதைப் பார்க்க எங்கள் [அணுகல் சோதனை] (https://bridges.torproject.org/scan/) ஐப் பயன்படுத்தலாம்.

source: Now restart tor service:
ta: இப்போது TOR சேவையை மறுதொடக்கம் செய்யுங்கள்:

source: On [Debian](https://packages.debian.org/search?keywords=obfs4proxy), the `obfs4proxy` package is available in unstable, testing, and stable.
ta: On [Debian](https://packages.debian.org/search?keywords=obfs4proxy), the `obfs4proxy` தொகுப்பு is available in unstable, testing, and stable.

source: On [Ubuntu](https://packages.ubuntu.com/search?keywords=obfs4proxy), bionic, cosmic, disco, eoan, and focal have the package.
ta: [Ubuntu] (https://packages.ubuntu.com/search?keywords=obfs4proxy), பயோனிக், காச்மிக், டிச்கோ, ஈயான் மற்றும் ஃபோகல் ஆகியவை தொகுப்பைக் கொண்டுள்ளன.

source: Or restart it if it was running already, so configurations take effect:
ta: அல்லது அது ஏற்கனவே இயங்கினால் அதை மறுதொடக்கம் செய்யுங்கள், எனவே உள்ளமைவுகள் நடைமுறைக்கு வருகின்றன:

source: Run the command:
ta: கட்டளையை இயக்கவும்:

source: There is no need to run `systemctl daemon-reload` because `systemctl edit` does it automatically.
ta: `Systemctl tamen-reload` ஐ இயக்க வேண்டிய அவசியமில்லை, ஏனெனில்` systemctl திருத்து` அதை தானாகவே செய்கிறது.

source: To confirm your bridge is running with no issues, you should see something like this (usually in `/var/log/syslog` or run `# journalctl -e -u tor@default`):
ta: உங்கள் பாலம் எந்த சிக்கலும் இல்லாமல் இயங்குகிறது என்பதை உறுதிப்படுத்த, நீங்கள் இதுபோன்ற ஒன்றைக் காண வேண்டும் (வழக்கமாக `/var/log/syslog` அல்லது`# சர்னல்ச்ட்ல் -இ -u டோர்@இயல்புநிலை` ஐ இயக்கவும்):

source: To work around systemd hardening, you will also need to edit and change the configuration.
ta: Systemd Hardening ஐச் சுற்றி வேலை செய்ய, நீங்கள் உள்ளமைவைத் திருத்தி மாற்ற வேண்டும்.

source: How to deploy an obfs4 bridge on Debian / Ubuntu
ta: டெபியன் / உபுண்டுவில் OBFS4 பாலத்தை எவ்வாறு பயன்படுத்துவது

source: Debian / Ubuntu
ta: டெபியன் / உபுண்டு

source: # Your bridge's Tor port.
ta: # உங்கள் பாலத்தின் டோர் துறைமுகம்.

source: # Your bridge's obfs4 port.
ta: # உங்கள் பாலத்தின் OBFS4 துறைமுகம்.

source: # Your email address.
ta: # உங்கள் மின்னஞ்சல் முகவரி.

source: ### 1. Deploy a container
ta: ### 1. ஒரு கொள்கலனைப் பயன்படுத்துங்கள்

source: ### 2. Upgrade your container
ta: ### 2. உங்கள் கொள்கலனை மேம்படுத்தவும்

source: ### 3. Monitor your logs
ta: ### 3. உங்கள் பதிவுகளை கண்காணிக்கவும்

source: ### 4. Advanced usage
ta: ### 4. மேம்பட்ட பயன்பாடு

source: And then restarting the container:
ta: பின்னர் கொள்கலனை மறுதொடக்கம் செய்தல்:

source: First, [download docker-compose.yml](https://gitlab.torproject.org/torproject/anti-censorship/docker-obfs4-bridge/raw/main/docker-compose.yml), and then write your bridge configuration to a new file, `.env`, which is in the same directory as `docker-compose.yml`. Here's a template:
ta: முதலாவதாக, [docker-compose.yml] (https://gitlab.torproject.org/torproject/anti-censorship/docker-obfs4-bridge/raw/main/docker-comoposy.yml), பின்னர் உங்கள் பாலம் உள்ளமைவை ஒரு புதிய கோப்பில் எழுதுங்கள், `. இங்கே ஒரு வார்ப்புரு:

source: Here's how you can get your bridge line:
ta: உங்கள் பாலம் வரியை எவ்வாறு பெறலாம் என்பது இங்கே:

source: If you are running multiple bridges on your computer, you need to repeat this step for each bridge.
ta: உங்கள் கணினியில் பல பாலங்களை இயக்குகிறீர்கள் என்றால், ஒவ்வொரு பாலத்திற்கும் இந்த படிநிலையை மீண்டும் செய்ய வேண்டும்.

source: Note that your bridge's data directory (which includes its key material) is stored in a docker volume, so you won't lose your bridge's identity when upgrading to the latest docker image.
ta: உங்கள் பாலத்தின் தரவு அடைவு (இதில் அதன் முக்கிய பொருளை உள்ளடக்கியது) ஒரு கப்பல்துறை தொகுதியில் சேமிக்கப்படுகிறது என்பதை நினைவில் கொள்க, எனவே அண்மைக் கால கப்பல்துறை படத்திற்கு மேம்படுத்தும்போது உங்கள் பாலத்தின் அடையாளத்தை இழக்க மாட்டீர்கள்.

source: Replace `X` with your desired OR port, `Y` with your obfs4 port (make sure that **both** ports are forwarded in your firewall), and `Z` with your email address, which allows us to get in touch with you if there are problems with your bridge.
ta: `X` ஐ நீங்கள் விரும்பிய அல்லது துறைமுகத்துடன் மாற்றவும்,` y` உங்கள் OBFS4 துறைமுகம் மூலம் (** இரண்டு ** துறைமுகங்களும் உங்கள் ஃபயர்வாலில் அனுப்பப்பட்டுள்ளன என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்), மற்றும் உங்கள் மின்னஞ்சல் முகவரியுடன் `Z`, இது தொடர்புக்கு வர அனுமதிக்கிறது உங்கள் பாலத்தில் சிக்கல்கள் இருந்தால் உங்களுடன்.

source: That's it! Your container is now bootstrapping your new obfs4 bridge.
ta: அவ்வளவுதான்! உங்கள் கொள்கலன் இப்போது உங்கள் புதிய OBFS4 பாலத்தை பூட்ச்ட்ராப்பிங் செய்கிறது.

source: This command will automatically load your `docker-compose.yml` file while considering the environment variables in `.env`.
ta: `.Env` இல் உள்ள சுற்றுச்சூழல் மாறிகளைக் கருத்தில் கொண்டு இந்த கட்டளை தானாகவே உங்கள்` டோக்கர்-கம்ப்.ஒய்.எம்.எல்` கோப்பை ஏற்றும்.

source: This will return a string similar to the following:
ta: இது பின்வருவனவற்றைப் போன்ற ஒரு சரத்தை வழங்கும்:

source: To use your new bridge in Tor Browser, you need its "bridge line".
ta: டோர் உலாவியில் உங்கள் புதிய பாலத்தைப் பயன்படுத்த, உங்களுக்கு அதன் "பிரிட்ச் லைன்" தேவை.

source: Upgrading to the latest version of our image is as simple as pulling the latest version of the image running:
ta: எங்கள் படத்தின் அண்மைக் கால பதிப்பை மேம்படுத்துவது படத்தின் அண்மைக் கால பதிப்பை இழுப்பது போல எளிது:

source: We provide a docker-compose file that helps you deploy the container.
ta: கொள்கலனை வரிசைப்படுத்த உதவும் ஒரு டோக்கர்-சமமான கோப்பை நாங்கள் வழங்குகிறோம்.

source: We will announce new image versions on the [tor-dev](https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-dev) mailing list.
ta: [TOR-DEV] (https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-dev) அஞ்சல் பட்டியலில் புதிய பட பதிப்புகளை அறிவிப்போம்.

source: With your bridge configuration in place, you can now deploy the container by running:
ta: உங்கள் பாலம் உள்ளமைவு மூலம், நீங்கள் இப்போது கொள்கலனை இயக்குவதன் மூலம் வரிசைப்படுத்தலாம்:

source: You can inspect your bridge's logs by running:
ta: இயங்குவதன் மூலம் உங்கள் பாலத்தின் பதிவுகளை ஆய்வு செய்யலாம்:

source: You may [download our template .env](https://gitlab.torproject.org/torproject/anti-censorship/docker-obfs4-bridge/raw/main/.env) to get started.
ta: தொடங்குவதற்கு நீங்கள் [எங்கள் வார்ப்புரு .env] (https://gitlab.torproject.org/torproject/anti-censorship/docker-obfs4-bridge/raw/main/.env) ஐ பதிவிறக்கம் செய்யலாம்.

source: You may set additional torrc variables in your `.env` file by setting `OBFS4_ENABLE_ADDITIONAL_VARIABLES` to 1 and prefixing the desired torrc options with `OBFS4V_`. For example, to set the `AddressDisableIPv6` option, include the following lines in your `.env`:
ta: `Obfs4_enable_additional_variables` ஐ 1 ஆக அமைப்பதன் மூலமும், விரும்பிய டோர்க் விருப்பங்களை` OBFS4V_` உடன் முன்னொட்டு செய்வதன் மூலமும் உங்கள் `.env` கோப்பில் கூடுதல் டோர்க் மாறிகள் அமைக்கலாம். எடுத்துக்காட்டாக, `முகவரி disableipv6` விருப்பத்தை அமைக்க, உங்கள்` .env` இல் பின்வரும் வரிகளைச் சேர்க்கவும்:

source: You should now see output similar to the following:
ta: பின்வருவனவற்றைப் போன்ற வெளியீட்டை நீங்கள் இப்போது காண வேண்டும்:

source: How to deploy an obfs4 bridge using a docker container
ta: கப்பல்துறை கொள்கலனைப் பயன்படுத்தி OBFS4 பாலத்தை எவ்வாறு பயன்படுத்துவது

source: Docker
ta: கப்பல்துறை

source: ### 2. Bootstrap `pkg`
ta: ### 2. தொடக்கவார் `பி.கே.சி`

source: ### 5. Edit your Tor config file, usually located at `/usr/local/etc/tor/torrc` and replace its content with:
ta: ### 5. உங்கள் டோர் கட்டமைப்பு கோப்பைத் திருத்தவும், வழக்கமாக `/usr/local/etc/tor/torrc` இல் அமைந்துள்ளது மற்றும் அதன் உள்ளடக்கத்தை மாற்றவும்:

source: ### 6. Start Tor
ta: ### 6. தொடக்க டோர்

source: ##### 2.1. Recommended steps to setup `pkg`
ta: ##### 2.1. `பி.கே.சி` அமைக்க பரிந்துரைக்கப்பட்ட படிகள்

source: **DragonflyBSD** has 2 packages repositories:
ta: ** டிராகன்ஃபிளைச்.டி ** இல் 2 தொகுப்புகள் களஞ்சியங்கள் உள்ளன:

source: After applying all these changes, we update the packages list again and try to check if there's already a new update to apply:
ta: இந்த மாற்றங்கள் அனைத்தையும் பயன்படுத்திய பிறகு, தொகுப்புகள் பட்டியலை மீண்டும் புதுப்பித்து, விண்ணப்பிக்க ஏற்கனவே புதிய புதுப்பிப்பு இருக்கிறதா என்று சரிபார்க்க முயற்சிக்கிறோம்:

source: DragonFlyBSD's daily snapshots and releases (starting with 3.4) come with `pkg` already installed. Upgrades from earlier releases, however, will not have it. If `pkg` is missing on the system for any reason, it can be quickly bootstrapped without having to build it from source or even having **DPorts** installed:
ta: டிராகன்ஃபிளைச்.டி.யின் டெய்லி ச்னாப்சாட்கள் மற்றும் வெளியீடுகள் (3.4 உடன் தொடங்கி) ஏற்கனவே நிறுவப்பட்ட `பி.கே.சி` உடன் வருகின்றன. முந்தைய வெளியீடுகளிலிருந்து மேம்படுத்தல்களுக்கு அது இருக்காது. எந்தவொரு காரணத்திற்காகவும் `பி.கே.சி` கணினியில் காணவில்லை என்றால், அதை மூலத்திலிருந்து உருவாக்காமல் அல்லது ** டோர்ட்ச் ** நிறுவப்பட்டிருக்காமல் விரைவாக தொடக்கவார் செய்ய முடியும்:

source: For fresh installations, the file `/usr/local/etc/pkg/repos/df-latest.conf.sample` is copied to `/usr/local/etc/pkg/repos/df-latest`. The files ending in the ".sample" extension are ignored; pkg(8) only reads files that end in ".conf" and it will read as many as it finds.
ta: புதிய நிறுவல்களுக்கு, `/usr/local/etc/pkg/repos/df-latest.conf.sample` கோப்பு`/usr/local/etc/pkg/repos/df-latest` க்கு நகலெடுக்கப்படுகிறது. ". மாதிரி" நீட்டிப்பில் முடிவடையும் கோப்புகள் புறக்கணிக்கப்படுகின்றன; பி.கே.சி (8) ".conf" இல் முடிவடையும் கோப்புகளை மட்டுமே படிக்கிறது, மேலும் அது கண்டுபிடிக்கும் பலவற்றைப் படிக்கும்.

source: Here we can choose to install the latest stable version (recommended):
ta: அண்மைக் கால நிலையான பதிப்பை நிறுவ இங்கே நாம் தேர்வு செய்யலாம் (பரிந்துரைக்கப்படுகிறது):

source: Here, it will be similar to what we have on a **FreeBSD** system, and we are going to use HTTPS to fetch our packages, and updates - so here we also need an extra package to help us out; `ca_root_nss`.
ta: இங்கே, இது ஒரு ** FreeBSD ** அமைப்பில் இருப்பதைப் போலவே இருக்கும், மேலும் எங்கள் தொகுப்புகள் மற்றும் புதுப்பிப்புகளைப் பெற HTTPS ஐப் பயன்படுத்தப் போகிறோம் - எனவே இங்கே எங்களுக்கு உதவ கூடுதல் தொகுப்பும் தேவை; `ca_root_nss`.

source: Or install an alpha release:
ta: அல்லது ஆல்பா வெளியீட்டை நிறுவவும்:

source: We can simply edit the **URL** used to point to the repositories on `/usr/local/etc/pkg/repos/df-latest` and that's it! Remember to use **pkg+https://** for Avalon.
ta: `/Usr/local/etc/pkg/repos/df-latest` என்ற களஞ்சியங்களை சுட்டிக்காட்ட பயன்படுத்தப்படும் ** முகவரி ** ஐ நாம் வெறுமனே திருத்தலாம், அவ்வளவுதான்! அவலோனுக்கு ** pkg+https: // ** பயன்படுத்த நினைவில் கொள்ளுங்கள்.

source: How to deploy an obfs4 bridge on DragonflyBSD
ta: டிராகன்ஃபிளைச்.டி.யில் ஒரு OBFS4 பாலத்தை எவ்வாறு பயன்படுத்துவது

source: ### 10. Final Notes
ta: ### 10. இறுதி குறிப்புகள்

source: ### 3. Install `tor`
ta: ### 3. `TOR` ஐ நிறுவவும்

source: ### 6. Disable SeLinux
ta: ### 6. செலினக்ச் முடக்கு

source: ### 7. Open Ports in Fedora firewall
ta: ### 7. ஃபெடோரா ஃபயர்வாலில் திறந்த துறைமுகங்கள்

source: ### 8. Restart Tor
ta: ### 8. டோர் மறுதொடக்கம் செய்யுங்கள்

source: ### 9. Monitor your logs
ta: ### 9. உங்கள் பதிவுகளை கண்காணிக்கவும்

source: After you did it for both ports, run:
ta: இரண்டு துறைமுகங்களுக்கும் நீங்கள் செய்த பிறகு, இயக்கவும்:

source: And change SELINUX=enforcing to SELINUX=permissive.
ta: மற்றும் selinux = selinux = அனுமதிக்கும்.

source: Check wether SeLinux is set to "Enforcing":
ta: செலினக்ச் "செயல்படுத்துதல்" என அமைக்கப்பட்டுள்ளதா என்பதை சரிபார்க்கவும்:

source: Configuring the Tor Project's Repository for Fedora consists basically on setting up `/etc/yum.repos.d/Tor.repo` with the following content:
ta: ஃபெடோராவிற்கான TOR திட்டத்தின் களஞ்சியத்தை உள்ளமைப்பது அடிப்படையில் `/etc/yum.repos.d/tor.repo` ஐ பின்வரும் உள்ளடக்கத்துடன் அமைப்பதில் உள்ளது:

source: Different from other Linux distributions, **Fedora** offers a [binary package](https://pkgs.org/download/obfs4) we can use. It's available since **Fedora 33**.
ta: பிற லினக்ச் விநியோகங்களிலிருந்து வேறுபட்டது, ** ஃபெடோரா ** ஒரு [பைனரி தொகுப்பு] (https://pkgs.org/download/obfs4) ஐ வழங்குகிறது. இது ** ஃபெடோரா 33 ** முதல் கிடைக்கிறது.

source: Follow the instructions to enable [automatic software updates](/relay/setup/guard/fedora/updates/) for your operating system.
ta: உங்கள் இயக்க முறைமைக்கு [தானியங்கி மென்பொருள் புதுப்பிப்புகள்] (/ரிலே/அமைவு/காவலர்/ஃபெடோரா/புதுப்பிப்புகள்/) இயக்க வழிமுறைகளைப் பின்பற்றவும்.

source: For more information about installing or building `lyrebird` from source, please refer to its [official documentation](https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/lyrebird/).
ta: மூலத்திலிருந்து `லைரெபேர்ட்` ஐ நிறுவுதல் அல்லது உருவாக்குவது பற்றிய கூடுதல் தகவலுக்கு, தயவுசெய்து அதன் [அதிகாரப்பூர்வ ஆவணங்கள்] (https://gitlab.torproject.org/tpo/anti-censorhip/pluggable-transports/lyrebird/) ஐப் பார்க்கவும்.

source: For the obfs4 and ORPort which you have chosen in the torrc file:
ta: டோர்க் கோப்பில் நீங்கள் தேர்ந்தெடுத்த OBFS4 மற்றும் OBPORT க்கு:

source: If set to "Enforcing", change Status to "Permissive":
ta: "செயல்படுத்துதல்" என அமைக்கப்பட்டால், அந்தச்தை "அனுமதிக்கப்பட்ட" என மாற்றவும்:

source: More information about it can be found [here](https://support.torproject.org/rpm/).
ta: அதைப் பற்றிய கூடுதல் தகவல்களை [இங்கே] (https://support.torproject.org/rpm/) காணலாம்.

source: Once you are set configuring the Tor repository, you are now able to install the package:
ta: டோர் களஞ்சியத்தை உள்ளமைத்ததும், இப்போது நீங்கள் தொகுப்பை நிறுவ முடியும்:

source: The package is called `obfs4` and this is all you need to install it:
ta: தொகுப்பு `OBFS4` என்று அழைக்கப்படுகிறது, இதை நீங்கள் நிறுவ வேண்டியது இதுதான்:

source: To make the changes permanent:
ta: மாற்றங்களை நிரந்தரமாக்க:

source: How to deploy an obfs4 bridge on Fedora
ta: ஃபெடோராவில் OBFS4 பாலத்தை எவ்வாறு பயன்படுத்துவது

source: ### 5. Edit your Tor config file, usually located at `/usr/local/etc/tor` and replace its content with:
ta: ### 5. உங்கள் டோர் கட்டமைப்பு கோப்பைத் திருத்தவும், வழக்கமாக `/usr/local/etc/tor` இல் அமைந்துள்ளது மற்றும் அதன் உள்ளடக்கத்தை மாற்றவும்:

source: ### 6. Ensure that the `random_id` sysctl setting is enabled
ta: ### 6. `ரேண்டம்_ஐடி` சி.எச்.சி.டி.எல் அமைப்பு இயக்கப்பட்டிருப்பதை உறுதிசெய்க

source: ### 7. Start the tor daemon and make sure it starts at boot
ta: ### 7. டோர் டீமனைத் தொடங்கி, அது துவக்கத்தில் தொடங்குவதை உறுதிசெய்க

source: * Are you using FreeBSD's firewall with a "default deny" policy? If so, make sure that your obfs4proxy can talk to your Tor process over the loopback interface. Don't forget to whitelist Tor's `ExtORPort`.
ta: * நீங்கள் "இயல்புநிலை மறுப்பு" கொள்கையுடன் FreeBSD இன் ஃபயர்வாலை பயன்படுத்துகிறீர்களா? அப்படியானால், உங்கள் OBFS4Proxy உங்கள் TOR செயல்முறையுடன் லூப் பேக் இடைமுகத்தில் பேச முடியும் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். டாரின் `எக்ச்ட்ராக்போர்ட்` அனுமதிப்பிடிப்பதை மறக்காதீர்கள்.

source: Creating the new directory:
ta: புதிய கோப்பகத்தை உருவாக்குதல்:

source: Follow the instructions to enable [automatic software updates](../../guard/freebsd/updates/) for your operating system.
ta: உங்கள் இயக்க முறைமைக்கு [தானியங்கி மென்பொருள் புதுப்பிப்புகளை] (../../ காவலர்/FreeBSD/புதுப்பிப்புகள்/) இயக்க வழிமுறைகளைப் பின்பற்றவும்.

source: Installing the `ca_root_nss` package:
ta: `Ca_root_nss` தொகுப்பை நிறுவுதல்:

source: One additional step is to prefer using HTTPS to fetch our packages, and updates - so here we also need an extra package to help us out (ca_root_nss).
ta: ஒரு கூடுதல் படி என்னவென்றால், எங்கள் தொகுப்புகளைப் பெற HTTP களைப் பயன்படுத்த விரும்புவது மற்றும் புதுப்பிப்புகளை விரும்புவது - எனவே இங்கே எங்களுக்கு உதவ கூடுதல் தொகுப்பும் தேவை (Ca_root_nss).

source: That means we do not have any packages installed, or even the `pkg` packages manager itself (there's no `sudo` available - we are running commands as root).
ta: அதாவது எங்களிடம் எந்த தொகுப்புகளும் நிறுவப்படவில்லை, அல்லது `பி.கே.சி` தொகுப்புகள் மேலாளரும் கூட இல்லை (` சூடோ` கிடைக்கவில்லை - நாங்கள் கட்டளைகளை ரூட்டாக இயக்குகிறோம்).

source: This guide assumes we have already a base installation of FreeBSD running, and only the base system.
ta: இந்த வழிகாட்டி ஏற்கனவே FreeBSD இயக்கத்தின் அடிப்படை நிறுவலைக் கொண்டுள்ளது, மேலும் அடிப்படை அமைப்பு மட்டுமே.

source: This is how the new configuration file `/usr/local/etc/pkg/repos/FreeBSD.conf` must look like:
ta: புதிய உள்ளமைவு கோப்பு `/usr/local/etc/pkg/repos/freebsd.conf` எப்படி இருக்க வேண்டும்:

source: To bootstrap and install `pkg` we should run the following command:
ta: தொடக்கவார் மற்றும் `பி.கே.சி` ஐ நிறுவ நாங்கள் பின்வரும் கட்டளையை இயக்க வேண்டும்:

source: To confirm your bridge is running with no issues, you should see something like this in `/var/log/tor/notices.log`:
ta: உங்கள் பாலம் எந்த சிக்கலும் இல்லாமல் இயங்குகிறது என்பதை உறுதிப்படுத்த, இதுபோன்ற ஒன்றை `/var/log/tor/அறிவிப்புகளில் பார்க்க வேண்டும். Log`:

source: To follow upstream updates in a "faster way" we recommend changing the 'quarterly' branch used by `pkg` to its 'latest' branch.
ta: "வேகமான வழியில்" மேலோடை புதுப்பிப்புகளைப் பின்தொடர, `பி.கே.சி` பயன்படுத்தும் 'காலாண்டு' கிளையை அதன் 'அண்மைக் கால' கிளைக்கு மாற்ற பரிந்துரைக்கிறோம்.

source: We are keeping the original setting used by `pkg` but setting a new one that will override it. So we set up a new directory, and then create a configuration file to override what we need. This configuration file will be `/usr/local/etc/pkg/repos/FreeBSD.conf`.
ta: `பி.கே.சி` பயன்படுத்தும் அசல் அமைப்பை நாங்கள் வைத்திருக்கிறோம், ஆனால் அதை மேலெழுதும் புதிய ஒன்றை அமைத்துக்கொள்கிறோம். எனவே நாங்கள் ஒரு புதிய கோப்பகத்தை அமைத்து, பின்னர் நமக்குத் தேவையானதை மீற ஒரு உள்ளமைவு கோப்பை உருவாக்குகிறோம். இந்த உள்ளமைவு கோப்பு `/usr/local/etc/pkg/repos/freebsd.conf` ஆக இருக்கும்.

source: You can choose to install the stable version (recommended):
ta: நிலையான பதிப்பை நிறுவ நீங்கள் தேர்வு செய்யலாம் (பரிந்துரைக்கப்படுகிறது):

source: How to deploy an obfs4 bridge on FreeBSD
ta: FreeBSD இல் OBFS4 பாலத்தை எவ்வாறு பயன்படுத்துவது

source: ### 2. Setup `pkg_add`
ta: ### 2. அமைவு `pkg_add`

source: ### 5. Edit your Tor config file, usually located at `/usr/pkg/etc/tor/torrc` and replace its content with:
ta: ### 5. வழக்கமாக `/usr/pkg/etc/tor/torrc` இல் அமைந்துள்ள உங்கள் TOR கட்டமைப்பு கோப்பைத் திருத்தவும், அதன் உள்ளடக்கத்தை மாற்றவும்:

source: If your bridge is now running, check out the [post-install notes](../../post-install/).
ta: உங்கள் பாலம் இப்போது இயங்கினால், [பிந்தைய நிறுவல் குறிப்புகள்] (../../ போச்ட்-இன்ச்டால்/) ஐப் பாருங்கள்.

source: Modern versions of the NetBSD operating system can be set to use `pkgin`, which is a piece of software aimed to be like `apt` or `yum` for managing pkgsrc binary packages. We are not convering its setup here, and opt to use plain `pkg_add` instead.
ta: NETBSD இயக்க முறைமையின் நவீன பதிப்புகள் `pkgin` ஐப் பயன்படுத்த அமைக்கலாம், இது PKGSRC பைனரி தொகுப்புகளை நிர்வகிப்பதற்காக` APT` அல்லது `yum` போன்றதாக இருக்க வேண்டும் என்ற நோக்கில் மென்பொருளின் ஒரு பகுதியாகும். நாங்கள் இங்கே அதன் அமைப்பை மாற்றவில்லை, அதற்கு பதிலாக வெற்று `pkg_add` ஐப் பயன்படுத்தத் தேர்வு செய்கிறோம்.

source: How to deploy an obfs4 bridge on NetBSD
ta: Netbsd இல் OBFS4 பாலத்தை எவ்வாறு பயன்படுத்துவது

source: NetBSD
ta: நெட்.பி.எச்.டி.

source: ### 2. Install Tor
ta: ### 2. டோர் நிறுவவும்

source: ### 3. Install obfs4proxy
ta: ### 3. OBFS4Proxy ஐ நிறுவவும்

source: ### 5. Change `openfiles-max` and `maxfiles`
ta: ### 5. `OpenFiles-max` மற்றும்` MaxFiles` ஐ மாற்றவும்

source: ### 7. Monitor your logs (usually in your syslog)
ta: ### 7. உங்கள் பதிவுகளை கண்காணிக்கவும் (வழக்கமாக உங்கள் சிச்லாக்)

source: ##### 2.1. Recommended steps to install Tor
ta: ##### 2.1. TOR ஐ நிறுவ பரிந்துரைக்கப்பட்ட படிகள்

source: Append the following section to `/etc/login.conf`:
ta: பின்வரும் பகுதியை `/etc/login.conf` உடன் சேர்க்கவும்:

source: By default, OpenBSD maintains a rather low limit on the maximum number of open files for a process. For a daemon such as Tor's, that opens a connection to each and every other relay (currently around 7000 relays), these limits should be raised.
ta: இயல்பாக, OpenBSD ஒரு செயல்முறைக்கு அதிகபட்ச திறந்த கோப்புகளின் குறைந்த வரம்பை பராமரிக்கிறது. டோர்ச் போன்ற ஒரு டீமனுக்கு, இது ஒவ்வொரு ரிலே (தற்போது சுமார் 7000 ரிலேக்கள்) ஒரு இணைப்பைத் திறக்கும், இந்த வரம்புகள் உயர்த்தப்பட வேண்டும்.

source: Follow the instructions to enable [automatic software updates](../../guard/openbsd/updates/) for your operating system.
ta: உங்கள் இயக்க முறைமைக்கு [தானியங்கி மென்பொருள் புதுப்பிப்புகளை] (../../ காவலர்/ஓபன் பி.எச்.டி/புதுப்பிப்புகள்/) இயக்க வழிமுறைகளைப் பின்பற்றவும்.

source: Here is how you proceed with these steps:
ta: இந்த படிகளை நீங்கள் எவ்வாறு தொடர்கிறீர்கள் என்பது இங்கே:

source: If you want to install a newer version of the `tor` package, you can use M:Tier's binary packages:
ta: `டோர்` தொகுப்பின் புதிய பதிப்பை நிறுவ விரும்பினால், நீங்கள் எம்: டைரின் பைனரி தொகுப்புகளைப் பயன்படுத்தலாம்:

source: Increase it from the default of 7030 to 16000:
ta: 7030 முதல் 16000 வரை இயல்புநிலையிலிருந்து அதிகரிக்கவும்:

source: OpenBSD also stores a kernel-level file descriptor limit in the sysctl variable `kern.maxfiles`.
ta: OpenBSD SYSCTL மாறி `kern.maxfiles` இல் ஒரு கர்னல்-நிலை கோப்பு விவரிப்பான் வரம்பையும் சேமிக்கிறது.

source: Right after fetching `openup` you can run it to sync M:Tier's repository and update your packages; it's an alternative to `pkg_add -u`.
ta: `ஓபன்அப்` பெற்ற உடனேயே நீங்கள் அதை ஒத்திசைவு எம்: டைரின் களஞ்சியத்தை இயக்கலாம் மற்றும் உங்கள் தொகுப்புகளைப் புதுப்பிக்கலாம்; இது `pkg_add -u` க்கு மாற்றாக இருக்கிறது.

source: To confirm your bridge is running with no issues, you should see something like this:
ta: உங்கள் பாலம் எந்த பிரச்சனையும் இல்லாமல் இயங்குகிறது என்பதை உறுதிப்படுத்த, நீங்கள் இதுபோன்ற ஒன்றைக் காண வேண்டும்:

source: How to deploy an obfs4 bridge on OpenBSD
ta: OpenBSD இல் OBFS4 பாலத்தை எவ்வாறு பயன்படுத்துவது

source: ### 3. Build lyrebird (obfs4proxy) and move it into place
ta: ### 3. லைரெபேர்டை (OBFS4Proxy) உருவாக்குங்கள்

source: ### 4. Edit your Tor config file, usually located at `/usr/local/etc/tor` and replace its content with:
ta: ### 4. உங்கள் டோர் கட்டமைப்பு கோப்பைத் திருத்தவும், வழக்கமாக `/usr/local/etc/tor` இல் அமைந்துள்ளது மற்றும் அதன் உள்ளடக்கத்தை மாற்றவும்:

source: ### 5. Restart tor
ta: ### 5. டோர் மறுதொடக்கம் செய்யுங்கள்

source: ### 6. Monitor your logs (usually in your syslog)
ta: ### 6. உங்கள் பதிவுகளை கண்காணிக்கவும் (வழக்கமாக உங்கள் சிச்லாக்)
