Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: Tor helps me stay outside of filter bubbles and protects me from being tracked.
ta: டோர் எனக்கு வடிகட்டி குமிழ்களுக்கு வெளியே இருக்க உதவுகிறது மற்றும் என்னைக் கண்காணிப்பதில் இருந்து பாதுகாக்கிறது.

source: Milena
ta: மிலேனா

source: I am in the United States. Tor has helped me get around my very strict school ISP when researching sensitive topics such as lgbt resources, as I have not come out as trans yet. My school seemed to block every VPN I attempted to use, so I tried tor, and it worked flawlessly. My life would be a mess without it.
ta: நான் அமெரிக்காவில் இருக்கிறேன். எல்சிபிடி வளங்கள் போன்ற முக்கியமான தலைப்புகளை ஆராய்ச்சி செய்யும் போது எனது மிகவும் கண்டிப்பான பள்ளி ஐஎச்பியைச் சுற்றி வர டோர் எனக்கு உதவியுள்ளார், ஏனெனில் நான் இன்னும் டிரான்சாக வெளியே வரவில்லை. நான் பயன்படுத்த முயற்சித்த ஒவ்வொரு VPN ஐ எனது பள்ளி தடுப்பதாகத் தோன்றியது, எனவே நான் டோர் முயற்சித்தேன், அது குறைபாடற்ற முறையில் வேலை செய்தது. என் வாழ்க்கை அது இல்லாமல் ஒரு குழப்பமாக இருக்கும்.

source: I am in the United States. Tor has helped me get around my very strict school ISP when researching sensitive topics such as lgbt resources.
ta: நான் அமெரிக்காவில் இருக்கிறேன். எல்சிபிடி வளங்கள் போன்ற முக்கியமான தலைப்புகளை ஆராய்ச்சி செய்யும் போது எனது மிகவும் கண்டிப்பான பள்ளி ஐஎச்பியைச் சுற்றி வர டோர் எனக்கு உதவியுள்ளார்.

source: Morgan
ta: மோர்கன்

source: All transactions must use encryption: e-mails, messages, hard drives, individual files, require encryption.
ta: அனைத்து பரிவர்த்தனைகளும் குறியாக்கத்தைப் பயன்படுத்த வேண்டும்: மின்னஞ்சல், செய்தி, ஆர்ட் டிரைவ்கள், தனிப்பட்ட கோப்புகள், குறியாக்கம் தேவை.

source: Encryption is important because it protects the work of those who hold to account the ones in power.
ta: குறியாக்கமானது முக்கியமானது, ஏனெனில் இது அதிகாரத்தில் இருப்பவர்களைக் கணக்கிடுவோரின் வேலையைப் பாதுகாக்கிறது.

source: Journalism isn't free and fair.
ta: செய்தித் தாள் இலவசம் மற்றும் நியாயமானது அல்ல.

source: You are free to say what you feel at the of risk job loss and prison for expressing anything contrary to the wishes of whoever is in power of your jurisdiction - you have that right to say it and suffer.
ta: உங்கள் அதிகார வரம்பின் ஆட்சியில் இருப்பவரின் விருப்பத்திற்கு முரணான எதையும் வெளிப்படுத்தியதற்காக இடர் வேலை இழப்பு மற்றும் சிறைச்சாலையில் நீங்கள் என்ன நினைக்கிறீர்கள் என்று நீங்கள் சொல்ல சுதந்திரமாக இருக்கிறீர்கள் - அதைச் சொல்லவும் துன்பப்படவும் உங்களுக்கு அந்த உரிமை உள்ளது.

source: Journalism isn't free and fair. You are free to say what you feel at the risk of job loss and prison for expressing anything contrary to the wishes of whoever is in power of your jurisdiction - you have that right to say it and suffer.
ta: செய்தித் தாள் இலவசம் மற்றும் நியாயமானது அல்ல. உங்கள் அதிகார வரம்பின் ஆட்சியில் இருப்பவரின் விருப்பத்திற்கு முரணான எதையும் வெளிப்படுத்தியதற்காக வேலை இழப்பு மற்றும் சிறை அபாயத்தில் நீங்கள் என்ன உணர்கிறீர்கள் என்று நீங்கள் சுதந்திரமாக இருக்கிறீர்கள் - அதைச் சொல்லி துன்பப்படுவதற்கு உங்களுக்கு அந்த உரிமை உள்ளது.

source: Nia
ta: நியா

source: I live in Iran and the police state is vigorously spying on people.
ta: நான் ஈரானில் வசிக்கிறேன், பொலிச் அரசு மக்கள் மீது தீவிரமாக உளவு பார்க்கிறது.

source: Without Tor we would be shut off from the world, no one hearing our voice.
ta: டோர் இல்லாமல் நாம் உலகத்திலிருந்து நிறுத்தப்படுவோம், யாரும் எங்கள் குரலைக் கேட்க மாட்டார்கள்.

source: I live in Iran and the police state is vigorously spying on people. Without Tor we would be shut off from the world, no one hearing our voice.
ta: நான் ஈரானில் வசிக்கிறேன், பொலிச் அரசு மக்கள் மீது தீவிரமாக உளவு பார்க்கிறது. டோர் இல்லாமல் நாம் உலகத்திலிருந்து நிறுத்தப்படுவோம், யாரும் எங்கள் குரலைக் கேட்க மாட்டார்கள்.

source: Noor
ta: நூர்

source: I think our data is being manipulated, used against to shape our worldview...my aim is to avoid 'misinformation' and stop online bullying.
ta: எங்கள் தரவு கையாளப்படுகிறது, எங்கள் உலகக் கண்ணோட்டத்தை வடிவமைக்கப் பயன்படுத்தப்படுகிறது என்று நான் நினைக்கிறேன் ... எனது நோக்கம் 'தவறான தகவல்களை' தவிர்ப்பது மற்றும் நிகழ்நிலை கொடுமைப்படுத்துதலை நிறுத்துவதாகும்.

source: Oliver
ta: ஆலிவர்

source: I live in the UK.
ta: நான் இங்கிலாந்தில் வசிக்கிறேன்.

source: I use Tor on a daily basis, and also use a paid-for VPN service when not using Tor.
ta: நான் நாள்தோறும் அடிப்படையில் TOR ஐப் பயன்படுத்துகிறேன், மேலும் TOR ஐப் பயன்படுத்தாதபோது செலுத்தப்பட்ட VPN சேவையையும் பயன்படுத்துகிறேன்.

source: I was incredibly disturbed by the Edward Snowden revelations about NSA mass surveillance.
ta: என்எச்ஏ வெகுசன கண்காணிப்பு பற்றிய எட்வர்ட் ச்னோவ்டென் வெளிப்பாடுகளால் நான் நம்பமுடியாத அளவிற்கு கலக்கமடைந்தேன்.

source: The UK Government's own legislation of DRIPA and the Investigatory Powers Act made it even more necessary in my opinion to protect my browsing history from the government's intrusive snooping.
ta: இங்கிலாந்தின் அரசாங்கத்தின் சொந்த சொட்டு சொட்டா சட்டம் மற்றும் புலனாய்வு அதிகாரச் சட்டம் எனது உலாவல் வரலாற்றை அரசாங்கத்தின் ஊடுருவும் ச்னூப்பிங் மூலம் பாதுகாப்பது எனது கருத்தில் அதை இன்னும் அவசியமாக்கியது.

source: This led me to start using the Tor browser.
ta: இது டோர் உலாவியைப் பயன்படுத்தத் தொடங்க என்னை வழிநடத்தியது.

source: I live in the UK. I was incredibly disturbed by the Edward Snowden revelations about NSA mass surveillance. This led me to start using the Tor browser.
ta: நான் இங்கிலாந்தில் வசிக்கிறேன். என்எச்ஏ வெகுசன கண்காணிப்பு பற்றிய எட்வர்ட் ச்னோவ்டென் வெளிப்பாடுகளால் நான் நம்பமுடியாத அளவிற்கு கலக்கமடைந்தேன். இது டோர் உலாவியைப் பயன்படுத்தத் தொடங்க என்னை வழிநடத்தியது.

source: Pittiulaaq
ta: சிறந்த

source: Even there are sites that use services and resources that are also blocked for my country.
ta: சேவைகள் மற்றும் வளங்களைப் பயன்படுத்தும் தளங்கள் கூட எனது நாட்டிற்குத் தடுக்கப்படுகின்றன.

source: I am a software developer and programming teacher and I live in Cuba.
ta: நான் ஒரு மென்பொருள் உருவாக்குநர் மற்றும் நிரலாக்க ஆசிரியர், நான் கியூபாவில் வசிக்கிறேன்.

source: There are many sites with information that I need to be able to do my work that are blocked due to absurd laws.
ta: அபத்தமான சட்டங்கள் காரணமாக தடுக்கப்பட்ட எனது வேலையைச் செய்ய வேண்டிய தகவல்களுடன் பல தளங்கள் உள்ளன.

source: Plinio
ta: பிளினி

source: Big corporations and companies have no morals and don't hesitate to share personal information for profit.
ta: பெரிய நிறுவனங்களுக்கும் அலுவகங்களுக்கும் ஒழுக்கங்கள் இல்லை, லாபத்திற்காகத் தனிப்பட்ட தகவல்களைப் பகிர்ந்து கொள்ள தயங்க மாட்டார்கள்.

source: Even basic entertainment apps collect everything they can from our devices and sell that data to others.
ta: அடிப்படை பொழுதுபோக்கு பயன்பாடுகள் கூட எங்கள் சாதனங்களிலிருந்து தங்களால் இயன்ற அனைத்தையும் சேகரித்து அந்த தரவை மற்றவர்களுக்கு விற்கின்றன.

source: Our data was shared without our permission from sources like our healthcare provider and employer.
ta: எங்கள் சுகாதார வழங்குநர் மற்றும் முதலாளி போன்ற ஆதாரங்களிலிருந்து எங்கள் அனுமதியின்றி எங்கள் தரவு பகிரப்பட்டது.

source: Since all our devices know everything about us, having encrypted connections is one of the few ways that we can at least prevent the data that is already being stolen from being stolen again during its transfer.
ta: எங்கள் எல்லா சாதனங்களும் நம்மைப் பற்றி எல்லாவற்றையும் அறிந்திருப்பதால், மறைகுறியாக்கப்பட்ட இணைப்புகளைக் கொண்டிருப்பது சில வழிகளில் ஒன்றாகும், இது ஏற்கனவே திருடப்பட்ட தரவை அதன் பரிமாற்றத்தின் போது மீண்டும் திருடப்படுவதைத் தடுக்கலாம்.

source: Big corporations and companies have no morals and don't hesitate to share personal information for profit. Our data was shared without our permission from sources like our healthcare provider and employer.
ta: பெரிய நிறுவனங்களுக்கும் அலுவகங்களுக்கும் ஒழுக்கங்கள் இல்லை, லாபத்திற்காகத் தனிப்பட்ட தகவல்களைப் பகிர்ந்து கொள்ள தயங்க வேண்டாம். எங்கள் சுகாதார வழங்குநர் மற்றும் முதலாளி போன்ற ஆதாரங்களிலிருந்து எங்கள் அனுமதியின்றி எங்கள் தரவு பகிரப்பட்டது.

source: Ren
ta: ரென்

source: Although attitudes are changing, it might bar me from getting a job.
ta: அணுகுமுறைகள் மாறிக்கொண்டிருந்தாலும், அது ஒரு வேலையைப் பெறுவதைத் தூண்டக்கூடும்.

source: The knowledge that I'm queer might lead a mob to my location (with potentially-deadly consequences) and ostracism from my family (on whom I'm currently economically dependent).
ta: நான் வினோதமாக இருக்கிறேன் என்ற அறிவு எனது இருப்பிடத்திற்கு (முட்டாள்தனமான விளைவுகளுடன்) மற்றும் எனது குடும்பத்தினரிடமிருந்து (நான் தற்போது பொருளாதார ரீதியாக சார்ந்து இருக்கிறேன்) புறக்கணிப்பு) ஒரு கும்பலை இட்டுச் செல்லக்கூடும்.

source: To protect my online activities, I need strong computer security, but I can't make it *too* obvious, and Tor is easy plug-and-play that does not draw suspicion.
ta: எனது நிகழ்நிலை செயல்பாடுகளைப் பாதுகாக்க, எனக்கு வலுவான கணினி பாதுகாப்பு தேவை, ஆனால் என்னால் அதை * மிகவும் * வெளிப்படையாக மாற்ற முடியாது, மேலும் டோர் என்பது சந்தேகத்தை ஈர்க்காத எளிதான செருகுநிரல் மற்றும் விளையாட்டு.

source: Riley
ta: ரிலே

source: I use Tor for social media posting on sites that restrict free speech.
ta: சுதந்திரமான பேச்சைக் கட்டுப்படுத்தும் தளங்களில் சமூக ஊடக இடுகைக்கு நான் டோரைப் பயன்படுத்துகிறேன்.

source: Encryption is privacy, as simple as that.
ta: குறியாக்கம் என்பது தனியுரிமை, அது போன்ற எளிது.

source: Privacy should be the default, giving away information should be the exception.
ta: தனியுரிமை இயல்புநிலையாக இருக்க வேண்டும், தகவல்களை வழங்குவது விதிவிலக்காக இருக்க வேண்டும்.

source: The only real question we should ask ourselves is "do I have a good reason to share this personal information?"
ta: நாம் நம்மை நாமே கேட்டுக்கொள்ள வேண்டிய ஒரே உண்மையான கேள்வி என்னவென்றால், "இந்த தனிப்பட்ட தகவல்களைப் பகிர்ந்து கொள்ள எனக்கு நல்ல காரணம் இருக்கிறதா?"

source: This way of thinking is extremely unhealthy.
ta: இந்த சிந்தனை முறை மிகவும் ஆரோக்கியமற்றது.

source: We should never wonder "do I have something to hide, do I have a reason to not give this information?"
ta: "எனக்கு மறைக்க ஏதாவது இருக்கிறதா, இந்த தகவலைக் கொடுக்க எனக்கு ஒரு காரணம் இருக்கிறதா?"

source: Encryption is privacy, as simple as that. Privacy should be the default, giving away information should be the exception.
ta: குறியாக்கம் என்பது தனியுரிமை, அது போன்ற எளிது. தனியுரிமை இயல்புநிலையாக இருக்க வேண்டும், தகவல்களை வழங்குவது விதிவிலக்காக இருக்க வேண்டும்.

source: Sachin
ta: சச்சின்

source: I educated myself free from state propaganda.
ta: நான் மாநில பிரச்சாரத்திலிருந்து விடுபட்டேன்.

source: It got me out of the social bubble and I was able to get insides, ideas and views from many different social groups.
ta: இது சமூக குமிழிலிருந்து என்னை வெளியேற்றியது, மேலும் பல சமூகக் குழுக்களின் சிந்தனைகள் மற்றும் பார்வைகளை என்னால் உள்ளே செல்ல முடிந்தது.

source: Tor helped me very much.
ta: டோர் எனக்கு மிகவும் உதவினார்.

source: Tor helped me very much. I educated myself free from state propaganda.
ta: டோர் எனக்கு மிகவும் உதவினார். நான் மாநில பிரச்சாரத்திலிருந்து விடுபட்டேன்.

source: Sofia
ta: சோஃபியா

source: Being a dissident is hard enough, privacy is already heavily curtailed, so anonymized communication is a godsend.
ta: ஒரு மனக்குறை அடைவது போதுமானது, தனியுரிமை ஏற்கனவே பெரிதும் குறைக்கப்பட்டுள்ளது, எனவே அநாமதேய தொடர்பு என்பது ஒரு தெய்வபக்தி.

source: I later tried to obfuscate my identity, but I found that my government has surprisingly broad powers to track down dissidents.
ta: நான் பின்னர் எனது அடையாளத்தை தெளிவுபடுத்த முயற்சித்தேன், ஆனால் எனது அரசாங்கத்திற்கு அதிருப்தியாளர்களைக் கண்டுபிடிப்பதற்கு வியக்கத்தக்க பரந்த சக்திகள் இருப்பதைக் கண்டேன்.

source: I'm a political activist, part of a semi-criminalized minority.
ta: நான் ஒரு அரசியல் ஆர்வலர், அரை குற்றவாளி சிறுபான்மையினரின் ஒரு பகுதி.

source: In my younger years I entered the public debate openly, and as a result got harassed by government agencies.
ta: எனது இளைய ஆண்டுகளில் நான் பொது விவாதத்தில் வெளிப்படையாக நுழைந்தேன், இதன் விளைவாக அரசு நிறுவனங்களால் துன்புறுத்தப்பட்டது.

source: Only by using anonymizing means, among which Tor is key, can I get my message out without having police come to "check my papers" in the middle of the night.
ta: அநாமதேய வழிமுறைகளைப் பயன்படுத்துவதன் மூலம் மட்டுமே, அவற்றில் TOR முக்கியமானது, நள்ளிரவில் "எனது ஆவணங்களை சரிபார்க்க" பொலிச் வராமல் எனது செய்தியை வெளியேற்ற முடியுமா?

source: Tor allows me freedom to publish my message to the world without being personally persecuted for it.
ta: எனது செய்தியை தனிப்பட்ட முறையில் துன்புறுத்தாமல் உலகிற்கு வெளியிட டோர் எனக்கு விடுதலை அனுமதிக்கிறது.

source: Stanislava
ta: ச்டானிச்லாவ்

source: During political unrest while the government tightens their grip on other censorship circumvention alternatives, Tor with obfuscation plugins remain the only solution.
ta: அரசியல் அமைதியின்மையின் போது, மற்ற தணிக்கை சுற்றறிக்கை மாற்றுகளில் அரசாங்கம் தங்கள் பிடியை இறுக்கிக் கொண்டிருக்கும்போது, தெளிவற்ற செருகுநிரல்களுடன் டோர் ஒரே தீர்வாகவே உள்ளது.

source: I live in Iran and I have been using Tor for censorship circumvention.
ta: நான் ஈரானில் வசிக்கிறேன், தணிக்கை சுற்றறிக்கைக்கு நான் டோரைப் பயன்படுத்துகிறேன்.

source: It made it possible to access information on Youtube, Twitter, Blogger and countless other sites.
ta: யூடியூப், ட்விட்டர், பதிவர் மற்றும் எண்ணற்ற பிற தளங்களில் தகவல்களை அணுக இது சாத்தியமானது.

source: Tor changed my personal life in many ways.
ta: டோர் எனது தனிப்பட்ட வாழ்க்கையை பல வழிகளில் மாற்றினார்.

source: I'm using Tor for accessing the internet freely. I need it because in my country internet is censored.
ta: இணையத்தை சுதந்திரமாக அணுக நான் TOR ஐப் பயன்படுத்துகிறேன். எனது நாட்டில் இணையம் தணிக்கை செய்யப்படுவதால் எனக்கு அது தேவை.

source: If the Tor network was not available some day, I'm sure I will be stopped behind the www-door.
ta: டோர் பிணையம் ஒரு நாள் கிடைக்கவில்லை என்றால், நான் WWW-கதவுக்கு பின்னால் நிறுத்தப்படுவேன் என்று நான் நம்புகிறேன்.

source: Tor does not have any alternatives and VPN services are not working properly in my country or are not free and I don't have any payment methods for paying the cost of them.
ta: டோர் எந்த மாற்றுகளும் இல்லை மற்றும் வி.பி.என் சேவைகள் எனது நாட்டில் சரியாக செயல்படவில்லை அல்லது இலவசமாக இல்லை, அவற்றின் செலவை செலுத்துவதற்கான கட்டண முறைகள் என்னிடம் இல்லை.

source: Tor is free and multi platform. Im using it on [my] Android phone, on my Macbook and Windows desktop everywhere.
ta: டோர் இலவச மற்றும் பல தளம். எனது மேக்புக் மற்றும் சாளரங்கள் டெச்க்டாப்பில் எல்லா இடங்களிலும் [எனது] ஆண்ட்ராய்டு தொலைபேசியில் இதைப் பயன்படுத்துகிறேன்.

source: Sunil
ta: சுனில்

source: I am proud of you guys defending our freedom and try to support you as much as I can.
ta: எங்கள் சுதந்திரத்தை பாதுகாப்பதில் நீங்கள் பெருமைப்படுகிறேன், என்னால் முடிந்தவரை உங்களை ஆதரிக்க முயற்சிக்கிறேன்.

source: Tor Browser is the last defense line of the free internet.
ta: டோர் உலாவி இலவச இணையத்தின் கடைசி பாதுகாப்பு வரி.

source: Tadija
ta: தடிசா

source: The biggest threat from this I see is not actively from the government themselves, who are simply misguided, but any access from third party black hat hackers who could get access to the database and themselves use it maliciously.
ta: இதிலிருந்து மிகப்பெரிய அச்சுறுத்தல் அரசாங்கத்திடமிருந்து தீவிரமாக இல்லை, அவர்கள் வெறுமனே தவறாக வழிநடத்தப்படுகிறார்கள், ஆனால் மூன்றாம் தரப்பு பிளாக் தொப்பி ஏக்கர்களிடமிருந்து எந்தவொரு அணுகலும் தரவுத்தளத்தை அணுகலாம், மேலும் அதை தீங்கிழைக்கும்.

source: The risks I face from not using Tor are not immediate, and mostly focus around the government consolidating information on it's population and the potential for this to go wrong.
ta: டாரைப் பயன்படுத்தாததால் நான் எதிர்கொள்ளும் அபாயங்கள் உடனடியாக இல்லை, மேலும் பெரும்பாலும் அதன் மக்கள் தொகை குறித்த தகவல்களை ஒருங்கிணைக்கும் அரசாங்கத்தைச் சுற்றி கவனம் செலுத்துகின்றன, மேலும் இது தவறாக நடக்கக்கூடிய சாத்தியக்கூறுகள்.

source: Taimo
ta: ஆலை

source: I have been using Tor for 2 years.
ta: நான் 2 ஆண்டுகளாக டோரைப் பயன்படுத்துகிறேன்.

source: I was concerned about [my] privacy after hearing about Yahoo mail and Gmail handing over private email to government officials.
ta: யாகூ மெயில் மற்றும் சிமெயில் அரசாங்க அதிகாரிகளுக்கு தனியார் மின்னஞ்சலை ஒப்படைப்பது குறித்து கேள்விப்பட்ட பிறகு [எனது] தனியுரிமை குறித்து நான் கவலைப்படுகிறேன்.

source: It helped my peace of mind knowing that I have some privacy left.
ta: எனக்கு சில தனியுரிமை உள்ளது என்பதை அறிந்து இது என் மன அமைதிக்கு உதவியது.

source: I was concerned about [my] privacy after hearing about yahoo mail and gmail handing over private email to government officials.
ta: யாகூ மெயில் மற்றும் சிமெயில் அரசாங்க அதிகாரிகளுக்கு தனியார் மின்னஞ்சலை ஒப்படைப்பது குறித்து கேள்விப்பட்ட பிறகு [எனது] தனியுரிமை குறித்து நான் கவலைப்படுகிறேன்.

source: Taylor
ta: டெய்லர்

source: Encryption is like putting a letter in an envelope before posting it: It’s common sense.
ta: குறியாக்கம் என்பது ஒரு கடிதத்தை இடுகையிடுவதற்கு முன்பு ஒரு உறைக்குள் வைப்பது போன்றது: இது பொது அறிவு.

source: Tyler
ta: டைலர்

source: I use Tor and other encrypted communications methods to communicate with journalists and human rights advocates.
ta: பத்திரிகையாளர்கள் மற்றும் மனித உரிமை வக்கீல்களுடன் தொடர்பு கொள்ள நான் டோர் மற்றும் பிற மறைகுறியாக்கப்பட்ட தகவல்தொடர்பு முறைகளைப் பயன்படுத்துகிறேன்.

source: Velia
ta: வெலியா

source: Encryption is essential for secure internet use. If communication services are not encrypted when discussing politics, it will be difficult to have a free discussion because people will be worried that government agencies may be eavesdropping.
ta: பாதுகாப்பான இணைய பயன்பாட்டிற்கு குறியாக்கம் தேவை. அரசியலைப் பற்றி விவாதிக்கும்போது தகவல்தொடர்பு சேவைகள் குறியாக்கம் செய்யப்படாவிட்டால், ஒரு இலவச கலந்துரையாடலை நடத்துவது கடினம், ஏனென்றால் அரசாங்க நிறுவனங்கள் செவிமடுப்பது என்று மக்கள் கவலைப்படுவார்கள்.

source: Wei
ta: வீ

source: Here you'll find materials on basic Tor explainers and concepts, ideas for preparing a Tor talk, suggested social media posts, and more.
ta: இங்கே நீங்கள் அடிப்படை டோர் விளக்கமளிப்பவர்கள் மற்றும் கருத்துகள், டோர் பேச்சைத் தயாரிப்பதற்கான சிந்தனைகள், பரிந்துரைக்கப்பட்ட சமூக ஊடக இடுகைகள் மற்றும் பலவற்றைக் காண்பீர்கள்.

source: Talk about Tor
ta: டோர் பற்றி பேசுங்கள்

source: ### Do you actively look for bad relays?
ta: ### நீங்கள் மோசமான ரிலேக்களை தீவிரமாக தேடுகிறீர்களா?

source: ### How do I report a bad relay?
ta: ### மோசமான ரிலேவை நான் எவ்வாறு புகாரளிப்பது?

source: ### My relay was given the BadExit flag. What's up?
ta: ### எனது ரிலேவுக்கு பேடெக்சிட் கொடி வழங்கப்பட்டது. என்ன?

source: ### What happens to bad relays?
ta: ### மோசமான ரிலேக்களுக்கு என்ன நடக்கும்?

source: ### What is a bad relay?
ta: ### மோசமான ரிலே என்றால் என்ன?

source: * BadExit - Never used as an exit relay (for relays that appear to mess with exit traffic)
ta: * BadExit - ஒருபோதும் used அச் an exit அஞ்சல் சுருள் (for relays that appear பெறுநர் mess with exit traffic)

source: * Invalid - Never used unless AllowInvalidNodes is set (by default this only allows for middle and rendezvous usage)
ta: * செல்லுபடியாகாத - ஒருபோதும் used unless AllowInvalidNodes is கணம் (by இயல்புநிலை this only allows க்கு middle and rendezvous usage)

source: * Only allowing plain-text traffic (for instance, just port 80).
ta: * வெற்று-உரை போக்குவரத்தை மட்டுமே அனுமதிக்கிறது (உதாரணமாக, துறைமுகம் 80).

source: * Reject - Dropped from the consensus entirely
ta: * நிராகரிக்கவும் - ஒருமித்த கருத்திலிருந்து முற்றிலும் கைவிடப்பட்டது

source: 1. The relay's IP address or fingerprint. The fingerprint is a forty-character hex string such as `203933ED4E55EF8A3C3518427D1A1ED6A4CC285E`.
ta: 1. ரிலேவின் ஐபி முகவரி அல்லது கைரேகை. கைரேகை என்பது `203933ED4E55EF8A3C3518427D1A1A1ED6A4CC285E` போன்ற நாற்பது-எழுத்து ஃச் சரம் ஆகும்.

source: 2. What kind of behavior did you see?
ta: 2. நீங்கள் என்ன வகையான நடத்தையைப் பார்த்தீர்கள்?

source: 3. Any additional information we'll need to reproduce the issue.
ta: 3. எந்தவொரு கூடுதல் தகவலும் சிக்கலை மீண்டும் உருவாக்க வேண்டும்.

source: A bad relay is one that either doesn't work properly or tampers with our users' connections.
ta: மோசமான ரிலே என்பது சரியாக வேலை செய்யாது அல்லது எங்கள் பயனர்களின் இணைப்புகளுடன் சண்டையிடுகிறது.

source: After a relay is reported and we've verified the behavior we'll attempt to contact the relay operator. Often we can sort things out but if not (or the relay lacks contact information) we'll flag it to prevent it from continuing to be used.
ta: ஒரு ரிலே புகாரளிக்கப்பட்ட பிறகு, ரிலே ஆபரேட்டரை தொடர்பு கொள்ள முயற்சிக்கும் நடத்தையை நாங்கள் சரிபார்த்துள்ளோம். பெரும்பாலும் நாம் விசயங்களை வரிசைப்படுத்தலாம், இல்லையென்றால் (அல்லது ரிலே தொடர்புத் செய்தி இல்லை) தொடர்ந்து பயன்படுத்தப்படுவதைத் தடுக்க நாங்கள் கொடியிடுவோம்.

source: Also, if your relay is stolen or goes missing, please report it as well, so we can blocklist it in case whoever took it puts it back online.
ta: மேலும், உங்கள் ரிலே திருடப்பட்டால் அல்லது காணாமல் போனால், தயவுசெய்து அதைப் புகாரளித்தால், அதை எடுத்துக்கொண்டால் அதை ஆன்லைனில் திரும்பப் பெற்றால் அதைத் தடுக்கலாம்.

source: However, if you need help with anything Tor-related, please use the [Tor Forum](https://forum.torproject.net/c/support/) instead.
ta: இருப்பினும், டோர்-தொடர்புடைய எதற்கும் உங்களுக்கு உதவி தேவைப்பட்டால், தயவுசெய்து [டோர் மன்றம்] (https://forum.torproject.net/c/support/) ஐப் பயன்படுத்தவும்.

source: If you encounter a bad relay then please let us know and write to `bad-relays AT lists DOT torproject DOT org`.
ta: நீங்கள் ஒரு மோசமான ரிலேவை சந்தித்தால், தயவுசெய்து எங்களுக்குத் தெரியப்படுத்துங்கள் மற்றும் பட்டியல்களில் மோசமான-உறைவ்களுக்கு டாட் டோர்ப்ரோசெக்ட் டாட் ஆர்க்` எழுதுங்கள்.

source: In just about all cases we're unable to contact the operator to resolve the issue, so if your relay has been flagged as a BadExit then please let us know (see above for contact info) so we can work together to fix the issue.
ta: எல்லா நிகழ்வுகளிலும் சிக்கலைத் தீர்க்க ஆபரேட்டரைத் தொடர்பு கொள்ள முடியவில்லை, எனவே உங்கள் ரிலே ஒரு பேடெக்சிட்டாக கொடியிடப்பட்டிருந்தால், தயவுசெய்து எங்களுக்குத் தெரியப்படுத்துங்கள் (தொடர்புத் தகவலுக்கு மேலே காண்க) எனவே சிக்கலை சரிசெய்ய நாங்கள் ஒன்றிணைந்து செயல்படலாம்.

source: Many bad relays are caught thanks to our wider community, so many thanks for all your help and vigilance.
ta: பல மோசமான ரிலேக்கள் எங்கள் பரந்த சமூகத்திற்கு நன்றி செலுத்துகின்றன, உங்கள் எல்லா உதவிகளுக்கும் விழிப்புணர்வுக்கும் நன்றி.

source: Other monitors include [tortunnel](https://github.com/moxie0/tortunnel), [SoaT](https://gitweb.torproject.org/torflow.git/tree/NetworkScanners/ExitAuthority/README.ExitScanning), [torscanner](https://code.google.com/p/torscanner/), and DetecTor.
ta: பிற கண்காணிப்பாளர்களில் [டார்ட்னெல்] (https://github.com/moxie0/tortunnel), [சோட்] (https://gitweb.torproject.org/torflow.git/tree/networkscanners/exitauthority/readme.exitscanning),, .

source: Please let us know by sending email to `bad-relays AT lists DOT torproject DOT org`.
ta: பட்டியல்களில் மோசமான-உறவுகளுக்கு மின்னஞ்சல் அனுப்புவதன் மூலம் எங்களுக்குத் தெரியப்படுத்துங்கள்.

source: Ran into a misconfigured, malicious, or suspicious relay while using Tor?
ta: TOR ஐப் பயன்படுத்தும் போது தவறாக கட்டமைக்கப்பட்ட, தீங்கிழைக்கும் அல்லது சந்தேகத்திற்கிடமான ரிலேவுக்குள் ஓடியதா?

source: The description of bad relays as well as the criteria for rejecting them can be found in the [Network Health wiki](https://gitlab.torproject.org/tpo/network-health/team/-/wikis/Criteria-for-rejecting-bad-relays).
ta: மோசமான ரிலேக்களின் விளக்கமும் அவற்றை நிராகரிப்பதற்கான அளவுகோல்களும் [நெட்வொர்க் எல்த் விக்கி] (https://gitlab.torproject.org/tpo/network-health/team/-/wikis/criteria-for- fad-relales) இல் காணலாம்.

source: The following are currently permitted yet do have some discussion for prohibition (as such, they should not be reported at this time):
ta: பின்வருபவை தற்போது அனுமதிக்கப்பட்டுள்ளன, ஆனால் தடைக்கு சில விவாதங்கள் உள்ளன (இது போன்றவை, இந்த நேரத்தில் அவை புகாரளிக்கப்படக்கூடாது):
