Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: This process helps us maintain a strong and reliable network, with a community of operators who are invested in transparency.
ta: வெளிப்படைத்தன்மையில் முதலீடு செய்யப்படும் ஆபரேட்டர்களின் சமூகத்துடன், வலுவான மற்றும் நம்பகமான நெட்வொர்க்கை பராமரிக்க இந்த செயல்முறை எங்களுக்கு உதவுகிறது.

source: Though before we set any goals or policies, we try to verify that one set of goals does not negatively impact the other.
ta: எந்தவொரு குறிக்கோள்களையும் கொள்கைகளையும் அமைப்பதற்கு முன்பு, ஒரு குறிக்கோள்கள் மற்றொன்றை எதிர்மறையாக பாதிக்காது என்பதை சரிபார்க்க முயற்சிக்கிறோம்.

source: Users and operators can monitor how the policy is applied and raise concerns if they believe relays are being unfairly targeted.
ta: பயனர்கள் மற்றும் ஆபரேட்டர்கள் கொள்கை எவ்வாறு பயன்படுத்தப்படுகிறார்கள் என்பதை கண்காணிக்க முடியும் மற்றும் ரிலேக்கள் நியாயமற்ற முறையில் குறிவைக்கப்படுவதாக அவர்கள் நம்பினால் கவலைகளை எழுப்பலாம்.

source: We recognize the potential conflicts between our goals for relay operators and our broader goals of user privacy and security.
ta: ரிலே ஆபரேட்டர்களுக்கான எங்கள் குறிக்கோள்களுக்கும் பயனர் தனியுரிமை மற்றும் பாதுகாப்பின் எங்கள் பரந்த குறிக்கோள்களுக்கும் இடையிலான சாத்தியமான மோதல்களை நாங்கள் அங்கீகரிக்கிறோம்.

source: We try to extend our commitment to transparency and accountability across all our processes.
ta: எங்கள் எல்லா செயல்முறைகளிலும் வெளிப்படைத்தன்மை மற்றும் பொறுப்புக்கூறலுக்கான எங்கள் உறுதிப்பாட்டை விரிவுபடுத்த முயற்சிக்கிறோம்.

source: While transparency is a core value, we recognize the potential challenges. We keep our methods for finding suspicious activity as open as we can, even though it might give attackers some insights.
ta: வெளிப்படைத்தன்மை ஒரு முக்கிய மதிப்பு என்றாலும், சாத்தியமான சவால்களை நாங்கள் அங்கீகரிக்கிறோம். சந்தேகத்திற்கிடமான செயல்பாட்டைக் கண்டுபிடிப்பதற்கான வழிமுறைகளை எங்களால் முடிந்தவரை திறந்து வைத்திருக்கிறோம், இது தாக்குபவர்களுக்கு சில நுண்ணறிவுகளைத் தரக்கூடும் என்றாலும்.

source: Evaluation Criteria for Proposals
ta: திட்டங்களுக்கான மதிப்பீட்டு அளவுகோல்கள்

source: - [[tor-relays] Process for new policies and proposals for the Tor relay operator community](https://community.torproject.org/policies/relays/001-community-relay-operator-process/)
ta: - [[tor-relays] Process க்கு புதிய policies and proposals க்கு the Tor அஞ்சல் சுருள் operator community](https://community.torproject.org/policies/relays/001-community-relay-operator-process/)

source: Historically, the management of the Tor relay operator community was informal, depending on interactions among [relay operators](/relay/governance/relay-operators/becoming-relay-operator), [Directory Authorities](/relay/governance/policies-and-proposals/directory-authority), and Tor Project staff during meetups.
ta: வரலாற்று ரீதியாக, டோர் ரிலே ஆபரேட்டர் சமூகத்தின் நிர்வாகம் முறைசாராதாக இருந்தது, [ரிலே ஆபரேட்டர்கள்] (/ரிலே/கவர்னன்ச்/ரிலே-ஆபரேட்டர்கள்/ஆக-ரீலி-ஆபரேட்டர்), [அடைவு அதிகாரிகள்] (/ரிலே/ஆளுகை/கொள்கைகள்-மற்றும்-சுயவிவரங்கள்/அடைவு-அங்கீகாரம்) ஆகியவற்றுக்கு இடையேயான தொடர்புகளைப் பொறுத்து, மற்றும் டொர்க்அப்களின் போது திட்ட ஊழியர்கள்.

source: However, as the community has grown and become more diverse, a structured process is necessary to evaluate and implement proposals systematically.
ta: எவ்வாறாயினும், சமூகம் வளர்ந்து மிகவும் மாறுபட்டதாக மாறியதால், திட்டங்களை முறையாக மதிப்பிடுவதற்கும் செயல்படுத்துவதற்கும் ஒரு கட்டமைக்கப்பட்ட செயல்முறை தேவை.

source: Learn more about the [process for new policies and proposals for the Tor relay operator community](https://community.torproject.org/policies/relays/001-community-relay-operator-process/).
ta: [டோர் ரிலே ஆபரேட்டர் சமூகத்திற்கான புதிய கொள்கைகள் மற்றும் திட்டங்களுக்கான செயல்முறை] பற்றி மேலும் அறிக (https://community.torproject.org/policies/relays/001-community-relay-operator-process/).

source: The following are sample proposal formats you can use to get started.
ta: தொடங்குவதற்கு நீங்கள் பயன்படுத்தக்கூடிய மாதிரி முன்மொழிவு வடிவங்கள் பின்வருமாறு.

source: The proposals for relay operators are focused on operational, policy, and community-related aspects specific to the relay operator community, contrasting with the technical specifications covered by [Tor specifications](https://spec.torproject.org/) (aka torspec).
ta: ரிலே ஆபரேட்டர்களுக்கான திட்டங்கள் ரிலே ஆபரேட்டர் சமூகத்திற்கு குறிப்பிட்ட செயல்பாட்டு, கொள்கை மற்றும் சமூகம் தொடர்பான அம்சங்களில் கவனம் செலுத்துகின்றன, இது [TOR விவரக்குறிப்புகள்] (https://spec.torproject.org/) (aka டோர்ச்பெக்) ஆகியவற்றால் உள்ளடக்கப்பட்ட தொழில்நுட்ப விவரக்குறிப்புகளுக்கு மாறாக உள்ளது.

source: The proposals undergo a thorough review process involving drafting, community consensus, and final approval by the proposal editors, ensuring they align with the Tor Project's policies and operational goals.
ta: திட்டங்கள் வரைவு, சமூக ஒருமித்த கருத்து மற்றும் முன்மொழிவு ஆசிரியர்களின் இறுதி ஒப்புதல் ஆகியவற்றை உள்ளடக்கிய முழுமையான மறுஆய்வு செயல்முறைக்கு உட்படுகின்றன, அவை TOR திட்டத்தின் கொள்கைகள் மற்றும் செயல்பாட்டு இலக்குகளுடன் ஒத்துப்போகின்றன.

source: Topics include security measures against malicious relays, expectations for relay operators, sustainability, and guidelines for investigating and removing malicious actors.
ta: தீங்கிழைக்கும் ரிலேக்களுக்கு எதிரான பாதுகாப்பு நடவடிக்கைகள், ரிலே ஆபரேட்டர்களுக்கான எதிர்பார்ப்புகள், நிலைத்தன்மை மற்றும் தீங்கிழைக்கும் நடிகர்களை விசாரிப்பதற்கும் அகற்றுவதற்கும் வழிகாட்டுதல்களும் தலைப்புகளில் அடங்கும்.

source: New policies and proposals for the Tor relay operator community
ta: டோர் ரிலே ஆபரேட்டர் சமூகத்திற்கான புதிய கொள்கைகள் மற்றும் திட்டங்கள்

source: 1. **Understand the basics of Tor**
ta: 1. ** TOR இன் அடிப்படைகளை புரிந்து கொள்ளுங்கள் **

source: 2. **Assess your resources**
ta: 2. ** உங்கள் வளங்களை மதிப்பிடுங்கள் **

source: 3. **Choose your relay type**
ta: 3. ** உங்கள் ரிலே வகையைத் தேர்வுசெய்க **

source: 4. **Set up your relay**
ta: 4. ** உங்கள் ரிலேவை அமைக்கவும் **

source: 5. **Configure Bandwidth and Security Settings**
ta: 5. ** அலைவரிசை மற்றும் பாதுகாப்பு அமைப்புகளை உள்ளமைக்கவும் **

source: 6. **Monitor and Maintain Your Relay**
ta: 6. ** உங்கள் ரிலேவை கண்காணித்து பராமரிக்கவும் **

source: 7. **Join the Community**
ta: 7. ** சமூகத்தில் சேரவும் **

source: 8. **Spread the Word**
ta: 8. ** வார்த்தையை பரப்பவும் **

source: > Read our [Expectations for Relay Operators](/relay/governance/relay-operators/relay-operator-expectations) guide for more detail on what it means to be a good relay operator.
ta: > எங்கள் [ரிலே ஆபரேட்டர்களுக்கான எதிர்பார்ப்புகள்] (/ரிலே/கவர்னன்ச்/ரிலே-ஆபரேட்டர்கள்/ரிலே-ஆபரேட்டர்-விரிவாக்கங்கள்) ஒரு நல்ல ரிலே ஆபரேட்டராக இருப்பதன் பொருள் குறித்து மேலும் விவரங்களுக்கு வழிகாட்டவும்.

source: Additionally, you'll want to configure security settings to protect your relay from potential attacks and abuse.
ta: கூடுதலாக, உங்கள் ரிலேவை சாத்தியமான தாக்குதல்கள் மற்றும் துச்பிரயோகங்களிலிருந்து பாதுகாக்க பாதுகாப்பு அமைப்புகளை உள்ளமைக்க விரும்புவீர்கள்.

source: As a Tor relay operator, you're part of a global community dedicated to promoting online privacy and freedom.
ta: டோர் ரிலே ஆபரேட்டராக, நிகழ்நிலை தனியுரிமை மற்றும் சுதந்திரத்தை மேம்படுத்துவதற்காக அர்ப்பணிக்கப்பட்ட உலகளாவிய சமூகத்தின் ஒரு பகுதியாக இருக்கிறீர்கள்.

source: As a relay operator, you can configure the bandwidth limits for your relay to ensure it doesn't overwhelm your internet connection.
ta: ரிலே ஆபரேட்டராக, உங்கள் ரிலேவுக்கான அலைவரிசை வரம்புகளை உங்கள் இணைய இணைப்பை மூழ்கடிக்காது என்பதை உறுதிப்படுத்தலாம்.

source: As a relay operator, you can either run an exit relay or a non-exit relay because you cannot operate middle relays alone.
ta: ரிலே ஆபரேட்டராக, நீங்கள் ஒரு வெளியேறும் ரிலே அல்லது வெளியேற்றப்படாத ரிலேவை இயக்கலாம், ஏனெனில் நீங்கள் நடுத்தர ரிலேக்களை மட்டும் இயக்க முடியாது.

source: At the heart of the Tor network are volunteer-operated relays, which help anonymize and route user traffic.
ta: TOR நெட்வொர்க்கின் மையத்தில் தன்னார்வலத்தால் இயக்கப்படும் ரிலேக்கள் உள்ளன, அவை அநாமதேயமாக்கவும் பயனர் போக்குவரத்தை வழிநடத்தவும் உதவுகின்றன.

source: Becoming a Tor relay operator is a rewarding way to contribute to online privacy and freedom.
ta: டோர் ரிலே ஆபரேட்டராக மாறுவது நிகழ்நிலை தனியுரிமை மற்றும் சுதந்திரத்திற்கு பங்களிப்பதற்கான பலனளிக்கும் வழியாகும்.

source: Before diving into becoming a relay operator, it's important that you have a basic understanding of how the Tor network functions.
ta: ரிலே ஆபரேட்டராக மாறுவதற்கு முன், TOR பிணையம் எவ்வாறு செயல்படுகிறது என்பதைப் பற்றிய அடிப்படை புரிதல் உங்களுக்கு இருப்பது முதன்மை.

source: By following these steps, you can become a valuable contributor to the Tor community and play an important role in safeguarding online privacy and freedom for users around the world.
ta: இந்த படிகளைப் பின்பற்றுவதன் மூலம், நீங்கள் TOR சமூகத்திற்கு ஒரு மதிப்புமிக்க பங்களிப்பாளராக மாறலாம் மற்றும் உலகெங்கிலும் உள்ள பயனர்களுக்கு நிகழ்நிலை தனியுரிமை மற்றும் சுதந்திரத்தைப் பாதுகாப்பதில் முக்கிய பங்கு வகிக்கலாம்.

source: Decide which type of relay you want to operate based on your resources and preferences.
ta: உங்கள் வளங்கள் மற்றும் விருப்பங்களின் அடிப்படையில் நீங்கள் எந்த வகையான ரிலேவை இயக்க விரும்புகிறீர்கள் என்பதை தீர்மானிக்கவும்.

source: Encourage others to become relay operators or support the Tor project in other ways.
ta: ரிலே ஆபரேட்டர்களாக மாற மற்றவர்களை ஊக்குவிக்கவும் அல்லது TOR திட்டத்தை வேறு வழிகளில் ஆதரிக்கவும்.

source: Here's a step-by-step guide to help you get started:
ta: தொடங்குவதற்கு உங்களுக்கு உதவ ஒரு படிப்படியான வழிகாட்டி இங்கே:

source: If you decide to become a relay operator, make sure you meet the requirements, have some technical expertise, and some time to maintain the relay.
ta: நீங்கள் ஒரு ரிலே ஆபரேட்டராக மாற முடிவு செய்தால், நீங்கள் தேவைகளைப் நிறைவு செய்வதை உறுதிசெய்து கொள்ளுங்கள், சில தொழில்நுட்ப நிபுணத்துவம் மற்றும் ரிலேவை பராமரிக்க சிறிது நேரம்.

source: Joining the Tor community allows you to connect with other relay operators, share knowledge and experiences, and contribute to the ongoing development of the Tor network.
ta: TOR சமூகத்தில் சேருவது மற்ற ரிலே ஆபரேட்டர்களுடன் இணைக்கவும், அறிவு மற்றும் அனுபவங்களைப் பகிர்ந்து கொள்ளவும், TOR நெட்வொர்க்கின் தற்போதைய வளர்ச்சிக்கு பங்களிக்கவும் உங்களை அனுமதிக்கிறது.

source: Lastly, help raise awareness about the importance of the Tor network and the role of relay operators in maintaining its integrity.
ta: கடைசியாக, TOR நெட்வொர்க்கின் முக்கியத்துவம் மற்றும் அதன் ஒருமைப்பாட்டைப் பராமரிப்பதில் ரிலே ஆபரேட்டர்களின் பங்கு குறித்து விழிப்புணர்வை ஏற்படுத்த உதவுங்கள்.

source: Once you've chosen the type of relay you want to operate, you'll need to [configure the relay](/relay/setup/) on an operating system you’re comfortable with managing.
ta: நீங்கள் செயல்பட விரும்பும் ரிலே வகையைத் தேர்ந்தெடுத்ததும், நீங்கள் நிர்வகிக்க வசதியாக இருக்கும் ஒரு இயக்க முறைமையில் [ரிலே] (/ரிலே/அமைவு/) ஐ கட்டமைக்க வேண்டும்.

source: Operating a Tor relay is an ongoing commitment.
ta: டோர் ரிலேவை இயக்குவது தொடர்ச்சியான அர்ப்பணிப்பு.

source: There are [three types of relays](/relay/types-of-relays/) in the Tor network: entry relays, middle relays, and exit relays.
ta: டோர் நெட்வொர்க்கில் [மூன்று வகையான ரிலேக்கள்](/relay/types-of-relays/) உள்ளன: நுழைவு ரிலேக்கள், நடுத்தர ரிலேக்கள் மற்றும் வெளியேறும் ரிலேக்கள்.

source: To operate a Tor relay, there are [technical requirements and resources](/relay/relays-requirements/) that you’ll need.
ta: ஒரு டோர் ரிலேவை இயக்க, உங்களுக்குத் தேவையான [தொழில்நுட்ப தேவைகள் மற்றும் வளங்கள்] (/ரிலே/ரிலேச்-வேண்டுகோள்கள்/) உள்ளன.

source: You can follow the [instructions](/relay/setup/) carefully to ensure your relay is set up securely and correctly.
ta: உங்கள் ரிலே பாதுகாப்பாகவும் சரியாகவும் அமைக்கப்பட்டிருப்பதை உறுதிப்படுத்த நீங்கள் [வழிமுறைகள்] (/ரிலே/அமைவு/) கவனமாக பின்பற்றலாம்.

source: You can read through our documentation and try routing traffic through the Tor network using the Tor Browser.
ta: எங்கள் ஆவணங்கள் மூலம் நீங்கள் படிக்கலாம் மற்றும் டோர் உலாவியைப் பயன்படுத்தி டோர் பிணையம் மூலம் போக்குவரத்தை ரூட்டிங் முயற்சி செய்யலாம்.

source: You'll need to monitor your relay regularly to ensure it's running smoothly and efficiently. This includes checking for software updates, monitoring bandwidth usage, and addressing any issues that may arise.
ta: உங்கள் ரிலே சீராகவும் திறமையாகவும் இயங்குவதை உறுதிசெய்ய நீங்கள் தவறாமல் கண்காணிக்க வேண்டும். மென்பொருள் புதுப்பிப்புகளைச் சரிபார்ப்பது, அலைவரிசை பயன்பாட்டை கண்காணித்தல் மற்றும் எழக்கூடிய ஏதேனும் சிக்கல்களைத் தீர்ப்பது ஆகியவை இதில் அடங்கும்.

source: Becoming a Relay Operator
ta: ரிலே ஆபரேட்டராக மாறுகிறது

source: In the past, our approach to organizing the Tor relay operator community relied heavily on the informal dynamics between [relay operators](/relay/governance/relay-operators/becoming-relay-operator), [Directory Authorities](/relay/governance/policies-and-proposals/directory-authority-policy), and The Tor Project staff.
ta: கடந்த காலங்களில், டோர் ரிலே ஆபரேட்டர் சமூகத்தை ஒழுங்கமைப்பதற்கான எங்கள் அணுகுமுறை [ரிலே ஆபரேட்டர்கள்] (/ரிலே/கவர்னன்ச்/ரிலே-ஆபரேட்டர்கள்/-ரிலே-ஆபரேட்டர்), [அடைவு அதிகாரிகள்] (/ரிலே/ஆளுகை/அரசியல் மற்றும் ஆதரவை/அடைவு-அங்கீகார-துணை-பாலிசி) மற்றும் டொரிப்ளெச் ஊழியர்களுக்கு இடையிலான முறைசாரா இயக்கவியலை பெரிதும் நம்பியிருந்தது.

source: Now, through discussions and interactions in meetups and similar events, we collaborate with operators to determine best practices for managing Tor relays.
ta: இப்போது, சந்திப்புகள் மற்றும் ஒத்த நிகழ்வுகளின் விவாதங்கள் மற்றும் தொடர்புகள் மூலம், டோர் ரிலேக்களை நிர்வகிப்பதற்கான சிறந்த நடைமுறைகளைத் தீர்மானிக்க ஆபரேட்டர்களுடன் ஒத்துழைக்கிறோம்.

source: Operating a relay involves running specialized software that routes encrypted traffic through a series of relays, protecting user privacy and security.
ta: ரிலேவை இயக்குவது என்பது தொடர்ச்சியான ரிலேக்கள் மூலம் போக்குவரத்தை மறைகுறியாக்கிய, பயனர் தனியுரிமை மற்றும் பாதுகாப்பைப் பாதுகாக்கும் சிறப்பு மென்பொருளை இயக்குவதை உள்ளடக்குகிறது.

source: Relay operators contribute valuable bandwidth and computing resources to the network, enabling Tor users to access the internet anonymously.
ta: ரிலே ஆபரேட்டர்கள் நெட்வொர்க்குக்கு மதிப்புமிக்க அலைவரிசை மற்றும் கணினி வளங்களை பங்களிக்கின்றன, இது டோர் பயனர்களை அநாமதேயமாக இணையத்தை அணுக உதவுகிறது.

source: Relay operators form the backbone of the Tor network, facilitating anonymous and secure internet browsing for users worldwide.
ta: ரிலே ஆபரேட்டர்கள் TOR நெட்வொர்க்கின் முதுகெலும்பாக அமைகின்றன, உலகளவில் பயனர்களுக்கு அநாமதேய மற்றும் பாதுகாப்பான இணைய உலாவலை எளிதாக்குகின்றன.

source: This is beneficial to both user safety and the continued effectiveness of [Directory Authorities](/relay/governance/policies-and-proposals/directory-authority) and The Tor Project.
ta: இது பயனர் பாதுகாப்பு மற்றும் [அடைவு அதிகாரிகள்] (/ரிலே/ஆளுகை/கொள்கைகள் மற்றும் ஆதரவுகள்/அடைவு-அங்கீகாரம்) மற்றும் TOR திட்டத்தின் தொடர்ச்சியான செயல்திறன் ஆகிய இரண்டிற்கும் நன்மை பயக்கும்.

source: Relay Operators
ta: ரிலே ஆபரேட்டர்கள்

source: > See the [full expectations for relay operators](https://community.torproject.org/policies/relays/expectations-for-relay-operators/).
ta: > [ரிலே ஆபரேட்டர்களுக்கான முழு எதிர்பார்ப்புகளை] (https://community.torproject.org/policies/relays/expectations-for-relay-operators/) காண்க.

source: If questions about adherence to these expectations come up, our [community policies](https://community.torproject.org/policies/) provide a framework for decision-making and enforcement within the Tor community.
ta: இந்த எதிர்பார்ப்புகளை கடைபிடிப்பது குறித்த கேள்விகள் வந்தால், எங்கள் [சமூகக் கொள்கைகள்] (https://community.torproject.org/policies/) டோர் சமூகத்திற்குள் முடிவெடுக்கும் மற்றும் அமலாக்கத்திற்கான ஒரு கட்டமைப்பை வழங்குகின்றன.

source: Operators must prioritize user anonymity and security, maintain good operational practices, and align their activities with Tor's values and mission.
ta: ஆபரேட்டர்கள் பயனர் பெயர் மற்றும் பாதுகாப்புக்கு முன்னுரிமை அளிக்க வேண்டும், நல்ல செயல்பாட்டு நடைமுறைகளை பராமரிக்க வேண்டும், மேலும் அவற்றின் செயல்பாடுகளை டோரின் மதிப்புகள் மற்றும் பணியுடன் சீரமைக்க வேண்டும்.

source: Relay operators play a crucial role in the health, safety, and sustainability of the Tor network.
ta: டோர் நெட்வொர்க்கின் உடல்நலம், பாதுகாப்பு மற்றும் நிலைத்தன்மையில் ரிலே ஆபரேட்டர்கள் முக்கிய பங்கு வகிக்கின்றனர்.

source: These expectations help maintain user trust, and network functionality.
ta: இந்த எதிர்பார்ப்புகள் பயனர் நம்பிக்கையையும் பிணைய செயல்பாட்டையும் பராமரிக்க உதவுகின்றன.

source: This mutual commitment between the Tor Project and relay operators is vital for the Tor network's continuous success.
ta: TOR திட்டத்திற்கும் ரிலே ஆபரேட்டர்களுக்கும் இடையிலான இந்த பரச்பர அர்ப்பணிப்பு TOR நெட்வொர்க்கின் தொடர்ச்சியான வெற்றிக்கு இன்றியமையாதது.

source: While they generously invest their time, energy, and resources to support the network, it is essential to have clear expectations to ensure the integrity and security of the entire system.
ta: நெட்வொர்க்கை ஆதரிப்பதற்காக அவர்கள் தங்கள் நேரம், ஆற்றல் மற்றும் வளங்களை தாராளமாக முதலீடு செய்தாலும், முழு அமைப்பின் ஒருமைப்பாட்டையும் பாதுகாப்பையும் உறுதி செய்வதற்கான தெளிவான எதிர்பார்ப்புகளைக் கொண்டிருப்பது தேவை.

source: Expectations for Relay Operators
ta: ரிலே ஆபரேட்டர்களுக்கான எதிர்பார்ப்புகள்

source: # Bandwidth and Connections
ta: # அலைவரிசை மற்றும் இணைப்புகள்

source: # CPU
ta: # சிபியு

source: # Disk Storage
ta: # வட்டு சேமிப்பு

source: # In Summary
ta: # சுருக்கத்தில்

source: # Memory Requirements
ta: # நினைவக தேவைகள்

source: # Monthly Outbound Traffic
ta: # மாதாந்திர வெளிச்செல்லும் போக்குவரத்து

source: # Public IPv4 Address
ta: # பொது IPv4 முகவரி

source: # Tor Version
ta: # TOR பதிப்பு

source: # Uptime
ta: # இயக்க நேரம்

source: * A <40 Mbit/s non-exit relay should have at least 512 MB of RAM available.
ta: * A <40 Mbit/s அல்லாத எக்சிட் ரிலே குறைந்தது 512 MB ரேம் இருக்க வேண்டும்.

source: * A non-exit relay faster than 40 Mbit/s should have at least 1 GB of RAM.
ta: * 40 mbit/s ஐ விட வேகமாக வெளியேற்றப்படாத ரிலே குறைந்தது 1 சிபி ரேம் இருக்க வேண்டும்.

source: * Able to handle at least 7000 concurrent connections.
ta: * குறைந்தது 7000 ஒரே நேரத்தில் இணைப்புகளைக் கையாள முடியும்.

source: * An IPv4 address (can be dynamic or static (preferred) as long as it stays the same for at least 3 hours).
ta: * ஒரு ஐபிவி 4 முகவரி (குறைந்தது 3 மணி நேரம் ஒரே மாதிரியாக இருக்கும் வரை மாறும் அல்லது நிலையானதாக இருக்கலாம் (விரும்பப்படுகிறது).

source: * Any modern CPU should be fine.
ta: * எந்த நவீன சிபியு நன்றாக இருக்க வேண்டும்.

source: * At least 1 Mbit/s of upstream and downstream bandwidth.
ta: * மேலோடை மற்றும் கீழ்நிலை அலைவரிசை குறைந்தது 1 mbit/s.

source: * At least 1.5 GB of RAM recommended.
ta: * குறைந்தது 1.5 சிபி ரேம் பரிந்துரைக்கப்படுகிறது.

source: * At least 200 MB of disk storage.
ta: * குறைந்தது 200 எம்பி வட்டு சேமிப்பு.

source: * At least 512 MB of RAM if the relay is slower than 40 Mbps or 1 GB of RAM if faster than 40 Mbps.
ta: * ரிலே 40 எம்.பி.பி.எச் அல்லது 1 சிபி ரேம் 40 எம்.பி.பி.எச்சை விட வேகமாக இருந்தால் குறைந்தது 512 எம்பி ரேம்.

source: * Have at least 10 Mbit/s (16 Mbit/s recommended) of upstream and downstream bandwidth.
ta: * மேலோடை மற்றும் கீழ்நிலை அலைவரிசையின் குறைந்தது 10 mbit/s (16 mbit/s பரிந்துரைக்கப்பட்ட) உள்ளது.

source: * Ideal uptime is 24/7 but relays should be up for more than 2 hours a day.
ta: * சிறந்த நேரம் 24/7 ஆனால் ரிலேக்கள் ஒரு நாளைக்கு 2 மணி நேரத்திற்கும் மேலாக இருக்க வேண்டும்.

source: * In a position to handle legal notices and potential law enforcement inquiry.
ta: * சட்ட அறிவிப்புகள் மற்றும் சாத்தியமான சட்ட அமலாக்க விசாரணையை கையாளும் நிலையில்.

source: * Must be able to donate at least 100 GByte of traffic a month (ideally 2 TB or more).
ta: * ஒரு மாதத்திற்கு குறைந்தது 100 சிபைட் போக்குவரத்தை நன்கொடையாக வழங்க வேண்டும் (வெறுமனே 2 காசநோய் அல்லது அதற்கு மேற்பட்டவை).

source: * On an exit relay we recommend at least 1.5 GB of RAM per tor instance.
ta: * வெளியேறும் ரிலேவில், ஒரு டோர் உதாரணத்திற்கு குறைந்தது 1.5 சிபி ரேம் பரிந்துரைக்கிறோம்.

source: * Should be able to handle around 100,000 concurrent connections if faster than 100 Mbit/s.
ta: * 100 MBIT/s ஐ விட வேகமாக இருந்தால் சுமார் 100,000 ஒரே நேரத்தில் இணைப்புகளைக் கையாள முடியும்.

source: **Ideally a relay runs on an unmetered plan** or includes 2 TB/month or more.
ta: ** வெறுமனே ஒரு ரிலே ஒரு அளவிடப்படாத திட்டத்தில் இயங்குகிறது ** அல்லது 2 காசநோய்/மாதம் அல்லது அதற்கு மேற்பட்டவற்றை உள்ளடக்கியது.

source: A non-exit relay should be able to handle at least 7000 concurrent connections.
ta: வெளியேற்றப்படாத ரிலே குறைந்தது 7000 ஒரே நேரத்தில் இணைப்புகளைக் கையாள முடியும்.

source: A typical Tor relay needs less than 200 MB for Tor related data (in addition to the operating system itself).
ta: ஒரு பொதுவான டோர் ரிலே டோர் தொடர்பான தரவுகளுக்கு 200 எம்பிக்கும் குறைவாகவே தேவைப்படுகிறது (இயக்க முறைமைக்கு கூடுதலாக).

source: Additional IPv6 connectivity is great and recommended/encouraged but not a requirement.
ta: கூடுதல் ஐபிவி 6 இணைப்பு சிறந்தது மற்றும் பரிந்துரைக்கப்படுகிறது/ஊக்குவிக்கப்படுகிறது, ஆனால் தேவையில்லை.

source: Bridge relay:
ta: பிரிட்ச் ரிலே:

source: Do not run an exit relay from your home.
ta: உங்கள் வீட்டிலிருந்து வெளியேறும் ரிலேவை இயக்க வேண்டாம்.

source: Every relay needs a public IPv4 address - either directly on the host (preferred) or via NAT and port forwarding.
ta: ஒவ்வொரு ரிலேவுக்கும் ஒரு பொது IPv4 முகவரி தேவை - நேரடியாக ஓச்டில் (விருப்பமானது) அல்லது NAT மற்றும் துறைமுகம் பகிர்தல் வழியாக.

source: Exit relay:
ta: வெளியேறு ரிலே:

source: Fast exit relays (>=100 Mbit/s) usually have to handle a lot more concurrent connections (>100k).
ta: வேகமான வெளியேறும் ரிலேக்கள் (> = 100 MBIT/S) வழக்கமாக நிறைய ஒரே நேரத்தில் இணைப்புகளை (> 100K) கையாள வேண்டும்.

source: For security reasons, Tor relays should not downgrade their tor version from a supported to an unsupported version of tor. Some unsupported versions are insecure. Relays that attempt to downgrade to an insecure version will be rejected from the network automatically.
ta: பாதுகாப்பு காரணங்களுக்காக, டோர் ரிலேக்கள் தங்கள் TOR பதிப்பை ஆதரிக்கப்பட்டதிலிருந்து TOR இன் ஆதரிக்கப்படாத பதிப்பிற்கு தரமிறக்கக்கூடாது. ஆதரிக்கப்படாத சில பதிப்புகள் பாதுகாப்பற்றவை. பாதுகாப்பற்ற பதிப்பிற்கு தரமிறக்க முயற்சிக்கும் ரிலேக்கள் தானாகவே பிணையத்திலிருந்து நிராகரிக்கப்படும்.

source: Guard/Middle relay:
ta: காவலர்/நடுத்தர ரிலே:

source: Ideally the relay runs on a server which runs 24/7.
ta: வெறுமனே ரிலே 24/7 இயங்கும் சேவையகத்தில் இயங்குகிறது.

source: If the file `/proc/cpuinfo` contains the word aes your CPU has support for AES-NI.
ta: `/Proc/cpuinfo` கோப்பில் AES என்ற வார்த்தையைக் கொண்டிருந்தால், உங்கள் சிபியு க்கு AES-NI க்கு உதவி உள்ளது.

source: If you do not know your bandwidth you can use http://beta.speedtest.net to measure it.
ta: உங்கள் அலைவரிசை உங்களுக்குத் தெரியாவிட்டால், அதை அளவிட http://beta.speedtest.net ஐப் பயன்படுத்தலாம்.

source: If you don't meet the requirements to run a Tor relay or obfs4 bridge, running a Snowflake proxy is a great way to donate your bandwidth to help users circumvent censorship.
ta: டோர் ரிலே அல்லது OBFS4 பாலத்தை இயக்குவதற்கான தேவைகளை நீங்கள் நிறைவு செய்யவில்லை என்றால், ஒரு ச்னோஃப்ளேக் ப்ராக்சியை இயக்குவது உங்கள் அலைவரிசையை நன்கொடையாக தணிக்கை செய்வதைத் தவிர்ப்பதற்கான சிறந்த வழியாகும்.

source: If you have a metered plan you might want to configure tor to only use a given amount of [bandwidth or monthly traffic](../setup/post-install/).
ta: உங்களிடம் ஒரு மீட்டர் திட்டம் இருந்தால், கொடுக்கப்பட்ட அளவு [அலைவரிசை அல்லது மாதாந்திர போக்குவரத்து] (../ அமைவு/பிந்தைய நிறுவல்/) மட்டுமே பயன்படுத்த TOR ஐ உள்ளமைக்க விரும்பலாம்.

source: If you have less than 10 Mbit/s but at least 1 Mbit/s we recommend you run a [bridge with obfs4 support](../setup/bridge/).
ta: உங்களிடம் 10 mbit/s க்கும் குறைவாக இருந்தால், குறைந்தது 1 Mbit/s இருந்தால், [OBFS4 ஆதரவுடன் பாலம்] (../ அமைவு/பாலம்/) இயக்க பரிந்துரைக்கிறோம்.
