Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: This was not written or reviewed by a lawyer.
ta: இது ஒரு வழக்கறிஞரால் எழுதப்படவில்லை அல்லது மதிப்பாய்வு செய்யப்படவில்லை.

source: To further preach to the choir, the identity-based Internet "driver's licenses" of South Korea and China have done nothing to curtail cybercrime and Internet abuse.
ta: கொயருக்கு மேலும் பிரசங்கிக்க, தென் கொரியா மற்றும் சீனாவின் அடையாள அடிப்படையிலான இணைய "ஓட்டுநர் உரிமங்கள்" சைபர் கிரைம் மற்றும் இணைய துச்பிரயோகத்தை குறைக்க எதுவும் செய்யவில்லை.

source: To help protect yourself while using open wireless, consider using this Firefox plugin: <https://www.eff.org/https-everywhere/> and encourage the site maintainer to support HTTPS logins.
ta: திறந்த வயர்லெசைப் பயன்படுத்தும் போது உங்களைப் பாதுகாத்துக் கொள்ள, இந்த பயர்பாக்ச் சொருகி பயன்படுத்துவதைக் கவனியுங்கள்: <https://www.eff.org/https-everywhere/> மற்றும் தள பராமரிப்பாளரை HTTPS உள்நுழைவுகளை ஆதரிக்க ஊக்குவிக்கவும்.

source: Unfortunately, some people misuse the network. However, compared to the rate of legitimate use (the IP range in question processes nearly a gigabit of traffic per second), [abuse complaints are rare](https://support.torproject.org/abuse/).
ta: எதிர்பாராதவிதமாக, சிலர் நெட்வொர்க்கை தவறாகப் பயன்படுத்துகிறார்கள். இருப்பினும், முறையான பயன்பாட்டின் வீதத்துடன் ஒப்பிடும்போது (கேள்வி செயல்முறைகளில் உள்ள ஐபி வரம்பு கிட்டத்தட்ட நொடிக்கு ஒரு சிகாபிட் போக்குவரத்து), [துச்பிரயோகம் புகார்கள் அரிதானவை] (https://support.torproject.org/abuse/).

source: Upon investigation, it appears that the source of the spam is due to an abusive or compromised webmail gateway running at:
ta: விசாரணையில், ச்பேமின் மூலமானது ஒரு தவறான அல்லது வேறுபாடின்மை செய்யப்பட்ட வெப்மெயில் நுழைவாயில் இயங்குவதால் ஏற்படுகிறது:

source: Use these to scan to check for keyloggers or spyware that someone with access to your computer may have installed.
ta: உங்கள் கணினியை அணுகக்கூடிய ஒருவர் நிறுவியிருக்கக்கூடிய கீலாக்கர்கள் அல்லது ச்பைவேர் சரிபார்க்க ச்கேன் செய்ய இவற்றைப் பயன்படுத்தவும்.

source: We provide service to almost a gigabit of traffic per second, 98% of which is web traffic.
ta: நொடிக்கு கிட்டத்தட்ட ஒரு கிகாபிட்டுக்கு நாங்கள் சேவையை வழங்குகிறோம், அவற்றில் 98% வலை போக்குவரத்து.

source: We're sorry your account has been brute forced. We can try to prevent our node from connecting to this site, but since the Tor network has 800 or so exits, doing so wouldn't really stop the action long term.
ta: மன்னிக்கவும், உங்கள் கணக்கு முரட்டுத்தனமாக கட்டாயப்படுத்தப்பட்டுள்ளது. இந்த தளத்துடன் எங்கள் முனை இணைப்பதைத் தடுக்க நாங்கள் முயற்சி செய்யலாம், ஆனால் டோர் நெட்வொர்க்கில் 800 அல்லது அதற்கு மேற்பட்டவர்கள் இருப்பதால், அவ்வாறு செய்வது செயலை நீண்ட காலத்திற்கு நிறுத்தாது.

source: We're sorry your site is experiencing this heavy load from Tor.
ta: மன்னிக்கவும், உங்கள் தளம் TOR இலிருந்து இந்த அதிக சுமையை அனுபவிக்கிறது.

source: With respect to your account, given that the attacker used Tor and not a large botnet (or your machine's IP itself), it is likely that your password was either harvested off of your machine from a keylogger, or it was captured via a kiosk, or from open wireless.
ta: உங்கள் கணக்கைப் பொறுத்தவரை, தாக்குதல் நடத்தியவர் ஒரு பெரிய போட்நெட் (அல்லது உங்கள் இயந்திரத்தின் ஐபி) அல்ல, உங்கள் கடவுச்சொல் உங்கள் கணினியிலிருந்து ஒரு கீல்கரிலிருந்து அறுவடை செய்யப்பட்டிருக்கலாம் அல்லது கியோச்க் வழியாக கைப்பற்றப்பட்டிருக்கலாம், அல்லது திறந்த வயர்லெசிலிருந்து.

source: You can also use this DNSRBL to only allow Tor IPs to read but not post comments: https://www.torproject.org/projects/tordnsel.html.en
ta: டோர் ஐபிஎச் படிக்க மட்டுமே அனுமதிக்க இந்த டி.என்.எச்.ஆர்.பி.எல் பயன்படுத்தலாம், ஆனால் கருத்துகளை இடுகையிடவில்லை: https://www.torproject.org/projects/tordnsel.html.en

source: You can use this list to create iptables rules to block the network.
ta: நெட்வொர்க்கைத் தடுக்க iptables விதிகளை உருவாக்க இந்த பட்டியலைப் பயன்படுத்தலாம்.

source: You can use this list to help you take a closer look at Tor orders, or to hold them temporarily for additional verification, without losing legitimate customers.
ta: முறையான வாடிக்கையாளர்களை இழக்காமல், டோர் ஆர்டர்களை உன்னிப்பாகக் கவனிக்க அல்லது கூடுதல் சரிபார்ப்புக்காக தற்காலிகமாக அவற்றை வைத்திருக்க இந்த பட்டியலைப் பயன்படுத்தலாம்.

source: You might also consider a rate limiting solution: https://kvz.io/blog/2007/07/28/block-brute-force-attacks-with-iptables/
ta: விகிதத்தைக் கட்டுப்படுத்தும் தீர்வையும் நீங்கள் கருத்தில் கொள்ளலாம்: https://kvz.io/blog/2007/07/28/block-brute-force-attacks-with-iptables/

source: You might have luck getting rid of this jerk by temporarily limiting account creation to require Gmail accounts before posting, or by requiring account creation be done over non-Tor before posting.
ta: இடுகையிடுவதற்கு முன் சிமெயில் கணக்குகள் தேவைப்படுவதற்கு கணக்கை உருவாக்குவதை தற்காலிகமாக கட்டுப்படுத்துவதன் மூலமோ அல்லது இடுகையிடுவதற்கு முன் கணக்கை உருவாக்குவதற்கு கணக்கில் செய்யப்படுவதன் மூலமோ கணக்கை உருவாக்குவதன் மூலம் இந்த முட்டாள்தனத்திலிருந்து விடுபடுவதற்கு உங்களுக்கு அதிர்ச்டம் இருக்கலாம்.

source: with this issue: https://code.google.com/apis/recaptcha/intro.html
ta: இந்த சிக்கலுடன்: https://code.google.com/apis/recaptcha/intro.html

source: How to handle abuse complaints
ta: துச்பிரயோக புகார்களை எவ்வாறு கையாள்வது

source: Tor Abuse Templates
ta: தீய பயன்பாடு வார்ப்புருக்கள்

source: "Cybercrime" people actually love it when you offer to [teach them about Tor and the Internet](https://blog.torproject.org/blog/talking-german-police-stuttgart) -- they're typically overwhelmed by their jobs and don't have enough background to know where to start.
ta: "சைபர் கிரைம்" நீங்கள் [டோர் மற்றும் இன்டர்நெட் பற்றி அவர்களுக்குக் கற்பிக்க முன்வந்தால் மக்கள் உண்மையில் அதை விரும்புகிறார்கள் (https://blog.torproject.org/blog/talking-jerman- police-stuttgart)-அவர்கள் பொதுவாக தங்கள் வேலைகளால் மூழ்கடிக்கப்படுகிறார்கள், எங்கு தொடங்குவது என்பதை அறிய போதுமான பின்னணி இல்லை.

source: ## Handling abuse complaints
ta: ## துச்பிரயோக புகார்களைக் கையாளுதல்

source: ## Hosting
ta: ## ஓச்டிங்

source: ## Legal
ta: ## சட்டபூர்வமானது

source: ## Technical
ta: ## தொழில்நுட்ப

source: ## Things you can do preemptively
ta: ## நீங்கள் முன்கூட்டியே செய்யக்கூடிய விசயங்கள்

source: ### Answer to abuse complaints in a professional manner within a reasonable time span.
ta: ### துச்பிரயோக புகார்களுக்கு ஒரு நியாயமான கால இடைவெளியில் தொழில்முறை முறையில் பதில்.

source: ### Answering complaints
ta: ### புகார்களுக்கு பதிலளித்தல்

source: ### Consider preemptively teaching your local law enforcement about Tor.
ta: ### டோர் பற்றி உங்கள் உள்ளக சட்ட அமலாக்கத்தை முன்கூட்டியே கற்பிப்பதைக் கவனியுங்கள்.

source: ### Consider using the Reduced Exit Policy.
ta: ### குறைக்கப்பட்ட வெளியேறும் கொள்கையைப் பயன்படுத்துவதைக் கவனியுங்கள்.

source: ### Find Tor-friendly ISPs.
ta: ### டோர்-நட்பு ISP களைக் கண்டுபிடி.

source: ### If you receive a threatening letter from a lawyer about abusive use or a DMCA complaint, also don't freak out.
ta: ### தவறான பயன்பாடு அல்லது டி.எம்.சி.ஏ குற்றச்சாட்டு குறித்து ஒரு வழக்கறிஞரிடமிருந்து அச்சுறுத்தும் கடிதத்தைப் பெற்றால், மேலும் வெளியேற வேண்டாம்.

source: ### If you're not part of an organization, think about starting one!
ta: ### நீங்கள் ஒரு நிறுவனத்தின் பகுதியாக இல்லாவிட்டால், ஒன்றைத் தொடங்குவது பற்றி சிந்தியுங்கள்!

source: ### If you're part of an organization that will be running the exit relay (ISP, university etc), consider teaching your legal people about Tor.
ta: ### நீங்கள் வெளியேறும் ரிலேவை (ஐ.எச்.பி, பல்கலைக்கழகம் போன்றவை) இயக்கும் ஒரு அமைப்பின் பகுதியாக இருந்தால், உங்கள் சட்ட நபர்களுக்கு டோர் பற்றி கற்பிப்பதைக் கவனியுங்கள்.

source: ### Make sure you know the relevant legal paragraphs for common-carrier like communication services in your country (and the country of your hosting provider!).
ta: ### உங்கள் நாட்டில் உள்ள தகவல்தொடர்பு சேவைகள் (மற்றும் உங்கள் ஓச்டிங் வழங்குநரின் நாடு!) போன்ற பொதுவான-கேரியருக்கான தொடர்புடைய சட்ட பத்திகள் உங்களுக்குத் தெரியுமா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: ### Make the WHOIS info point as close to you as possible.
ta: ### WHOIS செய்தி புள்ளியை முடிந்தவரை உங்களுக்கு நெருக்கமாக ஆக்குங்கள்.

source: ### Register a phone number and a fax number as abuse contact.
ta: ### துச்பிரயோக தொடர்பாக தொலைபேசி எண் மற்றும் தொலைநகல் எண்ணை பதிவு செய்யுங்கள்.

source: ### Tor at Universities: Find allies.
ta: பல்கலைக்கழகங்களில் ### டோர்: நட்பு நாடுகளைக் கண்டறியவும்.

source: * Disk encryption might be useful to protect your node keys, but on the other hand unencrypted machines are easier to "audit" if required. We feel it's best to be able to easily show that you do Tor exiting, and nothing else (on that IP or server).
ta: * உங்கள் முனை விசைகளைப் பாதுகாக்க வட்டு குறியாக்கம் பயனுள்ளதாக இருக்கும், ஆனால் மறுபுறம் மறைகுறியாக்கப்பட்ட இயந்திரங்கள் தேவைப்பட்டால் "தணிக்கை" செய்வது எளிதானது. நீங்கள் வெளியேறுகிறீர்கள் என்பதை எளிதாகக் காண்பிப்பது சிறந்தது என்று நாங்கள் உணர்கிறோம், வேறு எதுவும் இல்லை (அந்த ஐபி அல்லது சேவையகத்தில்).

source: * Germany: [DDG § 7](https://www.gesetze-im-internet.de/ddg/__7.html) and [Article 4 of Regulation (EU) 2022/2065](https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A32022R2065#d1e2043-1-1)
ta: . 2022/2065] (https://eur-lex.europa.eu/legal-content/en/txt/?uri=celex%3A32022R2065#d1e2043-1-1)

source: * Set reverse DNS to something that signals its use, e.g. 'anonymous-relay', 'proxy', 'tor-proxy'. So when other people see the address in their web logs, they will more quickly understand what's going on.
ta: * தலைகீழ் டி.என்.எச் அதன் பயன்பாட்டை சமிக்ஞை செய்யும் ஒன்றுக்கு அமைக்கவும், எ.கா. 'அநாமதேய-ரிலே', 'ப்ராக்சி', 'டோராக்சி'. எனவே மற்றவர்கள் தங்கள் வலை பதிவுகளில் முகவரியைப் பார்க்கும்போது, என்ன நடக்கிறது என்பதை அவர்கள் விரைவாக புரிந்துகொள்வார்கள்.

source: * Set up an informative website on the exit IP(s) on port 80.
ta: * துறைமுகம் 80 இல் வெளியேறும் ஐபி (கள்) இல் ஒரு செய்தி வலைத்தளத்தை அமைக்கவும்.

source: * Sweden: [16-19 2002:562](https://lagen.nu/2002:562#P16S1)
ta: * ச்வீடன்: [16-19 2002: 562] (https://lagen.nu/2002:562#p16s1)

source: * Try to use dedicated IPs, and when possible dedicated hardware.
ta: * அர்ப்பணிப்பு ஐபிக்களைப் பயன்படுத்த முயற்சிக்கவும், முடிந்தால் அர்ப்பணிப்பு வன்பொருள்.

source: * USA: [DMCA 512](https://www.law.cornell.edu/uscode/text/17/512); see [EFF's Legal FAQ for Tor Operators](../eff-tor-legal-faq) (a very good and relevant read for other countries as well)
ta: * அமெரிக்கா: [DMCA 512] (https://www.law.cornell.edu/uscode/text/17/512); [டோர் ஆபரேட்டர்களுக்கான EFF இன் சட்ட கேள்விகள்] (../ EFF-TOR-LEGAL-FAQ) ஐப் பார்க்கவும் (மற்ற நாடுகளுக்கும் மிகச் சிறந்த மற்றும் பொருத்தமான வாசிப்பு)

source: * [Tor Relay Guide](../../)
ta: * [டோர் ரிலே வழிகாட்டி] (../../)

source: 1. Ask if the ISP is okay with a Tor exit
ta: 1. டோர் வெளியேறும்போது ஐ.எச்.பி சரியா என்று கேளுங்கள்

source: 2. If they come back positively, ask them if they are OK with an IP range reassignment.
ta: 2. அவர்கள் நேர்மறையாக திரும்பி வந்தால், ஐபி வரம்பு மறுசீரமைப்பில் அவர்கள் சரியா என்று அவர்களிடம் கேளுங்கள்.

source: A disclaimer helps giving people the right idea about what is behind traffic coming from these IPs.
ta: இந்த ஐபிக்களிலிருந்து வரும் போக்குவரத்திற்கு பின்னால் என்ன இருக்கிறது என்பது குறித்த சரியான யோசனையை மக்களுக்கு வழங்க ஒரு மறுப்பு உதவுகிறது.

source: A good ISP is one that offers cheap bandwidth and is not being used by other members of the Tor community.
ta: ஒரு நல்ல ISP என்பது மலிவான அலைவரிசையை வழங்கும் ஒன்றாகும், மேலும் இது TOR சமூகத்தின் மற்ற உறுப்பினர்களால் பயன்படுத்தப்படவில்லை.

source: A simple notice can be published without a separate webserver using Tor's "DirPortFrontPage " directive.
ta: டோரின் "டார்போர்ட் ஃபிரான்ட் பேச்" உத்தரவைப் பயன்படுத்தி தனி வெப்சர்வர் இல்லாமல் ஒரு எளிய அறிவிப்பை வெளியிடலாம்.

source: ARIN uses [SWIP](https://www.arin.net/resources/request/reassignments.html), and RIPE uses something similar.
ta: அரியின் [SWIP] (https://www.arin.net/resources/request/reassignments.html) ஐப் பயன்படுத்துகிறது, மேலும் பழுத்தது இதேபோன்ற ஒன்றைப் பயன்படுத்துகிறது.

source: Also read [How do I make my University / ISP / etc happy with my exit node?](../tor-relay-universities/)
ta: எனது வெளியேறும் முனையில் எனது பல்கலைக்கழகம் / ஐ.எச்.பி / போன்றவற்றை எவ்வாறு மகிழ்ச்சியடையச் செய்வது?] (../ டோர்-ரிலே-யுனிவர்சிட்டீச் /)

source: Also, if they do get a report about your relay, they'll think of you as a helpful expert rather than a potential criminal.
ta: மேலும், அவர்கள் உங்கள் ரிலே பற்றி ஒரு அறிக்கையைப் பெற்றால், அவர்கள் உங்களை ஒரு சாத்தியமான குற்றவாளியைக் காட்டிலும் ஒரு பயனுள்ள நிபுணராக நினைப்பார்கள்.

source: Another benefit of an association-like structure is that it might still work even when you leave, if you manage to find successors.
ta: ஒரு சங்கம் போன்ற கட்டமைப்பின் மற்றொரு நன்மை என்னவென்றால், நீங்கள் வெளியேறும்போது கூட அது செயல்படக்கூடும், நீங்கள் வாரிசுகளைக் கண்டுபிடிக்க முடிந்தால்.

source: At least law enforcement in Germany regularly uses the fax and phone numbers present in IP records.
ta: செர்மனியில் குறைந்தபட்சம் சட்ட அமலாக்கத்தாவது ஐபி பதிவுகளில் உள்ள தொலைநகல் மற்றும் தொலைபேசி எண்களை தவறாமல் பயன்படுத்துகிறது.

source: At least most western countries should have regulations that exclude communication service providers from liability.
ta: குறைந்த பட்சம் பெரும்பாலான மேற்கத்திய நாடுகளில் செய்தி தொடர்பு பணி வழங்குநர்களை பொறுப்பிலிருந்து விலக்கும் விதிமுறைகள் இருக்க வேண்டும்.

source: Before you continue, you may ask the Tor community if your choice is a good one.
ta: நீங்கள் தொடர்வதற்கு முன், உங்கள் விருப்பம் நல்லதா என்று நீங்கள் டோர் சமூகத்திடம் கேட்கலாம்.

source: Contacting them gives you a chance to teach them why Tor is useful to the world (and why it's [not particularly helpful to criminals](https://2019.www.torproject.org/docs/faq-abuse#WhatAboutCriminals)).
ta: அவர்களைத் தொடர்புகொள்வது டோர் ஏன் உலகிற்கு பயனுள்ளதாக இருக்கிறது என்பதை அவர்களுக்குக் கற்பிப்பதற்கான வாய்ப்பை வழங்குகிறது (இது ஏன் [குற்றவாளிகளுக்கு குறிப்பாக உதவாது] (https://2019.wwww.torproject.org/docs/faq- uspuse#whataboutcriminas)).

source: Depending on the chosen form, setting up a legal body might help with liability, and in general it helps to appear bigger than you are (and less likely to get raided).
ta: தேர்ந்தெடுக்கப்பட்ட படிவத்தைப் பொறுத்து, சட்டப்பூர்வ அமைப்பை அமைப்பது பொறுப்புக்கு உதவக்கூடும், பொதுவாக இது உங்களை விட பெரியதாக தோன்ற உதவுகிறது (மற்றும் சோதனை செய்யப்படுவது குறைவு).

source: Find some professors (or deans!) who like the idea of supporting and/or researching anonymity on the Internet.
ta: இணையத்தில் பெயர் தெரியாத மற்றும்/அல்லது ஆராய்ச்சி செய்யும் யோசனையை விரும்பும் சில பேராசிரியர்களை (அல்லது டீன்ச்!) கண்டுபிடிக்கவும்.

source: Ideally, use addresses that are not trusted by the IP-based authentication many library-related services use -- if the university's entire IP address space is "trusted" to access these library resources, the university is forced to maintain an iron grip on all its addresses.
ta: வெறுமனே, ஐபி அடிப்படையிலான அங்கீகாரத்தால் நம்பப்படாத முகவரிகளைப் பயன்படுத்துங்கள் பல நூலக தொடர்பான சேவைகள் பயன்படுத்துகின்றன-பல்கலைக்கழகத்தின் முழு ஐபி முகவரி இடமும் இந்த நூலக வளங்களை அணுக "நம்பகமானதாக" இருந்தால், பல்கலைக்கழகம் எல்லாவற்றிலும் இரும்பு பிடியை பராமரிக்க வேண்டிய கட்டாயத்தில் உள்ளது அதன் முகவரிகள்.

source: If not, you can still explain that you are a non-profit superb large organization filled with security professionals, and that all will be good, and why IP reassignment helps reduce their workload.
ta: இல்லையென்றால், நீங்கள் பாதுகாப்பு நிபுணர்களால் நிரப்பப்பட்ட ஒரு இலாப நோக்கற்ற சிறந்த பெரிய அமைப்பு என்பதையும், அனைத்தும் நன்றாக இருக்கும் என்பதையும், ஐபி மறுசீரமைப்பு அவர்களின் பணிச்சுமையை குறைக்க உதவுகிறது என்பதையும் நீங்கள் இன்னும் விளக்கலாம்.

source: If possible, use an extra IP range whose abuse contact doesn't go through the main university abuse team.
ta: முடிந்தால், கூடுதல் ஐபி வரம்பைப் பயன்படுத்துங்கள், அதன் துச்பிரயோக தொடர்பு முதன்மையான பல்கலைக்கழக துச்பிரயோகக் குழு வழியாக செல்லாது.

source: If you can get your own IP block, great. Even if not, many providers will still reassign subblocks to you if you ask.
ta: உங்கள் சொந்த ஐபி தொகுதியைப் பெற முடிந்தால், சிறந்தது. இல்லையென்றாலும், நீங்கள் கேட்டால் பல வழங்குநர்கள் உங்களுக்கு துணைப்பிரிவுகளை மீண்டும் வழங்குவார்கள்.

source: If you do, and if SMTP is allowed in your exit policy, consider configuring [SPF](https://en.wikipedia.org/wiki/Sender_Policy_Framework) on your domain: this will protect you from users using your exit node to forge e-mails which look like they come from you.
ta: நீங்கள் செய்தால், உங்கள் வெளியேறும் கொள்கையில் SMTP அனுமதிக்கப்பட்டால், [SPF] (https://en.wikipedia.org/wiki/sender_policy_framework) உங்கள் களத்தில் கட்டமைப்பதைக் கவனியுங்கள்: இது உங்கள் வெளியேறும் முனையைப் பயன்படுத்தும் பயனர்களிடமிருந்து உங்களைப் பாதுகாக்கும்.

source: If you feel it might be helpful, we can write you a signed letter confirming this information: Contact us at frontdesk@torproject.org if you need one.
ta: இது உதவியாக இருக்கும் என்று நீங்கள் நினைத்தால், இந்த தகவலை உறுதிப்படுத்தும் கையொப்பமிடப்பட்ட கடிதத்தை நாங்கள் உங்களுக்கு எழுதலாம்: உங்களுக்கு ஒன்று தேவைப்பட்டால் எங்களை rantdesk@torproject.org இல் தொடர்பு கொள்ளவும்.

source: If you have questions about the process, please write an email to [tor-relays mailing list](https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-relays) and we will try to explain the process to you.
ta: செயல்முறை குறித்து உங்களிடம் கேள்விகள் இருந்தால், தயவுசெய்து [TOR-RELAYS அஞ்சல் பட்டியல்] (https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-tor-dorelays) க்கு ஒரு மின்னஞ்சலை எழுதுங்கள், மேலும் இந்த செயல்முறையை உங்களுக்கு விளக்க முயற்சிப்போம்.

source: If you have your own experience of abuse handling, just share it on our public mailing list or write us an email to frontdesk@torproject.org.
ta: தீய பயன்பாடு கையாளுதல் குறித்த உங்கள் சொந்த பட்டறிவு உங்களுக்கு இருந்தால், அதை எங்கள் பொது அஞ்சல் பட்டியலில் பகிர்ந்து கொள்ளுங்கள் அல்லது rantdesk@torproject.org க்கு ஒரு மின்னஞ்சலை எங்களுக்கு எழுதுங்கள்.

source: If you receive an abuse complaint, don't freak out! Here is some advice for you:
ta: நீங்கள் தீய பயன்பாடு செய்தால், வெளியேற வேண்டாம்! உங்களுக்கான சில ஆலோசனைகள் இங்கே:

source: If your country is missing here and you know a lawyer who can provide a legal opinion, please get in contact with the Tor Project.
ta: உங்கள் நாடு இங்கே காணவில்லை மற்றும் சட்டபூர்வமான கருத்தை வழங்கக்கூடிய ஒரு வழக்கறிஞரை நீங்கள் அறிந்திருந்தால், தயவுசெய்து TOR திட்டத்துடன் தொடர்பு கொள்ளுங்கள்.

source: In addition to the [templates at Torservers.net](https://www.torservers.net/wiki/abuse/templates), you can find many more templates for various scenarios on the [Tor Abuse Templates](../tor-abuse-templates/).
ta: [வார்ப்புருக்கள் torservers.net] (https://www.torservers.net/wiki/abuse/templates) க்கு கூடுதலாக, [டோர் தீய பயன்பாடு வார்ப்புருக்கள்] (../ டோர்-புச்-டெம்பிளேட்டுகள்/) இல் பல்வேறு காட்சிகளுக்கு இன்னும் பல வார்ப்புருக்களைக் காணலாம்.

source: In any case, add the ISP to the [GoodBadISPs](../good-bad-isps/) page.
ta: எப்படியிருந்தாலும், [குட் பேடிச்ப்ச்] (../ நல்ல-பேட்-இச்/) பக்கத்தில் ஐ.எச்.பி சேர்க்கவும்.

source: In your reply, state clearly that you are not liable for forwarded content passing through your machine, and include the relevant legal references for your country.
ta: உங்கள் பதிலில், உங்கள் இயந்திரத்தின் வழியாக அனுப்பப்பட்ட உள்ளடக்கத்திற்கு நீங்கள் பொறுப்பல்ல என்பதை தெளிவாகக் கூறி, உங்கள் நாட்டிற்கான தொடர்புடைய சட்டரீதியான குறிப்புகளைச் சேர்க்கவும்.

source: It is exceptionally rare to encounter a scenario where none of these templates apply.
ta: இந்த வார்ப்புருக்கள் எதுவும் பொருந்தாத ஒரு காட்சியை எதிர்கொள்வது விதிவிலக்காக அரிது.

source: It's way better for them to hear about Tor from you, in a relaxed environment, than to hear about it from a stranger over the phone. Make them aware of [EFF's Legal FAQ for Tor Operators](../eff-tor-legal-faq). EFF has also offered to talk to other lawyers to explain the legal aspects of Tor.
ta: தொலைபேசியில் ஒரு அந்நியரிடமிருந்து அதைப் பற்றி கேட்பதை விட, உங்களிடமிருந்து, நிதானமான சூழலில், அவர்கள் உங்களிடமிருந்து பற்றி கேட்பது நல்லது. [டோர் ஆபரேட்டர்களுக்கான EFF இன் சட்ட கேள்விகள்] (../ EFF-TOR-LEGAL-FAQ) பற்றி அவர்களுக்கு தெரியப்படுத்துங்கள். TOR இன் சட்ட அம்சங்களை விளக்க மற்ற வழக்கறிஞர்களுடன் பேசவும் EFF முன்வந்தது.

source: NOTE:
ta: குறிப்பு:

source: Once you identified your ISP, you can follow the two-step advice of TorServers.net.
ta: உங்கள் ISP ஐ நீங்கள் கண்டறிந்ததும், torservers.net இன் இரண்டு-படி ஆலோசனையைப் பின்பற்றலாம்.

source: One of the biggest reasons exit relays disappear is because the people answering the abuse address get nervous and ask you to stop.
ta: வெளியேறும் ரிலேக்கள் மறைந்துவிடும் மிகப்பெரிய காரணங்களில் ஒன்று, துச்பிரயோக முகவரியுக்கு பதிலளிக்கும் நபர்கள் பதட்டமாகி உங்களை நிறுத்தச் சொல்கிறார்கள்.

source: Our aim is to provide a general description of the legal issues surrounding Tor exit relaying.
ta: டோர் எக்சிட் ரிலேங்கைச் சுற்றியுள்ள சட்ட சிக்கல்களின் பொதுவான விளக்கத்தை வழங்குவதே எங்கள் நோக்கம்.

source: Please add your country's regulations to this list.
ta: இந்த பட்டியலில் உங்கள் நாட்டின் விதிமுறைகளைச் சேர்க்கவும்.

source: Please read all the technical details before getting started. If you have any questions or need help, please contact us at [tor-relays](https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-relays).
ta: தொடங்குவதற்கு முன் அனைத்து தொழில்நுட்ப விவரங்களையும் படியுங்கள். உங்களிடம் ஏதேனும் கேள்விகள் இருந்தால் அல்லது உதவி தேவைப்பட்டால், தயவுசெய்து எங்களை [TOR-RELAYS] (https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-dorelays) இல் தொடர்பு கொள்ளவும்.

source: Roughly 80% are automated reports, and the rest is usually satisfied with [our default reply](https://www.torservers.net/wiki/abuse/templates).
ta: ஏறக்குறைய 80% தானியங்கி அறிக்கைகள், மீதமுள்ளவை பொதுவாக [எங்கள் இயல்புநிலை பதிலில்] நிறைவு அடைகின்றன (https://www.torservers.net/wiki/abuse/templates).

source: The [Reduced Exit Policy](https://trac.torproject.org/projects/tor/wiki/doc/ReducedExitPolicy) is an alternative to the default exit policy. It allows many Internet services while still blocking the majority of TCP ports.
ta: [குறைக்கப்பட்ட வெளியேறும் கொள்கை] (https://trac.torproject.org/projects/tor/wiki/doc/reducexitpolicy) இயல்புநிலை வெளியேறும் கொள்கைக்கு மாற்றாகும். இது பல இணைய சேவைகளை அனுமதிக்கிறது, அதே நேரத்தில் பெரும்பாலான TCP துறைமுகங்களைத் தடுக்கிறது.

source: The people from Torservers.net in Germany found a lawyer who would agree to "host" them inside his office.
ta: செர்மனியில் உள்ள டோர்சர்வர்ச்.நெட்டில் இருந்து வந்தவர்கள் ஒரு வழக்கறிஞரைக் கண்டுபிடித்தனர், அவர் தனது அலுவலகத்திற்குள் "புரவலன்" செய்ய ஒப்புக்கொள்வார்.

source: The setup process was easy and cheap. Similar setups probably exist for your country.
ta: அமைவு செயல்முறை எளிதானது மற்றும் மலிவானது. இதேபோன்ற அமைப்புகள் உங்கள் நாட்டிற்கு இருக்கலாம்.

source: The two-step process usually helps in elevating your request to higher levels of support staff without scaring them off too early, even if you don't end up with your own IP range. Here is template you can use: [Inquiry](https://www.torservers.net/wiki/hoster/inquiry)
ta: உங்கள் சொந்த ஐபி வரம்பில் நீங்கள் முடிவடையாவிட்டாலும் கூட, உங்கள் கோரிக்கையை அதிக அளவில் பயமுறுத்தாமல் அதிக அளவிலான உதவி ஊழியர்களுக்கு உயர்த்த இரண்டு-படி செயல்முறை பொதுவாக உதவுகிறது. நீங்கள் பயன்படுத்தக்கூடிய வார்ப்புரு இங்கே: [விசாரணை] (https://www.torservers.net/wiki/hoster/inquiry)

source: These guidelines are meant to give you a quick introduction into the business of running your own exit relay.
ta: இந்த வழிகாட்டுதல்கள் உங்கள் சொந்த வெளியேறும் ரிலேவை இயக்கும் வணிகத்தில் விரைவான அறிமுகத்தை உங்களுக்கு வழங்குவதாகும்.

source: They are now are a non-profit association ("eingetragener Verein, gemeinnutzig") registered inside a lawyer's office.
ta: அவை இப்போது ஒரு வழக்கறிஞர் அலுவலகத்திற்குள் பதிவுசெய்யப்பட்ட ஒரு இலாப நோக்கற்ற சங்கம் ("பதிவுசெய்யப்பட்ட சங்கம், நலன்புரி அல்லாதவை").
