Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: This FAQ is for informational purposes only and does not constitute legal advice.
ta: இந்த கேள்விகள் செய்தி நோக்கங்களுக்காக மட்டுமே மற்றும் சட்ட ஆலோசனையை உருவாக்கவில்லை.

source: This drastically reduces the odds that a Bittorrent user will select your node and thus reduces or even eliminates the number of [DMCA complaints](../eff-tor-legal-faq/tor-dmca-response/) you will receive.
ta: இது ஒரு பிட்டோரண்ட் பயனர் உங்கள் முனையைத் தேர்ந்தெடுக்கும் முரண்பாடுகளை வெகுவாகக் குறைக்கிறது, இதனால் நீங்கள் பெறும் [டி.எம்.சி.ஏ புகார்களின்] எண்ணிக்கையை (../ எஃப்-டோர்-லெகல்-ஃபாக்/டோர்-டி.எம்.சி.ஏ-பதில்/) குறைக்கிறது அல்லது நீக்குகிறது.

source: To find an ISP, go through forums and sites where ISPs posts their latest deals, and contact them about Tor hosting.
ta: ஒரு ஐ.எச்.பி கண்டுபிடிக்க, ஐ.எச்.பி.எச் அவர்களின் அண்மைக் கால ஒப்பந்தங்களை இடுகையிடும் மன்றங்கள் மற்றும் தளங்கள் வழியாகச் சென்று, டோர் ஓச்டிங் பற்றி அவர்களைத் தொடர்பு கொள்ளுங்கள்.

source: TorServers.net is a fairly large Tor exit operator and we receive only a very small number of complaints, especially compared to the amount of traffic we push.
ta: Torservers.net என்பது மிகவும் பெரிய டோர் வெளியேறும் ஆபரேட்டர் மற்றும் மிகக் குறைந்த எண்ணிக்கையிலான புகார்களை மட்டுமே பெறுகிறோம், குறிப்பாக நாம் தள்ளும் போக்குவரத்தின் அளவோடு ஒப்பிடுகையில்.

source: Torservers.net uses a free German fax-to-email service, call-manager.de, and a VoIP number from Sipgate.de.
ta: Torservers.net ஒரு இலவச செர்மன் தொலைநகல்-க்கு-எமெயில் பணி, அழைப்பு-மேலாளர்.

source: We are not aware of any case that made it near a court, and we will do everything in our power to support you if it does.
ta: நீதிமன்றத்தின் அருகே அதை உருவாக்கிய எந்தவொரு வழக்கையும் நாங்கள் அறிந்திருக்கவில்லை, அதைச் செய்தால் உங்களை ஆதரிக்க எங்கள் சக்தியில் உள்ள அனைத்தையும் செய்வோம்.

source: We have not needed the input of a lawyer in many years of operation following the advice on this page.
ta: இந்த பக்கத்தில் உள்ள ஆலோசனையைப் பின்பற்றி பல ஆண்டு செயல்பாட்டில் ஒரு வழக்கறிஞரின் உள்ளீடு எங்களுக்கு தேவையில்லை.

source: We very much need diversity, and it does not help if we pool too many exits at one friendly ISP.
ta: எங்களுக்கு மிகவும் பன்முகத்தன்மை தேவை, மேலும் ஒரு நட்பு ஐ.எச்.பியில் அதிகமான வெளியேறல்களை நாங்கள் சேகரித்தால் அது உதவாது.

source: You can also add comments to your range, hinting at your usage as anonymization service ([Example](https://apps.db.ripe.net/search/query.html?searchtext=ZWIEBELFREUNDE)).
ta: உங்கள் வரம்பில் கருத்துகளைச் சேர்க்கலாம், உங்கள் பயன்பாட்டை அநாமதேய பணி எனக் குறிப்பிடலாம் ([எடுத்துக்காட்டு] (https://apps.db.ripe.net/search/query.html?searchtext=zwiebelfreunde)).

source: You can look up if an IP address was listed as an exit relay at a given time at [ExoneraTor](https://exonerator.torproject.org/). Point to that website in your reply to the complaint.
ta: ஒரு குறிப்பிட்ட நேரத்தில் [எக்சோனரேட்டர்] (https://exonerator.torproject.org/) ஒரு குறிப்பிட்ட நேரத்தில் வெளியேறும் ரிலே என பட்டியலிடப்பட்டிருந்தால் நீங்கள் பார்க்கலாம். புகாருக்கான உங்கள் பதிலில் அந்த வலைத்தளத்தை சுட்டிக்காட்டவும்.

source: Quick introduction into running your Exit relay
ta: உங்கள் வெளியேறும் ரிலேவை இயக்க விரைவான அறிமுகம்

source: Tor Exit Guidelines
ta: வெளியேறும் வழிகாட்டுதல்கள்

source: ## Mailing list
ta: ## அஞ்சல் பட்டியல்

source: (Tor can handle a variety of rate limiting approaches, so this isn't the end of the world).
ta: (டோர் பலவிதமான விகிதத்தைக் கட்டுப்படுத்தும் அணுகுமுறைகளை கையாள முடியும், எனவே இது உலகின் முடிவு அல்ல).

source: (We focus on the university scenario, but hopefully you can adapt it to your own situation.)
ta: (நாங்கள் பல்கலைக்கழக சூழ்நிலையில் கவனம் செலுத்துகிறோம், ஆனால் அதை உங்கள் சொந்த சூழ்நிலைக்கு ஏற்றவாறு மாற்றலாம்.)

source: * Fifth, start finding allies.
ta: * ஐந்தாவது, கூட்டாளிகளைக் கண்டுபிடிக்கத் தொடங்குங்கள்.

source: * First, learn about your university's AUP -- acceptable use policy.
ta: * முதலில், உங்கள் பல்கலைக்கழகத்தின் AUP - ஏற்றுக்கொள்ளக்கூடிய பயன்பாட்டுக் கொள்கை பற்றி அறிக.

source: * Fourth, learn a bit about authentication on the Internet.
ta: * நான்காவது, இணையத்தில் அங்கீகாரத்தைப் பற்றி கொஞ்சம் கற்றுக்கொள்ளுங்கள்.

source: * Second, learn about your local laws with respect to liability of traffic that exits from your Tor relay.
ta: * இரண்டாவதாக, உங்கள் டோர் ரிலேவிலிருந்து வெளியேறும் போக்குவரத்தின் பொறுப்பு தொடர்பாக உங்கள் உள்ளக சட்டங்களைப் பற்றி அறிக.

source: * Seventh, teach your network security people about Tor.
ta: * ஏழாவது, உங்கள் பிணையம் பாதுகாப்பு நபர்களுக்கு டோர் பற்றி கற்பிக்கவும்.

source: * Sixth, teach your university's lawyers about Tor.
ta: * ஆறாவது, உங்கள் பல்கலைக்கழகத்தின் வழக்கறிஞர்களுக்கு டோர் பற்றி கற்பிக்கவும்.

source: * Third, learn about Tor's design.
ta: * மூன்றாவதாக, டோரின் வடிவமைப்பைப் பற்றி அறிந்து கொள்ளுங்கள்.

source: Ask for advice from everybody you meet who likes the idea, and try to work your way up the chain to get as many good allies as you can in as many areas as you can.
ta: யோசனையை விரும்பும் நீங்கள் சந்திக்கும் அனைவரிடமிருந்தும் ஆலோசனையைக் கேளுங்கள், மேலும் உங்களால் முடிந்தவரை பல பகுதிகளில் உங்களால் முடிந்தவரை நல்ல கூட்டாளிகளைப் பெற சங்கிலியை நோக்கிச் செல்ல முயற்சிக்கவும்.

source: Avoid having actual meetings or long email discussions, and make it clear that you don't need their official legal opinion yet.
ta: உண்மையான கூட்டங்கள் அல்லது நீண்ட மின்னஞ்சல் கலந்துரையாடல்களைத் தவிர்க்கவும், அவற்றின் அதிகாரப்பூர்வ சட்டக் கருத்து உங்களுக்கு இன்னும் தேவையில்லை என்பதை தெளிவுபடுத்துங்கள்.

source: Avoid putting them on the spot or formally asking permission: most network security people will like the idea of Tor in theory, but they won't be in a position to "authorize" your Tor relay.
ta: அவற்றை அந்த இடத்திலேயே வைப்பதைத் தவிர்க்கவும் அல்லது முறையாக இசைவு கேட்பது: பெரும்பாலான பிணையம் பாதுகாப்பு நபர்கள் கோட்பாட்டில் டோர் யோசனையை விரும்புவார்கள், ஆனால் அவர்கள் உங்கள் டோர் ரிலேவை "அங்கீகரிக்கும்" நிலையில் இருக்க மாட்டார்கள்.

source: Be helpful and take the opportunity to explain to them about Tor and why it's useful to the world. (If they contact you directly for logs, you should send them to your university's lawyers -- acting on it yourself is [almost always a poor idea](../eff-tor-legal-faq/)).
ta: உதவியாக இருங்கள் மற்றும் டோர் பற்றி அவர்களுக்கு விளக்க வாய்ப்பைப் பெறுங்கள், அது ஏன் உலகிற்கு பயனுள்ளதாக இருக்கும். .

source: Become familiar with [the EFF's template letter regarding DMCA notices for Tor](../eff-tor-legal-faq/tor-dmca-response/), which is quite clear about not putting liability on service providers.
ta: [TOR க்கான DMCA அறிவிப்புகள் தொடர்பான EFF இன் வார்ப்புரு கடிதம்] (../ EFF-TOR-LEGAL-FAQ/TOR-DMCA-RESPONSE/), இது பணி வழங்குநர்களுக்கு பொறுப்பை ஏற்படுத்தாதது குறித்து மிகவும் தெளிவாக உள்ளது.

source: Becoming friends with the lawyers early in the process will avoid situations where they need to learn about everything and make a decision in one day.
ta: இந்த செயல்முறையின் ஆரம்பத்தில் வக்கீல்களுடன் நட்பு கொள்வது அவர்கள் எல்லாவற்றையும் பற்றி அறிந்து கொள்ள வேண்டிய சூழ்நிலைகளைத் தவிர்த்து, ஒரே நாளில் முடிவெடுக்கும்.

source: But it might be extremely restrictive ("no services of any kind"), in which case you're going to have a tough road ahead of you.
ta: ஆனால் இது மிகவும் கட்டுப்படுத்தப்பட்டதாக இருக்கலாம் ("எந்த வகையான சேவைகளும் இல்லை"), இந்த விசயத்தில் நீங்கள் உங்களுக்கு முன்னால் ஒரு கடினமான சாலையை நடத்தப் போகிறீர்கள்.

source: First, you should follow the tips in the [Tor relay documentation](../../), such as picking a descriptive hostname or getting your own IP address.
ta: முதலில், நீங்கள் ஒரு விளக்க ஓச்ட்பெயரைத் தேர்ந்தெடுப்பது அல்லது உங்கள் சொந்த ஐபி முகவரியைப் பெறுவது போன்ற [டோர் ரிலே ஆவணங்கள்] (../../) இல் உள்ள உதவிக்குறிப்புகளைப் பின்பற்ற வேண்டும்.

source: Hang out on IRC ([irc.oftc.net](https://www.oftc.net) - #tor-relays) for a while and learn more.
ta: ஐ.ஆர்.சி ([irc.oftc.net] (https://www.oftc.net) - #TOR -RELAYS) இல் சிறிது நேரம் ஏங் அவுட் செய்து மேலும் அறிக.

source: If possible, attend a talk by one of the Tor developers.
ta: முடிந்தால், டோர் டெவலப்பர்களில் ஒருவரின் பேச்சில் கலந்து கொள்ளுங்கள்.

source: If that doesn't work, you can scale back the advertised speed of your relay, by using the `MaxAdvertisedBandwidth` to attract less traffic from the Tor network. Lastly, you can scale back your exit policy.
ta: அது வேலை செய்யவில்லை என்றால், டோர் நெட்வொர்க்கிலிருந்து குறைந்த போக்குவரத்தை ஈர்க்க `MaxadververtisedBandWidth` ஐப் பயன்படுத்துவதன் மூலம், உங்கள் ரிலேயின் விளம்பரப்படுத்தப்பட்ட வேகத்தை நீங்கள் அளவிடலாம். கடைசியாக, உங்கள் வெளியேறும் கொள்கையை நீங்கள் அளவிடலாம்.

source: If the administration considers an Internet community that helps other people to be a foreign concept, or if they're used to treating new situations as security risks and telling everybody to quit it, a Tor relay may give you a way to focus the discussion and find allies who want to help change policy.
ta: மற்றவர்கள் ஒரு வெளிநாட்டு கருத்தாக இருக்க உதவும் ஒரு இணைய சமூகத்தை நிர்வாகம் கருதினால், அல்லது புதிய சூழ்நிலைகளை பாதுகாப்பு அபாயங்களாகக் கருதுவதற்கும், அதை விட்டு வெளியேறும்படி அனைவரையும் சொன்னால், ஒரு டோர் ரிலேவும் விவாதத்தை மையப்படுத்த ஒரு வழியைக் கொடுக்கக்கூடும் கொள்கையை மாற்ற உதவ விரும்பும் கூட்டாளிகளைக் கண்டறியவும்.

source: If the authorities contact your university for logs, be pleasant and helpful.
ta: பதிவுகள் உங்கள் பல்கலைக்கழகத்தை அதிகாரிகள் தொடர்பு கொண்டால், இனிமையாகவும் உதவியாகவும் இருங்கள்.

source: If the university's entire IP address space is "trusted" to access these library resources, the university is forced to maintain an iron grip on all its addresses.
ta: இந்த நூலக வளங்களை அணுக பல்கலைக்கழகத்தின் முழு ஐபி முகவரி இடமும் "நம்பகமானதாக" இருந்தால், பல்கலைக்கழகம் அதன் அனைத்து முகவரிகளிலும் இரும்பு பிடியை பராமரிக்க வேண்டிய கட்டாயத்தில் உள்ளது.

source: If there are too many complaints coming in, there are several approaches you can take to reduce them.
ta: அதிகமான புகார்கள் வந்தால், அவற்றைக் குறைக்க நீங்கள் எடுக்கக்கூடிய பல அணுகுமுறைகள் உள்ளன.

source: If they have concerns, or raise questions that you don't know how to answer, work with them to figure out the answers and make them happy.
ta: அவர்களுக்கு கவலைகள் இருந்தால், அல்லது உங்களுக்கு எவ்வாறு பதிலளிக்க வேண்டும் என்று உங்களுக்குத் தெரியாத கேள்விகளை எழுப்பினால், பதில்களைக் கண்டுபிடித்து அவர்களை மகிழ்ச்சியடையச் செய்யுங்கள்.

source: If you have a law school nearby, meet the professors that teach the Internet law classes, and chat with them about Tor and its implications.
ta: உங்களிடம் அருகில் ஒரு சட்டப் பள்ளி இருந்தால், இணைய சட்ட வகுப்புகளை கற்பிக்கும் பேராசிரியர்களைச் சந்தித்து, டோர் மற்றும் அதன் தாக்கங்கள் குறித்து அவர்களுடன் அரட்டையடிக்கவும்.

source: If your school has a botnet research group or studies Internet attacks (like at Georgia Tech and UCSD), meet them and learn more about all the scary things already out there on the Internet.
ta: உங்கள் பள்ளியில் போட்நெட் ஆராய்ச்சி குழு இருந்தால் அல்லது இணைய தாக்குதல்களைப் படித்தால் (சார்சியா டெக் மற்றும் யு.சி.எச்.டி போன்றவை), அவற்றைச் சந்தித்து இணையத்தில் ஏற்கனவே இருக்கும் அனைத்து பயங்கரமான விசயங்களையும் பற்றி மேலும் அறிக.

source: In any case, the key here is to become familiar with the laws and their implications and uncertainties.
ta: எவ்வாறாயினும், சட்டங்கள் மற்றும் அவற்றின் தாக்கங்கள் மற்றும் நிச்சயமற்ற தன்மைகளை நன்கு அறிந்திருப்பதே இங்கே முக்கியமானது.

source: In short, running a Tor exit node may well require you to become an advocate for anonymity and privacy in the world.
ta: சுருக்கமாக, ஒரு டோர் வெளியேறும் முனையை இயக்குவது உலகில் பெயர் மற்றும் தனியுரிமைக்கான வக்கீலாக மாற வேண்டும்.

source: In some cases, you should talk to the network security people before you talk to the lawyers; in some cases, there will be yet other groups that will be critical to educate and bring into the discussion. You'll have to make it up as you go.
ta: சில சந்தர்ப்பங்களில், நீங்கள் வழக்கறிஞர்களுடன் பேசுவதற்கு முன்பு பிணையம் பாதுகாப்பு நபர்களுடன் பேச வேண்டும்; சில சந்தர்ப்பங்களில், இன்னும் பிற குழுக்கள் இருக்கும், அவை கல்வி கற்பதற்கும் விவாதத்திற்கு கொண்டு வருவதற்கும் முக்கியமானதாக இருக்கும். நீங்கள் செல்லும்போது அதை உருவாக்க வேண்டும்.

source: In the US, these appear to be mainly the [DMCA](../eff-tor-legal-faq/) and [CDA](../eff-tor-legal-faq/), and the good news is that many lawyers believe that Tor exit node operators are in the same boat as the ISPs themselves.
ta: அமெரிக்காவில், இவை முக்கியமாக [டி.எம்.சி.ஏ] (../ எஃப்-டோர்-லெகல்-ஃபாக்/) மற்றும் [சி.டி.ஏ] (../ எஃப்-டோர்-லெகல்-ஃபாக்/) என்று தோன்றுகிறது, மேலும் நல்ல செய்தி என்னவென்றால், பல வழக்கறிஞர்கள் டோர் வெளியேறும் முனை ஆபரேட்டர்கள் ஐ.எச்.பி.எச்.

source: In this sense, Tor provides a lever to help you change your organization's policies.
ta: இந்த அர்த்தத்தில், டோர் உங்கள் நிறுவனத்தின் கொள்கைகளை மாற்ற உதவும் ஒரு நெம்புகோலை வழங்குகிறது.

source: Learn about the types of people and organizations who need secure communications on the Internet.
ta: இணையத்தில் பாதுகாப்பான தகவல்தொடர்புகள் தேவைப்படும் நபர்கள் மற்றும் அமைப்புகளின் வகைகளைப் பற்றி அறிக.

source: Make it clear that you're willing to work with them to make sure it isn't too much hassle on their part; for example, they can pass complaints directly on to you if they like.
ta: அவர்களின் பங்கில் இது மிகவும் தொந்தரவாக இல்லை என்பதை உறுதிப்படுத்த நீங்கள் அவர்களுடன் பணியாற்ற தயாராக இருக்கிறீர்கள் என்பதை தெளிவுபடுத்துங்கள்; உதாரணமாக, அவர்கள் விரும்பினால் அவர்கள் நேரடியாக புகார்களை அனுப்பலாம்.

source: Make sure to keep these discussions informal and small -- invite one of the general counsel out to coffee to discuss "something neat that may come up later on." Feel free to bring along one of the allies you found above, if it makes you more comfortable.
ta: இந்த விவாதங்களை முறைசாரா மற்றும் சிறியதாக வைத்திருப்பதை உறுதிசெய்து கொள்ளுங்கள் - பொது ஆலோசனையில் ஒன்றை காபிக்கு அழைக்கவும், "பின்னர் வரவிருக்கும் சுத்தமாக ஏதாவது" பற்றி விவாதிக்க. நீங்கள் மேலே கண்ட கூட்டாளிகளில் ஒன்றை கொண்டு வர தயங்க, அது உங்களுக்கு மிகவும் வசதியாக இருந்தால்.

source: Many library-related services use source IP address to decide whether a subscriber is allowed to see their content.
ta: பல நூலக தொடர்பான சேவைகள் மூல ஐபி முகவரியைப் பயன்படுத்தி சந்தாதாரர் தங்கள் உள்ளடக்கத்தைக் காண அனுமதிக்கப்படுகிறார்களா என்பதை தீர்மானிக்க.

source: Most likely it is ambiguously worded, to let them allow or deny things based on the situation.
ta: சூழ்நிலையின் அடிப்படையில் விசயங்களை அனுமதிக்க அல்லது மறுக்க அனுமதிக்க, இது தெளிவற்ற சொல்லப்பட்டதாகும்.

source: Note that in many cases you don't even need to be researching the exit node itself -- doing research on the Tor network requires that there be a Tor network, after all, and keeping it going is a community effort.
ta: பல சந்தர்ப்பங்களில் நீங்கள் வெளியேறும் முனையை கூட ஆராய்ச்சி செய்யத் தேவையில்லை என்பதை நினைவில் கொள்க - டோர் நெட்வொர்க்கில் ஆராய்ச்சி செய்ய ஒரு டோர் பிணையம் இருக்க வேண்டும், எல்லாவற்றிற்கும் மேலாக, அதைத் தொடர்ந்து வைத்திருப்பது ஒரு சமூக முயற்சி.

source: Of course, you need to understand that without actual clear precedent (and even then), it's still possible that a given judge will not interpret things the way the lawyers expect.
ta: நிச்சயமாக, உண்மையான தெளிவான முன்மாதிரி இல்லாமல் (அதுவும் கூட), கொடுக்கப்பட்ட நீதிபதி வழக்கறிஞர்கள் எதிர்பார்க்கும் விதத்தை விளக்கமாட்டார் என்பது இன்னும் சாத்தியம் என்பதை நீங்கள் புரிந்து கொள்ள வேண்டும்.

source: On the other hand, universities like Berkeley simply add a "no proxies" line to their network policies, and are stuck in a battle to patrol every address on their network.
ta: மறுபுறம், பெர்க்லி போன்ற பல்கலைக்கழகங்கள் தங்கள் பிணையம் கொள்கைகளுக்கு "ப்ராக்சிகள் இல்லை" வரியைச் சேர்க்கிறது, மேலும் அவர்களின் நெட்வொர்க்கில் உள்ள ஒவ்வொரு முகவரியிலும் சுற்று செல்வதற்கான போரில் சிக்கியுள்ளன.

source: Practice explaining Tor and its benefits and consequences to friends and neighbors -- the [abuse FAQ](https://2019.www.torproject.org/faq-abuse) may provide some helpful starting points.
ta: நண்பர்கள் மற்றும் அண்டை நாடுகளுக்கு டோர் மற்றும் அதன் நன்மைகள் மற்றும் விளைவுகளை விளக்கும் பயிற்சி-[துச்பிரயோகம் கேள்விகள்] (https://2019.www.torproject.org/faq- uspuse) சில பயனுள்ள தொடக்க புள்ளிகளை வழங்கக்கூடும்.

source: Read the [design overview](https://2019.www.torproject.org/overview.html), the [design paper](https://svn-archive.torproject.org/svn/projects/design-paper/tor-design.pdf), and the [FAQ](https://2019.www.torproject.org/docs/faq.html.en).
ta: [வடிவமைப்பு கண்ணோட்டம்](https://2019.www.torproject.org/overview.html), [வடிவமைப்புக் காகிதம்](https://svn-archive.torproject.org/svn/projects/design-paper/tor-design.pdf), மற்றும் [கேள்விகள்](https://2019.www.torproject.org/docs/faq.html.en).

source: Remember that lawyers are paid to say no unless they have a reason to say yes, so when the time finally comes to ask their opinion on running a Tor exit node, make sure the question is not "are there any liability issues?", but rather "we'd like to do this, can you help us avoid the biggest issues?" Try to predict what they will say, and try to gain allies among the lawyers who like your cause and want to help.
ta: டோர் வெளியேறும் முனையை இயக்குவது குறித்து தங்கள் கருத்தைக் கேட்க நேரம் வரும்போது, "ஏதேனும் பொறுப்பு சிக்கல்கள் இல்லையா?", ஆனால் மாறாக "நாங்கள் இதைச் செய்ய விரும்புகிறோம், மிகப்பெரிய சிக்கல்களைத் தவிர்க்க எங்களுக்கு உதவ முடியுமா?" அவர்கள் என்ன சொல்வார்கள் என்று கணிக்க முயற்சி செய்யுங்கள், மேலும் உங்கள் காரணத்தை விரும்பும் மற்றும் உதவ விரும்பும் வழக்கறிஞர்களிடையே கூட்டாளிகளைப் பெற முயற்சிக்கவும்.

source: Remember that lawyers don't like being told how to interpret laws by a non-lawyer, but they are often pleased to hear that other lawyers have done a lot of the research and leg-work (this is where [the EFF's legal FAQ](../eff-tor-legal-faq/) comes in, along with your law school contacts if you found any).
ta: ஒரு வழக்கறிஞர் அல்லாதவர் சட்டங்களை எவ்வாறு விளக்குவது என்று வழக்கறிஞர்கள் விரும்பவில்லை என்பதை நினைவில் கொள்ளுங்கள், ஆனால் மற்ற வழக்கறிஞர்கள் நிறைய ஆராய்ச்சி மற்றும் கால்-வேலைகளைச் செய்திருப்பதைக் கேட்டு அவர்கள் அடிக்கடி மகிழ்ச்சியடைகிறார்கள் (இங்குதான் [EFF இன் சட்டரீதியான கேள்விகள்] (../ EFF-TOR-LEGAL-FAQ/) உங்கள் சட்ட பள்ளி தொடர்புகளுடன் நீங்கள் ஏதேனும் கண்டுபிடிக்கப்பட்டால்).

source: So Harvard doesn't need to be as worried about what other services are running on their network, and it also takes care of off-campus students and faculty.
ta: எனவே ஆர்வர்ட் தங்கள் நெட்வொர்க்கில் மற்ற சேவைகள் என்ன இயங்குகின்றன என்பதைப் பற்றி கவலைப்படத் தேவையில்லை, மேலும் இது வளாகத்திற்கு வெளியே மாணவர்கள் மற்றும் ஆசிரியர்களையும் கவனித்துக்கொள்கிறது.

source: So if you're interested, you might want to get that started early in the process -- see our [Research Portal](https://research.torproject.org/).
ta: எனவே நீங்கள் ஆர்வமாக இருந்தால், செயல்பாட்டின் ஆரம்பத்தில் தொடங்க நீங்கள் விரும்பலாம் - எங்கள் [ஆராய்ச்சி போர்ட்டலைப் பார்க்கவும்] (https://research.torproject.org/).

source: Some people have found that their university only tolerates their Tor relay if they're involved in a research project around anonymity.
ta: சிலர் தங்கள் பல்கலைக்கழகம் அநாமதேயத்தைச் சுற்றியுள்ள ஒரு ஆராய்ச்சி திட்டத்தில் ஈடுபட்டால் மட்டுமே தங்கள் டோர் ரிலேவை பொறுத்துக்கொள்கிறது என்பதைக் கண்டறிந்துள்ளனர்.

source: Subscribe to [Tor Relays Universities](https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-relays-universities) mailing list (and other education institutions too).
ta: [டோர் ரிலேச் பல்கலைக்கழகங்கள்] (https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-relays-universities) அஞ்சல் பட்டியல் (மற்றும் பிற கல்வி நிறுவனங்களும்) குழுசேரவும்.

source: Take them out to coffee to explain Tor and let them know that you are planning to run a Tor server.
ta: TOR ஐ விளக்க அவர்களை காபிக்கு அழைத்துச் சென்று, நீங்கள் ஒரு TOR சேவையகத்தை இயக்க திட்டமிட்டுள்ளீர்கள் என்பதை அவர்களுக்குத் தெரியப்படுத்துங்கள்.

source: The CDA is less clear, because it was written before the modern Internet emerged, but EFF and ACLU are optimistic.
ta: சி.டி.ஏ குறைவாக தெளிவாக உள்ளது, ஏனெனில் இது நவீன இணையம் வெளிவருவதற்கு முன்பே எழுதப்பட்டது, ஆனால் EFF மற்றும் ACLU ஆகியவை நம்பிக்கையுடன் உள்ளன.

source: The best strategy depends on your situation, but here are some tips to get you started.
ta: சிறந்த மூலோபாயம் உங்கள் நிலைமையைப் பொறுத்தது, ஆனால் நீங்கள் தொடங்க சில குறிப்புகள் இங்கே.

source: The downside is that your Tor relay's existence is more fragile, since the terms of its demise are already negotiated.
ta: தீங்கு என்னவென்றால், உங்கள் டோர் ரிலேவின் இருப்பு மிகவும் பலவீனமானது, ஏனெனில் அதன் மறைவின் விதிமுறைகள் ஏற்கனவே பேச்சுவார்த்தை நடத்தப்படுகின்றன.

source: These people are already overworked, and anything you can do to keep work off their plate will make everybody happier.
ta: இந்த நபர்கள் ஏற்கனவே அதிக வேலை செய்கிறார்கள், மேலும் அவர்களின் தட்டில் இருந்து வேலையை வைத்திருக்க நீங்கள் செய்யக்கூடியது அனைவரையும் மகிழ்ச்சியாக மாற்றும்.

source: This approach has the added benefit that you can draw in other faculty and students in the process.
ta: இந்த அணுகுமுறை மற்ற ஆசிரியர்களிடமும் மாணவர்களிடமும் நீங்கள் ஈர்க்கக்கூடிய கூடுதல் நன்மையைக் கொண்டுள்ளது.

source: This may seem like a risky move, but it's way better for them to hear about Tor from you, in a relaxed environment, than to hear about it from a stranger over the phone.
ta: இது ஒரு ஆபத்தான நடவடிக்கை போல் தோன்றலாம், ஆனால் தொலைபேசியில் ஒரு அந்நியரிடமிருந்து அதைப் பற்றி கேட்பதை விட, உங்களிடமிருந்து டோர் பற்றி, நிதானமான சூழலில் அவர்கள் கேட்பது நல்லது.

source: To keep your exit node running long-term, you're going to need the support of the people around you.
ta: உங்கள் வெளியேறும் முனை நீண்ட காலமாக இயங்குவதற்கு, உங்களைச் சுற்றியுள்ளவர்களின் உதவி உங்களுக்குத் தேவைப்படும்.

source: Tor's default log level doesn't provide much that's useful, so if they want copies of your logs, that's fine.
ta: டோரின் இயல்புநிலை பதிவு நிலை பயனுள்ளதாக இல்லை, எனவே அவர்கள் உங்கள் பதிவுகளின் நகல்களை விரும்பினால், அது நல்லது.

source: Universities like Harvard do the smart thing: their students and faculty have actual methods to authenticate -- say, certificates, or usernames and passwords -- to a central Harvard server and access the library resources from there.
ta: ஆர்வர்ட் போன்ற பல்கலைக்கழகங்கள் அறிவுள்ள காரியத்தைச் செய்கின்றன: அவர்களின் மாணவர்களுக்கும் ஆசிரியர்களுக்கும் அங்கீகரிக்க உண்மையான முறைகள் உள்ளன - சான்றிதழ்கள், அல்லது பயனர்பெயர்கள் மற்றும் கடவுச்சொற்கள் - நடு ஆர்வர்ட் சேவையகத்திற்கு மற்றும் அங்கிருந்து நூலக வளங்களை அணுகவும்.

source: We should encourage all these networks to move to an end-to-end authentication model rather than conflating network location with who's on the other end.
ta: பிணையம் இருப்பிடத்தை மறுமுனையில் யாருடன் முரண்படுவதை விட இந்த நெட்வொர்க்குகள் அனைத்தும் இறுதி முதல் இறுதி அங்கீகார மாதிரிக்கு செல்ல ஊக்குவிக்க வேண்டும்.

source: You aren't going to keep your Tor exit node a secret from them for long anyway, and like with the lawyers, hearing it from you is way better than hearing it from a stranger on the phone.
ta: உங்கள் டோர் வெளியேறும் முனையை அவர்களிடமிருந்து எப்படியாவது ஒரு ரகசியமாக வைத்திருக்கப் போவதில்லை, மேலும் வக்கீல்களைப் போலவே, தொலைபேசியில் அந்நியரிடமிருந்து அதைக் கேட்பதை விட உங்களிடமிருந்து அதைக் கேட்பது சிறந்தது.

source: You might let them know that there are ways you can dial down the potential for abuse complaints, for example by rate limiting or partially restricting your exit policy -- but don't be too eager to offer or take these steps, since once you give up ground here it's very hard to get it back.
ta: துச்பிரயோக புகார்களுக்கான திறனை நீங்கள் டயல் செய்யக்கூடிய வழிகள் உள்ளன என்பதை நீங்கள் அவர்களுக்குத் தெரியப்படுத்தலாம், எடுத்துக்காட்டாக, உங்கள் வெளியேறும் கொள்கையை விகிதத்தைக் கட்டுப்படுத்துவதன் மூலமோ அல்லது ஓரளவு கட்டுப்படுத்துவதன் மூலமோ - ஆனால் இந்த நடவடிக்கைகளை வழங்கவோ அல்லது எடுக்கவோ அதிக ஆர்வம் காட்ட வேண்டாம், ஏனெனில் நீங்கள் ஒரு முறை கொடுத்தால் இங்கே தரையில் அதை திரும்பப் பெறுவது மிகவும் கடினம்.

source: You'll also want to learn if there are bandwidth limitations at your organization.
ta: உங்கள் நிறுவனத்தில் அலைவரிசை வரம்புகள் உள்ளதா என்பதையும் நீங்கள் கற்றுக்கொள்ள விரும்புவீர்கள்.
