Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: A good way to monitor a relay for its health state is to have a look at its bandwidth graphs.
ta: அதன் சுகாதார நிலைக்கு ஒரு ரிலேவை கண்காணிக்க ஒரு சிறந்த வழி, அதன் அலைவரிசை வரைபடங்களைப் பார்ப்பதுதான்.

source: About 3 hours after you start your relay, it should appear on [Relay Search](https://metrics.torproject.org/rs.html) on the Metrics portal.
ta: உங்கள் ரிலேவைத் தொடங்கிய சுமார் 3 மணி நேரத்திற்குப் பிறகு, அது அளவீட்டு போர்ட்டலில் [ரிலே தேடல்] (https://metrics.torproject.org/rs.html) இல் தோன்ற வேண்டும்.

source: Additionally, be aware that these rules have been shown to work for particular attacks that have happened in the past.
ta: கூடுதலாக, இந்த விதிகள் கடந்த காலங்களில் நிகழ்ந்த குறிப்பிட்ட தாக்குதல்களுக்கு வேலை செய்வதாகக் காட்டப்பட்டுள்ளது என்பதை அறிந்து கொள்ளுங்கள்.

source: After your initial installation and start of the tor daemon it is a good idea to make a backup of your relay's long term identity keys.
ta: உங்கள் ஆரம்ப நிறுவல் மற்றும் டோர் டீமனின் தொடக்கத்திற்குப் பிறகு, உங்கள் ரிலேவின் நீண்ட கால அடையாள விசைகளின் காப்புப்பிரதியை உருவாக்குவது நல்லது.

source: Also see the bandwidth entry in the [FAQ](https://support.torproject.org/relay-operators/bandwidth-shaping/).
ta: [கேள்விகள்] (https://support.torproject.org/relay-operators/bandwidth-phathaping/) இல் அலைவரிசை உள்ளீட்டைக் காண்க.

source: Also, make sure you allow all outgoing connections too, so your relay can reach the other Tor relays, clients and destinations.
ta: மேலும், வெளிச்செல்லும் அனைத்து இணைப்புகளையும் நீங்கள் அனுமதிக்கிறீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், எனவே உங்கள் ரிலே மற்ற டோர் ரிலேக்கள், வாடிக்கையாளர்கள் மற்றும் இடங்களை அடைய முடியும்.

source: Another option is to use one of the free services that allow you to check your relay's ORPorts for reachability and send you an email should they become unreachable.
ta: மற்றொரு விருப்பம் என்னவென்றால், இலவச சேவைகளில் ஒன்றைப் பயன்படுத்துவது, இது உங்கள் ரிலேவின் விளையாட்டுகளை அடையக்கூடிய தன்மையை சரிபார்க்கவும், அவை அணுக முடியாதவராக இருந்தால் உங்களுக்கு ஒரு மின்னஞ்சலை அனுப்பவும் அனுமதிக்கின்றன.

source: At the end of the output you should see "OK." if that is not the case, do not enable IPv6 in your torrc configuration file before IPv6 is indeed working.
ta: வெளியீட்டின் முடிவில் நீங்கள் "சரி" என்று பார்க்க வேண்டும். அவ்வாறு இல்லையென்றால், ஐபிவி 6 உண்மையில் செயல்படுவதற்கு முன்பு உங்கள் டோர்க் உள்ளமைவு கோப்பில் ஐபிவி 6 ஐ இயக்க வேண்டாம்.

source: Attacks are constantly evolving and will often need new rules, so please stay connected to update these as necessary, either by subscribing to the relevant project or by subscribing to the [tor-relays](https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-relays) mailing list.
ta: தாக்குதல்கள் தொடர்ந்து உருவாகி வருகின்றன, பெரும்பாலும் புதிய விதிகள் தேவைப்படும், எனவே தயவுசெய்து தொடர்புடைய திட்டத்திற்கு சந்தா செலுத்துவதன் மூலமாகவோ அல்லது [https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-relays) அஞ்சல் பட்டியல்.

source: Before enabling your tor daemon to use IPv6 in addition to IPv4 you should do some basic IPv6 connectivity tests.
ta: IPv4 க்கு கூடுதலாக IPv6 ஐப் பயன்படுத்த உங்கள் TOR டீமானை இயக்குவதற்கு முன், நீங்கள் சில அடிப்படை IPv6 இணைப்பு சோதனைகளைச் செய்ய வேண்டும்.

source: Configuring your firewall to stop too many concurrent connections has been shown to significantly help deal with DDoS attacks against relays.
ta: ரிலேக்களுக்கு எதிரான டி.டி.ஓ.எச் தாக்குதல்களைச் சமாளிக்க கணிசமாக உதவ பல ஒரே நேரத்தில் இணைப்புகளை நிறுத்த உங்கள் ஃபயர்வாலை கட்டமைப்பது நிரூபிக்கப்பட்டுள்ளது.

source: Consider implementing one of the following mechanisms:
ta: பின்வரும் வழிமுறைகளில் ஒன்றை செயல்படுத்துவதைக் கவனியுங்கள்:

source: Default locations of the keys folder:
ta: கீச் கோப்புறையின் இயல்புநிலை இடங்கள்:

source: Having a fast relay for some time of the month is preferred over a slow relay for the entire month.
ta: மாதத்தின் சில காலத்திற்கு வேகமாக ரிலே இருப்பது முழு மாதத்திற்கும் மெதுவான ரிலேவை விட விரும்பப்படுகிறது.

source: If it worked fine, make your Tor relay reachable via IPv6 by adding an additional ORPort line to your configuration (example for ORPort 9001):
ta: இது நன்றாக வேலை செய்தால், உங்கள் உள்ளமைவுக்கு கூடுதல் ஆர்போர்ட் வரியைச் சேர்ப்பதன் மூலம் உங்கள் டோர் ரிலேவை ஐபிவி 6 வழியாக அடையலாம் (ஆர்போர்ட் 9001 க்கு எடுத்துக்காட்டு):

source: If something goes wrong, it is good to get notified automatically.
ta: ஏதேனும் தவறு நடந்தால், தானாக அறிவிக்கப்படுவது நல்லது.

source: If you are an exit relay with IPv6 connectivity, tell your tor daemon to allow exiting via IPv6 so clients can reach IPv6 destinations:
ta: நீங்கள் ஐபிவி 6 இணைப்புடன் வெளியேறும் ரிலே என்றால், ஐபிவி 6 வழியாக வெளியேற அனுமதிக்க உங்கள் டோர் டீமனிடம் சொல்லுங்கள், இதனால் வாடிக்கையாளர்கள் ஐபிவி 6 இடங்களை அடையலாம்:

source: If you are using a firewall, open a hole in your firewall so incoming connections can reach the ports you will use for your relay (ORPort).
ta: நீங்கள் ஒரு ஃபயர்வாலைப் பயன்படுத்துகிறீர்கள் என்றால், உங்கள் ஃபயர்வாலில் ஒரு துளை திறக்கவும், இதனால் உள்வரும் இணைப்புகள் உங்கள் ரிலே (ஆர்போர்ட்) க்கு நீங்கள் பயன்படுத்தும் துறைமுகங்களை அடையலாம்.

source: If you have a global IPv6 address you should be able to find it in the output of the following command:
ta: உங்களிடம் உலகளாவிய ஐபிவி 6 முகவரி இருந்தால், அதை பின்வரும் கட்டளையின் வெளியீட்டில் கண்டுபிடிக்க முடியும்:

source: If you plan to run more than a single relay, or you want to run a high capacity relay (multiple Tor instances per server) or want to use strong security features like [Offline Master Keys](https://trac.torproject.org/projects/tor/wiki/doc/TorRelaySecurity/OfflineKeys) without performing additional steps manually, you may want to use configuration management for better maintainability.
ta: நீங்கள் ஒரு ரிலேவை விட அதிகமாக இயங்க திட்டமிட்டால், அல்லது நீங்கள் அதிக திறன் கொண்ட ரிலேவை (ஒரு சேவையகத்திற்கு பல டோர் நிகழ்வுகள்) இயக்க விரும்பினால் அல்லது [ஆஃப்லைன் மாச்டர் விசைகள்] (https://trac.torproject.org/projects/tor/wiki/torelaysecurity/offinelkinekys/offlinglekes) கூடுதல் படிகளைச் செய்யாமல், கூடுதல் பாதுகாப்பு அம்சங்களைப் பயன்படுத்த விரும்பினால்.

source: If you run two relays and they have fingerprints AAAAAAAAAA and BBBBBBBB, you would add the following configuration to set MyFamily:
ta: நீங்கள் இரண்டு ரிலேக்களை இயக்கினால், அவற்றில் கைரேகைகள் AAAAAAAAAA மற்றும் BBBBBBBBB ஐ வைத்திருந்தால், MyFamily ஐ அமைக்க பின்வரும் உள்ளமைவைச் சேர்ப்பீர்கள்:

source: If your logfile (syslog) contains the following entry after starting your tor daemon your relay should be up and running as expected:
ta: உங்கள் டோர் டீமனைத் தொடங்கிய பிறகு உங்கள் லாக்ஃபைல் (சிச்லாக்) பின்வரும் நுழைவு இருந்தால், உங்கள் ரிலே எதிர்பார்த்தபடி இயங்க வேண்டும்:

source: Instead of doing so manually, for big operators we recommend to automate the MyFamily setting via a configuration management solution.
ta: கைமுறையாக அவ்வாறு செய்வதற்குப் பதிலாக, பெரிய ஆபரேட்டர்களுக்கு ஒரு உள்ளமைவு மேலாண்மை தீர்வு வழியாக மைஃபாமிலி அமைப்பை தானியக்கமாக்க பரிந்துரைக்கிறோம்.

source: It helps relay operators get notified when their relays or bridges are offline, as well as for other incidents.
ta: ரிலே ஆபரேட்டர்கள் தங்கள் ரிலேக்கள் அல்லது பாலங்கள் ஆஃப்லைனில் இருக்கும்போது அறிவிக்கப்பட உதவுகின்றன, அதே போல் பிற சம்பவங்களுக்கும்.

source: It takes some time for relay traffic to ramp up, this is especially true for guard relays but to a lesser extent also for exit relays. To understand this process, read about the [lifecycle of a new relay](https://blog.torproject.org/lifecycle-new-relay).
ta: ரிலே போக்குவரத்தை அதிகரிக்க சிறிது நேரம் எடுக்கும், இது காவலர் ரிலேக்களுக்கு குறிப்பாக உண்மை, ஆனால் வெளியேறும் ரிலேக்களுக்கும் குறைந்த அளவிற்கு. இந்த செயல்முறையைப் புரிந்து கொள்ள, [புதிய ரிலேவின் வாழ்க்கைச் சுழற்சி] (https://blog.torproject.org/lifecycle-new-melay) பற்றி படிக்கவும்.

source: Manually managing MyFamily for big relay groups is error-prone and can put Tor clients at risk.
ta: பெரிய ரிலே குழுக்களுக்கான மைஃபாமிலியை கைமுறையாக நிர்வகிப்பது பிழையானது மற்றும் டோர் வாடிக்கையாளர்களை ஆபத்தில் ஆழ்த்தலாம்.

source: Note: **Do not make your private monitoring data graphs public since this could help attackers with deanonymizing Tor users.**
ta: குறிப்பு: ** உங்கள் தனிப்பட்ட கண்காணிப்பு தரவு வரைபடங்களை பகிரங்கப்படுத்த வேண்டாம், ஏனெனில் இது தாக்குபவர்களுக்கு டோர் பயனர்களை டியனொனிமிங் செய்ய உதவும். **

source: Note: You have to explicitly specify your IPv6 address in square brackets, you can not tell tor to bind to any IPv6 (like you do for IPv4).
ta: குறிப்பு: உங்கள் ஐபிவி 6 முகவரியை சதுர அடைப்புக்குறிக்குள் வெளிப்படையாகக் குறிப்பிட வேண்டும், எந்த ஐபிவி 6 க்கும் பிணைக்க டோர் சொல்ல முடியாது (நீங்கள் ஐபிவி 4 க்கு செய்வது போல).

source: Once you have set up your relay, it will likely run without much work from your side.
ta: உங்கள் ரிலேவை அமைத்தவுடன், அது உங்கள் பக்கத்திலிருந்து அதிக வேலை இல்லாமல் இயங்கும்.

source: Only do this if you have a very secure place for your keys as if stolen, these keys could theoretically allow traffic decryption or impersonation.
ta: திருடப்பட்டதைப் போல உங்கள் விசைகளுக்கு மிகவும் பாதுகாப்பான இடம் இருந்தால் மட்டுமே இதைச் செய்யுங்கள், இந்த விசைகள் கோட்பாட்டளவில் போக்குவரத்து மறைகுறியாக்கம் அல்லது ஆள்மாறாட்டம் செய்ய அனுமதிக்கும்.

source: Since relays have a ramp-up time it makes sense to back up the identity key to be able to restore your relay's reputation after a disk failure - otherwise you would have to go through the ramp-up phase again.
ta: ரிலேக்கள் ஒரு வளைவைக் கொண்டிருப்பதால், வட்டு தோல்விக்குப் பிறகு உங்கள் ரிலேவின் நற்பெயரை மீட்டெடுக்க அடையாள விசையை காப்புப் பிரதி எடுப்பது அர்த்தமுள்ளதாக இருக்கும்-இல்லையெனில் நீங்கள் மீண்டும் வளைவுக் கட்டத்தை கடந்து செல்ல வேண்டும்.

source: Some practical advice:
ta: சில நடைமுறை ஆலோசனை:

source: The MyFamily setting is simply telling Tor clients what Tor relays are controlled by a single entity/operator/organization, so they are not used in multiple positions in a single circuit.
ta: டோர் ரிலேக்கள் ஒரு ஒற்றை நிறுவனம்/ஆபரேட்டர்/அமைப்பால் என்ன கட்டுப்படுத்தப்படுகின்றன என்பதை டோர் வாடிக்கையாளர்களுக்கு மைஃபாமிலி அமைப்பு வெறுமனே சொல்கிறது, எனவே அவை ஒரே சுற்றுவட்டத்தில் பல நிலைகளில் பயன்படுத்தப்படுவதில்லை.

source: The following Ansible Role has specifically been built for Tor relay operators and supports multiple operating systems: [Ansible Relayor](http://github.com/nusenu/ansible-relayor).
ta: டோர் ரிலே ஆபரேட்டர்களுக்காக பின்வரும் அன்சிபிள் பங்கு குறிப்பாக கட்டமைக்கப்பட்டுள்ளது மற்றும் பல இயக்க முறைமைகளை ஆதரிக்கிறது: [அன்சிபிள் ரிலேயர்] (http://github.com/nusenu/ansible-delayor).

source: The following command line will ping the IPv6 addresses of Tor directory authorities from your server:
ta: பின்வரும் கட்டளை வரி உங்கள் சேவையகத்திலிருந்து டோர் அடைவு அதிகாரிகளின் ஐபிவி 6 முகவரிகளை பிங் செய்யும்:

source: The following torrc configuration options can be used to restrict bandwidth and traffic:
ta: அலைவரிசை மற்றும் போக்குவரத்தை கட்டுப்படுத்த பின்வரும் டோர்க் உள்ளமைவு விருப்பங்கள் பயன்படுத்தப்படலாம்:

source: The location of that line in the configuration file does not matter.
ta: உள்ளமைவு கோப்பில் அந்த வரியின் இருப்பிடம் ஒரு பொருட்டல்ல.

source: There are many tools for monitoring this kind of data, [munin](http://munin-monitoring.org/) is one of them and is relatively easy to setup.
ta: இந்த வகையான தரவைக் கண்காணிக்க பல கருவிகள் உள்ளன, [MUNIN] (http://munin-monitoring.org/) அவற்றில் ஒன்று மற்றும் அமைப்பது ஒப்பீட்டளவில் எளிதானது.

source: There are multiple configuration management solutions for Unix-based operating systems (Ansible, Puppet, Salt, ...).
ta: யுனிக்ச் அடிப்படையிலான இயக்க முறைமைகளுக்கு (அன்சிபிள், பொம்மை, உப்பு, ...) பல உள்ளமைவு மேலாண்மை தீர்வுகள் உள்ளன.

source: They are located in the "keys" subfolder of your DataDirectory (simply make a copy of the entire folder and store it in a secure location).
ta: அவை உங்கள் டேட்டா டைரக்டரின் "விசைகள்" துணை கோப்புறையில் அமைந்துள்ளன (முழு கோப்புறையின் நகலை உருவாக்கி பாதுகாப்பான இடத்தில் சேமிக்கவும்).

source: This can be handy if you want to ensure that your Tor relay does not exceed a certain amount of bandwidth or total traffic per day/week/month.
ta: உங்கள் டோர் ரிலே ஒரு குறிப்பிட்ட அளவு அலைவரிசை அல்லது ஒரு நாளைக்கு/வாரத்திற்கு/மாதத்திற்கு மொத்த போக்குவரத்தை விட அதிகமாக இல்லை என்பதை உறுதிப்படுத்த விரும்பினால் இது எளிது.

source: This checks only for the listener but does not speak the Tor protocol.
ta: இது கேட்பவருக்கு மட்டுமே சரிபார்க்கிறது, ஆனால் TOR நெறிமுறையைப் பேசாது.

source: This is a very low traffic mailing list and you will get information about new stable tor releases and important security update information: [tor-announce](https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-announce).
ta: இது மிகக் குறைந்த போக்குவரத்து அஞ்சல் பட்டியல் மற்றும் புதிய நிலையான டோர் வெளியீடுகள் மற்றும் முக்கியமான பாதுகாப்பு புதுப்பிப்பு செய்தி பற்றிய தகவல்களைப் பெறுவீர்கள்: [TOR-ANNOUNS] (https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-announce).

source: This section lists a few tools that you might find handy as a Tor relay operator.
ta: டோர் ரிலே ஆபரேட்டராக நீங்கள் எளிதாகக் காணக்கூடிய சில கருவிகளை இந்த பிரிவு பட்டியலிடுகிறது.

source: To avoid putting Tor clients at risk, when operating multiple relays you must set a proper [MyFamily](https://2019.www.torproject.org/docs/tor-manual.html.en#MyFamily) value and have a valid [ContactInfo](https://2019.www.torproject.org/docs/tor-manual.html.en#ContactInfo) in your torrc configuration.
ta: டோர் வாடிக்கையாளர்களை ஆபத்தில் ஆழ்த்துவதைத் தவிர்க்க, பல ரிலேக்களை இயக்கும்போது நீங்கள் சரியான [myFamily] (https://2019.www.torproject.org/docs/tor-manual.en#myfamily) மதிப்பை அமைக்க வேண்டும் மற்றும் செல்லுபடியாகும் .

source: To ensure your relay is healthy and not overwhelmed it makes sense to have some basic system monitoring in place to keep an eye on the following metrics:
ta: உங்கள் ரிலே ஆரோக்கியமானது மற்றும் அதிகமாக இல்லை என்பதை உறுதிப்படுத்த பின்வரும் அளவீடுகளைக் கவனிக்க சில அடிப்படை கணினி கண்காணிப்பைக் கொண்டிருப்பது அர்த்தமுள்ளதாக இருக்கிறது:

source: Tor will not limit its bandwidth usage by default, but supports multiple ways to restrict the used bandwidth and the amount of traffic.
ta: டோர் அதன் அலைவரிசை பயன்பாட்டை இயல்பாக மட்டுப்படுத்தாது, ஆனால் பயன்படுத்தப்பட்ட அலைவரிசை மற்றும் போக்குவரத்தின் அளவைக் கட்டுப்படுத்த பல வழிகளை ஆதரிக்கிறது.

source: We encourage everyone to enable IPv6 on their relays. This is especially valuable on exit and guard relays.
ta: அனைவரையும் அவர்களின் ரிலேக்களில் ஐபிவி 6 ஐ இயக்க ஊக்குவிக்கிறோம். வெளியேறும் காவலர் ரிலேக்களில் இது குறிப்பாக மதிப்புமிக்கது.

source: We recommend using [Tor Weather](https://weather.torproject.org/), a notification service developed by the Tor Project.
ta: TOR திட்டத்தால் உருவாக்கப்பட்ட அறிவிப்பு சேவையான [TOR வானிலை] (https://weather.torproject.org/) ஐப் பயன்படுத்த பரிந்துரைக்கிறோம்.

source: You can also use it to generate PNG pictures showing traffic graphs. [vnstat documentation](https://humdi.net/vnstat/) and [demo output](https://humdi.net/vnstat/cgidemo/).
ta: போக்குவரத்து வரைபடங்களைக் காட்டும் பி.என்.சி படங்களை உருவாக்க இதைப் பயன்படுத்தலாம். .

source: You can find the specific ORPort TCP port number in the [Setup page](../../setup) (in the OS specific sections).
ta: குறிப்பிட்ட ஆர்போர்ட் டி.சி.பி துறைமுகம் எண்ணை [அமைவு பக்கம்] (../../ அமைவு) (OS குறிப்பிட்ட பிரிவுகளில்) காணலாம்.

source: You can search for your relay using your nickname or IP address.
ta: உங்கள் புனைப்பெயர் அல்லது ஐபி முகவரியைப் பயன்படுத்தி உங்கள் ரிலேவைத் தேடலாம்.

source: You can simply add it next to the first ORPort lines in your torrc file.
ta: உங்கள் டோர்க் கோப்பில் முதல் ஆர்போர்ட் வரிகளுக்கு அடுத்ததாக இதைச் சேர்க்கலாம்.

source: You should check them carefully before applying them to your system.
ta: உங்கள் கணினியில் அவற்றைப் பயன்படுத்துவதற்கு முன்பு அவற்றை கவனமாக சரிபார்க்க வேண்டும்.

source: [UptimeRobot](https://uptimerobot.com/) is one of these services that allow you to monitor TCP listeners on arbitrary ports.
ta: [UPTIMEROBOT] (https://uptimerobot.com/) இந்த சேவைகளில் ஒன்றாகும், இது தன்னிச்சையான துறைமுகங்களில் TCP கேட்போரை கண்காணிக்க உங்களை அனுமதிக்கிறது.

source: to both relays. To find your relay's fingerprint you can look into the log files when tor starts up or find the file named "fingerprint" in your tor DataDirectory.
ta: இரண்டு ரிலேக்களுக்கும். உங்கள் ரிலேவின் கைரேகையைக் கண்டுபிடிக்க, டோர் தொடங்கும் போது பதிவுக் கோப்புகளைப் பார்க்கலாம் அல்லது உங்கள் டோர் டேட்டா டைரக்டரில் "கைரேகை" என்ற கோப்பைக் காணலாம்.

source: Relay operations
ta: ரிலே செயல்பாடுகள்

source: Learn what to do once your relay is installed
ta: உங்கள் ரிலே நிறுவப்பட்டவுடன் என்ன செய்ய வேண்டும் என்பதை அறிக

source: Relay Post-install and good practices
ta: பிந்தைய நிறுவல் மற்றும் நல்ல நடைமுறைகளை ரிலே

source: ## Additional info: Expected savings from this transition
ta: ## கூடுதல் தகவல்: இந்த மாற்றத்திலிருந்து எதிர்பார்க்கப்படும் சேமிப்பு

source: ## Additional info: How to transition family keys
ta: ## கூடுதல் தகவல்: குடும்ப விசைகளை மாற்றுவது எப்படி

source: ## Configuring your relay
ta: ## உங்கள் ரிலேவை உள்ளமைத்தல்

source: ## Did it work?
ta: ## இது வேலை செய்ததா?

source: ## Generating the family key
ta: ## குடும்ப விசையை உருவாக்குதல்

source: ## In more detail
ta: ## இன்னும் விரிவாக

source: ## NOTE: You still need to configure MyFamily!
ta: ## குறிப்பு: You still need பெறுநர் configure MyFamily!

source: ## The basic idea
ta: ## அடிப்படை சிந்தனை

source: (By default, this is the `keys` subdirectory of your `DataDir`.)
ta: (இயல்பாக, இது உங்கள் `டேட்டாடிர்` இன்` விசைகள்` துணை அடைவு ஆகும்.)

source: (Don't use the one from this example—that isn't your family ID.)
ta: (Don't use the one இருந்து this example—that isn't your family ID.)

source: (If you don't, an adversary's relay could falsely claim to be a member of your family.)
ta: (If you don't, an adversary's அஞ்சல் சுருள் could falsely claim பெறுநர் be a member of your family.)

source: (This might not be a permanent savings, unfortunately: when we transition to postquantum cryptography, we might have to make microdescriptors bigger again. But at least this change will free the room to do so.)
ta: (This might not be a permanent savings, unfortunately: when we transition பெறுநர் postquantum cryptography, we might have பெறுநர் make microdescriptors bigger again. But at least this change will free the room பெறுநர் do so.)

source: (Unfortunately, moving to happy families will create _additional_ work while the transition is going on. We think that it will be worth it in the long run.)
ta: (துரதிர்ச்டவசமாக.

source: 1. Generate a new family key as above.
ta: 1. Generate a புதிய family key அச் above.

source: 1. Generate a single key for your family.
ta: 1. Generate a ஒற்றை key க்கு your family.

source: 2. Copy that key to every relay.
ta: 2. ஒவ்வொரு ரிலேவுக்கும் அந்த விசையை நகலெடுக்கவும்.

source: 2. Copy the new family key to every one of your relays, without replacing the old family key.
ta: 2. நகலெடு the புதிய family key பெறுநர் every one of your relays, without replacing the old family key.

source: 3. Add the new `FamilyID` line to all of your relays' configurations, without removing the old one.
ta: 3. பழையதை அகற்றாமல், உங்கள் ரிலே அனைத்து 'உள்ளமைவிலும் புதிய `குடும்ப ஐடி` வரியைச் சேர்க்கவும்.

source: 3. Configure your relays to use that key.
ta: 3. அந்த விசையைப் பயன்படுத்த உங்கள் ரிலேக்களை உள்ளமைக்கவும்.

source: 4. Wait for a few days, to give the new family information time to propagate.
ta: 4. புதிய குடும்ப செய்தி பிரச்சாரம் செய்ய சில நாட்கள் காத்திருங்கள்.

source: 5. Remove the old `FamilyID` lines from your relays' configurations.
ta: 5. உங்கள் ரிலேக்கள் 'உள்ளமைவுகளிலிருந்து பழைய `faimeid` வரிகளை அகற்றவும்.

source: At this point, your relays will all be members of _two_ families.
ta: இந்த கட்டத்தில், உங்கள் ரிலேக்கள் அனைத்தும் _TWO_ குடும்பங்களின் உறுப்பினர்களாக இருக்கும்.

source: Copy the `MyKey.secret_family_key` file (or whatever you called it) into the `KeyDir` of every one of your relay.
ta: உங்கள் ரிலே ஒவ்வொன்றின் `கீதிர் 'இல்` mykey.secret_family_key` கோப்பை (அல்லது நீங்கள் அழைத்த எதுவாக இருந்தாலும்) நகலெடுக்கவும்.

source: First, you will need to wait until all of your relays are running 0.4.9.2-alpha or later.
ta: முதலில், உங்கள் ரிலேக்கள் அனைத்தும் 0.4.9.2-ஆல்பா அல்லது அதற்குப் பிறகு இயங்கும் வரை நீங்கள் காத்திருக்க வேண்டும்.

source: Give it a different filename from the old key.
ta: பழைய விசையிலிருந்து வேறு கோப்பு பெயரை கொடுங்கள்.

source: If one of your relays is compromised, or if you accidentally leak a family key, you'll need to change the key.
ta: உங்கள் ரிலேக்களில் ஒன்று வேறுபாடின்மை செய்யப்பட்டால், அல்லது நீங்கள் தற்செயலாக ஒரு குடும்ப விசையை கசியுமானால், நீங்கள் விசையை மாற்ற வேண்டும்.

source: If you did this right, you should see a `family-cert` entry in your relay's descriptor, looking something like this:
ta: நீங்கள் இந்த உரிமையைச் செய்திருந்தால், உங்கள் ரிலேவின் விவரிப்பாளரில் `குடும்ப-சான்றிதழ்` உள்ளீட்டை நீங்கள் காண வேண்டும், இதுபோன்ற ஒன்றைப் பார்க்கிறீர்கள்:

source: If your relay is running, you'll have to tell it to reload its configuration (typically with a `SIGHUP`.)
ta: உங்கள் ரிலே இயங்கினால், அதன் உள்ளமைவை மீண்டும் ஏற்றும்படி சொல்ல வேண்டும் (பொதுவாக `SYRIGUP` உடன்.)

source: In Tor's current design, to set up relays as members of a family, every relay needs to list _every other member of the family_ in its configuration, and publish that list to clients as well.
ta: டோரின் தற்போதைய வடிவமைப்பில், ரிலேக்களை ஒரு குடும்பத்தின் உறுப்பினர்களாக அமைக்க, ஒவ்வொரு ரிலேவும் அதன் உள்ளமைவில் _ குடும்பத்தின் மற்ற உறுப்பினர்களையும் பட்டியலிட வேண்டும், மேலும் அந்த பட்டியலை வாடிக்கையாளர்களுக்கும் வெளியிட வேண்டும்.

source: In Tor, when multiple relays have the same operator(s), they should declare that they are members of a "family".
ta: டோரில், பல ரிலேக்கள் ஒரே ஆபரேட்டர் (கள்) இருக்கும்போது, அவர்கள் ஒரு "குடும்பத்தின்" உறுப்பினர்கள் என்று அறிவிக்க வேண்டும்.

source: In the Happy Families design, every relay family is identified by a secret family signing key shared by all family members.
ta: மகிழ்ச்சியான குடும்பங்களின் வடிவமைப்பில், ஒவ்வொரு ரிலே குடும்பமும் அனைத்து குடும்ப உறுப்பினர்களும் பகிரப்பட்ட ஒரு ரகசிய குடும்ப கையெழுத்திடும் விசையால் அடையாளம் காணப்படுகிறது.

source: Once enough of the directory authorities are running 0.4.9.2-alpha or later, they'll include a corresponding entry in your relays' microdescriptors, which will look something like:
ta: அடைவு அதிகாரிகள் போதுமானது 0.4.9.2-ஆல்பா அல்லது அதற்குப் பிறகு இயங்கினால், அவை உங்கள் ரிலேசின் மைக்ரோடெக்ச்கிரிப்டர்களில் தொடர்புடைய உள்ளீட்டை உள்ளடக்கும், இது இதுபோன்றதாக இருக்கும்:

source: Optionally, remove the old family keys as well.
ta: விருப்பமாக, பழைய குடும்ப விசைகளையும் அகற்றவும்.

source: Save that `FamilyID` line; you're going to need it!
ta: அந்த `faimeid` வரியைச் சேமிக்கவும்; உங்களுக்கு இது தேவைப்படும்!

source: So what you'll need to do is:
ta: எனவே நீங்கள் செய்ய வேண்டியது என்னவென்றால்:

source: The Happy Families design is a new feature in Tor 0.4.9.2-alpha that will (eventually) provide a simpler way to configure relay families, and will also save a lot of traffic when clients are fetching network directory information.
ta: ஏப்பி ஃபேமிலி டிசைன் என்பது டோர் 0.4.9.2-ஆல்பாவில் ஒரு புதிய அம்சமாகும், இது ரிலே குடும்பங்களை உள்ளமைக்க ஒரு எளிய வழியை வழங்கும், மேலும் வாடிக்கையாளர்கள் பிணையம் அடைவு தகவல்களைப் பெறும்போது நிறைய போக்குவரத்தையும் மிச்சப்படுத்தும்.

source: The family members use this key to sign certificates proving that they belong to the family.
ta: குடும்ப உறுப்பினர்கள் இந்த விசையைப் பயன்படுத்துகிறார்கள், அவர்கள் குடும்பத்தைச் சேர்ந்தவர்கள் என்பதை நிரூபிக்கும் சான்றிதழ்களில் கையெழுத்திடுகிறார்கள்.

source: The file name needs to end with `.secret_family_key`.
ta: கோப்பு பெயர் `.secret_family_key` உடன் முடிவடைய வேண்டும்.

source: Then, add the `FamilyId` line to your `torrc`.
ta: பின்னர், உங்கள் `டோர்க்` இல்` `faimeid` வரியைச் சேர்க்கவும்.

source: Then, to generate a family key, run:
ta: பின்னர், ஒரு குடும்ப விசையை உருவாக்க, இயக்கவும்:
