Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: * The ISP is not at fault and not liable for your actions. This is normally the case, but the poor abuse person dealing with the issues just wants to hear it isn't the ISPs problem. They will move on after they are comfortable.
ta: * ISP தவறு இல்லை, உங்கள் செயல்களுக்கு பொறுப்பல்ல. இது பொதுவாக நிகழ்கிறது, ஆனால் சிக்கல்களைக் கையாளும் மோசமான துச்பிரயோக நபர் இது ஐ.எச்.பி.எச் சிக்கல் அல்ல என்று கேட்க விரும்புகிறார். அவர்கள் வசதியாக இருந்தபின் அவர்கள் முன்னேறுவார்கள்.

source: * The ISP/Complainant demands you disable Tor. You may want a new ISP as a result.
ta: * ஐ.எச்.பி/புகார்தாரர் நீங்கள் டோர் முடக்குமாறு கோருகிறார். இதன் விளைவாக புதிய ISP ஐ நீங்கள் விரும்பலாம்.

source: * The ISP/Complainant may suggest you convert to a non-exit node. In this case, you may want to counter with a reduced exit policy, such as the one suggested in [item #6 of the above blog post](https://blog.torproject.org/tips-running-exit-node).
ta: * ஐ.எச்.பி/புகார்தாரர் வெளியேற்றப்படாத முனைக்கு மாற்ற பரிந்துரைக்கலாம். இந்த விசயத்தில், குறைக்கப்பட்ட வெளியேறும் கொள்கையை நீங்கள் எதிர்க்க விரும்பலாம், அதாவது [மேலே உள்ள வலைப்பதிவு இடுகையின் பொருள் #6] (https://blog.torproject.org/tips-running-exit-node).

source: * The ISP/Complainant may very well demand to see logfiles. Fortunately, by default, nothing sensitive is disclosed. You may want a new ISP if they demand access to log files ad hoc.
ta: * ISP/புகார்தாரர் உள்நுழைவுகளைப் பார்க்க மிகவும் தேவைப்படலாம். அதிர்ச்டவசமாக, இயல்பாக, உணர்திறன் எதுவும் வெளியிடப்படவில்லை. பதிவு கோப்புகளை தற்காலிகமாக அணுகுமாறு அவர்கள் கோரியால் புதிய ISP ஐ நீங்கள் விரும்பலாம்.

source: * The ISP/Complainant states they will firewall off the traffic on the default ports. You may want a new ISP as a result.
ta: * இயல்புநிலை துறைமுகங்களில் போக்குவரத்தை விட்டு வெளியேறுவதாக ISP/புகார்தாரர் கூறுகிறார். இதன் விளைவாக புதிய ISP ஐ நீங்கள் விரும்பலாம்.

source: * Update the config to disallow traffic to a certain IP range from your exit node. You may want to suggest the complainant use the [Tor DNS RBL](https://2019.www.torproject.org/projects/tordnsel.html.en) instead.
ta: * உங்கள் வெளியேறும் முனையிலிருந்து ஒரு குறிப்பிட்ட ஐபி வரம்பிற்கு போக்குவரத்தை அனுமதிக்க கட்டமைப்பைப் புதுப்பிக்கவும். அதற்கு பதிலாக [TOR DNS RBL] (https://2019.www.torproject.org/projects/tordnsel.html.en) ஐப் பயன்படுத்த பரிந்துரைக்க விரும்பலாம்.

source: * You are a competent server administrator and can address the issue. Minimally, you can at least discuss and respond to the issue intelligently.
ta: * நீங்கள் ஒரு திறமையான சேவையக நிர்வாகி மற்றும் சிக்கலை தீர்க்க முடியும். குறைந்தபட்சமாக, நீங்கள் குறைந்தபட்சம் விவாதிக்கலாம் மற்றும் பிரச்சினைக்கு புத்திசாலித்தனமாக பதிலளிக்கலாம்.

source: * You are a responsible server operator and concerned about the complainant's problem.
ta: * நீங்கள் ஒரு பொறுப்பான சேவையக ஆபரேட்டர் மற்றும் புகார்தாரரின் சிக்கல் குறித்து அக்கறை கொண்டுள்ளீர்கள்.

source: * You are not insane. You may be insane, but we don't want the complainant to guess this is true.
ta: * நீங்கள் பைத்தியம் இல்லை. நீங்கள் பைத்தியக்காரத்தனமாக இருக்கலாம், ஆனால் இது உண்மை என்று குற்றச்சாட்டு அளிப்பவர் யூகிக்க நாங்கள் விரும்பவில்லை.

source: * You are not the perpetrator of the issue.
ta: * நீங்கள் பிரச்சினையின் குற்றவாளி அல்ல.

source: * Your server is not a spam relay.
ta: * உங்கள் சேவையகம் ச்பேம் ரிலே அல்ல.

source: * Your server is not a trojan/zombie.
ta: * உங்கள் சேவையகம் ட்ரோசன்/சாம்பி அல்ல.

source: * Your server is not compromised.
ta: * உங்கள் சேவையகம் வேறுபாடின்மை செய்யப்படவில்லை.

source: * [DMCA Response template for Tor node maintainer to ISP](/relay/community-resources/eff-tor-legal-faq/) as written by the [EFF](http://www.eff.org).
ta: * [DMCA Response template க்கு Tor கணு பராமரிப்பாளர் பெறுநர் ISP](/relay/community-resources/eff-tor-legal-faq/) அச் written by the [EFF](http://www.eff.org).

source: <ip>" https://check.torproject.org/cgi-bin/TorBulkExitList.py
ta: <Pis> "https://check.torproject.org/cgi-bin/torbulkexitlist.py

source: <web server here>.
ta: <வலை சேவையகம் இங்கே>.

source: Additionally, if your news reader supports killfiles, you may be interested in using the Tor Bulk Exit list script to download a list of IPs to include in your killfile for posts that match "NNTP-Posting-Host:
ta: கூடுதலாக, உங்கள் செய்தி வாசகர் கில்ஃபைல்களை ஆதரித்தால், டோர் மொத்த வெளியேறும் பட்டியல் ச்கிரிப்டைப் பயன்படுத்துவதில் நீங்கள் ஆர்வமாக இருக்கலாம், "என்.என்.டி.பி-போச்டிங்-ஓச்ட்:

source: Additionally, the Tor project provides an automated DNSRBL for you to query to flag orders coming from Tor nodes as requiring special review: https://www.torproject.org/projects/tordnsel.html.en
ta: கூடுதலாக, டோர் முனைகளிலிருந்து வரும் கொடியில் வினவலுக்கு டோர் திட்டம் ஒரு தானியங்கி டி.என்.எச்.ஆர்.பி.எல் வழங்குகிறது: https://www.torproject.org/projects/tordnsel.html.en

source: Additionally, the Tor project provides an automated DNSRBL for you to query to flag visitors coming from Tor nodes as requiring special treatment: https://www.torproject.org/projects/tordnsel.html.en.
ta: கூடுதலாக, டோர் முனைகளிலிருந்து வரும் பார்வையாளர்களை சிறப்பு மருத்தீடு தேவைப்படுவது எனக் கொடியிடுவதற்கு நீங்கள் ஒரு தானியங்கி டி.என்.எச்.ஆர்.பி.எல் வழங்குகிறது: https://www.torproject.org/projects/tordnsel.html.en.

source: All templates should include the Common Boilerplate below, and append some additional paragraphs depending on the specific Scenario.
ta: எல்லா வார்ப்புருக்கள் கீழே உள்ள பொதுவான கொதிகலன் தட்டைக் கொண்டிருக்க வேண்டும், மேலும் குறிப்பிட்ட சூழ்நிலையைப் பொறுத்து சில கூடுதல் பத்திகளைச் சேர்க்க வேண்டும்.

source: As can be seen from the overview page, the Tor network is designed to make tracing of users impossible.
ta: கண்ணோட்டம் பக்கத்திலிருந்து பார்க்கக்கூடியது போல, TOR பிணையம் பயனர்களைக் கண்டுபிடிப்பதை சாத்தியமற்றதாக மாற்றும் வகையில் வடிவமைக்கப்பட்டுள்ளது.

source: Below are a collection of letters you can use to respond to your ISP about their complaint in regards to your Tor exit server.
ta: உங்கள் டோர் வெளியேறும் சேவையகத்தைப் பொறுத்தவரை உங்கள் ஐ.எச்.பி அவர்களின் புகாரைப் பற்றி பதிலளிக்க நீங்கள் பயன்படுத்தக்கூடிய கடிதங்களின் தொகுப்பு கீழே.

source: Brute force login attempts can be reduced/slowed by Captchas, which is the approach taken by Gmail for this same problem.
ta: முரட்டுத்தனமான படை உள்நுழைவு முயற்சிகளை கேப்ட்சாக்களால் குறைக்கலாம்/குறைக்கலாம், இது இதே பிரச்சினைக்கு சிமெயில் எடுத்த அணுகுமுறையாகும்.

source: Client connections are routed through multiple relays, and are multiplexed together on the connections between relays.
ta: கிளையன்ட் இணைப்புகள் பல ரிலேக்கள் மூலம் திசைதிருப்பப்படுகின்றன, மேலும் ரிலேக்களுக்கு இடையிலான இணைப்புகளில் ஒன்றாக மல்டிபிளெக்ச் செய்யப்படுகின்றன.

source: Contacting this address will give you better luck at actually having this abuser's Google Groups account canceled than will chasing down Tor nodes, proxies, and open wireless access points.
ta: இந்த முகவரியைத் தொடர்புகொள்வது டோர் முனைகள், ப்ராக்சிகள் மற்றும் திறந்த வயர்லெச் அணுகல் புள்ளிகளைத் துரத்துவதைக் காட்டிலும் இந்த தீய பயன்பாடு செய்பவரின் கூகிள் குழுக்கள் கணக்கை ரத்து செய்வதில் சிறந்த அதிர்ச்டத்தை வழங்கும்.

source: Did you contact their abuse department?
ta: அவர்களின் துச்பிரயோகத் துறையைத் தொடர்பு கொண்டீர்களா?

source: Feel free to improve them if you feel they fall short of this goal.
ta: இந்த இலக்கைக் குறைப்பதாக நீங்கள் உணர்ந்தால் அவற்றை மேம்படுத்த தயங்க.

source: For serious incidents, traditional police work techniques of running stings and investigating to determine means, motive, and opportunity are still very effective.
ta: கடுமையான சம்பவங்களுக்கு, பாரம்பரிய பொலிச் பணி நுட்பங்கள் குச்சிகளை இயக்குவது மற்றும் வழிமுறைகள், நோக்கம் மற்றும் வாய்ப்பை தீர்மானிக்க வினவல் செய்தல் இன்னும் மிகவும் பயனுள்ளதாக இருக்கும்.

source: However, be aware that this may be just one jerk amongst many legitimate Tor users who use your forums.
ta: இருப்பினும், உங்கள் மன்றங்களைப் பயன்படுத்தும் பல முறையான டோர் பயனர்களிடையே இது ஒரு முட்டாள்தனமாக இருக்கலாம் என்பதை அறிந்து கொள்ளுங்கள்.

source: However, it is possible that your rate limiting alarms simply experienced a false positive due to the amount of traffic that flows through the router.
ta: இருப்பினும், உங்கள் வீதத்தைக் கட்டுப்படுத்தும் அலாரங்களைக் கட்டுப்படுத்துவது திசைவி வழியாக பாயும் போக்குவரத்தின் அளவு காரணமாக தவறான நேர்மறையை அனுபவித்திருக்கலாம்.

source: However, rather than banning legitimate Tor users from using your service in general, we recommend ensuring that such services are updated and maintained to free of vulnerabilities that can lead to situations such as this (PHP webshell/XSS compromise/SQL Injection compromise).
ta: எவ்வாறாயினும், நியாயமான டோர் பயனர்களை பொதுவாக உங்கள் சேவையைப் பயன்படுத்துவதைத் தடை செய்வதற்கு பதிலாக, இதுபோன்ற சேவைகள் புதுப்பிக்கப்பட்டு, இது போன்ற சூழ்நிலைகளுக்கு வழிவகுக்கும் பாதிப்புகளிலிருந்து இலவசமாக பராமரிக்கப்படுவதை உறுதிசெய்கிறோம் (PHP வெப்செல்/எக்ச்எச்எச் சமரசம்/SQL ஊசி சமரசம்).

source: However, we still recommend using the general approach, as the attack will likely simply reappear from an open proxy or other IP once Tor is blocked.
ta: எவ்வாறாயினும், பொதுவான அணுகுமுறையைப் பயன்படுத்த நாங்கள் இன்னும் பரிந்துரைக்கிறோம், ஏனெனில் தாக்குதல் ஒரு திறந்த பதிலாள் அல்லது பிற ஐபி ஆகியவற்றிலிருந்து மீண்டும் தோன்றும்.

source: If a serious abuse complaint not covered by this template set arrives, the best answer is to follow a pattern with the complaining party.
ta: இந்த வார்ப்புரு தொகுப்பால் மூடப்படாத கடுமையான துச்பிரயோக குற்றச்சாட்டு வந்தால், குற்றச்சாட்டு அளிக்கும் கட்சியுடன் ஒரு முறையைப் பின்பற்றுவதே சிறந்த பதில்.

source: If it is in fact a serious problem specific to Tor, the Tor project provides an automated DNSRBL for you to query to block login attempts coming from Tor nodes: https://www.torproject.org/projects/tordnsel.html.en
ta: இது உண்மையில் TOR க்கு ஒரு தீவிரமான சிக்கலாக இருந்தால், TOR முனைகளிலிருந்து வரும் உள்நுழைவு முயற்சிகளைத் தடுக்க நீங்கள் வினவுவதற்கு TOR திட்டம் ஒரு தானியங்கி DNSRBL ஐ வழங்குகிறது: https://www.torproject.org/projects/tordnsel.html.en

source: If the attack is real and ongoing, however, the Tor project provides an automated DNSRBL for you to query to block login attempts coming from Tor nodes: https://www.torproject.org/projects/tordnsel.html.en
ta: இருப்பினும், தாக்குதல் உண்மையானது மற்றும் நடந்து கொண்டிருக்கிறது என்றால், டோர் முனைகளிலிருந்து வரும் உள்நுழைவு முயற்சிகளைத் தடுக்க டோர் திட்டம் ஒரு தானியங்கி டி.என்.எச்.ஆர்.பி.எல் வழங்குகிறது: https://www.torproject.org/projects/tordnsel.html.en

source: If this fails, DoS attempts can also be solved with iptables-based rate limiting solutions, load balancers such as nginx, and also IPS devices, but be aware that Internet traffic is not always uniform in quantity by IP, due to large corporate and even national outproxies, NATs, and services like Tor.
ta: இது தோல்வியுற்றால், DOS முயற்சிகள் IPTABLES- அடிப்படையிலான வீதத்தைக் கட்டுப்படுத்தும் தீர்வுகள், NGinx போன்ற சுமை இருப்புநிலைகள் மற்றும் ஐபிஎச் சாதனங்கள் ஆகியவற்றுடன் தீர்க்கப்படலாம், ஆனால் இணைய போக்குவரத்து எப்போதும் ஐபி மூலம் ஒரே மாதிரியாக இல்லை என்பதை அறிந்து கொள்ளுங்கள், பெரிய கார்ப்பரேட் மற்றும் கூட தேசிய வெளியீடுகள், நாட்ச் மற்றும் டோர் போன்ற சேவைகள்.

source: If you are concerned about SSH scans, you might consider running your SSHD on a port other than the default of 22.
ta: பாஓடு ச்கேன் பற்றி நீங்கள் கவலைப்படுகிறீர்கள் என்றால், 22 இன் இயல்புநிலை தவிர வேறு ஒரு துறைமுகத்தில் உங்கள் SSHD ஐ இயக்குவதை நீங்கள் கருத்தில் கொள்ளலாம்.

source: In addition, our nodes do not allow SMTP traffic to be sent using our IPs.
ta: கூடுதலாக, எங்கள் முனைகள் எங்கள் ஐபிக்களைப் பயன்படுத்தி SMTP போக்குவரத்தை அனுப்ப அனுமதிக்காது.

source: In fact, Google provides a free Captcha service, complete with code for easy inclusion in a number of systems to help other sites deal
ta: உண்மையில், கூகிள் ஒரு இலவச கேப்ட்சா சேவையை வழங்குகிறது, இது மற்ற தளங்களை சமாளிக்க பல அமைப்புகளில் எளிதாக சேர்க்கும் குறியீட்டைக் கொண்டுள்ளது

source: In fact, Google provides a free Captcha service, complete with code for easy inclusion in a number of systems to help other sites deal with this issue: https://code.google.com/apis/recaptcha/intro.html
ta: உண்மையில், கூகிள் ஒரு இலவச கேப்ட்சா சேவையை வழங்குகிறது, இந்த சிக்கலைச் சமாளிக்க மற்ற தளங்களுக்கு உதவ பல அமைப்புகளில் எளிதாக சேர்க்கும் குறியீட்டைக் கொண்டுள்ளது: https://code.google.com/apis/recaptcha/intro.html

source: In fact, all [objective evidence](http://boingboing.net/2011/08/12/south-korea-to-abandon-real-name-internet-policy.html) seems to indicate that it has only created new markets for organized crime to preside over.
ta: உண்மையில்.

source: In fact, in my experience, the fraud processing teams contracted by many ISPs simply mark all requests from Tor nodes as fraud using that very list.
ta: உண்மையில், எனது அனுபவத்தில், பல ISP களால் ஒப்பந்தம் செய்யப்பட்ட மோசடி செயலாக்க குழுக்கள் TOR முனைகளிலிருந்து வரும் அனைத்து கோரிக்கைகளையும் அந்த பட்டியலைப் பயன்படுத்தி மோசடி என்று குறிக்கின்றன.

source: In general however, we believe that problems like this are best solved by improving the service to defend against the attack from the Internet at large.
ta: இருப்பினும், பொதுவாக, இணையத்திலிருந்து தாக்குதலுக்கு எதிராக பாதுகாக்க சேவையை மேம்படுத்துவதன் மூலம் இது போன்ற பிரச்சினைகள் சிறப்பாக தீர்க்கப்படுகின்றன என்று நாங்கள் நம்புகிறோம்.

source: In general, we believe that problems like this are best solved by improving the service to defend against the attack from the Internet at large rather than specifically tailoring behavior for Tor.
ta: பொதுவாக, TOR க்கான நடத்தை குறிப்பாகத் தையல் செய்வதை விட, இணையத்திலிருந்து தாக்குதலுக்கு எதிராக பாதுகாக்க சேவையை மேம்படுத்துவதன் மூலம் இது போன்ற பிரச்சினைகள் சிறந்த முறையில் தீர்க்கப்படுகின்றன என்று நாங்கள் நம்புகிறோம்.

source: In general, we believe that problems like this are best solved by improving your service to defend against the attack from the Internet at large.
ta: பொதுவாக, இணையத்திலிருந்து தாக்குதலுக்கு எதிராக பாதுகாக்க உங்கள் சேவையை மேம்படுத்துவதன் மூலம் இது போன்ற பிரச்சினைகள் சிறப்பாக தீர்க்கப்படுகின்றன என்று நாங்கள் நம்புகிறோம்.

source: Inspecting the headers reveals that the abuse complaint address for Google Groups is groups-abuse@google.com.
ta: Google குழுக்களுக்கான துச்பிரயோக குற்றச்சாட்டு முகவரி குழுக்கள்-use@google.com என்று தலைப்புகளை ஆய்வு செய்வது வெளிப்படுத்துகிறது.

source: It also provides a Bulk Exit List service for retrieving the entire list: https://check.torproject.org/cgi-bin/TorBulkExitList.py
ta: முழு பட்டியலையும் மீட்டெடுப்பதற்கான மொத்த வெளியேறும் பட்டியல் சேவையையும் இது வழங்குகிறது: https://check.torproject.org/cgi-bin/torbulkexitlist.py

source: It appears that your specific abuse complaint was generated by an authenticated Google Groups user.
ta: உங்கள் குறிப்பிட்ட துச்பிரயோக குற்றச்சாட்டு அங்கீகரிக்கப்பட்ட Google குழுக்கள் பயனரால் உருவாக்கப்பட்டதாகத் தெரிகிறது.

source: It has also been reviewed by someone who works in Abuse at a major ISP.
ta: ஒரு பெரிய ISP இல் துச்பிரயோகத்தில் பணிபுரியும் ஒருவர் இதை மதிப்பாய்வு செய்துள்ளார்.

source: It is also possible to download a list of all Tor exit IPs that will connect to your SSH port: https://check.torproject.org/cgi-bin/TorBulkExitList.py?ip=YOUR_IP&port=22
ta: உங்கள் பாஓடு போர்ட்டுடன் இணைக்கும் அனைத்து டோர் வெளியேறும் ஐபிக்களின் பட்டியலையும் பதிவிறக்கம் செய்யலாம்: https://check.torproject.org/cgi-bin/torbulkexitlist.py?ip=your_ip&port=22

source: It is also possible to download a list of all Tor exit IPs that will connect to your server port:
ta: உங்கள் சேவையக துறைமுகத்துடன் இணைக்கும் அனைத்து டோர் வெளியேறும் ஐபிக்களின் பட்டியலையும் பதிவிறக்கம் செய்ய முடியும்:

source: It was written by someone with experience working with various ISPs who had issues with a Tor exit node on their network.
ta: இது அவர்களின் நெட்வொர்க்கில் டோர் வெளியேறும் முனையுடன் சிக்கல்களைக் கொண்டிருந்த பல்வேறு ஐஎச்பிக்களுடன் பணிபுரியும் அனுபவமுள்ள ஒருவர் எழுதியது.

source: Many worms, scanners, and botnets scan the entire Internet looking for SSH logins.
ta: பல புழுக்கள், ச்கேனர்கள் மற்றும் போட்நெட்டுகள் பாஓடு உள்நுழைவுகளைத் தேடும் முழு இணையத்தையும் ச்கேன் செய்கின்றன.

source: Our recommendation is to treat this event as though there was a login from an open wireless access point in your city. Reset your password, and if you don't have antivirus already, download the free AVG: http://free.avg.com/us-en/download, Spybot SD: https://www.safer-networking.org/, and/or AdAware: http://www.lavasoft.com/?domain=lavasoftusa.com.
ta: உங்கள் நகரத்தில் திறந்த வயர்லெச் அணுகல் புள்ளியிலிருந்து உள்நுழைவு இருந்ததைப் போல இந்த நிகழ்வை நடத்துவதே எங்கள் பரிந்துரை. உங்கள் கடவுச்சொல்லை மீட்டமைக்கவும், உங்களிடம் ஏற்கனவே ஆன்டிவைரச் இல்லையென்றால், இலவச ஏ.வி.சி: http://free.avg.com/us-en/download, ச்பைபோட் எச்டி: https://www.safer-networking/ , மற்றும்/.

source: Please see [Tips for Running an Exit Node with Minimal Harassment](https://blog.torproject.org/tips-running-exit-node) and [Tor Exit Guidelines](/relay/community-resources/tor-exit-guidelines/) for more info, before reading this document.
ta: தயவுசெய்து [குறைந்தபட்ச துன்புறுத்தலுடன் வெளியேறும் முனையை இயக்குவதற்கான உதவிக்குறிப்புகள்] (https://blog.torproject.org/tips-running-exit-node) மற்றும் [டோர் வெளியேறும் வழிகாட்டுதல்கள்] (/ரிலே/சமூக வளங்கள்/டோர்-எக்சிட்-கியிட்லைன்ச்/) இந்த ஆவணத்தைப் படிப்பதற்கு முன்.

source: Scraping and robot activity can be reduced/slowed by Captchas, which is the approach taken by Gmail for this same problem.
ta: ச்கிராப்பிங் மற்றும் ரோபோ செயல்பாட்டை கேப்ட்சாக்களால் குறைக்கலாம்/குறைக்கலாம், இது இதே பிரச்சினைக்கு சிமெயில் எடுத்த அணுகுமுறையாகும்.

source: See https://www.torproject.org/about/torusers.html.en for more info.
ta: மேலும் தகவலுக்கு https://www.torproject.org/about/torusers.html.en ஐப் பார்க்கவும்.

source: Slow DoS attacks [aimed to consume the Apache MaxClients limit](http://www.guerilla-ciso.com/archives/2049) can be alleviated by reducing the httpd.conf TimeOut and KeepAliveTimeout config values to 15-30 and raising the ServerLimit and MaxClients values to something like 3000.
ta: மெதுவான DOS தாக்குதல்கள் [அப்பாச்சி மேக்ச் கிளையண்ட்ச் வரம்பை உட்கொள்வதை நோக்கமாகக் கொண்டவை] (http://www.guerilla-ciso.com/archives/2049) HTTPD.Conf காலக்கெடு மற்றும் கீப்அலிவ் டைமவுட் மதிப்புகளை 15-30 க்கு குறைப்பதன் மூலம் தணிக்கலாம் மற்றும் சேவையகத்தை உயர்த்துவது மற்றும் 3000 விசயங்களுக்கு மேக்ச்க்ளெண்ட்ச்.

source: So it is even possible this is a legitimate order, but was flagged as fraud solely based on IP, especially if you contract out fraud detection to a third party.
ta: எனவே இது ஒரு முறையான ஒழுங்கு கூட, ஆனால் ஐபி அடிப்படையில் மட்டுமே மோசடி என கொடியிடப்பட்டது, குறிப்பாக நீங்கள் மூன்றாம் தரப்பினருக்கு மோசடி கண்டறிதலை ஒப்பந்தம் செய்தால்.

source: The IP address in question is a Tor exit node.
ta: கேள்விக்குரிய ஐபி முகவரி ஒரு டோர் வெளியேறும் முனை.

source: The Tor Project provides an automated DNSRBL for you to query to flag posts coming from Tor nodes as requiring special review.
ta: டோர் முனைகளிலிருந்து வரும் கொடியிடங்களை வினவுவதற்கு டோர் திட்டம் ஒரு தானியங்கி டி.என்.எச்.ஆர்.பி.எல் வழங்குகிறது.

source: The Tor network is run by some 5000 volunteers who use the free software provided by the Tor Project to run Tor routers.
ta: TOR பிணையம் சுமார் 5000 தன்னார்வலர்களால் இயக்கப்படுகிறது, அவர்கள் TOR திட்டத்தால் வழங்கப்பட்ட இலவச மென்பொருளைப் பயன்படுத்துகிறார்கள்.

source: The Tor project does provide an automated DNSRBL for you to query to flag requests from Tor nodes as requiring special treatment: https://www.torproject.org/projects/tordnsel.html.en
ta: சிறப்பு மருத்தீடு தேவை என டோர் முனைகளிலிருந்து கொடியிடுவதற்கு நீங்கள் வினவுவதற்கு டோர் திட்டம் ஒரு தானியங்கி டி.என்.எச்.ஆர்.பி.எல் வழங்குகிறது: https://www.torproject.org/projects/tordnsel.html.en

source: The attacker would probably just chain an open proxy after Tor, or just use open wireless and/or a proxy without Tor.
ta: தாக்குபவர் டோருக்குப் பிறகு ஒரு திறந்த ப்ராக்சியை சங்கிலி செய்வார், அல்லது திறந்த வயர்லெச் மற்றும்/அல்லது டோர் இல்லாமல் ப்ராக்சியைப் பயன்படுத்துவார்.

source: The best way to handle abuse complaints is to set up your exit node so that they are less likely to be sent in the first place.
ta: துச்பிரயோக புகார்களைக் கையாள சிறந்த வழி, உங்கள் வெளியேறும் முனையை அமைப்பது, இதனால் அவை முதலில் அனுப்பப்படுவது குறைவு.

source: The common boilerplate should be abridged or be omitted if the abuse complainant is already familiar with Tor.
ta: தீய பயன்பாடு குற்றச்சாட்டு அளிப்பவர் ஏற்கனவே TOR உடன் தெரிந்திருந்தால் பொதுவான கொதிகலன் சுருக்கப்பட வேண்டும் அல்லது தவிர்க்கப்பட வேண்டும்.

source: The difference between the proactive approach and the reactive approach to abuse is the difference between decentralized fault-tolerant Internet freedom, and fragile, corruptible totalitarian control.
ta: செயலில் உள்ள அணுகுமுறைக்கும் துச்பிரயோகத்திற்கான எதிர்வினை அணுகுமுறைக்கும் உள்ள வேறுபாடு பரவலாக்கப்பட்ட தவறு-சகிப்புத்தன்மை கொண்ட இணைய சுதந்திரத்திற்கும், உடையக்கூடிய, சிதைக்கக்கூடிய சர்வாதிகாரக் கட்டுப்பாட்டிற்கும் உள்ள வேறுபாடாகும்.

source: The fact that a few logins happened to come from Tor is likely a small blip on your overall login attempt rate.
ta: TOR இலிருந்து ஒரு சில உள்நுழைவுகள் நிகழ்ந்தன என்பது உங்கள் ஒட்டுமொத்த உள்நுழைவு முயற்சி விகிதத்தில் ஒரு சிறிய பிளிப் ஆகும்.

source: The following scenario-specific paragraphs should be appended to the Common Boilerplate paragraphs above.
ta: பின்வரும் காட்சி-குறிப்பிட்ட பத்திகள் மேலே உள்ள பொதுவான கொதிகலன் பத்திகளில் சேர்க்கப்பட வேண்டும்.

source: The general format of these templates is to inform the complainant about Tor, to help them to find a solution to their particular issue that works in general for the Internet at large (open wifi, open proxies, botnets, etc), and barring all else, how to block Tor.
ta: இந்த வார்ப்புருக்களின் பொதுவான வடிவம் டோர் பற்றி புகார்தாரருக்கு அறிவிப்பதாகும், இணையத்திற்கு பொதுவாக செயல்படும் அவர்களின் குறிப்பிட்ட பிரச்சினைக்கு ஒரு தீர்வைக் கண்டுபிடிக்க அவர்களுக்கு உதவுவதாகும் (திறந்த வைஃபை, திறந்த ப்ராக்சிகள், போட்நெட்டுகள் போன்றவை), மற்றும் எல்லாவற்றையும் தவிர்த்து , டோர் எவ்வாறு தடுப்பது.

source: The philosophy of the Tor Project is that abuse should be handled proactively by the site administrators, rather than wasting effort and resources on seeking vengeance and chasing ghosts.
ta: டோர் திட்டத்தின் உண்மை என்னவென்றால், பழிவாங்கும் மற்றும் பேய்களைத் துரத்துவதில் முயற்சி மற்றும் வளங்களை வீணடிப்பதை விட, தள நிர்வாகிகளால் தீய பயன்பாடு செய்யப்பட வேண்டும்.

source: The same list is available through the Tor Bulk Exit List: https://check.torproject.org/cgi-bin/TorBulkExitList.py
ta: அதே பட்டியல் TOR மொத்த வெளியேறும் பட்டியல் மூலம் கிடைக்கிறது: https://check.torproject.org/cgi-bin/torbulkexitlist.py

source: The system does not record logs of client connections or previous hops.
ta: கிளையன்ட் இணைப்புகள் அல்லது முந்தைய ஆப்சின் பதிவுகளை கணினி பதிவு செய்யாது.

source: There is little we can do to trace this matter further.
ta: இந்த விசயத்தை மேலும் அறிய நாம் செய்யக்கூடியது மிகக் குறைவு.

source: This also does not mean that there is nothing that can be done.
ta: இது எதுவும் செய்ய முடியாது என்று அர்த்தமல்ல.

source: This does not mean that nothing can be done, however.
ta: இருப்பினும், எதையும் செய்ய முடியாது என்று அர்த்தமல்ல.

source: This is because the Tor network is a censorship resistance, privacy, and anonymity system used by whistle blowers, journalists, Chinese dissidents skirting the Great Firewall, abuse victims, stalker targets, the US military, and law enforcement, just to name a few.
ta: ஏனென்றால், டோர் பிணையம் என்பது ஒரு தணிக்கை எதிர்ப்பு, தனியுரிமை மற்றும் விசில் ஊதுகுழல், பத்திரிகையாளர்கள், சீன அதிருப்தியாளர்கள் பயன்படுத்தும் பெரிய ஃபயர்வால், தீய பயன்பாடு பாதிக்கப்பட்டவர்கள், ச்டால்கர் இலக்குகள், அமெரிக்க தரைப்படை மற்றும் சட்ட அமலாக்கங்கள் ஆகியவற்றை சிலருக்கு பெயரிட.

source: This is not legal advice.
ta: இது சட்ட அறிவுரை அல்ல.

source: This is the core idea that these abuse complaint templates attempt to instil in the recipient.
ta: இந்த துச்பிரயோக குற்றச்சாட்டு வார்ப்புருக்கள் பெறுநரில் ஊக்குவிக்க முயற்சிக்கும் முக்கிய சிந்தனை இதுதான்.
