Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: ## If you plan to run exit relays
ta: ## நீங்கள் வெளியேறும் ரிலேக்களை இயக்க திட்டமிட்டால்

source: ## Questions to consider when choosing a host
ta: ஓச்டைத் தேர்ந்தெடுக்கும்போது கருத்தில் கொள்ள வேண்டிய கேள்விகள்

source: ## Time Synchronization (NTP)
ta: ## நேர ஒத்திசைவு (என்.டி.பி)

source: * Does the hoster allow Tor exit relays? We recommend you explicitly ask them before getting started.
ta: * ஓச்டர் டோர் வெளியேறும் ரிலேக்களை அனுமதிக்கிறதா? தொடங்குவதற்கு முன் அவர்களிடம் வெளிப்படையாகக் கேட்குமாறு நாங்கள் பரிந்துரைக்கிறோம்.

source: * Does the hoster allow custom WHOIS records for your IP addresses? This helps reduce the amount of abuse sent to the hoster instead of you.
ta: * உங்கள் ஐபி முகவரிகளுக்கான தனிப்பயன் ஊயிச் பதிவுகளை ஓச்டர் அனுமதிக்கிறதா? இது உங்களுக்கு பதிலாக ஓச்டருக்கு அனுப்பப்படும் துச்பிரயோகத்தின் அளவைக் குறைக்க உதவுகிறது.

source: * Does the hoster allow you to set a custom DNS reverse entry? (DNS PTR record)
ta: * தனிப்பயன் டிஎன்எச் தலைகீழ் உள்ளீட்டை அமைக்க ஓச்டர் உங்களை அனுமதிக்கிறதா? (டி.என்.எச் பி.டி.ஆர் பதிவு)

source: * Does the hoster provide IPv6 connectivity? It is recommended, but not required.
ta: * ஓச்டர் ஐபிவி 6 இணைப்பை வழங்குகிறதா? இது பரிந்துரைக்கப்படுகிறது, ஆனால் தேவையில்லை.

source: * Does the hoster start to throttle bandwidth after a certain amount of traffic?
ta: * ஒரு குறிப்பிட்ட அளவு போக்குவரத்திற்குப் பிறகு அச்டர் அலைவரிசையைத் தூண்டத் தொடங்குகிறதா?

source: * How much monthly traffic is included? Is bandwidth "unmetered"?
ta: * மாதாந்திர போக்குவரத்து எவ்வளவு சேர்க்கப்பட்டுள்ளது? அலைவரிசை "அளவிடப்படாதது"?

source: * How well connected is the autonomous system of the hoster?
ta: * ஓச்டரின் தன்னாட்சி அமைப்பு எவ்வளவு நன்றாக இணைக்கப்பட்டுள்ளது?

source: * What virtualization / hypervisor (if any) does the provider use? Anything but OpenVZ should be fine.
ta: * வழங்குநர் என்ன மெய்நிகராக்க / ஐப்பர்வைசர் (ஏதேனும் இருந்தால்) பயன்படுத்துகிறார்? OpenVZ ஐத் தவிர வேறு எதையும் நன்றாக இருக்க வேண்டும்.

source: * [Autonomous System Level Overview](https://metrics.torproject.org/rs.html#aggregate/as)
ta: * [Autonomous மண்டலம் நிலை Overview](https://metrics.torproject.org/rs.html#aggregate/as)

source: * [Country Level Overview](https://metrics.torproject.org/rs.html#aggregate/cc)
ta: * [Country நிலை Overview](https://metrics.torproject.org/rs.html#aggregate/cc)

source: A more diverse network is more resilient to attacks and outages.
ta: மிகவும் மாறுபட்ட பிணையம் தாக்குதல்கள் மற்றும் செயலிழப்புகளுக்கு மிகவும் நெகிழ்ச்சியுடன் உள்ளது.

source: Correct time settings are essential for Tor relays. It is recommended that you use the network time protocol (NTP) for time synchronization and ensure your timezone is set correctly.
ta: டோர் ரிலேக்களுக்கு சரியான நேர அமைப்புகள் தேவை. நேர ஒத்திசைவுக்கு பிணையம் நேர நெறிமுறையை (என்.டி.பி) பயன்படுத்தவும், உங்கள் நேர மண்டலம் சரியாக அமைக்கப்பட்டிருப்பதை உறுதிப்படுத்தவும் பரிந்துரைக்கப்படுகிறது.

source: For more information on hosting providers and their policies on allowing Tor relays, please see this list maintained by the Tor community: [GoodBadISPs](../community-resources/good-bad-isps/).
ta: ஓச்டிங் வழங்குநர்கள் மற்றும் டோர் ரிலேக்களை அனுமதிப்பது குறித்த அவர்களின் கொள்கைகள் பற்றிய கூடுதல் தகவலுக்கு, தயவுசெய்து TOR சமூகத்தால் பராமரிக்கப்படும் இந்த பட்டியலைப் பார்க்கவும்: [குட்பாடிச்ப்ச்] (../ சமூக-வளங்கள்/நல்ல-BAD-ISPS/).

source: Having access to a high speed internet connection (>=100 Mbit/s in both directions) and a physical piece of computer hardware is the best way to run a relay.
ta: அதிவேக இணைய இணைப்பு (> = 100 mbit/s இரு திசைகளிலும்) மற்றும் கணினி வன்பொருளின் இயற்பியல் துண்டு ஆகியவை ரிலேவை இயக்க சிறந்த வழியாகும்.

source: Having full control over the hardware and connection gives you a more controllable and (if done correctly) secure environment.
ta: வன்பொருள் மற்றும் இணைப்பு மீது முழு கட்டுப்பாட்டைக் கொண்டிருப்பது உங்களுக்கு மிகவும் கட்டுப்படுத்தக்கூடிய மற்றும் (சரியாகச் செய்தால்) பாதுகாப்பான சூழலை வழங்குகிறது.

source: If you do not own physical hardware, you could run a relay on a rented dedicated server or virtual private server (VPS).
ta: உங்களிடம் உடல் வன்பொருள் இல்லையென்றால், வாடகை பிரத்யேக சேவையகம் அல்லது மெய்நிகர் தனியார் சேவையகத்தில் (வி.பி.எச்) ரிலேவை இயக்கலாம்.

source: It is best to avoid hosts where many Tor relays are already hosted, but it is still better to add one there than to run no relay at all.
ta: பல டோர் ரிலேக்கள் ஏற்கனவே புரவலன் செய்யப்பட்ட ஓச்ட்களைத் தவிர்ப்பது நல்லது, ஆனால் ரிலேவை இயக்குவதை விட ஒன்றை சேர்ப்பது இன்னும் நல்லது.

source: Many VPS providers will not allow you to run exit relays.
ta: பல வி.பி.எச் வழங்குநர்கள் வெளியேறும் ரிலேக்களை இயக்க உங்களை அனுமதிக்க மாட்டார்கள்.

source: Most relays currently run on Debian.
ta: பெரும்பாலான ரிலேக்கள் தற்போது டெபியனில் இயங்குகின்றன.

source: OS configuration is outside the scope of this guide, but the following points are crucial for a Tor relay, so we want to mention them here nonetheless.
ta: OS உள்ளமைவு இந்த வழிகாட்டியின் எல்லைக்கு வெளியே உள்ளது, ஆனால் ஒரு டோர் ரிலேவுக்கு பின்வரும் புள்ளிகள் முக்கியமானவை, எனவே அவற்றை இங்கே குறிப்பிட விரும்புகிறோம்.

source: Sometimes it is not clear which AS you are buying from in case of resellers.
ta: மறுவிற்பனையாளர்களின் விசயத்தில் நீங்கள் எதை வாங்குகிறீர்கள் என்பது சில நேரங்களில் தெளிவாக இல்லை.

source: Sometimes this is referred to as installing the relay on "bare metal."
ta: சில நேரங்களில் இது "வெற்று உலோகத்தில்" ரிலேவை நிறுவுவதாக குறிப்பிடப்படுகிறது.

source: The following table shows the current OS distribution on the Tor network to give you an idea of how much more non-Linux relays we should have:
ta: TOR நெட்வொர்க்கில் தற்போதைய OS விநியோகத்தை பின்வரும் அட்டவணை காட்டுகிறது, இது நம்மிடம் இருக்க வேண்டிய லினக்ச் அல்லாத ரிலேக்கள் எவ்வளவு அதிகமாக இருக்க வேண்டும் என்பதற்கான ஒரு யோசனையை உங்களுக்கு வழங்குகிறது:

source: This can cost anywhere between $3.00/month and thousands per month, depending on your provider, hardware configuration, and bandwidth usage.
ta: இது உங்கள் வழங்குநர், வன்பொருள் உள்ளமைவு மற்றும் அலைவரிசை பயன்பாட்டைப் பொறுத்து மாதத்திற்கு 00 3.00 முதல் மாதத்திற்கு ஆயிரக்கணக்கானோ வரை செலவாகும்.

source: To answer this question you can use the AS rank of the autonomous systems if you want to compare: (a lower value is better) <https://asrank.caida.org/>
ta: இந்த கேள்விக்கு பதிலளிக்க நீங்கள் ஒப்பிட்டுப் பார்க்க விரும்பினால் தன்னாட்சி அமைப்புகளின் பதவியைப் பயன்படுத்தலாம்: (குறைந்த மதிப்பு சிறந்தது) <https://asrank.caida.org/>

source: To be sure, ask the host about the AS number before ordering a server.
ta: நிச்சயமாக, சேவையகத்தை ஆர்டர் செய்வதற்கு முன் அச் எண்ணைப் பற்றி ஓச்டிடம் கேளுங்கள்.

source: To find out which host and countries are already used by many other operators (that should be avoided) you can use Relay Search:
ta: பல ஆபரேட்டர்களால் ஏற்கனவே எந்த புரவலன் மற்றும் நாடுகள் பயன்படுத்தப்படுகின்றன என்பதை அறிய (அவை தவிர்க்கப்பட வேண்டும்) நீங்கள் ரிலே தேடலைப் பயன்படுத்தலாம்:

source: We recommend using the operating system you are most familiar with, but if you're able, the network would most benefit from BSD and other non-Linux based relays.
ta: உங்களுக்கு மிகவும் பரிச்சயமான இயக்க முறைமையைப் பயன்படுத்த நாங்கள் பரிந்துரைக்கிறோம், ஆனால் உங்களால் முடிந்தால், பிணையம் பி.எச்.டி மற்றும் பிற லினக்ச் அல்லாத அடிப்படையிலான ரிலேக்களிலிருந்து அதிக பயனடைகிறது.

source: When selecting your hosting provider, consider network diversity on an autonomous system (AS) and country level.
ta: உங்கள் ஓச்டிங் வழங்குநரைத் தேர்ந்தெடுக்கும்போது, ஒரு தன்னாட்சி அமைப்பு (AS) மற்றும் நாட்டின் மட்டத்தில் பிணைய பன்முகத்தன்மையைக் கவனியுங்கள்.

source: You can host your own physical hardware at home (do NOT run a Tor exit relay from your home) or in a data center.
ta: உங்கள் சொந்த உடல் வன்பொருளை வீட்டில் புரவலன் செய்யலாம் (உங்கள் வீட்டிலிருந்து டோர் வெளியேறும் ரிலேவை இயக்க வேண்டாம்) அல்லது தரவு மையத்தில்.

source: You can usually ask these questions in a Pre-Sales ticket.
ta: விற்பனைக்கு முந்தைய டிக்கெட்டில் நீங்கள் வழக்கமாக இந்த கேள்விகளைக் கேட்கலாம்.

source: You must follow the VPS provider's terms of service, or risk having your account disabled.
ta: நீங்கள் வி.பி.எச் வழங்குநரின் பணி விதிமுறைகளைப் பின்பற்ற வேண்டும், அல்லது உங்கள் கணக்கு முடக்கப்பட்ட அபாயத்தை நீங்கள் பின்பற்ற வேண்டும்.

source: How to choose a good hosting provider, what's an AS and Operating System diversity.
ta: ஒரு நல்ல ஓச்டிங் வழங்குநரை எவ்வாறு தேர்வு செய்வது, என்ன மற்றும் இயக்க முறைமை பன்முகத்தன்மை.

source: Technical considerations
ta: தொழில்நுட்ப பரிசீலனைகள்

source: # Bridge
ta: # பாலம்

source: # Example Tor Circuit:
ta: # எடுத்துக்காட்டு டோர் சர்க்யூட்:

source: # Exit relay
ta: # வெளியேறு ரிலே

source: # Guard and middle relays
ta: # காவலர் மற்றும் நடுத்தர ரிலேக்கள்

source: (also known as non-exit relays)
ta: (வெளியேற்றப்படாத ரிலேக்கள் என்றும் அழைக்கப்படுகிறது)

source: A bridge isn't likely to receive any abuse complaints, and since bridges are not listed as public relays, they are unlikely to be blocked by popular services.
ta: ஒரு பாலம் எந்தவொரு துச்பிரயோக புகார்களையும் பெற வாய்ப்பில்லை, மேலும் பாலங்கள் பொது ரிலேக்களாக பட்டியலிடப்படாததால், அவை பிரபலமான சேவைகளால் தடுக்கப்பட வாய்ப்பில்லை.

source: A guard relay is the first relay (hop) in a Tor circuit.
ta: ஒரு காவலர் ரிலே என்பது ஒரு டோர் சர்க்யூட்டில் முதல் ரிலே (ஆப்) ஆகும்.

source: A middle relay is a relay that acts as the second hop in the Tor circuit.
ta: ஒரு நடுத்தர ரிலே என்பது டோர் சர்க்யூட்டில் இரண்டாவது ஆப்பாக செயல்படும் ஒரு ரிலே ஆகும்.

source: A non-exit Tor relay requires minimal maintenance efforts and bandwidth usage can be highly customized in the Tor configuration.
ta: ஒரு வெளியேற்றமற்ற டோர் ரிலேக்கு குறைந்தபட்ச பராமரிப்பு முயற்சிகள் தேவை மற்றும் TOR உள்ளமைவில் அலைவரிசை பயன்பாடு மிகவும் தனிப்பயனாக்கப்படலாம்.

source: A non-exit relay does not allow exiting in its exit policy.
ta: வெளியேற்றப்படாத ரிலே அதன் வெளியேறும் கொள்கையில் வெளியேற அனுமதிக்காது.

source: All types of relays are important, but they have different technical requirements and potential legal implications.
ta: அனைத்து வகையான ரிலேக்களும் முக்கியமானவை, ஆனால் அவை வெவ்வேறு தொழில்நுட்ப தேவைகள் மற்றும் சாத்தியமான சட்டரீதியான தாக்கங்களைக் கொண்டுள்ளன.

source: An institution can not only provide greater bandwidth for the exit, but is better positioned to handle abuse complaints or the rare law enforcement inquiry.
ta: ஒரு நிறுவனம் வெளியேறுவதற்கு அதிக அலைவரிசையை வழங்குவதோடு மட்டுமல்லாமல், துச்பிரயோக புகார்களையும் அல்லது அரிய சட்ட அமலாக்க விசாரணையையும் கையாள சிறந்த நிலையில் உள்ளது.

source: Any abuse complaints about the exit will go directly to you (via your hosting provider, depending on the WHOIS records).
ta: வெளியேறுவது குறித்த எந்தவொரு துச்பிரயோக புகார்களும் உங்களிடம் நேரடியாகச் செல்லும் (உங்கள் ஓச்டிங் வழங்குநர் வழியாக, WHOIS பதிவுகளைப் பொறுத்து).

source: Because of the legal exposure that comes with running an exit relay, you should not run a Tor exit relay from your home.
ta: வெளியேறும் ரிலேவை இயக்குவதன் மூலம் வரும் சட்டரீதியான வெளிப்பாடு காரணமாக, நீங்கள் உங்கள் வீட்டிலிருந்து ஒரு டோர் வெளியேறும் ரிலேவை இயக்கக்கூடாது.

source: Bridges are a great option if you can only run a Tor node from your home network, have only one static IP, and don't have a large amount of bandwidth to donate -- we recommend giving your bridge at least 1 Mbit/sec of bandwidth.
ta: உங்கள் வீட்டு நெட்வொர்க்கிலிருந்து ஒரு டோர் முனையை மட்டுமே இயக்க முடியும், ஒரே ஒரு நிலையான ஐபி மட்டுமே இருக்க முடியும், மேலும் நன்கொடை அளிக்க பெரிய அளவிலான அலைவரிசை இல்லை என்றால் பாலங்கள் ஒரு சிறந்த வழி - உங்கள் பாலத்திற்கு குறைந்தது 1 mbit/நொடி கொடுக்க பரிந்துரைக்கிறோம் அலைவரிசை.

source: Bridges are relatively easy, low-risk and low bandwidth Tor nodes to operate, but they have a big impact on users.
ta: பாலங்கள் ஒப்பீட்டளவில் எளிதானவை, குறைந்த இடர் மற்றும் குறைந்த அலைவரிசை டோர் முனைகள் செயல்படுகின்றன, ஆனால் அவை பயனர்களுக்கு பெரிய தாக்கத்தை ஏற்படுத்துகின்றன.

source: Bridges are useful for Tor users under oppressive regimes or for people who want an extra layer of security because they're worried somebody will recognize that they are contacting a public Tor relay IP address.
ta: அடக்குமுறை ஆட்சிகளின் கீழ் டோர் பயனர்களுக்கு அல்லது கூடுதல் பாதுகாப்பை விரும்பும் நபர்களுக்கு பாலங்கள் பயனுள்ளதாக இருக்கும், ஏனென்றால் அவர்கள் ஒரு பொது டோர் ரிலே ஐபி முகவரியைத் தொடர்புகொள்வதை யாராவது அங்கீகரிப்பார்கள் என்று அவர்கள் கவலைப்படுகிறார்கள்.

source: Exit relays have the greatest legal exposure and liability of all the relays.
ta: வெளியேறும் ரிலேக்கள் அனைத்து ரிலேக்களின் மிகப் பெரிய சட்ட வெளிப்பாடு மற்றும் பொறுப்பு ஆகியவற்றைக் கொண்டுள்ளன.

source: For example, if a user downloads copyrighted material while using your exit relay, you, the operator may receive a [DMCA notice](https://www.dmca.com/Solutions/view.aspx?ID=712f28a5-93f2-467b-ba92-3d58c8345a32&?ref=sol08a2).
ta: எடுத்துக்காட்டாக, உங்கள் வெளியேறும் ரிலேவைப் பயன்படுத்தும் போது ஒரு பயனர் பதிப்புரிமை பெற்ற பொருளை பதிவிறக்கம் செய்தால், நீங்கள், ஆபரேட்டருக்கு [DMCA அறிவிப்பு] (https://www.dmca.com/solutions/view.aspx?id=712f28a5-93f2-467b-3d58c8c832&has832&has832v ஐப் பெறலாம்.

source: Generally, most complaints can be handled pretty easily through [template letters](../community-resources/tor-abuse-templates/).
ta: பொதுவாக, பெரும்பாலான புகார்களை [வார்ப்புரு கடிதங்கள்] (../ சமூக வளங்கள்/டோர்-துச்பிரயோகம்-டெம்ப்ளேட்டுகள்/) மூலம் மிக எளிதாக கையாள முடியும்.

source: Guard and middle relays usually do not receive abuse complaints.
ta: காவலர் மற்றும் நடுத்தர ரிலேக்கள் பொதுவாக துச்பிரயோக புகார்களைப் பெறுவதில்லை.

source: However, all relays are listed in the public Tor relay directory, and as a result, they may be blocked by certain services.
ta: இருப்பினும், அனைத்து ரிலேக்களும் பொது TOR ரிலே கோப்பகத்தில் பட்டியலிடப்பட்டுள்ளன, இதன் விளைவாக, அவை சில சேவைகளால் தடுக்கப்படலாம்.

source: However, one of the ways Tor can be blocked by governments or ISPs is by blocklisting the IP addresses of these public Tor relays.
ta: எவ்வாறாயினும், இந்த பொது TOR ரிலேக்களின் ஐபி முகவரிகளை தடுப்புப்பட்டியலில் வைப்பதன் மூலம் அரசாங்கங்கள் அல்லது ISP களால் தடுக்கப்படுவதற்கான வழிகளில் ஒன்று.

source: Ideal exit relay operators are affiliated with some institution, like a [relay association](../community-resources/relay-associations/), a university, a library, a hackerspace or a privacy related organization.
ta: ஐடியல் எக்சிட் ரிலே ஆபரேட்டர்கள் [ரிலே அசோசியேசன்] (../ சமூக வளங்கள்/ரிலே-அசோசியேசன்ச்/), ஒரு பல்கலைக்கழகம், நூலகம், ஏக்கர்ச்பேச் அல்லது தனியுரிமை தொடர்பான அமைப்பு போன்ற சில நிறுவனங்களுடன் இணைந்திருக்கிறார்கள்.

source: If you are considering running an exit relay, please read the [section on legal considerations](../community-resources) for exit relay operators.
ta: வெளியேறும் ரிலேவை இயக்குவதை நீங்கள் கருத்தில் கொண்டால், வெளியேறும் ரிலே ஆபரேட்டர்களுக்கான [சட்டபூர்வமான பரிசீலனைகள்] (../ சமூக வளங்கள்) ஐப் படிக்கவும்.

source: Please see the [relay requirements](../relays-requirements/) page to learn about the technical requirements for each relay type.
ta: ஒவ்வொரு ரிலே வகைக்கும் தொழில்நுட்ப தேவைகளைப் பற்றி அறிய [ரிலே தேவைகள்] (../ ரிலேச்-நிர்ணயிப்புகள்/) பக்கத்தைப் பார்க்கவும்.

source: Several countries, including China and Iran, have found ways to detect and block connections to Tor bridges.
ta: சீனா மற்றும் ஈரான் உட்பட பல நாடுகள் டோர் பாலங்களுடனான இணைப்புகளைக் கண்டறிந்து தடுப்பதற்கான வழிகளைக் கண்டறிந்துள்ளன.

source: The design of the Tor network means that the IP addresses of Tor relays (guard, middle, and exit) are public.
ta: TOR நெட்வொர்க்கின் வடிவமைப்பு என்பது TOR ரிலேக்களின் ஐபி முகவரிகள் (காவலர், நடுத்தர மற்றும் வெளியேறுதல்) பொதுவில் உள்ளன.

source: The exit relay is the final relay in a Tor circuit, the one that sends traffic out to its destination.
ta: வெளியேறும் ரிலே என்பது ஒரு டோர் சர்க்யூட்டில் இறுதி ரிலே ஆகும், இது போக்குவரத்தை அதன் இலக்குக்கு அனுப்புகிறது.

source: The services Tor clients are connecting to (website, chat service, email provider, etc) will see the IP address of the exit relay instead of the real IP address of the Tor user.
ta: டோர் வாடிக்கையாளர்கள் (வலைத்தளம், அரட்டை பணி, மின்னஞ்சல் வழங்குநர் போன்றவை) இணைக்கும் சேவைகள் TOR பயனரின் உண்மையான ஐபி முகவரிக்கு பதிலாக வெளியேறும் ரிலேவின் ஐபி முகவரியைக் காண்பார்கள்.

source: The so called "exit policy" of the relay decides if it is a relay allowing clients to exit or not.
ta: ரிலேவின் "வெளியேறும் கொள்கை" என்று அழைக்கப்படுவது வாடிக்கையாளர்களை வெளியேற அனுமதிக்கும் ரிலே என்பதை தீர்மானிக்கிறது.

source: These include services that either misunderstand how Tor works or deliberately want to censor Tor users, for example, online banking and streaming services.
ta: டோர் எவ்வாறு செயல்படுகிறது அல்லது வேண்டுமென்றே பயனர்களை தணிக்கை செய்ய விரும்பும் சேவைகள் இதில் அடங்கும், எடுத்துக்காட்டாக, நிகழ்நிலை வங்கி மற்றும் ச்ட்ரீமிங் சேவைகள்.

source: This alternative can help prevent your non-Tor traffic from being mistakenly blocked as though it's coming from a Tor relay.
ta: இந்த மாற்று உங்கள் அல்லாத போக்குவரத்து ஒரு டோர் ரிலேவிலிருந்து வருவது போல் தவறாக தடுக்கப்படுவதைத் தடுக்க உதவும்.

source: To become a guard relay, the relay has to be stable and fast (at least 2MByte/s of upstream and downstream bandwidth) otherwise it will remain a middle relay.
ta: ஒரு காவலர் ரிலே ஆக, ரிலே நிலையானதாகவும் வேகமாகவும் இருக்க வேண்டும் (குறைந்தது 2mbyte/s மேலோடை மற்றும் கீழ்நிலை அலைவரிசை) இல்லையெனில் அது ஒரு நடுத்தர ரிலே ஆக இருக்கும்.

source: Tor User -> Bridge Relay -> Middle Relay -> Exit Relay -> Destination (i.e example.com)
ta: டோர் பயனர் -> பிரிட்ச் ரிலே -> நடுத்தர ரிலே -> வெளியேறு ரிலே -> இலக்கு (அதாவது எடுத்துக்காட்டு.காம்)

source: Tor User -> Guard Relay -> Middle Relay -> Exit Relay -> Destination (i.e example.com)
ta: டோர் பயனர் -> காவலர் ரிலே -> நடுத்தர ரிலே -> வெளியேறு ரிலே -> இலக்கு (அதாவது எடுத்துக்காட்டு.காம்)

source: Tor bridges are relays in the network that are not listed in the public Tor directory, which makes it harder for ISPs and governments to block them.
ta: டோர் பிரிட்சச் நெட்வொர்க்கில் ரிலேக்கள், அவை பொது TOR கோப்பகத்தில் பட்டியலிடப்படவில்லை, இது ISP களுக்கும் அரசாங்கங்களுக்கும் அவற்றைத் தடுப்பதை கடினமாக்குகிறது.

source: Understanding the different kinds of relays is the first step to learning which one is right for you.
ta: பல்வேறு வகையான ரிலேக்களைப் புரிந்துகொள்வது உங்களுக்கு எது சரியானது என்பதைக் கற்றுக்கொள்வதற்கான முதல் படியாகும்.

source: When using a bridge:
ta: ஒரு பாலத்தைப் பயன்படுத்தும் போது:

source: [Pluggable transports](https://tb-manual.torproject.org/circumvention/), a special kind of bridge, address this by adding an additional layer of obfuscation.
ta: [Pluggable transports](https://tb-manual.torproject.org/circumvention/), a special kind of bridge, முகவரி this by adding an additional layer of obfuscation.

source: Bridges, guards, middle relays, and exits all serve important functions in the Tor network. Learn about the different relays you can run.
ta: பாலங்கள், காவலர்கள், நடுத்தர ரிலேக்கள் மற்றும் வெளியேறுதல் அனைத்தும் TOR நெட்வொர்க்கில் முக்கியமான செயல்பாடுகளை வழங்குகின்றன. நீங்கள் இயக்கக்கூடிய வெவ்வேறு ரிலேக்களைப் பற்றி அறிக.

source: Types of relays on the Tor network
ta: TOR நெட்வொர்க்கில் ரிலேக்களின் வகைகள்

source: **Note**: This threat model documentation is incomplete and a work-in-progress at this point.
ta: ** குறிப்பு **: இந்த அச்சுறுத்தல் மாதிரி ஆவணங்கள் முழுமையடையாது மற்றும் இந்த கட்டத்தில் ஒரு வேலை முன்னேற்றம்.

source: A comprehensive threat model helps to identify potential vulnerabilities, assess the risks, and design appropriate mitigation strategies to protect both users and the network itself.
ta: ஒரு விரிவான அச்சுறுத்தல் மாதிரி சாத்தியமான பாதிப்புகளை அடையாளம் காணவும், அபாயங்களை மதிப்பிடவும், பயனர்களையும் பிணையத்தையும் பாதுகாக்க பொருத்தமான தணிப்பு உத்திகளை வடிவமைக்கவும் உதவுகிறது.

source: As an open and decentralized system, Tor relies on a global network of volunteer-operated relays, making it both resilient and a target for various forms of attacks.
ta: ஒரு திறந்த மற்றும் பரவலாக்கப்பட்ட அமைப்பாக, டோர் தன்னார்வ-இயக்கப்படும் ரிலேக்களின் உலகளாவிய வலையமைப்பை நம்பியுள்ளது, இது நெகிழக்கூடியது மற்றும் பல்வேறு வகையான தாக்குதல்களுக்கான இலக்காக அமைகிறது.

source: In this section, we provide a detailed overview of the adversaries targeting Tor, their methods of attack, and the systems in place to counter them, helping Tor continue to serve as a secure platform for privacy-conscious users.
ta: இந்த பிரிவில், டோர் குறிவைக்கும் எதிரிகளின் விரிவான கண்ணோட்டத்தை நாங்கள் வழங்குகிறோம், அவற்றின் தாக்குதல் முறைகள் மற்றும் அவற்றை எதிர்ப்பதற்கான அமைப்புகள், தனியுரிமை உணர்வுள்ள பயனர்களுக்கான பாதுகாப்பான தளமாக டோர் தொடர்ந்து பணியாற்ற உதவுகிறது.

source: It mainly covers elements we worked on during a project on improving network health.
ta: பிணையம் ஆரோக்கியத்தை மேம்படுத்துவதற்கான ஒரு திட்டத்தின் போது நாங்கள் பணியாற்றிய கூறுகளை இது முக்கியமாக உள்ளடக்கியது.

source: Large parts, e.g. related to onion services, are still missing.
ta: பெரிய பாகங்கள், எ.கா. வெங்காய சேவைகளுடன் தொடர்புடையது, இன்னும் காணவில்லை.

source: The Tor network, designed to safeguard privacy and enable anonymous communication, is constantly under threat from adversaries who seek to exploit its vulnerabilities.
ta: தனியுரிமையைப் பாதுகாக்கவும், அநாமதேய தகவல்தொடர்புகளை செயல்படுத்தவும் வடிவமைக்கப்பட்ட டோர் பிணையம், அதன் பாதிப்புகளை சுரண்ட முற்படும் எதிரிகளிடமிருந்து தொடர்ந்து அச்சுறுத்தலுக்கு உள்ளாகியுள்ளது.

source: These threats range from malicious relays attempting to disrupt traffic or compromise user anonymity, to sophisticated surveillance tactics aimed at deanonymizing users or undermining the network’s integrity.
ta: இந்த அச்சுறுத்தல்கள் தீங்கிழைக்கும் ரிலேக்கள் போக்குவரத்தை சீர்குலைக்க அல்லது பயனர் அநாமதேயத்தை வேறுபாடின்மை செய்ய முயற்சிப்பது, பயனர்களைக் குறைப்பதை நோக்கமாகக் கொண்ட அதிநவீன கண்காணிப்பு தந்திரங்கள் வரை அல்லது நெட்வொர்க்கின் ஒருமைப்பாட்டைக் குறைமதிப்பிற்கு உட்படுத்தும்.

source: To defend against these threats, it is important to understand the types of attackers the network faces, their capabilities, and their objectives.
ta: இந்த அச்சுறுத்தல்களுக்கு எதிராக பாதுகாக்க, பிணையம் எதிர்கொள்ளும் தாக்குபவர்களின் வகைகள், அவற்றின் திறன்கள் மற்றும் அவற்றின் நோக்கங்களைப் புரிந்துகொள்வது தேவை.

source: Learn about threats
ta: அச்சுறுத்தல்கள் பற்றி அறிந்து கொள்ளுங்கள்

source: Threat Model
ta: அச்சுறுத்தல் மாதிரி

source: How we mitigate threats to Tor
ta: TOR க்கு நாங்கள் எவ்வாறு அச்சுறுத்தல்களைத் தணிக்கிறோம்

source: # Mitigating Malicious Relays
ta: # தீங்கிழைக்கும் ரிலேக்களைத் தணித்தல்

source: Additionally, our network health team carries out investigations to discover new or unknown attacks that might bypass automated systems.
ta: கூடுதலாக, எங்கள் பிணையம் எல்த் குழு தானியங்கி அமைப்புகளைத் தவிர்ப்பதற்கான புதிய அல்லது அறியப்படாத தாக்குதல்களைக் கண்டறிய விசாரணைகளை மேற்கொள்கிறது.

source: Beyond technical measures, Tor emphasizes community-building. A trusted and tight-knit community can make it more difficult for attackers to operate.
ta: தொழில்நுட்ப நடவடிக்கைகளுக்கு அப்பால், டோர் சமூகத்தை உருவாக்குவதை வலியுறுத்துகிறார். நம்பகமான மற்றும் இறுக்கமான சமூகம் தாக்குதல் நடத்துபவர்களுக்கு செயல்படுவதை மிகவும் கடினமாக்கும்.

source: Building trust within the relay operator community is a long-term effort, that is supported by regular meet-ups, open discussions, and transparent processes aimed at improving the network’s health.
ta: ரிலே ஆபரேட்டர் சமூகத்திற்குள் நம்பிக்கையை வளர்ப்பது ஒரு நீண்டகால முயற்சியாகும், இது வழக்கமான சந்திப்புகள், திறந்த விவாதங்கள் மற்றும் நெட்வொர்க்கின் ஆரோக்கியத்தை மேம்படுத்துவதை நோக்கமாகக் கொண்ட வெளிப்படையான செயல்முறைகள் ஆகியவற்றால் ஆதரிக்கப்படுகிறது.

source: Community members can help identify malicious relays by reporting suspicious behavior through channels such as emails or other reporting systems.
ta: மின்னஞ்சல்கள் அல்லது பிற அறிக்கையிடல் அமைப்புகள் போன்ற சேனல்கள் மூலம் சந்தேகத்திற்கிடமான நடத்தையைப் புகாரளிப்பதன் மூலம் தீங்கிழைக்கும் ரிலேக்களை அடையாளம் காண சமூக உறுப்பினர்கள் உதவலாம்.
