Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: Before turning your non-exit relay into an exit relay, ensure that you have set a reverse DNS record (PTR) to make it more obvious that this is a tor exit relay. Something like "tor-exit" in its name is a good start.
ta: உங்கள் வெளியேற்றப்படாத ரிலேவை வெளியேறும் ரிலேவாக மாற்றுவதற்கு முன், இது ஒரு டோர் வெளியேறும் ரிலே என்பதை இன்னும் தெளிவுபடுத்துவதற்காக நீங்கள் ஒரு தலைகீழ் டிஎன்எச் பதிவை (பி.டி.ஆர்) அமைத்துள்ளீர்கள் என்பதை உறுதிப்படுத்தவும். அதன் பெயரில் "டோர்-எக்சிட்" போன்றது ஒரு நல்ல தொடக்கமாகும்.

source: Below are instructions on how to install and configure **Unbound** - a DNSSEC-validating and caching resolver - on your exit relay. Unbound has many configuration and tuning knobs, but we keep these instructions simple and short; the basic setup will do just fine for most operators.
ta: உங்கள் வெளியேறும் ரிலேயில் ** வரம்பற்ற ** - ஒரு DNSSEC- சரிபார்க்கும் மற்றும் தேக்கக தீர்வை எவ்வாறு நிறுவுவது மற்றும் கட்டமைப்பது என்பதற்கான வழிமுறைகள் கீழே உள்ளன. வரம்பற்ற பல உள்ளமைவு மற்றும் ட்யூனிங் கைப்பிடிகளைக் கொண்டுள்ளது, ஆனால் இந்த வழிமுறைகளை எளிமையாகவும் குறுகியதாகவும் வைத்திருக்கிறோம்; அடிப்படை அமைப்பு பெரும்பாலான ஆபரேட்டர்களுக்கு நன்றாக இருக்கும்.

source: By using your own DNS resolver, you are less vulnerable to DNS-based censorship that your upstream resolver might impose.
ta: உங்கள் சொந்த டிஎன்எச் தீர்வைப் பயன்படுத்துவதன் மூலம், உங்கள் மேலோடை தீர்மானி விதிக்கக்கூடிய டிஎன்எச் அடிப்படையிலான தணிக்கைக்கு நீங்கள் குறைவாகவே பாதிக்கப்படுகிறீர்கள்.

source: DNS resolution on exit relays is crucial for Tor clients and it should be reliable and fast by using caching.
ta: வெளியேறும் ரிலேக்களில் டிஎன்எச் தீர்மானம் டோர் வாடிக்கையாளர்களுக்கு முக்கியமானது, மேலும் இது கேச்சிங்கைப் பயன்படுத்துவதன் மூலம் நம்பகமானதாகவும் வேகமாகவும் இருக்க வேண்டும்.

source: Defining the [exit policy](https://www.torproject.org/docs/tor-manual.html.en#ExitPolicy) is one of the most important parts of an exit relay configuration.
ta: [வெளியேறும் கொள்கையை] (https://www.torproject.org/docs/tor-manual.html.en#exitpolicy) வரையறுப்பது வெளியேறும் ரிலே உள்ளமைவின் மிக முக்கியமான பகுதிகளில் ஒன்றாகும்.

source: Do not mix your own traffic with your exit relay traffic.
ta: உங்கள் வெளியேறும் ரிலே போக்குவரத்துடன் உங்கள் சொந்த போக்குவரத்தை கலக்க வேண்டாம்.

source: Do use a domain name that you own. Definitely do not use `torproject.org` as a domain name for your reverse DNS.
ta: உங்களுக்கு சொந்தமான டொமைன் பெயரைப் பயன்படுத்துங்கள். உங்கள் தலைகீழ் டி.என்.எச்சிற்கான டொமைன் பெயராக `torproject.org` ஐ நிச்சயமாக பயன்படுத்த வேண்டாம்.

source: For more information read its [release notes](https://blog.torproject.org/node/2041) and [ticket #40282](https://gitlab.torproject.org/tpo/core/tor/-/issues/40282).
ta: மேலும் தகவலுக்கு அதன் [வெளியீட்டுக் குறிப்புகள்](https://blog.torproject.org/node/2041) மற்றும் [டிக்கெட் #40282](https://gitlab.torproject.org/tpo/core/tor/-/issues/40282) ஐப் படிக்கவும்.

source: For unbound you can use the `outgoing-interface` option to specify the source IP addresses for contacting other DNS servers.
ta: வரம்பற்ற நிலையில், பிற டிஎன்எச் சேவையகங்களைத் தொடர்புகொள்வதற்கான மூல ஐபி முகவரிகளைக் குறிப்பிட `வெளிச்செல்லும்-இடைமுகம்` விருப்பத்தைப் பயன்படுத்தலாம்.

source: If you didn't set this up before, the following configuration lines must be applied to your `torrc`:
ta: இதை நீங்கள் முன்பே அமைக்கவில்லை என்றால், பின்வரும் உள்ளமைவு கோடுகள் உங்கள் `டோர்க்` க்கு பயன்படுத்தப்பட வேண்டும்:

source: If you want to be a useful exit relay you must **at least allow destination ports 80 and 443**.
ta: நீங்கள் ஒரு பயனுள்ள வெளியேறும் ரிலே ஆக விரும்பினால், நீங்கள் குறைந்தபட்சம் இலக்கு துறைமுகங்களை 80 மற்றும் 443 ** அனுமதிக்க வேண்டும்.

source: If your provider offers it, make sure your [WHOIS](https://whois.icann.org/en/about-whois) record contains clear indications that this is a Tor exit relay.
ta: உங்கள் வழங்குநர் அதை வழங்கினால், உங்கள் [WHOIS] (https://whois.icann.org/en/about-whois) பதிவில் இது ஒரு டோர் வெளியேறும் ரிலே என்பதற்கான தெளிவான அறிகுறிகளைக் கொண்டுள்ளது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: Install the resolver software over your operating system's package manager, to ensure that it is updated automatically.
ta: உங்கள் இயக்க முறைமையின் தொகுப்பு மேலாளரின் மூலம் தீர்வி மென்பொருளை நிறுவவும், அது தானாகவே புதுப்பிக்கப்படுவதை உறுதிசெய்க.

source: It is not recommended to install Tor exit relays on servers that you need for other services as well.
ta: மற்ற சேவைகளுக்கும் உங்களுக்குத் தேவையான சேவையகங்களில் டோர் வெளியேறும் ரிலேக்களை நிறுவ பரிந்துரைக்கப்படவில்லை.

source: It is recommended that you setup exit relays on servers dedicated to this purpose.
ta: இந்த நோக்கத்திற்காக அர்ப்பணிக்கப்பட்ட சேவையகங்களில் வெளியேறும் ரிலேக்களை அமைக்க பரிந்துரைக்கப்படுகிறது.

source: Note: **DirPort** is deprecated since Tor 0.4.6.5, and self-tests are no longe being showed on `tor`'s logs.
ta: குறிப்பு: ** டார்போர்ட் ** டோர் 0.4.6.5 முதல் நீக்கப்பட்டது, மேலும் தன்வய பரிசோதனைகள் `டோர்` பதிவுகளில் நீண்ட காலமாகக் காட்டப்படவில்லை.

source: The exit policy defines which destination ports you are willing to forward.
ta: வெளியேறும் கொள்கை நீங்கள் எந்த இலக்கு துறைமுகங்களை அனுப்ப தயாராக உள்ளது என்பதை வரையறுக்கிறது.

source: The following metric can be used to monitor the timeout rate as seen by Tor:
ta: டோர் பார்த்தபடி காலக்கெடு விகிதத்தை கண்காணிக்க பின்வரும் மெட்ரிக் பயன்படுத்தப்படலாம்:

source: The reduced exit policy can be found on the [Reduced Exit Policy](https://gitlab.torproject.org/legacy/trac/-/wikis/doc/ReducedExitPolicy) wiki page.
ta: குறைக்கப்பட்ட வெளியேறும் கொள்கையை [குறைக்கப்பட்ட வெளியேறும் கொள்கையில்] (https://gitlab.torproject.org/legacy/trac/-/wikis/doc/reducexitpolicy) விக்கி பக்கத்தில் காணலாம்.

source: There are multiple options for DNS server software. [Unbound](https://nlnetlabs.nl/projects/unbound/about/) has become
ta: டிஎன்எச் சேவையக மென்பொருளுக்கு பல விருப்பங்கள் உள்ளன. [Unbound](https://nlnetlabs.nl/projects/unbound/about/) has become

source: This can be achieved via Tor's Prometheus exporter (`MetricsPort`).
ta: டோரின் ப்ரோமிதியச் ஏற்றுமதியாளர் (`மெட்ரிக்ச்போர்ட்`) வழியாக இதை அடைய முடியும்.

source: This file will be shown to anyone directing their browser to your Tor exit relay IP address.
ta: உங்கள் டோர் வெளியேறும் ரிலே ஐபி முகவரிக்கு அவர்களின் உலாவியை இயக்கும் எவருக்கும் இந்த கோப்பு காண்பிக்கப்படும்.

source: This has an impact on the amount of abuse emails you will get (less ports means less abuse emails, but an exit relay allowing only few ports is also less useful).
ta: இது நீங்கள் பெறும் துச்பிரயோக மின்னஞ்சல்களின் அளவில் தாக்கத்தை ஏற்படுத்துகிறது (குறைந்த துறைமுகங்கள் குறைவான துச்பிரயோக மின்னஞ்சல்கள் என்று பொருள், ஆனால் சில துறைமுகங்களை மட்டுமே அனுமதிக்கும் வெளியேறும் ரிலேவும் குறைவான பயனுள்ளதாக இருக்கும்).

source: To become an exit relay change **ExitRelay** from 0 to 1 in your `torrc` configuration file and restart the `tor` daemon.
ta: வெளியேறும் ரிலே மாற்றமாக மாற ** உங்கள் `டோர்க்` உள்ளமைவு கோப்பில் 0 முதல் 1 வரை தவிர்க்கவும் **` டோர்` டீமனை மறுதொடக்கம் செய்யவும்.

source: To make it even more obvious that this is a Tor exit relay you should serve a Tor exit notice HTML page.
ta: இது ஒரு டோர் வெளியேறும் ரிலே என்பதை இன்னும் தெளிவுபடுத்துவதற்கு நீங்கள் ஒரு டோர் வெளியேறும் அறிவிப்பு உஉகுமொ பக்கத்தை வழங்க வேண்டும்.

source: Tor can do that for you: if your **DirPort** is on TCP port 80, you can make use of `tor`'s **DirPortFrontPage** feature to display an HTML file on that port.
ta: டோர் உங்களுக்காக அதைச் செய்ய முடியும்: உங்கள் ** டிரிபோர்ட் ** TCP துறைமுகம் 80 இல் இருந்தால், அந்த துறைமுகத்தில் ஒரு உஉகுமொ கோப்பைக் காண்பிக்க `TOR` இன் ** டார்போர்ட் ஃபிரான்ட் பேச் ** அம்சத்தைப் பயன்படுத்தலாம்.

source: Unlike other types of relays, exit relays also do DNS resolution for Tor clients.
ta: மற்ற வகை ரிலேக்களைப் போலல்லாமல், வெளியேறும் ரிலேக்கள் டோர் வாடிக்கையாளர்களுக்கான டிஎன்எச் தீர்மானத்தையும் செய்கின்றன.

source: We also have a great blog post with some more [tips for running an exit relay](https://blog.torproject.org/tips-running-exit-node).
ta: எங்களிடம் இன்னும் சில [வெளியேறும் ரிலேவை இயக்குவதற்கான உதவிக்குறிப்புகள்] (https://blog.torproject.org/tips-running-exit-node) ஒரு சிறந்த வலைப்பதிவு இடுகையும் உள்ளது.

source: We assume you read through the [relay guide](..) and [technical considerations](/relay/technical-considerations/) already. This subpage is for operators that want to turn on exiting on their relay.
ta: நீங்கள் ஏற்கனவே [ரிலே வழிகாட்டி] (..) மற்றும் [தொழில்நுட்ப பரிசீலனைகள்] (/ரிலே/தொழில்நுட்ப-கருத்துக்கள்/) மூலம் படித்தீர்கள் என்று கருதுகிறோம். இந்த துணைப் பக்கம் அவர்களின் ரிலேவில் வெளியேற விரும்பும் ஆபரேட்டர்களுக்கானது.

source: We offer a [sample Tor exit notice HTML file](https://gitweb.torproject.org/tor.git/plain/contrib/operator-tools/tor-exit-notice.html), but you might want to adjust it to your needs.
ta: நாங்கள் ஒரு [மாதிரி டோர் வெளியேறும் அறிவிப்பு உஉகுமொ கோப்பு] (https://gitweb.torproject.org/tor.git/plain/contrib/operator-tools/tor-exit-notice.html) வழங்குகிறோம், ஆனால் அதை உங்கள் தேவைகளுக்கு சரிசெய்ய விரும்பலாம்.

source: When choosing your DNS resolver software, make sure that it supports DNSSEC validation and QNAME minimization (RFC7816).
ta: உங்கள் டிஎன்எச் தீர்வி மென்பொருளைத் தேர்ந்தெடுக்கும்போது, இது டிஎன்எச்எச்இசி சரிபார்ப்பு மற்றும் QNAME குறைத்தல் (RFC7816) ஆகியவற்றை ஆதரிக்கிறது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: a popular one but feel free to use any other software that you are comfortable with.
ta: பிரபலமான ஒன்று, ஆனால் நீங்கள் வசதியாக இருக்கும் வேறு எந்த மென்பொருளையும் பயன்படுத்த தயங்க.

source: How to deploy an Exit Relay
ta: வெளியேறும் ரிலேவை எவ்வாறு பயன்படுத்துவது

source: Exit Relay
ta: ரிலே வெளியேறவும்

source: To avoid unwanted configuration changed (for example by the DHCP client):
ta: தேவையற்ற உள்ளமைவு மாற்றப்படுவதைத் தவிர்க்க (எடுத்துக்காட்டாக டி.எச்.சி.பி கிளையண்டால்):

source: How to install Unbound on Debian/Ubuntu
ta: டெபியன்/உபுண்டுவில் வரம்பற்றதை எவ்வாறு நிறுவுவது

source: Debian/Ubuntu
ta: டெபியன்/உபுண்டு

source: FreeBSD ships unbound in the base system but the one in ports is usually following upstream more closely. Install the unbound package, backup your DNS configuration, and tell the system to use the local resolver:
ta: FreeBSD கப்பல்கள் அடிப்படை அமைப்பில் வரம்பற்றவை, ஆனால் துறைமுகங்களில் ஒன்று வழக்கமாக அப்ச்ட்ரீமைப் பின்தொடர்கிறது. வரம்பற்ற தொகுப்பை நிறுவவும், உங்கள் டிஎன்எச் உள்ளமைவை காப்புப் பிரதி எடுக்கவும், உள்ளக தீர்வைப் பயன்படுத்த கணினியிடம் சொல்லுங்கள்:

source: To check and configure it, open the unbound configuration file, located at `/usr/local/etc/unbound/unbound.conf`, look for the following entry and change it if necessary:
ta: அதைச் சரிபார்த்து கட்டமைக்க, `/usr/local/etc/infound/infound.conf` இல் அமைந்துள்ள வரம்பற்ற உள்ளமைவு கோப்பைத் திறக்கவும், பின்வரும் நுழைவைத் தேடி தேவைப்பட்டால் அதை மாற்றவும்:

source: How to install Unbound on FreeBSD
ta: FreeBSD இல் வரம்பற்ற நிறுவுவது எப்படி

source: How to install Unbound on openSUSE
ta: OpenSuse இல் வரம்பற்றதை எவ்வாறு நிறுவுவது

source: ### 3. Configure `/etc/tor/torrc`
ta: ### 3. `/etc/tor/torrc` ஐ உள்ளமைக்கவும்

source: ### 4. Enable and Start `tor`
ta: ### 4. `டோர்` ஐ இயக்கவும்

source: ### 5. Final Notes
ta: ### 5. இறுதி குறிப்புகள்

source: ContactInfo your@e-mail # Write your e-mail and be aware it will be published
ta: ContactInfo your@மின்னஞ்சல் # உங்கள் மின்னஞ்சலை எழுதி, அது வெளியிடப்படும் என்பதை அறிந்து கொள்ளுங்கள்

source: Nickname myNiceRelay # Change "myNiceRelay" to something you like
ta: புனைப்பெயர் mynicerleay # நீங்கள் விரும்பும் ஒன்றுக்கு "mynicerleay" ஐ மாற்றவும்

source: ORPort 443 # You might use a different port, should you want to
ta: Orport 443 # நீங்கள் விரும்பினால் வேறு துறைமுகத்தைப் பயன்படுத்தலாம்

source: Put the configuration file `/etc/tor/torrc` in place
ta: உள்ளமைவு கோப்பை `/etc/tor/torrc` இடத்தில் வைக்கவும்

source: Middle/Guard relay
ta: நடுத்தர/காவலர் ரிலே

source: How to deploy a Middle/Guard relay on Arch Linux
ta: ஆர்ச் லினக்சில் ஒரு நடுத்தர/காவலர் ரிலேவை எவ்வாறு பயன்படுத்துவது

source: ### 4. Package installation
ta: ### 4. தொகுப்பு நிறுவல்

source: ### 5. Configuration file
ta: ### 5. உள்ளமைவு கோப்பு

source: ### 6. Enable and Start `tor`
ta: ### 6. `TOR` ஐ இயக்கவும் தொடங்கவும்

source: Configuring the Tor Project's Repository for CentOS/RHEL consists basically on setting up `/etc/yum.repos.d/Tor.repo` with the following content:
ta: Centos/Rhel க்கான TOR திட்டத்தின் களஞ்சியத்தை உள்ளமைப்பது அடிப்படையில் `/etc/yum.repos.d/tor.repo` ஐ பின்வரும் உள்ளடக்கத்துடன் அமைப்பதில் உள்ளது:

source: ContactInfo your@e-mail # Write your e-mail and be aware it will be published
ta: Contactinfo உங்கள்@மின்னஞ்சல் # உங்கள் மின்னஞ்சலை எழுதி, அது வெளியிடப்படும் என்பதை அறிந்து கொள்ளுங்கள்

source: Follow the instructions to enable [automatic software updates](updates) for your operating system.
ta: உங்கள் இயக்க முறைமைக்கு [தானியங்கி மென்பொருள் புதுப்பிப்புகள்] (புதுப்பிப்புகள்) இயக்க வழிமுறைகளைப் பின்பற்றவும்.

source: If you are having trouble setting up your relay, have a look at our [help section](../../../getting-help/).
ta: உங்கள் ரிலேவை அமைப்பதில் சிக்கல் இருந்தால், எங்கள் [உதவி பிரிவு] (../../../ பெறுதல்-உதவி/) ஐப் பாருங்கள்.

source: If your relay is now running, check out the [post-install](../../post-install/) notes.
ta: உங்கள் ரிலே இப்போது இயங்கினால், [பிந்தைய நிறுவல்] (../../ போச்ட்-இன்ச்டால்/) குறிப்புகளைப் பாருங்கள்.

source: Nickname myNiceRelay # Change "myNiceRelay" to something you like
ta: புனைப்பெயர் mynicerleay # நீங்கள் விரும்பும் ஒன்றுக்கு "mynicerleay" ஐ மாற்றவும்

source: ORPort 443 # You might use a different port, should you want to
ta: Orport 443 # நீங்கள் விரும்பினால் வேறு துறைமுகத்தைப் பயன்படுத்தலாம்

source: Please note that when you are installing the first package from the EPEL repository you will be asked about verifying the EPEL's GPG signing key. Please ensure the key matches with the one available on the [Fedora Project website](https://getfedora.org/keys/). This will also happens when installing packages from Tor's repository for the first time - again you must ensure the key matches.
ta: ஈபல் களஞ்சியத்திலிருந்து முதல் தொகுப்பை நீங்கள் நிறுவும் போது, ஈபலின் சிபிசி கையொப்பமிடும் விசையை சரிபார்ப்பது குறித்து உங்களிடம் கேட்கப்படும் என்பதை நினைவில் கொள்க. [ஃபெடோரா திட்ட வலைத்தளம்] (https://getfedora.org/keys/) இல் கிடைக்கும் முக்கிய போட்டிகளை உறுதிப்படுத்தவும். முதல் முறையாக டோரின் களஞ்சியத்திலிருந்து தொகுப்புகளை நிறுவும் போது இதுவும் நடக்கும் - மீண்டும் நீங்கள் முக்கிய போட்டிகளை உறுதிப்படுத்த வேண்டும்.

source: Put the configuration file `/etc/tor/torrc` in place:
ta: உள்ளமைவு கோப்பை `/etc/tor/torrc` இடத்தில் வைக்கவும்:

source: To install `tor` package on CentOS/RHEL, you need to install the [EPEL](https://fedoraproject.org/wiki/EPEL) repository first:
ta: Centos/Rhel இல் `TOR` தொகுப்பை நிறுவ, நீங்கள் [EPEL] (https://fedoraproject.org/wiki/epel) களஞ்சியத்தை நிறுவ வேண்டும்:

source: How to deploy a Middle/Guard relay on CentOS/RHEL
ta: சென்டோச்/RHEL இல் ஒரு நடுத்தர/காவலர் ரிலேவை எவ்வாறு பயன்படுத்துவது

source: # CentOS and RHEL 7 or earlier versions
ta: # சென்டோச் மற்றும் RHEL 7 அல்லது முந்தைய பதிப்புகள்

source: # CentOS and RHEL 8 or later versions
ta: # சென்டோச் மற்றும் RHEL 8 அல்லது அதற்குப் பிறகு பதிப்புகள்

source: Check status of dnf-automatic:
ta: டி.என்.எஃப்-தானியங்கியின் நிலையை சரிபார்க்கவும்:

source: Confirm your configuration with OK.
ta: உங்கள் உள்ளமைவை சரி என்பதை உறுதிப்படுத்தவும்.

source: Enable and start automatic updates via:
ta: தானியங்கி புதுப்பிப்புகளை இயக்கவும் தொடங்கவும்:

source: Enable the following settings:
ta: பின்வரும் அமைப்புகளை இயக்கவும்:

source: First, you need to install the automatic update package
ta: முதலில், நீங்கள் தானியங்கி புதுப்பிப்பு தொகுப்பை நிறுவ வேண்டும்

source: For CentOS and RHEL 7 or earlier versions, the yum-cron package is the preferred approach:
ta: சென்டோச் மற்றும் RHEL 7 அல்லது முந்தைய பதிப்புகளுக்கு, YUM-CRON தொகுப்பு விருப்பமான அணுகுமுறையாகும்:

source: For CentOS and RHEL 8 or later versions, the dnf-automatic package is the preferred approach:
ta: சென்டோச் மற்றும் RHEL 8 அல்லது அதற்குப் பிறகு, டி.என்.எஃப்-தானியங்கி தொகுப்பு விருப்பமான அணுகுமுறையாகும்:

source: In /etc/dnf/automatic.conf set:
ta: /Etc/dnf/automatic.conf தொகுப்பில்:

source: In /etc/yum/yum-cron.conf set:
ta: /Etc/yum/yum-cron.conf தொகுப்பில்:

source: The official openSUSE documentation can be found [here](https://doc.opensuse.org/documentation/leap/startup/html/book-startup/cha-onlineupdate-you.html#sec-onlineupdate-you-automatically).
ta: அதிகாரப்பூர்வ OpenSuse ஆவணங்களை [இங்கே] காணலாம் (https://doc.opensuse.org/documentation/leap/startup/html/book-startup/cha-onlineupdate-you.html#sec-onlineupdate-you-automatioty).

source: Then start the configuration tool (ncurses based) with:
ta: அதனுடன் உள்ளமைவு கருவியை (NCURSES அடிப்படையாகக் கொண்டது) தொடங்கவும்:

source: Automatic Updates
ta: தானியங்கி புதுப்பிப்புகள்

source: RPM Distributions
ta: ஆர்.பி.எம் வழங்கல்

source: In this guide we describe how to setup a new Middle/Guard relay. Please choose your platform below.
ta: இந்த வழிகாட்டியில் ஒரு புதிய நடுத்தர/காவலர் ரிலேவை எவ்வாறு அமைப்பது என்பதை விவரிக்கிறோம். கீழே உங்கள் தளத்தைத் தேர்வுசெய்க.

source: Run a Middle/Guard relay
ta: ஒரு நடுத்தர/காவலர் ரிலேவை இயக்கவும்

source: ### 3. Package installation
ta: ### 3. தொகுப்பு நிறுவல்

source: ### 4. Configuration file
ta: ### 4. உள்ளமைவு கோப்பு

source: ### 5. Restart the service
ta: ### 5. சேவையை மறுதொடக்கம் செய்யுங்கள்

source: Configuring the Tor Project's package repository for Debian/Ubuntu is documented **[here](https://support.torproject.org/apt/tor-deb-repo/)**. Please follow those instructions before proceeding.
ta: டெபியன்/உபுண்டுவுக்கான TOR திட்டத்தின் தொகுப்பு களஞ்சியத்தை உள்ளமைப்பது ஆவணப்படுத்தப்பட்டுள்ளது ** [இங்கே] (https://support.torproject.org/apt/tor-deb-repo/) **. தொடர்வதற்கு முன் அந்த வழிமுறைகளைப் பின்பற்றவும்.

source: Ensure you update the packages database before installing the package, then call `apt` to install it:
ta: தொகுப்பை நிறுவுவதற்கு முன் தொகுப்புகள் தரவுத்தளத்தைப் புதுப்பிப்பதை உறுதிசெய்து, அதை நிறுவ `APT` ஐ அழைக்கவும்:

source: Restart the `tor` daemon, so your configuration changes take effect:
ta: `டோர்` டீமனை மறுதொடக்கம் செய்யுங்கள், எனவே உங்கள் உள்ளமைவு மாற்றங்கள் நடைமுறைக்கு வருகின்றன:

source: How to deploy a Middle/Guard relay on Debian/Ubuntu
ta: டெபியன்/உபுண்டுவில் ஒரு நடுத்தர/காவலர் ரிலேவை எவ்வாறு பயன்படுத்துவது

source: # 1. Install the required packages
ta: # 1. தேவையான தொகுப்புகளை நிறுவவும்

source: # 2. Edit the configuration file
ta: # 2. உள்ளமைவு கோப்பைத் திருத்தவும்

source: # 4. Test
ta: # 4. சோதனை

source: #3. Automatically reboot
ta: #3. தானாக மறுதொடக்கம் செய்யுங்கள்

source: **Debian and Ubuntu:**
ta: ** டெபியன் மற்றும் உபுண்டு: **

source: If you just want to see the debug output but don't change anything use:
ta: நீங்கள் பிழைத்திருத்த வெளியீட்டைக் காண விரும்பினால், ஆனால் எதையும் மாற்ற வேண்டாம் என்றால் பயன்படுத்தவும்:

source: If you want to automatically reboot add the following at the the end of the file `/etc/apt/apt.conf.d/50unattended-upgrades`:
ta: நீங்கள் தானாக மறுதொடக்கம் செய்ய விரும்பினால் `/etc/apt/apt.conf.d/50unattented- மேம்படுத்தல்` கோப்பின் முடிவில் பின்வருவனவற்றைச் சேர்க்கவும்:

source: Put the lines below into the configuration file `/etc/apt/apt.conf.d/50unattended-upgrades`, everything that was originally inside the generated file can be removed before you add the lines below.
ta: கீழே உள்ள வரிகளை உள்ளமைவு கோப்பில் `/etc/apt/apt.conf.d/50unattented-frades` இல் வைக்கவும், முதலில் உருவாக்கப்பட்ட கோப்பின் உள்ளே இருந்த அனைத்தையும் நீங்கள் கீழே உள்ள கோடுகளைச் சேர்ப்பதற்கு முன்பு அகற்றலாம்.

source: This assumes you will configure the Tor Project's package repository for Debian/Ubuntu, which is documented **[here](https://support.torproject.org/apt/tor-deb-repo/)**.
ta: டெபியன்/உபுண்டுவுக்கான TOR திட்டத்தின் தொகுப்பு களஞ்சியத்தை நீங்கள் கட்டமைப்பீர்கள் என்று இது கருதுகிறது, இது ஆவணப்படுத்தப்பட்டுள்ளது ** [இங்கே] (https://support.torproject.org/apt/tor-deb-repo/) **.

source: Update the file `/etc/apt/apt.conf.d/20auto-upgrades` with the following content
ta: பின்வரும் உள்ளடக்கத்துடன் `/etc/apt/apt.conf.d/20auto-frades` கோப்பைப் புதுப்பிக்கவும்

source: You can test your unattended-upgrades setup with the following command:
ta: பின்வரும் கட்டளையுடன் உங்கள் கவனிக்கப்படாத-மேம்பாட்டு அமைப்பை நீங்கள் சோதிக்கலாம்:

source: Debian and Ubuntu
ta: டெபியன் மற்றும் உபுண்டு

source: ### 5. Start the service
ta: ### 5. சேவையைத் தொடங்கவும்

source: #### 2.1. Recommended Steps to Setup `pkg`
ta: #### 2.1. `பி.கே.சி` அமைக்க பரிந்துரைக்கப்பட்ட படிகள்

source: ... or install an alpha release:
ta: ... அல்லது ஆல்பா வெளியீட்டை நிறுவவும்:

source: DragonflyBSD has 2 packages repositories:
ta: டிராகன்ஃபிளைச்.டி 2 தொகுப்புகள் களஞ்சியங்களைக் கொண்டுள்ளது:

source: Here we set `tor` to start at boot time and use the setuid feature, in order to bind to lower ports like 443 (the daemon itself will still run as a regular non-privileged user).
ta: 443 போன்ற குறைந்த துறைமுகங்களுடன் பிணைக்க, துவக்க நேரத்தில் தொடங்கவும், செட்டூயிட் அம்சத்தைப் பயன்படுத்தவும் இங்கே `டோர்` அமைத்துள்ளோம் (டீமான் இன்னும் வழக்கமான சலுகை பெறாத பயனராக இயங்கும்).

source: Here, it will be similar to what we have on a **FreeBSD** system, and we are going to use HTTPS to fetch our packages, and updates - so here we also need an extra package to help us out (`ca_root_nss`).
ta: இங்கே, இது ஒரு ** FreeBSD ** அமைப்பில் நம்மிடம் இருப்பதைப் போலவே இருக்கும், மேலும் எங்கள் தொகுப்புகள் மற்றும் புதுப்பிப்புகளைப் பெற HTTPS ஐப் பயன்படுத்தப் போகிறோம் - எனவே இங்கே எங்களுக்கு உதவ கூடுதல் தொகுப்பும் தேவை (`ca_root_nss` ).

source: Install the `tor` package:
ta: `TOR` தொகுப்பை நிறுவவும்:

source: Put the configuration file `/usr/local/etc/tor/torrc` in place
ta: உள்ளமைவு கோப்பை `/usr/local/etc/tor/torrc` இடத்தில் வைக்கவும்

source: We can simply edit the **URL** used to point out the repositories on `/usr/local/etc/pkg/repos/df-latest` and that's it! Remember to use **pkg+https://** for Avalon.
ta: `/usr/local/etc/pkg/repos/df-latest` இல் களஞ்சியங்களை சுட்டிக்காட்ட பயன்படுத்தப்படும் **URL** ஐ நாம் வெறுமனே திருத்தலாம், அவ்வளவுதான்! அவலோனுக்கு **pkg+https://** பயன்படுத்த நினைவில் கொள்ளுங்கள்.

source: How to deploy a Middle/Guard relay on DragonFlyBSD
ta: டிராகன்ஃபிளைச்.டி.யில் ஒரு நடுத்தர/காவலர் ரிலேவை எவ்வாறு பயன்படுத்துவது

source: How to deploy a Middle/Guard relay on Fedora
ta: ஃபெடோராவில் ஒரு நடுத்தர/காவலர் ரிலேவை எவ்வாறு பயன்படுத்துவது

source: Now enable and start automatic updates via:
ta: இப்போது தானியங்கி புதுப்பிப்புகளை இயக்கவும் தொடங்கவும்:

source: On Fedora you enable automatic updates via:
ta: ஃபெடோராவில் நீங்கள் தானியங்கி புதுப்பிப்புகளை இயக்குகிறீர்கள்:

source: ### 6. Start the service
ta: ### 6. சேவையைத் தொடங்கவும்

source: Here we can choose to install the latest stable version, like:
ta: அண்மைக் கால நிலையான பதிப்பை நிறுவ இங்கே நாம் தேர்வு செய்யலாம்:

source: Install `tor` FreeBSD's package.
ta: `TOR` FreeBSD இன் தொகுப்பை நிறுவவும்.

source: Put the configuration file `/usr/local/etc/tor/torrc` in place:
ta: உள்ளமைவு கோப்பை `/usr/local/etc/tor/torrc` இடத்தில் வைக்கவும்:

source: So we set up a new directory, and then create a configuration file to override what we need.
ta: எனவே நாங்கள் ஒரு புதிய கோப்பகத்தை அமைத்து, பின்னர் நமக்குத் தேவையானதை மேலெழுத ஒரு உள்ளமைவு கோப்பை உருவாக்குகிறோம்.

source: This article assumes we have already a base installation of FreeBSD running, and only the base system (here, we are running 12.2-RELEASE).
ta: இந்த கட்டுரை எங்களிடம் ஏற்கனவே FreeBSD இயக்கத்தின் அடிப்படை நிறுவலைக் கொண்டுள்ளது என்று கருதுகிறது, மேலும் அடிப்படை அமைப்பு மட்டுமே (இங்கே, நாங்கள் 12.2 வெளியீட்டை இயக்குகிறோம்).

source: This configuration file will be `/usr/local/etc/pkg/repos/FreeBSD.conf`.
ta: இந்த உள்ளமைவு கோப்பு `/usr/local/etc/pkg/repos/freebsd.conf` ஆக இருக்கும்.
