Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: Below, you'll find some different ways to volunteer with the Tor community as well as resources to better help you help Tor.
ta: கீழே, நீங்கள் கண்டறிவீர்கள் டோர் குழுமத்துடனான தன்னார்வ பணிக்கு சில வெவ்வேறு வழிகளும் அத்துடன் வளங்களும், அவை டோர்-க்கு சிறப்பாக உதவ உங்களுக்கு உதவும்.

source: Some people write documentation and bug reports, while others hold Tor events and conduct outreach.
ta: சிலர் ஆவணங்கள் மற்றும் பிழை அறிக்கைகளை எழுதுகிறார்கள், மற்றவர்கள் TOR நிகழ்வுகளை நடத்துகிறார்கள் மற்றும் பயணத்தை நடத்துகிறார்கள்.

source: The Tor community is made up of all kinds of contributors.
ta: டோர் சமூகம் அனைத்து வகையான பங்களிப்பாளர்களால் ஆனது.

source: Whether you have a lot of time to volunteer or a little, and whether you consider yourself technical or not, we want you to join our community, too.
ta: நீங்கள் தன்னார்வத் தொண்டு செய்ய நிறைய நேரம் இருந்தாலும், கொஞ்சம் இருந்தாலும், உங்களை தொழில்நுட்பமாகக் கருதினாலும் இல்லாவிட்டாலும், நீங்கள் எங்கள் சமூகத்திலும் சேர வேண்டும் என்று நாங்கள் விரும்புகிறோம்.

source: Community
ta: சமூகம்

source: Our community is made up of human rights defenders around the world.
ta: எங்கள் சமூகம் உலகெங்கிலும் உள்ள மனித உரிமை பாதுகாவலர்களால் ஆனது.

source: Join the Tor Community
ta: டோர் சமூகத்தில் சேரவும்

source: For this year's projects in Google Summer of Code you can look at the [Google Summer of Code's wiki page](https://gitlab.torproject.org/tpo/team/-/wikis/GSoC).
ta: கூகிள் சம்மர் ஆஃப் குறியீட்டில் இந்த ஆண்டுத் திட்டங்களுக்கு நீங்கள் [கூகிள் சம்மர் ஆஃப் கோட் விக்கிப் பக்கத்தை](https://gitlab.torproject.org/tpo/team/-/wikis/GSoC)ஐப் பார்க்கலாம்.

source: You may find some of these projects to be good ideas for Google Summer of Code. We have labeled each idea with which of our core developers would be good mentors. If one or more of these ideas looks promising to you, please [contact us](mailto:gso+c@torproject.org) to discuss your plans rather than sending blind applications.
ta: இந்தத் திட்டங்களில் சில கூகிள் சம்மர் குறியீட்டிற்கான நல்ல யோசனைகளாக நீங்கள் காணலாம். எங்கள் முக்கிய டெவலப்பர்களில் எது நல்ல வழிகாட்டிகளாக இருக்கும் என்று ஒவ்வொரு யோசனையையும் நாங்கள் பெயரிட்டுள்ளோம். இந்த யோசனைகளில் ஒன்று அல்லது அதற்கு மேற்பட்டவை உங்களுக்கு உறுதியளித்ததாகத் தோன்றினால், குருட்டு பயன்பாடுகளை அனுப்புவதை விட உங்கள் திட்டங்களைப் பற்றி விவாதிக்க தயவுசெய்து [எங்களைத் தொடர்பு கொள்ளுங்கள்](mailto:gso+c@torproject.org).

source: Get coding
ta: குறியீட்டு முறையைப் பெறுங்கள்

source: Some project ideas for GSoC.
ta: GSOC க்கான சில திட்ட சிந்தனைகள்.

source: Project Ideas
ta: திட்ட சிந்தனைகள்

source: ![Watch Tor Project in Weblate](/static/images/localization/watch-projects.png "class='img-fluid'").
ta: ![வெப்லேட்டில் டோர் திட்டத்தைப் பாருங்கள்](/static/images/localization/watch-projects.png "class='img-fluid'").

source: ![Weblate dashboard](/static/images/localization/weblate-dashboard.png "class='img-fluid'").
ta: ![வெப்லேட் டாச்போர்டு](/static/images/localization/weblate-dashboard.png "class='img-fluid'").

source: # Localization mailing list
ta: # உள்ளூராக்கல் அஞ்சல் பட்டியல்

source: # Translation platform
ta: # மொழிபெயர்ப்பு தளம்

source: # What to translate first?
ta: # முதலில் மொழிபெயர்க்க என்ன?

source: ## Registering on Weblate
ta: ## வெப்லேட்டில் பதிவு செய்தல்

source: #IRC channel
ta: #IRC சேனல்

source: 1. Activate your account by clicking on the email from weblate, agreeing to the terms of service, and adding a new password.
ta: 1. வெப்லேட்டிலிருந்து மின்னஞ்சலைக் சொடுக்கு செய்வதன் மூலமும், பணி விதிமுறைகளுக்கு உடன்படுவதன் மூலமும், புதிய கடவுச்சொல்லைச் சேர்ப்பதன் மூலமும் உங்கள் கணக்கை செயல்படுத்தவும்.

source: 1. Fill out the next page with your information, and wait for the confirmation email (it can take up to 10 minutes to arrive to your inbox).
ta: 1. உங்கள் தகவலுடன் அடுத்த பக்கத்தை நிரப்பவும், உறுதிப்படுத்தல் மின்னஞ்சலுக்காக காத்திருங்கள் (உங்கள் இன்பாக்சுக்கு வர 10 நிமிடங்கள் வரை ஆகலாம்).

source: 1. Head over to the [weblate signup page](https://hosted.weblate.org/accounts/register/).
ta: 1.[வலைபெயர்ப்பு பதிவுப் பக்கத்திற்குச்](https://hosted.weblate.org/accounts/register/) செல்லவும்.

source: 1. Make sure to also select [notifications for your watched projects](https://hosted.weblate.org/accounts/profile/#notifications).
ta: 1. [நீங்கள் பார்த்த திட்டங்களுக்கான அறிவிப்புகள்](https://hosted.weblate.org/accounts/profile/#notifications) ஐத் தேர்ந்தெடு.

source: 1. Now you will see the Tor Project translations on your [weblate dashboard](https://hosted.weblate.org/):
ta: 1. இப்போது உங்கள் [வெப்லேட் டாச்போர்டு](https://hosted.weblate.org/) இல் TOR திட்ட மொழிபெயர்ப்புகளைக் காண்பீர்கள்:

source: 1. On the next page, select the languages you will translate to from the menu, and save.
ta: 1. அடுத்த பக்கத்தில், மெனுவிலிருந்து நீங்கள் மொழிபெயர்க்கும் மொழிகளைத் தேர்ந்தெடுத்து சேமிக்கவும்.

source: Before translating, please read through the Tor Project page on the [Localization Lab Wiki](https://wiki.localizationlab.org/index.php/Tor), and our documentation at the [Tor L10n wiki for translators](https://gitlab.torproject.org/tpo/community/l10n/-/wikis/Localization-for-translators) and [reviewers](https://gitlab.torproject.org/tpo/community/l10n/-/wikis/Localization-for-reviewers).
ta: மொழிபெயர்ப்பதற்கு முன், தயவுசெய்து [உள்ளூர்மயமாக்கல் ஆய்வக விக்கி](https://wiki.localizationlab.org/index.php/Tor) மற்றும் [மொழிபெயர்ப்பாளர்களுக்கான ஆவணங்கள்](https://gitlab.torproject.org/tpo/community/l10n/-/wikis/Localization-for-translators) மற்றும் [மதிப்பாய்வாளர்கள்](https://gitlab.torproject.org/tpo/community/l10n/-/wikis/Localization-for-reviewers) பக்கங்களை படிக்கவும்.

source: Most of our localization efforts are hosted on [weblate](https://hosted.weblate.org/projects/tor/), a third-party translation platform.
ta: எங்கள் உள்ளூர்மயமாக்கல் முயற்சிகளில் பெரும்பாலானவை மூன்றாம் தரப்பு மொழிபெயர்ப்பு தளமான [வெப்லேட்](https://hosted.weblate.org/projects/tor/) இல் வழங்கப்படுகின்றன.

source: Other projects we recommend are Guardian Project and Onionshare:
ta: நாங்கள் பரிந்துரைக்கும் பிற திட்டங்கள் கார்டியன் திட்டம் மற்றும் வெங்காயர்:

source: Our localization efforts are supported by the [Localization Lab](https://www.localizationlab.org/).
ta: எங்கள் உள்ளூர்மயமாக்கல் முயற்சிகள் [உள்ளூர்மயமாக்கல் ஆய்வகம்] (https://www.localizationlab.org/) ஆதரிக்கின்றன.

source: Remember that the username and email address you choose will be publicly visible on the translation platform since they will be associated with the changes you make.
ta: நீங்கள் தேர்ந்தெடுக்கும் பயனர்பெயர் மற்றும் மின்னஞ்சல் முகவரி மொழிபெயர்ப்பு தளத்தில் பகிரங்கமாகக் காணப்படும் என்பதை நினைவில் கொள்ளுங்கள், ஏனெனில் அவை நீங்கள் செய்யும் மாற்றங்களுடன் தொடர்புடையதாக இருக்கும்.

source: Thank you for your interest in helping us with translations.
ta: மொழிபெயர்ப்புகளுக்கு எங்களுக்கு உதவுவதில் உங்கள் ஆர்வத்திற்கு நன்றி.

source: The page includes guidelines, resources, and priorities that will help you make the most out of your contribution.
ta: உங்கள் பங்களிப்பைப் பயன்படுத்த உதவும் வழிகாட்டுதல்கள், வளங்கள் மற்றும் முன்னுரிமைகள் பக்கத்தில் உள்ளன.

source: To communicate with other translators, please join the [Tor localization mailing list](https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-l10n), where we organize translations, take decisions, report errors in source strings, etc. Please introduce yourself and ask any questions you may have after following up these instructions.
ta: பிற மொழிபெயர்ப்பாளர்களுடன் தொடர்பு கொள்ள, தயவுசெய்து [டோர் உள்ளூர்மயமாக்கல் அஞ்சல் பட்டியல்] (https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-l10n) இல் சேரவும், அங்கு நாங்கள் மொழிபெயர்ப்புகளை ஒழுங்கமைக்கிறோம், முடிவுகளை எடுக்கிறோம், மூல சரங்களில் பிழைகளைப் புகாரளிக்கவும்.

source: We encourage the use of pseudonymous accounts.
ta: புனைப்பெயர் கணக்குகளின் பயன்பாட்டை நாங்கள் ஊக்குவிக்கிறோம்.

source: We hang out in the #tor-l10n channel on the oftc IRC network. Please [join us to talk about localization](https://support.torproject.org/get-in-touch/#irc-help) (l10n)!
ta: OFTC IRC நெட்வொர்க்கில் உள்ள #TOR-L10N சேனலில் நாங்கள் ஏங்கவுட் செய்கிறோம். தயவுசெய்து [உள்ளூர்மயமாக்கல் பற்றி பேச எங்களுடன் சேருங்கள்] (https://support.torproject.org/get-in-touch/#irc-help) (L10N)!

source: You can also use Element https://element.io/ to connect: #tor-l10n:matrix.org.
ta: இணைக்க நீங்கள் Https://element.io/ ஐ இணைக்க பயன்படுத்தலாம்: #TOR-L10N: மேட்ரிக்ச்.org.

source: You can see the translations with more priority at our [translation statistics page](https://tpo.pages.torproject.net/community/l10n/stats.html#high-priority-translations).
ta: எங்கள் [மொழிபெயர்ப்பு புள்ளிவிவரப் பக்கத்தில்] (https://tpo.pages.torproject.net/community/l10n/stats.html#high- முன்னுரிமை-மொழிபெயர்ப்புகள்) இல் மொழிபெயர்ப்புகளை அதிக முன்னுரிமையுடன் காணலாம்.

source: You can submit anonymous suggestions, but it is better to create an account so you can comment and discuss with other translators, or review their contributions.
ta: நீங்கள் அநாமதேய பரிந்துரைகளை சமர்ப்பிக்கலாம், ஆனால் ஒரு கணக்கை உருவாக்குவது நல்லது, எனவே நீங்கள் மற்ற மொழிபெயர்ப்பாளர்களுடன் கருத்து தெரிவிக்கவும் விவாதிக்கவும் அல்லது அவர்களின் பங்களிப்புகளை மதிப்பாய்வு செய்யலாம்.

source: Localization
ta: உள்ளகமாக்கல்

source: Learn how to sign up and begin contributing.
ta: பதிவுபெறுவது மற்றும் பங்களிப்பைத் தொடங்குவது எப்படி என்பதை அறிக.

source: Becoming a Tor translator
ta: டோர் மொழிபெயர்ப்பாளராக மாறுகிறார்

source: ##Localization is how we reach a global community.
ta: ## உள்ளூர்மயமாக்கல் என்பது உலகளாவிய சமூகத்தை நாம் எவ்வாறு அடைகிறோம் என்பதுதான்.

source: In order for Tor to work for everyone, it needs to speak everyone's languages.
ta: அனைவருக்கும் டோர் வேலை செய்ய, இது அனைவரின் மொழிகளையும் பேச வேண்டும்.

source: Our current translation priorities are translating [Tor Browser](https://torpat.ch/locales), Tor Browser documentation, and the [Tor Project website](https://torpat.ch/tpo-locales), but there are many other documents that we could use help translating as well.
ta: எங்கள் தற்போதைய மொழிபெயர்ப்பு முன்னுரிமைகள் [TOR உலாவி] (https://torpat.ch/locales), டோர் உலாவி ஆவணங்கள் மற்றும் [TOR திட்ட வலைத்தளம்] (https://torpat.ch/tpo-locals) மொழிபெயர்க்கின்றன, ஆனால் நாங்கள் உதவி மொழிபெயர்ப்பைப் பயன்படுத்தக்கூடிய பல ஆவணங்களும் உள்ளன.

source: Our volunteer translation team works hard to make this a reality, and we can always use more help.
ta: எங்கள் தன்னார்வ மொழிபெயர்ப்பு குழு இதை உண்மையாக்க கடினமாக உழைக்கிறது, மேலும் நாங்கள் எப்போதும் அதிக உதவியைப் பயன்படுத்தலாம்.

source: Help us translate
ta: மொழிபெயர்க்க உதவவும்

source: We want Tor to work for everyone in the world, which means our software must be translated into a lot of languages.
ta: உலகில் உள்ள அனைவருக்கும் டோர் வேலை செய்ய வேண்டும் என்று நாங்கள் விரும்புகிறோம், அதாவது எங்கள் மென்பொருள் நிறைய மொழிகளில் மொழிபெயர்க்கப்பட வேண்டும்.

source: Our translations are incomplete for a lot of languages. They may be spoken by fewer people around the world, but it is still critical that we improve access to Tor for people who do not speak English.
ta: எங்கள் மொழிபெயர்ப்புகள் நிறைய மொழிகளுக்கு முழுமையடையாது. அவர்கள் உலகெங்கிலும் உள்ள குறைவானவர்களால் பேசப்படலாம், ஆனால் ஆங்கிலம் பேசாதவர்களுக்கு TOR க்கான அணுகலை மேம்படுத்துவது இன்னும் முக்கியமானது.

source: Some languages are more active than others with a higher number of active and committed contributors. However you are still welcome to help us with these languages, even after the translations are complete.
ta: அதிக எண்ணிக்கையிலான செயலில் மற்றும் உறுதியான பங்களிப்பாளர்களைக் கொண்ட மற்றவர்களை விட சில மொழிகள் மிகவும் செயலில் உள்ளன. இருப்பினும், மொழிபெயர்ப்புகள் முடிந்த பிறகும், இந்த மொழிகளுக்கு எங்களுக்கு உதவ நீங்கள் இன்னும் வரவேற்கப்படுகிறீர்கள்.

source: These statistics are calculated daily.
ta: இந்த புள்ளிவிவரங்கள் தினமும் கணக்கிடப்படுகின்றன.

source: To learn more about the different files in translation, please consult [our wiki section for translators](https://gitlab.torproject.org/tpo/community/l10n/-/wikis/Localization-for-translators)
ta: மொழிபெயர்ப்பில் உள்ள வெவ்வேறு கோப்புகளைப் பற்றி மேலும் அறிய, தயவுசெய்து [மொழிபெயர்ப்பாளர்களுக்கான எங்கள் விக்கி பிரிவு] (https://gitlab.torproject.org/tpo/community/l10n/-/wikis/localization-for- டிரான்ச்லேட்டர்கள்)

source: We have statistics about our translations at the [L10n statistics page](https://tpo.pages.torproject.net/community/l10n/stats.html), with information about priority translations and released translations.
ta: முன்னுரிமை மொழிபெயர்ப்புகள் மற்றும் வெளியிடப்பட்ட மொழிபெயர்ப்புகள் பற்றிய தகவல்களுடன், [L10N புள்ளிவிவரப் பக்கம்] (https://tpo.pages.torpages.torproject.net/community/l10n/stats.html) இல் எங்கள் மொழிபெயர்ப்புகளைப் பற்றிய புள்ளிவிவரங்கள் உள்ளன.

source: You can see the open tickets about translation issues on our [bugtracker](https://gitlab.torproject.org/tpo/community/l10n/-/issues).
ta: மொழிபெயர்ப்பு சிக்கல்களைப் பற்றிய திறந்த டிக்கெட்டுகளை எங்கள் [bugtracker] (https://gitlab.torproject.org/tpo/community/l10n/-/issues) இல் காணலாம்.

source: Not sure where to start? Here you can find an overview of the current localization status for all of the different Tor Project projects.
ta: எங்கு தொடங்குவது என்று தெரியவில்லை? வெவ்வேறு TOR திட்டத் திட்டங்கள் அனைத்திற்கும் தற்போதைய உள்ளூர்மயமாக்கல் நிலையின் கண்ணோட்டத்தை இங்கே காணலாம்.

source: Current Status of Translations
ta: மொழிபெயர்ப்புகளின் தற்போதைய நிலை

source: ### Reporting an error with a translation
ta: ### மொழிபெயர்ப்புடன் பிழையைப் புகாரளித்தல்

source: * If you are already a [Tor translator](../becoming-tor-translator), you can simply find the string and fix it in [weblate](https://hosted.weblate.org/projects/tor/#search).
ta: * If you அரே already a [Tor translator](../becoming-tor-translator), you can simply கண்டுபிடி the சரம் and fix it in [weblate](https://hosted.weblate.org/projects/tor/#search).

source: * If you don't know how to find the string to fix, you can [open a ticket on our Bugtracker](https://gitlab.torproject.org/tpo/community/l10n/-/issues?scope=all&state=opened).
ta: * சரிசெய்ய சரத்தை எவ்வாறு கண்டுபிடிப்பது என்று உங்களுக்குத் தெரியாவிட்டால், நீங்கள் [எங்கள் பிழைத்திருத்தத்தில் ஒரு டிக்கெட்டைத் திறக்கலாம்] (https://gitlab.torproject.org/tpo/community/l10n/-/issues?scope=all&state=opened).

source: * You can report such issues on [irc](https://support.torproject.org/get-in-touch/#irc-help), on the #tor-l10n channel on the oftc network (you may need to be registered to log in).
ta: * இதுபோன்ற சிக்கல்களை [ஐ.ஆர்.சி] (https://support.torproject.org/get-ing-touch/#irc-help), OFTC நெட்வொர்க்கில் உள்ள #TOR-L10N சேனலில் புகாரளிக்கலாம் (உள்நுழைய நீங்கள் பதிவு செய்ய வேண்டியிருக்கலாம்).

source: * You can send an email to the [tor localization mailing list](https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-l10n).
ta: * நீங்கள் [டோர் உள்ளூர்மயமாக்கல் அஞ்சல் பட்டியல்] (https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-l10n) க்கு மின்னஞ்சல் அனுப்பலாம்.

source: * You can start a topic on the [Localization Feedback section of the Tor Forum](https://forum.torproject.net/c/feedback/localization-feedback/8)
ta: * நீங்கள் ஒரு தலைப்பைத் தொடங்கலாம் [டோர் மன்றத்தின் உள்ளூர்மயமாக்கல் பின்னூட்டப் பிரிவில்] (https://forum.torproject.net/c/feedback/localization-feedback/8)

source: Before opening a ticket, see the currently [open tickets for Translations](https://gitlab.torproject.org/tpo/community/l10n/-/issues?scope=all&state=opened) because maybe it is already reported.
ta: டிக்கெட்டைத் திறப்பதற்கு முன், தற்போது [மொழிபெயர்ப்புகளுக்கான திறந்த டிக்கெட்டுகள்] (https://gitlab.torproject.org/tpo/community/l10n/-/issues?scope=all&state=open) ஐப் பார்க்கவும்.

source: If you find many errors on a translation, please consider [contributing to our translations](../becoming-tor-translator/).
ta: மொழிபெயர்ப்பில் நீங்கள் பல பிழைகளைக் கண்டால், தயவுசெய்து [எங்கள் மொழிபெயர்ப்புகளுக்கு பங்களிப்பு] (../-டோர்-டிரான்ச்லேட்டர்/) ஆகக் கவனியுங்கள்.

source: Our translations are done by volunteers, and sometimes there may be errors.
ta: எங்கள் மொழிபெயர்ப்புகள் தன்னார்வலர்களால் செய்யப்படுகின்றன, சில சமயங்களில் பிழைகள் இருக்கலாம்.

source: We always need help on improving our translations, and as our websites change translations become outdated.
ta: எங்கள் மொழிபெயர்ப்புகளை மேம்படுத்துவதற்கு எங்களுக்கு எப்போதும் உதவி தேவை, எங்கள் வலைத்தளங்கள் மாற்றும்போது மொழிபெயர்ப்புகள் காலாவதியானவை.

source: Sometimes the translations of apps are not working correctly. Here you can learn to fix it.
ta: சில நேரங்களில் பயன்பாடுகளின் மொழிபெயர்ப்புகள் சரியாக இயங்காது. அதை சரிசெய்ய இங்கே நீங்கள் கற்றுக்கொள்ளலாம்.

source: Report a problem with a translation
ta: மொழிபெயர்ப்புடன் சிக்கலைப் புகாரளிக்கவும்

source: ## Configuring v3 Onion Services
ta: ## வி 3 வெங்காய சேவைகளை கட்டமைத்தல்

source: ### Client side
ta: ### கிளையன்ட் பக்கம்

source: ### Service side
ta: ### பணி பக்கம்

source: **Note:** Once you have configured client authorization, anyone with the address will not be able to access it from this point on.
ta: ** குறிப்பு: ** நீங்கள் கிளையன்ட் அங்கீகாரத்தை உள்ளமைத்தவுடன், முகவரி உள்ள எவரும் இதை இந்த கட்டத்தில் இருந்து அணுக முடியாது.

source: **Private key**
ta: ** தனியார் விசை **

source: **Public key**
ta: ** பொது விசை **

source: **Step 1.** Generate a key using the algorithm x25519:
ta: ** படி 1. ** X25519 வழிமுறையைப் பயன்படுத்தி ஒரு விசையை உருவாக்குங்கள்:

source: **Step 2.** Format the keys into base32:
ta: ** படி 2. ** விசைகளை BASE32 ஆக வடிவமைக்கவும்:

source: **Step 3.** Copy the public key:
ta: ** படி 3. ** பொது விசையை நகலெடுக்கவும்:

source: **Step 4.** Create an authorized client file:
ta: ** படி 4. ** அங்கீகரிக்கப்பட்ட கிளையன்ட் கோப்பை உருவாக்கவும்:

source: **Step 5.** Restart the tor service:
ta: ** படி 5. ** TOR சேவையை மறுதொடக்கம் செய்யுங்கள்:

source: <56-char-onion-addr-without-.onion-part>:descriptor:x25519:<x25519 private key in base32>
ta: <56-CHAR-ONION-ADDR-without-.onion-part>: விவரிப்பான்: x25519: <x25519 BASE32 இல் தனியார் விசை>

source: Client authorization is a method to make an Onion Service private and authenticated.
ta: கிளையன்ட் ஏற்பு என்பது வெங்காய சேவையை தனிப்பட்டதாகவும் அங்கீகரிக்கவும் ஒரு முறையாகும்.

source: Client authorization will only be enabled for the service if tor successfully loads at least one authorization file.
ta: டோர் குறைந்தது ஒரு அங்கீகாரக் கோப்பையாவது வெற்றிகரமாக ஏற்றினால் மட்டுமே கிளையன்ட் ஏற்பு சேவைக்கு இயக்கப்படும்.

source: Each file in that directory should be suffixed with ".auth" (i.e. "alice.auth"; the file name is irrelevant) and its content format must be:
ta: அந்த கோப்பகத்தில் உள்ள ஒவ்வொரு கோப்பும் ".auth" (அதாவது "ஆலிச்.ஆத்"; கோப்பு பெயர் பொருத்தமற்றது) உடன் பின்னொட்டு இருக்க வேண்டும் மற்றும் அதன் உள்ளடக்க வடிவம் இருக்க வேண்டும்:

source: For example, add this line to `/etc/tor/torrc`:
ta: எடுத்துக்காட்டாக, இந்த வரியை `/etc/tor/torrc` இல் சேர்க்கவும்:

source: For example, the file `/var/lib/tor/hidden_service/authorized_clients/alice.auth` should look like:
ta: எடுத்துக்காட்டாக, `/var/lib/tor/hidden_service/அங்கீகரிக்கப்பட்ட_க்ளையண்ட்ச்/ஆலிச்.ஆத்` போன்ற கோப்பு இருக்க வேண்டும்:

source: For example:
ta: உதாரணத்திற்கு:

source: For more information about client authentication, please see [Tor manual](https://2019.www.torproject.org/docs/tor-onion-service.html.en#ClientAuthorization).
ta: கிளையன்ட் ஏற்பு பற்றிய கூடுதல் தகவலுக்கு, தயவுசெய்து [TOR MANUAL] (https://2019.Www.torproject.org/docs/tor-onion-service.html.en#clientauthorization) ஐப் பார்க்கவும்.

source: For now, you need to create the keys yourself with a script (like these written in [Bash](https://gist.github.com/mtigas/9c2386adf65345be34045dace134140b), [Rust](https://github.com/haxxpop/torkeygen) or [Python](https://github.com/pastly/python-snippits/blob/master/src/tor/x25519-gen.py)) or manually.
ta: இப்போதைக்கு, நீங்கள் ஒரு ச்கிரிப்ட் மூலம் சாவியை உருவாக்க வேண்டும் (இது [பாச்] (https://gist.github.com/mtigas/9c2386adf65345be34045dace134140b), [rustps: அல்லது rustps://gtppop. .

source: For v3 Onion Services, this method works with a pair of keys (a public and a private).
ta: வி 3 வெங்காய சேவைகளுக்கு, இந்த முறை ஒரு இணை விசைகளுடன் (ஒரு பொது மற்றும் ஒரு தனியார்) வேலை செய்கிறது.

source: Format the client authentication and create a new file in `<HiddenServiceDir>/authorized_clients/` directory.
ta: கிளையன்ட் அங்கீகாரத்தை வடிவமைத்து, புதிய கோப்பை `<Hiddenservicedir>/அங்கீகரிக்கப்பட்ட_கல்சுகள்/` கோப்பகத்தில் உருவாக்கவும்.

source: If no authorization is configured, the service will be accessible to anyone with the onion address.
ta: எந்த அங்கீகாரமும் கட்டமைக்கப்படாவிட்டால், வெங்காய முகவரி உள்ள எவருக்கும் பணி அணுகப்படும்.

source: If you are generating a private key for an onion site, the user does not necessarily need to edit Tor Browser's torrc. It is possible to enter the private key directly in the [Tor Browser](https://tb-manual.torproject.org/onion-services/) interface.
ta: நீங்கள் ஒரு வெங்காய தளத்திற்கு ஒரு தனிப்பட்ட விசையை உருவாக்குகிறீர்கள் என்றால், பயனர் டோர் உலாவியின் டோர்க்கைத் திருத்த வேண்டிய அவசியமில்லை. [TOR உலாவி] (https://tb-manual.torproject.org/onion-services/) இடைமுகத்தில் தனிப்பட்ட விசையை நேரடியாக உள்ளிட முடியும்.

source: If you are planning to have more authenticated clients, each file must contain one line only. Any malformed file will be ignored.
ta: அதிக அங்கீகரிக்கப்பட்ட வாடிக்கையாளர்களைக் கொண்டிருக்க நீங்கள் திட்டமிட்டால், ஒவ்வொரு கோப்பிலும் ஒரு வரி மட்டுமே இருக்க வேண்டும். எந்தவொரு தவறான கோப்பும் புறக்கணிக்கப்படும்.

source: If you get an error message, something has gone wrong and you cannot continue until you've figured out why this didn't work.
ta: நீங்கள் ஒரு பிழை செய்தியைப் பெற்றால், ஏதோ தவறு ஏற்பட்டுள்ளது, இது ஏன் வேலை செய்யவில்லை என்று நீங்கள் கண்டுபிடிக்கும் வரை நீங்கள் தொடர முடியாது.

source: If you manually generated the key pair following the instructions in this page, you can copy and use the private key created in **Step 2**.
ta: இந்த பக்கத்தில் உள்ள வழிமுறைகளைப் பின்பற்றி முக்கிய சோடியை நீங்கள் கைமுறையாக உருவாக்கினால், ** படி 2 ** இல் உருவாக்கப்பட்ட தனிப்பட்ட விசையை நகலெடுத்து பயன்படுத்தலாம்.

source: It requires Tor clients to provide an authentication credential in order to connect to the Onion Service.
ta: வெங்காய சேவையுடன் இணைக்க வாடிக்கையாளர்கள் அங்கீகார சான்றுகளை வழங்க வேண்டும்.

source: The `<base32-encoded-public-key>` is the base32 representation of the raw key bytes only (32 bytes for x25519).
ta: `<Base32- குறியிடப்பட்ட-பொது-விசை>` என்பது மூல விசை பைட்டுகளின் அடிப்படை 32 பிரதிநிதித்துவம் மட்டுமே (x25519 க்கு 32 பைட்டுகள்).

source: The content of the `<ClientOnionAuthDir>/<user>.auth_private` file should look like this:
ta: `<seplientonionauthdir>/<souner> .auth_private` கோப்பின் உள்ளடக்கம் இப்படி இருக்க வேண்டும்:

source: The service side is configured with a public key and the client can only access it with a private key.
ta: பணி பக்கமானது பொது விசையுடன் கட்டமைக்கப்பட்டுள்ளது மற்றும் கிளையன்ட் அதை ஒரு தனிப்பட்ட விசையுடன் மட்டுமே அணுக முடியும்.

source: The supported values for `<auth-type>` are: "descriptor".
ta: `<ஆல்-டைப்>` க்கான உதவி மதிப்புகள்: "விவரிப்பான்".

source: The supported values for `<key-type>` are: "x25519".
ta: `<விசை-வகை>` க்கான உதவி மதிப்புகள்: "x25519".

source: Then restart `tor` and you should be able to connect to the Onion Service address.
ta: பின்னர் `டோர்` மறுதொடக்கம் செய்யுங்கள், நீங்கள் வெங்காய பணி முகவரியுடன் இணைக்க முடியும்.

source: Then, in the `<ClientOnionAuthDir>` directory, create an `.auth_private` file for the Onion Service corresponding to this key (i.e. 'bob_onion.auth_private').
ta: பின்னர், `<sepliendonionauthdir>` கோப்பகத்தில், இந்த விசையுடன் (அதாவது 'bob_onion.auth_private') தொடர்புடைய வெங்காய சேவைக்கு `.auth_private` கோப்பை உருவாக்கவும்.

source: To access a version 3 Onion Service with client authorization as a client, make sure you have `ClientOnionAuthDir` set in your torrc.
ta: கிளையன்ட் என்ற கிளையன்ட் அங்கீகாரத்துடன் பதிப்பு 3 வெங்காய சேவையை அணுக, உங்கள் டோர்க்கில் `ClientOnionAuthdir` அமைந்திருப்பதை உறுதிசெய்க.
