Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: To configure client authorization on the service side, the `<HiddenServiceDir>/authorized_clients/` directory needs to exist. Following the instructions described in the section [Setup](../../setup/) will automatically create this directory.
ta: பணி பக்கத்தில் கிளையன்ட் அங்கீகாரத்தை உள்ளமைக்க, `<hiddenservicedir>/அங்கீகரிக்கப்பட்ட_காலென்ட்ச்/` அடைவு இருக்க வேண்டும். [அமைவு] (../../ அமைவு/) பிரிவில் விவரிக்கப்பட்டுள்ள வழிமுறைகளைப் பின்பற்றி தானாகவே இந்த கோப்பகத்தை உருவாக்கும்.

source: To manually generate the keys, you need to install `openssl` version 1.1+ and `basez`.
ta: விசைகளை கைமுறையாக உருவாக்க, நீங்கள் `OpenSsl` பதிப்பு 1.1+ மற்றும்` BASEZ` ஐ நிறுவ வேண்டும்.

source: Learn how to set up client authorization for your Onion Services.
ta: உங்கள் வெங்காய சேவைகளுக்கு கிளையன்ட் அங்கீகாரத்தை எவ்வாறு அமைப்பது என்பதை அறிக.

source: Client Authorization
ta: கிளையன்ட் ஏற்பு

source: In this section you will find how to configure your Onion Service to enable client authorization, Onion-Location and tips to make your Onion Service more secure.
ta: வாடிக்கையாளர் ஏற்பு, வெங்காய இருப்பிடம் மற்றும் உங்கள் வெங்காய சேவையை மிகவும் பாதுகாப்பாக மாற்றுவதற்கான உதவிக்குறிப்புகளை இயக்க உங்கள் வெங்காய சேவையை எவ்வாறு கட்டமைப்பது என்பதை இந்த பிரிவில் நீங்கள் காண்பீர்கள்.

source: Learn more about how to configure client authentication, Onion-Location and more tips to secure your Onion Service.
ta: உங்கள் வெங்காய சேவையைப் பாதுகாக்க கிளையன்ட் ஏற்பு, வெங்காய இருப்பிடம் மற்றும் கூடுதல் உதவிக்குறிப்புகளை எவ்வாறு கட்டமைப்பது என்பது பற்றி மேலும் அறிக.

source: Advanced settings
ta: மேம்பட்ட அமைப்புக்கள்

source: ### Caching
ta: ### கேச்சிங்

source: ### Captchas and cookies
ta: ### கேப்ட்சாச் மற்றும் குக்கீகள்

source: ### Client authorization or multiple onion addresses to compartmentalize your users
ta: ### உங்கள் பயனர்களை பகுப்பாய்வு செய்ய கிளையன்ட் ஏற்பு அல்லது பல வெங்காய முகவரிகள்

source: ### Onionbalance
ta: ### வெங்காய சொற்பொழிவு

source: ### Proof of Work (PoW) before establishing Rendezvous Circuits
ta: ரெண்டெச்வச் சுற்றுகளை நிறுவுவதற்கு முன் ### வேலைக்கான சான்று (POW)

source: ### Rate limiting at the Introduction Points
ta: அறிமுகம் புள்ளிகளில் ### வீதத்தைக் கட்டுப்படுத்துதல்

source: ### Stream limits in the established Rendezvous Circuits
ta: ### ச்ட்ரீம் வரம்புகள் நிறுவப்பட்ட ரெண்டெச்வச் சுற்றுகளில்

source: ### Webserver rate limiting
ta: ### வெப்சர்வர் வீதத்தைக் கட்டுப்படுத்துதல்

source: * `CompiledProofOfWorkHash`: When proof-of-work DoS mitigation is active, both the services themselves and the clients which connect will use a dynamically generated hash function as part of the puzzle computation.
ta: * `CompiledProofOfWorkHash`: When proof-of-work DoS mitigation is active, both the சேவைகள் themselves and the clients which இணை will use a dynamically generated hash சார்பு அச் பகுதி of the puzzle computation.

source: * `HiddenServiceEnableIntroDoSBurstPerSec`: The allowed client introduction burst per second at the introduction point.
ta: * `HiddenServiceEnableIntroDoSBurstPerSec`: The allowed client அறிமுகம் burst per second at the அறிமுகம் point.

source: * `HiddenServiceEnableIntroDoSRatePerSec`: The allowed client introduction rate per second at the introduction point.
ta: * `HiddenServiceEnableIntroDoSRatePerSec`: The allowed client அறிமுகம் rate per second at the அறிமுகம் point.

source: * `HiddenServiceMaxStreamsCloseCircuit`: If set to 1, then exceeding HiddenServiceMaxStreams will cause the offending rendezvous circuit to be torn down, as opposed to stream creation requests that exceed the limit being silently ignored.
ta: * `HiddenServiceMaxStreamsCloseCircuit`: If கணம் பெறுநர் 1, then exceeding HiddenServiceMaxStreams will cause the offending rendezvous சுற்று பெறுநர் be torn down, அச் opposed பெறுநர் stream creation requests that exceed the limit being silently ignored.

source: * `HiddenServiceMaxStreams`: The maximum number of simultaneous streams (connections) per rendezvous circuit.
ta: * `HiddenServiceMaxStreams`: The பெருமம் எண் of simultaneous streams (connections) per rendezvous circuit.

source: * `HiddenServicePoWDefensesEnabled`: Enable proof-of-work based service DoS mitigation.
ta: * `HiddenServicePoWDefensesEnabled`: Enable proof-of-work based பணி DoS mitigation.

source: * `HiddenServicePoWQueueBurst`: The maximum burst size for rendezvous requests handled from the priority queue at once.
ta: * `HiddenServicePoWQueueBurst`: The பெருமம் burst அளவு க்கு rendezvous requests handled இருந்து the priority queue at once.

source: * `HiddenServicePoWQueueRate`: The sustained rate of rendezvous requests to dispatch per second from the priority queue.
ta: * `HiddenServicePoWQueueRate`: The sustained rate of rendezvous requests பெறுநர் dispatch per second இருந்து the priority queue.

source: A [Proof of Work (PoW)](https://spec.torproject.org/hspow-spec/index.html) defense mechanism is explained in length at the [PoW FAQ](https://gitlab.torproject.org/tpo/onion-services/onion-support/-/wikis/Documentation/PoW-FAQ), and can be configured for each Onion Service with the following `torrc` options:
ta: ஒரு [வேலைக்கான சான்று (POW)] (https://spec.torproject.org/hspow-spec/index.html) பாதுகாப்பு பொறிமுறையானது [POW FAQ] (https://gitlab.tork. பின்வரும் `டோர்க்` விருப்பங்களுடன் ஒவ்வொரு வெங்காய சேவைக்கும்:

source: Add the secure cookie for the correct verified client, redirect the client to the page which he wants to view.
ta: சரியான சரிபார்க்கப்பட்ட கிளையண்டிற்கு பாதுகாப்பான குக்கீவைச் சேர்க்கவும், கிளையண்டை அவர் பார்க்க விரும்பும் பக்கத்திற்கு திருப்பி விடவும்.

source: All these approaches can be combined.
ta: இந்த அணுகுமுறைகள் அனைத்தும் இணைக்கப்படலாம்.

source: An alternative might be to just implement a test-cookie challenge.
ta: ஒரு சோதனை-கைக்கி சவாலை மட்டும் செயல்படுத்துவதாக இருக்கலாம்.

source: An overview of implemented defenses at the tor daemon is given in the [Overview](https://spec.torproject.org/dos-spec/overview.html) section from the [Denial-of-service prevention mechanisms in Tor](https://spec.torproject.org/dos-spec/index.html) specification, and here we give some practical tips.
ta: டோர் டீமனில் செயல்படுத்தப்பட்ட பாதுகாப்புகளின் [கண்ணோட்டம்](https://spec.torproject.org/dos-spec/overview.html) பிரிவில் [tor-sof-service தடுப்பு வழிமுறைகள்](https://spec.torproject.org/dos-spec/index.html) நடைமுறை உதவிக்குறிப்புகள்.

source: Another way to reduce the load on your service is to implement content caching, either directly at the backend application or by setting up a caching proxy frontend.
ta: உங்கள் சேவையில் சுமைகளைக் குறைப்பதற்கான மற்றொரு வழி, நேரடியாக பின்தளத்தில் பயன்பாட்டில் அல்லது கேச்சிங் பதிலாள் ஃபிரான்டெண்டை அமைப்பதன் மூலம் உள்ளடக்க தற்காலிக சேமிப்பை செயல்படுத்துவது.

source: At the same time [we are working on more advanced defenses](https://blog.torproject.org/stop-the-onion-denial), so that less manual configuration and tinkering is needed by onion operators.
ta: அதே நேரத்தில் [நாங்கள் மிகவும் மேம்பட்ட பாதுகாப்புகளில் வேலை செய்கிறோம்] (https://blog.torproject.org/stop-the-onion-denial), இதனால் வெங்காய ஆபரேட்டர்களால் குறைந்த கையேடு உள்ளமைவு மற்றும் டிங்கரிங் தேவைப்படுகிறது.

source: At your webserver check that clients can set valid cookies, malicious clients often do not have this feature.
ta: வாடிக்கையாளர்கள் செல்லுபடியாகும் குக்கீகளை அமைக்க முடியும் என்பதை உங்கள் வெப்சர்வர் சரிபார்க்கவும், தீங்கிழைக்கும் வாடிக்கையாளர்களுக்கு பெரும்பாலும் இந்த நற்பொருத்தம் இல்லை.

source: Basic PoW support can be checked by running this command:
ta: இந்த கட்டளையை இயக்குவதன் மூலம் அடிப்படை POW ஆதரவை சரிபார்க்கலாம்:

source: Captchas are a way to mitigate DDoS attacks.
ta: கேப்ட்சாக்கள் டி.டி.ஓ.எச் தாக்குதல்களைத் தணிப்பதற்கான ஒரு வழியாகும்.

source: Defending a site under attack requires creativity and a custom-tailored approach.
ta: தாக்குதலுக்கு உள்ளான ஒரு தளத்தை பாதுகாப்பதற்கு படைப்பாற்றல் மற்றும் தனிப்பயன்-வடிவமைக்கப்பட்ட அணுகுமுறை தேவை.

source: Due to license requirements, the PoW v1 client puzzle libraries ([Equi-X](https://github.com/tevador/equix) and [HashX](https://github.com/tevador/hashx) by tevador, both under the LGPL-3.0) are enabled only if tor is compiled with `--enable-gpl`.
ta: உரிமத் தேவைகள் காரணமாக, POW V1 கிளையன்ட் புதிர் நூலகங்கள் ([equi-x] (https://github.com/tevador/equix) மற்றும் [HASHX] (https://github.com/tevador/hashx) டீவடோரால், எல்சிபிஎல் -3.0 உடன்-டார்பிஎல்-ஐ மட்டுமே இயக்கப்பட்டால் மட்டுமே.

source: For more information on how they work, check the `tor(1)` manpage and the [Denial-of-Service defense extension (DOS_PARAMS)](https://spec.torproject.org/rend-spec/introduction-protocol.html#EST_INTRO_DOS_EXT) section of the [Onion Services v3 specification](https://spec.torproject.org/rend-spec/index.html).
ta: அவை எவ்வாறு செயல்படுகின்றன என்பது பற்றிய கூடுதல் தகவலுக்கு, `TOR (1)` MANPAGE மற்றும் [மறுப்பு-சேவை பாதுகாப்பு நீட்டிப்பு (DOS_PARAMS)] (https://spec.torproject.org/rend-spec/introduction-protocol விவரக்குறிப்பு] (https://spec.torproject.org/rend-spec/index.html).

source: For users you don't trust, split them into multiple addresses.
ta: நீங்கள் நம்பாத பயனர்களுக்கு, அவற்றை பல முகவரிகளாகப் பிரிக்கவும்.

source: However there is no single one-size-fits-all solution for this problem at the moment.
ta: எவ்வாறாயினும், இந்த சிக்கலுக்கு ஒரு அளவு-பொருந்தக்கூடிய அனைத்து தீர்வும் இல்லை.

source: If attackers are overwhelming you with aggressive circuits that perform too many queries, try to detect that overuse and kill them using the `HiddenServiceExportCircuitID` torrc option.
ta: பல கேள்விகளைச் செய்யும் வன்கவர்வு சுற்றுகள் மூலம் தாக்குதல் நடத்தியவர்கள் உங்களை அதிகமாகக் கொண்டிருந்தால், அந்த அதிகப்படியான பயன்பாட்டைக் கண்டறிந்து, `hiddenserviceexportcircuitid` டோர்க் விருப்பத்தைப் பயன்படுத்தி அவர்களைக் கொல்ல முயற்சிக்கவும்.

source: If this option is 0, it is considered infinite and thus if HiddenServiceEnableIntroDoSDefense is set, it then effectively disables the defenses.
ta: இந்த விருப்பம் 0 ஆக இருந்தால், அது எல்லையற்றதாகக் கருதப்படுகிறது, இதனால் hiddenserviceenableintrodosdefense அமைக்கப்பட்டால், அது பாதுகாப்புகளை திறம்பட முடக்குகிறது.

source: If you have `pow: yes`, then you have the PoW defense mechanism built into C Tor.
ta: உங்களிடம் `POW: ஆம்` இருந்தால், உங்களிடம் POW பாதுகாப்பு பொறிமுறையானது c tor இல் கட்டமைக்கப்படுகிறது.

source: If you have users you trust, give them dedicated Onion Service and client authorization credentials so that it can always be available.
ta: நீங்கள் நம்பும் பயனர்கள் உங்களிடம் இருந்தால், அவர்களுக்கு அர்ப்பணிப்புள்ள வெங்காய பணி மற்றும் கிளையன்ட் அங்கீகார சான்றுகளை அவர்களுக்கு வழங்கவும், இதனால் அது எப்போதும் கிடைக்கக்கூடும்.

source: If you need to further rate-limit users, split your infrastructure into layers and put Captchas near the frontend.
ta: நீங்கள் பயனர்களை மேலும் விகிதத்தைக் கட்டுப்படுத்த வேண்டும் என்றால், உங்கள் உள்கட்டமைப்பை அடுக்குகளாகப் பிரித்து, கேப்ட்சாக்களை முன்பக்கத்திற்கு அருகில் வைக்கவும்.

source: If your installed C Tor does not have PoW enabled or is not built with GNU GPL support, then you'll have to look for other packages or compile it yourself.
ta: உங்கள் நிறுவப்பட்ட சி டோர் POW இயக்கப்பட்டிருக்கவில்லை அல்லது குனு சிபிஎல் ஆதரவுடன் கட்டமைக்கப்படாவிட்டால், நீங்கள் மற்ற தொகுப்புகளைத் தேட வேண்டும் அல்லது அதை நீங்களே தொகுக்க வேண்டும்.

source: In Nginx, Cloudflare provide a [library](https://github.com/cloudflare/lua-resty-cookie) to interact with cookies.
ta: Nginx இல், குக்கீகளுடன் தொடர்பு கொள்ள கிளவுட்ஃப்ளேர் ஒரு [நூலகம்] (https://github.com/cloudflare/lua-resty-cookie) ஐ வழங்குகிறது.

source: In this page we present a few ways to mitigate DoS attacks currently.
ta: இந்த பக்கத்தில் தற்போது DOS தாக்குதல்களைத் தணிக்க சில வழிகளை முன்வைக்கிறோம்.

source: Incoming rendezvous requests will be prioritized based on the amount of effort a client chooses to make when computing a solution to the puzzle.
ta: புதிருக்கு ஒரு தீர்வைக் கணக்கிடும்போது ஒரு வாடிக்கையாளர் தேர்ந்தெடுக்கும் முயற்சியின் அடிப்படையில் உள்வரும் சந்திப்பு கோரிக்கைகள் முன்னுரிமை அளிக்கப்படும்.

source: It is possible to implement Captchas directly at your webserver with Nginx and OpenResty using [Lua to generate and verify the captcha images](https://github.com/openresty/lua-nginx-module).
ta: கேப்ட்சாக்களை உங்கள் வெப்சர்வரில் என்சின்க்ச் மற்றும் ஓபன்ரெச்டியுடன் நேரடியாக செயல்படுத்த முடியும் [கேப்ட்சா படங்களை உருவாக்கி சரிபார்க்க லுவா] (https://github.com/openresty/lua-nginx-module).

source: Nginx sends this input letters to recaptcha server for verification.
ta: சரிபார்ப்புக்காக இந்த உள்ளீட்டு கடிதங்களை ரெக்காப்ட்சா சேவையகத்திற்கு அனுப்புகிறது.

source: Onionbalance is available for [v3 Onion Services](https://blog.torproject.org/cooking-onions-reclaiming-onionbalance).
ta: [V3 வெங்காய சேவைகள்] (https://blog.torproject.org/cooking-onions-reclaiming-onionBalance) க்கு வெங்காய சொற்பொழிவு கிடைக்கிறது.

source: Other methods include making sure that clients connecting to your .onion have valid User-Agent header and the Referer header is not set to a value you can associate with the attack.
ta: உங்கள் .ஒருயனுடன் இணைக்கும் வாடிக்கையாளர்கள் செல்லுபடியாகும் பயனர்-முகவர் தலைப்பைக் கொண்டிருக்கிறார்கள் என்பதையும், தாக்குதலுடன் நீங்கள் தொடர்புபடுத்தக்கூடிய மதிப்புக்கு குறிப்பாளர் தலைப்பு அமைக்கப்படவில்லை என்பதையும் உறுதிசெய்வது பிற முறைகளில் அடங்கும்.

source: PoW is enabled by default on C Tor versions 0.4.8.1-alpha onwards (but can be disabled if compiled with `--disable-module-pow`).
ta: சி டோர் பதிப்புகள் 0.4.8.1-ஆல்பா முதல் முன்னிருப்பாக POW இயக்கப்பட்டது (ஆனால் `--திசைதிருப்பக்கூடிய-தொகுதி-பவ்` உடன் தொகுக்கப்பட்டால் முடக்கப்படலாம்).

source: Since [Proposal 305](https://gitlab.torproject.org/tpo/core/torspec/-/blob/main/proposals/305-establish-intro-dos-defense-extention.txt) was implemented, some `torrc` options were added to help mitigating DoS attacks at the introduction points:
ta: Since [Proposal 305](https://gitlab.torproject.org/tpo/core/torspec/-/blob/main/proposals/305-establish-intro-dos-defense-extention.txt) was implemented, some `torrc` விருப்பங்கள் were added பெறுநர் உதவி mitigating DoS attacks at the அறிமுகம் points:

source: That said, having too many onion addresses is actually bad for your security (because of the use of many guard nodes), so try to use [client authorization](../client-auth/) when possible.
ta: அதிகமான வெங்காய முகவரிகளை வைத்திருப்பது உங்கள் பாதுகாப்பிற்கு உண்மையில் மோசமானது (பல பாதுகாப்பு முனைகளின் பயன்பாட்டின் காரணமாக), எனவே முடிந்தவரை [கிளையன்ட் அங்கீகாரத்தை] (../ கிளையன்ட்-ஆத்/) பயன்படுத்த முயற்சிக்கவும்.

source: The above tips should help you keep afloat in turbulent times.
ta: மேற்கூறிய உதவிக்குறிப்புகள் கொந்தளிப்பான நேரங்களில் மிதக்க உதவும்.

source: The client inputs the captcha letters.
ta: கிளையன்ட் கேப்ட்சா கடிதங்களை உள்ளிடுகிறது.

source: The correct answer from recaptcha server with beginning of "true...", else it's beginning with "false...".
ta: "உண்மை ..." இன் தொடக்கத்துடன் ரெக்காப்ட்சா சேவையகத்திலிருந்து சரியான பதில், இல்லையெனில் இது "பொய் ..." உடன் தொடங்குகிறது.

source: The following configuration options can be used to limit connections in the rendezvous circuits:
ta: ரெண்டெச்வச் சுற்றுகளில் இணைப்புகளைக் கட்டுப்படுத்த பின்வரும் உள்ளமைவு விருப்பங்கள் பயன்படுத்தப்படலாம்:

source: The following global option is applicable to both onion services and their clients:
ta: பின்வரும் உலகளாவிய விருப்பம் வெங்காய சேவைகள் மற்றும் அவர்களின் வாடிக்கையாளர்களுக்கு பொருந்தும்:

source: The maximum value allowed is 65535. (Setting this to 0 will allow an unlimited number of simultaneous streams.)
ta: அனுமதிக்கப்பட்ட அதிகபட்ச மதிப்பு 65535 ஆகும். (இதை 0 ஆக அமைப்பது வரம்பற்ற எண்ணிக்கையிலான ஒரே நேரத்தில் ச்ட்ரீம்களை அனுமதிக்கும்.)

source: The more you scale, the harder it is for attackers to overwhelm you.
ta: நீங்கள் எவ்வளவு அதிகமாக அளவிடுகிறீர்களோ, தாக்குபவர்கள் உங்களை மூழ்கடிப்பது கடினம்.

source: The service will periodically update a suggested amount of effort, based on attack load, and disable the puzzle entirely when the service is not overloaded.
ta: தாக்குதல் சுமைகளின் அடிப்படையில் பரிந்துரைக்கப்பட்ட முயற்சியை இந்த பணி அவ்வப்போது புதுப்பிக்கும், மேலும் பணி அதிக சுமை இல்லாதபோது புதிரை முற்றிலும் முடக்கும்.

source: This build of Tor is covered by the GNU General Public License (https://www.gnu.org/licenses/gpl-3.0.en.html)
ta: டோர் இந்தக் கட்டமைப்பானது குனு பொது பொதுமக்கள் உரிமத்தால் (https://www.gnu.org/licenses/gpl-3.0.en.html)

source: This can be confirmed by running the following command:
ta: பின்வரும் கட்டளையை இயக்குவதன் மூலம் இதை உறுதிப்படுத்த முடியும்:

source: This implementation isn't easy to configure.
ta: இந்த செயல்படுத்தல் கட்டமைக்க எளிதானது அல்ல.

source: This way attackers will have to solve Captchas before they are able to attack deeper into your infrastructure.
ta: இந்த வழியில் தாக்குதல் நடத்தியவர்கள் உங்கள் உள்கட்டமைப்பில் ஆழமாகத் தாக்கும் முன் கேப்ட்சாக்களை தீர்க்க வேண்டும்.

source: Tor compiled with GCC version 12.2.0
ta: டோர் சி.சி.சி பதிப்பு 12.2.0 உடன் தொகுக்கப்பட்டது

source: Tor is running on Linux with Libevent 2.1.12-stable, OpenSSL 3.0.9, Zlib 1.2.13, Liblzma 5.4.1, Libzstd N/A and Glibc 2.36 as libc.
ta: லிபெவென்ட் 2.1.12-ச்டேபிள், ஓபன்எச்எல் 3.0.9, ச்லிப் 1.2.13, லிபில்ச்மா 5.4.1, லிப்ச்ச்டிடி என்/ஏ மற்றும் கிளிப் 2.36 ஆகியவற்றுடன் லினக்சில் டோர் இயங்குகிறது.

source: Tor version 0.4.8.3-rc.
ta: TOR பதிப்பு 0.4.8.3-RC.

source: When a request comes from a client checks if the client contains the correct secure cookie otherwise redirects to the recaptcha page.
ta: கிளையன்ட் ஒரு கோரிக்கை வரும்போது கிளையன்ட் சரியான பாதுகாப்பான குக்கீயைக் கொண்டிருந்தால், இல்லையெனில் ரெக்காப்ட்சா பக்கத்திற்கு திருப்பி விடுகிறது.

source: When enabled, tor will include parameters for an optional client puzzle in the encrypted portion of this hidden service's descriptor.
ta: இயக்கப்பட்டால், இந்த மறைக்கப்பட்ட சேவையின் விவரிப்பாளரின் மறைகுறியாக்கப்பட்ட பகுதியில் விருப்பமான கிளையன்ட் புதிருக்கான அளவுருக்களை TOR சேர்க்கும்.

source: When this is enabled, the rate and burst parameter will be sent to the intro point which will then use them to apply rate limiting for introduction request to this service.
ta: இது இயக்கப்பட்டால், வீதம் மற்றும் வெடிப்பு அளவுரு அறிமுக புள்ளிக்கு அனுப்பப்படும், பின்னர் அவற்றைப் பயன்படுத்தி இந்த சேவைக்கு அறிமுகக் கோரிக்கைக்கு வீத வரம்பைப் பயன்படுத்தும்.

source: You can use Onionbalance to scale horizontally.
ta: கிடைமட்டமாக அளவிட நீங்கள் வெங்காய பிரசங்கத்தைப் பயன்படுத்தலாம்.

source: You can use your own heuristics or use your web server's [rate limiting module](https://www.nginx.com/blog/rate-limiting-nginx/).
ta: நீங்கள் உங்கள் சொந்த ஊரிச்டிக்சைப் பயன்படுத்தலாம் அல்லது உங்கள் வலை சேவையகத்தின் [வீதத்தைக் கட்டுப்படுத்தும் தொகுதி] (https://www.nginx.com/blog/rate-limiting-nginx/) பயன்படுத்தலாம்.

source: [Onionbalance](https://onionbalance-v3.readthedocs.io/en/latest/v3/tutorial-v3.html) allows Onion Service operators to achieve the property of high availability by allowing multiple machines to handle requests for an Onion Service.
ta: [Onionbalance](https://onionbalance-v3.readthedocs.io/en/latest/v3/tutorial-v3.html) allows Onion பணி operators பெறுநர் achieve the property of high availability by allowing multiple machines பெறுநர் கைப்பிடி requests க்கு an Onion Service.

source: Advanced Configuration
ta: மேம்பட்ட உள்ளமைவு

source: Tips to help you keep afloat in turbulent times.
ta: கொந்தளிப்பான நேரங்களில் மிதக்க உதவும் உதவிக்குறிப்புகள்.

source: Onion service DoS guidelines
ta: வெங்காய பணி DOS வழிகாட்டுதல்கள்

source: ### Read more
ta: ### மேலும் வாசிக்க

source: ### What's next
ta: ### அடுத்தது என்ன

source: * Another option is to use webserver rules to rewrite absolute links on the fly.
ta: * மற்றொரு விருப்பம், பறக்கும்போது முழுமையான இணைப்புகளை மீண்டும் எழுத வெப்சர்வர் விதிகளைப் பயன்படுத்துவது.

source: * For a detailed step by step how to create an HTTPS onion certificate, check [Brave's blog post](https://brave.com/new-onion-service/).
ta: * ஒரு HTTPS வெங்காய சான்றிதழை எவ்வாறு உருவாக்குவது என்பது படிப்படியாக, [பிரேவின் வலைப்பதிவு இடுகையை] சரிபார்க்கவும் (https://brave.com/new-onion-service/).

source: * Or use a reverse proxy in the middle (more specifically [Onionspray][] with an HTTPS certificate).
ta: * Or use a தலைகீழ் proxy in the middle (more specifically [Onionspray][] with an HTTPS certificate).

source: * To avoid using an HTTPS certificate for your onion, the easiest answer is to write all your content so it uses only relative links.
ta: * உங்கள் வெங்காயத்திற்கான HTTPS சான்றிதழைப் பயன்படுத்துவதைத் தவிர்க்க, உங்கள் எல்லா உள்ளடக்கத்தையும் எழுதுவதே எளிதான பதில், எனவே இது தொடர்புடைய இணைப்புகளை மட்டுமே பயன்படுத்துகிறது.

source: * [DigiCert: Get TLS certificate with Extended Validation (EV) for your onion site (2015)](https://www.digicert.com/blog/onion-officially-recognized-special-use-domain/)
ta: * [டிசிகர்ட்: உங்கள் வெங்காய தளத்திற்கான நீட்டிக்கப்பட்ட சரிபார்ப்புடன் (ஈ.வி) டி.எல்.எச் சான்றிதழைப் பெறுங்கள் (2015)]

source: * [Facebook, hidden services, and https certs (2014)](https://blog.torproject.org/facebook-hidden-services-and-https-certs)
ta: * [பேச்புக், மறைக்கப்பட்ட சேவைகள் மற்றும் HTTPS சான்றிதழ்கள் (2014)]]

source: * [HARICA: Get a TLS certificate with Domain Validation (DV) for your onion site (2021)](https://blog.torproject.org/tls-certificate-for-onion-site)
ta: * [அரிகா: உங்கள் வெங்காய தளத்திற்கான (2021) டொமைன் சரிபார்ப்பு (டி.வி) உடன் டி.எல்.எச் சான்றிதழைப் பெறுங்கள்]

source: * [The ".onion" Special-Use Domain Name - IETF RFC 7686](https://tools.ietf.org/html/rfc7686)
ta: * [The ".onion" Special-Use Domain பெயர் - IETF RFC 7686](https://tools.ietf.org/html/rfc7686)

source: - [DigiCert](https://www.digicert.com/) with an Extended Validation (EV) TLS certificate, which means a considerable cost for an organization.
ta: - [DigiCert](https://www.digicert.com/) with an Extended Validation (EV) TLS certificate, which means a considerable cost க்கு an organization.

source: - [HARICA](https://www.harica.gr) with Domain Validation (DV) TLS certificates.
ta: - [அரிகா] (https://www.harica.gr) டொமைன் சரிபார்ப்பு (டி.வி) டி.எல்.எச் சான்றிதழ்களுடன்.

source: 1. As anyone can generate an onion address and its 56 random alphanumeric characters, some enterprise administrators believe that associating their onion site to an HTTPS certificate might be a solution to announce their service to users.
ta: 1. எவரும் வெங்காய முகவரி மற்றும் அதன் 56 சீரற்ற எண்ணெழுத்து எழுத்துக்களை உருவாக்க முடியும் என்பதால், சில நிறுவன நிர்வாகிகள் தங்கள் வெங்காய தளத்தை ஒரு HTTPS சான்றிதழுடன் இணைப்பது பயனர்களுக்கு தங்கள் சேவையை அறிவிக்க ஒரு தீர்வாக இருக்கலாம் என்று நம்புகிறார்கள்.

source: 2. Another topic of this discussion is user expectations and modern browsers.
ta: 2. இந்த விவாதத்தின் மற்றொரு தலைப்பு பயனர் எதிர்பார்ப்புகள் மற்றும் நவீன உலாவிகள்.

source: 3. One of the risks of using a certificate issued by a CA is that `.onion` names might unintentionally get [leaked](https://crt.sh/?q=.onion) if the Onion Service owners use HTTPS due to [Certificate Transparency](https://certificate.transparency.dev/).
ta: 3. ஒரு CA ஆல் வழங்கப்பட்ட சான்றிதழைப் பயன்படுத்துவதன் அபாயங்களில் ஒன்று, `. ஒனியன்` பெயர்கள் தற்செயலாக [கசிந்தவை] (https://crt.sh/?q=.onion) வெங்காய பணி உரிமையாளர்கள் [சான்றிதழ் டிரான்ச்பாரென்சி] (https://certarpiten.transparency.dev/) காரணமாக HTTPS ஐப் பயன்படுத்தினால்.

source: 4. Some websites have a complex setup, and are serving HTTP and HTTPS content.
ta: 4. சில வலைத்தளங்கள் சிக்கலான அமைப்பைக் கொண்டுள்ளன, மேலும் அவை HTTP மற்றும் HTTPS உள்ளடக்கத்தை வழங்குகின்றன.

source: 5. Related to the previous point, some protocols, frameworks, and infrastructures use SSL as a technical requirement; they won't work if they don't see an "https://" link.
ta: 5. முந்தைய புள்ளியுடன் தொடர்புடையது, சில நெறிமுறைகள், கட்டமைப்புகள் மற்றும் உள்கட்டமைப்புகள் SSL ஐ தொழில்நுட்பத் தேவையாகப் பயன்படுத்துகின்றன; அவர்கள் "https: //" இணைப்பைக் காணவில்லை என்றால் அவர்கள் வேலை செய்ய மாட்டார்கள்.
