Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: We are keeping the original setting used by `pkg` but setting a new one that will override it.
ta: `பி.கே.சி` பயன்படுத்தும் அசல் அமைப்பை நாங்கள் வைத்திருக்கிறோம், ஆனால் அதை மேலெழுதும் புதிய ஒன்றை அமைத்துக்கொள்கிறோம்.

source: How to deploy a Middle/Guard relay on FreeBSD
ta: FreeBSD இல் ஒரு நடுத்தர/காவலர் ரிலேவை எவ்வாறு பயன்படுத்துவது

source: ### 1. Create the Update Script
ta: ### 1. புதுப்பிப்பு ச்கிரிப்டை உருவாக்கவும்

source: ### 2. Schedule a `cron` Job
ta: ### 2. ஒரு `க்ரோன்` வேலையைத் திட்டமிடுங்கள்

source: ### 3. Restart `cron`
ta: ### 3. மறுதொடக்கம் `cron`

source: * If you want to change the scheduled execution of the update script, configure your [crontab settings](https://crontab.guru/) to a value you would like to use.
ta: * புதுப்பிப்பு ச்கிரிப்டின் திட்டமிடப்பட்ட செயல்பாட்டை மாற்ற விரும்பினால், உங்கள் [க்ரோன்டாப் அமைப்புகளை] (https://crontab.guru/) நீங்கள் பயன்படுத்த விரும்பும் மதிப்புக்கு உள்ளமைக்கவும்.

source: **NOTE:** All steps documented on this page are considering that your server is dedicated to provide a Tor (bridge/guard/exit) relay service. Please be aware that _services will be restarted_ during the automatic software update process documented here.
ta: ** குறிப்பு: ** இந்த பக்கத்தில் ஆவணப்படுத்தப்பட்ட அனைத்து படிகளும் உங்கள் சேவையகம் ஒரு டோர் (பாலம்/காவலர்/வெளியேறுதல்) ரிலே சேவையை வழங்க அர்ப்பணிக்கப்பட்டுள்ளது. இங்கே ஆவணப்படுத்தப்பட்ட தானியங்கி மென்பொருள் புதுப்பிப்பு செயல்முறையின் போது _ சேவைகள் மறுதொடக்கம் செய்யப்படும் என்பதை நினைவில் கொள்க.

source: Finally, restart the `cron` daemon to make configuration changes be used.
ta: இறுதியாக, உள்ளமைவு மாற்றங்களைச் செய்ய `க்ரோன்` டீமனை மறுதொடக்கம் செய்யுங்கள்.

source: For this particular schedule we opt to run the script every 0h00 (depending on your timezone), and will trigger the packages updates process itself depending on the value set to the `$RAND` variable - it's configured to produce a **sleep** between 0 and 900 seconds (15 minutes).
ta: இந்த குறிப்பிட்ட அட்டவணைக்கு ஒவ்வொரு 0H00 (உங்கள் நேர மண்டலத்தைப் பொறுத்து) ச்கிரிப்டை இயக்க நாங்கள் தேர்வு செய்கிறோம், மேலும் `$ rand` மாறிக்கு அமைக்கப்பட்ட மதிப்பைப் பொறுத்து தொகுப்புகளின் புதுப்பிப்புகள் செயல்முறையைத் தூண்டும் - இது ஒரு ** தூக்கம் ** உருவாக்க கட்டமைக்கப்பட்டுள்ளது 0 முதல் 900 வினாடிகளுக்கு இடையில் (15 நிமிடங்கள்).

source: Let's use `/root/bin/pkg-upgrade.sh` for our setup. This is how is must look like:
ta: எங்கள் அமைப்பிற்கு `/ரூட்/பின்/பி.கே.சி. இப்படித்தான் இருக்க வேண்டும்:

source: This guide should work for DragonFlyBSD, FreeBSD, and HardenedBSD operating system. It covers _ONLY_ packages updates/upgrades, and does not apply any other patch to base system or kernel.
ta: இந்த வழிகாட்டி டிராகன்ஃபிளைச்.டி, ஃப்ரீ.பி.எச்.டி மற்றும் ஆர்டென்டெச்பிஎச்டி இயக்க முறைமைக்கு வேலை செய்ய வேண்டும். இது _ONLY_ தொகுப்புகள் புதுப்பிப்புகள்/மேம்படுத்தல்களை உள்ளடக்கியது, மேலும் அடிப்படை அமைப்பு அல்லது கர்னலுக்கு வேறு எந்த இணைப்பையும் பயன்படுத்தாது.

source: Here we set `tor` to start during boot and call it for the first time:
ta: இங்கே நாங்கள் துவக்கத்தின் போது தொடங்குவதற்கு `டோர்` அமைத்து அதை முதல் முறையாக அழைக்கிறோம்:

source: Install `tor` NetBSD's package:
ta: `TOR` NetBSD இன் தொகுப்பை நிறுவவும்:

source: Put the configuration file `/usr/pkg/etc/tor/torrc` in place:
ta: உள்ளமைவு கோப்பை `/usr/pkg/etc/tor/torrc` இடத்தில் வைக்கவும்:

source: How to deploy a Middle/Guard relay on NetBSD
ta: NETBSD இல் ஒரு நடுத்தர/காவலர் ரிலேவை எவ்வாறு பயன்படுத்துவது

source: ### 2. Package installation
ta: ### 2. தொகுப்பு நிறுவல்

source: ### 3. Configuration file
ta: ### 3. உள்ளமைவு கோப்பு

source: ### 4. Change `openfiles-max` and `maxfiles`
ta: ### 4. `ஓபன்ஃபைல்ச்-மேக்ச்` மற்றும்` மேக்ச்ஃபைல்கள்` ஐ மாற்றவும்

source: By default, OpenBSD maintains a rather low limit on the maximum number of open files for a process.
ta: இயல்பாக, OpenBSD ஒரு செயல்முறைக்கு அதிகபட்ச திறந்த கோப்புகளின் குறைந்த வரம்பை பராமரிக்கிறது.

source: For a daemon such as Tor's, that opens a connection to each and every other relay (currently around 7000 relays), these limits should be raised.
ta: டோர்ச் போன்ற ஒரு டீமனுக்கு, இது ஒவ்வொரு ரிலே (தற்போது சுமார் 7000 ரிலேக்கள்) ஒரு இணைப்பைத் திறக்கும், இந்த வரம்புகள் உயர்த்தப்பட வேண்டும்.

source: If that's not your case, please adjust the `installurl` configuration file like this:
ta: அது உங்கள் வழக்கு இல்லையென்றால், தயவுசெய்து இது போன்ற `இன்ச்டால்டுர்ல்` உள்ளமைவு கோப்பை சரிசெய்யவும்:

source: Latest version of tor will be made avaliable as package for the most recent OpenBSD release and OpenBSD -current(development snapshot), therefore, remember to upgrade OpenBSD on time and configure automatic software updates.
ta: TOR இன் அண்மைக் கால பதிப்பு மிக அண்மைக் கால OpenBSD வெளியீடு மற்றும் OpenBSD -ERRENT (மேம்பாட்டு ச்னாப்சாட்) ஆகியவற்றிற்கான தொகுப்பாக மாற்றப்படும், எனவே, OpenBSD ஐ சரியான நேரத்தில் மேம்படுத்தவும் தானியங்கி மென்பொருள் புதுப்பிப்புகளை உள்ளமைக்கவும் நினைவில் கொள்ளுங்கள்.

source: Proceed with `pkg_add` to install the package:
ta: தொகுப்பை நிறுவ `pkg_add` உடன் தொடரவும்:

source: Recent OpenBSD systems, since 6.5, already have the repository configured on `/etc/installurl` so we do not need to bother changing it.
ta: அண்மைக் கால ஓபன் பி.எச்.டி அமைப்புகள், 6.5 முதல், ஏற்கனவே களஞ்சியத்தை `/etc/instandurl` இல் கட்டமைக்கப்பட்டுள்ளன, எனவே அதை மாற்றுவதை நாங்கள் தொந்தரவு செய்ய தேவையில்லை.

source: To apply our raised open files limits, make sure to start tor with `rcctl`.
ta: எங்கள் உயர்த்தப்பட்ட திறந்த கோப்புகள் வரம்புகளைப் பயன்படுத்த, `rcctl` உடன் டோர் தொடங்குவதை உறுதிசெய்க.

source: How to deploy a Middle/Guard relay on OpenBSD
ta: OpenBSD இல் ஒரு நடுத்தர/காவலர் ரிலேவை எவ்வாறு பயன்படுத்துவது

source: ### 2. Restart `cron`
ta: ### 2. மறுதொடக்கம் `cron`

source: **NOTE:** All steps documented on this page are considering that your server is dedicated to provide a Tor relay.
ta: ** குறிப்பு: ** இந்த பக்கத்தில் ஆவணப்படுத்தப்பட்ட அனைத்து நடவடிக்கைகளும் உங்கள் சேவையகம் ஒரு டோர் ரிலேவை வழங்க அர்ப்பணிக்கப்பட்டுள்ளது என்பதைக் கருத்தில் கொள்கிறது.

source: For this example, we are going to use `/etc/weekly.local`:
ta: இந்த எடுத்துக்காட்டுக்கு, நாங்கள் `/etc/weethly.local` ஐப் பயன்படுத்தப் போகிறோம்:

source: For this particular schedule, we opt to run the script every week on Saturdays at 3h30 (depending on your timezone).
ta: இந்த குறிப்பிட்ட அட்டவணைக்கு, ஒவ்வொரு வாரமும் சனிக்கிழமைகளில் 3H30 மணிக்கு ச்கிரிப்டை இயக்க நாங்கள் தேர்வு செய்கிறோம் (உங்கள் நேர மண்டலத்தைப் பொறுத்து).

source: It allows us to write our own custom scripts to be called by `cron` in three different local files (depending on our needs, or particular choices):
ta: எங்கள் சொந்த தனிப்பயன் ச்கிரிப்ட்களை மூன்று வெவ்வேறு உள்ளக கோப்புகளில் (எங்கள் தேவைகளைப் பொறுத்து அல்லது குறிப்பிட்ட தேர்வுகளைப் பொறுத்து) அழைக்க அனுமதிக்கிறது:

source: It covers only packages updates/upgrades, and does not apply any other patch to the base system or kernel.
ta: இது புதுப்பிப்புகள்/மேம்படுத்தல்களை மட்டுமே தொகுப்புகளை உள்ளடக்கியது, மேலும் அடிப்படை அமைப்பு அல்லது கர்னலுக்கு வேறு எந்த இணைப்பையும் பயன்படுத்தாது.

source: It will trigger the packages updates process itself, depending on the value set to the `$RAND` variable.
ta: இது `$ rand` மாறிக்கு அமைக்கப்பட்ட மதிப்பைப் பொறுத்து தொகுப்புகளின் புதுப்பிப்புகள் செயல்முறையைத் தூண்டும்.

source: It's configured to produce a **sleep** between 0 and 900 seconds (15 minutes).
ta: இது 0 முதல் 900 வினாடிகள் (15 நிமிடங்கள்) இடையில் ** தூக்கம் ** ஐ உருவாக்க கட்டமைக்கப்பட்டுள்ளது.

source: OpenBSD offers us an easy way of running tasks **daily**, **weekly** or **monthly**.
ta: OpenBSD பணிகளை இயக்குவதற்கான எளிதான வழியை எங்களுக்கு வழங்குகிறது ** நாள்தோறும் **, ** வாராந்திர ** அல்லது ** மாதாந்திர **.

source: Please be aware that services will be restarted during the automatic software update process documented here.
ta: இங்கே ஆவணப்படுத்தப்பட்ட தானியங்கி மென்பொருள் புதுப்பிப்பு செயல்முறையின் போது சேவைகள் மறுதொடக்கம் செய்யப்படும் என்பதை நினைவில் கொள்க.

source: This guide should work for recent versions of an OpenBSD operating system.
ta: இந்த வழிகாட்டி ஒரு OpenBSD இயக்க முறைமையின் அண்மைக் கால பதிப்புகளுக்கு வேலை செய்ய வேண்டும்.

source: ### 4. Restart the service
ta: ### 4. சேவையை மறுதொடக்கம் செய்யுங்கள்

source: Ensure you update the packages database before installing the package, then call `zypper` to install it:
ta: தொகுப்பை நிறுவுவதற்கு முன் தொகுப்புகள் தரவுத்தளத்தைப் புதுப்பிப்பதை உறுதிசெய்து, அதை நிறுவ `சிபர்` ஐ அழைக்கவும்:

source: One of the most important things to keep your relay secure is to install security updates timely and, ideally, automatically, so you cannot forget about them.
ta: உங்கள் ரிலேவை பாதுகாப்பாக வைத்திருக்க மிக முக்கியமான விசயங்களில் ஒன்று, பாதுகாப்பு புதுப்பிப்புகளை சரியான நேரத்தில் நிறுவுவதும், தானாகவே, எனவே அவற்றை நீங்கள் மறக்க முடியாது.

source: How to deploy a Middle/Guard relay on openSUSE
ta: OpenSuse இல் ஒரு நடுத்தர/காவலர் ரிலேவை எவ்வாறு பயன்படுத்துவது

source: ### 1. Install the required packages
ta: ### 1. தேவையான தொகுப்புகளை நிறுவவும்

source: ### 2. Start the configuration tool
ta: ### 2. உள்ளமைவு கருவியைத் தொடங்கவும்

source: ### 3. Configure online updates
ta: ### 3. நிகழ்நிலை புதுப்பிப்புகளை உள்ளமைக்கவும்

source: Confirm that you have checked the three options above, select OK, and exit.
ta: மேலே உள்ள மூன்று விருப்பங்களை நீங்கள் சரிபார்த்துள்ளீர்கள் என்பதை உறுதிப்படுத்தவும், சரி என்பதைத் தேர்ந்தெடுத்து வெளியேறவும்.

source: If you are running openSUSE on a GUI, YaST2 counts with the same module. Otherwise, run the following command to use the CLI tool:
ta: நீங்கள் ஒரு GUI இல் OpenSuse ஐ இயக்குகிறீர்கள் என்றால், YAST2 அதே தொகுதியைக் கணக்கிடுகிறது. இல்லையெனில், CLI கருவியைப் பயன்படுத்த பின்வரும் கட்டளையை இயக்கவும்:

source: To install the `tor` package on Void Linux, please run:
ta: வெற்றிட லினக்சில் `TOR` தொகுப்பை நிறுவ, தயவுசெய்து இயக்கவும்:

source: How to deploy a Middle/Guard relay on Void Linux
ta: வெற்றிட லினக்சில் ஒரு நடுத்தர/காவலர் ரிலேவை எவ்வாறு பயன்படுத்துவது

source: # 1. Creating a user account for Tor
ta: # 1. TOR க்கு ஒரு பயனர் கணக்கை உருவாக்குதல்

source: # 2. Downloading and configuring the Windows Expert bundle
ta: # 2. சாளரங்கள் வல்லுநர் மூட்டை பதிவிறக்கம் செய்து கட்டமைத்தல்

source: # 3. Starting up your relay
ta: #3. உங்கள் ரிலேவைத் தொடங்குகிறது

source: ## 2.1 Downloading
ta: ## 2.1 பதிவிறக்கம்

source: ## 2.2 Configuration
ta: ## 2.2 உள்ளமைவு

source: ## 4. Final notes
ta: ## 4. இறுதி குறிப்புகள்

source: ### 3.1 Method 1: User interface
ta: ### 3.1 முறை 1: பயனர் இடைமுகம்

source: ### 3.2 Method 2: Command line
ta: ### 3.2 முறை 2: கட்டளை வரி

source: #Change the nickname "myNiceRelay" to a name that you like
ta: #நீங்கள் விரும்பும் பெயருக்கு "மைனிசெர்லே" என்ற புனைப்பெயரை மாற்றவும்

source: #Paths assume you extracted to C:\Users\torrelay\tor - if you
ta: #பாதைகள் நீங்கள் சி: \ பயனர்கள் \ டோரலே \ டோர் - நீங்கள் பிரித்தெடுத்துள்ளீர்கள் என்று கருதுகிறீர்கள்

source: #Put your email below - Note that it will be published on the metrics page
ta: #கீழே உங்கள் மின்னஞ்சலைக் காப்பாற்றுங்கள் - இது அளவீட்டு பக்கத்தில் வெளியிடப்படும் என்பதை நினைவில் கொள்க

source: #extracted elsewhere or used a different username, adjust the
ta: #வேறொரு இடத்தில் விரிவாக்கப்பட்டது அல்லது வேறு பயனர்பெயரைப் பயன்படுத்தியது, சரிசெய்யவும்

source: #paths accordingly
ta: #அதற்கேற்ப பாதைகள்

source: * **Notice:** Depending on your systems settings, Tor may fail to start and produce an error indicating it is unable to create files. If this occurs, simply open the Windows Defender Security Center and select "App & browser control". Add the tor.exe file to the permissions list, then rerun `tor.exe` from the command line. Tor should now start up normally.
ta: *** அறிவிப்பு: ** உங்கள் கணினி அமைப்புகளைப் பொறுத்து, டோர் தொடங்கத் தவறியிருக்கலாம் மற்றும் கோப்புகளை உருவாக்க முடியவில்லை என்பதைக் குறிக்கும் பிழையை உருவாக்கலாம். இது ஏற்பட்டால், சாளரங்கள் டிஃபென்டர் பாதுகாப்பு மையத்தைத் திறந்து "பயன்பாடு & உலாவி கட்டுப்பாடு" என்பதைத் தேர்ந்தெடுக்கவும். TOR.exe கோப்பை அனுமதிகள் பட்டியலில் சேர்த்து, பின்னர் கட்டளை வரியிலிருந்து `tor.exe` ஐ மீண்டும் இயக்கவும். டோர் இப்போது பொதுவாக தொடங்க வேண்டும்.

source: * Example: `RUNAS /user:torrelay "tor.exe -f C:\Users\torrelay\tor\Tor\torrc"`
ta: * எடுத்துக்காட்டு: `ரூனாச் /பயனர்: டோரலே" டோர்

source: *(Optional. A custom path can be used, though you will have to make necessary modifications in the following steps.)
ta: *(விரும்பினால். தனிப்பயன் பாதையைப் பயன்படுத்தலாம், இருப்பினும் நீங்கள் பின்வரும் படிகளில் தேவையான மாற்றங்களைச் செய்ய வேண்டியிருக்கும்.)

source: **Note: You should only run a Windows relay if you can run it 24/7. If you are unable to guarantee that, a [Snowflake](https://snowflake.torproject.org/) is a better way to contribute resources.**
ta: ** குறிப்பு: நீங்கள் 24/7 ஐ இயக்க முடிந்தால் மட்டுமே சாளரங்கள் ரிலேவை இயக்க வேண்டும். அதற்கு நீங்கள் பொறுப்பு அளிக்க முடியாவிட்டால், ஒரு [ச்னோஃப்ளேக்] (https://snowflake.torproject.org/) வளங்களை பங்களிக்க சிறந்த வழியாகும். **

source: 1. Navigate to the directory where you extracted Tor's files.
ta: 1. நீங்கள் டோரின் கோப்புகளை பிரித்தெடுத்த கோப்பகத்திற்கு செல்லவும்.

source: 1. Open your command prompt. Navigate to `C:\Users\torrelay\tor\Tor` with the command `cd C:\Users\torrelay\tor\Tor`.
ta: 1. உங்கள் கட்டளை வரியில் திறக்கவும். `C: \ பயனர்கள் \ torrelay \ tor \ tor` கட்டளையுடன்` குறுவட்டு சி: \ பயனர்கள் \ டோரலே \ டோர் \ டோர்`.

source: 1. To begin, open your Control Panel and select 'Accounts'.
ta: 1. தொடங்க, உங்கள் கட்டுப்பாட்டுக் குழுவைத் திறந்து 'கணக்குகள்' என்பதைத் தேர்ந்தெடுக்கவும்.

source: 1. Unpack the zipped Expert bundle into your newly created Tor directory. Two folders will be placed there; one called `Tor`, and the other `Data`.
ta: 1. உங்கள் புதிதாக உருவாக்கப்பட்ட டோர் கோப்பகத்தில் சிப் செய்யப்பட்ட வல்லுநர் மூட்டையைத் திறக்கவும். இரண்டு கோப்புறைகள் அங்கு வைக்கப்படும்; ஒன்று `டோர்`, மற்றொன்று` தரவு` என்று அழைக்கப்படுகிறது.

source: 2. Head to your `C:\Users\torrelay\` directory.
ta: 2. உங்கள் `சி: \ பயனர்கள் \ டோரலே \` கோப்பகத்திற்குச் செல்லுங்கள்.

source: 2. On the left-side menu, select 'Family & other people'.
ta: 2. இடது பக்க பட்டியலில், 'குடும்பம் & பிற நபர்கள்' என்பதைத் தேர்ந்தெடுக்கவும்.

source: 2. Simply Shift + right-click on the `tor.exe` file and select 'Run as other user' from the drop-down menu, and enter the password for your Tor account when prompted.
ta: 2. `Tor.exe` கோப்பில் + வலது சொடுக்கு செய்து, கீழ்தோன்றும் மெனுவிலிருந்து 'பிற பயனராக இயக்கவும்' என்பதைத் தேர்ந்தெடுக்கவும், கேட்கும்போது உங்கள் TOR கணக்கிற்கான கடவுச்சொல்லை உள்ளிடவும்.

source: 2. Type `RUNAS /user:torrelay tor.exe` and press enter. If you have your `torrc` file somewhere other than the default location (Like the `home` folder), specify the path with the `-f` flag.
ta: 2. `ரனாச் /பயனர்: டோரலே டோர்.இக்ச்` என தட்டச்சு செய்து Enter ஐ அழுத்தவும். இயல்புநிலை இருப்பிடத்தைத் தவிர வேறு எங்காவது உங்கள் `டோர்க்` கோப்பு இருந்தால் (` வீட்டு` கோப்புறை போன்றவை), பாதையை `-f` கொடியுடன் குறிப்பிடவும்.

source: 2. You should now create a folder called `log` in `C:\Users\torrelay\tor`.
ta: 2. நீங்கள் இப்போது `சி: \ பயனர்கள் \ டோரலே \ டோர்` என்ற கோப்புறையை உருவாக்க வேண்டும்.

source: 3. Beside the 'Add another user to this PC' subheader, click the large `+` sign.
ta: 3. 'இந்த கணினியில் மற்றொரு பயனரைச் சேர்' துணைத் தலைப்புக்கு அருகில், பெரிய `+` அடையாளத்தைக் சொடுக்கு செய்க.

source: 3. Create a folder called `tor`.
ta: 3. `டோர்` என்ற கோப்புறையை உருவாக்கவும்.

source: 3. You should now see Tor starting up in your terminal. Wait until its finished bootstrapping.
ta: 3. உங்கள் முனையத்தில் டோர் தொடங்குவதை இப்போது நீங்கள் காண வேண்டும். அதன் முடிக்கப்பட்ட பூட்ச்ட்ராப்பிங் வரை காத்திருங்கள்.

source: 3. You will now need to create a torrc file to define the ruleset of your relay.
ta: 3. உங்கள் ரிலேவின் விதிமுறைகளை வரையறுக்க இப்போது நீங்கள் ஒரு டோர்க் கோப்பை உருவாக்க வேண்டும்.

source: 4. A panel will now appear asking for the Windows account information. On the bottom, select the small text that states "I do not have this users sign-in information".
ta: 4. சாளரங்கள் கணக்கு தகவல்களைக் கேட்டு ஒரு குழு இப்போது தோன்றும். கீழே, "இந்த பயனர்கள் கையொப்பமிடும் செய்தி என்னிடம் இல்லை" என்று கூறும் சிறிய உரையைத் தேர்ந்தெடுக்கவும்.

source: 4. After a short period it should publish its OrPort, and you will be successfully relaying traffic for the Tor Network.
ta: 4. ஒரு குறுகிய காலத்திற்குப் பிறகு அது அதன் ஆட்டத்தை வெளியிட வேண்டும், மேலும் நீங்கள் TOR நெட்வொர்க்குக்கான போக்குவரத்தை வெற்றிகரமாக அனுப்புவீர்கள்.

source: 4. Open up your newly created `torrc` file in your text editor and populate it with the following contents:
ta: 4. உங்கள் உரை திருத்தியில் புதிதாக உருவாக்கப்பட்ட `டோர்க்` கோப்பைத் திறந்து பின்வரும் உள்ளடக்கங்களுடன் விரிவுபடுத்துங்கள்:

source: 5. Make sure everything is filled in correctly, then save and exit.
ta: 5. எல்லாம் சரியாக நிரப்பப்பட்டிருப்பதை உறுதிசெய்து, பின்னர் சேமித்து வெளியேறவும்.

source: 5. On the next panel, select the similar text on the bottom stating "Set up user without using a Microsoft account".
ta: 5. அடுத்த பேனலில், "நுண்மென் கணக்கைப் பயன்படுத்தாமல் பயனரை அமைக்கவும்" என்று கூறி கீழே உள்ள ஒத்த உரையைத் தேர்ந்தெடுக்கவும்.

source: 6. Enter a username for the user. Anything you like is fine, though within this guide the username `torrelay` will be used. Then enter a strong password and continue.
ta: 6. பயனருக்கு பயனர்பெயரை உள்ளிடவும். நீங்கள் விரும்பும் எதுவும் நல்லது, இந்த வழிகாட்டிக்குள் `டோரலே` பயனர்பெயர் பயன்படுத்தப்படும். பின்னர் வலுவான கடவுச்சொல்லை உள்ளிட்டு தொடரவும்.

source: Below are detailed instructions on how to perform these steps - please ensure you follow them very carefully, and make any of the necessary modifications outlined along the way.
ta: இந்த படிகளை எவ்வாறு செய்வது என்பது குறித்த விரிவான வழிமுறைகள் கீழே உள்ளன - தயவுசெய்து அவற்றை மிகவும் கவனமாகப் பின்பற்றுவதை உறுதிசெய்து, வழியில் கோடிட்டுக் காட்டப்பட்ட தேவையான மாற்றங்களைச் செய்யுங்கள்.

source: First you will need to create a new account to allow Tor to run isolated from your personal configuration as well as have manageable system permissions.
ta: முதலில் நீங்கள் ஒரு புதிய கணக்கை உருவாக்க வேண்டும், டோர் உங்கள் தனிப்பட்ட உள்ளமைவிலிருந்து தனிமைப்படுத்தப்பட்டு நிர்வகிக்கக்கூடிய கணினி அனுமதிகளைக் கொண்டிருக்க வேண்டும்.

source: Setting up a Windows system as a relay requires performing a few simple steps to set up a user account, download the `Windows expert bundle`, implement a torrc configuration file and start up Tor from the command line.
ta: ஒரு சாளரங்கள் அமைப்பை ரிலே என அமைப்பதற்கு பயனர் கணக்கை அமைக்க சில எளிய படிகளைச் செய்ய வேண்டும், `விண்டோச் வல்லுநர் மூட்டை` பதிவிறக்கம் செய்து, டோர்க் உள்ளமைவு கோப்பை செயல்படுத்தி, கட்டளை வரியிலிருந்து டோர் தொடங்க வேண்டும்.

source: The default directory path for this file is `C:\Users\torrelay\AppData\Roaming\tor\torrc`, though you can specify a custom location at commandline startup with the `-f` flag. (More below)
ta: இந்த கோப்பிற்கான இயல்புநிலை அடைவு பாதை `சி: \ பயனர்கள் \ டோரலே \ ஆப் டேட்டா \ ரோமிங் \ டோர் \ டோர்க்`, இருப்பினும் நீங்கள் தனிப்பயன் இருப்பிடத்தை கமாண்ட்லைன் ச்டார்ட்அப்பில்` -f` கொடியுடன் குறிப்பிடலாம். (மேலும் கீழே)

source: The next step is to download and install Windows Expert bundle as well as set up your torrc file.
ta: அடுத்த கட்டம் சாளரங்கள் வல்லுநர் மூட்டை பதிவிறக்கம் செய்து நிறுவுவதோடு உங்கள் டோர்க் கோப்பை அமைப்பதும் ஆகும்.

source: There are two methods for starting up your relay for the first time depending on your preferences and needs.
ta: உங்கள் விருப்பத்தேர்வுகள் மற்றும் தேவைகளைப் பொறுத்து முதல் முறையாக உங்கள் ரிலேவைத் தொடங்க இரண்டு முறைகள் உள்ளன.

source: You'll then need to create an empty file and name it `notices.log` in the `log` folder.
ta: நீங்கள் ஒரு வெற்று கோப்பை உருவாக்கி, `பதிவு` கோப்புறையில்` அறிவிப்புகள்.லாக்` என்று பெயரிட வேண்டும்.

source: How to deploy a Middle/Guard relay on Windows
ta: சன்னல்களில் ஒரு நடுத்தர/காவலர் ரிலேவை எவ்வாறு பயன்படுத்துவது

source: # 2. Verify that your relay works
ta: # 2. உங்கள் ரிலே செயல்படுகிறதா என்பதை சரிபார்க்கவும்

source: # 3. Read about Tor relay lifecycle
ta: #3. டோர் ரிலே வாழ்க்கைச் சுழற்சி பற்றி படியுங்கள்

source: # 4. Configuration Management
ta: # 4. உள்ளமைவு மேலாண்மை

source: # 5. Important: if you run more than one Tor instance
ta: # 5. முக்கியமானது: நீங்கள் ஒன்றுக்கு மேற்பட்ட டோர் நிகழ்வுகளை இயக்கினால்

source: # 6. Add firewall rules to protect against DDoS attacks
ta: # 6. டி.டி.ஓ.எச் தாக்குதல்களிலிருந்து பாதுகாக்க ஃபயர்வால் விதிகளைச் சேர்க்கவும்

source: # 7. Optional: Limiting bandwidth usage (and traffic)
ta: # 7. விரும்பினால்: அலைவரிசை பயன்பாட்டைக் கட்டுப்படுத்துதல் (மற்றும் போக்குவரத்து)

source: # 8. Check IPv6 availability
ta: # 8. ஐபிவி 6 கிடைப்பதை சரிபார்க்கவும்

source: # 9. Maintaining a relay
ta: # 9. ரிலேவை பராமரித்தல்

source: ## Backup Tor Identity Keys
ta: ## காப்பு டோர் அடையாள விசைகள்

source: ## Setting up outage notifications
ta: ## செயலிழப்பு அறிவிப்புகளை அமைத்தல்

source: ## Subscribe to the tor-announce mailing list
ta: ## டோர்-அனவுன்ச் அஞ்சல் பட்டியலுக்கு குழுசேரவும்

source: ## System Health Monitoring
ta: ## கணினி சுகாதார கண்காணிப்பு

source: ## Tools
ta: ## கருவிகள்

source: #1. Make sure relay ports can be reached
ta: #1. ரிலே துறைமுகங்களை அடைய முடியும் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்

source: * Bandwidth
ta: * அலைவரிசை

source: * CPU
ta: * சிபியு

source: * Data in categories (IP version, in/out, etc.) is worse than total data.
ta: * வகைகளில் தரவு (ஐபி பதிப்பு, இன்/அவுட், முதலியன) மொத்த தரவை விட மோசமானது.

source: * Established TCP Connections
ta: * நிறுவப்பட்ட TCP இணைப்புகள்

source: * Memory
ta: * நினைவகம்

source: * Numbers are worse than graphs.
ta: * எண்கள் வரைபடங்களை விட மோசமானவை.

source: * Real-time data is worse than historical data.
ta: * நிகழ்நேர தரவு வரலாற்று தரவை விட மோசமானது.

source: * Reporting individual relays is worse than reporting totals for groups of relays. In future, tor will securely aggregate bandwidth statistics, so any individual relay bandwidth reporting will be less secure than tor's statistics.
ta: * ரிலேக்களின் குழுக்களுக்கான மொத்தங்களைப் புகாரளிப்பதை விட தனிப்பட்ட ரிலேக்களைப் புகாரளிப்பது மோசமானது. எதிர்காலத்தில், TOR அலைவரிசை புள்ளிவிவரங்களை பாதுகாப்பாக மொத்தமாக இருக்கும், எனவே எந்தவொரு தனிப்பட்ட ரிலே அலைவரிசை அறிக்கையும் டோரின் புள்ளிவிவரங்களை விட குறைவான பாதுகாப்பாக இருக்கும்.

source: * Smaller periods are worse.
ta: * சிறிய காலங்கள் மோசமாக உள்ளன.

source: * Swap
ta: * இடமாற்று

source: * [Nyx](https://nyx.torproject.org/): is a Tor Project tool (formerly arm) that allows you to see real time data of your relay.
ta: * [Nyx](https://nyx.torproject.org/): is a Tor திட்டம் கருவி (formerly arm) that allows you பெறுநர் see real time தகவல்கள் of your relay.

source: * vnstat: vnstat is a command-line tool that shows the amount of data going through your network connection.
ta: * vnstat: Vnstat என்பது உங்கள் பிணைய இணைப்பு மூலம் செல்லும் தரவின் அளவைக் காட்டும் கட்டளை-வரி கருவியாகும்.

source: **If you enable IPv6 without working IPv6 connectivity, your entire relay will remain unused, regardless of whether IPv4 is working.**
ta: ** ஐபிவி 6 இணைப்பில் வேலை செய்யாமல் ஐபிவி 6 ஐ இயக்கினால், ஐபிவி 4 செயல்படுகிறதா என்பதைப் பொருட்படுத்தாமல் உங்கள் முழு ரிலேவும் பயன்படுத்தப்படாது. **

source: **Note: Tor requires IPv4 connectivity, you can not run a Tor relay on IPv6-only.**
ta: ** குறிப்பு: TOR க்கு IPv4 இணைப்பு தேவை, நீங்கள் IPv6-மட்டும் ஒரு டோர் ரிலேவை இயக்க முடியாது. **

source: **Note:** These are community provided resources.
ta: ** குறிப்பு: ** இவை சமூகத்தால் வழங்கப்பட்ட வளங்கள்.

source: - https://github.com/Enkidu-6/tor-ddos: A simple set of scripts to deploy.
ta: - https://github.com/Enkidu-6/tor-ddos: A simple கணம் of scripts பெறுநர் deploy.

source: - https://github.com/toralf/torutils: If you would like a script to deploy.
ta: - https://github.com/toralf/torutils: நீங்கள் ஒரு ச்கிரிப்டை வரிசைப்படுத்த விரும்பினால்.
