Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: These lists can be unpleasant to maintain, and expensive to download.
ta: இந்த பட்டியல்கள் பராமரிக்க விரும்பத்தகாதவை, பதிவிறக்கம் செய்ய விலை உயர்ந்தவை.

source: This will create a file called `MyKey.secret_family_key`; it will also write something like this result to standard output:
ta: இது `mykey.secret_family_key` என்ற கோப்பை உருவாக்கும்; இது இந்த முடிவை நிலையான வெளியீட்டிற்கு எழுதும்:

source: To do this, we recommend a step-wise process.
ta: இதைச் செய்ய, ஒரு படி வாரியான செயல்முறையை நாங்கள் பரிந்துரைக்கிறோம்.

source: Unfortunately, you will still need to configure the `MyFamily` option as you did before: until clients all support Happy Families, they will need to look at the legacy family lists.
ta: எதிர்பாராதவிதமாக, நீங்கள் முன்பு செய்ததைப் போலவே `மைஃபாமிலி` விருப்பத்தை நீங்கள் இன்னும் கட்டமைக்க வேண்டும்: வாடிக்கையாளர்கள் அனைவரும் மகிழ்ச்சியான குடும்பங்களை ஆதரிக்கும் வரை, அவர்கள் மரபு குடும்ப பட்டியல்களைப் பார்க்க வேண்டும்.

source: We plan to remove `MyFamily` and legacy TAP onion keys at the same time.
ta: ஒரே நேரத்தில் `மைஃபாமிலி` மற்றும் மரபு தட்டுதல் வெங்காய விசைகளை அகற்ற திட்டமிட்டுள்ளோம்.

source: We'll announce once it is no longer necessary to include `MyFamily`.
ta: `MyFamily` ஐ சேர்க்க வேண்டிய அவசியமில்லை என்று அறிவிப்போம்.

source: We're going to try to keep this transitional period as short as is reasonable.
ta: இந்த இடைக்கால காலத்தை நியாயமானதாக வைத்திருக்க முயற்சிக்கப் போகிறோம்.

source: When we do, we estimate that the resulting network's microdescriptors will be something around 10% of their current size.
ta: நாங்கள் அவ்வாறு செய்யும்போது, இதன் விளைவாக வரும் நெட்வொர்க்கின் மைக்ரோடெக்ச்கிரிப்டர்கள் அவற்றின் தற்போதைய அளவில் 10% ஆக இருக்கும் என்று மதிப்பிடுகிறோம்.

source: You should read this if you are a relay operator who needs to configure a family on the Tor network.
ta: டோர் நெட்வொர்க்கில் ஒரு குடும்பத்தை உள்ளமைக்க வேண்டிய ரிலே ஆபரேட்டராக நீங்கள் இருந்தால் இதைப் படிக்க வேண்டும்.

source: Learn how to configure your relays' FamilyID
ta: உங்கள் ரிலேசின் குடும்பத்தை எவ்வாறு கட்டமைப்பது என்பதை அறிக

source: ### 1. Install the Snowflake addon to your browser
ta: ### 1. உங்கள் உலாவியில் ச்னோஃப்ளேக் துணை நிரலை நிறுவவும்

source: ### 2. Monitor your Snowflake's status and usage
ta: ### 2. உங்கள் ச்னோஃப்ளேக்கின் நிலை மற்றும் பயன்பாட்டைக் கண்காணிக்கவும்

source: 1. Use Firefox or Chromium/Chrome as your browser
ta: 1. உங்கள் உலாவியாக பயர்பாக்ச் அல்லது குரோமியம்/குரோம் பயன்படுத்தவும்

source: 2. Have WebRTC enabled
ta: 2. WEBRTC இயக்கப்பட்டதா?

source: Chrome users can install our addon from the [Google webstore](https://chrome.google.com/webstore/detail/snowflake/mafpmfcccpbjnhfhjnllmmalhifmlcie).
ta: குரோம் பயனர்கள் [கூகிள் வெப்ச்டோர்] (https://chrome.google.com/webstore/detail/snowflake/mafpmffcccccccccccchnhlmmalhmalhifmlcie) இலிருந்து எங்கள் துணை நிரலை நிறுவலாம்.

source: If you are running Firefox, you can install our [Firefox addon](https://addons.mozilla.org/en-US/firefox/addon/torproject-snowflake/).
ta: நீங்கள் பயர்பாக்சை இயக்குகிறீர்கள் என்றால், எங்கள் [பயர்பாக்ச் addon] (https://addons.mozilla.org/en-us/firefox/addon/torproject-snowflake/) ஐ நிறுவலாம்.

source: It will also display an error message if the Snowflake could not connect to clients or the Snowflake bridge.
ta: ச்னோஃப்ளேக் வாடிக்கையாளர்களுடனோ அல்லது ச்னோஃப்ளேக் பாலத்துடனோ இணைக்க முடியாவிட்டால் அது பிழை செய்தியைக் காண்பிக்கும்.

source: It's easiest to leave it running while you browse and it should not interfere with your regular browsing experience.
ta: நீங்கள் உலாவும்போது அதை இயக்குவது எளிதானது, அது உங்கள் வழக்கமான உலாவல் அனுபவத்தில் தலையிடக்கூடாது.

source: Once it is installed, you can toggle the `Enabled` switch to turn it off and on.
ta: இது நிறுவப்பட்டதும், அதை அணைக்க `இயக்கப்பட்ட` சுவிட்சை மாற்றலாம்.

source: Running a Snowflake proxy as a browser add on is a great low-effort way to donate bandwidth if you don't have access to an always-on highly connected server.
ta: ஒரு ச்னோஃப்ளேக் ப்ராக்சியை உலாவி சேர்க்கையாக இயக்குவது, எப்போதும் மிகவும் இணைக்கப்பட்ட சேவையகத்திற்கு அணுகல் இல்லையென்றால் அலைவரிசையை நன்கொடையாக வழங்குவதற்கான சிறந்த குறைந்த முயற்சி.

source: The Snowflake addon will inform you about how many people you have helped in the last 24 hours.
ta: கடந்த 24 மணி நேரத்தில் நீங்கள் எத்தனை பேருக்கு உதவியுள்ளீர்கள் என்பதைப் பற்றி ச்னோஃப்ளேக் துணை நிரல் உங்களுக்குத் தெரிவிக்கும்.

source: There are very few requirements to running a browser-based proxy:
ta: உலாவி அடிப்படையிலான ப்ராக்சியை இயக்குவதற்கு மிகக் குறைவான தேவைகள் உள்ளன:

source: Snowflake
ta: ச்னோஃப்ளேக்

source: How to run a Snowflake proxy in your browser
ta: உங்கள் உலாவியில் ச்னோஃப்ளேக் ப்ராக்சியை எவ்வாறு இயக்குவது

source: Browser Snowflake proxy
ta: உலாவி ச்னோஃப்ளேக் பதிலாள்

source: 1. Internet connectivity
ta: 1. இணைய இணைப்பு

source: The requirements are:
ta: தேவைகள்:

source: There are a few different options for running a Snowflake proxy.
ta: ச்னோஃப்ளேக் ப்ராக்சியை இயக்க சில வேறுபட்ட விருப்பங்கள் உள்ளன.

source: This guide will help you set up a Snowflake proxy to help censored users connect to the Tor network.
ta: தணிக்கை செய்யப்பட்ட பயனர்கள் TOR நெட்வொர்க்குடன் இணைக்க உதவும் வகையில் ச்னோஃப்ளேக் ப்ராக்சியை அமைக்க இந்த வழிகாட்டி உதவும்.

source: Snowflake operations
ta: ச்னோஃப்ளேக் செயல்பாடுகள்

source: Run an snowflake proxy to help censored users connect to the Tor network
ta: தணிக்கை செய்யப்பட்ட பயனர்கள் TOR நெட்வொர்க்குடன் இணைக்க உதவும் வகையில் ச்னோஃப்ளேக் ப்ராக்சியை இயக்கவும்

source: ### 8. (Optional) Limiting usage
ta: ### 8. (விரும்பினால்) பயன்பாட்டைக் கட்டுப்படுத்துதல்

source: ### Features
ta: ### நற்பொருத்தங்கள்

source: ### Requirements
ta: ### தேவைகள்

source: #### 1. Install Ansible
ta: #### 1. Ansible ஐ நிறுவவும்

source: #### 2. Download the Ansible role
ta: #### 2. அன்சிபிள் பாத்திரத்தைப் பதிவிறக்கவும்

source: #### 3. Create a playbook
ta: ####. ஒரு பிளேபுக்கை உருவாக்கவும்

source: #### 4. Create an inventory
ta: ####. ஒரு சரக்குகளை உருவாக்கவும்

source: #### 5. Deploy
ta: #### 5. வரிசைப்படுத்துங்கள்

source: #### 6. Manage Snowflake proxy
ta: #### 6. ச்னோஃப்ளேக் ப்ராக்சியை நிர்வகிக்கவும்

source: #### 7. Upgrading your Snowflake proxy
ta: #### 7. உங்கள் ச்னோஃப்ளேக் ப்ராக்சியை மேம்படுத்துதல்

source: **Note:** This Ansible role variable isn't available for FreeBSD.
ta: ** குறிப்பு: ** இந்த அன்சிபிள் பங்கு மாறி FreeBSD க்கு கிடைக்காது.

source: - Ansible 2.9 or higher
ta: - அன்சிபிள் 2.9 அல்லது அதற்கு மேற்பட்டது

source: - Python
ta: - பைதான்

source: - Support for Ubuntu, Debian, Arch Linux, Fedora and FreeBSD.
ta: - உபுண்டு, டெபியன், ஆர்ச் லினக்ச், ஃபெடோரா மற்றும் ஃப்ரீ.பி.எச்.டி.

source: - Systemd unit to manage Snowflake service on GNU/Linux and rc script for FreeBSD.
ta: - Systemd அலகு பெறுநர் manage Snowflake பணி on GNU/Linux and rc script க்கு FreeBSD.

source: An inventory is a list of servers that Ansible will automatically manage through the playbook.
ta: ஒரு சரக்கு என்பது சேவையகங்களின் பட்டியல், இது அன்சிபிள் தானாகவே பிளேபுக் மூலம் நிர்வகிக்கும்.

source: Finally, by running the playbook, Ansible will deploy the Snowflake standalone proxy.
ta: இறுதியாக, பிளேபுக்கை இயக்குவதன் மூலம், அன்சிபிள் ச்னோஃப்ளேக் முழுமையான ப்ராக்சியை வரிசைப்படுத்தும்.

source: For FreeBSD, you can manage your Snowflake proxy by using these rc script commands.
ta: FreeBSD க்கு, இந்த RC ச்கிரிப்ட் கட்டளைகளைப் பயன்படுத்தி உங்கள் ச்னோஃப்ளேக் ப்ராக்சியை நிர்வகிக்கலாம்.

source: If the Snowflake proxy host is running systemd, you can manage your Snowflake proxy by using systemd commands: start, status, and stop.
ta: ச்னோஃப்ளேக் பதிலாள் புரவலன் சிச்டம் டி இயங்கினால், சிச்டம் டி கட்டளைகளைப் பயன்படுத்தி உங்கள் ச்னோஃப்ளேக் ப்ராக்சியை நிர்வகிக்கலாம்: தொடக்க, நிலை மற்றும் நிறுத்தம்.

source: It's important to keep your Snowflake standalone proxy up to date.
ta: உங்கள் ச்னோஃப்ளேக் முழுமையான ப்ராக்சியை புதுப்பித்த நிலையில் வைத்திருப்பது முதன்மை.

source: Next, create an Ansible playbook to run the new role:
ta: அடுத்து, புதிய பாத்திரத்தை இயக்க ஒரு அன்சிபிள் பிளேபுக்கை உருவாக்கவும்:

source: Or find other ways to [install Ansible](https://docs.ansible.com/ansible/latest/installation_guide/intro_installation.html).
ta: Or கண்டுபிடி மற்றொன்று ways பெறுநர் [install Ansible](https://docs.ansible.com/ansible/latest/installation_guide/intro_installation.html).

source: Or with sudo:
ta: அல்லது சூடோவுடன்:

source: Running the Ansible playbook will install the updates:
ta: அன்சிபிள் பிளேபுக்கை இயக்குவது புதுப்பிப்புகளை நிறுவும்:

source: The Ansible role is called `nvjacobo.snowflake`.
ta: அன்சிபிள் பாத்திரம் `nvjacobo.snowflake` என்று அழைக்கப்படுகிறது.

source: The maximum concurrent clients by default is unlimited (0 = non limit).
ta: முன்னிருப்பாக அதிகபட்ச ஒரே நேரத்தில் வாடிக்கையாளர்கள் வரம்பற்றவர்கள் (0 = வரம்பு அல்லாதவை).

source: The playbook below has a limit of 300 concurrent clients:
ta: கீழேயுள்ள பிளேபுக்கில் 300 ஒரே நேரத்தில் வாடிக்கையாளர்களின் வரம்பு உள்ளது:

source: This Ansible role will install, configure, and operate Snowflake standalone proxy.
ta: இந்த அன்சிபிள் பங்கு ச்னோஃப்ளேக் முழுமையான ப்ராக்சியை நிறுவும், உள்ளமைக்கும் மற்றும் இயக்கும்.

source: You can find it in [Galaxy repository](https://galaxy.ansible.com/nvjacobo/snowflake) and install using the command line:
ta: நீங்கள் அதை [கேலக்சி களஞ்சியத்தில்] (https://galaxy.ansible.com/nvjacobo/snowflake) இல் காணலாம் மற்றும் கட்டளை வரியைப் பயன்படுத்தி நிறுவலாம்:

source: You can install Ansible using `pip`:
ta: `பிப்` ஐப் பயன்படுத்தி அன்சிபிலை நிறுவலாம்:

source: You can limit the number of clients (Snowflake users) by using the variable `client`.
ta: `கிளையன்ட்` என்ற மாறியைப் பயன்படுத்துவதன் மூலம் வாடிக்கையாளர்களின் எண்ணிக்கையை (ச்னோஃப்ளேக் பயனர்கள்) கட்டுப்படுத்தலாம்.

source: You can run it as root:
ta: நீங்கள் அதை வேராக இயக்கலாம்:

source: How to run a standalone Snowflake proxy with Ansible role
ta: அன்சிபிள் பாத்திரத்துடன் ஒரு முழுமையான ச்னோஃப்ளேக் ப்ராக்சியை எவ்வாறு இயக்குவது

source: Ansible role
ta: அன்சிபிள் பங்கு

source: 2. A full-cone NAT (you can use this [NAT behaviour tool](https://github.com/pion/stun/tree/master/cmd/stun-nat-behaviour) to test what type of NAT you have.
ta: 2. ஒரு முழு-CONE NAT (நீங்கள் இந்த [NAT நடத்தை கருவி] (https://github.com/pion/stun/tree/master/cmd/stun-nat-behaviour) ஐப் பயன்படுத்தலாம்.

source: 3. A server behind no or unrestricted NAT, with incoming UDP on the whole port range of `cat /proc/sys/net/ipv4/ip_local_port_range` open (or the range set using the optional `-ephemeral-ports-range` flag).
ta: 3. இல்லை அல்லது கட்டுப்பாடற்ற NAT க்கு பின்னால் ஒரு சேவையகம், `Cat/proc/sys/net/ipv4/ip_local_port_range` திறந்த (அல்லது விருப்பமான` -ephemeral-ports- Range` கொடியைப் பயன்படுத்தி அமைக்கப்பட்டிருக்கும் வரம்பு அமைக்கப்பட்டுள்ளது ).

source: If you need help to install and operate your Snowflake proxy, visit the [Tor Forum](https://forum.torproject.org/tag/snowflake).
ta: உங்கள் ச்னோஃப்ளேக் ப்ராக்சியை நிறுவவும் இயக்கவும் உங்களுக்கு உதவி தேவைப்பட்டால், [டோர் மன்றம்] (https://forum.torproject.org/tag/snowflake) ஐப் பார்வையிடவும்.

source: Please choose your preferred platform below.
ta: கீழே உங்களுக்கு விருப்பமான தளத்தைத் தேர்வுசெய்க.

source: The only requirements are internet connectivity, however one of the main advantages of standalone Snowflake proxies is that they can be installed on servers and offer a higher bandwidth and more reliable option for users behind restrictive NATs and firewalls.
ta: இணைய இணைப்பு மட்டுமே தேவைகள், இருப்பினும் முழுமையான ச்னோஃப்ளேக் ப்ராக்சிகளின் முக்கிய நன்மைகளில் ஒன்று, அவை சேவையகங்களில் நிறுவப்படலாம் மற்றும் கட்டுப்பாட்டு நாட்ச் மற்றும் ஃபயர்வால்களுக்குப் பின்னால் உள்ள பயனர்களுக்கு அதிக அலைவரிசை மற்றும் நம்பகமான விருப்பத்தை வழங்கலாம்.

source: The properties you are looking for are address-independent mapping and either address-independent or address-dependent filtering)
ta: நீங்கள் தேடும் பண்புகள் முகவரி-சுயாதீன மேப்பிங் மற்றும் முகவரி-சுயாதீனமான அல்லது முகவரி சார்ந்த வடிகட்டுதல்)

source: There are several ways to setup and run a standalone snowflake proxy.
ta: ஒரு முழுமையான ச்னோஃப்ளேக் ப்ராக்சியை அமைத்து இயக்க பல வழிகள் உள்ளன.

source: Therefore, we especially recommend:
ta: எனவே, நாங்கள் குறிப்பாக பரிந்துரைக்கிறோம்:

source: This guide will help you set up a standalone Snowflake proxy to help censored users connect to the Tor network.
ta: தணிக்கை செய்யப்பட்ட பயனர்கள் TOR நெட்வொர்க்குடன் இணைக்க உதவும் வகையில் ஒரு முழுமையான ச்னோஃப்ளேக் ப்ராக்சியை அமைக்க இந்த வழிகாட்டி உதவும்.

source: How to run a standalone Snowflake proxy
ta: ஒரு முழுமையான ச்னோஃப்ளேக் ப்ராக்சியை எவ்வாறு இயக்குவது

source: Standalone Snowflake proxy
ta: முழுமையான ச்னோஃப்ளேக் பதிலாள்

source: ### 1. Installation
ta: ### 1. நிறுவல்

source: ### 2. Operating snowflake proxy
ta: ### 2. இயக்க ச்னோஃப்ளேக் பதிலாள்

source: ### 3. Monitoring logs
ta: ### 3. கண்காணிப்பு பதிவுகள்

source: ### 4. Enable Automatic Software Updates
ta: ### 4. தானியங்கி மென்பொருள் புதுப்பிப்புகளை இயக்கவும்

source: Keeping an eye on the operation logs can help troubleshoot issues or confirm the proxy's activity:
ta: செயல்பாட்டு பதிவுகளில் ஒரு கண் வைத்திருப்பது சிக்கல்களை சரிசெய்ய உதவும் அல்லது ப்ராக்சியின் செயல்பாட்டை உறுதிப்படுத்த உதவும்:

source: One of the most important things to keep your snowflake proxy secure is to install security updates timely and ideally automatically so you can not forget about it. Follow the instructions to enable [automatic software updates](/relay/setup/guard/debian-ubuntu/updates/) for your operating system.
ta: உங்கள் ச்னோஃப்ளேக் ப்ராக்சியை பாதுகாப்பாக வைத்திருக்க மிக முக்கியமான விசயங்களில் ஒன்று, பாதுகாப்பு புதுப்பிப்புகளை சரியான நேரத்தில் மற்றும் தானாகவே நிறுவுவது, எனவே நீங்கள் அதை மறந்துவிட முடியாது. உங்கள் இயக்க முறைமைக்கு [தானியங்கி மென்பொருள் புதுப்பிப்புகள்] (/ரிலே/அமைவு/காவலர்/டெபியன்-உபுண்டு/புதுப்பிப்புகள்/) இயக்க வழிமுறைகளைப் பின்பற்றவும்.

source: Open your terminal and execute the following command:
ta: உங்கள் முனையத்தைத் திறந்து பின்வரும் கட்டளையை இயக்கவும்:

source: Snowflake proxy can be easily installed as a package on Debian-based systems (Debian 12 - bookworm).
ta: ச்னோஃப்ளேக் ப்ராக்சியை டெபியன் அடிப்படையிலான அமைப்புகளில் (டெபியன் 12 - புத்தகப்புழு) ஒரு தொகுப்பாக எளிதாக நிறுவ முடியும்.

source: The snowflake proxy service should start automatically after installation.
ta: ச்னோஃப்ளேக் பதிலாள் பணி நிறுவலுக்குப் பிறகு தானாகத் தொடங்க வேண்டும்.

source: This guide will walk you through the installation, operation, and maintenance of [Snowflake](https://snowflake.torproject.org) proxy to contribute to the Tor Project's anti-censorship efforts.
ta: இந்த வழிகாட்டி [ச்னோஃப்ளேக்] (https://snowflake.torproject.org) இன் நிறுவல், செயல்பாடு மற்றும் பராமரிப்பு மூலம் உங்களை அழைத்துச் செல்லும்.

source: To check the current status of your snowflake proxy:
ta: உங்கள் ச்னோஃப்ளேக் ப்ராக்சியின் தற்போதைய நிலையை சரிபார்க்க:

source: To enable snowflake proxy to automatically start on on boot:
ta: ச்னோஃப்ளேக் ப்ராக்சியை தானாகவே துவக்கத் தொடங்க உதவுகிறது:

source: You can manage the service with systemd commands:
ta: SystemD கட்டளைகளுடன் சேவையை நிர்வகிக்கலாம்:

source: ⚠️ Packages might be outdated and so this setup might not work. It is recommended to use another setup method, e.g. Docker.
ta: Progets தொகுப்புகள் காலாவதியானதாக இருக்கலாம், எனவே இந்த அமைப்பு செயல்படாது. மற்றொரு அமைவு முறையைப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது, எ.கா. கப்பல்துறை.

source: How to run a standalone Snowflake proxy on Debian
ta: டெபியனில் ஒரு முழுமையான ச்னோஃப்ளேக் ப்ராக்சியை எவ்வாறு இயக்குவது

source: Debian
ta: டெபியன்

source: ### 1. Install Docker
ta: ### 1. டோக்கரை நிறுவவும்

source: ### 2. Download the docker compose file
ta: ### 2. கப்பல்துறை இசையமைத்தல் கோப்பைப் பதிவிறக்கவும்

source: ### 3. Checking your Docker logs
ta: ### 3. உங்கள் கப்பல்துறை பதிவுகளைச் சரிபார்க்கிறது

source: ### 4. Automatic updates with Watchtower
ta: ### 4. காவற்கோபுரத்துடன் தானியங்கி புதுப்பிப்புகள்

source: Download the [docker-compose.yml](https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/snowflake/-/raw/main/docker-compose.yml?ref_type=heads) configuration file.
ta: [Docker-compose.yml](https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/snowflake/-/raw/main/docker-compose.yml?ref_type=heads) உள்ளமைவு கோப்பு.

source: If you would like to use it, run the following command:
ta: நீங்கள் அதைப் பயன்படுத்த விரும்பினால், பின்வரும் கட்டளையை இயக்கவும்:

source: Now your snowflake proxy will stay updated automatically!
ta: இப்போது உங்கள் ச்னோஃப்ளேக் பதிலாள் தானாகவே புதுப்பிக்கப்படும்!

source: Open a terminal and run these commands:
ta: ஒரு முனையத்தைத் திறந்து இந்த கட்டளைகளை இயக்கவும்:

source: Otherwise, you will need to periodically pull the latest container and restart it manually.
ta: இல்லையெனில், நீங்கள் அவ்வப்போது அண்மைக் கால கொள்கலனை இழுத்து கைமுறையாக மறுதொடக்கம் செய்ய வேண்டும்.

source: Run the command to download it:
ta: அதைப் பதிவிறக்க கட்டளையை இயக்கவும்:

source: The [docker-compose.yml](https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/snowflake/-/raw/main/docker-compose.yml?ref_type=heads) file contains a `watchtower` container, configured to automatically check for updates to the snowflake docker container every day, download them and run them.
ta: The [docker-compose.yml](https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/snowflake/-/raw/main/docker-compose.yml?ref_type=heads) கோப்பு contains a `watchtower` container, configured ஒவ்வொரு நாளும் ச்னோஃப்ளேக் கப்பல்துறை கொள்கலனுக்கான புதுப்பிப்புகளை தானாகவே சரிபார்க்க, அவற்றை பதிவிறக்கம் செய்து இயக்கவும்.

source: The instructions in this step are for Debian-based systems, but you can find [Docker instructions](https://docs.docker.com/get-docker/) for other supported platforms.
ta: இந்த கட்டத்தில் உள்ள வழிமுறைகள் டெபியன் அடிப்படையிலான அமைப்புகளுக்கானவை, ஆனால் நீங்கள் [டோக்கர் வழிமுறைகள்] (https://docs.docker.com/get-docker/) பிற உதவி தளங்களுக்கு காணலாம்.

source: Then, deploy the proxy by running:
ta: பின்னர், இயங்குவதன் மூலம் ப்ராக்சியை வரிசைப்படுத்தவும்:

source: This command starts the Snowflake proxy in detached mode.
ta: இந்த கட்டளை பிரிக்கப்பட்ட பயன்முறையில் ச்னோஃப்ளேக் ப்ராக்சியைத் தொடங்குகிறது.

source: This guide will help you set up a standalone [Snowflake](https://snowflake.torproject.org) proxy using Docker to help censored users connect to the Tor network.
ta: தணிக்கை செய்யப்பட்ட பயனர்கள் TOR நெட்வொர்க்குடன் இணைக்க உதவுவதற்காக டோக்கரைப் பயன்படுத்தி பதிலாள் ப்ராக்சியைப் பயன்படுத்தி ஒரு முழுமையான [ச்னோஃப்ளேக்] (https://snowflake.torproject.org) அமைக்க இந்த வழிகாட்டி உங்களுக்கு உதவும்.

source: We have a [Docker image](https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/snowflake/container_registry/11) to ease the setup of a Snowflake proxy.
ta: ஒரு ச்னோஃப்ளேக் ப்ராக்சியின் அமைப்பை எளிதாக்குவதற்காக எங்களிடம் [டோக்கர் படம்] (https://gitlab.torproject.org/tpo/anti-censorship/pluggable-transports/snowflake/snowflakes/container_registry/11) உள்ளது.

source: You should now see the output:
ta: நீங்கள் இப்போது வெளியீட்டைக் காண வேண்டும்:

source: and your proxy is up and running!
ta: உங்கள் பதிலாள் இயங்குகிறது!

source: How to run a standalone Snowflake proxy with Docker
ta: டோக்கருடன் ஒரு முழுமையான ச்னோஃப்ளேக் ப்ராக்சியை எவ்வாறு இயக்குவது

source: Docker setup
ta: கப்பல்துறை அமைப்பு

source: ### 2. Enable Snowflake's proxy daemon to start on boot
ta: ### 2. துவக்கத்தில் தொடங்க ச்னோஃப்ளேக்கின் பதிலாள் டீமானை இயக்கவும்

source: ### 3. Start the service
ta: ### 3. சேவையைத் தொடங்கவும்

source: ### Getting help
ta: ### உதவி பெறுதல்

source: After installation and configuration, start the Snowflake service manually for the first time with:
ta: நிறுவல் மற்றும் உள்ளமைவுக்குப் பிறகு, ச்னோஃப்ளேக் சேவையை முதல் முறையாக கைமுறையாகத் தொடங்கவும்:

source: If you have any issues or need further assistance with the Snowflake proxy commands, you can access the help documentation by running:
ta: உங்களுக்கு ஏதேனும் சிக்கல்கள் இருந்தால் அல்லது ச்னோஃப்ளேக் பதிலாள் கட்டளைகளுக்கு மேலதிக உதவி தேவைப்பட்டால், இயங்குவதன் மூலம் உதவி ஆவணங்களை அணுகலாம்:

source: Install the Snowflake proxy package using FreeBSD's package manager:
ta: FreeBSD இன் தொகுப்பு மேலாளரைப் பயன்படுத்தி ச்னோஃப்ளேக் பதிலாள் தொகுப்பை நிறுவவும்:

source: It will keep its same defaults, and allow the proxy service to run.
ta: இது அதே இயல்புநிலைகளை வைத்திருக்கும், மேலும் பதிலாள் சேவையை இயக்க அனுமதிக்கும்.

source: To ensure the Snowflake proxy service automatically starts on system boot, enable it using the `sysrc` command:
ta: ச்னோஃப்ளேக் பதிலாள் பணி தானாகவே கணினி துவக்கத்தில் தொடங்குகிறது என்பதை உறுதிப்படுத்த, `sysrc` கட்டளையைப் பயன்படுத்தி அதை இயக்கவும்:

source: How to run a standalone Snowflake proxy on FreeBSD
ta: FreeBSD இல் ஒரு முழுமையான ச்னோஃப்ளேக் ப்ராக்சியை எவ்வாறு இயக்குவது

source: ### 1. Install Go
ta: ### 1. கோ

source: ### 2. Install git and clone Snowflake repository
ta: ### 2. அறிவிலி மற்றும் நகலி ச்னோஃப்ளேக் களஞ்சியத்தை நிறுவவும்

source: ### 3. Build Snowflake proxy
ta: ### 3. ச்னோஃப்ளேக் ப்ராக்சியை உருவாக்குங்கள்

source: ### 4. Run the Snowflake proxy
ta: ### 4. ச்னோஃப்ளேக் ப்ராக்சியை இயக்கவும்

source: ### 5. Make sure the proxy is started after a reboot of the system
ta: ### 5. கணினியின் மறுதொடக்கத்திற்குப் பிறகு பதிலாள் தொடங்கப்படுவதை உறுதிசெய்க

source: ### 6. Keep your Snowflake proxy updated
ta: ### 6. உங்கள் ச்னோஃப்ளேக் ப்ராக்சியை புதுப்பிக்கவும்

source: After you cloned the repository, you can build Snowflake proxy binary by running the command:
ta: நீங்கள் களஞ்சியத்தை நகலி செய்த பிறகு, கட்டளையை இயக்குவதன் மூலம் ச்னோஃப்ளேக் பதிலாள் பைனரியை உருவாக்கலாம்:

source: After your proxy finished to compile, you can run it with the command:
ta: உங்கள் பதிலாள் தொகுக்க முடிந்த பிறகு, நீங்கள் அதை கட்டளையுடன் இயக்கலாம்:

source: Don't use `root`.
ta: `ரூட்` ஐப் பயன்படுத்த வேண்டாம்.

source: Edit your crontab by running the command:
ta: கட்டளையை இயக்குவதன் மூலம் உங்கள் க்ரோன்டாப்பைத் திருத்தவும்:

source: Enter the following line (example, adapt paths to your situation)
ta: பின்வரும் வரியை உள்ளிடவும் (எடுத்துக்காட்டு, உங்கள் நிலைமைக்கு பாதைகளை மாற்றியமைக்கவும்)

source: First you will need to install and configure the Go compiler to build the standalone proxy from source code.
ta: முதலில் நீங்கள் மூலக் குறியீட்டிலிருந்து முழுமையான ப்ராக்சியை உருவாக்க கோ கம்பைலரை நிறுவி கட்டமைக்க வேண்டும்.

source: If you are running Ubuntu or Debian, you can install Go by executing `sudo apt install golang`.
ta: நீங்கள் உபுண்டு அல்லது டெபியனை இயக்குகிறீர்கள் என்றால், `sudo apt install golang` ஐ இயக்குவதன் மூலம் GO ஐ நிறுவலாம்.

source: If you are running Ubuntu or Debian, you can install git by executing `sudo apt install git`.
ta: நீங்கள் உபுண்டு அல்லது டெபியனை இயக்குகிறீர்கள் என்றால், `sudo apt install git` ஐ இயக்குவதன் மூலம் git ஐ நிறுவலாம்.

source: If you are using Fedora, Red Hat or Amazon Linux with `sudo yum install git` or `sudo dnf install git`.
ta: நீங்கள் ஃபெடோரா, சிவப்பு Hat அல்லது அமேசான் லினக்ச் `sudo yum install git` அல்லது` sudo dnf நிறுவல் கிட்` உடன் பயன்படுத்துகிறீர்கள் என்றால்.

source: If you are using Fedora, Red Hat or Amazon Linux with `sudo yum install golang` or `sudo dnf install golang`.
ta: நீங்கள் ஃபெடோரா, சிவப்பு Hat அல்லது அமேசான் லினக்ச் `sudo yum install golang` அல்லது` sudo dnf நிறுவல் கோலாங்` உடன் பயன்படுத்துகிறீர்கள் என்றால்.

source: If you want to save the proxy output to a logfile, for example, to see your proxy usage, you can use:
ta: பதிலாள் வெளியீட்டை ஒரு பதிவுக்கு சேமிக்க விரும்பினால், எடுத்துக்காட்டாக, உங்கள் பதிலாள் பயன்பாட்டைக் காண, நீங்கள் பயன்படுத்தலாம்:

source: It's recommended to create a separate `snowflake` account with restricted rights on the system.
ta: கணினியில் தடைசெய்யப்பட்ட உரிமைகளுடன் ஒரு தனி `ச்னோஃப்ளேக்` கணக்கை உருவாக்க பரிந்துரைக்கப்படுகிறது.

source: Note: On some Linux installations this might not work.
ta: குறிப்பு: சில லினக்ச் நிறுவல்களில் இது வேலை செய்யாது.
