Repository: 247i/TACETr
Catalog: உரை/வெறுமை/tor-community-portal-*.po
Languages: ta

source: * Level up your service privacy
ta: * உங்கள் பணி தனியுரிமையை சமன் செய்யுங்கள்

source: * Metadata obfuscation or elimination
ta: * மேனிலை தரவு ஒத்துழைப்பு அல்லது நீக்குதல்

source: * Network sustainability
ta: * பிணைய நிலைத்தன்மை

source: * Protect sources, whistleblowers, and journalists
ta: * ஆதாரங்கள், விசில்ப்ளோயர்கள் மற்றும் பத்திரிகையாளர்களைப் பாதுகாக்கவும்

source: A client that wants to access the Onion Service does the same.
ta: வெங்காய சேவையை அணுக விரும்பும் ஒரு கிளையன்ட் அவ்வாறே செய்கிறது.

source: A great example of this use case is the chat program [Ricochet Refresh](https://ricochetrefresh.net/).
ta: இந்த பயன்பாட்டு வழக்கின் சிறந்த எடுத்துக்காட்டு அரட்டை நிரல் [ரிகோசெட் புதுப்பிப்பு] (https://ricochetrefresh.net/).

source: A potential adopter has probably already heard about the Tor Project, the network and even Tor relays, and that's great!
ta: ஒரு சாத்தியமான தத்தெடுப்பாளர் ஏற்கனவே டோர் திட்டம், பிணையம் மற்றும் டோர் ரிலேக்களைப் பற்றி கேள்விப்பட்டிருக்கலாம், அது மிகவும் நல்லது!

source: All the recipients of this communication need to have Tor Browser installed on their computer to open the onion address.
ta: இந்த தகவல்தொடர்பு பெறுபவர்களும் வெங்காய முகவரியைத் திறக்க தங்கள் கணினியில் டோர் உலாவி நிறுவப்பட வேண்டும்.

source: An Onion Service on the Tor network behaves like any other Tor clients.
ta: டோர் நெட்வொர்க்கில் ஒரு வெங்காய பணி மற்ற டோர் வாடிக்கையாளர்களைப் போலவே செயல்படுகிறது.

source: And because of that, there isn't a central server that can be compromised by an attacker.
ta: இதன் காரணமாக, தாக்குபவரால் வேறுபாடின்மை செய்யக்கூடிய ஒரு மைய சேவையகம் இல்லை.

source: As Edward Snowden points out in his book, **"Permanent Record"** (2019),
ta: எட்வர்ட் ச்னோவ்டென் தனது புத்தகத்தில் சுட்டிக்காட்டியுள்ளபடி, ** "நிரந்தர பதிவு" ** (2019),

source: As a result of this design, Onion Services and its users are immune to attacks related to [bad exit relays](https://blog.torproject.org/bad-exit-relays-may-june-2020).
ta: இந்த வடிவமைப்பின் விளைவாக, வெங்காய சேவைகளும் அதன் பயனர்களும் [மோசமான வெளியேறும் ரிலேக்கள்] (https://blog.torproject.org/bad-exit-relays-may-june-2020) தொடர்பான தாக்குதல்களில் இருந்து விடுபடுகிறார்கள்.

source: As explained in [Overview](../overview/), there's no central authority that approves or rejects Onion Services.
ta: [கண்ணோட்டம்] (../ கண்ணோட்டம்/) இல் விளக்கப்பட்டுள்ளபடி, வெங்காய சேவைகளை அங்கீகரிக்கும் அல்லது நிராகரிக்கும் மைய அதிகாரம் இல்லை.

source: As they're a small fraction of the network, in general, exit relays are overloaded and represent a bottleneck for Tor users' browsing experience.
ta: அவை நெட்வொர்க்கின் ஒரு சிறிய பகுதியாக இருப்பதால், பொதுவாக, வெளியேறும் ரிலேக்கள் அதிக சுமை கொண்டவை மற்றும் டோர் பயனர்களின் உலாவல் அனுபவத்திற்கு ஒரு தடையை குறிக்கின்றன.

source: Beyond myths and misperceptions, advocating for Onion Services and privacy enhancing technologies sometimes is challenging.
ta: கட்டுக்கதைகள் மற்றும் தவறான புரிதல்களுக்கு அப்பால், வெங்காய சேவைகளுக்காக வாதிடுவது மற்றும் தனியுரிமையை மேம்படுத்துதல் தொழில்நுட்பங்கள் சில நேரங்களில் சவாலானது.

source: Beyond websites and onion sites, it's possible to do many things with Onion Services, for example, email.
ta: வலைத்தளங்கள் மற்றும் வெங்காய தளங்களுக்கு அப்பால், வெங்காய சேவைகளுடன் பல விசயங்களைச் செய்ய முடியும், எடுத்துக்காட்டாக, மின்னஞ்சல்.

source: Censorship technologies are being deployed by different actors, like governments and Internet providers, worldwide to block access to free press and privacy tools.
ta: இலவச செய்தித் தாள் மற்றும் தனியுரிமை கருவிகளுக்கான அணுகலைத் தடுக்க உலகளவில் அரசாங்கங்கள் மற்றும் இணைய வழங்குநர்கள் போன்ற பல்வேறு நடிகர்களால் தணிக்கை தொழில்நுட்பங்கள் பயன்படுத்தப்படுகின்றன.

source: E-mail providers like [Riseup](https://riseup.net/en/security/network-security/tor#riseups-tor-onion-services), [Systemli](https://www.systemli.org/service/onion.html) and [many others](https://github.com/ehloonion/onionmx/blob/master/sources/map.yml) protect their users privacy using onionmx.
ta: [ரைச்அப்] (https://riseup.net/en/security/network-security/tor#riseups-tor-onion-services), [systemli] (https://www.systemli.org/service/nion.html) மற்றும் [பல மற்றவர்கள்] (https://github.com/ehloonion/onionmx/blob/master/sources/map.yml) வெங்காயத்தைப் பயன்படுத்தி தங்கள் பயனர்களின் தனியுரிமையைப் பாதுகாக்கவும்.

source: Even though privacy aware users can adopt tools to protect their communications like OpenPGP, there is plenty of metadata on encrypted emails: for example who is communicating with whom, when, how frequently, where, when it was sent and received, what type of computer it was generated, etc.
ta: தனியுரிமை விழிப்புணர்வு பயனர்கள் OpenPGP போன்ற தகவல்தொடர்புகளைப் பாதுகாக்க கருவிகளை ஏற்றுக்கொள்ள முடியும் என்றாலும், மறைகுறியாக்கப்பட்ட மின்னஞ்சல்களில் ஏராளமான மேனிலை தரவு உள்ளது: எடுத்துக்காட்டாக, யாருடன் தொடர்பு கொள்கிறார், எப்போது, எவ்வளவு அடிக்கடி, எங்கு, அது அனுப்பப்பட்டு பெறப்பட்டது, எந்த வகையான கணினி இது உருவாக்கப்பட்டது, முதலியன.

source: For a broader understanding, read [Onion Services overview](../overview/) and watch this talk: [DEF CON 25 - Next Generation Tor Onion Services](https://www.youtube.com/watch?v=Di7qAVidy1Y).
ta: ஒரு பரந்த புரிதலுக்கு, [வெங்காய சேவைகள் கண்ணோட்டம்] (../ கண்ணோட்டம்/) ஐப் படித்து இந்த பேச்சைப் பாருங்கள்: [டெஃப் கான் 25 - அடுத்த தலைமுறை டோர் வெங்காய சேவைகள்] (https://www.youtube.com/watch?v=di7qavidy1y).

source: Get inspired by our campaign [#MoreOnionsPorFavor](https://blog.torproject.org/more-onions-porfavor) and teach others about the importance of anonymity.
ta: எங்கள் பிரச்சாரத்தால் ஈர்க்கப்பட்டு [#moreonsporfavor] (https://blog.torproject.org/more-onions-porfavor) மற்றும் அநாமதேயத்தின் முக்கியத்துவத்தைப் பற்றி மற்றவர்களுக்கு கற்பிக்கவும்.

source: I developed OnionShare to make this file sharing process over the Tor network more accessible to everyone." [OnionShare 2 release](https://blog.torproject.org/new-release-onionshare-2)
ta: TOR நெட்வொர்க்கில் இந்த கோப்பு பகிர்வு செயல்முறையை அனைவருக்கும் அணுகக்கூடியதாக மாற்ற நான் வெங்காயத்தை உருவாக்கினேன். "

source: I knew that he could have securely sent the documents over the internet using a Tor Onion Service, one of the most underappreciated technologies on the internet, and avoided the risk of physically traveling with them.
ta: ஒரு டோர் வெங்காய சேவையைப் பயன்படுத்தி அவர் இணையத்தில் ஆவணங்களை பாதுகாப்பாக அனுப்பியிருக்க முடியும் என்பதை நான் அறிவேன், இது இணையத்தில் மிகவும் குறைவான தொழில்நுட்பங்களில் ஒன்றாகும், மேலும் அவர்களுடன் உடல் ரீதியாக பயணிக்கும் அபாயத்தைத் தவிர்த்தது.

source: In Ricochet Refresh, each user is an Onion Service.
ta: ரிகோசெட் புதுப்பித்தலில், ஒவ்வொரு பயனரும் வெங்காய சேவையாகும்.

source: In contrast to running a [Tor relay](../../relay), running a Tor Onion Service does not result in your IP address being publicly listed anywhere, nor does your service relay other Tor traffic.
ta: ஒரு [டோர் ரிலே] (../../ ரிலே) ஐ இயக்குவதற்கு மாறாக, ஒரு டோர் வெங்காய சேவையை இயக்குவது உங்கள் ஐபி முகவரி பகிரங்கமாக எங்கும் பட்டியலிடப்படாது, அல்லது உங்கள் பணி மற்ற டோர் போக்குவரத்தை ரிலே செய்யாது.

source: It is a web application running as an Onion Service that whistleblowers and journalists can anonymously exchange information and files.
ta: இது ஒரு வெங்காய சேவையாக இயங்கும் ஒரு வலை பயன்பாடாகும், இது விசில்ப்ளோயர்கள் மற்றும் பத்திரிகையாளர்கள் தகவல்களையும் கோப்புகளையும் அநாமதேயமாக பரிமாறிக்கொள்ள முடியும்.

source: It makes it possible to host files on your own computer and share (send and receive) using Onion Services.
ta: இது உங்கள் சொந்த கணினியில் கோப்புகளை புரவலன் செய்து வெங்காய சேவைகளைப் பயன்படுத்தி பகிரவும் (அனுப்பவும் பெறவும்) சாத்தியமாக்குகிறது.

source: Making your service available over Onion Services is an opportunity to educate the general public about Tor and how a more secure way to access the internet looks like: easy as browsing a web page.
ta: வெங்காய சேவைகளில் உங்கள் சேவையை கிடைக்கச் செய்வது, டோர் பற்றி பொது மக்களுக்கு கல்வி கற்பிப்பதற்கான ஒரு வாய்ப்பாகும், மேலும் இணையத்தை அணுகுவதற்கான மிகவும் பாதுகாப்பான வழி எப்படி இருக்கும்: ஒரு வலைப்பக்கத்தை உலாவுவது எளிதானது.

source: Many journalists and media organizations use tools based on Onion Services to protect their sources.
ta: பல பத்திரிகையாளர்கள் மற்றும் ஊடக நிறுவனங்கள் வெங்காய சேவைகளின் அடிப்படையில் கருவிகளைப் பயன்படுத்துகின்றன.

source: Now that you know all the benefits of Onion Services, you may want to set up an [onion site](../setup/) and read about the [protocol overview](../overview/).
ta: வெங்காய சேவைகளின் அனைத்து நன்மைகளையும் இப்போது நீங்கள் அறிந்திருக்கிறீர்கள், நீங்கள் ஒரு [வெங்காய தளத்தை] (../ அமைவு/) அமைத்து [நெறிமுறை கண்ணோட்டம்] (../ கண்ணோட்டம்/) பற்றி படிக்க விரும்பலாம்.

source: Onion services are an excellent example of privacy by design technology, where one is secure and anonymous by default.
ta: வடிவமைப்பு தொழில்நுட்பத்தின் மூலம் தனியுரிமைக்கு வெங்காய சேவைகள் ஒரு சிறந்த எடுத்துக்காட்டு, அங்கு ஒன்று பாதுகாப்பானது மற்றும் இயல்பாக அநாமதேயமானது.

source: Onion services aren't like a Tor relay in the network.
ta: வெங்காய சேவைகள் நெட்வொர்க்கில் ஒரு டோர் ரிலே போன்றவை அல்ல.

source: Onion services don't use the same circuit path as regular Tor connections.
ta: வெங்காய சேவைகள் வழக்கமான TOR இணைப்புகளின் அதே சுற்று பாதையைப் பயன்படுத்தாது.

source: OnionShare was developed after a human rights violation during the Snowden revelations in 2013,
ta: 2013 ஆம் ஆண்டில் ச்னோவ்டென் வெளிப்பாடுகளின் போது மனித உரிமை மீறலுக்குப் பிறகு வெங்காயம் உருவாக்கப்பட்டது,

source: Operators don't use the regular DNS infrastructure and do not need to purchase or register a domain name.
ta: ஆபரேட்டர்கள் வழக்கமான டிஎன்எச் உள்கட்டமைப்பைப் பயன்படுத்துவதில்லை, மேலும் ஒரு டொமைன் பெயரை வாங்கவோ பதிவு செய்யவோ தேவையில்லை.

source: Originally developed by Aaron Swartz, [SecureDrop](https://securedrop.org/) is an open source whistleblower submission system maintained by [Freedom of the Press Foundation](https://freedom.press) and deployed by many news organizations around the world.
ta: முதலில் ஆரோன் ச்வார்ட்சால் உருவாக்கப்பட்டது, [செக்யூர்டு ராப்] (https://securedrop.org/) என்பது ஒரு திறந்த மூல விசில்ப்ளோவர் சமர்ப்பிக்கும் முறையாகும் [பத்திரிகை அறக்கட்டளையின் சுதந்திரம்] (https://freedom.press) மற்றும் உலகெங்கிலும் உள்ள பல செய்தி அமைப்புகளால் பயன்படுத்தப்படுகிறது.

source: Other providers like [Proton](https://proton.me/news/protonmail-tor-censorship) allow users to read and send their e-mail securely and anonymously over their webclient that serves an onion site.
ta: [புரோட்டான்] (https://proton.me/news/protonmail-tor-censorship) போன்ற பிற வழங்குநர்கள், வெங்காய தளத்திற்கு பணி செய்யும் வெப்க்ளியன்ட் மீது பயனர்கள் தங்கள் மின்னஞ்சலைப் படித்து பாதுகாப்பாகவும் அநாமதேயமாகவும் படிக்கவும் அனுப்பவும் அனுமதிக்கின்றனர்.

source: Read the news organizations announcement about their onion site:
ta: அவர்களின் வெங்காய தளத்தைப் பற்றிய செய்தி நிறுவனங்களின் அறிவிப்பைப் படியுங்கள்:

source: Regular Tor connections already provide censorship circumvention, but only Onion Services can anonymize both parts of communication - users and provider -, creating a metadata free communication between the user of the service and the service itself.
ta: வழக்கமான டோர் இணைப்புகள் ஏற்கனவே தணிக்கை சுற்றறிக்கையை வழங்குகின்றன, ஆனால் வெங்காய சேவைகள் மட்டுமே தகவல்தொடர்பு பயனர்கள் மற்றும் வழங்குநர் ஆகிய இரு பகுதிகளையும் அநாமதேயமாக்க முடியும், இது சேவையின் பயனருக்கும் சேவைக்கும் இடையில் ஒரு மேனிலை தரவு இலவச தகவல்தொடர்புகளை உருவாக்குகிறது.

source: Ricochet uses Onion Services to build secure communication with these features: metadata resistant, anonymous, and decentralized.
ta: இந்த அம்சங்களுடன் பாதுகாப்பான தகவல்தொடர்புகளை உருவாக்க ரிக்கோசெட் வெங்காய சேவைகளைப் பயன்படுத்துகிறது: மேனிலை தரவு எதிர்ப்பு, அநாமதேய மற்றும் பரவலாக்கப்பட்டது.

source: Started in 2011 by a group of Italians, the project is now developed by the [Hermes Center for Transparency and Digital Human Rights](https://www.hermescenter.org/).
ta: 2011 ஆம் ஆண்டில் இத்தாலியர்களின் ஒரு குழுவால் தொடங்கப்பட்டது, இந்த திட்டத்தை இப்போது [எர்ம்ச் சென்டர் ஃபார் டிரான்ச்பரன்சி மற்றும் டிசிட்டல் மனித உரிமைகள்] (https://www.hermester.org/) உருவாக்கியுள்ளது.

source: That's the case of ProPublica, Deutsche Welle, BBC, The Markup and other newsrooms.
ta: புரோபப்ளிகா, டாய்ச் வெல்லே, பிபிசி, மார்க்அப் மற்றும் பிற செய்தி அறைகள் இதுதான்.

source: The Onion Service to become available on the network connects to rendezvous nodes.
ta: நெட்வொர்க்கில் கிடைக்கக்கூடிய வெங்காய பணி ரெண்டெச்வச் முனைகளுடன் இணைகிறது.

source: The Onion Services use the Tor network to eliminate information about where they are situated.
ta: வெங்காய சேவைகள் TOR நெட்வொர்க்கைப் பயன்படுத்தி அவை எங்கு அமைந்துள்ளன என்பது பற்றிய தகவல்களை அகற்ற பயன்படுத்துகின்றன.

source: The address of an Onion Service is automatically generated.
ta: வெங்காய சேவையின் முகவரி தானாகவே உருவாக்கப்படுகிறது.

source: The project [Secure The News](https://securethe.news/), developed by [Freedom of the Press Foundation](https://freedom.press/news/onions-side-tracking-tor-availability-reader-privacy-major-news-sites/), tracks how secure news organizations’s websites are. One of its metrics is the adoption of Onion Services .
ta: [பத்திரிகை அறக்கட்டளையின் சுதந்திரம்] (https://freedom.press/news/nions-side-dracking-tor-availability-availability-availabition-priveary-priveasy-news-sites/sites/spets ஐ எவ்வாறு கண்காணிக்கிறது. அதன் அளவீடுகளில் ஒன்று வெங்காய சேவைகளை ஏற்றுக்கொள்வதாகும்.

source: The traffic generated by Onion Services doesn't leave the Tor network, and therefore, these onion circuits free up exit relay bandwidth for others.
ta: வெங்காய சேவைகளால் உருவாக்கப்படும் போக்குவரத்து TOR நெட்வொர்க்கை விட்டு வெளியேறாது, எனவே, இந்த வெங்காய சுற்றுகள் மற்றவர்களுக்கு வெளியேறும் ரிலே அலைவரிசையை விடுவிக்கின்றன.

source: There are different use cases, and approaching potential adopters with a specific use case instead of another, can engage them and lead to new onions services being setup.
ta: வெவ்வேறு பயன்பாட்டு வழக்குகள் உள்ளன, மேலும் மற்றொன்றுக்கு பதிலாக ஒரு குறிப்பிட்ட பயன்பாட்டு வழக்கைக் கொண்டு தத்தெடுப்பவர்களை அணுகுவது, அவற்றில் ஈடுபடலாம் மற்றும் புதிய வெங்காய சேவைகள் அமைக்க வழிவகுக்கும்.

source: These talking points will help to explain how Onion Services offer multiple privacy and security benefits in different contexts.
ta: இந்த பேசும் புள்ளிகள் வெங்காய சேவைகள் வெவ்வேறு சூழல்களில் பல தனியுரிமை மற்றும் பாதுகாப்பு சலுகைகளை எவ்வாறு வழங்குகின்றன என்பதை விளக்க உதவும்.

source: They share and accept documents from anonymous sources using tools like SecureDrop, GlobaLeaks or OnionShare.
ta: செக்யூர்ட் ராப், உலகளாவிய ஏயர்கள் அல்லது வெங்காயர் போன்ற கருவிகளைப் பயன்படுத்தி அநாமதேய மூலங்களிலிருந்து ஆவணங்களை அவர்கள் பகிர்ந்து கொள்கிறார்கள்.

source: This is important because exit relays are a limited resource, making up 20% of the [7000 relays](https://metrics.torproject.org/networksize.html).
ta: இது முக்கியமானது, ஏனெனில் வெளியேறும் ரிலேக்கள் ஒரு வரையறுக்கப்பட்ட வளமாகும், இது [7000 ரிலேக்கள்] (https://metrics.torproject.org/networksize.html) இல் 20% ஆகும்.

source: This means that connections from the client to the server never leave the Tor network.
ta: இதன் பொருள் கிளையண்டிலிருந்து சேவையகத்திற்கான இணைப்புகள் ஒருபோதும் TOR நெட்வொர்க்கை விட்டு வெளியேறாது.

source: Thus, a journalist won't know who the author is and can't put the source at risk.
ta: எனவே, ஒரு பத்திரிகையாளருக்கு ஆசிரியர் யார் என்று தெரியாது, மேலும் மூலத்தை ஆபத்தில் வைக்க முடியாது.

source: To protect freedom of speech and freedom of opinion in censored spaces, major media organizations have made their websites available over Onion Services in the last few years.
ta: தணிக்கை செய்யப்பட்ட இடங்களில் பேச்சு விடுதலை மற்றும் கருத்து சுதந்திரத்தைப் பாதுகாக்க, முக்கிய ஊடக நிறுவனங்கள் கடந்த சில ஆண்டுகளில் வெங்காய சேவைகளில் தங்கள் வலைத்தளங்களை கிடைக்கச் செய்துள்ளன.

source: Using them eliminates all metadata that may be associated with the service otherwise.
ta: அவற்றைப் பயன்படுத்துவது சேவையுடன் தொடர்புடைய அனைத்து மெட்டாடேட்டாவையும் நீக்குகிறது.

source: When a service is available over Onion Services, it adds diversity to the Tor network since it uses a different set of circuits on the network, avoiding exit relays completely.
ta: வெங்காய சேவைகளில் ஒரு பணி கிடைக்கும்போது, இது டோர் நெட்வொர்க்கில் பன்முகத்தன்மையைச் சேர்க்கிறது, ஏனெனில் இது நெட்வொர்க்கில் வேறுபட்ட சுற்றுகளைப் பயன்படுத்துகிறது, வெளியேறும் ரிலேக்களை முழுவதுமாகத் தவிர்க்கிறது.

source: When you use the Tor network to browse the web you are not sending any information by default of who you are or where you are connecting from.
ta: வலையை உலவ TOR நெட்வொர்க்கைப் பயன்படுத்தும்போது, நீங்கள் யார் அல்லது நீங்கள் எங்கிருந்து இணைக்கிறீர்கள் என்பதற்கான இயல்புநிலையாக எந்த தகவலையும் அனுப்பவில்லை.

source: With SecureDrop, sources can only submit documents in a secure and anonymous way, using Tor Browser.
ta: செக்யூர்டு ராப் மூலம், ஆதாரங்கள் டோர் உலாவியைப் பயன்படுத்தி ஆவணங்களை பாதுகாப்பான மற்றும் அநாமதேய வழியில் மட்டுமே சமர்ப்பிக்க முடியும்.

source: Working on a journalism assignment for the Guardian, Miranda was carrying a USB stick with sensitive documents.
ta: கார்டியனுக்கான ஒரு செய்தித் தாள் ஒதுக்கீட்டில் பணிபுரிந்த மிராண்டா, ஒரு யூ.எச்.பி குச்சியை முக்கியமான ஆவணங்களுடன் சுமந்து கொண்டிருந்தார்.

source: [GlobaLeaks](https://globaleaks.org) is an open source whistleblowing framework focused on portability and accessibility.
ta: [GlobaLeaks](https://globaleaks.org) is an திற மூலம் whistleblowing framework focused on portability and accessibility.

source: [OnionShare](https://onionshare.org) is another tool based on Onion Services used to provide strong anonymity to transmit sensitive files between journalists safely.
ta: [OnionShare](https://onionshare.org) is another கருவி based on Onion சேவைகள் used பெறுநர் provide strong anonymity பெறுநர் transmit sensitive கோப்புகள் between journalists safely.

source: [Onionmx](https://github.com/ehloonion/onionmx) is a software that allows the delivery of emails entirely over Onion Services, obfuscating the metadata of who is talking with whom.
ta: [Onionmx](https://github.com/ehloonion/onionmx) is a software that allows the வழங்கு of emails entirely வீச்சலகு Onion Services, obfuscating the metadata of who is talking with whom.

source: [Tor relays](../../relay/types-of-relays/) are part of a [public infrastructure](https://metrics.torproject.org/rs.html#toprelays), where Tor users encrypted traffic is routed around to reach out the open internet.
ta: [Tor relays](../../relay/types-of-relays/) அரே பகுதி of a [public infrastructure](https://metrics.torproject.org/rs.html#toprelays), where Tor பயனர்கள் encrypted traffic is routed around பெறுநர் reach out the திற internet.

source: Become an onion advocate and explain the importance of Onion Services.
ta: வெங்காய வக்கீலாகி வெங்காய சேவைகளின் முக்கியத்துவத்தை விளக்குங்கள்.

source: Talk about onions
ta: வெங்காயம் பற்றி பேசுங்கள்

source: ##Tell the world about Tor
ta: ## டோர் பற்றி உலகுக்குச் சொல்லுங்கள்

source: We love it when people bring information about Tor to their community events, conferences, and meetups.
ta: மக்கள் தங்கள் சமூக நிகழ்வுகள், மாநாடுகள் மற்றும் சந்திப்புகளுக்கு டோர் பற்றிய தகவல்களைக் கொண்டு வரும்போது நாங்கள் அதை விரும்புகிறோம்.

source: We've curated some beautiful materials for sharing in-person and on social media we welcome you to use.
ta: நபரைப் பகிர்வதற்கு சில அழகான பொருட்களை நாங்கள் நிர்வகித்துள்ளோம், சமூக ஊடகங்களில் நாங்கள் உங்களைப் பயன்படுத்த வரவேற்கிறோம்.

source: Tell the world about Tor
ta: டோர் பற்றி உலகுக்குச் சொல்லுங்கள்

source: Bring Tor materials to your next community event.
ta: உங்கள் அடுத்த சமூக நிகழ்வுக்கு டோர் பொருட்களைக் கொண்டு வாருங்கள்.

source: Outreach
ta: வெளிச்சம்

source: ## Street Team Kit
ta: ## ச்ட்ரீட் குழு அறிவிலி

source: All material on this session may be freely distributed at will under the [Creative Commons 4.0 Attribution International License](https://creativecommons.org/licenses/by/4.0/), unless otherwise noted.
ta: இந்த அமர்வில் உள்ள அனைத்து பொருட்களும் [கிரியேட்டிவ் காமன்ச் 4.0 பண்புக்கூறு பன்னாட்டு உரிமம்] (https://creativecommons.org/licenses/by/4.0/) இன் கீழ் இலவசமாக விநியோகிக்கப்படலாம்.

source: This kit includes printable flyers, stickers, and other materials to get people excited about using Tor.
ta: இந்த கிட்டில் அச்சிடக்கூடிய ஃப்ளையர்கள், ச்டிக்கர்கள் மற்றும் பிற பொருட்கள் உள்ளன.

source: Street team kit
ta: ச்ட்ரீட் குழு அறிவிலி

source: ### Step 1
ta: ### படி 1

source: ### Step 2
ta: ### படி 2

source: ### Step 3
ta: ### படி 3

source: ### Step 4
ta: ### படி 4

source: ### Step 5
ta: ### படி 5

source: ### Step 6
ta: ### படி 6

source: A public library, a social center, a hackerspace or a room in a university are some spaces that you can usually host your event.
ta: ஒரு பொது நூலகம், ஒரு சமூக நடுவண், ஒரு ஏக்கர்ச்பேச் அல்லது ஒரு பல்கலைக்கழகத்தில் ஒரு அறை ஆகியவை உங்கள் நிகழ்வை நீங்கள் வழக்கமாக நடத்தக்கூடிய சில இடங்கள்.

source: After confirming a local and date, create a poster and an online invitation to spread the event.
ta: உள்ளக மற்றும் தேதியை உறுதிப்படுத்திய பிறகு, நிகழ்வைப் பரப்ப ஒரு சுவரொட்டி மற்றும் நிகழ்நிலை அழைப்பை உருவாக்கவும்.

source: After the meetup, clean up the space, remove the posters and send your notes to the [Tor Community Team](https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-community-team) mailing list.
ta: சந்திப்புக்குப் பிறகு, இடத்தை தூய்மை செய்து, சுவரொட்டிகளை அகற்றி, உங்கள் குறிப்புகளை [டோர் சமூக குழு] (https://lists.torproject.org/cgi-bin/mailman/listinfo/tor-community-team) அஞ்சல் பட்டியல் அனுப்பவும்.

source: Before the meetup, organize the space. Buy some chips and snacks, hang some [posters](../kit/) nearby the local, so people can find easily.
ta: சந்திப்புக்கு முன், இடத்தை ஒழுங்கமைக்கவும். சில சில்லுகள் மற்றும் தின்பண்டங்களை வாங்கவும், உள்ளக அருகிலுள்ள சில [சுவரொட்டிகளை] (../ கிட்/) தொங்கவிடவும், எனவே மக்கள் எளிதாகக் காணலாம்.

source: Choose a date and time that is convenient for your group and the local space.
ta: உங்கள் குழு மற்றும் உள்ளக இடத்திற்கு வசதியான தேதி மற்றும் நேரத்தைத் தேர்வுசெய்க.

source: Connect with a local space that will allow you to meet for an hour or two.
ta: ஒரு மணி நேரம் அல்லது இரண்டு மணி நேரம் சந்திக்க உங்களை அனுமதிக்கும் உள்ளக இடத்துடன் இணைக்கவும்.

source: During the activity take notes about questions, how many knew about Tor before, how many are relay operators, etc.
ta: செயல்பாட்டின் போது கேள்விகளைப் பற்றிய குறிப்புகளை எடுத்துக் கொள்ளுங்கள், இதற்கு முன் எத்தனை பேர் அறிந்திருந்தார்கள், எத்தனை ரிலே ஆபரேட்டர்கள் போன்றவை.

source: Find a meetup facilitator and draft an agenda, for example, question & answer about Tor, how to setup relays.
ta: ஒரு சந்திப்பு வசதியாளரைக் கண்டுபிடித்து ஒரு நிகழ்ச்சி நிரலை உருவாக்குங்கள், எடுத்துக்காட்டாக, டோர் பற்றிய கேள்வி மற்றும் பதில், ரிலேக்களை எவ்வாறு அமைப்பது.

source: If you have some printed materials and/or Tor swag, put it on a table.
ta: உங்களிடம் சில அச்சிடப்பட்ட பொருட்கள் மற்றும்/அல்லது டோர் ஈட்டம் இருந்தால், அதை ஒரு அட்டவணையில் வைக்கவும்.

source: Load your presentation and wait a few minutes to people arrive.
ta: உங்கள் விளக்கக்காட்சியை ஏற்றி, மக்கள் வருவதற்கு சில நிமிடங்கள் காத்திருங்கள்.

source: On weekends or during week days, after working hours (7 pm) might be better.
ta: வார இறுதி நாட்களில் அல்லது வார நாட்களில், வேலை நேரத்திற்குப் பிறகு (இரவு 7 மணி) சிறப்பாக இருக்கலாம்.

source: Organized by the community, meetups are a great way to find and strengthen the privacy supporters community in your local area.
ta: சமூகத்தால் ஒழுங்கமைக்கப்பட்ட, உங்கள் உள்ளக பகுதியில் உள்ள தனியுரிமை ஆதரவாளர்களின் சமூகத்தைக் கண்டுபிடித்து பலப்படுத்த ஒரு சிறந்த வழியாகும்.

source: Read and follow our [best practices](../../training/best-practices/).
ta: எங்கள் [சிறந்த நடைமுறைகளைப் படித்து பின்பற்றவும் (../../ பயிற்சி/சிறந்த நடைமுறைகள்/).

source: Learn how to organize a Tor meetup with your friends.
ta: உங்கள் நண்பர்களுடன் ஒரு டோர் சந்திப்பை எவ்வாறு ஒழுங்கமைப்பது என்பதை அறிக.

source: Organize a Tor meetup
ta: ஒரு டோர் சந்திப்பை ஒழுங்கமைக்கவும்
