Repository: 247i/TACETr
Catalog: உரை/வெறுமை/trifa-a-tox-client-for-android-trifa-desktop-*.po
Languages: ta

# locale_test
source: EN
ta: என்

# exit_app_title
source: Exit
ta: வெளியேறு

# exit_app_msg
source: Do you want to Exit the App ?
ta: பயன்பாட்டிலிருந்து வெளியேற விரும்புகிறீர்களா?

# about_title
source: About
ta: பற்றி

# settings_title
source: Settings
ta: அமைப்புகள்

# settings_category_001
source: Tox
ta: நச்சு

# settings_category_002
source: General
ta: பொது

# settings_name
source: Name
ta: பெயர்

# settings_show_image_thumbnails_title
source: Show Image Thumbnails
ta: பட சிறுபடங்களைக் காட்டு

# settings_show_image_thumbnails_desc
source: Loading of Chathistory will be slower when this is actived
ta: இது செயல்படுத்தப்படும்போது அரட்டை வரலாற்றை ஏற்றுவது மெதுவாக இருக்கும்

# settings_high_quality_audio
source: Set high audio quality for calls
ta: அழைப்புகளுக்கு உயர் ஆடியோ தரத்தை அமைக்கவும்

# settings_faster_filetransfers
source: Faster Filetransfers (!!may cause problems!!)
ta: வேகமான ஃபைல்ட்ரான்ச்ஃபர்ச் (!! சிக்கல்களை ஏற்படுத்தக்கூடும் !!)

# settings_conference_show_system_messages
source: Show system messages in conferences and groups
ta: மாநாடுகள் மற்றும் குழுக்களில் கணினி செய்திகளைக் காட்டு

# settings_udp_enabled_title
source: Enable UDP mode (needs restart)
ta: யுடிபி பயன்முறையை இயக்கவும் (மறுதொடக்கம் தேவை)

# settings_ipv6_enabled_title
source: Enable IPv6 (needs restart)
ta: IPv6 ஐ இயக்கவும் (மறுதொடக்கம் தேவை)

# settings_local_discovery_title
source: Enable local LAN discovery (needs restart)
ta: உள்ளக லேன் கண்டுபிடிப்பை இயக்கவும் (மறுதொடக்கம் தேவை)

# settings_orbot_enabled_to_int_title
source: Use Tor on port 9050 (tor must be running on 127.0.0.1) (needs restart)
ta: துறைமுகம் 9050 இல் டாரைப் பயன்படுத்தவும் (டோர் 127.0.0.1 இல் இயங்க வேண்டும்) (மறுதொடக்கம் தேவை)

# copied_msg_to_clipboard
source: copied Message text to clipboard
ta: இடைநிலைப்பலகைக்கு செய்தி உரையை நகலெடுத்தது

source: Delete Friend
ta: நண்பரை நீக்கு

source: Delete Conference
ta: மாநாட்டை நீக்கு

source: Delete Group
ta: குழுவை நீக்கு

# info_friend
source: Friend Info
ta: நண்பர் செய்தி

# set_alias_name_friend
source: Set Alias Name
ta: மாற்றுப்பெயர் பெயரை அமைக்கவும்

source: Opening File ...
ta: கோப்பு திறக்கும் ...

source: Show File in Explorer ...
ta: எக்ச்ப்ளோரரில் கோப்பைக் காட்டு ...

# send_button_text
source: send
ta: அனுப்பு

# add_friend_button_text
source: add Friend
ta: நண்பரைச் சேர்க்கவும்

# friend_as_relay
source: add Friend as Relay
ta: நண்பரை ரிலேவாக சேர்க்கவும்

# add_as_relay_msg
source: add Friend as Relay?
ta: நண்பரை ரிலே சேர்க்கவா?

# add_as_relay_title
source: add Relay
ta: ரிலே சேர்க்கவும்

source: ToxID
ta: டாக்சைட்

# select_files_dialog_title
source: Select Files
ta: கோப்புகளைத் தேர்ந்தெடு

# menu_file
source: FILE
ta: கோப்பு

# menu_settings
source: Settings
ta: அமைப்புகள்

# menu_exit
source: Exit
ta: வெளியேறு

# menu_about
source: About
ta: பற்றி

# panel_new_alias_name
source: New Alias Name
ta: புதிய மாற்றுப்பெயர் பெயர்

# delete_friend_msg
source: really delete Friend and all messages?
ta: உண்மையில் நண்பரையும் எல்லா செய்திகளையும் நீக்கவா?

# delete_friend_title
source: delete Friend?
ta: நண்பரை நீக்கவா?

# delete_conference_msg
source: really delete Conference and all messages?
ta: மாநாட்டையும் அனைத்து செய்திகளையும் நீக்கவா?

# delete_conference_title
source: delete Conference?
ta: மாநாட்டை நீக்கவா?

# delete_group_msg
source: really delete Group and all messages?
ta: குழு மற்றும் அனைத்து செய்திகளையும் நீக்கவா?

# delete_group_title
source: delete Group?
ta: குழுவை நீக்கவா?
