Repository: 247i/TACETr
Catalog: உரை/வெறுமை/ubuntu-desktop-translations-app-center-*.po
Languages: ta

# appCenterLabel
source: App Center
ta: பயன்பாட்டு நடுவண்

# appstreamSearchGreylist
source: app;application;package;program;programme;suite;tool
ta: பயன்பாடு; பயன்பாடு; தொகுப்பு; நிரல்; நிரல்; தொகுப்பு; கருவி

# snapPageChannelLabel
source: Channel
ta: வாய்க்கால்

# snapPageConfinementLabel
source: Confinement
ta: சிறைவாசம்

# snapPageContactPublisherLabel
source: Contact {publisher}
ta: தொடர்பு {publisher}

# snapPageDescriptionLabel
source: Description
ta: விவரம்

# snapPageDeveloperWebsiteLabel
source: Developer website
ta: உருவாக்குபவர் வலைத்தளம்

# snapPageDownloadSizeLabel
source: Download size
ta: பதிவிறக்க அளவு

# snapPageSizeLabel
source: Size
ta: அளவு

# snapPageGalleryLabel
source: Gallery
ta: கேலரி

# snapPageLicenseLabel
source: License
ta: உரிமம்

# snapPageLinksLabel
source: Links
ta: இணைப்புகள்

# snapPagePublisherLabel
source: Publisher
ta: வெளியீட்டாளர்

# snapPagePublishedLabel
source: Published
ta: வெளியிடப்பட்டது

# snapPageSummaryLabel
source: Summary
ta: சுருக்கம்

# snapPageVersionLabel
source: Version
ta: பதிப்பு

# snapPageShareLinkCopiedMessage
source: Link copied to clipboard
ta: கிளிப்போர்டில் இணைப்பு நகலெடுக்கப்பட்டது

# explorePageLabel
source: Explore
ta: ஆராயுங்கள்

# explorePageCategoriesLabel
source: Categories
ta: வகைகள்

# managePageOwnUpdateAvailable
source: App Center update available
ta: பயன்பாட்டு மைய புதுப்பிப்பு கிடைக்கிறது

# managePageQuitToUpdate
source: Quit to update
ta: புதுப்பிக்க விட்டுவிடுங்கள்

# managePageOwnUpdateDescription
source: When you quit the application it will automatically update.
ta: நீங்கள் பயன்பாட்டை விட்டு வெளியேறும்போது அது தானாகவே புதுப்பிக்கப்படும்.

# managePageOwnUpdateQuitButton
source: Quit to update
ta: புதுப்பிக்க விட்டுவிடுங்கள்

# managePageCheckForUpdates
source: Check for updates
ta: புதுப்பிப்புகளை சரிபார்க்கவும்

# managePageCheckingForUpdates
source: Checking for updates
ta: புதுப்பிப்புகளைச் சரிபார்க்கிறது

# managePageNoInternet
source: Can't reach server, check your internet connection or try again later.
ta: சேவையகத்தை அடைய முடியாது, உங்கள் இணைய இணைப்பை சரிபார்க்கவும் அல்லது பின்னர் மீண்டும் முயற்சிக்கவும்.

# managePageDescription
source: Check for available updates, update your apps, and manage the status of all your apps.
ta: கிடைக்கக்கூடிய புதுப்பிப்புகளைச் சரிபார்க்கவும், உங்கள் பயன்பாடுகளைப் புதுப்பிக்கவும், உங்கள் எல்லா பயன்பாடுகளின் நிலையை நிர்வகிக்கவும்.

# managePageDebUpdatesMessage
source: Debian package updates are handled by the Software Updater.
ta: டெபியன் தொகுப்பு புதுப்பிப்புகள் மென்பொருள் புதுப்பிப்பாளரால் கையாளப்படுகின்றன.

# managePageInstalledAndUpdatedLabel
source: Installed and updated
ta: நிறுவப்பட்டு புதுப்பிக்கப்பட்டது

# managePageInstallingLabel
source: Installing ({n})
ta: நிறுவுதல் ({n})

# managePageLabel
source: Manage
ta: நிர்வகிக்கவும்

# managePageTitle
source: Manage installed snaps
ta: நிறுவப்பட்ட புகைப்படங்களை நிர்வகிக்கவும்

# managePageNoUpdatesAvailableDescription
source: No updates available. Your applications are all up to date.
ta: புதுப்பிப்புகள் எதுவும் கிடைக்கவில்லை. உங்கள் விண்ணப்பங்கள் அனைத்தும் புதுப்பித்தவை.

# managePageSearchFieldSearchHint
source: Search your installed apps
ta: உங்கள் நிறுவப்பட்ட பயன்பாடுகளைத் தேடுங்கள்

# managePageShowDetailsLabel
source: Show details
ta: விவரங்களைக் காட்டு

# managePageShowSystemSnapsLabel
source: Show system snaps
ta: கணினி புகைப்படங்களைக் காட்டு

# managePageUpdateAllLabel
source: Update all
ta: அனைத்தையும் புதுப்பிக்கவும்

# managePageUpdatedDaysAgo
source: Updated {n, plural, =1{{n} day} other{{n} days}} ago
ta: புதுப்பிக்கப்பட்டது {n, பன்மை, = 1 {{n} நாள்} பிற {{n} நாட்கள்}} முன்பு

# managePageUpdatedWeeksAgo
source: Updated {n, plural, =1{{n} week} other{{n} weeks}} ago
ta: புதுப்பிக்கப்பட்டது {மற்றும், பன்மை, = 1} வாரம்} பிற {{n} வாரங்கள்}} முன்பு

# managePageUpdatedMonthsAgo
source: Updated {n, plural, =1{{n} month} other{{n} months}} ago
ta: புதுப்பிக்கப்பட்டது {n, பன்மை, = 1 {{n} மாதம்} பிற {{n} மாதங்கள்}} முன்பு

# managePageUpdatedYearsAgo
source: Updated {n, plural, =1{{n} year} other{{n} years}} ago
ta: புதுப்பிக்கப்பட்டது {n, பன்மை, = 1 {{n} ஆண்டு} பிற {{n} ஆண்டுகள்}} முன்பு

# managePageUpdatesAvailable
source: Updates available ({n})
ta: புதுப்பிப்புகள் கிடைக்கின்றன ({n})

# managePageUpdatesFailed
source: {n, plural, =1{One update} other{{n} updates}} failed
ta: {n, பன்மை, = 1 {One update} பிற {{n} புதுப்பிப்புகள்}} தோல்வியுற்றது

# managePageUpdatesFailedBody
source: We couldn't update these applications because they are currently running. {snapList} When you quit the applications, they will automatically update.
ta: இந்த பயன்பாடுகள் தற்போது இயங்குவதால் எங்களால் புதுப்பிக்க முடியவில்லை. {snapList} நீங்கள் பயன்பாடுகளை விட்டு வெளியேறும்போது, ​​அவை தானாகவே புதுப்பிக்கப்படும்.

# managePageDocumentationLinkLabel
source: Learn how to manage Debian packages in the documentation.
ta: ஆவணத்தில் டெபியன் தொகுப்புகளை எவ்வாறு நிர்வகிப்பது என்பதை அறிக.

# productivityPageLabel
source: Productivity
ta: உற்பத்தித்திறன்

# developmentPageLabel
source: Development
ta: வளர்ச்சி

# gamesPageLabel
source: Games
ta: விளையாட்டுகள்

# gamesPageTitle
source: What's Hot
ta: என்ன சூடாக இருக்கிறது

# gamesPageTop
source: Top Rated
ta: மேல் மதிப்பிடப்பட்ட

# gamesPageFeatured
source: Featured Titles
ta: சிறப்பு தலைப்புகள்

# gamesPageBundles
source: App Bundles
ta: பயன்பாட்டு மூட்டைகள்

source: Unknown publisher
ta: தெரியாத வெளியீட்டாளர்

# searchFieldDebSection
source: Debian packages
ta: டெபியன் தொகுப்புகள்

# searchFieldSearchHint
source: Search for apps
ta: பயன்பாடுகளைத் தேடுங்கள்

# searchFieldSearchForLabel
source: See all results for "{query}"
ta: "{query}" க்கான அனைத்து முடிவுகளையும் காண்க

# searchFieldSnapSection
source: Snap packages
ta: தொகுப்புகள்

# searchPageFilterByLabel
source: Filter by
ta: மூலம் வடிகட்டவும்

# searchPageNoResults
source: No results found for "{query}"
ta: "{query}" க்கு முடிவுகள் எதுவும் கிடைக்கவில்லை

# searchPageNoResultsHint
source: Try using different or more general keywords
ta: வெவ்வேறு அல்லது அதற்கு மேற்பட்ட பொதுவான சொற்களைப் பயன்படுத்த முயற்சிக்கவும்

# searchPageNoResultsCategory
source: Sorry, we couldn’t find any packages in this category
ta: மன்னிக்கவும், இந்த வகையில் எந்த தொகுப்புகளையும் எங்களால் கண்டுபிடிக்க முடியவில்லை

# searchPageNoResultsCategoryHint
source: Try a different category or use more general keywords
ta: வேறு வகையை முயற்சிக்கவும் அல்லது பொதுவான முக்கிய வார்த்தைகளைப் பயன்படுத்தவும்

# searchPageSortByLabel
source: Sort by
ta: வரிசைப்படுத்தவும்

# searchPageRelevanceLabel
source: Relevance
ta: பொருத்தமானது

# searchPageTitle
source: Results for "{query}"
ta: "{query}" க்கான முடிவுகள்

# aboutPageLabel
source: About
ta: பற்றி

# aboutPageVersionLabel
source: Version {version}
ta: பதிப்பு {version}

# aboutPageContributorTitle
source: Designed and developed by:
ta: வடிவமைக்கப்பட்டு உருவாக்கப்பட்டது:

# aboutPageCommunityTitle
source: Be part of the community:
ta: சமூகத்தின் ஒரு பகுதியாக இருங்கள்:

# aboutPageContributeLabel
source: Contribute or report bug
ta: பிழையை பங்களிக்கவும் அல்லது புகாரளிக்கவும்

# aboutPageGitHubLabel
source: Find us on GitHub
ta: கிதுபில் எங்களை கண்டுபிடி

# aboutPagePublishLabel
source: Publish to the Snap Store
ta: ச்னாப் கடைக்கு வெளியிடுங்கள்

# aboutPageLearnMoreLabel
source: Learn more
ta: மேலும் அறிக

# appstreamUrlTypeBugtracker
source: Bugtracker
ta: பிழைத்திருத்தம்

# appstreamUrlTypeContact
source: Contact
ta: தொடர்பு

# appstreamUrlTypeContribute
source: Contribute
ta: பங்களிப்பு

# appstreamUrlTypeDonation
source: Donate
ta: நன்கொடை

# appstreamUrlTypeFaq
source: FAQ
ta: கேள்விகள்

# appstreamUrlTypeHelp
source: Help
ta: உதவி

# appstreamUrlTypeHomepage
source: Homepage
ta: முகப்புப்பக்கம்

# appstreamUrlTypeTranslate
source: Translations
ta: மொழிபெயர்ப்புகள்

# appstreamUrlTypeVcsBrowser
source: Source
ta: மூலம்

# packageFormatDebLabel
source: Debian packages
ta: டெபியன் தொகுப்புகள்

# packageFormatSnapLabel
source: Snap packages
ta: தொகுப்புகள்

# snapActionCancelLabel
source: Cancel
ta: ரத்துசெய்

# snapActionInstallLabel
source: Install
ta: நிறுவவும்

# snapActionInstalledLabel
source: Installed
ta: நிறுவப்பட்டது

# snapActionInstallingLabel
source: Installing
ta: நிறுவுகிறது

# snapActionOpenLabel
source: Open
ta: திற

# snapActionRemoveLabel
source: Uninstall
ta: நிறுவல் நீக்க

# snapActionRemovingLabel
source: Uninstalling
ta: நிறுவல் நீக்குதல்

# snapActionSwitchChannelLabel
source: Switch channel
ta: சேனல் சுவிட்ச்

# snapActionUpdateLabel
source: Update
ta: புதுப்பிப்பு

# snapCategoryAll
source: All categories
ta: அனைத்து பிரிவுகளும்

# snapActionUpdatingLabel
source: Updating
ta: புதுப்பித்தல்

# snapCategoryArtAndDesign
source: Art and Design
ta: கலை மற்றும் வடிவமைப்பு

# snapCategoryArtAndDesignButtonLabel
source: Start creating
ta: உருவாக்கத் தொடங்குங்கள்

# snapCategoryArtAndDesignSlogan
source: From your first sketch to the final touch, explore apps for art and design.
ta: உங்கள் முதல் ஓவியத்திலிருந்து இறுதி தொடுதல் வரை, கலை மற்றும் வடிவமைப்பிற்கான பயன்பாடுகளை ஆராயுங்கள்.

# snapCategoryBooksAndReference
source: Books and Reference
ta: புத்தகங்கள் மற்றும் குறிப்பு

# snapCategoryDefaultButtonLabel
source: Discover more
ta: மேலும் கண்டறியவும்

# snapCategoryDevelopment
source: Development
ta: வளர்ச்சி

# snapCategoryDevelopmentSlogan
source: Must-have snaps for developers
ta: டெவலப்பர்களுக்கு புகைப்படங்கள் இருக்க வேண்டும்

# snapCategoryDevicesAndIot
source: Devices and IoT
ta: சாதனங்கள் மற்றும் ஐஓடி

# snapCategoryEducation
source: Education
ta: கல்வி

# snapCategoryEntertainment
source: Entertainment
ta: பொழுதுபோக்கு

# snapCategoryFeatured
source: Featured
ta: இடம்பெற்றது

# snapCategoryFeaturedSlogan
source: Featured Snaps
ta: பிரத்யேக புகைப்படங்கள்

# snapCategoryFinance
source: Finance
ta: பொருள்

# snapCategoryGames
source: Games
ta: விளையாட்டுகள்

# snapCategoryGamesSlogan
source: Everything for your game night
ta: உங்கள் விளையாட்டு இரவுக்கான எல்லாம்

# snapCategoryGameDev
source: Game Development
ta: விளையாட்டு வளர்ச்சி

# snapCategoryGameDevSlogan
source: Game Development
ta: விளையாட்டு வளர்ச்சி

# snapCategoryGameEmulators
source: Emulators
ta: முன்மாதிரிகள்

# snapCategoryGameEmulatorsSlogan
source: Emulators
ta: முன்மாதிரிகள்

# snapCategoryGnomeGames
source: GNOME Games
ta: க்னோம் விளையாட்டுகள்

# snapCategoryGnomeGamesSlogan
source: GNOME Games Suite
ta: க்னோம் கேம்ச் சூட்

# snapCategoryKdeGames
source: KDE Games
ta: விளையாட்டுகள்

# snapCategoryKdeGamesSlogan
source: KDE Games Suite
ta: கே.டி.இ கேம்ச் சூட்

# snapCategoryGameLaunchers
source: Game Launchers
ta: விளையாட்டு லாஞ்சர்கள்

# snapCategoryGameLaunchersSlogan
source: Game Launchers
ta: விளையாட்டு லாஞ்சர்கள்

# snapCategoryGameContentCreation
source: Content Creation
ta: உள்ளடக்க உருவாக்கம்

# snapCategoryGameContentCreationSlogan
source: Content Creation
ta: உள்ளடக்க உருவாக்கம்

# snapCategoryHealthAndFitness
source: Health and Fitness
ta: உடல்நலம் மற்றும் உடற்பயிற்சி

# snapCategoryMusicAndAudio
source: Music and Audio
ta: இசை மற்றும் ஆடியோ

# snapCategoryNewsAndWeather
source: News and Weather
ta: செய்தி மற்றும் வானிலை

# snapCategoryPersonalisation
source: Personalisation
ta: தனிப்பயனாக்கம்

# snapCategoryPhotoAndVideo
source: Photo and Video
ta: புகைப்படம் மற்றும் வீடியோ

# snapCategoryProductivity
source: Productivity
ta: உற்பத்தித்திறன்

# snapCategoryProductivityButtonLabel
source: Discover the productivity collection
ta: உற்பத்தித்திறன் சேகரிப்பைக் கண்டறியவும்

# snapCategoryProductivitySlogan
source: Cross one thing off your to-do list
ta: நீங்கள் செய்ய வேண்டிய பட்டியலில் இருந்து ஒரு விசயத்தைக் கடக்கவும்

# snapCategoryScience
source: Science
ta: அறிவியல்

# snapCategorySecurity
source: Security
ta: பாதுகாப்பு

# snapCategoryServerAndCloud
source: Server and Cloud
ta: சேவையகம் மற்றும் முகில்

# snapCategorySocial
source: Social
ta: சமூக

# snapCategoryUbuntuDesktop
source: Ubuntu Desktop
ta: உபுண்டு டெச்க்டாப்

# snapCategoryUbuntuDesktopSlogan
source: Jump start your desktop
ta: உங்கள் டெச்க்டாப்பைத் தொடங்கவும்

# snapCategoryUtilities
source: Utilities
ta: பயன்பாடுகள்

# snapConfinementClassic
source: Classic
ta: கிளாசிக்

# snapConfinementDevmode
source: Devmode
ta: இறையன்பு

# snapConfinementStrict
source: Strict
ta: கண்டிப்பான

# snapSortOrderAlphabeticalAsc
source: Alphabetical (A to Z)
ta: அகரவரிசை (A முதல் சட் வரை)

# snapSortOrderAlphabeticalDesc
source: Alphabetical (Z to A)
ta: அகரவரிசை (z முதல் A வரை)

# snapSortOrderDownloadSizeAsc
source: Size (Smallest to largest)
ta: அளவு (மிகச்சிறிய முதல் மிகப்பெரியது)

# snapSortOrderDownloadSizeDesc
source: Size (Largest to smallest)
ta: அளவு (மிகப்பெரியது முதல் சிறியது)

# snapSortOrderInstalledSizeAsc
source: Size (Smallest to largest)
ta: அளவு (மிகச்சிறிய முதல் மிகப்பெரியது)

# snapSortOrderInstalledSizeDesc
source: Size (Largest to smallest)
ta: அளவு (மிகப்பெரியது முதல் சிறியது)

# snapSortOrderInstalledDateAsc
source: Least recently updated
ta: குறைந்தது அண்மைக் காலத்தில் புதுப்பிக்கப்பட்டது

# snapSortOrderInstalledDateDesc
source: Most recently updated
ta: மிக அண்மைக் காலத்தில் புதுப்பிக்கப்பட்டது

# snapSortOrderRelevance
source: Relevance
ta: பொருத்தமானது

# snapRatingsBandVeryGood
source: Very good
ta: மிகவும் நல்லது

# snapRatingsBandGood
source: Good
ta: நல்லது

# snapRatingsBandNeutral
source: Neutral
ta: நடுநிலை

# snapRatingsBandPoor
source: Poor
ta: ஏழை

# snapRatingsBandVeryPoor
source: Very poor
ta: மிகவும் ஏழை

# snapRatingsBandInsufficientVotes
source: Insufficient votes
ta: போதிய வாக்குகள்

# snapRatingsVotes
source: {n} votes
ta: {n} வாக்குகள்

# snapReportLabel
source: Report {snapName}
ta: அறிக்கை {snapName}

# snapReportSelectReportReasonLabel
source: Choose a reason for reporting this snap
ta: இந்த புகைப்படத்தைப் புகாரளிப்பதற்கான காரணத்தைத் தேர்வுசெய்க

# snapReportSelectAnOptionLabel
source: Select an option
ta: ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்

# snapReportOptionCopyrightViolation
source: Copyright or trademark violation
ta: பதிப்புரிமை அல்லது வர்த்தக முத்திரை மீறல்

# snapReportOptionStoreViolation
source: Snap Store terms of service violation
ta: பணி மீறல் விதிமுறைகளை ச்னாப் செய்யுங்கள்

# snapReportDetailsLabel
source: Please provide more detailed reason to your report
ta: உங்கள் அறிக்கைக்கு மேலும் விரிவான காரணத்தை வழங்கவும்

# snapReportOptionalEmailAddressLabel
source: Your email (optional)
ta: உங்கள் மின்னஞ்சல் (விரும்பினால்)

# snapReportCancelButtonLabel
source: Cancel
ta: ரத்துசெய்

# snapReportSubmitButtonLabel
source: Submit report
ta: அறிக்கையை சமர்ப்பிக்கவும்

# snapReportEnterValidEmailError
source: Enter a valid email address
ta: சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்

# snapReportDetailsHint
source: Comment...
ta: கருத்து ...

# snapReportPrivacyAgreementLabel
source: In submitting this form, I confirm that I have read and agree to
ta: இந்த படிவத்தை சமர்ப்பிப்பதில், நான் படித்து ஒப்புக்கொள்கிறேன் என்பதை உறுதிப்படுத்துகிறேன்

# snapReportPrivacyAgreementCanonicalPrivacyNotice
source: Canonical’s Privacy Notice
ta: நியமனத்தின் தனியுரிமை அறிவிப்பு

# snapReportPrivacyAgreementAndLabel
source: and
ta: மற்றும்

# snapReportPrivacyAgreementPrivacyPolicy
source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

# debPageErrorNoPackageInfo
source: No package information found
ta: தொகுப்பு தகவல்கள் எதுவும் கிடைக்கவில்லை

# debPageDocumentationLinkLabel
source: Learn about managing Debian packages
ta: டெபியன் தொகுப்புகளை நிர்வகிப்பது பற்றி அறிக

# externalResources
source: Additional resources
ta: கூடுதல் ஆதாரங்கள்

# externalResourcesButtonLabel
source: Discover more
ta: மேலும் கண்டறியவும்

# allGamesButtonLabel
source: All games
ta: அனைத்து விளையாட்டுகளும்

# externalResourcesDisclaimer
source: Note: These are all external tools. These aren't owned nor distributed by Canonical.
ta: குறிப்பு: இவை அனைத்தும் வெளிப்புற கருவிகள். இவை நியமனத்தால் சொந்தமானவை அல்லது விநியோகிக்கப்படவில்லை.

source: Open in browser
ta: உலாவியில் திற

source: Install all
ta: அனைத்தையும் நிறுவவும்

# localDebWarningTitle
source: Potentially unsafe
ta: பாதுகாப்பற்றது

# localDebWarningBody
source: This package is provided by a third party. Installing packages from outside the App Center can increase the risk to your system and personal data. Ensure you trust the source before proceeding.
ta: இந்த தொகுப்பு மூன்றாம் தரப்பினரால் வழங்கப்படுகிறது. பயன்பாட்டு மையத்திற்கு வெளியில் இருந்து தொகுப்புகளை நிறுவுவது உங்கள் கணினி மற்றும் தனிப்பட்ட தரவுகளுக்கு ஆபத்தை அதிகரிக்கும். தொடர்வதற்கு முன் மூலத்தை நம்புவதை உறுதிசெய்க.

# localDebLearnMore
source: Learn more about third party packages
ta: மூன்றாம் தரப்பு தொகுப்புகள் பற்றி மேலும் அறிக

# localDebDialogMessage
source: This package is provided by a third party and may threaten your system and personal data.
ta: இந்த தொகுப்பு மூன்றாம் தரப்பினரால் வழங்கப்படுகிறது, மேலும் இது உங்கள் கணினி மற்றும் தனிப்பட்ட தரவை அச்சுறுத்தக்கூடும்.

# localDebDialogConfirmation
source: Are you sure you want to install it?
ta: நீங்கள் அதை நிறுவ விரும்புகிறீர்களா?

# snapdExceptionRunningApps
source: We couldn't update {snapName} because it is currently running.
ta: {snapName} புதுப்பிக்க முடியவில்லை, ஏனெனில் அது தற்போது இயங்குகிறது.

# errorViewCheckStatusLabel
source: Check status
ta: நிலையை சரிபார்க்கவும்

# errorViewNetworkErrorTitle
source: Connect to internet
ta: இணையத்துடன் இணைக்கவும்

# errorViewNetworkErrorDescription
source: We can't load content in the App Center without an internet connection.
ta: இணைய இணைப்பு இல்லாமல் பயன்பாட்டு மையத்தில் உள்ளடக்கத்தை ஏற்ற முடியாது.

# errorViewNetworkErrorAction
source: Check your connection and retry.
ta: உங்கள் இணைப்பைச் சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# errorViewServerErrorDescription
source: We're sorry, we are currently experiencing problems with the App Center.
ta: மன்னிக்கவும், நாங்கள் தற்போது பயன்பாட்டு மையத்தில் சிக்கல்களை சந்தித்து வருகிறோம்.

# errorViewServerErrorAction
source: Check the status for updates or try again later.
ta: புதுப்பிப்புகளுக்கான நிலையை சரிபார்க்கவும் அல்லது பின்னர் மீண்டும் முயற்சிக்கவும்.

# errorViewUnknownErrorTitle
source: Something went wrong
ta: ஏதோ தவறு நடந்தது

# errorViewUnknownErrorDescription
source: We're sorry, but we’re not sure what the error is.
ta: மன்னிக்கவும், ஆனால் பிழை என்னவென்று எங்களுக்குத் தெரியவில்லை.

# errorViewUnknownErrorAction
source: You can retry now, check the status for updates, or try again later.
ta: நீங்கள் இப்போது மீண்டும் முயற்சிக்கலாம், புதுப்பிப்புகளுக்கான நிலையை சரிபார்க்கலாம் அல்லது பின்னர் மீண்டும் முயற்சிக்கவும்.
