Repository: 247i/TACETr
Catalog: உரை/வெறுமை/ubuntu-desktop-translations-provision-stages-4-and-5-init-*.po
Languages: ta

# welcomePageTitle
source: Welcome
ta: வரவேற்கிறோம்

# welcomePageHeader
source: Welcome to {distro}
ta: {டிச்ட்ரோ க்கு க்கு வருக

# welcomeWhatsNew
source: WHAT'S NEW?
ta: புதியது என்ன?

# welcomeStartTitle
source: A streamlined start
ta: ஒரு நெறிப்படுத்தப்பட்ட தொடக்க

# welcomeStartSubtitle
source: Supporting a cleaner setup experience.
ta: தூய்மையான அமைப்பு அனுபவத்தை ஆதரிக்கிறது.

# welcomeStoreTitle
source: New look App Store
ta: புதிய தோற்ற ஆப் கடை

# welcomeStoreSubtitle
source: It's never been easier to find your favourite software.
ta: உங்களுக்கு பிடித்த மென்பொருளை கண்டுபிடிப்பது ஒருபோதும் எளிதாக இல்லை.

# welcomeSecurityTitle
source: Enhanced security
ta: மேம்பட்ட பாதுகாப்பு

# welcomeSecuritySubtitle
source: New options for hardware-backed or ZFS encryption.
ta: வன்பொருள் உதவி அல்லது ZFS குறியாக்கத்திற்கான புதிய விருப்பங்கள்.

# welcomeChangelogLabel
source: <a href="{url}">View changelog</a>
ta: <a href = "{url}"> சேஞ்ச்லாக் காண்க </a>

# telemetryPageTitle
source: Telemetry
ta: டெலிமெட்ரி

# telemetryHeader
source: Help improve {distro}
ta: {distro} ஐ மேம்படுத்த உதவுங்கள்

# telemetryDescription
source: Help us improve {distro} by sharing your system data with us. This includes things like your machine model, installed software and the location you chose for your timezone.
ta: உங்கள் கணினி தரவை எங்களுடன் பகிர்வதன் மூலம் {distro} ஐ மேம்படுத்த எங்களுக்கு உதவுங்கள். உங்கள் இயந்திர மாதிரி, நிறுவப்பட்ட மென்பொருள் மற்றும் உங்கள் நேர மண்டலத்திற்காக நீங்கள் தேர்ந்தெடுத்த இடம் போன்ற விசயங்கள் இதில் அடங்கும்.

# telemetryLabelOn
source: Yes, share system data with the {distro} team
ta: ஆம், கணினி தரவை {distro} குழுவுடன் பகிர்ந்து கொள்ளுங்கள்

# telemetryLabelOff
source: No, don't share system data
ta: இல்லை, கணினி தரவைப் பகிர வேண்டாம்

# telemetryReportLabel
source: Show the first report
ta: முதல் அறிக்கையைக் காட்டு

# telemetryReportTitle
source: Reporting details
ta: விவரங்கள் விவரங்கள்

# telemetryLegalLabel
source: Legal notice
ta: சட்ட அறிவிப்பு

# telemetryCollectError
source: Failed to collect telemetry data
ta: டெலிமெட்ரி தரவை சேகரிப்பதில் தோல்வி

# privacyPageTitle
source: Location services
ta: இருப்பிட சேவைகள்

# privacyLocationTitle
source: Enable location services?
ta: இருப்பிட சேவைகளை இயக்கவா?

# privacyLocationSubtitle
source: Let applications know your geographical location. You can change this anytime in System Settings.
ta: பயன்பாடுகள் உங்கள் புவியியல் இருப்பிடத்தை அறியட்டும். கணினி அமைப்புகளில் எப்போது வேண்டுமானாலும் இதை மாற்றலாம்.

# privacyLocationEnable
source: Location services
ta: இருப்பிட சேவைகள்

# privacyPolicyLink
source: Data Privacy
ta: தரவு தனியுரிமை

# ubuntuProMagicAttachInstructions
source: Magic attach with this code at <a href="https://{url}">{url}</a>
ta: இந்த குறியீட்டைக் கொண்டு <a href = "https: // {url}"> {url} </a> இல் மேசிக் இணைக்கவும்

# ubuntuProPageTitle
source: Ubuntu Pro
ta: உபுண்டு புரோ

# ubuntuProHeader
source: Attach this machine
ta: இந்த இயந்திரத்தை இணைக்கவும்

# ubuntuProOrAddTokenManually
source: or add a token manually
ta: அல்லது ஒரு கிள்ளாக்கை கைமுறையாக சேர்க்கவும்

# ubuntuProTokenTextfieldHint
source: Token
ta: கிள்ளாக்கு

# ubuntuProSubscriptionDescription
source: Get the most comprehensive subscription for open-source software security
ta: திறந்த மூல மென்பொருள் பாதுகாப்பிற்கான மிக விரிவான சந்தாவைப் பெறுங்கள்

# ubuntuProSubscriptionFreeForPersonalUse
source: Always free for personal use. 30-days trial for enterprises. <a href="https://{url}">Learn more</a>
ta: தனிப்பட்ட பயன்பாட்டிற்கு எப்போதும் இலவசம். நிறுவனங்களுக்கான 30 நாட்கள் சோதனை. <a href = "https: // {url}"> மேலும் அறிக </a>

# ubuntuProTokenAttachButton
source: Attach
ta: இணைக்கவும்

# ubuntuProTokenAttachError
source: Invalid token
ta: தவறான கிள்ளாக்கு

# ubuntuProTokenAttachSucess
source: Valid token
ta: செல்லுபடியாகும் கிள்ளாக்கு

# ubuntuProTokenAttachErrorVariant
source: Invalid token, retry
ta: தவறான கிள்ளாக்கு, மீண்டும் முயற்சிக்கவும்

# ubuntuProOnBoardingSkipForNow
source: Skip for now
ta: இப்போதைக்கு தவிர்க்கவும்

# ubuntuProOnBoardingSkipForNowDescription
source: You can always enable Ubuntu Pro later via the Software & Updates application.
ta: மென்பொருள் மற்றும் புதுப்பிப்புகள் பயன்பாடு வழியாக நீங்கள் எப்போதும் உபுண்டு புரோவை இயக்கலாம்.

# ubuntuProOnBoardingEnableUbuntuPro
source: Enable Ubuntu Pro
ta: உபுண்டு புரோவை இயக்கவும்

# ubuntuProOnBoardingEnableUbuntuProDescription
source: Attach this machine to an Ubuntu Pro subscription for security updates on a wider range of packages, until 2032.
ta: 2032 வரை, பரந்த அளவிலான தொகுப்புகளில் பாதுகாப்பு புதுப்பிப்புகளுக்காக இந்த இயந்திரத்தை உபுண்டு புரோ சந்தாவுடன் இணைக்கவும்.

# ubuntuProSucessAttachHeader
source: Ubuntu Pro is now enabled in this machine
ta: உபுண்டு புரோ இப்போது இந்த கணினியில் இயக்கப்பட்டிருக்கிறது

# ubuntuProSucessAttachDescription
source: You can manage your Pro services in the Software & Updates application.
ta: மென்பொருள் மற்றும் புதுப்பிப்புகள் பயன்பாட்டில் உங்கள் புரோ சேவைகளை நிர்வகிக்கலாம்.
