Repository: 247i/TACETr
Catalog: உரை/முடிந்தது/vikdevelop-savedesktop-*.po
Languages: ta

source: About app
ta: பயன்பாடுபற்றி

# unsuppurted_env_desc
source: <big><b>You have an unsupported environment installed.</b></big> Please use one of these environments: {}.
ta: <big> <b> உங்களிடம் ஆதரிக்கப்படாத சூழல் நிறுவப்பட்டுள்ளது. </b></big> இந்தச் சூழல்களில் ஒன்றைப் பயன்படுத்தவும்: {}.

# save_config
source: Save current configuration
ta: தற்போதைய உள்ளமைவைச் சேமி

# import_config
source: Import saved configuration
ta: இறக்குமதி சேமிக்கப்பட்ட உள்ளமைவு

# set_filename
source: Set the file name
ta: கோப்புப் பெயரை அமை

# saving_config_status
source: <big><b>Saving configuration …</b></big> The configuration of your desktop environment will be saved in: <i>{}/{}.sd.tar.gz</i>
ta: <big> <b> உள்ளமைவைச் சேமித்தல்… </b> </big> உங்கள் பணிமேடை சூழலின் உள்ளமைவு சேமிக்கப்படும்: <i> {}/{}. Sd.tar.gz </i>

# config_saved
source: Configuration has been saved!
ta: உள்ளமைவு சேமிக்கப்பட்டது!

# config_saved_desc
source: <big><b>{}</b></big> You can now view the archive with the configuration of your desktop environment, or return to the previous page.
ta: <big> <b> {} </b> </big> உங்கள் பணிமேடை சூழலின் உள்ளமைவுடன் காப்பகத்தை இப்போது காணலாம் அல்லது முந்தைய பக்கத்திற்குத் திரும்பலாம்.

# open_folder
source: Open the folder
ta: கோப்புறையைத் திற

# import_fileshooser
source: Import {} configuration
ta: இறக்குமதி {} உள்ளமைவு

source: Cancel
ta: கைவிடு

# savedesktop_f
source: SaveDesktop files
ta: சேமிபணிமேடை கோப்புகள்

# importing_config_status
source: <big><b>Importing configuration …</b></big> Importing configuration from: <i>{}</i>
ta: <big> <b> உள்ளமைவை இறக்குமதி செய்தல்… </b></big> இதிலிருந்து உள்ளமைவை இறக்குமதி செய்தல்: <i> {} </i>

# config_imported
source: The configuration has been applied!
ta: உள்ளமைவு பயன்படுத்தப்பட்டது!

# config_imported_desc
source: <big><b>{}</b></big> You can log out of the system for the changes to take effect, or go back to the previous page and log out later.
ta: <big> <b> {} </b> </big> மாற்றங்கள் நடைமுறைக்கு வர நீங்கள் கணினியிலிருந்து வெளியேறலாம், அல்லது முந்தைய பக்கத்திற்குச் சென்று பின்னர் வெளியேறலாம்.

# back_to_page
source: Back to previous page
ta: முந்தைய பக்கத்திற்குத் திரும்பு

source: Log Out
ta: விடுபதிகை

# err_occured
source: An error occurred
ta: பிழை ஏற்பட்டது

source: Save
ta: சேமி

# import_title
source: Import
ta: இறக்குமதி

source: Import from file
ta: கோப்பிலிருந்து இறக்குமதி

# import_config_desc2
source: Import the configuration by clicking on the button below.
ta: கீழே உள்ள பொத்தானைக் சொடுக்குவதன் மூலம் உள்ளமைவை இறக்குமதி செய்.

source: Apply
ta: இடு

source: Periodic saving
ta: அவ்வப்போது சேமி

# periodic_saving_desc
source: Changes will only take effect after the next login
ta: அடுத்த உள்நுழைவுக்குப் பிறகுதான் மாற்றங்கள் நடைமுறைக்கு வரும்

# pb_interval
source: Interval
ta: இடைவேளை

source: Never
ta: ஒருபோதும்

source: Daily
ta: நாள்தோறும்

source: Weekly
ta: வாராந்தோறும்

source: Monthly
ta: திங்கள்தோறும்

source: Manually
ta: கைமுறையாக

source: Learn more
ta: மேலும் அறிக

# pb_folder
source: Folder for periodic saving
ta: அவ்வப்போது சேமிப்பதற்கான கோப்புறை

# set_pb_folder_tooltip
source: Choose custom folder for periodic saving
ta: அவ்வப்போது சேமிக்க தனிப்பயன் கோப்புறையைத் தேர்வுசெய்க

# set_another
source: Choose another folder
ta: மற்றொரு கோப்புறையைத் தேர்வுசெய்க

source: File name format
ta: கோப்புப் பெயர் வடிவம்

# reset_button
source: Reset to default
ta: இயல்புநிலைக்கு மீட்டமை

# items_for_archive
source: Items to include in the configuration archive
ta: உள்ளமைவு காப்பகத்தில் சேர்க்க வேண்டிய உருப்படிகள்

# items_desc
source: These settings also apply to periodic saving
ta: இந்த அமைப்புகள் அவ்வப்போது சேமிப்பதற்கும் பொருந்தும்

source: Icons
ta: சின்னங்கள்

source: Themes
ta: கருப்பொருள்கள்

source: Fonts
ta: எழுத்துருக்கள்

source: Backgrounds
ta: பின்னணிகள்

source: Extensions
ta: நீட்டிப்புகள்

# desktop_folder
source: Desktop
ta: பணிமேடை

# save_installed_flatpaks
source: Flatpak apps
ta: தட்டைகட்டு பயன்பாடுகள்

# list
source: List of installed Flatpak apps
ta: நிறுவப்பட்ட தட்டைகட்டு பயன்பாடுகளின் பட்டியல்

# user_data_flatpak
source: User data of installed Flatpak apps
ta: நிறுவப்பட்ட தட்டைகட்டு பயன்பாடுகளின் பயனர் தரவு

# flatpaks_data_tittle
source: Flatpak apps data selection
ta: தட்டைகட்டு பயன்பாடுகள் தரவுத் தேர்வு

source: Sync
ta: ஒத்திசைவு

# sync_title
source: Sync with other computers in the network
ta: இணைப்பில் உள்ள பிற கணினிகளுடன் ஒத்திசை

# sync_desc
source: Sync your desktop environment configuration with other computers in the network.
ta: இணைப்பில் உள்ள பிற கணினிகளுடன் உங்கள் பணிமேடை சூழல் உள்ளமைவை ஒத்திசை.

# initial_setup
source: Initial synchronization setup
ta: ஆரம்ப ஒத்திசைவு அமைப்பு

# gnome_oa_settings
source: 1. Open the system settings
ta: 1. கணினி அமைப்புகளைத் திற

# gnome_oa_section
source: 2. Go to the Online Accounts section
ta: 2. நிகழ்நிலை கணக்குகள் பகுதிக்குச் செல்

# gnome_oa_section_desc
source: In this section select the cloud service you want, such as Google, Microsoft 365 or Nextcloud.
ta: இந்தப் பிரிவில் கூகிள், நுண்மென் 365 அல்லது அடுத்தமுகில் போன்ற நீங்கள் விரும்பும் முகில் சேவையைத் தேர்ந்தெடு.

# gnome_oa_chooser
source: 3. Click on the Next button and select the created cloud drive folder
ta: 3. அடுத்த பொத்தானைக் சொடுக்கு செய்து உருவாக்கிய முகில் இயக்கிக் கோப்புறையைத் தேர்ந்தெடு

# gnome_oa_chooser_desc
source: The created cloud drive folder can be found in the side panel of the file chooser dialog, in this form: username@service.com.
ta: உருவாக்கப்பட்ட முகில் இயக்கிக் கோப்புறையை கோப்புத் தேர்வு உரையாடலின் பக்க பலைகையில் இந்தப் படிவத்தில் காணலாம்: USERNAME@SERVICE.com.

# rclone_intro_desc
source: For synchronization to works properly, you need to have the folder, that is synced with your cloud service using Rclone. <b>Start by selecting the cloud drive service you use.</b>
ta: சரியாக வேலை செய்ய ஒத்திசைவு, நீங்கள் கோப்புறையை வைத்திருக்க வேண்டும், அது ஆர்நகலியைப் பயன்படுத்தி உங்கள் முகில் சேவையுடன் ஒத்திசைக்கப்படுகிறது. <b> நீங்கள் பயன்படுத்தும் முகில் இயக்கிச் சேவையைத் தேர்ந்தெடுப்பதன் மூலம் தொடங்கு. </b>

# rclone_copy_cmd
source: Now, copy the command to set up Rclone using the side button and open the terminal app using the Ctrl+Alt+T keyboard shortcut or finding it in the apps' menu.
ta: இப்போது, பக்க பொத்தானைப் பயன்படுத்தி ஆர்நகலியை அமைக்கக் கட்டளையை நகலெடுத்து, கட்டு+மாற்று+ஏ விசைப்பலகை குறுக்குவழியைப் பயன்படுத்தி முனையப் பயன்பாட்டைத் திற அல்லது பயன்பாடுகளின் பட்டியலில் கண்டுபிடி.

# rclone_cmd_copied_msg
source: Once you have finished setting up Rclone using the command provided, click the "Apply" button
ta: வழங்கப்பட்ட கட்டளையைப் பயன்படுத்தி ஆர்நகலியை அமைத்ததும், "இடு" பொத்தானைக் சொடுக்கு

# almost_done_title
source: Almost done!
ta: கிட்டத்தட்ட முடிந்தது!

# almost_done_desc
source: You've now created the cloud drive folder! Click on the Next button to complete the setup.
ta: நீங்கள் இப்போது முகில் இயக்கிக் கோப்புறையை உருவாக்கியுள்ளீர்கள்! அமைப்பை முடிக்க அடுத்த பொத்தானைக் சொடுக்கு.

source: Select
ta: தேர்ந்தெடு

source: Next
ta: அடுத்தது

# set_up_sync_file
source: Set up the sync file
ta: ஒத்திசைவு கோப்பை அமை

source: Periodic saving file
ta: அவ்வப்போது சேமிக்கும் கோப்பு

# periodic_saving_file_err
source: Periodic saving file does not exist.
ta: அவ்வப்போது சேமிக்கும் கோப்பு இல்லை.

source: Create
ta: உருவாக்கு

source: Please wait …
ta: தயவுசெய்து காத்திரு…

source: Change
ta: மாற்றம்

# connect_cloud_storage
source: Connect to the cloud storage
ta: முகில் சேமிப்பகத்துடன் இணை

# connect_cloud_storage_desc
source: On another computer, open the SaveDesktop app, and on this page, click on the "Set up the sync file" button and make the necessary settings. On this computer, select the folder that you have synced with your cloud storage and also have saved the same periodic saving file.
ta: மற்றொரு கணினியில், சேமிபணிமேடை பயன்பாட்டைத் திறந்து, இந்தப் பக்கத்தில், "ஒத்திசைவு கோப்பை அமைக்கவும்" பொத்தானைக் சொடுக்கு செய்து தேவையான அமைப்புகளை உருவாக்கவும். இந்தக் கணினியில், உங்கள் மேகக்கணி சேமிப்பகத்துடன் நீங்கள் ஒத்திசைத்த கோப்புறையைத் தேர்ந்தெடுக்கவும், அதே கால சேமிப்பு கோப்பையும் சேமித்துள்ளீர்கள்.

# select_cloud_folder_btn
source: Select the cloud drive folder
ta: முகில் இயக்கிக் கோப்புறையைத் தேர்ந்தெடு

# cloud_folder_err
source: You didn't select the cloud drive folder!
ta: நீங்கள் முகில் இயக்கிக் கோப்புறையைத் தேர்ந்தெடுக்கவில்லை!

# periodic_sync
source: Periodic synchronization
ta: அவ்வப்போது ஒத்திசைவு

# bidirectional_sync
source: Bidirectional synchronization
ta: இருதரப்பு ஒத்திசைவு

# bidirectional_sync_desc
source: If enabled, and the sync interval and cloud drive folder are selected, the periodic saving information (interval, folder, and file name) from the other computer with synchronization set to synchronize is copied to this computer.
ta: இயக்கப்பட்டிருந்தால், மற்றும் ஒத்திசைவு இடைவெளி மற்றும் முகில் இயக்கிக் கோப்புறை தேர்ந்தெடுக்கப்பட்டால், ஒத்திசைவதற்கு அமைக்கப்பட்ட பிற கணினியிலிருந்து அவ்வப்போது சேமிக்கும் செய்தி (இடைவெளி, கோப்புறை மற்றும் கோப்புப் பெயர்) இந்தக் கணினியில் நகலெடுக்கப்படுகிறது.

# m_sync_desc
source: From now on, you can sync the config from the menu in the header bar
ta: இனிமேல், தலைப்பு பட்டியில் உள்ள பட்டியலிருந்து உள்ளமைவை ஒத்திசைக்கலாம்

# sync_manually
source: Synchronise manually
ta: கைமுறையாக ஒத்திசை

source: Keyboard shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

# open_wiki
source: Open the application wiki
ta: பயன்பாட்டு விக்கியைத் திற

source: Quit
ta: வெளியேறு

source: More options
ta: மேலும் விருப்பங்கள்

source: Archive encryption
ta: காப்பக குறியாக்கம்

# archive_encryption_desc
source: When manually saving the configuration, you will be prompted to create a password. This is useful when saving the configuration to portable media for better security of your data.
ta: உள்ளமைவை கைமுறையாகச் சேமிக்கும்போது, கடவுச்சொல்லை உருவாக்கும்படி கேட்கப்படுவீர்கள். உங்கள் தரவின் சிறந்த பாதுகாப்பிற்காக உள்ளமைவை எடுத்துசெல்லதக்க ஊடகத்தில் சேமிக்கும்போது இது பயனுள்ளதாக இருக்கும்.

# create_pwd_title
source: Create new password
ta: புதிய கடவுச்சொல்லை உருவாக்கு

# create_pwd_desc
source: Please create new password for your archive. Criteria include a length of at least 12 characters, one uppercase letter, one lowercase letter, and one special character.
ta: உங்கள் காப்பகத்திற்கு புதிய கடவுச்சொல்லை உருவாக்கு. அளவுகோல்கள் குறைந்தது 12 எழுத்து நீளம், ஒரு பெரிய எழுத்து, ஒரு சிறிய எழுத்து மற்றும் ஒரு சிறப்பு எழுத்து ஆகியவை அடங்கும்.

# gen_password
source: Generate Password
ta: கடவுச்சொல்லை உருவாக்கு

# password_entry
source: Password
ta: கடவுச்சொல்

# check_pwd_title
source: Unlock the archive with a password
ta: கடவுச்சொல் மூலம் காப்பகத்தைத் திற

# check_pwd_desc
source: Enter the password below to unlock the archive with your configuration. If you have forgotten it, you will not be able to unzip the archive and start importing your configuration.
ta: உங்கள் உள்ளமைவுடன் காப்பகத்தைத் திறக்கக் கீழே உள்ள கடவுச்சொல்லை உள்ளிடவும். நீங்கள் அதை மறந்துவிட்டால், நீங்கள் காப்பகத்தை அவிழ்த்து உங்கள் உள்ளமைவை இறக்குமதி செய்யத் தொடங்க முடியாது.

# summary
source: Save your desktop configuration
ta: உங்கள் பணிமேடை உள்ளமைவைச் சேமி

# description
source: SaveDesktop lets you save your current configuration (themes, icons, wallpapers, all desktop environment settings, extensions, etc.) with one click.
ta: உங்கள் தற்போதைய உள்ளமைவை (கருப்பொருள்கள், சின்னங்கள், பின்ணணிகள், அனைத்து பணிமேடை சுற்றுச்சூழல் அமைப்புகள், நீட்டிப்புகள் போன்றவை) ஒரே சொடுக்கில் சேமிக்க சேமிபணிமேடை உங்களை அனுமதிக்கிறது.

# translator_credits
source: Translator github-link
ta: தமிழ்நேரம் <https://TamilNeram.github.io>
