Repository: 247i/TACETr
Catalog: உரை/முடிந்தது/நிதியியல்.po
Languages: ta

source: accounting concept
ta: கணக்கியல் கருத்துக்கள்

source: accounting entity concept
ta: கணக்கியல் தனித்தன்மை கருத்து

source: accounting period concept
ta: கணக்கியல் காலக் கருத்து

source: accounting year
ta: கணக்காண்டு

source: accrued expense
ta: அட்டுறுச் செலவு

source: accrued revenue
ta: அட்டுறு வருமானம்

source: advance
ta: முன்பணம்

source: annual general meeting
ta: ஆண்டு பொதுக் கூட்டம்

source: appreciation (in value)
ta: மதிப்புயர்வு

source: assets account
ta: சொத்துக் கணக்கு

source: balance sheet
ta: ஐந்தொகை, இருப்புநிலைக் குறிப்பு

source: bank
ta: வைப்பகம்

source: banking ombudsman
ta: வங்கிய குறைத்தீர்ப்பாணையம்

source: banknote
ta: பணத்தாள்

source: bearer bond
ta: கொணர்பவர் கடனீடு

source: bills receivable
ta: வரவுக்குரிய உண்டியல்கள்

source: board of directors
ta: இயக்குநரவை, இயக்குநர் வாரியம்

source: bond
ta: கடனீடு

source: book-keeping
ta: கணக்கு வைப்பு

source: borrowed capital
ta: கடன் முதல்

source: bourse
ta: பங்கு மாற்றகம்

source: branch account(s)
ta: கிளைக் கணக்கு(கள்)

source: branch adjustment account
ta: கிளை சரிகட்டும் கணக்கு

source: branch assets account
ta: கிளை சொத்துக் கணக்கு

source: branch expenses account
ta: கிளை செலவுக் கணக்கு

source: brand (name)
ta: முத்திரைப் பெயர்

source: business entity concept
ta: தொழில் தனித்தன்மை கருத்து

source: call money
ta: அழைப்புப் பணம்

source: call option
ta: வாங்கல் சூதம்

source: capital
ta: மூலதனம்

source: capital reserve
ta: மூலதனக் காப்பு

source: cash transaction
ta: ரொக்க நடவடிக்கை

source: challan
ta: செலுத்துச்சீட்டு

source: chartered accountant
ta: பட்டயக் கணக்கர்

source: consignment
ta: அனுப்பீடு

source: convertible debenture
ta: மாற்றத்தக்க கடன்பத்திரம்

source: cost accounting
ta: அடக்கவிலை கணக்கவியல்

source: cost audit
ta: அடக்கமதிப்பு தணிக்கை

source: counterfoil
ta: எதிரிதழ்

source: credit card
ta: கடனட்டை

source: credit note
ta: வரவுக் குறிப்பு

source: credit transaction
ta: கடன் நடவடிக்கை

source: creditor
ta: கடனாளர், கடனீந்தர்

source: creditor's ledger
ta: கடனீந்தோர் பேரேடு

source: currency exchange
ta: பணமாற்றம், நாணயமாற்றம்

source: currency note
ta: பணத்தாள்

source: current account
ta: நடப்பு கணக்கு

source: current asset
ta: நடப்பு சொத்து

source: day trading
ta: பகல் வணிகம்

source: debenture
ta: கடனியம்

source: debit balance
ta: பற்று நிலுவை

source: debit card
ta: பற்றட்டை

source: debt collector
ta: கடன்மீட்பர்

source: debt instrument
ta: கடன் பத்திரம்

source: debtor
ta: கடனாளி

source: debtor's ledger
ta: கடனாளிகள் பேரேடு

source: deflation
ta: பணவாட்டம்

source: demand
ta: தேவைப்பாடு

source: departmental account
ta: துறைவாரி கணக்கு, திணைக்களக் கணக்கு

source: dependant branch(es)
ta: சார்பு கிளை(கள்)

source: deposit
ta: வைப்புத்தொகை

source: depositor
ta: வைப்புத்தொகையாளர்

source: depreciation
ta: தேய்மானம்

source: derivative
ta: சார்பியம்

source: diminution (in value)
ta: மதிப்பிழப்பு

source: direct expense(s)
ta: நேரடி செலவினம்(ங்கள்)

source: dividend
ta: பங்காதாயம், ஈவுத்தொகை

source: dividend coupon
ta: பங்காதயச் சீட்டு

source: dividend warrant
ta: பங்காதாய உரிமையாணை

source: double-entry accounting
ta: இரட்டைப் பதிவு கணக்கியல்

source: electronic funds transfer
ta: மின்னணு நிதி மாற்றல், நிதி மின்மாற்றல்

source: employee provident fund
ta: ஊழியர் சேமநிதி

source: entry load
ta: நுழைவு கட்டணம்

source: erection expense
ta: நிறுவுச் செலவு

source: exit load
ta: வெளியேறு கட்டணம்

source: expenses payable
ta: செலுத்தவேண்டிய செலவுகள்

source: face value
ta: முகமதிப்பு

source: fictitous asset(s)
ta: கற்பனைச் சொத்து(க்கள்)

source: final account
ta: இறுதி கணக்கு

source: finance & accounting
ta: நிதியியல் & கணக்கியல்

source: financial accounting
ta: நிதிநிலைக் கணக்கியல்

source: fixed asset
ta: நிலையான சொத்து

source: fixed capital
ta: நிலை மூலதனம்

source: fluctuating capital
ta: மாறும் மூலதனம்

source: forwarding
ta: மேலனுப்புகை

source: futures trading
ta: முன்பேர வணிகம், முன்பேர வர்த்தகம்

source: general ledger
ta: பொது பேரேடு

source: general partnership
ta: பொதுக் கூட்டாண்மை

source: gilt fund
ta: உயர் பாதுகாப்பு நிதி

source: going concern concept
ta: நிறுவனத் தொடர்ச்சி கருத்து

source: government company
ta: அரசு நிறுமம்

source: hire purchase
ta: தவணைமுறைக் கொள்முதல்

source: immovable property
ta: அசையாச் சொத்து

source: income and expenditure account
ta: வரவு செலவுக் கணக்கு

source: independent branch(es)
ta: தனித்தியங்கும் கிளை(கள்)

source: indirect expense(s)
ta: மறைமுக செலவினம்(ங்கள்)

source: individual depositor account
ta: தனிநபர் வைப்புத்தொகையாளர் கணக்கு

source: inflation
ta: பணவீக்கம்

source: initial public offer
ta: பங்கு வெளியீடு திட்டம்

source: insolvency
ta: நொடிப்பு

source: instrument of transfer
ta: உரிமை மாற்றுப் பத்திரம்

source: intangible asset(s)
ta: புலனாகாத சொத்து(க்கள்)

source: interest account
ta: வட்டிக் கணக்கு

source: inventories
ta: இருப்புச் சரக்கு

source: investment company
ta: முதலீட்டு நிறுமம்

source: joint stock company
ta: கூட்டுப் பங்கு நிறுமம்

source: joint venture
ta: இணைவினை, கூட்டு முயற்சி

source: ledger
ta: பேரேடு

source: limited company
ta: வரையறுக்கப்பட்ட நிறுமம்

source: limited partnership
ta: வரையறுத்தக் கூட்டாண்மை

source: loose leaf ledger
ta: விடுதாள் பேரேடு

source: magnetic ink charecter recognition (micr)
ta: காந்தெழுத்துணர்(வு)

source: market price
ta: சந்தை விலை

source: memorandum of understanding
ta: புரிந்துணர்வு ஒப்பந்தம்

source: merchandise
ta: வணிகச்சரக்கு

source: merchantile agent
ta: வணிக முகவர்

source: micr checque
ta: காந்தெழுத்துணர் காசோலை

source: money transfer
ta: பணமாற்றல்

source: mutual fund
ta: பரஸ்பர நிதி, சமநல நிதி

source: net asset value
ta: நிகர சொத்து மதிப்பு

source: net worth
ta: நிகர மதிப்பு

source: nominal asset(s)
ta: பெயரளவுச் சொத்து(க்கள்)

source: non-corporate enterprise
ta: கூட்டுருவாக்கம் பெறாத நிறுவனம்

source: obsolescence
ta: வழக்கற்றுப் போதல், வழக்கொழிந்த

source: open cheque
ta: கீறாக் காசோலை

source: option
ta: சூதம்

source: overdraft
ta: மேல்வரைப்பற்று

source: overhead
ta: மேற்செலவு

source: particular partnership
ta: குறிப்பிட்டக் கூட்டாண்மை

source: partition
ta: பிரிவினை

source: partner by estoppel
ta: முரண்தடை கூட்டாளி

source: partner by holding out
ta: உரிமைப் போலிக் கூட்டாளி

source: partnership
ta: கூட்டாண்மை

source: partnership deed
ta: கூட்டாண்மை ஒப்பாவணம்

source: partnership-at-will
ta: விருப்ப முறிக் கூட்டாண்மை

source: payments and receipts account
ta: செலுத்தல் பெறுதல் கணக்கு

source: petty cash
ta: சில்லரை ரொக்கம்

source: petty expense(s)
ta: சில்லரைச் செலவு(கள்)

source: planning period
ta: திட்டக் காலம்

source: policy
ta: கொள்கை

source: preferred share
ta: முன்னுரிமைப் பங்கு

source: preliminary expense
ta: தொடக்க செலவினம்

source: proceeding(s)
ta: நடவடிக்கை(கள்)

source: produce exchange
ta: விளைபொருள் மாற்றகம்

source: profit tax
ta: லாப வரி

source: proforma invoice
ta: வாங்குபொருள் விவரப்பட்டி

source: promissory note
ta: கடன் வாக்குறுதி

source: property account
ta: சொத்துக் கணக்கு

source: proporsal form
ta: காப்பீடு விண்ணப்பம், காப்புறுதி விண்ணப்பம்

source: proportional reserve system
ta: விகித காப்பு முறை

source: provident fund
ta: சேமநிதி

source: provision
ta: ஒதுக்கீடு

source: public corporation
ta: பொதுக் கூட்டுரு

source: public deposit
ta: பொது வைப்பு

source: public limited company
ta: வரையறுக்கப்பட்ட பொது நிறுமம்

source: published reserve
ta: வெளிப்படுத்தப்பட்டக் காப்பு

source: purchase order
ta: கொள்முதல் ஆணை

source: purchase returns book
ta: கொள்முதல் திருப்ப ஏடு

source: purchases book
ta: கொள்முதல் ஏடு

source: put option
ta: விற்றல் சூதம்

source: receipt
ta: பற்றுச்சீட்டு

source: rectification entry
ta: பிழை திருத்தப் பதிவுகள்

source: registration charge(s)
ta: பதிவுக் கட்டணம்(ங்கள்)

source: repo (repurchase agreement)
ta: மீள்வணிகம்

source: repo rate
ta: மீள்வாங்கல் வீதம்

source: reserve
ta: காப்பு

source: reserve fund
ta: காப்பு நிதி

source: revenue loss
ta: நடப்பிழப்பு

source: revenue reserve
ta: நடப்புக் காப்பு

source: risk
ta: இடர்

source: sales budget
ta: விற்பனை பொக்கீடு

source: sales returns book
ta: விறிபனை திருப்ப ஏடு

source: secret reserve
ta: இரகசியக் காப்பு

source: self balancing ledger
ta: தானே சரிகட்டிக்கொள்ளும் பேரேடு

source: seperate legal entity
ta: தனி சட்டஉரு

source: share
ta: பங்கு

source: share capital
ta: பங்கு மூலதனம்

source: share warrant
ta: பங்கு சான்றாணை

source: simple interest
ta: தனி வட்டி

source: single-entry system
ta: ஒற்றைப் பதிவு கணக்குமுறை

source: sinking fund
ta: கடனடைப்பு நிதி

source: sole proprietor
ta: தனிநபர் உரிமையாளர்

source: sole proprietorship/tradership
ta: தனியாள் வணிகம் (முறை)

source: sponsorship
ta: நல்கை

source: stock broker
ta: பங்குத் தரகர்

source: stock exchange
ta: பங்கு மாற்றகம்

source: stock market
ta: பங்குச் சந்தை

source: stock sheet
ta: சரக்குப் பட்டியல்

source: supply
ta: அளிப்பு

source: term deposite
ta: பருவகால வைப்பு

source: treasury bill
ta: கருவூல உறுதிச்சீட்டு

source: trial balance
ta: இருப்புநிலை சோதனை

source: trust account
ta: காப்பாளர் கணக்கு, தர்மகர்த்தா கணக்கு

source: unearned income
ta: ஈட்டப்படாத வருமானம்

source: unrestricted liability
ta: வரையறையற்றப் பொறுப்பு

source: value added tax
ta: மதிப்புக் கூட்டு வரி

source: voucher
ta: சான்றுச்சீட்டு
