{
  "title": "பங்காளிகள்",
  "description": "ராநிமெஅ இன் பங்காளிகள் ராக்கி லினக்ச் திட்டத்திற்கு மூலோபாய முக்கியத்துவம் வாய்ந்த உறவுகளைப் பிரதிநிதித்துவப்படுத்துகிறார்கள். பொறியியல் நிபுணத்துவம், உள்கட்டமைப்பு வளங்கள் அல்லது பிற வழிகளை அர்ப்பணிப்பதன் மூலம், அவற்றின் உதவி எங்கள் தொடர்ச்சியான செய் மற்றும் நீண்ட கால ச்திரத்தன்மைக்கு முக்கியமானது.",
  "partners": {
    "ciq": {
      "name": "சி.ஐ.க்",
      "tier": "நிறுவன பங்குதாரர்கள்",
      "blurb": "மக்களுக்குப் பெரிய காரியங்களைச் செய்ய உதவுவதில் நாங்கள் நம்புகிறோம். இதனால்தான் சிஐக் ராநிமெஅ இன் நிறுவன பங்குதாரர். ஆராய்ச்சி, கல்வி, அரசு, நிறுவனம், நிறுவனங்கள், கூட்டாளர்கள் மற்றும் இடையில் உள்ள அனைவரிடமும் வாடிக்கையாளர்களுக்கு ராக்கி லினக்சிற்கான வணிக உதவி மற்றும் சேவைகளை நாங்கள் வழங்குகிறோம்."
    },
    "arm": {
      "name": "கை",
      "tier": "முதன்மை பங்குதாரர்",
      "blurb": "கை அதன் கட்டிடக்கலை முதல் வகுப்புக் குடிமகன் என்பதை உறுதிப்படுத்த உறுதிபூண்டுள்ளது. நாங்கள் ராநிமெஅ உடன் கூட்டு சேர்ந்துள்ளோம், ராக்கி லினக்ச் மேம்பாடு மற்றும் சோதனை குழுக்களை நிறைவு செய்வதற்கான அர்ப்பணிப்பு பொறியியல் முயற்சிகளை வழங்குகிறோம், இப்போது மற்றும் எதிர்காலத்தில் நீண்ட காலமாகவும், நீண்ட காலமாகவும் சோதிக்கவும், சரிபார்க்கவும், ஆதரிக்கவும் நெருக்கமாக இணைந்து பணியாற்றுகிறோம்."
    },
    "equinix": {
      "name": "ஈக்வினிக்ச்",
      "tier": "முதன்மை பங்குதாரர்",
      "blurb": "ஈக்வினிக்ச் என்பது உலகின் டிசிட்டல் உள்கட்டமைப்பு நிறுவனம். டிசிட்டல் தலைவர்கள் எங்கள் நம்பகமான தளத்தை ஒன்றிணைத்து, அவர்களின் வெற்றிக்கு சக்திவாய்ந்த அடித்தள உள்கட்டமைப்பை ஒன்றிணைக்கவும்."
    },
    "fastly": {
      "name": "வேகமாக",
      "tier": "முதன்மை பங்குதாரர்",
      "blurb": "வேகமாக எட்ச் முகில் இயங்குதளம் வாடிக்கையாளர்களுக்குச் சிறந்த டிசிட்டல் அனுபவங்களை விரைவாகவும், பாதுகாப்பாகவும், நம்பத்தகுந்ததாகவும் உருவாக்க உதவுகிறது, எங்கள் வாடிக்கையாளர்களின் பயன்பாடுகளை முடிந்தவரை இறுதி பயனர்களுக்கு நெருக்கமாக-இணையத்தின் விளிம்பில்."
    },
    "mattermost": {
      "name": "முக்கியத்துவம்",
      "tier": "முதன்மை பங்குதாரர்",
      "blurb": "மேட்டர்மோச்ட் என்பது மிக உயர்ந்த பாதுகாப்புத் தேவைகளைக் கொண்ட நிறுவனங்களுக்காக உருவாக்கப்பட்ட ஒரு திறந்த மூல செய்தி தீர்வாகும். திறந்த மூலத்தின் சக்தியில் பெரிய விசுவாசிகள் என்ற வகையில், தொழில்நுட்ப சமூகத்திற்கு லினக்சின் நிறுவன-தர விநியோகத்தைக் கொண்டுவர உதவும் வகையில் ராநிமெஅ உடன் கூட்டாளராக மேட்டர்மோச்ட் மகிழ்ச்சியடைகிறார்."
    },
    "naver": {
      "name": "நாவர் முகில்",
      "tier": "முதன்மை பங்குதாரர்",
      "blurb": "நாவர் முகில் பிளாட்ஃபார்ம் என்பது தென் கொரிய முகில் சேவையாகும், இது 2017 இல் naver இன் துணை நிறுவனமான நாவர் கிளவுட்டின் கீழ் தொடங்கியது. இது 2021 ஆம் ஆண்டில் 170 க்கும் மேற்பட்ட தனிப்பட்ட சேவைகளை வழங்குகிறது மற்றும் சிஎச்ஏ ச்டார் கோல்ட், சிடிபிஆர் மற்றும் பலவற்றை உள்ளடக்கிய பல்வேறு பாதுகாப்பு சான்றிதழ்களை வைத்திருக்கிறது. இது தற்போது உலகெங்கிலும் 10 இடங்களில் முகில் சேவைகளையும் வழங்குகிறது."
    },
    "osl": {
      "name": "osu திறந்த மூல ஆய்வகங்கள்",
      "tier": "முதன்மை பங்குதாரர்",
      "blurb": "ஒரேகான் மாநில பல்கலைக்கழக திறந்த மூல ஆய்வகம் என்பது திறந்த மூல தொழில்நுட்பங்களின் முன்னேற்றத்திற்காக செயல்படும் ஒரு இலாப நோக்கற்ற அமைப்பாகும். திறந்த மூல மேலாண்மை மற்றும் நிரலாக்கத்தில் ஆர்வமுள்ள மாணவர்களுக்கு உறுதியளிப்பதற்கான உலகத் தகுதி வாய்ந்த ஓச்டிங் சேவைகள், தொழில்முறை மென்பொருள் மேம்பாடு மற்றும் தரையில் உள்ள பயிற்சி ஆகியவற்றை osl வழங்குகிறது."
    },
    "supermicro": {
      "name": "சூப்பர்மிக்ரோ",
      "tier": "முதன்மை பங்குதாரர்",
      "blurb": "உயர் செயல்திறன், உயர் திறன் கொண்ட சேவையக தொழில்நுட்பம் மற்றும் புதுமை சூப்பர்மிக்ரோ ஆகியவற்றில் உலகளாவிய தலைவராக resf உடன் இணைந்து பணியாற்றுவதற்கும், ராக்கி லினக்சுக்கு உகந்ததாக தரவு மைய சேவையகங்கள் மற்றும் சேமிப்பக அமைப்புகளை வழங்குவதற்கும் உற்சாகமாக உள்ளது."
    },
    "crowdin": {
      "name": "க்ரூடின்",
      "tier": "அடுக்கு 4 கூட்டாளர்"
    },
    "dsstudio": {
      "name": "டாட்ச்லாச் ச்டுடியோ",
      "tier": "அடுக்கு 4 கூட்டாளர்"
    },
    "fathom": {
      "name": "அடி",
      "tier": "அடுக்கு 4 கூட்டாளர்"
    }
  }
}
