{
  "title": "ஆதரவாளர்கள்",
  "description": "இந்த திட்டத்தில் இதுவரை ஆதரவாளர்களின் ஆதரவுக்கு நன்றி.",
  "tierone": "அடுக்கு 1 - முதன்மை",
  "tiertwo": "அடுக்கு 2",
  "tierthree": "அடுக்கு. 3",
  "tierfour": "அடுக்கு 4",
  "priorsponsors": ". முன்",
  "blurb": {
    "lineone": "ஒரு ஒப்புரவாளராக ஒப்புரவாளராக?",
    "linetwo": "இன்று.",
    "emailus": ". எங்களுக்கு"
  },
  "sponsors": {
    "ciq": {
      "name": "CIQ",
      "title": "ச்தாபக ஒப்புரவாளர்",
      "tier": 1,
      "blurb": "மக்களுக்கு பெரிய காரியங்களைச் செய்ய உதவுவதில் நாங்கள் நம்புகிறோம். இதனால்தான் ciq resf இன் ச்தாபக ஆதரவாளர். ஆராய்ச்சி, கல்வி, அரசு, நிறுவனம், நிறுவனங்கள், கூட்டாளர்கள் மற்றும் இடையில் உள்ள அனைவரிடமும் வாடிக்கையாளர்களுக்கு ராக்கி லினக்சிற்கான வணிக உதவி மற்றும் சேவைகளை நாங்கள் வழங்குகிறோம்."
    },
    "45drives": {
      "name": "45 டிரைவ்கள்",
      "title": "முதன்மை ஒப்புரவாளர்",
      "tier": 1,
      "blurb": "45 டிரைவ்ச் சக்திவாய்ந்த மற்றும் வலுவான திறந்த மூல மென்பொருளில் கட்டமைக்கப்பட்ட நிறுவன சேமிப்பக தீர்வுகளை வழங்குகிறது, இது வாடிக்கையாளர்களுக்கு செலவு சேமிப்பு மற்றும் ஆஃப்-தி-செல்ஃப் வன்பொருளின் நெகிழ்வுத்தன்மையிலிருந்து பயனடைய அனுமதிக்கிறது. டெராபைட்டுக்கு சிறந்த செலவில் முழுமையாக ஆதரிக்கப்பட்ட தரவு சேமிப்பக தீர்வுக்கு அவற்றைப் பாருங்கள்!"
    },
    "aws": {
      "name": "அமேசான் வலை சேவைகள்",
      "title": "முதன்மை ஒப்புரவாளர்",
      "tier": 1,
      "blurb": "ராக்கி லினக்சை ஆதரிக்கும் சேவைகளின் வளர்ச்சி மற்றும் வரிசைப்படுத்தலுக்கு முக்கியமான அடிப்படை உள்கட்டமைப்பை இயக்க resf aws ஐப் பயன்படுத்துகிறது. x86_64 மற்றும் aarch64 க்கான கோசி பில்டர்கள் முதல் ec2 இல் இயங்கும் s3 இல் srpm blob சேமிப்பு வரை, aws நாம் செய்யும் பெரும்பாலானவற்றிற்கு அடித்தளமாக உள்ளது."
    },
    "gcp": {
      "name": "கூகிள் முகில்",
      "title": "முதன்மை ஒப்புரவாளர்",
      "tier": 1,
      "blurb": "resf இன் முதன்மை ஆதரவாளராக, கூகிள் ஒரு இலவச, திறந்த, சமூக நிறுவன இயக்க முறைமையாக ராக்கி லினக்சின் முக்கியத்துவத்தை புரிந்துகொள்கிறது. சோதனை மற்றும் சரிபார்ப்புக்கான ஆதாரங்களை வழங்குவதன் மூலம், கூகிள் முகில் மேடையில் முதல் தரத்தில் முதல் தர குடிமகனாக ராக்கியின் நிலையை உறுதி செய்வதற்காக நாங்கள் resf உடன் கூட்டு சேர்ந்துள்ளோம்."
    },
    "azure": {
      "name": "நுண்மென் அசூர்",
      "title": "முதன்மை ஒப்புரவாளர்",
      "tier": 1,
      "blurb": "லினக்ச் என்பது அசூரில் வேகமாக வளர்ந்து வரும் தளமாகும், இது வி.எம் கோர்களில் பாதிக்கும் மேற்பட்டவற்றில் இயங்குகிறது. ஒரு தசாப்தத்திற்கும் மேலாக, மைக்ரோசாப்ட் லினக்சில் முதலீடு செய்து வருகிறது, மேலும் கூட்டாண்மைகள் மைக்ரோசாப்டின் திறந்த மூல மூலோபாயத்தின் மையத் தூணாக இருப்பதால், நாங்கள் resf மற்றும் பரந்த ராக்கி லினக்ச் சுற்றுச்சூழல் அமைப்புடன் ஒத்துழைக்கிறோம், வாடிக்கையாளர்களுக்கு லினக்ச் பணிச்சுமைகளை அசூர் மீது பயன்படுத்த அதிக விருப்பங்கள் இருப்பதை உறுதிசெய்கின்றன ஆதரிக்கப்பட்ட, நிர்வகிக்கப்பட்ட மற்றும் பாதுகாப்பான வழியில்."
    },
    "montavista": {
      "name": "மொன்டாவிச்டா",
      "title": "முதன்மை ஒப்புரவாளர்",
      "tier": 1,
      "blurb": "மொன்டாவிச்டா மென்பொருள் உட்பொதிக்கப்பட்ட வணிக லினக்சில் முன்னணியில் உள்ளது, இது மொன்டாவிச்டா சிசிஎக்ச், யோக்டோ ப்ராசெக்ட் ®்ப்பும், சென்டோச் மற்றும் ராக்கி லினக்ச் ஆகியவற்றை ஆதரிக்கிறது. மொன்டாவிச்டா திறந்த மூல மென்பொருள் நிபுணத்துவம், வணிக-தரமான லினக்ச் டிச்ட்ரோக்கள், செலவு குறைந்த பராமரிப்பு மற்றும் 10+ ஆண்டு வாழ்க்கை சுழற்சிகளுக்கு ஆதரவை வழங்குகிறது."
    },
    "opendrives": {
      "name": "opendrives",
      "title": "முதன்மை ஒப்புரவாளர்",
      "tier": 1,
      "blurb": "opendrives என்பது நிறுவன அளவிலான, மென்பொருள் வரையறுக்கப்பட்ட தரவு சேமிப்பக தீர்வுகளின் உலகளாவிய வழங்குநராகும். எங்கள் தொழில்நுட்பம் மிகவும் தேவைப்படும் பணிப்பாய்வுகளுக்கு -வளாகத்தில் மற்றும் மேகக்கட்டத்தில் வடிவமைக்கப்பட்டுள்ளது. திறந்த தரநிலைகள் மற்றும் நெறிமுறைகளுக்கான எங்கள் அர்ப்பணிப்பு ஒருங்கிணைப்புகளை எளிதாக்க உதவுகிறது, மேலும் வாடிக்கையாளர்கள் தங்கள் தரவை அணுகுவது, பயன்படுத்துவது, நகர்த்துவது மற்றும் பாதுகாப்பது எளிதானது. எங்களுக்கு தலைமையிடமாக கல்வர் சிட்டி, சி.ஏ."
    },
    "rakutensymphony": {
      "name": "ரகுடன் சிம்பொனி",
      "title": "முதன்மை ஒப்புரவாளர்",
      "tier": 1,
      "blurb": "ரகுடன் சிம்பொனி ஒரு வலுவான விசுவாசி, திறந்த மூல சமூகங்கள் ஒத்துழைப்பு மூலம் புதுமைகளை ஊக்குவிக்கின்றன. ராக்கி லினக்சின் வரிசைப்படுத்தல் என்பது திறந்த சமூகங்களால் இயக்கப்படும் உண்மையான திறந்த மூலக் கொள்கைகளுக்கு திரும்புவதைக் குறிக்கிறது. ராகுடன் சிம்பொனி தொலைத் தொடர்பு துறையில் மூன்றாம் தரப்பு விற்பனையாளர்கள் மற்றும் தொழில்நுட்ப பங்காளிகளின் பரந்த நிறமாலையுடன் நெருக்கமாக பணியாற்றி வருகிறது, இது ராக்கி லினக்சை பெரிய நெட்வொர்க்குகளை இயக்குவதற்கான நிலையான இயக்க முறைமையாக மாற்றுகிறது."
    },
    "vmware": {
      "name": "vmware",
      "title": "முதன்மை ஒப்புரவாளர்",
      "tier": 1,
      "blurb": "vmware என்பது அனைத்து பயன்பாடுகளுக்கும் மல்டி-கிளவுட் சேவைகளின் முன்னணி வழங்குநராகும், இது நிறுவன கட்டுப்பாட்டுடன் டிசிட்டல் கண்டுபிடிப்புகளை செயல்படுத்துகிறது."
    },
    "openlogic": {
      "name": "செயல்திறன் மூலம் ஓபன் லோசிக்",
      "title": "அடுக்கு 4 ஒப்புரவாளர்",
      "tier": 4
    },
    "procomputers": {
      "name": "procomputers.com",
      "title": "அடுக்கு 4 ஒப்புரவாளர்",
      "tier": 4
    },
    "seagate": {
      "name": "சீகேட் பெடரல்",
      "title": "அடுக்கு 4 ஒப்புரவாளர்",
      "tier": 4
    },
    "stromasys": {
      "name": "ச்ட்ரோசிச்",
      "title": "அடுக்கு 4 ஒப்புரவாளர்",
      "tier": 4
    }
  }
}
